{
  "title": "Paper_987",
  "abstract": "pmc Int J Environ Res Public Health Int J Environ Res Public Health 876 ijerph ijerph International Journal of Environmental Research and Public Health 1661-7827 1660-4601 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470180 PMC12470180.1 12470180 12470180 41007509 10.3390/ijerph22091365 ijerph-22-01365 1 Article Effect of Spherical Adsorptive Carbon Among Chronic Kidney Disease Patients: A Nationwide Cohort Study https://orcid.org/0009-0006-2120-3263 Shin Dong Hui Conceptualization Methodology Writing – original draft Park Keunryul Conceptualization Methodology Validation Writing – original draft https://orcid.org/0000-0003-3689-5865 Yang Jae Won Conceptualization Methodology Validation Writing – original draft https://orcid.org/0000-0001-8047-4190 Lee Jun Young Conceptualization Methodology Validation Writing – original draft Writing – review & editing Project administration Funding acquisition * Trevisan Andrea Academic Editor Department of Nephrology, Comprehensive Kidney Disease Research Institute, Wonju College of Medicine, Yonsei University, Wonju 26426, Republic of Korea; dhshin@yonsei.ac.kr hkspy.park@gmail.com kidney74@yonsei.ac.kr * junyoung07@yonsei.ac.kr 30 8 2025 9 2025 22 9 497640 1365 25 6 2025 24 8 2025 26 8 2025 30 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Spherical Adsorptive Carbon (SAC), a type of oral sorbent, is prescribed to chronic kidney disease (CKD) patients to remove uremic toxins. However, evidence regarding its effectiveness in delaying chronic kidney disease (CKD) progression remains insufficient. We aimed to evaluate the impact of SAC on CKD progression in patients with CKD stage 3 or higher using nationwide data. In this retrospective cohort study, we included patients diagnosed with CKD stage ≥3 from the Korea National Health Insurance System database between January 2020 and December 2022. Outcomes were compared between SAC users (N = 1289) and non-users (N = 1289) after 1:1 propensity score matching (PSM). After PSM, the time from index date to end-stage kidney disease (ESKD) was significantly longer in the SAC user group compared to the non-user group (246.8 days vs. 118.6 days, p cohort studies disease progression kidney diseases chronic renal replacement therapy survival analysis This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The prevalence of chronic kidney disease (CKD) has been steadily increasing, affecting approximately 10% of the population [ 1 2 2 3 4 2 5 Spherical Adsorptive Carbon (SAC) has emerged as a potential treatment to slow CKD progression through a different mechanism [ 6 7 8 9 9 10 11 12 Although randomized controlled trials (RCTs) have been conducted to evaluate the efficacy of SAC in patients with CKD, real-world effectiveness has not yet been assessed using national cohort data [ 6 8 10 11 13 2. Materials and Methods The data were selected from the anonymized Health Insurance Review and Assessment Service (HIRA) database, which assesses medical services and maintains quality standards by reviewing healthcare claims. The database includes patient demographics and detailed diagnostic data [ 14 This nationwide, population-based retrospective cohort study aimed to compare the time to ESKD onset and the risk of ESKD between patients using SAC and those not using SAC. Furthermore, we compared the risk of dialysis initiation between the two groups. 2.1. Study Population We initially identified 202,286 patients from the HIRA database who were diagnosed with CKD stage ≥3 between 2020 and 2022 in Korea. We then retrospectively extracted their data from 2018 to 2023. CKD stage ≥3 was operationally defined using the International Classification of Diseases, 10th Revision (ICD-10) codes N18.3, N18.4, and N18.5. Patients younger than 18 years old or above 80 years (n = 44,373), diagnosed with cancer, kidney transplantation (KT), CKD stage 4, or dialysis within one year before the first diagnosis of CKD stage 3 (n = 67,971), prescribed spherical adsorptive carbon before the first diagnosis of CKD stage 3 (n = 1771), who first diagnosed CKD stage 3 after 2022 (n = 33,000), who did not prescribe the SAC continuously for 90 days or more (n = 1078), who lost follow up (n = 40,672), who expired at CKD stage 3 diagnosis (n = 23), whose CKD stage 3 diagnosis date was the last visit date (n = 23), and a follow up date below seven days (n = 429) were excluded. These exclusions correspond to cases with missing or insufficient data for defining exposures or outcomes (e.g., early death, short follow-up), and imputation was not feasible in this claims-based dataset. After exclusion there were two kinds of patients who prescribed SAC (SAC group, n = 1082) and did not prescribe SAC (non-user group, n = 11,864). SAC exposure was defined based on the Health Insurance Review & Assessment (HIRA) service code ‘4597’ ( Figure 1 2.2. Propensity Score Matching To reduce immortal-time bias in the comparison between the SAC group and the non-user group, we randomly assigned the index date for the non-user group, while the SAC group was assigned the index date based on the SAC initiation date. Additionally, we matched the duration from CKD stage 3 to the index date, the year of the index date, and the quarter of CKD stage 3 diagnosis. Subsequently, we performed propensity score matching (PSM) in a 1:1 ratio using the greedy (nearest neighbor) matching between the SAC group and non-user group. The propensity score, which represents the probability of receiving SAC, was estimated using a logistic regression model. The model included baseline covariates such as age, sex, NSAID use, steroid use, ACE inhibitor or ARB use, cyclosporine use, SGLT2 inhibitor use, Charlson Comorbidity Index (CCI), hypertension (HTN), diabetes mellitus (DM), and dyslipidemia. After PSM, we evaluated covariate balance by calculating the standardized mean difference (SMD) between groups, with a value less than 0.1 considered acceptable. Details on the codes and medications used to define each diagnosis, procedure, and drug in this study are shown in Tables S1 and S2 2.3. Outcomes The primary outcome of this study was the time to ESKD, and the secondary outcomes were the initiation of dialysis and all-cause death. In addition, we planned a subgroup analysis stratified by the duration of drug use to explore whether long-term exposure to the SAC influences its efficacy. We operationally defined these outcomes based on ICD-10 codes, which were recorded as the primary and secondary diagnosis by a physician in either an inpatient or outpatient setting. In this study, we defined ESKD as who received dialysis (peritoneal dialysis, hemodialysis, or kidney transplantation or combination of those treatments). Therefore, ESKD was defined by codes N18.5 or N18.6, and initiation of dialysis was defined by codes Z49.1 or Z49.2 (which requires at least 3 months of maintenance hemodialysis or peritoneal dialysis or received immunosuppressive agents). The follow-up period was calculated from the index date to the date of the first outcome, the date of their last clinic visit, or the end of study period (31 December 2023), whichever came first. Subjects with a follow-up duration of less than 7 days or an average annual visit frequency of less than 6 times were excluded from the study based on exclusion criteria. 2.4. Statistical Analysis Baseline characteristics between the SAC and non-user groups, both before and after PSM, were compared using standardized mean difference (SMD). Categorical and continuous variables are presented as numbers, percentages, means, and standard deviations. In the PS-matched cohort, we used Kaplan–Meier survival curves and the log-rank test to compare the cumulative incidence of all events between the SAC and non-user groups. We compared the time to ESKD from index date between groups, with ESKD defined as an event of interest. Hazard ratios (HRs) for incidence of ESKD and dialysis were determined after PSM using univariate Cox regression models. Additionally, we analyzed the HRs for initiation of dialysis according to the total duration of drug administration (<180 days, 180–365 days, and >365 days). No specific handling for missing values was performed, and the raw data from the HIRA database were used for all analyses. All statistical analyses were performed using SAS Enterprise Guide, version 7 (SAS Institute Inc., Cary, NC, USA), and a p 3. Results 3.1. Baseline Characteristics The baseline characteristics of unmatched and matched patients are presented in Table 1 Table 1 Table 1 3.2. Comparison of Clinical Outcomes Between the SAC and Non-User Groups When reviewing the Kapan–Meier curves and performing the log-rank test for all events, the SAC user group demonstrated a significantly lower event rate ( p The duration from index date to the ESKD was significantly different between the two groups (246.8 days vs. 118.6 days, p Table 2 Table 3 Figure 2 In Cox regression analysis, the risk of dialysis was not significantly different between the SAC group and the non-user group (HR = 0.83, 95% CI: 0.27–2.59) ( Table 3 Table 4 4. Discussion In this nationwide cohort study conducted in South Korea, among patients with CKD, 1082 (8.4%) received SAC treatment between 2020 and 2022. After PSM analysis comparing these patients with 1289 SAC naïve 1082 CKD patients, SAC treatment was associated with a significantly lower risk of death and delayed progression of CKD (stage 3 or higher) to ESKD. SAC exerts its beneficial effects on CKD primarily by reducing intestinal absorption of uremic toxins, especially indoxyl sulfate (IS), thereby attenuating the progression of renal impairment. IS promotes CKD progression by inducing renal fibrosis, oxidative stress, and inflammation, impairing antioxidant systems in renal tubular and glomerular mesangial cells, and downregulating renal proximal tubule expression of klotho in animal models [ 15 16 17 18 19 20 17 18 21 22 23 24 21 25 Several studies have reported that SAC provides cardiovascular benefits for patients with CKD. In the CKD rat model, SAC reduced oxidative stress, which is closely linked to cardiac hypertrophy and fibrosis [ 26 27 28 29 Despite these promising findings, the clinical effectiveness of SAC remains controversial. Some retrospective cohort studies reported a reduction in mortality risk, similar to our findings [ 29 30 31 10 13 32 33 34 33 34 The controversy regarding the therapeutic effectiveness of SAC may be attributed to the following factors. First, most frequent limitation of SAC treatment is the need of a high dose of drugs. However, like our study, most of the studies did not report compliance of medication. There has been a report from Japan indicating that approximately 70% of patients experience medication adherence issues with SAC due to problems such as the required dosage amount, the frequency of administration, the necessity of taking it separately from other medications, and gastrointestinal disturbances [ 35 In our study, the hazard ratio for ESKD was significantly reduced in the SAC group, whereas the hazard ratio for dialysis initiation did not reach statistical significance. This discrepancy may be explained by differences in outcome definitions and operational characteristics. ESKD was defined as a composite endpoint including dialysis initiation, kidney transplantation, and diagnostic codes, whereas dialysis initiation alone represents a narrower definition and thus a smaller number of events, leading to lower statistical power. In addition, patients who died before starting dialysis were censored in the dialysis analysis, which could attenuate the apparent effect of SAC on this outcome. The initiation of dialysis is also influenced by physician judgment, patient preference, and reimbursement policies, introducing greater variability compared with the more standardized definition of ESKD. Finally, the relatively short follow-up period in some patients may have further contributed to these differences. Together, these factors may explain the observed discrepancy and highlight the need for careful interpretation of dialysis-specific outcomes in claims-based studies. Our study has several limitations. First, due to the inherent limitations of the claims database, we could not obtain detailed clinical information, such as laboratory results, exact SAC dosages, or primary kidney disease. Consequently, CKD stages could not be determined by creatinine and urine albumin levels, as recommended by the KDIGO guidelines, but were instead identified using ICD codes. In addition, we were unable to evaluate the use of cyclophosphamide or to distinguish the exact type of RAAS blockers, because such information was not available in the claims data. Therefore, selection bias associated with these unmeasured factors could not be entirely excluded. Second, we could not assess actual medication adherence (e.g., proportion of days covered) or long-term treatment persistence. While the data confirm the dispending of SAC prescriptions, they do not indicate whether the medication was taken as prescribed, for how long, or if it was taken continuously without interruption. Therefore, the prescription duration may not accurately reflect the actual treatment exposure. In addition, we performed a subgroup analysis stratified by the duration of drug use to explore whether long-term exposure to SAC influences its efficacy. While these findings provided additional insights, they should be interpreted with caution, as the subgroup analyses were exploratory in nature and no formal adjustment for multiple comparisons was applied. Potential sources of bias, such as immortal time bias or healthy user effects, may also have influenced the results, particularly in the long-duration group. 5. Conclusions In conclusion, SAC treatment was associated with a lower risk of all-cause mortality and a delay in CKD progression, suggesting a potential clinical benefit in patients with stage 3 CKD. While these findings highlight a favorable risk–benefit profile, the retrospective and observational design imposes limitations. Therefore, confirmation through high-quality, large-scale, multicenter prospective randomized controlled trials is essential to establish the role of SAC in CKD management. Acknowledgments We acknowledge that the subgroup analyses according to duration of drug use were exploratory and may be subject to potential biases, including immortal time bias and healthy user effects. Moreover, no adjustment for multiple testing was performed. These limitations should be taken into account when interpreting our findings. This work was supported by the Korea Health Technology R&D Project through the Korea Health Industry Development Institute (KHIDI) and funded by the Ministry of Health & Welfare, Republic of Korea (RS-2024-00439231). Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ijerph22091365/s1 Author Contributions Conceptualization, D.H.S., K.P., J.W.Y. and J.Y.L.; methodology, D.H.S., K.P., J.W.Y. and J.Y.L.; software, D.H.S., K.P., J.W.Y. and J.Y.L.; validation, D.H.S., K.P., J.W.Y. and J.Y.L.; formal analysis, J.Y.L.; investigation, J.Y.L.; resources, J.Y.L.; data curation, J.Y.L.; writing—original draft preparation, D.H.S., K.P., J.W.Y. and J.Y.L.; writing—review and editing, D.H.S., K.P., J.W.Y. and J.Y.L.; visualization, D.H.S., K.P., J.W.Y. and J.Y.L.; supervision, J.Y.L.; project administration, J.Y.L.; funding acquisition, J.Y.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study received ethical approval from the Institutional Review Board of the Wonju Severance Christian Hospital ( CR320362 Informed Consent Statement The need for informed consent was waived because the statistical analyses were conducted using the HIRA data, which modifies the information of de-identifiable individuals. Data Availability Statement HIRA provides data with the approval of HIRA through the Korean Health Insurance Review and Assessment Service ( https://www.hira.or.kr/main.do Conflicts of Interest The authors declare no conflicts of interest. References 1. Hill N.R. Fatoba S.T. Oke J.L. Hirst J.A. O’Callaghan C.A. Lasserson D.S. Hobbs F.D.R. Global prevalence of chronic kidney disease–a systematic review and meta-analysis PLoS ONE 2016 11 e0158765 10.1371/journal.pone.0158765 27383068 PMC4934905 2. Murphy D. McCulloch C.E. Lin F. Banerjee T. Bragg-Gresham J.L. Eberhardt M.S. Morgenstern H. Pavkov M.E. Saran R. Powe N.R. Trends in prevalence of chronic kidney disease in the United States Ann. Intern. Med. 2016 165 473 481 10.7326/M16-0273 27479614 PMC5552458 3. Lee M.-J. Ha K.H. Kim D.J. Park I. Trends in the Incidence, Prevalence, and Mortality of End-Stage Kidney Disease in South Korea Diabetes Metab. J. 2020 44 933 937 10.4093/dmj.2020.0156 33389960 PMC7801765 4. Sarafidis P. Ferro C.J. Morales E. Ortiz A. Malyszko J. Hojs R. Khazim K. Ekart R. Valdivielso J. Fouque D. SGLT-2 inhibitors and GLP-1 receptor agonists for nephroprotection and cardioprotection in patients with diabetes mellitus and chronic kidney disease. A consensus statement by the EURECA-m and the DIABESITY working groups of the ERA-EDTA Nephrol. Dial. Transplant. 2020 35 1825 10.1093/ndt/gfz137 31397476 5. Tarun T. Ghanta S.N. Ong V. Kore R. Menon L. Kovesdy C. Mehta J.L. Jain N. Updates on New Therapies for Patients with CKD Kidney Int. Rep. 2024 9 16 28 10.1016/j.ekir.2023.10.006 38312786 PMC10831355 6. Asai M. Kumakura S. Kikuchi M. Review of the efficacy of AST-120 (KREMEZIN ® Ren. Fail. 2019 41 47 56 10.1080/0886022X.2018.1561376 30732506 PMC6374968 7. Niwa T. Nomura T. Sugiyama S. Miyazaki T. Tsukushi S. Tsutsui S. The protein metabolite hypothesis, a model for the progression of renal failure: An oral adsorbent lowers indoxyl sulfate levels in undialyzed uremic patients Kidney Int. Suppl. 1997 62 S23 S28 9350673 8. Toyoda S. Kikuchi M. Komatsu T. Hori Y. Nakahara S. Kobayashi S. Sakai Y. Inoue T. Taguchi I. Impact of the oral adsorbent AST-120 on oxidative stress and uremic toxins in high-risk chronic kidney disease patients Int. J. Cardiol. 2014 177 705 707 10.1016/j.ijcard.2014.09.196 25449490 9. Niwa T. Ise M. Miyazaki T. Progression of glomerular sclerosis in experimental uremic rats by administration of indole, a precursor of indoxyl sulfate Am. J. Nephrol. 1994 14 207 212 10.1159/000168716 7977482 10. Schulman G. Agarwal R. Acharya M. Berl T. Blumenthal S. Kopyt N. A multicenter, randomized, double-blind, placebo-controlled, dose-ranging study of AST-120 (Kremezin) in patients with moderate to severe CKD Am. J. Kidney Dis. 2006 47 565 577 10.1053/j.ajkd.2005.12.036 16564934 11. Lee C.-T. Hsu C.-Y. Tain Y.-L. Ng H.-Y. Cheng B.-C. Yang C.-C. Wu C.-H. Chiou T.T.-Y. Lee Y.-T. Liao S.-C. Effects of AST-120 on blood concentrations of protein-bound uremic toxins and biomarkers of cardiovascular risk in chronic dialysis patients Blood Purif. 2014 37 76 83 10.1159/000357641 24576840 12. Nakamura T. Sato E. Fujiwara N. Kawagoe Y. Suzuki T. Ueda Y. Yamagishi S.-I. Oral adsorbent AST-120 ameliorates tubular injury in chronic renal failure patients by reducing proteinuria and oxidative stress generation Metabolism 2011 60 260 264 10.1016/j.metabol.2010.01.023 20189611 13. Cha R.-H. Kang S.W. Park C.W. Cha D.R. Na K.Y. Kim S.G. Yoon S.A. Han S.Y. Chang J.H. Park S.K. A Randomized, Controlled Trial of Oral Intestinal Sorbent AST-120 on Renal Function Deterioration in Patients with Advanced Renal Dysfunction Clin. J. Am. Soc. Nephrol. 2016 11 559 567 10.2215/CJN.12011214 26912554 PMC4822676 14. Kim L. Kim J.-A. Kim S. A guide for the utilization of Health Insurance Review and Assessment Service National Patient Samples Epidemiol. Health 2014 36 e2014008 10.4178/epih/e2014008 25078381 PMC4151963 15. Okada K. Takahashi S. Nagura Y. Hatano M. Shimamura T. Early morphological changes of tubules in rats with chronic renal failure Nihon Jinzo Gakkai Shi 1992 34 65 70 1593798 16. Owada S. Goto S. Bannai K. Hayashi H. Nishijima F. Niwa T. Indoxyl sulfate reduces superoxide scavenging activity in the kidneys of normal and uremic rats Am. J. Nephrol. 2008 28 446 454 10.1159/000112823 18160814 17. Gelasco A.K. Raymond J.R. Indoxyl sulfate induces complex redox alterations in mesangial cells Am. J. Physiol. Renal. Physiol. 2006 290 F1551 F1558 10.1152/ajprenal.00281.2004 16434574 18. Motojima M. Hosokawa A. Yamato H. Muraki T. Yoshioka T. Uremic toxins of organic anions up-regulate PAI-1 expression by induction of NF-kappaB and free radical in proximal tubular cells Kidney Int. 2003 63 1671 1680 10.1046/j.1523-1755.2003.00906.x 12675842 19. Shimizu H. Bolati D. Adijiang A. Adelibieke Y. Muteliefu G. Enomoto A. Higashiyama Y. Higuchi Y. Nishijima F. Niwa T. Indoxyl sulfate downregulates renal expression of Klotho through production of ROS and activation of nuclear factor-kB Am. J. Nephrol. 2011 33 319 324 10.1159/000324885 21389697 20. Niwa T. Tsukushi S. Ise M. Miyazaki T. Tsubakihara Y. Owada A. Shiigai T. Indoxyl sulfate and progression of renal failure: Effects of a low-protein diet and oral sorbent on indoxyl sulfate production in uremic rats and undialyzed uremic patients Miner. Electrolyte Metab. 1997 23 179 184 9387112 21. Ueda S. Yamagishi S.-I. Takeuchi M. Kohno K. Shibata R. Matsumoto Y. Kaneyuki U. Fujimura T. Hayashida A. Okuda S. Oral adsorbent AST-120 decreases serum levels of AGEs in patients with chronic renal failure Mol. Med. 2006 12 180 184 10.2119/2005-00034.Ueda 17088950 PMC1626600 22. Niwa T. Yazawa T. Ise M. Sugano M. Kodama T. Uehara Y. Maeda K. Inhibitory effect of oral sorbent on accumulation of albumin-bound indoxyl sulfate in serum of experimental uremic rats Nephron 1991 57 84 88 10.1159/000186222 1904558 23. Okada K. Shibahara H. Takahashi S. Effect of oral adsorbent on the progression of diabetic nephropathy Nephron 1997 76 489 490 10.1159/000190236 9274851 24. Kobayashi N. Maeda A. Horikoshi S. Shirato I. Tomino Y. Ise M. Effects of oral adsorbent AST-120 (Kremezin) on renal function and glomerular injury in early-stage renal failure of subtotal nephrectomized rats Nephron 2002 91 480 485 10.1159/000064291 12119481 25. Owada A. Nakao M. Koike J. Ujiie K. Tomita K. Shiigai T. Effects of oral adsorbent AST-120 on the progression of chronic renal failure: A randomized controlled study Kidney Int. Suppl. 1997 63 S188 S190 9407455 26. Fujii H. Nishijima F. Goto S. Sugano M. Yamato H. Kitazawa R. Kitazawa S. Fukagawa M. Oral charcoal adsorbent (AST-120) prevents progression of cardiac damage in chronic kidney disease through suppression of oxidative stress Nephrol. Dial. Transplant. 2009 24 2089 2095 10.1093/ndt/gfp007 19188341 27. Ito S. Higuchi Y. Yagi Y. Nishijima F. Yamato H. Ishii H. Osaka M. Yoshida M. Reduction of indoxyl sulfate by AST-120 attenuates monocyte inflammation related to chronic kidney disease J. Leukoc. Biol. 2013 93 837 845 10.1189/jlb.0112023 23362306 28. Nakamura T. Kawagoe Y. Matsuda T. Ueda Y. Shimada N. Ebihara I. Koide H. Oral ADSORBENT AST-120 decreases carotid intima-media thickness and arterial stiffness in patients with chronic renal failure Kidney Blood Press. Res. 2004 27 121 126 10.1159/000077536 15051932 29. Sato E. Tanaka A. Oyama J.-I. Yamasaki A. Shimomura M. Hiwatashi A. Ueda Y. Amaha M. Nomura M. Matsumura D. Long-term effects of AST-120 on the progression and prognosis of pre-dialysis chronic kidney disease: A 5-year retrospective study Hear. Vessel. 2016 31 1625 1632 10.1007/s00380-015-0785-7 26699900 30. Lee C.-L. Liu W. Tsai S.-F. Effects of AST-120 on mortality in patients with chronic kidney disease modeled by artificial intelligence or traditional statistical analysis Sci. Rep. 2024 14 738 10.1038/s41598-024-51498-6 38184721 PMC10771424 31. Ueda H. Shibahara N. Takagi S. Inoue T. Katsuoka Y. AST-120 treatment in pre-dialysis period affects the prognosis in patients on hemodialysis Ren. Fail. 2008 30 856 860 10.1080/08860220802356531 18925523 32. Hatakeyama S. Yamamoto H. Okamoto A. Imanishi K. Tokui N. Okamoto T. Suzuki Y. Sugiyama N. Imai A. Kudo S. Effect of an oral adsorbent, AST-120, on dialysis initiation and survival in patients with chronic kidney disease Int. J. Nephrol. 2012 2012 376128 10.1155/2012/376128 22288014 PMC3263620 33. Akizawa T. Asano Y. Morita S. Wakita T. Onishi Y. Fukuhara S. Gejyo F. Matsuo S. Yorioka N. Kurokawa K. Effect of a carbonaceous oral adsorbent on the progression of CKD: A multicenter, randomized, controlled trial Am. J. Kidney Dis. 2009 54 459 467 10.1053/j.ajkd.2009.05.011 19615804 34. Schulman G. Berl T. Beck G.J. Remuzzi G. Ritz E. Arita K. Kato A. Shimizu M. Randomized Placebo-Controlled EPPIC Trials of AST-120 in CKD J. Am. Soc. Nephrol. 2015 26 1732 1746 10.1681/ASN.2014010042 25349205 PMC4483576 35. Tomino Y. Hisada-Urita A. Seki T. Watanabe T. Kanda R. Takahashi T. Importance of AST-120 (Kremezin ® Case Rep. Nephrol. Dial. 2018 8 107 111 10.1159/000489772 29998125 PMC6031942 Figure 1 Flow diagram of study patients. Figure 2 Kaplan–Meier curve for survival. ijerph-22-01365-t001_Table 1 Table 1 Baseline characteristics of two groups before and after matching.  Before Matching (N = 12,946) After Matching (N = 2164) SAC Group Non-User Group SMD SAC Group Non-User Group SMD (N = 1082) (N = 11,864)  (N = 1082) (N = 1082)  Quarter of CKD stage 3   0.085   0.000 202001 103 (9.52) 1100 (9.27)  103 (9.52) 103 (9.52)  202002 124 (11.46) 1231 (10.38)  124 (11.46) 124 (11.46)  202003 132 (12.20) 1401 (11.81)  132 (12.20) 132 (12.20)  202004 113 (10.44) 1406 (11.85)  113 (10.44) 113 (10.44)  202101 116 (10.72) 1483 (12.50)  116 (10.72) 116 (10.72)  202102 156 (14.42) 1556 (13.12)  156 (14.42) 156 (14.42)  202103 152 (14.05) 1613 (13.60)  152 (14.05) 152 (14.05)  202104 186 (17.19) 2074 (17.48)  186 (17.19) 186 (17.19)  Duration from CKD stage 3 to index date  0.810   0.000 Months 2.98 (3.90) 6.38 (4.47)  2.98 (3.90) 2.98 (3.90)  Year of index date   0.462   0.000 2020 335 (30.96) 2221 (18.72)  335 (30.96) 335 (30.96)  2021 579 (53.51) 5704 (48.08)  579 (53.51) 579 (53.51)  2022 167 (15.43) 3769 (31.77)  167 (15.43) 167 (15.43)  2023 1 (0.09) 170 (1.43)  1 (0.09) 1 (0.09)  Age, years 63.09 (12.23) 65.85 (11.80) 0.229 63.09 (12.23) 64.11 (12.05) 0.084 Sex, male (%) 827 (76.43) 7595 (64.02) 0.274 827 (76.43) 834 (77.08) 0.015 Prior medication, n (%)       NSAID 926 (85.58) 10,312 (86.92) 0.039 926 (85.58) 951 (87.89) 0.068 Steroid 733 (67.74) 8204 (69.15) 0.030 733 (67.74) 740 (68.39) 0.014 ACE Inhibitor or ARBs 825 (76.25) 8398 (70.79) 0.124 825 (76.25) 840 (77.63) 0.033 Cyclosporine or Tacrolimus 36 (3.33) 363 (3.06) 0.015 36 (3.33) 31 (2.87) 0.027 SGLT2 Inhibitor 227 (20.98) 2313 (19.5) 0.037 227 (20.98) 230 (21.26) 0.007 CCI Group, n (%)      0.073 0~2 310 (28.65) 3756 (31.66)  310 (28.65) 279 (25.79)  3~5 492 (45.47) 5129 (43.23)  492 (45.47) 496 (45.84)  6~8 234 (21.63) 2441 (20.57)  234 (21.63) 258 (23.84)  ≥9 46 (4.25) 538 (4.53)  46 (4.25) 49 (4.53)  Other comorbidity, n (%)       Hypertension 1043 (96.40) 11,060 (93.22) 0.143 1043 (96.40) 1048 (96.86) 0.026 Diabetes mellitus 950 (87.80) 9573 (80.59) 0.196 950 (87.80) 973 (89.93) 0.068 Dyslipidemia 1040 (96.12) 11,164 (94.1) 0.094 1040 (96.12) 1048 (96.86) 0.040 Abbreviations: ACE = angiotensin converting enzyme; ARB = angiotensin receptor blocker; CCI = Charlson comorbidity index; CKD = chronic kidney disease; N = number; NSAIDs = non-steroidal anti-inflammatory drugs; SAC = spherical adsorptive carbon; SGLT2i = sodium-glucose cotransporter 2 inhibitor; SMD = standard mean difference. ijerph-22-01365-t002_Table 2 Table 2 Time to ESKD (days) and hazard ratio of ESKD according to SAC use after matching.  SAC User Group Non-User Group p Events, No. (%) 153 (14.14) 115 (10.63)  Time to events, days    Mean(SD) 246.8 (106.0) 118.6 (109.2) <0.0001 * Q1, Q3 98, 388 18, 118  Incidence rate, per 100 PY 15.75 15.35  Crude HR (95% CI) 0.37 (0.29–0.48) Ref. <0.0001 ** * Mann–Whitney U test. ** Cox regression model. Abbreviations: PY = person-year; HR = hazard ratio. ijerph-22-01365-t003_Table 3 Table 3 Number of events, incidence rates, and Cox proportional hazard ratio of dialysis and death after matching.  SAC User Group Non-User Group Crude HR p (N = 1082) (N = 1082) Dialysis     Events, No.(%) 5 (2.65) 8 (2.96)   Incidence rate, per 100 PY 0.51 1.07 0.83 (0.27–2.59) 0.7519 Death     Events, No.(%) 31 (16.4) 147 (54.44)   Incidence rate, per 100 PY 3.19 19.62 0.32 (0.21–0.48) <0.0001 Abbreviations: PY = person-year; HR = hazard ratio. ijerph-22-01365-t004_Table 4 Table 4 Hazard ratio of dialysis according to SAC prescription days. SAC Prescription Days HR * (95% CI) p 90–179 days 1.50 (0.75–3.43) 0.2237 180–364 days 0.36 (0.11–1.23) 0.1035 365 days 0.25 (0.08–0.87) 0.0285 * Ref: Non-user group. ",
  "metadata": {
    "Title of this paper": "Importance of AST-120 (Kremezin",
    "Journal it was published in:": "International Journal of Environmental Research and Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470180/"
  }
}