{
  "title": "Paper_29",
  "abstract": "pmc J Occup Health J Occup Health 3162 joccuphealth joh Journal of Occupational Health 1341-9145 1348-9585 Oxford University Press PMC12490205 PMC12490205.1 12490205 12490205 40990970 10.1093/joccuh/uiaf051 uiaf051 1 Review Article AcademicSubjects/MED00010 AcademicSubjects/MED00640 Effectiveness of work ability interventions on productivity: a systematic review https://orcid.org/0009-0004-1332-102X Kekkonen Pasi  Department of Occupational Health, Finnish Institute of Occupational Health Helsinki Finland  Department of Health and Social Management, University of Eastern Finland Kuopio Finland Savolainen Eija  Department of Health and Social Management, University of Eastern Finland Kuopio Finland Immonen Mari  Department of Occupational Health, Finnish Institute of Occupational Health Helsinki Finland https://orcid.org/0000-0001-6552-4647 Kangas Pauliina  Department of Occupational Health, Finnish Institute of Occupational Health Helsinki Finland https://orcid.org/0000-0002-4710-9084 Rissanen Elisa  Department of Health and Social Management, University of Eastern Finland Kuopio Finland https://orcid.org/0000-0003-0178-8111 Linnosmaa Ismo  Department of Health and Social Management, University of Eastern Finland Kuopio Finland Corresponding author: Pasi Kekkonen, ( pasi.kekkonen@ttl.fi pasi.kekkonen@uef.fi Jan-Dec 2025 24 9 2025 67 1 479434 uiaf051 07 5 2025 11 8 2025 21 8 2025 01 10 2025 24 09 2025 03 10 2025 03 10 2025 © The Author(s) [2025]. Published by Oxford University Press on behalf of the Japan Society for Occupational Health 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0/  Key points: What is already known on this topic: What this study adds: How this study might affect research, practice, or policy: Abstract  Objectives  Methods  Results  Conclusions absenteeism effectiveness intervention presenteeism productivity work ability Social Insurance Institution of Finland 10.13039/501100002327 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The dependency ratio is deteriorating globally due to factors such as population aging and low birth rates. It is projected that the dependency ratio will continue to decline. This poses challenges not only in terms of sufficient workforce availability but also in maintaining or improving the work ability of the working-age population and preventing disability. These challenges regarding demographic change also increase the pressure to enhance productivity. These issues have been recognized at the societal level as well as in workplaces in many European countries. Various interventions have been developed to maintain or improve the work ability of the working-age population. Work ability interventions might also influence productivity, but evidence on how these interventions affect productivity across various settings and study designs has not yet been comprehensively synthesized. Work ability is defined in 2 ways: specific work ability and general work ability. Specific work ability concerns specific jobs that require special training, and the job-specific virtues, within an acceptable work environment. General work ability concerns the capability to perform a basic job that most people can do after minimal training, and it is dependent on a person’s general health, basic skills, and the work environment. 1 Productivity is defined as a ratio of output volume to input use volume. 2 3 4 5 , 6 Productivity costs refer to the costs related to production losses from both paid and unpaid work, as well as the costs of replacing individuals due to illness, disability, or death. 5 5 Table 1 Inclusion criteria for studies.  PICOS elements  Inclusion criteria Population The target population consists of working-age individuals as defined in the articles Intervention The intervention’s primary aim had to be the improvement or maintenance of work ability, and studies were excluded if they focused on ergonomics Comparison Comparators were mandatory, such as another intervention or no intervention Outcomes Outcomes had to be productivity related; eg, productivity, productivity losses, or productivity costs, and measured subjectively or objectively Study design Randomized controlled trials (RCTs), nonrandomized controlled trials (NRCTs), and economic evaluations Two previous systematic reviews have examined the effectiveness of workplace interventions or worksite wellness interventions on productivity, focusing on randomized controlled trials (RCTs). 7 , 8 7 8 9 Previous research has primarily focused on interventions implemented in the workplace, thereby excluding those conducted outside the workplace, such as interventions in health care or occupational health services aimed at improving the return to work or interventions that aim to improve employability. Moreover, these studies have focused on RCT settings, thereby excluding register-based real-world evidence studies. Consequently, the effectiveness of interventions designed to improve or maintain work ability on productivity, regardless of setting and design, remains unclear. The aim of this study was to synthesize the research information of effectiveness of work ability interventions on productivity, productivity losses, and productivity costs. Therefore, the research question we explored was: What is the effectiveness of work ability interventions on productivity outcomes? 2. Methodology Reporting of this systematic review was done in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses, PRISMA 2020 statement. 10 11 2.1. Eligibility criteria The inclusion criteria were based on the Population, Intervention, Comparison, and Study design (PICOS) elements, which consider the study design of the articles. 12 Table 1 2.2. Definition of the outcomes Two criteria were required for defining a work ability intervention to be included in this review. First, the intervention needed to aim at improving or maintaining work ability. For instance, a specified task gets easier if aerobic capacity improves. If the intervention improves this capacity, fulfilling job requirements gets easier. Additionally, the article had to provide a definition of the work ability. Interventions that primarily aimed at healing a specific disease or condition, such as medical treatments, surgical procedures, or treatments meant to heal only depression, were not considered as work ability interventions. An expert in the field of work ability was consulted if it was unclear whether an intervention could be treated as a work ability intervention. Productivity-related outcomes included in this systematic review were productivity, productivity losses, and productivity costs. Productivity can be measured objectively, for example, from a database, and/or subjectively with a questionnaire. Productivity losses were defined as presenteeism and absenteeism. 2.3. Information sources and search strategy Based on preliminary searches, which were conducted in March 2024, the effectiveness of work ability interventions on productivity outcomes has been studied extensively. A systematic search was conducted in December 2024 across the following databases: EBSCO, ProQuest, Scopus, Web of Science, and PubMed. The search strategy used productivity, work ability, and intervention-related words (intervention, program*, treatment) in combinations. Deviating from the protocol, we decided to include “presenteeism” and “absenteeism” in our search strategy, as these terms are relevant and appear also independently of the term “productivity”. Another deviation from the protocol was that we decided to search for relevant references cited by the included articles and added them to the search results. This method, known as the snowball effect, is an alternative approach used to discover additional evidence that was not retrieved through a conventional search. 13 Figure S1 2.4. Study selection The references were imported into the web-based systematic review tool Covidence, 14 15 2.5. Quality assessment The quality of the included studies was assessed by 2 independent reviewers. The assessment was conducted using the Cochrane Risk of Bias Tool for RCTs (RoB 2 tool), 16 , 17 18 Studies of low quality were excluded from further analysis. RCTs and cluster RCTs were included if the overall result was at low risk of bias or raised some concerns. Studies were excluded if the overall risk of bias was high. An article was deemed at high risk of bias if at least 1 domain was at high risk, or over 50% of the domains raised some concerns. NRCTs were included in the final review if the overall risk of bias was judged to be at least moderate. Studies were excluded if the overall risk of bias was judged to be serious or critical. A study was deemed to be at serious risk of bias if at least 1 domain was at serious risk, and it was judged to be at critical risk of bias if at least 1 domain was at critical risk. The threshold for the inclusion of the economic evaluation was a score of at least 50%. 2.6. Data extraction and analysis Data were independently extracted from the studies into Excel worksheets by the 2 reviewers, who discussed and reached consensus on the extracted information. If consensus could not be achieved, a third reviewer was consulted. The Excel worksheets were created, and extracted data were collected using the help of the items from the RoB 2 tool 16 17 18 19 Narrative evidence tables were created from the extracted data to describe the characteristics of the included studies and the details of the work ability interventions. Additionally, an evidence table was developed to address the review question. 3. Results A total of 1863 articles were identified ( Figure 1 n n n n 15 Figure 1 Prisma flow diagram of the studies included in the systematic review. Modified figure from Covidence. 14 A total of 55 articles proceeded to the quality assessment stage, of which 29 articles passed the quality assessment. 20 - 48 20 - 23 , 25 - 30 , 33 - 44 , 46 , 47 24 , 31 , 32 , 45 , 48 35 , 38 , 40 - 42 n 49 - 74 50 - 52 , 54 - 56 , 58 , 59 , 62 - 64 , 66 - 69 , 71 , 73 , 74 49 , 53 , 57 , 60 , 61 , 65 , 70 , 72 3.1. Quality of the studies All included RCTs ( n n n n n n Table S1 Table S2 Table S3 The randomization process and handling of missing data were well performed in the included studies. In addition, risk of bias due to deviations from the intended interventions was generally well addressed. The most common quality flaw among included RCTs was the risk of bias in outcome measurement, which received the highest number of moderate risk-of-bias judgments, followed by the risk of bias in the selection of reported results. Of the included RCTs that also conducted an economic evaluation, 3 35 , 41 , 42 38 40 Among included NRCTs, biases related to participant selection, intervention classification, deviations from intended interventions and missing data were well avoided. The most common quality flaw was bias due to confounding, resulting in moderate risk of bias in all studies, followed by bias in outcome measurement. The most common quality flaw among excluded RCTs was bias due to missing data, which received the highest number of high risk-of-bias judgments, followed by bias arising from deviations from the intended interventions. Among NRCTs, missing data were poorly handled, resulting in serious or high risk of bias in every study that provided this information. 3.2. Characteristics of the included studies Overall, 29 studies were included in this systematic review. Most of the studies were conducted in Denmark ( n 21 , 22 , 25 , 26 , 28 , 29 , 33 , 36 , 46 n 31 , 32 , 34 , 38 , 39 n 35 , 40 - 43 n 30 , 44 , 45 n 27 , 37 , 48 n 23 , 24 n , 47 n 20 Of the included studies implementing work ability interventions to improve productivity-related outcomes (productivity, absenteeism, presenteeism, or productivity costs), 15 were standard RCTs, 20 , 21 , 23 , 25 , 27 , 29 , 30 , 34 , 37 , 38 , 40 , 41 , 43 , 46 , 47 40 , 41 22 , 26 , 28 , 33 , 35 , 36 , 42 , 44 35 , 42 24 , 31 , 32 , 45 , 48 Some of the studies measured more than 1 productivity-related outcome. Absenteeism was measured in 26 studies, 20 - 25 , 27 - 32 , 34 - 38 , 40 - 48 22 , 42 , 44 , 20 , 22 , 25 , 26 , 29 , 33 , 44 35 , 38 , 40 , 42 Table S4 3.3. Population The study population across individual studies ranged from 24 to 9720 participants. Among RCTs, the range was 24 to 821 participants, whereas for NRCTs it was 25 to 9720 participants. The population of the included studies was heterogeneous. Nine studies focused on health care workers, 22 , 24 , 28 , 33 , 34 , 36 , 37 , 44 , 45 22 , 34 , 37 , 25 , 35 , 38 , 39 , 43 25 23 , 29 , 42 , 47 26 , 31 , 41 , 46 , 48 20 , 21 , 27 , 30 , 32 , 40 , 47 3.4. Interventions Among included studies, 22 studies evaluated a single intervention each, whereas 5 studies evaluated 2 interventions. In addition, for 1 intervention both assessment of effectiveness 38 39 Eleven interventions studied the effectiveness of a physical intervention alone 23 - 25 , 29 , 30 , 33 , 34 , 37 , 45 , 47 21 , 22 , 27 , 28 , 35 , 36 , 42 - 44 30 44 Table S4 3.5. Comparators The interventions were compared with care as usual ( n 24 , 29 , 30 , 35 , 39 , 40 , 43 , 47 n , 23 , 31 , 32 , 36 , 41 , 44 , 48 n 20 - 22 , 25 , 28 , 33 , 34 , 42 26 , 45 3.6. Effectiveness of the included interventions Among the trials with significant effects, 2 focused on construction workers, 35 , 39 28 32 31 31 , 32 , 35 , 39 28 28 , 35 , 39 31 , 32 35 38 Among the 33 included interventions, 28 were nonsignificant and 5 were significant in affecting productivity-related outcomes. Four interventions with a statistically significant effect reduced absenteeism, 28 , 32 , 35 , 39 31 35 38 Table 2 Table S5 Table 2 Intervention characteristics and results of the included interventions.  Work ability intervention  Resource use  Delivered by  Control  Population  Measurement and follow-up  Effectiveness estimate; P Aanesen et al, 2023 20 Motivational interviewing + usual case management ( n 2 × 1 h per wk over 2 wk Trained caseworkers All participants were offered usual case management for people on sick leave in Norway. ( n People with musculoskeletal disorder ( n Absenteeism: national registries −6.6 (95% CI, −15.0 to 1.8), NR, ns Stratified vocational advice intervention + usual case management ( n 3-4 × 1 h Physiotherapist and work and health researcher −7.0 (95% CI, −15.4 to 1.4), NR, ns Andersen et al, 2015 21 Health guidance + tailored physical activity ( n 3 × 50 min per wk over 10 wk Trained supervisor Health guidance for 1.5 h only ( n Health care workers with musculoskeletal troubles ( n Absenteeism: questionnaire NR, .4 Productivity: questionnaire NR, .26 Christensen et al, 2013 22 Dietary intervention + PE + CBT n 1 h per wk for over 12 mo Project manager and 2 employed instructors who had sports degrees Monthly 2-h oral lecture during working hours ( n Female health care workers ( n Absenteeism: local database NR, 0.07 Productivity: questionnaire NR, .589 Díaz-Benito et al, 2022 23 PE + health guidance ( n 2 × 50 min per wk over 12 wk Professionals graduated in physical activity and sports sciences The control group was passive and continued with their normal life and both groups had telephone or similar contact with the research team and trainers during the intervention ( n Workers with sedentary tasks ( n Absenteeism: questionnaire NR, NR, ns Escriche-Escuder et al, 2020 24 Resistance training program ( n 5 × 15 min per wk over 9 wk Physical therapist Usual activity ( n Hospital porters working at a local hospital (University Clinic Hospital of Valencia) ( n Absenteeism: questionnaire 0.3 (95% CI, −0.1 to 0.8); .165 Gram et al, 2012 25 Exercise intervention ( n 3 × 20 min per wk over 12 wk Skilled instructors 1-h lecture on general health promotion ( n Male construction workers ( n Absenteeism: questionnaire −0.5 (95% CI, −1.4 to 0.4); .28 Productivity: questionnaire −0.1 (95% CI, −1.7 to 1.4); .91 Gupta et al, 2018 26 PIPPI intervention targeted all IGLO levels ( n NR Research group No description ( n All workers in the predetermined departments of the recruited workplaces ( n Productivity: questionnaire 0.03 (95% CI, −0.38 to 0.44); .88 Haufe et al, 2020 27 PE + food diary [ n n 150 min per wk over 6 mo +7-d food diary Exercise scientist + dietitians Waiting list [ n n Participants over the age of 18 y who had at least 3 of the 5 metabolic syndrome components according to the AHA/NHLBI criteria, and who were not participating in an ongoing occupational health program Absenteeism: questionnaire NR; .72 NR; .12 Jakobsen et al, 2015 28 Workplace physical exercise ( n 5 × 10 min per wk for 10 wk. 5 group-based coaching sessions 30-45 min and ergonomic counseling 1.5-3 h in addition Experienced training instructors 5 × 10 min per wk for 10 wk, during leisure time, at home n Health care workers ( n Absenteeism: questionnaire 0.2 (95% CI, 0.0 to 0.3); .04 Justesen et al, 2017 29 Intelligent physical exercise training ( n 1 h per wk, for 2 y, except during holidays Instructors, who were bachelor students in the education of sport and health Were encouraged to maintain their lifestyle as usual ( n Office workers ( n Absenteeism: questionnaire −0.55 (95% CI, −1.29 to 0.20); .15 Productivity: questionnaire 0.16 (95% CI, −0.04 to 0.35); .11 Kaldo et al, 2018 30 PE (3 different arms) ( n 3 × 60 min per wk for 12 wk A qualified personal trainer Primary care standard treatment for depression determined by the patient’s general practitioner ( n Primary care patients with depression ( n Absenteeism: employers’ registers 1.4 (95% CI, 0.52 to 3.74); .50 ICBT ( n Self-help text modules. In total, 34 modules were available Therapist 0.99 (95% CI 0.39 to 2.46); .75 Kausto et al, 2021 31 The RTW-coordinator model ( n NR RTW-coordinator No RTW-coordinator model implemented ( n Participants were from the Finnish Public Sector (FPS) study cohort, which represents about 26% of Finnish public sector workers ( n Absenteeism: employers’ registers NR a Lahti et al, 2021 32 At least 1 OHP appointment ( n NR OHP No OHP appointment ( n City of Helsinki employees with at least 1 y of consecutive employment from 2008 to 2017, and those with an ICD-10F-diagnosed sickness allowance period ending during employment ( n Absenteeism: Social Insurance Institution of Finland register data NR; <.01 Lidegaard et al, 2018 33 Aerobic exercise intervention ( n 2 × 30 min per week over 12 mo Member of the research team 5 × 2-h healthy living lectures during the 1-y intervention period ( n Cleaners performing mainly cleaning in day-care institutions, offices, hospitals, and schools ( n Productivity: questionnaire 0.18 (95% CI, −0.38 to 0.73); .53 Nurminen et al, 2002 34 Worksite exercise program ( n 26 × 60 min weekly sessions over 8-mo period + 2 × 60 min sessions Physiotherapist 30 min of feedback on the results of the physical capacity tests and counseling for leisure time activity ( n Women with physically demanding laundry work ( n Absenteeism: personnel administration 22.5 (95% CI, −13.8 to 58.8); NR, ns Oude Hengel et al, 2014 35 Worksite intervention (physical and mental health component) ( n 2 × 30 min + 2 × 1-h group sessions over 6 mo Physical therapist and empowerment trainer Usual practice ( n Construction workers ( n Productivity costs (absenteeism) −€760 (95% CI, −€1497 to −€156), NR Rasmussen et al, 2016 36 c PE + CBT + participatory ergonomics n n n n 12 × 1-h (PE) + 2 × 3-h (CBT) + 2 × 3-h and 2 × 1-h (participatory ergonomics sessions) Trained local therapists (physiotherapists and occupational therapists) No description Health care workers in elderly care either in nursing homes or in home care employed more than 20 h per week and aged 18-65 y; mainly nurses’ aides but also kitchen and cleaning personnel as well as janitors (service workers) belonging to the participating teams ( n Absenteeism: questionnaire −0.05 (95% CI, −0.21 to 0.11); .53 Stenner et al, 2020 37 Endurance training (PE) n The aim was to perform 210 min of endurance training a week (20-60-min units for at least 3 d per week) over 6 mo Exercise physiologist Waiting list ( n Middle-aged female hospital workers ( n Absenteeism: questionnaire NR, .586 Taimela et al, 2008 39 Intervention for high-risk (HR) group ( n 1 × 90 min consultation with nurse and/or physician to plan future actions Occupational physicians and nurses Care as usual ( n 49% construction industry, 51% repair, service, and maintenance of buildings, industrial installations, or communication networks [ n n Absenteeism: employer’s records 11 (95% CI, 1 to 20), NR Intervention for intermediate risk (IR) group ( n Access to medical counseling over the telephone from phone advice center Care as usual ( n NR, NR, ns Taimela et al, 2008 38 Intervention for high-risk group ( n 1 × 90 min consultation with nurse and/or physician to plan future actions Occupational physicians and nurses Care as usual ( n  n Productivity costs: cost-effectiveness analysis of SA €17/SA day, NR b Tamminga et al, 2013 40 The hospital-based work support intervention ( n 4 × 15 min Hospital staff Usual oncology care ( n Female cancer patients ( n Absenteeism: questionnaire 1.03 (95% CI 0.84 to 1.2), NR Productivity costs (absenteeism): questionnaire −€2425; .72 b b Uegaki et al, 2011 41 Supervisor telephone contact At 6 wk post-partum, supervisors conducted standardized interviews with employees to identify health issues potentially hindering RTW Supervisors Care as usual Pregnant women from the companies ( n Absenteeism: questionnaire; sick leave hours NR, NR Presenteeism: questionnaire; presenteeism hours NR, NR Total productivity loss hours NR, NR Sick leave costs €37 (95% CI, −€252 to €334) b Presenteeism costs €109 (95% CI: −€66 to €298) b Total productivity costs: FCM €146 (95% CI: −€228 to €528) b Van Dongen et al, 2016 42 Structured physiotherapy + mindfulness training, e-coaching, and supporting elements ( n 1 × 90 min per week over 8 wk Certified trainer Structured physiotherapy ( n Employees of 2 Dutch governmental research institutes ( n Productivity costs (absenteeism): €746 (95% CI, −€14 to €1885) b Productivity costs (presenteeism): questionnaire, FCM €869 (95% CI, −€325 to €3930) Viester et al, 2015 43 Health promotion intervention 3 × 60 min + 6 × 10-30 min Trained personal health coaches Care as usual Blue-collar employees of a construction company. ( n Absenteeism: company’s register 1.19 (95% CI, 0.66 to 2.15), NR Von Thiele and Hasson 2011 44 Reduction of weekly hours ( n RWH: employees were free to spend the same 2.5 h however they wanted NR No intervention ( n Dental health care workers ( n Productivity: (quality and quantity of work: questionnaire) NR, NR, ns Absenteeism: questionnaire NR, NR, ns Presenteeism: questionnaire NR, NR, ns Reduction of weekly hours with PE ( n PE: off-work time was split into 2 mandatory PE periods, for a total of 2.5 h Productivity: (quality and quantity of work: questionnaire) NR, NR, ns Absenteeism: questionnaire NR, NR, ns Presenteeism: questionnaire NR, NR, ns Von Thiele and Lindfors 2015 45 The work-based PE intervention ( n 2 × 1 h per week over 1 y Physiotherapist No description ( n Women employed in older persons’ care ( n Absenteeism: questionnaire NR, NR, ns Absenteeism: questionnaire NR, NR, ns Willert et al, 2011 46 Stress management intervention ( n Each group contained 9 participants, encompassed 8 × 3 h over 3 mo Licenced clinical psychologists, with >5 y of clinical experience and a 1-y advanced training course in cognitive behavioral therapy Waiting list ( n Persons from the working population (18-67 years) in the municipality of Aarhus could participate in the study ( n Absenteeism: DREAM database NR; .07 Yaghoubitajani et al, 2022 47 Online supervised exercise ( n 3 × 50-60 min over 8 wk Qualified corrective exercise instructor supervises No details ( n Office workers with upper crossed syndrome ( n Absenteeism:questionnaire NR, NR, ns Exercise administered at the workplace ( n 3 × 50-60 min over 8 wk NR, NR, ns Zieringer and Zapf, 2024 48 Employee assistance program ( n NR Counselors are typically psychologists, medical professionals, social workers, addiction counselors, or otherwise trained professionals who practice different forms of counseling Matched control group who did not receive employee assistance program ( n Clients came from different industries and job roles, such as manufacturing, human services, banking, chemical industry, engineering, or public service ( n Absenteeism: questionnaire NR, .43 Abbreviations: AHA, American Heart Association; CBT, cognitive behavioral therapy; DREAM, Danish longitudinal database; FCM, friction cost method; HCA, human capital approach; HR, high-risk; ICBT, internet-based cognitive behavioral therapy; ICD, International Classification of Diseases; IGLO, individual, group, leader, organization; IR, intermediate risk; NHLBI, The National Heart, Lung, and Blood Institute; NR, not reported; ns, nonsignificant; OHP, occupational health psychologist; PE, physical exercise; PIPPI, participatory physical and psychosocial workplace intervention; RTW, return-to-work; RWH, reduced work hours; s, significant; SA, sickness absence; WAI, work ability index. a Risk of SA days increased. b Converted to 2024 price level. c Stepped wedge cluster randomized trial. 4. Discussion This review has synthesized the effectiveness of work ability interventions on productivity outcomes. The results suggest that the evidence for the effectiveness of work ability interventions is limited. To our knowledge, this is the first systematic literature review to examine the effectiveness of work ability interventions, regardless of setting and design, on productivity outcomes. This systematic review included 29 articles covering a total of 33 interventions. Only 5 of these interventions had a significant effect on productivity outcomes, specifically on absenteeism. Three interventions were RCTs and 2 NRCTs. Both RCTs and NRCTs used mostly objective measures (data from registers) to measure absenteeism. Only 1 RCT used a subjective measure to measure absenteeism. Four interventions effectively reduced absenteeism, whereas 1 intervention unexpectedly increased sickness absence. Among RCTs, the prevention program that included physical and mental health components for construction workers 35 28 39 38 In a weighted matched sample, individuals with at least 1 occupational health care psychologist (OHP) appointment for mental disorders 32 The return-to-work (RTW)–coordination model 31 Seven original studies 22 , 31 , 33 , 34 , 36 , 37 , 46 22 31 , 34 , 36 , 37 , 46 31 n 34 36 n 37 n n n 46 n n 33 n n P P 27 , 30 33 It is crucial for work ability interventions to improve employees’ health and work ability, but it is also important to enhance productivity to justify investments from societal or organizational perspective. In the long term, a healthy employee may also become more productive, as personal resources are sufficient, and production losses decrease. However, capturing these effects in research can be challenging due to short follow-up periods and difficulties in measuring productivity outcomes. It is noteworthy that most included studies evaluated productivity solely from the perspective of absenteeism. Although some studies used questionnaires to assess perceived productivity and presenteeism, only a limited number simultaneously measured absenteeism, productivity, and presenteeism. One reason for this focus on absenteeism might be its association with an individual’s health and the ease of objective measurement. In contrast, perceived productivity and presenteeism are more subjective and challenging to quantify. However, absenteeism alone does not fully reflect overall productivity. A more robust evaluation should include assessments of presenteeism and productivity at the individual and/or organizational levels to yield a more comprehensive understanding. The practical relevance of absenteeism depends on the nature of the work and the availability of replacement labor. In manual labor, the impact of absenteeism can differ from information work because manual tasks may require urgent completion to maintain organizational productivity. In contrast, information workers can typically resume their tasks upon returning from sick leave, unless there is a prolonged absence. In manual labor, a substitute might be found within the organization or from the labor market, whereas in information work finding a replacement may be challenging, delaying task completion (compensation mechanisms). 5 Productivity is possible to measure objectively, at least at the organizational level, by documenting measurable parameters that can be obtained from company databases. Micro-level productivity analysis examines individual and organizational productivity whereas macro-level analysis examines productivity from a societal perspective. It is notable that individual and organizational outcome variables can differ. From an organizational and societal perspective, average productivity is more important rather than productivity of individual employees, suggesting organizational and macro-level analysis is more sensible in the broader view. Only 3 studies measured productivity costs using a human capital approach, 35 42 40 Multiplier effects and unpaid labor are also linked to productivity through productivity losses. The multiplier effect refers to a situation where the absence of one employee’s input prevents the entire team from functioning. For instance, if a surgeon is not able to perform surgery, the whole operating team is unable to function. From a societal perspective, unpaid labor such as volunteer work also plays an important role when measuring productivity. 5 Productivity outcome variables are prone to publication bias. For instance, presenteeism may be easily overlooked or unreported due to its complexity compared with absenteeism. Consequently, absenteeism may skew results and provide a misleading picture of overall productivity. Therefore, it is crucial to consider as many productivity-related variables as possible to obtain a more realistic picture of overall productivity. If register data are available productivity losses can be measured with disability pensions and employment status, in addition to absenteeism, when considering a societal perspective. Depending on the chosen perspective, combining objective productivity from registry data, absenteeism, disability pensions, employment status, and survey data on presenteeism and volunteer work can offer a more comprehensive view of productivity. Implementing work ability interventions using an experimental design appears to be challenging. Conducting a double-blind study in this context is difficult, as the person administering the intervention is usually aware of whether the participant belongs to the experimental or control group. Moreover, dividing participants into 2 groups, where 1 group is likely to receive a more effective intervention, poses ethical concerns or entails a lack of motivation for participation. It might also be difficult to enlist enough participants to the study (small sample size), which results in low statistical power. 75 A register-based quasi-experimental design is a good alternative for measuring the effectiveness of work ability interventions on productivity (particularly on sickness absence), assuming the register data are robust and comprehensive. This approach allows for a large sample size, as demonstrated by 2 studies. 31 , 32 76 77 78 79 4.1. Strengths and limitations of the included studies All the studies used self-reported data to measure productivity or presenteeism. However, subjectively measured outcomes can introduce bias and limit significantly the reliability of the findings. Most studies also relied on self-reported data to measure absenteeism, although some employed register-based measurements. Notably, there is strong agreement between self-reported and register-based absenteeism data. 80 Some of the RCTs were limited by very small sample sizes, which affects the reliability of the findings. However, most RCTs had sample sizes of over 200, indicating that both the intervention and control groups had over 100 participants, aligning with recommendations. 81 24 , 36 n 48 31 , 32 n A limitation of work ability interventions is their implementation within specific settings or populations, which limits their generalizability to other contexts. Additionally, the heterogeneity of work ability interventions and productivity-related outcomes poses challenges in summarizing results and drawing generalizable conclusions. 4.2. Strengths and limitations of this review This systematic review has several strengths, including the wide inclusion criteria and a comprehensive search strategy that ensured a wide range of studies were considered. It included studies identified through the snowball effect and included both RCT and NRCT studies, enhancing the scope and depth of the analysis. All studies featured a comparison group, which is inevitable when assessing the effectiveness of interventions. However, inclusion criteria may have excluded some important studies, and the absence of “performance” in the search strategy may weaken its comprehensiveness. Additionally, the specific definitions of work ability and work ability interventions could have led to the omission of relevant research, resulting in the exclusion of wellness programs implemented in workplaces. These programs have been studied, for instance, in the United States. 82 15 5. Conclusions The analysis of work ability interventions showed that most of them were ineffective in increasing productivity-related outcomes, whereas only a few interventions affected these outcomes, specifically absenteeism. Among these, 4 interventions effectively reduced absenteeism, whereas 1 trial increased the risk of absenteeism. Notably, 1 trial indicated a reduction in costs related to absenteeism, and another showed that the intervention was more effective and less costly than usual occupational care. It remains challenging for society and organizations to invest in work ability interventions when there is insufficient information on evidence-based interventions that enhance productivity. This systematic review highlights the current lack of evidence regarding the effectiveness of high-quality work ability interventions on productivity. Further research is needed to fill the information gap concerning work ability interventions that affect productivity. Quasi-experimental register-based studies are a good opportunity to address this issue. Supplementary Material Web_Material_uiaf051 Author contributions P.K. contributed to the planning of the study, conducted screening and data extraction, analyzed the data, and wrote the initial manuscript. E.S. conducted screening and data extraction. E.R., P.K., and I.L. contributed to the planning of the study and revised the manuscript. M.I. conducted screening. Supplementary material  Supplementary material Journal of Occupational Health Funding This study was funded by the Social Insurance Institution of Finland. Conflicts of interest All authors declared that they have no conflicts of interest. Data availability The datasets supporting the conclusions of this article are included within the article and its supplementary material. References 1. Tengland P-A The concept of work ability J Occup Rehabil 2011 21 2 275 285 10.1007/s10926-010-9269-x 21052807 2. OECD OECD Manual: Measurement of Aggregate and Industry-Level Productivity Growth OECD Publishing 2001 3. Zhang W Bansback N Anis AH Measuring and valuing productivity loss due to poor health: a critical review Soc Sci Med 2011 72 2 185 192 21146909 10.1016/j.socscimed.2010.10.026 4. Widera E Chang A Chen HL Presenteeism: a public health hazard J Gen Intern Med 2010 25 11 1244 1247 10.1007/s11606-010-1422-x 20549378 PMC2947637 5. Krol M Brouwer W Rutten F Productivity costs in economic evaluations: past, present, future PharmacoEconomics 2013 31 7 537 549 10.1007/s40273-013-0056-3 23620213 6. Schultz AB Chen C-Y Edington DW The cost and impact of health conditions on presenteeism to employers PharmacoEconomics. 2009 27 5 365 378 10.2165/00019053-200927050-00002 19586075 7. Marin-Farrona M Wipfli B Thosar SS et al. Effectiveness of worksite wellness programs based on physical activity to improve workers’ health and productivity: a systematic review Syst Rev 2023 12 1 10.1186/s13643-023-02258-6 PMC10207792 37226273 8. Tarro L Llauradó E Ulldemolins G Hermoso P Solà R Effectiveness of workplace interventions for improving absenteeism, productivity, and work ability of employees: a systematic review and meta-analysis of randomized controlled trials Int J Environ Res Public Health 2020 17 6 1901 10.3390/ijerph17061901 32183392 PMC7142489 9. Cloostermans L Bekkers MB Uiters E Proper KI The effectiveness of interventions for ageing workers on (early) retirement, work ability and productivity: a systematic review Int Arch Occup Environ Health 2015 88 5 521 532 10.1007/s00420-014-0969-y 25118618 10. Page MJ McKenzie JE Bossuyt PM et al. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ. 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 11. Kekkonen Pasi RE Kangas P Linnosmaa I The effectiveness of work ability interventions on productivity – a systematic review protocol PROSPERO 2024 CRD42024541404 10.1093/joccuh/uiaf051 PMC12490205 40990970 12. Methley AM Campbell S Chew-Graham C McNally R Cheraghi-Sohi S PICO, PICOS and SPIDER: a comparison study of specificity and sensitivity in three search tools for qualitative systematic reviews BMC Health Serv Res 2014 14 1 579 10.1186/s12913-014-0579-0 25413154 PMC4310146 13. Choong MK Galgani F Dunn AG Tsafnat G Automatic evidence retrieval for systematic reviews J Med Internet Res 2014 16 10 e223 10.2196/jmir.3369 25274020 PMC4211030 14. Homepage. Covidence systematic review software. Veritas Health Innovation. www.covidence.org 15. McHugh ML Interrater reliability: the kappa statistic Biochem Med (Zagreb) 2012 22 3 276 282 10.11613/BM.2012.031 23092060 PMC3900052 16. Sterne JAC Savović J Page MJ et al. RoB 2: a revised tool for assessing risk of bias in randomised trials BMJ. 2019 366 14898 10.1136/bmj.l4898 31462531 17. Sterne JA Hernán MA Reeves BC et al. ROBINS-I: a tool for assessing risk of bias in non-randomised studies of interventions BMJ. 2016 355 i4919 10.1136/bmj.i4919 27733354 PMC5062054 18. Evers S Goossens M de Vet H van Tulder M Ament A Criteria list for assessment of methodological quality of economic evaluations: consensus on health economic criteria Int J Technol Assess Health Care 2005 21 2 240 245 10.1017/S0266462305050324 15921065 19. CCEMG-EPPI-Centre Cost Converter. Version 1.6. The Campbell and Cochrane Economics Methods Group (CCEMG) and the Evidence for Policy and Practice Information and Coordinating Centre (EPPI-Centre), 2019 https://eppi.ioe.ac.uk/costconversion/ 20. Aanesen F Grotle M Rysstad TL et al. Effectiveness of adding motivational interviewing or a stratified vocational advice intervention to usual case management on return to work for people with musculoskeletal disorders: the MI-NAV randomised controlled trial Occup Environ Med 2023 80 1 42 50 10.1136/oemed-2022-108637 36428098 PMC9763188 21. Andersen LN Juul-Kristensen B Roessler KK Herborg LG Sørensen TL Søgaard K Efficacy of 'tailored physical activity' on reducing sickness absence among health care workers: a 3-months randomised controlled trial Man Ther 2015 20 5 666 671 10.1016/j.math.2015.04.017 25983237 22. Christensen JR Overgaard K Hansen K Søgaard K Holtermann A Effects on presenteeism and absenteeism from a 1-year workplace randomized controlled trial among health care workers J Occup Environ Med 2013 55 10 1186 1190 10.1097/JOM.0b013e31829b2816 24064773 23. Díaz-Benito VJ Moro MIB Vanderhaegen F et al. Intervention of physical exercise in the workplace on work ability, depression, anxiety and job satisfaction in workers with sedentary tasks WORK 2022 72 3 921 931 10.3233/WOR-210300 35634828 24. Escriche-Escuder A Calatayud J Andersen LL Ezzatvar Y Aiguadé R Casaña J Effect of a brief progressive resistance training program in hospital porters on pain, work ability, and physical function Musculoskelet Sci Pract 2020 48 102162 10.1016/j.msksp.2020.102162 32250836 25. Gram B Holtermann A Bültmann U Sjøgaard G Søgaard K Does an exercise intervention improving aerobic capacity among construction workers also improve musculoskeletal pain, work ability, productivity, perceived physical exertion, and sick leave?: a randomized controlled trial J Occup Environ Med 2012 54 12 1520 1526 10.1097/JOM.0b013e318266484a 23114388 26. Gupta N Wåhlin-Jacobsen CD Abildgaard JS Henriksen LN Nielsen K Holtermann A Effectiveness of a participatory physical and psychosocial intervention to balance the demands and resources of industrial workers: a cluster-randomized controlled trial Scand J Work Environ Health 2018 44 1 58 68 10.5271/sjweh.3689 29095478 27. Haufe S Kahl KG Kerling A et al. Employers with metabolic syndrome and increased depression/anxiety severity profit most from structured exercise intervention for work ability and quality of life Front Psychiatry 2020 11 562 10.3389/fpsyt.2020.00562 32625123 PMC7314973 28. Jakobsen MD Sundstrup E Brandt M Jay K Aagaard P Andersen LL Physical exercise at the workplace prevents deterioration of work ability among healthcare workers: cluster randomized controlled trial BMC Public Health 2015 15 1174 26607232 10.1186/s12889-015-2448-0 PMC4658806 29. Justesen JB Sogaard K Dalager T Christensen JR Sjogaard G The effect of intelligent physical exercise training on sickness presenteeism and absenteeism among office workers J Occup Environ Med 2017 59 10 942 948 10.1097/JOM.0000000000001101 28800039 30. Kaldo V Lundin A Hallgren M et al. Effects of internet-based cognitive behavioural therapy and physical exercise on sick leave and employment in primary care patients with depression: two subgroup analyses Occup Environ Med 2018 75 1 52 58 10.1136/oemed-2017-104326 28951431 PMC5749311 31. Kausto J Oksanen T Koskinen A et al. ‘Return to work’ coordinator model and work participation of employees: a natural intervention study in Finland J Occup Rehabil 2021 31 4 831 839 10.1007/s10926-021-09970-x 33829365 PMC8558281 32. Lahti J Harkko J Nordquist H et al. Seeing an occupational health psychologist reduces sickness absence due to mental disorders: a quasi-experimental study Prev Med 2021 149 106611 10.1016/j.ypmed.2021.106611 33989672 33. Lidegaard M Søgaard K Krustrup P Holtermann A Korshøj M Effects of 12 months aerobic exercise intervention on work ability, need for recovery, productivity and rating of exertion among cleaners: a worksite RCT Int Arch Occup Environ Health 2018 91 2 225 235 10.1007/s00420-017-1274-3 29103065 PMC5797214 34. Nurminen E Malmivaara A Ilmarinen J et al. Effectiveness of a worksite exercise program with respect to perceived work ability and sick leaves among women with physical work Scand J Work Environ Health 2002 28 2 85 93 10.5271/sjweh.652 12019592 35. Oude Hengel KM Bosmans JE Van Dongen JM Bongers PM Van der Beek AJ Blatter BM Prevention program at construction worksites aimed at improving health and work ability is cost-saving to the employer: results from an RCT Am J Ind Med 2014 57 1 56 68 10.1002/ajim.22267 24166711 36. Rasmussen CDN Holtermann A Jørgensen MB Ørberg A Mortensen OS Søgaard K A multi-faceted workplace intervention targeting low back pain was effective for physical work demands and maladaptive pain behaviours, but not for work ability and sickness absence: stepped wedge cluster randomised trial Scand J Public Health 2016 44 6 560 570 10.1177/1403494816653668 27289107 37. Stenner HT Eigendorf J Kerling A et al. Effects of six month personalized endurance training on work ability in middle-aged sedentary women: a secondary analysis of a randomized controlled trial J Occup Med Toxicol 2020 15 1 8 10.1186/s12995-020-00261-4 32391068 PMC7201966 38. Taimela S Justén S Aronen P et al. An occupational health intervention programme for workers at high risk for sickness absence. Cost effectiveness analysis based on a randomised controlled trial Occup Environ Med 2008 65 4 242 248 10.1136/oem.2007.033167 17933885 PMC2564864 39. Taimela S Malmivaara A Justén S et al. The effectiveness of two occupational health intervention programmes in reducing sickness absence among employees at risk. Two randomised controlled trials Occup Environ Med 2008 65 4 236 241 10.1136/oem.2007.032706 17681994 PMC2564865 40. Tamminga SJ Verbeek JHAM Bos MMEM et al. Effectiveness of a hospital-based work support intervention for female cancer patients—a multi-centre randomised controlled trial PLoS One 2013 8 5 e63271 10.1371/journal.pone.0063271 23717406 PMC3661555 41. Uegaki K Stomp-Van Den Berg SGM De Bruijne MC et al. Cost-utility analysis of a one-time supervisor telephone contact at 6-weeks post-partum to prevent extended sick leave following maternity leave in the Netherlands: results of an economic evaluation alongside a randomized controlled trial BMC Public Health 2011 11 1 57 10.1186/1471-2458-11-57 21272325 PMC3040144 42. Van Dongen JM Van Berkel J Boot CRL et al. Long-term cost-effectiveness and return-on-investment of a mindfulness-based worksite intervention J Occup Environ Med 2016 58 6 550 560 10.1097/JOM.0000000000000736 27281638 43. Viester L Verhagen EALM Bongers PM van der Beek AJ The effect of a health promotion intervention for construction workers on work-related outcomes: results from a randomized controlled trial Int Arch Occup Environ Health 2015 88 6 789 798 10.1007/s00420-014-1007-9 25481382 44. Von Thiele SU Hasson H Employee self-rated productivity and objective organizational production levels: effects of worksite health interventions involving reduced work hours and physical exercise J Occup Environ Med 2011 53 8 838 844 10.1097/JOM.0b013e31822589c2 21785369 45. Von Thiele SU Lindfors P Improved fitness after a workbased physical exercise program Int J Workplace Health Manag 2015 8 1 61 74 10.1108/IJWHM-10-2013-0038 46. Willert MV Thulstrup AM Bonde JP Effects of a stress management intervention on absenteeism and return to work—results from a randomized wait-list controlled trial Scand J Work Environ Health 2011 37 3 186 195 10.5271/sjweh.3130 21057736 47. Yaghoubitajani Z Gheitasi M Bayattork M Andersen LL Corrective exercises administered online vs at the workplace for pain and function in the office workers with upper crossed syndrome: randomized controlled trial Int Arch Occup Environ Health 2022 95 8 1703 1718 10.1007/s00420-022-01859-3 35391580 PMC8989105 48. Zieringer RC Zapf D The effects of an employee assistance program on productivity at work, workability, absenteeism, and smartphone measures of heart rate and heart rate variability J Occup Health Psychol 2024 29 4 280 298 10.1037/ocp0000380 39101889 49. Aili K Hellman T Svartengren M Danielsson K Including a three-party meeting using the demand and ability protocol in an interdisciplinary pain rehabilitation programme for a successful return to work process Int J Environ Res Public Health 2022 19 24 16614 10.3390/ijerph192416614 36554495 PMC9778674 50. Asplund RP Asplund S von Buxhoeveden H et al. Work-focused versus generic internet-based interventions for employees with stress-related disorders: randomized controlled trial J Med Internet Res 2023 25 e34446 10.2196/34446 37097739 PMC10170369 51. Asplund RP Carvallo F Christensson H et al. Learning how to recover from stress: results from an internet-based randomized controlled pilot trial Internet Interv 2023 34 100681 10.1016/j.invent.2023.100681 38023967 PMC10643270 52. Axén I Sennehed CP Eek F Stigmar K Can a workplace dialogue impact the perceived influence of neck and/or backpain on everyday activities and performance at work? A secondary analysis from the randomized controlled trial WorkUp BMC Musculoskelet Disord 2022 23 1 861 10.1186/s12891-022-05812-w 36104781 PMC9476597 53. Behrens-Wittenberg E Wedegaertner F A return-to-work intervention for prematurely retired depression or anxiety disorder patients Front Psychiatry 2021 12 662158 10.3389/fpsyt.2021.662158 34149480 PMC8206491 54. Contreras C Hellhammer J Gerhards F Hellhammer DH Neuropattern, a translational tool to reduce stress at work—a pilot study Occup Health Sci 2018 2 4 385 407 10.1007/s41542-018-0025-5 55. Dalager T Bredahl TGV Pedersen MT Boyle E Andersen LL Sjøgaard G Does training frequency and supervision affect compliance, performance and muscular health? A cluster randomized controlled trial Man Ther 2015 20 5 657 665 10.1016/j.math.2015.01.016 25816746 56. Frederiksen P Indahl A Andersen LL Burton K Hertzum-Larsen R Bendix T Can group-based reassuring information alter low back pain behavior? A cluster-randomized controlled trial PLoS One 2017 12 3 e0172003 10.1371/journal.pone.0172003 28346472 PMC5367686 57. Geukes M Anema JR Vermeer M van Aalst MP Oosterhof H Evaluation of a workplace educational intervention on menopause: a quasi-experimental study Maturitas 2023 174 48 56 10.1016/j.maturitas.2023.05.005 37270889 58. Hange D Ariai N Kivi M Eriksson MCM Nejati S Petersson E-L The impact of internet-based cognitive behavior therapy on work ability in patients with depression—randomized controlled study Int J Gen Med 2017 10 151 159 10.2147/IJGM.S129710 28579817 PMC5446974 59. Haynes NJ Vandenberg RJ Wilson MG DeJoy DM Padilla HM Smith ML Evaluating the impact of the Live Healthy, Work Healthy program on organizational outcomes: a randomized field experiment J Appl Psychol 2022 107 10 1758 1780 10.1037/apl0000977 34941287 PMC9415328 60. Hultberg EL Lönnroth K Allebeck P Hensing G Effects of co-financed interdisciplinary teamwork on sick leave for people with musculoskeletal disorders Work. 2006 26 4 369 377 10.3233/WOR-2006-00532 16788256 61. Koolhaas W Groothoff JW De Boer MR Van Der Klink JJL Brouwer S Effectiveness of a problem-solving based intervention to prolong the working life of ageing workers BMC Public Health 2015 15 1 76 10.1186/s12889-015-1410-5 25648750 PMC4323226 62. Muschalla B Linden M Jöbges M Work-anxiety and sickness absence after a short inpatient cognitive behavioral group intervention in comparison to a recreational group meeting J Occup Environ Med 2016 58 4 398 406 10.1097/JOM.0000000000000678 27058481 63. Noben C Evers S Jv G Nijhuis F de Rijk A Improving a web-based employability intervention for work-disabled employees: results of a pilot economic evaluation. Disabil Rehabil Assist Technol 2017 12 3 280 289 10.3109/17483107.2015.1135999 26804105 64. Notenbomer A Roelen C Groothoff J van Rhenen W Bültmann U Effect of an eHealth intervention to reduce sickness absence frequency among employees with frequent sickness absence: randomized controlled trial J Med Internet Res 2018 20 10 e10821 10.2196/10821 30355551 PMC6231854 65. Näsman O Ahonen G 2007 22-24 October Hanoi, Vietnam 66. Saha S Grahn B Gerdtham UG Stigmar K Holmberg S Jarl J Structured physiotherapy including a work place intervention for patients with neck and/or back pain in primary care: an economic evaluation Eur J Health Econ 2019 20 2 317 327 10.1007/s10198-018-1003-1 30171489 PMC6438933 67. Sennehed CP Holmberg S Axén I et al. Early workplace dialogue in physiotherapy practice improved work ability at 1-year follow-up—WorkUp, a randomised controlled trial in primary care Pain. 2018 159 8 1456 1464 10.1097/j.pain.0000000000001216 29554017 PMC6085128 68. Shaw WS McLellan RK Besen E et al. A worksite self-management program for workers with chronic health conditions improves worker engagement and retention, but not workplace function J Occup Rehabil 2022 32 1 77 86 10.1007/s10926-021-09983-6 33983524 PMC8858918 69. Sprūdža D Kozlova L Lakiša S et al. The impact of metal age training programme on the well-being of Latvian office workers Proc Latv Acad Sci 2016 70 5 315 324 10.1515/prolas-2016-0048 70. van de Ven D Schuring M Kouwenhoven-Pasmooij TA Blom P Burdorf A Robroek SJW Reach and effectiveness of a worksite health promotion program combining a preventive medical examination with motivational interviewing; a quasi-experimental study among workers in low socioeconomic position BMC Public Health 2023 23 1 2130 10.1186/s12889-023-16908-w 37904106 PMC10617210 71. Van Holland BJ Reneman MF Soer R Brouwer S de Boer MR Effectiveness and cost-benefit evaluation of a comprehensive workers’ health surveillance program for sustainable employability of meat processing workers J Occup Rehabil 2018 28 1 107 120 10.1007/s10926-017-9699-9 28341910 PMC5820399 72. Von Thiele SU Augustsson H Hasson H Stenfors-Hayes T Promoting employee health by integrating health protection, health promotion, and continuous improvement: a longitudinal quasi-experimental intervention study J Occup Environ Med 2015 57 2 217 225 10.1097/JOM.0000000000000344 25654524 73. Wall A Henriksson M Nyberg J et al. Exercise and health-related quality of life and work-related outcomes in primary care patients with anxiety disorders—a randomized controlled study J Affect Disord 2024 360 5 14 10.1016/j.jad.2024.05.092 38777273 74. Östlind E Eek F Stigmar K Sant’Anna A Hansson EE Promoting work ability with a wearable activity tracker in working age individuals with hip and/or knee osteoarthritis: a randomized controlled trial BMC Musculoskelet Disord 2022 23 1 112 10.1186/s12891-022-05041-1 35114983 PMC8812043 75. Button KS Ioannidis JPA Mokrysz C et al. Power failure: why small sample size undermines the reliability of neuroscience Nat Rev Neurosci 2013 14 5 365 376 10.1038/nrn3475 23571845 76. Stuart EA Matching methods for causal inference: a review and a look forward Stat Sci 2010 25 1 1 21 10.1214/09-STS313 20871802 PMC2943670 77. Shelton RC Lee M Brotzman LE Wolfenden L Nathan N Wainberg ML What is dissemination and implementation science?: an introduction and opportunities to advance behavioral medicine and public health globally Int J Behav Med 2020 27 1 3 20 10.1007/s12529-020-09848-x 32060805 78. Arain M Campbell MJ Cooper CL Lancaster GA What is a pilot or feasibility study? A review of current practice and editorial policy BMC Med Res Methodol 2010 10 1 67 10.1186/1471-2288-10-67 20637084 PMC2912920 79. Milat AJ Bauman A Redman S Narrative review of models and success factors for scaling up public health interventions Implement Sci 2015 10 1 113 10.1186/s13012-015-0301-6 26264351 PMC4533941 80. Voss M Stark S Alfredsson L Vingård E Josephson M Comparisons of self-reported and register data on sickness absence among public employees in Sweden Occup Environ Med 2008 65 1 61 67 10.1136/oem.2006.031427 17704196 81. Althubaiti A Sample size determination: a practical guide for health researchers J Gen Fam Med 2023 24 2 72 78 10.1002/jgf2.600 36909790 PMC10000262 82. Jones D Molitor D Reif J What do workplace wellness programs do? Evidence from the Illinois workplace wellness study Q J Econ 2019 134 4 1747 1791 10.1093/qje/qjz023 31564754 PMC6756192 ",
  "metadata": {
    "Title of this paper": "What do workplace wellness programs do? Evidence from the Illinois workplace wellness study",
    "Journal it was published in:": "Journal of Occupational Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490205/"
  }
}