{
  "title": "Paper_327",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12484196 PMC12484196.1 12484196 12484196 41041343 10.3389/fimmu.2025.1641484 1 Immunology Original Research Electroacupuncture restores intestinal mucosal barrier in IBS-D rats by modulating mast cell-derived exosomal MiR-149-5p Hou Yujun  1 Luo Fangli  1  2 Wang Kai  3 Chen Ying  1 Wang Lu  4 Li Yanqiu  1 Wang Siqi  1 Yao Junpeng  1 Li Ying  1  * Zhou Siyuan  1  *  1 School of Acupuncture and Tuina, Chengdu University of Traditional Chinese Medicine Chengdu China  2 Clinical School of Integrated Traditional and Western Medicine, North Sichuan Medical College Nanchong China  3 Chengdu First People’s Hospital Chengdu China  4 Department of Acupuncture and Moxibustion, Hospital of Chengdu University of Traditional Chinese Medicine Chengdu China Edited by: Nimanthi Jayathilaka Reviewed by: Varsha Ganesan  Xuancheng Zhou  Thusitha Wickramasinghe *Correspondence: Ying Li, Liying@cdutcm.edu.cn zsy@cdutcm.edu.cn 17 9 2025 2025 16 480569 1641484 05 6 2025 31 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Hou, Luo, Wang, Chen, Wang, Li, Wang, Yao, Li and Zhou. 2025 Hou, Luo, Wang, Chen, Wang, Li, Wang, Yao, Li and Zhou https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Intestinal barrier dysfunction is a key etiology of diarrhea-predominant irritable bowel syndrome (IBS-D), and our previous work has demonstrated that mast cells play a critical role in this process. Here, we further show that electroacupuncture (EA) restores intestinal mucosal barrier in IBS-D Rats by modulating mast cell-Derived exosomal (MC-EXO) microRNAs (miRNAs). Methods IBS-D was induced in rats using chronic unpredictable mild stress (CUMS) combined with Senna solution administration, and confirmed through assessments of visceral pain threshold, diarrhea index, percentage of time spent in open arms, hematoxylin and eosin staining was performed to evaluate the pathological features of the colon. Model rats were treated with EA in combination with the mast cell agonist C48/80, CRF-R1 agonist Ucn1, or exosome antagonist GW4869. CRF and CRF-R1 mRNA expression levels were measured using qPCR, and mast cell activation and degranulation were examined by transmission electron microscopy (TEM) and immunohistochemistry (IHC). Additionally, intestinal barrier integrity and tight junction expression were evaluated by ELISA, TEM, Western blot (WB), and IHC. MC-EXO miRNAs were extracted, sequenced, and subjected to Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) enrichment analyses. Furthermore, Caco-2 cells were transfected with miR-149-5p and miR-22-5p mimics to determine the effect of these miRNAs on intestinal permeability and tight junction protein expression. To further validate the effect of miR-149-5p, IBS-D rats were administered adeno-associated viruses (AAV) overexpressing miR-149-5p, and mast cell activation and intestinal barrier function were evaluated. Results EA alleviated IBS-D symptoms by downregulating CRF and CRF-R1 expression, inhibiting mast cell activation, and upregulating tight junction protein expression. These effects were abrogated by CRF and mast cell agonists, but enhanced by an exosome inhibitor. MiRNA sequencing revealed significantly higher miR-149-5p and miR-22-5p expression levels in the model group compared to the EA group. KEGG and GO enrichment analyses showed that these miRNAs were enriched in pathways associated with tight junctions. Transfection of Caco-2 cells with miR-149-5p or miR-22-5p mimics increased monolayer permeability and downregulated the expression of tight junction proteins. Additionally, administration of AAV-miR-149-5p abolished the protective effect of EA in IBS-D rats. Conclusion MC-EXO miR-149-5p modulates EA-mediated intestinal barrier repair in IBS-D rats. irritable bowel syndrome electroacupuncture mast cells exosomes micrornas tight junctions The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by the National Natural Science Foundation of China (no. 82074558). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Mucosal Immunity 1 Background Irritable bowel syndrome (IBS) is a prevalent functional gastrointestinal (GI) disorder that affects millions of individuals worldwide ( 1 2 3 4 Normal immune function is essential for the maintenance of intestinal barrier integrity ( 5 6 7 8 9 10 11 12 14 Acupuncture is a major component of traditional Chinese medicine (TCM) that has been proposed as a potential treatment for IBS-D ( 15 16 17 18 Exosomes are microvesicles secreted by cells that contain a wide array of microRNAs (miRNAs) and other bioactive substances, reflecting the cellular state ( 19 20 21 22 In vitro 23 The present study evaluated the role of MC-EXOs miRNAs in EA-mediated repair of intestinal barrier in a rat model of IBS-D. It was hypothesized that EA may exert its therapeutic effects by modulating MC-EXO miRNA expression, thereby enhancing tight junction protein expression, restoring intestinal barrier integrity, and ultimately alleviating IBS-D symptoms. 2 Materials and methods 2.1 Animals Forty-eight female Sprague Dawley rats (8 weeks, 240 ± 10 g) were purchased from Chengdu Dashuo Biotech Co. Ltd. (Chengdu, China) and housed in the SPF facility of the Experimental Animal Center of Chengdu University of Traditional Chinese Medicine. The animals were maintained under controlled humidity, temperature, and a regulated circadian rhythm. The experimental protocols were approved by the Experimental Animal Welfare Ethics Committee at the Chengdu University of Traditional Chinese Medicine (ref. no.2021-15). 2.2 IBS-D induction and treatment After one week of acclimation, rats were randomly divided into the control group, model group, EA group, EA + C48/80 group (mast cell agonist), EA + Ucn 1 group (CRF agonist), and EA + GW4869 group (exosome antagonist), with 8 rats per group. Except for the control group, IBS-D was induced in all other groups by administering 0.3 g/mL of Senna solution via oral gavage at a dose of 10 mL/kg, combined with chronic unpredictable mild stress (CUMS), for 14 days ( 24  Figure 1B  Figure 1D Figure 1 Schematic diagram of the experimental protocol: (A) in vivo (B) (C) (D) Flowchart illustrating a research study on chronic unpredictable mild stress (CUMS) in mice. Part A shows a timeline for behavior assessment and EA treatment over five weeks. Part B lists CUMS stressors, including restraint and tail pinch. Part C depicts acupoint targets on a mouse. Part D outlines sample collection and analysis, including miRNA sequencing and barrier function in cells and tissues, with various treatments like Ucn1, C48/80, and GW4869. 2.3 EA intervention EA was performed at ST36, ST25, and LR3 as previously described ( 24  Figure 1C  Figure 1A 2.4 Behavioral assessments Behavioral assessments were conducted before IBS-D induction, after IBS-D induction, and after EA treatment. Research has shown that patients with IBS have increased risk of anxiety and depression ( 25 24 2.5 Sample collection Rats were euthanized at the end of treatment, and the distant colon (5 cm to the anus), serum, and peritoneal wash (using 10 mL D-Hank’s solution) were collected for various assays (  Figure 1D 2.6 Histology Pathological changes in the colon tissues were examined by H&E staining. Briefly, colon tissues were fixed in 4% paraformaldehyde, dehydrated in an automatic dehydrator, embedded in paraffin, sectioned, stained with H&E, mounted, and examined using the Pannoramic 250 digital slide scanner (3DHISTECH, Hungary) at 100× magnification. 2.7 Enzyme-linked immunosorbent assay Serum levels of diamine oxidase (DAO), a sensitive marker for intestinal barrier function, were quantified using an ELISA kit per the manufacturer’s instructions (Rat DAO ELISA KIT, ZCI BIO, China). After adding samples, washing, color developing and adding terminating solution, OD values were measured with a microplate reader. 2.8 Western blot The colonic expression levels of the tight junction proteins ZO-1, Occludin, and Claudin-1 were measured using WB. Briefly, total protein was extracted from colonic tissues using RIPA lysis solution (Servicebio, China) and quantified by the BCA protein quantification kit (Beyotime, China). Equal quantity of protein samples were loaded for SDS-PAGE, and the separated proteins were transferred onto a polyvinylidene difluoride (PVDF) membrane (Sigma-Aldrich, USA). The PVDF membrane was blocked with 5% skimmed milk, washed, incubated with anti-ZO-1, anti-Occludin (1:1000, 1:1000, Abcam, UK), anti-Claudin-1, and anti-β-actin antibodies (1:2000, 1:50000, Abclonal, China) at 4°C overnight; after washed with TBST, the PVDF membrane was incubated with biotinylated goat anti-rabbit IgG (H + L) secondary antibody (1:5000; Abclonal, China), washed, and incubated with chromogenic substrate solution at room temperature for 2~3 h. The protein bands were visualized using Tianeng GIS chassis control software V2.0 (China), and the relative expression levels of ZO-1, Occludin, and Claudin-1 were quantified by normalization to β-actin. 2.9 Immunohistochemistry Immunohistochemistry (IHC) was performed to assess the expression of colonic tight junction proteins and tryptase, a marker of mast cell activation. Colon tissues were immersion-fixed in 4% paraformaldehyde (Sinopharm Chemical Reagent, China) for 72 h, embedded in paraffin, cut into 5-µm-thick sections, incubated with 3% hydrogen peroxide solution (Sinopharm Chemical Reagent, China) for 10 min, and blocked with 10% goat serum (Beijing Zhongshan Golden Bridge Biotechnology, China) for 2 h at 37°C. Primary antibodies (Occludin, 1:100, Abcam, UK; ZO-1, 1:200, Servicebio, China) were added dropwise and incubated overnight at 4°C; after washed with PBS, A secondary antibody (HRP-labeled goat anti-rabbit, 1:100, Servicebio, China) working solution was added dropwise and incubated at 37 °C for 30 min. DAB substrate kit (Beijing Zhongshan Golden Bridge Biotechnology, China) was used for the color-reaction and nuclei counterstain was performed with hematoxylin (J&K Scientific, China). The percentage of positive staining in each image was calculated using Halo data analysis system. 2.10 Transmission electron microscopy The ultrastructure of mast cells in the intestinal mucosa was examined using TEM. Colon tissues were fixed in 2.5% glutaraldehyde, dehydrated, infiltrated, and embedded in resin. Ultrathin sections were then prepared, stained with lead citrate, and examined under a transmission electron microscope. 2.11 Quantitative real-time PCR The mRNA expression levels of CRF and CRF-R1 in the colon were measured by qPCR. Total RNA was extracted from colon tissues, assessed for purity, and reverse transcribed into cDNA for PCR amplification. The primer sequences are detailed in  Table 1 Table 1 CRF and CRF-R1 primer sequences. Primer name Forward Reverse β-actin GGGAAATCGTGCGTGACATT GCGGCAGTGGCCATCTC CRF CCAGCAACCTCAGCCGATTCTG GAGCAGCGGGACTTCTGTTGAG CRF-R1 AGCCCGTGTGAATTATTCTGAGTGC GCAGTGACCCAGGTAGTTGAGATG 2.12 Isolation and identification of peritoneal mast cells Peritoneal fluid was collected by lavage with 10 mL D-Hank’s solution, and mast cells were isolated using Percoll density gradient centrifugation. To prepare the Percoll separation solution, Percoll was first mixed with 8.5% NaCl solution at a 9:1 ratio to achieve physiological osmotic pressure (100% stock solution), then diluted with 0.85% NaCl solution to generate the 75% and 70% Percoll separation solutions. Peritoneal wash samples were centrifuged at 1200 r/min for 5 min, and the pellets were resuspended in 1 mL PBS, following by the addition of the Percoll separation solution. Samples were then centrifuged at 1790 r/min for 20 min, and the cell layer at the interface between PBS and the Percoll separation solution was carefully transferred to a clean 1.5mL EP tube. The collected cells were centrifuged again at 1400 r/min for 5 min, treated with red blood cell lysis buffer at room temperature for 3 min, and centrifuged once more at 1400 r/min for 5 min. The cells were washed with ice-cold washing buffer and PBS, and then stained with toluidine blue for mast cell identification. 2.13 Extraction and purification of peritoneal MC-EXOs The cell culture supernatant of isolated mast cells was collected, centrifuged to remove debris and was thawed rapidly in a 37°C water bath, transferred to a new centrifuge tube, and centrifuged at 2,000g for 30 min. The supernatant was carefully transferred to a new centrifuge tube and centrifuged at 10,000g for 45 min to remove larger vesicles. The supernatant was collected and was filtered through membrane filter (0.45 µm), the filtrate was centrifuged at 100,000g for 70 min, after supernatant removal and resuspended in 10 mL precooled PBS, the precipitated complex was centrifuged at 100,000g for 70 min. A total of 20µL of the final cell suspension was used for TEM, 20µL for particle size analysis, and 20µL for fluorescence-based detection of exosome-FLAG protein expression. The remaining samples were stored at -80°C for subsequent analyses. 2.14 High-throughput sequencing and enrichment analyses of peritoneal MC-EXOs Total RNA was extracted from peritoneal MC-EXOs for library construction and sequenced using the Illumina Hiseq Xten platform. Total RNA samples were quality-checked using RNA Pico Chips on an Agilent 2100 bioanalyzer (Agilent technologies, US). Sequencing was performed according to the Illumina Xten User Guide Manual, the process was controlled by the data collection software provided by Illumina, and real-time data analysis was performed. Differentially expressed miRNAs (DE-miRNAs) were identified based on a threshold of P ≤ 0.05 and fold change ≥ 2. GO and KEGG enrichment analyses were subsequently performed on the identified DE-miRNAs. 2.15 qPCR validation of DE-miRNAs The expression levels of miR-22-5p, miR-1-3p and miR-149-5p in the extracted MC-EXOs were validated using qPCR. The primer sequences are listed in  Table 2 Table 2 Primer sequences for DE-miRNAs. Primer name Sequence U6-F CTCGCTTCGGCAGCACA U6-R AACGCTTCACGAATTTGCGT miR-22-5p-F AGTTCTTCAGTGGCAA miR-1-3p-F TCGGCAGGTGGAATGTAAAGAAGT miR-149-5p-F TCTGGCTCCGTGTCTTC common downstream primer for miR CAGTGCAGGGTCCGAGGTAT 2.16 Administration of miR-149-5p-overexpressing adeno-associated viruses Adeno-associated virus (AAV) vectors overexpressing miR-149-5p were constructed by Hanheng Biological Co. Ltd (Shanghai, China). The virus titer was 1012 vg/mL, and the stock was stored at -80°C. Prior to IBS-D induction, rats in the EA+AAV-miR group and EA+AAV-NC group received intraperitoneal injections of 200 μL of AAV-miR-149-5p and control AAVs, respectively. Following AAV administration, the rats in both groups underwent the same experimental procedures described in  Figure 1A 2.17  In vitro Caco-2 cells were cultured until a dense monolayer was formed in a transwell, then treated for 24 h at 37°C and 5% CO 2 Monolayer permeability was assessed using fluorescein isothiocyanate-dextran 40 (FD-40). Briefly, the culture medium was removed from the upper and lower chambers, and 500µL of Hank’s solution containing 50µg of FD-40 was added to the upper chamber. After two hours of incubation, the solution from the lower chamber was collected, and fluorescence intensity was measured using a microplate reader to calculate FD-40 concentration. The full experimental workflow is illustrated in  Figure 1D 2.18 Statistical analysis Statistical analyses were conducted using SPSS 26.0 and Graphpad Prism 8.0.2. For normally distributed data with homogenous variance, one-way analysis of variance (One-way ANOVA) with FDR correction was used for multi-group comparisons to compare differences among groups, P Post-hoc 3 Results 3.1 EA alleviates IBS-D symptoms and restores intestinal function Visceral hypersensitivity, a key feature that distinguishes IBS from other gastrointestinal diseases, is commonly measured by the visceral pain threshold. Additionally, diarrhea is a hallmark symptom that differentiates IBS-D from other IBS subtypes, and its severity is evaluated using the diarrhea index (DI). OT%, a commonly used indicator of mood disorders, has been shown to be inversely correlated with the degree of anxiety. As shown in  Figures 2A, B, D P P P P P Figure 2 EA alleviates IBS-D symptoms and reduces intestinal permeability. Bar: mean ± SE, △△ P ▲▲ P (A) (B) (C) (D) (E) Graphical data showing the effects of treatment on various parameters, including visceral pain threshold (A), diarrhea index (B), serum DAO concentrations (C), and OT percentage (D), across control, model, and EA groups, with significant differences indicated. Micrographs (E) compare tissue morphology among the control, model, and EA treatments, highlighting changes with arrows. As a functional gastrointestinal disorder, IBS does not typically cause structural abnormalities in the colon. Consistent with this, histological analysis revealed no marked pathological changes in the colonic tissues in any group, with occasional scattered neutrophils observed in the interstitial space of the model and EA groups (  Figure 2E Serum DAO is a sensitive marker of intestinal permeability. As shown in  Figure 2C P P 3.2 EA improved intestinal barrier function in IBS-D rats by inhibiting mast cell activation and exosome secretion and reducing intestinal permeability Previous work from this laboratory demonstrated the importance of CRF signaling and mast cell activation in EA-mediated restoration of intestinal barrier functions in IBS-D rats. qPCR analysis showed that CRF and CRF-R1 expression levels were significantly upregulated in the model group compared to the control group (both P P <  Figure 3B P P P Figure 3 EA enhanced intestinal barrier function by downregulating CRF/CRF-R1 expression and inhibiting mast cell activation. Bar: mean ± SE, △△ P △ P ▲▲ P ▲ P ◼◼ P ◼ P (A) (B) (C) (D) (E) (F) (G) A set of scientific images shows various experimental results related to a study. Panel A contains microscopic images labeled Control, Model, EA, and others, featuring cellular structures marked with arrows. Panel B includes bar graphs illustrating the relative expression levels of CRF and CRF-R1 across different treatments. Panel C displays histological images of tissue sections under various conditions. Panel D presents microscopic images, again labeled with different conditions, showing detailed cellular components. Panel E and F contain bar graphs detailing cell positivity percentages and serum DAO concentrations, respectively. Panel G shows protein expression levels via Western blotting with accompanying bar graphs for ZO-1, Occludin, and Claudin-1. TEM was performed to examined the ultrastructural of mucosal mast cells. Mast cells in the control and EA groups displayed normal morphology and intact cellular structures. In contrast, the model group exhibited secretory granules, mild mitochondrial swelling, and a widened perinuclear space. The EA+Ucn1 group showed pronounced degranulation and autophagy activation, whereas the EA+C48/80 group had widened perinuclear space, mild autophagy, mitochondrial swelling, and dilated endoplasmic reticulum. The EA+GW4869 group exhibited only mild signs of autophagy (  Figure 3A To further evaluate mast cell activation, tryptase expression was quantified by IHC (  Figure 3C P P P P  Figure 3E TEM of the intestinal epithelium revealed orderly arranged epithelium cells with intact tight junctions in the control group. On the other hand, epithelial cell apoptosis, mild autophagy, and disrupted tight junctions were observed in the model group. Tight junctions remained intact in the EA and EA+GW4869 groups but were compromised in the EA+Ucn1 and EA+C48/80 groups (  Figure 3D P P P P P  Figure 3G Similarly, serum DAO concentrations were markedly elevated in the model group relative to the control group ( P P  Figure 3F 3.3 EA modulated miRNA expression in peritoneal MC-EXOs Rat peritoneal mast cells were isolated and cultured ex vivo  Figure 4A  Figure 4B 9  Figure 4D  Figure 4C Figure 4 EA modulated miRNA expression levels in MC-EXOs. (A) (B) (C) (D) (E) (F) (G) (H) △△ P △ P ▲▲ P ◼◼ P ◼ P Panel A shows a microscope image of small particles. Panel B contains three electron microscope images displaying circular and irregular structures. Panel C presents three scatter plots measuring fluorescence intensity versus side scatter for IgG, CD9, and CD81. Panel D displays a histogram of particle size distribution. Panel E consists of two heat maps comparing the expression of various microRNAs across different groups. Panel F contains a Venn diagram illustrating overlap in gene expression changes between groups. Panel G shows bar graphs of enriched pathways categorized by color. Panel H includes four bar graphs comparing data across different experimental conditions. Next, high-throughput sequencing was performed to identify differentially expressed miRNAs (DE-miRNAs) in MC-EXOs across the experimental groups. Compared to the control group, the model group exhibited five upregulated and four downregulated miRNAs. Additionally, ten miRNAs were significantly upregulated in the model group compared to the EA group (  Figure 4E  Figure 4F To validate these findings, qPCR was conducted to quantify the levels of the three DE-miRNAs in peritoneal MC-EXOs in each group. The data showed that miR-149-5p, miR-22-5p and miR-1-3p were significantly upregulated in the model group compared to the control group. However, miR-149-5p and miR-22-5p were significant lower in the EA and EA+GW4869 groups than in the model group. Moreover, compared to the EA group, miR-149-5p and miR-22-5p were significantly elevated in the EA+Ucn1 and EA+C48/80 groups, but remained comparable in the EA+GW4869 group, consistent with the sequencing results (  Figure 4H The target genes of the DE-miRNAs were predicted using miRwalk 3.0 ( 26 27 https://david.ncifcrf.gov/  Figure 4G 3.4 MiR-149-5p and miR-22-5p mimics cause intestinal barrier dysfunction in vitro Given that miR-149-5p and miR-22-5p were the common DE-miRNAs across experimental groups, they were selected for further functional analysis. Caco-2 cells were transfected with miR-149-5p and miR-22-5p mimics to examine the effects of these miRNAs on intestinal permeability. qPCR confirmed significantly elevated expression levels of both miRNAs in transfected cells compared to the respective negative controls ( P  Figure 5B P  Figure 5A Figure 5 miR-149-5p and miR-22-5p expression increases intestinal permeability. Bar: mean ± SE, △△ P △ P (A) (B) (C) Bar charts and Western blot analysis compare FD-40 concentrations, miRNA expression levels, and protein expression in cells treated with miRNA mimics. Chart A shows higher FD-40 in miR-149-5p and miR-22-5p mimics. Chart B displays increased miRNA expression with these mimics. Chart C illustrates Western blots for proteins ZO-1, Occludin, Claudin-1, and GAPDH, with corresponding bar graphs indicating decreased protein levels for ZO-1, Occludin, and Claudin-1 in the miRNA mimic samples compared to miRNA mimic negative. The standard error is shown for all bars. To validate the effects of miR-149-5p and miR-22-5p on tight junction proteins, WB was performed. As shown in  Figure 5C 3.5 AAV-miR-149-5p injection abolished the protective effect of EA in IBS-D rats A previous study reported that miR-149-5p overexpression may regulate expressions of tight junction proteins ( 28 29  Figures 6A–C P P P P P P P  Figure 6D  Figure 6E Figure 6 AAV-miR-149-5p injection abrogates the ameliorative effect of EA in IBS-D. Bar: mean ± SE, △△ P △ P ▲▲ P ▲ P ◼◼ P ◼ P (A) (B) (C) (D) (E) (F) (G) (H) (I) (J) Graphs A-D display metrics such as visceral pain threshold, diarrhea index, and related measures before and after modeling and EA treatment. E shows histological images from control, model, and treatment groups. F presents a cell image. G depicts dot plots for IgG, CD9, and CD81 expression. H shows a size distribution histogram. I includes microscopic images of particles. J is a bar graph of miRNA-9 expression across groups. Peritoneal mast cells were isolated from each group and identified using toluidine blue staining (  Figure 6F 30 9  Figures 6G–I P P P  Figure 6J IHC staining for ZO-1, Occludin and Claudin-1 demonstrated that the percentage of tight junction protein-positive areas was significantly reduced in the model group compared to the control, EA, and EA+AAV-NC groups (all P P  Figures 7A–C  Figure 7D Figure 7 AAV-miR-149-5p injection drives intestinal barrier dysfunction. Bar: mean ± SE, △△ P △ P ▲▲ P ▲ P ◼◼ P (A) (B) (C) (D) Panels A, B, and C show bar graphs and microscope images of intestinal tissues stained for ZO-1, Occludin, and Claudin-1 proteins, respectively, across five treatment groups: Control, Model, EA, EA+AAV-miR, and EA+AAV-NC. Panel D presents electron micrographs highlighting ultrastructural changes in the same groups, with arrows indicating specific features. 4 Discussion The present study demonstrated that miR-149-5p carried by MC-EXOs modulates the ameliorative effect of EA on intestinal barrier function in IBS-D ( Figure 8 31 32 33 34 35 Figure 8 Mechanisms of EA-mediated intestinal barrier repair via the regulation of tight junctions through MC-EXO miRNAs in IBS-D rats. TJs, tight junctions; MC-EXOs, mast cell-derived exosomes; IBS-D, diarrhea-predominant irritable bowel syndrome; EA, electroacupuncture; miRNA, microRNA (This figure was created by www.figdraw.com Diagram illustrating the differences between irritable bowel syndrome with diarrhea (IBS-D) and normal conditions in mice. On the left, a stressed mouse and cellular components show activated hypothalamus, CRF, CRF-R1, mast cells, MC-EXO, and intestinal barrier injury with increased permeability. On the right, a normal mouse with normal cellular components shows unactivated hypothalamus, CRF, CRF-R1, mast cells, MC-EXO, and intestinal barrier with normal permeability. Electroacupuncture (EA) is indicated between the two conditions. Consistent with previous findings, this study showed that EA treatment at the ST36 ( Zusanli Tianshu Taichong 35 36 Mast cell degranulation is the primary mode of mast cell activation and plays a critical role in regulating intestinal barrier function ( 37 16 38 39 40 17 24 Exosomes, one of the most representative products of mast cell degranulation ( 41 42 43 44 45 46 Numerous studies have shown that miRNAs regulate intestinal mucosal barrier function in IBS by modulating the expression of tight junction proteins ( 47 48 49 50 23 Both high-throughput sequencing and qPCR analyses of MC-EXOs revealed that the expression levels of miR-22-5p and miR-149-5p were significantly elevated in the model group but reduced in the EA group. These miRNAs were enriched in pathways related to tight junctions, aligning with the present findings. miR-22-5p is known to be a regulator of myocardial, pulmonary, and hepatic functions ( 51 53 54 55 56 57 To further validate the sequencing results, an in vitro 58 59 28 29 in vivo Previous studies have reported that miR-149-5p is significantly upregulated in the IECs of septic rats, resulting in inflammation, tissue injury, and intestinal barrier disruption ( 60 28 Pathway analysis revealed that predicted targets of differentially expressed miRNAs are enriched in “Regulation of Actin Cytoskeleton”, a pathway directly affecting tight junction assembly ( 61 62 63 64 65 Current major IBS-D treatments including 5-HT 3 3 66 67 Several limitations must be noted in the present study. First, although in vitro in vivo in vitro 68 69 5 Conclusion MC-EXO miR-149-5p might modulate the restorative effect of EA on intestinal barrier function by downregulating the expression of tight junction proteins, serving as a potential therapeutic target for IBS-D. Abbreviations IBS-D, diarrhea-predominated irritable bowel syndrome; EA, electroacupuncture; MC-EXOs, mast cell-derived exosomes; miRNAs, microRNAs; CUMS, chronic unpredictable mild stress; AAV, adeno-associated viruses; TCM, traditional Chinese medicine; GI, gastrointestinal; SERT, serotonin reuptake transporter; CRF, colonic corticotropin-releasing factor; CRF, receptor 1 (CRF-R1); IEC, intestinal epithelial cell; GO, Gene Ontology; KEGG, Kyoto Encyclopedia of Genes and Genomes. Data availability statement The data presented in the study are deposited in the CNSA repository, accession number CNP0008009. The data can be found here: https://db.cngb.org/data_resources/project/CNP0008009/ Ethics statement The animal study was approved by Experimental Animal Welfare Ethics Committee at the Chengdu University of Traditional Chinese Medicine. The study was conducted in accordance with the local legislation and institutional requirements. Author contributions YH: Conceptualization, Writing – original draft. FL: Writing – original draft. KW: Data curation, Formal analysis, Investigation, Writing – original draft. YC: Data curation, Writing – original draft. LW: Formal analysis, Investigation, Writing – original draft. YaL: Formal analysis, Investigation, Writing – original draft. SW: Software, Writing – original draft. JY: Methodology, Writing – original draft. YiL: Supervision, Writing – review & editing. SZ: Conceptualization, Project administration, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Sperber AD Bangdiwala SI Drossman DA Ghoshal UC Simren M Tack J Worldwide prevalence and burden of functional gastrointestinal disorders, results of rome foundation global study Gastroenterology 2021 160 99 114 10.1053/j.gastro.2020.04.014 32294476 2 Buono JL Carson RT Flores NM Health-related quality of life, work productivity, and indirect costs among patients with irritable bowel syndrome with diarrhea Health Qual Life outcomes 2017 15 35 10.1186/s12955-017-0611-2 28196491 PMC5310011 3 Jacobs JP Lagishetty V Hauer MC Labus JS Dong TS Toma R Multi-omics profiles of the intestinal microbiome in irritable bowel syndrome and its bowel habit subtypes Microbiome 2023 11 5 10.1186/s40168-022-01450-5 36624530 PMC9830758 4 Moayyedi P Mearin F Azpiroz F Andresen V Barbara G Corsetti M Irritable bowel syndrome diagnosis and management: A simplified algorithm for clinical practice U Eur Gastroenterol J 2017 5 773–88 10.1177/2050640617731968 29026591 PMC5625880 5 Albert-Bayo M Paracuellos I González-Castro AM Rodríguez-Urrutia A Rodríguez-Lagunas MJ Alonso-Cotoner C Intestinal mucosal mast cells: key modulators of barrier function and homeostasis Cells 2019 8 135 10.3390/cells8020135 30744042 PMC6407111 6 Vito RD Mezza AD Conte C Traina G The crosstalk between intestinal epithelial cells and mast cells is modulated by the probiotic supplementation in co-culture models Int J Mol Sci 2023 24 4157 10.3390/ijms24044157 36835568 PMC9963420 7 Lee H Park JH Park DI Kim HJ Cho YK Sohn CI Mucosal mast cell count is associated with intestinal permeability in patients with diarrhea predominant irritable bowel syndrome J Neurogastroenterol Motil 2013 19 244–50 10.5056/jnm.2013.19.2.244 23667756 PMC3644661 8 Wang Y Tan Q Pan M Yu J Wu S Tu W Minimally invasive vagus nerve stimulation modulates mast cell degranulation via the microbiota-gut-brain axis to ameliorate blood-brain barrier and intestinal barrier damage following ischemic stroke Int Immunopharmacol 2024 132 112030 10.1016/j.intimp.2024.112030 38603861 9 Hsieh JT Rathore APS Soundarajan G John ALS Japanese encephalitis virus neuropenetrance is driven by mast cell chymase Nat Commun 2019 10 706 10.1038/s41467-019-08641-z 30742008 PMC6370868 10 Kageyama K Iwasaki Y Daimon M Hypothalamic regulation of corticotropin-releasing factor under stress and stress resilience Int J Mol Sci 2021 22 12242 10.3390/ijms222212242 34830130 PMC8621508 11 Coelho A-M Vergnolle N Guiard B Fioramonti J Bueno L Proteinases and proteinase-activated receptor 2: a possible role to promote visceral hyperalgesia in rats Gastroenterology 2002 122 1035–47 10.1053/gast.2002.32387 11910355 12 Guilarte M Vicario M Martínez C Id T Lobo B Pigrau M Peripheral corticotropin-releasing factor triggers jejunal mast cell activation and abdominal pain in patients with diarrhea-predominant irritable bowel syndrome Am J Gastroenterol 2020 115 2047–59 10.14309/ajg.0000000000000789 32740086 13 Chatoo M Li Y Ma Z Coote J Du J Chen X Involvement of corticotropin-releasing factor and receptors in immune cells in irritable bowel syndrome Front Endocrinol 2018 9 21 10.3389/fendo.2018.00021 29483895 PMC5816029 14 Nozu T Okumura T Corticotropin-releasing factor receptor type 1 and type 2 interaction in irritable bowel syndrome J Gastroenterol 2015 50 819–30 10.1007/s00535-015-1086-8 25962711 15 Yaklai K Pattanakuhar S Chattipakorn N Chattipakorn SC The role of acupuncture on the gut-brain-microbiota axis in irritable bowel syndrome Am J Chin Med 2021 49 285 314 10.1142/S0192415X21500154 33622207 16 Hou Y-J Wang K Jiang H-L Chen Y Yao J-P Li Y Study on the mechanism of electroacupuncture repairing intestinal barrier via regulating mast cell in rats with diarrhea-predominant irritable bowel syndrome Zhen ci yan jiu = Acupunct Res 2023 48 281–6 10.13702/j.1000-0607.20220147 36951081 17 Chen Y Zhao Y Luo D-N Zheng H Li Y Zhou S-Y Electroacupuncture regulates disorders of gut-brain interaction by decreasing corticotropin-releasing factor in a rat model of IBS Gastroenterol Res Pract 2019 2019 1759842 10.1155/2019/1759842 31737064 PMC6815621 18 Shefler I Salamon P Mekori YA Extracellular vesicles as emerging players in intercellular communication: relevance in mast cell-mediated pathophysiology Int J Mol Sci 2021 22 9176 10.3390/ijms22179176 34502083 PMC8431297 19 Kalluri R LeBleu VS The biology, function, and biomedical applications of exosomes Science (New York NY) 2020 367 6478 eaau6977 10.1126/science.aau6977 32029601 PMC7717626 20 Carroll-Portillo A Surviladze Z Cambi A Lidke DS Wilson BS Mast cell synapses and exosomes: membrane contacts for information exchange Front Immunol 2012 3 46 10.3389/fimmu.2012.00046 22566928 PMC3342342 21 Robbins PD Dorronsoro A Booker CN Regulation of chronic inflammatory and immune processes by extracellular vesicles J Clin Invest 2016 126 1173–80 10.1172/JCI81131 27035808 PMC4811148 22 Hagiwara S-I Hasdemir B Heyman MB Chang L Bhargava A Plasma corticotropin-releasing factor receptors and B7-2 + Cells 2019 8 101 10.3390/cells8020101 30704133 PMC6406316 23 Li M Zhao J Cao M Liu R Chen G Li S Mast cells-derived MiR-223 destroys intestinal barrier function by inhibition of CLDN8 expression in intestinal epithelial cells Biol Res 2020 53 12 10.1186/s40659-020-00279-2 32209121 PMC7092522 24 Hou Y Zhao Y Jiang H Wang K Zhang W Zhou S Maintenance of intestinal homeostasis in diarrhea-predominant irritable bowel syndrome by electroacupuncture through submucosal enteric glial cell-derived S-nitrosoglutathione Front Physiol 2022 13 917579 10.3389/fphys.2022.917579 36105292 PMC9465678 25 Fond G Loundou A Hamdani N Boukouaci W Dargel A Oliveira J Anxiety and depression comorbidities in irritable bowel syndrome (IBS): a systematic review and meta-analysis Eur Arch Psychiatry Clin Neurosci 2014 264 651–60 10.1007/s00406-014-0502-z 24705634 26 Li H Han X Du W Meng Y Li Y Sun T Comparative miRNA transcriptomics of macaques and mice reveals MYOC is an inhibitor for Cryptococcus neoformans invasion into the brain Emerg Microbes Infect 2022 11 1572–85 10.1080/22221751.2022.2081619 35621025 PMC9176638 27 Sticht C Torre CDL Parveen A Gretz N miRWalk: An online resource for prediction of microRNA binding sites PLoS One 2018 13 e0206239 10.1371/journal.pone.0206239 30335862 PMC6193719 28 Forouzandeh M Mostafavi H Ghasemloo E Mohammadi P Hosseini M Eskandari M Increased expression of tight junction proteins and blood-brain barrier integrity in MCAO rats following injection of miR-149-5p Int J Mol Cell Med 2022 11 223–35 10.22088/IJMCM.BUMS.11.3.223 37605737 PMC10440002 29 Guo J Lu G Chen L Geng H Wu X Chen H Regulation of serum microRNA expression by acupuncture in patients with diarrhea-predominant irritable bowel syndrome Acupunct Med 2022 40 34 42 10.1177/09645284211027892 34231397 30 Salunkhe S Dheeraj Basak M Chitkara D Mittal A Surface functionalization of exosomes for target-specific delivery and in vivo J Controlled release 2020 326 599 614 10.1016/j.jconrel.2020.07.042 32730952 31 Martínez C Lobo B Pigrau M Ramos L Ana Maria González-Castro CA Guilarte M Diarrhoea-predominant irritable bowel syndrome: an organic disorder with structural abnormalities in the jejunal epithelial barrier Gut 2013 62 1160–8 10.1136/gutjnl-2012-302093 22637702 32 Ludidi S Jonkers D Elamin E Pieters H-J Esther Schaepkens 1 PB, Joanna Kruimel 1, José Conchillo 1, Ad Masclee The intestinal barrier in irritable bowel syndrome: subtype-specific effects of the systemic compartment in an in vitro PLoS One 2015 10 e0123498 10.1371/journal.pone.0123498 25978614 PMC4433176 33 Ilchmann-Diounou H Menard S Psychological stress, intestinal barrier dysfunctions, and autoimmune disorders: an overview Front Immunol 2020 11 1823 10.3389/fimmu.2020.01823 32983091 PMC7477358 34 Qin H-Y Cheng C-W Tang X-D Bian Z-X Impact of psychological stress on irritable bowel syndrome World J Gastroenterol 2014 20 14126–31 10.3748/wjg.v20.i39.14126 25339801 PMC4202343 35 Zhao Y Jiang H-L Shi Y Zhang W Zhang L-X JH Y- Electroacupuncture alleviates visceral hypersensitivity in IBS-D rats by inhibiting EGCs activity through regulating BDNF/TrkB signaling pathway Evidence-Based Complement Altern Med: eCAM 2022 2022 2497430 10.1155/2022/2497430 35198032 PMC8860523 36 Tang Y Tang X Wen Q Analysis of electroacupuncture parameters for irritable bowel syndrome: A data mining approach J Pain Res 2025 18 2175–89 10.2147/JPR.S483750 40290613 PMC12034281 37 Kayama H Okumura R Takeda K Interaction between the microbiota, epithelia, and immune cells in the intestine Annu Rev Immunol 2020 38 23 48 10.1146/annurev-immunol-070119-115104 32340570 38 Theoharides TC Perlman AI Twahir A Kempuraj D Mast cell activation: beyond histamine and tryptase Expert Rev Clin Immunol 2023 19 639–54 10.1080/1744666X.2023.2200936 37029958 39 Tache Y Larauche M Yuan P-Q Million M Brain and gut CRF signaling: biological actions and role in the gastrointestinal tract Curr Mol Pharmacol 2018 11 51 71 10.2174/1874467210666170224095741 28240194 PMC8091865 40 Hostetler CM Ryabinin AE The CRF system and social behavior: a review Front Neurosci 2013 7 92 10.3389/fnins.2013.00092 23754975 PMC3668170 41 Vukman KV Försönits A Oszvald Á Tóth EÁ Buzás EI Mast cell secretome: Soluble and vesicular components Semin Cell Dev Biol 2017 67 65 73 10.1016/j.semcdb.2017.02.002 28189858 42 Hou C-C Ma H-F Ye J-F Luo D Bao H-F Guan J-L Plasma exosomes derived from patients with intestinal Behçet's syndrome induce intestinal epithelial cell pyroptosis Clin Rheumatol 2021 40 4143–55 10.1007/s10067-021-05755-y 33954847 43 Fu R Liu S Zhu M Zhu J Chen M Apigenin reduces the suppressive effect of exosomes derived from irritable bowel syndrome patients on the autophagy of human colon epithelial cells by promoting ATG14 World J Surg Oncol 2023 21 95 10.1186/s12957-023-02963-5 36915121 PMC10012571 44 Xing Y Xue S Wu J Zhou J Xing F Li T Serum Exosomes Derived from Irritable Bowel Syndrome Patient Increase Cell Permeability via Regulating miR-148b-5p/RGS2 Signaling in Human Colonic Epithelium Cells Gastroenterol Res Pract 2021 2021 6655900 10.1155/2021/6655900 34221007 PMC8219443 45 Zhang J Wang M Hu X Li N Loh P Gong Y Electroacupuncture-driven endogenous circulating serum exosomes as a potential therapeutic strategy for sepsis Chin Med 2023 18 106 10.1186/s13020-023-00816-7 37635258 PMC10463748 46 Chen B Li M-Y Guo Y Zhao X Lim H-MC Mast cell-derived exosomes at the stimulated acupoints activating the neuro-immune regulation Chin J Integr Med 2017 23 878–80 10.1007/s11655-016-2269-8 27650095 47 Zhang X Shi L Chen C Ma Y Ma Y The role of miRNA in IBS pathogenesis, diagnosis and therapy: The latest thought Dig liver Dis 2024 56 1433–41 10.1016/j.dld.2024.01.209 38342744 48 Elieh-Ali-Komi D Shafaghat F Alipoor SD Kazemi T Atiakshin D Pyatilova P Immunomodulatory significance of mast cell exosomes (MC-EXOs) in immune response coordination Clin Rev Allergy Immunol 2025 68 20 10.1007/s12016-025-09033-6 39976807 PMC11842441 49 Shen Q Huang Z Ma L Yao J Luo T Yao Zhao 2 YX, Yuanxiang Jin Extracellular vesicle miRNAs promote the intestinal microenvironment by interacting with microbes in colitis Gut Microbes 2022 14 2128604 10.1080/19490976.2022.2128604 36176029 PMC9542864 50 Yang H Chen J Liu S Xue Y Li Z Wang T Exosomes from igE-stimulated mast cells aggravate asthma-mediated atherosclerosis through circRNA CDR1as-mediated endothelial cell dysfunction in mice Arterioscler thromb Vasc Biol 2024 44 e99 e115 10.1161/ATVBAHA.123.319756 38235556 51 He H Zhu Y Ji X Pu S Zheng H The miR-22-5p/Clec4e axis has diagnostic potential in fructose-induced nonalcoholic fatty liver disease Biochem Biophys Res Commun 2025 753 151496 10.1016/j.bbrc.2025.151496 39978254 52 Wang Y Chang W Zhang Y Zhang L Ding H Qi H Circulating miR-22-5p and miR-122-5p are promising novel biomarkers for diagnosis of acute myocardial infarction J Cell Physiol 2019 234 4778–86 10.1002/jcp.27274 30256407 53 Gajewski A Bekier A Frachowicz-Guereirro K Drożdż I Ćwikliński R Kurowski M Analysis of miRNA expression in patients with NSAID-exacerbated respiratory disease Allergy Asthma Immunol Res 2025 17 226–40 10.4168/aair.2025.17.2.226 40204507 PMC11982641 54 Deng C Huo M Chu H Zhuang X Deng G Li W Exosome circATP8A1 induces macrophage M2 polarization by regulating the miR-1-3p/STAT6 axis to promote gastric cancer progression Mol cancer 2024 23 49 10.1186/s12943-024-01966-4 38459596 PMC10921793 55 Dai S Li F Xu S Hu J Gao L The important role of miR-1-3p in cancers J Trans Med 2023 21 769 10.1186/s12967-023-04649-8 37907984 PMC10617136 56 Sun T-Y Li Y-Q Zhao F-Q Sun H-M Gao Y Wu B MiR-1-3p and miR-124-3p synergistically damage the intestinal barrier in the ageing colon J Crohn's colitis 2022 16 656–67 10.1093/ecco-jcc/jjab179 34628497 PMC9089420 57 Kankuri E Deficiency of miRNA-149-3p shaped gut microbiota and enhanced dextran sulfate sodium-induced colitis Mol Ther Nucleic Acids 2023 31 367–9 10.1016/j.omtn.2023.01.011 36817725 PMC9929482 58 Ren F-J Yao Y Cai X-Y Cai Y-T Su Q Fang G-Y MiR-149-5p: an important miRNA regulated by competing endogenous RNAs in diverse human cancers Front Oncol 2021 11 743077 10.3389/fonc.2021.743077 34722295 PMC8554335 59 Oto J Plana E Solmoirago MJ Fernández-Pardo Á Hervás D Cana F microRNAs and markers of neutrophil activation as predictors of early incidental post-surgical pulmonary embolism in patients with intracranial tumors Cancers 2020 12 1536 10.3390/cancers12061536 32545233 PMC7353032 60 Caidengbate S Akama Y Banerjee A Mokmued K Kawamoto E Gaowa A MicroRNA profiles in intestinal epithelial cells in a mouse model of sepsis Cells 2023 12 726 10.3390/cells12050726 36899862 PMC10001189 61 Zihni C Mills C Matter K Balda MS Tight junctions: from simple barriers to multifunctional molecular gates Nat Rev Mol Cell Biol 2016 17 564–80 10.1038/nrm.2016.80 27353478 62 Morales W Rezaie A Barlow G Pimentel M Second-generation biomarker testing for irritable bowel syndrome using plasma anti-cdtB and anti-vinculin levels Dig Dis Sci 2019 64 3115–21 10.1007/s10620-019-05684-6 31152332 63 Pastwińska J Żelechowska P Walczak-Drzewiecka A Brzezińska-Błaszczyk E Dastych J The art of mast cell adhesion Cells 2020 9 2664 10.3390/cells9122664 33322506 PMC7764012 64 Zhou X Zhang Y-C Lu K-Q Xiao R Tang W-C Wang F The role of p38 mitogen-activated protein kinase-mediated F-actin in the acupuncture-induced mitigation of inflammatory pain in arthritic rats Brain Sci 2024 14 380 10.3390/brainsci14040380 38672029 PMC11048453 65 Liao L Zhang L Yang M Wang X Huang W Wu X Expression profile of SYNE3 and bioinformatic analysis of its prognostic value and functions in tumors J Trans Med 2020 18 355 10.1186/s12967-020-02521-7 32948197 PMC7501639 66 Bielefeldt K Ischemic colitis as a complication of medication use: an analysis of the federal adverse event reporting system Dig Dis Sci 2016 61 2655–65 10.1007/s10620-016-4162-x 27073073 67 Besselink MG Santvoort H Buskens E Boermeester MA Goor HV Timmerman HM Probiotic prophylaxis in predicted severe acute pancreatitis: a randomised, double-blind, placebo-controlled trial Lancet (London England) 2008 371 651–9 10.1016/S0140-6736(08)60207-X 18279948 68 Velez TE Bryce PJ Hulse KE Mast cell interactions and crosstalk in regulating allergic inflammation Curr Allergy Asthma Rep 2018 18 30 10.1007/s11882-018-0786-6 29667026 PMC6767912 69 Nanagas VC Kovalszki A Gastrointestinal manifestations of hypereosinophilic syndromes and mast cell disorders: a comprehensive review Clin Rev Allergy Immunol 2019 57 194 212 10.1007/s12016-018-8695-y 30003499 ",
  "metadata": {
    "Title of this paper": "Gastrointestinal manifestations of hypereosinophilic syndromes and mast cell disorders: a comprehensive review",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484196/"
  }
}