{
  "title": "Paper_895",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471631 PMC12471631.1 12471631 12471631 41010960 10.3390/medicina61091569 medicina-61-01569 1 Review Proton Pump Inhibitors (PPIs)—An Evidence-Based Review of Indications, Efficacy, Harms, and Deprescribing https://orcid.org/0009-0008-9527-1685 Andrawes Monica † Andrawes Wessam † https://orcid.org/0000-0003-4836-7971 Das Abhishek https://orcid.org/0000-0002-1273-9561 Siau Keith * Shelat Vishal G. Academic Editor Royal Cornwall Hospital NHS Trust, Truro TR1 3LJ, UK; monica.andrawes@nhs.net wessam.andrawes@nhs.net abhishek.das3@nhs.net * keithsiau@nhs.net † These authors contributed equally to this work. 31 8 2025 9 2025 61 9 497654 1569 29 7 2025 20 8 2025 25 8 2025 31 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Proton pump inhibitors (PPIs) are among the most prescribed drugs worldwide owing to their proven efficacy in symptom control and mucosal healing for acid-related disorders including gastroesophageal reflux disease (GORD), peptic ulcer disease, Helicobacter pylori eradication, functional dyspepsia, and gastroprotection in high-risk patients. However, long-term use beyond approved indications is increasingly common and has raised safety concerns. Observational studies link chronic PPI use to a myriad of adverse outcomes such as enteric infections (e.g., Clostridioides difficile), nutrient deficiencies (magnesium, vitamin B12), osteoporotic fractures, chronic kidney disease, dementia, and gastric and colorectal cancer. While causality is not always established, these associations warrant cautious risk–benefit assessment in patients receiving prolonged therapy. Current guidelines advocate periodic review of ongoing PPI use and emphasise deprescribing where appropriate. Strategies include dose reduction, on-demand or intermittent use, and switching to H2-receptor antagonists, particularly in patients with non-erosive reflux disease or functional dyspepsia. Tools from the National Institute for Health and Clinical Excellence, American College of Gastroenterology, and the Canadian Deprescribing Network assist clinicians in identifying candidates for tapering or discontinuation. This narrative review focuses on the concept of “PPI stewardship” by providing an evidence-based overview of PPI indications, risks, and deprescribing strategies to promote appropriate, safer, and patient-centred use of acid-suppressive therapy. proton pump inhibitors PPI stewardship adverse effects deprescribing acid suppression medication safety This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Since their introduction in 1989, proton pump inhibitors (PPIs) have become increasingly used worldwide for both therapeutic and prophylactic indications [ 1 2 3 + + 4 5 6 7 8 9 10 7 11 In Asia, national datasets highlight substantial PPI utilisation with high absolute volumes observed in China, particularly inpatient and injectable use between 2017 and 2021, while a sharp increase was seen in South Korea after ranitidine withdrawal (≈3929 doses/100,000/day) and growing but regionally heterogeneous PPI use in India [ 9 12 13 There is growing concern with the widespread inappropriate initiation and prolonged duration of PPI therapy. A recent systematic review and meta-analysis estimated that up to 60% of PPI prescriptions lack a valid indication [ 14 14 15 This overuse has drawn scrutiny from scientific and regulatory bodies due to increasing observational data associating long-term PPI use with potential harm. While causality remains uncertain, the consistency and biological plausibility of certain findings have prompted regulatory agencies such as the U.S. Food and Drug Administration (FDA) and the European Medicines Agency (EMA) to issue safety warnings and encourage periodic reassessment of therapy [ 1 16 17 Recognising the gap between evidence-based indications and real-world prescribing, recent guidelines emphasise the need for PPI stewardship, including regular review and deprescribing where appropriate. Tools such as the Beers Criteria [ 18 19 3 20 This narrative review focuses on PPI stewardship and provides current evidence on approved and off-label indications, comparative efficacy, and the spectrum of risks associated with prolonged PPI use. We also aim to outline practical, guideline-aligned strategies for prescribing, monitoring, and deprescribing to support safe and effective PPI use in clinical practice. 2. Methods This narrative review was compiled following a literature search of three primary databases: Cochrane Library, PubMed, and Embase from 1999 to 2025. Search terms included combinations of the following keywords: “Proton Pump Inhibitors,” “PPIs,” “gastroesophageal reflux disease,” “peptic ulcer,” “PPIs co-prescription,” “deprescribing,” “long-term PPI use,” “H2R blockers,” “cytoprotective agents,” and “potassium competitive acid blockers (PCABs).” Priority was allocated to national and international clinical guidelines, such as the National Institute for Health and Care Excellence (NICE), British Society of Gastroenterology (BSG), and the American College of Gastroenterology (ACG), systematic reviews, meta-analyses, and randomised controlled trials. Observational studies were included when trial data were lacking or to address rare adverse outcomes. Inclusion criteria comprised studies or guidelines reporting on PPI indications, efficacy, co-prescribing, adverse effects, or deprescribing. Exclusion criteria comprised paediatric populations, non-English publications, abstracts without full text, and studies without clinically relevant data. 3. Indications of PPIs The indications of PPI therapy depend on the underlying condition, treatment duration, and goals of therapy ( Table 1 3 21 22 23 In contrast, “maintenance therapy” refers to long-term PPI use aimed at preventing relapse or complications and should be prescribed at the lowest effective dose or on-demand dosing. Continuous daily PPI therapy is indicated in patients with high-risk conditions such as severe erosive esophagitis (Los Angeles grade C/D), Barrett’s oesophagus, active peptic ulcer bleeding, recurrent ulcer disease, or Zollinger–Ellison syndrome. Conditions in which PPIs should be avoided to reduce the risk of long-term harms are listed in Table 2 22 3.1. Co-Prescribing of PPIs NICE recommends routine PPI prophylaxis in individuals over 45 years of age receiving long-term NSAIDs for chronic conditions such as osteoarthritis and rheumatoid arthritis [ 25 26 27 25 28 3.1.1. Antiplatelet Therapy PPIs are frequently prescribed with aspirin or clopidogrel to reduce the risk of gastrointestinal bleeding [ 29 30 31 32 Table 3 H. pylori 33 3.1.2. Helicobacter Pylori with Antiplatelet Therapy The European Society of Gastrointestinal Endoscopy (ESGE) and European Society of Cardiology (ESC) jointly recommend testing and eradication of H. pylori 34 H. pylori 35 30 3 H. pylori Practical Take-Aways While there is consensus that PPIs should be co-prescribed with dual antiplatelet therapy in patients at high risk of gastrointestinal bleeding [ 29 30 31 32 32 29 34 34 35 3.1.3. Anticoagulants PPI co-prescription should also be considered in patients on warfarin or direct oral anticoagulants (DOACs) to reduce the risk of gastrointestinal bleeding, particularly in high-risk individuals [ 36 37 36 37 38 30 39 40 3.1.4. NSAIDs NSAID is one of the most commonly prescribed classes of drugs and one of the leading causes of peptic ulcers. In the United Kingdom, long-term use of NSAIDs causes peptic ulcers in 12–15% of patients. Statistics show that over 12,000 people are hospitalized each year due to NSAID-related upper gastrointestinal bleeding. This costs the NHS around GBP 500 million annually. On a global scale, NSAIDs contribute to over 100,000 deaths each year due to peptic ulcer and related complications. [ 28 41 42 28 43 44 45 46 3.1.5. Corticosteroids PPIs are commonly co-prescribed with systemic corticosteroids to prevent peptic ulcers, although there is limited evidence to support this in practice, which can contribute to overuse. Guidelines from different health organizations differ in their recommendations. NICE guidelines suggest considering PPIs for high-risk patients on corticosteroids, while ACG recommends PPIs for patients on long-term corticosteroids with additional GI risk factors, and the European League Against Rheumatism (EULAR) recommends gastroprotection with PPIs for patients on long term corticosteroids, especially when combined with NSAIDs or other risk factors [ 4 28 47 48 4. Efficacy of Different PPIs PPIs differ in their pharmacokinetic properties, onset of action, and potency of acid suppression. However, their efficacy in clinical practice in treating the common acid-related conditions are broadly comparable. The recognised factors which influence therapeutic outcomes include bioavailability, CYP2C19 metabolism, and duration of gastric acid inhibition ( Table 4 While all PPIs effectively treat GORD, peptic ulcer disease and H Pylori infection, there is variation in 24 h intragastric and oesophageal acid suppression which can affect efficacy in severe GORD, erosive oesophagitis, or in cases requiring high-dose or nocturnal acid relief. Dexlansoprazole offers strongest acid suppression due to its dual delayed-release formulation. On the other hand, pantoprazole is preferred where there is a high risk of drug interactions, polypharmacy, or in patients taking clopidogrel. Comparative trials and meta-analyses ( Table 5 H. pylori PPIs Dosage PPI therapy may be categorised into low, standard, and high doses ( Table 6 3 H. pylori 5. Potential Harms of Long-Term PPI Use The long-term safety of PPIs remains debated, with inconsistent findings across studies. For clinical decision-making, potential harms should be classified according to the level of evidence, strength of association linking PPIs to the adverse event, and biological plausibility. Adverse associations with long-term PPI use are summarised below and in Figure 1 Table 7 5.1. Group 1: Harms with Strong and Consistent Association (Well-Established Risks) 5.1.1. Clostridioide Difficile Infection (CDI) (Short-Term Risk) PPIs are strongly associated with an increased risk of enteric infections, particularly Clostridioides difficile 59 54 60 C. difficile C. difficile 61 58 62 5.1.2. Nutritional Deficiencies (Long-Term Risk) Long-term use may lead to deficiencies in vitamin B12, magnesium, calcium, and iron due to impaired absorption in the setting of hypochlorhydria [ 63 22 57 55 A retrospective cohort study of 98 adults on PPIs for at least one year indicated a decline in haemoglobin, haematocrit, and mean corpuscular volume compared to non-users. After adjustment, PPI users were over five times more likely to experience a significant drop in haemoglobin and haematocrit levels, raising concerns about the potential for iron deficiency anaemia with extended PPI use [ 58 5.1.3. Kidney Disease (Long-Term Risk) PPI use is associated with an increased risk of acute and chronic kidney disease primarily due to acute interstitial nephritis [ 52 53 53 n 52 54 55 54 55 5.2. Group 2: Moderate Association 5.2.1. Osteoporosis and Associated Fractures (Long-Term Risk) Long-term PPI use has been linked with osteoporosis and increased fracture risk, with suggested mechanisms including calcium/B12 malabsorption, gastrin-induced parathyroid hyperplasia, and direct inhibition of osteoclastic vacuolar proton pumps [ 22 61 62 64 65 51 25 65 66 67 68 56 5.2.2. Community-Acquired Pneumonia (CAP) (Short-Term Risk) Short-term PPI therapy has been linked to an increased risk of community-acquired pneumonia (CAP) [ 56 66 2 56 66 67 5.2.3. Small Intestinal Bacterial Overgrowth (SIBO) (Long-Term Risk) PPIs may increase the risk of SIBO, although the clinical significance is debated [ 68 69 70 71 5.3. Group 3: Potential Risks (Weak/Uncertain Association) 5.3.1. Dementia (Long-Term Risk) Some cohort studies, including Haenisch et al. [ 72 70 71 73 Some cohort studies, including Haenisch et al. [ 73 74 75 76 5.3.2. Gastric Neoplasms (Long-Term Risk) A significant population-based study from Hong Kong [ 74 5.3.3. Cardiovascular Outcomes (Long-Term Risk) PPIs may attenuate the antiplatelet effects of clopidogrel, especially omeprazole, potentially increasing cardiovascular events. Bhatt et al. [ 75 PPIs may attenuate the antiplatelet effects of clopidogrel, especially omeprazole, potentially increasing cardiovascular events. Bhatt et al. [ 75 5.3.4. Stroke (Long-Term Risk) A Danish registry study found an increased risk of ischaemic stroke in PPI users, in particular with those taking higher doses and/or for a long duration [ 76 77 A Danish registry study found an increased risk of ischaemic stroke in PPI users, in particular with those taking higher doses and/or for a long duration [ 78 79 6. Overprescribing of PPIs Studies suggest that 25–70% of PPI prescriptions lack an appropriate indication [ 5 Overprescribing is particularly common in primary care and hospital settings. Contributing factors include prescribing for non-specific abdominal symptoms without proper diagnostic workup, inappropriate stress ulcer prophylaxis in non-critically ill patients, failure to de-prescribe after resolution of the initial indication, and perception of PPIs as completely safe medications. Studies suggest that 25–70% of PPI prescriptions lack an appropriate indication [ 80 6.1. Evaluation for Discontinuation Long-term PPI use is often excessive, exposing patients to avoidable costs and potential risks. Deprescribing (dose reduction, on-demand use, or discontinuation) should be routinely considered once the initial treatment course is completed. Patients who have completed appropriate short-term therapy for reflux or ulcer disease should be reviewed and stepped down if no compelling indication remains. UK guidance (e.g., NICE, NHS) recommends reassessing the need for therapy at least annually, with a trial of discontinuation where appropriate. The American Gastroenterological Association (AGA) also supports periodic review, with particular emphasis on tailoring continuation to the underlying indication. Conditions to Avoid Discontinuation Key contraindications to deprescribing include Barrett’s oesophagus, severe esophagitis (LA grade C/D), documented recurrent GI ulcer/bleeding, Zollinger–Ellison or eosinophilic oesophagitis with confirmed PPI response. 6.2. Different Guideline Recommendations 6.2.1. NICE (UK CG184, 2014/2019) NICE (UK CG184, 2014/2019): Emphasises using the lowest effective dose and on-demand therapy. If symptoms recur, it is recommended to step down to the lowest dose and discuss on-demand use. Annual review is advised, with trial of step-down or discontinuation if safe. Patients should be advised on alternative symptom control measures, including antacids, alginate preparations, or lifestyle modifications. H 2 3 6.2.2. AGA/ACG (2022) AGA/ACG (2022): Recommends reviewing the indication for all PPI users. Patients without a clear ongoing indication should be offered a trial of deprescribing. Those on twice-daily dosing should usually be stepped down to once daily. It is not routinely deprescribed in complicated GORD (severe oesophagitis, strictures), Barrett’s oesophagus, eosinophilic oesophagitis, idiopathic pulmonary fibrosis, or patients at high gastrointestinal bleeding risk. Risk assessment tools are advised before withdrawal. Both gradual tapering and abrupt cessation are acceptable. The AGA stresses that decisions should be based on clinical indication, not concerns over potential side effects [ 22 6.2.3. Canadian (2017) For adults with resolved reflux symptoms after ≥4 weeks of PPI, dose reduction or switching to on-demand therapy is strongly recommended. Alternatively, substitution with an H 2 81 Based on these guidelines, we propose a flowchart for deprescribing evaluation ( Figure 2 6.3. Patient Groups and Deprescribing Actions Uncomplicated GORD (mild reflux or NERD): Often suitable for tapering to the lowest dose or switching to on-demand therapy. Up to 80–85% of patients maintain remission with once-daily or on-demand dosing. Patients should be educated about rebound symptoms. Breakthrough can be managed with H2RAs or antacids [ 13 81 Uncomplicated GORD (mild reflux or NERD): Often suitable for tapering to the lowest dose or switching to on-demand therapy. Up to 80–85% of patients maintain remission with once-daily or on-demand dosing. Patients should be educated about rebound symptoms. Breakthrough can be managed with H 2 15 82 Erosive oesophagitis: In mild to moderate disease (LA Grade A/B), step-down can be attempted. Severe oesophagitis (LA Grade C/D) warrants continued full-dose therapy due to high relapse risk. Endoscopic surveillance may guide treatment duration [ 13 81 In mild to moderate disease (LA Grade A/B), step-down can be attempted. Severe oesophagitis (LA Grade C/D) warrants continued full-dose therapy due to high relapse risk. Endoscopic surveillance may guide treatment duration [ 15 82 Barrett’s oesophagus: Generally, PPIs should not be stopped; long-term acid suppression is advised [ 22 81 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 History of GI ulcer or bleeding: At least prophylactic therapy (for NSAIDs) should be maintained or full dose after a recent bleed. ACG explicitly lists prior bleed as a reason to continue PPI [ 25 22 Helicobacter pylori–associated peptic ulcer: The standard 4–8 week PPI course should be completed alongside eradication therapy. Once healed, PPIs can be discontinued unless another indication exists. For patients requiring chronic NSAID or aspirin therapy, long-term PPI should be considered if gastrointestinal risk is high [ 78 The standard 4–8 week PPI course should be completed alongside eradication therapy. Once healed, PPIs can be discontinued unless another indication exists. For patients requiring chronic NSAID or aspirin therapy, long-term PPI should be considered if gastrointestinal risk is high [ 83 NSAID/antiplatelet use: In patients on long-term NSAIDs or antithrombotics, PPI is indicated if gastrointestinal risk factors are present. Deprescribing can be considered if NSAIDs are stopped. Alternatives such as COX-2 inhibitors, non-pharmacological pain control, or other analgesics may reduce the need for PPI [ 34 78 In patients on long-term NSAIDs or antithrombotics, PPI is indicated if gastrointestinal risk factors are present. Deprescribing can be considered if NSAIDs are stopped. Alternatives such as COX-2 inhibitors, non-pharmacological pain control, or other analgesics may reduce the need for PPI [ 34 83 Stress ulcer prophylaxis (non-ICU): Should be reserved for ICU patients or those with major risk factors (e.g., mechanical ventilation, coagulopathy). Inappropriate use outside critical care remains common. PPIs should be discontinued on discharge or once the risk has resolved [ 5 22 81 Should be reserved for ICU patients or those with major risk factors (e.g., mechanical ventilation, coagulopathy). Inappropriate use outside critical care remains common. PPIs should be discontinued on discharge or once the risk has resolved [ 25 80 82 Older adults may be more vulnerable to PPI-related adverse effects. Where no clear indication exists, a trial of deprescribing can be attempted with close follow-up and lifestyle modification (dietary changes, weight loss, head-of-bed elevation) [ 81 6.4. Deprescribing Strategies Deprescribing refers to the systematic reduction or cessation of PPIs in patients without a continuing high-risk indication. Given the potential harms of long-term PPI use, guidelines (e.g., NICE, ACG) recommend annual review of ongoing need and dose reduction or discontinuation where possible. 6.5. Example Scenarios Case 1 Case 2 Case 3 7. PPIs Versus H2RAs, Gastroprotective Drugs and New Acid Suppressants PPIs are typically preferred over cytoprotective agents and H2RAs according to European, British, and American guidelines. This preference is based on the superior effectiveness and safety profile of PPIs. Cytoprotective agents (e.g., misoprostol and sucralfate) and H2RAs are used in specific cases or when PPIs are inappropriate, either as alternatives or adjunctive therapy. New acid suppressants such as potassium-competitive acid blockers (PCABs) offer advantages over conventional PPIs. Vonoprazan, a PCAB, reversibly blocks the potassium-binding site of the proton pump, enabling faster and more consistent acid suppression [ 79 79 80 79 82 83 Table 8 Table 9 Table 10 84 84 85 84 86 87 Table 8 Table 9 Table 10 British guideline recommendations including indications, dosage, co-prescription, deprescribing, adverse events and alternatives are summarised in Table 11 8. Clinical Questions, Recommendations and Stepwise Approach to Deprescribing Who should receive a PPI? It should be restricted to patients with clear, evidence-based indications; reviewed annually [ 3 21 22 25 75 When to co-prescribe? Should be co-prescribed with high-risk NSAID or antithrombotic therapy; local and international guideline thresholds should be followed [ 25 28 29 31 45 What to monitor? Periodic checks of magnesium, vitamin B12, and iron in chronic users should be considered [ 55 57 58 50 When and how to deprescribe? Tapering to the lowest effective dose should be caried out or a switch performed to on-demand therapy once the acute indication resolves [ 22 81 Special populations? Long-term therapy for Barrett’s oesophagus, severe erosive oesophagitis, and high GI bleed risk should be maintained [ 22 When to co-prescribe? With high-risk NSAID or antithrombotic therapy; local and international guideline thresholds should be followed [ 27 29 32 35 What to monitor? Periodic checks of magnesium, vitamin B12, and iron in chronic users should e considered [ 58 59 60 52 When and how to deprescribe? Tapering to the lowest effective dose should be carried out or a switch to on-demand therapy should be performed once the acute indication resolves [ 24 80 Special populations? Long-term therapy for Barrett’s oesophagus, severe erosive oesophagitis, and high GI bleed risk should be maintained [ 24 Stepwise Approach to Deprescribing Assess ongoing indication: Continue PPI at the lowest effective dose if a high-risk condition is present (e.g., severe oesophagitis LA C/D, Barrett’s oesophagus, Zollinger–Ellison syndrome, recent bleeding ulcer, or high-risk NSAID use). Review resolution: If the acute condition has resolved, consider dose reduction or discontinuation. Select tapering or step-down method: Options include dose reduction, on-demand therapy, or substitution with an H 2 Educate the patient: Warn about rebound acid hypersecretion (2–4 weeks) and offer management strategies. Follow-up: Review symptoms after 4–12 weeks and adjust treatment accordingly. Structured deprescribing programmes with patient education and follow-up can achieve up to 86% discontinuation success compared with historical rates of 30–60% [ 98 In addition, deprescribing inappropriate long-term PPI use is likely to be cost-effective, with potential savings from reduced medication expenditure and avoidance of downstream adverse event costs, though formal economic evaluations remain limited [ 5 9. Limitations This review is a narrative synthesis and is thus subject to inherent limitations. We acknowledge bias in the coverage of UK and English-based guidelines. Prescribing practices and guidelines vary globally, so some recommendations may not apply equally in all settings (e.g., some countries have earlier access to PCABs or different guideline thresholds). We attempted to present a balanced view, but emphasis on certain topics (e.g., deprescribing strategies) reflects available literature and may underrepresent others. Finally, cost-effectiveness was considered outside the scope of this review and was not included. 10. Knowledge Gaps Despite extensive observational data, causal links between PPIs and many reported long-term adverse outcomes remain uncertain. Further randomised controlled trials are needed to clarify the true risk of conditions such as chronic kidney disease [ 54 56 52 36 57 24 80 H. pylori 30 35 84 86 91 11. Conclusions PPI stewardship is essential for minimising unnecessary exposure to potential harms while preserving symptom control. Routine evaluation of ongoing need must become standard practice, as studies reveal that up to 25% of patients continue with therapy for more than a year without reassessment and that 25–70% of long-term PPI prescriptions lack a valid indication [ 79 Acknowledgments During the preparation of this manuscript, the authors used artificial intelligence tools such as ChatGPT versions GPT-4, GPT-5 (OpenAI) and Gemini version 2.5 pro (Google) to assist with language refinement, grammar checks, and maintaining narrative flow. However, all clinical content, data extraction, interpretation, and critical analysis were conducted independently by the authors. The evidence cited in this review was thoroughly assessed and verified against original sources to ensure accuracy and reliability. The authors reviewed and edited the output and take full responsibility for the content of this publication. Disclaimer/Publisher’s Note: Author Contributions M.A. and W.A. contributed equally to this work and are joint first authors. Both were involved in the conception of the review, literature search, data extraction, and critical synthesis of evidence. A.D. provided subject-matter expertise in gastroenterology, offering critical appraisal and input to enhance the quality and accuracy of the data interpretation. K.S. served as the senior and corresponding author and was involved in the conception and oversight, providing methodological guidance, and conducting a comprehensive review of the manuscript for intellectual content and clarity. All authors have read and agreed to the published version of the manuscript. Data Availability Statement No new data were created or analysed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Scarpignato C. Gatta L. Zullo A. Blandizzi C. SIF-AIGO-FIMMG Group Italian Society of Pharmacology The Italian Association of Hospital Gastroenterologists The Italian Federation of General Practitioners Effective and safe proton pump inhibitor therapy in acid-related diseases—A position paper addressing benefits and potential harms of acid suppression BMC Med. 2016 14 179 10.1186/s12916-016-0718-z 27825371 PMC5101793 2. Freedberg D.E. Kim L.S. Yang Y.-X. The risks and benefits of long-term use of proton pump inhibitors: Expert review and best practice advice from the American gastroenterological association Gastroenterology 2017 152 706 715 10.1053/j.gastro.2017.01.031 28257716 3. NICE Clinical Guideline CG184 Gastro-oesophageal Reflux Disease and Dyspepsia in Adults: Investigation and Management National Institute for Health and Care Excellence (UK) London, UK 2014 4. DeVault K.R. Review article: The role of acid suppression in patients with non-erosive reflux disease or functional heartburn Aliment. Pharmacol. Ther. 2006 23 (Suppl. S1) 33 39 10.1111/j.1365-2036.2006.02798.x 16483268 5. Forgacs I. Loganayagam A. Overprescribing proton pump inhibitors BMJ 2008 336 2 3 10.1136/bmj.39406.449456.BE 18174564 PMC2174763 6. Abrahami D. McDonald E.G. Schnitzer M. Azoulay L. Trends in acid suppressant drug prescriptions in primary care in the UK: A population-based cross-sectional study BMJ Open 2020 10 e041529 10.1136/bmjopen-2020-041529 PMC7722810 33293322 7. Bergin E. Zylberberg H.M. Lebwohl B. Freedberg D.E. Trends in use of proton pump inhibitors among adults in the United States from 1999 to 2018 Pharmacoepidemiol. Drug Saf. 2023 32 1406 1410 10.1002/pds.5676 37524589 8. Torres-Bondia F. de Batlle J. Galván L. Buti M. Barbé F. Piñol-Ripoll G. Evolution of the consumption trend of proton pump inhibitors in the Lleida Health Region between 2002 and 2015 BMC Public Health 2022 22 818 10.1186/s12889-022-13217-6 35461252 PMC9035259 9. Zeng M. Li Y. Chen T. Zhang S. Luo H. Evolution of proton pump inhibitor prescribing from 2017 to 2021 at 14 secondary and tertiary hospitals in China: A multicentre cross-sectional study BMJ Open 2023 13 e072793 10.1136/bmjopen-2023-072793 PMC10335495 37400237 10. Yamamichi N. Shimamoto T. Takahashi Y. Takahashi M. Takeuchi C. Wada R. Fujishiro M. Zarnegar R. Trends in proton pump inhibitor use, reflux esophagitis, and various upper gastrointestinal symptoms from 2010 to 2019 in Japan PLoS ONE 2022 17 e0270252 10.1371/journal.pone.0270252 35714110 PMC9205527 11. Plehhova K. Wray J. Aluko P. Sutton S. McArdle J. Dawson A. Coyle C. Stevens R.M. Prescribing practices for proton pump inhibitors among primary care physicians in England: An evaluation BJGP Open 2025 9 BJGPO.2024.0059 10.3399/BJGPO.2024.0059 39313319 PMC12421266 12. Choi J.P. Kim S. Park J.S. Kim M.-S. Choi N.-K. Shin C.M. Lee J. Utilization of acid suppressants after withdrawal of ranitidine in Korea: An interrupted time series analysis J. Prev. Med. Public Health 2025 58 21 30 10.3961/jpmph.24.357 39788691 PMC11824620 13. Dutta A.K. Jain A. Jearth V. Mahajan R. Panigrahi M.K. Sharma V. Goenka M.K. Kochhar R. Makharia G. Reddy D.N. Guidelines on optimizing the use of proton pump inhibitors: PPI stewardship Indian J. Gastroenterol. 2023 42 601 628 10.1007/s12664-023-01428-7 37698821 14. Dutta A.K. Sharma V. Jain A. Elhence A. Panigrahi M.K. Mohta S. Kirubakaran R. Philip M. Goenka M. Bhatia S. Inappropriate use of proton pump inhibitors in clinical practice globally: A systematic review and meta-analysis Gut 2024 74 e5 10.1136/gutjnl-2024-332154 38670630 15. Othman F. Card T.R. Crooks C.J. Proton pump inhibitor prescribing patterns in the UK: A primary care database study Pharmacoepidemiol. Drug Saf. 2016 25 1079 1087 10.1002/pds.4043 27255671 16. U.S. Food and Drug Administration Drug Safety and Availability 20 February 2025 Available online: https://www.fda.gov/drugs/drug-safety-and-availability (accessed on 20 August 2025) 17. Homepage. European Medicines Agency (EMA) 30 March 2023 Available online: https://www.ema.europa.eu (accessed on 20 August 2025) 18. By the 2019 American Geriatrics Society Beers Criteria® Update Expert Panel American Geriatrics Society 2019 updated AGS Beers Criteria® for Potentially Inappropriate Medication Use in Older Adults J. Am. Geriatr. Soc. 2019 67 674 694 10.1111/jgs.15767 30693946 19. Omahony D. Sullivan O. Byrne D. Connor O. Ryan M.N. Gallagher C. STOPP/START criteria for potentially inap-propriate prescribing in older people: Version 2 Age Ageing 2015 44 213 218 10.1093/ageing/afu145 25324330 PMC4339726 20. Choosing Wisely: An initiative of the ABIM Foundation Available online: https://www.choosingwisely.org (accessed on 20 August 2025) 21. Katz P.O. Dunbar K.B. Schnoll-Sussman F.H. Greer K.B. Yadlapati R. Spechler S.J. ACG clinical guideline for the diagnosis and management of gastroesophageal reflux disease Am. J. Gastroenterol. 2022 117 27 56 10.14309/ajg.0000000000001538 34807007 PMC8754510 22. Targownik L.E. Fisher D.A. Saini S.D. AGA Clinical Practice Update on De-Prescribing of Proton Pump Inhibitors: Expert Review Targownik Gastroenterology 2022 162 1334 1342 10.1053/j.gastro.2021.12.247 35183361 23. Peyton-Navarrete A. Nguyen M.H.C. FakhriRavari A. Prescribing responsibly: Navigating the Tides of deprescribing in proton pump inhibitor stewardship Pharmacoepidemiology 2025 4 15 10.3390/pharma4030015 24. Watson G. O’hAra J. Carding P. Lecouturier J. Stocken D. Fouweather T. Wilson J. TOPPITS: Trial Of Proton Pump Inhibitors in Throat Symptoms. Study protocol for a randomised controlled trial Trials 2016 17 175 10.1186/s13063-016-1267-7 27036555 PMC4818442 25. Hooper L. Brown T.J. Elliott R. Payne K. Roberts C. Symmons D. The effectiveness of five strategies for the prevention of gastrointestinal toxicity induced by non-steroidal anti-inflammatory drugs: Systematic review BMJ 2004 329 948 10.1136/bmj.38232.680567.EB 15475342 PMC524106 26. Masclee G.M. Valkhoff V.E. Coloma P.M. de Ridder M. Romio S. Schuemie M.J. Herings R. Gini R. Mazzaglia G. Picelli G. Risk of Upper Gastrointestinal Bleeding From Different Drug Combinations Gastroenterology 2014 147 784 792.e9 quiz e13-4 10.1053/j.gastro.2014.06.007 24937265 27. Loke Y.K. Trivedi A.N. Singh S. Meta-analysis: Gastrointestinal bleeding due to interaction between selective serotonin uptake inhibitors and non-steroidal anti-inflammatory drugs Aliment. Pharmacol. Ther. 2008 27 31 40 10.1111/j.1365-2036.2007.03541.x 17919277 28. Lanza F.L. Chan F.K. Quigley E.M. Practice Parameters Committee of the American College of Gastroenterolo-gy.Guidelines for prevention of NSAID-related ulcer complications Am. J. Gastroenterol. 2009 104 728 738 19240698 10.1038/ajg.2009.115 29. Levine G.N. Bates E.R. Bittl J.A. Brindis R.G. Fihn S.D. Fleisher L.A. Granger C.B. Lange R.A. Mack M.J. Mauri L. 2016 ACC/AHA guideline focused update on duration of dual antiplatelet therapy in patients with coronary artery disease: A report of the American college of cardiology/American heart association task force on clinical practice guidelines: An update of the 2011 ACCF/AHA/SCAI guideline for percutaneous coronary intervention, 2011 ACCF/AHA guideline for coronary artery bypass graft surgery, 2012 ACC/AHA/ACP/AATS/PCNA/SCAI/STS guideline for the diagnosis and management of patients with stable ischemic heart disease, 2013 ACCF/AHA guideline for the management of ST-elevation myocardial infarction, 2014 AHA/ACC guideline for the management of patients with non-ST-elevation acute coronary syndromes, and 2014 ACC/AHA guideline on perioperative cardiovascular evaluation and management of patients undergoing noncardiac surgery Circulation 2016 134 e123 e155 27026020 10.1161/CIR.0000000000000404 30. Abraham N.S. Antman E.M. Fisher M. 2020 international consensus on the management of antithrombotic therapy in patients at risk of gastrointestinal bleeding Ann. Intern. Med. 2020 172 447 454 31. Caterina D. Ammentorp R. Darius B. Position paper of the Italian Society of Cardiology and AIGO on gastro-protection in patients on antiplatelet therapy G. Ital. Cardiol. 2019 20 625 639 32. Ibanez B. James S. Agewall S. Antunes M.J. Bucciarelli D.C. Bueno H. Caforio A.L.P. Crea F. Goudevenos J.A. Halvorsen S. 2017 ESC Guidelines for the management of acute myocardial infarction in patients presenting with ST-segment elevation Eur Heart J. 2018 39 119 177 10.1093/eurheartj/ehx393 28886621 33. Abrignani M.G. Lombardo A. Braschi A. Renda N. Abrignani V. Proton pump inhibitors and gastroprotection in patients treated with antithrombotic drugs: A cardiologic point of view World J. Cardiol. 2023 15 375 394 10.4330/wjc.v15.i8.375 37771340 PMC10523195 34. Gralnek I.M. Dumonceau J.-M. Kuipers E.J. Lanas A. Sanders D.S. Kurien M. Rotondano G. Hucl T. Dinis-Ribeiro M. Marmo R. Diagnosis and management of nonvariceal upper gastrointestinal hemorrhage: European Society of Gastrointestinal Endoscopy (ESGE) Guideline Endoscopy 2015 47 a1 a46 10.1055/s-0034-1393172 26417980 35. Malfertheiner P. Megraud F. O’Morain C.A. Gisbert J.P. Kuipers E.J. Axon A.T. Bazzoli F. Gasbarrini A. Atherton J. Graham D.Y. Management of Helicobacter pylori Gut 2017 66 6 30 10.1136/gutjnl-2016-312288 27707777 36. Ray W.A. Chung C.P. Murray K.T. Smalley W.E. Daugherty J.R. Dupont W.D. Stein C.M. Association of oral anticoagulants and proton pump inhibitor cotherapy with hospitalization for upper gastrointestinal tract bleeding JAMA 2018 320 2221 2230 10.1001/jama.2018.17242 30512099 PMC6404233 37. Ahn H.-J. Lee S.-R. Choi E.-K. Rhee T.-M. Kwon S. Oh S. Lip G.Y.H. Protective effect of proton-pump inhibitor against gastrointestinal bleeding in patients receiving oral anticoagulants: A systematic review and meta-analysis Br. J. Clin. Pharmacol. 2022 88 4676 4687 10.1111/bcp.15478 35921204 38. Steffel J. Collins R. Antz M. Cornu P. Desteghe L. Haeusler K.G. Oldgren J. Reinecke H. Roldan-Schilling V. Rowell N. 2021 European heart rhythm association practical guide on the use of non-vitamin K antagonist oral anticoagulants in patients with atrial fibrillation Europace 2021 23 1612 1676 10.1093/europace/euab065 34179979 PMC12098927 39. Ortel T.L. Neumann I. Ageno W. Beyth R. Clark N.P. Cuker A. Hutten B.A. Jaff M.R. Manja V. Schulman S. American Society of Hematology 2020 Guidelines for Management of Venous Thromboembolism: Treatment of Deep Vein Thrombosis and Pulmonary Embolism Blood Adv. 2020 4 4693 4738 10.1182/bloodadvances.2020001830 33007077 PMC7556153 40. Chan E.W. Lau W.C. Leung W.K. Mok M.T. He Y. Tong T.S. Wong I.C. Prevention of Dabigatran-Related Gastrointestinal Bleeding with Gastroprotective Agents: A Population-Based Study Gastroenterology 2015 149 586 595.e3 10.1053/j.gastro.2015.05.002 25960019 41. Lanas A. Ferrandez A. Inappropriate prevention of NSAID-induced gastrointestinal events among long-term users in the UK primary care setting Gastroenterol. Res. Pract. 2013 10.2165/00002512-200724020-00004 17313200 42. Schoenfeld P. Kimmey M.B. Review article: The geographic differences in NSAID-induced ulcer rates--does it matter Aliment. Pharmacol. Ther. 1999 13 3 7 43. Barkun A.N. Bardou M. Kuipers E.J. Sung J. Hunt R.H. Martel M. Sinclair P. for the International Consensus Upper Gastrointestinal Bleeding Conference Group* International Consensus Recommendations on the Management of Patients With Nonvariceal Upper Gastrointestinal Bleeding Ann. Intern. Med. 2010 152 101 113 10.7326/0003-4819-152-2-201001190-00009 20083829 44. Barkun A.N. Almadi M. Kuipers E.J. Laine L. Sung J. Tse F. Leontiadis G.I. Abraham N.S. Calvet X. Chan F.K. Management of Nonvariceal Upper Gastrointestinal Bleeding: Guideline Recommendations from the International Consensus Group Ann. Intern. Med. 2019 171 805 822 10.7326/M19-1795 31634917 PMC7233308 45. NICE Guideline NG226 Osteoarthritis in Over 16s: Diagnosis and Management NICE London, UK 2022 36745715 46. NICE Rheumatoid Arthritis in Adults: Management Available online: https://www.nice.org.uk/guidance/ng100 (accessed on 20 August 2025) 47. Yousefi C. EULAR recommendations for the management of rheumatoid arthritis with synthetic and bio-logical disease-modifying antirheumatic drugs: 2016 update Ann. Rheum. Dis. 2017 76 960 977 28264816 10.1136/annrheumdis-2016-210715 48. Narum S. Westergren T. Klemp M. Corticosteroids and risk of gastrointestinal bleeding: A systematic review and meta-analysis BMJ Open 2014 4 e004587 10.1136/bmjopen-2013-004587 PMC4025450 24833682 49. Wang W.-H. Huang J.-Q. Zheng G.-F. Xia H.H.X. Wong W.-M. Lam S.-K. Wong B.C.Y. Head-to-head comparison of H2-receptor antagonists and proton pump inhibitors in the treatment of erosive esophagitis: A meta-analysis World J. Gastroenterol. 2005 11 4067 4077 10.3748/wjg.v11.i26.4067 15996033 PMC4502104 50. Jiang Y. Zhang R. Fang Y. Zhao R. Fu Y. Ren P. Zhan Q. Shao M. P-CAB versus PPI in the eradication of Helicobacter pylori: A systematic review and network meta-analysis Therap. Adv. Gastroenterol. 2024 17 17562848241241224 10.1177/17562848241241223 PMC11095192 38751605 51. Liu J. Li X. Fan L. Yang J. Wang J. Sun J. Wang Z. Proton pump inhibitors therapy and risk of bone diseases: An update meta-analysis Life Sci. 2019 218 213 223 10.1016/j.lfs.2018.12.058 30605646 52. Wu C.-C. Liao M.-H. Kung W.-M. Wang Y.-C. Proton pump inhibitors and risk of chronic kidney disease: Evidence from observational studies J. Clin. Med. 2023 12 2262 10.3390/jcm12062262 36983271 PMC10052387 53. Lazarus B. Chen Y. Wilson F.P. Sang Y. Chang A.R. Coresh J. Grams M.E. Proton pump inhibitor use and the risk of chronic kidney disease JAMA Intern. Med. 2016 176 238 10.1001/jamainternmed.2015.7193 26752337 PMC4772730 54. Finke M. Boven A. Vlieghe E. Engstrand L. Orsini N. Brusselaers N. Proton pump inhibitors and the risk of Clostridioides difficile infection: A systematic review and dose-response meta-analysis J. Infect. 2025 90 106488 10.1016/j.jinf.2025.106488 40239816 55. Cheungpasitporn W. Thongprayoon C. Ungprasert P. Erickson S.B. Kittanamongkolchai W. Srivali N. Edmonds P.J. O’Corragain O.A. Korpaisarn S. Proton pump inhibitors linked to hypomagnesemia: A systematic review and meta-analysis of observational studies Ren. Fail. 2015 37 1237 1241 10.3109/0886022X.2015.1057800 26108134 56. Lambert A.A. Lam J.O. Paik J.J. Ugarte-Gil C. Drummond M.B. Crowell T.A. Risk of community-acquired pneumonia with outpatient proton-pump inhibitor therapy: A systematic review and meta-analysis PLoS ONE 2015 10 e0128004 10.1371/journal.pone.0128004 26042842 PMC4456166 57. Lam J.R. Schneider J.L. Zhao W. Corley D.A. Proton pump inhibitor and histamine 2 receptor antagonist use and vitamin B12 deficiency JAMA 2013 310 2435 2442 10.1001/jama.2013.280490 24327038 58. Sarzynski E. Puttarajappa C. Xie Y. Grover M. Laird-Fick H. Association between proton pump inhibitor use and anemia: A retrospective cohort study Dig. Dis. Sci. 2011 56 2349 2353 10.1007/s10620-011-1589-y 21318590 59. Howell M.D. Novack V. Grgurich P. Soulliard D. Novack L. Pencina M. Talmor D. Iatrogenic gastric acid suppression and the risk of nosocomial Clostridium difficile infection Arch. Intern. Med. 2010 170 784 790 10.1001/archinternmed.2010.89 20458086 60. Nalabothula S. Chava S. Doddapaneni N.S.P. Gottimukkala H.S.K. Durga D. Proton pump inhibitor use and risk of Clostridioides difficile infection: An umbrella review of 11 meta-analyses Cureus 2025 17 e87383 10.7759/cureus.87383 40765605 PMC12324808 61. Ozdil K. Kahraman R. Sahin A. Calhan T. Gozden E.H. Akyuz U. Erer B. Sokmen M.H. Bone density in proton pump inhibitors users: A prospective study Rheumatol. Int. 2013 33 2255 2260 10.1007/s00296-013-2709-0 23455632 62. Gray S.L. LaCroix A.Z. Larson J. Robbins J. Cauley J.A. Manson J.E. Chen Z. Proton pump inhibitor use, hip fracture, and change in bone mineral density in postmenopausal women: Results from the Women’s Health Initiative Arch. Intern. Med. 2010 170 765 771 10.1001/archinternmed.2010.94 20458083 PMC4240017 63. Vaezi M.F. Yang Y.-X. Howden C.W. Complications of proton pump inhibitor therapy Gastroenterology 2017 153 35 48 10.1053/j.gastro.2017.04.047 28528705 64. Targownik L.E. Leslie W.D. Davison K.S. Goltzman D. Jamal S.A. Kreiger N. Josse R.G. Kaiser S.M. Kovacs C.S. Prior J.C. The relationship between proton pump inhibitor use and longitudinal change in bone mineral density: A population-based study [corrected] from the Canadian Multicentre Osteoporosis Study (CaMos) Am. J. Gastroenterol. 2012 107 1361 1369 10.1038/ajg.2012.200 22777336 PMC5104563 65. Targownik L.E. Goertzen A.L. Luo Y. Leslie W.D. Long-term proton pump inhibitor use is not associated with changes in bone strength and structure Am. J. Gastroenterol. 2017 112 95 101 10.1038/ajg.2016.481 27845341 66. Imhann F. Bonder M.J. Vila A.V. Fu J. Mujagic Z. Vork L. Tigchelaar E.F. Jankipersadsing S.A. Cenit M.C. Harmsen H.J.M. Proton pump inhibitors affect the gut microbiome Gut 2016 65 740 748 10.1136/gutjnl-2015-310376 26657899 PMC4853569 67. Mishiro T. Oka K. Kuroki Y. Takahashi M. Tatsumi K. Saitoh T. Tobita H. Ishimura N. Sato S. Ishihara S. Oral microbiome alterations of healthy volunteers with proton pump inhibitor J. Gastroenterol. Hepatol. 2018 33 1059 1066 10.1111/jgh.14040 29105152 68. Su T. Lai S. Lee A. He X. Chen S. Meta-analysis: Proton pump inhibitors moderately increase the risk of small intestinal bacterial overgrowth J. Gastroenterol. 2018 53 27 36 10.1007/s00535-017-1371-9 28770351 69. Lo W.-K. Chan W.W. Proton pump inhibitor use and the risk of small intestinal bacterial overgrowth: A meta-analysis Clin. Gastroenterol. Hepatol. 2013 11 483 490 10.1016/j.cgh.2012.12.011 23270866 70. Mehta R.S. Kochar B. Zhou Z. Broder J.C. Chung P. Yang K. Lockery J. Fravel M. Ryan J. Mahady S. Association of proton pump inhibitor use with incident dementia and cognitive decline in older adults: A prospective cohort study Gastroenterology 2023 165 564 572.e1 10.1053/j.gastro.2023.05.052 37315867 PMC10527011 71. Xie K. Li J. Tang C. Huang Z. Chen M. Association between proton pump inhibitors and dementia risk: A Mendelian randomization study Sci. Rep. 2024 14 28624 10.1038/s41598-024-79821-1 39562663 PMC11576989 72. Gomm W. von Holt K. Thomé F. Broich K. Maier W. Fink A. Doblhammer G. Haenisch B. Association of proton pump inhibitors with risk of dementia JAMA Neurol. 2016 73 410 10.1001/jamaneurol.2015.4791 26882076 73. Li M. Luo Z. Yu S. Tang Z. Proton pump inhibitor use and risk of dementia: Systematic review and meta-analysis Medicine 2019 98 e14422 10.1097/MD.0000000000014422 30762748 PMC6408083 74. Cheung K.S. Chan E.W. Wong A.Y.S. Chen L. Wong I.C.K. Leung W.K. Long-term proton pump inhibitors and risk of gastric cancer development after treatment for Helicobacter pylori: A population-based study Gut 2018 67 28 35 10.1136/gutjnl-2017-314605 29089382 75. Bhatt D.L. Cryer B.L. Contant C.F. Cohen M. Lanas A. Schnitzer T.J. Shook T.L. Lapuerta P. Goldsmith M.A. Laine L. Clopidogrel with or without omeprazole in coronary artery disease N. Engl. J. Med. 2010 363 1909 1917 10.1056/NEJMoa1007964 20925534 76. Sehested T.S.G. Gerds T.A. Fosbøl E.L. Hansen P.W. Charlot M.G. Carlson N. Hlatky M.A. Torp-Pedersen C. Gislason G.H. Long-term use of proton pump inhibitors, dose–response relationship and associated risk of ischemic stroke and myocardial infarction J. Intern. Med. 2018 283 268 281 10.1111/joim.12698 29024109 77. Shabil M. Padhi B.K. Khatib M.N. Menon S.V. Kaur M. Kumari M. Sudan P. Naidu K.S. Zahiruddin Q.S. Rustagi S. Risk of stroke associated with proton pump inhibitor use among individuals with and without pre-existing cardiovascular diseases: A systematic review and meta-analysis J. Cardiothorac. Surg. 2025 20 107 10.1186/s13019-024-03161-4 39881328 PMC11776308 78. Rossi A. Perrella L. Scotti S. Olmastroni E. Galimberti F. Ardoino I. Orlando V. Menditto E. Franchi C. Casula M. Approaches to deprescribing proton pump inhibitors in clinical practice: A systematic review J. Clin. Med. 2024 13 6283 10.3390/jcm13206283 39458232 PMC11508458 79. Onge E.S. Phillips B. Vonoprazan: A new potassium-competitive acid blocker J. Pharm. Technol. 2023 39 139 146 10.1177/87551225231166531 37323765 PMC10268044 80. Oshima T. Miwa H. Potent potassium-competitive acid blockers: A New Era for the treatment of acid-related diseases J. Neurogastroenterol. Motil. 2018 24 334 344 10.5056/jnm18029 29739175 PMC6034668 81. Farrell B. Pottie K. Thompson W. Boghossian T. Pizzola L. Rashid F.J. Rojas-Fernandez C. Walsh K. Welch V. Moayyedi P. Deprescribing proton pump inhibitors: Evidence-based clinical practice guideline Can. Fam. Physician 2017 63 354 364 28500192 PMC5429051 82. Inatomi N. Matsukawa J. Sakurai Y. Otake K. Potassium-competitive acid blockers: Advanced therapeutic option for acid-related diseases Pharmacol. Ther. 2016 168 12 22 10.1016/j.pharmthera.2016.08.001 27514776 83. Scarpignato C. Howden C.W. Leifke E. Mulford D.J. Lahu G. Facius A. Hunt R. A translational pharmacokinetic/pharmacodynamic approach supports optimal vonoprazan dosing for erosive oesophagitis and Helicobacter pylori infection Aliment. Pharmacol. Ther. 2023 58 16 25 10.1111/apt.17510 37066678 84. Frech E.J. Go M.F. Treatment and chemoprevention of NSAID-associated gastrointestinal complications Ther. Clin. Risk Manag. 2009 5 65 73 19436617 PMC2697523 85. Kudaravalli P. Patel P. John S. Sucralfate StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 31855371 86. Cao Y. Zhang J. Liu Y. Zhang L. Wang L. Wang J. Qi Y. Lv H. Liu J. Huo L. The efficacy and safety of different bismuth agents in Helicobacter pylori first-line eradication: A multicenter, randomized, controlled clinical trial Medicine 2021 100 e27923 10.1097/MD.0000000000027923 34918639 PMC8678011 87. Gotoh Y. Ishibashi E. Honda S. Nakaya T. Noguchi C. Kagawa K. Murakami K. Efficacy of vonoprazan for initial and maintenance therapy in reflux esophagitis, nonerosive esophagitis, and proton pump inhibitor-resistant gastroesophageal reflux disease Medicine 2020 99 e19520 10.1097/MD.0000000000019520 32176102 PMC7440130 88. Dong Y. Xu H. Zhang Z. Zhou Z. Zhang Q. Comparative efficiency and safety of potassium competitive acid blockers versus Lansoprazole in peptic ulcer: A systematic review and meta-analysis Front. Pharmacol. 2023 14 1304552 10.3389/fphar.2023.1304552 38273830 PMC10808560 89. Arakawa T. Watanabe T. Tanigawa T. Tominaga K. Fujiwara Y. Morimoto K. Quality of ulcer healing in gastrointestinal tract: Its pathophysiology and clinical relevance World J. Gastroenterol. 2012 18 4811 4822 10.3748/wjg.v18.i35.4811 23002355 PMC3447265 90. Wedemeyer R.-S. Blume H. Pharmacokinetic drug interaction profiles of proton pump inhibitors: An update Drug Saf. 2014 37 201 211 10.1007/s40264-014-0144-0 24550106 PMC3975086 91. Reimer C. Søndergaard B. Hilsted L. Bytzer P. Proton-pump inhibitor therapy induces acid-related symptoms in healthy volunteers after withdrawal of therapy Gastroenterology 2009 137 80 87.e1 10.1053/j.gastro.2009.03.058 19362552 92. Alonso N. Zappia C.D. Cabrera M. Davio C.A. Shayo C. Monczor F. Fernã¡Ndez N.C. Physiological implications of biased signaling at histamine H2 receptors Front. pharmacology 2015 6 45 10.3389/fphar.2015.00045 PMC4354273 25805997 93. Fuchs K.H. Babic B. Breithaupt W. Dallemagne B. Fingerhut A. Furnee E. Granderath F. Horvath P. Kardos P. Pointner R. EAES recommendations for the management of gastroesophageal reflux disease Surg. Endosc. 2014 28 1753 1773 10.1007/s00464-014-3431-z 24789125 94. Lanas A. Chan F.K. Peptic ulcer disease Lancet 2017 390 613 624 10.1016/S0140-6736(16)32404-7 28242110 95. Taha A.S. Mccloskey C. Prasad R. Bezlyak V. Famotidine for the prevention of peptic ulcers and oe-sophagitis in patients taking low-dose aspirin (FAMOUS): A phase III, randomised, double-blind, placebo-controlled trial Lancet 2009 374 119 125 10.1016/S0140-6736(09)61246-0 19577798 96. Scarpignato C. Lanas A. Blandizzi C. Lems W.F. Hermann M. Hunt R.H. Safe prescribing of non-steroidal anti-inflammatory drugs in patients with osteoarthritis--an expert consensus addressing benefits as well as gastrointestinal and cardiovascular risks BMC Med. 2015 13 55 10.1186/s12916-015-0285-8 25857826 PMC4365808 97. Chey W.D. Leontiadis G.I. Howden C.W. Moss S.F. Correction: ACG Clinical Guideline: Treatment of Helicobacter pylori Infection Am. J. Gastroenterol. 2018 113 1102 10.1038/s41395-018-0132-6 29895984 98. Odenthal D.R. Philbrick A.M. Harris I.M. Successful deprescribing of unnecessary proton pump inhibitors in a primary care clinic J. Am. Pharm. Assoc. (2003) 2020 60 100 104 10.1016/j.japh.2019.08.012 31601478 Figure 1 Potential harms of long-term use of proton pump inhibitors (PPIs). Figure 2 Algorithm for PPI evaluation and deprescription. medicina-61-01569-t001_Table 1 Table 1 Indications of PPI use. Type of Indication Long-Term PPI (>8 Weeks) Short-Term PPI (<8 Weeks) Definite Conditional Definite Conditional Therapeutic GORD with erosive oesophagitis (LA C+D) GORD with incomplete response to short-term PPI GORD H. pylori Functional dyspepsia (trial) Prophylactic - Chronic NSAID/aspirin use + high GI risk - Long-term corticosteroids + GI risk factors - NSAID/aspirin use (short course + risk factors) - Post-bariatric surgery (short-term) PPI, Proton pump inhibitors; GORD, Gastro-oesophageal reflux disease; LA C+D, Los Angeles Classification, Grade C and Grade D; NSAID, Non-steroid anti-inflammatory drug. medicina-61-01569-t002_Table 2 Table 2 Conditions where PPIs should be avoided. Conditions Short-Term Use Long-Term Use Therapeutic Isolated throat symptoms [ 24 22 Non-erosive reflux or functional dyspepsia with no response to high-dose PPI therapy Prophylactic  Steroid therapy in the absence of concomitant NSAID/antiplatelet therapy [ 22 22 medicina-61-01569-t003_Table 3 Table 3 Summary of recommendation of different societies of PPI use with antiplatelet therapy. Organization Guideline Summary Notes ACCF/ACG/AHA (2010, updated 2016) [ 29 PPIs are recommended for high-risk patients only on DAPT only. Routine use is not recommended. Based on interpretation of COGENT trial results. Focussed approach; avoid blanket PPI use ESC (2018) [ 32 Routine PPI use for all patients on DAPT. Emphasises reducing bleeding risks associated with DAPT. International Consensus (2020) [ 30 Conditional recommendation for PPI in patients with previous ulcer bleeding on DAPT. Based on low-quality evidence, no increased mortality from DAPT and PPI. ANMCO/AIGO (Italian Guidelines) [ 31 PPI recommended for patients with GI risk factors, history of PUD, use of NSAIDs or steroids. Focuses on additional risk factors including age, GORD, and dyspeptic symptoms. medicina-61-01569-t004_Table 4 Table 4 Different PPIs according to their properties. PPI % Time pH > 4 (24 h) CYP2C19 Metabolism Bioavailability (%) Duration of Acid Suppression References Dexlansoprazole ~70–80% Low (dual delayed-release bypasses metabolism impact) ~60–70% ~24 h (dual release) [ 1 2 Rabeprazole ~60–70% Low (non-enzymatic metabolism largely) ~52% ~16 h [ 25 28 Esomeprazole ~60–70% Moderate (less than omeprazole; S-isomer) ~64% ~16–20 h [ 25 29 Lansoprazole ~50–60% High (significantly affected by CYP2C19 polymorphism) ~80–90% ~12–14 h [ 25 29 Pantoprazole ~45–55% Moderate (less interaction than omeprazole) ~77% ~10–12 h [ 28 29 Omeprazole ~40–50% High (extensively metabolized by CYP2C19) ~30–40% ~10–12 h [ 25 28 medicina-61-01569-t005_Table 5 Table 5 Summary of key studies comparing PPI efficacy to alternative therapies. Study (year) Condition Comparison Key Finding Reference Wang et al., 2005 (meta-analysis) Erosive oesophagitis Standard-dose PPI vs. H 2 PPIs healed significantly more patients at 2–8 weeks; PPI 2–8 wk healing > H2HRA at 8 wk (63.4% vs. 52.0%) [ 49 Jiang et al., 2024 (NMA) H. pylori Vonoprazan-based vs. PPI-based Vonoprazan triple (2 wk) had highest eradication rate; superior to PPI quadruple (RR ≈ 0.90 favoring vonoprazan) [ 50 medicina-61-01569-t006_Table 6 Table 6 Proton pump inhibitor (PPI) dosage guide. PPI Standard Dose Low Dose (On-Demand) High (Double) Dose Omeprazole 20 mg once daily (40 mg once daily if severe oesophagitis) * 10 mg once daily (20 mg once daily if severe oesophagitis) 40 mg once daily (40 mg twice daily if severe oesophagitis) Lansoprazole 30 mg once daily 15 mg once daily * 30 mg twice daily Pantoprazole 40 mg once daily 20 mg once daily * 40 mg twice daily Rabeprazole 20 mg once daily 10 mg once daily * 20 mg twice daily Esomeprazole Rabeprazole † 20 mg once daily (40 mg once daily if severe oesophagitis) Not available (2010 mg once daily if severe oesophagitis) ‡ 40 mg once daily (40 mg twice daily if severe oesophagitis) Doses in brackets are specifically for use in severe oesophagitis; doses should be taken 30 min before breakfast and (if needed) 30 min before the evening meal; * off-label dose for GORD; † This is lower than the licensed starting dose in GORD, but is considered to be dose-equivalent to other PPIs; ‡ This dose is recommended for a double dose as the 20 mg dose of esomeprazole is considered to be equivalent to omeprazole 20 mg [ 3 medicina-61-01569-t007_Table 7 Table 7 Adverse effects of PPI therapy and suggested monitoring strategies. Harm Category Effect Size (95% CI) Suggested Monitoring Bone fracture (major) RR ~1.28 (1.22–1.35) [ 51 52 Ensure adequate calcium and vitamin D intake; consider bone density assessment in high-risk patients Chronic kidney disease HR ~1.26 (1.16–1.38) [ 52 53 54 55 Monitor renal function (serum creatinine/eGFR) periodically Community-acquired pneumonia OR ~1.37 (1.22–1.53) [ 56 57 Monitor for respiratory infections, especially early in treatment Clostridioides difficile infection OR ~1.26 (1.12–1.39) [ 54 58 Review any new diarrhoeal illness promptly; avoid unnecessary long-term use Hypomagnesaemia OR ~1.78 (1.08–2.92) [ 55 59 Check serum magnesium in long-term users, especially if on diuretics Vitamin B12 deficiency [ 57 Check levels after >2 years’ continuous use or if symptomatic Iron deficiency/anaemia [ 58 Assess iron status if unexplained anaemia develops during therapy medicina-61-01569-t008_Table 8 Table 8 Key differences characteristics between PPIs, H2RAs, gastroprotective drugs, and PCABs. Characteristic PPIs H2RAs Cytoprotective Agents PCABs (e.g., Vonoprazan) Mechanism Irreversibly inhibit H+/K+ ATPase Block histamine H2 receptors Form barriers (sucralfate); prostaglandin analogue (misoprostol); antimicrobial (bismuth) [ 84 85 86 Reversibly inhibit H+/K+ ATPase at potassium site [ 79 Onset of Action Slower onset Faster onset [ 4 Variable, often local [ 88 Rapid [ 79 Duration of Action Long-lasting [ 4 Shorter duration [ 4 Requires frequent dosing [ 84 85 Sustained, even during night-time [ 79 87 Mucosal Protection Indirect via acid reduction [ 89 Indirect [ 89 Direct mucosal protection [ 89 Both acid suppression and mucosal healing Adverse Effects Long-term risks (e.g., C. difficile 63 64 Headache, dizziness [ 2 Diarrhoea (misoprostol), contraindicated in pregnancy [ 84 Similar to PPIs, but with some rare serious AEs [ 88 Drug Interactions CYP2C19 interactions (esp. omeprazole) [ 90 Fewer interactions [ 2 Minimal Lesser CYP2C19 influence [ 79 82 Tolerance/Rebound Rebound acidity after withdrawal [ 91 Tolerance with prolonged use [ 92 Not common Minimal data; likely less tolerance development Dosing Once or twice daily Once or twice daily Multiple daily doses [ 84 85 Often once daily [ 83 medicina-61-01569-t009_Table 9 Table 9 Different drug class usage according to specific indications. Indication Preferred Therapy Key Points GORD PPIs first line As per ACG/ESGE, H2RAs used for intermittent symptoms [ 21 93 Peptic Ulcer Disease PPIs preferred; H2RAs still effective Famotidine prevents ulcers in aspirin users [ 94 95 NSAID-Induced Ulcers PPIs and misoprostol Recommended in high-risk groups [ 28 96 H. pylori PPI-based regimens Key in triple and bismuth quadruple therapy [ 35 93 97 medicina-61-01569-t010_Table 10 Table 10 Clinical relevance of PCABs versus PPIs. Condition Comparative Efficacy GORD Non-inferior/superior to PPIs; effective in erosive, non-erosive, and PPI-resistant disease [ 87  H. pylori Higher eradication in clarithromycin-resistant strains (65.8–69.6% vs. 31.9%) [ 50 Ulcer Healing Comparable to PPIs; faster symptom relief reported; rare serious adverse events possible [ 88 medicina-61-01569-t011_Table 11 Table 11 Summary of UK guidelines recommendations. Aspect UK Guidelines Summary Notes PPI Indications PPIs are first-line treatment for GORD, peptic ulcer disease, and H. pylori NICE and BSG recommend PPIs for GORD and ulcer healing. Dosage and Duration Standard dosing for GORD and ulcers. Long-term PPI use is common, especially in elderly patients. Dosing varies based on severity; an annual review is recommended by the NHS to assess necessity. Co-prescription with NSAIDs NICE and BSG recommend co-prescription of PPIs with NSAIDs in high-risk patients (e.g., age > 65, history of ulcers, or anticoagulant use). Reduces risk of GI bleeding, especially in patients on long-term NSAID therapy. Co-prescription with Antiplatelet Therapy PPIs should be prescribed for patients on dual antiplatelet therapy (DAPT) or single therapy with additional GI risk factors (e.g., history of ulcers, H. pylori Prevents gastrointestinal bleeding in high-risk groups. Co-prescription with Anticoagulants PPIs should be considered for patients on warfarin or direct oral anticoagulants (DOACs) at high risk of GI bleeding. Pantoprazole is preferred due to fewer drug interactions. Particularly important for patients with prior GI bleeding or ulcer history. Co-prescription with Corticosteroids NICE recommends considering PPIs for high-risk patients on corticosteroids, particularly when combined with NSAIDs or other GI risk factors. Focuses on reducing risk of peptic ulcers from corticosteroid use. Deprescribing PPIs NICE and NHS recommend annual reassessment of PPI use to reduce overprescription. PPIs should not be stopped in high-risk patients (GORD, Barrett’s oesophagusesophagus). Gradual tapering or continued use depending on clinical need. Adverse Effects Long-term PPI use is associated with risks such as gastrointestinal infections ( C. difficile NICE and NHS advise caution with long-term use; alternatives considered when appropriate. Alternative Therapies Sucralfate and misoprostol are alternatives for ulcer treatment, especially when PPIs are not suitable. Cytoprotective agents and H2RAs as alternatives. New Acid Suppressants Potassium-competitive acid blockers (PCABs) like vonoprazan may offer advantages over traditional PPIs, particularly in PPI-resistant GORD and H. pylori Emerging therapies are considered, but PPIs remain standard. ",
  "metadata": {
    "Title of this paper": "Successful deprescribing of unnecessary proton pump inhibitors in a primary care clinic",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471631/"
  }
}