{
  "title": "Paper_704",
  "abstract": "pmc Langenbecks Arch Surg Langenbecks Arch Surg 365 springeropen Langenbeck's Archives of Surgery 1435-2443 1435-2451 pmc-is-collection-domain yes pmc-collection-title Springer PMC12474594 PMC12474594.1 12474594 12474594 41003799 10.1007/s00423-025-03793-7 3793 1 Research Impact of indocyanine green fluorescence angiography on esophagogastric anastomotic leakage after Ivor Lewis esophagectomy Davoust Laure laure.davoust@chu-bordeaux.fr 1 Belaroussi Yaniss 2 Picard Flor 1 Collet Denis 1 3 Gronnier Caroline 1 3 4 1 https://ror.org/01hq89f96 grid.42399.35 0000 0004 0593 7118 Esophagogastric Surgery Unit, Haut L’Evêque Hospital, 2 https://ror.org/01hq89f96 grid.42399.35 0000 0004 0593 7118 Thoracic Surgery Unit, Haut L’Evêque Hospital, 3 https://ror.org/057qpr032 grid.412041.2 0000 0001 2106 639X University of Bordeaux, 4 https://ror.org/02vjkv261 grid.7429.8 0000 0001 2186 6389 INSERM, 26 9 2025 2025 410 1 497685 279 18 9 2024 19 6 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Purpose Esophagectomy for esophageal cancer involves high morbimortality when anastomotic leakage occurs. Optimal perfusion of the gastric tube can be assessed by indocyanine green fluorescence-angiography (ICG-FA). We evaluated whether locating the anastomosis in a zone enhanced within 60 s after ICG-FA injection reduced severe anastomotic leakage (Stage 2 or 3) within 30 days after esophagectomy. Methods ICG-FA was assessed in 69 patients and compared to 122 control patients undergoing minimally invasive Ivor Lewis esophagectomy. Whenever possible, the anastomosis was placed on gastric tissue enhanced within 60 s after ICG-FA injection, with resection of the gastric tip if needed. Results Severe anastomotic leakage occurred in 8.4% of cases, with 6 cases of anastomotic leakage (8.7%) in the ICG-FA group and 10 (8.2%) in the non-ICG-FA group ( p Conclusion Our results were not statistically significant, possibly due to a lack of power. There was no trend indicating a decrease in anastomotic leakage using our ICG-FA method, therefore other studies must help determine an optimal quantitative ICG-FA method to reduce postoperative morbidity after esophagectomy. Keywords Anastomotic leakage Esophageal reconstruction Esophageal surgery Esophagectomy Esophagogastric anastomosis Indocyanine Green Fluorescence-Angiography pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction Esophageal cancer ranks 8th cancer worldwide, and the 6th most deadly [ 1 2 1 3 4 5 7 Minimally invasive surgery using laparoscopy decreases mortality rate (1,4%), length of hospital stay [ 8 9 10 11 12 2 Indocyanine green fluorescence angiography (ICG-FA) helps to assess anastomotic tissue blood perfusion more accurately in digestive surgery. A near infrared camera shows ICG-FA tissue perfusion only seconds after injection [ 13 14 18 19 p 20 Another method using fluorescence-intensity curves requires complex software and calculations, and there is no precise cut-off value. [ 19 21 An easy quantitative ICG-FA method time of blood perfusion from peripheral IV (intravenous) injection to the gastric tip. In a 2018 prospective cohort published by Kumagai and al. of 70 patients, anastomosis was made on tissue showing blood flow within 60 s after ICG injection, and non-perfused tissue after 90 s was resected. Rate of AL was low (1,4%) with mean gastric perfusion time of 35 s. Three AL occurred in tissue perfused after 60 s, whereas no AL occurred in tissue perfused within 60 s [ 22 A 2017 retrospective cohort by Ohi and al. involving 120 patients showed decrease of AL rate when using ICG-FA with correction of poor perfusion within 60 s (1,7% versus 14,7%, HR 9 ( p The aim of this study is to assess quantitative ICG-FA with a time-to-perfusion cut-off of 60 s after injection to reduce AL in Ivor Lewis esophagectomy at the Bordeaux University Hospital. Methods This “before and after” cohort study was conducted in the esogastric surgical department of the University Hospital in Bordeaux, France. Inclusion criteria All consecutive patients who underwent minimally invasive Ivor Lewis esophagectomy for a mid-low or gastroesophageal junction tumor, by laparoscopic and thoracoscopic approach with intrathoracic esophagogastric anastomosis, in our surgical department from 2018 to 2021 (with use of ICG-FA starting March 2020). Non-inclusion criteria Patients with cervical esophagogastric anastomosis, open surgery, pregnancy, age under 18, and missing data concerning the ICG-FA, were not included. ICG-FA protocol After stapling of the gastric tube, 0,1 mg/kg of ICG was injected intravenously and flushed with 10 ml of 0,9%. NaCl. Gastric tube perfusion was assessed 60 s after injection using a SPY laparoscopic camera device (PINPOINT system), placed in the optical port. Images at 60 s (Image 1 2 Image 1 Satisfactory blood perfusion reaching the tip of the gastric tube. Oesogastric surgical department, Bordeaux University Hospital Image 2 Unsatisfactory blood perfusion of the tip of the gastric tube, with transition level identified by 3–0 PDS marking stitch. Oesogastric surgical department, Bordeaux University Hospital End-to-side or end-to-end handsewn interrupted esophagogastric anastomosis was performed by a right axillary mini-thoracotomy. The gastric tip could be resected following macroscopic and ICG-FA perfusion assessment. Anastomosis was done at the level of the marking stitch, if possible, with recording of distances between gastric tip, marking stitch and anastomotic site. Endoscopic or radiologic exams were performed when postoperative complications were suspected. Primary outcome The primary outcome was defined as AL stage 2 or 3 (requiring endoscopic or surgical treatment), within 30 days after surgery, diagnosed clinically (sepsis, mediastinitis, purulent discharge in drain), radiologically (leak of contrast product, air bubbles, abscess on CT scan with IV and ingested contrast product or upper gastro-intestinal series) or endoscopically (anastomotic opening, tissue defect or necrosis). We recorded other postoperative outcomes including morbimortality, pulmonary complications, and length of stay. Statistical analysis Patients in the ICG-FA group were compared with the non ICG-FA group using a Chi- square test with a p value of less than 0.05 considered statistically significant. Statistical analysis was performed using R software. Ethical approval Anonymized data was collected using computed patient files and the surgical department database. Our study was approved by the Bordeaux University Hospital Ethics Committee. Results 191 patients were included from January 2018 to March 2021. ICG-FA was used in 69 (36%) of patients. 1 patient was excluded because surgery was done by open approach to remove liver lesions. Patient baseline characteristics Baseline characteristics (Table 1 Table 1 Comparison of baseline characteristics of the study patients with and without ICG-FA Factors ICG-FA group ( n Non-ICG-FA group ( n P Sex (%) Male 59 (85.5) 104 (85.2) Female 10 (14.5) 18 (14.8) 1.000 Age (median [IQR]) 65.00 [61.00, 70.00] 65.50 [58.00, 71.00] 0.963 BMI (%)1 < 25 24 (34.8) 63 (51.6) 0.036 ≥ 25 45 (65.2) 59 (48.4) Weight (median [IQR]) 80.00 [64.00, 92.00] 75.00 [67.00, 86.00] 0.216 ASA score (%)2 1 10 (14.5) 23 (19.2) 0.679 2 44 (63.8) 70 (58.3) 3 15 (21.7) 27 (22.5) Pulmonary disease (%)3 18 (26.1) 32 (26.2) 1.000 Preoperative malnutrition (%) 26 (40.6) 53 (44.5) 0.724 Smoking (%) 43 (62.3) 73 (59.8) 0.855 Hypertension (%) 31 (44.9) 40 (32.8) 0.131 Diabetes (%) 18 (26.1) 18 (14.8) 0.083 Preoperative therapy (%) 65 (94.2) 111 (91.0) 0.607 Histological type (%) ADC4 60 (89.6) 106 (86.9) SCC5 6 (9.0) 16 (13.1) Other 1 (1.5) 0 (0.0) Invaded margins (%) 8 (11.9) 25 (20.5) 0.200 pTNM8 stage (%) 0 10 (14.5) 19 (15.6) 1A 4 (5.8) 6 (4.9) 1B 9 (13.0) 5 (4.1) 2A 0 (0.0) 11 (9.0) 2B 0 (0.0) 19 (15.6) 3A 5 (7.2) 5 (4.1) 3B 24 (34.8) 42 (34.4) 4A 11 (15.9) 7 (5.7) 4B 0 (0.0) 2 (1.6) Exclusive radiotherapy (%) 1 (1.5) 2 (1.6) 1.000 Operative time (minutes, median [IQR]) 309.00 [273.00, 340.00] 300.00 [260.00, 330.00] 0.135 Operative blood loss (mL, median [IQR]) 200.00 [100.00, 300.00] 200.00 [150.00, 350.00] 0.062 1 BMI 2 ASA 3 4 ADC 5 SCC Primary outcome Rate of severe AL within 30 days was 8.4% (Table 2 Table 2 Comparison of postoperative outcomes of the study patients with and without ICG-FA ICG-FA group ( n Non-ICG-FA group ( n P Severe AL1(%) 6 (8.7) 10 (8.2) 1.000 Any stage AL (%) 6 (8.7) 11 (9.0) 1.000 AL stage (%) 0 63 (91.3) 111 (91.0) 1 0 (0.0) 1 (0.8) 2 1 (1.4) 3 (2.5) 3A 1 (1.4) 0 (0.0) 3B 4 (5.8) 7 (5.7) 0.636 30-day morbidity (%) 32 (47.1) 65 (53.3) 0.502 30-day mortality (%) 0 (0.0) 1 (0.8) 1.000 Dindo-Clavien classification (%) 1 38 (55.1) 45 (36.9) 2 14 (20.3) 46 (37.7) 3a 1 (1.4) 6 (4.9) 3b 6 (8.7) 8 (6.6) 4a 10 (14.5) 13 (10.7) 5 0 (0.0) 4 (3.3) 0.033 LOIS2(days) (median [IQR]) 7.00 [5.00, 9.00] 6.00 [5.00, 8.75] 0.545 LOHS3 (days) (median [IQR]) 10.00 [9.00, 15.00] 11.00 [9.00, 15.00] 0.470 Readmission to ICU4 (%) 3 (4.4) 6 (4.9) 1.000 Hospital readmission (%) 7 (10.6) 22 (18.8) 0.212 Any pulmonary complication5 (%) 28 (40.6) 59 (48.4) 0.376 Pulmonary infection (%) 17 (24.6) 38 (31.1) 0.431 Drainage of pleural effusion (%) 13 (18.8) 14 (11.5) 0.235 Atelectasis (%) 25 (36.2) 22 (18.0) 0.009 Hypoxemia (Pa02 < 200mmHG) (%) 22 (31.9) 20 (16.4) 0.021 ARDS6 (%) 5 (7.2) 5 (4.1) 0.548 Reintubation (%) 9 (13.0) 12 (9.8) 0.660 Use of non-invasive ventilation (%) 34 (49.3) 53 (43.4) 0.531 Use of antibiotics (%) 22 (31.9) 55 (45.1) 0.103 Revision surgery (%) 9 (13.0) 12 (9.8) 0.660 Atrial fibrillation(%) 6 (8.7) 25 (20.5) 0.055 Acute Coronary Syndrome (%) 0 (0.0) 1 (0.8) 1.000 Time to oral food intake (days) (median [IQR]) 5.00 [4.00, 7.00] 5.00 [4.00, 6.00] 0.549 1 AL 2 LOIS 3 LOHS 4 ICU 5 6 ARDS Secondary outcomes 30-day morbidity was 47.1% and 53.3% respectively ( p p p ICG-FA results and surgical strategy ICG-FA findings and anastomosis characteristics are shown in Table 3 p Table 3 ICG-FA findings and anastomosis characteristics ICF-FA and anastomosis characteristics Results Median arterial pressure (median [IQR]) 75.50 [69.00, 83.25] Heart frequency (bpm) (median [IQR]) 75.00 [67.00, 86.50] Full ICG-FA perfusion to gastric tip (%) Yes 45 (66.2) No 23 (33.8) Macroscopic viability assessement (%) Good 54 (79.4) Poor 14 (20.6) Placing of marking stitch (%) Yes 19 (27.9) No 49 (72.1) Abdominal gastric resection (%) Yes 2 (2.9) No 66 (97.1) Thoracic gastric resection (%) Yes 14 (20.6) No 54 (79.4) Technical difficulties (%) Yes 0 (0) 0 67 (100.0) Anastomotic site (%) Above marking stitch 5 (7.4) At level or under marking stitch 12 (17.6) No marking stitch 51 (75.0) Distance from gastric tip to anastomosis (mm) (median [IQR]) 20.00 [20.00, 20.00] Distance from gastric tip to marking stitch (mm) (median [IQR]) 20.00 [0.00, 20.00] Anastomotic technique(%) End-to-side 58 (95.1) End-to-end 3 (4.9) Change in surgical strategy (%) Yes 20 (29.9) No 47 (70.1) Severe anastomotic leakage at 30 days (%) Yes 6 (8.7) No 63 (91.3) ICG-FA results and postoperative outcomes 6 of the 69 ICG-FA patients presented with AL, with endoscopic treatment in one patient (stage 2), revision surgery without anastomotic dismounting in 3 patients (stage 3b), and by esophagostomy in one patient (stage 3a). 3 patients developed AL despite good tissue perfusion. 2 patients with stage 3a AL had poor macroscopic and ICG-FA perfusion, but which had been corrected by resection of the top 3 cm of the gastric tube. One patient had poor macroscopic and ICG-FA perfusion, with a marking stitch 4 cm below the gastric tip, but for technical reasons no change was made to the anastomotic site which was done 2 cm below the gastric tip. In this case AL at the gastric tip occurred at day 18 postoperatively, requiring endoscopic drainage. Table 4 Table 4 Postoperative outcomes in ICG-FA patients with and without change in surgical strategy using ICG-FA Postoperative outcomes Change in surgical strategy ( n No change in surgical strategy ( n P Severe AL2(%) Yes 2 (10) 4 (8.5) No 18 (90) 43 (91.5) 1.000 AL stage (%) 0 18 (90) 43 (91.5) 1 0 (0) 0 (0) 2 0 (0) 1 (2.1) 3A 0 (0) 1 (2.1) 3B 2 (10) 2 (4.3) 30-day morbidity (%) 7 (35) 25 (54.3) 0.239 30-day mortality (%) 0 (0) 0 (0) Dindo-Clavien classification (%) 1 13 (65.0) 23 (48.9) 2 2 (10.0) 12 (25.5) 3a 0 (0) 1 (2.1) 3b 0 (0) 6 (12.8) 4a 5 (25.0) 5 (10.6) 0.125 Any pulmonary complication3 (%) 7 (35.0) 21 (44.7) 0.642 Pulmonary infection (%) 5 (25.0) 12 (25.5) 1.000 Drainage of pleural effusion (%) 4 (20.0) 9 (19.1) 1.000 Atelectasis (%) 5 (25.0) 19 (40.4) 0.354 Hypoxemia (Pa02 < 200mmHG) (%) 8 (40.0) 13 (27.7) 0.479 ARDS4(%) 2 (10.0) 3 (6.4) 0.994 Reintubation (%) 3 (15.0) 6 (12.8) 1.000 Use of non-invasive ventilation (%) 10 (50.0) 23 (48.9) 1.000 Use of antibiotics (%) 5 (25.0) 17 (36.2) 0.544 1 2 AL 3 4 ARDS Macroscopic and ICG-FA assessment of tissue perfusion 9 patients in the ICG-FA group showed good macroscopic tissue perfusion but ICG-FA was unsatisfactory. This led to change in strategy in 8 patients, with gastric tip resection in 7 patients and change of anastomotic site in one patient. None presented with AL. Discussion Our cohort study comparing postoperative outcomes and change in surgical strategy before and after using ICG-FA during Ivor Lewis esophagectomy did not find statistically significant results. However, our 60-s threshold involved change in esophagogastric anastomotic site in one third of patients, without change in AL rate. ICG-FA and AL 6 patients presented with AL in the ICG-FA group. One patient with transition level had no change in surgical strategy, and AL may have been avoided. 3 patients with AL had satisfactory ICG-FA, but macroscopic tissue quality was also optimal, so there was no possibility to foresee AL. In these cases, AL may have been caused by factors other than ischemia, such as technical difficulties, inflammatory tissue, or anastomotic tension. 2 patients presented with AL despite resection of the gastric tip, but one leakage was at mid height of the gastric tube due to thermal injury, without necrosis, and could not have been prevented by ICG-FA. Efforts were made to make the anastomosis on the marking stitch but this was not always possible due to insufficient gastric tube length, resulting in AL in one case where anastomosis was made 2 cm above the marking stitch. The other four patients with placement of anastomosis above the marking stitch did, however, not present AL. Several studies suggest that surgical corrections according to ICG-FA can reduce AL. In a literature review with 1186 patients, Daele and al. found a significant decrease in AL from 20.5% to 9.9% when using ICG-FA ( p p 2 p 23 The gastric tip being supplied by the microvascular mucosal and submucosal blood network [ 24 25 ICG-FA can also be used during the thoracic approach [ 26 28 29 Sakuma and al. evaluated correlation between ICG-FA results and endoscopic results at postoperative day 1 in 86 patients. Their only significant correlation was between ICG-FA results and congestive mucosa in endoscopy, which suggests that ICG-FA may be a better indicator of veinous congestion rather than poor arterial blood supply [ 30 Our AL rate was relatively low (8,4%), and reduction of this rate, even with use of ICG-FA, is difficult to achieve. This may explain our non-significant results. ICG-FA and other measures such as preoperative nutrition may contribute to the aggregation of marginal gains, for incremental reduction of anastomotic leak. Quantitative use of ICG-FA Our 60-s threshold was chosen according to literature [ 13 22 31 33 p 34 35 In Kumagai and al’s “90-s-rule” study [ 22 22 32 p 36 37 Yamamoto and al. conducted a retrospective review of 97 cases, with 12 postoperative leakages. The ICG-FA videos enabled creation of time-intensity curves, showing a trend towards slower intensity in the cases with anastomotic leakage. However these results were not significant [ 38 Several software tools are emerging to enable a better, objective use of ICG-FA, as shown by Nijssen and al. who compared two different software algorithms, using fluorescence time curves. However, this study showed differences in measurement (mean relative difference + 58.2%), without significant relationship with AL. This underlines the extent of the technical possibilities of IGC use, but with a lack in standardization making its interpretation difficult [ 39 Strengths Our study has methodological strength as it was conducted in a high-volume center, with standardized surgical technique. Our ICG-FA protocol is simple, precise and easy to use in common surgical practice. Limitations Our study was not randomized, however both study groups had similar characteristics. Absence of randomization also provides real-world data with better external validity. Our « before and after» cohort design induces historical bias, as therapeutic care improves over time, reducing postoperative morbidity. We therefore included patients since 2018, after our unit had 3 years of experience in minimally invasive surgery. Furthermore, despite ICG-FA results, choice of anastomotic site was left to the surgeon’s discretion. Poor ICG-FA was not corrected in 13% of cases, reflecting real-life situations. Perspectives Large, randomized studies are needed to confirm these retrospective results, exploring different quantitative ICG-FA measures such as colorimetric measurements [ 16 19 21 40 41 42 36 It is also questionable whether IGC-FA is the best method to assess gastric perfusion, as shown by Haruta and al. who compared ICG-FA and multispectral camera on 30 cases. ICG-FA was assessed quantitively as time in luminance increase. AL occurred in 100% of patients considered with poor vascularization in multispectral camera, versus 60% with poor ICG-FA results [ 43 Conclusion Our quantitative ICG-FA protocol influenced our decision of anastomotic site during minimally invasive Ivor Lewis, but has not led to significant reduction in AL rate when applied in a center with a low AL rate (8,4%). Therefore, the use of ICG-FA does not diminish AL rate in high-volume, specialized centers with AL rates within international benchmarks. Further studies may help determine whether ICG-FA proves more useful in low-volume centers. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions LD, CG, and DC contributed to the study conception and design, LD and FP contributed to data acquisition, YB contributed to the data analysis, and LD wrote the manuscript and prepared the tables and figures. CG, DC and YB reviewed the manuscript. Data availability No datasets were generated or analysed during the current study. Declarations Ethical requirements Approved by Bordeaux University Hospital Ethics Committee. Clinical trial number Not applicable. Competing interests The authors declare no competing interests. References 1. Uhlenhopp DJ Then EO Sunkara T Gaduputi V Epidemiology of esophageal cancer: update in global trends, etiology and risk factors Clin J Gastroenterol 2020 13 1 1010 1021 10.1007/s12328-020-01237-x 32965635 Uhlenhopp DJ, Then EO, Sunkara T, Gaduputi V (2020) Epidemiology of esophageal cancer: update in global trends, etiology and risk factors. Clin J Gastroenterol 13(1):1010–1021. 10.1007/s12328-020-01237-x 32965635 10.1007/s12328-020-01237-x 2. Daele EV Nieuwenhove YV Ceelen W Vanhove C Braeckman BP Hoorens A Near-infrared fluorescence guided esophageal reconstructive surgery: a systematic review World J Gastrointest Oncol 2019 11 3 250 63 10.4251/wjgo.v11.i3.250 30918597 PMC6425328 Daele EV, Nieuwenhove YV, Ceelen W, Vanhove C, Braeckman BP, Hoorens A et al (2019) Near-infrared fluorescence guided esophageal reconstructive surgery: a systematic review. World J Gastrointest Oncol 11(3):250–63 30918597 10.4251/wjgo.v11.i3.250 PMC6425328 3. Siegel R Naishadham D Jemal A Cancer statistics, 2013 CA Cancer J Clin 2013 63 1 11 30 23335087 10.3322/caac.21166 Siegel R, Naishadham D, Jemal A (2013) Cancer statistics, 2013. CA Cancer J Clin 63(1):11–30 23335087 10.3322/caac.21166 4. Borggreve AS Kingma BF Domrachev SA Koshkin MA Ruurda JP van Hillegersberg R Surgical treatment of esophageal cancer in the era of multimodality management Ann N Y Acad Sci 2018 1434 1 192 209 10.1111/nyas.13677 29761863 Borggreve AS, Kingma BF, Domrachev SA, Koshkin MA, Ruurda JP, van Hillegersberg R et al (2018) Surgical treatment of esophageal cancer in the era of multimodality management. Ann N Y Acad Sci 1434(1):192–209 29761863 10.1111/nyas.13677 5. Griffin SM Shaw IH Dresner SM Early complications after Ivor Lewis subtotal esophagectomy with two-field lymphadenectomy: risk factors and management J Am Coll Surg 2002 194 3 285 97 10.1016/S1072-7515(01)01177-2 11893132 Griffin SM, Shaw IH, Dresner SM (2002) Early complications after Ivor Lewis subtotal esophagectomy with two-field lymphadenectomy: risk factors and management. J Am Coll Surg 194(3):285–97 11893132 10.1016/s1072-7515(01)01177-2 6. Yibulayin W, Abulizi S, Lv H, Sun W (2016) Minimally invasive oesophagectomy versus open esophagectomy for resectable esophageal cancer: a meta-analysis. World J Surg Oncol 14 [cité 25 oct 2020]. Disponible sur: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5143462/ 10.1186/s12957-016-1062-7 PMC5143462 27927246 7. Mariette C Taillier G Seuningen IV Triboulet JP Factors affecting postoperative course and survival after en bloc resection for esophageal carcinoma Ann Thorac Surg 2004 78 4 1177 83 10.1016/j.athoracsur.2004.02.068 15464466 Mariette C, Taillier G, Seuningen IV, Triboulet JP (2004) Factors affecting postoperative course and survival after en bloc resection for esophageal carcinoma. Ann Thorac Surg 78(4):1177–83 15464466 10.1016/j.athoracsur.2004.02.068 8. Luketich JD Alvelo-Rivera M Buenaventura PO Christie NA McCaughan JS Litle VR Minimally invasive esophagectomy Ann Surg 2003 238 4 486 495 10.1097/01.sla.0000089858.40725.68 14530720 PMC1360107 Luketich JD, Alvelo-Rivera M, Buenaventura PO, Christie NA, McCaughan JS, Litle VR et al (2003) Minimally invasive esophagectomy. Ann Surg 238(4):486–495 14530720 10.1097/01.sla.0000089858.40725.68 PMC1360107 9. Mariette C, Markar SR, Dabakuyo-Yonli TS, Meunier B, Pezet D, Collet D et al (2019) Hybrid minimally invasive esophagectomy for esophageal cancer. N Engl J Med [cité 25 oct 2020]. Disponible sur: https://www.nejm.org/doi/10.1056/NEJMoa1805101 10.1056/NEJMoa1805101 30625052 10. Fumagalli U Baiocchi GL Celotti A Parise P Cossu A Bonavina L Incidence and treatment of mediastinal leakage after esophagectomy: insights from the multicenter study on mediastinal leaks World J Gastroenterol 2019 25 3 356 66 10.3748/wjg.v25.i3.356 30686903 PMC6343094 Fumagalli U, Baiocchi GL, Celotti A, Parise P, Cossu A, Bonavina L et al (2019) Incidence and treatment of mediastinal leakage after esophagectomy: insights from the multicenter study on mediastinal leaks. World J Gastroenterol 25(3):356–66 30686903 10.3748/wjg.v25.i3.356 PMC6343094 11. Hagens ERC Anderegg MCJ van Berge Henegouwen MI Gisbertz SS International survey on the management of anastomotic leakage after esophageal resection Ann Thorac Surg 2018 106 6 1702 8 10.1016/j.athoracsur.2018.05.009 29883644 Hagens ERC, Anderegg MCJ, van Berge Henegouwen MI, Gisbertz SS (2018) International survey on the management of anastomotic leakage after esophageal resection. Ann Thorac Surg 106(6):1702–8 29883644 10.1016/j.athoracsur.2018.05.009 12. Messager M Warlaumont M Renaud F Marin H Branche J Piessen G Recent improvements in the management of esophageal anastomotic leak after surgery for cancer Eur J Surg Oncol 2017 43 2 258 69 10.1016/j.ejso.2016.06.394 27396305 Messager M, Warlaumont M, Renaud F, Marin H, Branche J, Piessen G et al (2017) Recent improvements in the management of esophageal anastomotic leak after surgery for cancer. Eur J Surg Oncol 43(2):258–69 27396305 10.1016/j.ejso.2016.06.394 13. Okusanya O Lu M Luketich JD Sarkaria IS Intraoperative near infrared fluorescence imaging for the assessment of the gastric conduit J Thorac Dis 2019 11 S5 S750 S754 10.21037/jtd.2018.12.10 31080654 PMC6503263 Okusanya O, Lu M, Luketich JD, Sarkaria IS (2019) Intraoperative near infrared fluorescence imaging for the assessment of the gastric conduit. J Thorac Dis 11(S5):S750–S754 31080654 10.21037/jtd.2018.12.10 PMC6503263 14. Blanco-Colino R Espin-Basany E Intraoperative use of ICG fluorescence imaging to reduce the risk of anastomotic leakage in colorectal surgery: a systematic review and meta-analysis Tech Coloproctology 2018 22 1 15 23 10.1007/s10151-017-1731-8 29230591 Blanco-Colino R, Espin-Basany E (2018) Intraoperative use of ICG fluorescence imaging to reduce the risk of anastomotic leakage in colorectal surgery: a systematic review and meta-analysis. Tech Coloproctology 22(1):15–23 10.1007/s10151-017-1731-8 29230591 15. Hayami S Matsuda K Iwamoto H Ueno M Kawai M Hirono S Visualization and quantification of anastomotic perfusion in colorectal surgery using near-infrared fluorescence Tech Coloproctology 2019 23 10 973 980 10.1007/s10151-019-02089-5 31535238 Hayami S, Matsuda K, Iwamoto H, Ueno M, Kawai M, Hirono S et al (2019) Visualization and quantification of anastomotic perfusion in colorectal surgery using near-infrared fluorescence. Tech Coloproctology 23(10):973–980 10.1007/s10151-019-02089-5 31535238 16. Protyniak B Dinallo AM Boyan WP Dressner RM Arvanitis ML Intraoperative indocyanine green fluorescence angiography–an objective evaluation of anastomotic perfusion in colorectal surgery Am Surg 2015 81 6 580 584 10.1177/000313481508100621 26031270 Protyniak B, Dinallo AM, Boyan WP, Dressner RM, Arvanitis ML (2015) Intraoperative indocyanine green fluorescence angiography–an objective evaluation of anastomotic perfusion in colorectal surgery. Am Surg 81(6):580–584 26031270 10.1177/000313481508100621 17. De Nardi P Elmore U Maggi G Maggiore R Boni L Cassinotti E Intraoperative angiography with indocyanine green to assess anastomosis perfusion in patients undergoing laparoscopic colorectal resection: results of a multicenter randomized controlled trial Surg Endosc 2020 34 1 53 60 10.1007/s00464-019-06730-0 30903276 De Nardi P, Elmore U, Maggi G, Maggiore R, Boni L, Cassinotti E et al (2020) Intraoperative angiography with indocyanine green to assess anastomosis perfusion in patients undergoing laparoscopic colorectal resection: results of a multicenter randomized controlled trial. Surg Endosc 34(1):53–60 30903276 10.1007/s00464-019-06730-0 18. Wada T Kawada K Takahashi R Yoshitomi M Hida K Hasegawa S ICG fluorescence imaging for quantitative evaluation of colonic perfusion in laparoscopic colorectal surgery Surg Endosc 2017 31 10 4184 4193 10.1007/s00464-017-5475-3 28281123 Wada T, Kawada K, Takahashi R, Yoshitomi M, Hida K, Hasegawa S et al (2017) ICG fluorescence imaging for quantitative evaluation of colonic perfusion in laparoscopic colorectal surgery. Surg Endosc 31(10):4184–4193 28281123 10.1007/s00464-017-5475-3 19. Duprée A von Kroge PH Izbicki JR Wipper SH Mann O Fluorescence angiography for esophageal anastomoses: perfusion evaluation of the gastric conduit with indocyanine green Chir Z Alle Geb Oper Medizen 2019 90 11 875 879 10.1007/s00104-019-01021-9 31471660 Duprée A, von Kroge PH, Izbicki JR, Wipper SH, Mann O (2019) Fluorescence angiography for esophageal anastomoses: perfusion evaluation of the gastric conduit with indocyanine green. Chir Z Alle Geb Oper Medizen 90(11):875–879 10.1007/s00104-019-01021-9 31471660 20. Koyanagi K Ozawa S Oguma J Kazuno A Yamazaki Y Ninomiya Y Blood flow speed of the gastric conduit assessed by indocyanine green fluorescence: new predictive evaluation of anastomotic leakage after esophagectomy Medicine (Baltimore) 2016 95 30 e4386 10.1097/MD.0000000000004386 27472732 PMC5265869 Koyanagi K, Ozawa S, Oguma J, Kazuno A, Yamazaki Y, Ninomiya Y et al (2016) Blood flow speed of the gastric conduit assessed by indocyanine green fluorescence: new predictive evaluation of anastomotic leakage after esophagectomy. Medicine (Baltimore) 95(30):e4386 27472732 10.1097/MD.0000000000004386 PMC5265869 21. Lütken CD Achiam MP Osterkamp J Svendsen MB Nerup N Quantification of fluorescence angiography: toward a reliable intraoperative assessment of tissue perfusion - a narrative review Langenbecks Arch Surg 2021 406 2 251 259 10.1007/s00423-020-01966-0 32821959 Lütken CD, Achiam MP, Osterkamp J, Svendsen MB, Nerup N (2021) Quantification of fluorescence angiography: toward a reliable intraoperative assessment of tissue perfusion - a narrative review. Langenbecks Arch Surg 406(2):251–259 32821959 10.1007/s00423-020-01966-0 22. Kumagai Y Hatano S Sobajima J Ishiguro T Fukuchi M Ishibashi KI Indocyanine green fluorescence angiography of the reconstructed gastric tube during esophagectomy: efficacy of the 90-second rule Dis Esophagus Off J Int Soc Dis Esophagus 2018 31 12 doy052 10.1093/dote/doy052 29897432 Kumagai Y, Hatano S, Sobajima J, Ishiguro T, Fukuchi M, Ishibashi KI et al (2018) Indocyanine green fluorescence angiography of the reconstructed gastric tube during esophagectomy: efficacy of the 90-second rule. Dis Esophagus Off J Int Soc Dis Esophagus 31(12):doy052 10.1093/dote/doy052 29897432 23. Sozzi A Bona D Yeow M Habeeb TAAM Bonitta G Manara M Does indocyanine green utilization during esophagectomy prevent anastomotic leaks? systematic review and meta-analysis J Clin Med 2024 13 16 4899 10.3390/jcm13164899 39201041 PMC11355508 Sozzi A, Bona D, Yeow M, Habeeb TAAM, Bonitta G, Manara M et al (2024) Does indocyanine green utilization during esophagectomy prevent anastomotic leaks? systematic review and meta-analysis. J Clin Med 13(16):4899 39201041 10.3390/jcm13164899 PMC11355508 24. Liebermann-Meffert DM Meier R Siewert JR Vascular anatomy of the gastric tube used for esophageal reconstruction Ann Thorac Surg 1992 54 6 1110 1115 10.1016/0003-4975(92)90077-H 1449294 Liebermann-Meffert DM, Meier R, Siewert JR (1992) Vascular anatomy of the gastric tube used for esophageal reconstruction. Ann Thorac Surg 54(6):1110–1115 1449294 10.1016/0003-4975(92)90077-h 25. Koyanagi K Ozawa S Ninomiya Y Oguma J Kazuno A Yatabe K Association between indocyanine green fluorescence blood flow speed in the gastric conduit wall and superior mesenteric artery calcification: predictive significance for anastomotic leakage after esophagectomy Esophagus Off J Jpn Esophageal Soc 2021 18 2 248 57 10.1007/s10388-020-00797-8 33165752 Koyanagi K, Ozawa S, Ninomiya Y, Oguma J, Kazuno A, Yatabe K et al (2021) Association between indocyanine green fluorescence blood flow speed in the gastric conduit wall and superior mesenteric artery calcification: predictive significance for anastomotic leakage after esophagectomy. Esophagus Off J Jpn Esophageal Soc 18(2):248–57 10.1007/s10388-020-00797-8 33165752 26. Low DE Alderson D Cecconello I Chang AC Darling GE D’Journo XB International consensus on standardization of data collection for complications associated with esophagectomy: esophagectomy complications consensus group (ECCG) Ann Surg 2015 262 2 286 94 10.1097/SLA.0000000000001098 25607756 Low DE, Alderson D, Cecconello I, Chang AC, Darling GE, D’Journo XB et al (2015) International consensus on standardization of data collection for complications associated with esophagectomy: esophagectomy complications consensus group (ECCG). Ann Surg 262(2):286–94 25607756 10.1097/SLA.0000000000001098 27. Schlottmann F Molena D Anastomotic leak: an early complication with potentially long-term consequences J Thorac Dis 2016 1 8 E1219 E1220 10.21037/jtd.2016.09.65 PMC5107498 27867591 Schlottmann F, Molena D (2016) Anastomotic leak: an early complication with potentially long-term consequences. J Thorac Dis 1(8):E1219–E1220 10.21037/jtd.2016.09.65 PMC5107498 27867591 28. Ishige F Nabeya Y Hoshino I Takayama W Chiba S Arimitsu H Quantitative assessment of the blood perfusion of the gastric conduit by indocyanine green imaging J Surg Res 2019 234 303 310 10.1016/j.jss.2018.08.056 30527489 Ishige F, Nabeya Y, Hoshino I, Takayama W, Chiba S, Arimitsu H et al (2019) Quantitative assessment of the blood perfusion of the gastric conduit by indocyanine green imaging. J Surg Res 234:303–310 30527489 10.1016/j.jss.2018.08.056 29. Thammineedi SR Patnaik SC Saksena AR Ramalingam PR Nusrath S The utility of indocyanine green angiography in the assessment of perfusion of gastric conduit and proximal esophageal stump against visual assessment in patients undergoing esophagectomy: a prospective study Indian J Surg Oncol 2020 11 4 684 691 10.1007/s13193-020-01085-8 33281408 PMC7714815 Thammineedi SR, Patnaik SC, Saksena AR, Ramalingam PR, Nusrath S (2020) The utility of indocyanine green angiography in the assessment of perfusion of gastric conduit and proximal esophageal stump against visual assessment in patients undergoing esophagectomy: a prospective study. Indian J Surg Oncol 11(4):684–691 33281408 10.1007/s13193-020-01085-8 PMC7714815 30. Sakuma J Hoshino A Fujiwara H Ogou T Kawada K Okuno K Blood flow assessment of gastric tube with indocyanine green fluorescence angiography and postoperative endoscopy during esophagectomy: indocyanine green enhancement time indicated congestion BMC Gastroenterol 2024 24 1 316 10.1186/s12876-024-03398-2 39289637 PMC11409529 Sakuma J, Hoshino A, Fujiwara H, Ogou T, Kawada K, Okuno K et al (2024) Blood flow assessment of gastric tube with indocyanine green fluorescence angiography and postoperative endoscopy during esophagectomy: indocyanine green enhancement time indicated congestion. BMC Gastroenterol 24(1):316 39289637 10.1186/s12876-024-03398-2 PMC11409529 31. Ohi M Toiyama Y Mohri Y Saigusa S Ichikawa T Shimura T Prevalence of anastomotic leak and the impact of indocyanine green fluorescein imaging for evaluating blood flow in the gastric conduit following esophageal cancer surgery Esophagus 2017 14 4 351 359 10.1007/s10388-017-0585-5 28983231 PMC5603633 Ohi M, Toiyama Y, Mohri Y, Saigusa S, Ichikawa T, Shimura T et al (2017) Prevalence of anastomotic leak and the impact of indocyanine green fluorescein imaging for evaluating blood flow in the gastric conduit following esophageal cancer surgery. Esophagus 14(4):351–359 28983231 10.1007/s10388-017-0585-5 PMC5603633 32. Noma K Shirakawa Y Kanaya N Okada T Maeda N Ninomiya T Visualized evaluation of blood flow to the gastric conduit and complications in esophageal reconstruction J Am Coll Surg 2018 226 3 241 251 10.1016/j.jamcollsurg.2017.11.007 29174858 Noma K, Shirakawa Y, Kanaya N, Okada T, Maeda N, Ninomiya T et al (2018) Visualized evaluation of blood flow to the gastric conduit and complications in esophageal reconstruction. J Am Coll Surg 226(3):241–251 29174858 10.1016/j.jamcollsurg.2017.11.007 33. Kumagai Y Ishiguro T Haga N Kuwabara K Kawano T Ishida H Hemodynamics of the reconstructed gastric tube during esophagectomy: assessment of outcomes with indocyanine green fluorescence World J Surg 2014 38 1 138 43 10.1007/s00268-013-2237-9 24196170 Kumagai Y, Ishiguro T, Haga N, Kuwabara K, Kawano T, Ishida H (2014) Hemodynamics of the reconstructed gastric tube during esophagectomy: assessment of outcomes with indocyanine green fluorescence. World J Surg 38(1):138–43 24196170 10.1007/s00268-013-2237-9 34. Luo RJ Zhu ZY He ZF Xu Y Wang YZ Chen P Efficacy of indocyanine green fluorescence angiography in preventing anastomotic leakage after mckeown minimally invasive esophagectomy Front Oncol 2020 10 619822 10.3389/fonc.2020.619822 33489925 PMC7821423 Luo RJ, Zhu ZY, He ZF, Xu Y, Wang YZ, Chen P (2020) Efficacy of indocyanine green fluorescence angiography in preventing anastomotic leakage after mckeown minimally invasive esophagectomy. Front Oncol 10:619822 33489925 10.3389/fonc.2020.619822 PMC7821423 35. Van TN Trong HN Thanh SL Gia KN Van HP Van DN Evaluation of the gastric conduit perfusion using indocyanine green in thoracoscopic esophagectomy for esophageal cancer SAGE Open Med 2024 12 20503121241269631 10.1177/20503121241269631 39263633 PMC11388304 Van TN, Trong HN, Thanh SL, Gia KN, Van HP, Van DN et al (2024) Evaluation of the gastric conduit perfusion using indocyanine green in thoracoscopic esophagectomy for esophageal cancer. SAGE Open Med 12:20503121241269630 39263633 10.1177/20503121241269631 PMC11388304 36. Slooter MD Eshuis WJ Cuesta MA Gisbertz SS van Berge Henegouwen MI Fluorescent imaging using indocyanine green during esophagectomy to prevent surgical morbidity: a systematic review and meta-analysis J Thorac Dis 2019 11 S5 S755 S765 10.21037/jtd.2019.01.30 31080655 PMC6503266 Slooter MD, Eshuis WJ, Cuesta MA, Gisbertz SS, van Berge Henegouwen MI (2019) Fluorescent imaging using indocyanine green during esophagectomy to prevent surgical morbidity: a systematic review and meta-analysis. J Thorac Dis 11(S5):S755–S765 31080655 10.21037/jtd.2019.01.30 PMC6503266 37. Kitagawa H Namikawa T Iwabu J Yokota K Uemura S Munekage M Correlation between indocyanine green visualization time in the gastric tube and postoperative endoscopic assessment of the anastomosis after esophageal surgery Surg Today 2020 50 11 1375 1382 10.1007/s00595-020-02025-3 32445048 Kitagawa H, Namikawa T, Iwabu J, Yokota K, Uemura S, Munekage M et al (2020) Correlation between indocyanine green visualization time in the gastric tube and postoperative endoscopic assessment of the anastomosis after esophageal surgery. Surg Today 50(11):1375–1382 32445048 10.1007/s00595-020-02025-3 38. Yamamoto N Kitagawa H Orihashi K Yokota K Namikawa T Seo S Blood flow evaluation of reconstructed gastric tube in esophageal surgery using near-infrared imaging and retrospective time-intensity curve analysis Langenbecks Arch Surg 2024 409 1 90 10.1007/s00423-024-03284-1 38466450 Yamamoto N, Kitagawa H, Orihashi K, Yokota K, Namikawa T, Seo S (2024) Blood flow evaluation of reconstructed gastric tube in esophageal surgery using near-infrared imaging and retrospective time-intensity curve analysis. Langenbecks Arch Surg 409(1):90 38466450 10.1007/s00423-024-03284-1 39. Nijssen DJ Joosten JJ Osterkamp J van den Elzen RM de Bruin DM Svendsen MBS Quantification of fluorescence angiography for visceral perfusion assessment: measuring agreement between two software algorithms Surg Endosc 2024 38 5 2805 2816 10.1007/s00464-024-10794-y 38594365 PMC11078848 Nijssen DJ, Joosten JJ, Osterkamp J, van den Elzen RM, de Bruin DM, Svendsen MBS et al (2024) Quantification of fluorescence angiography for visceral perfusion assessment: measuring agreement between two software algorithms. Surg Endosc 38(5):2805–2816 38594365 10.1007/s00464-024-10794-y PMC11078848 40. Yukaya T Saeki H Kasagi Y Nakashima Y Ando K Imamura Y Indocyanine green fluorescence angiography for quantitative evaluation of gastric tube perfusion in patients undergoing esophagectomy J Am Coll Surg 2015 221 2 e37 42 10.1016/j.jamcollsurg.2015.04.022 26206660 Yukaya T, Saeki H, Kasagi Y, Nakashima Y, Ando K, Imamura Y et al (2015) Indocyanine green fluorescence angiography for quantitative evaluation of gastric tube perfusion in patients undergoing esophagectomy. J Am Coll Surg 221(2):e37–42 26206660 10.1016/j.jamcollsurg.2015.04.022 41. Nerup N Svendsen MBS Svendsen LB Achiam MP Feasibility and usability of real-time intraoperative quantitative fluorescent-guided perfusion assessment during resection of gastroesophageal junction cancer Langenbecks Arch Surg 2020 405 2 215 222 10.1007/s00423-020-01876-1 32281020 Nerup N, Svendsen MBS, Svendsen LB, Achiam MP (2020) Feasibility and usability of real-time intraoperative quantitative fluorescent-guided perfusion assessment during resection of gastroesophageal junction cancer. Langenbecks Arch Surg 405(2):215–222 32281020 10.1007/s00423-020-01876-1 42. Cahill RA O’Shea DF Khan MF Khokhar HA Epperlein JP Mac Aonghusa PG Artificial intelligence indocyanine green (ICG) perfusion for colorectal cancer intra-operative tissue classification Br J Surg 2021 108 1 5 9 10.1093/bjs/znaa004 33640921 Cahill RA, O’Shea DF, Khan MF, Khokhar HA, Epperlein JP, Mac Aonghusa PG et al (2021) Artificial intelligence indocyanine green (ICG) perfusion for colorectal cancer intra-operative tissue classification. Br J Surg 108(1):5–9 33640921 10.1093/bjs/znaa004 43. Haruta Y Nakashima Y Ikeda T Oki E Yoshizumi T Evaluation of gastric tube blood flow by multispectral camera and fluorescence angiography Surg Open Sci 2024 19 87 94 10.1016/j.sopen.2024.03.005 38601735 PMC11004983 Haruta Y, Nakashima Y, Ikeda T, Oki E, Yoshizumi T (2024) Evaluation of gastric tube blood flow by multispectral camera and fluorescence angiography. Surg Open Sci 19:87–94 38601735 10.1016/j.sopen.2024.03.005 PMC11004983 ",
  "metadata": {
    "Title of this paper": "Evaluation of gastric tube blood flow by multispectral camera and fluorescence angiography",
    "Journal it was published in:": "Langenbeck's Archives of Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474594/"
  }
}