{
  "title": "Paper_456",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12479965 PMC12479965.1 12479965 12479965 41023414 10.1038/s41598-025-99053-1 99053 1 Article In vitro investigation of Datura innoxia Mycobacterium tuberculosis Khan Sajjad Ahmed 1 2 6 Rather Muzafar Ahmad 3 Jia Ziyi 3 Khan Muhammad Umer 4 Qadir Syed Mehmood 6 Ejaz Hasan 5 Alruwaili Muharib 5 Baughn Anthony D. abaughn@umn.edu 3 Shier W. Thomas shier001@umn.edu 2 Ahmad Muhammad Sheeraz dr.sheeraz@uaar.edu.pk 1 1 https://ror.org/035zn2q74 grid.440552.2 0000 0000 9296 8318 University Institute of Biochemistry and Biotechnology, PMAS-Arid Agriculture University Rawalpindi, 2 https://ror.org/017zqws13 grid.17635.36 0000 0004 1936 8657 Department of Medicinal Chemistry, College of Pharmacy, University of Minnesota, 3 https://ror.org/017zqws13 grid.17635.36 0000000419368657 Department of Microbiology and Immunology, University of Minnesota Medical School, 4 https://ror.org/051jrjw38 grid.440564.7 0000 0001 0415 4232 Institute of Molecular Biology and Biotechnology, The University of Lahore, 5 https://ror.org/02zsyt821 grid.440748.b 0000 0004 1756 6705 Department of Clinical Laboratory Sciences, College of Applied Medical Sciences, Jouf University, 6 29 9 2025 2025 15 478255 33454 3 1 2025 16 4 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Tuberculosis (TB) is a recurrent and progressive bacterial disease caused by Mycobacterium tuberculosis Mtb Datura innoxia Mtb D. innoxia Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-99053-1. Keywords Datura innoxia Mycobacterium tuberculosis Minimum inhibitory concentration (MIC) MD simulations Molecular docking DFT analysis Subject terms Drug discovery Microbiology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Tuberculosis (TB) is a lethal, infectious disease. It is caused by the etiological agent Mycobacterium tuberculosis Mtb 1 2 3 4 Back in ’90 s, there was a significant reduction in TB cases due to the introduction and discovery of antitubercular agents, such as isoniazid 5 6 Mtb 7 8 Mtb 9 10 11 Notably, plants and humans exhibit significant associations 12 13 14 15 16 The medicinal herb Datura 17 Datura 18 19 Datura 20 For the effective and economical identification of a potential phytocompound that could be used as an antitubercular drug, an in silico approach has proven to be a reliable method to be employed before actual synthesis 21 19 Although natural phytocompounds have been identified for TB treatment, no such studies have systematically evaluated the phytocompounds of D. innoxia Mtb D. innoxia Results Antitubercular activity To develop novel antitubercular drugs, we analyzed 20 natural compounds from D. innoxia 1 Mtb (9) (7) (12) (11) 1) (2) (3) (6) (8) (10) (14) (16) (17) (18) (19) (20) (4) (5) (13) (15) Mtb (9)  Table 1 Antitubercular activity of D. innoxia Mtb Compound code Compounds name MIC (µg/mL) MBC (µg/mL)  1 Trans-ferulic acid 100 > 200  2 4-hydroxybenzoic acid 100 > 200  3 Methyl salicylate 100 > 200  4 (-)-scopolamine hydrobromide 200 N.D.  5 (-)-scopolamine N-butyl bromide 200 > 200  6 p-coumaric acid 100 N.D.  7 Norharmane 50 50  8 anisodamine (7β-hydroxyhyoscyamine) 100 200  9  o-vanillin  12.5  50  10 Nicotinic acid 100 N.D.  11 Atropine > 200 > 200  12 Piperine 50 200  13 Scopoletin 200 200  14 Methyl isonicotinate 100 200  15 Methyl isonicotinate N-oxide 200 > 200  16 d-Damascone 100 > 200  17 3-Indoleacetic acid 100 > 200  18 3-Methylindole 100 > 200  19 2-Aminonicotinic acid 100 > 200  20 2-hydroxy-3-methoxy benzoic acid 100 200  21 INH 0.156 0.156  22 DMSO > 200 > 200 MIC = minimum inhibitory concentration, mbc = minimum bactericidal concentration. Isoniazid (INH) used as positive control. DMSO was used as a negative control. N.D = Not determined. Molecular docking The lead compound (9) (9) 1 (9) 2 22 (9) 2  Fig. 1 3-dimensional structure of the protein Pkn (PDB ID = 6B2Q), visualized on Discovery Studio Visualizer, (3D representation: PyMol Molecular Graphics system version 2.4.0).  Table 2 2D, 3D structures and SMILES along with the Docking score of CCL (PubChem CID: 50898364) and compound (9) Code Name of the compound 2D Structure 3D Structure Docking Score (kcal/mol)  CCL 5-[5-chloro-4-[(5-cyclopropyl-1 H-pyrazol-3-yl)amino]pyrimidin-2-yl]thiophene-2-sulfonamide   − 7.414  INH Isoniazid   − 6.828  9 o-vanillin   − 6.836  Fig. 2 RMSD value of superimposed original CCL (PubChem CID: 50898364) (blue) and re-docked pose (purple). The 2D and 3D interactions of compound (9) 3 ) (9) In contrast, the CCL showed various conventional hydrogen bonds with the following amino-acid residues of the target protein: LYS-42, ASN-146, GLY-145, GLU-96, and VAL-98. It is noteworthy that the LEU-97 residue showed Van Der Waal’s interaction, and the THR-158 residue showed a carbon-hydrogen bond similar to the compound (9) (9) Subsequently, the binding interactions of INH, compared to the compound (9) Supplementary Fig. 1  Fig. 3 3D representation of the complex 6B2Q with the best inhibitory compound (9) A C B D (9) Pharmacokinetic analysis The pharmacokinetic analysis of lead compound 9, compared with INH illustrated in Table 3 o/w (9  Table 3 Pharmacokinetic analysis of the lead compound, compared to the INH drug, assessed through SwissADME. H-bond = hydrogen bond, TPSA = total polar surface area, PAINS = pan-assay interference compounds, CYP = cytochrome P450.  Physiochemical properties Code Molecular weight (g/mol) No. of heavy atoms No. of rotatable bonds H-bond acceptors H-bond donors TPSA (Å 2  9 152.15 11 2 3 1 46.53  INH 137.14 6 2 3 2 68.01  Lipophilicity Code Log P o/w Log P o/w Log P o/w Log P o/w Log P o/w Consensus Log P o/w (iLOGP) (XLOGP3) (WLOGP) (MLOGP) (SILICOS-IT)  9 1.6 1.37 1.21 0.51 1.49 1.24  INH 0.03 − 0.7 − 0.31 − 0.47 − 0.27 − 0.35  Water solubility and medicinal chemistry Code Log S Log S Log S PAINS Brenk Synthetic accessibility (ESOL) (Ali) (SILICOS-IT)  9 − 1.92 − 1.95 − 1.88 0 1 1.16  INH − 0.56 − 0.25 − 1.64 0 2 1.24  Drug-likeness Code Lipinski Egan Veber Bioavailability score  9 Yes Yes Yes 0.55  INH Yes Yes Yes 0.55  Pharmacokinetics Code GI absorption PGP substrate CYP1A2 CYP2C19 CYP2C9 CYP2D6 CYP3A4 Inhibitor Inhibitor Inhibitor Inhibitor Inhibitor  9 High No No No No No No  INH High No No No No No No Density functional theory (DFT) calculations The DFT calculations for CCL and compound (9) 23 4 4 24 4 Gap LUMO HOMO (9) Gap (9) 25 The result of global chemical reactivity descriptors illustrated in Table 4 I (9) 26 A A 27 (9) (9) 4 28  Table 4 Comparative DFT analysis, illustrating electronic, energetic, and global reactivity parameters for compound (9) Parameters for DFT analysis CCL Compound (9) Dipole moment (Debye) 5.5290 4.9355 HOMO (a.u.) − 0.21481 − 0.21486 LUMO (a.u.) − 0.08171 − 0.06511 Energy Gap (ΔE Gap ) 0.1331 0.14975 Ionization Potential ( I ) (eV) 5.84 5.44 Electron affinity (eV) 2.22 1.77 Electronegativity χ (eV) 4.03 3.81 Electrochemical potential µ (eV) − 4.03 − 3.81 Hardness η (eV) 1.81 2.04 Softness S (eV) 0.55 0.49 Electrophilicity ω (eV) 4.49 3.56  Fig. 4 Optimized structural geometries of compound (9) A B (9) C D MD simulations The docking studies showed protein-ligand binding interactions in a static condition while the MD simulation identified the complex’s structural conformation and motion in real time 29 (9) Figure 5 (A) (9) (9) (9) Figure 5 (B) (9) The overall compactness of the protein was determined by RGyr, shown in Fig. 5 (C) (9) Moreover, the total number of hydrogen bond interactions between compound (9)  Fig. 5 Graphical representation of the simulation. ( A (9) B (9) C PCA-based FEL analysis The PCA investigated the conformation dynamics of the complexes during a 100ns simulation trajectory. The plots shown in Fig. 6 (9)  Fig. 6 PCA of the compound (9) A B C (9) D E Moreover, the results of FEL ( 7 ) 9 Mtb  Fig. 7 ( A B Discussion Tuberculosis is a lethal communicable disease, specifically caused by Mtb 30 31 32 The current study aimed to identify the phytocompounds from the D. innoxia 20 D. innoxia Mtb Leishmania tropica 33 34 Mycobacterium smegmatis. Datura Mtb 35 Based on the in vitro inhibitory potential of lead compound 9 against Mtb 19 The results of the molecular docking showed an acceptable binding affinity with the protein kinase (PDB ID: 6B2Q) in a static condition. The binding interactions of the lead compound 9 exhibited a strong H-bond with the VAL-98 and GLU-96 amino acid residue of the protein, along with Pi-alkyl and van der Waals interactions among key amino acid residues such as ALA-40, ALA-74, VAL-27, ILE-19, and LEU-148 involved in CCL. These interactions showed stable binding conformation of the lead compound within the binding pocket of the target protein, which was further validated by MD simulations. A study also confirmed the inhibitory potential of the target protein kinase B (PknB) as an attractive target of Mtb 36 37 The pharmacokinetic analysis of the lead compound in comparison to the INH drug also provided essential details for the compound to assess its therapeutic potential as an antitubercular agent. The pharmacological results comply with the LRF, underscoring its favorable oral bioavailability. Followed by moderately balanced hydrophilic and hydrophobic profiles highlighting the membrane permeability and absorption of the lead compound 9 within physiological space. Moreover, the lead compound was also observed to be PGP negative, revealing that it is unlikely to be rapidly effluxed from the cells, similar to the INH drug. It is noteworthy that the high Log P value of lead compound 9 suggested its improved permeability, which correlates with its significant binding affinity with the target protein. Likewise, with the lack of CYP450 inhibition in INH drug, the lead compound 9 was also found unlikely to interfere with the metabolic enzymes, thereby reducing the risk for drug-drug interactions as well as altered drug metabolism. However, the aldehyde group of lead compound 9, highlighted as Brenk alert, suggested metabolic liability; simultaneously, this structural feature may also have contributed to its stronger binding interaction with the active site residues of the target protein. Therefore, further optimization of this functional group may enhance the stability of the compound while retaining its bioactivity for therapeutic purposes. DFT calculations determined the molecular properties of the lead compound 9 in comparison to CCL. The HOMO and LUMO energy levels provided an insight into the donation and acceptance of electrons in the molecule, highlighting its significance for molecular interactions, specifically with protein-ligand binding. The results illustrated in Table 3 38 Mtb Finally, the compound was subjected to MD simulations to determine the stability of the complex in real time. Other studies have also utilized this approach to observe the stability and conformational changes within the complex 39 Mtb Mtb 40 Conclusion The emergence of drug-resistant Mtb D. innoxia Methodology The current study employed comprehensive in vitro and in silico methodology, displayed in Fig. 8 D. innoxia  Fig. 8 Approach used in the current study for identifying phytocompound against Mtb In vitro study Phytocompounds for bioassay Initially, we explored the anti-tubercular properties of various medicinal plants and found that Datura innoxia Datura innoxia Compounds dissolution and dilution Initially, 4 mg of each compound was dissolved per mL of dimethyl sulfoxide (DMSO), followed by two-fold serial dilutions, resulting in a concentration; 200 µg/mL to 0.39 µg/mL for each compound. INH positive control was tested at concentrations range from 0.625 µg/mL to 0.039 µg/mL. Microorganism strain The Mtb Mycobacterium tuberculosis Mtb Growth conditions of bacteria The Mtb Mtb 600 Mtb Determination of minimum inhibitory concentration and minimum bactericidal concentration by microdilution method – MTT assay 3-[4,5-Dimethylthiazol-2-yl]-2,5-diphenyltetrazolium bromide (MTT) was used to determine the antitubercular activity of the phytocompounds against Mtb 41 Mtb 600 42 In silico analysis Target protein retrieval Data from the Research Collaboratory for Structural Bioinformatics Protein Data Bank (RCSB PDB) (RCSB PDB: Homepage), accessed on September 23, 2024, were used to retrieve the crystal structure of protein kinase (Pkn), PDB ID: 6B2Q, which is majorly involved in signal transduction. The structure retrieved was in PDB format and contained four chains, namely A, B, C, and D, each having a sequence length of 317 amino acids without any mutation at a resolution of 2.88 Å 43 Ligand retrieval The lead compound was selected as the ligand for the in silico analysis. The phytocompound was retrieved in 2D and 3D structures from PubChem and sketched by using ChemDraw Professional 16.0 software (version: 16.0.1.4.77). The 3D structure was saved in the SDF format for docking purposes and the MOL format for DFT calculations. Ligand preparation The Ligprep tool available on Schrödinger’s 2020-3 (Maestro Version 12.5.139) was utilized for ligand preparation of the co-crystal ligand (CCL) and lead compound for obtaining structural optimization. The Epik module was employed to generate 32 poses for each ligand, producing desalts and tautomers at pH 7.0 ± 2. Finally, each ligand was minimized under a force field of OPLS3e 44 Protein preparation The Protein Preparation Wizard tool, easily available on Schrodinger 2020-3 (Maestro Version 12.5.139) was employed to conduct the protein preparation of the target protein, PDB ID: 6B2Q. The missing loops and side chains were filled by the prime job, and the Epik module was employed to generate het states between pH = 7.0 ± 2, and water molecules beyond the diameter of 3 Å were deleted. Moreover, PROPKA was employed at pH = 7.0 to optimize the H-bond scaffolding. The steric hindrance was removed for further refinement and modification, and finally, the protein was minimized under the OPLS3e force field 45 Glide grid generation Receptor grid generation was done using the receptor grid generation panel in the Maestro glide program available on Schrodinger 2020-3 (Maestro Version 12.5.139) in the centroid of the working space of the CCL for the identification of suitable interactions between the receptor and the ligand 46 47 Molecular docking The molecular docking of lead compound and INH was done along with CCL on Maestro, Schrodinger 2020-3 (Maestro Version 12.5.139), with the Ligand Docking tool. The receptor grid file and the energy-minimized files of the ligands were imported 48 Pharmacokinetic analysis The pharmacokinetic analysis of the lead compound and INH drug was performed on SwissADME (SwissADME), an online tool, by applying the molecular fingerprinting technique. The string of canonical SMILES of the query molecule was provided as input data to evaluate the ADME across various descriptors, including physiochemical features, lipophilicity, solubility, pharmacokinetics, drug-likeness, and medicinal chemistry. DFT calculations The three-dimensional geometries of the lead compound and CCL were designed and optimized by using GaussView (version 5.0.8). The CPCM model was chosen for the optimization and frequency calculations in the solvent and gaseous phases using the B3LYP method. The frontier molecular orbitals (FMOs) and global reactivity parameters were computed, along with a visualization of the molecular electrostatic potential (MEP) of the molecules. MD simulations MD was performed on Desmond to determine the natural setting behavior and stability of the protein-ligand docked complex in real-time 29 49 50 51 Principal component analysis (PCA) – based free energy landscape study (FEL) PCA is a multivariate statistical technique performed by computing the protein’s internal motion denoted by eigenvalues and eigenvectors. The covariance matrix for the C-alpha (Cα) coordinates was generated over a 100 ns simulation trajectory 52 53 Electronic supplementary material Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors gratefully acknowledge the financial support from the Higher Education Commission of Pakistan under the International Research Support Initiative Program (IRSIP). Author contributions Study design and conceptualization, M.S.A., A.D.B., W.T.S.; Provision of materials and Experimental procedures, S.A.K., M.A.R., and Z.J.; Acquisition of data and formal analyses, H.E., M.A., and S.M.Q.; Writing—original draft, S.A.K., and M.U.K.; Visualization and BioRender figures, H.E., M.U.K., and S.M.Q.; Writing—review and editing, A.D.B, M.S.A., W.T.S., U.M.K., M.A.R., and S.A.K. All authors contributed to manuscript revision, read, and approved the submitted version. Data availability All data generated or analyzed during this study are included in this published article. Declarations Competing interests The authors declare no competing financial interests. References 1. Floyd K Glaziou P Zumla A Raviglione M The global tuberculosis epidemic and progress in care, prevention, and research: an overview in year 3 of the end TB era Lancet Respiratory Med. 2018 6 299 314 10.1016/s2213-2600(18)30057-2 29595511 Floyd, K., Glaziou, P., Zumla, A. & Raviglione, M. The global tuberculosis epidemic and progress in care, prevention, and research: an overview in year 3 of the end TB era. Lancet Respiratory Med. 6 10.1016/S2213-2600(18)30057-2 29595511 2. Li, Y. Y., Cai, R. J., Talbot, E. A. & Wang, Y. T. in Molecular Medical Microbiology 3. Geneva Global Tuberculosis Report 2023., (2023). 4. Organization, W. H. Global Tuberculosis Report 2018WHO., (2018). 5. Selikoff IJ Robitzek EH Ornstein GG Treatment of pulmonary tuberculosis with Hydrazide derivatives of Isonicotinic acid J. Am. Med. Assoc. 1952 150 973 980 10.1001/jama.1952.03680100015006 12990328 Selikoff, I. J., Robitzek, E. H. & Ornstein, G. G. Treatment of pulmonary tuberculosis with Hydrazide derivatives of Isonicotinic acid. J. Am. Med. Assoc. 150 12990328 10.1001/jama.1952.03680100015006 6. Daniel TM Rifampin–a major new chemotherapeutic agent for the treatment of tuberculosis N. Engl. J. Med. 1969 280 615 616 10.1056/nejm196903132801112 4974534 Daniel, T. M. Rifampin–a major new chemotherapeutic agent for the treatment of tuberculosis. N. Engl. J. Med. 280 4974534 10.1056/NEJM196903132801112 7. Eldehna WM Fares M Abdel-Aziz MM Abdel-Aziz HA Design, synthesis and antitubercular activity of certain nicotinic acid Hydrazides Molecules (Basel Switzerland) 2015 20 8800 8815 10.3390/molecules20058800 25988611 PMC6272317 Eldehna, W. M., Fares, M., Abdel-Aziz, M. M. & Abdel-Aziz, H. A. Design, synthesis and antitubercular activity of certain nicotinic acid Hydrazides. Molecules (Basel Switzerland) 20 25988611 10.3390/molecules20058800 PMC6272317 8. Kim HJ Real-world experience of adverse reactions-necessitated rifampicin-sparing treatment for drug-susceptible pulmonary tuberculosis Sci. Rep. 2023 13 11275 10.1038/s41598-023-38394-1 37438379 PMC10338469 Kim, H. J. et al. Real-world experience of adverse reactions-necessitated rifampicin-sparing treatment for drug-susceptible pulmonary tuberculosis. Sci. Rep. 13 37438379 10.1038/s41598-023-38394-1 PMC10338469 9. Bunalema, L., Fotso, G. W., Waako, P., Tabuti, J. & Yeboah, S. O. Potential of Zanthoxylum leprieurii as a source of active compounds against drug resistant Mycobacterium tuberculosis. BMC Complement. Altern. Med. 17 10.1186/s12906-017-1602-x PMC5289037 28148252 10. Sharma D Yadav JP An overview of phytotherapeutic approaches for the treatment of tuberculosis Mini Rev. Med. Chem. 2017 17 167 183 10.2174/1389557516666160505114603 27145855 Sharma, D. & Yadav, J. P. An overview of phytotherapeutic approaches for the treatment of tuberculosis. Mini Rev. Med. Chem. 17 27145855 10.2174/1389557516666160505114603 11. Bahuguna, A. & Rawat, D. S. An overview of new antitubercular drugs, drug candidates, and their targets. 40 10.1002/med.21602 31254295 12. Khadka, D. et al. The use of medicinal plants to prevent COVID-19 in Nepal. 17 10.1186/s13002-021-00449-w PMC8027983 33832492 13. Fabricant DS Farnsworth NR The value of plants used in traditional medicine for drug discovery Environ. Health Perspect. 2001 109 Suppl 1 69 75 10.1289/ehp.01109s169 11250806 PMC1240543 Fabricant, D. S. & Farnsworth, N. R. The value of plants used in traditional medicine for drug discovery. Environ. Health Perspect. 109 11250806 10.1289/ehp.01109s169 PMC1240543 14. Atanasov, A. G., Zotchev, S. B. & Dirsch, V. M. Natural products in drug discovery: advances and opportunities. 20 10.1038/s41573-020-00114-z PMC7841765 33510482 15. KARDI, C. & SEKIOU, S. Valorisation D’une Plante Poussant Spontanément Dans La Région De Tipaza (Algérie), Par L’analyse Phytochimique Et L’étude Des Activités Biologiques De Ses Extraits 16. Chopra, B. & Dhingra, A. K. Natural products: A lead for drug discovery and development. 35 10.1002/ptr.7099 33847440 17. Sharma, M., Dhaliwal, I., Rana, K. & Phytochemistry Pharmacology, and toxicology of Datura Species-A review. 10 10.3390/antiox10081291 PMC8389218 34439539 18. Gaire BP Subedi L A review on the Pharmacological and toxicological aspects of Datura stramonium L J. Integr. Med. 2013 11 73 79 10.3736/jintegrmed2013016 23506688 Gaire, B. P. & Subedi, L. A review on the Pharmacological and toxicological aspects of Datura stramonium L. J. Integr. Med. 11 23506688 10.3736/jintegrmed2013016 19. Islam S Antibacterial potential of propolis: molecular docking, simulation and toxicity analysis AMB Express 2024 14 81 10.1186/s13568-024-01741-0 39014110 PMC11252112 Islam, S. et al. Antibacterial potential of propolis: molecular docking, simulation and toxicity analysis. AMB Express 14 39014110 10.1186/s13568-024-01741-0 PMC11252112 20. Alam W Khan H Khan SA Nazir S Akkol EK Datura Metel: A review on chemical constituents, traditional uses and Pharmacological activities Curr. Pharm. Design 2021 27 2545 2557 10.2174/1381612826666200519113752 32427078 Alam, W., Khan, H., Khan, S. A., Nazir, S. & Akkol, E. K. Datura Metel: A review on chemical constituents, traditional uses and Pharmacological activities. Curr. Pharm. Design 27 10.2174/1381612826666200519113752 32427078 21. Maddeboina, K. et al. Recent advances in multitarget-directed ligands via in Silico drug discovery. Drug Discovery Today 29 10.1016/j.drudis.2024.103904 38280625 22. da Fonseca, A. M. & Caluaco, B. J. Screening of potential inhibitors targeting the main protease structure of SARS-CoV-2 via molecular docking, and approach with molecular dynamics, RMSD, RMSF, H-Bond, SASA and MMGBSA. 66 10.1007/s12033-023-00831-x 37490200 23. Elkaeed, E. B., Yousef, R. G. & Design, Synthesis, Docking, D. F. T. MD Simulation Studies of a New Nicotinamide-Based Derivative: In Vitro Anticancer and VEGFR-2 Inhibitory Effects. 27, (2022). 10.3390/molecules27144606 10.3390/molecules27144606 PMC9317904 35889478 24. Ahamed FM Molecular dynamics simulation, QSAR, DFT, molecular docking, ADMET, and synthesis of Ethyl 3-((5-Bromopyridin-2-yl) Imino) butanoate analogues as potential inhibitors of SARS-CoV-2 Polycycl. Aromat. Compd. 2024 44 294 312 10.1080/10406638.2023.2173618 Ahamed, F. M. et al. Molecular dynamics simulation, QSAR, DFT, molecular docking, ADMET, and synthesis of Ethyl 3-((5-Bromopyridin-2-yl) Imino) butanoate analogues as potential inhibitors of SARS-CoV-2. Polycycl. Aromat. Compd. 44 25. Mallikarjuna Reddy G Camilo A Jr Raul Garcia J Pyrrole-2,5-dione analogs as a promising antioxidant agents: microwave-assisted synthesis, bio-evaluation, SAR analysis and DFT studies/interpretation Bioorg. Chem. 2021 106 104465 10.1016/j.bioorg.2020.104465 33229119 Mallikarjuna Reddy, G., Camilo, A. Jr. & Raul Garcia, J. Pyrrole-2,5-dione analogs as a promising antioxidant agents: microwave-assisted synthesis, bio-evaluation, SAR analysis and DFT studies/interpretation. Bioorg. Chem. 106 33229119 10.1016/j.bioorg.2020.104465 26. Ejaz SA Aziz M Zafar Z Akhtar N Ogaly HA Revisiting the inhibitory potential of protein kinase inhibitors against NEK7 protein via comprehensive computational investigations Sci. Rep. 2023 13 4304 10.1038/s41598-023-31499-7 36922575 PMC10017757 Ejaz, S. A., Aziz, M., Zafar, Z., Akhtar, N. & Ogaly, H. A. Revisiting the inhibitory potential of protein kinase inhibitors against NEK7 protein via comprehensive computational investigations. Sci. Rep. 13 36922575 10.1038/s41598-023-31499-7 PMC10017757 27. Rahman, J., Tareq, A. M. & Biological Evaluation, D. F. T. Calculations and molecular Docking studies on the antidepressant and cytotoxicity activities of Cycas pectinata Buch.-Ham. Compounds 13 10.3390/ph13090232 PMC7557754 32899148 28. Kawsar SM Chemical descriptors, PASS, molecular docking, molecular dynamics and ADMET predictions of glucopyranoside derivatives as inhibitors to bacteria and fungi growth Org. Commun. 2022 15 203 Kawsar, S. M. et al. Chemical descriptors, PASS, molecular docking, molecular dynamics and ADMET predictions of glucopyranoside derivatives as inhibitors to bacteria and fungi growth. Org. Commun. 15 29. De Vivo M Masetti M Bottegoni G Cavalli A Role of molecular dynamics and related methods in drug discovery J. Med. Chem. 2016 59 4035 4061 10.1021/acs.jmedchem.5b01684 26807648 De Vivo, M., Masetti, M., Bottegoni, G. & Cavalli, A. Role of molecular dynamics and related methods in drug discovery. J. Med. Chem. 59 26807648 10.1021/acs.jmedchem.5b01684 30. Yadav P Challenges Solutions for recent advancements in Multi-Drugs resistance tuberculosis: A review Microbiol. Insights 2023 16 11786361231152438 10.1177/11786361231152438 36741475 PMC9893349 Yadav, P. & Challenges Solutions for recent advancements in Multi-Drugs resistance tuberculosis: A review. Microbiol. Insights 16 36741475 10.1177/11786361231152438 PMC9893349 31. Khan, M. U. et al. Identification of novel natural compounds against CFTR p.Gly628Arg pathogenic variant. 14 10.1186/s13568-024-01762-9 PMC11383896 39249658 32. Sakhawat, A. et al. Natural compound targeting BDNF V66M variant: insights from in Silico Docking and molecular analysis. 13 10.1186/s13568-023-01640-w PMC10684480 38015338 33. Ur Rahman, M., Khan, M., Khan, S. W. & Khan, R. U. Novel schiff bases of Vanillin: potent inhibitors of macrophage harbored leishmania tropica. 47 10.1007/s12639-023-01594-7 PMC10382424 37520206 34. Ravindran R Chakrapani G Mitra K Doble M Inhibitory activity of traditional plants against Mycobacterium smegmatis and their action on filamenting temperature sensitive mutant Z (FtsZ)-A cell division protein PloS One 2020 15 e0232482 10.1371/journal.pone.0232482 32357366 PMC7195194 Ravindran, R., Chakrapani, G., Mitra, K. & Doble, M. Inhibitory activity of traditional plants against Mycobacterium smegmatis and their action on filamenting temperature sensitive mutant Z (FtsZ)-A cell division protein. PloS One 15 32357366 10.1371/journal.pone.0232482 PMC7195194 35. Rahgozar N Khaniki B Sardari S Evaluation of antimycobacterial and synergistic activity of plants selected based on cheminformatic parameters Iran. Biomed. J. 2018 22 401 407 10.29252/.22.6.401 29510602 PMC6305812 Rahgozar, N., Khaniki, B., Sardari, S. & G. & Evaluation of antimycobacterial and synergistic activity of plants selected based on cheminformatic parameters. Iran. Biomed. J. 22 29510602 10.29252/.22.6.401 PMC6305812 36. Thongdee, P. & Hanwarinroj, C. Virtual screening identifies novel and potent inhibitors of Mycobacterium tuberculosis PknB with antibacterial activity. 62 10.1021/acs.jcim.2c00531 35994014 37. Vieira, T. F. & Martins, F. G. In Silico Identification of Possible Inhibitors for Protein Kinase B (PknB) of Mycobacterium tuberculosis. 26, (2021). 10.3390/molecules26206162 10.3390/molecules26206162 PMC8541300 34684743 38. Jayaraman M Gosu V Kumar R Jeyaraman J Computational insights into potential marine natural products as selective inhibitors of Mycobacterium tuberculosis InhA: A structure-based virtual screening study Comput. Biol. Chem. 2024 108 107991 10.1016/j.compbiolchem.2023.107991 38086160 Jayaraman, M., Gosu, V., Kumar, R. & Jeyaraman, J. Computational insights into potential marine natural products as selective inhibitors of Mycobacterium tuberculosis InhA: A structure-based virtual screening study. Comput. Biol. Chem. 108 38086160 10.1016/j.compbiolchem.2023.107991 39. Sakhawat A In Silico and in vitro analyses to investigate the effects of vitamin C on VEGF protein J. Taibah Univ. Med. Sci. 2024 19 775 789 10.1016/j.jtumed.2024.06.008 39149519 PMC11325796 Sakhawat, A. et al. In Silico and in vitro analyses to investigate the effects of vitamin C on VEGF protein. J. Taibah Univ. Med. Sci. 19 39149519 10.1016/j.jtumed.2024.06.008 PMC11325796 40. Nyambo K Molecular docking, molecular dynamics simulations and binding free energy studies of interactions between Mycobacterium tuberculosis Pks13, PknG and bioactive constituents of extremophilic bacteria Sci. Rep. 2024 14 6794 10.1038/s41598-024-57124-9 38514663 PMC10957976 Nyambo, K. et al. Molecular docking, molecular dynamics simulations and binding free energy studies of interactions between Mycobacterium tuberculosis Pks13, PknG and bioactive constituents of extremophilic bacteria. Sci. Rep. 14 38514663 10.1038/s41598-024-57124-9 PMC10957976 41. Martin A Multicenter study of MTT and resazurin assays for testing susceptibility to first-line anti-tuberculosis drugs Int. J. Tuberculosis Lung Disease: Official J. Int. Union against Tuberculosis Lung Disease 2005 9 901 906 16104638 Martin, A. et al. Multicenter study of MTT and resazurin assays for testing susceptibility to first-line anti-tuberculosis drugs. Int. J. Tuberculosis Lung Disease: Official J. Int. Union against Tuberculosis Lung Disease 9 16104638 42. Vilchèze C Novel inhibitors of InhA efficiently kill Mycobacterium tuberculosis under aerobic and anaerobic conditions Antimicrob. Agents Chemother. 2011 55 3889 3898 10.1128/aac.00266-11 21628538 PMC3147652 Vilchèze, C. et al. Novel inhibitors of InhA efficiently kill Mycobacterium tuberculosis under aerobic and anaerobic conditions. Antimicrob. Agents Chemother. 55 21628538 10.1128/AAC.00266-11 PMC3147652 43. Wang T Mtb PKNA/PKNB dual Inhibition provides selectivity advantages for inhibitor design to minimize host kinase interactions ACS Med. Chem. Lett. 2017 8 1224 1229 10.1021/acsmedchemlett.7b00239 29259738 PMC5733270 Wang, T. et al. Mtb PKNA/PKNB dual Inhibition provides selectivity advantages for inhibitor design to minimize host kinase interactions. ACS Med. Chem. Lett. 8 29259738 10.1021/acsmedchemlett.7b00239 PMC5733270 44. Mishra, A., Mulpuru, V. & Mishra, N. An interaction network driven approach for identifying cervical, endometrial, vulvar carcinomic biomarkers and their Multi-targeted inhibitory agents from few widely available medicinal plants. 195 10.1007/s12010-023-04441-w 36951938 45. Modanwal, S., Mishra, A. & Mishra, N. An integrative analysis of GEO data to identify possible therapeutic biomarkers of prostate cancer and targeting potential protein through Zea mays phytochemicals by virtual screening approaches. J. Biomol. Struct. Dyn. 10.1080/07391102.2023.2283163 38217083 46. Rajput, D., Jain, D., Kashaw, S. K. & Patil, U. K. Molecular Docking studies on phytoconstituent isolated from Nyctanthes arbortristis Linn. Int. J. Pharm. Invest. 14, 47. Seeliger, D. & de Groot, B. L. Conformational transitions upon ligand binding: holo-structure prediction from apo conformations. PLoS computational biology 10.1371/journal.pcbi.1000634 PMC2796265 20066034 48. Ikram S Ahmad F Ahmad J Durdagi S Screening of small molecule libraries using combined text mining, ligand- and target-driven based approaches for identification of novel granzyme H inhibitors J. Mol. Graph. Model. 2021 105 107876 10.1016/j.jmgm.2021.107876 33744783 Ikram, S., Ahmad, F., Ahmad, J. & Durdagi, S. Screening of small molecule libraries using combined text mining, ligand- and target-driven based approaches for identification of novel granzyme H inhibitors. J. Mol. Graph. Model. 105 33744783 10.1016/j.jmgm.2021.107876 49. Khan MF Exploring optimal drug targets through subtractive proteomics analysis and pangenomic insights for tailored drug design in tuberculosis Sci. Rep. 2024 14 10904 10.1038/s41598-024-61752-6 38740859 PMC11091173 Khan, M. F. et al. Exploring optimal drug targets through subtractive proteomics analysis and pangenomic insights for tailored drug design in tuberculosis. Sci. Rep. 14 38740859 10.1038/s41598-024-61752-6 PMC11091173 50. Rehman, H. M. & Sajjad, M. Identification of NS2B-NS3 protease inhibitors for therapeutic application in ZIKV infection: A Pharmacophore-Based High-Throughput virtual screening and MD simulations approaches. 11 10.3390/vaccines11010131 PMC9862652 36679976 51. Pronk S GROMACS 4.5: a high-throughput and highly parallel open source molecular simulation toolkit Bioinf. (Oxford England) 2013 29 845 854 10.1093/bioinformatics/btt055 PMC3605599 23407358 Pronk, S. et al. GROMACS 4.5: a high-throughput and highly parallel open source molecular simulation toolkit. Bioinf. (Oxford England) 29 10.1093/bioinformatics/btt055 PMC3605599 23407358 52. Gosu V Deciphering the intrinsic dynamics of unphosphorylated IRAK4 kinase bound to type I and type II inhibitors Comput. Biol. Med. 2023 160 106978 10.1016/j.compbiomed.2023.106978 37172355 Gosu, V. et al. Deciphering the intrinsic dynamics of unphosphorylated IRAK4 kinase bound to type I and type II inhibitors. Comput. Biol. Med. 160 37172355 10.1016/j.compbiomed.2023.106978 53. Morita S Chemometrics and related fields in Python Anal. Sciences: Int. J. Japan Soc. Anal. Chem. 2020 36 107 111 10.2116/analsci.19R006 31735763 Morita, S. Chemometrics and related fields in Python. Anal. Sciences: Int. J. Japan Soc. Anal. Chem. 36 10.2116/analsci.19R006 31735763 ",
  "metadata": {
    "Title of this paper": "Chemometrics and related fields in Python",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479965/"
  }
}