{
  "title": "Paper_698",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12474792 PMC12474792.1 12474792 12474792 41003950 10.1007/s12672-025-03706-6 3706 1 Analysis Identification of immunoheterogeneous key prognostic protein ZC3H12D in OSCC and analysis of prognostic models and drug resistance Wang Qianqian 1 Qi Shuai 2 He Jing 1 Li Danyang 3 Deng Taoli 280166329@qq.com 2 1 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Department of Oncology, Zhuzhou Hospital Affiliated to Xiangya School of Medicine, Central South University, 2 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Department of stomatology, Zhuzhou Hospital Affiliated to Xiangya School of Medicine, Central South University, 3 https://ror.org/05jscf583 grid.410736.7 0000 0001 2204 9268 Department of Pharmacology, College of Pharmacy, Harbin Medical University, 26 9 2025 12 2025 16 478248 1708 30 6 2025 21 9 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background We constructed a nomogram model utilizing key clinical and molecular biological variables to predict the 1-year, 3-year, and 5-year survival probabilities for patients with oral squamous cell carcinoma (OSCC). The model’s predictive efficacy was assessed through calibration curves. Additionally, a detailed Spearman correlation analysis of the ZC3H12D gene was executed, with patient data stratified into high and low expression categories based on its expression levels for differential gene analysis. Following this, Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) enrichment analyses, as well as Gene Set Enrichment Analysis (GSEA), were performed on the identified differentially expressed genes to delineate their specific contributions to biological processes and metabolic pathways. Results The nomogram model demonstrated a high degree of predictive accuracy, effectively predicting the survival probabilities of oral cancer. patientsThe correlation analysis of the ZC3H12D gene revealed significant correlations with various immune cell types. A total of 439 significantly differentially expressed genes were identified through differential gene analysis. GO and KEGG enrichment analyses, along with GSEA analysis, further elucidated the specific roles of these differentially expressed genes in biological processes and metabolic pathways. Moreover, immune infiltration analysis indicated significant differences between the high and low expression groups of ZC3H12D in terms of immune cell infiltration, immune scores, and ESTIMATE scores. Conclusion The nomogram model constructed in this study provides a practical tool for prognostic assessment in OSCC patients. Additionally, the in-depth analysis of the ZC3H12D gene reveals its significant role in the occurrence and development of oral cancer, providing data support and a theoretical basis for further research. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Oral squamous cell carcinoma (OSCC) represents the most prevalent malignant tumor type within the oral cavity, comprising approximately 90% of all oral tumor instances reported [ 1 3 4 5 Oral cancer (OC), a prevalent form of head and neck malignancy, is seeing ongoing advancements in its treatment protocols. Immunotherapy, an up-and-coming therapeutic approach, is increasingly drawing attention as a focal point of research. This method offers fresh avenues for oral cancer treatment by stimulating or intensifying the body’s immune response to detect and combat cancerous cells [ 6 7 8 9 10 11 With the continuous progress and wide application of computational biology [ 12 13 Method Data process of OSCC In order to perform an in-depth bioinformatics analysis, we first need to download the tpm dataset for head and neck squamous cell carcinoma (HNSC) from the xena website ( https://xenabrowser.net/ GSE30784 14 RNA was extracted from 167 OSCC, 17 dysplasia, and 45 normal oral tissues and hybridized to Affymetrix U133 2.0 Plus GeneChip arrays. The GEO database, a public repository for high-throughput gene expression, microarray data, and sequence data, offers a vast array of biomedical research information, facilitating more comprehensive and in-depth analyses. The Immunoinfiltration and differential immune cells in OSCC For this research, we employed the GSE30784 15 *** * WGCNA analysis for the differential immune related genes In the study, we selected the relative abundance of eight significantly different immune cells as biological phenotypic data based on the proportion of immune cell differences associated with OSCC (oral squamous cell carcinoma). These data were used to perform a weighted gene co-expression network analysis [ 16 After pooling and screening the modules, we successfully developed 12 different modules and evaluated the correlation between these modules and differential immune cells in order to screen for the most significant correlations. Among these modules, we pay particular attention to the turquoise module, which is most relevant to differential immune cells. We identified key module genes by setting screening criteria for key module genes (module membership MM greater than 0.5, gene significance GS greater than 0.3, and p-value less than 0.05). Subsequently, we extracted the intersections of key module genes such as B.cells.memory, macrophages.M0, and Mast.cells.activated cells as gene collections associated with differential immune cells for further screening and analysis. Screening of immune-related genes in OSCC and construction of prognostic models For this research, we employed the robust bioinformatics tool DESeq2 [ 17 18 To further investigate the professional relationship between these genes and clinical prognosis in a scientific manner, we integrated clinical data sourced from the TCGA database with the expression data pertaining to these 135 common genes. Initially, we utilized the Cox proportional hazards model for the purpose of preliminary screening, with the aim of identifying genes that are correlated with patient prognosis. Subsequently, in order to more precisely select feature genes with predictive value, we implemented three distinct machine learning algorithms: LASSO (Least Absolute Shrinkage and Selection Operator), Random Forest [ 19 20 Statistics analysis The GO and KEGG [ 21 Results Data process The tpm dataset for head and neck squamous cell carcinoma (HNSC) from the xena website was obtained, and obtained a high-quality set of oral cancer (OSCC) mRNA sequencing data after screening and organizing with clinical data. The dataset includes 314 OSCC samples and 44 adjacent tissues. Additionally, we downloaded GSE30784 Screening OSCC immune-related differential genes Based on cibersort, 22 immune cells proportions were obtained, and according to the differential analysis of OSCC normal tissues and tumor tissues, we found that B cell naive, B cells memory, In professional terms, significant subdivisional differences were observed in OSCC tissues for Employing specialized English terminology, we began by identifying ten unique immune cell types: naive T cells CD4, resting memory T cells CD4, follicular helper T cells, macrophages M0, macrophages M1, resting dendritic cells, activated mast cells, and neutrophils (Fig. 1 1  Fig. 1 A p p p B C D–F G After the merging process, a total of 12 modules were established, and an evaluation of the correlation between these modules and the differential immune cells was conducted to identify the most significant correlations (Fig. 1 p 1 ( 1 ). Construction of prognostic model of immune-related genes Based on the intersection of OSCC (oral squamous cell carcinoma) differential genes and WGCNA (weighted gene co-expression network analysis) immune cell-related co-expressed genes, we successfully screened 135 key immune-related genes (Fig. 2 2 2 ( 2 ) 2 ( 2  Fig. 2 Feature Gene Selection. A B C D E F G ZC3H12D gene was identified as the key prognostic gene for OSCC In the study, we conducted a multifactorial Cox regression analysis on six intersecting genes with the aim of identifying key genes associated with oral cancer. Through this method, we ultimately identified the ZC3H12D gene as a key gene due to its minimum p-value, as illustrated in (Fig. 3 3 https://portal.gdc.cancer.gov 3 4 4 4 5  Fig. 3 Expression Analysis of Key Gene ZC3H12D. A B C D p p p  Fig. 4 Survival Analysis of ZC3H12D. A B C D P  Fig. 5 Differences in ZC3H12D Expression Levels. A B–F Through the application of univariate and multivariate Cox regression analysis methods, we conducted an in-depth assessment of the expression levels of the ZC3H12D gene and the impact of multiple clinical variable factors on patient survival duration. The research findings revealed an important discovery: there is a significant correlation between high expression levels of the ZC3H12D gene and longer survival duration in patients. This finding indicates that the expression of the ZC3H12D gene can serve as an independent prognostic protective factor, which holds significant clinical implications for the prognostic evaluation of oral cancer patients (Figs. 6 6 6  Fig. 6 Prognostic Model of ZC3H12D and Survival Analysis. A B C D ZC3H12D biological and pathway analysis A comprehensive Spearman correlation analysis of the ZC3H12D gene was carried out to delve deeper into the genes closely related to its expression levels, visually demonstrating the complex interactions among the ten most significantly correlated genes through a meticulously crafted chord diagram ( 7 ) p 7 p 7  Fig. 7 ZC3H12D-Related Gene Analysis and Functional Enrichment. A B C D ZC3H12D affects the tumor immune microenvironment This study employed three immune infiltration analysis methods: CIBERSORT, ssGSEA, and ESTIMATE, to conduct an in-depth investigation of the performance of ZC3H12D in immune cell infiltration and correlation analysis, where P-values less than 0.001, 0.01, and 0.05 were represented by “***”, “**”, and “*” respectively to indicate significance levels. Firstly, the CIBERSORT method was utilized to explore the correlation between ZC3H12D expression and various immune cell types. The results indicated a significant correlation between ZC3H12D and multiple immune cell types (Fig. 8 8 8 8 8  Fig. 8 Correlation Analysis of ZC3H12D Expression and Immune Infiltration. A B C D E F p p p Discussion This study delved into the clinical and molecular biology of oral squamous cell carcinoma (OSCC) patients and created a predictive model to improve the utility and accuracy of prognostic assessment. Through the analysis of clinical data and molecular biological indicators, we identified a series of factors that significantly affect the prognosis of patients, and constructed a nomogram (Fig. 6 p Shengping Huang [ 22 23 Furthermore, this study also explores the role of ZC3H12D in the tumor immune microenvironment. We employed three immune infiltration analysis methods: CIBERSORT, ssGSEA, and ESTIMATE, to conduct an in-depth investigation of ZC3H12D’s performance in immune cell infiltration and correlation analysis. The correlation between the expression of the gene ZC3H12D and various immune cell types was subjected to further validation using the Single-Sample Gene Set Enrichment Analysis (ssGSEA) approach. This analysis served to reinforce and confirm the previously observed association of ZC3H12D with a multitude of immune cell types, thereby providing additional evidence for the gene’s role in immune system regulation. Further analysis of the correlation between ZC3H12D expression levels and immune scores and stromal scores revealed significant positive correlations with both immune scores and stromal scores. In summary, this study not only reveals the potential mechanism of action of the ZC3H12D gene in oral cancer but also enhances the accuracy of prognostic assessment by constructing a nomogram model, providing new perspectives and tools for clinical treatment. Future research should further explore the specific role of ZC3H12D in the tumor immune microenvironment and its potential as a therapeutic target. Limitation Despite the significant findings of this study, several limitations should be noted. Firstly, the sample size used in this research may limit the generalizability of the results to a larger population. Additionally, the study was conducted in a single institution, which may introduce bias and affect the external validity. Furthermore, while we have identified ZC3H12D as a key gene associated with oral cancer prognosis, the underlying mechanisms and interactions with other genes and pathways require further elucidation. Finally, the predictive model developed in this study needs to be validated in independent cohorts to ensure its robustness and reliability in clinical practice. Conclusion In this study, we analyzed data from OSCC public disease cohorts and found that ZC3H12D plays a significant role in the OSCC tumor microenvironment. At the same time, patients with high expression of ZC3H12D in OSCC had a better prognosis, while patients with high OSCC stage had low expression level of ZC3H12D. These conclusions suggest that ZC3H12D promotes T cell-related cellular immunity in the OSCC tumor microenvironment and thus plays a role in inhibiting OSCC. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Qianqian Wang and Shuai Qi have contributed equally to this paper. Author contributions T.D. conceived and designed the study. Q.W. performed bioinformatics analyses and data visualization. S.Q. assisted with clinical data collection and interpretation. J.H. drafted the manuscript and prepared the figures. D.L. revised the manuscript critically for important intellectual content. All authors read and approved the final manuscript. Funding No Funding. Data availability GSE30784 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE30784. Declarations Ethical approval and consent to participate Ethical statement is not applicable in this article. All the authors have no possible financial or non-financial conflicts of interest related to the work described. Consent for publication All authors approved to publish the manuscript. Competing interests The authors declare no competing interests. References 1. Sung H Ferlay J Siegel RL Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 33538338 10.3322/caac.21660 2. Bray F Ferlay J Soerjomataram I Siegel RL Torre LA Jemal A Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 6 394 424 30207593 10.3322/caac.21492 Bray F, Ferlay J, Soerjomataram I, Siegel RL, Torre LA, Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2018;68(6):394–424. 30207593 10.3322/caac.21492 3. Erratum Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2020 70 4 313 10.3322/caac.21609 32767693 Erratum. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2020;70(4):313. 10.3322/caac.21609 32767693 4. Zhao X Sun S Zeng X Cui L Expression profiles analysis identifies a novel three-mRNA signature to predict overall survival in oral squamous cell carcinoma Am J Cancer Res 2018 8 3 450 61 29637000 PMC5883095 Zhao X, Sun S, Zeng X, Cui L. Expression profiles analysis identifies a novel three-mRNA signature to predict overall survival in oral squamous cell carcinoma. Am J Cancer Res. 2018;8(3):450–61. 29637000 PMC5883095 5. Ferlay J Soerjomataram I Dikshit R Cancer incidence and mortality worldwide: sources, methods and major patterns in GLOBOCAN 2012 Int J Cancer 2015 136 5 E359 86 10.1002/ijc.29210 25220842 Ferlay J, Soerjomataram I, Dikshit R, et al. Cancer incidence and mortality worldwide: sources, methods and major patterns in GLOBOCAN 2012. Int J Cancer. 2015;136(5):E359-86. 25220842 10.1002/ijc.29210 6. Wu K Han N Mao Y Li Y Increased levels of PD1 and glycolysis in CD4(+) T cells are positively associated with lymph node metastasis in OSCC BMC Oral Health 2023 23 1 356 10.1186/s12903-023-03043-6 37270478 PMC10239138 Wu K, Han N, Mao Y, Li Y. Increased levels of PD1 and glycolysis in CD4(+) T cells are positively associated with lymph node metastasis in OSCC. BMC Oral Health. 2023;23(1):356. 37270478 10.1186/s12903-023-03043-6 PMC10239138 7. Wehrhan F Weber M Baran C PD1 expression and correlation with its ligands in oral cancer specimens and peripheral blood J Craniomaxillofac Surg 2021 49 2 118 25 10.1016/j.jcms.2020.12.007 33358116 Wehrhan F, Weber M, Baran C, et al. PD1 expression and correlation with its ligands in oral cancer specimens and peripheral blood. J Craniomaxillofac Surg. 2021;49(2):118–25. 33358116 10.1016/j.jcms.2020.12.007 8. Dong Y Zeng K Ai R Single-cell transcriptome dissecting the microenvironment remodeled by PD1 blockade combined with photodynamic therapy in a mouse model of oral carcinogenesis MedComm (2020) 2024 5 7 e636 10.1002/mco2.636 38962427 PMC11220179 Dong Y, Zeng K, Ai R, et al. Single-cell transcriptome dissecting the microenvironment remodeled by PD1 blockade combined with photodynamic therapy in a mouse model of oral carcinogenesis. MedComm (2020). 2024;5(7):e636. 38962427 10.1002/mco2.636 PMC11220179 9. Wahbi HS Manadili AA The expression of PDL-1 and PD1 in the microenvironment of oral squamous cell carcinoma Asian Pac J Cancer Prev 2024 25 10 3471 9 10.31557/APJCP.2024.25.10.3471 39471013 PMC11711342 Wahbi HS, Manadili AA. The expression of PDL-1 and PD1 in the microenvironment of oral squamous cell carcinoma. Asian Pac J Cancer Prev. 2024;25(10):3471–9. 39471013 10.31557/APJCP.2024.25.10.3471 PMC11711342 10. Dong Y Wang Z Mao F PD-1 blockade prevents the progression of oral carcinogenesis Carcinogenesis 2021 42 6 891 902 10.1093/carcin/bgab035 33993220 Dong Y, Wang Z, Mao F, et al. PD-1 blockade prevents the progression of oral carcinogenesis. Carcinogenesis. 2021;42(6):891–902. 33993220 10.1093/carcin/bgab035 11. Sieviläinen M Almahmoudi R Al-Samadi A Salo T Pirinen M Almangush A The prognostic value of immune checkpoints in oral squamous cell carcinoma Oral Dis 2019 25 6 1435 45 10.1111/odi.12991 30315712 Sieviläinen M, Almahmoudi R, Al-Samadi A, Salo T, Pirinen M, Almangush A. The prognostic value of immune checkpoints in oral squamous cell carcinoma. Oral Dis. 2019;25(6):1435–45. 30315712 10.1111/odi.12991 12. Yan K Wang Y Shao Y Xiao T Gene instability-related lncRNA prognostic model of melanoma patients via machine learning strategy J Oncol 2021 2021 5582920 10.1155/2021/5582920 34122546 PMC8169244 Yan K, Wang Y, Shao Y, Xiao T. Gene instability-related lncRNA prognostic model of melanoma patients via machine learning strategy. J Oncol. 2021;2021:5582920. 34122546 10.1155/2021/5582920 PMC8169244 13. Wang L Shen J Wang Y Bi J Identification of fatty acid metabolism-based molecular subtypes and prognostic signature to predict immune landscape and guide clinical drug treatment in renal clear cell carcinoma Int Immunopharmacol 2023 116 109735 10.1016/j.intimp.2023.109735 36716517 Wang L, Shen J, Wang Y, Bi J. Identification of fatty acid metabolism-based molecular subtypes and prognostic signature to predict immune landscape and guide clinical drug treatment in renal clear cell carcinoma. Int Immunopharmacol. 2023;116:109735. 36716517 10.1016/j.intimp.2023.109735 14. Chen C Méndez E Houck J Gene expression profiling identifies genes predictive of oral squamous cell carcinoma Cancer Epidemiol Biomarkers Prev 2008 17 8 2152 62 10.1158/1055-9965.EPI-07-2893 18669583 PMC2575803 Chen C, Méndez E, Houck J, et al. Gene expression profiling identifies genes predictive of oral squamous cell carcinoma. Cancer Epidemiol Biomarkers Prev. 2008;17(8):2152–62. 18669583 10.1158/1055-9965.EPI-07-2893 PMC2575803 15. Chen B Khodadoust MS Liu CL Newman AM Alizadeh AA Profiling tumor infiltrating immune cells with CIBERSORT Methods Mol Biol 2018 1711 243 59 10.1007/978-1-4939-7493-1_12 29344893 PMC5895181 Chen B, Khodadoust MS, Liu CL, Newman AM, Alizadeh AA. Profiling tumor infiltrating immune cells with CIBERSORT. Methods Mol Biol. 2018;1711:243–59. 29344893 10.1007/978-1-4939-7493-1_12 PMC5895181 16. Jiang J Sun X Wu W Construction and application of a co-expression network in Mycobacterium tuberculosis Sci Rep 2016 6 28422 10.1038/srep28422 27328747 PMC4916473 Jiang J, Sun X, Wu W, et al. Construction and application of a co-expression network in Mycobacterium tuberculosis 27328747 10.1038/srep28422 PMC4916473 17. Jianfeng W Yutao W Jianbin B Indolethylamine-N-methyltransferase inhibits proliferation and promotes apoptosis of human prostate cancer cells: a mechanistic exploration Front Cell Dev Biol 2022 10 805402 10.3389/fcell.2022.805402 35252179 PMC8891133 Jianfeng W, Yutao W, Jianbin B. Indolethylamine-N-methyltransferase inhibits proliferation and promotes apoptosis of human prostate cancer cells: a mechanistic exploration. Front Cell Dev Biol. 2022;10:805402. 35252179 10.3389/fcell.2022.805402 PMC8891133 18. Jianfeng W Yutao W Jianbin B TACR2 is associated with the immune microenvironment and inhibits migration and proliferation via the Wnt/β-catenin signaling pathway in prostate cancer Cancer Cell Int 2021 21 1 415 10.1186/s12935-021-02126-0 34364377 PMC8349497 Jianfeng W, Yutao W, Jianbin B. TACR2 is associated with the immune microenvironment and inhibits migration and proliferation via the Wnt/β-catenin signaling pathway in prostate cancer. Cancer Cell Int. 2021;21(1):415. 34364377 10.1186/s12935-021-02126-0 PMC8349497 19. Hu J Szymczak S A review on longitudinal data analysis with random forest Brief Bioinform 2023 24 2 bbad002 10.1093/bib/bbad002 36653905 PMC10025446 Hu J, Szymczak S. A review on longitudinal data analysis with random forest. Brief Bioinform. 2023;24(2):bbad002. 36653905 10.1093/bib/bbad002 PMC10025446 20. Wang R Zhang J Shan B He M Xu J XGBoost machine learning algorithm for prediction of outcome in aneurysmal subarachnoid hemorrhage Neuropsychiatr Dis Treat 2022 18 659 67 10.2147/NDT.S349956 35378822 PMC8976557 Wang R, Zhang J, Shan B, He M, Xu J. XGBoost machine learning algorithm for prediction of outcome in aneurysmal subarachnoid hemorrhage. Neuropsychiatr Dis Treat. 2022;18:659–67. 35378822 10.2147/NDT.S349956 PMC8976557 21. Kanehisa M Sato Y Kegg mapper for inferring cellular functions from protein sequences Protein Sci 2020 29 1 28 35 10.1002/pro.3711 31423653 PMC6933857 Kanehisa M, Sato Y. Kegg mapper for inferring cellular functions from protein sequences. Protein Sci. 2020;29(1):28–35. 31423653 10.1002/pro.3711 PMC6933857 22. Huang S Qi D Liang J The putative tumor suppressor Zc3h12d modulates toll-like receptor signaling in macrophages Cell Signal 2012 24 2 569 76 10.1016/j.cellsig.2011.10.011 22036805 PMC3237786 Huang S, Qi D, Liang J, et al. The putative tumor suppressor Zc3h12d modulates toll-like receptor signaling in macrophages. Cell Signal. 2012;24(2):569–76. 22036805 10.1016/j.cellsig.2011.10.011 PMC3237786 23. Zhang H Wang WC Chen JK Zc3h12d attenuated inflammation responses by reducing mrna stability of proinflammatory genes Mol Immunol 2015 67 2 Pt B 206 12 10.1016/j.molimm.2015.05.018 26059755 Zhang H, Wang WC, Chen JK, et al. Zc3h12d attenuated inflammation responses by reducing mrna stability of proinflammatory genes. Mol Immunol. 2015;67(2 Pt B):206–12. 26059755 10.1016/j.molimm.2015.05.018 ",
  "metadata": {
    "Title of this paper": "Zc3h12d attenuated inflammation responses by reducing mrna stability of proinflammatory genes",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474792/"
  }
}