{
  "title": "Paper_861",
  "abstract": "pmc Pathogens Pathogens 2622 pathogens pathogens Pathogens 2076-0817 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472225 PMC12472225.1 12472225 12472225 41011810 10.3390/pathogens14090910 pathogens-14-00910 1 Article Establishment of a Pseudovirus-Based Golden Hamster Model for the Attachment and Entry Stages of Hendra Virus Infection and Evaluation of Protective Immunity https://orcid.org/0009-0005-0604-4041 Li Tao Validation Data curation Writing – original draft 1 2 3 † Liao Binfan Validation 4 † Li Danfeng Conceptualization Data curation 5 † Zhang Jie Validation 1 2 3 † Zhao Chunhui Validation 1 2 3 Pei Yunfei Investigation 2 3 6 Chen Liping Validation 1 2 3 Wang Meng Supervision 1 2 3 Liu Yawen Validation 1 2 3 Wu Xi Project administration 1 2 3 https://orcid.org/0000-0002-4246-8889 Huang Weijin Conceptualization Writing – review & editing Funding acquisition 1 2 3 * https://orcid.org/0000-0002-1474-0427 Nie Jianhui Conceptualization Methodology Supervision 1 2 3 * ‡ Pratelli Annamaria Academic Editor 1 litao@nifdc.org.cn zhangjie2024@nifdc.org.cn zhaochunhui@nifdc.org.cn 18738625256@163.com wangmeng@nifdc.org.cn yawenliu13@163.com wuxi@nifdc.org.cn 2 3 4 lbf1761023269@163.com 5 lidanfeng0771@126.com 6 * huangweijin@nifdc.org.cn niejianhui@nifdc.org.cn † These authors contributed equally to this work. ‡ Lead contact. 10 9 2025 9 2025 14 9 497659 910 12 8 2025 05 9 2025 08 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Objective: Establish an in vivo evaluation model focused on the attachment and entry stages of Hendra virus infection for protective immunity assessment. Methods: A golden hamster infection model based on recombinant Hendra-F/G pseudovirus was developed, and a luciferase luminescence assay was used to assess the optimal pseudoviral challenge in terms of route of infection, dose and detection time. The biodistribution of the pseudovirus in infected organs was evaluated using the IVIS spectral CT system. The protective effect of antibody prophylaxis was evaluated by measuring the luminescence intensity of pseudoviruses. Results: Intraperitoneal injection was identified as the optimal route of infection, and the optimal time of detection was 6 h post-challenge. Our model simulates the infection of the brain and lungs by live viruses, with the strongest infection occurring in the abdomen, especially in the intestinal organs. The dose of pseudovirus was linearly correlated with luminescence intensity. The infection model was able to differentiate the protective effect of monoclonal antibodies, with complete protection in the high-dose group. Conclusions: The recombinant Hendra-F/G pseudovirus hamster model allows the effective evaluation of prophylactic monoclonal antibodies, providing a crucial tool for studying Hendra virus infection and control strategies. Hendra virus pseudovirus infection model bioluminescence imaging Major Project of Guangzhou National Laboratory GZNL2024A01019 CAMS Innovation Fund for Medical Sciences 2022-I2M-3-001 This research was funded by the Major Project of Guangzhou National Laboratory (grant number GZNL2024A01019) and the CAMS Innovation Fund for Medical Sciences (CIFMS, grant number 2022-I2M-3-001). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hendra virus (HeV), a zoonotic pathogen that emerged in the 1990s, causes severe cerebrovascular inflammation and respiratory disease with a more than 50% case fatality rate in humans [ 1 2 3 3 4 3 5 6 7 8 9 10 11 12 3 8 13 14 2 In order to better study the pathogenic mechanisms as well as the prevention and control of HeV, it is crucial to establish safe and effective animal infection models. The Syrian golden hamster is a frequently utilized experimental animal model [ 15 16 17 18 2. Materials and Methods 2.1. Cells and Plasmids HEK293T cells (American type culture collection [atcc], crl-3216) were used for pseudovirus expression and titration in conjunction with expression plasmid pcdna3.1(+) [ 19 2 JN255818.1 2.2. Preparation and Titration of Pseudoviruses HeV pseudoviruses were generated and titrated as previously described [ 20 JN255818.1 2 50 2 TM 50 21 2.3. Animal Experiments Four-week-old female Syrian golden hamsters were purchased from Beijing Viton Lihua Laboratory Animal Technology Co., Ltd. (Animal License No.: SYXK 2022-0052), and kept in the Animal Laboratory of the National Institutes for Food and Drug Control (NIFDC) after purchase. The experimental animals were randomly assigned to undergo pseudovirus challenge assays to determine the optimal infection route, detection time, and challenge dose, or to evaluate the protective effect of antibodies. Groups based on challenge routes include intracerebral (IC) injection, intraperitoneal (IP) injection, intrathoracic (IT) injection, and intranasal (IN) administration. The negative control (NC) group was not subjected to challenge. Experiments to determine the optimal detection time were conducted using four golden hamsters, two injected intraperitoneally with D-luciferin substrate (xenogen-caliper life sciences, Hopkinton, MA, USA) for luminescence imaging immediately after the injection of pseudovirus (0 h). To avoid mixing of the pseudovirus with the luminescent substrate in the intraperitoneal cavity during the 0 h assay to affect the subsequent infection with the pseudovirus, the luminescence assay at 2–96 h was conducted using 2 additional golden hamsters. The pseudovirus challenge dose for the experiments for determining the optimal challenge route and detection time was 1.0 × 10 6 50 For the animal protection assay, monoclonal antibodies (mAbs) m102.3, 5B3, and 3C9 were serially diluted in phosphate-buffered saline (PBS) in a 3-fold gradient, one day prior to the challenge. The mAbs were then administered via the intramuscular route with doses of 9 mg/kg, 3 mg/kg, 1 mg/kg, 0.33 mg/kg, and 0 mg/kg according to the weight of the animals. Each dose group contained three golden hamsters. Pseudovirus challenge was performed via the IP route at a dose of 6.41 × 10 5 50 2.4. In Vivo Bioluminescence Imaging Bioluminescence was imaged on an IVIS Spectrum CT system (perkinelmer, Waltham, MA, USA). Golden hamsters received an intraperitoneal injection of D-luciferin (150 μg/g), and 5 min later were anesthetized with 2.5% isoflurane (lunan pharmaceutical, Linyi, Shandong, China) prior to imaging. The bioluminescence signal of each hamster was detected with a 1 min acquisition time, and the imaging area was used to calculate the luminescence intensity in terms of total flux (p/s/cm 2 4 4 2 2.5. In Vitro Pseudovirus Neutralization Assay As described in the Nipah virus pseudovirus neutralization assay [ 21 22 50 4 2 50 21 2.6. Statistical Analysis GraphPad Prism 8.0 software (GraphPad Software Inc., San Diego, CA, USA) was used for analyzing data and graphing. Unless otherwise stated, results were expressed as the mean ± standard deviation (SD). The Reed-Muench method was employed to calculate the median effective dose, and a correlation analysis was conducted using linear regression. Differences between samples and the control group were analyzed using single-factor analysis of variance (one-way ANOVA), and differences with p 3. Results 3.1. Assessment of Different Challenge Modes for rHeV-F/G Pseudoviruses To identify effective routes for assessing rHeV-F/G pseudovirus infection, we selected IC, IT, IP, and IN infection, which are frequently used in animal models. As shown in Figure 1 Figure 1 p Figure 1 3.2. Assessment of the Optimal Detection Time for the rHeV-F/G Pseudovirus Infection Model After identifying intraperitoneal injection as the optimal challenge route for rHeV-F/G pseudovirus in golden hamsters, the optimal luminescence detection time following pseudovirus challenge was further assessed. The fixed challenge dose of 1.0 × 10 6 50 Figure 2 8 2 Figure 2 3.3. Biodistribution Characterization of rHeV-F/G Pseudovirus-Infected Golden Hamsters As indicated in this study, the optimal challenge route was determined to be intraperitoneal injection of 1.0 × 10 6 50 Figure 3 Figure 3 Figure 3 3.4. Dose Optimization for rHeV-F/G Pseudovirus Infection The objective of this analysis was to ascertain the optimal dosage of rHeV-F/G pseudovirus for in vivo infection in golden hamsters. To this end, a series of five gradients was established, starting at 1.0 × 10 6 50 Figure 4 2 p 50 4 50 6 5 50 Figure 4 50 3.5. Evaluation of Protection Using the rHeV-F/G Pseudovirus Golden Hamster Infection Model The objective of this experiment is to utilize the rHeV-F/G pseudovirus golden hamster infection model to evaluate the potential in vivo protective efficacy of the anti-NiV-G mAb m102.3 [ 23 1 20 Figure 5 Figure 5 Figure 5 50 Figure 5 50 Figure 5 In addition to evaluating the in vivo protective efficacy of the anti-HeV-G mAb m102.3, we also evaluated the anti-HeV-F mAbs 5B3 and 3C9. As shown in Figure 5 Figure 5 50 Figure 5 Figure 5 Figure 5 20 4. Discussion This study successfully established a golden hamster model with rHeV-F/G pseudovirus for evaluating HeV attachment- and entry-targeting prophylactics in vivo. The optimum of infection route, detection time, and challenge doses in vivo bioluminescence in golden hamsters were evaluated using the rHeV-F/G pseudovirus packaged using the VSV backbone system containing the Fluc reporter gene. In this study, rHeV-F/G pseudoviruses produced luminescence in the thoracic and cephalic of golden hamsters by IC route. However, the challenges of the IP route produced the most pronounced infection, achieving consistent positive infection within the group. The present study found that the IP route is the optimal infection pathway in the rHeV-F/G pseudovirus model, consistent with the live HeV infection route in a hamster model [ 15 16 24 25 26 20 27 28 Furthermore, evaluation of the protective capacity of antibodies using the rHeV-F/G pseudovirus golden hamster infection model was substantiated by employing the mAbs m102.3 and 5B3, which have been evaluated for their neutralizing capacity against the live virus at the cellular level [ 1 23 20 50 29 30 15 In addition to evaluating the prophylactic effect of antibodies using the rHeV-F/G pseudovirus animal infection model in the present study, the application of pseudoviruses allows for the visual and quantitative evaluation of vaccine protective efficacy in animal models. This has already been applied in vaccine studies for human papillomavirus, SARS-CoV-2 virus, and EV 71 enterovirus [ 31 32 17 33 5. Conclusions In summary, this study provides a safer, more convenient and intuitively quantifiable alternative method by establishing a rHeV-F/G pseudovirus golden hamster infection model, which provides an important experimental basis for the in-depth study of the evaluation of drug effectiveness. Acknowledgments Biology icons were provided by the Iconfinder and Bioicons Scientific Illustration Library. The hamster icon by DBCLS https://togotv.dbcls.jp/en/pics.html https://creativecommons.org/licenses/by/4.0/ Disclaimer/Publisher’s Note: Author Contributions Investigation, T.L., B.L., J.Z., C.Z., L.C. and Y.L.; methodology, T.L., D.L., J.Z. and X.W.; visualization, and writing—original draft, T.L.; data curation and formal analysis, B.L.; conceptualization, D.L., Y.P., M.W., W.H. and J.N.; validation, D.L. and J.Z.; supervision, W.H.; funding acquisition and writing—review & editing, W.H. and J.N.; resources and project administration, J.N. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Institutional Animal Care and Use Committee of the National Institutes for Food and Drug Control (NIFDC) on 16 January 2025 (Approval No.: NIFDC- Animal Welfare & Ethics-2025(B)-002). Data Availability Statement Data supporting the findings of this study are available from the corresponding authors upon reasonable request. Conflicts of Interest The authors declare no competing interests. References 1. Dang H.V. Chan Y.P. Park Y.J. Snijder J. Da Silva S.C. Vu B. Yan L. Feng Y.R. Rockx B. Geisbert T.W. An antibody against the F glycoprotein inhibits Nipah and Hendra virus infections Nat. Struct. Mol. Biol. 2019 26 980 987 10.1038/s41594-019-0308-9 31570878 PMC6858553 2. Pigeaud D.D. Geisbert T.W. Woolsey C. Animal Models for Henipavirus Research Viruses 2023 15 1980 10.3390/v15101980 37896758 PMC10610982 3. Murray K. Selleck P. Hooper P. Hyatt A. Gould A. Gleeson L. Westbury H. Hiley L. Selvey L. Rodwell B. A morbillivirus that caused fatal disease in horses and humans Science 1995 268 94 97 10.1126/science.7701348 7701348 4. Selvey L.A. Wells R.M. McCormack J.G. Ansford A.J. Murray K. Rogers R.J. Lavercombe P.S. Selleck P. Sheridan J.W. Infection of humans and horses by a newly described morbillivirus Med. J. Aust. 1995 162 642 645 7603375 10.5694/j.1326-5377.1995.tb126050.x 5. Murray K. Rogers R. Selvey L. Selleck P. Hyatt A. Gould A. Gleeson L. Hooper P. Westbury H. A novel morbillivirus pneumonia of horses and its transmission to humans Emerg. Infect. Dis. 1995 1 31 33 10.3201/eid0101.950107 8903153 PMC2626820 6. Playford E.G. McCall B. Smith G. Slinko V. Allen G. Smith I. Moore F. Taylor C. Kung Y.H. Field H. Human Hendra virus encephalitis associated with equine outbreak, Australia, 2008 Emerg. Infect. Dis. 2010 16 219 223 10.3201/eid1602.090552 20113550 PMC2957996 7. Field H. Schaaf K. Kung N. Simon C. Waltisbuhl D. Hobert H. Moore F. Middleton D. Crook A. Smith G. Hendra virus outbreak with novel clinical features, Australia Emerg. Infect. Dis. 2010 16 338 340 10.3201/eid1602.090780 20113576 PMC2958006 8. Taylor J. Thompson K. Annand E.J. Massey P.D. Bennett J. Eden J.-S. Horsburgh B.A. Hodgson E. Wood K. Kerr J. Novel variant Hendra virus genotype 2 infection in a horse in the greater Newcastle region, New South Wales, Australia One Health 2022 15 100423 10.1016/j.onehlt.2022.100423 36277112 PMC9582560 9. Sharma N. Jamwal V.L. Nagial S. Ranjan M. Rath D. Gandhi S.G. Current status of diagnostic assays for emerging zoonotic viruses: Nipah and Hendra Expert Rev. Mol. Diagn. 2024 24 473 485 10.1080/14737159.2024.2368591 38924448 10. Wu Z. Yang L. Yang F. Ren X. Jiang J. Dong J. Sun L. Zhu Y. Zhou H. Jin Q. Novel Henipa-like virus, Mojiang Paramyxovirus, in rats, China, 2012 Emerg. Infect. Dis. 2014 20 1064 1066 10.3201/eid2006.131022 24865545 PMC4036791 11. Zhang X.-A. Li H. Jiang F.-C. Zhu F. Zhang Y.-F. Chen J.-J. Tan C.-W. Anderson D.E. Fan H. Dong L.-Y. A Zoonotic Henipavirus in Febrile Patients in China N. Engl. J. Med. 2022 387 470 472 10.1056/NEJMc2202705 35921459 12. Li Y. Wang J. Hickey A.C. Zhang Y. Li Y. Wu Y. Zhang H. Yuan J. Han Z. McEachern J. Antibodies to Nipah or Nipah-like viruses in bats, China Emerg. Infect. Dis. 2008 14 1974 1976 10.3201/eid1412.080359 19046545 PMC2634619 13. Wang J. Anderson D.E. Halpin K. Hong X. Chen H. Walker S. Valdeter S. van der Heide B. Neave M.J. Bingham J. A new Hendra virus genotype found in Australian flying foxes Virol. J. 2021 18 197 10.1186/s12985-021-01652-7 34641882 PMC8510678 14. Li Y. Li R. Wang M. Liu Y. Yin Y. Zai X. Song X. Chen Y. Xu J. Chen W. Fc-Based Recombinant Henipavirus Vaccines Elicit Broad Neutralizing Antibody Responses in Mice Viruses 2020 12 480 10.3390/v12040480 32340278 PMC7232446 15. Guillaume V. Wong K.T. Looi R.Y. Georges-Courbot M.C. Barrot L. Buckland R. Wild T.F. Horvat B. Acute Hendra virus infection: Analysis of the pathogenesis and passive antibody protection in the hamster model Virology 2009 387 459 465 10.1016/j.virol.2009.03.001 19328514 16. Wong K.T. Grosjean I. Brisson C. Blanquier B. Fevre-Montange M. Bernard A. Loth P. Georges-Courbot M.-C. Chevallier M. Akaoka H. A Golden Hamster Model for Human Acute Nipah Virus Infection Am. J. Pathol. 2003 163 2127 2137 10.1016/S0002-9440(10)63569-9 14578210 PMC1892425 17. Guillaume V. Contamin H. Loth P. Grosjean I. Courbot M.C. Deubel V. Buckland R. Wild T.F. Antibody prophylaxis and therapy against Nipah virus infection in hamsters J. Virol. 2006 80 1972 1978 10.1128/JVI.80.4.1972-1978.2006 16439553 PMC1367164 18. Sia S.F. Yan L.-M. Chin A.W.H. Fung K. Choy K.-T. Wong A.Y.L. Kaewpreedee P. Perera R.A.P.M. Poon L.L.M. Nicholls J.M. Pathogenesis and transmission of SARS-CoV-2 in golden hamsters Nature 2020 583 834 838 10.1038/s41586-020-2342-5 32408338 PMC7394720 19. Li T. Cui Z. Jia Y. Liang Z. Nie J. Zhang L. Wang M. Li Q. Wu J. Xu N. Aggregation of high-frequency RBD mutations of SARS-CoV-2 with three VOCs did not cause significant antigenic drift J. Med. Virol. 2022 94 2108 2125 10.1002/jmv.27596 35032057 PMC9015629 20. Li T. Xu H. Zhang M. Nie J. Liao B. Xie J. Jiang Y. Liu Y. Ge P. Zhao C. A monoclonal antibody targeting conserved regions of pre-fusion protein cross-neutralizes Nipah and Hendra virus variants Antivir. Res. 2025 240 106215 10.1016/j.antiviral.2025.106215 40541691 21. Nie J. Liu L. Wang Q. Chen R. Ning T. Liu Q. Huang W. Wang Y. Nipah pseudovirus system enables evaluation of vaccines in vitro and in vivo using non-BSL-4 facilities Emerg. Microbes Infect. 2019 8 272 281 10.1080/22221751.2019.1571871 30866781 PMC6455126 22. Gao Z. Li T. Han J. Feng S. Li L. Jiang Y. Xu Z. Hao P. Chen J. Hao J. Assessment of the immunogenicity and protection of a Nipah virus soluble G vaccine candidate in mice and pigs Front. Microbiol. 2022 13 1031523 10.3389/fmicb.2022.1031523 36274696 PMC9583134 23. Xu K. Rockx B. Xie Y. DeBuysscher B.L. Fusco D.L. Zhu Z. Chan Y.P. Xu Y. Luu T. Cer R.Z. Crystal structure of the Hendra virus attachment G glycoprotein bound to a potent cross-reactive neutralizing human monoclonal antibody PLoS Pathog. 2013 9 e1003684 10.1371/journal.ppat.1003684 24130486 PMC3795035 24. Findlay-Wilson S. Flett L. Salguero F.J. Ruedas-Torres I. Fotheringham S. Easterbrook L. Graham V. Dowall S. Establishment of a Nipah Virus Disease Model in Hamsters, including a Comparison of Intranasal and Intraperitoneal Routes of Challenge Pathogens 2023 12 976 10.3390/pathogens12080976 37623936 PMC10458503 25. Singh R.K. Dhama K. Chakraborty S. Tiwari R. Natesan S. Khandia R. Munjal A. Vora K.S. Latheef S.K. Karthik K. Nipah virus: Epidemiology, pathology, immunobiology and advances in diagnosis, vaccine designing and control strategies—A comprehensive review Vet. Q. 2019 39 26 55 10.1080/01652176.2019.1580827 31006350 PMC6830995 26. Ang L.T. Nguyen A.T. Liu K.J. Chen A. Xiong X. Curtis M. Martin R.M. Raftry B.C. Ng C.Y. Vogel U. Generating human artery and vein cells from pluripotent stem cells highlights the arterial tropism of Nipah and Hendra viruses Cell 2022 185 2523 2541.E30 10.1016/j.cell.2022.05.024 35738284 PMC9617591 27. Hafner C. Meyer S. Langmann T. Schmitz G. Bataille F. Hagen I. Becker B. Roesch A. Rogler G. Landthaler M. Ephrin-B2 is differentially expressed in the intestinal epithelium in Crohn’s disease and contributes to accelerated epithelial wound healing in vitro World J. Gastroenterol. 2005 11 4024 4031 10.3748/wjg.v11.i26.4024 15996027 PMC4502098 28. Genander M. Eph and ephrins in epithelial stem cell niches and cancer Cell Adhes. Migr. 2012 6 126 130 10.4161/cam.18932 PMC3499311 22568955 29. Mire C.E. Chan Y.-P. Borisevich V. Cross R.W. Yan L. Agans K.N. Dang H.V. Veesler D. Fenton K.A. Geisbert T.W. A Cross-Reactive Humanized Monoclonal Antibody Targeting Fusion Glycoprotein Function Protects Ferrets Against Lethal Nipah Virus and Hendra Virus Infection J. Infect. Dis. 2020 221 S471 S479 10.1093/infdis/jiz515 31686101 PMC7199785 30. Bossart K.N. Zhu Z. Middleton D. Klippel J. Crameri G. Bingham J. McEachern J.A. Green D. Hancock T.J. Chan Y.P. A neutralizing human monoclonal antibody protects against lethal disease in a new ferret model of acute nipah virus infection PLoS Pathog. 2009 5 e1000642 10.1371/journal.ppat.1000642 19888339 PMC2765826 31. Guillaume V. Contamin H. Loth P. Georges-Courbot M.C. Lefeuvre A. Marianneau P. Chua K.B. Lam S.K. Buckland R. Deubel V. Nipah virus: Vaccination and passive protection studies in a hamster model J. Virol. 2004 78 834 840 10.1128/JVI.78.2.834-840.2004 14694115 PMC368848 32. Wang Y. Zhou Z. Wu X. Li T. Wu J. Cai M. Nie J. Wang W. Cui Z. Pseudotyped Viruses Adv. Exp. Med. Biol. 2023 1407 1 27 10.1007/978-981-99-0113-5_1 36920689 33. Cao Z. Jin H. Wong G. Zhang Y. Jiao C. Feng N. Wu F. Xu S. Chi H. Zhao Y. The Application of a Safe Neutralization Assay for Ebola Virus Using Lentivirus-Based Pseudotyped Virus Virol. Sin. 2021 36 1648 1651 10.1007/s12250-021-00405-8 34152565 PMC8692649 Figure 1 Bioluminescence in golden hamsters following rHeV-F/G pseudovirus infection via IC, IT, IP, and IN routes. ( A n 4 4 2 B p p Figure 2 Bioluminescence intensity over time after rHeV-F/G pseudovirus challenge. ( A n 4 4 2 B Figure 3 In vivo biodistribution analysis after rHeV-F/G pseudovirus challenge. ( A 5 5 B 5 6 2 C 5 6 2 Figure 4 Correlation of bioluminescence intensity with the rHeV-F/G pseudovirus challenge dose. ( A 6 50 n 4 4 2 B 50 2 p Figure 5 Evaluation of mAb protection using the rHeV-F/G pseudovirus golden hamster infection model. ( A B F J 4 4 2 C G K D H L p p p E I M 2 p ",
  "metadata": {
    "Title of this paper": "The Application of a Safe Neutralization Assay for Ebola Virus Using Lentivirus-Based Pseudotyped Virus",
    "Journal it was published in:": "Pathogens",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472225/"
  }
}