{
  "title": "Paper_333",
  "abstract": "pmc Front Surg Front Surg 2654 frontsurg Front. Surg. Frontiers in Surgery 2296-875X Frontiers Media SA PMC12484049 PMC12484049.1 12484049 12484049 41040673 10.3389/fsurg.2025.1650974 1 Surgery Original Research Nursing strategies after pancreaticoduodenectomy: continuity of care combined with immunomodulatory nutrition Feng Xiaodong  1  † Li Wei  1  † Tang Yufu  1  † Han Lei  1  † Bi Ting  1  † Zhang Wei  1  † Miao Yuqing  2 * 1 Department of Hepatobiliary Pancreatic Spleen Thyroid Surgery, General Hospital of Northern Theater Command Shenyang, Liaoning China 2 Department of Plastic Surgery, General Hospital of Northern Theater Command Shenyang, Liaoning China Edited by: Gabriel Sandblom Reviewed by: Jacqueline Omino Pravenkumar RR * Correspondence: maoyuqing_edu@outlook.com  † These authors have contributed equally to this work 17 9 2025 2025 12 480749 1650974 20 6 2025 22 8 2025 17 09 2025 02 10 2025 03 10 2025 © 2025 Feng, Li, Tang, Han, Bi, Zhang and Miao. 2025 Feng, Li, Tang, Han, Bi, Zhang and Miao https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background Pancreaticoduodenectomy (PD) is a highly invasive procedure with a long operation time, resulting in a high incidence of postoperative complications. The quality of patient care remains a key factor in improving prognosis. This study aimed to evaluate the impact of continuity of care combined with immunomodulatory nutrition on the postoperative recovery and quality of life of patients undergoing PD surgery. Methods This was a randomized controlled study involving 120 patients who underwent PD surgery at our hospital between February 2022 and February 2024. The patients were randomly divided into the conventional care group (CG) and the intervention group (IG), with the latter receiving continuity of care combined with arginine-rich immunonutritional support. The main observation indicators included survival analysis, recovery of gastrointestinal function, length of hospital stay, nutritional status, immune function, postoperative complications, negative emotions and quality of life. Results There was no significant difference in the overall survival rate between the two groups. Compared with the CG, the IG had shorter length of hospital stay, better recovery of gastrointestinal function, better improvements of nutritional indicators such as ALB and PAB, lower levels of pro-inflammatory factors TNF-α, IL-6 and CRP, better improvement of CD4 + + Conclusion Continuity of care combined with immunomodulatory nutrition provides a strong rationale for postoperative care of PD, and is worthy of clinical promotion and practice. More clinical cases and long-term follow-ups are needed to further verify its effectiveness. pancreaticoduodenectomy continuity of care immunomodulatory nutrition postoperative recovery quality of life The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Visceral Surgery Introduction Pancreaticoduodenectomy (PD) is currently the preferred surgical approach for treating pancreatic and pancreatic head cancers. Its technical maturity and clinical application value have been widely recognized. However, this surgery involves multiple organ resection and complex digestive tract reconstruction, and thus still has inherent characteristics such as significant surgical trauma and long operation time. It remains a highly challenging and complex surgical procedure in the field of surgery ( 1 2 3 The current research mainly focuses on two aspects: one is the innovation of surgical techniques, such as robotic-assisted resection which reduces tissue damage through precise operation, and the improved PD which lowers the risk of pancreatic fistula by optimizing the anastomosis method ( 4 5 6 The continuity of care model, as a new type of nursing model, extends professional nursing services from hospitals to homes and communities, thereby establishing a continuous and coordinated health management system ( 7 8 9 10 11 ω 12 Based on this, this study intended to establish a comprehensive intervention model combining continuity of care and immunonutrition, with the main focus on exploring its impact on the postoperative recovery quality, complication occurrence rate, and long-term survival status of PD patients. The aim was to provide new theoretical basis and practical solutions for optimizing the perioperative management of major abdominal surgeries. Materials and methods Study design This was a randomized controlled study aimed at investigating the postoperative care strategies for patients undergoing PD, evaluating the postoperative recovery and quality of life of patients who received nutritional support rich in arginine combined with continuity of care, and providing pilot research and data support for the referral strategies of postoperative care for PD. Participants One hundred and twenty patients who underwent PD in our hospital from February 2022 to February 2024 were selected as study subjects. Inclusion criteria: (1) Met the relevant indications for PD; (2) Had no previous history of upper abdominal surgery; (3) Received postoperative continuity of care. Exclusion criteria: (1) The lesion had already metastasized to distant sites and could not be cured by surgical resection; (2) Had severe organic diseases; (3) Had mental disorders or cognitive impairments; (4) Those with other types of malignant tumors combined. The study was approved by the Ethics Committee of the hospital, and all subjects signed the informed consent form before enrollment. Randomization and blinding A group randomization design was adopted for random grouping. The random allocation sequence was generated by a computer. The allocation confidentiality measures were achieved through sequential numbering, sealing, and opaque envelopes. After being deemed to meet the inclusion criteria, patients were randomly assigned to the control group (CG) or the intervention group (IG), as shown in Figure 1 Figure 1 CONSORT flowchart. Flowchart depicting the participant allocation in a study. Out of 120 randomized, 18 were excluded. The control group received intervention (n=49), with follow-up and analysis performed on all 49. The intervention group also received intervention (n=53), with follow-up and analysis on all 53. Sample size calculation Power analysis was carried out in this study using G*Power 3.1.9.7 software to determine the sample size required to detect statistical differences. With an alpha level of 0.05% and 90% power analysis, the research revealed that a sample size of 48 patients per group was required. Intervention The CG was given routine care, including close monitoring of the patients’ baseline vital signs after the operation, providing nutritional feeding 4 hours after the operation to supply nutrients (the same as IG, Table 1 Table 1 Nutritional formulations. Formulas IG CG Feeding methods Energy 1,250 kcal 1,250 kcal The feeding rate was 25 ml/hour after 4 h postoperatively; from 24 h-48 h postoperatively, the feeding mode was changed from jejunostomy feeding to transoral feeding by infusion pump, and the feeding rate was 50 ml/hour; from 48 h-10 d postoperatively, the feeding rate was 75 ml/hour per day, with a 4 h rest period every day. Total protein 75 g 75 g Total fat 42 g 42 g Triglyceride 45 g 45 g ω 3.5:1 5:1 Carbohydrate 140 g 130 g K+ 55 mmol 45 mmol Na+ 50 mmol 35 mmol Osmolalilty (mOsm/kg) 380 270 Arginine 9.0 g 3.0 g Glutamine 13 g 7.5 g Cysteine 0.7 g 0.2 g The IG was given continuity of care combined with immunomodulatory nutritional support. The specific methods were as follows: 1. Establishment and training of the nursing team: The head nurse served as the team leader, responsible for organizing the training of team members and supervising the quality of nursing services. This department consisted of 10 experienced nurses with over 3 years of on-the-job experience, who formed the team and were responsible for the implementation of specific nursing operations. The head nurse of the hospital organized the training of team members, including professional knowledge and nursing technology guidance after PD, formulating unified nursing standards, and passing the pre-service examination before officially carrying out nursing work. 2. Implementing continuity of care: a. Immunomodulatory nutrition: The patient began enteral feeding through the jejunum 4 hours after the surgery. The feeding formula and feeding rate were as described previously, as seen in Table 1 Primary outcomes 1. Survival analysis. The overall survival within six months of care was recorded. 2. Gastrointestinal function recovery. The time of first anal defecation, time of first meal, time of bowel sound recovery, and time of first bowel movement were counted in the two groups respectively. 3. Hospitalisation time. Ventilator use time, ICU hospitalisation time, time of getting out of bed and hospitalisation time of the two groups were counted respectively. 4. Nutritional status. Fasting venous blood was collected before, 3 d, 7 d and 14 d after the nursing care, and the levels of ALB, PAB, TP and TF were measured by automatic biochemical analyser (AU480, Beckman, USA). 5. Immune function indicators. Fasting venous blood was collected before, 3 d, 7 d and 14 d after the nursing care, and the levels of TNF-α, IL-6 and CRP were measured by automatic biochemical analyser, and the levels of CD4 + and CD8 + were detected by flow cytometer (EPIC, Beckman, USA), and CD4+/CD8 + were calculated. 6. Postoperative complications. The incidence of pancreatic fistula, anastomotic bleeding, gastroparesis, incision infection, and lower limb venous thrombosis in the six months after the patients were discharged from the hospital was counted. Secondary outcomes 1. Negative emotions. The SAS and SDS scales were completed before, after, and six months after the patients were discharged from the hospital. The SAS scale assessed the patients’ anxiety level, and the SDS assessed the patients’ depression level. The higher the score, the more severe the degree of anxiety and depression. 2. Quality of life. A comprehensive quality of life assessment questionnaire (GQOLI-74) was used to comprehensively assess the quality of life of the two groups after surgery, the scale contains four dimensions such as somatic function, psychological function, social function, and material life status. The scores of the first three dimensions were 20–100 points, and the score of the fourth dimension was 16–80 points, and the higher the score indicated that the patient's quality of life after surgery was better. Statistical analysis In order to test whether there was any difference in the variables between the groups, quantitative analyses were carried out using the χ t U n p Results A total of 120 patients who underwent PD were collected in this study, of which CG was shed in another 11 cases and IG was shed in 7 cases. The mean age of the patients was (60.11 ± 9.6) years, the maximum age was 79 years and the minimum age was 28 years, and the most common type of pathology was pancreatic cancer. There was no statistical difference between the baseline data of the two groups ( P Table 2 Table 2 Baseline characteristics of patients (mean ± standard deviation) or n Parameter CG IG  X 2  P Number 49 53 – – Age (years) 59.71 ± 8.98 60.65 ± 9.77 0.549 0.584 Place of residence, n Town 42 (70.00) 37 (61.67) 0.926 0.336 Village 18 (30.00) 23 (38.33) Gender, n Female 21 (35.00) 25 (41.67) 0.564 0.453 Male 39 (65.00) 35 (58.33) BMI (kg/m 2 22.07 ± 2.71 22.15 ± 2.59 0.163 0.869 Medical history, n Hypertensive 36 (60.00) 34 (56.67) 0.187 0.980 Diabetes 21 (35.00) 22 (36.67) Hepatitis B 23 (38.33) 24 (40.00) Fatty liver 18 (30.00) 20 (33.33) Pathological type Pancreatic cancer 22 (36.67) 29 (48.33) 1.726 0.631 Carcinoma of the bile ducts 17 (28.33) 19 (31.67) Duodenal papilloma 12 (20.00) 10 (16.67) Carcinoma of the ampulla oblongata 9 (15.00) 6 (10.00) Survival analysis At six months, there was no statistically significant difference in overall survival rates between the two groups ( P Figure 2 Figure 2 Kaplan-Meier curves showing OS at six months postoperatively for patients in the different care groups. Kaplan-Meier survival curve comparing two groups: CG (blue) and IG (red) over 200 days. Survival probability decreases over time. Hazard ratio is 1.72 (0.68-4.34), logrank p-value is 0.26. Assessment of gastrointestinal function Compared with the CG, the gastrointestinal function indexes of the IG showed significant improvement. Specifically, the time to first anal defecation shortened from (4.92 ± 1.25) days to (3.73 ± 1.09) days, the time to first feeding shortened from (9.76 ± 2) days to (7.82 ± 1.89) days, the time to recovery of bowel sounds shortened from (4.37 ± 1.02) days to (3.75 ± 0.85) days, and the time to first defecation shortened from (7.21 ± 1) days to (5.92 ± 0.94) days ( Figure 3 Figure 3 Assessment of gastrointestinal indicators in patients of different care groups. * p p p Four box plots compare CG (Control Group) and IG (Intervention Group) across different recovery times. The top left plot shows a significant reduction in time to first anal defecation for IG. The top right plot indicates a significant decrease in time to first food intake for IG. The bottom left plot shows a noteworthy reduction in bowel sound recovery time for IG. The bottom right plot demonstrates a significant reduction in time to first bowel movement for IG. Significance levels are marked with asterisks. Comparison of length of hospitalization The total hospitalization time for patients in the IG was shorter than that of the CG. Specifically, the duration of ventilator use reduced from (14.06 ± 1.82) days to (13.04 ± 1.56) days, the length of stay in ICU shortened from (2.32 ± 0.78) days to (6.77 ± 0.70) days, and postoperative stay reduced from (21.61 ± 2.75) days to (19.17 ± 2.58) days ( Figure 4 Figure 4 Comparison of length of stay of patients in different care groups. ** p p Four box plots compare CG (Control Group) and IG (Intervention Group) data. Top left: Ventilator use duration shows no significant difference. Top right: ICU stay duration shows no significant difference. Bottom left: Time to first activity is significantly lower for IG. Bottom right: Post-operative hospitalization is significantly lower for IG. Assessment of nutritional status Within 14 days after the treatment, the levels of ALB, PAB, TP and TF in both groups of patients significantly increased, and the increase in each nutritional index was significantly greater in the IG than in the CG ( P Figure 5 Figure 5 Comparison of nutritional indicators of patients in different nursing groups. * P P Four line graphs depict protein levels over time in control (CG) and intervention groups (IG). The top left chart shows ALB levels increasing over 14 days. The top right displays PAB levels with a similar trend. The bottom left graph shows rising TP levels, and the bottom right depicts increasing TF levels. IG consistently shows higher levels than CG, marked by asterisks and hash symbols to indicate significant differences. Assessment of indicators of immune function The levels of TNF-α, IL-6 and CRP in both groups showed a downward trend, while the proportion of CD4 + cells increased, the proportion of CD8 + cells decreased, and the ratio of CD4+/CD8 + increased. In addition, one day after treatment, the levels of pro-inflammatory factors in the IG were significantly lower than those in the CG. Three days after treatment, the proportion of CD4 + cells in the IG was significantly higher than that in the CG, indicating that the immune function of the IG was better than that of the CG ( P Figure 6 Figure 6 Comparison of immune function indexes of patients in different nursing groups. * P P Six line graphs compare CG (blue circles) and IG (red squares). Top row: TNF-α, IL-6, and CRP decrease over three days. Bottom row: CD4+ increases; CD8+ decreases; CD4+/CD8+ remains stable. Data include error bars. Statistical significance is noted with asterisks and other symbols. Evaluation of postoperative complications Compared with the CG, the postoperative incidence rates of pancreatic fistula, anastomotic bleeding, gastroparesis, incision infection, and lower extremity venous thrombosis in the IG was lower. There was a statistically significant difference in the incidence of lower extremity venous thrombosis between the two groups ( P Table 3 Table 3 Complication statistics for both groups of patients, n Groups Pancreatic fistula Anastomotic bleeding Gastrop-aresis Cutaneous infection Lower limb venous thrombosis CG ( n 4 (8.16) 1 (2.04) 9 (18.37) 2 (4.08) 11 (22.45) IG ( n 2 (3.77) 0 (0.00) 4 (7.55) 1 (1.89) 4 (7.55) X 2 0.886 1.01 2.68 0.43 4.508 P 0.347 0.315 0.102 0.512 0.033 * * P Assessment of negative emotions The SAS scores and SDS scores of patients in both groups decreased significantly after the nursing care. Moreover, the SAS scores (45.27 ± 0.85) and SDS scores (45.27 ± 0.85) of the IG were within the normal range after six months, which indicated that continuity of care combined with immunomodulatory nutrition could better alleviate the anxiety and depression of the patients within six months ( Figure 7 Figure 7 SDS and SAS scores, points. * P P Bar graphs showing SAS and SDS scores for control group (CG) and intervention group (IG) at three time points: Before, After, and Six months. Both graphs depict a decrease in scores over time, with significant reductions marked by asterisks and hashtags. Assessment of quality of life In both groups of patients, after receiving the nursing treatment, their physical functions, psychological functions, social functions, and living material conditions all showed significant improvements. Among them, the improvement of the patients in the IG was more obvious ( P Figure 8 Figure 8 GQOLI-74 assessment of postoperative quality of life. * P Bar chart titled \\\"GQOLI-74\\\" displays four categories: Material state, Social function, Mental function, and Body function. Two groups are compared: CG (black bars) and IG (blue bars). The IG group scores higher in each category. Asterisk indicates statistical significance. Horizontal axis ranges from 0 to 100. Discussion PD have traumatic characteristics, so corresponding care is needed during the postoperative stage to improve the quality of life of the patients. PD is a major surgery, and the patients’ preoperative conditions are relatively severe, usually accompanied by malnutrition and low immune function. Coupled with the effects of intraoperative stress and postoperative inflammatory responses, it may lead to a series of postoperative complications, which will further affect their postoperative recovery ( 2 13 Malnutrition is one of the main causes leading to an increase in postoperative complications and mortality among patients ( 14 15 16 17 18 19 20 21 Immunonutrition is a nutritional formula containing a variety of amino acids, fatty acids, while our formula mainly increased the content of arginine and glutamine. The research has found that arginine can significantly increase the albumin level and lymphocyte count of cancer patients, reduce the incidence of postoperative infections, and shorten the hospital stay ( 22 23 In our study, we found that the gastrointestinal function of the IG was significantly improved, as evidenced by the significant shortening of the first defecation time, the first defecation interval, and the first eating time. The findings indicated that the imbalance of the intestinal physiological environment was alleviated, and the probiotics in the intestinal tract were up-regulated. In addition, nutritional indicators of the IG, such as ALB, PAB, TP and TF, all showed significant improvement within 14 days after treatment. This was consistent with the findings of Abreu et al. ( 24 The immune status of the human body plays an important role in the progression and prognosis of patients with malignant diseases, and is also a key factor affecting the recurrence and metastasis of patients after surgery ( 25 26 27 28 29 30 31 32 33 For the elderly, due to changes in vascular conditions and the presence of diseases such as tumors, the blood becomes in a hypercoagulable state. The overall incidence of lower limb venous thrombosis in hospitalized patients is approximately 1%, and in postoperative abdominal surgery patients it is approximately 20%, while the incidence among postoperative abdominal surgery patients is about 20%. Moreover, prolonged surgical procedures will further increase the incidence of venous thrombosis ( 34 35 Limitations Our research has some limitations. Firstly, our sample size is relatively small, which may lead to deviations between the data results and the actual values. Secondly, our research adopted a single-blind design, which inevitably resulted in subjective biases from the researchers, leading to an imbalance in the treatment between the two groups. Thirdly, our research was a single-center study, and the sample was not representative, which may not accurately reflect the characteristics of a broader population. Fourthly, the six-month follow-up period is too short. The effects of continuity of care combined with immunomodulatory nutrition on the long-term prognosis of patients undergoing PD are currently unclear. Therefore, more multi-center, double-blind, large-scale, and long-term studies should be conducted in the future to further verify our findings. Conclusion In this study, the postoperative care of patients undergoing PD was optimized, and multidimensional care was provided in aspects such as pain care, psychological care, exercise care, health education and immuno-nutrition. This resulted in significant improvements in the immune function, gastrointestinal function, nutritional level, and negative mood of the patients, and a certain reduction in the postoperative complications, thereby enhancing the patients’ quality of life. However, this model of care had no significant effect on the mortality rate of patients within six months. Therefore, it is necessary to collect more clinical cases and extend the follow-up period to further study. In conclusion, from this study, we found that continuity of care combined with immunomodulatory nutrition is an effective nursing model, which provides a strong basis for subsequent nursing care and is worthy of promotion and application in clinical practice. Data availability statement The original contributions presented in the study are included in the article/Supplementary Material, further inquiries can be directed to the corresponding author. Ethics statement The studies involving humans were approved by the Ethics Committee of General Hospital of Northern Theater Command. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions XF: Methodology, Investigation, Data curation, Formal analysis, Writing – original draft, Visualization. WL: Visualization, Methodology, Data curation, Formal analysis, Writing – original draft, Investigation. YT: Formal analysis, Writing – original draft, Visualization, Data curation, Investigation, Methodology. LH: Formal analysis, Investigation, Writing – original draft, Visualization, Data curation, Methodology. TB: Methodology, Investigation, Visualization, Formal analysis, Data curation, Writing – original draft. WZ: Data curation, Visualization, Formal analysis, Investigation, Methodology, Writing – original draft. YM: Validation, Data curation, Methodology, Writing – review & editing, Investigation, Supervision. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issue please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Ding J Zhang C Huang D Zhang Y The state of minimally invasive pancreaticoduodenectomy in Chinese mainland: a systematic literature review Biosci Trends 2020 13 6 488 501 10.5582/bst.2019.01278 31875583 2. Simon R Complications after pancreaticoduodenectomy Surg Clin North Am 2021 101 5 865 74 10.1016/j.suc.2021.06.011 34537148 3. Pastrana Del Valle J Mahvi DA Fairweather M Wang J Clancy TE Ashley SW The improvement in post-operative mortality following pancreaticoduodenectomy between 2006 and 2016 is associated with an improvement in the ability to rescue patients after major morbidity, not in the rate of major morbidity HPB (Oxford) 2021 23 3 434 43 10.1016/j.hpb.2020.07.013 32798109 4. Rosemurgy A Ross S Bourdeau T Craigg D Spence J Alvior J Robotic pancreaticoduodenectomy is the future: here and now J Am Coll Surg 2019 228 4 613 24 10.1016/j.jamcollsurg.2018.12.040 30682410 5. Gai YW Wang HT Tan XD Pancreaticojejunostomy conducive to biological healing in minimally invasive pancreaticoduodenectomy J Gastrointest Surg 2022 26 9 1967 81 10.1007/s11605-022-05339-4 35546220 PMC9489565 6. Liu D Li SC Nursing of a patient with multiple primary cancers: a case report and review of literature World J Clin Oncol 2024 15 10 1315 23 10.5306/wjco.v15.i10.1315 39473857 PMC11514512 7. Perkins P Continuity of care Br J Gen Pract 2022 72 725 567 10.3399/bjgp22X721313 36424148 PMC9710813 8. Jayadevappa R Guzzo T Vapiwala N Malkowicz SB Gallo JJ Chhatre S Continuity of care and advanced prostate cancer Cancer Med 2023 12 10 11795 805 10.1002/cam4.5845 36951508 PMC10242338 9. Sandall J Fernandez Turienzo C Devane D Soltani H Gillespie P Gates S Midwife continuity of care models versus other models of care for childbearing women Cochrane Database Syst Rev 2024 4 4 Cd004667 10.1002/14651858.CD004667.pub6 38597126 PMC11005019 10. Maoz H Sabbag R Krieger I Mendlovic S Shefet D The impact of a continuity-of-care model from hospitalization to outpatient clinic for patients with severe mental illness Psychiatr Serv 2023 74 5 551 4 10.1176/appi.ps.202100508 36196530 11. Fan Y Li N Zhang J Fu Q Qiu Y Chen Y The effect of immunonutrition in patients undergoing pancreaticoduodenectomy: a systematic review and meta-analysis BMC Cancer 2023 23 1 351 10.1186/s12885-023-10820-7 37069556 PMC10108524 12. Wunderle C Gomes F Schuetz P Stumpf F Austin P Ballesteros-Pomar MD ESPEN Practical guideline: nutritional support for polymorbid medical inpatients Clin Nutr 2024 43 3 674 91 10.1016/j.clnu.2024.01.008 38309229 13. Baydarova MD Kiseleva YV Tupikin KA Kozlov IA Zharikova TS Pontes-Silva A Duodenum-preserving total pancreatoduodenectomy with segmental duodenectomy vs pylorus-preserving pancreaticoduodenectomy for chronic pancreatitis with duodenal dystrophy: retrospective study Curr Probl Surg 2024 61 10 101588 10.1016/j.cpsurg.2024.101588 39266130 14. Robertson RH Russell K Jordan V Pandanaboyana S Wu D Windsor J Postoperative nutritional support after pancreaticoduodenectomy in adults Cochrane Database Syst Rev 2025 3 3 Cd014792 10.1002/14651858.CD014792.pub2 40084692 PMC11907764 15. Moon SJ Ko RE Park CM Suh GY Hwang J Chung CR The effectiveness of early enteral nutrition on clinical outcomes in critically ill sepsis patients: a systematic review Nutrients 2023 15 14 3201 10.3390/nu15143201 37513620 PMC10383540 16. Adiamah A Ranat R Gomez D Enteral versus parenteral nutrition following pancreaticoduodenectomy: a systematic review and meta-analysis HPB (Oxford) 2019 21 7 793 801 10.1016/j.hpb.2019.01.005 30773452 17. Cai J Yang G Tao Y Han Y Lin L Wang X A meta-analysis of the effect of early enteral nutrition versus total parenteral nutrition on patients after pancreaticoduodenectomy HPB (Oxford) 2020 22 1 20 5 10.1016/j.hpb.2019.06.002 31353255 18. Baiu I Spain DA Enteral nutrition JAMA 2019 321 20 2040 10.1001/jama.2019.4407 31135851 19. Doley J Enteral nutrition overview Nutrients 2022 14 11 2180 10.3390/nu14112180 35683980 PMC9183034 20. Ma H Han Z He W Liu G Clinical indications for extubation in coma patients with severe neurological craniocerebral injury with meta-analysis Biomed Res Int 2022 2022 8012018 10.1155/2022/8012018 36193306 PMC9526588 21. Adiamah A Rollins KE Kapeleris A Welch NT Iftikhar SY Allison SP Postoperative arginine-enriched immune modulating nutrition: long-term survival results from a randomised clinical trial in patients with oesophagogastric and pancreaticobiliary cancer Clin Nutr 2021 40 11 5482 5 10.1016/j.clnu.2021.09.040 34656029 PMC8581217 22. Jahani M Noroznezhad F Mansouri K Arginine: challenges and opportunities of this two-faced molecule in cancer therapy Biomed Pharmacother 2018 102 594 601 10.1016/j.biopha.2018.02.109 29597093 23. Cruzat V Macedo Rogero M Noel Keane K Curi R Newsholme P Glutamine: metabolism and immune function, supplementation and clinical translation Nutrients 2018 10 11 1564 10.3390/nu10111564 30360490 PMC6266414 24. Abreu Nascimento M Matta Alvarez Pimenta ND Aiceles de Medeiros Pinto Polastri V Cardoso Chamon R Sarto Figueiredo M Immunonutrients and intestinal microbiota: a gap in the literature Crit Rev Food Sci Nutr 2024 64 33 13058 71 10.1080/10408398.2023.2260468 37751225 25. Guan H Chen S Huang Q Effects of enteral immunonutrition in patients undergoing pancreaticoduodenectomy: a meta-analysis of randomized controlled trials Ann Nutr Metab 2019 74 1 53 61 10.1159/000495468 30541005 26. Cai Z Su X Qiu L Li Z Li X Dong X Personalized neoantigen vaccine prevents postoperative recurrence in hepatocellular carcinoma patients with vascular invasion Mol Cancer 2021 20 1 164 10.1186/s12943-021-01467-8 34903219 PMC8667400 27. Delves PJ Roitt IM The immune system. First of two parts N Engl J Med 2000 343 1 37 49 10.1056/NEJM200007063430107 10882768 28. Xing J Luo K Xiao Y Tang X Zhan W Influence of CD4-1(+), CD4-2(+) and CD8(+) T lymphocytes subpopulations on the immune response of B lymphocytes in flounder (paralichthys olivaceus) immunized with thymus-dependent or thymus-independent antigen Fish Shellfish Immunol 2019 84 979 86 10.1016/j.fsi.2018.11.004 30395993 29. Wik JA Skålhegg BS T cell metabolism in infection Front Immunol 2022 13 840610 10.3389/fimmu.2022.840610 35359994 PMC8964062 30. Steier Z Kim EJY Aylard DA Robey EA The CD4 versus CD8 T cell fate decision: a multiomics-informed perspective Annu Rev Immunol 2024 42 1 235 58 10.1146/annurev-immunol-083122-040929 38271641 31. Jawa RS Anillo S Huntoon K Baumann H Kulaylat M Interleukin-6 in surgery, trauma, and critical care part II: clinical implications J Intensive Care Med 2011 26 2 73 87 10.1177/0885066610384188 21464062 PMC6223019 32. Rong LQ Shen L Bartels K Cardiac surgery’s long opioid dependency: time to recalibrate pain therapy? Br J Anaesth 2022 129 5 655 8 10.1016/j.bja.2022.08.008 36115713 33. Nasyrova R Novitsky M Shnayder N Trefilova V Kuvshinova N Chigareva O Incidence of anxiety and depression in adult patients with chronic discogenic back pain Psychiatr Danub 2024 36 Suppl 2 155 9 39378464 34. Bendinelli C Balogh Z Postinjury thromboprophylaxis Curr Opin Crit Care 2008 14 6 673 8 10.1097/MCC.0b013e3283196538 19005308 35. Chopard R Albertsen IE Piazza G Diagnosis and treatment of lower extremity venous thromboembolism. A review JAMA 2020 324 17 1765 76 10.1001/jama.2020.17272 33141212 ",
  "metadata": {
    "Title of this paper": "Diagnosis and treatment of lower extremity venous thromboembolism. A review",
    "Journal it was published in:": "Frontiers in Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484049/"
  }
}