{
  "title": "Paper_53",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12489870 PMC12489870.1 12489870 12489870 10.7759/cureus.91458 1 Internal Medicine Rheumatology A Case of Leukoencephalopathy Secondary to Methotrexate Toxicity Muacevic Alexander Adler John R Haque Ayema 1 Pezet Channing 1 Ranjith Aidrian 1 Hughes Neil 1  1 Channing Pezet channingpezet@gmail.com 2 9 2025 9 2025 17 9 495976 e91458 31 8 2025 02 09 2025 03 10 2025 03 10 2025 Copyright © 2025, Haque et al. 2025 Haque et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/318359-a-case-of-leukoencephalopathy-secondary-to-methotrexate-toxicity Methotrexate (MTX) has known toxicities affecting the kidneys, mucous membranes, liver, lungs, and nervous system. Rarely does a patient take large amounts of MTX, as attempts are made to avoid these toxicities. This case presents a patient who ingested seven weeks' worth of MTX in one week and developed neurotoxicity, with MRI showing subacute infarcts in the right frontal lobe, right parietal, and occipital lobes in the right middle cerebral artery watershed distribution. Prompt leucovorin therapy improved symptoms of altered mental status. This case highlights the importance of accurate prescription instructions and details the neurotoxicity that can occur with high MTX ingestion. leukoencephalopathy methotrexate neurotoxicity methotrexate toxicity mucositis psoriatic arthritis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Methotrexate (MTX) is a dihydrofolate reductase inhibitor commonly associated with adverse reactions, including hepatotoxicity, hematologic toxicity, stomatitis, pulmonary toxicity, neurologic toxicity, dermatological toxicity, nausea, and vomiting [ 1 2 1 Case presentation A 74-year-old male with a history of inflammatory arthritis (on hydroxychloroquine and MTX), degenerative disc disease, monoclonal B cell lymphocytosis, and chronic kidney disease presented with dysphagia, drooling, and dysarthria for the previous two days. On presentation, he was afebrile and tachycardic. He had oral mucositis and a diffuse pustular rash. Labs revealed leukopenia with an absolute neutrophil count of 0.1 thousand per microliter and an elevated creatinine (Table 1 1 2 Table 1 Lab results on first presentation CO₂: carbon dioxide; AST: aspartate transaminase; ALT: alanine transaminase; LDH: lactate dehydrogenase; WBC: white blood cell count; RBC: red blood cell count Lab Result on initial presentation Normal value range Creatinine (mg/dL) 1.84 0.7 - 1.3 CO 2 19 23 - 32 AST (U/L) 6 0 - 37 ALT (U/L) 11 6 - 45 Albumin (g/dL) 3.2 3.5 - 5 LDH (U/L) 894 94 - 250 Lactic acid (mmol/L) 2.5 0.7 - 2.5 WBC (10^9/L) 3.0 4 - 11 RBC (10^12/L) 1.57 4.4 - 6 Platelets (10^9/L) 25 140 - 440 Neutrophils (10^9/L) 0.1 1.1 - 6.1 Absolute reticulocyte count (10^9/L) 0.6 23 - 93 Figure 1 Foci of diffusion restriction are demonstrated in the subcortical white matter of the right frontal lobe (indicated by an arrow) Figure 2 Interval development of edema in the ventral right pons (indicated by an arrow) Further history from the daughter revealed MTX toxicity. The pharmacist reported that the patient was prescribed MTX 20 mg weekly, but it was transcribed to 20 mg daily. The patient's daughter reported that she saw the patient take seven weeks’ worth of MTX in one week. Poison control recommended starting leucovorin. Radiology confirmed MRI findings of the toxicity. Leucovorin was given for four days, and the symptoms drastically improved. Lumbar puncture was attempted twice; however, it was unsuccessful. Blood cultures on day 18 of hospitalization were positive for Candida lusitaniae. Discussion MTX is a dihydrofolate reductase (DHFR) inhibitor commonly used for rheumatological conditions, including psoriatic arthritis, and malignancies such as acute lymphoblastic leukemia (ALL) and osteosarcoma. MTX’s role in inhibiting DNA synthesis leads to rapidly dividing cells being affected first. MTX toxicity, whether by accidental overingestion or side effect of therapy, can lead to mucocutaneous erosion and ulceration, interstitial pneumonitis, pancytopenia, leukoencephalopathy, hepatotoxicity, renal damage, and immunosuppression [ 1 MTX toxicity can be reversed with leucovorin, a folinic acid analog that bypasses DHFR and allows DNA synthesis to continue, thereby decreasing MTX-related effects. MTX use in autoimmune diseases is explained by an alternate mechanism: it inhibits AICAR transformylase, decreasing purine metabolism and increasing adenosine amounts. Adenosine has anti-inflammatory action by decreasing T cell activation, downregulating B cells, and increasing activated CD-95 T cell sensitivity [ 1 Pneumocystis jirovecii When suspecting MTX toxicity, MTX serum levels should be measured and leucovorin rescue should be initiated promptly, ideally within 24 hours of the last MTX dose. MTX serum levels should be monitored to help identify the dosage and duration of leucovorin therapy required [ 3 4 5 Neurotoxicity is a more common occurrence with intrathecal administration and high-dose MTX; most literature describes cases of neurotoxicity in patients treated for ALL. The exact pathogenesis of acute MTX-related encephalopathy is unknown but thought to be related to increasing amounts of adenosine, causing vascular dilation and cerebral edema. Some patients had immediate reversal of neurotoxicity with aminophylline, an adenosine receptor antagonist [ 2 6 Mistakenly taking MTX daily instead of weekly was found to be the most common (54.8%) error associated with adverse consequences of low-dose MTX in a study conducted in France [ 7 Conclusions MTX is a drug that has benefits in cancer and rheumatologic disease, but its toxicity can have a varied presentation. Early leucovorin treatment is the standard of care for MTX toxicity as it can bypass the inhibited DHFR enzyme. This case documented acute MTX encephalopathy as evidenced by MRI; however, a positive HSV-1 does not exclude HSV encephalitis as the cause of this patient’s neurologic disease. Prompt treatment of MTX-toxicity-related encephalopathy appears to be reversible short term; however, more research needs to be conducted to understand long-term complications of high-dose MTX toxicity effects on the brain. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: References 1 Methotrexate StatPearls [Internet[ Hanoodi M Mittal M Treasure Island, FL StatPearls Publishing 2025 https://www.ncbi.nlm.nih.gov/books/NBK556114/ 32310574 2 Clinical and radiological characteristics of methotrexate-induced acute encephalopathy in pediatric patients with cancer Ann Oncol Inaba H Khan RB Laningham FH Crews KR Pui CH Daw NC 178 184 19 2008 17947226 10.1093/annonc/mdm466 3 Leucovorin StatPearls [Internet] Hegde VS Nagalli S Treasure Island, FL StatPearls Publishing 2025 https://www.ncbi.nlm.nih.gov/books/NBK553114/ 31971754 4 Preventing and managing toxicities of high-dose methotrexate Oncologist Howard SC McCormick J Pui CH Buddington RK Harvey RD 1471 1482 21 2016 27496039 10.1634/theoncologist.2015-0164 PMC5153332 5 Glucarpidase (carboxypeptidase G2): biotechnological production, clinical application as a methotrexate antidote, and placement in targeted cancer therapy Biomed Pharmacother Moradbeygi F Ghasemi Y Farmani AR Hemmati S 115292 166 2023 37579696 10.1016/j.biopha.2023.115292 6 Review of dextromethorphan administration in 18 patients with subacute methotrexate central nervous system toxicity Pediatr Neurol Afshar M Birnbaum D Golden C 625 629 50 2014 24742799 10.1016/j.pediatrneurol.2014.01.048 7 Adverse consequences of low-dose methotrexate medication errors: data from French poison control and pharmacovigilance centers Joint Bone Spine Vial T Patat AM Boels D 351 355 86 2019 30243781 10.1016/j.jbspin.2018.09.006 ",
  "metadata": {
    "Title of this paper": "Adverse consequences of low-dose methotrexate medication errors: data from French poison control and pharmacovigilance centers",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489870/"
  }
}