{
  "title": "Paper_315",
  "abstract": "pmc J Clin Pharmacol J Clin Pharmacol 379 blackwellopen JCPH Journal of Clinical Pharmacology 0091-2700 1552-4604 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12484420 PMC12484420.1 12484420 12484420 40313197 10.1002/jcph.70035 JCPH70035 1 Editor's Choice: Original Article Article Editor's Choice A Systematic Evaluation of the Dosing Regimens for Approved Targeted Therapies and Immune Checkpoint Inhibitors in Metastatic Renal Cell Carcinoma From a Project OPTIMUS Perspective Tan et al Tan Zhiyuan MSc https://orcid.org/0000-0003-2681-6932  1  2 Völler Swantje PhD  1 Sancho‐Araiz Aymara PhD  1 Knibbe Catherijne A. J. PharmD, PhD https://orcid.org/0000-0001-9893-4415  1  3 Moes Dirk Jan A. R. PharmD, PhD  2 D.J.A.R.Moes@lumc.nl   1 Division of Systems Pharmacology and Pharmacy Leiden Academic Centre for Drug Research Leiden University Leiden The Netherlands   2 Department of Clinical Pharmacy and Toxicology Leiden University Medical Center Leiden The Netherlands   3 Department of Clinical Pharmacy St Antonius Hospital Nieuwegein The Netherlands * Corresponding Author D.J.A.R.Moes@lumc.nl 02 5 2025 10 2025 65 10 498039 10.1002/jcph.v65.10 1187 1207 10 2 2025 02 4 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). The Journal of Clinical Pharmacology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Targeted therapies and immune checkpoint inhibitors (ICIs) have significantly improved survival outcomes in metastatic renal cell carcinoma (mRCC) but are often associated with high rates of adverse events, leading to dose reductions or treatment discontinuation. The FDA's recent initiative, Project OPTIMUS, emphasizes the importance of optimizing dosing regimens in oncology clinical development, and moves beyond the conventional maximum tolerated dose approach. In this study, we aimed to review and redefine the approved dosing strategies for targeted therapies and ICIs in mRCC from the Project OPTIMUS perspective, including pazopanib, axitinib, cabozantinib, sunitinib, everolimus, and nivolumab. A comprehensive summary of FDA clinical pharmacology reviews and clinical studies performed in routine clinical practice was conducted, alongside model‐informed simulations of pharmacokinetic profiles with approved and alternative regimens. Results demonstrated that actual tolerated doses in clinical practice were 46.1% to 86% lower than the approved dosages, with up to 75% of patients requiring dose adjustments. Model‐informed simulations suggested that for most targeted therapies, a 14%‐50% dose reduction maintained comparable efficacy while improving tolerability. For nivolumab, simulations confirmed adequate drug exposure with the approved flat dose regimens, without an increase of adverse effects. In conclusion, we identified optimized dosing regimens that could improve drug tolerability while maintaining efficacy for approved targeted therapies and ICIs in mRCC. We suggest that these optimized dosing regimens should be considered for use in clinical practice and that the optimal exposure range should be included in drug labels to support pharmacokinetically guided dose individualization in clinical practice. axitinib cabozantinib dose optimization dose reduction dose selection everolimus nivolumab pazopanib sunitinib pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025 Catherijne A. J. Knibbe is Fellow of the American College of Clinical Pharmacology. [Correction added on May 15, 2025, after first online publication: A minor change was made to the abstract and a new reference was added.] Introduction Targeted Therapies and Immune Checkpoint Inhibitors for Metastatic Renal Cell Carcinoma Metastatic renal cell carcinoma (mRCC) is the most common tumor of the urological system with poor prognosis.  1  2  3  4  5  6  7 Current Problem in Clinical Development The maximum tolerated dose (MTD), which is defined as the highest dose that does not cause dose‐limiting toxicity (DLT, the same grade 3 or 4 adverse event [AE] in three or more patients  8  9  10  11  12  13  10  14  15 FDA Project OPTIMUS The emerging evidence that targeted therapies are poorly tolerated at the approved recommended MTD‐based dosage was also noted by FDA.  10  16  10  17  10 In this report on six approved targeted therapies and ICI in mRCC (i.e., pazopanib, axitinib, cabozantinib, sunitinib, everolimus, and nivolumab), we reviewed the approved dosages together with the dose‐finding strategy, followed by an evaluation of routine clinical practice studies on the actual tolerated and effective doses and exposures observed in clinical practice. Finally, published pharmacokinetic (PK) models were assessed and selected for model‐informed simulations to evaluate dosing from the perspective of optimal target achievement in the post‐marketing context. Methods Overall Methods For five targeted therapies (i.e., pazopanib, axitinib, cabozantinib, sunitinib, and everolimus) and one ICI product (i.e., nivolumab) approved for mRCC, we first retrieved the approved dose and dose‐finding strategy reported in the FDA clinical pharmacology review dossier. Second, routine clinical practice studies on dose reduction and alternative dose regimen information are presented and qualitatively summarized. Finally, published PK models of these targeted and ICIs are summarized and one of the models of each drug is selected for generating model‐based optimal dose regimen that achieves the desired target exposure. Literature Search and PK Model Selection The literature search is divided into three parts. First, FDA clinical pharmacology reviews of each drug were retrieved from FDA drug approval database ( https://www.accessdata.fda.gov/scripts/cder/daf/index.cfm Second, routine clinical practice studies including dose reduction or interruption information and studies that compared the approved dose with alternative regimens were retrieved. The approved dose, dose reduction rate, and dose intensity are summarized in Table 1 Table 1 Results on Dose Reduction and Dose Intensity in Routine Clinical Practice Studies Study Labeled Dose Number of Patients Starting Dose in the Studies Dose Reduction Rate [% of Patients]  * Dose Intensity [Mean Dose  $  &  Pazopanib   800 mg QD Shah et al  18 19 ‐ 40% ‐ Johnston et al  19 ‐ 800 mg QD 60% 78% Gaillard et al  20 18 800 mg QD (60% of patients  ^ ‐ 672 mg QD Masini et al  21 279 800 mg QD 36%‐66% ‐  Axitinib   5 mg BID Johnston et al  19 ‐ 5 mg BID 22% 95% Gaillard et al  20 12 5 mg BID (60% of patients  ^ ‐ 8.6 mg per day (4.3 mg BID)   Cabozantinib Albiges et al  22   60 mg QD 410 60 mg QD (71% of patients  ^ 57% ‐ Krens et al  23 59 60 mg QD (46% of patients  ^ 58% ‐ Campbell et al  24 30 ‐ 60% ‐ Gan et al  25 413 ‐ 50% ‐ Martini et al  26 87 60 mg QD 68% ‐ Prisciandaro  27 17 60 mg QD 47% ‐ McElwee et al  28 35 ‐ ‐ 33 mg QD   Sunitinib   50 mg 4/2 Gaillard et al  20 12 50 mg QD 4/2 (60% of patients  ^ ‐ 34 mg QD Porta et al  29 85 50 mg QD 4/2 30% ‐ Park et al  30 270 50 mg QD 4/2 54% ‐ Miyake et al  31 110 50 mg QD 4/2 93% 63% Abd Ghafar et al  32 51 50 mg QD 4/2 61% ‐ Noize et al  33 302 50 mg QD 4/2 (83.4% of patients  ^ 65% ‐   Everolimus Nozawa et al  34   10 mg QD 180 10 mg QD 40% ‐ ‐, no information reported by the study; 4/2, 4 weeks on and 2 weeks off treatment; BID, twice daily; QD, once daily. * The percentage of patients who experienced dose reduction during follow‐up.  $ The mean dose was calculated by dividing the sum of overall daily doses by number of days on therapy for all patients as reported by the studies.  & Relative dose intensity was calculated by dividing the actual daily dose (the mean of the sum of all daily doses divided by the number of days on therapy) by the starting dose as reported by the studies.  ^ With the remaining patients starting at lower dosages. John Wiley & Sons, Ltd. Third, published population PK modeling studies and reviews on exposure targets are used to perform model‐informed simulations, summarized in Table 2 S1 Information Information Table 2 Recommended Starting Dose Based on Labeled Dose, Routine Clinical Practice Studies, and Model‐Informed Results Drug Labeled Dose Dose in Routine Clinical Practice  * Efficacy Target Concentration [REF] Toxicity Target Concentration [REF] Model‐Informed Dose  $ Conclusions and Recommended Starting Dose  & Pazopanib 800 mg QD 600 mg QD C min,ss  35  36 C min,ss  35  36 600 mg QD 600 mg QD Axitinib 5 mg BID 4 mg BID C min,ss  35  37 C max,ss  35  37 5 mg BID 5 mg BID Cabozantinib 60 mg QD 40 mg QD C min,ss  38 C min,ss  38  60 mg QD * 2 days + 1 day skip 40 mg QD  60 mg QD * 2 days + 1 day skip 40 mg QD Sunitinib  # 50 mg QD 4/2 37.5 mg QD C min,ss  35 C min,ss  35 50 mg QD 2/1  50 mg QD 2/1 37.5 mg QD Everolimus 10 mg QD ‐ C min,ss  35 C min,ss  35 5 mg QD 5 mg QD Nivolumab  3 mg/kg 240 mg Q2W 480 mg Q4W ‐ C min,ss  39 /  3 mg/kg 240 mg Q2W 480 mg Q4W 360 mg Q3W  3 mg/kg 240 mg Q2W 480 mg Q4W 360 mg Q3W ‐, no solid evidence from routine clinical practice studies; /, no solid relationship available of nivolumab exposure with toxicities; 4/2, 4 weeks on and 2 weeks off treatment; 2/1, 2 weeks on and 1 week off treatment; BID, twice daily; C max,ss min,ss  [REF] * The information of this column was taken from Table 1  $ Derived from the model‐informed simulations as described under paragraphs 3.3, 4.3, 5.3, 6.3, 7.3, using the selected PK models and exposure targets.  & The conclusions and recommended starting dose regimens are based on the previous columns and expert opinion if there is discrepancy between dose in routine clinical practice and model‐informed dose.  # Sunitinib exposure metric is the composite C min,ss John Wiley & Sons, Ltd. Model‐Informed Simulations to Guide Optimal Dosing Regimens The approved and alternative dose regimens retrieved as described in “Literature Search and PK Model Selection” are used for model‐informed simulations. To this end, 1000 virtual adult patients per regimen are generated by the copula covariate simulator (CoCoSim) web application ( https://cocosim.lacdr.leidenuniv.nl/  40  35  36  37 Pazopanib Approved Dose and Dose‐Finding Strategy Pazopanib was approved for mRCC in 2009 by the FDA.  41  42  43  41 As for the dose‐finding strategy of pazopanib, a Phase I dose‐escalation study involving 63 patients was performed where doses ranging from 50 to 2000 mg were evaluated in the dose‐escalation phase and 300 mg BID, 400 mg BID, and 800 mg QD were evaluated in the dose‐expansion phase. Exposure seemed to increase proportionally with doses between 50 and 400 mg even though variability was high,  44 min,ss 1a  45 Figure 1 Dose‐exposure, dose/exposure‐response, or exposure‐toxicity relationship of the investigated targeted therapies and ICI in clinical trials. (a) Pazopanib dose‐response relationship based on Phase I trial data.  46  47  47  48  48  49 tot tot tot tot  49 min,ss  50 min,ss  50 FDA Clinical Pharmacology and Biopharmaceutics Review  46  47  48  49  50 Subsequently, exposure‐response analysis conducted by FDA combined available data across trials  46 min,ss  45 1b Clinical Routine Practice Studies of Dose Reduction and Alternative Regimens In clinical practice, dose reduction rate and related outcomes have been reported in several published studies (Table 1  18  19  20 Evidence from retrospective studies highlights the potential benefits of dose adjustments. A study  51 P P P P Further support for dose reduction comes from a larger study by Lacovelli et al,  52 P However, not all studies have demonstrated consistent outcomes. Grassi et al  53 Model‐Informed Dose Based on Published Exposure Target and PK Model The current exposure target of pazopanib, specifically the C min,ss 2  37 In total, four pazopanib PK models  54  55  56  57 2 min,ss S1 Figure 2 Model‐informed pazopanib dose exploration using the model of Tan et al. Blue dashed line indicates the efficacy target C min,ss min,ss Axitinib Approved Dose and Dose‐Finding Strategy Axitinib was approved by the FDA in 2012 for mRCC in patients who had failed one prior systemic therapy.  58  59  60 max  47  60 Dose selection was based on MTD criteria in a Phase I PK and tolerability study that assessed various doses, including 10 mg QD,15 mg QD, 5 mg BID, 10 mg BID, 20 mg BID, and 30 mg BID. Substantial inter‐individual variability was observed, with a coefficient of variation of 60% in area under the curve (AUC) following an axitinib dose of 5 mg BID.  47 The dose‐exposure relationship was generally linear (Figure 1c  47  47  47 1d  47 Clinical Routine Practice Studies of Dose Reduction and Alternative Regimens Several studies have evaluated axitinib tolerance in routine clinical practice setting (Table 1  61  20 In contrast, a larger cohort study  19 Model‐Informed Dose Based on Published Exposure Target and PK Model Axitinib has a reported efficacy target of C min,ss  62 2 max,ss  63 2 Three axitinib PK models were retrieved,  64  65  66  66 3 S1 min,ss S1 Figure 3 Model‐informed axitinib dose exploration using Rini model.  66 min,ss max,ss Cabozantinib Approved Dose and Dose‐Finding Strategy Cabozantinib was approved by the FDA in 2012 for the treatment of patients with advanced RCC who have received prior anti‐angiogenic therapy. This multi‐kinase TKI exerts its effects by inhibiting several key pathways involved in cancer progression.  67  68  69  70 1/2 The dose selection was based on a Phase I study that investigated 20, 40, 60, and 140 mg QD, with 60 mg QD chosen as starting dose. An exposure‐response study  71  72  73 avg,ss 1e  71 1f  48 Clinical Routine Practice Studies of Dose Reduction and Alternative Regimens Martini et al  26 P P P P P Recently, a retrospective analysis  74 P Additional studies have provided additional information regarding routine clinical practice tolerance of cabozantinib  22  23  24  25  27  28  75  76  77 1  22  25 P P Consistent findings were reported by Krens et al,  23 P  24  27  76 Model‐Informed Dose Based on Published Exposure Target and PK Model Cabozantinib is suggested to have a therapeutic window  38 min,ss min,ss 2  71  73  78  79  78  70  70 4 min,ss S1  70 Figure 4 Model‐informed cabozantinib dose exploration using model of Tan et al.  70 min,ss min,ss Sunitinib Approved Dose and Dose‐Finding Strategy Sunitinib was among the first approved TKIs by the FDA in 2006 indicated for all mRCC patients. Sunitinib was identified as a potent inhibitor of VEGFR‐1, VEGFR‐2 FLT3, KIT, and PDGFR with antitumor and anti‐angiogenic activities.  80  81 max 1/2  49  49 Dose‐finding studies for sunitinib began with a Phase I study in solid tumors, testing doses from 50 mg once every other day (QOD) to 150 mg QD.  82  49 Following Phase I, two single‐arm studies were conducted to evaluate the PK and PD relationship in mRCC patients. Exposure, measured as the combined steady‐state AUC of sunitinib and SU012662 (AUC tot tot tot tot 1g  49 1h  49  83  49 Clinical Routine Practice Studies of Dose Reduction and Alternative Regimens In clinical practice, a substantial number of studies have evaluated alternative regimens for sunitinib  31  32  33  52  84  85  86  87  88  89  90  91  92  93  94  95  96  97  98  99  100  101  102  103  104  105  106  107  108  109  110  111  112  113  114  115  116 2  52  94  95  96  97  98  99  100  101  102  103  104  105  106  107  108  109  110  111  112  113  114  115  116  117 Other reduced or alternative regimens have also been reported. Boegemann et al  95 P P P Another study, Ohba et al,  107 P  107 An alternative regimen of 37.5 mg 4/2 as starting dose was also explored in two studies in Asian people.  113  114 P P P 1  20  29  30  31  32  33  20 Model‐Informed Dose Based on Published Exposure Target and PK Model Table 2 min,ss  118  119  120 5 S1 Figure 5 Model‐informed sunitinib dose exploration with Diekstra model.  120 min,ss min,ss Everolimus Approved Dose and Dose‐Finding Strategy Everolimus was approved by FDA in 2009 for patients with advanced RCC after failure of treatment with sunitinib or sorafenib. Everolimus is an oral protein kinase inhibitor of the mTOR signal transduction pathway.  121  122 max  50  123  50 Dose‐finding studies began with a Phase I trial that evaluated both weekly regimens (5, 10, 20, 30, 50, and 70 mg) and daily regimens (5 and 10 mg). These studies identified 10 mg QD as an appropriate dose based on pharmacokinetic properties and clinical safety. In the pivotal trial,  124  50 min,ss min,ss 1i min,ss, 119 1j Clinical Routine Practice Studies of Dose Reduction and Alternative Regimens Evidence from clinical routine practice regarding everolimus in the mRCC patients is limited (Table 1  34  34  125 Model‐Informed Dose Based on Published Exposure Target and PK Model As shown in Table 2 min,ss  126  127  127  128 S1 6 S1 Figure 6 Model‐informed everolimus dose exploration with Tanaka model.  127 min,ss min,ss Nivolumab Approved Dose and Dose‐Finding Strategy Nivolumab, an ICI, was approved for use as monotherapy in mRCC patients who have received prior anti‐angiogenic therapy.  129  130  131  132  132  133 Dose selection was informed by early clinical studies. A large Phase Ib open‐label, dose‐escalation, cohort‐expansion study evaluated nivolumab's anti‐tumor activity and safety across multiple tumor types including mRCC. Patients received doses of 1 or 10 mg/kg,  134  135  133 CA209010 CA209025 avg,ss  136 Clinical Routine Practice Studies of Dose Reduction and Alternative Regimens Evidence from routine clinical practice regarding nivolumab use in mRCC is relatively limited (Table 1  137 P  39  138  39 Model‐Informed Dose Based on Published Exposure Target and PK Model As shown in Table 2  39 min,ss  139  39  140  140 7 S1 Figure 7 Model‐informed nivolumab dose exploration with Zhang model.  140 min,ss Lessons Learned Recently, the FDA Project OPTIMUS was initiated which is intended to assist sponsors in identifying an optimal dosage for new investigational drugs for the treatment of oncologic diseases during clinical development.  10  141  142 In the current study, several mRCC target therapies were investigated including TKIs (pazopanib, axitinib, cabozantinib, and sunitinib), an mTOR inhibitor (everolimus), and an ICI (nivolumab). In line with Project OPTIMUS, we combined data from both approval and post‐approval to (a) re‐examine the approved dose and dose‐finding strategy, (b) summarize routine clinical practice studies on best tolerated dose, and (c) explore model‐informed optimal doses based on established therapeutic target (if available) or published evidence. Table 2 Our findings highlighted the limitation of the “one size fit all” dosing strategy applied to the four TKIs currently used in mRCC, except for axitinib. The starting dose of axitinib is 5 mg BID, with the option to titrate to 7‐10 mg BID based on tolerability. However, its label does not recommend dose reductions below 5 mg BID even if the patient is already experiencing intolerability. The model‐informed simulations of our study (Figure 3 2 2  143  144 For the mTOR inhibitor everolimus, the dose‐finding process was similar to that of TKIs, with a flat dose‐response relationship and clear exposure‐toxicity relationship. However, everolimus was registered at a high dose of 10 mg QD, which could be an unnecessarily higher dose based on both exposure‐response analysis from clinical trials data and routine clinical practice studies. A pre‐published TDM target for everolimus (C min  126 When it comes to ICIs, nivolumab is currently used as monotherapy or in combination with ipilimumab or cabozantinib as one of the standard treatments in previously untreated mRCC patients. Although nivolumab has demonstrated significantly improved survival, due to its high cost, accessibility remains a challenge worldwide.  145  146  147 P  147 To sum up, based on the results of all investigated targeted therapies and ICIs, except for axitinib, the approved fixed‐dose regimens are either higher than the doses actually tolerated in routine clinical practice for small molecules  46  48  49  50  133 Therapeutic alternatives for treating mRCC are increasing, with combination therapies including anti‐angiogenic agents and tyrosine kinase/mTOR/ICIs now considered as the gold standard, as supported by recent clinical studies.  148  149  150  148 It is emphasized that the Phase III RCTs are the most rigorous way of determining whether a favorable benefit‐risk relation exists between treatment regimen and outcome.  151  152  153  154 Lastly, while our study provides valuable insights into dosing strategies for targeted therapies in mRCC, it also has certain limitations. Our analysis was limited to therapies with available data on three key points: (1) the approved dose and dose‐finding strategy, (2) drug tolerance and alternative regimens in clinical practice, and (3) well‐defined exposure targets for model‐informed simulations. Consequently, combination therapies and newer treatments such as tivozanib were not included. In the present study, evidence from routine clinical practice observational studies were summarized and most of these observational studies had a non‐randomized, retrospective design which may be susceptible to confounding and selection bias.  155 Conclusion This study comprehensively evaluates the opportunities of dose optimization of approved mRCC target therapies and ICIs in the context of Project OPTIMUS. Through a combination of literature review, real world evidence on toxicity and efficacy, and model‐informed simulations, we identified optimized dosing regimens that could improve drug tolerability while maintaining efficacy. We recommend that these optimized dosing regimens should be considered for further evaluation and that the optimal exposure range should be included in drug labels to support pharmacokinetically guided dose individualization in clinical practice. Conflicts of Interest The authors declare no conflicts of interest. Funding The work of Zhiyuan Tan was supported by the China Scholarship Council (202108310028). Supporting information Supporting Information Acknowledgments Not Applicable. Data Availability Statement Not Applicable. References 1 Pontes O Oliveira‐Pinto S Baltazar F Costa M Renal cell carcinoma therapy: current and new drug candidates Drug Discov Today 2022 27 1 304 314 10.1016/j.drudis.2021.07.009 34265458 2 Medina López RA Rivero Belenchon I Mazuecos‐Quirós J Congregado‐Ruíz CB Couñago F Update on the treatment of metastatic renal cell carcinoma World J Clin Oncol 2022 13 1 1 8 10.5306/wjco.v13.i1.1 35116228 PMC8790301 3 Posadas EM Limvorasak S Figlin RA Targeted therapies for renal cell carcinoma Nat Rev Nephrol 2017 13 8 496 511 10.1038/nrneph.2017.82 28691713 4 Ravaud A Gross‐Goupil M Overcoming resistance to tyrosine kinase inhibitors in renal cell carcinoma Cancer Treat Rev 2012 38 8 996 1003 10.1016/j.ctrv.2012.01.003 22330762 5 Liu Y‐F Zhang Z‐C Wang S‐Y Immune checkpoint inhibitor‐based therapy for advanced clear cell renal cell carcinoma: A narrative review Int Immunopharmacol 2022 110 108900 10.1016/j.intimp.2022.108900 35753122 6 Gurram S Al Harthy M Ball MW The changing landscape of systemic therapy in metastatic renal cell carcinoma: an update Discov Med 2020 29 158 191 199 33007194 7 Hizal M Sendur MAN Bilgin B Akinci MB Sener Dede D Yalcin B A historical turning point for the treatment of advanced renal cell carcinoma: inhibition of immune checkpoint Curr Med Res Opin 2020 36 4 625 635 10.1080/03007995.2020.1716705 31942809 8 Ajithkumar TV Hatcher HM 25 ‐ Clinical trials in cancer Ajithkumar TV Hatcher HM Specialist Training in Oncology Mosby 2011 355 359 9 Le Tourneau C Gan HK Razak AR Paoletti X Efficiency of new dose escalation designs in dose‐finding phase I trials of molecularly targeted agents PLoS One 2012 7 12 e51039 10.1371/journal.pone.0051039 23251419 PMC3521009 10 FDA. Optimizing the Dosage of Human Prescription Drugs and Biological Products for the Treatment of Oncologic Diseases Guidance for Industry 2024 11 Jänne PA Kim G Shaw AT Sridhara R Pazdur R McKee AE Dose finding of small‐molecule oncology drugs: optimization throughout the development life cycle Clin Cancer Res 2016 22 11 2613 2617 10.1158/1078-0432.Ccr-15-2643 27250931 12 Verheijen RB Atrafi F Schellens JHM Pharmacokinetic optimization of everolimus dosing in oncology: a randomized crossover trial Clin Pharmacokinet 2018 57 5 637 644 10.1007/s40262-017-0582-9 28762135 PMC5904242 13 Shah M Rahman A Theoret MR Pazdur R The drug‐dosing conundrum in oncology ‐ when less is more N Engl J Med 2021 385 16 1445 1447 10.1056/NEJMp2109826 34623789 14 Bei D Osawa M Uemura S Benefit‐risk assessment of nivolumab 240 mg flat dose relative to 3 mg/kg Q2W regimen in Japanese patients with advanced cancers Cancer Sci 2020 111 2 528 535 10.1111/cas.14252 31773815 PMC7004547 15 Patil VM Noronha V Menon N Low‐dose immunotherapy in head and neck cancer: a randomized study J Oncol Pract 2023 41 2 222 232 10.1200/jco.22.01015 36265101 16 Gendy JM Nomura N Stuart JN Blumenthal G US FDA's dose optimization postmarketing requirements and commitments of oncology approvals and the impact on product labels from 2010 to 2022: an emerging landscape from traditional to novel therapies Ther Innov Regul Sci 2024 58 2 380 386 10.1007/s43441-023-00606-1 38182940 PMC10850176 17 Moon H FDA initiatives to support dose optimization in oncology drug development: the less may be the better Transl Clin Pharmacol 2022 30 2 71 74 10.12793/tcp.2022.30.e9 35800667 PMC9253446 18 Shah AY Kotecha RR Lemke EA Outcomes of patients with metastatic clear‐cell renal cell carcinoma treated with second‐line VEGFR‐TKI after first‐line immune checkpoint inhibitors Eur J Cancer 2019 114 67 75 10.1016/j.ejca.2019.04.003 31075726 PMC7537491 19 Johnston H Deal AM Morgan KP Patel B Milowsky MI Rose TL Dose intensity in real‐world patients with metastatic renal cell carcinoma taking vascular endothelial growth factor receptor tyrosine kinase inhibitors Clin Genitourinary Cancer 2023 21 3 357 365 10.1016/j.clgc.2023.02.007 37012148 20 Gaillard V Lhuillier A Bigot C Impact of the app‐based and nurse‐led supportive care program AKO@dom on dose intensity of oral‐targeted therapies in patients with metastatic renal cell cancer: a multicentric observational retrospective study Support Care Cancer 2022 30 8 6583 6591 10.1007/s00520-022-07088-1 35484315 21 Masini C Vitale MG Maruzzo M Safety and efficacy of pazopanib in first‐line metastatic renal‐cell carcinoma with or without renal failure: CORE‐URO‐01 study Clin Genitourin Cancer 2019 17 1 e150 e155 10.1016/j.clgc.2018.10.001 30396828 22 Albiges L Fléchon A Chevreau C Real‐world evidence of cabozantinib in patients with metastatic renal cell carcinoma: results from the CABOREAL early access program Eur J Cancer 2021 142 102 111 10.1016/j.ejca.2020.09.030 33253997 23 Krens SD van Erp NP Groenland SL Exposure‐response analyses of cabozantinib in patients with metastatic renal cell cancer BMC Cancer 2022 22 1 228 10.1186/s12885-022-09338-1 35236333 PMC8892746 24 Campbell MT Bilen MA Shah AY Cabozantinib for the treatment of patients with metastatic non‐clear cell renal cell carcinoma: a retrospective analysis Eur J Cancer 2018 104 188 194 10.1016/j.ejca.2018.08.014 30380460 25 Gan CL Dudani S Wells JC Cabozantinib real‐world effectiveness in the first‐through fourth‐line settings for the treatment of metastatic renal cell carcinoma: results from the International Metastatic Renal Cell Carcinoma Database Consortium Cancer Med 2021 10 4 1212 1221 10.1002/cam4.3717 33463028 PMC7926018 26 Martini DJ Evans ST Liu Y Analysis of toxicity and clinical outcomes in full versus reduced starting dose cabozantinib in metastatic renal cell carcinoma patients Clin Genitourin Cancer 2022 20 1 53 59 10.1016/j.clgc.2021.11.004 34922840 PMC8816843 27 Prisciandaro M Ratta R Massari F Safety and efficacy of cabozantinib for metastatic nonclear renal cell carcinoma: real‐world data from an Italian managed access program Am J Clin Oncol 2019 42 1 42 45 10.1097/coc.0000000000000478 30204614 28 McElwee JH Gourdin TS Mikoll J Weeda E Sion AM Cabozantinib use in metastatic renal cell carcinoma patients in clinical practice: Evaluation of dosing patterns, tolerability, and outcomes compared to clinical trials J Oncol Pharm 2020 26 4 861 865 10.1177/1078155219875509 31566113 29 Porta C Paglino C Imarisio I Safety and treatment patterns of multikinase inhibitors in patients with metastatic renal cell carcinoma at a tertiary oncology center in Italy BMC Cancer 2011 11 105 10.1186/1471-2407-11-105 21435216 PMC3079688 30 Park SJ Lee JL Park I Comparative efficacy of sunitinib versus sorafenib as first‐line treatment for patients with metastatic renal cell carcinoma Chemotherapy 2012 58 6 468 474 10.1159/000346484 23548259 31 Miyake H Miyazaki A Harada K Fujisawa M Assessment of efficacy, safety and quality of life of 110 patients treated with sunitinib as first‐line therapy for metastatic renal cell carcinoma: experience in real‐world clinical practice in Japan Med Oncol 2014 31 6 978 10.1007/s12032-014-0978-4 24793747 32 Abd Ghafar NK Alip A Ong TA Yap NY Saad M Efficacy, safety, and prognostic indicators of first‐line sunitinib in patients with metastatic renal cell carcinoma: a single center experience J Cancer Res Ther 2018 14 6 1303 1311 10.4103/0973-1482.189247 30488848 33 Noize P Grelaud A Bay JO Real‐life patterns of use, safety and effectiveness of sunitinib in first‐line therapy of metastatic renal cell carcinoma: the SANTORIN cohort study Pharmacoepidemiol Drug Saf 2017 26 12 1561 1569 10.1002/pds.4228 28573786 34 Nozawa M Nonomura N Ueda T Adverse event profile and dose modification of everolimus for advanced renal cell carcinoma in real‐world Japanese clinical practice Jpn J Clin Oncol 2013 43 11 1132 1138 10.1093/jjco/hyt121 23999768 35 Puisset F Mseddi M Mourey L Therapeutic drug monitoring of tyrosine kinase inhibitors in the treatment of advanced renal cancer Cancers 2023 15 1 313 36612311 10.3390/cancers15010313 PMC9818258 36 Mueller‐Schoell A Groenland SL Scherf‐Clavel O Therapeutic drug monitoring of oral targeted antineoplastic drugs Eur J Clin Pharmacol 2021 77 4 441 464 10.1007/s00228-020-03014-8 33165648 PMC7935845 37 Henriksen JN Andersen CU Fristrup N Therapeutic drug monitoring for tyrosine kinase inhibitors in metastatic renal cell carcinoma Clin Genitourin Cancer 2024 22 3 102064 10.1016/j.clgc.2024.102064 38555681 38 Blanchet B Xu‐Vuilard A Jouinot A Exposure‐response relationship of cabozantinib in patients with metastatic renal cell carcinoma treated in routine care Br J Cancer 2024 130 6 961 969 10.1038/s41416-024-02585-y 38272963 PMC10950854 39 Puszkiel A Bianconi G Pasquiers B Extending the dosing intervals of nivolumab: model‐based simulations in unselected cancer patients Br J Cancer 2024 130 11 1866 1874 10.1038/s41416-024-02659-x 38532102 PMC11130267 40 Guo Y Guo T Knibbe CAJ Zwep LB van Hasselt JGC Generation of realistic virtual adult populations using a model‐based copula approach J Pharmacokinet Pharmacodyn 2024 51 735 746 10.1007/s10928-024-09929-4 38844624 PMC11579194 41 FDA Label of VOTRIENT (pazopanib) tablets (Revised on 1/2024) https://www.accessdata.fda.gov/drugsatfda_docs/label/2024/022465s036lbl.pdf 42 Kasper B Hohenberger P Pazopanib: a promising new agent in the treatment of soft tissue sarcomas Future Oncol 2011 7 12 1373 1383 10.2217/fon.11.116 22112314 43 Pick AM Nystrom KK Pazopanib for the treatment of metastatic renal cell carcinoma Clin Ther 2012 34 3 511 520 10.1016/j.clinthera.2012.01.014 22341567 44 Hurwitz HI Dowlati A Saini S Phase I trial of pazopanib in patients with advanced cancer Clin Cancer Res 2009 15 12 4220 4227 10.1158/1078-0432.Ccr-08-2740 19509175 45 Motzer RJ Hutson TE Cella D Pazopanib versus sunitinib in metastatic renal‐cell carcinoma N Engl J Med 2013 369 8 722 731 10.1056/NEJMoa1303989 23964934 46 CENTER FOR DRUG EVALUATION AND RESEARCH, FDA VOTRIENT (pazopanib) tablets CLINICAL PHARMACOLOGY AND BIPHARMACEUTICS REVIEW https://www.accessdata.fda.gov/drugsatfda_docs/nda/2009/022465s000_ClinPharmR.pdf 47 CENTER FOR DRUG EVALUATION AND RESEARCH, FDA. INLYTA® (axitinib) tablets CLINICAL PHARMACOLOGY AND BIPHARMACEUTICS REVIEW https://www.accessdata.fda.gov/drugsatfda_docs/nda/2012/202324Orig1s000ClinPharmR.pdf 48 CENTER FOR DRUG EVALUATION AND RESEARCH, FDA. CABOMETYX™ (cabozantinib) tablets CLINICAL PHARMACOLOGY AND BIPHARMACEUTICS REVIEW 2015 https://www.accessdata.fda.gov/drugsatfda_docs/nda/2016/208692Orig1s000ClinPharmR.pdf 49 CENTER FOR DRUG EVALUATION AND RESEARCH, FDA. SUTENT® (sunitinib malate) capsules CLINICAL PHARMACOLOGY AND BIPHARMACEUTICS REVIEW https://www.accessdata.fda.gov/drugsatfda_docs/nda/2006/021938_S000_Sutent_BioPharmR.pdf 50 CENTER FOR DRUG EVALUATION AND RESEARCH, FDA. AFINITOR (everolimus) tablets CLINICAL PHARMACOLOGY AND BIPHARMACEUTICS REVIEW https://www.accessdata.fda.gov/drugsatfda_docs/nda/2009/022334s000_ClinPharmR.pdf 51 Corianò M Giannarelli D Scartabellati G Tailoring treatment with cabozantinib or pazopanib in patients with metastatic renal cell carcinoma: does it affect outcome? Expert Rev Anticancer Ther 2023 23 5 545 554 10.1080/14737140.2023.2200168 37017710 52 Iacovelli R Cossu Rocca M Galli L Clinical outcome of patients who reduced sunitinib or pazopanib during first‐line treatment for advanced kidney cancer Urol Oncol 2017 35 9 541.e7 541.e13 10.1016/j.urolonc.2017.05.007 28572027 53 Grassi P Verzoni E Ratta R Does dose modification affect efficacy of first‐line pazopanib in metastatic renal cell carcinoma? Drugs R D 2017 17 3 461 467 10.1007/s40268-017-0203-y 28801802 PMC5629143 54 Bins S Huitema ADR Laven P Impact of CYP3A4*22 on pazopanib pharmacokinetics in cancer patients Clin Pharmacokinet 2019 58 5 651 658 10.1007/s40262-018-0719-5 30367352 PMC6451710 55 Ozbey AC Combarel D Poinsignon V Population pharmacokinetic analysis of pazopanib in patients and determination of target AUC Pharmaceuticals 2021 14 9 927 10.3390/ph14090927 34577627 PMC8469080 56 Yu H van Erp N Bins S Development of a pharmacokinetic model to describe the complex pharmacokinetics of pazopanib in cancer patients Clin Pharmacokinet 2017 56 3 293 303 10.1007/s40262-016-0443-y 27534647 57 Tan Z Völler S Yin A Model‐Informed Dose Optimization of Pazopanib in Real‐World Patients with Cancer Clin Pharmacokinet 2025 10.1007/s40262-025-01504-5 PMC12064635 40263237 58 FDA Label of INLYTA® (axitinib) tablets (Revised on 7/2024) https://www.accessdata.fda.gov/drugsatfda_docs/label/2024/202324s016lbl.pdf 59 Chen Y Suzuki A Tortorici MA Axitinib plasma pharmacokinetics and ethnic differences Invest New Drugs 2015 33 2 521 532 10.1007/s10637-015-0214-x 25663295 60 Chen Y Tortorici MA Garrett M Hee B Klamerus KJ Pithavala YK Clinical pharmacology of axitinib Clin Pharmacokinet 2013 52 9 713 725 10.1007/s40262-013-0068-3 23677771 61 Yasuoka S Yuasa T Fujiwara R Efficacy and safety of axitinib therapy after nivolumab for patients with metastatic renal cell cancer Anticancer Res 2020 40 11 6493 6497 10.21873/anticanres.14671 33109588 62 Synowiec Z Sobańska K Synowiec T Teżyk A Tomczak P Jabłecka A Axitinib trough concentration and its influence on the efficacy and toxicity of second‐line renal cell carcinoma treatment Clin Genitourin Cancer 2022 20 4 390.e1 390.e8 10.1016/j.clgc.2022.03.006 35428585 63 Fukudo M Tamaki G Azumi M Kakizaki H Matsumoto S Tasaki Y Absorption of the orally active multikinase inhibitor axitinib as a therapeutic index to guide dose titration in metastatic renal cell carcinoma Invest New Drugs 2021 39 2 595 604 10.1007/s10637-020-01023-z 33098047 64 Chen Y Rini BI Bair AH Mugundu GM Pithavala YK Population pharmacokinetic‐pharmacodynamic modelling of 24‐h diastolic ambulatory blood pressure changes mediated by axitinib in patients with metastatic renal cell carcinoma Clin Pharmacokinet 2015 54 4 397 407 10.1007/s40262-014-0207-5 25343945 65 Garrett M Poland B Brennan M Hee B Pithavala YK Amantea MA Population pharmacokinetic analysis of axitinib in healthy volunteers Br J Clin Pharmacol 2014 77 3 480 492 10.1111/bcp.12206 23834452 PMC3952722 66 Rini BI Garrett M Poland B Axitinib in metastatic renal cell carcinoma: results of a pharmacokinetic and pharmacodynamic analysis J Clin Pharmacol 2013 53 5 491 504 10.1002/jcph.73 23553560 PMC4175417 67 Srigadha VK Prabhash K Noronha V Cabozantinib: a narrative drug review Cancer Research, Statistics, and Treatment 2023 6 1 74 87 10.4103/crst.crst_9_23 68 Yakes FM Chen J Tan J Cabozantinib (XL184), a novel MET and VEGFR2 inhibitor, simultaneously suppresses metastasis, angiogenesis, and tumor growth Mol Cancer Ther 2011 10 12 2298 2308 21926191 10.1158/1535-7163.MCT-11-0264 69 FDA Label of CABOMETYX™ (cabozantinib) tablets (Revised on 3/2025) https://www.accessdata.fda.gov/drugsatfda_docs/label/2025/208692s017lbl.pdf 70 Tan Z Völler S Yin A Population pharmacokinetics of cabozantinib in metastatic renal cell carcinoma patients: towards drug expenses saving regimens Clin Pharmacokinet 2024 63 6 857 869 10.1007/s40262-024-01379-y 38874883 PMC11222182 71 Lacy S Nielsen J Yang B Miles D Nguyen L Hutmacher M Population exposure‐response analysis of cabozantinib efficacy and safety endpoints in patients with renal cell carcinoma Cancer Chemother Pharmacol 2018 81 6 1061 1070 10.1007/s00280-018-3579-7 29667066 PMC5973957 72 Choueiri TK Escudier B Powles T Cabozantinib versus everolimus in advanced renal cell carcinoma (METEOR): final results from a randomised, open‐label, phase 3 trial Lancet Oncol 2016 17 7 917 927 10.1016/s1470-2045(16)30107-3 27279544 73 Lacy S Yang B Nielsen J Miles D Nguyen L Hutmacher M A population pharmacokinetic model of cabozantinib in healthy volunteers and patients with various cancer types Cancer Chemother Pharmacol 2018 81 6 1071 1082 10.1007/s00280-018-3581-0 29687244 PMC5973963 74 Bruchbacher A Franke J Alimohammadi A Laukhtina E Fajkovic H Schmidinger M Real‐world results of cabozantinib given as alternative schedule in metastatic renal cell carcinoma Clin Genitourin Cancer 2023 22 98 108 10.1016/j.clgc.2023.09.006 37926597 75 McGregor BA Lalani AA Xie W Activity of cabozantinib after immune checkpoint blockade in metastatic clear‐cell renal cell carcinoma Eur J Cancer 2020 135 203 210 10.1016/j.ejca.2020.05.009 32599410 76 Procopio G Prisciandaro M Iacovelli R Safety and efficacy of cabozantinib in metastatic renal‐cell carcinoma: real‐world data from an Italian managed access program Clinical genitourinary cancer 2018 16 4 e945 e951 10.1016/j.clgc.2018.03.014 29753637 77 Procopio G Sepe P Claps M Cabozantinib as first‐line treatment in patients with metastatic collecting duct renal cell carcinoma: results of the BONSAI trial for the Italian network for research in urologic‐oncology (Meet‐URO 2 study) JAMA Oncol 2022 8 6 910 913 10.1001/jamaoncol.2022.0238 35420628 PMC9011175 78 CDER Clinical pharmacology and biopharmaceutics review(s) of cabometyx https://www.accessdata.fda.gov/drugsatfda_docs/nda/2016/208692Orig1s000TOC.cfm 79 Nguyen L Chapel S Tran BD Lacy S Updated population pharmacokinetic model of cabozantinib integrating various cancer types including hepatocellular carcinoma J Clin Pharmacol 2019 59 11 1551 1561 10.1002/jcph.1467 31187515 PMC6790584 80 Le Tourneau C Raymond E Faivre S Sunitinib: a novel tyrosine kinase inhibitor. A brief review of its therapeutic potential in the treatment of renal carcinoma and gastrointestinal stromal tumors (GIST) Ther Clin Risk Manage 2007 3 2 341 348 10.2147/tcrm.2007.3.2.341 PMC1936316 18360643 81 FDA Label of SUTENT® (sunitinib malate) capsules (Revised on 2/2007) https://www.accessdata.fda.gov/drugsatfda_docs/label/2007/021968s002s003s004s005s006lbl.pdf 82 Faivre S Delbaldo C Vera K Safety, pharmacokinetic, and antitumor activity of SU11248, a novel oral multitarget tyrosine kinase inhibitor, in patients with cancer J Oncol Pract 2006 24 1 25 35 10.1200/jco.2005.02.2194 16314617 83 Motzer RJ Hutson TE Tomczak P Sunitinib versus interferon alfa in metastatic renal‐cell carcinoma N Engl J Med 2007 356 2 115 124 10.1056/NEJMoa065044 17215529 84 Ansari J Fatima A Fernando K Collins S James ND Porfiri E Sunitinib in patients with metastatic renal cell carcinoma: Birmingham experience Oncol Rep 2010 24 2 507 510 10.3892/or_00000886 20596640 85 Brunello A Basso U Sacco C Safety and activity of sunitinib in elderly patients (≥ 70 years) with metastatic renal cell carcinoma: a multicenter study Ann Oncol 2013 24 2 336 342 10.1093/annonc/mds431 23051952 86 Fujita T Hirayama T Nishi M Matsumoto K Yoshida K Iwamura M Outcome of third‐line sunitinib after sequential therapy with cytokines and sorafenib in metastatic renal cell carcinoma Mol Clin Oncol 2019 11 5 505 510 10.3892/mco.2019.1924 31616562 PMC6781811 87 Ishihara H Takagi T Kondo T Decreased relative dose intensity during the early phase of treatment impacts the therapeutic efficacy of sunitinib in metastatic renal cell carcinoma Jpn J Clin Oncol 2018 48 7 667 672 10.1093/jjco/hyy078 29860353 88 Iwamoto K Ishihara H Takagi T Evaluation of relative dose intensity during the early phase of first‐line sunitinib treatment using a 2‐week‐on/1‐week‐off regimen for metastatic renal cell carcinoma Med Oncol 2018 35 6 78 10.1007/s12032-018-1139-y 29687160 89 Josephs D Hutson TE Cowey CL Efficacy and toxicity of sunitinib in patients with metastatic renal cell carcinoma with severe renal impairment or on haemodialysis BJU Int 2011 108 8 1279 1283 10.1111/j.1464-410X.2010.09990.x 21244613 90 Kawashima A Tsujimura A Takayama H Importance of continuing therapy and maintaining one‐month relative dose intensity in sunitinib therapy for metastatic renal cell carcinoma Med Oncol 2012 29 5 3298 3305 10.1007/s12032-012-0236-6 22544539 91 Livne‐Segev D Gottfried M Maimon N Experience with sunitinib treatment for metastatic renal cell carcinoma in a large cohort of Israeli patients: outcome and associated factors IMAJ 2014 16 6 347 351 25058995 92 Poprach A Lakomy R Bortlicek Z Efficacy of sunitinib in elderly patients with metastatic renal cell carcinoma: data from real‐world clinical practice Drugs Aging 2016 33 9 655 663 10.1007/s40266-016-0390-1 27541802 93 Yildiz I Ekenel M Akman T Sunitinib for patients with metastatic non‐clear cell renal cell carcinoma: a multicenter retrospective Turkish oncology group trial Anticancer Res 2014 34 8 4329 4334 25075067 94 Atkinson BJ Kalra S Wang X Clinical outcomes for patients with metastatic renal cell carcinoma treated with alternative sunitinib schedules J Urol 2014 191 3 611 618 10.1016/j.juro.2013.08.090 24018239 PMC4015627 95 Boegemann M Hubbe M Thomaidou D Sunitinib treatment modification in first‐line metastatic renal cell carcinoma: analysis of the STAR‐TOR registry Anticancer Res 2018 38 11 6413 6422 10.21873/anticanres.13002 30396966 96 Bracarda S Iacovelli R Boni L Sunitinib administered on 2/1 schedule in patients with metastatic renal cell carcinoma: the RAINBOW analysis Ann Oncol 2015 26 10 2107 2113 10.1093/annonc/mdv315 26216384 97 Buti S Donini M Bersanelli M Gattara A Leonardi F Passalacqua R Feasibility, safety, and efficacy of an alternative schedule of sunitinib for the treatment of patients with metastatic renal cell carcinoma: a retrospective study Drugs R D 2017 17 4 585 596 10.1007/s40268-017-0209-5 28895069 PMC5694422 98 Buti S Donini M Lazzarelli S Passalacqua R A new modified schedule of sunitinib for metastatic renal cell carcinoma: a retrospective analysis Acta Bio‐Medica : Atenei Parmensis 2012 83 2 88 94 23393915 99 Cheng W Kletas V Kollmannsberger C de Lemos M Survival outcomes associated with different sunitinib dosing regimens in metastatic renal cell carcinoma J Oncol Pharm 2020 26 1 67 73 10.1177/1078155219837333 30909792 100 Crumbaker M Guminski A Gurney H Sabanathan D Wong S Pavlakis N Real‐world experience of the feasibility and tolerability of the 2/1 dosing schedule with sunitinib in the treatment of patients with advanced renal cell carcinoma in Australia Asia Pac J Clin Oncol 2018 14 2 e45 e49 10.1111/ajco.12686 28429452 101 De Giorgi U Scarpi E Sacco C Standard vs adapted sunitinib regimen in elderly patients with metastatic renal cell cancer: results from a large retrospective analysis Clin Genitourin Cancer 2014 12 3 182 189 10.1016/j.clgc.2013.11.005 24369790 102 Ezz El Din M Sunitinib 4/2 versus 2/1 schedule for patients with metastatic renal cell carcinoma: tertiary care hospital experience Clin Genitourin Cancer 2017 15 3 e455 e462 10.1016/j.clgc.2016.10.010 28392154 103 Makino K Yoda K Tomoishi J Kume H Efficacy and tolerability of a low‐dose, 2‐week administration of sunitinib followed by a week rest (2/1 schedule) for metastatic renal cell carcinoma: a single center experience of six cases BMC Res Notes 2014 7 872 10.1186/1756-0500-7-872 25471941 PMC4289163 104 Miyake H Harada K Miyazaki A Fujisawa M Improved health‐related quality of life of patients with metastatic renal cell carcinoma treated with a 2 weeks on and 1 week off schedule of sunitinib Med Oncol 2015 32 3 78 10.1007/s12032-015-0528-8 25698532 105 Miyake H Matsushita Y Watanabe H Significance of introduction of alternative dosing schedule for sunitinib during first‐line treatment of patients with metastatic renal cell carcinoma Med Oncol 2018 35 10 133 10.1007/s12032-018-1195-3 30128854 106 Najjar YG Mittal K Elson P A 2 weeks on and 1 week off schedule of sunitinib is associated with decreased toxicity in metastatic renal cell carcinoma Eur J Cancer 2014 50 6 1084 1089 10.1016/j.ejca.2014.01.025 24559686 107 Ohba K Miyata Y Mitsunari K Alternative treatment with every‐other‐day dosing of sunitinib for metastatic renal cell carcinoma: extended follow‐up Urol Int 2022 106 6 623 629 10.1159/000520652 35045411 108 Ohba K Miyata Y Yasuda T Efficacy and safety of sunitinib alternate day regimen in patients with metastatic renal cell carcinoma in Japan: comparison with standard 4/2 schedule Asia Pac J Clin Oncol 2018 14 3 153 158 10.1111/ajco.12849 29383843 109 Ohzeki T Fukasawa S Komaru A Efficacy of traditional and alternative sunitinib treatment schedules in Japanese patients with metastatic renal cell carcinoma Int J Urol 2014 21 10 1065 1068 10.1111/iju.12504 24930736 110 Rizza L Sbardella E Gianfrilli D Thyroid profile during the alternative sunitinib dosing 2/1 schedule in metastatic renal cell carcinoma Endocrine 2020 67 3 597 604 10.1007/s12020-019-02088-4 31679139 111 Smaletz O Chacón M de Oliveira Koch L de Carvalho Rocha DR Cardoso FC Long‐term benefit of sunitinib in patients with metastatic renal cell carcinoma in Latin America: retrospective analysis of patient clinical characteristics OncoTargets Ther 2016 9 7309 7314 10.2147/ott.S111137 PMC5138036 27942224 112 Suo A Iqbal U Lim J Outcomes and drug costs of sunitinib regimens for metastatic renal cell carcinoma: a provincial population‐based study Clin Genitourin Cancer 2017 15 3 e397 e404 10.1016/j.clgc.2017.01.016 28216279 113 Tan HS Li H Hong YW Efficacy and safety of an attenuated‐dose sunitinib regimen in metastatic renal cell carcinoma: results from a prospective eegistry in Singapore Clin Genitourin Cancer 2015 13 4 e285 e295 10.1016/j.clgc.2014.11.004 25541325 114 Teo YL Chue XP Chau NM Association of drug exposure with toxicity and clinical response in metastatic renal cell carcinoma patients receiving an attenuated dosing regimen of sunitinib Targeted Oncol 2015 10 3 429 437 10.1007/s11523-014-0349-2 25502986 115 Yamada Y Ohno Y Kato Y Optimal dose of sunitinib for long‐term treatment in Japanese patients with renal cell carcinoma Cancer Chemother Pharmacol 2019 84 5 987 992 10.1007/s00280-019-03935-x 31482225 116 Yildiz I Sen F Basaran M Response rates and adverse effects of continuous once‐daily sunitinib in patients with advanced renal cell carcinoma: a single‐center study in Turkey Jpn J Clin Oncol 2011 41 12 1380 1387 10.1093/jjco/hyr151 22013228 117 Abogunrin S Ashaye AO Cappelleri JC Safety and effectiveness of classical and alternative sunitinib dosing schedules for metastatic renal cell carcinoma: a meta‐analysis Future Oncol 2019 15 18 2175 2190 10.2217/fon-2018-0858 31010323 118 Noda S Otsuji T Baba M Assessment of sunitinib‐induced toxicities and clinical outcomes based on therapeutic drug monitoring of sunitinib for patients with renal cell carcinoma Clin Genitourin Cancer 2015 13 4 350 358 10.1016/j.clgc.2015.01.007 25701374 119 Faivre S Delbaldo C Vera K Safety, pharmacokinetic, and antitumor activity of SU11248, a novel oral multitarget tyrosine kinase inhibitor, in patients with cancer J Clin Oncol 2006 24 1 25 35 10.1200/JCO.2005.02.2194 16314617 120 Diekstra MH Fritsch A Kanefendt F Population modeling integrating pharmacokinetics, pharmacodynamics, pharmacogenetics, and clinical outcome in patients with sunitinib‐treated cancer CPT: Pharmacomet Syst Pharmacol 2017 6 9 604 613 10.1002/psp4.12210 PMC5613186 28571114 121 Hasskarl J Everolimus Recent results in cancer research Fortschritte der Krebsforschung Progres dans les recherches sur le cancer 2018 211 101 123 10.1007/978-3-319-91442-8_8 30069763 122 FDA Label of AFINITOR (everolimus) tablets for oral administration https://www.accessdata.fda.gov/drugsatfda_docs/label/2022/203985s023,022334s051lbl.pdf 123 Knoll M Macher‐Goeppinger S Kopitz J The ribosomal protein S6 in renal cell carcinoma: functional relevance and potential as biomarker Oncotarget 2016 7 1 418 432 10.18632/oncotarget.6225 26506236 PMC4808008 124 Motzer RJ Escudier B Oudard S Efficacy of everolimus in advanced renal cell carcinoma: a double‐blind, randomised, placebo‐controlled phase III trial Lancet 2008 372 9637 449 456 10.1016/s0140-6736(08)61039-9 18653228 125 Maráz A Csejtei A Kocsis J Assessment of the role of everolimus therapy in patients with renal cell carcinoma based on daily routine and recent research results Pathol Oncol Res: POR 2019 25 1 149 156 10.1007/s12253-017-0317-0 29027615 126 Ravaud A Urva SR Grosch K Cheung WK Anak O Sellami DB Relationship between everolimus exposure and safety and efficacy: meta‐analysis of clinical trials in oncology Eur J Cancer 2014 50 3 486 495 10.1016/j.ejca.2013.11.022 24332451 127 Tanaka A Yano I Shinsako K Population pharmacokinetics of everolimus in relation to clinical outcomes in patients with advanced renal cell carcinoma Ther Drug Monit 2016 38 6 663 669 10.1097/ftd.0000000000000344 27661398 128 de Wit D Schneider TC Moes DJAR Everolimus pharmacokinetics and its exposure–toxicity relationship in patients with thyroid cancer Cancer Chemother Pharmacol 2016 78 1 63 71 10.1007/s00280-016-3050-6 27169792 PMC4921118 129 Motzer RJ Escudier B McDermott DF Nivolumab versus everolimus in advanced renal‐cell carcinoma N Engl J Med 2015 373 19 1803 1813 10.1056/NEJMoa1510665 26406148 PMC5719487 130 Meybodi SM Farasati Far B Pourmolaei A Immune checkpoint inhibitors promising role in cancer therapy: clinical evidence and immune‐related adverse events Med Oncol 2023 40 8 243 10.1007/s12032-023-02114-6 37453930 131 FDA Label of OPDIVO (nivolumab) injection (Revised on 2/2023) https://www.accessdata.fda.gov/drugsatfda_docs/label/2025/125554s132lbl.pdf 132 Bajaj G Wang X Agrawal S Gupta M Roy A Feng Y Model‐based population pharmacokinetic analysis of nivolumab in patients with solid tumors CPT: Pharmacomet Syst Pharmacol 2017 6 1 58 66 10.1002/psp4.12143 PMC5270302 28019091 133 EMA. Clinical reports for OPDIVO ‐ Extension of Indication Advanced Metastatic Renal Cell Carcinoma. Module 2.7.2 Summary of Clinical Pharmacology 2015 https://www.ema.europa.eu 134 Topalian SL Hodi FS Brahmer JR Safety, activity, and immune correlates of anti‐PD‐1 antibody in cancer N Engl J Med 2012 366 26 2443 2454 10.1056/NEJMoa1200690 22658127 PMC3544539 135 Agrawal S Feng Y Roy A Kollia G Lestini B Nivolumab dose selection: challenges, opportunities, and lessons learned for cancer immunotherapy J Immunother Cancer 2016 4 72 10.1186/s40425-016-0177-2 27879974 PMC5109842 136 Zhao X Shen J Ivaturi V Model‐based evaluation of the efficacy and safety of nivolumab once every 4 weeks across multiple tumor types Ann Oncol 2020 31 2 302 309 10.1016/j.annonc.2019.10.015 31959348 137 Thana M Basappa NS Ghosh S Utilization and safety of ipilimumab plus nivolumab in a real‐world cohort of metastatic renal cell carcinoma patients Clin Genitourin Cancer 2022 20 3 210 218 10.1016/j.clgc.2021.12.003 35115252 138 Peer CJ Heiss BL Goldstein DA Goodell JC Figg WD Ratain MJ Pharmacokinetic simulation analysis of less frequent nivolumab and pembrolizumab dosing: pharmacoeconomic rationale for dose deescalation J Clin Pharmacol 2022 62 4 532 540 10.1002/jcph.1984 34648187 PMC9749861 139 FDA Clinical pharmacology and biopharmaceutic review (nivolumab) https://www.accessdata.fda.gov/drugsatfda_docs/nda/2014/125554Orig1s000ClinPharmR.pdf 140 Zhang J Sanghavi K Shen J Population pharmacokinetics of nivolumab in combination with ipilimumab in patients with advanced malignancies CPT\" Pharmacomet Syst Pharmacol 2019 8 12 962 970 10.1002/psp4.12476 PMC6930858 31710163 141 FDA‐AACR public workshop on optimizing dosages for oncology drug products: quantitative approaches to select dosages for clinical trials https://www.aacr.org/professionals/policy‐and‐advocacy/regulatory‐science‐and‐policy/events/fda‐aacr‐workshop‐optimizing‐dosages‐for‐oncology‐drug‐products/ 142 Sheiner LB Learning versus confirming in clinical drug development Clin Pharmacol Ther 1997 61 3 275 291 10.1016/S0009-9236(97)90160-0 9084453 143 Di Gion P Kanefendt F Lindauer A Clinical pharmacokinetics of tyrosine kinase inhibitors: focus on pyrimidines, pyridines and pyrroles Clin Pharmacokinet 2011 50 9 551 603 10.2165/11593320-000000000-00000 21827214 144 de Wit D Guchelaar HJ den Hartigh J Gelderblom H van Erp NP Individualized dosing of tyrosine kinase inhibitors: are we there yet? Drug Discovery Today 2015 20 1 18 36 10.1016/j.drudis.2014.09.007 25245169 145 Tringale KR Carroll KT Zakeri K Sacco AG Barnachea L Murphy JD Cost‐effectiveness analysis of nivolumab for treatment of platinum‐resistant recurrent or metastatic squamous cell carcinoma of the head and neck J Natl Cancer Inst 2018 110 5 479 485 10.1093/jnci/djx226 29126314 PMC5946900 146 Hirsch I Goldstein DA Tannock IF Butler MO Gilbert DC Optimizing the dose and schedule of immune checkpoint inhibitors in cancer to allow global access Nat Med 2022 28 11 2236 2237 10.1038/s41591-022-02029-1 36202999 147 Chen YH Wang CC Chen YY Wang JH Hung CH Kuo YH Low‐dose nivolumab in advanced hepatocellular carcinoma BMC Cancer 2022 22 1 1153 10.1186/s12885-022-10271-6 36348292 PMC9644453 148 Rossi E Bersanelli M Gelibter AJ Combination therapy in renal cell carcinoma: the best choice for every patient? Curr Oncol Rep 2021 23 12 147 10.1007/s11912-021-01140-9 34748099 PMC8575734 149 Zhou L Reddy MB Mittapalli RK Yang J Yin D Oncology combination dose‐finding study design for targeted and immuno‐oncology therapies Clin Pharmacol Ther 2024 115 1 29 35 10.1002/cpt.3085 37881828 150 Venkatakrishnan K Jayachandran P Seo SK van der Graaf PH Wagner JA Gupta N Moving the needle for oncology dose optimization: A call for action CPT: Pharmacomet Syst Pharmacol 2024 13 6 909 918 10.1002/psp4.13157 PMC11179700 38778466 151 Sibbald B Roland M Understanding controlled trials: Why are randomised controlled trials important? BMJ 1998 316 7126 201 10.1136/bmj.316.7126.201 9468688 PMC2665449 152 Bi Y Liu J Li F Model‐informed drug development in pediatric dose selection J Clin Pharmacol 2021 61 S1 S60 S69 10.1002/jcph.1848 34185906 153 FDA Pharmacokinetic‐based criteria for supporting alternative dosing regimens of programmed cell death receptor‐1 (PD‐1) or programmed cell death‐ligand 1 (PD‐L1) blocking antibodies for treatment of patients with cancer: guidance for industry 2023 https://www.fda.gov/regulatory‐information/search‐fda‐guidance‐documents/pharmacokinetic‐based‐criteria‐supporting‐alternative‐dosing‐regimens‐programmed‐cell‐death‐receptor 154 ter Heine R van den Heuvel MM Piet B A systematic evaluation of cost‐saving dosing regimens for therapeutic antibodies and antibody‐drug conjugates for the treatment of lung cancer Targeted Oncol 2023 18 3 441 450 10.1007/s11523-023-00958-6 PMC10192147 37081309 155 Tang M Pearson SA Simes RJ Chua BH Harnessing real‐world evidence to advance cancer research Current Oncol 2023 30 2 1844 1859 10.3390/curroncol30020143 PMC9955401 36826104 ",
  "metadata": {
    "Title of this paper": "Harnessing real‐world evidence to advance cancer research",
    "Journal it was published in:": "Journal of Clinical Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484420/"
  }
}