{
  "title": "Paper_360",
  "abstract": "pmc Open Vet J Open Vet J 2846 openvetj Open Veterinary Journal 2226-4485 2218-6050 Faculty of Veterinary Medicine, University of Tripoli PMC12483381 PMC12483381.1 12483381 12483381 41036377 10.5455/OVJ.2025.v15.i7.14 OpenVetJ-15-7-3035 1 Research Article Histopathological and ultrastructural alterations reveal the hepatotoxicity of lead against Moringin: Sub-chronic-chemotherapeutic trial Hasan Mohammed Abdulabbas  1  2 * 1 2 * mohammedn10@shu.edu.iq 2025 31 7 2025 15 7 498021 3035 3043 30 3 2025 06 6 2025 21 7 2025 01 01 2025 01 10 2025 02 10 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Background: Several researchers in the past have described lead acetate (LA), Pb, as a toxic heavy metal compound that can significantly affect the organs and the body systems, thereby influencing their functions. Aim: This article aimed to look at the negative effects of LA toxicity on rabbit liver samples, detect many histological abnormalities, and then examine the hepatoprotective properties of glucomoringin. Since ancient times, Moringa oleifera M. oleifera Methods: In this study, 30 rabbits were randomly categorized into three groups, with every group containing 10 rabbits (i.e., n Results: The findings in this study indicated that oral LA administration caused significant pathological changes in the livers of the experimental animals which included degeneration, fibrosis, necrosis, inflammation, significant reduction in the plasma catalase and superoxide dismutase activities, and increased plasma malondialdehyde activities. It was hypothesized that the administration of Moringin would mitigate the histopathological changes in the liver tissues. The results indicated that the extract displayed a hepatoprotective effect and considerably reduced the harmful effects of LA on the functions and hepatic tissue. Conclusion: Finally, Moringin is highly efficacious in abating oxidative stress and cellular damage in rabbits. Adverse effects Antioxidant Hepatopathy Lead acetate Moringin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Lead is widely recognized as a significant environmental contaminant due to its extensive application in various manufacturing sectors ( Poli et al. Medjedded et al. Mesalam et al. Kahalerras et al. Gurer-Orhan et al. Adeyomoye et al. Jomova et al. Lakka et al. Abdelhamid et al. Rauf et al. Additionally, reactive oxygen species (ROS) have been identified as key contributors to the intensification of lead-induced toxicity in biological systems. In the past few years, many researchers have expressed their interest in determining the significance of oxidants and antioxidants in the field of medicine, biology, and nutrition research ( Jomova et al. 2 Abdollahi et al. Amadi et al. Moringa oleifera Abd Karim et al. Patil et al. M. oleifera Tarchonanthus camphoratus El Kamari et al. M. oleifera L Juniperus phoenicea Gdoura et al. Vo et al. M. oleifera Research aims Inspect pathological mechanisms behind LA toxicity, utilizing rabbits as the experimental model. Gain deeper insights into the harmful impact of LA exposure across different toxic dosage levels. Lay the groundwork for future studies focused on LA toxicity and the adverse effects of trace elements in both humans and animals. Evaluate the protective potential of Moringin’s antioxidant activity against LA-induced hepatic injury. Materials and Methods Setup of the experiment Thirty rabbits of both sexes, aged between 6 and 12 months, with body weights ranging from 1,200 to 1,750 gm, were looked after in line with the World Health Organization’s (WHO) guidelines for breeding and caring for laboratory animals. More specifically, they were given a basic diet and plenty of fresh drinking water. They lived in stainless-steel cages maintained at a temperature of 21°C ± 2°C, a constant humidity level ranging from 40% to 70%, 12 hours of light, and 12 hours of darkness. Grouping The 30 animals were separated randomly into three groups, with the control Group (A) receiving distilled water, the 2% LA Group (B) receiving 2% LA solution, and the LA+Moringin Group (C) receiving 2% LA+Moringin (100 mg/kg/rabbit) solution. Animal blood and tissue sampling All rabbits enrolled in this experiment were euthanized 3 months after the final treatment session. Blood samples were drawn via cardiac puncture several hours before euthanasia to facilitate subsequent biochemical evaluations. These blood samples that were collected from each animal were separated into 2 parts, wherein one part of the sample was kept in a plain bottle, whereas the second part of the sample was added to a bottle containing ethyl di-amine tetra acetic acid. Also extracted the hepatic tissues from each animal and fixed the tissues in the 10% (v/v) saline formalin solution. The preserved liver tissues were sectioned, mounted onto glass slides, and subjected to haematoxylin and eosin (H&E) staining to carry out further histopathological examinations. Here, the procedures outlined in earlier research for sample preparation and plasma extraction are used to determine the activity of plasma enzymes. Such as pSOD, pCAT, and malondialdehyde (pMDA). Animal tissue preparation and microscopic examination Specimens of hepatic tissue were extracted from the animals immediately after sacrificing all the animals, 3 months after treatment. Thereafter, these tissues were sliced into sections and fixed with the help of a 10% (v/v) saline formalin solution. After fixing, these samples were processed and embedded in liquid paraffin. The paraffinized tissue blocks were sliced using a rotatory microtome into 5 µm-thick slices, deparaffinized, and stained using H&E stains. Finally, these samples were examined using an Olympus ® Hayat and Giaquinta, 1970 Data collection method and statistical analyses After collecting the liver tissue samples from the animals in every group, the samples were homogenized, and the cell-free supernatant was used to determine the activities of enzymes such as pSOD, pCAT, and pMDA based on the processes described in the past ( Ahmed et al. ® ® p Table 1. Alterations in the antioxidant biomarkers and lipid peroxidation/enzymes (mean ± SE) of all the groups.  Group (n = 10) pSOD pCAT pMDA (A) Control  1.966 ± 0.05  0.388 ± 0.03 0.25 ± 0.04 (B) 2% LA(Pb)  1.131 ± 0.05*  0.2451 ± 0.02* 4.1 ± 0.06* (C) 2% LA(Pb)+ Moringin [100 mg/kg/rabbit/daily]  1.791 ± 0.06*  0.3697 ± 0.01 2.2 ± 0.06* *Statistically significant at p *Bold values statistically significant at p Fig. 1. Photomicrographs of H&E-stained livers in the sub-chronic trial at 10× magnification. The livers in Group A were normal, having sinusoidal capillaries and hepatocytes positioned regularly around the central vein. Results Therapeutic efficacy of Moringin and lead acetate (LA)-induced oxidative stress on liver enzymes and biomarkers The findings in this study are described as mean ± SEM. Values showing p p p p p Table 1 Histopathological examinations and lesion scoring of animal Groups A and B In this study, the histological lesions present in the liver tissue samples examined and the findings of all the experiments were compiled. The findings showed that the liver slices extracted from Group A animals displayed a normal level, wherein the tissues showed the presence of normally placed hepatocytes that surrounded the central vein, in addition to general sinusoidal capillaries ( Figs. 1 4 Table 2 Figs. 2A–G 5A–C Table 2 Figs. 3A and B 6A and B Table 2 Discussion In this work, the enzymatic and histological investigations were employed to determine if the extended exposure of the experimental rabbits to Pb had caused liver damage. The findings showed that the Pb-administered rabbits (Group B) had higher levels of pMDA activity ( Table 1 Hasan (2024) Hasan, 2024 Hashim et al. Okediran et al. Mueed et al. Mueed et al. Shalan et al. Shalan, 2024 Figs. 3A and B 6A and B Figs. 2A and G 5A and C Table 2 Sharida et al. Singh et al. Saalu et al. Sharifudin et al. M. oleifera M. oleifera Gurer-Orhan et al. Okediran et al. Borekar et al. Borekar et al. Abdollahi et al. p p Simatupang et al. p p p p Table 2. Sub-chronic lesion scoring for liver tissue obtained from treated and untreated groups. Liver tissue Lesions Cx 2% LA(Pb) 2% LA(Pb)+ Moringin  Perivenous zone Congestion 0.00 0.23 ± 0.01 0.10 ± 0.00 SSD 0.00 0.47 ± 0.01* 0.13 ± 0.01 HHP 0.00 0.45 ± 0.01* 0.10 ± 0.00 HN 0.00 0.45 ± 0.01* 0.09 ± 0.00 C& FD 0.00 0.05 ± 0.01 0.00 ± 0.00 KCPA 0.00 0.3 ± 0.02* 0.09 ± 0.00 Total score of zone  0.00  1.96  0.51  Midzonal Congestion 0.00 0.17 ± 0.01 0.08 ± 0.01 SSD 0.00 0.42 ± 0.01* 0.11 ± 0.01 HHP 0.00 0.21 ± 0.01 0.05 ± 0.01 HN 0.00 0.23 ± 0.01 0.07 ± 0.00 C& FD 0.00 0.01 ± 0.00 0.00 KCPA 0.00 0.18 ± 0.01 0.01 ± 0.00 Total score of zone  0.00  1.22  0.32  Periportal zone Congestion 0.00 0.11 ± 0.0.01 0.08 ± 0.01 SSD 0.00 0.34 ± 0.01* 0.10 ± 0.00 HHP 0.00 0.26 ± 0.01 0.07 ± 0.01 HN 0.00 0.18 ± 0.00 0.02 ± 0.02 C& FD 0.00 0.02 ± 0.00 0.01 ± 0.00 KCPA 0.00 0.19 ± 0.00 0.01 ± 0.01 Total score of zone  0.00  1.10  0.28 Liver total score  0.00  4.29  1.11 SSD: Sinusoidal space dilation, NH: Hepatocellular necrosis, HHP: Hepatocellular hypertrophy, C&FD: Cystic and fatty degeneration, KCPA: Kupffer cells phagocytic activity. Data are expressed as the mean ± SE. * * Fig. 2. (A). Photomicrographs of H&E-stained livers in the sub-chronic trial at 10× magnification. The livers in Group B were abnormal, appeared hepatocellular necrosis, with periductal fibrosis surrounding the bile ducts and severe dilation of sinusoidal spaces. (B). Photomicrographs of H&E-stained livers, at 10× magnification. The livers in Group B were abnormal, the central vein and sinusoidal spaces were severely dilated and congested, while appeared severe steatosis in the centrilobular zone. A huge number of inflammatory cells had infiltrated, especially in the periportal region. (C). Photomicrographs of H&E-stained livers at 20× magnification. The livers in Group B were abnormal, the central vein and sinusoidal spaces were severely dilated and congested, while severe steatosis was in the centrilobular zone. Hepatocellular necrosis was also observed, with periductal fibrosis surrounding the bile ducts. (D). Photomicrographs of H&E-stained livers at 20× magnification. The livers in Group B were abnormal, hepatocellular necrosis was observed, with periductal fibrosis surrounding the bile ducts. A highly infiltrated area of inflammatory cells especially in the periportal region, which formed non-small nodules. (E). Photomicrographs of H&E-stained livers at 40× magnification. The livers in Group B were abnormal, clear ballooned hepatocytes, with Mallory-Denk bodies, and a huge number of inflammatory cells had infiltrated, especially in the periportal region, as well as the Kupffer cells, hypertrophy and hyperplasia. (F). Photomicrographs of H&E-stained livers at 40× magnification. The livers in Group B were abnormal, clear ballooned hepatocytes, with Mallory-Denk bodies, and a huge number of inflammatory cells had infiltrated, especially in the periportal region, as well as periductal fibrosis surrounding the bile ducts. (G). Photomicrographs of H&E-stained livers at 40× magnification. The livers in Group B were abnormal, and hepatocellular necrosis was observed, with periductal fibrosis and clear ballooned hepatocytes, with Mallory-Denk bodies, as well as the Kupffer cells, hypertrophy and hyperplasia. Fig. 3. (A). Photomicrographs of H&E-stained livers in the sub-chronic trial at 20× magnification. The livers in Group C had significantly smaller hepatotoxic lesions with minimal necrotic cells, no cystic or fatty degeneration, and no inflammatory cells infiltrations. (B). Photomicrographs of H&E-stained livers in the sub-chronic trial at 40× magnification. The livers in Group C, a fewer hypertrophic and hyperplastic periportal Kupffer cells and hepatocytes, withminimalwith minimal necrosis, no cystic or fatty degeneration, and no inflammation, despite necrosis and mild congestion. Moringin can therefore counteract the negative effects of Pb-induced liver damage and has a strong protective effect. Fig. 4. TEM. from control group, showing normal appearance of hepatocyte with a euchromatic nucleus (N) as well as developed a nuclear membrane (red head arrow), and the cytoplasim contains normal mitochondria (m), an array of rough endoplasmic reticulum (rER) and smooth endoplasmic reticulum (sER), and normal peroxisome (p). Fig. 5. (A). TEM from the LA-treated group, showing, hepatocytes with intracytoplasmic vacuolization (V), swollen mitochondria (m), electro-dense bodies\\ Mallory bodies (mb)\\(f) and debris of necrotic nuclei, a lot of lysosomes (Ly). (B). TEM from the LA-treated group, showing, hepatocytes with intracytoplasmic vacuolization (V), swollen mitochondria (m), electro-dense bodies\\ Mallory bodies (mb)\\(f) and debris of necrotic nuclei, a lot of lysosomes (Ly). (C). TEM from the LA-treated group, showing, dilatated blood sinusoids (S) with severe hypertrophic Kupffer cells (KC), severe dilated smooth endoplasmic reticulum (sER) and highly proliferation of peroxisome (P), and a higher magnification of cytosol immediately adjacent to the nucleus and collagen fibers adjacent to Kupffer cells. Fig. 6. A and B. TEM from the LA+Moringin group, illustrateing pronounced reduction in the hepatocellular degeneration and necrosis and Kupffer cells hypertrophy with significant diminution in the highly increased amount of sER and peroxisome, normal appearance of hepatocyte with an euchromatic nucleus (N) as well as developed a nuclear membrane (yellow head arrow). Conclusion In summary, findings from this study demonstrated that Moringin, derived from M. oleifera Acknowledgment Thank you toThe author would like to thank the Faculty of Medicine at Universiti Putra Malaysia (UPM) for granting access to all the facilities required to complete this study. Conflicts of interest and funding declaration The manuscript was not funded, and there are no conflicts of interest. Ethical statement The Animal Care and Use Committee (ACUC) of the Faculty of Bio-Medical Science at Universiti Putra Malaysia (UPM) approved this study (UPM/IACUC/AUP-R082/2015). Authors’ contribution The author designed and implemented the research, analysed the results, and wrote the manuscript. References Abd Karim N.A. Adam A.H.B. Jaafaru M.S. Rukayadi Y. Abdull Razis A.F. Apoptotic potential of glucomoringin isothiocyanate (GMG-ITC) isolated from Moringa oleifera J. Mol 2023 28 7 3214 10.3390/molecules28073214 PMC10096378 37049977 Abdelhamid F.M. Mahgoub H.A. Ateya A.I. Ameliorative effect of curcumin against lead acetate–induced hemato-biochemical alterations, hepatotoxicity, and testicular oxidative damage in rats Environ. Sci. Pollut. Res 2020 27 10950 10965 10.1007/s11356-020-07718-3 31953765 Abdollahi M. Moridani M.Y. Aruoma O.I. Mostafalou S. Oxidative stress in aging Oxid. Med. Cell Longev 2014 2014 876834 24803986 10.1155/2014/876834 PMC3997972 Adeyomoye O.I. Olaniyan O.T. Adewumi N. Anyakudo M.M. Honey supplemented with Vitamin C prevents dyslipidaemia and oxidative stress induced by exposure to lead acetate in Wistar rats J. Physiol. Pharmacol 2022 65 4 229 236 Ahmed A.E. Aronson J. Jacob S. Induction of oxidative stress and TNF- α Toxicol. In Vitro 2000 14 3 199 210 10806370 10.1016/s0887-2333(00)00019-9 Amadi C.N. Offor S. J. Frazzoli C. Orisakwe O.E. Natural antidotes and management of metal toxicity. Environ. Sci. Pollut. Res 2019 26 18032 18052 10.1007/s11356-019-05104-2 31079302 Borekar V.I. Somkuwar A.P. Sawarkar A.R. Limsay R.P. Dubey S.A. Umap S.A. Therapeutic effect of Zingiber officinale on serum biochemical parameters in lead intoxicated broiler chickens Int. J. Vet. Sci. Anim. Husb 2024 9 6 231 236 El Kamari F. Chlouchi A. El Hamzaoui N. Harmouzi A. Lhilali I. ElMouhdi K. El Omari H. Abdellaoui A. Chemical composition, antioxidant and antimicrobial activities of the essential oil of origanum majorana growing in middle Atlas of Morocco Trop. J. Nat. Prod. Res 2023 7 10 4232 4237 Gdoura N. Murat J.C. Abdelmouleh A. Elfeki A. Effects of juniperus phoenicea extract on uricemia and activity of antioxidant enzymes in liver, erythrocyte and testis of hyperuricemic (oxonate-treated) rats Afr. J. Pharm. Pharmacol 2013 7 8 416 425 Gurer-Orhan H. Sabır H.U. Özgüneş H. Correlation between clinical indicators of lead poisoning and oxidative stress parameters in controls and lead-exposed workers J. Toxicol 2004 195 2–3 147 154 10.1016/j.tox.2003.09.009 14751670 Hasan M.A. Ultrastructural changes in hepatocytes and chemopreventive effects of short-term administration of curcuma longa L. against oxidative stress-induced toxicity: improvement mechanisms of liver detoxification eCAM 2020 2020 9535731 https://doi.org/10.1155/2020/9535731 32328143 10.1155/2020/9535731 PMC7132359 Hasan M.A. Efficacy of zingiber Officinale (ZO) in The Treatment of Lead Acetate-induced Hepatopathy in Rabbits: an Ultrastructural Assessment of Sub-acute Trial.: Efficacy of Zingiber Officinale (ZO) in the Treatment of Lead Acetate-Induced Hepatopathy in Rabbits Iraq J Pharm Sci 2024 33 2 112 120 Hashim M. Al-Attar A.M. Alomar M.Y. Omar A.M.S. Alkenani N.A. Zeid I.M.A. Alleviation of carbendazim toxicity effect by Moringa oleifera Saudi J. Biol. Sci 2024 31 2 103921 38268782 10.1016/j.sjbs.2023.103921 PMC10806130 Hayat M.A. Giaquinta R. Rapid fixation and embedding for electron microscopy Tissue Cell 1970 2 2 191 195 18631508 10.1016/s0040-8166(70)80015-5 Jomova K. Alomar S.Y. Alwasel S.H. Nepovimova E. Kuca K. Valko M. Several lines of antioxidant defense against oxidative stress: antioxidant enzymes, nanomaterials with multiple enzyme-mimicking activities, and low-molecular-weight antioxidants Arch. Toxicol 2024 98 5 1323 1367 38483584 10.1007/s00204-024-03696-4 PMC11303474 Jomova K. Raptova R. Alomar S.Y. Alwasel S.H. Nepovimova E. Kuca K. Valko M. Reactive oxygen species, toxicity, oxidative stress, and antioxidants: chronic diseases and aging Arch. Toxicol 2023 97 10 2499 2574 37597078 10.1007/s00204-023-03562-9 PMC10475008 Kahalerras L. Otmani I. Abdennour C. The allium triquetrum L. leaves mitigated hepatotoxicity and nephrotoxicity induced by lead acetate in wistar rats Biol. Trace Elem. Res 2022 200 1 11 34978041 10.1007/s12011-021-03052-y Lakka N. Pai B. Mani M.S. Dsouza H.S. Potential diagnostic biomarkers for lead-induced hepatotoxicity and the role of synthetic chelators and bioactive compounds J. Toxicol. Res 2023 12 2 178 188 10.1093/toxres/tfad014 PMC10141777 37125327 Medjedded H. Nemiche S. Nemmiche S. Individual and combined effects of cadmium and lead exposure in rats Int. J. Environ. Health Res 2024 34 7 2649 2660 37797207 10.1080/09603123.2023.2265310 Mesalam N.M. Ibrahim M.A. Mousa M.R. Said N.M. Selenium and vitamin E ameliorate lead acetate-induced hepatotoxicity in rats via suppression of oxidative stress, mRNA of heat shock proteins, and NF-kB production J. Trace Elem. Med. Biol 2023 79 127256 37442019 10.1016/j.jtemb.2023.127256 Mueed A. Shibli S. Jahangir M. Jabbar S. Deng Z. A comprehensive review of flaxseed (Linum usitatissimum L.): health-affecting compounds, mechanism of toxicity, detoxification, anticancer and potential risk Crit. Rev. Food Sci. Nutr 2023 63 32 11081 11104 35833457 10.1080/10408398.2022.2092718 Okediran B.S. Suleiman K.Y. Adah A.S. Sanusi F. Mitigation of lead acetate induced toxicity by ginger (Zingiber officinale) Ann. Clin. Toxicol 2019 2 2 1020 Patil S.V Mohite B.V Marathe K.R. Salunkhe N.S. Marathe V. Patil V.S. Moringa tree, gift of nature: a review on nutritional and industrial potential Curr. Pharmacol. Rep 2022 8 4 262 280 35600137 10.1007/s40495-022-00288-7 PMC9108141 Poli V. Aparna Y. Madduru R. Motireddy S.R. Protective effect of Vitamin C and E on enzymatic and antioxidant system in liver and kidney toxicity of Cadmium in rats J. Appl. Food Res 2022 2 1 100098 Rauf A. Khalil A.A. Awadallah S. Khan S.A. Abu-Izneid T. Kamran M. Wilairatana P. Reactive oxygen species in biological systems: Pathways, associated diseases, and potential inhibitors—a review J. Food Sci. Nutr 2024 12 2 675 693 38370049 10.1002/fsn3.3784 PMC10867483 Saalu L.C. Ogunlade B. Ajayi G.O. Oyewopo A.O. Akunna G.G. Ogunmodede O.S. The hepato-protective potentials of Moringa oleifera Am. J. Biotechnol. Mol. Sci 2012 2 1 6 14 Shalan M.G Al-Bakry N.A. Rashwan H.M. The ameliorative effects of lactoferrin against lead acetate toxicity in female albino rat Egypt. J. Zool 2023 80 80 35 49 Shalan M.G. Mitigating lead acetate-induced histopathologic and physiologic disorders in rats receiving vitamin C and glutathione supplement Heliyon 2024 11 1 e41256 39801977 10.1016/j.heliyon.2024.e41256 PMC11719362 Sharida F. Syazana A.S. Palanisamy A. Moringa oleifera Molecules 2012 17 8334 8350 22781444 10.3390/molecules17078334 PMC6268890 Sharifudin S.A. Fakurazi S. Hidayat M.T. Hairuszah I. Aris Mohd Moklas M. Arulselvan P. Therapeutic potential of Moringa oleifera J. Pharm. Biol 2013 51 3 279 288 10.3109/13880209.2012.720993 23043505 Simatupang M.M. Veronika E. Irfandi A. Azteria V. Potential impacts of lead on health: a review of environmental exposure, population at risk, and toxic effects J. Environ. Health 2024 16 3 277 288 Singh D. Arya P.V. Aggarwal V.P. Gupta R.S. Evaluation of antioxidant and hepatoprotective activities of Moringa oleifera J. Antioxid 2014 3 3 569 591 10.3390/antiox3030569 PMC4665414 26785072 Vo K.H. Nguyen L.H. Nguyen N.L. Phan T.T.N. Zulfiqar N. Hoang T.V. Ha H.A. Screening of jellyfish venom inhibitors from beach morning glory (Ipomoea pes-caprae) against nemopilema nomurai Matrix Sci. Pharma 2024 8 2 24 30 ",
  "metadata": {
    "Title of this paper": "Screening of jellyfish venom inhibitors from beach morning glory (Ipomoea pes-caprae) against nemopilema nomurai",
    "Journal it was published in:": "Open Veterinary Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483381/"
  }
}