{
  "title": "Paper_888",
  "abstract": "pmc Metabolites Metabolites 2273 metabolites metabolites Metabolites 2218-1989 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471728 PMC12471728.1 12471728 12471728 41002998 10.3390/metabo15090614 metabolites-15-00614 1 Review Ethnomedicinal Applications, Phytochemistry, and Pharmacological Properties of Zanthoxylum caribaeum Adou Ahissan Innocent 1 2 † Fleurima Ebed 1 3 † Thesnor Valendy 1 3 Urrutia Ander 4 https://orcid.org/0000-0002-8383-5737 Fournet Alain 5 Sylvestre Marie-Noëlle 2 Sylvestre Muriel 1 https://orcid.org/0000-0001-7574-4977 Benfodda Zohra 3 https://orcid.org/0000-0002-5776-922X Cebrián-Torrejón Gerardo 1 * Ortiz Sergio Academic Editor 1 ahissan.adou@univ-antilles.fr valendy.thesnor@ueh.edu.ht 2 3 zohra.benfodda@unimes.fr 4 5 * gerardo.cebrian-torrejon@univ-antilles.fr † These authors contributed equally to this work. 16 9 2025 9 2025 15 9 497655 614 11 6 2025 30 8 2025 01 9 2025 16 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Zanthoxylum caribaeum Z. caribaeum Z. caribaeum Zanthoxylum caribaeum rutaceae natural products ethnopharmacology metabolomics This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The Rutaceae is a large Family of flowering plants containing at least 150 genera and 1500–2100 species that grow naturally in tropical and subtropical regions [ 1 2 3 4 Zanthoxylum 5 6 xanthon-xylon 7 Zanthoxylum 8 9 10 11 12 Z. caribaeum 2. Nomenclature and Taxonomy The nomenclature and taxonomy of Zanthoxylum Fagara Table 1 Zanthoxylum Fagara Fagara Zanthoxylum 13 14 15 16 16 17 Fagara Zanthoxylum 18 Zanthoxylum Fagara 19 Zanthoxylum Zanthoxylum caribaeum Zanthoxylum 20 Table 1 3. Traditional Uses of Zanthoxylum caribaeum The bark of Zanthoxylum caribaeum 23 24 25 Z. caribaeum 26 27 Z. caribaeum 27 Z. caribaeum Table 2 4. Germination Challenges and Transplanting Strategies for Z. caribaeum Currently, the distribution and abundance of wild Z. caribaeum 30 30 Z. caribaeum 22 22 22 22 22 5. Phytochemical Constituents of Z. caribaeum Zanthoxylum caribaeum 1 2 Figure 1 21 24 31 32 33 Z. caribaeum Table 3 34 Figure 2 Z. caribaeum 35 36 Z. caribaeum’s 35 Z. caribaeum Figure 2 35 Z. caribaeum 64 43 46 66 36 Z. caribaeum 31 75 66 69 Figure 2 Z. caribaeum Z. caribaeum 37 metabolites-15-00614-t003_Table 3 Table 3 Phytochemical screening of aqueous and organic extracts of Z. caribaeum 34 Metabolite Family Extracting Solvent a Me 2 AcOEt EtOH Hex MeOH CH 2 2 Aq Alkaloids − − − − − − − Anthocyanidins − − − − − − − Aurones − − − − − − − Chalcones − − − − − − − Coumarins − − − − − − − Steroids + + + + + ++ − Flavones + + + + + + − Flavonols + + + + + + + Saponins − − − − − − + Condensed tannins − − + − ++ − + Triterpenoids + + + + + + + Xanthones + + + + + + + a 2 2 2 6. Exploring the Bioactive Properties of Z. Caribaeum The biological activities of plants are largely influenced by the presence and composition of secondary metabolites. These organic compounds, produced by plants for various physiological needs such as defense against herbivores, fighting diseases, or attracting pollinators, play a crucial role in their biology and interaction with the environment [ 38 39 Z. caribaeum Table 4 metabolites-15-00614-t004_Table 4 Table 4 Biological activities of metabolites from Z. caribaeum Compounds Family Biological Activities Plant Part Reference   Leishmanicidal Stem bark [ 32 Canthin-6-one ( 1 Alkaloid Trypanosomalactivity Stem bark [ 28   Antifungal activity Stem bark [ 40   Leishmanicidal Stem bark [ 32 5-methoxycanthin-6-one ( 2 Alkaloid Trypanosomal Stem bark [ 28   Antifungal activity Stem bark [ 40 Canthin-6-one-N- oxyde ( 3 Alkaloid Trypanosomal activity Stem bark [ 28 Chelerythrine ( 5 Quinolone Not specified Root [ 21 33 Skimmianine ( 6 Quinolone Not specified Root [ 21 41 Neoacutifolidine ( 7 Quinolone Not specified Leaves [ 31 Acutifoline ( 8 Quinolone Not specified Leaves [ 31 Acutifolidine ( 9 Quinolone Not specified Leaves [ 31 O-methylacutifoline ( 10 Quinolone Not specified Leaves [ 31 Acutifolidine palmitate ( 11 Quinolone Not specified Leaves [ 31 Umbelliforine ( 12 Coumarin Antiproliferative Root bark [ 18 Trans-avicennol ( 14 Coumarin Antiproliferative Root bark [ 29 6.1. Antioxidant Activities of Z. caribaeum The antioxidant properties of the essential oil from the leaves of Z. caribaeum 50 42 43 Z. caribaeum 50 34 Table 5 44 metabolites-15-00614-t005_Table 5 Table 5 Antioxidant activity of aqueous and organic solvent extracts from the leaves of Z. caribaeum 34 Extracting Solvent Test Solution a % Capture DPPH b IC 50 c EtOH 71.\n12 24.39 Me 2 66.16 29.67 MeOH 61.99 27.98 A C 48.56 29.67 BHT (positive control) 92.80 7.93 a t 2 C b c Z. caribaeum 6.2. Leishmanicidal Activity of Z. caribaeum In 2002, Ferreira et al. evaluated the leishmanicidal in vitro Z. caribaeum 1 2 Z. caribaeum 1 32 Table 6 Z. caribaeum 1 2 Leishmania Serna et al. [ 45 Z. caribaeum 6.3. Antichagasic Effects of Z. caribaeum Against Trypanosoma cruzi According to the World Health Organization’s (WHO) estimates in 2022, 6 to 7 million people were infected worldwide with Trypanosoma cruzi. 46 Z. caribaeum 1 2 N 3 1 1 Table 7 28 Ferreira et al. examined the trypanocidal activity of extracts from Z. caribaeum 1 2 In the in vitro test against the trypomastigote form, they found that the ethanolic leaf extract and canthin-6-one ( 1 1 Canthin-6-one ( 1 2 For the in vivo test, the authors showed that, at doses of 10 mg/kg, the ethanolic extract of Z. caribaeum 47 Bilbao et al. also examined the trypanocidal activity of chloroform extracts from Z. caribaeum 50 48 6.4. Antimicrobial Activities of Z. caribaeum The dichloromethane extract from the bark of Z. caribaeum Candida albicans Aspergillus fumigatus Trichophyton mentagrophytes 1 2 1 2 40 Table 8 1 2 40 The antifungal activity of the ethanolic extract of Z. caribaeum 49 Z. caribaeum 50 Ortega-Buitrago et al. explored antimicrobial activity using an in vitro test of the ethanolic extract of the leaves and bark of Z. caribaeum S. aureus S. mutans E. coli Morganella morganii Z. caribaeum S. aureus S. mutans E. coli M. morganii 51 In addition, Chaves-Bedoya et al. evaluated the antibacterial activity of ethanol extracts from Z. caribaeum Burkholderia glumae Z. caribaeum B. glumae 52 6.5. Acaricidal Activity of Z. caribaeum Nogueira et al. examined the acaricidal activity of Z. caribaeum Rhipicephalus microplus 53 Souza et al. also examined the acaricidal activity of acetone, ethanol, and methanol extracts from Z. caribaeum D. gallinae D. gallinae 34 6.6. Antimalarial Activity of Z. caribaeum Cebriàn-Torrejòn et al. reported the in vitro antimalarial activity of dichloromethane, ethanolic, and methanolic extracts of Z. caribaeum 14 1 2 P. falciparum 50 50 54 The antimalarial activities measured following [3H]-hypoxanthine incorporation were confirmed [ 54 Table 9 14 1 2 Z. caribaeum metabolites-15-00614-t009_Table 9 Table 9 IC 50 Z. caribaeum 54 Compounds P. falciparum 50 F32 K1 PFB FcB1 Trans-avicennol (1) 0.5 2.7 1.2 2.2 Canthin-6-one (2) 2.0 5.3 3.2 4.0 5-methoxycanthin-6-one (3) 10.4 5.1 Nt b Nt  Extracts DCM 8.9 8.9 Nt Nt EtOH 10.5 9.3 Nt Nt MeOH 89.5 >100 Nt Nt Chloroquine a 2.6 77.4 27.8 62.8 a b 6.7. Anti-Inflammatory Activity of Z. caribaeum In 2005, Márquez et al. evaluated the in vivo anti-inflammatory activity of the ethanolic extract of Z. caribaeum 25 Villalba et al. also evaluated the anti-inflammatory activity of hexane, ethyl acetate, and ethanol extracts of Z. caribaeum 55 6.8. Antiproliferative Activity of Z. caribaeum Cebrián-Torrejòn et al. examined the antiproliferative activity of a methanol extract of Z. caribaeum 14 14 29 6.9. Effects Against Cardiovascular Disease In 2017, Domanech-Carbo et al. showed how canthin-6-one ( 1 56 2+ 1 1 6.10. Larvicidal Activity In 2009, Sanabria et al. conducted biological tests on aqueous extracts of Z. caribaeum Aedes aegypti Z. caribaeum 57 7. Toxicological Aspects of Z. caribaeum Nogueria et al. conducted studies on the toxicological effects of essential oil from the leaves of Z. caribaeum Rhodnius prolixus 2 58 Cebrián-Torrejòn et al. also tested the toxicity in human fetal cells of dichloromethane and ethanol extracts, as well as canthin-6-one ( 1 14 Z. caribaeum 14 50 1 50 50 54 8. Conclusions and Perspectives Zanthoxylum caribaeum Acknowledgments First of all, we would like to thank the European Regional Cooperation Fund Interreg Caribbean V (Project CARIBPHLORE) for funding. This work was supported by a grant from Ministère de l’Enseignement Supérieur et de la Recherche scientifique de Côte d’Ivoire A.I.A). We gratefully thank the Embassy of France in Haiti, the Agence Universitaire de la Francophonie, the Banque de la République d’Haïti, for the financial support for E.F. and V.T. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, G.C.-T., Z.B., M.S. and M.-N.S.; writing—original draft preparation, A.I.A., E.F., V.T. and A.U.; writing—review and editing, A.F.; funding acquisition, G.C.-T. and Z.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Rohwer J.G. Kubitzki K. Rohwer J.G. Bittrich V. The Families and Genera of Vascular Plants Springer Berlin/Heidelberg, Germany 1993 2. Simpson M.G. Plant Systematics Elsevier Amsterdam, The Netherlands 2019 978-0-12-812628-8 3. Fournet J. Flore Illustrée des Phanérogames de Guadeloupe & Martinique 1st ed. INRA Édition Gondwana CIRAD Paris, France 2002 Volume 2 4. Morton C.M. Telmer C. New Subfamily Classification for the Rutaceae Ann. Mo. Bot. Gard. 2014 99 620 641 10.3417/2010034 5. Reichelt N. Wen J. Pätzold C. Appelhans M.S. Target Enrichment Improves Phylogenetic Resolution in the Genus Zanthoxylum (Rutaceae) and Indicates Both Incomplete Lineage Sorting and Hybridization Events Ann. Bot. 2021 128 497 510 10.1093/aob/mcab092 34250543 PMC8414929 6. Orel H.K. McLay T.G.B. Neal W.C. Forster P.I. Bayly M.J. Plastid Phylogenomics of the Eriostemon Group (Rutaceae; Zanthoxyloideae): Support for Major Clades and Investigation of a Backbone Polytomy Aust. Syst. Bot. 2023 36 355 385 10.1071/SB23011 7. Heywood V.H. Les Plantes à Fleurs Nathan Paris, France 1996 8. Bourlière F. Mabberley D.J. The Plant Book. A Portable Dictionary of the Higher Plants Revue d’Écologie (La Terre et La Vie) Cambridge University Press Cambridge, UK 1987 Volume 3 198 199 9. Waterman P.G. New Combinations in Zanthoxylum L. (1753) Taxon 1975 24 361 366 10.2307/1218347 10. Wen J. Xiang Q. Guo J. Zhang J. Yang N. Huang Y. Chen Y. Hu T. Rao C. Pharmacological Activities of Zanthoxylum L. Plants and Its Exploitation and Utilization Heliyon 2024 10 e33207 10.1016/j.heliyon.2024.e33207 39022083 PMC11252797 11. Appelhans M.S. Reichelt N. Groppo M. Paetzold C. Wen J. Phylogeny and Biogeography of the Pantropical Genus Zanthoxylum and Its Closest Relatives in the Proto-Rutaceae Group (Rutaceae) Mol. Phylogenet. Evol. 2018 126 31 44 10.1016/j.ympev.2018.04.013 29653175 12. Engler A. Rutaceae Naturlichen Pflanzenfamilie III Engelmann Leipzig, Germany 1896 Volume 4 95 13. Beurton C. Gynoecium and Perianth in Zanthoxylum Sl (Rutaceae) Plant Syst. Evol. 1994 189 165 191 10.1007/BF00939724 14. Brizicky G.K. Taxonomic and Nomenclatural Notes on Zanthoxylum and Glycosmis (Rutaceae) J. Arnold Arbor. 1962 43 80 93 10.5962/bhl.part.20435 15. Brizicky G.K. The Genera of Rutaceae in the Southeastern United States J. Arnold Arbor. 1962 43 1 22 10.5962/bhl.part.20434 16. Hartley T.G. A Revision of the Malesian Species of Zanthoxylum (Rutaceae) J. Arnold Arbor. 1966 47 171 221 10.5962/p.33416 17. Fish F. Gray A.I. Waterman P.G. Alkaloids and Coumarins of Zanthoxylum Elephantiasis [Proceedings] J. Pharm. Pharmacol. 1976 28 69P 12347 18. Zepernick B. Timler F.K. Zanthoxylum Zanthoxyloides (Lam.) Zepernick and Timler Comb. nova (Rutaceae) Willdenowia 1981 11 361 362 19. Escalante M.G. El Género Fagara En La Argentina Bol. Soc. Argent. Bot. 1961 9 291 317 20. Museum National d’Histoire Zanthoxylum Caribaeum Lam 1786 Available online: https://inpn.mnhn.fr/espece/cd_nom/630913 (accessed on 7 July 2024) 21. Diehl E.E. von Poser G.L. Henriques A.T. Constituents of Zanthoxylum Rugosum St.-Hil & Tul Biochem. Syst. Ecol. 2000 28 275 277 10.1016/s0305-1978(99)00030-7 22. Spichiger, R.; Stutz de Ortega, L. Flora de Paraguay: Rutaceae; Missouri Botanical Garden: St. Louis, MO, USA, 1987 23. Schnee L. Plantas Comunes de Venezuela Universidad Central de Venezuela Caracas, Venezuela 1973 24. Soriano-Agatón F. Lagoutte D. Poupon E. Roblot F. Fournet A. Gantier J.-C. Hocquemiller R. Extraction, Hemisynthesis, and Synthesis of Canthin-6-One Analogues. Evaluation of Their Antifungal Activities J. Nat. Prod. 2005 68 1581 1587 10.1021/np050250z 16309303 25. Márquez L. Agüero J. Hernández I. Garrido G. Martínez I. Diéguez R. Prieto S. Rivas Y. Molina-Torres J. Curini M. Anti-Inflammatory Evaluation and Phytochemical Characterization of Some Plants of the Zanthoxylum Genus Acta Farm. Bonaer. 2005 24 325 26. Cheng M.-J. Wu C.-C. Tsai I.-L. Chen I.-S. Chemical and Antiplatelet Constituents from the Stem of Zanthoxylum Beecheyanum J. Chin. Chem. Soc. 2004 51 1065 1072 10.1002/jccs.200400159 27. Mutinda E.S. Kimutai F. Mkala E.M. Waswa E.N. Odago W.O. Nanjala C. Ndungu C.N. Gichua M.K. Njire M.M. Gituru R.W. Ethnobotanical Uses, Phytochemistry and Pharmacology of Pantropical Genus Zanthoxylum L. (Rutaceae): An Update J. Ethnopharmacol. 2023 303 115895 10.1016/j.jep.2022.115895 36513263 28. Ferreira M.E. Nakayama H. de Arias A.R. Schinini A. de Bilbao N.V. Serna E. Lagoutte D. Soriano-Agatón F. Poupon E. Hocquemiller R. Effects of Canthin-6-One Alkaloids from Zanthoxylum Chiloperone on Trypanosoma Cruzi-Infected Mice J. Ethnopharmacol. 2007 109 258 263 10.1016/j.jep.2006.07.028 16949231 29. Cebrián-Torrejón G. Assad Kahn S. Lagarde N. Castellano F. Leblanc K. Rodrigo J. Molinier-Frenkel V. Rojas de Arias A. Ferreira M.E. Thirant C. Antiproliferative Activity of Trans Zanthoxylum Chiloperone Angustifolium against Human Cancer Stem Cells. J. Nat. Prod. 2012 75 257 261 10.1021/np2004165 22304006 30. Rollet B. Fiard J.P. Huc R. Arbres des Petites Antilles Office National des Forêts (ONF) Maisons-Alfort, France 2010 31. Arruda M.S.P. Fernandes J.B. da Silva M.F.G.F. Vieira P.C. Pirani J.R. Quinolone Alkaloids from Zanthoxylum Acutifolium Phytochemistry 1992 31 3617 3619 10.1016/0031-9422(92)83738-K 32. Ferreira M.E. Rojas de Arias A. Torres de Ortiz S. Inchausti A. Nakayama H. Thouvenel C. Hocquemiller R. Fournet A. Leishmanicidal Activity of Two Canthin-6-One Alkaloids, Two Major Constituents of Zanthoxylum Chiloperone Var. Angustifolium J. Ethnopharmacol. 2002 80 199 202 10.1016/S0378-8741(02)00025-9 12007711 33. Krane B.D. Fagbule M.O. Shamma M. Gözler B. The Benzophenanthridine Alkaloids J. Nat. Prod. 1984 47 1 43 10.1021/np50031a001 34. Souza J.G.D.L.D. Pinto F.G.D.S. Toledo A.G. Alves L.F.A. Alves D.S. Biological Activities and Phytochemical Screening of Leaf Extracts from Zanthoxylum Caribaeum L. (Rutaceae) Biosci. J. 2020 36 223 234 10.14393/BJ-v36n1a2020-48051 35. Farouil L. Dias R.P. Popotte-Julisson G. Bibian G. Adou A.I. de la Mata A.P. Sylvestre M. Harynuk J.J. Cebrián-Torrejón G. The Metabolomic Profile of the Essential Oil from Zanthoxylum Caribaeum (Syn. Chiloperone) Growing in Guadeloupe FWI Using GC × GC-TOFMS Metabolites 2022 12 1293 10.3390/metabo12121293 36557331 PMC9782392 36. Guy I. Charles B. Guinaudeau H. Ferreira M.E. Rojas De Arias A. Fournet A. Essential Oils from Zanthoxylum Chiloperone and Z Riedelianum Growing in Paraguay. Pharm. Biol. 2001 39 152 154 10.1076/phbi.39.2.152.6255 37. Nooreen Z. Tandon S. Yadav N.P. Kumar P. Xuan T.D. Ahmad A. Zanthoxylum: A Review of Its Traditional Uses, Naturally Occurring Constituents and Pharmacological Properties Curr. Org. Chem. 2019 23 1307 1341 10.2174/1385272823666190528072011 38. Lv J. Yang S. Zhou W. Liu Z. Tan J. Wei M. Microbial Regulation of Plant Secondary Metabolites: Impact, Mechanisms and Prospects Microbiol. Res. 2024 283 127688 10.1016/j.micres.2024.127688 38479233 39. Thesnor V. Molinié R. Giebelhaus R.T. de la Mata Espinosa A.P. Harynuk J.J. Bénimélis D. Vanhoye B. Dunyach-Rémy C. Sylvestre M. Cheremond Y. Antibacterial Activity and Untargeted Metabolomics Profiling of Acalypha Arvensis Poepp Molecules 2023 28 7882 10.3390/molecules28237882 38067611 PMC10708339 40. Thouvenel C. Gantier J.-C. Duret P. Fourneau C. Hocquemiller R. Ferreira M.-E. de Arias A.R. Fournet A. Antifungal Compounds from Zanthoxylum Chiloperone Var. Angustifolium Phytother. Res. 2003 17 678 680 10.1002/ptr.1137 12820240 41. Couillerot E. Caron C. Comoe L. Audran J.-C. Molinatti P. Zeches M. Le Men-Olivier L. Jardillier J.-C. Chenieux J.-C. Benzophenanthridine and Furoquinoline Accumulation in Cell Suspension Cultures of Fagara Zanthoxyloides Phytochemistry 1994 37 425 428 10.1016/0031-9422(94)85072-0 42. De Lara De Souza J.G. Toledo A.G. Walerius A.H. Jann Favreto W.A. Da Costa W.F. Da Silva Pinto F.G. Chemical Composition, Antimicrobial, Repellent and Antioxidant Activity of Essential Oil of Zanthoxylum Caribaeum J. Essent. Oil Bear. Plants 2019 22 380 390 10.1080/0972060X.2019.1571444 43. Sikkema J. De Bont J.A. Poolman B. Interactions of Cyclic Hydrocarbons with Biological Membranes J. Biol. Chem. 1994 269 8022 8028 10.1016/S0021-9258(17)37154-5 8132524 44. Shahidi F. Janitha P.K. Wanasundara P.D. Phenolic Antioxidants Crit. Rev. Food Sci. Nutr. 1992 32 67 103 10.1080/10408399209527581 1290586 45. Elva S. Marisel M. Nilsa G. Determination of the in Vivo Activity of Leaves Extract of Zanthoxylum Chiloperone Var. Angustifolium (Tembetary Hú) Orally and Intralesionally Administered to BALB/c Mice Experimentally Infected with Leishmania Arch. Cancer Sci. Ther. 2022 6 038 043 10.29328/journal.acst.1001032 46. Rassi A. de Rezende J.M. American Trypanosomiasis (Chagas Disease) Infect. Dis. Clin. 2012 26 275 291 10.1016/j.idc.2012.03.002 22632639 47. Ferreira M.E. Cebrián-Torrejón G. Corrales A.S. de Bilbao N.V. Rolón M. Gomez C.V. Leblanc K. Yaluf G. Schinini A. Torres S. Zanthoxylum Chiloperone Leaves Extract: First Sustainable Chagas Disease Treatment J. Ethnopharmacol. 2011 133 986 993 10.1016/j.jep.2010.11.032 21134431 48. de Bilbao N.V. Giebelhaus R.T. Dias R.P. Ferreira M.E. Martínez M. Velasco-Carneros L. Nam S.L. de la Mata A.P. Maréchal J.-D. Adou A.I. Exploring the Anti-Chagas Activity of Zanthoxylum Chiloperone’s Seedlings Through Metabolomics and Protein–Ligand Docking Plants 2025 14 954 10.3390/plants14060954 40265836 PMC11946004 49. Diéguez-Hurtado R. Garrido-Garrido G. Prieto-González S. Iznaga Y. González L. Molina-Torres J. Curini M. Epifano F. Marcotullio M.C. Antifungal Activity of Some Cuban Zanthoxylum Species Fitoterapia 2003 74 384 386 10.1016/S0367-326X(03)00048-0 12781811 50. Cornejo-Garrido J. Salinas-Sandoval M. Díaz-López A. Jácquez-Ríos P. Arriaga-Alba M. Ordaz-Pichardo C. In Vitro and in Vivo Antifungal Activity, Liver Profile Test, and Mutagenic Activity of Five Plants Used in Traditional Mexican Medicine Rev. Bras. Farmacogn. 2015 25 22 28 10.1016/j.bjp.2014.12.003 51. Ortega-Buitrago O. Chaves-Bedoya G. Ortiz-Rojas L.Y. Chemical Composition and Antimicrobial Activity of Ethanolic Bark and Leave Extract of Zanthoxylum Caribaeum Lam. from Norte de Santander, Colombia Rev. Chim. 2021 72 152 161 10.37358/RC.21.4.8464 52. Chaves-Bedoya G. Vera E.J. Ortiz-Rojas L.Y. Phytochemical Characterization of Ethanolic Extracts of the Leaves of Zanthoxylum Caribaeum Lam and Evaluation of Antimicrobial Activity Against Burkholderia Glumae Rev. Chim. 2022 73 51 61 10.37358/RC.22.1.8502 53. Nogueira J. Vinturelle R. Mattos C. Tietbohl L.A.C. Santos M.G. Da Silva Vaz I. Mourão S.C. Rocha L. Folly E. Acaricidal Properties of the Essential Oil from Zanthoxylum Caribaeum against Rhipicephalus Microplus J. Med. Entomol. 2014 51 971 975 10.1603/ME13236 25276925 54. Cebrian-Torrejon G. Spelman K. Leblanc K. Munoz-Durango K. Gutierrez S.T. Ferreira M.E. de Arias A.R. Figadere B. Fournet A. Maciuk A. The Antiplasmodium Effects of a Traditional South American Remedy: Zanthoxylum Chiloperone Var. Angustifolium against Chloroquine Resistant and Chloroquine Sensitive Strains of Plasmodium Falciparum Rev. Bras. Farmacogn. 2011 21 652 661 10.1590/S0102-695X2011005000104 55. Villalba M.A. Carmo M.I. Leite M.N. Sousa O.V. Atividades farmacológicas dos extratos de Zanthoxylum chiloperone (Rutaceae) Rev. Bras. Farmacogn. 2007 17 236 241 10.1590/S0102-695X2007000200018 56. Doménech-Carbó A. Rodrigo R. Maréchal J.-D. Poupon E. Fournet A. Figadère B. Cebrián-Torrejón G. Bioelectrochemical Monitoring of Soluble Guanylate Cyclase Inhibition by the Natural β-Carboline Canthin-6-One J. Mol. Struct. 2017 1134 661 667 10.1016/j.molstruc.2016.12.016 57. Sanabria L. Segovia E.A. González N. Alcaraz P. Vera de Bilbao N. Larvicidal Activity of Aqueous Plants Extracts on Aedes Aegypti Larva (First Trials) Mem. Inst. Investig. Cienc. Salud 2009 7 26 31 58. Nogueira J. Mourão S.C. Dolabela I.B. Santos M.G. Mello C.B. Kelecom A. Mexas R. Feder D. Fernandes C.P. Gonzalez M.S. Zanthoxylum Caribaeum (Rutaceae) Essential Oil: Chemical Investigation and Biological Effects on Rhodnius Prolixus Nymph Parasitol. Res. 2014 113 4271 4279 10.1007/s00436-014-4105-4 25224729 Figure 1 Chemical structures of non-volatile compounds isolated from Zanthoxylum caribaeum 1 2 N 3 4 5 6 7 8 9 10 11 12 13 14 15 Figure 2 Chemical structures of volatile compounds isolated from Zanthoxylum caribaeum 16 17 18 19 20,21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 (50), 51 52 cis 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 metabolites-15-00614-t001_Table 1 Table 1 Synonyms of Zanthoxylum caribaeum Name Reference Fagara caribaea [ 3 Fagara [ 21 Fagara chiloperone angustifolia [ 22 Zanthoxylum chiloperone [ 21 Zanthoxylum chiloperone angustifolium [ 22 Zanthoxylum rugosum A [ 21 Zanthoxylum aromaticum [ 3 metabolites-15-00614-t002_Table 2 Table 2 Global ethnobotanical applications of Z. caribaeum Part Used Country Traditional References Root bark Paraguay, Cuba Antirheumatic [ 25 28 Stem bark, leaves Paraguay Skin diseases [ 24 27 Stem bark Paraguay Emmenagogue [ 29 Stem bark Paraguay Antimalarial [ 29 Root bark Paraguay Anticancer [ 29 Stem bark Cuba Antiasthmatic [ 25 27 Stem bark Cuba Anti-ulcer [ 25 27 Leaves Latin America Stomach ailments [ 27 metabolites-15-00614-t006_Table 6 Table 6 In vitro Z. caribaeum 1 2 Leishmania 32 Extract and Compound  L. braziliensis  L. amazonensis  L. donovani N >100 >100 >100 Pentamidine a 5 5 5 Alkaloidal extract (CH 2 2 100 100 100 Methanolic extract >100 >100 >100 Canthin-6-one 100 100 100 5-methoxycanthin-6-one 100 100 100 a metabolites-15-00614-t007_Table 7 Table 7 Cure rates in mice presenting Trypanosoma cruzi 1 2 N 3 Zanthoxylum caribaeum 28 Treatment n b Negative Parasitaemia/Number of Survivors (Days Post-Infection) Post-Infection Time 0 Days 18 Days 32 Days 45 Days 56 Days 68 Days Control 20 0/19 4/17 6/14 0/12 3/11 Benznidazole 20 14/20 12/20 10/19 11/19 17/19 1 oral 20 5/20 11/20 15/20 17/20 19/20 1 s.c 21 6/21 6/21 12/21 10/21 19/21 2 oral 9 8/9 2/7 1/7 4/7 3/7 2 s.c. a 8 6/8 5/8 3/8 4/8 6/8 3 orally administered 10 0/10 0/7 0/6 6/6 6/6 Crude Zanthoxylum caribaeum 12 1/12 0/10 5/9 5/9 8/9 Crude Zanthoxylum caribaeum 12 1/11 1/11 10/11 10/11 5/10 a b n metabolites-15-00614-t008_Table 8 Table 8 Antifungal activity of canthin-6-one ( 1 2 40 Species Canthin-6-One 5-Methoxycanthin-6-One Ketoconazole  Candida albicans 56.1 190.3 46  Candida glabrata 12.8 90.8 5.3  Candida tropicalis 12.8 45.4 5.3  Aspergillus fumigatus 56.1 97.5 45.9  Aspergillus niger 12.8 22.7 5.3  Aspergillus terreus 12.8 >181.6 5.3  Cryptococcus neoformans 12.8 45.4 5.3  Geotrichum candidum 12.8 >181.6 5.3  Saccharomyces cerevisiae 12.8 >181.6 5.3 Trichophyton mentagrophytes interdigitale >216.2 12.3 5.8  Trichosporon beigelii 12.8 22.7 5.3  Trichosporon cutaneum 12.8 90.8 5.3 ",
  "metadata": {
    "Title of this paper": "Zanthoxylum Caribaeum (Rutaceae) Essential Oil: Chemical Investigation and Biological Effects on Rhodnius Prolixus Nymph",
    "Journal it was published in:": "Metabolites",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471728/"
  }
}