{
  "title": "Paper_912",
  "abstract": "pmc Life (Basel) Life (Basel) 2582 life life Life 2075-1729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471311 PMC12471311.1 12471311 12471311 41010395 10.3390/life15091453 life-15-01453 1 Review Cutaneous and Lymphangitic Infection Caused by Purpureocillium lilacinum https://orcid.org/0000-0002-3865-9519 Lupia Tommaso 1 * † Sarda Cristina 2 † Canta Francesca 1 https://orcid.org/0009-0002-7352-5353 Casarotto Marco 3 Accardo Guido 3 https://orcid.org/0000-0001-7126-5506 Roccuzzo Gabriele 2 https://orcid.org/0000-0002-0097-2139 Macagno Nicole 2 Gelato Federica 2 https://orcid.org/0000-0001-8419-4591 Senetta Rebecca 4 Ottobrelli Antonio 5 https://orcid.org/0000-0001-8338-0130 De Rosa Francesco Giuseppe 3 Corcione Silvia 3 https://orcid.org/0000-0002-0098-1406 Ribero Simone 2 Quaglino Pietro 2 Fava Paolo 2 Kolář Milan Academic Editor 1 2 3 4 5 * tommaso.lupia89@gmail.com † Shared first authorship. 17 9 2025 9 2025 15 9 497651 1453 31 7 2025 03 9 2025 08 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Purpureocillium lilacinum P. lilacinum Paecilomyces lilacinus P. lilacinum P. lilacinum P. lilacinum P. lilacinum Purpureocillium lilacinum Paecilomyces lilacinus liver transplant immunocompromised patients This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Purpureocillium lilacinum P. lilacinum Paecilomyces lilacinus 1 P. lilacinum 2 P. lilacinum 3 2 P. lilacinum P. liliacinum 4 P. lilacinum 5 P. lilacinum 4 Purpureocillium lilacinum 6 7 8 P. lilacinum Purpureocillium lilacinum 9 4 10 P. liliacinum 2. Materials and Methods The current narrative review followed the Scale for the Assessment of Narrative Review Articles (SANRA) flow-chart [ 11 Figure 1 The main aim of this work was to summarise current evidence on cutaneous Purpureocillium lilacinum Purpureocillium lilacinum Purpureocillium lilacinum 3. Case Report A 61-year-old female patient was referred to our department for the presence of erythematous-papulo-nodular lesions on her right leg, as reported in Figure 2 She had a history of orthotopic liver transplant (OLT) because of autoimmune hepatitis. She underwent a first OLT in 2005 and subsequently a second OLT in 2010 for a graft failure. A third transplant was completed in 2019 for a new graft failure, and the patient was maintained on an immunosuppressive regimen with tacrolimus, mycophenolate mofetil, and oral steroids (i.e., prednisone 10 mg q24h). At the presentation, the patient complained about loss of weight (i.e., about 10 Kg in the last 12 months) and low-grade fever. The lesions were previously diagnosed as cutaneous herpes zoster, and the patient received a seven-day course of oral valacyclovir treatment (i.e., 1 g every 8 h) without improvement. Over the following weeks, lesions gradually spread to form dark violet papulo-nodular elements, some covered by sero-hemorrhagic crusts. Diffuse soft tissue swelling and redness, referred to as lymphedema, were associated with the lesions, as reported in Figure 3 Patient denied history of a recent trip abroad, animal bites, or tick exposure. Moreover, the patient reported that she lives in the countryside, owns two cats, and loves gardening. She reported a probable skin trauma on her right leg while gardening, some weeks before hospital admission. An empiric antibiotic therapy with doxycycline was started, according to the hypothesis of bacillary angiomatosis, with minimal improvement. Bartonella henselae Human Herpesvirus 8 Mycobacterium tuberculosis Cryptococcus 9 P. lilacinum Figure 4 Antifungal susceptibility tests were not performed. The patient was hospitalised and treatment with terbinafine 250 mg/day plus voriconazole 400 mg/day was administered, with serial azole therapeutic drug monitoring (TDM) due to advanced cirrhosis. CT chest, nasal endoscopy, and blood cultures excluded secondary localisations. Therapy was continued based on clinical response and the reduction in Beta-D-glucan serum levels. Therapy with Voriconazole and terbinafine was withdrawn after nine months, following complete clinical response and healing of the lesions ( Figure 5 Therapy with voriconazole and terbinafine was administered for a total of 9 months, with progressive resolution of the skin lesions. 4. Results The search strategy identified 185 articles, of which 21 studies were included for the final analysis, with a total of 21 patients, and the data are shown in Table 1 Most of the patients were male (16–76.2%), with a median age of 59 years (range 28–84). Regarding risk factors for fungal infections, frequently reported conditions were steroid use (9–40.9%) and solid organ transplantation (9–40.9%), followed by haematological disorders (3–13.6%). One case involved a patient living with HIV. The majority of patients had no history of exposure or hobbies previously associated with Purpureocillium lilacinum More frequently, patients presented with nodular lesions (10–45.4%) or papules/pustules (9–40.9%). Three cases presented with erythematous purpuric plaques (13.6%), and one case reported another type of skin manifestation (0.5%). Painful lesions were reported in around half of the patients (10–45.5%), in nine cases the skin manifestations were painless (40.9%), and in three cases it was not reported. Regarding therapy, all patients received azoles at a certain point of the treatment (22–100%). Other molecules prescribed were liposomal amphotericin B (4–18.1%) and echinocandins (3–13.6%). Terbinafine was prescribed in three cases (13.6%), always in combination with azoles. In two cases, a surgical debridement of the skin lesion was performed (9%). We found that in 11 cases, patients suffered from local dissemination of infection (50%), and in 5 cases (22.7%), they suffered from systemic involvement. Three patients died before completing treatment (13.6%). Data described in the studies reviewed are summarised in Table 2 5. Discussion In this study we have reported a case of P. lilacinum P. lilacinum P. lilacinum. 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 P. lilacinum 1 4 3 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 Similarly to other fungal infections, immunocompromised patients are at higher risk of P. lilacinum P. lilacinum 4 P. lilacinum 7 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 P. lilacinum 9 Moreover, molecular identification nowadays plays an important role in species identification. P. lilacinum Paecilomyces 1 9 10 There has been no standard of care established up to now, besides that voriconazole or posaconazole should be a reasonable first-line treatment. Terbinafine was reported as a sparring treatment in combination with azoles in the literature reviewed [ 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 9 10 Although 37% of patients have been treated with combination therapy in the literature, there is insufficient data to determine whether this is superior to monotherapy. The optimal duration of treatment remains undefined, and surgical debridement should be considered when feasible. Infections in immunocompromised patients are particularly challenging, and current evidence is insufficient to clearly identify the lesion characteristics that indicate resolution of the infectious process. Therefore, based on the available literature, it appears reasonable to continue treatment until all lesions have completely resolved. Resolution or improvement of immunosuppression and surgical source control improve the efficacy of medical treatment [ 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 Recently, new antifungals have been studied. Ibrexafungerp is the first representative of a novel class of structurally distinct glucan synthase inhibitors: triterpenoids. Although it has shown excellent activity in vitro against Candida Aspergillus P. lilacinum 34 P. lilacinum 35 P. lilacinum P. variotii 34 P. lilacinum In conclusion, the review emphasises the critical need for early diagnosis and appropriate antifungal treatment, particularly in high-risk patients, accompanied by surgical debridement when feasible. Data on treatment duration and the superiority of combination therapy with respect to monotherapy are lacking, despite the fact that new, recently approved antifungals present efficacy and safety profiles that are promising for the treatment of this rare infection. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, T.L., C.S. and P.F.; methodology, M.C. and G.A.; formal analysis, C.S., M.C., G.A. and T.L.; investigation and data curation, A.O., F.C., G.R., N.M., F.G. and R.S.; writing—original draft preparation, C.S., M.C., G.A. and T.L.; writing—review and editing, P.F., C.S., M.C., G.A. and T.L.; supervision, F.G.D.R., P.Q., S.R. and S.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical review and approval were waived for this study due to the narrative structure of the article, and informed consent for the patient was obtained. Informed Consent Statement Informed consent has been obtained from the patient. Data Availability Statement Data are available upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Luangsa-Ard J. Houbraken J. van Doorn T. Hong S.B. Borman A.M. Hywel-Jones N.L. Samson R.A. Purpureocillium, a New Genus for the Medically Important Paecilomyces lilacinus FEMS Microbiol. Lett. 2011 321 141 149 10.1111/j.1574-6968.2011.02322.x 21631575 2. Nnadi N.E. Carter D.A. Climate Change and the Emergence of Fungal Pathogens PLoS Pathog. 2021 17 e1009503 10.1371/journal.ppat.1009503 33914854 PMC8084208 3. Heutte N. André V. Dubos Arvis C. Bouchart V. Lemarié F. Legendre P. Votier E. Louis M.Y. Madelaine S. Séguin V. Assessment of multi-contaminant exposure in a cancer treatment center: A 2-year monitoring of molds, mycotoxins, endotoxins, and glucans in bioaerosols Environ. Monit. Assess. 2017 189 31 10.1007/s10661-016-5751-z 28012082 4. Sprute R. Salmanton-García J. Sal E. Malaj X. Ráčil Z. Ruiz De Alegría Puig C. Falces-Romero I. Barać A. Desoubeaux G. Kindo A.J. Invasive Infections with Purpureocillium lilacinum J. Antimicrob. Chemother. 2021 76 1593 1603 10.1093/jac/dkab039 33599275 PMC8120338 5. Saghrouni F. Saidi W. Ben Said Z. Gheith S. Ben Said M. Ranque S. Denguezli M. Cutaneous Hyalohyphomycosis Caused by Purpureocillium lilacinum Med. Mycol. 2013 51 664 668 10.3109/13693786.2012.757656 23330674 6. Abolghasemi S. Tabarsi P. Adimi P. Kiani A. Dolatshahi S. Mansouri D. Pulmonary Paecilomyces in a diabetic patient Tanaffos 2015 14 268 271 27114730 PMC4841995 7. Khalique Z. Hatipoğlu S. Rosendahl U. Mohiaddin R. Unusual Complicated Fungal Endocarditis in a Patient with Vascular Ehlers-Danlos Syndrome Ann. Thorac. Surg. 2019 107 e269 e271 10.1016/j.athoracsur.2018.08.074 30359590 8. Chew R. Dorman A. Woods M.L. Purpureocillium lilacinum Can. J. Ophthalmol. 2016 51 382 385 10.1016/j.jcjo.2016.05.013 27769331 9. Castelli M.V. Alastruey-Izquierdo A. Cuesta I. Monzon A. Mellado E. Rodriguez-Tudela J.L. Cuenca-Estrella M. Susceptibility Testing and Molecular Classification of Paecilomyces Antimicrob. Agents Chemother. 2008 52 2926 2928 10.1128/AAC.00538-08 18519716 PMC2493137 10. Drogari-Apiranthitou M. Mantopoulou F.D. Skiada A. Kanioura L. Grammatikou M. Vrioni G. Mitroussia-Ziouva A. Tsakris A. Petrikkos G. In Vitro Antifungal Susceptibility of Filamentous Fungi Causing Rare Infections: Synergy Testing of Amphotericin B, Posaconazole and Anidulafungin in Pairs J. Antimicrob. Chemother. 2012 67 1937 1940 10.1093/jac/dks137 22535624 11. Baethge C. Goldbeck-Wood S. Mertens S. SANRA—A Scale for the Quality Assessment of Narrative Review Articles Res. Integr. Peer Rev. 2019 4 5 10.1186/s41073-019-0064-8 30962953 PMC6434870 12. Corbeddu M. Ferreli C. Cappai R. Ferraguti P. Atzori L. Pilloni L. Rongioletti F. Fatal Hyalohyphomycosis with Cutaneous Involvement Caused by Purpureocillium Lilacinum Acta Biomed. 2021 92 e2021139 10.23750/ABM.V92I3.10100 34212928 PMC8343759 13. Desoubeaux G. García D. Bailly E. Augereau O. Bacle G. De Muret A. Bernard L. Cano-Lira J.F. Garcia-Hermoso D. Chandenier J. Subcutaneous Phaeohyphomycosis Due to Phialemoniopsis Ocularis Successfully Treated by Voriconazole Med. Mycol. Case Rep. 2014 5 4 8 10.1016/j.mmcr.2014.04.001 24936402 PMC4052356 14. Hall V.C. Goyal S. Davis M.D.P. Walsh J.S. Cutaneous Hyalohyphomycosis Caused by Paecilomyces lilacinus Int. J. Dermatol. 2004 43 648 653 10.1111/j.1365-4632.2004.02175.x 15357743 15. Van Schooneveld T. Freifeld A. Lesiak B. Kalil A. Sutton D.A. Iwen P.C. Paecilomyces lilacinus Transpl. Infect. Dis. 2008 10 117 122 10.1111/j.1399-3062.2007.00248.x 17605741 16. Demitsu T. Nagashima K. Okabe T. Morisawa Y. Ishikawa N. Yagisawa T. Fukuta H. Ohtsuki M. Kano R. Harada K. Subcutaneous Hyalohyphomycosis Due to Purpureocillium lilacinum J. Dermatol. 2017 44 725 726 10.1111/1346-8138.13521 27461556 17. Nagamoto E. Fujisawa A. Yoshino Y. Yoshitsugu K. Odo M. Watanabe H. Igata T. Noguchi H. Case of Paecilomyces lilacinus Med. Mycol. J. 2014 55 E21 E27 10.3314/mmj.55.E21 24682094 18. Kitami Y. Kagawa S. Iijima M. [A Case of Cutaneous Paecilomyces lilacinus Nihon Ishinkin Gakkai Zasshi 2005 46 267 272 10.3314/jjmm.46.267 16282969 19. Keshtkar-Jahromi M. McTighe A.H. Segalman K.A. Fothergill A.W. Campbell W.N. Unusual Case of Cutaneous and Synovial Paecilomyces lilacinus Mycopathologia 2012 174 255 258 10.1007/s11046-012-9540-0 22484831 20. Albert R. Lemaignen A. Desoubeaux G. Bailly E. Bernard L. Lacasse M. Chronic Subcutaneous Infection of Purpureocillium lilacinum Med. Mycol. Case Rep. 2022 38 5 8 10.1016/j.mmcr.2022.08.001 36147049 PMC9486248 21. Hilmarsdottir I. Thorsteinsson S.B. Asmundsson P. Bodvarsson M. Arnadottir M. Cutaneous Infection Caused by Paecilomyces lilacinus Scand. J. Infect. Dis. 2000 32 331 332 10.1080/00365540050166063 10879613 22. Accetta J. Powell E. Boh E. Bull L. Kadi A. Luk A. Isavuconazonium for the Treatment of Purpureocillium lilacinum Med. Mycol. Case Rep. 2020 29 18 21 10.1016/J.MMCR.2020.05.006 32547913 PMC7286926 23. Trinh S.A. Angarone M.P. Purpureocillium lilacinum Transpl. Infect. Dis. 2017 19 e12689 10.1111/TID.12689 PMC5547740 28273390 24. Lavergne R.A. Cassaing S. Nocera T. Pauwels C. Cointault O. Basse G. Lavayssière L. Berry A. Kamar N. Lamant L. Simultaneous Cutaneous Infection Due to Paecilomyces lilacinus Transpl. Infect. Dis. 2012 14 E156 E160 10.1111/tid.12020 23075226 25. Ezzedine K. Belin E. Guillet S. D’Almeida M. Droitcourt C. Accocebery I. Milpied B. Jouary T. Malvy D. Taieb A. Cutaneous Hyphomycosis Due to Paecilomyces lilacinus Acta Derm. Venereol. 2012 92 156 157 10.2340/00015555-1179 22002343 26. Ounissi M. Abderrahim E. Trabelsi S. Khaled S. Bezzine H. Ben Hamida F. Hedri H. Ben Abdallah T. Ben Maïz H. Kheder A. Hyalohyphomycosis Caused by Paecilomyces lilacinus Transplant. Proc. 2009 41 2917 2919 10.1016/j.transproceed.2009.07.035 19765473 27. Martin C.A. Roberts S. Greenberg R.N. Voriconazole Treatment of Disseminated Paecilomyces Infection in a Patient with Acquired Immunodeficiency Syndrome Clin. Infect. Dis. 2002 35 78 81 10.1086/342302 12228840 28. Sotello D. Cappel M. Huff T. Meza D. Alvarez S. Libertin C.R. Cutaneous Fungal Infection in an Immunocompromised Host JMM Case Rep. 2017 4 e005101 10.1099/jmmcr.0.005101 29026628 PMC5630970 29. Xia X.J. Liu Z.H. Cutaneous Hyalophomycosis Caused by Purpureocillium lilacinum Mycopathologia 2021 186 563 564 10.1007/s11046-021-00571-z 34160759 30. Lemaigre C. Suarez F. Martellosio J.P. Barbarin C. Brunet K. Chomel J.C. Hainaut E. Rammaert B. Roblot F. Torregrosa-Diaz J.M. Late Onset of Chronic Granulomatous Disease Revealed by Paecilomyces lilacinus J. Clin. Immunol. 2022 42 60 63 10.1007/S10875-021-01140-1 34596815 PMC8821496 31. Wang Y. Bao F. Lu X. Liu H. Zhang F. Case Report: Cutaneous Mycosis Caused by Purpureocillium lilacinum Am. J. Trop. Med. Hyg. 2023 108 693 695 10.4269/ajtmh.22-0608 36806492 PMC10077002 32. Chen W.Y. Lin S.R. Hung S.J. Successful Treatment of Recurrent Cutaneous Purpureocillium lilacinum Paecilomyces lilacinus Acta Derm. Venereol. 2019 99 1313 1314 10.2340/00015555-3320 31532536 33. Egger M. Hoenigl M. Thompson G.R. 3rd Carvalho A. Jenks J.D. Let’s talk about sex characteristics—As a risk factor for invasive fungal diseases Mycoses 2022 65 599 612 10.1111/myc.13449 35484713 34. Lamoth F. Alexander B.D. Antifungal activities of SCY-078 (MK-3118) and standard antifungal agents against clinical non-Aspergillus mold isolates Antimicrob. Agents Chemother. 2015 59 4308 4311 10.1128/AAC.00234-15 25896696 PMC4468689 35. Miyazaki M. Horii T. Hata K. Watanabe N.A. Nakamoto K. Tanaka K. Shirotori S. Murai N. Inoue S. Matsukura M. In vitro activity of E1210, a novel antifungal, against clinically important yeasts and molds Antimicrob. Agents Chemother. 2011 55 4652 4658 10.1128/AAC.00291-11 21825291 PMC3186989 Figure 1 Flow chart of the studies revised in the narrative review. Figure 2 Multiple, monolateral, erythematous-papulo-nodular lesions on the right leg. Figure 3 Skin lesions were associated with diffuse soft tissue swelling and redness, referred to as lymphedema. Figure 4 Histopathological features: ( A B A B C Figure 5 Progressive resolution of skin lesions under treatment after 3 months of therapy. life-15-01453-t001_Table 1 Table 1 Literature regarding cutaneous infection due to P. lilacinum  Age Comorbidities Hobby Skin Lesions Pain Site Diffusion Therapy Outcome REF 1 79, Diabetes mellitus; Pemphigus vulgaris Gardening Erythematous pustule, warm, single no Hand, monolateral Bilateral leg Itraconazole Dead [ 12 2 84, Steroid therapy; NA Swelling and bursitis of the first metatarsophalangeal joint yes Lower extremity, monolateral No Surgery plus Recovered [ 13 3 65, Steroid therapy for temporal arteritis NA Erythematous and oedematous area with papules and pustules no Lower extremity, monolateral Cellulitis Itraconazole Recovered [ 14 4 56, Liver transplant NA Erythematous, tender single nodule no Knee, monolateral Multiple nodules following lymphatic distribution Voriconazole 200 mg bid alone and in association with Terbinafine Recovered [ 15 5 72, Renal transplant NA Erythematous nodule no Forearms, monolateral Multiple reddish nodules Itraconazole Recovered [ 16 6 28, Bone marrow transplant; Pseudomonas aeruginosa None Erythematous papules and pustules, crusted at the margin of previous ulcers no Face and site of closed tracheostomy Multiple necrotising ulcers Itraconazole Recovered [ 17 7 74, Immunosuppressed therapy for autoimmune haemolytic anaemia NA Erythematous brownish plaque, single yes Hemiface Multiple Griseofulvin Recovered [ 18 8 71, Steroid therapy for giant cell arteritis NA Erythematous nodule no Elbow, monolateral NA Micafungin (dosage not available) NA [ 19 9 52, Renal transplant Gardening Oedematous and erythematous area no Lower extremity, monolateral Cellulitis with multiple fistula orifices Posaconazole Recovered [ 20 10 59, Renal transplant NA Erythematous papules, pustules and small ulcers yes Foot and interdigital space, monolateral Multiple lesions on foot and leg, sepsis due to Candida Itraconazole Dead [ 21 11 50, CLL; previous pyoderma gangrenosum NA Purpuric nodules and a necrotic ulcer yes Lower extremity, monolateral Extended necrotic ulcer LAMPHB Recovered [ 22 12 33, Renal transplant Recent tattoo Erythematous papules, pustules clustered over tattoo no Left forearm and shin, right ankle None Voriconazole Recovered [ 23 13 63, Heart transplantation; Diabetes mellitus NA Erythematous nodules yes Leg and elbow Multiple necrotic ulcers Voriconazole Recovered [ 24 14 60, Pulse steroid therapy for rheumatoid arthritis NA Erythematous nodules with pseudo-verrucous aspect NA Hemiface Multiple necrotic ulcers on face and hand Voriconazole NA [ 25 15 48, Renal transplant NA Erythematous oedematous area yes Lower extremity, monolateral Extensive cellulitis with multiple ulcers Itraconazole Recovered [ 26 16 40, AIDS NA Erythematous nodules yes Lower extremity, monolateral Multiple Itraconazole Dead [ 27 17 69, Liver transplant recipient None, lives with a dog Erythematous nodules with pseudo-verrucous aspect yes Hand, monolateral Multiple nodules tracking on arm and Voriconazole Recovered [ 28 18 53, Steroid therapy for autoimmune haemolytic None Erythematous pustule and ulcerated nodule no Neck None Itraconazole Recovered [ 29 19 67, X-linked chronic granulomatous disease Sheep farmer Erythematous nodules with pustules yes Upper extremity (thumb) None Voriconazole Recovered [ 30 20 51, Steroid therapy for nephrotic syndrome NA Recurrent papules, pustules, and ulceration NA Finger and forearm, None Voriconazole Recovered [ 31 21 NA, Steroid therapy for Evans’ Syndrome Farmer Erythematous papules and pustules yes Forearm, Multiple ulcerated lesions Voriconazole Recovered [ 32 NA: not reported; LAMPHB: liposomial amphotericin B. life-15-01453-t002_Table 2 Table 2 Characteristics of immunocompromised patients with cutaneous infections caused by P. lilacinum  n (%) Patient age  Years, mean (min-max) 59 (28–84) years Sex  Male 16 (76.2) Female 6 (27.2) Race/ethnicity  Caucasian 9 (40.9) Black/African American 6 (27.2) Asiatic 7 (31.8) Immunosuppression  Steroids 9/22 (40.9) Solid transplant 9/22 (40.9) Haematological condition 3/22 (13.6) HIV/AIDS 1/22 (0.5) Hobbies  Unknown/Other 15/22 (68) Farmer 3/22 (13.6) Gardening 2/22 (9) Skin lesions  Papules/pustules 9/22 (40.9) Nodules 10/22 (45,4) Erythematous purpuric plaques 3/22, 13.6) Other 1/22 (0.5) Localization  Upper extremities 7/22 (31.8) Lower extremities 10/22 (45.4) Pain associated  Yes 10/22 (45,4) No 9/22 (40.9) Local diffusion 11/22 (50) Systemic diffusion/secondary foci 5/22 (22.7) Treatment  Azoles 22/22 (100) Terbinafine 3/22 (13.6) Echinocandins 3/22 (13.6) Liposomal amphotericin 4/22 (18.1) Griseofulvin 1/22 (0.5) Surgical debridement 2/22 (9) Mortality 3/22 (13.6) ",
  "metadata": {
    "Title of this paper": "In vitro activity of E1210, a novel antifungal, against clinically important yeasts and molds",
    "Journal it was published in:": "Life",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471311/"
  }
}