{
  "title": "Paper_977",
  "abstract": "pmc Indian J Community Med Indian J Community Med 962 ijcommed IJCM Indian J Community Med Indian Journal of Community Medicine: Official Publication of Indian Association of Preventive & Social Medicine 0970-0218 1998-3581 Wolters Kluwer -- Medknow Publications PMC12470350 PMC12470350.1 12470350 12470350 41017877 10.4103/ijcm.ijcm_93_23 IJCM-50-766 1 Original Article Sweetened Areca Nut, A Risk in Dental Caries among Adolescents in Pune, Maharashtra? A Case-Control Study Shetiya Sahana Hegde 1 Jadhav Sudhir L. 2 Kheur Supriya 3 Shirahatti Ravi 4 Gupta Rakesh 5 Desai Ruttika 1 1 2 3 4 5 Address for correspondence: shetiyasahana@gmail.com Sep-Oct 2025 03 10 2024 50 5 497648 766 771 16 2 2023 26 6 2024 01 09 2025 27 09 2025 29 09 2025 Copyright: © 2024 Indian Journal of Community Medicine 2024 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open access journal, and articles are distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License, which allows others to remix, tweak, and build upon the work non-commercially, as long as appropriate credit is given and the new creations are licensed under the identical terms. Introduction: Smokeless tobacco (SLT) causes dental caries and so does chewing of areca nut (sweetened supari) due to the presence of sugar. Since conflicting views exist about whether areca nut causes dental caries or not, and since studies are undertaken in adults and data on adolescents are not available, this study was carried out. Since those were cross-sectional or longitudinal studies, this case-control study was undertaken to understand if flavored/sweetened areca nut is a risk factor for dental caries. Material and Method: This unmatched case-control study was conducted among the male students of 8 th th TM Results: This study of 146 males in the age group of 13 to 16 years had 61 students as cases and 85 as controls. No significant difference was observed between the group with (cases) and without (controls) dental caries for areca nut use (pack years) whether consumed daily or less frequently for 1 year or more. While the exposure rate to areca nut among cases was 44.26%, for the control group it was 36.47%. The odds ratio of sweetened areca nut as being the risk factor for dental caries was 1.38 at 95% CI (0.70–2.71) with P Conclusion: This study revealed that the adolescent users of sweetened areca nuts studying in government schools had a higher exposure odds ratio for dental caries. However, it was not significant statistically. Information bias including recall may have influenced the outcome. Adolescent areca case-control study dental caries Nil. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes I NTRODUCTION Spitting of smokeless tobacco (SLT) may be associated with the spread of tuberculosis, which is a public health problem.[ 1 2 3 4 5 A high prevalence of dental caries is a public health concern, especially in low-middle-income countries. Illiterates living in poverty and those with poor access to oral care are most affected. The consequences of chronic untreated dental caries are pain, loss of sleep, inability to chew food, infection of the head and neck, lost school days, disruption of family life, and reduced quality of life.[ 6 SLT may or may not contain areca nut (a carcinogen), which causes cancer and oral submucous fibrosis.[ 7 8 In the South-East Asian region with a prevalence rate of 7.5%, 14.8 million (34% globally) children between 13 and 15 years of age use tobacco.[ 9 10 11 A case-control study[ 12 13 14 15 Streptococcus mutans 16 17 Forty-one percent of the Aua islanders who chewed betel nuts regularly had a 23% prevalence of caries with DMFT of 0.364 while 59% of islanders who did not chew regularly had a 49% prevalence of caries with DMFT of 1.162.[ 18 19 Since there is a conflicting view that SLT/sweetened areca nut, may not[ 12 13 14 15 18 16 17 19 14 13 16 17 High school children from municipal schools in Pimpri-Chinchwad, Pune district were seen chewing SLT/supari products. For SLT products, more information on the toxic effects of the sugars themselves, e.g., whether they are associated with dental caries was to be further researched as there is little evidence.[ 20 sada Hence, the research question was, what are the odds of having sweetened areca nut as a risk factor for dental caries (decayed teeth) among adolescents? M ATERIAL AND ETHODS Study design: Pimpri - Chinchwad Municipal Corporation (PCMC) established in 1982 has 21 clinic dispensaries some of which have a dental diagnosis and treatment is offered to patients. Around 136 municipal schools are present, 18 of which are madhyamik vidyalays (MVs). The unmatched case-control study was conducted solely among the male school children of 8 th th The sample size calculation was done by using WinPepi PORTAL Copyright J.H. Abramson, Aug. 23, 2016. Based on the study by Sen et al 17 21 Figure 1 Figure 1 Theoretical model of the relationship between sweetened areca nut and dental caries in adolescents based on a Direct Acyclic Graph (DAG). Study cases and controls: For the unmatched case-control study, cases were selected based on the definition of a case as per World Health Organization (WHO) 2013[ 22  Diagnostic criteria: Caries was considered to be present when a cavity, undermined enamel, or a softened floor or wall was present in a pit, fissure, or on a smooth tooth surface. Teeth with mixed dentition, especially deciduous teeth with caries, and deep dental caries of permanent dentition were not considered. Those who had systemic and salivary gland disease, undergone radiation therapy, differently abled (mental retardation), and students from privately run secondary schools of PCMC were excluded. Eligibility criteria: All newly diagnosed cases with caries involving enamel and dentine only. Data sources: Sources of cases and controls were a random sample of students who chewed/did not chew sweetened areca nut and who did/did not have dental caries present in the MVs in PCMC ascertained through a survey and oral examination. To ensure similarity between them about sex and socioeconomic status, eligible students attending the same school were categorized as the cases and those without caries were selected as controls. Consent was obtained from the Education Department, PCMC, and school principals along with written informed consent from the participating students. In this manner, 830 students were potentially eligible to be examined from four schools. 146 were confirmed eligible to participate having 61 cases with dental caries and 85 controls without dental caries. Both, the cases and the controls included in the study were interviewed after which a dental examination was done, which on average took 10 to 12 min. Confounders like age and oral hygiene were collected in a schedule prepared for data collection. The examiner was trained to make consistent clinical judgments. Intraexaminer consistency was assessed by calculating the percentage of agreement between scores for dental caries after the dental examination was repeated in 15 days among 46 students in one of the MVs. The measurement of agreement as denoted by kappa was 0.82 ( P Exposure variable: Information about exposure to sweetened areca nut ( Raju Elaichi Supari, Aunty supari, elaichi, menthol, sugar, sodium saccharin, flavors, Vimal Pan Masala betel nut, catechu, lime, cardamom, menthol, saffron, flavors Exposure measures such as (1) dietary sugar exposure through a nutrient evaluation chart[ 23 24 Table 1 Table 1 Percentage distribution of study participants ( n Independent Variable Cases n Controls n OR (CI), Chi-square, df, P Age (mean, SD) 14.54±1.25 14.34±1.31 t P Decayed Teeth-DT (mean, SD) 2.67±1.97 NA - Brushing frequency Brushing-Once 46 (75.41) 62 (72.94) OR=1.14 (0.54–2.42), Chi-sq=0.02, df=1, P Twice 15 (24.59) 23 (27.06) Use of toothpaste Toothpaste-Fluoridated 58 (95.08) 81 (95.29) OR=1.04 (0.23–4.86), Fisher’s exact-0.62, P Non-fluoridated 3 (4.92) 4 (4.71) Sweet score Excellent (5 or less) 19 (31.15) 18 (21.18) Chi-sq=2.94, df=2, P Good (10) 14 (22.95) 16 (18.82) Watch out (15 or more) 28 (45.9) 51 (60.0) Areca nut chewing Yes 27 (44.26) 31 (36.47) OR=1.38 (0.71–2.71), Chi-sq (yates corrected, 2 tailed)=0.60, df=1, P No 34 (55.74) 54 (63.53) Frequency of areca nut chewing Daily 6 (9.84) 9 (10.59) Chi-sq=1.26, df=2, P Non-daily 21 (34.43) 22 (25.88) Does not chew 34 (55.74) 54 (63.53) Duration Upto 1 year 7 (11.48) 13 (15.29) Chi-sq=2.58, df=2, P >1 year 20 (32.79) 18 (21.18) Does not chew 34 (55.74) 54 (63.53) Dental visit Sometimes 11 (18.03) 11 (12.94) OR=0.68 (0.27–1.68) P Never 50 (81.97) 74 (87.06) Oral hygiene Good 55 (90.16) 76 (89.41) Chi-sq=0, P Fair 6 (9.84) 8 (9.41) Poor 0 (0) 1 (1.18) Crowded teeth No 11 (18.03) 23 (27.06) Chi-sq=3.04, df=2, P One anterior segment crowded 21 (34.43) 33 (38.82) Two anterior segments crowded 11 (18.03) 23 (27.06) The adolescents were generally consuming sweetened areca nut packets of 0.8 g weight. The reasons to use areca nut were peer pressure or use by family members. Hence, overall areca nut exposure (pack years) was calculated by taking into consideration the frequency of use per year and duration of chewing (number of years) for each case and control and standardized by multiplying by 0.8. A theoretical model was proposed to study the relationship between sweetened areca nut chewing and dental caries experience among adolescents before the start of the study. A directed acyclic graph (DAG), a graphic analytical tool was designed in DAGitty v3.0 software to determine the minimal sufficient adjustment sets containing oral hygiene, age, and smoking without overadjustment. Diet was considered as the ancestor of outcome. Fluoride exposure, malocclusion, past dental history, and brushing habits were considered ancestors of exposure and outcome [ Figure 1 Statistical analysis: Descriptive statistics was depicted as numbers and percentages. The odds ratio was calculated and P t TM R ESULTS Independent variables with their number and percentages are depicted in Table 1 P t Table 2 P Table 1 Table 2 Comparison of mean pack years of areca nut exposure between Cases (DT≥1) and Controls (DT=0) by unpaired t Overall areca nut exposure (pack years) Cases (Decay present n Controls (No Decay n Unpaired t T P Mean difference (95% CI) Mean 150.26 106.00 T = -0.77, P 44.26 (–157.24,68.70) Standard deviation 335 344.57 Though oral hygiene and age needed adjustment, eventually, since areca nut was found statistically unassociated with the risk of caries, these variables were not considered for adjustment. D ISCUSSION To our knowledge, this case-control study conducted among the students of MVs, PCMC, Pune is the maiden one nationally to assess whether sweetened areca nut is a risk factor for caries. Sweetened areca nut use is quite rampant among school students. They consider it harmless since it does not have the statutory and the pictorial warning. In this study, 58 (39.72%) students, mostly between 13 and 16 years of age consumed sweetened areca nut. The duration of use varied from 2 to 3 months to about 5 years and the frequency of use varied from one sachet to a few sachets per day/week/month [ Table 1 25 th th 26 Upon examining 982 villagers who had a common habit of betel chewing in the Eastern part of Java, Indonesia, the mean DMFS was 13.09 ± 9.52 among 20- to 24-year-old nonchewers and 3.86 ± 2.80 among chewers; and, on the island of Bali, it was 9.54 ± 6.23 among nonchewers and 0.00 ± 0.00 among chewers, respectively.[ 27 18 27 28 27 While the exposure rates to areca nut for the study and the control groups were 44.26% and 36.47%, respectively, the overall exposure to areca nut in both groups did not differ significantly, though the mean pack years of areca nut exposure was higher among cases [ Table 2 Table 1 ] 29 In the preceding studies conducted in 70s and 80s, among the villagers[ 27 18 The strength of the study were as follows: (1) Its design which has a strong theoretical framework to investigate risk factors based on literature review and DAGS; (2) Elimination of the selection bias by keeping participants unaware about their belonging to either study or control group; and (3) Participants’ similarity in characteristics overall; (4) Its generalizability as the adolescents from these four government schools represent the other school children from 19 schools who are from the similar socioeconomic status; and (5) Investigator’s blindfolding on who the cases/controls were as oral exam was done after the interview. The limitations of this study have been: Information bias which may have influenced the outcome; (1) the inability of the participants in both study and control groups to recall the duration for which the areca nut was used and how the habit changed over time; however, this bias existed in both, study group as well as controls. (2) suppression of the details shared by the participants on usage of SLT/smoking with or without areca nut leading to social desirability bias; and (3) inability to blind the examiner for details on consumption or duration of areca nut use since the same examiner conducted the oral exam immediately after the interview (interviewer’s bias). C ONCLUSION This study concludes that the sweetened areca nut (supari) has shown a marginally higher exposure odds ratio for dental caries among the students in the age group of 12 to 16 years studying in Madhyamik Vidyalays (Municipal schools) in PCMC, Pune District of Maharashtra. Further studies to confirm or refute initial observations are needed. Students/parents should be concerned about its use as it can cause precancerous condition, oral submucous fibrosis. Registration - CTRI REF/2022/01/050526 Conflicts of interest There are no conflicts of interest. Acknowledgment Obliged to the students and staff members of Madhyamik Vidyalay for cooperating with the oral checkup and interview. Indebted to Dr. Rizwan SA, Adjunct Faculty, Dept. of Public Health Dentistry, Dr. D Y Patil Dental College and Hospital, Pune for clearing the doubts during the preparation of the theoretical model using DAG. R EFERENCES 1 Guidelines for tobacco free educational institution (Revised) Ministry of Health and Family Welfare, Government of India [Last accessed on 2022 Dec 09] Available from: http://www.ntcp.nhp.gov.in”www.ntcp.nhp.gov.in. 2 Lawler TS Stanfill SB Zhang L Ashley DL Watson CH Chemical characterization of domestic oral tobacco products: Total nicotine, pH, unprotonated nicotine and tobacco-specific N-nitrosamines Food Chem Toxicol 2013 57 380 6 23517910 10.1016/j.fct.2013.03.011 PMC5659123 3 Hsu S Pollack R Hsu AFC Going R Sugars present in tobacco extracts J Am Dent Assoc 1980 101 915 8 6935284 10.14219/jada.archive.1980.0465 4 Pyles ST Van Voris LP Lotspeich FJ McCarty SA Sugar in chewing tobacco N Engl J Med 1981 304 365 10.1056/nejm198102053040628 7442789 5 Vellappally S Fiala Z Smejkalova J Jacob V Shriharsha P Influence of tobacco use in dental caries development Centr Eur J Public Health 2007 15 116 21 10.21101/cejph.a3431 17958204 6 Peres MA Macpherson LMD Weyant RJ Daly B Venturelli R Mathur MR Oral diseases: A global public health challenge Lancet 2019 394 249 60 31327369 10.1016/S0140-6736(19)31146-8 7 Swasticharan L Arora M Sinha P Ray CS Munish VG Shrivastav R Report on Tobacco Control in India Ministry of Health and Family Welfare, Government of India 2022 Vol 2 8 Chatterjee N Gupte HA Mandal G How do adolescents assess and rank the risk of areca nut use? Findings from a study in Mumbai, India Asian Pac J Cancer Prev 2022 23 537 44 35225466 10.31557/APJCP.2022.23.2.537 PMC9272614 9 WHO 2019 WHO global report on trends in prevalence of tobacco smoking 2000-2025 - Second edition [Internet] [Last accessed on 2022 Aug 03] Available from: https://www.who.int/publications-detail-redirect/9789241514170. 10 National_Fact_Sheet_of_fourth_round_of_Global_Youth_Tobacco_Survey_GYTS-4.pdf [Internet] [Last accessed on 2022 Aug 03] Available from: https://ntcp.mohfw.gov.in/assets/document/National_Fact_Sheet_of_fourth_round_of_Global_Youth_Tobacco_Survey_GYTS-4.pdf. 11 Factsheet_Maharashtra.pdf [Internet] [Last accessed on 2022 Aug 27] Available from: https://www.rctcpgi.org/pdf/gyts4/Factsheet_Maharashtra.pdf. 12 Nagarajappa S Prasad KV Oral microbiota, dental caries and periodontal status in smokeless tobacco chewers in Karnataka, India: A case-control study Oral Health Prev Dent 2010 8 211 9 20847998 13 Hugoson A Hellqvist L Rolandsson M Birkhed D Dental caries in relation to smoking and the use of Swedish snus: Epidemiological studies covering 20 years (1983-2003) Acta Odontol Scand 2012 70 289 96 22339319 10.3109/00016357.2011.654247 14 Petersson GH Twetman S Tobacco use and caries increment in young adults: A prospective observational study BMC Res Notes 2019 12 218 30971314 10.1186/s13104-019-4253-9 PMC6458795 15 Al Agili DE Park HK Oral health status of male adolescent smokeless tobacco users in Saudi Arabia East Mediterr Health J 2013 19 711 9 24975356 16 Sharma S Mishra SK Mittal N Influence of tobacco dependence on caries development in young male adults: A cross-sectional study J Conserv Dent 2018 21 597 601 30546202 10.4103/JCD.JCD_218_18 PMC6249953 17 Sen N Bathija P Chakravarty T Das D Baghel NS Khan TA Caries risk assessment using Cariogram model among smokeless tobacco users in India Med Pharm Rep 2019 92 165 71 31086845 10.15386/mpr-978 PMC6510351 18 Howden GF The cariostatic effect of betel nut chewing PN G Med J 1984 27 123 31 6598935 19 Tanwir F Altamash M Gustafsson A Influence of betel nut chewing, dental care habits and attitudes on perceived oral health among adult Pakistanis Oral Health Prev Dent 2008 6 89 94 18637386 20 WHO 2019 Report on the scientific basis of tobacco product regulation - TRS 1015 [Internet] [Last accessed on 2022 Oct 20] Available from: https://www.who.int/publications-detail-redirect/who-study-group-on-tobacco-product-regulation-report-on-the-scientific-basis-of-tobacco-product-regulation-seventh-report-of-a-who-study-group. 21 Shrier I Platt RW Reducing bias through directed acyclic graphs BMC Med Res Methodol 2008 8 1 5 18973665 10.1186/1471-2288-8-70 PMC2601045 22 WHO Oral health surveys: basic methods - 5 th 2013 [Last accessed on 2022 Apr 12] Available from: https://fctc.who.int/publications/i/item/9789241548649. 23 Nizel AE Papas AS Nutrition in clinical dentistry [Internet] Philadelphia Saunders 1989 486 [Last accessed on 2022 Apr 12] Available from: http://archive.org/details/nutritioninclini00nize. 24 Greene JC Vermillion JR. The simplified oral hygiene index J Am Dent Assoc 1964 68 7 13 14076341 10.14219/jada.archive.1964.0034 25 Gupte HA Chatterjee N Mandal G Using the theory of planned behavior to explain and predict areca nut use among adolescents in India: An exploratory study Subst Abuse Rehabil 2022 13 47 55 36097584 10.2147/SAR.S377606 PMC9464035 26 Gupte HA D’Costa M Chaudhuri L Why do Adolescents initiate and continue using tobacco and areca nut?: A qualitative study tracing pathways of use among school-going adolescents in Mumbai, India Nicotine Tob Res 2020 22 2022 31 31967313 10.1093/ntr/ntaa015 27 Moller IJ Pindborg JJ Effendi I The relation between betel chewing and dental caries Scand J Dent Res 1977 85 64 70 265084 10.1111/j.1600-0722.1977.tb00534.x 28 Nanda RS Kapoor K Fluoride content of piper betel and its constituents Indian J Med Res 1971 59 1966 70 5146993 29 Spatafora G Li Y He X Cowan A Tanner AC The evolving microbiome of dental caries Microorganisms 2024 12 121 38257948 10.3390/microorganisms12010121 PMC10819217 ",
  "metadata": {
    "Title of this paper": "The evolving microbiome of dental caries",
    "Journal it was published in:": "Indian Journal of Community Medicine: Official Publication of Indian Association of Preventive & Social Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470350/"
  }
}