{
  "title": "Paper_1096",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468644 PMC12468644.1 12468644 12468644 41008872 10.3390/cancers17183028 cancers-17-03028 1 Article Poor Oral Health and Risk of Respiratory Tract Cancer: A Prospective Cohort Study from the UK Biobank https://orcid.org/0000-0002-0097-8581 Yang Danting Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0001-6368-2684 Yoon Hyung-Suk Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Supervision Funding acquisition 2 3 Hashemian Tara Methodology Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Visualization 2 https://orcid.org/0000-0002-0366-5687 Hong Young-Rock Investigation Writing – review & editing 4 https://orcid.org/0000-0001-5371-6908 Karanth Shama D. Writing – review & editing 2 3 Zhang Sai Writing – review & editing 1 El-Ahmad Heba Writing – review & editing 5 Wallet Shannon M. Writing – review & editing 3 5 https://orcid.org/0000-0002-9384-5648 Cai Qiuyin Writing – review & editing 6 7 Shu Xiao-Ou 6 7 Lee Ji-Hyun Methodology Formal analysis Writing – review & editing Supervision 2 8 https://orcid.org/0000-0001-6370-2243 Yang Jae Jeong Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Supervision 2 3 * Savaskan Nicolai E. Academic Editor 1 dantingyang@ufl.edu sai.zhang@ufl.edu 2 yoon.h@ufl.edu thashemian@ufl.edu shama.karanth@ufl.edu jihyun.lee@ufl.edu 3 swallet@dental.ufl.edu 4 youngrock.hong@emory.edu 5 hel-ahmad@dental.ufl.edu 6 qiuyin.cai@vumc.org xiao-ou.shu@vumc.org 7 8 * yang.jae@ufl.edu 16 9 2025 9 2025 17 18 497140 3028 12 8 2025 08 9 2025 11 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Poor oral health has been implicated in the risk of various cancers; however, the contribution of specific dental conditions and their cumulative burden on the risk of site-specific respiratory tract cancer—lung, bronchus, larynx, and trachea—remains underexplored. In this population-based cohort study, we analyzed 438,762 participants aged 40–69 years from the UK Biobank to examine the association of six oral conditions, including dentures, loose teeth, painful gums, bleeding gums, toothache, and mouth ulcers, with the risk of developing respiratory tract cancer. Individuals with any oral issues demonstrated a 35–76% higher risk of respiratory tract cancer compared to those without such issues. The risk of respiratory tract cancer escalated progressively with the number of concurrent oral problems, showing effect modification by smoking history. These findings highlight that enhancing dental hygiene practices, along with smoking cessation, can serve as effective public health strategies for the prevention of respiratory tract cancers. Abstract Background/Objectives: The individual and combined effects of diverse dental problems on site-specific respiratory tract cancer remain insufficiently addressed. This study investigated the associations between six oral conditions—dentures, loose teeth, painful gums, bleeding gums, toothache, and mouth ulcers—and the risk of developing cancers of the lung, bronchus, larynx, and trachea, both individually and collectively. Methods: This prospective cohort study, utilizing baseline data from the UK Biobank, analyzed 438,762 participants aged 40–69 years. Multivariable Cox proportional hazards models were employed to estimate hazard ratios (HRs) and 95% CIs for incident respiratory tract cancer associated with individual oral conditions and their cumulative impact. Effect modification by sociodemographics, lifestyle, and underlying medical conditions was further assessed. Results: During the follow-up (median = 11.0 years), 3568 participants developed respiratory tract cancer. After adjusting for confounders, including smoking history, individuals with any oral issues exhibited a 35–76% higher risk of respiratory tract cancer (HR [95% CI]: 1.35 [1.25–1.46] for the total risk, 1.34 [1.24–1.45] for bronchus/lung cancer, and 1.76 [1.23–2.52] for laryngeal cancer). Dentures (1.48 [1.36–1.60]), loose teeth (1.36 [1.20–1.54]), and painful gums (1.25 [1.04–1.50]) had a strong association with respiratory tract cancer. The overall risk escalated progressively with the number of concurrent problems (HR [95% CI] of 1.32 [1.22–1.43] for one, 1.42 [1.25–1.62] for two, 1.57 [1.23–1.98] for three, and 1.71 [1.16–2.50] for ≥four). Associations were pronounced among smokers ( p oral health respiratory tract cancer bronchus and lung cancer laryngeal cancer epidemiology UK Biobank University of Florida Health Cancer Center Florida Statute § 381.915 National Cancer Institute of the NIH P30CA247796 This work was supported by the University of Florida Health Cancer Center, supported in part by state appropriations provided in Florida Statute § 381.915 and the National Cancer Institute of the NIH under award No. P30CA247796. The funder had no role in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, or approval of the manuscript; or the decision to submit the manuscript for publication. The content is solely the responsibility of the authors and does not necessarily represent the official views of the NIH or the State of Florida. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Oral health may play a crucial role in predisposing individuals to systemic inflammatory and immune responses that contribute to carcinogenesis [ 1 2 1 2 3 P. gingivalis F. nucleatum 1 2 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 The anatomical and functional connection between the oral cavity and respiratory tract suggests that poor oral health, characterized by oral inflammation, microbial dysbiosis, and periodontal diseases, may directly affect respiratory epithelial cells via inhalation or hematogenous spread, thereby elevating the risk of developing respiratory tract cancer. Some previous studies have reported that tooth loss and/or periodontal diseases are linked to the development of lung cancer, a major type of respiratory tract cancer [ 11 12 13 14 15 19 20 21 In this population-based cohort study, leveraging the UK Biobank data, we examined the association of six distinct oral conditions, i.e., dentures, loose teeth, painful gums, bleeding gums, toothache, and mouth ulcers, with the risk of developing specific types of respiratory tract cancer. We also investigated the cumulative impacts of these problems using two complementary approaches: (1) a count-based approach that quantified the total number of concurrent oral conditions and (2) a severity-based approach that categorized participants according to their most clinically significant reported condition. In addition, we assessed whether these associations were modified by sociodemographics (i.e., age, sex, education level, and income), lifestyle (i.e., smoking and alcohol use), and underlying medical conditions (i.e., chronic obstructive pulmonary disease (COPD) and obesity). 2. Materials and Methods 2.1. Data Source and Study Population This study utilized baseline data from the UK Biobank, a large prospective cohort study that recruited about 502,000 community-dwelling individuals aged 40 to 69 years across the United Kingdom between 2006 and 2010. The detailed study procedures and cohort profile have been documented elsewhere [ 22 23 24 24 For the present analysis, we first excluded individuals with a documented history of any cancer prior to enrollment based on self-reported doctor diagnosis or confirmation through data linkage. Individuals missing information, including responses of “prefer not to answer,” on oral health conditions, smoking status, or basic demographic variables (age, sex, and race) were removed. In addition, participants who withdrew their consent during the follow-up period were further excluded. After applying these exclusion criteria, a total of 438,762 participants remained in the final eligible analytic sample ( Figure S1 2.2. Oral Health Conditions The primary exposure of interest was the presence of oral health conditions, defined as having any of the following problems: dentures, loose teeth, painful gums, bleeding gums, toothache, and mouth ulcers. We incorporated all self-reported dental problem variables captured in the UK Biobank baseline questionnaire, in which participants indicated that they had any of the listed conditions (multiple choices) or “none of the above.” In addition to assessing individual oral health conditions, we created a composite score to represent the cumulative burden of oral health issues by calculating the number of conditions reported by each participant (0, 1, 2, 3, or ≥4) to evaluate potential dose–response relationships between oral health burden and cancer risk. Given that loose teeth, painful gums, and bleeding gums are validated indicators of periodontal diseases [ 25 26 2.3. Incident Respiratory Tract Cancer Cases The primary outcome of interest was the incidence of respiratory tract cancer, encompassing cancers of the lung, bronchus, larynx, and trachea, which was ascertained through linkage to national cancer registries [ 24 Table S1 2.4. Covariates Potential confounding factors were identified from previous literature of established or suspected risk factors for respiratory tract cancer and added to the model sequentially. The basic model included age at enrollment (continuous), sex (men and women), self-reported race (White, Black, and Other (Asian and multiracial/ethnic)), and smoking history combined with pack-years (never smoked, former smokers, current smokers with <20 pack-years, current smokers with ≥20 pack-years, and current smokers with missing pack-years). The full model further included educational attainment (those who did not complete high school, those who graduated high school, those who attended vocational school/some college, and those with university degrees and beyond), average total household income after tax (<GBP 18,000, GBP 18,000–GBP 30,999, GBP 31,000–GBP 51,999, GBP 52,000–GBP 100,000, and >GBP 100,000), alcohol consumption (never, 1–3 times per month/occasionally, 1–4 times per week, and daily/almost daily), obesity status defined by body mass index (BMI) (calculated as weight in kilograms divided by height in meters squared (underweight <18.5 kg/m 2 2 2 2 2.5. Statistical Analysis Baseline characteristics of the study population were compared between incident respiratory tract cancer cases and those without respiratory cancer using the Wilcoxon rank sum test for continuous variables and Pearson’s Chi-squared test for categorical variables. The step-down Bonferroni method was employed to correct for multiple comparisons in the analysis of the prevalence of six self-reported oral health conditions. Incidence rates of respiratory tract cancer were calculated by dividing the number of newly diagnosed cases by the corresponding person-years at risk, expressed per 1000 person-years. Cox proportional hazards (PH) models were used to estimate hazard ratios (HRs) and 95% confidence intervals (CIs) for the incidence of respiratory tract cancer linked to oral health conditions, with follow-up time as the time scale. A healthy oral condition (without any problems) was modeled as the reference. The PH assumption was evaluated using Schoenfeld residuals—we confirmed no violation of the assumption. Stratified analyses were performed to assess the effect modification by age group, sex, education level, income, smoking history combined with pack-years, alcohol consumption, obesity, and history of COPD, all initially identified as potential risk factors for respiratory tract cancer. Interaction was evaluated using multiplicative terms of oral conditions and the stratification variables. To enhance model fit in the interaction analysis, backward selection was employed to determine the optimal model by utilizing the lowest Akaike information criterion (AIC) value—this approach allowed us to consider both epidemiological evidence on biological plausibility and statistical criteria. A series of sensitivity analyses were conducted to account for residual confounding due to smoking, such as restricting the analysis to those who never smoked or those who were long-term quitters who had abstained from smoking for more than 10 years, while treating smoking-related deaths [ 27 3. Results Of the 438,762 participants analyzed, 3568 developed respiratory tract cancer during the mean follow-up time of 10.3 years ( Table 1 Table S1 The prevalence of oral problems differed significantly between individuals who developed respiratory tract cancer and those who did not ( Figure 1 Table S2 p p p p Table S3 Tables S4 and S5 p After adjusting for all potential confounders, the presence of any oral problems was associated with a 34% to 76% increased risk of developing respiratory tract cancer ( Table 2 The risk of respiratory tract cancer increased progressively with the cumulative count of simultaneous oral problems ( Table 3 For better model fitting, the race variable was excluded from the final interaction model as it made a minimal contribution to model performance ( Table S6 Table 4 p Tables S7 and S8 4. Discussion In this prospective analysis of 438,762 UK Biobank participants, poor oral health was associated with an increased risk of respiratory tract cancer. After comprehensive adjustments for potential confounders—including smoking status and pack-years—participants with any oral health issues exhibited a 35% higher risk of respiratory tract cancer overall, including a notable 76% increased risk of laryngeal cancer. Among the analyzed oral conditions, utilizing dentures emerged as a strong independent risk factor, conferring a 48% increased risk of respiratory tract cancer overall. A clear dose–response relationship was apparent, with each additional concomitant oral condition further strengthening the risk. The association between oral health and respiratory tract cancer persisted across varying sociodemographics, lifestyles, and pre-existing conditions; however, the association revealed effect modification by smoking history, indicating the potential interplay with smoking or the possibility of residual confounding. Our findings align with previous studies indicating that tooth loss, periodontal disease, and poor dental hygiene increase the risk of lung cancer [ 11 12 13 14 15 11 15 17 18 28 The mechanisms connecting poor oral health to respiratory tract cancers are likely multifactorial. Biologically, certain periodontal conditions contribute to persistent bacteremia, chronic low-grade inflammation, and systemic immunological dysregulation [ 29 30 30 31 32 33 34 P. gingivalis F. nucleatum 35 36 37 38 39 40 41 42 43 19 20 21 44 45 46 47 This population-based prospective study introduces several novel findings compared to previous research. Epidemiological studies to date have mainly focused on lung cancer [ 11 12 13 14 15 17 18 28 Our study has several methodological strengths based on a well-characterized cohort of the 438,762 participants analyzed. The extensive survey data and validated long-term follow-up enabled a thorough investigation of diverse oral conditions and various cancer subtypes, both individually and collectively. The prospective design reduces recall bias and strengthens the temporal relationship between oral health conditions and subsequent cancer risk, accounting for a broad spectrum of potential confounders and effect modifiers. However, our study also has limitations that warrant consideration. First, oral health conditions were assessed solely through self-report at baseline, which may introduce non-differential misclassification. Despite the validity and efficacy of self-reported measures for periodontal conditions and dentures in epidemiological studies [ 25 26 48 49 Table S9 50 5. Conclusions Our prospective investigation in a large population-based cohort demonstrates that poor oral health is linked to an increased risk of respiratory tract cancer independent of potential underlying risk factors. Given the modifiable and evolving nature of oral pathologies, improving dental hygiene practices, implementing lifestyle modifications, and promoting smoking cessation could serve as proactive cancer prevention strategies for at-risk populations. Further investigations integrating clinical oral assessments, longitudinal data collection, and microbial profiling are needed to enhance our understanding of the biological pathways linking oral health to respiratory tract carcinogenesis, which will pave the way for the development of oral health interventions aimed at cancer prevention. Acknowledgments This research has been conducted using the UK Biobank Resource under Application Number 117298 ( www.ukbiobank.ac.uk Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/cancers17183028/s1 Author Contributions Conceptualization, J.J.Y., H.-S.Y., and J.-H.L.; Methodology, J.J.Y., H.-S.Y., T.H., and J.-H.L.; Formal Analysis, J.J.Y., H.-S.Y., T.H., and J.-H.L.; Investigation, D.Y., J.J.Y., H.-S.Y., T.H., and Y.-R.H.; Data Curation, J.J.Y. and T.H.; Writing—Original Draft Preparation, D.Y., H.-S.Y., T.H., and J.J.Y.; Writing—Review and Editing, D.Y., H.-S.Y., T.H., Y.-R.H., S.D.K., S.Z., H.E.-A., S.M.W., Q.C.,X.-O.S., J.-H.L., J.J.Y.; Visualization, T.H.; Supervision, J.J.Y., H.-S.Y., and J.-H.L.; Funding Acquisition, H.-S.Y. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The UK Biobank has obtained approval from the North West Multi-Centre Research Ethics Committee (21/NW/0157; 29 June 2021) [ 24 Informed Consent Statement Informed written consent was obtained from all participants in the UK Biobank. Data Availability Statement UK Biobank data are accessible to researchers following the approval of a formal application via the UK Biobank Access Management System. All other data supporting the findings of this study will be available upon reasonable request to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations AIC Akaike information criterion BMI body mass index COPD chronic obstructive pulmonary disease Cox PH model Cox proportional hazards model HPV human papillomavirus HR hazard ratio ICD International Classification of Diseases PH assumption proportional hazards assumption STROBE Strengthening the Reporting of Observational Studies in Epidemiology 95% CI 95% confidence interval References 1. Kapila Y.L. Oral Health’s Inextricable Connection to Systemic Health: Special Populations Bring to Bear Multimodal Relationships and Factors Connecting Periodontal Disease to Systemic Diseases and Conditions Periodontol. 2000 2021 87 11 16 10.1111/prd.12398 34463994 PMC8457130 2. Bui F.Q. Almeida-da-Silva C.L.C. Huynh B. Trinh A. Liu J. Woodward J. Asadi H. Ojcius D.M. Association between Periodontal Pathogens and Systemic Disease Biomed. J. 2019 42 27 35 10.1016/j.bj.2018.12.001 30987702 PMC6468093 3. Chung M. York B.R. Michaud D.S. Oral Health and Cancer Curr. Oral Health Rep. 2019 6 130 137 10.1007/s40496-019-0213-7 31871854 PMC6927401 4. Peng X. Cheng L. You Y. Tang C. Ren B. Li Y. Xu X. Zhou X. Oral Microbiota in Human Systematic Diseases Int. J. Oral Sci. 2022 14 14 10.1038/s41368-022-00163-7 35236828 PMC8891310 5. Karpiński T.M. Role of Oral Microbiota in Cancer Development Microorganisms 2019 7 20 10.3390/microorganisms7010020 30642137 PMC6352272 6. Ahrens W. Pohlabeln H. Foraita R. Nelis M. Lagiou P. Lagiou A. Bouchardy C. Slamova A. Schejbalova M. Merletti F. Oral Health, Dental Care and Mouthwash Associated with Upper Aerodigestive Tract Cancer Risk in Europe: The ARCAGE Study Oral Oncol. 2014 50 616 625 10.1016/j.oraloncology.2014.03.001 24680035 7. Jordão H.W. McKenna G. McMenamin Ú.C. Kunzmann A.T. Murray L.J. Coleman H.G. The Association between Self-Reported Poor Oral Health and Gastrointestinal Cancer Risk in the UK Biobank: A Large Prospective Cohort Study United Eur. Gastroenterol. J. 2019 7 1241 1249 10.1177/2050640619858043 PMC6826526 31700637 8. Ndegwa N. Ploner A. Liu Z. Roosaar A. Axéll T. Ye W. Association between Poor Oral Health and Gastric Cancer: A Prospective Cohort Study Int. J. Cancer 2018 143 2281 2288 10.1002/ijc.31614 29873081 9. Michaud D.S. Fu Z. Shi J. Chung M. Periodontal Disease, Tooth Loss, and Cancer Risk Epidemiol. Rev. 2017 39 49 58 10.1093/epirev/mxx006 28449041 PMC5868279 10. Beger-Luedde J. Loosen S.H. Luedde T. Roderburg C. Kostev K. Association between Chronic Gingivitis and Cancer: A Retrospective Cohort Study of 19,782 Outpatients from the United Kingdom Cancers 2023 15 2007 10.3390/cancers15072007 37046667 PMC10093436 11. Yoon H.-S. Shu X.-O. Gao Y.-T. Yang G. Cai H. Shi J. Yang J.J. Rothman N. Lan Q. Zheng W. Tooth Loss and Risk of Lung Cancer among Urban Chinese Adults: A Cohort Study with Meta-Analysis Cancers 2022 14 2428 10.3390/cancers14102428 35626036 PMC9140069 12. Yoon H.-S. Wen W. Long J. Zheng W. Blot W.J. Cai Q. Association of Oral Health with Lung Cancer Risk in a Low-Income Population of African Americans and European Americans in the Southeastern United States Lung Cancer 2019 127 90 95 10.1016/j.lungcan.2018.11.028 30642558 PMC6341989 13. Chen Y. Zhu B.-L. Wu C.-C. Lin R.-F. Zhang X. Periodontal Disease and Tooth Loss Are Associated with Lung Cancer Risk BioMed Res. Int. 2020 2020 5107696 10.1155/2020/5107696 32802852 PMC7403933 14. Yano Y. Abnet C.C. Roshandel G. Graf A. Poustchi H. Khoshnia M. Pourshams A. Kamangar F. Boffetta P. Brennan P. Dental Health and Lung Cancer Risk in the Golestan Cohort Study BMC Cancer 2024 24 74 10.1186/s12885-024-11850-5 38218793 PMC10787979 15. Kesharani P. Kansara P. Kansara T. Kini A. Bhat R. Shetty P. Penugonda B. Is Periodontitis a Risk Factor for Lung Cancer? A Meta-Analysis and Detailed Review of Mechanisms of Association Contemp. Clin. Dent. 2022 13 297 306 10.4103/ccd.ccd_117_22 36686995 PMC9855255 16. Zhang X. Liu B. Lynn H.S. Chen K. Dai H. Poor Oral Health and Risks of Total and Site-Specific Cancers in China: A Prospective Cohort Study of 0.5 Million Adults eClinicalMedicine 2022 45 101330 10.1016/j.eclinm.2022.101330 35274091 PMC8902628 17. Farquhar D.R. Divaris K. Mazul A.L. Weissler M.C. Zevallos J.P. Olshan A.F. Poor Oral Health Affects Survival in Head and Neck Cancer Oral Oncol. 2017 73 111 117 10.1016/j.oraloncology.2017.08.009 28939062 PMC5659716 18. Divaris K. Olshan A.F. Smith J. Bell M.E. Weissler M.C. Funkhouser W.K. Bradshaw P.T. Oral Health and Risk for Head and Neck Squamous Cell Carcinoma: The Carolina Head and Neck Cancer Study Cancer Causes Control 2010 21 567 575 10.1007/s10552-009-9486-9 20049634 PMC2925153 19. Johnson G.K. Hill M. Cigarette Smoking and the Periodontal Patient J. Periodontol. 2004 75 196 209 10.1902/jop.2004.75.2.196 15068107 20. Knorst J.K. Sfreddo C.S. de F Meira G. Zanatta F.B. Vettore M.V. Ardenghi T.M. Socioeconomic Status and Oral Health-Related Quality of Life: A Systematic Review and Meta-Analysis Community Dent. Oral Epidemiol. 2021 49 95 102 10.1111/cdoe.12616 33368600 21. Donaldson A.N. Everitt B. Newton T. Steele J. Sherriff M. Bower E. The Effects of Social Class and Dental Attendance on Oral Health J. Dent. Res. 2008 87 60 64 10.1177/154405910808700110 18096895 22. Sudlow C. Gallacher J. Allen N. Beral V. Burton P. Danesh J. Downey P. Elliott P. Green J. Landray M. UK Biobank: An Open Access Resource for Identifying the Causes of a Wide Range of Complex Diseases of Middle and Old Age PLoS Med. 2015 12 e1001779 10.1371/journal.pmed.1001779 25826379 PMC4380465 23. Elliott P. Peakman T.C. UK Biobank The UK Biobank Sample Handling and Storage Protocol for the Collection, Processing and Archiving of Human Blood and Urine Int. J. Epidemiol. 2008 37 234 244 10.1093/ije/dym276 18381398 24. Conroy M.C. Lacey B. Bešević J. Omiyale W. Feng Q. Effingham M. Sellers J. Sheard S. Pancholi M. Gregory G. UK Biobank: A Globally Important Resource for Cancer Research Br. J. Cancer 2023 128 519 527 10.1038/s41416-022-02053-5 36402876 PMC9938115 25. Abbood H.M. Hinz J. Cherukara G. Macfarlane T.V. Validity of Self-Reported Periodontal Disease: A Systematic Review and Meta-Analysis J. Periodontol. 2016 87 1474 1483 10.1902/jop.2016.160196 27523519 26. Eke P.I. Dye B.A. Wei L. Slade G.D. Thornton-Evans G.O. Beck J.D. Taylor G.W. Borgnakke W.S. Page R.C. Genco R.J. Self-Reported Measures for Surveillance of Periodontitis J. Dent. Res. 2013 92 1041 1047 10.1177/0022034513505621 24065636 27. National Center for Chronic Disease Prevention and Health Promotion (US) Office on Smoking and Health The Health Consequences of Smoking—50 Years of Progress: A Report of the Surgeon General Reports of the Surgeon General Centers for Disease Control and Prevention (US) Atlanta, GA, USA 2014 24455788 28. Tasoulas J. Farquhar D.R. Sheth S. Hackman T. Yarbrough W.G. Agala C.B. Koric A. Giraldi L. Fabianova E. Lissowska J. Poor Oral Health Influences Head and Neck Cancer Patient Survival: An International Head and Neck Cancer Epidemiology Consortium Pooled Analysis JNCI J. Natl. Cancer Inst. 2024 116 105 114 10.1093/jnci/djad156 37725515 PMC10777670 29. Martínez-García M. Hernández-Lemus E. Periodontal Inflammation and Systemic Diseases: An Overview Front. Physiol. 2021 12 709438 10.3389/fphys.2021.709438 34776994 PMC8578868 30. Hajishengallis G. Chavakis T. Local and Systemic Mechanisms Linking Periodontal Disease and Inflammatory Comorbidities Nat. Rev. Immunol. 2021 21 426 440 10.1038/s41577-020-00488-6 33510490 PMC7841384 31. Murray P.E. Coffman J.A. Garcia-Godoy F. Oral Pathogens’ Substantial Burden on Cancer, Cardiovascular Diseases, Alzheimer’s, Diabetes, and Other Systemic Diseases: A Public Health Crisis—A Comprehensive Review Pathogens 2024 13 1084 10.3390/pathogens13121084 39770344 PMC11677847 32. Balkwill F. TNF-Alpha in Promotion and Progression of Cancer Cancer Metastasis Rev. 2006 25 409 416 10.1007/s10555-006-9005-3 16951987 33. Van Dyke T.E. Bartold P.M. Reynolds E.C. The Nexus Between Periodontal Inflammation and Dysbiosis Front. Immunol. 2020 11 511 10.3389/fimmu.2020.00511 32296429 PMC7136396 34. Chen J. Domingue J.C. Sears C.L. Microbiota Dysbiosis in Select Human Cancers: Evidence of Association and Causality Semin. Immunol. 2017 32 25 34 10.1016/j.smim.2017.08.001 28822617 PMC5660659 35. Tuominen H. Rautava J. Oral Microbiota and Cancer Development Pathobiology 2021 88 116 126 10.1159/000510979 33176328 36. Bakhti S.Z. Latifi-Navid S. Oral Microbiota and Helicobacter Pylori in Gastric Carcinogenesis: What Do We Know and Where Next? BMC Microbiol. 2021 21 71 10.1186/s12866-021-02130-4 33663382 PMC7934379 37. Huang C. Shi G. Smoking and Microbiome in Oral, Airway, Gut and Some Systemic Diseases J. Transl. Med. 2019 17 225 10.1186/s12967-019-1971-7 31307469 PMC6632217 38. Feng L. Wang L. Effects of Alcohol on the Morphological and Structural Changes in Oral Mucosa Pak. J. Med. Sci. 2013 29 1046 1049 10.12669/pjms.294.3696 24353685 PMC3817782 39. Qiu F. Liang C.-L. Liu H. Zeng Y.-Q. Hou S. Huang S. Lai X. Dai Z. Impacts of Cigarette Smoking on Immune Responsiveness: Up and down or Upside Down? Oncotarget 2017 8 268 284 10.18632/oncotarget.13613 27902485 PMC5352117 40. Fakhry C. Gillison M.L. D’Souza G. Tobacco Use and Oral HPV-16 Infection JAMA 2014 312 1465 10.1001/jama.2014.13183 25291584 PMC4266546 41. Hong Y.-R. Mainous A.G. Electronic Cigarette Use and Oral Human Papillomavirus Infection Among US Adult Population: Analysis of 2013–2016 NHANES J. Gen. Intern. Med. 2021 36 1454 1456 10.1007/s11606-020-05874-3 32514893 PMC8131464 42. Dietrich T. Bernimoulin J.-P. Glynn R.J. The Effect of Cigarette Smoking on Gingival Bleeding J. Periodontol. 2004 75 16 22 10.1902/jop.2004.75.1.16 15025212 43. Buduneli N. Scott D.A. Tobacco-Induced Suppression of the Vascular Response to Dental Plaque Mol. Oral Microbiol. 2018 33 271 282 10.1111/omi.12228 29768735 PMC8246627 44. Ward E. Jemal A. Cokkinides V. Singh G.K. Cardinez C. Ghafoor A. Thun M. Cancer Disparities by Race/Ethnicity and Socioeconomic Status CA Cancer J. Clin. 2004 54 78 93 10.3322/canjclin.54.2.78 15061598 45. Bonevski B. Regan T. Paul C. Baker A.L. Bisquera A. Associations between Alcohol, Smoking, Socioeconomic Status and Comorbidities: Evidence from the 45 and Up Study Drug Alcohol Rev. 2014 33 169 176 10.1111/dar.12104 24372899 46. van Oers J.A. Bongers I.M. van de Goor L.A. Garretsen H.F. Alcohol Consumption, Alcohol-Related Problems, Problem Drinking, and Socioeconomic Status Alcohol Alcohol. 1999 34 78 88 10.1093/alcalc/34.1.78 10075406 47. Clegg L.X. Reichman M.E. Miller B.A. Hankey B.F. Singh G.K. Lin Y.D. Goodman M.T. Lynch C.F. Schwartz S.M. Chen V.W. Impact of Socioeconomic Status on Cancer Incidence and Stage at Diagnosis: Selected Findings from the Surveillance, Epidemiology, and End Results: National Longitudinal Mortality Study Cancer Causes Control 2009 20 417 435 10.1007/s10552-008-9256-0 19002764 PMC2711979 48. Komagamine Y. Kanazawa M. Kaiba Y. Sato Y. Minakuchi S. Reliability and Validity of a Questionnaire for Self-Assessment of Complete Dentures BMC Oral Health 2014 14 45 10.1186/1472-6831-14-45 24885473 PMC4012717 49. Ueno M. Zaitsu T. Shinada K. Ohara S. Kawaguchi Y. Validity of the Self-Reported Number of Natural Teeth in Japanese Adults J. Investig. Clin. Dent. 2010 1 79 84 10.1111/j.2041-1626.2010.00016.x 25427261 50. Fry A. Littlejohns T.J. Sudlow C. Doherty N. Adamska L. Sprosen T. Collins R. Allen N.E. Comparison of Sociodemographic and Health-Related Characteristics of UK Biobank Participants With Those of the General Population Am. J. Epidemiol. 2017 186 1026 1034 10.1093/aje/kwx246 28641372 PMC5860371 Figure 1 Prevalence (%) of oral health conditions among study participants. The prevalence rates of oral health conditions of participants who developed respiratory tract cancers and those who did not were significantly different after correcting for multiple comparisons (all p p cancers-17-03028-t001_Table 1 Table 1 Baseline characteristics of study participants.   Respiratory Tract Cancer  Characteristics Total N Incident Cancer N No Cancer N p a Follow-up period, years, mean (sd) 10.3 (2.7) 6.6 (3.4) 10.4 (2.6) <0.001 Age, years, mean (sd) 56.2 (8.1) 61.5 (5.9) 56.2 (8.1) <0.001 Sex, n (%)     Women 233,176 (53.1) 1645 (46.1) 231,531 (53.2) <0.001 Men 205,586 (46.9) 1923 (53.9) 203,663 (46.8)  Race, b    <0.001 White 414,145 (94.4) 3464 (97.1) 410,681 (94.4)  Black 7371 (1.7) 30 (0.8) 7341 (1.7)  Other 17,246 (3.9) 74 (2.1) 17,172 (3.9)  Education, c    <0.001 Did not complete high school 72,869 (16.8) 1342 (38.1) 71,527 (16.6)  Completed high school 73,451 (16.9) 529 (15.0) 72,922 (16.9)  Vocational school or some college 144,298 (33.2) 1061 (30.1) 143,237 (33.2)  University and beyond 143,845 (33.1) 589 (16.7) 143,256 (33.2)  Missing or unknown 4299 47 4252  Income, n (%)    <0.001 Less than GBP 18,000 83,148 (22.0) 1290 (44.5) 81,858 (21.9)  GBP 18,000 to GBP 30,999 94,819 (25.1) 832 (28.7) 93,987 (25.1)  GBP 31,000 to GBP 51,999 99,582 (26.4) 469 (16.2) 99,113 (26.5)  GBP 52,000 to GBP 100,000 78,841 (20.9) 241 (8.3) 78,600 (21.0)  Greater than GBP 100,000 20,973 (5.6) 67 (2.3) 20,906 (5.6)  Missing or unknown 61,399 669 60,730  Smoking status with pack-years, n (%)    <0.001 Never smoked 242,665 (55.3) 486 (13.6) 242,179 (55.6)  Former smokers 149,898 (34.2) 1580 (44.3) 148,318 (34.1)  Current smokers with <20 pack-years 14,391 (3.3) 221 (6.2) 14,170 (3.3)  Current smokers with ≥20 pack-years 22,321 (5.1) 1177 (33.0) 21,144 (4.9)  Current smokers missing pack-years 9487 (2.2) 104 (2.9) 9383 (2.2)  Alcohol consumption, n (%)    <0.001 Never 34,827 (7.9) 370 (10.4) 34,457 (7.9)  1–3 times per month or occasionally 98,749 (22.5) 798 (22.4) 97,951 (22.5)  1–4 times per week 215,720 (49.2) 1476 (41.5) 214,244 (49.3)  Daily or almost daily 89,144 (20.3) 916 (25.7) 88,228 (20.3)  Missing or unknown 322 8 314  Obesity status, d    <0.001 Underweight 2188 (0.5) 38 (1.1) 2150 (0.5)  Normal 141,510 (32.4) 1099 (31.1) 140,411 (32.4)  Overweight 186,181 (42.7) 1488 (42.1) 184,693 (42.7)  Obese 106,629 (24.4) 911 (25.8) 105,718 (24.4)  Missing or unknown 2254 32 2223  History of COPD, n (%) 1518 (0.3) 46 (1.3) 1472 (0.3) <0.001 Abbreviations: COPD, chronic obstructive pulmonary disease; GBP, Great British Pound; N, number; sd, standard deviation. a b c d cancers-17-03028-t002_Table 2 Table 2 Association between oral health conditions and respiratory tract cancer and its subtypes.  Cases, n Person-Years Incidence a Hazard Ratio b Hazard Ratio c  Respiratory Tract Cancer      Any Oral Health Condition 2098 1,783,863 1.18 1.50 (1.40–1.60) 1.35 (1.25–1.46) Dentures 1492 717,299 2.08 1.63 (1.52–1.75) 1.48 (1.36–1.60) Loose teeth 348 193,176 1.80 1.42 (1.27–1.59) 1.36 (1.20–1.54) Painful gums 155 137,030 1.13 1.31 (1.11–1.54) 1.25 (1.04–1.50) Bleeding gums 306 619,621 0.49 0.97 (0.86–1.09) 0.98 (0.86–1.12) Toothache 150 205,971 0.73 1.01 (0.86–1.19) 0.95 (0.79–1.15) Mouth ulcers 308 461,821 0.67 1.08 (0.96–1.22) 1.03 (0.90–1.17)  Bronchus and Lung Cancer      Any Oral Health Condition 2000 1,783,247 1.12 1.49 (1.39–1.59) 1.34 (1.24–1.45) Dentures 1428 716,878 1.99 1.63 (1.52–1.75) 1.47 (1.36–1.60) Loose teeth 337 193,109 1.75 1.45 (1.29–1.62) 1.37 (1.21–1.56) Painful gums 148 137,007 1.08 1.30 (1.10–1.54) 1.24 (1.03–1.49) Bleeding gums 292 619,546 0.47 0.96 (0.85–1.09) 0.98 (0.85–1.12) Toothache 140 205,907 0.68 1.00 (0.84–1.18) 0.93 (0.76–1.13) Mouth ulcers 295 461,750 0.64 1.08 (0.96–1.22) 1.02 (0.89–1.17)  Laryngeal Cancer      Any Oral Health Condition 96 1,770,596 0.05 1.76 (1.28–2.43) 1.76 (1.23–2.52) Dentures 62 707,930 0.09 1.64 (1.17–2.29) 1.49 (1.02–2.16) Loose teeth 11 190,968 0.06 0.94 (0.51–1.74) 1.10 (0.59–2.06) Painful gums 7 136,049 0.05 1.53 (0.71–3.26) 1.49 (0.66–3.40) Bleeding gums 14 617,830 0.02 1.09 (0.62–1.90) 1.13 (0.62–2.07) Toothache 10 204,992 0.05 1.32 (0.69–2.51) 1.42 (0.72–2.80) Mouth ulcers 13 459,898 0.03 1.16 (0.65–2.05) 1.17 (0.63–2.18) Tracheal cancer was not reported separately due to the extremely low incidence, with fewer than five cases. a b c cancers-17-03028-t003_Table 3 Table 3 Association between oral health conditions and respiratory tract cancer.  Cases, n Person-Years Incidence a Hazard Ratio b Hazard Ratio c  Number of Existing Conditions      None 1470 2,756,088 0.53 1 (reference) 1 (reference) 1 1603 1,365,174 1.17 1.46 (1.36–1.57) 1.32 (1.22–1.43) 2 370 318,934 1.16 1.58 (1.41–1.77) 1.42 (1.25–1.62) 3 90 74,911 1.20 1.71 (1.38–2.12) 1.57 (1.23–1.98) 4+ 35 24,844 1.41 1.96 (1.40–2.73) 1.71 (1.16–2.50)  Severity of Poor Oral Health d      None 1470 2,756,088 0.53 1 (reference) 1 (reference) Mouth ulcers, toothache 180 361,327 0.50 1.11 (0.95–1.29) 1.04 (0.88–1.24) Bleeding/painful gums, loose teeth 426 705,237 0.60 1.22 (1.10–1.36) 1.14 (1.01–1.29) Dentures 1492 717,299 2.08 1.71 (1.59–1.84) 1.52 (1.40–1.66) a b c d cancers-17-03028-t004_Table 4 Table 4 Association between the presence of oral health conditions and the risk of respiratory tract cancer across subgroups.  Cases, n Person-Years Incidence a Hazard Ratio (95% CI) b p interaction c Age group, d      <50 171 1,182,777 0.14 1.30 (0.94–1.82) 0.51 50–57 628 1,213,256 0.52 1.39 (1.17–1.65)  58–62 960 1,010,400 0.95 1.37 (1.19–1.59)  ≥63 1809 1,133,518 1.60 1.38 (1.23–1.54)  Sex      Women 1645 2,440,333 0.67 1.38 (1.23–1.55) 0.71 Men 1923 2,099,618 0.92 1.33 (1.20–1.47)  Education      Did not complete high school 1342 736,027 1.82 1.46 (1.27–1.67) 0.20 Completed high school 529 760,716 0.70 1.40 (1.15–1.69)  Vocational school or some college 1061 1,495,759 0.71 1.36 (1.19–1.55)  University and beyond 589 1,503,512 0.39 1.13 (0.95–1.35)  Income      Less than GBP 18,000 1290 840,269 1.54 1.53 (1.36–1.72) 0.14 GBP 18,000 to GBP 30,999 832 971,601 0.86 1.29 (1.12–1.49)  GBP 31,000 to GBP 51,999 469 1,042,460 0.45 1.11 (0.92–1.33)  GBP 52,000 to GBP 100,000 241 834,354 0.29 1.24 (0.96–1.61)  Greater than GBP 100,000 67 221,718 0.30 1.45 (0.88–2.39)  Smoking Status with Pack-Years      Never smoked 486 2,539,171 0.19 1.12 (0.91–1.39) 0.002 Former smokers 1580 1,529,466 1.03 1.50 (1.34–1.68)  Current smokers with <20 pack-years 221 150,382 1.47 1.52 (1.13–2.06)  Current smokers with ≥20 pack-years 1177 222,344 5.29 1.22 (1.06–1.39)  Current smokers missing pack-years 104 98,588 1.05 1.18 (0.74–1.86)  Alcohol Consumption      Never 370 357,896 1.03 1.24 (0.95–1.60) 0.78 1–3 times per month or occasionally 798 1,024,421 0.78 1.52 (1.29–1.80)  1–4 times per week 1476 2,242,781 0.66 1.31 (1.16–1.47)  Daily or almost daily 916 911,572 1.00 1.33 (1.15–1.54)  Obesity Status      Underweight 38 22,382 1.70 1.41 (0.60–3.32) 0.99 Normal 1099 1,477,722 0.74 1.32 (1.15–1.51)  Overweight 1488 1,923,046 0.77 1.34 (1.19–1.51)  Obese 911 1,094,892 0.83 1.39 (1.20–1.62)  History of COPD      Yes 46 15,306 3.01 1.40 (0.75–2.64) 0.83 No 3522 4,524,645 0.78 1.35 (1.25–1.46)  Abbreviations: COPD, chronic obstructive pulmonary disease; GBP, Great British Pound; N, number. a b c d ",
  "metadata": {
    "Title of this paper": "Comparison of Sociodemographic and Health-Related Characteristics of UK Biobank Participants With Those of the General Population",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468644/"
  }
}