{
  "title": "Paper_847",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472469 PMC12472469.1 12472469 12472469 41011230 10.3390/ph18091361 pharmaceuticals-18-01361 1 Article Oligomeric Proanthocyanidins Reverse Lenvatinib Resistance in Hepatocellular Carcinoma Through ITGA3-Mediated Pathway Noma Takayuki Methodology Formal analysis Data curation Writing – original draft 1 2 https://orcid.org/0009-0000-0126-1331 Li Yuan Methodology Investigation Writing – original draft 1 3 Wada Yuma Resources Writing – original draft 2 Morine Yuji Investigation Supervision 2 Ikemoto Tetsuya Resources Supervision 2 https://orcid.org/0000-0001-6349-1669 Saito Yu Resources 2 Yamada Shinichiro Resources 2 Teraoku Hiroki Resources 2 https://orcid.org/0000-0003-1255-4783 Shimada Mitsuo Resources Supervision 2 https://orcid.org/0000-0003-1396-6341 Goel Ajay Conceptualization Resources Project administration Funding acquisition 1 4 * Panossian Alexander George Academic Editor Tsim Karl Wah-Keung Academic Editor 1 tnoma@coh.org yuali@coh.org 2 wada.yuuma@tokushima-u.ac.jp ymorine@tokushima-u.ac.jp ikemoto.tetsuya@tokushima-u.ac.jp saito.yu.1001@tokushima-u.ac.jp yamada.shinichirou@tokushima-u.ac.jp teraoku.hiroki@tokushima-u.ac.jp mitsuo.shimada@tokushima-u.ac.jp 3 4 * ajgoel@coh.org 12 9 2025 9 2025 18 9 497460 1361 04 8 2025 02 9 2025 09 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Methods Results p p Conclusions hepatocellular carcinoma oligomeric proanthocyanidins lenvatinib resistance synergistic effect anoikis ITGA3 National Cancer Institute, National Institutes of Health CA72851 CA181572 CA184792 CA187956 CA202797 CA214254 CA271443 This work was supported by the following grants from the National Cancer Institute, National Institutes of Health: CA72851, CA181572, CA184792, CA187956, CA202797, CA214254, and CA271443. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hepatocellular carcinoma (HCC) is the major type of primary liver cancer, with approximately 800,000 cases annually, ranking as the third leading cause of cancer-related deaths [ 1 2 3 4 5 6 7 8 9 10 11 12 13 11 14 15 In this context, several naturally derived plant compounds have garnered increasing attention from researchers and clinicians due to their multi-targeted mechanisms and safer therapeutic profiles compared to conventional chemotherapies and molecular targeted therapies [ 16 17 18 19 20 21 22 22 In this study, we systematically evaluated for the first time the antitumor effects of OPCs using network pharmacology approaches in HCC using two different HCC cell lines. Additionally, we performed genome-wide transcriptomic profiling analysis to identify the molecular mechanism(s) and key pathways associated with Lenvatinib resistance in HCC. Finally, we validated the mechanism by which OPCs overcome Lenvatinib resistance. 2. Results 2.1. Establishment of Lenvatinib-Resistant HCC Cell Lines and Evaluation of OPCs-Mediated Synergistic Effects To investigate whether OPCs can help overcome Lenvatinib resistance in HCC, we established Lenvatinib-resistant Huh-7 cells (rHuh-7) and Lenvatinib-resistant PLC-PRF-5 cells (rPLC) by gradually increasing the concentration of Lenvatinib over several months in parental Huh-7 cells (pHuh-7) and PLC-PRF-5 cells (pPLC). Notably, the half-maximal inhibitory concentration (IC 50 50 Figure 1 50 Figure 1 Next, we assessed whether OPCs could exert antiproliferative effects in HCC cell lines. OPCs reduced cell viability in a dose-dependent manner, with IC 50 Figure 1 Figure 1 50 50 Figure 1 Figure 1 2.2. Evaluation of the Effects of Lenvatinib and OPCs on Cell Migration and Invasion We next assessed the effects of Lenvatinib and OPCs on colony formation, migration, and invasion in Lenvatinib-resistant HCC cells. Lenvatinib alone had a minimal impact on colony formation in both rHuh-7 and rPLC, whereas OPCs significantly reduced colony-forming ability. Notably, the combination treatment further suppressed colony formation by 82.0% in rHuh-7 and 77.8% in rPLC ( p Figure 2 p Figure 2 p Figure 2 2.3. Combination of OPCs and Lenvatinib Induces Apoptosis and Suppresses Cancer Stemness in Resistance HCC Cell Lines To evaluate the apoptotic modulation induced by Lenvatinib and OPCs in HCC cell lines, we performed an Annexin V binding assay. The baseline viable cell rates were 94.3% for rHuh-7 and 89.6% for rPLC. As expected, treatment with Lenvatinib did not affect the viability of the resistant cell lines (rHuh-7: 92.5%, rPLC: 88.9%; Figure 3 Figure 3 p p p p Figure 3 Figure 3 Next, to determine whether OPCs also affect cancer stemness, we performed spheroid formation assays with cancer spheroids developed from two Lenvatinib-resistant cells. Spheroid size was assessed after the end of treatment; OPCs treatment and Lenvatinib significantly reduced the number and size of spheroids ( Figure 3 p p p Figure 3 2.4. Transcriptome Profiling Identified Involved Pathways and Genes That Could Be Targeted to Overcome Lenvatinib Resistance A comprehensive genome-wide transcriptomic profiling analysis was performed on parental and Lenvatinib-resistant HCC cells using a public dataset ( GSE186191 p Figure 4 https://david.ncifcrf.gov/ 23 p Figure 4 24 25 26 p p p p Figure 4 To further validate the biological relevance of ITGA3 in clinical HCC, we analyzed ITGA3 expression in paired tumor and non-tumor mucosa specimens ( n p Figure 4 p Figure 4 2.5. siRNA-Mediated Knockdown of ITGA3 Suppresses Tumorigenic Features and Induces Anoikis Sensitivity in HCC Cells To elucidate the role of ITGA3 in Lenvatinib resistance in HCC, we performed siRNA-mediated knockdown of ITGA3 in Lenvatinib-resistant HCC cell lines (rHuh-7 and rPLC). Combined ITGA3 knockdown and Lenvatinib treatment significantly inhibited cell proliferation in rHuh-7 ( p p p Figure 5 Figure S1A Figure S1B Figure S1C Figure S1D To further evaluate the impact of ITGA3 knockdown on cell viability, apoptosis was quantified using Annexin V binding assays. Compared with cells transfected with negative control siRNA, ITGA3 knockdown significantly increased apoptosis in both rHuh-7 (FC = 2.58, p p Figure 5 p p Figure 5 Figure 5 Anoikis, a form of programmed cell death triggered by detachment from the ECM, is frequently circumvented in cancer cells via dysregulation of signaling pathways such as Ras/ERK and PI3K/AKT, as well as through remodeling of the ECM [ 27 28 29 30 31 32 33 34 Figure 5 2.6. Combined OPCs and Lenvatinib Therapy Restores Anoikis Sensitivity Through ITGA3–EGFR–AKT Pathway Inhibition OPCs, widely studied for their anti-tumor properties, are known to inhibit multiple signaling pathways, thereby suppressing tumor growth, migration, and invasion [ 35 36 37 38 Figure 6 Figure 6 Figure 6 3. Discussion HCC remains a major global health concern, representing the most common primary liver malignancy and the sixth most frequently diagnosed cancer worldwide [ 1 5 39 40 4 24 25 26 27 28 30 32 Natural compounds with broad-spectrum anti-cancer activities, such as OPCs, offer a promising adjunctive approach. OPCs, naturally occurring polyphenols found in various fruits, vegetables, and plants, have demonstrated potent anti-tumor effects in a variety of cancers [ 21 19 41 42 In this study, we hypothesized that overexpression of ITGA3 activates the EGFR–AKT pathway through enhanced ECM pathways, contributing to Lenvatinib resistance in HCC. We further proposed that OPCs could overcome this resistance by targeting the ITGA3–EGFR–AKT signaling axis. Our results demonstrated that OPC treatment, particularly in combination with Lenvatinib, effectively inhibited proliferation and invasion in Lenvatinib-resistant HCC cells. Mechanistically, OPCs significantly downregulated the ITGA3–EGFR–AKT axis. We also observed that OPCs treatment reduced the spheroid-forming capacity of resistant cells, suggesting that it may suppress cancer stem cell-like properties. Moreover, ITGA3 overexpression was found to contribute to anoikis resistance, a known mechanism of chemoresistance. Importantly, co-administration of OPCs and Lenvatinib enhanced anoikis sensitivity and restored drug responsiveness in resistant cells. Apoptosis assays further confirmed that the combination therapy induced cell death, supporting its therapeutic potential. We would like to acknowledge some of the limitations of this study. First, the current study employed only two Lenvatinib-resistant cell lines, which may limit the generalizability of the findings. Validation in a broader panel of HCC models is necessary. Second, although our results provide strong in vitro evidence, preclinical studies in animal models are essential to assess the in vivo efficacy and safety of the OPCs and Lenvatinib combination therapy. Nevertheless, this study is the first to demonstrate that ITGA3 plays a critical role in Lenvatinib resistance in HCC and that OPCs can potentially overcome this resistance by targeting the ITGA3–EGFR–AKT pathway. Moreover, our clinical sample analysis revealed a significant association between high ITGA3 expression and poor prognosis in HCC patients, further supporting ITGA3 as a promising and clinically relevant therapeutic target. Future studies should focus on validating these findings in vivo and exploring the therapeutic potential of OPCs in preclinical animal models. 4. Materials and Methods 4.1. Patient Cohort This study included frozen tumor and normal tissue specimens from 83 HCC patients enrolled at Tokushima University, Japan. Patient characteristics are detailed in Table S1 4.2. Cell Culture and Materials Two human HCC cell lines, Huh-7 and PLC-PRF-5 (PLC), were examined in this study and obtained from the RIKEN BioResource Center Cell Bank (Tsukuba, Japan). Both cell lines were cultured in Dulbecco’s Modified Eagle’s Medium (DMEM; Gibco, Carlsbad, CA, USA) containing 10% fetal bovine serum, and 1% penicillin and streptomycin, maintained in a humidified incubator at 37 °C in 5% CO 2 4.3. Herbal Preparations and Drug Preparation The OPCs used in this study were obtained from VX1 ® Lenvatinib (Sigma-Aldrich) was dissolved in DMSO (Sigma-Aldrich). The stock solution of Lenvatinib was carefully stored at −20 °C in the dark, ensuring its stability and reliability. This stock solution was diluted with a complete culture medium to the necessary experimental concentrations before each application. 4.4. Cell Viability Assays For these assays, 5 × 10 3 https://synergyfinder.fimm.fi 43 4.5. Establishment of Lenvatinib-Resistant HCC Cell Lines Lenvatinib-resistant cells were induced from continuous culture of Huh-7 and PLC cell lines in Lenvatinib-enriched medium. The parental cell lines were treated with increasing doses of Lenvatinib, with concentrations of 0.5 µM administered weekly over 10 months. Finally, resistant cells that could grow stably in medium containing 20 µM Lenvatinib were selected for further experiments. 4.6. Invasion Assay For the invasion assay, cells (2.5 × 10 4 4.7. The Wound Healing Assay For the wound healing assay, cells treated with Lenvatinib, OPCs, and their combination were seeded into 6-well plates and grown to 80% confluency. Wounds were made by scraping 200 µL of monolayer cells with a pipette tip (RAININ, LLC, Oakland, CA, USA). 24 h after wounding, treated and control cells were examined under a microscope (Zeiss, Oberkochen, Germany). 4.8. The Colony Formation Assay For the colony formation assay, 5 × 10 2 4.9. Apoptosis Assay For the Annexin V binding apoptosis assay, cells were seeded in 6-well plates and then treated with Lenvatinib, OPCs, and their combinations for 48 h. Apoptotic cell fractions were then measured using the Muse Cell Analyzer (Millipore Corp, Billerica, MA, USA) and Annexin V and Dead Cell Kit (Luminex Corp, Austin, TX, USA) according to the manufacturer’s instructions. 4.10. Spheroid Formation Assays Methods for these assays have been described previously [ 44 4.11. Identification of Differentially Expressed Genes and Functional Pathway Enrichment in Lenvatinib-Resistant HCC Cells To identify genes that are differentially regulated in Lenvatinib-resistant HCC cells, we analyzed gene expression data obtained from the Gene Expression Omnibus (GEO) database ( https://www.ncbi.nlm.nih.gov/geo/ GSE186191 p https://david.ncifcrf.gov/ https://david.ncifcrf.gov/ 23 p 4.12. RNA Extraction and qRT-PCR Total RNA was isolated from cancer cells treated with Lenvatinib, OPCs, or their combination for 24 h using the Qiagen miRNeasy Kit (Qiagen, Hilden, Germany). Complementary DNA (cDNA) was synthesized from the extracted RNA using a high-capacity cDNA reverse transcription kit (Thermo Fisher Scientific), QuantStudio 6/7 Flex RT-PCR System (Applied Biosystems, Foster City, CA, USA), and qRT-PCR was performed using SensiFAST SYBR Lo-ROX Kit (Bioline, London, UK). The housekeeping gene GAPDH was used as an internal control. Gene expression levels were quantified using the ΔCt method, which calculates the difference in Ct values between the target and control genes. The primer sequences used in this study are described in Table S2 4.13. Protein Isolation and Western Blotting Western blotting was performed according to previous studies [ 44 45 4.14. Transfection of Small Interfering RNA In this study, 1 × 10 6 4.15. Anoikis Assay Anoikis resistance was assessed using the CytoSelect™ 96-Well Anoikis Assay (Cell Biolabs, San Diego, CA, USA; Cat# CBA-081). Huh-7 and PLC HCC cells were seeded at a density of 2 × 10 4 2 4.16. Statistical Analysis All experiments were conducted in triplicate, and the results were presented as mean ± standard deviation (SD). For statistical comparisons between two groups, the Wilcoxon rank-sum test (Mann–Whitney U test) was applied. A p 5. Conclusions In conclusion, our findings suggest that ITGA3-mediated activation of the EGFR–AKT pathway and associated anoikis resistance play critical roles in Lenvatinib resistance. Targeting this axis with OPCs restores anoikis sensitivity and resensitizes resistant HCC cells to Lenvatinib. These results highlight a novel therapeutic avenue for overcoming Lenvatinib resistance and provide a promising rationale for future clinical translation of OPCs-based combination strategies in HCC treatment. Acknowledgments The authors thank Caiming Xu, Silei Sui, Alessandro Mannucci, and Koichi Takiguchi for their thoughtful discussions and advice during this project. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091361/s1 Author Contributions Conceptualization, T.N., Y.L. and A.G.; formal analysis, T.N., Y.L.; resources, Y.W., Y.M., T.I., Y.S., S.Y., H.T., M.S.; clinical samples, Y.W., Y.M., T.I., Y.S., S.Y., H.T., M.S.; Lenvatinib-resistant cell lines, Y.W., Y.M., T.I., Y.S., S.Y., H.T., M.S., data curation, T.N., Y.L. and A.G.; writing—original draft preparation, T.N.; writing—review and editing, Y.L. and A.G.; visualization, T.N. and A.G.; supervision, A.G.; project administration, A.G.; funding acquisition, A.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the guidelines of the Declaration of Helsinki and was approved by the Institutional Review Board of City of Hope (protocol code 187811, dated 20 April 2020). Informed Consent Statement In accordance with the Declaration of Helsinki, all patients have provided written informed consent. Data Availability Statement The datasets generated and/or analyzed during the current study are available from the corresponding author on reasonable request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HCC Hepatocellular carcinoma ICIs Immune checkpoint inhibitors TKIs Multi-tyrosine kinase inhibitors OS Overall survival IC 50 Half-maximal inhibitory concentration OPCs Oligomeric proanthocyanidins PLC PLC-PRF-5 FC Fold change ECM Extracellular matrix EGFR Epidermal growth factor receptor DMEM Dulbecco’s Modified Eagle’s medium DMSO Dimethyl sulfoxide FBS Fetal bovine serum DAVID Database for Annotation, Visualization, and Integrated Discovery KEGG Kyoto Encyclopedia of Genes and Genomes CCK-8 Cell Counting Kit-8 PBS Phosphate-buffered saline SD Standard deviation HR Hazard ratios CI Confidence intervals cDNA Complementary DNA qRT-PCR Quantitative reverse transcription polymerase chain reaction References 1. Llovet J.M. Kelley R.K. Villanueva A. Singal A.G. Pikarsky E. Roayaie S. Lencioni R. Koike K. Zucman-Rossi J. Finn R.S. Hepatocellular carcinoma Nat. Rev. Dis. Primers 2021 7 6 10.1038/s41572-020-00240-3 33479224 2. Llovet J.M. Ricci S. Mazzaferro V. Hilgard P. Gane E. Blanc J.F. de Oliveira A.C. Santoro A. Raoul J.L. Forner A. Sorafenib in advanced hepatocellular carcinoma N. Engl. J. Med. 2008 359 378 390 10.1056/NEJMoa0708857 18650514 3. Johnson P.J. Qin S. Park J.W. Poon R.T. Raoul J.L. Philip P.A. Hsu C.H. Hu T.H. Heo J. Xu J. Brivanib versus sorafenib as first-line therapy in patients with unresectable, advanced hepatocellular carcinoma: Results from the randomized phase III BRISK-FL study J. Clin. Oncol. 2013 31 3517 3524 10.1200/JCO.2012.48.4410 23980084 4. Kudo M. Finn R.S. Qin S. Han K.H. Ikeda K. Piscaglia F. Baron A. Park J.W. Han G. Jassem J. Lenvatinib versus sorafenib in first-line treatment of patients with unresectable hepatocellular carcinoma: A randomised phase 3 non-inferiority trial Lancet 2018 391 1163 1173 10.1016/S0140-6736(18)30207-1 29433850 5. Finn R.S. Qin S. Ikeda M. Galle P.R. Ducreux M. Kim T.Y. Kudo M. Breder V. Merle P. Kaseb A.O. Atezolizumab plus Bevacizumab in Unresectable Hepatocellular Carcinoma N. Engl. J. Med. 2020 382 1894 1905 10.1056/NEJMoa1915745 32402160 6. Cheng A.L. Qin S. Ikeda M. Galle P.R. Ducreux M. Kim T.Y. Lim H.Y. Kudo M. Breder V. Merle P. Updated efficacy and safety data from IMbrave150: Atezolizumab plus bevacizumab vs. sorafenib for unresectable hepatocellular carcinoma J. Hepatol. 2022 76 862 873 10.1016/j.jhep.2021.11.030 34902530 7. Casadei-Gardini A. Rimini M. Tada T. Suda G. Shimose S. Kudo M. Cheon J. Finkelmeier F. Lim H.Y. Rimassa L. Atezolizumab plus bevacizumab versus lenvatinib for unresectable hepatocellular carcinoma: A large real-life worldwide population Eur. J. Cancer 2023 180 9 20 10.1016/j.ejca.2022.11.017 36527976 8. Estes C. Razavi H. Loomba R. Younossi Z. Sanyal A.J. Modeling the epidemic of nonalcoholic fatty liver disease demonstrates an exponential increase in burden of disease Hepatology 2018 67 123 133 10.1002/hep.29466 28802062 PMC5767767 9. Rimini M. Rimassa L. Ueshima K. Burgio V. Shigeo S. Tada T. Suda G. Yoo C. Cheon J. Pinato D.J. Atezolizumab plus bevacizumab versus lenvatinib or sorafenib in non-viral unresectable hepatocellular carcinoma: An international propensity score matching analysis ESMO Open 2022 7 100591 10.1016/j.esmoop.2022.100591 36208496 PMC9808460 10. He X. Hikiba Y. Suzuki Y. Nakamori Y. Kanemaru Y. Sugimori M. Sato T. Nozaki A. Chuma M. Maeda S. EGFR inhibition reverses resistance to lenvatinib in hepatocellular carcinoma cells Sci. Rep. 2022 12 8007 10.1038/s41598-022-12076-w 35568782 PMC9107466 11. Jin H. Shi Y. Lv Y. Yuan S. Ramirez C.F.A. Lieftink C. Wang L. Wang S. Wang C. Dias M.H. EGFR activation limits the response of liver cancer to lenvatinib Nature 2021 595 730 734 10.1038/s41586-021-03741-7 34290403 12. Wang J. Yu H. Dong W. Zhang C. Hu M. Ma W. Jiang X. Li H. Yang P. Xiang D. N6-Methyladenosine-Mediated Up-Regulation of FZD10 Regulates Liver Cancer Stem Cells’ Properties and Lenvatinib Resistance Through WNT/beta-Catenin and Hippo Signaling Pathways Gastroenterology 2023 164 990 1005 10.1053/j.gastro.2023.01.041 36764493 13. Yu T. Yu J. Lu L. Zhang Y. Zhou Y. Zhou Y. Huang F. Sun L. Guo Z. Hou G. MT1JP-mediated miR-24-3p/BCL2L2 axis promotes Lenvatinib resistance in hepatocellular carcinoma cells by inhibiting apoptosis Cell Oncol. 2021 44 821 834 10.1007/s13402-021-00605-0 PMC8338827 33974236 14. Bayat Mokhtari R. Homayouni T.S. Baluch N. Morgatskaya E. Kumar S. Das B. Yeger H. Combination therapy in combating cancer Oncotarget 2017 8 38022 38043 10.18632/oncotarget.16723 28410237 PMC5514969 15. Chen J. Xiong P. Nie M. Pan Y. Wang J. Hu D. Zhou Z. Zhang Y. Chen M. Xu L. The combination treatment strategy of lenvatinib for hepatocellular carcinoma: A real-world study J. Cancer Res. Clin. Oncol. 2023 149 2491 2500 10.1007/s00432-022-04082-2 35752744 PMC11798206 16. Bermudez-Soto M.J. Larrosa M. Garcia-Cantalejo J.M. Espin J.C. Tomas-Barberan F.A. Garcia-Conesa M.T. Up-regulation of tumor suppressor carcinoembryonic antigen-related cell adhesion molecule 1 in human colon cancer Caco-2 cells following repetitive exposure to dietary levels of a polyphenol-rich chokeberry juice J. Nutr. Biochem. 2007 18 259 271 10.1016/j.jnutbio.2006.05.003 16860979 17. Huai Z. Li Z. Xue W. Li S. Huang Y. Cao X. Wei Q. Wang Y. Novel curcumin derivatives N17 exert anti-cancer effects through the CSNK1G3/AKT axis in triple-negative breast cancer Biochem. Pharmacol. 2024 229 116472 10.1016/j.bcp.2024.116472 39127154 18. Zhang A. Sun H. Wang X. Potentiating therapeutic effects by enhancing synergism based on active constituents from traditional medicine Phytother. Res. 2014 28 526 533 10.1002/ptr.5032 23913598 19. Shimura T. Sharma P. Sharma G.G. Banwait J.K. Goel A. Enhanced anti-cancer activity of andrographis with oligomeric proanthocyanidins through activation of metabolic and ferroptosis pathways in colorectal cancer Sci. Rep. 2021 11 7548 10.1038/s41598-021-87283-y 33824419 PMC8024269 20. Ravindranathan P. Pasham D. Balaji U. Cardenas J. Gu J. Toden S. Goel A. Mechanistic insights into anticancer properties of oligomeric proanthocyanidins from grape seeds in colorectal cancer Carcinogenesis 2018 39 767 777 10.1093/carcin/bgy034 29684110 PMC5972632 21. Ravindranathan P. Pasham D. Goel A. Oligomeric proanthocyanidins (OPCs) from grape seed extract suppress the activity of ABC transporters in overcoming chemoresistance in colorectal cancer cells Carcinogenesis 2019 40 412 421 10.1093/carcin/bgy184 30596962 PMC6514448 22. Toden S. Ravindranathan P. Gu J. Cardenas J. Yuchang M. Goel A. Oligomeric proanthocyanidins (OPCs) target cancer stem-like cells and suppress tumor organoid formation in colorectal cancer Sci. Rep. 2018 8 3335 10.1038/s41598-018-21478-8 29463813 PMC5820273 23. Sherman B.T. Hao M. Qiu J. Jiao X. Baseler M.W. Lane H.C. Imamichi T. Chang W. DAVID: A web server for functional enrichment analysis and functional annotation of gene lists (2021 update) Nucleic Acids Res. 2022 50 W216 W221 10.1093/nar/gkac194 35325185 PMC9252805 24. Cooper J. Giancotti F.G. Integrin Signaling in Cancer: Mechanotransduction, Stemness, Epithelial Plasticity, and Therapeutic Resistance Cancer Cell 2019 35 347 367 10.1016/j.ccell.2019.01.007 30889378 PMC6684107 25. Kariya Y. Nishita M. Integrins in Cancer Drug Resistance: Molecular Mechanisms and Clinical Implications Int. J. Mol. Sci. 2025 26 3143 10.3390/ijms26073143 40243917 PMC11989024 26. Nasimi Shad A. Moghbeli M. Integrins as the pivotal regulators of cisplatin response in tumor cells Cell Commun. Signal 2024 22 265 10.1186/s12964-024-01648-0 38741195 PMC11089694 27. Paoli P. Giannoni E. Chiarugi P. Anoikis molecular pathways and its role in cancer progression Biochim. Biophys. Acta 2013 1833 3481 3498 10.1016/j.bbamcr.2013.06.026 23830918 28. Song W. Hu H. Yuan Z. Yao H. A prognostic model for anoikis-related genes in pancreatic cancer Sci. Rep. 2024 14 15200 10.1038/s41598-024-65981-7 38956290 PMC11220081 29. Sa K.D. Zhang X. Li X.F. Gu Z.P. Yang A.G. Zhang R. Li J.P. Sun J.Y. A miR-124/ITGA3 axis contributes to colorectal cancer metastasis by regulating anoikis susceptibility Biochem. Biophys. Res. Commun. 2018 501 758 764 10.1016/j.bbrc.2018.05.062 29758195 30. Guo W. Giancotti F.G. Integrin signalling during tumour progression Nat. Rev. Mol. Cell Biol. 2004 5 816 826 10.1038/nrm1490 15459662 31. Hamidi H. Ivaska J. Every step of the way: Integrins in cancer progression and metastasis Nat. Rev. Cancer 2018 18 533 548 10.1038/s41568-018-0038-z 30002479 PMC6629548 32. Dai Y. Zhang X. Ou Y. Zou L. Zhang D. Yang Q. Qin Y. Du X. Li W. Yuan Z. Anoikis resistance--protagonists of breast cancer cells survive and metastasize after ECM detachment Cell Commun. Signal 2023 21 190 10.1186/s12964-023-01183-4 37537585 PMC10399053 33. Gonzalez-Llorente L. Santacatterina F. Garcia-Aguilar A. Nuevo-Tapioles C. Gonzalez-Garcia S. Tirpakova Z. Toribio M.L. Cuezva J.M. Overexpression of Mitochondrial IF1 Prevents Metastatic Disease of Colorectal Cancer by Enhancing Anoikis and Tumor Infiltration of NK Cells Cancers 2019 12 22 10.3390/cancers12010022 31861681 PMC7017164 34. Wade C.A. Kyprianou N. Profiling Prostate Cancer Therapeutic Resistance Int. J. Mol. Sci. 2018 19 904 10.3390/ijms19030904 29562686 PMC5877765 35. Nie F. Liu L. Cui J. Zhao Y. Zhang D. Zhou D. Wu J. Li B. Wang T. Li M. Oligomeric Proanthocyanidins: An Updated Review of Their Natural Sources, Synthesis, and Potentials Antioxidants 2023 12 1004 10.3390/antiox12051004 37237870 PMC10215713 36. Liu G. Shi A. Wang N. Li M. He X. Yin C. Tu Q. Shen X. Tao Y. Wang Q. Polyphenolic Proanthocyanidin-B2 suppresses proliferation of liver cancer cells and hepatocellular carcinogenesis through directly binding and inhibiting AKT activity Redox Biol. 2020 37 101701 10.1016/j.redox.2020.101701 32863234 PMC7472926 37. Al-Ishaq R.K. Overy A.J. Busselberg D. Phytochemicals and Gastrointestinal Cancer: Cellular Mechanisms and Effects to Change Cancer Progression Biomolecules 2020 10 105 10.3390/biom10010105 31936288 PMC7022462 38. Zhang Y.P. Liu S.Y. Sun Q.Y. Ren J. Liu H.X. Li H. Proanthocyanidin B2 attenuates high-glucose-induced neurotoxicity of dorsal root ganglion neurons through the PI3K/Akt signaling pathway Neural Regen. Res. 2018 13 1628 1636 30127125 10.4103/1673-5374.237174 PMC6126122 39. Vogel A. Qin S. Kudo M. Su Y. Hudgens S. Yamashita T. Yoon J.H. Fartoux L. Simon K. Lopez C. Lenvatinib versus sorafenib for first-line treatment of unresectable hepatocellular carcinoma: Patient-reported outcomes from a randomised, open-label, non-inferiority, phase 3 trial Lancet Gastroenterol. Hepatol. 2021 6 649 658 10.1016/S2468-1253(21)00110-2 34087115 40. Capozzi M. De Divitiis C. Ottaiano A. von Arx C. Scala S. Tatangelo F. Delrio P. Tafuto S. Lenvatinib, a molecule with versatile application: From preclinical evidence to future development in anti-cancer treatment Cancer Manag. Res. 2019 11 3847 3860 10.2147/CMAR.S188316 31118801 PMC6502442 41. Chen S. Hu H. Miao S. Zheng J. Xie Z. Zhao H. Anti-tumor effect of cisplatin in human oral squamous cell carcinoma was enhanced by andrographolide via upregulation of phospho-p53 in vitro and in vivo Tumour. Biol. 2017 39 1010428317705330 10.1177/1010428317705330 28513299 42. Sun C. Jin W. Shi H. Oligomeric proanthocyanidins protects A549 cells against H 2 2 Int. J. Mol. Med. 2017 39 1548 1554 10.3892/ijmm.2017.2971 28487966 43. Ianevski A. Giri A.K. Aittokallio T. SynergyFinder 3.0: An interactive analysis and consensus interpretation of multi-drug synergies across multiple samples Nucleic Acids Res. 2022 50 W739 W743 10.1093/nar/gkac382 35580060 PMC9252834 44. Roy S. Zhao Y. Yuan Y.C. Goel A. Metformin and ICG-001 Act Synergistically to Abrogate Cancer Stem Cells-Mediated Chemoresistance in Colorectal Cancer by Promoting Apoptosis and Autophagy Cancers 2022 14 1281 10.3390/cancers14051281 35267590 PMC8908991 45. Zhao Y. Wang C. Goel A. Andrographis overcomes 5-fluorouracil-associated chemoresistance through inhibition of DKK1 in colorectal cancer Carcinogenesis 2021 42 814 825 10.1093/carcin/bgab027 33822896 PMC8215595 Figure 1 Establishment of Lenvatinib-Resistant HCC Cell Lines and Synergistic Effects of OPCs and Lenvatinib. ( A E 50 B F 50 C G D H Figure 2 Evaluation of the Effects of Lenvatinib and OPCs on Colony Formation, Migration, and Invasion in rHuh-7 and rPLC Cells. ( A B C p Figure 3 OPCs Induce Apoptosis and Suppress Cancer Stemness in Lenvatinib-Resistant HCC Cells. ( A B C D p Figure 4 Gene Profiling Analysis Reveals Genes Involved in Lenvatinib Resistance. ( A GSE186191 B C D E p p Figure 5 siRNA-mediated knockdown of ITGA3 suppresses tumorigenic phenotypes and induces apoptosis in HCC cell lines. ( A B C D p Figure S1 Figure 6 OPCs restore anoikis sensitivity and overcome Lenvatinib resistance by targeting ITGA3 and inhibiting EGFR–AKT signaling. ( A B (C) p ",
  "metadata": {
    "Title of this paper": "Andrographis overcomes 5-fluorouracil-associated chemoresistance through inhibition of DKK1 in colorectal cancer",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472469/"
  }
}