{
  "title": "Paper_156",
  "abstract": "pmc ACS Omega ACS Omega 3686 acsomega ao ACS Omega 2470-1343 American Chemical Society http://pubs.acs.org/journal/acsodf PMC12489624 PMC12489624.1 12489624 12489624 10.1021/acsomega.5c06298 1 Review Research Progress on Regulating Autophagy in Traditional\nChinese Medicine for the Treatment of Traumatic Brain Injury 7718127 Cao Yan 7718130 Li Hengxi 7718134 Jiang Hongyan 7718136 Luo Xinyuan 7718138 Yin Aiping 7718142 Wu Jia 7718144 Guo Xiaobing 7718145 Wu Haiying 7717284 https://orcid.org/0009-0002-8571-8523 Li Ping  † Department\nof Anatomy and Histology/Embryology, Faculty of Basic Medical Sciences 71240 Kunming Medical University 650500 Kunming Yunnan China  ‡ Department\nof Pathology Suining Central Hospital 629000 Suining Sichuan China  § Department\nof Experimental Teaching Center, Faculty of Basic Medicine Sciences 71240 Kunming Medical University 650500 Kunming Yunnan China  ∥ Department\nof Emergency and Intensive Care Unit First\nAffiliated Hospital of Kunming Medical University 650032 Kunming Yunnan China * guoxiaobing2002@163.com * why0209@hotmail.com * liping@kmmu.edu.cn 18 9 2025 30 9 2025 10 38 498176 43379 43390 30 6 2025 09 9 2025 03 9 2025 18 9 2025 18 09 2025 03 10 2025 03 10 2025 © 2025 The Authors. Published by American Chemical Society 2025 The Authors https://creativecommons.org/licenses/by-nc-nd/4.0/ This article is licensed under CC-BY-NC-ND 4.0 Traumatic brain injury\n(TBI), characterized by structural brain\ndamage caused by external physical shocks, is a significant global\nhealth challenge. Autophagy plays an important role in the cellular\nself-protection mechanism during its pathological progression. Traditional\nChinese medicine (TCM) has a long history and unique advantages in\nneuroprotection. This review summarizes the key markers of autophagy\nand the relevant signaling pathways involved in autophagy in TBI,\nmainly including the PI3K/Akt/mTOR, AMPK/mTOR, Nrf2, TLR4 signaling\npathways, and the endoplasmic reticulum stress autophagy axis. In\naddition, this paper summarizes the recent advances in TCM approaches\nin TBI autophagy treatment, such as terpenoids, flavonoids, polyphenols,\nalkaloids, and carotenoids, which are active components of TCM, as\nwell as acupuncture nonpharmacological therapies. National Natural Science Foundation of China 10.13039/501100001809 82060241 National Natural Science Foundation of China 10.13039/501100001809 82260387 Kunming Medical University 10.13039/501100003996 202101AY070001-002 Yunnan Provincial Science and Technology Department 10.13039/501100008871 202101AY070001-002 Yunnan Fundamental Research Projects NA 202301AS070020 Key Research and Development Program of Yunnan Province NA 202403AC100010 Yunnan Fundamental Research Projects NA 202501AS070026 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 ao5c06298 document-id-new-14 ao5c06298 production-flag-MathML-config-version 3 production-flag-journal-citation-display-style acs-titles production-flag-journal-date-display-style dates-used-rcd-rvd-acc document-id-alt-64 d7145a70ecc637528c744d6af3e5ef0d58caf57d72de6b8dcf7ab5fb80ed29b5 1 Introduction Traumatic brain injury\n(TBI) refers to structural neurological\ndamage resulting from direct or indirect application of external mechanical\ntrauma to the head, which can lead to behavioral changes and cognitive\ndecline, making it difficult for patients to return to normal life. Autophagy is a mechanism of defense and stress regulation that\nhas important roles in the cellular growth and development, innate\nand adaptive immunity, programmed cell death, and the maintenance\nof internal environmental homeostasis.    Traditional Chinese medicine\n(TCM) has a long history and unique\nadvantages in neuroprotection. Its multitarget and multipathway therapeutic\nfeatures provide new ideas and methods for the regulation strategies\nof neurological diseases. In recent years, studies have shown that\nactive ingredients such as saponins, flavonoids, and alkaloids in\nTCM have significant multitarget advantages in neuroprotective mechanisms\nand can improve neurological function through various pathways such\nas antioxidant, anti-inflammatory, modulation of signaling pathways,\nand promotion of neuroplasticity.  vitro In summary, TCM has significant advantages in the treatment\nof\nTBI as well as regulating autophagy. In this study, autophagy’s\npivotal involvement in TBI was discussed in depth, and the modulatory\neffects of the natural active ingredients in TCM and traditional therapies\n(e.g., acupuncture) on TBI were systematically summarized, further\nanalyzing the mechanism of TCM intervention in TBI by targeting autophagy\nand its principle of action. 2 Classification and Process\nof Autophagy Autophagy, defined as “self-eating”\nat the subcellular\nlevel, was initially proposed in 1962.  mTOR is a key regulator of autophagy, and its mechanism of action\nis mainly through the regulation of the ULK1 complex, which includes\nULK1, ATG13, FIP200, and ATG101. During nutrient-replete states, mTOR\nsustains autophagic suppression by phosphorylating the ULK1 complex. Figure 1 Mechanisms of autophagy\nafter a traumatic brain injury. 3 Autophagy Signaling Pathway in TBI The pathological\nmechanism of TBI is complex, involving multiple\nautophagy related pathways. Here, we will focus on introducing the\nPI3K/Akt/mTOR, AMPK/mTOR, Nrf2, TLR4 signaling pathways and the endoplasmic\nreticulum stress-autophagy axis, and explore their potential roles\nin the dynamic imbalance of autophagy after TBI. The mechanism diagram\nof autophagy in TBI is shown in Figure 3.1 PI3K/Akt/mTOR The PI3K/Akt/mTOR signaling\npathway, as a key regulatory pathway of cellular autophagy, is also\nan important link in the pathological process of TBI. PI3K is composed\nof regulatory subunit p85 and catalytic subunit p110, and its activity\nis regulated by growth factor receptors such as EGFR.  3.2 AMPK/mTOR AMPK\nis a cellular energy\nsensor and regulator that maintains intracellular homeostasis by modulating\ncellular metabolism and energy balance.  3.3 Nrf2 Nrf2, as a transcription factor,\ncan regulate the expression of genes encoding detoxifying enzymes,\nantioxidant enzymes, and drug transporters.  in vivo  3.4 TLR4 TLR4 initiates the host innate\nimmune response by specifically conjugating LPS components in the\nbacterial outer membranes.  3.5 ER Stress-Autophagy Axis The endoplasmic\nreticulum (ER) is an important organelle for protein synthesis, protein\nstructure folding, and calcium ion storage in eukaryotic cells. TBI\ncan cause many complications, such as peroxidation, ischemia and hypoxia,\nenergy deficiency, or inflammatory reactions, causing changes in the\ninternal environment of the endoplasmic reticulum, leading to imbalance\nof Ca 2+  4 Chinese Herbal Active Ingredients Regulate TBI\nthrough Autophagy In recent years, the research value of\nTCM in the treatment of\nneurological diseases has become increasingly prominent. TCM contains\na variety of active ingredients, such as terpenoids, flavonoids, polyphenols,\nand alkaloids, which exhibit significant pharmacological activities.\nEspecially for neurological diseases, active ingredients of TCM can\nimprove neurological function by regulating autophagy-related signaling\npathways, exerting antioxidative stress, anti-inflammatory, and apoptosis\neffects. Moreover, Chinese medicine therapy has a multitarget synergistic\neffect, which can act on multiple links and targets of the nervous\nsystem at the same time, and this multipathway intervention makes\nChinese medicine more advantageous in the treatment of neurological\ndisorders that are complex and have various pathological mechanisms.\nTherefore, here we summarize the application of TCM in neurological\ndiseases, especially TBI. The active ingredients of TCM treat TBI\nthrough autophagy, as shown in Table 1 Mechanism of TCM Active Ingredients\nIntervening in TBI through Autophagy 4.1 Terpenoids The active components\nof boswellia sacra gum resin (BSR) are mainly pentacyclic triterpenoids.\nIt was found that BSR could activate the AMPK/Beclin-1 signaling pathway\nto enhance the conversion of LC3-II, an autophagy marker, and increase\nthe accumulation of p62, which synergistically regulated apoptosis\nand exerted neuroprotective effects. Ginsenoside-Rb1 (GS-Rb1) belongs to the triterpenoid saponin class\nof terpenes and is a typical ginseng active ingredient. It has been\nfound that GS-Rb1 can protect neurons and reduce cell death by inhibiting\nexcessive autophagy. The active components of Panax notoginseng Panax notoginseng Panax notoginseng Panax notoginseng Panax notoginseng 4.2 Flavonoids Hydroxysafflor yellow\nA (HSYA) is an active ingredient extracted from the TCM safflower,\nwhich belongs to the chalcone glycoside class of flavonoid compounds. Morin, a natural flavonoid, is widely found in mulberry trees\nand other plants, and in recent years it has been found to have significant\nneuroprotective effects. Baicalin, as the main active ingredient of TCM Scutellaria\nbaicalensis Quercetin is a common flavonoid widely found\nin many herbal medicines.\nAccording to reports, quercetin exerts neuroprotective effects by\nenhancing the permeability of the BBB and increasing its bioavailability\nin the brain. 4.3 Polyphenols Resveratrol is a naturally\noccurring polyphenolic compound with potent antioxidant properties\nthat is widely distributed in dietary sources such as grape skins,\nberry fruits, grains, and red wine.   Curcumin is a polyphenolic compound extracted\nfrom turmeric, family Zingiberaceae, and has a variety of pharmacological\neffects. Curcumin activates the PI3K/AKT and AMPK signaling pathways\nto promote neuronal survival and metabolic homeostasis, while inhibiting\nthe JNK/NF-κB/Akt signaling pathway to reduce neuroinflammation.  Bisdemethoxycurcumin (BDMC) is a derivative of curcumin and belongs\nto the polyphenolic compound. Studies have reported that BDMC can\nenhance the killing effect of cisplatin on cancer cells by inducing\ncellular autophagy, making cancer cells more sensitive to cisplatin\ntreatment. 4.4 Alkaloids Tetrandrine is a bisbenzylisoquinoline\nalkaloid isolated from Stephania tetrandra 4.5 Carotenoid Crocetin is an active\nconstituent extracted from the stigma of the Chinese herbal medicine\nsaffron and belongs to the family of carotenoid derivatives. It has\nmultiple properties such as anti-inflammatory, antioxidant, and neuroprotective,\nand is widely used in the treatment of central nervous system diseases. 5 Acupuncture Regulates TBI\nthrough Autophagy Acupuncture, as a nonpharmacological therapy,\nregulates nerve function\nby stimulating specific acupuncture points without the need for surgical\nor pharmacological intervention. This noninvasive property makes it\nhighly safe in the treatment of TBI, especially for patients who cannot\ntolerate surgery or medication. Several studies have shown that acupuncture\ncan improve functional recovery after TBI. For example, acupuncture\nregulates cerebral blood flow, reduces inflammatory responses, promotes\nnerve regeneration, and improves cognitive function and emotional\nstate.   Wu et al. Neuronal autophagy\nhas a dynamic regulatory effect after acupuncture\nintervention in TBI. Zhao et al. Although acupuncture has demonstrated multiple\nadvantages in TBI\ntreatment, it still faces many limitations and challenges. There are\nfewer studies related to acupuncture in TBI autophagy, and the molecular\nmechanisms have not been fully elucidated. The selection of acupuncture\npoints, stimulation parameters (e.g., frequency and intensity of electroacupuncture),\nand treatment course of acupuncture for TBI have not yet been standardized,\nwhich may lead to unstable efficacy. In addition, acupuncture is not\nsuitable for all stages or types of TBI, and data on long-term prognosis\nare limited; more exploration is still needed. 6 Limitations\nand Future Directions of TCM TCM plays a role in the treatment\nof TBI mainly through a variety\nof modalities such as herbal medicine and its active ingredients,\nacupuncture, and electroacupuncture. However, although these methods\nhave shown some efficacy in animal experiments, more clinical studies\nare needed to verify their effectiveness and safety.  7 Conclusion Autophagy\nplays an important role in TBI and is involved in various\ncellular and molecular processes. In this review article, we summarize\nthe mechanisms of autophagy in TBI and the role of TCM in regulating\nautophagy in TBI. These findings support the importance of the autophagy\npathway in TBI, making autophagy an attractive therapeutic target\nfor the development of new therapeutic strategies for TBI. However,\nTCM treatment of TBI still faces many challenges. How to organically\ncombine TCM theories with modern medicine to establish a more standardized\ndiagnosis and treatment is also an important direction for future\nresearch. YC: Conceptualization,\nFormal analysis, Writing–original draft, Writing–review\nand editing, Methodology. HL: Methodology, Conceptualization. HJ:\nMethodology, Writing–review and editing. XL: Writing–review\nand editing. AY: Writing–review and editing. JW: Writing–review\nand editing. XG: Supervision, Writing–review and editing. HW:\nFunding acquisition, Writing–review and editing. PL: Funding\nacquisition, Writing–review and editing. This work was\nsupported by grants from the National Natural Science Foundation of\nChina (82060241, 82260387), the Yunnan Provincial Department of Science\nand Technology - Kunming Medical University Applied Basic Research\nJoint Special Fund (202101AY070001-002), the Yunnan Fundamental Research\nProjects (202501AS070026, 202301AS070020), and the Key Research and\nDevelopment Program of Yunnan Province (202403AC100010). The authors\ndeclare no competing financial interest. Capizzi A. Woo J. Verduzco-Gutierrez M. Traumatic Brain Injury: An Overview\nof Epidemiology, Pathophysiology, and Medical Management Med. Clin. North Am. 2020 104 2 213 238 10.1016/j.mcna.2019.11.001 32035565 Alberts A. Lucke-Wold B. Updates on\nImproving Imaging Modalities for Traumatic\nBrain Injury J. Integr. Neurosci. 2023 22 6 142 10.31083/j.jin2206142 38176928 Robinson C. P. Moderate\nand Severe Traumatic Brain Injury Continuum\n(Minneapolis, Minn.) 2021 27 5 1278 1300 10.1212/CON.0000000000001036 34618760 Chaturvedi A. Pierce S. K. Autophagy in immune\ncell regulation and dysregulation Curr. Allergy\nAsthma Rep. 2009 9 5 341 346 10.1007/s11882-009-0050-1 19671376 Valečka J. Almeida C. R. Su B. Pierre P. Gatti E. Autophagy\nand MHC-restricted antigen presentation Mol.\nImmunol. 2018 99 163 170 10.1016/j.molimm.2018.05.009 29787980 Doherty J. Baehrecke E. H. Life, death and autophagy Nat.\nCell Biol. 2018 20 10 1110 1117 10.1038/s41556-018-0201-5 30224761 PMC9721133 Doria A. Gatto M. Punzi L. Autophagy in human\nhealth and disease N. Engl. J. Med. 2013 368 19 1845 10.1056/NEJMc1303158 23656659 Wang H. Li X. Zhang Q. Fu C. Jiang W. Xue J. Liu S. Meng Q. Ai L. Zhi X. Deng S. Liang W. Autophagy in Disease\nOnset and Progression Aging Dis. 2023 15 4 1646 1671 10.14336/AD.2023.0815 PMC11272186 37962467 Wu J. Lipinski M. M. Autophagy\nin Neurotrauma: Good, Bad, or Dysregulated Cells. 2019 8 7 693 10.3390/cells8070693 31295858 PMC6678153 Lang J. Sun B. Feng S. Sun G. Impaired autophagic flux in the human\nbrain after traumatic brain injury Neuroreport 2024 35 6 387 398 10.1097/WNR.0000000000002020 38526944 PMC10965136 Zheng Z. Wu Y. Li Z. Ye L. Lu Q. Zhou Y. Yuan Y. Jiang T. Xie L. Liu Y. Chen D. Ye J. Nimlamool W. Zhang H. Xiao J. Valproic acid affects neuronal fate\nand microglial function via enhancing autophagic flux in mice after\ntraumatic brain injury J. Neurochem. 2020 154 3 284 300 10.1111/jnc.14892 31602651 Dong X. Xu J. Du K. Chen X. Shu H. Yu S. Plateau hypoxia-induced\nupregulation of reticulon 4 pathway mediates altered autophagic flux\ninvolved in blood-brain barrier disruption after traumatic brain injury Neuroreport 2025 36 2 81 92 10.1097/WNR.0000000000002122 39661527 Zhou J. Sun F. Zhang W. Feng Z. Yang Y. Mei Z. Novel insight\ninto the therapeutical potential of flavonoids from traditional Chinese\nmedicine against cerebral ischemia/reperfusion injury Front. Pharmacol. 2024 15 1352760 10.3389/fphar.2024.1352760 38487170 PMC10937431 Lin L. Zhao C. Lv H. Zhu L. Wang W. Zheng X. Astragaloside IV promotes\nneuronal axon regeneration by inhibiting\nthe PTEN/AKT pathway Brain Res. 2025 1850 149451 10.1016/j.brainres.2025.149451 39793915 Sun C. Gao X. Sha S. Wang S. Shan Y. Li L. Xing C. Guan H. Du H. Berberine alleviates\nAlzheimer’s disease by activating autophagy and inhibiting\nferroptosis through the JNK-p38MAPK signaling pathway Int. Immunopharmacol. 2025 155 114550 10.1016/j.intimp.2025.114550 40215776 Begh M. Z. A. Amin M. A. Shatu M. M. Sweilam S. H. Puri S. Ramesh R. B. Arjun U. Shanmugarajan T. S. Pommala N. Durairaj A. Ethiraj S. Shenbakadurai N. Ahmad I. Emran T. B. Unraveling Berberine’s Molecular\nMechanisms in Neuroprotection Against Neurodegeneration Chem. Biodivers 2025 22 e202500170 10.1002/cbdv.202500170 40128128 Pei Z. Guo X. Zheng F. Yang Z. Li T. Yu Z. Li X. Guo X. Chen Q. Fu C. Tang T. Feng D. Wang Y. Xuefu Zhuyu decoction promotes synaptic\nplasticity by targeting miR-191a-5p/BDNF-TrkB axis in severe traumatic\nbrain injury Phytomedicine 2024 129 155566 10.1016/j.phymed.2024.155566 38565001 Cheng Y. Gu W. Wu X. Tian W. Mu Z. Ye Y. Chao H. Bao Z. Allicin alleviates\ntraumatic brain\ninjury-induced neuroinflammation by enhancing PKC-δ-mediated\nmitophagy Phytomedicine 2025 139 156500 10.1016/j.phymed.2025.156500 39986225 Li N. Wang R. Ai X. Guo X. Liu J. Sun L. Zhang R. Effect of acupuncture treatment on cognitive impairment\nafter traumatic brain injury in adults: A protocol for systematic\nreview Medicine (Baltim.) 2021 100 51 e28451 10.1097/MD.0000000000028451 PMC8702273 34941200 Ashford T. P. Porter K. R. Cytoplasmic components\nin hepatic cell lysosomes J. Cell Biol. 1962 12 1 198 202 10.1083/jcb.12.1.198 13862833 PMC2106008 Mizushima N. Levine B. Autophagy in Human Diseases N. Engl. J. Med. 2020 383 16 1564 1576 10.1056/NEJMra2022774 33053285 Feng Y. He D. Yao Z. Klionsky D. J. The machinery of macroautophagy Cell Res. 2014 24 1 24 41 10.1038/cr.2013.168 24366339 PMC3879710 Fleming A. Bourdenx M. Fujimaki M. Karabiyik C. Krause G. J. Lopez A. Martín-Segura A. Puri C. Scrivo A. Skidmore J. Son S. M. Stamatakou E. Wrobel L. Zhu Y. Cuervo A. M. Rubinsztein D. C. The different autophagy degradation pathways and neurodegeneration Neuron 2022 110 6 935 966 10.1016/j.neuron.2022.01.017 35134347 PMC8930707 Nakatogawa H. Mechanisms\ngoverning autophagosome biogenesis Nat. Rev.\nMol. Cell Biol. 2020 21 8 439 458 10.1038/s41580-020-0241-0 32372019 Hu Y. Reggiori F. Molecular regulation of autophagosome formation Biochem. Soc. Trans. 2022 50 1 55 69 10.1042/BST20210819 35076688 PMC9022990 Li X. He S. Ma B. Autophagy\nand autophagy-related proteins in cancer Mol.\nCancer 2020 19 1 12 10.1186/s12943-020-1138-4 31969156 PMC6975070 Jung C. H. Jun C. B. Ro S. H. Kim Y. M. Otto N. M. Cao J. Kundu M. Kim D. H. ULK-Atg13-FIP200 complexes mediate\nmTOR signaling to the autophagy machinery Mol.\nBiol. Cell 2009 20 7 1992 2003 10.1091/mbc.e08-12-1249 19225151 PMC2663920 Zheng W. Xie W. Yin D. Luo R. Liu M. Guo F. ATG5 and ATG7\ninduced autophagy interplays with UPR via PERK signaling Cell Commun. Signaling: CCS 2019 17 1 42 10.1186/s12964-019-0353-3 31060556 PMC6503447 Liang J. Sun J. Zhang W. Wang X. Xu Y. Peng Y. Zhang L. Xiong W. Liu Y. Liu H. Novel Insights\ninto The Roles of N(6)-methyladenosine (m(6)­A) Modification and Autophagy\nin Human Diseases International journal of\nbiological sciences 2023 19 2 705 720 10.7150/ijbs.75466 36632456 PMC9830520 Alam M. B. Park N. H. Song B. R. Lee S. H. Antioxidant Potential-Rich\nBetel Leaves (Piper betle L.) Exert Depigmenting Action by Triggering\nAutophagy and Downregulating MITF/Tyrosinase In Vitro and In Vivo Antioxidants (Basel, Switzerland) 2023 12 2 374 10.3390/antiox12020374 36829933 PMC9952209 Qin X. Y. Shen H. H. Zhou W. J. Mei J. Lu H. Tan X. F. Zhu R. Zhou W. H. Li D. J. Zhang T. Ye J. F. Li M. Q. Insight\nof Autophagy\nin Spontaneous Miscarriage International journal\nof biological sciences 2022 18 3 1150 1170 10.7150/ijbs.68335 35173545 PMC8771834 Bilanges B. Posor Y. Vanhaesebroeck B. PI3K isoforms\nin cell signalling\nand vesicle trafficking Nat. Rev. Mol. Cell\nBiol. 2019 20 9 515 534 10.1038/s41580-019-0129-z 31110302 Vanhaesebroeck B. Whitehead M. A. Piñeiro R. Molecules\nin medicine mini-review:\nisoforms of PI3K in biology and disease J.\nMol. Med. (Berl.) 2016 94 1 5 11 10.1007/s00109-015-1352-5 26658520 Siddika T. Balasuriya N. Frederick M. I. Rozik P. Heinemann I. U. O’Donoghue P. Delivery of\nActive AKT1 to Human Cells Cells. 2022 11 23 3834 10.3390/cells11233834 36497091 PMC9738475 Jiang Q. Zheng N. Bu L. Zhang X. Zhang X. Wu Y. Su Y. Wang L. Zhang X. Ren S. Dai X. Wu D. Xie W. Wei W. Zhu Y. Guo J. SPOP-mediated\nubiquitination and degradation of PDK1 suppresses AKT\nkinase activity and oncogenic functions Mol.\nCancer 2021 20 1 100 10.1186/s12943-021-01397-5 34353330 PMC8340461 Maiese K. Chong Z. Z. Wang S. Shang Y. C. Oxidant stress and\nsignal transduction in the nervous system with the PI 3-K, Akt, and\nmTOR cascade Int. J. Mol. Sci. 2012 13 11 13830 13866 10.3390/ijms131113830 23203037 PMC3509553 Yap R. S. Kumar J. Teoh S. L. Potential Neuroprotective Role of\nNeurotrophin in Traumatic Brain Injury CNS\nNeurol. Disord.: Drug Targets 2024 23 10 1189 1202 10.2174/0118715273289222231219094225 38279761 Cayo A. Segovia R. Venturini W. Moore-Carrasco R. Valenzuela C. Brown N. mTOR Activity and Autophagy\nin Senescent\nCells, a Complex Partnership Int. J. Mol. Sci. 2021 22 15 8149 10.3390/ijms22158149 34360912 PMC8347619 Ding X. Zhang L. Zhang X. Qin Y. Yu K. Yang X. Intranasal Insulin Alleviates Traumatic\nBrain Injury by Inhibiting\nAutophagy and Endoplasmic Reticulum Stress-mediated Apoptosis Through\nthe PI3K/Akt/mTOR Signaling Pathway Neuroscience 2023 529 23 36 10.1016/j.neuroscience.2023.08.009 37572876 Zhao S. Wang S. Cao L. Zeng H. Lin S. Lin Z. Chen M. Zhu M. Pang Z. Zhang Y. Acupuncture\npromotes nerve repair through the benign regulation of mTOR-mediated\nneuronal autophagy in traumatic brain injury rats CNS neuroscience & therapeutics 2023 29 1 458 470 10.1111/cns.14018 36422883 PMC9804054 Herzig S. Shaw R. J. AMPK: guardian of\nmetabolism and mitochondrial homeostasis Nat.\nRev. Mol. Cell Biol. 2018 19 2 121 135 10.1038/nrm.2017.95 28974774 PMC5780224 Kurtz P. Rocha E. E. M. Nutrition Therapy, Glucose Control, and Brain Metabolism\nin Traumatic Brain Injury: A Multimodal Monitoring Approach Front. Neurosci. 2020 14 190 10.3389/fnins.2020.00190 32265626 PMC7105880 Steinberg G. R. Hardie D. G. New insights into activation and function of the AMPK Nat. Rev. Mol. Cell Biol. 2023 24 4 255 272 10.1038/s41580-022-00547-x 36316383 Lai Z. Li C. Ma H. Hua S. Liu Z. Huang S. Liu K. Li J. Feng Z. Cai Y. Zou Y. Tang Y. Jiang X. Hydroxysafflor yellow a confers neuroprotection\nagainst acute traumatic brain injury by modulating neuronal autophagy\nto inhibit NLRP3 inflammasomes J. Ethnopharmacol. 2023 308 116268 10.1016/j.jep.2023.116268 36842723 Wu T. Kou J. Li X. Diwu Y. Li Y. Cao D. Y. Wang R. Electroacupuncture\nalleviates traumatic brain injury by inhibiting\nautophagy via increasing IL-10 production and blocking the AMPK/mTOR\nsignaling pathway in rats Metab. Brain Dis. 2023 38 3 921 932 10.1007/s11011-022-01133-y 36517637 Franco-Juárez B. Coronel-Cruz C. Hernández-Ochoa B. Gómez-Manzo S. Cárdenas-Rodríguez N. Arreguin-Espinosa R. Bandala C. Canseco-Ávila L. M. Ortega-Cuellar D. TFEB; Beyond\nIts Role as an Autophagy and Lysosomes Regulator Cells. 2022 11 19 3153 10.3390/cells11193153 36231114 PMC9562866 Tang Y. Liu Y. Zhou H. Lu H. Zhang Y. Hua J. Liao X. Esketamine is neuroprotective against traumatic brain injury through\nits modulation of autophagy and oxidative stress via AMPK/mTOR-dependent\nTFEB nuclear translocation Exp. Neurol. 2023 366 114436 10.1016/j.expneurol.2023.114436 37187276 Park J. M. Lee D. H. Kim D. H. Redefining\nthe role of AMPK in autophagy\nand the energy stress response Nat. Commun. 2023 14 1 2994 10.1038/s41467-023-38401-z 37225695 PMC10209092 Sajadimajd S. Khazaei M. Oxidative Stress and\nCancer: The Role of Nrf2 Curr. Cancer Drug\nTargets 2018 18 6 538 557 10.2174/1568009617666171002144228 28969555 Kobayashi M. Yamamoto M. Molecular mechanisms\nactivating the Nrf2-Keap1 pathway\nof antioxidant gene regulation Antioxid. Redox\nSignal. 2005 7 3–4 385 394 10.1089/ars.2005.7.385 15706085 Dodson M. Redmann M. Rajasekaran N. S. Darley-Usmar V. Zhang J. KEAP1-NRF2 signalling and autophagy in protection against oxidative\nand reductive proteotoxicity Biochem. J. 2015 469 3 347 355 10.1042/BJ20150568 26205490 PMC5514546 Zhang E. Wu T. Zhuo Y. Cui J. Sun S. Wu G. Zhang G. Effect of Nrf2 on brain\ninjury induced by hydraulic shock via regulation\nof mitophagy and apoptosis Aging 2023 15 22 13422 13433 10.18632/aging.205250 38019476 PMC10713422 Cui C. Wang C. Jin F. Yang M. Kong L. Han W. Jiang P. Calcitriol\nconfers neuroprotective effects in traumatic\nbrain injury by activating Nrf2 signaling through an autophagy-mediated\nmechanism Mol. Med. 2021 27 1 118 10.1186/s10020-021-00377-1 34556021 PMC8461874 Feng X. Ma W. Zhu J. Jiao W. Wang Y. Dexmedetomidine alleviates\nearly brain injury following traumatic brain injury by inhibiting\nautophagy and neuroinflammation through the ROS/Nrf2 signaling pathway Molecular Medicine Reports 2021 24 3 661 10.3892/mmr.2021.12300 34278508 PMC8335733 Ngo V. Duennwald M. L. Nrf2 and Oxidative Stress: A General Overview of Mechanisms\nand Implications in Human Disease Antioxidants\n(Basel, Switzerland) 2022 11 12 2345 10.3390/antiox11122345 36552553 PMC9774434 Feng X. Ma W. Zhu J. Jiao W. Wang Y. Dexmedetomidine alleviates early brain injury following\ntraumatic brain injury by inhibiting autophagy and neuroinflammation\nthrough the ROS/Nrf2 signaling pathway Molecular\nMedicine Reports 2021 24 3 10.3892/mmr.2021.12300 PMC8335733 34278508 Kim H. J. Kim H. Lee J. H. Hwangbo C. Toll-like receptor 4 (TLR4): new\ninsight immune and aging Immunity Ageing 2023 20 1 67 10.1186/s12979-023-00383-3 38001481 PMC10668412 Ahmad A. Crupi R. Campolo M. Genovese T. Esposito E. Cuzzocrea S. Absence of\nTLR4 reduces neurovascular unit and secondary\ninflammatory process after traumatic brain injury in mice PLoS One 2013 8 3 e57208 10.1371/journal.pone.0057208 23555560 PMC3610903 Fang H. Wang P. F. Zhou Y. Wang Y. C. Yang Q. W. Toll-like\nreceptor 4 signaling in intracerebral hemorrhage-induced inflammation\nand injury J. Neuroinflammation 2013 10 27 10.1186/1742-2094-10-27 23414417 PMC3598479 Deguine J. Barton G. M. MyD88: a central\nplayer in innate immune signaling F1000prime\nRep. 2014 6 97 10.12703/P6-97 25580251 PMC4229726 Wicherska-Pawłowska K. Wróbel T. Rybka J. Toll-Like Receptors (TLRs), NOD-Like\nReceptors (NLRs), and RIG-I-Like Receptors (RLRs) in Innate Immunity.\nTLRs, NLRs, and RLRs Ligands as Immunotherapeutic Agents for Hematopoietic\nDiseases Int. J. Mol. Sci. 2021 22 24 13397 10.3390/ijms222413397 34948194 PMC8704656 Zhang F. Dong H. Lv T. Jin K. Jin Y. Zhang X. Jiang J. Moderate hypothermia\ninhibits microglial\nactivation after traumatic brain injury by modulating autophagy/apoptosis\nand the MyD88-dependent TLR4 signaling pathway J. Neuroinflammation 2018 15 1 273 10.1186/s12974-018-1315-1 30236124 PMC6146525 Feng Y. Cui C. Liu X. Wu Q. Hu F. Zhang H. Ma Z. Wang L. Protective Role of\nApocynin via Suppression of Neuronal\nAutophagy and TLR4/NF-κB Signaling Pathway in a Rat Model of\nTraumatic Brain Injury Neurochem. Res. 2017 42 11 3296 3309 10.1007/s11064-017-2372-z 28786047 Jiang H. Wang Y. Liang X. Xing X. Xu X. Zhou C. Toll-Like Receptor 4 Knockdown Attenuates Brain Damage and Neuroinflammation\nAfter Traumatic Brain Injury via Inhibiting Neuronal Autophagy and\nAstrocyte Activation Cell. Mol. Neurobiol. 2018 38 5 1009 1019 10.1007/s10571-017-0570-5 29222622 PMC11481957 Feng Y. Ju Y. Wu Q. Sun G. Yan Z. TAK-242, a toll-like\nreceptor 4 antagonist, against brain injury by alleviates autophagy\nand inflammation in rats Open Life Sciences 2023 18 1 20220662 10.1515/biol-2022-0662 37528888 PMC10389675 Yin Y. Sun G. Li E. Kiselyov K. Sun D. ER stress and impaired\nautophagy flux in neuronal degeneration and brain injury Ageing Res. Rev. 2017 34 3 14 10.1016/j.arr.2016.08.008 27594375 PMC5250579 Walter P. Ron D. The unfolded protein response: from\nstress pathway to homeostatic\nregulation Science 2011 334 6059 1081 1086 10.1126/science.1209038 22116877 Di\nConza G. Ho P. C. ER Stress Responses: An Emerging\nModulator for Innate Immunity Cells. 2020 9 3 695 10.3390/cells9030695 32178254 PMC7140669 Vanhoutte D. Schips T. G. Vo A. Grimes K. M. Baldwin T. A. Brody M. J. Accornero F. Sargent M. A. Molkentin J. D. Thbs1 induces\nlethal cardiac atrophy through PERK-ATF4 regulated autophagy Nat. Commun. 2021 12 1 3928 10.1038/s41467-021-24215-4 34168130 PMC8225674 B’Chir W. Maurin A. C. Carraro V. Averous J. Jousse C. Muranishi Y. Parry L. Stepien G. Fafournoux P. Bruhat A. The eIF2α/ATF4 pathway is essential\nfor stress-induced\nautophagy gene expression Nucleic Acids Res. 2013 41 16 7683 7699 10.1093/nar/gkt563 23804767 PMC3763548 Ni H. Kan X. Rui Q. Zhang Y. Zhai W. Zhang B. Yu Z. RACK1 promotes\nautophagy via the PERK signaling pathway to protect\nagainst traumatic brain injury in rats CNS\nNeuroscience Therapeutics 2024 30 3 e14691 10.1111/cns.14691 38532543 PMC10966134 Wu F. Zhang R. Meng W. Liu L. Tang Y. Lu L. Xia L. Zhang H. Feng Z. Chen D. Platelet derived\ngrowth factor promotes the recovery of traumatic brain injury by inhibiting\nendoplasmic reticulum stress and autophagy-mediated pyroptosis Front. Pharmacol. 2022 13 862324 10.3389/fphar.2022.862324 36339541 PMC9629145 Wang D. Y. Hong M. Y. Pei J. Gao Y. H. Zheng Y. Xu X. ER stress mediated-autophagy contributes to neurological dysfunction\nin traumatic brain injury via the ATF6 UPR signaling pathway Molecular Medicine Rep. 2021 23 4 247 10.3892/mmr.2021.11886 33537827 Fang C. Weng T. Hu S. Yuan Z. Xiong H. Huang B. Cai Y. Li L. Fu X. IFN-γ-induced\nER stress impairs autophagy and triggers apoptosis in lung cancer\ncells Oncoimmunology 2021 10 1 1962591 10.1080/2162402X.2021.1962591 34408924 PMC8366549 Liu W. Xu L. Wang X. Zhang D. Sun G. Wang M. Wang M. Han Y. Chai R. Wang H. PRDX1 activates\nautophagy via the PTEN-AKT signaling pathway to protect against cisplatin-induced\nspiral ganglion neuron damage Autophagy 2021 17 12 4159 4181 10.1080/15548627.2021.1905466 33749526 PMC8726717 Nakka V. P. Prakash-Babu P. Vemuganti R. Crosstalk Between Endoplasmic Reticulum\nStress, Oxidative Stress, and Autophagy: Potential Therapeutic Targets\nfor Acute CNS Injuries Mol. Neurobiol. 2016 53 1 532 544 10.1007/s12035-014-9029-6 25482050 PMC4461562 Gao C. Chen X. Xu H. Guo H. Zheng L. Yan Y. Ren Z. Luo C. Gao Y. Wang Z. Tao L. Wang T. Restraint\nStress Delays the Recovery of Neurological\nImpairments and Exacerbates Brain Damages through Activating Endoplasmic\nReticulum Stress-mediated Neurodegeneration/Autophagy/Apopotosis post\nModerate Traumatic Brain Injury Mol. Neurobiol. 2022 59 3 1560 1576 10.1007/s12035-022-02735-4 35001355 Interdonato L. Marino Y. Impellizzeri D. D’Amico R. Siracusa R. Fusco R. Cammilleri G. Pantano L. Modafferi S. Abdelhameed A. S. Fritsch T. Rashan L. J. Cuzzocrea S. Calabrese V. Cordaro M. Di Paola R. Autophagy machinery\nplays an essential role in traumatic brain injury-induced apoptosis\nand its related behavioral abnormalities in mice: focus on Boswellia\nSacra gum resin Front. Physiol. 2024 14 1320960 10.3389/fphys.2023.1320960 38250661 PMC10797063 Ling G. Zhang M. Chen C. Wang Y. Gao Q. Li J. Yuan H. Jin W. Lin W. Yang L. Progress of\nGinsenoside Rb1 in neurological disorders Front.\nPharmacol. 2024 15 1280792 10.3389/fphar.2024.1280792 38327982 PMC10847293 Shi Y. H. Li Y. Wang Y. Xu Z. Fu H. Zheng G. Q. Ginsenoside-Rb1\nfor Ischemic Stroke: A Systematic Review and Meta-analysis of Preclinical\nEvidence and Possible Mechanisms Front. Pharmacol. 2020 11 285 10.3389/fphar.2020.00285 32296332 PMC7137731 Zhang H. Chen X. Wang X. Liu Y. Sands C. D. Tang M. Ginsenoside Rb1 attenuates lipopolysaccharide-induced\nneural damage\nin the brain of mice via regulating the dysfunction of microglia and\nastrocytes J. Integr. Neurosci. 2021 20 4 813 823 10.31083/j.jin2004084 34997706 Zou S. Chen W. Ding H. Qi Y. Wang Z. Fu J. Ren D. Duan J. Jiang B. Feng J. Involvement\nof Autophagy in the Protective Effects of Ginsenoside Rb1 in a Rat\nModel of Traumatic Brain Injury Eur. J. Drug\nMetab. Pharmacokinet. 2022 47 6 869 877 10.1007/s13318-022-00799-0 36197653 Shi Y. Zhou X. Yang R. Ying S. Wang L. Panax notoginseng\nprotects the rat brain function from traumatic brain injury by inhibiting\nautophagy via mammalian targeting of rapamycin Aging 2021 13 8 11207 11217 10.18632/aging.202790 33819197 PMC8109077 Wang Y. An J. Zhou J. Chang L. Zhang Q. Peng F. Hydroxysafflor\nyellow A: a natural pigment with potential anticancer therapeutic\neffect Front. Pharmacol. 2025 15 1495393 10.3389/fphar.2024.1495393 39877386 PMC11772350 Sheng C. Peng W. Xia Z. Wang Y. Plasma and\ncerebrospinal\nfluid pharmacokinetics of hydroxysafflor yellow A in patients with\ntraumatic brain injury after intravenous administration of Xuebijing\nusing LC-MS/MS method Xenobiotica 2020 50 5 545 551 10.1080/00498254.2019.1668983 31524030 Patel D. Wairkar S. Lyotropic liquid crystalline\nnanoparticles of morin:\nAn approach to improve pharmacokinetics and brain disposition in rats\nvia nose-to-brain pathway Nanomed. 2025 66 102823 10.1016/j.nano.2025.102823 40254045 Elbaz E. M. Sayed R. H. Abdelkader A. A. Fahim A. T. Neuroprotective\nrole of morin hydrate on 3-nitropropionic acid-elicited huntington’s\ndisease: in vivo investigation of RIPK1/RIPK3/MLKL necroptosis signaling\npathway Mol. Med. 2025 31 1 135 10.1186/s10020-025-01172-y 40217493 PMC11987198 Wang Z. Cui J. Li D. Ran S. Huang J. Chen G. Morin exhibits\na neuroprotective effect in MPTP-induced Parkinson’s disease\nmodel via TFEB/AMPK-mediated mitophagy Phytomedicine 2023 116 154866 10.1016/j.phymed.2023.154866 37209604 El-Gazar A. A. Soubh A. A. Mohamed E. A. Awad A. S. El-Abhar H. S. Morin post-treatment\nconfers neuroprotection in a novel rat model of mild repetitive traumatic\nbrain injury by targeting dementia markers, APOE, autophagy and Wnt/β-catenin\nsignaling pathway Brain Res. 2019 1717 104 116 10.1016/j.brainres.2019.04.003 31002817 Hu Z. Guan Y. Hu W. Xu Z. Ishfaq M. An overview\nof pharmacological activities of baicalin and its aglycone baicalein:\nNew insights into molecular mechanisms and signaling pathways Iranian J. Basic Med. Sci. 2022 25 1 14 26 10.22038/IJBMS.2022.60380.13381 PMC9118284 35656442 Si L. An Y. Zhou J. Lai Y. Neuroprotective effects of baicalin\nand baicalein on the central nervous system and the underlying mechanisms Heliyon 2025 11 1 e41002 10.1016/j.heliyon.2024.e41002 39758400 PMC11699331 Cheng Y. Jiang M. Qin X. Mao J. Liu Y. Zhu G. Baicalin attenuates LPS-induced periodontal inflammation\nresponse\nby inhibiting autophagy BMC Oral Health 2025 25 1 513 10.1186/s12903-025-05913-7 40211339 PMC11987269 Pang H. Wu T. Peng Z. Tan Q. Peng X. Zhan Z. Song L. Wei B. Baicalin induces\napoptosis and autophagy\nin human osteosarcoma cells by increasing ROS to inhibit PI3K/Akt/mTOR,\nERK1/2 and β-catenin signaling pathways Journal of bone oncology 2022 33 100415 10.1016/j.jbo.2022.100415 35573641 PMC9091934 Vongthip W. Nilkhet S. Boonruang K. Sukprasansap M. Tencomnao T. Baek S. J. Neuroprotective mechanisms of luteolin\nin glutamate-induced oxidative stress and autophagy-mediated neuronal\ncell death Sci. Rep. 2024 14 1 7707 10.1038/s41598-024-57824-2 38565590 PMC10987666 Qu L. Wu J. Tang Y. Yun X. Lo H. H. Yu L. Li W. Wu A. Law B. Y. K. Licochalcone B, a Natural Autophagic\nAgent for Alleviating Oxidative Stress-Induced Cell Death in Neuronal\nCells and Caenorhabditis elegans Models Pharmaceuticals\n(Basel, Switzerland) 2022 15 9 1052 10.3390/ph15091052 36145273 PMC9502728 Fang J. Zhu Y. Wang H. Cao B. Fei M. Niu W. Zhou Y. Wang X. Li X. Zhou M. Baicalin Protects\nMice Brain From Apoptosis in Traumatic Brain Injury Model Through\nActivation of Autophagy Front. Neurosci. 2019 12 1006 10.3389/fnins.2018.01006 30686973 PMC6334745 Bao M. Ma Y. Liang M. Sun X. Ju X. Yong Y. Liu X. Research progress on\npharmacological effects and new dosage forms\nof baicalin Veterinary medicine and science 2022 8 6 2773 2784 10.1002/vms3.960 36271488 PMC9677381 Dong X. Fu J. Yin X. Cao S. Li X. Lin L. Ni J. Emodin: A Review of\nits Pharmacology, Toxicity and Pharmacokinetics Phytother. Res. 2016 30 8 1207 1218 10.1002/ptr.5631 27188216 PMC7168079 Benameur T. Soleti R. Porro C. The Potential\nNeuroprotective Role\nof Free and Encapsulated Quercetin Mediated by miRNA against Neurological\nDiseases Nutrients 2021 13 4 1318 10.3390/nu13041318 33923599 PMC8073422 Zhang Q. Song W. Zhao B. Xie J. Sun Q. Shi X. Yan B. Tian G. Liang X. Quercetin\nAttenuates Diabetic Peripheral Neuropathy by Correcting Mitochondrial\nAbnormality via Activation of AMPK/PGC-1α Pathway in vivo and\nin vitro Front. Neurosci. 2021 15 636172 10.3389/fnins.2021.636172 33746703 PMC7966726 Xiao J. Zhang B. Yin S. Xie S. Huang K. Wang J. Yang W. Liu H. Zhang G. Liu X. Li Y. Nie D. Quercetin\ninduces autophagy-associated death in HL-60 cells through CaMKKβ/AMPK/mTOR\nsignal pathway Acta Biochim. Biophys. Sin.\n(Shanghai) 2022 54 9 1244 1256 10.3724/abbs.2022117 36148953 PMC9827794 Cruz-Gregorio A. Aranda-Rivera A. K. Quercetin and Ferroptosis Life (Basel, Switzerland) 2023 13 8 1730 10.3390/life13081730 37629587 PMC10455543 Du G. Zhao Z. Chen Y. Li Z. Tian Y. Liu Z. Liu B. Song J. Quercetin\nattenuates neuronal autophagy\nand apoptosis in rat traumatic brain injury model via activation of\nPI3K/Akt signaling pathway Neurol. Res. 2016 38 11 1012 1019 10.1080/01616412.2016.1240393 27690831 Owjfard M. Rahimian Z. Karimi F. Borhani-Haghighi A. Mallahzadeh A. A comprehensive review on the neuroprotective potential\nof resveratrol in ischemic stroke Heliyon 2024 10 14 e34121 10.1016/j.heliyon.2024.e34121 39082038 PMC11284444 Grabarczyk M. Justyńska W. Czpakowska J. Smolińska E. Bielenin A. Glabinski A. Szpakowski P. Role of Plant Phytochemicals: Resveratrol, Curcumin,\nLuteolin and Quercetin in Demyelination, Neurodegeneration, and Epilepsy Antioxidants (Basel, Switzerland) 2024 13 11 1364 10.3390/antiox13111364 39594506 PMC11591432 Han Z. Zhao Z. Wang L. Zhu B. Zhu Y. Yue C. Zhang F. Zhu L. Nie E. Li Z. Targeted Pyroptosis\nwith Resveratrol Nanoparticles to Reduce Secondary Brain Injury and\nPost-Traumatic Epilepsy ACS Appl. Mater. Interfaces 2024 16 48 65850 65862 10.1021/acsami.4c14389 39565926 Cao Q. Gu L. Wang L. Sun G. Ying T. Su H. Wang W. Sun Z. Resveratrol alleviates endoplasmic\nreticulum stress-induced cell death and improves functional prognosis\nafter traumatic brain injury in mice Journal\nof applied biomedicine 2024 22 2 99 106 10.32725/jab.2024.008 38912865 Feng Y. Ju Y. Yan Z. Ji M. Li J. Wu Q. Yang M. Sun G. Resveratrol\nattenuates\nautophagy and inflammation after traumatic brain injury by activation\nof PI3K/Akt/mTOR pathway in rats Folia Neuropathol. 2022 60 2 153 164 10.5114/fn.2022.118184 35950468 Zhang Z. Li D. Xu L. Li H. P. Sirt1 improves\nfunctional recovery by regulating autophagy of astrocyte and neuron\nafter brain injury Brain Res. Bull. 2019 150 42 49 10.1016/j.brainresbull.2019.05.005 31102754 Khan M. S. Muhammad T. Ikram M. Kim M. O. Dietary\nSupplementation of the Antioxidant Curcumin Halts Systemic LPS-Induced\nNeuroinflammation-Associated Neurodegeneration and Memory/Synaptic\nImpairment via the JNK/NF-κB/Akt Signaling Pathway in Adult\nRats Oxid. Med. Cell. Longev. 2019 2019 7860650 10.1155/2019/7860650 31827700 PMC6885271 Cai B. Wang Q. Zhong L. Liu F. Wang X. Chen T. Integrating Network Pharmacology,\nTranscriptomics to Reveal Neuroprotective\nof Curcumin Activate PI3K/AKT Pathway in Parkinson’s Disease Drug Des. Devel. Ther. 2024 18 2869 2881 10.2147/DDDT.S462333 PMC11246089 39006191 Wang J. Zhang J. Zhang C. J. Wong Y. K. Lim T. K. Hua Z. C. Liu B. Tannenbaum S. R. Shen H. M. Lin Q. In situ Proteomic Profiling of Curcumin\nTargets in HCT116 Colon Cancer Cell Line Sci.\nRep. 2016 6 22146 10.1038/srep22146 26915414 PMC4768257 Zhang J. Wang J. Xu J. Lu Y. Jiang J. Wang L. Shen H. M. Xia D. Curcumin targets\nthe TFEB-lysosome pathway for induction of autophagy Oncotarget 2016 7 46 75659 75671 10.18632/oncotarget.12318 27689333 PMC5342768 Guo J. Li Z. Yao Y. Fang L. Yu M. Wang Z. Curcumin in the treatment\nof inflammation and oxidative stress responses\nin traumatic brain injury: a systematic review and meta-analysis Front. Neurol. 2024 15 1380353 10.3389/fneur.2024.1380353 38798711 PMC11116723 Klingseisen V. Slanovc J. Regouc M. Hrzenjak A. Bisdemethoxycurcumin\nsensitizes the response of cisplatin resistant non-small cell lung\ncarcinoma cell lines by activating apoptosis and autophagy J. Nutr. Biochem. 2022 106 109003 10.1016/j.jnutbio.2022.109003 35346827 Pinkaew D. Changtam C. Tocharus C. Govitrapong P. Jumnongprakhon P. Suksamrarn A. Tocharus J. Association of Neuroprotective\nEffect of Di-O-Demethylcurcumin on Aβ25–35-Induced Neurotoxicity\nwith Suppression of NF-κB and Activation of Nrf2 Neurotox. Res. 2016 29 1 80 91 10.1007/s12640-015-9558-4 26358194 Xu Y. Peng L. S. Xiao C. Q. Zhou Y. Wang Q. S. Fu H. Bisdemethoxycurcumin\nmitigates traumatic brain injury in rats by\nmodulating autophagy and oxidative stress via heat shock protein 90\nalpha family class A member 1-mediated nuclear translocation of transcription\nfactor EB Brain Res. Bull. 2025 222 111221 10.1016/j.brainresbull.2025.111221 39855313 He L. N. Liu Y. J. Jiang J. B. Wang D. Y. Li Y. L. Zeng S. J. Guo Z. Yao P. Y. Lin Z. C. Lv S. X. Liu X. Y. Guo W. Liu F. Du B. Y. Zhao T. X. Xiao J. Y. Shi Y. F. Wang K. Tetrandrine augments melanoma cell\nimmunogenicity via dual inhibition\nof autophagic flux and proteasomal activity enhancing MHC-I presentation Acta Pharmacol. Sin. 2025 46 2056 10.1038/s41401-025-01507-9 40016522 PMC12205077 Wang Y. Cai X. Wu Z. Tang L. Lu L. Xu Y. Bao X. Tetrandrine attenuates ischemia/reperfusion-induced\nneuronal damage in the subacute phase Mol.\nMed. Rep. 2021 23 4 297 10.3892/mmr.2021.11936 33649825 PMC7930946 Liu H. He S. Wang J. Li C. Liao Y. Zou Q. Chen R. Tetrandrine Ameliorates Traumatic Brain Injury by Regulating\nAutophagy to Reduce Ferroptosis Neurochem.\nRes. 2022 47 6 1574 1587 10.1007/s11064-022-03553-9 35266084 Yang W. Qiu X. Wu Q. Chang F. Zhou T. Zhou M. Pei J. Active constituents\nof saffron (Crocus sativus L.) and their prospects in treating neurodegenerative\ndiseases (Review) Experimental Therapeutic\nMed. 2023 25 5 235 10.3892/etm.2023.11934 PMC10127217 37114174 Wang C. Cai X. Hu W. Li Z. Kong F. Chen X. Wang D. Investigation of the\nneuroprotective effects of crocin via antioxidant activities in HT22\ncells and in mice with Alzheimer’s disease Int. J. Mol. Med. 2018 43 2 956 966 10.3892/ijmm.2018.4032 30569175 PMC6317678 Guo Z. L. Li M. X. Li X. L. Wang P. Wang W. G. Du W. Z. Yang Z. Q. Chen S. F. Wu D. Tian X. Y. Crocetin: A Systematic\nReview Front. Pharmacol. 2022 12 745683 10.3389/fphar.2021.745683 35095483 PMC8795768 Salem M. Shaheen M. Tabbara A. Borjac J. Saffron extract\nand crocin exert anti-inflammatory and anti-oxidative effects in a\nrepetitive mild traumatic brain injury mouse model Sci. Rep. 2022 12 1 5004 10.1038/s41598-022-09109-9 35322143 PMC8943204 Chen S. Luo X. Yang L. Luo L. Hu Z. Wang J. Crocetin protects mouse brain from apoptosis in traumatic\nbrain injury model through activation of autophagy Brain Inj. 2024 38 7 524 530 10.1080/02699052.2024.2324022 38433503 Wang C. Wang Z. Jia R. Huang T. Li H. Wang Y. Effects of scalp acupuncture on the limb function recovery\nof hemiplegia after moderate to severe traumatic brain injury Physiology international 2025 112 1 56 67 10.1556/2060.2025.00503 40080084 Wu M. Song W. Teng L. Li J. Liu J. Ma H. Zhang G. Zhang J. Chen Q. Exploring the biological\nbasis of acupuncture treatment for traumatic brain injury: a review\nof evidence from animal models Frontiers in\nCellular Neuroscience 2024 18 1405782 10.3389/fncel.2024.1405782 39171199 PMC11335542 Jia H. Chen Y. Wang Y. Jia L. Tian Y. Jiang H. The neuroprotective effect of electro-acupuncture on cognitive recovery\nfor patients with mild traumatic brain injury: A randomized controlled\nclinical trial Medicine (Baltim.) 2023 102 6 e32885 10.1097/MD.0000000000032885 PMC9907991 36820591 Herrmann A. A. Chrenka E. A. Bouwens S. G. Tansey E. K. Wolf A. A. Chung K. W. Farrell M. T. Sherman S. J. Svitak A. L. Hanson L. R. Acupuncture Treatment\nfor Chronic\nPost-Traumatic Headache in Individuals with Mild Traumatic Brain Injury:\nA Pilot Study J. Neurotrauma 2025 42 1–2 19 32 10.1089/neu.2024.0212 39302056 Sodders M. D. Martin A. M. Coker J. Hammond F. M. Hoffman J. M. Acupuncture\nuse for pain after traumatic brain injury:\na NIDILRR Traumatic Brain Injury Model Systems cohort study Brain Inj. 2023 37 6 494 502 10.1080/02699052.2023.2187088 36998180 PMC10332108 Wei C. Wang J. Yu J. Tang Q. Liu X. Zhang Y. Cui D. Zhu Y. Mei Y. Wang Y. Wang W. Therapy of traumatic brain injury\nby modern agents and traditional Chinese medicine Chin. Med. 2023 18 1 25 10.1186/s13020-023-00731-x 36906602 PMC10008617 Lee B. Leem J. Kim H. Jo H. G. Kwon C. Y. Herbal\nMedicine for Traumatic Brain Injury: A Systematic Review and Meta-Analysis\nof Randomized Controlled Trials and Limitations Frontiers in Neurology 2020 11 772 10.3389/fneur.2020.00772 33071922 PMC7530840 Yang B. Wang Z. Sheng C. Wang Y. Zhou J. Xiong X. G. Peng W. Evidence-based review\nof oral traditional Chinese medicine compound recipe administration\nfor treating weight drop-induced experimental traumatic brain injury BMC Complement. Altern. Med. 2016 16 95 10.1186/s12906-016-1076-2 26956181 PMC4784383 ",
  "metadata": {
    "Title of this paper": "Evidence-based review\nof oral traditional Chinese medicine compound recipe administration\nfor treating weight drop-induced experimental traumatic brain injury",
    "Journal it was published in:": "ACS Omega",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489624/"
  }
}