{
  "title": "Paper_899",
  "abstract": "pmc Mar Drugs Mar Drugs 590 mardrugs marinedrugs Marine Drugs 1660-3397 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471528 PMC12471528.1 12471528 12471528 41003335 10.3390/md23090364 marinedrugs-23-00364 1 Article Effect of Precipitated Extracellular Marennine on Angiogenesis and Tumour Cell Proliferation https://orcid.org/0000-0003-2856-1988 Fodil Mostefa 1 * † https://orcid.org/0000-0002-2978-1192 Muñoz-Garcia Javier 2 3 † Benali Amel-Khitem 1 Rogozarski Jasmina 4 Mignon Virginie 5 Labrana Honora 4 Lokajczyk Anna 4 https://orcid.org/0000-0003-2209-8080 Pasetto Pamela 6 Mouget Jean-Luc 1 https://orcid.org/0000-0001-6651-4926 Boisson-Vidal Catherine 4 https://orcid.org/0000-0001-7777-0669 Heymann Dominique 2 3 7 O’Keefe Barry R. Academic Editor 1 2 3 4 5 6 7 * mostefa.fodil@univ-lemans.fr † These authors contributed equally to this work. 19 9 2025 9 2025 23 9 497656 364 23 7 2025 10 9 2025 15 9 2025 19 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Angiogenesis is a fundamental biological process involved in the formation of new blood vessels from the pre-existing vascular network. In addition to physiological processes, angiogenesis is also implicated in pathological conditions such as tumour growth and metastatic progression. Research on marennine, a water-soluble blue-green pigment produced by the marine diatom Haslea ostrearia Precipitated Extracellular Marennine PEMn marennine Haslea ostrearia endothelial colony-forming cells angiogenesis inhibitors anticancer activity SATT Ouest Valorisation SATT DV3638 European Union’s Horizon 2020 research and innovation programme GHaNA N° 734708/GHaNA/H2020-MSCA-RISE-2016 This work received funding from SATT Ouest Valorisation SATT [DV3638] and from the European Union’s Horizon 2020 research and innovation programme GHaNA under grant agreement N° 734708/GHaNA/H2020-MSCA-RISE-2016. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Microalgae play a crucial role in aquatic ecosystems by contributing to primary productivity and generating over 50% of atmospheric oxygen [ 1 1 2 3 4 Among the microalgae of interest, the marine diatom Haslea ostrearia 5 6 7 6 8 9 10 11 12 13 14 Research on marennine has highlighted various promising biological activities. Aqueous extracts of this molecule have demonstrated antioxidant, antibacterial, antiviral, and antiproliferative effects [ 7 12 13 14 12 13 14 Angiogenesis is a fundamental biological process involved in the formation of new blood vessels from the pre-existing vascular network. This phenomenon is tightly regulated by complex interactions among endothelial cells, angiogenic growth factors, and the extracellular matrix [ 15 16 17 Precipitated Extracellular Marennine 18 19 2. Results 2.1. Effect of PEMn on Tumour Cell Adhesion and Proliferation The potential antitumoural activity of the PEMn ( Precipitated Extracellular Marennine 19 Figure 1 Figure 1 Figure 1 p p p p Similarly, the effect of PEMn in cell proliferation of several angiogenic tumour cell lines was assessed using xCELLigence technology. After 4 h of cell adhesion, six different tumour cell lines (melanoma A-375, lung cancer A-549, glioblastoma U-251 MG, breast cancer MCF-7, colon cancer HT-29 and prostate cancer PC-3A) were exposed to increasing doses of PEMn (from 1.56 to 100 µg/mL) and cell proliferation was monitored over 72 h ( Figure 2 Figure 2 p Figure 2 p p 2.2. Effect of PEMn on ECFCs Viability and Senescence We then evaluated the effect of PEMn on the proliferation of ECFCs cultured under different conditions: an EBM2-5% FBS medium supplemented with VEGF (40 ng/mL), used as a control, and the same medium supplemented with different concentrations of marennine (1, 10, 50 and 100 µg/mL). The addition of VEGF was justified by the key role it plays in angiogenesis, in the microenvironment of the tumour, where it is present at high levels. As shown in Figure 3 Figure 3 p p PEMn also induced morphological changes in ECFCs, including cell detachment and debris accumulation, visible from 24 h and worsening up to 72 h at 100 µg/mL ( Figure S1 Figure 3 The inhibitory effect of PEMn is reversible (cytostatic). When PEMn is removed from the EBM2-5% FBS VEGF culture medium after 24 h of incubation, ECFCs’ proliferation resumes, reaching a level three times higher than under continuous exposure ( Figure 4 Figure 4 2.3. PEMn Induces ECFCs Growth Arrest and Apoptosis The antiproliferative effect of PEMn on ECFCs observed in our study is associated with cell cycle arrest in the G0/G1 phase and the induction of apoptosis. To assess the effect of PEMn on the cell cycle and apoptosis of ECFCs, we performed a cellular analysis 24 and 72 h after treatment with PEMn (100 µg/mL). Treatment of ECFCs with 100 µg/mL of PEMn for 24 and 72 h led to a decrease in the number of cells in the G2/M phase ( p p p p Table 1 PEMn also induces a significant increase in apoptotic cell death. The percentage of late apoptotic cells (Annexin V + + Table 2 Figure S2 After 24 h of PEMn exposure, the proportion of late apoptotic cells in treated cultures was more than twice that observed in control conditions (27.8% versus 12.1%, respectively, p p 2.4. Effects of PEMn on ECFCs Migration One of the key steps in angiogenesis is the migration of endothelial cells. To assess this process, we performed a wound healing assay. After creating a wound on a subconfluent cell layer, we monitored its closure over time. ECFCs were incubated in EBM2 medium supplemented with 5% FBS and VEGF (40 ng/mL) (control condition), with or without the addition of PEMn at 10, 50, and 100 µg/mL. To avoid experimental bias due to paracrine effects that could enhance migratory and/or proliferative capacities, only wells with an initial wound area ≥ 40 µm 2 Figure 5 Figure 5 Figure 5 Figure 5 p Figure 5 p p PEMn treatment significantly slows wound reduction speed, resulting in a reduction of up to 48.7% compared to the control ( Figure 5 ® Figure 5 Figure S3 2.5. Effect of PEMn on ECFCs Cytokine Profiles The levels of several proteins in cell lysates, including VEGF-R1, IL-1β, IL-6, and MMP-9, produced by ECFCs in response to PEMn treatment were quantified using the multiplex Luminex xMAP™ technology. Table 3 p p p p p 3. Discussion Natural products have always been an invaluable source of new bioactive compounds, particularly in the search for anticancer therapies. Among them, marine compounds stand out for their chemopreventive, chemotherapeutic and anti-angiogenic properties, playing a role in regulating cell proliferation, mitogenic signal transduction, and the formation of new blood vessels [ 20 21 22 23 24 25 Haslea ostrearia 12 14 8 13 Haslea ostrearia Angiogenesis is a key step in tumour and metastasis proliferation and dissemination [ 25 25 25 25 25 25 Figure 1 Figure 2 Figure 6 Figure S4 Figure 2 Figure S5 Figure 3 p p 26 27 28 In addition to its antiproliferative effect, PEMn significantly reduced ECFCs migration in wound healing assays and inhibited the formation of vascular-like structures on Matrigel ® 29 Figure S6 PEMn treatment also led to a significant downregulation of VEGF-R1 expression, alongside a marked increase in proinflammatory cytokines (IL-6, IL-1β) and MMP-9. The reduced VEGF-R1 expression may reflect a functional reprogramming of ECFCs or a negative feedback loop aimed at desensitising the cells to proangiogenic stimuli. VEGF-R1 is known to act in part as a decoy receptor for VEGF-A, modulating its availability to VEGF-R2, which more directly drives proliferative and migratory signalling. Thus, downregulation of VEGF-R1 may contribute to angiogenesis modulation by diminishing this regulatory “brake.” Alternatively, it could indicate a loss of active endothelial identity consistent with PEMn-induced functional impairment. The marked increase in IL-6 and IL-1β levels suggests a cellular inflammatory response to PEMn-induced stress. These cytokines are commonly secreted during apoptosis, oxidative stress, or innate immune activation. Their upregulation may involve mitochondrial dysfunction, oxidative imbalance, or activation of inflammatory signalling cascades such as NF-κB. Furthermore, this profile is reminiscent of the senescence-associated secretory phenotype (SASP), which includes IL-6 and IL-1β as key effectors. Multiplex Luminex analysis also revealed a strong upregulation of MMP-9, a metalloproteinase involved in extracellular matrix degradation and tissue remodelling. MMP-9 is frequently elevated in contexts of inflammation, cellular stress, and tissue injury. Its expression is known to be induced by IL-1β and IL-6, suggesting a convergent regulatory network between cytokine signalling and matrix remodelling. In our model, the increased MMP-9 levels may contribute to the inhibition of vascular structure formation by promoting local matrix disorganisation. This inflammatory and degradative profile is consistent with the overall antiangiogenic effect of PEMn and supports the hypothesis of a stress-induced reprogramming of ECFCs. Although IL-6, IL-1β, and MMP-9 are typically pro-angiogenic mediators, PEMn simultaneously increased their levels while inhibiting angiogenesis. This apparent paradox may reflect a stress-induced senescence-associated secretory phenotype (SASP), in which cells secrete inflammatory mediators but exhibit impaired angiogenic functionality. Moreover, elevated MMP-9 may destabilise extracellular matrix integrity, preventing the formation of stable vascular structures. Investigating the involvement of SASP or other stress-induced transcriptional programmes would provide further insight into the nature of the cellular response to PEMn. These findings are consistent with earlier observations showing that aqueous extracts of Haslea ostrearia 13 30 In conclusion, the purified marennine extract exhibits strong potential as an anticancer molecule, particularly due to its effects on angiogenesis and cell proliferation. Haslea ostrearia 4. Materials and Methods 4.1. Microalgae and Purification of Marennine Haslea ostrearia 18 Haslea ostrearia −2 −1 ® 31 PEMn: Precipitated Extracellular Marennine 4.2. Cell Isolation and ECFCs Culture Umbilical cord blood provided by AP-HP, Hôpital Saint-Louis, Unité de Thérapie Cellulaire, CRB-Banque de Sang de Cordon (Paris, France) was collected after normal full-term deliveries with the written informed consent of the mother. Mononuclear cells were isolated from human cord blood by density-gradient centrifugation on Pancoll. They differentiate into endothelial cells in angiogenic growth factor–rich medium, with initial colonies appearing between days 10 and 14 and the first passage around day 20. As previously shown, despite differences in outgrowth, ECFCs and mature endothelial cells, HUVECs differ in the expression of the hematopoietic stem cell marker CD133, which is rapidly down-regulated during ECFC differentiation and reaches HUVEC-like levels by day 60. Obtained ECFCs were identified by their characteristic morphology, then by immunostaining for von Willebrand factor, combined expression of endothelial markers (CD31, KDR, Tie-2, CD144), and double-positivity for DiI-AcLDL uptake and BS-1 lectin binding [ 32 2 4.3. Tumour Cell Lines and Cell Culture All human tumour cell lines used in the present study were obtained from the American Tissue Cell Collection (ATCC, Molsheim, France) and from the European Collection of Authenticated Cell Cultures (ECACC, Salisbury, UK) and were tested routinely as mycoplasma-free. All experiments were performed at 37 °C in a humidity-saturated controlled atmosphere and 5% CO 2 4.4. Real-Time Cell Proliferation Assay Cell proliferation was analysed by xCELLigence technology (Agilent, Les Ulis, France) as previously described [ 19 50 4.5. Real-Time Cell Adhesion Assay Cell adhesion was analysed by xCELLigence technology (Agilent, Les Ulis, France) similarly as described for cell proliferation. Background was measured by adding 50 μL of corresponding media into an E-Plate view 96 (Agilent). Then, cells were seeded in triplicate at 8000 per well (50 μL) and in the presence or absence of PEMn (from 100 μg/mL to 1.56 μg /mL, 100 μL). Cell adhesion into the plate was monitored for 5 h at 37 °C using a RTCA instruments (Agilent) using a RTCA device (Agilent). Experiments were conducted in triplicate. 4.6. In Vitro Angiogenesis Assay and Viability To investigate the effect of various concentrations of PEMn on ECFCs’ proliferation and tubular morphogenesis, ECFCs were stimulated as described above. Cell outgrowth and in vitro tube formation were evaluated as previously described [ 32 33 4.7. Senescence ECFCs were incubated in EGM2 (control) or EGM2 + PEMn (EGM2 Ma, 100 μg/mL) for 24 h at 37 °C and fixed in the presence of a galactose derivative (X-Gal) hydrolysed by β galactosidase, an enzyme overexpressed in senescent cells. The oxidised indolic moiety of the hydrolysed X-Gal forms a blue precipitate. The wells were photographed, and the percentage of blue (senescent) cells was evaluated and compared according to the culture conditions. 4.8. Cell Cycle Analysis Analysis was performed by FACS. Permeabilized ECFCs are treated with propidium iodide (PI), a DNA intercalator that can be used to determine cell cycle phase. Combined with annexin V, which detects phosphatidylserine exposed following loss of plasma membrane asymmetry during apoptosis, PI can be used to quantify necrotic, apoptotic, or healthy ECFCs. Briefly, ECFCs were treated with PEMn (100 µg/mL) for 24–72 h and then harvested, washed, and fixed in 100% ethanol on ice for 30 min at −20 °C. After centrifugation, the cell pellets were washed, resuspended in phosphate-buffered saline (PBS), and incubated with RNase to prevent PI from binding to RNA, and stained with PI at room temperature for 30 min in the dark. DNA content was analysed using a FACS flow cytometer (BD LSR Fortessa TM 4.9. Cell Apoptosis Analysis Apoptosis was detected with an annexin V-fluorescein isothiocyanate (FITC) kit (TACS TM Section 4.2 TM TM + − + + − + 4.10. Wound Healing Assay Migration was evaluated by wound scratch assays. ECFCs were seeded in 6-well plates and incubated with serum. After 24 h, scratch wounds were created in the confluent monolayer using a sterile 200 µL pipette tip.  After removal of floating cells, cells were stimulated as described above ( Section 4.2 4.11. Cytokine and Growth Factor Multiplex Analysis The experiments were conducted on both untreated control ECFCs and ECFCs treated with PEMn. The supernatant from the cell culture medium was collected in microtubes and immediately frozen at −80 °C for subsequent analysis. A bead-based antibody mix targeting IL-1β, IL-6, IL-8, VEGF-R1, VEGF-R2, and MMP-9 (Human Luminex ® ® 4.12. Statistical Analysis Experiments were analysed using Prism 6 (GraphPad Prism 6 software; La Jolla, CA, USA). Data are expressed as the mean ± SD of at least 5 independent experiments. One-way analysis of variance (ANOVA) and Student’s t p p www.real-statistics.com Acknowledgments The authors thank Thomas Montrouge for his valuable contribution to the microscopy experiments, which provided evidence of PEMn internalisation. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/md23090364/s1 Figure 2 n Figure 3 n Author Contributions Conceptualization, M.F., J.M.-G., C.B.-V. and D.H.; methodology, M.F., J.M.-G., C.B.-V. and D.H.; software, J.M.-G.; validation, M.F., J.M.-G., C.B.-V. and D.H.; formal analysis, M.F., J.M.-G., A.-K.B., H.L., J.R., V.M., A.L., P.P., J.-L.M. and C.B.-V.; investigation, M.F., J.M.-G., A.-K.B., J.R., H.L., A.L., P.P. and J.-L.M.; resources, M.F., J.M.-G., A.-K.B., C.B.-V. and D.H.; data curation, J.M.-G. and C.B.-V.; writing—original draft preparation, M.F., J.M.-G., C.B.-V. and D.H.; writing—review and editing, M.F., J.M.-G., C.B.-V. and D.H.; visualisation, V.M.; supervision, M.F. and C.B.-V.; project administration, M.F.; funding acquisition, M.F., P.P. and J.-L.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki. Endothelial colony-forming cells (ECFCs) were isolated from umbilical cord blood samples under authorisation AC-2016-2759 and AC-2022-5325, issued on 19/12/22 for a duration of five years. These authorisations were granted as part of the CRB–Banque de Sang de Cordon in Paris and are not linked to a specific project; therefore, no study title or ethics committee approval was required. Informed Consent Statement Umbilical cord blood for this study was obtained from AP-HP, Hôpital Saint-Louis, Unité de Thérapie Cellulaire, and the CRB–Banque de Sang de Cordon in Paris after normal full-term deliveries, with written informed consent from the mothers. The CRB is authorised by the Ministry as a biological resource centre for the preparation and provision of human biological material for scientific use. Data Availability Statement Data and materials are available from the corresponding author upon request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations CI Cell Index ECFCs Endothelial Colony-Forming Cells FBS Foetal Bovine Serum FGF Fibroblast Growth Factor IL Interleukin MMP Matrix Metalloproteinase  n number of experimental replicates NF-kb Nuclear Factor kappa B NCI Matrix Metalloproteinase PEMn Precipitated Extracellular Marennine RTCA Real Cell Time Analysis SDF-1 Stromal Cell-Derived Factor 1 VEGF -R Vascular Endothelial Growth Factor Receptor References 1. Barkia I. Saari N. Manning S.R. Microalgae for High-Value Products Towards Human Health and Nutrition Mar. Drugs 2019 17 304 10.3390/md17050304 31137657 PMC6562505 2. Qiao Y. Yang F. Xie T. Du Z. Zhong D. Qi Y. Li Y. Li W. Lu Z. Rao J. Engineered Algae: A Novel Oxygen-Generating System for Effective Treatment of Hypoxic Cancer Sci. Adv. 2020 6 eaba5996 10.1126/sciadv.aba5996 32490207 PMC7239646 3. Li G. Chang X. Luo X. Zhao Y. Wang W. Kang X. Fucoxanthin induces prostate cancer PC-3 cell apoptosis by causing mitochondria dysfunction and oxidative stress Nan Fang Yi Ke Da Xue Xue Bao 2021 41 953 959 10.12122/j.issn.1673-4254.2021.06.21 34238751 PMC8267986 4. Zhang D. Zhong D. Ouyang J. He J. Qi Y. Chen W. Zhang X. Tao W. Zhou M. Microalgae-Based Oral Microcarriers for Gut Microbiota Homeostasis and Intestinal Protection in Cancer Radiotherapy Nat. Commun. 2022 13 1413 10.1038/s41467-022-28744-4 35301299 PMC8931093 5. Falaise C. Cormier P. Tremblay R. Audet C. Deschênes J.-S. Turcotte F. François C. Seger A. Hallegraeff G. Lindquist N. Harmful or Harmless: Biological Effects of Marennine on Marine Organisms Aquat. Toxicol. 2019 209 13 25 10.1016/j.aquatox.2019.01.016 30684731 6. Zebiri I. Jacquette B. Francezon N. Herbaut M. Latigui A. Bricaud S. Tremblay R. Pasetto P. Mouget J.-L. Dittmer J. The Polysaccharidic Nature of the Skeleton of Marennine as Determined by NMR Spectroscopy Mar. Drugs 2023 21 42 10.3390/md21010042 36662215 PMC9865362 7. Gastineau R. Turcotte F. Pouvreau J.-B. Morançais M. Fleurence J. Windarto E. Prasetiya F. Arsad S. Jaouen P. Babin M. Marennine, Promising Blue Pigments from a Widespread Haslea Diatom Species Complex Mar. Drugs 2014 12 3161 3189 10.3390/md12063161 24879542 PMC4071570 8. Gastineau R. Prasetiya F.S. Falaise C. Cognie B. Decottignies P. Morançais M. Méléder V. Davidovich N. Turcotte F. Tremblay R. Marennine-Like Pigments: Blue Diatom or Green Oyster Cult? Blue Biotechnology Wiley-VCH Verlag GmbH & Co. KGaA Weinheim, Germany 2018 529 551 978-3-527-80171-8 9. Yusuf M. Baroroh U. Nuwarda R.F. Prasetiya F.S. Ishmayana S. Novianti M.T. Tohari T.R. Hardianto A. Subroto T. Mouget J.-L. Theoretical and Experimental Studies on the Evidence of 1,3-β-Glucan in Marennine of Haslea Ostrearia Molecules 2023 28 5625 10.3390/molecules28155625 37570595 PMC10419454 10. Young S.H. Dong W.J. Jacobs R.R. Observation of a Partially Opened Triple-Helix Conformation in 1-->3-Beta-Glucan by Fluorescence Resonance Energy Transfer Spectroscopy J. Biol. Chem. 2000 275 11874 11879 10.1074/jbc.275.16.11874 10766814 11. Lehtovaara B.C. Gu F.X. Pharmacological, Structural, and Drug Delivery Properties and Applications of 1,3-β-Glucans J. Agric. Food Chem. 2011 59 6813 6828 10.1021/jf200964u 21609131 12. Bergé J.-P. Bourgougnon N. Alban S. Pojer F. Billaudel S. Chermann J.-C. Robert J.M. Franz G. Antiviral and Anticoagulant Activities of a Water-Soluble Fraction of the Marine Diatom Haslea Ostrearia Planta Med. 1999 65 604 609 10.1055/s-1999-14032 10575374 13. Carbonnelle D. Pondaven P. Morancais M. Masse G. Bosch S. Jacquot C. Briand G. Robert J. Roussakis C. Antitumor and Antiproliferative Effects of an Aqueous Extract from the Marine Diatom Haslea Ostrearia (Simonsen) against Solid Tumors: Lung Carcinoma (NSCLC-N6), Kidney Carcinoma (E39) and Melanoma (M96) Cell Lines Anticancer Res. 1999 19 621 624 10226609 14. Gastineau R. Pouvreau J.-B. Hellio C. Morançais M. Fleurence J. Gaudin P. Bourgougnon N. Mouget J.-L. Biological Activities of Purified Marennine, the Blue Pigment Responsible for the Greening of Oysters J. Agric. Food Chem. 2012 60 3599 3605 10.1021/jf205004x 22423636 15. Avraamides C.J. Garmy-Susini B. Varner J.A. Integrins in Angiogenesis and Lymphangiogenesis Nat. Rev. Cancer 2008 8 604 617 10.1038/nrc2353 18497750 PMC2577722 16. Deryugina E.I. Quigley J.P. Pleiotropic Roles of Matrix Metalloproteinases in Tumor Angiogenesis: Contrasting, Overlapping and Compensatory Functions Biochim. Biophys. Acta 2010 1803 103 120 10.1016/j.bbamcr.2009.09.017 19800930 PMC2824055 17. Yoder M.C. Mead L.E. Prater D. Krier T.R. Mroueh K.N. Li F. Krasich R. Temm C.J. Prchal J.T. Ingram D.A. Redefining Endothelial Progenitor Cells via Clonal Analysis and Hematopoietic Stem/Progenitor Cell Principals Blood 2007 109 1801 1809 10.1182/blood-2006-08-043471 17053059 PMC1801067 18. Francezon N. Herbaut M. Bardeau J.-F. Cougnon C. Bélanger W. Tremblay R. Jacquette B. Dittmer J. Pouvreau J.-B. Mouget J.-L. Electrochromic Properties and Electrochemical Behavior of Marennine, a Bioactive Blue-Green Pigment Produced by the Marine Diatom Haslea Ostrearia Mar. Drugs 2021 19 231 10.3390/md19040231 33921595 PMC8073169 19. Méresse S. Gateau H. Tirnan T. Larrigaldie V. Casse N. Pasetto P. Mouget J.-L. Mortaud S. Fodil M. Haslea Ostrearia Pigment Marennine Affects Key Actors of Neuroinflammation and Decreases Cell Migration in Murine Neuroglial Cell Model Int. J. Mol. Sci. 2023 24 5388 10.3390/ijms24065388 36982463 PMC10049552 20. Schumacher M. Kelkel M. Dicato M. Diederich M. Gold from the Sea: Marine Compounds as Inhibitors of the Hallmarks of Cancer Biotechnol. Adv. 2011 29 531 547 10.1016/j.biotechadv.2011.02.002 21371549 21. Janani G. Girigoswami A. Deepika B. Udayakumar S. Mercy D.J. Girigoswami K. Dual Mechanism of Amphiroa Anceps: Antiangiogenic and Anticancer Effects in Skin Cancer Chem. Biodivers. 2025 22 e202500626 10.1002/cbdv.202500626 40106265 22. Choi B.-K. Jo M.-H. Shin H.J. Park S.J. Anti-Angiogenic Potential of Marine Streptomyces-Derived Lucknolide A on VEGF/VEGFR2 Signaling in Human Endothelial Cells Molecules 2025 30 987 10.3390/molecules30050987 40076212 PMC11901821 23. Ismail S.E. Hussein N.A. Rashad M.M. El-Sikaily A.M. Hassanin A.E.-L.A. El-Fakharany E.M. Sea Cucumber Sulfated Polysaccharides Extract Potentiates the Anticancer Effect of 5- Fluorouracil on Hepatocellular Carcinoma Cells Sci. Rep. 2025 15 20255 10.1038/s41598-025-06496-7 40550816 PMC12185687 24. Partida-Martínez L.P. Heil M. The Microbe-Free Plant: Fact or Artifact? Front. Plant Sci. 2011 2 100 10.3389/fpls.2011.00100 22639622 PMC3355587 25. Rayan A. Raiyn J. Falah M. Nature Is the Best Source of Anticancer Drugs: Indexing Natural Products for Their Anticancer Bioactivity PLoS ONE 2017 12 e0187925 10.1371/journal.pone.0187925 29121120 PMC5679595 26. Sugawara T. Matsubara K. Akagi R. Mori M. Hirata T. Antiangiogenic Activity of Brown Algae Fucoxanthin and Its Deacetylated Product, Fucoxanthinol J. Agric. Food Chem. 2006 54 9805 9810 10.1021/jf062204q 17177505 27. Kowshik J. Baba A.B. Giri H. Deepak Reddy G. Dixit M. Nagini S. Astaxanthin Inhibits JAK/STAT-3 Signaling to Abrogate Cell Proliferation, Invasion and Angiogenesis in a Hamster Model of Oral Cancer PLoS ONE 2014 9 e109114 10.1371/journal.pone.0109114 25296162 PMC4189964 28. Wang J. Ma Y. Yang J. Jin L. Gao Z. Xue L. Hou L. Sui L. Liu J. Zou X. Fucoxanthin Inhibits Tumour-Related Lymphangiogenesis and Growth of Breast Cancer J. Cell Mol. Med. 2019 23 2219 2229 10.1111/jcmm.14151 30648805 PMC6378177 29. Elmore S. Apoptosis: A Review of Programmed Cell Death Toxicol. Pathol. 2007 35 495 516 10.1080/01926230701320337 17562483 PMC2117903 30. Rokkaku T. Kimura R. Ishikawa C. Yasumoto T. Senba M. Kanaya F. Mori N. Anticancer Effects of Marine Carotenoids, Fucoxanthin and Its Deacetylated Product, Fucoxanthinol, on Osteosarcoma Int. J. Oncol. 2013 43 1176 1186 10.3892/ijo.2013.2019 23857515 31. Mouget J.-L. Gastineau R. Davidovich O. Gaudin P. Davidovich N.A. Light Is a Key Factor in Triggering Sexual Reproduction in the Pennate Diatom Haslea Ostrearia FEMS Microbiol. Ecol. 2009 69 194 201 10.1111/j.1574-6941.2009.00700.x 19486155 32. Zemani F. Benisvy D. Galy-Fauroux I. Lokajczyk A. Colliec-Jouault S. Uzan G. Fischer A.M. Boisson-Vidal C. Low-Molecular-Weight Fucoidan Enhances the Proangiogenic Phenotype of Endothelial Progenitor Cells Biochem. Pharmacol. 2005 70 1167 1175 10.1016/j.bcp.2005.07.014 16153611 33. Benslimane-Ahmim Z. Heymann D. Dizier B. Lokajczyk A. Brion R. Laurendeau I. Bièche I. Smadja D.M. Galy-Fauroux I. Colliec-Jouault S. Osteoprotegerin, a New Actor in Vasculogenesis, Stimulates Endothelial Colony-Forming Cells Properties J. Thromb. Haemost. 2011 9 834 843 10.1111/j.1538-7836.2011.04207.x 21255246 Figure 1 Cell adhesion of melanoma, lung cancer, and glioblastoma tumour cells is impaired in the presence of PEMn. ( A B p A n Figure 2 PEMn induces a reduction or arrest of tumour cell proliferation in a dose-dependent manner. ( A B p A n Figure 3 PEMn impairs ECFCs’ Proliferation and promotes senescence. ECFCs were cultured in EBM2 5% FBS culture medium supplemented with VEGF at 40 ng/mL in the presence or absence of different concentrations of PEMn (1, 10, 50 and 100 µg/mL), then counted ● after 24, 48, and 72 h of incubation. ( A B C D D t p p p Figure 4 PEMn reduces ECFCs’ viability in a reversible manner. Cells were cultured in ( A B t p p p p p Figure 5 PEMn inhibits ECFCs’ migration and disrupts capillary-like structure formation. ( A B C D E ® ® p p p p p Figure 6 PEMn induces a reduction or arrest of tumour cell proliferation in a dose-dependent manner. ( A B p A A n marinedrugs-23-00364-t001_Table 1 Table 1 Quantification of cell population distribution over the various stages of ECFCs’ cycle. PEMn in ECFCs (µg/mL) G0/G1 (%) S (%) G2/M (%) 24 h incubation 0 35.0 ± 6.2 22.1 ± 2.4 28.7 ± 6.7 100 59.2 ± 5.0 b 15.0 ± 3.1 14.3 ± 5.0 a 72 h incubation 0 46.4 ± 3.9 24.3 ± 4.3 20.0 ± 3.6 100 66.9 ± 2.1 c 17.3 ± 2.8 7.8 ± 1.1 a ECFCs were incubated in either EGM2 10% FBS or EGM2 10% FBS containing PEMn (100 µg/mL) for 24 and 72 h before harvesting. After washing and fixation in 70% ethanol on ice, ECFCs were treated with RNAse and stained with propidium iodide (PI). DNA content was analysed using a FACS flow cytometer. Data are expressed as the mean ± SD from 5 independent experiments. one-way ANOVA and Student’s t a p b p c p marinedrugs-23-00364-t002_Table 2 Table 2 Statistical analysis of the percentages of early apoptotic (Annexin V-stained cells, early apop) and late apoptosis (Annexin V + IP-stained cells, late apop) cells was expressed as a percentage of the total cell number. ECFCs Q4 Q3 Q2 Q1 24 h incubation Control 73.6 ± 3.3 12.1 ± 4.3 8.7 ± 1.0 5.7 ± 1.6 PEMn 100 µg/mL 53.4 ± 2.8 c 15.2 ± 2.2 19.9 ± 2.3 b 11.5 ± 2.6 72 h incubation Control 69.4 ± 5.1 10.3 ± 3.3 12.1 ± 2.6 8.4 ± 1.7 PEMn 100 µg/mL 44.1 ± 7.1 c 10.2 ± 1.3 27.8 ± 6.0 b 17.8 ± 2.0 Data are expressed as the mean ± SD from 5 independent experiments and analysed using one-way ANOVA and Student’s t b p c p marinedrugs-23-00364-t003_Table 3 Table 3 Effects of PEMn treatment (100 µg/mL) on VEGF-R1, IL-6 (C), IL-1β (D), and MMP-9 (E) levels in the ECFCs lysate after 24, 48, and 72 h of incubation.  24 h 48 h 72 h Variables EGM2 PEMn EGM2 PEMN p EGM2 PEMn p VEGF-R1 2.70 ± 0.26 1.31 ± 0.15 6.12 ± 0.06 2.20 ± 0.02 <0.001 6.04 ± 0.11 3.47 ± 0.48 <0.001 IL-6 47.00 ± 1.75 55.64 ± 4.53 86.68 ± 1.79 96.63 ± 2.34 0.8030 88.30 ± 1.04 453.04 ± 60.95 <0.001 IL-1β 0.04 ± 0.00 0.04 ± 0.00 0.05 ± 0.00 0.04 ± 0.00 0.9792 0.05 ± 0.00 1.47 ± 0.44 <0.001 MMP-9 0.17 ± 0.01 0.27 ± 0.1 0.27 ± 0.05 0.16 ± 0.01 0.9084 0.21 ± 0.01 6.3 ± 2.10 <0.001 Results are presented as mean ± standard deviation from triplicate measurements, p t ",
  "metadata": {
    "Title of this paper": "Osteoprotegerin, a New Actor in Vasculogenesis, Stimulates Endothelial Colony-Forming Cells Properties",
    "Journal it was published in:": "Marine Drugs",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471528/"
  }
}