{
  "title": "Paper_350",
  "abstract": "pmc Case Rep Infect Dis Case Rep Infect Dis 1772 crimid CRIID Case Reports in Infectious Diseases 2090-6625 2090-6633 Wiley PMC12483745 PMC12483745.1 12483745 12483745 41035614 10.1155/crdi/1328614 1 Case Report Successful Nonsurgical Management of Clostridium perfringens https://orcid.org/0000-0002-2148-6500 Oliveira Diogo Costa diooliveira@chtmad.min-saude.pt  1 https://orcid.org/0000-0002-9557-5469 Mendonça Inês  2 https://orcid.org/0009-0007-7881-0010 Vaz-Pinto Carolina  3 https://orcid.org/0009-0008-8369-842X Marques Cristina  3 https://orcid.org/0000-0003-1829-0635 Babo Alexandra  4 Elói Vasco  2  1  2  3  4 Academic Editor: Priya Gusain 2025 23 9 2025 2025 479923 1328614 6 11 2024 5 8 2025 30 8 2025 23 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Diogo Costa Oliveira et al. Case Reports in Infectious Diseases published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited.  Background: Clostridium perfringens  Case Presentation: C. perfringens  Management and Outcome:  Conclusion: C. perfringens Keywords case report Clostridium perfringens fulminant hemolysis liver abscess percutaneous drainage The authors have no funding to declare. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction  Clostridium perfringens 1 Bloodstream infections caused by this organism are uncommon, predominantly affecting individuals with cancer or immunocompromised states [ 2 1 3 Mortality in C. perfringens 4 C. perfringens 2. Case Presentation A woman in her 60s with a medical history of hypertension, dyslipidemia, and poorly controlled type 2 diabetes mellitus (glycated hemoglobin [HbA1C] of 7.7% 6 months prior to presentation) on four oral hypoglycemic agents presented at a district hospital emergency department with a one-day history of constant epigastric and right hypochondrial pain with dorsal irradiation. She reported no association of the pain with meals and had no similar prior episodes. Apart from the pain, she had no additional complaints, denying fever, nausea, vomiting, or diarrhea. Initial laboratory tests were only notable for elevated lipase levels (refer to Table 1 By the third day of admission, the patient's pain persisted, and she developed fever, moderate hypoxic respiratory insufficiency, and metabolic acidosis accompanied by hyperlactatemia (refer to Table 1 The peripheral blood smear showed frequent spherocytes, rare erythrocyte fragments, polychromasia, erythrocytes with basophilic stippling, and moderate erythrocyte agglutination. Considering the possibility of immune-mediated hemolytic anemia, an IV bolus of methylprednisolone (equivalent to 1 mg/kg of prednisolone) was administered. However, both direct and indirect Coombs tests, which were later performed, returned negative results. Despite an unremarkable abdominal ultrasound conducted the previous day, a subsequent abdominal CT scan revealed a 51 × 26 mm hepatic abscess with gas formation in the VIII segment (see Figure 1 A multidisciplinary team was gathered to discuss the case, including specialists from Intensive Care Medicine, Hematology and Immunohematology, Microbiology, and General Surgery. The central diagnostic consideration was nonimmune hemolytic anemia in the context of a pyogenic liver abscess with gas. A comprehensive literature review suggested that this presentation might indicate gas gangrene secondary to C. perfringens Figure 2 In the ICU, the patient required substantial vasopressor support (reaching a maximum noradrenaline dose of 0.6 mcg/kg/min) and began continuous renal replacement therapy (hemodiafiltration) within 6 hours of admission. She received a total of six units of red blood cells. Ongoing discussions with the general surgery team were held daily due to the potential need for surgical debridement. A conservative approach was chosen, supported by frequent imaging re-evaluations, as the patient showed clinical and laboratory improvements. On Day 11, the drain required repositioning, guided by an ultrasound. The patient's clinical course in the ICU showed favorable progress: hyperlactatemia was resolved by Day 3, vasopressor support was discontinued by Day 6, and she was successfully extubated on Day 9. Despite persistent anuria throughout her ICU stay, which necessitated ongoing renal support, she was able to transition from continuous to intermittent hemodialysis on Day 15. The patient was transferred from the ICU to the Infectious Diseases Department on Day 15 and discharged after 75 days in the hospital. She completed a 28-day course of antibiotherapy consisting of piperacillin–tazobactam infused at 18 g/day and clindamycin administered 900 mg every 8 h. An attempt to de-escalate to penicillin was made on Day 15 of antimicrobial treatment. Still, it was reversed back to piperacillin–tazobactam and clindamycin due to clinical deterioration, marked by increased prostration and elevated inflammatory markers. The pigtail catheter was removed on Day 38 of treatment. Magnetic resonance imaging on Day 56 of hospitalization revealed a reduction in the size of the liver abscess to 33 × 17 mm from the initial 37 × 17 mm observed in the earlier CT scan (see Figure 1 Three months after her discharge, the patient was seen in the outpatient clinic by the nephrology team, as well as by the infectious diseases and intensive care follow-up teams. At that time, she had returned home and made significant progress in her recovery. She had largely recovered from the acquired ICU weakness and was able to walk independently, relying only on a walking stick for support when standing. She was also no longer dependent on hemodialysis. However, she had not yet returned to work due to lingering physical limitations and mild cognitive impairment. Figure 3 3. Discussion Sepsis caused by C. perfringens 4 C. perfringens 5 Regarding treatment, the available literature strongly supports prompt surgical debridement for gas gangrene, with evidence indicating significantly improved survival when performed within 24 h of admission [ 6 Toxin production plays a central role in the high mortality of gas gangrene. Historically, gas gangrene antitoxin has been used in trauma-associated cases, but its efficacy is limited, and it has been linked to severe allergic reactions [ 4 C. perfringens 7 8 The patient also received comprehensive multiorgan life support, including continuous renal replacement therapy, which likely contributed to managing septic shock and acute kidney injury while potentially aiding in toxin clearance. Although the long-term survival benefits of such interventions remain debated, emerging sorbent hemadsorption devices show promise in removing proinflammatory cytokines and endotoxins [ 9 Following these early interventions—guided by high clinical suspicion based on the patient's history—along with intensive supportive care, the patient made a favorable recovery. In conclusion, this case highlights the importance of early clinical suspicion and prompt initiation of antibiotic therapy—potentially with antitoxin activity—in suspected C. perfringens Acknowledgments The authors would like to thank Dr. Mariana Pinto Sousa, Clinical Pathology, Unidade Local de Saúde Entre o Douro e Vouga, Portugal; Dr. Carla Gonçalves Ferreira, Clinical Pathology, Unidade Local de Saúde Médio Ave, Portugal; and Departments of Radiology and Infectious Diseases, Unidade Local de Saúde São João, Portugal. Data Availability Statement The authors have nothing to report. Ethics Statement The authors have nothing to report. Consent The authors have nothing to report. Disclosure All authors read and approved the final manuscript. Conflicts of Interest The authors declare no conflicts of interest. Author Contributions D.C.O. and I.M. wrote the main manuscript text and contributed equally as the first authors. C.V-P. and C.M. prepared Figures 2 3 1 Koubaissi S. A. Al Assaad R. G. Itani Z. Bouakl I. Black Urine and Methemoglobinemia in the Setting of Sepsis due to Clostridium perfringens Clinical Medicine Insights: Case Reports 2020 13 p. 1179547620981894 10.1177/1179547620981894 PMC7768566 33488133 2 Zhang P. Jiang N. Xu L. Shen Z. Liu X. Cai X.  Clostridium perfringens Escherichia coli American Journal of Case Reports 2022 23 p. e936329 10.12659/AJCR.936329 PMC9096897 35526110 3 Suzaki A. Hayakawa S. Clinical and Microbiological Features of Fulminant Haemolysis Caused by Clostridium perfringens Microorganisms 2023 11 4 p. 824 10.3390/microorganisms11040824 PMC10143116 37110247 4 Hifumi T. Spontaneous Non-Traumatic Clostridium perfringens Japanese Journal of Infectious Diseases 2020 73 3 177 180 10.7883/yoken.JJID.2019.382 31875607 5 Sarvari K. P. Vasas B. Kiss I. Fatal Clostridium perfringens Anaerobe 2016 40 31 34 10.1016/j.anaerobe.2016.03.011 2-s2.0-84966373256 27036998 6 Stevens D. L. Bryant A. E. Longo D. L. Necrotizing Soft-Tissue Infections New England Journal of Medicine 2017 377 23 2253 2265 10.1056/NEJMra1600673 2-s2.0-85038239247 29211672 7 Hara A. Minaga K. Otsuka Y. An Autopsy Case of Gas Gangrene, Massive Intravascular Hemolysis, and Cytokine Storm due to Clostridium perfringens Type A Infection IDCases 2024 38 p. e02085 10.1016/j.idcr.2024.e02085 PMC11492606 39435138 8 Smieja M. Current Indications for the Use of Clindamycin: A Critical Review The Canadian Journal of Infectious Diseases & Medical Microbiology 1998 9 1 22 28 10.1155/1998/538090 2-s2.0-0031938516 PMC3250868 22346533 9 Schädler D. Porzelius C. Jörres A. A Multicenter Randomized Controlled Study of an Extracorporeal Cytokine Hemoadsorption Device in Septic Patients Critical Care 2013 17 S2 p. P62 10.1186/cc12000 Figure 1 Imaging evolution of the hepatic abscess. (a) (Admission): abdominal computed tomography (CT) showing a VII segment hepatic abscess; (b) (3 days after admission): CT showing the hepatic abscess 54 × 30 mm with a pigtail drain; increment of the liquid component of the abscess; (c) (one-month after admission): CT showing decrease of the VII segment hepatic abscess (37 × 17 mm), pigtail drain inside; and (d) (9-month follow-up after discharge): magnetic resonance imaging T1 showing hepatomegaly with signs of steatosis; complete resolution of the abscess previously viewed in segment VII. Figure 2 Microbiology identification of Clostridium perfringens C. perfringens C. perfringens Figure 3 Chronological overview of the patient's clinical progression. Table 1 Laboratory results evolution in the first week of hospital admission.  Day 1 district hospital admission Day 3 Day 4 transfer to central hospital Day 5 ICU Day 7 ICU Reference values  Hemogram and coagulation laboratory study Hemoglobin (g/dL) 15.1 4.8 4.6 9.8 7.6 N: 12.0–16.0 Hematocrit (%) 45.0 43.4 32.5 26.7 21.5 N: 35–47 RDW (%) 12.4 12.5 15.1 19.0 16.1  RDW-SD (fL) 40.7 84.0 52 56.4 53.1  Reticulocytes  19.7     Platelets (μL) 192,000 141,000 117,000 87,000 55,000 N: > 150.000 Leucocytes (μL) 11,810 14,440 30,220 26,930 22,260 N: 4.000–11.000 Neutrophils (%) 93.6 92.3 82.3 Leucocytes (%) 2,10 3.8 8.1 Coombs       Direct  NEG     Indirect  NEG     Haptoglobin (mg/dL)    29 11 N: 50–320 Coagulation       aPTT (s) 20.2  50.9 45.3 38.3 N: 24.2–36.4 PT (s) 10.7  17.9 16.8 14.9 N: 10.2–13.5 Fibrinogen (mg/dL)   432 5511 321 N: 180–350 D-dimers   11.02      Biochemical laboratory study Renal       Creatinine (mg/dL) 0.77 1.64 2.12 3.07 1.82 N: 0.51–0.95 Urea (mg/dL) 45 99 118 176 75 N: 10–50 Hepatic       AST (U/L) 235 810 1159 4966 3950 N: 10–31 ALT (U/L) 137 357 359 1777 1569 N: 10–31 g-GT (U/L) 289 228 101 98 69 N: 7–32 ALP (U/L) 109 87 78 85 169 N: 30–120 Total BT (mg/dL) 0.67 10.79 14.21 14.2 15.66 N: < .20 Direct BT (mg/dL) 0.36 1.34  6.89 8.58 N: < 0.40 LDH (U/L) 368 217 1270 12,091  N: 135–225 Lipase (U/L) 880 250  1270   Cytolysis       Myoglobin (ng/mL) 513 3159 6364 N: < 146 CK (U/L) 439 1133 8548 N: 10–149 C-reactive protein (mg/L) 2 27 295 616 456 N: < 3.0 Procalcitonin (ng/mL)     14.7 N: < 0.05   Blood-gas analysis pH 7.41 7.41 7.26 7.36 7.46 N: 7.35–7.45 HCO 3 19.6 18.4 15.4 19.3 26.9 N: 22–26 Anion gap (mmol/L)    17.3 3.3  Art. lactate (mmol/L) 0.9 6.9 13.9 9.01 2.25 N: < 2   Other relevant results Viral serology   HIV, HCV, HBV, CMV: negative   Anemia study   Fe: 174 mcg/dL; ferritin: 14,013 ng/mL. Folic acid: 7.4 ng/mL. Vitamin B12: 849 pg/mL. Schistocytes: negative. No platelet clumping   Metabolic and glycemic parameters   Total cholesterol: 244 mg/dL   ",
  "metadata": {
    "Title of this paper": "A Multicenter Randomized Controlled Study of an Extracorporeal Cytokine Hemoadsorption Device in Septic Patients",
    "Journal it was published in:": "Case Reports in Infectious Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483745/"
  }
}