{
  "title": "Paper_427",
  "abstract": "pmc Open Forum Infect Dis Open Forum Infect Dis 2604 ofid ofid Open Forum Infectious Diseases 2328-8957 Oxford University Press PMC12481155 PMC12481155.1 12481155 12481155 41035535 10.1093/ofid/ofaf588 ofaf588 1 Infectious Diseases in Special Populations Brief Report AcademicSubjects/MED00290 Evaluating the Efficacy of Crushed Bictegravir/Emtricitabine/Tenofovir Alafenamide Administered via Tube https://orcid.org/0009-0007-4833-3073 Mercure Joshua  Department of Pharmacy, Massachusetts General Hospital Boston, Massachusetts 02114 USA https://orcid.org/0009-0009-3220-9785 Bey Kayla  Department of Pharmacy, Massachusetts General Hospital Boston, Massachusetts 02114 USA https://orcid.org/0000-0001-9528-8526 Gillett Eric  Department of Pharmacy, Brigham and Women's Hospital Boston, Massachusetts 02115 USA https://orcid.org/0000-0002-5276-1050 Pearson Jeffrey C  Department of Pharmacy, Brigham and Women's Hospital Boston, Massachusetts 02115 USA McCluskey Suzanne M  Division of Infectious Diseases, Massachusetts General Hospital Boston, Massachusetts USA https://orcid.org/0000-0002-2067-4673 Rock Alex E  Department of Pharmacy, Massachusetts General Hospital Boston, Massachusetts 02114 USA Correspondence: Alex E. Rock, PharmD, AAHIVP, BCPS, BCIDP, Department of Pharmacy, Massachusetts General Hospital, 55 Fruit Street, Boston, MA 02114 ( aerock@mgh.harvard.edu jcpearson@bwh.harvard.edu   Potential conflicts of interest. 10 2025 24 9 2025 12 10 497765 ofaf588 27 6 2025 11 9 2025 30 9 2025 24 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of Infectious Diseases Society of America. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Human immunodeficiency virus (HIV) viral suppression was evaluated after receipt of crushed or dissolved bictegravir/emtricitabine/tenofovir alafenamide (B/F/TAF) administered via enteral tube during hospitalization. Eighty-nine percent of patients (17/19) were virally suppressed (<200 copies/mL) within 1 year of receiving B/F/TAF via tube, suggesting that administration via tube is a reasonable alternative to changing antiretroviral regimens. bictegravir crushed enteral administration HIV integrase inhibitors pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Bictegravir/emtricitabine/tenofovir alafenamide (B/F/TAF) is a widely prescribed, once-daily, single-tablet regimen (STR) approved for the treatment of HIV infection [ 1 2 3 Oral ingestion may be impractical in these scenarios, and considering the risk of developing resistance when disrupting antiretroviral therapy (ART) [ 4 5 6 7 The SOLUBIC trial was a phase I, open-label, randomized crossover study that analyzed the bioequivalence of B/F/TAF when administered whole, dissolved in water, or crushed in apple compote [ 8 max 9–11 Further investigation is needed to evaluate the efficacy of alternative administration methods of B/F/TAF. Understanding the ability of this regimen to maintain viral suppression and prevent the development of resistance when given through alternative routes is essential for providing care in inpatient settings where oral administration is not feasible. This study aimed to assess virologic outcomes among hospitalized patients receiving crushed or dissolved B/F/TAF through enteral feeding tubes, providing clinical data for medication administration in this population. METHODS This retrospective cohort study utilized electronic health record data from Massachusetts General Hospital and Brigham and Women's Hospital from February 2018 to December 2023. Individuals were considered for inclusion if their medication administration record data included B/F/TAF and had order routes listed as nasogastric, gastrostomy, orogastric, or jejunostomy tube during hospitalization. To better attribute sustained viral suppression to prolonged maintenance with a crushed or dissolved regimen, people with HIV (PWH) who received less than seven consecutive days of crushed or dissolved B/F/TAF or did not have HIV viral load (VL) data available within 12 months of crushed or dissolved B/F/TAF were excluded. The primary endpoint was viral suppression, either new or sustained, during the designated 12-month follow-up period. Viral suppression was defined as an HIV RNA of < 200 copies/mL. Secondary endpoints included emergent HIV drug resistance and changes in ART regimens. Patient characteristics and outcomes were analyzed using descriptive statistics, with continuous variables reported as medians with interquartile ranges (IQR) and categorical data reported as frequencies. All analyses were conducted using Microsoft Excel. The study protocol was approved by the Mass General Brigham Institutional Review Board. RESULTS A total of 54 PWH were identified as having received crushed or dissolved B/F/TAF through an enteral tube during an inpatient hospitalization. Twenty-two PWH were excluded for receiving fewer than seven consecutive days of B/F/TAF, and 13 PWH were excluded for a lack of available HIV VL data within the 12-month follow-up period. A total of 19 patients were included in the final analysis. The median age was 54 years [IQR 47.5–66.5], and 16 patients (84%) were male. Included individuals received B/F/TAF through an enteral tube for a median of 19 days [IQR 7.5–64]. Intubation was the primary reason documented as the need for administration through a tube in 14 patients (74%). Two individuals were documented as receiving dissolved B/F/TAF, and eight patients were documented as receiving the medication crushed. The method of administration for the remaining nine patients in the cohort was not described ( Table 1 Table 1. Patient Characteristics Characteristic Total Cohort ( N Age, years, median [IQR] 54 [47.5–66.5] Male 16 (84) Virally suppressed or undetectable prior to start 11 (58) Resistance prior to crushed/dissolved B/F/TAF 8 (42) INSTI 0 (0) NRTI 5 (26) NNRTI 4 (21) PI 4 (21) Development of resistance within 1 year 0 (0) Duration of crushed/dissolved B/F/TAF, days, median [IQR] 19 [7.5–64] Intensive care unit admission during hospitalization 16 (84) Intubation as the reason for enteral tube 14 (74) Crushed B/F/TAF for administration 8 (42) Dissolved B/F/TAF for administration 2 (11) Individuals with at least 1 missed dose 6 (32) ART change during admission 2 (11) Crushed/dissolved B/F/TAF continued after discharge 3 (16) All data presented as n Abbreviations: B/F/TAF, bictegravir/emtricitabine/tenofovir alafenamide; INSTI, integrase strand transfer inhibitor; IQR, interquartile range; NNRTI, non-nucleoside reverse transcriptase inhibitor; NRTI, nucleoside reverse transcriptase inhibitor; PI, protease inhibitor. During the follow-up period, 17 patients (89%) achieved or maintained viral suppression. Among the eight patients with detectable viremia at hospital admission, six achieved undetectable VLs within the follow-up period. The two individuals who remained detectable after crushed or dissolved B/F/TAF administration still exhibited significant virologic response, as demonstrated by marked reductions in documented VLs, with a 2.8 and 3.3 log reduction, respectively ( Figure 1 Figure 1. HIV Viral Load Testing within 1 year of Crushed B/F/TAF. HIV VL testing during a 12-month follow-up for 19 individuals that received a minimum 7 consecutive days of crushed or dissolved bictegravir/emtricitabine/tenofovir alafenamide (B/F/TAF) through an enteral tube. The VL suppression threshold is represented at 200 copies/mL with a solid black line. Orange lines indicate individuals who were viremic at their last recorded lab value, blue lines indicate individuals who were virally suppressed at their last recorded lab value. The modality of administration is indicated by line type, with dissolved, crushed, and unknown represented by solid, dashed, and dotted lines, respectively. Two patients underwent changes to their ART regimen during hospitalization. One patient was switched from B/F/TAF to limit drug-drug interactions with the initiation of empiric rifampin for tuberculosis treatment, and the other patient was switched to optimize their regimen in the setting of central nervous system escape and ongoing concerns for drug-drug interactions. Three patients continued administration of crushed or dissolved B/F/TAF after being discharged. Eight patients had documented resistance prior to the initiation of crushed B/F/TAF; no emergent resistance was identified in the cohort after 1 year based on available information in medical records. There were eight deaths in the analyzed cohort, six of whom were admitted to critical care units during their admission. The leading cause of death was non-HIV-associated infection ( n DISCUSSION This study demonstrates that individuals who are unable to take medications by mouth and receive B/F/TAF when administered through an enteral tube in either a crushed or dissolved formulation can effectively achieve or maintain viral suppression. In our cohort, 89% of patients were virally suppressed during follow-up. All individuals who were viremic at the initiation of the crushed or dissolved formulation demonstrated significant reductions in their VL during the study, including the two individuals who remained viremic during the follow-up period. These results suggest that crushed or dissolved B/F/TAF presents an effective alternative when oral administration may not be practicable. This is particularly relevant for hospitalized individuals who may otherwise encounter an interruption in ART therapy or be forced to switch regimens. Existing literature on the use of crushed or dissolved B/F/TAF, comprised largely of case reports, has also shown generally positive clinical outcomes with the maintenance of viral suppression using both crushed and dissolved administration of B/F/TAF [ 9–11 7 12 8 One case report does note an increase in VL for an individual receiving crushed B/F/TAF through a percutaneous endoscopic gastrostomy tube [ 13 14 This study represents the largest available cohort in this patient population to date. The findings may have important implications for clinical practice. Administering B/F/TAF through a tube offers a practical and effective solution for maintaining viral suppression during periods when oral ART may not be feasible. Given that discontinuation or changes to suboptimal ART regimens can lead to virologic failure and resistance development, having a reliable method for continuing treatment with B/F/TAF could prevent these complications. Our study has limitations. Specifically, the study used existing data from a single health system. The retrospective nature of the study design limits the ability to draw definitive conclusions without the ability to control for unmeasured confounders or undocumented information. Certain aspects may not be reflected in the data, such as adherence to regimens while outpatient and the full extent of comorbidities. Therapeutic drug monitoring was not performed in the study, so we cannot speak to the precise bioavailability and pharmacokinetics of crushed or dissolved B/F/TAF. If tablets cannot be swallowed whole, B/F/TAF should ideally be given dissolved based on favorable bioequivalence data [ 8 Future studies can aim to validate these findings in a larger, prospective manner to assess the long-term safety and efficacy of crushed or dissolved B/F/TAF. Therapeutic drug monitoring would allow for further insight into the pharmacokinetics of this approach. In conclusion, the administration of B/F/TAF when given via tube led to the achievement or maintenance of viral suppression in the majority of the study population. The absence of emergent resistance and virologic failure following administration of B/F/TAF through an enteral tube in the inpatient setting is reassuring and suggests that providing B/F/TAF via tube is a reasonable alternative to changing or stopping ART altogether. Notes   Acknowledgments.   Patient consent statement.   Financial support. References 1 Gandhi RT Bedimo R Hoy JF et al Antiretroviral drugs for treatment and prevention of HIV infection in adults: 2022 recommendations of the international antiviral society–USA panel JAMA 2023 329 63 84 36454551 10.1001/jama.2022.22246 2 Zhao AV Crutchley RD Guduru RC Ton K Lam T Min AC A clinical review of HIV integrase strand transfer inhibitors (INSTIs) for the prevention and treatment of HIV-1 infection Retrovirology 2022 19 22 36273165 10.1186/s12977-022-00608-1 PMC9588231 3 Perri GD Bonora S Clinical pharmacology of the single tablet regimen bictegravir/emtricitabine/tenofovir alafenamide in the evolving era of antiretroviral therapies Infez Med 2019 27 365 73 4 Nyberg CR Patterson BY Williams MM When patients cannot take pills: antiretroviral drug formulations for managing adult HIV infection Top Antivir Med 2016 19 126 31 PMC6148859 21946391 5 Kuritzkes DR Drug resistance in HIV-1 Curr Opin Virol 2011 1 582 9 22162985 10.1016/j.coviro.2011.10.020 PMC3232467 6 Chastain DB Tu PJ Brizzi M et al Managing modern antiretroviral therapy in the intensive care unit: overcoming challenges for critically ill people with human immunodeficiency virus Open Forum Infect Dis 2024 11 ofae213 38715574 10.1093/ofid/ofae213 PMC11075789 7 LoFaso M Marchionda O Bass S Torbic H Blackewicz C Pallotta A Evaluation of dolutegravir- and bictegravir-based antiretroviral regimen utilization in patients who cannot take medications by mouth Open Forum Infect Dis 2023 10 ofad554 38088984 10.1093/ofid/ofad554 PMC10712287 8 Hocqueloux L Lefeuvre S Bois J et al Bioavailability of dissolved and crushed single tablets of bictegravir, emtricitabine, tenofovir alafenamide in healthy adults: the SOLUBIC randomized crossover study J Antimicrob Chemother 2023 78 161 8 10.1093/jac/dkac369 PMC9780524 36322475 9 Ferrández JSR García AL Alonso-Vega GG González AO García TM Successful bictegravir/emtricitabine/tenofovir alafenamide treatment in a HIV patient with swallowing difficulties Ann Pharmacother 2021 55 556 7 32862660 10.1177/1060028020953631 10 Roa PAE Bazzi R Crushed bictegravir/emtricitabine/tenofovir alafenamide in a human immunodeficiency virus-positive patient with pancreatic cancer Int J STD AIDS 2022 33 97 8 34787026 10.1177/09564624211048702 11 Fulco PP Crushed bictegravir/emtricitabine/tenofovir alafenamide in a human immunodeficiency virus–positive patient with esophageal cancer Am J Health Syst Pharm 2020 77 509 10 32207818 10.1093/ajhp/zxaa017 12 Ragonnet G Laroche H Néant N et al Enteral administration of crushed rilpivirine in a patient with HIV: a case report Brit J Clinical Pharma. 2024 10.1111/bcp.15994 38163749 13 Rowe SM Clary JC Drummond M Derrick C Sanasi K Bookstaver PB Increased viral load in a hospitalized patient on treatment with crushed bictegravir/emtricitabine/tenofovir alafenamide: a case report and review of the literature Am J Health Syst Pharm 2022 79 1330 6 35511892 10.1093/ajhp/zxac120 14 Lozano AB Chueca N de Salazar A et al Failure to bictegravir and development of resistance mutations in an antiretroviral-experienced patient Antiviral Res 2020 179 104717 31982483 10.1016/j.antiviral.2020.104717 ",
  "metadata": {
    "Title of this paper": "Failure to bictegravir and development of resistance mutations in an antiretroviral-experienced patient",
    "Journal it was published in:": "Open Forum Infectious Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481155/"
  }
}