{
  "title": "Paper_464",
  "abstract": "pmc Front Cell Infect Microbiol Front Cell Infect Microbiol 1860 fcimb Front. Cell. Infect. Microbiol. Frontiers in Cellular and Infection Microbiology 2235-2988 Frontiers Media SA PMC12479512 PMC12479512.1 12479512 12479512 41036228 10.3389/fcimb.2025.1659042 1 Cellular and Infection Microbiology Original Research Exploring the influence of psychological factors on the comorbidity of dental caries and obesity in adolescents from the perspective of the oral-gut-brain axis Wang Meng  1  2  † Yang Xiaopeng  3  † Li Yimin  1  2  3 Jiang Mingxin  1  2  3 Chen Bairu  1  2  3 Yang Wei  1  2  3 Ma Nan  2  3  4 He Shili  1  2  3 Wang Chengyue  1  2  3  *  1 Department of Prosthetics, Affiliated Stomatology Hospital of Jinzhou Medical University Jinzhou China  2 Collaborative Innovation Center for Health Promotion of Children and Adolescents of Jinzhou Medical University Jinzhou China  3 Department of Pedodontics, Affiliated Stomatology Hospital of Jinzhou Medical University Jinzhou China  4 School and Hospital of Stomatology, China Medical University Shenyang China Edited by: Soumyadev Sarkar Reviewed by: Maurice H. T. Ling, University of Newcastle, Singapore Emiliana D’Angelo, Università della Campania Luigi Vanvitelli, Italy *Correspondence: Chengyue Wang, wangcy@jzmu.edu.cn †These authors share first authorship 16 9 2025 2025 15 481321 1659042 03 7 2025 19 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Wang, Yang, Li, Jiang, Chen, Yang, Ma, He and Wang. 2025 Wang, Yang, Li, Jiang, Chen, Yang, Ma, He and Wang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction This study investigates how psychological factors influence the comorbidity of dental caries and obesity in adolescents through the oral-gut-brain axis. Adolescence is a critical period for both physical and psychological development, yet dental caries and obesity are prevalent issues that can negatively impact mental health. The study aims to provide insights into the underlying mechanisms and potential prevention and treatment strategies. Methods An epidemiological survey was conducted on 1,024 students aged 12–15 from Beizhen No. 1 Junior High School. A total of 90 adolescents were selected for biosample research. The methods used included 16S rRNA gene sequencing, untargeted metabolomics, and SourceTracker analysis to examine oral and gut microbiota and metabolite concentrations. Results Significant differences in oral and gut microbiota and metabolite concentrations were found among adolescents with different health statuses. Adolescents with caries and obesity showed distinct microbial profiles compared to healthy controls. The study also identified potential oral and gut microbial biomarkers associated with psychological disorders. SourceTracker analysis revealed a higher rate of ectopic colonization of oral microbiota in the intestines of adolescents with caries and obesity. Discussion The study highlights the roles of the oral-gut and oral-brain axes in the comorbidity of dental caries and obesity among adolescents. The findings suggest that oral and gut microbiota play crucial roles in disease progression, and their imbalances may affect mental health through the oral-gut-brain axis. The results provide a theoretical foundation for developing integrated intervention strategies targeting both oral and systemic health. oral-gut-brain axis caries obesity adolescents microbiota Department of Education of Liaoning Province 10.13039/501100007620 The author(s) declare financial support was received for the research and/or publication of this article. This work was financially supported by Science and technology innovation team of Liaoning Education Department (LJ222410160037). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Oral Microbes and Host 1 Introduction Adolescence represents a critical developmental window for both physical and psychological maturation; yet the concurrent “dual epidemic” of dental caries and obesity now threatens the health of this generation. The World Health Organization (WHO) 2022 report documents a 50–70% prevalence of permanent-tooth caries among 12- to 15-year-olds ( Lobstein et al., 2015 Dental caries, obesity, and psychological disorders do not occur in isolation; rather, they constitute a “networked disease complex” that reciprocally amplifies risk. Poor oral health undermines self-esteem and self-confidence, thereby precipitating anxiety and depression ( Kisely et al., 2015 Kisely et al., 2016 Folayan et al., 2018 Folayan et al., 2018 Milaneschi et al., 2019 Chala et al., 2017 Over the past five years, three converging “sub-axes” have provided the most recent empirical foundation for an integrated “oral–gut–brain axis.”Oral–gut axis: A systematic review by Yamazaki et al. demonstrated that periodontal pathogens—most notably Porphyromonas gingivalis—can be continuously swallowed with saliva, breach the intestinal barrier, and trigger local dysbiosis and systemic inflammation, thereby establishing the first direct mechanistic link between periodontitis and gut microbial imbalance ( Yamazaki, 2023 Bowland and Weyrich, 2022 Dominy et al., 2019 Duan and Wu, 2024 Zhang et al., 2023 In summary, dental caries, obesity, and psychological disorders manifest as a syndemic among adolescents, and the emerging concept of the oral–gut–brain axis offers a unifying theoretical framework for elucidating their shared mechanistic underpinnings and for developing integrated intervention strategies (  Figure 1 Figure 1 This figure illustrates the intricate interactions among the oral, gut, and brain axes and their effects on health. Oral microbiota directly associate with brain function through the oral-brain axis, potentially influencing the onset of neuropsychiatric disorders such as depression. Concurrently, oral microbes impact the gut microbiome via the oral-gut axis, subsequently modulating brain function and behavior through the gut-brain axis. Imbalances in oral microbiota (e.g., caries) and gut microbiota (e.g., changes associated with obesity) may affect the levels of neurotransmitters through these axes, thereby playing a role in the development of diseases like depression. This model underscores the dynamic connections among the oral, gut, and brain, highlighting their significance in overall health. Diagram showing the connections between oral, gut, and brain axes. Bacteria types such as Streptococcus and Veillonella are linked to oral health and caries. Gut bacteria like Phocaeicola and Bacteroides impact obesity. The oral-brain axis is associated with depression, involving neurotransmitters like serotonin. 2 Materials and methods 2.1 Survey subjects In September 2024, an epidemiological survey was conducted on 1024 students from the First Junior High School in Beizhen City, Jinzhou City. After questionnaire surveys, physical parameter measurements, and oral examinations, a total of 90 adolescents aged 12–15 were included in the biological sample study. 2.1.1 Sampling strategy and sample size calculation This study employed a cross-sectional design with stratified cluster sampling. Fieldwork was conducted in the Beizhen district of Jinzhou City in September 2024. After selecting one fixed-point junior high school, we first stratified students by grade and then randomly selected intact classes within each stratum as primary sampling units. Sample size was calculated according to the standard formula for cross-sectional surveys, N=K × Q/P 2.1.2 Inclusion criteria for biological sample subjects All subjects had not taken antibiotics within 1 month before the examination, had no systemic diseases, no congenital diseases or other diseases (oral mucosal diseases), and did not wear orthodontic appliances in the mouth. This study was approved by the Ethics Committee (Approval Number: JYFELL202409). The children examined obtained the permission of their parents or guardians and signed the informed consent form. A total of 90 participants were enrolled for biological sample collection in this study. The inclusion method is presented in the following  Table 1 Table 1 Biological sample collection criteria. Stage Procedure Excluded (n) Remaining (n) Notes Total Population Students aged 12-15 from Beizhen No. 1 Middle School 1,024 Initial survey population Stage 1: Screening Excluded: antibiotic/probiotic use (within 1 month), systemic diseases, orthodontic appliances, etc. 187 837 Key exclusion criteria detailed in Section 2.1.2 Stage 2: Stratification Grouped by health status (criteria in Section 2.4): – • HG – 180 No caries, obesity, or psychological disorders – • COG – 125 Diagnosed with both caries and obesity – • PDG – 17 No caries/obesity; diagnosed with psychological disorders – • COPG – 44 Diagnosed with caries, obesity, and psychological disorders Stage 3: Sampling Each group was randomly selected – – • The initial plan was 23 cases per group Adjusted due to insufficient PDG sample size and depth issues – • Supplement to 30 cases per group Random number table method – • Remove low quality samples (e.g. DNA extraction failure) Final: 30 per group via random number table 2.2 Research methods 2.2.1 Questionnaire survey The demographic characteristics of the survey subjects, including the educational level of the parents of the survey subjects, the frequency of tooth brushing, the frequency of sweets and beverages, were collected through one-on-one questionnaire surveys. The International General Health Questionnaire-12 (GHQ-12) was used to assess the mental health status of students. 2.2.2 Physical parameter measurement Trained medical examiners measured the height, weight, and waist circumference. The height was measured using a metal column height meter, the weight was measured using an electronic weighing scale, and the waist circumference was measured using a non-elastic soft ruler with a minimum scale of 1 mm. The weight was accurate to 0.01 kg, and the height and waist circumference were accurate to 0.1 cm. They were recorded separately, and the body mass index of each survey subject was calculated. 2.2.3 Dental caries examination Using the methods and standards published by the World Health Organization, professional dentists used disposable oral instruments under a unified artificial light source, used probes and flat mirrors, and used a combination of visual and probing methods to examine and evaluate the dental health status of the survey subjects. A special recorder checked and recorded the caries, loss, and filling of each tooth. 2.3 Diagnostic criteria 2.3.1 Psychological disorder The GHQ-12 questionnaire consisted of 12 questions, using the Likert 4-point scoring method, with options ranging from 1 point “never” to 4 points “often”. The score ranged from 12 to 48, and the higher the score, the lower the mental health level. A total score > 27 indicated poor mental health. 2.3.2 Dental caries (1) Caries-free: No signs of caries and no fillings due to caries. (2) Dental Caries: The pits or smooth surfaces of the teeth have softening at the bottom, potential damage to the enamel, or softening of the walls, which are divided into pit and fissure caries and smooth surface caries. (3) Filled with Caries: Teeth with permanent fillings and one or more new caries. (4) Filled without Caries: Teeth with one or more permanent fillings and no other caries. (5) Missing due to Caries: Teeth lost or extracted due to caries. 2.3.3 Obesity (1) BMI(Body Mass Index): According to the Comprehensive Evaluation of the Development Level of Children and Adolescents (GB/T 31178-2014) standard ( Comprehensive evaluation of children and adolescents development, n.d. (2) Waist Circumference: According to the Screening Threshold for High Waist Circumference in Children and Adolescents aged 7–18 Years (WS/T 611-2018) ( 20180704145130574.pdf 2.4 Biological sample collection All samples were divided into four groups, with 10 samples taken from each group Healthy Group (HG) Caries and Obesity Group (COG) Psychological Disorders Group (PDG) Caries, Obesity and Psychological Disorders Group (COPG) 2.5 Statistical methods IBM SPSS Statistics 26.0 statistical software was used for data processing and analysis. Quantitative data that conformed to a normal distribution were described using (x¯ ± s), and the t-test was used for comparison between two groups, and analysis of variance was used for comparison between multiple groups. Qualitative data were described using the number of cases (%). The significance level α was set to 0.05 unless otherwise specified. A one-way analysis of variance (ANOVA) was performed for each demographic variable (age, sex, BMI, etc.).  Table 2 Table 2 The aforementioned demographic variables—age, sex, BMI, and psychological status—will be included as covariates in subsequent microbiota analyses to control for their potential confounding effects on community structure. Analysis of variance results Variable Psychological total score evaluation (Average ± standard deviation) Psychology ( n Normal ( n  F  p Caries 0.74 ± 0.44 0.60 ± 0.49 13.773 0.000** BMI 22.15 ± 5.19 21.68 ± 5.14 1.324 0.250 Age 13.49 ± 0.95 13.68 ± 0.97 6.815 0.009** gender 1.51 ± 0.50 1.53 ± 0.50 0.267 0.605 Caries and obesity are common 1.52 ± 0.96 1.19 ± 1.02 17.665 0.000** *p<0.05, **p<0.01. 3 Results 3.1 Basic characteristics A total of 1,024 students were enrolled, comprising 483 (47.17%) males and 541 (52.83%) females. The majority were of Manchu ethnicity (n=813, 79.47%), followed by Han (n=197, 19.26%), Mongolian (n=8, 0.78%), and other ethnicities (n=5, 0.49%). Age distribution peaked at 13–14 years, accounting for 33.01% and 34.96%, respectively, with fewer participants in other age brackets. The overall caries detection rate was 62.50% (n=640). Regarding body-mass index (BMI), 499 participants (48.73%) were classified as having normal weight, 292 (28.52%) as obese, 83 (8.11%) as overweight, and 150 (14.65%) as underweight. Psychological assessment revealed that 819 individuals (79.98%) exhibited normal mental health status, whereas 205 (20.02%) presented with psychological or behavioral disorders (  Table 3 Table 3 The aforementioned demographic variables—age, sex, BMI, and psychological status—will be included as covariates in subsequent microbiota analyses to control for their potential confounding effects on community structure. Essential information Classify Number (n) Percentage (%) Han nationality 197 19.26 Man nationality 813 79.47 Nation Mongolian nationality 8 0.78 Other nationality 5 0.49 Gender Male 483 47.17 Female 541 52.83 11 1 0.10 12 122 11.91 13 338 33.01 Age 14 358 34.96 15 188 18.36 16 17 1.66 No 384 37.50 Caries Yes 640 62.50 marasmus 150 14.65 Normal 499 48.73 BMI Overweight 83 8.11 Obesity 292 28.52 evaluation Psychology 205 20.02 Psychological Normal 819 79.98 Total 1024 100.0 3.2 Demographic characteristics of participants providing biological samples Of the 1,024 adolescents aged 12–15 years initially surveyed, four groups were established for biological sampling: the Healthy Group (HG, n=180), the Caries-Obesity Group (COG, n=125), the Psychological Disorders Group (PDG, n=17), and the Comorbid Caries-Obesity-Psychological Disorders Group (COPG, n=44). Mean age ranged from 13.30 to 14.59 years across the groups. BMI analyses revealed that the COG (29.11 kg/m²) and COPG (28.37 kg/m²) exhibited significantly higher values than the HG (19.45 kg/m²) and PDG (19.84 kg/m²), underscoring the co-occurrence of obesity and dental caries. Psychological assessment via the GHQ-12 (higher scores indicate poorer mental health) showed that the PDG (29.53) and COPG (28.95) displayed comparable and markedly elevated scores relative to the HG (17.73) and COG (18.60), thereby validating the diagnostic criteria used to define psychological morbidity in the grouping protocol (  Table 4 Table 4 Comparison of average age, BMI, psychological scores, and gender ratios across four groups: Healthy (HG), Caries-Obesity (COG), Psychological Disorders (PDG), and Comorbid Caries-Obesity-Psychological Disorders (COPG). Group Number (n) average age BMI average value Psychological average score Gender ratio is male to female HG 180 14.33 19.45 17.73 81/99 COG 125 13.58 29.11 18.6 78/47 PDG 17 14.59 19.84 29.53 9/8 COPG 44 13.30 28.37 28.95 25/19 3.3 Sequencing information All microbiota analyses were adjusted for age, sex, BMI, and psychological score to ensure that observed microbial differences are attributable to disease status rather than demographic characteristics. 90 samples were divided into three groups, all samples were sequenced by Illumina platform, the results are as follows: Saliva: Among them, all samples in HG, COG and COPG group contained 68543 ASVs (Amplicon Sequence Variant): 354 ASVs in HG and COG group; 192 ASVs in HG and COPG group; 210 ASVs in COG and COPG group; ASVs 2982 unique to HG group; ASVs 5407 unique to COG group; and ASVs 2371 unique to COPG group (  Figure 2A Feces: All samples in HG, COG and COPG group contained 49126 ASVs: 116 ASVs in HG and COG group; 88 ASVs in HG and COPG group; 161 ASVs in COG and COPG group; ASVs 1753 unique to HG group; ASVs 2926 unique to COG group; ASVs 2372 unique to COPG group (  Figure 2B Figure 2  (A, B) Two Venn diagrams comparing gene expressions. The left diagram shows overlaps among COPG, COG, and HG, with numbers indicating specific gene counts: COPG (2371), COG (5407), HG (2982), and overlaps like 785 between all three. The right diagram displays similar overlaps among COG, COPG, and HG, with counts: COG (2926), COPG (2372), HG (1753), and 373 in the center overlap. 3.4 Relative abundance of species at the phylum level 3.4.1 Saliva The top five most abundant phyla in the saliva were selected, namely Firmicutes, Proteobacteria, Bacteroidota, and Actinobacteriota (  Figure 3A Figure 3  (A, B) Stacked bar charts show the relative abundance of various bacterial groups across three samples: HG, COD, and COPD. Each color represents a different bacterial group, indicated in the legend. 3.4.2 Feces The top five most abundant phyla in fecal samples were selected, namely Bacteroidota, Firmicutes, Actinobacteriota, and Proteobacteria, and a bar chart of their relative abundance was generated (  Figure 3B 3.5 Relative abundance of species at the genus level 3.5.1 Saliva The most abundant genera were selected based on their relative abundance, and a bar chart of their abundance was generated (  Figure 4A Figure 4  (A, B) Two stacked bar charts display the relative abundance of various bacterial genera across samples labeled HC, COD, and COPG. The colors represent different genera, such as Streptococcus and Neisseria. The y-axis indicates relative abundance in percentage, and the second chart includes additional genera like Propionibacterium and Pseudomonas. 3.5.2 Feces The most abundant genera in fecal samples were selected based on their relative abundance, and a bar chart of their abundance was generated (  Figure 4B 3.6 α-diversity analysis α-diversity is an analysis of microbial diversity in community ecology, reflecting the distribution and differences of microbial communities ( Miller et al., 2016 Oral microbiota α-diversity analysis (  Figure 5A Figure 5  (A–D) Box plots comparing different metrics across three groups: HG (red), CDG (blue), and CDPG (green). Metrics include Chao1, Good's coverage, Simpson, Pielou_e, Faith_pd, Shannon, and Observed_species with corresponding p-values above each plot. Gut microbiota α-diversity analysis (  Figure 5B 3.7 β-diversity analysis β-diversity is used to measure the similarity or difference among communities of different samples ( Paudel et al., 2022 The β-diversity differences among groups in saliva samples were assessed using Principal Coordinates Analysis (PCoA) methods (  Figures 6A, B Figure 6  (A, B) Two scatter plots with ellipses show principal coordinate analysis (PCoA) of different groups. The left plot displays clusters labeled COPG (red), HG (blue), and CDG (green) along PCo1 (20.2%) and PCo2 (12.3%). The right plot shows overlapping clusters along PCo1 (11.3%) and PCo2 (8%). Each group is represented by colored dots, with ellipses indicating confidence intervals. 3.8 Analysis of microbial species differences LEFSe analysis (  Figures 7A, B Figure 7  (A, B) Two circular cladograms display taxonomic relationships among microbial taxa, with colored sections representing different groups: COG0032 in red, COG0457 in blue, and R1 in green. Labels list specific taxa corresponding to the colored sections. In the oral microbiota, the HG group showed higher relative abundance of Neisseria and Porphyromonas. In contrast, the COG group exhibited significantly increased relative abundance of Fusobacterium, Rothia, and Prevotella. The COPG group had higher relative abundance of Streptococcus and Veillonella compared to the other groups. In the gut microbiota, the HG group exhibited significantly higher relative abundance of Bacilli and Erysipelotrichaceae. The COG group had higher relative abundance of Firmicutes and Clostridia. These differentially abundant microbial taxa may play unique functional roles within their respective groups. 3.9 SourceTracker analysis To further investigate whether there is ectopic colonization of oral microbiota in the intestines of patients with dental caries and obesity, we employed the SourceTracker method for analysis(  Figure 8A, B Figure 8  (A, B) Two pie charts are shown. The left chart is divided into red, labeled “alive” at 44.88 percent, and gray, labeled “unknown” at 55.12 percent. The right chart is entirely gray, labeled “100 percent.\" 3.10 Untargeted metabolomics analysis This study conducted a comprehensive identification and quantitative analysis of metabolites in intestinal samples using untargeted metabolomics. Quality control (QC) analysis ensured the reliability and stability of the experimental data. The total ion chromatogram (TIC) of QC samples showed that the response intensity and retention time of each chromatographic peak were largely overlapping, indicating minimal variation caused by instrument error. The Pearson correlation coefficients between QC samples were all greater than 0.9, demonstrating excellent experimental reproducibility (  Figures 9A–D Figure 9  (A–D) Two pairs of chromatograms and correlation matrices are shown. The chromatograms display Total Ion Chromatograms (TIC) with intensity over retention time, labeled as QC1 to QC4. Adjacent matrices indicate correlation coefficients, showing perfect correlations with a value of 1.00 across the diagonal and scatter plots in other cells. In the fecal sample comparison between the COG and COPG groups, significant differences in metabolite profiles were observed, with 12 metabolites upregulated and 22 downregulated in the COPG group compared to the COG group. To account for multiple comparisons, the p-values were adjusted using the Benjamini–Hochberg False Discovery Rate (FDR) method. Oleamide was found to be significantly lower in the COPG group than in the COG group (q < 0.05). In contrast, testosterone enanthate, imidazolepropionic acid, and pyrrolidine were significantly elevated in the COPG group (q < 0.05) (  Figures 10A–F Figure 10  (A–F) Six-panel graphic with various data visualizations. Top left: Volcano plot with points colored by gene expression changes (blue for downregulated, grey for no difference, red for upregulated). Top middle: Bar graph comparing two conditions, CCPG and reference, in red and blue. Top right and bottom panels: Bar charts measuring different variables like Obsolete, Toudoana position, Cribroherozine, and Pyxialon, comparing groups COPG and COG in red and blue with error bars indicating variability. In the comparison of saliva samples between the HG and PDG groups, significant differences in metabolite profiles were observed, with 21 metabolites upregulated and 13 downregulated in the PDG group compared to the HG group. To account for multiple comparisons, the p-values were adjusted using the Benjamini–Hochberg False Discovery Rate (FDR) method. Specifically, Glu-His-Lys (glutamine-histidine-lysine) and Huperzine B were found to be significantly lower in the PDG group than in the HG group (q < 0.05). In contrast, brucine, 4-oxo-L-proline, and adenine were significantly higher in the PDG group compared to the HG group (q < 0.05) (  Figures 11A–G Figure 11  (A–G) A collage of seven charts. The top left shows a scatter plot with points marked as “Down,” “NoDiff,” and “Up,” colored blue, grey, and red. The top middle chart is a bar graph comparing two categories, shaded red and blue. The remaining five are bar graphs comparing two groups labeled PDG and HG in red and blue, depicting values with error bars for variables like “glycerol-3-ph,” “Hypoxanthine B,” “Ureidoprop,” “3-Ureido-propionate,” and “Allantoate.” Each chart has separate scales and labels. 3.11 16S rRNA gene sequencing combined with non-targeted metagenomics analysis In the integrated analysis of 16S rRNA gene sequencing and non-targeted metabolomics between the dental caries-obesity group and the dental caries-obesity-mental disorder group, a connection between microorganisms and metabolites associated with psychological issues was identified: 4 Discussion 4.1 Oral microbiome characteristics of the adolescent caries-obesity-psychological disorder triad The oral cavity, as the initial part of the digestive tract communicating with the external environment, serves as the entry point for microorganisms into the human body, including bacteria, fungi, viruses, mycoplasmas, and other biological entities. The oral microbiota represents one of the most diverse and unique microbial communities in the human body, constituting the second most complex microbial ecosystem after the digestive system microbiota ( Al Bataineh et al., 2022 Leake et al., 2016 Soriano-Lerma et al., 2020 Kaczor-Urbanowicz et al., 2017 Borkent et al., 2020 Johansson et al., 2016 Al-Hebshi et al., 2019 Magana et al., 2018 Pitts et al., 2021 Song et al., 2024 Chapple et al., 2017 Sabharwal et al., 2021 Guo et al., 2025 Gulliver et al., 2010 Guo et al., 2025 Kieling et al., 2011 Aarons et al., 2019 Malan-Müller et al., 2024 In the oral microbiota of this study, adolescents with caries and obesity showed distinct microbial profiles compared to healthy controls at the phylum level: higher relative abundances of Firmicutes, Bacteroidota, and Actinobacteriota, and lower relative abundance of Proteobacteria, consistent with findings by Agnello et al ( Advances in research on oral microecology and caries prevention, n.d. Agnello et al., 2017 De Lemos et al., 2024 Mashima and Nakazawa, 2014 Do et al., 2015 Liu et al., 2020 Korona-Glowniak et al., 2021 Tett et al., 2021 Zheng et al., 2018 Richards et al., 2017 Baker et al., 2021 In adolescents with psychological disorders compared to psychologically normal individuals at the phylum level, Firmicutes and Proteobacteria exhibited higher relative abundances, while Bacteroidota and Actinobacteriota showed lower abundances. The reduced abundance of Actinobacteriota was associated with anxiety states and cortisol levels in adolescents ( Simpson et al., 2020 Prato et al., 2021 Wingfield et al., 2021 Yolken et al., 2021 Al Bataineh et al., 2022 The results of alpha diversity analysis align with findings from Liu et al ( Liu et al., 2019 Advances in research on oral microecology and caries prevention, n.d. 4.2 Characteristics of the gut microbiome in adolescents with the caries-obesity-psychological disorders triad The gut microbiota is one of the most complex and diverse microbial communities in the human body, with its diversity even surpassing that of the oral microbiota, making it the most diverse among human microbial communities ( Li et al., 2024 Eriksen et al., 2024 Ribeiro and Paster, 2023 Pan and Jiao, 2024 Marano et al., 2025 In the gut microbiota at the phylum level, adolescents with caries and obesity exhibited an elevated Firmicutes/Bacteroidota (F/B) ratio—characterized by increased Firmicutes and decreased Bacteroidota —a critical alteration implicated in the pathogenesis of obesity and related metabolic complications ( Gallardo-Becerra et al., 2020 Quiroga et al., 2020 Huang et al., 2018 Jiang et al., 2018 Plaza-Díaz et al., 2019 At the genus level, adolescents with caries and obesity showed higher relative abundances of Prevotella, Faecalibacterium, and Bifidobacterium, in agreement with findings by Moran-Ramos S et al ( Moran-Ramos et al., 2023 Simpson et al., 2021 Nikolova et al., 2021 Alpha Diversity Analysis: The observed differences lacked statistical significance, which partially aligns with findings from ( Pinart et al., 2021 4.3 Microbiota-gut-brain axis Communication between the gut and brain is bidirectional, involving multiple pathways such as neural, endocrine, and immune mechanisms (  Figure 12 Cryan and Dinan, 2012 Cryan and Dinan, 2012 Figure 12 Interactions between gut microbiota and host health. This schematic diagram illustrates the complex interactions between gut microbiota and host health, highlighting the potential roles of various microbial metabolites in influencing neurological and metabolic conditions. Illustration depicting the gut-brain axis. The human silhouette shows the brain and intestines connected. Gut microbiota influence 5-HT, 2-AG, GABA, and AEA, impacting depression. SCFAs, bile acids, and LPS affect obesity. Analysis of fecal samples from the COG and COPG groups revealed significant alterations in multiple metabolite levels, which may exert broad effects on brain function via the gut-brain axis. Oleamide, which exhibits antidepressant-like properties in rat models, modulates neurotransmitter systems (e.g., 5-HT and GABA), and its decreased levels may impair mood regulation ( Boger et al., 1998 Ge et al., 2015 Kirisawa et al., 2021 Caradonna et al., 2024 Warren et al., 2024 These findings further support the hypothesis that gut microbial metabolites may regulate brain function via the HPA axis ( Foster and McVey Neufeld, 2013 Gln-Trp (Glutamine-Tryptophan): Tryptophan, a precursor to the neurotransmitter serotonin (5-hydroxytryptamine), is crucial for regulating emotions, sleep, and appetite. Glutamine, involved in various metabolic processes and important in the nervous system, associates with psychological factors through substance metabolism and neurotransmitter synthesis. (2Z)-2-Benzylidenesuccinic Acid: As a phthalate compound, it is prevalent in daily life and may disrupt the endocrine system. Some studies indicate that exposure to phthalates is linked to neurological abnormalities, anxiety, and depression. A U.S. study measured phthalate metabolites in the urine of 153 pregnant women and found that higher mono-isobutyl phthalate levels in boys’ urine were associated with increased scores for inattention, rule-breaking, aggression, and conduct problems. Higher MBzP levels correlated with elevated scores for defiant behavior and conduct problems in boys. Gln-Trp was positively correlated with Pseudoxanthomonas, suggesting Pseudoxanthomonas might influence psychological disorders. Conversely, Limivivens, Paraprevotella, Acetatifactor, and Eubacterium showed negative correlations, indicating their abundance might link to psychological issues. Notably, Paraprevotella, part of the Prevotellaceae family, warrants further attention. 4.4 Oral-brain axis The mechanisms linking oral microbiota and the brain (termed the “oral-brain axis”) remain largely unexplored ( Yano et al., 2015 Valles-Colomer et al., 2019 Olsen and Hicks, 2020 Olsen, 2008  Figure 13 Figure 13 Schematic representation of the oral-brain axis. This schematic serves as a conceptual framework for understanding the complex interactions that may occur between oral microbiota, oral health conditions, and brain health, including the potential impact on cognitive functions and neurological disorders. Illustration of a human profile showing the connection between the mouth and brain. An arrow indicates the pathway from the mouth to the brain. The brain and oral cavity are highlighted. Analysis of differential metabolites in salivary samples from the HG and PDG groups revealed significant alterations in multiple metabolite levels. Notably, the glutamine-histidine-lysine (Glu-His-Lys) tripeptide, composed of three amino acids, exhibited notable changes. Glutamate (Glu), a critical excitatory neurotransmitter in the brain, is essential for normal cognitive functions such as learning, memory, and attention. However, imbalanced glutamate levels are strongly associated with the pathogenesis of psychiatric disorders ( The structure, function and role in neuropsychiatric disorders of glutamate transporters, n.d. The role of the glutamate system in mental disorders: Based on magnetic resonance spectroscopy imaging technology, n.d. Ma et al., 2023 Cheng et al., 2021 Hersey et al., 2021 Yang et al., 2018 Knölker, 2013 Brucine intoxication may increase neuroexcitability, leading to muscle spasms and seizures, symptoms potentially linked to psychological states such as anxiety and tension ( Lu et al., 2020 Das et al., 2025 Yao and Han, 2022 Qi et al., 2025 In summary, the interaction between oral microbiota and the brain (termed the “oral-brain axis”) may play a significant role in mental health. Oral bacteria and their metabolites can influence the central nervous system through multiple pathways, including direct penetration of the blood-brain barrier, activation of immune responses, or signal transmission via neural routes. Dysbiosis of the oral microbiota is closely associated with psychiatric disorders such as anxiety and depression, highlighting oral health as a critical determinant of mental well-being. These insights not only deepen our understanding of the oral-brain axis but may also inform novel strategies for clinical interventions targeting psychiatric conditions. 4.5 Oral-gut axis The oral-gut barrier, primarily shaped by the physical distance between the oral cavity and gut as well as differences in their chemical environments, allows each niche to harbor distinct microbial communities ( Paudel et al., 2022  Figure 14 Park et al., 2021 MaChado et al., 2021 Bao et al., 2022 Wu et al., 2022 Park et al., 2021 Figure 14 Schematic representation of the oral-gut axis and its impact on health. This schematic highlights the importance of maintaining a healthy oral and gut microbiota to prevent dental diseases and metabolic disorders, emphasizing the role of the oral-gut axis in overall health. Diagram showing the relationship between oral and gut health. On the left, healthy status includes non-cariogenic bacteria in the mouth and normal gut microbiota. On the right, unhealthy status features cariogenic bacteria leading to dental caries and abnormal gut microbiota contributing to obesity. The oral-gut axis connects these elements. In this experiment, SourceTracker analysis targeting the genus Prevotella was performed on samples from the HG and COG groups. The results showed that the transmission effect in the COG group was significantly greater than that in the HG group, further confirming the role of the “oral-gut axis” in disease development. Specifically, the migration of Prevotella from the oral cavity to the gut was more pronounced in the COG group, indicating that in the comorbidity of dental caries and obesity, the oral-gut barrier is altered, making it easier for oral bacteria to colonize the gut. Prevotella is a common oral bacterium, Gram-negative and anaerobic, and is widely found in the human oral cavity, gastrointestinal tract, and urogenital tract ( Research progress on Prevotella copri in the gut and its association with inflammatory diseases, n.d. Yamazaki and Kamada, 2024 5 Conclusion This study explored the impact of psychological factors on adolescent caries-obesity comorbidity from the “oral-gut-brain axis,” yielding key conclusions: A complex interrelation exists among adolescent caries, obesity, and psychological disorders, forming a health problem network. Oral and gut microbiota play crucial roles in the development of these conditions. 16S rRNA sequencing revealed significant differences in oral and gut microbiota at phylum and genus levels among adolescents in different health states, with microbial diversity and composition closely linked to health. Non-targeted metabolomics showed significant metabolite changes between groups, suggesting oral and gut microbial metabolites may influence brain function via the “gut-brain axis” and “oral-brain axis,” potentially impacting neuropsychiatric diseases. Source tracker analysis confirmed the “oral-gut axis” role in disease, with oral bacteria from caries-obesity patients colonizing the gut and influencing its microbiota, contributing to disease development. Data availability statement The data presented in the study are deposited in the NCBI repository, accession number PRJNA1305107\\MTBLS12873. Ethics statement The studies involving humans were approved by Ethics Committee of the Scientific Research Department, Affiliated Stomatology Hospital of Jinzhou Medical University, Jinzhou City, Liaoning Province, China. The studies were conducted in accordance with the local legislation and institutional requirements. Written informed consent for participation in this study was provided by the participants’ legal guardians/next of kin. Author contributions MW: Formal Analysis, Visualization, Software, Project administration, Writing – original draft, Data curation, Investigation, Conceptualization, Methodology, Validation, Supervision, Writing – review & editing. XY: Data curation, Writing – review & editing, Investigation, Formal Analysis, Validation. YL: Formal Analysis, Software, Conceptualization, Investigation, Writing – review & editing. MJ: Writing – review & editing, Project administration, Formal Analysis. BC: Methodology, Writing – review & editing, Validation. WY: Conceptualization, Writing – review & editing, Methodology. NM: Project administration, Writing – review & editing, Validation. SH: Writing – review & editing, Visualization. CW: Supervision, Methodology, Writing – review & editing, Resources, Funding acquisition. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 20180704145130574.pdf n.d. http://www.nhc.gov.cn/ewebeditor/uploadfile/2018/07/20180704145130574.pdf April 9, 2025 Aarons G. A. Seijo C. Green A. E. Moullin J. C. Hasson H. Von Thiele Schwarz U. 2019 Fostering international collaboration in implementation science and research: a concept mapping exploratory study BMC Res. Notes 12 778 10.1186/s13104-019-4800-4 31783912 PMC6883596 Agnello M. Marques J. Cen L. Mittermuller B. Huang A. Chaichanasakul Tran N. 2017 Microbiome associated with severe caries in Canadian first nations children J. Dent. Res. 96 1378 1385 10.1177/0022034517718819 28709393 PMC5652857 Al Bataineh M. T. Künstner A. Dash N. R. Abdulsalam R. M. Al-Kayyali R. Z.A. Adi M. B. 2022 Altered composition of the oral microbiota in depression among cigarette smokers: A pilot study Front. Psychiatry 13 902433 10.3389/fpsyt.2022.902433 35928781 PMC9343996 Al-Hebshi N. N. Baraniya D. Chen T. Hill J. Puri S. Tellez M. 2019 Metagenome sequencing-based strain-level and functional characterization of supragingival microbiome associated with dental caries in children J. Oral. Microbiol. 11 1557986 10.1080/20002297.2018.1557986 30671194 PMC6327923 Comprehensive evaluation of children and adolescents development n.d. http://www.nhc.gov.cn/wjw/pqt/201504/3661756c241b46329dbc6ad73eba0bd1.shtml April 9, 2025 Advances in research on oral microecology and caries prevention n.d. https://kns.cnki.net/kcms2/article/abstract?v=uXGtp3S0eCAk7If9PQMD_dpfCkp5XSGuoHnlsBE_lghMarzv5ViR8_XgfDt0623zyHhm0_8GoKPf9n0zHoBBW8_A8k-cq9WBekOSZlYjcaOEgMjKKpTVTMa9K3UpizNV8i1pv0579GXs46ptZWtAe961lOXFt6Ksm-_hszKs10ntQSWm-7qQGA==&uniplatform=NZKPT&language=CHS April 9, 2025 Study on the structure of oral microbiota in children with dental caries based on high-throughput sequencing technology n.d. https://kns.cnki.net/kcms2/article/abstract?v=uXGtp3S0eCA_ngkbmBHWeiDLSuYztaJVhcKWIBhajUb1CHLd-QKJgk8nfEY7bIA9yPW2zXRiYHpABq6kqdz207bRclFHjnBnmjOlhz2cGjuC3V3ns2-CZRJwFevHf8PAsIFoNGJMdQoNdWnsVrFTSo_lhStXYb6uxd0MddFYJrjCrk-YiJzVag==&uniplatform=NZKPT&language=CHS April 9, 2025 Research progress on Prevotella copri in the gut and its association with inflammatory diseases n.d. https://kns.cnki.net/kcms2/article/abstract?v=uXGtp3S0eCD2d-Jr6xJ5xOoRPPsw3-dOovvDmynaXTqJ3CkRpkCacPQA25QgQcbg3ijHzqEvWF-h1usFoTzxZhpgDiF064JVHyP2b28NYYlriWjXN7lReO8soi1MS0amdMZCJ1dIAOSxgmJzTZpKn0rmL4LaFJMSoWRysUNkyJs7uJovRdZyiA==&uniplatform=NZKPT&language=CHS April 9, 2025 The role of the glutamate system in mental disorders: Based on magnetic resonance spectroscopy imaging technology n.d. https://kns.cnki.net/kcms2/article/abstract?v=uXGtp3S0eCDb-Aoz-Yw1kKTLwNfApQtUzPrC2AE9ySYsewJdzag6MTTNoaL0SkQCrCAQTOeObwwumhyLm-aoDr4d1IrjDyMmUxgfyChOX3Dfr-ej9HyLSPVOH_EoY-U2PrDRIt3xxyeW4_3fztdrH1l8Xfi3FnbdWQlbydNx1ThxByT5-0gteg==&uniplatform=NZKPT&language=CHS April 9, 2025 The structure, function and role in neuropsychiatric disorders of glutamate transporters n.d. https://kns.cnki.net/kcms2/article/abstract?v=uXGtp3S0eCD1caR2fN9YQrPzoIs5-En0Pkh8vVpPtqjO_XuB_9iao-vvHdszR2fgE-2vZUzTrMY9mzmu-uC9j1laYTQ8AdxjjxVUGuvcAT3Kpls4CbOLdxK1Hya_SXQmEHTMwKautezUpocr_BuZqS8hYwT7Ixpe2_v6x-sRlNWaOMjJMarRcA==&uniplatform=NZKPT&language=CHS April 9, 2025 Baker J. L. Morton J. T. Dinis M. Alvarez R. Tran N. C. Knight R. 2021 Deep metagenomics examines the oral microbiome during dental caries, revealing novel taxa and co-occurrences with host molecules Genome Res. 31 64 74 10.1101/gr.265645.120 33239396 PMC7849383 Bao J. Li L. Zhang Y. Wang M. Chen F. Ge S. 2022 Periodontitis may induce gut microbiota dysbiosis via salivary microbiota Int. J. Oral. Sci. 14 32 10.1038/s41368-022-00183-3 35732628 PMC9217941 Boger D. L. Henriksen S. J. Cravatt B. F. 1998 Oleamide: an endogenous sleep-inducing lipid and prototypical member of a new class of biological signaling molecules Curr. Pharm. Des. 4 303 314 10.2174/138161280404221010152220 10197045 Borkent D. Reardon R. J. M. McLACHLAN G. Glendinning L. Dixon P. M. 2020 A microbiome analysis of equine peripheral dental caries using next generation sequencing Equine Veterinary J. 52 67 75 10.1111/evj.13126 31006119 Bowland G. B. Weyrich L. S. 2022 The oral-microbiome-brain axis and neuropsychiatric disorders: an anthropological perspective Front. Psychiatry 13 810008 10.3389/fpsyt.2022.810008 35432038 PMC9005879 Caradonna E. Nemni R. Bifone A. Gandolfo P. Costantino L. Giordano L. 2024 The brain–gut axis, an important player in alzheimer and Parkinson disease: A narrative review JCM 13 4130 10.3390/jcm13144130 39064171 PMC11278248 Chala S. El Aidouni M. Abouqal R. Abdallaoui F. 2017 U-shaped association between untreated caries and body mass index in adults at Rabat dental University hospital, Morocco: cross sectional study BMC Res. Notes 10 5 10.1186/s13104-016-2356-0 28057060 PMC5217218 Chapple I. L. C. Bouchard P. Cagetti M. G. Campus G. Carra M. Cocco F. 2017 Interaction of lifestyle, behaviour or systemic diseases with dental caries and periodontal diseases: consensus report of group 2 of the joint EFP ORCA J. Clinic Periodontol. 44 S42 10.1111/jcpe.12685 28266114 Cheng L. Liu J. Chen Z. 2021 The histaminergic system in neuropsychiatric disorders Biomolecules 11 1345 10.3390/biom11091345 34572558 PMC8467868 Cryan J. F. Dinan T. G. 2012 Mind-altering microorganisms: the impact of the gut microbiota on brain and behaviour Nat. Rev. Neurosci. 13 701 712 10.1038/nrn3346 22968153 Das A. Gauthier-Coles G. Bröer S. Rae C. D. 2025 l-proline alters energy metabolism in brain cortical tissue slices Neurochem. Res. 50 16 10.1007/s11064-024-04262-1 39556274 De Lemos G. M. Resende C. M.M. Campello C. P. Ribeiro I. S. Mendes A. K. De Lima E. L.S. 2024 Is oral microbiota associated with overweight and obesity in children and adolescents? A systematic review Crit. Rev. Food Sci. Nutr. 64 4275 4285 10.1080/10408398.2022.2140330 36419361 Do T. Sheehy E. C. Mulli T. Hughes F. Beighton D. 2015 Transcriptomic analysis of three Veillonella spp. present in carious dentine and in the saliva of caries-free individuals Front. Cell. Infect. Microbiol. 5 25859434 10.3389/fcimb.2015.00025 PMC4374535 Dominy S. S. Lynch C. Ermini F. Benedyk M. Marczyk A. Konradi A. 2019  Porphyromonas gingivalis Sci. Adv. 5 eaau3333 10.1126/sciadv.aau3333 30746447 PMC6357742 Duan Z.-M. Wu L.-F. 2024 Role of oral-gut-brain axis in psychiatric and neurological disorders WCJD 32 878 886 10.11569/wcjd.v32.i12.878 Eriksen C. Boustedt K. Sonne S. B. Dahlgren J. Kristiansen K. Twetman S. 2024 Early life factors and oral microbial signatures define the risk of caries in a Swedish cohort of preschool children Sci. Rep. 14 8463 10.1038/s41598-024-59126-z 38605085 PMC11009336 Folayan M. O. Adeniyi A. A. Oziegbe E. O. Fatusi A. O. Harrison A. 2018 Integrated oral, mental and sexual health management for adolescents: a call for professional collaboration Int. J. Adolesc. Med. Health 30 20160060 10.1515/ijamh-2016-0060 27505085 Foster J. A. McVey Neufeld K.-A. 2013 Gut–brain axis: how the microbiome influences anxiety and depression Trends Neurosci. 36 305 312 10.1016/j.tins.2013.01.005 23384445 Gallardo-Becerra L. Cornejo-Granados F. García-López R. Valdez-Lara A. Bikel S. Canizales-Quinteros S. 2020 Metatranscriptomic analysis to define the Secrebiome, and 16S rRNA profiling of the gut microbiome in obesity and metabolic syndrome of Mexican children Microb. Cell Fact 19 61 10.1186/s12934-020-01319-y 32143621 PMC7060530 Ge L. Zhu M. Yang J.-Y. Wang F. Zhang R. Zhang J.-H. 2015 Differential proteomic analysis of the anti-depressive effects of oleamide in a rat chronic mild stress model of depression Pharmacol. Biochem. Behav. 131 77 86 10.1016/j.pbb.2015.01.017 25641667 Gulliver A. Griffiths K. M. Christensen H. 2010 Perceived barriers and facilitators to mental health help-seeking in young people: a systematic review BMC Psychiatry 10 113 10.1186/1471-244X-10-113 21192795 PMC3022639 Guo M. Li J. Zhang L. Chen C. Wei Y. Shen Z. 2025 Effects of oral supplementation of probiotics on body weight and visceral fat in obese patients: a meta-analysis and systematic review Sci. Rep. 15 6355 10.1038/s41598-025-90820-8 39984625 PMC11845779 Hersey M. Samaranayake S. Berger S. N. Tavakoli N. Mena S. Nijhout H. F. 2021 Inflammation-induced histamine impairs the capacity of escitalopram to increase hippocampal extracellular serotonin J. Neurosci. 41 6564 6577 10.1523/JNEUROSCI.2618-20.2021 34083254 PMC8318079 Huang E. Kang S. Park H. Park S. Ji Y. Holzapfel W. H. 2018 Differences in anxiety levels of various murine models in relation to the gut microbiota composition Biomedicines 6 113 10.3390/biomedicines6040113 30518033 PMC6315404 Jiang H. Zhang X. Yu Z. Zhang Z. Deng M. Zhao J. 2018 Altered gut microbiota profile in patients with generalized anxiety disorder J. Psychiatr. Res. 104 130 136 10.1016/j.jpsychires.2018.07.007 30029052 Johansson I. Witkowska E. Kaveh B. Lif Holgerson P. Tanner A. C. R. 2016 The microbiome in populations with a low and high prevalence of caries J. Dent. Res. 95 80 86 10.1177/0022034515609554 26442950 PMC4700664 Kaczor-Urbanowicz K. E. Martin Carreras-Presas C. Aro K. Tu M. Garcia-Godoy F. Wong D. T. 2017 Saliva diagnostics–Current views and directions Exp. Biol. Med. (Maywood) 242 459 472 10.1177/1535370216681550 27903834 PMC5367650 Kieling C. Baker-Henningham H. Belfer M. Conti G. Ertem I. Omigbodun O. 2011 Child and adolescent mental health worldwide: evidence for action Lancet 378 1515 1525 10.1016/S0140-6736(11)60827-1 22008427 Kirisawa T. Ichihara K. Sakai Y. Morooka D. Iyoki T. Masumori N. 2021 Physical and psychological effects of gender-affirming hormonal treatment using intramuscular testosterone enanthate in Japanese transgender men Sexual Med. 9 100306 100306 10.1016/j.esxm.2020.100306 33540366 PMC8072143 Kisely S. Baghaie H. Lalloo R. Siskind D. Johnson N. W. 2015 A systematic review and meta-analysis of the association between poor oral health and severe mental illness Psychosomatic Med. 77 83 92 10.1097/PSY.0000000000000135 25526527 Kisely S. Sawyer E. Siskind D. Lalloo R. 2016 The oral health of people with anxiety and depressive disorders–a systematic review and meta-analysis J. Affect. Disord. 200 119 132 10.1016/j.jad.2016.04.040 27130961 Knölker H.-J. 2013 The Alkaloids San Diego Academic Press Korona-Glowniak I. Piatek D. Fornal E. Lukowiak A. Gerasymchuk Y. Kedziora A. 2021 Patterns of oral microbiota in patients with apical periodontitis JCM 10 2707 10.3390/jcm10122707 34205290 PMC8234888 Leake S. L. Pagni M. Falquet L. Taroni F. Greub G. 2016 The salivary microbiome for differentiating individuals: proof of principle Microbes Infection 18 399 405 10.1016/j.micinf.2016.03.011 27063111 Li C. Stražar M. Mohamed A. M.T. Pacheco J. A. Walker R. L. Lebar T. 2024 Gut microbiome and metabolome profiling in Framingham heart study reveals cholesterol-metabolizing bacteria Cell 187 1834 1852.e19 10.1016/j.cell.2024.03.014 38569543 PMC11071153 Liu X.-X. Jiao B. Liao X.-X. Guo L.-N. Yuan Z.-H. Wang X. 2019 Analysis of salivary microbiome in patients with alzheimer’s disease JAD 72 633 640 10.3233/JAD-190587 31594229 Liu G. Wu C. Abrams W. R. Li Y. 2020 Structural and functional characteristics of the microbiome in deep-dentin caries J. Dent. Res. 99 713 720 10.1177/0022034520913248 32196394 Lobstein T. Jackson-Leach R. Moodie M. L. Hall K. D. Gortmaker S. L. Swinburn B. A. 2015 Child and adolescent obesity: part of a bigger picture Lancet 385 2510 2520 10.1016/S0140-6736(14)61746-3 25703114 PMC4594797 Lu L. Huang R. Wu Y. Jin J.-M. Chen H.-Z. Zhang L.-J. 2020 Brucine: A review of phytochemistry, pharmacology, and toxicology Front. Pharmacol. 11 377 10.3389/fphar.2020.00377 32308621 PMC7145893 Ma Q. Jiang L. Chen H. An D. Ping Y. Wang Y. 2023 Histamine H 2 Proc. Natl. Acad. Sci. U.S.A. 120 e2207003120 10.1073/pnas.2207003120 36812204 PMC9992765 MaChado V. Botelho J. Escalda C. Hussain S. B. Luthra S. Mascarenhas P. 2021 Serum C-reactive protein and periodontitis: A systematic review and meta-analysis Front. Immunol. 12 706432 10.3389/fimmu.2021.706432 34394107 PMC8355591 Magana M. Sereti C. Ioannidis A. Mitchell C. A. Ball A. R. Magiorkinis E. 2018 Options and limitations in clinical investigation of bacterial biofilms Clin. Microbiol. Rev. 31 e00084 e00016 10.1128/CMR.00084-16 29618576 PMC6056845 Malan-Müller S. Vidal R. O’Shea E. Montero E. Figuero E. Zorrilla I. 2024 Probing the oral-brain connection: oral microbiome patterns in a large community cohort with anxiety, depression, and trauma symptoms, and periodontal outcomes Transl. Psychiatry 14 419 10.1038/s41398-024-03122-4 39368974 PMC11455920 Marano G. Rossi S. Sfratta G. Traversi G. Lisci F. M. Anesini M. B. 2025 Gut microbiota: A new challenge in mood disorder research Life 15 593 10.3390/life15040593 40283148 PMC12028401 Mashima I. Nakazawa F. 2014 The influence of oral Veillonella species on biofilms formed by Streptococcus species Anaerobe 28 54 61 10.1016/j.anaerobe.2014.05.003 24862495 Milaneschi Y. Simmons W. K. Van Rossum E. F. C. Penninx B. W. 2019 Depression and obesity: evidence of shared biological mechanisms Mol. Psychiatry 24 18 33 10.1038/s41380-018-0017-5 29453413 Miller G. E. Engen P. A. Gillevet P. M. Shaikh M. Sikaroodi M. Forsyth C. B. 2016 Lower neighborhood socioeconomic status associated with reduced diversity of the colonic microbiota in healthy adults PloS One 11 e0148952 10.1371/journal.pone.0148952 26859894 PMC4747579 Moran-Ramos S. Cerqueda‐García D. López‐Contreras B. Larrieta‐Carrasco E. Villamil‐Ramírez H. Molina‐Cruz S. 2023 A metagenomic study identifies a Prevotella copri J. Gastro Hepatol. 38 791 799 10.1111/jgh.16147 36807933 Nikolova V. L. Smith M. R.B. Hall L. J. Cleare A. J. Stone J. M. Young A. H. 2021 Perturbations in gut microbiota composition in psychiatric disorders: A review and meta-analysis JAMA Psychiatry 78 1343 10.1001/jamapsychiatry.2021.2573 34524405 PMC8444066 Olsen I. 2008 Update on bacteraemia related to dental procedures Transfusion Apheresis Sci. 39 173 178 10.1016/j.transci.2008.06.008 18753008 Olsen I. Hicks S. D. 2020 Oral microbiota and autism spectrum disorder (ASD) J. Oral. Microbiol. 12 1702806 10.1080/20002297.2019.1702806 31893019 PMC6913665 Pan Y. Jiao F.-Y. 2024 Link between childhood obesity and gut microbiota World J. Gastroenterol. 30 3560 3563 10.3748/wjg.v30.i30.3560 39193569 PMC11346147 Park S.-Y. Hwang B.-O. Lim M. Ok S.-H. Lee S.-K. Chun K.-S. 2021 Oral–gut microbiome axis in gastrointestinal disease and cancer Cancers 13 2124 33924899 10.3390/cancers13092124 PMC8125773 Paudel D. Uehara O. Giri S. Yoshida K. Morikawa T. Kitagawa T. 2022 Effect of psychological stress on the oral-gut microbiota and the potential oral-gut-brain axis Japanese Dental Sci. Rev. 58 365 375 10.1016/j.jdsr.2022.11.003 36425317 PMC9678961 Pinart M. Dötsch A. Schlicht K. Laudes M. Bouwman J. Forslund S. K. 2021 Gut microbiome composition in obese and non-obese persons: A systematic review and meta-analysis Nutrients 14 12 10.3390/nu14010012 35010887 PMC8746372 Pitts N. B. Twetman S. Fisher J. Marsh P. D. 2021 Understanding dental caries as a non-communicable disease Br. Dent. J. 231 749 753 10.1038/s41415-021-3775-4 34921271 PMC8683371 Plaza-Díaz J. Gómez-Fernández A. Chueca N. Torre-Aguilar M. J.D.L. Gil Á. Perez-Navero J. L. 2019 Autism spectrum disorder (ASD) with and without mental regression is associated with changes in the fecal microbiota Nutrients 11 337 10.3390/nu11020337 30764497 PMC6412819 Prato A. Gulisano M. Scerbo M. Barone R. Vicario C. M. Rizzo R. 2021 Diagnostic approach to pediatric autoimmune neuropsychiatric disorders associated with streptococcal infections (PANDAS): A narrative review of literature data Front. Pediatr. 9 746639 10.3389/fped.2021.746639 34778136 PMC8580040 Qi C. Yang Y. Tang P. Zheng C. Li X. Jiang N. 2025 Adenosine A2A receptor-mediated interactions between Th1+ T cells and the choroid plexus epithelium via IFN-γ signalling control T-Cell infiltration in experimental autoimmune encephalomyelitis Cell Commun. Signal 23 94 10.1186/s12964-025-02100-7 39962526 PMC11834559 Quiroga R. Nistal E. Estébanez B. Porras D. Juárez-Fernández M. Martínez-Flórez S. 2020 Exercise training modulates the gut microbiota profile and impairs inflammatory signaling pathways in obese children Exp. Mol. Med. 52 1048 1061 10.1038/s12276-020-0459-0 32624568 PMC8080668 Ribeiro A. A. Paster B. J. 2023 Dental caries and their microbiomes in children: what do we do now J. Oral. Microbiol. 15 2198433 10.1080/20002297.2023.2198433 37056224 PMC10088930 Richards V. P. Alvarez A. J. Luce A. R. Bedenbaugh M. Mitchell M. L. Burne R. A. 2017 Microbiomes of site-specific dental plaques from children with different caries status Infect. Immun. 85 e00106 e00117 10.1128/IAI.00106-17 28507066 PMC5520424 Sabharwal A. Stellrecht E. Scannapieco F. A. 2021 Associations between dental caries and systemic diseases: a scoping review BMC Oral. Health 21 472 10.1186/s12903-021-01803-w 34563194 PMC8466895 Simpson C. A. Adler C. Du Plessis M. R. Landau E. R. Dashper S. G. Reynolds E. C. 2020 Oral microbiome composition, but not diversity, is associated with adolescent anxiety and depression symptoms Physiol. Behav. 226 113126 10.1016/j.physbeh.2020.113126 32777312 Simpson C. A. Diaz-Arteche C. Eliby D. Schwartz O. S. Simmons J. G. Cowan C. S.M. 2021 The gut microbiota in anxiety and depression–A systematic review Clin. Psychol. Rev. 83 101943 10.1016/j.cpr.2020.101943 33271426 Song C. Liu R. Fang Y. Gu H. Wang Y. 2024 Developing functional hydrogels for treatment of oral diseases Smart Med. 3 e20240020 10.1002/SMMD.20240020 39420948 PMC11425053 Soriano-Lerma A. Pérez-Carrasco V. Sánchez-Marañón M. Ortiz-González M. Sánchez-Martín V. Gijón J. 2020 Influence of 16S rRNA target region on the outcome of microbiome studies in soil and saliva samples Sci. Rep. 10 13637 10.1038/s41598-020-70141-8 32788589 PMC7423937 Tett A. Pasolli E. Masetti G. Ercolini D. Segata N. 2021 Prevotella diversity, niches and interactions with the human host Nat. Rev. Microbiol. 19 585 599 10.1038/s41579-021-00559-y 34050328 PMC11290707 Valles-Colomer M. Falony G. Darzi Y. Tigchelaar E. F. Wang J. Tito R. Y. 2019 The neuroactive potential of the human gut microbiota in quality of life and depression Nat. Microbiol. 4 623 632 10.1038/s41564-018-0337-x 30718848 Warren A. L. Lankri D. Cunningham M. J. Serrano I. C. Parise L. F. Kruegel A. C. 2024 Structural pharmacology and therapeutic potential of 5-methoxytryptamines Nature 630 237 246 10.1038/s41586-024-07403-2 38720072 PMC11152992 Wingfield B. Lapsley C. McDowell A. Miliotis G. McLafferty M. O’Neill S. M. 2021 Variations in the oral microbiome are associated with depression in young adults Sci. Rep. 11 15009 10.1038/s41598-021-94498-6 34294835 PMC8298414 Wu L. Han J. Nie J.-Y. Deng T. Li C. Fang C. 2022 Alterations and correlations of gut microbiota and fecal metabolome characteristics in experimental periodontitis rats Front. Microbiol. 13 865191 10.3389/fmicb.2022.865191 35495729 PMC9048259 Yamazaki K. 2023 Oral-gut axis as a novel biological mechanism linking periodontal disease and systemic diseases: A review Japanese Dental Sci. Rev. 59 273 280 10.1016/j.jdsr.2023.08.003 37674899 PMC10477752 Yamazaki K. Kamada N. 2024 Exploring the oral-gut linkage: Interrelationship between oral and systemic diseases Mucosal Immunol. 17 147 153 10.1016/j.mucimm.2023.11.006 38007003 PMC11222583 Yang Q.-Q. Zhao D.-S. Zhang C.-Q. Wu H.-Y. Li Q.-F. Gu M.-H. 2018 A connection between lysine and serotonin metabolism in rice endosperm Plant Physiol. 176 1965 1980 10.1104/pp.17.01283 29363563 PMC5841688 Yano J. M. Yu K. Donaldson G. P. Shastri G. G. Ann P. Ma L. 2015 Indigenous bacteria from the gut microbiota regulate host serotonin biosynthesis Cell 161 264 276 10.1016/j.cell.2015.02.047 25860609 PMC4393509 Yao Y. Han W. 2022 Proline metabolism in neurological and psychiatric disorders Mol. Cells 45 781 788 10.14348/molcells.2022.0115 36324271 PMC9676987 Yolken R. Prandovszky E. Severance E. G. Hatfield G. Dickerson F. 2021 The oropharyngeal microbiome is altered in individuals with schizophrenia and mania Schizophr. Res. 234 51 57 10.1016/j.schres.2020.03.010 32334937 Zhang M. Mi N. Ying Z. Lin X. Jin Y. 2023 Advances in the prevention and treatment of Alzheimer’s disease based on oral bacteria Front. Psychiatry 14 1291455 10.3389/fpsyt.2023.1291455 38156323 PMC10754487 Zheng Y. Zhang M. Li J. Li Y. Teng F. Jiang H. 2018 Comparative analysis of the microbial profiles in supragingival plaque samples obtained from twins with discordant caries phenotypes and their mothers Front. Cell. Infect. Microbiol. 8 361 10.3389/fcimb.2018.00361 30460203 PMC6232758 ",
  "metadata": {
    "Title of this paper": "Comparative analysis of the microbial profiles in supragingival plaque samples obtained from twins with discordant caries phenotypes and their mothers",
    "Journal it was published in:": "Frontiers in Cellular and Infection Microbiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479512/"
  }
}