{
  "title": "Paper_1168",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467532 PMC12467532.1 12467532 12467532 41008535 10.3390/biom15091228 biomolecules-15-01228 1 Review Transmembrane Protein 97 (TMEM97): Molecular Target and Treatment in Age-Related Macular Degeneration (AMD) Stathopoulos Alyssa 1 † Wang Joshua J. 1 * † Martin Stephen F. 2 Zhang Sarah X. 1 Narayanan S. Priya Academic Editor 1 arstatho@buffalo.edu xzhang38@buffalo.edu 2 sfmartin@mail.utexas.edu * jianxinw@buffalo.edu † These authors contributed equally to this work. 26 8 2025 9 2025 15 9 497615 1228 16 7 2025 20 8 2025 22 8 2025 26 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Age-related macular degeneration (AMD) is a common eye disease that significantly affects daily activities and impedes the quality of life in aging adults, yet effective treatments to halt or reverse disease progression are currently lacking. Ongoing research aims at understanding the complex mechanisms underlying AMD pathophysiology involving retinal pigment epithelium (RPE) dysfunction, drusen formation, inflammation, neovascularization, and RPE/photoreceptor degeneration. Sigma 2 receptor/transmembrane protein 97 (σ 2 2 2 2 retinal degeneration small molecule molecular target and treatment transmembrane protein 97 NIH/NEI EY019949 EY030970 EY035810 EY036132 This research was in part supported by NIH/NEI Grants EY019949, EY030970, EY035810, and EY036132, and an Unrestricted Grant from Research to Prevent Blindness, awarded to the Department of Ophthalmology at the State University of New York at Buffalo. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Age-related macular degeneration (AMD) is a leading cause of vision loss in aging adults, and its global prevalence has increased substantially in recent years [ 1 2 3 4 3 4 3 4 3 4 5 6 7 8 The lack of effective treatments for AMD is in part due to the complex nature of the disease that involves an interplay of multiple etiological factors and signaling pathways, including genetic susceptibility, environmental risk factors, oxidative stress, mitochondrial dysfunction, impaired lipid metabolism, chronic inflammation, and immune system dysregulation [ 9 10 11 3 12 13 14 15 16 2 17 18 2 19 20 21 22 23 2 24 2 25 26 27 28 29 2 30 31 32 2 2 2. AMD: Clinical Manifestations, Treatment, and Pathophysiology AMD is a chronic disease classified into three stages: early, intermediate, and advanced AMD. The progression of AMD is a slow process that takes years to reach the later or advanced stage [ 3 4 4 4 3 4 33 33 Despite recent advances, the management and treatment options for early and intermediate AMD are limited, including observation, risk factor reduction, and dietary supplementation with minerals and vitamins [ 3 4 33 34 35 36 6 7 37 38 3 4 3 4 5 3 4 Drusen formation is a major characteristic of early AMD. The landmark Beaver Dam Eye Study (BDES) examined the fifteen-year cumulative incidence of AMD fundus changes in nearly 4000 individuals from 1988 to 2005 [ 39 39 3 40 41 41 41 41 AMD is a multifactorial disease involving genetic and environmental risk factors such as aging, smoking, previous cataract surgery, and systemic diseases [ 3 4 42 17 43 3 44 2 2 4 3 4 42 3. Transmembrane Protein 97 (TMEM97): A Gene Encoding Sigma 2 ( σ 2 The sigma (σ) receptors are a distinct class of transmembrane, non-G-protein-coupled receptors consisting of sigma 1 and sigma 2 (σ 1 2 45 46 1 46 47 48 1 2 49 50 51 2 2 19 52 53 54 2 σ 2 47 55 56 57 2 19 58 2 19 Figure 1 2 20 21 22 23 19 4. Role of σ 2 4.1. σ 2 σ 2 2 59 59 2 60 2 2 60 2 52 61 In addition to cholesterol synthesis and LDL uptake, σ 2 21 61 2 21 62 63 2 4.2. σ 2 Autophagy is a lysosome-dependent cellular homeostatic process, where damaged or unnecessary cellular components, such as mitochondria, are sequestered by autophagosomes and delivered to lysosomes for degradation and/or recycling [ 64 65 2 66 2 28 66 2 67 2 52 68 69 2 21 4.3. σ 2 σ 2 53 70 2 70 2 53 70 2 2 22 2 22 2 53 22 53 2 53 4.4. σ 2 The ISR is an adaptive response to cellular stress, such as ER stress, oxidative stress, and accumulation of misfolded proteins, resulting in a decrease in global protein synthesis, while simultaneously initiating the translation of specific mRNAs, such as the mRNA of transcription factor ATF4 (activating transcription factor 4) [ 71 71 71 2 23 2 23 2 23 72 2 23 2 4.5. σ 2 σ 2 53 73 74 75 76 77 2 78 2 78 2 78 2 2 79 2 61 5. Role of σ 2 The role of σ 2 2 23 72 80 2 23 54 72 81 82 2 80 2 80 2 2 69 2 69 2 27 29 2 6. Role of σ 2 Recent GWASs and transcriptome-wide association analysis (TWASs) identified σ 2 17 18 2 58 83 84 2 28 30 58 2 28 28 2 58 2 30 2 2 2 RPE-derived pro-inflammatory cytokine production can contribute to AMD progression, but the regulation of cytokine production in the RPE is not yet completely understood. A recent study identified a critical role of σ 2 31 2 31 2 3 31 2 Drusen formation due to dysregulated cholesterol homeostasis and lipid trafficking is a central step in the development and progression of AMD. A new study revealed that σ 2 85 2 85 2 1 2 85 2 Epithelial–mesenchymal transition (EMT) is another important pathological process in the development and progression of AMD [ 32 2 2 32 2 32 2 32 2 7. σ 2 Given the important role of σ 2 2 Table 1 2 86 2 2 87 87 2 Caenorhabditis elegans 88 89 89 2 σ 2 2 90 2 2 91 2 25 2 92 2 67 26 In blast and controlled cortical impact injury models of traumatic brain injury in mice, it has been shown that σ 2 27 2 29 2 2 2 23 72 2 2 2 23 In an illumination-induced mouse model of AMD, modulation of σ 2 93 2 85 85 2 Collectively, the results summarized herein provide important information suggesting that σ2R/TMEM97 modulation may provide beneficial effects in a wide range of neurological disorders, including the negative symptoms of schizophrenia, alcohol use disorder, neuropathic pain, and neurodegenerative diseases such as Alzheimer’s, Parkinson’s, and Huntington’s diseases, as well as AMD. 8. Conclusions and Future Directions AMD is the most prevalent cause of vision impairment in the aging population. While significant progress has been made in treating wet AMD, there is still a significant deficit in effective treatments for dry AMD, particularly in its early stages. The newly FDA-approved treatments targeting the complement system can only slow down the progression of GA but do not improve vision. Thus, there is a significant need for effective therapies to manage and treat dry AMD. σ 2 2 2 2 2 2 2 2 Although multiple small-molecule compounds that bind to and modulate σ 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 Acknowledgments The authors would thank Saad Yousuf (The University of Texas at Dallas) for help with the figure. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.X.Z.; methodology, A.S., J.J.W., S.F.M. and S.X.Z.; investigation, A.S., J.J.W., S.F.M. and S.X.Z.; writing—original draft preparation, A.S.; writing—review and editing, A.S., J.J.W., S.F.M. and S.X.Z.; visualization, S.X.Z.; supervision, J.J.W. and S.X.Z.; project administration, J.J.W. and S.X.Z.; funding acquisition, S.X.Z. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bourne R.R. Stevens G.A. White R.A. Smith J.L. Flaxman S.R. Price H. Jonas J.B. Keeffe J. Leasher J. Naidoo K. Causes of vision loss worldwide, 1990–2010: A systematic analysis Lancet Glob. Health 2013 1 e339 e349 10.1016/S2214-109X(13)70113-X 25104599 2. Wong W.L. Su X. Li X. Cheung C.M. Klein R. Cheng C.Y. Wong T.Y. Global prevalence of age-related macular degeneration and disease burden projection for 2020 and 2040: A systematic review and meta-analysis Lancet Glob. Health 2014 2 e106 e116 10.1016/S2214-109X(13)70145-1 25104651 3. Fleckenstein M. Keenan T.D.L. Guymer R.H. Chakravarthy U. Schmitz-Valckenberg S. Klaver C.C. Wong W.T. Chew E.Y. Age-related macular degeneration Nat. Rev. Dis. Primers 2021 7 31 10.1038/s41572-021-00265-2 33958600 4. Flaxel C.J. Adelman R.A. Bailey S.T. Fawzi A. Lim J.I. Vemulakonda G.A. Ying G.S. Age-Related Macular Degeneration Preferred Practice Pattern(R) Ophthalmology 2020 127 P1 P65 10.1016/j.ophtha.2019.09.024 31757502 5. Solomon S.D. Lindsley K. Vedula S.S. Krzystolik M.G. Hawkins B.S. Anti-vascular endothelial growth factor for neovascular age-related macular degeneration Cochrane Database Syst. Rev. 2019 3 CD005139 10.1002/14651858.CD005139.pub4 30834517 PMC6419319 6. FDA Approves SYFOVRE™ (Pegcetacoplan Injection) as the First and Only Treatment for Geographic Atrophy (GA), a Leading Cause of Blindness Available online: https://investors.apellis.com/news-releases/news-release-details/fda-approves-syfovretm-pegcetacoplan-injection-first-and-only (accessed on 6 August 2025) 7. Apellis Wins FDA Approval for First Geographic Atrophy Drug Available online: https://www.fiercepharma.com/pharma/apellis-wins-fda-approval-first-geographic-atrophy-drug (accessed on 6 August 2025) 8. Storey P.P. Patel D. Garg S. Endophthalmitis following intravitreal injection of anti-vascular endothelial growth factor agents Can. J. Ophthalmol. 2020 55 286 292 10.1016/j.jcjo.2020.01.015 32204888 9. Deng Y. Qiao L. Du M. Qu C. Wan L. Li J. Huang L. Age-related macular degeneration: Epidemiology, genetics, pathophysiology, diagnosis, and targeted therapy Genes. Dis. 2022 9 62 79 10.1016/j.gendis.2021.02.009 35005108 PMC8720701 10. Chen C. Cano M. Wang J.J. Li J. Huang C. Yu Q. Herbert T.P. Handa J.T. Zhang S.X. Role of unfolded protein response dysregulation in oxidative injury of retinal pigment epithelial cells Antioxid. Redox Signal. 2014 20 2091 2106 10.1089/ars.2013.5240 24053669 PMC3995121 11. Huang C. Wang J.J. Ma J.H. Jin C. Yu Q. Zhang S.X. Activation of the UPR Protects Against Cigarette Smoke-induced RPE Apoptosis through Up-Regulation of Nrf 2 J. Biol. Chem. 2015 290 5367 5380 10.1074/jbc.M114.603738 25568320 PMC4342454 12. McLaughlin T. Medina A. Perkins J. Yera M. Wang J.J. Zhang S.X. Cellular stress signaling and the unfolded protein response in retinal degeneration: Mechanisms and therapeutic implications Mol. Neurodegener. 2022 17 25 10.1186/s13024-022-00528-w 35346303 PMC8962104 13. McLaughlin T. Falkowski M. Park J.W. Keegan S. Elliott M. Wang J.J. Zhang S.X. Loss of XBP1 accelerates age-related decline in retinal function and neurodegeneration Mol. Neurodegener. 2018 13 16 10.1186/s13024-018-0250-z 29615095 PMC5883257 14. Zhang S.X. Wang J.J. Starr C.R. Lee E.J. Park K.S. Zhylkibayev A. Medina A. Lin J.H. Gorbatyuk M. The endoplasmic reticulum: Homeostasis and crosstalk in retinal health and disease Prog. Retin. Eye Res. 2024 98 101231 10.1016/j.preteyeres.2023.101231 38092262 PMC11056313 15. Acar I.E. Galesloot T.E. Luhmann U.F.O. Fauser S. Gayan J. den Hollander A.I. Nogoceke E. Whole Genome Sequencing Identifies Novel Common and Low-Frequency Variants Associated with Age-Related Macular Degeneration Investig. Ophthalmol. Vis. Sci. 2023 64 24 10.1167/iovs.64.14.24 PMC10664724 37975850 16. Saksens N.T. Geerlings M.J. Bakker B. Schick T. Daha M.R. Fauser S. Boon C.J. de Jong E.K. Hoyng C.B. den Hollander A.I. Rare Genetic Variants Associated with Development of Age-Related Macular Degeneration JAMA Ophthalmol. 2016 134 287 293 10.1001/jamaophthalmol.2015.5592 26767664 17. Fritsche L.G. Igl W. Bailey J.N. Grassmann F. Sengupta S. Bragg-Gresham J.L. Burdon K.P. Hebbring S.J. Wen C. Gorski M. A large genome-wide association study of age-related macular degeneration highlights contributions of rare and common variants Nat. Genet. 2016 48 134 143 10.1038/ng.3448 26691988 PMC4745342 18. Ratnapriya R. Sosina O.A. Starostik M.R. Kwicklis M. Kapphahn R.J. Fritsche L.G. Walton A. Arvanitis M. Gieser L. Pietraszkiewicz A. Retinal transcriptome and eQTL analyses identify genes associated with age-related macular degeneration Nat. Genet. 2019 51 606 610 10.1038/s41588-019-0351-9 30742112 PMC6441365 19. Alon A. Schmidt H.R. Wood M.D. Sahn J.J. Martin S.F. Kruse A.C. Identification of the gene that codes for the sigma(2) receptor Proc. Natl. Acad. Sci. USA 2017 114 7160 7165 10.1073/pnas.1705154114 28559337 PMC5502638 20. Parente M. Tonini C. Caputo S. Fiocchetti M. Pallottini V. Mechanisms of Sigma-2/TMEM97 Involvement in Cholesterol Metabolism J. Cell. Biochem. 2024 125 e30645 10.1002/jcb.30645 39300897 21. Ebrahimi-Fakhari D. Wahlster L. Bartz F. Werenbeck-Ueding J. Praggastis M. Zhang J. Joggerst-Thomalla B. Theiss S. Grimm D. Ory D.S. Reduction of TMEM97 increases NPC1 protein levels and restores cholesterol trafficking in Niemann-pick type C1 disease cells Hum. Mol. Genet. 2016 25 3588 3599 10.1093/hmg/ddw204 27378690 PMC5179952 22. Cantonero C. Camello P.J. Salido G.M. Rosado J.A. Redondo P.C. TMEM97 facilitates the activation of SOCE by downregulating the association of cholesterol to Orai1 in MDA-MB-231 cells Biochim. Biophys. Acta Mol. Cell Biol. Lipids 2021 1866 158906 10.1016/j.bbalip.2021.158906 33618021 23. Yousuf M.S. Sahn J.J. Yang H. David E.T. Shiers S. Mancilla Moreno M. Iketem J. Royer D.M. Garcia C.D. Zhang J. Highly specific sigma(2)R/TMEM97 ligand FEM-1689 alleviates neuropathic pain and inhibits the integrated stress response Proc. Natl. Acad. Sci. USA 2023 120 e2306090120 10.1073/pnas.2306090120 38117854 PMC10756276 24. Oyer H.M. Sanders C.M. Kim F.J. Small-Molecule Modulators of Sigma1 and Sigma2/TMEM97 in the Context of Cancer: Foundational Concepts and Emerging Themes Front. Pharmacol. 2019 10 1141 10.3389/fphar.2019.01141 31695608 PMC6816035 25. Colom-Cadena M. Toombs J. Simzer E. Holt K. McGeachan R. Tulloch J. Jackson R.J. Catterson J.H. Spires-Jones M.P. Rose J. Transmembrane protein 97 is a potential synaptic amyloid beta receptor in human Alzheimer’s disease Acta Neuropathol. 2024 147 32 10.1007/s00401-023-02679-6 38319380 PMC10847197 26. Jin J. Arbez N. Sahn J.J. Lu Y. Linkens K.T. Hodges T.R. Tang A. Wiseman R. Martin S.F. Ross C.A. Neuroprotective Effects of sigma(2)R/TMEM97 Receptor Modulators in the Neuronal Model of Huntington’s Disease ACS Chem. Neurosci. 2022 13 2852 2862 10.1021/acschemneuro.2c00274 36108101 PMC9547941 27. Vazquez-Rosa E. Watson M.R. Sahn J.J. Hodges T.R. Schroeder R.E. Cintron-Perez C.J. Shin M.K. Yin T.C. Emery J.L. Martin S.F. Neuroprotective Efficacy of a Sigma 2 Receptor/TMEM97 Modulator (DKR-1677) after Traumatic Brain Injury ACS Chem. Neurosci. 2019 10 1595 1602 10.1021/acschemneuro.8b00543 30421909 PMC6862717 28. Shen H. Li J. Heisler-Taylor T. Makin R. Yang H. Mavlyutov T.A. Gelfand B. Cebulla C.M. Guo L.W. TMEM97 ablation aggravates oxidant-induced retinal degeneration Cell Signal. 2021 86 110078 10.1016/j.cellsig.2021.110078 34245862 PMC8869839 29. Wang H. Peng Z. Li Y. Sahn J.J. Hodges T.R. Chou T.H. Liu Q. Zhou X. Jiao S. Porciatti V. sigma(2)R/TMEM97 in retinal ganglion cell degeneration Sci. Rep. 2022 12 20753 10.1038/s41598-022-24537-3 36456686 PMC9715665 30. Malagise E. Keeling E. Knezovich N. Waybright L. Watto E. Caggiono A.O. Ratnayaka A. Hamby M.E. Sigma-2 receptor modulators rescue POS trafficking deficits in RPE cell-based models of dry AMD Investig. Ophthalmol. Vis. Sci. 2022 63 3182-F0456 31. Li J. Shen H. Guo L.W. Transmembrane protein TMEM97 and epigenetic reader BAHCC1 constitute an axis that supports pro-inflammatory cytokine expression Cell Signal. 2024 116 111069 10.1016/j.cellsig.2024.111069 38290642 PMC10997414 32. Li J. Nagasaka Y. Shen H. Zhou X. Ma J. Trevisan-Silva D. Sherman N.E. Ambati J. Gelfand B.D. Guo L.-W. TMEM97 governs partial epithelial-mesenchymal transition of retinal pigment epithelial cells via the CTNND2-ADAM10 axis Mol. Ther. Nucleic Acids 2025 36 102460 10.1016/j.omtn.2025.102460 39995975 PMC11848774 33. Schultz N.M. Bhardwaj S. Barclay C. Gaspar L. Schwartz J. Global Burden of Dry Age-Related Macular Degeneration: A Targeted Literature Review Clin. Ther. 2021 43 1792 1818 10.1016/j.clinthera.2021.08.011 34548176 34. Age-Related Eye Disease Study Research G. The Age-Related Eye Disease Study (AREDS): Design implications. AREDS report no. 1 Control. Clin. Trials 1999 20 573 600 10.1016/s0197-2456(99)00031-8 10588299 PMC1473211 35. Age-Related Eye Disease Study 2 Research G. Lutein + zeaxanthin and omega-3 fatty acids for age-related macular degeneration: The Age-Related Eye Disease Study 2 (AREDS2) randomized clinical trial JAMA 2013 309 2005 2015 10.1001/jama.2013.4997 23644932 36. Parmar U.P.S. Surico P.L. Mori T. Singh R.B. Cutrupi F. Premkishore P. Gallo Afflitto G. Di Zazzo A. Coassin M. Romano F. Antioxidants in Age-Related Macular Degeneration: Lights and Shadows Antioxidants 2025 14 152 10.3390/antiox14020152 40002339 PMC11852319 37. Iveric Bio Receives U.S. FDA Approval for IZERVAY™ (Avacincaptad Pegol Intravitreal Solution), a New Treatment for Geographic Atrophy Available online: https://newsroom.astellas.us/2023-08-04-Iveric-Bio-Receives-U-S-FDA-Approval-for-IZERVAY-TM-avacincaptad-pegol-intravitreal-solution-,-a-New-Treatment-for-Geographic-Atrophy#:~:text=Iveric%20Bio%20Receives%20U.S.%20FDA,Geographic%20Atrophy%20%2D%20Aug%204%2C%202023 (accessed on 6 August 2025) 38. U.S FDA Approves Expanded Label for Astellas’ IZERVAY™ (Avacincaptad Pegol Intravitreal Solution) for Geographic Atrophy Available online: https://www.astellas.com/en/news/29641 (accessed on 6 August 2025) 39. Klein R. Klein B.E. Knudtson M.D. Meuer S.M. Swift M. Gangnon R.E. Fifteen-year cumulative incidence of age-related macular degeneration: The Beaver Dam Eye Study Ophthalmology 2007 114 253 262 10.1016/j.ophtha.2006.10.040 17270675 40. Curcio C.A. Millican C.L. Bailey T. Kruth H.S. Accumulation of cholesterol with age in human Bruch’s membrane Investig. Ophthalmol. Vis. Sci. 2001 42 265 274 11133878 41. Curcio C.A. Soft Drusen in Age-Related Macular Degeneration: Biology and Targeting Via the Oil Spill Strategies Investig. Ophthalmol. Vis. Sci. 2018 59 AMD160 AMD181 10.1167/iovs.18-24882 30357336 PMC6733535 42. Chakravarthy U. Wong T.Y. Fletcher A. Piault E. Evans C. Zlateva G. Buggage R. Pleil A. Mitchell P. Clinical risk factors for age-related macular degeneration: A systematic review and meta-analysis BMC Ophthalmol. 2010 10 31 10.1186/1471-2415-10-31 21144031 PMC3009619 43. Yan Q. Ding Y. Liu Y. Sun T. Fritsche L.G. Clemons T. Ratnapriya R. Klein M.L. Cook R.J. Liu Y. Genome-wide analysis of disease progression in age-related macular degeneration Hum. Mol. Genet. 2018 27 929 940 10.1093/hmg/ddy002 29346644 PMC6059197 44. Chen M. Xu H. Parainflammation, chronic inflammation, and age-related macular degeneration J. Leukoc. Biol. 2015 98 713 725 10.1189/jlb.3RI0615-239R 26292978 PMC4733662 45. Martin W.R. Eades C.G. Thompson J.A. Huppler R.E. Gilbert P.E. The effects of morphine- and nalorphine- like drugs in the nondependent and morphine-dependent chronic spinal dog J. Pharmacol. Exp. Ther. 1976 197 517 532 10.1016/S0022-3565(25)30536-7 945347 46. Hellewell S.B. Bowen W.D. A sigma-like binding site in rat pheochromocytoma (PC12) cells: Decreased affinity for (+)-benzomorphans and lower molecular weight suggest a different sigma receptor form from that of guinea pig brain Brain Res. 1990 527 244 253 10.1016/0006-8993(90)91143-5 2174717 47. Hellewell S.B. Bruce A. Feinstein G. Orringer J. Williams W. Bowen W.D. Rat liver and kidney contain high densities of sigma 1 and sigma 2 receptors: Characterization by ligand binding and photoaffinity labeling Eur. J. Pharmacol. 1994 268 9 18 10.1016/0922-4106(94)90115-5 7925616 48. Hayashi T. Su T.P. Sigma-1 receptor chaperones at the ER-mitochondrion interface regulate Ca(2+) signaling and cell survival Cell 2007 131 596 610 10.1016/j.cell.2007.08.036 17981125 49. Nicholson H. Mesangeau C. McCurdy C.R. Bowen W.D. Sigma-2 Receptors Play a Role in Cellular Metabolism: Stimulation of Glycolytic Hallmarks by CM764 in Human SK-N-SH Neuroblastoma J. Pharmacol. Exp. Ther. 2016 356 232 243 10.1124/jpet.115.228387 26574517 PMC4746495 50. Abate C. Niso M. Infantino V. Menga A. Berardi F. Elements in support of the ‘non-identity’ of the PGRMC1 protein with the sigma2 receptor Eur. J. Pharmacol. 2015 758 16 23 10.1016/j.ejphar.2015.03.067 25843410 51. Chu U.B. Mavlyutov T.A. Chu M.L. Yang H. Schulman A. Mesangeau C. McCurdy C.R. Guo L.W. Ruoho A.E. The Sigma-2 Receptor and Progesterone Receptor Membrane Component 1 are Different Binding Sites Derived From Independent Genes EBioMedicine 2015 2 1806 1813 10.1016/j.ebiom.2015.10.017 26870805 PMC4740303 52. Riad A. Zeng C. Weng C.C. Winters H. Xu K. Makvandi M. Metz T. Carlin S. Mach R.H. Sigma-2 Receptor/TMEM97 and PGRMC-1 Increase the Rate of Internalization of LDL by LDL Receptor through the Formation of a Ternary Complex Sci. Rep. 2018 8 16845 10.1038/s41598-018-35430-3 30443021 PMC6238005 53. Cantonero C. Camello P.J. Abate C. Berardi F. Salido G.M. Rosado J.A. Redondo P.C. NO1, a New Sigma 2 Receptor/TMEM97 Fluorescent Ligand, Downregulates SOCE and Promotes Apoptosis in the Triple Negative Breast Cancer Cell Lines Cancers 2020 12 257 10.3390/cancers12020257 31973006 PMC7072710 54. Alon A. Lyu J. Braz J.M. Tummino T.A. Craik V. O’Meara M.J. Webb C.M. Radchenko D.S. Moroz Y.S. Huang X.P. Structures of the sigma(2) receptor enable docking for bioactive ligand discovery Nature 2021 600 759 764 10.1038/s41586-021-04175-x 34880501 PMC8867396 55. Guo L. Zhen X. Sigma-2 receptor ligands: Neurobiological effects Curr. Med. Chem. 2015 22 989 1003 10.2174/0929867322666150114163607 25620095 56. Vilner B.J. John C.S. Bowen W.D. Sigma-1 and sigma-2 receptors are expressed in a wide variety of human and rodent tumor cell lines Cancer Res. 1995 55 408 413 7812973 57. Wheeler K.T. Wang L.M. Wallen C.A. Childers S.R. Cline J.M. Keng P.C. Mach R.H. Sigma-2 receptors as a biomarker of proliferation in solid tumours Br. J. Cancer 2000 82 1223 1232 10.1054/bjoc.1999.1067 10735510 PMC2363350 58. Wang J.H. Urrutia-Cabrera D. Lees J.G. Mesa Mora S. Nguyen T. Hung S.S.C. Hewitt A.W. Lim S.Y. Edwards T.L. Wong R.C.B. Development of a CRISPRi Human Retinal Pigmented Epithelium Model for Functional Study of Age-Related Macular Degeneration Genes Int. J. Mol. Sci. 2023 24 3417 10.3390/ijms24043417 36834828 PMC9962760 59. Sanchez-Pulido L. Ponting C.P. TM6SF2 and MAC30, new enzyme homologs in sterol metabolism and common metabolic disease Front. Genet. 2014 5 439 10.3389/fgene.2014.00439 25566323 PMC4263179 60. Bartz F. Kern L. Erz D. Zhu M. Gilbert D. Meinhof T. Wirkner U. Erfle H. Muckenthaler M. Pepperkok R. Identification of cholesterol-regulating genes by targeted RNAi screening Cell Metab. 2009 10 63 75 10.1016/j.cmet.2009.05.009 19583955 61. Zeng C. Riad A. Mach R.H. The Biological Function of Sigma-2 Receptor/TMEM97 and Its Utility in PET Imaging Studies in Cancer Cancers 2020 12 1877 10.3390/cancers12071877 32668577 PMC7409002 62. Havla J. Moser M. Sztatecsny C. Lotz-Havla A.S. Maier E.M. Hizli B. Schinner R. Kumpfel T. Strupp M. Bremova-Ertl T. Retinal axonal degeneration in Niemann-Pick type C disease J. Neurol. 2020 267 2070 2082 10.1007/s00415-020-09796-2 32222928 PMC7320959 63. Claudepierre T. Paques M. Simonutti M. Buard I. Sahel J. Maue R.A. Picaud S. Pfrieger F.W. Lack of Niemann-Pick type C1 induces age-related degeneration in the mouse retina Mol. Cell Neurosci. 2010 43 164 176 10.1016/j.mcn.2009.10.007 19883762 64. Liu S. Yao S. Yang H. Liu S. Wang Y. Autophagy: Regulator of cell death Cell Death Dis. 2023 14 648 10.1038/s41419-023-06154-8 37794028 PMC10551038 65. Glick D. Barth S. Macleod K.F. Autophagy: Cellular and molecular mechanisms J. Pathol. 2010 221 3 12 10.1002/path.2697 20225336 PMC2990190 66. Xu J. Gu J. Pei W. Zhang Y. Wang L. Gao J. The role of lysosomal membrane proteins in autophagy and related diseases FEBS J. 2024 291 3762 3785 10.1111/febs.16820 37221945 67. Limegrover C.S. Yurko R. Izzo N.J. LaBarbera K.M. Rehak C. Look G. Rishton G. Safferstein H. Catalano S.M. Sigma-2 receptor antagonists rescue neuronal dysfunction induced by Parkinson’s patient brain-derived alpha-synuclein J. Neurosci. Res. 2021 99 1161 1176 10.1002/jnr.24782 33480104 PMC7986605 68. Zeng C. Weng C.C. Schneider M.E. Jr. Puentes L. Riad A. Xu K. Makvandi M. Jin L. Hawkins W.G. Mach R.H. TMEM97 and PGRMC1 do not mediate sigma-2 ligand-induced cell death Cell Death Discov. 2019 5 58 10.1038/s41420-019-0141-2 30701090 PMC6349905 69. Riad A. Lengyel-Zhand Z. Zeng C. Weng C.C. Lee V.M. Trojanowski J.Q. Mach R.H. The Sigma-2 Receptor/TMEM97, PGRMC1, and LDL Receptor Complex Are Responsible for the Cellular Uptake of Abeta42 and Its Protein Aggregates Mol. Neurobiol. 2020 57 3803 3813 10.1007/s12035-020-01988-1 32572762 PMC7415709 70. Zhang N. Pan H. Liang X. Xie J. Han W. The roles of transmembrane family proteins in the regulation of store-operated Ca(2+) entry Cell. Mol. Life Sci. 2022 79 118 10.1007/s00018-021-04034-y 35119538 PMC11071953 71. Costa-Mattioli M. Walter P. The integrated stress response: From mechanism to disease Science 2020 368 aat5314 10.1126/science.aat5314 PMC8997189 32327570 72. Sahn J.J. Mejia G.L. Ray P.R. Martin S.F. Price T.J. Sigma 2 Receptor/Tmem97 Agonists Produce Long Lasting Antineuropathic Pain Effects in Mice ACS Chem. Neurosci. 2017 8 1801 1811 10.1021/acschemneuro.7b00200 28644012 PMC5715471 73. Ding H. Gui X.H. Lin X.B. Chen R.H. Cai H.R. Fen Y. Sheng Y.L. Prognostic Value of MAC30 Expression in Human Pure Squamous Cell Carcinomas of the Lung Asian Pac. J. Cancer Prev. 2016 17 2705 2710 27268655 74. Zhao Z.R. Zhang L.J. He X.Q. Zhang Z.Y. Zhang F. Li F. Pei Y.B. Hu Y.M. Wang M.W. Sun X.F. Significance of mRNA and protein expression of MAC30 in progression of colorectal cancer Chemotherapy 2011 57 394 401 10.1159/000331716 22024687 75. Yan B.Y. Wang D.W. Zhu Z.L. Yang Y.H. Wang M.W. Cui D.S. Zhang H. Sun X.F. Overexpression of MAC30 in the cytoplasm of oral squamous cell carcinoma predicts nodal metastasis and poor differentiation Chemotherapy 2010 56 424 428 10.1159/000317582 21079401 76. Moparthi S.B. Arbman G. Wallin A. Kayed H. Kleeff J. Zentgraf H. Sun X.F. Expression of MAC30 protein is related to survival and biological variables in primary and metastatic colorectal cancers Int. J. Oncol. 2007 30 91 95 10.3892/ijo.30.1.91 17143516 77. Wilcox C.B. Feddes G.O. Willett-Brozick J.E. Hsu L.C. DeLoia J.A. Baysal B.E. Coordinate up-regulation of TMEM97 and cholesterol biosynthesis genes in normal ovarian surface epithelial cells treated with progesterone: Implications for pathogenesis of ovarian cancer BMC Cancer 2007 7 223 10.1186/1471-2407-7-223 18070364 PMC2241839 78. Zhu H. Su Z. Ning J. Zhou L. Tan L. Sayed S. Song J. Wang Z. Li H. Sun Q. Transmembrane protein 97 exhibits oncogenic properties via enhancing LRP6-mediated Wnt signaling in breast cancer Cell Death Dis. 2021 12 912 10.1038/s41419-021-04211-8 34615853 PMC8494741 79. Xu X.Y. Zhang L.J. Yu Y.Q. Zhang X.T. Huang W.J. Nie X.C. Song G.Q. Down-regulated MAC30 expression inhibits proliferation and mobility of human gastric cancer cells Cell Physiol. Biochem. 2014 33 1359 1368 10.1159/000358703 24853233 80. Hong V.M. Rade A.D. Yan S.M. Bhaskara A. Yousuf M.S. Chen M. Martin S.F. Liebl D.J. Price T.J. Kolber B.J. Loss of Sigma-2 Receptor/TMEM97 Is Associated with Neuropathic Injury-Induced Depression-Like Behaviors in Female Mice eNeuro 2024 11 ENEURO.0488-23.2024 10.1523/ENEURO.0488-23.2024 38866499 PMC11228697 81. Wilson L.L. Alleyne A.R. Eans S.O. Cirino T.J. Stacy H.M. Mottinelli M. Intagliata S. McCurdy C.R. McLaughlin J.P. Characterization of CM-398, a Novel Selective Sigma-2 Receptor Ligand, as a Potential Therapeutic for Neuropathic Pain Molecules 2022 27 3617 10.3390/molecules27113617 35684553 PMC9182558 82. Intagliata S. Sharma A. King T.I. Mesangeau C. Seminerio M. Chin F.T. Wilson L.L. Matsumoto R.R. McLaughlin J.P. Avery B.A. Discovery of a Highly Selective Sigma-2 Receptor Ligand, 1-(4-(6,7-Dimethoxy-3,4-dihydroisoquinolin-2(1H)-yl)butyl)-3-methyl-1H-benzo[d]imidazol-2(3H)-one (CM398), with Drug-Like Properties and Antinociceptive Effects In Vivo AAPS J. 2020 22 94 10.1208/s12248-020-00472-x 32691179 83. Chuang J.Z. Yang N. Nakajima N. Otsu W. Fu C. Yang H.H. Lee M.P. Akbar A.F. Badea T.C. Guo Z. Retinal pigment epithelium-specific CLIC4 mutant is a mouse model of dry age-related macular degeneration Nat. Commun. 2022 13 374 10.1038/s41467-021-27935-9 35042858 PMC8766482 84. Son K.-N. Lee H. Lee S.M. Pierre-Jacques D. Shah D. Cologna S.M. Aakalu V.K. Identifying the crucial binding domain of histatin-1 to recombinant TMEM97 in activating chemotactic migration in human corneal epithelial cells Biochem. Biophys. Res. Commun. 2024 739 150991 10.1016/j.bbrc.2024.150991 39547121 PMC12138758 85. Lizama B.N. Keeling E. Cho E. Malagise E.M. Knezovich N. Waybright L. Watto E. Look G. Di Caro V. Caggiano A.O. Sigma-2 receptor modulator CT1812 alters key pathways and rescues retinal pigment epithelium (RPE) functional deficits associated with dry age-related macular degeneration (AMD) Sci. Rep. 2025 15 4256 10.1038/s41598-025-87921-9 39929889 PMC11810999 86. Walby G.D. Gu Q. Yang H. Martin S.F. Structure-Affinity relationships of novel sigma(2)R/TMEM97 ligands Bioorg. Chem. 2024 145 107191 10.1016/j.bioorg.2024.107191 38432153 87. Keefe R.S.E. Harvey P.D. Khan A. Saoud J.B. Staner C. Davidson M. Luthringer R. Cognitive Effects of MIN-101 in Patients With Schizophrenia and Negative Symptoms: Results from a Randomized Controlled Trial J. Clin. Psychiatry 2018 79 10.4088/JCP.17m11753 29873956 88. Scott L.L. Sahn J.J. Ferragud A. Yen R.C. Satarasinghe P.N. Wood M.D. Hodges T.R. Shi T. Prakash B.A. Friese K.M. Small molecule modulators of sigma2R/Tmem97 reduce alcohol withdrawal-induced behaviors Neuropsychopharmacology 2018 43 1867 1875 10.1038/s41386-018-0067-z 29728649 PMC6046036 89. Quadir S.G. Tanino S.M. Rohl C.D. Sahn J.J. Yao E.J. Cruz L.D.R. Cottone P. Martin S.F. Sabino V. The Sigma-2 receptor / transmembrane protein 97 (sigma2R/TMEM97) modulator JVW-1034 reduces heavy alcohol drinking and associated pain states in male mice Neuropharmacology 2021 184 108409 10.1016/j.neuropharm.2020.108409 33221481 PMC7856185 90. Izzo N.J. Staniszewski A. To L. Fa M. Teich A.F. Saeed F. Wostein H. Walko T. 3rd Vaswani A. Wardius M. Alzheimer’s therapeutics targeting amyloid beta 1-42 oligomers I: Abeta 42 oligomer binding to specific neuronal receptors is displaced by drug candidates that improve cognitive deficits PLoS ONE 2014 9 e111898 10.1371/journal.pone.0111898 25390368 PMC4229098 91. Izzo N.J. Yuede C.M. LaBarbera K.M. Limegrover C.S. Rehak C. Yurko R. Waybright L. Look G. Rishton G. Safferstein H. Preclinical and clinical biomarker studies of CT1812: A novel approach to Alzheimer’s disease modification Alzheimer’s Dement. 2021 17 1365 1382 10.1002/alz.12302 33559354 PMC8349378 92. Yi B. Sahn J.J. Ardestani P.M. Evans A.K. Scott L.L. Chan J.Z. Iyer S. Crisp A. Zuniga G. Pierce J.T. Small molecule modulator of sigma 2 receptor is neuroprotective and reduces cognitive deficits and neuroinflammation in experimental models of Alzheimer’s disease J. Neurochem. 2017 140 561 575 10.1111/jnc.13917 27926996 PMC5312682 93. Mavlyutov T.A. Li J. Liu X. Shen H. Yang H. McCurdy C.R. Pattnaik B. Guo L.W. Retinal Photoreceptor Protection in an AMD-Related Mouse Model by Selective Sigma-1 or Sigma-2 Receptor Modulation Genes 2022 13 2386 10.3390/genes13122386 36553653 PMC9778362 Figure 1 σ 2 2 2 2 biomolecules-15-01228-t001_Table 1 Table 1 Summary of the current research on σ 2 Pathology Model Pathway Effect on Pathway Resources Schizophrenia σ 2 Cognitive performance Increases [ 87 Alcohol dependence σ 2 Alcohol-withdrawal-induced excessive alcohol consumption, alcohol intake, and associated pain states Decreases [ 88 89 Alzheimer’s disease σ 2 Amyloid beta (Aβ) accumulation and synaptotoxicity Decreases [ 90 Alzheimer’s disease σ 2 Amyloid beta (Aβ) accumulation and synaptotoxicity Decreases [ 25 91 Alzheimer’s disease σ 2 Neuroprotection, cognitive performance, and inflammation Decreases [ 92 Parkinson’s disease σ 2 α-synuclein accumulation and neurotoxicity Decreases [ 67 Huntington’s disease σ 2 Neuronal toxicity Decreases [ 26 Traumatic brain injury σ 2 Neuronal degeneration Decreases [ 27 Ischemic retinal ganglion cell (RGC) injury σ 2 Ischemic injury causing RGC degeneration Decreases [ 29 Neuropathic pain σ 2 Activation of integrated stress response (ISR) drives neuropathic pain Decreases [ 23 54 72 Neuropathic pain σ 2 Formalin and thermal models; chronic nerve constriction injury Decreases [ 81 82 AMD σ 2 Photoreceptor loss Decreases [ 93 AMD σ 2 Aβ-mediated and oxidative stress-mediated photoreceptor outer segment (POS) trafficking Decreases [ 85 ",
  "metadata": {
    "Title of this paper": "Retinal Photoreceptor Protection in an AMD-Related Mouse Model by Selective Sigma-1 or Sigma-2 Receptor Modulation",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467532/"
  }
}