{
  "title": "Paper_349",
  "abstract": "ACS Pharmacol Transl Sci ACS Pharmacol Transl Sci 3799 acspts pt ACS Pharmacology & Translational Science 2575-9108 American Chemical Society PMC11555507 PMC11555507.1 11555507 11555507 39539272 10.1021/acsptsci.4c00415 1 Article Flavokavains A-\nand B-Free Kava Enhances Resilience\nagainst the Adverse Health Effects of Tobacco Smoke in Mice Bian Tengfei † Lynch Allison † https://orcid.org/0009-0006-0218-2196 Ballas Kayleigh † Mamallapalli Jessica † Freeman Breanne † Scala Alexander † Wang Yifan † Traboulsi Hussein # Chellian Ranjith kumar ⊥ Fagan Amy ∥ Tang Zhixin § Ding Haocheng § De Umasankar ‡ Fredenburg Kristianna M. ‡ Huo Zhiguang § Baglole Carolyn J. # Zhang Weizhou ‡ Reznikov Leah R. ∥ Bruijnzeel Adriaan W. ⊥ https://orcid.org/0000-0002-4266-6236 Xing Chengguo * † † University of Florida United States ‡ University of Florida United States § University of\nFlorida United States ∥ University of Florida United States ⊥ University\nof Florida United States # Research Institute\nof the McGill University Health Center (RI-MUHC) Canada * chengguoxing@cop.ufl.edu 352-294-8511 02 10 2024 08 11 2024 7 11 474816 3502 3517 16 07 2024 26 09 2024 18 09 2024 02 10 2025 02 10 2025 13 11 2024 02 10 2025 © 2024 American Chemical Society 2024 American Chemical Society AB-free kava enhances resilience against the adverse health effects of tobacco smoke in mice 29 6 2024 2024.06.25.599576 bioRxiv 10.1101/2024.06.25.599576 PMC11230230 38979295 Tobacco\nsmoke remains a serious global issue, resulting\nin serious\nhealth complications, contributing to the onset of numerous preventive\ndiseases and imposing significant health burdens. Despite regulatory\npolicies and cessation measures aimed at curbing its usage, novel\ninterventions are urgently needed for effective damage reduction.\nOur preclinical and pilot clinical studies showed that AB-free kava\nhas the potential to reduce tobacco-smoking-induced lung cancer risk,\nmitigate tobacco dependence, and reduce tobacco use. To understand\nthe scope of its benefits in damage reduction and potential limitations,\nthis study evaluated the effects of AB-free kava on a panel of health\nindicators in mice exposed to 2–4 weeks of daily tobacco smoke\nexposure. Our assessments included global transcriptional profiling\nof the lung and liver tissues, analysis of lung inflammation, evaluation\nof lung function, exploration of tobacco nicotine withdrawal, and\ncharacterization of the causal protein kinase A (PKA) signaling pathway.\nAs expected, tobacco smoke exposure perturbed a wide range of biological\nprocesses and compromised multiple functions in mice. Remarkably,\nAB-free kava demonstrated the ability to globally mitigate tobacco\nsmoke-induced deficits at the molecular and functional levels with\npromising safety profiles, offering AB-free kava unique promise to\nmitigate tobacco smoke-related health damages. Further preclinical\nevaluations are warranted to fully harness the potential of AB-free\nkava in combating tobacco smoke-related harms in the preparation of\nits clinical translation. tobacco smoke AB-free kava\nglobal effects inflammation withdrawal lung function National Institutes of Health 10.13039/100000002 HL152101 Florida Department of Health 10.13039/100006827 23B02 Cystic Fibrosis Foundation 10.13039/100000897 REZNIK23Y3 National Institute on Drug Abuse 10.13039/100000026 DA046411 National Institutes of Health 10.13039/100000002 T32CA257923 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 pt4c00415 document-id-new-14 pt4c00415 ccc-price ",
  "metadata": {
    "Title of this paper": "\nAB-free kava enhances resilience against the adverse health effects of tobacco smoke in mice\n",
    "Journal it was published in:": "ACS Pharmacology & Translational Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11555507/"
  }
}