{
  "title": "Paper_645",
  "abstract": "pmc World J Clin Oncol 1494 wjco WJCO World Journal of Clinical Oncology 2218-4333 Baishideng Publishing Group Inc PMC12476609 PMC12476609.1 12476609 12476609 41024842 10.5306/wjco.v16.i9.109034 jWJCO.v16.i9.eid109034 1 Systematic Reviews Advancing gastric cancer treatment: A comprehensive review of hyperthermic intraperitoneal chemotherapy’s role and outcomes D'Acapito F et al D'Acapito Fabrizio Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Forli 47121, Emilia-Romagna, Italy. fabrizioda@gmail.com Framarini Massimo Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Forli 47121, Emilia-Romagna, Italy Morgagni Paolo Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Forli 47121, Emilia-Romagna, Italy Di Pietrantonio Daniela Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Forli 47121, Emilia-Romagna, Italy Vittimberga Giovanni Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Forli 47121, Emilia-Romagna, Italy Zucchini Valentina Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Forli 47121, Emilia-Romagna, Italy Ercolani Giorgio Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Forli 47121, Emilia-Romagna, Italy Department of Medical and Surgical Sciences, University of Bologna, Bologna 40126, Emilia-Romagna, Italy Author contributions: D’Acapito F wrote the original draft; Framarini M and Morgagni P contributed to conceptualization, writing, reviewing and editing; Di Pietrantonio D, Vittimberga G, Zucchini V and Ercolani G participated in drafting the manuscript; D’Acapito F, Framarini M, Morgagni P, Di Pietrantonio D, Vittimberga G and Zucchini V done studies initial screening; all authors have read and approved the final version of the manuscript. Corresponding author: Fabrizio D'Acapito, PhD, Consultant, Department of General and Oncologic Surgery, Morgagni-Pierantoni Hospital, AUSL Romagna, Via Carlo Forlanini 34, Forli 47121, Emilia-Romagna, Italy. fabrizioda@gmail.com 24 9 2025 24 9 2025 16 9 497728 109034 28 4 2025 26 5 2025 8 8 2025 24 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Peritoneal metastases (PM) represent the most frequent and lethal form of dissemination in advanced gastric cancer (GC), with limited efficacy of systemic chemotherapy [median overall survival (OS): 2-9 months]. Over the past decades, hyperthermic intraperitoneal chemotherapy (HIPEC), often combined with cytoreductive surgery (CRS), has emerged as a locoregional strategy to improve peritoneal disease control. Retrospective studies have suggested promising survival benefits (median OS: 18.8 months); however, conflicting results from prospective trials have limited its widespread adoption. This systematic review hypothesizes that selected patients with advanced or high-risk GC may benefit from HIPEC and evaluates whether such benefits have been confirmed in recent prospective evidence. AIM To evaluate the role and outcomes of HIPEC in advanced and high-risk GC through a systematic review of prospective trials. METHODS A systematic review of prospective randomized and controlled clinical trials (2010-2024) was performed in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews guidelines. Studies were selected from PubMed, Cochrane, Scopus, and ClinicalTrials.gov. No geographical restrictions were applied in the search process. Eligible studies included patients with advanced GC (T3+, positive peritoneal cytology/PM) receiving HIPEC in either therapeutic or prophylactic settings. Exclusion criteria included retrospective studies, single-arm trials, and those lacking survival outcomes. Risk of bias was assessed using Risk of Bias 2.0 and Risk of Bias in Non-Randomized Studies of Interventions tools; sensitivity and heterogeneity analyses were also conducted. RESULTS Thirteen prospective studies (eight therapeutic, five prophylactic) were included. In therapeutic settings, CRS combined with HIPEC yielded a median OS of 11-24.9 months vs CONCLUSION HIPEC may improve survival and reduce recurrence in selected GC patients, particularly those with low peritoneal burden and CC-0 resection. Further standardization and prospective trials are needed. Gastric cancer Peritoneal metastasis Hyperthermic intraperitoneal chemotherapy Clinical trial Outcomes pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Gastric cancer (GC) is a biologically heterogeneous for lymphatic, hematogenous, and intra-abdominal spread. As the fourth leading cause of cancer-related mortality worldwide, it continues to pose a significant clinical burden[ 1 2 3 4 et al 5 6 Systemic chemotherapy remains the standard of care for patients with advanced GC patients with PM. According to both Japanese and American Joint Committee on Cancer guidelines, the presence of tumor CY+ is classified as metastatic disease and managed accordingly[ 7 8 9 Despite progress in immunotherapy and targeted treatments, palliative chemotherapy and best supportive care remain the primary strategies for stage IV GC, as recommended by both the National Comprehensive Cancer Network and ESMO[ 10 11 More than three decades ago, Sugarbaker et al 12 13 Studies such as CYTO-CHIP have documented 5-year OS of 26.21% and median OS of 18.8 months with 3-year and 5-year disease-free survival (DFS) of 20.4% and 17.05%, respectively[ 14 et al 15 et al 16 et al 17 17 18 19 20 This systematic review was designed to evaluate whether the encouraging outcomes reported in retrospective studies for both therapeutic and prophylactic HIPEC-particularly in terms of OS and DFS/relapse-free survival (RFS)-have been confirmed by prospective randomized or controlled clinical trials published over the last 15 years. A secondary aim was to assess whether universally accepted criteria for selecting candidates for HIPEC have emerged in either setting, and to investigate persisting divergences in the design of systemic chemotherapy and HIPEC protocols across studies. Unlike prior meta-analyses, including the 2021 Cochrane review that concluded evidence was insufficient to support routine HIPEC use in GC, this study focuses exclusively on prospective evidence to address the current gaps in knowledge. This study aims to systematically review RCTs and controlled trials (CTs) published since 2010 to evaluate the role and clinical impact of HIPEC in the management of advanced GC. We have excluded data on pressurized intraperitoneal aerosol chemotherapy (PIPAC), as it is currently regarded as a palliative measure. According to a recent meta-analysis by Di Giorgio et al 21 MATERIALS AND METHODS Study inclusion This systematic review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews guidelines. A systematic literature search was performed in PubMed, Cochrane Library, Scopus, and ClinicalTrials.gov between November 2024 and January 2025, without language restrictions. We identified studies published between January 2010 and December 2024. No geographical restrictions were applied in the search process, and studies were included irrespective of their region of origin, allowing for a comprehensive comparison between Asian and Western clinical practices. Eligible studies included both randomised and non-randomised prospective clinical trials evaluating the treatment outcomes of using HIPEC in neo-adjuvant, adjuvant or prophylactic setting in patients with advanced GC (T ≥ 3 or nodal positive disease) or metastatic disease (CY+ or macroscopic PM) associated or not with CRS. The following MeSH terms and their variations were adapted for each database using advanced search tools: \"Stomach Neoplasms/therapy\", \"Peritoneal Neoplasms/therapy\", \"Hyperthermic Intraperitoneal Chemotherapy\", \"Combined Modality Therapy\", and \"Humans\". There were no restrictions on the time interval between GC diagnosis and surgical intervention, allowing for the inclusion of studies assessing both adjuvant and prophylactic HIPEC strategies. Articles without full-text access or published prior to 2010 were excluded, given the substantial improvements in study methodologies resulting from recent advances in diagnosing and treating stage IV GC. For duplicate publications, only the most recent and comprehensive version was considered. The exclusion criteria were: (1) Single-arm studies; (2) Retrospective studies; (3) Case reports; (4) Editorials; (5) Reviews; (6) Studies lacking survival outcomes (OS or DFS/RFS); and (7) Those not reporting HIPEC-specific protocols. Statistical analysis Study quality and risk of bias were assessed using validated tools. For RCTs, the Cochrane Risk of Bias 2.0 tool (ROB 2.0) was used[ 22 23 24 A data charting form was independently developed by one reviewer to determine the variables to be extracted. This form was then discussed within the review team and continuously refined through an iterative process. The extracted data included study characteristics ( e.g. Definitions Peritoneal cancer index (PCI) is a clinical integration of both peritoneal implant size and distribution of nodules on the peritoneal surface, and should be used in the decision of making process as the abdomen is completely explored. The lesion size 0-3 (nodule diameter) and the involvement of abdomino-pelvic regions (0-12) are combined[ 25 CRS consists of the set of techniques required to complete six different peritonectomy procedures used to resect cancer on the visceral intra-abdominal surface or to remove cancer from the parietal peritoneal surface. One or all six of these procedures may required, depending on the distribution and volume of peritoneal carcinomatosis (PC)[ 26 Completeness of cytoreduction (CC-0) score measures the largest residual tumor nodule at the completion of cancer resection. CC-0 defines no residual peritoneal lesions within the operative field, CC-1 refers to persisting nodules < 2.5 cm after CRS, CC-2 indicates nodules between 2.5 cm and 5 cm, and CC-3 refers to nodules > 5 cm or confluent unresectable tumor nodules[ 25 RESULTS A total of 85 studies were identified after duplicate removal. Initial screening based on titles and abstracts was conducted by six reviewers, leading to the selection of 15 articles for full-text assessment. The 15 articles were derived from 13 studies, as 2 studies produced two articles each. Inclusion was determined based on predefined selection criteria, and any disagreements were resolved through discussion until a consensus was reached (Figure 1 Figure 1 Preferred Reporting Items for Systematic Reviews and Meta-Analyses flow diagram for the systematic review. RCTs and CTs have investigated the use of HIPEC in two main settings. The former examines the therapeutic role of HIPEC in stage IV GC, defined by either CY+ or macroscopic PC. In this context, we analyzed three RCTs[ 27 29 30 35 The latter explores the prophylactic use of HIPEC in stage III GC. Here, we reviewed five RCTs[ 36 40 Therapeutic use of HIPEC-results Eight prospective studies have investigated the therapeutic role of HIPEC in patients with GC and PM. However, these studies exhibit substantial heterogeneity in terms of inclusion criteria, disease burden ( Tables 1 2 Tables 3 4 27 30 31 34 35 Table 1 Therapeutic use of hyperthermic intraperitoneal chemotherapy, randomized controlled trials: Study and population characteristics  Year  Ref./trial  Arms  Patients cohort  Oncologic exclusion criteria  CY+  PCI  Ascites  Liver mets  Lung mets  Syncronous/metachronous (PM/CY+) 2011 Yang et al 27 Arm 1: CRS-A ( n n 68 Any lung metastasis, liver metastasis, prominent retroperitoneal lymph node metastasis ND CRS-H arm: 2-36 (median: 15). CRS-A arm: 3-23 (median: 15) ND No No Synchronous [PM ( n n 2014 Rudloff/GYMSSA Arm 1: FOLFOXIRI alone arm-S. Cht ( n n 17 Disease sites other than either peritoneum, lung or liver. Evidence of extensive para-aortic/retro-pancreatic lymph node metastases. Significant ascites Yes GYMS arm: PCI ≤ 20, n n No Yes Yes Synchronous [PM ( n n n 2023 Rau/GASTRIPEC-I Arm 1: CRS-A ( n n 105 Further distant metastases except Krukenberg tumors. Pretreated with chemotherapy/radiotherapy No PCI ≥ 7 (44%) Yes (40%) No No Synchronous [PM ( n CRS-A: Cytoreductive surgery alone; CRS-H: Cytoreductive surgery combined with hyperthermic intraperitoneal chemotherapy; CY+: Positive peritoneal cytology; GYMS: Hyperthermic intraperitoneal chemotherapy + systemic FOLFOXIRI; ND: Not declared; PCI: Peritoneal cancer index; PM: Peritoneal metastases; S. Cht: Systemic chemotherapy. Table 2 Therapeutic use of hyperthermic intraperitoneal chemotherapy, controlled trials: Study and population characteristics  Year  Ref./trial  Controlled trial phase  Patient cohort  Positive peritoneal cytology  PCI  Median PCI  Ascites  N stage  Syncronous metastasis only 2020 Blum Murphy et al 31 1 27 Yes < 8 (52%), 8-14 (15%), 15-21 (11%), > 21 (22%) 6 Admitted (41%) ND Yes 2020 Yu et al 30 2 38 Yes ≤ 20 (100%) 8.8 Admitted 72.2% ypN+ (convertion to surgery group) Yes 2020 PERISCOPE 1 1 and 2 25 Yes < 7 (100%) 2 ND 68% ypN+ Yes 1 2021 Badgwell et al 35 2 20 Yes 0 (40%), 1-2 (35%), > 3 (25%) ND ND 70% ypN+ Yes 2023 Green et al 34 2 41 Yes ≤ 10 (100%) 2 Excluded if > 500 cc 68% ypN+ Yes 1 Small bowel or mesenteric localizations were excluded. All patients have peritoneal metastases or positive peritoneal cytology and no liver or lung metastasis. ND: Not declared; PCI: Peritoneal cancer index. Table 3 Therapeutic use of hyperthermic intraperitoneal chemotherapy, randomized controlled trials: Treatments and outcomes  Year  Ref./trial  Hyperthermic intraperitoneal chemotherapy protocol  Completeness of cytoreduction score (CC 0-1)  Neodjuvant Cht  Neoadjuvant treatment regimen  Adjuvant Cht  Adjuvant treatment regimen  Median OS (month)  1 year OS  2 years OS  3 years OS  Median relapse-free survival (month) 2011 Yang et al 27 Cisplatin 120 mg + mitomycin C 30 mg for 60-90 minutes CRS-A: 58.8% (20 of 34), CRS-H: 58.8% (20 of 34) No No Yes ND CRS-A: 6.5 months vs CRS-A: 29.4% vs CRS-A: 5.9% vs CRS-A: 0% vs ND 2014 Rudloff/GYMSSA Oxaliplatin 460 mg/m 2 2 2 CRS-H: 88.8% (8 of 9) Yes. GYMS arm ( n n ND Yes FOLFOXIRI SA arm: 4.3 months vs SA arm: 0% vs SA arm: 0% vs SA arm: 0% vs ND 2023 Rau/GASTRIPEC-I Mitomycin C 15 mg/m 2 2 CRS-A: 41.5% (22 of 53), CRS-H: 53.8% (28 of 52) Yes (all) HER-2+: Cisplatin, capecitabine, trastuzumab; HER-2-: Epirubicin, oxaliplatin, capecitabine Yes HER-2+: Cisplatin, capecitabine, trastuzumab; HER-2-: Epirubicin, oxaliplatin, capecitabine or fluorouracil, leucovorin, oxaliplatin, and docetaxel CRS-A: 14.9 months vs CRS-A: 60.5% vs CRS-A: 15.4% vs CRS-A: 0% vs CRS-A: 3.5 months vs CRS-A: Cytoreductive surgery alone; CRS-H: Cytoreductive surgery combined with hyperthermic intraperitoneal chemotherapy; Cht: Chemotherapy; GYMS: Hyperthermic intraperitoneal chemotherapy + systemic FOLFOXIRI; HER-2: Human epidermal growth factor receptor 2; ND: Not declared; OS: Overall survival; SA: FOLFOXIRI alone. Table 4 Therapeutic use of hyperthermic intraperitoneal chemotherapy, controlled trials: Treatments and outcomes (all patients received neoadjuvant systemic chemotherapy)  Year  Ref./trail  Patient cohort  S. Cht protocol  S. Cht cycles  N-HIPEC  Laparoscopic N-HIPEC  N-HIPEC protocol  N-HIPEC cycles  Convertion to surgery  T-HIPEC protocol  NIPEC  Adjuvant HIPEC bed site  OS media  1 year OS  2 years OS  3 years OS  Relapse-free survival media (month) 2020 Blum Murphy et al 31 27 5-FU/OX ( n n 9 (range 4-24) Yes 27 patients Mitomycin C (30 mg) + cisplatin (200 mg). Paclitaxel (dosing was started at 20 mg/m 2 2 1 CRS-H (6/27), CRS-A (1/27) 25.9% ND No No ND 73.9% 58.1% ND ND 2020 Yu et al 30 38 Pacli + S1 (Transtuzumab added in HER-2+) 4 Yes No Paclitaxel (75 mg/m 2 2 18 (47.4%) Paclitaxel (75 mg/m 2 No Yes (twice within 72 hours after CRS) Conversion therapy group 21.1 months 63.2% 47.40% ND ND 2020 Koemans/PERISCOPE 1 25 Epirubicin + cisplatin + capecitabin ( n n n n n 3 No No No No No Oxaliplatin (460 mg/sm) for 30 minutes Docetaxel for 90 minutes in a dose-level escalation scheme (0, 50, 75 mg/m 2 No 15 months ND ND ND 12 months 2021 Badgwell et al 35 20 5-FU+ OX ( n n < 8 (20%), 8-10 (75%), > 10 (5%) Yes 20 patients Mitomycin C (30 mg) + cisplatin (200 mg) for 60 minutes 2 ( n n No Mitomycin C (30 mg) + cisplatin (200 mg) for 60 minutes No No 22.1 months 90% 50% 28% ND 2023 Green et al 34 41 Fluoruracil, leucovorin, oxaliplatin (56%), fluorouracil, leucovorin, oxaliplatin, and docetaxel (24%), radiotherapy (17%) ND Yes 23 patients Cisplatin (90 mg/mq) + mitomycin C (10 mg/mq or 30 mg/mq) for 60 minutes 1 or 2 No Cisplatin (90 mg/mq) + mitomycin C (10 mg/mq) for 60 minutes No No 24.9 months ND ND 25% 7.4 months CRS: Cytoreductive surgery; HER-2: Human epidermal growth factor receptor 2; HIPEC: Hyperthermic intraperitoneal chemotherapy; ND: Not declared; OS: Overall survival; OX: Oxaliplatin; S. Cht: Systemic chemotherapy; 5-FU: 5-fluorouracil. Inclusion criteria varied considerably. For example, the GYMSSA trial enrolled patients with extra-PM, including hepatic and pulmonary lesions, whereas the GASTRIPEC-I trial restricted inclusion to patients with synchronous exclusive PM, low disease burden, following neoadjuvant chemotherapy[ 28 29 et al 30 et al 31 et al 31 et al 39 Most trials did not impose an upper limit on the PCI, resulting in significant variability in baseline tumor burden. Systemic chemotherapy protocols differ widely, incorporating regimens such as FOLFOXIRI, paclitaxel, and various platinum-based combinations, therapies administered at different phases of treatment. Similarly, HIPEC protocols varied in intraperitoneal agent selection ( e.g. 32 33 This lack of standardization complicates the interpretation of oncologic endpoints such as OS and DFS, both of which are closely influenced by initial disease burden and the CC-0. Among patients undergoing CRS-H in RCTs, CC-0/1 was achieved in 67.3% of cases. Improved survival was strongly associated with CC-0 and receipt of intraperitoneal chemotherapy, with median OS ranging from 11 months to 24.9 months in CRS-H cohorts, compared to 4-6 months in patients treated with surgery alone or systemic therapy only. Similarly, DFS outcomes were significantly improved in HIPEC arms, as demonstrated in GASTRIPEC-I (7.1 months vs P 29 33 Therapeutic use of HIPEC–heterogeneity analyses, sensitivity analysis and risk of bias In RCTs the heterogeneity assessment revealed moderate clinical variability, particularly in patient selection criteria and systemic chemotherapy regimens[ 27 29 e.g. 30 31 35 Sensitivity analyses, in RCTs, confirmed that the observed OS benefit of HIPEC was primarily driven by the Yang et al 27 27 29 The sensitivity analysis in CTs showed that sequential exclusion of studies with moderate to serious risk of confounding or missing data did not significantly alter the qualitative outcomes regarding OS and DFS. The removal of early-phase feasibility data (MD Anderson Phase I) resulted in a slight upward shift in reported median OS (from 15-25 months to 20-24 months). Excluding PERISCOPE-I extended analysis did not impact the overall conclusions. Overall, the observed survival benefit of HIPEC in GC with peritoneal dissemination remained consistent across sensitivity scenarios[ 30 31 35 The risk of bias assessment in RCTs using the ROB 2.0 tool identified two trials (Wuhan Phase III and GASTRIPEC-I) as low risk across all domains. The GYMSSA trial presented some concerns related to the randomization process and selective reporting. Overall, the RCTs included were methodologically sound, supporting a moderate level of confidence in their findings[ 27 29 The risk of bias across the included non-randomized prospective cohort studies was systematically assessed using the ROBINS-I tool. All six studies demonstrated a serious overall risk of bias. Specifically, participant selection was deemed at serious risk in all cases, as HIPEC was offered to highly selected patients based on clinical eligibility and surgical resectability, limiting external validity. Missing data was generally well managed, with low risk in most studies, except for a single study reporting moderate concerns due to incomplete follow-up data. Measurement of outcomes[ 30 31 35 Prophylactic use of HIPEC Five RCTs have evaluated the prophylactic use of HIPEC in patients with locally advanced GC (Tables 5 6 36 40 et al 38 38 Table 5 Prophylactic use of hyperthermic intraperitoneal chemotherapy, randomized controlled trials: Study and population characteristics, treatments and outcomes  Year  Ref.  State  Arms  Patient cohort  HIPEC sample  Oncological admission criteria (TNM stage)  Bedsite HIPEC  HIPEC protocol  Neoadjuvant CHT  Neoadjuvant treatment regimen  Adjuvant Cht  Adjuvant treatment regimen 2014 Cui et al 36 China Arm 1: Surgery alone ( n n n n 192 Arm 3 + 4: n IIIA-IIIC + no Neoadjuvant Cht before enrollement Yes Day 1 and 4: 60 mg/m 2 Yes Paclitaxel, cisplatin, tegafur Yes, if tumor progression occurred during neodjuvant treatment Epirubicin, cisplatin, fluorouracil 2019 Reutovich et al 37 Belarus Arm 1: Gastrectomy + HIPEC ( n n 154 76 IIB-IIIC + Borrmann type III-IV No Cisplatin 50 mg/m 2 2 No _ No Not declared 2021 Fan et al 38 China Arm 1: S.Cht ( n n 50 33 IIIA-B No Cisplatin (50 mg/L), 30 minutes No _ Yes S1 + oxaliplatin 2022 Liu et al 39 China 4 weeks after D2 gastrectomy: Arm 1: Bedside HIPEC + oral S1 treatment; arm 2: IV cisplatin + oral S1 treatment 114 57 III A-B Yes Day 1 and 3: Cisplatin (30 mg/m 2 No _ Yes 6-8 cycles of IV cisplatin (60 mg/m 2 2023 Yu et al 40 China Arm 1: HIPEC + Cht. Arm 2: Systemic chemotherapy alone 134 67 IIIA and B + no Neoadjuvant Cht before enrollement Yes Cisplatin (40 mg/m 2 No _ Yes 6-8 cycles of S1 + oxaliplatin Cht: Chemotherapy; HIPEC: Hyperthermic intraperitoneal chemotherapy; T-HIPEC: Traditional hyperthermic intraperitoneal chemotherapy; S. Cht: Systemic chemotherapy. Table 6 Prophylactic use of hyperthermic intraperitoneal chemotherapy, randomized controlled trials: Studies outcomes  Year  Ref.  State  Arms  Median OS  1 year OS  3 years OS  Median RFS  RFS 2 years  RFS 3 years  Peritoneal recurrence 2014 Cui et al 36 China Arm 1: Surgery alone ( n n n n Arm 1: 27 months. Arm 2: 33 months. Arm 3: 32 months. Arm 4: 36 months Arm 1: 79.2%. Arm 2: 87.5%. Arm 3: 85.4%. Arm 4: 93.7% Arm 1: 35.4%. Arm 2: 62.5%. Arm 3: 58.3%. Arm 4: 75.0% Arm 1: 26 months. Arm 2: 28 months. Arm 3: 31 months. Arm 4: 33 months Arm 1: 66.7%. Arm 2: 77.1%. Arm 3: 83.3%. Arm 4: 87.5% ND ND 2019 Reutovich et al 37 Belarus Arm 1: Gastrectomy + HIPEC ( n n ND ND ND Arm 1: 28 months vs ND Arm 1: 47% vs 12.8% vs 2021 Fan et al 38 China Arm 1: S. Cht ( n n ND ND Arm 1: 100% vs ND ND Arm 1: 88.2% vs ND 2022 Liu et al 39 China 4 weeks after D2 gastrectomy: Arm 1: Bedside HIPEC + oral S-1 treatment; arm 2: IV cisplatin + oral S-1 treatment Arm 1: 42 months vs ND ND Arm 1: 29 months vs Arm 1: 50.4% vs ND 0% vs 2023 Yu et al 40 China Arm 1: HIPEC + Cht. Arm 2: Systemic chemotherapy alone 51.4 months ND Arm 1: 73.9% vs ND ND Arm 1: 73.8% vs 20.9% vs Cht: Chemotherapy; HIPEC: Hyperthermic intraperitoneal chemotherapy; ND: Not declared; OS: Overall survival; RFS: Relapse-free survival; S. Cht: Systemic chemotherapy. All trials included at least two comparative arms: CRS alone (CRS-A) vs et al 36 All HIPEC protocols employed intraperitoneal cisplatin (30-60 mg/m²). In addition, Reutovich et al 37 et al 36 37 38 et al 36 et al 39 et al 40 37 38 et al’ 36 et al 40 et al 39 Systemic adjuvant chemotherapy was included in three of the five trials. While Fan et al 38 et al 40 et al 39 The Fan et al 38 et al 36 et al 37 et al 39 et al 40 et al 36 et al 40 Prophylactic use of HIPEC–heterogeneity analyses, sensitivity analysis and risk of bias Although the included RCTs share similar endpoints, moderate heterogeneity exists across the studies in terms of patient selection (T4-only vs vs vs 36 40 Sensitivity analyses were performed to assess the robustness of the observed benefit of prophylactic HIPEC in patients with locally advanced GC. A leave-one-out approach demonstrated that the overall direction of effect—favoring HIPEC for improved DFS—was consistent across studies[ 36 40 et al 37 et al 40 vs vs vs Publication bias was evaluated qualitatively given the limited number of eligible trials ( n 36 40 DISCUSSION Therapeutic use of HIPEC Although retrospective studies have suggested a survival benefit from HIPEC in GC, these findings have not been consistently confirmed by RCTs or CTs[ 14 41 Patients with A-CY+ status often exhibit survival outcomes similar to those with macroscopic PM. In a nationwide study by van der Sluis et al 42 vs 14 Some retrospective studies have included patients with serosal invasion-acknowledging its high risk for peritoneal dissemination-under the concept of “ongoing peritoneal carcinomatosis”[ 43 The extent of peritoneal disease, as measured by PCI, is a critical prognostic factor. Retrospective analyses consistently identify PCI < 7 as the threshold for achieving CC-0 and potential long-term survival. Chia et al 44 44 et al 45 46 41 There is significant heterogeneity in PCI thresholds among RCTs. Yang et al 27 28 29 et al 31 et al 35 et al 30 33 34 Ascites is another variable inconsistently reported-excluded in GYMSSA, unmentioned in Yang et al 27 28 29 47 48 vs 49 50 51 Lymph node involvement, a well-established negative prognostic factor remains underexplored. Green et al 34 e.g. et al 52 et al 53 e.g. et al 54 GYMSSA remains the only reviewed study to include patients with lung and liver metastases. However, it imposed a numeric limit on liver lesions without providing justification[ 28 55 Multimodal approaches are increasingly adopted, incorporating both preoperative systemic and intraperitoneal chemotherapy. Notable strategies include neoadjuvant intraperitoneal and systemic chemotherapy, as seen in the work of Yonemura et al 56 et al 57 1 ( 58 HIPEC protocols lack standardization, varying in chemotherapeutic agents (cisplatin, mitomycin, paclitaxel, oxaliplatin, 5-FU), temperatures (40-43.5 °C), and durations (30-120 minutes). Kusamura et al 59 Gronau et al 60 et al 61 vs vs 62 The limited drug residence time in HIPEC (60-90 minutes) restricts penetration into subperitoneal lymphatics. Alternative strategies, such as repeated HIPEC sessions and chemotherapy gels, aim to extend peritoneal drug exposure[ 63 et al 64 vs P et al 55 et al 65 Despite these advances, logistical challenges persist. Standardizing protocols across centers is difficult, and systemic chemotherapy often depends on local oncologist discretion. Recruitment remains a barrier, as evidenced by the premature termination of GASTRIPEC due to slow accrual. The Chicago Working Group has advocated using national registry data to mitigate such limitations[ 66 Optimal cytoreduction (CC-0) remains the most important prognostic factor. RCTs confirm the safety of CRS + HIPEC, but OS benefits are largely confined to patients with CC-0. In the CYTO-CHIP study (2019), CC-0 patients had significantly better OS than CC-1[ 14 et al 67 vs et al 68 vs P However, when comparing recent HIPEC trials to retrospective series, no substantial improvement in OS or DFS has been observed with traditional HIPEC. This may be due to limited sample sizes-across three RCTs, only 95 patients were enrolled in CRS-H arms, and just 71 completed treatment. Of these, 78.8% achieved CC-0 or CC-1. In the GASTRIPEC-I trial, the median OS was identical in both study arms (14.9 months for CRS plus HIPEC and CRS-A). However, a notable divergence was observed in the 3-year OS rates 13.6% in the CRS-H group vs 29 Notably, non-traditional applications of HIPEC, particularly in neoadjuvant settings, appear more promising, with conversion surgery yielding substantial survival benefits. Currently, two Western trials (PERISCOPE II and NCT 04107077 69 Prophylactic use of HIPEC The peritoneal cavity remains the most common site of tumor recurrence following radical gastrectomy with D2 Lymphadenectomy in patients with locally advanced GC. The current standard perioperative approach involves systemic chemotherapy; however, peritoneal relapse still occurs in approximately 40% of cases despite appropriate treatment[ 70 Administering chemotherapy directly into the peritoneal cavity exploits the blood-peritoneal barrier, which limits systemic absorption and allows for higher local drug concentrations with reduced systemic toxicity[ 11 A retrospective study reported the presence of cancer cells in the peritoneal lavage fluid of 29.7% of T3 and 34.8% of T4 patients after radical surgery. Furthermore, PM developed in 59.4% of these patients within five years, compared to 21.3% who experienced hematogenous spread[ 71 et al 72 Despite these encouraging findings, prophylactic HIPEC has not yet been adopted as a standard adjuvant therapy in Western clinical practice. Most of the supporting evidence comes from Asian studies, and the reliance on cTNM staging for patient selection in the absence of PM presents a significant limitation[ 1 Nevertheless, the available data consistently support the role of prophylactic HIPEC in improving locoregional disease control. With the exception of Fan et al 38 et al 40 Cui et al 36 Currently, four Western trials (GASTRICHIP, PREVENT, CHIMERA, and GOETH) and three Chinese trials ( NCT 02356276 NCT02960061 NCT02381847 73 74 CONCLUSION The integration of HIPEC into the multidisciplinary management of advanced GC remains an area of active investigation, supported by promising-but heterogeneous-clinical evidence. While select studies have demonstrated survival benefits, these are most apparent in patients undergoing CC-0, with low peritoneal disease burden and favorable biological response to systemic chemotherapy. The growing interest in neoadjuvant and conversion strategies, including minimally invasive approaches such as bedside or laparoscopic HIPEC, has shown potential in downstaging disease and enabling curative-intent surgery in patients initially deemed unresectable. However, at present, this therapeutic strategy may be best regarded as a means of prolonging survival, rather than achieving cure[ 75 Further randomized trials will be necessary to assess the impact of emerging targeted therapies-both systemic and intraperitoneal-on clinical outcomes in this patient population. Prophylactic HIPEC appears to be effective in reducing the incidence of peritoneal recurrence, particularly when used in conjunction with systemic chemotherapy. Nevertheless, significant challenges remain, including the lack of standardized treatment protocols, heterogeneity in systemic therapy regimens, and variability in patient selection criteria. It is desirable that international societies focused on peritoneal disease, particularly PSOGI-the peritoneal surface oncology group international society and ISSPP-international society for study of pleura and peritoneum, take an active role in promoting the standardization of treatment protocols. Ultimately, the reviewed literature highlights the critical importance of rigorous patient selection in optimizing outcomes. Despite the variability across studies, the addition of HIPEC-whether for therapeutic or prophylactic purposes-has been associated with improved outcomes, particularly in terms of DFS. Continued research and harmonization of treatment protocols are essential to fully define HIPEC’s role within the broader therapeutic landscape of GC. We are hopeful that the results of ongoing studies will contribute significantly to the advancement of knowledge about this multimodal approach in both therapeutic and prophylactic settings. ACKNOWLEDGEMENTS We thank Prof. Cucchetti A for suggestions and support in performing the qualitative analyses of the reviewed studies.  Conflict-of-interest statement:  PRISMA 2009 Checklist statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J Clin 2021 71 209 249 33538338 10.3322/caac.21660 2 Rijken A Lurvink RJ Luyer MDP Nieuwenhuijzen GAP van Erning FN van Sandick JW de Hingh IHJT The Burden of Peritoneal Metastases from Gastric Cancer: A Systematic Review on the Incidence, Risk Factors and Survival J Clin Med 2021 10 4882 34768402 10.3390/jcm10214882 PMC8584453 3 Thomassen I van Gestel YR van Ramshorst B Luyer MD Bosscha K Nienhuijs SW Lemmens VE de Hingh IH Peritoneal carcinomatosis of gastric origin: a population-based study on incidence, survival and risk factors Int J Cancer 2014 134 622 628 23832847 10.1002/ijc.28373 4 Seyfried F von Rahden BH Miras AD Gasser M Maeder U Kunzmann V Germer CT Pelz J Kerscher AG Incidence, time course and independent risk factors for metachronous peritoneal carcinomatosis of gastric origin--a longitudinal experience from a prospectively collected database of 1108 patients BMC Cancer 2015 15 73 25879885 10.1186/s12885-015-1081-8 PMC4337241 5 Solaini L Bencivenga M D'ignazio A Milone M Marino E De Pascale S Rosa F Sacco M Fumagalli Romario U Graziosi L De Palma G Marrelli D Morgagni P Ercolani G Which gastric cancer patients could benefit from staging laparoscopy? A GIRCG multicenter cohort study Eur J Surg Oncol 2022 48 1778 1784 35101316 10.1016/j.ejso.2022.01.020 6 Yonemura Y Endou Y Shinbo M Sasaki T Hirano M Mizumoto A Matsuda T Takao N Ichinose M Mizuno M Miura M Ikeda M Ikeda S Nakajima G Yonemura J Yuuba T Masuda S Kimura H Matsuki N Safety and efficacy of bidirectional chemotherapy for treatment of patients with peritoneal dissemination from gastric cancer: Selection for cytoreductive surgery J Surg Oncol 2009 100 311 316 19697437 10.1002/jso.21324 7 Japanese Gastric Cancer Association Japanese Gastric Cancer Treatment Guidelines 2021 (6th edition) Gastric Cancer 2023 26 1 25 36342574 10.1007/s10120-022-01331-8 PMC9813208 8 Amin MB Greene FL Edge SB Compton CC Gershenwald JE Brookland RK Meyer L Gress DM Byrd DR Winchester DP The Eighth Edition AJCC Cancer Staging Manual: Continuing to build a bridge from a population-based to a more \"personalized\" approach to cancer staging CA Cancer J Clin 2017 67 93 99 28094848 10.3322/caac.21388 9 Lordick F Carneiro F Cascinu S Fleitas T Haustermans K Piessen G Vogel A Smyth EC ESMO Guidelines Committee Gastric cancer: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up Ann Oncol 2022 33 1005 1020 35914639 10.1016/j.annonc.2022.07.004 10 Ajani JA D'Amico TA Bentrem DJ Chao J Cooke D Corvera C Das P Enzinger PC Enzler T Fanta P Farjah F Gerdes H Gibson MK Hochwald S Hofstetter WL Ilson DH Keswani RN Kim S Kleinberg LR Klempner SJ Lacy J Ly QP Matkowskyj KA McNamara M Mulcahy MF Outlaw D Park H Perry KA Pimiento J Poultsides GA Reznik S Roses RE Strong VE Su S Wang HL Wiesner G Willett CG Yakoub D Yoon H McMillian N Pluchino LA Gastric Cancer, Version 2.2022, NCCN Clinical Practice Guidelines in Oncology J Natl Compr Canc Netw 2022 20 167 192 35130500 10.6004/jnccn.2022.0008 11 Sasako M Sakuramoto S Katai H Kinoshita T Furukawa H Yamaguchi T Nashimoto A Fujii M Nakajima T Ohashi Y Five-year outcomes of a randomized phase III trial comparing adjuvant chemotherapy with S-1 versus surgery alone in stage II or III gastric cancer J Clin Oncol 2011 29 4387 4393 22010012 10.1200/JCO.2011.36.5908 12 Sugarbaker PH Cunliffe WJ Belliveau J de Bruijn EA Graves T Mullins RE Schlag P Rationale for integrating early postoperative intraperitoneal chemotherapy into the surgical treatment of gastrointestinal cancer Semin Oncol 1989 16 83 97 2669141 13 Kok HP Beck M Löke DR Helderman RFCPA van Tienhoven G Ghadjar P Wust P Crezee H Locoregional peritoneal hyperthermia to enhance the effectiveness of chemotherapy in patients with peritoneal carcinomatosis: a simulation study comparing different locoregional heating systems Int J Hyperthermia 2020 37 76 88 10.1080/02656736.2019.1710270 31969039 14 Bonnot PE Piessen G Kepenekian V Decullier E Pocard M Meunier B Bereder JM Abboud K Marchal F Quenet F Goere D Msika S Arvieux C Pirro N Wernert R Rat P Gagnière J Lefevre JH Courvoisier T Kianmanesh R Vaudoyer D Rivoire M Meeus P Passot G Glehen O FREGAT and BIG-RENAPE Networks Cytoreductive Surgery With or Without Hyperthermic Intraperitoneal Chemotherapy for Gastric Cancer With Peritoneal Metastases (CYTO-CHIP study): A Propensity Score Analysis J Clin Oncol 2019 37 2028 2040 31084544 10.1200/JCO.18.01688 15 Mussa A Sandrucci S Zanon C Intraoperative chemohyperthermia for advanced gastric cancer: a new procedure with closed abdomen and previously constructed anastomosis Tumori 2001 87 S18 S20 11693812 16 Yang XJ Li Y Yonemura Y Cytoreductive surgery plus hyperthermic intraperitoneal chemotherapy to treat gastric cancer with ascites and/or peritoneal carcinomatosis: Results from a Chinese center J Surg Oncol 2010 101 457 464 20401915 10.1002/jso.21519 17 Newton AD Bartlett EK Karakousis GC Cytoreductive surgery and hyperthermic intraperitoneal chemotherapy: a review of factors contributing to morbidity and mortality J Gastrointest Oncol 2016 7 99 111 26941988 10.3978/j.issn.2078-6891.2015.100 PMC4754303 18 Dindo D Demartines N Clavien PA Classification of surgical complications: a new proposal with evaluation in a cohort of 6336 patients and results of a survey Ann Surg 2004 240 205 213 15273542 10.1097/01.sla.0000133083.54934.ae PMC1360123 19 Glehen O Gilly FN Arvieux C Cotte E Boutitie F Mansvelt B Bereder JM Lorimier G Quenet F Elias D Association Française de Chirurgie Peritoneal carcinomatosis from gastric cancer: a multi-institutional study of 159 patients treated by cytoreductive surgery combined with perioperative intraperitoneal chemotherapy Ann Surg Oncol 2010 17 2370 2377 20336386 10.1245/s10434-010-1039-7 20 Gill RS Al-Adra DP Nagendran J Campbell S Shi X Haase E Schiller D Treatment of gastric cancer with peritoneal carcinomatosis by cytoreductive surgery and HIPEC: a systematic review of survival, mortality, and morbidity J Surg Oncol 2011 104 692 698 21713780 10.1002/jso.22017 21 Di Giorgio A Macrì A Ferracci F Robella M Visaloco M De Manzoni G Sammartino P Sommariva A Biacchi D Roviello F Pastorino R Pires Marafon D Rotolo S Casella F Vaira M 10 Years of Pressurized Intraperitoneal Aerosol Chemotherapy (PIPAC): A Systematic Review and Meta-Analysis Cancers (Basel) 2023 15 1125 36831468 10.3390/cancers15041125 PMC9954579 22 Higgins JP Savović J Page MJ Elbers RG Sterne JA Assessing risk of bias in a randomized trial. In: Higgins JPT, Thomas J, Chandler J, Cumpston M, Li T, Page MJ, Welch VA, editors. Cochrane Handbook for Systematic Reviews of Interventions. United States: Wiley, 2019: 205-228 23 Sterne JA Hernán MA McAleenan A Reeves BC Higgins JP Assessing risk of bias in a non-randomized study. In: Higgins JPT, Thomas J, Chandler J, Cumpston M, Li T, Page MJ, Welch VA, editors. Cochrane Handbook for Systematic Reviews of Interventions. United States: Wiley, 2019: 621-641 24 Higgins JP Li T Deeks JJ Choosing effect measures and computing estimates of effect. In: Higgins JPT, Thomas J, Chandler J, Cumpston M, Li T, Page MJ, Welch VA, editors. Cochrane Handbook for Systematic Reviews of Interventions. United States: Wiley, 2019: 143-176 25 Sugarbaker PH A curative approach to peritoneal carcinomatosis from colorectal cancer Semin Oncol 2005 32 S68 S73 16399436 10.1053/j.seminoncol.2005.06.009 26 Sugarbaker PH Peritonectomy procedures Ann Surg 1995 221 29 42 7826158 10.1097/00000658-199501000-00004 PMC1234492 27 Yang XJ Huang CQ Suo T Mei LJ Yang GL Cheng FL Zhou YF Xiong B Yonemura Y Li Y Cytoreductive surgery and hyperthermic intraperitoneal chemotherapy improves survival of patients with peritoneal carcinomatosis from gastric cancer: final results of a phase III randomized clinical trial Ann Surg Oncol 2011 18 1575 1581 21431408 10.1245/s10434-011-1631-5 PMC3087875 28 Rudloff U Langan RC Mullinax JE Beane JD Steinberg SM Beresnev T Webb CC Walker M Toomey MA Schrump D Pandalai P Stojadinovic A Avital I Impact of maximal cytoreductive surgery plus regional heated intraperitoneal chemotherapy (HIPEC) on outcome of patients with peritoneal carcinomatosis of gastric origin: results of the GYMSSA trial J Surg Oncol 2014 110 275 284 25042700 10.1002/jso.23633 PMC6301031 29 Rau B Lang H Koenigsrainer A Gockel I Rau HG Seeliger H Lerchenmueller C Reim D Wahba R Angele M Heeg S Keck T Weimann A Topp S Piso P Brandl A Schuele S Jo P Pratschke J Wegel S Rehders A Moosmann N Gaedcke J Heinemann V Trips E Loeffler M Schlag PM Thuss-Patience P Effect of Hyperthermic Intraperitoneal Chemotherapy on Cytoreductive Surgery in Gastric Cancer With Synchronous Peritoneal Metastases: The Phase III GASTRIPEC-I Trial J Clin Oncol 2024 42 146 156 37906724 10.1200/JCO.22.02867 PMC10824373 30 Yu P Ye Z Dai G Zhang Y Huang L Du Y Cheng X Neoadjuvant systemic and hyperthermic intraperitoneal chemotherapy combined with cytoreductive surgery for gastric cancer patients with limited peritoneal metastasis: a prospective cohort study BMC Cancer 2020 20 1108 33198674 10.1186/s12885-020-07601-x PMC7667754 31 Blum Murphy M Ikoma N Wang X Estrella J Roy-Chowdhuri S Das P Minsky BD Song S Mansfield P Ajani J Badgwell B Phase I Trial of Hyperthermic Intraperitoneal Chemoperfusion (HIPEC) with Cisplatin, Mitomycin, and Paclitaxel in Patients with Gastric Adenocarcinoma and Associated Carcinomatosis or Positive Cytology Ann Surg Oncol 2020 27 2806 2811 31974712 10.1245/s10434-020-08226-x 32 van der Kaaij RT Wassenaar ECE Koemans WJ Sikorska K Grootscholten C Los M Huitema A Schellens JHM Veenhof AAFA Hartemink KJ Aalbers AGJ van Ramshorst B Boerma D Boot H van Sandick JW Treatment of PERItoneal disease in Stomach Cancer with cytOreductive surgery and hyperthermic intraPEritoneal chemotherapy: PERISCOPE I initial results Br J Surg 2020 107 1520 1528 32277764 10.1002/bjs.11588 33 Koemans WJ van der Kaaij RT Wassenaar ECE Boerma D Boot H Sikorska K Los M Grootscholten C Hartemink KJ Veenhof AAFA Kodach L Snaebjornsson P van Sandick JW Tumor characteristics and clinical outcome of peritoneal metastasis of gastric origin treated with a hyperthermic intraperitoneal chemotherapy procedure in the PERISCOPE I trial J Surg Oncol 2021 123 904 910 33428786 10.1002/jso.26366 34 Green BL Blumenthaler AN Gamble LA McDonald JD Robinson K Connolly M Epstein M Hernandez JM Blakely AM Badgwell BD Davis JL Cytoreduction and HIPEC for Gastric Carcinomatosis: Multi-institutional Analysis of Two Phase II Clinical Trials Ann Surg Oncol 2023 30 1852 1860 36348206 10.1245/s10434-022-12761-0 PMC10683488 35 Badgwell B Ikoma N Murphy MB Wang X Estrella J Roy-Chowdhuri S Das P Minsky BD Lano E Song S Mansfield P Ajani J A Phase II Trial of Cytoreduction, Gastrectomy, and Hyperthermic Intraperitoneal Perfusion with Chemotherapy for Patients with Gastric Cancer and Carcinomatosis or Positive Cytology Ann Surg Oncol 2021 28 258 264 32556731 10.1245/s10434-020-08739-5 36 Cui HB Ge HE Bai XY Zhang W Zhang YY Wang J Li X Xing LP Guo SH Wang ZY Effect of neoadjuvant chemotherapy combined with hyperthermic intraperitoneal perfusion chemotherapy on advanced gastric cancer Exp Ther Med 2014 7 1083 1088 24940391 10.3892/etm.2014.1599 PMC3991504 37 Reutovich MY Krasko OV Sukonko OG Hyperthermic intraperitoneal chemotherapy in serosa-invasive gastric cancer patients Eur J Surg Oncol 2019 45 2405 2411 31387756 10.1016/j.ejso.2019.07.030 38 Fan B Bu Z Zhang J Zong X Ji X Fu T Jia Z Zhang Y Wu X Phase II trial of prophylactic hyperthermic intraperitoneal chemotherapy in patients with locally advanced gastric cancer after curative surgery BMC Cancer 2021 21 216 33653317 10.1186/s12885-021-07925-2 PMC7923597 39 Liu L Sun L Zhang N Liao CG Su H Min J Song Y Yang X Huang X Chen D Chen Y Zhang HW Zhang H A novel method of bedside hyperthermic intraperitoneal chemotherapy as adjuvant therapy for stage-III gastric cancer Int J Hyperthermia 2022 39 239 245 35100917 10.1080/02656736.2022.2028018 40 Yu P Huang X Huang L Dai G Xu Q Fang J Ye Z Chai T Du Y Hyperthermic intraperitoneal chemotherapy (HIPEC) plus systemic chemotherapy versus systemic chemotherapy alone in locally advanced gastric cancer after D2 radical resection: a randomized-controlled study J Cancer Res Clin Oncol 2023 149 11491 11498 37392201 10.1007/s00432-023-05019-z PMC10465671 41 Rau B Brandl A Piso P Pelz J Busch P Demtröder C Schüle S Schlitt HJ Roitman M Tepel J Sulkowski U Uzunoglu F Hünerbein M Hörbelt R Ströhlein M Beckert S Königsrainer I Königsrainer A Peritoneum Surface Oncology Group and members of the StuDoQ|Peritoneum Registry of the German Society for General and Visceral Surgery (DGAV) Peritoneal metastasis in gastric cancer: results from the German database Gastric Cancer 2020 23 11 22 31228044 10.1007/s10120-019-00978-0 42 Van Der Sluis K Taylor SN Kodach LL van Dieren JM de Hingh IHJT Wijnhoven BPL Verhoeven RHA Vollebergh MA van Sandick JW Tumor-positive peritoneal cytology in patients with gastric cancer is associated with poor outcome: A nationwide study Eur J Cancer 2024 199 113541 38237371 10.1016/j.ejca.2024.113541 43 Yano M Yasuda T Fujiwara Y Takiguchi S Miyata H Monden M Preoperative intraperitoneal chemotherapy for patients with serosa-infiltrating gastric cancer J Surg Oncol 2004 88 39 43 15384086 10.1002/jso.20133 44 Chia CS You B Decullier E Vaudoyer D Lorimier G Abboud K Bereder JM Arvieux C Boschetti G Glehen O BIG RENAPE Group Patients with Peritoneal Carcinomatosis from Gastric Cancer Treated with Cytoreductive Surgery and Hyperthermic Intraperitoneal Chemotherapy: Is Cure a Possibility? Ann Surg Oncol 2016 23 1971 1979 26753751 10.1245/s10434-015-5081-3 45 Manzanedo I Pereira F Rihuete Caro C Pérez-Viejo E Serrano Á Gutiérrez Calvo A Regueira FM Casado-Adam Á Cascales-Campos PA Arteaga X García-Fadrique A Gómez Sanz R López García A Zozaya G Arjona Á Gil Martínez J Cytoreductive Surgery and Hyperthermic Intraperitoneal Chemotherapy (HIPEC) for Gastric Cancer with Peritoneal Carcinomatosis: Multicenter Study of Spanish Group of Peritoneal Oncologic Surgery (GECOP) Ann Surg Oncol 2019 26 2615 2621 31115852 10.1245/s10434-019-07450-4 46 Cinquini M Kusamura S Tralongo AC Fittipaldo VA Deraco M Monteforte M Multi-Society Guideline on Cytoreductive Surgery and HIPEC: Methodology and Overview of the Results J Surg Oncol 2024 130 1173 1177 39689044 10.1002/jso.27991 PMC11826033 47 Liu X Cai H Sheng W Yu L Long Z Shi Y Wang Y Clinicopathological Characteristics and Survival Outcomes of Primary Signet Ring Cell Carcinoma in the Stomach: Retrospective Analysis of Single Center Database PLoS One 2015 10 e0144420 26642199 10.1371/journal.pone.0144420 PMC4671648 48 Mathias-Machado MC de Jesus VHF Jácome A Donadio MD Aruquipa MPS Fogacci J Cunha RG da Silva LM Peixoto RD Claudin 18.2 as a New Biomarker in Gastric Cancer-What Should We Know? Cancers (Basel) 2024 16 679 38339430 10.3390/cancers16030679 PMC10854563 49 Imano M Satou T Itoh T Yasuda A Kato H Shinkai M Peng YF Tsubaki M Yasuda T Imamoto H Nishida S Takeyama Y Okuno K Shiozaki H Peritoneal metastatic lesions of gastric cancer exhibit low expression of human epidermal growth factor receptor 2 Target Oncol 2012 7 213 216 22752927 10.1007/s11523-012-0223-z 50 Janjigian YY Shitara K Moehler M Garrido M Salman P Shen L Wyrwicz L Yamaguchi K Skoczylas T Campos Bragagnoli A Liu T Schenker M Yanez P Tehfe M Kowalyszyn R Karamouzis MV Bruges R Zander T Pazo-Cid R Hitre E Feeney K Cleary JM Poulart V Cullen D Lei M Xiao H Kondo K Li M Ajani JA First-line nivolumab plus chemotherapy versus chemotherapy alone for advanced gastric, gastro-oesophageal junction, and oesophageal adenocarcinoma (CheckMate 649): a randomised, open-label, phase 3 trial Lancet 2021 398 27 40 34102137 10.1016/S0140-6736(21)00797-2 PMC8436782 51 Shah MA Shitara K Ajani JA Bang YJ Enzinger P Ilson D Lordick F Van Cutsem E Gallego Plazas J Huang J Shen L Oh SC Sunpaweravong P Soo Hoo HF Turk HM Oh M Park JW Moran D Bhattacharya P Arozullah A Xu RH Zolbetuximab plus CAPOX in CLDN18.2-positive gastric or gastroesophageal junction adenocarcinoma: the randomized, phase 3 GLOW trial Nat Med 2023 29 2133 2141 37524953 10.1038/s41591-023-02465-7 PMC10427418 52 Yonemura Y de Aretxabala X Fujimura T Fushida S Katayama K Bandou E Sugiyama K Kawamura T Kinoshita K Endou Y Sasaki T Intraoperative chemohyperthermic peritoneal perfusion as an adjuvant to gastric cancer: final results of a randomized controlled study Hepatogastroenterology 2001 48 1776 1782 11813623 53 Ikeguchi M Kondou A Oka A Tsujitani S Maeta M Kaibara N Effects of continuous hyperthermic peritoneal perfusion on prognosis of gastric cancer with serosal invasion Eur J Surg 1995 161 581 586 8519874 54 Rau B Brandl A Thuss-Patience P Bergner F Raue W Arnold A Horst D Pratschke J Biebl M The efficacy of treatment options for patients with gastric cancer and peritoneal metastasis Gastric Cancer 2019 22 1226 1237 31065877 10.1007/s10120-019-00969-1 55 Solaini L Ministrini S Bencivenga M D'Ignazio A Marino E Cipollari C Molteni B Mura G Marrelli D Graziosi L Roviello F De Manzoni G Tiberio GAM Morgagni P Conversion gastrectomy for stage IV unresectable gastric cancer: a GIRCG retrospective cohort study Gastric Cancer 2019 22 1285 1293 31065878 10.1007/s10120-019-00968-2 56 Yonemura Y Elnemr A Endou Y Hirano M Mizumoto A Takao N Ichinose M Miura M Li Y Multidisciplinary therapy for treatment of patients with peritoneal carcinomatosis from gastric cancer World J Gastrointest Oncol 2010 2 85 97 21160926 10.4251/wjgo.v2.i2.85 PMC2998933 57 Al-Batran SE Homann N Pauligk C Illerhaus G Martens UM Stoehlmacher J Schmalenberg H Luley KB Prasnikar N Egger M Probst S Messmann H Moehler M Fischbach W Hartmann JT Mayer F Höffkes HG Koenigsmann M Arnold D Kraus TW Grimm K Berkhoff S Post S Jäger E Bechstein W Ronellenfitsch U Mönig S Hofheinz RD Effect of Neoadjuvant Chemotherapy Followed by Surgical Resection on Survival in Patients With Limited Metastatic Gastric or Gastroesophageal Junction Cancer: The AIO-FLOT3 Trial JAMA Oncol 2017 3 1237 1244 28448662 10.1001/jamaoncol.2017.0515 PMC5824287 58 Pelc Z Sędłak K Endo Y Van Sandick J Gisbertz S Pera M Baiocchi GL Morgagni P Framarini M Hoelscher A Moenig S Kołodziejczyk P Gockel I Piessen G Eveno C Da Costa PM Davies A Baker C Allum W Romario UF Rosati R Reim D D'ugo D Wijnhoven B De Manzoni G Kielan W Schneider P Badgwell BB Pawlik TM Polkowski W Rawicz-Pruszyński K Hyperthermic intraperitoneal chemotherapy (HIPEC) for gastric cancer with peritoneal metastasis - Joint analysis of European GASTRODATA and American national cancer database Am J Surg 2025 242 116235 39954554 10.1016/j.amjsurg.2025.116235 59 Kusamura S Dominique E Baratti D Younan R Deraco M Drugs, carrier solutions and temperature in hyperthermic intraperitoneal chemotherapy J Surg Oncol 2008 98 247 252 18726886 10.1002/jso.21051 60 Gronau F Feldbruegge L Oberwittler F Gonzalez-Moreno S Villeneuve L Eveno C Glehen O Kusamura S Rau B HIPEC in Peritoneal Metastasis of Gastric Origin: A Systematic Review of Regimens and Techniques J Clin Med 2022 11 1456 35268546 10.3390/jcm11051456 PMC8911234 61 Van der Speeten K Kusamura S Villeneuve L Piso P Verwaal VJ González-Moreno S Glehen O The 2022 PSOGI International Consensus on HIPEC Regimens for Peritoneal Malignancies: HIPEC Technologies Ann Surg Oncol 2024 31 7090 7110 39037523 10.1245/s10434-024-15513-4 62 Ishigami H Fujiwara Y Fukushima R Nashimoto A Yabusaki H Imano M Imamoto H Kodera Y Uenosono Y Amagai K Kadowaki S Miwa H Yamaguchi H Yamaguchi T Miyaji T Kitayama J Phase III Trial Comparing Intraperitoneal and Intravenous Paclitaxel Plus S-1 Versus Cisplatin Plus S-1 in Patients With Gastric Cancer With Peritoneal Metastasis: PHOENIX-GC Trial J Clin Oncol 2018 36 1922 1929 29746229 10.1200/JCO.2018.77.8613 63 Huang O Lu X Xu X Shi Y Fibrin-sealant-delivered cisplatin chemotherapy versus cisplatin hyperthermic intraperitoneal perfusion chemotherapy for locally advanced gastric cancer without peritoneal metastases: a randomized phase-II clinical trial with a 40-month follow-up Cell Biochem Biophys 2015 71 1171 1180 25398590 10.1007/s12013-014-0326-5 64 Yan K Wu K Yan L Liang L Yuan Y Efficacy of postoperative intraperitoneal hyperthermic perfusion chemotherapy with oxaliplatin + 5-Fluorouracil in the treatment of gastric cancer patients with peritoneal carcinomatosis J BUON 2019 24 1587 1594 31646813 65 Yonemura Y Prabhu A Sako S Ishibashi H Mizumoto A Takao N Ichinose M Motoi S Liu Y Nishihara K Brandl A Fushida S Long Term Survival after Cytoreductive Surgery Combined with Perioperative Chemotherapy in Gastric Cancer Patients with Peritoneal Metastasis Cancers (Basel) 2020 12 116 31906405 10.3390/cancers12010116 PMC7016959 66 Chicago Consensus Working Group The Chicago Consensus on peritoneal surface malignancies: Management of gastric metastases Cancer 2020 126 2541 2546 32282074 10.1002/cncr.32868 67 Marano L Marrelli D Sammartino P Biacchi D Graziosi L Marino E Coccolini F Fugazzola P Valle M Federici O Baratti D Deraco M Di Giorgio A Macrì A Pasqual EM Framarini M Vaira M Roviello F Italian Peritoneal Surface Malignancies Oncoteam (S I.C.O.). Cytoreductive Surgery and Hyperthermic Intraperitoneal Chemotherapy for Gastric Cancer with Synchronous Peritoneal Metastases: Multicenter Study of 'Italian Peritoneal Surface Malignancies Oncoteam-S.I.C.O.' Ann Surg Oncol 2021 28 9060 9070 34057569 10.1245/s10434-021-10157-0 PMC8590997 68 Beeharry MK Zhu ZL Liu WT Yao XX Yan M Zhu ZG Prophylactic HIPEC with radical D2 gastrectomy improves survival and peritoneal recurrence rates for locally advanced gastric cancer: personal experience from a randomized case control study BMC Cancer 2019 19 932 31533660 10.1186/s12885-019-6125-z PMC6751672 69 Koemans WJ van der Kaaij RT Boot H Buffart T Veenhof AAFA Hartemink KJ Grootscholten C Snaebjornsson P Retel VP van Tinteren H Vanhoutvin S van der Noort V Houwink A Hahn C Huitema ADR Lahaye M Los M van den Barselaar P Imhof O Aalbers A van Dam GM van Etten B Wijnhoven BPL Luyer MDP Boerma D van Sandick JW Cytoreductive surgery and hyperthermic intraperitoneal chemotherapy versus palliative systemic chemotherapy in stomach cancer patients with peritoneal dissemination, the study protocol of a multicentre randomised controlled trial (PERISCOPE II) BMC Cancer 2019 19 420 31060544 10.1186/s12885-019-5640-2 PMC6501330 70 Martins M Santos-Sousa H Araújo F Nogueiro J Sousa-Pinto B Impact of Cytoreductive Surgery with Hyperthermic Intraperitoneal Chemotherapy in the Treatment of Gastric Cancer with Peritoneal Carcinomatosis: A Systematic Review and Meta-analysis Ann Surg Oncol 2022 29 7528 7537 35930109 10.1245/s10434-022-12312-7 71 Sakuramoto S Sasako M Yamaguchi T Kinoshita T Fujii M Nashimoto A Furukawa H Nakajima T Ohashi Y Imamura H Higashino M Yamamura Y Kurita A Arai K ACTS-GC Group Adjuvant chemotherapy for gastric cancer with S-1, an oral fluoropyrimidine N Engl J Med 2007 357 1810 1820 17978289 10.1056/NEJMoa072252 72 Zhang JF Lv L Zhao S Zhou Q Jiang CG Hyperthermic Intraperitoneal Chemotherapy (HIPEC) Combined with Surgery: A 12-Year Meta-Analysis of this Promising Treatment Strategy for Advanced Gastric Cancer at Different Stages Ann Surg Oncol 2022 29 3170 3186 35175455 10.1245/s10434-021-11316-z 73 Götze TO Piso P Lorenzen S Bankstahl US Pauligk C Elshafei M Amato G Reim D Bechstein WO Königsrainer A Mönig SP Rau B Schwarzbach M Al-Batran SE Preventive HIPEC in combination with perioperative FLOT versus FLOT alone for resectable diffuse type gastric and gastroesophageal junction type II/III adenocarcinoma - the phase III \"PREVENT\"- (FLOT9) trial of the AIO /CAOGI /ACO BMC Cancer 2021 21 1158 34715810 10.1186/s12885-021-08872-8 PMC8555172 74 Noiret B Piessen G Eveno C Update of randomized controlled trials evaluating cytoreductive surgery (CRS) and hyperthermic intraperitoneal chemotherapy (HIPEC) in prevention and therapy of peritoneal metastasis: a systematic review Pleura Peritoneum 2022 7 51 61 35812007 10.1515/pp-2021-0152 PMC9166620 75 Sugarbaker PH Van der Speeten K Aggressive local treatments may prolong survival but do not have curative intent J Gastrointest Oncol 2021 12 S68 S69 33970158 10.21037/jgo-2020-12 PMC8100696 ",
  "metadata": {
    "Title of this paper": "Aggressive local treatments may prolong survival but do not have curative intent",
    "Journal it was published in:": "World Journal of Clinical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476609/"
  }
}