{
  "title": "Paper_503",
  "abstract": "J Maxillofac Oral Surg J Maxillofac Oral Surg 1433 jmos Journal of Maxillofacial & Oral Surgery 0972-8279 0974-942X Springer PMC11456094 PMC11456094.1 11456094 11456094 39376784 10.1007/s12663-023-01948-x 1948 1 Technical Note Contemporary Marking Technique of End-to-Side Venous Anastomosis with Internal Jugular Vein in Head and Neck Free Flap Cases: An Experience of 200 Cases http://orcid.org/0000-0001-7856-3805 Bhardwaj Aakansha aakansha.bhardwaj10@gmail.com 1 3 Rawat Sourabh 2 Bansal Umesh 2 1 grid.518247.d Department of Head and Neck Oncology, HCG Manavata Cancer Centre, 2 https://ror.org/01xgdvm53 grid.428034.9 0000 0004 1767 3279 Bhagwan Mahaveer Cancer Hospital and Research Center, 3 grid.518247.d Department of Head and Neck Oncology, HCG Manavata Cancer Centre, 14 6 2023 10 2024 23 5 472260 1089 1092 23 1 2023 29 5 2023 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © The Association of Oral and Maxillofacial Surgeons of India 2023 2023 Background Microvascular free tissue transfer is a popular option for reconstruction of the head and neck defects following tumor ablation. Many factors are involved in the achievement of a satisfactory outcome, namely, adequate selection of the donor flap and recipient vessels, proficient anastomosis technique and postoperative care including flap monitoring. Preferential use of end-to-side anastomosis to the internal jugular vein in head and neck reconstruction offers various advantages and has consistently yielded outstanding results. Purpose Presented is a series of 200 consecutive cases at one institution over 1 year. Method In our institution, the internal jugular vein (IJV) has had the first priority in the selection of a recipient vein in free-flap head and neck reconstruction. An end-to-side anastomosis with the internal jugular vein has several advantages. Results We have devised a simple technique of marking the point of anastomosis with a needle prick at two points taking the diameter of pedicle vein to aid in identification of point of anastomosis. Conclusion This method is very reliable to ascertain the suitable lie of the pedicle vein. The diameter of the lumen for anastomosis is maintained. We had a success rate of 100% with all the cases we applied this technique on. Keywords Reconstruction Anastomosis Internal jugular vein Flap Microvascular pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Association of Oral and Maxillofacial Surgeons of India 2024 ",
  "metadata": {
    "Title of this paper": "Contemporary Marking Technique of End-to-Side Venous Anastomosis with Internal Jugular Vein in Head and Neck Free Flap Cases: An Experience of 200 Cases",
    "Journal it was published in:": "Journal of Maxillofacial & Oral Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11456094/"
  }
}