{
  "title": "Paper_1066",
  "abstract": "pmc eNeuro eNeuro 2821 eneuro eNeuro eNeuro 2373-2822 Society for Neuroscience PMC12469007 PMC12469007.1 12469007 12469007 40935669 10.1523/ENEURO.0172-25.2025 eneuro-12-ENEURO.0172-25.2025 1 2 Research Article: New Research Development Treatment of Mitochondrial Disturbances due to Early Life Adversity in Mice Results in Restoration of Complex I Activity and Normal Reward Behavior https://orcid.org/0000-0003-2819-1817 Eagleson Kathie L.  1  2 https://orcid.org/0000-0002-9717-1695 Levitt Pat  1  2 1 Division of Neurology, Developmental Neuroscience and Neurogenetics Program, Children’s Hospital Los Angeles, The Saban Research Institute 2 Department of Pediatrics, Keck School of Medicine of University of Southern California The authors declare no competing financial interests. Author contributions: K.L.E. and P.L. designed research; K.L.E. performed research; K.L.E. analyzed data; K.L.E. and P.L. wrote the paper. This work was supported by the CHLA/TSRI Developmental Neuroscience and Neurogenetics Program and the Simms/Mann Family Foundation. Correspondence should be addressed to Kathie L. Eagleson at keagleso@med.usc.edu 11 9 2025 24 9 2025 9 2025 12 9 496538 ENEURO.0172-25.2025 29 4 2025 29 8 2025 3 9 2025 24 09 2025 27 09 2025 27 09 2025 Copyright © 2025 Eagleson and Levitt 2025 https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license The environment experienced by children, such as exposure to chronic early life adversity (ELA), increases lifespan brain disorder risk. The mechanisms that link ELA exposure to functional brain disruptions are not well understood. A limited-bedding and nesting paradigm, in which ELA is induced in mouse pups over the first postnatal week through disruption of maternal care, is characterized by limited resources, environment unpredictability, and disruption of reward and cognitive behaviors. Studies using this model demonstrated sex-selective alterations in hippocampal mitochondrial-associated proteins in response to ELA compared with care as usual (CAU). Further, oxidative phosphorylation (OXPHOS) capacity and complex I activity are increased in ELA juveniles, yet decreased in adults, with the impact of ELA moderated by sex in adults. Given that altered mitochondrial function is a key mediator in metabolic adaptations, the goal of the present study was to evaluate the possibility of reversing mitochondrial dysfunction and the anhedonia that accompanies ELA by addressing oxidative stress. Treatment with the antioxidant MitoQ began at weaning and extended to 3 months. Measures of complex I activity demonstrated full recovery in adults. Female-specific deficits in the sucrose preference task, which is a measure of rewarding behavior in rodents, also exhibited recovery, with preference for sucrose comparable with that of CAU mice. These data indicate that mitochondrial health is one component of responses to early life adversity that has lifespan implications, but with the capacity to recover normal functioning in adults. anhedonia early life adversity mitochondria sex differences CHLA/TSRI Developmental Neuroscience and Neurogenetics Program Simms/Mann Family Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date September 2025 Significance Statement Chronic early life stress in humans and animals leads to enduring functional changes to brain circuitry and behavior. An emerging concept involves the adaptation of mitochondria to address new energy demands as a primary cellular response to chronic stress. Long-term disruptions lead to oxidative stress, anhedonia, and cognitive deficits. To determine if direct treatment of oxidative stress can mitigate adult dysfunction, an 8 week regimen of an antioxidant was administered to postweaning mice that were raised early postnatally in an environment that disrupts predictable maternal care. Complex I mitochondrial energetics and sucrose preference were restored to levels comparable with mice raised in care as usual conditions, demonstrating a link between mitochondrial health and functional outcomes. Introduction The early environment experienced by infants and toddlers, such as exposure to adverse childhood experiences [ACEs, a form of early life adversity (ELA)], has a pronounced impact on brain disorder and disease risk ( Newnham and Ross, 2009 Gluckman et al., 2010 Duke and Borowsky, 2018 Cprek et al., 2020 Gilgoff et al., 2020 Felitti et al., 1998 Anda et al., 1999 2006 Dube et al., 2003 2009 Edwards et al., 2003 Danese et al., 2009 Greenberg et al., 2015 Waters and Graf, 2018 Deschenes et al., 2018 Duke and Borowsky, 2018 Horn et al., 2019 Cprek et al., 2020 Gateau et al., 2023 Picard et al., 2017 Picard and McEwen, 2018 Ruigrok et al., 2021b Zitkovsky et al., 2021 Hoffmann and Spengler, 2018 Picard and McEwen, 2018 Daniels et al., 2020 Eagleson et al., 2020 Zitkovsky et al., 2021 Chaudhari et al., 2022 To address the knowledge gap in mechanisms that underlie the impact of ELA on long-term brain and body health risks, a limited-bedding and nesting paradigm (LBN) in rodents, in which ELA is induced in mouse pups over the first postnatal week through disruption of maternal care that produces unpredictable interactions with pups ( Walker et al., 2017 Birnie et al., 2022 Eagleson et al., 2020 Cadenas and Davies, 2000 Liu et al., 2002 Turrens, 2003 Brand, 2010 Bobba-Alves et al., 2023 Monzel et al., 2024 Shaulson et al., 2024 To our knowledge, studies have not been performed to determine the possibility of reversing mitochondrial dysfunction and the anhedonia that accompanies ELA by addressing oxidative stress. Treatment with the antioxidant mitoquinone mesylate (MitoQ) has been used to reverse oxidative stress in models of adult peripheral organ dysfunction ( Lim et al., 2011 Fouret et al., 2015 Gioscia-Ryan et al., 2018 Chen et al., 2020 Murphy and Smith, 2007 Adlam et al., 2005 McManus et al., 2011 Mao et al., 2013 Santini et al., 2015 Stucki et al., 2016 Maiti et al., 2018 Young and Franklin, 2019 Jeong et al., 2021 Haidar et al., 2022 Materials and Methods The study design is outlined in Figure 1 Table 1 Figure 1. Study design. Litters were assigned to their experimental group at postnatal day (P) 0, the day of birth. On P2, litters were culled to sex-balanced six pups and moved to either a new care-as-usual (CAU) cage or to a limited bedding and nesting (LBN) cage. The LBN paradigm induces early life adversity (ELA) in the pups. All litters were returned to a fresh CAU cage at P9, underwent a cage change at P16, and were weaned and housed with same sex littermates at P21. Starting at weaning, ELA mice were maintained on either MitoQ, dTPP or vehicle in drinking water for 8 weeks. CAU mice received vehicle only. At the end of the treatment period, mice first were tested for sucrose preference, then, at least 3 d later, hippocampal complex I activity was determined. Created in BioRender. https://BioRender.com/a02d73k Table 1. Experimental cohorts used in study Cohort CAU + vehicle ELA + vehicle ELA + dTPP ELA + MitoQ DOB (M:F) DOB (M:F) DOB (M:F) DOB (M:F) 1 3/15/21 (3:3) 3/15/21 (3:3) 3/15/21 (3:3) 3/16/21 (3:3) 2 3/20/21 (3:3) 3/22/21 (3:3) 3/22/21 (2:4) 3/27/21 (3:3) 3 5/28/21 (3:3) 5/28/21 (3:3) 5/28/21 (3:3) 5/29/21 (3:3) 4 6/1/21 (2:4) 6/6/21 (4:2) 6/7/21 (3:3) 6/7/21 (3:3) 5 6/8/21 (3:3) 6/11/21 (3:3) 6/12/21 (3:3) 6/13/21 (3:3) 6 6/25/23 (3:3) 6/25/23 (3:3) 6/26/23 (3:3) 7/1/23 (2:4) 7 7/6/23 (3:3) 7/10/23 (3:3) 7/12/23 (3:3) 7/13/23 (3:3) 8 8/25/23 (2:4) 8/26/24 (3:3) 8/30/24 (3:3) 8/30/24 (2:4) 9 9/19/23 (3:3) 9/14/23 (3:3) 9/15/23 (3:3) 9/19/23 (3:3) 10 11/1/23 (3:3) 11/1/23 (3:3) 11/2/23 (3:3) 11/8/23 (3:3) 11 11/9/23 (3:3) 11/11/23 (3:3) 11/12/23 (3:3) 11/16/23 (3:3) 12 1/10/24 (3:3) 1/9/24 (3:3) 1/10/24 (3:3) 1/12/24 (3:3) 13 2/2/24 (3:3) 2/3/24 (3:3) 2/4/24 (3:3) 2/9/24 (3:3) 14 3/6/24 (3:3) 3/6/24 (3:3) 3/7/24 (3:3) 3/8/24 (3:3) 15 3/8/24 (3:3) 3/9/24 (3:3) 3/9/24 (3:3) 3/9/24 (3:3) CAU, care-as-usual; ELA, early life adversity; DOB, date of birth; M, male; F, female. Mice and animal husbandry All mouse procedures were approved by the Institutional Animal Care and Use Committee at the Children's Hospital Los Angeles and conformed to NIH guidelines. Mice were housed in Super Mouse 750 ventilated cages (#75050PC-GAW, Lab Products) that included a LifeSpan Rodent Enrichment module (#75009PC, Lab Products) in a temperature- and humidity-controlled vivarium under at 13/11 h light/dark cycle. Food (PicoLab Rodent Diet 20, #5053) and water were provided ad libitum Male and female C57BL/6J mice (RRID: IMSR_JAX:000664) were shipped from the Jackson Laboratory at 8–10 weeks of age. Mice were acclimated to the colony for 5 d, and then breeding was initiated by housing four females with one male. After 14 d, breeding cages were monitored daily, and pregnant dams removed and housed singly until pups were born. The breeding cycle was then repeated to generate second litters, with all experiments performed on the second litter of each dam. Sixty litters generated between March 2021 and March 2024 were used in the current study, with 15 litters representing one of four experimental groups (see below). ELA paradigm A modified limited-bedding and nesting (LBN) paradigm, developed in the Baram laboratory ( Rice et al., 2008 Table 1 n n MitoQ intervention Mice were maintained on a MitoQ regimen starting at weaning, extending through puberty and adolescence into young adulthood. During the synthesis of MitoQ, the ubiquinol antioxidant is attached to a lipophilic triphenylphosphonium (TPP) cation to facilitate selective targeting to mitochondria. Decyltriphenylphosphonium (dTPP) is identical structurally to MitoQ but lacks the ubiquinone moiety. We used dTPP alone to control for potential effects of the TPP cation, which has been reported in other studies ( Gottwald et al., 2018 Armstrong et al., 2019 Huang et al., 2015 2022 Bond et al., 2019 Young and Franklin, 2019 Le Gal et al., 2021 Haidar et al., 2022 Sucrose preference test At the end of the treatment period, mice underwent a sucrose preference test according to a published protocol ( Goodwill et al., 2019 Complex I activity At least 3 d after completing the sucrose preference task, mice were anesthetized with 4% isoflurane (#1169567772, Covetrus) and decapitated and the hippocampus dissected. Hippocampal tissue (∼100 mg) from three male or three female pups within a single litter was pooled to generate a single biological sample. This amount of starting tissue, rapidly dissected to avoid impacting mitochondrial health during isolation ( Liao et al., 2020 Statistical analyses Data are reported as mean [95% confidence interval (CI)]. Individual measures for each assay are reported in the graphs and Extended Data Figures α β η 2 For preweanling weight measures, comparisons between groups were performed using an unbalanced two-way analysis of variance (ANOVA), with sex and ELA as between-subjects factors. For adult weight and complex I activity measures, comparisons between groups were performed using a balanced two-way ANOVA, with sex and treatment as between-subjects factors. Significant differences with large to medium effect sizes were followed up with Tukey’s honestly significant difference (HSD) test to identify the source of possible interactions. If no significant sex or sex × ELA/sex × treatment interaction was observed, data were collapsed across sex for post hoc analyses. If a significant sex or sex × ELA/sex × treatment interaction was observed, post hoc analyses considered males and females independently. For sucrose preference measures, the impact of dTPP and MitoQ treatment was determined only in females using a one-way ANOVA followed by a Tukey HSD test. For all measures, a Hedge's g p α F p Tables 2 3 Table 2. Statistical test details for body weight measures Figure Measure, test Factors Test statistic p Effect size P2 weight (CAU: n n n n Unbalanced two-way ANOVA Sex F (1,116) 0.096 η 2 ELA F (1,116) 0.756 η 2 Sex × ELA F (1,116) 0.621 η 2  2 A % weight gain P2–P9 (CAU: n n n n Unbalanced two-way ANOVA Sex F (1,116) 0.583 η 2 ELA F (1,116) <0.001 η 2 Sex × ELA F (1,116) 0.748 η 2  2 B P9 weight (CAU: n n n n Unbalanced two-way ANOVA Sex F (1,116) 0.078 η 2 ELA F (1,116) <0.001 η 2 Sex × ELA F (1,116) 0.686 η 2  2 C % weight gain P9–P21 (CAU: n n n n Unbalanced two-way ANOVA Sex F (1,116) <0.001 η 2 ELA F (1,116) <0.001 η 2 Sex × ELA F (1,116) <0.001 η 2 Post hoc (Tukey’s HSD) Female CAU, female ELA 0.328 g Male CAU, male ELA 0.004 g  2 D P21 weight (CAU: n n n n Unbalanced two-way ANOVA Sex F (1,116) 0.004 η 2 ELA F (1,116) <0.001 η 2 Sex × ELA F (1,116) 0.462 η 2 Post hoc (Tukey’s HSD) Female CAU, female ELA <0.001 g Male CAU, male ELA 0.016 g  3 A P21 ELA weight ( n Two-way ANOVA Sex F (1,84) 0.005 η 2 Treatment F (2,84) 0.385 η 2 Sex × Treatment F (2,84) 0.807 η 2 Post hoc (one-way ANOVA) Female F (2,42) 0.391 η 2 Male F (2,42) 0.823 η 2  3 B Adult weight ( n Two-way ANOVA Sex F (1,112) <0.001 η 2 Treatment F (3,112) 0.778 η 2 Sex × Treatment F (3,112) 0.798 η 2 Post hoc (one-way ANOVA) Female F (2,42) 0.992 η 2 Male F (2,42) 0.790 η 2 Table 3. Statistical test details for complex I and sucrose preference measures Figure Measure, test Factors F p Effect size  4 Complex I activity ( n Two-way ANOVA Sex F (1,88) 0.028 η 2 Treatment F (3,88) <0.001 η 2 Sex × treatment F (3,88) 0.297 η 2 Post hoc—female (Tukey’s HSD) CAU (veh), ELA (veh) <0.001 g ELA (veh), ELA (dTPP) 0.517 g ELA (veh), ELA (MitoQ) <0.001 g CAU (veh), ELA (dTPP) <0.001 g CAU (veh), ELA (MitoQ) 0.799 g Post hoc—male (Tukey’s HSD) CAU (veh), ELA (veh) 0.017 g ELA (veh), ELA (dTPP) 0.999 g ELA (veh), ELA (MitoQ) 0.302 g CAU (veh), ELA (dTPP) 0.024 g CAU (veh), ELA (MitoQ) 0.551 g  5 Female sucrose preference test ( n One-way ANOVA F (3,56) <0.001 η 2 Post hoc (Tukey’s HSD) CAU (veh), ELA (veh) <0.001 g ELA (veh), ELA (dTPP) <0.001 g ELA (veh), ELA (MitoQ) <0.001 g CAU (veh), ELA (dTPP) 0.045 g CAU (veh), ELA (MitoQ) 0.988 g Results A consistent outcome of the LBN paradigm is reduced pup weight gain over the ELA period. We used pup weight measures to validate the impact of the ELA manipulation ( Rice et al., 2008 Extended Data Fig. 2-1 Table 2 η 2 Fig. 2 A Table 2 Fig. 2 B Table 2 η 2 Fig. 2 C Table 2 η 2 η 2 Table 2 η 2 η 2 Fig. 2 D Table 2 g g Fig. 3 A Extended Data Fig. 3-1 Table 2 η 2 Fig. 3 B Extended Data Fig. 3-1 Table 2 Figure 2. Early life adversity (ELA) impacts preweanling body weight gain. A B C D Table 2 Extended Data Figure 2-1 10.1523/ENEURO.0172-25.2025.f2-1 Figure 2-1 Preweanling body weight (g) and weight gain (%). Download Figure 2-1, XLS file Figure 3. There is no difference in body weight across mice assigned to each early life adversity (ELA) treatment group. A B Table 2 Extended Data Figure 3-1 10.1523/ENEURO.0172-25.2025.f3-1 Figure 3-1 Body weight (g) across ELA treatment groups at initiation of treatment (P21) and start of behavior (adult). Download Figure 3-1, XLS file MitoQ mitigates the impact of ELA on adult outcomes There was a significant large effect of treatment ( η 2 Fig. 4 Extended Data Fig. 4-1 Table 3 η 2 Table 3 Eagleson et al., 2020 g g g Table 3 g g Table 3 Figure 4. MitoQ treatment mitigates the effect of early life adversity (ELA) on young adult female hippocampal complex I activity. Complex I activity was measured in isolated hippocampal mitochondria. Complex I activity is reduced in ELA mice treated with vehicle (veh), with a larger effect in females compared with males. In females, treatment with MitoQ, but not dTPP, starting at weaning, mitigated the effect of ELA. *Significantly different to care-as-usual (CAU) + veh. # Table 3 Extended Data Figure 4-1 10.1523/ENEURO.0172-25.2025.f4-1 Figure 4-1 Complex I data. Download Figure 4-1, XLS file Previous studies have demonstrated a female-selective reduction in sucrose preference in response to LBN in adult mice ( Goodwill et al., 2019 Liu et al., 2021 Zheng et al., 2024 t t (20.59) p n Extended Data Figs. 5-1 5-2 η 2 Fig. 5 Extended Data Fig. 5-3 Table 3 g g Table 3 g F F (14,14) p Extended Data Figs. 5-1 5-2 Figure 5. MitoQ treatment mitigates the effect of early life adversity (ELA) on sucrose preference in young adult female mice. Sucrose preference is reduced in ELA mice treated with vehicle (veh). Treatment of ELA mice with dTPP and MitoQ significantly increases sucrose preference compared with vehicle, with MitoQ-treated mice returning to care-as-usual (CAU) levels. Note the high variation in the dTPP group, compared with the MitoQ group, with 6 of the 15 litters exhibiting sucrose preference scores within the range of the vehicle-treated group, with no mitigation. Neither ELA nor dTPP and MitoQ treatment had an impact on sucrose preference in adult male mice ( Extended Data Figs. 5-1 5-2 # Table 3 Extended Data Figure 5-3 10.1523/ENEURO.0172-25.2025.f5-1 Figure 5-1 Early life adversity (ELA) treatment has no impact on sucrose preference in male mice treated with vehicle (veh), dTPP and MitoQ compared to care-as-usual (CAU; Kruskal Wallis test, H(3) = 4.763, p = 0.190). The raw data contributing to this figure are included in Figure 5-2. Each symbol represents an independent sample, with the bars representing the group mean ± 95% confidence interval. Download Figure 5-1, TIF file 10.1523/ENEURO.0172-25.2025.f5-2 Figure 5-2 Male sucrose preference test data. Download Figure 5-2, XLS file 10.1523/ENEURO.0172-25.2025.f5-3 Figure 5-3 Female sucrose preference test data. Download Figure 5-3, XLS file Discussion The goal of the present study was to address the question of whether mitigating oxidative stress starting at weaning would ameliorate the impact of ELA on young adult physiology and behavior. We evaluated two outcomes: hippocampal complex I activity and sucrose preference, a measure of anhedonia. Mitochondrial dysfunction, including decreased complex I expression and activity, and disrupted reward-based behavior, including depression and anhedonia, are associated with ELA in clinical populations and preclinical animal models ( Ridout et al., 2018 Goodwill et al., 2019 Nold et al., 2019 Eagleson et al., 2020 Liu et al., 2021 Ruigrok et al., 2021b Gyllenhammer et al., 2022 Gorman-Sandler et al., 2023 Goodwill et al., 2019 Eagleson et al., 2020 Liu et al., 2021 Zheng et al., 2024 Eagleson et al., 2020 Ruigrok et al., 2021b Ruigrok et al., 2021a Maniam et al., 2015 Several approaches have been implemented in the LBN rodent model to improve ELA-induced behavioral dysfunction. Intracerebroventricular infusion of a selective corticotrophin-releasing hormone (CRH) receptor blocker in juveniles or adults ( Ivy et al., 2010 Short et al., 2020 Sun et al., 2023 Naninck et al., 2017 Yam et al., 2019 Geertsema et al., 2024 Reemst et al., 2024 Crh Bolton et al., 2018 Liu et al., 2021 Zheng et al., 2024 Picard et al., 2014 Hoffmann and Spengler, 2018 Picard and McEwen, 2018 Daniels et al., 2020 Birnie and Baram, 2025 Nold et al., 2019 Eagleson et al., 2020 Ruigrok et al., 2021b Gyllenhammer et al., 2022 Picard et al., 2018 Liu et al., 2002 Murphy, 2009 Yakes and Van Houten, 1997 Eagleson et al., 2020 Ruigrok et al., 2021b Eagleson et al., 2020 MitoQ, a mitochondrial antioxidant, was selected as the intervention in the current study as it has a demonstrated safety profile in adult clinical trials ( Gane et al., 2010 Snow et al., 2010 Williamson et al., 2020 Broome et al., 2021 Linder et al., 2024 Rodriguez-Cuenca et al., 2010 McManus et al., 2011 Stucki et al., 2016 McManus et al., 2011 Davies et al., 2013 Feillet-Coudray et al., 2014 Fink et al., 2014 Ahmed et al., 2015 Stucki et al., 2016 Bai et al., 2023 2 Gane et al., 2010 Snow et al., 2010 Rossman et al., 2018 Park et al., 2020 Williamson et al., 2020 Broome et al., 2021 Leo et al., 2008 Reily et al., 2013 Huang et al., 2015 Trnka et al., 2015 Bond et al., 2019 Le Gal et al., 2021 McManus et al., 2011 Reily et al., 2013 Trnka et al., 2015 Gottwald et al., 2018 Bond et al., 2019 Many preclinical studies initiated MitoQ treatment either at the same time or prior to an insult that induces a pathological state, with the goal of mitigating increases in oxidative stress and subsequent negative sequelae observed in the absence of MitoQ ( McManus et al., 2011 Xing et al., 2019 Haidar et al., 2022 Huang et al., 2022 Olajide et al., 2022 Gomez-Deza et al., 2023 Hu et al., 2023 Bannon et al., 2024 Böhm et al., 2025 Zhao et al., 2025 Goodwill et al., 2019 Ma et al., 2025 Eagleson et al., 2020 Stucki et al., 2016 Young and Franklin, 2019 Olesen et al., 2020 The present study demonstrates an association between mitigating oxidative stress and improved hippocampal mitochondrial function and sucrose preference. A role for the ventral hippocampus in sucrose preference has been reported, with an emphasis on projections to the nucleus accumbens ( Bagot et al., 2015 Sambolín-Escobales et al., 2022 Kwon et al., 2025 Williams et al., 2020 Brunson et al., 2005 Rice et al., 2008 Wang et al., 2011 Molet et al., 2016 Ruigrok et al., 2021b Naninck et al., 2015 Bath et al., 2017 References Adlam VJ Harrison JC Porteous CM James AM Smith RA Murphy MP Sammut IA 2005 Targeting an antioxidant to mitochondria decreases cardiac ischemia-reperfusion injury FASEB J 19 1088 1095 10.1096/fj.05-3718com 15985532 Ahmed E Donovan T Yujiao L Zhang Q 2015 Mitochondrial targeted antioxidant in cerebral ischemia J Neurol Neurosci 6 17 10.21767/2171-6625.100017 26937332 PMC4771373 Anda RF Croft JB Felitti VJ Nordenberg D Giles WH Williamson DF Giovino GA 1999 Adverse childhood experiences and smoking during adolescence and adulthood J Am Med Assoc 282 1652 1658 10.1001/jama.282.17.1652 10553792 Anda RF Felitti VJ Bremner JD Walker JD Whitfield C Perry BD Dube SR Giles WH 2006 The enduring effects of abuse and related adverse experiences in childhood. A convergence of evidence from neurobiology and epidemiology Eur Arch Psychiatry Clin Neurosci 256 174 186 10.1007/s00406-005-0624-4 16311898 PMC3232061 Armstrong JA Cash NJ Morton JC Tepikin AV Sutton R Criddle DN 2019 Mitochondrial targeting of antioxidants alters pancreatic acinar cell bioenergetics and determines cell fate Int J Mol Sci 20 1700 10.3390/ijms20071700 30959771 PMC6480340 Bagot RC et al. 2015 Ventral hippocampal afferents to the nucleus accumbens regulate susceptibility to depression Nat Commun 6 7062 10.1038/ncomms8062 25952660 PMC4430111 Bai Y et al. 2023 Effects of oxidative stress on hepatic encephalopathy pathogenesis in mice Nat Commun 14 4456 10.1038/s41467-023-40081-8 37488119 PMC10366183 Bannon ST Shatz N Wong R Parekh M Jurkunas UV 2024 Mitoq relieves mitochondrial dysfunction in UVA and cigarette smoke-induced Fuchs endothelial corneal dystrophy Exp Eye Res 247 110056 10.1016/j.exer.2024.110056 39179169 PMC11426332 Bath KG Nitenson AS Lichtman E Lopez C Chen W Gallo M Goodwill H Manzano-Nieves G 2017 Early life stress leads to developmental and sex selective effects on performance in a novel object placement task Neurobiol Stress 7 57 67 10.1016/j.ynstr.2017.04.001 28462362 PMC5408156 Birnie MT Baram TZ 2025 The evolving neurobiology of early-life stress Neuron 113 1474 1490 10.1016/j.neuron.2025.02.016 40101719 PMC12097948 Birnie MT Levis SC Mahler SV Baram TZ 2022 Developmental trajectories of anhedonia in preclinical models Curr Top Behav Neurosci 58 23 41 10.1007/7854_2021_299 35156184 PMC10226722 Bobba-Alves N et al. 2023 Cellular allostatic load is linked to increased energy expenditure and accelerated biological aging Psychoneuroendocrinology 155 106322 10.1016/j.psyneuen.2023.106322 37423094 PMC10528419 Böhm M Parekh M Deshpande N Cheung Q Shatz N Kumar V Jurkunas UV 2025 Mitochondria-targeted antioxidant (MitoQ) and nontargeted antioxidant (idebenone) mitigate mitochondrial dysfunction in corneal endothelial cells Cornea 44 492 503 10.1097/ICO.0000000000003801 39819808 PMC12186504 Bolton JL Molet J Regev L Chen Y Rismanchi N Haddad E Yang DZ Obenaus A Baram TZ 2018 Anhedonia following early-life adversity involves aberrant interaction of reward and anxiety circuits and is reversed by partial silencing of amygdala corticotropin-releasing hormone gene Biol Psychiatry 83 137 147 10.1016/j.biopsych.2017.08.023 29033027 PMC5723546 Bond ST Kim J Calkin AC Drew BG 2019 The antioxidant moiety of MitoQ imparts minimal metabolic effects in adipose tissue of high fat fed mice Front Physiol 10 543 10.3389/fphys.2019.00543 31139092 PMC6517842 Brand MD 2010 The sites and topology of mitochondrial superoxide production Exp Gerontol 45 466 472 10.1016/j.exger.2010.01.003 20064600 PMC2879443 Broome SC Braakhuis AJ Mitchell CJ Merry TL 2021 Mitochondria-targeted antioxidant supplementation improves 8 km time trial performance in middle-aged trained male cyclists J Int Soc Sports Nutr 18 58 10.1186/s12970-021-00454-0 34419082 PMC8379793 Brunson KL Kramar E Lin B Chen Y Colgin LL Yanagihara TK Lynch G Baram TZ 2005 Mechanisms of late-onset cognitive decline after early-life stress J Neurosci 25 9328 9338 10.1523/JNEUROSCI.2281-05.2005 16221841 PMC3100717 Cadenas E Davies KJ 2000 Mitochondrial free radical generation, oxidative stress, and aging Free Radic Biol Med 29 222 230 10.1016/S0891-5849(00)00317-8 11035250 Chaudhari PR Singla A Vaidya VA 2022 Early adversity and accelerated brain aging: a mini-review Front Mol Neurosci 15 822917 10.3389/fnmol.2022.822917 35392273 PMC8980717 Chen W et al. 2020 Inhibition of mitochondrial ROS by MitoQ alleviates white matter injury and improves outcomes after intracerebral haemorrhage in mice Oxid Med Cell Longev 2020 8285065 10.1155/2020/8285065 31998445 PMC6969671 Cprek SE Williamson LH McDaniel H Brase R Williams CM 2020 Adverse childhood experiences (ACEs) and risk of childhood delays in children ages 1–5 Child Adolesc Soc Work J 37 15 24 10.1007/s10560-019-00622-x Danese A Moffitt TE Harrington H Milne BJ Polanczyk G Pariante CM Poulton R Caspi A 2009 Adverse childhood experiences and adult risk factors for age-related disease: depression, inflammation, and clustering of metabolic risk markers Arch Pediatr Adolesc Med 163 1135 1143 10.1001/archpediatrics.2009.214 19996051 PMC3560401 Daniels TE Olsen EM Tyrka AR 2020 Stress and psychiatric disorders: the role of mitochondria Annu Rev Clin Psychol 16 165 186 10.1146/annurev-clinpsy-082719-104030 32092280 PMC8007172 Davies AL et al. 2013 Neurological deficits caused by tissue hypoxia in neuroinflammatory disease Ann Neurol 74 815 825 10.1002/ana.24006 24038279 Deschenes SS Graham E Kivimaki M Schmitz N 2018 Adverse childhood experiences and the risk of diabetes: examining the roles of depressive symptoms and cardiometabolic dysregulations in the Whitehall II cohort study Diabetes Care 41 2120 2126 10.2337/dc18-0932 30072405 PMC6150425 Dube SR Felitti VJ Dong M Chapman DP Giles WH Anda RF 2003 Childhood abuse, neglect, and household dysfunction and the risk of illicit drug use: the adverse childhood experiences study Pediatrics 111 564 572 10.1542/peds.111.3.564 12612237 Dube SR Fairweather D Pearson WS Felitti VJ Anda RF Croft JB 2009 Cumulative childhood stress and autoimmune diseases in adults Psychosom Med 71 243 250 10.1097/PSY.0b013e3181907888 19188532 PMC3318917 Duke NN Borowsky IW 2018 Health status of adolescents reporting experiences of adversity Glob Pediatr Health 5 2333794X18769555 10.1177/2333794X18769555 PMC5900812 29687049 Eagleson KL Villaneuva M Southern RM Levitt P 2020 Proteomic and mitochondrial adaptations to early-life stress are distinct in juveniles and adults Neurobiol Stress 13 100251 10.1016/j.ynstr.2020.100251 33344706 PMC7739184 Edwards VJ Holden GW Felitti VJ Anda RF 2003 Relationship between multiple forms of childhood maltreatment and adult mental health in community respondents: results from the adverse childhood experiences study Am J Psychiatry 160 1453 1460 10.1176/appi.ajp.160.8.1453 12900308 Feillet-Coudray C et al. 2014 The mitochondrial-targeted antioxidant MitoQ ameliorates metabolic syndrome features in obesogenic diet-fed rats better than apocynin or allopurinol Free Radic Res 48 1232 1246 10.3109/10715762.2014.945079 25066801 Felitti VJ Anda RF Nordenberg D Williamson DF Spitz AM Edwards V Koss MP Marks JS 1998 Relationship of childhood abuse and household dysfunction to many of the leading causes of death in adults. The Adverse Childhood Experiences (ACE) study Am J Prev Med 14 245 258 10.1016/S0749-3797(98)00017-8 9635069 Fink BD Herlein JA Guo DF Kulkarni C Weidemann BJ Yu L Grobe JL Rahmouni K Kerns RJ Sivitz WI 2014 A mitochondrial-targeted coenzyme q analog prevents weight gain and ameliorates hepatic dysfunction in high-fat-fed mice J Pharmacol Exp Ther 351 699 708 10.1124/jpet.114.219329 25301169 PMC4244581 Fouret G et al. 2015 The mitochondrial-targeted antioxidant, MitoQ, increases liver mitochondrial cardiolipin content in obesogenic diet-fed rats Biochim Biophys Acta 1847 1025 1035 10.1016/j.bbabio.2015.05.019 26028302 Gane EJ Weilert F Orr DW Keogh GF Gibson M Lockhart MM Frampton CM Taylor KM Smith RA Murphy MP 2010 The mitochondria-targeted anti-oxidant mitoquinone decreases liver damage in a phase II study of hepatitis C patients Liver Int 30 1019 1026 10.1111/j.1478-3231.2010.02250.x 20492507 Gateau K Schlueter L Pierce LJ Thompson B Gharib A Durazo-Arvizu RA Nelson CA Levitt P 2023 Exploratory study evaluating the relationships between perinatal adversity, oxidative stress, and infant neurodevelopment across the first year of life PLoS Glob Public Health 3 e0001984 10.1371/journal.pgph.0001984 38153909 PMC10754429 Geertsema J et al. 2024 Coffee polyphenols ameliorate early-life stress-induced cognitive deficits in male mice Neurobiol Stress 31 100641 10.1016/j.ynstr.2024.100641 38827176 PMC11140806 Gilgoff R Singh L Koita K Gentile B Marques SS 2020 Adverse childhood experiences, outcomes, and interventions Pediatr Clin North Am 67 259 273 10.1016/j.pcl.2019.12.001 32122559 Gioscia-Ryan RA Battson ML Cuevas LM Eng JS Murphy MP Seals DR 2018 Mitochondria-targeted antioxidant therapy with MitoQ ameliorates aortic stiffening in old mice J Appl Physiol 124 1194 1202 10.1152/japplphysiol.00670.2017 29074712 PMC6008077 Gluckman PD Hanson MA Mitchell MD 2010 Developmental origins of health and disease: reducing the burden of chronic disease in the next generation Genome Med 2 14 10.1186/gm135 20236494 PMC2847705 Gomez-Deza J Slavutsky AL Nebiyou M Le Pichon CE 2023 Local production of reactive oxygen species drives vincristine-induced axon degeneration Cell Death Dis 14 807 10.1038/s41419-023-06227-8 38065950 PMC10709426 Goodwill HL Manzano-Nieves G Gallo M Lee HI Oyerinde E Serre T Bath KG 2019 Early life stress leads to sex differences in development of depressive-like outcomes in a mouse model Neuropsychopharmacology 44 711 720 10.1038/s41386-018-0195-5 30188513 PMC6372611 Gorman-Sandler E Robertson B Crawford J Wood G Ramesh A Arishe OO Webb RC Hollis F 2023 Gestational stress decreases postpartum mitochondrial respiration in the prefrontal cortex of female rats Neurobiol Stress 26 100563 10.1016/j.ynstr.2023.100563 37654512 PMC10466928 Gottwald EM Duss M Bugarski M Haenni D Schuh CD Landau EM Hall AM 2018 The targeted anti-oxidant MitoQ causes mitochondrial swelling and depolarization in kidney tissue Physiol Rep 6 e13667 10.14814/phy2.13667 29611340 PMC5880956 Greenberg PE Fournier AA Sisitsky T Pike CT Kessler RC 2015 The economic burden of adults with major depressive disorder in the United States (2005 and 2010) J Clin Psychiatry 76 155 162 10.4088/JCP.14m09298 25742202 Gyllenhammer LE Picard M McGill MA Boyle KE Vawter MP Rasmussen JM Buss C Entringer S Wadhwa PD 2022 Prospective association between maternal allostatic load during pregnancy and child mitochondrial content and bioenergetic capacity Psychoneuroendocrinology 144 105868 10.1016/j.psyneuen.2022.105868 35853381 PMC9706402 Haidar MA et al. 2022 Mitoquinone helps combat the neurological, cognitive, and molecular consequences of open head traumatic brain injury at chronic time point Biomedicines 10 250 10.3390/biomedicines10020250 35203460 PMC8869514 Hoffmann A Spengler D 2018 The mitochondrion as potential interface in early-life stress brain programming Front Behav Neurosci 12 306 10.3389/fnbeh.2018.00306 30574076 PMC6291450 Horn SR Leve LD Levitt P Fisher PA 2019 Childhood adversity, mental health, and oxidative stress: a pilot study PLoS One 14 e0215085 10.1371/journal.pone.0215085 31026258 PMC6485615 Hu TH et al. 2023 HDGF stimulates liver tumorigenesis by enhancing reactive oxygen species generation in mitochondria J Biol Chem 299 105335 10.1016/j.jbc.2023.105335 37827291 PMC10654039 Huang T Shen J Bao B Hu W Sun Y Zhu T Lin J Gao T Li X Zheng X 2022 Mitochondrial-targeting antioxidant MitoQ modulates angiogenesis and promotes functional recovery after spinal cord injury Brain Res 1786 147902 10.1016/j.brainres.2022.147902 35381215 Huang W et al. 2015 Effects of the mitochondria-targeted antioxidant mitoquinone in murine acute pancreatitis Mediators Inflamm 2015 901780 10.1155/2015/901780 25878403 PMC4386569 Ivy AS Rex CS Chen Y Dube C Maras PM Grigoriadis DE Gall CM Lynch G Baram TZ 2010 Hippocampal dysfunction and cognitive impairments provoked by chronic early-life stress involve excessive activation of CRH receptors J Neurosci 30 13005 13015 10.1523/JNEUROSCI.1784-10.2010 20881118 PMC2991143 Jeong JH Koo JH Yook JS Cho JY Kang EB 2021 Neuroprotective benefits of exercise and MitoQ on memory function, mitochondrial dynamics, oxidative stress, and neuroinflammation in D-galactose-induced aging rats Brain Sci 11 164 10.3390/brainsci11020164 33514020 PMC7910851 Kwon H et al. 2025 Chronic stress-related behavioral and synaptic changes require caspase-3 activation in the ventral hippocampus of male mice Neuropharmacology 272 110431 10.1016/j.neuropharm.2025.110431 40147637 Le Gal K Wiel C Ibrahim MX Henricsson M Sayin VI Bergo MO 2021 Mitochondria-targeted antioxidants MitoQ and MitoTEMPO do not influence BRAF-driven malignant melanoma and KRAS-driven lung cancer progression in mice Antioxidants 10 163 10.3390/brainsci11020164 33499262 PMC7912553 Leo S Szabadkai G Rizzuto R 2008 The mitochondrial antioxidants MitoE(2) and MitoQ(10) increase mitochondrial Ca(2+) load upon cell stimulation by inhibiting Ca(2+) efflux from the organelle Ann N Y Acad Sci 1147 264 274 10.1196/annals.1427.019 19076448 PMC2676430 Liao PC Bergamini C Fato R Pon LA Pallotti F 2020 Isolation of mitochondria from cells and tissues Methods Cell Biol 155 3 31 10.1016/bs.mcb.2019.10.002 32183964 PMC8530414 Lim S et al. 2011 Mitochondria-targeted antioxidants protect pancreatic beta-cells against oxidative stress and improve insulin secretion in glucotoxicity and glucolipotoxicity Cell Physiol Biochem 28 873 886 10.1159/000335802 22178940 Linder BA Stute NL Hutchison ZJ Barnett AM Tharpe MA Kavazis AN Kirkman DL Gutierrez OM Robinson AT 2024 Acute high-dose MitoQ does not increase urinary kidney injury markers in healthy adults: a randomized crossover trial Am J Physiol Renal Physiol 326 F135 F142 10.1152/ajprenal.00186.2023 37942539 PMC11198989 Liu X et al. 2021 Vortioxetine attenuates the effects of early-life stress on depression-like behaviors and monoamine transporters in female mice Neuropharmacology 186 108468 10.1016/j.neuropharm.2021.108468 33485943 Liu Y Fiskum G Schubert D 2002 Generation of reactive oxygen species by the mitochondrial electron transport chain J Neurochem 80 780 787 10.1046/j.0022-3042.2002.00744.x 11948241 Ma YN et al. 2025 Dorsal CA1 NECTIN3 reduction mediates early-life stress-induced object recognition memory deficits in adolescent female mice Neurosci Bull 41 243 260 10.1007/s12264-024-01305-z 39395912 PMC11794733 Maiti AK Spoorthi BC Saha NC Panigrahi AK 2018 Mitigating peroxynitrite mediated mitochondrial dysfunction in aged rat brain by mitochondria-targeted antioxidant MitoQ Biogerontology 19 271 286 10.1007/s10522-018-9756-6 29774505 Maniam J Antoniadis CP Morris MJ 2015 The effect of early-life stress and chronic high-sucrose diet on metabolic outcomes in female rats Stress 18 524 537 10.3109/10253890.2015.1079617 26365331 Mao P Manczak M Shirendeb UP Reddy PH 2013 MitoQ, a mitochondria-targeted antioxidant, delays disease progression and alleviates pathogenesis in an experimental autoimmune encephalomyelitis mouse model of multiple sclerosis Biochim Biophys Acta 1832 2322 2331 10.1016/j.bbadis.2013.09.005 24055980 PMC3830526 McManus MJ Murphy MP Franklin JL 2011 The mitochondria-targeted antioxidant MitoQ prevents loss of spatial memory retention and early neuropathology in a transgenic mouse model of Alzheimer's disease J Neurosci 31 15703 15715 10.1523/JNEUROSCI.0552-11.2011 22049413 PMC3334845 Molet J Maras PM Kinney-Lang E Harris NG Rashid F Ivy AS Solodkin A Obenaus A Baram TZ 2016 MRI uncovers disrupted hippocampal microstructure that underlies memory impairments after early-life adversity Hippocampus 26 1618 1632 10.1002/hipo.22661 27657911 PMC5452614 Monzel AS Levin M Picard M 2024 The energetics of cellular life transitions Life Metab 3 load051 10.1093/lifemeta/load051 38566850 PMC10984639 Murphy MP 2009 How mitochondria produce reactive oxygen species Biochem J 417 1 13 10.1042/BJ20081386 19061483 PMC2605959 Murphy MP Smith RA 2007 Targeting antioxidants to mitochondria by conjugation to lipophilic cations Annu Rev Pharmacol Toxicol 47 629 656 10.1146/annurev.pharmtox.47.120505.105110 17014364 Naninck EF Hoeijmakers L Kakava-Georgiadou N Meesters A Lazic SE Lucassen PJ Korosi A 2015 Chronic early life stress alters developmental and adult neurogenesis and impairs cognitive function in mice Hippocampus 25 309 328 10.1002/hipo.22374 25269685 Naninck EF et al. 2017 Early micronutrient supplementation protects against early stress-induced cognitive impairments FASEB J 31 505 518 10.1096/fj.201600834R 27770020 Newnham JP Ross MG 2009 Early life origins of human health and disease Basel: Karger Nold V Sweatman C Karabatsiakis A Böck C Bretschneider T Lawless N Fundel-Clemens K Kolassa IT Allers KA 2019 Activation of the kynurenine pathway and mitochondrial respiration to face allostatic load in a double-hit model of stress Psychoneuroendocrinology 107 148 159 10.1016/j.psyneuen.2019.04.006 31129488 Olajide OJ La Rue C Bergdahl A Chapman CA 2022 Inhibiting amyloid beta (1-42) peptide-induced mitochondrial dysfunction prevents the degradation of synaptic proteins in the entorhinal cortex Front Aging Neurosci 14 960314 10.3389/fnagi.2022.960314 36275011 PMC9582742 Olesen MA Torres AK Jara C Murphy MP Tapia-Rojas C 2020 Premature synaptic mitochondrial dysfunction in the hippocampus during aging contributes to memory loss Redox Biol 34 101558 10.1016/j.redox.2020.101558 32447261 PMC7248293 Park SY Pekas EJ Headid RJ 3rd Son WM Wooden TK Song J Layec G Yadav SK Mishra PK Pipinos II 2020 Acute mitochondrial antioxidant intake improves endothelial function, antioxidant enzyme activity, and exercise tolerance in patients with peripheral artery disease Am J Physiol Heart Circ Physiol 319 H456 H467 10.1152/ajpheart.00235.2020 32706261 Picard M McEwen BS 2018 Psychological stress and mitochondria: a conceptual framework Psychosom Med 80 126 140 10.1097/PSY.0000000000000544 29389735 PMC5901651 Picard M Juster RP McEwen BS 2014 Mitochondrial allostatic load puts the ‘gluc’ back in glucocorticoids Nat Rev Endocrinol 10 303 310 10.1038/nrendo.2014.22 24663223 Picard M Juster RP Sloan RP McEwen BS 2017 Mitochondrial nexus to allostatic load biomarkers Psychosom Med 79 114 117 10.1097/PSY.0000000000000414 27806021 PMC5901647 Picard M McEwen B Epel ES Sandi C 2018 An energetic view of stress: focus on mitochondria Front Neuroendocrinol 49 72 85 10.1016/j.yfrne.2018.01.001 29339091 PMC5964020 Reemst K Lopizzo N Abbink MR Engelenburg HJ Cattaneo A Korosi A 2024 Molecular underpinnings of programming by early-life stress and the protective effects of early dietary ω6/ω3 ratio, basally and in response to LPS: integrated mRNA-miRNAs approach Brain Behav Immun 117 283 297 10.1016/j.bbi.2024.01.011 38242369 Reily C Mitchell T Chacko BK Benavides G Murphy MP Darley-Usmar V 2013 Mitochondrially targeted compounds and their impact on cellular bioenergetics Redox Biol 1 86 93 10.1016/j.redox.2012.11.009 23667828 PMC3647698 Rice CJ Sandman CA Lenjavi MR Baram TZ 2008 A novel mouse model for acute and long-lasting consequences of early life stress Endocrinology 149 4892 4900 10.1210/en.2008-0633 18566122 PMC2582918 Ridout KK Khan M Ridout SJ 2018 Adverse childhood experiences run deep: toxic early life stress, telomeres, and mitochondrial DNA copy number, the biological markers of cumulative stress Bioessays 40 e1800077 10.1002/bies.201800077 30067291 Rodriguez-Cuenca S et al. 2010 Consequences of long-term oral administration of the mitochondria-targeted antioxidant MitoQ to wild-type mice Free Radic Biol Med 48 161 172 10.1016/j.freeradbiomed.2009.10.039 19854266 Rossman MJ et al. 2018 Chronic supplementation with a mitochondrial antioxidant (MitoQ) improves vascular function in healthy older adults Hypertension 71 1056 1063 10.1161/HYPERTENSIONAHA.117.10787 29661838 PMC5945293 Ruigrok SR Stöberl N Yam KY de Lucia C Lucassen PJ Thuret S Korosi A 2021a Modulation of the hypothalamic nutrient sensing pathways by sex and early-life stress Front Neurosci 15 695367 10.3389/fnins.2021.695367 34366778 PMC8342927 Ruigrok SR et al. 2021b Effects of early-life stress on peripheral and central mitochondria in male mice across ages Psychoneuroendocrinology 132 105346 10.1016/j.psyneuen.2021.105346 34274734 Sambolín-Escobales L Feliciano-Quiñones A Tirado-Castro L Suárez C Pacheco-Cruz D Irizarry-Méndez N Fonseca-Ferrer W Hernández-López A Colón-Romero M Porter JT 2022 Infusion of C20:0 ceramide into ventral hippocampus triggers anhedonia-like behavior in female and male rats Front Behav Neurosci 16 899627 10.3389/fnbeh.2022.899627 36090653 PMC9449580 Santini E Turner KL Ramaraj AB Murphy MP Klann E Kaphzan H 2015 Mitochondrial superoxide contributes to hippocampal synaptic dysfunction and memory deficits in Angelman syndrome model mice J Neurosci 35 16213 16220 10.1523/JNEUROSCI.2246-15.2015 26658871 PMC4682786 Shaulson ED Cohen AA Picard M 2024 The brain-body energy conservation model of aging Nat Aging 4 1354 1371 10.1038/s43587-024-00716-x 39379694 Short AK Maras PM Pham AL Ivy AS Baram TZ 2020 Blocking CRH receptors in adults mitigates age-related memory impairments provoked by early-life adversity Neuropsychopharmacology 45 515 523 10.1038/s41386-019-0562-x 31698409 PMC6969076 Snow BJ Rolfe FL Lockhart MM Frampton CM O'Sullivan JD Fung V Smith RA Murphy MP Taylor KM 2010 A double-blind, placebo-controlled study to assess the mitochondria-targeted antioxidant MitoQ as a disease-modifying therapy in Parkinson's disease Mov Disord 25 1670 1674 10.1002/mds.23148 20568096 Stucki DM Ruegsegger C Steiner S Radecke J Murphy MP Zuber B Saxena S 2016 Mitochondrial impairments contribute to spinocerebellar ataxia type 1 progression and can be ameliorated by the mitochondria-targeted antioxidant MitoQ Free Radic Biol Med 97 427 440 10.1016/j.freeradbiomed.2016.07.005 27394174 Sun YX et al. 2023 The causal involvement of the BDNF-TrkB pathway in dentate gyrus in early-life stress-induced cognitive deficits in male mice Transl Psychiatry 13 173 10.1038/s41398-023-02476-5 37225683 PMC10209152 Trnka J Elkalaf M Anděl M 2015 Lipophilic triphenylphosphonium cations inhibit mitochondrial electron transport chain and induce mitochondrial proton leak PLoS One 10 e0121837 10.1371/journal.pone.0121837 25927600 PMC4415762 Turrens JF 2003 Mitochondrial formation of reactive oxygen species J Physiol 552 335 344 10.1113/jphysiol.2003.049478 14561818 PMC2343396 Walker CD et al. 2017 Chronic early life stress induced by limited bedding and nesting (LBN) material in rodents: critical considerations of methodology, outcomes and translational potential Stress 20 421 448 10.1080/10253890.2017.1343296 28617197 PMC5705407 Wang XD et al. 2011 Forebrain CRF(1) modulates early-life stress-programmed cognitive deficits J Neurosci 31 13625 13634 10.1523/JNEUROSCI.2259-11.2011 21940453 PMC3380621 Waters H Graf M 2018 The costs of chronic disease in U.S. Miliken Institute and medical expenditure panel survey. Available at: https://milkeninstituteorg/sites/default/files/reports-pdf/ChronicDiseases-HighRes-FINALpdf Williams ES Manning CE Eagle AL Swift-Gallant A Duque-Wilckens N Chinnusamy S Moeser A Jordan C Leinninger G Robison AJ 2020 Androgen-dependent excitability of mouse ventral hippocampal afferents to nucleus accumbens underlies sex-specific susceptibility to stress Biol Psychiatry 87 492 501 10.1016/j.biopsych.2019.08.006 31601425 PMC7035179 Williamson J Hughes CM Cobley JN Davison GW 2020 The mitochondria-targeted antioxidant MitoQ, attenuates exercise-induced mitochondrial DNA damage Redox Biol 36 101673 10.1016/j.redox.2020.101673 32810739 PMC7452004 Xing J Han D Xu D Li X Sun L 2019 CREB protects against temporal lobe epilepsy associated with cognitive impairment by controlling oxidative neuronal damage Neurodegener Dis 19 225 237 10.1159/000507023 32417838 Yakes FM Van Houten B 1997 Mitochondrial DNA damage is more extensive and persists longer than nuclear DNA damage in human cells following oxidative stress Proc Natl Acad Sci U S A 94 514 519 10.1073/pnas.94.2.514 9012815 PMC19544 Yam KY et al. 2019 Increasing availability of omega-3 fatty acid in the early-life diet prevents the early-life stress-induced cognitive impairments without affecting metabolic alterations FASEB J 33 5729 5740 10.1096/fj.201802297R 30673509 Young ML Franklin JL 2019 The mitochondria-targeted antioxidant MitoQ inhibits memory loss, neuropathology, and extends lifespan in aged 3xTg-AD mice Mol Cell Neurosci 101 103409 10.1016/j.mcn.2019.103409 31521745 PMC7359863 Zhao Y Xiong R Jin S Li Y Dong T Wang W Song X Guan C 2025 Mitoq alleviates H(2)O(2)-induced mitochondrial dysfunction in keratinocytes through the Nrf2/PINK1 pathway Biochem Pharmacol 234 116811 10.1016/j.bcp.2025.116811 39978690 Zheng JY Li XX Liu X Zhang CC Sun YX Ma YN Wang HL Su YA Si TM Li JT 2024 Fluoxetine reverses early-life stress-induced depressive-like behaviors and region-specific alterations of monoamine transporters in female mice Pharmacol Biochem Behav 237 173722 10.1016/j.pbb.2024.173722 38336220 Zitkovsky EK Daniels TE Tyrka AR 2021 Mitochondria and early-life adversity Mitochondrion 57 213 221 10.1016/j.mito.2021.01.005 33484871 PMC8172448 Synthesis Reviewing Editor: Sam Golden, The University of Washington Decisions are customarily a result of the Reviewing Editor and the peer reviewers coming together and discussing their recommendations until a consensus is reached. When revisions are invited, a fact-based synthesis statement explaining their decision and outlining what is needed to prepare a revision will be listed below. The following reviewer(s) agreed to reveal their identity: T Chase Francis. Dear Dr. Eagleson, It has been very difficult to identify a second reviewer for your submission, I appreciate your patience. I have decided to move forward with comments based on one expert reviewer, who found your manuscript of interest and has suggested appropriate revisions. I will take an active role in reviewing the rebuttal in lieu of waiting to identify a second reviewer and further delaying your ability to respond to the comments. Below you will find the comments, should you like to revise your manuscript for re-review, please be sure to address them on a point by point basis. Reviewer 1: The authors present the effects of an early life adversity (ELA) model on hippocampal mitochondrial complex I function and behavior. The authors treat ELA mice with treatments aimed to enhance mitochondrial function during this ELA. There are a few statistical comparisons lacking in the manuscript. The primary concern is the differential effect on male and female mice at baseline within the ELA which makes direct comparisons difficult. See comments below: • Post-hoc comparisons between treated and non-treated groups should be conducted, not just between sex comparisons, especially between CAU vehicle and ELA vehicle or ELA treatment. This outcome could be due to the ineffectiveness of the ELA paradigm on male animals in sucrose preference and so males are not the appropriate comparison. In addition, there needs to be an additional group to compare CAU vehicle with CAU treatments (dTPP and/or mitoQ) in bodyweight, sucrose preference, and complex I activity. • The ELA model appears to affect hedonic outcomes in females only both in the data presented and the literature cited. The introduction should frame this as a sex-specific ELA/stress paradigm. Please also provide a comment in the discussion on the predicted reason as to why ELA did not affect sucrose preference in male mice. • While raw weight gain is indeed informative, changes in weight gain (%) for each animal over time would be beneficial for a within-groups measure. • Error bars are needed on each of the figures. • Sucrose consumption behavior is typically used to measure loss of pleasure or to measure the rewarding effect. In Figure 4, it difficult to tie this to anhedonia because there is a complex I deficiency in ELA females as shown in Figure 3. Therefore, it is not possible to discern that decreased sucrose consumption is a sign of a depression-like phenotype or simply a mean decrease in intake of calories due to decreased metabolism. Minor • Individual points need to be labeled in the figure, not just in the legend. Label red as female and blue as male. • Divide the sentence at \"because\" in line 81-87 to increase readibility. • Consider removing \"which is a key generator of free 91 radicals that produce oxidative stress\" in line 90-91 due to repetition in line 71-72. • Line 263: Add \"of\" between \"the impact\" and \"ELA\". ",
  "metadata": {
    "Title of this paper": "Mitochondria and early-life adversity",
    "Journal it was published in:": "eNeuro",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469007/"
  }
}