{
  "title": "Paper_981",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470294 PMC12470294.1 12470294 12470294 41010682 10.3390/jcm14186478 jcm-14-06478 1 Review Endotoxin’s Impact on Organism: From Immune Activation to Tolerance and Beyond https://orcid.org/0009-0007-6353-0577 Roszak Kacper * https://orcid.org/0000-0002-3742-5649 Roy Konkonika https://orcid.org/0000-0003-4640-9533 Sobocińska Justyna https://orcid.org/0000-0001-8930-6097 Spisz Paulina https://orcid.org/0000-0001-8950-5643 Jędrzejewski Tomasz https://orcid.org/0000-0001-8744-7822 Wrotek Sylwia * Hönemann Christian Academic Editor Department of Immunology, Faculty of Biological and Veterinary Sciences, Nicolaus Copernicus University in Toruń, 87-100 Toruń, Poland; konkonika.roy@doktorant.umk.pl j.sobocinska@umk.pl p.spisz@umk.pl tomaszj@umk.pl * k_roszak@doktorant.umk.pl wrotek@umk.pl 14 9 2025 9 2025 14 18 497642 6478 27 8 2025 10 9 2025 11 9 2025 14 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Endotoxin, a key component of Gram-negative bacterial membranes, remains a central focus in understanding host–pathogen interactions and immune modulation. In this review, we examine the multifaceted roles of endotoxin, with particular emphasis on how its structural variants modulate host immune recognition and inflammatory signalling. We explore the complex mechanisms by which endotoxin activates innate immune pathways and how these responses evolve under repeated or chronic exposure conditions. Special attention is given to the phenomenon of endotoxin tolerance, an adaptive reprogramming of immune cells that can profoundly alter inflammatory outcomes. While this tolerance serves as a protective mechanism against hyperinflammation, mounting evidence suggests that it may have a “dark side”, potentially impairing immune surveillance and promoting disease states such as cancer. We also discuss emerging clinical and therapeutic strategies that harness or counteract endotoxin-driven responses, from vaccine adjuvants to anti-sepsis interventions. By integrating recent findings from immunology, microbiology, and translational medicine, this review sheds light on the dual nature of endotoxin and its far-reaching implications for human health. endotoxin LPS endotoxin tolerance inflammation sepsis septic shock endotoxemia inflammasome TLR4 signalling tumor microenvironment National Science Centre, Poland 2020/39/O/NZ5/00915 This research was funded by the National Science Centre, Poland, grant number 2020/39/O/NZ5/00915. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Endotoxin, most commonly represented by lipopolysaccharide (LPS), is a key component of the outer membrane of Gram-negative bacteria. Upon bacterial infection, endotoxin is recognised by the host immune system, triggering a cascade of immune responses aimed at combating the invading pathogens. This includes the activation of various immune cells, the release of pro-inflammatory cytokines, and the initiation of adaptive immune responses [ 1 Initially, the immune system mounts an acute response to LPS, aiming to eliminate bacteria. However, when the pathogen cannot be fully eradicated, chronic low-grade inflammation may develop. This immune state has been implicated in the development of various chronic diseases, including atherosclerosis, insulin resistance, and even cancer [ 2 3 4 This review aims to clarify the dualistic nature of endotoxin, from immune activation to immune suppression, and highlight its significance in health and disease by synthesising recent advances in endotoxin signalling, tolerance development, immune adaptation, and exploring potential clinical applications and therapeutic targets. 2. Endotoxin—A Pivotal Pro-Inflammatory Factor in Gram-Negative Bacterial Pathogenesis LPS is a classic example of a Pathogen-Associated Molecular Pattern (PAMP), a conserved molecule found in many pathogens and recognised by the innate immune system. It is specifically found in the outer membrane of Gram-negative bacteria [ 3 Escherichia coli 5 Klebsiella pneumoniae 6 Pseudomonas aeruginosa 7 Many years of research have led to our understanding of the structure of LPS. It is known that endotoxin consists of three functionally, biosynthetically and structurally independent parts: the O-antigen, core and lipid A [ 8 Figure 1 For most Gram-negative bacteria, it is ordered and coherent, but there are exceptions, e.g., environmental strains [ 9 14 Neisseria 15 Haemophilus 16 Xanthomonas oryzae 17 Campylobacter 18 8 3. Structural Modifications of Endotoxin Act as a Defence Mechanism for Bacteria, Shielding Them from the Immune System’s Attacks To survive in the host, bacteria must deceive the immune system’s arsenal. Bacteria have developed many strategies, one of which is making changes in the structure of LPS. This strategy allows pathogens to stay under the immune system’s radar, dampening its ability to respond effectively. Among various structural alterations, modifications of lipid A are the most extensively studied, as they have the most significant impact on immune recognition. In contrast, changes in the core oligosaccharide or O-antigen regions occur less frequently and are typically subtler in their effects. It has been found that bacteria deceive the immune system by changing the molecule’s overall charge by removing phosphates from the core and disaccharide backbone of lipid A [ 8 8 Concealing the charge of lipid A helps protect bacteria from cationic anti-microbial peptides (CAMPs), which are part of the host’s innate immunity [ 19 Pseudomonas aeruginosa Burkholderia species 20 Proteus mirabilis 21 Klebsiella pneumoniae 22 Yersinia pseudotuberculosis 23 Salmonella typhimurium 24 S. typhimurium H. pylori 25 Another bacterial strategy involves altering the degree and pattern of acylation of the lipid A moiety. This may contribute to the LPS being undetected by host immune cells or a change in the induced cytokine response [ 26 Shigella flexneri 27 28 29 Yersinia pestis 29 F. tularensis H. pylori 30 H. pylori 25 29 The next mechanism enabling pathogens to evade immune detection involves the differentiation of LPS carbohydrate domains (antigenic variability). Neisseria H. influenzae Neisseria 31 32 H. influenzae 31 33 H. influenzae 34 10 35 36 37 4. How Do Organisms Sense LPS? Endotoxin, when introduced into the body, can lead to the activation of the innate immune response, primarily by activating the monocytes/macrophages, followed by the release of pro-inflammatory factors such as interferon (IFN) γ, tumour necrosis factor α (TNF-α), IL-6, IL-17, IL-1β, etc. [ 38 Figure 2 39 40 In the MyD88-dependent pathway, the TIR domain of TLR4 first interacts with the Toll-interleukin-1 Receptor (TIR) domain-containing adaptor protein (TIRAP), which then facilitates the recruitment of the MyD88 adaptor protein. MyD88 subsequently binds to the TLR4-TIRAP complex, leading to the recruitment of interleukin-1 receptor-associated kinases (IRAKs) and tumour necrosis factor receptor-associated factor 6 (TRAF6), which in turn activate transforming growth factor-β-activated kinase 1 (TAK1) ( Figure 2 41 42 TLR4 signalling can also occur independently of the MyD88 adaptor molecule through an alternative pathway known as the TLR4-MyD88-independent pathway [ 43 Figure 2 44 45 46 In addition, TRIF can also activate the NF-κB pathway via receptor-interacting protein 1 (RIP1) and TRAF3, leading to the expression of pro-inflammatory cytokines such as TNF-α and IL-6 [ 47 48 49 50 51 5. Inflammasome Signalling Following the recognition of bacterial LPS by TLR4, a cascade of intracellular signalling is initiated, culminating in the activation of transcription factors such as NF-κB. This transcriptional response leads to the upregulation of numerous inflammatory mediators, including cytokines, chemokines, and components of the inflammasome machinery such as nucleotide-binding oligomerization domain (NOD)-like pyrin domain-containing protein 3 (NLRP3) [ 52 53 52 Figure 3 53 In the canonical pathway, TLR4-driven priming induces the transcription of NLRP3, pro-IL-1β, and pro-IL-18. Full activation of the canonical pathway requires the second signal, which is provided by stimuli such as extracellular ATP, pore-forming toxins, or crystalline particles. This leads to NLRP3 oligomerisation and assembly of a cytoplasmic complex composed of NLRP3, the adaptor protein ASC (apoptosis-associated speck-like protein containing a CARD) , 53 54 55 In parallel, the non-canonical pathway provides an alternative route of inflammasome activation that serves as a defence mechanism against pathogens that have developed strategies to evade TLR4 ( Figure 3 56 57 58 59 60 61 6. Acute Host Response to Endotoxin: Fever as a Hallmark of Endotoxin-Induced Inflammation LPS triggers a rapid and robust acute inflammatory response driven by the activation of innate immune pathways. As mentioned above, engagement of receptors such as TLR4 leads to the release of pro-inflammatory cytokines like TNF-α, IL-1β, and IL-6. This cascade results in the classical hallmarks of acute inflammation, including leukocyte recruitment, increased vascular permeability, and fever. Among these, fever is one of the most recognisable and evolutionarily conserved responses to infection. Historical references to endotoxin date back to the 18th century, when it was observed that a substance derived from decaying organic matter could induce fever [ 8 62 63 62 64 64 65 62 64 65 66 7. Beyond the Acute Response: Chronic Inflammation and Endotoxin Tolerance as Distinct Immune Outcomes of Endotoxin Exposure 7.1. Chronic Inflammation While acute inflammation is a protective and self-limiting response to infection or injury, failure to resolve it properly can lead to a chronic inflammatory state. This transition may occur when the initial stimulus persists or regulatory mechanisms break down. Unlike in acute inflammation, where cytokine release is rapidly downregulated after pathogen clearance, LPS-driven chronic inflammation maintains a low-grade but persistent immune activation that disrupts tissue homeostasis. Over time, this state contributes to tissue damage, remodelling, and, in some cases, fibrosis [ 2 67 Clinically, chronic inflammation induced by LPS is implicated in the development of several non-infectious diseases, including atherosclerosis, insulin resistance, and neurodegeneration [ 2 67 68 2 68 69 Specific Gram-negative pathogens have been directly linked to this process. Helicobacter pylori 70 Porphyromonas gingivalis 71 A major source of persistent LPS exposure is the gut microbiota. Several Gram-negative species, including Escherichia coli Enterobacter cloacae Bacteroides fragilis 72 73 74 75 76 The composition of the gut microbiota strongly influences the magnitude of LPS-driven inflammation. Under homeostatic conditions, commensals such as Bacteroides thetaiotaomicron Faecalibacterium prausnitzii 77 78 79 80 81 Taken together, these findings suggest that both the presence of specific Gram-negative bacteria and the overall balance of the gut microbial ecosystem are critical determinants of chronic LPS-induced inflammation. Accordingly, therapeutic strategies that aim to modulate microbiota composition, restore barrier integrity, or inhibit LPS-TLR4 signaling are being actively investigated as promising approaches to reduce LPS-driven systemic inflammation [ 72 82 7.2. Endotoxin Tolerance (ET) If the inflammatory response to LPS remains uncontrolled, this can lead to significant tissue damage and the emergence of pathological conditions such as sepsis. To overcome this type of exaggerated response, a protective mechanism known as ET has been observed in the host body [ 83 Table 1 The first reports regarding ET appeared in the 20th century when Paul Beeson (1946) documented this phenomenon through the febrile response in a rabbit with several injections of typhoid vaccine [ 84 85 86 Further studies on this intricate, tolerant immune response revealed TLR4 as a crucial factor in its regulation [ 87 88 89 90 83 The results indicate that TNF-α emerges as a pivotal indicator of ET due to its dual role in triggering inflammation and inducing tolerance upon repeated exposure [ 91 92 Studies, like the one conducted by Lee et al., have elucidated the temporal dynamics of ET in vivo, particularly during severe sepsis. IRAK-M, a negative regulator of TLR signalling, peaks around 12 to 24 h post-sepsis, indicative of heightened tolerance which subsequently wanes [ 93 Another factor that may mediate ET is the miRNA machinery. miR-181b has been reported to potentially participate in the mechanism of endotoxin-triggered inflammation by stimulating the NF-κB signalling pathway in vitro [ 39 94 95 Circular RNAs (circRNAs) represent another crucial element of the miRNA regulatory machinery. These circRNAs are formed through back-splicing, in which the 3′ end of an exon is covalently linked to the 5′ end, resulting in a closed circular structure. Accumulating evidence indicates that circRNAs contribute to the pathogenesis of a wide spectrum of human diseases, including aging-associated disorders, cancer, cardiovascular and metabolic diseases, osteoarthritis, stress responses, and viral infections [ 96 97 98 99 While circRNAs illustrate how post-transcriptional mechanisms shape macrophage and endotoxin responses, genetic variation in upstream pattern-recognition receptors such as TLR4 may determine the extent of LPS-induced inflammatory signalling. Polymorphisms in the TLR4 gene significantly influence host responses to endotoxin and may modulate the development of ET. Variants at +896 bp (TLR4/+896) and +1196 bp (TLR4/+1196) have been associated with systemic hyporesponsiveness to LPS, as individuals heterozygous for either variant exhibited markedly reduced inflammatory responses following inhaled LPS challenge [ 100 101 102 103 104 Salmonella to Escherichia coli 105 To explore the immunomodulatory consequences of ET, we evaluated macrophage phenotype and function following LPS stimulation [ 106 ETs 107 8. Two-Faced Nature of ET In nature, phenomena often reveal themselves as multifaceted, exhibiting both advantageous and detrimental aspects depending on the context. This duality is echoed in numerous studies across PubMed, exemplified by entities like Tripartite Motif Containing 8 (TRIM8), characterised as a “molecule of duality” due to its roles as both an oncogene and a tumour suppressor gene [ 108 109 110 8.1. “The Bright Face” of ET ET can be beneficial by preventing excessive inflammation and tissue damage from various causes. Its positive effect has been demonstrated on liver ischemia–reperfusion (IR) damage, a condition accompanied by oxidative stress leading to cell damage and the development of inflammation. This local reaction is driven by cells of the innate immune system. Studies conducted in a rat model have shown that pre-treatment with endotoxin reduces liver IR and renal IR [ 111 112 113 114 ET plays a complex role in immune modulation. However, the most dramatic manifestations are observed in sepsis. It is known that under normal conditions, the immune response is controlled and resolves once the threat is neutralised. However, in some cases, immune regulation fails, and a life-threatening condition known as sepsis may develop. This is characterized by a systemic inflammatory reaction, tissue damage, and potential multi-organ failure. A hallmark of sepsis is the excessive and uncontrolled release of pro-inflammatory cytokines, commonly called a cytokine storm, which can cause widespread harm to host tissues and organs [ 115 116 117 In line with the above information, ET has been reported to be associated with the increase in Treg and Th17 lymphocytes in blood and spleen in mice subjected to caecal ligation and puncture (CLP) and thereby protecting the animal from the hyperimmune response [ 118 119 120 121 8.2. “The Dark Face” of Endotoxin Tolerance—Increased Disease Susceptibility with a Focus on Cancer While ET may offer protection against the severe effects of sepsis, in certain scenarios, it can also prove to be a harmful mechanism. Since ET may weaken the immune response, it may render the host more susceptible to recurrent infections [ 122 123 124 ET, defined by a suppressed response to endotoxin, has paradoxically been associated with worse outcomes in sepsis in some instances. Unlike the protective “bright face” of ET, the blunted ex vivo cytokine response may sometimes reflect sustained and harmful inflammation in vivo [ 125 124 126 Another example of a clinical condition that involves ET is periodontal disease. In periodontitis, biofilm can disturb the gingival tissues, causing a compromised epithelial barrier and the formation of periodontal pockets, which are then colonised by Gram-negative bacteria. This colonisation can subsequently result in endothelial damage and the release of bacterial products into the bloodstream (endotoxemia), reinforcing the association between periodontitis and septic shock syndrome [ 127 P. gingivalis 128 Reportedly, human periodontal ligament cells (hPDLCs) undergo a “negative regulation of immune response” as a result of repeated exposure to pathogens, therefore indicating the induction of endotoxin tolerance by LPS, resulting in the suppression of TLRs and the production of inflammatory cytokines [ 83 Following exposure to bacterial endotoxins, the host immune response typically progresses through two distinct phases. The initial stage is characterized by a hyper-inflammatory reaction, during which activated neutrophils, macrophages, dendritic cells, and epithelial or endothelial cells release large amounts of pro-inflammatory cytokines, chemokines, and reactive oxygen species. While this robust response is critical for pathogen clearance, its excessive amplification may cause severe tissue damage [ 129 130 131 132 133 134 135 133 136 Figure 4 Adverse outcomes associated with ET extend beyond infections alone. Since a downregulation of pro-inflammatory responses characterises ET, a diminished febrile reaction is one of its hallmark manifestations. Interestingly, cancer patients have been observed to develop fewer and less intense fevers during infections compared to healthy individuals [ 137 138 139 In light of these observations, we investigated the direct impact of ET on cancer development using experimental models [ 106 ETs 140 141 ETs 87 142 ET 143 144 145 Further investigation into the immunological crosstalk between Mo ET ETs 106 To better understand how Mo ETs ET 146 147 148 149 150 ETs ETs LPS 151 152 ET 153 154 ET In addition to functional characteristics, the survival of Mo ETs ETs 124 Notably, ET macrophages exhibited unique metabolic characteristics within the tumour context. SCENITH analysis indicated that Mo ETs 155 156 157 158 ETs 9. Clinical and Therapeutic Applications Related to Endotoxin Endotoxins play a pivotal role not only in bacterial pathogenesis but also in shaping therapeutic strategies against excessive inflammation. Given their ability to trigger potent immune responses, endotoxins are both a clinical threat, especially in conditions like sepsis, and a potential tool in immunotherapy. 9.1. Sepsis and Anti-Endotoxin Strategies As outlined in previous sections, severe Gram-negative bacterial infections often lead to endotoxemia and septic shock, characterised by uncontrolled systemic inflammation. Therapeutic efforts have focused on neutralising LPS or blocking its interaction with host receptors. Strategies include the use of endotoxin-neutralising agents such as polymyxins, TLR4 antagonists, and extracorporeal endotoxin removal techniques like polymyxin B hemoperfusion. Among the polymyxins used in medical practice are polymyxin B and colistin (polymyxin E), which are cationic lipopeptide antibiotics, produced by Gram-positive bacteria of the genus Penibacillus 159 160 159 160 160 161 162 163 162 163 163 164 165 166 167 9.2. LPS as a Vaccine Adjuvant Paradoxically, the immunostimulatory properties of LPS have been harnessed in vaccine development. Intensive research has led to the development of LPS analogues that have found application as vaccine adjuvants, some of which have even been approved for use ( Table 2 Salmonella minnesota 168 169 170 171 169 170 169 171 170 Quillaja saponaria 168 169 170 168 ® ® ® ® ® 169 170 172 ® 169 172 ® 172 ® ® ® 169 171 172 ® Varicella zoster ® 170 173 ® 169 172 169 170 171 169 170 170 171 170 9.3. Endotoxin as a Biomarker and Diagnostic Tool Circulating levels of LPS can serve as a biomarker for diagnostic inflammation and infection-related diseases. There are many techniques of LPS determination, such as the rabbit pyrogen test, Limulus 174 175 176 177 178 179 180 181 176 182 174 175 176 177 183 184 183 184 185 186 187 188 189 10. Conclusions Endotoxin, such as LPS, is a central modulator of host immune responses to Gram-negative bacteria and remains a pivotal focus of research for elucidating the balance between protective immunity and immunopathology. Depending on the context, endotoxin can induce a wide range of immune outcomes: it may initiate an acute inflammatory response essential for effective pathogen clearance; it can drive chronic low-grade inflammation, contributing to tissue damage and disease progression; or it may lead to endotoxin tolerance, a hyporesponsive state that can be either protective or deleterious. Elucidating the molecular and cellular determinants that govern whether LPS exposure leads to immune activation, chronic persistence, or tolerance is essential for developing targeted therapies capable of precisely modulating immune responses. This also highlights that interpreting the clinical significance of elevated endotoxin levels requires a comprehensive understanding of the patient’s overall immunological and physiological context, since in some cases endotoxin presence may be directly harmful, while in others it may have triggered adaptive mechanisms that protect against severe outcomes or death. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.W.; Writing—original draft, K.R. (Kacper Roszak), K.R. (Konkonika Roy), J.S., P.S., T.J. and S.W.; Writing—review and editing, S.W., T.J. and K.R. (Kacper Roszak); Visualization, P.S. and J.S.; Funding acquisition, S.W. All authors have read and agreed to the published version of the manuscript. Data Availability Statement All figures are original. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ASC Apoptosis-associated speck-like protein containing a CARD CAMPs Cationic anti-microbial peptides CLP Caecal ligation and puncture CM Conditioned medium COX Cyclooxygenase ERK 1/2 Extracellular signal-regulated kinases 1/2 ET Endotoxin tolerance GBPs Guanylate-binding proteins GLA Glucopyranosyl lipid A GSDMD Gasdermin D HBV Hepatitis B virus HIV Human immunodeficiency virus hPDLCs Human periodontal ligament cells HPV Human papillomavirus IFN Interferon IL Interleukin IL-1ra Interleukin-1 receptor antagonist iNOS Inducible nitric oxide synthase IR Ischemia–reperfusion IRAK Interleukin receptor-associated kinase IRF3 Interferon regulatory factor 3 JNK Jun N-terminal kinase LBP LPS binding protein LOS Lipooligosaccharide LPS Lipopolysaccharide LRR Leucine-rich repeat MAPK Mitogen-activated protein kinase MD2 Myeloid differentiation protein 2 Mo ETs Monocyte-derived endotoxin-tolerant macrophages Mo LPS Monocyte-derived endotoxin-treated macrophages MPL Monophosphoryl lipid A MyD88 Myeloid differentiation primary response gene 88 NAFLD Nonalcoholic fatty liver disease NET Neutrophil extracellular trap NF-κB Nuclear factor-κB NLRP3 Receptors and pyrin domain-containing protein 3 NOD Nucleotide-binding oligomerization domain OXPHOS Oxidative phosphorylation PAMP Pathogen-associated molecular pattern PEtN 2-aminoethylphosphate PHAD Phosphorylated hexaacyl disaccharide PMN Polymorphonuclear neutrophil PMX-HP Polymyxin B hemoperfusion cartridge RIP1 Receptor-interacting protein 1 ROS Reactive oxygen species RSV Respiratory syncytial virus SAP Severe acute pancreatitis SIRS Systemic inflammatory response syndrome SLA Second-generation lipid adjuvant SOCS1 Suppressor of cytokine signalling 1 TAK1 Transforming growth factor-β-activated kinase 1 TBK1 TANK binding kinase 1 TGF-β Transforming growth factor-β TIR Toll-interleukin-1receptor TIRAP TIR domain-containing adaptor protein TLR4 Toll-like receptor 4 TME Tumour microenvironment TNF-α Tumor necrosis factor α TRAF3 TNF receptor-associated factor 3 TRAF6 Tumour necrosis factor receptor-associated factor 6 TRAM Toll/IL-1 receptor domain-containing adaptor-inducing IFN-β-related adaptor molecule TRIF Toll/IL-1 receptor domain-containing adaptor-inducing interferon-β TRIM8 Tripartite motif containing 8 References 1. Zhang L. Wang C.C. Inflammatory Response of Macrophages in Infection Hepatobiliary Pancreat. Dis. Int. 2014 13 138 152 10.1016/S1499-3872(14)60024-2 24686541 2. Page M.J. Kell D.B. Pretorius E. The Role of Lipopolysaccharide-Induced Cell Signalling in Chronic Inflammation Chronic Stress 2022 6 24705470221076390 10.1177/24705470221076390 35155966 PMC8829728 3. Arya P. Sharma V. Singh P. Thapliyal S. Sharma M. Bacterial Endotoxin-Lipopolysaccharide Role in Inflammatory Diseases: An Overview Iran. J. Basic Med. Sci. 2025 28 553 564 10.22038/ijbms.2025.82302.17799 40666174 PMC12258786 4. Määttä A.M. Salminen A. Pietiäinen M. Leskelä J. Palviainen T. Sattler W. Sinisalo J. Salomaa V. Kaprio J. Pussinen P.J. Endotoxemia Is Associated with an Adverse Metabolic Profile Innate Immun. 2021 27 3 14 10.1177/1753425920971702 33243051 PMC7780360 5. Denamur E. Clermont O. Bonacorsi S. Gordon D. The Population Genetics of Pathogenic Escherichia coli Nat. Rev. Microbiol. 2021 19 37 54 10.1038/s41579-020-0416-x 32826992 6. Wang G. Zhao G. Chao X. Xie L. Wang H. The Characteristic of Virulence, Biofilm and Antibiotic Resistance of Klebsiella Pneumoniae Int. J. Environ. Res. Public Health 2020 17 6278 10.3390/ijerph17176278 32872324 PMC7503635 7. Swain J. Askenasy I. Rudland Nazeer R. Ho P.M. Labrini E. Mancini L. Xu Q. Hollendung F. Sheldon I. Dickson C. Pathogenicity and Virulence of Pseudomonas Aeruginosa: Recent Advances and under-Investigated Topics Virulence 2025 16 2503430 10.1080/21505594.2025.2503430 40353451 PMC12087490 8. Di Lorenzo F. Duda K.A. Lanzetta R. Silipo A. De Castro C. Molinaro A. A Journey from Structure to Function of Bacterial Lipopolysaccharides Chem. Rev. 2022 122 15767 15821 10.1021/acs.chemrev.0c01321 34286971 9. Lorenzo F.D. Palmigiano A. Paciello I. Pallach M. Garozzo D. Bernardini M.L. Cono V.L. Yakimov M.M. Molinaro A. Silipo A. The Deep-Sea Polyextremophile Halobacteroides Lacunaris TB21 Rough-Type LPS: Structure and Inhibitory Activity towards Toxic LPS Mar. Drugs 2017 15 201 10.3390/md15070201 28653982 PMC5532643 10. Krzyżewska E. Rybka J. Biosynthesis of lipopolysaccharides with different length of the O-specific region as a virulence factor of Gram-negative bacteria Postep. Hig. Med. Dosw. 2018 72 573 586 10.5604/01.3001.0012.1735 11. Kaszowska M. Chemical structure and biosynthesis of lipopolysaccharide--important component of the cell envelope of Gram-negative bacteria Postep. Hig. Med. Dosw. (Online) 2004 58 333 342 15459551 12. Lodowska J. Wolny D. Węglarz L. Dzierżewicz Z. Heterogenność strukturalna lipidu A bakterii Gram-ujemnych Postep. Hig. Med. Dosw. 2007 61 106 121 17369779 13. Samuel G. Reeves P. Biosynthesis of O-Antigens: Genes and Pathways Involved in Nucleotide Sugar Precursor Synthesis and O-Antigen Assembly Carbohydr. Res. 2003 338 2503 2519 10.1016/j.carres.2003.07.009 14670712 14. Silipo A. Gargiulo V. Sturiale L. Marchetti R. Prizeman P. Grant W.D. De Castro C. Garozzo D. Lanzetta R. Parrilli M. The Structure of the Carbohydrate Backbone of the Lipooligosaccharide from an Alkaliphilic Halomonas Carbohydr Res. 2010 345 1971 1975 10.1016/j.carres.2010.06.007 20621289 15. John C.M. Phillips N.J. Stein D.C. Jarvis G.A. Innate Immune Response to Lipooligosaccharide: Pivotal Regulator of the Pathobiology of Invasive Neisseria Meningitidis Infections Pathog. Dis. 2017 75 ftx030 10.1093/femspd/ftx030 28423169 16. Pollard A. St Michael F. Connor L. Nichols W. Cox A. Structural Characterization of Haemophilus parainfluenzae Can. J. Microbiol. 2008 54 906 917 10.1139/W08-082 18997847 17. Di Lorenzo F. Palmigiano A. Silipo A. Desaki Y. Garozzo D. Lanzetta R. Shibuya N. Molinaro A. The Structure of the Lipooligosaccharide from Xanthomonas oryzae Carbohydr. Res. 2016 427 38 43 10.1016/j.carres.2016.03.026 27085742 18. Culebro A. Machado M.P. Carriço J.A. Rossi M. Origin, Evolution, and Distribution of the Molecular Machinery for Biosynthesis of Sialylated Lipooligosaccharide Structures in Campylobacter coli Sci. Rep. 2018 8 3028 10.1038/s41598-018-21438-2 29445215 PMC5813019 19. Mookherjee N. Anderson M.A. Haagsman H.P. Davidson D.J. Antimicrobial Host Defence Peptides: Functions and Clinical Potential Nat. Rev. Drug Discov. 2020 19 311 332 10.1038/s41573-019-0058-8 32107480 20. Lorenzo F.D. Sturiale L. Palmigiano A. Lembo-Fazio L. Paciello I. Coutinho C.P. Sá-Correia I. Bernardini M. Lanzetta R. Garozzo D. Chemistry and Biology of the Potent Endotoxin from a Burkholderia Dolosa Clinical Isolate from a Cystic Fibrosis Patient ChemBioChem 2013 14 1105 1115 10.1002/cbic.201300062 23733445 21. McCoy A.J. Liu H. Falla T.J. Gunn J.S. Identification of Proteus Mirabilis Mutants with Increased Sensitivity to Antimicrobial Peptides Antimicrob. Agents Chemother. 2001 45 2030 2037 10.1128/AAC.45.7.2030-2037.2001 11408219 PMC90596 22. Cheng H.Y. Chen Y.F. Peng H.L. Molecular Characterization of the PhoPQ-PmrD-PmrAB Mediated Pathway Regulating Polymyxin B Resistance in Klebsiella Pneumoniae CG43 J. Biomed. Sci. 2010 17 60 10.1186/1423-0127-17-60 20653976 PMC2919465 23. Marceau M. Sebbane F. Collyn F. Simonet M. Function and Regulation of the Salmonella-like pmrF Antimicrobial Peptide Resistance Operon in Yersinia Pseudotuberculosis Adv. Exp. Med. Biol. 2003 529 253 256 10.1007/0-306-48416-1_49 12756767 24. Richards S.M. Strandberg K.L. Conroy M. Gunn J.S. Cationic Antimicrobial Peptides Serve as Activation Signals for the Salmonella Typhimurium PhoPQ and PmrAB Regulons in Vitro and in Vivo Front. Cell. Infect. Microbiol. 2012 2 102 10.3389/fcimb.2012.00102 22919691 PMC3417628 25. Chmiela M. Miszczyk E. Rudnicka K. Structural Modifications of Helicobacter Pylori Lipopolysaccharide: An Idea for How to Live in Peace World J. Gastroenterol. 2014 20 9882 9897 10.3748/wjg.v20.i29.9882 25110419 PMC4123370 26. Ding P.H. Wang C.Y. Darveau R.P. Jin L. Porphyromonas gingivalis Innate Immun. 2013 19 66 75 10.1177/1753425912450348 22736337 27. Paciello I. Silipo A. Lembo-Fazio L. Curcurù L. Zumsteg A. Noël G. Ciancarella V. Sturiale L. Molinaro A. Bernardini M.L. Intracellular Shigella Remodels Its LPS to Dampen the Innate Immune Recognition and Evade Inflammasome Activation Proc. Natl. Acad. Sci. USA 2013 110 E4345 E4354 10.1073/pnas.1303641110 24167293 PMC3832022 28. Ayoub Moubareck C. Hammoudi Halat D. Insights into Acinetobacter Baumannii: A Review of Microbiological, Virulence, and Resistance Traits in a Threatening Nosocomial Pathogen Antibiotics 2020 9 119 10.3390/antibiotics9030119 32178356 PMC7148516 29. Steimle A. Autenrieth I.B. Frick J.S. Structure and Function: Lipid A Modifications in Commensals and Pathogens Int. J. Med. Microbiol. 2016 306 290 301 10.1016/j.ijmm.2016.03.001 27009633 30. Needham B.D. Trent M.S. Fortifying the Barrier: The Impact of Lipid A Remodelling on Bacterial Pathogenesis Nat. Rev. Microbiol. 2013 11 467 481 10.1038/nrmicro3047 23748343 PMC6913092 31. Pither M.D. Silipo A. Di Lorenzo F. Molinaro A. 5.13—Glycans in Bacterial Infections: Gram-Negative Infections in the Respiratory Tract Comprehensive Glycoscience 2nd ed. Barchi J.J. Elsevier Oxford, UK 2021 233 249 978-0-12-822244-7 32. Jennings M.P. Srikhanta Y.N. Moxon E.R. Kramer M. Poolman J.T. Kuipers B. van der Ley P. The Genetic Basis of the Phase Variation Repertoire of Lipopolysaccharide Immunotypes in Neisseria Meningitidis Microbiology 1999 145 3013 3021 10.1099/00221287-145-11-3013 10589709 33. Schweda E.K.H. Twelkmeyer B. Li J. Profiling Structural Elements of Short-Chain Lipopolysaccharide of Non-Typeable Haemophilus Influenzae Innate Immun. 2008 14 199 211 10.1177/1753425908095958 18669606 34. Moran A.P. Prendergast M.M. Appelmelk B.J. Molecular Mimicry of Host Structures by Bacterial Lipopolysaccharides and Its Contribution to Disease FEMS Immunol. Med. Microbiol. 1996 16 105 115 10.1111/j.1574-695X.1996.tb00127.x 8988391 35. Varki A. Since There Are PAMPs and DAMPs, There Must Be SAMPs? Glycan “Self-Associated Molecular Patterns” Dampen Innate Immunity, but Pathogens Can Mimic Them Glycobiology 2011 21 1121 1124 10.1093/glycob/cwr087 21932452 PMC3150115 36. Mueller M. Lindner B. Kusumoto S. Fukase K. Schromm A.B. Seydel U. Aggregates Are the Biologically Active Units of Endotoxin J. Biol. Chem. 2004 279 26307 26313 10.1074/jbc.M401231200 15096514 37. Brandenburg K. Seydel U. Schromm A.B. Loppnow H. Koch M.H.J. Rietschel E.T. Conformation of Lipid A, the Endotoxic Center of Bacterial Lipopolysaccharide J. Endotoxin Res. 1996 3 173 178 10.1177/096805199600300302 38. Zhao Y. Wu J. Liu X. Chen X. Wang J. Decoding Nature: Multi-Target Anti-Inflammatory Mechanisms of Natural Products in the TLR4/NF-κB Pathway Front. Pharmacol. 2025 15 1467193 10.3389/fphar.2024.1467193 39877388 PMC11772364 39. Fitzgerald K.A. Rowe D.C. Golenbock D.T. Endotoxin Recognition and Signal Transduction by the TLR4/MD2-Complex Microbes Infect. 2004 6 1361 1367 10.1016/j.micinf.2004.08.015 15596121 40. Ciesielska A. Matyjek M. Kwiatkowska K. TLR4 and CD14 Trafficking and Its Influence on LPS-Induced pro-Inflammatory Signaling Cell. Mol. Life Sci. 2020 78 1233 1261 10.1007/s00018-020-03656-y 33057840 PMC7904555 41. West A.P. Koblansky A.A. Ghosh S. Recognition and Signaling by Toll-like Receptors Annu. Rev. Cell Dev. Biol. 2006 22 409 437 10.1146/annurev.cellbio.21.122303.115827 16822173 42. Płóciennikowska A. Hromada-Judycka A. Borzęcka K. Kwiatkowska K. Co-Operation of TLR4 and Raft Proteins in LPS-Induced pro-Inflammatory Signaling Cell. Mol. Life Sci. 2015 72 557 581 10.1007/s00018-014-1762-5 25332099 PMC4293489 43. Jiang Z. Georgel P. Du X. Shamel L. Sovath S. Mudd S. Huber M. Kalis C. Keck S. Galanos C. CD14 Is Required for MyD88-Independent LPS Signaling Nat. Immunol. 2005 6 565 570 10.1038/ni1207 15895089 44. Oshiumi H. Matsumoto M. Funami K. Akazawa T. Seya T. TICAM-1, an Adaptor Molecule That Participates in Toll-like Receptor 3-Mediated Interferon-Beta Induction Nat. Immunol. 2003 4 161 167 10.1038/ni886 12539043 45. Yamamoto M. Sato S. Mori K. Hoshino K. Takeuchi O. Takeda K. Akira S. Cutting Edge: A Novel Toll/IL-1 Receptor Domain-Containing Adapter That Preferentially Activates the IFN-Beta Promoter in the Toll-like Receptor Signaling J. Immunol. 2002 169 6668 6672 10.4049/jimmunol.169.12.6668 12471095 46. Takeda K. Akira S. TLR Signaling Pathways Semin. Immunol. 2004 16 3 9 10.1016/j.smim.2003.10.003 14751757 47. Youn H.S. Lee J.Y. Fitzgerald K.A. Young H.A. Akira S. Hwang D.H. Specific Inhibition of MyD88-Independent Signaling Pathways of TLR3 and TLR4 by Resveratrol: Molecular Targets Are TBK1 and RIP1 in TRIF Complex J. Immunol. 2005 175 3339 3346 10.4049/jimmunol.175.5.3339 16116226 48. Häcker H. Tseng P.H. Karin M. Expanding TRAF Function: TRAF3 as a Tri-Faced Immune Regulator Nat. Rev. Immunol. 2011 11 457 468 10.1038/nri2998 21660053 49. Kawai T. Takeuchi O. Fujita T. Inoue J. Mühlradt P.F. Sato S. Hoshino K. Akira S. Lipopolysaccharide Stimulates the MyD88-Independent Pathway and Results in Activation of IFN-Regulatory Factor 3 and the Expression of a Subset of Lipopolysaccharide-Inducible Genes J. Immunol. 2001 167 5887 5894 10.4049/jimmunol.167.10.5887 11698465 50. Kang H.H. Kim I.K. Lee H.I. Joo H. Lim J.U. Lee J. Lee S.H. Moon H.S. Chronic Intermittent Hypoxia Induces Liver Fibrosis in Mice with Diet-Induced Obesity via TLR4/MyD88/MAPK/NF-kB Signaling Pathways Biochem. Biophys. Res. Commun. 2017 490 349 355 10.1016/j.bbrc.2017.06.047 28623125 51. Wang Y. Tu Q. Yan W. Xiao D. Zeng Z. Ouyang Y. Huang L. Cai J. Zeng X. Chen Y.J. CXC195 Suppresses Proliferation and Inflammatory Response in LPS-Induced Human Hepatocellular Carcinoma Cells via Regulating TLR4-MyD88-TAK1-Mediated NF-κB and MAPK Pathway Biochem. Biophys. Res. Commun. 2015 456 373 379 10.1016/j.bbrc.2014.11.090 25475726 52. Xing Y. Yao X. Li H. Xue G. Guo Q. Yang G. An L. Zhang Y. Meng G. Cutting Edge: TRAF6 Mediates TLR/IL-1R Signaling-Induced Nontranscriptional Priming of the NLRP3 Inflammasome J. Immunol. 2017 199 1561 1566 10.4049/jimmunol.1700175 28739881 53. Platnich J.M. Muruve D.A. NOD-like Receptors and Inflammasomes: A Review of Their Canonical and Non-Canonical Signaling Pathways Arch. Biochem. Biophys. 2019 670 4 14 10.1016/j.abb.2019.02.008 30772258 54. Bauernfeind F.G. Horvath G. Stutz A. Alnemri E.S. MacDonald K. Speert D. Fernandes-Alnemri T. Wu J. Monks B.G. Fitzgerald K.A. Cutting Edge: NF-kappaB Activating Pattern Recognition and Cytokine Receptors License NLRP3 Inflammasome Activation by Regulating NLRP3 Expression J. Immunol. 2009 183 787 791 10.4049/jimmunol.0901363 19570822 PMC2824855 55. Vasudevan S.O. Russo A.J. Kumari P. Vanaja S.K. Rathinam V.A. A TLR4-Independent Critical Role for CD14 in Intracellular LPS Sensing Cell Rep. 2022 39 110755 10.1016/j.celrep.2022.110755 35508125 PMC9376664 56. Diamond C.E. Khameneh H.J. Brough D. Mortellaro A. Novel Perspectives on Non-Canonical Inflammasome Activation ImmunoTargets Ther. 2015 4 131 141 10.2147/itt.s57976 27471719 PMC4918253 57. Hagar J.A. Powell D.A. Aachoui Y. Ernst R.K. Miao E.A. Cytoplasmic LPS Activates Caspase-11: Implications in TLR4-Independent Endotoxic Shock Science 2013 341 1250 1253 10.1126/science.1240988 24031018 PMC3931427 58. Shi J. Zhao Y. Wang Y. Gao W. Ding J. Li P. Hu L. Shao F. Inflammatory Caspases Are Innate Immune Receptors for Intracellular LPS Nature 2014 514 187 192 10.1038/nature13683 25119034 59. He W. Wan H. Hu L. Chen P. Wang X. Huang Z. Yang Z.H. Zhong C.Q. Han J. Gasdermin D Is an Executor of Pyroptosis and Required for Interleukin-1β Secretion Cell Res. 2015 25 1285 1298 10.1038/cr.2015.139 26611636 PMC4670995 60. Shi J. Zhao Y. Wang K. Shi X. Wang Y. Huang H. Zhuang Y. Cai T. Wang F. Shao F. Cleavage of GSDMD by Inflammatory Caspases Determines Pyroptotic Cell Death Nature 2015 526 660 665 10.1038/nature15514 26375003 61. Elizagaray M.L. Gomes M.T.R. Guimaraes E.S. Rumbo M. Hozbor D.F. Oliveira S.C. Moreno G. Canonical and Non-Canonical Inflammasome Activation by Outer Membrane Vesicles Derived From Bordetella Pertussis Front. Immunol. 2020 11 1879 10.3389/fimmu.2020.01879 32973778 PMC7468456 62. Wrotek S. LeGrand E.K. Dzialuk A. Alcock J. Let Fever Do Its Job: The Meaning of Fever in the Pandemic Era Evol. Med. Public. Health 2021 9 26 35 10.1093/emph/eoaa044 33738101 PMC7717216 63. González Plaza J.J. Hulak N. Zhumadilov Z. Akilzhanova A. Fever as an Important Resource for Infectious Diseases Research Intractable Rare Dis. Res. 2016 5 97 102 10.5582/irdr.2016.01009 27195192 PMC4869589 64. Roth J. Blatteis C.M. Mechanisms of Fever Production and Lysis: Lessons from Experimental LPS Fever Compr. Physiol. 2014 4 1563 1604 10.1002/j.2040-4603.2014.tb00582.x 25428854 65. Wrotek S. Sobocińska J. Kozłowski H.M. Pawlikowska M. Jędrzejewski T. Dzialuk A. New Insights into the Role of Glutathione in the Mechanism of Fever Int. J. Mol. Sci. 2020 21 1393 10.3390/ijms21041393 32092904 PMC7073131 66. Kozak W. Jedrzejewski T. Pawlikowska M. Piotrowski J. Wrotek S. Toward Antitumor Immunity and Febrile Infections: Gamma/Delta (Γδ) T Cells Hypothesis Q. Rev. Biol. 2018 93 187 205 10.1086/699409 67. Glaros T.G. Chang S. Gilliam E.A. Maitra U. Deng H. Li L. Causes and Consequences of Low Grade Endotoxemia and Inflammatory Diseases FBS 2013 5 754 765 10.2741/S405 23277084 68. Park J.E. Park H.Y. Kim Y.S. Park M. The Role of Diet, Additives, and Antibiotics in Metabolic Endotoxemia and Chronic Diseases Metabolites 2024 14 704 10.3390/metabo14120704 39728485 PMC11677052 69. Mohammad S. Thiemermann C. Role of Metabolic Endotoxemia in Systemic Inflammation and Potential Interventions Front. Immunol. 2020 11 594150 10.3389/fimmu.2020.594150 33505393 PMC7829348 70. Kusters J.G. van Vliet A.H.M. Kuipers E.J. Pathogenesis of Helicobacter Pylori Infection Clin. Microbiol. Rev. 2006 19 449 490 10.1128/CMR.00054-05 16847081 PMC1539101 71. Hajishengallis G. The Inflammophilic Character of the Periodontitis-Associated Microbiota Mol. Oral. Microbiol. 2014 29 248 257 10.1111/omi.12065 24976068 PMC4232466 72. Cani P.D. Amar J. Iglesias M.A. Poggi M. Knauf C. Bastelica D. Neyrinck A.M. Fava F. Tuohy K.M. Chabo C. Metabolic Endotoxemia Initiates Obesity and Insulin Resistance Diabetes 2007 56 1761 1772 10.2337/db06-1491 17456850 73. Fei N. Zhao L. An Opportunistic Pathogen Isolated from the Gut of an Obese Human Causes Obesity in Germfree Mice ISME J. 2013 7 880 884 10.1038/ismej.2012.153 23235292 PMC3603399 74. d’Hennezel E. Abubucker S. Murphy L.O. Cullen T.W. Total Lipopolysaccharide from the Human Gut Microbiome Silences Toll-Like Receptor Signaling mSystems 2017 2 e00046-17 10.1128/mSystems.00046-17 29152585 PMC5686520 75. Miller S. Ernst R. Bader M. LPS, TLR4 and Infectious Disease Diversity Nat. Rev. Microbiol. 2005 3 36 46 Available online: https://www.nature.com/articles/nrmicro1068 (accessed on 9 September 2025) 10.1038/nrmicro1068 15608698 76. Caesar R. Reigstad C.S. Bäckhed H.K. Reinhardt C. Ketonen M. Lundén G.Ö. Cani P.D. Bäckhed F. Gut-Derived Lipopolysaccharide Augments Adipose Macrophage Accumulation but Is Not Essential for Impaired Glucose or Insulin Tolerance in Mice Gut 2012 61 1701 1707 10.1136/gutjnl-2011-301689 22535377 PMC3505865 77. Miquel S. Martín R. Rossi O. Bermúdez-Humarán L. Chatel J. Sokol H. Thomas M. Wells J. Langella P. Faecalibacterium prausnitzii Curr. Opin. Microbiol. 2013 16 255 261 10.1016/j.mib.2013.06.003 23831042 78. Thaiss C.A. Levy M. Grosheva I. Zheng D. Soffer E. Blacher E. Braverman S. Tengeler A.C. Barak O. Elazar M. Hyperglycemia Drives Intestinal Barrier Dysfunction and Risk for Enteric Infection Science 2018 359 1376 1383 10.1126/science.aar3318 29519916 79. Serino M. Luche E. Gres S. Baylac A. Bergé M. Cenac C. Waget A. Klopp P. Iacovoni J. Klopp C. Metabolic Adaptation to a High-Fat Diet Is Associated with a Change in the Gut Microbiota Gut 2012 61 543 553 10.1136/gutjnl-2011-301012 22110050 PMC3292714 80. Vatanen T. Kostic A.D. d’Hennezel E. Siljander H. Franzosa E.A. Yassour M. Kolde R. Vlamakis H. Arthur T.D. Hämäläinen A.M. Variation in Microbiome LPS Immunogenicity Contributes to Autoimmunity in Humans Cell 2016 165 842 853 10.1016/j.cell.2016.04.007 27133167 PMC4950857 81. Guo H. Callaway J.B. Ting J.P.Y. Inflammasomes: Mechanism of Action, Role in Disease, and Therapeutics Nat. Med. 2015 21 677 687 10.1038/nm.3893 26121197 PMC4519035 82. Boutagy N.E. McMillan R.P. Frisard M.I. Hulver M.W. Metabolic Endotoxemia with Obesity: Is It Real and Is It Relevant? Biochimie 2016 124 11 20 10.1016/j.biochi.2015.06.020 26133659 PMC4695328 83. Larsson L. Garaicoa-Pazmino C. Asa’ad F. Castilho R.M. Understanding the Role of Endotoxin Tolerance in Chronic Inflammatory Conditions and Periodontal Disease J. Clin. Periodontol. 2022 49 270 279 10.1111/jcpe.13591 34970759 84. Beeson P.B. Development of Tolerance to Typhoid Bacterial Pyrogen and Its Abolition by Reticulo-Endothelial Blockade Proc. Soc. Exp. Biol. Med. 1946 61 248 250 10.3181/00379727-61-15291P 21024160 85. Greisman S.E. Hornick R.B. The Nature of Endotoxin Tolerance Trans. Am. Clin. Climatol. Assoc. 1975 86 43 50 1179593 PMC2441361 86. Kox M. de Kleijn S. Pompe J.C. Ramakers B.P. Netea M.G. van der Hoeven J.G. Hoedemaekers C.W. Pickkers P. Differential Ex Vivo and in Vivo Endotoxin Tolerance Kinetics Following Human Endotoxemia Crit. Care Med. 2011 39 1866 1870 10.1097/CCM.0b013e3182190d5d 21494102 87. Liu D. Cao S. Zhou Y. Xiong Y. Recent Advances in Endotoxin Tolerance J. Cell. Biochem. 2019 120 56 70 10.1002/jcb.27547 30246452 88. West M.A. Heagy W. Endotoxin Tolerance: A Review Crit. Care Med. 2002 30 S64 S73 10.1097/00003246-200201001-00009 11891406 89. Cohen P. The Search for Physiological Substrates of MAP and SAP Kinases in Mammalian Cells Trends Cell Biol. 1997 7 353 361 10.1016/S0962-8924(97)01105-7 17708980 90. Kopanakis K. Tzepi I.M. Pistiki A. Carrer D.P. Netea M.G. Georgitsi M. Lymperi M. Droggiti D.-I. Liakakos T. Machairas A. Pre-Treatment with Low-Dose Endotoxin Prolongs Survival from Experimental Lethal Endotoxic Shock: Benefit for Lethal Peritonitis by Escherichia coli Cytokine 2013 62 382 388 10.1016/j.cyto.2013.03.028 23602853 91. Loosbroock C. Hunter K.W. Inhibiting TNF-α Signaling Does Not Attenuate Induction of Endotoxin Tolerance J. Inflamm. Res. 2014 7 159 167 10.2147/jir.s75037 25506235 PMC4259568 92. Nakagawa R. Naka T. Tsutsui H. Fujimoto M. Kimura A. Abe T. Seki E. Sato S. Takeuchi O. Takeda K. SOCS-1 Participates in Negative Regulation of LPS Responses Immunity 2002 17 677 687 10.1016/S1074-7613(02)00449-1 12433373 93. Lee M.J. Bae J. Lee J.H. Park Y.J. Lee H.A.R. Mun S. Kim Y.S. Yune C.J. Chung T.N. Kim K. Serial Change of Endotoxin Tolerance in a Polymicrobial Sepsis Model Int. J. Mol. Sci. 2022 23 6581 10.3390/ijms23126581 35743025 PMC9223582 94. Zhang W. Shen X. Xie L. Chu M. Ma Y. MicroRNA-181b Regulates Endotoxin Tolerance by Targeting IL-6 in Macrophage RAW264.7 Cells J. Inflamm. 2015 12 18 10.1186/s12950-015-0061-8 PMC4355005 25762865 95. Yang Y. Yang L. Liang X. Zhu G. MicroRNA-155 Promotes Atherosclerosis Inflammation via Targeting SOCS1 Cell. Physiol. Biochem. 2015 36 1371 1381 10.1159/000430303 26159489 96. Son C.J. Carnino J.M. Lee H. Jin Y. Emerging Roles of Circular RNA in Macrophage Activation and Inflammatory Lung Responses Cells 2024 13 1407 10.3390/cells13171407 39272979 PMC11394395 97. Ng W.L. Marinov G.K. Chin Y.M. Lim Y.Y. Ea C.K. Transcriptomic Analysis of the Role of RasGEF1B Circular RNA in the TLR4/LPS Pathway Sci. Rep. 2017 7 12227 10.1038/s41598-017-12550-w 28947785 PMC5612941 98. Lin Q. Liang Q. Qin C. Li Y. CircANKRD36 Knockdown Suppressed Cell Viability and Migration of LPS-Stimulated RAW264.7 Cells by Sponging MiR-330 Inflammation 2021 44 2044 2053 10.1007/s10753-021-01480-5 34041646 99. Lee H. Hong R. Jin Y. Altered Circular RNA Expressions in Extracellular Vesicles from Bronchoalveolar Lavage Fluids in Mice after Bacterial Infections Front. Immunol. 2024 15 1354676 10.3389/fimmu.2024.1354676 38638425 PMC11024224 100. Michel O. LeVan T.D. Stern D. Dentener M. Thorn J. Gnat D. Beijer M.L. Cochaux P. Holt P.G. Martinez F.D. Systemic Responsiveness to Lipopolysaccharide and Polymorphisms in the Toll-like Receptor 4 Gene in Human Beings J. Allergy Clin. Immunol. 2003 112 923 929 10.1016/j.jaci.2003.05.001 14610481 101. Schmitt C. Humeny A. Becker C.M. Brune K. Pahl A. Polymorphisms of TLR4: Rapid Genotyping and Reduced Response to Lipopolysaccharide of TLR4 Mutant Alleles Clin. Chem. 2002 48 1661 1667 10.1093/clinchem/48.10.1661 12324481 102. Arbour N.C. Lorenz E. Schutte B.C. Zabner J. Kline J.N. Jones M. Frees K. Watt J.L. Schwartz D.A. TLR4 Mutations Are Associated with Endotoxin Hyporesponsiveness in Humans Nat. Genet. 2000 25 187 191 10.1038/76048 10835634 103. Norata G.D. Garlaschelli K. Ongari M. Raselli S. Grigore L. Benvenuto F. Maggi F.M. Catapano A.L. Effect of the Toll-like Receptor 4 (TLR-4) Variants on Intima-Media Thickness and Monocyte-Derived Macrophage Response to LPS J. Intern. Med. 2005 258 21 27 10.1111/j.1365-2796.2005.01509.x 15953129 104. Richard K. Piepenbrink K.H. Shirey K.A. Gopalakrishnan A. Nallar S. Prantner D.J. Perkins D.J. Lai W. Vlk A. Toshchakov V.Y. A Mouse Model of Human TLR4 D299G/T399I SNPs Reveals Mechanisms of Altered LPS and Pathogen Responses J. Exp. Med. 2021 218 e20200675 10.1084/jem.20200675 33216117 PMC7685774 105. Lundberg A. Wikberg L.A. Ilonen J. Vaarala O. Böttcher M.F. Lipopolysaccharide-Induced Immune Responses in Relation to the TLR4(Asp299Gly) Gene Polymorphism Clin. Vaccine Immunol. 2008 15 1878 1883 10.1128/CVI.00241-08 18927069 PMC2593161 106. Roy K. Kozłowski H.M. Jędrzejewski T. Sobocińska J. Maciejewski B. Dzialuk A. Wrotek S. Endotoxin Tolerance Creates Favourable Conditions for Cancer Development Cancers 2023 15 5113 10.3390/cancers15205113 37894480 PMC10605812 107. Pena O.M. Pistolic J. Raj D. Fjell C.D. Hancock R.E.W. Endotoxin Tolerance Represents a Distinctive State of Alternative Polarization (M2) in Human Mononuclear Cells J. Immunol. 2011 186 7243 7254 10.4049/jimmunol.1001952 21576504 108. Hosseinalizadeh H. Mohamadzadeh O. Kahrizi M.S. Razaghi Bahabadi Z. Klionsky D.J. Mirzei H. TRIM8: A Double-Edged Sword in Glioblastoma with the Power to Heal or Hurt Cell. Mol. Biol. Lett. 2023 28 6 10.1186/s11658-023-00418-z 36690946 PMC9869596 109. Xiao X. Wang W. Li Y. Yang D. Li X. Shen C. Liu Y. Ke X. Guo S. Guo Z. HSP90AA1-Mediated Autophagy Promotes Drug Resistance in Osteosarcoma J. Exp. Clin. Cancer Res. 2018 37 201 10.1186/s13046-018-0880-6 30153855 PMC6114771 110. Xu Z. Han X. Ou D. Liu T. Li Z. Jiang G. Liu J. Zhang J. Targeting PI3K/AKT/mTOR-Mediated Autophagy for Tumor Therapy Appl. Microbiol. Biotechnol. 2020 104 575 587 10.1007/s00253-019-10257-8 31832711 111. Fernández E.D. Flohé S. Siemers F. Nau M. Ackermann M. Ruwe M. Schade F.U. Endotoxin Tolerance Protects against Local Hepatic Ischemia/Reperfusion Injury in the Rat J. Endotoxin Res. 2000 6 321 328 10.1179/096805100101532216 11521053 112. Godet C. Goujon J.M. Petit I. Lecron J.C. Hauet T. Mauco G. Carretier M. Robert R. Endotoxin Tolerance Enhances Interleukin-10 Renal Expression and Decreases Ischemia-Reperfusion Renal Injury in Rats Shock 2006 25 384 388 10.1097/01.shk.0000209528.35743.54 16670641 113. Rosenzweig H.L. Lessov N.S. Henshall D.C. Minami M. Simon R.P. Stenzel-Poore M.P. Endotoxin Preconditioning Prevents Cellular Inflammatory Response during Ischemic Neuroprotection in Mice Stroke 2004 35 2576 2581 10.1161/01.STR.0000143450.04438.ae 15375302 114. Yao L. Li P. Chen Q. Hu A. Wu Y. Li B. Protective Effects of Endotoxin Tolerance on Peripheral Lipopolysaccharide-Induced Neuroinflammation and Dopaminergic Neuronal Injury Immunopharmacol. Immunotoxicol. 2022 44 326 337 10.1080/08923973.2022.2043900 35260024 115. Chousterman B.G. Swirski F.K. Weber G.F. Cytokine Storm and Sepsis Disease Pathogenesis Semin. Immunopathol. 2017 39 517 528 10.1007/s00281-017-0639-8 28555385 116. Wheeler D.S. Lahni P.M. Denenberg A.G. Poynter S.E. Wong H.R. Cook J.A. Zingarelli B. Induction of Endotoxin Tolerance Enhances Bacterial Clearance and Survival in Murine Polymicrobial Sepsis Shock 2008 30 267 273 10.1097/SHK.0b013e318162c190 18197145 PMC2754132 117. Melo E.S. Goloubkova T. Barbeiro D.F. Gorjão R. Vasconcelos D. Szabo C. Curi R. de Lima Salgado T.M. Velasco I.T. Soriano F.G. Endotoxin Tolerance: Selective Alterations in Gene Expression and Protection against Lymphocyte Death Immunobiology 2010 215 435 442 10.1016/j.imbio.2009.09.002 19800145 118. Andrade M.M.C. Ariga S.S.K. Barbeiro D.F. Barbeiro H.V. Pimentel R.N. Petroni R.C. Soriano F.G. Endotoxin Tolerance Modulates TREG and TH17 Lymphocytes Protecting Septic Mice Oncotarget 2019 10 3451 3461 10.18632/oncotarget.26919 31191818 PMC6544402 119. Draisma A. Pickkers P. Bouw M.P.W.J.M. van der Hoeven J.G. Development of Endotoxin Tolerance in Humans in Vivo Crit. Care Med. 2009 37 1261 1267 10.1097/CCM.0b013e31819c3c67 19242351 120. Rearte B. Maglioco A. Balboa L. Bruzzo J. Landoni V.I. Laborde E.A. Chiarella P. Ruggiero R.A. Fernández G.C. Isturiz M.A. Mifepristone (RU486) Restores Humoral and T Cell-Mediated Immune Response in Endotoxin Immunosuppressed Mice Clin. Exp. Immunol. 2010 162 568 577 10.1111/j.1365-2249.2010.04262.x 20964639 PMC3026561 121. Landoni V.I. Chiarella P. Martire-Greco D. Schierloh P. van-Rooijen N. Rearte B. Palermo M.S. Isturiz M.A. Fernández G.C. Tolerance to Lipopolysaccharide Promotes an Enhanced Neutrophil Extracellular Traps Formation Leading to a More Efficient Bacterial Clearance in Mice Clin. Exp. Immunol. 2012 168 153 163 10.1111/j.1365-2249.2012.04560.x 22385250 PMC3390506 122. López-Collazo E. Del Fresno C. Endotoxin Tolerance and Trained Immunity: Breaking down Immunological Memory Barriers Front. Immunol. 2024 15 1393283 10.3389/fimmu.2024.1393283 38742111 PMC11089161 123. Vasilescu C. Buttenschoen K. Olteanu M. Flondor P. Severe Acute Pancreatitis between Systematic Inflammatory Response Syndrome and Sepsis: Insights from a Mathematical Model of Endotoxin Tolerance Am. J. Surg. 2007 194 S33 S38 10.1016/j.amjsurg.2007.05.002 124. Pena O.M. Hancock D.G. Lyle N.H. Linder A. Russell J.A. Xia J. Fjell C.D. Boyd J.H. Hancock R.E.W. An Endotoxin Tolerance Signature Predicts Sepsis and Organ Dysfunction at Initial Clinical Presentation EBioMedicine 2014 1 64 71 10.1016/j.ebiom.2014.10.003 25685830 PMC4326653 125. Leligdowicz A. Kamm J. Kalantar K. Jauregui A. Vessel K. Caldera S. Serpa P.H. Abbott J. Fang X. Tian X. Functional Transcriptomic Studies of Immune Responses and Endotoxin Tolerance in Early Human Sepsis Shock 2022 57 180 190 10.1097/SHK.0000000000001915 35066510 PMC9246838 126. Leligdowicz A. Langelier C. Kamm J.A. Jauregui A. Vessel K. Caldera S. Hayakawa P. Fang X. Abbott J.A. Tian X. Physiologically Derived Transcriptional Signature of Endotoxin Tolerance Identifies Immune Suppression in Early Sepsis A103. SEPSIS: TRANSLATIONAL STUDIES American Thoracic Society International Conference Abstracts American Thoracic Society New York, NY, USA 2020 A2586 127. Touyz L.Z.G. Periodontitis Contributes to Initiation, Progress and Aggravation of Septic Shock; a Feasible Hypothesis Med. Hypotheses 2013 81 650 652 10.1016/j.mehy.2013.06.033 23927954 128. Muthukuru M. Jotwani R. Cutler C.W. Oral Mucosal Endotoxin Tolerance Induction in Chronic Periodontitis Infect. Immun. 2005 73 687 694 10.1128/IAI.73.2.687-694.2005 15664906 PMC547058 129. van der Poll T. van de Veerdonk F.L. Scicluna B.P. Netea M.G. The Immunopathology of Sepsis and Potential Therapeutic Targets Nat. Rev. Immunol. 2017 17 407 420 10.1038/nri.2017.36 28436424 130. Hotchkiss R.S. Monneret G. Payen D. Sepsis-Induced Immunosuppression: From Cellular Dysfunctions to Immunotherapy Nat. Rev. Immunol. 2013 13 862 874 10.1038/nri3552 24232462 PMC4077177 131. Shalova I.N. Lim J.Y. Chittezhath M. Zinkernagel A.S. Beasley F. Hernández-Jiménez E. Toledano V. Cubillos-Zapata C. Rapisarda A. Chen J. Human Monocytes Undergo Functional Re-Programming during Sepsis Mediated by Hypoxia-Inducible Factor-1α Immunity 2015 42 484 498 10.1016/j.immuni.2015.02.001 25746953 132. Foster S.L. Hargreaves D.C. Medzhitov R. Gene-Specific Control of Inflammation by TLR-Induced Chromatin Modifications Nature 2007 447 972 978 10.1038/nature05836 17538624 133. Biswas S.K. Lopez-Collazo E. Endotoxin Tolerance: New Mechanisms, Molecules and Clinical Significance Trends Immunol. 2009 30 475 487 10.1016/j.it.2009.07.009 19781994 134. Medzhitov R. Schneider D.S. Soares M.P. Disease Tolerance as a Defense Strategy Science 2012 335 936 941 10.1126/science.1214935 22363001 PMC3564547 135. Cavaillon J.M. Adib-Conquy M. Bench-to-Bedside Review: Endotoxin Tolerance as a Model of Leukocyte Reprogramming in Sepsis Crit. Care 2006 10 233 10.1186/cc5055 17044947 PMC1751079 136. Seeley J.J. Ghosh S. Molecular Mechanisms of Innate Memory and Tolerance to LPS J. Leukoc. Biol. 2017 101 107 119 10.1189/jlb.3MR0316-118RR 27780875 137. Wrotek S. Kamecki K. Kwiatkowski S. Kozak W. Cancer Patients Report a History of Fewer Fevers during Infections than Healthy Controls J. Pre-Clin. Clin. Res. 2009 3 31 35 138. Maurer S. Kölmel K.F. Spontaneous Regression of Advanced Malignant Melanoma Oncol. Res. Treat. 1998 21 14 18 10.1159/000026785 139. Wrotek S. Brycht Ł. Wrotek W. Kozak W. Fever as a Factor Contributing to Long-Term Survival in a Patient with Metastatic Melanoma: A Case Report Complement. Ther. Med. 2018 38 7 10 10.1016/j.ctim.2018.03.009 29857883 140. Reynolds D.S. Tevis K.M. Blessing W.A. Colson Y.L. Zaman M.H. Grinstaff M.W. Breast Cancer Spheroids Reveal a Differential Cancer Stem Cell Response to Chemotherapeutic Treatment Sci. Rep. 2017 7 10382 10.1038/s41598-017-10863-4 28871147 PMC5583341 141. Pampaloni F. Reynaud E.G. Stelzer E.H.K. The Third Dimension Bridges the Gap between Cell Culture and Live Tissue Nat. Rev. Mol. Cell Biol. 2007 8 839 845 10.1038/nrm2236 17684528 142. Fan H. Cook J.A. Molecular Mechanisms of Endotoxin Tolerance J. Endotoxin Res. 2004 10 71 84 10.1179/096805104225003997 15119998 143. Li Q. von Ehrlich-Treuenstätt V. Schardey J. Wirth U. Zimmermann P. Andrassy J. Bazhin A.V. Werner J. Kühn F. Gut Barrier Dysfunction and Bacterial Lipopolysaccharides in Colorectal Cancer J. Gastrointest. Surg. 2023 27 1466 1472 10.1007/s11605-023-05654-4 36973501 PMC10366024 144. Zhou Q. Peng R.Q. Wu X.J. Xia Q. Hou J.H. Ding Y. Zhou Q.M. Zhang X. Pang Z.Z. Wan D.S. The Density of Macrophages in the Invasive Front Is Inversely Correlated to Liver Metastasis in Colon Cancer J. Transl. Med. 2010 8 13 10.1186/1479-5876-8-13 20141634 PMC2841127 145. Gulubova M. Ananiev J. Yovchev Y. Julianov A. Karashmalakov A. Vlaykova T. The Density of Macrophages in Colorectal Cancer Is Inversely Correlated to TGF-Β1 Expression and Patients’ Survival J. Mol. Histol. 2013 44 679 692 10.1007/s10735-013-9520-9 23801404 146. Wu Z. Zhang Z. Lei Z. Lei P. CD14: Biology and Role in the Pathogenesis of Disease Cytokine Growth Factor Rev. 2019 48 24 31 10.1016/j.cytogfr.2019.06.003 31296363 147. Park J.Y. Lee K.H. Park H.S. Choi S.J. LPS Sensing Mechanism of Human Astrocytes: Evidence of Functional TLR4 Expression and Requirement of Soluble CD14 J. Bacteriol. Virol. 2017 47 189 10.4167/jbv.2017.47.4.189 148. Lin C.Y. Kao S.H. Hung L.C. Chien H.J. Wang W.H. Chang Y.W. Chen Y.H. Lipopolysaccharide-Induced Nitric Oxide and Prostaglandin E2 Production Is Inhibited by Tellimagrandin II in Mouse and Human Macrophages Life 2021 11 411 10.3390/life11050411 33946374 PMC8146495 149. Wautier J.L. Wautier M.P. Pro- and Anti-Inflammatory Prostaglandins and Cytokines in Humans: A Mini Review Int. J. Mol. Sci. 2023 24 9647 10.3390/ijms24119647 37298597 PMC10253712 150. Martin M. Katz J. Vogel S.N. Michalek S.M. Differential Induction of Endotoxin Tolerance by Lipopolysaccharides Derived from Porphyromonas gingivalis Escherichia coli J. Immunol. 2001 167 5278 5285 10.4049/jimmunol.167.9.5278 11673543 151. Anavi S. Tirosh O. iNOS as a Metabolic Enzyme under Stress Conditions Free Radic. Biol. Med. 2020 146 16 35 10.1016/j.freeradbiomed.2019.10.411 31672462 152. Cinelli M.A. Do H.T. Miley G.P. Silverman R.B. Inducible Nitric Oxide Synthase: Regulation, Structure, and Inhibition Med. Res. Rev. 2020 40 158 189 10.1002/med.21599 31192483 PMC6908786 153. Kotsafti A. Scarpa M. Castagliuolo I. Scarpa M. Reactive Oxygen Species and Antitumor Immunity-From Surveillance to Evasion Cancers 2020 12 1748 10.3390/cancers12071748 32630174 PMC7409327 154. Cheung E.C. Vousden K.H. The Role of ROS in Tumour Development and Progression Nat. Rev. Cancer 2022 22 280 297 10.1038/s41568-021-00435-0 35102280 155. Roy K. Jędrzejewski T. Sobocińska J. Spisz P. Maciejewski B. Hövelmeyer N. Passeri B. Wrotek S. Divergent Impact of Endotoxin Priming and Endotoxin Tolerance on Macrophage Responses to Cancer Cells Cell Immunol. 2025 411–412 104934 10.1016/j.cellimm.2025.104934 40054049 156. Zheng J. Energy Metabolism of Cancer: Glycolysis versus Oxidative Phosphorylation (Review) Oncol. Lett. 2012 4 1151 1157 10.3892/ol.2012.928 23226794 PMC3506713 157. Alberghina L. Gaglio D. Gelfi C. Moresco R.M. Mauri G. Bertolazzi P. Messa C. Gilardi M.C. Chiaradonna F. Vanoni M. Cancer Cell Growth and Survival as a System-Level Property Sustained by Enhanced Glycolysis and Mitochondrial Metabolic Remodeling Front. Physiol. 2012 3 362 10.3389/fphys.2012.00362 22988443 PMC3440026 158. Van den Bossche J. Baardman J. Otto N.A. van der Velden S. Neele A.E. van den Berg S.M. Luque-Martin R. Chen H.J. Boshuizen M.C.S. Ahmed M. Mitochondrial Dysfunction Prevents Repolarization of Inflammatory Macrophages Cell Rep. 2016 17 684 696 10.1016/j.celrep.2016.09.008 27732846 159. Zakuan Z.D. Suresh K. Rational Use of Intravenous Polymyxin B and Colistin: A Review Med. J. Malays. 2018 73 351 359 30350826 160. Padhy I. Dwibedy S.K. Mohapatra S.S. A Molecular Overview of the Polymyxin-LPS Interaction in the Context of Its Mode of Action and Resistance Development Microbiol. Res. 2024 283 127679 10.1016/j.micres.2024.127679 38508087 161. Aysert-Yildiz P. Özgen-Top Ö. Şentürk A.F. Kanik S. Özger H.S. Dizbay M. Polymyxin B vs. Colistin: The Comparison of Neurotoxic and Nephrotoxic Effects of the Two Polymyxins BMC Infect. Dis. 2024 24 862 10.1186/s12879-024-09759-2 39187812 PMC11346049 162. Yessayan L. Pino C.J. Humes H.D. Extracorporeal Therapies in Sepsis: A Comprehensive Review of the Selective Cytopheretic Device, Polymyxin B and Seraph Cartridges Ren. Fail. 2025 47 2459349 10.1080/0886022X.2025.2459349 39962644 PMC11837919 163. Li X. Liu C. Mao Z. Qi S. Song R. Zhou F. Effectiveness of Polymyxin B-Immobilized Hemoperfusion against Sepsis and Septic Shock: A Systematic Review and Meta-Analysis J. Crit. Care 2021 63 187 195 10.1016/j.jcrc.2020.09.007 33012579 164. Chen J.J. Lai P.C. Lee T.H. Huang Y.T. Blood Purification for Adult Patients With Severe Infection or Sepsis/Septic Shock: A Network Meta-Analysis of Randomized Controlled Trials Crit. Care Med. 2023 51 1777 1789 10.1097/CCM.0000000000005991 37470680 PMC10645104 165. Rice T.W. Wheeler A.P. Bernard G.R. Vincent J.L. Angus D.C. Aikawa N. Demeyer I. Sainati S. Amlot N. Cao C. A Randomized, Double-Blind, Placebo-Controlled Trial of TAK-242 for the Treatment of Severe Sepsis Crit. Care Med. 2010 38 1685 1694 10.1097/CCM.0b013e3181e7c5c9 20562702 166. Opal S.M. Laterre P.F. Francois B. LaRosa S.P. Angus D.C. Mira J.P. Wittebole X. Dugernier T. Perrotin D. Tidswell M. Effect of Eritoran, an Antagonist of MD2-TLR4, on Mortality in Patients with Severe Sepsis: The ACCESS Randomized Trial JAMA 2013 309 1154 1162 10.1001/jama.2013.2194 23512062 167. Heine H. Zamyatina A. Therapeutic Targeting of TLR4 for Inflammation, Infection, and Cancer: A Perspective for Disaccharide Lipid A Mimetics Pharmaceuticals 2022 16 23 10.3390/ph16010023 36678520 PMC9864529 168. Del Giudice G. Rappuoli R. Didierlaurent A.M. Correlates of Adjuvanticity: A Review on Adjuvants in Licensed Vaccines Semin. Immunol. 2018 39 14 21 10.1016/j.smim.2018.05.001 29801750 169. Yang J.X. Tseng J.C. Yu G.Y. Luo Y. Huang C.Y.F. Hong Y.R. Chuang T.H. Recent Advances in the Development of Toll-like Receptor Agonist-Based Vaccine Adjuvants for Infectious Diseases Pharmaceutics 2022 14 423 10.3390/pharmaceutics14020423 35214155 PMC8878135 170. Carter D. De La Rosa G. Garçon N. Moon H.M. Nam H.J. Skibinski D.A.G. The Success of Toll-like Receptor 4 Based Vaccine Adjuvants Vaccine 2025 61 127413 10.1016/j.vaccine.2025.127413 40570747 171. Wang Z.B. Xu J. Better Adjuvants for Better Vaccines: Progress in Adjuvant Delivery Systems, Modifications, and Adjuvant-Antigen Codelivery Vaccines 2020 8 128 10.3390/vaccines8010128 32183209 PMC7157724 172. Reed S.G. Carter D. Casper C. Duthie M.S. Fox C.B. Correlates of GLA Family Adjuvants’ Activities Semin. Immunol. 2018 39 22 29 10.1016/j.smim.2018.10.004 30366662 PMC6289613 173. Kelleher K. Subramaniam N. Drysdale S.B. The Recent Landscape of RSV Vaccine Research Ther. Adv. Vaccines Immunother. 2025 13 25151355241310601 10.1177/25151355241310601 39802673 PMC11724408 174. Su W. Ding X. Methods of Endotoxin Detection SLAS Technol. 2015 20 354 364 10.1177/2211068215572136 25720597 175. Schneier M. Razdan S. Miller A.M. Briceno M.E. Barua S. Current Technologies to Endotoxin Detection and Removal for Biopharmaceutical Purification Biotechnol. Bioeng. 2020 117 2588 2609 10.1002/bit.27362 32333387 176. Dullah E.C. Ongkudon C.M. Current Trends in Endotoxin Detection and Analysis of Endotoxin-Protein Interactions Crit. Rev. Biotechnol. 2017 37 251 261 10.3109/07388551.2016.1141393 26863480 177. Jackie J. Lau W.K. Feng H.T. Li S.F.Y. Detection of Endotoxins: From Inferring the Responses of Biological Hosts to the Direct Chemical Analysis of Lipopolysaccharides Crit. Rev. Anal. Chem. 2019 49 126 137 10.1080/10408347.2018.1479958 30821472 178. Foster D.M. Kellum J.A. Endotoxic Septic Shock: Diagnosis and Treatment Int. J. Mol. Sci. 2023 24 16185 10.3390/ijms242216185 38003374 PMC10671446 179. He R.R. Yue G.L. Dong M.L. Wang J.Q. Cheng C. Sepsis Biomarkers: Advancements and Clinical Applications-A Narrative Review Int. J. Mol. Sci. 2024 25 9010 10.3390/ijms25169010 39201697 PMC11354379 180. Kataria Y. Remick D. Sepsis Biomarkers Methods Mol. Biol. 2021 2321 177 189 10.1007/978-1-0716-1488-4_16 34048017 181. Fux A.C. Casonato Melo C. Michelini S. Swartzwelter B.J. Neusch A. Italiani P. Himly M. Heterogeneity of Lipopolysaccharide as Source of Variability in Bioassays and LPS-Binding Proteins as Remedy Int. J. Mol. Sci. 2023 24 8395 10.3390/ijms24098395 37176105 PMC10179214 182. Burgmaier L. Lifka J. Avci-Adali M. Reich J. Endotoxin Masking in Human Plasma: The Role of Protein Interactions and Lipopolysaccharide Structure Eur. J. Pharm. Biopharm. 2025 214 114786 10.1016/j.ejpb.2025.114786 40518054 183. Soppert J. Brandt E.F. Heussen N.M. Barzakova E. Blank L.M. Kuepfer L. Hornef M.W. Trebicka J. Jankowski J. Berres M.L. Blood Endotoxin Levels as Biomarker of Nonalcoholic Fatty Liver Disease: A Systematic Review and Meta-Analysis Clin. Gastroenterol. Hepatol. 2023 21 2746 2758 10.1016/j.cgh.2022.11.030 36470528 184. Teixeira P.C. Dorneles G.P. Santana Filho P.C. da Silva I.M. Schipper L.L. Postiga I.A.L. Neves C.A.M. Rodrigues Junior L.C. Peres A. de Souto J.T. Increased LPS Levels Coexist with Systemic Inflammation and Result in Monocyte Activation in Severe COVID-19 Patients Int. Immunopharmacol. 2021 100 108125 10.1016/j.intimp.2021.108125 34543980 PMC8426217 185. Larsen P.P. Féart C. Pais de Barros J.P. Merle B.M.J. Gayraud L. Delyfer M.N. Korobelnik J.F. Delcourt C. Association of Age-Related Macular Degeneration with a Blood Biomarker of Lipopolysaccharide, a Gut Bacterial Proinflammatory Toxin Investig. Ophthalmol. Vis. Sci. 2023 64 47 10.1167/iovs.64.14.47 PMC10691392 38032336 186. Ribeiro C.B. Castro F. de O.F. de; Dorneles, G.P.; de Sousa Barros, J.B.; Silva, J.M.; Tavares, C.; Carvalho, H.R.; Carlos da Cunha, L.; Nagib, P.; Hoffmann, C.; et al. The Concomitant Use of Cannabis and Cocaine Coexists with Increased LPS Levels and Systemic Inflammation in Male Drug Users Cytokine 2021 141 155472 10.1016/j.cyto.2021.155472 33618152 187. Gallucci G. Santucci N. Díaz A. Bongiovanni B. Bértola D. Gardeñez W. Rassetto M. Bay M.L. Bottasso O. D’Attilio L. Increased Levels of Circulating LPS during Tuberculosis Prevails in Patients with Advanced Pulmonary Involvement PLoS ONE 2021 16 e0257214 10.1371/journal.pone.0257214 34506568 PMC8432878 188. Jayashree B. Bibin Y.S. Prabhu D. Shanthirani C.S. Gokulakrishnan K. Lakshmi B.S. Mohan V. Balasubramanyam M. Increased Circulatory Levels of Lipopolysaccharide (LPS) and Zonulin Signify Novel Biomarkers of Proinflammation in Patients with Type 2 Diabetes Mol. Cell. Biochem. 2014 388 203 210 10.1007/s11010-013-1911-4 24347174 189. de Waal G.M. de Villiers W.J.S. Forgan T. Roberts T. Pretorius E. Colorectal Cancer Is Associated with Increased Circulating Lipopolysaccharide, Inflammation and Hypercoagulability Sci. Rep. 2020 10 8777 10.1038/s41598-020-65324-2 32472080 PMC7260372 Figure 1 The general structure of lipopolysaccharide [ 9 10 11 12 13 Figure 2 Toll-like receptor 4 signalling pathways. On the cell surface (LPS recognition): LPS LBP CD14 MD2 TLR4 TIR domain TIRAP MyD88 MyD88-dependent signalling pathway: IRAK (1,2,4) TRAF6 TAK1 MAPK AP1 IκBα NF-κB RIP-1 TRIF-dependent signalling pathway (endocytosed TLR4): TRAM TRIF TRAF3 TBK1 IKKε IRF3 Effector molecules and cytokines: TGF-β TNF-α IL-6 IL-1β Pro-IL-1β Pro-IL-18 NLRP3 Pro-Caspase-11 Type I Interferon Figure 3 Schematic representation of the inflammasome signalling pathway, from priming and activation to cytokine maturation and pyroptotic cell death. On the cell surface (LPS recognition): LPS TLR4 TIRAP MyD88 Cytoplasmic sensors and regulators: NF-κB NLRP3 GBPs Caspases and inflammasome: Pro-Caspase-11 Caspase-11* ASC GSDMD Cytokines and precursors: Pro-IL-1β Pro-IL-18 IL-1β IL-18 Protein domains: CARD PYD NACHT p20/p10 Figure 4 Schematic representation of types of immune response to Gram-negative bacteria regarding homeostasis. jcm-14-06478-t001_Table 1 Table 1 Contrasting endotoxin tolerance and chronic inflammation mechanisms. Stimulation Chronic Inflammation Endotoxin Tolerance The alarm goes off (LPS) The system keeps running and will not shut down The system has “overheated” and stopped responding Immunological outcome Ongoing battle, tissue destruction Immune silence due to hyporesponsivenessbut Adaptive function Low—destructive and uncontrolled response High—protective mechanism against immunopathology Mechanism responsible for lack of fever Low-level immune activation that does not reach the threshold needed to trigger a robust febrile response Functional reprogramming of innate immune cells leading to sustained suppression of fever, even after repeated LPS exposure, unless tolerance is overcome jcm-14-06478-t002_Table 2 Table 2 Summary of various LPS analogues as components of adjuvants currently used in clinical studies [ 169 170 171 Type of LPS Analogues Advantage of LPS Modification Adjuvant Composition Conditions Phase MPL Reduced toxicity in comparison to LPS AS01 MPL with QS21 in liposome form Malaria Approved AS02 MPL with QS21 in squalene oil-in-water emulsion HIV I AS04 MPL adsorbed onto aluminium HBV Approved GLA Increased immunological response compared to MPL. Synthetic substance. GLA-AF GLA in an aqueous form HIV I GLA-LSQ GLA with QS21 in liposome form Malaria I GLA-SE GLA in squalene oil-in-water emulsion Schistosomiasis II SLA Increased immunological response compared to GLA. Synthetic substance. SLA-SE SLA in squalene oil-in-water emulsion Leishmaniasis I ",
  "metadata": {
    "Title of this paper": "Colorectal Cancer Is Associated with Increased Circulating Lipopolysaccharide, Inflammation and Hypercoagulability",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470294/"
  }
}