{
  "title": "Paper_261",
  "abstract": "Science Science 319 nihpa Science (New York, N.Y.) 0036-8075 1095-9203 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12486176 PMC12486176.1 12486176 12486176 NIHMS2113033 39325906 10.1126/science.adk2536 NIHMS2113033 NIHPA2113033 1 Article A host-adapted auxotrophic gut symbiont induces mucosal immunodeficiency Lu Qiuhe 1 Hitch Thomas C. A. 2 Zhou Julie Y. 1 Dwidar Mohammed 3 4 Sangwan Naseer 3 4 Lawrence Dylan 5 Nolan Lila S. 5 Espenschied Scott T. 1 Newhall Kevin P. 1 Han Yi 1 Karell Paul E. 1 Salazar Vanessa 1 Baldridge Megan T. 5 Clavel Thomas 2 Stappenbeck Thaddeus S. 1 * 1 2 3 4 5 Author contributions: immunophila T. immunophila T. immunophila Pigr −/− * Corresponding author. stappet@ccf.org Competing interests: 27 9 2024 27 9 2024 385 6716 498036 eadk2536 eadk2536 26 09 2025 01 10 2025 02 10 2025 02 10 2025 exclusive licensee American Association for the Advancement of Science. No claim to original US government works. https://www.science.org/content/page/science-licenses-journal-article-reuse INTRODUCTION: Secretory immunoglobulin A (SIgA) is a crucial component of mucosal barriers. Decreased SIgA levels are associated with increased vulnerability to infections and excessive inflammation in response to mucosal damage. The production of intestinal SIgA depends on the microbiome and specific microorganisms can drive the magnitude of the overall immune response. Conversely, mice have been observed with spontaneous reduction in intestinal SIgA levels; this phenotype has been proposed to be mediated by IgA degradation directed by gut symbiotic bacteria. However, the specific bacteria contributing to low levels of intestinal SIgA in mice remain unknown. RATIONALE: We developed an in vitro functional biochemical assay to screen gut bacteria from mice with low levels of SIgA. Our goal was to identify bacterial symbionts contributing to IgA degradation and to understand their relationship with the host and other components of the microbiome. RESULTS: We conducted a functional screen of the bacterial microbiota in wild-type (WT) mice with spontaneous low levels of intestinal SIgA. This screening led to the discovery and identification of a previously unidentified Gram-negative bacterium belonging to the Muribaculaceae Tomasiella immunophila T. immunophilla T. immunophila T. immunophila T. immunophila Salmonella Candida albicans T. immunophila T. immunophila T. immunophila T. immunophila T. immunophila CONCLUSION: This study provides evidence regarding the critical role played by the degradative capabilities of the gut microbiome in specific aspects of the mucosal immune and intestinal barrier system. Our research highlights how certain bacterial species, here T. immunophila T. immunophila T. immunophila Harnessing the microbiome to benefit human health requires an initial step in determining the identity and function of causative microorganisms that affect specific host physiological functions. We show a functional screen of the bacterial microbiota from mice with low intestinal immunoglobulin A (IgA) levels; we identified a Gram-negative bacterium, proposed as Tomasiella immunophila T. immunophila T. immunophila Graphical Abstract  Screening and functional study of immunoglobulin-degrading bacteria in the intestine. Tomasiella immunophila T. immunophila Salmonella BioRender.com pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "A host-adapted auxotrophic gut symbiont induces mucosal immunodeficiency",
    "Journal it was published in:": "Science (New York, N.Y.)",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486176/"
  }
}