{
  "title": "Paper_57",
  "abstract": "pmc Int Dent J Int Dent J 4261 intdentj International Dental Journal 0020-6539 1875-595X Elsevier PMC12489778 PMC12489778.1 12489778 12489778 40845403 10.1016/j.identj.2025.100955 S0020-6539(25)00241-2 100955 1 Scientific Research Report Quality and Readability Assessment of Patient-Centered Online Information on Apical Surgery Álvarez-Nóvoa Pablo a Miguéns-Vila Ramón ramon.miguens.vila@usc.es a ⁎ Martín-Biedma Benjamín a De-Deus Gustavo b Pecci-Lloret María Pilar c Teulé-Trull Miriam a Seoane-Romero Juan d Castelo-Baz Pablo pablo.castelo.baz@usc.es a ⁎ a b c d ⁎ ramon.miguens.vila@usc.es pablo.castelo.baz@usc.es 10 2025 21 8 2025 75 5 492980 100955 21 08 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Introduction and aims Nowadays, patients seek medical information online. Patient-oriented content must be easy to read and trustworthy. This study aimed to assess the quality and readability of online information about apical surgery and apicoectomy in English and Spanish. Methods The authors performed the following systematic searches on Google in February 2023: “apicoectomy”, “apicectomía”, “apical surgery”, and “cirugía apical”. The first 100 websites of each query were selected. English readability was assessed using Flesch-Kincaid Reading Grade Level, Flesch Reading Ease Score, Gunning Fog Index, Coleman-Liau Index, Automated Readability Index and Simple Measure of Gobbledygook Index. The Fernández-Huerta Index and INFLESZ were used to assess Spanish readability. Quality was measured using the DISCERN tool. Results A total of 165 sites were included in total. Readability for English-language sites (“apical surgery” and “apicoectomy”) was categorised as “fairly difficult to read” [FRES (apical surgery) = 54.7; FRES (apicoectomy) = 54.3]. Similarly, Spanish sites (“cirugía apical” and “apicectomía”) were classified as “relatively difficult to read”. Overall, the DISCERN tool showed a low average quality of information for all terms analysed. Conclusion English and Spanish online information about apical surgery is difficult for the average patient to understand and presents significant quality deficiencies. Clinical relevance The Internet is a powerful tool for communicating with patients, but available apical surgery information is difficult for laypersons to understand and has a low overall quality. To overcome this issue, endodontists should produce high-quality, patient-relevant materials in plain language. Key words Apical surgery Apicoectomy DISCERN Health literacy Internet Readability pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Over the past few decades, the percentage of the population regularly using the Internet has been steadily increasing. In 2019 alone, there were 366 million new users, meaning that almost 60% of the global population is now “online” and has access, almost instantly, to more information than ever before in history. 1 Since the mid-twentieth century, the relationship between healthcare providers and patients has shifted from traditional paternalistic medicine to a healthcare model emphasising patient autonomy and active participation in treatment decision-making. Information is a cornerstone of this doctor-patient relationship model, as patients have the right to access all available information related to any medical procedure that concerns them. Correspondingly, healthcare professionals must provide understandable and appropriate information that meets the specific needs of the patient. 2 , 3 The development of internet access at the end of the 20th century and its globalisation during the last few decades have only accelerated this change process. With a growing number of patients using the Internet as a tool, there is virtually unlimited access to information on medical issues. It is not surprising that a substantial percentage of the population, such as 60% of Europeans and 80% of North Americans, admit to having searched for medical information on the Internet. 4 Dentistry is not excluded from this situation, and certain topics such as aesthetic dentistry treatments, implantology, periodontics, oral pathology, and oral cancer generate significant interest among patients, accounting for the majority of search engine queries. 5 6 7 8 Currently, there is a vast amount of web-based information available on different treatment options. Although patients seem to find the information found online reliable and trustworthy, 9 4 , 10 For information to be useful and accessible to patients, it must meet 2 fundamental criteria: it should be high quality and understandable for the layperson. To evaluate the quality of medical information available online for patients, specific tools such as DISCERN have been developed for qualitative assessment. 11 12 One area where this issue is particularly relevant is apical surgery and apicoectomy, which are frequently used synonymously despite referring to distinct procedures. Apicoectomy is the surgical procedure of removing the tooth apex, without considering fundamental aspects of apical surgery, such as root-end sealing. While there has been research on the quality and readability of online information related to endodontics, there is currently no such research on apical surgery. 10 To address this gap, the current study aims to assess the quality, accessibility, and readability of patient-targeted information on apical surgery and apicoectomy in Spanish and English, the second and third most widely spoken languages in the world, respectively. 13 Methods Search strategy The authors conducted an electronic search in February 2023 using the Google® search engine. The following terms were used individually: “apicoectomy”, “apicectomía”, “apical surgery” and “cirugía apical”. For each search term, the results were displayed in sets of 10 websites per page. We considered the first 100 results for each term, resulting in a total of 400 websites being reviewed. To be included in the study, websites had to provide information specifically aimed at patients regarding apicoectomy or apical surgery, in either English or Spanish. 12 All websites were independently analysed by 2 reviewers (R.M.-V., P.A.-N.) according to the predefined eligibility criteria. Any discrepancies during the selection process were resolved through discussion and consensus with the involvement of a third reviewer (P.C.-B). Quality assessment The DISCERN tool 11 Readability assessment Readability was assessed using several tools for English-language websites, including the Flesch-Kincaid Reading Grade Level (FKRGL), Flesch Reading Ease Score (FRES), Gunning Fog Index (GFI), Simple Measure of Gobbledygook (SMOG), Coleman-Liau Index (CLI), and Automated Readability Index (ARI), as shown in Table 1 https://www.webfx.com/tools/read-able/ 14 12 Table 1 Readability formulas used in the study. Table 1: Language Index Formula English FRES 206.835 - (1.015 (total words/total sentences)) - (84.6 (total syllables/total words)) FKGL (0.39 (total words/total sentences)) + (11.8 (total syllables/total words)) - 15.59 GFI 0.4 ((words/sentences) + 100 (complex words*/words)) CLI (5.89 (characters/words)) - (29.5 (sentences/words)) - 15.8 ARI 4.71 (letters/words) + 0.50 (words/sentences) - 21.43 SMOG index 1.0430 (square root 30 x polysyllables*/sentences) + 3.1291 Spanish Fernández-Huerta 206.84 - (0.60 (total words/total sentences)) - (1.02 (total syllables/total words)) Inflesz 206.835 - ((62.3) (total syllables)) / (total words)) - ((total words)/(total sentences)) The readability scores obtained vary according to the tool used. For example, FRES classifies texts as: “very difficult” (0-30, scientific literature), “difficult” (30-50, university level), “relatively difficult” (50-60, high school level), normal (60-70), “relatively easy” (70-80), “easy” (80-90), and “very easy” (90-100, understandable by an 11-year-old). The FKRGL provides the required educational level for comprehension, with “easy” indicating texts suitable for children under 12, and “difficult” for a reading age above 16. 7 For Spanish-language websites, readability was evaluated using the INFLESZ scale and Fernández-Huerta formula, also shown in Table 1 15 http://www.legible.es For statistical purposes, results from FRES and Fernández-Huerta were grouped into 3 categories: “difficult” (FRES ≤ 60; FH ≤ 60), “normal” (FRES 60-70; FH 60-70), and “easy” (FRES ≥ 70; FH ≥ 70). Statistical analysis Data were analysed using the statistical package IBM® SPSS® Statistics 27.0 (IBM) for Mac. Descriptive statistics were calculated for each variable, including the mean and median as measures of central tendency, and the SD and IQR as measures of dispersion. To determine whether the data followed a normal distribution, the Kolmogorov-Smirnov test was applied. Since the samples did not follow a normal distribution, non-parametric tests were applied: the Kruskal-Wallis test was used to compare the DISCERN scores across the 4 search terms and the Mann-Whitney U test was used to compare readability and DISCERN values between English and spanish websites. The level of significance was set at P Results Initially, the first 100 results for each search term - “apicoectomy”, “apicectomía”, “apical surgery” and “cirugía apical” - were identified and screened. Out of a total of 400 websites, 235 were excluded for not meeting the inclusion criteria, and the remaining 165 websites were selected for further analysis ( Figure 1 Table 2 Figure 2 Fig. 1 Flow chart of the study. Fig 1: Table 2 The distribution of websites according to readability level. Table 2: Search term Difficult Normal Easy Total Apical surgery 22 9 2 33 Cirugía apical 14 12 0 26 Apicoectomy 50 15 2 67 Apicectomía 21 17 1 39 Total 107 53 5 165 Fig. 2 Percentage of difficulty in all groups. Fig 2: After analysing the results from all the readability indices ( Table 3 Table 3 Descriptive analysis of the readability scores for English- and Spanish-language sites. Table 3: Term and index Mean (SD) Median P 10 P 25 P 50 P 75 P 90 Apical surgery (n= 33) FKRGL (Flesch-Kincaid Reading Grade Level) 7.3 (1.3) 7.3 5.3 6.3 7.3 8.1 9.2 FRES (Flesch Reading Ease Score) 55.1 (8.8) 54.7 44.8 48.1 54.7 62.0 68.1 GFI (Gunning Fog index) 8.1 (1.7) 7.5 6.6 6.9 7.5 9.3 11.0 CLI (Coleman-Liau index) 13.5 (2.3) 13.4 10.2 11.9 13.4 14.7 17.0 ARI (Automated Readability index) 5.4 (1.9) 5.4 3.0 4.3 5.4 6.7 8.1 SMOG (Simple Measure of Gobbledygook index) 6.6 (1.1) 6.3 5.6 5.9 6.3 7.0 8.9 Apicoectomy (n= 67) FKRGL (Flesch-Kincaid Reading Grade Level) 7.3 (2.2) 7.5 6.1 6.7 7.5 8.2 9.2 FRES (Flesch Reading Ease Score) 55.9 (14.3) 54.3 44.7 49.3 54.3 60.4 65.5 GFI (Gunning Fog index) 8.4 (2.1) 8.6 6.4 7.6 8.6 9.5 11.0 CLI (Coleman-Liau index) 13.3 (4.4) 13.4 11.4 12.7 13.4 14.8 16.3 ARI (Automated Readability index) 5.6 (3.9) 5.7 4.9 5.1 5.7 7.0 8.3 SMOG (Simple Measure of Gobbledygook index) 6.9 (1.3) 6.9 5.8 6.4 6.9 7.4 8.5 Cirugía apical (n= 26) Fernández-Huerta index 53.3 (10.4) 54.7 40.3 50.4 54.7 60.4 62.8 INFLESZ 48.2 (10.4) 49.3 35.1 45.6 49.3 55.7 57.8 Apicectomía (n = 39) Fernández-Huerta index 57.3 (8.2) 59.2 46.9 52.6 59.2 62.5 65.1 INFLESZ 52.1 (8.8) 54.4 38.2 47.8 54.4 57.9 60.6 We observed that the webpages resulting from the terms “apical surgery” and “apicoectomy” were ‘relatively difficult to read’, equivalent to the level of education of a student in the final stage of secondary education based on the FRES index (FRES (apical surgery) = 54.7, IQR [48.1 - 62.0]; FRES (apicoectomy) = 54.3, IQR [49.3-60.4]). Similarly, based on the Fernández-Huerta index, and in line with the INFLESZ scale, Spanish web pages were classified as 'relatively difficult to read, at the level of a pre-university student (Fernandez-Huerta (cirugía apical) = 54.7, IQR [50.4-60.4]; Fernandez-Huerta (apicectomía)= 59.2, IQR [47.8-57.9]). No statistically significant differences in FRES and Fernandez-Huerta values were found between the different search terms in both languages ( p Overall, the evaluation of the quality of information displayed on the web pages using the DISCERN tool showed a low average quality of information for all terms analysed. Therefore, it must be assumed that the analysed information presents significant shortcomings ( Figure 3 Figure 4 p Fig. 3 Boxplot comparing the DISCERN scores for the 4 search terms (“apicoectomy”, “apical surgery”, “apicectomía”, and “cirugía apical”). The central black line represents the median score, the box shows the IQR, and the whiskers indicate minimum and maximum values excluding outliers. Circles indicate outlier values. The plot visualises the distribution and variability in the quality of online information according to the DISCERN scale. Fig 3: Fig. 4 DISCERN items values expressed as median. Fig 4: In pairwise comparisons using the Mann-Whitney U test we found statistically significant differences between “apicoectomy” and “apicectomía” ( p p Discussion During the last few decades, particularly the last third of the 20th century, the practice of medicine has shifted from a paternalistic model based on the principle of beneficence, which created an unequal relationship between doctors and patients, to a more patient-centric approach, characterised by a horizontal relationship based on a peer-to-peer dynamic. 16 , 17 18 19 The Internet is undoubtedly a valuable tool for accessing information globally and instantly, and the amount of medical information available online is increasing daily. However, to be truly useful for patients (and society), this information must be easily accessible, understandable, and highly trustworthy. Patients primarily access health information through search engines. 18 20 It is not uncommon for the terms \"apicoectomy\" and \"apical surgery\" to be used synonymously in scientific literature, which can confuse patients seeking online information. Although the term “apical surgery” is preferred from an academic standpoint, we deemed it appropriate to compare the quality and readability of information for both terms. Currently, anyone with Internet access can find a vast amount of information with just a few clicks. For instance, a Google search for \"apicoectomy\" yields 1,700,000 results, while \"apical surgery\" generates 15,200,000 results. Similarly, \"apicectomía\" and \"cirugía apical\" generate 53,000, and 267,000 results, respectively. With such vast quantities of information readily available, it is safe to say that the first criterion for accessibility has been met, at least for the 4.6 billion people who have Internet access worldwide (Internet world stats: Internet usage statistics). However, the number of results is only an indicator of topic popularity. When it comes to locating and selecting, the average user rarely goes beyond the first page of search results. Therefore, our study analysed a total of 165 pages extracted from 400 search results, in 2 different languages: English and Spanish. These languages encompass approximately 1.5 billion speakers (983 million English speakers, the second most spoken language, and 527 million Spanish speakers, the third). 13 Nonetheless, the existence of substantial web content on a given topic does not necessarily equate to true accessibility, especially in terms of readability and comprehensibility. Most medical information available online is written at the level of a 16-year old (10th grade) student. This contrasts with the fact that the average adult reads at the level of a 13 to 14-year-old adolescent, with 20% reading at or below the level of an 11-year-old. 21 22 12 Similar results have been reported in the dental literature. For instance, Alpaydin et al. found that online data regarding clear aligners in English showed poor quality and readability (87% scored poor/very poor with DISCERN; 66.6% classified as fairly or very difficult to read). 23 24 25 26 The DISCERN tool was designed with 2 purposes: to assist users in evaluating medical content and to serve as a guide for developing new, higher-quality content. Its use confirmed that, in our sample, there were no significant differences in content quality between languages (Spanish vs. English). However, relevant differences were found when comparing specific terms (\"apicoectomy\" vs. \"apicectomía\"; \"apical surgery\" vs. \"apicoectomy\"). The significant discrepancy between \"apical surgery\" and \"apicoectomy\", is particularly noteworthy, as these terms are often used interchangeably. The absence of a regulatory framework for health information on the Internet hinders the development of patient-oriented content that meets basic standards for quality and readability. Therefore, using validated tools such as DISCERN and established readability indices is essential when creating new patient educational resources. Although the Internet is a powerful medium for patient communication, the available information on apical surgery is generally difficult for laypersons and lacks quality. Endodontists should be encouraged to develop accurate and accessible patient education materials using plain language. Limitations This study presents some limitations that should be acknowledged. First, the dynamic and ever-changing nature of online content means that the information retrieved during the search period may no longer be representative later. Second, the search was conducted exclusively using Google®, which, while the most widely used search engine, may not reflect results obtained from other platforms or regions with different indexing algorithms. Third, the study was limited to English and Spanish, which may restrict the generalisability of the findings to speakers of other languages. Additionally, although a structured search strategy was applied, there is an inherent risk of selection bias, as only the first 100 results per term were considered. This may exclude relevant content that users could still access beyond the initial pages. Furthermore, although the data collection and assessment were conducted by calibrated reviewers, the subjective nature of some evaluation tools may introduce variability despite standardisation efforts. Lastly, it is important to note that a significant limitation of our study is that it did not include an analysis of information-seeking tools based on artificial intelligence (AI). The popularity of these technologies has grown in recent years, mainly due to their ability to provide immediate and personalised access to information about symptoms, diseases or treatments. We believe it is important to emphasise that future research on health literacy should include an analysis not only in terms of the quality of the information obtained through such tools, but also regarding users’ understanding and perception of that information. Conclusions The information available online in both English and Spanish regarding apical surgery and apicoectomy treatments is difficult for the average patient to understand. Furthermore, the quality of this information is clearly inadequate, as assessed by the DISCERN tool. Improving the quality and readability of online health content is a shared responsibility between content creators and regulatory bodies. Efforts should focus on providing clear, accurate, and accessible information to support informed decision-making. Author contributions Álvarez-Nóvoa, P. contributed to data collection, the analysis and interpretation of data, drafting the manuscript, and revising the manuscript. Miguéns-Vila, R. contributed to data collection, the analysis and interpretation of data, drafting the manuscript, and revising the manuscript. Martín-Biedma, B. contributed to the conception and design of the study and to revising the manuscript. De-Deus, G. contributed to the conceptualisation, conception and design of the study and to revising the manuscript. Pecci-Lloret, M.P. contributed to data analysis and drafting the manuscript. Teulé-Trull, M. contributed to the design of the study and drafting the manuscript. Seoane-Romero, J. contributed to data collection and drafting the manuscript. Castelo-Baz, P. contributed to revising the data, conceptualisation, the conception and design of the study, and revising the manuscript. All authors have read and agreed to the published version of the manuscript. Funding This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors. Conflict of interest None disclosed. REFERENCES 1 Stratista: Internet usage worldwide - statistics & facts. Available from: https://www.statista.com/topics/1145/internet-usage-worldwide/ 2 Brock DW. The ideal of shared decision making between physicians and patients Kennedy Inst Ethtics J 1 1991 28 47 10.1353/ken.0.0084 10113819 3 Komrad MS. The defence of medical paternalism: maximising patients' autonomy J Med Ethtics J 9 1983 38 44 10.1136/jme.9.1.38 PMC1060849 6834402 4 Kulasegarah J. McGregor K. Mahadevan M. Quality of information on the Internet–has a decade made a difference? Ir J Med Sci 187 2018 873 876 10.1007/s11845-018-1790-5 29594693 5 Chesnut I.G. Reynolds K. Perceptions of how the Internet has impacted on dentistry Br Dent J 200 2006 161 165 10.1038/sj.bdj.4813195 16474364 6 Bizzi I. Ghezzi P. Paudyal P. Health information quality of websites on periodontology J Clin Periodontol 44 2017 308 314 10.1111/jcpe.12668 28005268 7 Leira-Feijoo Y. Ledesma-Ludi J. Seoane-Romero J. Blanco-Carrión J. Seoane J. Varela-Centelles P. Available web-based dental implants information for patients. How good is it? Clin Oral Implants Res 26 2015 1276 1280 10.1111/clr.12451 25041413 8 Lorenzo-Pouso A.I. Pérez-Sayáns M. Kujan O. Castelo-Baz P. Chamorro-Petronacci C. García-García A. Patient-centered web-based information on oral lichen planus: Quality and readability Oral Med Oral Pathol Oral Surg 24 2019 e461 e467 10.4317/medoral.22992 PMC6667009 31246939 9 Diaz J.A. Griffith R.A. Ng J.J. Reinert S.E. Friedmann P.D. Moulton AW. Patients' use of the Internet for medical information J Gen Intern Med 17 2002 180 185 10.1046/j.1525-1497.2002.10603.x 11929503 PMC1495021 10 Rossi-Fedele G. Musu D. Cotti E. Dogramaci EJ. Root canal treatment versus single-tooth implant: a systematic review of internet content J Endod 42 2016 846 853 10.1016/j.joen.2016.02.011 27080114 11 Charnock D. Shepperd S. Needham G. Gann R. DISCERN: an instrument for judging the quality of written consumer health information on treatment choices J Epidemiol Community Health 53 1999 105 111 10.1136/jech.53.2.105 10396471 PMC1756830 12 Miguéns-Vila R. Ledesma-Ludi Y. Rodríguez-Lozano F. Varela-Centelles P. Seoane-Romero J.M. Castelo-Baz P. Disparities between English and Spanish in readability of online endodontic information for laypeople J Am Dent Assoc 149 2018 960 966 10.1016/j.adaj.2018.07.003 30219207 13 Simmons G, Fennig G. What is the most spoken language? In: Ethnol Lang World, 20th ed, 2021. Available from: https://www.ethnologue.com/ 14 WebFX. Readability Test Tool [Internet]. Available from: https://www.webfx.com/tools/read-able/ 15 Barrio-Cantalejo I.M. Simón-Lorda P. Melguizo M. Escalona I. Marijuán M.I. Gernando P. Validación de la escala INFESZ para evaluar la legibilidad de los textos dirigidos a pacientes An Sist Sanit Navar 31 2008 135 152 10.4321/s1137-66272008000300004 18953362 16 Lazaro J. Doctors' status: changes in the past millennium Lancet Suppl 1999 354 10691427 10.1016/s0140-6736(99)90360-4 17 Scott G. Scott H.M. Auld TS. Consumer access to health information on the internet: health policy implications Aust New Zealand Health Policy 2 2005 13 10.1186/1743-8462-2-13 15985172 PMC1188053 18 Hardey M. E-health\": the internet and the transformation of patients into consumers and producers of health knowledge Information Commun Soc 4 2001 388 405 10.1080/713768551 19 Hart A. Henwood F. Wyatt S. The role of the internet in patient-practitioner relationships: findings from a qualitative research study J Med Internet Res 6 2004 E36 10.2196/jmir.6.3.e36 15471762 PMC1550614 20 Statcounter Global Stats Search Engine Market Share Worldwide. Statcounter Global Stats. Available from: https://gs.statcounter.com/search-engine-market-share 21 Safeer R.S. Keenan J. Health Literacy: the gap between physicians and patients Am Fam Physician 72 2005 463 468 16100861 22 Berkman N.D. Donahue K. Halpern D. Sheridan S.L. Donahue K.E. Halpern D.J. Low health literacy and health outcomes: an updated systematic review article Ann Intern Med 155 2011 97 107 10.7326/0003-4819-155-2-201107190-00005 21768583 23 Alpaidyn M.T. Buyuk S. Canigur N. Information on the Internet about clear aligner treatment – an assessment of content, quality and readability J Orofac Orthop 83 1 2022 1 12 10.1007/s00056-021-00331-0 PMC8284032 34269827 24 Aguirre P. Anibal I. Strieder A.P. Lotto M. Rizzato V. Cruvinel A. Online quality and readability assessment of Early childhood caries information based on websites from distinct countries: a cross-sectional study Eur J Paediatr Dent 23 2022 15 20 10.23804/ejpd.2022.23.01.03 35274537 25 Incerti Parenti S. Gamberini S. Fiordelli A. Bortolotti F. Laffranchi L. Alessandri-Bonetti G. Online information on mandibular advancement device for the treatment of obstructive sleep apnea: a content, quality and readability analysis J Oral Rehabil 50 2022 210 216 10.1111/joor.13400 36478600 26 Alshehri A. Alghofaili N. Alshunaiber R. Alkadi L. Quality and readability assessment of internet-based information on common prosthodontic treatments Int J Prosthodont 35 1 2022 37 43 10.11607/ijp.2022.35.1.37 33651024 ",
  "metadata": {
    "Title of this paper": "Quality and readability assessment of internet-based information on common prosthodontic treatments",
    "Journal it was published in:": "International Dental Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489778/"
  }
}