{
  "title": "Paper_511",
  "abstract": "J Maxillofac Oral Surg J Maxillofac Oral Surg 1433 jmos Journal of Maxillofacial & Oral Surgery 0972-8279 0974-942X Springer PMC11455775 PMC11455775.1 11455775 11455775 39376767 10.1007/s12663-022-01818-y 1818 1 Original Article Efficacy of Transdermal Buprenorphine Patch in Postoperative Pain Management in Oral and Maxillofacial Surgery N. Mythili 1 http://orcid.org/0000-0002-9822-8980 Navaneetham Romir romir.is.navaneetham@gmail.com 2 Sham M. E. 1 Menon Suresh 1 Kumar Veerendra 1 S. Archana 1 1 2 11 11 2022 10 2024 23 5 472260 1234 1239 7 4 2021 3 11 2022 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © The Association of Oral and Maxillofacial Surgeons of India 2022. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2022 Aim To evaluate the therapeutic efficacy of transdermal Buprenorphine patch in postoperative pain management in Major Oral and Maxillofacial surgeries done under general anesthesia. Materials and Method A total number of 100 subjects, both males and females in the age group of 18–60 years were included in the study. At the screening visit, a brief medical history was recorded for each prospective subject. The subject was selected according to the inclusion and exclusion criteria and consent was taken before placing the patch. For a period of 7 days, 10 mg Buprenorphine patch was placed on the skin of the patient for 3 h before the surgery. Analgesic efficacy was recorded for the next 7 days by using visual analogue scale (hereinafter refered to as “ VAS Results The mean VAS score in females 4.4, was high when compared to males 3.9, which would suggest that the patch was more effective in males compared to females. Trauma patients showed mean VAS score of 3.9 and pathology patients showed a mean VAS score of 4.1. 36% of the patients required additional analgesics as the VAS score was more than 5. 20% of patients between age group of 20–30 years required additional analgesics, 66.7% in 31–40yrs, 0% of 41–50yrs and 13.3% in 51–60yrs required additional analgesics. 24% of the females patients required 37 additional analgesics compared to the 12% in male patients. 21.6% of patients treated for pathology required additional analgesics compared to the 8.2% in trauma patients. Thus, the sensitivity of this study was 94.1% and specificity was 33.3%. Conclusion Buprenorphine has high analgesic potential, good safety profile, ease of opioids switches and reversibility by μ- antagonist. Transdermal route is cost effective and has increased patient compliance and ease of handling with less adverse effects. Thus, the efficacy of transdermal buprenorphine in postoperative pain management was good. Keywords Buprenorphine Post operative pain management Transdermal patch Analgesia pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Association of Oral and Maxillofacial Surgeons of India 2024 ",
  "metadata": {
    "Title of this paper": "Efficacy of Transdermal Buprenorphine Patch in Postoperative Pain Management in Oral and Maxillofacial Surgery",
    "Journal it was published in:": "Journal of Maxillofacial & Oral Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11455775/"
  }
}