{
  "title": "Paper_5",
  "abstract": "pmc Urol Int Urol Int 2985 kargersd UIN Urologia Internationalis 0042-1138 1423-0399 pmc-is-collection-domain yes pmc-collection-title Karger Author's Choice PMC12490847 PMC12490847.1 12490847 12490847 39978320 10.1159/000543985 543985 1 Research Article Cardiovascular Safety of GnRH Agonist-Based Androgen Deprivation Therapy in a Real-World Setting: Results from a Prospective Cohort Study (LEAN) Cardiovascular Safety of GnRH Agonist Therapy in a Real-World Setting 2772345 Schmitz-Dräger Bernd J.  a  b 2772346 Bismarck Ekkehardt  a 2772347 Ebert Thomas  a 2772348 Starlinger Roland  c 2772349 Dienes Kerstin  d 2772350 Ottillinger Bertram  e 2772351 Goebell Peter J.  b 2772352 Mühlich Stephan  f 2772353 Benderska-Söder Natalya  a 2772354 Bergler-Klein Jutta  g 2772355 Hakenberg Oliver W.  h  a Nuremberg Germany  b Erlangen Germany  c Kundl Austria  d Holzkirchen Germany  e Brunnthal Germany  f Bamberg Germany  g Vienna Austria  h Rostock Germany Correspondence to: Bernd J. Schmitz-Dräger, bernd_sd@yahoo.de 20 2 2025 10 2025 109 5 498211 519 527 18 6 2024 28 1 2025 2025 20 02 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Published by S. Karger AG, Basel 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is licensed under the Creative Commons Attribution-NonCommercial 4.0 International License (CC BY-NC) ( http://www.karger.com/Services/OpenAccessLicense Abstract Introduction LEAN is a prospective, multicenter, noninterventional, German cohort study in patients with locally advanced and metastatic hormone-sensitive prostate cancer (PC). This analysis explores the efficacy and safety of leuprorelin in patients with PC and an indication for androgen deprivation therapy (ADT) in routine practice. Methods Safety assessment focused on the incidence of major adverse cardiovascular (CV) events (MACEs; a composite of all-cause death, myocardial infarction, or stroke) over the 12-month study period. Patients initiating ADT before enrollment were excluded from the analysis. Results Of the 1,372 patients included, MACEs occurred in 57 (4.2%) patients and in 18/532 (3.4%) versus 39/840 (4.6%) patients without and with a pre-existing CV comorbidity, respectively ( p Conclusion In a large European patient cohort, leuprorelin-based ADT demonstrated an acceptable safety profile, with a low incidence of CV events. Keywords Prostate cancer Hormone-sensitive prostate cancer Noninterventional study Androgen deprivation therapy Leuprorelin Cardio-oncology Cardiovascular risk Cardiotoxicity This study was funded by Sandoz. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes accessibilitySummary WCAG 2.1 Level AA accessibility-pdf-ua-compliance yes Introduction The addition of chemotherapy and novel hormonal therapy to treatment of locally advanced and metastatic hormone-sensitive prostate cancer (PC) has greatly improved patient prognosis [ 1 4 2 4 ADT has been associated with increased cardiovascular (CV) risk in patients with PC [ 5 6 7 8 10 11 12 13 The LEAN study ( https://drks.de/search/en/trial/DRKS00005643 ® ® Patients and Methods Study Description The LEAN study was a 12-month, multicenter, prospective, noninterventional study conducted between October 2013 and June 2020, involving 190 centers in Germany. In total, 1,802 patients with PC and an indication for ADT were included. Participants were treated with leuprorelin 3.6 mg monthly or leuprorelin 5 mg every 3 months. Baseline demographic data for each patient were reported by their urologist. Patients also responded to a survey on baseline medications. Patient efficacy and safety data were acquired at baseline and after 3, 6, 9, and 12 months. Interim results from this study (LEAN I) involving 959 patients were published previously [ 14 1 Inclusion/Exclusion Criteria Inclusion/exclusion criteria have been published previously [ 14 Study Assessment The safety profile of leuprorelin was assessed through documentation of adverse events (AEs) and serious AEs according to the Common Terminology Criteria for Adverse Events [ 15 8 Statistical Analysis Changes in parameters over time were evaluated using appropriate tests (e.g., the paired-samples t Analysis was based on ( Fig. 1 the full analysis set (FAS), which included all patients who provided written informed consent; the safety analysis set (SAS), which included all patients in the FAS who received at least one implant of leuprorelin; and the modified SAS (mSAS), which included all patients in the SAS who did not violate any of the inclusion/exclusion criteria and presented with plausible data confirming the administration of leuprorelin at the initial visit and at least one subsequent visit. Fig. 1. Trial profile showing allocation of patients to each analysis set. GCP, Good Clinical Practice; FAS, full analysis set; LHRH, luteinizing hormone-releasing hormone; mSAS, modified SAS; SAS, safety analysis set. Patients receiving ADT before enrollment were excluded from the mSAS as the inclusion of patients tolerating ADT without experiencing a MACE may have led to positive selection bias. Analysis of MACE was therefore restricted to the mSAS. Results Patient Population Of 1,802 patients included in the SAS, 430 (23.9%) patients received leuprorelin ≤6 months before the study start date and were excluded from this analysis, leaving 1,372 patients in the mSAS ( Fig. 1 Table 1 https://doi.org/10.1159/000543985 Table 1. Baseline demographics and disease characteristics – mSAS Characteristic Evaluable patients, n Result Age, median (Q1;Q3), years 1,372 76 (71;80) Mean (SD) 74.6 (7.5) BMI, mean (SD) 1,365 27.5 (4.1) ≤30 kg/m 2 n 1,063 (77.9) >30 kg/m 2 n 302 (22.1) Duration of disease since diagnosis, mean (SD), months 1,294 26.0 (48.9) ECOG performance status (baseline/visit 1), n 1,371 Grade 0 835 (60.9) Grade 1 463 (33.8) Grade 2 73 (5.3) Gleason score, % 341 Grade 6/7a 32.8 Grade 7b 27.0 Grade 8–10 40.2 Pre-existing CV comorbidity, n 1,372 840 (61.2) Previous radical prostatectomy, n 1,372 378 (27.6) Radiation therapy, n 1,372 267 (19.5) Baseline PSA, ng/mL 1,298 Mean (SD) 28.9 (54.1) Median (min–max) 8.7 (0.0–350.0) Baseline testosterone, ng/mL 801 Mean (SD) 3.96 (2.17) BMI, body mass index; CV, cardiovascular; ECOG, Eastern Cooperative Oncology Group; mSAS, modified safety analysis set; PSA, prostate-specific antigen; Q1/3, first/third quartile; SD, standard deviation. Major Adverse CV Events MACEs (all-cause death, myocardial infarction, or stroke) occurred in 57/1,372 (4.2%) patients in the mSAS and in 18/532 (3.4%) versus 39/840 (4.6%) patients without and with a pre-existing CV comorbidity, respectively. This nonsignificant difference ( p Fig. 2 n n n n n n n n n Figure 3 n n n p Figure 4 Fig. 2. Failure probability plot for developing a MACE with number of patients at risk – mSAS. a b p Fig. 3. Swimmer plot showing the duration of observation for each patient who experienced a MACE and associated events – mSAS. CV, cardiovascular; MACE, major adverse cardiovascular event; mSAS, modified safety analysis set; PC, prostate cancer. Fig. 4. Incidence of MACEs by age-group and CV history – mSAS. CV, cardiovascular; MACE, major adverse cardiovascular event; mSAS, modified safety analysis set. Other Safety Outcomes Safety outcomes for the mSAS are summarized in Table 2 Table 2. Safety profile of leuprorelin – mSAS focusing on MACEs Event, n  N AE 539 (39.3) Adverse drug reaction 240 (17.5) Serious AE 242 (17.6) MACE 57 (4.2) Death 52 (3.8) CV death 12 (0.9) Death due to disease progression 20 (1.5) Unknown or other reason 20 (1.5) SADR 16 (1.2) AE, adverse event; CV, cardiovascular; MACE, major adverse cardiovascular event; mSAS, modified safety analysis set; SADR, serious adverse drug reaction. Of the 52 deaths reported from the 57 patients with MACEs, 12 were related to a CV event and 20 were related to disease progression. Furthermore, within the mSAS, 74 patients withdrew from the study prematurely, 68 (5.0%) at the patient’s request, and 6 (0.4%) due to AEs. Discussion This study focused on CV outcomes during treatment with leuprorelin. Furthermore, the effect of the addition of chemotherapy to the study protocol and the effect of leuprorelin dosage (1-monthly vs. 3-monthly) were not assessed, given that the proportions of patients who received chemotherapy or who received 1-monthly leuprorelin were very low. GnRH agonists and antagonists have different mechanisms of action, which can lead to differences in the rate of testosterone decline and follicle-stimulating hormone (FSH) levels. Sustained low FSH levels, as seen with GnRH antagonists, have been reported to be associated with lower rates of MACEs [ 16 12 17 The PRONOUNCE trial was a prospective, multicenter, open-label, randomized trial comparing the CV safety of degarelix (GnRH antagonist) versus leuprorelin in patients with advanced PC and pre-existing CV disease [ 8 p 8 Several real-world studies report a similar or even lower CV incidence with GnRH agonists versus antagonists. An observational trial reported findings similar to the PRONOUNCE trial, with 3.9% of patients treated with degarelix versus 2.9% treated with leuprorelin experiencing a MACE, as defined in PRONOUNCE [ 18 p 19 p 20 Another prospective cohort study in the Asian population compared GnRH agonists versus antagonists using two endpoints, MACE PRONOUNCE CVM PRONOUNCE p CVM p PRONOUNCE p CVM p 21 Two reviews have also explored the influence of GnRH agonists and antagonists on CV events. A Cochrane review of randomized controlled trials comparing degarelix and standard hormonal therapy in men with newly diagnosed advanced PC included 11 studies [ 9 10 9 10 Finally, a recent meta-analysis of prospective, randomized trials comparing GnRH antagonists and agonists in patients with PC found that there was insufficient high-quality, randomized evidence to definitively assess the superiority of either GnRH antagonists or GnRH agonists in terms of CV safety, particularly among those with CV comorbidities. Furthermore, the assessments for CV events were not consistent across the 11 identified studies, indicating a need for consistency in defining MACEs [ 22 The recent ESC guidelines suggest that a GnRH antagonist rather than an agonist should be considered in patients with pre-existing symptomatic coronary artery disease who require ADT [ 13 Table 1 We note that the number of patients receiving baseline CV medications might exceed the number of patients with CV comorbidities noted at baseline. However, this comparison is flawed as the baseline medication questionnaire was completed by a modified FAS, whereas this analysis of MACE data was in the mSAS. Regardless, the baseline medication data indicate the need for consistent review of CV history of elderly patients with PC. We further conclude that the use of any definition of MACE that includes all-cause mortality has limitations as outcomes are affected by the underlying patient cohort. While in our “mixed” cohort, 20 of 57 (35%) patients with MACE were reported to have died from PC, the proportion of patients with MACE would vary in a more selective cohort of patients with metastatic hormone-sensitive PC. In addition, the fact that ADT monotherapy has been superseded by updated guideline recommendations for combination therapy will complicate future assessments of AEs mediated by GnRH agonists and antagonists as androgen receptor inhibitors are also associated with AEs that can overlap with those associated with ADT, including MACEs [ 1 23 CVM 21 Conclusion The results from this analysis represent a large European patient population with PC treated with the GnRH agonist leuprorelin in real-world clinical practice. While CV monitoring should be a standard part of care for such patients, the results demonstrate that GnRH agonist-based ADT has an acceptable safety profile, with low incidence of CV events. Previous efficacy findings from randomized clinical studies were confirmed without any new safety concerns. Acknowledgments Project implementation, quality review, data management, continuous pharmacovigilance operations, and statistical analysis were performed by Institut Dr. Schauerte, Germany, funded by Hexal AG/Sandoz. The authors thank Dan Hami of Titan, OPEN Health Communications, for medical writing support and editorial assistance, funded by Sandoz in accordance with Good Publication Practice (GPP 2022) guidelines ( www.ismpp.org/gpp-2022 Statement of Ethics All patients have provided written, informed consent to participate in the study. The study protocol has been approved by the ethics committee of the scientific medical lead (Bernd J. Schmitz-Dräger), that is, the ethics committee of the Bavarian Chamber of Physicians, Munich, Germany (Committee Number 13108), and subsequently by the ethics committees of all study sites, as noted on the German Clinical Trial website ( https://drks.de/search/en/trial/DRKS00005643 14 Conflict of Interest Statement Bernd J. Schmitz-Dräger has acted as a consultant and/or trialist for and has received fees from AstraZeneca, Hexal AG, and Janssen. Ekkehardt Bismarck, Thomas Ebert, and Stephan Mühlich are trialists for Hexal AG. Roland Starlinger and Kerstin Dienes are employees of Sandoz and Hexal AG, respectively. Bertram Ottillinger has acted as a consultant for and has received fees from Hexal AG. Peter J. Goebell has participated in advisory boards for and received honorary fees and/or travel support from Apogepha, Astellas, AstraZeneca, Bayer, Bristol Myers Squibb, Eisai, EUSA, iOMEDICO, Ipsen, Janssen, Merck, MSD, Novartis, Pfizer, Roche, and Sanofi. Bernd J. Schmitz-Dräger and Oliver W. Hakenberg were members of the journal’s Editorial Board at the time of submission. Natalya Benderska-Söder and Jutta Bergler-Klein have no conflicts of interest to declare. Funding Sources This study was funded by Sandoz. Author Contributions B.J.S.-D. and B.O. were responsible for study conceptualization. B.J.S.-D., E.B., T.E., and S.M. were principal investigators and collected data. B.O. performed the statistics workup. B.J.S.-D., R.S., B.O., and N.B.-S. performed the data analysis and wrote the original manuscript draft. E.B., T.E., K.D., P.J.G., S.M., J.B.-K., and O.W.H. reviewed and edited the manuscript. All authors approved the final version of the manuscript. Data Availability Statement All data utilized in this analysis are included in this article and its online supplementary material files. Further inquiries for the LEAN study can be directed to the corresponding author. Supplementary Material References 1. Cornford P Bellmunt J Bolla M Briers E De Santis M Gross T EAU-ESTRO-SIOG Guidelines on Prostate Cancer. Part II: treatment of relapsing, metastatic, and castration-resistant prostate cancer Eur Urol 2017 71 4 630 42 27591931 10.1016/j.eururo.2016.08.002 2. Leitlinienprogramm Onkologie [Internet]. S3-Leitlinie prostatakarzinom version 6.2. [cited 2024 Mar 19]. Available from: https://www.leitlinienprogramm-onkologie.de/fileadmin/user_upload/Downloads/Leitlinien/Prostatatkarzinom/Version_6/LL_Prostatakarzinom_Langversion_6.2.pdf 3. Schaeffer EM Srinivas S Adra N An Y Barocas D Bitting R NCCN Guidelines ® J Natl Compr Canc Netw 2022 20 12 1288 98 36509074 10.6004/jnccn.2022.0063 4. European Assocation of Urology [Internet] Eau - EANM - ESTRO - ESUR - ISUP - SIOG guidelines on prostate cancer https://d56bochluxqnz.cloudfront.net/documents/full-guideline/EAU-EANM-ESTRO-ESUR-ISUP-SIOG-Guidelines-on-Prostate-Cancer-2023_2023-06-13-141145.pdf 5. Zhao J Zhu S Sun L Meng F Zhao L Zhao Y Androgen deprivation therapy for prostate cancer is associated with cardiovascular morbidity and mortality: a meta-analysis of population-based observational studies PLoS One 2014 9 9 e107516 25264674 10.1371/journal.pone.0107516 PMC4180271 6. Ng CF Chiu PKF Yee CH Lau BSY Leung SCH Teoh JYC Effect of androgen deprivation therapy on cardiovascular function in Chinese patients with advanced prostate cancer: a prospective cohort study Sci Rep 2020 10 1 18060 33093594 10.1038/s41598-020-75139-w PMC7582924 7. US Food and Drug Administration [Internet] FDA Drug Safety Communication: update to ongoing safety review of GnRH agonists and notification to manufacturers of GnRH agonists to add new safety information to labeling regarding increased risk of diabetes and certain cardiovascular diseases https://www.fda.gov/drugs/drug-safety-and-availability/fda-drug-safety-communication-update-ongoing-safety-review-gnrh-agonists-and-notification 8. Lopes RD Higano CS Slovin SF Nelson AJ Bigelow R Sørensen PS Cardiovascular safety of degarelix versus leuprolide in patients with prostate cancer: the primary results of the PRONOUNCE randomized trial Circulation 2021 144 16 1295 307 34459214 10.1161/CIRCULATIONAHA.121.056810 PMC9004319 9. Zengerling F Jakob JJ Schmidt S Meerpohl JJ Blümle A Schmucker C Degarelix for treating advanced hormone-sensitive prostate cancer Cochrane Database Syst Rev 2021 8 8 CD012548 34350976 10.1002/14651858.CD012548.pub2 PMC8407409 10. Klotz L Van Komen S Dragnic S White WB Impact of androgen deprivation therapy on cardiovascular outcomes in prostate cancer Société Internationale d'Urologie Journal 2022 3 4 259 75 11. Saigal CS Gore JL Krupski TL Hanley J Schonlau M Litwin MS Androgen deprivation therapy increases cardiovascular morbidity in men with prostate cancer Cancer 2007 110 7 1493 500 17657815 10.1002/cncr.22933 12. Shore ND Saad F Cookson MS George DJ Saltzstein DR Tutrone R Oral relugolix for androgen-deprivation therapy in advanced prostate cancer N Engl J Med 2020 382 23 2187 96 32469183 10.1056/NEJMoa2004325 13. Lyon AR López-Fernández T Couch LS Asteggiano R Aznar MC Bergler-Klein J 2022 ESC guidelines on cardio-oncology developed in collaboration with the European Hematology Association (EHA), the European Society for Therapeutic Radiology and Oncology (ESTRO) and the International Cardio-Oncology Society (IC-OS) Eur Heart J 2022 43 41 4229 361 36017568 10.1093/eurheartj/ehac244 14. Schmitz-Dräger BJ Mühlich S Lange C Benderska-Söder N Bismarck E Starlinger R Effectiveness and distribution of testosterone levels within first year of androgen deprivation therapy in a real-world setting: results from the non-interventional German cohort LEAN study Urol Int 2021 105 5–6 436 45 33631760 10.1159/000513073 PMC8120659 15. US Department of Health and Human Services [Internet] National Institutes of Health National Cancer Institute. Common Terminology Criteria for Adverse Events (CTCAE). Version 4.0 [cited 2024 Mar 19]. Available from: https://evs.nci.nih.gov/ftp1/CTCAE/CTCAE_4.03/Archive/CTCAE_4.0_2009-05-29_QuickReference_8.5x11.pdf 16. Okwuosa TM Morgans A Rhee JW Reding KW Maliski S Plana JC Impact of hormonal therapies for treatment of hormone-dependent cancers (breast and prostate) on the cardiovascular system: effects and modifications: a scientific statement from the American Heart Association Circ Genom Precis Med 2021 14 3 e000082 33896190 10.1161/HCG.0000000000000082 17. Powell K Burns MC Prasad V Relugolix: five reasons why the US Food and Drug Administration should have exercised restraint Eur Urol 2023 83 2 101 2 36153246 10.1016/j.eururo.2022.08.029 18. Merola D Schneeweiss S Sreedhara SK Zabotka LE Quinto K Concato J Real-world evidence prediction of a phase IV oncology trial: comparative degarelix vs leuprolide safety JNCI Cancer Spectr 2022 6 4 pkac049 35947646 10.1093/jncics/pkac049 PMC9403105 19. Crawford ED Hafron JM Debruyne F Wallis C Chang S Garnick MB Cardiovascular risk in prostate cancer patients using luteinizing hormone-releasing hormone agonists or a gonadotropin-releasing hormone antagonist J Urol 2024 211 1 63 70 37796473 10.1097/JU.0000000000003721 20. Cicione A Nacchia A Guercio A Gravina C Franco A Grimaldi MC Cardiovascular adverse events-related to GnRH agonists and GnRH antagonists: analysis of real-life data from Eudra-Vigilance and Food and Drug Administration databases entries Prostate Cancer Prostatic Dis 2023 26 4 765 71 36641533 10.1038/s41391-022-00640-4 21. Chan JSK Lee YHA Hui JMH Liu K Dee EC Ng K Long-term cardiovascular risks of gonadotropin-releasing hormone agonists and antagonists: a population-based cohort study Clin Oncol (R Coll Radiol) 2023 35 6 e376 83 37031076 10.1016/j.clon.2023.03.014 22. Nelson AJ Lopes RD Hong H Hua K Slovin S Tan S Cardiovascular effects of GnRH antagonists compared with agonists in prostate cancer: a systematic review JACC CardioOncol 2023 5 5 613 24 37969642 10.1016/j.jaccao.2023.05.011 PMC10635880 23. Morgans AK Shore N Cope D McNatty A Moslehi J Gomella L Androgen receptor inhibitor treatments: cardiovascular adverse events and comorbidity considerations in patients with non-metastatic prostate cancer Urol Oncol 2021 39 1 52 62 32958445 10.1016/j.urolonc.2020.08.003 ",
  "metadata": {
    "Title of this paper": "Androgen receptor inhibitor treatments: cardiovascular adverse events and comorbidity considerations in patients with non-metastatic prostate cancer",
    "Journal it was published in:": "Urologia Internationalis",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490847/"
  }
}