{
  "title": "Paper_546",
  "abstract": "pmc Bioeng Transl Med Bioeng Transl Med 3332 btm BTM2 Bioengineering & Translational Medicine 2380-6761 Wiley PMC12478453 PMC12478453.1 12478453 12478453 41030282 10.1002/btm2.70029 BTM270029 1 Research Article Research Article Metabolic and proteomic signatures differentiate inflammatory phenotypes from cancer and predict treatment response in patient sera Cutshaw et al. Cutshaw Gabriel  1  2 Demidova Elena V.  3 Czyzewicz Philip III  3 Quam Elizabeth  1  2 Lorang Nicole  1  2 AL Siyabi AL Warith  1  2 Batra Surinder  4 Arora Sanjeevani  3  5  6 sanjeevani.arora@fcc.edu Bardhan Rizia https://orcid.org/0000-0002-5854-652X  1  2 rbardhan@iastate.edu   1 Department of Chemical and Biological Engineering Iowa State University Ames Iowa USA   2 Nanovaccine Institute Iowa State University Ames Iowa USA   3 Cancer Prevention and Control Program Fox Chase Cancer Center Philadelphia Pennsylvania USA   4 Department of Biochemistry and Molecular Biology University of Nebraska Medical Center Omaha Nebraska USA   5 Cancer Epigenetics Institute Fox Chase Cancer Center Philadelphia Pennsylvania USA   6 Department of Radiation Oncology Fox Chase Cancer Center Philadelphia Pennsylvania USA * Correspondence sanjeevani.arora@fcc.edu rbardhan@iastate.edu 15 5 2025 9 2025 10 5 497785 10.1002/btm2.v10.5 e70029 19 4 2025 17 1 2025 29 4 2025 15 05 2025 30 09 2025 01 10 2025 © 2025 The Author(s). Bioengineering & Translational Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Tumors shift their metabolic needs to enable uncontrolled proliferation. Therefore, metabolic assessment of cancer patient sera provides a significant opportunity to noninvasively monitor disease progression and enable mechanistic understanding of the pathways that lead to response. Here, we show Raman spectroscopy (RS), a highly sensitive and label‐free analytical tool, is effective in metabolic profiling across diverse cancer types in patient sera from both pancreatic ductal adenocarcinoma (PDAC) and locally advanced rectal cancer (LARC). We also combine metabolic data with proteomic signatures to predict treatment response. Our data show RS peaks successfully differentiate PDAC patients from healthy controls. Peaks associated with sugars, tyrosine, and DNA/RNA distinguish PDAC patients from chronic pancreatitis, an inflammatory condition that is notoriously difficult to discern from PDAC via current clinical approaches. Furthermore, our study is expanded to investigate response to chemoradiation therapy in LARC patient sera where at pre‐treatment multiple metabolites including glycine, carotenoids, and sugars are jointly correlated to the neoadjuvant rectal (NAR) score indicative of poor prognosis. Via classical univariate AUC–ROC analysis, several RS peaks were found to have an AUC>0.7, highlighting the potential of RS in identifying key metabolites for differentiating complete and poor responders of treatment. Gene set enrichment analysis revealed enrichment of metabolic, immune, and DDR‐related pathways associated with CRT response. Notably, RS‐derived metabolites were significantly correlated with multiple immune signaling proteins and DDR markers, suggesting these distinct analytes converge to reflect systemic changes within the tumor microenvironment. By integrating metabolic, proteomic, and DDR data, we identified pre‐treatment activation of galactose and glycerolipid metabolism, and post‐treatment engagement of cell cycle and p53 signaling pathways. Our findings show that RS, when integrated with complementary protein marker analysis, holds the potential to bridge the translational divide enabling a clinically relevant approach for both diagnosis and predicting response in patient samples. cancer patients DNA damage response markers metabolism pancreatic cancer Raman spectroscopy rectal cancer serum National Institutes of Health 10.13039/100000002 R01EB029756‐01A1 5UH2CA271230 4UH3CA271230 Congressionally Directed Medical Research Programs 10.13039/100000090 W81XWH‐20‐1‐0620 HT9425‐23‐1‐0840 W81XWH‐18‐1‐0148 National Cancer Institute 10.13039/100000054 P30 CA006927 Iowa State University 10.13039/100009227 Jean H. Steffenson Professorship Yale Cancer Center 10.13039/100010900 Yale Head and Neck Cancer SPORE ‐ CEP Award pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Cutshaw G Demidova EV Czyzewicz P III Metabolic and proteomic signatures differentiate inflammatory phenotypes from cancer and predict treatment response in patient sera Bioeng Transl Med 2025 10 5 e70029 10.1002/btm2.70029  Translational Impact Statement This work demonstrates the translational impact of Raman spectral‐based metabolic analysis in cancer patient sera to differentiate cancer from inflammatory diseases that present very similar symptoms and are difficult to discern in the clinic. By integrating metabolite data with protein signatures and previously characterized DDR markers of treatment response, we identified coordinated metabolic–protein networks associated with chemoradiation outcomes in rectal cancer. Our minimally invasive clinically significant approaches using patient biofluids have the potential to minimize the need for repeated invasive biopsies for clinical decisions and predict a therapeutic response early to limit issues associated with treatment failures, such as unjustified toxicities and costs. 1 INTRODUCTION Cancer cells have exquisite flexibility in rewiring their metabolic demand to support increased cell survival, differentiation, uncontrolled proliferation, and acquire treatment resistance. Tumor cells rely on core metabolic pathways such as glycolysis and the tricarboxylic acid (TCA) cycle to acquire nutrients and convert them to macromolecules and support their growth.  1  2  1  3  4  5  6  7  8  9  10  11  12  13  14  15  16  17 PDAC is a highly aggressive malignancy with a 5‐year survival rate < 10%.  18  19  20  20  21 LARC is also highly lethal, and colorectal cancers combined are the second leading cause of cancer death in the United States as of 2024.  22  23  24  25  26  27 2 RESULTS AND DISCUSSION Patient sera samples for this study were obtained from the Nebraska biobank for PDAC patients, CP patients, and control patients. We obtained n n n n  28 1 TABLE 1 LARC study patient demographics and nCRT surrogate endpoint, neoadjuvant rectal score. Neoadjuvant rectal score and nCRT response groups Average age (years) # of male patients # of female patients Complete responder (NAR = <8) 60.6 ± 11.9 22 17 Partial responder (NAR = 8–14) 58.4 ± 11.1 4 6 Poor responder (NAR = >14) 51.1 ± 16.5 37 13 Metabolic changes in patient sera were measured with RS, where dilute serum was dried on a calcium fluoride substrate and samples were excited at 785 nm using a confocal RS microscope at ~40 mW power at the point of excitation using a 50X objective with a numerical aperture of 0.50. Each measurement consisted of 20 s exposure per point, and a total of 100 points was collected for each sample with a duration of ~35 min per sample. Raman spectra were processed using a custom Matlab processing pipeline (see “Methods”). The peaks of the processed spectra were then quantified for further analysis, where each peak is associated with key metabolites in serum. Tentative peak assignment is conducted by review of well‐established literature describing both the pure Raman spectra of potential metabolite candidates,  29  30  31  32  33  34  35  7  9  36 2 TABLE 2 Tentative peak assignments for Raman spectral data, including the vibrational modes. Wavenumber (cm −1 Metabolic assignment Vibrational modes References 621 Phenylalanine C–C twisting mode  29 30 31 32 643 Proline C–C twisting mode, skeletal stretching vibration  30 31 671 DNA bases C–S stretching mode  29 30 32 701 Cholesterol Choline group, CH 2  30 33 34 719 Phosphatidylcholine (PC)/sphingomyelin Symmetric stretch vibration of choline group  30 33 34 744 Thymine (DNA base) Backbone vibrations, deformation of the ring  29 30 757 Tryptophan Symmetric breathing of tryptophan, σ  29 30 31 805 DNA/RNA C′–O–P–O–C'3 phosphodiester stretching  30 32 828 Tyrosine Out‐of‐plane ring breathing  29 30 31 852 Sugars (glucose, glycerol) C–O–C skeletal stretching  29 30 35 878 Glutamic acid COOH deformation  29 30 31 898 Glycine C–C stretching  29 30 31 938 Citric acid, Succinic acid  υ  29 957 Fatty acid C–H bending  29 33 992 Arginine C–N stretching, C–C stretching  29 31 1002 Phenylalanine Symmetric in‐plane ring breathing  29 30 31 1011 Carbohydrates C–O–C ring, C–O–H bending  29 30 35 1031 Phenylalanine C–H in‐plane bending, ring in‐plane bending  29 30 31 1051 Glucose/glycerol C–O stretching  29 35 1063 Lipids Chain C–C stretching  29 30 33 1082 Lipids Chain C–C stretching  29 30 33 1103 Mannose  σ 2  30 35 1126 Glucose C–C stretching, C–O stretching, C–O–H in‐plane bending  29 30 35 1155 Carotenoids C–C stretching, C–H stretching  29 30 34 1172 Saturated long‐chain fatty acids C–C stretching  30 33 34 1207 Amino acids NH 3  29 31 1249 Amide III Asymmetric O–P–O stretching  29 30 34 1257 Unsaturated lipids, fatty acids CH 3 2  30 33 34 1268 Unsaturated lipids, fatty acids CH 3 2  30 33 34 1314 Histidine NH3+ asymmetric rocking, C–C–H stretching  29 31 1338 Threonine C–H deformation  29 31 1448 Lipids and proteins CH 2 2 3  30 33 34 1518 Carotenoids C–C stretching and C=C stretching  29 30 34 1552 Tryptophan Indole ring stretching, C=C stretching  29 31 1575 DNA & NADH Ring breathing modes  29 30 1585 Phenylalanine C–C bending  29 30 31 1605 Phenylalanine C=O stretching, C=C in‐plane bending  29 30 31 1615 Tyrosine C=C stretching  29 30 31 1657 Unsaturated lipids, PC, phosphatidylethanolamine C=C stretching  30 33 34 1682 Amide I C=O stretching  30 Our initial goal was to leverage the high sensitivity of RS as a diagnostic approach and map the serum metabolome of patients who had PDAC or LARC and distinguish them from healthy non‐cancer controls. For this comparison, we used n n n 1a 1b 1c S1a 1d S1b −1 −1 −1 1e S1  37  38 −1 −1 −1  39  40 −1 −1 −1 −1  41  42 −1 −1  43 1d, e −1 −1  44 S1c 1f FIGURE 1 Raman spectral measurements of pancreatic ductal adenocarcinoma (PDAC) and locally advanced rectal cancer (LARC) patient sera. (a) Representative serum RS spectra for healthy, PDAC, and LARC patient samples. Representative spectra were selected from the centroid of the group's cluster from PCA. (b) Difference spectra were obtained by subtracting the healthy patient spectrum from the cancer patient spectrum. (c), (d) Volcano plots showing significance and fold change versus n n n t p p n n n t p p p p p n n n RS was then leveraged to distinguish PDAC patient samples from those with CP, a non‐cancerous inflammatory disorder that presents similar symptoms to early‐stage PDAC and is difficult to distinguish from PDAC clinically. We measured RS spectra of n 2a 2b S2 −1 −1 −1 S2  45 S3a S3b 2c −1 −1 −1 FIGURE 2 Raman spectral measurements of pancreatic ductal adenocarcinoma (PDAC) versus chronic pancreatitis (CP) patient sera. (a) Representative serum RS spectra for n n n n n n p p p p p n n n P We then interrogated if the RS metabolic peaks of PDAC and CP groups relative to the control patients would identify metabolic pathways that are enriched or suppressed in each group. We leveraged Metaboanalyst 6.0,  46 2d S1  38 Next, RS was leveraged to examine treatment response to chemoradiation therapy via serum metabolites in the LARC patient cohort. While metabolic enrichment analysis showed minimal differences comparing LARC and control patient groups (Figure S4  47 1 The difference in Raman spectra pre‐treatment between poor responders and the healthy cohort, and complete responders and healthy (Figure 3a S5a 3b S5b −1 −1 −1  48  49 −1 −1 S5b S6a, b S6c −1 −1  50 FIGURE 3 Raman spectral measurements of treatment response to chemoradiation therapy in locally advanced rectal cancer (LARC) patient sera. (a) Serum RS difference spectra for pre‐treatment LARC complete responder, and poor responder samples versus healthy patient samples. Difference spectra were obtained by subtracting the representative healthy patient spectrum from the representative LARC spectra. (b) Pearson's correlation of RS peaks against NAR score for n n n n n t p p n n n n In addition to differentiating responders from poor responders both pre‐treatment and post‐treatment, we also investigated shifts in metabolites within the responder and poor responder patient groups. Difference spectra for representative samples at each timepoint (Figure 3c 3d 3e 3f −1 −1 −1 −1 −1 −1 Next, we studied key cytokines, chemokines, and growth factors in patient sera with enzyme linked immunosorbent assay (ELISA) with the ultimate goal of finding a correlation of serum metabolites to these cytokines and chemokines. Inflammation and immunomodulation are key to DNA damage in the TME and response to chemoradiation treatment, which can be assessed with serum cytokines/chemokines.  27 n n n n n n 4a S7 S8  51  52  53  54 β −1 −1 −1 −1 β  55 β −1 −1  51  56 −1 −1  51  57  58  59  60  61 4b 4c −1 −1 −1  62 S9 FIGURE 4 Correlation of Raman metabolites to serum signaling proteins and quantification of proteins in locally advanced rectal cancer (LARC) patient sera. (a) Correlation heatmap of RS peaks to serum signaling proteins that include chemokines and cytokines. For the pre‐treatment, correlations were conducted for n n n n n n n n t p p p p p n n To further understand the relationship between metabolites and immune response in treatment outcomes of LARC, we analyzed key protein markers associated with activated DDR signaling in the lymphocytes of selected LARC patients. For comparison of DDR markers, data were available from only 41 LARC patients.  17  63  17  64 n n n n n  17 5a S10 S11 FIGURE 5 Correlation of Raman metabolites to DNA damage repair (DDR) markers and joint protein‐metabolite pathways in locally advanced rectal cancer (LARC) patient sera. (a) Correlation heatmap of DDR lymphocyte markers to RS metabolites and serum signaling proteins. For the pre‐treatment, correlations were conducted for n n n n n n n n n We also find interesting correlations of these DDR markers to cytokines and chemokines, which is discussed first, as well as to metabolites, which is discussed next. For example, MDM2 and p53 have a moderate to strong joint correlation to IL‐6 and IL‐13 pre‐treatment that significantly dampens post‐treatment. IL‐6 and IL‐13 are both associated with tumor growth, inflammation, and metastasis in colorectal cancer.  65 α β + α β  66 α β  67  68 5a  69  70  71 The DDR markers also show significant correlation to several RS metabolites. MDM2 and p53 have moderate‐to‐strong positive correlations with metabolites associated with DNA bases (671, 744 cm −1 −1  72  73 −1 −1 −1  74 −1 −1 −1 −1  75 −1 −1 −1  76  77 −1 The combined Raman metabolite data and serum cytokine and lymphocyte DDR marker data was used to assess the signaling pathways that are activated using a topology‐based approach with Metaboanalyst 6.0's joint pathway‐analysis module. Features matched to pathways can be seen in Tables S2 S3 5b 5c 5a  78  75 3 5b S12 S4 To further understand the role of various proteins in treatment response in the LARC cohort, we profiled the patient serum proteome post‐treatment for the n n  17 S13 Gene set analysis (GSEA) was performed using the online WebGestalt 2024 platform  79 6a, b S5 S6 6c p p  80 r  81  82 r  83 −1  84  85 r  86  87  88 γ β α −1 −1 −1  87 r  89  90 FIGURE 6 Serum proteomics analysis for differentiating complete and poor responders post chemoradiation treatment. (a), (b) Gene set analysis (GSEA) for signaling proteins, DNA damage markers, and label‐free serum proteomics for n n P n n 3 CONCLUSIONS In summary, this study highlights the utility of RS in metabolic profiling in both PDAC and LARC patient sera to identify metabolites as potential serum biomarkers for cancer diagnosis and prediction of response, regardless of the cancer type. Our findings show RS identified key metabolites that differentiated PDAC patients from healthy patients without cancer, as well as differentiated PDAC from chronic pancreatitis, which is notoriously difficult to discriminate through current clinical analysis. We found pathways involving lipids and FAs and those associated with AAs that distinguish cancer from inflammatory phenotypes that often present similar symptoms in patients. Whereas RS was limited in differentiating LARC from healthy patients based on serum metabolites, significant changes were observed in metabolites to predict response to chemoradiation therapy and specifically differentiate poor responders pre‐ and post‐treatment. Our findings suggest that metabolic monitoring in cancer patient sera could serve as a non‐invasive assay for predicting response to therapies and complement current clinical procedures. Our correlation analysis of signaling proteins and metabolites in LARC patient sera showed joint and inverse correlations before and after chemoradiation therapy, highlighting that a collective analysis of serum proteins and metabolites is necessary to accurately predict response and/or resistance. The integration of lymphocyte DDR markers with serum signaling proteins and metabolites demonstrated that each of these markers of response is tightly regulated and intercorrelated in the TME that effectively differentiating responders from poor responders to treatment. Further, joint metabolic‐signaling pathways indicated that pre‐treatment glucose/sugars and FAs/lipids are key metabolites that contribute to cancer progression, whereas post‐treatment p53 signaling and cell cycle regulation are essential pathways that mediate response. Our analysis also indicates that both effector and memory T cells likely play a role in enabling response to chemoradiation. Furthermore, label‐free proteomics of LARC post‐treatment samples identified several key markers of cancer progression and immune infiltration, demonstrating the importance of immune‐mediated response in LARC patient treatment. Through this study, we anticipate that an integrated metabolic‐protein analysis may be leveraged in resource‐limited settings, as affordable portable Raman spectrometers are now commercially available, and label‐free Raman measurements require minimal sample preparation and a mere 5 μL of sample volume. We note that this work has some limitations, as samples for our study were received from academic biobanks that continuously bank patient biofluids for research and/or education purposes. Patients were not specifically recruited for the purposes of this work. Our aim was to demonstrate the strengths of Raman spectral metabolic profiling combined with analysis of protein signatures to enable a powerful predictive tool of treatment response that will identify early which patients are to benefit from standard of care therapies. We expect that a future focused study with a larger cohort of patient samples will improve these findings. 4 MATERIALS AND METHODS 4.1 Healthy, PDAC CP Samples for the healthy, pancreatic ductal adenocarcinoma (PDAC), and CP groups were obtained from the Nebraska Biobank. Samples were collected under consent for research and deidentified to remove all identifiable information. As the Nebraska Biobank continuously recruits participants, the patients were not specifically recruited for this study. Blood was collected in serum separating tubes. The Nebraska biobank is an open resource for investigators and is not associated with an IRB. 4.2  LARC The patient samples analyzed in this study (serum) were obtained from the FCCC Biosample Repository Facility (BRF) under IRB 22‐9925 and available data from https://doi.org/10.1101/2024.11.22.24317789 2 2 4.3 Patient sample preparation Anonymized samples (0.1–1 mL patient sera) were received frozen at Iowa State University and stored at −80°C prior to aliquoting. Samples were thawed and aliquoted. Excess aliquots were flash frozen in liquid nitrogen for storage at −80°C, while samples for Raman imaging were immediately prepared. Patient sera were mixed in a 1:1 ratio with milli‐ q 2 4.4 Patient sample Raman spectral acquisition RS measurements were conducted with a Renishaw inVia confocal RS microscope, using a ×50 Leica focus with a numerical aperture of 0.50. Each measurement consisted of two 10 s accumulations for a total of 20 s exposure. 10 line maps of 10 points each were collected for a total of 100 points, with a total duration of approximately 35 min per sample. Raman spectra were processed using a custom Matlab processing pipeline, consisting of cosmic ray correction, Savitzky–Golay filtering with a 5th‐order polynomial and a frame‐width of 17, and fluorescence background correction using a modified polyfit method with a 9th‐order polynomial. The processed spectra were normalized using the standard variate method (mean–variance normalization) and were then subjected to ratiometric analysis using the 1447 cm −1 4.5 Patient serum signaling proteins analysis Serum was isolated from whole blood using standard protocols and frozen at −80°C until examination. Circulating cytokines and growth factors were evaluated using the Bio‐Plex Pro™ Human Cytokine 27‐plex Assay: #M500KCAF0Y and the Bio‐Plex Pro™ Human Cytokine 17‐plex Assay: #M5000031YV (Bio‐Rad, Hercules, CA). The assays were performed according to the manufacturer's instructions. BioPlex Manager 6.0 software was used for data analysis. 4.6  DDR DNA damage repair marker data from LARC patients is available from our prior work for the following protein analytes: total ATR, Chk1S345, Chk2T68, γ  17  17 4.7  LC MS Patient serum samples were diluted in 50 mM ammonium carbonate buffer (Fisher Scientific) pH corrected to pH 8 with 1 N HCl (Fisher Scientific) and protein concentrations were measured in technical duplicates with a BCA assay kit (Invitrogen) using a SpectraMax iD3 microplate reader at 562 nm. Using the assessed concentration, serum samples were diluted to a concentration of 1 μg/μL and submitted to the Protein Facility of the Iowa State University Office of Biotechnology. The samples were reduced with dithiothreitol (DTT), cysteine groups were modified with iodoacetamide, and were then digested overnight with trypsin and endoproteinase Lys‐C. Digestion was halted with the addition of formic acid, and the samples were dried down in a SpeedVac. The samples were then desalted using C18 columns (Nest Group BioPureSPN Mini, HUM S18V) and were redried in a SpeedVac. PRTC standard (Pierce part #88320) was spiked into the sample to serve as an internal control. The peptides were then separated by liquid chromatography using a Thermo Scientific TM Vanquish NEO coupled with an Easy‐Spray source. The separated peptides were then analyzed through MS/MS by fragmenting each peptide. The resulting intact and fragmentation pattern was compared to a theoretical fragmentation pattern to find peptides that can be used to identify the proteins. The PRTC areas were used to normalize the data between samples. To identify proteins, Proteome Discoverer 3.2 was used with the CHIMERYS algorithm. 4.8 Statistical analysis methods All quantifications of error and error bars presented indicate one standard deviation. For quantification of RS peak analysis, unpaired, two‐sided, homoscedastic student's t p p p p p p 4.9 Metaboanalyst 6.0 MetaboAnalyst 6.0, a web platform for the analysis of metabolic and related ‘omics data, was used to perform quantitative enrichment analysis and joint pathway analysis. Quantitative enrichment analysis and joint pathway analysis were performed using the KEGG pathway database. Here, the intensity of the Raman peaks for the assigned metabolite was used as a “proxy” for metabolite concentrations to uncover the metabolic pathways. This proxy was used as the Raman peak intensity is linearly correlated to the concentration of measured analytes in sera based on our previous validation work. Joint pathway analysis used closeness centrality and pooled queries for the identification of both impacted genetic and metabolic pathways. 4.10  WebGestalt GSEA WebGestalt 2024, a web platform for the analysis of genomic, proteomic, and related ‘omics data, was used to perform ontology and GSEA for pooled protein marker and proteomics data. The GSEA rank metric was calculated with the formula below: GSEA rank metric = − log 10 p × SIGN log 2 FC p p t AUTHOR CONTRIBUTIONS RB conceived the project idea, directed the study design, and edited the manuscript. GC trained EQ, NL, and AA, performed Raman measurements, data analysis, data interpretation, and wrote the manuscript. EVD and PC performed Luminex‐based ELISA assays for inflammatory and DDR‐related markers, data analysis, and assisted with data management. EQ aided in data analysis and assisted in Raman measurements. NL and AA assisted in Raman measurements. SB provided insight on PDAC and provided anonymized biobank samples. SA provided insight and data interpretation on LARC, provided study samples and data from LARC patients, and edited the manuscript. CONFLICT OF INTEREST STATEMENT Author S.A. has the following disclosures: S.A. performs collaborative research (with no funding) with Caris Life Sciences. S.A.'s spouse is employed by Akoya Biosciences and has stocks in Akoya Biosciences, and Senzo Health. S.A. has several patents related to cancer diagnostics/treatment. These disclosures do not conflict with the present study. The other authors declare no conflict of interest. Supporting information  Data S1: ACKNOWLEDGMENTS We acknowledge Eugene C. Lin (Department of Chemistry and Biochemistry, National Chung Cheng University, Chiayi 62106, Taiwan) for assistance in providing data processing files. We acknowledge Ratul Chowdhury (Department of Chemical and Biological Engineering, Iowa State University, Ames, IA 50011, USA) for advice in joint pathway analysis approaches. We acknowledge Joel Nott (Office of Biotechnology, Iowa State University, Ames, IA 50011, USA) for advice in serum proteomics approaches. GC acknowledges support from the National Institutes of Health (NIH) award R01EB029756‐01A1. RB acknowledges support from the Jean H. Steffenson Professorship, NIH R01EB029756‐01A1, and CDMRP congressionally directed medical research program (CDMRP) award W81XWH‐20‐1‐0620. The Fox Chase Cancer Center (FCCC) Biosample Repository Facility and the High Throughput Screening Facility provided resources and expertise. All Fox Chase Cancer Center affiliated authors and core facilities are in part supported by the NCI Core Grant, P30 CA006927, to the FCCC. S.A. was supported by grants from the CDMRP DOD HT9425‐23‐1‐0840, CDMRP DOD W81XWH‐18–1‐0148, CEP Award from the Yale Head and Neck Cancer SPORE, NIH 5UH2CA271230 and 4UH3CA271230. P.C. was supported by grants from the NIH 5UH2CA271230 (to S.A.) and 4UH3CA271230 (to S.A.). The FCCC Institutional Review Board Committee provided study oversight and approval (protocol number 22‐9925). We acknowledge Drs. Joshua E. Meyer and Adria Hasan at FCCC for their valuable assistance with this study. Open access funding provided by the Iowa State University Library. DATA AVAILABILITY STATEMENT The data that support the findings of this study are available from the corresponding author upon reasonable request. REFERENCES 1 Faubert B Solmonson A DeBerardinis RJ Metabolic reprogramming and cancer progression Science 2020 368 6487 eaaw5473 32273439 10.1126/science.aaw5473 PMC7227780 2 Pavlova Natalya N Thompson CB The emerging hallmarks of cancer metabolism Cell Metab 2016 23 1 27 47 26771115 10.1016/j.cmet.2015.12.006 PMC4715268 3 Hanahan D Weinberg RA Hallmarks of cancer: the next generation Cell 2011 144 5 646 674 21376230 10.1016/j.cell.2011.02.013 4 Chan AW Gill RS Schiller D Sawyer MB Potential role of metabolomics in diagnosis and surveillance of gastric cancer World J Gastroenterol 2014 20 36 12874 12882 25278684 10.3748/wjg.v20.i36.12874 PMC4177469 5 Schmidt DR Patel R Kirsch DG Lewis CA Vander Heiden MG Locasale JW Metabolomics in cancer research and emerging applications in clinical oncology CA Cancer J Clin 2021 71 4 333 358 33982817 10.3322/caac.21670 PMC8298088 6 Cutshaw G Uthaman S Hassan N Kothadiya S Wen X Bardhan R The emerging role of Raman spectroscopy as an omics approach for metabolic profiling and biomarker detection toward precision medicine Chem Rev 2023 123 13 8297 8346 37318957 10.1021/acs.chemrev.2c00897 PMC10626597 7 Ghazvini S Uthaman S Synan L Predicting the onset of preeclampsia by longitudinal monitoring of metabolic changes throughout pregnancy with Raman spectroscopy Bioeng Transl Med 2024 9 1 e10595 38193120 10.1002/btm2.10595 PMC10771567 8 Huang X Liu B Guo S SERS spectroscopy with machine learning to analyze human plasma derived sEVs for coronary artery disease diagnosis and prognosis Bioeng Transl Med 2023 8 2 e10420 36925713 10.1002/btm2.10420 PMC10013764 9 Mathew AP Cutshaw G Appel O Diagnosis of pregnancy disorder in the first‐trimester patient plasma with Raman spectroscopy and protein analysis Bioeng Transl Med 2024 9 e10691 39545096 10.1002/btm2.10691 PMC11558203 10 Wen X Ou Y‐C Zarick HF PRADA: portable reusable accurate diagnostics with nanostar antennas for multiplexed biomarker screening Bioeng Transl Med 2020 5 3 e10165 33005736 10.1002/btm2.10165 PMC7510456 11 Li H Wang S Zeng Q Serum Raman spectroscopy combined with multiple classification models for rapid diagnosis of breast cancer Photodiagnosis Photodyn Ther 2022 40 103115 36096439 10.1016/j.pdpdt.2022.103115 12 Cutshaw G Hassan N Uthaman S Monitoring metabolic changes in response to chemotherapies in cancer with Raman spectroscopy and metabolomics Anal Chem 2023 95 35 13172 13184 37605298 10.1021/acs.analchem.3c02073 PMC10845238 13 Kothadiya S Cutshaw G Uthaman S Cisplatin‐induced metabolic responses measured with Raman spectroscopy in cancer cells, spheroids, and canine‐derived organoids ACS Appl Mater Interfaces 2024 16 38 50267 50281 39284013 10.1021/acsami.4c08629 14 Doran CE Frank CB McGrath S Packer RA Use of handheld Raman spectroscopy for intraoperative differentiation of normal brain tissue from intracranial neoplasms in dogs Front Vet Sci 2022 8 819200 35155651 10.3389/fvets.2021.819200 PMC8825786 15 Kirkby CJ Gala de Pablo J Tinkler‐Hundal E Wood HM Evans SD West NP Developing a Raman spectroscopy‐based tool to stratify patient response to pre‐operative radiotherapy in rectal cancer Analyst 2021 146 2 581 589 33179632 10.1039/d0an01803a 16 Milligan K van Nest SJ Deng X Raman spectroscopy and supervised learning as a potential tool to identify high‐dose‐rate‐brachytherapy induced biochemical profiles of prostate cancer J Biophotonics 2022 15 11 e202200121 35908273 10.1002/jbio.202200121 17 Demidova EV Czyzewicz P Hasan A Optimizing and validating systemic DNA damage response profiling to predict neoadjuvant chemoradiation response in rectal cancer 2024 18 Halbrook CJ Lyssiotis CA di Pasca Magliano M Maitra A Pancreatic cancer: advances and challenges Cell 2023 186 8 1729 1754 37059070 10.1016/j.cell.2023.02.014 PMC10182830 19 Lao IH Chao H Wang YJ Computed tomography has low sensitivity for the diagnosis of early colon cancer Colorectal Dis 2013 15 7 807 811 23350992 10.1111/codi.12140 20 Carmicheal J Patel A Dalal V Elevating pancreatic cystic lesion stratification: current and future pancreatic cancer biomarker(s) BBA Rev Cancer 2020 1873 1 188318 10.1016/j.bbcan.2019.188318 PMC6980327 31676330 21 Wu Y Seufert I Al‐Shaheri FN DNA‐methylation signature accurately differentiates pancreatic cancer from chronic pancreatitis in tissue and plasma Gut 2023 72 12 2344 2353 37709492 10.1136/gutjnl-2023-330155 PMC10715533 22 National Cancer Institute Cancer Stat Facts: Colorectal Cancer 2024 https://seer.cancer.gov/statfacts/html/colorect.html 23 Feeney G Sehgal R Sheehan M Neoadjuvant radiotherapy for rectal cancer management World J Gastroenterol 2019 25 33 4850 4869 31543678 10.3748/wjg.v25.i33.4850 PMC6737323 24 Jia H Shen X Guan Y Predicting the pathological response to neoadjuvant chemoradiation using untargeted metabolomics in locally advanced rectal cancer Radiother Oncol 2018 128 3 548 556 30041962 10.1016/j.radonc.2018.06.022 25 George TJ Jr Allegra CJ Yothers G Neoadjuvant rectal (NAR) score: a new surrogate endpoint in rectal cancer clinical trials Curr Colorectal Cancer Rep 2015 11 5 275 280 26321890 10.1007/s11888-015-0285-2 PMC4550644 26 Huang R‐X Zhou P‐K DNA damage response signaling pathways and targets for radiotherapy sensitization in cancer Signal Transduct Target Ther 2020 5 1 60 32355263 10.1038/s41392-020-0150-x PMC7192953 27 McKelvey KJ Hudson AL Back M Eade T Diakos CI Radiation, inflammation and the immune response in cancer Mamm Genome 2018 29 11–12 843 865 30178305 10.1007/s00335-018-9777-0 PMC6267675 28 Tonack S Jenkinson C Cox T iTRAQ reveals candidate pancreatic cancer serum biomarkers: influence of obstructive jaundice on their performance Br J Cancer 2013 108 9 1846 1853 23579209 10.1038/bjc.2013.150 PMC3658525 29 de Gelder J de Gussem K Vandenabeele P Moens L Reference database of Raman spectra of biological molecules J Raman Spectrosc 2007 38 9 1133 1147 30 Movasaghi Z Rehman S Rehman IU Raman spectroscopy of biological tissues Appl Spectrosc Rev 2007 42 5 493 541 31 Zhu G Zhu X Fan Q Wan X Raman spectra of amino acids and their aqueous solutions Spectrochim Acta A 2011 78 3 1187 1195 10.1016/j.saa.2010.12.079 21242101 32 Notingher I Green C Dyer C Discrimination between ricin and sulphur mustard toxicity in vitro using Raman spectroscopy J R Soc Interface 2004 1 1 79 90 16849154 10.1098/rsif.2004.0008 PMC1618929 33 Czamara K Majzner K Pacia MZ Kochan K Kaczor A Baranska M Raman spectroscopy of lipids: a review J Raman Spectrosc 2015 46 1 4 20 34 Ricciardi A Piuri G Porta MD Raman spectroscopy characterization of the major classes of plasma lipoproteins Vib Spectrosc 2020 109 103073 35 Wiercigroch E Szafraniec E Czamara K Raman and infrared spectroscopy of carbohydrates: a review Spectrochim Acta A 2017 185 317 335 10.1016/j.saa.2017.05.045 28599236 36 Synan L Ghazvini S Uthaman S First trimester prediction of preterm birth in patient plasma with machine‐learning‐guided Raman spectroscopy and metabolomics ACS Appl Mater Interfaces 2023 15 32 38185 38200 37549133 10.1021/acsami.3c04260 PMC10625673 37 Liao W‐C Chen P‐R Huang C‐C Relationship between pancreatic cancer‐associated diabetes and cachexia J Cachexia, Sarcopenia Muscle 2020 11 4 899 908 32100478 10.1002/jcsm.12553 PMC7432579 38 Ogunleye AO Nimmakayala RK Batra SK Ponnusamy MP Metabolic rewiring and stemness: a critical attribute of pancreatic cancer progression Stem Cells 2023 41 5 417 430 36869789 10.1093/stmcls/sxad017 PMC10183971 39 Qin C Yang G Yang J Metabolism of pancreatic cancer: paving the way to better anticancer strategies Mol Cancer 2020 19 1 50 32122374 10.1186/s12943-020-01169-7 PMC7053123 40 Yin X Xu R Song J Lipid metabolism in pancreatic cancer: emerging roles and potential targets Cancer Commun 2022 42 12 1234 1256 10.1002/cac2.12360 PMC9759769 36107801 41 Lieu EL Nguyen T Rhyne S Kim J Amino acids in cancer Exp Mol Med 2020 52 1 15 30 31980738 10.1038/s12276-020-0375-3 PMC7000687 42 Chen J Cui L Lu S Xu S Amino acid metabolism in tumor biology and therapy Cell Death Dis 2024 15 1 42 38218942 10.1038/s41419-024-06435-w PMC10787762 43 Fujii R Tsuboi Y Maeda K Ishihara Y Suzuki K Analysis of repeated measurements of serum carotenoid levels and all‐cause and cause‐specific mortality in Japan JAMA Netw Open 2021 4 6 e2113369 34115126 10.1001/jamanetworkopen.2021.13369 PMC8196342 44 Wu J Wu M Wu Q Identification of potential metabolite markers for colon cancer and rectal cancer using serum metabolomics J Clin Lab Anal 2020 34 8 e23333 32281150 10.1002/jcla.23333 PMC7439421 45 Adam MG Beyer G Christiansen N Identification and validation of a multivariable prediction model based on blood plasma and serum metabolomics for the distinction of chronic pancreatitis subjects from non‐pancreas disease control subjects Gut 2021 70 11 2150 2158 33541865 10.1136/gutjnl-2020-320723 PMC8515121 46 Pang Z Lu Y Zhou G MetaboAnalyst 6.0: towards a unified platform for metabolomics data processing, analysis and interpretation Nucleic Acids Res 2024 52 W1 W398 w406 38587201 10.1093/nar/gkae253 PMC11223798 47 Glynne‐Jones R Glynne‐Jones S The concept and use of the neoadjuvant rectal score as a composite endpoint in rectal cancer Lancet Oncol 2021 22 7 e314‐e326 34048686 10.1016/S1470-2045(21)00053-X 48 Murtaugh MA Ma K‐n Benson J Curtin K Caan B Slattery ML Antioxidants, carotenoids, and risk of rectal cancer Am J Epidemiol 2004 159 1 32 41 14693657 10.1093/aje/kwh013 49 Redalen KR Sitter B Bathen TF High tumor glycine concentration is an adverse prognostic factor in locally advanced rectal cancer Radiother Oncol 2016 118 2 393 398 26705680 10.1016/j.radonc.2015.11.031 50 Oh S Mai XL Kim J de Guzman ACV Lee JY Park S Glycerol 3‐phosphate dehydrogenases (1 and 2) in cancer and other diseases Exp Mol Med 2024 56 5 1066 1079 38689091 10.1038/s12276-024-01222-1 PMC11148179 51 Li J Huang L Zhao H Yan Y Lu J The role of interleukins in colorectal cancer Int J Biol Sci 2020 16 13 2323 2339 32760201 10.7150/ijbs.46651 PMC7378639 52 Yan C Huang W‐Y Boudreau J Mayavannan A Cheng Z Wang J IL‐17R deletion predicts high‐grade colorectal cancer and poor clinical outcomes Int J Cancer 2019 145 2 548 558 30628053 10.1002/ijc.32122 53 Voboril R Weberova‐Voborilova J Sensitization of colorectal cancer cells to irradiation by IL‐4 and IL‐10 is associated with inhibition of NF‐kappaB Neoplasma 2007 54 6 495 502 17949233 54 Liu H Zhang Z Zhen P Zhou M High expression of VSTM2L induced resistance to chemoradiotherapy in rectal cancer through downstream IL‐4 signaling J Immunol Res 2021 2021 6657012 33506057 10.1155/2021/6657012 PMC7811563 55 Chen LC Wang LJ Tsang NM Tumour inflammasome‐derived IL‐1β recruits neutrophils and improves local recurrence‐free survival in EBV‐induced nasopharyngeal carcinoma EMBO mol Med 2012 4 12 1276 1293 23065753 10.1002/emmm.201201569 PMC3531603 56 Buijsen J van Stiphout RG Menheere PPCA Lammering G Lambin P Blood biomarkers are helpful in the prediction of response to chemoradiation in rectal cancer: a prospective, hypothesis driven study on patients with locally advanced rectal cancer Radiother Oncol 2014 111 2 237 242 24746569 10.1016/j.radonc.2014.03.006 57 Yasuda K Nirei T Tsuno NH Nagawa H Kitayama J Intratumoral injection of interleukin‐2 augments the local and abscopal effects of radiotherapy in murine rectal cancer Cancer Sci 2011 102 7 1257 1263 21443690 10.1111/j.1349-7006.2011.01940.x 58 Hernandez R Põder J LaPorte KM Malek TR Engineering IL‐2 for immunotherapy of autoimmunity and cancer Nat Rev Immunol 2022 22 10 614 628 35217787 10.1038/s41577-022-00680-w 59 Albaugh VL Pinzon‐Guzman C Barbul A Arginine‐dual roles as an onconutrient and immunonutrient J Surg Oncol 2017 115 3 273 280 27861915 10.1002/jso.24490 PMC6486789 60 Zhang W Borcherding N Kolb R IL‐1 signaling in tumor microenvironment Birbrair A Tumor Microenvironment: the Role of Interleukins—Part A Springer International Publishing 2020 1 23 61 Heeran AB Dunne MR Morrissey ME The protein Secretome is altered in rectal cancer tissue compared to normal rectal tissue, and alterations in the secretome induce enhanced innate immune responses Cancers 2021 13 3 571 33540635 10.3390/cancers13030571 PMC7867296 62 Kim T‐D Li G Song K‐S Radiation‐induced thymidine phosphorylase upregulation in rectal cancer is mediated by tumor‐associated macrophages by monocyte chemoattractant protein‐1 from cancer cells Int J Radiat Oncol 2009 73 3 853 860 10.1016/j.ijrobp.2008.07.068 19215821 63 Tong J Song J Zhang W When DNA‐damage responses meet innate and adaptive immunity Cell Mol Life Sci 2024 81 1 185 38630271 10.1007/s00018-024-05214-2 PMC11023972 64 Ciccia A Elledge SJ The DNA damage response: making it safe to play with knives Mol Cell 2010 40 2 179 204 20965415 10.1016/j.molcel.2010.09.019 PMC2988877 65 Maryam S Krukiewicz K Haq IU Khan AA Yahya G Cavalu S Interleukins (cytokines) as biomarkers in colorectal cancer: progression, detection, and monitoring J Clin Med 2023 12 9 3127 37176567 10.3390/jcm12093127 PMC10179696 66 Castellino F Huang AY Altan‐Bonnet G Stoll S Scheinecker C Germain RN Chemokines enhance immunity by guiding naive CD8+ T cells to sites of CD4+ T cell–dendritic cell interaction Nature 2006 440 7086 890 895 16612374 10.1038/nature04651 67 Madapura HS Salamon D Wiman KG Lain S Klein E Nagy N cMyc‐p53 feedback mechanism regulates the dynamics of T lymphocytes in the immune response Cell Cycle 2016 15 9 1267 1275 26985633 10.1080/15384101.2016.1160975 PMC4889243 68 Johnnidis JB Muroyama Y Ngiow SF Inhibitory signaling sustains a distinct early memory CD8(+) T cell precursor that is resistant to DNA damage Sci Immunol 2021 6 55 eabe3702 33452106 10.1126/sciimmunol.abe3702 PMC8258400 69 Ando M Ito M Srirat T Kondo T Yoshimura A Memory T cell, exhaustion, and tumor immunity Immunol Med 2020 43 1 1 9 31822213 10.1080/25785826.2019.1698261 70 Davari K Frankenberger S Schmidt A Tomi NS Jungnickel B Checkpoint kinase 2 is required for efficient immunoglobulin diversification Cell Cycle 2014 13 23 3659 3669 25483076 10.4161/15384101.2014.964112 PMC4614315 71 Sun X Liu M Bai J ATR kinase activity promotes antibody class switch recombination in B cells through cell cycle regulation without suppressing DSB resection and microhomology usage J Leukoc Biol 2021 110 6 1101 1112 33884660 10.1002/JLB.2MA0321-064R 72 Helleday T Rudd SG Targeting the DNA damage response and repair in cancer through nucleotide metabolism Mol Oncol 2022 16 21 3792 3810 35583750 10.1002/1878-0261.13227 PMC9627788 73 Navas LE Carnero A NAD(+) metabolism, stemness, the immune response, and cancer Signal Transduct Target Ther 2021 6 1 2 33384409 10.1038/s41392-020-00354-w PMC7775471 74 Oberholtzer N Quinn KM Chakraborty P Mehrotra S New developments in T cell immunometabolism and implications for cancer immunotherapy Cells 2022 11 4 708 35203357 10.3390/cells11040708 PMC8870179 75 MacIver NJ Michalek RD Rathmell JC Metabolic regulation of T lymphocytes Annu Rev Immunol 2013 31 259 283 23298210 10.1146/annurev-immunol-032712-095956 PMC3606674 76 Zeng L Wu G‐Z Goh KJ Saturated fatty acids modulate cell response to DNA damage: implication for their role in tumorigenesis PLoS One 2008 3 6 e2329 18523653 10.1371/journal.pone.0002329 PMC2402972 77 Lochner M Berod L Sparwasser T Fatty acid metabolism in the regulation of T cell function Trends Immunol 2015 36 2 81 91 25592731 10.1016/j.it.2014.12.005 78 Villarino AV Transcriptional programing of T cell metabolism by STAT family transcription factors Eur J Immunol 2023 53 6 2048825 10.1002/eji.202048825 37009861 79 Elizarraras JM Liao Y Shi Z Zhu Q Pico Alexander R Zhang B WebGestalt 2024: faster gene set analysis and new support for metabolomics and multi‐omics Nucleic Acids Res 2024 52 W1 W415 W421 38808672 10.1093/nar/gkae456 PMC11223849 80 L'Heureux A Wieland DR Weng CH Association between thyroid disorders and colorectal cancer risk in adult patients in Taiwan JAMA Netw Open 2019 2 5 e193755 31099862 10.1001/jamanetworkopen.2019.3755 PMC6537921 81 Liu B‐X Huang G‐J Cheng H‐B Comprehensive analysis of Core genes and potential mechanisms in rectal cancer J Comput Biol 2019 26 11 1262 1277 31211595 10.1089/cmb.2019.0073 82 Zhao ZW Fan XX Yang LL The identification of a common different gene expression signature in patients with colorectal cancer Math Biosci Eng 2019 16 4 2942 2958 31137244 10.3934/mbe.2019145 83 Ma L Yang F Guo W Tang S Ling Y Prognostic role of platelet‐to‐lymphocyte ratio in patients with rectal cancer undergoing resection: a systematic review and meta‐analysis Front Oncol 2024 14 1415443 39403327 10.3389/fonc.2024.1415443 PMC11471449 84 Sá OM Lopes NN Alves MT Caran EM Effects of glycine on collagen, PDGF, and EGF expression in model of oral mucositis Nutrients 2018 10 10 1485 10.3390/nu10101485 30322002 PMC6213743 85 Schemmer P Zhong Z Galli U Glycine reduces platelet aggregation Amino Acids 2013 44 3 925 931 23135224 10.1007/s00726-012-1422-8 PMC4167623 86 Casal JI Bartolomé RA Beyond N‐cadherin, relevance of cadherins 5, 6 and 17 in cancer progression and metastasis Int J Mol Sci 2019 20 13 3373 10.3390/ijms20133373 31324051 PMC6651558 87 Le Guelte A Dwyer J Gavard J Jumping the barrier: VE‐cadherin, VEGF and other angiogenic modifiers in cancer Biol Cell 2011 103 12 593 605 22054419 10.1042/BC20110069 88 Zhao Y Li J Ting KK The VE‐cadherin/ β Cancer Lett 2021 496 1 15 32991950 10.1016/j.canlet.2020.09.026 89 Guo Q Gao X Li J High expression of PCOLCE gene indicate poor prognosis in patients and are associated with immune infiltration in glioma Sci Rep 2023 13 1 3820 36882457 10.1038/s41598-023-30413-5 PMC9992371 90 Xiang A Lin X Xu L Chen H Guo J Zhou F PCOLCE is potent prognostic biomarker and associates with immune infiltration in gastric cancer Front Mol Biosci 2020 7 544895 33392251 10.3389/fmolb.2020.544895 PMC7775582 ",
  "metadata": {
    "Title of this paper": "PCOLCE is potent prognostic biomarker and associates with immune infiltration in gastric cancer",
    "Journal it was published in:": "Bioengineering & Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478453/"
  }
}