{
  "title": "Paper_120",
  "abstract": "pmc Front Oral Health Front Oral Health 4145 froh Front. Oral Health Frontiers in Oral Health 2673-4842 Frontiers Media SA PMC12490535 PMC12490535.1 12490535 12490535 10.3389/froh.2025.1689517 1 Editorial Editorial: Impact of family health and habits on children's oral health Baghdadi Ziad D. * Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Software Supervision Validation Visualization Writing – original draft Writing – review & editing Department of Preventive Dental Sciences and Centre for Community Oral Health, University of Manitoba Winnipeg MB Canada * Correspondence: ziadbaghdadi@hotmail.com ziadeddin.albaghdadi@umanitoba.ca 11 9 2025 15 9 2025 2025 6 480897 1689517 20 8 2025 28 8 2025 11 09 2025 03 10 2025 03 10 2025 © 2025 Baghdadi. 2025 Baghdadi https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) maternal health maternal habits child's oral health maternal nutrition maternal oral hygiene preventive dentistry pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Preventive Dentistry Editorial on the Research Topic Impact of family health and habits on children's oral health A complex interplay of biological, behavioral, and environmental factors shapes the oral health of children. At the center of this nexus lies the family—a child's first source of care, habits, and health behaviors. This Research Topic, Impact of Family Health and Habits on Children's Oral Health, brings together diverse investigations that collectively underscore the central role of the family unit in either mitigating or exacerbating oral health risks in childhood. This collection provides new insights into how systemic health conditions, family routines, parental knowledge, and broader community-level policies intersect to influence pediatric oral health outcomes. The findings highlight the imperative of holistic, family-centered approaches in both clinical care and public health planning. The link between systemic health and oral health is explored in the study “Impact of Severity of Bronchial Asthma on Oral Health in Children” by Alrashdi and Alyhya From an environmental and public health perspective, the article “Associations between community water fluoridation cessation and the prevalence of dental caries and fluorosis in Alrass city, Saudi Arabia” by Alrashdi On a more intimate level, “Family factors associated with dental caries among 5-year-old preschool children” by Castilho et al. Building on this theme, “May family routines impact oral health in American children?” by Pardi et al. The article “Parental awareness and dental health behavior of children with congenital heart disease, with diabetes mellitus, or undergoing anti-cancer treatment, compared to healthy children” by Halperson et al. Finally, “Unusual oral manifestation of Kindler syndrome: a case report and review of literature” by Bhandary et al. In sum, this Research Topic reinforces that children's oral health cannot be separated from the broader ecosystem of family health, knowledge, and habits. Each article contributes a unique piece to a larger mosaic that demonstrates the family's role not just as a context, but as a determinant of pediatric oral health. For clinicians, researchers, and policymakers, these findings make a compelling case for integrated, family-centered models of oral health promotion that extend beyond the dental chair and into the heart of the household. We hope this collection inspires continued interdisciplinary dialogue and innovation, aimed at empowering families, strengthening policies, and ultimately securing healthier futures for children worldwide. Edited and Reviewed by: Chun Hung Chu Author contributions ZB: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. Conflict of interest The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Correction Note This article has been corrected with minor changes. These changes do not impact the scientific content of the article. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. ",
  "metadata": {
    "Title of this paper": "Editorial: Impact of family health and habits on children's oral health",
    "Journal it was published in:": "Frontiers in Oral Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490535/"
  }
}