{
  "title": "Paper_236",
  "abstract": "pmc Antimicrob Agents Chemother Antimicrob Agents Chemother 82 aac aac Antimicrobial Agents and Chemotherapy 0066-4804 1098-6596 American Society for Microbiology (ASM) PMC12486802 PMC12486802.1 12486802 12486802 40824644 10.1128/aac.00420-25 aac00420-25 aac.00420-25 1 Antiviral Agents pharmacology Pharmacology Cytomegalovirus prophylaxis with letermovir in pediatric (birth to <18 years of age) hematopoietic cell transplant recipients: pharmacokinetics, efficacy, and safety results of a Phase 2b study https://orcid.org/0000-0003-1188-393X Groll Andreas H.  1 andreas.groll@ukmuenster.de Danziger-Isakov Lara  2 Gefen Aharon  3  4 Fraser Christopher J.  5 Schulte Johannes H.  6 Bielorai Bella  7  8 Karras Nicole A.  9 Bueno David  10 Shaw Peter J.  11 Broyde Natalya  12 Haber Barbara  12 Gilbert Christopher L.  12 Patel Mayankbhai  12 McCrea Jacqueline B.  12 Badshah Cyrus  12 1 University Children’s Hospital Münster https://ror.org/009x1kj44 Münster Germany 2 Cincinnati Children’s Hospital Medical Center, University of Cincinnati https://ror.org/01e3m7079 Cincinnati Ohio USA 3 Ruth Rappaport Children’s Hospital, Rambam Health Care Campus 58878 https://ror.org/01fm87m50 Haifa Israel 4 Faculty of Medicine, Technion Israel Institute of Technology 26747 https://ror.org/03qryx823 Haifa Israel 5 Queensland Children’s Hospital https://ror.org/02t3p7e85 Brisbane Queensland Australia 6 Charité Universitätsmedizin Berlin 14903 https://ror.org/001w7jn25 Berlin Germany 7 Sheba Medical Center 26744 https://ror.org/020rzx487 Tel HaShomer Israel 8 Faculty of Medicine, Tel Aviv University 26745 https://ror.org/04mhzgx49 Tel Aviv Israel 9 City of Hope Cancer Center Duarte California USA 10 Hospital Infantil Universitario La Paz 542070 Madrid Spain 11 Royal Alexandra Hospital for Children https://ror.org/05k0s5494 Westmead New South Wales Australia 12 Merck & Co., Inc. Rahway New Jersey USA Editor Martinez Miguel Angel IrsiCaixa Institut de Recerca de la Sida Barcelona Spain Address correspondence to Andreas H. Groll, andreas.groll@ukmuenster.de D.B. has participated in advisory boards for Alexion and served on speakers' bureau of Jazz Pharmaceuticals. L.D.-I. has received research support from AiCuris, Ansun BioPharma, Astellas, MSD, and Pfizer, and is a consultant for Astellas, MSD, and Takeda. C.J.F. has participated in advisory boards for Amgen, Jazz Pharmaceuticals, and Link Healthcare. A.H.G. has participated in advisory boards for Novartis and Sanofi. A.H.G. has received research support from Gilead Sciences, MSD, and Pfizer; is a consultant for Amplyx, Astellas, Basilea, F2G, Gilead Sciences, MSD, and Pfizer; and served on the speakers' bureau of Astellas, Basilea, F2G, Gilead Sciences, MSD, and Pfizer. N.B., B.H., C.L.G., M.P., J.B.M., and C.B. are current employees of Merck Sharp & Dohme LLC, a subsidiary of Merck & Co., Inc., Rahway, NJ, USA, and may own stock and/or stock options in Merck & Co., Inc., Rahway, NJ, USA. The other authors declare no conflict of interest. 10 2025 18 8 2025 69 10 498088 e00420-25 01 4 2025 02 7 2025 18 08 2025 02 10 2025 02 10 2025 Copyright © 2025 Groll et al. 2025 Groll et al. https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license ABSTRACT Letermovir, a cytomegalovirus (CMV) terminase complex inhibitor, was first approved for prophylaxis of CMV infection and disease in adult CMV-seropositive allogeneic hematopoietic cell transplant (HCT) recipients (R+). This study evaluated the pharmacokinetics (PK), efficacy, and safety of letermovir in pediatric R+ allogeneic HCT recipients. In this Phase 2b, single-arm, open-label study, 65 participants were enrolled sequentially in three age groups (AG; AG1, 12 to <18 years; AG2, 2 to <12 years; and AG3, birth to <2 years). PK was evaluated in an initial cohort in each AG using intensive PK data to confirm or modify dosing before enrolling the remaining participants. Adult HCT population PK (PopPK) data were used to establish the exposure reference range. The adult letermovir dose evaluated in AG1 and AG2 participants achieved exposures generally within the adult HCT reference range. In AG3, the initial cohort (letermovir with cyclosporin A) achieved exposures trending lower than the median exposure target; the letermovir dose was increased for the remaining participants. Efficacy and safety in pediatric participants were generally consistent with adult HCT data. A pediatric HCT PopPK model was developed to determine dose recommendations to be included in patient prescribing information. The doses evaluated achieved exposures generally within the adult HCT reference range. At exposures achieved, letermovir was efficacious and safe in preventing clinically significant CMV infection in pediatric allogeneic HCT recipients. The observed concentration data informed a pediatric PopPK model to optimize final letermovir dose recommendations in this population. CLINICAL TRIALS This study is registered with ClinicalTrials.gov as NCT03940586 KEYWORDS pharmacokinetics letermovir cytomegalovirus hematopoietic cell transplantation pediatric Merck Sharp & Dohme LLC NA Badshah Cyrus pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date October 2025 INTRODUCTION Cytomegalovirus (CMV) is a common viral pathogen associated with considerable morbidity and mortality in recipients of allogeneic hematopoietic cell transplant (HCT), with CMV-seropositive recipients (R+) being at the highest risk of CMV reactivation ( 1 2 3 4 Letermovir, a CMV DNA terminase inhibitor, is approved for the prophylaxis of CMV infection and disease in adult R+ allogeneic HCT recipients in over 60 countries, including the United States, the European Union, and Japan ( 5 NCT02137772 6 The objectives of this study were to evaluate the pharmacokinetics (PK), efficacy, and safety of letermovir in pediatric R+ allogeneic HCT recipients. The PK data from this study were used to assess plasma exposures following the doses evaluated and to develop a pediatric HCT population PK (PopPK) model to derive the final dose recommendations for approval in the pediatric HCT population ( 7 MATERIALS AND METHODS Study design and participants This Phase 2b (P030, NCT03940586 Fig. 1a Fig. 1a Fig 1 ( a b a b Study design overview. Timeline includes screening, LET administration, intensive PK sampling, and follow-ups at Weeks 14, 24, and 48 post-HCT. Participant flow by age group and cyclosporin A status, with interim PK analysis guiding progression. There were three interim PK analyses planned to confirm dosing. Interim analysis 1 for an initial cohort of participants for age group (AG) 1 Panel A (aged 12 to <18 years, n n n n n n n Fig. 1b Interim analysis data for AG1 were previously reported and demonstrated that administration of letermovir 480 mg once daily (240 mg once daily with concomitant CsA) in adolescents resulted in exposures within the prespecified bounds of the adult HCT exposure range, as well as an efficacy and safety profile similar to adults ( 8 Eligible participants were recipients of a first allogeneic HCT (bone marrow, peripheral blood stem cell, or cord blood) within 28 days prior to enrollment and had undetectable CMV DNA from a plasma or whole blood sample collected within 5 days prior to enrollment. AG1 participants had to be documented with a CMV R+ status within 90 days prior to enrollment; AG2/3 participants had to be documented as CMV R+ within 90 days prior to enrollment and/or the donor had to be CMV-seropositive within 1 year prior to enrollment. Given the relatively small number of HCTs performed in pediatric patients and the lower CMV seroprevalence in younger individuals ( 3 4 Tables S1 and S2 Participants’ legally acceptable representative(s) provided written informed consent. The study was reviewed and approved by the appropriate institutional review board or independent ethics committee at each center. This study was conducted in accordance with local and/or national regulations (including all applicable protection laws and regulations), the International Council for Harmonization of Technical Requirements for Pharmaceuticals for Human Use Good Clinical Practice, and the ethical principles that have their origin in the Declaration of Helsinki regarding independent ethics committee review, informed consent, and the protection of human participants in biomedical research. Letermovir dose selection and administration Initial dose selection was guided by both physiologically based PK and PopPK models. The pre-study initial dosing selections were based on simulations using an allometrically scaled adult HCT PopPK model. The participants in AG1 received the recommended daily adult dose of 480 mg letermovir (adjusted to 240 mg with concomitant CsA administration, if needed, in Panel B) through Week 14 post-HCT (without weight limits). The remaining initial dose selections for AG2 and AG3 were based on weight-band dosing. Dose modifications based on the interim analyses are described in the results ( Table S3 Participants received letermovir from the day of enrollment through Week 14 post-HCT ( Fig. 1a PK exposure targets The steady-state median target range for AUC0–24, predicted in adult HCT recipients from the Phase 3 PopPK model following administration of letermovir 480 mg orally or IV once daily without CsA, was 34,400–100,000 h × ng/mL ( 9 Objectives and end points The primary objective of the study was to evaluate letermovir PK in pediatric participants grouped by standard age cohorts. PK end points were assessed in the per-protocol population (defined as the subset of participants who comply with the protocol sufficiently to ensure that these data are likely to exhibit the effects of the study drug, according to the underlying scientific model). The primary measure of PK exposure was the AUC0–24 for determination of letermovir exposure. This parameter was used to match pediatric exposure to the adult HCT reference range and is the focus of the results. Efficacy was a secondary objective evaluated in all participants who received at least one dose of study drug and had no detectable CMV DNA on Day 1 when the study drug was initiated (primary efficacy population). The efficacy end points were the proportion of participants with CS-CMVi (1) through Week 14 and (2) through Week 24 post-HCT. Efficacy was assessed through Week 14, the period of the highest risk of CMV reactivation ( 1 Safety and tolerability were assessed by clinical review of relevant parameters, including adverse events (AEs), prospectively collected during the study. All AEs were collected through 28 days following the last dose of the study drug (treatment phase). Thereafter, only drug-related serious AEs (SAEs) and SAEs leading to death were collected through Week 48 post-HCT. The primary safety population consisted of all participants who received at least one dose of the study drug. To assess genotypic resistance, CMV DNA sequence analysis was performed using next-generation sequencing on samples from participants with CS-CMVi. Letermovir resistance was assessed by genotypic analysis of the CMV terminase complex genes (UL56, UL89, and UL51) with detectable CMV DNA. Statistical analysis There was no formal hypothesis testing in this study. A noncompartmental analysis was used for the primary PK parameters of interest, which was AUC0–24 derived from the intensive PK sampling on Day 7. The interim noncompartmental PK analyses occurred at three intervals: (i) when all evaluable participants completed intensive PK sampling in AG1 Panel A; (ii) when all evaluable participants completed intensive PK sampling in AG2 Panel A; and (iii) when the first three evaluable participants completed intensive PK sampling in AG3. The final noncompartmental PK analyses were performed on the PK population who underwent intensive PK sampling. Individual AUC0–24 values were plotted by dose and weight. Additional PK parameters, including but not limited to C max T max T 1/2 For efficacy analyses, the estimated proportion of participants with CS-CMVi through Weeks 14 and 24 post-HCT, 95% CIs were calculated based on the exact binomial method of Clopper and Pearson ( 10 10 RESULTS Participants The study was initiated on 8 August 2019, and completed on 25 August 2023. Among 65 participants <18 years of age enrolled in the study, 28 participants were 12 to <18 years of age, 29 participants were 2 to <12 years of age, and 8 participants were <2 years of age ( Fig. 2a Fig. 2a Fig. 2b Fig 2 Participant disposition (all randomized and treated participants): ( a b Flow diagrams plotting study and medication completion by age group. Most participants completed study; discontinuations were due to death, physician decisions, or guardian withdrawal. Medication discontinuations were mainly from adverse events. Participant demographics and baseline clinical characteristics are shown in Table 1 Table S4 TABLE 1 Baseline demographic and clinical characteristics (all participants as treated) a Parameter AG1 ( n AG2 ( n AG3 ( n Total ( N Sex, n Male 15 (53.6) 22 (81.5) 7 (87.5) 44 (69.8) Female 13 (46.4) 5 (18.5) 1 (12.5) 19 (30.2) Age (years) Mean (SD) 14.1 (1.5) 6.6 (3.2) 0.7 (0.3) 9.1 (5.3) Median (range) 13.5 (12–17) 7.0 (2–11) 0.7 (0–1) 11.0 (0–17) Race, n Asian 6 (21.4) 3 (11.1) 0 9 (14.3) Black or African American 3 (10.7) 0 0 3 (4.8) Multiple 4 (14.3) 2 (7.4) 1 (12.5) 7 (11.1) White 15 (53.6) 22 (81.5) 7 (87.5) 44 (69.8) Stem cell source, n Peripheral blood 15 (53.6) 16 (59.3) 4 (50.0) 35 (55.6) Bone marrow 12 (42.9) 10 (37.0) 3 (37.5) 25 (39.7) Cord blood 1 (3.6) 1 (3.7) 1 (12.5) 3 (4.8) Conditioning regimen used, n Myeloablative 25 (89.3) 24 (88.9) 6 (75.0) 55 (87.3) Reduced intensity conditioning 3 (10.7) 1 (3.7) 2 (25.0) 6 (9.5) Non-myeloablative 0 2 (7.4) 0 2 (3.2) Days from transplantation to randomization Mean (SD) 9.9 (8.38) 9.0 (8.59) 6.5 (4.07) 9.1 (8.03) Median (range) 7.5 (1.0–28.0) 5.0 (1.0–27.0) 7.5 (1.0–11.0) 7.0 (1.0–28.0) Donor/recipient CMV serostatus, n D+/R+ 20 (71.4) 18 (66.7) 0 38 (60.3) D−/R+ 8 (28.6) 6 (22.2) 4 (50.0) 18 (28.6) D+/R− 0 3 (11.1) 4 (50.0) 7 (11.1)   a AG, age group; CMV, cytomegalovirus; D+, CMV-seropositive donor; D−, CMV-seronegative donor; R+, CMV-seropositive recipient; R−, CMV-seronegative recipient; SD, standard deviation. PK The PK analyses were performed on a subset ( n n Of the 12 PK-evaluable participants in AG1, 8 received letermovir 480 mg orally or IV once daily without CsA, and 4 received letermovir 240 mg IV once daily with CsA ( Fig. 3 Fig. 3 Fig 3 Individual letermovir exposures for all participants who underwent intensive PK sampling compared with reference adult values ( n 9 Scatterplot of AUC₀–₂₄ versus weight by age, dose, and formulation. Most values fall between Phase 3 oral and IV medians. Higher exposures are observed in older and heavier participants. CsA co-administration is labeled. Of the 16 PK-evaluable participants in AG2, 6 received letermovir 240 mg orally or IV once daily without CsA, 4 received letermovir 120 mg orally or IV once daily without CsA, 1 received letermovir 60 mg IV once daily without CsA, 1 received letermovir 120 mg IV once daily with CsA, and 4 received letermovir 60 mg IV once daily with CsA ( Fig. 3 Fig. 3 Of the eight PK-evaluable participants in AG3, one received letermovir 60 mg orally once daily without CsA, one received letermovir 40 mg IV once daily without CsA, two received letermovir 60 mg orally or IV once daily with CsA, three received letermovir 40 mg orally once daily with CsA, and one received letermovir 20 mg IV once daily with CsA ( Fig. 3 Fig. 3 Table S3 Fig. 3 Efficacy Of the 56 participants evaluable for efficacy (i.e., received at least one dose of study drug and had undetectable viremia on Day 1) using the NC = F approach, there were 11 (19.6%) failures (true and imputed) through Week 14 post-HCT and 14 (25.0%) failures through Week 24 post-HCT ( Table 2 TABLE 2 Proportion of participants with CS-CMVi through Weeks 14 and 24 post-HCT (NC=F approach, primary efficacy population) a , b Parameter, n AG1 ( n AG2 ( n AG3 ( n Total ( N Through Week 14 post-HCT Failures c 5 (20.0) 4 (16.7) 2 (28.6) 11 (19.6) CS-CMVi d 2 (8.0) 1 (4.2) 1 (14.3) 4 (7.1) Initiation of PET based on documented CMV viremia 2 (8.0) 1 (4.2) 1 (14.3) 4 (7.1) CMV end-organ disease 0 0 0 0 Discontinued from study before visit window 2 (8.0) 3 (12.5) 1 (14.3) 6 (10.7) Missing outcome in visit window 1 (4.0) 0 0 1 (1.8) Through Week 24 post-HCT Failures c 6 (24.0) 6 (25.0) 2 (28.6) 14 (25.0) CS-CMVi d 2 (8.0) 3 (12.5) 1 (14.3) 6 (10.7) Initiation of PET based on documented CMV viremia 2 (8.0) 3 (12.5) 1 (14.3) 6 (10.7) CMV end-organ disease 0 0 0 0 Discontinued from study before visit window 4 (16.0) 3 (12.5) 1 (14.3) 8 (14.3) Missing outcome in visit window 0 0 0 0   a AG, age group; CMV, cytomegalovirus; CS-CMVi, clinically significant CMV infection; HCT, hematopoietic cell transplant; NC = F, non-completer = failure; PET, pre-emptive therapy.   b Primary efficacy population, defined as all participants who received ≥1 dose of study intervention and had no detectable CMV viral DNA on Day 1 of treatment.   c Categories of failure are mutually exclusive and listed in hierarchical order. With the NC = F approach, failure was defined as all participants who developed CS-CMVi, prematurely discontinued from the study, or had a missing outcome through the post-HCT visit window.   d Defined as proven or probable CMV end-organ disease, or initiation of PET based on documented CMV viremia and the participant’s clinical condition. The true failure rate (incidence of CS-CMVi only) as evaluated using the DAO approach for missing data were 8.2% (4/49) and 12.5% (6/48) at Weeks 14 and 24, respectively ( Table S5 Safety There were 63 participants in the safety population (i.e., those who received at least one dose of study drug). Overall, the AE profile was comparable across the three AGs in the broad categories of AEs during the treatment phase ( Table S6 Table 3 Table S7 TABLE 3 Participants with AEs through Week 14 post-HCT (incidence ≥20% in one or more AG; safety population; treatment phase) a , b n AG1 n AG2 n AG3 n Total N With ≥1 AE c 28 (100) 27 (100) 8 (100) 63 (100) Gastrointestinal disorders 27 (96.4) 27 (100) 5 (62.5) 59 (93.7) Vomiting 14 (50.0) 20 (74.1) 3 (37.5) 37 (58.7) Nausea 12 (42.9) 6 (22.2) 0 18 (28.6) Diarrhea 12 (42.9) 12 (44.4) 0 24 (38.1) Abdominal pain 11 (39.3) 6 (22.2) 1 (12.5) 18 (28.6) Stomatitis 8 (28.6) 9 (33.3) 0 17 (27.0) Infections and infestations 21 (75.0) 18 (66.7) 5 (62.5) 44 (69.8) Device-related infection 1 (3.6) 3 (11.1) 2 (25.0) 6 (9.5) Epstein-Barr virus infection reactivation 2 (7.1) 0 2 (25.0) 4 (6.3) General disorders and administration site conditions 16 (57.1) 18 (66.7) 4 (50.0) 38 (60.3) Pyrexia 11 (39.3) 13 (48.1) 3 (37.5) 27 (42.9) Immune system disorders 15 (53.6) 13 (48.1) 4 (50.0) 32 (50.8) Graft-versus-host disease 10 (35.7) 11 (40.7) 3 (37.5) 24 (38.1) Skin and subcutaneous tissue disorders 12 (42.9) 17 (63.0) 2 (25.0) 31 (49.2) Pruritus 6 (21.4) 3 (11.1) 0 9 (14.3) Metabolism and nutritional disorders 12 (42.9) 14 (51.9) 4 (50.0) 30 (47.6) Decreased appetite 3 (10.7) 8 (29.6) 0 11 (17.5) Blood and lymphatic system disorders 8 (28.6) 15 (55.6) 1 (12.5) 24 (38.1) Thrombocytopenia 5 (17.9) 9 (33.3) 0 14 (22.2) Neutropenia 2 (7.1) 8 (29.6) 1 (12.5) 11 (17.5) Anemia 1 (3.6) 7 (25.9) 0 8 (12.7) Vascular disorders 10 (35.7) 11 (40.7) 2 (25.0) 23 (36.5) Hypertension 7 (25.0) 9 (33.3) 0 16 (25.4) Renal and urinary disorders 14 (50.0) 8 (29.6) 0 22 (34.9) Dysuria 6 (21.4) 3 (11.1) 0 9 (14.3) Nervous system disorders 13 (46.4) 5 (18.5) 1 (12.5) 19 (30.2) Headache 6 (21.4) 3 (11.1) 0 9 (14.3)   a AE, adverse event; AG, age group; HCT, hematopoietic cell transplant.   b Safety population, defined as all participants who received ≥1 dose of study drug.   c AEs were reported using the Medical Dictionary for Regulatory Activities Version 25.1. Each participant was counted once for each system organ class or specific AE. Thirty-five (55.6%) participants experienced at least one SAE ( Table S6 There were four deaths reported during the treatment phase that were considered to be due to AEs. The causes of death included Candida n n n n Viral resistance Resistance genotyping was attempted on samples collected from 12 participants with viremia. Of these, 10 participants had evaluable sequence data available for analysis (AG1, n n n DISCUSSION Pediatric allogeneic HCT recipients are at risk of CMV infection or reactivation ( 1 4 4 11 The doses used in this study were based on simulations using an allometric scaling of an adult HCT PopPK model to approximate letermovir exposures in pediatric participants to the adult HCT reference exposure range. There were no letermovir dose modifications to the initial dose selections for AG1 and AG2. For AG3, the youngest participants, letermovir exposures for the first three participants (who received letermovir with CsA) were trending lower than the target median adult exposure at the interim analysis. In the remaining five AG3 participants, the letermovir dose was increased for participants weighing <10 kg. The letermovir exposures in pediatric participants for the doses evaluated in the study were generally within the adult HCT recipient reference exposure range. The final dose recommendations for the pediatric HCT population were based on using the PK data from this study in a pediatric HCT PopPK model, which will be the subject of a separate publication. The predicted letermovir exposures, based upon the final pediatric HCT PopPK model, informed and supported the dose recommendations of the recent pediatric approval ( 7 The efficacy of letermovir in preventing CS-CMVi in this study was consistent with the efficacy demonstrated in the pivotal Phase 3 adult study. With the NC = F approach used to account for missing data, 19.6% of study participants had failed at Week 14 post-HCT, compared with 19.1% in the adult study at the same time point. The corresponding rates at Week 24 post-HCT were 25.0% and 37.5% in pediatric and adult participants, respectively ( 6 It should be noted that the NC = F approach for estimating failure rates is a conservative approach, where the failure rate includes not only individuals who develop CS-CMVi (true failures), but also those who discontinue the study prematurely or where data are missing (imputed failures). The true failure rate with the DAO approach was substantially lower (8.2% and 12.5% at Weeks 14 and 24 post-HCT, respectively). It should also be noted that a subset of participants from AG2 and AG3 were CMV-seronegative recipients with a CMV-seropositive donor (D+/R−) at baseline (to facilitate study enrollment of the younger AGs given the relatively small number of HCTs performed in pediatric patients and lower CMV seroprevalence observed globally in younger individuals [ 3 4 12 Letermovir was generally safe and well tolerated in this study, with a safety profile similar to that seen in the adult Phase 3 HCT study. Gastrointestinal-related AEs were the most common treatment-emergent AEs, and treatment discontinuation due to drug-related AEs was rare (3.2%; Table S6 1 6 13 There are several well-recognized approaches to providing substantial evidence for the safe and effective use of a drug in a pediatric population that often involve leveraging available data in adults. This concept is referred to as pediatric extrapolation ( 14 15 For the purpose of pediatric extrapolation, robust safety and efficacy data were available from a large multicenter trial in adults demonstrating a clinically meaningful and statistically significant effect on CS-CMVi prevention, as well as a mortality benefit ( 6 16 The PK data obtained in this study were used in a pediatric HCT PopPK model to predict exposures for this population and support proposed dose recommendations, along with additional safety and efficacy data supporting pediatric extrapolation, for submission to regulatory authorities. The first regulatory approval for use of letermovir in pediatric R+ HCT recipients for CMV prophylaxis was obtained in August 2024. Final dose recommendations are provided in the patient prescribing information ( Table S8 In conclusion, at the doses used and the letermovir exposures achieved in this study, letermovir is generally safe and effective in preventing CS-CMVi in pediatric HCT recipients. ACKNOWLEDGMENTS The authors are grateful to all study participants, investigators, site personnel, and contributors. Funding was provided by Merck Sharp & Dohme LLC, a subsidiary of Merck & Co., Inc., Rahway, NJ, USA. Medical writing assistance, under the direction of the authors, was provided by Jane Chung, PharmD, of CMC Affinity, a division of IPG Health Medical Communications, in accordance with Good Publication Practice (GPP 2022) guidelines. This assistance was funded by Merck Sharp & Dohme LLC, a subsidiary of Merck & Co., Inc, Rahway, NJ, USA. DATA AVAILABILITY The data sharing policy, including restrictions, of Merck Sharp & Dohme LLC, a subsidiary of Merck & Co., Inc., Rahway, NJ, USA, is available at https://externaldatasharing-msd.com/ SUPPLEMENTAL MATERIAL The following material is available online at https://doi.org/10.1128/aac.00420-25 10.1128/aac.00420-25.SuF1 Supplemental tables aac.00420-25-s0001.pdf Tables S1 to S8. ASM does not own the copyrights to Supplemental Material that may be linked to, or accessed through, an article. The authors have granted ASM a non-exclusive, world-wide license to publish the Supplemental Material files. Please contact the corresponding author directly for reuse. REFERENCES 1 Cui J Zhao K Sun Y Wen R Zhang X Li X Long B 2022 Diagnosis and treatment for the early stage of cytomegalovirus infection during hematopoietic stem cell transplantation Front Immunol 13 971156 10.3389/fimmu.2022.971156 36211358 PMC9537469 2 Passweg JR Baldomero H Ciceri F Corbacioglu S de la Cámara R Dolstra H Glass B Greco R McLornan DP Neven B de Latour RP Perić Z Ruggeri A Snowden JA Sureda A 2023 Hematopoietic cell transplantation and cellular therapies in Europe 2021. The second year of the SARS-CoV-2 pandemic. a report from the EBMT activity survey Bone Marrow Transplant 58 647 658 10.1038/s41409-023-01943-3 36879108 PMC9987384 3 Center for International Blood and Marrow Transplant Research 2022 HRSA transplant activity report: number of HCTs performed in the United States and reported to CIBMTR, by year and age group, 2016–2020 4 Bateman CM Kesson A Powys M Wong M Blyth E 2021 Cytomegalovirus infections in children with primary and secondary immune deficiencies Viruses 13 2001 10.3390/v13102001 34696432 PMC8538792 5 Kim ES 2018 Letermovir: first global approval Drugs (Abingdon Engl) 78 147 152 10.1007/s40265-017-0860-8 29288370 6 Marty FM Ljungman P Chemaly RF Maertens J Dadwal SS Duarte RF Haider S Ullmann AJ Katayama Y Brown J Mullane KM Boeckh M Blumberg EA Einsele H Snydman DR Kanda Y DiNubile MJ Teal VL Wan H Murata Y Kartsonis NA Leavitt RY Badshah C 2017 Letermovir prophylaxis for cytomegalovirus in hematopoietic-cell transplantation N Engl J Med 377 2433 2444 10.1056/NEJMoa1706640 29211658 7 US Food and Drug Administration 2024 Prevymis (letermovir) prescribing information 8 Groll AH Schulte JH Antmen AB Fraser CJ Teal VL Haber B Caro L McCrea JB Fancourt C Patel M Menzel K Badshah C 2024 Pharmacokinetics, safety, and efficacy of letermovir for cytomegalovirus prophylaxis in adolescent hematopoietic cell transplantation recipients Pediatr Infect Dis J 43 203 208 10.1097/INF.0000000000004208 38241643 9 Prohn M Viberg A Zhang D Dykstra K Davis C Macha S Sabato P de Alwis D Iwamoto M Fancourt C Cho CR 2021 Population pharmacokinetics of letermovir following oral and intravenous administration in healthy participants and allogeneic hematopoietic cell transplantation recipients CPT Pharmacometrics Syst Pharmacol 10 255 267 10.1002/psp4.12593 33440077 PMC7965833 10 Clopper CJ Pearson ES 1934 The use of confidence or fiducial limits illustrated in the case of the binomial Biometrika 26 404 413 10.1093/biomet/26.4.404 11 Castagnola E Cappelli B Erba D Rabagliati A Lanino E Dini G 2004 Cytomegalovirus infection after bone marrow transplantation in children Hum Immunol 65 416 422 10.1016/j.humimm.2004.02.013 15172440 12 Ljungman P Hakki M Boeckh M 2011 Cytomegalovirus in hematopoietic stem cell transplant recipients Hematol Oncol Clin North Am 25 151 169 10.1016/j.hoc.2010.11.011 21236396 PMC3340426 13 Chemaly RF Ullmann AJ Stoelben S Richard MP Bornhäuser M Groth C Einsele H Silverman M Mullane KM Brown J Nowak H Kölling K Stobernack HP Lischka P Zimmermann H Rübsamen-Schaeff H Champlin RE Ehninger G AIC246 Study Team 2014 Letermovir for cytomegalovirus prophylaxis in hematopoietic-cell transplantation N Engl J Med 370 1781 1789 10.1056/NEJMoa1309533 24806159 14 US Food and Drug Administration 2022 General clinical pharmacology considerations for pediatric studies of drugs, including biological products - guidance for industry Center for Drug Evaluation and Research Available from https://www.fda.gov/regulatory-information/search-fda-guidance-documents/general-clinical-pharmacology-considerations-pediatric-studies-drugs-including-biological-products 15 European Medicines Agency 2017 ICH E11(R1) guideline on clinical investigation of medicinal products in the pediatric population Available from https://www.ema.europa.eu/en/documents/scientific-guideline/ich-e11r1-guideline-clinical-investigation-medicinal-products-pediatric-population-revision-1-addendum_en.pdf 16 Bi Y Liu J Li L Yu J Bhattaram A Bewernitz M Li RJ Liu C Earp J Ma L Zhuang L Yang Y Zhang X Zhu H Wang Y 2019 Role of model-informed drug development in pediatric drug development, regulatory evaluation, and labeling J Clin Pharmacol 59 Suppl 1 S104 S111 10.1002/jcph.1478 31502691 ",
  "metadata": {
    "Title of this paper": "Role of model-informed drug development in pediatric drug development, regulatory evaluation, and labeling",
    "Journal it was published in:": "Antimicrobial Agents and Chemotherapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486802/"
  }
}