{
  "title": "Paper_325",
  "abstract": "pmc Front Med (Lausanne) Front Med (Lausanne) 2657 frontmedicine Front. Med. Frontiers in Medicine 2296-858X Frontiers Media SA PMC12484214 PMC12484214.1 12484214 12484214 41041446 10.3389/fmed.2025.1634451 1 Medicine Case Report Robotic-assisted total gastrectomy for refractory hypoproteinemia in Menetrier’s disease: a case report with operative video and literature review Wang Lang  † Liu Ziping  † Zhang Jing  † Zhu Xianglin Zhao Shijun Zhao Cheng Liang Hao Zhang Jie Gao Tian Ding Yinlu  * Department of Gastrointestinal Surgery, The Second Qilu Hospital of Shandong University Jinan China Edited by: Angel Lanas Reviewed by: Chrysanthi Aggeli Nida Ali Safdar *Correspondence: Yinlu Ding, dingyinlu@126.com † 17 9 2025 2025 12 480650 1634451 24 5 2025 28 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Wang, Liu, Zhang, Zhu, Zhao, Zhao, Liang, Zhang, Gao and Ding. 2025 Wang, Liu, Zhang, Zhu, Zhao, Zhao, Liang, Zhang, Gao and Ding https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Ménétrier’s disease is a rare, progressive disorder of unclear etiology, typically affecting middle-aged men and characterized by giant gastric mucosal folds, mainly in the fundus and body, with occasional antral involvement. Diagnosis is challenging due to its rarity and the need to differentiate from hypertrophic lymphocytic gastritis, Zollinger-Ellison syndrome, gastric cancer, and lymphoma. We report a young male with Menetrier’s disease presenting as generalized edema due to hypoproteinemia. After a challenging diagnostic process and ineffective medical management, the patient underwent robot-assisted total gastrectomy with Roux-en-Y esophagojejunostomy, which corrected the hypoproteinemia. He recovered uneventfully and was discharged on postoperative day 12. At 23 months post-surgery, he showed no hypoalbuminemia, edema, or related symptoms; body weight and serum albumin remained normal. Robot-assisted total gastrectomy is a surgical method for treating Meniere’s disease; however, its cost-effectiveness should be carefully considered, and in the long term, more high-quality studies may be required to validate its feasibility. Ménétrier’s disease robotic-assisted total gastrectomy refractory hypoproteinemia Roux-en-Y esophagojejunostomy case report The author(s) declare that financial support was received for the research and/or publication of this article. This work is supported by Development Center for Medical Science & Technology National Health Commission of the People’s Republic of China (W2018RY9). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Gastroenterology 1 Introduction Ménétrier’s disease, also known as giant hypertrophic gastritis or protein-losing hypertrophic gastropathy, is a rare and severe gastric disorder associated with neoplastic potential ( 1 2 3 4 Helicobacter pylori 5 6 α 7–9 10 11–13 3 13 14 2 3 15 16 17 2 Case presentation 2.1 Complex medical history A 38-year-old male with a history of external hemorrhoidectomy (4 years prior) and a family history of paternal lung cancer presented with generalized edema, predominantly in the lower extremities, and abdominal distension for over 10 days. Initial workup revealed hypoalbuminemia (albumin 23.4 g/L), hypocalcemia (calcium 1.79 mmol/L), with unremarkable urinalysis, tumor markers, BNP, viral panel, and chest-abdominal CT. Gastrointestinal endoscopy identified lesions in the gastric fundus and body; biopsy showed acute and chronic gastritis, reduced gland density, epithelial hyperplasia, and focal diffuse large cells. Pathology review at a tertiary center revealed chronic mucosal inflammation with focal high-grade intraepithelial neoplasia; immunohistochemistry: Ki-67 (hotspot ~40%), CK(AE1/AE3)(+), CEA(−), P53 (wild-type+). Liver function showed further decreased albumin (17.8 g/L); immunological and rheumatological tests were unremarkable. Symptomatic treatment with albumin infusion led to symptom improvement and discharge. After discharge, the patient’s symptoms worsened and he was readmitted locally. Tests showed 24-h urinary protein at 0.19 g, albumin at 17.7 g/L, and no abnormalities in rheumatologic markers. Symptomatic treatment with diuretics and albumin improved abdominal distension, but bilateral lower limb edema with erythema, warmth, pain, and fever up to 38.6°C persisted. Ceftriaxone and other therapies yielded no significant improvement. The patient presented to the nephrology department with eyelid edema and mild pitting edema of both lower limbs. Laboratory evaluation revealed hypoalbuminemia (18.4 g/L), decreased globulin (15.6 g/L), and reduced A/G ratio (1.18); fecal occult blood was positive. Infectious soft tissue disease of the lower limbs was considered the cause of fever. Despite albumin infusion, diuretics, and anti-infective therapy, hypoalbuminemia persisted, though hypocalcemia was corrected after albumin supplementation. Multidisciplinary consultation excluded cardiac, hepatic, and renal dysfunction as causes of systemic edema. Further investigations, including peripheral blood morphology, Brucella, C. difficile H. pylori Supplementary Figures S1A–E One week post-discharge, the patient developed generalized edema and abdominal distension, and was readmitted to the Department of Gastroenterology. Gastroscopic biopsy revealed severe chronic active gastritis with erosion, congestion, edema, marked proliferation and elongation of foveolar and glandular neck regions, partial glandular dilatation, significant reduction of oxyntic glands, and focal pyloric gland metaplasia, consistent with Menetrier’s disease based on clinical and endoscopic findings. Immunohistochemistry: CEA (foveolar surface membrane +), CK (broad-spectrum +), Ki67 (normal proliferative zone pattern), MUC-2 (−), MUC-5 AC (foveolar epithelium +), MUC-6 (metaplastic pyloric glands +), P53 (wild-type expression) ( Supplementary Figure S1F After discharge, the patient visited a higher-level gastroenterology department outside the province. Further rheumatologic, CMV, H. pylori After admission, upper gastrointestinal contrast study and contrast-enhanced CT of the chest, abdomen, and pelvis confirmed the diagnosis of Menetrier’s disease involving the gastric fundus and body ( Figure 1 Figure 1 (A,B) (C,D) Four-part medical imaging comparison. Top two images (A and B): Axial CT scans of the abdomen, showing liver and gastrointestinal structures. Bottom two images (C and D): X-rays with contrast showing contrast flow through the intestines. 2.2 Surgical procedure  After successful general anesthesia, a gastric tube, urinary catheter, and central venous catheter were placed. The patient was positioned supine with legs apart, and standard sterile draping was performed. A 1 cm infraumbilical incision was made for pneumoperitoneum with CO2 insufflation maintained at 12 mmHg. A trocar was inserted as the camera port (C, 8 mm). The patient was placed in a 15° Trendelenburg position. Exploration assessed the diaphragm, liver, paracolic gutters, pelvis, small intestine, peritoneum, omentum, and mesentery. Findings included diffuse gastric wall thickening and edema, firm texture, significant gastric enlargement, multiple soft perigastric lymph nodes (~5 mm), extensive adhesions, marked perigastric vascular proliferation, and mild pelvic effusion. Robotic-assisted total gastrectomy was deemed feasible. Additional ports were placed: R1 (8 mm, left anterior axillary line, subcostal), for harmonic scalpel; R2 (8 mm, right midclavicular line, umbilical level), for Maryland bipolar forceps; R3 (8 mm, right anterior axillary line, subcostal), for Cadiere forceps; and A (12 mm, left midclavicular line, umbilical level), as an assistant port. The “arc-shaped five-port” configuration was used ( Figure 2A After entering the lesser sac, the omentum is dissected leftward along the gastric wall, ligating and dividing the left gastroepiploic vessels near the lower pole of the spleen. Several short gastric vessels are divided superiorly. The gastric fundus is retracted inferolaterally to expose the left cardia and left crus of the diaphragm. Dissection continues along the greater curvature to the right, exposing the pancreatic head at the lower pancreatic border. The right gastroepiploic vessels are exposed, ligated, and divided at their roots, followed by ligation and division of the inferior pyloric vessels. The duodenal bulb is mobilized up to 2 cm below the pylorus and transected with a 60 mm laparoscopic linear stapler (white cartridge, 2.6 mm staple height). The assistant retracts the gastric stump superolaterally to expose the pancreas, and the pancreatic capsule is dissected to the upper border. The right gastric vessels are exposed, ligated, and divided, then the stomach is further retracted to expose and divide the left gastric vessels. The posterior gastric wall is elevated, and posterior gastric vessels are ligated and divided. The lesser omentum is dissected along the liver margin to the right cardia and right crus. The esophagus is fully mobilized and transected with a 60 mm laparoscopic linear stapler (blue cartridge, 3.6 mm staple height). Both sides of the esophageal stump are suspended with 3–0 absorbable knotless sutures (15 cm) to prevent retraction. A 0.5 cm incision is made in the posterior wall of the esophageal stump with electrocautery, followed by exploration and dilation with dissecting forceps, and a gastric tube is advanced through the incision. A 6–8 cm upper midline incision was made below the xiphoid, with layered entry into the abdomen and placement of a wound protector for specimen retrieval. The jejunum was transected approximately 25 cm distal to the ligament of Treitz using a 60 mm laparoscopic linear stapler (white cartridge, 2.6 mm staple height). The distal jejunum was brought up retrocolically to the esophageal stump without tension. A 0.5 cm mesenteric-side enterotomy was made and dilated at the jejunal limb, 40 cm from the distal end, and at the proximal and distal stumps. Side-to-side jejunojejunostomy was performed with a 60 mm linear stapler (white cartridge, 2.6 mm), and the common enterotomy and stump were closed with 3–0 absorbable knotless sutures, reinforcing the duodenal stump. Mesenteric defects were closed. After re-establishing pneumoperitoneum, an esophagojejunostomy (overlap technique) was performed at the distal jejunal stump, with closure and reinforcement using 3–0 absorbable knotless sutures. Resection and anastomosis diagrams are shown in Figure 2B The abdominal cavity was irrigated with warm saline and hemostasis achieved. Two drains were placed—one behind the esophagojejunostomy and one in the left upper abdomen—exteriorized and secured through lateral abdominal wall trocar sites ( Supplementary Video S1 Figures 3A C Figure 2 (A) (B) Diagram with two sections labeled A and B. Section A shows a schematic of surgical port placements on an abdomen, labeled R1, R2, R3, C, and A, with corresponding sizes. Section B illustrates two surgical procedures involving the stomach and colon, showing different configurations of intestinal reconnection. Figure 3 (A–C) (D) Four-panel image of a resected specimen. Panels A, B, and C show different views of a brown and red tissue mass, indicating internal organ material. Panel D shows a microscopic view of the tissue with a pink and purple pattern, suggesting histological examination. 2.3 Postoperative outcome On postoperative day 3, the patient passed flatus and gradually resumed oral intake. Upper GI contrast on day 6 showed a patent anastomosis with smooth passage ( Figure 4A Figure 4B Figure 3D Figure 4 (A) (B) Two medical images are shown. Panel A is an abdominal X-ray displaying skeletal structures and internal organ outlines. Panel B is a cross-sectional abdominal CT scan showing internal organ density and structures in detail. At 23 months post-surgery, the patient showed no hypoalbuminemia, generalized edema, or related symptoms. Body weight recovered gradually, and serum albumin remained normal. 3 Discussion Hypertrophic gastropathy is a rare, acquired precancerous gastric disorder of unclear etiology ( 15 12 18 6 Helicobacter pylori 13 19 α 20 20 21 10 2 3 15 16 12 19 Helicobacter pylori 12 14 H. pylori 2 22 23 24 15 20 25 12 26 27–29 12 30–35 35 36 We report a case of a young male with Menetrier’s disease presenting as generalized edema due to hypoproteinemia. After a complex diagnostic process, definitive diagnosis was achieved. Given poor response to medical therapy and extensive lesions, we performed robot-assisted total gastrectomy with Roux-en-Y esophagojejunostomy. Based on the patient’s clinical course, our experience with robotic treatment, and relevant literature, we summarize the following insights: Giant hypertrophic gastritis presents with non-specific clinical features and a broad differential diagnosis, making definitive diagnosis challenging ( 16 Single endoscopic biopsy may be insufficient due to inadequate depth and sampling; multiple, large, and deep biopsies from various sites may be necessary to improve diagnostic yield ( 15 37 38 Due to the rarity of this disease, clinicians, endoscopists, and pathologists may lack experience. Medical professionals should enhance their knowledge and consider this diagnosis in patients with extensive negative workups, pursuing targeted investigations. Based on our center’s experience with the da Vinci Xi robotic system for gastrointestinal diseases, we find that patients with hypertrophic gastritis often exhibit diffuse gastric wall thickening and prominent perigastric vascular proliferation. The da Vinci robot’s precision and flexibility offer advantages in such cases ( 39 We used the “curved five-port” trocar layout, but due to the extensive resection range in total gastrectomy, trocar positions should be adjusted according to patient body habitus. The procedure involves extensive organ mobilization and transection with complex local anatomy, requiring high technical proficiency from assistants, especially for exposure and dissection without direct vision. Team coordination is essential to enhance surgical safety. Postoperative specimens showed diffuse gastric wall thickening, coarse and disorganized mucosal folds, and abundant yellow-white viscous secretions. Literature suggests that imbalance between mucus and acid secretion leads to protein malabsorption and subsequent hypoproteinemia ( 16 As no effective treatment exists, a multidisciplinary team involving gastroenterologists, pathologists, nutritionists, oncologists, and surgeons is recommended for management ( 15 Intraoperative complications such as bleeding or splenic injury require clear visualization and gentle manipulation; splenectomy may be necessary for uncontrolled splenic bleeding, and conversion to open surgery should be considered when needed. Early postoperative complications mainly include duodenal stump and anastomotic leaks; intraoperative assessment of tissue quality, secure suturing, adequate blood supply, and tension-free anastomosis, along with postoperative nutritional support, are essential. Although surgical management of Menétrier’s disease is well-established, robotic surgery remains rare, with only one case reported in the literature ( 35 40 41 42 4 Conclusion Menetrier’s disease, a rare precancerous condition, often presents with hypoalbuminemia and is easily missed. Diagnosis requires multidisciplinary collaboration, repeated deep biopsies, and imaging. While medical therapy benefits some patients, extensive disease necessitates total gastrectomy. This case highlights the need to raise awareness, standardize endoscopic biopsy, and advance minimally invasive techniques; Robot-assisted total gastrectomy is a surgical method for treating Meniere’s disease; however, its cost-effectiveness should be carefully considered, and in the long term, more high-quality studies may be required to validate its feasibility. Data availability statement The original contributions presented in the study are included in the article/ Supplementary material Ethics statement The studies involving humans were approved by the Ethics Committee of the Second Qilu Hospital of Shandong University (approval number KYLL2025458). The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions LW: Conceptualization, Investigation, Writing – original draft, Data curation, Formal analysis, Visualization, Methodology. ZL: Writing – review & editing, Visualization, Methodology, Writing – original draft, Investigation, Conceptualization. JinZ: Methodology, Writing – original draft, Investigation, Conceptualization, Writing – review & editing, Visualization. XZ: Writing – original draft, Investigation, Conceptualization, Methodology. SZ: Investigation, Conceptualization, Writing – original draft. CZ: Conceptualization, Investigation, Writing – original draft. HL: Writing – original draft, Investigation, Conceptualization. JieZ: Conceptualization, Investigation, Writing – original draft. TG: Conceptualization, Writing – original draft, Investigation. YD: Conceptualization, Validation, Writing – review & editing, Project administration, Writing – original draft, Methodology, Supervision, Data curation, Formal analysis, Investigation, Visualization. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fmed.2025.1634451/full#supplementary-material References 1. Scharschmidt BF The natural history of hypertrophic gastrophy (Menetrier's disease). Report of a case with 16 year follow-up and review of 120 cases from the literature Am J Med 1977 63 644 52 10.1016/0002-9343(77)90210-8 199063 2. Almazar AE Penfield JD Saito YA Talley NJ Survival times of patients with Menetrier's disease and risk of gastric Cancer Clin Gastroenterol Hepatol 2021 19 707 12 10.1016/j.cgh.2020.03.017 32184187 3. Gore M Bansal K Jadhav N Menetrier Disease StatPearls Treasure Island, FL StatPearls Publishing 2023 33085301 4. Tard C Madhi F Verlhac S Hagège H Epaud R Jung C Protein-losing gastropathy associated with cytomegalovirus in two sisters - case reports and review of the literature Arch Pediatr 2019 26 232 5 10.1016/j.arcped.2019.03.005 30954365 5. Iguchi E Tsumura T Sekikawa A Wakasa T Maruo T Okabe Y Cap-polyposis-like gastropathy with hypoproteinemia treated with H. pylori Intern Med 2013 52 2215 8 10.2169/internalmedicine.52.0700 24088754 6. Shi W Jiao Y Ménétrier's disease QJM 2023 116 802 3 10.1093/qjmed/hcad103 37220896 7. Coffey RJ Romano M Goldenring J Roles for transforming growth factor-alpha in the stomach J Clin Gastroenterol 1995 21 S36 9 8774988 8. Dempsey PJ Goldenring JR Soroka CJ Modlin IM McClure RW Lind CD Possible role of transforming growth factor alpha in the pathogenesis of Ménétrier's disease: supportive evidence form humans and transgenic mice Gastroenterology 1992 103 1950 63 10.1016/0016-5085(92)91455-d 1451986 9. Nomura S Settle SH Leys CM Means AL Peek RM Jr Leach SD Evidence for repatterning of the gastric fundic epithelium associated with Ménétrier's disease and TGFalpha overexpression Gastroenterology 2005 128 1292 305 10.1053/j.gastro.2005.03.019 15887112 10. Burmester JK Bell LN Cross D Meyer P Yale SH A SMAD4 mutation indicative of juvenile polyposis syndrome in a family previously diagnosed with Menetrier's disease Dig Liver Dis 2016 48 1255 9 10.1016/j.dld.2016.06.010 27375208 11. Stamm B Localized hyperplastic gastropathy of the mucous cell- and mixed cell-type (localized Ménétrier's disease): a report of 11 patients Am J Surg Pathol 1997 21 1334 42 10.1097/00000478-199711000-00008 9351571 12. Chen YA Tsai HL Liang PI Wang JY A rare case of Menetrier's disease-induced gastric outlet obstruction Kaohsiung J Med Sci 2023 39 1054 5 10.1002/kjm2.12735 37530671 PMC11895987 13. Wang HH Zhao CC Wang XL Cheng ZN Xie ZY Menetrier's disease and differential diagnosis: a case report World J Clin Cases 2021 9 6943 9 10.12998/wjcc.v9.i23.6943 34447846 PMC8362536 14. Huh WJ Coffey RJ Washington MK Ménétrier's disease: its mimickers and pathogenesis J Pathol Transl Med 2016 50 10 6 10.4132/jptm.2015.09.15 26689786 PMC4734964 15. Ramrakhiani H Triadafilopoulos G Erasing Giant folds: Ménétrier's disease treated with Cetuximab Dig Dis Sci 2022 67 5006 9 10.1007/s10620-022-07692-5 36125594 16. Keener M Waack A Ranabothu M Ranabothu A Vattipally VR Clinical and radiological features of Menetrier's disease: a case report and review of the literature Cureus 2023 15 e45537 10.7759/cureus.45537 37868436 PMC10586083 17. Grantham T Ramachandran R Parvataneni S Budh D Gollapalli S Gaduputi V Epidemiology of gastric Cancer: global trends, risk factors and premalignant conditions J Community Hosp Intern Med Perspect 2023 13 100 6 10.55729/2000-9666.1252 38596548 PMC11000854 18. Sweeney AR Lynch MK A case of Ménétrier's disease localized to the gastric antrum without helicobacter infection or hypoalbuminemia Int J Surg Case Rep 2013 4 839 41 10.1016/j.ijscr.2013.07.004 23959414 PMC3785928 19. Kmiecik M Walczak A Samborski P Paszkowski J Dobrowolska A Karczewski J Upper gastrointestinal bleeding as an unusual manifestation of localized Ménétrier's disease with an underlying lipoma: a case report World J Gastrointest Endosc 2023 15 10 8 10.4253/wjge.v15.i1.10 36686066 PMC9846829 20. Hussameddin A Sedano R Ramsewak D Driman D Jairath V Vedolizumab-induced endoscopic and histologic improvement in gastric Menetrier's disease in a patient with ulcerative colitis Inflamm Bowel Dis 2021 27 e132 3 10.1093/ibd/izab129 34019068 21. Kayes T Bonnichsen M Willmann L Lorenzo A Das A El-Haddad C Menetrier's disease exacerbating ulcerative colitis and relieved by gastrectomy BMJ Open Gastroenterol 2021 8 e000806 10.1136/bmjgast-2021-000806 34930756 PMC8689123 22. Setakhr V Muller G Hoang P Lambert AS Geubel A Cytomegalovirus-associated protein losing gastropathy in an immunocompetent adult: a case report Acta Gastroenterol Belg 2007 70 296 9 18074741 23. Heurgué-Berlot A Féron T Jazeron JF Hoeffel C Diebold MD Cadiot G Ménétrier's disease: long-term remission with lanreotide Clin Res Hepatol Gastroenterol 2016 40 e5 9 10.1016/j.clinre.2015.07.007 26382280 24. Salmón Olavarría P Irabien Ortiz M de la Fuente Molinero I Ugarte Bilbao A Cubillas Urkiola S Erdozain Castiella JG Ménétrier disease: a rare cause of severe chronic diarrhea difficult to diagnose with response to treatment with octreotide Rev Esp Enferm Dig 2024 119 10.17235/reed.2024.10668/2024 39235177 25. Nalle SC Turner JR Menetrier's disease therapy: rebooting mucosal signaling Sci Transl Med 2009 1 8ps10 10.1126/scitranslmed.3000438 20368184 26. Bradburn DM Redwood NF Venables CW Gunn A Medical therapy of Ménétrier's disease with omeprazole Digestion 1992 52 204 8 10.1159/000200954 1459354 27. Țanțu DE Dimitriu AM Becheanu G Diculescu M Gheorghe C An atypical case of Menetrier's disease with antral-duodenal extension J Gastrointestin Liver Dis 2024 33 450 10.15403/jgld-5823 39733310 28. Xiong LS Gong YY Natural history of adult-onset Ménétrier's disease: report of a case with 9-year follow-up Exp Ther Med 2016 11 2462 6 10.3892/etm.2016.3181 27284333 PMC4888005 29. Ravilla J He P Ali M Patel A Menetrier disease - a rare presentation of gastrointestinal bleeding J Community Hosp Intern Med Perspect 2024 14 57 9 10.55729/2000-9666.1377 39391104 PMC11464050 30. Parianos C Aggeli C Sourla A Zografos GN Total gastrectomy for the treatment of Menetrier's disease persistent to medical therapy: a case report Int J Surg Case Rep 2020 73 95 9 10.1016/j.ijscr.2020.06.033 32653837 PMC7355377 31. Roy S Neogi S Sr Chaturvedi A Tomar R Sr The great mimicker of gastric cancer: a case report of Ménétrier's disease Cureus 2024 16 e55076 10.7759/cureus.55076 38550419 PMC10977938 32. Pepa P Uehara T Wonaga A Redondo A Avagnina A Mazzocchi O Menetrier's disease. A diagnostic and therapeutic challenge Medicina 2021 81 470 3 34137712 33. Byun J Kwon S Oh SY Lee KG Suh YS Kong SH Laparoscopic management of hypertrophic hypersecretory gastropathy with protein loss: a case report Asian J Endosc Surg 2014 7 48 51 10.1111/ases.12062 24450343 34. Rodríguez Gonzalez O José R Génesis J Luis M Liumariel V Raquel F Robot-assisted laparoscopic gastrectomy for Menetrier's disease J Robot Surg 2015 9 257 61 10.1007/s11701-015-0512-5 26531207 35. Fukushi K Goda K Kino H Kondo M Kanazawa M Kashima K Curative resection with endoscopic submucosal dissection of early gastric cancer in Helicobacter pylori World J Gastroenterol 2022 28 594 601 10.3748/wjg.v28.i5.594 35316958 PMC8905015 36. Sundt TM 3rd Compton CC Malt RA Ménétrier's disease. A trivalent gastropathy Ann Surg 1988 208 694 701 10.1097/00000658-198812000-00004 3264139 PMC1493843 37. Mei M Jingmei N Zongming C Mei J Leimin S Diffuse type gastric carcinoma presenting as giant gastric folds: lessons learned from six miss diagnosed cases Clin Res Hepatol Gastroenterol 2012 36 505 9 10.1016/j.clinre.2012.04.009 22651965 38. Xia C Xu G Endoscopic ultrasound in the diagnosis of Ménétrier’s disease: unique contribution Rev Esp Enferm Dig 2025 10.17235/reed.2025.11012/2024 39831623 39. Guerrini GP Esposito G Magistri P Serra V Guidetti C Olivieri T Robotic versus laparoscopic gastrectomy for gastric cancer: the largest meta-analysis Int J Surg 2020 82 210 28 10.1016/j.ijsu.2020.07.053 32800976 40. Bobo Z Xin W Jiang L Quan W Liang B Xiangbing D Robotic gastrectomy versus laparoscopic gastrectomy for gastric cancer: meta-analysis and trial sequential analysis of prospective observational studies Surg Endosc 2019 33 1033 48 10.1007/s00464-018-06648-z 30719561 41. Lu J Wu D Huang JB Lin J Xu BB Xue Z Comparison of robotic versus laparoscopic versus open distal gastrectomy for locally advanced gastric cancer: a prospective trial-based economic evaluation Surg Endosc 2023 37 7472 85 10.1007/s00464-023-10147-1 37395806 42. El Chaar M Michaud A Stoltzfus J Alvarado LA Improving operating room efficiency of robotic-assisted metabolic and bariatric surgery through standardization Obes Surg 2023 33 3411 21 10.1007/s11695-023-06850-6 37804468 ",
  "metadata": {
    "Title of this paper": "Improving operating room efficiency of robotic-assisted metabolic and bariatric surgery through standardization",
    "Journal it was published in:": "Frontiers in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484214/"
  }
}