{
  "title": "Paper_158",
  "abstract": "pmc Adv Nutr Adv Nutr 1420 advannut Advances in Nutrition 2161-8313 2156-5376 American Society for Nutrition PMC12489480 PMC12489480.1 12489480 12489480 40653269 10.1016/j.advnut.2025.100472 S2161-8313(25)00108-5 100472 1 Editorial Gastrointestinal Symptoms During Cancer Therapy: The Clinician’s Role Dunn Robert rdunn4@mgb.org ⁎ Clinical Nutrition Manager, Mass General Cancer Center, Boston, MA, United States ⁎ rdunn4@mgb.org 9 2025 11 7 2025 16 9 494983 100472 2 7 2025 3 7 2025 11 07 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes For patients undergoing anticancer therapy, both treatment delay and reduction of intended dose intensity have been associated with decreased overall survival [ 1 2 3 4 5 6 Given the intersectional relationships between symptom burden, malnutrition, and treatment failure, there is an imperative for clinicians to develop approaches to managing these symptoms that are grounded in evidence. In their recent article, Alzoubi and Loman [ 7 The authors remark that a “majority” of medical nutrition therapy delivered to patients with cancer is provided “without consideration for the underlying causes of malnutrition.” If true, this would represent a profound failure among oncology nutrition professionals. Thankfully, Alzoubi and Loman’s meta-analysis offers a useful framework for assessing the potential efficacy of various nutrition interventions. Crucially, the article offers situation-specific guidance. Probiotics were found to reduce the incidence of diarrhea in patients being treated with either chemotherapy or radiation, whereas supplementation with omega-3 fatty acids was impactful only in the context of chemotherapy. Additionally, the article’s quantification of effect size (conveniently outlined in Table 3) allows clinicians to stratify interventions by potential impact. Competent nutrition professionals may integrate single nutrient supplementation where appropriate but should not consider these a panacea. Artificial intelligence tools are rapidly emerging as potential decision-making aides in oncology nutrition [ 8 This review found oral nutrition supplements were not effective tools for managing gastrointestinal symptoms. Still, future products may target specific symptoms by integrating 2 or more nutrients that were found effective in this review – a commercial beverage containing both omega-3 fatty acids and probiotics may be more effective at reducing incidence of diarrhea than currently available products. Additionally, future studies should evaluate whether the concept of food synergy is relevant for this population [ 9 Of note, the meta-analysis by Alzoubi and Loman [ 7 10 Clinicians who provide supportive care to patients during anticancer therapy should, certainly, adopt a holistic approach to nutrition counseling that goes beyond simple macronutrient delivery. Prompt identification and treatment of gastrointestinal symptoms is necessary to avoid the deleterious (and bidirectional) effects of treatment pauses and malnutrition. Author contributions The sole author was responsible for all aspects of this manuscript. Funding The author reports no funding received for this work. Conflict of interest The author reports no conflicts of interest. References 1 Hanna T.P. King W.D. Thibodeau S. Jalink M. Paulin G.A. Harvey-Jones E. Mortality due to cancer treatment delay: systematic review and meta-analysis BMJ 371 2020 m4087 10.1136/bmj.m4087 PMC7610021 33148535 2 Nielson C.M. Bylsma L.C. Fryzek J.P. Saad H.A. Crawford J. Relative dose intensity of chemotherapy and survival in patients with advanced stage solid tumor cancer: a systematic review and meta-analysis Oncologist 26 9 2021 e1609 e1618 10.1002/onco.13822 33973301 PMC8417866 3 Klepin H.D. Sun C.L. Smith D.D. Elias R. Trevino K.M. Bryant A.L. Predictors of unplanned hospitalizations among older adults receiving cancer chemotherapy JCO Oncol. Pract. 17 6 2021 e740 e752 10.1200/OP.20.00681 33881905 PMC8258152 4 Jensen G.L. Cederholm T. The malnutrition overlap syndromes of cachexia and sarcopenia: a malnutrition conundrum Am. J. Clin. Nutr. 108 6 2018 1157 1158 10.1093/ajcn/nqy314 30541095 5 Arends J. Baracos V. Bertz H. Bozzetti F. Calder P.C. Deutz N.E.P. ESPEN expert group recommendations for action against cancer-related malnutrition Clin. Nutr. 36 5 2017 1187 1196 10.1016/j.clnu.2017.06.017 28689670 6 Yin L. Chong F. Huo Z. Li N. Liu J. Xu H. GLIM-defined malnutrition and overall survival in cancer patients: a meta-analysis J. Parenter. Enteral. Nutr. 47 2 2023 207 219 https://doi.org/ 10.1002/jpen.2463 PMC10107432 36371641 7 Alzoubi Z. Loman B.R. Nutrition Interventions in the Treatment of Gastrointestinal Symptoms during Cancer Therapy: A Systematic Review and Meta-Analysis Adv Nutr 2025 10.1016/j.advnut.2025.100485 Published online July 22, 2025 40706958 8 Sguanci M. Palomares S.M. Cangelosi G. Petrelli F. Sandri E. Ferrara G. Artificial intelligence in the management of malnutrition in cancer patients: a systematic review Adv. Nutr. 2025 100438 10.1016/j.advnut.2025.100438 PMC12281439 40334987 9 Jacobs D.R. Gross M.D. Tapsell L.C. Food synergy: an operational concept for understanding nutrition Am. J. Clin. Nutr. 89 5 2009 1543S 1548S 10.3945/ajcn.2009.26736B 19279083 PMC2731586 10 Ligibel J.A. Bohlke K. May A.M. Clinton S.K. Demark-Wahnefried W. Gilchrist S.C. Exercise, diet, and weight management during cancer treatment: ASCO guideline J. Clin. Oncol. 40 22 2022 2491 2507 10.1200/JCO.22.00687 35576506 ",
  "metadata": {
    "Title of this paper": "Exercise, diet, and weight management during cancer treatment: ASCO guideline",
    "Journal it was published in:": "Advances in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489480/"
  }
}