{
  "title": "Paper_1148",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467848 PMC12467848.1 12467848 12467848 41007740 10.3390/biomedicines13092177 biomedicines-13-02177 1 Review Dysregulated Intracellular Signaling in the Pathogenesis of Vitiligo: An Update on Emerging Therapeutic Strategies https://orcid.org/0009-0000-6640-7418 Marrapodi Ramona † Marini Alberto † https://orcid.org/0000-0002-3883-5500 Bellei Barbara * Kim Dae Joon Academic Editor Laboratory of Cutaneous Physiopathology, Integrated Center of Metabolomics Research, San Gallicano Dermatological Institute, IRCCS, 00144 Rome, Italy; ramona.marrapodi@ifo.it alberto.marini@ifo.it * barbara.bellei@ifo.it † These authors contributed equally to this work. 05 9 2025 9 2025 13 9 497614 2177 29 5 2025 14 8 2025 03 9 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Vitiligo is an acquired depigmentation disorder characterized by the selective destruction of melanocytes, resulting in the progressive loss of pigment in the skin and hair. This condition frequently leads to significant psychological distress. Its pathogenesis is complex and multifactorial, involving a combination of genetic susceptibility, metabolic derangement related to oxidative stress, defective melanocyte adhesion to the basal epidermis, and dysregulated innate and adaptive immune responses, ultimately converging in the targeted elimination of melanocytes. Despite the availability of several therapeutic modalities, current corrective options are often limited in efficacy and are associated with high relapse rates. There remains a pressing need for novel, safe, and more effective therapeutic strategies to improve patients’ quality of life. Growing evidence indicates that the immune system plays a pivotal role in vitiligo onset and progression, as most triggers converge on inflammatory and autoimmune pathways targeting melanocytes. However, immunosuppressive therapies alone have shown limited effectiveness in halting disease progression and achieving lasting repigmentation. Targeting only immunological processes without addressing the underlying triggers of their activation likely represents a significant limitation in restoring pigmentation. In contrast, interventions aimed at upstream events may help prevent the initiation of the immune response. Consequently, combinatorial therapeutic approaches that target multiple pathogenic pathways and incorporate diverse pharmacological agents are being explored to improve clinical outcomes. This review aims to re-evaluate the intrinsic cellular abnormalities and associated dysregulated signaling pathways in vitiligo, with the goal of identifying novel, effective, nonimmunological treatment strategies. vitiligo melanocytes pigmentation skin Italian Ministry of Health (MoH), PNRR-MCNT2-2023-12377707 Ricerca Corrente RC2025 This work was supported by project grants from the Italian Ministry of Health (MoH), PNRR-MCNT2-2023-12377707 and Ricerca Corrente RC2025. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Epidermal melanocytes are specialized pigment-producing cells derived from the neural crest, located in the basal layer of the epidermis, where they play a central role in skin pigmentation and photoprotection. Melanocytes synthesize melanin within specialized organelles called melanosomes through a multi-step enzymatic process that begins with the oxidation of tyrosine, catalyzed by tyrosinase. The two primary forms of melanin produced are eumelanin (brown/black) and pheomelanin (red/yellow), which vary depending on genetic and environmental factors. Once produced, melanin is transferred to surrounding keratinocytes, where it contributes to skin pigmentation and protects against ultraviolet (UV) radiation [ 1 2 3 4 During life, the phenotype of cutaneous pigmentation changes within the range of non-pathological conditions, as a function of age, the environmental exposome, trauma, diet, and drug use. However, occasionally in life, individuals may develop skin pigmentation disorders, which can arise unexpectedly and impact both appearance and quality of life. Pigmentary disorders are generally classified as either hypopigmentation or hyperpigmentation and can result from genetic mutations or acquired conditions. Acquired pigmentary abnormalities may present as localized lesions or diffuse skin involvement and include conditions such as vitiligo, melasma, and post-inflammatory hypopigmentation [ 5 Vitiligo is the most common depigmenting disorder, affecting 0.1–2% of the population worldwide without differences related to skin phototype [ 6 7 8 9 10 The pathogenesis of vitiligo is not fully understood, but it is thought to be intricate, involving genetic components, metabolic factors linked to cellular oxidative stress, defects in melanocyte adhesion to the epidermis, and immunity (innate and adaptive), which culminate in selective melanocyte destruction ( Figure 1 11 However, none of these mechanisms alone fully explain the process of melanocyte disappearance, indicating that the disease is multifactorial. Correspondingly, treatment of vitiligo is challenging, with great variability in terms of disease extent, distribution, and activity [ 12 13 14 + 15 This review presents and analyzes both experimental and clinical data supporting the therapeutic targeting of intracellular pathways in melanocytes. Emphasis is placed on early initiating factors in vitiligo pathogenesis, such as oxidative stress and metabolic dysfunction, which may offer strategic entry points for intervention. The discussion also explores potential future therapeutic developments aimed at restoring melanocyte function and improving disease outcomes. 2. Targeting Vitiligo-Impaired Redox Defense Network Reactive oxygen species (ROS) are free radicals derived from molecular oxygen, including superoxide anion (O 2 − 2 2 16 17 18 19 20 21 22 23 24 21 25 26 27 2.1. Clinical and Experimental Evidence Supporting Oxidative Stress Targeting in Vitiligo The central role of oxidative stress in the onset and progression of vitiligo is amply documented ( Figure 2 6 28 29 Loss of oxidative equilibrium in vitiligo skin is demonstrated by extensive accumulations of H 2 2 30 31 32 33 34 35 36 37 The persistence of oxidative disequilibrium in vitiligo melanocytes leads to sustained activation of antioxidant enzyme gene expression at the mRNA level [ 38 38 39 2 2 2 2 40 41 42 43 44 45 42 46 2.1.1. Melanocytes Are Intrinsically Prone to Lose Oxidative Equilibrium In addition to extrinsic sources, ROS production in melanocytes can also arise from a lineage-specific intrinsic propensity associated with the melanogenic biosynthetic pathway, which consumes large amounts of adenosine triphosphate (ATP) and requires lipid resources for the assembly of melanosomes, lysosome-derived organelles dedicated to the synthesis, storage, and transport of melanin [ 47 48 49 50 51 34 34 52 53 54 55 56 2.1.2. Oxidative Stress-Related Intracellular Damage At high concentration, ROS destroy melanocyte biology in all aspects, including damage to DNA, lipids, proteins, and metabolites both structurally and functionally. Advanced oxidation protein products (AOPPs), peroxidated lipids, propanediol, and 8-hydroxy-2-deoxyguanosine (8-OHdG) are markers of vitiligo progression [ 57 58 59 59 38 60 61 62 63 63 64 65 Additionally, ROS-induced oxidative stress progressively triggers abnormal organelle functions, disrupts metabolic pathways, and weakens the protective mechanisms against further oxidative agents [ 66 2 2 67 2 2 67 68 69 INK4A 70 38 71 72 73 74 75 76 77 78 79 80 81 82 83 63 84 84 A relevant consequence of oxidative stress in vitiligo is the accretion of unfolded/misfolded proteins in the endoplasmic reticulum (ER), which activates the unfolded protein response (UPR) to restore cellular homeostasis [ 85 86 87 88 89 The amino acid metabolite homocysteine, whose levels are highly increased in vitiligo patients at progressive stages, has been demonstrated to induce the death of melanocytes associated with vitiligo by triggering ER stress and activating the UPR in a ROS-dependent manner [ 90 91 92 93 2.2. Clinical Trials Supporting the Relevance of Impaired Redox Equilibrium in Vitiligo Supplementation with antioxidants has gained attention in vitiligo treatment. These include enzymes, and a series of small molecules like vitamins and minerals that help to protect cells from damage caused by free radicals. All these strategies have been proposed for topical or systemic treatment of vitiligo, yielding promising results [ 94 Table 1 2.2.1. Clinical Trials Involving Vitamin Supplementation Among strategies, vitamin D, vitamin C, vitamin E, lipoic acid, α-tocopherol, and selenium supplementation [ 95 96 96 97 98 99 100 101 102 103 2.2.2. Clinical Trials Involving Antioxidant Supplementation Extract of Polypodium Leucotomos (PL), a tropical fern, with free radical quenching capacity potentiates the narrow-band (NB) UVB repigmentation capacity [ 104 105 106 Replacement of nonfunctional CAT with cream containing pseudocatalase (a compound designed to mimic the activity of the natural enzyme catalase) represents an additional therapeutic antioxidant strategy. Topical application of pseudocatalase (PC-KUS) combined with its activation by NB-UVB radiation or natural sun has shown contrasting data, with some studies reporting benefits and others showing limited or no significant therapeutic effects [ 107 108 109 110 111 112 Lastly, trace elements such as copper and selenium, even if barely present in humans, are important for protection of cells from free radicals, and their integration has been proposed by some clinical studies, even if change in the serum concentration of these elements in patients with vitiligo is still debated [ 113 37 Although antioxidant therapy shows promise in treating vitiligo, it is often considered as part of a broader treatment approach, alongside other therapies such as phototherapy, immunosuppressants, and melanocyte transplantation. 3. Proliferation, Cell Death, and Senescence Accelerated cell death of mature melanocytes, faint mobilization, proliferation, and differentiation of melanocyte stem cell populations, and the occurrence of premature senescence have been all implicated in vitiligo. Designing pharmacological compounds that can specifically target these activities has been widely proposed to achieve complete durable pigment recovery in vitiligo patients. 3.1. Stimulating Precursor Melanocyte Mobilization, Proliferation, and Differentiation Epidermal melanocytes are normally slowly dividing cells, even if wounding and UV exposure might intermittently stimulate melanocyte lineage mitotic activity. Repigmentation of vitiligo requires an increase in the number and migration of melanocytes into the depigmented epidermis. This could be realized by stimulating resident melanocyte precursors localized within the niche in the bulge of the hair follicle [ 114 115 116 117 118 119 Reduction in fibroblast-derived growth factors that support melanocytes’ normal activities may play a role in the development of vitiligo. In vitiligo lesions, the levels of basic fibroblast growth factor (bFGF), stem cell factor (SCF), endothelin-1 (ET-1), granulocyte–macrophage colony-stimulating factor (GM-CSF), and α-MSH, which are released by keratinocytes and fibroblasts, are lower in the skin and blood of patients compared to healthy controls [ 120 121 122 123 124 125 126 127 Table 1 128 129 130 131 38 74 132 133 3.2. Targeting Melanocyte Cell Death In certain circumstances, several cellular insults reported in vitiligo cells might converge on melanocyte death. In line with this principle, persistent melanocyte damage might accelerate the turnover of this type of cell, leading to premature melanocyte stem cell exhaustion and limited regeneration capacity. Thus, protecting pigment cells from death might be important to stabilize disease progression and preserve repigmentation capacity. Cell death may occur through multiple types of well-regulated overlapping, but not identical, modalities including apoptosis, necroptosis, pyroptosis, and autophagy, all documented in vitiligo ( Figure 3 3.2.1. Apoptosis Apoptosis is a tightly regulated type of cell death mechanism characterized by an ordered sequence of events involving caspases, which lead to the cleavage of various proteins with distinct functions [ 134 6 135 136 137 138 139 2 2 140 An interesting link between apoptosis and impaired mitochondrial dynamics in vitiligo melanocytes emerged in a study proving excessive optic atrophy 1 (OPA1)-dependent inner membrane fusion, loss of normal cristae shape and resultant mitochondrial fragmentation associated with increased Bax expression, cytochrome c release from mitochondria to the cytoplasm, and activation of caspase 9, which ultimately triggers the intrinsic apoptotic program [ 141 142 143 144 139 115 145 146 120 121 Several studies proposed that deficient adhesion contributes to the disappearance of melanocytes in vitiligo through anoikis, a form of apoptosis triggered by the loss of anchorage to the extracellular matrix and neighboring cells. Adhesion defects involving β1-integrin, cadherins, laminin, aquaporin-3 (AQP3), discoidin domain receptor tyrosine kinase 1 (DDR1), and vascular cell adhesion molecule-1 (VCAM-1) have been documented both in vivo and in vitro [ 147 148 149 150 151 139 139 152 152 153 In addition to their intrinsic propensity toward self-destruction, vitiligo melanocytes exhibit a markedly reduced ability to defend themselves against T cell-mediated attacks by engaging immunotolerance mechanisms. Unlike other skin cell populations, such as keratinocytes and fibroblasts, vitiligo melanocytes fail to upregulate the immunosuppressive membrane molecule programmed death-ligand 1 (PD-L1) in response to autoreactive T cells, thereby increasing their susceptibility to apoptotic insults [ 154 134 6 155 156 157 157 158 159 160 3.2.2. Necroptosis Fas activation is also involved in necroptosis, a form of programmed cell death resembling necrosis. Necroptotic cells undergo marked morphological changes due to loss of plasma membrane integrity and release of intracellular contents, making this process highly immunogenic. This characteristic renders this type of cell death highly immunogenic. Necroptosis has been strongly linked to vitiligo, as melanocytes from perilesional skin affected by vitiligo show significant augmented phosphorylated receptor-interacting protein kinase 3 (RIP3) and phosphorylated mixed lineage kinase domain-like protein (MLKL), both key markers of necroptosis [ 161 162 163 164 3.2.3. Pyroptosis Another inflammatory form of cell death is pyroptosis. Pyroptosis is a newly discovered modality of programmed cell death that is mediated by pyroptotic caspases. This process triggers rapid rupture of the plasma membrane and initiates the release of pro-inflammatory intracellular contents. As both necroptosis and pyroptosis are lytic forms of cell death, they result in the uncontrolled release of inflammatory mediators such as high-mobility group box 1 (HMGB1), interleukin-33 (IL-33), and S100 alarmin proteins—all of which have been reported as markers associated with vitiligo [ 165 166 3.2.4. Ferroptosis Dysregulation of iron metabolism and phospholipid peroxidation leads to toxic accumulation of ROS and triggers ferroptosis, an iron-dependent pro-inflammatory cell death modality. GPX4 is considered a key marker of ferroptosis due to its key role in catalyzing lipid peroxide reduction, which prevents the oxidation of membrane lipid components [ 167 168 169 170 171 3.2.5. Parthanatos Parthanatos is a form of regulated cell death based on DNA damage and hyperactivated poly (ADP-ribose) polymerase 1 (PARP1) [ 172 173 174 175 176 177 3.2.6. Autophagy-Related Death Autophagy is a complex catabolic process used by eukaryotic cells during stress conditions to resist energy by macromolecule recycling and to eliminate nonfunctional organelles [ 178 179 180 181 Several studies have implicated deregulated autophagy in vitiligo, reporting both overactive and reduced function. Both conditions may contribute to melanocyte loss, as autophagy deficiency impairs energy recovery, inhibits melanocyte proliferation, and leads to premature growth arrest and accumulation of damaged molecules [ 182 183 180 182 184 185 130 The conversion of LC3I into LC3II, being an indicator of autophagic vacuole closure, is considered a standard marker for autophagosome biogenesis. LC3II has been documented by several in vitro studies of vitiligo [ 130 186 187 183 Conversely, autophagy dysfunction in melanocytes impairs their proliferative capacity and disrupts Nrf2 signaling, leading to a compromised antioxidant defense system [ 179 Yang and collaborators reported “Autophagy” as the most enriched pathway with a prediction of an inhibitory signature associated, at the protein level, with high p62 expression and a low LC3II/LC3I ratio in vitiligo lesional skin [ 188 189 190 Reduced mitophagy, a selective autophagic process involved in mitochondrial quality control, has been observed in melanocytes derived from vitiligo patients, potentially leading to the accumulation of dysfunctional mitochondria. It has been proposed that in vitiligo, the clearance of damaged mitochondria via mitophagy is impaired due to elevated p53 activity, which is triggered by increased hydrogen peroxide levels. As a result, these defective mitochondria persist in generating ROS, thereby exacerbating oxidative stress and ultimately initiating apoptosis, through either the release of mitochondrial cytochrome c or the recruitment of cytotoxic T cells [ 187 Interestingly, a correlation has been reported between the mRNA expression levels of mitophagy-related genes and immune cell infiltration in vitiligo-affected skin [ 188 Overall, an enormous quantity of data has proven deregulated cell death in vitiligo melanocytes. However, whether vitiligo melanocytes are more prone to unjustified cell death or whether vitiligo melanocytes are spontaneously highly damaged cells and consequently predisposed to accelerated turnover is not clear. In both cases, the possibility of targeting melanocyte cell death in vitiligo patients is relevant due to the possible release of neoantigens and consequent immune cell engagement. 3.3. Targeting Premature Senescence Pathways in Vitiligo In the pathogenic landscape of vitiligo, the accumulation of senescent cells and the presence of senescence markers are diffuse traits of the epidermis and the dermis [ 74 74 38 74 191 38 192 193 194 195 196 197 198 199 200 201 202 197 4. Alterations of Metabolism in Vitiligo Melanocytes Intracellular metabolism refers to the series of biochemical processes occurring within a cell to maintain its functions and sustain life. This complex network includes interconnected pathways responsible for nutrient breakdown to produce energy, molecule synthesis for cell growth and repair, and the regulation of various metabolic activities. Major intracellular metabolic pathways include glycolysis, the pentose phosphate pathway, and mitochondrial metabolism (oxidative phosphorylation). Intracellular metabolism is tightly regulated to maintain cellular homeostasis and adapt to changing environmental conditions. It also acquires specific characteristics depending on cell type, as different cells exhibit distinct metabolic profiles tailored to their functions and energy requirements. For instance, keratinocytes focus on rapid proliferation and differentiation, utilizing glycolysis for energy to support their role in forming a protective barrier. In contrast, dermal cells, such as fibroblasts, engage in a more complex metabolism, relying on oxidative phosphorylation to generate ATP for collagen and elastin synthesis, which are essential for skin structure and elasticity. Additionally, dermal cells are involved in the metabolism of various growth factors and cytokines, contributing to skin repair and immune responses. This metabolic divergence reflects their distinct functions in maintaining skin health and integrity. Melanocytes primarily rely on aerobic metabolism to produce energy, utilizing glucose and fatty acids to support their functions in melanin and melanosome production and cellular maintenance. Melanocytes also synthesize various antioxidants to combat oxidative stress induced by UV exposure. Additionally, they possess a unique metabolic pathway that converts tyrosine into melanin, a pigment essential for protecting the skin from UV-induced damage. In the pathogenesis of vitiligo, alterations of cell metabolism play a crucial role in determining the “intrinsic defect” underlying melanocyte damage ( Figure 4 6 155 156 In the epidermis, lipid production stands apart for its amount and heterogeneity due to production for efficient skin barrier formation. Discordant data have been reported concerning stratum corneum hydration in vitiligo-depigmented skin, but decreased hydration and elasticity and an increase in sebum production have been observed in lesions treated with phototherapy compared to untreated depigmented skin [ 203 204 203 196 205 206 196 207 Basal intracellular melanocytes’ metabolism is finely regulated, and it is fully integrated in the synthesis of melanin pigments [ 208 209 209 210 211 212 211 52 213 214 215 In terms of energetic metabolism, an adequate supply of ATP is of pivotal importance in melanocytes to cope with stress conditions and to fuel melanin biosynthesis. Compared to normal melanocytes, vitiligo melanocytes show reduced ATP production due to defective mitochondrial respiration, which serves as both a cause and a consequence of elevated ROS production. As a compensatory mechanism for energy production, some glycolytic enzymes (hexokinase 2, HK2; pyruvate dehydrogenase kinase 1, PDHK1; pyruvate kinase M2, PKM2) are upmodulated in vitiligo melanocytes [ 81 According to reduced ATP levels, vitiligo melanocytes display hyperphosphorylation and activation of the primary kinase involved in nutrient sensing, AMPK [ 186 216 186 217 Alterations in melanin biosynthesis have been observed in melanocytes from vitiligo patients [ 1 214 Moreover, the pro-oxidant environment characteristic of vitiligo has been shown to chemically oxidize the catalytic site of dihydropteridine reductase (DHPR), resulting in its inactivation. In this form, DHPR is unable to regenerate the essential cofactor (6R)-L-erythro-5,6,7,8-tetrahydrobiopterin (6BH4), which is critical for TYR-mediated hydroxylation of L-tyrosine. This leads to impaired melanin synthesis [ 215 Finally, a noteworthy crosstalk between aberrant signaling of the pro-inflammatory cytokine TNFα and melanin biosynthesis has been described by Singh et al. Their study demonstrated that TNFα exposure reduces MITF and TYR expression in melanocytes, resulting in decreased melanin content [ 216 Collectively, these findings indicate a reduction in lineage-specific melanocyte function, which may predict or contribute to melanocyte loss in vitiligo. Lipid profiles of vitiligo melanocytes and PBMCs differ from those of healthy controls. Lipid peroxidation and an altered pattern of cardiolipin distribution in the plasma and inner mitochondrial membrane have been observed, and they are associated with an increased level of cholesterol and greater expression of the cholesterol biosynthesis enzyme 3-hydroxy-3methyl-glutaryl-CoenzymeA-reductase (HMG-CoA reductase) [ 33 218 219 220 Keratinocytes isolated from normally pigmented skin of vitiligo patients exhibit altered lipid metabolism, characterized by impaired upregulation of key enzymes involved in the ceramide biosynthetic pathway following calcium-induced differentiation. This defect disrupts the differentiation process and may compromise the integrity of the skin barrier [ 82 Several studies have also demonstrated the critical role of the insulin-like growth factor receptor (IGFR) and its downstream signaling pathways in regulating keratinocyte proliferation, differentiation, and survival [ 221 Very recently, we provided evidence of Ins/IGF-1 resistance at the cellular level involving melanocytes, keratinocytes, and fibroblasts of vitiligo patients. In vitiligo cells, IGF-1 and insulin stimulation contributes to the aggravation of the energetic imbalance, a condition that promotes excessive glucose import responsible for nonenzymatic overproduction of advanced glycation end products (AGEs). Keratinocytes appeared to be particularly sensitive to glucotoxicity, as evidenced by the marked rise in ROS and pro-inflammatory molecules [ 130 130 Cellular metabolic impairments described at the cellular level correspond to systemic alterations which resemble the spectrum of metabolic syndrome. Different studies converge in reporting systemic dyslipidemia and hyperglycemia in vitiligo patients [ 222 223 224 224 170 From the epidemiological point of view, there is increasing evidence that individuals with vitiligo may have a higher prevalence of metabolic syndrome [ 170 225 226 227 227 226 228 Overall, these findings reveal profound alteration of multiple different metabolic pathways in vitiligo, contributing to melanocyte loss and underlying a systemic metabolic impairment in patients. Evidence for therapeutic strategies to correct vitiligo by metabolic approaches and existing clinical trials are summarized in Table 1 5. Conclusions Vitiligo remains challenging to cure. Although cosmetic repigmentation can be achieved, success rates are generally low, and disease flare-ups are common even after clinical stabilization [ 228 229 230 In this review, we have discussed the principal mechanisms contributing to vitiligo pathogenesis: (i) oxidative stress, acting as a central hub that initiates and amplifies multiple pathological pathways; (ii) synergic cell death mechanisms, such as apoptosis, necroptosis, and autophagy, collectively driving melanocyte destruction; (iii) senescence, impairing cell function and promoting local immune activation; (iv) metabolic dysfunction, leading to chronic disruption of cellular homeostasis and offering opportunities for targeted therapeutic interventions through molecular profiling. Advancing our mechanistic understanding of these interconnected processes opens promising avenues for the development of personalized treatment strategies. Such precision medicine approaches may not only halt or reverse disease progression but also improve clinical outcomes by addressing the molecular heterogeneity of vitiligo. Continued research into these core mechanisms is essential to translate basic scientific insights into effective, patient-tailored therapies. Acknowledgments Image adapted from Servier Medical Art ( https://smart.servier.com/ https://creativecommons.org/licenses/by/4.0/ Disclaimer/Publisher’s Note: Author Contributions Conceptualization: B.B. Writing—original draft: R.M. and A.M. Writing, review and editing: B.B. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Nordlund J.J. The melanocyte and the epidermal melanin unit: An expanded concept Dermatol. Clin. 2007 25 271 281 10.1016/j.det.2007.04.001 17662893 2. Li A. The biology of melanocyte and melanocyte stem cell Acta Biochim. Biophys. Sin. 2014 46 255 260 10.1093/abbs/gmt145 24449785 3. Slominski A. Neuroendocrine activity of the melanocyte Exp. Dermatol. 2009 18 760 763 10.1111/j.1600-0625.2009.00892.x 19558501 PMC2773661 4. Hsu Y.-C. Fuchs E. Building and Maintaining the Skin Cold Spring Harb. Perspect. Biol. 2022 14 a040840 10.1101/cshperspect.a040840 34607830 PMC8977401 5. Wang R.F. Ko D. Friedman B.J. Lim H.W. Mohammad T.F. Disorders of hyperpigmentation. Part I. Pathogenesis and clinical features of common pigmentary disorders J. Am. Acad. Dermatol. 2023 88 271 288 10.1016/j.jaad.2022.01.051 35151757 6. Picardo M. Dell’Anna M.L. Ezzedine K. Hamzavi I. Harris J.E. Parsad D. Taieb A. Vitiligo Nat. Rev. Dis. Primers 2015 1 15011 10.1038/nrdp.2015.11 27189851 7. Frisoli M.L. Essien K. Harris J.E. Vitiligo: Mechanisms of Pathogenesis and Treatment Annu. Rev. Immunol. 2020 38 621 648 10.1146/annurev-immunol-100919-023531 32017656 8. Mastacouris N. Strunk A. Garg A. Incidence and Prevalence of Diagnosed Vitiligo According to Race and Ethnicity, Age, and Sex in the US JAMA Dermatol. 2023 159 986 990 10.1001/jamadermatol.2023.2162 37466934 PMC10357354 9. Joge R.R. Kathane P.U. Joshi S.H. Vitiligo: A Narrative Review Cureus 2022 14 e29307 10.7759/cureus.29307 36304341 PMC9586189 10. Dabas G. Vinay K. Parsad D. Kumar A. Kumaran M.S. Psychological disturbances in patients with pigmentary disorders: A cross-sectional study J. Eur. Acad. Dermatol. Venereol. 2020 34 392 399 10.1111/jdv.15987 31566833 11. Bergqvist C. Ezzedine K. Vitiligo: A focus on pathogenesis and its therapeutic implications J. Dermatol. 2021 48 252 270 10.1111/1346-8138.15743 33404102 12. Pathak G.N. Tan I.J. Bai G. Dhillon J. Rao B.K. Vitiligo: From mechanisms of disease to treatable pathways Ski. Health Dis. 2024 4 e460 10.1002/ski2.460 PMC11608881 39624766 13. Pala V. Ribero S. Quaglino P. Mastorino L. Updates on Potential Therapeutic Approaches for Vitiligo: Janus Kinase Inhibitors and Biologics J. Clin. Med. 2023 12 7486 10.3390/jcm12237486 38068541 PMC10707156 14. Kang C. Ruxolitinib Cream 1.5%: A Review in Non-Segmental Vitiligo Drugs 2024 84 579 586 10.1007/s40265-024-02027-2 38625661 PMC11189965 15. Liu K. Zhou L. Shi M. Cong T. Yang X. Zhou X. Cheng M. Ma C. Yao S. Ying P. JAK inhibitors in immune regulation and treatment of vitiligo Cytokine Growth Factor. Rev. 2024 80 87 96 10.1016/j.cytogfr.2024.11.002 39567266 16. Halliwell B. Free Radicals and other Reactive Species in Disease Encycl. Life Sci. 2005 7 381 387 10.1002/9780470015902.a0002269.pub3 17. Kohen R. Nyska A. Invited review: Oxidation of biological systems: Oxidative stress phenomena, antioxidants, redox reactions, and methods for their quantification Toxicol. Pathol. 2002 30 620 650 10.1080/01926230290166724 12512863 18. Phaniendra A. Jestadi D.B. Periyasamy L. Free radicals: Properties, sources, targets, and their implication in various diseases Indian. J. Clin. Biochem. 2015 30 11 26 10.1007/s12291-014-0446-0 25646037 PMC4310837 19. de Almeida A.J.P.O. de Oliveira J.C.P.L. da Silva Pontes L.V. de Souza Junior J.F. Goncalves T.A.F. Dantas S.H. de Almeida Feitosa M.S. Silva A.O. de Medeiros I.A. ROS: Basic Concepts, Sources, Cellular Signaling, and its Implications in Aging Pathways Oxidative Med. Cell. Longev. 2022 2022 1225578 10.1155/2022/1225578 PMC9605829 36312897 20. Averill-Bates D. Reactive oxygen species and cell signaling. Review Biochim. Biophys. Acta Mol. Cell Res. 2024 1871 119573 10.1016/j.bbamcr.2023.119573 37949302 21. Brieger K. Schiavone S. Miller F.J. Jr. Krause K.-H. Reactive oxygen species: From health to disease Swiss Med. Wkly. 2012 142 w13659 10.4414/smw.2012.13659 22903797 22. Kehrer J.P. Klotz L.-O. Free radicals and related reactive species as mediators of tissue injury and disease: Implications for Health Crit. Rev. Toxicol. 2015 45 765 798 10.3109/10408444.2015.1074159 26610815 23. Jomova K. Raptova R. Alomar S.Y. Alwasel S.H. Nepovimova E. Kuca K. Valko M. Reactive oxygen species, toxicity, oxidative stress, and antioxidants: Chronic diseases and aging Arch. Toxicol. 2023 97 2499 2574 10.1007/s00204-023-03562-9 37597078 PMC10475008 24. Martemucci G. Costagliola C. Mariano M. D’andrea L. Napolitano P. D’Alessandro A.G. Free radical properties, source and targets, antioxidant consumption and health Oxygen 2022 2 48 78 10.3390/oxygen2020006 25. Qian H. Shan Y. Gong R. Lin D. Zhang M. Wang C. Wang L. Mechanism of action and therapeutic effects of oxidative stress and stem cell-based materials in skin aging: Current evidence and future perspectives Front. Bioeng. Biotechnol. 2023 10 1082403 10.3389/fbioe.2022.1082403 36698629 PMC9868183 26. Papaccio F. D'Arino A. Caputo S. Bellei B. Focus on the Contribution of Oxidative Stress in Skin Aging Antioxidants 2022 11 1121 10.3390/antiox11061121 35740018 PMC9220264 27. Iqbal M.J. Kabeer A. Abbas Z. Siddiqui H.A. Calina D. Sharifi-Rad J. Cho W.C. Interplay of oxidative stress, cellular communication and signaling pathways in cancer Cell Commun. Signal. 2024 22 7 10.1186/s12964-023-01398-5 38167159 PMC10763046 28. Glassman S.J. Vitiligo, reactive oxygen species and T-cells Clin. Sci. 2011 120 99 120 10.1042/CS20090603 20958268 29. Chang W.-L. Ko C.-H. The Role of Oxidative Stress in Vitiligo: An Update on Its Pathogenesis and Therapeutic Implications Cells 2023 12 936 10.3390/cells12060936 36980277 PMC10047323 30. Schallreuter K.U. Moore J. Wood J.M. Beazley W.D. Gaze D.C. Tobin D.J. Marshall H.S. Panske A. Panzig E. Hibberts N.A. In vivo and in vitro evidence for hydrogen peroxide (H 2 2 J. Investig. Dermatol. Symp. Proc. 1999 4 91 96 10.1038/sj.jidsp.5640189 10537016 31. Schallreuter K.U. Moore J. Wood J.M. Beazley W.D. Peters E.M. Marles L.K. Behrens-Williams S.C. Dummer R. Blau N. Thony B. Epidermal H 2 2 4 4 J. Investig. Dermatol. 2001 116 167 174 10.1046/j.1523-1747.2001.00220.x 11168813 32. Spencer J.D. Gibbons N.C.J. Rokos H. Peters E.M.J. Wood J.M. Schallreuter K.U. Oxidative stress via hydrogen peroxide affects proopiomelanocortin peptides directly in the epidermis of patients with vitiligo J. Investig. Dermatol. 2007 127 411 420 10.1038/sj.jid.5700538 16946714 33. Dell’Anna M.L. Ottaviani M. Bellei B. Albanesi V. Cossarizza A. Rossi L. Picardo M. Membrane lipid defects are responsible for the generation of reactive oxygen species in peripheral blood mononuclear cells from vitiligo patients J. Cell Physiol. 2010 223 187 193 10.1002/jcp.22027 20049874 34. Briganti S. Caron-Schreinemachers A.D.B. Picardo M. Westerhof W. Anti-oxidant defence mechanism in vitiliginous skin increases with skin type J. Eur. Acad. Dermatol. Venereol. 2012 26 1212 1219 10.1111/j.1468-3083.2011.04343.x 22081894 35. Mulayim M.K. Kurutas E.B. Nazik H. Ozturk P. Assessment of Oxidative/Nitrosative Stress and Raftlin in Vitiligo Indian J. Dermatol. 2022 67 624 10.4103/ijd.ijd_917_20 PMC9971769 36865862 36. Mathachan S.R. Khurana A. Gautam R.K. Kulhari A. Sharma L. Sardana K. Does oxidative stress correlate with disease activity and severity in vitiligo? An analytical study J. Cosmet. Dermatol. 2021 20 352 359 10.1111/jocd.13499 32422682 37. Iraji F. Seyedyousefi S. Heidari A. Serum vitamins and trace elements in vitiligo patients: A systematic review and meta-analysis of observational studies JEADV Clin. Pract. 2024 3 1430 1446 10.1002/jvc2.432 38. Bellei B. Pitisci A. Ottaviani M. Ludovici M. Cota C. Luzi F. Dell’Anna M.L. Picardo M. Vitiligo: A possible model of degenerative diseases PLoS ONE 2013 8 e59782 10.1371/journal.pone.0059782 23555779 PMC3608562 39. Akterin S. Cowburn R.F. Miranda-Vizuete A. Jimenez A. Bogdanovic N. Winblad B. Cedazo-Minguez A. Involvement of glutaredoxin-1 and thioredoxin-1 in beta-amyloid toxicity and Alzheimer’s disease Cell Death Differ. 2006 13 1454 1465 10.1038/sj.cdd.4401818 16311508 40. Jian Z. Li K. Song P. Zhu G. Zhu L. Cui T. Liu B. Tang L. Wang X. Wang G. Impaired activation of the Nrf2-ARE signaling pathway undermines H 2 2 J. Investig. Dermatol. 2014 134 2221 2230 10.1038/jid.2014.152 24662764 41. Le Y. Geng M.-M. Dong B.-Q. Luo L.-F. Jiang S. Le Poole I.C. Lei T.-C. Increased splicing of CXCR3 isoform B (CXCR3B) by impaired NRF2 signaling leads to melanocyte apoptosis in active vitiligo Free Radic. Biol. Med. 2024 225 687 698 10.1016/j.freeradbiomed.2024.10.303 39471971 42. Rashighi M. Agarwal P. Richmond J.M. Harris T.H. Dresser K. Su M.-W. Zhou Y. Deng A. Hunter C.A. Luster A.D. CXCL10 is critical for the progression and maintenance of depigmentation in a mouse model of vitiligo Sci. Transl. Med. 2014 6 223ra23 10.1126/scitranslmed.3007811 PMC4086941 24523323 43. Boniface K. Jacquemin C. Darrigade A.-S. Dessarthe B. Martins C. Boukhedouni N. Vernisse C. Grasseau A. Thiolat D. Rambert J. Vitiligo Skin Is Imprinted with Resident Memory CD8 T Cells Expressing CXCR3 J. Investig. Dermatol. 2018 138 355 364 10.1016/j.jid.2017.08.038 28927891 44. Shah F. Patel S. Begum R. Dwivedi M. Emerging role of Tissue Resident Memory T cells in vitiligo: From pathogenesis to therapeutics Autoimmun. Rev. 2021 20 102868 10.1016/j.autrev.2021.102868 34118458 45. Richmond J.M. Masterjohn E. Chu R. Tedstone J. Youd M.E. Harris J.E. CXCR3 Depleting Antibodies Prevent and Reverse Vitiligo in Mice J. Investig. Dermatol. 2017 137 982 985 10.1016/j.jid.2016.10.048 28126463 46. Liu H. Wang Y. Le Q. Tong J. Wang H. The IFN-γ-CXCL9/CXCL10-CXCR3 axis in vitiligo: Pathological mechanism and treatment Eur. J. Immunol. 2024 54 e2250281 10.1002/eji.202250281 37937817 47. Koga S. Nakano M. Tero-Kubota S. Generation of superoxide during the enzymatic action of tyrosinase Arch. Biochem. Biophys. 1992 292 570 575 10.1016/0003-9861(92)90032-R 1309977 48. Liu Y. Hong L. Wakamatsu K. Ito S. Adhyaru B. Cheng C.-Y. Bowers C.R. Simon J.D. Comparison of Structural and Chemical Properties of Black and Red Human Hair Melanosomes Photochem. Photobiol. 2005 81 135 144 10.1111/j.1751-1097.2005.tb01532.x 15504086 49. Parsad D. Wakamatsu K. Kanwar A.J. Kumar B. Ito S. Eumelanin and phaeomelanin contents of depigmented and repigmented skin in vitiligo patients Br. J. Dermatol. 2003 149 624 626 10.1046/j.1365-2133.2003.05440.x 14510999 50. Yonemoto K. Gellin G.A. Epstein W.L. Fukuyama K. Reduction in eumelanin by the activation of glutathione reductase and γ-glutamyl transpeptidase after exposure to a depigmenting chemical Biochem. Pharmacol. 1983 32 1379 1382 10.1016/0006-2952(83)90450-1 6134532 51. Bibeau K. Pandya A.G. Ezzedine K. Jones H. Gao J. Lindley A. Harris J.E. Vitiligo prevalence and quality of life among adults in Europe, Japan and the USA J. Eur. Acad. Dermatol. Venereol. 2022 36 1831 1844 10.1111/jdv.18257 35611638 PMC9544885 52. Maresca V. Flori E. Briganti S. Mastrofrancesco A. Fabbri C. Mileo A.M. Paggi M.G. Picardo M. Correlation between melanogenic and catalase activity in in vitro human melanocytes: A synergic strategy against oxidative stress Pigment. Cell Melanoma Res. 2008 21 200 205 10.1111/j.1755-148X.2007.00432.x 18426413 53. Smit N.P.M. van Nieuwpoort F.A. Marrot L. Out C. Poorthuis B. van Pelt H. Meunier J. Pavel S. Increased melanogenesis is a risk factor for oxidative DNA damage--study on cultured melanocytes and atypical nevus cells Photochem. Photobiol. 2008 84 550 555 10.1111/j.1751-1097.2007.00242.x 18435613 54. Maresca V. Flori E. Bellei B. Aspite N. Kovacs D. Picardo M. MC1R stimulation by α-MSH induces catalase and promotes its re-distribution to the cell periphery and dendrites Pigment. Cell Melanoma Res. 2010 23 263 275 10.1111/j.1755-148X.2010.00673.x 20067588 55. Ghazi M. Khanna S. Subramaniam Y. Rengaraju J. Sultan F. Gupta I. Sharma K. Chandna S. Gokhale R.S. Natarajan V.T. Sustained pigmentation causes DNA damage and invokes translesion polymerase Polκ for repair in melanocytes Nucleic Acids Res. 2023 51 10451 10466 10.1093/nar/gkad704 37697436 PMC10602914 56. Denat L. Kadekaro A.L. Marrot L. Leachman S.A. Abdel-Malek Z.A. Melanocytes as instigators and victims of oxidative stress J. Investig. Dermatol. 2014 134 1512 1518 10.1038/jid.2014.65 24573173 PMC4418514 57. Guntas G. Engin B. Ekmekci O.B. Kutlubay Z. Ekmekci H. Songur A. Uzuncakmak T.K.U. Vehid H.E. Serdaroglu S. Tuzun Y. Evaluation of advanced oxidation protein products, prooxidant-antioxidant balance, and total antioxidant capacity in untreated vitiligo patients Ann. Dermatol. 2015 27 178 183 10.5021/ad.2015.27.2.178 25834357 PMC4377407 58. Li S. Dai W. Wang S. Kang P. Ye Z. Han P. Zeng K. Li C. Clinical Significance of Serum Oxidative Stress Markers to Assess Disease Activity and Severity in Patients with Non-Segmental Vitiligo Front. Cell Dev. Biol. 2021 9 739413 10.3389/fcell.2021.739413 34977005 PMC8716723 59. Salem M.M.A.E.L. Shalbaf M. Gibbons N.C.J. Chavan B. Thornton J.M. Schallreuter K.U. Enhanced DNA binding capacity on up-regulated epidermal wild-type p53 in vitiligo by H 2 2 FASEB J. 2009 23 3790 3807 10.1096/fj.09-132621 19641144 60. Mitra S. De Sarkar S. Pradhan A. Pati A.K. Pradhan R. Mondal D. Sen S. Ghosh A. Chatterjee S. Chatterjee M. Levels of oxidative damage and proinflammatory cytokines are enhanced in patients with active vitiligo Free Radic. Res. 2017 51 986 994 10.1080/10715762.2017.1402303 29182456 61. Giovannelli L. Bellandi S. Pitozzi V. Fabbri P. Dolara P. Moretti S. Increased oxidative DNA damage in mononuclear leukocytes in vitiligo Mutat. Res. Mol. Mech. Mutagen. 2004 556 101 106 10.1016/j.mrfmmm.2004.07.005 15491637 62. Schallreuter K.U. Tobin D.J. Panske A. Decreased photodamage and low incidence of non-melanoma skin cancer in 136 sun-exposed caucasian patients with vitiligo Dermatology 2002 204 194 201 10.1159/000057881 12037447 63. Sant’Anna-Silva A.C.B. Botton T. Rossi A. Dobner J. Bzioueche H. Thach N. Blot L. Pagnotta S. Kleszczynski K. Steinbrink K. Vitiligo auto-immune response upon oxidative stress-related mitochondrial DNA release opens up new therapeutic strategies Clin. Transl. Med. 2024 14 e1810 10.1002/ctm2.1810 39113238 PMC11306283 64. Hu M.-M. Shu H.-B. Mitochondrial DNA-triggered innate immune response: Mechanisms and diseases Cell Mol. Immunol. 2023 20 1403 1412 10.1038/s41423-023-01086-x 37932533 PMC10687031 65. Schallreuter K.U. Chiuchiarelli G. Cemeli E. Elwary S.M. Gillbro J.M. Spencer J.D. Rokos H. Panske A. Chavan B. Wood J.M. Estrogens can contribute to hydrogen peroxide generation and quinone-mediated DNA damage in peripheral blood lymphocytes from patients with vitiligo J. Investig. Dermatol. 2006 126 1036 1042 10.1038/sj.jid.5700257 16528352 66. Sastry K.S. Naeem H. Mokrab Y. Chouchane A.I. RNA-seq Reveals Dysregulation of Novel Melanocyte Genes upon Oxidative Stress: Implications in Vitiligo Pathogenesis Oxidative Med. Cell. Longev. 2019 2019 2841814 10.1155/2019/2841814 PMC6913168 31871544 67. Hou X. Shi J. Sun L. Song L. Zhao W. Xiong X. Lu Y. The involvement of ERK1/2 and p38 MAPK in the premature senescence of melanocytes induced by H 2 2 J. Dermatol. Sci. 2022 105 88 97 10.1016/j.jdermsci.2022.01.002 35042627 68. Tobin D.J. Swanson N.N. Pittelkow M.R. Peters E.M. Schallreuter K.U. Melanocytes are not absent in lesional skin of long duration vitiligo J. Pathol. 2000 191 407 416 10.1002/1096-9896(2000)9999:9999&#x0003c;::AID-PATH659&#x0003e;3.0.CO;2-D 10918216 69. Gottschalk G.M. Kidson S.H. Molecular analysis of vitiligo lesions reveals sporadic melanocyte survival Int. J. Dermatol. 2007 46 268 272 10.1111/j.1365-4632.2006.03000.x 17343582 70. Lee J.W. Kim T.H. Park T.J. Kang H.Y. p16(ink4a) Positivity of Melanocytes in Non-Segmental Vitiligo Diagnostics 2020 10 878 10.3390/diagnostics10110878 33126704 PMC7694005 71. Erusalimsky J.D. Kurz D.J. Cellular senescence in vivo: Its relevance in ageing and cardiovascular disease Exp. Gerontol. 2005 40 634 642 10.1016/j.exger.2005.04.010 15970413 72. Kritsilis M. Rizou S.V. Koutsoudaki P.N. Evangelou K. Gorgoulis V.G. Papadopoulos D. Ageing, Cellular Senescence and Neurodegenerative Disease Int. J. Mol. Sci. 2018 19 2937 10.3390/ijms19102937 30261683 PMC6213570 73. Sreekumar P.G. Hinton D.R. Kannan R. The Emerging Role of Senescence in Ocular Disease Oxidative Med. Cell. Longev. 2020 2020 2583601 10.1155/2020/2583601 PMC7085400 32215170 74. Bellei B. Picardo M. Premature cell senescence in human skin: Dual face in chronic acquired pigmentary disorders Ageing Res. Rev. 2020 57 100981 10.1016/j.arr.2019.100981 31733332 75. Chen N. Hu Y. Li W. Eisinger M. Seiberg M. Lin C.B. The role of keratinocyte growth factor in melanogenesis: A possible mechanism for the initiation of solar lentigines Exp. Dermatol. 2010 19 865 872 10.1111/j.1600-0625.2009.00957.x 19780816 76. Kang H.Y. Hwang J.S. Lee J.Y. Ahn J.H. Kim J.-Y. Lee E.-S. Kang W.H. The dermal stem cell factor and c-kit are overexpressed in melasma Br. J. Dermatol. 2006 154 1094 1099 10.1111/j.1365-2133.2006.07179.x 16704639 77. Moretti S. Spallanzani A. Amato L. Hautmann G. Gallerani I. Fabbri P. Vitiligo and epidermal microenvironment: Possible involvement of keratinocyte-derived cytokines Arch. Dermatol. 2002 138 273 274 10.1001/archderm.138.2.273 11843662 78. Lee A.-Y. Role of keratinocytes in the development of vitiligo Ann. Dermatol. 2012 24 115 125 10.5021/ad.2012.24.2.115 22577260 PMC3346900 79. Burton D.G.A. Stolzing A. Cellular senescence: Immunosurveillance and future immunotherapy Ageing Res. Rev. 2018 43 17 25 10.1016/j.arr.2018.02.001 29427795 80. Redza-Dutordoir M. Averill-Bates D.A. Activation of apoptosis signalling pathways by reactive oxygen species Biochim. Biophys. Acta 2016 1863 2977 2992 10.1016/j.bbamcr.2016.09.012 27646922 81. Dell’Anna M.L. Ottaviani M. Kovacs D. Mirabilii S. Brown D.A. Cota C. Migliano E. Bastonini E. Bellei B. Cardinali G. Energetic mitochondrial failing in vitiligo and possible rescue by cardiolipin Sci. Rep. 2017 7 13663 10.1038/s41598-017-13961-5 29057950 PMC5654478 82. Xu X. Lu X. Zheng Y. Xie Y. Lai W. Cytosolic mtDNA-cGAS-STING axis mediates melanocytes pyroptosis to promote CD8(+) T-cell activation in vitiligo J. Dermatol. Sci. 2025 117 61 70 10.1016/j.jdermsci.2024.12.002 39904676 83. Sun L. Wu J. Du F. Chen X. Chen Z.J. Cyclic GMP-AMP synthase is a cytosolic DNA sensor that activates the type I interferon pathway Science 2013 339 786 791 10.1126/science.1232458 23258413 PMC3863629 84. Wu T. Chen X. Fan J. Ye P. Zhang J. Wang Z. Zhou Y. Wang B. Jin X. Xiong S. Oxidative stress-induced release of mitochondrial DNA (mtDNA) promotes the progression of vitiligo by activating the cGAS-STING signaling pathway in monocytes Free Radic. Biol. Med. 2025 235 43 55 10.1016/j.freeradbiomed.2025.04.033 40268104 85. Toosi S. Orlow S.J. Manga P. Vitiligo-inducing phenols activate the unfolded protein response in melanocytes resulting in upregulation of IL6 and IL8 J. Investig. Dermatol. 2012 132 2601 2609 10.1038/jid.2012.181 22696056 PMC3443495 86. Qiao Z. Wang X. Xiang L. Zhang C. Dysfunction of Autophagy: A Possible Mechanism Involved in the Pathogenesis of Vitiligo by Breaking the Redox Balance of Melanocytes Oxidative Med. Cell. Longev. 2016 2016 3401570 10.1155/2016/3401570 PMC5153471 28018522 87. Liu L.-Y. He S.-J. Chen Z. Ge M. Lyu C.-Y. Gao D. Yu J.-P. Cai M.-H. Yuan J.-X. Zhang J.-L. The Role of Regulatory Cell Death in Vitiligo DNA Cell Biol. 2024 43 61 73 10.1089/dna.2023.0188 38153369 88. Saheki Y. De Camilli P. Endoplasmic Reticulum-Plasma Membrane Contact Sites Annu. Rev. Biochem. 2017 86 659 684 10.1146/annurev-biochem-061516-044932 28301744 89. Li H. Lismont C. Revenco I. Hussein M.A.F. Costa C.F. Fransen M. The Peroxisome-Autophagy Redox Connection: A Double-Edged Sword? Front. Cell Dev. Biol. 2021 9 814047 10.3389/fcell.2021.814047 34977048 PMC8717923 90. Chen J. Zhuang T. Chen J. Tian Y. Yi X. Ni Q. Zhang W. Song P. Jian Z. Liu L. Homocysteine induces melanocytes apoptosis via PERK–eIF2α–CHOP pathway in vitiligo Clin. Sci. 2020 134 1127 1141 10.1042/CS20200218 32400851 91. Walter P. Ron D. The unfolded protein response: From stress pathway to homeostatic regulation Science 2011 334 1081 1086 10.1126/science.1209038 22116877 92. Oakes S.A. Papa F.R. The role of endoplasmic reticulum stress in human pathology Annu. Rev. Pathol. Mech. Dis. 2015 10 173 194 10.1146/annurev-pathol-012513-104649 PMC5568783 25387057 93. Woodward A.M. Di Zazzo A. Bonini S. Argueso P. Endoplasmic reticulum stress promotes inflammation-mediated proteolytic activity at the ocular surface Sci. Rep. 2020 10 2216 10.1038/s41598-020-59237-3 32042069 PMC7010695 94. Zhang J. Hu W. Wang P. Ding Y. Wang H. Kang X. Research Progress on Targeted Antioxidant Therapy and Vitiligo Oxidative Med. Cell. Longev. 2022 2022 1821780 10.1155/2022/1821780 PMC8938057 35320978 95. Jung H.M. Jung Y.S. Lee J.H. Kim G.M. Bae J.M. Antioxidant supplements in combination with phototherapy for vitiligo: A systematic review and metaanalysis of randomized controlled trials J. Am. Acad. Dermatol. 2021 85 506 508 10.1016/j.jaad.2018.10.010 30342161 96. Finamor D.C. Sinigaglia-Coimbra R. Neves L.C.M. Gutierrez M. Silva J.J. Torres L.D. Surano F. Neto D.J. Novo N.F. Juliano Y. A pilot study assessing the effect of prolonged administration of high daily doses of vitamin D on the clinical course of vitiligo and psoriasis Derm. Endocrinol. 2013 5 222 234 10.4161/derm.24808 PMC3897595 24494059 97. Khurrum H. AlGhamdi K.M. The Relationship Between the Serum Level of Vitamin D and Vitiligo: A Controlled Study on 300 Subjects J. Cutan. Med. Surg. 2016 20 139 145 10.1177/1203475415610071 26458407 98. Diaz M.J. Tran J.T. Rose D. Wei A. Lakshmipathy D. Lipner S.R. Dietary Interventions, Supplements, and Plant-Derived Compounds for Adjunct Vitiligo Management: A Review of the Literature Nutrients 2025 17 357 10.3390/nu17020357 39861486 PMC11767946 99. Li K. Shi Q. Yang L. Li X. Liu L. Wang L. Li Q. Wang G. Li C.-Y. Gao T.-W. The association of vitamin D receptor gene polymorphisms and serum 25-hydroxyvitamin D levels with generalized vitiligo Br. J. Dermatol. 2012 167 815 821 10.1111/j.1365-2133.2012.11132.x 22762534 100. Fallah M. Abedini R. Mahiabadi S.A. Montazeri S. Hosseinzadeh-Attar M.J. Ebrahimpour-Koujan S. The effect of vitamin C on oxidative stress indices and skin regimentation of vitiligo patients Arch. Dermatol. Res. 2023 315 2655 2660 10.1007/s00403-023-02687-2 37606744 101. Sanadi R.M. Deshmukh R.S. The effect of Vitamin C on melanin pigmentation—A systematic review J. Oral. Maxillofac. Pathol. 2020 24 374 382 10.4103/jomfp.JOMFP_207_20 33456250 PMC7802860 102. Adil M. Amin S.S. Mohtashim M. N-acetylcysteine in dermatology Indian. J. Dermatol. Venereol. Leprol. 2018 84 652 659 10.4103/ijdvl.IJDVL_33_18 30246706 103. Montes L.F. Diaz M.L. Lajous J. Garcia N.J. Folic acid and vitamin B12 in vitiligo: A nutritional approach Cutis 1992 50 39 42 1516378 104. Middelkamp-Hup M.A. Bos J.D. Rius-Diaz F. Gonzalez S. Westerhof W. Treatment of vitiligo vulgaris with narrow-band UVB and oral Polypodium leucotomos extract: A randomized double-blind placebo-controlled study J. Eur. Acad. Dermatol. Venereol. 2007 21 942 950 10.1111/j.1468-3083.2006.02132.x 17659004 105. Gonzalez S. Gilaberte Y. Philips N. Mechanistic insights in the use of a Polypodium leucotomos extract as an oral and topical photoprotective agent Photochem. Photobiol. Sci. 2010 9 559 563 10.1039/b9pp00156e 20354651 106. Reyes E. Jaén P. Heras E.d.L. de Eusebio E. Carrión F. Cuevas J. González S. Villarrubia V.G. Álvarez-Mon M. Systemic immunomodulatory effects of Polypodium leucotomos as an adjuvant to PUVA therapy in generalized vitiligo: A pilot study J. Dermatol. Sci. 2006 41 213 216 10.1016/j.jdermsci.2005.12.006 16423508 107. Naini F.F. Shooshtari A.V. Ebrahimi B. Molaei R. The effect of pseudocatalase/superoxide dismutase in the treatment of vitiligo: A pilot study J. Res. Pharm. Pract. 2012 1 77 80 10.4103/2279-042X.108375 24991594 PMC4076862 108. Sanclemente G. Garcia J.J. Zuleta J.J. Diehl C. Correa C. Falabella R. A double-blind, randomized trial of 0.05% betamethasone vs. topical catalase/dismutase superoxide in vitiligo J. Eur. Acad. Dermatol. Venereol. 2008 22 1359 1364 10.1111/j.1468-3083.2008.02839.x 18624857 109. Bakis-Petsoglou S. Le Guay J.L. Wittal R. A randomized, double-blinded, placebo-controlled trial of pseudocatalase cream and narrowband ultraviolet B in the treatment of vitiligo Br. J. Dermatol. 2009 161 910 917 10.1111/j.1365-2133.2009.09252.x 19523170 110. Yuksel E.P. Aydin F. Senturk N. Canturk T. Turanli A.Y. Comparison of the efficacy of narrow band ultraviolet B and narrow band ultraviolet B plus topical catalase-superoxide dismutase treatment in vitiligo patients Eur. J. Dermatol. 2009 19 341 344 10.1684/ejd.2009.0699 19467974 111. Gawkrodger D.J. Pseudocatalase and narrowband ultraviolet B for vitiligo: Clearing the picture Br. J. Dermatol. 2009 161 721 722 10.1111/j.1365-2133.2009.09292.x 19780755 112. Schallreuter K.U. Salem M.A.E.L. Holtz S. Panske A. Basic evidence for epidermal H 2 2 2 2 FASEB J. 2013 27 3113 3122 10.1096/fj.12-226779 23629861 113. Huo J. Liu T. Huan Y. Li F. Wang R. Serum level of antioxidant vitamins and minerals in patients with vitiligo, a systematic review and meta-analysis J. Trace Elem. Med. Biol. 2020 62 126570 10.1016/j.jtemb.2020.126570 32593085 114. Inomata K. Aoto T. Binh N.T. Okamoto N. Tanimura S. Wakayama T. Iseki S. Hara E. Masunaga T. Shimizu H. Genotoxic stress abrogates renewal of melanocyte stem cells by triggering their differentiation Cell 2009 137 1088 1099 10.1016/j.cell.2009.03.037 19524511 115. Nishimura E.K. Granter S.R. Fisher D.E. Mechanisms of hair graying: Incomplete melanocyte stem cell maintenance in the niche Science 2005 307 720 724 10.1126/science.1099593 15618488 116. Bertrand J.U. Steingrimsson E. Jouenne F. Bressac-de Paillerets B. Larue L. Melanoma Risk and Melanocyte Biology Acta Derm. Venereol. 2020 100 272 283 10.2340/00015555-3494 PMC9189750 32346747 117. Birlea S.A. Costin G. Roop D.R. Norris D.A. Trends in Regenerative Medicine: Repigmentation in Vitiligo Through Melanocyte Stem Cell Mobilization Med. Res. Rev. 2017 37 907 935 10.1002/med.21426 28029168 PMC5466503 118. Yamaguchi Y. Itami S. Watabe H. Yasumoto K. Abdel-Malek Z.A. Kubo T. Rouzaud F. Tanemura A. Yoshikawa K. Hearing V.J. Mesenchymal-epithelial interactions in the skin: Increased expression of dickkopf1 by palmoplantar fibroblasts inhibits melanocyte growth and differentiation J. Cell Biol. 2004 165 275 285 10.1083/jcb.200311122 15117970 PMC2172049 119. Abdel-Naser M.B. Seltmann H. Zouboulis C.C. SZ95 sebocytes induce epidermal melanocyte dendricity and proliferation in vitro Exp. Dermatol. 2012 21 393 395 10.1111/j.1600-0625.2012.01468.x 22509839 120. Lee A.-Y. Kim N.-H. Choi W.-I. Youm Y.-H. Less keratinocyte-derived factors related to more keratinocyte apoptosis in depigmented than normally pigmented suction-blistered epidermis may cause passive melanocyte death in vitiligo J. Investig. Dermatol. 2005 124 976 983 10.1111/j.0022-202X.2005.23667.x 15854039 121. Moretti S. Spallanzani A. Amato L. Hautmann G. Gallerani I. Fabiani M. Fabbri P. New insights into the pathogenesis of vitiligo: Imbalance of epidermal cytokines at sites of lesions Pigment. Cell Res. 2002 15 87 92 10.1034/j.1600-0749.2002.1o049.x 11936274 122. Yuan X. Meng D. Cao P. Sun L. Pang Y. Li Y. Wang X. Luo Z. Zhang L. Liu G. Identification of pathogenic genes and transcription factors in vitiligo Dermatol. Ther. 2019 32 e13025 10.1111/dth.13025 31306558 123. Kingo K. Aunin E. Karelson M. Philips M.-A. Ratsep R. Silm H. Vasar E. Soomets U. Koks S. Gene expression analysis of melanocortin system in vitiligo J. Dermatol. Sci. 2007 48 113 122 10.1016/j.jdermsci.2007.06.004 17651944 124. Toh J.J.H. Chuah S.Y. Jhingan A. Chong W.-S. Thng S.T.G. Afamelanotide implants and narrow-band ultraviolet B phototherapy for the treatment of nonsegmental vitiligo in Asians J. Am. Acad. Dermatol. 2020 82 1517 1519 10.1016/j.jaad.2020.01.035 31987791 125. Liang J. Yu Y. Li C. Li Q. Chen P. Li W. Liu W. Li Z. Liu Y. Zhang S. Tofacitinib combined with melanocyte protector α-MSH to treat vitiligo through dextran-based hydrogel microneedles Carbohydr. Polym. 2023 305 120549 10.1016/j.carbpol.2023.120549 36737198 126. Khan R. Sharma A. Bhushan A. Basnet B. Sharma V.K. Gupta S. Relationship between α-melanocyte stimulating hormone levels and therapeutic outcome of melanocyte transplantation and phototherapy in non-segmental patients with vitiligo: A prospective study Australas. J. Dermatol. 2018 59 e315 e318 10.1111/ajd.12769 29322506 127. Lim H.W. Grimes P.E. Agbai O. Hamzavi I. Henderson M. Haddican M. Linkner R.V. Lebwohl M. Afamelanotide and narrowband UV-B phototherapy for the treatment of vitiligo: A randomized multicenter trial JAMA Dermatol. 2015 151 42 50 10.1001/jamadermatol.2014.1875 25230094 128. Minder E.I. Barman-Aksoezen J. Schneider-Yin X. Pharmacokinetics and Pharmacodynamics of Afamelanotide and its Clinical Use in Treating Dermatologic Disorders Clin. Pharmacokinet. 2017 56 815 823 10.1007/s40262-016-0501-5 28063031 129. Shah B. Godse K. Mahajan S. Grandhi S. Shendkar S. Sharma A. Teli C. Pathak R. Parsad D. Efficacy and safety of basic fibroblast growth factor (bFGF) related decapeptide solution plus Tacrolimus 0.1% ointment versus Tacrolimus 0.1% ointment in the treatment of stable vitiligo Dermatol. Ther. 2019 32 e13109 10.1111/dth.13109 31600833 130. Caputo S. Papaccio F. Marrapodi R. Lopez G. Iacovelli P. Pacifico A. Migliano E. Cota C. Di Nardo A. Picardo M. Defective Intracellular Insulin/IGF-1 Signaling Elucidates the Link Between Metabolic Defect and Autoimmunity in Vitiligo Cells 2025 14 565 10.3390/cells14080565 40277891 PMC12025416 131. El-Komy M.H.M. Sayed K.S. Mostafa W.Z. Shaker O. Nasser N. Hassan M. Insulin-like growth factor 1: A new prime mover in the pathogenesis of vitiligo Australas. J. Dermatol. 2023 64 e188 e191 10.1111/ajd.13999 36752172 132. Ding X. Liu S.-X. Progress in the Use of Platelet-Rich Plasma to Treat Vitiligo and Melasma Int. J. Dermatol. Venereol. 2021 4 236 241 10.1097/JD9.0000000000000171 133. Bellei B. Papaccio F. Filoni A. Caputo S. Lopez G. Migliano E. Picardo M. Extracellular fraction of adipose tissue as an innovative regenerative approach for vitiligo treatment Exp. Dermatol. 2019 28 695 703 10.1111/exd.13954 31066942 134. Newton K. Strasser A. Kayagaki N. Dixit V.M. Cell death Cell 2024 187 235 256 10.1016/j.cell.2023.11.044 38242081 135. Taylor R.C. Cullen S.P. Martin S.J. Apoptosis: Controlled demolition at the cellular level Nat. Rev. Mol. Cell Biol. 2008 9 231 241 10.1038/nrm2312 18073771 136. Elmore S. Apoptosis: A review of programmed cell death Toxicol. Pathol. 2007 35 495 516 10.1080/01926230701320337 17562483 PMC2117903 137. Dell’Anna M.L. Maresca V. Briganti S. Camera E. Falchi M. Picardo M. Mitochondrial impairment in peripheral blood mononuclear cells during the active phase of vitiligo J. Investig. Dermatol. 2001 117 908 913 10.1046/j.0022-202x.2001.01459.x 11676831 138. Seneschal J. Boniface K. D’Arino A. Picardo M. An update on Vitiligo pathogenesis Pigment. Cell Melanoma Res. 2021 34 236 243 10.1111/pcmr.12949 33278065 139. Kumar R. Parsad D. Kanwar A.J. Kaul D. Altered levels of LXR-α: Crucial implications in the pathogenesis of vitiligo Exp. Dermatol. 2012 21 853 858 10.1111/exd.12017 23163651 140. Kang P. Zhang W. Chen X. Yi X. Song P. Chang Y. Zhang S. Gao T. Li C. Li S. TRPM2 mediates mitochondria-dependent apoptosis of melanocytes under oxidative stress Free Radic. Biol. Med. 2018 126 259 268 10.1016/j.freeradbiomed.2018.08.022 30138713 141. Yi X. Guo W. Shi Q. Yang Y. Zhang W. Chen X. Kang P. Chen J. Cui T. Ma J. SIRT3-Dependent Mitochondrial Dynamics Remodeling Contributes to Oxidative Stress-Induced Melanocyte Degeneration in Vitiligo Theranostics 2019 9 1614 1633 10.7150/thno.30398 31037127 PMC6485185 142. Zhang Y. Liu L. Jin L. Yi X. Dang E. Yang Y. Li C. Gao T. Oxidative stress-induced calreticulin expression and translocation: New insights into the destruction of melanocytes J. Investig. Dermatol. 2014 134 183 191 10.1038/jid.2013.268 23771121 143. Zhu J. Guo Y. Luo L. Huang X. Wei T. Zuo B. Liu G. Bu W. Li C. Sirtuin1 Deficiency Could Exacerbate Melanocyte Apoptosis Under Endoplasmic Reticulum Stress Inflammation 2025 10.1007/s10753-025-02255-y 39921788 144. Becatti M. Fiorillo C. Barygina V. Cecchi C. Lotti T. Prignano F. Silvestro A. Nassi P. Taddei N. SIRT1 regulates MAPK pathways in vitiligo skin: Insight into the molecular pathways of cell survival J. Cell Mol. Med. 2014 18 514 529 10.1111/jcmm.12206 24410795 PMC3955157 145. Veis D.J. Sorenson C.M. Shutter J.R. Korsmeyer S.J. Bcl-2-deficient mice demonstrate fulminant lymphoid apoptosis, polycystic kidneys, and hypopigmented hair Cell 1993 75 229 240 10.1016/0092-8674(93)80065-M 8402909 146. Halaban R. Tyrrell L. Longley J. Yarden Y. Rubin J. Pigmentation and proliferation of human melanocytes and the effects of melanocyte-stimulating hormone and ultraviolet B light Ann. N. Y. Acad. Sci. 1993 680 290 301 10.1111/j.1749-6632.1993.tb19691.x 7685575 147. Dong Y. Kawakami T. Komatsu T. Regulation of adhesion molecules and basic fibroblast growth factor 2 in non-segmental vitiligo-derived primary melanocytes J. Dermatol. Sci. 2022 108 109 111 10.1016/j.jdermsci.2022.10.005 36402620 148. Haass N.K. Smalley K.S.M. Li L. Herlyn M. Adhesion, migration and communication in melanocytes and melanoma Pigment. Cell Res. 2005 18 150 159 10.1111/j.1600-0749.2005.00235.x 15892711 149. Kim N.-H. Lee A.-Y. Reduced aquaporin3 expression and survival of keratinocytes in the depigmented epidermis of vitiligo J. Investig. Dermatol. 2010 130 2231 2239 10.1038/jid.2010.99 20428189 150. Reichert-Faria A. Jung J.E. Neto V.M. de Castro C.C.S. Mira M.T. Reduced immunohistochemical expression of Discoidin Domain Receptor 1 (DDR1) in vitiligo skin J. Eur. Acad. Dermatol. Venereol. 2013 27 1057 1059 10.1111/jdv.12013 23106242 151. Faria A.R. Jung J.E. de Castro C.C.S. de Noronha L. Reduced immunohistochemical expression of adhesion molecules in vitiligo skin biopsies Pathol. Res. Pract. 2017 213 199 204 10.1016/j.prp.2016.12.019 28214208 152. Kumar R. Parsad D. Kanwar A.J. Role of apoptosis and melanocytorrhagy: A comparative study of melanocyte adhesion in stable and unstable vitiligo Br. J. Dermatol. 2011 164 187 191 10.1111/j.1365-2133.2010.10039.x 21175561 153. Wagner R.Y. Luciani F. Cario-Andre M. Rubod A. Petit V. Benzekri L. Ezzedine K. Lepreux S. Steingrimsson E. Taieb A. Altered E-Cadherin Levels and Distribution in Melanocytes Precede Clinical Manifestations of Vitiligo J. Investig. Dermatol. 2015 135 1810 1819 10.1038/jid.2015.25 25634357 154. Willemsen M. Krebbers G. Tjin E.P.M. Willemsen K.J. Louis A. Konijn V.A.L. Narayan V.S. Post N.F. Bakker W.J. Melief C.J.M. IFN-γ-induced PD-L1 expression on human melanocytes is impaired in vitiligo Exp. Dermatol. 2022 31 556 566 10.1111/exd.14500 34758170 155. Matarrese P. Puglisi R. Mattia G. Samela T. Abeni D. Malorni W. An Overview of the Biological Complexity of Vitiligo Oxidative Med. Cell. Longev. 2024 2024 3193670 10.1155/omcl/3193670 39735711 PMC11671640 156. Kundu R.V. Mhlaba J.M. Rangel S.M. Le Poole I.C. The convergence theory for vitiligo: A reappraisal Exp. Dermatol. 2019 28 647 655 10.1111/exd.13677 29704874 PMC6204319 157. Jimbo H. Nagai H. Fujiwara S. Shimoura N. Nishigori C. Fas-FasL interaction in cytotoxic T cell-mediated vitiligo: The role of lesional expression of tumor necrosis factor-α and interferon-γ in Fas-mediated melanocyte apoptosis Exp. Dermatol. 2020 29 61 70 10.1111/exd.14053 31675451 158. Kim N.-H. Jeon S. Lee H.-J. Lee A.-Y. Impaired PI3K/Akt activation-mediated NF-κB inactivation under elevated TNF-α is more vulnerable to apoptosis in vitiliginous keratinocytes J. Investig. Dermatol. 2007 127 2612 2617 10.1038/sj.jid.5700900 17522703 159. Li M. Sun D. Li C. Zhang Z. Gao L. Li K. Li H. Gao T. Functional polymorphisms of the FAS gene associated with risk of vitiligo in Chinese populations: A case-control analysis J. Investig. Dermatol. 2008 128 2820 2824 10.1038/jid.2008.161 18548110 160. Birol A. Kisa U. Kurtipek G.S. Kara F. Kocak M. Erkek E. Caglayan O. Increased tumor necrosis factor alpha (TNF-α) and interleukin 1 alpha (IL1-α) levels in the lesional skin of patients with nonsegmental vitiligo Int. J. Dermatol. 2006 45 992 993 10.1111/j.1365-4632.2006.02744.x 16911396 161. Li B. Yi X. Zhuang T. Zhang S. Li S. Yang Y. Cui T. Chen J. Chang Y. Gao T. RIP1-Mediated Necroptosis Facilitates Oxidative Stress-Induced Melanocyte Death, Offering Insight into Vitiligo J. Investig. Dermatol. 2021 141 2921 2931.e6 10.1016/j.jid.2020.06.042 34102211 162. Kearney C.J. Martin S.J. An Inflammatory Perspective on Necroptosis Mol. Cell 2017 65 965 973 10.1016/j.molcel.2017.02.024 28306512 163. Anderton H. Alqudah S. Cell death in skin function, inflammation, and disease Biochem. J. 2022 479 1621 1651 10.1042/BCJ20210606 35929827 PMC9444075 164. Martin S.J. Henry C.M. Cullen S.P. A perspective on mammalian caspases as positive and negative regulators of inflammation Mol. Cell 2012 46 387 397 10.1016/j.molcel.2012.04.026 22633487 165. He K. Wu W. Wang X. Dai W. Wang S. Li C. Li S. Circulatory levels of alarmins in patients with non-segmental vitiligo: Potential biomarkers for disease diagnosis and activity/severity assessment Front. Immunol. 2022 13 1069196 10.3389/fimmu.2022.1069196 36569840 PMC9767981 166. Wang J. Pan Y. Wei G. Mao H. Liu R. He Y. Damage-associated molecular patterns in vitiligo: Igniter fuse from oxidative stress to melanocyte loss Redox Rep. 2022 27 193 199 10.1080/13510002.2022.2123864 36154894 PMC9518600 167. Herbette S. Roeckel-Drevet P. Drevet J.R. Seleno-independent glutathione peroxidases. More than simple antioxidant scavengers FEBS J. 2007 274 2163 2180 10.1111/j.1742-4658.2007.05774.x 17419737 168. Xiao B.-H. Shi M. Chen H. Cui S. Wu Y. Gao X.-H. Chen H.-D. Glutathione Peroxidase Level in Patients with Vitiligo: A Meta-Analysis Biomed. Res. Int. 2016 2016 3029810 10.1155/2016/3029810 27218102 PMC4863094 169. Em S. Laddha N.C. Chatterjee S. Gani A.R.A.G.A. Malek R.A. Shah B.J. Begum R. Association of catalase T/C exon 9 and glutathione peroxidase codon 200 polymorphisms in relation to their activities and oxidative stress with vitiligo susceptibility in Gujarat population Pigment. Cell Res. 2007 20 405 407 10.1111/j.1600-0749.2007.00406.x 17850515 170. Papaccio F. Ottaviani M. Truglio M. D’Arino A. Caputo S. Pacifico A. Iacovelli P. Di Nardo A. Picardo M. Bellei B. Markers of Metabolic Abnormalities in Vitiligo Patients Int. J. Mol. Sci. 2024 25 10201 10.3390/ijms251810201 39337683 PMC11432710 171. Zhang D. Li Y. Du C. Sang L. Liu L. Li Y. Wang F. Fan W. Tang P. Zhang S. Evidence of pyroptosis and ferroptosis extensively involved in autoimmune diseases at the single-cell transcriptome level J. Transl. Med. 2022 20 363 10.1186/s12967-022-03566-6 35962439 PMC9373312 172. David K.K. Andrabi S.A. Dawson T.M. Dawson V.L. Parthanatos, a messenger of death Front. Biosci. 2009 14 1116 1128 10.2741/3297 19273119 PMC4450718 173. Huang P. Chen G. Jin W. Mao K. Wan H. He Y. Molecular Mechanisms of Parthanatos and Its Role in Diverse Diseases Int. J. Mol. Sci. 2022 23 7292 10.3390/ijms23137292 35806303 PMC9266317 174. Kist M. Vucic D. Cell death pathways: Intricate connections and disease implications EMBO J. 2021 40 e106700 10.15252/embj.2020106700 33439509 PMC7917554 175. Chen J. Li S. Li C. Mechanisms of melanocyte death in vitiligo Med. Res. Rev. 2021 41 1138 1166 10.1002/med.21754 33200838 PMC7983894 176. Ke Y. Wang C. Zhang J. Zhong X. Wang R. Zeng X. Ba X. The Role of PARPs in Inflammation-and Metabolic-Related Diseases: Molecular Mechanisms and Beyond Cells 2019 8 1047 10.3390/cells8091047 31500199 PMC6770262 177. Tulic M.K. Cavazza E. Cheli Y. Jacquel A. Luci C. Cardot-Leccia N. Hadhiri-Bzioueche H. Abbe P. Gesson M. Sormani L. Innate lymphocyte-induced CXCR3B-mediated melanocyte apoptosis is a potential initiator of T-cell autoreactivity in vitiligo Nat. Commun. 2019 10 2178 10.1038/s41467-019-09963-8 31097717 PMC6522502 178. Klionsky D.J. Petroni G. Amaravadi R.K. Baehrecke E.H. Ballabio A. Boya P. Pedro J.M.B. Cadwell K. Cecconi F. Choi A.M.K. Autophagy in major human diseases EMBO J. 2021 40 e108863 10.15252/embj.2021108863 34459017 PMC8488577 179. Denton D. Kumar S. Autophagy-dependent cell death Cell Death Differ. 2019 26 605 616 10.1038/s41418-018-0252-y 30568239 PMC6460387 180. Boya P. Gonzalez-Polo R.-A. Casares N. Perfettini J.-L. Dessen P. Larochette N. Metivier D. Meley D. Souquere S. Yoshimori T. Inhibition of macroautophagy triggers apoptosis Mol. Cell. Biol. 2005 25 1025 1040 10.1128/MCB.25.3.1025-1040.2005 15657430 PMC543994 181. Denton D. Xu T. Kumar S. Autophagy as a pro-death pathway Immunol. Cell Biol. 2015 93 35 42 10.1038/icb.2014.85 25331550 182. Zhang C.-F. Gruber F. Ni C. Mildner M. Koenig U. Karner S. Barresi C. Rossiter H. Narzt M.-S. Nagelreiter I.M. Suppression of autophagy dysregulates the antioxidant response and causes premature senescence of melanocytes J. Investig. Dermatol. 2015 135 1348 1357 10.1038/jid.2014.439 25290687 183. Qiao Z. Xu Z. Xiao Q. Yang Y. Ying J. Xiang L. Zhang C. Dysfunction of ATG7-dependent autophagy dysregulates the antioxidant response and contributes to oxidative stress-induced biological impairments in human epidermal melanocytes Cell Death Discov. 2020 6 31 10.1038/s41420-020-0266-3 32377394 PMC7195468 184. Rabinowitz J.D. White E. Autophagy and metabolism Science 2010 330 1344 1348 10.1126/science.1193497 21127245 PMC3010857 185. Jia J. Abudu Y.P. Claude-Taupin A. Gu Y. Kumar S. Choi S.W. Peters R. Mudd M.H. Allers L. Salemi M. Galectins control MTOR and AMPK in response to lysosomal damage to induce autophagy Autophagy 2019 15 169 171 10.1080/15548627.2018.1505155 30081722 PMC6287685 186. Bastonini E. Kovacs D. Raffa S. Macchie M.D. Pacifico A. Iacovelli P. Torrisi M.R. Picardo M. A protective role for autophagy in vitiligo Cell Death Dis. 2021 12 318 10.1038/s41419-021-03592-0 33767135 PMC7994839 187. Yu H. Lin X. Huang Y. Cheng H. Seifert O. The Difference in Expression of Autophagy-Related Proteins in Lesional and Perilesional Skin in Adult Patients with Active and Stable Generalized Vitiligo-A Cross-Sectional Pilot Study Indian J. Dermatol. 2021 66 331 336 10.4103/ijd.IJD_774_19 34759388 PMC8530050 188. Yang Y. Wu X. Lu X. Wang C. Xiang L. Zhang C. Identification and Validation of Autophagy-Related Genes in Vitiligo Cells 2022 11 1116 10.3390/cells11071116 35406685 PMC8997611 189. Zhao Y. Ge K. Cheng Y. Zhang R. Bioinformatic Analysis of Genes Associated with Autophagy in Vitiligo Indian J. Dermatol. 2024 69 123 131 10.4103/ijd.ijd_655_23 38841253 PMC11149808 190. Wang W. Xu D. Huang Y. Tao X. Fan Y. Li Z. Ding X. Identification of the role of autophagy-related TNFSF10/ hsa-let-7a-5p axis in vitiligo development and potential herbs exploring based on a bioinformatics analysis Heliyon 2023 9 e23220 10.1016/j.heliyon.2023.e23220 38149194 PMC10750083 191. Coppe J. Patil C.K. Rodier F. Sun Y. Munoz D.P. Goldstein J. Nelson P.S. Desprez P.-Y. Campisi J. Senescence-associated secretory phenotypes reveal cell-nonautonomous functions of oncogenic RAS and the p53 tumor suppressor PLoS Biol. 2008 6 2853 2868 10.1371/journal.pbio.0060301 19053174 PMC2592359 192. Dong B.-Q. Liao Z.-K. Le Y. Jiang S. Luo L.-F. Miao F. Le Poole I.C. Lei T.-C. Acceleration of melanocyte senescence by the proinflammatory cytokines IFNγ and TNFα impairs the repigmentation response of vitiligo patients to narrowband ultraviolet B (NBUVB) phototherapy Mech. Ageing Dev. 2023 211 111779 10.1016/j.mad.2023.111779 36731753 193. Wang S. Zhou M. Lin F. Liu D. Hong W. Lu L. Zhu Y. Xu A. Interferon-γ induces senescence in normal human melanocytes PLoS ONE 2014 9 e93232 10.1371/journal.pone.0093232 24681574 PMC3969336 194. Park Y.J. Kim J.C. Kim Y. Kim Y.H. Park S.S. Muther C. Tessier A. Lee G. Gendronneau G. Forestier S. Senescent melanocytes driven by glycolytic changes are characterized by melanosome transport dysfunction Theranostics 2023 13 3914 3924 10.7150/thno.84912 37554281 PMC10405833 195. Bondanza S. Maurelli R. Paterna P. Migliore E. Giacomo F.D. Primavera G. Paionni E. Dellambra E. Guerra L. Keratinocyte cultures from involved skin in vitiligo patients show an impaired in vitro behaviour Pigment. Cell Res. 2007 20 288 300 10.1111/j.1600-0749.2007.00385.x 17630962 196. Kovacs D. Bastonini E. Briganti S. Ottaviani M. D’Arino A. Truglio M. Sciuto L. Zaccarini M. Pacifico A. Cota C. Altered epidermal proliferation, differentiation, and lipid composition: Novel key elements in the vitiligo puzzle Sci. Adv. 2022 8 eabn9299 10.1126/sciadv.abn9299 36054352 PMC10848961 197. Ho C.Y. Dreesen O. Faces of cellular senescence in skin aging Mech. Ageing Dev. 2021 198 111525 10.1016/j.mad.2021.111525 34166688 198. de Magalhaes J.P. Cellular senescence in normal physiology Science 2024 384 1300 1301 10.1126/science.adj7050 38900869 199. Becatti M. Prignano F. Fiorillo C. Pescitelli L. Nassi P. Lotti T. Taddei N. The involvement of Smac/DIABLO, p53, NF-kB, and MAPK pathways in apoptosis of keratinocytes from perilesional vitiligo skin: Protective effects of curcumin and capsaicin Antioxid. Redox Signal 2010 13 1309 1321 10.1089/ars.2009.2779 20085492 200. Kovacs D. Bastonini E. Ottaviani M. Cota C. Migliano E. Dell’Anna M.L. Picardo M. Vitiligo Skin: Exploring the Dermal Compartment J. Investig. Dermatol. 2018 138 394 404 10.1016/j.jid.2017.06.033 29024688 201. Cat B. Stuhlmann D. Steinbrenner H. Alili L. Holtkotter O. Sies H. Brenneisen P. Enhancement of tumor invasion depends on transdifferentiation of skin fibroblasts mediated by reactive oxygen species J. Cell Sci. 2006 119 2727 2738 10.1242/jcs.03011 16757516 202. Taddei M.L. Cavallini L. Comito G. Giannoni E. Folini M. Marini A. Gandellini P. Morandi A. Pintus G. Raspollini M.R. Senescent stroma promotes prostate cancer progression: The role of miR-210 Mol. Oncol. 2014 8 1729 1746 10.1016/j.molonc.2014.07.009 25091736 PMC5528604 203. Liu J. Man W.Y. Lv C.Z. Song S.P. Shi Y.J. Elias P.M. Man M.Q. Epidermal permeability barrier recovery is delayed in vitiligo-involved sites Ski. Pharmacol. Physiol. 2010 23 193 200 10.1159/000288166 PMC2883831 20185976 204. Wen Y. Issa I.A. Lei L. Fu C. Zhou S. Zhang K. Huang J. Chen J. Zeng Q. Jiang L. Impacts of Topical Treatments and Phototherapy on Stratum Corneum Hydration, Sebum and Elasticity in Vitiligo Skin Dermatol. Ther. 2025 15 1163 1171 10.1007/s13555-025-01398-y PMC12033151 40172744 205. Singh A. Gotherwal V. Junni P. Vijayan V. Tiwari M. Ganju P. Kumar A. Sharma P. Fatima T. Gupta A. Mapping architectural and transcriptional alterations in non-lesional and lesional epidermis in vitiligo Sci. Rep. 2017 7 9860 10.1038/s41598-017-10253-w 28852211 PMC5575244 206. Jung S.-E. Kang H.Y. Lee E.-S. Kim Y.C. Changes of epidermal thickness in vitiligo Am. J. Dermatopathol. 2015 37 289 292 10.1097/DAD.0000000000000171 25072687 207. Bastonini E. Kovacs D. Briganti S. Ottaviani M. D’Arino A. Migliano E. Pacifico A. Iacovelli P. Picardo M. Effects of pioglitazone on the differentiation and inflammation in vitiligo keratinocytes J. Eur. Acad. Dermatol. Venereol. 2024 38 e573 e575 10.1111/jdv.19754 38305589 208. Lin J.Y. Fisher D.E. Melanocyte biology and skin pigmentation Nature 2007 445 843 850 10.1038/nature05660 17314970 209. D’Mello S.A.N. Finlay G.J. Baguley B.C. Askarian-Amiri M.E. Signaling Pathways in Melanogenesis Int. J. Mol. Sci. 2016 17 1144 10.3390/ijms17071144 27428965 PMC4964517 210. Lu L. He H. Feng J. Hu Z. Zhang S. Yang L. Liu Y. Wang T. Post-translational modification in the pathogenesis of vitiligo Immunol. Res. 2024 72 1229 1237 10.1007/s12026-024-09545-x 39320694 PMC11618162 211. Sahoo A. Lee B. Boniface K. Seneschal J. Sahoo S.K. Seki T. Wang C. Das S. Han X. Steppie M. MicroRNA-211 Regulates Oxidative Phosphorylation and Energy Metabolism in Human Vitiligo J. Investig. Dermatol. 2017 137 1965 1974 10.1016/j.jid.2017.04.025 28502800 PMC6233982 212. Mazar J. Qi F. Lee B. Marchica J. Govindarajan S. Shelley J. Li J.-L. Ray A. Perera R.J. MicroRNA 211 Functions as a Metabolic Switch in Human Melanoma Cells Mol. Cell Biol. 2016 36 1090 1108 10.1128/MCB.00762-15 26787841 PMC4800793 213. Shoag J. Haq R. Zhang M. Liu L. Rowe G.C. Jiang A. Koulisis N. Farrel C. Amos C.I. Wei Q. PGC-1 coactivators regulate MITF and the tanning response Mol. Cell 2013 49 145 157 10.1016/j.molcel.2012.10.027 23201126 PMC3753666 214. Kim E.S. Park S.J. Goh M. Na Y. Jo D.S. Jo Y.K. Shin J.H. Choi E.S. Lee H. Kim J. Mitochondrial dynamics regulate melanogenesis through proteasomal degradation of MITF via ROS-ERK activation Pigment. Cell Melanoma Res. 2014 27 1051 1062 10.1111/pcmr.12298 25065405 215. Tanwar J. Saurav S. Basu R. Singh J.B. Priya A. Dutta M. Santhanam U. Joshi M. Madison S. Singh A. Mitofusin-2 Negatively Regulates Melanogenesis by Modulating Mitochondrial ROS Generation Cells 2022 11 701 10.3390/cells11040701 35203350 PMC8869806 216. Gonzalez A. Hall M.N. Lin S.-C. Hardie D.G. AMPK and TOR: The Yin and Yang of Cellular Nutrient Sensing and Growth Control Cell Metab. 2020 31 472 492 10.1016/j.cmet.2020.01.015 32130880 217. Papaccio F. Bellei B. Ottaviani M. D’Arino A. Truglio M. Caputo S. Cigliana G. Sciuto L. Migliano E. Pacifico A. A Possible Modulator of Vitiligo Metabolic Impairment: Rethinking a PPARγ Agonist Cells 2022 11 3583 10.3390/cells11223583 36429011 PMC9688513 218. Dell’Anna M.L. Ottaviani M. Albanesi V. Vidolin A.P. Leone G. Ferraro C. Cossarizza A. Rossi L. Picardo M. Membrane lipid alterations as a possible basis for melanocyte degeneration in vitiligo J. Investig. Dermatol. 2007 127 1226 1233 10.1038/sj.jid.5700700 17235326 219. Agarwal P. Rashighi M. Essien K.I. Richmond J.M. Randall L. Pazoki-Toroudi H. Hunter C.A. Harris J.E. Simvastatin Prevents and Reverses Depigmentation in a Mouse Model of Vitiligo J. Investig. Dermatol. 2015 135 1080 1088 10.1038/jid.2014.529 25521459 PMC4366328 220. Noel M. Gagne C. Bergeron J. Jobin J. Poirier P. Positive pleiotropic effects of HMG-CoA reductase inhibitor on vitiligo Lipids Health Dis. 2004 3 7 10.1186/1476-511X-3-7 15134579 PMC425594 221. Sadagurski M. Yakar S. Weingarten G. Holzenberger M. Rhodes C.J. Breitkreutz D. Leroith D. Wertheimer E. Insulin-like growth factor 1 receptor signaling regulates skin development and inhibits skin keratinocyte differentiation Mol. Cell Biol. 2006 26 2675 2687 10.1128/MCB.26.7.2675-2687.2006 16537911 PMC1430337 222. Sharma Y.K. Bansal P. Menon S. Prakash N. Metabolic syndrome in vitiligo patients among a semi-urban Maharashtrian population: A case control study Diabetes Metab. Syndr. Clin. Res. Rev. 2017 11 (Suppl. 1) S77 S80 10.1016/j.dsx.2016.12.009 28017282 223. Farag A.G.A. Badr E.A.E. El-Shafey A.E.-S.S. Elshaib M.E. Fatty acid-binding protein 4 circulating levels in non-segmental vitiligo An. Bras. Dermatol. 2022 97 28 36 10.1016/j.abd.2021.04.014 34839983 PMC8799849 224. D’Arino A. Picardo M. Truglio M. Pacifico A. Iacovelli P. Metabolic Comorbidities in Vitiligo: A Brief Review and Report of New Data from a Single-Center Experience Int. J. Mol. Sci. 2021 22 8820 10.3390/ijms22168820 34445526 PMC8396221 225. Atas H. Gonul M. Increased Risk of Metabolic Syndrome in Patients with Vitiligo Balk. Med. J. 2017 34 219 225 10.4274/balkanmedj.2016.1005 PMC5450861 28443562 226. Chang H.-C. Lin M.-H. Huang Y.-C. Hou T.-Y. The association between vitiligo and diabetes mellitus: A systematic review and meta-analysis J. Am. Acad. Dermatol. 2019 81 1442 1445 10.1016/j.jaad.2019.06.022 31228523 227. Tanacan E. Atakan N. Higher incidence of metabolic syndrome components in vitiligo patients: A prospective cross-sectional study An. Bras. Dermatol. 2020 95 165 172 10.1016/j.abd.2019.07.006 32113676 PMC7175042 228. Zhao L. Hu M. Li L. Identifying the Genetic Associations Between Diabetes Mellitus and the Risk of Vitiligo Clin. Cosmet. Investig. Dermatol. 2024 17 2261 2271 10.2147/CCID.S480199 39421797 PMC11484772 229. Xu W. Qiu Z. Li C. Wang Y. Lin M. Liu Y. Wen Y. Zheng W. Recurrence and risk factors in cured patients with vitiligo: A real-life single-center retrospective study J. Cosmet. Dermatol. 2023 22 1680 1684 10.1111/jocd.15637 36721299 230. Majid I. Imran S. Relapse after methylprednisolone oral minipulse therapy in childhood vitiligo: A 12-month follow-up study Indian J. Dermatol. 2013 58 113 116 10.4103/0019-5154.108040 23716799 PMC3657209 Figure 1 Schematic representation of normal skin ( A B Figure 2 Summary of the damage and associated pathways due to oxidative stress in vitiligo. The accumulation of reactive oxygen species (ROS) in melanocytes results in extensive intracellular damage. Mitochondrial dysfunction, DNA damage, endoplasmic reticulum (ER) stress, and impairment of Nrf2-mediated antioxidant signaling collectively contribute to redox imbalance. This oxidative environment promotes melanocyte senescence and predisposes cells to apoptosis. Figure 3 Representation of different mechanisms of cell death involved in the disappearance of melanocytes in vitiligo skin. Multiple regulated cell death pathways are activated in melanocytes from vitiligo patients, as indicated by changes in specific markers and signaling cascades. Each pathway contributes to melanocyte loss and may trigger the release of damage-associated molecular patterns (DAMPs), thereby promoting immune cell recruitment and perpetuating autoimmunity. Figure 4 Intrinsic metabolic abnormalities in vitiligo. Metabolic dysfunctions increase melanocyte susceptibility to stress and immune-mediated damage. Metabolic impairment includes defects in glucose and lipid metabolism, and reduced energy availability due to impaired autophagic and catabolic processes, which are further exacerbated by lineage-specific anabolic activities such as melanin synthesis and distribution. biomedicines-13-02177-t001_Table 1 Table 1 Legend: Clinical trials were extracted from clinicaltrials.gov and euclinicaltrials.eu, selecting for “active recruiting”, “recruiting”, “active, not recruiting”, “active, not yet recruiting”, “completed”. “Unknown status” means that the study has passed its completion date, and its status has not been verified in more than two years, and “Withdrawn” studies were excluded. Studies directly targeting the immune system and regenerative medicine-based approaches were also not included.  Pathogenic Experimental Proposed Target Clinical-Level Clinical-Level  Oxidative Stress Chronic impairment of redox equilibrium and diminished capacity to activate cellular defense mechanisms after injury In vivo and in vivo ROS accumulation, reduced activity of antioxidant enzymes, low level of small scavenger molecules Topical and orally supplemented enzymatic and nonenzymatic antioxidant Stress response in vitiligo ( NCT02797574 NCT05812079 Oral Ginkgo biloba ( NCT00907062 NCT01006421 NCT05812079 NCT03036995 NCT03941808 NCT03608917  Senescence Loss of fully functional melanocytes, possible recruitment of immune system Presence of senescence markers (p16, p21, GADD45) and SASPs (MMPs, IGFBPs, cytokines) Proposed use of senolytic/antioxidant repurposed compounds No data at clinical level, preclinical evidence Topical Ramamycin ( NCT05342519  Melanocyte Cell Death High melanocyte turnover, likely release of DAMPs and amplification of immune response Presence of apoptosis-, necroptosis-, ferroptosis-, pyroptosis-, and autophagy-related cell death markers Blockage of intrinsic and extrinsic processes implicated in cell death Evaluation of pyroptosis ( NCT06261086 NCT05869942 Oral Afamelanotide ( NCT06109649 NCT05210582 NCT04525157 NCT01430195 NCT01382589  Metabolism Abnormal lipid profile, dysfunctional mitochondria, accumulation of glycated molecules In vitro and in vivo increased cholesterol, lipid peroxidation, AGEs mTOR pathway inhibition, Metabolic syndrome comorbidities ( NCT03622320 NCT05968235 NCT04789993 NCT05525741 Oral Sinvastatin ( NCT01517893 NCT02432534 NCT03247400 NCT02432534 NCT04872257 NCT05364567 NCT05342519 * Treatment associated with phototherapy; # same study possibly targeting more pathogenic mechanisms. ",
  "metadata": {
    "Title of this paper": "Relapse after methylprednisolone oral minipulse therapy in childhood vitiligo: A 12-month follow-up study",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467848/"
  }
}