{
  "title": "Paper_371",
  "abstract": "Cancer Cancer 319 nihpa Cancer 0008-543X 1097-0142 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12482979 PMC12482979.1 12482979 12482979 NIHMS2110232 39916311 10.1002/cncr.35745 NIHMS2110232 NIHPA2110232 1 Article Community-engaged adaptation of ACCESS: A navigator-led early palliative care intervention for Black and Latina women with advanced breast cancer http://orcid.org/0000-0003-0966-4578 Mazor Melissa PhD, MS, RN 1 Lin Jenny J. MD, MPH 1 Smith Cardinale MD, PhD 1 http://orcid.org/0000-0002-0680-8911 Rosa William E. PhD, MBE, MS 2 Moorehead Dolores APCC 3 Boorstin Rebecca M. BA 1 http://orcid.org/0000-0001-8664-1623 Karpin Jordan BS 1 Nelson Alex BS 1 Bakitas Marie A. DNSc, RN, AOCN, FPCN, FAAN 4 http://orcid.org/0000-0002-6805-2216 Miller Sarah PsyD 1 Odom J. Nicholas PhD, RN, ACHPN, FPCN, FAAN 4 1 2 3 4 Correspondence Melissa.Mazor@mountsinai.org AUTHOR CONTRIBUTIONS Melissa Mazor Jenny J. Lin Cardinale Smith William E. Rosa Dolores Moorehead Rebecca M. Boorstin Jordan Karpin Alex Nelson Marie A. Bakitas Sarah Miller J. Nicholas Odom CONFLICT OF INTEREST STATEMENT The authors declare no conflicts of interest. 15 2 2025 131 4 497820 e35745 e35745 20 09 2025 30 09 2025 01 10 2025 01 10 2025 Introduction: Disparities in early palliative care (PC) access for Black and Latina women with advanced breast cancer (ABC) persist. This study elicited qualitative feedback from patients with ABC and health professionals to adapt a community navigator-led early PC program called ACCESS to improve PC access and supportive care outcomes for Black and Latina women with ABC. Methods: This was a formative evaluation study using a community-engaged approach. Guided by a community advisory board, qualitative interviews were conducted with Black and Latina women with ABC ( N N Results: Findings indicate that ACCESS addresses the early PC needs of Black and Latina women with ABC, yet needs to embed flexibility per patient preferences. Additionally, PC should be introduced as supportive care to enhance acceptability. Navigators emphasized fostering awareness and access to resources, which are crucial for patients' well-being. Strong interdisciplinary relationships and care coordination are essential for embedding ACCESS. Recognizing patient individuality, addressing historical and cultural factors, and ensuring navigators are empathetic, well-trained, and culturally aligned with patients were highlighted as pivotal for the intervention's success. Conclusions: These findings will inform the adaptation of ACCESS for feasibility and preliminary efficacy testing. community engaged intervention development community navigation early palliative care health equity supportive care pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Community-engaged adaptation of ACCESS: A navigator-led early palliative care intervention for Black and Latina women with advanced breast cancer",
    "Journal it was published in:": "Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482979/"
  }
}