{
  "title": "Paper_284",
  "abstract": "pmc Haematologica Haematologica 820 haematol HAEMA Haematologica 0390-6078 1592-8721 Ferrata Storti Foundation PMC12485326 PMC12485326.1 12485326 12485326 40270206 10.3324/haematol.2024.287206 1 Article - Cell Therapy & Immunotherapy Prophylactic and pre-emptive donor lymphocyte infusion in patients with acute myeloid leukemia and myelodysplastic syndrome: validation of current recommendations and proposal of a modified outcome assessment Velázquez Giuliano Filippini  1  2 * Weller Jan Frederic  3  4 * Rubeck Anna  5 * Arndt Tobias  5 Schiele Stefan  5 Mezger Markus  6 Lengerke Claudia  3 Bethge Wolfgang  3 Trepel Martin  1  2 Müller Gernot  5 Christopeit Maximilian  3  4  # Schmid Christoph  1  2  # Contributions GFV and CS obtained ethical approval and performed the literature search. GFV and JFW collected data from clinical charts. MM, CL, WB, MT, MC and CS contributed clinical data and provided logistical support for data collection. AR, TA, SS and GM performed statistical analyses. AR served as the primary statistician, supervised by GM. GFV, JFW and AR created and edited the tables and figures. Figures were mainly prepared by AR with support from TA and SS. GFV, JFW, AR, MC and CS were involved in study conception, data analysis, and interpretation. MC and CS supervised the study as senior authors. GFV and CS drafted the manuscript. JFW, AR, WB, MM and MC revised it critically. All authors approved the final version and submission. 1 University Hospital and Medical Faculty 2 3 University Hospital Tübingen 4 University Medical Center Hamburg Eppendorf 5 Institute of Mathematics, University of Augsburg 6 University Children’s Hospital Tübingen Germany * # C. Schmid Christoph.Schmid@uk-augsburg.de  Disclosures  No conflicts of interest to disclose. 24 4 2025 01 10 2025 110 10 498052 2293 2304 23 12 2024 17 4 2025 24 04 2025 02 10 2025 02 10 2025 Copyright© 2025 Ferrata Storti Foundation https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution Noncommercial License ( by-nc 4.0 Prophylactic and pre-emptive donor lymphocyte infusion (pro/preDLI) is used to prevent hematologic relapse of acute myeloid leukemia and myelodysplastic syndromes after allogeneic stem cell transplantation. Given the lack of prospective trials, outcome reports, risk factor analyses and published recommendations on DLI administration have had to rely on information from registry studies, frequently limited by inconsistent reporting and missing data. We, therefore, performed an extensive review of the charts of recipients of pro/preDLI in two German centers to investigate the clinical applicability of current guidelines in a well-defined cohort. Furthermore, as the outcome after pro/preDLI is unsatisfactorily described by conventional parameters, we constructed a model for “treatment success”, defined as leukemia-free survival without intensive immuno-suppressive treatment for graft- versus pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Recurrence of the underlying malignancy remains the most common cause of treatment failure in patients with high-risk acute myeloid leukemia (AML) and myelodysplastic syndrome (MDS) undergoing allogeneic stem cell transplantation (alloSCT). 1 2-4 Donor lymphocyte infusions (DLI) are given after alloSCT to reinforce the graft- versus 5 6 7-9 10-13 14 15 The major clinical drawback of pro/preDLI is the risk of inducing graft-versus-host disease (GvHD), which might be difficult to manage, require prolonged immunosuppressive treatment, and can cause considerable morbidity and mortality. 12 16 16 17 Methods We included all consecutive adult patients from the centers in Augsburg and Tübingen (Germany) who fulfilled the following criteria: (i) AML or MDS in complete hematologic remission after alloSCT from a matched sibling, matched/ mismatched unrelated, or haploidentical donor; (ii) proDLI or preDLI administered between 2007-2021; (iii) no antileukemic therapy for relapse prevention after alloSCT other than DLI; and (iv) follow-up after the first DLI (DLI1) ≥100 days. DLI for hematologic relapse or viral infections were excluded. All patients provided informed consent to the use of their clinical data for scientific purposes. The study was approved by the Ludwig-Maximilian University Munich ethics board (N: 22-0865). Donor lymphocyte infusions According to local standards, DLI consisted of unmodified CD3 + 11 18 Pro/preDLI administration varied by local standards and over time. PreDLI was repeated until achievement of complete chimerism or MRD-negativity. Subsequent DLI were withheld in the case of GvHD grade I/II. No further DLI were given after development of GvHD grade >II. No prophylactic immunosuppression was used. Intensity of donor lymphocyte infusions Starting in 2019, expert panels from the EBMT recommended doses and intervals for pro/preDLI 19 20 Table 1 16 + + + + Definitions ProDLI was defined as DLI in complete hematologic remission with complete chimerism and undetectable MRD. PreDLI-MRD and preDLI-IC were defined as pre-emptive DLI for MRD or incomplete chimerism (without MRD), respectively. Standard-dose immunosuppression was immunosuppressive treatment as per international guidelines for acute or chronic GvHD, 21 Online Supplementary Methods. Statistics Endpoints included OS, LFS, relapse incidence (RI), leukemia-associated death, non-relapse mortality (NRM), acute and chronic GvHD and treatment success. Follow-up was calculated from the date of DLI1. Standard tests were used for differences in variable distribution, outcome probabilities, and risk factor analysis (details are provided in the Online Supplementary Methods Figure 1 Table 1. Practical recommendations for prophylactic and pre-emptive donor lymphocyte infusion (DLI) by timing and cell dose for the first DLI after allogeneic stem cell transplantation (standard-intensity DLI). Figure 1. Structure of the multistate model. alive, without graft-versus-host disease (GvHD) and without relapse standard-dose immunosuppression (IS) for GvHD relapse being alive without having received IS for GvHD nor experiencing relapse non-relapse mortality (NRM) stop IS or ongoing low-dose IS NRM relapse relapse NRM leukemia-associated death (LAD) Table 2. Characteristics of the patients and donor lymphocyte infusions according to donor lymphocyte infusion intensity. Results Patients’ characteristics Eighty-three patients (AML, N=75; MDS, N=8) with a median age of 58.7 years (range, 24.5-76.1 years) were included ( Table 2 22 No uniform conditioning for alloSCT was used; however, 57% of patients had received a sequential protocol based on the FLAMSA reducing intensity conditioning regimen 18 Online Supplementary Table S1 In vivo Online Supplementary Result Characteristics of the donor lymphocyte infusions Fifty-six (67%) patients received unstimulated donor lymphocytes that were collected by a separate apheresis after alloSCT and 27 (33%) patients received donor lymphocytes collected at the time of donor stem cell harvest. ProDLI was given to 36 (43%) patients, preDLI-IC to 27 (33%), and preDLI-MRD to 20 (24%). Overall, the median time from alloSCT to DLI1 was 5.9 months (range, 1.1-42.9); 6.6 months (range, 3.8-16.3) for proDLI, 5.6 months (range, 3.9-15.4) for preDLI-IC and 5.7 months (range, 1.1-42.9) for preDLI-MRD. The median number of infusions was three (range, 1-5). The reasons for limiting the number of DLI included GvHD (44%), treatment response (31%), physicians’ decision/per protocol (17%), and disease progression (8%). The median number of CD3 + 6 6 As described above, we retrospectively categorized pro/ preDLI intensity based on recent international recommendations ( Table 1 + 6 6 6 P P Table 2 Response to pre-emptive donor lymphocyte infusion Forty-seven patients received preDLI, of whom 39 (83%) showed a primary response (preDLI-IC: 22/27 [82%]; preDLI-MRD 17/20 [85%]). Only 1/22 (5%) patients initially responding to preDLI-IC developed a hematologic relapse thereafter, in contrast to 5/17 (29%) responders to preDLI-MRD. Survival and causes of death The median follow-up from DLI1 among surviving patients was 40 months. The 2-year OS and LFS rates for the entire cohort were 80% (95% confidence interval [95% CI]: 71-90%) and 67% (95% CI: 57-78%), respectively. Divided by type of DLI, the 2-year OS and LFS rates were 81% (95% CI: 69-96%) and 70% (95% CI: 56-88%), respectively, for proDLI, 88% (95% CI: 77-100%) and 74% (95% CI: 59-93%) for preDLI-IC and 65% (95% CI: 46-93%) and 48% (95% CI: 29-80%) for preDLI-MRD. The overall 2-year cumulative RI (regardless of DLI type) was 26% (24% after proDLI, 19% after preDLI-IC, and 49% after preDLI-MRD). The 2-year NRM for the whole population was 8% ( Table 3 Figure 2 Outcome according to donor lymphocyte infusion intensity The 2-year OS and LFS rates were 87% (95% CI: 75-100%) and 72% (95% CI: 58-89%), respectively, after standard-intensity DLI, 92% (95% CI: 82-100%) and 88% (95% CI: 76-100%) after low-intensity DLI, and 54% (95% CI: 35-82%) and 30% (95% CI: 15-62%) after high-intensity DLI. The 2-year RI after standard-, low- and high-intensity DLI were 22%, 8% and 55%, respectively. The corresponding figures for 2-year NRM were 6%, 4% and 14% ( Table 3 Figure 3 Figure 2. Overall and leukemia-free survival, cumulative incidence of relapse, and non-relapse mortality by indication for donor lymphocyte infusion. Table 3. Summary of clinical outcomes according to donor lymphocyte infusion intensity. Graft- versus The 1-year cumulative incidence of acute GvHD grades I-IV, II-IV, and III-IV were 50% (95% CI: 30-60%), 34% (95% CI: 24-44%), and 16% (95% CI: 9-24%), respectively. The 1-year cumulative incidences of limited, and moderate/severe chronic GvHD were 16% (95% CI: 9-25%) and 27% (95% CI: 18-38%), respectively. The median times from DLI1 to acute GvHD and chronic GvHD onset were 2.3 months (range: 0.1-9.0) and 5.2 months (range, 0.2-25.8), respectively. Of 32 patients requiring standard immunosuppressive treatment for acute or chronic GvHD, 25 (78%) could discontinue the treatment after a median of 10.7 months (range, 0.7-121). At last follow-up, seven patients (8%) still required low-dose immunosuppression as defined above. These patients had received immunosuppressive treatment for a median duration of 17.5 months (range, 9-121). The median time between the start of standard immunosuppressive treatment and transition to low-dose treatment was 8.7 months (range, 1.3-16.7). With respect to DLI intensity, the 1-year cumulative incidence of acute GvHD grades II-IV was 29% (95% CI: 15-44%) after standard-intensity DLI, 24% (95% CI: 10-42%) after low-intensity DLI, and 53% (95% CI: 30-72%) after high-intensity DLI. The 1-year cumulative incidence of moderate/severe chronic GvHD was 30% (95% CI: 15-45%) after standard-intensity DLI, 20% (95% CI: 7-38%) after low-intensity DLI, and 33% (95% CI: 14-54%) after high-intensity DLI ( Table 3 End organs affected by graft- versus Clinically significant GvHD requiring systemic immunosuppressive treatment most often affected skin (31%), liver (19%), and oral mucosa (14%). Other organs affected in less than 10% of patients were the lower or upper gastrointestinal tract (7% and 6%, respectively), joints and muscles (7%), eyes (5%) and lungs (5%). Rare manifestations included autoimmune hemolytic anemia, nail dystrophy, sexual organ involvement, and serositis (all 1%) ( Online Supplementary Figures S1 S2 Regarding the response of GvHD in different organs to treatment in the 32 patients requiring systemic immunosuppressive therapy (most frequently based on steroids and a calcineurin inhibitor), we observed an overall response rate of >80% in most organs. Treatment-refractory GvHD rarely occurred but was observed in the lower gastrointestinal tract (N=2), eyes (N=1), oral mucosa (N=1), liver (N=2), and skin (N=2) ( Online Supplementary Table S2 Risk factor analyses As described above, no major differences in outcome parameters were observed between recipients of standard- or low-intensity DLI. Therefore, the two cohorts (N=60) were combined for risk factor analysis and compared to patients receiving high-intensity DLI (N=23). Univariate analysis of risk factors for OS, LFS, NRM and GvHD are shown in Online Supplementary Table S3 Figure 3. Overall and leukemia-free survival, cumulative incidence of relapse, and non-relapse mortality by donor lymphocyte infusion intensity. In multivariable analysis, active disease before alloSCT and high-intensity DLI were associated with worse outcomes. The hazard ratios for OS, LFS, and RI in patients with active disease were 2.81 (95% CI: 1.2-6.5; P P P P P P High-intensity DLI was the only significant risk factor for acute GvHD grades II-IV (HR=2.51, 95% CI: 1.2-5.2; P Table 4 P Online Supplementary Table S4 Exploratory analyses of donor lymphocyte infusions after haploidentical and HLA-mismatched allogeneic stem cell transplants Sixteen patients had received DLI after alloSCT from a haploidentical or a 9/10 HLA-mismatched donor. Clinical outcomes in this selected cohort were not remarkably different from those of the whole cohort of patients. A detailed description is provided in Online Supplementary Table S5 Multistate model analysis and proposal of treatment success as an outcome parameter A multistate Markov model was constructed to evaluate important clinical events after DLI. Figure 4 Table 3 P P Table 4 Online Supplementary Table S3 Table 4. Multivariable analyses of overall survival, leukemia-free survival, relapse incidence, graft- versus Discussion Patients with high-risk AML and MDS achieving complete hematologic remission after alloSCT require effective and safe relapse prevention strategies. Particularly in patients without targeted treatment options, pro/preDLI is a frequently used strategy, but carries the risk of severe, potentially life-threatening GvHD, or might be detrimental for the patients’ quality of life. The concept of separating graft- versus + 12 + + + 16 Table 1 Figure 4. Multistate model for the analysis of clinical events over time after prophylactic or pre-emptive donor lymphocyte infusions. versus In contrast, excellent outcomes could be demonstrated when DLI was administered according to the recommended schedule and dosing. Among patients receiving either standard- or low-intensity DLI, 2-year OS and LFS rates were 92% and 88%, respectively, after low-intensity DLI, and 87% and 72% after standard-intensity DLI, underscoring the safety and the promising outcomes that can be obtained by following current recommendations. Although the overall incidence of GvHD after pro/preDLI was considerable (50%), systemic immunosuppression was only required by about two-thirds of affected patients and, over time, 78% could either discontinue or switch to low-dose immunosuppressive treatment. All patients requiring low-dose immunosuppressive treatment at last follow-up (8%) reported no or minimal complaints related to GvHD or its treatment. Clinical results were comparable among patients receiving DLI as recommended and those receiving low-intensity DLI, suggesting - within the limitation of small numbers - the possibility of eventually further reducing recommended cell doses. Alternative DLI modifications, such as granulocyte colony-stimulating factor-mobilized DLI, infused as early as day +30 after alloSCT, together with ongoing or newly initiated immunosuppression 23 24 25 In a second part of our study, we applied a Markov multistate model to illustrate the clinical course after pro/preDLI over time and introduced the outcome variable “treatment success” to allow for a more real-life based estimate of patients’ outcomes. In the DLI setting, the value of classical endpoints might be limited due to their inability to consider that certain events, in particular GvHD, might be either transient or at least well controlled in a way that they do not impair the quality of life of affected patients. Patients with a high risk of relapse might be ready to accept a certain degree of GvHD or low-dose immunosuppression, as long as hematologic relapse can be avoided. In contrast, induction of severe GvHD might profoundly reduce quality of life, even in the absence of leukemia relapse, thereby questioning DLI as a relapse prevention strategy with acceptable side effects. Taking advantage of the pioneering work by the group from Leiden, 17 Online Supplementary Table S6 Our model differs from the application introduced by the colleagues from Leiden, which had been designed to describe how alloSCT outcomes are influenced by subsequent DLI. In contrast, our model was developed to consider transient events occurring after DLI. In general, the outcome parameters illustrated by multistate models are more flexible and informative than rigid endpoints such as LFS or the cumulative incidence of relapse or GvHD/RI, which are terminal. By allowing a more real-life based description of treatment success following pro/preDLI, the approach underscores the model’s applicability for the description of events and outcome parameters in the context of maintenance treatments after alloSCT. Regarding the influence of DLI intensity on treatment success, in the cohort of patients who had received pro/preDLI in line with current recommendations, treatment success rates after 2 years were 76% and 84% among those receiving standard- and low-intensity DLI, respectively (difference not statistically significant), with limited requirement of standard immunosuppression for the treatment of GvHD, and very low NRM rates. Exploratory analyses showed successful and early discontinuation (>90%) of immunosuppression for GvHD in patients receiving standard- or low-intensity DLI. Limitations of our study include its relatively small sample size, its essential restriction to the setting of in vivo versus 5 26 5 27 FLT3 28 29 In summary, with respect to overall outcome, our results confirm previous observations on pro- and preDLI with high rates of treatment success. Adherence to current EBMT recommendations 16 Supplementary Material Supplementary Appendix  Data-sharing statement  All data generated or analyzed during this study are included in this published article and its supplementary information files. Additional data are available from the corresponding author upon reasonable and justified request. References 1. Horowitz M Schreiber H Elder A Epidemiology and biology of relapse after stem cell transplantation Bone Marrow Transplant 2018 53 11 1379 1389 29670211 10.1038/s41409-018-0171-z PMC6282701 2. Kharfan-Dabaja MA Labopin M Polge E Association of second allogeneic hematopoietic cell transplant vs donor lymphocyte infusion with overall survival in patients with acute myeloid leukemia relapse JAMA Oncol 2018 4 9 1245 1253 30003233 10.1001/jamaoncol.2018.2091 PMC6143013 3. Filippini Velázquez G Labopin M Tischer J Second haploidentical stem cell transplantation (HAPLO-SCT2) after relapse from a first HAPLO-SCT in acute leukaemia-a study on behalf of the Acute Leukaemia Working Party (ALWP) of the European Society for Blood and Marrow Transplantation (EBMT) Bone Marrow Transplant 2023 58 8 907 915 37160941 10.1038/s41409-023-01985-7 PMC10400422 4. Schmälter A-K Ngoya M Finke J Continuously improving outcome over time after second allogeneic stem cell transplantation in relapsed acute myeloid leukemia - a retrospective analysis of 1540 patients on behalf of the Acute Leukemia Working Party of EBMT Blood. 2022 140 Supplement 1 4799 4801 10.1038/s41408-024-01060-4 PMC11066014 38697960 5. Schmid C Kuball J Bug G. Defining the role of donor lymphocyte infusion in high-risk hematologic malignancies J Clin Oncol 2021 39 5 397 418 33434060 10.1200/JCO.20.01719 6. Schmid C Labopin M Nagler A Donor lymphocyte infusion in the treatment of first hematological relapse after allogeneic stem-cell transplantation in adults with acute myeloid leukemia: a retrospective risk factors analysis and comparison with other strategies by the EBMT Acute Leukemia Working Party J Clin Oncol 2007 25 31 4938 4945 17909197 10.1200/JCO.2007.11.6053 7. Dominietto A Pozzi S Miglino M Donor lymphocyte infusions for the treatment of minimal residual disease in acute leukemia Blood 2007 109 11 5063 5064 17522340 10.1182/blood-2007-02-072470 8. Jedlickova Z Schmid C Koenecke C Long-term results of adjuvant donor lymphocyte transfusion in AML after allogeneic stem cell transplantation Bone Marrow Transplant 2016 51 5 663 667 26437060 10.1038/bmt.2015.234 9. Schmid C Labopin M Schaap N Prophylactic donor lymphocyte infusion after allogeneic stem cell transplantation in acute leukaemia - a matched pair analysis by the Acute Leukaemia Working Party of EBMT Br J Haematol 2019 184 5 782 787 30467839 10.1111/bjh.15691 10. de Lima M Bonamino M Vasconcelos Z Prophylactic donor lymphocyte infusions after moderately ablative chemotherapy and stem cell transplantation for hematological malignancies: high remission rate among poor prognosis patients at the expense of graft-versus-host disease Bone Marrow Transplant 2001 27 1 73 78 11244440 10.1038/sj.bmt.1702726 11. Schmid C Schleuning M Ledderose G Tischer J Kolb HJ Sequential regimen of chemotherapy, reduced-intensity conditioning for allogeneic stem-cell transplantation, and prophylactic donor lymphocyte transfusion in high-risk acute myeloid leukemia and myelodysplastic syndrome J Clin Oncol 2005 23 24 5675 5687 16110027 10.1200/JCO.2005.07.061 12. Schmid C Labopin M Schaap N Long-term results and GvHD after prophylactic and preemptive donor lymphocyte infusion after allogeneic stem cell transplantation for acute leukemia Bone Marrow Transplant 2022 57 2 215 223 34750562 10.1038/s41409-021-01515-3 PMC8821014 13. Weller JF Mezger M Seifert LL Time-dependent analysis of adoptive immunotherapy following sequential FLAMSA-reduced intensity conditioning and allogeneic hematopoietic stem cell transplantation in patients with high-risk myeloid neoplasia Eur J Haematol 2022 108 3 244 263 34902880 10.1111/ejh.13732 14. Lee CJ Savani BN Mohty M Post-remission strategies for the prevention of relapse following allogeneic hematopoietic cell transplantation for high-risk acute myeloid leukemia: expert review from the Acute Leukemia Working Party of the European Society for Blood and Marrow Transplantation Bone Marrow Transplant 2019 54 4 519 530 30104717 10.1038/s41409-018-0286-2 15. Mohty R El Hamed R Brissot E Bazarbachi A Mohty M. New drugs before, during, and after hematopoietic stem cell transplantation for patients with acute myeloid leukemia Haematologica 2023 108 2 321 341 36722403 10.3324/haematol.2022.280798 PMC9890036 16. Pagliuca S Schmid C Santoro N Donor lymphocyte infusion after allogeneic haematopoietic cell transplantation for haematological malignancies: basic considerations and best practice recommendations from the EBMT Lancet Haematol 2024 11 6 e448 e458 38796194 10.1016/S2352-3026(24)00098-X 17. Eefting M de Wreede LC Halkes CJ Multi-state analysis illustrates treatment success after stem cell transplantation for acute myeloid leukemia followed by donor lymphocyte infusion Haematologica 2016 101 4 506 514 26802054 10.3324/haematol.2015.136846 PMC5004390 18. Schmid C Schleuning M Tischer J Early allo-SCT for AML with a complex aberrant karyotype-results from a prospective pilot study Bone Marrow Transplant 2012 47 1 46 53 21358688 10.1038/bmt.2011.15 19. Frederik Falkenburg JH Schmid C Kolb HJ Locatelli F Kuball J. Delayed transfer of immune cells or the art of donor lymphocyte infusion Carreras E Dufour C Mohty M Kröger N. The EBMT Handbook: Hematopoietic Stem Cell Transplantation and Cellular Therapies Springer Cham 2019 443 448 20. Dholaria B Savani BN Labopin M Clinical applications of donor lymphocyte infusion from an HLA-haploidentical donor: consensus recommendations from the Acute Leukemia Working Party of the EBMT Haematologica 2020 105 1 47 58 31537691 10.3324/haematol.2019.219790 PMC6939532 21. Penack O Marchetti M Ruutu T Prophylaxis and management of graft versus host disease after stem-cell transplantation for haematological malignancies: updated consensus recommendations of the European Society for Blood and Marrow Transplantation Lancet Haematol 2020 7 2 e157 e167 32004485 10.1016/S2352-3026(19)30256-X 22. Döhner H Wei AH Appelbaum FR Diagnosis and management of AML in adults: 2022 recommendations from an international expert panel on behalf of the ELN Blood 2022 140 12 1345 1377 35797463 10.1182/blood.2022016867 23. Huang XJ Wang Y Liu DH Modified donor lymphocyte infusion (DLI) for the prophylaxis of leukemia relapse after hematopoietic stem cell transplantation in patients with advanced leukemia--feasibility and safety study J Clin Immunol 2008 28 4 390 397 18347959 10.1007/s10875-008-9193-4 24. Jaiswal SR Zaman S Chakrabarti A Improved outcome of refractory/relapsed acute myeloid leukemia after posttransplantation cyclophosphamide-based haploidentical transplantation with myeloablative conditioning and early prophylactic granulocyte colony-stimulating factor-mobilized donor lymphocyte infusions Biol Blood Marrow Transplant 2016 22 10 1867 1873 27470289 10.1016/j.bbmt.2016.07.016 25. Tsirigotis P Gkirkas K Kitsiou V Repetitively administered low-dose donor lymphocyte infusion for prevention of relapse after allogeneic stem cell transplantation in patients with high-risk acute leukemia Cancers (Basel) 2021 13 11 2699 34070786 10.3390/cancers13112699 PMC8198731 26. Schneidawind C Jahnke S Schober-Melms I G-CSF administration prior to donor lymphocyte apheresis promotes anti-leukaemic effects in allogeneic HCT patients Br J Haematol 2019 186 1 60 71 30916396 10.1111/bjh.15881 27. Mathew NR Baumgartner F Braun L Sorafenib promotes graft-versus-leukemia activity in mice and humans through IL-15 production in FLT3-ITD-mutant leukemia cells Nat Med 2018 24 3 282 291 29431743 10.1038/nm.4484 PMC6029618 28. Burchert A Bug G Fritz LV Sorafenib maintenance after allogeneic hematopoietic stem cell transplantation for acute myeloid leukemia with FLT3-Internal tandem duplication mutation (SORMAIN) J Clin Oncol 2020 38 26 2993 3002 32673171 10.1200/JCO.19.03345 29. Levis MJ Hamadani M Logan B Gilteritinib as post-transplant maintenance for AML with internal tandem duplication mutation of FLT3 J Clin Oncol 2024 42 15 1766 1775 38471061 10.1200/JCO.23.02474 PMC11095884 ",
  "metadata": {
    "Title of this paper": "Gilteritinib as post-transplant maintenance for AML with internal tandem duplication mutation of FLT3",
    "Journal it was published in:": "Haematologica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485326/"
  }
}