{
  "title": "Paper_1158",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467708 PMC12467708.1 12467708 12467708 41008538 10.3390/biom15091231 biomolecules-15-01231 1 Article Comparative Analysis of Aggregation of β- and γ-Synucleins in Vertebrates https://orcid.org/0000-0002-4794-7037 Bonaccorsi di Patti Maria Carmela 1 Meoni Martina 1 https://orcid.org/0000-0001-7167-4051 Toni Mattia 2 * Mao Xiaobo Academic Editor 1 mariacarmela.bonaccorsi@uniroma1.it meoni.1886166@studenti.uniroma1.it 2 * mattia.toni@uniroma1.it 26 8 2025 9 2025 15 9 497615 1231 14 7 2025 20 8 2025 22 8 2025 26 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ This study explores the structural transitions and aggregation behaviour of recombinant β- and γ-synucleins from five vertebrate species— Cyprinus carpio Danio rerio Xenopus laevis Anolis carolinensis, Homo sapiens A. carolinensis β-synuclein γ-synuclein copper ions thioflavin T fluorescence circular dichroism vertebrates Sapienza Università di Roma RM1201729CB8436F This research was funded by Sapienza Università di Roma (Progetti di Ricerca RM1201729CB8436F). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Synucleins constitute a small, evolutionarily conserved family of vertebrate proteins encompassing three isoforms: α-synuclein (α-syn), β-synuclein (β-syn), and γ-synuclein (γ-syn) [ 1 Each isoform is encoded by a separate gene— SNCA SNCB SNCG 2 3 4 5 6 7 8 9 10 11 12 13 2 14 15 The three isoforms share substantial sequence homology, particularly in the N-terminal region. Phylogenetic evidence suggests that γ-syn is the most ancient isoform, from which α-syn and β-syn later diverged [ 16 17 18 19 20 21 22 23 24 25 26 27 Synucleins are widely recognised as intrinsically disordered proteins [ 28 29 29 α-syn and β-syn have been linked to several neurodegenerative diseases, such as Alzheimer’s disease (AD), Parkinson’s disease (PD), dementia with Lewy bodies (DLB), and multiple system atrophy (MSA) [ 27 30 31 32 33 34 Numerous lines of scientific evidence support the pathological role of α-syn. Aggregated α-syn is a hallmark of synucleinopathies and is present within neuronal and glial inclusions in PD, PD dementia, DLB, and MSA [ 35 36 37 Amino acid substitutions within the protein sequence can profoundly alter the biochemical and biophysical properties of synucleins, conferring pathological characteristics. Multiple α-syn point mutations (e.g., A30P, A53T, A53E, E46K, G51D, and H50Q) have been associated with familial forms of PD and DLB, increasing both aggregation propensity and cytotoxic potential [ 32 38 39 40 41 42 42 43 Experimental evidence further demonstrates that α-syn and β-syn can interact through the formation of heterodimers, the assembly of hetero-oligomers, and the modulation of secondary nucleation events. β-syn may act as a negative regulator of α-syn aggregation and could potentially mitigate the neuropathological alterations induced by α-syn [ 27 44 γ-syn is primarily associated with oncogenic processes, and several studies have demonstrated its involvement in a range of tumour types, including breast cancer [ 45 46 47 48 27 49 43 The structure and aggregation propensity of synucleins can also be modulated by metal ions: Cu 2+ 50 2+ 51 + 52 53 54 55 56 57 58 Given the close relationship between the structural and conformational properties of synucleins and their physiological or pathological roles, it is essential to investigate their structure in detail and to identify the conditions that drive conformational changes and promote aggregation. A diverse array of experimental approaches has been employed to elucidate synuclein structure and aggregation, including Fourier-Transform Infrared spectroscopy [ 59 60 61 62 63 64 65 Although α-syn remains the principal focus of neurodegeneration research, its homologues β-syn and γ-syn have received comparatively little attention, particularly in non-mammalian vertebrates. To date, only a limited number of studies have investigated these isoforms in fish [ 66 67 68 69 70 71 72 73 73 74 75 76 77 78 79 This study aimed to investigate the structural transitions and aggregation kinetics of β-synuclein and γ-synuclein across representative vertebrate classes, using well-established model species for which synuclein-related data are already available in the literature. To this end, we examined teleost fishes ( Cyprinus carpio Danio rerio Xenopus laevis Anolis carolinensis Homo sapiens The results indicate that non-mammalian β-synucleins are less prone to aggregation compared with human β-synuclein, whereas γ-synucleins from all species displayed a greater propensity to aggregate. Furthermore, copper may modulate this process, potentially influencing both the rate and extent of aggregation. 2. Materials and Methods 2.1. Cloning and Production of Recombinant Proteins Coding sequences for human β-syn ( NM_001001502.3 NM_003087.3 NM_001091980 NM_001087359 X. laevis 71 73 C. carpio D. rerio A. carolinensis 70 80 C. carpio XM_019115422.2 XM_042735530.1 D. rerio NM_200969.1 NM_001020652.1 A. carolinensis XM_062970200.1 XM_008114476.3 Escherichia coli 600 g 2 4 2.2. Aggregation Kinetics Aggregation of synuclein (5 µM) was performed at 37 °C with shaking at 160 rpm, in the absence or presence of CuSO 4 2.3. Amino Acid Sequence Analysis Comparative sequence analysis of β- and γ-syn was carried out using Clustal Omega ( https://www.ebi.ac.uk/jdispatcher/msa/clustalo http://bioinf.cs.ucl.ac.uk/psipred/ 81 3. Results and Discussion 3.1. Sequence Variation and Predicted Structural Features of Vertebrate β- and γ-Synucleins Recombinant β- and γ-syns were expressed in E. coli Figure S1 Although synucleins are generally conserved across vertebrates, multiple sequence alignments revealed marked interspecies differences. For β-syn, sequence identity relative to the human isoform was 68.8% for C. carpio D. rerio X. laevis A. carolinensis Figure 1 82 83 γ-Syn exhibited greater divergence, with identity values of 59.1% ( C. carpio D. rerio X. laevis A. carolinensis Figure 1 To investigate potential structural implications of these sequence variations, secondary structure predictions were conducted using the PSIPRED Protein Sequence Analysis Workbench [ 81 Figure 2 Figures S2 and S3 Figure 2 Figure S2 At the N-terminal region (residues 1–36), no β-strands were predicted in any species except D. rerio D. rerio Figure 2 Figure S2 Similar observations were made for γ-syns ( Figure 2 Figure S3 X. laevis A. carolinensis Overall, the sequence divergence and predicted structural variability point to inherent differences in the folding landscapes of vertebrate β- and γ-syns. Such differences are likely to modulate their intrinsic tendency to undergo β-sheet conversion and subsequent fibril formation. To validate this hypothesis, all recombinant synucleins were subjected to in vitro aggregation assays under controlled conditions. Proteins were incubated at 37 °C with constant agitation, in the presence or absence of CuSO 4 84 Figure 3 Figure 4 Figure 5 Figure 6 Figures S4–S17 For interpretative clarity, the aggregation timeline was subdivided into three temporal windows: phase I (0–50 h), phase II (51–100 h), and phase III (101–160 h), which correspond to lag, growth and plateau phases. These intervals facilitated comparisons of aggregation kinetics and structural transitions among species and treatment conditions. 3.2. β-Synucleins: Human β-Syn Aggregates Under In Vitro Conditions, Whereas Non-Mammalian Orthologues Remain Stable ThT fluorescence analysis of human β-syn revealed a progressive increase in intensity from the end of phase I, sustained throughout the remainder of the incubation period ( Figure 3 Figure S8 Figure 3 Figure S9 These findings demonstrate that human β-syn, despite lacking the non-amyloid-β component (NAC) domain found in α-syn, can aggregate under the present in vitro conditions, in agreement with previous reports [ 84 In contrast, non-mammalian β-syn orthologues ( C. carpio D. rerio X. laevis A. carolinensis Figure 3 Figure S8 Figure 3 Figure S9 These data indicate a significantly lower aggregation propensity in non-mammalian β-syn compared with the human isoform. The delayed or minimal transitions may reflect either slower aggregation kinetics or an intrinsically reduced capacity to adopt β-sheet conformations. Extended incubation studies may distinguish between these possibilities. Among the non-mammalian β-syns, C. carpio Figure 3 Figure 3 In vitro aggregation kinetics of β-synucleins from various vertebrate species. ( A y x B y x Figures S8 and S9 C. carpio D. rerio X. laevis A. carolinensis H. sapiens These interspecies differences likely arise from sequence divergence, which may critically modulate protein folding and aggregation behaviour. It is plausible that the lower aggregation propensity of non-mammalian β-syns reflects evolutionary adaptations conferring functional or structural resilience. Indeed, synuclein function is closely associated with protein conformation: in human α-syn, α-helical structures mediate membrane binding and vesicle trafficking [ 85 36 86 Thus, the differing abilities of β-syn orthologues to adopt β-sheet structures may reflect evolutionary divergence in synuclein function across vertebrate lineages. Furthermore, the synuclein gene repertoire varies significantly among species; for example, the genome of D. rerio 87 88 89 3.3. γ-Synucleins: All Orthologues Undergo β-Sheet Transitions with Species-Specific Aggregation Dynamics ThT fluorescence analysis of human γ-syn revealed an early increase during phase I, which intensified through phases II and III ( Figure 4 Figure S10 Figure 4 Figure S11 90 Non-mammalian γ-syn displayed similar behaviour, with increases in both ThT fluorescence and CD ellipticity beginning already in phase I or phase II ( Figure 4 Figures S10 and S11 A. carolinensis X. laevis Figure 4 In vitro aggregation kinetics of γ-synucleins. ( A B Figure 3 Figures S10 and S11 Figure 3 3.4. Copper (CuSO 4 Copper, an essential trace element, functions as a cofactor for numerous enzymes [ 91 36 Although most studies have focused on copper interactions with α-syn, available data indicate that β- and γ-syns also bind Cu 2+ 2+ 92 In human β-syn, two primary Cu 2+ 92 2+ 2+ + 54 93 94 Sequence alignments ( Figure 1 C. carpio X. laevis D. rerio A. carolinensis The effects of metal binding on prion and prion-like proteins such as PrP C 50 51 80 95 96 97 4 For human β-syn, Cu 2+ Figure 5 Figures S12, S13 and S16 54 93 98 99 2+ 2+ In non-mammalian β-syns—which displayed minimal aggregation in the absence of copper—CuSO 4 Figure 5 Figures S12 and S13 A. carolinensis Figure 5 In vitro aggregation kinetics of β-synucleins in the presence of copper. (A B 4 Figure 3 Figures S12 and S13 Although human γ-syn lacks Met5, Met10, and histidine residues, it retains Met1 ( Figure 1 92 2+ Figure 6 Figures S14, S15 and S17 Sequence comparisons of non-mammalian γ-syn revealed species-specific variation in methionine and histidine residues in the N-terminal region ( Figure 1 C. carpio D. rerio X. laevis A. carolinensis X. laevis C. carpio D. rerio A. carolinensis In non-mammalian γ-syn, copper elicited effects similar to those observed for the human protein. High ThT fluorescence and CD signals were recorded in phase III ( Figure 6 Figures S14, S15 and S17 2+ X. laevis Figure 6 In vitro aggregation kinetics of γ-synucleins in the presence of copper. ( A B 4 Figure 3 Figure 4 Figure 3 Figures S14 and S15 4. Conclusions This study provides novel comparative insights into the conformational transitions and aggregation behaviour of β- and γ-syns across diverse vertebrate taxa. Despite their evolutionary conservation, our results reveal marked species-specific differences in both aggregation propensity and copper sensitivity, suggesting divergent physiological roles and adaptive trajectories. The robust aggregation of human β- and γ-syns under in vitro conditions—compared with the more limited structural transitions of non-mammalian isoforms—may reflect evolutionary pressures associated with increased nervous system complexity or longevity. Notably, the ability of human β-syn to form β-sheet-rich aggregates despite lacking the NAC domain highlights the role of subtle sequence determinants and environmental modulators such as metal ions in influencing structural plasticity. Copper exposure elicited differential effects across taxa, exerting a protective, anti-aggregative influence on human β-syn, while enhancing aggregation in A. carolinensis Furthermore, the pronounced aggregation of γ-syn—even in species lacking α-syn, such as D. rerio While the present study relied on ThT fluorescence and CD spectroscopy, additional methodologies such as transmission electron microscopy (TEM) or atomic force microscopy (AFM) will be important to confirm the amyloid nature and morphology of any fibrils formed. Likewise, direct copper-binding assays (e.g., ITC or MST) and site-directed mutagenesis approaches—such as testing clinically relevant substitutions exemplified by human V70M—will be required to substantiate and extend the present findings. Altogether, our results underscore the importance of studying protein dynamics in an evolutionary context. The species-specific aggregation patterns and responses to metal ions observed here may provide important clues to the physiological diversity of synucleins and their involvement in neurodegenerative disorders. Future studies employing these complementary biophysical and genetic approaches, together with cellular and in vivo models, will be essential to determine the functional significance of the interspecies differences identified here and their relevance to synucleinopathies. Acknowledgments The authors wish to thank Amalys Sofia Sanchez Garcia for her valuable assistance in the revision and preparation of the figures. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/biom15091231/s1 A. carolinensis C. carpio D. rerio H. sapiens X. laevis ; A. carolinensis C. carpio D. rerio H. sapiens C. carpio D. rerio X. laevis A. carolinensis H. sapiens http://bioinf.cs.ucl.ac.uk/psipred/ 81 C. carpio D. rerio X. laevis A. carolinensis H. sapiens 4 4 C. carpio D. rerio X. laevis A. carolinensis H. sapiens C. carpio D. rerio X. laevis A. carolinensis H. sapiens 4 4 4 4 C. carpio D. rerio X. laevis A. carolinensis H. sapiens 4 Figure 3 Figure 5 Figure 3 Figure 4 Figure 6 4 Figure 3 Author Contributions Conceptualization, M.C.B.d.P. and M.T.; methodology, M.C.B.d.P., M.M. and M.T.; software, M.C.B.d.P. and M.T.; validation, M.C.B.d.P. and M.M.; formal analysis, M.C.B.d.P. and M.T.; investigation, M.C.B.d.P., M.M. and M.T.; resources, M.T.; data curation, M.C.B.d.P. and M.T.; writing—original draft preparation, M.T.; writing—review and editing, M.C.B.d.P. and M.T.; visualisation, M.C.B.d.P. and M.T.; supervision, M.C.B.d.P. and M.T.; project administration, M.C.B.d.P. and M.T.; funding acquisition, M.T. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The data presented in this study are available in this article and the Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: AD Alzheimer’s disease CD Circular dichroism AFM Atomic force microscopy DLB Dementia with Lewy bodies ITC Isothermal titration calorimetry MSA Multiple system atrophy MST Microscale thermophoresis NAC Non-amyloid component PD Parkinson’s disease TEM Transmission electron microscopy ThT Thioflavin T References 1. George J.M. The synucleins Genome Biol. 2002 3 REVIEWS3002 10.1186/gb-2001-3-1-reviews3002 11806835 PMC150459 2. Lavedan C. Leroy E. Dehejia A. Buchholtz S. Dutra A. Nussbaum R.L. Polymeropoulos M.H. Identification, localization and characterization of the human gamma-synuclein gene Hum. Genet. 1998 103 106 112 10.1007/s004390050792 9737786 3. Campion D. Martin C. Heilig R. Charbonnier F. Moreau V. Flaman J.M. Petit J.L. Hannequin D. Brice A. Frebourg T. The NACP/synuclein gene: Chromosomal assignment and screening for alterations in Alzheimer disease Genomics 1995 26 254 257 10.1016/0888-7543(95)80208-4 7601450 4. Chen X. de Silva H.A. Pettenati M.J. Rao P.N. George-Hyslop P.S. Roses A.D. Xia Y. Horsburgh K. Ueda K. Saitoh T. The human NACP/alpha-synuclein gene: Chromosome assignment to 4q21.3-q22 and TaqI RFLP analysis Genomics 1995 26 425 427 10.1016/0888-7543(95)80237-G 7601479 5. Shibasaki Y. Baillie D.A. St Clair D. Brookes A.J. High-resolution mapping of SNCA encoding alpha-synuclein, the non-A beta component of Alzheimer’s disease amyloid precursor, to human chromosome 4q21.3→q22 by fluorescence in situ hybridization Cytogenet. Cell Genet. 1995 71 54 55 10.1159/000134061 7606927 6. Lavedan C. Dehejia A. Pike B. Dutra A. Leroy E. Ide S.E. Root H. Rubenstein J. Boyer R.L. Chandrasekharappa S. Contig map of the Parkinson’s disease region on 4q21-q23 DNA Res. Int. J. Rapid Publ. Rep. Genes Genomes 1998 5 19 23 10.1093/dnares/5.1.19 9628579 7. Nakajo S. Tsukada K. Omata K. Nakamura Y. Nakaya K. A new brain-specific 14-kDa protein is a phosphoprotein. Its complete amino acid sequence and evidence for phosphorylation Eur. J. Biochem. 1993 217 1057 1063 10.1111/j.1432-1033.1993.tb18337.x 8223629 8. Ueda K. Fukushima H. Masliah E. Xia Y. Iwai A. Yoshimoto M. Otero D.A. Kondo J. Ihara Y. Saitoh T. Molecular cloning of cDNA encoding an unrecognized component of amyloid in Alzheimer disease Proc. Natl. Acad. Sci. USA 1993 90 11282 11286 10.1073/pnas.90.23.11282 8248242 PMC47966 9. Jakes R. Spillantini M.G. Goedert M. Identification of two distinct synucleins from human brain FEBS Lett. 1994 345 27 32 10.1016/0014-5793(94)00395-5 8194594 10. Nakajo S. Shioda S. Nakai Y. Nakaya K. Localization of phosphoneuroprotein 14 (PNP 14) and its mRNA expression in rat brain determined by immunocytochemistry and in situ hybridization Mol. Brain Res. 1994 27 81 86 10.1016/0169-328X(94)90187-2 7877458 11. Iwai A. Masliah E. Yoshimoto M. Ge N. Flanagan L. de Silva H.A. Kittel A. Saitoh T. The precursor protein of non-A beta component of Alzheimer’s disease amyloid is a presynaptic protein of the central nervous system Neuron 1995 14 467 475 10.1016/0896-6273(95)90302-X 7857654 12. Akopian A.N. Wood J.N. Peripheral nervous system-specific genes identified by subtractive cDNA cloning J. Biol. Chem. 1995 270 21264 21270 10.1074/jbc.270.36.21264 7673161 13. Ji H. Liu Y.E. Jia T. Wang M. Liu J. Xiao G. Joseph B.K. Rosen C. Shi Y.E. Identification of a breast cancer-specific gene, BCSG1, by direct differential cDNA sequencing Cancer Res. 1997 57 759 764 9044857 14. Buchman V.L. Hunter H.J. Pinon L.G. Thompson J. Privalova E.M. Ninkina N.N. Davies A.M. Persyn, a member of the synuclein family, has a distinct pattern of expression in the developing nervous system J. Neurosci. Off. J. Soc. Neurosci. 1998 18 9335 9341 10.1523/JNEUROSCI.18-22-09335.1998 9801372 PMC6792889 15. Brenz Verca M.S. Bahi A. Boyer F. Wagner G.C. Dreyer J.L. Distribution of alpha- and gamma-synucleins in the adult rat brain and their modification by high-dose cocaine treatment Eur. J. Neurosci. 2003 18 1923 1938 10.1046/j.1460-9568.2003.02913.x 14622225 16. Yuan J. Zhao Y. Evolutionary aspects of the synuclein super-family and sub-families based on large-scale phylogenetic and group-discrimination analysis Biochem. Biophys. Res. Commun. 2013 441 308 317 10.1016/j.bbrc.2013.09.132 24140056 17. Sung Y.H. Eliezer D. Secondary structure and dynamics of micelle bound beta- and gamma-synuclein Protein Sci. A Publ. Protein Soc. 2006 15 1162 1174 10.1110/ps.051803606 PMC2242515 16597821 18. Giasson B.I. Murray I.V. Trojanowski J.Q. Lee V.M. A hydrophobic stretch of 12 amino acid residues in the middle of alpha-synuclein is essential for filament assembly J. Biol. Chem. 2001 276 2380 2386 10.1074/jbc.M008919200 11060312 19. McDowall J.S. Brown D.R. Alpha-synuclein: Relating metals to structure, function and inhibition Met. Integr. Biometal Sci. 2016 8 385 397 10.1039/c6mt00026f 26864076 20. Hashimoto M. Rockenstein E. Mante M. Mallory M. Masliah E. beta-Synuclein inhibits alpha-synuclein aggregation: A possible role as an anti-parkinsonian factor Neuron 2001 32 213 223 10.1016/S0896-6273(01)00462-7 11683992 21. Lee D. Paik S.R. Choi K.Y. Beta-synuclein exhibits chaperone activity more efficiently than alpha-synuclein FEBS Lett. 2004 576 256 260 10.1016/j.febslet.2004.08.075 15474047 22. Fan Y. Limprasert P. Murray I.V. Smith A.C. Lee V.M. Trojanowski J.Q. Sopher B.L. La Spada A.R. Beta-synuclein modulates alpha-synuclein neurotoxicity by reducing alpha-synuclein protein expression Hum. Mol. Genet. 2006 15 3002 3011 10.1093/hmg/ddl242 16959793 23. Park J.Y. Lansbury P.T. Jr. Beta-synuclein inhibits formation of alpha-synuclein protofibrils: A possible therapeutic strategy against Parkinson’s disease Biochemistry 2003 42 3696 3700 10.1021/bi020604a 12667059 24. Uversky V.N. Li J. Souillac P. Millett I.S. Doniach S. Jakes R. Goedert M. Fink A.L. Biophysical properties of the synucleins and their propensities to fibrillate: Inhibition of alpha-synuclein assembly by beta- and gamma-synucleins J. Biol. Chem. 2002 277 11970 11978 10.1074/jbc.M109541200 11812782 25. Williams J.K. Yang X. Atieh T.B. Olson M.P. Khare S.D. Baum J. Multi-Pronged Interactions Underlie Inhibition of alpha-Synuclein Aggregation by beta-Synuclein J. Mol. Biol. 2018 430 2360 2371 10.1016/j.jmb.2018.05.024 29782835 PMC6100766 26. Leitao A. Bhumkar A. Hunter D.J.B. Gambin Y. Sierecki E. Unveiling a Selective Mechanism for the Inhibition of alpha-Synuclein Aggregation by beta-Synuclein Int. J. Mol. Sci. 2018 19 334 10.3390/ijms19020334 29364143 PMC5855556 27. Xian M. Li J. Liu T. Hou K. Sun L. Wei J. beta-Synuclein Intermediates alpha-Synuclein Neurotoxicity in Parkinson’s Disease ACS Chem. Neurosci. 2024 15 2445 2453 10.1021/acschemneuro.4c00263 38905183 28. Uversky V.N. Oldfield C.J. Dunker A.K. Intrinsically disordered proteins in human diseases: Introducing the D2 concept Annu. Rev. Biophys. 2008 37 215 246 10.1146/annurev.biophys.37.032807.125924 18573080 29. Davidson W.S. Jonas A. Clayton D.F. George J.M. Stabilization of alpha-synuclein secondary structure upon binding to synthetic membranes J. Biol. Chem. 1998 273 9443 9449 10.1074/jbc.273.16.9443 9545270 30. Mohaupt P. Pons M.L. Vialaret J. Delaby C. Hirtz C. Lehmann S. beta-Synuclein as a candidate blood biomarker for synaptic degeneration in Alzheimer’s disease Alzheimer’s Res. Ther. 2022 14 179 10.1186/s13195-022-01125-1 36451155 PMC9710176 31. Shim K.H. Kang M.J. Youn Y.C. An S.S.A. Kim S. Alpha-synuclein: A pathological factor with Abeta and tau and biomarker in Alzheimer’s disease Alzheimer’s Res. Ther. 2022 14 201 10.1186/s13195-022-01150-0 36587215 PMC9805257 32. Yaribash S. Mohammadi K. Sani M.A. Alpha-Synuclein Pathophysiology in Neurodegenerative Disorders: A Review Focusing on Molecular Mechanisms and Treatment Advances in Parkinson’s Disease Cell. Mol. Neurobiol. 2025 45 30 10.1007/s10571-025-01544-2 40140103 PMC11947388 33. Abdul-Rahman T. Herrera-Calderon R.E. Ahluwalia A. Wireko A.A. Ferreira T. Tan J.K. Wolfson M. Ghosh S. Horbas V. Garg V. The potential of phosphorylated alpha-synuclein as a biomarker for the diagnosis and monitoring of multiple system atrophy CNS Neurosci. Ther. 2024 30 e14678 10.1111/cns.14678 38572788 PMC10993367 34. Mori F. Nishie M. Yoshimoto M. Takahashi H. Wakabayashi K. Reciprocal accumulation of beta-synuclein in alpha-synuclein lesions in multiple system atrophy Neuroreport 2003 14 1783 1786 10.1097/00001756-200310060-00005 14534420 35. Goedert M. Alpha-synuclein and neurodegenerative diseases Nat. Rev. Neurosci. 2001 2 492 501 10.1038/35081564 11433374 36. Toni M. Massimino M.L. De Mario A. Angiulli E. Spisni E. Metal Dyshomeostasis and Their Pathological Role in Prion and Prion-Like Diseases: The Basis for a Nutritional Approach Front. Neurosci. 2017 11 3 10.3389/fnins.2017.00003 28154522 PMC5243831 37. Prusiner S.B. Woerman A.L. Mordes D.A. Watts J.C. Rampersaud R. Berry D.B. Patel S. Oehler A. Lowe J.K. Kravitz S.N. Evidence for alpha-synuclein prions causing multiple system atrophy in humans with parkinsonism Proc. Natl. Acad. Sci. USA 2015 112 E5308 E5317 10.1073/pnas.1514475112 26324905 PMC4586853 38. Boyer D.R. Li B. Sun C. Fan W. Sawaya M.R. Jiang L. Eisenberg D.S. Structures of fibrils formed by alpha-synuclein hereditary disease mutant H50Q reveal new polymorphs Nat. Struct. Mol. Biol. 2019 26 1044 1052 10.1038/s41594-019-0322-y 31695184 PMC6907165 39. Conway K.A. Lee S.J. Rochet J.C. Ding T.T. Williamson R.E. Lansbury P.T. Jr. Acceleration of oligomerization, not fibrillization, is a shared property of both alpha-synuclein mutations linked to early-onset Parkinson’s disease: Implications for pathogenesis and therapy Proc. Natl. Acad. Sci. USA 2000 97 571 576 10.1073/pnas.97.2.571 10639120 PMC15371 40. Lazaro D.F. Rodrigues E.F. Langohr R. Shahpasandzadeh H. Ribeiro T. Guerreiro P. Gerhardt E. Krohnert K. Klucken J. Pereira M.D. Systematic comparison of the effects of alpha-synuclein mutations on its oligomerization and aggregation PLoS Genet. 2014 10 e1004741 10.1371/journal.pgen.1004741 25393002 PMC4230739 41. Rutherford N.J. Giasson B.I. The A53E alpha-synuclein pathological mutation demonstrates reduced aggregation propensity in vitro and in cell culture Neurosci. Lett. 2015 597 43 48 10.1016/j.neulet.2015.04.022 25892596 PMC4476064 42. Fujita M. Sekigawa A. Sekiyama K. Takamatsu Y. Hashimoto M. Possible alterations in beta-Synuclein, the non-amyloidogenic homologue of alpha-Synuclein, during progression of sporadic alpha-synucleinopathies Int. J. Mol. Sci. 2012 13 11584 11592 10.3390/ijms130911584 23109872 PMC3472764 43. Aubrey L.D. Ninkina N. Ulamec S.M. Abramycheva N.Y. Vasili E. Devine O.M. Wilkinson M. Mackinnon E. Limorenko G. Walko M. Substitution of Met-38 to Ile in gamma-synuclein found in two patients with amyotrophic lateral sclerosis induces aggregation into amyloid Proc. Natl. Acad. Sci. USA 2024 121 e2309700120 10.1073/pnas.2309700120 38170745 PMC10786281 44. Williams J.K. Yang X. Baum J. Interactions between the Intrinsically Disordered Proteins beta-Synuclein and alpha-Synuclein Proteomics 2018 18 e1800109 10.1002/pmic.201800109 30142698 PMC6447293 45. Cirak Y. Furuncuoglu Y. Yapicier O. Alici S. Argon A. Predictive and prognostic values of BubR1 and synuclein-gamma expression in breast cancer Int. J. Clin. Exp. Pathol. 2015 8 5345 5353 26191236 PMC4503107 46. Ni M. Zhao Y. Wang X. Suppression of synuclein gamma inhibits the movability of endometrial carcinoma cells by PI3K/AKT/ERK signaling pathway Genes Genom. 2021 43 633 641 10.1007/s13258-021-01080-5 33788083 47. Yang J. Ren Z. Wang F. Zheng J. Zhuang Z. Zeng Y. gamma-Synuclein promotes proliferation and inhibits apoptosis of oral squamous cell carcinoma via JAK2/STAT5b signaling pathway Am. J. Cancer Res. 2024 14 2408 2423 10.62347/FLIM3367 38859859 PMC11162669 48. Takemura Y. Ojima H. Oshima G. Shinoda M. Hasegawa Y. Kitago M. Yagi H. Abe Y. Hori S. Fujii-Nishimura Y. Gamma-synuclein is a novel prognostic marker that promotes tumor cell migration in biliary tract carcinoma Cancer Med. 2021 10 5599 5613 10.1002/cam4.4121 34245137 PMC8366101 49. Buchman V.L. Adu J. Pinon L.G. Ninkina N.N. Davies A.M. Persyn, a member of the synuclein family, influences neurofilament network integrity Nat. Neurosci. 1998 1 101 103 10.1038/349 10195122 50. Paik S.R. Shin H.J. Lee J.H. Chang C.S. Kim J. Copper(II)-induced self-oligomerization of alpha-synuclein Biochem. J. 1999 340 Pt 3 821 828 10.1042/bj3400821 10359669 PMC1220316 51. Uversky V.N. Li J. Fink A.L. Metal-triggered structural transformations, aggregation, and fibrillation of human alpha-synuclein. A possible molecular NK between Parkinson’s disease and heavy metal exposure J. Biol. Chem. 2001 276 44284 44296 10.1074/jbc.M105343200 11553618 52. Wang C. Liu L. Zhang L. Peng Y. Zhou F. Redox reactions of the alpha-synuclein-Cu 2+ Biochemistry 2010 49 8134 8142 10.1021/bi1010909 20701279 PMC2939719 53. Fink A.L. The aggregation and fibrillation of alpha-synuclein Acc. Chem. Res. 2006 39 628 634 10.1021/ar050073t 16981679 54. Binolfi A. Lamberto G.R. Duran R. Quintanar L. Bertoncini C.W. Souza J.M. Cervenansky C. Zweckstetter M. Griesinger C. Fernandez C.O. Site-specific interactions of Cu(II) with alpha and beta-synuclein: Bridging the molecular gap between metal binding and aggregation J. Am. Chem. Soc. 2008 130 11801 11812 10.1021/ja803494v 18693689 55. Binolfi A. Rodriguez E.E. Valensin D. D’Amelio N. Ippoliti E. Obal G. Duran R. Magistrato A. Pritsch O. Zweckstetter M. Bioinorganic chemistry of Parkinson’s disease: Structural determinants for the copper-mediated amyloid formation of alpha-synuclein Inorg. Chem. 2010 49 10668 10679 10.1021/ic1016752 20964419 56. Deas E. Cremades N. Angelova P.R. Ludtmann M.H. Yao Z. Chen S. Horrocks M.H. Banushi B. Little D. Devine M.J. Alpha-Synuclein Oligomers Interact with Metal Ions to Induce Oxidative Stress and Neuronal Death in Parkinson’s Disease Antioxid. Redox Signal. 2016 24 376 391 10.1089/ars.2015.6343 26564470 PMC4999647 57. Lautenschlager J. Stephens A.D. Fusco G. Strohl F. Curry N. Zacharopoulou M. Michel C.H. Laine R. Nespovitaya N. Fantham M. C-terminal calcium binding of alpha-synuclein modulates synaptic vesicle interaction Nat. Commun. 2018 9 712 10.1038/s41467-018-03111-4 29459792 PMC5818535 58. Gonzalez-Garcia M. Fusco G. De Simone A. Metal interactions of alpha-synuclein probed by NMR amide-proton exchange Front. Chem. 2023 11 1167766 10.3389/fchem.2023.1167766 37201129 PMC10187754 59. Uversky V.N. Li J. Fink A.L. Evidence for a partially folded intermediate in alpha-synuclein fibril formation J. Biol. Chem. 2001 276 10737 10744 10.1074/jbc.M010907200 11152691 60. Chen S.W. Drakulic S. Deas E. Ouberai M. Aprile F.A. Arranz R. Ness S. Roodveldt C. Guilliams T. De-Genst E.J. Structural characterization of toxic oligomers that are kinetically trapped during alpha-synuclein fibril formation Proc. Natl. Acad. Sci. USA 2015 112 E1994 E2003 10.1073/pnas.1421204112 25855634 PMC4413268 61. Heise H. Hoyer W. Becker S. Andronesi O.C. Riedel D. Baldus M. Molecular-level secondary structure, polymorphism, and dynamics of full-length alpha-synuclein fibrils studied by solid-state NMR Proc. Natl. Acad. Sci. USA 2005 102 15871 15876 10.1073/pnas.0506109102 16247008 PMC1276071 62. Sulatskaya A.I. Rodina N.P. Sulatsky M.I. Povarova O.I. Antifeeva I.A. Kuznetsova I.M. Turoverov K.K. Investigation of alpha-Synuclein Amyloid Fibrils Using the Fluorescent Probe Thioflavin T Int. J. Mol. Sci. 2018 19 2486 10.3390/ijms19092486 30142878 PMC6163839 63. Wordehoff M.M. Bannach O. Shaykhalishahi H. Kulawik A. Schiefer S. Willbold D. Hoyer W. Birkmann E. Single fibril growth kinetics of alpha-synuclein J. Mol. Biol. 2015 427 1428 1435 10.1016/j.jmb.2015.01.020 25659910 64. Nath S. Meuvis J. Hendrix J. Carl S.A. Engelborghs Y. Early aggregation steps in alpha-synuclein as measured by FCS and FRET: Evidence for a contagious conformational change Biophys. J. 2010 98 1302 1311 10.1016/j.bpj.2009.12.4290 20371330 PMC2849099 65. Dou T. Matveyenka M. Kurouski D. Elucidation of Secondary Structure and Toxicity of alpha-Synuclein Oligomers and Fibrils Grown in the Presence of Phosphatidylcholine and Phosphatidylserine ACS Chem. Neurosci. 2023 14 3183 3191 10.1021/acschemneuro.3c00314 37603792 PMC10862479 66. Werner T. Kumar R. Horvath I. Scheers N. Wittung-Stafshede P. Abundant fish protein inhibits alpha-synuclein amyloid formation Sci. Rep. 2018 8 5465 10.1038/s41598-018-23850-0 29615738 PMC5882657 67. Boudreau H.S. Krol K.M. Eibl J.K. Williams L.D. Rossiter J.P. Palace V.P. Ross G.M. The association of metal ion exposure with alpha-synuclein-like immunoreactivity in the central nervous system of fish, Catostomus commersoni Aquat. Toxicol. 2009 92 258 263 10.1016/j.aquatox.2009.02.011 19342108 68. Toni M. Cioni C. Fish Synucleins: An Update Mar. Drugs 2015 13 6665 6686 10.3390/md13116665 26528989 PMC4663547 69. Matsui H. Kenmochi N. Namikawa K. Age- and alpha-Synuclein-Dependent Degeneration of Dopamine and Noradrenaline Neurons in the Annual Killifish Nothobranchius furzeri Cell Rep. 2019 26 1727 1733.e6 10.1016/j.celrep.2019.01.015 30759385 70. Vaccaro R. Toni M. Casini A. Vivacqua G. Yu S. D’Este L. Cioni C. Localization of alpha-synuclein in teleost central nervous system: Immunohistochemical and Western blot evidence by 3D5 monoclonal antibody in the common carp, Cyprinus carpio J. Comp. Neurol. 2015 523 1095 1124 10.1002/cne.23722 25488013 71. Bonaccorsi di Patti M.C. Angiulli E. Casini A. Vaccaro R. Cioni C. Toni M. Synuclein Analysis in Adult Xenopus laevis Int. J. Mol. Sci. 2022 23 6058 10.3390/ijms23116058 35682736 PMC9181771 72. Wang C. Liu Y. Chan W.Y. Chan S.O. Grunz H. Zhao H. Characterization of three synuclein genes in Xenopus laevis Dev. Dyn. Off. Publ. Am. Assoc. Anat. 2011 240 2028 2033 10.1002/dvdy.22693 21761485 73. Toni M. Cioni C. De Angelis F. di Patti M.C. Synuclein expression in the lizard Anolis carolinensis J. Comp. Physiol. A Neuroethol. Sens. Neural Behav. Physiol. 2016 202 577 595 10.1007/s00359-016-1108-x 27393691 74. Seleem A.A. Expression of alpha-synuclein during eye development of mice (Mus musculus), chick (Gallus gallus domisticus) and fish (Ctenopharyngodon idella) in a comparison study Tissue Cell 2015 47 359 365 10.1016/j.tice.2015.04.004 25997379 75. Hartman V.N. Miller M.A. Clayton D.F. Liu W.C. Kroodsma D.E. Brenowitz E.A. Testosterone regulates alpha-synuclein mRNA in the avian song system Neuroreport 2001 12 943 946 10.1097/00001756-200104170-00016 11303765 76. Das V. Modarres Mousavi S.M. Annadurai N. Sukur S. Mehrnejad F. Moradi S. Malina L. Kolarikova M. Ranc V. Frydrych I. Hydrophobic residues in the alpha-synuclein NAC domain drive seed-competent fibril formation and are targeted by peptide inhibitors FEBS J. 2025 10.1111/febs.70222 40819250 77. Graves N.J. Jaafar A.K. Gambin Y. Sierecki E. Divalent and Trivalent Metallic Ions Differentially Affect Alpha-Synuclein Aggregation ACS Chem. Neurosci. 2025 10.1021/acschemneuro.5c00160 PMC12447500 40785227 78. Sahin C. Kjaer L. Christensen M.S. Pedersen J.N. Christiansen G. Perez A.W. Moller I.M. Enghild J.J. Pedersen J.S. Larsen K. Alpha-Synucleins from Animal Species Show Low Fibrillation Propensities and Weak Oligomer Membrane Disruption Biochemistry 2018 57 5145 5158 10.1021/acs.biochem.8b00627 30067901 79. Ampomah G.B. Hard E.R. Pratt M.R. Alpha-Synuclein Sequences from Long-Lived Animals Display Generally Diminished Aggregation Compared to Shorter-Lived Animals Including Humans ChemBioChem A Eur. J. Chem. Biol. 2025 26 e202500340 10.1002/cbic.202500340 PMC12277024 40493714 80. Maffioli E. Angiulli E. Nonnis S. Grassi Scalvini F. Negri A. Tedeschi G. Arisi I. Frabetti F. D’Aniello S. Alleva E. Brain Proteome and Behavioural Analysis in Wild Type, BDNF +/− −/− Int. J. Mol. Sci. 2022 23 5606 10.3390/ijms23105606 35628418 PMC9146406 81. Jones D.T. Protein secondary structure prediction based on position-specific scoring matrices J. Mol. Biol. 1999 292 195 202 10.1006/jmbi.1999.3091 10493868 82. Psol M. Darvas S.G. Leite K. Mahajani S.U. Bahr M. Kugler S. Dementia with Lewy bodies-associated ss-synuclein mutations V70M and P123H cause mutation-specific neuropathological lesions Hum. Mol. Genet. 2021 30 247 264 10.1093/hmg/ddab036 33760043 83. Sharma K. Mehra S. Sawner A.S. Markam P.S. Panigrahi R. Navalkar A. Chatterjee D. Kumar R. Kadu P. Patel K. Effect of Disease-Associated P123H and V70M Mutations on beta-Synuclein Fibrillation ACS Chem. Neurosci. 2020 11 2836 2848 10.1021/acschemneuro.0c00405 32833434 84. Jain M.K. Singh P. Roy S. Bhat R. Comparative Analysis of the Conformation, Aggregation, Interaction, and Fibril Morphologies of Human alpha-, beta-, and gamma-Synuclein Proteins Biochemistry 2018 57 3830 3848 10.1021/acs.biochem.8b00343 29851342 85. Kaur U. Lee J.C. Membrane Interactions of alpha-Synuclein Probed by Neutrons and Photons Acc. Chem. Res. 2021 54 302 310 10.1021/acs.accounts.0c00453 33415971 PMC7836068 86. Vidovic M. Rikalovic M.G. Alpha-Synuclein Aggregation Pathway in Parkinson’s Disease: Current Status and Novel Therapeutic Approaches Cells 2022 11 1732 10.3390/cells11111732 35681426 PMC9179656 87. Chen Y.C. Cheng C.H. Chen G.D. Hung C.C. Yang C.H. Hwang S.P. Kawakami K. Wu B.K. Huang C.J. Recapitulation of zebrafish sncga expression pattern and labeling the habenular complex in transgenic zebrafish using green fluorescent protein reporter gene Dev. Dyn. Off. Publ. Am. Assoc. Anat. 2009 238 746 754 10.1002/dvdy.21877 19235732 88. Milanese C. Sager J.J. Bai Q. Farrell T.C. Cannon J.R. Greenamyre J.T. Burton E.A. Hypokinesia and reduced dopamine levels in zebrafish lacking beta- and gamma1-synucleins J. Biol. Chem. 2012 287 2971 2983 10.1074/jbc.M111.308312 22128150 PMC3270954 89. Doyle J.M. Croll R.P. A Critical Review of Zebrafish Models of Parkinson’s Disease Front. Pharmacol. 2022 13 835827 10.3389/fphar.2022.835827 35370740 PMC8965100 90. Biere A.L. Wood S.J. Wypych J. Steavenson S. Jiang Y. Anafi D. Jacobsen F.W. Jarosinski M.A. Wu G.M. Louis J.C. Parkinson’s disease-associated alpha-synuclein is more fibrillogenic than beta- and gamma-synuclein and cannot cross-seed its homologs J. Biol. Chem. 2000 275 34574 34579 10.1074/jbc.M005514200 10942772 91. Bost M. Houdart S. Oberli M. Kalonji E. Huneau J.F. Margaritis I. Dietary copper and human health: Current evidence and unresolved issues J. Trace Elem. Med. Biol. Organ Soc. Miner. Trace Elem. 2016 35 107 115 10.1016/j.jtemb.2016.02.006 27049134 92. Davies P. Wang X. Sarell C.J. Drewett A. Marken F. Viles J.H. Brown D.R. The synucleins are a family of redox-active copper binding proteins Biochemistry 2011 50 37 47 10.1021/bi101582p 21117662 93. Rodriguez E.E. Rios A. Trujano-Ortiz L.G. Villegas A. Castaneda-Hernandez G. Fernandez C.O. Gonzalez F.J. Quintanar L. Comparing the copper binding features of alpha and beta synucleins J. Inorg. Biochem. 2022 229 111715 10.1016/j.jinorgbio.2022.111715 35074552 94. Miotto M.C. Pavese M.D. Quintanar L. Zweckstetter M. Griesinger C. Fernandez C.O. Bioinorganic Chemistry of Parkinson’s Disease: Affinity and Structural Features of Cu(I) Binding to the Full-Length beta-Synuclein Protein Inorg. Chem. 2017 56 10387 10395 10.1021/acs.inorgchem.7b01292 28820253 95. Yamin G. Glaser C.B. Uversky V.N. Fink A.L. Certain metals trigger fibrillation of methionine-oxidized alpha-synuclein J. Biol. Chem. 2003 278 27630 27635 10.1074/jbc.M303302200 12754258 96. Villar-Pique A. Lopes da Fonseca T. Sant’Anna R. Szego E.M. Fonseca-Ornelas L. Pinho R. Carija A. Gerhardt E. Masaracchia C. Abad Gonzalez E. Environmental and genetic factors support the dissociation between alpha-synuclein aggregation and toxicity Proc. Natl. Acad. Sci. USA 2016 113 E6506 E6515 10.1073/pnas.1606791113 27708160 PMC5081623 97. do Amaral M.J. Mohapatra S. Passos A.R. Lopes da Silva T.S. Carvalho R.S. da Silva Almeida M. Pinheiro A.S. Wegmann S. Cordeiro Y. Copper drives prion protein phase separation and modulates aggregation Sci. Adv. 2023 9 eadi7347 10.1126/sciadv.adi7347 37922348 PMC10624353 98. Rasia R.M. Bertoncini C.W. Marsh D. Hoyer W. Cherny D. Zweckstetter M. Griesinger C. Jovin T.M. Fernandez C.O. Structural characterization of copper(II) binding to alpha-synuclein: Insights into the bioinorganic chemistry of Parkinson’s disease Proc. Natl. Acad. Sci. USA 2005 102 4294 4299 10.1073/pnas.0407881102 15767574 PMC555498 99. Yamin G. Munishkina L.A. Karymov M.A. Lyubchenko Y.L. Uversky V.N. Fink A.L. Forcing nonamyloidogenic beta-synuclein to fibrillate Biochemistry 2005 44 9096 9107 10.1021/bi048778a 15966733 Figure 1 Comparative sequence analysis of β- and γ-synucleins across vertebrate species. ( A B A B C. carpio D. rerio X. laevis A. carolinensis H. sapiens C Figure 2 Predicted secondary structure of vertebrate synucleins. Secondary structure prediction for β- ( A B C. carpio D. rerio X. laevis A. carolinensis H. sapiens http://bioinf.cs.ucl.ac.uk/psipred/ 81 Figures S2 and S3 ",
  "metadata": {
    "Title of this paper": "Forcing nonamyloidogenic beta-synuclein to fibrillate",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467708/"
  }
}