{
  "title": "Paper_348",
  "abstract": "pmc Kans J Med Kans J Med 3353 kansasjm Kansas Journal of Medicine 1948-2035 University of Kansas Medical Center PMC12483801 PMC12483801.1 12483801 12483801 10.17161/kjm.vol18.24438 18-19 1 Abstract Gender Differences in Oral Cavity Cancers Siebert Ben MS-2 Gupta-Burt Shalina M.D. The University of Kansas School of Medicine-Kansas City, Kansas City, Kansas, Department of Radiation Oncology Sep-Oct 2025 10 9 2025 18 Suppl 5 498037 19 19 28 8 2025 10 9 2025 10 09 2025 02 10 2025 02 10 2025 Copyright © 2025 Siebert, et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution Non-Commercial No Derivatives (by-nc-nd) License. (CC-BY-NC-ND 4.0: https://creativecommons.org/licenses/by-nc-nd/4.0/ Introduction Oral cavity and oropharyngeal cancer combined is the 6 th Methods The dataset included patients treated for head and neck cancer at The University of Kansas Department of Radiation Oncology from 2019–2024. Variables included gender, subsite, alcohol/tobacco use, race, and age at diagnosis. Data were collected through Epic and stored in REDCap ® Results 426 of the 591 (72.0%) head and neck cancers were in males. 45% of subsites in females were in the oral cavity while 51% in males were in the oropharynx. The female:male ratio at the oral cavity subsite was 3.30:1 and at the oropharynx subsite was 0.45:1. Variables of race, alcohol, and tobacco were statistically insignificant. Conclusions Head and neck cancers were more common in males. The oral cavity subsite had a female predominance, and the oropharynx subsite had a male predominance. The most common subsite in females was the oral cavity and in males was the oropharynx. No differences within race or risk factors were seen. Limitations include an incomplete data set and only using patients undergoing radiation treatment. Future studies could include patients undergoing non-radiation treatment, a more complete data set, and target specific factors such as HPV or PD-L1 expression. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Gender Differences in Oral Cavity Cancers",
    "Journal it was published in:": "Kansas Journal of Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483801/"
  }
}