{
  "title": "Paper_1043",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469369 PMC12469369.1 12469369 12469369 41009555 10.3390/ijms26188985 ijms-26-08985 1 Article Relevance of STIM/Orai Calcium Entry System Hyperactivation in Human Prostate Contractility in Benign Prostate Hyperplasia La Fuente José M. 1 https://orcid.org/0000-0002-5390-5677 El Assar Mariam Conceptualization Methodology Formal analysis Investigation Resources Writing – review & editing 2 3 4 Fernández Argentina Methodology Formal analysis Investigation Writing – review & editing 5 https://orcid.org/0000-0002-6551-1333 Rodríguez-Mañas Leocadio 3 4 6 https://orcid.org/0000-0002-3789-9465 Angulo Javier Conceptualization Methodology Formal analysis Investigation Resources Writing – original draft Writing – review & editing Funding acquisition 3 5 * Khan Shafiq Academic Editor 1 lafuentecarvalho@gmail.com 2 mariam.assar@salud.madrid.org 3 leocadio.rodriguez@salud.madrid.org 4 5 argentina.fernandez@salud.madrid.org 6 * javier.angulo@hrc.es 15 9 2025 9 2025 26 18 497349 8985 05 8 2025 03 9 2025 12 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Benign prostate hyperplasia (BPH) is characterized by prostate enlargement and dynamic alterations contributing to development of lower tract urinary symptoms (LUTS). Prostate hypercontractility has been proposed to contribute to BPH-related LUTS. The aim was to evaluate the effects of inhibiting stromal interaction molecule (STIM)/Orai calcium entry system on adrenergic and neurogenic contractions in prostate (HP) and bladder neck (HB) strips from BPH patients. Effects of STIM/Orai inhibition on adrenergic and neurogenic contractions of HP from organ donors (ODs) without BPH were also evaluated. HP and HB strips were obtained from 20 patients with BPH undergoing radical prostatectomy and from six OD at the time of organ collection for transplantation. Tissues were functionally evaluated for isometric tension recording. STIM-1, Orai1, and Orai3 protein expressions were determined in prostate tissues. STIM-1 was also localized by immunofluorescence in prostate sections. Norepinephrine-induced and neurogenic contractions were significantly reduced by STIM/Orai inhibition with YM-58483 (20 µM) in HP from BPH patients but not in tissues from ODs. STIM/Orai inhibition failed to significantly modify contraction of HB from BPH patients. Protein expression of STIM-1 was significantly elevated in HP from BPH patients. Functional contribution of STIM/Orai system to contractile tone is relevant in prostate when BPH is present, probably related to increased expression of STIM-1. Inhibition of STIM/Orai could have therapeutic implications for the management of BPH patients by alleviating prostatic hypercontraction. benign prostate hyperplasia lower urinary tract symptoms human prostate human bladder store-operated calcium entry stromal interaction molecule-1 Orai channels Instituto de Salud Carlos III PI15/01160 European Society for Sexual Medicine RG17-10 This study has been funded by Instituto de Salud Carlos III through project PI15/01160 (Co-funded by European Regional Development Fund/European Social Fund) and by the European Society for Sexual Medicine (RG17-10). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction One of the most prevalent diseases in aging male population is benign prostatic hyperplasia (BPH) [ 1 2 3 2 Pathophysiology mechanisms of BPH leading to LUTS are not completely elucidated. Although prostate growth could obviously exert a mechanical impact on urethra and bladder neck complicating urine voiding function, severity of LUTS is not related to prostate size [ 4 5 6 7 1 6 8 9 10 11 1 11 12 Calcium movements in smooth muscle cells are key events regulating contractile tone. Store-operated calcium entry (SOCE) process is critical in calcium homeostasis [ 13 14 15 16 17 15 16 17 15 16 17 18 19 20 21 22 23 Although there is some evidence suggesting a potential involvement of STIM/Orai system in prostate cancer development and progression [ 24 25 2. Results 2.1. Study Subjects Characteristics of study subjects from whom the tissues were collected are summarized in Table 1 Table 1 1 2.2. Inhibitor of STIM/Orai, YM-58483, Causes More Effective Relaxations in Prostate Strips from Patients with BPH Increasing concentrations of YM-58483 (0.1 to 30 µM) caused relaxation of norepinephrine (NE)-precontracted prostate strips. This relaxant effect driven by STIM/Orai inhibition was significantly larger than that exerted by exposure to vehicle (0.001 to 0.3% DMSO) in strips from both OD subjects and BPH patients ( Figure 1 Figure 1 max Figure 1 max Figure 1 2.3. STIM/Orai Inhibition Reduced NE-Induced Contractions in Prostate from BPH Patients Cumulative additions of NE (1 nM to 100 µM) caused concentration-dependent contractions of human prostate strips from ODs and BPH patients. These contractions were significantly enhanced in strips from BPH patients ( Figure 2 50 n n p Figure 2 n Supplementary Figure S1A The STIM/Orai inhibitor, YM-58483 (20 µM) did not affect NE-induced contractions in tissues obtained from ODs ( Figure 3 Figure 3 Figure 3 Figure 3 Supplementary Figure S1B 2.4. Neurogenic Contractions of the Prostate from BPH Patients Were Also Diminished by STIM/Orai Inhibition Neurogenic contractions of the prostate induced by electrical field stimulation (EFS) (0.5 to 48 Hz) were slightly but significantly reduced by the STIM/Orai inhibitor, YM-58483 (20 µM) in prostate tissues from ODs ( Figure 4 Figure 4 Figure 4 2.5. STIM/Orai Inhibition Did Not Modify Adrenergic nor Neurogenic Contractile Responses in Bladder Neck from BPH Patients In contrast to that observed in prostate tissue, NE-induced contractions were not significantly modified by the treatment with the STIM/Orai inhibitor, YM-58483 (20 µM), in strips of bladder neck obtained from BPH patients ( Figure 5 Figure 5 Figure 5 Figure 5 2.6. STIM-1 Was Upregulated in Prostate Tissue from Patients with BPH Immunodetection of the STIM/Orai system components, STIM-1, Orai1, and Orai3 in prostate homogenates revealed an upregulation of STIM-1 protein in samples from BPH patients with respect to those from ODs ( Figure 6 Figure 6 Figure 6 Figure 6 Supplementary Figure S2 Figure 6 3. Discussion The present results point to functional upregulation of STIM/Orai system playing a significant role in regulating prostatic smooth muscle tone in men with BPH. In contrast, the functional relevance of STIM/Orai system seems to be less significant in bladder contractility in these patients. This functional evidence is related to an increase in the sensor protein STIM-1 in the prostate tissue when BPH is present. Although pathophysiological mechanisms leading to LUTS in patients with BPH are not completely elucidated, it is well established that, in addition to a mechanical effect driven by prostate growth, a dynamic component involving prostate smooth muscle contraction contributes to clinical symptoms [ 26 1 27 28 29 30 31 15 16 17 max 32 27 33 34 Functional regulation of contractile tone of human prostate by STIM/Orai inhibition in BPH was associated with alteration in prostatic expression of elements of STIM/Orai system. Specifically, the sensor protein, STIM-1, was upregulated in prostate from BPH patients. Elevated expression of STIM-1 could potentially lead to hyperactivated STIM/Orai system, thereby explaining the functional effects of YM-58483 in prostate from BPH patients. This idea is supported by previous evidence showing that upregulation of STIM-1 expression was associated with functional hyperactivation of STIM/Orai system in rats with ethanol-induced hypertension [ 35 36 37 38 16 39 40 41 41 24 Aging is the main risk factor for BPH, which is highly prevalent in older men [ 42 13 15 16 Finally, it has been demonstrated the key role of STIM and Orai in the calcium homeostasis of smooth muscle [ 20 43 4. Materials and Methods 4.1. Human Tissues Specimens were obtained from patients undergoing suprapubic adenomectomy (Millin’s approach) for benign prostatic hyperplasia (BPH). One to three strips from peripheral prostate were dissected from each specimen for functional evaluation in organ chambers. A small specimen of bladder neck is also resected in the course of this type of surgery, which was used to dissect one to three bladder neck strips. For comparison, prostatic tissue specimens were collected from six organ donors at the moment of organ obtaining for transplantation. Patients or relatives gave their written informed consent before inclusion in the study. For transportation to the laboratory, the tissue specimens were immersed in M-400 solution (pH 7.4; 400 mOsm/kg. Composition in w v 2 4 2 4 2 3 27 44 4.2. Functional Evaluation of Tissues in Organ Bath Human prostate (HP) and bladder neck (HB) specimens were cleaned of fat and connective tissue and cut into strips for organ bath assays. HP and HB strips were placed in organ baths (8 mL) containing Krebs–Henseleit solution (KHS) and tied to force transducers. Composition of KHS was (in mM): NaCl 119, KCl 4.6, CaCl 2 4 3 2 4 2 2 + EFS was produced by means of two platinum electrodes connected to an electrical stimulator (Cibertec, Madrid, Spain). EFS consisted of pulses of 75 mA of current intensity, 0.5 ms of pulse duration, in 20 s trains. EFS at increasing frequencies (0.5–48 Hz) was applied for evaluation of neurogenic contractions in human prostate and bladder neck strips under resting tension. Neurogenic nature of EFS-induced contractions with these parameters was previously evidenced [ 27 44 4.3. Western Blot Experiments Prostate tissues from ODs and patients with BPH were frozen in liquid nitrogen and stored at −80 °C until the extraction of proteins. Total protein content was obtained by homogenizing prostate tissues in T-PER lysis buffer (Pierce Biotechnology, Inc., Rockford, IL, USA) containing a Protease Inhibitor Cocktail (Roche Diagnostics, IN, USA) and following the instructions from manufacturer. The bicinchoninic acid (BCA) method was used for determination of protein content in prostate homogenates. SDS-PAGE on a 10% polyacrylamide gel was applied for separating protein extracts (20 µg). Transfer of proteins from gel to polyvinylidene difluoride membranes was then performed. Membranes were blocked for 5 min with EveryBlot blocking buffer (Bio-Rad, Hercules, CA, USA) and incubated at 4 °C overnight with specific mouse monoclonal antibodies against STIM-1 (cat.# MCA3475Z, Bio-Rad, 1:1000 dilution) or Orai1 (cat# MA5-15776, ThermoFisher Scientific, Waltham, MA, USA, 1:1000 dilution) or rabbit polyclonal antibody against Orai3 (cat# PA5-20370, ThermoFisher Scientific, 1:500 dilution). For loading control, a mouse antibody against β-actin (cat.# NB600-501, Novus Biologicals, Centennial, CO, USA, dilution 1:5000) was used. After washing with phosphate-buffered saline (PBS) containing 0.1% Tween, membranes were incubated for 60 min at room temperature with horseradish peroxidase-conjugated secondary antibodies: goat anti-rabbit (cat.# NB7160, Novus Biologicals, 1:10,000 dilution) for Orai3 or goat anti-mouse (cat.# NBP2-30347H, Novus Biologicals, 1:5000 dilution) for the other proteins. ECL detection system (ThermoFisher Scientific) was employed for visualization of blots. Band density quantification was accomplished by using QuantityOne/Chemi-Doc Image-Lab 6.0 Software (Bio-Rad). The ratio of band intensity for STIM-1, Orai1, or Orai3 relative to respective β-actin band intensity was utilized for the expression of data. 4.4. Immunofluorescence Assays After immersing prostate tissues in increasing percentages of saccharose (10% to 30% w v 45 4.5. Data Analysis Data are expressed as mean ± S.E.M. of the percentage of K + 50 + max 5. Conclusions Pharmacological inhibition of STIM/Orai calcium entry system modulates adrenergic and neurogenic contractions of human prostate smooth muscle when BPH is present. This effect is related to upregulation of STIM-1 and increased Orai3/Orai1 ratio in BPH prostates, suggesting that altered expression of STIM/Orai elements promotes hyperactivation of this system in BPH. Notably, this functional hyperactivation of STIM/Orai by BPH does not appear to occur in the bladder neck. The relevance of the STIM/Orai system in regulating prostate smooth muscle tone in BPH could have potential therapeutic implications for managing these patients and it represents a kickoff for future research. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ijms26188985/s1 Author Contributions Conceptualization, J.M.L.F., M.E.A., L.R.-M. and J.A.; methodology, J.M.L.F., M.E.A., A.F. and J.A.; formal analysis, J.M.L.F., M.E.A., A.F. and J.A.; investigation, J.M.L.F., M.E.A., A.F. and J.A.; resources, J.M.L.F., M.E.A., L.R.-M. and J.A.; writing—original draft preparation, J.M.L.F. and J.A.; writing—review and editing, J.M.L.F., M.E.A., A.F., L.R.-M. and J.A.; funding acquisition, J.M.L.F., L.R.-M. and J.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki. Protocol and consent forms were approved by the Ethics Committee at the Centro Hospitalar e Universitário de Santo António (CHUdSA), Porto, Portugal (2016.107(092-DEFI/089-CES, approval 21 September 2016). Informed Consent Statement Informed consent was obtained from all subjects/subjects’ relatives involved in the study. Data Availability Statement The data presented in this study are available on request from the corresponding author. The data are not publicly available due to data protection policy. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AUC Area under the curve BPH Benign prostate hyperplasia DMSO Dimethyl sulfoxide Emax Maximum response HB Human bladder HP Human prostate LUTS Lower urinary tract symptoms NE Norepinephrine OD Organ donor PBS Phosphate-buffered saline pEC50 −log M of the concentration required for 50% of contraction SOCE Store-operated calcium entry STIM-1 Stromal interaction protein-1 YM YM-58483 References 1. Soler R. Andersson K.E. Chancellor M.B. Chapple C.R. de Groat W.C. Drake M.J. Gratzke C. Lee R. Cruz F. Future direction in pharmacotherapy for non-neurogenic male lower urinary tract symptoms Eur. Urol. 2013 64 610 621 10.1016/j.eururo.2013.04.042 23711541 2. Madersbacher S. Sampson N. Culig Z. Pathophysiology of Benign Prostatic Hyperplasia and Benign Prostatic Enlargement: A Mini-Review Gerontology 2019 65 458 464 10.1159/000496289 30943489 3. Roehrborn C.G. Benign prostatic hyperplasia: An overview Rev. Urol. 2005 7 (Suppl. 9) S3 S14 PMC1477638 16985902 4. Eckhardt M.D. van Venrooij G.E. Boon T.A. Symptoms and quality of life versus age, prostate volume, and urodynamic parameters in 565 strictly selected men with lower urinary tract symptoms suggestive of benign prostatic hyperplasia Urology 2001 57 695 700 10.1016/S0090-4295(00)01101-8 11306383 5. Eckhardt M.D. van Venrooij G.E. Boon T.A. Symptoms, prostate volume, and urodynamic findings in elderly male volunteers without and with LUTS and in patients with LUTS suggestive of benign prostatic hyperplasia Urology 2001 58 966 971 10.1016/S0090-4295(01)01413-3 11744470 6. Lepor H. Alpha blockers for the treatment of benign prostatic hyperplasia Rev. Urol. 2007 9 181 190 10.1016/j.ucl.2016.04.009 18231614 PMC2213889 7. Shapiro E. Hartanto V. Lepor H. The response to alpha blockade in benign prostatic hyperplasia is related to the percent area density of prostate smooth muscle Prostate 1992 21 297 307 10.1002/pros.2990210406 1281322 8. Rigatti P. Brausi M. Scarpa R.M. Porru D. Schumacher H. Rizzi C.A. MICTUS Study Group A comparison of the efficacy and tolerability of tamsulosin and finasteride in patients with lower urinary tract symptoms suggestive of benign prostatic hyperplasia Prostate Cancer Prostatic Dis. 2003 6 315 323 10.1038/sj.pcan.4500680 14663474 9. Hasan M. Parveen F. Shamsuzzaman A.K. Kibria M.D. Comparison of efficacy between Tamsulosin and Finasteride on symptomatic Benign Prostatic Hyperplasia Mymensingh Med. J. 2007 16 154 159 17703151 10. Ventura S. Oliver V.I. White C.W. Xie J.H. Haynes J.M. Exintaris B. Novel drug targets for the pharmacotherapy of benign prostatic hyperplasia (BPH) Br. J. Pharmacol. 2011 163 891 907 10.1111/j.1476-5381.2011.01332.x 21410684 PMC3130937 11. Yu Z.J. Yan H.L. Xu F.H. Chao H.C. Deng L.H. Xu X.D. Huang J.B. Zeng T. Efficacy and Side Effects of Drugs Commonly Used for the Treatment of Lower Urinary Tract Symptoms Associated with Benign Prostatic Hyperplasia Front. Pharmacol. 2020 11 658 10.3389/fphar.2020.00658 32457631 PMC7225336 12. Müderrisoglu A.E. de la Rosette J.J.M.C.H. Michel M.C. Potential side effects of currently available pharmacotherapies in male lower urinary tract symptoms suggestive of benign prostatic hyperplasia Expert. Opin. Drug Saf. 2023 22 1213 1224 10.1080/14740338.2023.2293206 38064204 13. Collins H.E. Zhang D. Chatham J.C. STIM and Orai Mediated Regulation of Calcium Signaling in Age-Related Diseases Front. Aging 2022 3 876785 10.3389/fragi.2022.876785 35821821 PMC9261457 14. Kodakandla G. Akimzhanov A.M. Boehning D. Regulatory mechanisms controlling store-operated calcium entry Front. Physiol. 2023 14 1330259 10.3389/fphys.2023.1330259 38169682 PMC10758431 15. El Assar M. García-Rojo E. Sevilleja-Ortiz A. Sánchez-Ferrer A. Fernández A. García-Gómez B. Romero-Otero J. Rodríguez-Mañas L. Angulo J. Functional Role of STIM-1 and Orai1 in Human Microvascular Aging Cells 2022 11 3675 10.3390/cells11223675 36429103 PMC9688234 16. Sevilleja-Ortiz A. El Assar M. García-Rojo E. García-Gómez B. Fernández A. Sánchez-Ferrer A. La Fuente J.M. Romero-Otero J. Rodríguez-Mañas L. Angulo J. Ageing-induced hypercontractility is related to functional enhancement of STIM/Orai and upregulation of Orai 3 in rat and human penile tissue Mech. Ageing Dev. 2021 200 111590 10.1016/j.mad.2021.111590 34699858 17. Sevilleja-Ortiz A. El Assar M. García-Gómez B. La Fuente J.M. Alonso-Isa M. Romero-Otero J. Martínez-Salamanca J.I. Fernández A. Rodríguez-Mañas L. Angulo J. STIM/Orai Inhibition as a Strategy for Alleviating Diabetic Erectile Dysfunction Through Modulation of Rat and Human Penile Tissue Contractility and in vivo Potentiation of Erectile Responses J. Sex. Med. 2022 19 1733 1749 10.1016/j.jsxm.2022.08.200 36195535 18. Ishikawa J. Ohga K. Yoshino T. Takezawa R. Ichikawa A. Kubota H. Yamada T. A pyrazole derivative, YM-58483, potently inhibits store-operated sustained Ca2+ influx and IL-2 production in T lymphocytes J. Immunol. 2003 170 4441 4449 10.4049/jimmunol.170.9.4441 12707319 19. Ohga K. Takezawa R. Yoshino T. Yamada T. Shimizu Y. Ishikawa J. The suppressive effects of YM-58483/BTP-2, a store-operated Ca2+ entry blocker, on inflammatory mediator release in vitro and airway responses in vivo Pulm. Pharmacol. Ther. 2008 21 360 369 10.1016/j.pupt.2007.09.003 17977764 20. Masson B. Le Ribeuz H. Sabourin J. Laubry L. Woodhouse E. Foster R. Ruchon Y. Dutheil M. Boët A. Ghigna M.R. Orai1 Inhibitors as Potential Treatments for Pulmonary Arterial Hypertension Circ. Res. 2022 131 e102 e119 10.1161/CIRCRESAHA.122.321041 36164973 21. Zhang W. Qi Z. Wang Y. BTP2, a Store-Operated Calcium Channel Inhibitor, Attenuates Lung Ischemia-Reperfusion Injury in Rats Inflammation 2017 40 778 787 10.1007/s10753-017-0522-8 28168659 22. Miyoshi M. Liu S. Morizane A. Takemasa E. Suzuki Y. Kiyoi T. Maeyama K. Mogi M. Efficacy of constant long-term delivery of YM-58483 for the treatment of rheumatoid arthritis Eur. J. Pharmacol. 2018 824 89 98 10.1016/j.ejphar.2018.02.006 29428471 23. Nehme A. Ghahramanpouri M. Ahmed I. Golsorkhi M. Thomas N. Munoz K. Abdipour A. Tang X. Wilson S.M. Wasnik S. Combination therapy of insulin-like growth factor I and BTP-2 markedly improves lipopolysaccharide-induced liver injury in mice FASEB J. 2022 36 e22444 10.1096/fj.202200227RR 35839071 PMC12166284 24. Ardura J.A. Álvarez-Carrión L. Gutiérrez-Rojas I. Alonso V. Role of Calcium Signaling in Prostate Cancer Progression: Effects on Cancer Hallmarks and Bone Metastatic Mechanisms Cancers 2020 12 1071 10.3390/cancers12051071 32344908 PMC7281772 25. Daba M.Y. Fan Z. Li Q. Yuan X. Liu B. The role of calcium channels in prostate cancer progression and potential as a druggable target for prostate cancer treatment Crit. Rev. Oncol. Hematol. 2023 186 104014 10.1016/j.critrevonc.2023.104014 37119879 26. Shan S. Su M. The role of RhoA-ROCK signaling in benign prostatic hyperplasia: A review Hum. Cell 2025 38 48 10.1007/s13577-025-01179-x 39891836 27. Angulo J. Cuevas P. Fernández A. La Fuente J.M. Allona A. Moncada I. Sáenz de Tejada I. Tadalafil enhances the inhibitory effects of tamsulosin on neurogenic contractions of human prostate and bladder neck J. Sex. Med. 2012 9 2293 2306 10.1111/j.1743-6109.2012.02821.x 22759598 28. Huang R. Liu Y. Hu S. Tamalunas A. Waidelich R. Strittmatter F. Stief C.G. Hennenberg M. Inhibition of α1-Adrenergic, Non-Adrenergic and Neurogenic Human Prostate Smooth Muscle Contraction and of Stromal Cell Growth by the Isoflavones Genistein and Daidzein Nutrients 2022 14 4943 10.3390/nu14234943 36500973 PMC9735664 29. Wang R. Huang R. Liu Y. Tamalunas A. Stief C.G. Hennenberg M. Silencing of CDC42 inhibits contraction and growth-related functions in prostate stromal cells, which is mimicked by ML141 Life Sci. 2023 329 121928 10.1016/j.lfs.2023.121928 37437651 30. Bester B. Koslowa K. Gronau A.C. Mietens A. Nowell C. Whittaker M.R. Pilatz A. Wagenlehner F. Exintaris B. Middendorff R. The oxytocin antagonist cligosiban reduces human prostate contractility: Implications for the treatment of benign prostatic hyperplasia Br. J. Pharmacol. 2024 181 2869 2885 10.1111/bph.16369 38676555 31. Hu S. Müderrisoglu A.E. Ciotkowska A. Kale O. Keller P. Schott M. Tamalunas A. Waidelich R. Stief C.G. Hennenberg M. Effects of carvedilol on human prostate tissue contractility and stromal cell growth pointing to potential clinical implications Pharmacol. Rep. 2024 76 807 822 10.1007/s43440-024-00605-5 38858312 PMC11294394 32. Michel M.C. Vrydag W. Alpha1-, alpha2- and beta-adrenoceptors in the urinary bladder, urethra and prostate Br. J. Pharmacol. 2006 147 (Suppl. 2) S88 S119 10.1038/sj.bjp.0706619 16465187 PMC1751487 33. Luptak J. Kocmalova M. Franova S. Sutovsky J. Grendar M. Svihra J. Kliment J. Sr. Dusenka R. Sutovska M. Involvement of calcium regulating ion channels in contractility of human isolated urinary bladder Gen. Physiol. Biophys. 2018 37 391 398 10.4149/gpb_2017064 29956670 34. Michel M.C. Barendrecht M.M. Physiological and pathological regulation of the autonomic control of urinary bladder contractility Pharmacol. Ther. 2008 117 297 312 10.1016/j.pharmthera.2007.12.001 18221785 35. Souza Bomfim G.H. Mendez-Lopez I. Arranz-Tagarro J.A. Ferraz Carbonel A.A. Roman-Campos D. Padín J.F. Garcia A.G. Jurkiewicz A. Jurkiewicz N.H. Functional Upregulation of STIM-1/Orai-1-Mediated Store-Operated Ca2+ Contributing to the Hypertension Development Elicited by Chronic EtOH Consumption Curr. Vasc. Pharmacol. 2017 15 265 281 10.2174/1570161115666170201122750 28155613 36. Kim J.H. Hwang K.H. Oh J. Kim S.E. Lee M.Y. Lee T.S. Cha S.K. Differential expression of ORAI channels and STIM proteins in renal cell carcinoma subtypes: Implications for metastasis and therapeutic targeting Korean J. Physiol. Pharmacol. 2025 29 33 43 10.4196/kjpp.24.126 39482235 PMC11694002 37. Nguyen A. Sung Y. Lee S.H. Martin C.E. Srikanth S. Chen W. Kang M.K. Kim R.H. Park N.H. Gwack Y. Orai3 Calcium Channel Contributes to Oral/Oropharyngeal Cancer Stemness through the Elevation of ID1 Expression Cells 2023 12 2225 10.3390/cells12182225 37759448 PMC10527097 38. Kouba S. Buscaglia P. Guéguinou M. Ibrahim S. Félix R. Guibon R. Fromont G. Pigat N. Capiod T. Vandier C. Pivotal role of the ORAI3-STIM2 complex in the control of mitotic death and prostate cancer cell cycle progression Cell. Calcium 2023 115 102794 10.1016/j.ceca.2023.102794 37597301 39. Wu Q. Fang Y. Huang X. Zheng F. Ma S. Zhang X. Han T. Gao H. Shen B. Role of Orai3-Mediated Store-Operated Calcium Entry in Radiation-Induced Brain Microvascular Endothelial Cell Injury Int. J. Mol. Sci. 2023 24 6818 10.3390/ijms24076818 37047790 PMC10095176 40. Yu C. Zhou Z. Huang W. Li X. Zou F. Meng X. Cai S. Orai3 mediates Orai channel remodelling to activate fibroblast in pulmonary fibrosis J. Cell. Mol. Med. 2022 26 4974 4985 10.1111/jcmm.17516 36128650 PMC9549502 41. Zhang X. Xin P. Yoast R.E. Emrich S.M. Johnson M.T. Pathak T. Benson J.C. Azimi I. Gill D.L. Monteith G.R. Distinct pharmacological profiles of ORAI1, ORAI2, and ORAI3 channels Cell. Calcium 2020 91 102281 10.1016/j.ceca.2020.102281 32896813 PMC7654283 42. Huang Q. Li B.H. Wang Y.B. Zi H. Zhang Y.Y. Li F. Fang C. Tang S.D. Jin Y.H. Huang J. Clinical biomarker-based biological aging and risk of benign prostatic hyperplasia: A large prospective cohort study Aging Med. (Milton) 2024 7 393 405 10.1002/agm2.12331 38975310 PMC11222739 43. Mancarella S. Potireddy S. Wang Y. Gao H. Gandhirajan R.K. Autieri M. Scalia R. Cheng Z. Wang H. Madesh M. Targeted STIM deletion impairs calcium homeostasis, NFAT activation, and growth of smooth muscle FASEB J. 2013 27 893 906 10.1096/fj.12-215293 23159931 PMC3574286 44. La Fuente J.M. Fernández A. Cuevas P. González-Corrochano R. Chen M.X. Angulo J. Stimulation of large-conductance calcium-activated potassium channels inhibits neurogenic contraction of human bladder from patients with urinary symptoms and reverses acetic acid-induced bladder hyperactivity in rats Eur. J. Pharmacol. 2014 735 68 76 10.1016/j.ejphar.2014.03.060 24747752 45. Angulo J. El Assar M. Sevilleja-Ortiz A. Fernández A. Sánchez-Ferrer A. Romero-Otero J. Martínez-Salamanca J.I. La Fuente J.M. Rodríguez-Mañas L. Short-term pharmacological activation of Nrf2 ameliorates vascular dysfunction in aged rats and in pathological human vasculature. A potential target for therapeutic intervention Redox Biol. 2019 26 101271 10.1016/j.redox.2019.101271 31302408 PMC6626891 Figure 1 Inhibition of STIM/Orai calcium entry system causes enhanced relaxations of precontracted strips of human prostate in the presence of benign prostate hyperplasia (BPH). Panel ( A B n p p p Figure 2 Sensitivity to adrenergic contraction in human prostate increases with benign prostate hyperplasia (BPH). Panel ( A + B 50 50 n p p Figure 3 STIM/Orai inhibition reduces adrenergic contractions in prostate from patients with benign prostate hyperplasia (BPH). Superior panels show contractions induced by cumulative additions of norepinephrine (NE, 1 nM to 100 µM) in human prostate strips previously treated with vehicle (0.2% DMSO) or the STIM/Orai inhibitor, YM-58483 (YM, 20 µM) obtained from organ donors (ODs) ( A B + C D n p p Figure 4 Neurogenic contractions of prostate from patients with benign prostate hyperplasia (BPH) are reduced by STIM/Orai inhibition. Superior panels show neurogenic contractions induced by electrical field stimulation (EFS, 0.5 to 48 Hz) in human prostate strips previously treated with vehicle (0.2% DMSO) or the STIM/Orai inhibitor, YM-58483 (YM, 20 µM) obtained from organ donors (ODs) ( A B C D n p p p Figure 5 STIM/Orai inhibition failed to significantly modify adrenergic and neurogenic contractions in bladder neck from patients with benign prostate hyperplasia (BPH). Superior panels show contractions induced by cumulative additions of norepinephrine (NE, 1 nM to 100 µM) ( A B + A B C D n Figure 6 Benign prostate hyperplasia (BPH) is related to augmented expression of STIM-1 and increased Orai3/Orai1 ratio in prostate tissue. Panel ( A B C D E B D E n p F G ijms-26-08985-t001_Table 1 Table 1 Characteristics of study subjects.  OD BPH p  n 6 20  Age (years) 54.5 ± 18.7 70.2 ± 5.5  0.0436 Diabetes (%) 0 (0.0) 5 (25.0) 0.2981 Dyslipidemia (%) 0 (0.0) 4 (20.0) 0.5425 Hypertension (%) 1 (12.5) 8 (40.0) 0.3798 Obesity (%) 0 (0.0) 0 (0.0) 1.0000 Smoking habit (%) 0 (0.0) 4 (20.0) 0.3214 BPH: patients with benign prostate hyperplasia; OD: organ donors without notice of BPH. n ",
  "metadata": {
    "Title of this paper": "Short-term pharmacological activation of Nrf2 ameliorates vascular dysfunction in aged rats and in pathological human vasculature. A potential target for therapeutic intervention",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469369/"
  }
}