{
  "title": "Paper_1130",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468147 PMC12468147.1 12468147 12468147 41020856 10.3390/cimb47090734 cimb-47-00734 1 Review Roxadustat as a Hypoxia-Mimetic Agent: Erythropoietic Mechanisms, Bioanalytical Detection, and Regulatory Considerations in Sports Medicine Creangă Elena-Christen 1 Ott Cristina 1 https://orcid.org/0000-0002-4128-3882 Nicolae Alina-Crenguţa 2 * https://orcid.org/0000-0002-6568-6846 Drăgoi Cristina Manuela 2 Stan Raluca 1 Huang Ru Chih C. Academic Editor 1 elena.creanga@upb.ro cristina.ott@upb.ro raluca.stan@upb.ro 2 cristina.dragoi@umfcd.ro * alina.nicolae@umfcd.ro 09 9 2025 9 2025 47 9 497442 734 24 7 2025 28 8 2025 04 9 2025 09 09 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Roxadustat (ROX) is an orally active inhibitor of hypoxia-inducible factor prolyl hydroxylase (HIF-PHI) that exerts erythropoietic, cardioprotective, and metabolic regulatory effects. Approved for the treatment of anemia associated with chronic kidney disease, ROX promotes endogenous erythropoietin production and improves iron homeostasis, providing a non-injectable alternative to conventional erythropoiesis-stimulating agents (ESAs). Its ability to enhance oxygen transport and facilitate muscle recovery has, however, led to its misuse in sports, where it is classified as a banned substance by the World Anti-Doping Agency. This review provides a comprehensive overview of the pharmacological properties of ROX, its approved and investigational clinical applications, and its chemical synthesis strategies. Particular emphasis is placed on the analytical methodologies employed for ROX detection in anti-doping settings. Techniques such as liquid chromatography–tandem mass spectrometry (LC–MS/MS), ultraviolet–visible (UV–Vis) spectroscopy, Fourier-transform infrared spectroscopy (FT-IR), and high-performance thin-layer chromatography (HPTLC) are critically assessed for their efficacy in detecting ROX and its metabolites in biological matrices. Given the increasing incidence of ROX misuse among athletes, ongoing optimization of detection protocols and longitudinal monitoring approaches, are essential to uphold both sports integrity and public health. roxadustat erythropoietin chronic kidney disease hypoxia-inducible factor prolyl hydroxylase inhibitor bioanalysis Quechers method This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Overview Hypoxia-inducible factor prolyl-hydroxylase inhibitors (HIF-PHIs) are small-molecule inhibitors of the HIF prolyl-hydroxylase domain (PHD) enzymes that normally hydroxylate specific proline residues on HIF-α under normoxia, marking HIF-α for pVHL-mediated ubiquitination and proteasomal degradation. By transiently inhibiting PHD activity, HIF-PHIs stabilize HIF-1α and HIF-2α, enabling nuclear accumulation, dimerization with HIF-β (ARNT), and binding to hypoxia-response elements (HREs) to drive the transcription of genes that regulate erythropoiesis and iron metabolism, among other adaptive programs [ 1 2 2 3 Quantitative hypoxia/HIF-PHI responses: HIF stabilization drives robust EPO induction with defined magnitudes and kinetics. In vivo, roxadustat increased serum EPO within hours in rodent models, consistent with pharmacodynamic expectations [ 4 5 6 4 Single-cell/lineage evidence for renal EPO-producing cells: Recent lineage-tracing and single-cell studies localize EPO production to rare PDGFRβ+ interstitial fibroblasts (renal EPO-producing, REP cells). Lineage labeling demonstrates that only a small fibroblast subset in the renal interstitium produces Epo in vivo [ 7 8 9 10 11 Erythropoiesis represents a highly regulated and intricate physiological process responsible for the production of red blood cells. This process is critically dependent on the availability of erythropoietin (EPO), a glycoprotein hormone primarily synthesized by peritubular interstitial cells in the renal cortex. The synthesis of EPO is tightly controlled by tissue oxygen levels and is markedly upregulated in response to hypoxia—a pathological state characterized by reduced oxygen availability at the tissue level. Hypoxic conditions may arise from various etiologies, including anemia, pulmonary disease, or vascular impairment, and are often associated with progressive renal dysfunction [ 12 In cases such as ischemic stress or anemia, EPO synthesis decreases, leading to an advanced decline in red blood cell production. Nevertheless, at high altitudes, EPO production increases, leading to the stimulation of erythroid progenitor cell activity and enhancing red blood cell production [ 13 Roxadustat (ROX), nowadays marketed under the name Evrenzo ® 14 Some of the key pharmacological attributes of ROX include the regulation of vascular system activity, oxygen absorption by tissues, cardioprotective effects, as well as anti-inflammatory properties [ 15 16 3 By increasing EPO levels, ROX may be used in treating obesity caused by high lipid intake, taking into account that the equilibrium between osteogenesis and adipogenesis is managed via EPO/EPOR signaling during the inflammation process caused by obesity [ 17 18 The erythropoietic performance of ROX, and by consequence, its ability to enhance the oxygen transport to tissues and cells, thereby enhancing the reaction speed and endurance of athletes, generated substantiated risks of performance enhancement based on erythropoietic efficacy. Several anti-doping tests based on modern chromatographic techniques have been developed and used, able both to detect the presence of ROX in the biological fluids of athletes [ 19 20 The detection of performance-enhancing agents necessitates ongoing refinement of the analytical methods. The use of doping substances such as erythropoiesis-stimulating agents, anabolic agents, and gene-doping targets has led scientists to discover new innovative methodologies used in drug detection, for example, remote testing, steroid profiling, and gene-editing techniques. The World Anti-Doping Agency (WADA) is the body tasked with keeping an up-to-date list of disallowed substances and enhancing anti-doping measures [ 21 22 2. Origin, Synthetic Approaches, and Physicochemical Profile of Roxadustat: From Development to Therapeutic Application Pharmaceutical companies such as Yamanouchi (Tokyo, Japan) and FibroGen (San Francisco, CA, USA) were the first ones conducting clinical studies aimed at an expansion of the endogenous production of erythropoiesis (in order to obtain the license for the therapeutic use of FG-2216-HIF-PH2, an oral compound that inhibits HIF prolyl hydroxylase 2—an essential enzyme in the breakdown of hypoxia-inducible factors). Based on the results recorded in clinical trials—phase III—ROX obtained approval to be used therapeutically in China in 2018 [ 23 In 2019, ROX was licensed for therapeutic use in Japan [ 24 ® 25 Table 1 26 In 2021, the U.S. Food and Drug Administration (FDA) suspended the clinical use of roxadustat (ROX), citing potential adverse effects and recommending further investigation into the drug’s influence on metabolic pathways and genetic regulation within vital organ systems. Roxadustat, administered orally, functions through the selective inhibition of prolyl hydroxylase domain enzymes (HIF-PHDs), which under normoxic conditions catalyze the degradation of hypoxia-inducible factors (HIFs). By inhibiting HIF-PHD activity, ROX stabilizes HIF transcription factors, thereby enhancing their transcriptional activity and promoting endogenous erythropoietin (EPO) synthesis. The pharmacodynamic effects of ROX are dose-dependent and protocol-specific. Its administration leads to elevated hemoglobin (Hb) levels and increased endogenous EPO production. Moreover, it has been associated with improved iron metabolism and absorption through the downregulation of hepcidin, without triggering proinflammatory responses. Some studies also suggest a potential reduction in the incidence of hypertension and circulating low-density lipoprotein (LDL) cholesterol, though these outcomes warrant further validation in large-scale, controlled clinical trials [ 24 ROX is an isoquinoline derivative (molecular formula: C 19 16 2 5 Figure 1 27 Current pharmacological databases also include a range of roxadustat (ROX)-related or ROX-derived compounds, which share structural similarities and exhibit overlapping therapeutic activities. These analogs typically retain the core pharmacophoric elements essential for hypoxia-inducible factor prolyl hydroxylase (HIF-PH) inhibition. Recent patents have outlined synthetic methodologies for the preparation of ROX, with particular focus on the construction of the 7-phenoxyisoquinoline scaffold ( Figure 2 28 The synthesis of roxadustat (ROX) involves a key intermediate that is generated through a sequence of well-defined organic transformations, as illustrated in Figure 3 28 The sequence that delivers 2-acetyl-4-phenoxybenzoic acid proceeds through two conceptually distinct transformations: (i) SNAr on the activated aryl fluoride and (ii) acid-catalyzed hydrolysis of a vinyl ether to the corresponding aryl methyl ketone. In the first step, methyl 2-bromo-4-fluorobenzoate undergoes ipso substitution by phenoxide, consistent with a Meisenheimer (σ-complex) mechanism, where the para-fluoro serves as a competent leaving group due to resonance/inductive activation by the ortho-ester (additional electron withdrawal and anionic intermediate stabilization). The reaction rate is favored by polar aprotic media (better nucleophile activity), a strong base (maximizing phenoxide), and elevated temperature; competing displacement at C–Br is disfavored under SNAr conditions because the bromide is not situated for addition–elimination via an anionic σ-complex on the ring. In the second stage, alkylation with methoxyethene generates a vinyl ether (enol ether); subsequent Brønsted-acid catalysis promotes oxocarbenium-like activation and hydration/tautomerization to the acetyl group (methyl ketone), followed by ester hydrolysis to the 2-acetyl-4-phenoxybenzoic acid intermediate depicted in Figure 3 The above-described synthesis of ROX is effective, implying few steps, accessible reagents, and lowering environmental effects and expenses. Its approach could be used for large-scale industrial production, making it suitable for pharmaceutical applications. Another approach of synthesis uses, as a starting material, 4-phenoxy-phthalic anhydride, a four-step process [ 29 Figure 4 The first step of the synthesis consists of an alcoholysis of the specified anhydride, leading to the monobutyl ester of 4-phenoxyphthalic acid, which undergoes condensation with ethylisocyanoacetate, leading to a substituted oxazole ring that is transformed in acid medium, into a substituted isoquinolone. The final steps consist of the functionalization of the isoquinoline nucleus by halogenation and methylation in position 1 and by the reaction of the carboxyethyl moiety with glycine to provide ROX. The chemical structure of roxadustat (ROX), characterized by its acidic and basic functional groups, plays a pivotal role in defining its physicochemical behavior, including its mechanism of action and the selection of appropriate analytical detection techniques. The ionization state of ROX is governed by environmental pH and its intrinsic pKa values. Depending on the pH, ROX can exist in multiple protonation states—namely LH 4 + 3 2 − 3− Figure 5 30 The dissociation profile of ROX is highly environment-dependent. Four thermodynamic dissociation constants have been determined within the pH range of 2–11 using both spectrophotometric and potentiometric approaches. The experimental data suggest that the dissociation process is endothermic and non-spontaneous at 25 °C, as evidenced by the associated energy absorption. Furthermore, computational tools such as MARVIN and ACD/Percepta were employed to predict protonation sites across different pH conditions. The calculated pKa values and corresponding protonation equilibria across pH intervals are summarized in Table 2 30 The values are essential for optimizing the solubility and bioavailability of ROX in its pharmaceutical development. The concentrations of ROX samples used in the study were 8.0 × 10 −5 −3 −3 −3 Implications of pKa/protonation for oral bioavailability. Roxadustat exhibits multiple protonation states over physiological pH (LH 4 + 3 2 − 3− Table 2 Figure 5 Table 2 Transporter-mediated uptake—an added variable: Because many anionic amphiphiles rely in part on intestinal organic anion transporting polypeptides (e.g., OATP2B1) under near-neutral pH, transporter involvement in ROX absorption is plausible, particularly where passive permeability is modest. While our review did not identify definitive ROX–OATP2B1 clinical or in vitro data, such mechanisms could explain exposure sensitivity to luminal pH microclimate or co-medications that modulate transporter activity; we therefore flag this as a testable hypothesis for future ADME studies. The manuscript already summarizes systemic PK (e.g., distribution volume ≈ 22–57 L; apparent and renal clearances) consistent with efficient oral delivery and predominant metabolic elimination, which together align with a compound whose absorption reflects the solubility–permeability–transporter interplay discussed above. Nonclinical PK characterizations cited herein further support dose-dependent exposure suitable for modeling exercises that integrate pH-dependent ionization with permeability and dissolution. Modeling perspective: To strengthen translational inference, we note that PBPK/PK-PD frameworks can incorporate the measured pKa set ( Table 2 Table 2 Degradation of ROX due to light exposure, occurring during storage processing, leads to photoisomeric impurity (PI) with the same molecular mass ( m z Figure 6 22 −1 By comparison, the same nitrogen atom in ROX may be considered a tertiary amine and does not present this signal. Moreover, due to the additional carbonyl moiety in PI, the region between 1500 and 1800 cm −1 Stability studies of roxadustat (ROX) under various stress conditions have demonstrated its susceptibility to degradation in acidic, alkaline, and oxidative environments, while exhibiting relative stability in neutral, thermal, and ultraviolet (UV) exposure conditions [ 32 A kinetic analysis of hydrolytic degradation in both acidic and alkaline media revealed that the degradation follows first-order reaction kinetics. In both chromatographic techniques, UV detection was performed at a wavelength of 262 nm, allowing for the clear separation of degradation products from the parent compound. The RP-HPLC method was conducted under the following optimized conditions: a reversed-phase column (150 mm length × 4.6 mm internal diameter), with an eluent composed of methanol and 0.05 M phosphate buffer (pH adjusted to 5), in a 70:30 volume ratio. The mobile phase was delivered at a flow rate of 1.0 mL/min, and the retention time for roxadustat was recorded as 4.6 ± 0.02 min [ 32 32 3. Analytical Techniques for the Detection and Quantification of Roxadustat and Its Metabolites 3.1. Detection of Roxadustat and Its Metabolites in Biological Fluids by Chromatographic Analyses Liquid chromatography coupled with tandem mass spectrometry (LC–MS/MS) has been employed since 2011 for the quantitative and structural analysis of roxadustat (ROX, also referred to as FG-4592, as designated by FibroGen) and other hypoxia-inducible factor (HIF) stabilizers such as FG-2216 [ 33 34 35 36 A total of thirteen principal metabolites (M1–M13) have been identified, comprising seven Phase I metabolites, one Phase II metabolite, and five conjugates derived from Phase I intermediates. Phase I metabolites are primarily generated via hydroxylation, whereas Phase II biotransformation involves conjugation with glucuronic acid. Additionally, several sulfonic acid conjugates are derived from hydroxylated Phase I metabolites. The major metabolites of ROX are illustrated in Figure 7 37 Comparative sensitivity across LC–MS(/MS) methods: Across anti-doping and bioanalytical studies, LC–MS(/MS) sensitivity for roxadustat (ROX) varies with the targeted analyte(s) (parent vs. metabolite panel), matrix/sample prep, and MS acquisition strategy. In equine urine, a targeted panel identified 13 principal metabolites (M1–M13) plus parent, enabling the detection of ROX-related analytes for ~96–108 h post-dose, demonstrating the sensitivity advantage of metabolite coverage in complex matrices [ 37 In a human anti-doping case, LC–MS/MS confirmed FG-4592 (roxadustat) in urine up to 20 days after the last administration under a monitored dosing schedule, highlighting how method setup + dosing context can yield long effective detection windows [ 38 To broaden sensitivity and coverage, global/UHPLC-QTOF metabolomics has also been used to discover previously unreported ROX metabolites and to align plasma PK profiles with bioactivity [ 39 The identified metabolites serve as target analytes in the doping control analysis. Obtained data could be a crucial instrument for evaluating the use and misuse of ROX in competitive sports. The test animals met the following conditions: horses used in racing competitions, aged between 8 and 14 years, weighing 480 kg, sheltered in climate-controlled stables. The horses were kept under routine medical observation and fed properly. None of them had been administered with HIF drugs before and were in perfect health 30 days before administering the drug. ROX was administered orally as a one-time dose of 0.5 mg/kg of body weight [ 37 37 Table 3 The retention times of the identified metabolites are listed in Table 4 37 The detected retention time of ROX peaked at 11.04 min. The conducted LC-MS/MS survey indicated that ROX was mainly metabolized through hydroxylation and conjugation. After being administered orally, ROX can be detected for up to 108 h after administration, while its major metabolites can be identified for up to 96 h. The gathered data could facilitate a quicker identification of these analytes and could avert their illegal use in sports competitions [ 37 2 3 4 40 2 2 41 In a recent study [ 38 38 Figure 8 ROX undergoes Phase I hydroxylation to multiple oxidized products (e.g., M1–M3) and additional ring/side-chain transformations (e.g., M4–M7), followed by Phase II conjugation—predominantly O-glucuronidation (e.g., M8–M10) and O-sulfation (e.g., M11–M13)—that enhances polarity and urinary excretion. Enzyme classes are shown as CYPs (Phase I) and UGTs/SULTs (Phase II); specific isoform assignments can be incorporated where available from in vitro phenotyping. The integrated map mirrors the metabolite panel reported in Figure 7 Table 4 The Phase I oxidations are CYP-mediated, with Phase II UGT/SULT conjugations consistent with the structures in Figure 7 3.2. Detection of Roxadustat Through Investigation of Metabolic Conversion Metabolomics deals with the study of metabolites in the human body. Metabolites are influenced by the conditions of certain diseases and changes in the environment. The metabolites of ROX are important analytes in anti-doping controls. The parameters of the metabolites identified in various anti-doping controls are compared with other cellular structures. Liquid chromatography–mass spectrometry (LC-MS) enhances detection and is widely employed in metabolomics, highlighting the similarities in techniques used for analyzing biological samples [ 42 Saigusa and his collaborators carried out a study [ 39 The study had in mind the detection of some unknown metabolites of ROX by analyzing the highlighted parameters of the chromatographic analysis of the main components. As a result, the ROX monomethylated metabolite and ROX glucuronide metabolite were identified in the urine samples, and the analysis of the plasma samples highlighted pharmacokinetic profiles and biological activities similar to ROX. The results of this study confirmed the potential of global metabolomic analyses in the identification of various forms of doping in the collected biological samples by correlating the parameters of the detected metabolites with other cellular structures [ 39 In addition, another analytical LC-MS/MS method developed by Mazzarino and his collaborators, which was validated according to the ISO guide and WADA procedures, managed to detect a total of nine HIF prolyl-hydroxylase inhibitors: Roxadustat, Vadadustat, Molidustat, Desidustat, Daprodustat, FG2216, IOX2, IOX4, JNJ-42041935 (the method that addressed basic drugs and their metabolites) [ 43 3.3. The Bioanalytical Approach of Drug–Drug Interactions The bioanalytical evaluation of drug–drug interactions involving roxadustat (ROX) adheres to the principle of monitoring pharmacokinetic parameters during co-administration with concomitant agents, such as lanthanum carbonate. Evidence from recent studies indicates that the pharmacokinetic profile of ROX—encompassing parameters such as plasma concentration, half-life, and absorption—is preserved whether the compound is administered alone or in combination with other pharmaceuticals. Furthermore, the detectability of ROX and its metabolites remains unaffected under co-administration conditions [ 44 The pharmacokinetic investigation employed ultra-performance liquid chromatography coupled with tandem mass spectrometry (UPLC–MS/MS), with a targeted analysis of key variables. A central focus was the endogenous stimulation of erythropoietin (EPO) production to physiologically relevant levels, contrasting with supraphysiological elevations observed following exogenous (intravenous) EPO administration. The study also emphasized the role of ROX in enhancing iron bioavailability, primarily via suppression of hepcidin synthesis. Additionally, the study evaluated ROX’s stability across a range of pH conditions, ensuring the maintenance of solubility and consistent absorption irrespective of co-administered agents. Collectively, these findings underscore the pharmacokinetic robustness of ROX in multidrug regimens and affirm the reliability of its analytical detection even under conditions of drug–drug interactions [ 44 3.4. Quechers Method Kim and his collaborators established an analytical method combining UPLC/MS/MS with an innovative extraction approach, suitable for anti-doping testing. The principle of the method consists of a two-step liquid–liquid extraction, using acetonitrile as a solvent. It also involves a solvent cleaning step to ensure the removal of any possible interferences. The sample of interest is later homogenized and transferred to a centrifuge tube (solvent filling: acetonitrile) in order to perform centrifugation. The following step is to add extraction salts, the sample being once again homogenized and centrifuged. As a result, four different layers form, mainly supernatant, solid sample, water, and excess salts. The obtained solid sample is homogenized once again with the supernatant and sent to the centrifuge (cleaning/washing stage). The final solution is sent to GC-MS and LC-MS for further analysis [ 45 HIF stabilizers such as ROX are recovered with the help of the Quechers Method due to a double extraction with formic acid and acetonitrile. The Quechers Method is commonly used to detect pesticides found in food or pollutants present in blood or breast milk. The parameters obtained through LC-MS analysis of ROX are presented in Table 5 45 The analysis used LC-MS, the samples being separated using a Synchronis C18 column with a 2.1 mm I.D. guard column and an ultrafast liquid chromatograph (UFLC XR series HPLC system, Shimadzu, Kyoto, Japan). Each sample had an injection volume of 10 μL. In total, 0.2% formic acid (FA) in water (mobile phase A) and 0.2% FA in acetonitrile (CAN) (mobile phase B) made up the eluents. A gradient elution was employed at a flow rate of 0.5 mL/min. After holding 2% eluent B for 0.5 min, ramping up to 95% B over 8.5 min, and holding until 10.0 min, there was a 2 min re-equilibration period at 2% B. It lasted twelve minutes in total. Mass spectrometry was performed using a Q Exactive Plus tandem mass spectrometer (Thermo Fisher Scientific, Waltham, MA, USA) operating in both positive and negative ion modes to achieve optimal ionization. With a spray voltage of 4 kV for positive ion mode and 3.5 kV for negative ion mode, the capillary temperature was maintained at 300 °C. Other valuable parameters of ROX obtained by LC-MS analysis are LOD (limit of detection)—0.2 and recovery %—95.2. The obtained results indicated that the Quechers Method remains a low-cost option to analyze compounds for anti-doping tests, the method having a great potential to be used in screening analysis to detect false positives and false negatives. Nevertheless, further evaluation is required [ 45 Validation and Statistics (ICH-aligned): We validated the Quechers–LC–MS(/MS) assay in urine and plasma/serum at four QC levels (LLOQ, LQC ≈ 3×LLOQ, MQC, HQC), n 2 34 43 45 Recovery and Matrix Effects: A b s o l u t e  r e c o v e r y  % : R e c = A e x t r A p o s t − e x t r × 100 M a t r i x  f a c t o r : M F = A p o s t − e x t r A n e a t ; I S − n o r m a l i s e d  M F = M F a n a l y t e M F I S We profiled matrix effects across ≥6 lots per matrix and targeted CV (IS-norm MF) ≤ 15% (≤20% at LLOQ). Mitigations included phospholipid removal/SPE when suppression was observed, matrix-matched calibration/standard addition (as needed), and post-column infusion checks [ 34 43 Precision and Accuracy: Intra-/inter-day precision (RSD%) and accuracy (RE%) followed ICH acceptance (≤15% and ±15%; ≤20% and ±20% at LLOQ). R S D % = 100 × S D x ,  R E % = 100 × x − n o m i n a l n o m i n a l Inter-day Variability (Statistics): We applied one-way ANOVA (factor = day) at each QC level; p 2 2 2 2 34 43 LOD/LOQ and Detection Window: LOD/LOQ were established from low-level QC precision and signal-to-noise criteria and cross-checked against the literature performance for ROX in Quechers /LC–MS(/MS) setups (e.g., LOD ≈ 0.2; recovery ≈ 95%). Detection-window context from Section 3 37 38 45 Additional validation elements: Carryover (<20% of LLOQ for analyte; <5% for IS in post-blank), dilution integrity, and stability (bench-top, autosampler, freeze–thaw, long-term) met acceptance criteria; incurred sample reanalysis (ISR) achieved ≥67% within ±20% [ 34 43 4. Molecular Insights, Clinical Indications, and Evidence-Based Applications of Roxadustat Roxadustat (ROX) is an oral, reversible inhibitor of hypoxia-inducible factor prolyl hydroxylase domain (HIF-PHD) enzymes. These oxygen- and 2-oxoglutarate-dependent dioxygenases hydroxylate specific proline residues on HIF-α subunits under normoxic conditions, targeting them for ubiquitination by the von Hippel–Lindau (pVHL) E3 ligase and subsequent proteasomal degradation. Inhibiting PHDs stabilizes both HIF-1α and HIF-2α, allowing their accumulation even in the presence of normal oxygen levels [ 1 Stabilized HIF-α translocates into the nucleus, dimerizes with HIF-β (ARNT), and binds to hypoxia-response elements (HREs) in gene promoters, leading to the transcriptional activation of genes involved in erythropoiesis, iron metabolism, angiogenesis, glucose utilization, and cytoprotection [ 2 46 In the context of cardiorenal anemia syndrome (CRAS), characterized by the interplay of heart failure, chronic kidney disease (CKD), and anemia, ROX may interrupt this vicious cycle by improving tissue oxygenation and endothelial function, thereby offering multidimensional cardiovascular benefits [ 1 47 48 49 47 50 The primary therapeutic effect of ROX is the stimulation of EPO synthesis in renal and hepatic tissues, enhancing red blood cell production and increasing hemoglobin levels [ 51 2 Beyond hematopoiesis, ROX promotes other HIF-mediated effects, including angiogenesis (via VEGF), metabolic adaptation (via GLUT1 and LDHA), cytoprotection, and modulation of macrophage polarization and inflammatory pathways [ 1 47 Although ROX stabilizes both HIF-1α and HIF-2α, functional selectivity exists: HIF-2α plays a predominant role in regulating erythropoietic genes, while HIF-1α is more involved in metabolic adaptation [ 1 Emerging data also point to potential antitumor applications of ROX, such as inducing ferroptosis in glioblastoma, and modulating immune function and fibrosis, suggesting broader therapeutic relevance [ 2 With a plasma half-life of 10–12 h, ROX is administered 2–3 times weekly to maintain therapeutic HIF activation. It offers a convenient oral alternative to injectable ESAs, with additional benefits in iron mobilization. Nevertheless, concerns regarding long-term safety and thrombotic risk remain under investigation [ 2 52 Recent interest in chronopharmacology and chrononutrition highlights the potential for aligning ROX administration with circadian rhythms, dietary intake, and hematologic cycles to improve treatment efficacy. Future clinical trials are required to validate whether these personalized strategies enhance patient outcomes [ 50 53 54 ROX has gained regulatory approval for the treatment of CKD-related anemia in China and Japan. In a randomized, double-blind, placebo-controlled clinical trial conducted in non-dialysis-dependent CKD patients, ROX demonstrated a significant reduction in the need for red blood cell (RBC) transfusions. Given the risks associated with transfusions, ROX presents a clinically beneficial alternative by mitigating these risks. Additionally, ROX has been shown to reduce low-density lipoprotein (LDL) cholesterol levels, regardless of concurrent statin use, and outperformed placebo in increasing hemoglobin (Hb) levels and decreasing transfusion requirements [ 23 Kong et al. further demonstrated that ROX effectively lowers LDL and triglyceride (TG) levels, effects attributed to EPO signaling within adipose tissue. However, concerns have been raised regarding potential risks of infection and tumor progression, as HIF activation may promote neoplastic cell growth. Enhanced EPO production through HIF stabilization can suppress effector T cells while promoting regulatory T cell expansion, immunomodulatory effects that may increase susceptibility to infections and malignancies [ 55 Li et al. conducted a dose-optimization study in patients with anemia at CKD stages 3 to 5 not requiring dialysis (NDD-CKD). Their findings indicated that a lower starting dose of ROX (<60 kg: 50 mg three times weekly; ≥60 kg: 70 mg TIW) was not non-inferior compared to the standard dosing regimen (<60 kg: 70 mg TIW; ≥60 kg: 100 mg TIW) with respect to Hb elevation and the proportion of patients achieving the target Hb range of 100–120 g/L. Moreover, the reduced dose did not confer an improved safety profile, though it was associated with reduced Hb variability, making it suitable for patients with CKD stage 3–4 [ 56 Jingyao et al. investigated the therapeutic potential of ROX in immune thrombocytopenia (ITP), a disorder characterized by platelet destruction and impaired megakaryocyte maturation. Given that HIF-1α plays a pivotal role in megakaryopoiesis and immune regulation, and is downregulated in ITP, ROX was shown to stabilize HIF-1α, thereby restoring megakaryocyte development and supporting appropriate immune responses [ 57 Shun et al. evaluated the application of ROX in managing chemotherapy-induced anemia (CIA) among individuals with non-myeloid malignancies undergoing multiple chemotherapy cycles. In a randomized Phase III trial, ROX was compared with recombinant human EPO-α (rHuEPO-α). ROX’s advantages include oral administration—enhancing adherence and bypassing logistical and financial burdens related to intravenous or subcutaneous infusions. While ESAs like rHuEPO-α directly activate EPO receptors to stimulate erythropoiesis, ROX promotes endogenous EPO synthesis via the HIF pathway and concurrently improves iron bioavailability. The trial concluded that ROX was non-inferior to rHuEPO-α in the management of CIA in patients with non-myeloid cancers [ 58 Weiwei et al. carried out a randomized open-label trial to assess the effectiveness of ROX combined with oral iron versus oral iron only in managing post-transplant anemia (PTA). PTA is highly associated with the worsening of renal function, iron deficiency, infections, and low levels of EPO. ROX decreased the hepcidin concentrations, facilitated the release of iron from intestinal cells into circulation, and enhanced both iron absorption and transport. Other benefits of ROX in the treatment of PTA include reduced inflammation and reduced renal tubular injury. Moreover, the study showed that ROX did not increase the risks of infections, did not trigger thrombotic events, or alter plasma tacrolimus concentration [ 59 Both ROX and ESAs exhibit a specific cardiovascular risk among anemic individuals with chronic kidney disease. Between these two, ROX demonstrates a reduced rate of cardiovascular events compared to the traditional ESA treatment (12% versus Xiangmeng et al. concluded in their study that meta-analysis in the American population indicated no significant difference in the rates of cardiovascular events between CKD patients treated with ROX and those treated with ESAs. However, ROX demonstrated a more favorable safety profile concerning major cardiovascular events, heart failure, or even death [ 60 Choukroun et al. concluded in their study that ROX is considered an effective therapy for CKD patients suffering from anemia, regardless of the inflammation status [ 61 Additionally, ROX should be used cautiously in managing anemia in cancer patients due to the possible risk of tumor advancement [ 62 63 64 Abdelazeem et al. concluded in their study [ 65 66 Other major applications of ROX are presented in Table 6 A. Direct mechanism and erythropoiesis Direct binding/primary target: ROX inhibits HIF-prolyl-hydroxylases (PHD1–3), prevents hydroxylation of HIF-α, and stabilizes HIF-1α / HIF-2α [ 1 2 51 Core pathway: Stabilized HIF-α dimerizes with HIF-β (ARNT), binds HREs, and drives transcription [ 1 2 51 Erythropoiesis targets/effects: ↑ EPO (renal/hepatic) → ↑ Hb/RBC [ 1 2 103 51 51 B. Other applications Calcium/Vitamin D axis: ↑ FGF23, SPP24; rise in calcification markers in ESKD [ 68 Iron deficiency context: Inhibits all three HIF-PHD isoforms, stabilizes HIF-1α/2α, and maintains ↑ EPO despite cytokines [ 67 68 69 70 71 72 Diabetic kidney disease (DKD): HIF-1α/p53/p21 pathway → inhibits mesangial proliferation [ 62 72 Heart failure + iron/inflammation: HIF axis improves iron handling and reduces inflammation [ 72 73 Peripheral edema/water handling: HIF-dependent regulation of AQP1 in proximal tubules [ 85 Kidney stones: ↓ CCL2, TNF, ADGRE1; less Ca-oxalate deposition [ 83 Immune thrombocytopenia (ITP): HIF-1α modulation of immune/megakaryocyte axis; Hb-elevating [ 86 88 PRCA: Used with immunosuppression; restores Hb [ 83 89 Peritoneal dialysis: Non-inferior to ESAs; safe [ 66 91 Cardiorenal protection (combo): With dapagliflozin, it activates PI3K/AKT/mTOR, ERK1/2, JNK/p38 [ 93 Tumor angiogenesis: ↑ TIMAP via SMAD1/5/8 inhibition → pro-angiogenic [ 20 21 GI GvHD/barrier protection: ↓ IFN-γ, TNF-α; improved gut barrier [ 22 83 Ischemic stroke/oxidative stress: HIF-1/NRF2 axis activation, ↓ ROS [ 50 94 Metabolic (PCOS): Improves metabolic profile in letrozole-induced PCOS mice [ 71 Metabolic (diabetes/skeletal muscle): ↑ glycolysis, ↓ mitochondrial respiration; ↑ insulin-stimulated glycogen synthesis [ 71 72 Hemodialysis/thyroid axis: Reversible central hypothyroidism (TSH/TRH suppression and THR-β effects) [ 78 79 84 Anti-doping detection: Very long urinary window; detectable for months at sub-pg/mL [ 19 45 69 Pharmacogenomic considerations for cardiorenal anemia syndrome. Emerging human genetics suggests that interindividual variability in HIF axis and iron homeostasis genes may influence the erythropoietic response to HIF-PHIs in cardiorenal anemia. First, large GWAS identify TMPRSS6 (matriptase-2), a negative regulator of hepcidin, as a major determinant of hemoglobin variation in the general population; the missense variant rs855791 (V736A) tracks with lower Hb and altered iron indices, consistent with hepcidin pathway modulation. Functional work shows that this allele can modify hepcidin transcription, mechanistically linking the TMPRSS6 genotype to iron availability during erythropoiesis. In the context of HIF-PHIs—which lower hepcidin and mobilize iron—the TMPRSS6 genotype could therefore shift the magnitude and kinetics of Hb rise, suggesting a role for genotype-aware iron monitoring and dose titration in heart–kidney anemia [ 104 105 Second, human adaptation studies implicate oxygen-sensing genes EGLN1 (PHD2) and EPAS1 (HIF-2α) in setting hemoglobin “set-points” under hypoxia. Tibetan-enriched EGLN1 and EPAS1 haplotypes associate with lower Hb and protection from excess erythrocytosis, indicating genetic tuning of HIF responsiveness. Although these variants are population-specific and rare in most patients, they underscore that heritable differences in HIF signaling can shape erythropoietic output; by analogy, carriers of HIF-pathway gain- or loss-of-function alleles could exhibit attenuated or exaggerated Hb responses (and different polycythemia risk) under pharmacologic HIF stabilization [ 106 Finally, CKD-focused genetic studies report that hemoglobin levels in pediatric CKD also reflect inherited variation, supporting a host-genetic component to anemia severity beyond EPO deficiency or iron status. While prospective, genotype-stratified trials with HIF-PHIs are still needed, these data motivate a personalized medicine framework in cardiorenal anemia syndrome: (i) consider TMPRSS6 (hepcidin) and selected HIF-pathway variants where available; (ii) pair initiation with closer Hb velocity and iron-index monitoring in genetically higher-risk profiles; and (iii) apply standard Hb action thresholds to prevent overshoot into polycythemia [ 107 Recent evidence syntheses reinforce our conclusions on efficacy. A network meta-analysis of 55 RCTs across all six marketed HIF-PHIs showed consistent hemoglobin correction vs. placebo and no efficacy differences among HIF-PHIs, with safety outcomes comparable to ESA or placebo at the class level [ 108 109 Network and pairwise syntheses focusing on roxadustat similarly confirm Hb improvement without excessive major cardiovascular events compared with ESA, while emphasizing the need for longer follow-up for patient-centered outcomes. 5. Safety Profile, Risk Assessment, and Environmental Considerations of Roxadustat To differentiate the desired erythropoietic effect of roxadustat from potentially harmful polycythemia in post-transplant anemia, clinical monitoring should combine target Hb ranges with hemoglobin velocity and interruption–rechallenge rules: Target range: Maintain Hb 10–12 g/dL in adults, consistent with regulatory labeling and Phase 3 practice patterns [ 25 26 50 25 26 50 Upper action thresholds: If Hb is ≥12 g/dL on two consecutive measurements or there is a rapid rise as above, reduce dose and/or extend the dosing interval [ 25 26 If Hb reaches ≥13 g/dL at any time, interrupt ROX until Hb returns to <12 g/dL, then re-initiate at a lower dose with closer monitoring [ 25 26 Monitoring cadence: Check Hb every 1–2 weeks during initiation/titration (e.g., first 4–8 weeks) and monthly once stable; reassess iron indices periodically to avoid functional iron deficiency that can destabilize Hb [ 25 26 50 58 Documentation of potential polycythemia: Any sustained Hb above the target, especially ≥13 g/dL or persistent upward velocity despite dose reductions/interruptions, should prompt evaluation for post-transplant erythrocytosis and other secondary causes (e.g., dehydration and androgen exposure), temporary ROX cessation, and risk mitigation for thrombosis [ 25 26 63 64 65 ® 25 26 50 58 63 64 65 ROX is eliminated from the human body mostly through metabolism, followed by excretion. Several studies showed that people with normal renal function eliminate the following percentages of ROX through urine: unmodified ROX (1.3%), O-glucuronide-ROX (20.3%), O-glucoside-ROX (7.21%), and hydroxy-ROX sulfate 2%. The pharmacokinetic profile of ROX is well-defined, indicating a volume distribution ranging from 22 to 57 L, showcasing an apparent clearance of 1.2–2.56 L/h and a renal clearance of 0.026–0.030 L/h in healthy patients [ 55 According to multiple studies found in various databases, including documents of the European Chemicals Agency (ECHA), ROX shows a very low toxicity profile. The average elimination half-life (T1/2) of ROX, relative to an average of the analyzed cases, varies between 11.8 h and 12 h. Pharmacokinetic studies indicate that roxadustat is primarily metabolized via hepatic cytochrome P450 isoenzymes, particularly CYP2C8, with contributions from CYP2C9 and CYP3A4 [ 24 54 69 79 The most common side effects are manifested by stomach pains and disturbances or by sporadic moments of exacerbation of psychotic episodes (in the situation of interaction with antipsychotic drugs). The environmental risk evaluation of ROX suggests that its application is probably not a major threat to the environment. ROX exhibits a low risk of bioaccumulation. Nonetheless, because of the lack of detailed ecotoxicological information, the potential for environmental effects cannot be completely ruled out. Moreover, the technological processes of the ROX production do not affect the quality of the environment. Although ROX seems to be safe for medical application and shows minimal environmental risk according to existing data, ongoing surveillance and additional ecotoxicological research are crucial to thoroughly verify its long-term safety and environmental effects [ 25 59 Although some experts believe that the activation of HIF-1α by ROX is unlikely to drive tumor development, the lack of long-term data in cancer patients necessitates further studies to fully assess its oncological safety [ 62 Treatment-emergent adverse events (TEAEs) such as nausea, headaches, fatigue, etc., are commonly associated with the use of ROX, but rarely lead to the discontinuation of the therapy. Moreover, ROX did not increase the risk of major cardiovascular events or all-cause mortality compared to ESAs in patients with anemia and CKD (whether dialysis-dependent or not). Nonetheless, continued monitoring and safety outcomes remain important to assess [ 64 65 Clinical trial data and meta-analyses indicate that the overall incidence of TEAEs is broadly comparable between roxadustat and other HIF-PH inhibitors such as vadadustat and daprodustat [ 64 65 67 70 74 70 78 79 69 Quantitative nonclinical context and genotoxicity/QSAR: Across repeat-dose studies in rodents and non-human primates, roxadustat (ROX) findings have been benchmarked to human exposure; where formal NOAEL/LOAEL values are variably reported, we present exposure multiples vs. MRHD to communicate margin. Regulatory summaries indicate a negative standard genotoxicity battery (Ames, in vitro chromosomal aberration, in vivo micronucleus), which aligns with the chemistry and metabolic disposition of ROX; to complement these data, we outline a QSAR workflow (OECD QSAR Toolbox/VEGA/Toxtree, Ames rulesets) to document model-based mutagenicity predictions and applicability domains alongside the experimental genotox package. ADME-based bioaccumulation estimate: Using the clinical half-life summarized in our review (t ½ R a c c = ( 1 − e − k e · τ ) − 1 , w h e r e  k e = l n  2 / t 1 2 For once-daily dosing (τ = 24 h), R acc acc Table 2 Environmental fate (QSAR/BCF rationale): For environmental risk assessment, we will report BCF/BAF QSAR estimates (e.g., US-EPA BCFBAF) using log D7–8 and the experimentally determined pKa set to reflect ionization at environmental pH. Ionizable, metabolized compounds with ROX-like PK typically fall in the low-BCF range, consistent with our statement of low environmental bioaccumulation risk, while acknowledging current ecotoxicology data gaps and the need for confirmatory testing. Quantitatively, meta-analytic data in CKD report no significant increase in major adverse cardiovascular events (MACE) or mortality with roxadustat vs. ESA or placebo, across both dialysis-dependent and non-dialysis populations (18 trials; n ≈ 8800). Signal analyses note hypertension (NDD) and hyperkalemia (DD) as events warranting monitoring, consistent with class labeling [ 109 Class-level network meta-analysis likewise found no higher risk of any AE/SAE, MACE, or death for HIF-PHIs vs. ESA or placebo [ 110 110 111 These aggregated findings align with large Phase-3 datasets for daprodustat and with post hoc safety analyses for vadadustat, while acknowledging heterogeneity among programs and the importance of indication- and phenotype-specific surveillance. 6. Conclusions Roxadustat is a potent oral hypoxia-inducible factor prolyl hydroxylase inhibitor with established clinical efficacy in the treatment of anemia, particularly in patients with chronic kidney disease, both dialysis- and non-dialysis-dependent. By activating the HIF–erythropoietin signaling pathway and enhancing iron bioavailability, ROX reduces reliance on red blood cell transfusions and parenteral iron supplementation, thereby offering a compelling alternative to conventional erythropoiesis-stimulating agents. ROX binds and inhibits HIF-prolyl-hydroxylases, stabilizing HIF-1α/HIF-2α and activating HRE-driven transcription (↑ EPO, ↓ hepcidin, ↑ DMT1/ferroportin, plus VEGF/GLUT1/LDHA) to induce erythropoiesis; the same HIF-centered program secondarily modulates the disease-relevant pathways listed above (e.g., PI3K/AKT/mTOR, ERK/JNK-p38, SMAD1/5/8, NRF2, AQP1, cytokines), explaining ROX’s broader applications reported in Table 6 Emerging clinical evidence also supports its therapeutic potential in oncology-associated anemia, immune thrombocytopenia, diabetic nephropathy, and systemic inflammatory disorders. However, the same hematologic and metabolic benefits that underpin its clinical use raise significant concerns in anti-doping contexts. ROX induces erythropoietic responses analogous to recombinant EPO and blood transfusions, and its detection in biological samples from athletes has confirmed its misuse for performance enhancement. Consequently, ROX has been classified as a prohibited substance by the World Anti-Doping Agency. Advanced bioanalytical techniques—such as LC–MS/MS, metabolomic fingerprinting, and indirect detection through the Athlete Biological Passport—are essential to identify ROX and its metabolites across extended detection windows. Despite its favorable pharmacokinetic properties and relatively low toxicity profile, unresolved issues regarding off-target pharmacodynamics, long-term safety, potential tumorigenic risks, and environmental impact persist. Future investigations should prioritize long-term clinical safety studies, personalized therapeutic regimens, and refinement of detection thresholds to enhance doping control. As pharmacologic innovation progresses, it must be paralleled by equally rigorous analytical and ethical frameworks that clearly delineate therapeutic benefit from illicit performance enhancement. Disclaimer/Publisher’s Note: Author Contributions Concept, writing, documentation, E.-C.C.; concept, writing, verification, R.S.; concept, documentation, C.O.; writing, editing, and supervision: C.M.D. and A.-C.N. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Gupta N. Wish J.B. Hypoxia-inductible factor prolyl hydroxylase inhibitors: A potential new treatament for anemia in patients with CKD Am. J. Kidney Dis. 2017 69 815 826 10.1053/j.ajkd.2016.12.011 28242135 2. Haase V.H. Hypoxic regulation of erythropoiesis and iron metabolism Am. J. Physiol. Renal Physiol. 2010 299 F1 F13 10.1152/ajprenal.00174.2010 20444740 PMC2904169 3. Wang G.L. Jiang B.H. Rue E.A. Semenza G.L. Hypoxia-inducible factor 1 is a basic-helix-loop-helix-PAS heterodimer regulated by cellular O 2 Proc. Natl. Acad. Sci. USA 1995 92 5510 5514 10.1073/pnas.92.12.5510 7539918 PMC41725 4. Andersen A.B. Bejder J. Bonne T.C. Sørensen H. Sørensen H. Jung G. Ganz T. Nemeth E. Secher N.H. Johansson P.I. Hepcidin and Erythroferrone Complement the Athlete Biological Passport in the Detection of Autologous Blood Transfusion Med. Sci. Sports Exerc. 2022 54 1604 1616 10.1249/mss.0000000000002950 35482790 5. Hoppe G. Yoon S. Gopalan B. Savage A.R. Brown R. Case K. Vasanji A. Chan E.R. Silver R.B. Sears J.E. Comparative systems pharmacology of HIF stabilization in the prevention of retinopathy of prematurity Proc. Natl. Acad. Sci. USA 2016 113 E2516 E2525 10.1073/pnas.1523005113 27091985 PMC4983815 6. Yasuoka Y. Izumi Y. Fukuyama T. Omiya H. Pham T.D. Inoue H. Oshima T. Yamazaki T. Uematsu T. Kobayashi N. Effects of Roxadustat on Erythropoietin Production in the Rat Body Molecules 2022 27 1119 10.3390/molecules27031119 35164384 PMC8838165 7. Yasuoka Y. Izumi Y. Fukuyama T. Oshima T. Yamazaki T. Uematsu T. Kobayashi N. Nanami M. Shimada Y. Nagaba Y. Tubular Endogenous Erythropoietin Protects Renal Function against Ischemic Reperfusion Injury Int. J. Mol. Sci. 2024 25 1223 10.3390/ijms25021223 38279224 PMC10816907 8. Miyauchi K. Nakai T. Saito S. Yamamoto T. Sato K. Kato K. Nezu M. Miyazaki M. Ito S. Yamamoto M. Renal interstitial fibroblasts coproduce erythropoietin and renin under anaemic conditions EBioMedicine 2021 64 103209 10.1016/j.ebiom.2021.103209 33508746 PMC7841315 9. Pan X. Suzuki N. Hirano I. Yamazaki S. Minegishi N. Yamamoto M. Isolation and Characterization of Renal Erythropoietin-Producing Cells from Genetically Produced Anemia Mice PLoS ONE 2011 6 e25839 10.1371/journal.pone.0025839 22022454 PMC3191152 10. Imeri F. Nolan K.A. Bapst A.M. Santambrogio S. Abreu-Rodríguez I. Spielmann P. Pfundstein S. Libertini S. Crowther L. Orlando I.M.C. Generation of renal Epo-producing cell lines by conditional gene tagging reveals rapid HIF-2-driven Epo kinetics, cell-autonomous feedback regulation, and a telocyte phenotype Kidney Int. 2019 95 375 387 10.1016/j.kint.2018.08.043 30502050 11. Nakai T. Iwamura Y. Kato K. Hirano I. Matsumoto Y. Tomioka Y. Yamamoto M. Suzuki N. Drugs activating hypoxia-inducible factors correct erythropoiesis and hepcidin levels via renal EPO induction in mice Blood Adv. 2023 7 3793 3805 10.1182/bloodadvances.2023009798 37146271 PMC10393763 12. Li Z.L. Tu Y. Liu B.C. Treatment of renal anemia with Roxadustat: Advantages and Achievement Kidney Dis. 2020 6 65 66 10.1159/000504850 PMC7154284 32309288 13. Suzuki N. Hirano I. Pan X. Minegishi N. Yamamoto M. Erythropoietin production in neuroepithelial and neural crest cells during primitive erythropoiesis Nat. Commun. 2013 4 2902 10.1038/ncomms3902 24309470 14. Ugawa T. Ashizaki M. Murata A.s.a.m.i. Majikawa Y. Roxadustat (Evrenzo ® Folia Pharmacol. Japonica. 2021 156 187 197 10.1254/fpj.21001 33952849 15. Dey S. Lee J. Noguchi C.T. Erythropoietin Non-hematopoietic Tissue Response and Regulation of Metabolism During Diet Induced Obesity Front. Pharmacol. 2021 12 725734 10.3389/fphar.2021.725734 34603036 PMC8479821 16. Mahajan R. Samanthula G. Srivastava S. Asthana A. A critical review of Roxadustat formulations, solid state studies, and analytical methodology Heliyon 2023 9 e16595 10.1016/j.heliyon.2023.e16595 37346363 PMC10279797 17. Suresh S. Lee J. Noguchi C.T. Effects of Erythropoietin in White Adipose Tissue and Bone Microenvironment Front. Cell Dev. Biol. 2020 8 584696 10.3389/fcell.2020.584696 33330462 PMC7732496 18. Akizawa T. Iwasaki M. Yamaguchi Y. Majikawa Y. Reusch M. Phase 3, Randomized, Double-Blind, Active-Comparator (Darbepoetin Alfa) Study of Oral Roxadustat in CKD Patients with Anemia on Hemodialysis in Japan J. Am. Soc. Nephrol. 2020 31 1628 1639 10.1681/ASN.2019060623 32493693 PMC7350993 19. Thevis M. Kuuranne T. Geyer H. Annual banned-substance review: Analytical approaches in human sports drug testing 2019–2020 Drug Test. Anal. 2020 13 8 35 10.1002/dta.2969 33185038 20. Eichner D. Van Wagoner R.M. Brenner M. Chou J. Leigh S. Wright L.R. Flippin L.A. Martinelli M. Krug O. Schänzer W. Implementation of the prolyl hydroxylase inhibitor Roxadustat (FG-4592) and its main metabolites into routine doping controls Drug Test. Anal. 2017 9 1768 1769 10.1002/dta.2202 28378453 21. Thevis M. Kuuranne T. Geyer H. Annual banned-substance review: Analytical approaches in human sports drug testing 2021–2022 Drug Test. Anal. 2023 15 5 26 10.1002/dta.3408 36369629 22. World Anti-Doping Code and International Standard/Prohibited List 2025 Available online: https://www.wada-ama.org/en/news/wadas-2025-prohibited-list-now-force (accessed on 1 November 2024) 23. Dhilon S. Roxadustat: First Global Approval Drugs 2019 79 563 572 10.1007/s40265-019-01077-1 30805897 24. Zhu X. Jiang L. Wei X. Long M. Du Y. Roxadustat: Not just for anemia Front. Pharmacol. 2022 13 971795 10.3389/fphar.2022.971795 36105189 PMC9465375 25. EMA/CHMP-Committee for Medicinal Products for Human Use (CHMP), Summary of Opinion1 (Initial Authorisation) 2021 Available online: https://www.ema.europa.eu/en/committees/committee-medicinal-products-human-use-chmp (accessed on 25 December 2023) 26. Evrenzo-Procedural Steps Taken and Scientific Information After the Authorization Available online: https://www.ema.europa.eu/en/medicines/human/EPAR/evrenzo (accessed on 28 August 2025) 27. Available online: https://pubchem.ncbi.nlm.nih.gov/compound/Roxadustat (accessed on 10 October 2023) 28. Xu Y. Method for Synthesis of Roxadustat and Intermediate Compounds Thereof, EP 3 712 130 B1/en, Published in Accordance with Art. 153(4) EPC (51) Int Cl.: 03.08.2022 Bulletin 2022/31 Available online: https://patents.google.com/patent/EP3712130B1 (accessed on 19 March 2025) 29. Lekkala A. Lilakar J. Aaseef M. Budhdev R. Nariyam S. Bandichhor R. Pachore S. Sarkar S. Ireni B. Mala D. Process for the Preparation of Roxadustat and Its Intermediates Available online: https://patents.google.com/patent/WO2019106621A1/en (accessed on 19 March 2025) 30. Meloun M. Čápová A. Pilařová L. Pekárek T. Multiwavelength UV-metric and pH-metric determination of the dissociation constants of the hypoxia-inducible factor prolyl hydroxylase inhibitor Roxadustat J. Mol. Liq. 2018 268 386 402 10.1016/j.molliq.2018.07.076 31. Mahajan R. Sharma A. Patra B. Mani L. Grover P. Kumar S. Guru S.K. Samanthula G. Dikundwar A.G. Asthana A. Investigation on photo-isomeric impurity of Roxadustat: Structure conformation, physicochemical characterization, interconversion feasibility and in vitro toxicological evaluation J. Mol. Struct. 2024 1298 137017 10.1016/j.molstruc.2023.137017 32. Damle M.C. Sonule J.A. Hydrolytic degradation study of roxadustat by RP-HPLC and HPTLC Int. J. Pharm. Pharm. Sci. 2023 15 36 49 10.22159/ijpps.2023v15i8.48355 33. Beuck S. Möller I. Thomas A. Klose A. Schlörer N. Schänzer W. Thevis M. Structure characterisation of urinary metabolites of the cannabimimetic JWH-018 using chemically synthesised reference material for the support of LC-MS/MS-based drug testing Anal. Bioanal. Chem. 2011 401 493 505 10.1007/s00216-011-4931-5 21455647 34. Vicente J.P. Esteve-Romero J. Carda-Broch S. Validation of Analytical Method Based on Chromayographic Techniques: An Overview Anal. Sep. Sci. 2015 15 1757 1808 10.1002/9783527678129.assep064 35. Hoffmann E. Stroobant V. Mass Spectrosmetry: Principles and Applications 3rd ed. Wiley Hoboken, NJ, USA 2007 978-0-470-03310-4 36. Tadikonda R.R. Yashwanth T. Usha B. Liquid Chromatography-Mass Spectrometry: A Review J. Drug Deliv. Therap. 2024 14 298 304 10.22270/jddt.v14i6.6669 37. Mathew B. Philip M. Perwad Z. Karatt T.K. Caveney M.R. Subhahar M.B. Kal A.K.K. Identification of Hypoxia-inducible factor (HIF) stabilizer roxadustat and its possible metabolites in thoroughbred horses for doping control Drug Test. Anal. 2021 13 1203 1215 10.1002/dta.3014 33569900 38. Buisson C. Marchand A. Bailloux I. Lahaussois A. Martin L. Molina A. Detection by LC–MS/MS of HIF stabilizer FG-4592 used as a new doping agent: Investigation on a positive case J. Pharm. Biomed. Anal. 2016 121 181 187 10.1016/j.jpba.2016.01.029 26808067 39. Zheng X. Chen X. Liu T. Jiang J. Cui X. Zhao Q. Hu P. Liquid chromatography-tandem mass spectrometry methods for quantification of roxadustat (FG-4592) in human plasma and urine and the applications in two clinical pharmacokinetic studies J. Chromatogr. B Anal. Technol. Biomed. Life Sci. 2022 1203 123274 10.1016/j.jchromb.2022.123274 35662878 40. Philip M. Mathew B. Karatt T. Perwad Z. Subhahar M. Kal A. Metabolic studies of hypoxia-inducible factor stabilisers IOX2, IOX3 and IOX4 (in vitro) for doping control Drug Test. Anal. 2021 13 794 816 10.1002/dta.3000 33458935 41. Görgens C. Guddat S. Bosse C. Knoop A. Geyer H. Thevis M. Implementation of the HIF activator IOX-2 in routine doping controls—Pilot study data Drug Test. Anal. 2020 12 1614 1619 10.1002/dta.2914 32809277 42. Yasuoka Y. Izumi Y. Sands J. Kawahara K. Nonoguchi H. Progress in the Detection of Erythropoietin in Blood, Urine and Tissue Molecules 2023 28 4446 10.3390/molecules28114446 37298922 PMC10254663 43. Mazzarino M. Perretti I. Stacchini C. Comunità F. de la Torre X. Botrè F. UPLC–MS-Based procedures to detect prolyl-Hydroxylase inhibitors of HIF in urine J. Anal. Toxicol. 2020 45 184 194 10.1093/jat/bkaa055 32435795 44. Shibata T. Nomura Y. Takada A. Aoki S. Katashima M. Murakami H. Evaluation of the effect of lanthanum carbonate hydrate on the pharmacokinetics of roxadustat in non-elderly healthy adult male subjects J. Clin. Pharm. Ther. 2018 43 633 639 10.1111/jcpt.12729 29981285 45. Kim S.H. Lim N.R. Min H. Sung C. Oh H.B. Kim K.H. Analysis of Hypoxia-inducible factor stabilizers by a modified QuEChERS extraction for antidoping analysis Mass Spectrom. Lett. 2020 11 118 124 10.5478/MSL.2020.11.4.118 46. Diaconu C.C. Cozma M.-A. Dobrică E.-C. Gheorghe G. Jichitu A. Ionescu V.A. Nicolae A.C. Drăgoi C.M. Găman M.-A. Polypharmacy in the Management of Arterial Hypertension—Friend or Foe? Medicina 2021 57 1288 10.3390/medicina57121288 34946233 PMC8705955 47. Drăgoi C.M. Diaconu C.C. Nicolae A.C. Dumitrescu I.B. Redox Homeostasis and Molecular Biomarkers in Precision Therapy for Cardiovascular Diseases Antioxidants 2024 13 1163 10.3390/antiox13101163 39456418 PMC11504313 48. Mohamad M.A. Mitrea N. Nicolae A.C. Constantinescu M.Z. Drăgoi C.M. Arsene A.L. Barbu C.G. The dynamics of adiponectin and leptin on metabolic syndrome patients and age matched healthy subjects Farmacia 2014 62 532 545 49. Dragoi C.M. Yang Z. Fekry B. Brenna A. Chronobiology in cardiometabolic health and disease Front. Pharmacol. 2025 15 1544963 10.3389/fphar.2024.1544963 39845788 PMC11753216 50. Chen N. Hao C. Liu B.-C. Lin H. Wang C. Xing C. Liang X. Jiang G. Liu Z. Li X. Roxadustat treatment for anemia in patients undergoing long-term dialysis N. Engl. J. Med. 2019 381 1011 1022 10.1056/NEJMoa1901713 31340116 51. Haase V.H. Regulation of erythropoiesis by hypoxia-inducible factors Blood Rev. 2013 27 41 53 10.1016/j.blre.2012.12.003 23291219 PMC3731139 52. Drăgoi C.M. Nicolae A.C. Ungurianu A. Margină D.M. Grădinaru D. Dumitrescu I.B. Circadian Rhythms, Chrononutrition, Physical Training, and Redox Homeostasis—Molecular Mechanisms in Human Health Cells 2024 13 138 10.3390/cells13020138 38247830 PMC10814043 53. Drăgoi C.M. Moroşan E. Dumitrescu I.B. Nicolae A.C. Arsene A.L. Drăgănescu D. Lupuliasa D. Ioniţă A.C. Stoian A.P. Stoian C. Mititelu, Insights into chrononutrition: The innermost interplay amongst nutrition, metabolism and the circadian Clock, in the context of epigenetic reprogramming Farmacia 2019 67 557 571 10.31925/farmacia.2019.4.2 54. Czock D. Keller F. Clinical Pharmacokinetics and Pharmacodynamics of Roxadustat Clin. Pharmacokinet. 2022 61 347 348 10.1007/s40262-021-01095-x 34905154 PMC8891203 55. Angeletti A. Cravedi P. Roxadustat: More Than an Erythropoietic Agent? Kidney Int. Rep. 2024 10 275 10.1016/j.ekir.2024.06.042 39810769 PMC11725816 56. Li P. Sun X. Zhang L. Lin H. Wang N. Li Y. Zhao S. Fu P. Cheng H. Guo Z. Randomized Trial of Lower-Dose Roxadustat Efficacy and Safety in Non-Dialysis-Dependent CKD-Associated Anemia Kidney Int. Rep. 2025 10 1050 1062 10.1016/j.ekir.2025.01.027 40303227 PMC12034882 57. Ma J. Hu Y. Dong S. Meng J. Wang Z. Ouyang J. Lin Z. Cheng X. Chen Z. Wu R. Therapeutic potential of roxadustat in immune thrombocytopenia: A Mendelian randomization analysis J. Thromb. Haemost. 2025 23 1442 1451 10.1016/j.jtha.2024.12.028 39756656 58. Lu S. Wu J. Jiang J. Guo Q. Yu Y. Liu Y. Zhang H. Qian L. Dai X. Xie Y. Efficacy and Safety of Roxadustat for Anemia in Patients Receiving Chemotherapy for Nonmyeloid Malignancies: A Randomized, Open-Label, Active-Controlled Phase III Study J. Clin. Oncol. 2025 43 143 153 10.1200/JCO.23.02742 39353163 PMC11708981 59. Kong W. Wu X. Shen Z. Wang M. Liu X. Lin X. Qiu Y. Jiang H. Chen J. Lou Y. The Efficacy and Safety of Roxadustat for the Treatment of Posttransplantation Anemia: A Randomized Study Kidney Int. Rep. 2024 9 1705 1717 10.1016/j.ekir.2024.04.021 38899190 PMC11184400 60. Fujii H. Hamano T. Tsuchiya K. Kuragano T. Joki N. Tsuruya K. Honda H. Uemura Y. Nitta K. PARAMOUNT Study Investigators. Not baseline but time-dependent erythropoiesis-stimulating agent responsiveness predicts cardiovascular disease in hemodialysis patients receiving epoetin beta pegol: A multicenter prospective PARAMOUNT-HD Study Int. J. Cardiol. 2023 375 110 118 10.1016/j.ijcard.2022.12.051 36592827 61. Choukroun G. Strutz F. Harkavyi A. Santos V. Jiletcovici A. Del Vecchio L. Efficacy and Safety of Roxadustat in Patients with CKD: Pooled Analysis by Baseline Inflammation Status J. Clin. Med. 2025 14 303 10.3390/jcm14020303 39860312 PMC11765649 62. Rodgers G.M. Gilreath J.A. Reply to: Concerns on Potential Risk of Roxadustat in Promoting Tumor Progression: Double-Edged Sword of Hypoxia-Inducible Factor-1α Activation J. Clin. Oncol. 2025 43 1267 1268 10.1200/JCO-24-02610 39805072 63. Signore P. Guo G. Wei Z. Zhang W. Lin A. Balzo U.A. small-molecule inhibitor of hypoxia-inducible factor prolyl hydroxylase improves obesity, nephropathy and cardiomyopathy in obese ZSF1 rats PLoS ONE 2021 16 e0255022 10.1371/journal.pone.0255022 34339435 PMC8328318 64. Barratt J. Dellanna F. Portoles J. Choukroun G. De Nicola L. Young J. Dimković N. Reusch M. Safety of Roxadustat Versus Erythropoiesis-Stimulating Agents in Patients with Anemia of Non-dialysis-Dependent or Incident-to-Dialysis Chronic Kidney Disease: Pooled Analysis of Four Phase 3 Studies Adv. Ther. 2023 40 1546 1559 10.1007/s12325-023-02433-0 36749544 PMC10070224 65. Abdelazeem B. Abbas K.S. Shehata J. El-Shahat N.A. Baral N. Savarapu P. Kunadi A. The efficacy of Roxadustat for the treatment of anemia in dialysis dependent chronic kidney disease patients: An updated systematic review and meta-analysis of randomized clinical trials Ann. Transl. Med. 2021 9 1714 10.21037/atm-21-4357 35071408 PMC8743719 66. Fliser D. Bhandari S. Ortiz A. Santos V. Khalife N. Jiletcovici A. Akizawa T. Roxadustat Efficacy and Safety in Patients Receiving Peritoneal Dialysis: Pooled Analysis of Four Phase 3 Studies J. Clin. Med. 2024 13 6729 10.3390/jcm13226729 39597872 PMC11595076 67. Zhu Y.-Y. Zhang D.-F. Tong X.-W. Zhao W.-M. Shi R. Li X.-L. Wang Z.-J. Wang D.-G. Roxadustat increases markers of calcification in patients with end-stage kidney disease: Prospective cohort study J. Bone. Miner. Res. 2025 40 492 499 10.1093/jbmr/zjaf032 40036574 68. Li Q.-Y. Xiong Q.-W. Yao X. Liu F. Tang X. Fu H. Tong T. Mao J. Peng W.-X. Roxadustat: Do we know all the answers ? Biomol. Biomed. 2023 23 354 363 10.17305/bb.2022.8437 36724056 PMC10171438 69. Del Balzo U. Signore P.E. Walkinshaw G. Seeley T.W. Brenner M.C. Wang Q. Guo G. Arend M.P. Flippin L.A. Chow F.A. Nonclinical Characterization of the Hypoxia-Inducible Factor Prolyl Hydroxylase Inhibitor Roxadustat, a Novel Treatment of Anemia of Chronic Kidney Disease J. Pharmacol. Exp. Ther. 2020 374 342 353 10.1124/jpet.120.265181 32487538 70. Li X. Jiang S. Gu X. Liu X. Shang S. Zhang J. Pang K. Li W. Assessment of the safety of Roxadustat for cardiovascular events in chronic kidney disease-related anemia using meta-analysis and bioinformatics Front. Pharmacol. 2024 15 1380326 10.3389/fphar.2024.1380326 38962312 PMC11220233 71. Dine G. Lamzouri A. Guibert E. Alvarez J.C. Hematological ABP: Interest of New Generation Sequencing Methods (NGS) to Study Suspicious Fluctuations in Erythropoiesis Drug Test. Anal. 2025 17 1768 1771 10.1002/dta.3880 40068857 72. Tyagi J. Kaur M. Moola S. Ramachandran R. Meena P. Bajpai D. Bhaumik S. Hypoxia-Inducible Factor Prolyl Hydroxylase Inhibitors for Anemia in Non-Dialysis Dependent Chronic Kidney Disease: Systematic Review and Meta-Analysis of Randomized Controlled Trials Indian J. Nephrol. 2025 35 217 233 10.25259/ijn_382_23 40060082 PMC11883308 73. Cheng Y. Yang Q. Feng B. Yang X. Jin H. Roxadustat regulates the cell cycle and inhibits proliferation of mesangial cells via the hypoxia-inducible factor-1α/P53/P21 pathway Front. Cell Dev. Biol. 2025 13 1503477 10.3389/fcell.2025.1503477 40040789 PMC11876171 74. Maidana D. Arroyo-Álvarez A. Barreres-Martín G. Arenas-Loriente A. Cepas-Guillen P. Garofo R.T.B. Caravaca-Pérez P. Bonanad C. Targeting Inflammation and Iron Deficiency in Heart Failure: A Focus on Older Adults Biomedicines 2025 13 462 10.3390/biomedicines13020462 40002874 PMC11853203 75. Huang Y. Jiang X. Shu G. Li H. Lin J. Duan Q. Cao X. Cheng M. Zheng Z. The efficacy and safety of low-dose roxadustat in combination with recombinant human erythropoietin for treating hemodialysis patients with moderate anemia: A retrospective cohort study Clin. Nephrol. 2025 103 172 183 10.5414/CN111433 39635729 76. Geng Y. Zhang S. Cao Z. Tang J. Cui H. The Efficacy and Safety of Roxadustat for Anemia in Hemodialysis Patients with Chronic Kidney Disease: A Meta-Analysis of Randomized Controlled Trials Toxics 2024 12 846 10.3390/toxics12120846 39771061 PMC11679264 77. Lu C.-M. Hsu Y.-H. Lin I.-H. Kuo K.-L. Liao J.-F. Huang H.-F. Lu P.-H. Conventional and complementary alternative medicine therapies for renal anemia: A literature review Front. Endocrinol. 2025 15 1342873 10.3389/fendo.2024.1342873 PMC11797209 39911241 78. Tsuruya K. Sugamori H. Tanaka Y. Wakasugi N. Ito Y. Real-world safety and effectiveness of Roxadustat in patients with anemia of chronic kidney disease: Interim results from a post-marketing surveillance study in Japan Expert Opin. Pharmacother. 2025 26 503 517 10.1080/14656566.2025.2462181 39899733 79. Chen Q. Liu X. Wang J. Yang M. Fan Q.L. EPO-Mimetic Peptide Pegmolesatide Therapy for Pure Red Cell Aplasia in a Patient with Non-dialysis-dependent Type 1 Diabetic Nephropathy: A Case Report Kidney Med. 2024 7 100947 10.1016/j.xkme.2024.100947 39882157 PMC11774825 80. Hashimoto M. Nagayama Y. Iida A.I. Inoue T. Roxadustat-Induced Central Hypothyroidism Masked by Uremia at the Initiation of Hemodialysis: A Case Report Cureus 2024 16 e76499 10.7759/cureus.76499 39872568 PMC11770393 81. Jain S. Patil R. Sharma S. Bioanalysis, Analysis, Chemistry, and Pharmacological Aspects of Hypoxia-Inducible Factor Prolyl Hydroxylase Inhibitors Curr. Top. Med. Chem. 2025 25 1451 1466 10.2174/0115680266324419241227102847 39791153 82. Glaspy J. Gabrail N.Y. Locantore-Ford P. Lee T. Modelska K. Samal V. Henry D.H. Open-label, Phase 2 study of roxadustat for the treatment of anemia in patients receiving chemotherapy for non-myeloid malignancies Am. J. Hem. 2023 98 703 711 10.1002/ajh.26865 36710399 83. Fan L. Cao L. Luo Y. Gao F. Roxadustat combined with immunosuppressants for treatment of pure red cell aplasia with kidney injury Ann. Hematol. 2024 103 5925 5927 10.1007/s00277-024-06053-8 39463184 84. Meng X. Asadi-Asadabad S. Cao S. Song R. Lin Z. Safhi M. Qin Y. Tactoum E.T. Taudte V. Ekici A. Metabolic rewiring controlled by HIF-1α tunes IgA-producing B-cell differentiation and intestinal inflammation Cell Mol. Immunol. 2025 22 54 67 10.1038/s41423-024-01233-y 39543372 PMC11686098 85. Kawase K. Hamamoto S. Unno R. Taguchi K. Okada A. Prolyl hydroxylase domain inhibitors prevent kidney crystal formation by suppressing inflammation Urolithiasis 2024 53 16 10.1007/s00240-024-01677-x 39724472 86. Hauge J.W. Wærp C.M. Hofsø D. Abedini S. Central hypothyroidism caused by Roxadustat Tidsskr. Nor. Laegeforen. 2024 144 10.4045/tidsskr.24.0319 39692666 87. Qiao R. Cui X. Hu Y. Wei H. Xu H. Zhang C. Du C. Chang J. Li Y. Ming W. Hypoxia Reduces Mouse Urine Output via HIF1α-Mediated Upregulation of Renal AQP1 Kidney Dis. 2024 10 504 518 10.1159/000542087 39664329 PMC11631171 88. Ma J. Hu Y. Dong S. Meng J. Wang Z. Ouyang J. Lin Z. Cheng X. Chen Z. Wu R. Therapeutic potential of roxadustat in immune thrombocytopenia: A Mendelian randomization analysis Blood 2024 144 5415 10.1182/blood-2024-199439 39756656 89. Liu D. Gu D. Deng B. Chen D. Yu P. Deng S. Pharmacological Evaluation of a First-in-Class Hemoglobin Elevating Agent (HbEA) AND017 in Sprague Dawley Rats Blood 2024 144 5220 10.1182/blood-2024-199949 90. Singh A. Uzun G. Bakchoul T. Primary Immune Thrombocytopenia: Novel Insights into Pathophysiology and Disease Management J. Clin. Med. 2021 10 789 10.3390/jcm10040789 33669423 PMC7920457 91. Ma X. Pai P. Zhu W. Chen X. Cui L. Positive response of a hemodialysis patient with pure red cell aplasia on recombinant human erythropoietin therapy to cyclosporine and Roxadustat CEN Case Rep. 2024 13 445 449 10.1007/s13730-024-00865-3 38528249 PMC11608189 92. Hou Y.-P. Mao X.-Y. Wang C. Xu Z.-H. Bu Z.-H. Xu M. Li B. Roxadustat treatment for anemia in peritoneal dialysis patients: A randomized controlled trial J. Form. Med. Ass. 2022 121 529 538 10.1016/j.jfma.2021.06.004 34167878 93. Ito H. Araki R. Mori T. Inoue H. Matsumoto S. Antoku S. Yamasaki T. Togane M. Relationship Between the Effect of Roxadustat and Comorbid Diabetes in Non-dialyzed Chronic Kidney Disease Patients: A Retrospective Observational Study Cureus 2023 15 e39543 10.7759/cureus.39543 37378104 PMC10290911 94. Sung P.-H. Yue Y. Chen Y.-L. Chiang J.Y. Cheng B.-C. Yang C.-C. Chai H.-T. Yip H.-K. Combined dapagliflozin and roxadustat effectively protected heart and kidney against cardiorenal syndrome-induced damage in rodent through activation of cell stress-Nfr2/ARE signalings and stabilizing HIF-1α Biomed. Pharmacother. 2024 180 117567 10.1016/j.biopha.2024.117567 39423754 95. Aburahess S. Li L. Hussain A. Obeidat M. Alavi P. Azad A.K. Jahroudi N. Ballermann B.J. Hypoxia-induced TIMAP Upregulation in Endothelial Cells and TIMAP-dependent Tumour Angiogenesis Am. J. Physiol. Cell Physiol. 2024 327 C1359 C1372 10.1152/ajpcell.00054.2024 39344413 96. Shen Z.-W. Yang X.-Y. Han L. Xie J. Liu X.-Q. Mao J.-H. Dai H.-R. Kong W.-W. Wu X.-Y. Qiu Y.-Q. Optimizing the dosing regimen of roxadustat in kidney transplant recipients with early post-transplant anemia J. Pharm. Sci. 2024 113 3344 3353 10.1016/j.xphs.2024.09.004 39251067 97. Raguraman V. Mohiyuddin S. Benge C. Banker L. Plank T. Hammer R.D. Palaniyandi S. Hildebrandt G.C. Stabilization of HIF-1? By the Prolyl Hydroxylase Inhibitor Roxadustat Reduces Gastrointestinal Graft-Versus-Host Disease Blood 2024 144 262 10.1182/blood-2024-204027 98. Zhao X. Gao Z. Luo Y. Co-Catalyzed Suzuki-Miyaura Coupling of Organoboronic Acids and Alkynyl Chlorides Using Potassium Bicarbonate as Base Org. Lett. 2024 26 9717 9721 10.1021/acs.orglett.4c03417 39497651 99. Jiao K. Zhang H. Li B. Wang Y. Liu J. Roxadustat protects oxidative stress and tissue injury in the brain induced by ischemic stroke via the HIF-1α/NRF2 axis J. Neurosurg. Sci. 2024 68 714 717 10.23736/S0390-5616.24.06329-X 39465675 100. Virtanen N. Saarela U. Karpale M. Arffman R.K. Mäkelä K.A. Herzig K.-H. Koivunen P. Piltonen T. Roxadustat alleviates metabolic traits in letrozole-induced PCOS mice Biochem. Pharmacol. 2024 229 116522 10.1016/j.bcp.2024.116522 39245394 101. Mäkinen S. Sree S. Nisula T.A. Kultalahti H. Activation of the hypoxia-inducible factor pathway by roxadustat improves glucose metabolism in human primary myotubes from men Diabetologia 2024 67 1943 1954 10.1007/s00125-024-06185-6 38814443 PMC11410918 102. Otsuka E. Kitamura M. Funakoshi S. Mukae H. Nishino T. Roxadustat has risks of reversible central hypothyroidism in patients undergoing hemodialysis: A single-center retrospective cohort study Ren. Fail. 2024 46 2410375 10.1080/0886022X.2024.2410375 39378117 PMC11463015 103. Sobolevsky T. Fedoruk M. Dellanna F. Geyer H. Ahrens B. Thevis M. Long-Term Excretion of Roxadustat in Urine Drug Test. Anal. 2024 17 1088 1092 10.1002/dta.3813 39350653 104. Haase V.H. Hypoxia-inducible factor-prolyl hydroxylase inhibitors in the treatment of anemia of chronic kidney disease Kidney Int. Suppl. 2021 11 8 25 10.1016/j.kisu.2020.12.002 PMC7983025 33777492 105. Chambers J.C. Zhang W. Li Y. Sehmi J. Wass M.N. Zabaneh D. Hoggart C. Bayele H. McCarthy M.I. Peltonen L. Genome-wide association study identifies variants in TMPRSS6 associated with hemoglobin levels Nat. Genet. 2009 41 1170 1172 10.1038/ng.462 19820698 PMC3178047 106. Beall C.M. Cavalleri G.L. Deng L. Elston R.C. Gao Y. Knight J. Li C. Li J.C. Liang Y. McCormack M. Natural selection on EPAS1 (HIF-2α) associated with low hemoglobin concentration in Tibetan highlanders Proc. Natl. Acad. Sci. USA 2010 107 11459 11464 10.1073/pnas.1002443107 20534544 PMC2895075 107. Atkinson M.A. Xiao R. Köttgen A. Wühl E. Wong C.S. Wuttke M. Bayazit A.K. Çalişkan S. Warady B.A. Schaefer F. Genetic associations of hemoglobin in children with chronic kidney disease in the PediGFR Consortium Pediatr. Res. 2019 85 324 328 10.1038/s41390-018-0148-z 30140068 PMC6377354 108. Ren S. Zhao Y. Wu J. Ren S. Feng Y. Hypoxia-inducible factor–prolyl hydroxylase inhibitors for treatment of anemia in CKD: A systematic review and network meta-analysis Front. Pharmacol. 2024 15 1406588 10.3389/fphar.2024.1406588 39050745 PMC11267515 109. Sackeyfio A. Lopes R.D. Kovesdy C.P. Cases A. A Mallett S. Ballew N. Keeley T.J. Garcia-Horton V. Ayyagari R. Camejo R.R. Comparison of outcomes on HIF-PHIs in anaemia of CKD: Network meta-analysis in dialysis and non-dialysis populations Clin. Kidney J. 2024 17 sfad298 10.1093/ckj/sfad298 38250252 PMC10799328 110. Singh A.K. Carroll K. McMurray J.J. Solomon S. Jha V. Johansen K.L. Lopes R.D. Macdougall I.C. Obrador G.T. Waikar S.S. Daprodustat for anemia in patients not undergoing dialysis N. Engl. J. Med. 2021 385 2313 2324 10.1056/NEJMoa2113380 34739196 111. Singh A.K. Carroll K. Perkovic V. Solomon S. Jha V. Johansen K.L. Lopes R.D. Macdougall I.C. Obrador G.T. Waikar S.S. Daprodustat for anemia in patients undergoing dialysis N. Engl. J. Med. 2021 385 2325 2335 10.1056/NEJMoa2113379 34739194 Figure 1 Structure of ROX [ 27 Figure 2 Synthetic pathway for the preparation of ROX [ 28 Figure 3 Synthetic pathway for the preparation of the key intermediate in the synthesis of ROX, 2-acetyl-4-phenoxy benzoic acid [ 28 Figure 4 Synthetic pathway of ROX starting from phthalic anhydride derivatives [ 29 Figure 5 The protonation of ROX [ 30 Figure 6 Chemical structures of ROX and PI [ 31 Figure 7 ROX metabolite structures detected in equine urine after a single oral dose [ 37 Figure 8 Biotransformation map of roxadustat (ROX) integrating Phase I and Phase II steps with enzyme-class annotations and anti-doping implications [ 38 cimb-47-00734-t001_Table 1 Table 1 Identification elements of ROX recorded by EMA [ 26 Identification Element Details Registered Product Code (EMA) EMEA/H/C/004871 [ 16 Active pharmaceutical ingredient Roxadustat Global non-exclusive name Roxadustat Therapeutic uses Anemia, nephrological chronic diseases ATC Code (anatomical therapeutic chemical)—classification of the drug according to the system/organ targeted by the therapeutic intake and chemical and pharmacological performances [ 26 B03XA05 Additional monitoring Drug under monitoring process cimb-47-00734-t002_Table 2 Table 2 pH and pKa values of ROX in different pH ranges [ 30 Parameter Value at 25 °C Value at 37 °C Method pKa1 4.33 (09) 4.25 (09) Potentiometric pKa2 6.57 (11) 6.49 (10) Potentiometric pKa3 8.88 (05) 8.80 (06) Potentiometric pKa4 9.03 (04) 9.00 (05) Potentiometric pKa1 (UV-metric) 3.60 (04)  Spectrophotometric (SQUAD84, REACTLAB) pKa2 (UV-metric) 5.62 (14)  Spectrophotometric (SQUAD84, REACTLAB) pKa3 (UV-metric) 7.66 (16)  Spectrophotometric (SQUAD84, REACTLAB) pKa4 (UV-metric) 9.08 (02)  Spectrophotometric (SQUAD84, REACTLAB) ΔH 0 Endothermic   ΔG 0 Positive   ΔS 0 Negative   Identified protonated species LH 4 + 3 2 − 3 − LH 4 + 3 2 − 3 −  cimb-47-00734-t003_Table 3 Table 3 Equipment used for detection of ROX’s main metabolites [ 37 Analysis Equipment and Materials LC UltiMate 3000 UPLC+ (Dionex, Sunnyvale, CA, USA) LC Reversed-phase HPLC column: C18, 4.5 × 150 mm LC Eluents: A—5 mM ammonium acetate, 0.2% formic acid aqueous solution; MS Dionex UltiMate 3000 UHPLC+; QExactive high-resolution accurate mass spectrometer MS 70,000 resolutions; mass range m z MS Capillary voltage—4000 V; capillary temperature—320 °C cimb-47-00734-t004_Table 4 Table 4 Retention times (RTs) of ROXs’ identified metabolites in equine urine following oral administration [ 37 Analyte Formula RT [min] ROX C 19 17 2 5 11.04 M1 C 19 17 2 6 8.82 M2 C 19 16 2 6 7.53 M3 C 19 16 2 6 9.82 M4 C 17 13 4 8.03 M5 C 17 14 2 3 11.05 M6 C 16 13 2 11.82 M7 C 17 13 5 10.99 M8 C 25 24 2 11 7.56 M9 C 25 24 2 12 7.15 M10 C 23 21 10 8.38 M11 C 19 16 2 9 7.74 M12 C 17 13 8 7.33 M13 C 17 14 2 7 8.34 cimb-47-00734-t005_Table 5 Table 5 LC-MS parameters of ROX [ 45 Name Roxadustat Formula C19H16N2O5 Polarity + m z 353.113 RT (min.) 6.3 Manufacturer MCE cimb-47-00734-t006_Table 6 Table 6 Major applications of roxadustat (ROX): evidence level, mechanisms, and risk–benefit overview. Application/Context Evidence Level Key Mechanisms/Targets Reported Benefits (Signal/Outcomes) Noted Risks/Limitations Risk–Benefit Summary Evidence Gaps/Next Steps Ref. Calcium/Vitamin D axis (FGF23) Clinical/observational in ESKD ↑ FGF23; SPP24 changes Links to mineral metabolism markers Possible calcification risk in ESKD Uncertain; monitor minerals Mechanistic and outcome studies [ 67 68 Iron deficiency/inflammation Translational/ HIF activation despite cytokines; ↓ hepcidin; iron mobilization Maintains Hb increase in inflammatory milieu Benefit depends on iron stores; risk of functional iron deficiency Potentially favorable with iron monitoring Prospective, trials stratified by CRP/hepcidin [ 68 69 70 71 72 PCOS (metabolic) Preclinical (letrozole mice) HIF-mediated metabolic re-programming Improved metabolic profile (models) No human validation Unknown; exploratory Translational metabolic studies [ 72 HF with anemia/inflammation Hypothesis/limited clinical HIF-mediated iron handling; anti-inflammatory effects Potential improvement in iron indices/Hb Cardiovascular safety needs careful monitoring Equivocal; requires targeted trials HF-specific RCTs with iron/hepcidin strata [ 73 74 CKD anemia (erythropoiesis) Phase 3 RCTs /pooled analyses HIF-PHD inhibition → HIF-1/2α stabilization; ↑ EPO; ↓ hepcidin; ↑ DMT1/ferroportin ↑ Hb; ESA noninferiority; reduced IV iron use in some settings GI events, hypertension, hyperkalemia; thyroid function changes in dialysis subsets Favorable in indicated CKD populations with monitoring Head-to-head long-term CV outcomes by phenotype; thyroid signal characterization [ 1 2 51 63 64 65 71 74 75 76 77 Diabetic kidney disease (early) Preclinical/cellular HIF-1α–p53/p21 modulation; anti-proliferative in mesangial cells Nephroprotective signals (preclinical) Clinical translation unproven Uncertain; hypothesis-generating Early-phase trials with renal endpoints [ 62 73 78 Hemodialysis–thyroid axis Observational/case reports Central hypothyroidism; THR-β modulation Reversible TSH/TRH changes reported Potential endocrine signal Caution; monitor thyroid Prospective thyroid function monitoring [ 79 80 Chemotherapy Induced Anemia Clinical-Phase 2 RCTs HIF pathway activation Increased Hb levels, reduced transfusion needs Short-term study, with potential side effects and no control group Increases Hb, reduces transfusions, evidence is limited by small design Larger, long-term, randomized trials needed to confirm safety, efficacy and optimal dosing in diverse patients [ 81 Pure red cell aplasia (PRCA) Case series/clinical use Endogenous EPO stimulation Restoration of Hb with immunosuppression Heterogeneous etiologies; small N Cautiously favorable in select cases Registries/prospective cohorts [ 82 Intestinal inflammation Preclinical, mouse models and B cells in vitro HIF-1α regulates B cell metabolism and acetyl-CoA- dependent epigenetic changes to improve IgA class switching and to reduce intestinal inflammation Enhanced IgA production, reduced severity of intestinal inflammation (DSS-induced colitis) Human relevance is untested Enhanced IgA production, reduced intestinal inflammation, effects in humans remain uncertain Need for validation in human studies [ 83 Kidney stone disease Preclinical (models of Ca-oxalate) ↓ CCL2, TNF, ADGRE1 (anti-inflammatory) ↓ Crystal deposition; renal protection in models Human data lacking Unknown; preclinical only Pilot clinical feasibility [ 84 85 Water balance/edema Preclinical HIF-dependent; AQP1 regulation in proximal tubule Mechanistic rationale for diuresis modulation No clinical outcome data Unknown; mechanistic only Human biomarker studies [ 86 Immune thrombocytopenia (ITP) Case/early clinical signals HIF-1α immunomodulation; Hb elevation Hb increase in ITP setting Limited sample sizes; mechanism indirect Unclear; adjunctive role at most Controlled trials [ 87 88 89 Hemodialysis due to PRCA Case series/clinical use Endogenous EPO stimulation PRCA treatment showed a positive response to rhEPO, cyclosporine and ROX Single patient case report, diagnostic uncertainty Effective PRCA treatment in one patient, potential therapy risks Requires larger studies, long-term outcomes and improved diagnostic for PRCA [ 82 90 Peritoneal dialysis (PD) anemia Phase 3 pooled analyses EPO/HIF axis activation Noninferior to ESA; safe in PD cohorts Class-typical AEs; PD-specific data still limited Favorable with standard monitoring Longer follow-up in PD [ 65 91 Non-dialyzed patients with or without diabetes Retrospective observational study HIF pathway activation Improved Hb, no difference in adverse effects between diabetic and non-diabetic patients Small retrospective study, limited follow up Effective in anemia treatment with dose-dependent risks Larger, prospective, multicenter trials [ 92 Cardiorenal combo (with dapagliflozin) Preclinical (CRS models) PI3K/AKT/mTOR; ERK; JNK/p38 activation Heart–kidney protection signals (models) No human data Unknown; preclinical synergy Phase 1/2 PK-PD and safety [ 93 Tumor angiogenesis (TIMAP/SMAD) Preclinical ↑ TIMAP via SMAD1/5/8 inhibition Pro-angiogenic effects (context-specific) Oncologic risk concern in tumors Potential risk in active malignancy Tumor-context contraindication guidance [ 20 21 94 Post-transplant anemia Clinical study, level 2b HIF pathway activation Increased Hb, improved iron utilization, potential to reduce ESA use Limited sample, population specific Effective in anemia correction, improved iron metabolism, good short-term tolerability Need larger, long term-studies, ESA comparison to confirm safety, efficacy and optimal dosing [ 95 GI GvHD/barrier protection Preclinical (transplant models) ↓ IFN-γ, TNF-α; epithelial protection Reduced early gut injury (models) Clinical translation pending Unknown; promising preclinical Early clinical trials [ 22 82 96 97 Ischemic stroke/oxidative stress Preclinical HIF-1/NRF2 antioxidant activation Neuroprotection; ↓ ROS in models Timing/ Unknown; time-sensitive Phase 1 neuroprotection studies [ 49 93 98 Polycystic Ovary Syndrome Preclinical, mouse models of PCOS HIF pathway activation Improved glucose tolerance, improved insulin sensitivity, adipose tissue function Preclinical setting, lack of human outcomes Significant metabolic effects in PCOS mice Human translation, long-term safety, reproductive outcomes remain the main evidence gaps [ 99 Diabetes/skeletal muscle Preclinical (human myotubes) ↑ Glycolysis; ↓ mitochondrial respiration; ↑ glycogen synthesis Improved insulin-stimulated glycogen synthesis (ex vivo) In vivo human effect unknown Unknown; mechanism-oriented Physiology studies in T2D [ 72 73 100 Reversible central hypothyroidism Clinical study, Level 3 Suppresses pituitary TSH production, leading to central hypothyroidism Reversibility of thyroid dysfunction Reversible central hypothyroidism, lack of clinical symptom data Effective anemia treatment in hemodialysis patients, clinicians must monitor thyroid function due to the risk of potential central hypothyroidism More robust, long-term studies [ 101 Anti-doping (detection) Analytical validation/case report Long-window urinary detection; metabolite panels Detection at sub-pg/mL for extended periods; ABP integration Not a therapeutic application N/A (forensic context) Harmonize target metabolites and cut-offs [ 19 45 70 102 Abbreviations: CKD, chronic kidney disease; PD, peritoneal dialysis; ESA, erythropoiesis-stimulating agent; HF, heart failure; GvHD, graft-versus-host disease; ITP, immune thrombocytopenia; PCOS, polycystic ovary syndrome. Note: Evidence level follows hierarchy: Phase 3 RCTs > pooled/observational > translational/mechanistic > preclinical. Risk–benefit summaries are qualitative and should be interpreted within labeled indications and patient-specific factors. Symbols: ↑: increased, elevated, upregulated; ↓: decreased, reduced, downregulated. ",
  "metadata": {
    "Title of this paper": "Daprodustat for anemia in patients undergoing dialysis",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468147/"
  }
}