{
  "title": "Paper_865",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472188 PMC12472188.1 12472188 12472188 41011701 10.3390/molecules30183809 molecules-30-03809 1 Article Premna puberula Wang Zhichao Methodology Software Investigation Data curation Writing – original draft 1 Zhang Yanmei Methodology Investigation Data curation 2 Huang Yun Software 2 https://orcid.org/0009-0000-0595-4856 Xiao Qiang Supervision Funding acquisition 3 Zhu Yuchang Conceptualization Writing – review & editing Supervision Project administration Funding acquisition 1 3 * Zhou Dazhai Conceptualization Writing – review & editing Supervision 2 3 * Pinheiro Ferreira Paulo Michel Academic Editor Vieira-Júnior Gerardo Magela Academic Editor 1 202330402@hbmzu.edu.cn 2 18845569341@163.com 202430445@hbmzu.edu.cn 3 1992022@hbmzu.edu.cn * 2006025@hbmzu.edu.cn 2001033@hbmzu.edu.cn 19 9 2025 9 2025 30 18 496804 3809 04 8 2025 11 9 2025 17 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The prevalence of Ulcerative Colitis (UC) is continuously increasing globally, demanding the urgent search for new treatment agents due to the limitations of existing therapies. Premna puberula Premna puberula ulcerative colitis Premna puberula UPLC-MS/MS intestinal flora-metabolism axis alpha-linolenic acid metabolism National Natural Science Foundation of China No. 31260057 Hubei Key Laboratory of Biologic Resources Protection and Utilization KYPT012303 This work was supported by the National Natural Science Foundation of China (No. 31260057) and Hubei Key Laboratory of Biologic Resources Protection and Utilization. (KYPT012303). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Ulcerative colitis (UC), a chronic and non-specific form of inflammatory bowel disease (IBD), predominantly affects young adults between the ages of 20 and 40, with similar incidence rates observed in both males and females. It is characterized by recurrent episodes of diarrhea, muco-purulent bloody stools, and abdominal pain. The pathogenesis of UC involves a multifactorial interplay of genetic predisposition, immune system dysregulation, and alterations in gut microbiota, environmental factors, and other contributing mechanisms, all of which culminate in a disruption of intestinal mucosal immune homeostasis [ 1 2 Premna puberula 3 Caralluma edulis 4 Mimosa pudica 5 6 p In summary, PP, a traditional dietary plant with abundant bioactive components, is expected to provide new solutions for treating UC. Afterwards, we determined the composition of PPEAC using UPLC-MS/MS. Dextran sulfate sodium salt (DSS) was employed as an inducer to establish a UC mouse model. By comparing the disease activity index (DAI), changes in organs, tissue oxidation levels, and changes in serum levels of inflammatory factors across group, we analyzed the intestinal flora-metabolite interactions in conjunction with serum metabolomics and 16S rRNA sequencing. We aim to investigate the therapeutic effect of PPEAC on UC mice and reveal its anti-UC mechanism, thereby providing a scientific basis for the development and utilization of PP in medicine. 2. Results 2.1. Identification of the Principal Components of PPEAC PPEAC’s metabolomics were examined using LC-MS/MS without a target. The results showed that 3416 metabolites were measured, with 1679 in POS and 1737 in NEG. The total ion chromatogram (TIC) is shown in Figures S1 and S2 2.2. Therapeutic Effects of PPEAC in Mice 2.2.1. Effect of PPEAC on DAI in Mice The DAI can accurately indicate the severity of UC in mice [ 7 Figure 1 p 2.2.2. Effects of PPEAC on the Liver, Spleen, and Colon of Mice Figure 1 p p Figure 1 p p Figure 1 p 2.2.3. Effect of PPEAC on the Level of Oxidative Stress in Mouse Colon Tissues Superoxide Dismutase (SOD), an antioxidant enzyme that protects cells from oxidative damage by catalyzing the dismutation of superoxide radicals into oxygen and hydrogen peroxide. Figure 2 p p Figure 2 p p p 2.2.4. H&E Staining Results Histopathologic damage to colonic tissue was examined using H&E staining. Figure 3 2.3. PPEAC Regulates Intestinal Flora in Mice 2.3.1. Alpha Diversity and Beta Diversity of Mouse Intestinal Flora Alpha diversity represents the richness and evenness of a single sample, commonly assessed with the Shannon, ACE, and Chao1 indices [ 8 Figure 4 p Beta diversity was used as an important evaluation method for assessing the similarity of the flora among the groups, and the obtained results were plotted as a Wayne diagram by cluster analysis ( Figure 4 PCoA allowed for a better demonstration of the disparities in flora structure between the groups. Figure 4 2.3.2. Composition and Abundance of Mouse Intestinal Flora Bacteroidota, Firmicutes, unexplained Bacteria, Proteobacteria, Deferribacteres, Actinobacteria, Ac-tinobacteriota, Cyanobacteria, Verrucomicrobiota, and Fusobacteriota were the phyla ( Figure 5 LEfSe analysis ( Figure 5 2.4. Metabolomic Analysis of PPEAC on Mouse Serum The intrinsic clustering relationship of the samples in each group can be detected by PCA [ 9 Figure 6 10 Figure 6 y p 11 Figure 6 Figure 6 A total of 248 differential metabolites were identified in the PPEAC-H and MC groups, and evaluating the differences between these two groups may provide a better understanding of the processes by which PPEAC regulates serum metabolism. These 248 differential metabolites were mapped to 134 pathways, and the right panel demonstrated the top 20 pathways ( Figure 6 p p 2.5. Effect of PPEAC on Inflammatory Factors in Mouse Serum Serum inflammatory factors, including IL-1β, IL-6, and TNF-α, can cause cellular inflammation and infiltrate intestinal tissues, leading to damage and high levels. This cascade exacerbates UC damage in mice. Immune cells create IL-1β, which encourages the development of additional inflammatory factors [ 12 Figure 7 p 13 Figure 7 p p Figure 7 p 2.6. Correlation Analysis of Differential Metabolites with Key Strains of Bacteria Spearman correlation coefficients were employed to further elucidate the therapeutic role of PPEAC, and 21 differential metabolites from serum metabolomics of the MC and PPEAC groups were selected for correlation analysis with the top 10 most abundant species identified in gut flora sequencing. The results of this analysis are presented as corplot plots and clustered heat maps ( Figure 8 p p p p Tables S1 and S2 3. Discussion PP is primarily distributed in Southwest China and is recognized as a characteristic resource plant with both edible and medicinal properties [ 3 6 In this study, we looked at the therapeutic effects of PPEAC on UC. In a DSS-induced colitis mouse model, we administered three dosages of PPEAC: 125 mg/kg, 250 mg/kg, and 500 mg/kg. To assess the therapeutic efficiency of PPEAC on UC, we evaluated various reliable indicators typically used in colitis research, such as the DAI score, liver ratio, spleen ratio, colon length, and colon oxidative stress. A higher DAI score suggests a more serious UC condition [ 7 14 15 16 17 18 Due to the absence of a stable self-equilibrating mechanism in the blood, the concentrations of small-molecule chemicals in the serum exhibit fluctuations within a specific range. These fluctuations reflect the underlying disease processes and external disturbances affecting the organism [ 19 20 21 22 Gut microbiota are key biomarkers and regulators in the pathogenesis of intestinal diseases [ 23 p 2 p To evaluate the relationship between differential metabolites and the dominant flora in the intestinal flora, we correlated 21 differential metabolites enriched in alpha-linoleic acid metabolism in two groups of sera with the top ten species in relative abundance. Eight of these compounds had high correlations with 2 species. MW0057219, MW0056887, and MW0012968 showed significant positive correlation with species. All three compounds are phosphatidylcholine (PC), which belongs to glycerophospholipids (GP). Phosphatidylcholine (PC) is a significant component of cell membranes with amphipathic molecular properties essential for maintaining the integrity and hydrophobicity of the mucosal barrier [ 24 25 26 ASV-1 is classified as Firmicutes. Firmicutes are greatly reduced during the active phase of the disease and recover following remission [ 27 28 29 30 29 Although this experiment demonstrated promising therapeutic effects in DSS-induced acute UC mice, its efficacy has not yet been confirmed in chronic or spontaneous UC models. Microbiome and metabolomics analyses remain correlative, lacking functional validation of key strains via transplantation studies. Future work should therefore elucidate the strain–metabolite–target axis. However, before considering any human application, further studies must be conducted, including pharmacokinetic research and large-animal toxicity assessments. Toxicity information on the extract is indispensable for any future clinical translation. Prior to the first human trial, the No Observed Adverse Effect Level (NOAEL) must be determined for the most sensitive animal species based on GLP toxicology studies. This NOAEL should be converted to a human equivalent dose (HED) based on body surface area, incorporating pharmacokinetic data. Subsequently, an appropriate safety factor should be selected based on factors such as the mechanism of toxicity, target organs, and monitorability, to estimate the Maximum Recommended Starting Dose (MRSD). Therefore, in future experiments, PPEAC’s specialized preclinical safety protocol will be prioritized (acute and subchronic toxicity studies). 4. Materials and Methods 4.1. Materials PP was collected from wild populations in Lichuan City, Hubei Province, and has been cultivated for several years at the experimental farm of Hubei Xiongzhan Agricultural Co., Ltd. (Lichuan, China). Its identity was verified morphologically by Prof. Yi Yongmei (College of Forestry and Horticulture, Hubei Minzu University, China). The chemicals and reagents utilized in the investigation were analytically pure. 4.2. Preparation of PPEAC Freshly harvested PP leaves were cleaned and dried at 55 °C in a blast drying oven before being pulverized and sieved through a 60-mesh sieve to produce PP leaf powder. A specific weight of PP powder was measured, and an ultrasonic extraction was performed at 200 W with a material-to-liquid ratio of 1:40 g/mL, using 77% ethanol as the solvent. The extraction was carried out for 15 min at room temperature. After the resultant alcoholic extracts were concentrated, the extract was dissolved by adding distilled water at a material-to-liquid ratio of 1:10 g/mL. The mixture was then extracted with an equal volume of ethyl acetate and freeze-dried to obtain the PPEAC solid. 4.3. Metabolomic Analysis of PPEAC Building on the modified methodology from Ye et al. [ 31 Tables S3 and S4 4.4. Experimental Design 4.4.1. Modeling Methods for UC Mice The experimental animals were C57BL/6 mice (male, 7 weeks old, body weight 20 ± 2 g, Liaoning Changsheng Biotechnology Co., Shenyang, China). After one week of acclimatization and feeding in a sterile environment with a temperature of 22–25 °C, a relative humidity of 60–70%, and a 12 h light/dark cycle, the animals were randomly assigned into six groups: Normal Control (NC), Model Control (MC), and Positive Control (PC) groups received 125 mg/kg 5-ASA, PPEAC-L (125 mg/kg), PPEAC-M (250 mg/kg), and PPEAC-H (500 mg/kg), with 10 mice per group. All groups, except the NC group, were administered a 3% DSS solution ad libitum for 7 days [ 32 4.4.2. Measurement of DAI in Mice The DAI is calculated by adding the scores for weight loss, fecal characterization, and fecal occult blood [ 33 Table 1 4.4.3. Determination of Liver and Spleen Ratio and Colon Length in Mice The mice were weighed once before execution and recorded. After the mice were put to death, their livers, spleens, and colons were removed, weighed, and recorded sequentially, The following formulas were then used to determine the liver index and spleen index: liver ratio = liver weight/body weight; spleen ratio = spleen weight/body weight [ 34 4.4.4. Measurement of Oxidative Stress Levels in Mice Colons The kit was purchased from Shanghai Jining Shiye Co., Ltd. (Shanghai, China) The specific measurement method is as follows: The method for determining SOD enzyme activity involves weighing approximately 0.1 g of tissue, adding 1 mL of extraction solution, and homogenizing on an ice bath. Centrifuge at 8000× g The method for determining MDA content is as follows: Weigh approximately 0.1 g of tissue, add 1 mL of extraction solution, and homogenize on an ice bath. Centrifuge at 8000× g g 4.4.5. Hematoxylin & Eosin (H&E) Stain The colon was preserved with a 4% neutral paraformaldehyde solution, embedded in paraffin, and sectioned at 5 μm. The sections were stained with hematoxylin and eosin, and the histological changes in the colon were examined under a microscope. 4.5. Intestinal Flora Studies in Mice The intestinal flora was sequenced using the previously established research method with modifications [ 35 4.6. Serum Metabolomics Studies In light of a prior investigation with specific alterations, the process involved removing samples from the −80 °C storage unit and allowing them to thaw on ice until they were completely free of ice crystals. Following the thawing, the samples were vortexed and mixed for 10 s, after which 50 μL of each sample was transferred into appropriately labeled centrifuge tubes. Subsequently, 300 μL of a 20% acetone-triple-methanol internal standard extract was incorporated, and vortexing was conducted for 3 min. The mixture was then centrifuged at 12,000 rpm for 10 min at a temperature of 4 °C. Post-centrifugation, 200 μL of the supernatant was carefully pi-petted into another appropriately labeled centrifuge tube and allowed to stand for 30 min at −20 °C. The subsequent step involved another centrifugation for 10 min at 4 °C and a final centrifugation at 12,000 rpm for 10 min. Eventually, 200 μL of the supernatant was transferred into a tube designated for the corresponding UPLC-MS/MS analysis. The UPLC-MS/MS conditions were shown in Tables S5 and S6 4.7. Measurement of Serum Inflammatory Factor Levels in Mice Following the successful establishment of the DSS-induced mouse model, blood was taken from the mice’s orbital venous plexus and allowed to stand for 24 h. The serum was then isolated and kept at −80 °C. Serum levels of inflammatory cytokines IL-1β, IL-6, and TNF-α were measured using enzyme-linked immunosorbent assay (ELISA). 4.8. Data Processing The data was analyzed using SPSS 26.0 statistical software, and the significance of differences was determined using one-way ANOVA. Results were given as “mean ± standard error” for significant differences ( p p https://cloud.metware.cn/ 5. Conclusions The results demonstrated that PPEAC exhibited favorable therapeutic effects on UC. PPEAC could reduce Disease Activity Index (DAI) scores, and the liver and spleen ratios, attenuate colonic shortening and pathological damage, and reduce oxidative damage. Furthermore, we found that PPEAC also can reduce the inflammatory factors in serum. Manifesting as a dose dependent response across all measured indicators. Serum metabolomics research has found that it was observed to regulate the alpha-linolenic acid metabolism pathway, thereby contributing to the therapeutic management of UC. The results of the joint gut microbiota analysis indicate: PPEAC was discovered to improve the intestinal environment of mice by raising the quantity of PC-like compounds and boosting the abundance of beneficial bacteria, such as Firmicutes and Muribaculaceae. This study offers new insights for treating UC, and establishes a solid foundation for the use of PP in the treatment of UC. Acknowledgments We thank the funders for their support. Thanks to Wuhan Metavir Biotechnology Co., Ltd. for providing gut flora sequencing service. Thanks to Hubei Key Laboratory of Biologic Resources Protection and Utilization for providing the experimental site. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/molecules30183809/s1 Author Contributions Conceptualization, Y.Z. (Yuchang Zhu) and D.Z.; Data curation, Z.W. and Y.Z. (Yanmei Zhang); Funding acquisition, Q.X. and Y.Z. (Yuchang Zhu); Investigation, Z.W. and Y.Z. (Yanmei Zhang); Methodology, Z.W. and Y.Z. (Yanmei Zhang); Project administration, Y.Z. (Yuchang Zhu); Software, Z.W. and Y.H.; Supervision, Q.X., Y.Z. (Yuchang Zhu) and D.Z.; Writing—original draft, Z.W.; Writing—review and editing, Y.Z. (Yuchang Zhu) and D.Z. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Institutional Review Board of Hubei Minzu University (Approval Code:2023084; Approval Date: 25 December 2023). Informed Consent Statement Not applicable. Data Availability Statement The data presented in this study are available on request from the corresponding author due to privacy restrictions. Conflicts of Interest The authors declare no conflicts of interest. References 1. Feuerstein J.D. Moss A.C. Farraye F.A. Ulcerative Colitis Mayo Clin. Proc. 2019 94 1357 1373 10.1016/j.mayocp.2019.01.018 31272578 2. Xu C.-T. Meng S.-Y. Pan B.-R. Drug Therapy for Ulcerative Colitis World J. Gastroenterol. 2004 10 2311 2317 10.3748/wjg.v10.i16.2311 15285010 PMC4576279 3. Yang N. Jia X. Yang Y. Niu J. Wu X. Ding F. Tian M. Tang D. Premna puberula Arab. J. Chem. 2024 17 105409 10.1016/j.arabjc.2023.105409 4. Khan M. Manzoor Z. Rafiq M. Munawar S.H. Waqas M.Y. Majeed H. Ali Shah S.Z. Hussain R. Hussain H.I. Tahir T. Phytochemical Screening, Anti-Inflammatory, and Antidiabetic Activities of Different Extracts from Caralluma Edulis Plant Molecules 2022 27 5346 10.3390/molecules27165346 36014583 PMC9412639 5. Garnevi Fávero A. Cordeiro T.S. Silva K.N. Cardili L. Silva M.J.D. Paiotti A.P.R. P055 Effect of Mimosa Caesalpiniifolia Extract on DSS-Induced Colitis in Wistar Rats J. Crohn’s Colitis 2020 14 S161 S162 10.1093/ecco-jcc/jjz203.184 6. Liu K. Guo Y. Chen X. Duan J. Li B. Liu M. Chen L. Li M. Feng Y. Li H. Quality Control, Preparation Process Optimizing and Anti-Inflammatory Effects of Premna puberula Heliyon 2022 8 e11082 10.1016/j.heliyon.2022.e11082 36281378 PMC9587327 7. Chesnel L. Acton S. P080 ADS024 Attenuates Weight Loss and Decreases Disease Activity in DSS-Induced Colitis J. Crohn’s Colitis 2022 16 i181 10.1093/ecco-jcc/jjab232.209 8. Zhou T. Liu M. Pan J. Ren J. Tang F. Dai J. Xue F. Ji D. Combined Therapy of Probiotic Microcapsules and Bomidin in Vibrio Parahaemolyticus–Infected Rats Life 2022 12 1740 10.3390/life12111740 36362895 PMC9698507 9. Christou C. Agapiou A. Kokkinofta R. Use of FTIR Spectroscopy and Chemometrics for the Classification of Carobs Origin J. Adv. Res. 2018 10 1 8 10.1016/j.jare.2017.12.001 30046470 PMC6057242 10. Wang L. Qin Y. Wang Y. Zhou Y. Changes of Anthocyanin and Amino Acid Metabolites in Saffron Petals ( Crocus sativus LWT 2024 192 115724 10.1016/j.lwt.2024.115724 11. Liu X. Piao C. Ju M. Zhang J. Zhang W. Cui F. Li G. Cui M. Effects of Low Salt on Lipid Oxidation and Hydrolysis, Fatty Acids Composition and Volatiles Flavor Compounds of Dry-Cured Ham during Ripening LWT 2023 187 115347 10.1016/j.lwt.2023.115347 12. Liso M. Verna G. Cavalcanti E. De Santis S. Armentano R. Tafaro A. Lippolis A. Campiglia P. Gasbarrini A. Mastronardi M. Interleukin 1β Blockade Reduces Intestinal Inflammation in a Murine Model of Tumor Necrosis Factor–Independent Ulcerative Colitis Cell. Mol. Gastroenterol. Hepatol. 2022 14 151 171 10.1016/j.jcmgh.2022.03.003 35314399 PMC9120241 13. Parisinos C.A. Serghiou S. Katsoulis M. George M.J. Patel R.S. Hemingway H. Hingorani A.D. Variation in Interleukin 6 Receptor Gene Associates with Risk of Crohn’s Disease and Ulcerative Colitis Gastroenterology 2018 155 303 306.e2 10.1053/j.gastro.2018.05.022 29775600 PMC6083435 14. Ruan Y. Zhu X. Shen J. Chen H. Zhou G. Mechanism of Nicotiflorin in San-Ye-Qing Rhizome for Anti-Inflammatory Effect in Ulcerative Colitis Phytomedicine 2024 129 155564 10.1016/j.phymed.2024.155564 38554577 15. Lopresti M.W. Cui W. Abernathy B.E. Fredrickson G. Barrow F. Desai A.S. Revelo X.S. Mashek D.G. Hepatic Lysosomal Acid Lipase Overexpression Worsens Hepatic Inflammation in Mice Fed a Western Diet J. Lipid Res. 2021 62 100133 10.1016/j.jlr.2021.100133 34624333 PMC8556525 16. Jing W. Guo X. Qin F. Li Y. Wang G. Bi Y. Jin X. Han L. Dong X. Zhao Y. G-CSF Shifts Erythropoiesis from Bone Marrow into Spleen in the Setting of Systemic Inflammation Life Sci. Alliance 2021 4 e202000737 10.26508/lsa.202000737 33234677 PMC7723243 17. Chen J. Yang C. Xu Y. Zhao Y. Wu J. Liu Y. Chen N. P1204 Oral Streptococcus Mutans Isolates Aggravated Colitis in Mice J. Crohn’s Colitis 2024 18 i2143 i2144 10.1093/ecco-jcc/jjad212.1334 18. Chen S. Wu X. Yu Z. Juglone Suppresses Inflammation and Oxidative Stress in Colitis Mice Front. Immunol. 2021 12 674341 10.3389/fimmu.2021.674341 34421890 PMC8375437 19. Zhang A. Sun H. Wang X. Serum Metabolomics as a Novel Diagnostic Approach for Disease: A Systematic Review Anal. Bioanal. Chem. 2012 404 1239 1245 10.1007/s00216-012-6117-1 22648167 20. Diab J. Hansen T. Goll R. Stenlund H. Jensen E. Moritz T. Florholmen J. Forsdahl G. Mucosal Metabolomic Profiling and Pathway Analysis Reveal the Metabolic Signature of Ulcerative Colitis Metabolites 2019 9 291 10.3390/metabo9120291 31783598 PMC6950742 21. Yang J. Liu S. Zhao Q. Li X. Jiang K. Gut Microbiota-Related Metabolite Alpha-Linolenic Acid Mitigates Intestinal Inflammation Induced by Oral Infection with Toxoplasma Gondii Microbiome 2023 11 273 10.1186/s40168-023-01681-0 38087373 PMC10714487 22. Lee J.-H. Chung K.-S. Shin J.-S. Jung S.-H. Lee S. Lee M.-K. Hong H.-D. Rhee Y.K. Lee K.-T. Anti-Colitic Effect of an Exopolysaccharide Fraction from Pediococcus Pentosaceus KFT-18 on Dextran Sulfate Sodium-Induced Colitis through Suppression of Inflammatory Mediators Polymers 2022 14 3594 10.3390/polym14173594 36080669 PMC9460603 23. Pickard J.M. Zeng M.Y. Caruso R. Núñez G. Gut Microbiota: Role in Pathogen Colonization, Immune Responses, and Inflammatory Disease Immunol. Rev. 2017 279 70 89 10.1111/imr.12567 28856738 PMC5657496 24. Lu M. Qiu Q. Luo X. Liu X. Sun J. Wang C. Lin X. Deng Y. Song Y. Phyto-Phospholipid Complexes (Phytosomes): A Novel Strategy to Improve the Bioavailability of Active Constituents Asian J. Pharm. Sci. 2019 14 265 274 10.1016/j.ajps.2018.05.011 32104457 PMC7032241 25. Chen M. Huang H. Zhou P. Zhang J. Dai Y. Yang D. Fan X. Pan H. Oral Phosphatidylcholine Improves Intestinal Barrier Function in Drug-Induced Liver Injury in Rats Gastroenterol. Res. Pract. 2019 2019 8723460 10.1155/2019/8723460 31565053 PMC6745161 26. Stremmel W. Staffer S. Gehrke S. The Detergent Effect of Mesalazine Interferes with Phosphatidylcholine Binding to Mucin 2 Inflamm. Intest. Dis. 2018 3 107 115 10.1159/000493347 30820432 PMC6390417 27. Sokol H. Seksik P. Furet J.P. Firmesse O. Nion-Larmurier I. Beaugerie L. Cosnes J. Corthier G. Marteau P. Doré J. Low Counts of Faecalibacterium Prausnitzii in Colitis Microbiota Inflamm. Bowel Dis. 2009 15 1183 1189 10.1002/ibd.20903 19235886 28. Huang C. Mei Q. Lou L. Huang Z. Fu Y. Fan J. Wang J. Yin N. Zheng Y. Lu Y. Ulcerative Colitis in Response to Fecal Microbiota Transplantation via Modulation of Gut Microbiota and Th17/Treg Cell Balance Cells 2022 11 1851 10.3390/cells11111851 35681546 PMC9180439 29. Zhu Y. Chen B. Zhang X. Akbar M.T. Wu T. Zhang Y. Zhi L. Shen Q. Exploration of the Muribaculaceae Family in the Gut Microbiota: Diversity, Metabolism, and Function Nutrients 2024 16 2660 10.3390/nu16162660 39203797 PMC11356848 30. Liu J. Zhang Q. Hao H. Bi J. Hou H. Zhang G. Benzyl Isothiocyanate and Resveratrol Synergistically Alleviate Dextran Sulfate Sodium-Induced Colitis in Mice Foods 2024 13 2078 10.3390/foods13132078 38998586 PMC11241443 31. Ye X. Cen Y. Wu K. Xu L. Ni J. Zheng W. Liu W. Gas-Mediated Intestinal Microbiome Regulation Prompts the Methanol Extract of Schizonepetae Spica to Relieve Colitis Nutrients 2023 15 519 10.3390/nu15030519 36771228 PMC9921049 32. Wang S.-T. Wang Y.-Y. Huang J.-R. Shu Y.-B. He K. Shi Z. THZ2 Ameliorates Mouse Colitis and Colitis-Associated Colorectal Cancer Biomedicines 2024 12 679 10.3390/biomedicines12030679 38540292 PMC10967821 33. Guo H.-X. Ji Z.-H. Wang B.-B. Ren J.-W. Gao W. Yuan B. Walnut Peptide Ameliorates DSS-Induced Colitis in Mice by Inhibiting Inflammation and Modulating Gut Microbiota J. Funct. Foods 2024 119 106344 10.1016/j.jff.2024.106344 34. Liu Y. Huang W. Dai K. Liu N. Wang J. Lu X. Ma J. Zhang M. Xu M. Long X. Inflammatory Response of Gut, Spleen, and Liver in Mice Induced by Orally Administered Porphyromonas Gingivalis J. Oral Microbiol. 2022 14 2088936 10.1080/20002297.2022.2088936 35756539 PMC9225697 35. Li S. Wang Y. Dun W. Han W. Ning T. Sun Q. Wang Z. Effect of Polysaccharide Extracted from Gynostemma Pentaphyllum on the Body Weight and Gut Microbiota of Mice Front. Nutr. 2022 9 916425 10.3389/fnut.2022.916425 35719169 PMC9199513 Figure 1 Indicators associated with colitis in mice. ( a b c d p Figure 2 Indicators associated with colitis in mice. ( a b p Figure 3 Photographs of H&E staining of mouse colon tissues (200×). ( a b Figure 4 Intestinal flora of NC, MC, PC and PPEAC-H mouse. ( a b c Figure 5 Intestinal flora of NC, MC, PC and PPEAC-H mouse. ( a b c Figure 6 Serum metabolome analysis in mice. ( a b c d e f g Figure 7 Inflammatory Factors in Mouse Serum. ( a b c p Figure 8 Correlation analysis. (Red means positive correlation, blue means negative correlation, the finer the correlation the greater the absolute value, the darker the color also means the greater the absolute value of the correlation. *: p p a b molecules-30-03809-t001_Table 1 Table 1 DAI Scoring Criteria. Index Weight Loss/% Fecal Trait Fecal Blood 0 0% Normal Negative 1 1–5% Loose and tangible Weak positive 2 5–10% Loose Positive 3 10–15% Very loose; damp Strong positive 4 >15% Loose stools Bloody stool ",
  "metadata": {
    "Title of this paper": "Effect of Polysaccharide Extracted from Gynostemma Pentaphyllum on the Body Weight and Gut Microbiota of Mice",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472188/"
  }
}