{
  "title": "Paper_240",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12486685 PMC12486685.1 12486685 12486685 41040766 10.7759/cureus.93507 1 Integrative/Complementary Medicine Effectiveness of Cucumis sativus L. Supplementation on Mild to Moderate Joint Pain: A Randomized, Double-Blind, Placebo-Controlled Study Muacevic Alexander Adler John R Hausenblas Heather 1 Hooper David 1 Hooper Stephanie 2  1  2 Heather Hausenblas hhausen@ju.edu 29 9 2025 9 2025 17 9 495976 e93507 31 12 2024 29 09 2025 02 10 2025 03 10 2025 Copyright © 2025, Hausenblas et al. 2025 Hausenblas et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/325815-effectiveness-of-cucumis-sativus-l-supplementation-on-mild-to-moderate-joint-pain-a-randomized-double-blind-placebo-controlled-study Background: Joint pain affects millions worldwide, impairing mobility and quality of life, and is a focus in management and therapy. Preliminary research found that the cucumber extract Cucumis sativus L. Objective: This study aimed to examine the effectiveness of a standardized powder (>1% idoBR1) of Cucumis sativus L. TM Methods: In this Consolidated Standards of Reporting Trials (CONSORT)-compliant, double-blind, placebo-controlled trial, 80 adults (mean age = 50.10) were randomized to either the Cucumis sativus L. Results: Improvements in all the pain outcomes over time for the CG were evidenced, with larger improvements in the CG compared to PG for the WOMAC, Brief Pain Inventory, and Pain Disability Index. Significant improvements in the WOMAC for the CG were evidenced on day 30 and day 60. From baseline to day 60, the CG showed individual percent changes of 31.79%, 10.07%, and 32.39% for the WOMAC, Lequesne Functional Index, and Pain Disability Index, while the PG experienced declines of 14.30%, 9.56%, and 14.96%, respectively, for the same measures. Conclusion: Cucumis sativus L. cucumis sativus l dietary supplement joint pain medicinal herbs mood Gateway Health provided partial financial support for this study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Chronic inflammation is a common cause of joint pain, a widespread condition that affects millions of adults. In the United States, approximately one-third of adults report experiencing joint pain, with its prevalence increasing with age and exceeding 50% in older populations [ 1 2 5 Recommended treatments for joint pain include exercise, supplements, physiotherapy, and pharmacological options such as nonsteroidal anti-inflammatory drugs (NSAIDs) and acetaminophen [ 4 5 6 Consequently, the use of nutritional supplements and functional foods for joint pain management has increased, with about 50% of individuals with knee osteoarthritis reporting the use of these therapies [ 7 11 9 13 13 In particular, Cucumis sativus L. Cucurbitaceae 14 17 Cucumis sativus L. TM 18 19 TM 20 21 Cucumis sativus L. The purpose of this study was to conduct an eight-week randomized, double-blind, placebo-controlled trial to examine the effectiveness of daily use of an aqueous extract of cucumber ( Cucumis sativus L. TM Materials and methods Study design The trial was conducted and reported in accordance with the Consolidated Standards of Reporting Trials (CONSORT) guidelines to ensure transparency and completeness in reporting randomized controlled trials [ 22 ClinicalTrials.gov https://clinicaltrials.gov/study/NCT06246383 Cucumis sativus L. Cucumis sativus L. 18 19 Participants Participants were 81 healthy adults (men = 27 and women = 54, mean age = 50.1) with mild to moderate joint pain. Inclusion criteria Adults aged 30 to 70 years with a self-reported history of joint pain lasting more than three months in the knees, hips, ankles, shoulders, or hands were selected, as they represent a population most likely to benefit from a dietary supplement aimed at relieving joint pain [ 4 4 Exclusion criteria Individuals meeting any of the following criteria were excluded from participation: (1) serious medical conditions (e.g., cancer, severe rheumatoid arthritis, recent heart attack or stroke, congestive heart failure, kidney disease, or other conditions that could hinder study participation); (2) taking other medications (e.g., arthritis medications or other anti-inflammatory drugs) or supplements for joint pain during the previous month; (3) recent stressful events within four weeks of baseline; (4) regular use of NSAIDs during the previous two weeks of baseline; (5) inability to walk for at least 6 minutes at a moderate-to-brisk pace; (6) current hormone therapy; (7) high alcohol consumption (i.e., more than 14 standard drinks per week for men or seven for women, or binge drinking within the past three months); (8) use of cigarettes or tobacco products within the past month; (9) high caffeine intake over the last month (exceeding 400 mg per day); (10) pregnancy, attempts at conception, or breastfeeding; and (11) people determined to be incompatible with the study protocol. Procedures Following preliminary screening, eligible participants provided Institutional Review Board-approved informed consent (Sterling IRB: 11651) prior to enrollment. Participants completed self-report questionnaires that had been psychometrically validated on day 0 (Pre), day 15, day 30, and day 60. Additionally, participants maintained a daily diary to document adherence and adverse events. The self-report surveys were completed via a secured SurveyMonkey (San Mateo, CA) link sent through email or text message. The survey took about 25 minutes to complete at each assessment. The primary outcome was a reduction in joint pain (i.e., WOMAC). The secondary outcomes were the severity of pain and its impact on functioning (i.e., Lequesne Functional Index and Brief Pain Inventory), the impact of pain on a person's ability to participate in everyday activities (i.e., Pain Disability Index), and adverse events. Participants were instructed to maintain their usual lifestyle habits and avoid introducing new exercise routines, dietary changes, or health interventions during the study. This information was self-reported. Data collection occurred from May 2024 to August 2024 and was securely stored electronically. No modifications were made to the trial outcomes after the study began; all primary and secondary outcomes were pre-specified in the trial protocol and remained unchanged throughout. Paracetamol (acetaminophen, as found in Tylenol) was permitted as a rescue medication for pain relief during the study, with its usage carefully recorded [ 23 25 Intervention A randomized, double-blind, placebo-controlled trial design was employed. Participants were randomly assigned to either the Cucumis sativus L. Cucumis sativus L. https://www.ghainc.com Adverse events The supplement was well-tolerated, with no adverse event reported. Blinding To ensure that all subjects and researchers were unaware of the treatment assignments, Gateway Health Alliances labeled the supplement/placebo bottles as either A or B. The supplement and placebo pills were identical in color, odor, and size. The research team remained blinded to the contents of the bottles until the conclusion of the study. Immediately following the last assessment, the research team was unblinded. Subsequently, participants were unblinded and informed of their assigned condition. Supplement information and adherence Participants were instructed to take the capsules approximately 30 minutes prior to nighttime sleep. Adherence was tracked through a daily questionnaire that inquired about supplement intake. To enhance compliance, participants received daily text message reminders to take the supplement as directed. Adherence Out of 81 participants who enrolled and provided consent, 80 completed the trial, representing an adherence rate of 98.7%. This rate included one dropout from the PG who was lost to follow-up (i.e., a person failed to complete surveys) (Table 1 1 Table 1 Demographic data for the Cucumis sativus L. group and the placebo group. Demographic variable  Cucumis sativus L. Placebo group (N = 38) Age 50.10 (7.0) 50.20 (8.8) Body mass index 27 (5.1) 26 (4.1) Number (%), female 28, 66.7% 26, 60.5% Ethnicity (number, %)   White/Caucasian 38, 90% 36, 84% Asian 1, 2% 4, 9% Hispanic 2, 5% 2, 5% Black/African American 1, 2% 1, 2% Native Hawaiian or Pacific Islander 50.1 (7.0) 50.2 (8.8) Figure 1 CONSORT participant flowchart. CONSORT: Consolidated Standards of Reporting Trials. Statistical analysis Prior to analysis, data for the outcomes were examined for normality using the Shapiro-Wilk test. For variables that showed a significant deviation from normality (p < 0.05), log10-transformed was used to reduce skewness and meet the assumptions of normality required for parametric testing. Transformed values were then used in the analyses. Results are presented using the transformed values, but back-transformed values are shown in figures and tables for interpretability. Continuous data were presented as mean (SD) and analyzed using 2 (group) x 3 (time: day 15, day 30, and day 60) repeated measures analysis of covariance (ANCOVA), with baseline values as the covariate. Post hoc tests were paired-sample t-tests where applicable. Individual percentage changes were calculated to individually capture the true variability in response across the cohort. Percent changes were calculated to represent the overall relative difference from baseline to day 60. Statistical analyses were performed using Excel (Microsoft Corporation, Redmond, WA) and SPSS version 28. Measures Lequesne Functional Index The Lequesne Functional Index is a validated tool designed to assess the severity and impact of osteoarthritis on the hips or knees, primarily focusing on pain, walking distance, and activities of daily living. The Lequesne Functional Index is widely utilized in clinical research and practice to assess functional status and pain levels in patients with osteoarthritis. It enables healthcare professionals to track changes in a patient's condition over time. The index comprises multiple items that produce a composite score, representing the patient’s level of disability. Higher scores indicate more severe impairment in joint function and quality of life [ 26 WOMAC The Western Ontario and McMaster Universities Osteoarthritis Index (WOMAC™) is a tri-dimensional self-administered questionnaire to assess joint pain (five items), stiffness (two items), and physical function (16 items). The Likert version was used in this study, with five response levels for each item, representing different degrees of intensity (none, mild, moderate, severe, or extreme) that were scored from 0 to 4. Scores for the WOMAC were determined by adding item scores within each index (pain, stiffness, and function) [ 27 Brief Pain Inventory The Brief Pain Inventory is a well-established pain assessment questionnaire that has been widely utilized in both clinical and research settings to comprehensively evaluate the severity and impact of pain on daily functioning. This instrument comprises a set of questions that inquire about various aspects of pain experience, including its location, intensity, interference with activities, and the efficacy of treatments in alleviating pain. The Pain Severity Subscale consists of the following four questions that ask the patient to rate their pain: worst pain in the past 24 hours, least pain in the past 24 hours, average pain over the past 24 hours, and pain right now (current pain). The Pain Interference Score subscale consists of the following seven questions that assess how pain interferes with different aspects of the patient’s life: general activity, mood, walking ability, normal work (includes housework and job), relationships with other people, sleep, and enjoyment of life [ 28 Pain Disability Index The Pain Disability Index is a self-report tool used to evaluate the impact of pain on an individual's ability to perform daily activities and its overall effect on quality of life. Participants rate the degree to which pain limits their functional abilities, providing insight into the broader consequences of pain beyond its intensity. This measure is particularly useful for understanding how pain affects various aspects of daily living. Daily Diary The daily diary assessed adverse events and adherence. Results Primary outcome For the WOMAC, a significant main effect for time (F(3,231) = 8.64, p < 0.0001) was evidenced. The main effect for condition (F(1,77) = 3.44, p = 0.06) and the interaction (F(3,231) = 1.89, p = 0.13) approached significance (Table 2 3 Table 2 Individual percentage changes from baseline scores for the Western Ontario and McMaster Universities Osteoarthritis Index (WOMAC), Lequesne Functional Index, Brief Pain Inventory (BPI), and Pain Disability Index for the Cucumis sativus L. group and the placebo group. Lower scores for all the measures indicate an improvement. * denotes a significant difference (p < 0.05) between day 0 and the different time points within the same group. Outcome  Cucumis sativus L. Placebo group (N = 38)  Mean (SD) Mean (SD) Mean (SD) Mean (SD) Mean (SD) Mean (SD) Mean (SD) Mean (SD)  Day 0 Day 15 Day 30 Day 60 Day 0 Day 15 Day 30 Day 60 WOMAC 30.52 (14.70) 25.94 (17.19) 22.96* (14.95) 22.91* (14.66) 19.11 (11.54) 16.18 (12.88) 13.76 (10.75) 14.85 (10.90) BPI: Pain Severity Subscale 3.66 (1.54) 3.17 (1.90) 3.05 (1.59) 3.19 (2.09) 2.50 (1.22) 2.41 (1.51) 1.99 (1.39) 2.16 (1.34) BPI: Pain Interference Subscale 3.26 (2.03) 3.06 (2.14) 2.87 (2.13) 2.64 (2.09) 2.04 (1.81) 1.75 (1.66) 1.61 (1.85) 1.59 (1.64) Lequesne Functional Index 9.13 (4.03) 7.16 (4.34) 7.60 (4.56) 8.37 (5.02) 7.07 (4.05) 7.37 (4.07) 5.87 (4.31) 5.82 (2.84) Pain Disability Index 16.64 (13.50) 13.63 (13.39) 12.19 (12.22) 12.13 (12.81) 9.92 (11.04) 9.16 (11.74) 7.47 (10.43) 7.23 (9.93) Table 3 Percent change (day 0 to day 60) for the Western Ontario and McMaster Universities Osteoarthritis Index (WOMAC), Lequesne Functional Index, Brief Pain Inventory (BPI), and Pain Disability Index outcomes from baseline to day 60 for the Cucumis sativus L. and the placebo control groups. % change from baseline  Cucumis sativus L. Placebo group (N = 38) WOMAC total 31.79% -14.30% Lequesne Functional Index 10.07% -9.56% Pain Disability Index 32.39% -14.96% Brief Pain Inventory: Pain Severity -1.23% 6.75% Brief Pain Inventory: Pain Interference 23.45% 59.92% Secondary outcomes For the Lequesne Functional Index, a significant main effect for time (F(3,231) = 8.11, p < 0.001) was evidenced. The main effect for condition (F(1,77) = 2.28, p = 0.13) and interaction (F(3,231) = 1.87, p = 0.13) was nonsignificant. Post hoc analysis indicated significantly lower scores for the PG compared to the CG at day 60 (p = 0.04). The percent change from baseline to day 60 was 10.07% for the CG compared to a worsening of 9.56% for the PG. For the Pain Disability Index, a significant main effect for time (F(3,231) = 7.88, p = 0.001) was found. The main effect for condition (F(1,77) = 1.08, p = 0.30) and interaction (F(3,231) = 0.68, p = 0.56) was nonsignificant. The individual percentage change from baseline to day 60 was 32.39 for the CG compared to a worsening of 14.96 for the PG. For the Brief Pain Inventory - Pain Severity Subscale, significant main effects for time (F(3,231) = 11.16, p < 0.001) and condition (F(1,77) = 3.51, p = 0.05) were evidenced. Interaction approached significance (F(3,231) = 2.31, p = 0.07). Post hoc analysis indicated significant improvements in pain severity at four weeks for the CG (p < 0.05). For the Pain Interference Score subscale, significant main effects for condition (F(1, 77) = 4.80, p = 0.02), time (F(3,231) = 11.26, p < 0.001), and interaction (F(3,231) = 2.56, p = 0.05) were evidenced. Post hoc analysis revealed greater improvements in the CG compared to the PC over time. Discussion Joint pain, particularly from conditions such as osteoarthritis, significantly impacts the quality of life, reducing mobility, increasing disability risk, and contributing to mental health challenges through chronic pain. Effective management of joint pain is essential for maintaining overall physical and mental well-being, especially as joint issues become more prevalent with age. Previous research has highlighted the anti-inflammatory [ 14 15 16 17 Cucumis sativus L 18 19 In this randomized, double-blind, placebo-controlled trial, eight weeks of supplementation with Cucumis sativus L Cucumis sativus L 17 18 The PG showed minor improvements, possibly due to the placebo effect or natural variability in pain perception, highlighting the importance of controlled, objective measures in assessing intervention effects. Although the placebo group’s results underscore the psychological component of pain management, the greater improvements seen with the Q-actin supplementation group indicate a potential biological benefit from Cucumis sativus L In this study, findings revealed that the CG demonstrated better scores on the Brief Pain Inventory compared to the PG, indicating that the Q-actin supplementation led to an improvement in both pain severity and pain interference scores. This suggests that Cucumis sativus L The generalizability of these findings is promising but somewhat limited by the study’s sample size, homogeneous participant group, and relatively short duration. Expanding future research to include diverse populations and extended intervention periods could improve the significance and applicability of Cucumis sativus L Cucumis sativus L Over-the-counter herbal preparations for treating joint pain have limited data documenting their efficacy or safety [ 8 11 15 17 Cucumis sativus L Herbal supplements are gaining prominence in contemporary healthcare due to their potential to enhance overall health outcomes, reflecting a broader trend toward integrative and complementary medicine [ 27 28 This study has limitations that should be considered. The 60-day duration limits our ability to assess the long-term effects of Cucumis sativus L Cucumis sativus L Conclusions In summary, this study examined the efficacy of Cucumis sativus L Cucumis sativus L Cucumis sativus L Cucumis sativus Disclosures Human subjects: Animal subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: Appendices Questionnaires WOMAC Questionnaire Items 1. Pain subscale (five items): • Pain during walking on a flat surface. • Pain during going up or down stairs. • Pain at night while in bed. • Pain while sitting or lying. • Pain while standing upright. 2. Stiffness subscale (two items): • Stiffness after first waking in the morning. • Stiffness later in the day. 3. Physical function subscale (17 items): • Descending stairs. • Ascending stairs. • Rising from sitting. • Standing. • Bending to the floor. • Walking on a flat surface. • Getting in or out of a car. • Going shopping. • Putting on socks or stockings. • Rising from bed. • Taking off socks or stockings. • Lying in bed. • Getting in or out of the bath. • Sitting. • Getting on or off the toilet. • Heavy domestic duties. • Light domestic duties. Total scoring: Calculate scores for each subscale separately and sum them for a total score. Higher scores indicate worse symptoms. Lequesne Functional Index Lequesne Index Questions and Scoring: 1. Pain or discomfort (five items): • Pain during walking. 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme • Pain while standing. 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme • Pain while sitting or lying. 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme • Pain at night (when in bed). 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme • Morning stiffness lasting less than 30 minutes. 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme 2. Maximum walking distance (one item): • How far can you walk without stopping due to discomfort? 0 = Unlimited 1 = 1 km (about 0.6 miles) 2 = 500 m (about 0.3 miles) 3 = 300 m (about 0.2 miles) 4 = 100 m (about 0.06 miles) 5 = Less than 100 m (or only indoors) 3. Activities of daily living (four items): • Difficulty getting in or out of a car. 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme • Difficulty climbing stairs. 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme • Difficulty squatting or bending to pick something off the floor. 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme • Difficulty performing light domestic tasks (e.g., cleaning and cooking). 0 = None 0.5 = Slight 1 = Moderate 1.5 = Severe 2 = Extreme Total scoring: Add up the scores for all sections. Total score range: 0-24 (higher scores indicate greater severity). Brief Pain Inventory (BPI) 1. Pain severity: Purpose: Measures the intensity of pain. Questions: • Rate your pain at its worst in the last 24 hours. • Rate your pain at its least in the last 24 hours. • Rate your pain on average over the last 24 hours. • Rate your pain right now. Response scale: Numeric Rating Scale (0-10): 0 = No pain 10 = Pain as bad as you can imagine 2. Pain interference: Purpose: Assesses how pain affects different areas of life. Questions: How much has pain interfered with your: • General activity • Mood • Walking ability • Normal work (both outside the home and housework) • Relationships with other people • Sleep • Enjoyment of life Response scale: Numeric Rating Scale (0-10): 0 = Does not interfere 10 = Completely interferes 3. Pain location: Purpose: Identifies the areas where pain is felt. Instructions: Mark the areas where you feel pain on a body diagram. 4. Pain relief: Purpose: Measures the effectiveness of pain relief treatments. Question: • In the past 24 hours, how much relief have pain treatments or medications provided? Response scale: Percentage (0% = No relief, 100% = Complete relief). Pain Disability Index (PDI) The PDI consists of seven domains, each assessing how pain interferes with a specific area of life. Respondents rate the level of disability caused by pain in each domain on a scale of 0 to 10: 0 = No disability 10 = Total disability Domains: • Family/home responsibilities: Includes activities such as chores, home maintenance, and caring for family members. • Recreation: Includes hobbies, sports, and other leisure activities. • Social activity: Includes activities involving friends, social events, and community engagement. • Occupation: Includes paid or unpaid work, school attendance, or other daily work-related responsibilities. • Sexual behavior: Includes the frequency and quality of sexual activity. • Self-care: Includes personal care activities such as bathing, dressing, and grooming. • Life-support activities: Includes essential activities such as eating, sleeping, and breathing. Instructions: Respondents are asked to consider each domain and rate how much their pain has interfered with their ability to perform activities in that area over the past week. The total score is calculated by summing the ratings for all seven domains. References 1 Health, United States, 2011: With Special Feature on Socioeconomic Status and Health National Center for Health Statistics (US) Hyattsville, MD National Center for Health Statistics (US) 2012 https://pubmed.ncbi.nlm.nih.gov/22812021/ 22812021 2 Exercise and dietary weight loss in overweight and obese older adults with knee osteoarthritis: the Arthritis, Diet, and Activity Promotion Trial Arthritis Rheum Messier SP Loeser RF Miller GD 1501 1510 50 2004 https://doi.org/10.1002/art.20256 15146420 10.1002/art.20256 3 Association of weight gain with incident knee pain, stiffness, and functional difficulties: a longitudinal study Arthritis Care Res (Hoboken) Tanamas SK Wluka AE Davies-Tuck M 34 43 65 2013 22674832 10.1002/acr.21745 4 A commercialized dietary supplement alleviates joint pain in community adults: a double-blind, placebo-controlled community trial Nutr J Nieman DC Shanely RA Luo B Dew D Meaney MP Sha W 154 12 2013 24274358 10.1186/1475-2891-12-154 PMC4176106 5 Effectiveness of magnesium supplementation on sleep quality and mood for adults with poor sleep quality: a randomized double-blind placebo-controlled crossover pilot trial Med Res Arch Breus MJ Hooper S Lynch T Hausenblas HA 12 2024 6 Adverse effects of analgesics commonly used by older adults with osteoarthritis: focus on non-opioid and opioid analgesics Am J Geriatr Pharmacother O'Neil CK Hanlon JT Marcum ZA 331 342 10 2012 23036838 10.1016/j.amjopharm.2012.09.004 PMC3529168 7 Use of complementary and alternative medicine among patients with radiographic-confirmed knee osteoarthritis Osteoarthritis Cartilage Lapane KL Sands MR Yang S McAlindon TE Eaton CB 22 28 20 2012 22033041 10.1016/j.joca.2011.10.005 PMC3254852 8 Role of curcumin in the management of pathological pain Phytomedicine Sun J Chen F Braun C 129 140 48 2018 30195871 10.1016/j.phymed.2018.04.045 9 Is there any scientific evidence for the use of glucosamine in the management of human osteoarthritis? Arthritis Res Ther Henrotin Y Mobasheri A Marty M 201 14 2012 22293240 10.1186/ar3657 PMC3392795 10 Effects of glucosamine and chondroitin sulfate on cartilage metabolism in OA: outlook on other nutrient partners especially omega-3 fatty acids Int J Rheumatol Jerosch J 969012 2011 2011 21826146 10.1155/2011/969012 PMC3150191 11 Clinical efficacy and safety of glucosamine, chondroitin sulphate, their combination, celecoxib or placebo taken to treat osteoarthritis of the knee: 2-year results from GAIT Ann Rheum Dis Sawitzke AD Shi H Finco MF 1459 1464 69 2010 20525840 10.1136/ard.2009.120469 PMC3086604 12 Efficacy of Perilla frutescens (L.) Britton var. frutescens extract on mild knee joint pain: a randomized controlled trial Front Pharmacol Kim N Kim SY Kim SW 1114410 14 2023 36998613 10.3389/fphar.2023.1114410 PMC10043449 13 Phellodendron and Citrus extracts benefit joint health in osteoarthritis patients: a pilot, double-blind, placebo-controlled study Nutr J Oben J Enonchong E Kothari S Chambliss W Garrison R Dolnick D 38 8 2009 19682376 10.1186/1475-2891-8-38 PMC2739863 14 Anti-inflammatory and antioxidant activity of Cucumis sativus and Citrus macroptera herbal formulation: an in-vitro study Cureus Amani T Surenthar M Shanmugam R 0 16 2024 10.7759/cureus.51818 PMC10847068 38327926 15 Biological and medicinal application of Cucumis sativus Linn. - review of current status with future possibilities J Complement Integr Med Khan A Mishra A Hasan SM Usmani A Ubaid M Khan N Saidurrahman M 843 854 19 2022 34047145 10.1515/jcim-2020-0240 16 Foods of the Mediterranean diet: citrus, cucumber and grape J Prev Med Hyg Naureen Z Dhuli K Donato K 0 7 63 2022 10.15167/2421-4248/jpmh2022.63.2S3.2743 PMC9710412 36479487 17 Evaluation of the effects of Cucumis sativus seed extract on serum lipids in adult hyperlipidemic patients: a randomized double-blind placebo-controlled clinical trial J Food Sci Soltani R Hashemi M Farazmand A Asghari G Heshmat-Ghahdarijani K Kharazmkia A Ghanadian SM 214 218 82 2017 27886382 10.1111/1750-3841.13569 18 Effectiveness of Cucumis sativus extract versus glucosamine-chondroitin in the management of moderate osteoarthritis: a randomized controlled trial Clin Interv Aging Nash RJ Azantsa BK Sharp H Shanmugham V 2119 2126 13 2018 30498336 10.2147/CIA.S173227 PMC6207263 19 Standardised ido-BR1 cucumber extract improved parameters linked to moderate osteoarthritis in a placebo-controlled study Curr Rheumatol Rev Nash RJ Mafongang A Singh H Singwe-Ngandeu M Penkova YB Kaur T Akbar J 345 351 19 2023 36748212 10.2174/1573397119666230206105703 20 Iminosugar amino acid idoBR1 reduces inflammatory responses in microglia Molecules Olajide OA Iwuanyanwu VU Banjo OW Kato A Penkova YB Fleet GW Nash RJ 3342 27 2022 35630818 10.3390/molecules27103342 PMC9143674 21 Safety assessment of a standardized cucumber extract (Q-Actin™): oral repeat-dose toxicity and mutagenicity studies Toxicol Rep Kothari S Saravana M Muthusamy S Mozingo A Soni M 1078 1086 5 2018 30425929 10.1016/j.toxrep.2018.10.014 PMC6224328 22 CONSORT 2010 statement: updated guidelines for reporting parallel group randomised trials BMJ Schulz KF Altman DG Moher D 0 340 2010 10.4103/0976-500X.72352 PMC3043330 21350618 23 Indexes of severity for osteoarthritis of the hip and knee. Validation--value in comparison with other assessment tests Scand J Rheumatol Suppl Lequesne MG Mery C Samson M Gerard P 85 89 65 1987 3479839 10.3109/03009748709102182 24 Validation study of WOMAC: a health status instrument for measuring clinically important patient relevant outcomes to antirheumatic drug therapy in patients with osteoarthritis of the hip or knee J Rheumatol Bellamy N Buchanan WW Goldsmith CH Campbell J Stitt LW 1833 1840 15 1988 https://pubmed.ncbi.nlm.nih.gov/3068365/ 3068365 25 Pain assessment: global use of the Brief Pain Inventory Ann Acad Med Singap Cleeland CS Ryan KM 129 138 23 1994 https://pubmed.ncbi.nlm.nih.gov/8080219/ 8080219 26 The Pain Disability Index: psychometric properties Pain Tait RC Chibnall JT Krause S 171 182 40 1990 https://pubmed.ncbi.nlm.nih.gov/2308763/ 2308763 10.1016/0304-3959(90)90068-O 27 Clinical implications of herbal supplements in conventional medical practice: a US perspective Cureus Hassen G Belete G Carrera KG 0 14 2022 10.7759/cureus.26893 PMC9375827 35978741 28 Open, observational, single-arm, multicenter study assessing the effectiveness of a dietary supplement containing hydrolyzed collagen, chondroitin sulfate, and glucosamine for osteoarthritis pain reduction J Diet Suppl Puigdellívol Grifell J Comellas Berenguer C Steinbacher G 374 388 21 2024 38180010 10.1080/19390211.2023.2284982 ",
  "metadata": {
    "Title of this paper": "Open, observational, single-arm, multicenter study assessing the effectiveness of a dietary supplement containing hydrolyzed collagen, chondroitin sulfate, and glucosamine for osteoarthritis pain reduction",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486685/"
  }
}