{
  "title": "Paper_525",
  "abstract": "J Orthop J Orthop 2181 jor Journal of Orthopaedics 0972-978X Elsevier PMC11153879 PMC11153879.1 11153879 11153879 38854776 10.1016/j.jor.2024.05.002 S0972-978X(24)00162-4 1 Original article Equivalence in osteoporosis workup and management after femoral neck fracture fixation and vertebral compression fracture cement augmentation: A single-center retrospective study highlighting persistent Underdiagnosis and Undertreatment DeClercq Madeleine Grace BS a b Eberhardt Lauren BS a b Zakko Philip MD a Keeley Jacob MS b Audet Megan MD a Park Daniel MD daniel.park@corewellhealth.org a ⁎ a b ⁎ daniel.park@corewellhealth.org 10 2024 14 5 2024 56 461636 133 140 8 4 2024 2 5 2024 7 5 2024 01 10 2025 01 10 2025 07 06 2024 01 10 2025 © 2024 The Authors 2024 Background The purpose of this study was to evaluate pre- and post-fracture medical management of osteoporosis among patients who underwent surgical fixation of femoral neck fractures (FNF) and vertebral compression fractures (VCF), and to investigate if there is a difference in treatment, management, and subsequent fractures between FNF and VCF patients. Methods Patients who underwent surgical fixation of FNF or VCF were retrospectively reviewed at a minimum 1 year follow up. Patients were excluded if their fracture was caused by high energy trauma or malignancy, <50 years-old, deceased, or lost to follow up. Patient demographics such as age, sex, BMI, American Society of Anesthesiology Physical Status Classification System and Charleston Comorbidity index were recorded. Management of osteoporosis, including medication regimen and dual-energy X-ray absorptiometry (DEXA) scans were assessed preoperatively and at minimum one year follow up. Subsequent fractures were also recorded. Results In the analysis of 370 patients (74.7% FNF, 25.2% VCF), demographics showed a predominantly female population (mean age 78.1). Preoperatively, 21.6% were diagnosed with osteoporosis, consistent between FNF and VCF. Postoperatively, there were no significant differences in new osteoporosis diagnoses, bisphosphonate use, or subsequent fractures. VCF patients, however, were more likely to receive denosumab and post-operative DEXA scans (p < 0.05). Within a year, 6.2% experienced subsequent fractures, with no significant FNF-VCF difference. Only 12.7% received appropriate post-operative osteoporosis treatment, 27.1% had DEXA scans, and 25% had a recorded osteoporosis diagnosis. Multivariable analysis highlighted pre-fracture osteoporosis diagnosis as the sole predictor for post-operative DEXA scans and anti-osteoporotic medication (p < 0.001). Conclusions This study suggests that factors beyond the type of fragility fracture may influence subsequent fracture risk and anti-osteoporotic medication administration in elderly patients. These findings underscore the importance of a comprehensive approach to fracture risk assessment and treatment decisions in this population. Level of evidence III. Keywords Osteoporosis Fragility fracture Femoral neck fractures Vertebral compression fractures pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Equivalence in osteoporosis workup and management after femoral neck fracture fixation and vertebral compression fracture cement augmentation: A single-center retrospective study highlighting persistent Underdiagnosis and Undertreatment",
    "Journal it was published in:": "Journal of Orthopaedics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11153879/"
  }
}