{
  "title": "Paper_1027",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469613 PMC12469613.1 12469613 12469613 41009540 10.3390/ijms26188973 ijms-26-08973 1 Article ReduXis: A Comprehensive Framework for Robust Event-Based Modeling and Profiling of High-Dimensional Biomedical Data https://orcid.org/0009-0000-3221-3156 Sarkar Neel D. 1 https://orcid.org/0000-0003-2603-4930 Tandon Raghav Conceptualization Methodology Software Writing – review & editing 1 2 https://orcid.org/0000-0002-8810-620X Lah James J. Validation Formal analysis Investigation Resources Data curation Writing – review & editing Supervision Project administration Funding acquisition 3 https://orcid.org/0000-0002-5472-6355 Mitchell Cassie S. Conceptualization Methodology Software Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Supervision Project administration Funding acquisition 1 2 * Kloczkowski Andrzej Academic Editor Guo Fei Academic Editor 1 nsarkar7@gatech.edu 2 3 jlah@emory.edu * cassie.mitchell@bme.gatech.edu 15 9 2025 9 2025 26 18 497349 8973 13 7 2025 08 8 2025 09 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Event-based models (EBMs) are powerful tools for inferring probabilistic sequences of\nmonotonic biomarker changes in progressive diseases, but their use is often hindered\nby data quality issues, high dimensionality, and limited interpretability. We introduce\nReduXis, a streamlined pipeline that overcomes these challenges via three key innovations.\nFirst, upon dataset upload, ReduXis performs an automated data readiness assessment—verifying file formats, metadata completeness, column consistency, and measurement\ncompatibility—while flagging preprocessing errors, such as improper scaling, and offering\nactionable feedback. Second, to prevent overfitting in high-dimensional spaces,\nReduXis implements an ensemble voting-based feature selection strategy, combining gradient\nboosting, logistic regression, and random forest classifiers to identify a robust subset of\nbiomarkers. Third, the pipeline generates interpretable outputs—subject-level staging and\nsubtype assignments, comparative biomarker profiles across disease stages, and classification\nperformance visualizations—facilitating transparency and downstream analysis. We\nvalidate ReduXis on three diverse cohorts: the Emory Healthy Brain Study (EHBS) cohort\nof patients with Alzheimer’s disease (AD), a Genomic Data Commons (GDC) cohort of\ntransitional cell carcinoma (TCC) patients, and a GDC cohort of colorectal adenocarcinoma\n(CRAC) patients. event-based modeling biomarker discovery disease progression omics-driven profiling multimodal data integration machine learning artificial intelligence colorectal adenocarcinoma transitional cell carcinoma Alzheimer’s disease National Institute of Health R01AG070937 R35GM152245 U19AG056169 National Science Foundation 1944247 Chan Zuckerberg Initiative 253558 The work was supported by National Institute of Health grants R01AG070937 (J.J.L.) and R35GM152245 (C.S.M.) and subawards from U19AG056169 to J.J.L. and C.S.M. Additional funding was provided by the National Science Foundation award 1944247 (C.S.M.) and the Chan Zuckerberg Initiative grant 253558 (C.S.M.). The funders had no role in the study design, analysis, interpretation, or decision to publish the study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Chronic, progressive diseases—ranging from neurodegenerative disorders such as Alzheimer’s disease (AD), Parkinson’s disease, and frontotemporal dementia to malignancies including breast, colorectal, and lung cancer—represent some of the most formidable challenges in modern medicine. Their burden stems not only from their prevalence and lack of curative therapies but also from their insidious onset, substantial heterogeneity, and complex biological underpinnings. In neurodegenerative diseases, hallmark pathological changes—such as β 1 2 3 4 Although these diseases differ in their underlying pathophysiology, they share a key characteristic: progression is marked by a sequential, often monotonic, accumulation of molecular and cellular alterations. Accurately characterizing the temporal sequence of these biomarker transitions is critical for early detection, prognostic stratification, and the development of stage-specific interventions [ 5 Event-based models (EBMs) address this limitation by providing a probabilistic framework for reconstructing the most likely sequence of biomarker changes from cross-sectional data. These models perform a form of soft clustering, assigning individuals a probabilistic disease stage based on their biomarker profile and the inferred progression sequence. EBMs underpin frameworks such as Subtype and Stage Inference (SuStaIn) [ 6 Recent extensions of EBMs—including variants by Young et al. [ 6 5 Open-source tools such as pySuStaIn [ 7 8 9 10 To overcome these limitations, we introduce ReduXis, a comprehensive, user-friendly EBM pipeline tailored for translational research applications. ReduXis begins with automated data validation, ensuring appropriate formatting, metadata integrity, and preprocessing consistency, and offers immediate feedback to resolve issues prior to analysis. To enhance modeling stability, ReduXis incorporates a robust ensemble-based feature selection strategy, using a majority-voting scheme across gradient boosting, logistic regression, and random forest classifiers [ 7 11 12 By integrating rigorous data readiness assessments, stable feature selection, and transparent reporting into a unified interface, ReduXis offers a practical, reproducible, and interpretable approach to event-based modeling. Unlike prior EBM extensions that emphasize methodological complexity or theoretical performance, ReduXis is designed explicitly for real-world biomedical data — prioritizing robustness, usability, and clarity. This positions it as a valuable tool for researchers aiming to uncover temporal biomarker signatures and heterogeneity in complex, progressive diseases. 2. Results and Discussion ReduXis was designed to enable stage and subtype event-based models (EBMs) to be applied to very large data sets, including high-dimensional omics data, with relative ease and speed. To evaluate the generalizability, interpretability, and robustness of the developed ReduXis pipeline and corresponding Python package, we applied it to three distinct case studies spanning neurodegeneration and oncology. These datasets were selected to represent varying levels of complexity in outcome structure, dimensionality, and the need for subtyping. In contrast to conventional pipelines, which may fail silently or halt on malformed inputs, ReduXis completed all runs without error across at least 12 independent executions per dataset. The high consistency of outputs—including identical event sequences across repeated trials—demonstrates regularity and strong reproducibility, two critical properties for translational biomedical applications. Together, these results strongly support that ReduXis enables robust, generalizable, and interpretable event-based modeling across very large, heterogeneous disease datasets. 2.1. Case Study 1: Colorectal Adenocarcinoma Colorectal adenocarcinoma (CRAC) is the most common histological subtype of colorectal cancer, arising from the epithelial cells lining the colon or rectum. Globally, CRAC ranks as the third to fourth most frequently diagnosed cancer and is a leading cause of cancer-related mortality, with over 900,000 deaths annually [ 13 14 13 To illustrate the utility of ReduXis in this context, we applied it to a publicly available RNA-seq dataset of colorectal adenocarcinoma (CRAC) patients from the Genomic Data Commons, specifically utilizing the TCGA-COAD project. This dataset was selected as a baseline use case due to its binary classification structure (“Normal” vs. “Tumor”) and the absence of confounding molecular subtypes, enabling clearer interpretation of biomarker progression patterns. The original gene expression matrix, comprising approximately 5100 genes, was reduced to 66 high-importance features using our ensemble-based stability selection procedure, as detailed in Section 3 TRIB3 GSN Table A1 As shown in Figure 1 Figure 2 Figure 3 TRIB3 RPN3 GSN KLF4 Figure 2 2.2. Case Study 2: Transitional Cell Carcinoma Bladder cancer is the tenth most common malignancy worldwide, with transitional cell carcinoma (TCC), also called urothelial carcinoma, accounting for approximately 90–95% of cases and contributing to over 200,000 deaths per year in the United States alone [ 15 16 16 Table A3 Figure 4 Figure 5 Figure 6 COL3A1 MXRA8 IDH1 H1-2 Given that the oncogenes COL3A1 MXRA8 IDH1 H1-2 2.3. Case Study 3: Emory Healthy Brain Study The Emory Healthy Brain Study (EHBS) is a racially diverse, longitudinal cohort designed to facilitate biomarker discovery and disease trajectory modeling in Alzheimer’s disease (AD) through multimodal data integration. Participants, aged 50–75 years, were age-matched to individuals with clinically diagnosed AD and assessed via neuropsychological testing, PET imaging, and cerebrospinal fluid (CSF) proteomics [ 17 18 β 42 18 To uncover the biological heterogeneity underlying AD, ReduXis identified three distinct molecular subtypes, consistent with previously reported metabolically rooted variants of AD [ 19 Notably, an intriguing pattern emerged within the inflammatory AD subtype: multiple peptides linked to periodontal disease and oral dysbiosis—particularly those associated with the growth of Porphyromonas gingivalis Table A5 These findings highlight ReduXis’s capacity to deliver temporally nuanced, subtype-aware staging from CSF proteomic data. From capturing global biomarker gradients ( Figure 7 Figure 8 Figure 9 Table A6 χ 2 p < 0.01 9 2.4. Interpretation of Consistency and Reproducibility Across all evaluated datasets, the ReduXis EBM framework demonstrated consistent event sequencing and reproducible biomarker prioritization, underscoring its robustness in heterogeneous clinical and molecular settings. The ensemble-based voting strategy for feature selection resulted in low variance among selected features, with an average pairwise feature overlap exceeding 70%. This high degree of overlap indicates strong convergence across independent cross-validation folds. Subtype and stage assignments remained stable across repeated bootstrapped runs, further supporting the reliability of the model’s classifications. Importantly, the inferred ordering of molecular events exhibited high consistency even under aggressive feature reduction protocols, highlighting the method’s resilience to input dimensionality constraints. As shown in Table 1 K In contrast, higher stability was observed in less complex or more structured datasets. The colorectal cancer dataset (binary classification) achieved an average stability score of 0.615, while the EHBS dataset—which did not require feature selection due to its constrained dimensionality—achieved perfect consistency (stability score = 1.000). Although excluded from feature selection benchmarking, this result further illustrates ReduXis’s robustness in scenarios with minimal variability. Compared with standard pipelines using s-SuStaIn alone [ 8 Runtime Efficiency via Feature Capping: Enhanced Intermediate Transparency: Human-Readable Output: While minor variability was observed in deeply imbalanced classes (e.g., the “Normal” group in colorectal adenocarcinoma or the “Localized” group in transitional cell carcinoma), such variability is expected in small-sample, high-dimensional spaces and reflects real-world data imbalance. ReduXis mitigated these effects using a combination of sample weighting and threshold-based pruning strategies. Specifically, the pruning threshold was defined using a stability score, calculated as the proportion of times a given feature appeared among the top K most important features across 5-fold cross-validation repeated over three classifiers (yielding 15 model evaluations). Features with stability scores below a threshold were excluded. The threshold range of 0 to 1 was empirically selected, consistent with commonly used benchmarks for feature selection stability—where 0 indicates no reproducibility across folds, and 1 reflects ideal consistency across folds. This stability metric parallels the rationale of rank-based measures such as Kendall’s tau, where reduced variation across folds corresponds to increased reliability. Collectively, these results demonstrate that ReduXis maintains strong reproducibility and temporal consistency even in the presence of substantial biological and cohort-level heterogeneity, supporting its use in biomarker discovery and progression modeling across diverse clinical scenarios. 2.5. User Guidance and Built-In Safeguards ReduXis is designed to be accessible to non-expert users. Not only does it incorporate multiple failsafe mechanisms that promote responsible usage and reduce the likelihood of spurious or uninterpretable results, but it also has a user-friendly, interactive command-line interface (CLI), as shown in Figure A1 However, the effective application of this framework still benefits from domain expertise, particularly when choosing the number of stages and subtypes to ensure biologically coherent and interpretable outcomes. To balance flexibility with robustness, ReduXis introduces both “hard” constraints and “soft” defaults that guide user input while aligning with established scientific precedents. More specifically, the framework enforces a maximum of 150 features, five subtypes and six stages, reflecting common boundaries in molecular subtyping literature. Additionally, it sets a soft lower limit of 10 biomarkers per cluster, encouraging stability and biological plausibility in the resulting modules. These design choices are rooted in both empirical studies and widely accepted domain knowledge, ensuring that the model remains both practically usable and biologically grounded. 2.5.1. Maximum Number of Biomarkers ReduXis imposes an empirically derived upper limit of 150 biomarkers to mitigate excessive runtime in its event-based disease progression model. This constraint arises from the model’s reliance on inferring an optimal ordering over M M M N K S I O ( ( I E M + I M C M C ) × N × K × S × M ) + O ( I E M × K × M 2 ) This complexity reflects the standard expectation-maximization (EM) algorithm’s structure: E-step: O ( I E M × N × K × S × M ) M-step: O ( I E M × K × M 2 ) MCMC step: O ( I M C M C × N × K × S × M ) Under the assumptions that I N K ≤ 5 S ≤ 6 M Runtime ≈ O ( M 2 ) Given the steep scaling of runtime with increasing biomarker count—especially due to the internal ordering process—ReduXis enforces a hard cap of 150 biomarkers to ensure computational feasibility in practice. 2.5.2. Maximum Number of Subtypes Well-established subtyping frameworks in oncology and complex diseases rarely exceed five groups. For instance, in breast cancer, intrinsic molecular subtypes such as luminal A, luminal B, HER2 20 21 Interpretation, however, still benefits from domain expertise. For example, Figure A2 Figure 9 2.5.3. Minimum Cluster Size A minimum cluster size of 5, with a default threshold of 10, was chosen to strike a balance between biological plausibility and statistical reliability. Whereas users are welcome to tune the minimum cluster size to something other than 10, it is highly recommended not to tune the cluster size so high as to cause issues with stage sizing, and it is required to keep the cluster size above 5 to ensure adequate modeling complexity. Many molecular pathways involved in disease progression consist of interacting modules of roughly 5–10 genes or proteins. For example: The PI3K/AKT/mTOR pathway in cancer involves six core components [ 22 Wnt signaling, central in development and tumorigenesis, also features clusters of 5–10 interacting biomolecules [ 23 In neurodegenerative diseases, protein-protein interaction subnetworks of 5–8 key molecules often define functional modules [ 24 From a modeling standpoint, setting a lower bound of 5 prevents spurious or noisy clusters from forming, while the default of 10 ensures that the resulting subtypes or clusters are biologically meaningful and statistically robust—particularly critical in high-dimensional omics settings where false discoveries are a known risk. 2.5.4. Maximum Number of Stages Classical staging systems also inform our choice of stage granularity. The AJCC TNM framework stratifies many solid tumors into five clinical stages (0–IV), with occasional A/B subdivisions but rarely exceeding six total categories [ 25 26 2.5.5. Safeguards Against Overparameterization Users must explicitly define the number of subtypes and stages prior to modeling. This is necessary because unsupervised estimation of these parameters is underconstrained in high-dimensional clinical datasets, often resulting in overfitting or biologically implausible solutions. Prior work has emphasized that overparameterization in subtype models can lead to fragmentation and instability, especially when sample sizes are modest [ 2 6 Subtype Sanity Checks: Stage Density Filtering: Format Validation: Section 2 Visual Diagnostics: By anchoring subtype and stage limits in established frameworks and embedding automated checks, ReduXis promotes robust, interpretable disease models. Users should review post hoc assignment distributions—non-uniform, progressively ordered changes across stages and clear subtype differentiation indicate a well-specified model, whereas homogeneous patterns may warrant re-evaluation of feature selection or parameter choices [ 2 6 3. Materials and Methods This section details the case study data sources and the ReduXis design criteria, development, implementation, and evaluation metrics. 3.1. Overview of ReduXis Framework ReduXis builds upon the open-source pySuStaIn [ 6 7 8 As shown in the schematic overview of the ReduXis pipeline in Figure 10 Real-Time Preprocessing Validation: Seamless Integration with Ensemble-Derived Feature Space: Customizable, User-Friendly Outputs: Subject- and Biomarker-Level Subtype/Stage Annotations: Subtype-wise Stage Distribution Plots: Biomarker Heatmaps by Stage and Outcome: 3.2. Data Sources This study incorporates three independent, high-dimensional omics datasets spanning neurodegeneration and oncology. The neurodegenerative cohort derives from the Emory Healthy Brain Study (EHBS), comprising cerebrospinal fluid (CSF) proteomic profiles with associated clinical metadata, previously shown to capture early AD biomarkers [ 18 3.3. Design Criteria The development of ReduXis was guided by a set of pragmatic and principled design criteria aimed at overcoming key limitations in existing event-based modeling frameworks, particularly the pySuStaIn [ 7 8 Rigorous Data Validation: X Y Standardized Preprocessing for EBM Compatibility: Flexibility and Scalability to High-Dimensional Data: Transparent and Interpretable Outputs: User-Centric Interface and Automation: Open-Source and Python-Native Implementation: Collectively, these design criteria reflect a commitment to creating a practical, extensible, and interpretable modeling framework tailored for modern biomedical datasets, while preserving the statistical rigor of event-based disease progression modeling. 3.4. Data Validation and Preprocessing Prior to EBM fitting, ReduXis performs automated validation and preprocessing to ensure data readiness, as shown in Figure 11 The following steps are conducted in order to ensure that the data that is fed into the EBM is valid and cleaned up: File Format Checks: Numeric Enforcement: Schema Enforcement: SubjectID: Outcome: Missingness Filtering: Outlier Capping: 3.5. Feature Selection via Ensemble Dimensionality Reduction High-dimensional omics datasets (often with 1000–10,000 features) pose a significant risk of overfitting and unstable feature selection. To mitigate this, ReduXis employs a supervised ensemble feature selection approach for dimensionality reduction prior to EBM fitting, using a nested cross-validation (CV) framework to prevent data leakage or circularity, as shown in Figure 12 K Moreover, the stability of feature selection is quantified using a custom, easy-to-understand “scoring system” that works like this: Determination of K p K p U max U max K K p Classifier Training and Importance Extraction: Ensemble Importance–Based Filtering: K It has a stability score > 0.5 It appears among the top- N N To elaborate on the three possible scenarios: If more than N K > 0.5 N If fewer than N > 0.5 > 0.5 0.5 If all features have stability scores < 0.5 M M This ensemble voting mechanism ensures that no single classifier’s idiosyncrasies dominate feature selection. Threshold Rationale: f S ( f ) = Number of times f appears in the top - K lists Total possible number of appearances of f in top - K lists → S ( f ) ∈ [ 0 , 1 ] . In our 5-fold cross-validation with three classifiers, each feature can appear at most 15 times among the top K 0.5 Preventing overly aggressive pruning (which can discard genuinely informative features if the threshold is set too high), and Avoiding the unintentional inclusion of features with low reproducibility (which can occur if the threshold is too low). Through this analysis, as shown in Figure A3 Figure A4 0.5 Figure A4 Figure A3 Stability Scoring: f S ( f ) Table 2 After ensemble stability-based voting and filtering, the feature space in bulk RNA-seq datasets is reduced by 99%, greatly improving computational efficiency and convergence during EBM fitting. 3.6. Evaluation Metrics In terms of classification performance, ReduXis evaluates stage- and subtype-prediction accuracy using standard metrics: precision, recall, and F1-score, all computed on the feature-reduced datasets. These results are automatically compiled into a comprehensive classification report. In addition to these conventional metrics, ReduXis also computes an ordinal accuracy score to better reflect performance on classification tasks where class labels are inherently ordered (e.g., disease stages). Unlike standard accuracy, which counts only exact matches as correct, ordinal accuracy penalizes misclassifications based on their distance from the true label. This is achieved using a reward-based scheme defined by a distance-penalty matrix R ∈ R K × K K R ( i , j ) = 1 − | i − j | K − 1 i j Ordinal Accuracy = 1 N ∑ i = 1 K ∑ j = 1 K R ( i , j ) · C ( i , j ) C ( i , j ) i j N In addition, the “stability score”—defined as the average stability of a feature across all three classifiers and 5 folds (see the Feature Selection section)—is included in this report, as detailed in Figure A5 Figure A6 To quantitatively assess the separability of stages across different subtypes and outcomes, ReduXis also computes a χ 2 χ 2 Feature selection consistency is assessed qualitatively through visual inspection of event ordering overlap across bootstrapped runs. In parallel, quantitative evaluation via the stability score measures the consistency of selected biomarkers across folds, classifiers, and random seeds. Despite the probabilistic nature of SuStaIn, ReduXis demonstrates strong repeatability of event sequences, with key disease-specific markers appearing consistently at similar stages across 10 independent runs with fixed hyperparameters. To evaluate end-to-end efficiency, we compared ReduXis to a baseline workflow using standard s-SuStaIn with manual preprocessing. Wall clock time was recorded, encompassing data loading, preprocessing, feature selection, event-based modeling, and output generation, using internal logging tools integrated into ReduXis. In these experiments, both workflows executed successfully. s-SuStaIn typically requires between 5 and 25 min of wall clock time, depending on data complexity and computational power, as shown in Table 3 Table 4 Table 5 3.7. Software Implementation and Availability ReduXis is distributed as a Python 3.12 package with a command-line interface (CLI), leveraging Colorama 0.4, Matplotlib 3.10, Numpy 2.2, Pandas 2.3, Scikit-learn 1.7, Seaborn 0.13, LightGBM 4.6.0, and an extended fork of pySuStaIn [ 6 7 The ReduXis source code, documentation, and example workflows are available in an open-source, public GitHub (v1.0) repository (see Data Availability Statement). Additional materials, including preprocessing scripts and tutorial figures, are included in the same repository and further detailed in the Appendix A 4. Conclusions ReduXis addresses a critical unmet need in biomedical machine learning by delivering an end-to-end, interpretable, and reproducible framework for event-based modeling (EBM). While state-of-the-art tools like pySuStaIn and s-SuStaIn offer flexibility in subtype modeling, they often require expert-level knowledge for post hoc inspection and visualization. In contrast, ReduXis democratizes EBM through a fully integrated pipeline that includes (i) automated preprocessing checks, (ii) ensemble-based feature selection, and (iii) transparent, standardized outputs that are immediately accessible and coding-agnostic. These design choices lower the barrier to entry for computational biologists and translational researchers working with complex, high-dimensional data. Across three domains—neurodegeneration, colorectal cancer, and bladder cancer—ReduXis demonstrated strong reproducibility, temporal consistency, and robustness to class imbalance and cohort-level heterogeneity. Classification efficacy and disease trajectory confidence held across datasets of varying size, signal-to-noise ratio, and feature count, suggesting generalizability to other clinical contexts. However, ReduXis is currently optimized for structured, quantitative omics data; its applicability to sparse, noisy, or categorical datasets remains an area for future validation. 4.1. Data Modality Compatibility ReduXis is designed for quantitative, tabular datasets, particularly those derived from omics platforms such as RNA-seq, methylation arrays, and proteomics. It supports both unimodal and multimodal inputs structured in CSV, TSV, or PSV formats. It is not intended for unstructured or categorical modalities like clinical notes or radiology reports without preprocessing. Future iterations may include wrappers for converting common biomedical formats (e.g., DICOM, MAGE-TAB) into compatible structures. 4.2. Limitations and Future Directions While ReduXis offers high reproducibility and interpretability, some limitations remain. The stability threshold for feature pruning is empirically chosen and may require dataset-specific tuning. Additionally, performance may vary with extremely small sample sizes or highly overlapping disease states, where EBM assumptions are challenged. Future work will address these limitations and expand capabilities in several directions: Domain Expansion: Clinical Integration: Enhanced Multi-omics Support: In summary, ReduXis delivers a scalable, interpretable, and generalizable approach to temporal biomarker discovery. By bridging computational rigor with usability, it lays the groundwork for broader adoption of EBMs in both research and clinical pipelines. Acknowledgments The authors would like to thank Jiajia Xie for providing technical support regarding the conceptualization and helping understand the mathematical modeling of ReduXis. Additionally, we would like to thank all research participants of the EHBS study who generously provided data and biospecimens for this work. The authors acknowledge the efforts of staff who support the EHBS project and the Emory Cognitive Neurology Clinic without whom this work could not have been conducted. Staff and investigators in the Emory Healthy Aging Study and Emory Healthy Brain Study can be found at the following: https://healthyaging.emory.edu/team/study-staff/ https://healthyaging.emory.edu/team/leadership/ Disclaimer/Publisher’s Note: Author Contributions Conceptualization, N.D.S., R.T. and C.S.M.; Methodology, N.D.S., R.T. and C.S.M.; Software, N.D.S. and R.T.; Validation, N.D.S., J.J.L. and C.S.M.; Formal analysis, N.D.S.; Investigation, N.D.S. and C.S.M.; Resources, J.J.L. and C.S.M.; Data curation, N.D.S. and J.J.L.; Writing-original draft preparation, N.D.S. and C.S.M.; Writing-review and editing, N.D.S., R.T., J.J.L. and C.S.M.; Visualization, N.D.S.; Supervision, C.S.M.; Project administration, C.S.M.; Funding acquisition, J.J.L. and C.S.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The Emory Healthy Brain Study (EHBS) protocol was approved by the Institutional Review Board of Emory University (IRB00080300; approval date: 5 September 2023). Informed Consent Statement All participants for the Emory Healthy Brain Study (EHBS) provided consent according to the Declaration of Helsinki. Data Availability Statement Bulk RNA-seq cancer datasets, both of which are open access, were accessed from projects derived from The Cancer Genome Atlas (TCGA). For colorectal adenocarcinoma data, open-access data were obtained from the TCGA-COAD project, and for transitional cell carcinoma, from the TCGA-BLCA project. All datasets were accessed through the Genomic Data Commons (GDC) Data Portal https://portal.gdc.cancer.gov https://github.com/pathology-dynamics/ReduXis Appendix A Conflicts of Interest The authors declare that there are no conflicts of interest. Appendix A This appendix presents Figures and tables that provide additional insights and support for the findings discussed in the main text. Figure A1 ReduXis welcome screen and dashboard overview. Figure A2 Granularity of event-based models upon excessive inferred stages and subtypes. Figure 9 Figure A3 Determination of the optimal stability threshold for feature retention. Δ y Figure A4 Quasi-sensitivity–specificity analysis for stability threshold validation. Figure A3 Figure A5 Automated classification report for the TCGA transitional cell carcinoma dataset. Figure A6 Normalized confusion matrix for the TCGA transitional cell carcinoma dataset. Figure A4 ijms-26-08973-t0A1_Table A1 Table A1 Functional interpretation of top-ranked biomarkers selected by ReduXis in colorectal adenocarcinoma (CRAC). RPN2 KLF4 TRIB3 GSN Gene Functional Role Mechanistic Relevance in CRAC  TRIB3 Scaffold pseudokinase; modulates AKT/mTOR pathway Upregulated in CRAC; promotes tumor growth by enhancing β 28  RPN2 N-linked glycosylation; ER stress mediator Acts as a proto-oncogene. Stabilizes glycosylated survival proteins and enhances chemoresistance (e.g., to oxaliplatin) by maintaining ER homeostasis [ 29  GSN Actin-severing protein; cytoskeletal regulation Functions as a tumor suppressor. Downregulated in CRAC; inhibits invasion and proliferation via actin remodeling and STAT3 pathway suppression [ 30  KLF4 Zinc-finger transcription factor; cell cycle arrest and differentiation Tumor suppressor role. Downregulation is associated with poor survival and advanced grade; regulates p21 and p53-dependent DNA damage response [ 31 ijms-26-08973-t0A2_Table A2 Table A2 Chi-squared goodness-of-fit analysis of stage distribution in colorectal cdenocarcinoma (TCGA-COAD). χ 2  Stage 1 Stage 2 Stage 3 Stage 4  Subtype 1 (N = 446)  Outcome: Normal (N = 39) Observed: 14 16 7 2 Expected: 9.75 9.75 9.75 9.75  Outcome: Tumor (N = 407) Observed: 0 0 0 407 Expected: 101.75 101.75 101.75 101.75 χ 2 p −267 Global Chi-Squared Test (Null: Random Uniform Stage Assignment) χ 2 p −267 p ijms-26-08973-t0A3_Table A3 Table A3 Biological functions and oncogenic relevance of top-ranked biomarkers in transitional cell carcinoma (TCC). COL3A1 MXRA8 IDH1 H1-2 Gene Functional Role Mechanistic Relevance in TCC  COL3A1 Collagen III fibril; ECM structural integrity Upregulated in TCC; promotes invasion and poor survival by activating integrin–FAK signaling and downstream PI3K/MAPK cascades, supporting ECM remodeling and metastasis [ 32  MXRA8 ECM adhesion molecule; focal adhesion mediator Overexpressed in advanced stages; implicated in EMT, cell motility, and metastatic potential via activation of FAK and cytoskeletal signaling [ 33  IDH1 NADP + Tumor suppressor; downregulation disrupts α 34  H1-2 Linker histone; chromatin compaction Downregulated in aggressive TCC. Aberrant phosphorylation promotes chromatin relaxation and mitotic activity; linked to dysregulated gene expression and carcinogenesis [ 35 ijms-26-08973-t0A4_Table A4 Table A4 Chi-squared goodness-of-fit analysis of stage distribution in transitional cell carcinoma (TCGA-BLCA). χ 2 χ 2  Stage 1 Stage 2 Stage 3 Stage 4 Stage 5  Subtype 1 (N = 343)  Outcome: Localized (N = 19) Observed: 8 3 3 4 1 Expected: 3.80 3.80 3.80 3.80 3.80  Outcome: Invasive (N = 207) Observed: 34 38 32 69 34 Expected: 41.40 41.40 41.40 41.40 41.40  Outcome: Metastatic (N = 117) Observed: 10 9 21 65 12 Expected: 23.40 23.40 23.40 23.40 23.40 χ 2 p −23 Global Chi-Squared Test (Null: Random Uniform Stage Assignment) χ 2 p −23 p ijms-26-08973-t0A5_Table A5 Table A5 Biological roles and pathological relevance of high-importance biomarkers in Alzheimer’s disease (AD). P. gingivalis Biomarker Functional Role Mechanistic Relevance in AD  APOE Lipid transport; synaptogenesis; A β Facilitates cholesterol transport and A β 36  DKK3 Wnt signaling antagonist; synaptic regulation Upregulated in early AD. Suppresses excitatory neurotransmission and promotes inhibitory tone. Localizes with A β 37  CST3 Cysteine protease inhibitor; glial modulation Highly upregulated in neuroinflammatory states. Amplifies cytokine signaling and glial activation. Overexpressed during infection-associated AD, particularly in cases involving P. gingivalis 38  ALB Osmotic balance; A β Decreased in AD. Normally binds and clears A β P. gingivalis 39 40 ijms-26-08973-t0A6_Table A6 Table A6 Chi-Squared Goodness-of-Fit Analysis of Stage Distributions in AD (EHBS Cohort, Inferred Subtypes). χ 2 p p χ 2 p −74  Stage 1 Stage 2 Stage 3 Stage 4  Subtype 1 (N = 164)  Outcome: Control (N = 53) Observed: 1 11 41 0 Expected: 13.25 13.25 13.25 13.25  Outcome: AD (N = 74) Observed: 0 8 28 38 Expected: 18.50 18.50 18.50 18.50  Outcome: AsymAD (N = 37) Observed: 0 8 21 8 Expected: 9.25 9.25 9.25 9.25 χ 2 p −31  Subtype 2 (N = 146)  Outcome: Control (N = 57) Observed: 0 16 38 3 Expected: 14.25 14.25 14.25 14.25  Outcome: AD (N = 35) Observed: 0 3 9 23 Expected: 8.75 8.75 8.75 8.75  Outcome: AsymAD (N = 54) Observed: 0 2 21 31 Expected: 13.50 13.50 13.50 13.50 χ 2 p −29  Subtype 3 (N = 82)  Outcome: Control (N = 23) Observed: 0 6 7 10 Expected: 5.75 5.75 5.75 5.75  Outcome: AD (N = 20) Observed: 0 1 4 15 Expected: 5.00 5.00 5.00 5.00  Outcome: AsymAD (N = 39) Observed: 0 3 11 25 Expected: 9.75 9.75 9.75 9.75 χ 2 p −14 Overall Chi-Squared Test (Null: Random Uniform Stage Assignment) χ 2 p −74 p References 1. Young A.L. Oxtoby N.P. Daga P. Cash D.M. Fox N.C. Ourselin S. Schott J.M. Alexander D.C. A data-driven model of biomarker changes in sporadic Alzheimer’s disease Brain 2014 137 2564 2577 10.1093/brain/awu176 25012224 PMC4132648 2. Fonteijn H.M. Modat M. Clarkson M.J. Barnes J. Lehmann M. Hobbs N.Z. Scahill R.I. Tabrizi S.J. Ourselin S. Fox N.C. An event-based model for disease progression and its application in familial Alzheimer’s disease and Huntington’s disease NeuroImage 2012 60 1880 1889 10.1016/j.neuroimage.2012.01.062 22281676 3. Gallego-Rudolf J. Wiesman A.I. Pichet Binette A. Villeneuve S. Baillet S. Synergistic association of A β Nat. Neurosci. 2024 27 2130 2137 10.1038/s41593-024-01763-8 39294489 PMC11537964 4. Hanahan D. Hallmarks of Cancer: New Dimensions Cancer Discov. 2022 12 31 46 10.1158/2159-8290.cd-21-1059 35022204 5. Wijeratne P.A. Eshaghi A. Scotton W.J. Kohli M. Aksman L. Oxtoby N.P. Pustina D. Warner J.H. Paulsen J.S. Scahill R.I. The temporal event-based model: Learning event timelines in progressive diseases Imaging Neurosci. 2023 1 1 19 10.1162/imag_a_00010 PMC10503481 37719837 6. Young A.L. Marinescu R.V. Oxtoby N.P. Bocchetta M. Yong K. Firth N.C. Cash D.M. Thomas D.L. Dick K.M. Cardoso J. Uncovering the heterogeneity and temporal complexity of neurodegenerative diseases with Subtype and Stage Inference Nat. Commun. 2018 9 4273 10.1038/s41467-018-05892-0 30323170 PMC6189176 7. Aksman L.M. Wijeratne P.A. Oxtoby N.P. Eshaghi A. Shand C. Altmann A. Alexander D.C. Young A.L. pySuStaIn: A Python implementation of the Subtype and Stage Inference algorithm SoftwareX 2021 16 100811 10.1016/j.softx.2021.100811 34926780 PMC8682799 8. Tandon R. Lah J.J. Mitchell C.S. s-SuStaIn: Scaling subtype and stage inference via simultaneous clustering of subjects and biomarkers Proceedings of the Fifth Conference on Health, Inference, and Learning New York, NY, USA 27–28 June 2024 Volume 248 461 476 PMC11881980 40046824 9. Tandon R. Mei Y. Lah J.J. Mitchell C.S. Comprehensive anatomical staging predicts clinical progression in mild cognitive impairment: A data-driven approach Int. J. Mol. Sci. 2025 26 5514 10.3390/ijms26125514 40564976 PMC12193007 10. van der Ende E.L. Bron E.E. Poos J.M. Jiskoot L.C. Panman J.L. Papma J.M. Meeter L.H. Dopper E.G.P. Wilke C. Synofzik M. A data-driven disease progression model of fluid biomarkers in genetic frontotemporal dementia Brain 2021 145 1805 1817 10.1093/brain/awab382 PMC9166533 34633446 11. Ke G. Meng Q. Finley T. Wang T. Chen W. Ma W. Ye Q. Liu T.Y. LightGBM: A Highly Efficient Gradient Boosting Decision Tree Proceedings of the Advances in Neural Information Processing Systems Guyon I. Luxburg U.V. Bengio S. Wallach H. Fergus R. Vishwanathan S. Garnett R. Curran Associates, Inc. San Jose, CA, USA 2017 Volume 30 12. Breiman L. Random Forests Mach. Learn. 2001 45 5 32 10.1023/A:1010933404324 13. Siegel R.L. Miller K.D. Jemal A. Cancer statistics, 2020 CA Cancer J. Clin. 2020 70 7 30 10.3322/caac.21590 31912902 14. Brenner H. Kloor M. Pox C.P. Colorectal cancer Lancet 2014 383 1490 1502 10.1016/S0140-6736(13)61649-9 24225001 15. van Hoogstraten L.M.C. Vrieling A. van der Heijden A.G. Kogevinas M. Richters A. Kiemeney L.A. Global trends in the epidemiology of bladder cancer: Challenges for public health and clinical practice Nat. Rev. Clin. Oncol. 2023 20 287 304 10.1038/s41571-023-00744-3 36914746 16. Knowles M.A. Hurst C.D. Molecular biology of bladder cancer: New insights into pathogenesis and clinical diversity Nat. Rev. Cancer 2014 15 25 41 10.1038/nrc3817 25533674 17. Goetz M.E. Hanfelt J.J. John S.E. Bergquist S.H. Loring D.W. Quyyumi A. Clifford G.D. Vaccarino V. Goldstein F. Johnson 2nd T.M. Rationale and Design of the Emory Healthy Aging and Emory Healthy Brain Studies Neuroepidemiology 2019 53 187 200 10.1159/000501856 31454799 18. Tandon R. Zhao L. Watson C.M. Sarkar N. Elmor M. Heilman C. Sanders K. Hales C.M. Yang H. Loring D.W. Stratifying risk of Alzheimer’s disease in healthy middle-aged individuals with machine learning Brain Commun. 2025 7 fcaf121 10.1093/braincomms/fcaf121 40226382 PMC11986205 19. Bredesen D.E. Metabolic profiling distinguishes three subtypes of Alzheimer’s disease Aging 2015 7 595 600 10.18632/aging.100801 26343025 PMC4586104 20. Perou C.M. Sorlie T. Eisen M.B. van de Rijn M. Jeffrey S.S. Rees C.A. Pollack J.R. Ross D.T. Johnsen H. Akslen L.A. Molecular portraits of human breast tumours Nature 2000 406 747 752 10.1038/35021093 10963602 21. Sorlie T. Perou C.M. Tibshirani R. Aas T. Geisler S. Johnsen H. Hastie T. Eisen M.B. van de Rijn M. Jeffrey S.S. Gene expression patterns of breast carcinomas distinguish tumor subclasses with clinical implications Proc. Natl. Acad. Sci. USA 2001 98 10869 10874 10.1073/pnas.191367098 11553815 PMC58566 22. Foster K.G. Fingar D.C. Mammalian Target of Rapamycin (mTOR): Conducting the Cellular Signaling Symphony J. Biol. Chem. 2010 285 14071 14077 10.1074/jbc.R109.094003 20231296 PMC2863215 23. MacDonald B.T. Tamai K. He X. Wnt/ β Dev. Cell 2009 17 9 26 10.1016/j.devcel.2009.06.016 19619488 PMC2861485 24. Vidal M. Cusick M.E. Barabási A.L. Interactome Networks and Human Disease Cell 2011 144 986 998 10.1016/j.cell.2011.02.016 21414488 PMC3102045 25. Edge S.B. Byrd D.R. Compton C.C. Fritz A.G. Greene F.L. Trotti A. AJCC Cancer Staging Manual 7th ed. Springer New York, NY, USA 2010 26. Braak H. Braak E. Neuropathological stageing of Alzheimer-related changes Acta Neuropathol. 1991 82 239 259 10.1007/BF00308809 1759558 27. Cox D.R. The Regression Analysis of Binary Sequences J. R. Stat. Soc. Ser. B Stat. Methodol. 1958 20 215 242 10.1111/j.2517-6161.1958.tb00292.x 28. Hong B. Zhou J. Ma K. Zhang J. Xie H. Zhang K. Li L. Cai L. Zhang N. Zhang Z. TRIB3 Promotes the Proliferation and Invasion of Renal Cell Carcinoma Cells via Activating MAPK Signaling Pathway Int. J. Biol. Sci. 2019 15 587 597 10.7150/ijbs.29737 30745845 PMC6367588 29. Li H. K A.J. Tao Y. Xiang Z. RPN2 promotes colorectal cancer cell proliferation through modulating the glycosylation status of EGFR Oncotarget 2017 8 72633 72651 10.18632/oncotarget.20005 29069815 PMC5641158 30. Li W.X. Yang M.X. Hong X.Q. Dong T.G. Yi T. Lin S.L. Qin X.Y. Niu W.X. Overexpression of gelsolin reduces the proliferation and invasion of colon carcinoma cells Mol. Med. Rep. 2016 14 3059 3065 10.3892/mmr.2016.5652 27573444 PMC5042772 31. Ma Y. Wu L. Liu X. Xu Y. Shi W. Liang Y. Yao L. Zheng J. Zhang J. KLF4 inhibits colorectal cancer cell proliferation dependent on NDRG2 signaling Oncol. Rep. 2017 38 975 984 10.3892/or.2017.5736 28656310 32. Zhang H. Ding C. Li Y. Xing C. Wang S. Yu Z. Chen L. Li P. Dai M. Data mining-based study of collagen type III alpha 1 (COL3A1) prognostic value and immune exploration in pan-cancer Bioengineered 2021 12 3634 3646 10.1080/21655979.2021.1949838 34252356 PMC8806444 33. Miao M. Song Y. Jin M. Du Y. Xin P. Jiang Y. Zhang H. Single-cell RNA combined with Bulk RNA analysis to explore oxidative stress and energy metabolism factors and found a new prostatic cancer oncogene MXRA8 Aging 2024 16 4469 10.18632/aging.205599 38441550 PMC10968713 34. Ni Y. Shen P. Wang X. Liu H. Luo H. Han X. The Roles of IDH1 in Tumor Metabolism and Immunity Future Oncol. 2022 18 3941 3953 10.2217/fon-2022-0583 36621781 35. Telu K.H. Abbaoui B. Thomas-Ahner J.M. Zynger D.L. Clinton S.K. Freitas M.A. Mortazavi A. Alterations of Histone H1 Phosphorylation During Bladder Carcinogenesis J. Proteome Res. 2013 12 3317 3326 10.1021/pr400143x 23675690 PMC3743963 36. Husain M.A. Laurent B. Plourde M. APOE and Alzheimer’s Disease: From Lipid Transport to Physiopathology and Therapeutics Front. Neurosci. 2021 15 630502 10.3389/fnins.2021.630502 33679311 PMC7925634 37. Martin Flores N. Podpolny M. McLeod F. Workman I. Crawford K. Ivanov D. Leonenko G. Escott-Price V. Salinas P.C. Downregulation of Dickkopf-3, a Wnt antagonist elevated in Alzheimer’s disease, restores synapse integrity and memory in a disease mouse model eLife 2024 12 RP89453 10.7554/elife.89453.3 38285009 PMC10945611 38. Singh D. Whooley M.A. Ix J.H. Ali S. Shlipak M.G. Association of cystatin C and estimated GFR with inflammatory biomarkers: The Heart and Soul Study Nephrol. Dial. Transplant. 2007 22 1087 1092 10.1093/ndt/gfl744 17210589 PMC2770338 39. Kim J.W. Byun M.S. Lee J.H. Yi D. Jeon S.Y. Sohn B.K. Lee J.Y. Shin S.A. Kim Y.K. Kang K.M. Serum albumin and beta-amyloid deposition in the human brain Neurology 2020 95 10.1212/WNL.0000000000010005 32690787 PMC7605506 40. Dominy S.S. Lynch C. Ermini F. Benedyk M. Marczyk A. Konradi A. Nguyen M. Haditsch U. Raha D. Griffin C. Porphyromonas gingivalis in Alzheimer’s disease brains: Evidence for disease causation and treatment with small-molecule inhibitors Sci. Adv. 2019 5 eaau3333 10.1126/sciadv.aau3333 30746447 PMC6357742 Figure 1 Expression of CRAC biomarkers across stages and outcomes. RPN2 TRIB3 GSN KLF4 Figure 2 Stage distribution by outcome in CRAC. p < 0.001 χ 2 Table A2 Figure 3 Inferred staging order of CRAC biomarkers. Figure 4 Expression of TCC biomarkers across stages and outcomes. IDH1 H1-2 COL3A1 MXRA8 Figure 5 Stage distribution by outcome in TCC. χ 2 p < 0.001 Table A4 Figure 6 Inferred staging order of TCC biomarkers. Figure 7 CSF peptide expression by disease stage and outcome in EHBS. Figure 8 Stage assignment across cognitive status groups. Figure 7 χ 2 p < 0.01 Table A6 Figure 9 Subtype-specific staging of Alzheimer’s disease biomarkers Figure 3 Figure 6 Figure 10 Concept sketch of the ReduXis pipeline. 8 Figure 11 Schema of data preprocessing and internal checks in ReduXis. Figure 12 Schema of ReduXis feature selection. 11 12 27 K ijms-26-08973-t001_Table 1 Table 1 Summary of datasets used. Dataset Name Sample Size Biomarker Count Composition Dataset Name Sample Size Biomarker Count Composition TCGA-COAD 446 5092 39 Normal, 407 Tumor TCGA-BLCA 343 5727 19 Localized, 207 Invasive, 117 Metastatic EHBS 392 71 133 Control, 130 AsymAD, 129 AD ijms-26-08973-t002_Table 2 Table 2 Stability of feature selection across three datasets (5-fold CV, three classifiers) of top biomarkers. Dataset Name Stability Score Total Biomarkers Biomarkers Selected TCGA-COAD 0.615 5092 66 a TCGA-BLCA 0.647 5727 68 a EHBS 1.000 b 71 71 a b ijms-26-08973-t003_Table 3 Table 3 Comparison of runtime across three datasets analyzed in this study. Dataset Name Stages Subtypes Features s-SuStaIn Wall Time ReduXis Wall Time Dataset Name Stages Subtypes Features s-SuStaIn Wall Time ReduXis Wall Time TCGA-COAD 4 1 5092 1,350,368 s (15 d, 15 h) 224 s (3 m, 44 s) TCGA-BLCA 5 1 5727 1,810,983 s (20 d, 23 h) 255 s (4 m, 15 s) EHBS 4 3 71 1717 s (28 m, 47 s) 1393 s (23 m, 13 s) ijms-26-08973-t004_Table 4 Table 4 Runtime complexity analysis of s-SuStaIn. Number of Biomarkers s-SuStaIn Wall Time 2 30.76 s 3 33.43 s 5 36.79 s 10 47.15 s 25 71.74 s (1 m, 12 s) 50 132.44 s (2 m, 12 s) 100 398.50 s (6 m, 39 s) ijms-26-08973-t005_Table 5 Table 5 Algorithmic estimation of the time complexity of s-SuStaIn. O ( log M ) O ( M ) O ( M log M ) O ( M 2 ) O ( 2 M ) T i m e = k × f ( M ) + b O ( M 2 ) O ( M 2 ) Model Fit Coefficient ( k Base Coefficient ( b RMSE (s)   O ( log M ) 50.081 0.0066 104.04   O ( M ) 3.597 7.06 27.47   O ( M log M ) 0.539 21.47 18.90   O ( M 2 ) 0.036 30.02 10.65   O ( M 3 ) 0.000354 29.94 27.25   O ( 2 M )   1.14 × 10 − 50   5.16 × 10 − 9 163.50 ",
  "metadata": {
    "Title of this paper": "Porphyromonas gingivalis in Alzheimer’s disease brains: Evidence for disease causation and treatment with small-molecule inhibitors",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469613/"
  }
}