{
  "title": "Paper_692",
  "abstract": "pmc Commun Biol Commun Biol 3495 commbiol Communications Biology 2399-3642 Nature Publishing Group PMC12474940 PMC12474940.1 12474940 12474940 41006700 10.1038/s42003-025-08751-z 8751 1 Article Zingerone treats postmenopausal osteoporosis via increased ferroptosis sensitivity by p53-mediated regulation of SAT1 and GPX4 expression Li Hao Cao Fangming Liu Dian http://orcid.org/0000-0002-1702-9833 Tao Lin taolindr@163.com https://ror.org/04wjghj95 grid.412636.4 Department of Orthopedics, First Hospital of China Medical University, 26 9 2025 2025 8 478257 1367 2 9 2024 20 8 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Zingerone, a component of dried ginger, has known anti-ulcer and bone growth-promoting effects, but its impact on postmenopausal osteoporosis (PO) is unclear. This study investigates the therapeutic potential and underlying mechanisms of zingerone in PO. A concentration-dependent effect identified on osteoclast precursors: at low concentrations, zingerone maintains low ROS levels, enhance proliferation, and facilitates bone remodelling; at high concentrations, it elevates ROS levels, enhances ferroptosis sensitivity, and suppresses osteoclast formation. Zingerone significantly improves bone mass in an ovariectomised mouse model of PO. Metabolomics identifies 869 differential metabolites linked to glutathione and purine metabolism. Transcriptomics highlights pathways including ferroptosis, leukocyte migration, and cell adhesion. In RAW264.7 cells, zingerone modulates p53 2+ Sat1 Gpx4 p53 The effect of zingerone on postmenopausal osteoporosis, as modelled in mouse, was assessed using micro-CT, histopathology, metabolomics, and transcriptomics. The result suggest a beneficial effect on bone mass through mechanisms involving ferroptosis and p53 modulation. Subject terms Cell biology Plant sciences https://doi.org/10.13039/501100001809 National Natural Science Foundation of China (National Science Foundation of China) 22-321-32-08 Tao Lin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Postmenopausal osteoporosis is a prevalent bone metabolic disorder among middle-aged and elderly women, and it is driven primarily by a decrease in oestrogen levels. The reduction in oestrogen levels leads to a progressive decrease in trabecular bone volume, rendering the bone structure fragile and diminishing its resilience to physical stress, thereby increasing the risk of fractures 1 2 3 4 5 6 With the progression of inquiry into traditional Chinese herbal pharmacopeia and its enduring application over past eras, an increasing number of researchers are shifting their focus to the use of Chinese herbal medicine for the treatment of postmenopausal osteoporosis. Studies have revealed that the traditional herb Radix et Rhizoma Coptidis primarily targets key pathways, such as the Hif-1 Pi3k–Akt Jun Tp53 Akt1 Esr1 Mark14 7 8 9 Zingiber officinale Roscoe 10 11 12 13 Omics technologies enable the systematic and comprehensive study of the overall and dynamic characteristics of diseases, aiding in the identification of potential biomarkers and the elucidation of disease pathogenesis and drug treatment mechanisms 14 15 Results Zingerone affects RAW264.7 cell proliferation and bone quality in OVX mice The addition of H 2 2 16 2 2 2 2 1A 1B 1C 1D 1E S2A, B 1F S2C 1G–J Fig. 1 Effect of zingerone on RAW264.7 cell proliferation and bone mass in OVX mice. A n B n C D n E F G n H G p p p p p p Zingerone impacts bone metabolism in OVX mice Nontargeted metabolomics was employed to observe the effects of zingerone on bone metabolic characteristics in OVX mice. PCA was used to detect outliers and evaluate metabolomic differences (Fig. 2A 2B 2C 2D 2E 2F Fig. 2 Zingerone impacts femoral metabolism in OVX mice. A n B n C n D n E F Zingerone alters transcript levels in the bone tissue of OVX mice An analysis of RNA-seq data was conducted using the Limma package, with a threshold of abs(log2) > 0.2 and an adjusted p 3A 3B 3C 3D 17 Fig. 3 Zingerone alters transcriptional levels in bone tissue of OVX mice. A n B p C D The integration of metabolomic and transcriptomic analyses elucidates the mechanism of action and targets of zingerone Using MetaboAnalyst 5.0, a joint pathway analysis of the metabolomic and transcriptomic data was conducted to establish comprehensive correlations between the DEGs and the differentially abundant metabolites. Pathways such as arachidonic acid metabolism, ferroptosis, and ovarian steroid synthesis were enriched in the joint analysis, further confirming the role of the ferroptosis pathway in the treatment of postmenopausal osteoporosis with zingerone (Fig. 4A Fig. 4 Integrated analysis of metabolome and transcriptome elucidates the mechanism of action and targets of zingerone. A B n C n D E F G n H n I n J n p p p Because zingerone is an antioxidant drug and ferroptosis is characterized by a cellular phenotype of oxidative stress, potential discrepancies were observed between the transcriptomic results and zingerone properties. ROS activity was evaluated after treating osteoclast precursor cells with zingerone to validate the transcriptomic results. Zingerone increased the levels of ROS in osteoclast precursor cells (Fig. 4B 4C 4D, E p53 Sat1 Gpx4 p53 Gpx4 Sat1 p53 p53 Gpx4 Sat1 For Sat1 p53 p53 1 Table 1 NC_000086.8 Mus musculus Name Sequence Position(0-based) Strand Score p value E-value p53 T01806 AGATCTGTCCAGGAAAGCCC 138 + 191.02 0 0 p53 T01806 GATCTGTCCAGGAAAGCCC 139 + 162.52 7.5E-5 0.149 For Gpx4 p53 p53 2 Table 2 NC_000076.7 Mus musculus Name Sequence Position(0-based) Strand Score p E-value p53 T01806 CTGCATGTGTATTCATGCCT 959 - 148.59 0.000375 0.74 Pearson’s correlation analysis was conducted to assess the associations between key target genes and metabolites altered by zingerone treatment and to explore the interplay between the metabolomic and transcriptomic profiles. A correlation heatmap was generated to visualize gene–metabolite interactions, with red representing strong positive correlations and blue denoting strong negative correlations. Notably, glutathione levels were negatively correlated with Gpx4 Sat1 4F Ferroptosis is a form of programmed cell death involved in various disease processes and is characterized by impaired glutathione metabolism and the excessive accumulation of ROS 18 4G–J Zingerone modulates ferroptosis sensitivity in RAW264.7 cells via p53 regulation Cells were treated with varying concentrations of zingerone and hydrogen peroxide (H₂O₂), and cell viability was assessed using the CCK-8 assay to investigate the effects of different levels of reactive oxygen species (ROS) on osteoclast precursor cells. Low concentrations of zingerone (0–25 μM) appeared to promote the proliferation of osteoclast precursor cells. However, with increasing concentrations, the inhibitory effects became evident, with significant suppression observed at 400 μM (Fig. 5A 5B 5C, D 5E–F p53 2 2 16 2 2 p53 Sat1 Gpx4 p53 p53 p53 5G 5H, I p53 5J, K 5L 2+ 2+ p53 5M p53 5N Fig. 5 Zingerone regulates ferroptosis sensitivity in RAW264.7 cells via p53. A n B n C n D C E n F E G p53 n H p53 n I J n K L M n N n p p p p p p p p Zingerone regulates ferroptosis sensitivity in RAW264.7 cells via the p53-mediated regulation of SAT1 and GPX4 expression Molecular docking was performed to confirm the binding affinity between zingerone and p53 6A p53 p53 6B S2D 6C 6D, E S2E, F ) p53 p53 p53 6G, H p53 p53 6I, J p53 Fig. 6 Zingerone mediates ferroptosis sensitivity in RAW264.7 cells through p53-regulated expression of SAT1 and GPX4. A p53 B n C D n E n F G n H G I p53 n J I p p p p p p p Zingerone inhibits RANKL-induced osteoclastic differentiation by regulating p53–GPX4/SAT1 This study further examined the expression of the osteoclast marker CTSK in bone tissue using immunofluorescence staining to validate the in vitro findings described above. Zingerone treatment led to a significant reduction in CTSK expression in bone tissue compared with that in the OVX group (Fig. 7A, B S2A 7C–D 7E, F 7G, H p53 7I, J 7K, L S1 p53 Sat1 Gpx4 Fig. 7 Zingerone inhibits RANKL-induced osteoclastic differentiation via regulation of p53-GPX4/SAT1. A n B C n D E n F E G n H G I p53 n J I K p53 n L K p p p p p p p p Discussion With the increasing ageing population and evolving lifestyle patterns, postmenopausal osteoporosis and its related fracture risk have emerged as significant global public health issues. Chemical synthetic drugs for osteoporosis treatment face challenges, such as long development cycles, high costs, potential side effects, and unclear efficacy. In contrast, traditional Chinese herbal medicine is cost-effective and generally associated with lower toxicity. In a screening study of drugs approved by the FDA, our previous findings were the first to demonstrate the therapeutic potential of zingerone in managing postmenopausal osteoporosis. Osteoclast precursors undergo differentiation into mature osteoclasts in response to RANKL and M-CSF, thereby promoting bone resorption. Once osteoclasts mature, they lose their proliferative capacity, indicating that the proliferation and death of osteoclast precursor cells determine the number of osteoclasts, a major factor in the homeostasis of bone formation and resorption. Dennis J Wu et al. confirmed that in the early stages of postmenopausal osteoporosis, M-CSF promotes the proliferation and survival of RAW264.7 cells, disrupting the balance between bone formation and resorption and leading to osteoporosis 19 Postmenopausal osteoporotic bone tissue is in a prolonged state of oxidative stress, leading to the excessive activation of osteoclast precursors and osteoclasts and ultimately leading to increased bone loss. Mitochondria, the primary organelles that regulate the balance between oxidation and reduction, are highly susceptible to oxidative damage. The collapse of the mitochondrial antioxidant system due to cellular oxidative damage leads to ferroptosis, which is characterized by changes in mitochondrial morphology and function, as well as the accumulation of Fe 2+ 20 21 17 During bone remodelling, oxidative stress is a critical regulatory factor maintaining the dynamic balance between bone formation and resorption 22 23 24 25 26 27 28 In this study, we found that treatment with low concentrations of H₂O₂ promoted the proliferation of RAW264.7 cells, whereas higher concentrations significantly reduced cell viability. A similar biphasic response was observed with zingerone treatment, suggesting that zingerone may exert a dual regulatory effect on RAW264.7 cell proliferation. This hypothesis was supported by further evidence: low concentrations of zingerone (0–25 μM) promoted RAW264.7 cell proliferation and differentiation, whereas high concentrations (200–400 μM) markedly suppressed proliferation. Additionally, in H₂O₂-treated osteoclasts, the subsequent addition of zingerone (50–400 μM) further increased oxidative stress and induced p53 Oestrogen deficiency leads to abnormal conversion between oxidized and reduced glutathione, resulting in excessive ROS production and oxidative damage to bone tissue, a characteristic feature of postmenopausal osteoporosis. The KEGG enrichment analysis of metabolomic data revealed pathways associated with zingerone treatment for postmenopausal osteoporosis, such as the glutathione metabolism and purine metabolism pathways. Combined with the joint analysis of transcriptomic data, our findings revealed that zingerone treatment for postmenopausal osteoporosis also affects glutathione metabolism and is associated with the expression of the ferroptosis genes SAT1 GPX4 NADPH SAT1 GPX4 29 30 SAT1 31 GPX4 32 33 A joint analysis was performed to further elucidate how zingerone regulates the expression of SAT1 GPX4 p53 SAT1 GPX4 p53 p53 34 p21 CDK2 p53 35 p53 NOXA 36 p53 p53 GPX4 37 p53 GPX4 38 Methods Cell culture and reagents The mouse monocytic leukaemia cell line RAW264.7 was obtained from the Type Culture Collection affiliated with the Cell Bank of the Chinese Academy of Sciences. Zingerone (98%, MB6714) was purchased from Dalian Meilun Biotech Co., Ltd. (Dalian, China). Thermo Fisher Scientific (Waltham, MA, USA) supplied H 2 2 2+ p53 2 Cell transfection Three siRNAs targeting p53 p53 p53 3 Table 3 RNA interference sequences used for transfection Name Forward (5’- 3’) Reverse (5’- 3’) P53 GAAUGAGGCCUUAGAGUUATT UAACUCUAAGGCCUCAUUCTT P53 AAGUCUGUUAUGUGCACGUACTT GUACGUGCACAUAACAGACUUTT P53 CCACUUGAUGGAGAGUAUUTT AAUACUCUCCAUCAAGUGGTT Cell viability assay The cells were diluted to a concentration of 10,000 cells per millilitre and distributed into a 96-well plate, with each well containing 100 microlitres. Zingerone was initially dissolved in DMSO at a concentration of 10 mM and further diluted in DMEM supplemented with 10% fetal bovine serum to final concentrations of 50, 100, 200, and 400 µM prior to use. Specifically, a 1 mM intermediate H₂O₂ solution was freshly prepared by diluting 1.13 µL of 3 wt.% H₂O₂ (Thermo Fisher, 7722-84-1) with 998.87 µL of PBS (Thermo Fisher, 10010023), followed by further dilution of 200 µL of the 1 mM solution with 800 µL of PBS to obtain a 200 µM working solution immediately prior to use. Different concentrations of zingerone and H 2 2 Ferroptosis sensitivity experiment RAW264.7 cells were seeded in a 96-well plate and subjected to modelling, treatment, or p53 Intracellular ROS detection RAW264.7 cells were plated in a 6-well plate and divided into control, model, treatment, and experimental groups with p53 2 2 Detection of mitochondrial membrane potential The mitochondrial membrane potential of RAW264.7 cells was evaluated using the JC-1 mitochondrial membrane potential detection kit (Beyotime Biotechnology, C2003S). The cells were plated in a 6-well dish, and the control, model, treatment, and p53 Measurement of iron ion levels The iron levels in RAW264.7 cells were analyzed following the protocol for FeRhoNox-1 (Fe 2+ Measurement of MDA Following the instructions provided in the lipid oxidation (MDA) detection kit protocol (Beyotime Biotechnology, S0131S), the experiment was conducted as follows: 150 μL of cell lysis buffer was initially added to the cells. Upon completion of this procedure, the samples were incubated on ice for 10 min. The cells were scraped and buffer was added; this amalgamation of cellular matter and buffer was transferred to 1.5 mL tubes on ice for preservation. The tubes were vortexed every 10 min for three cycles. The samples were subjected to centrifugation at 12,000 × g at 4 °C for ten minutes, and the resulting supernatants, including the cell lysis buffer, were collected by centrifugation. Next, 100 µl of each lysate was combined with 200 µl of the supplied reagent and incubated at 100 °C in the dark for 15 min. Once the samples reached ambient temperature, they were centrifuged at 1000 g at 25 degrees Celsius for ten minutes. Then, 200 µL of the supernatant of each sample was extracted and transferred to a 96-well plate. A spectrophotometer with precision tuned to optical absorbance at 532 nm was used immediately to analyse the samples. Transmission electron microscopy observation of mitochondrial structure For transmission electron microscopy (TEM) observation of mitochondrial structure, RAW264.7 cells were harvested by centrifugation and fixed in 2.5% glutaraldehyde (Servicebio, G1102) at 4 °C overnight. After washing with PBS, the samples were post-fixed with 1% osmium tetroxide (Electron Microscopy Sciences, 19150) for 1 hour, dehydrated through a graded ethanol series, and embedded in epoxy resin (Electron Microscopy Sciences, 14120). Ultrathin sections (60–80 nm) were prepared using an ultramicrotome (Leica Microsystems, Germany) and stained sequentially with 2% uranyl acetate (Servicebio, G1960) and lead citrate (Servicebio, G1961). Sections were examined using a transmission electron microscope (Hitachi, Japan), and high-resolution digital images were captured from five randomly selected fields per group. Animals and drugs All animal experiments were approved by the Animal Ethics Committee of the First Affiliated Hospital of China Medical University (Approval No. 2019014). We have complied with all relevant ethical regulations for animal use. Eighteen female C57BL/6 J mice (8 weeks old, weighing 20–25 g, MGI:2164831) were procured for the animal experiments and housed at the Department of Experimental Animal Science at China Medical University. The laboratory maintained controlled conditions, with a temperature of 20–26 degrees Celsius, atmospheric moisture levels of 40% to 70%, an ammonia concentration of 14 mg/m 3 39 Sample collection Following an 8-week treatment protocol, the mice were humanely euthanized via isoflurane anaesthesia combined with cervical dislocation. Cardiac, hepatic, splenic, renal, and bilateral femoral/tibial tissues were collected for the imaging evaluation. Samples were preserved for examination via micro-CT imaging, immunohistochemical staining and immunofluorescence staining. Histopathological investigations were subsequently performed. Femoral metabolomic profiling, RNA extraction, transcriptomic data interpretation, and correlation studies were performed to analyse the samples and obtain insights. All experimental procedures strictly complied with institutional ethical guidelines and animal welfare regulations. Micro-CT analysis of the femur After fixation in 4% paraformaldehyde (Beyotime, P0099) at 4 °C for 48 hours, the femur samples were rinsed with PBS and dehydrated through a graded ethanol series. Subsequently, all tissue samples underwent micro-CT scanning with the following parameters: an X-ray tube current of 200 µA, voltage of 85 kV, full specimen scanning, scan resolution of 10.141270 μm, exposure time of 384 ms, and a scan angle of 180 degrees with a rotation step of 0.4°, and a frame averaging of 2. Upon completion of the scanning process, raw projection data were acquired automatically by the micro-CT system and reconstructed into three-dimensional images using NRecon software (version V1.7.4.2, Bruker, Germany). The reconstruction settings were adjusted with the following parameters: smoothing set to 2, beam hardening at 8, and ring artifacts at 25%. Further analysis was conducted using CT Analyser software (version 1.18.8.0, Bruker, Germany), where parameters such as bone mineral density (BMD) were calculated for the tissues. Histopathological analysis The hearts, livers, spleens, and kidneys obtained from both the sham surgery group and the treatment groups were preserved in 4% paraformaldehyde, embedded in paraffin after processing, and thereafter sectioned to an 8-micrometer thickness; the samples were stained with haematoxylin and eosin (H&E). The potential adverse effects of zingerone on the major organs of the mice was assessed through a microscopic examination. Femoral tissues devoid of muscle were rapidly collected, rinsed carefully in cold phosphate-buffered saline, the specimens were immersed in a 4% paraformaldehyde solution for a duration extending to twenty-four hours, decalcified in 10% EDTA solution (Servicebio, G1105) at pH 7.4 at room temperature for 2 weeks, with the solution refreshed every 2 days, until the samples became easily penetrable by a needle. After decalcification, the tissues were embedded in paraffin and sectioned at a thickness of 4 μm. Histopathological changes were evaluated using hematoxylin and eosin (H&E) staining, Goldner’s trichrome staining, and tartrate-resistant acid phosphatase (TRAP) staining under an optical microscope. Immunofluorescence staining of bone tissue Femoral tissues were fixed in 4% paraformaldehyde for 24 h, followed by decalcification in 10% EDTA solution (Servicebio, G1105) at pH 7.4 at room temperature for two weeks. The decalcifying solution was refreshed every two days, and completion was determined when the specimens could be easily penetrated by a needle. After decalcification, samples were dehydrated through a graded ethanol series and embedded in paraffin. Paraffin-embedded tissues were sectioned at a thickness of 4 μm, and antigen retrieval was performed by heating the sections in sodium citrate buffer (Servicebio, G1202) at 95 °C for 10 minutes. Following sectioning, a 5% bovine serum albumin solution was used to block nonspecific binding sites for one hour; subsequently, these sections were incubated overnight at a temperature of 4 °C with primary antibodies against the p53 (Proteintech, 60283-2-Ig, 1:200), Sat1 (Proteintech, 10708-1-AP, 1:200), Gpx4 (Proteintech, 67763-1-Ig, 1:200), OCN (Proteintech, 23418-1-AP, 1:200), and CTSK (Proteintech, 11239-1-AP, 1:200). The following day, the sections were washed and incubated with Alexa Fluor® 488-conjugated goat anti-rabbit IgG (Invitrogen, A-11008, 1:500) and Alexa Fluor® 594-conjugated goat anti-mouse IgG (Invitrogen, A-11005, 1:500), followed by nuclear counterstaining with DAPI (Beyotime, C1002). Fluorescence images were acquired using a Nikon AXR confocal microscope, Nikon corporation, Japan. Immunohistochemical staining of bone tissue After being embedded in paraffin and sectioned, the bone tissue was subjected to deparaffinization, rehydration, and antigen retrieval using 10 mM sodium citrate buffer (pH 6.0) at high temperature. A 10 minute incubation with a 3% H 2 2 Protein extraction from bone tissue The femoral tissues used for protein extraction were obtained from the same mice described in the “Animals and drugs” and “Sample collection” sections, following the completion of the 8-week treatment protocol and humane euthanasia. The collected femurs were rapidly frozen in liquid nitrogen and ground into a fine bone powder using a prechilled mortar and pestle. The resulting bone powder was transferred to 1.5 mL Eppendorf tubes and lysed with precooled RIPA lysis buffer supplemented with 1% PMSF. Lysis buffer was added at a ratio of 500 μL per 50 mg of tissue. The samples were lysed on ice for 30 minutes with vigorous shaking for 10 seconds every 5 minutes to enhance disruption. The lysates were centrifuged for 15 minutes at 12,000 × g and 4 °C; the resulting supernatants were designated comprehensive protein extracts. Protein quantification was subsequently conducted using the BCA assay. The extracted proteins were then subjected to SDS‒PAGE followed by Western blot analysis. Isolation and culture of primary bone marrow-derived macrophages (BMMs) Femurs and tibiae used for BMM isolation were collected from the same cohort of C57BL/6 mice described earlier, immediately after euthanasia at the end of the treatment period. Using MEM supplemented with 10% foetal bovine serum, bone marrow cells were extracted from the medullary cavities. The resulting cellular suspension was filtered with a strainer designed for particles measuring 70 micrometres before culture with MEM. This medium included 10% foetal bovine serum supplemented with 1% penicillin‒streptomycin and 30 ng/mL M-CSF. The cells were cultured at 37 °C in a humidified incubator with 5% CO₂. After 3 days, nonadherent cells were removed, and adherent cells were maintained as BMMs for subsequent differentiation or staining experiments. TRAP staining for osteoclast differentiation Bone marrow-derived macrophages (BMMs) were induced to differentiate into osteoclast-like cells over a 7-day period by culturing them in MEM supplemented with 30 ng/mL M-CSF and 50 ng/mL RANKL. Postinduction protocols included brief fixation with 4% paraformaldehyde for ten minutes, followed by rinses with PBS. TRAP staining solution (Servicebio, G1050) was added, and the samples were incubated at 37 °C in the dark for 1 hour until a reddish-purple precipitate indicative of TRAP activity became visible. TRAP-positive multinucleated cells were visualized and quantified under an ECLIPSE TE300 microscope (Nikon, Japan) to assess osteoclastogenesis. Processing and analysis of the femoral metabolomic data Novogene Co. Ltd. in Beijing, China, conducted the extraction, analysis, data processing, and identification of mouse femoral metabolites. The LC‒MS/MS analysis was performed using a Vanquish UHPLC system (Thermo Fisher, Germany) coupled with a Q Exactive HF‒X mass spectrometer (Thermo Fisher, Germany). Differentially abundant metabolites were identified based on the following criteria: VIP > 1.0, FC > 1.5 or FC < 0.667, and P value < 0.05. The data were transformed using metaX, followed by partial least squares discriminant analysis (PLS-DA) and principal component analysis (PCA) to reveal differences in metabolic patterns among the groups. Hierarchical clustering analysis (HCA) and metabolite correlation analysis were conducted to clarify the relationships between samples and among metabolites. Functional analyses, including a metabolic pathway analysis, were performed to interpret the biological significance of the metabolite correlations. Q2, which represents the model’s predictive ability, was calculated through cross-validation (CV). A high Q2 value indicates strong predictive power, and R2 values close to 1 suggest a well-fitted model. RNA extraction and transcriptomic data analysis Novogene Co., Ltd., in Beijing, China, conducted the RNA sequencing analysis of three replicates of mouse femoral tissue. The differential expression analysis was performed using the Limma package for two groups, each with three biological replicates. The differential expression analysis was performed using the Limma package in R, with a cut-off threshold of abs(log2) > 0.2. Genes with a adjp-value < 0.05 were deemed significantly differentially expressed. Significantly enriched genes among the DEGs were identified based on corrected p values less than 0.05. The statistical enrichment of annotated genes was performed using the KEGG pathway database and the clusterProfiler R package. Additionally, gene set enrichment analysis (GSEA) was conducted utilizing the clusterProfiler R package. Fold changes in gene expression were calculated for group comparisons, leading to the generation of gene lists based on |log2FC| changes. Pearson’s correlation analysis was performed to assess the correlations between genes and metabolites, with statistical significance set at a p value of less than 0.05. Identification of transcription factor binding sites The DNA sequence 1–2 kb upstream of the gene was considered the promoter sequence of the gene. The mouse Gpx4 Sat1 GRCm39 p53 Sat1 Gpx4 JASPAR is an open-source database of transcription factor-binding site information that records the DNA-binding preferences of transcription factors in six major classes of species (fungi, insects, nematodes, plants, chordates, and vertebrates) in the form of position frequency matrices (PFMs) and flexible TF models (TFFMs), which are derived mainly from collections of experimentally defined transcription factor-binding sites published in eukaryotes. The JASPAR database was used to analyse the potential binding sites for the p53 GRCm39 Molecular docking The crystal structure of the receptor protein was obtained from the UniProt protein database ( https://www.uniprot.org/ https://pubchem.ncbi.nlm.nih.gov/ Western blot analysis The cells were lysed on ice in RIPA buffer for 10 minutes, followed by sonication and centrifugation at 14,000 g for 30 minutes at 4 °C. The resulting supernatants were collected, and the volumes were recorded. Protein concentrations were determined using a BCA assay kit. Proteins were separated on 12.5% SDS‒PAGE gels and transferred onto PVDF membranes. After blocking at room temperature for 1 hour, the membranes were incubated overnight with primary antibodies. The samples were then washed five times with TBST for 5 minutes each before being exposed to secondary antibodies for 1.5 hours at 4 °C. Primary antibodies against P53 (Proteintech, 60283-2-Ig, 1:2000), SAT1 (Proteintech, 10708-1-AP, 1:2000), GPX4 (Proteintech, 67763-1-Ig, 1:2000), MMP9 (Proteintech, 30592-1-AP, 1:2000), CTSK (Proteintech, 11239-1-AP, 1:2000), RUNX2 (Proteintech, 20700-1-AP, 1:2000), ALP (Proteintech, 55319-1-AP, 1:2000), BMP2 (Proteintech, 18933-1-AP, 1:2000), GSDMD-N (Affinity, DF13758, 1:2000), GSDMD (Affinity, AF4012, 1:2000), Beclin-1 (Proteintech, 11306-1-AP, 1:2000), LC3B (Proteintech, 14600-1-AP, 1:2000), caspase-12 (Affinity, AF5196, 1:2000), cleaved caspase-12 (Affinity, DF7735, 1:2000), and β-actin (Proteintech, 23660-1-AP, 1:2000) were used. Secondary antibodies, including goat anti-rabbit IgG (CST, 7074S, 1:2000) and goat anti-mouse IgG (CST, 7076S, 1:2000), were used at the same dilution. β-actin (43 kDa) served as the internal loading control. Enhanced chemiluminescence (ECL) was used for signal detection, and protein bands were visualized using a chemiluminescence imaging system (Analytik Jena AG). Band intensities were quantified using ImageJ software (version 1.8.0; NIH, USA). Statistics and Reproducibility GraphPad Prism 9.5.1 (San Diego, California, USA) was used for statistical analysis. Comparisons between multiple groups were conducted using one-way analysis of variance (ANOVA). Significance levels are indicated as follows: * p p p p p p p p Ethical approval All animal experiments were approved by the Animal Ethics Committee of the First Affiliated Hospital of China Medical University (Approval No. 2019014). We have complied with all relevant ethical regulations for animal use. Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary material Description of Additional Supplementary Files Supplementary Data 1 Supplementary data 2 Supplementary Data 3 Supplementary Data 4 Supplementary Data 5 Supplementary Data 6 Supplementary Data 7 Supplementary Data 8 Reporting Summary Transparent Peer Review file Publisher’s note These authors contributed equally: Hao Li, Fangming Cao. Supplementary information The online version contains supplementary material available at 10.1038/s42003-025-08751-z. Acknowledgements This study was supported by the National Natural Science Foundation of China (grant no. 32200943) and the Shenyang Natural Science Foundation (grant no. 22-321-32-08). Author contributions H.L.: Project administration, validation, and writing – original draft. FM.C: Conceptualization, data curation, methodology, software, supervision, writing and editing original draft. D.L.: Investigation, data curation, and formal analysis. L.T.: Conceptualization, methodology, resources, writing – review & editing. Peer review Peer review information Communications Biology Data availability Supporting data can be requested by contacting the corresponding author. The RNA-seq sequencing data are available on the Gene Expression Omnibus (GEO) of the National Center for Biotechnology Information (NCBI) under the accession number GSE304652 1 8 S1 S2 Competing interests The authors declare no competing interests. References 1. Lin H 4D label-free quantitative proteomics analysis to screen potential drug targets of Jiangu Granules treatment for postmenopausal osteoporotic rats Front Pharm. 2022 13 1052922 10.3389/fphar.2022.1052922 PMC9663813 36386173 Lin, H. et al. 4D label-free quantitative proteomics analysis to screen potential drug targets of Jiangu Granules treatment for postmenopausal osteoporotic rats. Front Pharm. 13 10.3389/fphar.2022.1052922 PMC9663813 36386173 2. Delmas PD Treatment of postmenopausal osteoporosis Lancet 2002 359 2018 2026 10.1016/S0140-6736(02)08827-X 12076571 Delmas, P. D. Treatment of postmenopausal osteoporosis. Lancet 359 12076571 10.1016/S0140-6736(02)08827-X 3. Black DM Rosen CJ Clinical Practice. Postmenopausal Osteoporosis N. Engl. J. Med 2016 374 254 262 10.1056/NEJMcp1513724 26789873 Black, D. M. & Rosen, C. J. Clinical Practice. Postmenopausal Osteoporosis. N. Engl. J. Med 374 26789873 10.1056/NEJMcp1513724 4. Rossouw JE Risks and benefits of estrogen plus progestin in healthy postmenopausal women: principal results From the Women’s Health Initiative randomized controlled trial Jama 2002 288 321 333 10.1001/jama.288.3.321 12117397 Rossouw, J. E. et al. Risks and benefits of estrogen plus progestin in healthy postmenopausal women: principal results From the Women’s Health Initiative randomized controlled trial. Jama 288 12117397 10.1001/jama.288.3.321 5. Kuehn BM Long-term risks of bisphosphonates probed Jama 2009 301 710 711 10.1001/jama.2009.128 19224742 Kuehn, B. M. Long-term risks of bisphosphonates probed. Jama 301 19224742 10.1001/jama.2009.128 6. Nishikawa A Ishida T Taketsuna M Yoshiki F Enomoto H Safety and effectiveness of daily teriparatide in a prospective observational study in patients with osteoporosis at high risk of fracture in Japan: final report Clin. Inter. Aging 2016 11 913 925 10.2147/CIA.S107285 PMC4939987 27462147 Nishikawa, A., Ishida, T., Taketsuna, M., Yoshiki, F. & Enomoto, H. Safety and effectiveness of daily teriparatide in a prospective observational study in patients with osteoporosis at high risk of fracture in Japan: final report. Clin. Inter. Aging 11 10.2147/CIA.S107285 PMC4939987 27462147 7. Zhao J Exploration of the Molecular Mechanism of Polygonati Rhizoma in the Treatment of Osteoporosis Based on Network Pharmacology and Molecular Docking Front Endocrinol. (Lausanne) 2021 12 815891 10.3389/fendo.2021.815891 35069454 PMC8766719 Zhao, J. et al. Exploration of the Molecular Mechanism of Polygonati Rhizoma in the Treatment of Osteoporosis Based on Network Pharmacology and Molecular Docking. Front Endocrinol. (Lausanne) 12 35069454 10.3389/fendo.2021.815891 PMC8766719 8. Xia H Integrated Strategy of Network Pharmacological Prediction and Experimental Validation Elucidate Possible Mechanism of Bu-Yang Herbs in Treating Postmenopausal Osteoporosis via ESR1 Front Pharm. 2021 12 654714 10.3389/fphar.2021.654714 PMC8144472 34045964 Xia, H. et al. Integrated Strategy of Network Pharmacological Prediction and Experimental Validation Elucidate Possible Mechanism of Bu-Yang Herbs in Treating Postmenopausal Osteoporosis via ESR1. Front Pharm. 12 10.3389/fphar.2021.654714 PMC8144472 34045964 9. Li H Extracellular Vesicles from Human Urine-Derived Stem Cells Ameliorate Particulate Polyethylene-Induced Osteolysis Int J. Nanomed. 2021 16 7479 7494 10.2147/IJN.S325646 PMC8579861 34785895 Li, H. et al. Extracellular Vesicles from Human Urine-Derived Stem Cells Ameliorate Particulate Polyethylene-Induced Osteolysis. Int J. Nanomed. 16 10.2147/IJN.S325646 PMC8579861 34785895 10. Han YA Anti-inflammatory effects of the Zingiber officinale roscoe constituent 12-dehydrogingerdione in lipopolysaccharide-stimulated Raw 264.7 cells Phytother. Res 2013 27 1200 1205 10.1002/ptr.4847 23027684 Han, Y. A. et al. Anti-inflammatory effects of the Zingiber officinale roscoe constituent 12-dehydrogingerdione in lipopolysaccharide-stimulated Raw 264.7 cells. Phytother. Res 27 23027684 10.1002/ptr.4847 11. Grzanna R Lindmark L Frondoza CG Ginger-an herbal medicinal product with broad anti-inflammatory actions J. Med Food 2005 8 125 132 10.1089/jmf.2005.8.125 16117603 Grzanna, R., Lindmark, L. & Frondoza, C. G. Ginger-an herbal medicinal product with broad anti-inflammatory actions. J. Med Food 8 16117603 10.1089/jmf.2005.8.125 12. Arcusa R Potential Role of Ginger (Zingiber officinale Roscoe) in the Prevention of Neurodegenerative Diseases Front Nutr. 2022 9 809621 10.3389/fnut.2022.809621 35369082 PMC8971783 Arcusa, R. et al. Potential Role of Ginger (Zingiber officinale Roscoe) in the Prevention of Neurodegenerative Diseases. Front Nutr. 9 35369082 10.3389/fnut.2022.809621 PMC8971783 13. Ahmad B A Review on Pharmacological Properties of Zingerone (4-(4-Hydroxy-3-methoxyphenyl)-2-butanone) ScientificWorldJournal 2015 2015 816364 10.1155/2015/816364 26106644 PMC4461790 Ahmad, B. et al. A Review on Pharmacological Properties of Zingerone (4-(4-Hydroxy-3-methoxyphenyl)-2-butanone). ScientificWorldJournal 2015 26106644 10.1155/2015/816364 PMC4461790 14. Muehlschlegel JD Using next-generation RNA sequencing to examine ischemic changes induced by cold blood cardioplegia on the human left ventricular myocardium transcriptome Anesthesiology 2015 122 537 550 10.1097/ALN.0000000000000582 25581909 PMC4333028 Muehlschlegel, J. D. et al. Using next-generation RNA sequencing to examine ischemic changes induced by cold blood cardioplegia on the human left ventricular myocardium transcriptome. Anesthesiology 122 25581909 10.1097/ALN.0000000000000582 PMC4333028 15. Hasin Y Seldin M Lusis A Multi-omics approaches to disease Genome Biol. 2017 18 83 10.1186/s13059-017-1215-1 28476144 PMC5418815 Hasin, Y., Seldin, M. & Lusis, A. Multi-omics approaches to disease. Genome Biol. 18 28476144 10.1186/s13059-017-1215-1 PMC5418815 16. Liu M Curculigoside attenuates oxidative stress and osteoclastogenesis via modulating Nrf2/NF-κB signaling pathway in RAW264.7 cells J. Ethnopharmacol. 2021 275 114129 10.1016/j.jep.2021.114129 33878416 Liu, M. et al. Curculigoside attenuates oxidative stress and osteoclastogenesis via modulating Nrf2/NF-κB signaling pathway in RAW264.7 cells. J. Ethnopharmacol. 275 33878416 10.1016/j.jep.2021.114129 17. Tao, L. et al. Exerkine FNDC5/irisin-enriched exosomes promote proliferation and inhibit ferroptosis of osteoblasts through interaction with Caveolin-1. Aging Cell 23 10.1111/acel.14181 PMC11320359 38689463 18. Stockwell BR Ferroptosis: A Regulated Cell Death Nexus Linking Metabolism, Redox Biology, and Disease Cell 2017 171 273 285 10.1016/j.cell.2017.09.021 28985560 PMC5685180 Stockwell, B. R. et al. Ferroptosis: A Regulated Cell Death Nexus Linking Metabolism, Redox Biology, and Disease. Cell 171 28985560 10.1016/j.cell.2017.09.021 PMC5685180 19. Wu DJ Autophagy-linked FYVE containing protein WDFY3 interacts with TRAF6 and modulates RANKL-induced osteoclastogenesis J. Autoimmun. 2016 73 73 84 10.1016/j.jaut.2016.06.004 27330028 PMC5003737 Wu, D. J. et al. Autophagy-linked FYVE containing protein WDFY3 interacts with TRAF6 and modulates RANKL-induced osteoclastogenesis. J. Autoimmun. 73 27330028 10.1016/j.jaut.2016.06.004 PMC5003737 20. Jiang X Stockwell BR Conrad M Ferroptosis: mechanisms, biology and role in disease Nat. Rev. Mol. Cell Biol. 2021 22 266 282 10.1038/s41580-020-00324-8 33495651 PMC8142022 Jiang, X., Stockwell, B. R. & Conrad, M. Ferroptosis: mechanisms, biology and role in disease. Nat. Rev. Mol. Cell Biol. 22 33495651 10.1038/s41580-020-00324-8 PMC8142022 21. Dixon SJ Ferroptosis: an iron-dependent form of nonapoptotic cell death Cell 2012 149 1060 1072 10.1016/j.cell.2012.03.042 22632970 PMC3367386 Dixon, S. J. et al. Ferroptosis: an iron-dependent form of nonapoptotic cell death. Cell 149 22632970 10.1016/j.cell.2012.03.042 PMC3367386 22. Manolagas SC From estrogen-centric to aging and oxidative stress: a revised perspective of the pathogenesis of osteoporosis Endocr. Rev. 2010 31 266 300 10.1210/er.2009-0024 20051526 PMC3365845 Manolagas, S. C. From estrogen-centric to aging and oxidative stress: a revised perspective of the pathogenesis of osteoporosis. Endocr. Rev. 31 20051526 10.1210/er.2009-0024 PMC3365845 23. Chandi, C. M. et al. Reactive oxygen species derived from Nox4 mediate BMP2 gene transcription and osteoblast differentiation. Biochem. J. 433 10.1042/BJ20100357 PMC4539275 21029048 24. Chi, Z. et al. Oxidative stress: A common pathological state in a high-risk population for osteoporosis. Biomed. Pharmacother. 163 10.1016/j.biopha.2023.114834 37163779 25. Mengyu, L. et al. Genistein mitigates senescence of bone marrow mesenchymal stem cells via ERRα-mediated mitochondrial biogenesis and mitophagy in ovariectomized rats. Redox Biol. 61 10.1016/j.redox.2023.102649 PMC9995482 36871183 26. Yu Z., Jianhong Y. Activation of the PI3K/Akt pathway by oxidative stress mediates high glucose-induced increase of adipogenic differentiation in primary rat osteoblasts. J. Cell. Biochem. 114 10.1002/jcb.24607 23757055 27. Tareck, R. & Stéphanie, L. High Glucose Level Impairs Human Mature Bone Marrow Adipocyte Function Through Increased ROS Production. Front. Endocrinol. 10 10.3389/fendo.2019.00607 PMC6746912 31551934 28. Hiroki, E. et al. Role of tissue factor in delayed bone repair induced by diabetic state in mice. Plos One 16 10.1371/journal.pone.0260754 PMC8638858 34855855 29. Badgley MA Cysteine depletion induces pancreatic tumor ferroptosis in mice Science 2020 368 85 89 10.1126/science.aaw9872 32241947 PMC7681911 Badgley MA et al. Cysteine depletion induces pancreatic tumor ferroptosis in mice. Science 368 32241947 10.1126/science.aaw9872 PMC7681911 30. Purroy R Medina-Carbonero M Ros J Tamarit J Frataxin-deficient cardiomyocytes present an altered thiol-redox state which targets actin and pyruvate dehydrogenase Redox Biol. 2020 32 101520 10.1016/j.redox.2020.101520 32279039 PMC7152683 Purroy, R., Medina-Carbonero, M., Ros, J. & Tamarit, J. Frataxin-deficient cardiomyocytes present an altered thiol-redox state which targets actin and pyruvate dehydrogenase. Redox Biol. 32 32279039 10.1016/j.redox.2020.101520 PMC7152683 31. Ou Y Wang SJ Li D Chu B Gu W Activation of SAT1 engages polyamine metabolism with p53-mediated ferroptotic responses Proc. Natl Acad. Sci. USA 2016 113 E6806 e6812 10.1073/pnas.1607152113 27698118 PMC5098629 Ou, Y., Wang, S. J., Li, D., Chu, B. & Gu, W. Activation of SAT1 engages polyamine metabolism with p53-mediated ferroptotic responses. Proc. Natl Acad. Sci. USA 113 27698118 10.1073/pnas.1607152113 PMC5098629 32. Bersuker K The CoQ oxidoreductase FSP1 acts parallel to GPX4 to inhibit ferroptosis Nature 2019 575 688 692 10.1038/s41586-019-1705-2 31634900 PMC6883167 Bersuker, K. et al. The CoQ oxidoreductase FSP1 acts parallel to GPX4 to inhibit ferroptosis. Nature 575 31634900 10.1038/s41586-019-1705-2 PMC6883167 33. Zhong Z NFATc1-mediated expression of SLC7A11 drives sensitivity to TXNRD1 inhibitors in osteoclast precursors Redox Biol. 2023 63 102711 10.1016/j.redox.2023.102711 37148740 PMC10184050 Zhong, Z. et al. NFATc1-mediated expression of SLC7A11 drives sensitivity to TXNRD1 inhibitors in osteoclast precursors. Redox Biol. 63 37148740 10.1016/j.redox.2023.102711 PMC10184050 34. Liu Y Gu W p53 in ferroptosis regulation: the new weapon for the old guardian Cell Death Differ. 2022 29 895 910 10.1038/s41418-022-00943-y 35087226 PMC9091200 Liu, Y. & Gu, W. p53 in ferroptosis regulation: the new weapon for the old guardian. Cell Death Differ. 29 35087226 10.1038/s41418-022-00943-y PMC9091200 35. Li J Herba Patriniae and its component Isovitexin show anti-colorectal cancer effects by inducing apoptosis and cell-cycle arrest via p53 activation Biomed. Pharmacother. 2023 168 115690 10.1016/j.biopha.2023.115690 37939611 Li, J. et al. Herba Patriniae and its component Isovitexin show anti-colorectal cancer effects by inducing apoptosis and cell-cycle arrest via p53 activation. Biomed. Pharmacother. 168 37939611 10.1016/j.biopha.2023.115690 36. Oda E Noxa, a BH3-only member of the Bcl-2 family and candidate mediator of p53-induced apoptosis Science 2000 288 1053 1058 10.1126/science.288.5468.1053 10807576 Oda, E. et al. Noxa, a BH3-only member of the Bcl-2 family and candidate mediator of p53-induced apoptosis. Science 288 10807576 10.1126/science.288.5468.1053 37. Zeng C SHARPIN promotes cell proliferation of cholangiocarcinoma and inhibits ferroptosis via p53/SLC7A11/GPX4 signaling Cancer Sci. 2022 113 3766 3775 10.1111/cas.15531 35968603 PMC9633309 Zeng, C. et al. SHARPIN promotes cell proliferation of cholangiocarcinoma and inhibits ferroptosis via p53/SLC7A11/GPX4 signaling. Cancer Sci. 113 35968603 10.1111/cas.15531 PMC9633309 38. Qu X Sun Z Wang Y Ong HS Zoledronic acid promotes osteoclasts ferroptosis by inhibiting FBXO9-mediated p53 ubiquitination and degradation PeerJ 2021 9 e12510 10.7717/peerj.12510 35003915 PMC8684721 Qu, X., Sun, Z., Wang, Y. & Ong, H. S. Zoledronic acid promotes osteoclasts ferroptosis by inhibiting FBXO9-mediated p53 ubiquitination and degradation. PeerJ 9 35003915 10.7717/peerj.12510 PMC8684721 39. Molavinia S Nikravesh M Pashmforoosh M Vardanjani HR Khodayar MJ Zingerone Alleviates Morphine Tolerance and Dependence in Mice by Reducing Oxidative Stress-Mediated NLRP3 Inflammasome Activation Neurochem Res 2024 49 415 426 10.1007/s11064-023-04043-2 37864024 Molavinia, S., Nikravesh, M., Pashmforoosh, M., Vardanjani, H. R. & Khodayar, M. J. Zingerone Alleviates Morphine Tolerance and Dependence in Mice by Reducing Oxidative Stress-Mediated NLRP3 Inflammasome Activation. Neurochem Res 49 37864024 10.1007/s11064-023-04043-2 ",
  "metadata": {
    "Title of this paper": "Zingerone Alleviates Morphine Tolerance and Dependence in Mice by Reducing Oxidative Stress-Mediated NLRP3 Inflammasome Activation",
    "Journal it was published in:": "Communications Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474940/"
  }
}