{
  "title": "Paper_101",
  "abstract": "J Vis Exp J Vis Exp 319 nihpa Journal of visualized experiments : JoVE 1940-087X pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12488367 PMC12488367.1 12488367 12488367 NIHMS1790937 33522511 10.3791/61900 NIHMS1790937 NIHPA1790937 1 Article Specimen Collection and Analysis of the Duodenal Microbiome Dreskin Benjamin W. 1 Luu Kayti 1 Dong Tien S. 1 2 3 Benhammou Jihane 1 2 4 Langishetty Venu 2 3 Vu John 1 Sanford Daniel 1 Durazo Francisco 2 4 Agopian Vatche G. 4 Jacobs Jonathan P. 1 2 3 Pisegna Joseph R. 1 5 Hussain Shehnaz K. 6 1 2 3 4 5 6 Corresponding authors: Benjamin W. Dreskin, Kayti Luu, Shenaz K. Hussain, benjamin.dreskin@va.gov kayti.luu@va.gov shehnaz.hussain@cshs.org DISCLOSURES: The authors have no competing financial conflicts of interest to report. 12 1 2021 12 1 2021 167 498135 10.3791/61900 28 03 2022 02 10 2025 03 10 2025 03 10 2025 Shifts in the microbiome have been correlated with the physiology and pathophysiology of many organ systems both in humans and in mouse models. The gut microbiome has been typically studied through fecal specimen collections. The ease of obtaining fecal samples has resulted in many studies that have revealed information concerning the distal luminal gastrointestinal tract. However, few studies have addressed the importance of the microbiome in the proximal gut. Given that the duodenum is a major site for digestion and absorption, its microbiome is relevant to nutrition and liver disease and warrants further investigation. Here we detail a novel method for sampling the proximal luminal and mucosal gut microbiome in human subjects undergoing upper endoscopy by obtaining duodenal aspirate and biopsies. Specimen procurement is facile and unaffected by artifacts such as patient preparatory adherence, as might be the case in obtaining colonic samples during colonoscopy. The preliminary results show that the luminal and mucosal microbiomes differ significantly, which is likely related to environmental conditions and barrier functions. Therefore, a combination of duodenal aspirate and biopsies reveal a more comprehensive picture of the microbiome in the duodenum. Biopsies are obtained from the descending and horizontal segments of the duodenum, which are anatomically close to the liver and biliary tree. This is important in studying the role of bile acid biology and the gut-liver axis in liver disease. Biopsies and aspirate can be used for 16S ribosomal RNA sequencing, metabolomics, and other similar applications. SUMMARY: In this manuscript, we discuss a novel method to sample and analyze the duodenal microbiome. This method provides an accurate depiction of microbial diversity and composition in the duodenum and could be useful for further investigation of the duodenal microbiome. Duodenal microbiome Liver cirrhosis Diet upper endoscopy 16S rRNA sequencing microbiome pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Specimen Collection and Analysis of the Duodenal Microbiome",
    "Journal it was published in:": "Journal of visualized experiments : JoVE",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488367/"
  }
}