{
  "title": "Paper_664",
  "abstract": "pmc Diabetes Metab Syndr Obes Diabetes Metab Syndr Obes 1441 dmso dmso Diabetes, Metabolic Syndrome and Obesity 1178-7007 Dove Press PMC12476180 PMC12476180.1 12476180 12476180 41019499 10.2147/DMSO.S539822 539822 1 Original Research Long-Term Efficacy Trajectories of GLP-1 Receptor Agonists: A Systematic Review and Network Meta-Analysis Li et al Li et al http://orcid.org/0009-0009-2774-6826 Li Zixuan  1 * Han Zhoubo  1 * Sun Rong  2 Xuan Xiuping  3 Huang Chenghu  1 1 Department of Endocrinology, Bishan Hospital of Chongqing Medical University Bishan Chongqing 402760 People’s Republic of China 2 Department of Ophthalmology, Taihe Hospital, Hubei University of Medical Shiyan Hubei 442000 People’s Republic of China 3 Department of Endocrinology, The First Affiliated Hospital of Guangxi Medical University Nanning Guangxi 530021 People’s Republic of China Correspondence: Chenghu Huang, Department of Endocrinology, Bishan Hospital of Chongqing Medical University Bishan Chongqing 402760 People’s Republic of China Tel +86-023-41522901 * These authors contributed equally to this work 23 9 2025 2025 18 478865 3611 3624 16 5 2025 19 8 2025 23 09 2025 28 09 2025 29 09 2025 © 2025 Li et al. 2025 Li et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Purpose To investigate the long-term efficacy and changing trajectories of glucagon-like peptide-1 receptor agonists (GLP-1RAs) among patients with type 2 diabetes. Methods The PubMed, Embase and Cochrane Library databases were searched up to March 2024 to identify randomized controlled trials that assessed the efficacy of GLP-1RAs compared with placebo. To further explore the long-term trajectories of GLP-1RAs, we also conducted subgroup analyses of the placebo-subtracted groups based on the follow-up periods: 12–18 weeks, 24–30 weeks, 48–56 weeks, 68–78 weeks and ≥ 104 weeks. Results Fifty-five trials involving 18,876 participants were included in this meta-analysis. GLP-1RAs significantly improved HbA1c levels, body weight, fasting plasma glucose (FPG), systolic blood pressure, and serum lipid levels. GLP-1RAs continuously reduced HbA1c and FPG for at least 104 weeks, with the largest reductions observed at 12–18 weeks (versus placebo, WMD −0.99 [−1.09, −0.89], P < 0.001; −1.56 [−1.82. −1.29], P < 0.001, respectively). However, the reductions in HbA1c and FPG at ≥ 104 weeks were approximately 0.36% and 0.47 mmol/L less than the reductions at 12–18 weeks, respectively. With respect to weight loss, the optimal effect was observed at 24–30 weeks (WMD −2.42 [−2.90, −1.95], P < 0.001), followed by a plateau period. In addition, GLP-1RAs were associated with a greater risk of hypoglycemia and gastrointestinal adverse events. Conclusion GLP-1RAs are recommended for long-term treatment of patients with type 2 diabetes due to the persistent improvement in glycemic control and weight loss. However, it is important to account for the weakening effects after 2 years. Keywords glucagon-like peptide 1 receptor agonists type 2 diabetes network meta-analysis systematic review Chongqing Natural Science Foundation Scientific and Technological Project of Chongqing Bishan The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the paper Chenghu Huang received funding from the Chongqing Natural Science Foundation (No.CSTB2022NSCQ-MSX1096) and the Scientific and Technological Project of Chongqing Bishan (No.BSKJ2024072). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the paper. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Type 2 diabetes mellitus (T2DM) has become a significant global public health concern, especially affecting about 12.02% of people in China according to the latest prediction. 1 2–4 5 6 7 8 9 Several antidiabetic drugs, especially sulfonylureas and insulin, play a role in controlling blood glucose levels but also lead to increased risks of weight gain and hypoglycemia. 10–12 13 14 15 16 17 Furthermore, given the chronic nature of T2DM, which requires lifelong treatment, it is equally crucial to assess the efficacy and durability of GLP-1RAs for long-term use. 18 19 12 20–25 22 Therefore, we conducted this meta-analysis to assess the long-term efficacy and safety of GLP-1RAs in patients with T2DM. Furthermore, we described the trajectory of the effects of GLP-1RAs on glycemic control and body weight by comparing the placebo-subtracted differences between different follow-up periods. Materials and Methods This study was conducted following the Cochrane Collaboration Guidelines and reported in accordance with the PRISMA (Preferred Reporting Items for Systematic Reviews and Meta-analysis) statement. We registered the protocol in PROSPERO (CRD42024533999). Data Sources and Searches This study is a systematic review and meta-analysis evaluating the duration of efficacy and safety of GLP-1 receptor agonists for the treatment of type 2 diabetes. An extensive search of PubMed, Embase, and the Cochrane Central Register of Controlled Trials (CENTRAL) was performed from database inception to March 2024. The detailed search strategies can be found in Table S1 Study Selection We selected fully published randomized controlled trials (RCTs) in adults with T2DM for whom the treatment period was at least 24 weeks. Eligible trials compared the efficacy and safety between GLP-1RAs approved by the FDA and placebo. The maintenance doses of interest were as follows: dulaglutide 1.5 mg once weekly (QW), exenatide 10 μg twice daily (BID), exenatide 2 mg QW, semaglutide 14 mg once daily (QD), semaglutide 1 mg QW, liraglutide 1.8 mg QD, albiglutide 30 mg QW, lixisenatide 20 μg QD and tirzepatide 15 mg QW. 26 27 Studies were excluded if they (1) were observational, open-label or crossover study designs or secondary analyses of the included trials; (2) lacked information on the interventions and outcomes of interest; or (3) were published in a non-English language. Fixed-dose combinations of GLP-1 receptor agonists and other antidiabetic drugs were also perceived as ineligible. The primary efficacy measures for this network meta-analysis were the changes from baseline in HbA1c or body weight. The secondary efficacy endpoints included changes in fasting plasma glucose (FPG), systolic blood pressure (SBP), diastolic blood pressure (DBP), and serum lipid levels (including triglyceride, total cholesterol, HDL cholesterol and LDL cholesterol) from baseline. The safety endpoints were the incidence of hypoglycemic episodes (including severe hypoglycemia), gastrointestinal events, acute pancreatitis, and thyroid cancer. Data Extraction and Quality Assessment Our study summarized numerous RCTs with follow-up durations ranging from 24 weeks to 3 years. Owing to the significant variability and limited number of trials conducted over 2 years, we chose 104 weeks as the longest analysis time point. Moreover, we merged data from more than 104 weeks and discussed them together within 104 weeks. As such, we analyzed five time points in the subgroup analysis: 12–18, 24–30, 48–56, 68–78 and ≥104 weeks. Two authors independently performed the literature search and extracted study data on the basis of the predesigned criteria, and any discrepancies were resolved by a third reviewer. The following data were extracted from each article: first author, year of study, trial registration number, patients’ demographic characteristics, study duration, study arms, and outcomes of interest. Changes from baseline at each time point were collected directly from the articles when available or calculated from the baseline and follow-up values. Furthermore, we derived the values of other follow-ups from graphs provided by using the WebPlotDigitizer program available online ( https://wpd.starrydata2.org/ 28 Data Synthesis and Statistical Analysis First, random-effects pairwise meta-analyses were carried out for direct comparisons. We conducted subgroup analyses on the basis of different GLP-1RAs and follow-ups. Subsequently, frequentist random effects network meta-analyses were performed to assess the transitivity assumption regarding efficacy between different follow-ups. The efficacy of placebo-subtracted differences was discussed separately in the network meta-analysis. Meta-regression analysis was performed using Stata 17.0 to explore heterogeneity sources (I² > 50%). Pre-selected primary moderators included drug type, background therapy, and baseline characteristics (age, diabetes duration, proportion of females, weight, BMI and HbA1c). Results Study Characteristics A total of 12,891 articles were initially retrieved via the search strategy ( Figure 1 Figure 1 Flow diagram of study selection. The characteristics of the included studies are presented in Table S2 Figures S1 2 Figure 2 The interval plot of efficacy on placebo-subtracted comparison between different follow-ups. ( A B C D Efficacy Outcomes Pooled Analysis The results regarding the efficacy of the treatment compared with the placebo are presented in Table 1 Table 1 Summary of Results of Efficacy Changes Comparing GLP-1RAs with Placebo in T2DM Patients Comparison No. of Comparisons Participants (GLP-1RAs/ Placebo) Overall Effect Heterogeneity Outcomes Subgroups Pooled Results WMD (95% CI) P Tau² I², % P % HbA1c Overall 58 10,941/8269 −1.00 [−1.11, −0.90] < 0.001 0.14 91 < 0.001 Dulaglutide 1.5 mg QW 7 1312/866 −1.02 [−1.18, −0.86] < 0.001 0.03 72 0.002 Exenatide 10 μg BID 10 1281/1028 −0.80 [−0.96, −0.63] < 0.001 0.04 68 < 0.001 Exenatide 2 mg QW 1 231/230 −0.73 [−0.95, −0.51] < 0.001 NA NA NA Semaglutide 14 mg QD 5 852/714 −1.28 [−1.40, −1.16] < 0.001 0.01 35 0.190 Semaglutide 1.0 mg QW 4 815/816 −1.47 [−1.68, −1.25] < 0.001 0.04 78 0.004 Liraglutide 1.8 mg QD 12 2106/1564 −1.02 [−1.15, −0.89] < 0.001 0.03 69 <0.001 Albiglutide 30 mg QW 5 976/542 −0.90 [−1.11, −0.70] < 0.001 0.04 72 0.006 Lixisenatide 20 μg QD 10 2763/1908 −0.54 [−0.65, −0.43] < 0.001 0.01 49 0.040 Tirzepatide 15 mg QW 4 605/601 −1.94 [−2.23, −1.66] < 0.001 0.06 77 0.005 Weight Overall 58 10,941/8269 −2.24 [−2.71, −1.77] < 0.001 3.06 94 < 0.001 (kg) Dulaglutide 1.5 mg QW 7 1312/866 −1.64 [−2.19, −1.09] < 0.001 0.34 68 0.005 Exenatide 10 μg BID 10 1281/1028 −1.80 [−2.41, −1.20] < 0.001 0.63 72 < 0.001 Exenatide 2 mg QW 1 231/230 −1.50 [−2.21, −0.79] < 0.001 NA NA NA Semaglutide 14 mg QD 5 852/714 −2.93 [−3.71, −2.14] < 0.001 0.62 79 < 0.001 Semaglutide 1.0 mg QW 4 815/816 −4.07 [−4.65, −3.49] < 0.001 0.14 40 0.170 Liraglutide 1.8 mg QD 12 2106/1564 −2.01 [−2.61, −1.41] < 0.001 0.84 77 < 0.001 Albiglutide 30 mg QW 5 976/542 0.58 [0.18, 0.97] 0.004 0.00 0 0.440 Lixisenatide 20 μg QD 10 2763/1908 −0.84 [−1.10, −0.58] < 0.001 0.06 37 0.120 Tirzepatide 15 mg QW 4 605/601 −8.80 [−9.62, −7.99] < 0.001 0.25 37 0.190 FPG Overall 53 10,657/8011 −1.37 [−1.55, −1.18] < 0.001 0.40 86 < 0.001 (mmol/L) Dulaglutide 1.5 mg QW 6 1258/815 −1.50 [−1.95, −1.05] < 0.001 0.25 85 < 0.001 Exenatide 10 μg BID 9 1253/1010 −0.98 [−1.32, −0.65] < 0.001 0.16 63 0.005 Exenatide 2 mg QW 1 231/230 −0.67 [−1.17, −0.17] 0.009 NA NA NA Semaglutide 14 mg QD 5 852/714 −1.76 [−1.96, −1.56] < 0.001 0.00 0 0.530 Semaglutide 1.0 mg QW 4 815/816 −1.86 [−2.09, −1.63] < 0.001 0.01 18 0.300 Liraglutide 1.8 mg QD 11 1960/1426 −1.61 [−1.89, −1.34] < 0.001 0.11 59 0.006 Albiglutide 30 mg QW 5 976/542 −1.56 [−1.87, −1.25] < 0.001 0.03 23 0.270 Lixisenatide 20 μg QD 10 2760/1908 −0.54 [−0.72, −0.37] < 0.001 0.00 0 0.550 Tirzepatide 15 mg QW 3 552/550 −2.58 [−3.30, −1.85] < 0.001 0.33 83 0.002 SBP Overall 36 6347/4931 −3.53 [−4.27, −2.80] < 0.001 2.35 49 < 0.001 (mmHg) Dulaglutide 1.5 mg QW 4 876/429 −2.60 [−4.09, −1.10] < 0.001 0.00 0 0.650 Exenatide 10 μg BID 5 698/492 −3.98 [−5.92, −2.04] 0.001 1.42 29 0.230 Exenatide 2 mg QW 1 231/230 −1.90 [−4.39, 0.59] 0.140 NA NA NA Semaglutide 14 mg QD 5 852/714 −3.43 [−6.47, −0.38] 0.002 9.43 79 < 0.001 Semaglutide 1.0 mg QW 4 815/816 −4.66 [−6.79, −2.52] < 0.001 2.64 57 0.070 Liraglutide 1.8 mg QD 11 1872/1450 −2.68 [−3.92, −1.44] < 0.001 1.60 38 0.100 Albiglutide 30 mg QW 2 398/199 −3.61 [−5.96, −1.25] 0.003 0.00 0 0.710 Tirzepatide 15 mg QW 4 605/601 −5.51 [−7.03, −3.99] < 0.001 0.00 0 0.500 DBP Overall 33 5680/4580 −0.90 [−1.31, −0.50] < 0.001 0.38 28 0.070 (mmHg) Dulaglutide 1.5 mg QW 4 876/429 −0.69 [−1.65, 0.27] 0.160 0.00 0 0.450 Exenatide 10 μg BID 5 698/492 −2.00 [−3.14, −0.86] < 0.001 0.41 24 0.260 Exenatide 2 mg QW 1 231/230 0.10 [−1.56, 1.76] 0.910 NA NA NA Semaglutide 14 mg QD 5 852/714 −1.01 [−2.17, 0.15] 0.090 0.74 43 0.130 Semaglutide 1.0 mg QW 4 815/816 −0.19 [−1.07, 0.69] 0.680 0.05 6 0.360 Liraglutide 1.8 mg QD 10 1712/1411 −0.18 [−0.82, 0.47] 0.590 0.00 0 0.640 Albiglutide 30 mg QW 1 101/99 −0.90 [−3.31, 1.51] 0.460 NA NA NA Tirzepatide 15 mg QW 4 605/601 −2.19 [−3.09, −1.28] < 0.001 0.00 0 0.890 TG Overall 17 2803/2201 −0.26 [−0.39, −0.14] < 0.001 0.04 91 < 0.001 (mmol/L) Dulaglutide 1.5 mg QW 2 333/192 −0.41 [−0.68, −0.14] 0.003 0.01 17 0.270 Exenatide 10 μg BID 2 372/239 0.02 [−0.19, 0.23] 0.860 0.02 58 0.120 Exenatide 2 mg QW 1 231/230 0.02 [0.01, 0.03] 0.001 NA NA NA Liraglutide 1.8 mg QD 6 865/740 −0.21 [−0.34, −0.09] < 0.001 0.00 0 0.600 Albiglutide 30 mg QW 2 397/199 −0.19 [−0.42, 0.03] 0.100 0.00 0 0.450 Tirzepatide 15 mg QW 4 605/601 −0.49 [−0.68, −0.30] < 0.001 0.03 78 0.004 TC Overall 18 2896/2234 −0.19 [−0.27, −0.11] < 0.001 0.02 61 < 0.001 (mmol/L) Dulaglutide 1.5 mg QW 2 333/192 −0.30 [−0.60, −0.01] 0.040 0.03 61 0.110 Exenatide 10 μg BID 3 465/272 −0.11 [−0.20, −0.02] 0.020 0.00 0 0.950 Exenatide 2 mg QW 1 231/230 −0.05 [−0.27, 0.17] 0.660 NA NA NA Liraglutide 1.8 mg QD 6 865/740 −0.10 [−0.22, 0.03] 0.130 0.01 29 0.220 Albiglutide 30 mg QW 2 397/199 −0.11 [−0.33, 0.11] 0.320 0.01 47 0.170 Tirzepatide 15 mg QW 4 605/601 −0.40 [−0.59, −0.20] < 0.001 0.03 72 0.010 HDL-C Overall 18 2758/2057 0.01 [−0.01, 0.03] 0.480 0.00 57 0.002 (mmol/L) Dulaglutide 1.5 mg QW 2 333/192 0.02 [−0.01, 0.06] 0.220 0.00 0 0.530 Exenatide 10 μg BID 4 537/307 −0.01 [−0.04, 0.03] 0.760 0.00 35 0.200 Exenatide 2 mg QW 1 231/230 −0.04 [−0.09, 0.01] 0.150 NA NA NA Liraglutide 1.8 mg QD 5 655/528 −0.00 [−0.04, 0.03] 0.970 0.00 42 0.140 Albiglutide 30 mg QW 2 397/199 −0.01 [−0.05, 0.03] 0.660 0.00 27 0.240 Tirzepatide 15 mg QW 4 605/601 0.05 [−0.01, 0.11] 0.11 0.00 82 < 0.001 LDL-C Overall 17 2686/2022 −0.11 [−0.17, −0.05] < 0.001 0.01 44 0.030 (mmol/L) Dulaglutide 1.5 mg QW 2 333/192 −0.15 [−0.28, −0.02] 0.020 0.00 5 0.310 Exenatide 10 μg BID 3 465/272 −0.06 [−0.14, 0.01] 0.100 0.00 0 0.800 Exenatide 2 mg QW 1 231/230 −0.04 [−0.23, 0.15] 0.690 NA NA NA Liraglutide 1.8 mg QD 5 655/528 −0.04 [−0.13, 0.05] 0.420 0.00 0 0.720 Albiglutide 30 mg QW 2 397/199 −0.06 [−0.20, 0.08] 0.380 0.00 14 0.280 Tirzepatide 15 mg QW 4 605/601 −0.26 [−0.43, −0.09] 0.003 0.02 72 0.010 Notes Abbreviations As shown in Table S3 Subgroup Analysis Based on Follow-Up Duration As shown in Table 2 Figure S3 Table S4 Table 2 Subgroup Analysis on Efficacy Changes by Follow-Up Comparing GLP-1RAs with Placebo in T2DM Patients Comparison No. of Comparisons Participants (GLP-1RAs/ Placebo) Overall Effect Heterogeneity Outcomes Subgroups Pooled Results WMD (95% CI) P Tau² I², % P % HbA1c 12-18 weeks 53 10,010/7333 −0.99 [−1.09, −0.89] < 0.001 0.13 92 < 0.001 24-30 weeks 57 10,719/8047 −1.00 [−1.11, −0.89] < 0.001 0.15 91 < 0.001 48-56 weeks 12 2854/2071 −1.07 [−1.35, −0.80] < 0.001 0.22 96 < 0.001 68-78 weeks 4 1333/978 −0.99 [−1.50, −0.47] < 0.001 0.26 96 < 0.001 ≥104 weeks 4 816/465 −0.44 [−0.58, −0.29] < 0.001 0.01 45 0.140 Weight 12-18 weeks 43 8084/6422 −2.18 [−2.58, −1.79] < 0.001 1.51 93 < 0.001 (kg) 24-30 weeks 53 9960/7711 −2.42 [−2.90, −1.95] < 0.001 2.84 94 < 0.001 48-56 weeks 8 2038/1606 −3.85 [−6.02, −1.69] < 0.001 9.14 97 < 0.001 68-78 weeks 3 1036/878 −5.66 [−11.36, 0.03] 0.050 24.98 99 < 0.001 FPG 12-18 weeks 30 6638/4557 −1.56 [−1.82, −1.29] < 0.001 0.48 90 < 0.001 (mmol/L) 24-30 weeks 55 10,797/8148 −1.35 [−1.54, −1.16] < 0.001 0.40 86 < 0.001 48-56 weeks 11 2452/1669 −1.68 [−2.14, −1.22] < 0.001 0.53 90 < 0.001 68-78 weeks 4 1253/736 −1.23 [−2.17, −0.29] 0.010 0.86 94 < 0.001 ≥104 weeks 4 816/465 −1.18 [−1.41, −0.96] < 0.001 0.00 0 0.660 SBP 12-18 weeks 7 1193/1254 −3.61 [−4.65, −2.57] < 0.001 0.00 0 0.980 (mmHg) 24-30 weeks 33 5638/4417 −3.46 [−4.26, −2.66] < 0.001 2.69 52 < 0.001 48-56 weeks 8 1809/1331 −3.36 [−4.32, −2.39] < 0.001 0.00 0 0.930 68-78 weeks 2 714/718 −3.83 [−6.07, −1.59] < 0.001 1.23 47 0.170 Abbreviations Placebo-Subtracted Differences To further explore the long-term effects of GLP-1RAs on T2DM, we synchronously compared the placebo-subtracted group at each follow-up point via network meta-analysis. The network maps of efficacy at each follow-up point are shown in Figure S4 Figure S5 Table S5 The results of the network meta-analysis examining placebo-subtracted differences in lowering HbA1c are presented in Figure 2A Table 3A Table 3 League Tables of Placebo-Subtracted Differences for GLP-1RAs in Efficacy by Follow-Up (A)∆HbA1c and ∆Weight 12-18 weeks −0.65 (−0.97, −0.32) −1.20 (−1.90, −0.51) −1.85 (−2.91, −0.79) – 0.02 (−0.03, 0.06) 24-30 weeks −0.55 (−1.25, 0.14) −1.20 (−2.26, −0.14) – −0.01 (−0.10, 0.07) −0.03 (−0.11, 0.05) 48-56 weeks −0.65 (−1.79, 0.50) – −0.03 (−0.15, 0.09) −0.05 (−0.17, 0.07) −0.02 (−0.14, 0.11) 68-78 weeks – −0.36 (−0.49, −0.22) −0.37 (−0.50, −0.24) −0.34 (−0.48, −0.20) −0.32 (−0.49, −0.15) ≥ 104 weeks (B)∆FPG and ∆SBP 12-18 weeks −0.90 (−1.82, 0.01) −1.08 (−2.23, 0.07) 0.24 (−1.55, 2.04) – −0.08 (−0.22, 0.07) 24-30 weeks −0.17 (−1.11, 0.77) 1.15 (−0.61, 2.90) – −0.06 (−0.29, 0.17) 0.02 (−0.21, 0.24) 48-56 weeks 1.32 (−0.49, 3.13) – −0.25 (−0.60, 0.09) −0.18 (−0.51, 0.16) −0.19 (−0.56, 0.17) 68-78 weeks – −0.47 (−0.81, −0.13) −0.39 (−0.73, −0.05) −0.41 (−0.76, −0.05) −0.21 (−0.66, 0.23) ≥ 104 weeks Notes Abbreviations The results of placebo-subtracted differences in decreasing body weight are presented in Figure 2B Table 3A Similarly, the greatest reduction in FPG levels occurred at 12–18 weeks, followed by obvious deterioration after 104 weeks. There were no significant differences detected between the follow-up points of 12–18, 24–30, 48–56 and 68–76 weeks ( Figure 2C Table 3B Figure 2D Table 3B In addition, we explored the placebo-subtracted differences based on treatment protocols, such as different medication methods and background treatments ( Tables S6 11 Intragroup Differences We also compared the intragroup differences via pairwise meta-analysis ( Table S12 Safety Outcomes A summary of the overall safety and selected adverse events (AEs) is shown in Table 4 2 2 2 2 29 Table 4 Safety of GLP-1RAs Compared with Placebo in T2DM Patients by Follow-Up Comparison No. of Comparisons Participants(GLP-1RAs/ Placebo) Overall Effect Heterogeneity Outcomes Subgroups Pooled Results RR (95% CI) P Tau² I², % P Adverse events (AEs) Overall 50 9666/6954 1.11 [1.08, 1.15] <0.001 0.01 50 <0.001 (N) 24-30 weeks 36 6720/5002 1.14 [1.09, 1.18] <0.001 0.01 44 0.003 48-56 weeks 9 1690/1173 1.08 [1.02, 1.15] 0.009 0.00 52 0.030 68-78 weeks 4 1358/1038 1.02 [0.97, 1.08] 0.450 0.00 42 0.160 ≥ 104 weeks 1 302/101 1.34 [0.52, 3.47] 0.550 NA NA NA Serious adverse Overall 57 10,720/7876 0.95 [0.84, 1.08] 0.460 0.00 0 0.470 Events (SAEs) (N) 24-30 weeks 43 7774/5933 0.96 [0.81, 1.14] 0.650 0.02 7 0.350 48-56 weeks 9 1690/1173 0.90 [0.65, 1.24] 0.520 0.05 23 0.240 68-78 weeks 4 1047/723 0.91 [0.70, 1.17] 0.460 0.00 0 0.730 ≥ 104 weeks 1 302/101 0.93 [0.51, 1.68] 0.800 NA NA NA Withdrawal due to Overall 58 10,962/8280 2.11 [1.74, 2.56] <0.001 0.18 36 0.004 AEs (N) 24-30 weeks 44 7909/5952 2.23 [1.76, 2.83] <0.001 0.22 40 0.005 48-56 weeks 9 1690/1173 1.97 [1.21, 3.20] 0.006 0.23 43 0.080 68-78 weeks 4 1358/1038 1.41 [0.98, 2.05] 0.070 0.00 0 0.820 ≥ 104 weeks 1 302/101 1.34 [0.52, 3.47] 0.550 NA NA NA Total hypoglycemia Overall 54 10,436/7966 1.51 [1.31, 1.73] <0.001 0.11 63 <0.001 (N) 24-30 weeks 41 7650/5817 1.61 [1.36, 1.91] <0.001 0.14 68 <0.001 48-56 weeks 8 1530/1096 1.27 [0.97, 1.67] 0.080 0.04 27 0.210 68-78 weeks 4 1358/1038 1.58 [0.86, 2.94] 0.140 0.22 57 0.070 ≥ 104 weeks 1 302/101 0.87 [0.32, 2.38] 0.790 NA NA NA Severe hypoglycemia Overall 51 10,026/7330 1.87 [0.89, 3.91] 0.100 0.00 0 0.960 (N) 24-30 weeks 40 7405/5379 1.87 [0.73, 4.77] 0.190 0.00 0 0.910 48-56 weeks 6 961/812 2.77 [0.67, 11.56] 0.160 0.00 0 0.900 68-78 weeks 4 1358/1038 NA NA NA NA NA ≥ 104 weeks 1 302/101 NA NA NA NA NA Gastrointestinal Overall 33 6980/5029 2.06 [1.82, 2.33] <0.001 0.09 72 <0.001 Adverse events (N) 24-30 weeks 27 5466/4022 2.17 [1.92, 2.45] <0.001 0.06 60 <0.001 48-56 weeks 3 582/428 1.47 [1.18, 1.82] <0.001 0.01 22 0.280 68-78 weeks 3 1047/723 2.07 [1.44, 3.00] 0.008 0.09 84 0.002 ≥ 104 weeks 1 302/101 0.97 [0.72, 1.30] 0.830 NA NA NA Nausea Overall 54 10,355/7593 3.40 [2.93, 3.94] <0.001 0.14 55 <0.001 (N) 24-30 weeks 41 7569/5727 3.73 [3.17, 4.38] <0.001 0.12 50 <0.001 48-56 weeks 8 1530/1096 2.51 [1.61, 3.90] <0.001 0.22 62 0.010 68-78 weeks 4 1358/1038 3.09 [2.22, 4.29] <0.001 0.06 56 0.080 ≥ 104 weeks 1 302/101 0.94 [0.49, 1.81] 0.860 NA NA NA Diarrhea Overall 51 10,007/7254 1.77 [1.58, 1.99] <0.001 0.02 9 0.280 (N) 24-30 weeks 38 7221/5388 1.81 [1.55, 2.12] <0.001 0.03 15 0.210 48-56 weeks 8 1530/1096 1.58 [1.22, 2.04] <0.001 0.01 6 0.380 68-78 weeks 4 1358/1038 1.37 [0.82, 2.28] 0.230 0.22 83 <0.001 ≥ 104 weeks 1 302/101 1.16 [0.61, 2.17] 0.650 NA NA NA Vomiting Overall 49 9713/7134 3.95 [3.33, 4.69] <0.001 0.00 0 0.510 (N) 24-30 weeks 38 7125/5468 4.50 [3.61, 5.61] <0.001 0.04 9 0.320 48-56 weeks 6 1332/896 2.35 [1.52, 3.62] <0.001 0.00 0 0.880 68-78 weeks 4 1358/1038 4.07 [1.91, 8.07] <0.001 0.38 69 0.020 ≥ 104 weeks 1 302/101 5.69 [0.77, 42.19] 0.090 NA NA NA Pancreatitis Overall 34 6710/5232 0.83 [0.29, 2.37] 0.720 0.00 0 0.870 (N) 24-30 weeks 22 3843/3158 0.99 [0.14, 7.01] 0.990 0.91 0 0.340 48-56 weeks 8 1530/1096 0.47 [0.09, 2.37] 0.360 0.78 0 0.680 68-78 weeks 3 1035/877 1.01 [0.18, 5.79] 0.990 0.79 0 0.380 ≥ 104 weeks 1 302/101 1.68 [0.08, 34.77] 0.740 NA NA NA Abbreviations Certainty of Evidence and Network Inconsistency After applying the CINeMA framework to evaluate certainty, we found low confidence in short-to-medium term outcomes due to imprecision and inconsistency ( Table S13 The global inconsistency (chi 2 Table S14 Table S15 Table S15 Discussion In summary, similar to previous studies, our network meta-analysis demonstrated that GLP-1RAs had positive effects on improving blood glucose, body weight, systolic blood pressure, and serum lipid levels in T2DM patients. However, this is the first study to present the long-term efficacy trajectory of GLP-1RAs by comparing the placebo-subtracted between different follow-ups. We found that the optimal effects on lowering HbA1c and FPG levels were observed at 12–18 weeks, with a significant deterioration starting at 104 weeks. These trajectories were hook-shaped. In addition, the greatest reductions in body weight and SBP were observed at 24–30 and 12–18 weeks, respectively, after which both parameters reached a plateau. Our study revealed that GLP-1RAs significantly improved glycemic control within 104 weeks. Consistent with our results, a real-world study conducted in Belgium revealed that the efficacy of lowering HbA1c levels persisted for four years, 20 25 20 25 22 For long-term glycemic control, maintaining weight loss has also emerged as a key factor, 30 31 22 However, there was a trend of these effects to weaken over time. In our study, the effect of reducing HbA1c levels at ≥ 104 weeks was 0.36% smaller than than that at 12–18 weeks. A similar trend was observed for FPG, which was 0.47 mmol/L higher at ≥ 104 weeks than at 12–18 weeks. This aligns with a 3-year pooled analysis of exenatide QW, which reported diminished HbA1c reduction between weeks 52 and 156. 32 33 34 32–35 Another important factor in the long-term management of T2DM is blood pressure, which is related to the risk of long-term cardiovascular complications. The present study revealed that GLP-1RAs had a positive effect on systolic blood pressure but not diastolic blood pressure at 68–78 weeks. The exact mechanism responsible for the blood pressure-lowering effects of GLP-1RAs has not been fully elucidated, but it has been suggested that the blood pressure reduction caused by GLP-1RA treatment might be in part due to weight loss. 36 37 With respect to safety outcomes, we found that GLP-1 receptor agonists were associated with an increased risk of gastrointestinal adverse events for at least 68–78 weeks. However, there was no increase in the incidence of withdrawal from 68–78 weeks. The increased risk of hypoglycemia occurred mainly at 24–30 weeks. It seemed that long-term use of GLP-1RAs did not increase the risk of side effects, indicating possible tolerance development over time. Similar trends in safety outcomes over time were also described in a review. 12 This study also has potential limitations. First, we chose only GLP-1RAs approved by the FDA, with only one dose selected for each drug, resulting in narrow coverage. Second, we included trials with primary outcomes restricted to changes in HbA1c levels or body weight, which led to missing data from some large sample trials. Third, as differences in baseline characteristics of participants and follow-up duration among included studies were varied, the accuracy of the findings could be influenced. Fourth, our exclusion of non-English language studies may limit the comprehensiveness of our search. Fifth, we combined all the included GLP-1RAs to analyze the overall trajectory; however, the effects of different GLP-1RAs varied greatly. For example, albiglutide had no effect on weight loss, whereas tirzepatide markedly reduced body weight (−8.80 [−9.62, −7.99], P < 0.001). This difference may have led to some bias. Finally, meta-regression failed to identify significant sources of heterogeneity for HbA1c and weight changes. This indicates that some potential confounders were either not consistently reported across studies or could not be adequately adjusted for in this meta-analysis. Conclusion In summary, GLP-1RAs demonstrate sustained long-term efficacy for glycemic control and weight management, with optimal effects observed at 12–18 weeks and 24–30 weeks. While the effects of lowering HbA1c and FPG attenuated after 104 weeks, the trend of weight loss plateaued until 68–78 weeks. Therefore, GLP-1RAs are recommended for long-term treatment for patients with type 2 diabetes, but clinicians should monitor for potential efficacy changes beyond 2 years. Data Sharing Statement All data generated or analyzed during this study are included in this published article and as supplementary information files. Ethics Approval and Informed Consent This article is based on previously conducted studies and does not contain any new studies with human participants or animals performed by any of the authors. Consent for Publication All authors confirm that they have read the paper and consent to its submission. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The authors report no conflicts of interest in this work. References 1. Zhang H Jia Q Song P Incidence, prevalence, and burden of type 2 diabetes in China: trend and projection from 1990 to 2050 Chin Med J 2025 138 12 1447 1455 10.1097/CM9.0000000000003536 40375461 PMC12180826 2. Sever B Altıntop MD Demir Y An extensive research on aldose reductase inhibitory effects of new 4H-1,2,4-triazole derivatives J Mol Struct 2021 1224 129446 10.1016/j.molstruc.2020.129446 3. Ruze R Liu T Zou X Obesity and type 2 diabetes mellitus: connections in epidemiology, pathogenesis, and treatments Front Endocrinol 2023 14 1161521 10.3389/fendo.2023.1161521 PMC10161731 37152942 4. Allocca S Monda A Messina A Endocrine and metabolic mechanisms linking obesity to type 2 diabetes: implications for targeted therapy Healthcare 2025 13 12 1437 10.3390/healthcare13121437 40565464 PMC12193533 5. Feldstein AC Nichols GA Smith DH Weight change in diabetes and glycemic and blood pressure control Diabetes Care 2008 31 10 1960 1965 10.2337/dc08-0426 18697899 PMC2551635 6. Li YY Yang YM Zhu S Changes in body weight and cardiovascular risk factors in a Chinese population with type 2 diabetes mellitus: a longitudinal study Front Endocrinol 2023 14 1112855 10.3389/fendo.2023.1112855 PMC10130380 37124734 7. Klein S Gastaldelli A Yki-Järvinen H Scherer PE Why does obesity cause diabetes? Cell Metab 2022 34 1 11 20 10.1016/j.cmet.2021.12.012 34986330 PMC8740746 8. Wysham C Shubrook J Beta-cell failure in type 2 diabetes: mechanisms, markers, and clinical implications Postgraduate Med 2020 132 8 676 686 10.1080/00325481.2020.1771047 32543261 9. ElSayed NA Aleppo G Aroda VR 8. obesity and weight management for the prevention and treatment of type 2 diabetes: standards of care in diabetes-2023 Diabetes Care 2023 46 Suppl 1 S128 s139 10.2337/dc23-S008 36507637 PMC9810466 10. Turner RC Cull CA Frighi V Holman RR Glycemic control with diet, sulfonylurea, metformin, or insulin in patients with type 2 diabetes mellitus: progressive requirement for multiple therapies (UKPDS 49). UK Prospective Diabetes Study (UKPDS) Group JAMA 1999 281 21 2005 2012 10.1001/jama.281.21.2005 10359389 11. Gallwitz B Vaag A Falahati A Madsbad S Adding liraglutide to oral antidiabetic drug therapy: onset of treatment effects over time Int J Clin Pract 2010 64 2 267 276 10.1111/j.1742-1241.2009.02265.x 19925617 12. Courtney H Nayar R Rajeswaran C Jandhyala R Long-term management of type 2 diabetes with glucagon-like peptide-1 receptor agonists Diabetes Metab Syndr Obes 2017 10 79 87 10.2147/DMSO.S126763 28331351 PMC5357070 13. Park JS Kim KS Choi HJ Glucagon-like peptide-1 and hypothalamic regulation of satiation: cognitive and neural insights from human and animal studies Diabetes Metab J 2025 49 3 333 347 10.4093/dmj.2025.0106 40367985 PMC12086555 14. Drucker DJ Efficacy and safety of GLP-1 medicines for type 2 diabetes and obesity Diabetes Care 2024 47 11 1873 1888 10.2337/dci24-0003 38843460 15. Li S Vandvik PO Lytvyn L SGLT-2 inhibitors or GLP-1 receptor agonists for adults with type 2 diabetes: a clinical practice guideline BMJ 2021 373 n1091 10.1136/bmj.n1091 33975892 16. Wu S Gao L Cipriani A The effects of incretin‐based therapies on β‐cell function and insulin resistance in type 2 diabetes: a systematic review and network meta‐analysis combining 360 trials Diabetes Obesity Metab 2019 21 4 975 983 10.1111/dom.13613 30536884 17. Zhu D Society C Guideline for the prevention and treatment of type 2 diabetes mellitus in China (2020 edition) Chin J Endocrinol Metab 2021 37 311 398 10.3760/cma.j.cn311282-20210304-00142 18. Kim HS Cho YK Kim MJ Jung CH Park J-Y Lee WJ Durability of glucose-lowering effect of dulaglutide in patients with type 2 diabetes mellitus: a real-world data study Front Endocrinol 2022 13:1032793 10.3389/fendo.2022.1032793 PMC9659594 36387922 19. Tan X Liang Y Gamble C King A Durability of effectiveness between users of once-weekly semaglutide and dipeptidyl peptidase 4 inhibitors (DPP–4i) in US adults with type 2 diabetes Diabetes Therapy 2023 15 2 427 445 10.1007/s13300-023-01509-y 38060149 PMC10838880 20. Hemmer A Maiter D Buysschaert M Preumont V Long-term effects of GLP-1 receptor agonists in type 2 diabetic patients: a retrospective real-life study in 131 patients Diabetes Metab Syndr 2019 13 1 332 336 10.1016/j.dsx.2018.09.007 30641721 21. Alexander JT Staab EM Wan W The longer-term benefits and harms of glucagon-like peptide-1 receptor agonists: a systematic review and meta-analysis J Gen Intern Med 2022 37 2 415 438 10.1007/s11606-021-07105-9 34508290 PMC8810987 22. Yao H Zhang A Li D Comparative effectiveness of GLP-1 receptor agonists on glycaemic control, body weight, and lipid profile for type 2 diabetes: systematic review and network meta-analysis BMJ 2024 384:e076410 10.1136/bmj-2023-076410 PMC10823535 38286487 23. Tsapas A Karagiannis T Kakotrichi P Comparative efficacy of glucose-lowering medications on body weight and blood pressure in patients with type 2 diabetes: a systematic review and network meta-analysis Diabetes Obes Metab 2021 23 9 2116 2124 10.1111/dom.14451 34047443 24. Tan X Liang Y Gamble C King A Durability of effectiveness between users of once-weekly semaglutide and dipeptidyl peptidase 4 Inhibitors (DPP-4i) in US Adults with Type 2 Diabetes Diabetes Ther 2024 15 2 427 445 10.1007/s13300-023-01509-y 38060149 PMC10838880 25. Tofé S Argüelles I Mena E Real‐world GLP‐1 RA therapy in type 2 diabetes: a long‐term effectiveness observational study Endocrinol Diabetes Metabol 2018 2 1 e00051 10.1002/edm2.51 PMC6354754 30815578 26. Xia L Shen T Dong W Comparative efficacy and safety of 8 GLP-1RAs in patients with type 2 diabetes: a network meta-analysis Diabetes Res Clin Pract 2021 177:108904 10.1016/j.diabres.2021.108904 34102249 27. Nauck MA Quast DR Wefers J Meier JJ GLP-1 receptor agonists in the treatment of type 2 diabetes – state-of-the-art Mol Metabol 2021 46:101102 10.1016/j.molmet.2020.101102 PMC8085572 33068776 28. Higgins JP Altman DG Gøtzsche PC The Cochrane Collaboration’s tool for assessing risk of bias in randomised trials BMJ 2011 343 d5928 10.1136/bmj.d5928 22008217 PMC3196245 29. Ahrén B Johnson SL Stewart M HARMONY 3: 104-week randomized, double-blind, placebo- and active-controlled trial assessing the efficacy and safety of albiglutide compared with placebo, sitagliptin, and glimepiride in patients with type 2 diabetes taking metformin Diabetes Care 2014 37 8 2141 2148 10.2337/dc14-0024 24898304 30. Ard J Fitch A Fruh S Herman L Weight loss and maintenance related to the mechanism of action of glucagon-like peptide 1 receptor agonists Adv Ther 2021 38 6 2821 2839 10.1007/s12325-021-01710-0 33977495 PMC8189979 31. Shinde S Thieu VT Kwan AYM Houghton K Meyers J Schapiro D Impact of weight change on glycemic control and metabolic parameters in T2D: a retrospective US study based on real-world data Diabetes Therapy 2023 15 2 409 426 10.1007/s13300-023-01511-4 38038898 PMC10838891 32. Trautmann ME Van Gaal L Han J Hardy E Three-year efficacy and safety of exenatide once weekly: a pooled analysis of three trials J Diabet Complicat 2017 31 9 1415 1422 10.1016/j.jdiacomp.2017.06.004 28669463 33. Rasouli N Younes N Ghosh A longitudinal effects of glucose-lowering medications on β-cell responses and insulin sensitivity in type 2 diabetes: the GRADE randomized clinical trial Diabetes Care 2024 47 4 580 588 10.2337/dc23-1070 38211595 PMC10973918 34. Janket SJ Chatanaka MK Sohaei D Tamimi F Meurman JH Diamandis EP Does incretin agonism have sustainable efficacy? Cells 2024 13 22 1842 10.3390/cells13221842 39594592 PMC11592889 35. Utzschneider KM Younes N Butera NM Impact of insulin sensitivity and β-cell function over time on glycemic outcomes in the glycemia reduction approaches in diabetes: a comparative effectiveness study (grade): differential treatment effects of dual therapy Diabetes Care 2024 47 4 571 579 10.2337/dc23-1059 38190619 PMC10973903 36. Horton ES Silberman C Davis KL Berria R Weight loss, glycemic control, and changes in cardiovascular biomarkers in patients with type 2 diabetes receiving incretin therapies or insulin in a large cohort database Diabetes Care 2010 33 8 1759 1765 10.2337/dc09-2062 20460445 PMC2909058 37. Hu M Cai X Yang W Zhang S Nie L Ji L Effect of hemoglobin a1c reduction or weight reduction on blood pressure in glucagon-like peptide-1 receptor agonist and sodium-glucose cotransporter-2 inhibitor treatment in type 2 diabetes mellitus: a meta-analysis J Am Heart Assoc 2020 9 7 e015323 10.1161/JAHA.119.015323 32223390 PMC7428598 ",
  "metadata": {
    "Title of this paper": "Effect of hemoglobin a1c reduction or weight reduction on blood pressure in glucagon-like peptide-1 receptor agonist and sodium-glucose cotransporter-2 inhibitor treatment in type 2 diabetes mellitus: a meta-analysis",
    "Journal it was published in:": "Diabetes, Metabolic Syndrome and Obesity",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476180/"
  }
}