{
  "title": "Paper_656",
  "abstract": "pmc Bone Res Bone Res 2670 boneres Bone Research 2095-4700 2095-6231 Nature Publishing Group PMC12476454 PMC12476454.1 12476454 12476454 41015585 10.1038/s41413-025-00456-7 456 1 Review Article Unraveling the mechanisms of bone diseases: targeting dendritic cells in osteoimmunology for internal homeostasis balance Chen Yanqi 1 Wang Siyuan 2 Chen Xiaoyu 2 Wu Zhifang 1 http://orcid.org/0000-0002-0302-4492 He Fuming hfm@zju.edu.cn 2 Chen Qianming qmchen@zju.edu.cn 3 1 https://ror.org/041yj5753 grid.452802.9 Department of Pediatrics, Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine, Zhejiang Province Clinical Research Center for Oral Disease, Key Laboratory of Oral Biomedical Research of Zhejiang Province, Cancer Center of Zhejiang University, Engineering Research Center of Oral Biomaterials and Devices of Zhejiang Province, 2 https://ror.org/041yj5753 grid.452802.9 Department of Prosthodontics, Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine, Zhejiang Province Clinical Research Center for Oral Disease, Key Laboratory of Oral Biomedical Research of Zhejiang Province, Cancer Center of Zhejiang University, Engineering Research Center of Oral Biomaterials and Devices of Zhejiang Province, 3 https://ror.org/041yj5753 grid.452802.9 Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine, Zhejiang Province Clinical Research Center for Oral Disease, Key Laboratory of Oral Biomedical Research of Zhejiang Province, Cancer Center of Zhejiang University, Engineering Research Center of Oral Biomaterials and Devices of Zhejiang Province, 28 9 2025 2025 13 478106 81 6 9 2024 5 6 2025 26 6 2025 28 09 2025 29 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Bone repair and regeneration is a complex spatiotemporal process recruiting a variety of cell types, which need to precisely mediated for effective healing post-damage. The concept of osteoimmunology emphasizes the extensive and intricate crosstalk between the bone and the immune system. Despite the significant advancements in understanding osteoimmunology, the precise role of dendritic cells (DCs) in this field remains under investigation. As key antigen-presenting cells, DCs are critical in orchestrating adaptive immune responses and maintaining tissue homeostasis. Recent researches have further revealed the potential of DCs to influence the development or acceleration of inflammatory and autoimmune bone disease, as well as their interaction with skeletal cells in the context of bone repair and regeneration. Therefore, an in-depth understanding of DCs in the osteoimmunology would be valuable. Herein, we discuss the effects of DCs on bone homeostasis and bone-related diseases (i.e., rheumatoid arthritis (RA), periodontitis, bone regeneration, and other bone abnormalities diseases), and introduce the innovative DCs-targeting biomaterials, aimed at promoting bone repair and regeneration. Furthermore, we summarize the underlying crosstalk between DCs and other cells (i.e., osteoclasts, mesenchymal stromal stem cells (MSCs), hematopoietic stem and progenitor cells (HSPCs), T and B cells) in the bone homeostasis and bone-related diseases. In conclusion, we propose that osteoimmunology offers a promising perspective for unraveling the mechanisms of bone-related diseases; meanwhile, targeting DCs from the perspective of osteoimmunology may provide innovative ideas and resolutions to achieve the internal homeostasis balance.  Subject terms Bone Pathogenesis National Key R&D Program of China (2022YFC2402900) Start-up Fund of Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine (2023PDF017) National Natural Science Foundation of China (No. 82271026) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © West China School of Stomatology Sichuan University 2025 Introduction Bone diseases are common clinical conditions that can severely impair function and diminish the quality of life. 1 2 3 4 5 6 7 Based on the observation of bone growth disruption and restructuration in autoimmune diseases, Arron and Choi put forward the term ‘osteoimmunology’ in 2000 first to delineate the intricate regulatory interactions between the bone and immune system. 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 Herein, we examine the current understanding of DCs in the osteoimmunology, focusing on their distribution, heterogeneity and functional changes associated with the occurrence and progression of bone-related diseases, such as RA, periodontitis and other bone abnormalities diseases. We also explore their role in maintaining bone homeostasis. Additionally, we summarize the underlying crosstalk between DCs and various cell types, including OCs, OBs, HSPCs, T and B cells within the bone microenvironment. Furthermore, we introduce novel strategies concerning the role of DCs in bone-related diseases, including DCs-targeted vaccines, epigenetic reprogramming, and DCs-targeted biomaterials aimed at promoting bone repair and regeneration. We anticipate that this review will provide valuable insights into potential therapeutic targets for achieving a balance in bone homeostasis, serving as a cornerstone for the future development of treatment modalities. Overview of DCs DCs serve as the bridge between innate and adaptive immunity As early as the mid 1970s, Prof. Ralph Steinma characterized and nominated a particular subgroup with ‘dendritic’ morphology in the spleens with DCs as effective stimulator of innate immune response. 23 24 25 26 DCs derived from bone marrow myeloid progenitor cells from HSPCs in a Flt3L-dependent manner 27 28 1 27 28 29 30 1 31 32 32 17 32 Fig. 1 Dendritic cell (DCs) subtypes involved in bone homeostasis and disease. DCs are a highly heterogeneous population of antigen-presenting cells (APCs) that can be classified into distinct subpopulations based on their ontogeny, phenotype, and function. DCs originate from bone marrow myeloid progenitor cells (MDPs) derived from hematopoietic stem and progenitor cells (HSPCs). These progenitors can give rise to common dendritic cell progenitors (CDPs), which further differentiate into two major types: conventional DCs progenitors (pre-cDCs), which develop into cDCs in the periphery, and plasmacytoid DCs progenitors (pre-pDCs), which differentiate into pDCs in the bone marrow. Other subtypes of DCs, including Langerhans cells (LCs) and interstitial DCs (intDCs), are localized in the epithelium, while bone marrow DCs (BMDCs) are found in the bone marrow. Additionally, inflammatory DCs (infDCs) are present at peripheral inflammation sites. Functionally, immature DCs (iDCs) can encounter danger signals, resulting in their maturation into mature DCs (mDCs) and promotion of immune responses. Conversely, when iDCs encounter self-antigens without sufficient co-stimulatory signals, they differentiate into tolerogenic DCs (tolDCs) and induce immunomodulation. Mo monocyte, RBC red blood cell Although the current classification of DCs in the bone marrow microenvironment is less elucidated as in the spleen or tumor, more subsets of DCs are being explored by the development of novel high-throughput tools including single‐cell RNA sequencing (scRNA-seq), such as BMDCs, 13 33 34 35 36 1 Bone marrow-resident dendritic cells (BMDCs) BMDCs consisted of a small population of bone marrow cells (1%–2%), which organized into perivascular clusters enveloping sinusoid and venules without direct contacting the vessel walls indicated by two-photon intravital microscopy. 33 + chi + + + - - + - + 33 33 + - 13 Bone marrow has been acknowledged as a primary lymphoid organ accommodating HSPCs and lymphocytes, 33 37 13 + 33 38 33 In addition to the critical role in regulating the activity and differentiation of T cells via RANK/RANKL axis and secretion of osteoclastogenesis-related cytokine, 39 40 37 41 DCs and bone-related diseases Periodontitis Periodontitis is a chronic inflammatory bone disease induced by dysbiosis of the oral microbiota and host immune response, the latter of which is mainly characterized by dysregulation of T cell and DCs responses 42 2 43 14 Fig. 2 The effects of dendritic cells (DCs) in periodontitis. Periodontitis is a chronic inflammatory disease induced by dysbiosis of the oral microbiota and host immune response, characterized by alterations in the distribution and function of DCs subsets. In the lamina propria, mature interstitial DCs (intDCs) play a central role in driving the immune response and contributing to tissue destruction. These cells mediate antigen presentation to T cells, leading to the activation of effector immune responses that promote bone resorption. In contrast, Langerhans cells (LCs), primarily residing in the gingival epithelium, exert a protective role by inhibiting excessive production of interferon γ (IFN-γ), and increasing the number of regulatory T cells (Tregs). Oral pathogens, such as Porphyromonas gingivalis P. gingivalis Murine and clinical studies have highlighted that gingival DCs have special localization and function in the pathogenesis of periodontitis. 44 45 + + + + 45 + 46 47 48 49 48 50 Decreased LCs and increased pDCs were observed in the gingiva of periodontitis patients, accompanied by increased expression of proinflammatory cytokines IL-1β, IFN-α, and IFN-γ and suppressed expression of anti-inflammatory cytokines IL-10 45 45 51 + + + + + 52 53 + + 43 + Porphyromonas gingivails (P. gingivalis) + 35 + + 35 35 P. gingivalis- 34 One possible reason for LCs migrating from the diseased situ is associated with the long-term inflammation and the increased commensal load induced by pathogen. 54 + + + + + + + 55 56 57 58 59 Furthermore, the adaptive immune response induced by DCs in periodontitis is also influenced by oral pathogens to a large extent. P. gingivalis 60 39 61 62 P. gingivalis 15 E. coli P. gingivalis 61 62 P. gingivalis P. gingivalis 63 P. gingivalis 64 P. gingivalis 42 P. gingivalis 65 66 68 Based on the above studies, oral DCs and LCs are closely related to periodontitis, 15 + 50 54 DCs are closely related to the occurrence and development of periodontitis due to their critical role in monitoring and reacting to biofilms, giving rise to DCs-based immunotherapy in addition to the traditional treatments for periodontitis. 50 69 70 P. gingivalis 71 72 19 20 50 Rheumatoid arthritis (RA) Rheumatoid arthritis (RA) is a typical autoimmune disease characterized by chronic inflammation and synovial hyperplasia, eventually leading to bone destruction. 73 74 + 75 76 + 77 37 78 79 80 37 78 79 16 3 75 76 Fig. 3 The effects of dendritic cells (DCs) in rheumatoid arthritis (RA). In RA, a chronic autoimmune disease, immature DCs (iDCs) migrate from the blood vessels into the inflamed synovial tissue, where they mature and trigger an effector immune response. These mature DCs (mDCs) activate naive CD4 + + Physiologically, there are two main subsets differentiated from CDPs: cDCs and pDCs. 27 28 + + + 3 36 81 82 When Mo leave the blood and infiltrate inflammatory synovial tissue, the process of Mo-to-DCs transition is influenced by a variety of environmental factors. Among these environmental factors, four appear to be particularly relevant in the context of RA 83 + 84 + + + + + 84 In terms of function, infDCs play a critical role in the pathogenesis of RA, since they have the ability to stimulate the production of Th17 cells. 85 + 36 86 87 88 87 89 90 91 92 93 94 Not only that, under inflammatory pathological conditions, infDCs can directly convert into OCs to induce severe bone destruction, 95 77 Osteoclast. + + + + 96 97 98 Apart from subsets heterogeneity, RA alters the distribution of DCs and the functional markers expression. Research has shown a decrease in the proportion of cDCs and pDCs in the blood of RA patients, while the proportion of these cells in the synovial fluid was increased. 99 85 100 101 100 100 101 Moreover, the synovial microenvironment in RA induces metabolic and transcriptional reprogramming of DCs. 102 + + 102 102 103 103 In summary, the distribution, the subsets heterogeneity and alterations in key functions of DCs, such as cytokine secretion and migratory capacity, have been strongly correlated with the onset and progression of RA, leading to tolerance defects and increased inflammation. 85 104 105 106 107 108 109 Biomaterials-mediated bone repair and regeneration Osteoimmunomodulation has emerged as a critical concept in the development and evaluation of bone biomaterials. 110 111 12 Researchers in regenerative medicine acknowledged that excessive and prolonged adaptive immune response is detrimental to tissue regeneration, leading to failed regeneration or foreign body rejection. 110 112 17 113 17 18 114 115 115 116 Titanium (Ti) represented one of the most well-established materials in dental implantation and orthopedics. Nevertheless, Ti ions, nano/micro-particles, and bacterial antigens cumulated at the implant-bone interface can initiate peri-implant immune response and hamper osseointegration, possibly leading to aseptic loosening, infections, and subsequent bone loss. 117 118 2+ 2+ 119 This suggested that Ti ions could alter the phenotype and function of DCs, contributing to an Ti-related immune response and potentially initiating metal hypersensitivity and peri-implantitis. 119 120 121 121 122 122 21 4 Fig. 4 The effects of dendritic cells (DCs) in biomaterials-mediated bone repair and regeneration. The intrinsic physicochemical properties of biomaterials could modulate DCs polarization to influence bone healing and regeneration, such as surface chemistry, hydrophilicity, topography and spatial structures, roughness, and so on. Materials like pure titanium (PT) and sand-blasted, acid-etched titanium (SLA) surfaces promote DCs maturation, characterized by the upregulation of co-stimulatory molecules (e.g., CD40, CD80, CD86) and pro-inflammatory cytokines (e.g., IL-6, TNF-α), which drive immune activation and inflammation, potentially impairing bone healing. In contrast, modified surfaces such as modSLA or β-TCP induce a tolerogenic phenotype in DCs, marked by the downregulation of co-stimulatory molecules and the upregulation of anti-inflammatory cytokines (e.g., IL-10, TGF-β). These tolDCs foster a regulatory immune environment, enhancing osteoblast differentiation and supporting bone regeneration. mDCs mature dendritic cells, iDCs immature dendritic cells, tolDCs tolerogenic dendritic cells DCs also serve as the sentinel for bone grafts-induced immune responses. DCs seeded on porous β-tricalcium phosphate (β-TCP) showed a decrease in co-stimulatory molecules (i.e., CD40, CD86) and pro-inflammatory gene IFN-γ while an increase in anti-inflammatory genes (i.e., IL-1ra, IL-4 and IL-10, and TGF-β1). 22 22 110 Despite the progressively recognized role of DCs in immunoregulatory biomaterials, researches concerning their impact on biomaterial-mediated osseointegration were scarce. More importantly, the maturation of DCs seem not to be necessarily for the development of destructive inflammations, and it might be unilateral to determine the prognosis of implanted biomaterials solely based on DCs-biomaterial interactions. 12 Others In addition to the above-mentioned bone-related diseases, DCs are implicated in the development of nonunions, Langerhans cell hyperplasia (LCH), multiple myeloma (MM) and so on. LCH often involves severe bone destruction with DCs monoclonal hyperplasia as a pathological change. Research analyzing LCH bone biopsies has revealed a strong association between LCs and differentiated OCs-like cells, suggesting that abnormal antigen presentation may initiate the pathological activation and differentiation of DCs. 123 124 125 + 126 + 95 Interactions of DCs with other cells in bone microenvironment Osteoclast (OCs) OCs played distinguishable roles in manipulating bone remodeling, with extensive heterogeneity and plasticity. 37 37 127 128 37 78 79 5 95 + 80 125 129 130 Fig. 5 Cellular interactions between dendritic cells (DCs) and osteoclasts (OCs) in pathological conditions. Under inflammatory conditions, such as rheumatoid arthritis and periodontitis, DCs can directly transdifferentiate into OCs, contributing to inflammation-induced bone erosion. This process of DCs-OCs transdifferentiation is modulated through three major mechanisms: (1) In the presence of macrophage colony-stimulating factor (M-CSF) and receptor activator of nuclear factor kappa-Β ligand (RANKL), DCs differentiate into OCs efficiently, as shown in the yellow dashed box. This interaction is a key driver of osteoclastogenesis under inflammatory conditions; (2) RANKL, produced by Th1, Th2, and Treg cells, or IL-17, produced by Th17 cells, can enhance DC-mediated osteoclastogenesis in an inflammatory microenvironment, as illustrated in the blue dashed box; (3) DCs can promote osteoclastogenesis by secreting osteoclastogenic cytokines, such as IL-23 and IL-34, which facilitate OC differentiation, as shown in the green dashed box. HSPCs hematopoietic stem and progenitor cells, GMP granulocyte-macrophage progenitor, MDP myeloid progenitor cells, Mo monocyte, DDOC dendritic cell-derived osteoclast There are several lines of evidence supporting the possible link between DCs and OCs. Firstly, DCs and OCs both developed from hematopoietic stem cells (HSCs), of which Mo were the common precursors. 131 37 132 133 134 135 12 DCs-OCs transdifferentiation from Mo/Mφ precursor cells showed high plasticity depending on local factors and stimuli in the milieu. While DCs were traditionally regarded as terminally differentiated cells, recent studies have indicated that their differentiation can be further modulated by the surrounding microenvironment. 136 95 high -/- 11 95 77 92 77 + 77 77 In addition, DCs could contribute to inflammation-induced osteoclastogenesis during immune interactions with CD4 + 39 + 125 + + + + + 137 + + 80 138 + Furthermore, mDCs can promote osteoclastogenesis via secretion of related cytokins. IL-23 is a heterodimeric cytokine produced predominantly by macrophages and DCs, which has been demonstrated to upregulate RANK expression of myeloid precursor cells in a dose-dependent manner and thereby indirectly promotes osteoclastic differentiation. 129 139 Above all, hematopoietic stem/progenitor cells represent key origins of OCs under homeostasis, whereas OCs can further differentiate from DCs in inflammatory-related bone diseases. The plasticity of OCs development suggested its flexibility and adaptation under different pathological conditions. 37 125 39 T cells Among bone marrow cells, there are about 3% ~ 5% T cells. 140 141 142 143 126 144 126 11 145 Th1, Th2, Th17 and Treg are main subsets differentiate from naïve CD4 + 146 6 115 Fig. 6 Cellular interactions between dendritic cells (DCs) and T cells in bone remodeling and immune responses. DCs activate naive CD4 + In addition to the classical molecules mentioned above, DCs can also regulate the differentiation of T cells through unique cytokines in the bone environment. Th1 polarizing cytokines involve IL-12, IL-27 and IFN-γ, among which IL-12 is supposed to be the primary Th1 differentiation cytokine and is mainly produced by cDC1. 147 148 149 150 151 152 153 Accumulating evidence supports that cDC2 are major DCs subset implicated in Th2 differentiation in skin, 154 155 156 157 158 159 160 15 161 162 163 165 166 167 Th17 cells have been highlighted in the pathogenesis of bone loss disease since their discovery, 15 146 168 169 170 171 + 169 172 169 173 36 RANK/RANKL system is another important regulators of interactions between DCs and T cells in the bone environment, independent of CD80/86. 174 75 175 12 176 177 + 178 179 180 + 181 + 137 7 182 When meet harmless antigens such as self-antigens, DCs differentiate into tolDCs with preserved ability of antigen presentation but featured low expression of costimulatory molecules and pro-inflammatory cytokines such as IL-1β, IL-6, TNF-α, 183 184 185 186 + 187 175 148 188 190 191 192 193 194 195 185 B cell The bone marrow microenvironment formed a nurturing network for B lymphopoiesis and developing, 196 197 198 199 200 201 202 203 204 205 Unlike the way DCs interacting with T cells, B cells receive immune signals from DCs via the multiple BCRs on their surface 206 7 207 208 206 207 33 206 209 210 211 212 212 Fig. 7 Cellular interactions between dendritic cells (DCs) and B cells. DCs play a crucial role in the adaptive immune responses initiated by B cells, with B cells receiving immune signals from DCs via multiple B cell receptors (BCRs) on their surface, in contrast to the way DCs interact with T cells. The antigen presentation by DCs to B cells involves: (1) a variety of antigen forms held on DCs, including immune complexes of antigen, antibodies, and complement; (2) unique co-stimulatory signaling molecules, such as B cell activation factor (BAFF), A proliferation-inducing ligand (APRIL), and macrophage migration inhibitory factor (MIF); (3) immunoregulatory cytokines, including C-X-C motif ligand 13 (CXCL13), IL-6, TNF-α, and other cytokines that modulate inflammatory or tolerogenic responses. Additionally, direct cell-to-cell interactions such as CD40-CD40L signaling, and soluble factors secreted by DCs also influence B cell activation, survival, and differentiation in the bone marrow microenvironment. Given the limited interaction between DCs and B cells within the bone marrow environment, the mechanisms outlined above were primarily derived from studies examining the interactions between follicular dendritic cells (fDCs) and B cells. IgG immunoglobulin G DCs can directly influence B cell response through the production of soluble factors. DCs are a major source of a TNF family cytokine BAFF in the early phase of RA disease, which leads to the enhanced activation, proliferation, and differentiation of B cells. 213 214 215 216 217 33 DCs can also affect B cell response via direct cell-to-cell interaction. DCs were implicated in presenting antigens as ICs to B cells with multiple BCRs engaged simultaneously, subsequently inducing T cell-independent B cell activation. 207 208 218 219 219 220 221 DCs can regulate B cells response indirectly through other immune cells. In bone marrow, cDCs was found to rescue B lymphopoiesis indirectly through transdifferentiating into functional OCs which control the bone microenvironment and modulate B cell development. 222 223 222 In addition to antibody production and effector function, B cells are also known to be potent regulators of immune responses mediated by DCs. Activated B cells overexpress RANKL in the context of inflammatory bone diseases such as RA 224 225 Periodontitis and Rheumatoid arthritis 226 227 Mesenchymal stromal stem cells (MSCs) Mesenchymal stromal stem cells (MSCs) have exerted their reparative as well as immunoregulatory effects in innate and adaptive immune system. 228 229 228 230 Bone marrow mesenchymal stromal stem cells (BMSCs) have been profoundly applied in bone tissue engineering, concerning its multilineage differentiation potentials in adipogenesis, osteogenesis, and chondrogenesis. 231 232 233 233 234 + 235 236 + + + β 236 237 237 228 In addition to BMSCs, periosteum-derived mesenchymal stem cells (PCs) can potentially represent an oral tissue-engineering therapy for the ease of collection, ameliorated operation injuries, and rapid in situ engraftment. 238 239 230 Hematopoietic stem and progenitor cells (HSPCs) Recent study has confirmed the critical role of BMDCs in HSPCs trafficking, thereby contributing to the regulation of hematopoiesis and establishment of the stem cell niche. 13 dtr 13 13 In addition, a majority of BMDCs resided perivascularly, with high expression of chemokines and TLRs, suggesting its role in sensing and manipulating the hematopoietic response to microbes and inflammatory signals. 13 240 Conclusions and perspectives The past decade has witnessed remarkable expansion in the connotation of osteoimmunology while bone-derived regulation of the immune system is progressively unveiling. 241 11 12 13 240 95 125 142 213 110 228 230 However, the majority of studies predominantly focus on models of periodontitis and RA, with relatively few investigations addressing other bone-related disease models. Moreover, in vitro experiments frequently lack thorough in vivo validation and exploration of the underlying mechanisms. The direct interactions and regulatory mechanisms between skeletal cells and DCs also remain underexplored. Although there is a gradual increase in the application of DCs-based immunotherapies, such as DCs-targeted vaccines and epigenetic reprogramming, further research is necessary to elucidate the mechanisms of action and clinical efficacy of these innovative strategies. Additionally, these technologies currently do not integrate with bone regeneration approaches. Modifying biomaterial surface to endow DCs with immunomodulatory properties is expected to provide novel strategies for future orthopaedic surgery, trauma surgery, and implant repair in bone tissue engineering. 14 32 115 111 242 Supplementary information  Supplemental material Supplementary information The online version contains supplementary material available at 10.1038/s41413-025-00456-7. Acknowledgements This work was supported by the “Pioneer and Leading Goose +X” research and development program of Zhejiang Province Science and Technology Department (2024C03193), the National Natural Science Foundation of China (No. 82271026) and Start-up Fund of Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine (2023PDF017). Author contributions Q.M.C., F.M.H. and Y.Q.C. were responsible for designing this manuscript. Y.Q.C., S.Y.W., and X.Y.C. contributed to the writing of the manuscript. S.Y.W. and X.Y.C. were also responsible for designing and creating the figures. Prior to submission, Q.M.C., F.M.H. and Z.F.W. reviewed and edited the manuscript, with contributions from all other authors to a lesser extent. Q.M.C. and Z.F.W. supervised the project. All authors have approved the final version of the manuscript. Competing interests The authors declare no competing interests. References 1. Feng X Mcdonald JM Disorders of bone remodeling Annu. Rev. Pathol. 2011 6 121 145 10.1146/annurev-pathol-011110-130203 20936937 PMC3571087 Feng, X. & Mcdonald, J. M. Disorders of bone remodeling. Annu. Rev. Pathol. 6 20936937 10.1146/annurev-pathol-011110-130203 PMC3571087 2. Xiong Y The role of the immune microenvironment in bone, cartilage, and soft tissue regeneration: from mechanism to therapeutic opportunity Mil. Med. Res. 2022 9 65 36401295 10.1186/s40779-022-00426-8 PMC9675067 Xiong, Y. et al. The role of the immune microenvironment in bone, cartilage, and soft tissue regeneration: from mechanism to therapeutic opportunity. Mil. Med. Res. 9 36401295 10.1186/s40779-022-00426-8 PMC9675067 3. Armiento AR Hatt LP Sanchez Rosenberg G Thompson K Stoddart MJ Functional biomaterials for bone regeneration: a lesson in complex biology Adv. Funct. Mater. 2020 30 1909874 10.1002/adfm.201909874 Armiento, A. R., Hatt, L. P., Sanchez Rosenberg, G., Thompson, K. & Stoddart, M. J. Functional biomaterials for bone regeneration: a lesson in complex biology. Adv. Funct. Mater. 30 4. Shaddox LM Local inflammatory markers and systemic endotoxin in aggressive periodontitis J. Dent. Res. 2011 90 1140 1144 10.1177/0022034511413928 21730256 PMC3169885 Shaddox, L. M. et al. Local inflammatory markers and systemic endotoxin in aggressive periodontitis. J. Dent. Res. 90 21730256 10.1177/0022034511413928 PMC3169885 5. Sima C Glogauer M Macrophage subsets and osteoimmunology: tuning of the immunological recognition and effector systems that maintain alveolar bone Periodontol 2000 2013 63 80 101 10.1111/prd.12032 23931056 Sima, C. & Glogauer, M. Macrophage subsets and osteoimmunology: tuning of the immunological recognition and effector systems that maintain alveolar bone. Periodontol 2000 63 23931056 10.1111/prd.12032 6. Pacifici R T cells, osteoblasts, and osteocytes: interacting lineages key for the bone anabolic and catabolic activities of parathyroid hormone Ann. N. Y Acad. Sci. 2016 1364 11 24 10.1111/nyas.12969 26662934 PMC4803611 Pacifici, R. T cells, osteoblasts, and osteocytes: interacting lineages key for the bone anabolic and catabolic activities of parathyroid hormone. Ann. N. Y Acad. Sci. 1364 26662934 10.1111/nyas.12969 PMC4803611 7. Walsh MC Osteoimmunology: interplay between the immune system and bone metabolism Annu. Rev. Immunol. 2006 24 33 63 10.1146/annurev.immunol.24.021605.090646 16551243 Walsh, M. C. et al. Osteoimmunology: interplay between the immune system and bone metabolism. Annu. Rev. Immunol. 24 16551243 10.1146/annurev.immunol.24.021605.090646 8. Arron JR Choi Y Bone versus immune system Nature 2000 408 535 536 10.1038/35046196 11117729 Arron, J. R. & Choi, Y. Bone versus immune system. Nature 408 11117729 10.1038/35046196 9. Okamoto K Osteoimmunology: the conceptual framework unifying the immune and skeletal systems Physiol. Rev. 2017 97 1295 1349 10.1152/physrev.00036.2016 28814613 Okamoto, K. et al. Osteoimmunology: the conceptual framework unifying the immune and skeletal systems. Physiol. Rev. 97 28814613 10.1152/physrev.00036.2016 10. Takayanagi H Osteoimmunology: shared mechanisms and crosstalk between the immune and bone systems Nat. Rev. Immunol. 2007 7 292 304 10.1038/nri2062 17380158 Takayanagi, H. Osteoimmunology: shared mechanisms and crosstalk between the immune and bone systems. Nat. Rev. Immunol. 7 17380158 10.1038/nri2062 11. Alnaeeli M Park J Mahamed D Penninger JM Teng Y Dendritic cells at the osteo-immune interface: implications for inflammation-induced bone loss J. Bone Miner. Res. 2007 22 775 780 10.1359/jbmr.070314 17352656 Alnaeeli, M., Park, J., Mahamed, D., Penninger, J. M. & Teng, Y. Dendritic cells at the osteo-immune interface: implications for inflammation-induced bone loss. J. Bone Miner. Res. 22 17352656 10.1359/jbmr.070314 12. Plekhova, N. G., Lyapun, I. N., Gnedenkov, S., Sinebryukhov, S. & Mashtalyar, D. The role of dendritic cells in bone loss and repair. dendritic cells (2018). 13. Zhang J Bone marrow dendritic cells regulate hematopoietic stem progenitor cell trafficking J. Clin. Invest. 2019 129 2920 2931 10.1172/JCI124829 31039135 PMC6597218 Zhang, J. et al. Bone marrow dendritic cells regulate hematopoietic stem progenitor cell trafficking. J. Clin. Invest. 129 31039135 10.1172/JCI124829 PMC6597218 14. Yang N Liu Y The role of the immune microenvironment in bone regeneration Int. J. Med. Sci. 2021 18 3697 3707 10.7150/ijms.61080 34790042 PMC8579305 Yang, N. & Liu, Y. The role of the immune microenvironment in bone regeneration. Int. J. Med. Sci. 18 34790042 10.7150/ijms.61080 PMC8579305 15. Hathaway-Schrader JD Novince CM Maintaining homeostatic control of periodontal bone tissue Periodontology 2000 2021 86 157 187 10.1111/prd.12368 33690918 PMC8294452 Hathaway-Schrader, J. D. & Novince, C. M. Maintaining homeostatic control of periodontal bone tissue. Periodontology 2000 86 33690918 10.1111/prd.12368 PMC8294452 16. Santiago-Schwarz F Anand P Liu S Carsons SE Dendritic cells (DCs) in rheumatoid arthritis (RA): progenitor cells and soluble factors contained in RA synovial fluid yield a subset of myeloid DCs that preferentially activate Th1 inflammatory-type responses J. Immunol. 2001 167 1758 10.4049/jimmunol.167.3.1758 11466401 Santiago-Schwarz, F., Anand, P., Liu, S. & Carsons, S. E. Dendritic cells (DCs) in rheumatoid arthritis (RA): progenitor cells and soluble factors contained in RA synovial fluid yield a subset of myeloid DCs that preferentially activate Th1 inflammatory-type responses. J. Immunol. 167 11466401 10.4049/jimmunol.167.3.1758 17. Adu-Berchie K Mooney DJ Biomaterials as local niches for immunomodulation Acc. Chem. Res. 2020 53 1749 1760 10.1021/acs.accounts.0c00341 32786230 Adu-Berchie, K. & Mooney, D. J. Biomaterials as local niches for immunomodulation. Acc. Chem. Res. 53 32786230 10.1021/acs.accounts.0c00341 18. Gammon JM Jewell CM Engineering immune tolerance with biomaterials Adv. Health. Mater. 2019 8 e1801419 10.1002/adhm.201801419 PMC6384133 30605264 Gammon, J. M. & Jewell, C. M. Engineering immune tolerance with biomaterials. Adv. Health. Mater. 8 10.1002/adhm.201801419 PMC6384133 30605264 19. Elashiry M Dendritic cell derived exosomes loaded with immunoregulatory cargo reprogram local immune responses and inhibit degenerative bone disease in vivo J. Extracell. Vesicles 2020 9 1795362 10.1080/20013078.2020.1795362 32944183 PMC7480413 Elashiry, M. et al. Dendritic cell derived exosomes loaded with immunoregulatory cargo reprogram local immune responses and inhibit degenerative bone disease in vivo. J. Extracell. Vesicles 9 32944183 10.1080/20013078.2020.1795362 PMC7480413 20. Sands RW Tuning cytokines enriches dendritic cells and regulatory T cells in the periodontium J. Periodontol. 2020 91 1475 1485 10.1002/JPER.19-0411 32150760 PMC7483931 Sands, R. W. et al. Tuning cytokines enriches dendritic cells and regulatory T cells in the periodontium. J. Periodontol. 91 32150760 10.1002/JPER.19-0411 PMC7483931 21. Yang Y Micro/nanostructured topography on titanium orchestrates dendritic cell adhesion and activation via β2 integrin-FAK signals Int. J. Nanomed. 2022 17 5117 5136 10.2147/IJN.S381222 PMC9636866 36345509 Yang, Y. et al. Micro/nanostructured topography on titanium orchestrates dendritic cell adhesion and activation via β2 integrin-FAK signals. Int. J. Nanomed. 17 10.2147/IJN.S381222 PMC9636866 36345509 22. Zhang L An in vitro investigation of the marked impact of dendritic cell interactions with bone grafts J. Biomed. Mater. Res. Part A 2017 105 1703 1711 10.1002/jbm.a.36048 28241397 Zhang, L. et al. An in vitro investigation of the marked impact of dendritic cell interactions with bone grafts. J. Biomed. Mater. Res. Part A 105 10.1002/jbm.a.36048 28241397 23. Steinman RM Cohn ZA Identification of a novel cell type in peripheral lymphoid organs of mice I. Morphol., quantitation, tissue Distrib. J. Exp. Med. 1973 137 1142 1162 10.1084/jem.137.5.1142 PMC2139237 4573839 Steinman, R. M. & Cohn, Z. A. Identification of a novel cell type in peripheral lymphoid organs of mice. I. Morphol., quantitation, tissue Distrib. J. Exp. Med. 137 24. Merad M Manz MG Dendritic cell homeostasis Blood 2009 113 3418 3427 10.1182/blood-2008-12-180646 19176316 PMC2668851 Merad, M. & Manz, M. G. Dendritic cell homeostasis. Blood 113 19176316 10.1182/blood-2008-12-180646 PMC2668851 25. Steinman RM Cohn ZA Identification of a novel cell type in peripheral lymphoid organs of mice. II. Functional properties in vitro J. Exp. Med. 1974 139 380 397 10.1084/jem.139.2.380 4589990 PMC2139525 Steinman, R. M. & Cohn, Z. A. Identification of a novel cell type in peripheral lymphoid organs of mice. II. Functional properties in vitro. J. Exp. Med. 139 4589990 10.1084/jem.139.2.380 PMC2139525 26. Steinman RM Lustig D Cohn ZA Identification of a novel cell type in peripheral lymphoid organs of mice. III. Functional properties in vivo J. Exp. Med. 1974 139 1431 1445 10.1084/jem.139.6.1431 4598015 PMC2139680 Steinman, R. M., Lustig, D. & Cohn, Z. A. Identification of a novel cell type in peripheral lymphoid organs of mice. III. Functional properties in vivo. J. Exp. Med. 139 4598015 10.1084/jem.139.6.1431 PMC2139680 27. Swiecki Melissa Colonna M The multifaceted biology of plasmacytoid dendritic cells Nat. Rev. Immunol. 2015 15 471 485 10.1038/nri3865 26160613 PMC4808588 Swiecki, Melissa & Colonna, M. The multifaceted biology of plasmacytoid dendritic cells. Nat. Rev. Immunol. 15 26160613 10.1038/nri3865 PMC4808588 28. Musumeci A Lutz K Winheim E Krug AB What makes a pDC: recent advances in understanding plasmacytoid DC development and heterogeneity Front. Immunol. 2019 10 1222 10.3389/fimmu.2019.01222 31191558 PMC6548821 Musumeci, A., Lutz, K., Winheim, E. & Krug, A. B. What makes a pDC: recent advances in understanding plasmacytoid DC development and heterogeneity. Front. Immunol. 10 31191558 10.3389/fimmu.2019.01222 PMC6548821 29. Mildner A Jung S Development and function of dendritic cell subsets Immunity 2014 40 642 656 10.1016/j.immuni.2014.04.016 24837101 Mildner, A. & Jung, S. Development and function of dendritic cell subsets. Immunity 40 24837101 10.1016/j.immuni.2014.04.016 30. Tomi S Graphene quantum dots suppress proinflammatory T cell responses via autophagy-dependent induction of tolerogenic dendritic cells Biomaterials 2017 146 13 28 10.1016/j.biomaterials.2017.08.040 28892752 Tomi, S. et al. Graphene quantum dots suppress proinflammatory T cell responses via autophagy-dependent induction of tolerogenic dendritic cells. Biomaterials 146 28892752 10.1016/j.biomaterials.2017.08.040 31. Liu S Schackel T Weidner N Puttagunta R Biomaterial-supported cell transplantation treatments for spinal cord injury: challenges and perspectives Front. Cell. Neurosci. 2017 11 430 10.3389/fncel.2017.00430 29375316 PMC5768640 Liu, S., Schackel, T., Weidner, N. & Puttagunta, R. Biomaterial-supported cell transplantation treatments for spinal cord injury: challenges and perspectives. Front. Cell. Neurosci. 11 29375316 10.3389/fncel.2017.00430 PMC5768640 32. Eslami-Kaliji F Sarafbidabad M Rajadas J Mohammadi MR Dendritic cells as targets for biomaterial-based immunomodulation ACS Biomater. Sci. Eng. 2020 6 2726 2739 10.1021/acsbiomaterials.9b01987 33463292 Eslami-Kaliji, F., Sarafbidabad, M., Rajadas, J. & Mohammadi, M. R. Dendritic cells as targets for biomaterial-based immunomodulation. ACS Biomater. Sci. Eng. 6 33463292 10.1021/acsbiomaterials.9b01987 33. Sapoznikov A Perivascular clusters of dendritic cells provide critical survival signals to B cells in bone marrow niches Nat. Immunol. 2008 9 388 395 10.1038/ni1571 18311142 Sapoznikov, A. et al. Perivascular clusters of dendritic cells provide critical survival signals to B cells in bone marrow niches. Nat. Immunol. 9 18311142 10.1038/ni1571 34. Shklovskaya E Langerhans cells are precommitted to immune tolerance induction Proc. Natl. Acad. Sci. USA 2011 108 18049 18054 10.1073/pnas.1110076108 22006331 PMC3207689 Shklovskaya, E. et al. Langerhans cells are precommitted to immune tolerance induction. Proc. Natl. Acad. Sci. USA 108 22006331 10.1073/pnas.1110076108 PMC3207689 35. Arizon M Langerhans cells down-regulate inflammation-driven alveolar bone loss Proc. Natl. Acad. Sci. USA 2012 109 7043 7048 10.1073/pnas.1116770109 22509018 PMC3344981 Arizon, M. et al. Langerhans cells down-regulate inflammation-driven alveolar bone loss. Proc. Natl. Acad. Sci. USA 109 22509018 10.1073/pnas.1116770109 PMC3344981 36. Segura E Human Inflammatory Dendritic Cells Induce Th17 Cell Differentiation Immunity 2013 38 336 348 10.1016/j.immuni.2012.10.018 23352235 Segura, E. et al. Human Inflammatory Dendritic Cells Induce Th17 Cell Differentiation. Immunity 38 23352235 10.1016/j.immuni.2012.10.018 37. Madel MB Ibáñez L Wakkach A Vries T Blin-Wakkach C Immune function and diversity of osteoclasts in normal and pathological conditions Front. Immunol. 2019 10 1408 10.3389/fimmu.2019.01408 31275328 PMC6594198 Madel, M. B., Ibáñez, L., Wakkach, A., Vries, T. & Blin-Wakkach, C. Immune function and diversity of osteoclasts in normal and pathological conditions. Front. Immunol. 10 31275328 10.3389/fimmu.2019.01408 PMC6594198 38. Cavanagh LL Activation of bone marrow-resident memory T cells by circulating, antigen-bearing dendritic cells Nat. Immunol. 2005 6 1029 1037 10.1038/ni1249 16155571 PMC1780273 Cavanagh, L. L. et al. Activation of bone marrow-resident memory T cells by circulating, antigen-bearing dendritic cells. Nat. Immunol. 6 16155571 10.1038/ni1249 PMC1780273 39. Cutler CW Teng Y-TA Oral mucosal dendritic cells and periodontitis: many sides of the same coin with new twists Periodontology 2007 45 35 50 10.1111/j.1600-0757.2007.00222.x PMC2828688 17850447 Cutler, C. W. & Teng, Y.-T. A. Oral mucosal dendritic cells and periodontitis: many sides of the same coin with new twists. Periodontology 45 10.1111/j.1600-0757.2007.00222.x PMC2828688 17850447 40. Ueno H Klechevsky E Palucka AK Banchereau J Human dendritic cell subsets Methods Microbiol. 2010 37 497 513 10.1016/S0580-9517(10)37019-X Ueno, H., Klechevsky, E., Palucka, A. K. & Banchereau, J. Human dendritic cell subsets. Methods Microbiol. 37 41. Lapérine O Blin-Wakkach C Guicheux J Beck-Cormier S Lesclous P Dendritic-cell-derived osteoclasts: a new game changer in bone-resorption-associated diseases Drug Discov. Today 2016 21 1345 1354 10.1016/j.drudis.2016.04.022 27151158 Lapérine, O., Blin-Wakkach, C., Guicheux, J., Beck-Cormier, S. & Lesclous, P. Dendritic-cell-derived osteoclasts: a new game changer in bone-resorption-associated diseases. Drug Discov. Today 21 27151158 10.1016/j.drudis.2016.04.022 42. Meghil MM Tawfik OK Elashiry M Rajendran M Cutler CW Disruption of immune homeostasis in human dendritic cells via regulation of autophagy and apoptosis by porphyromonas gingivalis Front. Immunol. 2019 10 2286 10.3389/fimmu.2019.02286 31608069 PMC6769118 Meghil, M. M., Tawfik, O. K., Elashiry, M., Rajendran, M. & Cutler, C. W. Disruption of immune homeostasis in human dendritic cells via regulation of autophagy and apoptosis by porphyromonas gingivalis. Front. Immunol. 10 31608069 10.3389/fimmu.2019.02286 PMC6769118 43. Cirrincione C Pimpinelli N Orlando L Romagnoli P Lamina propria dendritic cells express activation markers and contact lymphocytes in chronic periodontitis J. Periodontol. 2002 73 45 52 10.1902/jop.2002.73.1.45 11846200 Cirrincione, C., Pimpinelli, N., Orlando, L. & Romagnoli, P. Lamina propria dendritic cells express activation markers and contact lymphocytes in chronic periodontitis. J. Periodontol. 73 11846200 10.1902/jop.2002.73.1.45 44. Mizraji G Porphyromonas gingivalis promotes unrestrained type I interferon production by dysregulating TAM signaling via MYD88 degradation Cell Rep. 2017 18 419 431 10.1016/j.celrep.2016.12.047 28076786 Mizraji, G. et al. Porphyromonas gingivalis promotes unrestrained type I interferon production by dysregulating TAM signaling via MYD88 degradation. Cell Rep. 18 28076786 10.1016/j.celrep.2016.12.047 45. Sharawi H The prevalence of gingival dendritic cell subsets in periodontal patients J. Dent. Res. 2021 100 1330 1336 10.1177/00220345211004864 33899566 Sharawi, H. et al. The prevalence of gingival dendritic cell subsets in periodontal patients. J. Dent. Res. 100 33899566 10.1177/00220345211004864 46. Allam J Distribution of Langerhans cells and mast cells within the human oral mucosa: new application sites of allergens in sublingual immunotherapy? Allergy 2008 63 720 727 10.1111/j.1398-9995.2007.01611.x 18445186 Allam, J. et al. Distribution of Langerhans cells and mast cells within the human oral mucosa: new application sites of allergens in sublingual immunotherapy? Allergy 63 18445186 10.1111/j.1398-9995.2007.01611.x 47. Capucha T Distinct murine mucosal Langerhans cell subsets develop from pre-dendritic cells and monocytes Immunity 2015 43 369 381 10.1016/j.immuni.2015.06.017 26231115 Capucha, T. et al. Distinct murine mucosal Langerhans cell subsets develop from pre-dendritic cells and monocytes. Immunity 43 26231115 10.1016/j.immuni.2015.06.017 48. Nudel I Dendritic cells in distinct oral mucosal tissues engage different mechanisms to prime CD8 + J. Immunol. 2011 186 891 900 10.4049/jimmunol.1002943 21160044 Nudel, I. et al. Dendritic cells in distinct oral mucosal tissues engage different mechanisms to prime CD8 + J. Immunol. 186 21160044 10.4049/jimmunol.1002943 49. Séguier S Bodineau A Godeau G Pellat B Brousse N Langerin + + Arch. Oral. Biol. 2003 48 255 262 10.1016/S0003-9969(02)00173-5 12663070 Séguier, S., Bodineau, A., Godeau, G., Pellat, B. & Brousse, N. Langerin + + Arch. Oral. Biol. 48 12663070 10.1016/s0003-9969(02)00173-5 50. El‐Awady AR Elashiry M Morandini AC Meghil M Cutler CW Dendritic cells a critical link to alveolar bone loss and systemic disease risk in periodontitis: Immunotherapeutic implications Periodontology 2000 2022 89 41 50 10.1111/prd.12428 35244951 PMC9018591 El‐Awady, A. R., Elashiry, M., Morandini, A. C., Meghil, M. & Cutler, C. W. Dendritic cells a critical link to alveolar bone loss and systemic disease risk in periodontitis: Immunotherapeutic implications. Periodontology 2000 89 35244951 10.1111/prd.12428 PMC9018591 51. Myint M Yuan ZN Schenck K Reduced numbers of Langerhans cells and increased HLA-DR expression in keratinocytes in the oral gingival epithelium of HIV-infected patients with periodontitis J. Clin. Periodontol. 2010 27 513 519 10.1034/j.1600-051x.2000.027007513.x 10914893 Myint, M., Yuan, Z. N. & Schenck, K. Reduced numbers of Langerhans cells and increased HLA-DR expression in keratinocytes in the oral gingival epithelium of HIV-infected patients with periodontitis. J. Clin. Periodontol. 27 10.1034/j.1600-051x.2000.027007513.x 10914893 52. Jotwani R Cutler CW Multiple dendritic cell (DC) sub-populations in human gingiva and association of mature DC with CD4 + J. Dent. Res. 2003 82 736 741 10.1177/154405910308200915 12939360 Jotwani, R. & Cutler, C. W. Multiple dendritic cell (DC) sub-populations in human gingiva and association of mature DC with CD4 + J. Dent. Res. 82 12939360 10.1177/154405910308200915 53. Jotwani R Mature dendritic cells infiltrate the T cell-rich region of oral mucosa in chronic periodontitis: in situ, in vivo, and in vitro studies J. Immunol. 2001 167 4693 4700 10.4049/jimmunol.167.8.4693 11591800 PMC3739284 Jotwani, R. et al. Mature dendritic cells infiltrate the T cell-rich region of oral mucosa in chronic periodontitis: in situ, in vivo, and in vitro studies. J. Immunol. 167 11591800 10.4049/jimmunol.167.8.4693 PMC3739284 54. Wilensky A Dendritic cells and their role in periodontal disease Oral. Dis. 2013 20 119 126 10.1111/odi.12122 23656605 Wilensky, A. et al. Dendritic cells and their role in periodontal disease. Oral. Dis. 20 23656605 10.1111/odi.12122 55. Heyman O Impaired differentiation of langerhans cells in the murine oral epithelium adjacent to titanium dental implants Front. Immunol. 2018 9 1712 10.3389/fimmu.2018.01712 30158922 PMC6103475 Heyman, O. et al. Impaired differentiation of langerhans cells in the murine oral epithelium adjacent to titanium dental implants. Front. Immunol. 9 30158922 10.3389/fimmu.2018.01712 PMC6103475 56. Bodineau A Do Langer- hans cells behave similarly in elderly and younger patients with chronic periodontitis? Arch. Oral. Biol. 2007 52 189 194 10.1016/j.archoralbio.2006.09.007 17116293 Bodineau, A. et al. Do Langer- hans cells behave similarly in elderly and younger patients with chronic periodontitis? Arch. Oral. Biol. 52 17116293 10.1016/j.archoralbio.2006.09.007 57. Horev Y Niche rather than origin dysregulates mucosal Langerhans cells development in aged mice Mucosal Immunol. 2020 13 767 776 10.1038/s41385-020-0301-y 32457449 Horev, Y. et al. Niche rather than origin dysregulates mucosal Langerhans cells development in aged mice. Mucosal Immunol. 13 32457449 10.1038/s41385-020-0301-y 58. Liang S Hosur K Domon H Hajishengallis G Periodontal inflammation and bone loss in aged mice J. Periodontal Res. 2010 45 574 578 20337897 10.1111/j.1600-0765.2009.01245.x PMC2894296 Liang, S., Hosur, K., Domon, H. & Hajishengallis, G. Periodontal inflammation and bone loss in aged mice. J. Periodontal Res. 45 20337897 10.1111/j.1600-0765.2009.01245.x PMC2894296 59. Bertolini, M. & Clark, D. Periodontal disease as a model to study chronic inflammation in aging. Geroscience 46 10.1007/s11357-023-00835-0 PMC11226587 37285008 60. Hajishengallis G Lamont RJ Polymicrobial communities in periodontal disease: Their quasi-organismal nature and dialogue with the host Periodontology 2021 86 210 230 10.1111/prd.12371 PMC8957750 33690950 Hajishengallis, G. & Lamont, R. J. Polymicrobial communities in periodontal disease: Their quasi-organismal nature and dialogue with the host. Periodontology 86 10.1111/prd.12371 PMC8957750 33690950 61. Pulendran B Lipopolysaccharides from distinct pathogens induce different classes of immune responses in vivo J. Immunol. 2001 167 5067 5076 10.4049/jimmunol.167.9.5067 11673516 PMC3739327 Pulendran, B. et al. Lipopolysaccharides from distinct pathogens induce different classes of immune responses in vivo. J. Immunol. 167 11673516 10.4049/jimmunol.167.9.5067 PMC3739327 62. Jotwani R Pulendran B Agrawal S Cutler CW Human dendritic cells respond to Porphyromonas gingivalis LPS by promoting a Th2 effector response in vitro Eur. J. Immunol. 2003 33 2980 2986 10.1002/eji.200324392 14579266 Jotwani, R., Pulendran, B., Agrawal, S. & Cutler, C. W. Human dendritic cells respond to Porphyromonas gingivalis LPS by promoting a Th2 effector response in vitro. Eur. J. Immunol. 33 14579266 10.1002/eji.200324392 63. Jotwani R ES Moonga S Cutler CW MMP-9/ TIMP-1 imbalance induced in human dendritic cells by Por- phyromonas gingivalis FEMS Immunol. Med. Microbiol. 2010 58 314 321 10.1111/j.1574-695X.2009.00637.x 20030715 PMC2871062 Jotwani R, E. S., Moonga, S. & Cutler, C. W. MMP-9/ TIMP-1 imbalance induced in human dendritic cells by Por- phyromonas gingivalis. FEMS Immunol. Med. Microbiol. 58 20030715 10.1111/j.1574-695X.2009.00637.x PMC2871062 64. Zeituni AE Jotwani R Carrion J Cutler CW Targeting of DC-SIGN on human dendritic cells by minor fimbriated Porphyromonas gingivalis strains elicits a distinct effector T cell response J. Immunol. 2009 183 5694 5704 10.4049/jimmunol.0901030 19828628 PMC2770168 Zeituni, A. E., Jotwani, R., Carrion, J. & Cutler, C. W. Targeting of DC-SIGN on human dendritic cells by minor fimbriated Porphyromonas gingivalis strains elicits a distinct effector T cell response. J. Immunol. 183 19828628 10.4049/jimmunol.0901030 PMC2770168 65. Carrion J Microbial carriage state of peripheral blood dendritic cells (DCs) in chronic periodontitis influences DC differentiation, atherogenic potential J. Immunol. 2012 189 3178 3187 10.4049/jimmunol.1201053 22891282 PMC3459682 Carrion, J. et al. Microbial carriage state of peripheral blood dendritic cells (DCs) in chronic periodontitis influences DC differentiation, atherogenic potential. J. Immunol. 189 22891282 10.4049/jimmunol.1201053 PMC3459682 66. Velsko IM Active invasion of oral and aortic tissues by porphyromonas gingivalis in mice causally links periodontitis and atherosclerosis PloS One 2014 9 e97811 10.1371/journal.pone.0097811 24836175 PMC4024021 Velsko, I. M. et al. Active invasion of oral and aortic tissues by porphyromonas gingivalis in mice causally links periodontitis and atherosclerosis. PloS One 9 24836175 10.1371/journal.pone.0097811 PMC4024021 67. Poole S Singhrao SK Kesavalu L Curtis MA Crean SJ Determining the presence of periodontopathic virulence factors in short-term postmortem alzheimer’s disease brain tissue J. Alzheimers Dis. 2013 36 665 677 10.3233/JAD-121918 23666172 Poole, S., Singhrao, S. K., Kesavalu, L., Curtis, M. A. & Crean, S. J. Determining the presence of periodontopathic virulence factors in short-term postmortem alzheimer’s disease brain tissue. J. Alzheimers Dis. 36 23666172 10.3233/JAD-121918 68. Liang S Periodontal infection with Porphyromonas gingivalis induces preterm birth and lower birth weight in rats Mol. Oral. Microbiol 2018 33 312 321 10.1111/omi.12227 29754448 Liang, S. et al. Periodontal infection with Porphyromonas gingivalis induces preterm birth and lower birth weight in rats. Mol. Oral. Microbiol 33 29754448 10.1111/omi.12227 69. Scannapieco FA Gershovich E The prevention of periodontal disease—an overview Periodontology 2000 2020 84 9 13 10.1111/prd.12330 32844421 Scannapieco, F. A. & Gershovich, E. The prevention of periodontal disease—an overview. Periodontology 2000 84 32844421 10.1111/prd.12330 70. Myneni SR Brocavich K H Wang H Biological strategies for the prevention of periodontal disease: probiotics and vaccines Periodontology 2000 2020 84 161 175 10.1111/prd.12343 32844414 Myneni, S. R., Brocavich, K. & H Wang, H. Biological strategies for the prevention of periodontal disease: probiotics and vaccines. Periodontology 2000 84 32844414 10.1111/prd.12343 71. Kataoka K Kawabata S Koyanagi K Hashimoto Y Fujihashi K Respiratory FimA-specific secretory IgA antibodies upregulated by DC-targeting nasal double DNA adjuvant are essential for elimination of porphyromonas gingivalis Front. Immunol. 2021 12 634923 10.3389/fimmu.2021.634923 33717178 PMC7948520 Kataoka, K., Kawabata, S., Koyanagi, K., Hashimoto, Y. & Fujihashi, K. Respiratory FimA-specific secretory IgA antibodies upregulated by DC-targeting nasal double DNA adjuvant are essential for elimination of porphyromonas gingivalis. Front. Immunol. 12 33717178 10.3389/fimmu.2021.634923 PMC7948520 72. Municio C Criado G Therapies targeting trained immune cells in inflammatory and autoimmune diseases Front. Immunol. 2020 11 631743 10.3389/fimmu.2020.631743 33569065 PMC7868395 Municio, C. & Criado, G. Therapies targeting trained immune cells in inflammatory and autoimmune diseases. Front. Immunol. 11 33569065 10.3389/fimmu.2020.631743 PMC7868395 73. Walsh MC Takegahara N Kim H Choi Y Updating osteoimmunology: regulation of bone cells by innate and adaptive immunity Nat. Rev. Rheumatol. 2018 14 146 156 10.1038/nrrheum.2017.213 29323344 PMC5821527 Walsh, M. C., Takegahara, N., Kim, H. & Choi, Y. Updating osteoimmunology: regulation of bone cells by innate and adaptive immunity. Nat. Rev. Rheumatol. 14 29323344 10.1038/nrrheum.2017.213 PMC5821527 74. Brandum EP Jørgensen AS Rosenkilde MM Hjortø GM Dendritic cells and CCR7 Expression: an important factor for autoimmune diseases, chronic inflammation, and cancer Int. J. Mol. Sci. 2021 22 8340 10.3390/ijms22158340 34361107 PMC8348795 Brandum, E. P., Jørgensen, A. S., Rosenkilde, M. M. & Hjortø, G. M. Dendritic cells and CCR7 Expression: an important factor for autoimmune diseases, chronic inflammation, and cancer. Int. J. Mol. Sci. 22 34361107 10.3390/ijms22158340 PMC8348795 75. Page G Miossec P RANK and RANKL expression as markers of dendritic cell-T cell interactions in paired samples of rheumatoid synovium and lymph nodes Arthritis Rheumatism 2005 52 2307 2312 10.1002/art.21211 16052586 Page, G. & Miossec, P. RANK and RANKL expression as markers of dendritic cell-T cell interactions in paired samples of rheumatoid synovium and lymph nodes. Arthritis Rheumatism 52 16052586 10.1002/art.21211 76. Coury F Peyruchaud O Machuca-Gayet I Osteoimmunology of bone loss in inflammatory rheumatic diseases Front. Immunol. 2019 10 679 10.3389/fimmu.2019.00679 31001277 PMC6456657 Coury, F., Peyruchaud, O. & Machuca-Gayet, I. Osteoimmunology of bone loss in inflammatory rheumatic diseases. Front. Immunol. 10 31001277 10.3389/fimmu.2019.00679 PMC6456657 77. Krishnamurthy A Citrullination controls dendritic cell transdifferentiation into osteoclasts J. Immunol. 2019 202 3143 3150 10.4049/jimmunol.1800534 31019059 PMC6526390 Krishnamurthy, A. et al. Citrullination controls dendritic cell transdifferentiation into osteoclasts. J. Immunol. 202 31019059 10.4049/jimmunol.1800534 PMC6526390 78. Zhou L Li L Wang Y Gao Q Geng YQ Effects of RANKL on the proliferation and apoptosis of fibroblast-like synoviocytes in rheumatoid arthritis through regulating the NF-κB signaling pathway Eur. Rev. Med. Pharm. Sci. 2019 23 9215 9221 10.26355/eurrev_201911_19413 31773672 Zhou, L., Li, L., Wang, Y., Gao, Q. & Geng, Y. Q. Effects of RANKL on the proliferation and apoptosis of fibroblast-like synoviocytes in rheumatoid arthritis through regulating the NF-κB signaling pathway. Eur. Rev. Med. Pharm. Sci. 23 10.26355/eurrev_201911_19413 31773672 79. Popova V Vazhev Z Geneva-Popova M Batalov A Comparison of RANKL expression, inflammatory markers, and cardiovascular risk in patients with acute coronary syndrome with and without rheumatoid arthritis Rheumatol. Int. 2019 39 1723 1732 10.1007/s00296-019-04367-9 31297563 Popova, V., Vazhev, Z., Geneva-Popova, M. & Batalov, A. Comparison of RANKL expression, inflammatory markers, and cardiovascular risk in patients with acute coronary syndrome with and without rheumatoid arthritis. Rheumatol. Int. 39 31297563 10.1007/s00296-019-04367-9 80. Adamopoulos IE Interleukin-17A upregulates receptor activator of NF-kappaB on osteoclast precursors Arthritis Res. Ther. 2010 12 R29 10.1186/ar2936 20167120 PMC2875663 Adamopoulos, I. E. et al. Interleukin-17A upregulates receptor activator of NF-kappaB on osteoclast precursors. Arthritis Res. Ther. 12 20167120 10.1186/ar2936 PMC2875663 81. Coutant F Pin J-J Miossec P Extensive phenotype of human inflammatory monocyte-derived dendritic cells Cells 2021 10 1663 10.3390/cells10071663 34359833 PMC8307578 Coutant, F., Pin, J.-J. & Miossec, P. Extensive phenotype of human inflammatory monocyte-derived dendritic cells. Cells 10 34359833 10.3390/cells10071663 PMC8307578 82. Moutel S Surface LSP-1 Is a phenotypic marker distinguishing human classical versus monocyte-derived dendritic cells iScience 2020 23 100987 10.1016/j.isci.2020.100987 32224433 PMC7109623 Moutel, S. et al. Surface LSP-1 Is a phenotypic marker distinguishing human classical versus monocyte-derived dendritic cells. iScience 23 32224433 10.1016/j.isci.2020.100987 PMC7109623 83. Coutant F Shaping of monocyte-derived dendritic cell development and function by environmental factors in rheumatoid arthritis Int. J. Mol. Sci. 2021 22 13670 10.3390/ijms222413670 34948462 PMC8708154 Coutant, F. Shaping of monocyte-derived dendritic cell development and function by environmental factors in rheumatoid arthritis. Int. J. Mol. Sci. 22 34948462 10.3390/ijms222413670 PMC8708154 84. Reynolds G Synovial CD4 + Ann. Rheum. Dis. 2016 75 899 907 10.1136/annrheumdis-2014-206578 25923217 PMC4853576 Reynolds, G. et al. Synovial CD4 + Ann. Rheum. Dis. 75 25923217 10.1136/annrheumdis-2014-206578 PMC4853576 85. Coutant F Miossec P Altered dendritic cell functions in autoimmune diseases: distinct and overlapping profiles Nat. Rev. Rheumatol. 2016 12 703 715 10.1038/nrrheum.2016.147 27652503 Coutant, F. & Miossec, P. Altered dendritic cell functions in autoimmune diseases: distinct and overlapping profiles. Nat. Rev. Rheumatol. 12 27652503 10.1038/nrrheum.2016.147 86. Leung BP A novel dendritic cell-induced model of erosive inflammatory arthritis: distinct roles for dendritic cells in T cell activation and induction of local inflammation J. Immunol. 2002 169 7071 7077 10.4049/jimmunol.169.12.7071 12471143 Leung, B. P. et al. A novel dendritic cell-induced model of erosive inflammatory arthritis: distinct roles for dendritic cells in T cell activation and induction of local inflammation. J. Immunol. 169 12471143 10.4049/jimmunol.169.12.7071 87. Fischer JA Combined inhibition of tumor necrosis factor α and interleukin-17 as a therapeutic opportunity in rheumatoid arthritis: development and characterization of a novel bispecific antibody Arthritis Rheumatol. 2015 67 51 62 10.1002/art.38896 25303306 Fischer, J. A. et al. Combined inhibition of tumor necrosis factor α and interleukin-17 as a therapeutic opportunity in rheumatoid arthritis: development and characterization of a novel bispecific antibody. Arthritis Rheumatol. 67 25303306 10.1002/art.38896 88. Zhang QM IL-17 Stimulates the production and expression of proinflammatory cytokines, IL-β and TNF-α, by human macrophages J. Immunol. 1998 160 3513 3521 10.4049/jimmunol.160.7.3513 9531313 Zhang, Q. M. et al. IL-17 Stimulates the production and expression of proinflammatory cytokines, IL-β and TNF-α, by human macrophages. J. Immunol. 160 9531313 89. Benderdour M Interleukin 17 (IL-17) induces collagenase-3 production in human osteoarthritic chondrocytes via AP-1 dependent activation: differential activation of AP-1 members by IL-17 and IL-1beta J. Rheumatol. 2002 29 1262 12064845 Benderdour, M. et al. Interleukin 17 (IL-17) induces collagenase-3 production in human osteoarthritic chondrocytes via AP-1 dependent activation: differential activation of AP-1 members by IL-17 and IL-1beta. J. Rheumatol. 29 12064845 90. Pacquelet S Presle N Boileau C Dumond H Jouzeau JY Interleukin 17, a nitric oxide-producing cytokine with a peroxynitrite-independent inhibitory effect on proteoglycan synthesis J. Rheumatol. 2002 29 2602 2610 12465160 Pacquelet, S., Presle, N., Boileau, C., Dumond, H. & Jouzeau, J. Y. Interleukin 17, a nitric oxide-producing cytokine with a peroxynitrite-independent inhibitory effect on proteoglycan synthesis. J. Rheumatol. 29 12465160 91. Takayanagi H Osteoimmunology and the effects of the immune system on bone Nat. Rev. Rheumatol. 2009 5 667 676 10.1038/nrrheum.2009.217 19884898 Takayanagi, H. Osteoimmunology and the effects of the immune system on bone. Nat. Rev. Rheumatol. 5 19884898 10.1038/nrrheum.2009.217 92. Coutant F Pathogenic effects of anti-citrullinated peptide antibodies in rheumatoid arthritis – role for glycosylation Jt. Bone Spine 2019 86 562 567 10.1016/j.jbspin.2019.01.005 30685537 Coutant, F. Pathogenic effects of anti-citrullinated peptide antibodies in rheumatoid arthritis – role for glycosylation. Jt. Bone Spine 86 10.1016/j.jbspin.2019.01.005 30685537 93. Pfeifle R Regulation of autoantibody activity by the IL-23-TH17 axis determines the onset of autoimmune disease Nat. Immunol. 2016 18 104 113 10.1038/ni.3579 27820809 PMC5164937 Pfeifle, R. et al. Regulation of autoantibody activity by the IL-23-TH17 axis determines the onset of autoimmune disease. Nat. Immunol. 18 27820809 10.1038/ni.3579 PMC5164937 94. Harre U Glycosylation of immunoglobulin G determines osteoclast differentiation and bone loss Nat. Commun. 2015 6 6651 10.1038/ncomms7651 25825024 PMC4389255 Harre, U. et al. Glycosylation of immunoglobulin G determines osteoclast differentiation and bone loss. Nat. Commun. 6 25825024 10.1038/ncomms7651 PMC4389255 95. Rivollier A Immature dendritic cell transdifferentiation into osteoclasts: a novel pathway sustained by the rheumatoid arthritis microenvironment Blood 2004 104 4029 10.1182/blood-2004-01-0041 15308576 Rivollier, A. et al. Immature dendritic cell transdifferentiation into osteoclasts: a novel pathway sustained by the rheumatoid arthritis microenvironment. Blood 104 15308576 10.1182/blood-2004-01-0041 96. Delgado-Arévalo C NLRC4-mediated activation of CD1c + JCI Insight 2022 7 e152886 10.1172/jci.insight.152886 36194479 PMC9746818 Delgado-Arévalo, C. et al. NLRC4-mediated activation of CD1c + JCI Insight 7 36194479 10.1172/jci.insight.152886 PMC9746818 97. Lebre MC Rheumatoid arthritis synovium contains two subsets of CD83-DC-LAMP- dendritic cells with distinct cytokine profiles Am. J. Pathol. 2008 172 940 950 10.2353/ajpath.2008.070703 18292234 PMC2276434 Lebre, M. C. et al. Rheumatoid arthritis synovium contains two subsets of CD83-DC-LAMP- dendritic cells with distinct cytokine profiles. Am. J. Pathol. 172 18292234 10.2353/ajpath.2008.070703 PMC2276434 98. Jongbloed SL Plasmacytoid dendritic cells regulate breach of self-tolerance in autoimmune arthritis J. Immunol. 2009 182 963 968 10.4049/jimmunol.182.2.963 19124739 Jongbloed, S. L. et al. Plasmacytoid dendritic cells regulate breach of self-tolerance in autoimmune arthritis. J. Immunol. 182 19124739 10.4049/jimmunol.182.2.963 99. Jongbloed SL Lebre MC Fraser AR Enumeration and phenotypical analysis of distinct dendritic cell subsets in psoriatic arthritis and rheumatoid arthritis Arthritis Res. Ther. 2005 8 R5 10.1186/ar1864 PMC1526567 16507115 Jongbloed, S. L., Lebre, M. C. & Fraser, A. R. Enumeration and phenotypical analysis of distinct dendritic cell subsets in psoriatic arthritis and rheumatoid arthritis. Arthritis Res. Ther. 8 10.1186/ar1864 PMC1526567 16507115 100. Page G Miossec P Paired synovium and lymph nodes from rheumatoid arthritis patients differ in dendritic cell and chemokine expression J. Pathol. 2004 204 28 38 10.1002/path.1607 15307135 Page, G. & Miossec, P. Paired synovium and lymph nodes from rheumatoid arthritis patients differ in dendritic cell and chemokine expression. J. Pathol. 204 15307135 10.1002/path.1607 101. Page G Lebecque S Miossec P Anatomic localization of immature and mature dendritic cells in an ectopic lymphoid organ: correlation with selective chemokine expression in rheumatoid synovium J. Immunol. 2002 168 5333 5341 10.4049/jimmunol.168.10.5333 11994492 Page, G., Lebecque, S. & Miossec, P. Anatomic localization of immature and mature dendritic cells in an ectopic lymphoid organ: correlation with selective chemokine expression in rheumatoid synovium. J. Immunol. 168 11994492 10.4049/jimmunol.168.10.5333 102. Canavan MM Rheumatoid arthritis synovial microenvironment induces metabolic and functional adaptations in dendritic cells Clin. Exp. Immunol. 2020 202 226 238 10.1111/cei.13479 32557565 PMC7597596 Canavan, M. M. et al. Rheumatoid arthritis synovial microenvironment induces metabolic and functional adaptations in dendritic cells. Clin. Exp. Immunol. 202 32557565 10.1111/cei.13479 PMC7597596 103. Ashton MP Association of dendritic cell signatures with autoimmune inflammation revealed by single-cell profiling Arthritis Rheumatol. 2019 71 817 828 10.1002/art.40793 30511817 Ashton, M. P. et al. Association of dendritic cell signatures with autoimmune inflammation revealed by single-cell profiling. Arthritis Rheumatol. 71 30511817 10.1002/art.40793 104. Kroot EJ The prognostic value of anti–cyclic citrullinated peptide antibody in patients with recent‐onset rheumatoid arthritis Arthritis Rheum. 2000 43 1831 1835 10.1002/1529-0131(200008)43:8&#x0003c;1831::AID-ANR19&#x0003e;3.0.CO;2-6 10943873 Kroot, E. J. et al. The prognostic value of anti–cyclic citrullinated peptide antibody in patients with recent‐onset rheumatoid arthritis. Arthritis Rheum. 43 10943873 10.1002/1529-0131(200008)43:8<1831::AID-ANR19>3.0.CO;2-6 105. Thomas R Dendritic cells and the promise of antigen-specific therapy in rheumatoid arthritis Arthritis Res. Ther. 2013 15 204 10.1186/ar4130 23374912 PMC3672739 Thomas, R. Dendritic cells and the promise of antigen-specific therapy in rheumatoid arthritis. Arthritis Res. Ther. 15 23374912 10.1186/ar4130 PMC3672739 106. Benham H Nel HJ Law SC Mehdi AM Citrullinated peptide dendritic cell immunotherapy in HLA risk genotype-positive rheumatoid arthritis patients Sci. Transl. Med. 2015 13 284 287 10.1126/scitranslmed.aaa9301 26041704 Benham, H., Nel, H. J., Law, S. C. & Mehdi, A. M. Citrullinated peptide dendritic cell immunotherapy in HLA risk genotype-positive rheumatoid arthritis patients. Sci. Transl. Med. 13 10.1126/scitranslmed.aaa9301 26041704 107. Hilkens C Isaacs JD Tolerogenic dendritic cell therapy for rheumatoid arthritis: where are we now? Clin. Exp. Immunol. 2013 172 148 157 10.1111/cei.12038 23574312 PMC3628318 Hilkens, C. & Isaacs, J. D. Tolerogenic dendritic cell therapy for rheumatoid arthritis: where are we now? Clin. Exp. Immunol. 172 23574312 10.1111/cei.12038 PMC3628318 108. Qiao H Immune-regulating strategy against rheumatoid arthritis by inducing tolerogenic dendritic cells with modified zinc peroxide nanoparticles J. Nanobiotechnol. 2022 20 323 10.1186/s12951-022-01536-0 PMC9281050 35836178 Qiao, H. et al. Immune-regulating strategy against rheumatoid arthritis by inducing tolerogenic dendritic cells with modified zinc peroxide nanoparticles. J. Nanobiotechnol. 20 10.1186/s12951-022-01536-0 PMC9281050 35836178 109. Lee ES Reactive oxygen species-responsive dendritic cell-derived exosomes for rheumatoid arthritis Acta Biomaterialia 2021 128 462 473 10.1016/j.actbio.2021.04.026 33878476 Lee, E. S. et al. Reactive oxygen species-responsive dendritic cell-derived exosomes for rheumatoid arthritis. Acta Biomaterialia 128 33878476 10.1016/j.actbio.2021.04.026 110. Zhao Q Dual‑wavelength photosensitive nano‑in‑micro scaffold regulates innate and adaptive immune responses for osteogenesis Nano-Micro Lett. 2020 13 28 10.1007/s40820-020-00540-z PMC8187671 34138183 Zhao, Q. et al. Dual‑wavelength photosensitive nano‑in‑micro scaffold regulates innate and adaptive immune responses for osteogenesis. Nano-Micro Lett. 13 10.1007/s40820-020-00540-z PMC8187671 34138183 111. Leifer CA Dendritic cells in host response to biologic scaffolds Semin. Immunol. 2017 29 41 48 10.1016/j.smim.2017.01.001 28214177 Leifer, C. A. Dendritic cells in host response to biologic scaffolds. Semin. Immunol. 29 28214177 10.1016/j.smim.2017.01.001 112. Verbeke CS Multicomponent injectable hydrogels for antigen-specific tolerogenic immune modulation Adv. Healthc. Mater. 2017 6 10 10.1002/adhm.201600773 PMC5518671 28116870 Verbeke, C. S. et al. Multicomponent injectable hydrogels for antigen-specific tolerogenic immune modulation. Adv. Healthc. Mater. 6 10.1002/adhm.201600773 PMC5518671 28116870 113. Id A Sa B Kdw C De novo malignancies after transplantation Med. Clin. North Am. 2016 100 551 567 10.1016/j.mcna.2016.01.006 27095645 Id, A., Sa, B. & Kdw, C. De novo malignancies after transplantation. Med. Clin. North Am. 100 27095645 10.1016/j.mcna.2016.01.006 114. Zhu FJ Tong YL Sheng ZY Yao YM Role of dendritic cells in the host response to biomaterials and their signaling pathways Acta Biomaterialia 2019 94 132 144 10.1016/j.actbio.2019.05.038 31108257 Zhu, F. J., Tong, Y. L., Sheng, Z. Y. & Yao, Y. M. Role of dendritic cells in the host response to biomaterials and their signaling pathways. Acta Biomaterialia 94 31108257 10.1016/j.actbio.2019.05.038 115. Wang S The role of dendritic cells in the immunomodulation to implanted biomaterials Int J. Oral. Sci. 2022 14 52 10.1038/s41368-022-00203-2 36333287 PMC9636170 Wang, S. et al. The role of dendritic cells in the immunomodulation to implanted biomaterials. Int J. Oral. Sci. 14 36333287 10.1038/s41368-022-00203-2 PMC9636170 116. Hu W Regulation of biomaterial implantation-induced fibrin deposition to immunological functions of dendritic cells Mater. today Bio 2022 14 100224 10.1016/j.mtbio.2022.100224 35252832 PMC8894278 Hu, W. et al. Regulation of biomaterial implantation-induced fibrin deposition to immunological functions of dendritic cells. Mater. today Bio 14 35252832 10.1016/j.mtbio.2022.100224 PMC8894278 117. Nguyen T Mi YE Kim SM Real appearance of dendritic cell on failed implant fixture J. craniofacial Surg. 2021 32 e607 e609 10.1097/SCS.0000000000007563 33606443 Nguyen, T., Mi, Y. E. & Kim, S. M. Real appearance of dendritic cell on failed implant fixture. J. craniofacial Surg. 32 10.1097/SCS.0000000000007563 33606443 118. Amengual-Peñafiel L Osteoimmunology drives dental implant osseointegration: a new paradigm for implant dentistry Jpn. Dent. Sci. Rev. 2021 57 12 19 10.1016/j.jdsr.2021.01.001 33737990 PMC7946347 Amengual-Peñafiel, L. et al. Osteoimmunology drives dental implant osseointegration: a new paradigm for implant dentistry. Jpn. Dent. Sci. Rev. 57 33737990 10.1016/j.jdsr.2021.01.001 PMC7946347 119. Chan EP Mhawi A Clode P Saunders M Filgueira L Effects of titanium(IV) ions on human monocyte-derived dendritic cells Metallomics 2009 1 166 174 10.1039/b820871a 21305110 Chan, E. P., Mhawi, A., Clode, P., Saunders, M. & Filgueira, L. Effects of titanium(IV) ions on human monocyte-derived dendritic cells. Metallomics 1 21305110 10.1039/b820871a 120. Kou PM Schwartz Z Boyan BD Babensee JE Dendritic cell responses to surface properties of clinical titanium surfaces Acta Biomaterialia 2011 7 1354 1363 10.1016/j.actbio.2010.10.020 20977948 PMC3031747 Kou, P. M., Schwartz, Z., Boyan, B. D. & Babensee, J. E. Dendritic cell responses to surface properties of clinical titanium surfaces. Acta Biomaterialia 7 20977948 10.1016/j.actbio.2010.10.020 PMC3031747 121. Yang Y Wang X Miron RJ Zhang X The interactions of dendritic cells with osteoblasts on titanium surfaces: an in vitroinvestigation Clin. Oral Invest. 2019 23 4133 4143 10.1007/s00784-019-02852-w 30850859 Yang, Y., Wang, X., Miron, R. J. & Zhang, X. The interactions of dendritic cells with osteoblasts on titanium surfaces: an in vitroinvestigation. Clin. Oral Invest. 23 10.1007/s00784-019-02852-w 30850859 122. Zheng X Zhou F Gu Y Duan X Mo A Effect of different titanium surfaces on maturation of murine bone marrow-derived dendritic cells Sci. Rep. 2017 7 41945 10.1038/srep41945 28157196 PMC5291203 Zheng, X., Zhou, F., Gu, Y., Duan, X. & Mo, A. Effect of different titanium surfaces on maturation of murine bone marrow-derived dendritic cells. Sci. Rep. 7 28157196 10.1038/srep41945 PMC5291203 123. da Costa CE Presence of osteoclast-like multinucleated giant cells in the bone and nonostotic lesions of Langerhans cell histiocytosis J. Exp. Med. 2005 201 687 693 10.1084/jem.20041785 15753204 PMC2212837 da Costa, C. E. et al. Presence of osteoclast-like multinucleated giant cells in the bone and nonostotic lesions of Langerhans cell histiocytosis. J. Exp. Med. 201 15753204 10.1084/jem.20041785 PMC2212837 124. Hirbe AC Morgan EA Weilbaecher KN The CXCR4/SDF-1 chemokine axis: a potential therapeutic target for bone metastases? Curr. Pharm. Des. 2010 16 1284 1290 10.2174/138161210791034012 20166978 Hirbe, A. C., Morgan, E. A. & Weilbaecher, K. N. The CXCR4/SDF-1 chemokine axis: a potential therapeutic target for bone metastases? Curr. Pharm. Des. 16 20166978 10.2174/138161210791034012 125. Wang B Dong Y Tian Z Chen Y Dong S The role of dendritic cells derived osteoclasts in bone destruction diseases Genes Dis. 2021 8 401 411 10.1016/j.gendis.2020.03.009 34179305 PMC8209356 Wang, B., Dong, Y., Tian, Z., Chen, Y. & Dong, S. The role of dendritic cells derived osteoclasts in bone destruction diseases. Genes Dis. 8 34179305 10.1016/j.gendis.2020.03.009 PMC8209356 126. Avin KG Single-cell RNAseq provides insight into altered immune cell populations in human fracture nonunions J. Orthopaedic Res. 2023 41 1060 1069 10.1002/jor.25452 PMC10335365 36200412 Avin, K. G. et al. Single-cell RNAseq provides insight into altered immune cell populations in human fracture nonunions. J. Orthopaedic Res. 41 10.1002/jor.25452 PMC10335365 36200412 127. de Vries TJ Andreotta S Loos BG Nicu EA Genes critical for developing periodontitis: lessons from mouse models Front. Immunol. 2017 8 1395 10.3389/fimmu.2017.01395 29163477 PMC5663718 de Vries, T. J., Andreotta, S., Loos, B. G. & Nicu, E. A. Genes critical for developing periodontitis: lessons from mouse models. Front. Immunol. 8 29163477 10.3389/fimmu.2017.01395 PMC5663718 128. Semenza GL Hypoxia-inducible factors in physiology and medicine Cell 2012 148 399 408 10.1016/j.cell.2012.01.021 22304911 PMC3437543 Semenza, G. L. Hypoxia-inducible factors in physiology and medicine. Cell 148 22304911 10.1016/j.cell.2012.01.021 PMC3437543 129. Chen L Wei XQ Evans B Jiang W Aeschlimann D IL-23 promotes osteoclast formation by up-regulation of receptor activator of NF-kappaB (RANK) expression in myeloid precursor cells Eur. J. Immunol. 2010 38 2845 2854 10.1002/eji.200838192 18958885 Chen, L., Wei, X. Q., Evans, B., Jiang, W. & Aeschlimann, D. IL-23 promotes osteoclast formation by up-regulation of receptor activator of NF-kappaB (RANK) expression in myeloid precursor cells. Eur. J. Immunol. 38 10.1002/eji.200838192 18958885 130. Sachini AD Regulation of osteoclast differentiation by cytokine networks Immune Netw. 2018 18 e8 10.4110/in.2018.18.e8 29503739 PMC5833125 Sachini, A. D. et al. Regulation of osteoclast differentiation by cytokine networks. Immune Netw. 18 29503739 10.4110/in.2018.18.e8 PMC5833125 131. Xiao Y Identification of the common origins of osteoclasts, macrophages, and dendritic cells in human hematopoiesis Stem cell Rep. 2015 4 984 994 10.1016/j.stemcr.2015.04.012 PMC4471835 26004632 Xiao, Y. et al. Identification of the common origins of osteoclasts, macrophages, and dendritic cells in human hematopoiesis. Stem cell Rep. 4 10.1016/j.stemcr.2015.04.012 PMC4471835 26004632 132. Gallois A Genome-wide expression analyses establish dendritic cells as a new osteoclast precursor able to generate bone-resorbing cells more efficiently than monocytes J. Bone Miner. Res. 2010 25 661 672 10.1359/jbmr.090829 19775202 Gallois, A. et al. Genome-wide expression analyses establish dendritic cells as a new osteoclast precursor able to generate bone-resorbing cells more efficiently than monocytes. J. Bone Miner. Res. 25 19775202 10.1359/jbmr.090829 133. Mensah KA Ritchlin CT Schwarz EM RANKL induces heterogeneous DC‐STAMPlo and DC‐STAMPhi osteoclast precursors of which the DC‐STAMPlo precursors are the master fusogens J. Cell. Physiol. 2010 223 76 83 10.1002/jcp.22012 20039274 PMC2814997 Mensah, K. A., Ritchlin, C. T. & Schwarz, E. M. RANKL induces heterogeneous DC‐STAMPlo and DC‐STAMPhi osteoclast precursors of which the DC‐STAMPlo precursors are the master fusogens. J. Cell. Physiol. 223 20039274 10.1002/jcp.22012 PMC2814997 134. Miyamoto H Osteoclast stimulatory transmembrane protein and dendritic cell–specific transmembrane protein cooperatively modulate cell–cell fusion to form osteoclasts and foreign body giant cells J. Bone Miner. Res. 2012 27 1289 1297 10.1002/jbmr.1575 22337159 Miyamoto, H. et al. Osteoclast stimulatory transmembrane protein and dendritic cell–specific transmembrane protein cooperatively modulate cell–cell fusion to form osteoclasts and foreign body giant cells. J. Bone Miner. Res. 27 22337159 10.1002/jbmr.1575 135. Chiu YH Ritchlin CT DC-STAMP: A key regulator in osteoclast differentiation J. Cell Physiol. 2016 231 2402 2407 10.1002/jcp.25389 27018136 PMC4946985 Chiu, Y. H. & Ritchlin, C. T. DC-STAMP: A key regulator in osteoclast differentiation. J. Cell Physiol. 231 27018136 10.1002/jcp.25389 PMC4946985 136. Wakkach A Bone marrow microenvironment controls the in vivo differentiation of murine dendritic cells into osteoclasts Blood 2008 112 5074 5083 10.1182/blood-2008-01-132787 18768394 Wakkach, A. et al. Bone marrow microenvironment controls the in vivo differentiation of murine dendritic cells into osteoclasts. Blood 112 18768394 10.1182/blood-2008-01-132787 137. Mawadda A Penninger JM Yen-Tung Andy T Immune interactions with CD4 + + J. Immunol. 2006 177 3314 3326 10.4049/jimmunol.177.5.3314 16920972 Mawadda, A., Penninger, J. M. & Yen-Tung Andy, T. Immune interactions with CD4 + + J. Immunol. 177 16920972 10.4049/jimmunol.177.5.3314 138. Tucci M Immature dendritic cells in multiple myeloma are prone to osteoclast-like differentiation through interleukin-17A stimulation Br. J. Haematol. 2013 161 821 831 10.1111/bjh.12333 23594390 Tucci, M. et al. Immature dendritic cells in multiple myeloma are prone to osteoclast-like differentiation through interleukin-17A stimulation. Br. J. Haematol. 161 23594390 10.1111/bjh.12333 139. Hwang SJ Choi B Kang SS Chang J-H Interleukin-34 produced by human fibroblast-like synovial cells in rheumatoid arthritis supports osteoclastogenesis Arthritis Res. Ther. 2012 14 R14 10.1186/ar3693 22264405 PMC3392804 Hwang, S. J., Choi, B., Kang, S. S. & Chang, J.-H. Interleukin-34 produced by human fibroblast-like synovial cells in rheumatoid arthritis supports osteoclastogenesis. Arthritis Res. Ther. 14 22264405 10.1186/ar3693 PMC3392804 140. Xiang L Gilkes DM The contribution of the immune system in bone metastasis pathogenesis Int. J. Mol. Sci. 2019 20 999 10.3390/ijms20040999 30823602 PMC6412551 Xiang, L. & Gilkes, D. M. The contribution of the immune system in bone metastasis pathogenesis. Int. J. Mol. Sci. 20 30823602 10.3390/ijms20040999 PMC6412551 141. Feuerer M Bone marrow microenvironment facilitating dendritic cell: CD4 T cell interactions and maintenance of CD4 memory Int. J. Oncol. 2004 25 867 876 15375534 Feuerer, M. et al. Bone marrow microenvironment facilitating dendritic cell: CD4 T cell interactions and maintenance of CD4 memory. Int. J. Oncol. 25 15375534 142. Mazo IB Bone marrow is a major reservoir and site of recruitment for central memory CD8 + Immunity 2005 22 259 270 10.1016/j.immuni.2005.01.008 15723813 Mazo, I. B. et al. Bone marrow is a major reservoir and site of recruitment for central memory CD8 + Immunity 22 15723813 10.1016/j.immuni.2005.01.008 143. Zhao E Bone marrow and the control of immunity Cell Mol. Immunol. 2012 9 11 19 10.1038/cmi.2011.47 22020068 PMC3251706 Zhao, E. et al. Bone marrow and the control of immunity. Cell Mol. Immunol. 9 22020068 10.1038/cmi.2011.47 PMC3251706 144. Thaqif EK T lymphocytes influence the mineralization process of bone Front. Immunol. 2017 8 562 10.3389/fimmu.2017.00562 28596766 PMC5442173 Thaqif, E. K. et al. T lymphocytes influence the mineralization process of bone. Front. Immunol. 8 28596766 10.3389/fimmu.2017.00562 PMC5442173 145. Taubman MA Valverde P Han X Kawai T Immune response: the key to bone resorption in periodontal disease J. Periodontol. 2005 76 2033 2041 10.1902/jop.2005.76.11-S.2033 16277573 Taubman, M. A., Valverde, P., Han, X. & Kawai, T. Immune response: the key to bone resorption in periodontal disease. J. Periodontol. 76 16277573 10.1902/jop.2005.76.11-S.2033 146. Hascoët E New insights into inflammatory osteoclast precursors as therapeutic targets for rheumatoid arthritis and periodontitis Bone Res. 2023 11 26 10.1038/s41413-023-00257-w 37217496 PMC10203317 Hascoët, E. et al. New insights into inflammatory osteoclast precursors as therapeutic targets for rheumatoid arthritis and periodontitis. Bone Res. 11 37217496 10.1038/s41413-023-00257-w PMC10203317 147. Yin X Chen S Eisenbarth SC Dendritic cell regulation of T helper cells Annu. Rev. Immunol. 2021 39 759 790 10.1146/annurev-immunol-101819-025146 33710920 Yin, X., Chen, S. & Eisenbarth, S. C. Dendritic cell regulation of T helper cells. Annu. Rev. Immunol. 39 33710920 10.1146/annurev-immunol-101819-025146 148. Hilligan KL Ronchese F Antigen presentation by dendritic cells and their instruction of CD4 + Cell. Mol. Immunol. 2020 17 587 599 10.1038/s41423-020-0465-0 32433540 PMC7264306 Hilligan, K. L. & Ronchese, F. Antigen presentation by dendritic cells and their instruction of CD4 + Cell. Mol. Immunol. 17 32433540 10.1038/s41423-020-0465-0 PMC7264306 149. Bhattacharyya ND Feng CG Regulation of T helper cell fate by TCR signal strength Front. Immunol. 2020 11 624 10.3389/fimmu.2020.00624 32508803 PMC7248325 Bhattacharyya, N. D. & Feng, C. G. Regulation of T helper cell fate by TCR signal strength. Front. Immunol. 11 32508803 10.3389/fimmu.2020.00624 PMC7248325 150. van Panhuys N TCR signal strength alters T-DC activation and interaction times and directs the outcome of differentiation Front. Immunol. 2016 7 6 26834747 10.3389/fimmu.2016.00006 PMC4725058 van Panhuys, N. TCR signal strength alters T-DC activation and interaction times and directs the outcome of differentiation. Front. Immunol. 7 26834747 10.3389/fimmu.2016.00006 PMC4725058 151. Gemmell E Seymour GJ Immunoregulatory control of Th1/Th2 cytokine profiles in periodontal disease Periodontology 2004 35 21 41 10.1111/j.0906-6713.2004.003557.x 15107056 Gemmell, E. & Seymour, G. J. Immunoregulatory control of Th1/Th2 cytokine profiles in periodontal disease. Periodontology 35 10.1111/j.0906-6713.2004.003557.x 15107056 152. Gerosa F Differential regulation of interleukin 12 and interleukin 23 production in human dendritic cells J. Exp. Med. 2008 205 1447 1461 10.1084/jem.20071450 18490488 PMC2413040 Gerosa, F. et al. Differential regulation of interleukin 12 and interleukin 23 production in human dendritic cells. J. Exp. Med. 205 18490488 10.1084/jem.20071450 PMC2413040 153. Gao Y IFN-gamma stimulates osteoclast formation and bone loss in vivo via antigen-driven T cell activation J. Clin. Invest. 2007 117 122 132 10.1172/JCI30074 17173138 PMC1697800 Gao, Y. et al. IFN-gamma stimulates osteoclast formation and bone loss in vivo via antigen-driven T cell activation. J. Clin. Invest. 117 17173138 10.1172/JCI30074 PMC1697800 154. Miller HL Altered ratio of dendritic cell subsets in skin-draining lymph nodes promotes Th2-driven contact hypersensitivity Proc. Natl. Acad. Sci. USA 2021 118 e2021364118 10.1073/pnas.2021364118 33431694 PMC7826349 Miller, H. L. et al. Altered ratio of dendritic cell subsets in skin-draining lymph nodes promotes Th2-driven contact hypersensitivity. Proc. Natl. Acad. Sci. USA 118 33431694 10.1073/pnas.2021364118 PMC7826349 155. Izumi G CD11b + Nat. Commun. 2021 12 5029 10.1038/s41467-021-25307-x 34413303 PMC8377117 Izumi, G. et al. CD11b + Nat. Commun. 12 34413303 10.1038/s41467-021-25307-x PMC8377117 156. Houlder EL Pulmonary inflammation promoted by type-2 dendritic cells is a feature of human and murine schistosomiasis Nat. Commun. 2023 14 1863 10.1038/s41467-023-37502-z 37012228 PMC10070318 Houlder, E. L. et al. Pulmonary inflammation promoted by type-2 dendritic cells is a feature of human and murine schistosomiasis. Nat. Commun. 14 37012228 10.1038/s41467-023-37502-z PMC10070318 157. Mayer JU Different populations of CD11b + Nat. Commun. 2017 8 15820 10.1038/ncomms15820 28598427 PMC5472728 Mayer, J. U. et al. Different populations of CD11b + Nat. Commun. 8 28598427 10.1038/ncomms15820 PMC5472728 158. Canavan M Functionally mature CD1c + Front. Immunol. 2021 12 745226 10.3389/fimmu.2021.745226 34691053 PMC8529992 Canavan, M. et al. Functionally mature CD1c + Front. Immunol. 12 34691053 10.3389/fimmu.2021.745226 PMC8529992 159. Boltjes A Conventional dendritic cells type 1 are strongly enriched, quiescent and relatively tolerogenic in local inflammatory arthritis Front. Immunol. 2022 13 1101999 10.3389/fimmu.2022.1101999 36685500 PMC9846246 Boltjes, A. et al. Conventional dendritic cells type 1 are strongly enriched, quiescent and relatively tolerogenic in local inflammatory arthritis. Front. Immunol. 13 36685500 10.3389/fimmu.2022.1101999 PMC9846246 160. Lloyd CM Snelgrove RJ Type 2 immunity: expanding our view Sci. Immunol. 2018 3 eaat1604 10.1126/sciimmunol.aat1604 29980619 Lloyd, C. M. & Snelgrove, R. J. Type 2 immunity: expanding our view. Sci. Immunol. 3 29980619 10.1126/sciimmunol.aat1604 161. Martin KE Host type 2 immune response to xenogeneic serum components impairs biomaterial-directed osteo-regenerative therapies Biomaterials 2022 286 121601 10.1016/j.biomaterials.2022.121601 35660823 PMC11458135 Martin, K. E. et al. Host type 2 immune response to xenogeneic serum components impairs biomaterial-directed osteo-regenerative therapies. Biomaterials 286 35660823 10.1016/j.biomaterials.2022.121601 PMC11458135 162. Lamiable O Mayer JU Munoz-Erazo L Ronchese F Dendritic cells in Th2 immune responses and allergic sensitization Immunol. Cell Biol. 2020 98 807 818 10.1111/imcb.12387 32738152 Lamiable, O., Mayer, J. U., Munoz-Erazo, L. & Ronchese, F. Dendritic cells in Th2 immune responses and allergic sensitization. Immunol. Cell Biol. 98 32738152 10.1111/imcb.12387 163. Gao Y Control of T helper 2 responses by transcription factor IRF4-dependent dendritic cells Immunity 2013 39 722 732 10.1016/j.immuni.2013.08.028 24076050 PMC4110745 Gao, Y. et al. Control of T helper 2 responses by transcription factor IRF4-dependent dendritic cells. Immunity 39 24076050 10.1016/j.immuni.2013.08.028 PMC4110745 164. Williams JW Transcription factor IRF4 drives dendritic cells to promote Th2 differentiation Nat. Commun. 2013 4 2990 10.1038/ncomms3990 24356538 PMC4003872 Williams, J. W. et al. Transcription factor IRF4 drives dendritic cells to promote Th2 differentiation. Nat. Commun. 4 24356538 10.1038/ncomms3990 PMC4003872 165. Tussiwand R Klf4 expression in conventional dendritic cells is required for T helper 2 cell responses Immunity 2015 42 916 928 10.1016/j.immuni.2015.04.017 25992862 PMC4447135 Tussiwand, R. et al. Klf4 expression in conventional dendritic cells is required for T helper 2 cell responses. Immunity 42 25992862 10.1016/j.immuni.2015.04.017 PMC4447135 166. Walker JA McKenzie ANJ TH2 cell development and function Nat. Rev. Immunol. 2018 18 121 133 10.1038/nri.2017.118 29082915 Walker, J. A. & McKenzie, A. N. J. TH2 cell development and function. Nat. Rev. Immunol. 18 29082915 10.1038/nri.2017.118 167. León B A model of Th2 differentiation based on polarizing cytokine repression Trends Immunol. 2023 44 399 407 10.1016/j.it.2023.04.004 37100645 PMC10219849 León, B. A model of Th2 differentiation based on polarizing cytokine repression. Trends Immunol. 44 37100645 10.1016/j.it.2023.04.004 PMC10219849 168. Yamada H The search for the pathogenic T cells in the joint of rheumatoid arthritis: which T-cell subset drives autoimmune inflammation? Int. J. Mol. Sci. 2023 24 6930 10.3390/ijms24086930 37108093 PMC10138952 Yamada, H. et al. The search for the pathogenic T cells in the joint of rheumatoid arthritis: which T-cell subset drives autoimmune inflammation? Int. J. Mol. Sci. 24 37108093 10.3390/ijms24086930 PMC10138952 169. Yasuda K Takeuchi Y Hirota K The pathogenicity of Th17 cells in autoimmune diseases Semin. Immunopathol. 2019 41 283 297 10.1007/s00281-019-00733-8 30891627 Yasuda, K., Takeuchi, Y. & Hirota, K. The pathogenicity of Th17 cells in autoimmune diseases. Semin. Immunopathol. 41 30891627 10.1007/s00281-019-00733-8 170. Sato K Th17 functions as an osteoclastogenic helper T cell subset that links T cell activation and bone destruction J. Exp. Med. 2006 203 2673 2682 10.1084/jem.20061775 17088434 PMC2118166 Sato, K. et al. Th17 functions as an osteoclastogenic helper T cell subset that links T cell activation and bone destruction. J. Exp. Med. 203 17088434 10.1084/jem.20061775 PMC2118166 171. Ruddy MJ Functional cooperation between interleukin-17 and tumor necrosis factor-alpha is mediated by CCAAT/enhancer-binding protein family members J. Biol. Chem. 2004 279 2559 2567 10.1074/jbc.M308809200 14600152 Ruddy, M. J. et al. Functional cooperation between interleukin-17 and tumor necrosis factor-alpha is mediated by CCAAT/enhancer-binding protein family members. J. Biol. Chem. 279 14600152 10.1074/jbc.M308809200 172. Lin Y-J Anzaghe M Schülke S update on the pathomechanism, diagnosis, and treatment options for rheumatoid arthritis Cells 2020 9 880 10.3390/cells9040880 32260219 PMC7226834 Lin, Y.-J., Anzaghe, M. & Schülke, S. update on the pathomechanism, diagnosis, and treatment options for rheumatoid arthritis. Cells 9 32260219 10.3390/cells9040880 PMC7226834 173. Heink S Trans-presentation of IL-6 by dendritic cells is required for the priming of pathogenic TH17 cells Nat. Immunol. 2017 18 74 85 10.1038/ni.3632 27893700 PMC5164931 Heink, S. et al. Trans-presentation of IL-6 by dendritic cells is required for the priming of pathogenic TH17 cells. Nat. Immunol. 18 27893700 10.1038/ni.3632 PMC5164931 174. Anderson DM A homologue of the TNF receptor and its ligand enhance T-cell growth and dendritic-cell function Nature 1997 390 175 179 10.1038/36593 9367155 Anderson, D. M. et al. A homologue of the TNF receptor and its ligand enhance T-cell growth and dendritic-cell function. Nature 390 9367155 10.1038/36593 175. Lyu Z Hu Y Guo Y Liu D Modulation of bone remodeling by the gut microbiota: a new therapy for osteoporosis Bone Res. 2023 11 31 10.1038/s41413-023-00264-x 37296111 PMC10256815 Lyu, Z., Hu, Y., Guo, Y. & Liu, D. Modulation of bone remodeling by the gut microbiota: a new therapy for osteoporosis. Bone Res. 11 37296111 10.1038/s41413-023-00264-x PMC10256815 176. Takayanagi H T-cell-mediated regulation of osteoclastogenesis by signalling cross-talk between RANKL and IFN-gamma Nature 2000 408 600 605 10.1038/35046102 11117749 Takayanagi, H. et al. T-cell-mediated regulation of osteoclastogenesis by signalling cross-talk between RANKL and IFN-gamma. Nature 408 11117749 10.1038/35046102 177. Ibáñez L Inflammatory osteoclasts prime TNFα-producing CD4 + J. Bone Miner. Res. 2016 31 1899 1908 10.1002/jbmr.2868 27161765 Ibáñez, L. et al. Inflammatory osteoclasts prime TNFα-producing CD4 + J. Bone Miner. Res. 31 27161765 10.1002/jbmr.2868 178. Bachmann MF TRANCE, a tumor necrosis factor family member critical for CD40 ligand-independent T helper cell activation J. Exp. Med. 1999 189 1025 1031 10.1084/jem.189.7.1025 10190893 PMC2193017 Bachmann, M. F. et al. TRANCE, a tumor necrosis factor family member critical for CD40 ligand-independent T helper cell activation. J. Exp. Med. 189 10190893 10.1084/jem.189.7.1025 PMC2193017 179. Wong BR TRANCE (tumor necrosis factor [TNF]-related activation-induced cytokine), a new TNF family member predominantly expressed in T cells, is a dendritic cell-specific survival factor J. Exp. Med. 1997 186 2075 2080 10.1084/jem.186.12.2075 9396779 PMC2199171 Wong, B. R. et al. TRANCE (tumor necrosis factor [TNF]-related activation-induced cytokine), a new TNF family member predominantly expressed in T cells, is a dendritic cell-specific survival factor. J. Exp. Med. 186 9396779 10.1084/jem.186.12.2075 PMC2199171 180. Ouaaz F Arron J Zheng Y Choi Y Beg AA Dendritic cell development and survival require distinct NF-kappaB subunits Immunity 2002 16 257 270 10.1016/S1074-7613(02)00272-8 11869686 Ouaaz, F., Arron, J., Zheng, Y., Choi, Y. & Beg, A. A. Dendritic cell development and survival require distinct NF-kappaB subunits. Immunity 16 11869686 10.1016/s1074-7613(02)00272-8 181. Josien R Wong BR Li HL Steinman RM Choi Y TRANCE, a TNF family member, is differentially expressed on T cell subsets and induces cytokine production in dendritic cells J. Immunol. 1999 162 2562 2568 10.4049/jimmunol.162.5.2562 10072496 Josien, R., Wong, B. R., Li, H. L., Steinman, R. M. & Choi, Y. TRANCE, a TNF family member, is differentially expressed on T cell subsets and induces cytokine production in dendritic cells. J. Immunol. 162 10072496 182. Theill LE Boyle WJ Penninger JM RANK-L and RANK: T cells, bone loss, and mammalian evolution Annu. Rev. Immunol. 2002 20 795 823 10.1146/annurev.immunol.20.100301.064753 11861618 Theill, L. E., Boyle, W. J. & Penninger, J. M. RANK-L and RANK: T cells, bone loss, and mammalian evolution. Annu. Rev. Immunol. 20 11861618 10.1146/annurev.immunol.20.100301.064753 183. Lutz MB Schuler G Immature, semi-mature and fully mature dendritic cells: which signals induce tolerance or immunity? Trends Immunol. 2002 23 445 449 10.1016/S1471-4906(02)02281-0 12200066 Lutz, M. B. & Schuler, G. Immature, semi-mature and fully mature dendritic cells: which signals induce tolerance or immunity? Trends Immunol. 23 12200066 10.1016/s1471-4906(02)02281-0 184. Akbari O DeKruyff RH Umetsu DT Pulmonary dendritic cells producing IL-10 mediate tolerance induced by respiratory exposure to antigen Nat. Immunol. 2001 2 725 731 10.1038/90667 11477409 Akbari, O., DeKruyff, R. H. & Umetsu, D. T. Pulmonary dendritic cells producing IL-10 mediate tolerance induced by respiratory exposure to antigen. Nat. Immunol. 2 11477409 10.1038/90667 185. Morante-Palacios O Fondelli F Ballestar E Martínez-Cáceres EM Tolerogenic dendritic cells in autoimmunity and inflammatory diseases Trends Immunol. 2021 42 59 75 10.1016/j.it.2020.11.001 33293219 Morante-Palacios, O., Fondelli, F., Ballestar, E. & Martínez-Cáceres, E. M. Tolerogenic dendritic cells in autoimmunity and inflammatory diseases. Trends Immunol. 42 33293219 10.1016/j.it.2020.11.001 186. Steinman RM Turley S Mellman I Inaba K The induction of tolerance by dendritic cells that have captured apoptotic cells J. Exp. Med. 2000 191 411 416 10.1084/jem.191.3.411 10662786 PMC2195815 Steinman, R. M., Turley, S., Mellman, I. & Inaba, K. The induction of tolerance by dendritic cells that have captured apoptotic cells. J. Exp. Med. 191 10662786 10.1084/jem.191.3.411 PMC2195815 187. Jansen MAA Matured tolerogenic dendritic cells effectively inhibit autoantigen specific CD4 + Front. Immunol. 2019 10 2068 10.3389/fimmu.2019.02068 31555285 PMC6724516 Jansen, M. A. A. et al. Matured tolerogenic dendritic cells effectively inhibit autoantigen specific CD4 + Front. Immunol. 10 31555285 10.3389/fimmu.2019.02068 PMC6724516 188. Patakas A Abatacept inhibition of T cell priming in mice by induction of a unique transcriptional profile that reduces their ability to activate antigen-presenting cells Arthritis Rheumatol. 2016 68 627 638 10.1002/art.39470 26473409 Patakas, A. et al. Abatacept inhibition of T cell priming in mice by induction of a unique transcriptional profile that reduces their ability to activate antigen-presenting cells. Arthritis Rheumatol. 68 26473409 10.1002/art.39470 189. Fiyouzi T Pelaez-Prestel HF Reyes-Manzanas R Lafuente EM Reche PA Enhancing regulatory T cells to treat inflammatory and autoimmune diseases Int. J. Mol. Sci. 2023 24 7797 10.3390/ijms24097797 37175505 PMC10177847 Fiyouzi, T., Pelaez-Prestel, H. F., Reyes-Manzanas, R., Lafuente, E. M. & Reche, P. A. Enhancing regulatory T cells to treat inflammatory and autoimmune diseases. Int. J. Mol. Sci. 24 37175505 10.3390/ijms24097797 PMC10177847 190. Watkins B Phase II trial of costimulation blockade with abatacept for prevention of acute GVHD J. Clin. Oncol. 2021 39 1865 1877 10.1200/JCO.20.01086 33449816 PMC8260909 Watkins, B. et al. Phase II trial of costimulation blockade with abatacept for prevention of acute GVHD. J. Clin. Oncol. 39 33449816 10.1200/JCO.20.01086 PMC8260909 191. Ko H-J CTLA4-Ig modifies dendritic cells from mice with collagen-induced arthritis to increase the CD4 + + + J. Autoimmun. 2010 34 111 120 10.1016/j.jaut.2009.07.006 19665867 Ko, H.-J. et al. CTLA4-Ig modifies dendritic cells from mice with collagen-induced arthritis to increase the CD4 + + + J. Autoimmun. 34 19665867 10.1016/j.jaut.2009.07.006 192. Alissafi T Tregs restrain dendritic cell autophagy to ameliorate autoimmunity J. Clin. Invest. 2017 127 2789 2804 10.1172/JCI92079 28581446 PMC5490766 Alissafi, T. et al. Tregs restrain dendritic cell autophagy to ameliorate autoimmunity. J. Clin. Invest. 127 28581446 10.1172/JCI92079 PMC5490766 193. Yan J Liu B Shi Y Qi H Class II MHC-independent suppressive adhesion of dendritic cells by regulatory T cells in vivo J. Exp. Med. 2017 214 319 326 10.1084/jem.20160629 28082359 PMC5294853 Yan, J., Liu, B., Shi, Y. & Qi, H. Class II MHC-independent suppressive adhesion of dendritic cells by regulatory T cells in vivo. J. Exp. Med. 214 28082359 10.1084/jem.20160629 PMC5294853 194. Chen J Strong adhesion by regulatory T cells induces dendritic cell cytoskeletal polarization and contact-dependent lethargy J. Exp. Med. 2017 214 327 338 10.1084/jem.20160620 28082358 PMC5294852 Chen, J. et al. Strong adhesion by regulatory T cells induces dendritic cell cytoskeletal polarization and contact-dependent lethargy. J. Exp. Med. 214 28082358 10.1084/jem.20160620 PMC5294852 195. Schmidt A Oberle N Krammer PH Molecular mechanisms of treg-mediated T cell suppression Front. Immunol. 2012 3 51 10.3389/fimmu.2012.00051 22566933 PMC3341960 Schmidt, A., Oberle, N. & Krammer, P. H. Molecular mechanisms of treg-mediated T cell suppression. Front. Immunol. 3 22566933 10.3389/fimmu.2012.00051 PMC3341960 196. Giampaolo S Wójcik G Klein-Hessling S Serfling E Patra AK B cell development is critically dependent on NFATc1 activity Cell Mol. Immunol. 2019 16 508 520 10.1038/s41423-018-0052-9 29907883 PMC6474210 Giampaolo, S., Wójcik, G., Klein-Hessling, S., Serfling, E. & Patra, A. K. B cell development is critically dependent on NFATc1 activity. Cell Mol. Immunol. 16 29907883 10.1038/s41423-018-0052-9 PMC6474210 197. Fischer V Haffner-Luntzer M Interaction between bone and immune cells: Implications for postmenopausal osteoporosis Semin. Cell Dev. Biol. 2022 123 14 21 10.1016/j.semcdb.2021.05.014 34024716 Fischer, V. & Haffner-Luntzer, M. Interaction between bone and immune cells: Implications for postmenopausal osteoporosis. Semin. Cell Dev. Biol. 123 34024716 10.1016/j.semcdb.2021.05.014 198. Pan M Hong W Yao Y Gao X Xu X Activated B lymphocyte inhibited the osteoblastogenesis of bone mesenchymal stem cells by notch signaling Stem Cells Int. 2019 2019 8150123 10.1155/2019/8150123 31281386 PMC6589309 Pan, M., Hong, W., Yao, Y., Gao, X. & Xu, X. Activated B lymphocyte inhibited the osteoblastogenesis of bone mesenchymal stem cells by notch signaling. Stem Cells Int. 2019 31281386 10.1155/2019/8150123 PMC6589309 199. Zhang H Single-cell RNA sequencing reveals B cells are important regulators in fracture healing Front. Endocrinol. (Lausanne) 2021 12 666140 10.3389/fendo.2021.666140 34819916 PMC8606664 Zhang, H. et al. Single-cell RNA sequencing reveals B cells are important regulators in fracture healing. Front. Endocrinol. (Lausanne) 12 34819916 10.3389/fendo.2021.666140 PMC8606664 200. Han Y Jin Y Miao Y Shi T Lin X Improved RANKL expression and osteoclastogenesis induction of CD27 + - J. periodontal Res. 2019 54 73 80 10.1111/jre.12606 30346027 Han, Y., Jin, Y., Miao, Y., Shi, T. & Lin, X. Improved RANKL expression and osteoclastogenesis induction of CD27 + - J. periodontal Res. 54 30346027 10.1111/jre.12606 201. Xiao P In vivo genome-wide expression study on human circulating B cells suggests a novel ESR1 and MAPK3 network for postmenopausal osteoporosis J. Bone Miner. Res. 2010 23 644 654 10.1359/jbmr.080105 PMC2674539 18433299 Xiao, P. et al. In vivo genome-wide expression study on human circulating B cells suggests a novel ESR1 and MAPK3 network for postmenopausal osteoporosis. J. Bone Miner. Res. 23 10.1359/JBMR.080105 PMC2674539 18433299 202. Sun W B cells inhibit bone formation in rheumatoid arthritis by suppressing osteoblast differentiation Nat. Commun. 2018 9 5127 10.1038/s41467-018-07626-8 30510188 PMC6277442 Sun, W. et al. B cells inhibit bone formation in rheumatoid arthritis by suppressing osteoblast differentiation. Nat. Commun. 9 30510188 10.1038/s41467-018-07626-8 PMC6277442 203. Giuliani N Human myeloma cells stimulate the receptor activator of nuclear factor-kappa B ligand (RANKL) in T lymphocytes: a potential role in multiple myeloma bone disease Blood 2002 100 4615 4621 10.1182/blood-2002-04-1121 12393684 Giuliani, N. et al. Human myeloma cells stimulate the receptor activator of nuclear factor-kappa B ligand (RANKL) in T lymphocytes: a potential role in multiple myeloma bone disease. Blood 100 12393684 10.1182/blood-2002-04-1121 204. Deal EM Lahl K Narváez CF Butcher EC Greenberg HB Plasmacytoid dendritic cells promote rotavirus-induced human and murine B cell responses J. Clin. Invest. 2013 123 2464 2474 10.1172/JCI60945 23635775 PMC3668833 Deal, E. M., Lahl, K., Narváez, C. F., Butcher, E. C. & Greenberg, H. B. Plasmacytoid dendritic cells promote rotavirus-induced human and murine B cell responses. J. Clin. Invest. 123 23635775 10.1172/JCI60945 PMC3668833 205. Duan L Follicular dendritic cells restrict interleukin-4 availability in germinal centers and foster memory B cell generation Immunity 2021 54 2256 2272 10.1016/j.immuni.2021.08.028 34555336 PMC8516727 Duan, L. et al. Follicular dendritic cells restrict interleukin-4 availability in germinal centers and foster memory B cell generation. Immunity 54 34555336 10.1016/j.immuni.2021.08.028 PMC8516727 206. El Shikh MEM El Sayed RM Sukumar S Szakal AK Tew JG Activation of B cells by antigens on follicular dendritic cells Trends Immunol. 2010 31 205 211 10.1016/j.it.2010.03.002 20418164 PMC2886728 El Shikh, M. E. M., El Sayed, R. M., Sukumar, S., Szakal, A. K. & Tew, J. G. Activation of B cells by antigens on follicular dendritic cells. Trends Immunol. 31 20418164 10.1016/j.it.2010.03.002 PMC2886728 207. El Shikh ME El Sayed RM Szakal AK Tew JG T-independent antibody responses to T-dependent antigens: a novel follicular dendritic cell-dependent activity J. Immunol. 2009 182 3482 3491 10.4049/jimmunol.0802317 19265126 El Shikh, M. E., El Sayed, R. M., Szakal, A. K. & Tew, J. G. T-independent antibody responses to T-dependent antigens: a novel follicular dendritic cell-dependent activity. J. Immunol. 182 19265126 10.4049/jimmunol.0802317 208. Wykes M Pombo A Jenkins C Macpherson GG Dendritic cells interact directly with naive B lymphocytes to transfer antigen and initiate class switching in a primary T-dependent response J. Immunol. 1998 161 1313 1319 10.4049/jimmunol.161.3.1313 9686593 Wykes, M., Pombo, A., Jenkins, C. & Macpherson, G. G. Dendritic cells interact directly with naive B lymphocytes to transfer antigen and initiate class switching in a primary T-dependent response. J. Immunol. 161 9686593 209. Das A Follicular dendritic cell activation by TLR ligands promotes autoreactive B cell responses Immunity 2017 46 106 119 10.1016/j.immuni.2016.12.014 28099860 PMC8140609 Das, A. et al. Follicular dendritic cell activation by TLR ligands promotes autoreactive B cell responses. Immunity 46 28099860 10.1016/j.immuni.2016.12.014 PMC8140609 210. Takemura S Lymphoid neogenesis in rheumatoid synovitis J. Immunol. 2001 167 1072 1080 10.4049/jimmunol.167.2.1072 11441118 Takemura, S. et al. Lymphoid neogenesis in rheumatoid synovitis. J. Immunol. 167 11441118 10.4049/jimmunol.167.2.1072 211. Tew JG Kosco MH Burton GF Szakal AK Follicular dendritic cells as accessory cells Immunological Rev. 1990 117 185 211 10.1111/j.1600-065X.1990.tb00573.x 2258191 Tew, J. G., Kosco, M. H., Burton, G. F. & Szakal, A. K. Follicular dendritic cells as accessory cells. Immunological Rev. 117 10.1111/j.1600-065x.1990.tb00573.x 2258191 212. El Shikh MEM Pitzalis C Follicular dendritic cells in health and disease Front. Immunol. 2012 3 292 10.3389/fimmu.2012.00292 23049531 PMC3448061 El Shikh, M. E. M. & Pitzalis, C. Follicular dendritic cells in health and disease. Front. Immunol. 3 23049531 10.3389/fimmu.2012.00292 PMC3448061 213. Shabgah AG Shariati-Sarabi Z Tavakkol-Afshari J Mohammadi M The role of BAFF and APRIL in rheumatoid arthritis J. Cell. Physiol. 2019 234 17050 17063 10.1002/jcp.28445 30941763 Shabgah, A. G., Shariati-Sarabi, Z., Tavakkol-Afshari, J. & Mohammadi, M. The role of BAFF and APRIL in rheumatoid arthritis. J. Cell. Physiol. 234 30941763 10.1002/jcp.28445 214. Zhou B Therapeutic effects of a novel BAFF blocker on arthritis Signal Transduct. Target Ther. 2019 4 19 10.1038/s41392-019-0051-z 31231554 PMC6565627 Zhou, B. et al. Therapeutic effects of a novel BAFF blocker on arthritis. Signal Transduct. Target Ther. 4 31231554 10.1038/s41392-019-0051-z PMC6565627 215. Shurin MR BAFF and APRIL from activin A-treated dendritic cells upregulate the antitumor efficacy of dendritic cells in vivo Cancer Res. 2016 76 4959 4969 10.1158/0008-5472.CAN-15-2668 27364554 PMC5010463 Shurin, M. R. et al. BAFF and APRIL from activin A-treated dendritic cells upregulate the antitumor efficacy of dendritic cells in vivo. Cancer Res. 76 27364554 10.1158/0008-5472.CAN-15-2668 PMC5010463 216. He C Cellular membrane-based vesicles displaying a reconstructed B cell maturation antigen for multiple myeloma therapy by dual targeting APRIL and BAFF Acta Biomater. 2022 143 406 417 10.1016/j.actbio.2022.02.028 35218967 He, C. et al. Cellular membrane-based vesicles displaying a reconstructed B cell maturation antigen for multiple myeloma therapy by dual targeting APRIL and BAFF. Acta Biomater. 143 35218967 10.1016/j.actbio.2022.02.028 217. Tai YT APRIL and BCMA promote human multiple myeloma growth and immunosuppression in the bone marrow microenvironment Blood 2016 127 3225 10.1182/blood-2016-01-691162 27127303 PMC4920023 Tai, Y. T. et al. APRIL and BCMA promote human multiple myeloma growth and immunosuppression in the bone marrow microenvironment. Blood 127 27127303 10.1182/blood-2016-01-691162 PMC4920023 218. Wykes M MacPherson G Dendritic cell-B-cell interaction: dendritic cells provide B cells with CD40-independent proliferation signals and CD40-dependent survival signals Immunology 2000 100 1 3 10.1046/j.1365-2567.2000.00044.x 10809952 PMC2326988 Wykes, M. & MacPherson, G. Dendritic cell-B-cell interaction: dendritic cells provide B cells with CD40-independent proliferation signals and CD40-dependent survival signals. Immunology 100 10809952 10.1046/j.1365-2567.2000.00044.x PMC2326988 219. Zhang H A distinct subset of plasmacytoid dendritic cells induces activation and differentiation of B and T lymphocytes Proc. Natl. Acad. Sci. USA 2017 114 1988 10.1073/pnas.1610630114 28167780 PMC5338447 Zhang, H. et al. A distinct subset of plasmacytoid dendritic cells induces activation and differentiation of B and T lymphocytes. Proc. Natl. Acad. Sci. USA 114 28167780 10.1073/pnas.1610630114 PMC5338447 220. Santos L Dendritic cell-dependent inhibition of B cell proliferation requires CD22 J. Immunol. 2008 180 4561 4569 10.4049/jimmunol.180.7.4561 18354178 PMC2728079 Santos, L. et al. Dendritic cell-dependent inhibition of B cell proliferation requires CD22. J. Immunol. 180 18354178 10.4049/jimmunol.180.7.4561 PMC2728079 221. Sindhava VJ Bone marrow dendritic cell-mediated regulation of TLR and B cell receptor signaling in B cells J. Immunol. 2012 189 3355 3367 10.4049/jimmunol.1101352 22942427 PMC3495978 Sindhava, V. J. et al. Bone marrow dendritic cell-mediated regulation of TLR and B cell receptor signaling in B cells. J. Immunol. 189 22942427 10.4049/jimmunol.1101352 PMC3495978 222. Mansour A Osteoclast activity modulates B-cell development in the bone marrow Cell Res. 2011 21 1102 1115 10.1038/cr.2011.21 21321604 PMC3193501 Mansour, A. et al. Osteoclast activity modulates B-cell development in the bone marrow. Cell Res. 21 21321604 10.1038/cr.2011.21 PMC3193501 223. Blin-Wakkach C Wakkach A Sexton PM Rochet N Carle GF Hematological defects in the oc/oc mouse, a model of infantile malignant osteopetrosis Leukemia 2004 18 1505 1511 10.1038/sj.leu.2403449 15284856 Blin-Wakkach, C., Wakkach, A., Sexton, P. M., Rochet, N. & Carle, G. F. Hematological defects in the oc/oc mouse, a model of infantile malignant osteopetrosis. Leukemia 18 15284856 10.1038/sj.leu.2403449 224. Yeo L Cytokine mRNA profiling identifies B cells as a major source of RANKL in rheumatoid arthritis Ann. Rheum. Dis. 2011 70 2022 2028 10.1136/ard.2011.153312 21742639 PMC3184241 Yeo, L. et al. Cytokine mRNA profiling identifies B cells as a major source of RANKL in rheumatoid arthritis. Ann. Rheum. Dis. 70 21742639 10.1136/ard.2011.153312 PMC3184241 225. Kawai T B and T lymphocytes are the primary sources of RANKL in the bone resorptive lesion of periodontal disease Am. J. Pathol. 2006 169 987 998 10.2353/ajpath.2006.060180 16936272 PMC1698808 Kawai, T. et al. B and T lymphocytes are the primary sources of RANKL in the bone resorptive lesion of periodontal disease. Am. J. Pathol. 169 16936272 10.2353/ajpath.2006.060180 PMC1698808 226. Ratta M Dendritic cells are functionally defective in multiple myeloma: the role of interleukin-6 Blood 2002 100 230 237 10.1182/blood.V100.1.230 12070032 Ratta, M. et al. Dendritic cells are functionally defective in multiple myeloma: the role of interleukin-6. Blood 100 12070032 10.1182/blood.v100.1.230 227. Brown R Either interleukin-12 or interferon-gamma can correct the dendritic cell defect induced by transforming growth factor beta in patients with myeloma Br. J. Haematol. 2004 125 743 748 10.1111/j.1365-2141.2004.04984.x 15180863 Brown, R. et al. Either interleukin-12 or interferon-gamma can correct the dendritic cell defect induced by transforming growth factor beta in patients with myeloma. Br. J. Haematol. 125 15180863 10.1111/j.1365-2141.2004.04984.x 228. English K French A Wood KJ Mesenchymal stromal cells: facilitators of successful transplantation? Cell Stem Cell 2010 7 431 442 10.1016/j.stem.2010.09.009 20887949 English, K., French, A. & Wood, K. J. Mesenchymal stromal cells: facilitators of successful transplantation? Cell Stem Cell 7 20887949 10.1016/j.stem.2010.09.009 229. Blanc KL Davies LC MSCs—cells with many sides Cytotherapy 2018 20 273 278 10.1016/j.jcyt.2018.01.009 29434007 Blanc, K. L. & Davies, L. C. MSCs—cells with many sides. Cytotherapy 20 29434007 10.1016/j.jcyt.2018.01.009 230. Dai J Rottau D Kohler F Reinert S Alexander D Effects of jaw periosteal cells on dendritic cell maturation J. Clin. Med. 2018 7 312 10.3390/jcm7100312 30274241 PMC6210277 Dai, J., Rottau, D., Kohler, F., Reinert, S. & Alexander, D. Effects of jaw periosteal cells on dendritic cell maturation. J. Clin. Med. 7 30274241 10.3390/jcm7100312 PMC6210277 231. Bernardo ME Fibbe WE Mesenchymal stromal cells: sensors and switchers of inflammation Cell Stem Cell 2013 13 392 402 10.1016/j.stem.2013.09.006 24094322 Bernardo, M. E. & Fibbe, W. E. Mesenchymal stromal cells: sensors and switchers of inflammation. Cell Stem Cell 13 24094322 10.1016/j.stem.2013.09.006 232. Jiang XX Zhang Y Bing L Zhang SX Wu Y Human mesenchymal stem cells inhibit differentiation and function of monocyte-derived dendritic cells Blood 2005 105 4120 4126 10.1182/blood-2004-02-0586 15692068 Jiang, X. X., Zhang, Y., Bing, L., Zhang, S. X. & Wu, Y. Human mesenchymal stem cells inhibit differentiation and function of monocyte-derived dendritic cells. Blood 105 15692068 10.1182/blood-2004-02-0586 233. Kiernan CH Allogeneic chondrogenically differentiated human bone marrow stromal cells do not induce dendritic cell maturation Wiley-Blackwell Online Open 2018 12 1530 1540 10.1002/term.2682 PMC6032931 29702747 Kiernan, C. H. et al. Allogeneic chondrogenically differentiated human bone marrow stromal cells do not induce dendritic cell maturation. Wiley-Blackwell Online Open 12 10.1002/term.2682 PMC6032931 29702747 234. Chen X Chondrogenic differentiation alters the immunosuppressive property of bone marrow-derived mesenchymal stem cells, and the effect is partially due to the upregulated expression of B7 molecules Stem Cells 2007 25 364 370 10.1634/stemcells.2006-0268 17068184 Chen, X. et al. Chondrogenic differentiation alters the immunosuppressive property of bone marrow-derived mesenchymal stem cells, and the effect is partially due to the upregulated expression of B7 molecules. Stem Cells 25 17068184 10.1634/stemcells.2006-0268 235. Ryan AE Chondrogenic differentiation increases antidonor immune response to allogeneic mesenchymal stem cell transplantation Mol. Ther. 2014 22 655 667 10.1038/mt.2013.261 24184966 PMC3944342 Ryan, A. E. et al. Chondrogenic differentiation increases antidonor immune response to allogeneic mesenchymal stem cell transplantation. Mol. Ther. 22 24184966 10.1038/mt.2013.261 PMC3944342 236. Sara T The human mesenchymal stromal cell-derived osteocyte capacity to modulate dendritic cell functions is strictly dependent on the culture system J. Immunological Res. 2015 2015 526195 10.1155/2015/526195 PMC4515297 26247040 Sara, T. et al. The human mesenchymal stromal cell-derived osteocyte capacity to modulate dendritic cell functions is strictly dependent on the culture system. J. Immunological Res. 2015 10.1155/2015/526195 PMC4515297 26247040 237. English K Barry FP Mahon BP Murine mesenchymal stem cells suppress dendritic cell migration, maturation and antigen presentation Immunol. Lett. 2008 115 50 58 10.1016/j.imlet.2007.10.002 18022251 English, K., Barry, F. P. & Mahon, B. P. Murine mesenchymal stem cells suppress dendritic cell migration, maturation and antigen presentation. Immunol. Lett. 115 18022251 10.1016/j.imlet.2007.10.002 238. Ceccarelli GG Osteogenic potential of human oral-periosteal cells (PCs) isolated from different oral origin: an in vitro study J. Cell. Physiol. 2016 231 607 612 10.1002/jcp.25104 26206324 Ceccarelli, G. G. et al. Osteogenic potential of human oral-periosteal cells (PCs) isolated from different oral origin: an in vitro study. J. Cell. Physiol. 231 26206324 10.1002/jcp.25104 239. Hsiao HY Yang CY Liu JW Brey EM Cheng MH Periosteal osteogenic capacity depends on tissue source Tissue Eng., Part A 2018 24 1733 1741 10.1089/ten.tea.2018.0009 29901423 Hsiao, H. Y., Yang, C. Y., Liu, J. W., Brey, E. M. & Cheng, M. H. Periosteal osteogenic capacity depends on tissue source. Tissue Eng., Part A 24 29901423 10.1089/ten.TEA.2018.0009 240. Li S IL-1β expression in bone marrow dendritic cells is induced by TLR2 agonists and regulates HSC function Boold 2022 140 1607 1620 10.1182/blood.2022016084 PMC9707400 35675516 Li, S. et al. IL-1β expression in bone marrow dendritic cells is induced by TLR2 agonists and regulates HSC function. Boold 140 10.1182/blood.2022016084 PMC9707400 35675516 241. Takayanagi H New developments in osteoimmunology Nat. Rev. Rheumatol. 2012 8 684 689 10.1038/nrrheum.2012.167 23070645 Takayanagi, H. New developments in osteoimmunology. Nat. Rev. Rheumatol. 8 23070645 10.1038/nrrheum.2012.167 242. Baccin C Combined single-cell and spatial transcriptomics reveal the molecular, cellular and spatial bone marrow niche organization Nat. Cell Biol. 2020 22 38 48 10.1038/s41556-019-0439-6 31871321 PMC7610809 Baccin, C. et al. Combined single-cell and spatial transcriptomics reveal the molecular, cellular and spatial bone marrow niche organization. Nat. Cell Biol. 22 31871321 10.1038/s41556-019-0439-6 PMC7610809 ",
  "metadata": {
    "Title of this paper": "Combined single-cell and spatial transcriptomics reveal the molecular, cellular and spatial bone marrow niche organization",
    "Journal it was published in:": "Bone Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476454/"
  }
}