{
  "title": "Paper_958",
  "abstract": "pmc J Pers Med J Pers Med 2605 jpersmed jpm Journal of Personalized Medicine 2075-4426 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470600 PMC12470600.1 12470600 12470600 41003102 10.3390/jpm15090399 jpm-15-00399 1 Systematic Review The Role of the Microbiome in Oropharyngeal Squamous Cell Carcinoma: A Systematic Review https://orcid.org/0000-0002-0845-0845 Lechien Jérôme R. 1 2 3 Kujan Omar Academic Editor 1 jerome.lechien@umons.ac.be 2 3 28 8 2025 9 2025 15 9 497650 399 14 6 2025 07 8 2025 22 8 2025 28 08 2025 27 09 2025 27 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Objective Methods Results Spirochaetes Bacteroidetes Proteobacteria Leptotrichia Selenomonas Treponema Neisseria Porphyromonas Rothia Streptococcus Veillonela Conclusions oropharyngeal oropharynx cancer carcinoma microbiome microbiota bacteria surgery larynx oncological outcome review This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Head and neck squamous cell carcinoma (HNSCC) is the 6th most common adult cancer worldwide, accounting for 5.3% of all cancers [ 1 2 1 2 3 4 5 4 6 7 This systematic review aimed to investigate existing evidence regarding the implications of the microbiome in OPSCC tumorigenesis, progression, clinical phenotypes, and treatment-related endpoints. 2. Materials and Methods Two researchers conducted the review using the Preferred Reporting Items for a Systematic Review and Meta-analysis (PRISMA) checklist [ 8 9 Studies Participants and inclusion criteria Outcomes Intervention and comparison Timing and Setting 2.1. Search Strategy A University librarian and the author of the paper independently conducted the systematic literature search using PubMed, Scopus, and Cochrane Library databases. The following keywords were used for the literature research: Oropharynx; Oropharyngeal; Cancer; Squamous Cell Carcinoma; Oncological; Microbiome; Microbiota; Bacteria; and Outcomes. The investigators considered research reporting database abstracts, available full-texts, or titles with the search terms. The reference list of some articles, particularly reviews or meta-analyses, were considered for additional valuable studies. The studies were evaluated for the number of subjects, study design, inclusion and exclusion criteria, quality of trial, evidence-based level [ 10 2.2. Bias Analysis The bias analysis was conducted using the methodological index for non-randomized studies (MINORS), a validated tool for assessing study quality [ 11 11 3. Results Twelve studies were included, accounting for 298 OPSCC patients ( Figure 1 12 13 14 15 16 17 18 19 20 21 22 23 Table 1 24 25 26 27 28 29 3.1. Demographics, Patients, and Tumor Stages The data of 298 OPSCC patients were reported ( Table 1 Figure 1 13 15 16 20 21 22 23 Table 1 Table 2 14 18 19 20 21 12 14 15 16 17 18 19 20 21 22 13 18 22 23 Table 2 18 23 3.2. Microbiome Outcomes The microbiome outcomes are summarized in Table 1 Table 3 12 17 18 19 21 22 23 13 14 15 16 18 20 22 23 18 Table 4 12 17 19 21 15 20 13 14 15 Table 3 Spirochaetes Bacteroidetes Proteobacteria The taxonomic profiling of at least two studies revealed that the following genera have been considered as predominant in OPSCC compared to control specimens: Leptotrichia 15 21 23 Selenomonas 15 21 Treponema 14 21 Neisseria 14 21 Porphyromonas 14 15 Rothia 14 21 Streptococcus 14 21 Veillonela 14 17 21 Actinomyces 12 17 15 16 Dialister 12 15 Gemella 15 18 Tannarella 13 15 3.3. Influencing Factors on Microbiome Profile The number of species detected in oral samples significantly decreased after chemoradiation [ 18 18 23 23 The potential influence of HPV infection on the microbiome profile has been primarily investigated in two studies [ 12 22 22 Actinomyces Granulicatella Campylobacter Oribacterium Rothia Haemophilus parainfluenzae Veillonella dispar Streptococcus anginosus Mycoplasma Peptoniphilus 12 22 Rothia 12 21 Table 1 3.4. Epidemiological Analysis The mean MINORS was 12.0 ± 4.8, indicating substantial methodological limitations among the included studies ( Table 5 17 18 20 21 22 23 13 14 15 14 15 12 12 17 20 16 20 21 22 The missing information related to the OPSCC stage [ 12 13 15 16 17 22 23 13 23 15 20 14 Table 5 4. Discussion Multi-omic analysis and microbiome dynamics characterization are emerging in medicine and surgery due to the accessibility of metagenomic shotgun sequencing and microbiome functional analyses [ 30 The present systematic review identified specific phyla/bacteria that may be significantly associated with the development/progression of OPSCC. Precisely, the transversal analysis of the literature demonstrated a predominance of Spirochaetes Bacteroidetes Proteobacteria Leptotrichia Selenomonas Treponema Neisseria Porphyromonas Rothia Streptococcus Veillonella The overrepresentation of Bacteroidetes 31 32 Bacteroidetes Bacteroidetes 33 Bacteroidetes 34 Bacteroidetes Bacteroidetes Fusobacteria Proteobacteria Actinobacteria Firmicutes 31 32 Streptococcus (Firmicutes) Streptococcus Streptococcus 35 Streptococcus Streptococcus 36 Streptococcus Rothia 31 33 Despite the limited available literature, findings from the present review indicate potential distinct microbiome compositional shifts associated with chemoradiation response, HPV status, and tobacco-alcohol intoxications. Oliva et al. observed that the number of species detected in oral samples significantly decreased after chemoradiation [ 18 23 6 37 Staphylococcus aureus Escherichia coli 37 6 Some conflicting results across studies in the present review may be attributed to heterogeneity in inclusion criteria and confounding factors, which represent the primary limitation of the present review. Given the small number of patients, most studies did not investigate the impact of HPV status, laryngopharyngeal reflux disease, tobacco and alcohol consumption on the microbial composition and diversity, although these factors may influence the microbial composition [ 18 23 38 28 39 28 The potential heterogeneity across the studies in the inclusion criteria is an additional limitation. This limitation particularly concerns antibiotic exposure criteria at enrollment. Some authors did not exclude antibiotic use in the days preceding sampling or during surgery (sample collection time) [ 14 15 18 13 14 15 16 20 Table 6 5. Conclusions The current literature supports potential distinct microbiome signatures between OPSCC and non-cancerous tissues, with an overrepresentation of Spirochaetes Bacteroidetes Proteobacteria Disclaimer/Publisher’s Note: Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The data presented in this study are available on request from the corresponding author. Conflicts of Interest The author declares no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: OPSCC oropharyngeal squamous cell carcinoma PSCC oral squamous cell carcinoma References 1. Global Burden of Disease Cancer Collaboration Global, Regional, and National Cancer Incidence, Mortality, Years of Life Lost, Years Lived With Disability, and Disability-Adjusted Life-Years for 29 Cancer Groups, 1990 to 2017: A Systematic Analysis for the Global Burden of Disease Study JAMA Oncol. 2019 5 1749 1768 31560378 10.1001/jamaoncol.2019.2996 PMC6777271 2. Aupérin A. Epidemiology of head and neck cancers: An update Curr. Opin. Oncol. 2020 32 178 186 10.1097/CCO.0000000000000629 32209823 3. Damgacioglu H. Sonawane K. Zhu Y. Li R. Balasubramanian B.A. Lairson D.R. Giuliano A.R. Deshmukh A.A. Oropharyngeal Cancer Incidence and Mortality Trends in All 50 States in the US, 2001–2017 JAMA Otolaryngol. Head Neck Surg. 2022 148 155 165 10.1001/jamaoto.2021.3567 34913945 PMC8678903 4. Pinkiewicz M. Dorobisz K. Zatoński T. Human Papillomavirus-Associated Head and Neck Cancers. Where are We Now? A Systematic Review Cancer Manag. Res. 2022 14 3313 3324 10.2147/cmar.s379173 36465708 PMC9709860 5. Gallus R. Nauta I.H. Marklund L. Rizzo D. Crescio C. Mureddu L. Tropiano P. Delogu G. Bussu F. Accuracy of p16 IHC in Classifying HPV-Driven OPSCC in Different Populations Cancers 2023 15 656 10.3390/cancers15030656 36765613 PMC9913822 6. Hes C. Desilets A. Tonneau M. El Ouarzadi O. De Figueiredo Sousa M. Bahig H. Filion É. Nguyen-Tan P.F. Christopoulos A. Benlaïfaoui M. Gut microbiome predicts gastrointestinal toxicity outcomes from chemoradiation therapy in patients with head and neck squamous cell carcinoma Oral Oncol. 2024 148 106623 10.1016/j.oraloncology.2023.106623 38006691 7. Chung R.S. Wong S. Lin D. Kokot N.C. Sinha U.K. Han A.Y. Mechanisms of crosstalk between the oropharyngeal microbiome and human papillomavirus in oropharyngeal carcinogenesis: A mini review Front. Oncol. 2024 14 1425545 10.3389/fonc.2024.1425545 39211550 PMC11357953 8. McInnes M.D. Moher D. Thombs B.D. McGrath T.A. Bossuyt P.M. Clifford T. Cohen J.F. Deeks J.J. Gatsonis C. Hooft L. Preferred Reporting Items for a Systematic Review and Meta-analysis of Diagnostic Test Accuracy Studies: The PRISMA-DTA statement JAMA 2018 319 388 396 29362800 10.1001/jama.2017.19163 9. Thompson M. Tiwari A. Fu R. Moe E. Buckley D.I. A Frame-Work to Facilitate the Use of Systematic Reviews and Meta-Analyses in the Design of Primary Research Studies Agency for Healthcare Research and Quality Rockville, MD, USA 2012 22299187 10. Burns P.B. Rohrich R.J. Chung K.C. The levels of evidence and their role in evidence-based medicine Plast. Reconstr. Surg. 2011 128 305 310 10.1097/prs.0b013e318219c171 21701348 PMC3124652 11. Slim K. Nini E. Forestier D. Kwiatkowski F. Panis Y. Chipponi J. Methodological index for non-randomized studies (minors): Development and validation of a new instrument ANZ J. Surg. 2003 73 712 716 10.1046/j.1445-2197.2003.02748.x 12956787 12. Börnigen D. Ren B. Pickard R. Li J. Ozer E. Hartmann E.M. Xiao W. Tickle T. Rider J. Gevers D. Alterations in oral bacterial communities are associated with risk factors for oral and oropharyngeal cancer Sci. Rep. 2017 7 17686 10.1038/s41598-017-17795-z 29247187 PMC5732161 13. Castañeda-Corzo G.J. Infante-Rodríguez L.F. Villamil-Poveda J.C. Bustillo J. Cid-Arregui A. García-Robayo D.A. Association of Prevotella intermedia with oropharyngeal cancer: A patient-control study Heliyon 2023 9 e14293 10.1016/j.heliyon.2023.e14293 36938439 PMC10018557 14. Chan J.Y.K. Cheung M.K. Lan L. Ng C. Lau E.H.L. Yeung Z.W.C. Wong E.W.Y. Leung L. Qu X. Cai L. Characterization of oral microbiota in HPV and non-HPV head and neck squamous cell carcinoma and its association with patient outcomes Oral Oncol. 2022 135 106245 10.1016/j.oraloncology.2022.106245 36375420 15. De Martin A. Lütge M. Stanossek Y. Engetschwiler C. Cupovic J. Brown K. Demmer I. Broglie M.A. Geuking M.B. Jochum W. Distinct microbial communities colonize tonsillar squamous cell carcinoma Oncoimmunology 2021 10 1945202 34367729 10.1080/2162402X.2021.1945202 PMC8312615 16. Dhakal A. Upadhyay R. Wheeler C. Hoyd R. Karivedu V. Gamez M.E. Valentin S. Vanputten M. Bhateja P. Bonomi M. Association between Tumor Microbiome and Hypoxia across Anatomic Subsites of Head and Neck Cancers Int. J. Mol. Sci. 2022 23 15531 10.3390/ijms232415531 36555172 PMC9778747 17. Hayes R.B. Ahn J. Fan X. Peters B.A. Ma Y. Yang L. Agalliu I. Burk R.D. Ganly I. Purdue M.P. Association of Oral Microbiome With Risk for Incident Head and Neck Squamous Cell Cancer JAMA Oncol. 2018 4 358 365 10.1001/jamaoncol.2017.4777 29327043 PMC5885828 18. Oliva M. Schneeberger P.H.H. Rey V. Cho M. Taylor R. Hansen A.R. Taylor K. Hosni A. Bayley A. Hope A.J. Transitions in oral and gut microbiome of HPV+ oropharyngeal squamous cell carcinoma following definitive chemoradiotherapy (ROMA LA-OPSCC study) Br. J. Cancer 2021 124 1543 1551 10.1038/s41416-020-01253-1 33750907 PMC8076306 19. Guerrero-Preston R. White J.R. Godoy-Vitorino F. Rodríguez-Hilario A. Navarro K. González H. Michailidi C. Jedlicka A. Canapp S. Bondy J. High-resolution microbiome profiling uncovers Fusobacterium nucleatum, Lactobacillus gasseri/johnsonii, and Lactobacillus vaginalis associated to oral and oropharyngeal cancer in saliva from HPV positive and HPV negative patients treated with surgery and chemo-radiation Oncotarget 2017 8 110931 110948 29340028 10.18632/oncotarget.20677 PMC5762296 20. Rajasekaran K. Carey R.M. Lin X. Seckar T.D. Wei Z. Chorath K. Newman J.G. O’Malley B.W. Weinstein G.S. Feldman M.D. The microbiome of HPV-positive tonsil squamous cell carcinoma and neck metastasis Oral Oncol. 2021 117 105305 10.1016/j.oraloncology.2021.105305 33905914 21. Wolf A. Moissl-Eichinger C. Perras A. Koskinen K. Tomazic P.V. Thurnher D. The salivary microbiome as an indicator of carcinogenesis in patients with oropharyngeal squamous cell carcinoma: A pilot study Sci. Rep. 2017 7 5867 10.1038/s41598-017-06361-2 28725009 PMC5517471 22. Zakrzewski M. Gannon O.M. Panizza B.J. Saunders N.A. Antonsson A. Human papillomavirus infection and tumor microenvironment are associated with the microbiota in patients with oropharyngeal cancers-pilot study Head Neck 2021 43 3324 3330 10.1002/hed.26821 34278648 23. Bahig H. Fuller C.D. Mitra A. Yoshida-Court K. Solley T. Ping Ng S. Longitudinal characterization of the tumoral microbiome during radiotherapy in HPV-associated oropharynx cancer Clin. Transl. Radiat. Oncol. 2021 26 98 103 10.1016/j.ctro.2020.11.007 33367119 PMC7749292 24. Banerjee S. Tian T. Wei Z. Peck K.N. Shih N. Chalian A.A. O’Malley B.W. Weinstein G.S. Feldman M.D. Alwine J. Microbial Signatures Associated with Oropharyngeal and Oral Squamous Cell Carcinomas Sci. Rep. 2017 7 4036 10.1038/s41598-017-03466-6 28642609 PMC5481414 25. Lim Y. Fukuma N. Totsika M. Kenny L. Morrison M. Punyadeera C. The Performance of an Oral Microbiome Biomarker Panel in Predicting Oral Cavity and Oropharyngeal Cancers Front. Cell. Infect. Microbiol. 2018 8 267 10.3389/fcimb.2018.00267 30123780 PMC6085444 26. Lim Y. Tang K.D. Karpe A.V. Beale D.J. Totsika M. Kenny L. Morrison M. Punyadeera C. Chemoradiation therapy changes oral microbiome and metabolomic profiles in patients with oral cavity cancer and oropharyngeal cancer Head Neck 2021 43 1521 1534 10.1002/hed.26619 33527579 27. Escobar Marcillo D.I. Privitera G.F. Rollo F. Latini A. Giuliani E. Benevolo M. Giuliani M. Pichi B. Pellini R. Donà M.G. Microbiome analysis in individuals with human papillomavirus oral infection Sci. Rep. 2025 15 2953 10.1038/s41598-024-81607-4 39848958 PMC11757712 28. Oberste M. Böse B.E. Dos Anjos Borges L.G. Junca H. Plumeier I. Kahl S. Effects of squamous cell carcinoma and smoking status on oropharyngeal and laryngeal microbial communities Head Neck 2024 46 145 160 37905455 10.1002/hed.27562 29. Panda M. Rai A.K. Rahman T. Das A. Das R. Sarma A. Kataki A.C. Chattopadhyay I. Alterations of salivary microbial community associated with oropharyngeal and hypopharyngeal squamous cell carcinoma patients Arch. Microbiol. 2020 202 785 805 31832691 10.1007/s00203-019-01790-1 30. Díaz-Rivera J. Rodríguez-Rivera M.A. Meléndez-Vázquez N.M. Godoy-Vitorino F. Dorta-Estremera S.M. Immune and Microbial Signatures Associated with PD-1 Blockade Sensitivity in a Preclinical Model for HPV+ Oropharyngeal Cancer Cancers 2024 16 2065 10.3390/cancers16112065 38893183 PMC11171047 31. Lechien J.R. Dysbiosis Patterns in Glottic and Laryngeal Cancers: A Systematic Review of Microbiome Alterations J. Voice 2025 submitted 10.1016/j.jvoice.2025.02.036 40069023 32. Gong H. Wang B. Shi Y. Shi Y. Xiao X. Cao P. Tao L. Wang Y. Zhou L. Composition and abundance of microbiota in the pharynx in patients with laryngeal carcinoma and vocal cord polyps J. Microbiol. 2017 55 648 654 10.1007/s12275-017-6636-8 28752291 33. Crispino A. Varricchio S. Esposito A. Marfella A. Cerbone D. Perna A. Petronio G. Staibano S. Merolla F. Ilardi G. The oral microbiome and its role in oral squamous cell carcinoma: A systematic review of microbial alterations and potential biomarkers Pathologica 2024 116 338 357 10.32074/1591-951x-n867 39748720 34. Dadgar-Zankbar L. Shariati A. Bostanghadiri N. Elahi Z. Mirkalantari S. Razavi S. Kamali F. Darban-Sarokhalil D. Evaluation of enterotoxigenic Bacteroides fragilis correlation with the expression of cellular signaling pathway genes in Iranian patients with colorectal cancer Infect. Agents Cancer 2023 18 48 10.1186/s13027-023-00523-w 37644520 PMC10463534 35. de Freitas Neiva Lessa A. da Silva Amâncio A.M.T. de Oliveira A.C.R. de Sousa S.F. Caldeira P.C. De Aguiar M.C.F. Bispo P.J.M. Assessing the oral microbiome of head and neck cancer patients before and during radiotherapy Support Care Cancer 2024 32 752 10.1007/s00520-024-08953-x 39470839 36. Senthil Kumar S. Johnson M.D.L. Wilson J.E. Insights into the enigma of oral streptococci in carcinogenesis Microbiol. Mol. Biol. Rev. 2024 88 e0009523 10.1128/mmbr.00095-23 38506551 PMC11338076 37. Torozan D.A. Laczny C.C. Roomp K. Wilmes P. Fleckenstein J. Schneider J.G. Metagenomic Profiling of Oral Microbiome Dynamics During Chemoradiotherapy in Head and Neck Squamous Cell Carcinoma Patients Cancer Med. 2025 14 e70589 10.1002/cam4.70589 39801456 PMC11725981 38. Chakladar J. John D. Magesh S. Uzelac M. Li W.T. Dereschuk K. Apostol L. Brumund K.T. Rodriguez J.W. Ongkeko W.M. The Intratumor Bacterial and Fungal Microbiome Is Characterized by HPV, Smoking, and Alcohol Consumption in Head and Neck Squamous Cell Carcinoma Int. J. Mol. Sci. 2022 23 13250 10.3390/ijms232113250 36362038 PMC9655846 39. O’Grady I. Anderson A. O’Sullivan J. The interplay of the oral microbiome and alcohol consumption in oral squamous cell carcinomas Oral Oncol. 2020 110 105011 10.1016/j.oraloncology.2020.105011 32980528 Figure 1 PRISMA flowchart. jpm-15-00399-t001_Table 1 Table 1 Demographic, clinical, and microbiome outcomes.    Demographics Other Considered    Primary References Design EBL N F/M Age (y) Clinical Outcomes CT Tissues MS Phyla Outcomes Results Bornigen Prospective 3C 64 OPC - 58.0 HPV, tobacco, Saliva healthy Or Phylum and bacterial profile OPC = OC 2017 [ 12 Controlled  242 CT 54/188 - alcohol, tooth status controls  ACT, GRA, ORI, CAM, VED, ROT, HAP HPV+ > HPV−    52 OC - -    STA, PEP, MYC HPV− > HPV+          ROT, NEI, LAU Smo− > Smo+          LAC, BIF, ATO, PRE, STR, VEI Smo+ > Smo− Guerrero-Preston Prospective 3C 11 OPC 3/8 62.0 cTN Saliva healthy Or LAG/J, LAV, LAF, LSA, LRH OPC > CT 2017 [ 19 Controlled  25 CT    controls  STR OC-OPC > CT          HAE, NEI, LEP, LAU, AGG CT > OPC-OC Wolf Prospective 3C 11 OPC 1/10 61.6 cN, HPV, tobacco Saliva healthy Or Diversity; ACT, FIR (SCH, SEL), SPI (TRE) OPC > CT 2017 [ 21 Controlled  11 CT 1/10 47.7 alcohol, age, cT controls  PRE, HAE, NEI, STR, VEI CT > OPC          cT, age, alcohol, tobacco association with MM + Hayes Prospective 3C 12 OPC - - HPV Saliva healthy Or ACT, VED OPC lower risk 2018 [ 17 Controlled  254 CT - -  controls    De Martin, Prospective 3C 18 OPC 5/13 66.9 - Healthy Tu/ti α/β-diversities OPC = CT = NAT 2021 [ 15 Controlled  14 CT 1/13 38.9  Tonsils of  SEL, LEP, ACT, MEG, NEI, GEM, PR6, CAP OPC > CT        OSAS patients  POR, FRE, DIA, FIL, TAN, ROT CT > OPC Oliva UnProspective 4 22 OPC - - HPV, tobacco, - Or FUS, GEM, LEP, SEL Stage III > Stage I-II 2021 [ 18      stages, survival  St Number of species (oral) Pre > Post-CRT         Tu Oral α-diversity Pre = post-CRT Rajasekaran Prospective 3C 46 OPC 7/39 57.7 cN, survival Healthy Tu PMI, CHT, NEG, SHD, ORT (BAC, PAE) cN+ > cN– 2021 [ 20 Controlled  24 CT 5/19 46.4  Tonsils of  RHO, PRO, PEP cN– > cN+        OSAS patients  LACi, LLA OPC > CT Zakrzewski UnProspective 4 13 OPC 1/12 62.0 HPV - Or Tumor microbiome diversity HPV− > HPV+ 2021 [ 22        Tu/ti Saliva microbiome diversity HPV+ = HPV−          Tumor SPI, TRE/Richness HPV+ > HPV−/CT > OPC          Saliva LEP, saliva/tumor PRE, ROT HPV− > HPV+ Bahig UnProspective 4 9 OPC 0/9 62.0 CRT response - Or Baseline α-diversity Tumor = oral/CR > PR 2021 [ 23      Tobacco  Tu α-diversity, ACT, LEP Pre > Post-CRT          VEI, LEP Tumor > oral          Post-CRT VEI, ATO PR > CR Dhakal Cross-sectional 4 53 OPC 9/44 58.0 - - Tu ACT, SUL OPC Abundance 2022 [ 16         PSE, PSL OPC scarcity Chan Prospective 3C 15 OPC - - HPV, tobacco, NAT Tu/ti FUS OPC > CT 2022 [ 14 Controlled  15 NAT - - cT stage     Castaneda Prospective 3C 24 OPC 7/17 - - Healthy CT Tu/ti PRI, POG, TAF OPC > CT 2023 [ 13 Controlled  24 CT 7/17 -  Oral tissue    The results reported in this table consisted of statistically significant differences/associations in microbiome patterns. Non-significant differences in microbiome signatures were not reported. ACT = Actinomyces; AGG = Aggregibacter; ATO = Atopoblum; BAC = Bacteroidaceae; BIF = Bifidobacterium; CAM = Campylobacter; CAP = Capnocytophaga; CHT = Chlamydia trachomatis; CR/PR = complete/partial response to chemoradiotherapy; CRT = chemoradiotherapy; CT = controls; DIA = Dialister; EBL = evidence-based level; FIL = Filifactor; FIR = firmicutes; FRE = Fretibacterium; GEM = Gemella; GRA = Granulicatella; HAE = haemophilus; HAP = Haemophilus parainfluenzae; LAC = Lactobacillus; LACi = Lactobacillus acidophilus; LAF = Lactobacillus fermentum; LAG/J = Lactobacillus gasseri/johnsonii; LAU = Lautropia; LAV = Lactobacillus vaginalis; LEP = Leptotrichia; LLA = Lactococcus lactis; LRH = Lactobacillus rhamnosus; LSA = Lactobacillus salivarius; MEG = Megasphaera; MS = microbiome sample; MYC = Mycoplasma; NAT = normal adjacent tissue; NEG = Neisseria gonorrhoeae; NEI = Neisseria; OC = oral carcinoma; OPC = oropharyngeal carcinoma; Or = oral; ORI = Oribacterium; ORT = Orientia tsutsugamushi; OSAS = obstructive sleep apnea syndrome; PAE = Paenibacillaceae; PEP = Peptoniphilus; PMI = Proteus mirabilis; POG = Porphyromonas gingivalis; POR = Porphyromonas; PR2/6/7 = prevotella_2/6/7; PRE = Prevotella; PRI = Prevotella intermedia; PRO = Propionibacteriaceae; PSL = pseudomonas libanensis; RHO = Rhodobacteraceae; ROM = Rothia mucilaginosa; ROT = Rothia; SCH = Schwartzia; SEL = Selenomonas_3; SHD = Shigella dysenteriae; Smo = smoker; St = stool; STA = Streptococcus anginosus; STE = Streptococcus; STR = streptococcus; SUL = Sulfurimonas; TAF = Tannerella forsythia; TAN = Tannarella; Tu/ti = tumor/healthy tissue; VED = Veillonella dispar; VEI = Veillonella. jpm-15-00399-t002_Table 2 Table 2 Oncological features.                 Anatomical Location   T Stage  N Stage  HPV Status  Oro-Hypo- Tongue Soft Palate/ OPC- Unde- References N cT1 cT2 cT3 cT4 N0 N1 N2a N2b N2c N3a M+ HPV+ HPV− Unspecified Tonsil Pharynx Base OPC Wall Larynx Termined Bornigen [ 12 64 - - - - - - - - - - - 29 10 25 - - - - - - Castaneda [ 13 24 - - - - - - - - - - - - - - 4 1 2 11 2 4 Chan [ 14 15 5 7 0 3 5 4 6 0 - 10 5 0 - - - - - - De Martin [ 15 18 - - - - - - - - - - - 16 2 0 - - - - - - Dhakal [ 16 53 - - - - - - - - - - - 38 15 0 - - - - - - Hayes [ 17 12 - - - - - - - - - - - 5 7 0 - - - - - - Oliva [ 18 22 5 5 6 5 3 12 2 1 1 2 0 22 0 0 12 0 7 1 0 0 Guerrero-Preston [ 19 11 2 4 4 0 3 0 2 5 1 0 0 7 4 0 - - - - - - Rajasekaran [ 20 46 46 0 0 23 23 0 46 0 0 - - - - - - Wolf [ 21 11 4 2 0 5 2 1 0 4 2 0 0 3 8 0 - - - - - - Zakrzewski [ 22 13 - - - - - - - - - - - 8 5 0 13 - - - - - Bahig [ 23 9 - - - - - - - - - - - - - - 5 - 4 - - - Total number 298 39 41 10 13 36 40 10 10 4 2 0 184 56 25 34 1 13 12 2 4 * p16 approach. Abbreviations: HPV = human papilloma virus; OPC = oropharyngeal carcinoma. jpm-15-00399-t003_Table 3 Table 3 Species.  Bornigen Castaneda Chan De Martin Dhakal Hayes Oliva Guerrero Rajasekaran Wolf Zakrzewski Bahig Phyla and Genera OPC OC CT OPC CT OPC NAT OPC NAT CT OPC OPC CT st I–II st III OPC CT OPC CT OPC CT OPC CT OPC NAT  Bartonellaceae                  +++ +        Burkholderiaceae                  +++ +        Firmicutes        +++ + +                Catonella                    + +++     Dialister +++ +++ +     + +++ +++                Filifactor        + +++ +++                Gemella        +++ + +    + +++           Lactobacillales + + +++                       Lactobacillus vaginalis                +++ + +++ + +++ +     Lactobacillus fermentum                +++ + +++ + +++ +     Lactobacillus rhamnosus                +++ + +++ + +++ +     Lactobacillus salivarius                +++ + +++ + +++ +     Megasphaera        +++ + +                Moryella                    +++ +     Parvimonas                      + +++   Selenomonas        +++ + +    + +++     +++ +     Streptococcus      + +++             + +++     Veillonella      + +++     + +++       + +++   +++ +  Actinobacteria                          Actinomyces + + +++     +++ + + +++ + +++       +++ +     Bifidobacterium                    +++ +     Rothia      + +++ +++ + +          + +++     Schwartzia                    +++ +      Fusobacteriota                          Fretibacterium        + +++ +++                Fusobacterium              + +++       +++ +   Leptotrichia        +++ + +    + +++     +++ +   +++ +  Bacteroidetes                          Capnocytophaga        +++ + +                Flavobacterium      +++ +                   Porphyromonas    +++ + + +++ + +++ +++                Prevotella_2        + + +                Prevotella_6        +++ + +                Prevotella Intermedia    +++ +                     Tannerella    +++ +   + +++ +++                 Proteobacteria                          Desulfovibrio                    +++ +     Haemophilus                    + +++     Neisseria      + +++ +++ + +          + +++     Pasteurellaceae                    + +++     Pseudomonas           -               Pseudomonas libanensis           -               Sulfurimonas           +++                Tenericutes                          Mycoplasma      +++ +                    Spirochaetes                          Treponema      +++ +             +++ +     The abundance of species was rated as mild (+), moderate (++), or high (+++). Abbreviations: CT = controls; OC = oral carcinoma; OPC = oropharyngeal carcinoma; NAT = normal adjacent tumor tissue. jpm-15-00399-t004_Table 4 Table 4 Microbiome analysis methods. Reference DNA Extraction Kit/Method PCR Amplification Region Quantification Method Sequencing Platform Bornigen [ 12 QIAsymphony virus/bacteria Midi Kit V4 16S rRNA (515F/806R) qPCR Illumina MiSeq v2 Dhakal [ 16 TCGA data reanalysis Not applicable Not applicable Not applicable Hayes [ 17 PowerSoil DNA Isolation Kit V3–V4 DESeq2 454 FLX Titanium Castaneda [ 13 Phenol-chloroform method 3-deoxy-D-manno-octulosonic-acid gene qPCR with Taqman probes CFX 96 Real Time System BioRad Chan [ 14 Qiagen DNeasy Blood and Tissue Kit V3–V4 16S rRNA (341F/806R) Not specified Illumina MiSeq De Martin [ 15 QIAamp DNA Stool Mini Kit with modifications V4 16S rRNA qPCR with KAPA HiFi polymerase Illumina MiSeq v2 Oliva [ 18 ZymoBIOMICS DNA/RNA Mini Kit V4 16S rRNA 16S rRNA gene sequencing Illumina MiSeq, NovaSeq 6000 Rajasekaran [ 20 Not specified Not specified PathoChip array Not specified Guerrero-Preston [ 19 Phenol/chloroform extraction V3-V5 16S rRNA 454 pyrosequencing Roche-454 FLX Wolf [ 21 QIAamp DNA Stool Mini Kit V3-V5 16S rRNA Qubit Thermo Fisher Scientific Illumina MiSeq Zakrzewski [ 22 Qiagen QIAAmp Fast DNA Kit (modified) V4 16S rRNA 16S rRNA gene sequencing Illumina MiSeq Bahig [ 23 MO BIO PowerSoil DNA Isolation Kit V4 16S rRNA 16S rRNA gene sequencing Illumina MiSeq jpm-15-00399-t005_Table 5 Table 5 Bias analysis.  Clearly Inclusion of Prospective Endpoints Unbiased Follow-Up <5% of Study Size Adequate Contem- Baseline Adequate Total  Stated Consecutive Data Appropriate Endpoint Adequate Lost-to- Prospective Control Porary Group Stat MINORS References Aim Patients Collection to Study Assessment Period Follow-Up Calculation Group Groups Equivalence Analyses Score Bornigen [ 12 2 1 1 2 2 - - 2 2 2 2 2 18 Castaneda [ 13 2 0 1 1 1 - - 0 1 1 1 1 9 Chan [ 14 2 0 1 1 1 - - 0 0 0 0 0 5 De Martin [ 15 2 0 1 2 1   0 1 1 1 1 10 Dhakal [ 16 2 0 0 2 1 - - 0 - - - - 5 Hayes [ 17 2 1 2 2 2 2 - 0 2 2 2 2 19 Oliva [ 18 2 1 2 2 2 2 - 0 0 0 0 2 13 Guerrero-Preston [ 19 2 0 1 2 2 - - 0 2 2 1 2 14 Rajasekaran [ 20 2 0 2 2 2 2 - 0 2 2 2 2 18 Wolf [ 21 2 0 2 2 2 - - 0 2 1 1 2 14 Zakrzewski [ 22 2 0 2 2 2 - - 0 0 0 0 2 10 Bahig [ 23 2 0 2 2 1 1 0 0 - - - - 8 jpm-15-00399-t006_Table 6 Table 6 Key findings for future studies. Current Limitations Recommendations for Future Studies Small sample sizes 1. Conducting multi-center collaborative studies with prospective sample  size calculations based on specific primary outcomes.  2. Establishing biobanks for OPSCC specimens to facilitate larger cohorts. Heterogeneity in inclusion/exclusion criteria 1. Standardizing antibiotic exclusion criteria (e.g., no antibiotics within 30 days before sampling).  2. Documenting and reporting specific antibiotic exposure when unavoidable. Variable sample types 1. Implementing multi-compartment sampling protocols (paired tumor/saliva samples). cross-study comparisons 2. Establishing consensus guidelines for specimen collection, processing, and storage. Inadequate control groups 1. Recruiting healthy controls matched for age, sex, diet, oral hygiene, tumor-adjacent tissues as “normal”) smoking, and alcohol consumption.  2. Considering longitudinal sampling of at-risk individuals before cancer development. Inconsistent microbiome analysis methods 1. Adopting standardized protocols for DNA extraction, 16S rRNA  amplification regions, and sequencing platforms.  2. Establishing biobanks for OPSCC specimens to facilitate larger cohorts. Limited consideration of confounding factors 1. Systematically documenting and stratifying analyses by HPV status, alcohol, diet) smoking pack-years, alcohol consumption patterns, oral hygiene. Predominance of cross-sectional designs 1. Implementing longitudinal sampling at multiple timepoints (pre-treatment,  during treatment, follow-up).  2. Tracking microbiome changes during disease progression and treatment response. Focus on taxonomic profiling 1. Integrating multi-omic approaches (metatranscriptomics, secretome,  metaproteomics) to characterize functional activities of microbial communities.  Limited investigation of host–microbiome interactions 1. Including paired host tissue transcriptomics, immunoprofiling, and spatial  characterization of microbiome relative to tumor and immune cell distribution. Inadequate reporting of clinical outcomes 1. Correlating microbiome signatures with standardized clinical outcomes  (treatment response, recurrence, survival) with adequate follow-up periods. Minimal validation of findings 1. Implementing discovery and validation cohort designs.  2. Considering longitudinal sampling of at-risk individuals before cancer development. Lack of mechanistic insights 1. Developing relevant in vitro and in vivo models to test causality of specific microbial signatures. carcinogenesis or treatment response 2. Considering longitudinal sampling of at-risk individuals before cancer development. Limited spatial characterization 1. Implementing spatial metagenomics approaches to map microbiome microenvironment distribution within and around tumors. Inconsistent HPV detection methods 1. Standardizing HPV detection with multiple complementary methods  (DNA/RNA detection, genotyping, and p16 immunostaining). Insufficient reporting of oral hygiene status 1. Documenting and controlling for oral hygiene practices, periodontal  disease status, and dental health in all participants. ",
  "metadata": {
    "Title of this paper": "The interplay of the oral microbiome and alcohol consumption in oral squamous cell carcinomas",
    "Journal it was published in:": "Journal of Personalized Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470600/"
  }
}