{
  "title": "Paper_842",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472553 PMC12472553.1 12472553 12472553 41010549 10.3390/nu17183025 nutrients-17-03025 1 Article Unlocking Hopeaphenol: A Potent Ally Against Cardiac Hypertrophy via AMPK Activation https://orcid.org/0009-0001-8665-1351 Chen Jinhong Methodology Investigation Writing – original draft Writing – review & editing 1 † Wang Mengyuan Methodology Investigation Writing – review & editing 1 † Zhang Zhongzheng Methodology Investigation Writing – review & editing 2 † https://orcid.org/0000-0001-8319-5189 Fang Chongkai Data curation Writing – review & editing 3 Zhuang Haowen Data curation 2 Zhao Jiaqi Data curation 2 Wang Tianyu Data curation 2 Wang Junyan Data curation 2 Li Chun Funding acquisition 2 * Fang Chunping Funding acquisition 2 * Min Kyung-Jin Academic Editor 1 18002630878@163.com wmy8762@163.com 2 18381497949@163.com haowen_zhuang@163.com 13140096664@163.com 13091428177@163.com junyan_wang@163.com 3 f.chongkai@gzucm.edu.cn * 040195@gzucm.edu.cn fcp2004@gzucm.edu.cn † These authors contributed equally to this work. 22 9 2025 9 2025 17 18 497660 3025 02 8 2025 15 9 2025 17 9 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: Results: Conclusions: hopeaphenol AMPK signaling pathway cardiac hypertrophy mitochondrial function heart failure National Natural Science Foundation of China 82230126 National Key Research and Development Program of China 2022YFC3500100 Project was supported by the National Natural Science Foundation of China (Key Program, Grant No. 82230126) and the National Key Research and Development Program of China (Grant No. 2022YFC3500100). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cardiac hypertrophy represents an adaptive response of the heart to conditions of pressure or volume overload. Initially, this adaptation can preserve cardiac function; however, sustained overload results in pathological remodeling, which is characterized by myocardial fibrosis, arrhythmias, and ultimately progression to heart failure [ 1 2 3 4 5 6 7 8 9 10 AMP-activated protein kinase (AMPK), a critical regulator of energy metabolism, is activated in response to pressure overload and plays an essential role in maintaining mitochondrial homeostasis by modulating downstream target proteins, thereby exerting a significant influence on cardiac metabolism [ 11 12 13 14 15 16 17 18 Considering the potential of hopeaphenol in modulating mitochondrial function and the pivotal role of AMPK in energy metabolism, this study posits that hopeaphenol may alleviate pressure overload-induced cardiac hypertrophy by activating the AMPK signaling pathway, with mechanisms associated with the amelioration of mitochondrial metabolic abnormalities. This hypothesis was validated through in vivo and in vitro experiments to identify a novel therapeutic target for the prevention and treatment of heart failure. Furthermore, this investigation elucidates the structure-activity relationship of natural polyphenols, highlights the advantages of tetrameric structures over monomeric forms, and provides a theoretical framework for addressing the limitations of existing pharmacological agents, such as the dosage constraints associated with resveratrol. Consequently, this research holds significant implications for both fundamental studies and clinical applications. 2. Materials and Methods 2.1. Experimental Materials 2.1.1. Experimental Animals Male C57BL/6 mice (wild-type, specific pathogen-free [SPF]) aged 6–8 weeks (weight: 20–25 g) were used in this study. The mice were purchased from the Experimental Animal Center of Guangzhou University of Chinese Medicine. All animals were housed in the SPF-grade animal facility of Guangzhou University of Chinese Medicine under controlled conditions (temperature: 22 ± 2 °C, humidity: 50% ± 10%, 12 h light-dark cycle) with ad libitum access to standard laboratory chow and water. Environmental enrichment (nesting materials and plastic shelters) was provided in each cage for the mice. The animal study was reviewed and approved by the Ethics Committee of Guangzhou University of Chinese Medicine (Approval No. XS20240031, approved on 19 March 2024). 2.1.2. Cell Line The HL-1 mouse cardiomyocyte cell line was purchased from iCellverse and cultured in DMEM medium containing 10% fetal bovine serum (FBS) and 100 U/mL penicillin/streptomycin in a 37 °C, 5% CO 2 2.1.3. Main Reagents, Consumables, and Instruments Hopeaphenol (≥98%, #388582-37-4), was purchased from Sigma-Aldrich (St. Louis, MO, USA). Compound C (#S7840) and Angiotensin II (Ang II, #HY-P0108) were obtained from Selleck Chemicals (Houston, TX, USA) and MedChemExpress (MCE, Monmouth Jct., NJ, USA), respectively. The related antibodies used in this study included anti-phospho-AMPK (pAMPK, #83924-1-RR, Proteintech Group, Rosemont, IL, USA), anti-AMPK (#AB32047, Abcam, Cambridge, UK), and anti-SIRT1 (#DF6033, Affinity Biosciences, Cincinnati, OH, USA). Detection kits were sourced as follows: Superoxide Dismutase (SOD) assay kit (#BC5165, Solarbio Life Sciences, Beijing, China); Adenosine Triphosphate (ATP) assay kit (#S0026, Beyotime Biotechnology, Shanghai, China); Reactive Oxygen Species (ROS) assay kit (#S0033S, Beyotime Biotechnology, Shanghai, China); and JC-1 mitochondrial membrane potential assay kit (#C2006, Beyotime Biotechnology, Shanghai, China).Instruments included the ChemiScope S6 imager, ViiA 7 real-time PCR system, Varioskan LUX microplate reader, etc. 2.2. Experimental Methods 2.2.1. Animal Model Construction and Grouping Thirty-six C57BL/6 mice were randomly assigned to six experimental groups ( n 19 The dosage of HP was determined based on preliminary experiments. These pre-experiments showed that doses below 5 mg/kg exerted minimal cardioprotective effects, while doses exceeding 20 mg/kg failed to enhance therapeutic efficacy and instead led to increased drug exposure. In accordance with standard TAC model protocols, 200 mg/kg metformin was used as a positive control. This dose was selected based on: (1) species-specific pharmacokinetics—rodents (especially mice) have higher metabolic rates and faster drug clearance than humans, requiring higher mg/kg doses to achieve comparable pharmacologically active exposure; (2) established efficacy in TAC models, as 200 mg/kg (intraperitoneal injection) is widely validated for demonstrating metformin’s AMPK-mediated cardioprotection [ 20 21 2.2.2. Inclusion and Exclusion Criteria All male C57BL/6 mice (6–8 weeks old, 20–25 g) undergoing transverse aortic constriction (TAC) surgery were included in the study. No animals were excluded from the analysis prior to the experimental endpoint (8 weeks post-TAC, including 4 weeks of drug administration) unless specified otherwise. Mice that died during TAC surgery or within the first 48 h post-operation ( n n 2.2.3. Hopeaphenol Solution Preparation Hopeaphenol was dissolved in DMSO, mixed according to a ratio of DMSO:PEG-300:normal saline = 1:8:11, stored at 4 °C in the dark, and confirmed to be free of precipitation before use. 2.2.4. Cardiac Function Detection At the end of the experiment, detection was performed using a small animal ultrasound imaging system. Mice were anesthetized with isoflurane (2%, oxygen flow rate: 1.5 L/min), and hemodynamic indices such as left ventricular ejection fraction (LVEF) and left ventricular fractional shortening (LVFS) were measured. 2.2.5. Tissue Staining The left ventricular tissues were fixed, and hematoxylin and eosin (HE) staining was used to observe cardiomyocyte morphology. Masson staining was used to evaluate fibrosis, and WGA staining combined with ImageJ (Fiji distribution, version 2.15.0) was used to measure cardiomyocyte cross-sectional area (five random fields per section). 2.2.6. Western Blot Total proteins from tissues or cells were extracted and quantified using the BCA method. The proteins were then subjected to SDS-PAGE, transferred to PVDF membranes, and blocked. Following this, the membranes were incubated with primary antibodies AMPK, pAMPK, and SIRT1) and secondary antibodies. The proteins were detected using chemiluminescence, and protein expression was analyzed. 2.2.7. qRT-PCR Detection RNA was extracted and reverse-transcribed into cDNA. The SYBR Green method was used for amplification, with glyceraldehyde 3-phosphate dehydrogenase (GAPDH) as the internal reference. The relative expression levels of target genes (AMPK, SIRT1, and others) were calculated using the 2 −ΔΔCt Table 1 2.2.8. CCK-8 Assay for Cell Viability HL-1 cells were seeded in 96-well plates (5 × 10 4 2.2.9. Cell Modeling, Grouping, and Administration HL-1 cells were pretreated with hopeaphenol (1–50 μM) for 2 h, and then induced to undergo hypertrophy by 1 μM Ang II for 24 h. In inhibition groups, 10 μM Compound C was added 1 h prior to hopeaphenol treatment. Dose rationale: HP and CC concentrations (1–50 μM) were determined via CCK-8, with 1–10 μM as a non-toxic range (no significant viability reduction), referencing stilbene use in cardiomyocyte studies (1–20 μM for anti-hypertrophy). Ang II (1 μM) [ 22 2.2.10. Mitochondrial ROS Detection HL-1 cells were seeded in culture plates and cultured to an appropriate density, then incubated with 20 μM DCFH-DA fluorescent probe in the dark for 30 min. After washing with PBS to remove excess probe, detection was performed by fluorescence microscopy. 2.2.11. Mitochondrial Membrane Potential Detection Mitochondrial membrane potential was detected by JC-1 staining. Treated cardiomyocytes were incubated with JC-1 working solution for 20 min, washed three times with PBS, and the intensities of red and green fluorescence were observed under a fluorescence microscope. The ratio of red to green fluorescence intensity was calculated to evaluate changes in mitochondrial membrane potential. 2.2.12. Cell Thermal Shift Assay (CETSA) Cells were incubated with 10 μM hopeaphenol for 2 h, then heated at a gradient of 37–65 °C. The residual amount of AMPK protein was detected by Western blotting. 2.3. Network Pharmacology Analysis 2.3.1. Screening of Active Components and Targets Hopeaphenol was obtained from the TCMSP database and screened according to the criteria of oral bioavailability (OB) ≥ 30% and drug-likeness (DL) ≥ 0.18. The results were converted to human gene names via the UniProt database. 2.3.2. Acquisition of Heart Failure Target Genes The term “Heart Failure” was employed to search the OMIM and GeneCards databases. The data retrieved from these sources was consolidated, and any duplicate entries were eliminated. 2.3.3. Screening of Intersection Targets A comparative analysis between the targets of hopeaphenol and those associated with heart failure was conducted using the EVenn (version 3.0.0) tool, resulting in the identification of potential therapeutic targets at the intersection. 2.3.4. Construction of Hopeaphenol-Heart Failure Target Network The intersection targets identified between hopeaphenol and heart failure were imported into Cytoscape version 3.9.1. In this network, node degree values were utilized to indicate the strength of the associations. 2.3.5. Construction of PPI Network and Screening of Core Targets Intersection targets were imported into the STRING database (species: Homo sapiens, confidence threshold > 0.9, with disconnected nodes excluded). Subsequently, the data were imported into Cytoscape software, where topological parameters were calculated to identify core targets. 2.3.6. GO and KEGG Enrichment Analyses Potential targets underwent enrichment analysis using the DAVID database. The results were filtered based on a predetermined p 2.3.7. Molecular Docking Analysis The structure of AMP-activated protein kinase (AMPK) was retrieved from the Protein Data Bank (PDB). For docking analysis, we selected two structures: the crystal structure of the human AMPK α2 kinase domain (PDB ID: 2H6D, the predominant cardiac catalytic isoform) and the full-length active-state AMPK heterotrimer (PDB: 6B2E). After optimizing the hopeaphenol structure, AutoDock Vina version 1.2.5 was used to calculate binding energy and assess complex stability. We note that 2H6D only includes the kinase domain (no β/γ regulatory subunits), so these results preliminarily explore catalytic site interactions; future studies will investigate allosteric modulation via β/γ subunits. 2.4. Statistical Analysis Experimental data were analyzed using GraphPad Prism 9.5 software. Comparisons among multiple groups were performed by one-way analysis of variance (one-way ANOVA), and pairwise comparisons between groups were performed using the LSD or Dunnett’s method. A p 3. Results 3.1. Hopeaphenol Significantly Enhances Cardiac Function in TAC Mice Compared to the Sham group, the TAC group exhibited a marked reduction in left ventricular ejection fraction (LVEF, Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 3.2. Hopeaphenol Mitigates Cardiac Hypertrophy and Fibrosis in TAC Mice In comparison to the Sham group, the TAC group exhibited a significant increase in heart volume ( Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 3.3. Hopeaphenol Alleviates Oxidative Stress and Metabolic Issues In the TAC group, myocardial tissue showed significant oxidative stress and metabolic issues. Superoxide dismutase (SOD) activity ( Figure 3 Figure 3 Figure 3 Figure 3 Section 3.6 Figure 3 3.4. Hopeaphenol Exerts Cardioprotective Effects by Targeting the AMPK Pathway Network pharmacology analysis revealed that there are 67 common targets shared between hopeaphenol and heart failure, representing 62.61% of the total targets of hopeaphenol ( Figure 4 Figure 4 p Figure 4 Figure 4 To verify the direct interaction between Hopeaphenol (HP) and AMPK, we performed a Cellular Thermal Shift Assay (CETSA) combined with Western blot analysis. First, we assessed the thermal stability of phospho-AMPK (pAMPK): pAMPK protein is susceptible to degradation within the temperature range of 46–69 °C; in the DMSO control group, pAMPK degradation initiated at 59.5 °C, while in the HP-treated group, pAMPK degradation was significantly attenuated at this temperature ( Figure 4 p Figure 4 Figure 4 Figure 4 These findings demonstrate that hopeaphenol directly interacts with AMPK (preferentially the inactive state), thereby enhancing its stability, promoting its phosphorylation, and potentially activating the AMPK/SIRT1 signaling pathway ( Figure 4 3.5. Hopeaphenol Mitigates Ang II-Induced Cardiomyocyte Hypertrophy Via Activation of the AMPK/SIRT1 Pathway The CCK-8 assay was employed to ascertain the safe concentration range of hopeaphenol (1–10 μM), within which cell viability did not significantly differ from that of the normal control group ( Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 3.6. Hopeaphenol Mitigates Ang II-Induced Mitochondrial Dysfunction in HL-1 Cardiomyocytes Via the AMPK Pathway Stimulation with Ang II markedly elevated mitochondrial reactive oxygen species (ROS) levels in HL-1 cardiomyocytes ( Figure 6 Figure 6 Figure 6 3.7. Inhibition of AMPK Activity Partially Blocks the Protective Effects of Hopeaphenol on Cardiomyocytes Western blot analyses revealed that Angiotensin II (Ang II) treatment markedly suppressed the protein expression of AMPK downstream effectors, PGC-1α and SIRT1, in HL-1 cardiomyocytes. Concurrently, Ang II treatment led to an upregulation of cardiac hypertrophy markers, BNP and β-MHC. Intervention with hopeaphenol significantly ameliorated these aberrant changes. However, pre-treatment with Compound C entirely negated the effects of hopeaphenol ( Figure 7 Figure 7 Figure 7 Figure 7 4. Discussion This study demonstrates that hopeaphenol alleviates pressure overload-induced cardiac hypertrophy and delays heart failure progression by activating the AMPK signaling pathway (with direct binding supported by CETSA and docking), which enhances mitochondrial energy metabolism and reduces oxidative stress. Below, we elaborate on the pathological mechanisms underlying cardiac hypertrophy and the specific role of hopeaphenol in modulating these processes. Cardiac hypertrophy, a pathological remodeling response to overload, is characterized by a vicious cycle involving abnormal mitochondrial energy metabolism and oxidative stress [ 3 23 24 25 24 26 27 28 29 7 24 24 29 30 In this study, TAC mice exhibited reduced left ventricular ejection fraction (LVEF) and fractional shortening (LVFS), enlarged ventricular cavities (increased LVIDd and LVIDs), cardiomyocyte hypertrophy (HE and WGA staining), fibrosis (Masson staining), and systemic oxidative stress/metabolic disturbances (decreased serum SOD activity and ATP levels, increased serum MDA levels). Hopeaphenol treatment dose-dependently ameliorated these changes; notably, in vitro experiments confirmed HP directly improved cardiac mitochondrial function by reducing mitochondrial ROS and restoring membrane potential. These results confirm that hopeaphenol disrupts the “mitochondrial dysfunction–oxidative stress–cardiac hypertrophy” vicious cycle by improving systemic energy metabolism and augmenting antioxidant capacity. Hopeaphenol’s protective effects are closely linked to AMPK activation. AMPK, a central cellular energy sensor activated by increased AMP/ATP ratios, maintains mitochondrial homeostasis by regulating downstream targets [ 11 31 32 33 Building on these experimental findings (direct binding Via docking/CETSA, functional upregulation of AMPK/SIRT1, and dependence on AMPK activity), we propose a model where hopeaphenol’s direct binding to inactive AMPK (supported by docking and CETSA), combined with the well-established mechanism that LKB1 serves as a classical upstream phosphorylating kinase of AMPK [ 34 34 This proposed model integrates our key experimental observations. These include direct hopeaphenol-AMPK binding (docking/CETSA), elevated pAMPK (WB) and SIRT1 upregulation. It also bridges a knowledge gap. It links the earlier observed hopeaphenol-AMPK binding (and subsequent stability enhancement) to the functional increase in pAMPK—resolving how physical interaction translates to pathway activation—a marker of AMPK activation and subsequent downstream activation. This link relies on speculated LKB1-mediated phosphorylation sensitization. Direct kinase assays were not performed. Even so, this framework prepares for comparing hopeaphenol with other AMPK activators like resveratrol. It highlights how hopeaphenol’s unique mechanism connects to its structural and functional advantages. While our study delineates the central role of the AMPK/SIRT1 axis, our KEGG enrichment analysis ( Figure 4 35 As a resveratrol tetramer, hopeaphenol exhibits structural and functional advantages over its monomeric parent, building on foundational work by Seya et al. [ 18 36 18 37 38 39 40 41 42 43 44 45 46 In a clinical context, this study identifies hopeaphenol as a promising therapeutic candidate for cardiac hypertrophy, emphasizing the significance of the AMPK/SIRT1 signaling pathway in ameliorating myocardial metabolic disorders. Given that aberrant energy metabolism is an early indicator in the progression from hypertrophy to heart failure [ 6 From a translational perspective, currently, hopeaphenol holds promise as a candidate for future therapeutic development rather than an immediately translatable clinical agent. Notwithstanding the promising cardioprotective effects observed, the clinical translational potential of hopeaphenol remains to be fully established—particularly addressing the limitations of pharmacological inhibitors (Compound C) noted earlier. Future investigations are therefore imperative, with key directions including: (1) Characterizing its pharmacokinetic profile, tissue distribution, and chronic toxicity in advanced animal models; (2) Evaluating its effects on human cardiomyocyte organoids or other human-relevant systems to bridge the gap between preclinical findings and potential clinical application; (3) Elucidating the roles of specific AMPKα subunits through genetic approaches (knockout mouse models) to confirm AMPK’s essential role; (4) Developing nano-delivery systems to improve bioavailability, addressing a common challenge in translating natural polyphenols to clinical use. These future directions will further validate the mechanisms underlying hopeaphenol’s action. 5. Conclusions In this study, integrated in vivo (TAC mouse model), in vitro (Ang II-induced HL-1 cardiomyocytes), and network pharmacology experiments confirm that hopeaphenol exerts a protective effect against pressure overload-induced cardiac hypertrophy and delays heart failure progression.Mechanistically, hopeaphenol directly binds to AMPK (validated by molecular docking with two AMPK structures and CETSA) to activate the AMPK/SIRT1 signaling pathway. This activation improves mitochondrial energy metabolism, reduces oxidative stress, mitigates myocardial hypertrophy and fibrosis, and ultimately restores cardiac function—effects that are abolished by the AMPK inhibitor Compound C, confirming AMPK as a critical mediator.Compared with its monomer resveratrol, hopeaphenol has structural and functional advantages: higher bioavailability (due to enhanced metabolic stability), lower toxicity (effective at 5–20 mg/kg in vivo or 1–10 μM in vitro without significant cytotoxicity), and a clearer, more target-specific mechanism (state-dependent binding to inactive AMPK, avoiding resveratrol’s biphasic effects and off-target risks). Collectively, these findings identify hopeaphenol as a promising candidate for the prevention and treatment of cardiac hypertrophy-related heart failure, while also highlighting the need for further research: validating its efficacy in diverse hypertrophy models, clarifying the role of specific AMPKα subunits via genetic approaches, and optimizing nano-delivery systems to improve its clinical translational potential ( Figure 8 Disclaimer/Publisher’s Note: Author Contributions C.L. and C.F. (Chunping Fang): conceptualization and funding acquisition: J.C., M.W. and Z.Z.: investigation; C.F. (Chongkai Fang), J.W., H.Z., T.W. and J.Z.: data curation; J.C.: methodology, writing—original draft, reviewing, and editing; M.W. and Z.Z.: methodology, writing, reviewing, and editing. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Ethics Committee of Guangzhou University of Chinese Medicine (Approval No. XS20240031, approved on 19 March 2024). Informed Consent Statement Not applicable. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors without undue reservation. Conflicts of Interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Abbreviations AMPK: AMP-activated protein kinase; ATP, adenosine triphosphate; ADP, adenosine diphosphate; AngII, angiotensin II; AKT2, protein kinase B β; ACE, angiotensin-converting enzyme; AMPKα, AMP-activated protein kinase α; BNP, brain natriuretic peptide; BAX, BCL2-associated X protein; BCL2, B-cell lymphoma 2; CC, compound C; FBS, fetal bovine serum; CYP3A4, cytochrome P450 3A4; cCasp3, cleaved caspase-3; CCND1, cyclin D1; EF, ejection fraction; F-actin, filamentous actin; FS, fractional shortening; HP, Hopeaphenol; HP-L, Hopeaphenol low; HP-M, Hopeaphenol middle; HP-H, Hopeaphenol high; HE, hematoxylin and eosin; LVIDd, left ventricular internal dimension at end-diastole; LVIDs, left ventricular internal dimension at end-systole; LVPWd, left ventricular posterior wall thickness at end-diastole; LVPWs, left ventricular posterior wall thickness at end-systole; LV Mass, left ventricular mass; LKB1, liver kinase B1; MET, metformin; MDA, malondialdehyde; mTOR, mammalian target of rapamycin; pAMPK, phosphorylated AMP-activated protein kinase; PGC-1α, peroxisome proliferator-activated receptor gamma coactivator 1-alpha; ROS, reactive oxygen species; SIRT1, silent information regulator 1; SOD, superoxide dismutase; TAC, transverse aortic constriction; WGA, wheat germ agglutinin; β-MHC, β-myosin heavy chain. References 1. Vásquez-Trincado C. García-Carvajal I. Pennanen C. Parra V. Hill J.A. Rothermel B.A. Lavandero S. Mitochondrial dynamics, mitophagy and cardiovascular disease J. Physiol. 2016 594 509 525 10.1113/JP271301 26537557 PMC5341713 2. Ye B. Zhou H. Chen Y. Luo W. Lin W. Zhao Y. Han J. Han X. Huang W. Wu G. USP25 Ameliorates Pathological Cardiac Hypertrophy by Stabilizing SERCA2a in Cardiomyocytes Circ. Res. 2023 132 465 480 10.1161/CIRCRESAHA.122.321849 36722348 3. Nakamura M. Sadoshima J. Mechanisms of physiological and pathological cardiac hypertrophy Nature reviews Cardiology 2018 15 387 407 10.1038/s41569-018-0007-y 29674714 4. Barry S.P. Davidson S.M. Townsend P.A. Molecular regulation of cardiac hypertrophy Int. J. Biochem. Cell Biol. 2008 40 2023 2039 10.1016/j.biocel.2008.02.020 18407781 5. Lopaschuk G.D. Jaswal J.S. Energy metabolic phenotype of the cardiomyocyte during development, differentiation, and postnatal maturation J. Cardiovasc. Pharmacol. 2010 56 130 140 10.1097/FJC.0b013e3181e74a14 20505524 6. Zhang L. Ussher J.R. Sankaralingam S. Wagg C. Zaugg M. Lopaschuk G.D. Cardiac insulin-resistance and decreased mitochondrial energy production precede the development of systolic heart failure after pressure-overload hypertrophy Circ. Heart Fail. 2013 6 1039 1048 10.1161/CIRCHEARTFAILURE.112.000228 23861485 7. Gao F. Liang T. Lu Y.W. Fu X. Dong X. Pu L. Hong T. Zhou Y. Zhang Y. Liu N. A defect in mitochondrial protein translation influences mitonuclear communication in the heart Nat. Commun. 2023 14 1595 10.1038/s41467-023-37291-5 36949106 PMC10033703 8. Ritterhoff J.T.R. Metabolic mechanisms in physiological and pathological cardiac hypertrophy: New paradigms and challenges Nat. Rev. Cardiol. 2023 20 812 829 10.1038/s41569-023-00887-x 37237146 9. Doenst T. Nguyen T.D. Abel E.D. Cardiac metabolism in heart failure: Implications beyond ATP production Circ. Res. 2013 113 709 724 10.1161/CIRCRESAHA.113.300376 23989714 PMC3896379 10. Peng S. Lu X.F. Qi Y.D. Li J. Xu J. Yuan T.Y. Wu X.Y. Ding Y. Li W.H. Zhou G.-Q. LCZ696 Ameliorates Oxidative Stress and Pressure Overload-Induced Pathological Cardiac Remodeling by Regulating the Sirt3/MnSOD Pathway Oxidative Med. Cell. Longev. 2020 2020 9815039 10.1155/2020/9815039 PMC7519988 33014281 11. O’brien C.M. Mulukutla B.C. Mashek D.G. Hu W.-S. Regulation of Metabolic Homeostasis in Cell Culture Bioprocesses Trends Biotechnol. 2020 38 1113 1127 10.1016/j.tibtech.2020.02.005 32941791 12. Herzig S. Shaw R.J. AMPK: Guardian of metabolism and mitochondrial homeostasis Nat. Rev. Mol. Cell Biol. 2018 19 121 135 10.1038/nrm.2017.95 28974774 PMC5780224 13. Zhu C. Wang M. Yu X. Shui X. Tang L. Chen Z. Xiong Z. lncRNA NBR2 attenuates angiotensin II-induced myocardial hypertrophy through repressing ER stress via activating LKB1/AMPK/Sirt1 pathway Bioengineered 2022 13 13667 13679 10.1080/21655979.2022.2062527 35703318 PMC9275985 14. Dolinsky V.W.S.C. Rogan K.J. Chan A.Y. Nagendran J. Wang S. Dyck J.R.B. Resveratrol prevents pathological but not physiological cardiac hypertrophy J. Mol. Med. 2015 93 413 425 10.1007/s00109-014-1220-8 25394677 15. Dolinsky V.W. Chakrabarti S. Pereira T.J. Oka T. Levasseur J. Beker D. Zordoky B.N. Morton J.S. Nagendran J. Lopaschuk G.D. Resveratrol prevents hypertension and cardiac hypertrophy in hypertensive rats and mice Biochim. Biophys. Acta 2013 1832 1723 1733 10.1016/j.bbadis.2013.05.018 23707558 16. Giuliani C. Iezzi M. Ciolli L. Hysi A. Bucci I. Di Santo S. Rossi C. Zucchelli M. Napolitano G. Resveratrol has anti-thyroid effects both in vitro and in vivo Food Chem. Toxicol. Int. J. Publ. Br. Ind. Biol. Res. Assoc. 2017 107 Pt A 237 247 10.1016/j.fct.2017.06.044 28668442 17. Shaito A. Posadino A.M. Younes N. Hasan H. Halabi S. Alhababi D. Al-Mohannadi A. Abdel-Rahman W.M. Eid A.H. Nasrallah G.K. Potential Adverse Effects of Resveratrol: A Literature Review Int. J. Mol. Sci. 2020 21 2084 10.3390/ijms21062084 32197410 PMC7139620 18. Seya K. Kanemaru K. Sugimoto C. Suzuki M. Takeo T. Motomura S. Kitahara H. Niwa M. Oshima Y. Furukawa K.-I. Opposite effects of two resveratrol (trans-3,5,4′-trihydroxystilbene) tetramers, vitisin A and hopeaphenol, on apoptosis of myocytes isolated from adult rat heart J. Pharmacol. Exp. Ther. 2009 328 90 98 10.1124/jpet.108.143172 18927354 19. Dealmeida A.C. Van Oort R.J. Wehrens X.H. Transverse aortic constriction in mice J. Vis. Exp. JoVE 2010 38 e1729 10.3791/1729 PMC3164086 20410870 20. Fu Y.N. Xiao H. Ma X.W. Jiang S.-Y. Xu M. Zhang Y.-Y. Metformin attenuates pressure overload-induced cardiac hypertrophy via AMPK activation Acta Pharmacol. Sin. 2011 32 879 887 10.1038/aps.2010.229 21552292 PMC4003117 21. Hwangbo D.S. Lee H.Y. Abozaid L.S. Min K.-J. Mechanisms of Lifespan Regulation by Calorie Restriction and Intermittent Fasting in Model Organisms Nutrients 2020 12 1194 10.3390/nu12041194 32344591 PMC7230387 22. Xiao Z. Dai C. Yu T. Zhu J. Pan Y. Shuai W. Kong B. Huang H. Ubiquitin specific protease 38 aggravates pathological cardiac remodeling by stabilizing phospho-TBK1 Int. J. Biol. Sci. 2024 20 1815 1832 10.7150/ijbs.85562 38481817 PMC10929191 23. Shimizu I. Minamino T. Physiological and pathological cardiac hypertrophy J. Mol. Cell. Cardiol. 2016 97 245 262 10.1016/j.yjmcc.2016.06.001 27262674 24. Gallo G. Rubattu S. Volpe M. Mitochondrial Dysfunction in Heart Failure: From Pathophysiological Mechanisms to Therapeutic Opportunities Int. J. Mol. Sci. 2024 25 2667 10.3390/ijms25052667 38473911 PMC10932393 25. Nollet E.E. Duursma I. Rozenbaum A. Eggelbusch M. I Wüst R.C. Schoonvelde S.A.C. Michels M. Jansen M. van der Wel N.N. Bedi K.C. Mitochondrial dysfunction in human hypertrophic cardiomyopathy is linked to cardiomyocyte architecture disruption and corrected by improving NADH-driven mitochondrial respiration Eur. Heart J. 2023 44 1170 1185 10.1093/eurheartj/ehad028 36734059 PMC10067466 26. Lyon R.C. Zanella F. Omens J.H. Sheikh F. Mechanotransduction in cardiac hypertrophy and failure Circ. Res. 2015 116 1462 1476 10.1161/CIRCRESAHA.116.304937 25858069 PMC4394185 27. Ingwall J.S. Energy metabolism in heart failure and remodelling Cardiovasc. Res. 2009 81 412 419 10.1093/cvr/cvn301 18987051 PMC2639129 28. Dai D.F. Hsieh E.J. Liu Y. Chen T. Beyer R.P. Chin M.T. MacCoss M.J. Rabinovitch P.S. Mitochondrial proteome remodelling in pressure overload-induced heart failure: The role of mitochondrial oxidative stress Cardiovasc. Res. 2012 93 79 88 10.1093/cvr/cvr274 22012956 PMC3243039 29. Smyrnias I. Gray S.P. Okonko D.O. Sawyer G. Zoccarato A. Catibog N. López B. González A. Ravassa S. Díez J. Cardioprotective Effect of the Mitochondrial Unfolded Protein Response During Chronic Pressure Overload J. Am. Coll. Cardiol. 2019 73 1795 1806 10.1016/j.jacc.2018.12.087 30975297 PMC6456800 30. Goh K.Y. He L. Song J. Jinno M. Rogers A.J. Sethu P. Halade G.V. Rajasekaran N.S. Liu X. Prabhu S.D. Mitoquinone ameliorates pressure overload-induced cardiac fibrosis and left ventricular dysfunction in mice Redox Biol. 2019 21 101100 10.1016/j.redox.2019.101100 30641298 PMC6330374 31. Feng Y. Zhang Y. Xiao H. AMPK and cardiac remodelling Sci. China Life Sci. 2018 61 14 23 10.1007/s11427-017-9197-5 29170891 32. Dong H.W. Zhang L.F. Bao S.L. AMPK regulates energy metabolism through the SIRT1 signaling pathway to improve myocardial hypertrophy Eur. Rev. Med. Pharmacol. Sci. 2018 22 2757 2766 29771428 10.26355/eurrev_201805_14973 33. Tang B.L. Sirt1 and the Mitochondria Mol. Cells 2016 39 87 95 10.14348/molcells.2016.2318 26831453 PMC4757807 34. Su P.-S. Doerksen R.J. Chen S.-H. Sung W.-C. Juan C.-C. Rawendra R.D. Chen C.-R. Li J.-W. Aisha Huang T.-C. Screening and profiling stilbene-type natural products with angiotensin-converting enzyme inhibitory activity from Ampelopsis brevipedunculata J. Pharm. Biomed. Anal. 2015 108 70 77 10.1016/j.jpba.2015.01.053 25710905 35. Häusl A.S. Bajaj T. Brix L.M. Pöhlmann M.L. Hafner K. De Angelis M. Nagler J. Dethloff F. Balsevich G. Schramm K.-W. Mediobasal hypothalamic FKBP51 acts as a molecular switch linking autophagy to whole-body metabolism Sci. Adv. 2022 8 eabi4797 10.1126/sciadv.abi4797 35263141 PMC8906734 36. Liu W. Zhao Y. Wang G. Feng S. Ge X. Ye W. Wang Z. Zhu Y. Cai W. Bai J. TRIM22 inhibits osteosarcoma progression through destabilizing NRF2 and thus activation of ROS/AMPK/mTOR/autophagy signaling Redox Biol. 2022 53 102344 10.1016/j.redox.2022.102344 35636015 PMC9144049 37. Posadino A.M. Cossu A. Giordo R. Zinellu A. Sotgia S. Vardeu A. Hoa P.T. Van Nguyen L.H. Carru C. Pintus G. Resveratrol alters human endothelial cells redox state and causes mitochondrial-dependent cell death Food Chem. Toxicol. 2015 78 10 16 10.1016/j.fct.2015.01.017 25656643 38. Calabrese E.J. Mattson M.P. Calabrese V. Resveratrol commonly displays hormesis: Occurrence and biomedical significance Hum. Exp. Toxicol. 2010 29 980 1015 10.1177/0960327110383625 21115559 39. Hadi S.M. Ullah M.F. Azmi A.S. Ahmad A. Shamim U. Zubair H. Khan H.Y. Resveratrol mobilizes endogenous copper in human peripheral lymphocytes leading to oxidative DNA breakage: A putative mechanism for chemoprevention of cancer Pharm. Res. 2010 27 979 988 10.1007/s11095-010-0055-4 20119749 40. Fujimoto A. Sakanashi Y. Matsui H. Oyama T. Nishimura Y. Masuda T. Oyama Y. Cytometric analysis of cytotoxicity of polyphenols and related phenolics to rat thymocytes: Potent cytotoxicity of resveratrol to normal cells Basic. Clin. Pharmacol. Toxicol. 2009 104 455 462 10.1111/j.1742-7843.2009.00386.x 19389048 41. Berardi V. Ricci F. Castelli M. Galati G. Risuleo G. Resveratrol exhibits a strong cytotoxic activity in cultured cells and has an antiviral action against polyomavirus: Potential clinical use J. Exp. Clin. Cancer Res. 2009 28 96 10.1186/1756-9966-28-96 19570215 PMC2710315 42. Deng R. Xu C. Chen X. Chen P. Wang Y. Zhou X. Jin J. Niu L. Ying M. Huang M. Resveratrol suppresses the inducible expression of CYP3A4 through the pregnane X receptor J. Pharmacol. Sci. 2014 126 146 154 10.1254/jphs.14132FP 25341566 43. Detampel P.B.M. Krähenbühl S. Huwyler J. Drug interaction potential of resveratrol Drug Metab. Rev. 2012 44 253 265 10.3109/03602532.2012.700715 22788578 44. Atmaca N.Y.E. Güner B. Kabakçi R. Bilmen F.S. Effect of resveratrol on hematological and biochemical alterations in rats exposed to fluoride BioMed Res. Int. 2014 2014 698628 10.1155/2014/698628 24995323 PMC4068056 45. Wang Y. Cui H. Niu F. Liu S.-L. Li Y. Zhang L.-M. Du H.-B. Zhao Z.-G. Niu C.-Y. Effect of Resveratrol on Blood Rheological Properties in LPS-Challenged Rats Front. Physiol. 2018 9 1202 10.3389/fphys.2018.01202 30210364 PMC6123545 46. Crowell J.A. Korytko P.J. Morrissey R.L. Booth T.D. Levine B.S. Resveratrol-associated renal toxicity Toxicol. Sci. 2004 82 614 619 10.1093/toxsci/kfh263 15329443 Figure 1 Hopeaphenol improves cardiac function in TAC-induced heart failure mice. ( A B C H p n Figure 2 Hopeaphenol attenuates TAC-induced pathological cardiac remodeling. ( A B C E F J F G H I J K M K L M N O p n Figure 3 Hopeaphenol ameliorates oxidative stress and metabolic dysregulation in TAC mice. ( A D p n Figure 4 Hopeaphenol targets AMPK for cardiac protection. ( A B C D E F n G F H F p I J L J K L M p n Figure 5 Hopeaphenol alleviates Ang II-induced cardiomyocyte hypertrophy Via AMPK/SIRT1 activation. ( A B C D G E F G H K H J I K L M L M p n Figure 6 Hopeaphenol reduces mitochondrial ROS and enhances membrane potential in Ang II-treated HL-1 cardiomyocytes. ( A B A B C D C D Figure 5 p n Figure 7 AMPK inhibition by Compound C abolishes Hopeaphenol-mediated protection against Ang II-induced hypertrophy and apoptosis in HL-1 cardiomyocytes. ( A E A B E F H I K I J K Figure 5 p n I K n Figure 8 Schematic of hopeaphenol alleviating cardiac hypertrophy. The left panel shows the Ang II/TAC-induced pathological process (HL-1 cells, C57 mice), characterized by mitochondrial dysfunction, cardiomyocyte hypertrophy, and fibrosis. The right panel depicts that Hopeaphenol primarily activates the AMPK/SIRT1 signaling pathway to improve cardiac and mitochondrial function, and to inhibit hypertrophy, fibrosis, and apoptosis; notably, due to the potential off-target effects of CC (Compound C), the involvement of other pathways in these processes cannot be completely ruled out. Meanwhile, CC (Compound C) blocks the activity of AMPK, which in turn abrogates the aforementioned beneficial effects of Hopeaphenol—this observation strongly supports the role of AMPK in mediating Hopeaphenol’s cardioprotection (by Figdraw). CC, Compound C. nutrients-17-03025-t001_Table 1 Table 1 qPCR Primer Sequences. Gene Forward Primer (5′–3′) Reverse Primer (5′–3′) AMPK GTCAAAGCCGACCCAATGATA CGTACACGCAAATAATAGGGGTT SIRT1 TGATTGGCACCGATCCTCG CCACAGCGTCATATCATCCAG β-MHC CCTGCGGAAGTCTGAGAAGG CTCGGGACACGATCTTGGC BNP GAGGTCACTCCTATCCTCTGG GAGGTCACTCCTATCCTCTGG GAPDH AGGTCGGTGTGAACGGATTTG GGGGTCGTTGATGGCAACA ",
  "metadata": {
    "Title of this paper": "Resveratrol-associated renal toxicity",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472553/"
  }
}