{
  "title": "Paper_237",
  "abstract": "pmc Stem Cell Res Ther Stem Cell Res Ther 1238 stemcellres Stem Cell Research & Therapy 1757-6512 BMC PMC12486737 PMC12486737.1 12486737 12486737 41035068 10.1186/s13287-025-04651-5 4651 1 Research H3K18 lactylation-hexokinase 2 positive feedback loop promotes osteogenesis of ASPCs in facial infiltrating lipomatosis Chen Hongrui Hua Chen Chang Shih-Jen Qiu Yajing Lin Xiaoxi xiaoxilin@shsmu.edu.cn Sun Bin binsun72@163.com https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of Plastic & Reconstructive Surgery , Shanghai Ninth People’s Hospital Shanghai Jiao Tong University School of Medicine , 1 10 2025 2025 16 478640 538 23 4 2025 28 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Facial infiltrating lipomatosis (FIL) is a rare congenital disorder characterized by adipose hyperplasia and osseous overgrowth, driven by somatic PIK3CA mutations. While PIK3CA-induced metabolic reprogramming elevates lactate levels, the role of histone lactylation in FIL pathogenesis remains unclear. Methods Adipose stem and progenitor cells (ASPCs) from FIL adipose tissue were isolated. Glycolysis inhibitors (2-DG, oxamate), lactate supplementation, and siRNA-mediated knockdown were used to modulate lactylation. CUT&Tag sequencing, Western blot, qPCR, ChIP-qPCR and functional assays (osteogenic/adipogenic differentiation) were performed to elucidate the potential mechanism. Results FIL-ASPCs exhibited hyperlactylation, particularly at H3K18. H3K18la promoted osteogenesis by activating osteogenic genes, while adipogenesis remained unaffected. Inhibition of lactylation via glycolysis inhibitors or LDHA/LDHB knockdown suppressed osteogenic differentiation, whereas lactate supplementation reversed these effects. TGF-β1 stimulation could increase lactylation levels and promote osteogenic differentiation. Moreover, H3K18la upregulated hexokinase 2 (HK2), enhancing glycolysis and lactate production, thereby forming a lactate-H3K18la-HK2 positive feedback loop. Conclusions This study identified H3K18 lactylation as a key epigenetic driver of FIL-associated osseous hyperplasia via a lactate-H3K18la-HK2 feedback loop. Targeting this axis may offer therapeutic potential for FIL and related metabolic bone disorders. Supplementary Information The online version contains supplementary material available at 10.1186/s13287-025-04651-5. Keywords Facial infiltrating lipomatosis Adipose stem and progenitor cells Osteogenesis H3K18 lactylation Hexokinase 2 Fundamental research program funding of Ninth People's Hospital affiliated to Shanghai Jiao Tong university School of Medicine JYZZ241 Top Priority Research Center of Shanghai—Plastic Surgery Research Center, Shanghai 2023ZZ02023 Treatment and mechanism of PI3K/mTOR dual-target inhibitor (WX390) on PIK3CA-related overgrowth spectrum (PROS) JYHX2022004 http://dx.doi.org/10.13039/501100012226 Fundamental Research Funds for the Central Universities YG2023ZD13 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Facial infiltrating lipomatosis (FIL) is a rare congenital disorder characterized by progressive facial enlargement evident at birth [ 1 2 3 Under aerobic conditions, owing to the “Warburg effect,” tumor cells tend to generate notably large amounts of lactic acid compared to normal cells, resulting in increased lactylation of proteins [ 4 5 6 7 + 8 9 Interestingly, previous study revealed that PIK3CA gain-of-function mutation in adipose tissue induced metabolic reprogramming with Warburg-like effect, promoting lactate accumulation in adipocytes [ 10 Methods The work has been reported in line with the ARRIVE guidelines 2.0. Human subject and ethics approval The patients’ clinical characteristics were presented in Table S1. Adipose tissues from FIL patients and patients underwent facial cutaneous lesions surgery (CON) were collected for experimental analyses. This study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of Shanghai Ninth People’s Hospital. The approval number was No.SH9H-2022-T215-1. Date that the ethics approval was granted: October 6, 2022. ASPCs were isolated and collected from facial adipose tissue, with written consent of donors. Cell culture ASPCs were isolated from adipose tissue and identified as described previously [ 11 Western blot Lysates from ASPCs cells or tissues were prepared using RIPA buffer (Epizyme, PC101) supplemented with 1% phosphatase inhibitor mix (Epizyme, GRF102) and 1% protease inhibitor blend (Epizyme, GRF101) at a temperature of 4 °C for a duration of 20 min. Protein concentrations were determined by the bicinchoninic acid assay (Epizyme, ZJ102), and samples were adjusted to equalize their protein content. The proteins were combined with a protein sample buffer (Epizyme, LT101) in a ratio of 4:1, and then subjected to a heat treatment at 100 °C for 7 min prior to being resolved on 0.45 μm PVDF membranes. After a 15-minute blocking step with a Protein Free Rapid Blocking Buffer (1×) (Epizyme, PS108P), the membrane was incubated overnight with primary antibodies, including pan anti-kla (PTM Bio, PTM-1401RM), anti-H3K18la (PTM Bio, PTM-1427RM), anti-H3K9la (PTM Bio, PTM-1419RM), anti-H3K23la (PTM Bio, PTM-1413RM), anti-H4K5la (PTM Bio, PTM-1407RM), anti-H4K12la (PTM Bio, PTM-1411RM), anti-α tubulin (Proteintech, 11224-1-AP), anti-HK2 (Epizyme, R010880), anti-LDHA (Cell Signaling Technology, 2012), anti-Histone H3 (HUABIO, M1309-1), anti-Histone H4 (HUABIO, ET1612-43), anti-LDHB (Cell Signaling Technology, 56298), anti-RUNX2 (Proteintech, 20700-1-AP), anti-Collagen type I (COL-1, Proteintech, 67288-1-Ig), anti-ALP (Abcam, ab307726), anti-PPAR γ (Cell Signaling Technology, 2443 S), anti-C/EBP α (Proteintech, 13274-1-AP), and anti-FABP 4 (Proteintech, 12802-1-AP) overnight. Subsequently, the membranes were incubated with secondary antibodies for 45 min at room temperature and visualized using NcmECL Ultra (NCM Biotech, Suzhou, China) with the Tanon 4600 Automatic Chemiluminescence/Fluorescence Image Analysis System (Tanon, Shanghai, China). The intensity of the immunoreactive bands was quantified using Image J software. All uncropped blot can be found in Figure S5. Oil red O staining Oil Red O staining was performed according to the instructions of the Modified Oil Red O Staining Kit (Beyotime, C0158S). Quantitative analysis of Oil red O staining area was determined using Image-Pro Plus 6.0 software. Osteogenic induction Once the cells reached confluency, the growth medium was switched to osteogenic differentiation kit (Cyagen Biosciences, HUXMD-90021) for 5 or 9 days. Induction solution was mixed with various concentrations of 2-Deoxy-D-glucose (2-DG, MedChemExpress, HY-13966), Oxamic acid sodium (Oxamate, MedChemExpress, HY-W013032A), sodium lactate (Nala, MedChemExpress, HY-B2227B) when needed. Adipogenic induction Once the cells reached confluency, the growth medium was switched to induction medium A. After three days, the medium was replaced by induction medium B for one day (all from Cyagen Biosciences, USA). Induction A and B were mixed with various concentrations of 2-DG, Oxamate, and Nala when needed. The cells were used on days 8 for follow-up experimental research. Alizarin red staining (ARS) ARS was performed according to the instructions of the Alizarin Red Staining Solution (Beyotime, C0138). Quantitative analysis of ARS area was determined using Image-Pro Plus 6.0 software. Alkaline phosphatase (ALP) staining ALP staining was performed after osteogenic induction according to the manufacturer’s instruction (Abcam, ab284936). Cell counting Kit-8 (CCK-8) assay Herein, 8 × 10 3 Lactic acid content detection Digest the cells in a 10 cm culture dish and take 2 × 10 7 Immunofluorescence FIL adipose tissues and normal adipose tissues in paraffin-embedded sections were deparaffinized, rehydrated, fixed, and blocked with 5% normal goat serum (Vector) and then incubated with pan anti-Kla (PTM-1401RM) and anti-H3K18la (PTM-1427RM) antibodies at 4 °C overnight. Thereafter, the slides were incubated with the appropriate secondary antibodies for 30 min, and nuclei were counterstained with DAPI (Sigma-Aldrich) for 1 h. Digital images were obtained with a ZEISS Axio Scope A1 upright microscope. Relative pan-Kla levels and H3K18la levels were determined by comparing the fluorescence intensity of the target antibody with that of DAPI. Histological staining After CT analysis, the formation of new bone tissue at the defect site was further examined by histological staining. Briefly, femoral specimens were fixed with 4% paraformaldehyde for 48 h. Subsequently, they were continuously decalcified with phosphate containing 12.5% ethylenediaminetetraacetic acid (EDTA) disodium salt, and the solution was replaced with fresh solution every 48 h. After decalcification, they were embedded in paraffin and routinely sectioned for H&E, Masson, toluidine blue and Saf-O/Fast Green staining. Methods-Cleavage under targets and tagmentation (CUT&Tag) assays The CUT&Tag assay was conducted using the Hyperactive™ In-Situ ChIP Library Prep Kit for Illumina(Vazyme Biotech, China) in accordance with the manufacturer’s instructions. After being washed with PBS,cultured primary ASPCs were incubated with ConA Beads, primary antibody against H3K18la (PTM Bio,PTM-1427RM), secondary antibody and the Hyperactive pA-Tn5 Transposase in order and then fragmented.The fragmented DNA was then isolated, amplified, and purified for sequencing and qPCR assays. ForCUT&Tag sequencing, the libraries were sequenced on an Illumina NovaSeq6000 platform (GenefundBiotech, Shanghai, China). The clean reads were obtained after removing adapter sequences and low-qualityreads with Fastp software, and mapped to the human reference genome using Bowtie2. Peak calling wasperformed with SEACR software and annotated using CHIPseeker software. IGV software was used tovisualize peak distributions along genomic regions of interested genes. Quantitative real-time PCR (qPCR) Total RNA was isolated using Trizol reagent (Thermo Scientific). Then, RNA was reverse-transcribed into cDNA using a 1 st Strand cDNA synthesis kit (Yeasen, 11119ES60). qPCR was performed using SYBR green mix (Vazyme) on an Applied Biosystems (Thermo Scientific). Relative mRNA expression was calculated using the 2 −ΔΔCt Chromatin Immunoprecipitation followed by qPCR (ChIP-qPCR) ChIP was performed according to the manufacturer’s instructions (The Agarose ChIP Kit, 26 156, ThermoFisher). Summarily, FIL-ASPCs were fixed with 1% formaldehyde for 10 min at room temperature and quenched with Glycine Solution (1X) for 5 min. Then, fixed cells were lysed with Lysis Buffer 1 containing protease inhibitors and digested with Micrococcal Nuclease (ChIP Grade) (10 U/µL). The digested chromatin was incubated Dilution Buffer containing primary antibodies at 4 °C overnight on a vertical roller. Then, ChIP Grade Protein A/G Plus Agarose was added to each IP, the column was centrifuged, and the column was washed with Wash Buffer 1/2/3. Later, IP was eluted with 150 µL IP Elution Buffer, 6 µL of 5 m NaCl, and 2 µL of 20 mg mL −1 Lentivirus packaging We prepared lentivirus carrying shRNA to knock down the expression of HK2. The lentivirus was obtained from Zuorun Biotech. For transduction, ASPCs were incubated with virus-containing supernatant (MOI = 10) in the presence of 10 µL polybrene. After 10 h, infected cells were selected with puromycin supernatant. Plasmid transfection Three siRNA sequences targeting LDHA and LDHB were designed, with the most effective siRNA sequence used for subsequent transfections. The siRNA sequences were designed and synthesized by GenePharma (Shanghai, China). Transfections were carried out according to the instructions of Lipofectamine 8000 (Beyotime, C0533). Animal models A total of 10 male adult SD rats were randomly divided into two groups ( n 2 Quantification and statistical analysis GraphPad Prism (v 8.0) was used for statistical analyses. Two-tailed Student’s t test was utilized for comparison between the two groups. One-way analysis of variance (ANOVA) coupled with the Bonferroni’s post hoc test was used for comparisons among three or more groups. Data were presented as mean ± standard deviation (SD). P Results Elevated histone lactylation levels in the adipose tissue and ASPCs of FIL Photograph assessment confirmed substantial facial overgrowth in all FIL cases, where diagnostic imaging demonstrated coexisting osseous malformations and pathological adipose proliferation (Fig. 1 11 10 1 1 1 1 1 1  Fig. 1 Increased lactylation level in FIL adipose tissue and FIL-ASPCs. A B C D E F G H J K L M N O C E F H J L N Inhibition of H3K18la suppressed osteogenesis of FIL-ASPCs in vitro To investigate histone lactylation’s regulatory role in FIL-ASPC adipogenesis, we implemented three metabolic interventions to regulate intracellular lactylation: (1) pharmacological glycolysis suppression using 2-DG and oxamate; (2) exogenous lactate elevation via Nala; (3) LDHA/LDHB siRNA-mediated lactate dehydrogenase silencing (Fig. 2 5 2 2 12  Fig. 2 Inhibition of H3K18la inhibited osteogenesis in vitro. A B D B C D E G E F G H J H I J K L M O P B C D K L M O P Previous studies reported that endothelial cell-derived lactate promoted osteogenic differentiation of bone marrow mesenchymal stem cells (BMSCs), and LDHA knockdown impairs osteogenic differentiation in MC3T3-E1 mouse osteoblast precursor cells [ 13 14 2 2 2 – 2 2 2 2 Inhibition of histone lactylation suppressed osteogenesis of FIL-ASPCs in vivo While in vitro studies demonstrated impaired osteogenic differentiation in LDHA/LDHB-suppressed FIL-ASPCs, we investigated H3K18la’s bone regenerative potential through in vivo femoral defect models in rodents (Fig. 3 3 3 3  Fig. 3 Osteogenesis and new bone formation were observed 28 days after surgery. A B C D E F To offer a comprehensive assessment of the newborn bone conditions beyond CT scans, we employed a diverse range of histological staining techniques, including H&E, Masson, toluidine blue, and Saf-O/Fast Green. The H&E staining highlighted a significant increase in new bone formation around the Matrigel in group (1) After Masson staining, group 1 showed superior osseointegration, with a larger amount of mature bone tissue (colored red) and a greater quantity of newly formed bone (colored blue) compared to group (2) Toluidine blue staining indicated a higher number of trabecular structures in group 1. Furthermore, Saf-O/Fast Green staining revealed a higher degree of bone formation (colored green) and cartilage formation (colored red) in group 1 (Fig. 3 Identifcation of potential downstream targets of H3K18 lactylation by genome-wide CUT & Tag analysis We employed CUT&Tag, an ultra-sensitive chromatin profiling technique, to delineate H3K18la-mediated transcriptional regulation in ASPCs. Genome-wide epigenetic mapping compared H3K18la-associated genomic loci between FIL-ASPCs and control counterparts. DeepTools processing revealed pronounced chromatin occupancy of H3K18la in pathological ASPCs versus controls (Fig. 4 4 4 4  Fig. 4 Identification of potential downstream targets of H3K18 lactylation by genome-wide CUT& Tag analysis. A B C D E F G L G H I J K L G H I J K L M P N O P The pronounced enrichment of H3K18la at osteogenic gene loci in FIL-ASPCs prompted investigation into its functional correlation with skeletal differentiation markers. Epigenetic profiling via CUT&Tag revealed heightened H3K18la enrichment at promoters of osteogenesis-associated genes (ALPL, RUNX2, BMP7, SP7, BMP2, BGLAP) in FIL-ASPCs versus CON-ASPCs. Furthermore, qPCR confirmed that the expression levels of these genes were significantly upregulated in FIL-ASPCs (Fig. 4 – – 4 – TGF-β1 promoted histone lactylation and osteogenesis in FIL-ASPCs The pleiotropic cytokine TGF-β1, a well-established regulator of mesenchymal stem cell osteogenic commitment [ 15 16 4 5 5 5 5 5 5  Fig. 5 TGF-β1 promoted H3K18la level and osteogenesis of FIL-ASPCs. A B C D E F G H I J K L M N D G H J L Subsequently, we explored whether TGF-β1 could mitigate the impact of glycolytic inhibitors. Increasing the concentration of oxamate from 10 mM to 20 mM significantly diminished H3K18 lactylation levels. Nevertheless, TGF-β1 treatment effectively restored H3K18la modification even at both elevated and lower oxamate concentrations (Fig. 5 5 5 5 5 Feedback loop driven by H3K18la and HK2 promoted osteogenesis Interestingly, CUT& Tag analysis unveiled an increase in levels of H3K18la at the promotors of HK2 in FIL-ASPCs (Fig. 6 6 6 6 – 6 6 6 – 6  Fig. 6 A feedback loop driven by H3K18la and HK2 promoted osteogenesis. A B C D E G E F G I J K L B C D K Discussion Histone lactylation, an emerging epigenetic modification, has been shown to play a critical role in regulating gene expression and cellular metabolism [ 17 7 18 19 20  Fig. 7 Schematic diagram of the molecular mechanism. In FIL-ASPCs, higher H3K18la level increased the expression of osteogenic genes and HK2. HK2 further promoted glycolysis, forming an H3K18la-lactate-H3K18la-HK2 feedback loop. Moreover, TGF-β1 can also increase the intracellular lactate and lactylation levels While our study demonstrated that H3K18la promoted osteogenesis of FIL-ASPCs, it is important to address the limitation that ASPCs were isolated from adipose tissue rather than directly from hyperplastic bone or BMSCs. This raises the question of whether the observed lactylation-driven osteogenesis in ASPCs fully recapitulates the pathological bone overgrowth in FIL. We acknowledge that BMSCs are the canonical osteoprogenitors in skeletal development, and their absence in our model may limit direct extrapolation to bony hyperplasia [ 21 22 23 24 TGF-β1 is a well-known regulator of osteogenic differentiation and has been implicated in various metabolic processes, including glycolysis [ 25 27 The identification of a positive feedback loop involving H3K18la and HK2 represents a significant discovery in this study. We showed that H3K18la enhanced HK2 expression, which in turn promoted glycolysis and lactate accumulation, further increasing H3K18la levels. This feedback loop appears to be crucial for the sustained activation of osteogenic genes in FIL-ASPCs. Similar feedback mechanisms have been observed in other contexts. For example, the glycolysis/H4K12la/PKM2 positive feedback loop exacerbates microglial cell dysfunction, while H3K9la inhibits the expression of the lactylation eraser HDAC2, further aggravating H3K9la-induced angiogenic gene expression [ 28 29 Despite these advances, several limitations warrant consideration. First, the study’s reliance on a small cohort of FIL necessitates validation in larger, diverse populations to confirm the universality of the H3K18la-HK2 axis. Second, while in vitro experiments robustly demonstrate the role of lactylation in osteogenesis, in vivo evidence remains preliminary. We cannot clearly determine whether the effect of lactylation on bone healing in vivo is due to the osteogenic differentiation of the cells themselves or the cytokines they secrete. Future studies employing conditional knockout models or pharmacological inhibitors of lactylation in FIL animal models could strengthen translational relevance. Additionally, the interplay between H3K18la and other histone modifications (e.g., acetylation, methylation) in regulating osteogenic programs remains unexplored [ 30 In conclusion, our study elucidates the critical role of histone lactylation, particularly H3K18la, in the pathogenesis of FIL. The findings highlight the complex interplay between metabolic reprogramming and epigenetic modifications in driving disease progression. Future research should focus on further characterizing the molecular mechanisms underlying this process and exploring the potential therapeutic applications of targeting histone lactylation and the H3K18la-HK2 feedback loop. Additionally, the identification of upstream regulators and downstream effectors of H3K18la in FIL-ASPCs may provide additional targets for intervention. Given the limited treatment options currently available for FIL, our study offers new avenues for developing targeted therapies to improve the quality of life for affected patients (Figure S4). Supplementary Information  Supplementary material 1. Figure S1: Characterization of primary ASPCs. A: The expression of the ASPCs surface markers CD73, CD90, and PDGFRA, the haematopoietic marker CD45 and the immune marker HLA-DR in isolated ASPCs at passage 1 was detected by flow cytometry. Figure S2: Oxamate and Nala had no effect on adipogenesis. A: The mature adipocytes with lipid droplets were visualized by Oil Red O staining on day 8 after 2-DG treatment. B: The expression of adipogenic marker genes PPAR γ, C/EBP α, and FABP4 was determined by Western blot in 2-DG treated FIL-ASPCs on day 3 of adipogenic differentiation. C: The mature adipocytes with lipid droplets were visualized by Oil Red O staining on day 8 after oxamate treatment. D: The expression of adipogenic marker genes PPAR γ, C/EBP α, and FABP4 was determined by Western blot in oxamate treated FIL-ASPCs on day 3 of adipogenic differentiation. E: The mature adipocytes with lipid droplets were visualized by Oil Red O staining on day 8 after Nala treatment. F: The expression of adipogenic marker genes PPAR γ, C/EBP α, and FABP4 was determined by Western blot in Nala treated FIL-ASPCs on day 3 of adipogenic differentiation. Full-length blots were presented in Figure S5. Figure S3: H3K18la activated the transcription of multiple genes related to osteogenesis. A: Genome browser tracks of CUT& Tag signal at the LEF1 and COL6A1 loci. B: Genome browser tracks of CUT& Tag signal at the ZBTB16 and FOXC1 loci. C: Genome browser tracks of CUT& Tag signal at the FGF18 and FBN1 loci. D: Genome browser tracks of CUT& Tag signal at the HAS2 and COL27A1 loci. Figure S4: Schematic diagram of the therapeutic strategies. Our research demonstrated that inhibiting HK2, LDH, and TGFβ1 may potentially suppress the abnormal osteogenic differentiation in FIL. Figure S5: Uncropped blot.  Supplementary material 2.  Supplementary material 3. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Hongrui Chen and Chen Hua contributed equally to this work. Acknowledgements The authors declare that artificial intelligence is not used in this study. Author contributions HC: Conceptualization, Methodology, Software, Investigation, Formal Analysis, Writing - Original Draft. CH: Data Curation, Writing - Original Draft SC: Visualization, Investigation. YQ: Resources, Supervision. XL: Software, Validation. BS: Visualization, Writing - Review & Editing. Funding This research was supported by Fundamental research program funding of Ninth People’s Hospital affiliated to Shanghai Jiao Tong university School of Medicine (JYZZ241), Top Priority Research Center of Shanghai—Plastic Surgery Research Center, Shanghai (2023ZZ02023), Treatment and mechanism of PI3K/mTOR dual-target inhibitor (WX390) on PIK3CA-related overgrowth spectrum (PROS) (No. JYHX2022004), and the Fundamental Research Funds for the Central Universities (No. YG2023ZD13). Data availability The datasets used and/or analyzed during the current study are available in NCBI’s Gene Expression Omnibus (GEO) and are accessible through GEO Series accession number GSE296002 Declarations Ethics approval and consent to participate The study was approved by the Ethics Board of Shanghai Ninth Hospital, Shanghai Jiaotong University of Medicine (SH9H-2022-T215-1). Written informed consent forms were signed by patients or patients’ parents whose facial adipose sample were collected in this study. Title of the approved project: Treatment and mechanism of Pl3K/mTOR dual-target inhibitor (WX390) on PlK3CA-related overgrowth spectrum (PROS). Date of approval: 06, October, 2022. All animal procedures were performed following protocols approved by the Institutional Animal Care and Use Committee (IACUC) of the Shanghai Jiao Tong University School of Medicine (SH9H-2022-A916-1). Title of the approved project: Etiological Research on Limb Developmental Defects and Construction of a Precision Prevention and Treatment System: Research on the Pathogenesis and Targeted Therapy of Limb Proliferative Diseases Caused by Somatic Activating Mutations. Date of approval: 11, November, 2022. Consent for publication The consent for publication was acquired from patients’ parents. All authors confirm their consent for publication. Competing interests The authors declare that they have no competing interests. References 1. Chen H Facial infiltrating lipomatosis with hemimegalencephaly and lymphatic malformations caused by nonhotspot phosphatidylinositol 3-kinase catalytic subunit alpha mutation Pediatr Dermatol 2023 40 6 1115 9 10.1111/pde.15346 37190882 Chen H, et al. Facial infiltrating lipomatosis with hemimegalencephaly and lymphatic malformations caused by nonhotspot phosphatidylinositol 3-kinase catalytic subunit alpha mutation. Pediatr Dermatol. 2023;40(6):1115–9. 37190882 10.1111/pde.15346 2. Wenger TL Alpelisib for the treatment of PIK3CA-related head and neck lymphatic malformations and overgrowth Genet Med 2022 24 11 2318 28 10.1016/j.gim.2022.07.026 36066547 PMC11091962 Wenger TL, et al. Alpelisib for the treatment of PIK3CA-related head and neck lymphatic malformations and overgrowth. Genet Med. 2022;24(11):2318–28. 36066547 10.1016/j.gim.2022.07.026 PMC11091962 3. Couto JA Somatic PIK3CA mutations are present in multiple tissues of facial infiltrating lipomatosis Pediatr Res 2017 82 5 850 4 10.1038/pr.2017.155 28665924 PMC5645230 Couto JA, et al. Somatic PIK3CA mutations are present in multiple tissues of facial infiltrating lipomatosis. Pediatr Res. 2017;82(5):850–4. 28665924 10.1038/pr.2017.155 PMC5645230 4. Hsu PP Sabatini DM Cancer cell metabolism: warburg beyond Cell 2008 134 5 703 7 10.1016/j.cell.2008.08.021 18775299 Hsu PP, Sabatini DM. Cancer cell metabolism: warburg beyond. Cell. 2008;134(5):703–7. 18775299 10.1016/j.cell.2008.08.021 5. Zhang D Metabolic regulation of gene expression by histone lactylation Nature 2019 574 7779 575 80 10.1038/s41586-019-1678-1 31645732 PMC6818755 Zhang D, et al. Metabolic regulation of gene expression by histone lactylation. Nature. 2019;574(7779):575–80. 31645732 10.1038/s41586-019-1678-1 PMC6818755 6. Liu X Lactylation, an emerging hallmark of metabolic reprogramming: current progress and open challenges Front Cell Dev Biol 2022 10 972020 10.3389/fcell.2022.972020 36092712 PMC9462419 Liu X, et al. Lactylation, an emerging hallmark of metabolic reprogramming: current progress and open challenges. Front Cell Dev Biol. 2022;10:972020. 36092712 10.3389/fcell.2022.972020 PMC9462419 7. Wang RR Histone lactylation-induced premature senescence contributes to 1-nitropyrene-induced chronic obstructive pulmonary disease Redox Biol 2025 84 103703 10.1016/j.redox.2025.103703 40449094 PMC12164224 Wang RR, et al. Histone lactylation-induced premature senescence contributes to 1-nitropyrene-induced chronic obstructive pulmonary disease. Redox Biol. 2025;84:103703. 40449094 10.1016/j.redox.2025.103703 PMC12164224 8. Ge X Metabolic reprogramming through histone lactylation in microglia and macrophages recruits CD8(+) T lymphocytes and aggravates spinal cord injury Neuron 2025 10.1016/j.neuron.2025.04.003 40328251 Ge X, et al. Metabolic reprogramming through histone lactylation in microglia and macrophages recruits CD8(+) T lymphocytes and aggravates spinal cord injury. Neuron. 2025. 10.1016/j.neuron.2025.04.003. 40328251 10.1016/j.neuron.2025.04.003 9. Yang B Recapitulating hypoxic metabolism in cartilaginous organoids via adaptive cell-matrix interactions enhances histone lactylation and cartilage regeneration Nat Commun 2025 16 1 2711 10.1038/s41467-025-57779-6 40108220 PMC11923171 Yang B, et al. Recapitulating hypoxic metabolism in cartilaginous organoids via adaptive cell-matrix interactions enhances histone lactylation and cartilage regeneration. Nat Commun. 2025;16(1):2711. 40108220 10.1038/s41467-025-57779-6 PMC11923171 10. Ladraa S PIK3CA Sci Adv 2022 8 49 eade7823 10.1126/sciadv.ade7823 36490341 PMC9733923 Ladraa S, et al. PIK3CA 36490341 10.1126/sciadv.ade7823 PMC9733923 11. Chen H Single-cell sequencing of facial adipose tissue unveils FKBP5 as a therapeutic target for facial infiltrating lipomatosis Stem Cell Res Ther 2024 15 1 209 10.1186/s13287-024-03835-9 39020442 PMC11256636 Chen H, et al. Single-cell sequencing of facial adipose tissue unveils FKBP5 as a therapeutic target for facial infiltrating lipomatosis. Stem Cell Res Ther. 2024;15(1):209. 39020442 10.1186/s13287-024-03835-9 PMC11256636 12. Pajak B 2-deoxy-d-glucose and its analogs: from diagnostic to therapeutic agents Int J Mol Sci 2019 10.3390/ijms21010234 31905745 PMC6982256 Pajak B, et al. 2-deoxy-d-glucose and its analogs: from diagnostic to therapeutic agents. Int J Mol Sci. 2019. 10.3390/ijms21010234. 31905745 10.3390/ijms21010234 PMC6982256 13. Wu J Endothelial cell-derived lactate triggers bone mesenchymal stem cell histone lactylation to attenuate osteoporosis Adv Sci 2023 10 31 e2301300 10.1002/advs.202301300 PMC10625121 37752768 Wu J, et al. Endothelial cell-derived lactate triggers bone mesenchymal stem cell histone lactylation to attenuate osteoporosis. Adv Sci. 2023;10(31):e2301300. 10.1002/advs.202301300 PMC10625121 37752768 14. Nian F LDHA promotes osteoblast differentiation through histone lactylation Biochem Biophys Res Commun 2022 615 31 5 10.1016/j.bbrc.2022.05.028 35605402 Nian F, et al. LDHA promotes osteoblast differentiation through histone lactylation. Biochem Biophys Res Commun. 2022;615:31–5. 35605402 10.1016/j.bbrc.2022.05.028 15. Deng Y COX-2 promotes the osteogenic potential of BMP9 through TGF-beta1/p38 signaling in mesenchymal stem cells Aging 2021 13 8 11336 51 10.18632/aging.202825 33833129 PMC8109063 Deng Y, et al. COX-2 promotes the osteogenic potential of BMP9 through TGF-beta1/p38 signaling in mesenchymal stem cells. Aging. 2021;13(8):11336–51. 33833129 10.18632/aging.202825 PMC8109063 16. Xie N Glycolytic reprogramming in myofibroblast differentiation and lung fibrosis Am J Respir Crit Care Med 2015 192 12 1462 74 10.1164/rccm.201504-0780OC 26284610 PMC4731722 Xie N, et al. Glycolytic reprogramming in myofibroblast differentiation and lung fibrosis. Am J Respir Crit Care Med. 2015;192(12):1462–74. 26284610 10.1164/rccm.201504-0780OC PMC4731722 17. Lin X Augmentation of scleral Glycolysis promotes myopia through histone lactylation Cell Metab 2024 36 3 511 e5257 10.1016/j.cmet.2023.12.023 38232735 Lin X, et al. Augmentation of scleral Glycolysis promotes myopia through histone lactylation. Cell Metab. 2024;36(3):511–e5257. 38232735 10.1016/j.cmet.2023.12.023 18. Wu Y Lactate promotes H3K18 lactylation in human neuroectoderm differentiation Cell Mol Life Sci 2024 81 1 459 10.1007/s00018-024-05510-x 39562370 PMC11576721 Wu Y, et al. Lactate promotes H3K18 lactylation in human neuroectoderm differentiation. Cell Mol Life Sci. 2024;81(1):459. 39562370 10.1007/s00018-024-05510-x PMC11576721 19. Ge S Ultraviolet-treated riboflavin alleviates atopic dermatitis by inhibiting NLRP3 inflammasome activation and M1 macrophage polarization via histone lactylation Biochem Pharmacol 2025 236 116879 10.1016/j.bcp.2025.116879 40118287 Ge S, et al. Ultraviolet-treated riboflavin alleviates atopic dermatitis by inhibiting NLRP3 inflammasome activation and M1 macrophage polarization via histone lactylation. Biochem Pharmacol. 2025;236:116879. 40118287 10.1016/j.bcp.2025.116879 20. Minami E Lactate-induced histone lactylation by p300 promotes osteoblast differentiation PLoS ONE 2023 18 12 e0293676 10.1371/journal.pone.0293676 38051708 PMC10697613 Minami E, et al. Lactate-induced histone lactylation by p300 promotes osteoblast differentiation. PLoS ONE. 2023;18(12):e0293676. 38051708 10.1371/journal.pone.0293676 PMC10697613 21. Wang Z NEAT1 regulates BMSCs aging through disruption of FGF2 nuclear transport Stem Cell Res Ther 2025 16 1 30 10.1186/s13287-025-04156-1 39876006 PMC11776329 Wang Z, et al. NEAT1 regulates BMSCs aging through disruption of FGF2 nuclear transport. Stem Cell Res Ther. 2025;16(1):30. 39876006 10.1186/s13287-025-04156-1 PMC11776329 22. Madsen RR Vanhaesebroeck B Semple RK Cancer-associated PIK3CA mutations in overgrowth disorders Trends Mol Med 2018 24 10 856 70 10.1016/j.molmed.2018.08.003 30197175 PMC6185869 Madsen RR, Vanhaesebroeck B, Semple RK. Cancer-associated PIK3CA mutations in overgrowth disorders. Trends Mol Med. 2018;24(10):856–70. 30197175 10.1016/j.molmed.2018.08.003 PMC6185869 23. Ytteborg E Precursor cells from Atlantic salmon ( Salmo salar Biol Open 2015 4 7 783 91 10.1242/bio.201411338 25948755 PMC4571100 Ytteborg E, et al. Precursor cells from Atlantic salmon ( Salmo salar 25948755 10.1242/bio.201411338 PMC4571100 24. Najman SJ Ectopic osteogenic capacity of freshly isolated adipose-derived stromal vascular fraction cells supported with platelet-rich plasma: a simulation of intraoperative procedure J Craniomaxillofac Surg 2016 44 10 1750 60 10.1016/j.jcms.2016.08.011 27624644 Najman SJ, et al. Ectopic osteogenic capacity of freshly isolated adipose-derived stromal vascular fraction cells supported with platelet-rich plasma: a simulation of intraoperative procedure. J Craniomaxillofac Surg. 2016;44(10):1750–60. 27624644 10.1016/j.jcms.2016.08.011 25. Humphries TLR Metabolite pathway alterations identified by magnetic resonance metabolomics in a proximal tubular epithelial cell line treated with TGF-beta1 Physiol Rep 2025 13 4 e70249 10.14814/phy2.70249 39957082 PMC11830627 Humphries TLR, et al. Metabolite pathway alterations identified by magnetic resonance metabolomics in a proximal tubular epithelial cell line treated with TGF-beta1. Physiol Rep. 2025;13(4):e70249. 39957082 10.14814/phy2.70249 PMC11830627 26. Huang T Focal adhesion kinase promotes aerobic glycolysis in hepatic stellate cells via the Cyclin D1/c-Myc/MCT-1 pathway to induce liver fibrosis Sci Rep 2025 15 1 4552 10.1038/s41598-025-88538-8 39915293 PMC11802747 Huang T, et al. Focal adhesion kinase promotes aerobic glycolysis in hepatic stellate cells via the Cyclin D1/c-Myc/MCT-1 pathway to induce liver fibrosis. Sci Rep. 2025;15(1):4552. 39915293 10.1038/s41598-025-88538-8 PMC11802747 27. Wan W TGF-beta1 promotes osteogenesis of mesenchymal stem cells via integrin mediated mechanical positive autoregulation iScience 2024 27 7 110262 10.1016/j.isci.2024.110262 39021801 PMC11253692 Wan W, et al. TGF-beta1 promotes osteogenesis of mesenchymal stem cells via integrin mediated mechanical positive autoregulation. iScience. 2024;27(7):110262. 39021801 10.1016/j.isci.2024.110262 PMC11253692 28. Pan RY Positive feedback regulation of microglial glucose metabolism by histone H4 lysine 12 lactylation in alzheimer’s disease Cell Metab 2022 34 4 634 e6486 10.1016/j.cmet.2022.02.013 35303422 Pan RY, et al. Positive feedback regulation of microglial glucose metabolism by histone H4 lysine 12 lactylation in alzheimer’s disease. Cell Metab. 2022;34(4):634–e6486. 35303422 10.1016/j.cmet.2022.02.013 29. Fan W A feedback loop driven by H3K9 lactylation and HDAC2 in endothelial cells regulates VEGF-induced angiogenesis Genome Biol 2024 25 1 165 10.1186/s13059-024-03308-5 38918851 PMC11197246 Fan W, et al. A feedback loop driven by H3K9 lactylation and HDAC2 in endothelial cells regulates VEGF-induced angiogenesis. Genome Biol. 2024;25(1):165. 38918851 10.1186/s13059-024-03308-5 PMC11197246 30. Chen X Metabolism-epigenetic interaction-based bone and dental regeneration: from impacts and mechanisms to treatment potential Bone 2025 192 117382 10.1016/j.bone.2024.117382 39730093 Chen X, et al. Metabolism-epigenetic interaction-based bone and dental regeneration: from impacts and mechanisms to treatment potential. Bone. 2025;192:117382. 39730093 10.1016/j.bone.2024.117382 ",
  "metadata": {
    "Title of this paper": "Metabolism-epigenetic interaction-based bone and dental regeneration: from impacts and mechanisms to treatment potential",
    "Journal it was published in:": "Stem Cell Research & Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486737/"
  }
}