{
  "title": "Paper_471",
  "abstract": "pmc Front Med (Lausanne) Front Med (Lausanne) 2657 frontmedicine Front. Med. Frontiers in Medicine 2296-858X Frontiers Media SA PMC12479402 PMC12479402.1 12479402 12479402 41035873 10.3389/fmed.2025.1615100 1 Medicine Review Symptom clusters in inflammatory bowel disease: a scoping review Xu Keying  1 Li Mengjiao  1 Jiang Ping  1  2  * 1 Graduate School, Shanghai University of Traditional Chinese Medicine Shanghai China 2 Pudong New Area People's Hospital Shanghai China Edited by: Maria Gazouli, National and Kapodistrian University of Athens, Greece Reviewed by: Giorgos Bamias, National and Kapodistrian University of Athens, Greece Peter Rimmer, University of Birmingham, United Kingdom *Correspondence: Ping Jiang jiangping@shpdph.com 16 9 2025 2025 12 480650 1615100 20 4 2025 29 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Xu, Li and Jiang. 2025 Xu, Li and Jiang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Inflammatory bowel disease (IBD) is a chronic relapsing gastrointestinal disorder with a high symptom burden. Patients often report multiple concurrent symptoms, yet most studies have examined them individually. Symptom clusters—defined as groups of co-occurring and interrelated symptoms—provide a framework for understanding this complexity. Evidence on IBD-specific clusters, however, remains fragmented and inconsistent. Methods We conducted a scoping review following Arksey and O'Malley's framework to synthesize findings on IBD symptom cluster types, assessment instruments, associated factors, and dynamic trajectories. Searches covered database inception through 31 October 2024. Results Thirteen studies were included, identifying 29 symptom clusters. Marked heterogeneity and overlap were observed. To integrate findings, clusters were categorized into five groups: gastrointestinal/physical, psychological, systemic/fatigue, nutritional/appetite-related, and mixed/trajectory-related. Assessment instruments varied considerably, most lacking IBD-specific validation. Reported associated factors included demographic, clinical, and treatment variables, but results were inconsistent. Few studies addressed longitudinal changes or interactions among clusters. Conclusion Research on IBD symptom clusters remains limited and heterogeneous. Standardized definitions and validated tools are urgently needed. Most existing studies did not stratify findings by disease subtype, although limited evidence indicates that UC and CD appear to exhibit distinct clustering patterns. Future studies should adopt longitudinal and biomarker-informed designs, and examine interactions among clusters, to improve clinical management and patient outcomes. inflammatory bowel disease symptom cluster symptom distress assessment tool scoping review The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Gastroenterology Introduction Inflammatory bowel disease (IBD) encompasses ulcerative colitis (UC) and Crohn's disease (CD). It is a chronic and relapsing inflammatory condition of the gastrointestinal tract ( 1 2 4 5 6 7 8 12 Patients with IBD frequently experience multiple concurrent symptoms, with nearly three-quarters reporting two or more at the same time ( 13 14 15 16 17 18 20 However, current research on IBD symptom clusters remains limited and heterogeneous. The classification of clusters and the instruments used to measure them vary widely, with no consensus across studies. To address this gap, we conducted a scoping review following the methodological framework proposed by Arksey and O'Malley ( 21 Method Protocol To ensure the study's transparency and reproducibility, the methodological framework described by Arksey and O'Malley was used to conduct the scoping review. This framework includes defining the research question, identifying relevant studies, study selection, graphing the data, and collating, summarizing, and reporting the results. Reporting followed the PRISMA-ScR checklist. Research question Define the research questions for the scoping review: (1) What are the types of symptom clusters in patients with IBD? (2) What assessment tools are for symptom clusters in patients with IBD? (3) What factors are associated with symptom clusters in patients with IBD? (4) Do symptom clusters change dynamically in patients with IBD? Identifying relevant studies Information sources The databases examined comprised Web of Science, PubMed, Cochrane Library, EMBASE, CINAHL, CNKI, Wanfang Data, VIP Database, and SinoMed. The most recent search date was 31 October 2024. Search strategy The nine databases were searched using a combination of Medical Subject Headings (MeSH) and free words. The keywords searched were “Inflammatory Bowel Diseases”, “inflammatory bowel disease”, “bowel diseases inflammatory”, “Crohn's disease”, “ulcerative colitis”, “syndrome”, “symptom cluster”, “symptom combination”, “multiple symptoms”, “symptom constellation”, “concurrent symptom”. The research team began with an initial search in PubMed and CNKI to refine their approach. After carefully reviewing and assessing the results, they optimized their strategy before conducting the formal search. Study selection Inclusion and exclusion criteria Inclusion criteria: (1) the study was conducted in patients with IBD, aged ≥18 years; (2) the study involved symptom clusters or correlations between multiple symptoms; (3) there was no restriction on the type of study design, including quantitative, qualitative, and mixed studies; and exclusion criteria were: (1) duplicate publications or unavailability of the full text; (2) non-Chinese and English literature; (3) reviews, guidelines, conference papers, and opinions. Screening process The extracted article titles were imported into the Endnote program to eliminate duplication. Two researchers independently evaluated the titles and abstracts based on the inclusion and exclusion criteria. The articles that satisfied the inclusion criteria were imported with their full-text attachments for thorough examination. Charting the data Two researchers independently extracted data and information and cross-checked their findings. A third reviewer resolved disagreements. The extracted data included the following: developer, publication year, country, study design, subjects, sample size, analytical methods, assessment tools, number of symptom clusters, and type of symptom clusters. Results Study characteristics The initialsearch retrieved a total of 2,256 articles from the following databases. Two independent reviewers screened these articles and reached consistent results based on the predefined inclusion and exclusion criteria, ultimately including 13 articles (see Figure 1 18 22 33 Figure 1 Flow chart of literature selection. Figure shows the PRISMA flow diagram of the literature search and study selection process. A total of 2,256 records were identified from multiple databases including Web of Science, PubMed, Cochrane Library, EMBASE, CINAHL, CNKI, Wanfang Data, VIP, and SinoMed. After removal of 480 duplicate records, 1,776 records were screened. Of these, 1,720 were excluded and 56 reports were sought for retrieval. All 56 reports were assessed for eligibility, and 43 were excluded due to inconsistency of study subjects, research content, review articles, or meeting abstracts. Finally, 13 studies were included in the review. All included articles were published within the past 8 years, reflecting the growing attention and importance given to symptom clusters by researchers (see Table 1 n 22 24 26 28 32 33 n 18 23 29 n 31 n 27 n 30 18 23 33 22 18 24 26 28 31 32 22 23 27 29 30 33 Table 1 Characteristic information of literature.  References  Country  Study design  Subjects  Sample  Analytical Conley et al. ( 18 USA Cross-sectional study IBD 5,296 Latent class analysis Conley et al. ( 23 USA Longitudinal study IBD 5,296 Latent class analysis Perler et al. ( 29 USA Longitudinal study IBD 233 Principal component analysis Sexton et al. ( 31 Canada Cross-sectional study IBD 267 Exploratory factor analysis Gu et al. ( 25 China Cross-sectional study IBD 148 Exploratory factor analysis Gu ( 24 China Cross-sectional study IBD 207 Descriptive analysis Guan et al. ( 26 China Cross-sectional study UC 120 Exploratory factor analysis Xu et al. ( 32 China Cross-sectional study IBD 83 Descriptive analysis Liu et al. ( 28 China Cross-sectional study IBD 270 Descriptive analysis Chen ( 22 China Longitudinal qualitative study CD 18 Semi-structured interview Johansen et al. ( 27 Norway Longitudinal study IBD 350 Principal component analysis Riggot et al. ( 30 UK Longitudinal study IBD 692 Latent class analysis Zhijia et al. ( 33 China Longitudinal study IBD 206 Descriptive analysis The types and characteristics of symptom clusters A total of 29 symptom clusters were identified across the 13 included studies, as detailed in Table 2 Table 2 The types of symptom clusters.  References  Number  Type of symptom clusters Conley et al. ( 18 4 Low symptom burden, high symptom burden, physical symptom cluster, psychological symptom cluster Conley et al. ( 23 4 Low symptom burden, high symptom burden, physical symptom cluster, psychological symptom cluster Perler et al. ( 29 4 Bowel frequency and abdominal discomfort symptom cluster, systemic/extraintesinal symptom cluster, anorectal symptom cluster, abdominal symptom cluster, incontinence and flatulence symptom cluster Sexton et al. ( 31 5 Bowel symptom cluster, abdominal symptom cluster, fatigue symptom cluster, bowel complications symptom cluster, systemic complications symptom cluster Gu et al. ( 25 5 Abdominal symptom cluster, bowel complications symptom cluster, nutritional symptom cluster, physical symptom cluster, psychological symptom cluster Gu ( 24 5 Abdominal symptom cluster, bowel complications symptom cluster, nutritional symptom cluster, physical symptom cluster, psychological symptom cluster Guan et al. ( 26 2 Intestinal function related sympot cluster, negative state symptom cluster Xu et al. ( 32 5 Abdominal symptom cluster, bowel complications symptom cluster, nutritional symptom cluster, physical symptom cluster, psychological symptom cluster Liu et al. ( 28 5 Abdominal symptom cluster, bowel complications symptom cluster, nutritional symptom cluster, physical symptom cluster, psychological symptom cluster Chen ( 22 6 Mouth ulcers–loss of appetite–weight loss, abdominal pain–sleep disorders–fatigue–loss of appetite–weight loss, abdominal pain–urgency of stool–diarrhea–perianal pain–fatigue, bloating–abdominal pain–nausea–vomiting, abdominal pain–anxiety–diarrhea, anxiety–depression–fear–despair–sleep disorders Johansen et al. ( 27 3 Psychological symptom cluster, impaired energy cluster cluster, physical symptom cluster Riggott et al. ( 30 3 Below- average gastrointestinal and psychological symptoms, average levels of gastrointestinal and psychological symptoms, the highest levels of both gastrointestinal and psychological symptoms Zhijia et al. ( 33 3 Moderate symptom cluster stable decline group, high symptom cluster-rapid decline group, stable symptom cluster-stable trend group Given this overlap and inconsistency, we further synthesized the reported clusters into five broader categories to facilitate interpretation: gastrointestinal/physical, psychological, systemic/fatigue, nutritional/appetite-related, and mixed/trajectory-related. Representative terms used in the original studies for each category are summarized in Table 3 Table 3 Core symptom cluster categories and representative terms in IBD.  Core symptom cluster  Number of studies  Representative terms used Gastrointestinal/Physical 11 Physical symptom cluster; Abdominal symptom cluster; Bowel symptom cluster; Bowel frequency & abdominal discomfort symptom cluster; Anorectal symptom cluster; Incontinence & flatulence symptom cluster; Bowel complications symptom cluster; Intestinal function–related symptom cluster; Bloating–abdominal pain–nausea–vomiting. Psychological 9 Psychological symptom cluster; Negative state symptom cluster; Systemic/fatigue 4 Fatigue symptom cluster; Systemic complications symptom cluster; Impaired energy cluster. Nutritional/appetite-related 5 Nutritional symptom cluster; Mouth ulcers–loss of appetite–weight loss; Systemic/extraintestinal symptom cluster (incl. appetite loss). Mixed/trajectory-related 5 Low symptom burden; High symptom burden; Combined gastrointestinal & psychological clusters (below-average/average/high levels); Stable–stable trend/Moderate–stable decline/High–rapid decline groups; Abdominal pain–anxiety–diarrhea; Abdominal pain–urgency of stool–diarrhea–perianal pain–fatigue; Abdominal pain–sleep disorders–fatigue–loss of appetite–weight loss. Assessment tools for symptom clusters This study included 13 papers, which utilized a diverse range of assessment tools. Seven primary assessment tools were employed: PROMIS, symptom inventory, IBDSI, SCS-IBD, psychological and gastrointestinal symptom measures, UC symptom scale, and MSAS (see Table 4 n 24 25 28 32 33 18 23 31 29 30 22 27 Table 4 The information of assessment tools.  Assessment tools  Number of studies  Studies PROMIS a 2 ( 18 23 Symptom inventory 1 ( 29 IBDSI b 1 ( 31 SCS-IBD c 5 ( 24 25 28 32 33 Psychological and gastrointestinal symptom measures 1 ( 30 UC symptom scale 1 ( 26 MSAS d 1 ( 27 a Patient Reported Outcome Measurement Information System; b Inflammatory Bowel Disease of Symptom Index; c Symptom Cluster Scale for Inflammatory Bowel Disease; d Memorial Symptom Assessment Scale. Factors associated with symptom clusters in IBD Seven studies identified demographic, clinical, psychological, and biological factors associated with symptom clusters in IBD (see Table 5 Table 5 Variables and outcomes associated with symptom clusters in IBD.  Category  Variable  Association  Symptom cluster (s)  Outcome (if reported)  References Demographic factors Female Associated with increased risk High-burden; Psychological NR ( 18 Younger age Associated with increased risk High-burden NR ( 18 Older age Associated with increased risk GI cluster; Psychological (mixed) Higher flare rate; Increased hospitalization ( 30 Lifestyle factors Smoking Associated with increased risk High-burden; Psychological NR ( 18 Clinical status Remission Associated with decreased risk All clusters NR ( 18 Transition active → remission Predicted transition from high-burden to low-burden/psychological Low-burden; Psychological NR ( 23 Disease severity Associated with increased risk GI cluster Associated with higher disease activity and lower QoL ( 26 Disease subtype (UC) Associated with increased risk GI cluster; Psychological (mixed) Higher flare rate; Increased hospitalization; Lower QoL ( 26 30 Low hemoglobin Associated with increased risk GI cluster Lower QoL ( 26 Vitamin D deficiency Associated with increased risk Fatigue cluster NR ( 27 Treatment-related factors Corticosteroid use Associated with increased risk High-burden; GI; Psychological (mixed) Increased hospitalization ( 18 30 Psychological/psychosocial factors Anxiety Associated with increased risk Psychological cluster Lower QoL ( 26 Depression Associated with increased risk Psychological cluster Lower QoL ( 26 Maladaptive coping style Associated with increased risk Psychological cluster Reduced QoL ( 28 Low QoL domains (social, emotional) Associated with increased risk Psychological cluster Reduced QoL ( 28 Illness perception and emotional appraisal Associated with symptom cluster trajectories Psychological/mixed clusters NR ( 33 NR, Not reported by study authors; QoL, Quality of Life. Characteristics of symptom cluster changes Acute phase During the acute phase of IBD, particularly at the initial onset, patients often experience a sudden and intense manifestation of symptoms, which is associated with a strong inflammatory response at this stage. Symptom clusters tend to be more pronounced during this period. A longitudinal study ( 23 27 31 Remission phase In the remission phase of IBD, patients' clinical symptoms exhibit a characteristic shift, and symptom clusters become more stable. Research has shown that although abdominal and intestinal symptoms are often effectively managed during this stage, psychological symptoms tend to persist. This shift in symptom pattern suggests that the remission of physiological symptoms in IBD does not necessarily coincide with the resolution of psychological symptoms. Overall, as the disease enters remission, the symptom burden generally decreases, with notable improvements in systemic, abdominal, and intestinal symptom clusters. It is important to note, however, that some patients experience a transformation in symptom cluster types—from those dominated by systemic symptoms to those characterized mainly by psychological symptoms. A study by Conley et al. ( 23 Discussion This scoping review systematically synthesizes evidence from 13 studies on symptom cluster types, assessment instruments, associated factors, and the dynamic trajectories of symptom clusters in patients with inflammatory bowel disease (IBD). The findings provide a comprehensive framework to guide future research directions and inform clinical management strategies. Symptom cluster types and nomenclature Our review revealed substantial inconsistencies in the naming and composition of symptom clusters in inflammatory bowel disease (IBD). Two main approaches were identified: some studies defined clusters descriptively by symptom type (e.g., abdominal or psychological clusters), whereas others labeled them by dominant symptoms (e.g., anxiety–depression–sleep disturbance). Disagreement was most apparent for symptoms with lower factor loadings, which were variably classified across studies. Fatigue illustrates this challenge ( 34 18 27 24 To synthesize existing findings, we propose five provisional cluster categories: (1) gastrointestinal/physical, (2) psychological, (3) systemic/fatigue, (4) nutritional/appetite-related, and (5) mixed/trajectory-related. This framework integrates diverse nomenclature into a coherent structure while acknowledging areas of overlap and divergence. Gastrointestinal/physical clusters were consistently observed, but their composition varied, ranging from abdominal pain and diarrhea to anorectal complications and extraintestinal manifestations. Psychological clusters almost universally included anxiety, depression, and sleep disturbance, though fatigue was inconsistently classified. The systemic/fatigue cluster showed the greatest heterogeneity: Perler et al. ( 29 24 35 Overall, our review shows considerable inconsistency in the naming and composition of IBD symptom clusters, which largely reflects limited exploration of the underlying mechanisms. This lack of clarity may affect how researchers classify symptoms into clusters and interpret their significance. Future studies should therefore aim to clarify the core constructs of symptom clusters, investigate their biological and psychosocial mechanisms, and use longitudinal and multicenter designs to test their stability across populations. In parallel, standardized analytic approaches are needed to improve reproducibility and enable consistent identification of cluster categories across studies. Assessment tools for IBD symptom clusters: strengths and limitations In studies of symptom clusters among patients with inflammatory bowel disease (IBD), both single- and multi-symptom assessment tools have been applied. Single-symptom instruments facilitate focused measurement but risk overlooking interactions between co-occurring symptoms. In contrast, multidimensional tools such as the MSAS and PROMIS can capture symptom trajectories, but they often lack IBD-specific sensitivity. Among the 13 studies reviewed, seven instruments were identified, with the SCS-IBD and PROMIS most frequently applied. The SCS-IBD, validated primarily in Chinese cohorts, provides reliable multidimensional assessment of symptom frequency, severity, and distress ( 24 36 37 38 39 40 31 41 29 30 Taken together, existing tools provide valuable insights but face persistent challenges, including limited disease specificity, reliance on subjective reporting, and uncertain applicability across disease phases. Future research should therefore prioritize: (i) developing IBD-specific, multidimensional, and clinically feasible instruments; (ii) establishing dynamic evaluation systems integrating patient-reported outcomes with objective markers such as endoscopy and fecal calprotectin; and (iii) clarifying optimal assessment intervals and validating tool performance across both active and remission phases. Addressing these issues will support the development of a more comprehensive and standardized framework for IBD symptom cluster assessment, thereby enhancing clinical decision-making, treatment evaluation, and the comparability of research findings across studies. Associated factors of symptom clusters in IBD Across the included studies, a range of demographic, clinical, and treatment-related variables were found to influence symptom cluster membership. High-burden and psychological clusters were more common among women, younger patients, and smokers ( 18 26 27 26 28 18 30 23 30 29 26 42 In summary, the available evidence indicates that symptom cluster membership in IBD is determined by a multifactorial interplay of demographic, clinical, psychological, treatment-related, and disease-specific variables. Preliminary evidence also suggests that gastrointestinal clusters appear to be more prominent in UC, whereas systemic, nutritional, and psychological manifestations may be more characteristic of CD, with disease extent or location potentially modifying these patterns. Future research should explicitly stratify findings by disease subtype and extent, and employ longitudinal, biomarker-integrated, and multicenter designs to clarify these determinants and their clinical implications. Management strategies for dynamic changes of symptom clusters in IBD Findings from six longitudinal studies included in this review indicate that symptom clusters in IBD patients are not static but instead evolve dynamically with disease progression. Therefore, individualized management strategies tailored to different disease stages are essential to enhance the scientific basis and effectiveness of interventions. (1) Acute Phase: Management should focus on controlling inflammation and alleviating physical symptoms. During acute IBD flare-ups, symptom burden increases significantly ( 43 29 44 45 47 23 33 48 49 This review has several strengths, including its comprehensive scope and synthesis of findings across diverse study designs. Nonetheless, some limitations should be acknowledged. First, the search was restricted to English and Chinese publications and excluded gray literature, which may have introduced selection bias. Second, substantial heterogeneity in study populations, assessment instruments, and analytic methods limited comparability, and most tools were not specifically validated for IBD, raising concerns about measurement validity. Third, the majority of included studies were cross-sectional and rarely incorporated objective biomarkers, making it difficult to examine causal relationships, cluster–cluster interactions, or links with biological disease activity. Finally, few studies stratified findings by disease subtype, which limits conclusions about potential differences between UC and CD. As a scoping review, no formal quality appraisal or meta-analysis was undertaken, precluding causal inference or quantitative effect estimation. These limitations highlight the need for longitudinal, biomarker-integrated, and methodologically standardized research to advance the science of symptom clusters in IBD. Conclusion In summary, this scoping review synthesized evidence from 13 studies and identified five core symptom clusters in patients with inflammatory bowel disease (IBD): gastrointestinal, psychological, fatigue, impaired energy, and pain. These clusters were associated with demographic, clinical, psychological, and lifestyle factors, and in some cases linked to adverse outcomes such as poorer quality of life, increased disease activity, and greater healthcare utilization. However, existing studies relied on heterogeneous and non-IBD–specific instruments, and few assessed longitudinal trajectories, biological correlates, or interactions between clusters. Importantly, most did not stratify by disease subtype, although limited evidence suggests that UC appears to be characterized primarily by gastrointestinal clusters, whereas CD more often involves systemic, nutritional, or psychological clusters. Advancing this field will require biomarker-integrated, methodologically standardized, and longitudinal research to clarify the mechanisms of symptom clustering and inform tailored interventions. Ultimately, a better understanding of symptom clusters may help clinicians provide more precise symptom management and improve patient-centered outcomes in IBD. Author contributions KX: Writing – review & editing, Methodology, Writing – original draft, Investigation, Software, Data curation, Conceptualization. ML: Data curation, Methodology, Conceptualization, Supervision, Software, Investigation, Writing – original draft. PJ: Supervision, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Lamb CA Kennedy NA Raine T Hendy PA Smith PJ Limdi JK British Society of Gastroenterology consensus guidelines on the management of inflammatory bowel disease in adults Gut. 2019 68 s1 s106 10.1136/gutjnl-2019-318484 31562236 PMC6872448 2. Agrawal M Allin KH Petralia F Colombel J Jess T Multiomics to elucidate inflammatory bowel disease risk factors and pathways Nat Rev Gastroenterol Hepatol. 2022 19 399 409 10.1038/s41575-022-00593-y 35301463 PMC9214275 3. Singh N Bernstein CN Environmental risk factors for inflammatory bowel disease United Eur Gastroenterol J. 2022 10 1047 53 10.1002/ueg2.12319 36262056 PMC9752273 4. Wan J Zhou J Wang Z Liu D Zhang H Xie S Epidemiology, pathogenesis, diagnosis, and treatment of inflammatory bowel disease: Insights from the past two years Chinese Med J. 2025 138 763 76 10.1097/CM9.0000000000003542 39994836 PMC11970819 5. King JA Underwood FE Panaccione N Quan J Windsor JW Kotze PG Trends in hospitalisation rates for inflammatory bowel disease in western versus newly industrialised countries: a population-based study of countries in the Organisation for Economic Co-operation and Development Lancet Gastroenterol Hepatol. 2019 4 287 95 10.1016/S2468-1253(19)30013-5 30765267 6. Ng SC Shi HY Hamidi N Underwood FE Tang W Benchimol EI Worldwide incidence and prevalence of inflammatory bowel disease in the 21st century: a systematic review of population-based studies Lancet. 2017 390 2769 78 10.1016/S0140-6736(17)32448-0 29050646 7. Niriella MA Martinus CK Withanage MY Darshika S Illangasinghe M Perera HR Clinical epidemiology of inflammatory bowel disease among adults in the South Asian region: a systematic review and meta-analysis Heliyon. 2025 11 e41840 10.1016/j.heliyon.2025.e41840 39931471 PMC11808616 8. GBD The global, regional, and national burden of inflammatory bowel disease in 195 countries and territories, 1990-2017: a systematic analysis for the Global Burden of Disease Study 2017 Lancet Gastroenterol Hepatol. 2020 5 17 30 10.1016/S2468-1253(19)30333-4 31648971 PMC7026709 9. Dou Z Zheng H Shi Y Li Y Jia J Analysis of global prevalence, DALY and trends of inflammatory bowel disease and their correlations with sociodemographic index: data from 1990 to 2019 Autoimmun Rev. 2024 23 103655 10.1016/j.autrev.2024.103655 39366514 10. Li CJ Wang YK Zhang SM Ren MD He SX Global burden of inflammatory bowel disease 1990-2019: a systematic examination of the disease burden and twenty-year forecast World J Gastroenterol. 2023 29 5751 67 10.3748/wjg.v29.i42.5751 38075848 PMC10701338 11. Park J Jeong GH Song M Yon DK Lee SW Koyanagi A The global, regional, and national burden of inflammatory bowel diseases, 1990-2019: a systematic analysis for the global burden of disease study 2019 Digest Liver Dis. 2023 55 1352 9 10.1016/j.dld.2023.04.003 37137806 12. Wang S Dong Z Wan X Global, regional, and national burden of inflammatory bowel disease and its associated anemia, 1990 to 2019 and predictions to 2050: An analysis of the global burden of disease study 2019 Autoimmun Rev. 2024 23 103498 10.1016/j.autrev.2023.103498 38052263 13. Aoyama N Shimizu T Approach to the seamless management of inflammatory bowel disease, considering special situations, shared decision-making, and disease burden Digestion. 2021 102 12 7 10.1159/000511481 33238288 PMC7949202 14. Perler BK Ungaro R Baird G Mallette M Bright R Shah S Correction to: Presenting symptoms in inflammatory bowel disease: descriptive analysis of a community-based inception cohort [Published Erratum] BMC Gastroenterol. 2020 20 406 10.1186/s12876-020-01526-2 33272202 PMC7713155 15. Vernero M Saibeni S Scalvini D Cicalini C Chiarello L Nardi S Prevalence and clinical impact of immune-mediated inflammatory diseases in patients with inflammatory bowel disease: results from a large retrospective observational study J Clin Med 2024 13 1019 10.3390/jcm13041019 38398332 PMC10889244 16. Dodd M Janson S Facione N Faucett J Froelicher ES Humphreys J Advancing the science of symptom management J Adv Nurs. 2001 33 668 76 10.1046/j.1365-2648.2001.01697.x 11298204 17. Kim HJ McGuire DB Tulman L Barsevick AM Symptom clusters: concept analysis and clinical implications for cancer nursing Cancer Nurs 2005 28 283 4 10.1097/00002820-200507000-00005 16046888 18. Conley S Proctor DD Jeon S Sandler RS Redeker NS Symptom clusters in adults with inflammatory bowel disease Res Nurs Health. 2017 40 424 34 10.1002/nur.21813 28833284 PMC5597486 19. Farrell D Savage E Symptom burden in inflammatory bowel disease: rethinking conceptual and theoretical underpinnings Int J Nurs Pract. 2010 16 437 42 10.1111/j.1440-172X.2010.01867.x 20854340 20. Farrell D Savage E Symptom burden: a forgotten area of measurement in inflammatory bowel disease Int J Nurs Pract. 2012 18 497 500 10.1111/j.1440-172X.2012.02063.x 23009379 21. Arksey H O'Malley L Scoping studies: towards a methodological framework Int J Soc Res Methodol. 2005 8 19 32 10.1080/1364557032000119616 22. Chen L The symptom experience of newly diagnosed patients with Crohn's disease: a longitudinal qualitative research Zhejiang Chinese Medical University 2022 10.27465/d.cnki.gzzyc.2022.000331 23. Conley S Jeon S Proctor DD Sandler RS Redeker NS Longitudinal changes in symptom cluster membership in inflammatory bowel disease J Nurs Scholarsh. 2018 50 473 81 10.1111/jnu.12409 29971936 PMC6120775 24. Gu F Compilation and preliminary application of Symptom Cluster Scale for Inflammatory Bowel Disease Nanjing Medical University 2020 https://linkcinknet/doi/1027249/dcnkignjyu2020 25. Gu F Lin Z Shang X Bian Q Lin L Zhang H Construction and preliminary application of Symptom Cluster Scale for inflammatory bowel disease Chin J Nurs. 2020 55 1819 24 10.3761/j.issn.0254-1769.2020.12.004 26. Guan Q Cui M Mo Y Lv X Wu J Huang Z Study on symptom cluster and its influencing factors in patients with ulcerative colitis J Nurses Prof Dev. 2021 36 1926 31 10.3761/j.issn.0254-1769.2021.14.005 27. Johansen I Småstuen MC Løkkeberg ST Kristensen VA Høivik ML Lund C Symptoms and symptom clusters in patients newly diagnosed with inflammatory bowel disease: results from the IBSEN III Study BMC Gastroenterol 2023 23 47 10.1186/s12876-023-02889-y 37501083 PMC10373240 28. Liu J Yang H Mu Q Zhao Z Li J Zhang N Analysis of correlations between disease symptom clusters and quality of survival and psychological factors in patients with inflammatory bowel disease China J Gastroenterol. 2022 27 456 62 10.1007/s42976-021-00214-5 29. Perler BK Ungaro R Baird G Mallette M Bright R Shah S Presenting symptoms in inflammatory bowel disease: descriptive analysis of a community-based inception cohort BMC Gastroenterol. 2019 19 47 10.1186/s12876-019-0963-7 30940072 PMC6446285 30. Riggott C Fairbrass KM Black CJ Gracie DJ Ford AC Novel symptom clusters predict disease impact and healthcare utilisation in inflammatory bowel disease: Prospective longitudinal follow-up study Aliment Pharmacol Ther. 2023 58 1163 74 10.1111/apt.17735 37792347 31. Sexton KA Walker JR Targownik LE Graff LA Haviva C Beatie BE The inflammatory bowel disease symptom inventory: a patient-report scale for research and clinical application Inflamm Bowel Dis. 2019 25 1277 90 10.1093/ibd/izz038 30918969 PMC6635838 32. Xu Y Qin Y Li X Application value analysis of symptom cluster assessment scale in patients with inflammatory bowel disease Chin Evid Based Nurs. 2022 8 1538 41 33. Zhijia S Meijuan X Yanting Z Fang L Minyu F Ruirui C Illness perceptions as a predictor of symptom cluster trajectories in patients with inflammatory bowel disease: a latent growth mixture model Gastroenterol Nurs. 2024 47 111 21 10.1097/SGA.0000000000000793 38567854 34. Abraham BP Symptom management in inflammatory bowel disease Exp Rev Gastroenterol Hepatol. 2015 9 953 67 10.1586/17474124.2015.1038241 25905569 35. Zhu X Zhang S Wang X Zhao Y ZHen N Expert consensus on nursing care for adults with active inflammatory bowel disease J Nurs Sci. 2022 37 1 6 36. Di Y Zhu X Chen Y Wang R Zhang S Sun P Exploring the multidimensional symptom experience in patients with inflammatory bowel disease—a contemporaneous network analysis Front Med. 2025 12 1631207 10.3389/fmed.2025.1631207 40842534 PMC12364945 37. Spiegel BM Hays RD Bolus R Melmed GY Chang L Whitman C Development of the NIH Patient-Reported Outcomes Measurement Information System (PROMIS) gastrointestinal symptom scales Am. J. Gastroenterol. 2014 109 1804 14 10.1038/ajg.2014.237 25199473 PMC4285435 38. de Jong MJ Huibregtse R Masclee AAM Jonkers DMAE Pierik MJ Patient-reported outcome measures for use in clinical trials and clinical practice in inflammatory bowel diseases: a systematic review Clin Gastroenterol Hepatol. 2018 16 648 63 10.1016/j.cgh.2017.10.019 29074448 39. Gracey CR Zhang X Weisbein L Chen W Kappelman M Long M S5 understanding gastrointestinal symptoms in patients with concomitant irritable bowel syndrome and inflammatory bowel disease: a cross-sectional study from IBD partners Am J Gastroenterol 2023 118 S2 10.14309/01.ajg.0000995756.95860.25 40. Portenoy RK Thaler HT Kornblith AB Lepore JM Friedlander-Klar H Kiyasu E The Memorial Symptom Assessment Scale: an instrument for the evaluation of symptom prevalence, characteristics and distress Eur J Cancer 1994 30A 1326 36 10.1016/0959-8049(94)90182-1 7999421 41. Kulyk A Shafer LA Graff LA Stone J Witges K Targownik LE Urgency for bowel movements is a highly discriminatory symptom of active disease in persons with IBD (the Manitoba Living with IBD study) Aliment Pharmacol Ther. 2022 56 1570 80 10.1111/apt.17241 36225106 42. Rimmer P Cheesbrough J Harris J Love M Tull S Iqbal A Optimising triage of urgent referrals for suspected IBD: results from the Birmingham IBD inception study Frontline Gastroenterol 2024 15 281 90 10.1136/flgastro-2023-102523 43. Kaplan GG Windsor JW The four epidemiological stages in the global evolution of inflammatory bowel disease Nat Rev Gastroenterol Hepatol. 2021 18 56 66 10.1038/s41575-020-00360-x 33033392 PMC7542092 44. Muzammil MA Fariha F Patel T Sohail R Kumar M Khan E Advancements in inflammatory bowel disease: a narrative review of diagnostics, management, epidemiology, prevalence, patient outcomes, quality of life, and clinical presentation Cureus J Med Sci. 2023 15 e41120 10.7759/cureus.41120 37519622 PMC10382792 45. Bisgaard TH Allin KH Keefer L Ananthakrishnan AN Jess T Depression and anxiety in inflammatory bowel disease: epidemiology mechanisms and treatment Nat Rev Gastroenterol Hepatol. 2022 19 717 26 10.1038/s41575-022-00634-6 35732730 46. Hinnant L Rios VN Chen E Bacchus D Dotson J Greywoode R Consensus statement on managing anxiety and depression in individuals with inflammatory bowel disease Inflamm Bowel Dis 2024 31 1248 55 10.1093/ibd/izae151 39173019 PMC12069991 47. Hu S Chen Y Chen Y Wang C Depression and anxiety disorders in patients with inflammatory bowel disease Front Psychiatry. 2021 12 714057 10.3389/fpsyt.2021.714057 34690829 PMC8531580 48. Adedara VO Adedara CA Ruth ND Alozie GU Nettagul N Advancements in the management of pediatric and adult inflammatory bowel disease: a systematic review of treatment strategies and long-term outcomes Cureus J Med Sci. 2024 16 e72324 10.7759/cureus.72324 39583371 PMC11585480 49. Vieujean S Jairath V Peyrin-Biroulet L Dubinsky M Iacucci M Magro F Understanding the therapeutic toolkit for inflammatory bowel disease Nat Rev Gastroenterol Hepatol 2025 22 371 94 10.1038/s41575-024-01035-7 39891014 ",
  "metadata": {
    "Title of this paper": "Understanding the therapeutic toolkit for inflammatory bowel disease",
    "Journal it was published in:": "Frontiers in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479402/"
  }
}