{
  "title": "Paper_369",
  "abstract": "pmc Kidney360 Kidney360 4060 kidney360 Kidney360 Kidney360 2641-7650 American Society of Nephrology PMC12483056 PMC12483056.1 12483056 12483056 40402810 10.34067/KID.0000000837 K360-2025-000224 1 3 Basic Research Chronic Kidney Disease Indoxyl Sulfate Contributes to Selenium Deficiency and Renal Ferroptosis by Decreasing the Expression of Selenium Transport Protein Selenoprotein P Nakano Takehiro  1 https://orcid.org/0009-0007-0830-4921 Kitazato Yutaka  1 Ogawa Takumu  1 https://orcid.org/0000-0002-5086-1031 Tokumaru Kai  2 Shintani Yuhi  2 Yoshitake Takuma  1 Yasuno Kohei  1 https://orcid.org/0000-0002-0794-9468 Maeda Hitoshi  1 Tanaka Motoko  3 Matsushita Kazutaka  3 Maruyama Toru  1 Watanabe Hiroshi  2 1 2 3 Correspondence: hnabe@kumamoto-u.ac.jp 9 2025 22 5 2025 6 9 498009 1448 1461 17 2 2025 09 5 2025 22 05 2025 01 10 2025 01 10 2025 Copyright © 2025 The Author(s). Published by Wolters Kluwer Health, Inc. on behalf of the American Society of Nephrology 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) The Selenium Heist 6 9 25 9 2025 1427 1429 Kidney360 10.34067/KID.0000000930 PMC12483042 40996870 Visual Abstract Key Points  Indoxyl sulfate (IS) is involved in the liver-kidney axis by inducing renal ferroptosis by selenium deficiency due to suppression of selenoprotein P (SEPP1) expression in the liver. IS concentrations were negatively associated with selenium concentrations and SEPP1 concentrations in serum from patients on dialysis. We propose the potential therapeutic strategy targeting the IS/SEPP1/glutathione peroxidase 4 pathway for CKD. Background The relationship between the progression of CKD and trace element deficiencies has attracted considerable attention. However, many aspects of trace element deficiency and the molecular mechanisms of CKD pathology remain unclear. In this study, we hypothesized that uremic toxins are involved in trace element deficiencies, which contribute to the progression of CKD. Methods Adenine-induced CKD mice were used for in vivo in vitro Results Seventeen trace elements in plasma of CKD mice were measured using inductively coupled plasma mass spectrometry. Among these, selenium (Se) was identified as the trace element most significantly affected by the administration of oral spherical activated carbon (AST-120), an oral spherical activated carbon. CKD mice displayed reduced levels of Se in plasma, which was restored after the administration of AST-120. In vivo in vitro α α Conclusions This study highlights the key role IS plays in Se deficiency and renal ferroptosis by suppressing hepatic SEPP1 expression. The findings suggest potential therapeutic strategies that target IS and Se deficiency for the management of CKD. CKD mineral metabolism uremia Japan Society for the Promotion of Science KAKENHI JP 23K28431 Takehiro Nakano Japan Society for the Promotion of Science KAKENHI JP20H03406 Takehiro Nakano Japan Society for the Promotion of Science JST SPRING JPMJSP2127 Takehiro Nakano Japan Society for the Promotion of Science KAKENHI JP 23K28431 Japan Society for the Promotion of Science KAKENHI JP20H03406 Japan Society for the Promotion of Science JST SPRING JPMJSP2127 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE SDC T Read-along YES Introduction As renal function declines, the homeostasis of essential elements, including major and trace elements, becomes disrupted. Patients with CKD frequently develop abnormalities in mineral metabolism, such as hyperphosphatemia, hypocalcemia, and hyperkalemia, which are associated with cardiovascular complications. 1 2 3 4 8 Several mechanisms underlying Zn and magnesium deficiencies have been reported, including ( 1 2 3 4 9 14 15 1 2 3 It was hypothesized that increased plasma levels of uremic toxins in CKD affect trace element fluctuations. Initially, a comprehensive measurement of 17 trace elements in CKD mice was performed to clarify the molecular basis of trace element deficiencies associated with CKD pathology. Having identified trace elements that showed large fluctuations, we investigated the relationship between these fluctuations and uremic toxins. Finally, we evaluated a potential therapeutic strategy for CKD targeting uremic toxins and trace element deficiency using a CKD mouse model. Methods See Supplemental Methods Supplemental Table 3 Animals Institute of Cancer Research mice (male, 5 weeks old, Japan SLC, Shizuoka, Japan) were used. The animal care and use committee of Kumamoto University approved the protocols for all animal experiments (A2023-018). Trace Element Concentration Measurements Inductively coupled plasma mass spectrometry (Agilent 7900; Agilent Technologies, Santa Clara, CA) was used to measure trace element concentrations. IS Concentration Measurements High-pressure liquid chromatography (Extrema; Jasco Inc., Tokyo, Japan) was used to determine the concentration of IS in samples as described previously. 16 Se Dynamics Food intake, water consumption, feces, and urine output of mice were measured using a metabolic gauge (CL-0305/CL-0355; CLEA Japan, Inc., Tokyo, Japan) to determine the daily metabolic rate of Se. In Vitro HepG2 cells (RCB1886) were purchased from the RIKEN bioresource cell bank (Ibaraki, Japan). Primary cultured mouse hepatocytes were isolated from Institute of Cancer Research mice (male, 5 weeks old) using the collagenase perfusion method. 17 Statistical Analyses Experimental data are presented as mean±SEM. Statistical significance was assessed using Student's t P Results Effect of Oral Spherical Activated Carbon on Plasma Trace Element Variability in CKD Mice In all, 17 trace elements in plasma of adenine-induced CKD mice were measured using inductively coupled plasma mass spectrometry. To evaluate the effect of uremic toxins on changes in plasma trace element concentration, oral charcoal absorbent (oral spherical activated carbon [AST-120]), which has a lowering effect on plasma uremic toxins, was administered to CKD mice (Figure 1 Supplemental Table 1 1 1 1 1 Figure 1 Effect of AST-120 on plasma trace element levels in CKD mice. 10 P 2 μ n Next, we evaluated whether the uremic toxin IS was involved in changes in plasma Se concentration induced by AST-120 administration. The plasma concentration of IS in CKD mice was significantly suppressed after administration of AST-120 (Figure 1 2 P 1 Effect of AST-120 on a Plasma Se Transport Protein in CKD Mice Selenoprotein P (SEPP1) is a Se-containing protein produced mainly in the liver that transports Se throughout the body. 18 19 20 As shown in Figure 1 2 P 1 2 P 1 Effect of AST-120 on Hepatic SEPP1 Expression in CKD Mice Hepatic SEPP1 expression at the protein and mRNA level in CKD mice, which was lower than that in control mice, significantly recovered after administration of AST-120 (Figure 2 2 2 P 2 Figure 2 Effect of AST-120 on hepatic SEPP1 expression and renal Se content in CKD mice. n Similar studies were performed in other CKD model mice (5/6 nephrectomy [5/6Nx] model; Supplemental Figure 1A Supplemental Figure 1, B–D 2 P Supplemental Figure 1E Effect of AST-120 on Se Dynamics in CKD Mice Se from the diet is absorbed from the gastrointestinal tract 21 22 2 2 2 P 2 Supplemental Figure 1, F and G Supplemental Figure 1H 2 P Supplemental Figure 1I Effect of AST-120 on Renal Se Content in CKD Mice SEPP1 produced in the liver is reabsorbed from the luminal side of the renal tubules using megalin, located on the plasma membrane of tubular epithelial cells, to deliver Se to the kidney. 23 24 2 2 P 2 Effect of IS on SEPP1 Expression in Hepatocytes Our data indicated that IS may have the ability to decrease hepatic SEPP1 expression. To clarify, HepG2 cells were incubated with IS and SEPP1 expression evaluated. As shown in Figure 3 3 25 3 Figure 3 Effect of IS on hepatic SEPP1 expression. P n p Next, we compared the effects of seven albumin-binding uremic toxins (IS, p 3 Molecular Mechanism of IS-Induced Decrease in SEPP1 Expression HepG2 cells were used to elucidate the molecular mechanism of the IS-induced decrease in SEPP1 expression. Hepatocytes take up IS into the cell using an organic anion-transporting polypeptide (OATP). First, we evaluated the effect of IS on SEPP1 expression in HepG2 cells pretreated with three OATP inhibitors (probenecid, estrone sulfate, and rifampicin), according to a previous report. 26 Supplemental Figure 2A 4 4 4 Figure 4 Molecular mechanism of IS-induced SEPP1 suppression. μ μ μ 2 2 μ 2 2 α α n Transcription factors sterol regulatory element binding protein 1c, PGC-1 α α 27 28 α α Supplemental Figure 2, B–D α 29 α 30 α 4 4 α α IS is also reported to increase microRNA-34a-5p (miR-34a-5p) expression in vascular endothelial cells, 31 α 32 α 4 4 α α α α 4 Relationship between Serum Se and IS Concentrations in Patients on Dialysis Next, we investigated the relationship between serum Se and IS concentrations in patients on dialysis. A total of 55 patients on hemodialysis (33 male and 22 female patients) were enrolled in this study. All blood samples were collected before dialysis. The molecular weight of SEPP1 is 43.2 kDa, which means SEPP1 is not easily removed by dialysis. Our findings showed that serum IS concentrations negatively correlated with serum Se concentrations (R 2 P Supplemental Figure 3A µ µ µ 33 µ Supplemental Figure 3B 2 P 2 P 2 P Supplemental Figure 3C Inhibition of Renal Ferroptosis By Therapeutic Intervention Targeting IS/SEPP1/Glutathione Peroxidase 4 Pathway in CKD Mice Administration of AST-120 alone did not fully restore renal Se content in CKD mice (Figure 2 e.g 34 35 1 2 3 5 5 5 2 P 5 Figure 5 Therapeutic intervention targeting the IS/SEPP1 pathway in CKD mice. μ n Finally, we evaluated the renoprotective effects of AST-120 and sodium selenite combination treatment on CKD mice. Decreased renal function (increased BUN, serum creatinine, urine volume, and urinary protein and decreased creatinine clearance) in CKD mice was significantly suppressed by combination treatment as compared with AST-120 or sodium selenite alone ( Supplemental Figure 4, A–E Supplemental Figure 4F Supplemental Figure 4, G and H 6 6 6 6 6 6 6 Figure 6 Renal protection by combination of AST-120 and Se supplementation in CKD mice. μ 2/3 n Discussion Recently, the relationship between progression of CKD and onset of its complications with trace element deficiency has attracted attention. 3 We comprehensively measured 17 trace elements in plasma of CKD mice. Among these, Se was identified as the trace element most significantly affected by AST-120 administration. Indeed, AST-120 administration restored the low levels of plasma Se found in CKD mice to normal levels. Furthermore, IS decreased the expression of the Se transport protein SEPP1 in the liver. In addition, using HepG2 cells, we demonstrated that IS suppresses SEPP1 expression through increased ROS production through the OATP/AhR/NADPH oxidase pathway. Increased ROS leads to inhibition of transcription factors, such as AMPK/PGC-1 α α Trace element deficiencies have been reported in both nondialysis patients with CKD and patients on hemodialysis. Deficiencies in Fe, Zn, and Se were commonly observed. 3 36 38 Supplemental Table 2 We demonstrated that IS contributes to Se deficiency by reducing SEPP1 expression. Dietary Se is incorporated into Se-containing proteins, such as SEPP1, enabling its retention in the body. 21 22 2 5 e.g Supplemental Figure 4G 5 6 5 Supplemental Figure 4G IS exhibited a dose-dependent suppressive effect on SEPP1 expression in HepG2 cells (Figure 3 μ 39 Supplemental Figure 3, A and B Among seven albumin-binding uremic toxins (IS, p 3 40 41 40 42 4 4 4 in vivo We identified involvement of the AMPK/PGC-1 α α 4 30 43 44 45 46 47 The redox balance in renal tubules is closely regulated by the Se-containing protein GPX4. Indeed, GPX4 knockout mice develop AKI associated with tubular ferroptosis. 35 48 50 5 6 51 52 53 Supplementary Material See related editorial, “The Selenium Heist: Uremic Toxins Orchestrate Kidney Ferroptotic Stress in CKD,” on pages 1427–1429. T.N. and H.W. contributed equally to this work. Disclosures Disclosure forms, as provided by each author, are available with the online version of the article at http://links.lww.com/KN9/B75 Funding H. Watanabe: Japan Society for the Promotion of Science (KAKENHI JP23K28431 and JP20H03406), T. Nakano: Japan Society for the Promotion of Science (JST SPRING JPMJSP2127). Author Contributions Conceptualization: Data curation: Formal analysis: Investigation: Methodology: Supervision: Visualization: Writing – original draft: Writing – review & editing: Data Sharing Statement Partial restrictions to the data and/or materials apply. Data will be available upon reasonable request to the corresponding author. Supplemental Material This article contains the following supplemental material online at http://links.lww.com/KN9/B76  Supplemental Methods Supplemental Table 1 Supplemental Table 2 Supplemental Table 3 Supplemental Figure 1 Supplemental Figure 2 Supplemental Figure 3 Supplemental Figure 4  Supplemental References References 1. Reimer KC Nadal J Meiselbach H GCKD study investigators Association of mineral and bone biomarkers with adverse cardiovascular outcomes and mortality in the German Chronic Kidney Disease (GCKD) cohort Bone Res. 2023 11 1 52 10.1038/s41413-023-00291-8 37857629 PMC10587182 2. Edmonston D Wolf M FGF23 at the crossroads of phosphate, iron economy and erythropoiesis Nat Rev Nephrol. 2020 16 1 7 19 10.1038/s41581-019-0189-5 31519999 3. Tonelli M Wiebe N Bello A Alberta Kidney Disease Network Concentrations of trace elements and clinical outcomes in hemodialysis patients: a prospective cohort study Clin J Am Soc Nephrol. 2018 13 6 907 915 10.2215/CJN.11451017 29599300 PMC5989679 4. Yasukawa M Arai S Nagura M Selenium associates with response to erythropoiesis-stimulating agents in hemodialysis patients Kidney Int Rep. 2022 7 7 1565 1574 10.1016/j.ekir.2022.04.009 35812286 PMC9263417 5. Zhu D Zhong Q Lin T Song T Higher serum selenium concentration is associated with lower risk of all-cause and cardiovascular mortality among individuals with chronic kidney disease: a population-based cohort study of NHANES Front Nutr. 2023 10 1127188 10.3389/fnut.2023.1127188 37063340 PMC10102510 6. Joo YS Kim HW Lee S Dietary zinc intake and incident chronic kidney disease Clin Nutr. 2021 40 3 1039 1045 10.1016/j.clnu.2020.07.005 32753349 7. Nakatani S Mori K Shoji T Emoto M Association of zinc deficiency with development of CVD events in patients with CKD Nutrients. 2021 13 5 1680 10.3390/nu13051680 34063377 PMC8156917 8. Fujishima Y Ohsawa M Itai K Serum selenium levels are inversely associated with death risk among hemodialysis patients Nephrol Dial Transplant. 2011 26 10 3331 3338 10.1093/ndt/gfq859 21372251 9. Maruyama Y Nakashima A Fukui A Yokoo T Zinc deficiency: its prevalence and relationship to renal function in Japan Clin Exp Nephrol. 2021 25 7 771 778 10.1007/s10157-021-02046-3 33733330 10. Kimmel PL Watkins DW Teller EB Khanna R Dosa S Phillips TM Zinc balance in combined zinc deficiency and uremia Kidney Int. 1988 33 6 1091 1099 10.1038/ki.1988.116 3261369 11. Tokuyama A Kanda E Itano S Effect of zinc deficiency on chronic kidney disease progression and effect modification by hypoalbuminemia PLoS One. 2021 16 5 e0251554 10.1371/journal.pone.0251554 33974681 PMC8112700 12. Damianaki K Lourenco JM Braconnier P Renal handling of zinc in chronic kidney disease patients and the role of circulating zinc levels in renal function decline Nephrol Dial Transplant. 2020 35 7 1163 1170 10.1093/ndt/gfz065 31006015 13. Oka T Hamano T Sakaguchi Y Proteinuria-associated renal magnesium wasting leads to hypomagnesemia: a common electrolyte abnormality in chronic kidney disease Nephrol Dial Transplant. 2019 34 7 1154 1162 10.1093/ndt/gfy119 29796601 14. Bushinsky DA Spiegel DM Yuan J Warren S Fogli J Pergola PE Effects of the potassium-binding polymer patiromer on markers of mineral metabolism Clin J Am Soc Nephrol. 2019 14 1 103 110 10.2215/CJN.04500418 30381412 PMC6364526 15. Hamano H Ikeda Y Watanabe H The uremic toxin indoxyl sulfate interferes with iron metabolism by regulating hepcidin in chronic kidney disease Nephrol Dial Transplant. 2018 33 4 586 597 10.1093/ndt/gfx252 28992067 16. Watanabe K Tominari T Hirata M Indoxyl sulfate, a uremic toxin in chronic kidney disease, suppresses both bone formation and bone resorption FEBS Open Bio. 2017 7 8 1178 1185 10.1002/2211-5463.12258 PMC5536993 28781957 17. Charni-Natan M Goldstein I Protocol for primary mouse hepatocyte isolation STAR Protoc. 2020 1 2 100086 10.1016/j.xpro.2020.100086 33111119 PMC7580103 18. Saito Y Selenium transport mechanism via selenoprotein P-its physiological role and related diseases Front Nutr. 2021 8 685517 10.3389/fnut.2021.685517 34124127 PMC8193087 19. Jujic A Molvin J Schomburg L Selenoprotein P deficiency is associated with higher risk of incident heart failure Free Radic Biol Med. 2023 207 11 16 10.1016/j.freeradbiomed.2023.07.007 37423559 20. Schweizer U Wirth EK Klopstock T Seizures, ataxia and parvalbumin-expressing interneurons respond to selenium supply in Selenop-deficient mice Redox Biol. 2022 57 102490 10.1016/j.redox.2022.102490 36182809 PMC9526222 21. Thomson CD Burton CE Robinson MF On supplementing the selenium intake of New Zealanders. 1. Short experiments with large doses of selenite or selenomethionine Br J Nutr. 1978 39 3 579 587 10.1079/bjn19780073 638126 22. Lobinski R Edmonds JS Suzuki KT Uden PC Species-selective determination of selenium compounds in biological materials (Technical Report) Pure Appl Chem. 2000 72 3 447 461 10.1351/pac200072030447 23. Olson GE Winfrey VP Hill KE Burk RF Megalin mediates selenoprotein P uptake by kidney proximal tubule epithelial cells J Biol Chem. 2008 283 11 6854 6860 10.1074/jbc.M709945200 18174160 24. Chiu-Ugalde J Theilig F Behrends T Mutation of megalin leads to urinary loss of selenoprotein P and selenium deficiency in serum, liver, kidneys and brain Biochem J. 2010 431 1 103 111 10.1042/BJ20100779 20653565 25. Schwarz M Meyer CE Löser A Excessive copper impairs intrahepatocyte trafficking and secretion of selenoprotein P Nat Commun. 2023 14 1 3479 10.1038/s41467-023-39245-3 37311819 PMC10264388 26. Nakano T Katsuki S Chen M Uremic toxin indoxyl sulfate promotes proinflammatory macrophage activation via the interplay of OATP2B1 and Dll4-Notch signaling Circulation. 2019 139 1 78 96 10.1161/CIRCULATIONAHA.118.034588 30586693 PMC6311723 27. Tajima-Shirasaki N Ishii K-A Takayama H Eicosapentaenoic acid down-regulates expression of the selenoprotein P gene by inhibiting SREBP-1c protein independently of the AMP-activated protein kinase pathway in H4IIEC3 hepatocytes J Biol Chem. 2017 292 26 10791 10800 10.1074/jbc.M116.747006 28465347 PMC5491766 28. Speckmann B Walter PL Alili L Selenoprotein P expression is controlled through interaction of the coactivator PGC-1alpha with FoxO1a and hepatocyte nuclear factor 4alpha transcription factors Hepatology. 2008 48 6 1998 2006 10.1002/hep.22526 18972406 29. Enoki Y Watanabe H Arake R Potential therapeutic interventions for chronic kidney disease-associated sarcopenia via indoxyl sulfate-induced mitochondrial dysfunction J Cachexia Sarcopenia Muscle. 2017 8 5 735 747 10.1002/jcsm.12202 28608457 PMC5659061 30. Yang K Xu X Nie L Indoxyl sulfate induces oxidative stress and hypertrophy in cardiomyocytes by inhibiting the AMPK/UCP2 signaling pathway Toxicol Lett. 2015 234 2 110 119 10.1016/j.toxlet.2015.01.021 25703824 31. Li X Lu Z Zhou F Indoxyl sulfate promotes the atherosclerosis through up-regulating the miR-34a expression in endothelial cells and vascular smooth muscle cells in vitro Vascul Pharmacol. 2020 131 106763 106763 10.1016/j.vph.2020.106763 32593718 32. Xu Y Zalzala M Xu J Li Y Yin L Zhang Y A metabolic stress-inducible miR-34a-HNF4α pathway regulates lipid and lipoprotein metabolism Nat Commun. 2015 6 1 7466 10.1038/ncomms8466 26100857 PMC4479415 33. Oo SM Misu H Saito Y Serum selenoprotein P, but not selenium, predicts future hyperglycemia in a general Japanese population Sci Rep. 2018 8 1 16727 10.1038/s41598-018-35067-2 30425271 PMC6233151 34. Mishima E Conrad M Nutritional and metabolic control of ferroptosis Annu Rev Nutr. 2022 42 1 275 309 10.1146/annurev-nutr-062320-114541 35650671 35. Friedmann Angeli JP Schneider M Proneth B Inactivation of the ferroptosis regulator Gpx4 triggers acute renal failure in mice Nat Cell Biol. 2014 16 12 1180 1191 10.1038/ncb3064 25402683 PMC4894846 36. Kung W-J Shih C-T Lee C-H Lin C-C The divalent elements changes in early stages of chronic kidney disease Biol Trace Elem Res. 2018 185 1 30 35 10.1007/s12011-017-1228-3 29285723 37. Lin T Tao J Chen Y Selenium deficiency leads to changes in renal fibrosis marker proteins and Wnt/β-catenin signaling pathway components Biol Trace Elem Res. 2022 200 3 1127 1139 10.1007/s12011-021-02730-1 33895963 38. Zachara BA Trafikowska U Adamowicz A Nartowicz E Manitius J Selenium, glutathione peroxidases, and some other antioxidant parameters in blood of patients with chronic renal failure J Trace Elem Med Biol. 2001 15 2-3 161 166 10.1016/S0946-672X(01)80061-4 11787983 39. Vanholder R Schepers E Pletinck A Nagler EV Glorieux G The uremic toxicity of indoxyl sulfate and p-cresyl sulfate: a systematic review J Am Soc Nephrol. 2014 25 9 1897 1907 10.1681/ASN.2013101062 24812165 PMC4147984 40. Nakagawa K Itoya M Takemoto N Indoxyl sulfate induces ROS production via the aryl hydrocarbon receptor-NADPH oxidase pathway and inactivates NO in vascular tissues Life Sci. 2021 265 118807 10.1016/j.lfs.2020.118807 33232689 41. Jansen J Jansen K Neven E Remote sensing and signaling in kidney proximal tubules stimulates gut microbiome-derived organic anion secretion Proc Natl Acad Sci U S A. 2019 116 32 16105 16110 10.1073/pnas.1821809116 31341083 PMC6689987 42. Poursaitidis I Wang X Crighton T Oncogene-Selective sensitivity to synchronous cell death following modulation of the amino acid nutrient cystine Cell Rep. 2017 18 11 2547 2556 10.1016/j.celrep.2017.02.054 28297659 PMC5368412 43. Chen C Wu L Xie C Zhao X Mao H Xing C The role of AMP-activated protein kinase α1-mediated endoplasmic reticulum stress in alleviating the toxic effect of uremic toxin indoxyl sulfate on vascular endothelial cells by Klotho J Appl Toxicol. 2021 41 9 1446 1455 10.1002/jat.4135 33458837 PMC8451879 44. Kikuchi H Sasaki E Nomura N Failure to sense energy depletion may be a novel therapeutic target in chronic kidney disease Kidney Int. 2019 95 1 123 137 10.1016/j.kint.2018.08.030 30455054 45. Liu C Rokavec M Huang Z Hermeking H Curcumin activates a ROS/KEAP1/NRF2/miR-34a/b/c cascade to suppress colorectal cancer metastasis Cell Death Differ. 2023 30 7 1771 1785 10.1038/s41418-023-01178-1 37210578 PMC10307888 46. Bai X-Y Ma Y Ding R Fu B Shi S Chen X-M miR-335 and miR-34a Promote renal senescence by suppressing mitochondrial antioxidative enzymes J Am Soc Nephrol. 2011 22 7 1252 1261 10.1681/ASN.2010040367 21719785 PMC3137573 47. Liu Y Bi X Xiong J MicroRNA-34a promotes renal fibrosis by downregulation of Klotho in tubular epithelial cells Mol Ther. 2019 27 5 1051 1065 10.1016/j.ymthe.2019.02.009 30853453 PMC6520492 48. Chu L-K Cao X Wan L Autophagy of OTUD5 destabilizes GPX4 to confer ferroptosis-dependent kidney injury Nat Commun. 2023 14 1 8393 10.1038/s41467-023-44228-5 38110369 PMC10728081 49. Sun X Huang N Li P TRIM21 ubiquitylates GPX4 and promotes ferroptosis to aggravate ischemia/reperfusion-induced acute kidney injury Life Sci. 2023 321 121608 10.1016/j.lfs.2023.121608 36958437 PMC11483487 50. Deng Z Wang Y Liu J WBP2 restrains the lysosomal degradation of GPX4 to inhibit ferroptosis in cisplatin-induced acute kidney injury Redox Biol. 2023 65 102826 10.1016/j.redox.2023.102826 37516014 PMC10410181 51. Schulman G Berl T Beck GJ Randomized placebo-controlled EPPIC trials of AST-120 in CKD J Am Soc Nephrol. 2015 26 7 1732 1746 10.1681/ASN.2014010042 25349205 PMC4483576 52. Abdulah R Katsuya Y Kobayashi K Effect of sodium selenite supplementation on the levels of prostacyclin I(2) and thromboxane A(2) in human Thromb Res. 2007 119 3 305 310 10.1016/j.thromres.2006.02.005 16564072 53. Richard MJ Ducros V Forêt M Reversal of selenium and zinc deficiencies in chronic hemodialysis patients by intravenous sodium selenite and zinc gluconate supplementation. Time-course of glutathione peroxidase repletion and lipid peroxidation decrease Biol Trace Elem Res. 1993 39 2-3 149 159 10.1007/bf02783185 7509172 ",
  "metadata": {
    "Title of this paper": "Reversal of selenium and zinc deficiencies in chronic hemodialysis patients by intravenous sodium selenite and zinc gluconate supplementation. Time-course of glutathione peroxidase repletion and lipid peroxidation decrease",
    "Journal it was published in:": "Kidney360",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483056/"
  }
}