{
  "title": "Paper_949",
  "abstract": "pmc J Pers Med J Pers Med 2605 jpersmed jpm Journal of Personalized Medicine 2075-4426 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470797 PMC12470797.1 12470797 12470797 41003128 10.3390/jpm15090425 jpm-15-00425 1 Review Long-Term Prognosis, Risk Assessment, and Management of Patients Diagnosed with Takotsubo Syndrome: A Narrative Review Kosek-Nikołajczuk Małgorzata † Borowiak Ewa † https://orcid.org/0000-0003-1344-3348 Piatkowski Radoslaw Grabowski Marcin https://orcid.org/0000-0002-2982-3508 Budnik Monika * Raimondo Domenico Di Academic Editor 1st Department of Cardiology, Medical University of Warsaw, Stefana Banacha 1a, 02-097 Warsaw, Poland; m.kosek.nikolajczuk@gmail.com ewa.anna.borowiak@gmail.com * moni.budnik@gmail.com † These authors contributed equally to this work. 04 9 2025 9 2025 15 9 497650 425 05 6 2025 29 8 2025 02 9 2025 04 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Takotsubo syndrome (TTS) is a condition marked by sudden and temporary dysfunction of the left ventricle, occurring without significant coronary artery disease. It was previously thought to be a benign and self-limiting condition, associated with a favorable long-term prognosis and minimal impact on survival. However, the most recent findings provide evidence that TTS is a heterogeneous condition with various presentation patterns. Using the most recent evidence regarding long-term prognosis in TTS, this review article aims to provide an overview of the long-term survival of patients with TTS, highlighting potential risk factors and comorbidities that may worsen prognosis. It also explores the risk of recurrence and the utility of advanced imaging modalities for prognosis assessment. Risk factors negatively impacting long-term outcomes include male sex, older age, reduced left ventricular ejection fraction (LVEF), physical triggers (especially pulmonary and neurological diseases), and comorbidities such as atrial fibrillation, chronic obstructive pulmonary disease, and active cancer. Recurrence, though relatively uncommon, can affect up to 11% of patients, with “super recurrence” linked to higher peak troponin levels, lower LVEF, and emotional triggers. Advanced imaging modalities—such as coronary angiography and ventriculography, which are considered the gold standard, along with serial echocardiographic assessment—combined with cardiac biomarkers, including relatively low peak troponin levels and markedly elevated N-terminal pro-B-type natriuretic peptide (NT-proBNP), as well as diagnostic ratios like copeptin/NT-proBNP, provide a robust framework for differentiating TTS from acute coronary syndromes. Key findings suggest that chronic therapeutic strategies in the long-term management of TTS patients should focus on improving long-term outcomes and reducing the risk of mortality and TTS recurrence. Methods: A comprehensive review was conducted using PubMed (U.S. National Library of Medicine and National Institutes of Health) and Google Scholar to identify relevant English-language publications addressing the long-term prognosis, biomarkers, imaging, risk of recurrence, and long-term management of TTS. takotsubo syndrome long-term outcome prognosis recurrence survival biomarkers The authors received no financial support for the research, authorship, and publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Takotsubo syndrome (TTS) is defined as a temporary left ventricular (LV) dysfunction, with LV regional wall hypokinesis extending beyond a single coronary artery distribution and without any significant coronary lesions [ 1 2 3 TTS predominantly affects postmenopausal women, with approximately 90% of cases occurring in females, particularly those older than 50 years of age [ 3 4 3 Triggers for TTS are broadly categorized into emotional and physical stressors, with physical triggers being slightly more frequent than emotional ones [ 3 5 5 Diagnosis of TTS is primarily based on the Mayo Clinic Criteria [ 6 Transient hypokinesis, akinesis, or dyskinesis of the left ventricular mid-segments with or without apical involvement; the regional wall motion abnormalities extend beyond a single epicardial vascular distribution; a stressful trigger is often, but not always, present. Absence of obstructive coronary disease or angiographic evidence of acute plaque rupture. New electrocardiographic abnormalities (ST-segment elevation and/or T-wave inversion) or modest elevation in cardiac troponin. Absence of pheochromocytoma and myocarditis. Despite its reputation as a reversible condition, TTS can lead to severe complications such as acute heart failure, left ventricular outflow tract obstruction (LVOTO), mitral regurgitation, stroke, ventricular arrhythmias, and intraventricular thrombus formation [ 7 This review article aims to provide an overview of the long-term survival of patients with TTS, highlighting potential risk factors and comorbidities that may worsen prognosis. It also explores the risk of recurrence, the utility of advanced imaging modalities for prognosis assessment, and the implications of chronic therapeutic strategies in the long-term management of TTS patients. 2. Methods A non-systematic literature search was conducted using PubMed and Google Scholar to identify the most relevant English-language publications from 1990 to 2025, with a focus on articles published between 2015 and 2025. This search aimed to gather information on the long-term prognosis, biomarkers, imaging, risk of recurrence, and long-term management of TTS, including case–control studies, case reports, and review articles, as well as clinical guidelines and consensus documents. The keywords used in the search included “TTS”, “takotsubo syndrome”, “long-term prognosis”, “long-term management”, “risk of recurrence”, “recurrence”, “biomarkers”, “cardiac biomarkers”, “imaging modalities”, “imaging”, and “mortality”. Boolean operators (AND/OR) were used to ensure comprehensive retrieval of articles. References were selected based on their clinical relevance and their contribution to enhancing the understanding of long-term prognosis in TTS patients. It is important to note that no structured inclusion or exclusion criteria, quality assessment tools, or Preferred Reporting Items for Systematic reviews and Meta-Analyses (PRISMA) methodologies were applied in this search. 3. Risk Factors and Comorbidities Negatively Affecting Long-Term Prognosis in TTS Risk stratification in TTS remains challenging due to its variable presentation patterns and the difficulties in developing a risk stratification model or scale that can be applied to all forms of TTS [ 8 9 10 11 It is a known fact that the prevalence of reduced LVEF is higher in patients with TTS than in those with ACS [ 3 12 13 14 15 Atrial fibrillation (AF) is the most frequent arrhythmia in patients with TTS, and its prevalence is estimated at 5–15% [ 16 17 18 19 17 19 16 20 16 21 22 23 22 22 The QT interval prolongation in patients with TTS, which can sometimes occur 72 h after admission, may increase the risk of in-hospital torsade de pointes [ 24 25 26 27 28 Thangjui et al. conducted a study including 154,919 patients with atrial fibrillation, among whom, 42 developed TTS following electric cardioversion. In this group of patients, diabetes mellitus appeared to be protective against the development of TTS [ 29 30 31 Of 1071 patients with TTS from the German Italian Spanish Takotsubo (GEIST) registry, 30% presented with dyspnea on admission. Arcari et al. identified diabetes, lower LVEF, concomitant pulmonary disease, and atrial fibrillation as factors associated with dyspnea on admission. Patients presenting with this symptom had a greater risk of pulmonary edema, cardiogenic shock, and death, including higher long-term mortality [ 21 32 33 One of the most common comorbidities among patients with TTS is cancer, and its prevalence in this group is reported to be higher than in the general population. Research has shown that this additional diagnosis significantly increases the risk of in-hospital complications, mortality during hospitalization, and long-term all-cause mortality in these patients [ 34 35 36 Lastly, it is crucial to address the psychiatric conditions observed in up to 50% of TTS patients, as these conditions contribute to a greater risk of the development and recurrence of this disease [ 37 3 38 37 39 40 41 42 43 Table 1 jpm-15-00425-t001_Table 1 Table 1 Risk factors and comorbidities negatively affecting long-term prognosis in TTS—a summary of cited studies. Authors Year of Country of Research and/or Used Database Results El-Battrawy et al. [ 18 2017 Germany  - 114 TTS patients - in-hospital mortality, 30-day mortality, and long-term mortality were significantly higher in patients with AF Santoro et al. [ 26 2017 Germany, Italy  - 52 TTS patients - prolonged QTc interval at admission was significantly associated with a higher risk of rehospitalization at follow-up Sun et al. [ 13 2017 China, United States  - 205 TTS patients - diastolic dysfunction as a risk factor for worse long-term outcomes Ghadri et al. [ 7 2018 International (Austria, Finland, France, Germany, Italy, Poland, Switzerland, the United Kingdom, and the United States)—InterTAK Registry  - 455 TTS patients vs. 455 ACS patients—overall similar long-term mortality - among 1613 TTS patients: worst outcome in patients with TTS caused by neurologic diseases, most favorable prognosis in TTS related to emotional stress - TTS secondary to physical activities, medical conditions, procedures, and neurologic disease: significantly higher mortality compared with ACS Thangjui et al. [ 29 2023 United States—National Readmission Database  - among 154,919 patients admitted with atrial fibrillation, who underwent electrical cardioversion in 2018, 0.027% were readmitted with takotsubo cardiomyopathy - diabetes mellitus seemed protective against developing TTS Citro et al. [ 12 2019 Italy—Takotsubo Italian Network  - 326 TTS patients - LVEF < 35% on admission: higher rate of in-hospital complications, as well as higher overall mortality and rate of adverse cardiac events during the long-term follow-up Jesel et al. [ 17 2019 France  - 214 TTS patients - AF is significantly associated with poorer short- and long-term outcomes Uribarri et al. [ 9 2019 Spain—Spanish National Registry (RETAKO)  - 939 TTS patients—higher mortality in cases of TTS triggered by physical factors(worse prognosis—hypoxia) - other risk factors for less favorable outcome: age > 70 years, diabetes mellitus, LVEF < 30%, shock on admission Abumayyaleh et al. [ 14 2020 Germany  - 648 patients with TTS or ACS - LVEF < 35%: comparable short-term mortality rate in those with TTS and patients with ACS - significantly higher long-term mortality in TTS, but related to non-cardiovascular causes Budnik et al. [ 22 2020 Poland  - 232 patients: 211 women and 11 men - men: more likely to live alone, more frequent physical trigger, higher prevalence of smoking in men, lower LVEF Carroll et al. [ 37 2020 United States  - a systematic review: 252 TTS patients - depression (39%) and anxiety (17%)were identified as the most commonly reported psychiatric illnesses among those patients Madias et al. [ 39 2020 United States  - 128 TTS patients, 117 (91.4%) female, with 47 (36.7%) patients having a neurological and/or psychiatric comorbidity(s) - a higher frequency of psychiatric medication usage De Miguel et al. [ 27 2021 Spain—Spanish National Registry (RETAKO)  - 246 TTS patients - corrected QT interval was independently associated with the primary endpoint of all-cause death and nonfatal cardiovascular events El-Battrawy et al. [ 19 2021 International—InterTAK Registry  - 112 patients with AF (7.1%) out of the overall 1584 TTS patients - among those with AF: higher mean age, fewer women, lower LVEF, more often observed cardiogenic shock, higher in-hospital and long-term mortality Paolisso et al. [ 31 2021 Italy  - 28 patients with TTS and hyperglycemia vs. 48 with normoglycemia - patients with TTS and hyperglycemia exhibit sympathetic overactivity with a hyperglycemia-mediated proinflammatory pathway, which could cause a worse prognosis during follow-up Arcari et al. [ 21 2022 Germany, Italy, Spain—German Italian Spanish Takotsubo (GEIST) Registry  - 286 men (11%) out of 2492 TTS patients - men: younger age, higher prevalence of comorbid conditions (diabetes mellitus, pulmonary diseases, malignancies) and physical trigger; higher rates of cardiogenic shock, in-hospital mortality, and long-term mortality - risk factors for dyspnea on admission: diabetes, lower LVEF, concomitant pulmonary disease, AF Osawa et al. [ 34 2023 Japan  - a systematic review of 14 studies (189,210 TTS patients) - patients with TTS and malignancy: higher risk of mortality at the most extended follow-up; cancer was significantly associated with an increased risk of in-hospital or 30-day mortality Almendro-Delia et al. [ 15 2024 Spain—Spanish National Registry (RETAKO)  - 1463 TTS patients - predictors of late recovery: older age, history of neurological disorders, concomitant coronary artery disease, active cancer, physical triggers, elevated inflammatory biomarkers, cardiogenic shock, lower LVEF at admission Elkattawy et al. [ 20 2024 United States—National Inpatient Sample (NIS)  - 1923 patients with VT (4.8%) out of 40,114 patients - identified VT predictors: concomitant AF, congestive heart failure, coagulopathy - diagnosis of VT was connected to higher mortality among those patients - the female sex was associated with a lower risk of VT in patients with TTS and lower mortality Palm et al. [ 23 2024 Denmark—Danish national registries  - 79 men (11.9%) out of 662 TTS patients - men: socioeconomically disadvantaged compared to their female counterparts, with higher 3-year mortality after an incident (most pronounced among men with a low family income and an increase in comorbidity score) Pinho et al. [ 28 2024 Portugal  - 113 TTS patients - QT interval prolongation had no significant impact on in-hospital and long-term outcomes Tan et al. [ 40 2024 International—FAERS  - 132 cases of TTS related to SSRIs and SNRIs therapy (female patients—80%) Tini et al. [ 35 2024 Italy  - a systematic revision of 1109 TTS cases - 10% mean prevalence of cancer in TTS, ranging from 4% to 29% Watanabe et al. [ 30 2024 Japan—Tokyo Cardiovascular Care Unit Network Registry  - 1226 TTS patients - the prevalence of diabetes was 17.0% in TTS and 15.8% in the general population, with no significant difference - patients with diabetes tended to have a higher in-hospital mortality rate Arcari et al. [ 33 2025 Italy, United Kingdom  - 69 patients with TTS and COPD out of the overall 440 patients - COPD: higher risk of in-hospital complications, long-term recurrence, and mortality 4. Biomarkers and Imaging in TTS Coronary angiography and left ventriculography are considered the gold standards for the acute evaluation of suspected TTS and for differentiating it from ACSs, including acute myocardial infarction (AMI). These procedures are essential for ruling out obstructive coronary disease and identifying typical wall motion abnormalities. All patients presenting with acute chest pain and changes on their ECG should undergo a rapid assessment for ACS. Typically, patients with TTS demonstrate normal coronary arteries or mild atherosclerosis, distinguishing it from AMI, where significant blockages are often present [ 44 7 Additional imaging techniques, including computed tomography (CT), nuclear imaging (single-photon emission computed tomography (SPECT) and positron emission tomography (PET)), and sympathetic innervation imaging, have also been applied in TTS research, revealing persistent sympathetic denervation in affected segments [ 7 44 The usefulness of cardiac biomarkers is evident in situations where the diagnosis is unclear. TTS presents a distinct biochemical and imaging profile that facilitates its differentiation from ACS, especially ST-segment elevation myocardial infarction (STEMI), in diagnostically ambiguous presentations, or as an adjunctive evaluation strategy [ 44 3 7 3 44 3 45 Conversely, NT-proBNP levels are markedly elevated during the acute phase of TTS [ 7 16 3 16 46 16 46 7 46 Several biomarkers are promising in differentiating TTS from MI. The serum copeptin/NT-proBNP shows high diagnostic accuracy, as copeptin levels are significantly lower in TTS compared to STEMI and could be an additional tool for non-invasive differentiation [ 47 48 49 50 51 52 53 Regarding imaging, echocardiography is the most widely used imaging modality due to its accessibility and utility in detecting regional wall motion abnormalities, LVOTO, mitral regurgitation, and apical thrombus [ 7 45 45 54 45 54 7 55 Cardiac magnetic resonance imaging (MRI) provides high-resolution tissue characterization and has become a cornerstone in the subacute assessment of TTS. Moreover, it is used to differentiate it from myocardial infarction and myocarditis. In addition to the identification of typical symmetric regional wall motion abnormalities, cardiac MRI allows precise evaluation of RV and LV function, assessment of additional complications (i.e., pericardial and/or pleural effusion, LV and RV thrombi), and characterization of myocardial tissue (i.e., oedema, inflammation, necrosis/fibrosis) [ 7 7 7 7 56 57 56 57 58 59 57 7 57 57 57 In summary, integrating both conventional and advanced biomarkers, along with multimodal imaging strategies, enhances the diagnostic accuracy and clinical management of TTS ( Figure 1 Figure 1 Imaging modalities and key biomarkers in TTS. TTS—Takotsubo syndrome, LGE—late gadolinium enhancement, CT—computed tomography, PET—positron emission tomography, SPECT—single photon emission computed tomography, LV—left ventricle, RV—right ventricle, ACS—acute coronary syndrome. Created in https://BioRender.com 5. Recurrence of TTS Recurrence of TTS is relatively uncommon; however, it represents a significant clinical concern. The recurrence rates in TTS vary across different studies, and knowledge of long-term TTS complications is limited due to the relatively small number and short follow-up periods in most cohorts [ 60 60 61 6 7 8 9 11 12 3 60 61 62 63 The majority of patients experiencing recurrence typically have only one additional episode (approximately 90%), though cases with multiple recurrences are also observed. Lau et al. describe three patients with two episodes of recurrence (7.7%) and one patient with three episodes of recurrence (2.6%) among 39 recurrent TTS cases [ 62 64 64 64 39 Sex, age, and comorbidities appear to influence the risk of recurrence. In a study by Lau et al., male sex was associated with a 2.5-fold higher risk of recurrence or death compared to females [ 62 65 62 61 66 The influence of pharmacological therapy remains a matter of controversy. Some studies indicate that beta-blocker therapy reduces the risk of recurrence and mortality compared to those not treated with beta-blockers [ 60 60 64 67 3 7 60 39 36 68 69 Regarding clinical presentation, the apical type of TTS is the most common during recurrence, although midventricular forms are also frequent [ 39 61 39 61 68 70 17 LV function also plays a critical role. Meta-analyses indicate that patients with recurrence have a lower average LVEF during the first episode (33%) compared to the non-recurrence group (40%), suggesting that initial severity may predict recurrence risk [ 39 62 39 61 39 62 Symptoms at recurrence typically mirror those of the initial event, with chest pain and dyspnea being predominant. However, trigger types often differ between episodes, with approximately 40% to 67% of patients experiencing new emotional or physical triggers at recurrence [ 61 64 68 71 71 Importantly, recurrence has significant prognostic implications. One study found that TTS patients with recurrence had a 5.9-fold higher 30-day cardiovascular mortality rate compared to non-recurrent cases [ 67 67 66 72 61 Finally, while a potential genetic predisposition to recurrence has been hypothesized, current data remain inconclusive. Familial forms and repeated recurrences suggest a possible genetic predisposition that interacts with environmental triggers and adrenergic dysregulation [ 36 6. Long-Term Survival of Patients with TTS in Numbers This summary presents the most recent data on mortality rates among patients with TTS ( Table 2 3 73 74 75 76 77 78 jpm-15-00425-t002_Table 2 Table 2 Long-term survival of patients with TTS in numbers—a summary of cited studies. Authors Year of Country of Research and/or Used Database Results Redford et al. [ 75 2015 Sweden—SWEDEHEART Registry, Swedish Coronary Angiography and Angioplasty Registry (SCAAR), and the Register of Information and Knowledge about Swedish Heart Intensive Care Admissions (RIKS-HIA) Short- and long-term mortality in patients with Takotsubo ( n n n Templin et al. [ 3 2015 InterTAK Registry  - mortality among 1750 patients with TTS was 5.6% per patient-year Stiermaier et al. [ 74 2016 Germany  - 286 TTS patients matched for age and gender with 286 STEMI patients - significantly higher long-term mortality compared with the matched STEMI cohort (24.7% vs. 15.1%) during the follow-up period (mean of 3.8 ± 2.5 years; of note—primarily driven by non-cardiovascular causes) Pelliccia et al. [ 77 2019 meta-analysis of 54 studies with follow-up data exceeding 6 months  - 4679 TTS patients: the death rate during admission was 2.4% (112 patients); the annual mortality rate of the other 4567 patients was 3.5% (with a mean follow-up of 28 months), and the majority of those patients died because of non-cardiac reasons Gaede et al. [ 78 2020 Germany  - 126 TTS patients - the majority presented with physical triggering factors: a mortality rate of 39.1% within 4 years Butt et al. [ 76 2022 Denmark—Danish nationwide registries  - 881 TTS patients - mean follow-up of 2.9 years - survivors of TTS had higher associated rates of death compared with the background population - survivors of TTS had higher associated rates of hospitalization due to HF compared with the background population, but lower rates compared with survivors of STEMI Stähli et al. [ 73 2024 InterTAK Registry  - out of 2938 patients, 7.6% (222) died during a 1-year follow-up. 7. Acute Treatment in TTS Management of the acute phase of the disease depends on the severity of the heart failure and the identified risk of complications. Ideally, all patients should be admitted to the intensive care unit (ICU) and monitored with an ECG for at least 24 h. In the past, beta-blockers were commonly used in the acute phase of TTS; however, their beneficial effects have not been proven to date [ 79 16 80 16 79 8. Long-Term Management and Chronic Treatment of Patients with TTS As part of the long-term care of patients with TTS, a follow-up visit is recommended after 3 to 6 months. This visit should include an ECG and cardiac imaging, such as transthoracic echocardiography, as well as possibly an MRI [ 16 81 The available data on the long-term treatment of patients with TTS are primarily based on several observational studies, as there are no completed randomized trials on the chronic pharmacological treatment of these patients [ 79 82 1 83 83 84 85 86 87 88 89 80 9. Conclusions Following initial observational studies, TTS was predominantly considered a benign, self-limiting condition with a favorable long-term prognosis and no significant impact on the survival of patients with TTS. However, the most recent findings have challenged this theory, providing evidence that TTS is a heterogeneous condition with various presentation patterns, and patients’ comorbidities often complicate its clinical course and long-term prognosis. Classically, TTS was perceived as an emotionally triggered disorder; however, it is essential to note that more than one-third of patients present with TTS induced by a physical trigger. Among the most critical determinants adversely affecting the long-term prognosis of TTS patients are pulmonary and neurological diseases. The other factors with an observed negative influence on long-term outcome are: male sex, older age, an initially reduced left ventricular ejection fraction, and dyspnea or shock on admission. Significant comorbidities linked to a poorer long-term prognosis include concomitant coronary artery disease, atrial fibrillation, chronic obstructive pulmonary disease, and active cancer. The influence of diabetes mellitus on long-term prognosis in TTS may seem controversial, but the majority of studies revealed its potential to worsen long-term outcomes. The potential presence of comorbidities and the fact that mortality in TTS, in most studies, was related to non-cardiovascular causes, may justify a multidisciplinary approach for TTS patients. However, since one of the most common triggers for TTS is still emotional stress, there may be a role for psychological counseling and psychiatric assessment of these patients. The combined use of cardiac biomarkers, such as relatively low peak troponin levels, markedly elevated NT-proBNP, and diagnostic ratios including copeptin/NT-proBNP, along with advanced imaging modalities, provides a robust framework for differentiating TTS from acute coronary syndromes. Furthermore, the integration of echocardiography for the early detection of wall motion abnormalities and complications, alongside cardiac MRI for tissue characterization and confirmation of myocardial reversibility, enhances diagnostic accuracy and longitudinal monitoring in patients with TTS. While data on chronic treatment remain limited, further research is needed to identify the most effective pharmacological interventions for patients with TTS, preferably including randomized controlled trials. Those interventions should aim to improve long-term outcomes and decrease the risk of mortality and TTS recurrence. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.B., M.K.-N. and E.B.; writing—original draft preparation, M.K.-N. and E.B.; writing—review and editing, M.K.-N., E.B., M.B. and R.P.; supervision, M.B., R.P. and M.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created. Conflicts of Interest The authors declare no conflicts of interest. References 1. Opolski G. Pawlak M.M. Roik M.F. Kochanowski J. Scisło P. Piatkowski R. Kochman J. Karpiński G. Kowalik R. Grabowski M. Clinical presentation, treatment, and long-term outcomes in patients with takotsubo cardiomyopathy. Experience of a single cardiology center Pol. Arch. Med. Wewn. 2010 120 231 236 10.20452/pamw.933 20567207 2. Sato H. Takotsubo-type cardiomyopathy due to multivessel spasm Clinical Aspect of Myocardial Injury: From Ischemia to Heart Failure Kodama K. Haze K. Hon M. SCIRP Kagakuhyouronsha, Tokyo 1990 56 64 3. Templin C. Ghadri J.R. Diekmann J. Napp L.C. Bataiosu D.R. Jaguszewski M. Cammann V.L. Sarcon A. Geyer V. Neumann C.A. Clinical Features and Outcomes of Takotsubo (Stress) Cardiomyopathy N. Engl. J. Med. 2015 373 929 938 10.1056/NEJMoa1406761 26332547 4. Singh T. Khan H. Gamble D.T. Scally C. Newby D.E. Dawson D. Takotsubo Syndrome: Pathophysiology, Emerging Concepts, and Clinical Implications Circulation 2022 145 1002 1019 Erratum in Circulation 2022 145 10.1161/CIRCULATIONAHA.121.055854 35344411 PMC7612566 5. Skrobucha A. Borowiak E. Szarpak Ł. Filipiak K.J. Gąsecka A. Endothelial dysfunction: Can it differentiate Takotsubo syndrome from spontaneous coronary artery dissection? Cardiol. J. 2023 30 1061 1063 10.5603/cj.95435 37853827 PMC10713208 6. Prasad A. Lerman A. Rihal C.S. Apical ballooning syndrome (Tako-Tsubo or stress cardiomyopathy): A mimic of acute myocardial infarction Am. Heart J. 2008 155 408 417 10.1016/j.ahj.2007.11.008 18294473 7. Ghadri J.R. Wittstein I.S. Prasad A. Sharkey S. Dote K. Akashi Y.J. Cammann V.L. Crea F. Galiuto L. Desmet W. International Expert Consensus Document on Takotsubo Syndrome (Part II): Diagnostic Workup, Outcome, and Management Eur. Heart J. 2018 39 2047 2062 10.1093/eurheartj/ehy077 29850820 PMC5991205 8. Yalta K. Madias J.E. Kounis N.G. Y-Hassan S. Polovina M. Altay S. Mebazaa A. Yilmaz M.B. Lopatin Y. Mamas M.A. Takotsubo Syndrome: An International Expert Consensus Report on Practical Challenges and Specific Conditions (Part-2: Specific Entities, Risk Stratification and Challenges After Recovery) Balk. Med. J. 2024 41 442 457 10.4274/balkanmedj.galenos.2024.2024-9-99 PMC11589209 39417538 9. Uribarri A. Núñez-Gil I.J. Conty D.A. Vedia O. Almendro-Delia M. Cambra A.D. Martin-Garcia A.C. Barrionuevo-Sánchez M. Martínez-Sellés M. Raposeiras-Roubín S. Short- and Long-Term Prognosis of Patients With Takotsubo Syndrome Based on Different Triggers: Importance of the Physical Nature J. Am. Heart Assoc. 2019 8 e013701 10.1161/JAHA.119.013701 31830875 PMC6951081 10. Budnik M. Kochanowski J. Piatkowski R. Peller M. Wojtera K. Gaska-Dzwonkowska M. Glowacka P. Karolczak P. Ochijewicz D. Opolski G. Comparison of Complications and In-Hospital Mortality in Female Patients with Takotsubo Syndrome and ST-Segment Elevation Myocardial Infarction J Womens Health 2018 27 1513 1518 10.1089/jwh.2017.6754 29979617 11. Ghadri J.R. Kato K. Cammann V.L. Gili S. Jurisic S. Di Vece D. Candreva A. Ding K.J. Micek J. Szawan K.A. Long-Term Prognosis of Patients With Takotsubo Syndrome J. Am. Coll. Cardiol. 2018 72 874 882 10.1016/j.jacc.2018.06.016 30115226 12. Citro R. Radano I. Parodi G. Di Vece D. Zito C. Novo G. Provenza G. Bellino M. Prota C. Silverio A. Long-term outcome in patients with Takotsubo syndrome presenting with severely reduced left ventricular ejection fraction Eur. J. Heart Fail. 2019 6 781 789 10.1002/ejhf.1373 30714660 13. Sun T. Ming Z. Liu Z. Lennon R.J. Yang S.W. Kwon T.G. Park K.H. Lerman L.O. Lerman A. Prevalence of diastolic function and clinical impact on long-term outcome in takotsubo cardiomyopathy Int. J. Cardiol. 2017 244 7 12 10.1016/j.ijcard.2017.06.068 28784454 14. Abumayyaleh M. El-Battrawy I. Kummer M. Gietzen T. Behnes M. Zhou X.B. Lang S. Borggrefe M. Akin I. Association Between Mortality and Left Ventricular Ejection Fraction in Patients With Takotsubo Syndrome Versus Acute Coronary Syndrome Vivo 2020 34 3639 3648 10.21873/invivo.12210 33144479 PMC7811595 15. Almendro-Delia M. López-Flores L. Uribarri A. Vedia O. Blanco-Ponce E. López-Flores M.D.C. Rivas-García A.P. Fernández-Cordón C. Sionis A. Martín-García A.C. Recovery of Left Ventricular Function and Long-Term Outcomes in Patients With Takotsubo Syndrome J. Am. Coll. Cardiol. 2024 84 1163 1174 10.1016/j.jacc.2024.05.075 39293882 16. Lyon A.R. Bossone E. Schneider B. Sechtem U. Citro R. Underwood S.R. Sheppard M.N. Figtree G.A. Parodi G. Akashi Y.J. Current state of knowledge on Takotsubo syndrome: A Position Statement from the Taskforce on Takotsubo Syndrome of the Heart Failure Association of the European Society of Cardiology Eur. J. Heart Fail. 2016 18 8 27 10.1002/ejhf.424 26548803 17. Jesel L. Berthon C. Messas N. Lim H.S. Girardey M. Marzak H. Marchandot B. Trinh A. Ohlmann P. Morel O. Atrial arrhythmias in Takotsubo cardiomyopathy: Incidence, predictive factors, and prognosis Europace 2019 21 298 305 10.1093/europace/euy147 30007327 18. El-Battrawy I. Lang S. Ansari U. Behnes M. Hillenbrand D. Schramm K. Fastner C. Zhou X. Bill V. Hoffmann U. Impact of concomitant atrial fibrillation on the prognosis of Takotsubo cardiomyopathy Europace 2017 19 1288 1292 10.1093/europace/euw293 27702871 19. El-Battrawy I. Cammann V.L. Kato K. Szawan K.A. Di Vece D. Rossi A. Wischnewsky M. Hermes-Laufer J. Gili S. Citro R. Impact of Atrial Fibrillation on Outcome in Takotsubo Syndrome: Data From the International Takotsubo Registry J. Am. Heart Assoc. 2021 10 e014059 10.1161/JAHA.119.014059 34315238 PMC8475688 20. Elkattawy O. Shacker M. Alabed S. Elias D. Elkattawy S. Mohamed O. Mansour C. Hamlet C. Emara S. Shamoon F. Ventricular Tachycardia in Patients With Takotsubo Cardiomyopathy: Prevalence, Predictors, and Associated In-Hospital Adverse Events Cureus 2024 16 e57724 10.7759/cureus.57724 38711723 PMC11073765 21. Arcari L. Núñez Gil I.J. Stiermaier T. El-Battrawy I. Guerra F. Novo G. Musumeci B. Cacciotti L. Mariano E. Caldarola P. Gender Differences in Takotsubo Syndrome J. Am. Coll. Cardiol. 2022 79 2085 2093 10.1016/j.jacc.2022.03.366 35618345 PMC8972425 22. Budnik M. Nowak R. Fijałkowski M. Kochanowski J. Nargiełło E. Piątkowski R. Peller M. Kucharz J. Jaguszewski M. Gruchała M. Sex-dependent differences in clinical characteristics and in-hospital outcomes in patients with takotsubo syndrome Pol. Arch. Intern. Med. 2020 130 25 30 31517898 10.20452/pamw.14970 23. Palm P. Wallach-Kildemoes H. Bang L.E. Berg S.K. Difference in Long-Term Mortality after Takotsubo Syndrome: The Role of Gender, Disease Burden, Socio-Economic Profile, and Psychological Distress Cardiology 2025 1 13 10.1159/000543668 40122028 24. Behr E.R. Mahida S. Takotsubo cardiomyopathy and the long-QT syndrome: An insult to repolarization reserve Europace 2009 11 697 700 10.1093/europace/eup081 19351629 25. Rawish E. Stiermaier T. Santoro F. Brunetti N.D. Eitel I. Current Knowledge and Future Challenges in Takotsubo Syndrome: Part 1-Pathophysiology and Diagnosis J. Clin. Med. 2021 10 479 10.3390/jcm10030479 33525539 PMC7865728 26. Santoro F. Brunetti N.D. Tarantino N. Romero J. Guastafierro F. Ferraretti A. Di Martino L.F.M. Ieva R. Pellegrino P.L. Di Biase M. Dynamic changes of QTc interval and prognostic significance in takotsubo (stress) cardiomyopathy Clin. Cardiol. 2017 40 1116 1122 10.1002/clc.22798 28892227 PMC6490575 27. de Miguel I.M. Núñez-Gil I.J. Pérez-Castellanos A. Uribarri A. Duran-Cambra A. Martín-García A. Corbí-Pascual M. Marzo M.G. Martínez-Selles M. RETAKO investigators Electrocardiographic Characteristics and Associated Outcomes in Patients with Takotsubo Syndrome. Insights RETAKO Registry Curr. Probl. Cardiol. 2021 46 100841 10.1016/j.cpcardiol.2021.100841 33994036 28. Pinho A.I. Oliveira C. Santos L.D. Marques C. Cabrita A. Dias P. Pestana G. Sousa C. Rodrigues R.A. QT interval prolongation in Takotsubo syndrome: A frightening feature with no major prognostic impact Monaldi Arch. Chest Dis. 2024 94 10.4081/monaldi.2023.2834 38058291 29. Thangjui S. Thyagaturu H. Trongtorsak A. Yodsuwan R. Fayaz M. Kewcharoen J. Navaravong L. Electrical Cardioversion-Associated Takotsubo Cardiomyopathy: A National Readmission Database 2018 Analysis and Systematic Review Anatol. J. Cardiol. 2023 27 62 68 10.14744/AnatolJCardiol.2022.2236 36747455 PMC9900402 30. Watanabe Y. Yoshikawa T. Arao K. Isogai T. Yamaguchi T. Egashira T. Imori Y. Mochizuki H. Yamamoto T. Asai K. Prevalence and Prognostic Impact of Diabetes in Takotsubo Syndrome: Insights from the Tokyo Cardiovascular Care Unit Network Registry Am. J. Cardiol. 2025 237 29 34 10.1016/j.amjcard.2024.11.022 39581523 31. Paolisso P. Bergamaschi L. Rambaldi P. Gatta G. Foà A. Angeli F. Fabrizio M. Casella G. Barbieri M. Galiè N. Impact of Admission Hyperglycemia on Heart Failure Events and Mortality in Patients With Takotsubo Syndrome at Long-term Follow-up: Data From HIGH-GLUCOTAKO Investigators Diabetes Care 2021 44 2158 2161 10.2337/dc21-0433 34187841 32. Kato K. Cammann V.L. Napp L.C. Szawan K.A. Micek J. Dreiding S. Levinson R.A. Petkova V. Würdinger M. Patrascu A. Prognostic impact of acute pulmonary triggers in patients with takotsubo syndrome: New insights from the International Takotsubo Registry ESC Heart Fail. 2021 8 1924 1932 10.1002/ehf2.13165 33713566 PMC8120351 33. Arcari L. Tini G. Zuccanti M. Camastra G. Cianca A. Belmonte E. Montefusco G. Scirpa R. Malerba C. Lupparelli F. Clinical characteristics and outcomes of Takotsubo syndrome in patients with chronic obstructive pulmonary disease Eur. J. Intern. Med. 2025 132 84 89 10.1016/j.ejim.2024.10.026 39510864 34. Osawa T. Tajiri K. Ieda M. Ishizu T. Clinical outcomes of takotsubo syndrome in patients with cancer: A systematic review and meta-analysis Front. Cardiovasc. Med. 2023 10 1244808 10.3389/fcvm.2023.1244808 37840966 PMC10570743 35. Tini G. Arcari L. Mistrulli R. Follesa F. Cianca A. Sclafani M. Tocci G. Spallarossa P. Battistoni A. Cacciotti L. A contemporary update on cancer and takotsubo syndrome Front. Cardiovasc. Med. 2024 10 1301383 10.3389/fcvm.2023.1301383 38259302 PMC10800806 36. Sclafani M. Arcari L. Russo D. Tini G. Limite L.R. Cacciotti L. Volpe M. Autore C. Musumeci M.B. Long-term management of Takotsubo syndrome: A not-so-benign condition Rev. Cardiovasc. Med. 2021 22 597 611 10.31083/j.rcm2203071 34565063 37. Carroll A.J. Goergen J. Wafford Q.E. Flaherty J.D. Grady K.L. Feingold K.L. Psychiatric conditions in patients presenting with Takotsubo syndrome: A systematic review and synthesis of case studies Gen. Hosp. Psychiatry 2020 65 54 63 10.1016/j.genhosppsych.2020.05.010 32497926 38. El-Sayed A.M. Brinjikji W. Salka S. Demographic and co-morbid predictors of stress (takotsubo) cardiomyopathy Am. J. Cardiol. 2012 110 1368 1372 10.1016/j.amjcard.2012.06.041 22819424 39. Madias J.E. Comparison of the first episode with the first recurrent episode of takotsubo syndrome in 128 patients from the world literature: Pathophysiologic connotations Int. J. Cardiol. 2020 310 27 31 10.1016/j.ijcard.2020.03.003 32151442 40. Tan B. Chen L. Yan S. Pan H. Zhang J. Wei H. Risk of stress cardiomyopathy associated with selective serotonin reuptake inhibitors and serotonin and norepinephrine reuptake inhibitors: A real-world pharmacovigilance analysis Sci. Rep. 2024 14 15167 10.1038/s41598-024-66155-1 38956425 PMC11220088 41. Naguy A. Al-Mutairi H. Al-Tajali A. Atomoxetine-related Takotsubo Cardiomyopathy J. Psychiatr. Pract. 2016 22 232 233 10.1097/PRA.0000000000000152 27123802 42. Christoph M. Ebner B. Stolte D. Ibrahim K. Kolschmann S. Strasser R.H. Schön S. Broken heart syndrome: Tako Tsubo cardiomyopathy associated with an overdose of the serotonin-norepinephrine reuptake inhibitor Venlafaxine Eur. Neuropsychopharmacol. 2010 20 594 597 10.1016/j.euroneuro.2010.03.009 20451358 43. Selke K.J. Dhar G. Cohn J.M. Takotsubo cardiomyopathy associated with titration of duloxetine Tex. Heart Inst. J. 2011 38 573 576 22163139 PMC3231522 44. Couch L.S. Garrard J.W. Henry J.A. Kotronias R.A. Alaour B. De Maria G.L. Channon K.M. Banning A.P. Lyon A.R. Marber M. Comparison of troponin and natriuretic peptides in Takotsubo syndrome and acute coronary syndrome: A meta-analysis Open Heart. 2024 11 e002607 10.1136/openhrt-2024-002607 38508657 PMC10952941 45. Citro R. Lyon A.R. Meimoun P. Omerovic E. Redfors B. Buck T. Lerakis S. Parodi G. Silverio A. Eitel I. Standard and advanced echocardiography in takotsubo (stress) cardiomyopathy: Clinical and prognostic implications J. Am. Soc. Echocardiogr. 2015 28 57 74 10.1016/j.echo.2014.08.020 25282664 46. Nguyen T.H. Neil C.J. Sverdlov A.L. Mahadavan G. Chirkov Y.Y. Kucia A.M. Stansborough J. Beltrame J.F. Selvanayagam J.B. Zeitz C.J. N-terminal pro-brain natriuretic protein levels in takotsubo cardiomyopathy Am. J. Cardiol. 2011 108 1316 1321 10.1016/j.amjcard.2011.06.047 21871590 47. Budnik M. Białek S. Peller M. Kiszkurno A. Kochanowski J. Kucharz J. Sitkiewicz D. Opolski G. Serum copeptin and copeptin/NT-proBNP ratio—New tools to differentiate takotsubo syndrome from acute myocardial infarction Folia Med. Cracov. 2020 60 5 14 32658207 10.24425/fmc.2020.133481 48. Fröhlich G.M. Schoch B. Schmid F. Keller P. Sudano I. Lüscher T.F. Noll G. Ruschitzka F. Enseleit F. Takotsubo cardiomyopathy has a unique cardiac biomarker profile: NT-proBNP/myoglobin and NT-proBNP/troponin T ratios for the differential diagnosis of acute coronary syndromes and stress induced cardiomyopathy Int. J. Cardiol. 2012 154 328 332 10.1016/j.ijcard.2011.09.077 22044675 49. Budnik M. Kochanowski J. Piatkowski R. Wojtera K. Peller M. Gaska M. Glowacka P. Karolczak P. Ochijewicz D. Opolski G. Simple markers can distinguish Takotsubo cardiomyopathy from ST segment elevation myocardial infarction Int. J. Cardiol. 2016 219 417 420 10.1016/j.ijcard.2016.06.015 27367474 50. Stiermaier T. Adams V. Just M. Blazek S. Desch S. Schuler G. Thiele H. Eitel I. Growth differentiation factor-15 in Takotsubo cardiomyopathy: Diagnostic and prognostic value Int. J. Cardiol. 2014 173 424 429 10.1016/j.ijcard.2014.03.014 24681016 51. Pirzer R. Elmas E. Haghi D. Lippert C. Kralev S. Lang S. Borggrefe M. Kälsch T. Platelet and monocyte activity markers and mediators of inflammation in Takotsubo cardiomyopathy Heart Vessels 2012 27 186 192 10.1007/s00380-011-0132-6 21416113 52. Kuwabara Y. Ono K. Horie T. Nishi H. Nagao K. Kinoshita M. Watanabe S. Baba O. Kojima Y. Shizuta S. Increased microRNA-1 and microRNA-133a levels in serum of patients with cardiovascular disease indicate myocardial damage Circ. Cardiovasc. Genet. 2011 4 446 454 10.1161/CIRCGENETICS.110.958975 21642241 53. Jaguszewski M. Osipova J. Ghadri J.R. Napp L.C. Widera C. Franke J. Fijalkowski M. Nowak R. Fijalkowska M. Volkmann I. A signature of circulating microRNAs differentiates takotsubo cardiomyopathy from acute myocardial infarction Eur. Heart J. 2014 35 999 1006 10.1093/eurheartj/eht392 24046434 PMC3985061 54. Mansencal N. Abbou N. Pillière R. El Mahmoud R. Farcot J.C. Dubourg O. Usefulness of two-dimensional speckle tracking echocardiography for assessment of Tako-Tsubo cardiomyopathy Am. J. Cardiol. 2009 103 1020 1024 10.1016/j.amjcard.2008.12.015 19327434 55. De Backer O. Debonnaire P. Gevaert S. Missault L. Gheeraert P. Muyldermans L. Prevalence, associated factors and management implications of left ventricular outflow tract obstruction in takotsubo cardiomyopathy: A two-year, two-center experience BMC Cardiovasc. Disord. 2014 14 147 10.1186/1471-2261-14-147 25339604 PMC4210484 56. Nakamori S. Matsuoka K. Onishi K. Kurita T. Ichikawa Y. Nakajima H. Ishida M. Kitagawa K. Tanigawa T. Nakamura T. Prevalence and signal characteristics of late gadolinium enhancement on contrast-enhanced magnetic resonance imaging in patients with takotsubo cardiomyopathy Circ. J. 2012 76 914 921 10.1253/circj.CJ-11-1043 22293447 57. Ojha V. Khurana R. Ganga K.P. Kumar S. Advanced cardiac magnetic resonance imaging in takotsubo cardiomyopathy Br. J. Radiol. 2020 93 20200514 10.1259/bjr.20200514 32795180 PMC8519651 58. Fernández-Jiménez R. Sánchez-González J. Agüero J. García-Prieto J. López-Martín G.J. García-Ruiz J.M. Molina-Iracheta A. Rosselló X. Fernández-Friera L. Pizarro G. Myocardial edema after ischemia/reperfusion is not stable and follows a bimodal pattern: Imaging and histological tissue characterization J. Am. Coll. Cardiol. 2015 65 315 323 10.1016/j.jacc.2014.11.004 25460833 59. Fernández-Jiménez R. Barreiro-Pérez M. Martin-García A. Sánchez-González J. Agüero J. Galán-Arriola C. García-Prieto J. Díaz-Pelaez E. Vara P. Martinez I. Dynamic edematous response of the human heart to myocardial infarction: Implications for assessing myocardial area at risk and salvage Circulation 2017 136 1288 1300 10.1161/CIRCULATIONAHA.116.025582 28687712 PMC5625960 60. Singh K. Carson K. Usmani Z. Sawhney G. Shah R. Horowitz J. Systematic review and meta-analysis of incidence and correlates of recurrence of takotsubo cardiomyopathy Int. J. Cardiol. 2014 174 696 701 10.1016/j.ijcard.2014.04.221 24809923 61. El-Battrawy I. Santoro F. Stiermaier T. Möller C. Guastafierro F. Novo G. Novo S. Mariano E. Romeo F. Romeo F. Incidence and Clinical Impact of Recurrent Takotsubo Syndrome: Results From the GEIST Registry J. Am. Heart Assoc. 2019 8 e010753 10.1161/JAHA.118.010753 31046506 PMC6512083 62. Lau C. Chiu S. Nayak R. Lin B. Lee M.S. Survival and risk of recurrence of takotsubo syndrome Heart 2021 107 1160 1166 10.1136/heartjnl-2020-318028 33419884 PMC8257555 63. Arcari L. Cacciotti L. Limite L.R. Russo D. Sclafani M. Semeraro R. Ansalone G. Volpe M. Autore C. Musumeci M.B. Clinical characteristics of patients with takotsubo syndrome recurrence: An observational study with long-term follow-up Int. J. Cardiol. 2021 329 23 27 10.1016/j.ijcard.2020.12.047 33359286 64. Shaw K.E. Lund P.G. Witt D. Okeson B.K. Lohese O. Schmitz K. Saxena R. Maron B.J. Sharkey S.W. Super Recurrence of Takotsubo Syndrome: Clinical Characteristics and Late Cardiac Outcomes J. Am. Heart Assoc. 2023 12 e029144 10.1161/JAHA.122.029144 37119086 PMC10227233 65. Patel S.M. Chokka R.G. Prasad K. Prasad A. Distinctive clinical characteristics according to age and gender in apical ballooning syndrome (takotsubo/stress cardiomyopathy): An analysis focusing on men and young women J. Card. Fail. 2013 19 306 310 10.1016/j.cardfail.2013.03.007 23663812 66. El-Battrawy I. Ansari U. Behnes M. Hillenbrand D. Schramm K. Haghi D. Hoffmann U. Papavassiliu T. Elmas E. Fastner C. Clinical and echocardiographic analysis of patients suffering from recurrent takotsubo cardiomyopathy J. Geriatr. Cardiol. 2016 13 888 893 28133464 10.11909/j.issn.1671-5411.2016.11.002 PMC5253404 67. Topf A. Mirna M. Hoppe U.C. Lichtenauer M. Motloch L. Vazirani R. Horn S. Núñez-Gil I.J. Takotsubo Syndrome Recurrence, a Trigger for Increased 30-Day Cardiovascular Mortality Med. Princ. Pract. 2025 34 391 399 10.1159/000545544 40168959 PMC12097407 68. Looi J.L. Easton A. Webster M. To A. Lee M. Kerr A.J. Recurrent Takotsubo Syndrome: How Frequent, and How Does It Present? Heart Lung Circ. 2024 33 1117 1122 10.1016/j.hlc.2024.02.008 38555187 69. Brunetti N.D. Santoro F. De Gennaro L. Correale M. Gaglione A. Di Biase M. Madias J.E. Combined therapy with beta-blockers and ACE-inhibitors/angiotensin receptor blockers and recurrence of Takotsubo (stress) cardiomyopathy: A meta-regression study Int. J. Cardiol. 2017 230 281 283 10.1016/j.ijcard.2016.12.124 28040283 70. Kato K. Di Vece D. Cammann V.L. Micek J. Szawan K.A. Bacchi B. Lüscher T.F. Ruschitzka F. Ghadri J.R. Templin C. Takotsubo Recurrence: Morphological Types and Triggers and Identification of Risk Factors J. Am. Coll. Cardiol. 2019 73 982 984 10.1016/j.jacc.2018.12.033 30819368 71. Fernández-Cordón C. Núñez-Gil I.J. Martín de Miguel I. Pérez-Castellanos A. Vedia O. Almendro-Delia M. López-País J. Uribarri A. Duran-Cambra A. Martín-García A. Takotsubo Syndrome, Stressful Triggers, and Risk of Recurrence Am. J. Cardiol. 2023 205 58 62 10.1016/j.amjcard.2023.07.155 37586122 72. Elesber A.A. Prasad A. Lennon R.J. Wright R.S. Lerman A. Rihal C.S. Four-year recurrence rate and prognosis of the apical ballooning syndrome J. Am. Coll. Cardiol. 2007 50 448 452 10.1016/j.jacc.2007.03.050 17662398 73. Stähli B.E. Schindler M. Schweiger V. Cammann V.L. Szawan K.A. Niederseer D. Würdinger M. Schönberger A. Schönberger M. Koleva I. Cardiac troponin elevation and mortality in takotsubo syndrome: New insights from the international takotsubo registry Eur. J. Clin. Invest. 2024 54 e14317 10.1111/eci.14317 39397275 74. Stiermaier T. Moeller C. Oehler K. Desch S. Graf T. Eitel C. Vonthein R. Schuler G. Thiele H. Eitel I. Long-term excess mortality in takotsubo cardiomyopathy: Predictors, causes and clinical consequences Eur. J. Heart Fail. 2016 18 650 656 10.1002/ejhf.494 26990821 75. Redfors B. Vedad R. Angerås O. Råmunddal T. Petursson P. Haraldsson I. Ali A. Dworeck C. Odenstedt J. Ioaness D. Mortality in takotsubo syndrome is similar to mortality in myocardial infarction—A report from the SWEDEHEART registry Int. J. Cardiol. 2015 185 282 289 10.1016/j.ijcard.2015.03.162 25818540 76. Butt J.H. Bang L.E. Rørth R. Schou M. Kristensen S.L. Yafasova A. Havers-Borgersen E. Vinding N.E. Jessen N. Kragholm K. Long-term Risk of Death and Hospitalization in Patients With Heart Failure and Takotsubo Syndrome: Insights From a Nationwide Cohort J. Card. Fail. 2022 28 1534 1544 10.1016/j.cardfail.2022.02.002 35167917 77. Pelliccia F. Pasceri V. Patti G. Tanzilli G. Speciale G. Gaudio C. Camici P.G. Long-Term Prognosis and Outcome Predictors in Takotsubo Syndrome: A Systematic Review and Meta-Regression Study JACC Heart Fail. 2019 7 143 154 10.1016/j.jchf.2018.10.009 30611720 78. Gaede L. Herchenbach A. Tröbs M. Marwan M. Achenbach S. Left ventricular contraction patterns in Takotsubo Syndrome and their correlation with long-term clinical outcome Int. J. Cardiol. Heart Vasc. 2021 32 100708 10.1016/j.ijcha.2020.100708 33457494 PMC7797942 79. Santoro F. Mallardi A. Leopizzi A. Vitale E. Rawish E. Stiermaier T. Eitel I. Brunetti N.D. Current Knowledge and Future Challenges in Takotsubo Syndrome: Part 2-Treatment and Prognosis J. Clin. Med. 2021 10 468 10.3390/jcm10030468 33530545 PMC7866173 80. Santoro F. Stiermaier T. Tarantino N. De Gennaro L. Moeller C. Guastafierro F. Marchetti M.F. Montisci R. Carapelle E. Graf T. Left Ventricular Thrombi in Takotsubo Syndrome: Incidence, Predictors, and Management: Results From the GEIST (German Italian Stress Cardiomyopathy) Registry J. Am. Heart Assoc. 2017 6 e006990 10.1161/JAHA.117.006990 29203578 PMC5779019 81. Ghadri J.R. Wittstein I.S. Prasad A. Sharkey S. Dote K. Akashi Y.J. Cammann V.L. Crea F. Galiuto L. Desmet W. International Expert Consensus Document on Takotsubo Syndrome (Part I): Clinical Characteristics, Diagnostic Criteria, and Pathophysiology Eur. Heart J. 2018 39 2032 2046 10.1093/eurheartj/ehy076 29850871 PMC5991216 82. Omerovic E. James S. Erlinge D. Hagström H. Venetsanos D. Henareh L. Ekenbäck C. Alfredsson J. Hambreus K. Redfors B. Rationale and design of BROKEN-SWEDEHEART: A registry-based, randomized, parallel, open-label multicenter trial to test pharmacological treatments for broken heart (takotsubo) syndrome Am. Heart J. 2023 257 33 40 10.1016/j.ahj.2022.11.010 36435233 83. Raposeiras-Roubín S. Núñez-Gil I.J. Jamhour K. Abu-Assi E. Conty D.A. Vedia O. Almendro-Delia M. Sionis A. Martin-Garcia A.C. Corbí-Pascual M. Long-term prognostic impact of beta-blockers in patients with Takotsubo syndrome: Results from the RETAKO Registry Rev. Port. Cardiol. 2023 42 237 246 10.1016/j.repc.2022.02.010 36634757 84. Almendro-Delia M. Núñez-Gil I.J. Lobo M. Andrés M. Vedia O. Sionis A. Martin-García A. Cruz Aguilera M. Pereyra E. Martín de Miguel I. Short- and Long-Term Prognostic Relevance of Cardiogenic Shock in Takotsubo Syndrome: Results From the RETAKO Registry JACC Heart Fail. 2018 6 928 936 10.1016/j.jchf.2018.05.015 30316938 85. D’Ascenzo F. Gili S. Bertaina M. Iannaccone M. Cammann V.L. Di Vece D. Kato K. Saglietto A. Szawan K.A. Frangieh A.H. Impact of aspirin on takotsubo syndrome: A propensity score-based analysis of the InterTAK Registry Eur. J. Heart Fail. 2020 22 330 337 10.1002/ejhf.1698 31863563 86. Rizzetto F. Lia M. Widmann M. Tavella D. Zanolla L. Pighi M. Ferrero V. Ribichini F.L. Prognostic impact of antiplatelet therapy in Takotsubo syndrome: A systematic review and meta-analysis of the literature Heart Fail. Rev. 2022 27 857 868 10.1007/s10741-021-10099-5 33779884 PMC9033728 87. Pereyra E. Fernández-Rodríguez D. González-Sucarrats S. Almendro-Delia M. Martín A. de Miguel I.M. Andrés M. Duran-Cambra A. Sánchez-Grande-Flecha A. Worner-Diz F. Antiplatelet therapy at discharge and long-term prognosis in Takotsubo syndrome: Insights from the Spanish National Registry (RETAKO) Rev. Port. Cardiol. 2022 41 919 927 10.1016/j.repc.2021.06.029 36241580 88. Novo G. Arcari L. Stiermaier T. Alaimo C. El-Battrawy I. Cacciotti L. Guerra F. Musumeci B. Mariano E. Parisi G. Statin therapy and outcome in Takotsubo syndrome patients: Results from the multicenter international GEIST registry Atherosclerosis 2024 389 117421 10.1016/j.atherosclerosis.2023.117421 38134646 89. Petursson P. Oštarijaš E. Redfors B. Råmunddal T. Angerås O. Völz S. Rawshani A. Hambraeus K. Koul S. Alfredsson J. Effects of pharmacological interventions on mortality in patients with Takotsubo syndrome: A report from the SWEDEHEART registry ESC Heart Fail. 2024 11 1720 1729 10.1002/ehf2.14713 38454651 PMC11098647 ",
  "metadata": {
    "Title of this paper": "Effects of pharmacological interventions on mortality in patients with Takotsubo syndrome: A report from the SWEDEHEART registry",
    "Journal it was published in:": "Journal of Personalized Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470797/"
  }
}