{
  "title": "Paper_352",
  "abstract": "pmc Surg Open Sci Surg Open Sci 3904 sopen Surgery Open Science 2589-8450 Elsevier PMC12483657 PMC12483657.1 12483657 12483657 41035490 10.1016/j.sopen.2025.09.008 S2589-8450(25)00083-1 1 Research Paper The association of malnutrition with clinical and financial outcomes of traumatic injuries in older adults: A national retrospective analysis Coaston Troy N. MSCR a Ali Konmal BS a Vadlakonda Amulya MD a Mehta Deep J. a Sakowitz Sara MD, MPH a Yalzadeh Dariush BS a Tillou Areti MD a b Benharash Peyman MD PBenharash@mednet.ucla.edu @CoreLabUCLA a b c ⁎ on behalf of the Academic Trauma Research Consortium (ATRIUM) 1 a b c ⁎ PBenharash@mednet.ucla.edu @CoreLabUCLA 1 Consortium Statement Academic Trauma Research Consortium (ATRIUM) members include: Galinos Barmparas MD, Peyman Benharash MD, Umar Bhatti MD, Megan Brenner MD, Nam Yong Cho BS, Jeff Choi MD MSC, Troy Coaston BS, Oh Jin Kwon MD, David Machado-Aranda MD, Saad Mallick MD, Aricia Shen MD, Areti Tillou MD, Zachary Tran MD, Amulya Vadlakonda BS 12 2025 17 9 2025 28 497998 13 18 29 5 2025 14 9 2025 15 9 2025 17 09 2025 01 10 2025 02 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background Malnutrition is an often underrecognized condition among older adults and carries significant relevance among patients hospitalized with traumatic injuries. The present study aimed to evaluate the association of malnutrition with clinical and financial outcomes among older adult patients admitted with external trauma. Study design This was a retrospective cohort study of the 2016–2021 National Inpatient Sample including older adults (≥65 years) hospitalized with traumatic injuries. Patients were stratified by nutritional status ( Malnourished Non-Malnourished Results Of 6,587,907 older adults admitted with traumatic injuries, 7.5 % had malnutrition. The prevalence of malnutrition rose from 5.8 % to 8.6 % over the study period (nptrend<0.001). Patients with malnutrition were more commonly of the lowest income quartile (25.5 vs 24.5 %), non-White (19.4 vs 16.9 %), and male (41.3 vs 39.1 %, all p Conclusion Malnutrition among older adults is associated with poorer clinical outcomes and increased financial burden. Rising prevalence and significant disparities underscore the need for increased screening and culturally relevant nutritional interventions to promote quality, equity, and sustainability in trauma care. Graphical abstract Unlabelled Image Highlights • Malnutrition affected 7.5 % of older adults hospitalized with traumatic injuries. • Malnourished patients had 92 % higher odds of inpatient mortality. • Malnutrition was linked to $7400 higher hospitalization costs. • Malnutrition reflects systemic gaps in equitable, preventive care for older adults. Keywords Malnutrition Older adult Trauma Costs Resource use Outcomes pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction By 2050, patients ≥65 years of age are projected to comprise nearly 40 % of all trauma-related hospitalizations [ 1 2 [3] [4] [5] 6 Age-related physiological changes notwithstanding, nutritional status remains a critical determinant of outcomes among trauma patients, with nearly 50 % of hospitalized older adults thought to be at risk for malnutrition [ [7] [8] [9] 9 2 8 9 10 2 11 12 The present study characterized the association of malnutrition with clinical and financial outcomes of hospitalization for trauma among older adults. We hypothesized malnourished status to be independently linked with increased risk-adjusted odds of mortality and complications as well as higher expenditure. Methods This was a retrospective cohort study of the 2016–2021 National Inpatient Sample (NIS). Maintained as part of the Healthcare Utilization Project, NIS is the largest publicly available all-payer inpatient repository in the U.S. [ 13 14 Fig. 1 Fig. 1 CONSORT Diagram. Fig. 1 Patient (age, sex, race, income, primary payer) and facility (bed size, teaching status, region) characteristics are reported in accordance with the NIS data dictionary [ 13 Malnutrition Non-Malnutrition 15 14 16 17 18 19 20 The primary outcome was inpatient mortality. We further examined factors associated with malnutrition, clinical complications, and makers of resource utilization which included inpatient costs, non-home discharge, inpatient length of stay (LOS). Patient and hospital factors are reported as proportions, means with standard deviations (SD), or medians with interquartile range (IQR), as appropriate. The significance of between-group differences was determined using the Pearson's Χ 2 21 22 2 Due to its deidentified nature, this study was deemed exempt from full review by the University of California, Los Angeles, Institutional Review Board. All statistical analyses were performed using Stata 18.0 (StataCorp, College Station, TX). Statistical significance was set at α = 0.05. Results Of an estimated 6,587,907 older adults admitted with traumatic injuries, 7.5 % comprised the Malnutrition . Fig. 2 , Malnutrition p p p Malnutrition Table 1 Fig. 2 Trend in rate of malnutrition among older adult patients with traumatic injuries. Fig. 2 Table 1 Demographic, clinical, and hospital characteristics of older adult trauma patients stratified by nutrition status. Table 1 Non-Malnutrition Malnutrition p-value Age (years, median [IQR]) 81 [73–87] 82 [74–88] <0.001 Female (%) 60.9 58.7 <0.001 Charlson Comorbidity Index (median [IQR]) 2 [1–3] 2 [1–4] <0.001 Modified Frailty Index-11 (mean ± SD) 2.7 ± 1.4 2.8 ± 1.4 <0.001 Injury Severity Scale (mean ± SD) 6.7 ± 7.8 6.4 ± 7.9 <0.001 Race (%) <0.001 White 83.1 80.6 Black 5.9 7.9 Hispanic 6.2 5.9 Asian 2.3 3.0 Other 2.5 2.6 Income quartile (%) <0.001 76-100th 23.8 23.6 51-75th 25.5 25.3 26-50th 26.1 25.6 0-25th 24.5 25.5 Insurance coverage (%) <0.001 Private 7.2 5.6 Medicare 89.2 90.9 Medicaid 1.1 1.3 Other payer 2.5 2.2 Mechanism of Injury (%) <0.001 Falls 92.8 96.2 Motor-Related 5.0 2.2 Penetrating 0.6 0.4 Other Blunt Mechanism 1.6 1.2 Hospital teaching status (%) <0.001 Non-metropolitan 8.9 7.5 Metropolitan non-teaching 21.5 21.2 Metropolitan teaching 69.6 71.3 Hospital bed size (%) <0.001 Large 49.6 51.0 Medium 29.9 29.3 Small 20.5 19.7 Reported as proportions unless otherwise noted. Statistical significance was set at p IQR Following risk-adjustment, increasing age (AOR 1.11 per decade, 95 % CI 1.10–1.13), Medicaid coverage (AOR 1.23, 95 % CI 1.15–1.33; ref.: Private), and Black race (AOR 1.31, 95 % CI 1.27–1.36; ref.: White) were associated with increased odds of malnutrition. Additional factors linked with malnutrition included fall as the primary mechanism of injury (AOR 2.07, 95 % CI 1.97–2.18; ref.: Motor-Related), increasing burden of comorbidities (Charlson: AOR 1.12 per unit, 95 % CI 1.11–1.12), and being of the lowest income quartile (AOR 1.12, 95 % CI 1.08–1.16; ref.: Highest; Fig. 3 Fig. 3 Factors associated with malnutrition among older adult patients admitted with traumatic injuries. Fig. 3 Fig. 4 Risk-adjusted incidence of inpatient complications among older adult patients with traumatic injuries stratified by nutrition status. Fig. 4 Table 2 Clinical and financial outcomes stratified by nutrition status. Table 2 Outcome Non-Malnutrition Malnutrition p-value AOR or β 95 % CI p-value In-hospital mortality (%, AOR) 3.2 6.4 <0.001 1.92 1.86–1.98 <0.001 Complications (%, AOR) Thromboembolic 0.9 1.5 <0.001 1.60 1.51–1.69 <0.001 Cardiac 5.1 7.4 <0.001 1.33 1.29–1.36 <0.001 Respiratory 7.6 13.4 <0.001 1.87 1.83–1.91 <0.001 Infectious 5.5 12.7 <0.001 2.30 2.25–2.35 <0.001 Length of stay (days, median, IQR, β) 4 [3–6] 6 [4–10] <0.001 3.27 3.19–3.35 <0.001 Inpatient costs ($1000's, median, IQR, β) $12.2 [$7.3–19.4] $15.6 [$9.2–26.7] <0.001 $7.4 $7.1–7.6 <0.001 Non-Home Discharge (%, AOR) 63.5 73.4 <0.001 1.60 1.57–1.63 <0.001 AOR, Adjusted Odds Ratio; CI, Confidence Interval; IQR, Interquartile Range. After multivariable adjustment for factors including frailty, malnutrition remained independently associated with increased odds of inpatient mortality (AOR 1.92, 95 % CI 1.86–1.98; model c-statistic = 0.72). Additionally, malnutrition increased the odds of infectious (AOR 2.30, 95 % CI 2.25–2.35), respiratory (AOR 1.87, 95 % CI 1.83–1.91), and cardiac complications (AOR 1.33, 95 % CI 1.29–1.36; Fig. 4 Table 2 Supplemental Table 1 Discussion With the aging U.S. population, surgeons and emergency care providers are increasingly faced with managing older trauma patients who face distinct physiologic challenges. Recent literature has prioritized identifying predictors of poor outcomes and increased costs in this complex population. In this national analysis, we found a rising prevalence of malnutrition in older trauma patients over the six-year study period. Malnutrition was disproportionately more common among individuals of lower income, non-White race, and with Medicaid coverage. Finally, malnutrition was linked with substantially greater resource use. Several of these findings warrant further discussion. Malnutrition was independently associated with adverse outcomes, even after adjusting for frailty. While this association aligns with previous smaller cohort studies [ 2 23 2 23 24 8 We noted significant disparities in nutritional status by race and income, echoing prior work regarding individual and structural-level determinants of malnutrition [ 25 26 [27] [28] [29] [30] [31] [32] [33] 34 [35] [36] [37] In the present study, we noted malnutrition to be linked with increased inpatient costs, longer hospitalizations, and higher rates of nonhome discharge. Recent estimates suggest $30 billion in expenditures attributable to trauma care in older adults [ 38 2 8 24 39 40 The present study has several important limitations. First, as an administrative database, the NIS is subject to variation in coding practices between centers. Additionally, there is limited granularity, with no data recorded for imaging findings or laboratory values, including albumin and pre-albumin levels. Importantly, in the NIS, we are unable to determine the timing of diagnosis, as such we cannot confirm definitively that malnutrition did not develop during hospitalization. However, in a supplemental analysis of the 2022 California State Inpatient Database, which includes data regarding the presence of a diagnosis upon admission [ 41 2 8 24 In summary, this study provides a contemporary national perspective on the association of malnutrition with clinical and financial outcomes among older adults with traumatic injuries. Malnutrition was independently associated with disproportionate morbidity, mortality, and financial burden. Given the aging demographic and rising cost of trauma care, understanding and addressing nutritional deficits is crucial. Our findings reinforce the need for early identification and intervention among this vulnerable population. Targeted strategies may improve recovery trajectories while promoting equity and sustainability in trauma care delivery. The following is the supplementary data related to this article. Supplemental Table 1 Clinical and financial outcomes stratified by nutrition status, excluding those admitted with falls. AOR, Adjusted Odds Ratio; CI, Confidence Interval; IQR, Interquartile Range. Supplemental Table 1 Funding/financial support This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors. CRediT authorship contribution statement Troy N. Coaston: Konmal Ali: Amulya Vadlakonda: Deep J. Mehta: Sara Sakowitz: Dariush Yalzadeh: Areti Tillou: Peyman Benharash: Ethics statement This work complies with the standards put forth by Elsevier's Publishing Ethics Policy. Declaration of competing interest Author PB received proctor fees from Atricure as a surgical proctor. All other others declare no financial or non-financial competing interests. References 1 Karam B.S. Patnaik R. Murphy P. Improving mortality in older adult trauma patients: are we doing better? J Trauma Acute Care Surg 92 2 2022 413 10.1097/TA.0000000000003406 34554138 2 Hosseinpour H. Anand T. Bhogadi S.K. The implications of poor nutritional status on outcomes of geriatric trauma patients Surgery 176 4 2024 1281 1288 10.1016/j.surg.2024.06.047 39060117 3 Hammer P.M. Storey A.C. Bell T. Improving geriatric trauma outcomes: a small step toward a big problem J Trauma Acute Care Surg 81 1 2016 162 10.1097/TA.0000000000001063 27032005 4 Stonko D.P. Etchill E.W. Giuliano K.A. Failure to rescue in geriatric trauma: the impact of any complication increases with age and injury severity in elderly trauma patients Am Surg 87 11 2021 1760 1765 10.1177/00031348211054072 34727744 5 Perdue P.W. Watts D.D. Kaufmann C.R. Trask A.L. Differences in mortality between elderly and younger adult trauma patients: geriatric status increases risk of delayed death J Trauma Acute Care Surg 45 4 1998 https://journals.lww.com/jtrauma/fulltext/1998/10000/differences_in_mortality_between_elderly_and.34.aspx 10.1097/00005373-199810000-00034 9783625 6 Panayi A.C. Orkaby A.R. Sakthivel D. Impact of frailty on outcomes in surgical patients: a systematic review and meta-analysis Am J Surg 218 2 2019 393 400 10.1016/j.amjsurg.2018.11.020 30509455 PMC6536365 7 Orlandoni P. Venturini C. Jukic Peladic N. Malnutrition upon hospital admission in geriatric patients: why assess it? Front Nutr 4 2017 10.3389/fnut.2017.00050 PMC5670098 29164125 8 Müller F.S. Meyer O.W. Chocano-Bedoya P. Impaired nutritional status in geriatric trauma patients Eur J Clin Nutr 71 5 2017 602 606 10.1038/ejcn.2017.25 28327565 9 Dijkink S. Meier K. Krijnen P. Yeh D.D. Velmahos G.C. Schipper I.B. Malnutrition and its effects in severely injured trauma patients Eur J Trauma Emerg Surg 46 5 2020 993 1004 10.1007/s00068-020-01304-5 31974669 PMC7593306 10 Gibbs J. Cull W. Henderson W. Daley J. Hur K. Khuri S.F. Preoperative serum albumin level as a predictor of operative mortality and morbidity: results from the national VA surgical risk study Arch Surg 134 1 1999 36 42 10.1001/archsurg.134.1.36 9927128 11 Garwe T. Albrecht R.M. Stoner J.A. Mitchell S. Motghare P. Hypoalbuminemia at admission is associated with increased incidence of in-hospital complications in geriatric trauma patients Am J Surg 212 1 2016 109 115 10.1016/j.amjsurg.2015.06.013 26414690 PMC4821821 12 Gentile S. Lacroix O. Durand A.C. Malnutrition: a highly predictive risk factor of short-term mortality in elderly presenting to the emergency department J Nutr Health Aging 17 4 2013 290 294 10.1007/s12603-012-0398-0 23538647 13 Healthcare Cost and Utilization Project (HCUP). Overview of the national (nationwide) inpatient sample (NIS). Agency for Healthcare Research and Quality. 14 Tran Z. Madrigal J. Pan C. Impact of opioid use disorder on resource utilization and readmissions after operative trauma Surgery 171 2 2022 541 548 10.1016/j.surg.2021.06.025 34294450 15 Doley J. Phillips W. Coding for malnutrition in the hospital: does it change reimbursement? Nutr Clin Pract 34 6 2019 823 831 10.1002/ncp.10426 31650622 16 Subramaniam A. Ueno R. Tiruvoipati R. Defining ICD-10 surrogate variables to estimate the modified frailty index: a Delphi-based approach BMC Geriatr 22 1 2022 422 10.1186/s12877-022-03063-x 35562684 PMC9107186 17 Sundararajan V. Henderson T. Perry C. Muggivan A. Quan H. Ghali W.A. New ICD-10 version of the Charlson comorbidity index predicted in-hospital mortality J Clin Epidemiol 57 12 2004 1288 1294 10.1016/j.jclinepi.2004.03.012 15617955 18 Clark D.E. Black A.W. Skavdahl D.H. Hallagan L.D. Open-access programs for injury categorization using ICD-9 or ICD-10 Inj Epidemiol 5 1 2018 11 10.1186/s40621-018-0149-8 29629480 PMC5890002 19 Coaston T.N. Curry J. Vadlakonda A. Center-level variation in the development of acute kidney injury following cardiac operations CJC Open 2025 10.1016/j.cjco.2025.04.003 Published online PMC12198644 40586015 20 Using Appropriate Price Indices for Analyses of Health Care Expenditures or Income Across Multiple Years. 21 Cuzick J. A wilcoxon-type test for trend Stat Med 4 1 1985 87 90 10.1002/sim.4780040112 3992076 22 Zou H. Hastie T. Regularization and variable selection via the elastic net J R Stat Soc Series B Stat Methodol 67 2 2005 301 320 10.1111/j.1467-9868.2005.00503.x 23 Kregel H.R. Murphy P.B. Attia M. The geriatric nutritional risk index as a predictor of complications in geriatric trauma patients J Trauma Acute Care Surg 93 2 2022 https://journals.lww.com/jtrauma/fulltext/2022/08000/the_geriatric_nutritional_risk_index_as_a.7.aspx 10.1097/TA.0000000000003588 PMC9329178 35293374 24 Maurer E. Wallmeier V. Reumann M.K. Risk of malnutrition in orthopedic trauma patients with surgical site infections is associated with increased morbidity and mortality – a 3-year follow-up study Injury 51 10 2020 2219 2229 10.1016/j.injury.2020.06.019 32620329 25 Wahid N. Badaracco C. Valladares A.F. Depriest A. Collins A. Mitchell K. The role of inpatient malnutrition care to address health disparities among older adults J Acad Nutr Diet 122 10, Supplement 2022 S28 S33 10.1016/j.jand.2022.06.015 36122956 26 Sadarangani T.R. Lydia M. Gary Y. Chau T.S. Brody A. Racial disparities in nutritional risk among community-dwelling older adults in adult day health care J Nutr Gerontol Geriatr 38 4 2019 345 360 10.1080/21551197.2019.1647327 31361195 PMC6813810 27 Wood E.K. Stamos G. Mitchell A.J. The association between food desert severity, socioeconomic status, and metabolic state during pregnancy in a prospective longitudinal cohort Sci Rep 13 1 2023 7197 10.1038/s41598-023-32783-2 37137940 PMC10156695 28 Gordon C. Purciel-Hill M. Ghai N.R. Kaufman L. Graham R. Van Wye G. Measuring food deserts in New York City’s low-income neighborhoods Health Place 17 2 2011 696 700 10.1016/j.healthplace.2010.12.012 21256070 29 Odoms-Young A. Brown A.G.M. Agurs-Collins T. Glanz K. Food insecurity, neighborhood food environment, and health disparities: state of the science, research gaps and opportunities Am J Clin Nutr 119 3 2024 850 861 10.1016/j.ajcnut.2023.12.019 38160801 PMC10972712 30 Aris I.M. Wu A.J. Lin P.I.D. Neighborhood food access in early life and trajectories of child body mass index and obesity JAMA Pediatr 178 11 2024 1172 1182 10.1001/jamapediatrics.2024.3459 39283628 PMC11406455 31 Engler-Stringer Rachel Fuller Daniel Abeykoon A.M. Hasanthi Olauson Caitlin Muhajarine Nazeem An examination of failed grocery store interventions in former food deserts Health Educ Behav 46 5 2019 749 754 10.1177/1090198119853009 31216883 32 Cantor J. Beckman R. Collins R.L. Dastidar M.G. Richardson A.S. Dubowitz T. SNAP participants improved food security and diet after a full-service supermarket opened in an urban food desert Health Aff 39 8 2020 1386 1394 10.1377/hlthaff.2019.01309 PMC8237564 32744934 33 Gany F. Melnic I. Wu M. Food to overcome outcomes disparities: a randomized controlled trial of food insecurity interventions to improve cancer outcomes J Clin Oncol 40 31 2022 3603 3612 10.1200/JCO.21.02400 35709430 PMC9622577 34 McWhorter J.W. Danho M.P. LaRue D.M. Barriers and facilitators of implementing a clinic-integrated food prescription plus culinary medicine program in a low-income food insecure population: a qualitative study J Acad Nutr Diet 122 8 2022 1499 1513 10.1016/j.jand.2021.11.016 34839026 35 Livingstone K.M. Love P. Mathers J.C. Kirkpatrick S.I. Olstad D.L. Cultural adaptations and tailoring of public health nutrition interventions in indigenous peoples and ethnic minority groups: opportunities for personalised and precision nutrition Proc Nutr Soc 82 4 2023 478 486 10.1017/S002966512300304X 37334485 36 Shapiro J. Grajower M.M. The influence of diverse cultures on nutrition, diabetes management and patient education Nutrients 16 21 2024 10.3390/nu16213771 PMC11548221 39519604 37 Katre A. Raddatz B. Low-income families’ direct participation in food-systems innovation to promote healthy food behaviors Nutrients 15 5 2023 10.3390/nu15051271 PMC10005603 36904271 38 Fakhry S.M. Shen Y. Biswas S. The public health burden of geriatric trauma: analysis of 2,688,008 hospitalizations from centers for medicare and medicaid services inpatient claims J Trauma Acute Care Surg 92 2022 984 989 10.1097/TA.0000000000003572 Lippincott Williams and Wilkins 35125447 39 Wang S. Shafrin J. Kerr K.W. Schuetz P. Health economic value of postacute oral nutritional supplementation in older adult medical patients at risk for malnutrition: a US-based modelling approach BMJ Open 14 11 2024 e086787 10.1136/bmjopen-2024-086787 PMC11574475 39551592 40 Williams D.G.A. Ohnuma T. Haines K.L. Association between early postoperative nutritional supplement utilisation and length of stay in malnourished hip fracture patients Br J Anaesth 126 3 2021 730 737 10.1016/j.bja.2020.12.026 33516455 41 Healthcare Cost and Utilization Project (HCUP). Overview of the State Inpatient Databases (SID). Agency for Healthcare Research and Quality. 21413206 ",
  "metadata": {
    "Title of this paper": "Association between early postoperative nutritional supplement utilisation and length of stay in malnourished hip fracture patients",
    "Journal it was published in:": "Surgery Open Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483657/"
  }
}