{
  "title": "Paper_68",
  "abstract": "pmc J Diabetes Investig J Diabetes Investig 2358 jdi JDI Journal of Diabetes Investigation 2040-1116 2040-1124 Wiley PMC12489336 PMC12489336.1 12489336 12489336 40765484 10.1111/jdi.70122 JDI70122 JDI-OA-2024-0856.R1 1 Original Article Articles Clinical Science and Care Alcohol consumption, alcohol‐metabolizing enzyme genotypes, and glycemic control in type 2 diabetes: Sex‐specific findings from the Fukuoka Diabetes Registry Alcohol, genotypes, and glycemia by sex Ohkuma et al. Ohkuma Toshiaki https://orcid.org/0000-0001-8105-7102  1 okuma.toshiaki.704@m.kyushu-u.ac.jp Iwase Masanori  1  2 Oshiro Ayaka  1 Higashi Taiki  1 Kitazono Takanari  1   1 Department of Medicine and Clinical Science, Graduate School of Medical Sciences Kyushu University Fukuoka Japan   2 Diabetes Center Hakujyuji Hospital Fukuoka Japan * Correspondence okuma.toshiaki.704@m.kyushu-u.ac.jp 06 8 2025 10 2025 16 10 498158 10.1111/jdi.v16.10 1941 1949 18 4 2025 23 12 2024 11 6 2025 06 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s). Journal of Diabetes Investigation https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Aims/Introduction The sex‐specific association between alcohol consumption and glycemic level and whether the association differs by genetic susceptibility to alcohol is unclear. The present study aimed to examine the association of alcohol consumption and genetic variants in alcohol‐metabolizing enzymes with glycemic level, as well as their sex differences, in East Asian individuals with type 2 diabetes. Materials and Methods In total, 4,923 Japanese individuals with type 2 diabetes were included. Participants were classified based on alcohol drinking status, alcohol consumption amount (<20, 20–39, or ≥40 g/day), and ADH1B (rs1229984) and ALDH2 (rs671) genotype, and the associations with HbA 1c Results In men, compared with never drinkers, an increase in the alcohol consumption amount was associated with a decrease in HbA 1c P 1c 1c 1c P 1c 1c Conclusions These findings highlight the importance of a sex‐specific approach to alcohol drinking habits in managing glycemic control for individuals with type 2 diabetes, irrespective of genetic predisposition to alcohol metabolism. In East Asian individuals with type 2 diabetes, increases in alcohol consumption were inversely associated with HbA1c levels in men, whereas the amount of alcohol consumption was associated with HbA1c levels in a J‐shaped manner in women. The alcohol–HbA1c associations were similarly observed, regardless of genetic susceptibility to alcohol metabolism. The present findings highlight the importance of a sex‐specific approach to alcohol drinking habits in the clinical practice of diabetes management, irrespective of the genetic predisposition to alcohol metabolism. Alcohol consumption ALDH2 genotype Sex differences Japan Diabetes Society 10.13039/501100008644 Japan Association for Diabetes Education and Care 10.13039/100016573 Japan Diabetes Foundation 10.13039/501100012627 Japan Society for the Promotion of Science 10.13039/501100001691 Daiwa Securities Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:02.10.2025 INTRODUCTION Glycemic control is a fundamental part of diabetes management to prevent diabetic complications  1  1  1  2  3  4  5  6  6 Alcohol is metabolized to acetaldehyde by alcohol dehydrogenase (ADH) and is further metabolized to acetate by aldehyde dehydrogenase (ALDH). Aldehyde dehydrogenase‐2 (ALDH2) is a key enzyme involved in the detoxification of acetaldehyde  7  7  7  8  9  10  11  12  13 The present study thus aimed to examine the associations of alcohol consumption and genetic variants in alcohol‐metabolizing enzymes with glycemic control, as well as their sex differences in East Asian individuals with type 2 diabetes. In addition, we examined whether the association between alcohol consumption and glycemic control differs by ADH1B and ALDH2 genotype. METHODS Study design and population The Fukuoka Diabetes Registry is a multicenter prospective cohort study that was designed to examine the influence of contemporary treatments on the prognosis of individuals with diabetes regularly attending teaching hospitals or diabetes clinics certified by the Japan Diabetes Society in Fukuoka Prefecture, Japan  14 Clinical evaluation and laboratory measurements Participants completed a self‐administered questionnaire regarding their medical history, medication use, and lifestyle factors, including alcohol drinking habits, dietary habits, smoking, and leisure‐time physical activity (LTPA). Dietary habits were assessed using a brief‐type self‐administered diet history questionnaire (Gender Medical Research Inc., Tokyo, Japan) based on the frequency of consumption of 58 items, which has been validated for ranking nutrient intakes in Japanese adults  15 n n  15  16  17 1c 2  18 Statistical analysis Participant characteristics based on alcohol drinking status and ADH1B and ALDH2 genotypes are presented as the mean (standard deviation) for continuous variables and number (percentage) for categorical variables. Differences in characteristics between women and men were analyzed by analysis of variance or χ 2 1c 1c 1c P RESULTS The clinical characteristics of study participants based on alcohol drinking status are shown in Table 1 Table 1 Baseline characteristics based on alcohol drinking status Variable Alcohol drinking status  P Never Former Current Number of participants 2,248 749 1,926 Age (years) 65.8 (10.7) 66.7 (10.0) 64.4 (9.7) <0.001 Women (%) 70.6 26.2 18.2 <0.001 Duration of diabetes mellitus (years) 14.8 (10.2) 16.0 (11.2) 16.3 (10.5) <0.001 Current smoking (%) 12.1 19.5 25.8 <0.001 Total energy intake (kcal/day) 1,569 (445) 1,673 (496) 1,837 (508) <0.001 Total dietary fiber intake (g/1,000 kcal) 8.1 (2.2) 7.9 (2.3) 6.9 (2.0) <0.001 LTPA (MET·h/w) 10.2 (13.9) 12.9 (15.7) 13.0 (15.6) <0.001 BMI (kg/m 2 24.0 (4.2) 23.4 (3.7) 23.6 (3.3) <0.001 Oral hypoglycemic agent use (%) 64.5 58.0 64.1 0.004 Insulin use (%) 31.3 33.6 24.1 <0.001 Amount of alcohol consumption (g/day) 20.6 (23.7) Values shown as mean (SD) for continuous variables and as percentage for categorical variables. Amount of alcohol consumption was derived from current drinkers without missing values on the amount. BMI, body mass index; LTPA, leisure‐time physical activity; MET h/w, metabolic equivalent hours per week. The corresponding characteristics based on ADH1B and ALDH2 genotype are indicated in Tables S1 S2 P P P The age‐ and sex‐adjusted mean values of HbA 1c S1 1c 1c 1c S2 Next, dose–response relationships between the amount of alcohol consumption and HbA 1c 1 1c P 1a 1c 1c 1c 1b S3 1c,d 1c 1c Figure 1 Association between amount of alcohol consumption and HbA 1c Next, the association between SNPs in the alcohol‐metabolizing enzymes ADH1B and ALDH2 and glycemic control was evaluated (Figure 2 1c P 1c P S4 1c S5 P Figure 2 Age‐ and sex‐adjusted mean values of HbA 1c P Finally, we examined whether the association between alcohol consumption and glycemic control was modified by genetic background (Figure 3 3 P 1c P Figure 3 Joint association between alcohol consumption and genetic variants in alcohol‐metabolizing enzymes with HbA 1c P P P DISCUSSION The present study, conducted with East Asian individuals with type 2 diabetes, clearly showed sex differences in the association between alcohol consumption and glycemic control. The amount of alcohol consumption was linearly associated with decreased HbA 1c 1c Previous meta‐analyses of observational studies showed the J‐shaped association between alcohol intake and the risk of type 2 diabetes; there was a decreased risk with a moderate amount of alcohol intake compared with abstainers, while there was an increased risk with heavy drinking  9  4 1c  4  3 1c The reason for the inconsistencies with the previous findings was unclear, but it may be due to sex differences in alcohol pharmacokinetics. The lower first‐pass metabolism of alcohol  19  6  6  20  21  20  21  6  3  4 In terms of alcohol‐metabolizing enzymes, several studies examined the association between the ALDH2 genotype and diabetes. A meta‐analysis of genome‐wide association studies conducted in East Asian individuals showed that ALDH2 genetic polymorphism was associated with type 2 diabetes in men but not in women  8  12  22  8  11 1c S4  8  7  23  24  10  11  12  10  12  11 Several previous studies examined whether the effects of alcohol consumption on glycemic levels were modified by genetic susceptibility to alcohol. A population‐based cohort study in Chinese older participants found a J‐shaped association between alcohol drinking and the risk of type 2 diabetes, and the association did not vary by genetic polymorphisms of the ADH1B and ALDH2 genes  25  12  11  11 1c 3  26 The strengths of the current study include the recruitment of the study population from East Asia, where individuals with diabetes are rapidly increasing and genetic variants in the ADH1B and ALDH2 genes are highly prevalent. In addition, the separate assessment of men and women enabled us to clarify sex differences in the association between alcohol consumption and glycemic control. Furthermore, the relatively large number of participants allowed us to adjust for multiple confounders, including dietary factors and physical activity. Although these habits were closely related to both alcohol drinking and glycemic levels, few studies have considered them as confounding factors. The uniform collection of blood samples and their measurement in a central laboratory minimized the potential for measurement errors. However, some limitations should be discussed. First, all the participants were recruited from the Kyushu region, Japan. The prevalence of ALDH2 polymorphisms varies not only by ethnicity but also by region, even within Japan  27  28 In conclusion, increases in alcohol consumption were inversely associated with HbA 1c 1c 1c DISCLOSURE The authors declare that they have no competing interests. Approval of the research protocol: The Kyushu University institutional review board. Informed consent: Written informed consent was obtained from all the participants. Registry and the registration no. of the study/trial: Approval number 290, date January 4, 2008. UMIN Clinical Trial Registry 000002627. Animal studies: N/A. Supporting information  Table S1  Table S2  Figure S1  Figure S2  Figure S3 1c  Figure S4 1c  Figure S5 1c ACKNOWLEDGMENTS We acknowledge the late Hiroki Fujii for his critical contributions to the Fukuoka Diabetes Registry study. The authors thank Drs. Toshiharu Ninomiya, Dongchon Kang, Shuzo Kumagai, Atushi Hirano, Yoichiro Hirakawa, Shinako Kaizu‐Ogata, Akiko Sumi, Tamaki Jodai‐Kitamura, Yuji Komorita, Ai Murao‐Kimura, Yutaro Oku, Wakako Sakamoto, Mika Fujihira, Ichika Ohmura (Kyushu University), Michiaki Kubo (Center for Integrative Medical Sciences, RIKEN), Nobuhiro Sasaki, Hirofumi Imoto (Fukuoka Red Cross Hospital), Kiyohide Nunoi, Yuichi Sato, Yuji Uchizono, Kaori Itoh (St. Mary's Hospital), Udai Nakamura (Steel Memorial Yawata Hospital), Daisuke Gotoh (Kyushu Central Hospital), Sakae Nohara, Ayako Tsutsumi (Fukuoka Higashi Medical Center), Yasuhiro Idewaki, Hitoshi Ide (Hakujyuji Hospital), Masae Minami (Clinic Minami Masae), Miya Wada (Wada Miya Naika Clinic), Yoshifumi Yokomizo (Yokomizo Naika Clinic), Masanori Kikuchi, Yohei Kikuchi (Kikuchi Naika Clinic), Riku Nomiyama (Suzuki Naika Clinic), Shin Nakamura (Nakamura Naika Clinic), Kenji Tashiro (Oshima Eye Hospital), Mototaka Yoshinari, Masahito Yoshinari (Yoshinari Naika Clinic), Kojiro Ichikawa (Fukutsu Naika Clinic), and Yutaka Kiyohara (Hisayama Research Institute For Lifestyle Diseases). The authors also thank the clinical research coordinators, Chiho Ohba (Kyushu University), and those in the administration office, Tomoko Matake (Hisayama Research Institute For Lifestyle Diseases) and Mitsuko Kojima (Kyushu University). We thank Jenna MacArthur, PhD, from Edanz ( https://jp.edanz.com/ac REFERENCES 1 American Diabetes Association Standards of medical care in diabetes‐2024 Diabetes Care 2024 47 Suppl 1 S1 S4 15618112 2 The Japan Diabetes Society Japanese clinical practice guideline for diabetes 2024 [in Japanese] 2024 3 Ye Q Ouyang X Qin Z et al The association between alcohol drinking and glycemic management among people with type 2 diabetes in China J Diabetes Investig 2024 15 237 244 10.1111/jdi.14108 PMC10804902 37985393 4 Ahmed AT Karter AJ Warton EM et al The relationship between alcohol consumption and glycemic control among patients with diabetes: the Kaiser Permanente Northern California Diabetes Registry J Gen Intern Med 2008 23 275 282 18183468 10.1007/s11606-007-0502-z PMC2359478 5 Ben G Gnudi L Maran A et al Effects of chronic alcohol intake on carbohydrate and lipid metabolism in subjects with type II (non‐insulin‐dependent) diabetes Am J Med 1991 90 70 76 1986593 10.1016/0002-9343(91)90508-u 6 Erol A Karpyak VM Sex and gender‐related differences in alcohol use and its consequences: contemporary knowledge and future research considerations Drug Alcohol Depend 2015 156 1 13 26371405 10.1016/j.drugalcdep.2015.08.023 7 Zhang J Guo Y Zhao X et al The role of aldehyde dehydrogenase 2 in cardiovascular disease Nat Rev Cardiol 2023 20 495 509 36781974 10.1038/s41569-023-00839-5 8 Spracklen CN Horikoshi M Kim YJ et al Identification of type 2 diabetes loci in 433,540 East Asian individuals Nature 2020 582 240 245 32499647 10.1038/s41586-020-2263-3 PMC7292783 9 Knott C Bell S Britton A Alcohol consumption and the risk of type 2 diabetes: a systematic review and dose‐response meta‐analysis of more than 1.9 million individuals from 38 observational studies Diabetes Care 2015 38 1804 1812 26294775 10.2337/dc15-0710 10 Suzuki Y Ando F Ohsawa I et al Association of alcohol dehydrogenase 2*1 allele with liver damage and insulin concentration in the Japanese J Hum Genet 2006 51 31 37 16307179 10.1007/s10038-005-0318-9 11 Dakeishi M Murata K Sasaki M et al Association of alcohol dehydrogenase 2 and aldehyde dehydrogenase 2 genotypes with fasting plasma glucose levels in Japanese male and female workers Alcohol Alcohol 2008 43 143 147 18216179 10.1093/alcalc/agm173 12 Yin G Naito M Wakai K et al ALDH2 polymorphism is associated with fasting blood glucose through alcohol consumption in Japanese men Nagoya J Med 2016 78 183 193 PMC4885818 27303105 13 International Diabetes Federation IDF Diabetes Atlas 10th edn Belgium International Diabetes Federation www.diabetesatlas.org 14 Ohkuma T Fujii H Iwase M et al Impact of eating rate on obesity and cardiovascular risk factors according to glucose tolerance status: the Fukuoka Diabetes Registry and the Hisayama Study Diabetologia 2013 56 70 77 23064292 10.1007/s00125-012-2746-3 15 Kobayashi S Honda S Murakami K et al Both comprehensive and brief self‐administered diet history questionnaires satisfactorily rank nutrient intakes in Japanese adults J Epidemiol 2012 22 151 159 22343326 10.2188/jea.JE20110075 PMC3798594 16 Centers for Disease Control and Prevention About moderate alcohol use https://www.cdc.gov/alcohol/about‐alcohol‐use/moderate‐alcohol‐use.html 17 Ainsworth BE Haskell WL Whitt MC et al Compendium of physical activities: an update of activity codes and MET intensities Med Sci Sports Exerc 2000 32 9 Suppl S498 S504 10993420 10.1097/00005768-200009001-00009 18 Ohnishi Y Tanaka T Ozaki K et al A high‐throughput SNP typing system for genome‐wide association studies J Hum Genet 2001 46 471 477 11501945 10.1007/s100380170047 19 Greaves L Poole N Brabete AC Sex, gender, and alcohol use: implications for women and low‐risk drinking guidelines Int J Environ Res Public Health 2022 19 4523 35457389 10.3390/ijerph19084523 PMC9028341 20 Kim SJ Kim DJ Alcoholism and diabetes mellitus Diabetes Metab J 2012 36 108 115 22540046 10.4093/dmj.2012.36.2.108 PMC3335891 21 World Health Organization Global Status Report on Alcohol and Health 2018 Geneva World Health Organization https://www.who.int/publications/i/item/9789241565639 22 Wang D Zou Y Yu S et al The effect of ALDH2 rs671 gene mutation on clustering of cardiovascular risk factors in a big data study of Chinese population: associations differ between the sexes BMC Cardiovasc Disord 2020 20 509 33276716 10.1186/s12872-020-01787-5 PMC7716427 23 Xu Y Yuan Q Cao S et al Aldehyde dehydrogenase 2 inhibited oxidized LDL‐induced NLRP3 inflammasome priming and activation via attenuating oxidative stress Biochem Biophys Res Commun 2020 529 998 1004 32819611 10.1016/j.bbrc.2020.06.075 24 Li SY Gilbert SA Li Q et al Aldehyde dehydrogenase‐2 (ALDH2) ameliorates chronic alcohol ingestion‐induced myocardial insulin resistance and endoplasmic reticulum stress J Mol Cell Cardiol 2009 47 247 255 19344727 10.1016/j.yjmcc.2009.03.017 PMC2703697 25 Li MJ Ren J Zhang WS et al Association of alcohol drinking with incident type 2 diabetes and pre‐diabetes: the Guangzhou Biobank Cohort Study Diabetes Metab Res Rev 2022 38 e3548 35585795 10.1002/dmrr.3548 26 Ballard HS The hematological complications of alcoholism Alcohol Health Res World 1997 21 42 52 15706762 PMC6826798 27 Miyamori D Tanaka Y Ishikawa N et al Population history in Okinawa based on JC virus and ALDH2 genotypes Sci Rep 2020 10 7331 32355181 10.1038/s41598-020-64194-y PMC7192937 28 Greenfield TK Bond J Kerr WC Biomonitoring for improving alcohol consumption surveys: the new gold standard? Alcohol Res 2014 36 39 45 26258999 PMC4432857 ",
  "metadata": {
    "Title of this paper": "Biomonitoring for improving alcohol consumption surveys: the new gold standard?",
    "Journal it was published in:": "Journal of Diabetes Investigation",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489336/"
  }
}