{
  "title": "Paper_580",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12477458 PMC12477458.1 12477458 12477458 41030738 10.7759/cureus.91213 1 Hematology Pathology Role of Complement Anaphylatoxins (C3a and C5a) in Lymphoma: A Systematic Review Muacevic Alexander Adler John R Skarentzos Konstantinos 1 Vryttia Pinelopi 2 Papageorgiou Sotiris 2 Foukas Periklis 1  1  2 Konstantinos Skarentzos k.skarentzos@gmail.com 28 8 2025 8 2025 17 8 494304 e91213 26 8 2025 28 08 2025 30 09 2025 01 10 2025 Copyright © 2025, Skarentzos et al. 2025 Skarentzos et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/399516-role-of-complement-anaphylatoxins-c3a-and-c5a-in-lymphoma-a-systematic-review Tumor cell survival, growth, and proliferation are related to the interactions between tumor cells and immune cells. Anaphylatoxins C3a and C5a seem to be involved in these cell-to-cell interactions. The aim of this study is to investigate whether the increase of C3a and/or C5a levels induces the proliferation of lymphoma cells. The population consisted of naïve lymphoma patients or human lymphoma cell lines. Comparisons of C3a and C5a levels between lymphoma patients and a healthy control group and between lymphoma cell lines and control media were acceptable. Studies that demonstrated outcomes regarding patients' survival and the growth and proliferation of lymphoma cells were included. A search was conducted on MEDLINE (through PubMed), Cochrane, and Scopus on January 2, 2025. Two independent reviewers performed the quality assessment using the Oral Health Assessment Tool (OHAT) modified for in vitro studies. Results were descriptively presented. Through a search of the aforementioned libraries, 852 studies were identified. Four studies were eligible: two studies used only cell lines, one used a cell line and paraffin blocks from 58 patients, and the other used serum from 39 naïve B-cell lymphoma patients. Regarding in vitro studies, it was shown that C5a induced neutrophil-mediated antibody-dependent tumor cell lysis. Elevated levels of C5a in co-culture with M2 macrophages lead to increased lymphoma cell proliferation, and patients with high densities of M2 macrophages in the tumor microenvironment (TME) had poor prognosis. Regarding the limitations of this review, only a few articles were found to study this hypothesis. Evidence of a correlation between anaphylatoxin levels and lymphoma cell proliferation raises the need for further investigation in order to understand the role of complement in B-cell lymphoma development and progression. In summary, anaphylatoxins, especially C5a, appear to play a role in the activation of lymphoma cells both as mediators in cell-cell interaction and as auxiliary molecules for the lysis of these cells via antibody-dependent cellular cytotoxicity. anaphylatoxins c3a c5a complement lymphoma pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction and background The tumor microenvironment (TME) plays a determinative role in tumor survival and progression through a constant interaction between cancer cells and proximal immune cells. Regarding innate immunity, macrophages can be polarized into M1 or M2 functional states, with the latter causing immunosuppression through the secretion of cytokines (like IL-4) in the TME. Similarly, N2 neutrophils promote tumor growth. Depending on the signals from the TME, tumor-infiltrating dendritic cells (TIDCs) could stimulate Th2, Th17, and T regulatory responses, enhancing tumor suppression [ 1 Anaphylatoxins are small protein fragments formed by a series of enzymatic reactions that take place during the complement cascade: the activation of classical, lectin, or alternative pathway causes the formation of C3a and C5a. Specifically, C3 convertases (C4b2b) cleave C3 in order to generate the anaphylatoxin C3a and the opsonin C3b. C5 convertases (C4b2b3b and C3bBb3b) are formed by the excess of C3b and cleave C5 to generate C5a and C5b. C5a is a strong chemoattractant and plays a significant role in the recruitment of inflammatory cells, in the activation of phagocytic cells and release of granule-based enzymes, and in the generation of oxidants, all of which may lead to innate immune functions or tissue damage [ 2 3 Previous studies have demonstrated several interconnections between the complement system and cancer. Activation of the complement system in the TME is proven to enhance tumor growth via several immune and non-immune functions in both plasma and extravascular interstitial tissue [ 4 5 Lymphomas, the malignant neoplasms of lymphocytes, are classified broadly as Hodgkin and non-Hodgkin, with more than 100 entities in the last World Health Organization (WHO) classification. Because of the heterogeneity of this malignancy, lymphoma patients may present with various symptoms. Nevertheless, a \"typical\" lymphoma patient usually presents with painless lymphadenopathy, fever, weight loss, and night sweats. Lymphomas with a high proliferation index are associated with poor prognosis. Usually, this malignancy is diagnosed by a lymph node biopsy, but lymphoma could also affect the bone marrow or extranodal tissues [ 6 7 8 Review Methods Eligibility Criteria The protocol for this systematic review received approval from the International Prospective Register of Systematic Reviews (PROSPERO) (registration number: CRD420250654200). The inclusion criteria were based on the PICO (Population, Intervention, Comparison, and Outcome) model. The population consisted of lymphoma patients or human lymphoma cell lines. Since our aim was to study the pathophysiology of the disease, every intervention that could interfere with C3a or C5a was excluded (e.g., administration of immunotherapy). Comparisons of C3a and C5a levels between lymphoma patients and a healthy control group and between lymphoma cell lines and control media were acceptable. Studies that demonstrated outcomes regarding patients' survival and the growth and proliferation of lymphoma cells were included. Articles written only in English were accepted. On the other hand, studies about animal models and genomes were excluded. Studies that provide data about C3a and C5a levels in relation to drug reactions in lymphoma patients were excluded. Moreover, conference abstracts and other non-peer-reviewed studies were excluded. Editorials, short communications, case report studies, and case series were excluded. For obvious reasons, other systematic reviews and any other kind of review were excluded. Search Strategy, Selection Process, and Data Extraction A thorough search was conducted on MEDLINE (through PubMed), Cochrane, and Scopus. We searched articles from inception until January 2, 2025. The following search strategy was used: \"(C3a OR C3aR OR C5a OR C5aR OR Anaphylatoxin OR complement peptide) AND lymphoma\". Two reviewers, blinded to each other's decisions, performed title and abstract screening according to the aforementioned eligibility criteria. Any conflict was resolved by discussion. Then, full-text screening was independently conducted by the same two reviewers. Reasons for exclusion were reported, and consensus was reached via conversation. Data extraction was performed by K.S. and P.V., again blinded to each other's decisions. Data were collected about authors' names and affiliations, year of publication, population demographics, human lymphoma cell lines' characteristics, experimental procedures (e.g., co-culture with lymphoma cell lines and macrophages), survival rates of lymphoma patients, C3a and C5a levels, and lymphoma cells' growth, proliferation, apoptosis, and nuclear size. Since the extracted data did not qualify for meta-analysis, a narrative synthesis was applied. Risk of Bias Two reviewers (K.S. and P.V.) independently performed the quality assessment using the Oral Health Assessment Tool (OHAT) [ 9 10 EndNote™ 20 (Clarivate, London, United Kingdom) was used as the citation manager [ 11 Results Study Selection From the initial application of the aforementioned search algorithm, 852 studies were identified, of which 91 were duplicates. After duplicate removal, 761 articles remained. The articles that met our inclusion criteria in title and abstract screening were 15. At last, four studies were included in this systematic review after the process of full-text screening, with specific reasons for every excluded article (Figure 1 Figure 1 PRISMA flowchart PRISMA: Preferred Reporting Items for Systematic Reviews and Meta-Analyses Study Characteristics and Results of Individual Studies Four studies were included in this systematic review. The studies' characteristics are mentioned in Table 1 12 13 14 15 Table 1 Characteristics and results of the individual studies Stat3: signal transducer and activator of transcription 3; BrdU: macrophage marker; Lym-1: a murine IgG2a monoclonal antibody that recognizes B-cell lymphoma cells; ATLL: adult T-cell leukemia/lymphoma; N/A: not applicable; PMN: polymorphonuclear neutrophil Author (year) Population Cell lines Cells studied Anaphylatoxins and other molecules studied Methods Main outcomes Bai et al. (2013) [ 12 Cell lines (in vitro) SLVL, Raji, Daudi Lymphoma cells, M1, M2 C5a Stat3 Lymphoma cell lines (SLVL, Raji, and Daudi) were cultured alone or co-cultured with immature, M1, or M2 macrophages. The number of macrophages (using BrdU), lymphoma cells' nuclei size and proliferation, and Stat3 and C5a levels were studied (1) Co-culture with M2 macrophages significantly induced BrdU incorporation (2) Co-culture with M2 macrophages significantly increased lymphoma cells' nuclei size (3) Lymphoma cell proliferation was elevated in co-culture with immature, M1 or M2 macrophages (4) Elevated C5a levels in co-culture with M2 macrophages activated Stat3 and increased lymphoma cell proliferation (5) Stat3 downregulation suppressed lymphoma cell activation by C5a Ottonello et al. (1996) [ 13 Cell lines (in vitro) Raji Lymphoma cells C5a TNF-α, IGF-1, IL-8, γ-IFN, IL-2 Lymphoma cell line (Raji) was cultured with mononuclear cells and neutrophils (from healthy donor's blood), with and without Lym-1 MoAb and cytokines/chemotaxins (1) C5-deficient human serum did not promote Lym-1 antibody-dependent lysis (2) C5a as a mediator induces PMN-mediated Lym-1 antibody-dependent cytolysis (3) When C5a was added to PMNs and lymphoma cells in the absence of Lym-1 or mixed with Raji cells plus Lym-1, C5a had no effect Komohara et al. (2013) [ 14 Cell lines (in vitro) and paraffin blocks from 58 ATLL patients ATLL ATLL cells, M1, M2 C5a Immunohistochemistry with CD68 and CD163 was used to identify M1 and M2 macrophages in paraffin-embedded tumor tissue accordingly. ATLL cell lines were cultured with macrophages (1) Patients with higher proportion of M2 macrophages had poor prognosis (2) ATLL cells were significantly activated when they were co-cultured with M2 macrophages (3) C5a, TNF-α, GRO-a, I-309, and IL-6 significantly promoted the proliferation of lymphoma cell lines when co-cultured with M2 macrophages Miguet et al. (2006) [ 15 Serum from 39 chronic B-cell lymphoma patients (before treatment) and 20 healthy individuals (control group) N/A N/A C3a Sera test for various proteins including C3a and C4a C3a and C4a were increased in lymphoma patients versus the control group Bai et al.'s experiments involved the SLVL, Raji, and Daudi cell lines, which are widely used cell lines derived from splenic B-cell lymphoma with circulating villous lymphocytes (SLVL) and Burkitt lymphoma (Raji and Daudi) patients, respectively. These cell lines were cultured alone or co-cultured with immature, M1, or M2 macrophages. Then the number of macrophages (using BrdU as a macrophage marker), lymphoma cells' nuclei size and proliferation, and Stat3 and C5a levels were studied. According to this study, co-culture with M2 macrophages significantly induced BrdU incorporation. The longest length of SLVL cell nuclei, when co-cultured with M2 macrophages, was 18.8±2.7 mm. Without co-culture, the longest length of SLVL cell nuclei was 15.7±2.8 mm, proving that lymphoma cells' nuclei size was significantly increased in co-culture with M2 macrophages (p=0.003; n=20). These outcomes suggest that M2 macrophages promote lymphoma cell nuclei enlargement. Moreover, lymphoma cell proliferation was elevated in co-culture with immature, M1, or M2 macrophages. In addition, elevated levels of C5a in co-culture with M2 macrophages lead to increased lymphoma cell proliferation via Stat3 activation. The research team achieved downregulation of Stat3 protein in SLVL cultured cells by siRNA. Lymphoma cell activation by C5a was suppressed when Stat3 was downregulated [ 12 Another experimental study used Raji cell line co-cultured with mononuclear cells and neutrophils from the blood of a healthy donor, Lym-1 MoAb (a murine IgG2a monoclonal antibody that recognizes B-cell lymphoma cells), and cytokines/chemotaxins. It was shown that Raji cells' lysis occurred in the presence of Lym-1 and human serum. When C5 was removed from the human serum, Lym-1 antibody-dependent lysis was not promoted. C5a induced neutrophil-mediated Lym-1 antibody-dependent lysis. When C5a was put in neutrophils and lymphoma cells without Lym-1 or mixed with Raji cells and Lym-1, C5a had no effect. Thus, C5a caused lymphoma cell lysis only when neutrophils were present, suggesting a potential role of C5a in neutrophil activation. According to the authors, neutrophil-mediated Lym-1 antibody-dependent cytolysis was 5.3±8.0 (n=17) with 2.6 (1.1-9.4) in the absence of C5a and 11.6±9.0 (n=17) with 11.4 (7.0-16.3) in the presence of C5a. Cytolysis in the absence of C5a versus in the presence of C5a was statistically significant (p=0.0103) [ 13 The last experimental study involved adult T-cell leukemia/lymphoma (ATLL) cell lines and paraffin-embedded tumor samples from 58 ATLL patients. The median age was 65 years, and 34 out of 58 patients were males. CD68 was used as an M1 macrophage marker, while CD163 was used as an M2 macrophage marker. Two pathologists independently evaluated the infiltration of M1 and M2 macrophages. ATLL cell lines were cultured with macrophages. Patients were divided into M2 low and M2 high groups, and the cutoff was set at 75% of CD163-positive cells of tumor-associated macrophages. This study showed that patients with higher densities of M2 macrophages had a poor prognosis (p=0.046). Proliferation of ATLL cells was significantly promoted when they were co-cultured with M2 macrophages. Last but not least, the involvement of soluble factors like C5a in the interaction between lymphoma cells and M2 macrophages was studied. It turned out that C5a, TNF-α, growth-related oncogene (GRO)-a, CCL1/I-309, and interleukin-6 significantly promoted the proliferation of lymphoma cell lines when co-cultured with M2 macrophages [ 14 The study of Miguet et al. used serum from 39 naïve chronic B-cell lymphoma patients and 20 healthy individuals. Surface-enhanced laser desorption ionization (SELDI) mass spectrometer ProteinChip technology was applied in order to identify different proteins in the serum. This methodology is applied, aiming to discover new biomarkers. The research team identified all peptides and proteins that were significantly different between patients and healthy individuals. In order to avoid biases arising from therapy (immunotherapy and/or chemotherapy), serum and body fluid were obtained at the moment of diagnosis. Several serum proteins were studied, including anaphylatoxins C3a and C4a. It was shown that C3a and C4a were present with intense peaks in lymphoma patients but not in the control group. Specifically, these two peaks were 8936 Da and 8611 Da (1 Da=1 g/mol). Since C3a protein is 8938 Da and C4a is 8608 Da, they both fit very well with the experimental SELDI mass at 8936 Da and 8611 Da, respectively. The authors suggested that protein fragments or modified forms of common serum proteins could be used as potential diagnostic markers. C3a and C4a could possibly be useful for the diagnosis of B-cell lymphoma, since they were not observed in the serum of healthy individuals, but they were identified in the serum of naïve chronic B-cell lymphoma patients with major peaks [ 15 Risk of Bias The results of the risk of bias are shown in Table 2 12 14 15 12 13 15 14 Table 2 Quality assessment ++: definitely low risk of bias; +: probably low risk of bias; -: probably high risk of bias or not reported; --: definitely high risk of bias Author (year) 1. Was the administered dose or exposure level adequately randomized? 2. Was allocation to study groups adequately concealed? 3. Were experimental conditions identical across study groups? 4. Were research personnel blinded to the study group during the study? 5. Were outcome data complete without attrition or exclusion from analysis? 6. Can we be confident in the exposure characterization? 7. Can we be confident in the outcome assessment (including blinding of assessors)? 8. Were all measured outcomes reported? 9. Were there no other potential threats to internal validity? Bai et al. (2013) [ 12 ++ (no need for randomization) ++ (no need to be concealed) ++ ++ ++ ++ ++ ++ ++ Ottonello et al. (1996) [ 13 ++ (no need for randomization) ++ (no need to be concealed) ++ ++ ++ ++ ++ ++ ++ Komohara et al. (2013) [ 14 ++ (no need for randomization) ++ (no need to be concealed) ++ ++ ++ ++ ++ ++ ++ Miguet et al. (2006) [ 15 + + ++ ++ ++ ++ ++ ++ ++ Discussion The complement system is not only a component of innate immunity and an ancient defense mechanism against invading pathogens but also an active participant in adaptive immune response, inflammation, hemostasis, and organ repair [ 4 16 17 C3a and C5a Receptors Anaphylatoxin receptors C3aR and C5aR are normally present on epithelial cells, mast cells, and phagocytes, and binding of C3a and C5a, respectively, enhances phagocytosis of opsonized microorganisms [ 18 19 20 Inhibition of complement signalling has been studied thoroughly in malignant solid tumors, where pharmacological blockage of C5a receptors in tumor-bearing mice resulted in impaired tumor growth compared to controls. It was remarkable that the inhibition of complement signalling via the subcutaneous administration of C5aR antagonist in those mice significantly diminished tumor growth to a similar degree as the effect caused by the anti-cancer drug paclitaxel [ 20 C5a-Mediated Proliferation of Lymphoma Cells Additional studies in animals suggested that the concentration of local anaphylatoxins within the TME is critical in determining their role in tumor progression. It has been observed that tumor-bearing mice with high C5a-producing lymphoma cells had significantly accelerated tumor progression with decreased CD4+ and CD8+ T cells in the tumor, whereas mice with low C5a-producing lymphoma cells had a significantly reduced tumor burden with increased IFN-γ-producing CD4+ and CD8+ T cells in the spleen and tumor-draining lymph nodes [ 21 22 In another study, in lymphoma-bearing mice, the use of vaccines against an epitope of C5a receptor (C5aR) on antigen-presenting cells (APCs) showed impressive protective outcomes against an aggressive murine lymphoma. This connection between those vaccines and the C5aR epitope promoted the release of Th1 cytokines, which help drive the tumor-specific, CD8+ T-cell-mediated cytotoxic response [ 23 In this systematic review, C5a appeared to promote the significant activation of lymphoma cell lines when co-cultured with M2 macrophages. More specifically, C5a was found to be one of the macrophage-derived soluble factors that induce cell-cell interaction between tumor-associated macrophages and lymphoma cells in ATLL and Burkitt lymphoma cell lines. Both Bai et al. [ 12 14 In Ottonello et al.'s in vitro study, a different mechanism is described where C5a, acting as a mediator, induced Lym-1 antibody-dependent cellular toxicity by polymorphonuclear leukocytes against lymphoma cells. In this study, Lym-1, a murine IgG2a monoclonal antibody that recognizes a polymorphic variant of HLA-DR antigens present on malignant B cells that has been given intravenously in previous clinical trials, achieved lymphoma cell lysis in the presence of C5a, whereas C5a-deficient human serum did not promote Lym-1 antibody-dependent lysis [ 13 24 Diagnostic Biomarker Potential of C3a Miguet et al. observed that C3a levels were increased in the serum of untreated lymphoma patients compared to the control group, suggesting the activation of the complement system via antigen-antibody complexes (classical pathway). In the same study, it was suggested that C3a and C4a might be potential biomarkers of B-cell lymphoma because they were identified in 38% of patients' serum with major peaks, but they were absent in the serum of the control group [ 15 12 14 Limitations Regarding the limitations of the study, despite an extensive search, a very limited number of studies were found to test this specific hypothesis. Evidence of a correlation between anaphylatoxin levels and lymphoma cell proliferation raises the need for further investigation in order to understand the role of anaphylatoxins in the turnover regulation of these cells. Ideally, studies that would correlate anaphylatoxin levels in patient serum with outcomes concerning survival and response to treatment would add valuable knowledge to this field. Conclusions Anaphylatoxins, especially C5a, appear to play a role in the activation of lymphoma cells both as mediators in cell-cell interaction and as auxiliary molecules for the lysis of these cells via antibody-dependent cellular cytotoxicity. There are only few evidence about the effect of C3a on lymphoma. It is known that C3a is elevated in lymphoma patients' serum versus healthy subjects, but the reason for this increase has not been explained yet. The study of C3a interaction with lymphoma cells might prove useful in the search for more treatment options for lymphoma. Moreover, there seems to be a connection between M2 macrophages and C5a that promotes the proliferation of lymphoma cells. Also, downregulation of Stat3 stopped lymphoma cell activation by C5a. Exploring the pathophysiology between C5a, Stat3, and M2 macrophages may lead to a new breakthrough in the treatment of lymphoma. Further studies in this area could shed more light on the mechanisms by which anaphylatoxins affect lymphoma cells and maybe provide a new treatment strategy for lymphoma patients. Disclosures Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 The tumor microenvironment innately modulates cancer progression Cancer Res Hinshaw DC Shevde LA 4557 4566 79 2019 31350295 10.1158/0008-5472.CAN-18-3962 PMC6744958 2 Role of C5a in inflammatory responses Annu Rev Immunol Guo RF Ward PA 821 852 23 2005 15771587 10.1146/annurev.immunol.23.021704.115835 3 The role of anaphylatoxins C3a and C5a in regulating innate and adaptive immune responses Inflamm Allergy Drug Targets Peng Q Li K Sacks SH Zhou W 236 246 8 2009 19601884 10.2174/187152809788681038 4 The role of the complement system in cancer J Clin Invest Afshar-Kharghan V 780 789 127 2017 28248200 10.1172/JCI90962 PMC5330758 5 Clinical promise of next-generation complement therapeutics Nat Rev Drug Discov Mastellos DC Ricklin D Lambris JD 707 729 18 2019 31324874 10.1038/s41573-019-0031-6 PMC7340853 6 WHO Classification of Tumours Editorial Board. Haematolymphoid [internet]. Lyon (France): International Agency of Research on Cancer Haematolymphoid Tumours Geneva, Switzerland World Health Organization 2024 https://publications.iarc.who.int/Book-And-Report-Series/Who-Classification-Of-Tumours/Haematolymphoid-Tumours-2024 7 Lymphoma: diagnosis and treatment Am Fam Physician Lewis WD Lilly S Jones KL 34 41 101 2020 https://pubmed.ncbi.nlm.nih.gov/31894937/ 31894937 8 Exploring complement-dependent cytotoxicity by rituximab isotypes in 2D and 3D-cultured B-cell lymphoma BMC Cancer Lara S Heilig J Virtanen A Kleinau S 678 22 2022 35725455 10.1186/s12885-022-09772-1 PMC9210731 9 OHAT risk of bias rating tool for human and animal studies 2015 https://ntp.niehs.nih.gov/sites/default/files/ntp/ohat/pubs/riskofbiastool_508.pdf 10 Extending a risk-of-bias approach to address in vitro studies Rooney A 2015 https://ofmpub.epa.gov/eims/eimscomm.getfile?p_download_id=526750 11 EndNote The EndNote Team Philadelphia, PA Clarivate 2013 https://endnote.com/ 12 Role of Stat3 activation in cell-cell interaction between B-cell lymphoma and macrophages: the in vitro study J Clin Exp Hematop Bai B Horlad H Saito Y Ohnishi K Fujiwara Y Takeya M Komohara Y 127 133 53 2013 23995109 10.3960/jslrt.53.127 13 Monoclonal Lym-1 antibody-dependent lysis of B-lymphoblastoid tumor targets by human complement and cytokinine-exposed mononuclear and neutrophilic polymorphonuclear leukocytes Blood Ottonello L Morone P Dapino P Dallegri F 5171 5178 87 1996 https://pubmed.ncbi.nlm.nih.gov/8652830/ 8652830 14 Clinical significance of CD163⁺ tumor-associated macrophages in patients with adult T-cell leukemia/lymphoma Cancer Sci Komohara Y Niino D Saito Y Ohnishi K Horlad H Ohshima K Takeya M 945 951 104 2013 https://pubmed.ncbi.nlm.nih.gov/23557330/ 23557330 10.1111/cas.12167 PMC7657152 15 Discovery and identification of potential biomarkers in a prospective study of chronic lymphoid malignancies using SELDI-TOF-MS J Proteome Res Miguet L Bogumil R Decloquement P Herbrecht R Potier N Mauvieux L Van Dorsselaer A 2258 2269 5 2006 16944938 10.1021/pr060058y 16 Complementopathies and precision medicine J Clin Invest Gavriilaki E Brodsky RA 2152 2163 130 2020 32310222 10.1172/JCI136094 PMC7190924 17 Advancing therapeutic complement inhibition in hematologic diseases: PNH and beyond Blood Gavriilaki E de Latour RP Risitano AM 3571 3582 139 2022 34482398 10.1182/blood.2021012860 18 Immunobiology: The Immune System in Health and Disease Janeway CA Jr Travers P Walport M New York (NY) Garland Science 2001 https://www.ncbi.nlm.nih.gov/books/NBK10775/ 19 The complement cascade as a mediator of human malignant hematopoietic cell trafficking Front Immunol Lenkiewicz A Bujko K Brzezniakiewicz-Janus K Xu B Ratajczak MZ 1292 10 2019 31231394 10.3389/fimmu.2019.01292 PMC6567995 20 Modulation of the antitumor immune response by complement Nat Immunol Markiewski MM DeAngelis RA Benencia F 1225 1235 9 2008 18820683 10.1038/ni.1655 PMC2678913 21 Opposing roles for complement component C5a in tumor progression and the tumor microenvironment J Immunol Gunn L Ding C Liu M 2985 2994 189 2012 22914051 10.4049/jimmunol.1200846 PMC3436956 22 C5a-mediated leukotriene B4-amplified neutrophil chemotaxis is essential in tumor immunotherapy facilitated by anti-tumor monoclonal antibody and β-glucan J Immunol Allendorf DJ Yan J Ross GD 7050 7056 174 2005 15905548 10.4049/jimmunol.174.11.7050 23 Tumor-specific peptide-based vaccines containing the conformationally biased, response-selective C5a agonists EP54 and EP67 protect against aggressive large B cell lymphoma in a syngeneic murine model Vaccine Kollessery G Nordgren TM Mittal AK Joshi SS Sanderson SD 5904 5910 29 2011 21723901 10.1016/j.vaccine.2011.06.070 24 A phase 1a clinical trial of LYM-1 monoclonal antibody serotherapy in patients with refractory B cell malignancies Hematol Oncol Hu E Epstein AL Naeve GS 155 166 7 1989 2784122 10.1002/hon.2900070207 ",
  "metadata": {
    "Title of this paper": "A phase 1a clinical trial of LYM-1 monoclonal antibody serotherapy in patients with refractory B cell malignancies",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477458/"
  }
}