{
  "title": "Paper_859",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472326 PMC12472326.1 12472326 12472326 41010482 10.3390/nu17182955 nutrients-17-02955 1 Review Vitamins, Vascular Health and Disease https://orcid.org/0000-0002-0807-8983 Ayoub George Barker Tyler Academic Editor Psychology Department, Santa Barbara City College, Santa Barbara, CA 93109, USA; neuro@sbcc.edu 15 9 2025 9 2025 17 18 497660 2955 11 8 2025 11 9 2025 12 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Vascular health relies on the proper function of endothelial cells, which regulate vascular tone, blood fluidity, and barrier integrity. Endothelial dysfunction, often aggravated by inadequate vitamin absorption, contributes to a spectrum of clinical disorders, including cardiovascular disease, cerebrovascular disease, peripheral artery disease, age-related macular degeneration, lymphedema, and chronic venous insufficiency. B-group vitamins (especially folate, or vitamin B9), along with vitamins B12, B6, C, D, and E, are essential in maintaining endothelial function, supporting DNA synthesis, regulating methylation, enhancing cellular repair, mitigating oxidative stress and inflammatory signaling, and curtailing vascular damage. Folate is noted for its central function in one-carbon metabolism and in converting homocysteine to methionine, thereby reducing vascular toxicity. We cover natural dietary sources of folate, synthetic folic acid, and the biologically active forms 5-methyl-(6S)-tetrahydrofolate (L-5-MTHF, L-methylfolate) and 5-formyl-(6S)-tetrahydrofolate (levoleucovorin). Therapeutic strategies to address vascular health and prevent hyperhomocysteinemia in order to preclude follow-on disorders include targeted vitamin supplementation, dietary improvements to ensure a sufficient intake of bioavailable nutrient forms, and, in certain clinical contexts, the use of active L-methylfolate or levoleucovorin (a drug product) to bypass metabolic conversion issues. These evidence-based interventions aim to restore endothelial homeostasis, slow disease progression, and improve patient outcomes across a variety of disorders linked to poor vascular health. folate homocysteine folate receptor autoantibody endothelium lymphedema dementia cognitive decline autism ASD This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Vitamins in Vascular Health Vascular health depends on the integrity and function of endothelial cells, which line the interior surface of blood vessels. In degenerative disorders (including disorders as varied as age-related macular degeneration or lymphedema), a diminished absorption of these vitamins leads to poorer vascular health, which exacerbates the disorder [ 1 2 1.1. Vitamins Essential for Endothelial Health: Folate Folate (vitamin B9) is essential for one-carbon metabolism, which supports DNA and RNA synthesis, facilitating cell division and repair [ 3 4 5 4 Vitamins B9 and B12 are also involved in the conversion of homocysteine to methionine. Reducing homocysteine lowers its toxicity, which can otherwise harm blood vessels [ 3 6 There are two forms of dietary folate. The natural form is found in foods (leafy greens, legumes, and liver). It is reduced but requires conversion in the body to the active form utilized by cells [ 3 5 3 5 Figure 1 6 One variation in supplements is whether the active form L-methylfolate is used or the racemic version, which includes the D-isomer in equal amounts. If the supplement is a racemic mix, then the dosing needed is twice that of the active form L-methylfolate. This is true for L-methylfolate, as well as for other reduced forms of folate, such as folinic acid (leucovorin), where the active form is levofolinic acid (levoleucovorin). L-methylfolate is relatively commonly available now, while leucovorin/levoleucovorin are used in approved drug products. In this paper, we use the term methylfolate to refer to the active form L-methylfolate throughout. We note that the full terminology is L-5-methyl-(6S)-tetrahydrofolate (L-5-MTHF) and that the term L-methylfolate is more common, but they refer to the same molecule. We note that, in some referenced publications, different abbreviations such as L-5-MTHF have been used. In clinical practice, it is always best to use the L-isomer of methylfolate or folinic acid (leucovorin) in treatment, as there is no dilution from an equal amount of inactive D-isomer. 1.1.1. Steps in the Folate Pathway Dietary folates (mainly polyglutamated forms) are deconjugated to monoglutamate forms in the small intestine and absorbed via specific transporters (e.g., proton-coupled folate transporter). Once in the bloodstream, folate is transported to tissues and taken up by cells through reduced folate carriers (RFCs) and folate receptors [ 5 9 Inside cells, folate is reduced to dihydrofolate (DHF) and then to tetrahydrofolate (THF) by the enzyme dihydrofolate reductase (DHFR). THF acts as a carrier of one-carbon units in various oxidation states, forming derivatives such as 5,10-methylene-THF, 5-methyl-THF, and 10-formyl-THF [ 5 10 THF derivatives participate in purine and thymidylate (dTMP) synthesis (for DNA/RNA); methionine regeneration from homocysteine (via 5-methyl-THF and methionine synthase); and methylation reactions (via S-adenosylmethionine, SAM) [ 5 Folate metabolism occurs in both the cytosol and mitochondria, with specific enzymes and folate forms in each compartment. Folate metabolism is tightly regulated, and cells possess repair mechanisms for damaged folate molecules [ 10 11 1.1.2. Folate Deficiency/Insufficiency and Vascular Dysfunction Folate deficiency or insufficiency leads to impaired DNA synthesis, megaloblastic anemia, and elevated homocysteine, and it increases the risk of vascular dysfunction, including atherosclerosis, stroke, and degenerative diseases [ 3 4 3 6 Supplementation with folic acid or L-methylfolate can improve endothelial function, especially in those with cardiovascular risk or established disease, by increasing nitric oxide (NO) bioavailability and reducing oxidative stress [ 3 6 12 4 5 1.2. Vitamins Essential for Endothelial Health: Pyridoxine and Cobalamin Vitamin B6 (Pyridoxine) and B12 (Cobalamin) are both cofactors in homocysteine metabolism, working synergistically with folate to convert homocysteine to methionine [ 3 5 3 13 Vitamin B12, in concert with folate, is essential for the remethylation of homocysteine to methionine. Insufficiency exacerbates homocysteine elevation and related vascular threats [ 14 15 Both vitamins are readily absorbed from dietary and supplemental sources. They both support DNA synthesis and repair [ 4 5 16 1.3. Vitamins Essential for Endothelial Health: Ascorbic Acid Vitamin C (Ascorbic Acid) is a powerful antioxidant. It neutralizes reactive oxygen species, thus reducing oxidative stress-induced dysfunction. It is active in the regeneration of nitric oxide, which enhances vasodilation, thus reducing hypertension risk, by facilitating NO bioavailability. Vitamin C protects endothelial cells from oxidative damage. It supports collagen synthesis, which is important for the integrity of the vascular lining [ 3 17 Vitamin C is highly bioavailable in fruits and vegetables. It is water-soluble and rapidly absorbed [ 3 1.4. Vitamins Essential for Endothelial Health: Vitamin D Vitamin D receptors are expressed in endothelial cells, and activation suppresses pro-inflammatory gene expression while enhancing anti-inflammatory signals. It thus modulates inflammation and immune function in the endothelium, supporting vascular resilience [ 17 18 19 20 21 22 Vitamin D influences the renin–angiotensin–aldosterone system, modulating blood pressure and thus supporting vascular tone via blood pressure regulation [ 19 20 Vitamin D is produced in the skin via sunlight exposure. It is also available in fortified foods and supplements [ 3 17 1.5. Vitamins Essential for Endothelial Health: Tocopherol and Vitamin K2 Vitamin E (tocopherol), especially alpha-tocopherol, is a lipid-soluble antioxidant in cell membranes, protecting endothelial cells from lipid peroxidation. It reduces LDL oxidation and plaque formation and may modulate inflammation and platelet aggregation in blood vessels [ 3 18 Vitamin E is absorbed with dietary fats. It is found in nuts, seeds, and vegetable oils [ 3 Vitamin K2 helps to regulate soft tissue stiffness by activating an anti-calcific protein. The prevalence of vitamin K deficiency in the USA is high. Because vitamin K2 reduces arterial stiffness, it thus plays a role in reducing CVD [ 23 1.6. Public Health Aspects 1.6.1. Nutritional Sufficiency Population studies underscore the prevalence of suboptimal vitamin intake and its correlation with atherosclerotic disease progression and adverse vascular outcomes. Surveys continue to show that, many individuals, including in developed nations, fall short of optimal vitamin intake, especially B9, B12, D, and C [ 18 24 25 26 1.6.2. Genetic Polymorphisms Polymorphisms in genes encoding enzymes for folate and homocysteine metabolism such as MTHFR increase the need for bioavailable forms of folate (such as L-methylfolate or a drug product containing levoleucovorin). These gene variants may exacerbate deficiencies and vascular risk. In these cases, direct use of L-methylfolate (or levoleucovorin) is beneficial [ 4 27 The existence of polymorphisms often raises concerns as to whether there may be variations in the efficacy or negative effects of treatment with a replacement for folate. Because leucovorin/levoleucovorin has been used in cancer therapy for many decades, including in young children, there is ample evidence that, even with much higher doses than discussed here, the administration of leucovorin rescue (referred to as a rescue because it rescues children from the cancer medication methotrexate, which depletes vitamin B9) does not have a negative impact, and the positive effect is present in all ethnic groups [ 28 1.6.3. Supplementation and Disease Prevention Mandatory folic acid fortification has lowered neural tube defect rates. This supplementation must be balanced against issues in those unable to efficiently convert folic acid to its bioactive form. There is increasing evidence that non-deficient individuals and those with gene variants may be negatively impacted by folic acid supplementation [ 12 18 Vitamins are indispensable for vascular health through their diverse roles in endothelial cell function, regulation of oxidative and inflammatory processes, and homocysteine metabolism. Timely identification and correction of deficiencies or insufficiencies, targeted supplementation in at-risk individuals, and a foundation of nutrient-rich dietary habits are all strategies with significant potential to reduce vascular disease burden and promote healthy aging. 2. Folate Sources, Absorption, and Bioavailability Vitamin B9, commonly known as folate, is an essential water-soluble B vitamin required for DNA synthesis, amino acid metabolism, and key methylation reactions. Folate exists both in natural forms found in many food products and as a synthetic compound, folic acid, used in supplementation and food fortification. The natural forms are reduced in form, and folic acid is oxidized, making it stable for long periods of time. Understanding natural and synthetic sources, comparative bioavailability, and the impact of genetic variation on folate metabolism is critical for optimizing health and preventing deficiency-related conditions [ 4 25 29 30 2.1. Folate from Foods Folate occurs naturally in several foods. Food products with the highest folate concentrations are shown in Table 1 27 30 31 Folic acid is a mono-glutamate, and it is fully oxidized and stable. It is chemically distinct from natural food folate in that it does not require deconjugation or release from plant matrices. Fortified foods and supplements provide reliable, high bioavailability forms of folic acid, compensating for losses from natural sources and helping reduce deficiency rates [ 30 32 33 Another form of folate is found in medical foods. These are products that contain L-methylfolate (L-5-MTHF), a bioactive form used in certain clinical situations. Leucovorin/levoleucovorin, bioactive forms used in cancer therapy to replace folate depleted by chemotherapy and used as a treatment to alleviate communication symptoms in autism [ 34 2.2. Bioavailability and Absorption The bioavailability of naturally occurring folate is inherently variable and generally limited compared to that of synthetic folic acid. Typical estimates are that natural food folate is about 50–60% as bioavailable as folic acid consumed with a meal [ 5 29 35 Three factors affect natural folate bioavailability. These are that folate can be tightly bound within plant cell structures; that natural folate is polyglutamated, which requires enzymatic deconjugation before absorption; and that folate is susceptible to heat, light, and oxidation, so losses can occur during cooking and storage [ 5 29 35 Emerging research suggests that, depending on the food and preparation, bioavailability may range from roughly 44% to 80%, with a median estimate of around 65% as compared to synthetic folic acid [ 29 35 36 5 30 2.3. Genetic Influences on Folate Metabolism Several common genetic polymorphisms influence folate absorption, metabolism, and the body’s methylation capacity. MTHFR (Methylenetetrahydrofolate Reductase) gene C677T A1298C 37 38 39 40 1 7 41 MTR MTRR FOLH1 RFC1 SHMT 37 38 39 40 DHFR (dihydrofolate reductase). Variability in DHFR activity can affect the reduction of folic acid to tetrahydrofolate, influencing how efficiently synthetic folic acid is utilized. Excess folic acid may accumulate in individuals with low DHFR activity [ 42 2.4. Folate Transport into the Brain Folate must cross the blood–brain barrier (BBB) to support neurological function. This process is mediated by at least two specific transport proteins. Folate receptor alpha (FRα) is essential for high-affinity transportation of folate across the choroid plexus into the cerebrospinal fluid and brain tissue. Mutations in the FOLR1 gene can cause cerebral folate deficiency (CFD), leading to neurological symptoms [ 43 The reduced folate carrier (RFC, SLC19A1 44 45 Disruption of these transport mechanisms, whether by genetic mutations, autoantibodies, or disease, can result in cerebral folate deficiency, a low brain folate level, even when blood folate status appears normal. Treatment with lecovorin/levoleucovorin can sometimes bypass these defects and restore brain folate levels [ 45 These genetic factors help explain the differences between individuals in folate requirements; the varied responses to supplementation; and the risk of conditions linked to both plasma folate deficiency and cerebral folate deficiency, including birth defects, cardiovascular disease, and autism spectrum disorder [ 37 38 39 40 Research continues to elucidate the interaction between genetic variation, environmental exposures, and folate-dependent pathways, pointing to a future with more personalized recommendations for folate intake [ 46 3. Cardiovascular Health Folate improves endothelial function both by lowering homocysteine levels and through homocysteine-independent mechanisms. Evidence from human clinical studies demonstrates that folate can enhance vascular reactivity and may reduce cardiovascular disease (CVD) events, particularly in at-risk populations with low baseline folate or elevated homocysteine levels. The cardiovascular benefit of folate is dose-dependent, and excessive supplementation, especially with folic acid, may pose risks. Other vitamins, notably B6, B12, C, D, E, and K, play complementary roles in promoting vascular health through antioxidative, anti-inflammatory, and structural vessel support mechanisms. 3.1. Folate and Endothelial Function Folate plays a critical role in one-carbon metabolism, particularly in the remethylation of homocysteine to methionine, as described above. Elevated homocysteine is recognized as an independent risk factor for cardiovascular disease (CVD). Mechanistically, high homocysteine levels can promote endothelial dysfunction via increased oxidative stress, impaired nitric oxide (NO) bioavailability, and direct endothelial injury. By facilitating the conversion of homocysteine to methionine, folate supplementation lowers plasma homocysteine concentrations and may limit these deleterious vascular effects [ 6 12 47 48 Moreover, folate exerts endothelial benefits independent of lower homocysteine levels. Experimental studies have demonstrated that folate in the form of folic acid and its bioactive metabolite, L-methylfolate, can directly enhance endothelial function, possibly by reducing intracellular superoxide availability and improving NO production in endothelial cells [ 6 12 Endothelial dysfunction is a central feature in the pathogenesis of atherosclerosis, preceding plaque formation and influencing the progression of established disease. Improvements in endothelial function, assessed via flow-mediated dilation (FMD), correspond to a reduced cardiovascular risk [ 12 49 50 3.2. Evidence for Improved Blood Flow Multiple studies have provided evidence that folate, along with an adequate intake of other B vitamins such as B6 and B12, improves vascular reactivity and blood flow. In animal models, folate supplementation has reversed endothelial dysfunction caused by hyperhomocysteinemia [ 3 In humans, several randomized controlled trials and observational studies have shown that high-dose folic acid (5–10 mg/day) improves FMD and overall endothelial function in patients both with and without hyperhomocysteinemia [ 6 12 49 51 Beyond folate, vitamins C, E, D, and K—through their antioxidant properties, blood pressure regulation, and support of blood vessel health—contribute to better circulation and may reduce atherosclerosis and peripheral vascular disease risk [ 2 52 3.3. Clinical Evidence Trials in patients with coronary artery disease (CAD) demonstrate that folic acid supplementation (5 mg for 6 weeks) increases plasma folate levels and improves FMD, a measure of endothelial function, even when the reduction in homocysteine is moderate [ 6 12 49 53 While moderate folate intake is associated with reduced cardiovascular mortality, some data suggest that excessive folic acid supplementation may not continue to provide incremental benefits and could even have potential adverse effects at the highest intake levels [ 54 55 56 57 57 58 59 60 Additionally, large randomized trials in selected populations (e.g., chronic kidney disease) have not consistently demonstrated reduced cardiovascular events after long-term folate supplementation, emphasizing the importance of individual risk, baseline folate status, and other confounding factors [ 61 The outcomes of the published trials are summarized in Table 2 The therapeutic impact for CVD is that, in cases with elevated homocysteine, folate (at doses listed in Table 2 26 60 4. Peripheral Circulation, Lymphedema, and Glymphatic Function Folate plays a multifaceted role in circulatory health, improving endothelial function, supporting nitric oxide production, and potentially enhancing both blood and lymphatic flow. Clinical evidence suggests benefits in peripheral artery disease and lymphedema, with promising implications for lymphatic function. While the impact of folate on the glymphatic system remains speculative, its established vascular effects provide a rationale for future investigation into its role in brain waste clearance and neurodegenerative disease prevention [ 62 63 4.1. Folate and Peripheral Circulation Folate has been shown to improve endothelial function in the peripheral circulation, with effects that extend beyond its ability to lower homocysteine levels [ 62 3 63 62 63 Supplemental folic acid can also prevent endothelial dysfunction and nitrate tolerance induced by continuous nitroglycerin therapy, further underscoring its role in maintaining nitric oxide synthase function and vascular health [ 3 62 62 63 64 4.2. Folate and Lymphedema Folate’s influence extends to the lymphatic system, where it may promote lymphangiogenesis, the formation of new lymphatic vessels, and improve lymphatic flow. Evidence from a human study supports the role of folate in enhancing lymphatic circulation [ 2 2 2 65 66 67 4.3. Glymphatic System The glymphatic system is a recently described waste clearance pathway in the brain, analogous to the peripheral lymphatic system. It facilitates the removal of metabolic waste products and is thought to play a role in neurodegenerative diseases such as dementia [ 68 69 70 2 71 A diminished glymphatic system has been hypothesized to contribute to the accumulation of neurotoxic waste products in the brain, potentially increasing the risk of dementia [ 72 73 74 1 5. Retinal Vascularization and Retinal Disease Folate deficiency leads to hyperhomocysteinemia, which damages retinal vascular endothelial cells through oxidative stress, inflammation, and barrier breakdown. Proper folate status and transport are essential for homocysteine detoxification; endothelial protection; and the maintenance of retinal vascular integrity in eye diseases such as diabetic retinopathy, retinal vascular occlusions, glaucoma, and age-related macular degeneration (AMD) [ 75 76 77 78 1 41 79 5.1. Retinal Hyperhomocysteine and Vascular Dysfunction As noted above, folate is a key dietary determinant of plasma homocysteine. Adequate folate enables the remethylation of homocysteine to methionine, keeping homocysteine levels low. Folate deficiency is the most common cause of elevated homocysteine (hyperhomocysteinemia) [ 75 76 78 76 77 80 Experimental models show that high homocysteine levels lead to a loss of retinal ganglion cells and the thinning of retinal layers, effects that can be partially reversed with folate supplementation [ 78 The efficacy of folate in protecting retinal vasculature depends on its transport into retinal cells, primarily in the form of L-methylfolate. Efficient folate transport is crucial for maintaining the integrity of the inner blood–retinal barrier and resistance to ischemia. Impaired transport or retinal folate deficiency can occur even with normal serum folate levels, leading to increased local homocysteine and vascular dysfunction [ 75 81 75 5.2. Retinal Oxidative Stress and Antioxidants Oxidative stress is a central mechanism by which elevated homocysteine (hyperhomocysteinemia) induces retinal damage. High homocysteine levels increase the production of reactive oxygen species (ROS) in retinal endothelial and glial cells, overwhelming the eye’s natural antioxidant defenses and leading to cellular dysfunction and tissue injury [ 77 82 83 Homocysteine-induced oxidative stress reduces the expression of tight junction proteins in retinal endothelial cells, increasing vascular permeability and contributing to blood–retinal barrier (BRB) breakdown, a hallmark of vision loss in diseases like diabetic retinopathy and age-related macular degeneration [ 77 84 Excess ROS trigger inflammatory pathways and promote apoptosis (cell death) of retinal neurons, including retinal ganglion cells, further compromising retinal structure and function [ 82 84 85 83 The oxidative environment created by high homocysteine contributes to endothelial toxicity, hypercoagulability, and an increased risk of retinal vascular occlusions such as central retinal vein occlusion [ 83 Experimental evidence shows that antioxidant treatment can mitigate some of these effects, reducing ROS formation and restoring barrier function in homocysteine-exposed retinal cells [ 77 77 82 85 5.3. Clinical Cases Recent studies have proven the efficacy of using medical food levels of B vitamins, using the L-methylfolate form of vitamin B, to treat elevated homocysteine levels in individuals with eye diseases. In each case, the treatment used the medical food Ocufolin, which is a medical food vitamin supply containing different doses of the AREDS2 proven therapy for dry AMD, with L-methylfolate, vitamin B12, and other B vitamins to support endothelial cell health (this medical vitamin perhaps may become referred to as AREDS3 to indicate the addition of vascular support from the B vitamins). In each study, the treatment reduced homocysteine levels and improved retinal perfusion, leading to improved outcomes in each retinal disease. For diabetic retinopathy, L-methylfolate reduced homocysteine and improved retinal perfusion while also reducing stroke risk, leading to the recommendation to evaluate patients for central nervous system microangiopathy using retinal imaging [ 86 In a small case study, glaucomatous conditions were alleviated with similar vitamin treatment. In this study, retinal venous pressure was measured, showing that it was elevated in high-tension glaucoma, as well as in normal-tension glaucoma, and that the medical food therapy reduced this venous pressure, thus improving retinal perfusion and patient outcomes [ 7 41 79 Age-related macular degeneration (AMD) patients were similarly evaluated for retinal venous pressure, and it was found that Ocufolin vitamin therapy reduced it, as well as reducing homocysteine levels. It was further found that the use of this oral vitamin treatment may reduce the frequency of anti-VEGF ocular injections, which are the standard of care in AMD, with stronger outcomes seen when using vitamin therapy, suggesting that reducing homocysteine and retinal venous pressure, alongside anti-VEGF, may be the most effective treatment of neo-vascular AMD [ 1 6. Neurodegenerative Disorders: Dementia and Cognitive Decline Folate deficiency or insufficiency, along with elevated plasma homocysteine levels, has emerged as a significant modifiable risk factor for neurodegenerative disorders, particularly dementia and cognitive decline [ 87 Current evidence supports folate’s role in mitigating neurodegeneration through homocysteine regulation, endothelial cell maintenance, DNA repair, and anti-inflammatory pathways. While population-level fortification has reduced severe deficiency, suboptimal folate status remains a risk factor for cognitive decline. Targeted supplementation may benefit deficient individuals, but universal recommendations require further stratification by age, genetic factors, and baseline nutrient status. 6.1. Neurodegenerative Disease and Folate Folate deficiency is a significant modifiable risk factor for neurodegenerative disorders, particularly dementia and cognitive decline [ 87 88 89 90 Folate is critical for nucleotide synthesis and methylation. Experimental studies in mice lacking uracil glycosylase demonstrate that folate deficiency exacerbates uracil misincorporation into DNA, leading to hippocampal neuron death and reduced brain-derived neurotrophic factor (BDNF) [ 88 Low folate also correlates with elevated pro-inflammatory cytokines (e.g., IL-6 and TNF-α) and reduced glutathione, a key antioxidant. These factors synergistically promote neuronal damage and inhibit hippocampal neurogenesis [ 88 91 6.2. Folate Deficiency Linked to Cognitive Decline There is extensive clinical evidence of the impact of folate deficiency on cognitive decline. A longitudinal study of 3140 older Irish adults found that folate levels < 5 ng/mL predicted accelerated global cognitive decline, while levels < 9 ng/mL impaired episodic memory [ 92 30 93 A Korean study found that low–normal serum folate levels (1.5–5.9 ng/mL) increased the risk of cognitive impairment, finding that, in their 4-year period, the dementia risk was significantly higher for people with those folate levels [ 94 89 92 93 Low serum and red cell folate levels are consistently associated with an increased risk of cognitive decline, Alzheimer’s disease, and vascular dementia in elderly populations. Prospective studies have shown that folate or vitamin B12 deficiency can double the risk of developing Alzheimer’s disease [ 95 Data from large cohorts indicate that higher dietary folate intake is associated with reduced odds of cognitive impairment, with a linear relationship observed between total folate intake and lower risk of global cognitive decline [ 96 6.3. Folate Supplementation Slows Cognitive Decline Folate supplementation has been extensively studied for its potential to improve cognitive function in elderly populations at risk of cognitive decline, particularly those with mild cognitive impairment or low baseline folate status. In a 12-month clinical trial of 180 patients with mild cognitive impairment in China, it was found that folic acid supplementation of 400 μg/day improved global cognition test scores on multiple assessments, significantly raised serum folate and lowered homocysteine, and reduced IL-6/TNF-α by 30% [ 91 30 A high-dose supplementation (5 mg/day) in Japanese elders with cognitive impairment or Alzheimer’s disease significantly improved cognition, as measured with the Mini-Mental State Exam (MMSE), and this was correlated with homocysteine reduction [ 97 98 98 A 2024 meta-analysis of seven randomized controlled trials involving over 1100 older adults (mean age 65–80) with MCI found that folic acid supplementation resulted in significant improvements in several cognitive domains, including Full-Scale IQ, arithmetic, information, digit span, and block design scores. The intervention also reduced inflammatory cytokines and homocysteine levels, both of which are implicated in neurodegeneration [ 99 Another comprehensive review of 51 studies (including 23 meta-analyzed) concluded that folate-based B vitamin supplementation has a significant overall positive effect on cognitive function in older adults, particularly in regions without mandatory folic acid food fortification. In countries with fortification policies, additional supplementation did not yield significant cognitive benefits, likely due to an already adequate folate status in the population [ 100 In a 6-month trial in China (a country without folic acid fortification), elderly individuals with MCI who received 400 µg/day of folic acid showed significant improvements in cognitive performance (Full-Scale IQ, digit span, and block design) compared to controls. These improvements were accompanied by increased serum folate and vitamin B12 and reduced homocysteine levels [ 101 Historical studies and open-label trials have also reported that folic acid supplementation (often at 5 mg/day) improved mood, initiative, alertness, and cognitive function in folate-deficient elderly patients, with some patients showing marked functional recovery [ 95 To date, the published data refer to the use of folic acid in addressing cognitive impairment [ 90 102 102 102 Given that some fraction of the population may have a limited effect from folic acid, studies using L-methylfolate would be welcome, as this folate should have a similar impact for all people. We are planning such a study to identify whether L-methyfolate may have a more universal effect in slowing cognitive decline. 6.4. Efficacy of Folate in Slowing Cognitive Decline The cognitive benefits of folate supplementation are most pronounced in populations with low baseline folate or without mandatory food fortification. In countries with widespread folic acid fortification, further supplementation may not confer additional cognitive benefits for most older adults [ 100 Individuals with MCI or documented folate deficiency are more likely to benefit from supplementation than cognitively healthy or folate-replete individuals [ 99 101 95 96 103 Folate supplementation can improve cognitive function in at-risk elderly populations, especially those with mild cognitive impairment or low baseline folate status, and in regions without mandatory folic acid fortification. The greatest benefits are observed in individuals with documented deficiency or elevated homocysteine. Supplementation is less likely to be effective in populations with adequate folate levels due to food fortification. Additionally, folate absorption and utilization entail adequate vitamin B12 levels, so a B12 deficiency can impact efficacy or other diseases [ 104 99 100 101 105 6.5. Risks of Excessive Folate in Disease Folate is essential for cardiovascular and neurological health, largely due to its role in homocysteine metabolism and DNA repair. While adequate folate intake is beneficial, excessive folate supplementation in older adults with CVD may pose certain risks. The relationship between folate intake and cardiovascular disease (CVD) in older adults is complex, with emerging evidence suggesting potential risks associated with excessive folate consumption in this population. Excessive folate intake risks for older adults with CVD include masking B12 deficiency, potential increases in mortality risk, and attenuation of cognitive benefits. For these reasons, supplementation needs to be tailored, and high-dose folic acid needs to be avoided. These risks may be unique to folic acid, suggesting that routine use of methylfolate may mitigate risk while conferring the cognitive benefit. These findings highlight the need for personalized folate recommendations in older adults with CVD, contrasting with general population guidelines [ 96 106 Table 3 6.5.1. Excess Folic Acid and Increased Mortality Risk Excess folic acid is linked to increased CVD mortality in multiple studies. While modest folate intake showed improvement in long-term survival, excess folic acid in CVD patients increased mortality [ 54 107 96 106 These findings of a benefit with moderate folate levels and danger from high levels reveal a U-shaped relationship for folate. Low (<476 nmol/L) and high red blood cell folate levels correlate with elevated CVD mortality in patients with type 2 diabetes [ 96 These data show that moderate dietary folate (400–600 μg/day) reduced mortality risk, while high supplemental folic acid (>1000 μg/day) increased mortality risk by 18–24% [ 53 96 6.5.2. Excess Folic Acid and Attenuated Cognitive Benefits As detailed above, folate supplementation can improve cognition in deficient individuals. However, excessive intake may not confer additional benefit and could even attenuate protective effects, especially in those with CVD or diabetes. While red blood cell folate normally protects against cognitive impairment, this protective effect disappears entirely in CVD patients [ 96 96 6.5.3. Pathways of Harm from Excess Folic Acid There are a number of proposed mechanisms for why excess folic acid can be problematic, especially in CVD patients. Folate oversaturation in fortified populations: Over 50% of US CVD patients already meet the recommended folate intake, yet 25% still use supplements [ 96 Interaction with CVD pathophysiology: High folate may accelerate atherosclerosis progression in established CVD through poorly understood mechanisms [ 106 Homocysteine paradox: While folate lowers homocysteine, excessive supplementation in CVD patients shows no mortality benefit despite homocysteine reduction [ 108 Masking vitamin B12 deficiency: High folate intake can mask hematological signs of vitamin B12 deficiency, which is common in older adults. This can allow neurological damage from B12 deficiency to progress undetected, potentially leading to irreversible cognitive and neurological impairment [ 59 Potential for unmetabolized folic acid (UMFA): A high intake of synthetic folic acid (from supplements/fortified foods) can lead to unmetabolized folic acid in the bloodstream, which has been linked to impaired immune function and possibly an increased cancer risk [ 58 109 110 111 112 6.5.4. Guidelines for Folate Supplementation in CVD Patients The data support avoiding the use of high-dose folic acid supplements in older adults with CVD history. High-dose folic acid supplements are over 400 μg/day. The published at-risk threshold is for red blood cell folate levels over 900 nmol/L in CVD patients, which warrants caution [ 96 The recommendations to avoid this are to prioritize dietary folate (leafy greens and legumes) over synthetic folic acid [ 96 106 96 Given that it is the use of folic acid, which is the oxidized version of folate, that is problematic, if dietary folate (which is a reduced folate) is insufficient to meet the folate need, the use of other reduced forms of folate, namely, L-methylfolate, would be advised. In this regard, high-dose folinic acid (prescription name, leucovorin) has been used for over 75 years as a prescription drug product for vitamin B9 replacement (in chemotherapy). No cardiotoxicity has been observed with this high-dose leucovorin, with the exception that leucovorin in combination with 5-fluorouracil had the same cardiotoxicity (3%) as 5-fluorouracil alone [ 113 The guidelines for folate supplementation in CVD patients can be summarized as follows: Avoid high-dose folic acid supplements (>400 μg/day) in older adults with CVD unless prescribed for a specific deficiency. Monitor vitamin B12 status in older adults taking folic acid, especially those at risk of deficiency. Prioritize dietary sources of folate (leafy greens and legumes) over high-dose supplements, unless medically indicated. When supplementation is warranted, prioritize the use of methylfolate. Personalize supplementation based on individual risk factors, comorbidities, and baseline folate/B12 status. Consider high-dose treatment with a drug product containing leucovorin or levoleucovring based on specific diagnostic tests (such as genetic tests and the FRAA test). 7. Neurodevelopmental Disorders: Autism Spectrum Disorder Autism spectrum disorder is a multifactorial disorder with origins in the fetal period [ 114 34 115 116 117 7.1. Folate’s Role in Brain Formation During Pregnancy Folate is vital for the closure of the neural tube during embryogenesis, which occurs within the first month of pregnancy. Inadequate maternal folate intake is a well-known risk factor for neural tube defects such as spina bifida and anencephaly. Beyond neural tube defects, folate is crucial for early brain development, influencing neuronal proliferation, migration, and synaptogenesis [ 118 119 Rodent models have demonstrated that maternal folate deficiency leads to impaired neurogenesis; an abnormal brain structure; and behavioral changes reminiscent of ASD, such as reduced social interaction and increased repetitive behaviors [ 120 Epidemiological studies have linked low maternal folate levels or a lack of periconceptional folic acid supplementation to increased ASD risk in offspring. A large Norwegian cohort study found that maternal use of folic acid supplements around conception was associated with a lower risk of autistic disorder in children [ 121 122 Folate is a key donor of methyl groups for DNA methylation, an epigenetic mechanism that regulates gene expression. Disruptions in methylation pathways have been implicated in ASD. Children with ASD often exhibit abnormal DNA methylation patterns and altered expression of genes involved in synaptic function and neurodevelopment [ 123 Folate supplementation may help correct these epigenetic disruptions. For instance, animal studies show that maternal folate supplementation can reverse methylation abnormalities and behavioral deficits in offspring exposed to environmental risk factors for ASD [ 120 Maternal folate deficiency during early brain development increases autism risk through multiple mechanisms: impaired DNA synthesis and repair, epigenetic dysregulation, and elevated neurotoxic homocysteine. Both animal and human studies support the protective effect of adequate maternal folate against ASD. Ensuring sufficient maternal folate intake before and during early pregnancy is a key public health strategy to reduce the risk of autism and optimize neurodevelopmental outcomes. Recent clinical trials have investigated the effects of high-dose leucovorin (a bioactive form of folate) in children with ASD, particularly those with mitochondrial dysfunction or folate receptor autoantibodies [ 124 34 115 116 7.2. Maternal Folate Deficiency and Autism Risk Decreased access to folate during gestation can be due to low maternal folate levels, genetic variants, or autoimmune disorders [ 46 125 Table 4 7.2.1. Impaired DNA Synthesis and Neuronal Repair Folate is essential for DNA synthesis and repair, especially during periods of rapid cell division in early embryonic brain development. Deficiency leads to DNA instability and impaired neuronal repair, potentially causing abnormal brain structure and function, key features implicated in autism spectrum disorder (ASD) [ 126 7.2.2. Homocysteine Accumulation and Neurotoxicity Folate regulates homocysteine metabolism. Without adequate folate, homocysteine levels rise. Elevated homocysteine is neurotoxic. It can disrupt neuronal migration, synapse formation, and myelination, all critical for normal brain development. High maternal homocysteine is associated with an increased ASD risk in offspring [ 127 7.2.3. Disrupted Methylation and Epigenetic Regulation Folate provides methyl groups for DNA methylation, a key epigenetic process that controls gene expression during neurodevelopment. Deficiency results in hypomethylation, leading to the abnormal activation or silencing of genes crucial for brain development, synaptic function, and neuronal connectivity. Epigenetic dysregulation is a recognized mechanism in ASD etiology [ 126 7.2.4. Altered Neurotransmitter Synthesis Folate is involved in the synthesis of neurotransmitters such as serotonin, dopamine, and norepinephrine. Deficiency may lead to imbalances in these neurotransmitters, which are often observed in individuals with ASD [ 128 7.2.5. Oxidative Stress and Inflammation Low folate levels increase oxidative stress and susceptibility to neuroinflammation. Both oxidative stress and chronic inflammation are implicated in the pathogenesis of ASD [ 129 130 131 34 115 116 7.3. Critical Periods for Folate and Autism Research consistently identifies early pregnancy, particularly the periconceptional period (just before and shortly after conception) and the first trimester, as the most critical window for folate intake to reduce autism risk in offspring. Multiple large cohort and case–control studies demonstrate that folic acid supplementation starting before conception and continuing through early pregnancy is associated with a significantly lower risk of autism spectrum disorder (ASD) in children [ 121 132 133 134 The Norwegian Mother and Child Cohort Study found a 40–45% reduction in autistic disorder risk among women who took folic acid supplements from four weeks before to eight weeks after conception [ 132 122 When leucovorin was supplemented (at 7.5 mg/day) periconceptionally and throughout gestation in two women expressing folate receptor autoantibodies, and with prior ASD births, the children were neurotypical at three years of age [ 135 The first month of pregnancy, when the neural tube forms and closes, is especially sensitive to folate status [ 127 Continuous folic acid supplementation from the periconceptional through to the prenatal period may offer the greatest protective effect to reduce ASD risk [ 132 133 135 132 133 Some evidence suggests a U-shaped relationship: both low and excessively high maternal folate levels may increase ASD risk, while moderate, recommended intake is optimal [ 132 135 7.3.1. Insights from Folate Supplementation in Reducing Risk of Autism An important critical period for folate intake to prevent autism is from at least one month prior to conception to the first trimester of pregnancy. Supplementation during this window is strongly associated with a reduced risk of ASD in offspring [ 121 132 133 134 The overall observations are as follows: Begin Supplementation Before Conception: Start at least one month before trying to conceive and continue through the first trimester of pregnancy [ 121 132 133 134 Maintain Adequate Intake: 400 micrograms (mcg) of folic acid daily is the widely recommended dose for women planning pregnancy and during early gestation [ 127 133 Continue Through Early Pregnancy: Ensure consistent intake through the first 2–3 months of pregnancy, the period of neural tube and early brain development [ 127 133 Maternal folate is crucial for neurodevelopment during critical pregnancy windows due to its central role in several fundamental biological processes required for healthy brain formation and function in the fetus. We recommend trials to confirm and expand this, and we are actively engaged with proposing studies to accomplish this. 7.3.2. DNA Synthesis and Cellular Proliferation Folate is essential for DNA synthesis and repair, supporting the rapid cell division and growth that occur during early embryonic development. This is especially important for neural stem cell proliferation and differentiation, which lay the foundation for the brain’s structure and complexity [ 119 136 137 Neural Tube Closure. During the first month of pregnancy, folate is critical for the closure of the neural tube—a process that, if disrupted, results in severe neural tube defects such as spina bifida and anencephaly. This is why periconceptional folic acid supplementation is universally recommended to women planning pregnancy [ 119 136 137 138 Epigenetic Regulation and Gene Expression. Folate acts as a methyl donor in one-carbon metabolism, which is required for DNA methylation. Proper methylation regulates the gene expression patterns necessary for normal brain development. Disrupted methylation due to folate deficiency can lead to long-lasting neurodevelopmental and cognitive changes in offspring [ 119 136 137 Neurotransmitter and Phospholipid Synthesis. Folate is involved in the synthesis of key neurotransmitters (serotonin, dopamine, norepinephrine, and acetylcholine) and phospholipids, both of which are vital for neuronal signaling, connectivity, and myelination [ 119 136 137 Prevention of Cell Death (Apoptosis). Adequate maternal folate reduces apoptosis (programmed cell death) in developing brain regions, ensuring proper formation of neural circuits [ 137 Maintenance of Healthy Homocysteine Levels. Folate helps maintain low homocysteine concentrations. Elevated homocysteine is neurotoxic and has been linked to impaired neurodevelopment [ 119 136 Human studies, while sometimes inconsistent due to methodological differences, generally support that adequate maternal folate, especially during the periconceptional period and first trimester, is associated with better neurodevelopmental and cognitive outcomes in children [ 119 136 137 139 Table 5 Maternal folate is vital during critical pregnancy windows because it underpins DNA synthesis, gene regulation, neurotransmitter production, and neural tube closure, all of which are foundational for healthy fetal brain development [ 119 136 7.3.3. Insights from Folate Supplementation in Reducing Risk of Autism Periconceptional and first-trimester folate intake are most strongly associated with reduced ASD risk and better neurodevelopmental outcomes [ 121 132 133 134 135 Very high maternal folate/B12 levels late in pregnancy may be associated with an increased ASD risk, suggesting that moderation is important [ 132 Genetic factors (e.g., MTHFR polymorphisms) can modify the protective effect of folate [ 132 134 Plasma/whole-blood folate levels alone are less predictive than supplement use, possibly due to timing and individual metabolism [ 132 The use of leucovorin during the periconceptional period and throughout gestation may mitigate the risk associated with gene variants and maternal FRAA [ 135 7.4. Leucovorin Clinical Trials Leucovorin (5-formyl-tetrahydrofolate, folinic acid) is a bioactive form of folate that bypasses certain metabolic blocks, including those caused by folate receptor autoantibodies or mitochondrial dysfunction, both of which are more prevalent in many children presenting with autism spectrum disorder. Folate receptor alpha autoantibodies are present in approximately 70% of ASD children [ 34 124 Clinical trials using leucovorin have been completed in multiple countries, with similar findings in all [ 34 115 116 117 140 The findings indicate that leucovorin can lead to clinically meaningful improvements in core ASD symptoms, especially language and communication, in children with mitochondrial dysfunction or cerebral folate deficiency [ 34 115 116 117 140 The benefits are most pronounced in subgroups with biomarkers indicating impaired folate transport or metabolism, as measured by the presence of the folate receptor autoantibody. Leucovorin is effective due to three features: Bypasses Blocked Folate Transport. Leucovorin is rapidly metabolized to L-methylfolate, which can cross the blood–brain barrier via alternative transporters, even when folate receptor alpha is blocked by autoantibodies or the individual has a genetic polymorphism reducing active transport. Supports Mitochondrial Function. Leucovorin may enhance mitochondrial energy production, reduce oxidative stress, and improve neuronal metabolism. Restores Methylation. As a methyl donor, it supports DNA methylation and neurotransmitter synthesis, processes often disrupted in ASD. A limitation of leucovorin treatment is that not all children respond. The most significant benefits are seen in children with folate receptor autoantibodies and/or with mitochondrial dysfunction. Because most studies are short term (12–24 weeks), long-term efficacy and safety require further research. High-dose leucovorin is an effective and generally well-tolerated intervention for improving core symptoms, particularly language and communication, in ASD children who have mitochondrial dysfunction or folate receptor autoantibodies. The strongest evidence comes from randomized controlled trials and open-label studies. The benefits are most pronounced in biomarker-positive subgroups. Further research is needed to optimize dosing and duration and to identify all responsive phenotypes [ 34 115 116 117 140 8. Conclusions Current evidence demonstrates that deficiencies or insufficiencies in key vitamins, including folate (B9) and vitamins B6 and B12, C, D, and E, play a pivotal role in the pathogenesis of endothelial dysfunction, arterial stiffness, and subsequent development of a range of vascular and degenerative disorders. Restoration of vitamin status, especially with bioactive forms and targeted supplementation, improves endothelial function and microvascular health, underscoring the therapeutic potential of correcting deficiencies. Table 6 Clinically, poor vascular health resulting from impaired vitamin metabolism or absorption can manifest as cerebrovascular disease, lymphedema, cognitive decline, age-related macular degeneration, glaucoma, and diabetic microvascular complications. The mechanisms driving these associations involve hyperhomocysteinemia, increased oxidative stress, impaired nitric oxide signaling, defective collagen synthesis, and heightened inflammation—all modifiable via nutritional intervention and supplementation, as summarized in Figure 2 Despite strong observational and mechanistic studies supporting the link between vitamin deficiency and vascular risk, interventional trials have produced mixed results, particularly for cardiovascular disease events. Nevertheless, normalization of vitamin levels, particularly vitamin D and homocysteine-lowering B vitamins (with the most effective forms of such B vitamins), can improve vascular function metrics and reduce risk factors. These findings suggest that clinical strategies prioritizing adequate vitamin intake, tailored supplementation, and the use of bioavailable forms may enhance patient outcomes and help prevent the progression of disorders rooted in poor vascular health. Additionally, neurodegenerative disorders such as autism are impacted by cerebral folate deficiency and show benefit from treatment with natural folate in the form of leucovorin. One of the overarching points throughout this review has been the variation in folate source, whether natural, from foods and L-methylfolate supplements; synthetic, from folic acid fortified in grain products (the most recent CDC list can be found in [ 141 Table 6 112 Overall, we suggest consideration of folic acid supplementation policies given that such supplementation may be maladaptive for a significant fraction of the population, specifically those with folate metabolism polymorphisms or immune production of FRAA. It may be that, in the current environment, a large cohort of individuals who are susceptible to UMFA may be inadvertently consuming excess folic acid in prepared foods. Consideration of the lowering of folic acid supplementation may be called for. In clinical practice, we recommend routine screening for hyperhomocysteinemia and, when found, to test for vitamin B12 deficiency, to test for plasma folic acid, and to treat with L-methylfolate sufficient to decrease homocysteine levels. With severe folate insufficiencies such as those seen in autism, treatment with drug products containing leucovorin or levoleucovorin is warranted. Such treatment is typically based on a diagnostic test for cerebral folate deficiency. In several published studies, this has been successfully addressed with the daily provision of several mg of L-methylfolate, along with vitamins B12, B6, and D, with no adverse effect. Optimizing vascular health requires a multifaceted approach: correcting vitamin deficiencies, understanding their molecular effects on endothelial and smooth muscle cells, and integrating nutritional therapy with standard clinical care. Further trials are warranted to define optimal intervention protocols and outcomes for vitamin-based therapies in the prevention and management of degenerative vascular diseases. Disclaimer/Publisher’s Note: Institutional Review Board Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The author declares no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: L-5-MTHF 5-methyl-(6S)-tetrahydrofolate, L-methylfolate MTHFR MTHF reductase DHFR Dihydrofolate reductase CVD Cardiovascular disease FMD Flow-mediated diffusion CAD Coronary artery disease VEGF Vascular endothelial growth factor UMFA Unmetabolized folic acid DFE Dietary folate equivalent CFD Cerebral folate deficiency AMD Age-related macular degeneration MCI Mild cognitive impairment ASD Autism spectrum disorder References 1. Josifova T. Konieczka K. Schötzau A. Flammer J. The Effect of a Specific Vitamin Supplement Containing L-Methylfolate (Ocufolin Forte) in Patients with Neovascular Age-Related Macular Degeneration Adv. Ophthalmol. Pract. Res. 2025 5 135 141 10.1016/j.aopr.2025.03.001 40276027 PMC12020837 2. Ayoub G. Treatment of Primary Lymphedema Following Lessons from Endothelin-Driven Retinal Edema, a Case Report Heal. TIMES Schweiz. Ärztejournal J. Médecins Suisses 2024 14 10 13 3. Stanhewicz A.E. Kenney W.L. Role of Folic Acid in Nitric Oxide Bioavailability and Vascular Endothelial Function Nutr. Rev. 2017 75 61 70 10.1093/nutrit/nuw053 27974600 PMC5155615 4. Baddam S. Khan K.M. Jialal I. Folic Acid Deficiency StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 30570998 5. Bailey L.B. Stover P.J. McNulty H. Fenech M.F. Gregory J.F. Mills J.L. Pfeiffer C.M. Fazili Z. Zhang M. Ueland P.M. Biomarkers of Nutrition for Development—Folate Review J. Nutr. 2015 145 1636S 1680S 10.3945/jn.114.206599 26451605 PMC4478945 6. Doshi S.N. McDowell I.F.W. Moat S.J. Lang D. Newcombe R.G. Kredan M.B. Lewis M.J. Goodfellow J. Folate Improves Endothelial Function in Coronary Artery Disease Arterioscler. Thromb. Vasc. Biol. 2001 21 1196 1202 10.1161/hq0701.092000 11451751 7. Ayoub G. Luo Y. Ischemia from Retinal Vascular Hypertension in Normal Tension Glaucoma: Neuroprotective Role of Folate Am. J. Biomed. Sci. Res. 2023 20 861 10.34297/AJBSR.2023.20.002786 8. Raghubeer S. Matsha T.E. Methylenetetrahydrofolate (MTHFR), the One-Carbon Cycle, and Cardiovascular Risks Nutrients 2021 13 4562 10.3390/nu13124562 34960114 PMC8703276 9. Smith D.J.M. Folate and Folic Acid Metabolism: A Significant Nutrient-Gene-Environment Interaction Med. Res. Arch. 2023 11 3824 10.18103/mra.v11i5.3824 10. Zheng Y. Cantley L.C. Toward a Better Understanding of Folate Metabolism in Health and Disease J. Exp. Med. 2019 216 253 266 10.1084/jem.20181965 30587505 PMC6363433 11. Obeid R. The Metabolic Burden of Methyl Donor Deficiency with Focus on the Betaine Homocysteine Methyltransferase Pathway Nutrients 2013 5 3481 3495 10.3390/nu5093481 24022817 PMC3798916 12. Zamani M. Rezaiian F. Saadati S. Naseri K. Ashtary-Larky D. Yousefi M. Golalipour E. Clark C.C.T. Rastgoo S. Asbaghi O. The Effects of Folic Acid Supplementation on Endothelial Function in Adults: A Systematic Review and Dose-Response Meta-Analysis of Randomized Controlled Trials Nutr. J. 2023 22 12 10.1186/s12937-023-00843-y 36829207 PMC9951414 13. Sakakeeny L. Roubenoff R. Obin M. Fontes J.D. Benjamin E.J. Bujanover Y. Jacques P.F. Selhub J. Plasma Pyridoxal-5-Phosphate Is Inversely Associated with Systemic Markers of Inflammation in a Population of U.S. Adults J. Nutr. 2012 142 1280 1285 10.3945/jn.111.153056 22623384 PMC3374666 14. Green R. Miller J.W. Vitamin B12 Deficiency Vitam. Horm. 2022 119 405 439 10.1038/nrdp.2017.40 35337628 15. Julian T. Syeed R. Glascow N. Angelopoulou E. Zis P. B12 as a Treatment for Peripheral Neuropathic Pain: A Systematic Review Nutrients 2020 12 2221 10.3390/nu12082221 32722436 PMC7468922 16. McNulty H. Pentieva K. Hoey L. Ward M. Homocysteine, B-Vitamins and CVD Proc. Nutr. Soc. 2008 67 232 237 10.1017/S0029665108007076 18412997 17. Deepika Kumari A. Singh S. Ahmad M.F. Chaki D. Poria V. Kumar S. Saini N. Yadav N. Sangwan N. Vitamin D: Recent Advances, Associated Factors, and Its Role in Combating Non-Communicable Diseases NPJ Sci. Food 2025 9 100 10.1038/s41538-025-00460-5 40514375 PMC12166060 18. Yasmin F. Ali S.H. Naeem A. Savul S. Afridi M.S.I. Kamran N. Fazal F. Khawer S. Savul I.S. Najeeb H. Current Evidence and Future Perspectives of the Best Supplements for Cardioprotection: Have We Reached the Final Chapter for Vitamins? Rev. Cardiovasc. Med. 2022 23 381 10.31083/j.rcm2311381 39076184 PMC11269067 19. Grant W.B. Boucher B.J. Cheng R.Z. Pludowski P. Wimalawansa S.J. Vitamin D and Cardiovascular Health: A Narrative Review of Risk Reduction Evidence Nutrients 2025 17 2102 10.3390/nu17132102 40647207 PMC12251170 20. Chen Y. Chen D. Peng Y. Wang M. Wang W. Shi F. Wang Y. Hua L. The Effect of Vitamin D Supplementation on Endothelial Function: An Umbrella Review of Interventional Meta-Analyses Nutr. Metab. Cardiovasc. Dis. 2025 35 103871 10.1016/j.numecd.2025.103871 39986938 21. US Preventive Services Task Force Vitamin, Mineral, and Multivitamin Supplementation to Prevent Cardiovascular Disease and Cancer: US Preventive Services Task Force Recommendation Statement JAMA 2022 327 2326 2333 10.1001/jama.2022.8970 35727271 22. Al Mheid I. Patel R. Murrow J. Morris A. Rahman A. Fike L. Kavtaradze N. Uphoff I. Hooper C. Tangpricha V. Vitamin D Status Is Associated with Arterial Stiffness and Vascular Dysfunction in Healthy Humans J. Am. Coll. Cardiol. 2011 58 186 192 10.1016/j.jacc.2011.02.051 21718915 PMC3896949 23. Hariri E. Kassis N. Iskandar J.-P. Schurgers L.J. Saad A. Abdelfattah O. Bansal A. Isogai T. Harb S.C. Kapadia S. Vitamin K2—A Neglected Player in Cardiovascular Health: A Narrative Review Open Heart 2021 8 e001715 10.1136/openhrt-2021-001715 34785587 PMC8596038 24. Ryu T. Chae S.Y. Lee J. Han J.W. Yang H. Chung B.S. Yang K. Multivitamin Supplementation and Its Impact in Metabolic Dysfunction-Associated Steatotic Liver Disease Sci. Rep. 2025 15 8675 10.1038/s41598-025-92858-0 40082562 PMC11906897 25. Folate (Folic Acid)—Vitamin B9 • The Nutrition Source Available online: https://nutritionsource.hsph.harvard.edu/folic-acid/ (accessed on 4 August 2025) 26. Manolis A.A. Manolis T.A. Melita H. Manolis A.S. Role of Vitamins in Cardiovascular Health: Know Your Facts-Part 2 Curr. Vasc. Pharmacol. 2023 21 399 423 10.2174/1570161121666230911115725 37694779 27. Institute for Natural Medicine Staff Fact Sheet: Folate (Vitamin B9) & Folic Acid Institute for Natural Medicine Seattle, WA, USA 2024 28. Hardy K.K. Embry L. Kairalla J.A. Helian S. Devidas M. Armstrong D. Hunger S. Carroll W.L. Larsen E. Raetz E.A. Neurocognitive Functioning of Children Treated for High-Risk B-Acute Lymphoblastic Leukemia Randomly Assigned to Different Methotrexate and Corticosteroid Treatment Strategies: A Report from the Children’s Oncology Group J. Clin. Oncol. Off. J. Am. Soc. Clin. Oncol. 2017 35 2700 2707 10.1200/JCO.2016.71.7587 PMC5549456 28671857 29. Caudill M.A. Folate Bioavailability: Implications for Establishing Dietary Recommendations and Optimizing Status Am. J. Clin. Nutr. 2010 91 1455S 1460S 10.3945/ajcn.2010.28674E 20219964 PMC2854911 30. Office of Dietary Supplements—Folate Available online: https://ods.od.nih.gov/factsheets/Folate-HealthProfessional/ (accessed on 4 August 2025) 31. Zheng J. Wang X. Wu B. Qiao L. Zhao J. Pourkheirandish M. Wang J. Zheng X. Folate (Vitamin B9) Content Analysis in Bread Wheat ( Triticum aestivum Front. Nutr. 2022 9 933358 10.3389/fnut.2022.933358 36337661 PMC9633958 32. Merrell B.J. McMurry J.P. Folic Acid StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 32119374 33. Tate C. Shuman A. Nice S. Salehi P. The Critical Role of Folate in Prenatal Health and a Proposed Shift from Folic Acid to 5-Methyltetrahydrofolate Supplementation Georget. Med. Rev. 2024 8 124570 10.52504/001c.124570 34. Frye R.E. Slattery J. Delhey L. Furgerson B. Strickland T. Tippett M. Sailey A. Wynne R. Rose S. Melnyk S. Folinic Acid Improves Verbal Communication in Children with Autism and Language Impairment: A Randomized Double-Blind Placebo-Controlled Trial Mol. Psychiatry 2018 23 247 256 10.1038/mp.2016.168 27752075 PMC5794882 35. Bjørke-Monsen A.-L. Ueland P.M. Folate—A Scoping Review for Nordic Nutrition Recommendations 2023 Food Nutr. Res. 2023 67 10258 10.29219/fnr.v67.10258 38187793 PMC10770645 36. Clifford A.J. Heid M.K. Peerson J.M. Bills N.D. Bioavailability of Food Folates and Evaluation of Food Matrix Effects with a Rat Bioassay J. Nutr. 1991 121 445 453 10.1093/jn/121.4.445 2007897 37. McKay J.A. Groom A. Potter C. Coneyworth L.J. Ford D. Mathers J.C. Relton C.L. Genetic and Non-Genetic Influences during Pregnancy on Infant Global and Site Specific DNA Methylation: Role for Folate Gene Variants and Vitamin B12 PLoS ONE 2012 7 e33290 10.1371/journal.pone.0033290 22479380 PMC3316565 38. Coppedè F. The Genetics of Folate Metabolism and Maternal Risk of Birth of a Child with Down Syndrome and Associated Congenital Heart Defects Front. Genet. 2015 6 223 10.3389/fgene.2015.00223 26161087 PMC4479818 39. van der Linden I.J.M. Afman L.A. Heil S.G. Blom H.J. Genetic Variation in Genes of Folate Metabolism and Neural-Tube Defect Risk Proc. Nutr. Soc. 2006 65 204 215 10.1079/PNS2006495 16672082 40. Au K. Findley T. Northrup H. Finding the Genetic Mechanisms of Folate Deficiency and Neural Tube Defects—Leaving No Stone Unturned Am. J. Med. Genet. A. 2017 173 3042 3057 10.1002/ajmg.a.38478 28944587 PMC5650505 41. Devogelaere T. Schôtzau A. The Effects of Vitamin Supplementation Containing L-Methylfolate (Ocufolin ® Heakthbook TIMES 2021 3 54 59 10.36000/hbT.2021.03.001 42. Lee I. Piao S. Kim S. Nagar H. Choi S.-J. Jeon B.H. Oh S.-H. Irani K. Kim C.-S. CRIF1 Deficiency Increased Homocysteine Production by Disrupting Dihydrofolate Reductase Expression in Vascular Endothelial Cells Antioxidants 2021 10 1645 10.3390/antiox10111645 34829516 PMC8614757 43. Wang Q. Yang J. Yu C. Deng Y. Wen Q. Yang H. Liu H. Luo R. Case Report: Cerebral Folate Deficiency Caused by FOLR1 Variant Front. Pediatr. 2024 12 1434209 10.3389/fped.2024.1434209 39328591 PMC11424398 44. Skavinska O. Rossokha Z. Fishchuk L. Gorovenko N. RFC VDR Hum. Gene 2025 44 201399 10.1016/j.humgen.2025.201399 45. Stefanyshyn V. Stetsyuk R. Hrebeniuk O. Ayoub G. Fishchuk L. Rossokha Z. Gorovenko N. Analysis of the Association Between the SLC19A1 Genetic Variant (Rs1051266) and Autism Spectrum Disorders, Cerebral Folate Deficiency, and Clinical and Laboratory Parameters J. Mol. Neurosci. MN 2025 75 42 10.1007/s12031-025-02338-3 40156756 46. Ayoub G. Autism Spectrum Disorder as a Multifactorial Disorder: The Interplay of Genetic Factors and Inflammation Int. J. Mol. Sci. 2025 26 6483 10.3390/ijms26136483 40650268 PMC12249793 47. McDowell I.F.W. Lang D. Homocysteine and Endothelial Dysfunction: A Link with Cardiovascular Disease J. Nutr. 2000 130 369S 372S 10.1093/jn/130.2.369S 10721909 48. Moat S.J. Lang D. McDowell I.F.W. Clarke Z.L. Madhavan A.K. Lewis M.J. Goodfellow J. Folate, Homocysteine, Endothelial Function and Cardiovascular Disease J. Nutr. Biochem. 2004 15 64 79 10.1016/j.jnutbio.2003.08.010 14972346 49. Verhaar M.C. Stroes E. Rabelink T.J. Folates and Cardiovascular Disease Arterioscler. Thromb. Vasc. Biol. 2002 22 6 13 10.1161/hq0102.102190 11788454 50. Clarke R. Bennett D.A. Parish S. Verhoef P. Dötsch-Klerk M. Lathrop M. Xu P. Nordestgaard B.G. Holm H. Hopewell J.C. Homocysteine and Coronary Heart Disease: Meta-Analysis of MTHFR Case-Control Studies, Avoiding Publication Bias PLoS Med. 2012 9 e1001177 10.1371/journal.pmed.1001177 22363213 PMC3283559 51. McRae M.P. High-Dose Folic Acid Supplementation Effects on Endothelial Function and Blood Pressure in Hypertensive Patients: A Meta-Analysis of Randomized Controlled Clinical Trials J. Chiropr. Med. 2009 8 15 24 10.1016/j.jcm.2008.09.001 19646382 PMC2697578 52. Varadharaj S. Kelly O.J. Khayat R.N. Kumar P.S. Ahmed N. Zweier J.L. Role of Dietary Antioxidants in the Preservation of Vascular Function and the Modulation of Health and Disease Front. Cardiovasc. Med. 2017 4 64 10.3389/fcvm.2017.00064 29164133 PMC5671956 53. Li Y. Huang T. Zheng Y. Muka T. Troup J. Hu F.B. Folic Acid Supplementation and the Risk of Cardiovascular Diseases: A Meta-Analysis of Randomized Controlled Trials J. Am. Heart Assoc. Cardiovasc. Cerebrovasc. Dis. 2016 5 e003768 10.1161/JAHA.116.003768 PMC5015297 27528407 54. Xu X. Wei W. Jiang W. Song Q. Chen Y. Li Y. Zhao Y. Sun H. Yang X. Association of Folate Intake with Cardiovascular-Disease Mortality and All-Cause Mortality among People at High Risk of Cardiovascular-Disease Clin. Nutr. Edinb. Scotl. 2022 41 246 254 10.1016/j.clnu.2021.11.007 34929527 55. Otsu Y. Ae R. Kuwabara M. Folate and Cardiovascular Disease Hypertens. Res. 2023 46 1816 1818 10.1038/s41440-023-01307-w 37173431 56. Loria C.M. Ingram D.D. Feldman J.J. Wright J.D. Madans J.H. Serum Folate and Cardiovascular Disease Mortality Among US Men and Women Arch. Intern. Med. 2000 160 3258 3262 10.1001/archinte.160.21.3258 11088087 57. Bailey S.W. Ayling J.E. The Extremely Slow and Variable Activity of Dihydrofolate Reductase in Human Liver and Its Implications for High Folic Acid Intake Proc. Natl. Acad. Sci. USA 2009 106 15424 15429 10.1073/pnas.0902072106 19706381 PMC2730961 58. Fardous A.M. Heydari A.R. Uncovering the Hidden Dangers and Molecular Mechanisms of Excess Folate: A Narrative Review Nutrients 2023 15 4699 10.3390/nu15214699 37960352 PMC10648405 59. Folate—Dietary Reference Intakes for Thiamin, Riboflavin, Niacin, Vitamin B6, Folate, Vitamin B12, Pantothenic Acid, Biotin, and Choline—NCBI Bookshelf Available online: https://www.ncbi.nlm.nih.gov/books/NBK114318/ (accessed on 5 August 2025) 23193625 60. Reynolds E.H. Sobczyńska-Malefora A. Green R. Fortification, Folate and Vitamin B12 Balance, and the Nervous System. Is Folic Acid Excess Potentially Harmful? Eur. J. Clin. Nutr. 2025 10.1038/s41430-025-01652-8 40813465 61. Study Details| NCT00317005 Available online: https://clinicaltrials.gov/study/NCT00317005 (accessed on 11 September 2025) 62. Tawakol A. Migrino R.Q. Aziz K.S. Waitkowska J. Holmvang G. Alpert N.M. Muller J.E. Fischman A.J. Gewirtz H. High-Dose Folic Acid Acutely Improves Coronary Vasodilator Function in Patients with Coronary Artery Disease JACC 2005 45 1580 1584 10.1016/j.jacc.2005.02.038 15893170 PMC1255966 63. Gori T. Burstein J.M. Ahmed S. Miner S.E.S. Al-Hesayen A. Kelly S. Parker J.D. Folic Acid Prevents Nitroglycerin-Induced Nitric Oxide Synthase Dysfunction and Nitrate Tolerance Circulation 2001 104 1119 1123 10.1161/hc3501.095358 11535566 64. Woo K.S. Chook P. Lolin Y.I. Sanderson J.E. Metreweli C. Celermajer D.S. Folic Acid Improves Arterial Endothelial Function in Adults with Hyperhomocystinemia J. Am. Coll. Cardiol. 1999 34 2002 2006 10.1016/S0735-1097(99)00469-6 10588216 65. Martens P. Tang W.H.W. Targeting the Lymphatic System for Interstitial Decongestion JACC Basic Transl. Sci. 2021 6 882 884 10.1016/j.jacbts.2021.10.003 34869952 PMC8617594 66. Brown S. Campbell A.C. Kuonqui K. Sarker A. Park H.J. Shin J. Kataru R.P. Coriddi M. Dayan J.H. Mehrara B.J. The Future of Lymphedema: Potential Therapeutic Targets for Treatment Curr. Breast Cancer Rep. 2023 5 233 241 10.1007/s12609-023-00491-5 37359311 PMC10233555 67. Brown S. Dayan J.H. Coriddi M. Campbell A. Kuonqui K. Shin J. Park H.J. Mehrara B.J. Kataru R.P. Pharmacological Treatment of Secondary Lymphedema Front. Pharmacol. 2022 13 828513 10.3389/fphar.2022.828513 35145417 PMC8822213 68. Hablitz L.M. Nedergaard M. The Glymphatic System: A Novel Component of Fundamental Neurobiology J. Neurosci. Off. J. Soc. Neurosci. 2021 41 7698 7711 10.1523/JNEUROSCI.0619-21.2021 34526407 PMC8603752 69. Gao Y. Liu K. Zhu J. Glymphatic System: An Emerging Therapeutic Approach for Neurological Disorders Front. Mol. Neurosci. 2023 16 1138769 10.3389/fnmol.2023.1138769 37485040 PMC10359151 70. Jessen N.A. Munk A.S.F. Lundgaard I. Nedergaard M. The Glymphatic System—A Beginner’s Guide Neurochem. Res. 2015 40 2583 2599 10.1007/s11064-015-1581-6 25947369 PMC4636982 71. Ghanizada H. Nedergaard M. The Glymphatic System Handb. Clin. Neurol. 2025 209 161 170 10.1016/B978-0-443-19104-6.00006-1 40122623 72. Beschorner N. Nedergaard M. Glymphatic System Dysfunction in Neurodegenerative Diseases Curr. Opin. Neurol. 2024 37 182 188 10.1097/wco.0000000000001252 38345416 73. Corbali O. Levey A.I. Glymphatic System in Neurological Disorders and Implications for Brain Health Front. Neurol. 2025 16 1543725 10.3389/fneur.2025.1543725 39974364 PMC11835678 74. Yamamoto E.A. Bagley J.H. Geltzeiler M. Sanusi O.R. Dogan A. Liu J.J. Piantino J. The Perivascular Space Is a Conduit for Cerebrospinal Fluid Flow in Humans: A Proof-of-Principle Report Proc. Natl. Acad. Sci. USA 2024 121 e2407246121 10.1073/pnas.2407246121 39374384 PMC11494350 75. Baker S. Baker D. Baker R. Brown C.J. Case Series of Retinal Vein Occlusions Showing Early Recovery Using Oral L-Methylfolate Ther. Adv. Ophthalmol. 2024 16 25158414241240687 10.1177/25158414241240687 38628356 PMC11020740 76. Gu J. Lei C. Zhang M. Folate and Retinal Vascular Diseases BMC Ophthalmol. 2023 23 413 10.1186/s12886-023-03149-z 37833663 PMC10571445 77. Mohamed R. Sharma I. Ibrahim A.S. Saleh H. Elsherbiny N.M. Fulzele S. Elmasry K. Smith S.B. Al-Shabrawey M. Tawfik A. Hyperhomocysteinemia Alters Retinal Endothelial Cells Barrier Function and Angiogenic Potential via Activation of Oxidative Stress Sci. Rep. 2017 7 11952 10.1038/s41598-017-09731-y 28931831 PMC5607263 78. Mysona B.A. Jiang G. Martin-Studdard A. Roon P. Moister B. Ganapathy V. Smith S.B. Effects of Folate Supplementation on Homocysteine-Induced Retinopathy in Cbs Mice Investig. Ophthalmol. Vis. Sci. 2007 48 633 79. Flammer J. Konieczka K. Retinal Venous Pressure: The Role of Endothelin EPMA J. 2015 6 21 10.1186/s13167-015-0043-1 26504500 PMC4620652 80. Elsherbiny N.M. Sharma I. Kira D. Alhusban S. Samra Y.A. Jadeja R. Martin P. Al-Shabrawey M. Tawfik A. Homocysteine Induces Inflammation in Retina and Brain Biomolecules 2020 10 393 10.3390/biom10030393 32138265 PMC7175372 81. George A. Managing Normal Tension Glaucoma with Dietary Folate J. Clin. Res. Ophthalmol. 2024 11 017 023 10.17352/2455-1414.000106 82. Navneet S. Cui X. Zhao J. Wang J. Kaidery N.A. Thomas B. Bollinger K.E. Yoon Y. Smith S.B. Excess Homocysteine Upregulates the NRF2-Antioxidant Pathway in Retinal Müller Glial Cells Exp. Eye Res. 2019 178 228 237 10.1016/j.exer.2018.03.022 29608906 PMC6167214 83. Devi S.R.B. Suganeswari G. Sharma T. Thennarasu M. Angayarkanni N. Homocysteine Induces Oxidative Stress in Young Adult Central Retinal Vein Occlusion Br. J. Ophthalmol. 2012 96 1122 1126 10.1136/bjophthalmol-2011-301370 22628536 84. Böhm E.W. Buonfiglio F. Voigt A.M. Bachmann P. Safi T. Pfeiffer N. Gericke A. Oxidative Stress in the Eye and Its Role in the Pathophysiology of Ocular Diseases Redox Biol. 2023 68 102967 10.1016/j.redox.2023.102967 38006824 PMC10701459 85. Tawfik A. Samra Y.A. Elsherbiny N.M. Al-Shabrawey M. Implication of Hyperhomocysteinemia in Blood Retinal Barrier (BRB) Dysfunction Biomolecules 2020 10 1119 10.3390/biom10081119 32751132 PMC7463551 86. Brown C. Wang J. Jiang H. Elias M.F. Homocysteine Reduction for Stroke Prevention: Regarding the Recent AHA/ASA 2021 Prevention of Stroke in Patients with Stroke and Transient Ischemic Attack Pharmacogenomics Pers. Med. 2023 16 895 900 10.2147/PGPM.S426421 PMC10559895 37810545 87. Smith A.D. Refsum H. Bottiglieri T. Fenech M. Hooshmand B. McCaddon A. Miller J.W. Rosenberg I.H. Obeid R. Homocysteine and Dementia: An International Consensus Statement J. Alzheimer’s Dis. JAD 2018 62 561 570 10.3233/JAD-171042 29480200 PMC5836397 88. Kronenberg G. Harms C. Sobol R.W. Cardozo-Pelaez F. Linhart H. Winter B. Balkaya M. Gertz K. Gay S.B. Cox D. Folate Deficiency Induces Neurodegeneration and Brain Dysfunction in Mice Lacking Uracil DNA Glycosylase J. Neurosci. 2008 28 7219 7230 10.1523/JNEUROSCI.0940-08.2008 18614692 PMC3844834 89. Rotstein A. Kodesh A. Goldberg Y. Reichenberg A. Levine S.Z. Serum Folate Deficiency and the Risks of Dementia and All-Cause Mortality: A National Study of Old Age Evid. Based Ment. Health 2022 25 63 68 10.1136/ebmental-2021-300309 35292483 PMC10231620 90. Smith A.D. Refsum H. Homocysteine, B Vitamins, and Cognitive Impairment Annu. Rev. Nutr. 2016 36 211 239 10.1146/annurev-nutr-071715-050947 27431367 91. Ma F. Wu T. Zhao J. Song A. Liu H. Xu W. Huang G. Folic Acid Supplementation Improves Cognitive Function by Reducing the Levels of Peripheral Inflammatory Cytokines in Elderly Chinese Subjects with MCI Sci. Rep. 2016 6 37486 10.1038/srep37486 27876835 PMC5120319 92. O’Connor D.M.A. Scarlett S. De Looze C. O’Halloran A.M. Laird E. Molloy A.M. Clarke R. McGarrigle C.A. Kenny R.A. Low Folate Predicts Accelerated Cognitive Decline: 8-Year Follow-up of 3140 Older Adults in Ireland Eur. J. Clin. Nutr. 2022 76 950 957 10.1038/s41430-021-01057-3 35022554 93. Ramos M.I. Allen L.H. Mungas D.M. Jagust W.J. Haan M.N. Green R. Miller J.W. Low Folate Status Is Associated with Impaired Cognitive Function and Dementia in the Sacramento Area Latino Study on Aging Am. J. Clin. Nutr. 2005 82 1346 1352 10.1093/ajcn/82.6.1346 16332669 94. Jang S. Han J.W. Shin J. Kim T.H. Kwak K.P. Kim K. Kim B.J. Kim S.G. Kim J.L. Kim T.H. Normal-But-Low Serum Folate Levels and the Risks for Cognitive Impairment Psychiatry Investig. 2019 16 532 538 10.30773/pi.2019.05.29 PMC6664218 31352735 95. Reynolds E.H. Folic Acid, Ageing, Depression, and Dementia BMJ 2002 324 1512 1515 10.1136/bmj.324.7352.1512 12077044 PMC1123448 96. Zhang J. Yue D. Zhang H. Cardiovascular Disease Attenuates the Protective Effect of Folate on Global Cognitive Function in an Elderly Population: A Cross-Sectional Study Sci. Rep. 2025 15 3327 10.1038/s41598-025-87129-x 39865092 PMC11770194 97. Yukawa M. Naka H. Murata Y. Katayama S. Kohriyama T. Mimori Y. Nakamura S. Folic Acid-Responsive Neurological Diseases in Japan J. Nutr. Sci. Vitaminol. 2001 47 181 187 10.3177/jnsv.47.181 11575572 98. Puga A.M. Ruperto M. Samaniego-Vaesken M.d.L. Montero-Bravo A. Partearroyo T. Varela-Moreiras G. Effects of Supplementation with Folic Acid and Its Combinations with Other Nutrients on Cognitive Impairment and Alzheimer’s Disease: A Narrative Review Nutrients 2021 13 2966 10.3390/nu13092966 34578844 PMC8470370 99. Wang M. Fang M. Zang W. Effects of Folic Acid Supplementation on Cognitive Function and Inflammation in Elderly Patients with Mild Cognitive Impairment: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Arch. Gerontol. Geriatr. 2024 126 105540 10.1016/j.archger.2024.105540 38964091 100. Zhang L. Chen X. Chen Y. Yan J. Huang G. Li W. A Comparative Study Evaluating the Effectiveness of Folate-Based B Vitamin Intervention on Cognitive Function of Older Adults under Mandatory Folic Acid Fortification Policy: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Nutrients 2024 16 2199 10.3390/nu16142199 39064642 PMC11279592 101. Ma F. Wu T. Zhao J. Han F. Marseglia A. Liu H. Huang G. Effects of 6-Month Folic Acid Supplementation on Cognitive Function and Blood Biomarkers in Mild Cognitive Impairment: A Randomized Controlled Trial in China J. Gerontol. Ser. A 2016 71 1376 1383 10.1093/gerona/glv183 26508298 102. Smith A.D. Refsum H. Homocysteine—From Disease Biomarker to Disease Prevention J. Intern. Med. 2021 290 826 854 10.1111/joim.13279 33660358 103. Wu Y. Smith A.D. Bastani N.E. Refsum H. Kwok T. The Dihydrofolate Reductase 19-Bp Deletion Modifies the Beneficial Effect of B-Vitamin Therapy in Mild Cognitive Impairment: Pooled Study of Two Randomized Placebo-Controlled Trials Hum. Mol. Genet. 2022 31 1151 1158 10.1093/hmg/ddab246 34788822 PMC8976423 104. Ling Y. Yuan S. Huang X. Tan S. Cheng H. Xu A. Lyu J. Associations of Folate/Folic Acid Supplementation Alone and in Combination with Other B Vitamins on Dementia Risk and Brain Structure: Evidence From 466 224 UK Biobank Participants J. Gerontol. Ser. A 2024 79 glad266 10.1093/gerona/glad266 PMC10957129 38029284 105. Chen S.-J. Chen H. You J. Chen S.-D. Fu Y. Zhang W. Huang L. Feng J.-F. Gao X. Cheng W. Machine Learning-Assisted Optimization of Dietary Intervention against Dementia Risk Nat. Hum. Behav. 2025 10.1038/s41562-025-02255-w 40603580 106. Sauer J. Mason J.B. Choi S.-W. Too Much Folate—A Risk Factor for Cancer and Cardiovascular Disease? Curr. Opin. Clin. Nutr. Metab. Care 2009 12 30 36 10.1097/MCO.0b013e32831cec62 19057184 PMC2790187 107. Fallah M. Karim Dehnavi M. Lotfi K. Aminianfar A. Azadbakht L. Esmaillzadeh A. Folate Biomarkers, Folate Intake, and Risk of Death from All Causes, Cardiovascular Disease, and Cancer: A Systematic Review and Dose-Response Meta-Analysis of Prospective Cohort Studies Nutr. Rev. 2025 83 e801 e813 10.1093/nutrit/nuae077 38950416 108. An P. Wan S. Luo Y. Luo J. Zhang X. Zhou S. Xu T. He J. Mechanick J.I. Wu W.-C. Micronutrient Supplementation to Reduce Cardiovascular Risk J. Am. Coll. Cardiol. 2022 80 2269 2285 10.1016/j.jacc.2022.09.048 36480969 109. Chen P. Tang L. Song Y. Wang B. Qin X. Zhang N. Wei Y. Xu X. Zhou Z. He Q. Association of Folic Acid Dosage with Circulating Unmetabolized Folic Acid in Chinese Adults with H-Type Hypertension: A Multicenter, Double-Blind, Randomized Controlled Trial Front. Nutr. 2023 10 1191610 10.3389/fnut.2023.1191610 37781132 PMC10538967 110. Husebye E.S.N. Wendel A.W.K. Gilhus N.E. Riedel B. Bjørk M.H. Plasma Unmetabolized Folic Acid in Pregnancy and Risk of Autistic Traits and Language Impairment in Antiseizure Medication-Exposed Children of Women with Epilepsy Am. J. Clin. Nutr. 2022 115 1432 1440 10.1093/ajcn/nqab436 34994378 PMC9071448 111. Cochrane K.M. Elango R. Devlin A.M. Hutcheon J.A. Karakochuk C.D. Human Milk Unmetabolized Folic Acid Is Increased Following Supplementation with Synthetic Folic Acid as Compared to (6S)-5-Methyltetrahydrofolic Acid Sci. Rep. 2023 13 11298 10.1038/s41598-023-38224-4 37438496 PMC10338559 112. Jankovic-Karasoulos T. Smith M.D. Leemaqz S. Mittinty M. Williamson J. McCullough D. Arthurs A.L. Dekker G.A. Roberts C.T. Maternal Folate Excess, Placental Hormones, and Gestational Diabetes Mellitus: Findings from Prospective Cohorts Before and After Mandatory Folic Acid Food Fortification Nutrients 2025 17 2863 10.3390/nu17172863 40944254 PMC12430050 113. Schöber C. Papageorgiou E. Harstrick A. Bokemeyer C. Mügge A. Stahl M. Wilke H. Poliwoda H. Hiddemann W. Köhne-Wömpner C.H. Cardiotoxicity of 5-Fluorouracil in Combination with Folinic Acid in Patients with Gastrointestinal Cancer Cancer 1993 72 2242 2247 10.1002/1097-0142(19931001)72:7&#x0003c;2242::AID-CNCR2820720730&#x0003e;3.0.CO;2-E 8374883 114. Ayoub G. Neurodevelopment of Autism: Critical Periods, Stress and Nutrition Cells 2024 13 1968 10.3390/cells13231968 39682717 PMC11640478 115. Renard E. Leheup B. Guéant-Rodriguez R.-M. Oussalah A. Quadros E.V. Guéant J.-L. Folinic Acid Improves the Score of Autism in the EFFET Placebo-Controlled Randomized Trial Biochimie 2020 173 57 61 10.1016/j.biochi.2020.04.019 32387472 116. Panda P.K. Sharawat I.K. Saha S. Gupta D. Palayullakandi A. Meena K. Efficacy of Oral Folinic Acid Supplementation in Children with Autism Spectrum Disorder: A Randomized Double-Blind, Placebo-Controlled Trial Eur. J. Pediatr. 2024 183 4827 4835 10.1007/s00431-024-05762-6 39243316 117. Zhang C. Chen Y. Hou F. Li Y. Wang W. Guo L. Zhang C. Li L. Lu C. Safety and Efficacy of High-Dose Folinic Acid in Children with Autism: The Impact of Folate Metabolism Gene Polymorphisms Nutrients 2025 17 1602 10.3390/nu17091602 40362912 PMC12073535 118. Blencowe H. Cousens S. Modell B. Lawn J. Folic Acid to Reduce Neonatal Mortality from Neural Tube Disorders Int. J. Epidemiol. 2010 39 (Suppl. S1) i110 i121 10.1093/ije/dyq028 20348114 PMC2845867 119. Naninck E.F.G. Stijger P.C. Brouwer-Brolsma E.M. The Importance of Maternal Folate Status for Brain Development and Function of Offspring Adv. Nutr. 2019 10 502 519 10.1093/advances/nmy120 31093652 PMC6520042 120. Barua S. Chadman K.K. Kuizon S. Buenaventura D. Stapley N.W. Ruocco F. Begum U. Guariglia S.R. Brown W.T. Junaid M.A. Increasing Maternal or Post-Weaning Folic Acid Alters Gene Expression and Moderately Changes Behavior in the Offspring PLoS ONE 2014 9 e101674 10.1371/journal.pone.0101674 25006883 PMC4090150 121. Surén P. Roth C. Bresnahan M. Haugen M. Hornig M. Hirtz D. Lie K.K. Lipkin W.I. Magnus P. Reichborn-Kjennerud T. Association Between Maternal Use of Folic Acid Supplements and Risk of Autism Spectrum Disorders in Children JAMA 2013 309 570 577 10.1001/jama.2012.155925 23403681 PMC3908544 122. Wang M. Li K. Zhao D. Li L. The Association between Maternal Use of Folic Acid Supplements during Pregnancy and Risk of Autism Spectrum Disorders in Children: A Meta-Analysis Mol. Autism 2017 8 51 10.1186/s13229-017-0170-8 29026508 PMC5625821 123. James S.J. Cutler P. Melnyk S. Jernigan S. Janak L. Gaylor D.W. Neubrander J.A. Metabolic Biomarkers of Increased Oxidative Stress and Impaired Methylation Capacity in Children with Autism Am. J. Clin. Nutr. 2004 80 1611 1617 10.1093/ajcn/80.6.1611 15585776 124. Frye R.E. Sequeira J.M. Quadros E.V. James S.J. Rossignol D.A. Cerebral Folate Receptor Autoantibodies in Autism Spectrum Disorder Mol. Psychiatry 2013 18 369 381 10.1038/mp.2011.175 22230883 PMC3578948 125. Raghavan R. Riley A.W. Volk H. Caruso D. Hironaka L. Sices L. Hong X. Wang G. Ji Y. Brucato M. Maternal Multivitamin Intake, Plasma Folate and Vitamin B12 Levels and Autism Spectrum Disorder Risk in Offspring Paediatr. Perinat. Epidemiol. 2018 32 100 111 10.1111/ppe.12414 28984369 PMC5796848 126. Gallo R. Stoccoro A. Cagiano R. Nicolì V. Ricciardi R. Tancredi R. Trovato R. Santorelli F.M. Calderoni S. Muratori F. Correlation among Maternal Risk Factors, Gene Methylation and Disease Severity in Females with Autism Spectrum Disorder Epigenomics 2022 14 175 185 10.2217/epi-2021-0494 35081728 127. Viswanathan M. Urrutia R.P. Hudson K.N. Middleton J.C. Kahwati L.C. Folic Acid Supplementation to Prevent Neural Tube Defects: Updated Evidence Report and Systematic Review for the US Preventive Services Task Force JAMA 2023 330 460 10.1001/jama.2023.9864 37526714 128. Bahous R.H. Jadavji N.M. Deng L. Cosín-Tomás M. Lu J. Malysheva O. Leung K.-Y. Ho M.-K. Pallàs M. Kaliman P. High Dietary Folate in Pregnant Mice Leads to Pseudo-MTHFR Deficiency and Altered Methyl Metabolism, with Embryonic Growth Delay and Short-Term Memory Impairment in Offspring Hum. Mol. Genet. 2017 26 888 900 10.1093/hmg/ddx004 28069796 PMC5409086 129. Jennings L. Basiri R. Amino Acids, B Vitamins, and Choline May Independently and Collaboratively Influence the Incidence and Core Symptoms of Autism Spectrum Disorder Nutrients 2022 14 2896 10.3390/nu14142896 35889852 PMC9318435 130. Usui N. Kobayashi H. Shimada S. Neuroinflammation and Oxidative Stress in the Pathogenesis of Autism Spectrum Disorder Int. J. Mol. Sci. 2023 24 5487 10.3390/ijms24065487 36982559 PMC10049423 131. Ramaekers V.T. Sequeira J.M. Blau N. Quadros E.V. A Milk-Free Diet Downregulates Folate Receptor Autoimmunity in Cerebral Folate Deficiency Syndrome Dev. Med. Child. Neurol. 2008 50 346 352 10.1111/j.1469-8749.2008.02053.x 18355335 PMC2715943 132. Hoxha B. Hoxha M. Domi E. Gervasoni J. Persichilli S. Malaj V. Zappacosta B. Folic Acid and Autism: A Systematic Review of the Current State of Knowledge Cells 2021 10 1976 10.3390/cells10081976 34440744 PMC8394938 133. Jiang Y. Guo C. Kuang M. Lin L. Xu G. Pan N. Weng X. Jing J. Shi L. Yi Q. Examining Associations of Folic Acid Supplements Administered to Mothers during Pre-Conceptional and Prenatal Periods with Autism Spectrum Disorders in Their Offspring: Insights from a Multi-Center Study in China Front. Public Health 2024 12 1321046 10.3389/fpubh.2024.1321046 38299071 PMC10827999 134. Schmidt R.J. Tancredi D.J. Ozonoff S. Hansen R.L. Hartiala J. Allayee H. Schmidt L.C. Tassone F. Hertz-Picciotto I. Maternal Periconceptional Folic Acid Intake and Risk of Autism Spectrum Disorders and Developmental Delay in the CHARGE (CHildhood Autism Risks from Genetics and Environment) Case-Control Study Am. J. Clin. Nutr. 2012 96 80 89 10.3945/ajcn.110.004416 22648721 PMC3374734 135. Giorlandino C. Margiotti K. Fabiani M. Mesoraca A. Folinic Acid Supplementation During Pregnancy in Two Women with Folate Receptor Alpha Autoantibodies: Potential Prevention of Autism Spectrum Disorder in Offspring Clin. Transl. Neurosci. 2025 9 30 10.3390/ctn9030030 136. Caffrey A. McNulty H. Irwin R.E. Walsh C.P. Pentieva K. Maternal Folate Nutrition and Offspring Health: Evidence and Current Controversies Proc. Nutr. Soc. 2019 78 208 220 10.1017/S0029665118002689 30585558 137. Irvine N. England-Mason G. Field C.J. Dewey D. Aghajafari F. Prenatal Folate and Choline Levels and Brain and Cognitive Development in Children: A Critical Narrative Review Nutrients 2022 14 364 10.3390/nu14020364 35057545 PMC8778665 138. Virdi S. Jadavji N.M. The Impact of Maternal Folates on Brain Development and Function after Birth Metabolites 2022 12 876 10.3390/metabo12090876 36144280 PMC9503684 139. Chen H. Qin L. Gao R. Jin X. Cheng K. Zhang S. Hu X. Xu W. Wang H. Neurodevelopmental Effects of Maternal Folic Acid Supplementation: A Systematic Review and Meta-Analysis Crit. Rev. Food Sci. Nutr. 2023 63 3771 3787 10.1080/10408398.2021.1993781 34672229 140. Batebi N. Moghaddam H.S. Hasanzadeh A. Mohammadi M.R. Akhondzadeh S. Folinic Acid as Adjunctive Therapy in Treatment of Inappropriate Speech in Children with Autism: A Double-Blind and Placebo-Controlled Randomized Trial Child. Psychiatry Hum. Dev. 2021 52 928 938 10.1007/s10578-020-01072-8 33029705 141. Crider K.S. Qi Y.P. Yeung L.F. Mai C.T. Zauche L.H. Wang A. Daniels K. Williams J.L. Folic Acid and the Prevention of Birth Defects: 30 Years of Opportunity and Controversies Annu. Rev. Nutr. 2022 42 423 452 10.1146/annurev-nutr-043020-091647 35995050 PMC9875360 Figure 1 Metabolism of vitamin B9. Left panel shows the typical starting point of dietary folate (present in many foods) or synthetic folic acid (used as a supplement). Folic acid needs to be reduced to di-hydro folate in the gut and the liver, a slow process, before it can be converted to the cellular active version methylfolate (5-MTHF). Right panel shows the role of folate, along with that of B6 and B12, in the metabolism of homocysteine to methionine, preventing homocysteine accumulation, which damages blood vessels [ 7 8 Figure 2 The factors involved in disorders connected with folate deficiencies. The disorders are divided into three categories depending on whether the folate deficiency is systemic, retinal, or cerebral. Systemic disorders include cardiovascular disease and lymphedema. Retinal disorders include AMD, glaucoma, and diabetic retinopathy. Cerebral disorders can be neurodevelopmental, such as autism (ASD), or neurodegenerative, such as dementia or cognitive decline. The driving forces for each category is a reduction in endothelial health, which results in diminished capillary exchange and reduced drainage from the perfused tissue. The capillaries can be systemic blood or lymphatic capillaries, retinal capillaries, or cerebral glymphatic capillaries. The aspects that influence endothelial health are the availability of bioactive folate, along with vitamin B12. Folate availability can be diminished in five ways. There is a reduction in dietary folate absorption in the gut with age; there can be alterations in the gut microbiome that reduce the chemical conversion of ingested folate; excess levels of folic acid can be consumed; excess unmetabolized folic acid enters the blood and competes with folate, reducing its access to cells; and, in a portion of the population, the presence of folate receptor autoantibodies (FRAAs) prevents sufficient folate from entering the cerebral cavity. In most cases, homocysteine provides a reliable biomarker, as small elevations indicate a decline in vascular health. Treatment typically includes reducing folic acid supplementation to under 400 μg/day; confirming the availability of vitamin B12; increasing natural folate through foods and/or leucovorin or L-methylfolate supplementation and, in more severe cases, a drug product containing leucovorin or levoleucovorin; and possibly restoring microbiome diversity. nutrients-17-02955-t001_Table 1 Table 1 Key food sources of folate. Food Product Example Foods Dark green leafy vegetables Spinach, kale, collard greens, and romaine lettuce Legumes Beans, lentils, and peas Fruits Oranges, avocados, bananas, and melons Nuts and seeds Peanuts and sunflower seeds Other vegetables Asparagus, Brussels sprouts, broccoli, and beets Animal products Liver and eggs (liver being especially high) Whole grains Fortified and unfortified whole grain products Sources: [ 4 25 27 30 nutrients-17-02955-t002_Table 2 Table 2 Evidence for folate in cardiovascular conditions. Outcome Dose/Duration/Ref. Population Notes Improved FMD *, 5 mg folic acid, 6 wks [ 6 12 CAD * patients Benefits independent of Improved FMD * 5–10 mg, 6–8 wks [ 49 Hyperhomocysteinemia  Reduced plaque progression 2.5–5 mg, 4 y [ 49 Premature atherosclerosis With B6, B12 J-shaped risk curve; Various (food/suppl) [ 54 US adults at CVD * risk High intake possibly adverse ↓ CVD * events (RR~0.96), Various [ 53 General and high-risk adults Greater benefit with low No effect on CVD risk Folic acid, 2 y [ 61 CVD * patients  * FMD = flow-mediated dilation, CAD = coronary artery disease, CVD = cardiovascular disease, ↓ = decrease. nutrients-17-02955-t003_Table 3 Table 3 Excessive folate risks. Risk Factor Evidence Masking B12 deficiency Well-established, especially in elderly Increased CVD/all-cause U-shaped association in epidemiological studies Attenuated cognitive benefit Seen in CVD/diabetes populations with Unmetabolized folic acid Potential immune/cancer risk, Excessive folate refers to folate in the folic acid form. Apart from the masking of a B12 deficiency, use of a reduced form of folate such as L-methylfolate may mitigate these risks. nutrients-17-02955-t004_Table 4 Table 4 Effect of maternal folate deficiency as a contributor to autism risk. Mechanism Effect of Folate Deficiency Link to Autism Risk DNA synthesis and Impaired neuronal Structural/functional brain Homocysteine metabolism Homocysteine accumulation, neurotoxicity Disrupted DNA methylation Hypomethylation, gene Aberrant gene expression in brain Neurotransmitter Imbalanced serotonin/ ASD-related behavioral changes Oxidative stress/ Increased neuronal damage Neurodevelopmental risk nutrients-17-02955-t005_Table 5 Table 5 Factors in maternal folate intake and related offspring outcomes. Factor Timing/Context Outcome/Association Supporting Evidence Maternal leucovorin in women with FRAA Periconceptional (before and just after conception), through gestation ASD risk reduced; small study of 2 cases, no ASD outcomes [ 135 Maternal folic acid supplementation Periconceptional (before and just after conception), 1st trimester ASD risk decreased by 50% or more [ 121 132 133 134 Maternal folic acid supplementation No supplementation during pregnancy Potential increased ASD risk; fetal brain may be sensitive to excess micronutrients [ 133 Maternal plasma/whole-blood folate concentration Early pregnancy Mixed findings; some studies show no direct association with autistic traits [ 132 Maternal plasma folate and B12 (very high levels) At delivery, 3rd trimester Potential increased ASD risk; fetal brain may be sensitive to excess micronutrients [ 132 Maternal MTHFR gene variant (C677T) With low folic acid intake Stronger association between low maternal folate and increased ASD risk [ 132 134 Prenatal multivitamin use (with folic acid) Preconception and 1st month of pregnancy Reduced ASD diagnosis and symptom severity in children [ 121 132 Lack of prenatal vitamin/folic acid use Preconception and 1st month of pregnancy Higher risk of ASD and more severe symptoms [ 121 132 nutrients-17-02955-t006_Table 6 Table 6 Vitamin deficiencies or excesses implicated in disorders discussed. Disorder Folate/B9 B12 B6 C D Cardiovascular Disease Deficiency, Excess† Deficiency Deficiency Deficiency Deficiency Cerebrovascular Disease Deficiency Deficiency Deficiency Deficiency Deficiency Peripheral Artery Disease Deficiency Deficiency Deficiency Deficiency [ 133 Deficiency Lymphedema Deficiency Deficiency Deficiency Deficiency Deficiency [ 132 Age-Related Macular Deficiency Deficiency Deficiency Deficiency [ 132  Diabetic Retinopathy Deficiency Deficiency Deficiency   Glaucoma Deficiency Deficiency Deficiency  [ 121 132 Dementia/Cognitive Deficiency, Excess † Deficiency Deficiency  [ 121 132 Autism Spectrum Disorder Deficiency, Excess † Deficiency Deficiency   Excess † (B9/folate) indicates that disease risk or adverse effects can be aggravated by excessive folic acid supplementation (seen in CVD, neurodegeneration, and autism risk). Blank cells indicate that evidence for vitamin involvement is limited or absent for that condition. ",
  "metadata": {
    "Title of this paper": "Folic Acid and the Prevention of Birth Defects: 30 Years of Opportunity and Controversies",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472326/"
  }
}