{
  "title": "Paper_589",
  "abstract": "pmc J Inflamm Res J Inflamm Res 1652 jinres jir Journal of Inflammation Research 1178-7031 Dove Press PMC12477280 PMC12477280.1 12477280 12477280 41031176 10.2147/JIR.S544465 544465 1 Original Research Validate the Treatment of Crohn’s Disease with Chaihu Guizhi Decoction Through Network Pharmacology, Molecular Dynamics Simulation, and in vivo Experiments Zhou et al Zhou et al Zhou Weiguo  1 * Wu Yuguang  1 * Yang Jianhua  2 * http://orcid.org/0009-0004-2600-5907 Saini Yogesh Kumar  1 Fu Rui  1 Chen Bo  1 Cao Guodong  1 Zhang Jiawei  1 1 Department of General Surgery, First Affiliated Hospital of Anhui Medical University Hefei 230022 People’s Republic of China 2 School of Medical Informatics Engineering, Anhui University of Chinese Medicine Hefei Anhui 230012 People’s Republic of China Correspondence: Jiawei Zhang, Email zhangjiawei@ahmu.edu.cn Guodong Cao, Email ayfycgd@163.com * These authors contributed equally to this work 24 9 2025 2025 18 478868 13235 13254 03 6 2025 12 9 2025 24 09 2025 30 09 2025 01 10 2025 © 2025 Zhou et al. 2025 Zhou et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Objective Using an integrated strategy combining network pharmacology, molecular dynamics simulations, and in vivo experiments, this study explores the stage-specific targets of Chaihu Guizhi Decoction (CGD) for the treatment of Crohn’s disease (CD). Methods First, through the GEO database, the patients with Crohn’s disease were divided into four groups: early patients (NCD), late patients (LCD), patients with postoperative recurrence (PCD) and patients without postoperative recurrence (UPCD), and the differential genes of each group were screened. Active ingredients in Chaihu Guizhi Decoction (CGD) with an oral bioavailability (OB) greater than 30% and drug-likeness (DL) exceeding 0.18 were screened using the TCMSP database, along with their corresponding potential targets. The target of CGD was intersected with four groups of differential genes. The common therapeutic targets of CGD for Crohn’s disease in four groups and the specific therapeutic targets of each group were obtained. Core targets were identified through protein-protein interaction (PPI) network analysis. The potential mechanism of CGD in treating Crohn’s disease was analyzed by enrichment of KEGG and GO. Finally, molecular docking and molecular dynamics simulation were used to verify the possibility of combining the effective ingredients of CGD with the therapeutic target of Crohn’s disease. Construct a mouse model of inflammatory bowel disease and administer drug treatment. Use mouse intestinal tissue for Elisa, HE staining, and AB-PAS staining to validate the potential of drug therapy for inflammatory bowel disease. Meanwhile, Western blot experiments were conducted to verify the effect of quercetin on the expression of downstream target proteins. Results Through molecular docking verification, quercetin can bind to these six core genes. We analyzed quercetin and six gene protein products through molecular dynamics simulation. We found that the complex of quercetin and PTGS2 protein is relatively stable, which may be a therapeutic target. In animal studies, both CGD and quercetin significantly alleviated inflammation-induced intestinal shortening (p < 0.05). ELISA results demonstrated that CGD and quercetin markedly reduced the expression of pro-inflammatory cytokines, including IL-6, IL-1β, and TNF-α (p < 0.05). Furthermore, histopathological examinations via HE and PAS staining revealed a substantial mitigation of intestinal inflammation following treatment with CGD and quercetin. Conclusion This study found through animal experiments that CGD and quercetin can treat CD. Through network pharmacology, molecular dynamics simulations, and Western blot experiments, it was demonstrated that quercetin can treat inflammatory bowel disease by affecting the expression of PTGS2 and IL-1B proteins. Keywords Chaihu Guizhi decoction Crohn’s disease network pharmacology molecular dynamics simulation traditional Chinese medicine quercetin Open Fund of Key Laboratory of Anti-inflammatory andImmune Medicine This work was supported in part by the Open Fund of Key Laboratory of Anti-inflammatory andImmune Medicine (Grant No.KFJJ-2023-10), Ministry of Education, P.R. China (Anhui Medical University), the Natural Science Foundation of Anhui Medical University (Grant No.2022xkj146), and Higher Education Quality Project of Anhui Province (GrantNo.2023jyxm1095). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Crohn’s disease is a clinical subtype of inflammatory bowel disease (IBD). The etiology of CD is complex and unclear, which may be related to immune system imbalance, genetic susceptibility, intestinal flora changes and environmental factors. 1 2 3–5 3 6 7 8 9 10 11 12 In previous clinical observations, Chaihu Guizhi Decoction (CGD) has shown efficacy in improving immune function and alleviating symptoms in CD patients. 13 13 14 15 15 16 Paeonia lactiflora Codonopsis pilosula Cinnamomum cassia Bupleurum chinense Baikal Skullcap Pinellia ternata Licorice Jujube Ginger Bupleurum chinense Cinnamomum cassia Paeonia lactiflora Codonopsis pilosula Jujube ginger licorice 16 Materials and Methods Acquisition of Differential Genes in Crohn’s Disease In order to obtain the differential gene of Crohn’s disease, download GSE102133 GPL6244 Acquiring the Effective Components and Pharmacological Targets of the Effective Components of CGD The effective ingredients of Paeonia lactiflora, Codonopsis pilosula, Cinnamomum cassia, Bupleurum chinense, Baikal Skullcap, Pinellia ternata, Licorice, Jujube Ginger Target of CGD in Treating Crohn’s Disease at Each Stage The pharmacological targets of the effective ingredients of CGD were intersected with the differential genes of the four groups of Crohn’s disease. Finally, the common target genes and specific targets of each group of CGD for Crohn’s disease were obtained. The genes obtained from the intersection serve as potential therapeutic targets. Enrichment Analysis The r language package, including “ClusterProfiler”, “org. Hs. eg Db” and “Enrichplot”, is used to enrich and analyze the Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathways of potential target genes of CGD for Crohn’s disease treatment. Set P-value cutoff=0.05 and q-value cutoff=0.05, enrich the data of GO and KEGG through the language pack “org. Hs. eg Db”, and use output to draw a Circos diagram. The Core Target of CGD in Treating Crohn’s Disease Upload the common targets of CGD in each stage of Crohn’s disease treatment to the STRING database (version 11.0) to obtain the target-target function-related protein interaction network, target interaction in protein-protein interaction (PPI) network diagram and tsv data. Import the data into the Cytoscape software, use its CytoNCA, select the scores of Betweenness, Closeness, Degree, Eigenvector, LAC, and Network, and screen out all the genes greater than the median value in the six scores, that is, core genes. Molecular Docking Molecular docking can predict the binding possibility and potential interaction between proteins and small molecules. First, download the SDF molecular structure of the active ingredient in the PubChem database ( https://pubchem.ncbi.nlm.nih.gov/ https://www.rcsb.org/ Molecular Dynamics Simulations First, the small ligand molecules were parameterized by gaff2 force field and am1-bcc charge method through acpype software (v2023.3.1), and the protein macromolecules were processed by GMX pdb2gmx tool of GROMACS using charmm36m force field (version 2023). Subsequently, a cubic water box (TIP3P water model) with a margin of 1.2 nm was added, and Na + – Cell Culture The NCM460 cells were obtained fromthe cell bank of the typical culture preservation committee, Chinese Academy of Sciences, Shanghai, China. The cells were cultured in 1640 medium containing 10% fetal bovine serum and 1% penicillin streptomycin. NCM460 cells were treated with 10ug/mL LPS for 24h to construct the enteritis cell model. CCK8 NCM460 cells were seeded in 96 well plates with a density of 5000 cells/well. NCM460 cells were treated with different concentrations of quercetin (0, 0.2, 0.5, 1, 5, 10, 25, 50 μ mol/L) for 24h. CCK8 reagent was added and incubated in the cell incubator for 1h, and the absorbance at 450nm was measured by microplate reader. Western Blotting Protein extraction from colon tissues or cultured cells was performed using RIPA lysis buffer supplemented with protease and phosphatase inhibitors. The protein concentration was quantified with a BCA assay kit. Equal amounts of protein (20–30 μg) were separated by SDS-PAGE and subsequently transferred onto PVDF membranes. After blocking with 5% non-fat milk in TBST for 1 hour at room temperature, the membranes were incubated overnight at 4°C with primary antibodies against PTGS2, IL-1B, and β-actin. Following three washes with TBST, the membranes were incubated with HRP-conjugated secondary antibodies (dilution 1:5000) for 1 hour at room temperature. Protein bands were visualized using an enhanced chemiluminescence (ECL) detection system. Band intensities were quantified with ImageJ software, and the expression levels of target proteins were normalized to β-actin. Animal Model This study has been approved by Anhui Medical University Experimental Animal Ethics Committee (LLSC20242418). Randomly divide 30 BALB/c mice aged 6–8 weeks into 6 groups: control group,TNBS model group, low-dose CGD group (5g/kg/d), medium-dose CGD group (10g/kg/d), high-dose CGD group (20g/kg/d), and quercetin group (30mg/kg/d), with 5 mice in each group. The experimental operators and result scorers were unaware of the grouping information. Using absolute ethanol, normal saline, and TNBS to prepare a 2% TNBS solution. To create a model of inflammatory bowel disease in mice, TNBS was first applied to the skin of the mice. Seven days later, TNBS was injected into the mouse intestine through the anus at a dose of 100mg/kg per mouse to establish an inflammatory bowel disease model. The drug treatment group was given medication by gavage for 7 days on the second day after the construction of the intestinal inflammation model. On the eighth day, the mice were euthanized and their intestinal tissues were collected. All programs and operations of the experiment were conducted in strict compliance with the National Laboratory Animal Welfare Standards: Laboratory Animal—Guideline for Ethical Review of Animal Welfare (GB/ T35892 Histological Analysis Intestinal tissue were preserved in a solution of 10% neutral buffered formalin for 24 h, processed by embedding in paraffin, and then sectioned for hematoxylin and eosin (H&E) staining and periodic acid- Schiff (PAS) staining. ELISA The ELISA assay kit was purchased from Quanzhou Ruixin Biological Technology Co, LTD Quanzhou, Chin. Use ELISA kit to detect IL-6, IL-1 β, TNF - α and IL-10 inflammatory cytokines. Grind the mouse intestinal tissue into a homogenate using a grinder. Set the centrifuge to 4 °C, 12000rpm, centrifuge for 15 minutes, and collect the supernatant. After diluting the standard and sample, incubate at 37 ° C for 2 hours. Add enzyme-linked immunosorbent assay antibody and incubate at room temperature for 1 hour. Finally, add TMB colorimetric solution and react in the dark for 30 minutes. After termination, use an enzyme-linked immunosorbent assay (ELISA) reader to detect the absorbance at 450nm. Statistical Analysis Use GraphPad Prism software (version 8.0) to process experimental data. Analysis of Variance (ANOVA) is used to evaluate differences between multiple groups, supplemented by Tukey’s post hoc test. All experiments were repeated three times. Set the p-value to 0.05. Result Bioinformatics Acquisition of the Pharmacological Target of CGD The TCMSP database, 249 pharmacological targets were obtained by screening the pharmacological targets of each active ingredient ( Figure 1A Paeonia lactiflora Pinellia ternata Bupleurum chinense Codonopsis pilosula Jujube Licorice Cinnamomum cassia Baikal Skullcap Ginger Figure 1B Figure 1 Acquisition of the pharmacological target of CGD ( A B Identification of Crohn’s Disease Differential Genes and Specific Differential Genes of Each Group First, 530 LCD differential genes ( Figure 2A–D Figure 2B–F Figure 2C–E Figure 2G Figure 3A Figure 2 Differential genes in different stages of Crohn’s disease. ( A B C D E F G Figure 3 Pharmacological Target of Chaihu Guizhi Decoction (CGD) in Treating Crohn’s Disease. ( A B C D E F G Potential Pharmacological Targets of CGD in the Treatment of Crohn’s Disease at Each Stage By crossing the differential genes of each group of Crohn’s disease with the pharmacological target of CGD, the overlapping genes are taken as the potential pharmacological target of CGD in treating Crohn’s disease. Finally, 28 common potential pharmacological targets for LCD, NCD and PCD, 2 specific potential pharmacological genes for LCD and 5 specific potential pharmacological targets for NCD were obtained ( Figure 3B–E Enrichment Analysis of Target Genes KEGG and GO in the Treatment of Crohn’s Disease with CGD The KEGG and GO enrichment analysis of the potential pharmacological targets of CGD for treating LCD, NCD and PCD showed that CGD can be used to treat patients through inflammatory response, inflammatory response, cellular response to chemical stimulus, cytokine-mediated signaling pathway, response to oxygen-containing compound, response to chemical, chemokine receptor binding, CXCR chemokine receptor binding, chemokine activity, G protein-coupled receptor binding, interleukin-1 receptor binding, HIF-1 signaling pathway, Inflammatory bowel disease, Chemokine signaling pathway, Drug metabolism - cytochrome P450, TNF signaling pathway, NF-kappa B signaling pathway and other mechanisms to achieve the purpose of treating Crohn’s disease ( Figure 3F G CGD for the Treatment of Crohn’s Disease Core Gene The potential 28 common pharmacological targets of CGD for the treatment of Crohn’s disease in three groups were input into STRING, and the protein interaction network and tsv files were obtained. Import the data obtained by STRING into Cytoscape, and screen six core genes (HIF1A, CCL2, PTGS2, IL1A, IL1B, CXCL8) through CytoNCA ( Figure 4A Figure 4 Visualization Chart of Chaihu Guizhi Decoction in Treating Crohn’s Disease. ( A B Molecular Docking Effective Drug Components and Therapeutic Targets for Crohn’s Disease When analyzing the drugs corresponding to these six core genes, we found that PTGS2 can interact with 116 active ingredients in CGD ( Figure 4B Figure 5A B Supplementary Figure 1 Table 1 Table 1 Tables 1 2 Table 1 Visual Display of Molecular Docking Between Macromolecular Proteins and Small Molecular Ligands Target Target (PDB ID) Target Structure Compound Affinity (kcal/mol) CCL2 3IFD Quercetin −6.107 CXCL8 3IL8 Quercetin −6.788 HIF1A 4H6J Quercetin −7.217 IL1A 5UC6 Quercetin −7.618 IL1B 1L2H Quercetin −7.565 PTGS2 5F1A Quercetin −9.181 NQO1 4CET Quercetin −7.131 PCOLCE 6FZV Quercetin −7.279 CD14 4GLP Paeoniflorin −7.41 MTTP 6I7S Naringenin −9.177 Taxifolin −8.085 Table 2 Effective Components of Chaihu Guizhi Decoction in the Precise Treatment of Crohn’s Disease Mol ID Molecule Name Molecule Structure OB (%) DL MOL004328 Naringenin 59.29 0.21 MOL004576 Taxifolin 57.84 0.27 MOL001924 Paeoniflorin 53.87 0.79 MOL000392 Formononetin 69.67 0.21 MOL000098 Quercetin 46.43 0.28 Figure 5 Molecular docking ( A B Molecular Dynamics Simulation RMSD is the root mean square deviation in molecular dynamics simulation, which can be used to show the mobility of small molecules and the stability of proteins. The large value of RMSD and the large fluctuation of RMSD indicate that the structure has strong mobility and poor stability. The RMSD of the HIF1A protein complex is 0.3nm at 1–50ns, and the fluctuation amplitude is 0.2nm. At this time, the RMSD is stable, but after 50ns, the RMSD suddenly rises to 2nm, which shows that the protein complex of HIF1A and quercetin is unstable ( Figure 6A Supplementary Figure 2 Figure 6B Figure 6 Molecular dynamic simulation ( A B In vitro and in vivo Experiments CGD and Quercetin Relieve Intestinal Inflammation in the Enteritis Model Mice In this study, a drug treated mouse model was constructed to validate the potential of CGD and quercetin in treating inflammatory bowel disease ( Figure 7A Figure 7B Figure 7C Figure 7D–F Figure 7E Figure 7G Figure 7H Figure 7 Animal experiments ( A B C D E F G H Quercetin Inhibits PTGS2 Protein Expression The CCK8 results of quercetin on NCM460 cells showed that when the maximum concentration of quercetin was 10umol/L, it could play a pharmacological role without damaging normal intestinal cells ( Figure 8A Figure 8B C Figure 8B C Figure 8 Regulation of gene expression by drugs ( A B C Discussion CD is a chronic disease characterized by intestinal inflammation, fistula, abscess and other symptoms. The pathogenesis of CD is not yet clear, which may be caused by immune response disorder, intestinal flora change, genetic susceptibility and environmental factors. 17 18 19 10 20 In this study, we divided CD patients into NCD, LCD, PCD and UPCD according to different disease stages through GEO database. Then we discussed the common mechanism of CGD in treating NCD, LCD and PCD. The three groups of common genes were crossed with the pharmacological target of CGD, and 28 crossing genes were obtained. These 28 overlapping genes are regarded as common therapeutic targets of CGD in treating three groups of diseases. Through Cytoscape screening, six core genes (HIF1A, CCL2, PTGS2, IL1A, IL1B, CXCL8) were finally screened out, and quercetin can regulate these six core genes. Karhausen et al showed that the low expression of HIF-1 was related to the severe clinical symptoms of colitis. The increased expression of HIF-1 was associated with the remission of clinical symptoms. 21 22 23 24 25 26 27 28 29 30 The above therapeutic targets were verified by molecular docking. Quercetin can form hydrogen bond interactions with six core genes (HIF1A, CCL2, PTGS2, IL1A, IL1B and CXCL8). We compared the binding ability of quercetin with six core genes, and found that PTGS2 had the lowest binding energy (9.181 kcal/mol) and the strongest binding ability with quercetin. Then, we used molecular dynamics simulation to verify the structural stability and mobility of quercetin binding to six core gene proteins. We found that the RMSD of quercetin PTGS2 protein complex was small and fluctuated slightly. Their structures are relatively stable and small molecules have less mobility. At the same time, the results in vivo and in vitro showed that quercetin could reduce the protein expression of PTGS2 in NCM460 cells and the intestinal tract of inflammatory bowel disease mice (p<0.05). In conclusion, we can conclude that quercetin can reduce the expression of PTGS2 protein by binding to PTGS2 protein. However, PTGS2 has a dual effect in the treatment of intestinal inflammation. PTGS2 promotes intestinal mucosal healing in acute intestinal injury, but overexpression of PTGS2 during chronic inflammation can promote the progression of inflammation. 31 32 33 34 34 35 36–39 36 37 40 40 41 42 However, this study only proved the feasibility of CGD in the treatment of inflammatory bowel disease in mice and cells. This is far from the clinical promotion and treatment of CD. We need to constantly improve relevant research, provide more evidence-based medicine, and prove the feasibility of CGD in the treatment of CD. This study relies on animal models to simulate human Crohn’s disease (CD); however, these are essentially acute or semi-acute chemically-induced models that cannot fully replicate the complex disease course and heterogeneity of human CD. Secondly, although quercetin is a promising natural bioactive compound, its pharmacokinetic properties pose major challenges for clinical translation. Its low absorption and high metabolic rate may result in prototype drug concentrations reaching the affected intestinal tract that are far lower than the effective concentrations observed in in vitro experiments, thereby potentially compromising its efficacy in vivo. Additionally, variations in the chemical composition of Chaihu Guizhi Decoction (CGD) may occur due to differences in the source of herbal materials and preparation processes. Conclusions This study verified the feasibility of CGD in the treatment of CD through network pharmacology, molecular dynamics simulation, in vivo and in vitro experiments. Quercetin in CGD can alleviate intestinal inflammatory injury by inhibiting the expression of PTGS2 and IL-1B protein. This provides us with a new scheme for the treatment of Crohn’s disease. Acknowledgments All authors read and approved the manuscript. Abbreviations Crohn’s disease, CD; inflammatory bowel disease, IBD; Chaihu Guizhi Decoction, CGD; early patients, NCD; late patients, LCD; patients with postoperative recurrence, PCD; patients without postoperative recurrence, UPCD; Gene Expression Omnibus, GEO; Tcm Systems Pharmacy Database and Analysis Platform,TCMSP; Bioavailability, OB; Drug-likeness, DL; Hematoxylin-eosin staining, HE. Data Sharing Statement The data are available to academic researchers upon request. Ethics Approval and Consent to Participate This study has been approved by Anhui Medical University Experimental Animal Ethics Committee (LLSC20242418). This study has been approved by The Clinical Research Ethics Committee of The First Affiliated Hospital of Anhui Medical University (LLSC20242418). Consent to Publish All authors gave their consent for publication. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The authors declare that no competing or conflicting interests exist for this work. References 1. Roda G Chien NS Kotze PG Crohn’s disease Nat Rev Dis Primers 2020 6 1 22 10.1038/s41572-020-0156-2 32242028 2. Rashed R Valcheva R Dieleman LA Manipulation of gut microbiota as a key target for Crohn’s disease Front Med Lausanne 2022 9 887044 10.3389/fmed.2022.887044 35783604 PMC9244564 3. El-Nakeep S Shawky A Abbas SF Abdel LO Stem cell transplantation for induction of remission in medically refractory Crohn’s disease Cochrane Database Syst Rev 2022 5 5 CD013070 10.1002/14651858.CD013070.pub2 35556242 PMC9099217 4. Bonaz B Sinniger V Pellissier S Therapeutic potential of vagus nerve stimulation for inflammatory bowel diseases Front Neurosci 2021 15 650971 10.3389/fnins.2021.650971 33828455 PMC8019822 5. Fiorino G Bonifacio C Allocca M Danese S Impact of therapies on bowel damage in Crohn’s disease United Eur Gastroenterol J 2020 8 4 410 417 10.1177/2050640620908696 PMC7226700 32213030 6. Lin X Wang Y Liu Z Intestinal strictures in Crohn’s disease: a 2021 update Therap Adv Gastroenterol 2022 15 17562848221104951 10.1177/17562848221104951 PMC9218441 35757383 7. de Groof EJ Stevens TW Eshuis EJ Cost-effectiveness of laparoscopic ileocaecal resection versus infliximab treatment of terminal ileitis in Crohn’s disease: the LIR!C trial Gut 2019 68 10 1774 1780 10.1136/gutjnl-2018-317539 31233395 8. Bak M Ruiterkamp M van Ruler O Prehabilitation prior to intestinal resection in Crohn’s disease patients: an opinion review World J Gastroenterol 2022 28 22 2403 2416 10.3748/wjg.v28.i22.2403 35979261 PMC9258284 9. Costa J Magro F Caldeira D Infliximab reduces hospitalizations and surgery interventions in patients with inflammatory bowel disease: a systematic review and meta-analysis Inflamm Bowel Dis 2013 19 10 2098 2110 10.1097/MIB.0b013e31829936c2 23860567 10. Puca P Del VL Ainora ME Role of multiparametric intestinal ultrasound in the evaluation of response to biologic therapy in adults with Crohn’s disease Diagnostics 2022 12 8 10.3390/diagnostics12081991 PMC9407413 36010341 11. Fumery M Dulai PS Meirick P Systematic review with meta-analysis: recurrence of Crohn’s disease after total colectomy with permanent ileostomy Aliment Pharmacol Ther 2017 45 3 381 390 10.1111/apt.13886 27928830 PMC5253136 12. Xie J Huang Y Wu HG Li J Acupuncture and moxibustion for treatment of Crohn’s disease: a brief review World J Gastroenterol 2022 28 25 3001 3003 10.3748/wjg.v28.i25.3001 35978879 PMC9280737 13. Salaga M Zatorski H Sobczak M Chen C Fichna J Chinese herbal medicines in the treatment of IBD and colorectal cancer: a review Curr Treat Options Oncol 2014 15 3 405 420 10.1007/s11864-014-0288-2 24792017 PMC4147240 14. Wang Y Li M Zha AS Adjuvant Treatment of Crohn’s Disease with Traditional Chinese Medicine: a Meta-Analysis Evid Based Complement Alternat Med 2019 2019 6710451 10.1155/2019/6710451 30949220 PMC6425422 15. Manhong L Clinical efficacy of Chaihu Shugan San combined with Shenling Baizhu San on Crohn’s disease with liver depression and spleen deficiency pattern and its effect on immune function Clin Med Engine 2019 26 03 317 319 16. Li L Analysis of the clinical efficacy of Chaihu Guizhi Tang in the treatment of Crohn’s disease Electronic J Clin Med Literature 2019 6 A0 13 14 17. Hibi T Ogata H Novel pathophysiological concepts of inflammatory bowel disease J Gastroenterol 2006 41 1 10 16 10.1007/s00535-005-1744-3 16501852 18. Coward S Clement F Benchimol EI Past and future burden of inflammatory bowel diseases based on modeling of population-based data Gastroenterology 2019 156 5 1345 1353.e4 10.1053/j.gastro.2019.01.002 30639677 19. Rocchi A Benchimol EI Bernstein CN Inflammatory bowel disease: a Canadian burden of illness review Can J Gastroenterol Hepatol 2012 26 11 811 817 10.1155/2012/984575 PMC3495699 23166905 20. Yichao H Jia Z Yongrui B Xiansheng M Analysis of the clinical efficacy of Chaihu Guizhi Tang in the treatment of Crohn’s disease Chin Med Herald 2012 9 07 103 104 21. Karhausen J Furuta GT Tomaszewski JE Epithelial hypoxia-inducible factor-1 is protective in murine experimental colitis J Clin Invest 2004 114 8 1098 1106 10.1172/JCI200421086 15489957 PMC522241 22. Cosin-Roger J Simmen S Melhem H Hypoxia ameliorates intestinal inflammation through NLRP3/mTOR downregulation and autophagy activation Nat Commun 2017 8 1 98 10.1038/s41467-017-00213-3 28740109 PMC5524634 23. Linares R Gutierrez A Marquez-Galera A Transcriptional regulation of chemokine network by biologic monotherapy in ileum of patients with Crohn’s disease Biomed Pharmacother 2022 147 112653 10.1016/j.biopha.2022.112653 35078095 24. Dinarello CA Interleukin-1 in the pathogenesis and treatment of inflammatory diseases Blood 2011 117 14 3720 3732 10.1182/blood-2010-07-273417 21304099 PMC3083294 25. Gabay C Lamacchia C Palmer G IL-1 pathways in inflammation and human diseases Nat Rev Rheumatol 2010 6 4 232 241 10.1038/nrrheum.2010.4 20177398 26. Menghini P Corridoni D Butto LF Neutralization of IL-1alpha ameliorates Crohn’s disease-like ileitis by functional alterations of the gut microbiome Proc Natl Acad Sci USA 2019 116 52 26717 26726 10.1073/pnas.1915043116 31843928 PMC6936591 27. Cox DG Crusius JB Peeters PH Haplotype of prostaglandin synthase 2/cyclooxygenase 2 is involved in the susceptibility to inflammatory bowel disease World J Gastroenterol 2005 11 38 6003 6008 10.3748/wjg.v11.i38.6003 16273614 PMC4436724 28. Garlanda C Dinarello CA Mantovani A The interleukin-1 family: back to the future Immunity 2013 39 6 1003 1018 10.1016/j.immuni.2013.11.010 24332029 PMC3933951 29. Agrawal K Chakraborty P Dewanjee S Neuropharmacological interventions of quercetin and its derivatives in neurological and psychological disorders Neurosci Biobehav Rev 2023 144 104955 10.1016/j.neubiorev.2022.104955 36395983 30. Ahmed MB Islam SU Alghamdi A Phytochemicals as chemo-preventive agents and signaling molecule modulators: current role in cancer therapeutics and Inflammation Int J Mol Sci 2022 23 24 15765 10.3390/ijms232415765 36555406 PMC9779495 31. Morteau O Morham SG Sellon R Impaired mucosal defense to acute colonic injury in mice lacking cyclooxygenase-1 or cyclooxygenase-2 J Clin Invest 2000 105 4 469 478 10.1172/JCI6899 10683376 PMC289156 32. Reuter BK Asfaha S Buret A Sharkey KA Wallace JL Exacerbation of inflammation-associated colonic injury in rat through inhibition of cyclooxygenase-2 J Clin Invest 1996 98 9 2076 2085 10.1172/JCI119013 8903327 PMC507652 33. Ishikawa TO Oshima M Herschman HR Cox-2 deletion in myeloid and endothelial cells, but not in epithelial cells, exacerbates murine colitis Carcinogenesis 2011 32 3 417 426 10.1093/carcin/bgq268 21156970 PMC3047239 34. El MY Youssef S Ahmed I El GM The gastrointestinal safety and effect on disease activity of etoricoxib, a selective cox-2 inhibitor in inflammatory bowel diseases Am J Gastroenterol 2006 101 2 311 317 10.1111/j.1572-0241.2006.00384.x 16454836 35. Bains SJ Mahic M Myklebust TA Aspirin as secondary prevention in patients with colorectal cancer: an unselected population-based study J Clin Oncol 2016 34 21 2501 2508 10.1200/JCO.2015.65.3519 27247217 36. Dodda D Chhajed R Mishra J Protective effect of quercetin against acetic acid induced inflammatory bowel disease (IBD) like symptoms in rats: possible morphological and biochemical alterations Pharmacol Rep 2014 66 1 169 173 10.1016/j.pharep.2013.08.013 24905324 37. Dodda D Chhajed R Mishra J Padhy M Targeting oxidative stress attenuates trinitrobenzene sulphonic acid induced inflammatory bowel disease like symptoms in rats: role of quercetin Indian J Pharmacol 2014 46 3 286 291 10.4103/0253-7613.132160 24987175 PMC4071705 38. Townsend EA Emala CS Quercetin acutely relaxes airway smooth muscle and potentiates beta-agonist-induced relaxation via dual phosphodiesterase inhibition of PLCbeta and PDE4 Am J Physiol Lung Cell Mol Physiol 2013 305 5 L396 403 10.1152/ajplung.00125.2013 23873842 PMC3763034 39. Gardi C Bauerova K Stringa B Quercetin reduced inflammation and increased antioxidant defense in rat adjuvant arthritis Arch Biochem Biophys 2015 583 150 157 10.1016/j.abb.2015.08.008 26297952 40. Riemschneider S Hoffmann M Slanina U Indol-3-carbinol and quercetin ameliorate chronic DSS-induced colitis in C57BL/6 mice by AhR-mediated anti-inflammatory mechanisms Int J Environ Res Public Health 2021 18 5 2262 10.3390/ijerph18052262 33668818 PMC7956562 41. Lin R Piao M Song Y Dietary quercetin increases colonic microbial diversity and attenuates colitis severity in citrobacter rodentium-infected mice Front Microbiol 2019 10 1092 10.3389/fmicb.2019.01092 31156598 PMC6531918 42. Sotnikova R Nosalova V Navarova J Efficacy of quercetin derivatives in prevention of ulcerative colitis in rats Interdiscip Toxicol 2013 6 1 9 12 10.2478/intox-2013-0002 24170973 PMC3795315 ",
  "metadata": {
    "Title of this paper": "Efficacy of quercetin derivatives in prevention of ulcerative colitis in rats",
    "Journal it was published in:": "Journal of Inflammation Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477280/"
  }
}