{
  "title": "Paper_17",
  "abstract": "pmc Ann Med Ann Med 3997 annmed Annals of Medicine 0785-3890 1365-2060 Taylor & Francis PMC12490359 PMC12490359.1 12490359 12490359 41030221 10.1080/07853890.2025.2548975 2548975 1 Version of Record Review Article Oncology Mechanisms of neuroendocrine differentiation in castration-resistant prostate cancer and advances in the treatment of neuroendocrine prostate cancer B. Shao and Y. Zeng Shao Bo Data curation Formal analysis Methodology Resources Writing – original draft Writing – review & editing * Zeng Yu Conceptualization Funding acquisition Project administration Supervision Validation Department of Urology, Cancer Hospital of China Medical University, Cancer Hospital of Dalian University of Technology, Liaoning Cancer Hospital & Institute Shenyang Liaoning Province P R China * These authors contributed equally to this work and share first authors. CONTACT Yu Zeng zengyud@hotmail.com Department of Urology, Cancer Hospital of China Medical University, Cancer Hospital of Dalian University of Technology, Liaoning Cancer Hospital & Institute No. 44 Xiaoheyan Road, Dadong District Shenyang Liaoning Province 110042 P R China 1 10 2025 2025 57 1 476479 2548975 01 10 2025 03 10 2025 03 10 2025 24 11 2024 6 8 2025 8 8 2025 KnowledgeWorks Global Ltd. 27 9 2025 published online in a building issue 27 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Abstract Aims Prostate cancer (PC) is a common male malignancy. Although androgen deprivation therapy (ADT) is standard for advanced PC, many patients develop castration-resistant PC (CRPC), and some progress to neuroendocrine PC (NEPC). This study aims to clarify mechanisms of this transition, especially the role of cancer stem cells (CSCs), and explore therapeutic targets. Methods A literature review was conducted on genetic alterations, signaling pathways, tumor microenvironment, and CSC biology related to CRPC and NEPC progression. Findings Evidence shows that lineage plasticity, alternative signaling activation, and CSC expansion drive CRPC and NEPC development. CSCs promote heterogeneity, resistance, and metastasis, while current treatments remain largely ineffective for NEPC. Conclusions Understanding mechanisms of PC progression is crucial for new interventions. Targeting CSC-related pathways may help prevent resistance and improve outcomes in advanced prostate cancer. Keywords Neuroendocrine prostate cancer neuroendocrine differentiation cancer stem cells cellular heterogeneity review National Natural Science Foundation of China 10.13039/501100001809 81572532 This work was supported by the National Natural Science Foundation of China [No. 81572532]. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction 1.1. Classification and characteristics of prostate cancer Prostate cancer (PC) is one of the most common malignancies in men, and its incidence and mortality rates have significantly increased in recent years. Despite the effectiveness of early diagnostic and treatment methods, such as prostate-specific antigen (PSA) testing and androgen deprivation therapy (ADT), castration-resistant prostate cancer (CRPC) and the atypical neuroendocrine variant of CRPC neuroendocrine prostate cancer (NEPC) continue to pose significant clinical challenges [ 1 via 2 3 This review systematically explores the mechanisms underlying the development, progression, and therapeutic resistance of neuroendocrine prostate cancer (NEPC), while comprehensively summarizing recent advances in potential therapeutic strategies. Compared to previous reviews, this work offers distinct contributions in several key areas. First, by integrating cutting-edge research on cancer stem cell (CSC) biology and NEPC heterogeneity, it elucidates the pivotal role of CSCs in NEPC initiation and treatment resistance, highlighting their potential as novel therapeutic targets. Second, it provides an in-depth analysis of the dynamic interplay between the tumor microenvironment (TME) and NEPC cells, offering new perspectives for TME-targeted therapeutic strategies. Furthermore, this review is the first to systematically compare the molecular characteristics and clinical implications of Novo NEPC, treatment-emergent NEPC (t-NEPC), and double-negative prostate cancer, addressing a critical gap in the literature regarding subtype heterogeneity. These insights not only deepen the understanding of NEPC molecular mechanisms but also establish a theoretical foundation for developing precision-targeted therapies and optimizing clinical trial designs. 1.2. PC and CRPC Prostate cancer is one of the most prevalent malignant tumors among men worldwide. According to the 2020 global cancer statistics from the World Health Organization’s GLOBOCAN database, prostate cancer ranks as the second most common cancer and the sixth leading cause of cancer-related death among men globally [ 1 4 2 5 6 7 1.3. Mechanisms of CRPC development CRPC develops because certain prostate cancer cells can continue to proliferate in a low-androgen environment. This growth can be attributed to the structural changes and hyperactivity of androgen receptors caused by genetic mutations, the overexpression of androgen receptors, and the activation of alternative signaling pathways [ 8 9 10 AR-dependent pathways involve the activation of the AR pathway due to residual androgen synthesis, as well as aberrant AR pathway activation independent of androgens [ 11 12 10 + via Figure 1 13 via Figure 1. Polarization of cancer-associated fibroblasts (CAFs) is shaped collaboratively by the tumor microenvironment (TME) and targeted therapy [ 13 + 1.4. Prognostic features of CRPC When a patient’s serum testosterone level is extremely low but the tumor continues to progress, the cancer progresses to lethal CRPC, resulting in significantly reduced treatment efficacy and a poor clinical prognosis. In particular, metastatic castration-resistant prostate cancer (mCRPC) is associated with poor clinical outcomes, leading to a substantial decrease in overall survival [ 14 15 2. NEPC: a highly aggressive and treatment-resistant subtype of CRPC characterized by a poor prognosis 2.1. Definition, clinical features, and formation mechanisms of NEPC Neuroendocrine prostate cancer (NEPC) is a subtype of castration-resistant prostate cancer (CRPC) [ 16 17 18 3 17 3 17 19 2.2. Subtypes of NEPC and the natural history of each subtype The subtypes of neuroendocrine prostate cancer (NEPC) include Novo NEPC and treatment emergent (t-NEPC), among others. These subtypes differ in clinical features, molecular mechanisms, and therapeutic strategies. Firstly, Novo NEPC refers to neuroendocrine tumors that develop in the early or initial stages of prostate cancer, typically without the presence of glandular-type (adenocarcinoma) prostate cancer. Novo NEPC can also be understood as neuroendocrine prostate cancer diagnosed at the initial presentation, without passing through the adenocarcinoma phase. Clinically, it is characterized by high aggressiveness, absence of androgen receptor (AR) expression, and insensitivity to endocrine therapy [ 20 Next, t-NEPC is a tumor that arises from the transformation of acinar adenocarcinoma under therapeutic pressures, such as androgen deprivation therapy, into neuroendocrine prostate cancer. Some of the tumor cells exhibit neuroendocrine phenotypic characteristics [ 21 22 In addition, it is worth noting that another type of prostate cancer, double-negative prostate cancer (DNPC), is a special subtype of prostate cancer that lacks the expression of androgen receptors (AR) and neuroendocrine markers. Therefore, DNPC is generally defined as an unclassified form of prostate cancer [ 20 23 24 20 2.3. Prognostic issues and therapeutic challenges in NEPC Compared with other subtypes of CRPC, NEPC generally has a poorer prognosis and fewer treatment options [ 25 26 27 28 29 30 Additionally, NEPC is highly resistant to conventional treatments [ 28 31 32 33 The role of cellular plasticity in the development of neuroendocrine prostate cancer (NEPC) is explained by multiple models, but its specific mechanisms remain controversial. Some studies suggest that NEPC primarily arises from the transdifferentiation of prostate adenocarcinoma cells into a neuroendocrine (NE) phenotype, involving the suppression of androgen receptor (AR) signaling and the upregulation of transcription factors such as SOX2 and EZH2 [ 28 34–37 38–40 41–43 The tumor microenvironment (TME) of neuroendocrine prostate cancer (NEPC) significantly contributes to treatment resistance through multiple mechanisms, exhibiting distinct biological characteristics. The NEPC TME comprises tumor cells, stromal cells (e.g. cancer-associated fibroblasts, CAFs), immune cells (e.g. tumor-associated macrophages, TAMs, and myeloid-derived suppressor cells, MDSCs), and the extracellular matrix (ECM), collectively fostering a milieu that promotes neuroendocrine differentiation (NED) and immune suppression [ 44–46 47 48 49 50 51–53 54 55 NEPC exhibits significant molecular differences from CRPC, lacking specific targeted therapies. Its development is driven by complex regulation of cellular plasticity and the TME. Transdifferentiation and cancer stem cell models reveal potential origins, but mechanisms remain controversial. The NEPC TME promotes drug resistance through proinflammatory cytokines, hypoxia, immune evasion, and epigenetic regulation, displaying high heterogeneity. Future research should explore subtype-specific drivers and develop combined therapies targeting the TME to overcome resistance, enhance diagnostic precision and treatment outcomes, and improve patients’ quality of life. 3. Mechanisms underlying the occurrence of neuroendocrine differentiation in CRPC The transition from CRPC to NEPC is a complex process that involves multiple mechanisms and factors, including genetic mutations, alterations in cell signaling pathways, and changes in the tumor microenvironment. 3.1. Genetic and molecular mechanisms in the CRPC to NEPC transition First, genetic mutations and genomic rearrangements are pivotal in the transition from castration-resistant prostate cancer (CRPC) to neuroendocrine prostate cancer (NEPC). The inactivation of key genes, such as RB1 (retinoblastoma protein) and TP53 (tumor suppressor gene), is especially significant. Researchers have discovered that the retinoblastoma (Rb) protein is lost in 90% of small cell carcinoma cases, and RB1 allelic loss is detected in 85% of these cases. These genetic abnormalities result in disruptions to cell cycle regulation and DNA repair mechanisms, thereby facilitating progression to NEPC [ 17 56 57 58 59 40 3.2. Epigenetic modifications driving NEPC progression Epigenetic regulation is pivotal in the development of NEPC. Enhancer of Zeste homolog 2 (EZH2), the enzymatic subunit of polycomb repressive complex 2 (PRC2), plays a key role in catalyzing the trimethylation of lysine 27 on histone H3 (H3K27me3). This crucial epigenetic modification sustains gene silencing by restricting chromatin accessibility and inhibiting gene transcription [ 60 60 61 61 in vivo 61 62 Furthermore, studies have identified histone deacetylase 2 (HDAC2) as one of the most upregulated epigenetic regulators in NEPC. In the context of epigenetics, HDAC2 deacetylates histones, which leads to chromatin compaction and gene silencing. The removal of acetyl groups reduces chromatin accessibility, thereby inhibiting the binding of transcription factors and gene expression, particularly those genes involved in the cell cycle, apoptosis, and differentiation. Additionally, HDAC2-mediated deacetylation tightens chromatin structure, which improves genomic stability and regulates the transition between static and dynamic chromatin states. HDAC2 also works in conjunction with DNA methyltransferases (DNMTs) and transcriptional repressor complexes, such as NuRD, to collectively suppress gene expression [ 63 via via 64 Tazemetostat is the first FDA-approved oral EZH2 small molecule inhibitor for the treatment of epithelioid sarcoma or relapsed/refractory follicular lymphoma. It has achieved good results in several early clinical trials of mCRPC. The CELLO-1 study is a phase Ib/II trial of tazemetostat combined with enzalutamide or abiraterone/prednisone in treating mCRPC ( NCT04179864 65 3.3. Epigenetic modifications driving NEPC progression Epigenetic modifications that alter transcription factors play crucial roles in gene regulation and cellular function to significantly impact the development of neuroendocrine prostate cancer (NEPC). Androgen receptor (AR) therapy can influence the expression of transcription factors (such as FOXA1, FOXA2, and BRN2) via 66–68 69 70 71 72 73 74–76 74 via 76 Recently, Gao et al. [ 77 3.4. BRN2 and SOX2 as key regulators in NEPC progression Additionally, BRN2, a key regulator of neuronal differentiation, is considered an important driver of the neuroendocrine (NE) phenotype in prostate cancer. Bishop et al. [ 78 in vitro in vivo 35 79 35 37 The limited treatment options and poor prognosis of NEPC pose a major challenge in the clinical management of prostate cancer. Many studies aim to explore new therapeutic targets and strategies for NEPC by elucidating the molecular mechanisms underlying its development ( Figure 2 Figure 2. Mechanism of neuroendocrine differentiation [ 17 4. Exploring therapeutic targets from the trans-differentiation signaling pathways of NEPC 4.1. The kinesin superfamily (KIFs) The Kinesin Superfamily (KIFs) is a group of microtubule motor proteins that play essential roles in key cellular processes, including cell division and organelle transport. Studies have shown that KIF family members contribute significantly to the initiation and progression of various cancers [ 80 in vivo 81 4.2. Delta-like ligand 3 (DLL3) Delta-like ligand 3 (DLL3) is a cell surface protein that plays a pivotal role in neuroendocrine prostate cancer (NEPC), a highly invasive and castration-resistant subtype of prostate cancer (CRPC). DLL3 is a member of the Notch signaling pathway, which is typically expressed at low levels in normal tissues, but is aberrantly overexpressed on the surface of NEPC cells [ 82 83 84 85 Currently, targeted strategies involving DLL3 in the treatment of NEPC are being explored through various approaches, including antibody-drug conjugates (such as rovalpituzumab tesirine, RovaT) and radiolabeled antibodies (such as 177Lu-DTPA-SC16) [ 86 82 PT217 is a bispecific antibody targeting DLL3 and CD47, which has been granted orphan drug status by the FDA in 2022 for the treatment of SCLC. NCT05652686 NCT04471727 NCT04429087 65 4.3. TROP2 (Trophoblast cell surface antigen 2) TROP2 (Trophoblast cell surface antigen 2) is a cell surface glycoprotein initially identified in trophoblast cells. It exhibits aberrantly high expression in various cancer types and plays a pivotal role in the transformation of CRPC (castration-resistant prostate cancer) to NEPC (neuroendocrine prostate cancer), significantly influencing tumor phenotype and invasive properties. TROP2 promotes oncogenesis in NEPC through the PARP1 signaling pathway. High TROP2 expression upregulates PARP1, enhancing DNA damage repair, thereby facilitating cancer cell survival and proliferation [ 87 88 TROP2 expression is regulated by epigenetic modifications, such as H3K27me3, as well as androgen receptor (AR) signaling, highlighting its pivotal role in the trans-differentiation of CRPC to NEPC [ 88 89 Currently, TROP2-targeted therapeutic strategies primarily include antibody-drug conjugates (ADC) and combination therapy with PARP inhibitors (PARPi) [ 90 91 90 5. Mechanisms of NEPC resistance to ADT NEPC is characterized by mechanisms of resistance to androgen deprivation therapy distinct from those of CRPC. Understanding these differences is crucial for developing specific therapeutic strategies targeting NEPC [ 3 First, NEPC significantly differs from typical CRPC in its dependence on androgen receptor (AR) signaling. CRPC generally relies on the AR signaling pathway via 92 93 94 95 96 Second, NEPC and typical CRPC exhibit significant differences in tissue differentiation characteristics. CRPC cells mostly retain adenocarcinoma features; although some CRPC cells may exhibit partial neuroendocrine characteristics, the overall profile remains primarily adenocarcinoma [ 97 98–100 101 102 Moreover, NEPC and CRPC exhibit significant differences in the activation of signaling pathways. In CRPC, the abnormal activation of common signaling pathways, such as the PI3K/AKT/mTOR pathway and the MAPK pathway, plays a critical role in drug resistance, but these changes are typically associated with alterations in the AR signaling pathway [ 103 104 105 106 101 102 107 Finally, NEPC significantly differs from CRPC in stem cell characteristics, epithelial–mesenchymal transition (EMT), and invasion–metastasis capabilities. NEPC cells exhibit increased stem cell-like properties and transformation abilities, which enable them to self-renew and differentiate more effectively. Therefore, they are more adaptable and resistant to therapeutic pressure [ 108 108 109 In summary, the significant differences between NEPC and CRPC in terms of the mechanisms of ADT resistance are reflected primarily in the expression and dependency on AR signaling, neuroendocrine differentiation characteristics, and the activation of signaling pathways. Understanding these mechanisms is crucial for developing specific therapeutic strategies for NEPC, which can help improve treatment outcomes and the prognosis of NEPC patients. 6. Prostate cancer stem cells play a crucial role in the formation of CRPC and NEPC Prostate cancer stem cells (CSCs) play crucial roles in the occurrence, development, and treatment resistance of CRPC and NEPC. Their formation is closely related to EMT [ 108 110 111–113 In CRPC, prostate cancer stem cell markers, such as CD44, CD133, and ALDH1 are upregulated, indicating the important role of these cells in castration resistance. CSCs also play crucial roles in the development of NEPC. NEPC is an aggressive subtype of prostate cancer commonly observed in CRPC patients. Prostate CSCs can differentiate into neuroendocrine-like cells under specific therapeutic pressures, which typically lack AR expression and exhibit high invasiveness and drug resistance [ 108 40 111 114 The formation of CSCs in CRPC and NEPC may be closely related to the EMT of prostate cancer cells. EMT is one of the key mechanisms by which tumor cells acquire stem cell properties and treatment resistance [ 115 Figure 3 115 116 via 117–119 108 Figure 3. Molecular mechanisms related to EMT and CSCs [ 115 Targeting CSCs is an important approach for treating CRPC and NEPC. Monoclonal antibodies or small-molecule inhibitors that target CSC markers (such as CD44, CD133, and ALDH1), as well as specific inhibitors of signaling pathways required for CSC survival and trans-differentiation (such as Wnt, Notch, and Hedgehog), are potential therapeutic strategies [ 120–123 124 125 126 In conclusion, CSCs play crucial roles in the development and treatment resistance of CRPC and NEPC, and their formation is closely related to EMT. Targeting prostate cancer stem cells and their associated signaling pathways offers new directions and hope for the treatment of CRPC and NEPC. Understanding the mechanisms of CSC formation and their interaction with EMT is essential for developing more effective therapeutic strategies. These research and treatment advancements will help improve the prognosis of prostate cancer patients, especially those with CRPC and NEPC. 7. Potential of targeting cancer stem cells in NEPC treatment Current research suggests that targeting cancer stem cell (CSC)-related genes, such as POU5F1/OCT4, SOX2, ALDH1, BMI1, and HER2, can significantly improve the treatment outcomes for CRPC and NEPC [ 46 127 128 129 Although AR inhibitors (such as enzalutamide and abiraterone) effectively suppress the growth of prostate cancer cells that depend on AR signaling, these inhibitors may activate CSC-related signaling pathways, prompting cancer cells to acquire stem cell-like properties and eventually transform into NEPC. Therefore, combining therapies that target CSC genes (such as HER2, AURKA, SOX2, and ALDH1) has emerged as a potential treatment strategy to weaken the CSC population, inhibit their lineage plasticity, and enhance the sensitivity of cancer cells to AR inhibitors [ 130–132 For example, the HER2 signaling pathway can activate the dedifferentiation of prostate cancer cells, causing them to exhibit cancer stem cell properties and resistance to enzalutamide [ 133 46 134 8. Summary and prospects Neuroendocrine prostate cancer (NEPC) is a highly aggressive subtype of castration-resistant prostate cancer (CRPC) characterized by neuroendocrine features and a high level of resistance to conventional therapies. Traditionally, the transition from CRPC to NEPC is viewed as a complex process in which neuroendocrine differentiation (NED) plays a crucial role. This transition involves multiple factors, including genetic mutations, alterations in signaling pathways, and adjustments in the tumor microenvironment that lead to rapid disease progression and limit treatment options. However, these mechanisms do not fully consider the cellular heterogeneity in cancer and the significant role of cancer stem cells (CSCs). Given the current limitations in NEPC treatment and its poor prognosis, further elucidation of its developmental mechanisms and identification of new therapeutic targets and strategies are urgently needed. NEPC cell heterogeneity is a major factor that contributes to the therapeutic challenges of this subtype. During the transformation of prostate cancer following ADT, the number and distribution of various cell types, including PC cells, CRPC cells, NEPC cells, and CSCs, significantly change. In the early stages of ADT, the number of PC cells significantly decreases because most PC cells are sensitive to androgen deprivation. However, given their self-renewal ability and resistance to apoptosis, CSCs persist under therapeutic pressure. Under the pressure of ADT, CSCs undergo epigenetic modifications and genetic mutations, leading to their differentiation into CRPC cells and NEPC cells [ 91 94 101 59 135 The cellular heterogeneity in NEPC also explains why PC cells and CRPC cells can still be detected in NEPC. Specifically, the pluripotency and differentiation capabilities of CSCs allow multiple cell types to coexist within the tumor [ 136 137 Figure 4 Figure 4. Role of CSCs in the formation of NEPC. Following ADT treatment for prostate cancer, CSCs that are resistant to apoptosis persist. Under the pressure of ADT, these CSCs undergo epigenetic changes and genetic mutations, differentiating into drug-resistant CRPC cells and highly invasive NEPC cells. NEPC cells, through neuroendocrine mechanisms, further induce the differentiation of CSCs into NEPC cells, forming a complete alternative AR pathway. NEPC, a highly aggressive and heterogeneous subtype of CRPC, presents significant therapeutic challenges. Future research should focus on the following key questions: (1) How can the molecular drivers of NEPC be precisely distinguished? Single-cell RNA sequencing and spatial transcriptomics are recommended to elucidate the cellular heterogeneity of NEPC subtypes and the dynamic changes in the tumor microenvironment (TME) [ 138 139 in vitro in vivo 140 Acknowledgments Yu Zeng put forward the overall research ideas, supervision and the project administration. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement There is no new data generated during the study. References 1 Sung H Ferlay J Siegel RL et al. Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 Countries CA Cancer J Clin 2021 71 3 209 249 10.3322/caac.21660 33538338 2 Feldman BJ Feldman D. The development of androgen-independent prostate cancer Nat Rev Cancer 2001 1 1 34 45 10.1038/35094009 11900250 3 Wang HT Yao YH Li BG et al. Neuroendocrine Prostate Cancer (NEPC) progressing from conventional prostatic adenocarcinoma: factors associated with time to development of NEPC and survival from NEPC diagnosis-a systematic review and pooled analysis J Clin Oncol 2014 32 30 3383 3390 10.1200/JCO.2013.54.3553 25225419 4 Cornford P van den Bergh RCN Briers E et al. EAU-EANM-ESTRO-ESUR-SIOG guidelines on prostate cancer. Part II-2020 Update: treatment of relapsing and metastatic prostate cancer Eur Urol 2021 79 2 263 282 10.1016/j.eururo.2020.09.046 33039206 5 Grossmann ME Huang H Tindall DJ. Androgen receptor signaling in androgen-refractory prostate cancer J Natl Cancer Inst 2001 93 22 1687 1697 10.1093/jnci/93.22.1687 11717329 6 Pienta KJ Bradley D. Mechanisms underlying the development of androgen-independent prostate cancer Clin Cancer Res 2006 12 6 1665 1671 10.1158/1078-0432.CCR-06-0067 16551847 7 Scher HI Sawyers CL. Biology of progressive, castration-resistant prostate cancer: directed therapies targeting the androgen-receptor signaling axis J Clin Oncol 2005 23 32 8253 8261 10.1200/JCO.2005.03.4777 16278481 8 Attard G Richards J de Bono JS. New strategies in metastatic prostate cancer: targeting the androgen receptor signaling pathway Clin Cancer Res 2011 17 7 1649 1657 10.1158/1078-0432.CCR-10-0567 21372223 PMC3513706 9 Scher HI Buchanan G Gerald W et al. Targeting the androgen receptor: improving outcomes for castration-resistant prostate cancer Endocr Relat Cancer 2004 11 3 459 476 10.1677/erc.1.00525 15369448 10 Seisen T Rouprêt M Gomez F et al. A comprehensive review of genomic landscape, biomarkers and treatment sequencing in castration-resistant prostate cancer Cancer Treat Rev 2016 48 25 33 10.1016/j.ctrv.2016.06.005 27327958 11 Egan A Dong Y Zhang H et al. Castration-resistant prostate cancer: adaptive responses in the androgen axis Cancer Treat Rev 2014 40 3 426 433 10.1016/j.ctrv.2013.09.011 24139549 12 Lapuk AV Wu C Wyatt AW et al. From sequence to molecular pathology, and a mechanism driving the neuroendocrine phenotype in prostate cancer J Pathol 2012 227 3 286 297 10.1002/path.4047 22553170 PMC3659819 13 Wang H Li N Liu Q et al. Antiandrogen treatment induces stromal cell reprogramming to promote castration resistance in prostate cancer Cancer Cell 2023 41 7 1345 1362 e9 10.1016/j.ccell.2023.05.016 37352863 14 Desai K McManus JM Sharifi N. Hormonal therapy for prostate cancer Endocr Rev 2021 42 3 354 373 10.1210/endrev/bnab002 33480983 PMC8152444 15 Uzelac M Xin R Ongkeko WM. Microbiome dysbiosis is associated with castration resistance and cancer stemness in metastatic prostate cancer Int J Mol Sci 2024 25 6 3291 10.3390/ijms25063291 38542265 PMC10970102 16 Rawat C Heemers HV. Alternative splicing in prostate cancer progression and therapeutic resistance Oncogene 2024 43 22 1655 1668 10.1038/s41388-024-03036-x 38658776 PMC11136669 17 Liu S Alabi BR Yin Q et al. Molecular mechanisms underlying the development of neuroendocrine prostate cancer Semin Cancer Biol 2022 86 Pt 3 57 68 10.1016/j.semcancer.2022.05.007 35597438 18 Vlachostergios PJ Puca L Beltran H. Emerging variants of castration-resistant prostate cancer Curr Oncol Rep 2017 19 5 32 10.1007/s11912-017-0593-6 28361223 PMC5479409 19 Nie J Zhang P Liang C et al. ASCL1-mediated ferroptosis resistance enhances the progress of castration-resistant prostate cancer to neurosecretory prostate cancer Free Radic Biol Med 2023 205 318 331 10.1016/j.freeradbiomed.2023.06.006 37355053 20 Zaffuto E Pompe R Zanaty M et al. Contemporary incidence and cancer control outcomes of primary neuroendocrine prostate cancer: a SEER database analysis Clin Genitourin Cancer 2017 15 5 e793 e800 10.1016/j.clgc.2017.04.006 28506524 21 Conteduca V Oromendia C Eng KW et al. Clinical features of neuroendocrine prostate cancer Eur J Cancer 2019 121 7 18 10.1016/j.ejca.2019.08.011 31525487 PMC6803064 22 Sartor O de Bono J Chi KN et al. V. Investigators, Lutetium-177-PSMA-617 for metastatic castration-resistant prostate cancer N Engl J Med 2021 385 12 1091 1103 10.1056/NEJMoa2107322 34161051 PMC8446332 23 Masur J Ratan A Wierbilowicz K et al. Clinical and genomic features of androgen indifferent prostate cancer Int J Mol Sci 2025 26 2 679 10.3390/ijms26020679 39859392 PMC11765751 24 Bluemn EG Coleman IM Lucas JM et al. Androgen receptor pathway-independent prostate cancer is sustained through FGF signaling Cancer Cell 2017 32 4 474 489 e6 10.1016/j.ccell.2017.09.003 29017058 PMC5750052 25 Wright ME Tsai MJ Aebersold R. Androgen receptor represses the neuroendocrine transdifferentiation process in prostate cancer cells Mol Endocrinol 2003 17 9 1726 1737 10.1210/me.2003-0031 12775765 26 Ismail AH Landry F Aprikian AG et al. Androgen ablation promotes neuroendocrine cell differentiation in dog and human prostate Prostate 2002 51 2 117 125 10.1002/pros.10066 11948966 27 Berchuck JE Viscuse PV Beltran H et al. Clinical considerations for the management of androgen indifferent prostate cancer Prostate Cancer Prostatic Dis 2021 24 3 623 637 10.1038/s41391-021-00332-5 33568748 PMC8353003 28 Yamada Y Beltran H. Clinical and biological features of neuroendocrine prostate cancer Curr Oncol Rep 2021 23 2 15 10.1007/s11912-020-01003-9 33433737 PMC7990389 29 Mosquera JM Beltran H Park K et al. Concurrent AURKA and MYCN gene amplifications are harbingers of lethal treatment-related neuroendocrine prostate cancer Neoplasia 2013 15 1 1 10 10.1593/neo.121550 23358695 PMC3556934 30 Jemal A Bray F Center MM et al. Global cancer statistics CA Cancer J Clin 2011 61 2 69 90 10.3322/caac.20107 21296855 31 Scott LJ. Enzalutamide: a review in castration-resistant prostate cancer Drugs 2018 78 18 1913 1924 10.1007/s40265-018-1029-9 30535926 32 Huang YH Zhang YQ Huang JT. Neuroendocrine cells of prostate cancer: biologic functions and molecular mechanisms Asian J Androl 2019 21 3 291 295 10.4103/aja.aja_128_18 30924452 PMC6498729 33 Papandreou CN Daliani DD Thall PF et al. Results of a phase II study with doxorubicin, etoposide, and cisplatin in patients with fully characterized small-cell carcinoma of the prostate J Clin Oncol 2002 20 14 3072 3080 10.1200/JCO.2002.12.065 12118020 34 Venkadakrishnan VB Presser AG Singh R et al. Lineage-specific canonical and non-canonical activity of EZH2 in advanced prostate cancer subtypes Nat Commun 2024 15 1 6779 10.1038/s41467-024-51156-5 39117665 PMC11310309 35 Wang Y Wang Y Ci X et al. Molecular events in neuroendocrine prostate cancer development Nat Rev Urol 2021 18 10 581 596 10.1038/s41585-021-00490-0 34290447 PMC10802813 36 Yasumizu Y Rajabi H Jin C et al. MUC1-C regulates lineage plasticity driving progression to neuroendocrine prostate cancer Nat Commun 2020 11 1 338 10.1038/s41467-019-14219-6 31953400 PMC6969104 37 Mu P Zhang Z Benelli M et al. SOX2 promotes lineage plasticity and antiandrogen resistance in TP53- and RB1-deficient prostate cancer Science 2017 355 6320 84 88 10.1126/science.aah4307 28059768 PMC5247742 38 Shigeta K Daimon T Hongo H et al. MUC1-C dependence in treatment-resistant prostate cancer uncovers a target for antibody-drug conjugate therapy JCI Insight 2025 10 14 59 10.1172/jci.insight.190924 PMC12288968 40553569 39 Kufe D. Dependence on MUC1-C in progression of neuroendocrine prostate cancer Int J Mol Sci 2023 24 4 3719 10.3390/ijms24043719 36835130 PMC9967814 40 Hagiwara M Yasumizu Y Yamashita N et al. MUC1-C Activates the BAF (mSWI/SNF) Complex in Prostate Cancer Stem Cells Cancer Res 2021 81 4 1111 1122 10.1158/0008-5472.CAN-20-2588 33323379 PMC8026569 41 Quezada Urban R Keerthikumar S Clark A et al. Single-cell transcriptomics redefines focal neuroendocrine differentiation as a distinct prostate cancer pathology Mol Oncol 2025 10.1002/1878-0261.70099 40705968 42 Sreekumar A Saini S. Role of transcription factors and chromatin modifiers in driving lineage reprogramming in treatment-induced neuroendocrine prostate cancer Front Cell Dev Biol 2023 11 1075707 10.3389/fcell.2023.1075707 36711033 PMC9879360 43 Li Y Zhang Q Lovnicki J et al. SRRM4 gene expression correlates with neuroendocrine prostate cancer Prostate 2019 79 1 96 104 10.1002/pros.23715 30155992 44 Heimdörfer D Artamonova N Culig Z et al. Unraveling molecular characteristics and tumor microenvironment dynamics of neuroendocrine prostate cancer J Cancer Res Clin Oncol 2024 150 10 462 10.1007/s00432-024-05983-0 39412660 PMC11485041 45 Bhinder B Ferguson A Sigouros M et al. Immunogenomic landscape of neuroendocrine prostate cancer Clin Cancer Res 2023 29 15 2933 2943 10.1158/1078-0432.CCR-22-3743 37223924 PMC10524949 46 Han H Wang Y Curto J et al. Mesenchymal and stem-like prostate cancer linked to therapy-induced lineage plasticity and metastasis Cell Rep 2022 39 1 110595 10.1016/j.celrep.2022.110595 35385726 PMC9414743 47 Peng D Fu M Wang M et al. Targeting TGF-beta signal transduction for fibrosis and cancer therapy Mol Cancer 2022 21 1 104 10.1186/s12943-022-01569-x 35461253 PMC9033932 48 Huang H Wang C Liu F et al. Reciprocal network between cancer stem-like cells and macrophages facilitates the progression and androgen deprivation therapy resistance of prostate cancer Clin Cancer Res 2018 24 18 4612 4626 10.1158/1078-0432.CCR-18-0461 29691294 49 Schmidt D Endres C Hoefflin R et al. Oncogenic Calreticulin induces immune escape by stimulating TGFbeta expression and regulatory T-cell expansion in the bone marrow microenvironment Cancer Res 2024 84 18 2985 3003 10.1158/0008-5472.CAN-23-3553 38885318 PMC11405138 50 Neo SY Tong L Chong J et al. Tumor-associated NK cells drive MDSC-mediated tumor immune tolerance through the IL-6/STAT3 axis Sci Transl Med 2024 16 747 eadi2952 10.1126/scitranslmed.adi2952 38748775 51 Mandl A Jasmine S Krueger T et al. LSD1 inhibition suppresses ASCL1 and de-represses YAP1 to drive potent activity against neuroendocrine prostate cancer bioRxiv 2024 10.1101/2024.01.17.576106 52 Kumaraswamy A Duan Z Flores D 3rd et al. LSD1 promotes prostate cancer reprogramming by repressing TP53 signaling independently of its demethylase function JCI Insight 2023 8 15 40 10.1172/jci.insight.167440 PMC10445684 37440313 53 Song Z Cao Q Guo B et al. Overexpression of RACGAP1 by E2F1 promotes neuroendocrine differentiation of prostate cancer by stabilizing EZH2 expression Aging Dis 2023 14 5 1757 1774 10.14336/AD.2023.0202 37196108 PMC10529746 54 Rodarte KE Nir Heyman S Guo L et al. Neuroendocrine differentiation in prostate cancer requires ASCL1 Cancer Res 2024 84 21 3522 3537 10.1158/0008-5472.CAN-24-1388 39264686 PMC11534540 55 Fan L Gong Y He Y et al. TRIM59 is suppressed by androgen receptor and acts to promote lineage plasticity and treatment-induced neuroendocrine differentiation in prostate cancer Oncogene 2023 42 8 559 571 10.1038/s41388-022-02498-1 36544044 56 Tan HL Sood A Rahimi HA et al. Rb loss is characteristic of prostatic small cell neuroendocrine carcinoma Clin Cancer Res 2014 20 4 890 903 10.1158/1078-0432.CCR-13-1982 24323898 PMC3931005 57 Navone NM Labate ME Troncoso P et al. p53 mutations in prostate cancer bone metastases suggest that selected p53 mutants in the primary site define foci with metastatic potential J Urol 1999 161 1 304 308 10.1016/S0022-5347(01)62136-0 10037428 58 Lee JK Phillips JW Smith BA et al. N-Myc drives neuroendocrine prostate cancer initiated from human prostate epithelial cells Cancer Cell 2016 29 4 536 547 10.1016/j.ccell.2016.03.001 27050099 PMC4829466 59 Beltran H Rickman DS Park K et al. Molecular characterization of neuroendocrine prostate cancer and identification of new drug targets Cancer Discov 2011 1 6 487 495 10.1158/2159-8290.CD-11-0130 22389870 PMC3290518 60 Davies A Zoubeidi A Selth LA. The epigenetic and transcriptional landscape of neuroendocrine prostate cancer Endocr Relat Cancer 2020 27 2 R35 R50 10.1530/ERC-19-0420 31804971 61 Clermont PL Lin D Crea F et al. Polycomb-mediated silencing in neuroendocrine prostate cancer Clin Epigenetics 2015 7 1 40 10.1186/s13148-015-0074-4 25859291 PMC4391120 62 Shan J Al-Muftah MA Al-Kowari MK et al. Targeting Wnt/EZH2/microRNA-708 signaling pathway inhibits neuroendocrine differentiation in prostate cancer Cell Death Discov 2019 5 1 139 10.1038/s41420-019-0218-y 31583122 PMC6768854 63 Naderinezhad S Zhang G Wang Z et al. A novel GRK3-HDAC2 regulatory pathway is a key direct link between neuroendocrine differentiation and angiogenesis in prostate cancer progression Cancer Lett 2023 571 216333 10.1016/j.canlet.2023.216333 37543278 PMC11235056 64 Zhang Y Zheng D Zhou T et al. Androgen deprivation promotes neuroendocrine differentiation and angiogenesis through CREB-EZH2-TSP1 pathway in prostate cancers Nat Commun 2018 9 1 4080 10.1038/s41467-018-06177-2 30287808 PMC6172226 65 Fei X Xue JW Wu JZ et al. Promising therapy for neuroendocrine prostate cancer: current status and future directions Ther Adv Med Oncol 2024 16 17588359241269676 10.1177/17588359241269676 39131727 PMC11311189 66 Teng M Zhou S Cai C et al. Pioneer of prostate cancer: past, present and the future of FOXA1 Protein Cell 2021 12 1 29 38 10.1007/s13238-020-00786-8 32946061 PMC7815845 67 Gerhardt J Montani M Wild P et al. FOXA1 promotes tumor progression in prostate cancer and represents a novel hallmark of castration-resistant prostate cancer Am J Pathol 2012 180 2 848 861 10.1016/j.ajpath.2011.10.021 22138582 68 Sahu B Laakso M Ovaska K et al. Dual role of FoxA1 in androgen receptor binding to chromatin, androgen signalling and prostate cancer Embo J 2011 30 19 3962 3976 10.1038/emboj.2011.328 21915096 PMC3209787 69 Beltran H Romanel A Conteduca V et al. Circulating tumor DNA profile recognizes transformation to castration-resistant neuroendocrine prostate cancer J Clin Invest 2020 130 4 1653 1668 10.1172/JCI131041 32091413 PMC7108892 70 Adams EJ Karthaus WR Hoover E et al. FOXA1 mutations alter pioneering activity, differentiation and prostate cancer phenotypes Nature 2019 571 7765 408 412 10.1038/s41586-019-1318-9 31243370 PMC6661172 71 Baca SC Takeda DY Seo JH et al. Reprogramming of the FOXA1 cistrome in treatment-emergent neuroendocrine prostate cancer Nat Commun 2021 12 1 1979 10.1038/s41467-021-22139-7 33785741 PMC8010057 72 Chiaverotti T Couto SS Donjacour A et al. Dissociation of epithelial and neuroendocrine carcinoma lineages in the transgenic adenocarcinoma of mouse prostate model of prostate cancer Am J Pathol 2008 172 1 236 246 10.2353/ajpath.2008.070602 18156212 PMC2189611 73 Park JW Lee JK Witte ON et al. FOXA2 is a sensitive and specific marker for small cell neuroendocrine carcinoma of the prostate Mod Pathol 2017 30 9 1262 1272 10.1038/modpathol.2017.44 28621319 PMC6330177 74 Connelly ZM Jin R Zhang J et al. FOXA2 promotes prostate cancer growth in the bone Am J Transl Res 2020 12 9 5619 5629 33042443 PMC7540102 75 Liu Q Pang J Wang LA et al. Histone demethylase PHF8 drives neuroendocrine prostate cancer progression by epigenetically upregulating FOXA2 J Pathol 2021 253 1 106 118 10.1002/path.5557 33009820 PMC7756255 76 Qi J Nakayama K Cardiff RD et al. Siah2-dependent concerted activity of HIF and FoxA2 regulates formation of neuroendocrine phenotype and neuroendocrine prostate tumors Cancer Cell 2010 18 1 23 38 10.1016/j.ccr.2010.05.024 20609350 PMC2919332 77 Han M Li F Zhang Y et al. FOXA2 drives lineage plasticity and KIT pathway activation in neuroendocrine prostate cancer Cancer Cell 2022 40 11 1306 1323 e8 10.1016/j.ccell.2022.10.011 36332622 78 Bishop JL Thaper D Vahid S et al. The master neural transcription factor BRN2 is an androgen receptor-suppressed driver of neuroendocrine differentiation in prostate cancer Cancer Discov 2017 7 1 54 71 10.1158/2159-8290.CD-15-1263 27784708 79 Kregel S Kiriluk KJ Rosen AM et al. Sox2 is an androgen receptor-repressed gene that promotes castration-resistant prostate cancer PLoS One 2013 8 1 e53701 10.1371/journal.pone.0053701 23326489 PMC3543364 80 Pan D Fang X Li J. Identification of a Novel gene signature based on kinesin family members to predict prognosis in glioma Medicina 2023 59 2 15 10.3390/medicina59020414 PMC9959126 36837615 81 Zhou Q Yang M Fu J et al. KIF1A promotes neuroendocrine differentiation in prostate cancer by regulating the OGT-mediated O-GlcNAcylation Cell Death Dis 2024 15 11 796 10.1038/s41419-024-07142-2 39505875 PMC11542072 82 Korsen JA Gutierrez JA Tully KM et al. Delta-like ligand 3-targeted radioimmunotherapy for neuroendocrine prostate cancer Proc Natl Acad Sci USA 2022 119 27 e2203820119 10.1073/pnas.2203820119 35759660 PMC9271187 83 Bernal A Bechler AJ Mohan K et al. The current therapeutic landscape for metastatic prostate cancer Pharmaceuticals 2024 17 3 351 10.3390/ph17030351 38543137 PMC10974045 84 Zaidi S Park J Chan JM et al. Single-cell analysis of treatment-resistant prostate cancer: implications of cell state changes for cell surface antigen-targeted therapies Proc Natl Acad Sci USA 2024 121 28 e2322203121 10.1073/pnas.2322203121 38968122 PMC11252802 85 Korsen JA Kalidindi TM Khitrov S et al. Molecular imaging of neuroendocrine prostate cancer by targeting delta-like ligand 3 J Nucl Med 2022 63 9 1401 1407 10.2967/jnumed.121.263221 35058323 PMC9454466 86 Kemble J Kwon ED Karnes RJ. Addressing the need for more therapeutic options in neuroendocrine prostate cancer Expert Rev Anticancer Ther 2023 23 2 177 185 10.1080/14737140.2023.2173174 36698089 87 Yao L Chen J Ma W. Decoding TROP2 in breast cancer: significance, clinical implications, and therapeutic advancements Front Oncol 2023 13 1292211 10.3389/fonc.2023.1292211 37954074 PMC10635515 88 Ajkunic A Sayar E Roudier MP et al. Assessment of TROP2, CEACAM5 and DLL3 in metastatic prostate cancer: expression landscape and molecular correlates NPJ Precis Oncol 2024 8 1 104 10.1038/s41698-024-00599-6 38760413 PMC11101486 89 Weiten R Niemann M Below E et al. Preclinical evidence for the use of anti-Trop-2 antibody-drug conjugate Sacituzumab govitecan in cerebral metastasized castration-resistant prostate cancer Cancer Med 2024 13 12 e7320 10.1002/cam4.7320 38895886 PMC11185941 90 Hsu EC Rice MA Bermudez A et al. Trop2 is a driver of metastatic prostate cancer with neuroendocrine phenotype via PARP1 Proc Natl Acad Sci U S A 2020 117 4 2032 2042 10.1073/pnas.1905384117 31932422 PMC6994991 91 Yamaguchi A Yamazaki CM Anami Y et al. 177Lu-labeled antibody-drug conjugate: a dual mechanistic treatment modality in solid tumors Mol Cancer Ther 2025 907 919 40051166 10.1158/1535-7163.MCT-24-0254 PMC12143887 92 Chen ZY Dong Q Liu LR et al. ARV-7: a biomarker for the treatment of metastatic castration-resistant prostate cancer Zhonghua Nan Ke Xue 2019 25 2 172 176 32216207 93 Tommasi S Pilato B Carella C et al. Standardization of CTC AR-V7 PCR assay and evaluation of its role in castration resistant prostate cancer progression Prostate 2019 79 1 54 61 10.1002/pros.23710 30141201 94 Simon I Perales S Casado-Medina L et al. Cross-resistance to abiraterone and enzalutamide in castration resistance prostate cancer cellular models is mediated by AR transcriptional reactivation Cancers 2021 13 6 1483 10.3390/cancers13061483 33807106 PMC8004828 95 Luo J. Non-invasive actionable biomarkers for metastatic prostate cancer Asian J Urol 2016 3 4 170 176 10.1016/j.ajur.2016.09.003 29264186 PMC5730867 96 Chakraborty G Gupta K Kyprianou N. Epigenetic mechanisms underlying subtype heterogeneity and tumor recurrence in prostate cancer Nat Commun 2023 14 1 567 10.1038/s41467-023-36253-1 36732329 PMC9895058 97 Kretschmer A Wittekind C Stief CG et al. Neuroendocrine prostate cancer Urologe A 2015 54 12 1779 1783 10.1007/s00120-015-4015-9 26582381 98 Huang G Zhang H Shi H et al. Clinicopathological and immunological profiles of prostate adenocarcinoma and neuroendocrine prostate cancer World J Surg Oncol 2022 20 1 407 10.1186/s12957-022-02841-6 36572885 PMC9793563 99 Xiang Q Zhu Z Luo L et al. The Correlation between PSCA Expression and Neuroendocrine Differentiation in Prostate Cancer Biomed Res Int 2020 10.1155/2020/5395312 PMC7532369 33029516 100 Bery F Cancel M Chantôme A et al. The calcium-sensing receptor is a marker and potential driver of neuroendocrine differentiation in prostate cancer Cancers 2020 12 4 860 10.3390/cancers12040860 32252342 PMC7226072 101 Gritsina G Fong KW Lu X et al. Chemokine receptor CXCR7 activates Aurora Kinase A and promotes neuroendocrine prostate cancer growth J Clin Invest 2023 133 15 59 10.1172/JCI166248 PMC10378179 37347559 102 Dardenne E Beltran H Benelli M et al. N-Myc induces an EZH2-mediated transcriptional program driving neuroendocrine prostate cancer Cancer Cell 2016 30 4 563 577 10.1016/j.ccell.2016.09.005 27728805 PMC5540451 103 Shorning BY Dass MS Smalley MJ et al. The PI3K-AKT-mTOR pathway and prostate cancer: at the crossroads of AR, MAPK, and WNT signaling Int J Mol Sci 2020 21 12 4507 10.3390/ijms21124507 32630372 PMC7350257 104 Bitting RL Armstrong AJ. Targeting the PI3K/Akt/mTOR pathway in castration-resistant prostate cancer Endocr Relat Cancer 2013 20 3 R83 99 10.1530/ERC-12-0394 23456430 105 Zhang J Chen Z Mao Y et al. ID2 promotes lineage transition of prostate cancer through FGFR and JAK-STAT Signaling Cancers 2024 16 2 92 10.3390/cancers16020392 PMC10814654 38254880 106 Yadav SS Li J Stockert JA et al. Induction of neuroendocrine differentiation in prostate cancer cells by dovitinib (TKI-258) and its therapeutic implications Transl Oncol 2017 10 3 357 366 10.1016/j.tranon.2017.01.011 28342996 PMC5369368 107 Beltran H Oromendia C Danila DC et al. A phase II Trial of the aurora kinase a inhibitor alisertib for patients with castration-resistant and neuroendocrine prostate cancer: efficacy and biomarkers Clin Cancer Res 2019 25 1 43 51 10.1158/1078-0432.CCR-18-1912 30232224 PMC6320304 108 Mei W Lin X Kapoor A et al. The contributions of prostate cancer stem cells in prostate cancer initiation and metastasis Cancers 2019 11 4 434 10.3390/cancers11040434 30934773 PMC6521153 109 Dicken H Hensley PJ Kyprianou N. Prostate tumor neuroendocrine differentiation via EMT: the road less traveled Asian J Urol 2019 6 1 82 90 10.1016/j.ajur.2018.11.001 30775251 PMC6363600 110 Tu SM Lin SH. Prostate cancer stem cells Clin Genitourin Cancer 2012 10 2 69 76 10.1016/j.clgc.2012.01.002 22421313 PMC4141775 111 Koukourakis IM Platoni K Kouloulias V et al. Prostate cancer stem cells: biology and treatment implications Int J Mol Sci 2023 24 19 14890 10.3390/ijms241914890 37834336 PMC10573523 112 Wu J Cang S Liu C et al. Development of human prostate cancer stem cells involves epigenomic alteration and PI3K/AKT pathway activation Exp Hematol Oncol 2020 9 1 12 10.1186/s40164-020-00168-0 32537260 PMC7288500 113 Qin W Zheng Y Qian BZ et al. Prostate cancer stem cells and nanotechnology: a focus on Wnt signaling Front Pharmacol 2017 8 153 10.3389/fphar.2017.00153 28400729 PMC5368180 114 Zhang K Guo Y Wang X et al. WNT/beta-catenin directs self-renewal symmetric cell division of hTERT(high) prostate cancer stem cells Cancer Res 2017 77 9 2534 2547 10.1158/0008-5472.CAN-16-1887 28209613 115 Babaei G Aziz SG Jaghi NZZ. EMT, cancer stem cells and autophagy; The three main axes of metastasis Biomed Pharmacother 2021 133 110909 10.1016/j.biopha.2020.110909 33227701 116 Dongre A Weinberg RA. New insights into the mechanisms of epithelial-mesenchymal transition and implications for cancer Nat Rev Mol Cell Biol 2019 20 2 69 84 10.1038/s41580-018-0080-4 30459476 117 Shome R Ghosh SS. Tweaking EMT and MDR dynamics to constrain triple-negative breast cancer invasiveness by EGFR and Wnt/beta-catenin signaling regulation Cell Oncol 2021 44 2 405 422 10.1007/s13402-020-00576-8 33398673 118 Lee HM Hwang KA Choi KC. Diverse pathways of epithelial mesenchymal transition related with cancer progression and metastasis and potential effects of endocrine disrupting chemicals on epithelial mesenchymal transition process Mol Cell Endocrinol 2017 457 103 113 10.1016/j.mce.2016.12.026 28042023 119 Ciruna B Rossant J. FGF signaling regulates mesoderm cell fate specification and morphogenetic movement at the primitive streak Dev Cell 2001 1 1 37 49 10.1016/s1534-5807(01)00017-x 11703922 120 Katoh M Katoh M. Precision medicine for human cancers with Notch signaling dysregulation Int J Mol Med 2020 45 2 279 297 10.3892/ijmm.2019.4418 31894255 PMC6984804 121 Xu Y Song S Wang Z et al. The role of hedgehog signaling in gastric cancer: molecular mechanisms, clinical potential, and perspective Cell Commun Signal 2019 17 1 157 10.1186/s12964-019-0479-3 31775795 PMC6882007 122 Ceder J Elgqvist J. Targeting prostate cancer stem cells with alpha-particle therapy Front Oncol 2016 6 273 10.3389/fonc.2016.00273 28119854 PMC5220245 123 Wen Z Feng S Wei L et al. Evodiamine, a Novel inhibitor of the Wnt pathway, inhibits the self-renewal of gastric cancer stem cells Int J Mol Med 2015 36 6 1657 1663 10.3892/ijmm.2015.2383 26497016 124 Gogola S Rejzer M Bahmad HF et al. Anti-cancer stem-cell-targeted therapies in prostate cancer Cancers 2023 15 5 1621 10.3390/cancers15051621 36900412 PMC10000420 125 Zheng H Liu H Li H et al. Characterization of stem cell landscape and identification of stemness-relevant prognostic gene signature to aid immunotherapy in colorectal cancer Stem Cell Res Ther 2022 13 1 244 10.1186/s13287-022-02913-0 35681225 PMC9185878 126 Najafi M Farhood B Mortezaee K. Cancer stem cells (CSCs) in cancer progression and therapy J Cell Physiol 2019 234 6 8381 8395 10.1002/jcp.27740 30417375 127 Verma S Shankar E Kalayci FNC et al. Androgen deprivation induces transcriptional reprogramming in prostate cancer cells to develop stem cell-like characteristics Int J Mol Sci 2020 21 24 9568 10.3390/ijms21249568 33339129 PMC7765584 128 van Schaijik B Davis PF Wickremesekera AC et al. Subcellular localisation of the stem cell markers OCT4, SOX2, NANOG, KLF4 and c-MYC in cancer: a review J Clin Pathol 2018 71 1 88 91 10.1136/jclinpath-2017-204815 29180509 129 Labsch S Liu L Bauer N et al. Sulforaphane and TRAIL induce a synergistic elimination of advanced prostate cancer stem-like cells Int J Oncol 2014 44 5 1470 1480 10.3892/ijo.2014.2335 24626333 PMC4027950 130 Kurani H Razavipour SF Harikumar KB et al. DOT1L is a Novel cancer stem cell target for triple-negative breast cancer Clin Cancer Res 2022 28 9 1948 1965 10.1158/1078-0432.CCR-21-1299 35135840 PMC9365344 131 Deng L Meng T Chen L et al. The role of ubiquitination in tumorigenesis and targeted drug discovery Signal Transduct Target Ther 2020 5 1 11 10.1038/s41392-020-0107-0 32296023 PMC7048745 132 Chen C Song G Xiang J et al. AURKA promotes cancer metastasis by regulating epithelial-mesenchymal transition and cancer stem cell properties in hepatocellular carcinoma Biochem Biophys Res Commun 2017 486 2 514 520 10.1016/j.bbrc.2017.03.075 28322787 133 Zhang Z Karthaus WR Lee YS et al. Tumor microenvironment-derived NRG1 promotes antiandrogen resistance in prostate cancer Cancer Cell 2020 38 2 279 296 e9 10.1016/j.ccell.2020.06.005 32679108 PMC7472556 134 Lin J Patel SA Sama AR et al. A phase I/II study of the investigational drug alisertib in combination with abiraterone and prednisone for patients with metastatic castration-resistant prostate cancer progressing on abiraterone Oncologist 2016 21 11 1296 1297e 10.1634/theoncologist.2016-0297 28178640 PMC5189628 135 Azur RAG Olarte KCV Ybañez WS et al. CYB561 supports the neuroendocrine phenotype in castration-resistant prostate cancer PLoS One 2024 19 5 e0300413 10.1371/journal.pone.0300413 38739593 PMC11090301 136 Verma P Shukla N Kumari S et al. Cancer stem cell in prostate cancer progression, metastasis and therapy resistance Biochim Biophys Acta Rev Cancer 2023 1878 3 188887 10.1016/j.bbcan.2023.188887 36997008 137 Yoshida GJ Saya H. Therapeutic strategies targeting cancer stem cells Cancer Sci 2016 107 1 5 11 10.1111/cas.12817 26362755 PMC4724810 138 Russo M Chen M Mariella E et al. Cancer drug-tolerant persister cells: from biological questions to clinical opportunities Nat Rev Cancer 2024 24 10 694 717 10.1038/s41568-024-00737-z 39223250 139 Fan G Zuo S Wang Z et al. Targeting of the IL-33/Wnt axis restricts breast cancer stemness and metastasis Sci Rep 2025 15 1 18172 10.1038/s41598-025-03260-9 40414980 PMC12104483 140 Cai M Zheng F Ren YZ et al. New insights into potential therapeutic targets for neuroendocrine prostate cancer: from bench to clinic Research 2025 8 0791 10.34133/research.0791 40746825 PMC12311307 ",
  "metadata": {
    "Title of this paper": "New insights into potential therapeutic targets for neuroendocrine prostate cancer: from bench to clinic",
    "Journal it was published in:": "Annals of Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490359/"
  }
}