{
  "title": "Paper_376",
  "abstract": "pmc BMC Musculoskelet Disord BMC Musculoskelet Disord 46 bmcmudis BMC Musculoskeletal Disorders 1471-2474 BMC PMC12482713 PMC12482713.1 12482713 12482713 41029311 10.1186/s12891-025-09121-w 9121 1 Research Study of the extent of surgical osteotomy in Cierny-Mader stages III and IV chronic osteomyelitis Wang Xu 1 3 Liu Fei 2 3 Zhang Zhi-meng 3 Yuan Dao-tong 3 Xie Wen-peng 4 http://orcid.org/0000-0001-8007-2706 Zhang Yong-kui xiaoniu0928@163.com 4 1 https://ror.org/05damtm70 grid.24695.3c 0000 0001 1431 9176 Beijing University of Chinese Medicine, 2 https://ror.org/02fn8j763 grid.416935.c Wangjing Hospital of China Academy of Chinese Medical Sciences, 3 https://ror.org/0523y5c19 grid.464402.0 0000 0000 9459 9325 Shandong University of Traditional Chinese Medicine, 4 https://ror.org/0523y5c19 grid.464402.0 0000 0000 9459 9325 Department of Orthopedic Surgery, Shandong University of Traditional Chinese Medicine Affiliated Hospital, 30 9 2025 2025 26 478161 877 21 9 2023 17 8 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Purpose To determine an optimal osteotomy criterion for patients with Cierny-Mader stages III and IV chronic osteomyelitis. Methods Seventy patients with Cierny-Mader stages III and IV chronic osteomyelitis admitted to the Department of Orthopedics of a Class III Grade A Hospital from January 2018 to March 2022 were selected for retrospective analysis and study. The following patient data were collected: gender, age, site of infection, bacterial culture results, internal fixation status, bone defect length, BMI, history of diabetes mellitus, smoking history, and history of preoperative antibiotic use. The patients were treated with sensitive antibiotics after surgery, followed up regularly, and venous blood C-reactive protein (CRP), sedimentation (ESR), white blood cells (WBC) and muscle strength (MTT scale), joint mobility (neutral 0° method), and bony healing time were measured to observe the recurrence rate of osteomyelitis and to assess the recovery of limb function according to the Enneking scale. Results Among the 70 patients, 20 cases were guided by X-ray, 30 cases by MRI, and 20 cases by SPECT. All patients underwent thorough debridement under the guidance of imaging modalities followed by external fixation. All cases were followed up and with a mean follow-up time of (12.2 ± 3.2) months. The recurrence rate of 35% in patients with X-ray as a guide was significantly higher than that of patients with MRI as a guide (10%) and SPECT as a guide (5%), and the difference between the three groups was statistically significant ( P Conclusion For patients with osteomyelitis without metal internal fixation, the osteotomy surgical technique with MRI to guide the expansion of 0.5 cm distally and proximally, or with SPECT imaging to guide the surgical procedure in the area with 30–40% of the radioactive count contour (isocontour, ISO) had the advantages of low recurrence rate and good recovery of limb function, and the differences were not statistically significant. For patients with osteomyelitis with metal internal fixation, the osteotomy surgical technique with SPECT to guide the surgical procedure had the advantages of low recurrence rate and good recovery of limb function. In patients with osteomyelitis with metal internal fixation, SPECT was used as a guide to determine the extent of the osteomyelitis lesion, and osteotomy in the area with 30–40% of ISO was more effective than MRI. Supplementary Information The online version contains supplementary material available at 10.1186/s12891-025-09121-w. Keywords Cierny-Mader stages III and IV chronic osteomyelitis Osteotomy range X-ray MRI SPECT pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Osteomyelitis is a serious infection of the bone, also referred to as a “second cancer” [ 1 2 3 4 3 The radiographic features of chronic osteomyelitis include: periosteal reaction, bone destruction with osteosclerosis, dead bone, and bone abscess [ 5 6 7 Information and methods General data A total of 70 patients with Cierny-Mader stages III and IV chronic osteomyelitis admitted to the Department of Orthopedics of a Class III Grade A Hospital from January 2018 to March 2022 were selected for this study, all of whom were treated with surgical debridement osteotomy plus external fixation and postoperative application of sensitive antibiotics. X-ray guided osteotomy was performed in 20 patients in group A, MRI guided osteotomy was performed in 30 patients in group B, and SPECT guided osteotomy was performed in 20 patients in group C. The differences in general conditions between the two groups were not statistically significant ( P n n n n n n n Diagnostic criteria (1) history of trauma and fracture; (2) local erythema, pain, and sinus tracts with repeated pus flow; (3) laboratory tests, relevant imaging examinations, and intraoperative tissue bacterial culture and pathological tests, clearly diagnosed as Cierny-Mader stages III and IV chronic osteomyelitis. Inclusion criteria (1) Those who met the above diagnostic criteria and were infected after traumatic fracture surgery; (2) those who had chronic osteomyelitis by intraoperative tissue sampling for pathological examination; (3) those who had Cierny-Mader stages III or IV; (4) those who were in good physical condition, without major medical diseases and could tolerate surgery; (5) those who agreed to undergo surgical external fixation treatment. Exclusion criteria (1) those with incomplete follow-up data; (2) those patients who follow up with shedding. Treatment method After the patient was admitted to our hospital, the relevant examinations were completed, and a bacterial culture and drug sensitivity test were performed with the secretion of the sinus tract, and the anti-infection treatment was started after screening for sensitive antibiotics. Preoperatively, the extent and length of the osteotomy were determined based on the patient’s imaging data. In group A patients, the contour of the osteosclerotic area was used as the standard for osteotomy until the “red pepper” sign was observed with fresh blood leakage (Fig. 1 2 3 4 5 Fig. 1 X-Ray image and osteotomy range of osteomyelitis Fig. 2 MRI image and osteotomy range of osteomyelitis Fig. 3 SPECT image and osteotomy range of osteomyelitis Fig. 4 SPECT image and osteotomy range of osteomyelitis Fig. 5 Picture of a surgical osteotomy Observation indexes and evaluation criteria  Inflammatory index testing After the operation, we followed up every two weeks in the outpatient clinic, and measured venous blood inflammatory indexes CRP, ESR and WBC and recorded the data.  (2) Functional evaluation One month after the operation, X-ray films were taken to observe bone growth, and functional assessment was performed, including muscle strength (MTT scale), joint mobility (0° in neutral position), and final bone healing time was recorded. The patients’ limb function recovery was also assessed according to the Enneking scale (excellent: 24–30 points; good: 19–23 points; acceptable: 12–18 points; poor: <12 points). Primary endpoint: Recurrence-free status at 1 year postoperatively, defined as absence of localized erythema/swelling, sinus tracts, normalized CRP/ESR levels, and no radiographic evidence of new osteolytic lesions. Secondary endpoints: Time to radiographic bone union and achievement of Enneking score ≥ 19 (indicating good or excellent functional outcomes).  (3) Recurrence rate Recurrence of infection was based on local symptoms and signs, such as sinus tract formation, exudation, erythema, and X-ray manifestations, as well as systemic symptoms, such as elevated CRP and ESR, and fever. Statistical analysis SPSS 26.0 (IBM Corporation, Armonk, NY, USA) software was used for statistical analysis. Quantitative data were statistically analyzed by t-test and one-way ANOVA, and count data were statistically analyzed by χ2 test and Fisher’s exact test. The confidence interval was set at 95%, and P Results The intraoperative osteotomy length was consistent with the preoperative assessment of the range in all patients, and all patients were followed up for a mean follow-up period of 12.2 ± 3.2 months. Post-debridement bacterial cultures were uniformly negative. Baseline characteristics No significant intergroup differences in demographics, infection sites, or risk factors (BMI, diabetes, smoking) were observed (Table 1 P Table 1 Comparison of patients’ general conditions Group A B C χ2/F p n 20 30 20 Gender Male 12 16 13 0.697 0.706 Female 8 14 7 Age(x ± s, years) 54.75 ± 7.48 54.75 ± 7.48 54.75 ± 7.48 1.641 0.201 Area Femur 5 9 4 2.644 0.852 Tibia 8 12 12 Humerus 5 7 3 radius 2 2 1 Bacterial culture Positive 17 25 16 0.184 0.912 Positive rate 85% 83.3% 80% Internal fixation Yes 6 7 11 0.559 0.062 No 14 23 9 BMI(kg/m 2 23.3 ± 4.5 23.4 ± 4.0 23.5 ± 3.6 1.813 0.922 Smoking Yes 4 10 5 1.144 0.564 No 16 20 15 Diabetes Yes 2 6 3 0.917 0.632 No 18 24 17  (2) Primary outcomes stratified by imaging modality and risk factors As shown in Table 2 n n n n n n 3 P P 3 Table 2 Comparison of bony healing time and recurrence Group n Bone healing Recurrence(number%) osteotomy length(x ± s, centimeter) Recur Recurrence rate A 20 9.6±3.17 7 35% 5.6 ± 1.8 B 30 11.6±4.37 3 10% 6.8 ± 2.1 C 20 11.2±3.95 1 5% 6.4 ± 1.7 F/χ2 3.357 6.903 2.354 p 0.041 0.03 0.023 Table 3 Recurrence stratified by internal fixation across all groups Group With Internal Fixation Without Internal Fixation n Recurrence Rate n Recurrence Rate A 6 3 50.0% 14 4 28.6% B 7 3 42.9% 23 0 0.0% C 11 0 0.0% 9 1 11.1% P 0.003 0.012  (3) Secondary outcomes (functional recovery, inflammatory markers) Comparison of inflammatory indexes: The WBC, CRP, and ESR of the three groups patients all returned to the normal range two weeks after surgery, and the differences were not statistically significant ( P 4 5 Table 4 Comparison of venous blood test indexes at 2 weeks after surgery Group n WBC/×10·9 L −1 ESR/mm·h −1 CRP/mg·L −1 A 20 7.98±1.59 13.15±6.34 6.51±3.19 B 30 8.69±1.62 14.60±6.78 7.77±3.37 C 20 8.24±1.77 15.05±7.13 7.58±3.47 F 1.181 0.442 0.917 p 0.313 0.645 0.405 Table 5 Comparison of recovery of limb function (number%) Group n Excellent Good Acceptable Poor χ2 P A 20 12(60) 5(25) 1(5) 2(10) 3.158 0.819 B 30 15(50) 5(16.7) 5(16.7) 5(16.7) C 20 10(50) 4(20) 4(20) 2(10)  (4) Subgroup analyses Table 6 P P P P 7 P P P P Table 6 Correlation analysis of risk factors and recurrence rate Risk factors Group Yes( n Recurrence Rate No( n Recurrence Rate OR (95% CI) P Diabets A 2 50.0% 18 27.8% 2.5 (0.2–32.1) 0.462 B 6 33.3% 24 6.7% 5.0 (1.1–22.5) 0.041 C 3 33.3% 17 0% / 0.067 Smoking A 4 50.0% 16 25.0% 3.0 (0.3–30.6) 0.307 B 10 20.0% 20 5.0% 4.0 (0.7–23.0) 0.157 C 5 20.0% 15 0% / 0.106 BMI ≥ 30 A 3 66.7% 17 23.5% 6.0 (1.1–32.8) 0.041 B 4 50.0% 26 5.8% 16.0 (1.8-142.2) 0.021 C 2 50.0% 18 0% / 0.033 Table 7 Smoking significantly delays bone healing time Group Smoking ( n No Smoking ( n Average deviation P Total 13.2 ± 4.1 10.3 ± 3.2 + 2.9 < 0.001 A 14.5 ± 3.8 8.9 ± 2.7 + 5.6 0.003 B 12.8 ± 4.3 10.5 ± 3.4 + 2.3 0.019 C 12.1 ± 3.9 10.3 ± 3.1 + 1.8 0.038 Discussion Staphylococcus aureus and coagulase-negative staphylococci are among the most common causative agents of osteomyelitis [ 8 9 10 11 12 14 12 15 16 17 18 19 20 21 When comparing the osteotomy lengths and bone healing times among the three imaging modalities, we found that MRI- and SPECT-guided osteotomies resulted in significantly longer osteotomy lengths and bone healing times compared to X-ray guidance (The values were respectively p p P Analysis of potential recurrence risk factors (BMI, diabetes, smoking history) revealed no statistically significant intergroup differences in baseline distribution ( P P The impact of preoperative antibiotic therapy remains underexplored in this study. Although 82.9% of patients received ≥ 2 weeks of preoperative antibiotics, we did not analyze its association with recurrence due to the uniformity of postoperative negative cultures and the lack of standardized antibiotic regimens. Notably, 72.4% of these patients received broad-spectrum β-lactams, which may have contributed to transient suppression of subclinical infections without eradicating biofilm-embedded pathogens. Future prospective studies should stratify patients by antibiotic duration and spectrum to clarify this relationship. X-rays are the most widely used diagnostic imaging technique and can be used as a preliminary examination for chronic osteomyelitis [ 13 22 23 25 24 26 27 3 Through this study, it was found that determining the extent of osteomyelitis debridement based on MRI and SPECT greatly reduced the recurrence rate of osteomyelitis compared with X-ray, and that SPECT was more advantageous in the presence of metal internal fixation. However, there are still recurrence cases in this, and the reasons for this are summarized as follows: (1) inadequate flushing during surgery, resulting in residual dead bone; (2) poor imaging of soft tissues by SPECT, resulting in incomplete removal of surrounding necrotic tissue; and (3) possible re-infection due to irregular postoperative dressing changes. In conclusion, this study summarizes a clinical treatment standard based on MRI and SPECT to determine the extent of lesion clearance in Cierny-Mader stages III and IV chronic osteomyelitis, which is of practical significance to establish osteomyelitis treatment standards. Several limitations should be acknowledged. First, the study did not analyze the impact of bacterial infection types (e.g., Staphylococcus aureus vs. Pseudomonas aeruginosa) and preoperative antibiotics on recurrence rates, as the primary focus was imaging-guided osteotomy techniques, but we found that the detection rate of Staphylococcus aureus was the highest, reaching 52%. While postoperative cultures were uniformly negative, preoperative bacterial profiles may still influence treatment outcomes through variations in biofilm formation or antibiotic resistance patterns. This exclusion limits our understanding of potential microbiological confounders and should be addressed in future studies. This paper lacks sufficient analysis of the interaction between internal fixation and other factors, which is a limitation of this study. We will take this as a starting point for subsequent research. The absence of time-to-event analyses for recurrence and survival endpoints warrants further investigation through multicenter trials with extended observation periods. Supplementary Information  Additional file 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Xu Wang and Fei Liu contributed equally to this work and are co-first author. Acknowledgements Not applicable. Author contributions Yong-kui Zhang and Wen-peng Xie contributed to the study conception and design. Material preparation, data collection and analysis were performed by Xu Wang and Fei Liu. The first draft of the manuscript was written by Xu Wang and Fei Liu，Dao-tong Yuan and Zhi-meng Zhang undertook part of statistical analysis. All authors read and approved the final manuscript. Yong-kui Zhang and Wen-peng Xie jointly directed this work and should be considered co-corresponding author. Xu Wang and Fei Liu contributed equally to this article and should be considered the co-first author. Funding The authors did not receive support from any organization for the submitted work. Data availability The datasets used and/or review during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate All experimental protocols were approved by the Ethics Committee of the Affiliated Hospital of Shandong University of Traditional Chinese Medicine. The first application for the approval number：2018-062-03, Project completion application approval number 2022-071-01. Because this was a retrospective analysis, the Ethics Committee of the Affiliated Hospital of Shandong University of Traditional Chinese Medicine waived informed Consent. All clinical investigations were conducted in accordance with the guidelines of the Declaration of Helsinki. Consent for publication Additional informed consent was obtained from all individual participants for whom identifying information is included in this article. Competing interests The authors declare no competing interests. Consent to participate Verbal informed consent was obtained prior to the interview. References 1. George CTMJ. J PJ: A clinical staging system for adult osteomyelitis. Clin Orthop Relat Res. 2003;(414). 10.1097/01.blo.0000088564.81746.62 12966271 2. Xukai W, Mingran Z, Tongtong Z, Qiuhua W, Guangyao L, Jianxun D. Flourishing antibacterial strategies for osteomyelitis therapy. Adv Sci. (Weinheim, Baden-Wurttemberg, Germany). 2023. 10.1002/advs.202206154 PMC10104653 36717275 3. Nandi SK, Bandyopadhyay S, Das P, Samanta I, Mukherjee P, Roy S, Kundu B. Understanding osteomyelitis and its treatment through local drug delivery system. Biotechnol Adv. 2016;34(8). 10.1016/j.biotechadv.2016.09.005 27693717 4. Jie S, Dong S, Shengpeng Y, Jingshu F, Xiaohua W, Shulin W, Zhao X. Radiological and clinical outcomes using induced membrane technique combined with bone marrow concentrate in the treatment of chronic osteomyelitis of immature patients. Bone Joint Res. 2021;10(1). 10.1302/2046-3758.101.BJR-2020-0229.R1 PMC7845462 33380210 5. Fernando M, Hidalgo PS, Brandt OK. Chronic recurrent multifocal osteomyelitis: diagnosis and treatment. Curr Opin Pediatr. 2020;33(1). 10.1097/MOP.0000000000000970 33278106 6. Bingyuan L, Qiaofeng G, Haiyong R, Yiyang L, Kai H. MRI Manifestations and diagnostic value of chronic osteomyelitis. J Healthcare Eng. 2021;2021. 7. Yasemin S, Gözde OZ, Nilgün US, Cüneyt T, Onder K. The additional value of Tc 99m HMPAO white blood cell SPECT in the evaluation of bone and soft tissue infections. Mol Imaging Radionucl Therapy. 2011;20(1). 10.4274/MIRT.20.02 PMC3590934 23486782 8. Prajwal G, Oganes A, Parham P, Mina G, Holden A, Diana H, Yin X, Avneesh C. Diagnostic performance comparison of conventional radiography to magnetic resonance imaging for suspected osteomyelitis of the extremities: a multi-reader study. Eur Radiol. 2023. 10.1007/s00330-023-09734-6 37178199 9. Narayan SK, Vasant MA, Vittal PM, U GK, Ankush GDS, Raviteja RD. Surgical management of chronic osteomyelitis: organisms, recurrence and treatment outcome. Chin J Traumatol = Zhonghua Chuang Shang Za Zhi, 2023. 10.1016/j.cjtee.2023.01.003 PMC10388580 36828768 10. Aidan H, G HV. J SA: Osteomyelitis. Arch Orthop Trauma Surg. 2013;133(9). 10.1007/s00402-013-1785-7 23771127 11. Tice AD, Hoaglund PA, Shoultz DA. Outcomes of osteomyelitis among patients treated with outpatient parenteral antimicrobial therapy. Am J Med. 2003;114(9). 10.1016/s0002-9343(03)00231-6 12829198 12. Beaman FD, Herrmann PFv, Kransdorf MJ, Adler RS, Amini B, Appel M, Arnold E, Bernard SA, Greenspan BS, Lee KS et al. ACR Appropriateness Criteria ® 10.1016/j.jacr.2017.02.008 28473089 13. O CL, Rodrigues dSFC. Antibiotics for treating chronic osteomyelitis in adults. Cochrane Database Syst Rev. 2009;(3). 10.1002/14651858.CD004439.pub2 19588358 14. Jingfeng L, Hao Z, Baiwen Q, Zhenyu P. Outcomes of vacuum sealing drainage treatment combined with skin flap transplantation and antibiotic bone cement on chronic tibia osteomyelitis: A case series study. Med Sci Monitor: Int Med J Experimental Clin Res. 2019;25. 10.12659/MSM.915921 PMC6660807 31320603 15. Simone R, A NL, Salvatore M, Giorgio MB, Silvio B. Correction of complex lower limb angular deformities with or without length discrepancy in children using the TL-HEX hexapod system: comparison of clinical and radiographical results. J Pediatr Orthop Part B. 2019;28(3). 10.1097/BPB.0000000000000573 30531204 16. Trampuz A, Zimmerli W. Diagnosis and treatment of infections associated with fracture-fixation devices. Injury 2006;37(2). 10.1016/j.injury.2006.04.010 16651073 17. J EJ, Z WP. T M: An aggressive surgical approach to the management of chronic osteomyelitis. Clin Orthop Relat Res. 1994;(298). 8118980 18. Jin LS, Sook WK, Jin CH, Young CY. Early-Phase SPECT/CT for diagnosing osteomyelitis: A retrospective pilot study. Korean J Radiol. 2020. 10.3348/kjr.2019.0746 PMC8005344 33289359 19. W LD, Tracy WJ, Scott LL. Advances in the Understanding and treatment of musculoskeletal infections. Instr Course Lect. 2015;64. 25745893 20. Lowenberg DW, DeBaun M, Suh GA. Newer perspectives in the treatment of chronic osteomyelitis: A preliminary outcome report. Injury. 2019;50. 10.1016/j.injury.2019.04.016 31079834 21. Trampuz A, Gilomen A, Fluckiger U, Frei R, Zimmerli W, Widmer A. 141 treatment outcome of infections associated with internal fixation devices: results from a 5-year retrospective study (1999–2003). Int J Infect Dis. 2006;10(S1). 22. Mohammad S, Abid H, Phillipa B, Deepa B. Clinical outcomes of the Ilizarov method after an infected tibial non union. Arch Trauma Res. 2013;2(2). 10.5812/atr.11300 PMC3876550 24396797 23. Alexis L, Julie J, Jeannette K, Colin H, Melissa H, Mark S. Imaging tests for the detection of osteomyelitis: a systematic review. Health Technol Assess (Winchester Eng). 2019;23(61). 10.3310/hta23610 PMC6843114 31670644 24. Alok K, Stephanie P, Michael L, R GD, T FD. Magnetic resonance imaging for diagnosing foot osteomyelitis: a meta-analysis. Arch Intern Med. 2007;167(2). 10.1001/archinte.167.2.125 17242312 25. Giovanni F, Chiara L, Claudia S, Simone OE, Cristina M, Leonardo M, Giulia B, Stefania M. Osteomyelitis of the lower limb: diagnostic accuracy of Dual-Energy CT versus MRI. Diagnostics 2023;13(4). 10.3390/diagnostics13040703 PMC9955987 36832191 26. K HR, Fabio S, Christoph E, Verena T, Jayagopi S, Kristian W, Koroush K. A SF: Value of diagnostic tools in the diagnosis of osteomyelitis: pilot study to Establish an osteomyelitis score. J Clin Med. 2023;12(9). 10.3390/jcm12093057 PMC10179525 37176498 27. Hoo LS, Bom KM. Localization of osteomyelitis lesions for operative eradication of chronic osteomyelitis of the lower extremities by bone SPECT/CT: a feasibility study. Int Orthop 2022. 10.1007/s00264-022-05617-5 36370164 ",
  "metadata": {
    "Title of this paper": "Study of the extent of surgical osteotomy in Cierny-Mader stages III and IV chronic osteomyelitis",
    "Journal it was published in:": "BMC Musculoskeletal Disorders",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482713/"
  }
}