{
  "title": "Paper_639",
  "abstract": "pmc World J Gastrointest Pathophysiol 1496 wjgp WJGP World Journal of Gastrointestinal Pathophysiology 2150-5330 Baishideng Publishing Group Inc PMC12476654 PMC12476654.1 12476654 12476654 41024985 10.4291/wjgp.v16.i3.107273 jWJGP.v16.i3.eid107273 1 Minireviews Barrett’s esophagus: A review Chela HK et al Chela Harleen Kaur Department of Gastroenterology and Hepatology, Charleston Area Medical Center, West Virginia University School of Medicine, West Virginia University School of Medicine, Charleston, WV 25303, United States. harleen.chela@camc.org Gandhi Mustafa Department of Gastroenterology and Hepatology, University of Missouri-Columbia, Columbia, MO 65211, United States Hazique Mohammad Department of Internal Medicine, University of Missouri-Columbia, Columbia, WV 65212, United States Ertugrul Hamza Department of Gastroenterology, West Virginia University Charleston Campus, Charleston, WV 25304, United States Gangu Karthik Department of Internal Medicine, Kansas University Medical Center, Kansas City, 66160, United States Daglilar Ebubekir Department of Gastroenterology and Hepatology, West Virginia University Charleston Campus, Charleston, WV 25303, United States Author contributions: Kaur CH contributed to obtaining images for endoscopy and pathology; Karthik G contributed to created one of the images using software; Ebubekir D contributed to obtaining images for endoscopy, editing manuscript; Kaur CH, Karthik G, and Ebubekir D contributed to designed and outlined the study; Kaur CH, Mustafa G, and Hamza E contributed to literature review; Kaur CH, Mustafa G, Mohammad H, Hamza E, and Karthik G contributed to writing and editing the manuscript; All authors have contributed to the formulation of the manuscript. Corresponding author: Harleen Kaur Chela, Assistant Professor, Department of Gastroenterology and Hepatology, Charleston Area Medical Center, West Virginia University School of Medicine, Charleston, WV 25303, United States. harleen.chela@camc.org 22 9 2025 22 9 2025 16 3 497731 107273 20 3 2025 30 4 2025 1 8 2025 22 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ Barrett’s esophagus is a pathological process where the inflammatory milieu created within the esophagus leads to progressive changes over time that can lead eventually to frank malignancy. It is a pre-malignant condition and involves a metaplastic transformation of the distal epithelium of the esophagus. There is a conversion of the normal type of squamous epithelium into the columnar type of epithelium. There are several risk factors associated with this condition and it is typically diagnosed endoscopically. This review article provides a brief overview of this condition. Endoscopy Barrett’s esophagus Pathophysiology Esophageal cancer Pathogenesis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Over the years, chronic inflammation has been recognized as an underlying key component of many disease states. Barrett’s esophagus (BE) is a pathological process where the inflammatory milieu created within the esophagus leads to progressive changes over time that can lead eventually to frank malignancy. It is a pre-malignant condition that is encountered in clinical practice. It involves a metaplastic transformation of the distal aspect of the esophagus which involves the conversion of the normal type of squamous epithelium into the columnar type of epithelium[ 1 1 2 This condition is named after Norman Rupert Barrett who was a London based surgeon at a hospital called St. Thomas. In 1950, he described ulcerations lined by columnar type epithelium in the distal portion of what we know to be the esophagus. Barrett argued that because the esophagus, by definition, must be lined by squamous epithelium, the ulcerations he described were on a tubular segment of the stomach that was drawn into the thoracic cavity due to a congenitally short esophagus[ 1 3 3 This review article provides a brief synopsis of the epidemiology, pathogenesis, clinical features, diagnosis, and management. DEFINITION The criteria for diagnosis and thus the definition of BE differs across the world. In the United States, Barrett's esophagus is described as a metaplastic process resulting in a change of the lining of the distal esophagus from one that is a normal squamous epithelium to a columnar-lined epithelium containing goblet cells[ 4 4 4 5 6 5 EPIDEMIOLOGY BE is being detected more readily in clinical practice given the increased awareness about BE and the long-term risks associated with it, especially EAC[ 7 8 8 9 9 10 11 11 12 13 13 PATHOGENESIS AND RISK FACTORS There are several well established risk factors linked to the emergence of BE and it is through recognition of these risk factors that a clinician can identify those patients using their clinical judgment. Table 1 Table 1 Established risk factors associated with Barrett’s esophagus[ 4 Chronic (≥ 5 years) GERD symptoms Advancing age (> 50 years) Male gender Caucasian race Tobacco usage Central obesity (waist circumference > 102 cm or waist–hip ratio > 0.9) Family history of BE GERD: Gastroesophageal reflux disease; BE: Barrett’s esophagus. GERD is a risk factor that is implicated in the pathogenesis of BE. However, the duration of the GERD carries relevance as it is chronic GERD defined as symptoms of GERD for 5 years or more with frequent weekly symptoms[ 4 7 14 15 15 16 16 11 11 11 17 19 Smoking tobacco is linked to the causation of BE as well as to the formation of adenocarcinoma of the esophagus[ 12 20 21 21 22 23 24 25 26 26 27 Obesity is linked to the development of BE utilizing increasing acid-mediated damage as it raises the intra-abdominal pressure[ 28 28 29 30 31 31 32 33 et al 34 34 Some studies have shown that the male gender is linked with a higher prevalence of BE (about 6.8%) and so is a family history of BE or EAC (about 23%)[ 35 35 4 36 36 4 36 As a result of this gender disparity, BE screening in women is anticipated to have a modest yield in terms of lowering EAC incidence. However, screening women with numerous risk factors for BE and EAC may be justified after discussing the pros and cons with the patient. The Caucasian race is another risk factor associated with the development of BE[ 4 4 1 Figure 1  Pathogenesis of Barrett’s esophagus. PROGRESSION OF BARRETT’S ESOPHAGUS TO ESOPHAGEAL ADENOCARCINOMA Several factors have been studied for their association with higher rates of development from BE to adenocarcinoma of the esophagus. Studies demonstrate that male gender, older age, a history of smoking, and low-grade dysplasia (also known as low-grade intraepithelial neoplasia) are associated with a higher chance of transformation of BE to EAC[ 36 36 et al 37 37 STRATEGIES TO PREVENT PROGRESSION OF BARRETT’S ESOPHAGUS TO ESOPHAGEAL ADENOCARCINOMA Studies have been undertaken to evaluate the effectiveness of chemo-preventative strategies for limiting the transformation of the dysplastic changes in BE to adenocarcinoma. The ASPECT trial was a double-blind study that included 2557 patients with BE randomized into four treatment groups of high dose omeprazole with aspirin, low-dose omeprazole with aspirin, high-dose omeprazole without aspirin, and low-dose omeprazole without aspirin[ 38 38 38 Prolonged use of PPIs alters the nature of reflux rather than eliminating it by altering the pH of refluxed material. Under PPI treatment, the usually inactive bile salts become aggressive toward the esophageal mucosa when reflux is alkalinized, increasing the risk of damage to the esophageal lining and potentially exacerbating conditions like Barrett's Esophagus. This highlights a significant limitation of PPI therapy and signifies the necessity for meticulous management and monitoring of patients on long-term PPI therapy, as alkaline reflux can adversely affect disease progression and risk of complications. Long term use of proton pump inhibitors has been linked to adverse effects such as osteoporosis, renal dysfunction, dementia and risk for infections particularly pneumonias and clostridium difficile infection. However, many of these potential effects are not conclusive as different studies have shown inconsistent results. Given the limitations and potential adverse effects of long-term use of proton pump inhibitors, the use in clinical practice is based on evidence from the guidelines and discussion with the patient. The American College of Gastroenterology (ACG) and the American Gastroenterological Association do advocate the limitation of acid exposure to the esophagus using proton pump inhibitors to decrease the progression of dysplastic changes[ 13 39 13 CLINICAL FEATURES The symptomatology of BE is typically associated with GERD and reflux-associated symptoms and related complications. The change in the lining of the esophagus to intestinal columnar type of metaplasia typical of BE itself does not lead to symptoms but it is the reflux that does so[ 40 41 42 11 DIAGNOSIS Screening Screening refers to the evaluation of individuals with GERD for BE. The gold standard for diagnosis of BE is via 4 4 43 4 2 Figure 2  Barrett’s esophagus and esophageal landmarks. However, conventional endoscopy does have limitations as the routine application in the general population is not cost-effective for screening[ 44 4 Hence as per the latest Barrett’s guidelines, it is advised that a single screening endoscopy be implemented for certain high-risk patients[ 4 3 4 A less invasive modality known as unsedated Trans-Nasal Endoscopy can also potentially be employed for screening for BE. The advantages include that is it less expensive and less invasive without anesthesia-related risks[ 45 45 45 4 A non-endoscopic technique that is available is the swallowable capsule sponge device and when used in conjunction with a biomarker it is considered an acceptable substitute for endoscopic evaluation[ 4 4 Advantages include being able to be conducted as an outpatient without any sedation or anesthesia and being less expensive than endoscopy. It is minimally invasive and does not require a physician[ 4 4 Esophageal video capsule endoscopy is another non-invasive technique that can be well tolerated. However, it has limited diagnostic yield with limited accuracy and low sensitivity as well as specificity hence not recommended for routine use[ 13 Another technique that is being created is a device that evaluates the volatile organic substances that are exhaled by a metal oxide sensor and the assessment is confected by artificial neural networks[ 4 In routine practice, the most utilized modality is high-definition white light endoscopy. A repeat endoscopy is not recommended for screening for BE after an initial negative endoscopic evaluation of BE[ 4 4 4 Once BE is suspected on endoscopy, a minimum of 8 endoscopic biopsies are recommended. In cases of short segments of 1-2 cm where 8 biopsies are not feasible then 4 biopsies/cm of circumferential columnar mucosa and 1 biopsy per cm of tongues of suspected Barrett’s mucosa is recommended[ 4 4 39 4 4 3A B Figure 3  Pathology images showing intestinal metaplasia. Surveillance In contrast to screening, surveillance refers to the periodic evaluation of those with a proven diagnosis of BE in order to identify malignancy in the esophagus at the earliest. Once the diagnosis of BE is established, a discussion needs to be held with the patient regarding surveillance programs. The rationale for performing endoscopic surveillance is to identify dysplasia or carcinoma at an initial and potentially treatable stage[ 4 Endoscopic evaluation with both white light endoscopy, as well as chromoendoscopy, is advised when performing surveillance of BE. Initial assessment of the BE should start with high-definition white light endoscopy which should incorporate a retroflexed view of the cardia. This should be followed by chromoendoscopy which can be used to augment the efforts to identify dysplastic changes and even carcinoma[ 4 4 4 Other imaging techniques are available to further improve the detection of dysplastic changes and cancer. Confocal laser endomicroscopy involves the intravenous administration of fluorescein and utilizes blue laser light to visualize the esophageal tissue[ 4 Volumetric laser endomicroscopy uses optical coherence tomography and is a probe-based method that can perform a 6 cm circumferential scan of the esophagus[ 46 46 3 The surveillance intervals vary depending on the length of the segment, presence and degree of dysplasia and preferences of the patient[ 4 If there is no dysplasia detected and the length of the BE segment is ≥ 3 cm then surveillance is recommended in 3 years and if the segment is < 3 cm then surveillance can be extended up to 5 years[ 4 4 vs 4 TREATMENT Non-endoscopic The mainstay of non-endoscopic treatment is centered around acid suppression with proton pump inhibitor (PPI) therapy. Once daily PPI therapy is advised in patients that do not have contraindications to their use to prevent ongoing acid-mediated damage to the esophageal mucosa[ 4 4 Endoscopic treatment Once HGD or intramucosal carcinoma (T1a) is detected on biopsies then this needs to be treated and can potentially be done endoscopically. If a patient with LGD also opts for treatment, then they would also be candidates for endoscopic approaches. A risks and benefits discussion needs to be held before embarking on this path as it also lends to future repeat endoscopies and surveillance programs. Endoscopic management is recommended for LGD, HGD, or intramucosal carcinoma[ 13 4 4 4 Figure 4 Barrett’s esophagus with a visible nodule seen on endoscopy. The modalities of endoscopic resection include endoscopic mucosal resection (EMR) and endoscopic submucosal dissection (ESD). They are cap-assisted EMR, multiband EMR, and ESD. Both EMR techniques (cap-assisted, multiband) have comparable efficacy and safety[ 4 Radiofrequency ablation (RFA) is the most efficacious and safe eradication technique for ablation and is the preferred one routinely[ 4 13 13 5 Figure 5  Surveillance after endoscopic eradication therapy and achieving complete eradication of intestinal metaplasia[ 4 SURGICAL TREATMENT For those with involvement of the submucosa, T1b lesions and beyond surgical treatment are advised. The possibility for lymph node metastasis in T1b disease is significantly higher and hence patients should be referred for surgical consultation for evaluation for esophagectomy[ 4 4 FUTURE OF BARRETT’S ESOPHAGUS As research in this area evolves, there are advances in techniques for detection and diagnosis of BE. More non-invasive markers are being developed for use as alternatives to endoscopy. Another upcoming area that is being studied is the use of artificial intelligence (AI) to evaluate for BE. AI is being used to detect neoplastic lesions with the development of computer aided detection[ 47 47 47 47 CONCLUSION BE is a common pathology encountered in clinical practice by both gastroenterologists and general practitioners. It deserves recognition and careful consideration when considering patients who require screening and the implications of the subsequent steps that may arise as a consequence. The early detection of dysplastic changes in BE is paramount so that treatment can be ensured to prevent progression to EAC and drastic surgeries.  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Barrett NR Chronic peptic ulcer of the oesophagus and 'oesophagitis' Br J Surg 1950 38 175 182 14791960 10.1002/bjs.18003815005 2 Maret-Ouda J Markar SR Lagergren J Gastroesophageal Reflux Disease: A Review JAMA 2020 324 2536 2547 33351048 10.1001/jama.2020.21360 3 Gindea C Birla R Hoara P Caragui A Constantinoiu S Barrett esophagus: history, definition and etiopathogeny J Med Life 2014 7 Spec No. 3 23 30 PMC4391409 25870690 4 Shaheen NJ Falk GW Iyer PG Souza RF Yadlapati RH Sauer BG Wani S Diagnosis and Management of Barrett's Esophagus: An Updated ACG Guideline Am J Gastroenterol 2022 117 559 587 35354777 10.14309/ajg.0000000000001680 PMC10259184 5 Riddell RH Odze RD Definition of Barrett's esophagus: time for a rethink--is intestinal metaplasia dead? Am J Gastroenterol 2009 104 2588 2594 19623166 10.1038/ajg.2009.390 6 Playford RJ New British Society of Gastroenterology (BSG) guidelines for the diagnosis and management of Barrett's oesophagus Gut 2006 55 442 16531521 10.1136/gut.2005.083600 PMC1856188 7 Chela HK Gangu K Ertugrul H Juboori AA Daglilar E Tahan V The 8th Wonder of the Cancer World: Esophageal Cancer and Inflammation Diseases 2022 10 44 35892738 10.3390/diseases10030044 PMC9326664 8 Sharma P Barrett Esophagus: A Review JAMA 2022 328 663 671 35972481 10.1001/jama.2022.13298 9 Shiota S Singh S Anshasi A El-Serag HB Prevalence of Barrett's Esophagus in Asian Countries: A Systematic Review and Meta-analysis Clin Gastroenterol Hepatol 2015 13 1907 1918 26260107 10.1016/j.cgh.2015.07.050 PMC4615528 10 Marques de Sá I Marcos P Sharma P Dinis-Ribeiro M The global prevalence of Barrett's esophagus: A systematic review of the published literature United European Gastroenterol J 2020 8 1086 1105 10.1177/2050640620939376 PMC7724547 32631176 11 Khieu M Mukherjee S Barrett Esophagus. StatPearls. Published online August 8, 2022. Accessed December 5, 2022. Available from: https://www.ncbi.nlm.nih.gov/books/NBK430979/ 12 Domper Arnal MJ Ferrández Arenas Á Lanas Arbeloa Á Esophageal cancer: Risk factors, screening and endoscopic treatment in Western and Eastern countries World J Gastroenterol 2015 21 7933 7943 26185366 10.3748/wjg.v21.i26.7933 PMC4499337 13 Shaheen NJ Falk GW Iyer PG Gerson LB American College of Gastroenterology ACG Clinical Guideline: Diagnosis and Management of Barrett's Esophagus Am J Gastroenterol 2016 111 30 50; quiz 51 26526079 10.1038/ajg.2015.322 PMC10245082 14 Fitzgerald RC Omary MB Triadafilopoulos G Dynamic effects of acid on Barrett's esophagus. An ex vivo proliferation and differentiation model J Clin Invest 1996 98 2120 2128 8903332 10.1172/JCI119018 PMC507657 15 Abdel-Latif MM Duggan S Reynolds JV Kelleher D Inflammation and esophageal carcinogenesis Curr Opin Pharmacol 2009 9 396 404 19596608 10.1016/j.coph.2009.06.010 16 Mikhael M Pasha B Chela H Tahan V Daglilar E Immunological and Metabolic Alterations in Esophageal Cancer Endocr Metab Immune Disord Drug Targets 2022 22 579 589 35086463 10.2174/1871530322666220127113752 17 Ouatu-Lascar R Fitzgerald RC Triadafilopoulos G Differentiation and proliferation in Barrett's esophagus and the effects of acid suppression Gastroenterology 1999 117 327 335 10419913 10.1053/gast.1999.0029900327 18 Stachler MD Taylor-Weiner A Peng S McKenna A Agoston AT Odze RD Davison JM Nason KS Loda M Leshchiner I Stewart C Stojanov P Seepo S Lawrence MS Ferrer-Torres D Lin J Chang AC Gabriel SB Lander ES Beer DG Getz G Carter SL Bass AJ Paired exome analysis of Barrett's esophagus and adenocarcinoma Nat Genet 2015 47 1047 1055 26192918 10.1038/ng.3343 PMC4552571 19 Que J Garman KS Souza RF Spechler SJ Pathogenesis and Cells of Origin of Barrett's Esophagus Gastroenterology 2019 157 349 364.e1 31082367 10.1053/j.gastro.2019.03.072 PMC6650338 20 Dong J Thrift AP Alcohol, smoking and risk of oesophago-gastric cancer Best Pract Res Clin Gastroenterol 2017 31 509 517 29195670 10.1016/j.bpg.2017.09.002 21 Arnson Y Shoenfeld Y Amital H Effects of tobacco smoke on immunity, inflammation and autoimmunity J Autoimmun 2010 34 J258 J265 20042314 10.1016/j.jaut.2009.12.003 22 Gonçalves RB Coletta RD Silvério KG Benevides L Casati MZ da Silva JS Nociti FH Jr Impact of smoking on inflammation: overview of molecular mechanisms Inflamm Res 2011 60 409 424 21298317 10.1007/s00011-011-0308-7 23 Rom O Kaisari S Aizenbud D Reznick AZ Identification of possible cigarette smoke constituents responsible for muscle catabolism J Muscle Res Cell Motil 2012 33 199 208 22614737 10.1007/s10974-012-9299-4 24 Rom O Avezov K Aizenbud D Reznick AZ Cigarette smoking and inflammation revisited Respir Physiol Neurobiol 2013 187 5 10 23376061 10.1016/j.resp.2013.01.013 25 Łuczaj W Gęgotek A Skrzydlewska E Antioxidants and HNE in redox homeostasis Free Radic Biol Med 2017 111 87 101 27888001 10.1016/j.freeradbiomed.2016.11.033 26 Kahrilas PJ Gupta RR Mechanisms of acid reflux associated with cigarette smoking Gut 1990 31 4 10 2318431 10.1136/gut.31.1.4 PMC1378332 27 Cook MB Shaheen NJ Anderson LA Giffen C Chow WH Vaughan TL Whiteman DC Corley DA Cigarette smoking increases risk of Barrett's esophagus: an analysis of the Barrett's and Esophageal Adenocarcinoma Consortium Gastroenterology 2012 142 744 753 22245667 10.1053/j.gastro.2011.12.049 PMC3321098 28 Corley DA Kubo A Levin TR Block G Habel L Zhao W Leighton P Quesenberry C Rumore GJ Buffler PA Abdominal obesity and body mass index as risk factors for Barrett's esophagus Gastroenterology 2007 133 34 41; quiz 311 17631128 10.1053/j.gastro.2007.04.046 29 Harvey AE Lashinger LM Hursting SD The growing challenge of obesity and cancer: an inflammatory issue Ann N Y Acad Sci 2011 1229 45 52 21793838 10.1111/j.1749-6632.2011.06096.x 30 Conroy MJ Dunne MR Donohoe CL Reynolds JV Obesity-associated cancer: an immunological perspective Proc Nutr Soc 2016 75 125 138 26567898 10.1017/S0029665115004176 31 Mazzarella L Why does obesity promote cancer? Epidemiology, biology, and open questions Ecancermedicalscience 2015 9 554 26284118 10.3332/ecancer.2015.554 PMC4531127 32 Singh S Sharma AN Murad MH Buttar NS El-Serag HB Katzka DA Iyer PG Central adiposity is associated with increased risk of esophageal inflammation, metaplasia, and adenocarcinoma: a systematic review and meta-analysis Clin Gastroenterol Hepatol 2013 11 1399 1412.e7 23707461 10.1016/j.cgh.2013.05.009 PMC3873801 33 Elliott JA Reynolds JV Visceral Obesity, Metabolic Syndrome, and Esophageal Adenocarcinoma Front Oncol 2021 11 627270 33777773 10.3389/fonc.2021.627270 PMC7994523 34 Hoyo C Cook MB Kamangar F Freedman ND Whiteman DC Bernstein L Brown LM Risch HA Ye W Sharp L Wu AH Ward MH Casson AG Murray LJ Corley DA Nyrén O Pandeya N Vaughan TL Chow WH Gammon MD Body mass index in relation to oesophageal and oesophagogastric junction adenocarcinomas: a pooled analysis from the International BEACON Consortium Int J Epidemiol 2012 41 1706 1718 23148106 10.1093/ije/dys176 PMC3535758 35 Qumseya BJ Bukannan A Gendy S Ahemd Y Sultan S Bain P Gross SA Iyer P Wani S Systematic review and meta-analysis of prevalence and risk factors for Barrett's esophagus Gastrointest Endosc 2019 90 707 717.e1 31152737 10.1016/j.gie.2019.05.030 36 Krishnamoorthi R Singh S Ragunathan K Visrodia K Wang KK Katzka DA Iyer PG Factors Associated With Progression of Barrett's Esophagus: A Systematic Review and Meta-analysis Clin Gastroenterol Hepatol 2018 16 1046 1055.e8 29199147 10.1016/j.cgh.2017.11.044 37 Parasa S Vennalaganti S Gaddam S Vennalaganti P Young P Gupta N Thota P Cash B Mathur S Sampliner R Moawad F Lieberman D Bansal A Kennedy KF Vargo J Falk G Spaander M Bruno M Sharma P Development and Validation of a Model to Determine Risk of Progression of Barrett's Esophagus to Neoplasia Gastroenterology 2018 154 1282 1289.e2 29273452 10.1053/j.gastro.2017.12.009 38 Jankowski JAZ de Caestecker J Love SB Reilly G Watson P Sanders S Ang Y Morris D Bhandari P Brooks C Attwood S Harrison R Barr H Moayyedi P AspECT Trial Team Esomeprazole and aspirin in Barrett's oesophagus (AspECT): a randomised factorial trial Lancet 2018 392 400 408 30057104 10.1016/S0140-6736(18)31388-6 PMC6083438 39 Spechler SJ Sharma P Souza RF Inadomi JM Shaheen NJ American Gastroenterological Association American Gastroenterological Association technical review on the management of Barrett's esophagus Gastroenterology 2011 140 e18 52; quiz e13 21376939 10.1053/j.gastro.2011.01.031 PMC3258495 40 DeMeester SR DeMeester TR Columnar mucosa and intestinal metaplasia of the esophagus: fifty years of controversy Ann Surg 2000 231 303 321 10714623 10.1097/00000658-200003000-00003 PMC1421001 41 Spechler SJ Barrett's esophagus Semin Gastrointest Dis 1996 7 51 60 8705259 42 Vaezi MF Atypical manifestations of gastroesophageal reflux disease MedGenMed 2005 7 25 PMC1681743 16614647 43 Sharma P Dent J Armstrong D Bergman JJ Gossner L Hoshihara Y Jankowski JA Junghard O Lundell L Tytgat GN Vieth M The development and validation of an endoscopic grading system for Barrett's esophagus: the Prague C & M criteria Gastroenterology 2006 131 1392 1399 17101315 10.1053/j.gastro.2006.08.032 44 Moriarty JP Shah ND Rubenstein JH Blevins CH Johnson M Katzka DA Wang KK Wongkeesong LM Ahlquist DA Iyer PG Costs associated with Barrett's esophagus screening in the community: an economic analysis of a prospective randomized controlled trial of sedated versus hospital unsedated versus mobile community unsedated endoscopy Gastrointest Endosc 2018 87 88 94.e2 28455158 10.1016/j.gie.2017.04.019 PMC5656556 45 Shariff MK Bird-Lieberman EL O'Donovan M Abdullahi Z Liu X Blazeby J Fitzgerald R Randomized crossover study comparing efficacy of transnasal endoscopy with that of standard endoscopy to detect Barrett's esophagus Gastrointest Endosc 2012 75 954 961 22421496 10.1016/j.gie.2012.01.029 46 Houston T Sharma P Volumetric laser endomicroscopy in Barrett's esophagus: ready for primetime Transl Gastroenterol Hepatol 2020 5 27 32258531 10.21037/tgh.2019.11.16 PMC7063498 47 Jong MR de Groof AJ Advancement of artificial intelligence systems for surveillance endoscopy of Barrett's esophagus Dig Liver Dis 2024 56 1126 1130 38071181 10.1016/j.dld.2023.11.038 ",
  "metadata": {
    "Title of this paper": "Advancement of artificial intelligence systems for surveillance endoscopy of Barrett's esophagus",
    "Journal it was published in:": "World Journal of Gastrointestinal Pathophysiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476654/"
  }
}