{
  "title": "Paper_1131",
  "abstract": "pmc Diagnostics (Basel) Diagnostics (Basel) 2841 diagno diagnostics Diagnostics 2075-4418 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468130 PMC12468130.1 12468130 12468130 41008723 10.3390/diagnostics15182351 diagnostics-15-02351 1 Article Parotid Gland Magnetic Resonance Elastography Feasibility Study: Clinical Diagnostic Potential and Future Perspectives as a Radiological Palpation Method https://orcid.org/0000-0003-3466-7260 Solak Merve Conceptualization Investigation Resources Methodology Software Writing – original draft Validation Formal analysis Project administration 1 * https://orcid.org/0000-0001-7464-988X Kaba Esat Conceptualization Investigation Writing – review & editing Visualization 1 https://orcid.org/0000-0002-4748-4941 Beyazal Mehmet Conceptualization Investigation Writing – review & editing 1 https://orcid.org/0000-0002-9833-402X Çeliker Metin Conceptualization Writing – review & editing Validation 2 https://orcid.org/0000-0002-5420-9825 Çeliker Fatma Beyazal Writing – review & editing Supervision Project administration Writing – original draft Validation Software Methodology Conceptualization 1 * Bini Fabiano Academic Editor 1 esatkaba04@gmail.com 2 * mervesolak2555@gmail.com fatma.bceliker@erdogan.edu.tr 16 9 2025 9 2025 15 18 497628 2351 09 8 2025 05 9 2025 14 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Results: Conclusions parotid gland tissue stiffness head and neck magnetic resonance elastography radiological palpation Recep Tayyip Erdogan University Development Foundation 02025007023649 This study has been supported by the Recep Tayyip Erdogan University Development Foundation (grant number: 02025007023649). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The parotid glands are the largest salivary glands in the human body [ 1 2 3 4 5 4 5 6 7 Elastography is a non-invasive imaging technique that objectively evaluates the biomechanical properties of tissues. First introduced in the late 1980s using ultrasound, it has since been widely applied in clinical practice across multiple organs [ 1 5 8 9 10 11 12 11 13 14 The primary objective of this study was to develop an optimized MRE protocol for the head and neck region and to assess its feasibility for evaluating the parotid gland using a 3.0 Tesla MRI system. This approach aimed to establish parotid gland–specific stiffness values in a healthy population. The data obtained from this study may serve as a reference for future research focused on characterizing parotid gland pathologies, guiding treatment planning in OMFS, and assessing potential post-radiotherapy complications in the head and neck region. Furthermore, the developed protocol has the potential to provide a novel diagnostic and prognostic perspective for integrating parotid gland MRE into clinical practice. 2. Materials and Methods Ethics: 2.1. Study Design and Participants This feasibility study was conducted in January 2024 using a 3.0 Tesla MRI scanner (GE Discovery MR750w, GE Healthcare, Waukesha, WI, USA) equipped with a dedicated 16-channel head/neck coil. Initially, 24 participants were recruited; three were excluded due to inadequate penetration of shear waves caused by motion-related or susceptibility artifacts, ensuring the reliability of subsequent quantitative analysis. The final study population comprised 21 participants (18 females, 3 males; mean age, 49 years; range, 20–83 years). 2.2. Imaging Protocol and MRE Technique Participants were voluntarily enrolled from routine outpatient cases who underwent brain MRI for various clinical indications. Inclusion criteria included: no prior history of radiotherapy to the head and neck region, no history of intracranial surgery, and no history of parotid gland surgery or known parotid pathology. All participants provided written informed consent, and elastography was performed immediately following routine brain MRI without altering the standard imaging workflow. All examinations were performed with participants in the supine position. For anatomical evaluation, the standard brain MRI protocol was first acquired, including three-plane localizer images, followed by high-resolution axial fat-suppressed T1-weighted images (repetition time [TR], 6.91 ms; echo time [TE], 2.63 ms; field of view [FOV], 240 mm; slice thickness, 1.2 mm; number of slices, 134) to delineate the head and neck anatomy in detail. MRE was subsequently performed according to the protocol summarized in Table 1 2.3. Image Postprocessing and ROI Analysis The MRE datasets were retrospectively evaluated by two independent readers: a radiology resident and a board-certified radiologist with experience in head and neck imaging. Regions of interest (ROIs) were manually delineated on axial magnitude images to precisely encompass the parotid gland tissue, and these ROIs were subsequently transferred onto the corresponding stiffness maps. To ensure accurate quantification, the ROIs were further verified and adjusted based on confidence maps, which help delineate regions with reliable elastographic data. Polygonal two-dimensional ROIs were carefully placed on a single axial slice displaying the largest cross-sectional area of the visible parotid gland, with deliberate exclusion of intraparotid lymph nodes, adjacent vascular structures, and any image artifacts that could compromise measurement accuracy. For each participant, both the mean stiffness value of the entire delineated gland and the maximum stiffness value—derived from the color-coded elastograms representing peak tissue rigidity—were recorded. The average ROI size was 2.1 ± 0.6 cm 2 The ROI placement and stiffness quantification process were iteratively refined using confidence maps, which facilitated the exclusion of pixels affected by noise or low signal-to-noise ratio, thereby enhancing the reliability of the stiffness measurements within the glandular tissue. 2.4. Statistical Analysis Interobserver reliability between the two readers was quantitatively assessed using the intraclass correlation coefficient (ICC), computed separately for mean and maximum stiffness measurements. The degree of agreement was further illustrated using Bland–Altman plots, which graphically represent the limits of agreement and systematic biases, if any, between the observers. Due to the study’s design involving a single time-point acquisition, test–retest repeatability assessments were not performed. Differences between the two observers’ measurements were statistically analyzed using two-sample independent t-tests to detect any significant measurement bias. A significance threshold of p To illustrate the methodology and highlight the quantitative assessment of parotid stiffness, Figure 1 Figure 2 3. Results A total of 21 healthy participants were included in this study. MRE was performed on the left parotid gland in 11 participants and on the right parotid gland in 10 participants. The mean age of subjects in the left parotid group was 55.36 ± 15.29 years, whereas the right parotid group had a mean age of 43.60 ± 14.58 years. Quantitative shear stiffness measurements of the parotid glands were successfully acquired in all participants without technical failure. Both maximum and mean stiffness values were independently assessed by two radiologists (designated as Radiologist 1 [R1] and Radiologist 2 [R2]). All values are expressed in kilopascals (kPa) and are summarized in the corresponding tables. Table 2 t p Table 3 Table 4 Table 3 Table 4 Descriptive statistics for the entire study population are detailed in Table 5 To place our findings in context, Table 6 Bland–Altman plots ( Figure 3 Additionally, independent two-sample t-tests revealed no statistically significant differences between the stiffness measurements obtained by the two radiologists ( p p 4. Discussion Magnetic resonance imaging remains the gold standard modality for the evaluation of suspected neoplastic lesions within the parotid gland, due to its superior soft tissue contrast resolution and detailed anatomical visualization capabilities [ 13 14 17 18 19 20 21 22 In contrast, MRE provides a non-invasive, quantitative biomechanical assessment by measuring shear wave propagation through tissues and generating stiffness maps that reflect mechanical properties [ 11 21 10 14 17 23 24 25 26 27 This study aimed to assess the technical feasibility of applying a standard 2D gradient-recalled echo liver MRE protocol for the biomechanical evaluation of the parotid gland in healthy volunteers. The results demonstrated that the protocol reliably yielded stiffness measurements in all participants, underscoring the technical applicability of MRE even in small, anatomically complex structures such as the parotid gland. To situate these findings within the broader scientific context, a comprehensive literature review was performed across multiple databases including PubMed/MEDLINE, Scopus, Web of Science, Google Scholar, Embase, and ResearchGate. Eligible studies were those investigating MRE applications in the head and neck region or focusing on elastography-specific driver configurations suitable for small anatomical structures. Although the number of published studies remains limited, the existing literature consistently supports the technical feasibility of parotid gland MRE and highlights the pressing need for methodological standardization. The pioneering in vivo application was reported by Haberman et al. [ 15 8 Elsholtz et al. [ 5 11 The potential clinical value of parotid MRE is further supported by studies such as that by Bhatia et al. [ 28 9 Furthermore, recent work by Tanabe et al. demonstrated the quantitative assessment of parotid gland stiffness using shear wave elastography, highlighting variations related to age, gender, and internal tissue architecture [ 16 Several technical considerations emerged from our results. The ICC for mean stiffness was 0.638 (moderate agreement), while maximum stiffness reached 0.918 (excellent reproducibility), highlighting MRE’s reliability in assessing parotid gland mechanics. The lower ICC for mean stiffness likely reflects the subjectivity of ROI delineation based on anatomical MRI, emphasizing the need for improved, possibly automated, segmentation methods. Our study has several inherent limitations that warrant careful consideration. Firstly, the assessment was limited to a single parotid gland per participant, which restricts the capacity for direct intra-individual and bilateral comparisons. Although our sample size is larger than in some earlier studies, it remains relatively modest and exhibits an imbalance in sex distribution, potentially impacting the generalizability of the findings. Furthermore, the application of a liver-specific 2D MRE protocol combined with a standard pneumatic driver, rather than a parotid-targeted mechanical driver, may have influenced shear wave propagation and penetration due to the parotid gland’s small size and intricate anatomical features. In addition, the manual and subjective delineation of ROIs based on anatomical MRI sequences introduces potential variability, which may partially explain the moderate interobserver agreement observed for mean stiffness measurements. Finally, the absence of pathological validation and longitudinal reproducibility assessments limits clinical interpretation. Despite these challenges, our findings contribute meaningfully to the growing evidence base supporting MRE as a feasible and potentially valuable tool for salivary gland assessment. Integration of MRE with advanced multiparametric MRI approaches may facilitate more comprehensive lesion characterization, particularly in distinguishing benign from malignant pathologies [ 17 18 19 20 21 22 23 24 26 27 Future research should aim to address these limitations by incorporating larger, more diverse cohorts, employing bilateral gland evaluation, developing parotid-specific hardware, and validating measurement reproducibility over time to fully establish the clinical utility and diagnostic accuracy of parotid gland MRE. Additionally, future research efforts should focus on validating parotid MRE in larger, more heterogeneous populations encompassing neoplastic, inflammatory, and post-radiation conditions. Priorities include standardization of acquisition parameters, optimization of driver placement strategies, bilateral gland imaging, and assessment of longitudinal reproducibility. Additionally, the development of compact, ergonomically designed, parotid-specific drivers—such as the passive driver recently introduced at ISMRM 2023 [ 29 Additionally, from a surgical perspective, MRE could provide valuable biomechanical data to support OMF. Quantitative stiffness maps may enhance preoperative planning, especially for tumor resection near critical neurovascular structures, and aid in monitoring post-treatment tissue remodeling. Recent advances in image guided OMFS emphasize the integration of quantitative imaging biomarkers for surgical navigation, and MRE may complement these approaches by providing objective stiffness information [ 16 30 5. Conclusions Magnetic Resonance Elastography is a non-invasive, reliable, and reproducible imaging technique that enables quantitative evaluation of the mechanical properties of soft tissues. Our study demonstrates that parotid gland stiffness can be accurately quantified using a standard 3 Tesla MRI system, thereby highlighting the potential of MRE as a quantitative “palpation” modality in head and neck imaging. Future research should focus on comprehensive evaluation of parotid biomechanical changes across various pathological states, including benign and malignant lesions as well as inflammatory conditions. Additionally, clarifying MRE’s role in functional assessment and early detection of radiation-induced changes in patients undergoing radiotherapy is critical. Such investigations will contribute to personalized treatment planning and mitigation of side effects in head and neck oncology. Moreover, integrating MRE with advanced MRI techniques to enhance diagnostic accuracy, alongside efforts to standardize protocols and validate reproducibility across centers, will be essential for widespread clinical adoption. Ultimately, MRE promises to become a vital component of multimodal imaging strategies aimed at improving individualized patient management and clinical outcomes in head and neck radiology. Disclaimer/Publisher’s Note: Author Contributions M.S.: Designed the analysis, collected the data, methodology, software, investigation, Conceptualization, Project administration, Writing—Original Draft the paper and Writing—Review & Editing the paper. E.K.: Designed the analysis, methodology, software, Formal analysis, Validation, and wrote the paper. M.B.: Designed the analysis, methodology, software, Formal analysis, Validation, and wrote the paper. M.Ç.: Designed the analysis, collected the data, methodology, and Writing—Review & Editing the paper. F.B.Ç.: Designed the analysis, collected the data, methodology, and Writing—Review & Editing the paper. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by Recep Tayyip Erdoğan University Training and Research Hospital Ethical Review Committee (Decision Number: 2024/295, approved date: 12 December 2024). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Informed consent for publication was also obtained from all subjects involved in the study. Data Availability Statement Data supporting the conclusions reported in this study are openly available. In cases where it is not possible to share research data publicly due to confidentiality, ethical or legal restrictions, the data may be provided upon reasonable requests by specifying the conditions of access. Conflicts of Interest The authors declare no conflicts of interest. Declaration of AI Use Large language models (LLMs) were utilized solely for language editing, grammar correction, and improving clarity of the manuscript. The scientific content, data. interpretation, and conclusions are solely the authors’ own work. References 1. Thoeny H.C. Imaging of salivary gland tumours Cancer Imaging 2007 7 52 62 10.1102/1470-7330.2007.0008 17485257 PMC1866314 2. Divi V. Fatt M.A. Teknos T.N. Mukherji S.K. Use of cross-sectional imaging in predicting surgical location of parotid neoplasms J. Comput. Assist. Tomogr. 2005 29 315 319 10.1097/01.rct.0000161758.25130.34 15891497 3. Yousem D.M. Kraut M.A. Chalian A.A. Major salivary gland imaging Radiology 2000 216 19 29 10.1148/radiology.216.1.r00jl4519 10887223 4. Thoeny H.C. De Keyzer F. Boesch C. Hermans R. Diffusion-weighted imaging of the parotid gland: Influence of the choice of b-values on the apparent diffusion coefficient value J. Magn. Reson. Imaging 2004 20 786 790 10.1002/jmri.20196 15503336 5. Elsholtz F.H.J. Reiter R. Garcia S.R.M. Braun J. Sack I. Hamm B. Schaafs L.-A. Multifrequency magnetic resonance elastography-based tomoelastography of the parotid glands-feasibility and reference values Dentomaxillofac. Radiol. 2022 51 20210337 10.1259/dmfr.20210337 34558305 PMC8693321 6. Guo J. Savic L.J. Hillebrandt K.H. Sack I. MR Elastography in Cancer Investig. Radiol. 2023 58 578 586 10.1097/RLI.0000000000000971 36897804 7. King A.D. Yeung D.K.W. Ahuja A.T. Tse G.M.K. Yuen H.Y. Wong K.T. van Hasselt A.C. Salivary gland tumors at in vivo proton MR spectroscopy Radiology 2005 237 563 569 10.1148/radiol.2372041309 16244265 8. Yeung D.K. Bhatia K.S. Lee Y.Y. King A.D. Garteiser P. Sinkus R. Ahuja A.T. MR elastography of the head and neck: Driver design and initial results Magn. Reson. Imaging 2013 31 624 629 10.1016/j.mri.2012.09.008 23164497 9. Bahn M.M. Brennan M.D. Bahn R.S. Dean D.S. Kugel J.L. Ehman R.L. Development and application of magnetic resonance elastography of the normal and pathological thyroid gland in vivo J. Magn. Reson. Imaging 2009 30 1151 1154 10.1002/jmri.21963 19856448 PMC2983468 10. Manduca A. Bayly P.V. Ehman R.L. Kolipaka A. Royston T.J. Sack I. Sinkus R. Van Beers B.E. MR elastography: Principles, guidelines, and terminology Magn. Reson. Med. 2021 85 2377 2390 10.1002/mrm.28627 33296103 PMC8495610 11. Atamaniuk V. Chen J. Obrzut M. Glaser K.J. Hańczyk Ł. Pozaruk A. Gutkowski K. Obrzut B. Domka W. Ehman R.L. High-frequency shear wave MR elastography of parotid glands: Custom driver design and preliminary results Sci. Rep. 2024 14 24496 10.1038/s41598-024-75806-2 39424898 PMC11489586 12. Sunnetci K.M. Kaba E. Celiker F.B. Alkan A. Deep Network-Based Comprehensive Parotid Gland Tumor Detection Acad. Radiol. 2024 31 157 167 10.1016/j.acra.2023.04.028 37271636 13. Yabuuchi H. Fukuya T. Tajima T. Hachitanda Y. Tomita K. Koga M. Salivary gland tumors: Diagnostic value of gadolinium-enhanced dynamic MR imaging with histopathologic correlation Radiology 2003 226 345 354 10.1148/radiol.2262011486 12563124 14. Wang J. Takashima S. Takayama F. Kawakami S. Saito A. Matsushita T. Momose M. Ishiyama T. Head and neck lesions: Characterization with diffusion-weighted echo-planar MR imaging Radiology 2001 220 621 630 10.1148/radiol.2202010063 11526259 15. Habermann C.R. Sinkus R. Albrecht A. Cramer M.C. Weiss F. Adam G. MR-elastography of the parotid gland: Feasibility and first experiences RöFo 2005 177 A26 10.1055/s-2005-931840 16. Tanabe Y. Shirai A. Ogura I. Shear Wave Elastography for Parotid Glands: Quantitative Analysis of Shear Elastic Modulus in Relation to Age, Gender, and Internal Architecture in Patients with Oral Cancer J. Imaging 2025 11 145 10.3390/jimaging11050145 40423002 PMC12112164 17. Gökçe E. Beyhan M. Diagnostic efficacy of diffusion-weighted imaging and semiquantitative and quantitative dynamic contrast-enhanced MRI in salivary gland tumors World J. Radiol. 2023 15 20 31 10.4329/wjr.v15.i1.20 36721673 PMC9884336 18. Cantisani V. David E. Sidhu P.S. Sacconi B. Greco A. Pandolfi F. Tombolini M. Mele L.L. Calliada F. Brunese L. Parotid Gland Lesions: Multiparametric Ultrasound and MRI Features Ultraschall Med. 2016 37 454 471 10.1055/s-0042-109171 27300273 19. Gökçe E. Beyhan M. Advanced magnetic resonance imaging findings in salivary gland tumors World J. Radiol. 2022 14 256 271 10.4329/wjr.v14.i8.256 36160835 PMC9453317 20. Huang N. Chen Y. She D. Xing Z. Chen T. Cao D. Diffusion kurtosis imaging and dynamic contrast-enhanced MRI for the differentiation of parotid gland tumors Eur. Radiol. 2022 32 2748 2759 10.1007/s00330-021-08312-y 34642805 PMC8921043 21. Mariappan Y.K. Glaser K.J. Ehman R.L. Magnetic resonance elastography: A review Clin. Anat. 2010 23 497 511 10.1002/ca.21006 20544947 PMC3066083 22. Alvi S. Chudek D. Limaiem F. Parotid Cancer StatPearls [Internet] StatPearls Publishing Treasure Island, FL, USA 2024 30855924 23. Chen R. Xie J. Chen J. Li X. Lin Q. Xu Q. Chen Y. Wang L. Zheng R. Xu B. Analysis of the Parotid Glands on an Energy Spectrum CT Iodine Map to Evaluate Irradiation-Induced Acute Xerostomia Technol. Cancer Res. Treat. 2024 23 15330338241256814 10.1177/15330338241256814 38773777 PMC11113032 24. Fiorino C. Rizzo G. Scalco E. Broggi S. Belli M.L. Dell’oca I. Dinapoli N. Ricchetti F. Rodriguez A.M. Di Muzio N. Density variation of parotid glands during IMRT for head-neck cancer: Correlation with treatment and anatomical parameters Radiother. Oncol. 2012 104 224 229 10.1016/j.radonc.2012.06.003 22809587 25. Brook I. Early side effects of radiation treatment for head and neck cancer Cancer Radiother. 2021 25 507 513 10.1016/j.canrad.2021.02.001 33685809 26. Alsanie I. Rajab S. Cottom H. Adegun O. Agarwal R. Jay A. Graham L. James J. Barrett A.W. van Heerden W. Distribution and Frequency of Salivary Gland Tumours: An International Multicenter Study Head Neck Pathol. 2022 16 1043 1054 10.1007/s12105-022-01459-0 35622296 PMC9729635 27. Fang K.-M. Wen M.-H. Hsu W.-L. Chang C.-M. Hou P.-Y. Liao L.-J. Ultrasonographic and elastographic biometry in adult major salivary glands: A preliminary case-control report Sci. Rep. 2019 9 8885 10.1038/s41598-019-45230-y 31222096 PMC6586938 28. Bhatia K. Cho C.C. Tong C.S. Lee Y.Y. Yuen E.H. Ahuja A.T. Shear wave elastography of focal salivary gland lesions: Preliminary experience in a routine head and neck US clinic Eur. Radiol. 2012 22 957 965 10.1007/s00330-011-2364-3 22200901 29. Atamaniuk V. Chen J. Glaser K. Pozaruk A. Obrzut M. Obrzut B. Domka W. Gutkowski K. Ehman R. Cholewa M. Feasibility of High-Frequency Shear Wave MR Elastography of the Parotid Glands ISMRM Toronto, ON, Canada 2023 10.1038/s41598-024-75806-2 PMC11489586 39424898 30. Gontarz M. Urbańska M. Bargiel J. Gąsiorowski K. Marecik T. Szczurowski P. Zapała J. Wyszyńska-Pawelec G. Metastatic malignancies in the parotid gland: A retrospective study J. Craniomaxillofac. Surg. 2024 52 1334 1340 10.1016/j.jcms.2024.08.007 39244389 Figure 1 Representative images obtained using a 3.0 Tesla MRE system from a 45-year-old female participant illustrate stiffness measurement of the left parotid gland. The images are presented from left to right as follows: confidence map, stiffness map (elastogram), and axial fat-unsuppressed T1-weighted anatomical reference image. Regions of interest (ROIs) were manually delineated as polygonal contours encompassing the entire parotid gland while deliberately excluding vascular structures and intraglandular lymph nodes. Quantitative stiffness values, expressed in kilopascals, were derived from the central slice of the elastogram. Measurement reliability was ensured through the evaluation of the confidence map, while precise ROI placement was guided by the corresponding anatomical T1-weighted images. Figure 2 Axial 3.0 Tesla MRE images of the parotid gland from a 53-year-old female participant, illustrating a focused quantitative assessment of tissue stiffness. From left to right, the confidence map, stiffness map (elastogram), and corresponding axial T1-weighted anatomical image are presented. The entire gland was systematically examined on the elastogram to identify the region with the highest stiffness signal intensity. A minimally sized, manually delineated region of interest (ROI) was precisely placed over the area exhibiting maximal and homogeneous stiffness, with rigorous cross-referencing against both anatomical and confidence maps to ensure accuracy. Care was taken to exclude partial volume artifacts and confounding structures, ensuring the ROI encompassed only parenchymal tissue. Figure 3 Bland–Altman plots illustrating interobserver agreement for mean and maximum stiffness measurements obtained from magnetic resonance elastography. The majority of data points (green crosses) lie within the 95% limits of agreement (dotted red lines), with only a single participant exhibiting values outside these boundaries in both measurement categories. This demonstrates a high degree of concordance and reproducibility between the two independent radiologists. diagnostics-15-02351-t001_Table 1 Table 1 MRI Parameters of the Standard 2D GRE MRE Protocol Used for Parotid Gland Evaluation. Parameter Value  Magnetic field strength 3T  Sequence GRE MRE  Orientation Axial  Number of slices 4  Slice thickness 10 mm  Field of view (FOV) 420 mm  Phase FOV 100% (420 mm)  Base resolution/Acquisition matrix 256 × 64  Phase resolution 25%  Phase encoding direction A–P  Acceleration factor (ASSET, SENSE, GRAPPA) 2  Echo time (TE) Shortest (approx. 20 ms)  Repetition time (TR) 50 ms  Flip angle (FA) 20°  Number of breath-holds 4 (end-expiration, one per slice) diagnostics-15-02351-t002_Table 2 Table 2 Mean and standard deviation of maximum and mean stiffness values (kPa) of the left and right parotid glands assessed independently by two radiologists.  R1_Max ± SD kPa R1_Mean ± SD kPa R2_Max ± SD kPa R2_Mean ± SD kPa  Left 1.743 ± 0.721 1.356 ± 0.190 1.950 ± 0.469 1.272 ± 0.224  Right 1.401 ± 0.165 1.118 ± 0.167 1.363 ± 0.174 1.196 ± 0.146 diagnostics-15-02351-t003_Table 3 Table 3 Stiffness values (kPa) of parotid glands in male participants. Standard deviation is not applicable (N/A) for the right parotid gland due to a single measurement. Localization R1_Max ± SD kPa R1_Mean ± SD kPa R2_Max ± SD kPa R2_Mean ± SD kPa  Left 2.354 ± 1.040 1.222 ± 0.205 2.350 ± 1.012 1.207 ± 0.034  Right 1.390 ± N/A 1.153 ± N/A 1.342 ± N/A 1.278 ± N/A diagnostics-15-02351-t004_Table 4 Table 4 Stiffness values (kPa) of parotid glands in female participants as assessed independently by two radiologists. Localization R1_Max ± SD kPa R1_Mean ± SD kPa R2_Max ± SD kPa R2_Mean ± SD kPa  Left 1.689 ± 0.385 1.359 ± 0.174 1.832 ± 0.337 1.343 ± 0.133  Right 1.326 ± 0.159 1.099 ± 0.173 1.359 ± 0.189 1.133 ± 0.158 diagnostics-15-02351-t005_Table 5 Table 5 Descriptive statistics (kPa) of mean and maximum stiffness values of the parotid glands in 21 healthy participants, including inter-observer agreement analysis. Statistic R1-Max R1-Mean R2-Max R2-Mean  Count 0.021 kPa 0.021 kPa 0.021 kPa 0.021 kPa  Mean 1.595 kPa 1.210 kPa 1.563 kPa 1.147 kPa  Std 0.532 kPa 0.241 kPa 0.529 kPa 0.234 kPa  Min 0.959 kPa 0.571 kPa 1.051 kPa 0.701 kPa  Max 3.362 kPa 1.671 kPa 3.395 kPa 1.505 kPa  Median 1.436 kPa 1.241 kPa 1.438 kPa 1.149 kPa diagnostics-15-02351-t006_Table 6 Table 6 Published Parotid Gland Elastography Studies and Reported Stiffness Values. Study (Year) Participants/Patients Organ/Region Method/Equipment/Driver Frequency Measured Parameters Mean Stiffness/Findings Elsholtz et al., 2022 [ 5 20 healthy volunteers Parotid 3T MRI, multifrequency tomoelastography 25–50 Hz SWS, φ SWS mean: 0.97 m/s, φ mean: 0.59 rad Yeung et al., 2013 [ 8 10 healthy volunteers Parotid 3T MRI, adaptive driver for parotid 25–50 Hz G’ (shear modulus) 1.12 ± 0.48 kPa Atamaniuk et al., 2024 [ 11 10 healthy volunteers Parotid 3T MRI, high-frequency passive driver 50–100 Hz Shear modulus 1.25 ± 0.20 kPa Habermann et al., 2005 [ 15 5 healthy volunteers Parotid 3T MRI, mechanical driver directly on gland 50 Hz Shear modulus 1.29 ± 0.08 kPa Tanabe et al., 2025 [ 16 124 parotid glands Parotid 2D-SWE - Shear wave elastography 11.32 ± 1.91 kPa (SWE) ",
  "metadata": {
    "Title of this paper": "Metastatic malignancies in the parotid gland: A retrospective study",
    "Journal it was published in:": "Diagnostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468130/"
  }
}