{
  "title": "Paper_298",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12484968 PMC12484968.1 12484968 12484968 41027977 10.1038/s41598-025-04047-8 4047 1 Article Ultrasound guided retrolaminar block reduces postoperative gastrointestinal system dysfunctions during percutaneous nephrolithotomy: a prospective, randomised, double-blind, clinical study Bayindir Serpil 1 Yildirim Kadir kadir.yildirim@sbu.edu.tr 2 1 https://ror.org/03k7bde87 grid.488643.5 0000 0004 5894 3909 Department Of Anesthesiology And Reanimation, Health Sciences University, Elazig Fethi Sekin SUAM, 2 https://ror.org/03k7bde87 grid.488643.5 0000 0004 5894 3909 Department Of Urology, Health Sciences University, Elazig Fethi Sekin SUAM, 30 9 2025 2025 15 478255 33802 5 3 2025 23 5 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ We aimed to determine the postoperative gastrointestinal tract dysfunction and intraoperative hemodynamic effects of ultrasound-guided retrolaminar block in patients undergoing percutaneous nephrolithotomy. Fifty-eight adult patients were randomly divided into 2 groups preoperatively: Group RLB ( n n p p p Keywords Retrolaminar block Percutaneous nephrolithotomy Gastrointestinal tract dysfunctions I-FEED score Perlas score Subject terms Gastroenterology Urology https://doi.org/10.13039/501100004410 Türkiye Bilimsel ve Teknolojik Araştırma Kurumu pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction General anesthesia has a number of effects that produce gastrointestinal tract (GI) dysfunction in the postoperative period. These effects are related to a variety of factors ranging from the pharmacological properties of anesthesia agents to the neurohumoral effects triggered by surgical stress. Common GI dysfunctions include nausea and vomiting; abdominal distension due to decreased intestinal peristalsis and postoperative inflammatory response; delayed gastric emptying; ileus; fatigue; and delayed initiation of oral feeding. These conditions may lead to prolonged hospital stay, increased treatment costs and decreased patient comfort 1 2 Percutaneous nephrolithotomy (PCNL) is the minimally invasive surgical technique of choice for large (> 2 cm) and complex kidney stones. Using a rigid nephroscope, percutaneous access is established, and staghorn calculi gradually fragmented and removed 3 4 5 6 7 8 In this study, we aimed to determine the postoperative GI and intraoperative hemodynamic effects of USG-guided RLB in patients undergoing PCNL. Methodology Study design and settings This was a randomized prospective single center clinical study that aimed to evaluate the likely changes in GI functions postoperative period in patients undergoing PCNL. The study was conducted in Elazığ Fethi Sekin City Hospital (Türkiye) between January and March 2025. The study protocol was approved by the local ethics committee decision no: 26,959 (11/09/2024) and the Clinical Trials registration was submitted on 22/01/2025 and its ID number was NCT06787898 1 Participants A total of 58 patients aged 18–65 years with body mass index (BMI) of 25–39 (kg/m²) and American Society of Anesthesiologists (ASA) physical status I-II-III, scheduled for elective PCNL under general anesthesia were recruited for the study. Exclusion criteria included; BMI > 40 kg/m 2 Randomization and blinding Before PCNL operation the participants were randomly allocated to two groups by another expert who was not involved in the anesthesia management; Group RLB was RLB ( n n www.randomizer.org Protocol Standard monitoring procedures including pulse oximetry, 5‑lead electrocardiography and noninvasive blood pressure measurements were performed before anesthesia. Basal heart rates (HR) and mean arterial pressures (MAP) were recorded. General anesthesia was applied to both groups, and propofol (1.5-2 mg/kg), rocuronium (0.6–1.2 mg/kg), and fentanyl (3–4 µg/kg) were used for the induction of anesthesia. In addition, 1 µg/kg fentanyl can be re-administered for analgesia. In accordance with the ERAS protocol, 10 mg ondansetron is routinely used in PCNL each patient in our clinic to reduce postoperative complications and accelerate patient recovery. The patients were placed on their side, T9, T10 vertebraes were marked. After the skin was cleaned, the area was covered with sterile drape. A linear USG probe (6–13 Hz, Hitachi Europe Ltd, Tokyo, Japan) was placed in the center of the vertebral bodies to visualize the T9, T10 vertebrae. An anesthesiologist (experienced in RLB) performed the procedures using an in-plane approach with a USG-guided 1–15 Hz convex probe (8 − 4, Hitachi Europe Ltd, Tokyo, Japan). A puncture needle (21Gx100mm, USG-Type CCR, Vygon Co. Ltd. Ecouen, France) was inserted 1 cm from the probe at a 45-degree angle to the skin, targeting the lamina of the desired vertebra. And then suction from the needle by syringe., confirming the absence of blood or cerebrospinal fluid. 10 mL of 0.25% bupivacaine was injected posterior to each lamina (T9, T10), totaling 20 mL (Fig. 2  Fig. 1 Consolidated Standards of Reporting Trials (CONSORT) flow diagram of the study.  Fig. 2 Skin surface anatomy landmarks for in-plane retrolaminar block and the entry of a needle, under USG- guidance coming into contact with the lamina. Outcome measures Demographic characteristics of all patients (age, weight, BMI, ASA, comorbidities), intraoperative characteristics (duration of surgery, blood loss, amount of opioid consumed, amount of urine per hour), HR and MAP were recorded before induction, after induction, after block, after 30 min, after 1 h and after recovery. Demographic data of the patients were obtained using the hospital data processing module and anesthesia records. In the postoperative period, the abdominal region of the patients was examined with a portable USG convex probe (6–15 Hz, Shangal International Holding Corp Ltd, Hamburg, Germany) in the operating room and in the ward. Peristaltic movements and gastric antrum examination were classified by Perlas Score (pre-induction, postoperative 1st, 3rd, 6th, 12th hour). No fluid in the antrum was scored as 0, minimal fluid in the right supine position was scored as 1, and tense antrum in both supine and right supine position was scored as 2 9 Sample size The sample size was determined before the start of the study, taking into account the following criteria: To determine the required number of participants for the study, we hypothesized that RLB could provide analgesia in PCNL. We calculated that at least 50 patients (25 in each group) were required to ensure with 95% confidence that the lower limit of the one-sided 95% confidence interval (or equivalently, the 90% two-sided confidence interval) would not fall below a noninferiority margin of -1 (given a significance level of 0.05). To account for potential dropouts, we enrolled a greater number of patients (28/30) than the calculated number in each group. Statistical analysis For the analysis of the study, data were entered into the Statistical Package for the Social Sciences (SPSS) software (IBM, SPSS version 27), and descriptive statistics were determined for each variable. The normality of the distribution of quantitative variables was assessed using the Kolmogorov-Smirnov test. For the comparison of quantitative variables with normal distribution between two independent groups, the Independent Samples t-test was used. For the comparison of non-normally distributed quantitative measurements between two independent groups, the Mann-Whitney U p Results A total of 67 patients were recruited to participate in this study. Five patients were found ineligible because they did not meet the inclusion criteria (Anormaity Inability to understand ( n n n 2 n n n 1 There were no significant differences in demographic characteristics and operation datas between the groups. Opioid consumption was significantly lower in Group RLB (61.11 ± 21.18 µg) compared to Group Control (173.33 ± 36.51 µg) (Table 1 p  Table 1 Demographic characteristics and operation datas in two groups. Group RLB n Group control n p Age (years) 52,57 ± 7,26 53,96 ± 7,47 0,475 Sex (F/M) 14/14 19/11 0,306 Weight (kg) 66,46 ± 8,99 66,13 ± 8,46 0,886 BMI (kg/m 2 30 (25–38) 30 (26–37) 0,938 ASA (I/II/III) 12/13/3 15/11/5 1, 000 Hypertension (yes/no) 21/7 22/8 0,885 Access location (upper/center/lower) 2/7/19 2/7/21 0,985 Longest length of stone (mm) 25 ± 4,48 26,46 ± 4,31 0,209 Position of the stone (lower/centre/upper/pelvis) 12/4/3/9 14/3/5/8 0,852 Stone location (right/left) 15/13 16/14 0,986 Operation time (min) 101,78 ± 15,04 101,33 ± 12,86 0,902 Anesthesia time (min) 117,14 ± 14,68 115,66 ± 12,98 0,686 Amount of bleeding (ml) 33,39 ± 4,91 33,50 ± 5,11 0,936 Opioid consumption (µg) 61,11 ± 21,18 173,33 ± 36,51 < 0,001 * Data are expressed as the mean ± SD for numbers. BMI: body mass index, ASA: American Society of Anesthesiologists, F: female, M: male, RLB: retrolaminar block, Control: control. Postoperative GI outcomes, including first flatus time (4.10 ± 0.87 h), first defecation time (20.96 ± 3.68 h), and I-FEED scores (2.35 ± 0.91) were statistically significantly lower in Group RLB. Postoperative time to first rescue analgesia was significantly longer in Group RLB (13.35 ± 4.06) compared to the control group. This finding, together with lower intraoperative opioid consumption and lower postoperative VAS scores in Group RLB, supports the conclusion that RLB provides effective analgesia in patients undergoing PCNL. Two study groups are compared in Table 2 3  Table 2 Comparison of postoperative GI outcomes, analgesia requirements, and other parameters between two groups. Grup RLB Group control p Mean ± SD Min-Maks Mean ± SD Min-Maks Duration of first oral feeding (min) 6,5 ± 0,96 (5–9) 8,1 ± 1,76 (5–12) < 0,001* Duration of first flatus (h) 4,10 ± 0,87* (3–6) 6,36 ± 1,21 (4–9) < 0,001* Duration of first defecation (h) 20,96 ± 3,68* (10–29) 30,06 ± 2,87 (23–36) < 0,001* Duration of hospitalization (day) 3,67 ± 0,86 (2–5) 3,73 ± 0,78 (2–5) 0,852 Duration of first mobilisation (h) 9 ± 1,24 (7–11) 9 ± 1,05 (7–11) 0,903 Duration of rescue analgesia time (h) 13,35 ± 4,06* (7–22) 3,5 ± 1,50 (1–6) < 0,001* İ-FEED Score values 2,35 ± 0,91* (1–4) 4,63 ± 1,51 (2–7) < 0,001* I-FEED: Intestinal-Failure Feeding Evaluation Device, SD: Standard deviation, Mean: Average, Min: Minimum, Max: Maximum, RLB: retrolaminar block, Control: control, * p  Table 3 Postoperative clinical characteristics in two groups. Group RLB n Group Control n p Nause (yes) n (%) 5 (17,8) 8 (26,6) 0,421 Vomiting (yes)n (%) 2 (7,1) 7 (23,3) 0,089 Abdominal pain (yes)n (%) 3 (10,7) 6 (20) 0,329 İleus (yes)n (%) 0 (0) 3 (10) 0,086 Fatigue(yes) n (%) 14 (50) 17 (56,6) 0,611 Anorexia (yes)n (%) 7 (25) 11 (36,6) 0,337 RLB: retrolaminar block, Control: control, * p Data are presented as number (percentage). Heart rate values were statistically significantly lower at all time points following regional block application in Group RLB as presented in Fig. 3 4 p Visual Analog Scale scores remained low throughout the postoperative period and patient satisfaction scores were high simultaneously in Group RLB. At the 6th postoperative hour, Group RLB had statistically significantly lower degrees of gastric fullness with the Perlas score used for USG evaluation of gastric content (Table 4  Table 4 Perlas score values (Grade 0/1/2) in two groups. Group RLB n Group control n p Postoperatif 3 h (yes), n 25/3/0 21/9/0 0,07 Postoperatif 6 h (yes), n 18/10/0 13/7/10 0,004* Postoperatif 12 h (yes), n 18/10/0 21/9/0 0,643 RLB: retrolaminar block, Control: control, * p  Fig. 3 Changes in heart rate (bmp) occurred at distinct time intervals within each group. RLB: retrolaminar block, Control: control, * p  Fig. 4 Changes in mean arterial pressure (mmHg) occurred at distinct time intervals within each group. RLB: retrolaminar block, Control: control, * p Discussion To our knowledge, this is the first randomized comparative clinical trial investigating the effects of RLB on postoperative GI in PCNL. The main mechanism of action of RLB for analgesia can be explained by the spread of local anesthetic from the superior costotransverse ligaments anteriorly into the paravertebral space, epidural spaces or intervertebral foramen 10 11 12 Retrolaminar block is a new regional analgesic block that can be used as an alternative to PVB. The injection of local anesthetic between the vertebral lamina and deep paraspinal muscles instead of between the parietal pleura and the costotransverse ligament makes RLB technically easier than PVB. For experienced practitioners in USG-guided regional anesthesia, the learning curve for the RLB technique is relatively short. Our USG experience has resulted in a low failure rate in RSB applications ( n 13 14 15 GI dysfunctions such as distension, PONV, slowed intestinal peristalsis, ileus, fatigue, delayed gastric emptying and delayed oral active eating may be seen. Postoperative GI dysfunction affects patients both physically and psychologically and negatively affects the healing process. In our study, intestinal peristalsis and gastric fluid volume status were scored by Perlas scoring with USG convex low frequency (2–5 MHz) transducer probe in supine and right lateral decubitus position at preoperative baseline, postoperative 1, 3, 6 and 12 h. Ke Peng et al. applied stellate ganglion block in patients undergoing posterior spinal surgery for thoracolumbar spinal fracture 7 16 17 3 Although RLB is increasingly used for postoperative analgesia in patients undergoing surgery 6 13 15 2 6 PCNL is an effective and safe method for the treatment of kidney stones. However, serious complications such as colon injury may occur rarely (0.3%) during the PCNL procedure, especially during percutaneous access to the kidney. Advanced age, low BMI, marked pelvic-lingual dilatation, megacolon and horseshoe kidney have been reported in the literature as factors that increase the risk of colonic perforation 18 19 Limitations: The study has several limitations. First, it was conducted in a single center, which limited the generalization of the results to other centers and different patient populations. Second, since the study focused on short-term results, further studies may need to be planned to evaluate the long-term effects of RLB on GI function (e.g., chronic gastrointestinal problems). In addition, some clinical assessments and some components of the I-FEED score include subjective elements in determining gastrointestinal function. The level of statistical significance can be increased by increasing the sample size. In this regard, future research with larger participant groups will enable us to better evaluate the applicability of our findings to different populations and clinical scenarios. Conclusion Retrolaminar block has shown positive effects on postoperative pain management, gastrointestinal tract function and hemodynamic stability in PCNL patients. Lower opioid consumption, faster bowel movements and longer-lasting analgesic effect improved patient satisfaction and provided adequate postoperative pain control. These findings support the use of RLB as a safe and effective analgesic method in PCNL surgery. . Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions SB, KY: Contributed to data collection, drafted the introduction and discussion, conducted the related literature search, and edited the references. SB, KY: Contributed to the conception and study design, provided critical evaluation, conducted the statistical analysis, and contributed to the conclusion. SB, KY: Contributed to the material and methods section, discussion section, and interpreted the data. All authors approved the final version of the manuscript to be published. Data availability The datasets used and/or analysed during the current study available from the corresponding author on reasonable request. Competing interests The authors declare no competing interests. Ethical approval This prospective clinic study received approval from the Ethics Committee of University of Fırat, Faculty of Medicine (Approval Number: 2024/12-14-26959, Approval Date: 11 September, 2024). The study was registered in the Clinical Trial database under the registration number NCT06787898 Informed consent Written informed consent was taken from all the patients. References 1. Zuo X Enhanced recovery after surgery protocol accelerates recovery of lumbar disc herniation among elderly patients undergoing discectomy via promoting Gastrointestinal function Pain Res. Manag 2021 22 3573460 10.1155/2021/3573460 PMC8629654 34853625 Zuo, X. et al. Enhanced recovery after surgery protocol accelerates recovery of lumbar disc herniation among elderly patients undergoing discectomy via promoting Gastrointestinal function. Pain Res. Manag 22 10.1155/2021/3573460 PMC8629654 34853625 2. Melloul E Guidelines for perioperative care for pancreatoduodenectomy: enhanced recovery after surgery (ERAS) recommendations 2019 World J. Surg. 2020 44 2056 2084 10.1007/s00268-020-05462-w 32161987 Melloul, E. et al. Guidelines for perioperative care for pancreatoduodenectomy: enhanced recovery after surgery (ERAS) recommendations 2019. World J. Surg. 44 32161987 10.1007/s00268-020-05462-w 3. Pu C The efficacy and safety of percutaneous nephrolithotomy under general versus regional anesthesia: a systematic review and meta-analysis Urolithiasis 2015 43 455 466 10.1007/s00240-015-0776-2 25926280 Pu, C. et al. The efficacy and safety of percutaneous nephrolithotomy under general versus regional anesthesia: a systematic review and meta-analysis. Urolithiasis 43 25926280 10.1007/s00240-015-0776-2 4. Zeng G Mini percutaneous nephrolithotomy is a noninferior modality to standard percutaneous nephrolithotomy for the management of 20-40 mm renal calculi: a multicenter randomized controlled trial Eur. Urol. 2021 79 114 121 10.1016/j.eururo.2020.09.026 32994063 Zeng, G. et al. Mini percutaneous nephrolithotomy is a noninferior modality to standard percutaneous nephrolithotomy for the management of 20-40 mm renal calculi: a multicenter randomized controlled trial. Eur. Urol. 79 32994063 10.1016/j.eururo.2020.09.026 5. Kim E Kwon W Oh S Bang S The erector spinae plane block for postoperative analgesia after percutaneous nephrolithotomy Chin. Med. J. (Engl) 2018 131 15 1877 1878 10.4103/0366-6999.237408 30058589 PMC6071450 Kim, E., Kwon, W., Oh, S. & Bang, S. The erector spinae plane block for postoperative analgesia after percutaneous nephrolithotomy. Chin. Med. J. (Engl) 131 30058589 10.4103/0366-6999.237408 PMC6071450 6. Liu D Safety and efficacy of ultrasound-guided retrolaminar block of multiple injections in retroperitoneal laparoscopic nephrectomy: a prospective randomized controlled study J. Pain Res. 2021 14 333 342 10.2147/JPR.S282500 33574697 PMC7872929 Liu, D. et al. Safety and efficacy of ultrasound-guided retrolaminar block of multiple injections in retroperitoneal laparoscopic nephrectomy: a prospective randomized controlled study. J. Pain Res. 14 33574697 10.2147/JPR.S282500 PMC7872929 7. Peng K Zhang J Chen WR Liu HY Ji FH Ultrasound-guided stellate ganglion block improves Gastrointestinal function after thoracolumbar spinal surgery Clin. Ther. 2017 39 11 2322 2330 10.1016/j.clinthera.2017.09.008 28974305 Peng, K., Zhang, J., Chen, W. R., Liu, H. Y. & Ji, F. H. Ultrasound-guided stellate ganglion block improves Gastrointestinal function after thoracolumbar spinal surgery. Clin. Ther. 39 28974305 10.1016/j.clinthera.2017.09.008 8. Murouchi T Yamakage M Retrolaminar block: analgesic efficacy and safety evaluation J. Anesth. 2016 30 1003 1007 10.1007/s00540-016-2230-1 27518726 Murouchi, T. & Yamakage, M. Retrolaminar block: analgesic efficacy and safety evaluation. J. Anesth. 30 27518726 10.1007/s00540-016-2230-1 9. Perlas A Davis L Khan M Mitsakakis N Chan VW Gastric sonography in the fasted surgical patient: a prospective descriptive study Anesth. Analg 2011 113 1 93 97 10.1213/ANE.0b013e31821b98c0 21596885 Perlas, A., Davis, L., Khan, M., Mitsakakis, N. & Chan, V. W. Gastric sonography in the fasted surgical patient: a prospective descriptive study. Anesth. Analg 113 21596885 10.1213/ANE.0b013e31821b98c0 10. Onishi E Toda N Kameyama Y Yamauchi M Comparison of clinical efficacy and anatomical investigation between retrolaminar block and erector spinae plane block Biomed. Res. Int. 2019 2019 2578396 10.1155/2019/2578396 31032339 PMC6458933 Onishi, E., Toda, N., Kameyama, Y. & Yamauchi, M. Comparison of clinical efficacy and anatomical investigation between retrolaminar block and erector spinae plane block. Biomed. Res. Int. 2019 31032339 10.1155/2019/2578396 PMC6458933 11. Alken P Percutaneous nephrolithotomy—the puncture BJU Int. 2022 129 1 17 24 10.1111/bju.15564 34365712 Alken, P. Percutaneous nephrolithotomy—the puncture. BJU Int. 129 34365712 10.1111/bju.15564 12. Panchal SJ Müller-Schwefe P Wurzelmann JI Opioidinduced bowel dysfunction: prevalence, pathophysiology and burden Int. J. Clin. Pract. 2007 61 7 1181 1187 10.1111/j.1742-1241.2007.01415.x 17488292 PMC1974804 Panchal, S. J., Müller-Schwefe, P. & Wurzelmann, J. I. Opioidinduced bowel dysfunction: prevalence, pathophysiology and burden. Int. J. Clin. Pract. 61 17488292 10.1111/j.1742-1241.2007.01415.x PMC1974804 13. Wang Q Comparison of the analgesic effect of ultrasound-guided paravertebral block and ultrasound-guided retrolaminar block in uniportal video-assisted thoracoscopic surgery: a prospective, randomized study BMC Cancer 2021 21 1 1229 10.1186/s12885-021-08938-7 34784889 PMC8594110 Wang, Q. et al. Comparison of the analgesic effect of ultrasound-guided paravertebral block and ultrasound-guided retrolaminar block in uniportal video-assisted thoracoscopic surgery: a prospective, randomized study. BMC Cancer 21 34784889 10.1186/s12885-021-08938-7 PMC8594110 14. Eldadamony Mohammed Z Nashaat Mohammed M Gad Mostafa M Bahy O Elsaid Rashad A The efficacy of the ultrasound-guided retrolaminar block versus the classic paravertebral block in patients undergoing unilateral inguinal hernioplasty: a randomized controlled study Rev. Esp. Anestesiol Reanim 2024 71 8 584 591 10.1016/j.redare.2024.03.008 38552956 Eldadamony Mohammed, Z., Nashaat Mohammed, M., Gad Mostafa, M., Bahy, O. & Elsaid Rashad, A. The efficacy of the ultrasound-guided retrolaminar block versus the classic paravertebral block in patients undergoing unilateral inguinal hernioplasty: a randomized controlled study. Rev. Esp. Anestesiol Reanim 71 10.1016/j.redare.2024.03.008 38552956 15. Abdelbaser I The effect of ultrasound-guided bilateral thoracic retrolaminar block on analgesia after pediatric open cardiac surgery: a randomized controlled double-blind study Korean J. Anesthesiol 2022 75 3 276 282 10.4097/kja.21466 35016497 PMC9171541 Abdelbaser, I. et al. The effect of ultrasound-guided bilateral thoracic retrolaminar block on analgesia after pediatric open cardiac surgery: a randomized controlled double-blind study. Korean J. Anesthesiol 75 35016497 10.4097/kja.21466 PMC9171541 16. Zhong T Transversus abdominis plane block following abdominally based breast reconstruction: study protocol for a randomized controlled trial Trials 2013 14 424 10.1186/1745-6215-14-424 24325953 PMC3878890 Zhong, T. et al. Transversus abdominis plane block following abdominally based breast reconstruction: study protocol for a randomized controlled trial. Trials 14 24325953 10.1186/1745-6215-14-424 PMC3878890 17. Wang D Ultrasound guided lateral quadratus lumborum block enhanced recovery in patients undergoing laparoscopic colorectal surgery Adv. Med. Sci. 2021 66 1 41 45 10.1016/j.advms.2020.12.002 33359908 Wang, D. et al. Ultrasound guided lateral quadratus lumborum block enhanced recovery in patients undergoing laparoscopic colorectal surgery. Adv. Med. Sci. 66 33359908 10.1016/j.advms.2020.12.002 18. Kachrilas S Colon perforation during percutaneous renal surgery: a 10-year experience in a single endourology centre Urol. Res. 2012 40 263 268 10.1007/s00240-012-0464-4 22307366 Kachrilas, S. et al. Colon perforation during percutaneous renal surgery: a 10-year experience in a single endourology centre. Urol. Res. 40 22307366 10.1007/s00240-012-0464-4 19. Yi M Wu Y Li M Zhang T Chen Y Effect of remote ischemic preconditioning on postoperative Gastrointestinal function in patients undergoing laparoscopic colorectal cancer resection Int. J. Colorectal Dis. 2023 38 1 68 10.1007/s00384-023-04346-4 36899148 Yi, M., Wu, Y., Li, M., Zhang, T. & Chen, Y. Effect of remote ischemic preconditioning on postoperative Gastrointestinal function in patients undergoing laparoscopic colorectal cancer resection. Int. J. Colorectal Dis. 38 36899148 10.1007/s00384-023-04346-4 ",
  "metadata": {
    "Title of this paper": "Effect of remote ischemic preconditioning on postoperative Gastrointestinal function in patients undergoing laparoscopic colorectal cancer resection",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484968/"
  }
}