{
  "title": "Paper_1187",
  "abstract": "pmc Nat Sci Sleep Nat Sci Sleep 2069 nss nss Nature and Science of Sleep 1179-1608 Dove Press PMC12467178 PMC12467178.1 12467178 12467178 41018851 10.2147/NSS.S554362 554362 1 Original Research Inflammation in Obstructive Sleep Apnea: A Global Bibliometric Perspective Fan et al Fan et al http://orcid.org/0009-0007-6404-2997 Fan Haixia  1 * http://orcid.org/0009-0009-4674-9547 Niu Huiyan  2 * Zhao Bomeng  2 http://orcid.org/0000-0001-8637-3315 Gao Xiaoling  3 1 Department of Sleep Center, First Hospital of Shanxi Medical University Taiyuan Shanxi Province People’s Republic of China 2 Second College of Clinical Medicine, Shanxi Medical University Taiyuan Shanxi Province People’s Republic of China 3 Department of Sleep Center, Second Hospital of Shanxi Medical University Taiyuan Shanxi Province People’s Republic of China Correspondence: Xiaoling Gao, Department of Sleep Center, Second Hospital of Shanxi Medical University Taiyuan Shanxi Province People’s Republic of China Tel +86 13513607801 * These authors contributed equally to this work 22 9 2025 2025 17 479220 2275 2295 24 7 2025 29 8 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 Fan et al. 2025 Fan et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Purpose Obstructive sleep apnea (OSA) is increasingly recognized as a systemic disorder in which inflammation plays a pivotal role in its pathophysiology and comorbidities. This study aimed to conduct the first comprehensive bibliometric analysis of global research on inflammation in OSA, in order to map knowledge structures, identify influential contributors, and highlight emerging research trends. Patients and Methods Publications related to OSA and inflammation were retrieved from the Web of Science Core Collection (WoSCC) (1996–2025). After exclusions, 2,075 articles and reviews were analyzed using bibliometric tools including CiteSpace, VOSviewer, and the bibliometrix R package. Citation frequencies, co-citation networks, and collaboration patterns among countries, institutions, authors, and journals were examined. Results The number of publications has shown robust growth (annual rate 12.11%). China and the United States were the leading contributors, with Harvard University, the University of Chicago, and Institut National De La Sante Et De La Recherche Medicale (INSERM) among the most productive institutions. Influential authors included Gozal D, Kheirandish-Gozal L, and Khalyfa A. Sleep and Breathing Circulation American Journal of Respiratory and Critical Care Medicine Conclusion Research on inflammation is evolving from mechanistic insights toward clinical management and interdisciplinary exploration. Looking ahead, priority should be given to biomarker discovery and the development of anti-inflammatory therapeutic strategies. These findings provide a roadmap for targeted research and clinical translation in the field of OSA-related inflammation, ultimately improving patient outcomes. Keywords obstructive sleep apnea inflammation bibliometric analysis mechanisms comorbidities treatment National Natural Science Foundation of China General Program Shanxi Province Science and Technology Achievement Transformation Guided Program Shanxi Province Higher Education “Billion Project” Science and Technology Guidance Project Scientific Research Project from the Shanxi Provincial Health Commission Scientific and Activities of Selected Returned Overseas Professionals in Shanxi Province This work was supported by the National Natural Science Foundation of China General Program (Grant No. 82370091); the Shanxi Province Science and Technology Achievement Transformation Guided Program (Grant No. 202204021301068); Shanxi Province Higher Education “Billion Project” Science and Technology Guidance Project (Grant No. BYJL029); Scientific Research Project from the Shanxi Provincial Health Commission (Grant No. 2023XG027); Fund Program for the Scientific and Activities of Selected Returned Overseas Professionals in Shanxi Province (Grant No. 20250052). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Obstructive sleep apnea (OSA) is an increasingly common disorder of repeated upper airway collapse during sleep, which leads to oxygen desaturation and disrupted sleep. 1 2 3 4 5 6 Accumulating evidence supports that OSA is a chronic low-grade inflammatory condition, in which inflammation may play a pivotal role in its pathophysiology, comorbidities, and associated oxidative stress. 7 8 9 Bibliometric analysis, which makes use of citation data to quantitatively evaluate the spread and influence of scientific works across various sectors within a specific discipline, has become a highly useful approach for analyzing research trends and scholarly contributions. 10 11 12 Materials and Methods Database and Search Strategy The Web of Science Core Collection (WoSCC), a widely used dataset in bibliometrics, 13 14 15 16 Supplementary Table 1 Figure 1 Figure 1 Flowchart of Literature Search, Screening, Inclusion, and Analysis. Abbreviations Data Processing The data covered the period from 1 January 1996 to 16 April 2025, with the data segmented into one-year time slices for detailed analysis. All records from the WoSCC were exported as “full records and cited references” in plain text format and Tab format. 17 http://bibliometric.com/ 18 19 20 21 Results Publication Trends and General Characteristics Figure 2A Figure 2B Supplementary Table 2 Figure 2C Figure 2D Figure 2 Overview of Publications and Citations on Inflammation in Obstructive Sleep Apneas (1996–2025). ( A B C D Collaboration Among Countries/ Regions Our analysis of WoSCC data reveals that, 2,075 publications originated from 73 countries, highlighting the collaborative nature of research worldwide. The country collaboration map ( Figure 3A Figure 3B Figure 3A Figure 3C Figure 3D Figure 3C Supplementary Table 3 Figure 3 Global Trends and Collaboration Networks in Scientific Publications on Inflammation in Obstructive Sleep Apneas. ( A B C D Abbreviations Institutional Collaboration and Author/Co-Author Networks In addition to identifying leading institutions, our analysis explores their collaborative networks. Figure 4A Figure 4B Figure 4 Institutional Contributions, Collaboration Networks and Authorship Analyses on Inflammation in Obstructive Sleep Apneas. ( A B C D The contributions of authors to the academic landscape are substantial, with 9,147 individuals contributing to these documents. Of these, 52 authors have produced single-authored works, resulting in a total of 66 single-authored documents. Collaboration is prominent, as evidenced by an average of 6.45 co-authors per document and 18.51% of documents involving international co-authorship ( Supplementary Table 2 Table 1 Top 10 Authors on Inflammation in Obstructive Sleep Apneas Research (1996–2025) Rank Author h_index g_index m_index TC NP PY_start Articles Articles Fractionalized 1 Gozal D 46 81 2.091 6800 96 2004 96 21.19 2 Kheirandish-Gozal L 35 52 1.75 3680 52 2006 52 10.97 3 Mcnicholas WT 20 24 0.952 4066 24 2005 24 11.74 4 Bhattacharjee R 18 21 1.059 1114 21 2009 21 3.43 5 Wang Y 18 35 1.2 1295 35 2011 35 5.21 6 Khalyfa A 17 21 1 878 21 2009 21 3.35 7 Kim J 16 20 0.941 929 20 2009 20 3.42 8 Lévy P 16 17 0.842 2231 17 2007 17 2.80 9 Pépin JL 16 20 0.842 2138 20 2007 20 2.46 10 Redline S 14 21 0.667 1289 21 2005 21 3.59 Abbreviations In Figure 4C Figure 4D Table 1 20 19 Table 1 Top Journals and Co-Citation Patterns Figure 5A Figure 5B Figure 5A B Figure 5C Table 2 Figure 5D Figure 5E Table 2 Top 10 Influential Journals on Inflammation in Obstructive Sleep Apneas Research (1996–2025) Rank Source h_index g_index m_index TC NP PY_start IF JCR 1 Sleep and Breathing 29 45 1.45 2978 149 2006 2 Q3 2 Sleep 28 46 1.217 2551 46 2003 4.9 Q1 3 Chest 26 34 0.897 3739 34 1997 8.6 Q1 4 American Journal of Respiratory and Critical Care Medicine 25 26 1.136 3705 26 2004 19.4 Q1 5 Sleep Medicine 25 42 1.25 1875 60 2006 3.4 Q2 6 European Respiratory Journal 24 28 1.143 3143 28 2005 21 Q1 7 Sleep Medicine Reviews 23 31 1 3145 31 2003 9.7 Q1 8 Journal of Clinical Sleep Medicine 20 41 0.952 1745 45 2005 2.9 Q2 9 PLOS ONE 18 27 1.059 1165 27 2009 2.6 Q2 10 International Journal of Molecular Sciences 15 26 1.25 753 42 2014 4.9 Q1 Abbreviations Table 3 Top 10 Most Cited Publications Based on Bibliometrix Analysis (1996–2025) Rank First Author Year Journal Paper DOI Local Citations Global Citations LC/GC Ratio (%) Normalized Local Citations Normalized Global Citations 1 Yokoe T 9 2003 Circulation Elevated Levels of C-Reactive Protein and Interleukin-6 in Patients With Obstructive Sleep Apnea Syndrome Are Decreased by Nasal Continuous Positive Airway Pressure 10.1161/01.CIR.0000052627.99976.18 256 750 34.13 3.10 2.03 2 Ryan S 22 2005 Circulation Selective Activation of Inflammatory Pathways by Intermittent Hypoxia in Obstructive Sleep Apnea Syndrome 10.1161/CIRCULATIONAHA.105.556746 240 729 32.92 5.61 4.48 3 Shamsuzzaman ASM 23 2002 Circulation Elevated C-Reactive Protein in Patients With Obstructive Sleep Apnea 10.1161/01.CIR.0000018948.95175.03 201 734 27.38 4.45 4.11 4 Lavie L 24 2003 Sleep Med Rev Obstructive sleep apnoea syndrome – an oxidative stress disorder 10.1053/smrv.2002.0261 174 779 22.34 2.11 2.10 5 Nadeem R 25 2013 J Clin Sleep Med Serum Inflammatory Markers in Obstructive Sleep Apnea: A Meta-Analysis 10.5664/jcsm.3070 135 373 36.19 13.71 6.49 6 Ryan S 26 2006 Am J Resp Crit Care Predictors of Elevated Nuclear Factor-κB–dependent Genes in Obstructive Sleep Apnea Syndrome 10.1164/rccm.200601–066OC 130 283 45.94 4.82 1.57 7 McNicholas WT 27 2007 Eur Respir J Sleep apnoea as an independent risk factor for cardiovascular disease: current evidence, basic mechanisms and research priorities 10.1183/09031936.00027406 104 705 14.75 5.79 7.85 8 Ohga E 28 2003 J Appl Physiol Effects of obstructive sleep apnea on circulating ICAM-1, IL-8, and MCP-1 10.1152/japplphysiol.00177.2002 101 263 38.40 1.22 0.71 9 Jelic S 29 2008 Circulation Inflammation, Oxidative Stress, and Repair Capacity of the Vascular Endothelium in Obstructive Sleep Apnea 10.1161/CIRCULATIONAHA.107.741512 96 458 20.96 5.22 5.30 10 Ciftci TU 30 2004 Cytokine The relationship between serum cytokine levels with obesity and obstructive sleep apnea syndrome 10.1016/j.cyto.2004.07.003 92 232 39.66 3.64 2.44 Abbreviations Figure 5 Analysis of Journals and Citation Networks Related to Inflammation in Obstructive Sleep Apneas. ( A B C D E Highly Cited Studies and Thematic Clustering In total, the dataset includes 2,075 documents and 71,34 references ( Supplementary Table 2 Table 3 9 22 23 24 Figure 6A Figures 6A Figure 6 Reference Co-citation Analysis and Citation Burst Detection on Inflammation in Obstructive Sleep Apnea. ( A B Figure 6B 5 31 32 Keyword Co-Occurrence and Research Themes The keyword analysis reveals significant trends and focal points in OSA research. Specifically, we identified 3,894 Keywords plus alongside 3,250 author keywords, enhancing the effective indexing and retrieval of scholarly content ( Supplementary Table 2 Figure 7A Figure 7B Figure 7A Figure 7C Figure 7C Figure 7C Figure 7C Figure 7C Figure 7C Figure 7 Keywords Mapping of Inflammation in Obstructive Sleep Apneas. ( A B C “Hypertension” (73 occurrences, total link strength = 216), “atherosclerosis” (58 occurrences, total link strength = 163), “endothelial dysfunction” (27 occurrences, total link strength = 81), “atrial fibrillation” (21 occurrences, total link strength =60), “stroke” (17 occurrences, total link strength = 53), “coronary artery disease” (10 occurrences, total link strength = 38) suggest a close association between OSA and “cardiovascular disease” (95 occurrences, total link strength = 256) ( Figure 7C “Excessive daytime sleepiness” (11 occurrences, total link strength = 34), “insomnia” (14 occurrences, total link strength = 39) and “sleep disorders” ( Figure 7C Figure 7C Research on OSA is expanding into multidisciplinary fields, with a potential association between OSA and “Alzheimer’s disease” (12 occurrences, total link strength = 26), “cancer” (9 occurrences, total link strength = 30), “gut microbiota” (17 occurrences, total link strength = 37) ( Figure 7C Figure 7C In conclusion, the keyword analysis highlights that research on OSA and inflammation spans mechanisms, comorbidities, and treatments, while also expanding into emerging multidisciplinary domains, thereby underscoring its growing clinical and scientific relevance. Discussion The incidence and prevalence of OSA have increased substantially worldwide, posing a growing burden on healthcare systems and raising significant public health concerns. In this study, we conducted the first comprehensive bibliometric analysis of research on OSA-related inflammation. This bibliometric analysis is not intended to replace systematic reviews or mechanistic studies, but rather to provide a complementary perspective by mapping the knowledge structure and identifying underexplored research areas. Our results provide an integrated overview of publication trends, international collaborations, influential authors and institutions, landmark studies, and emerging research themes. Beyond presenting novel bibliometric patterns, these findings offer relevant insights into how the field has evolved, the intellectual structure that underpins it, and the potential directions for future exploration. Such insights are particularly valuable for guiding new research initiatives, fostering cross-disciplinary collaborations, and identifying underexplored areas with clinical and translational importance. Placing these bibliometric findings into the clinical context is essential for understanding their significance. The increasing recognition of inflammation as a central mechanism in OSA pathophysiology helps explain why this research domain has become a sustained hotspot, bridging basic science with clinical practice. Current management strategies for OSA primarily aim to alleviate symptoms, with CPAP therapy being the most widely used intervention to mitigate the effects of intermittent hypoxia. Although such treatments improve sleep quality and provide short-term relief, they do not address the underlying inflammatory processes associated with OSA. As the link between OSA and systemic inflammation becomes clearer, there is growing interest in the role of inflammatory pathways in disease progression. In particular, the release of pro-inflammatory cytokines in response to hypoxic episodes is increasingly recognized as a central factor contributing to the long-term cardiovascular and metabolic complications observed in OSA patients. Understanding this intricate relationship between OSA and inflammation may pave the way for novel therapeutic strategies that target inflammatory mechanisms, potentially reducing the broader health impacts of OSA. Research Highlights The results of keyword and reference clustering analysis highlight the primary areas of interest for researchers. Combining these findings with our understanding of the field, we succinctly summarize several major research hotspots, including mechanism, comorbidities and treatment. Mechanism OSA is increasingly recognized as a systemic disorder linked to chronic inflammation and oxidative stress, with profound implications for both peripheral and central nervous system (CNS) health. The intermittent hypoxia caused by OSA activates various inflammatory pathways, primarily through the upregulation of nuclear factor kappa-B (NF-κB), which subsequently enhances the production of pro-inflammatory cytokines such as IL-6, IL-8, and TNF-α. 33 34 35 36 37 38 A particularly important aspect of OSA’s neurobiological impact is its influence on microglial activation within the CNS. The blood-brain barrier (BBB), a vital protective structure, was once thought to shield the brain from peripheral inflammation and playing a crucial role in maintaining brain homeostasis. 39 40 41 42 43 44 45 In conclusion, the complex interplay between OSA, systemic inflammation, and neuroinflammation, with microglia as central mediators, underscores the necessity of addressing these pathways in OSA management. Given the complexity of this network, further research into therapeutic strategies targeting inflammation and microglial activation may offer potential to alleviate the broader health risks associated with OSA. Comorbidities First, OSA and metabolic syndrome exhibit a strong interrelationship, where OSA may worsen the key components of metabolic syndrome, including obesity, insulin resistance, and dyslipidemia. The intermittent hypoxia and disrupted sleep patterns inherent in OSA may trigger an elevation in sympathetic nervous system activity and systemic inflammation, thereby further disrupting metabolic processes. Conversely, the presence of metabolic syndrome can exacerbate the occurrence and severity of OSA, resulting in a bidirectional interaction that complicates the clinical management and treatment of both disorders. Patients with obesity hypoventilation syndrome, a form of OSA, show significantly higher rates of metabolic syndrome, as evidenced by increased waist circumference and triglyceride levels, suggesting a strong association between the two conditions. 46 47 48 49 Second, OSA is closely associated with cardiovascular disease (CVD), primarily through inflammatory mechanisms. Patients with OSA often present with elevated pulse wave velocity, a marker linked to increased all-cause and cardiovascular mortality, highlighting the significant cardiovascular risks posed by this condition. 50 51 52 53 54 55 56 Additionally, OSA is increasingly recognized for its complex interplay with systemic inflammation and comorbid respiratory diseases, particularly asthma and allergic rhinitis. Studies have demonstrated a significantly higher prevalence of asthma among individuals with OSA, suggesting a meaningful association between the two conditions. 57 58 37 59 60 61 What’s more, OSA has emerged as a notable risk factor for the development and progression of several neurodegenerative diseases, most prominently AD. The hallmark feature of OSA—CIH—is strongly associated with enhanced neuroinflammatory responses, which are increasingly recognized as central to the pathophysiology of cognitive decline and AD. Experimental and clinical studies have demonstrated that CIH leads to upregulation of pro-inflammatory cytokines and elevated oxidative stress levels, both of which contribute to neuronal injury and impaired cognitive performance. 62 63 64 65 66 67 Treatment CPAP therapy, a common treatment for OSA, has been shown to significantly reduce inflammatory markers, indicating its role in mitigating inflammation associated with OSA. 38 68 69 70 71 72 53 Future Research Directions OSA has been increasingly recognized for its complex interactions with systemic and neuroinflammation, which play a crucial role in the pathogenesis of various comorbidities associated with OSA. As research in this field continues to evolve, there is growing interest in understanding how OSA-induced inflammation contributes to disease progression and the development of long-term health complications. Our findings suggest that investigating the molecular pathways through which OSA triggers inflammatory responses, and how these pathways affect various organs, could provide novel insights into potential therapeutic strategies. Future research should focus on identifying specific biomarkers and therapeutic targets within inflammatory pathways that are activated by OSA, which may lead to the development of more effective interventions for mitigating inflammation and preventing the chronic effects of OSA. Additionally, exploring the potential of anti-inflammatory treatments as adjuncts to existing OSA therapies could open new avenues for improving patient outcomes and reducing associated health risks. Biomarker Discovery Research should focus on identifying reliable biomarkers to improve early diagnosis, patient stratification, and treatment monitoring. The discovery of these biomarkers is gaining increasing attention, as recent studies suggest that these markers may not only improve the diagnosis of OSA but also provide deeper insights into its underlying mechanisms. For instance, Galectin-3 has been identified as a potential biomarker for sleep health, underscoring the role of inflammatory pathways in OSA. 73 74 75 76 77 78 Neuroinflammation-Targeted Therapy Targeted therapeutic approaches that modulate neuroinflammation and microglial activity hold promise for improving cognitive function and mitigating long-term neurological complications in OSA. Ongoing research into neuroinflammation-targeted interventions seeks to address the underlying biological mechanisms, offering potential strategies to complement existing OSA treatments and reduce its neurocognitive burden. IH has been shown to elevate inflammatory markers and induce cognitive impairment. 79 80 81 82 Limitations The analysis of inflammation in OSA presents several notable advantages. First, it is a groundbreaking attempt to systematically examine the research landscape of inflammation in OSA through bibliometric methods, facilitating a quantitative assessment of the field’s development. The study’s extensive coverage of OSA literature offers a well-rounded view of the subject. By utilizing various bibliometric tools, it delivers an in-depth understanding of the research landscape, highlighting key contributors, thematic trends, and existing gaps. The incorporation of software such as VOSviewer and CiteSpace bolsters the objectivity and reproducibility of the analysis, establishing a solid foundation for guiding future research. Nevertheless, the study has limitations that should be recognized. A major concern is the potential bias from the choice of specific databases. Solely relying on sources like WoSCC may result in the omission of relevant studies indexed in other databases such as PubMed, Scopus, or the Cochrane Library. Additionally, the emphasis on English-language publications might lead to an underrepresentation of research conducted in other languages, distorting the understanding of the global OSA research landscape. Data consistency issues, including discrepancies in author names or institutional affiliations, could also compromise the accuracy of the analysis. Lastly, the coverage may not encompass the latest research due to the delay between data collection and publication. Conclusion Our study highlights the remarkable progress that has been made in understanding inflammation in OSA, underscoring the importance of international collaboration, the contributions of leading institutions and scholars, the influence of high-impact journals, and the evolution of research priorities. Future work should focus on elucidating the molecular mechanisms underlying OSA, improving the management of comorbidities, and developing novel therapeutic strategies. These advances will require sustained interdisciplinary collaboration among clinicians in sleep medicine, cardiology, and neurology, together with basic scientists, public health professionals, and data scientists. Equally crucial is the effective translation of research findings into clinical practice to enhance diagnostic approaches, refine therapeutic interventions, and ultimately improve long-term outcomes for patients with OSA. Acknowledgments The authors would like to thank the editors and the anonymous reviewers for their valuable comments and suggestions to improve the quality of the paper. Abbreviations OSA, Obstructive Sleep Apnea; WoSCC, Web of Science Core Collection; INSERM, Institut National De La Sante Et De La Recherche Medicale; CPAP, Continuous Positive Airway Pressure; OSAS, Obstructive Sleep Apnea Syndrome; TNF-α, Tumor Necrosis Factor-alpha; IL-6, Interleukin-6; CRP, C-reactive protein; TI, Title; AB, Abstract; AK, Author Keywords; OALM, Online Analysis Platform of Literature Metrology; NC, Number of Citations; NP, Number of Publications; SCP, Single-country Publications; MCP, Multiple-country Publications;; IH, Intermittent Hypoxia; NF-κB, Nuclear Factor Kappa-B; IL-8, Interleukin-8; BBB, Blood-brain Barrier; CNS, Central Nervous System; CIH, Chronic Intermittent Hypoxia; AD, Alzheimer’s Disease; T2DM, Type 2 Diabetes Mellitus; CVD, Cardiovascular Disease; COPD, Chronic Obstructive Pulmonary Disease; AHI, Apnea-hypopnea Index; ncRNAs, Non-coding RNAs; MMP9, Matrix Metalloproteinase-9; ox-LDL, Oxidized Low-Density Lipoprotein; GLP-1R, Glucagon-Like Peptide-1 Receptor; Nrf2, Nuclear Factor Erythroid 2-Related Factor 2; HO-1, Heme Oxygenase-1; MAPK, Mitogen-Activated Protein Kinase. Data Sharing Statement The request for original data that support this paper’s conclusions can be directed to the corresponding authors. Author Contributions Haixia Fan: Writing – Review & Editing, Writing – Original Draft Preparation, Conceptualization, Supervision, Formal Analysis. Huiyan Niu: Writing – Review & Editing, Writing – Original Draft Preparation, Conceptualization, Formal Analysis. Bomeng Zhao: Writing – Review & Editing, Writing – Original Draft Preparation, Formal Analysis. Xiaoling Gao: Writing – Review & Editing, Conceptualization, Data curation, Methodology, Funding Acquisition, Supervision, Project Administration. All authors gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure There are no disclosed conflicts of interest for the authors. References 1. Jordan AS McSharry DG Malhotra A Adult obstructive sleep apnoea Lancet 2014 383 9918 736 747 10.1016/s0140-6736(13)60734-5 23910433 PMC3909558 2. Bickelmann AG Burwell CS Robin ED Whaley RD Extreme obesity associated with alveolar hypoventilation; a Pickwickian syndrome Am J Med 1956 21 5 811 818 10.1016/0002-9343(56)90094-8 13362309 3. Dempsey JA Veasey SC Morgan BJ O’Donnell CP Pathophysiology of sleep apnea Physiol Rev 2010 90 1 47 112 10.1152/physrev.00043.2008 20086074 PMC3970937 4. Sullivan CE Issa FG Berthon-Jones M Eves L Reversal of obstructive sleep apnoea by continuous positive airway pressure applied through the nares Lancet 1981 1 8225 862 865 10.1016/s0140-6736(81)92140-1 6112294 5. Benjafield AV Ayas NT Eastwood PR Estimation of the global prevalence and burden of obstructive sleep apnoea: a literature-based analysis Lancet Respir Med 2019 7 8 687 698 10.1016/s2213-2600(19)30198-5 31300334 PMC7007763 6. Marin JM Carrizo SJ Vicente E Agusti AG Long-term cardiovascular outcomes in men with obstructive sleep apnoea-hypopnoea with or without treatment with continuous positive airway pressure: an observational study Lancet 2005 365 9464 1046 1053 10.1016/s0140-6736(05)71141-7 15781100 7. Kheirandish-Gozal L Gozal D Obstructive Sleep Apnea and Inflammation: proof of Concept Based on Two Illustrative Cytokines Int J Mol Sci 2019 20 3 459 10.3390/ijms20030459 30678164 PMC6387387 8. Vgontzas AN Papanicolaou DA Bixler EO Kales A Tyson K Chrousos GP Elevation of plasma cytokines in disorders of excessive daytime sleepiness: role of sleep disturbance and obesity J Clin Endocrinol Metab 1997 82 5 1313 1316 10.1210/jcem.82.5.3950 9141509 9. Yokoe T Minoguchi K Matsuo H Elevated levels of C-reactive protein and interleukin-6 in patients with obstructive sleep apnea syndrome are decreased by nasal continuous positive airway pressure Circulation 2003 107 8 1129 1134 10.1161/01.cir.0000052627.99976.18 12615790 10. Marginson S Global science and national comparisons: beyond bibliometrics and scientometrics Article Comp Educ 2022 58 2 125 146 10.1080/03050068.2021.1981725 11. McBurney MK Novak PL What is bibliometrics and why should you care? IEEE 2002 2022 108 114 12. Adams J Bibliometrics: the citation game Nature 2014 510 7506 470 471 10.1038/510470a 13. AlRyalat SAS Malkawi LW Momani SM Comparing Bibliometric Analysis Using PubMed, Scopus, and Web of Science Databases J Visualized Exp 2019 152 e58494 10.3791/58494 31710021 14. Wang H Chen Y Gou Y Yang D Xiong L Chronic kidney diseases and inflammation research: a bibliometric analysis Front Med 2024 11 1388665 10.3389/fmed.2024.1388665 PMC11449749 39371339 15. Dong J Yu X Wang Y Zhang H Guo R Obstructive sleep apnea and cognition: insights gleaned from bibliometric analysis Front Psychiatry 2023 14 1259251 10.3389/fpsyt.2023.1259251 37840801 PMC10570730 16. Niu Y Cai H Zhou W Research trends in hypertension associated with obstructive sleep apnea: a bibliometric analysis Sleep Breathing 2023 27 2 411 419 10.1007/s11325-022-02637-8 35579792 17. Chen CM CiteSpace II: detecting and visualizing emerging trends and transient patterns in scientific literature Article J Am Soc Inf Sci Technol 2006 57 3 359 377 10.1002/asi.20317 18. Arruda H Silva ER Lessa M Proença Jr D Bartholo R VOSviewer and Bibliometrix J Med Library Assoc 2022 110 3 392 395 10.5195/jmla.2022.1434 PMC9782747 36589296 19. Egghe L Theory and practise of the g-index. Article Scientometrics 2006 69 1 131 152 10.1007/s11192-006-0144-7 20. Hirsch JE An index to quantify an individual’s scientific research output. Article Proc Natl Acad Sci U S A 2005 102 46 16569 16572 10.1073/pnas.0507655102 16275915 PMC1283832 21. Aria M Cuccurullo C bibliometrix: an R-tool for comprehensive science mapping analysis Article J Informetr 2017 11 4 959 975 10.1016/j.joi.2017.08.007 22. Ryan S Taylor CT McNicholas WT Selective activation of inflammatory pathways by intermittent hypoxia in obstructive sleep apnea syndrome Circulation 2005 112 17 2660 2667 10.1161/circulationaha.105.556746 16246965 23. Shamsuzzaman AS Winnicki M Lanfranchi P Elevated C-reactive protein in patients with obstructive sleep apnea Circulation 2002 105 21 2462 2464 10.1161/01.cir.0000018948.95175.03 12034649 24. Lavie L Obstructive sleep apnoea syndrome--an oxidative stress disorder Sleep Med Rev 2003 7 1 35 51 10.1053/smrv.2002.0261 12586529 25. Nadeem R Molnar J Madbouly EM Serum inflammatory markers in obstructive sleep apnea: a meta-analysis J Clin Sleep Med 2013 9 10 1003 1012 10.5664/jcsm.3070 24127144 PMC3778171 26. Ryan S Taylor CT McNicholas WT Predictors of elevated nuclear factor-kappaB-dependent genes in obstructive sleep apnea syndrome Am J Respir Crit Care Med 2006 174 7 824 830 10.1164/rccm.200601-066OC 16840748 27. McNicholas WT Bonsigore MR Management Committee of EU COST ACTION B26. Sleep apnoea as an independent risk factor for cardiovascular disease: current evidence, basic mechanisms and research priorities Eur Respir J 2007 29 1 156 178 10.1183/09031936.00027406 17197482 28. Ohga E Tomita T Wada H Yamamoto H Nagase T Ouchi Y Effects of obstructive sleep apnea on circulating ICAM-1, IL-8, and MCP-1 J Appl Physiol 2003 94 1 179 184 10.1152/japplphysiol.00177.2002 12391099 29. Jelic S Padeletti M Kawut SM Inflammation, oxidative stress, and repair capacity of the vascular endothelium in obstructive sleep apnea Circulation 2008 117 17 2270 2278 10.1161/CIRCULATIONAHA.107.741512 18413499 PMC2844329 30. Ciftci TU Kokturk O Bukan N Bilgihan A The relationship between serum cytokine levels with obesity and obstructive sleep apnea syndrome Cytokine 2004 28 2 87 91 10.1016/j.cyto.2004.07.003 15381186 31. Yeghiazarians Y Jneid H Tietjens JR Obstructive Sleep Apnea and Cardiovascular Disease: a Scientific Statement From the American Heart Association Circulation 2021 144 3 e56 e67 10.1161/cir.0000000000000988 34148375 32. Gottlieb DJ Punjabi NM Diagnosis and Management of Obstructive Sleep Apnea: a Review JAMA 2020 323 14 1389 1400 10.1001/jama.2020.3514 32286648 33. Wang YG Lin C Huang M Fang XL Chen GH Ye SN Overexpression of YKL40, IL-6, IL-8, TNF-α in tonsils and the role of YKL40 in childhood with obstructive sleep apnea syndrome Sci Rep 2024 14 1 26283 10.1038/s41598-024-74402-8 39487152 PMC11530617 34. Yamauchi M Kimura H Oxidative stress in obstructive sleep apnea: putative pathways to the cardiovascular complications Antioxid. Redox Signal 2008 10 4 755 768 10.1089/ars.2007.1946 18177236 35. Eldin MS Alahmer M Alkashlan E Alterations in Inflammatory Markers and Cognitive Ability after Treatment of Pediatric Obstructive Sleep Apnea Medicina 2023 59 2 204 10.3390/medicina59020204 36837406 PMC9968190 36. He H Zhou Z Zhang L Lu Z Li B Li X HIF1α/MIF/CD74 signaling mediated OSA-induced atrial fibrillation by promoting M1 macrophages polarization Int Immunopharmacol 2025 149 114248 10.1016/j.intimp.2025.114248 39929098 37. Zirih T Ozergin Coskun Z Şahin Ü Pan Immune Inflammation Index: a New Biomarker for Diagnosis and Monitoring of Obstructive Sleep Apnea J Craniofacial Surg 2025 10.1097/scs.0000000000011544 40512173 38. Zhu Q Luo Q Wang Z Chen S Chen G Huang S Effects of continuous positive airway pressure therapy on inflammatory markers in patients with obstructive sleep apnea: a meta-analysis of randomized controlled trials Sleep Breathing 2025 29 2 182 10.1007/s11325-025-03348-6 40346316 PMC12064446 39. Abdullahi W Tripathi D Ronaldson PT Blood-brain barrier dysfunction in ischemic stroke: targeting tight junctions and transporters for vascular protection Am J Physiol Cell Physiol 2018 315 3 C343 c356 10.1152/ajpcell.00095.2018 29949404 PMC6171039 40. Louveau A Smirnov I Keyes TJ Structural and functional features of central nervous system lymphatic vessels Nature 2015 523 7560 337 341 10.1038/nature14432 26030524 PMC4506234 41. Riedel B Browne K Silbert B Cerebral protection: inflammation, endothelial dysfunction, and postoperative cognitive dysfunction Current Opinion Anaesthesiol 2014 27 1 89 97 10.1097/aco.0000000000000032 24300462 42. Kong Y Ji J Zhan X Tet1-mediated 5hmC regulates hippocampal neuroinflammation via wnt signaling as a novel mechanism in obstructive sleep apnoea leads to cognitive deficit J Neuroinflam 2024 21 1 208 10.1186/s12974-024-03189-2 PMC11340128 39169375 43. Marino KM Ewald AC Lash JN Chronic intermittent hypoxia exposure induces a unique microglial transcriptome in 5XFAD mice Res Square 2025 10.21203/rs.3.rs-6203482/v1 44. Hansen DV Hanson JE Sheng M Microglia in Alzheimer’s disease J Cell Biol 2018 217 2 459 472 10.1083/jcb.201709069 29196460 PMC5800817 45. AmeliMojarad M AmeliMojarad M The neuroinflammatory role of microglia in Alzheimer’s disease and their associated therapeutic targets CNS Neurosci Ther 2024 30 7 e14856 10.1111/cns.14856 39031970 PMC11259573 46. Çiftçioğlu U Kerget B Akgün M Differential diagnosis of chronic obstructive pulmonary disease and obesity hypoventilation syndrome in patients presenting with hypercapnic respiratory failure Sleep Breathing 2025 29 3 201 10.1007/s11325-025-03367-3 40448870 47. Punjabi NM Shahar E Redline S Gottlieb DJ Givelber R Resnick HE Sleep-disordered breathing, glucose intolerance, and insulin resistance: the Sleep Heart Health Study Am J Eepidemiol 2004 160 6 521 530 10.1093/aje/kwh261 15353412 48. Togeiro SM Carneiro G Ribeiro Filho FF Consequences of obstructive sleep apnea on metabolic profile: a Population-Based Survey Obesity 2013 21 4 847 851 10.1002/oby.20288 23712988 49. Kraiwattanapong J Rattanaarun K Cunteerasup A Papassornsiri T Balankura T Pavarajarn S Clinical characteristics and treatment preferences of obstructive sleep apnea Sci Rep 2025 15 1 18976 10.1038/s41598-025-03816-9 40447677 PMC12125185 50. Lin H Zheng H Lin T Chen L Association of estimated pulse wave velocity with all-cause mortality and cardiovascular mortality in obstructive sleep apnea patients: results from NHANES Front Cardiovasc Med 2025 12 1571610 10.3389/fcvm.2025.1571610 40574813 PMC12198205 51. Pei C Ding Z Hu L Gui S Prediction of early myocardial damage in obstructive sleep apnea patients using combined logistic regression and QUEST decision tree models Braz J Med Biol Res 2025 58 e14757 10.1590/1414-431X2025e14757 40561277 PMC12184961 52. Xia B Peng J Ding J ATF3 regulates inflammatory response in atherosclerotic plaques in mice through the NF-κB signaling pathway]. Nan fang yi ke da xue xue bao = J Southern Med Univ 2025 45 6 1131 1142 10.12122/j.issn.1673-4254.2025.06.03 PMC12204839 40579127 53. Hassan MG Hassan DG Hassan GA Tirzepatide gains US Food and Drug Administration approval for the management of obstructive sleep apnea: implications for oral health care providers J Am Dental Assoc 2025 156 8 620 625 10.1016/j.adaj.2025.05.007 40569229 54. Zhou L Ye P Wang Y Exploring the potential biomarkers between stroke and obstructive sleep apnea by WGCNA and machine learning Sleep Breathing 2025 29 4 219 10.1007/s11325-025-03369-1 40540134 55. Ding R Ren X Sun Q Air Pollution and Stroke: an Emerging Challenge From Cardio-Cerebrovascular Multimorbidity J Am Heart Assoc 2025 14 13 e041848 10.1161/jaha.124.041848 40576036 PMC12449924 56. Gu Y Sun Z Li T Ding X Huanglian Jiedu Decoction Treats Ischemic Stroke by Regulating Pyroptosis: insights from Multi-Omics and Drug-Target Relationship Analysis Pharmaceuticals 2025 18 6 775 10.3390/ph18060775 40573172 PMC12195757 57. Hand C Bohn C Angotti M Eilen H Varano M Forsythe B Effects of obstructive sleep apnea on postoperative outcomes following total shoulder arthroplasty: a matched cohort analysis J Orthopaedics 2025 64 163 168 10.1016/j.jor.2025.04.009 40352781 PMC12059591 58. Valcovici M Iacob MS Sharma A The Junction of Allergic Inflammation and Atherosclerosis: pathways and Clinical Implications-A Review Life 2025 15 6 964 10.3390/life15060964 40566616 PMC12194581 59. Prakash V Kumar A Saini LK Proportion of sleep-related breathing disorders and their association with echocardiographic parameters in stable patients with chronic obstructive pulmonary disease: a cross-sectional observational exploratory study Monaldi Arch Chest Disease 2024 10.4081/monaldi.2024.2815 40497501 60. Rus LA Popețiu RO Borta SM Lower Vitamin D During Acute Exacerbation Is Associated with Very Severe Chronic Obstructive Pulmonary Disease Medicina 2025 61 6 979 10.3390/medicina61060979 40572667 PMC12194935 61. Subedi S Guntipally M Suwal N Cellular senescence in chronic obstructive pulmonary disease: molecular mechanisms and therapeutic interventions Ageing Res Rev 2025 110 102813 10.1016/j.arr.2025.102813 40571131 62. Cheung EC Escobar JB Alber BR Chronic intermittent hypoxia-mediated cognitive dysfunction in ovariectomized rats Exp Physiol 2025 110 8 1154 1163 10.1113/ep092018 40388406 PMC12314638 63. Durak B Özol D İ D Saraç S Is β- amyloid a reliable marker for assessing neurocognitive functions in middle-aged OSAS patients? Sleep Breathing 2025 29 2 185 10.1007/s11325-025-03353-9 40366510 64. Gupta MA Simpson FC Obstructive sleep apnea and psychiatric disorders: a systematic review JCSM 2015 11 2 165 175 10.5664/jcsm.4466 25406268 PMC4298774 65. Liu X Wang H Tian X Depression exacerbates AD pathology through lactate-dependent activation of microglial Kv1.3 to promote Aβ-containing exosome spreading J Neuroinflam 2025 22 1 166 10.1186/s12974-025-03488-2 PMC12205523 40579730 66. Majid H Islam SU Kohli S Nidhi Neuroinflammation and metabolic dysregulation as predictors of cognitive impairment, depression, and quality of life in type 2 diabetes mellitus patients on SGLT2 inhibitors and sulfonylureas Inflammopharmacol 2025 33 8 4749 4758 10.1007/s10787-025-01824-9 40576744 67. Soltaninejad F Golastaneh R Ghahfarokhi PI Salmasi M Amra B Continuous positive airway pressure treatment for sleep apnea in elderly patients systematic review and meta-analysis Sleep Breathing 2025 29 3 210 10.1007/s11325-025-03362-8 40493304 68. Huang CG Hsu JF Chuang LP Adenotonsillectomy-related changes in systemic inflammation among children with obstructive sleep apnea J Chin Med Assoc 2023 86 6 596 605 10.1097/jcma.0000000000000921 36989493 69. Archontogeorgis K Nena E Steiropoulos P Roles of vitamins and nutrition in obstructive sleep apnea Expert Rev Resp Med 2025 19 2 145 163 10.1080/17476348.2025.2462192 39891370 70. Kim AR Jeon SG Park SJ Alleviation of Adipose Tissue Inflammation and Obesity Suppression by a Probiotic Strain That Induces GLP-1 Secretion Microorganisms 2025 13 6 1211 10.3390/microorganisms13061211 40572100 PMC12195054 71. Bernard A Richard C Radoi L Boidot R Ledoux S Besnard P Fat taste sensitivity in women with obesity: transcriptomic analysis of fungiform papillae before and after bariatric surgery Obesity 2025 33 8 1518 1528 10.1002/oby.24325 40545805 PMC12304824 72. Ismael S Umar M Ouvrier B SARS-CoV-2 (MA10) Infection Aggravates Cerebrovascular Pathology in Endothelial Nitric Oxide Synthase-Deficient Mice Viruses 2025 17 6 784 10.3390/v17060784 40573374 PMC12197800 73. Andersen ML Moyses-Oliveira M Tufik S Unlocking the role of Galectin-3: implications for sleep disorders and health Sleep Med 2024 124 110 114 10.1016/j.sleep.2024.09.016 39288581 74. Sun X Wang C He Y Chen K Miao Y Effect of inflammatory cytokines and plasma metabolome on OSA: a bidirectional two- sample Mendelian randomization study and mediation analysis Front Immunol 2024 15 1416870 10.3389/fimmu.2024.1416870 39351220 PMC11439640 75. Li B Wang L Du M He H FTO in oral diseases: functions, mechanisms, and therapeutic potential FASEB J 2024 38 20 e70115 10.1096/fj.202401406RR 39436191 76. Li J Sun L Zhao Y Advances in non-coding RNA as a biomarker for obstructive sleep apnoea hypoventilation syndrome Sleep Breathing 2024 28 5 1899 1908 10.1007/s11325-024-03109-x 39017902 77. Nathalie P Pauline G Chloe M A pilot study on the effect of severe sleep fragmentation on aorta remodelling, neuroinflammation in a rat model Sci Rep 2025 15 1 27250 10.1038/s41598-025-10721-8 40715272 PMC12297472 78. Hao J Zhao Y Wang Z Circulating CHI3L1 autoantibodies serve as a diagnostic biomarker in patients with obstructive sleep apnea Sci Rep 2025 15 1 27087 10.1038/s41598-025-11537-2 40715195 PMC12297705 79. Puech C Badran M Barrow MB Gozal D Cognitive Function, Sleep, and Neuroinflammatory Markers in Mice Exposed to Very Long-Term Intermittent Hypoxia Int J Mol Sci 2025 26 5 1815 10.3390/ijms26051815 40076441 PMC11899729 80. Wei RM Zhang MY Fang SK Melatonin attenuates intermittent hypoxia-induced cognitive impairment in aged mice: the role of inflammation and synaptic plasticity Psychoneuroendocrinology 2025 171 107210 10.1016/j.psyneuen.2024.107210 39378690 81. Lv R Zhao Y Wang X GLP-1 analogue liraglutide attenuates CIH-induced cognitive deficits by inhibiting oxidative stress, neuroinflammation, and apoptosis via the Nrf2/HO-1 and MAPK/NF-κB signaling pathways Int Immunopharmacol 2024 142 Pt B 113222 10.1016/j.intimp.2024.113222 39321702 82. Altuna M García-Sebastián M Ecay-Torres M Prevalence and Misperception: exploring the Gap Between Objective and Subjective Assessment of Sleep Apnea in a Population at Increased Risk for Dementia J Clin Med 2025 14 8 2607 10.3390/jcm14082607 40283437 PMC12027575 ",
  "metadata": {
    "Title of this paper": "Prevalence and Misperception: exploring the Gap Between Objective and Subjective Assessment of Sleep Apnea in a Population at Increased Risk for Dementia",
    "Journal it was published in:": "Nature and Science of Sleep",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467178/"
  }
}