{
  "title": "Paper_417",
  "abstract": "pmc RMD Open RMD Open 2836 rmdopen rmdopen RMD Open 2056-5933 BMJ Publishing Group PMC12481393 PMC12481393.1 12481393 12481393 40998522 10.1136/rmdopen-2025-005941 rmdopen-2025-005941 1 Original Research Osteoporosis 1506 METHOFRACT, a methotrexate osteopathy multicentre cohort study https://orcid.org/0000-0001-5134-8160 Robin François 1 2 Ghossan Roba 3 Mehsen-Cetre Nadia 4 Triquet Louise 5 https://orcid.org/0000-0003-2317-2852 Larid Guillaume 6 Coiffier Guillaume 7 Mina Marine 8 Pickering Marie Eva 9 Barthe Claire 10 Paccou Julien 10 Herman Julien 11 https://orcid.org/0000-0002-4842-8618 Massy Emmanuel 12 Roitg Isabelle 13 Branquet Martine 14 Lasnier Siron Julien 14 Guillouard Manon 15 Desmonet Trousset Camille 16 Aubrun Aurore 8 Godfrin Bertrand 8 Hauzeur Jean-Philippe 8 Chatelus Emmanuel 17 Koumakis Eugénie 18 Legrand Jean-Louis 4 Schaeverbeke Thierry 4 https://orcid.org/0009-0001-2983-0628 Leloix Alexia 12 Masson Maeva 19 Nicolau Julia 16 Ghiringhelli Charles 13 Decrock Marijke 13 Durel Cécile-Audrey 20 Bouvard Béatrice 1 Cortet Bernard 10 Casadepax-Soulet Charlotte 1 Malaise Olivier 8 Javier Rose-Marie 17 https://orcid.org/0000-0002-6238-2601 Briot Karine 3 Guggenbuhl Pascal 1 2 1 Univ Rennes, INSERM, INRAE, CHU Rennes, UMR 1317 1341, Institut NuMeCan (Nutrition Metabolisms and Cancer) Rennes France 2 Rheumatology department Rennes University Hospital Rennes France 3 Paris Cité and Sorbonne Paris Nord University, Inserm, INRAe, Centre for Research in Epidemiology and Statistics (CRESS) Paris France 4 Rheumatology Department Centre hospitalier universitaire Bordeaux, Groupe hospitalier Pellegrin Bordeaux France 5 Regional Center of Pharmacovigilance Pharmacoepidemiology and Drug Information – CHU Rennes Rennes France 6 University of Poitiers, LITEC laboratory, Rheumatology Department, CHU Poitiers Poitiers France 7 Rheumatology department CH Dinan Dinan France 8 University of Liège, Rheumatology department, CHU Sart Tilman, Liège ; Centre de Rhumatologie et de médecine sportive Brussels Belgium 9 Rheumatology department, CHU Gabriel-Montpied Clermont-Ferrand France 10 Service de Rhumatologie CHU Lille et Université de Lille Lille France 11 Service de Rhumatologie, CH la Roche-sur-Yon la Roche-sur-Yon France 12 Université de Lyon, France, Centre Expert des Métastases Osseuses (CEMOS) - Service de Rhumatologie, Centre Hospitalier Lyon-Sud, Hospices Civils de Lyon Pierre-Bénite France 13 Service de rhumatologie, CH Perpignan Perpignan France 14 University Hospital of Bordeaux, Pellegrin Hospital Group, Rheumatology Department Bordeaux France 15 Service de Rhumatologie, CH Aurillac Aurillac France 16 Hôpital de Dieppe, Service de Rhumatologie Dieppe France 17 Service de Rhumatologie, Hôpitaux Universitaires de Strasbourg Strasbourg France 18 Rheumatology Department, Cochin Hospital AP-HP Centre-Paris University; Reference Center for Rare Genetic Bone Disorders-Cochin-constitutive site, Cochin Hospital; Paris Cité University, INSERM UMR 1163, Imagine Institute Paris France 19 Rheumatology Center, Toulouse University Hospital, Toulouse, France/ INFINITY, Toulouse Institute for Infectious and Inflammatory Diseases, INSERM U1291, CNRS U5051, Toulouse University, Inserm Toulouse France 20 Service de médecine interne, Hôpital Saint Joseph Saint Luc, 20 quai Claude Bernard, Lyon cedex Univ Angers, Nantes université, ONIRIS, Inserm, RMeSUMR, Angers, France22 Service de Rhumatologie, Centre Hospitalier Ouest Réunion Lyon France Supplemental material This content has been supplied by the author(s). It has not been vetted by BMJ Publishing Group Limited (BMJ) and may not have been peer-reviewed. Any opinions or recommendations discussed are solely those of the author(s) and are not endorsed by BMJ. BMJ disclaims all liability and responsibility arising from any reliance placed on the content. Where the content includes any translated material, BMJ does not warrant the accuracy and reliability of the translations (including but not limited to local regulations, clinical guidelines, terminology, drug names and drug dosages), and is not responsible for any error and/or omissions arising from translation and adaptation or otherwise. Additional supplemental material is published online only. To view, please visit the journal online ( https://doi.org/10.1136/rmdopen-2025-005941 None declared. Dr François Robin; francois.robin@chu-rennes.fr 2025 25 9 2025 11 3 492039 e005941 30 5 2025 02 9 2025 25 09 2025 01 10 2025 01 10 2025 Copyright © Author(s) (or their employer(s)) 2025. Re-use permitted under CC BY-NC. No commercial re-use. See rights and permissions. Published by BMJ Group. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article distributed in accordance with the Creative Commons Attribution Non Commercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited, appropriate credit is given, any changes made indicated, and the use is non-commercial. See: http://creativecommons.org/licenses/by-nc/4.0/ Abstract Methotrexate-induced osteopathy (MTX-IO) is a rare condition typically involving the lower limbs, especially tibia or foot fractures, among patients with well-controlled rheumatoid arthritis (RA) or psoriatic arthritis (PsA). This study aimed to identify the affected population, describe fracture characteristics and identify risk factors for poor clinical outcome. A multicentre retrospective study included patients with MTX-IO diagnosed by bone specialists or identified through French pharmacovigilance. The data collected included clinical presentation, imaging features, bone mineral density and biochemical markers. Between 2012 and 2024, 92 patients were included, predominantly postmenopausal women with seropositive RA. A history of major fractures was noted for 22% of the patients, and 56% presented osteoporosis at diagnosis. Fractures were most common in the tibial metaphysis (distal and proximal) (88%) and the foot bones (49%), with multiple fractures often present at diagnosis (76%), and frequently repeated fractures in the patients’ recent histories (63%). Diagnosis was conducted using MRI of the painful sites (84%), but bone scintigraphy was also used (41 patients, 45%). Management involved methotrexate discontinuation in 79% of the cases. Fracture healing and pain relief were achieved in 77% of the cases, with a significant difference in outcomes between those who discontinued methotrexate (91%) versus those who continued (29%) (p<0.001). MTX-IO is a rare but significant condition, especially among postmenopausal women with RA or PsA. Early diagnoses via MRI or bone scintigraphy and the discontinuation of methotrexate are critical, as stopping the drug significantly improves outcomes and prevents further fractures. Methotrexate Osteoporosis Pain pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes WHAT IS ALREADY KNOWN ON THIS TOPIC This is a little-known and little-studied subject, raised several years ago, with growing interest over recent years. The need to discontinue methotrexate once the diagnosis has been made is fairly well known, although the data are scarce and often poorly known. WHAT THIS STUDY ADDS This study evaluates real-world therapeutic alternatives after methotrexate discontinuation as a result of osteopathy. It compares outcomes between patients who continued versus patients who discontinued methotrexate, reinforcing the clinical recommendation for withdrawal. Data wasere collected using a European multicentre design, minimizingminimising bias from centre-specific diagnostic practices. The study outlines a standardizedstandardised diagnostic approach, emphasizingemphasising the role of early imaging. HOW THIS STUDY MIGHT AFFECT RESEARCH, PRACTICE OR POLICY Methotrexate-induced osteopathy is a rare but serious complication among patients with chronic inflammatory diseases. This study emphasises the need for better recognition among clinicians prescribing methotrexate in the long term. It demonstrates the limited sensitivity of standard X-ray and the diagnostic value of MRI or bone scintigraphy to confirm methotrexate-induced lesions. This is the first study to detail therapeutic strategies following methotrexate withdrawal, offering practical guidance for on-going disease management. Early discontinuation of methotrexate is crucial to prevent delayed healing, persistent pain and further fractures. Introduction Methotrexate (MTX) is a widely used treatment for both localised and systemic conditions. It is the primary treatment for inflammatory rheumatic diseases (IRDs) involving the peripheral joints, such as rheumatoid arthritis (RA) and psoriatic arthritis (PsA). 1 2 3 4 Another side effect, MTX-related osteopathy, remains largely unknown to physicians. It was initially observed among patients receiving high doses of MTX for haematological treatment, particularly children with acute leukaemia. 5 6 7 8 10 7 11 Therefore, MTX-induced osteopathy seems to preferentially affect women with RA and PsA. 7 12 7 7 11 12 Treatment of MTX-induced osteopathy is not well established. Among all the therapeutic strategies considered, discontinuation of MTX has emerged as the only intervention that has consistently demonstrated a clear benefit in the healing process of fractures. In most cases, discontinuing MTX not only helps prevent further recurrences, but also significantly accelerates bone healing, making it the single most effective measure identified to date for promoting recovery. 7 12 13 12 The aim of this study was to compile case studies from the French Research and Information Group on Osteoporosis (GRIO), the leading authority on osteoporosis and bone disease management, in order to provide a more accurate description of a broad patient population affected by the disease, including information on treatment methods and clinical and radiological evolutions. Martine Branquet, Aurore Aubrun, Bertrand Godfrin, Jean-Louis legrand, Charles Ghiringhelli , Materials and methods Study population We conducted a multicentre retrospective study including all patients identified by a GRIO member presenting MTX-related osteopathy. All patients with suggestive clinical and/or imaging presentations and with current MTX treatment at the time of diagnosis were included. As already described in the literature, 11 14 Patients not already included in this first step and identified by the French national pharmacovigilance database as having a condition suggestive of MTX-induced osteopathy were also included, after analysis of the medical file by the principal investigator (FR). Data collection Baseline clinical information was collected, including demographic data (age at diagnosis, gender, body mass index (BMI) in kg/m², smoking and alcohol consumption, medical history and IRD activity at the time of diagnosis), as well as therapeutic data (weekly and cumulative MTX dose and route of administration, duration of MTX use, corticosteroid use at diagnosis and dose). The location of fractures at diagnosis and the location of previous fractures, if any, imaging conducted for diagnosis (X-ray, bone scintigraphy, PET-Scan, MRI) and BMD by dual energy X-ray absorptiometry (DXA) were also collected. BMD evaluations by DXA during follow-up were also collected if available. Results were expressed as T-scores (expressed as SDs). Biological data were collected, including standard markers used in bone diseases (calcium, phosphorus, magnesium, creatinine, C reactive protein (CRP), thyroid-stimulating hormone, 25 OH vitamin D and parathyroid hormone (PTH), liver function tests (alanine aminotransferase, aspartate amino-transferase, gamma-GT, alkaline phosphatase), blood cell count, electrophoresis of plasma protein, ferritin, albumin, carboxy-terminal collagen crosslinks. Therapeutic changes linked to MTX-induced osteopathy, including MTX interruption and/or the prescription of antiresorptive or anabolic agents, were also collected. Regarding the terms of IRD treatment following the diagnosis of MTX-induced osteopathy, information was collected on treatments (conventional synthetic disease-modifying anti-rheumatic drugs (csDMARDs), biological DMARDs (bDMARDs), targeted synthetic DMARDs (tsDMARDs)) used or maintained in case of MTX discontinuation. Concerning the evolution of fractures, the evolution shown on imaging was assessed if available. A favourable evolution of symptoms was defined as fracture healing on imaging, if available, with a decrease in bone oedema or clinical pain resolution. Statistical analysis All analyses were performed using the SPSS V.16.0 software. Descriptive analysis was expressed as mean±SD. The χ 2 Results General characteristics Between 2012 and 2024, 76 patients were identified as affected by MTX-induced osteopathy. Diagnoses were established by a bone specialist in each centre. 31 other patients were identified from the French pharmacovigilance database, and their medical files were reassessed (to avoid duplications or other diagnoses) by the principal investigator (FR), enabling the inclusion of a further 16 patients, for a total of 92 patients. Patient characteristics are summarised in table 1 Table 1 General demographic and therapeutic data General characteristics (n=92) Women, n (% 86 (93) Body mass index, kg/m 2 SD 25.1±4.1 Risk factors of osteoporosis Menopause, n (% 86 (100) Medical history of fracture, n (% 27 (29) Medical history of major fracture, n (% 20 (22) Medical history of hip fracture in a first-degree relative, n (% 4 (5) History of smoking, n (% 28 (34) Alcohol consumption, n (% 5 (6) Corticosteroids use at diagnosis, n (% 34 (37) Underlying rheumatic disease Seropositive rheumatoid arthritis, n (% 68 (74) Seronegative rheumatoid arthritis, n (% 2 (2) Psoriatic arthritis, n (% 5 (7) Other, n (% 16 (17) Underlying rheumatic treatment at diagnosis (n=84) Methotrexate alone, n (% 56 (67) Association with bDMARD, n (%) 25 (29) Association with tsDMARD, n (%) 3 (4) MTX treatment Duration at diagnosis in months, mean SD 123±74 Dose at diagnosis (mg), mean SD 18.3±5.1 Oral administration, n (% 27 (29%) Subcutaneous administration, n (% 55 (71%) bDMARD, biological disease-modifying anti-rheumatic drug; MTX, methotrexate; tsDMARD, targeted synthetic disease-modifying anti-rheumatic drug. Data on DMARDs were available for 84 patients. At diagnosis, for IRD treatment, 28 patients received another treatment associated with MTX: csDMARDs (hydroxychloroquine, n=1), bDMARDs (n=25 (abatacept (n=6), adalimumab (n=7), etanercept (n=5), rituximab (n=2), golimumab (n=1), sarilumab (n=1), tocilizumab (n=2), certolizumab pegol (n=1)) or with tsDMARDs (n=3). BMD was available at diagnosis for 78 patients: 44 patients (56%) had at least one T-score ≤−2.5 SD. 42 patients had already received treatment for osteoporosis (six patients with teriparatide and 36 patients with antiresorptive treatment, mainly bisphosphonates). Biological evaluation at diagnosis Biological tests were carried out in order to eliminate secondary causes of osteoporosis ( online supplemental table MTX administration The main results are summarised in table 1 Fracture characteristics The characteristic presentation and location of the fracture lesions are presented in figure 1 Figure 1 Standard fracture aspect and location in methotrexate osteopathy. (A) Transversal fracture of the femoral distal metaphysis (T1 on the right and T2 weighted MRI on the left); (B) fracture of the lateral cuneiform (T1 on the right and T2 weighted MRI on the left); (C) association of bilateral transversal fracture of the proximal and distal tibial metaphysis (T1 on the right and T2 weighted MRI on the left), (D) bone scintigraphy aspect with fracture of distal and proximal tibial metaphysis. Initial imaging used for diagnosis was mainly X-ray (84/90, 93%), with the need in all cases for a more precise assessment by MRI (76/90, 84%) or bone scintigraphy (41/90, 46%). Positron emission tomography scan was much less widely used (5/90, 6%). Only five patients underwent solely bone scintigraphy for diagnosis, and in the vast majority of cases, MRI and/or Tomodensitometry (TDM) of the painful location were implemented (n=36). In the case of an ultrasound assessment (n=6), joint effusion was noted in some cases, most often with a mechanical joint fluid count (n=6, with white blood cell count <1000/mm 3 Treatments used As reported in the literature, the first therapeutic option in a large proportion of cases is MTX discontinuation (70/91, 77%). If we focus on additional treatment, four patients received teriparatide in monotherapy, and six patients in combination or association (five patients received teriparatide after antiresorptive treatment (bisphosphonates and denosumab), and one patient was given denosumab-teriparatide combined therapy). 40 patients received at least one antiresorptive treatment (bisphosphonates (n=33) or denosumab (n=7)) after diagnosis. As already noted, in our work, 42 patients had already received anti-osteoporotic treatment before diagnosis. Concerning IRD treatment (data available for 82 patients), in case of MTX discontinuation (n=61), 29 patients had no MTX replacement (discontinuation of all treatments or bDMARDs and tsDMARDs monotherapy). For others, the predominant choice (20 patients) was to switch to another csDMARD (leflunomide or sulfasalazine), while 11 patients were placed under bDMARDs (n=10) or tsDMARDs (n=1). Comparison of clinical evolution according to MTX management The main results are summarised in figure 2 Figure 2 Comparison of evolution according to MTX management. Poor evolution was defined as persistent pain, recurrent fractures or delayed healing. MTX, methotrexate. For all patients, poor clinical outcomes—defined as persistent pain, recurrent fractures or delayed healing—were reported for 17 patients (21%), while 79% of the patients experienced a favourable course. Concerning evolution according to MTX management, the patients without MTX discontinuation experienced poor evolution in the vast majority of cases (12/17 patients, 71% (eight patients with recurrent fractures and four patients with delayed healing), compared with five patients (9%, three patients with recurrent fractures and two patients with delayed healing) in the MTX discontinuation group (p<0.001). Therefore, patients with MTX discontinuation experienced a favourable evolution, 91% (compared with 29% in the MTX continuation group, p<0.001). MTX continuation was inversely correlated with favourable evolution (rho=−0.603, p<0.001). Comparisons between the population maintaining MTX (n=17) and the population discontinuing MTX (n=56) are summarised in table 2 ± ± Table 2 General demographic and therapeutic data MTX continuation group (n=17) MTX discontinuation group (n=56) P value General characteristics Age, mean SD 64±11 68±9 NS BMI, kg/m 2 26±3 25±4 NS T-score, lumbar site, mean SD −1.7±1.2 −1.8±1.1 NS T-score, total hip, mean SD −1.9±0.6 −2.2±0,9 NS T-score, femoral neck, mean SD −2.2±0.7 −2.4±0.9 NS Densitometric osteoporosis n (% 10 (59%) 32 (56%) NS Medical history of major fracture n (% 3 (18%) 12 (21%) NS History of antiosteoporotic treatment, n (% 7 (41%) 25 (45%) NS MTX treatment Duration at diagnosis in months, mean SD 160±88 113±71 <0.05 Dose at diagnosis (mg), mean SD 16.5±6 19.3±4 NS Cumulative dose (g) at diagnosis, mean SD 9.7±6.2 8.2±5.6 NS Oral administration, n (% 7 (41%) 12 (21%) NS Subcutaneous administration, n (% 10 (59%) 44 (79%) NS Corticosteroid treatment Corticosteroid use, n (% 3 (18%) 25 (45%) NS Corticosteroid dose (mg), mean SD 1.5±4.0 3±4.5 NS MTX-Induced osteopathy management Antiosteoporotic treatment, n (% 11 (65%) 29 (52%) NS Antiresorptive treatment alone, n (% 8 (47 %) 24 (43%) NS Teriparatide alone, n (% 0 (0%) 4 (7%) NS Sequential or concomitant combo therapy , n (% 3 (18%) 1 (2%) <0.05 BMI, body mass index; MTX, methotrexate. Comparison of patients’ characteristics according to fracture evolution Comparisons between patients with favourable fracture evolution (n=57) and those with a less favourable or unfavourable evolution (delayed fracture healing/new fractures) (n=16) are summarised in table 3 Table 3 Comparison between favourable and unfavourable evolution of fracture Favourable evolution of fracture (n=57) Delay of fracture healing or fracture recurrence (n=16) P value General characteristics Age, mean SD 67±10 65±10 NS BMI, kg/m 2 25±4 24±4 NS T-score, lumbar site, mean SD −1.7±1.1 −2.2±1.1 NS T-score, total hip, mean SD −2.1±0.9 −2.2±0,5 NS T-score, femoral neck, mean SD −2.3±0.9 −2.5±0.9 NS Densitometric osteoporosis, n (% 28 (49%) 9 (56%) NS Medical history major fracture, n (% 11 (19%) 4 (25%) NS History antiosteoporotic treatment, n (% 26 (46%) 6 (38%) NS MTX treatment Duration at diagnosis in months, mean SD 120±77 141±81 NS Dose at diagnosis (mg), mean ± SD 19.0 ± 6 17.5 ±6 NS Cumulative dose (g) at diagnosis, mean SD 8.6±5.8 8.6±5.7 NS Oral administration, n (% 16 (28%) 3 (19%) NS Subcutaneous administration, n (% 41 (72%) 13 (81%) NS Corticosteroid treatment Corticosteroid use, n (% 25 (44%) 3 (19%) NS Corticosteroid dose (mg), mean SD 1.6±4.0 2.9±4.5 NS MTX-Induced osteopathy management MTX discontinuation, n (% 52 (91%) 4 (25%) p<0.001 Antiosteoporotic treatment, n (% 28 (49%) 12 (75%) NS Antiresorptive treatment alone, n (% 24 (42%) 8 (50%) NS Teriparatide alone, n (% 3 (5%) 1 (6%) NS Sequential or concomitant combined therapy , n (% 1 (2%) 3 (19%) p<0.001 Unfavourable evolution was defined as persistent pain, recurrent fractures or delayed healing. BMI, body mass index; MTX, methotrexate. The general characteristics were similar between the groups, especially age, BMI, medical history of major fractures and densitometric osteoporosis. Concerning MTX use, MTX duration, dose at diagnosis or cumulative dose, they were not associated with a poor evolution. The use or the dose of corticosteroids at diagnosis was not associated with poor evolution. The only main significant difference between the groups was linked to MTX continuation/discontinuation (p<0001). Discussion MTX-induced osteopathy is a rare condition characterised by bone pain and the occurrence of specific spontaneous fractures, which differ from those associated with classic osteoporosis. 7 11 To our knowledge, ours is one of the largest multicentre cohorts of MTX-induced osteopathy cases. This study highlights the specific clinical presentation of this condition, which is characterised by stress fractures in the lower limbs, primarily affecting the tibia (88% of cases). Although X-rays are most commonly used for diagnosis (93%), MRI (84%) and bone scintigraphy (46%) are also frequently used. The study pinpoints the importance of discontinuing MTX treatment, as a significant proportion of patients experience a poor outcome if MTX is continued after the identification of MTX-induced osteopathy (71%). In our study, the MTX dose at diagnosis, the cumulative dose and the duration of MTX treatment were not associated with poor outcome. Understanding the pathophysiology of MTX-induced osteopathy remains challenging. In vitro and in vivo data suggest that MTX decreases bone formation by reducing osteoblast activation and differentiation 15 16 17 18 19 20 21 11 As in previous reports, this study demonstrated that fractures in the lower limbs (particularly the tibia and the feet) were more prevalent than those observed in postmenopausal osteoporosis. This finding is consistent with a recent study. 14 7 11 12 5 22 7 In support of the role of MTX in the development of this osteopathy, it can be noted that discontinuing MTX was associated with an absence of fracture recurrence in both haematological 5 23 7 12 7 12 13 In addition to discontinuing MTX, a large proportion of patients received osteoporosis treatment. Based on the data for underlying pathophysiology and histomorphometric characteristics, some groups have suggested a combination therapy with denosumab and teriparatide. 11 12 Regarding IRD, the vast majority of patients in our study presented with RA. At diagnosis, the disease was often in remission or with low disease activity. Corticosteroid use was minimal at the time of diagnosis, reflecting low disease activity. In our study, the average dose of prednisone was 7.8 mg±7.1, which is higher than that reported in the literature (3.2 mg±1.2 11 13 Our study presents some strong points. It was a multicentre, binational large study, with cases identified by a bone specialist after exclusion of other classic causes of bone fragility and using a pharmacovigilance database. It was one of the largest cohorts on this topic with the inclusion of 92 patients (including pharmacovigilance database identification). It is also the first study evaluating therapeutic choices after MTX discontinuation. However, our study also presents some weaknesses. It was a retrospective study with a possible bias, without a standardised evaluation, mainly concerning pain duration after MTX discontinuation. Given the design of our work, we cannot conclude on the efficacy of associated specific bone therapy on fracture evolution. In addition, as previously described in various studies on this topic, the patients presented multiple risk factors for bone fragility, including prolonged corticosteroid therapy, which can play a role in bone phenotypes. Clinicians should bear in mind that the benefits of using MTX far outweigh the risk of developing this osteopathy in most cases. Even if this condition remains rare, reports of MTX-induced osteopathy seem to be more frequent, reflecting a progressive improvement in knowledge on the subject and better screening of suspected cases. The other possibility is that, since MTX has been used in rheumatological indications since the 1980s, the recent increase in cases could reflect its broader use in recent years (raising the question of a potential individual susceptibility to developing this type of osteopathy producing a dose- and time-dependent effect). In any case, the discontinuation of MTX seems essential to improve symptoms in identified cases, generally with rapid improvement (a few weeks) after discontinuation. The main advantage of improving knowledge of this condition is the avoidance of diagnostic delay and the scope to instate therapeutic changes. Although fatigue/insufficient fractures in these characteristic locations among patients treated with MTX should not necessarily point to the possibility of this condition, clinicians should bear its existence in mind, particularly in the event of recurrence or delayed healing or in case of multiple locations. This work reinforces the need to identify patients at risk and underlines the importance of performing imaging (bone scintigraphy or MRI of the painful areas) in case of diagnostic suspicion. Further studies are needed to gain a deeper understanding of the mechanisms involved in the development of MTX-induced osteopathy in order to better identify individuals at risk. Similarly, the prospective evaluation of osteo-forming treatment initiated at the time of diagnosis is warranted, as this approach could offer a promising pathway to accelerated healing. Supplementary material 10.1136/rmdopen-2025-005941 online supplemental table 1 Acknowledgements The GRIO (research and information group on osteoporosis) and the French Rheumatology Society; this publication uses data collected from all regional Pharmacovigilance Centres, which are organised in a French network of RCPVs, affiliated to the ANSM. The views expressed in this article are those of the authors and do not necessarily represent the views of the ANSM. Funding: Provenance and peer review: Patient consent for publication: Ethics approval: Data availability free text: References 1 Smolen JS Landewé RBM Bergstra SA et al EULAR recommendations for the management of rheumatoid arthritis with synthetic and biological disease-modifying antirheumatic drugs: 2022 update Ann Rheum Dis 2023 82 3 18 10.1136/ard-2022-223356 36357155 2 Gossec L Baraliakos X Kerschbaumer A et al EULAR recommendations for the management of psoriatic arthritis with pharmacological therapies: 2019 update Ann Rheum Dis 2020 79 700 12 10.1136/annrheumdis-2020-217159 32434812 PMC7286048 3 Cronstein BN Aune TM Methotrexate and its mechanisms of action in inflammatory arthritis Nat Rev Rheumatol 2020 16 145 54 10.1038/s41584-020-0373-9 32066940 4 Wang W Zhou H Liu L Side effects of methotrexate therapy for rheumatoid arthritis: A systematic review Eur J Med Chem 2018 158 502 16 10.1016/j.ejmech.2018.09.027 30243154 5 Ragab AH Frech RS Vietti TJ Osteoporotic fractures secondary to methotrexate therapy of acute leukemia in remission Cancer 1970 25 580 5 10.1002/1097-0142(197003)25:3&#x0003c;580::aid-cncr2820250313&#x0003e;3.0.co;2-m 5264439 6 Ansell G Evans S Jackson CT et al Cytotoxic drugs for non-neoplastic disease Br Med J (Clin Res Ed) 1983 287 762 10.1136/bmj.287.6394.762-a PMC1549081 6412816 7 Robin F Cadiou S Albert J-D et al Methotrexate osteopathy: five cases and systematic literature review Osteoporos Int 2021 32 225 32 10.1007/s00198-020-05664-x 33128074 8 di Munno O Mazzantini M Sinigaglia L et al Effect of low dose methotrexate on bone density in women with rheumatoid arthritis: results from a multicenter cross-sectional study J Rheumatol 2004 31 1305 9 15229948 9 Buckley LM Leib ES Cartularo KS et al Effects of low dose methotrexate on the bone mineral density of patients with rheumatoid arthritis J Rheumatol 1997 24 1489 94 9263140 10 Palmowski A Akahoshi M Muche B et al No association between methotrexate and impaired bone mineral density in a cohort of patients with polymyalgia rheumatica, giant cell arteritis, granulomatosis with polyangiitis and other vasculitides-a cross-sectional analysis with dose-response analyses Rheumatol Int 2023 43 903 9 10.1007/s00296-023-05286-6 36811660 PMC10073043 11 Rolvien T Jandl NM Stürznickel J et al Clinical and Radiological Characterization of Patients with Immobilizing and Progressive Stress Fractures in Methotrexate Osteopathy Calcif Tissue Int 2021 108 219 30 10.1007/s00223-020-00765-5 33064170 PMC7819927 12 Ruffer N Krusche M Beil FT et al Clinical features of methotrexate osteopathy in rheumatic musculoskeletal disease: A systematic review Semin Arthritis Rheum 2022 52 151952 10.1016/j.semarthrit.2022.151952 35038641 13 Hauser B Merriman A Foley J et al Methotrexate continuation increases fracture risk in patients who sustained lower limb insufficiency fractures Ann Rheum Dis 2025 84 554 61 10.1016/j.ard.2025.01.047 39988500 14 von Brackel FN Grambeck J Barvencik F et al MTX Osteopathy Versus Osteoporosis Including Response to Treatment Data-A Retrospective Single Center Study Including 172 Patients Calcif Tissue Int 2024 115 599 610 10.1007/s00223-024-01290-5 39322780 PMC11531443 15 May KP Mercill D McDermott MT et al The effect of methotrexate on mouse bone cells in culture Arthritis & Rheumatism 1996 39 489 94 10.1002/art.1780390317 8607898 16 Uehara R Suzuki Y Ichikawa Y Methotrexate (MTX) inhibits osteoblastic differentiation in vitro: possible mechanism of MTX osteopathy J Rheumatol 2001 28 251 6 11246658 17 Georgiou KR King TJ Scherer MA et al Attenuated Wnt/β-catenin signalling mediates methotrexate chemotherapy-induced bone loss and marrow adiposity in rats Bone 2012 50 1223 33 10.1016/j.bone.2012.03.027 22484100 18 Shandala T Shen Ng Y Hopwood B et al The role of osteocyte apoptosis in cancer chemotherapy-induced bone loss J Cell Physiol 2012 227 2889 97 10.1002/jcp.23034 21938727 19 Xian CJ Cool JC Scherer MA et al Cellular mechanisms for methotrexate chemotherapy-induced bone growth defects Bone 2007 41 842 50 10.1016/j.bone.2007.07.021 17884747 20 Fan C-M Foster BK Hui SK et al Prevention of bone growth defects, increased bone resorption and marrow adiposity with folinic acid in rats receiving long-term methotrexate PLoS ONE 2012 7 e46915 10.1371/journal.pone.0046915 23071661 PMC3465278 21 King TJ Georgiou KR Cool JC et al Methotrexate chemotherapy promotes osteoclast formation in the long bone of rats via increased pro-inflammatory cytokines and enhanced NF-κB activation Am J Pathol 2012 181 121 9 10.1016/j.ajpath.2012.03.037 22642908 22 Robin F Leloix A Guggenbuhl P et al Methotrexate osteopathy: Old description, but still important to know ACR Open Rheumatol 2025 7 e70039 10.1002/acr2.70039 40210601 PMC11985256 23 O’Regan S Methotrexate-Induced Bone Pain in Childhood Leukemia Arch Pediatr Adolesc Med 1973 126 489 10.1001/archpedi.1973.02110190403008 4522143 Data availability statement Data are available upon reasonable request. ",
  "metadata": {
    "Title of this paper": "Methotrexate-Induced Bone Pain in Childhood Leukemia",
    "Journal it was published in:": "RMD Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481393/"
  }
}