{
  "title": "Paper_152",
  "abstract": "pmc Clinics (Sao Paulo) Clinics (Sao Paulo) 795 clinics Clinics 1807-5932 1980-5322 Hospital das Clinicas da Faculdade de Medicina da Universidade de Sao Paulo PMC12489826 PMC12489826.1 12489826 12489826 40976128 10.1016/j.clinsp.2025.100778 S1807-5932(25)00196-6 100778 1 Original Articles C-reactive protein to lymphocyte ratio is a prognostic factor for unfavorable outcomes following aneurysmal subarachnoid hemorrhage Lin Yijun a 1 Li Sijia a 1 Zhao Xingquan zxq@vip.163.com a b c ⁎ a b c ⁎ zxq@vip.163.com 1 These authors contributed equally to this work. Jan-Dec 2025 20 9 2025 80 476671 100778 10 9 2024 19 7 2025 28 8 2025 20 09 2025 03 10 2025 03 10 2025 © 2025 HCFMUSP. Published by Elsevier España, S.L.U. 2025 HCFMUSP https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Highlights • Prospective study of 650 aSAH patients examining CLR levels within 24 h. • Exploring CLR as a biomarker for inflammation-immune imbalance in aSAH. • Elevated CLR levels are significantly linked to 3-month poor outcomes in aSAH. • CLR as a biomarker for predicting outcomes and guiding treatments in aSAH. Purpose The present study aimed to use the C-reactive protein-to-Lymphocyte Ratio (CLR) to investigate the impact of inflammation-immune imbalance on the prognosis of aneurysmal Subarachnoid Hemorrhage (aSAH) patients. Patients and methods A total of 650 eligible aSAH patients were prospectively enrolled in this study. CLR was examined within 24 h after symptom onset and calculated by C-reactive protein levels (mg/L) divided by lymphocyte count (10 9 Results Univariate analysis revealed that elevated CLR levels were associated with poor functional outcomes ( p p 9 Conclusions CLR during the hyperacute phase after aSAH might not only be utilized as a reliable biomarker to predict clinical outcomes of aSAH but also provide promising insight into future research to develop tailored treatments targeting inflammation-immune imbalance. Keywords CLR aSAH Clinical outcomes Hemorrhage Stroke pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Aneurysmal Subarachnoid Hemorrhage (aSAH) is a life-threatening neurological disease, affecting 8.09 million people worldwide. 1 2 , 3 1 There is increasing evidence suggesting that inflammation significantly contributes to early brain injury following aSAH, which in turn leads to poor functional outcomes. 4 5 6 7 8 9 10 11 12 Methods Study population This study was a prospective, observational cohort study involving patients with aSAH from the department of neurology emergency in Beijing Tiantan Hospital between October 2020 and July 2023. The research adhered to the ethical principles outlined in the Helsinki Declaration and received approval from the Institutional Review Board of Beijing Tiantan Hospital (KY2023–190–02). Written informed consent was obtained from all participants or their legally authorized representatives. Inclusion criteria were as follows: 1) Age ≥ 18 years, 2) Diagnosis of spontaneous SAH confirmed by head CT scan, 3) Presence of intracranial aneurysm confirmed by CT Angiography (CTA) or Digital Subtraction Angiography (DSA) and 4) Within 24 h after symptom onset. Exclusion criteria included: 1) SAH caused by other factors such as trauma, cerebral arteriovenous malformations, intracranial tumors, or moyamoya disease, 2) Previous history of ischemic or hemorrhagic stroke, vascular anomalies, or malformations, 3) Acute kidney injury or chronic kidney disease, 4) Concomitant systemic complications, including malignancy, cirrhosis, infection, or immune dysfunction. Baseline information Baseline information, including demographics (age and gender), medical history (hypertension, diabetes mellitus, coronary heart disease, smoking and drinking), blood pressure and heart rate was all collected by trained physicians on admission. Smoking was defined as current smoking or having smoked regularly within the past year, while alcohol consumption was defined as regular drinking (at least one drink per week) in the past year. 13 14 , 15 Treatment modalities, including endovascular coiling, surgical clipping, or conservative treatment, were determined by endovascular experts and experienced neurosurgeons based on the current guidelines. 1 Laboratory examinations and definition of CLR Blood samples were drawn from an antecubital vein immediately upon arrival and before any treatment was conducted. Laboratory examinations, including White Blood Cells (WBC), lymphocytes, neutrophils, Hemoglobin (Hb), Platelets (PLT), and C-Reactive Protein (CRP), were collected for all participants by routine laboratory assays. CLR was calculated by CRP levels (mg/L) divided by lymphocyte count (10 9 10 Outcomes All the patients were followed up by telephone interviews at 3 months after aSAH onset. Functional outcomes were assessed utilizing the modified Rankin Scale score (mRS) by trained research personnel who were blinded to baseline information. The primary outcome was unfavorable functional outcomes, defined as an mRS score of 4‒6. 14 Statistical analysis All statistical analyses were conducted using SPSS Statistics for Windows, version 22.0 (IBM Corp, Armonk, NY, USA) and R https://www.r-project.org/ t U p Results Among the 834 patients with aSAH, a total of 650 eligible patients with complete 3-month follow-up information and examination of CLR within 24 h after symptom onset were finally enrolled in this study ( Fig. 1 Figs. 2 3 Fig. 1 Flow chart of the study population. CLR, C-reactive protein to Lymphocyte Ratio. Fig. 1 Fig. 2 Incidence rates of good and poor functional outcomes in different CLR groups. Fig. 2 Fig. 3 Proportions of mortality and survival rates among different CLR groups. Fig. 3 Baseline characteristics grouped by 3 months poor functional outcome or all-cause death are presented in Table 1 Table 1 Table 1 Baseline characteristics of the study population grouped by 3-month functional outcome. Table 1 Total ( n Good functional outcome ( n Poor functional outcome ( n p Age (years) 57.0 ± 12.4 54.7 ± 11.7 65.2 ± 11.3 <0.01 Female sex 420 (64.6) 327 (64.1) 93 (66.4) 0.61 History Hypertension 388 (59.7) 288 (56.6) 100 (71.4) <0.01 Diabetes mellitus 70 (10.8) 46 (9.0) 24 (17.1) <0.01 Coronary heart disease 56 (8.6) 32 (6.3) 24 (17.1) <0.01 Current smoking 80 (12.3) 70 (13.7) 10 (7.1) 0.04 Alcohol 59 (9.1) 50 (9.8) 9 (6.4) 0.22 Vital signs SBP (mmHg) 154.0 (138.0‒169.0) 153.0 (137.3‒167.0) 159.0 (140.0‒176.8) 0.01 DBP (mmHg) 87.0 (79.0‒96.0) 87.0 (78.0‒97.0) 89.0 (80.0‒96.0) 0.19 Heart rate (/min) 79.0 (71.0‒88.0) 78.0 (70.0‒87.0) 83.0 (73.3‒91.0) <0.01 Neurological status Hunt-Hess grade 3‒5 132 (20.3) 69 (13.5) 63 (45.0) <0.01 WFNS grade 3‒5 74 (11.4) 30 (5.9) 44 (31.4) <0.01 Laboratory tests WBC (× 10 9 12.3 (10.0‒15.1) 12.1 (9.8‒14.6) 13.4 (10.5‒16.8) <0.01 Lymphocyte (× 10 9 1.0 (0.7‒1.3) 1.0 (0.7‒1.3) 1.0 (0.7‒1.2) 0.46 Neutrophil (× 10 9 10.9 (8.4‒13.5) 10.5 (8.3‒13.0) 12.2 (9.1‒15.2) <0.01 Hb (g/L) 139.0 (128.8‒149.0) 139.0 (129.0‒149.3) 139.0 (126.3‒147.0) 0.29 PLT(× 10 9 231.0 (196.2‒270.0) 231.5 (196.0‒270.8) 231.0 (202.0‒270.8) 0.99 CRP (mg/L) 2.5 (0.9‒5.6) 2.4 (0.9‒5.6) 2.9 (1.1‒5.9) 0.04 CLR (mg/10 9 2.4 (1.0‒6.0) 2.2 (0.9‒5.8) 2.9 (1.1‒8.4) 0.03 Aneurysm location 0.33 Anterior cerebral artery 194 (30.0) 156 (30.6) 38 (27.1) Internal carotid artery 272 (41.8) 213 (41.8) 59 (25.2) Middle cerebral artery 117 (18.0) 94 (9.2) 23 (14.4) Posterior circulation 67 (10.3) 47 (9.2) 20 (14.3) Aneurysm morphology 0.35 Single-sac with smooth margin 166 (25.5) 138 (27.2) 28 (20.1) Single-sac with irregular margin 184 (28.3) 139 (27.4) 45 (32.4) Aneurysm with a daughter sac 163 (25.1) 128 (25.2) 35 (25.2) Multilobulated aneurysm 134 (20.6) 103 (20.3) 31 (22.3) Multiple aneurysm 137 (21.1) 92 (18.0) 45 (32.4) <0.01 Modified Fisher grade 3‒4 347 (53.4) 239 (46.9) 108 (77.1) <0.01 Treatment <0.01 Coiling 270 (41.5) 239 (46.9) 31 (22.1) Clipping 297 (45.7) 239 (46.9) 58 (41.4) Conservative treatment 83 (12.8) 32 (6.3) 51 (36.4) Notes: SBP, Systolic Blood Pressure; DBP, Diastolic Blood Pressure; WFNS, World Federation of Neurosurgical Societies; WBC, White Blood Cell; Hb, Hemoglobin; PLT, Platelet; CRP, C-Reaction Protein; CLR, C-reactive protein-to-Lymphocyte Ratio. On multivariable analysis, CLR entered into the model as a categorical variable, stratified by four groups based on quartile ranges. Compared with patients in the lowest quartile of CLR, the odds ratio of the highest quartile (> 6.02 mg/10 9 Table 2 9 Table 3 Table 2 Crude and adjusted OR of CLR levels for 3-month poor functional outcome. Table 2 Q1 (CLR ≤ 0.96) Q2 (0.96 < CLR ≤ 2.38) Q3 (2.38 < CLR ≤ 6.02) Q4 (CLR > 6.02) Events, n ( %) 16.8 21.1 21.7 26.1 Crude OR (95 % CI) 1.00 (reference) 1.33 (0.76‒2.33) 1.38 (0.79‒2.41) 1.75 (1.02‒3.01) Adjusted a % CI) 1.00 (reference) 2.53 (0.93‒6.86) 2.42 (0.84‒6.94) 2.89 (1.02‒8.17) Notes: a .CLR, C-reactive protein-to-Lymphocyte Ratio; OR, Odd Ratios; CI, Confidence Interval. Table 3 Crude and adjusted OR of CLR levels for 3-month all-cause death. Table 3 Q1 (CLR ≤ 0.96) Q2 (0.96 < CLR ≤ 2.38) Q3 (2.38 < CLR ≤ 6.02) Q4 (CLR > 6.02) Events, n ( %) 6.20 9.90 11.80 14.30 Crude OR (95 % CI) 1.00 (reference) 1.67 (0.73‒3.79) 2.02(0.91‒4.49) 2.52 (1.16‒5.48) Adjusted a % CI) 1.00 (reference) 1.22 (0.45‒3.28) 1.74 (0.65‒4.67) 1.46 (0.56‒3.80) Notes: a CLR, C-reactive protein-to-Lymphocyte Ratio; OR, Odd Ratios; CI, Confidence Interval. According to the threshold value used to independently predict 3 months poor functional outcome after aSAH, patients with CLR > 6.02 mg/10 9 9 Fig. 4 Fig. 4 Distribution of mRS scores at 3-months stratified by CLR thresholds. mRS, modified Rankin Scale; CLR, C-reactive protein to Lymphocyte Ratio. Fig. 4 Subgroup analysis stratified by sex is shown in Table 4 Table 4 Multivariate-adjusted OR and 95 % CI for poor clinical outcomes according to quartiles of CLR levels, stratified by sex. Table 4 Outcome Subgroup CLR p for interaction Q1 (≤ 0.96) Q2 (0.96‒2.38) Q3 (2.38‒6.02) Q4 (> 6.02) Poor functional outcome Male 1.00 (reference) 1.61 (0.45‒5.84) 1.17 (0.28‒4.87) 3.03 (0.82‒11.19) 0.39 Female 1.00 (reference) 1.24 (0.51‒3.02) 1.02 (0.43‒2.41) 0.87 (0.36‒2.12) All-cause death Male 1.00 (reference) 1.45 (0.27‒7.01) 0.67 (0.10‒4.88) 3.51 (0.69‒17.95) 0.67 Female 1.00 (reference) 1.81 (0.467‒7.07) 2.42 (0.65‒9.06) 1.67 (0.42‒6.71) OR, Odds Ratio; CI, Confidence Interval; CLR, C-reactive protein-to-Lymphocyte Ratio. Discussion In this prospective cohort study of patients with aSAH, elevated CLR levels within 24 h after symptom onset were independently associated with increased risk of 3 months poor functional outcome, whereas no significant relationship was discovered between higher levels of CLR and 3-month all-cause death. The present findings suggest that CLR levels examined during the hyperacute phase after aSAH can be a reliable and novel biomarker to predict long-term functional outcome. Many previous studies on the CLR levels mainly focused on the outcome of various cancers and infectious diseases. 11 , 16 , 17 11 , 12 , 16 , 18 10 12 In this retrospective analysis of 221 aSAH patients, CLR levels within 48 h of bleeding could independently predict unfavorable functional outcome at discharge. Due to the limitations of retrospective study design, small sample size, relatively longer time to blood sampling examination since symptom onset, and short-term outcome evaluation in this prior research, this study has extended the findings of this previous study. In the prospective and large cohort, the authors discovered for the first time that CLR levels examined within 24 h after symptom onset were significantly correlated with a 3-month poor functional outcome. The potential explanations underlying the association of elevated CLR levels with increased risk of poor functional outcome after aSAH are as follows. First, an increase of CLR levels manifests as two parts: hyperactivation of the inflammation response, indicated by CRP elevations and immune disorders, indicated by decreased lymphocyte counts. 10 , 19 20 , 21 10 , 19 17 20 22 10 , 23 24 , 25 26 As a convenient and readily available serum biomarker to predict poor functional outcome, CLR examined in the super-early phase of aSAH can help physicians to identify patients at increased risk early and activate prompt treatment to prevent further deterioration. For patients with elevated CLR levels, closer monitoring of neurological status and infectious complications, more rigorous intensive care treatment and more active follow-up after discharge should be performed to ameliorate prognosis in patients with aSAH to the maximum extent. Another clinical implication of the present findings is that elevated CLR levels indicate a severe imbalance between the inflammation response and the immune defense function; therefore, treatment of inflammation-immune disorders by targeting CRP or lymphocytes may have the potential to improve the prognosis of aSAH patients. A previous study has found that Dexmedetomidine (DEX) administration reduced IL-6 and CRP levels after SAH and ultimately attenuated neurological functional deficts. 27 T 28 The present study also provides insights into the negative relationship between higher CLR levels and 3-month all-cause death after aSAH. A possible explanation might be that it is due to the predominant impact of clinical and radiological grading scales during the hyperacute phase on all-cause death. As reported before, the WFNS grade on day 1 was the second most important factor for predicting 1-year death after aSAH. 29 30 Previous studies have indicated that the incidence of aSAH is higher in females than in males, 31 , 32 33 34 35 36 There are some limitations to be addressed in the present study. First of all, the cause-and-effect correlation between CLR levels and poor outcomes was not elucidated due to the observational nature of the study. Secondly, the dynamic changes of CLR levels were not examined, and the trajectory of CLR levels in relation to outcomes should be explored further. Finally, the single-center design of the present study may have introduced selection bias. Conclusions In conclusion, the present study demonstrated that elevated CLR levels (> 6.02 mg/10 9 Ethics approval and informed consent The study was approved by the Institutional Review Board of Beijing Tiantan Hospital, Captital Medical University (KY2023–190–02). All the participants or their legally authorized representatives signed the written informed consent. The study was conducted according to the ethical principles stated in the Helsinki Declaration. Consent for publication Not applicable. Funding The study was supported by Chinese Academy of Medical Sciences Innovation Fund for Medical Sciences 2019-I2M-5–029 10.13039/501100001809 National Natural Science Foundation of China 82371302 Capital Medical University Scientific Research Cultivating Funding PYZ23121 Data availability The data that support the findings of this study are available from the corresponding author upon reasonable request. CRediT authorship contribution statement Yijun Lin: Sijia Li: Xingquan Zhao: Declaration of competing interest The authors declare no conflicts of interest. References 1 Hoh B.L. Ko N.U. Amin-Hanjani S. Chou S.H.-Y. Cruz-Flores S. Dangayach N.S. 2023 Guideline for the management of patients with aneurysmal subarachnoid hemorrhage: a Guideline from the American Heart Association/American Stroke Association Stroke. 54 7 2023 e314 e370 37212182 10.1161/STR.0000000000000436 2 Registry SC-GS. Global impact of the COVID-19 pandemic on subarachnoid haemorrhage hospitalisations, aneurysm treatment and in-hospital mortality: 1-year follow-up J Neurol Neurosurg Psychiatry 2022 10.1136/jnnp-2022-329200 Online ahead of print 35902229 3 van Donkelaar C.E. Bakker N.A. Birks J. Veeger N.J.G.M. Metzemaekers J.D.M. Molyneux A.J. Prediction of outcome after aneurysmal subarachnoid hemorrhage Stroke 50 4 2019 837 844 30869562 10.1161/STROKEAHA.118.023902 4 Lucke-Wold B.P. Logsdon A.F. Manoranjan B. Turner R.C. McConnell E. Vates G.E. Aneurysmal subarachnoid hemorrhage and neuroinflammation: a comprehensive review Int J Mol Sci 17 4 2016 497 27049383 10.3390/ijms17040497 PMC4848953 5 Di Napoli M. Slevin M. Popa-Wagner A. Singh P. Lattanzi S. Divani A.A. Monomeric C-reactive protein and cerebral hemorrhage: from bench to bedside Front Immunol 9 2018 1921 30254628 10.3389/fimmu.2018.01921 PMC6141664 6 Gaastra B. Barron P. Newitt L. Chhugani S. Turner C. Kirkpatrick P. CRP (C-Reactive Protein) in outcome prediction after subarachnoid hemorrhage and the role of machine learning Stroke 52 10 2021 3276 3285 34238015 10.1161/STROKEAHA.120.030950 7 Cai L. Zeng H. Tan X. Wu X. Qian C. Chen G. The role of the blood neutrophil-to-lymphocyte ratio in aneurysmal subarachnoid hemorrhage Front Neurol 12 2021 671098 10.3389/fneur.2021.671098 PMC8209292 34149601 8 Sarrafzadeh A. Schlenk F. Meisel A. Dreier J. Vajkoczy P. Meisel C. Immunodepression after aneurysmal subarachnoid hemorrhage Stroke 42 1 2011 53 58 21088239 10.1161/STROKEAHA.110.594705 9 Campbell E.J. Baker M.D. Crites-Silver P. Subjective effects of humidification of oxygen for delivery by nasal cannula. A prospective study Chest 93 2 1988 289 293 3338294 10.1378/chest.93.2.289 10 Qian F. Zhou W. Liu Y. Ge Z. Lai J. Zhao Z. High C-reactive protein to lymphocyte ratio predicts mortality outcomes of patients with severe fever with thrombocytopenia syndrome: a multicenter study in China J Med Virol 95 2 2023 e28546 10.1002/jmv.28546 36734063 11 Hwang J.J. Hur J.Y. Eo W. An S. Kim D.H. Lee S. Clinical significance of C-reactive protein to lymphocyte count ratio as a prognostic factor for survival in non-small cell lung cancer patients undergoing curative surgical resection J Cancer 12 15 2021 4497 4504 34149913 10.7150/jca.58094 PMC8210557 12 Zhang Q. Zhang G. Wang L. Zhang W. Hou F. Zheng Z. Clinical value and prognosis of C reactive protein to lymphocyte ratio in severe aneurysmal subarachnoid hemorrhage Front Neurol 13 2022 868764 10.3389/fneur.2022.868764 PMC9234282 35769371 13 Feigin V.L. Rinkel G.J.E. Lawes C.M.M. Algra A. Bennett D.A. van Gijn J. Risk factors for subarachnoid hemorrhage: an updated systematic review of epidemiological studies Stroke 36 12 2005 2773 2780 16282541 10.1161/01.STR.0000190838.02954.e8 14 Jaja B.N.R. Saposnik G. Lingsma H.F. Macdonald E. Thorpe K.E. Mamdani M. SAHIT collaboration Development and validation of outcome prediction models for aneurysmal subarachnoid haemorrhage: the SAHIT multinational cohort study BMJ 360 2018 j5745 29348138 10.1136/bmj.j5745 15 Abboud T. Rustom J. Bester M. Czorlich P. Vittorazzi E. Pinnschmidt H.O. Morphology of ruptured and unruptured intracranial aneurysms World Neurosurg 99 2017 610 617 28017741 10.1016/j.wneu.2016.12.053 16 Fan Z. Luo G. Gong Y. Xu H. Qian Y. Deng S. Prognostic value of the C-reactive protein/lymphocyte ratio in pancreatic cancer Ann Surg Oncol 27 10 2020 4017 4025 32144621 10.1245/s10434-020-08301-3 17 Xiao B. Wu Y. Liang H. Xiao J. Han Y. Yang Z. C-reactive protein to lymphocyte ratio is a significant predictive factor for poor short-term clinical outcomes of SARS-CoV-2 BA.2.2 patients Front Public Health 11 2023 1168375 10.3389/fpubh.2023.1168375 PMC10117655 37089472 18 Kono Y. Saito H. Murakami Y. Shishido Y. Kuroda H. Matsunaga T. Postoperative ratio of the maximum C-reactive protein level to the minimum peripheral lymphocyte count as a prognostic indicator for gastric cancer patients Surg Today 49 3 2019 206 213 30317493 10.1007/s00595-018-1724-x 19 Jin J. Duan J. Du L. Xing W. Peng X. Zhao Q. Inflammation and immune cell abnormalities in intracranial aneurysm subarachnoid hemorrhage (SAH): relevant signaling pathways and therapeutic strategies Front Immunol 13 2022 1027756 10.3389/fimmu.2022.1027756 PMC9727248 36505409 20 Lauzier D.C. Jayaraman K. Yuan J.Y. Diwan D. Vellimana A.K. Osbun J.W. Early brain injury after subarachnoid hemorrhage: incidence and mechanisms Stroke 54 5 2023 1426 1440 36866673 10.1161/STROKEAHA.122.040072 PMC10243167 21 Chen J. Zheng Z.V. Lu G. Chan W.Y. Zhang Y. Wong G.K.C. Microglia activation, classification and microglia-mediated neuroinflammatory modulators in subarachnoid hemorrhage Neural Regen Res 17 7 2022 1404 1411 34916410 10.4103/1673-5374.330589 PMC8771101 22 Giede-Jeppe A. Reichl J. Sprügel M.I. Lücking H. Hoelter P. Eyüpoglu I.Y. Neutrophil-to-lymphocyte ratio as an independent predictor for unfavorable functional outcome in aneurysmal subarachnoid hemorrhage J Neurosurg 132 2 2019 400 407 30717052 10.3171/2018.9.JNS181975 23 He L. Xie H. Du Y. Xie X. Zhang Y. The relationship between C-reactive protein to lymphocyte ratio and the prevalence of myocardial infarction in US adults: a cross-sectional study Heliyon 9 7 2023 e17776 10.1016/j.heliyon.2023.e17776 PMC10359823 37483727 24 Zhou Y. Jiang Y. Peng Y. Zhang M. The quantitative and functional changes of postoperative peripheral blood immune cell subsets relate to prognosis of patients with subarachnoid hemorrhage: a preliminary study World Neurosurg 108 2017 206 215 28866066 10.1016/j.wneu.2017.08.091 25 Attanasio L. Grimaldi D. Akhtar Ramiz R. Schuind S. Scolletta S. Adinolfi L.E. Early lymphopenia and infections in nontraumatic subarachnoid hemorrhage patients J Neurosurg Anesthesiol 34 2 2022 243 247 33208711 10.1097/ANA.0000000000000744 26 Meisel C. Schwab J.M. Prass K. Meisel A. Dirnagl U. Central nervous system injury-induced immune deficiency syndrome Nat Rev Neurosci 6 10 2005 775 786 16163382 10.1038/nrn1765 27 Song Y. Lim B.J. Kim D.H. Ju J.W. Han D.W. Effect of dexmedetomidine on cerebral vasospasm and associated biomarkers in a rat subarachnoid hemorrhage model J Neurosurg Anesthesiol 31 3 2019 342 349 29683965 10.1097/ANA.0000000000000504 28 Brinkmann V. Billich A. Baumruker T. Heining P. Schmouder R. Francis G. Fingolimod (FTY720): discovery and development of an oral drug to treat multiple sclerosis Nat Rev Drug Discov 9 11 2010 883 897 21031003 10.1038/nrd3248 29 Hostettler I.C. Muroi C. Richter J.K. Schmid J. Neidert M.C. Seule M. Decision tree analysis in subarachnoid hemorrhage: prediction of outcome parameters during the course of aneurysmal subarachnoid hemorrhage using decision tree analysis J Neurosurg 129 6 2018 1499 1510 29350603 10.3171/2017.7.JNS17677 30 Dengler N.F. Sommerfeld J. Diesing D. Vajkoczy P. Wolf S. Prediction of cerebral infarction and patient outcome in aneurysmal subarachnoid hemorrhage: comparison of new and established radiographic, clinical and combined scores Eur J Neurol 25 1 2018 111 119 28940973 10.1111/ene.13471 31 Molenberg R. Thio C.H.L. Aalbers M.W. Uyttenboogaart M. ISGC Intracranial Aneurysm Working Group Larsson S.C. Bakker M.K. Sex hormones and risk of aneurysmal subarachnoid hemorrhage: a mendelian randomization study Stroke 53 9 2022 2870 2875 35652345 10.1161/STROKEAHA.121.038035 PMC9389934 32 Turan N. Heider R.A. Zaharieva D. Ahmad F.U. Barrow D.L. Pradilla G. Sex differences in the formation of intracranial aneurysms and incidence and outcome of subarachnoid hemorrhage: review of Experimental and Human Studies Transl Stroke Res 7 1 2016 12 19 26573918 10.1007/s12975-015-0434-6 33 Lin C.L. Shih H.C. Dumont A.S. Kassell N.F. Lieu A.-S. Su Y.-F. The effect of 17beta-estradiol in attenuating experimental subarachnoid hemorrhage-induced cerebral vasospasm J Neurosurg 104 2 2006 298 304 10.3171/jns.2006.104.2.298 16509505 34 Friedrich V. Bederson J.B. Sehba F.A. Gender influences the initial impact of subarachnoid hemorrhage: an experimental investigation PLoS One 8 11 2013 e80101 10.1371/journal.pone.0080101 PMC3826711 24250830 35 Friedrich V. Bi W. Sehba F.A. Sexual dimorphism in gene expression after aneurysmal subarachnoid hemorrhage Neurol Res 37 12 2015 1054 1059 26923576 10.1080/01616412.2015.1115211 PMC4898884 36 Islam R. Choudhary H.H. Mehta H. Zhang F. Jovin T.G. Hanafy K.A. Development of a 3D brain model to study sex-specific neuroinflammation after hemorrhagic stroke Transl Stroke Res 16 3 2025 655 671 38558012 10.1007/s12975-024-01243-y PMC12045812 Appendix Supplementary materials  Image, application 1 Acknowledgements The authors thank all the members who participated in this study. Supplementary material associated with this article can be found, in the online version, at doi:10.1016/j.clinsp.2025.100778 ",
  "metadata": {
    "Title of this paper": "Development of a 3D brain model to study sex-specific neuroinflammation after hemorrhagic stroke",
    "Journal it was published in:": "Clinics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489826/"
  }
}