{
  "title": "Paper_1155",
  "abstract": "J Manag Care Spec Pharm J Manag Care Spec Pharm 4474 jmcsp jmcsp Journal of Managed Care & Specialty Pharmacy 2376-0540 2376-1032 Academy of Managed Care Pharmacy PMC12467765 PMC12467765.1 12467765 12467765 41004208 10.18553/jmcp.2025.31.10.982 1 Research Impact of copay maximizers on total patient liability among patients using specialty medicines Sheinson Daniel PhD Patel Achal PhD Wong William B. PharmD, MS Genentech, Inc., South San Francisco, CA AUTHOR CORRESPONDENCE: William B. Wong, 1.650.225.6294; wong.william@gene.com 10 2025 31 10 497622 982 990 01 10 2025 01 10 2025 27 09 2025 01 10 2025 Copyright © 2025, Academy of Managed Care Pharmacy. All rights reserved. 2025 BACKGROUND: Insurers increasingly use copay maximizer programs to control costs. Although these programs shield patients from out-of-pocket (OOP) exposure for drugs, the impact on OOP costs for other health care services is unknown. OBJECTIVE: To examine the impact of copay maximizer programs on overall patient liability for all health care services. METHODS: This retrospective analysis of pharmacy and medical claims from the IQVIA PharMetrics Plus database included patients who were required to have 3 or more prescriptions (for autoimmune, multiple sclerosis, or oral oncolytic drugs) in a calendar year between 2018 and 2022 and have been continuously enrolled in a commercial plan during that year. An algorithm was applied to identify patients with presumed exposure to a copay maximizer program within each calendar year. Patients with presumed exposure to a maximizer program in a given year and no exposure to a maximizer program in prior years were eligible for the maximizer cohort. Patients without presumed exposure to a maximizer program were eligible for the nonmaximizer cohort. Eligible patients were matched 1:1 for the study cohorts. The outcome of interest was the effect of copay maximizer programs on patient liability for other health care services (via a difference-in-difference [DiD]) approach using a generalized linear mixed-effects model). RESULTS: In total, 5,976 patients were included in the analysis. Assuming no change in total costs from baseline to follow-up, copay maximizer programs were associated with increased patient liability for other health care services. When patient liabilities for the maximizer drug in the baseline period were $125, there was no effect on patient liabilities for other health care services (DiD [95% CI] = 0.98 [0.71-1.37]), whereas at $4,000, there was a 51% increase in patient liabilities for other health care services (1.51 [1.17-1.95]). In scenario analyses for which total costs changed from baseline to follow-up, results were similar to the base case. In the patient subgroup with no other health care patient liability at baseline ($0), a greater proportion of those who participated in a copay maximizer program had some (>$0) patient liability for other health care services in the follow-up period, compared with patients who did not participate (94.3% vs 63.2%). CONCLUSIONS: Our results indicated that copay maximizer programs are associated with an increase in patient liability for other health care services, especially for patients who relied heavily on the maximizer drug to meet deductible requirements or OOP maximums. These findings should be factored into decisions and policies on implementing and regulating these programs. Plain language summary Drug companies and other organizations help patients to afford medications by covering their out-of-pocket (OOP) costs. However, some health insurances use copay maximizer programs, which do not allow this support to count toward a patient’s OOP costs. This study found that copay maximizer programs may increase what patients owe for their other health care services. Additionally, copay maximizer programs increase the number of patients who owe money and did not previously owe anything for their health care. Implications for managed care pharmacy This study offers supporting evidence on the impact that copay maximizer programs may have on patient liability beyond that of the drug subject to the maximizer program. The potential increase in patient liability with copay maximizer programs is an important consideration for patients and plan sponsors when evaluating the use of copay maximizers as part of their plans, as well as for policymakers considering the legislation regulating these programs. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Impact of copay maximizers on total patient liability among patients using specialty medicines",
    "Journal it was published in:": "Journal of Managed Care & Specialty Pharmacy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467765/"
  }
}