{
  "title": "Paper_1169",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467478 PMC12467478.1 12467478 12467478 41007783 10.3390/biomedicines13092223 biomedicines-13-02223 1 Article Use of 4-Nitroquinoline 1-Oxide (4NQO) in Dysplastic and Malignant Induction: In Vitro and In Vivo Studies https://orcid.org/0009-0001-7136-2370 Meneses Daniela Oliveira Methodology Validation Formal analysis Investigation Data curation Writing – original draft https://orcid.org/0000-0003-1735-8220 Souza Brunna da Silva Nobrega Methodology Validation Formal analysis Investigation Writing – original draft https://orcid.org/0000-0002-8338-3857 Dutra Mateus José Methodology Validation Formal analysis Investigation Writing – original draft Writing – review & editing https://orcid.org/0000-0002-3023-4620 Malta Isabella Souza Methodology Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Silva Bruna Oliveira Methodology Validation Formal analysis Investigation Writing – original draft Cançado Isis Moraes Methodology Validation Formal analysis Investigation Writing – original draft Conceição Nathan Stevan Cezar Methodology Validation Formal analysis Investigation Data curation Writing – original draft Lança Maria Leticia de Almeida https://orcid.org/0000-0003-4344-0578 de Vasconcellos Luana Marotta Reis Conceptualization Methodology Data curation Writing – review & editing Visualization Supervision Project administration https://orcid.org/0000-0003-2456-4516 Kaminagakura Estela Conceptualization Investigation Resources Data curation Writing – review & editing Visualization Supervision Project administration Funding acquisition * Ronsivalle Vincenzo Academic Editor Cicciu Marco Academic Editor Santonocito Simona Academic Editor Department of Bioscience and Oral Diagnosis, Institute of Science and Technology, São Paulo State University (UNESP), São José dos Campos 12245-000, São Paulo, Brazil; daniela.meneses@unesp.br brunna.nobrega@unesp.br mateusdutra2@hotmail.com isabella.malta@unesp.br bo.silva@unesp.br isis.moraes@unesp.br nathan.stevan@unesp.br leticia.lanaa@unesp.br luana.marotta@unesp.br * estela.tango@unesp.br 10 9 2025 9 2025 13 9 497614 2223 19 7 2025 29 8 2025 05 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Objectives: Materials and Methods: Results: Conclusions: carcinogenesis 4-nitroquinoline-1-oxide oral leukoplakia squamous cell carcinoma of the head and neck cell line Fundação de Amparo à Pesquisa do Estado de São Paulo—FAPESP 20/07375-3 We acknowledge the financial support from the Fundação de Amparo à Pesquisa do Estado de São Paulo—FAPESP for funding this project, process number 20/07375-3. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Oral leukoplakia (OL) is a predominantly white plaque of uncertain risk that excludes other known diseases or disorders not associated with increased cancer risk [ 1 2 2 3 4 5 6 6 The relationship between tobacco use and OSCC development is well-established [ 7 8 7 Understanding the initiation and progression of oral carcinogenesis is crucial for developing effective strategies to prevent the malignant transformation of OL into OSCC. To achieve this, studies must assess the relationship between cigarette consumption (both quantity and duration) and associated cytological and tissue changes. 4-nitroquinoline 1-oxide (4NQO) is a carcinogen used to induce oral carcinogenesis in mice, exhibiting up to 94% mutational similarity, as well as histological and progression similarities, to OSCC in humans [ 9 10 2. Materials and Methods 2.1. In Vitro Study 2.1.1. Selection of the Cell Line HaCat cell line (American Type Culture Collection, Manassas, VA, USA) of immortalized human keratinocyte was cultured in high-glucose DMEM (Nova Biotecnologia, Cotia, SP, Brazil), supplemented with 10% fetal bovine serum (Nova Biotecnologia, Cotia, SP, Brazil) and 1% antibiotic (penicillin–streptomycin amphotericin, Nova Biotecnologia, Cotia, SP, Brazil) at 37 °C and 5% CO 2 11 2.1.2. Induction of Malignancy and Cellular Dysplasia After reaching 90% confluence, 4NQO (Sigma-Aldrich, St. Louis, MO, USA) was diluted in culture medium at a concentration of 2.6 µM for malignant transformation (H-SCC) and at 1.3 µM for dysplastic transformation (H-DISP). The diluted solution was added for 1 h 30 min, once. After this period, the culture medium containing 4NQO was removed, and a fresh medium was added for cell recovery. These protocols were adapted from Crane et al. [ 12 The culture medium was replaced every two days until the cells reached confluence for collection for hematoxylin and eosin (H&E) staining and immunocytochemistry reactions. The cells were collected using a sterile cytobrush (PQF, Ciudad de México, Mexico) and smeared onto glass slides (Starfrost, Knittel Glass, Braunschweig, Germany), which were then fixed in 95% alcohol (Quimesp Química, Guarulhos, SP, Brazil) [ 13 2.1.3. H&E Staining The slides were washed with distilled water for 1 min, stained with H&E, and analyzed under conventional light microscopy. Cellular changes such as an increased nucleus/cytoplasm ratio, nuclear hyperchromatism, an increased number of mitoses, aberrant mitotic figures, and architectural changes were analyzed [ 6 2.1.4. Immunocytochemistry The silanized slides (Starfrost, Knittel Glass, Braunschweig, Germany) containing the fixed HaCat, H-DISP, and H-SCC cells in 95% alcohol underwent decreasing concentrations of alcohol baths for hydration. Antigen retrieval was performed by immersion in ethylenediaminetetraacetic acid (EDTA) solution (1 mM, pH 8.0) and incubated for 40 min in a water bath at 97 °C. Endogenous peroxidase blocking was performed with three baths of 20% hydrogen peroxide (Merck, Rio de Janeiro, RJ, Brazil) and methanol (Merck, Rio de Janeiro, RJ, Brazil) in a 1:1 ratio, with each bath lasting 10 min. Bovine serum albumin (BSA) (Sigma-Aldrich, St. Louis, MO, USA) was then used for blocking at a concentration of 0.1 g for 1 h. Ki-67 antibody incubation (Novus Biologicals, Centennial, CO, USA) was performed at a concentration of 1:1000 overnight. Signal amplification was performed with horseradish peroxidase (HRP) (Dako Cytomation, Glostrup, Denmark) for 30 min, staining was performed with diaminobenzidine (DAB) (Dako Cytomation, Glostrup, Denmark) for 3 min, and counterstaining with Harris’ hematoxylin was performed for 1 min. The slides were dehydrated with increasing concentrations of alcohol, and finally treated with two xylene baths before being mounted in a permanent medium. OSCC and fibrous hyperplasia cases were used as positive and negative controls in all reactions for Ki-67 [ 9 14 15 2.2. In Vivo Study 2.2.1. Ethical Considerations The handling of mice was conducted in accordance with the Ethical Principles for Animal Experimentation adopted by the National Council for the Control of Animal Experimentation (CONCEA) (ARRIVE Checklist), and approved by the Research Ethics Committee of the Institute of Science and Technology of São Paulo State University under protocol number 02/2021. 2.2.2. Sample Forty-five female C57BL/6J mice aged 4–6 weeks, weighing approximately 16–18 g, were used. The animals were obtained from the Animal Core Facility of UNESP. They had ad libitum access to water and feed. The environment was carefully monitored to maintain a temperature of around 20 °C and a humidity of 55%. 2.2.3. Group Division After 30 days of acclimatization to the environment, with daily cycles alternating between 12 h of light and 12 h of darkness, the experiments were initiated. The animals were divided into two test groups: the NQ group, composed of 20 animals that received 4NQO at a concentration of 50 µg/mL in their drinking water, and the CM group, composed of 20 animals that received 4NQO at a concentration of 100 µg/mL in their drinking water. The test groups were evaluated in four periods: 8, 12, 16, and 20 weeks ( Figure 1 11 2.2.4. Induction of OL and OSCC The induction of OL and OSCC was performed by exposing the animals to 4NQO (Sigma-Aldrich, St. Louis, MO, USA), which was diluted in propylene glycol at a concentration of 4 mg/mL (stock solution). The stock solution was diluted in autoclaved water to reach final concentrations of 50 µg/mL and 100 µg/mL, being prepared exclusively during reservoir changes performed twice a week. The 4NQO-containing water was protected from light [ 11 16 2.2.5. Sample Collection, Macroscopic Analysis, and Preparation After 8, 12, 16, and 20 weeks of exposure to 4NQO, the animals were euthanized ( Figure 1 2.2.6. Histological Analysis The obtained slides were evaluated by two independent researchers (M.J.D. and B.d.S.N.S.), and a third researcher (E.K.) was consulted in cases of discrepancy. Tissue changes were classified according to the World Health Organization (WHO) classification into mild dysplasia, severe dysplasia, and OSCC [ 6 2.2.7. Statistical Analysis The analysis under conventional light microscopy (Zeiss−Axioskop 40) was performed blindly. The KAPPA test was applied to assess the level of agreement between the evaluators of the classifications, resulting in 70.6%. In cases of disagreement, a discussion was held to determine the final qualitative results. 3. Results 3.1. In Vitro Study 3.1.1. Microscopic Analysis of Cultured Cells Cells that did not receive 4NQO did not show morphological or adhesion changes ( Figure 2 Figure 2 Figure 2 In the cells exposed to a 2.6 µM concentration of 4-NQO for the induction of malignant transformation, 7 days after single exposure to the carcinogen 4-NQO, few viable cells remained. The surviving cells exhibited morphological alterations (shown by the arrows) ( Figure 2 Figure 2 3.1.2. Hematoxylin and Eosin Analysis Cells that received no dose of 4NQO did not show hyperchromatism and architectural changes ( Figure 3 Figure 3 In the H-SCC group, conventional light microscopy also revealed significant morphological changes, such as increased cytoplasmic and nuclear size (shown by the long arrows), increased number of nucleoli, and binucleated and bizarre cells (shown by the short arrows). However, few cells survived ( Figure 3 3.1.3. Immunocytochemistry Analysis The cell proliferation index, investigated through nuclear Ki-67 staining, was low in HaCat cells ( Figure 3 Figure 3 Figure 3 3.2. In Vivo Study 3.2.1. Macroscopic Analysis Depapillation of the dorsal tongue (shown by the thin arrow) was observed in all groups (NQ and CM, 8, 12, 16, and 20 weeks), ( Figure 4 Figure 4 Figure 4 3.2.2. Histological Analysis The microscopic grades are summarized in Table 1 In the NQ8 group, four animals had mild to moderate dysplasia (80%) ( Figure 5 Figure 5 Figure 5 In the CM8 group, mild to moderate dysplasia was observed in all evaluated animals (100%) ( Figure 5 Figure 5 Figure 5 Figure 5 4. Discussion The development of experimental carcinogenesis models is essential for advancing the understanding of the biological mechanisms of OSCC and improving prevention, diagnosis, and treatment strategies. Experimental models allow investigation of the signaling pathways involved in malignant transformation, the development and validation of biomarkers, and the evaluation of new therapies [ 11 4NQO and 7,12-dimethylbenz[a]anthracene (DMBA) are widely used as carcinogenic agents in experimental models of oral carcinogenesis [ 8 17 18 18 4-NQO, a synthetic molecule derived from quinoline composed of two polar groups, is classified as a genotoxic substance that reacts with DNA, resulting in the formation of adducts in genetic material [ 19 20 21 8 10 8 10 22 10 In this study, 4NQO was selected due to its solubility in water, allowing for continuous and uniform administration. DMBA requires topical application, necessitating frequent handling and increasing the risk of carcinogen exposure [ 23 24 23 24 8 Macroscopic analysis revealed depapillation of the dorsal tongue in all groups. In the CM16 group, a nodule formed, whereas in the CM20 and NQ20 groups, white plaques were observed, consistent with Hawkins et al., who applied 4NQO (5 mg/mL in propylene glycol) topically three times per week for up to 16 weeks [ 25 25 26 We observed that the 50 µg/mL dose over 8 weeks resulted in mild to moderate dysplasia in 80% of the animals, making it a relevant dose for studying OL. After 12 weeks, animals receiving 50 µg/mL and 100 µg/mL presented varying degrees of OSCC and dysplasia. Ribeiro and Salvadori [ 27 28 For the 100 µg/mL concentration, our results showed a progressive development of dysplastic lesions over time, similar to the findings of Tan et al. [ 9 Our findings demonstrated that the administration of 50 µg/mL and 100 µg/mL of 4NQO in drinking water for 12 weeks resulted in the development of hyperplastic, dysplastic, and OSCC lesions. Similarly, exposure to 4NQO at concentrations of 20 µg/mL, 50 µg/mL, and 100 µg/mL for 8 to 16 weeks has been reported to induce these lesions [ 29 In vitro, we tested 1.3 µM and 2.6 µM concentrations of 4NQO to induce dysplastic and malignant transformation in normal keratinocyte cell lines, adapting the method from Crane et al. [ 12 30 31 31 Morphological alterations were more evident at a concentration of 2.6 µM, where a lack of cell anchorage was observed, making it difficult to accumulate some cells that received this concentration for certain experiments. However, it is worth noting that the loss of anchorage is indicative of malignant transformation [ 32 4-NQO can also be used to study the expression of cellular phenotypes in vitro in oral carcinogenesis, particularly when combined with in vivo studies [ 12 5. Conclusions A total of 100 µg/mL of 4NQO accelerates lesion progression, reducing the time required for tumor induction and minimizing the prolonged exposure of animals to the carcinogen. However, strict monitoring is necessary to prevent premature animal death. For in vitro studies, 4NQO is suitable for inducing dysplastic and malignant transformation in the HaCat cell line at doses of 1.3 µM and 2.6 µM, respectively. Acknowledgments We thank the Fundação de Amparo à Pesquisa do Estado de São Paulo − FAPESP for granting a scholarship to I.S.M., process number 23/03635-9; to B.O.S., process number 21/01065-5; to I.M.C., process number 21/12385-0; and to N.S.C.C., process number 21/01830-6. We thank the Coordenação de Aperfeiçoamento de Pessoal de Nível Superior—CAPES for granting scholarships to M.J.D. and M.L.d.A.L. We also acknowledge the Programa Institucional de Bolsas de Iniciação Científica − PIBIC for granting a scholarship to I.S.M., process number 16421/2024; D.O.M., process number 11602/2023; and to B.d.S.N.S., process number 5454 4/2022. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.J.D., M.L.d.A.L. and E.K.; methodology, M.J.D., M.L.d.A.L. and E.K.; formal analysis, D.O.M., B.d.S.N.S., M.J.D., I.S.M., B.O.S., I.M.C., N.S.C.C. and M.L.d.A.L.; investigation, M.J.D. and M.L.d.A.L.; data curation, E.K.; writing—original draft preparation, M.J.D. and D.O.M.; writing—review and editing, all authors; visualization, L.M.R.d.V. and E.K.; supervision, M.J.D., M.L.d.A.L. and E.K.; project administration, E.K.; funding acquisition, E.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The handling of mice was conducted in accordance with the Ethical Principles for Animal Experimentation adopted by the National Council for the Control of Animal Experimentation (CONCEA), and approved by the Research Ethics Committee of the Institute of Science and Technology of São Paulo State University under protocol number 02/2021, and approval was granted on 30 August 2021. Informed Consent Statement Not applicable. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors on request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Warnakulasuriya S. Johnson N.W. van der Waal I. Nomenclature and Classification of Potentially Malignant Disorders of the Oral Mucosa J. Oral Pathol. Med. 2007 36 575 580 10.1111/j.1600-0714.2007.00582.x 17944749 2. Warnakulasuriya S. Ariyawardana A. Malignant Transformation of Oral Leukoplakia: A Systematic Review of Observational Studies J. Oral Pathol. Med. 2016 45 155 166 10.1111/jop.12339 26189354 3. Dutra M.J. Alves Santos K. Adorno-Farias D. Anbinder A.L. Kaminagakura E. Leucoplasia verrugosa proliferativa simulando liquen plano oral: Reporte de caso y revisión de la literatura Odontoestomatologia 2023 25 e419 10.22592/ode2023n42e419 4. Chaturvedi A.K. Udaltsova N. Engels E.A. Katzel J.A. Yanik E.L. Katki H.A. Lingen M.W. Silverberg M.J. Oral Leukoplakia and Risk of Progression to Oral Cancer: A Population-Based Cohort Study J. Natl. Cancer Inst. 2020 112 1047 1054 10.1093/jnci/djz238 31860085 PMC7566351 5. Iocca O. Sollecito T.P. Alawi F. Weinstein G.S. Newman J.G. De Virgilio A. Di Maio P. Spriano G. Pardiñas López S. Shanti R.M. Potentially Malignant Disorders of the Oral Cavity and Oral Dysplasia: A Systematic Review and Meta-Analysis of Malignant Transformation Rate by Subtype Head Neck 2020 42 539 555 10.1002/hed.26006 31803979 6. WHO Classification of Tumours Editorial Board Head and Neck Tumours 5th ed. WHO Classification of Tumours Series International Agency for Research on Cancer Lyon, France 2022 Volume 9 7. Barsouk A. Aluru J.S. Rawla P. Saginala K. Barsouk A. Epidemiology, Risk Factors, and Prevention of Head and Neck Squamous Cell Carcinoma Med. Sci. 2023 11 42 10.3390/medsci11020042 PMC10304137 37367741 8. Kanojia D. Vaidya M.M. 4-Nitroquinoline-1-Oxide Induced Experimental Oral Carcinogenesis Oral Oncol. 2006 42 655 667 10.1016/j.oraloncology.2005.10.013 16448841 9. Tan M.T. Wu J.G. Callejas-Valera J.L. Schwarz R.A. Gillenwater A.M. Richards-Kortum R.R. Vigneswaran N. A PIK3CA Transgenic Mouse Model with Chemical Carcinogen Exposure Mimics Human Oral Tongue Tumorigenesis Int. J. Exp. Pathol. 2020 101 45 54 10.1111/iep.12347 32436348 PMC7306900 10. Wang Z. Wu V.H. Allevato M.M. Gilardi M. He Y. Callejas-Valera J.L. Vitale-Cross L. Martin D. Amornphimoltham P. McDermott J. Syngeneic Animal Models of Tobacco-Associated Oral Cancer Reveal the Activity of in Situ Anti-CTLA-4 Nat. Commun. 2019 10 5546 10.1038/s41467-019-13471-0 31804466 PMC6895221 11. Dutra M.J. Malta I.S. de Almeida Lança M.L. de Vasconcellos L.M.R. Adorno-Farias D. Jara J.A. Kaminagakura E. Effects of Artemisinin and Cisplatin on the Malignant Progression of Oral Leukoplakia—In vitro and in vivo study J. Cancer Res. Clin. Oncol. 2024 150 3901 3913 10.1007/s00432-024-05924-x 39154308 PMC11330948 12. Crane I.J. Luker J. de Gay L. Rice S.Q. Stone A. Scully C. Prime S.S. Transformation of Oral Keratinocytes In Vitro by 4-Nitroquinoline N-Oxide Carcinogenesis 1988 9 2251 2256 10.1093/carcin/9.12.2251 2461265 13. Oliveira Alves M.G. Carta C.F.L. Padín-Iruegas M.E. Pérez-Sayáns M. Suarez-Peñaranda J.M. Issa J.S. García-García A. Almeida J.D. Expression of ATP6V1C1 during Oral Carcinogenesis Biotech Histochem. 2016 91 263 268 10.3109/10520295.2016.1144078 26984774 14. Kaminagakura E. Bonan P.R.F. Lopes M.A. Almeida O.P. Cell Proliferation and p53 Expression in Pseudoepitheliomatous Hyperplasia of Oral Paracoccidioidomycosis Mycoses 2006 49 393 396 10.1111/j.1439-0507.2006.01263.x 16922791 15. Oliveira L.R. Ribeiro-Silva A. Prognostic Significance of Immunohistochemical Biomarkers in Oral Squamous Cell Carcinoma Int. J. Oral Maxillofac. Surg. 2011 40 298 307 10.1016/j.ijom.2010.12.003 21269808 16. Lança M.L.d.A. da Conceição N.S.C. Malta I.S. Meneses D.O. Almeida L.Y. Kaminagakura E. Chemopreventive Potential of Artemisinin and Rubus occidentalis in the Progression of Oral Leukoplakia to Oral Cancer: A Preclinical Murine Study Int. J. Mol. Sci. 2025 26 8120 10.3390/ijms26178120 40943044 PMC12428017 17. Bhattacharya P. Keating A.F. Ovarian Metabolism of Xenobiotics Exp. Biol. Med. 2011 236 765 771 10.1258/ebm.2011.011051 PMC3626270 21616964 18. Plante I. Dimethylbenz(a)anthracene-Induced Mammary Tumorigenesis in Mice Methods Cell Biol. 2021 163 21 44 10.1016/bs.mcb.2020.09.003 33785167 19. Nakahara W. Fukuoka F. Sugimura T. Carcinogenic Action of 4-Nitroquinoline-N-Oxide Gann 1957 48 129 137_3 13474141 20. Brüsehafer K. Manshian B.B. Doherty A.T. Zaïr Z.M. Johnson G.E. Doak S.H. Jenkins G.J. The Clastogenicity of 4NQO Is Cell-Type Dependent and Linked to Cytotoxicity, Length of Exposure and p53 Proficiency Mutagenesis 2016 31 171 180 10.1093/mutage/gev069 26362870 PMC4748179 21. Sahu S.R. Thakur S. Peroumal D. Utkalaja B.G. Dutta A. Kumari P. Subhadarsini I. Acharya N. 4-Nitroquinoline 1-Oxide Induces Immune Cells Death to Onset Early Immunosuppression During Oral Squamous Cell Carcinoma Development Front. Immunol. 2023 14 1274519 10.3389/fimmu.2023.1274519 37936711 PMC10626482 22. Nauta J.M. Roodenburg J.L. Nikkels P.G. Witjes M.J. Vermey A. Comparison of Epithelial Dysplasia—The 4NQO Rat Palate Model and Human Oral Mucosa Int. J. Oral Maxillofac. Surg. 1995 24 Pt 1 53 58 10.1016/S0901-5027(05)80857-4 7782642 23. MacDonald D.G. Comparison of Epithelial Dysplasia in Hamster Cheek Pouch Carcinogenesis and Human Oral Mucosa J. Oral Pathol. Med. 1981 10 186 191 10.1111/j.1600-0714.1981.tb01264.x 6798180 24. Gimenez-Conti I.B. Slaga T.J. The Hamster Cheek Pouch Carcinogenesis Model J. Cell. Biochem. 1993 53 83 90 10.1002/jcb.240531012 8412211 25. Hawkins B.L. Heniford B.W. Ackermann D.M. Leonberger M. Martinez S.A. Hendler F.J. 4NQO Carcinogenesis: A Mouse Model of Oral Cavity Squamous Cell Carcinoma Head Neck 1994 16 424 432 10.1002/hed.2880160506 7960739 26. Zigmundo G.C.O. Schuch L.F. Schmidt T.R. Silveira F.M. Martins M.A.T. Carrard V.C. Martins M.D. Wagner V.P. 4-Nitroquinoline-1-Oxide (4NQO) Induced Oral Carcinogenesis: A Systematic Literature Review Pathol. Res. Pract. 2022 236 153970 10.1016/j.prp.2022.153970 35709549 27. Ribeiro D.A. Salvadori D.M. Gingival Changes in Wistar Rats after Oral Treatment with 4-Nitroquinoline 1-Oxide Eur. J. Dent. 2007 1 152 157 10.1055/s-0039-1698331 19212559 PMC2638248 28. Hasina R. Martin L.E. Kasza K. Jones C.L. Jalil A. Lingen M.W. ABT-510 Is an Effective Chemopreventive Agent in the Mouse 4-Nitroquinoline 1-Oxide Model of Oral Carcinogenesis Cancer Prev. Res. (Phila) 2009 2 385 393 10.1158/1940-6207.CAPR-08-0211 19336725 PMC2702843 29. Tang X.H. Knudsen B. Bemis D. Tickoo S. Gudas L.J. Oral Cavity and Esophageal Carcinogenesis Modeled in Carcinogen-Treated Mice Clin. Cancer Res. 2004 10 Pt 1 301 313 10.1158/1078-0432.CCR-0999-3 14734483 30. Kartasova T. Cornelissen B.J. Belt P. van de Putte P. Effects of UV, 4-NQO and TPA on Gene Expression in Cultured Human Epidermal Keratinocytes Nucleic Acids Res. 1987 15 5945 5962 10.1093/nar/15.15.5945 2442723 PMC306060 31. Shishodia G. Toledo R.R.G. Rong X. Zimmerman E. Xiao A.Y. Harrison L. Nathan C.O. 4NQO Enhances Differential Activation of DNA Repair Proteins in HPV Positive and HPV Negative HNSCC Cells Oral Oncol. 2021 122 105578 10.1016/j.oraloncology.2021.105578 34695758 32. Rheinwald J.G. Beckett M.A. Defective Terminal Differentiation in Culture as a Consistent and Selectable Character of Malignant Human Keratinocytes Cell 1980 22 Pt 2 629 632 10.1016/0092-8674(80)90373-6 6160916 Figure 1 Euthanasia periods (E), performed after the start of 4NQO administration. Figure 2 Microscopic analysis of cultured cells, cytoplasmic morphological alterations are pointed by long arrows and nuclear alterations are shown by short arrows; asterisks represent growth-forming nodules. ( A B C D E F Figure 3 Microscopic analysis of cultured cells. ( A B B C D E F G H I Figure 4 Representative macroscopic photographs of the dorsal tongue of each group. ( A B C D E F G H Figure 5 Representative photomicrographs of histological slides from each group. ( A B C D E F G H biomedicines-13-02223-t001_Table 1 Table 1 Quantitative data of histological findings of the tongues, divided by experimental groups. Weeks Classification NQ n CM n 8 Without dysplasia 1 (20) - Mild/moderate dysplasia 4 (80) 5 (100) Severe dysplasia/carcinoma - - 12 Without dysplasia - - Mild/moderate dysplasia 5 (100) 4 (80) Severe dysplasia/carcinoma - 1 (20) 16 Without dysplasia - - Mild/moderate dysplasia 5 (100) 2 (40) Severe dysplasia/carcinoma - 3 (60) 20 Without dysplasia - - Mild/moderate dysplasia - - Severe dysplasia/carcinoma 5 (100) 5 (100) No dysplasia was found in the histological sections (100%) of the pure control (PC). The NQ group received 4NQO at a concentration of 50 µg/mL, and the CM group received the maximum concentration in our study, of 100 µg/mL, both offered in their drinking water. ",
  "metadata": {
    "Title of this paper": "Defective Terminal Differentiation in Culture as a Consistent and Selectable Character of Malignant Human Keratinocytes",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467478/"
  }
}