{
  "title": "Paper_410",
  "abstract": "pmc J Oral Microbiol J Oral Microbiol 1486 joralmicro Journal of Oral Microbiology 2000-2297 Taylor & Francis PMC12481529 PMC12481529.1 12481529 12481529 41036106 10.1080/20002297.2025.2564694 2564694 1 Version of Record Research Article Research Article Is Candida albicans X. WANG ET AL. JOURNAL OF ORAL MICROBIOLOGY https://orcid.org/0000-0003-4277-041X Wang Xu a b c  1 Data curation Methodology Software Writing – original draft Writing – review & editing Zhang Xinming a b c  1 Data curation Methodology Writing – review & editing Wu Shuangshuang a b Data curation Methodology Zhang Wenqing a b Data curation Methodology Yan Zhimin a b * Conceptualization Formal analysis Project administration Supervision Writing – review & editing a Department of Oral Medicine, Peking University School and Hospital of Stomatology Beijing China b National Center for Stomatology & National Clinical Research Center for Oral Diseases & National Engineering Research Center of Oral Biomaterials and Digital Medical Devices Beijing China c Central Laboratory, Peking University School and Hospital of Stomatology Beijing China CONTACT yzhimin96@163.com Department of Oral Medicine Beijing China  1 Contributed equally to this work. 29 9 2025 2025 17 1 476830 2564694 29 09 2025 01 10 2025 02 10 2025 5 6 2025 14 8 2025 8 9 2025 MPS 29 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT Background Candida albicans C. albicans C. albicans Objective This study aimed to explore the carcinogenic potential of C. albicans Methods Transcriptome sequencing (mRNAseq) and whole exome sequencing (WES) were performed to reveal the effects of long-term C. albicans C. albicans Results Long-term C. albicans Mki67 Kif11 Ccna2 Ckap2 Fos Ccnb1 P Candida C. albicans Conclusion C. albicans KEY FINDINGS C. albicans Chronic hyperplastic candidiasis exhibited single base substitution signatures similar to SBS5. C. albicans KEYWORDS Candida albicans genotoxicity inflammation somatic mutation oral cancer National Natural Science Foundation of China 82170967 Natural Science Foundation of Beijing Municipality 7252166 This research is supported by the Natural Science Foundation of Beijing Municipality (7252166), and National Natural Science Foundation of China (82170967). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Fungi, a group of eukaryotic organisms that can reside in human intestines, oral cavity, skin, and respiratory tract, have received significant attention in human cancer research recently [ 1 2 Candida 3 Aspergillus 4 Malassezia 5 Candida albicans C. albicans 6 Candida 7 C. albicans 8 9 C. albicans 10 Some clinical and epidemiological evidence indicates the possible role of C. albicans 11 12 C. albicans 13 Our previous studies demonstrated that C. albicans 14–16 C. albicans C. albicans Materials and methods Mice Experiments were carried out using 8-week-old C57BL/6 male mice. Animal procedures were approved by the Biomedical Ethics Committee of Peking University (LA2021388 and LA2023111). All mice were maintained under specific pathogen-free conditions and provided with water and a standard laboratory diet ad libitum C. albicans Mice were randomly placed into infection group (CA) and control group (CON) ( n C. albicans 15 Chemical stimulation plus C. albicans Mice were fed with 4-nitroquinoline 1-oxide (4NQO, a mutagenic substance that can induce DNA changes that mimic tobacco-induced molecular events [ 17 C. albicans ece1 18 15 In the experiment for exploring the role of STAT1 in C. albicans C. albicans Transcriptome analysis RNA sequencing (RNAseq) was performed by Novogene Bioinformatics Technology Co., Ltd (Beijing, China). Briefly, total RNA was extracted from tongue tissue of the mice. cDNA library was constructed using VAHTS Universal V6 RNA-seq Library Prep Kit for Illumina® (Vazyme, USA) and then sequenced with Illumina NovaSeq6000. The DESeq2 was used to analyze the differentially expressed genes with the following filter criteria: P C. albicans P C. albicans Hematoxylin and eosin and immunohistochemistry The tongue tissues were fixed in 4% paraformaldehyde for 24 h. After paraffin embedding, the tongue tissues were cut into 5 μm sections and stained with hematoxylin and eosin (H&E), Ki−67 (1:200, ab16667, Abcam) or γH2A.X (1:200, ab81299, Abcam). Images were taken using a fluorescence microscope (Olympus Co.). Patients The specimens and clinical information were obtained from the CHC patients in Department of Oral Medicine of Peking University School and Hospital of Stomatology. The diagnostic criteria of CHC refer to the previous studies [ 19 Whole exome sequencing The diseased CHC tissues (or mouse tissues) were rinsed with PBS and lysed in DNA extract buffer to extract the genomic DNA. Whole exome sequencing (WES) was performed by Novogene Bioinformatics Technology Co., Ltd (Beijing, China). Briefly, genomic DNA was fragmented into an average size of 180 to 280 bp and subjected to DNA library construction. The Illumina HiSeq PE150 platform (Illumina Inc., San Diego, CA, USA) was utilized for genomic DNA sequencing. As for the mouse tissues, the matched lamina propria tissue samples were utilized to generate the reference background used for somatic mutation calling. Then the somatic mutations in epithelium tissue were identified. The somatic SNV (Single nucleotide variants) was detected by MuTect [ 20 21 22 23 24 25 26 27 Cell lines and C. albicans Human oral mucosal epithelial cell line (Leuk-1) cells were cultured in RPMI-1640 medium (Gibco) supplemented with 10% fetal bovine serum (FBS) (HyClone) and 100 U/mL penicillin-streptomycin (Invitrogen). The Leuk-1 cells were co-cultured with C. albicans Immunofluorescence The cells were fixed with 4% paraformaldehyde for 30 min, and then treated with 1% Triton X−100 for 10 min. After blocked with 2% BSA, the cells were stained with γH2A.X (1:200, ab81299, Abcam). Brightfield and fluorescent images were taken using a fluorescence microscope (Olympus Co.). Western blotting Total proteins in cells were extracted by radioimmunoprecipitation buffer (RIPA lysis buffer, Thermo Fisher Scientific). The Western blotting experiment was performed according to the standard procedures. Primary antibody against γH2A.X (ab81299, Abcam) was used at a 1:1,000 dilution. Quantitative real-time PCR Total RNA was extracted and reverse-transcribed into cDNA with ABScript III Reverse Transcriptase (Abclonal). Amplification was performed in triplicate using Universal SYBR green Fast qPCR Mix (Abclonal). The relative gene expression of Ifng −ΔΔCt Gapdh Statistical analysis Data were analyzed using GraphPad Prism (version 8). Continuous variables between the two groups were compared using Student's two-tailed t P- Results Long-term stimulation of C. albicans induced an abnormal epithelial condition conducive to carcinogenesis An animal experiment was performed to investigate the effects of long-term stimulation of C. albicans C. albicans Figure 1A B C. albicans- Figure 1C C. albicans Figure 1D C. albicans Figure 1E F Figure 1. Long-term stimulation with C. albicans C. albicans In order to reveal the genetic changes occurring in the oral mucosa, mRNA-seq and WES were performed. The mRNAseq showed that genes involved in proliferation and cancer ( Mki67 Kif11 Ccna2 Ckap2 Fos Ccnb1 C. albicans Figure 2A C. albicans Figure 2B Figure 2. Long-term stimulation with C. albicans WES procedure identified genes with somatic SNVs in the oral epithelium, some of which were shared in the genes listed in COSMIC ( Figure 3A C. albicans In vitro C. albicans γ Figure 3B C γ C. albicans Figure 3D Figure 3. C. albicans C. albicans C. albicans C. albicans The above results indicate that C. albicans C. albicans CHC patients showed somatic mutations involved in cancer CHC, a subtype of oral candidiasis caused by the infection of Candida C. albicans C. albicans Figure 4A PCM1 SYNE1 TICAM1 KMT2B SRRM2 CASP8 Figure 4B ZFHX4 MUC5B DDX11 NPAP1 TCHH CASP8 RPGRIP1L AP5Z1 Figure 4C Figure 4D Figure 4E Figure 4F G Figure 4H Figure 4. Somatic mutational landscape of chronic hyperplastic candidiasis. (A) Patient characteristics. (B) Heat map of the known driver genes. (C) Heat map of the significantly mutated genes. (D) KEGG enrichment analysis of the significantly mutated genes. (E) Mutation spectrum of the single nucleotide variants (SNVs). (F) Mutation signatures of the SNVs. (G) Proportion of mutational signatures in different samples. (H) Cosine similarity of mutational signatures. The heatmap represents the cosine similarity between the three identified mutational signatures and 78 known mutational signatures ( http://cancer.sanger.ac.uk/cosmic/signatures C. albicans promoted the carcinogenesis in mice pre-treated with chemical stimulation Given SBS5's association with tobacco smoking in cancer patients [ 28 29 C. albicans C. albicans Figure 5A ece1 Figure 5B C C. albicans Figure 5D H2-Q4 H2-Q5 H2-Q6 H2-Q7 H2-T10 Cd6 Cd53 Ly6c1 Stat1 Cxcl10 Igtp Psmb9 Figure 5D Stat1 Figure 5E Ifng C. albicans Figure 5F C. albicans Figure 5G H ece1 Figure 5G Irf7 Cdk6 H2-T10 H2-T22 Figure 5. C. albicans Ifng Then, STAT1 inhibitor was used to demonstrate the role of STAT1 in C. albicans Figure 5I C. albicans C. albicans Figure 5J K The above results indicate that C. albicans C. albicans Discussion Whether C. albicans C. albicans C. albicans Figure 6A Candida C. albicans Figure 6B Figure 6. Candida albicans C. albicans C. albicans Infections caused by certain bacteria, virus, or parasites are strong risk factors for multiple types of cancer [ 30 C. albicans 2 3 C. albicans C. albicans 31 C. albicans DNA damage and gene mutations are the drivers of carcinogenesis [ 32 32 Escherichia coli Helicobacter pylori 33−35 C. albicans 36 10 ECE1 C. albicans 37 36 ece1 C. albicans C. albicans ece1 C. albicans . C. albicans SBS5 is thought to be associated with aging and tobacco smoking [ 29 28 28 C. albicans C. albicans 15 C. albicans C. albicans The JAK-STAT pathway is involved in the inflammatory, cancer, and many other biological processes [ 38 C. albicans STAT1 39 C. albicans γ 40 41 γ C. albicans C. albicans In summary, we revealed that C. albicans C. albicans C. albicans Supplementary Material Supplementary material Table S1 Table S2 Supplemental material Supplemental data for this article can be accessed at https://doi.org/10.1080/20002297.2025.2564694 Acknowledgements We sincerely appreciate prof. Bernhard Hube, prof. Bernd Schnabl, and prof. Huikuan Chu for their kind donation of ece1 Candida albicans. Figure 5A Figure 5I Figure 6 https://www.figdraw.com/ Author contributions Xu Wang and Xinming Zhang performed the animal and cytological experiments. Shuangshuang Wu and Wenqing Zhang collected the human tissues. Xu Wang analyzed the data and wrote the manuscript. Zhimin Yan designed and supervised the project and provided resources. All authors have given approval to the final version of the manuscript. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement Transcriptome sequencing datasets of the mice have been deposited in BioProject with the primary accession code PRJNA944155 and PRJNA1257003. Whole exome sequencing datasets are not publicly available due the patient privacy, but are available from the corresponding author on reasonable request. Ethics declaration The human study received approval from the Ethics Committee of Peking University School and Hospital of Stomatology (PKUSSIRB-202391126). Informed consent was obtained from all participants, and the privacy of each subject was carefully safeguarded. Animal study was approved by the Biomedical Ethics Committee of Peking University (LA2021388 and LA2023111). References [1] Galloway-Pena J Iliev ID Mcallister F Fungi in cancer Nat Rev Cancer 2024 24 5 295 298 10.1038/s41568-024-00665-y 38347100 PMC11648847 [2] Saftien A Puschhof J Elinav E Fungi and cancer Gut 2023 72 7 1410 1425 10.1136/gutjnl-2022-327952 37147013 [3] Dohlman AB Klug J Mesko M et al. A pan-cancer mycobiome analysis reveals fungal involvement in gastrointestinal and lung tumors Cell 2022 185 20 3807 3822 10.1016/j.cell.2022.09.015 36179671 PMC9564002 [4] Liu NN Yi CX Wei LQ et al. The intratumor mycobiome promotes lung cancer progression via myeloid-derived suppressor cells Cancer Cell 2023 41 11 1927 1944 10.1016/j.ccell.2023.08.012 37738973 [5] Aykut B Pushalkar S Chen R et al. The fungal mycobiome promotes pancreatic oncogenesis via activation of mbl Nature 2019 574 7777 264 267 10.1038/s41586-019-1608-2 31578522 PMC6858566 [6] Wang X Zhang W Wu W et al. Is candida albicans a contributor to cancer? A critical review based on the current evidence Microbiol Res 2023 272 127370 10.1016/j.micres.2023.127370 37028206 [7] Alnuaimi AD Wiesenfeld D O'Brien-Simpson NM et al. Oral candida colonization in oral cancer patients and its relationship with traditional risk factors of oral cancer: a matched case-control study Oral Oncol 2015 51 2 139 145 10.1016/j.oraloncology.2014.11.008 25498921 [8] Vadovics M Ho J Igaz N et al. Candida albicans enhances the progression of oral squamous cell carcinoma in vitro and in vivo mBio 2021 2022 13 1 e0314421 10.1128/mBio.03144-21 PMC8725587 35089096 [9] Lee CH Hung PF Liu KJ et al. Ldoc1 suppresses microbe-induced production of il-1beta in human normal and cancerous oral cells through the pi3k/akt/gsk-3beta axis Cancers 2020 12 11 3148 10.3390/cancers12113148 33120999 PMC7694066 [10] Ramirez-Garcia A Rementeria A Aguirre-Urizar JM et al Candida albicans and cancer: can this yeast induce cancer development or progression? Crit Rev Microbiol 2016 42 2 181 193 10.3109/1040841X.2014.913004 24963692 [11] Williamson DM Chronic hyperplastic candidiasis and squamous carcinoma Br J Dermatol 1969 81 2 125 127 10.1111/j.1365-2133.1969.tb15992.x 5767066 [12] Lorenzo-Pouso AI Perez-Jardon A Caponio V et al. Oral chronic hyperplastic candidiasis and its potential risk of malignant transformation: a systematic review and prevalence meta-analysis J Fungi 2022 8 10 1093 10.3390/jof8101093 PMC9604758 36294658 [13] Hsia CC Sun TT Wang YY et al. Enhancement of formation of the esophageal carcinogen benzylmethylnitrosamine from its precursors by candida albicans Proc Natl Acad Sci USA 1981 78 3 1878 1881 10.1073/pnas.78.3.1878 7015348 PMC319238 [14] Wang X Xu T Wu S et al. Candida albicans-myeloid cells-t lymphocytes axis in the tumor microenvironment of oral tumor-bearing mice Cancer Lett 2024 588 216814 10.1016/j.canlet.2024.216814 38499264 [15] Wang X Wu S Wu W et al. Candida albicans promotes oral cancer via il-17a/il-17ra-macrophage axis mBio 2023 14 3 e0044723 10.1128/mbio.00447-23 37067414 PMC10294694 [16] Wang X Zhang X Wu S et al. Candida albicans overgrowth impairs anti-pd-1 immunotherapy in oral tumor-bearing mice hLife 2025 3 8 407 409 10.1016/j.hlife.2024.12.004 [17] Zigmundo G Schuch LF Schmidt TR et al. Nitroquinoline-1-oxide (4nqo) induced oral carcinogenesis: a systematic literature review Pathol Res Pract 2022 236 153970 10.1016/j.prp.2022.153970 35709549 [18] Chu H Duan Y Lang S et al. The candida albicans exotoxin candidalysin promotes alcohol-associated liver disease J Hepatol 2020 72 3 391 400 10.1016/j.jhep.2019.09.029 31606552 PMC7031049 [19] Zhang W Wu S Wang X et al. Malignant transformation and treatment recommendations of chronic hyperplastic candidiasis-a six-year retrospective cohort study Mycoses 2021 64 11 1422 1428 10.1111/myc.13371 34553417 [20] Cibulskis K Lawrence MS Carter SL et al. Sensitive detection of somatic point mutations in impure and heterogeneous cancer samples Nat Biotechnol 2013 31 3 213 219 10.1038/nbt.2514 23396013 PMC3833702 [21] Saunders CT Wong WS Swamy S et al. Strelka: accurate somatic small-variant calling from sequenced tumor-normal sample pairs Bioinformatics 2012 28 14 1811 1817 10.1093/bioinformatics/bts271 22581179 [22] Alexandrov LB Nik-Zainal S Wedge DC et al. Deciphering signatures of mutational processes operative in human cancer Cell Rep 2013 3 1 246 259 10.1016/j.celrep.2012.12.008 23318258 PMC3588146 [23] Tate JG Bamford S Jubb HC et al. Cosmic: the catalogue of somatic mutations in cancer Nucleic Acids Res 2019 47 D1 D941 D947 10.1093/nar/gky1015 30371878 PMC6323903 [24] Vogelstein B Papadopoulos N Velculescu VE et al. Cancer genome landscapes Science 2013 339 6127 1546 1558 10.1126/science.1235122 23539594 PMC3749880 [25] Kandoth C Mclellan MD Vandin F et al. Mutational landscape and significance across 12 major cancer types Nature 2013 502 7471 333 339 10.1038/nature12634 24132290 PMC3927368 [26] Tamborero D Gonzalez-Perez A Perez-Llamas C et al. Comprehensive identification of mutational cancer driver genes across 12 tumor types Sci Rep 2013 3 2650 10.1038/srep02650 24084849 PMC3788361 [27] Wendl MC Wallis JW Lin L et al. Pathscan: a tool for discerning mutational significance in groups of putative cancer genes Bioinformatics 2011 27 12 1595 1602 10.1093/bioinformatics/btr193 21498403 PMC3106187 [28] Alexandrov LB Ju YS Haase K et al. Mutational signatures associated with tobacco smoking in human cancer Science 2016 354 6312 618 622 10.1126/science.aag0299 27811275 PMC6141049 [29] Alexandrov LB Nik-Zainal S Wedge DC et al. Signatures of mutational processes in human cancer Nature 2013 500 7463 415 421 10.1038/nature12477 23945592 PMC3776390 [30] Plummer M de Martel C Vignat J et al. Global burden of cancers attributable to infections in 2012: a synthetic analysis Lancet Glob Health 2016 4 9 e609 e616 10.1016/S2214-109X(16)30143-7 27470177 [31] Hanahan D Weinberg RA Hallmarks of cancer: the next generation Cell 2011 144 5 646 674 10.1016/j.cell.2011.02.013 21376230 [32] Basu AK Dna damage, mutagenesis and cancer Int J Mol Sci 2018 19 4 970 10.3390/ijms19040970 29570697 PMC5979367 [33] Liu Y Fu K Wier EM et al. Bacterial genotoxin accelerates transient infection-driven murine colon tumorigenesis Cancer Discov 2022 12 1 236 249 10.1158/2159-8290.CD-21-0912 34479870 PMC8758537 [34] Pleguezuelos-Manzano C Puschhof J Rosendahl HA et al. Mutational signature in colorectal cancer caused by genotoxic pks(+) E. coli Nature 2020 580 7802 269 273 10.1038/s41586-020-2080-8 32106218 PMC8142898 [35] Koeppel M Garcia-Alcalde F Glowinski F et al. Helicobacter pylori infection causes characteristic dna damage patterns in human cells Cell Rep 2015 11 11 1703 1713 10.1016/j.celrep.2015.05.030 26074077 [36] Zhang TY Chen YQ Tan JC et al. Global fungal-host interactome mapping identifies host targets of candidalysin Nat Commun 2024 15 1 1757 10.1038/s41467-024-46141-x 38413612 PMC10899660 [37] Moyes DL Wilson D Richardson JP et al. Candidalysin is a fungal peptide toxin critical for mucosal infection Nature 2016 532 7597 64 68 10.1038/nature17625 27027296 PMC4851236 [38] Philips RL Wang Y Cheon H et al. The jak-stat pathway at 30: much learned, much more to do Cell 2022 185 21 3857 3876 10.1016/j.cell.2022.09.023 36240739 PMC9815833 [39] Okada S Asano T Moriya K et al. Human stat1 gain-of-function heterozygous mutations: chronic mucocutaneous candidiasis and type i interferonopathy J Clin Immunol 2020 40 8 1065 1081 10.1007/s10875-020-00847-x 32852681 PMC8561788 [40] Hu X Ivashkiv LB Cross-regulation of signaling pathways by interferon-gamma: implications for immune responses and autoimmune diseases Immunity 2009 31 4 539 550 10.1016/j.immuni.2009.09.002 19833085 PMC2774226 [41] Dubrot J Du PP Lane-Reticker SK et al. In vivo crispr screens reveal the landscape of immune evasion pathways across cancer Nat Immunol 2022 23 10 1495 1506 10.1038/s41590-022-01315-x 36151395 ",
  "metadata": {
    "Title of this paper": "In vivo crispr screens reveal the landscape of immune evasion pathways across cancer",
    "Journal it was published in:": "Journal of Oral Microbiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481529/"
  }
}