{
  "title": "Paper_782",
  "abstract": "pmc Pathogens Pathogens 2622 pathogens pathogens Pathogens 2076-0817 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473126 PMC12473126.1 12473126 12473126 41011776 10.3390/pathogens14090876 pathogens-14-00876 1 Article Encapsulation of Disease-Causing and Commensal Mitis Group Non-Pneumococcal Streptococci https://orcid.org/0000-0002-7571-066X Musher Daniel M. Conceptualization Methodology Writing – original draft Writing – review & editing Supervision 1 2 * https://orcid.org/0000-0002-5624-1378 Müsken Mathias Methodology Investigation Writing – review & editing 3 Hicks M. John Formal analysis Data curation Writing – review & editing 2 4 McGee Lesley Methodology Investigation Writing – review & editing 5 https://orcid.org/0000-0001-5315-1070 Beall Bernard Software Data curation Writing – review & editing 5 1 2 mjhicks@texaschildrenshospital.org 3 mathias.muesken@helmholtz-hzi.de 4 5 lmcgee@cdc.gov beb0@cdc.gov * daniel.musher@va.gov 02 9 2025 9 2025 14 9 497659 876 21 6 2025 15 8 2025 19 8 2025 02 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Streptococcus mitis Streptococcus infantis Streptococcus oralis cps cps Methods Results Streptococcus pneumoniae Streptococcus oralis Conclusions Streptococcus pneumoniae Streptococcus mitis viridans streptococci community acquired pneumonia commensal bacteria capsules This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Streptococcus pneumoniae Streptococcus mitis 1 S. pneumoniae 2 3 Quellung 2 4 5 Streptococcus mitis Streptococcus infantis Streptococcus oralis 6 7 8 9 10 It is unclear what factor (s) might render these so-called commensal streptococci [ 4 5 Quellung 11 12 13 14 15 16 S. mitis S. oralis S. infantis cps 4 11 12 13 14 17 18 19 Streptococcus pneumoniae 20 2. Methods 2.1. Organisms Twenty-one MGNPS were assigned species employing core genome phylogeny as previously described by investigators at the Streptococcus Laboratory, Respiratory Diseases Branch, Division of Bacterial Diseases, Centers for Disease Control and Prevention (Atlanta, GA, USA) [ 15 S. mitis S. infantis S. oralis. 10 6 8 21 2.2. Electron Microscopy Bacteria were cultured on sheep blood agar, and colonies were fixed in glutaraldehyde, embedded in plastic, and then sectioned with an ultramicrotome. Specimens were initially stained with uranyl acetate and lead citrate and examined using transmission electron microscopy. Additionally, specimens were re-examined by the LRR fixation method described by Hammerschmidt and Rohde [ 20 22 Streptococcus pneumoniae 2.3. Research and Publication Ethics Review of medical records of patients discharged with a diagnosis of community acquired pneumonia without consent forms is approved by the IRB at Baylor College of Medicine (Protocol H-19318, Community-Acquired Pneumonia Quality Assurance Registry), expiration date 19 April 2026. This research involved the use of discarded samples from the Clinical Microbiology Laboratory at the Michael E. DeBakey VA Medical Center; this work is approved by the IRB at Baylor College of Medicine under Protocol H-0006, Infectious Disease Research Laboratory. 3. Results 3.1. Molecular and Genetic Characterization All MGNPS isolates studied had recognizable cps wzg wzh wzd wze cps S. infantis S. mitis wzy35C wzy5 wzy5 Quellung ply ply ply. 3.2. Electron Microscopy Examination by transmission electronic microscopy following a standard fixation protocol and staining with uranyl acetate failed to identify recognizable capsule in any of the 14 isolates of S. mitis S. oralis S. infantis S. mitis Figure 1 Streptococcus pneumoniae Figure 1 In contrast, an electron microscopic study after a stepwise fixation protocol including ruthenium red and lysine acetate revealed capsular material in every MGNPS isolate examined ( Figure 2 S. pneumoniae Figure 2 S. mitis Figure 2 S. infantis , S. oralis Figure 2 S. oralis Figure 2 S. mitis S. pneumoniae Figure 2 S. infantis S. pneumoniae S. infantis Figure 3 4. Discussion Our recent study that implicated MGNPS as a cause of nearly 20% of cases of community-acquired pneumonia [ 10 Quellung 22 17 18 cps 4 12 13 14 22 Figure 1 20 Streptococcus pneumoniae 20 Acinetobacter baumannii 23 The thickness and density of capsular material appeared to be related to streptococcal species but not specifically to the commensal (colonizing) or disease-causing status of the organism. S. mitis S. pneumoniae S. infantis S. oralis S. mitis S. pneumoniae 18 The presence of a capsule is the principal factor that enables S. pneumoniae 24 11 14 17 12 13 14 15 25 Colonization by S. pneumoniae 26 27 28 Regarding other virulence factors, neumolysin, a conserved toxin common to all S. pneumoniae 29 30 6 S. mitis ply ply S. mitis S. pneumoniae ply The lack of difference in capsule between commensal and infecting strains is consistent with the recent report by Kalizang’oma [ 31 S. mitis 10 S. pneumoniae 32 33 4 5 In conclusion, our findings, albeit based on a small sample, suggest that many MGNPS, whether colonizing or disease-causing, are encapsulated. Streptococcus mitis Streptococcus pneumoniae, Acknowledgments We thank Ina Brentrop, Katherine Kelley, Tony Sher, and Lillian Delgado for preparing samples for electron microscopy. Musher’s laboratory is supported by the United States Department of Veteran Affairs. Views expressed herein do not reflect the views of the Department of Veterans Affairs. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.M.M.; methodology, D.M.M., B.B., M.M. and L.M.; software, B.B.; formal analysis, M.J.H. and M.M.; investigation, D.M.M., M.J.H., M.M., B.B. and L.M.; data curation, M.J.H. and B.B.; writing—original draft, D.M.M.; writing—review and editing, D.M.M., M.M., M.J.H., L.M. and B.B.; supervision, D.M.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was approved by the Institutional Review Board, Baylor College of Medicine (protocol code: H-19318; approved 31 August 2021). Informed Consent Statement Review of medical records of patients discharged with a diagnosis of community acquired pneumonia without consent forms is approved by the IRB at Baylor College of Medicine (Protocol H-19318, Community-acquired Pneumonia Quality Assurance Registry). Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflict of interest. References 1. Kilian M. Tettelin H. Identification of Virulence-Associated Properties by Comparative Genome Analysis of Streptococcus pneumoniae S. pseudopneumoniae S. mitis S. oralis S. infantis mBio 2019 10 e01985-19 10.1128/mBio.01985-19 31481387 PMC6722419 2. Heffron R. Pneumonia with Special Reference to Pneumococcus Lobar Pneumonia The Commonwealth Fund New York, NY, USA 1939 3. Watson D.A. Musher D.M. Jacobson J.W. Verhoef J. A brief history of the pneumococcus in biomedical research: A panoply of scientific discovery Clin. Infect. Dis. 1993 17 913 924 10.1093/clinids/17.5.913 8286641 4. Denapaite D. Bruckner R. Nuhn M. Reichmann P. Henrich B. Maurer P. Schahle Y. Selbmann P. Zimmermann W. Wambutt R. The genome of Streptococcus mitis PLoS ONE 2010 5 e9426 10.1371/journal.pone.0009426 20195536 PMC2828477 5. Mitchell J. Streptococcus mitis Mol. Oral Microbiol. 2011 26 89 98 10.1111/j.2041-1014.2010.00601.x 21375700 6. Han X.Y. Kamana M. Rolston K.V. Viridans streptococci isolated by culture from blood of cancer patients: Clinical and microbiologic analysis of 50 cases J. Clin. Microbiol. 2006 44 160 165 10.1128/JCM.44.1.160-165.2006 16390964 PMC1351950 7. Bochud P.Y. Calandra T. Francioli P. Bacteremia due to viridans streptococci in neutropenic patients: A review Am. J. Med. 1994 97 256 264 10.1016/0002-9343(94)90009-4 8092175 8. Shelburne S.A. Sahasrabhojane P. Saldana M. Yao H. Su X. Horstmann N. Thompson E. Flores A.R. Streptococcus mitis Emerg. Infect. Dis. 2014 20 762 771 10.3201/eid2005.130953 24750901 PMC4012796 9. Monk M. Patel N.R. Elshaboury R. Kubiak D.W. Hammond S.P. Risk of Infective Endocarditis in Streptococcus mitis Open Forum Infect. Dis. 2024 11 ofae063 10.1093/ofid/ofae063 38449919 PMC10917222 10. Musher D.M. Jesudasen S.S. Barwatt J.W. Cohen D.N. Moss B.J. Rodriguez-Barradas M.C. Normal Respiratory Flora as a Cause of Community-Acquired Pneumonia Open Forum Infect. Dis. 2020 7 ofaa307 10.1093/ofid/ofaa307 32968689 PMC7491709 11. Rukke H.V. Kalluru R.S. Repnik U. Gerlini A. Jose R.J. Periselneris J. Marshall H. Griffiths G. Oggioni M.R. Brown J.S. Protective role of the capsule and impact of serotype 4 switching on Streptococcus mitis Infect. Immun. 2014 82 3790 3801 10.1128/IAI.01840-14 24958712 PMC4187822 12. Skov Sorensen U.B. Yao K. Yang Y. Tettelin H. Kilian M. Capsular Polysaccharide Expression in Commensal Streptococcus Species: Genetic and Antigenic Similarities to Streptococcus pneumoniae mBio 2016 7 e01844-16 10.1128/mBio.01844-16 27935839 PMC5111408 13. Lessa F.C. Milucky J. Rouphael N.G. Bennett N.M. Talbot H.K. Harrison L.H. Farley M.M. Walston J. Pimenta F. Gertz R.E. Streptococcus mitis Sci. Rep. 2018 8 17959 10.1038/s41598-018-35921-3 30568178 PMC6299277 14. Pimenta F. Gertz R.E. Jr. Park S.H. Kim E. Moura I. Milucky J. Rouphael N. Farley M.M. Harrison L.H. Bennett N.M. Streptococcus infantis Streptococcus mitis Streptococcus oralis Front. Microbiol. 2018 9 3199 10.3389/fmicb.2018.03199 30671034 PMC6332807 15. Gertz R.E. Jr. Pimenta F.C. Chochua S. Larson S. Venero A.K. Bigogo G. Milucky J. Carvalho M.D.G. Beall B. Nonpneumococcal strains recently recovered from carriage specimens and expressing capsular serotypes highly related or Identical to pneumococcal serotypes 2, 4, 9A, 13, and 23A mBio 2021 12 e01037-21 10.1128/mBio.01037-21 34006665 PMC8262907 16. Chang B. Morita M. Nariai A. Kasahara K. Kakutani A. Ogawa M. Ohnishi M. Oishi K. Invasive Streptococcus oralis Emerg. Infect. Dis. 2022 28 1720 1722 10.3201/eid2808.212176 35876607 PMC9328907 17. Rukke H.V. Hegna I.K. Petersen F.C. Identification of a functional capsule locus in Streptococcus mitis Mol. Oral Microbiol. 2012 27 95 108 10.1111/j.2041-1014.2011.00635.x 22394468 18. Marshall H. Aguayo S. Kilian M. Petersen F. Bozec L. Brown J. In Vivo Relationship between the Nano-Biomechanical Properties of Streptococcal Polysaccharide Capsules and Virulence Phenotype ACS Nano 2020 14 1070 1083 10.1021/acsnano.9b08631 31854972 19. Ganaie F.A. Beall B.W. Yu J. van der Linden M. McGee L. Satzke C. Manna S. Lo S.W. Bentley S.D. Ravenscroft N. Update on the evolving landscape of pneumococcal capsule types: New discoveries and way forward Clin. Microbiol. Rev. 2025 38 e0017524 10.1128/cmr.00175-24 39878373 PMC11905375 20. Hammerschmidt S. Rohde M. Electron Microscopy to Study the Fine Structure of the Pneumococcal Cell Methods Mol. Biol. 2019 1968 13 33 10.1007/978-1-4939-9199-0_2 30929202 21. Metcalf B.J. Gertz R.E. Jr. Gladstone R.A. Walker H. Sherwood L.K. Jackson D. Li Z. Law C. Hawkins P.A. Chochua S. Strain features and distributions in pneumococci from children with invasive disease before and after 13-valent conjugate vaccine implementation in the USA Clin. Microbiol. Infect. 2016 22 60.e9 60.e29 10.1016/j.cmi.2015.08.027 PMC4721534 26363404 22. Sheppard C.L. Kapatai G. Broughton K. Schaefer U. Hannah M. Litt D.J. Fry N.K. Clinical streptococcal isolates, distinct from Streptococcus pneumoniae PeerJ 2017 5 e3571 10.7717/peerj.3571 28729954 PMC5518733 23. Chin C.Y. Tipton K.A. Farokhyfar M. Burd E.M. Weiss D.S. Rather P.N. A high-frequency phenotypic switch links bacterial virulence and environmental survival in Acinetobacter baumannii Nat. Microbiol. 2018 3 563 569 10.1038/s41564-018-0151-5 29693659 PMC5921939 24. Gray B.M. Musher D.M. The history of pneumococcal disease Pneumococcal Vaccines: The Impact of Conjugate Vaccine Siber G.R. Klugman K.P. Makela P. ASM Press Washington, DC, USA 2008 3 17 25. Carvalho Mda G. Pimenta F.C. Moura I. Roundtree A. Gertz R.E. Jr. Li Z. Jagero G. Bigogo G. Junghae M. Conklin L. Non-pneumococcal mitis-group streptococci confound detection of pneumococcal capsular serotype-specific loci in upper respiratory tract PeerJ 2013 1 e97 10.7717/peerj.97 23825797 PMC3698467 26. Gray B.M. Converse G.M. 3rd Dillon H.C. Jr. Epidemiologic studies of Streptococcus pneumoniae J. Infect. Dis. 1980 142 923 933 10.1093/infdis/142.6.923 7462701 27. Musher D.M. Groover J.E. Reichler M.R. Reido F.X. Schwartz B. Watson D.A. Baughn R.E. Breiman R. Emergence of antibody to capsular polysaaccharides of Streptococcus pneumoniae Clin. Infect. Dis. 1997 24 441 446 10.1093/clinids/24.3.441 9114197 28. Shekhar S. Khan R. Schenck K. Petersen F.C. Intranasal Immunization with the Commensal Streptococcus mitis Appl. Environ. Microbiol. 2019 85 e02235-18 10.1128/AEM.02235-18 30683742 PMC6414371 29. Feldman C. Munro N.C. Jeffery P.K. Mitchell T.J. Andrew P.W. Boulnois G.J. Guerreiro D. Rohde J.A. Todd H.C. Cole P.J. Pneumolysin induces the salient histologic features of pneumococcal infection in the rat lung in vivo Am. J. Respir. Cell Mol. Biol. 1991 5 416 423 10.1165/ajrcmb/5.5.416 1834101 30. Alexander J.E. Lock R.A. Peeters C.C. Poolman J.T. Andrew P.W. Mitchell T.J. Hansman D. Paton J.C. Immunization of mice with pneumolysin toxoid confers a significant degree of protection against at least nine serotypes of Streptococcus pneumoniae Infect. Immun. 1994 62 5683 5688 10.1128/iai.62.12.5683-5688.1994 7960154 PMC303321 31. Kalizang’oma A. Richard D. Kwambana-Adams B. Coelho J. Broughton K. Pichon B. Hopkins K.L. Chalker V. Beleza S. Bentley S.D. Population genomics of Streptococcus mitis Nat. Commun. 2024 15 7812 10.1038/s41467-024-52120-z 39242612 PMC11379897 32. Musher D.M. Alexandraki I. Graviss E.A. Yanbeiy N. Eid A. Inderias L.A. Phan H.M. Solomon E. Bacteremic and nonbacteremic pneumococcal pneumonia. A prospective study Medicine 2000 79 210 221 10.1097/00005792-200007000-00002 10941350 33. Lu Y.J. Forte S. Thompson C.M. Anderson P.W. Malley R. Protection against Pneumococcal colonization and fatal pneumonia by a trivalent conjugate of a fusion protein with the cell wall polysaccharide Infect. Immun. 2009 77 2076 2083 10.1128/IAI.01554-08 19255193 PMC2681726 Figure 1 Transmission electron microscopy images after standard fixation protocol. ( A Streptococcus mitis B S. pneumoniae Figure 2 Transmission electron microscopy images after ruthenium red/lysine acetate fixation protocol. ( A S. pneumoniae B S. mitis C S. mitis D S. oralis E S. oralis F S. mitis S. pneumoniae Figure 3 Streptococcus infantis Streptococcus infantis S. pneumoniae ",
  "metadata": {
    "Title of this paper": "Protection against Pneumococcal colonization and fatal pneumonia by a trivalent conjugate of a fusion protein with the cell wall polysaccharide",
    "Journal it was published in:": "Pathogens",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473126/"
  }
}