{
  "title": "Paper_382",
  "abstract": "pmc J Transl Autoimmun J Transl Autoimmun 3902 jtauto Journal of Translational Autoimmunity 2589-9090 Elsevier PMC12482344 PMC12482344.1 12482344 12482344 41036443 10.1016/j.jtauto.2025.100316 S2589-9090(25)00051-6 100316 1 Review article Short-chain fatty acids from gut microbiota restore Th17/Treg balance in rheumatoid arthritis: Mechanisms and therapeutic potential Pang Aimei a Pu Shuangshuang a Pan Yinghui b Huang Ning a Li Dake ldk001510@163.com c ⁎ a b c ⁎ ldk001510@163.com 12 2025 16 9 2025 11 490815 100316 22 7 2025 31 8 2025 14 9 2025 16 09 2025 01 10 2025 02 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Rheumatoid arthritis (RA) is a chronic autoimmune disorder characterized by synovial inflammation and joint destruction. Dysregulation of the Th17/Treg balance is a key immunological hallmark of RA. Emerging evidence highlights the critical role of gut microbiota-derived short-chain fatty acids (SCFAs) in maintaining immune homeostasis. This review systematically elucidates how SCFAs modulate the Th17/Treg equilibrium through three synergistic mechanisms: (1) metabolic reprogramming via AMPK/mTOR signaling, (2) epigenetic regulation by inhibiting HDAC, and (3) modulation of cytokine cascades. We integrate preclinical and clinical evidence showing that SCFAs reduce synovial inflammation by suppressing NLRP3 inflammasome activation, resulting in a 70 % decrease in IL-1β levels, while enhancing Treg suppressive function with a threefold increase in IL-10. Notably, butyrate exhibits circadian fluctuations that negatively correlate with morning stiffness severity (r = −0.82, p < 0.01), suggesting novel chronotherapeutic opportunities. Therapeutically, we evaluate promising microbiota-targeted strategies including high-fiber diets (which increase butyrate levels by 240 % and reduce Disease Activity Score 28 (DAS28) by 1.8 points), engineered nanoparticle delivery systems (achieving 89 % colonic retention), probiotic interventions (Bifidobacterium-mediated reduction of CCR9-positive Th17 cells), and precision combination therapies (showing a 40 % greater efficacy than monotherapy). Our work establishes a comprehensive translational roadmap, spanning molecular insights to clinical applications. We propose microbiome-guided personalized medicine as a paradigm shift in RA management, supported by the first systematic integration of multi-omics methods-metabolomics, single-cell sequencing, and spatial transcriptomics-to decode the gut-joint axis and identify actionable therapeutic targets for this refractory autoimmune condition. Keywords Short-chain fatty acids Rheumatoid arthritis Th17/Treg balance Gut-joint axis Microbiome-guided therapy Multi-omics pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Handling Editor: Dr Y. Renaudineau 1 Introduction Rheumatoid arthritis (RA) is a chronic autoimmune disorder characterized by synovial inflammation, joint pain, and bone erosion, It severely impairs patients' quality of life. The pathogenesis of RA involves a complex interplay of genetic susceptibility, environmental triggers, and dysregulated immune responses. Central to this dysregulation is the imbalance between pro-inflammatory T helper 17 (Th17) cells and anti-inflammatory regulatory T (Treg) cells [ 1 2 3 4 Emerging evidence has profoundly implicated the gut microbiota as a key environmental factor modulating systemic immunity and RA susceptibility. The human gut harbors a complex ecosystem of trillions of microorganisms that perform essential functions, including nutrient metabolism, vitamin synthesis, and, crucially, the education and regulation of the host immune system. A state of microbial imbalance, or dysbiosis, observed in RA patients, is characterized by a reduction in microbial diversity and a decline in beneficial, short-chain fatty acid (SCFA)-producing bacteria. This dysbiosis can lead to impaired intestinal barrier integrity (leaky gut), facilitating the translocation of microbial products and promoting systemic inflammation and autoantibody production. This bidirectional communication between the gut microbiota and the joints is formalized conceptually as the gut-joint axis [ 5 6 Microbial metabolites, particularly SCFAs (acetate, propionate, and butyrate) produced from the dietary fiber fermentation, are critical mediators along this axis [ 7 8 9 10 RA treatment has traditionally utilized biologic agents, including TNF-α inhibitors and IL-6 receptor antagonists [ 11 Unlike previous reviews focusing solely on SCFAs' immunomodulatory properties, this study uniquely integrates three innovative dimensions. First, it offers a spatiotemporal perspective on the gut-joint axis, clarifying how microbial metabolites dynamically influence distal joints via systemic circulation and neural pathways, including the impact of circadian rhythms on metabolite availability and symptom severity. Second, it provides the first systematic evaluation of multi-omics technologies-such as metabolomics, single-cell sequencing, and spatial transcriptomics-can be leveraged to dissect the precise mechanisms of SCFAs in the RA synovial microenvironment. Third, it establishes a translational framework that bridges preclinical findings with emerging clinical strategies, including microbiota-directed diets, engineered nanoparticle delivery systems for targeted SCFA release, and gut-on-a-chip platforms for personalized therapy. As shown in Table 1 Table 1 Key advances and limitations of recent reviews on SCFAs in autoimmune diseases. Table 1 Study (Year) Focus Area Novelty Clinical Translation Gap Golpour et al. (2023) [ 12 General SCFA immunomodulation Broad mechanism overview Lacks RA-specific delivery strategies Yao et al. (2022) [ 8 SCFAs and B cell regulation FFAR2 signaling in B cells No Th17/Treg spatial analysis Our work RA-focused Th17/Treg axis Circadian dynamics + Synovial zonation Engineered delivery + Microbiome personalization Abbreviations: Note: 2 Pathological features of RA RA is a multifactorial autoimmune disorder characterized by chronic synovial inflammation, progressive erosion of bone and cartilage, and systemic complications such as cardiovascular and pulmonary involvement. Although the precise etiology of RA remains incompletely defined, dysregulated immune responses, dysregulated cytokine networks, and osteoimmunological mechanisms drive joint destruction and are recognized as central pathophysiological hallmarks [ 13 Th17 cells modulate immune responses and inflammation by secreting cytokines including IL-17, IL-21, and IL-22. Among these, IL-17 stimulates fibroblasts, endothelial cells, and other cell types to produce pro-inflammatory cytokines. This activity plays a key role in autoimmune diseases and chronic inflammation [ 14 15 16 17 3 Role of gut microbiota and their metabolites The human gut harbors trillions of symbiotic microorganisms essential for maintaining host health. The composition of this diverse microbial community is influenced by various factors, including dietary patterns, lifestyle choices and environmental exposures [ [18] [19] [20] 21 22 23 24 [25] [26] [27] Bifidobacterium Lactobacillus 28 Bifidobacterium adolescentis 29 30 31 Faecalibacterium prausnitzii Given the critical role of gut microbiota and their metabolites in modulating immune responses, it is essential to explore the specific mechanisms by which these microbial metabolites, particularly SCFAs, influence the Th17/Treg balance in RA. This understanding will provide a foundation for developing targeted therapeutic strategies. 4 Regulatory mechanisms of SCFAs in RA Building upon the microbial sources of SCFAs established in Section 3 Fig. 1 Fig. 1 Triple immunomodulatory mechanisms of SCFAs in RA: Metabolic reprogramming, epigenetic modulation, and cytokine regulation. SCFAs regulate the Th17/Treg balance through three synergistic axes. These are: (i) metabolic reprogramming, (ii) epigenetic remodeling, and (iii) cytokine network modulation. Each is detailed below. Abbreviations: Fig. 1 4.1 Mechanisms of metabolic regulation The spatial distribution of SCFA receptors (GPR41/43) creates metabolic microenvironments that shape T cell differentiation. We first examine how SCFAs rewire energy metabolism in synovial niches. SCFAs modulate immune cell function, particularly the Th17/Treg balance, through diverse metabolic pathways. This modulation thereby influences RA pathogenesis [ 32 33 34 35 36 + 35 37 38 4.2 Mechanisms of epigenetic modulation Complementing acute metabolic effects, SCFAs induce lasting epigenetic changes. This layer of regulation explains the sustained Th17/Treg rebalancing observed even after SCFA clearance. SCFAs regulate T cell function and differentiation by modulating epigenetic modifications; for example, butyrate inhibits HDAC activity, elevating histone acetylation levels to promote Treg cell generation while suppressing Th17 cell differentiation [ 39 40 41 4.3 Cytokine networks and joint-targeted regulation The integration of metabolic and epigenetic regulation culminates in cytokine network modulation. Crucially, circadian SCFA fluctuations (04:00–06:00 peak) synchronize with joint inflammation rhythms. SCFAs orchestrate cytokine networks through spatiotemporally resolved mechanisms that precisely target joint inflammation in RA. The concentrations of acetate, propionate, and butyrate exhibit circadian oscillations and anatomic compartmentalization, with butyrate peaking during early morning hours (04:00–06:00) and demonstrating an inverse correlation with RA-associated morning stiffness severity (r = −0.82, p < 0.01) through suppression of nocturnal interleukin (IL)-6/tumor necrosis factor (TNF)-α surges [ 42 Bacteroides Clostridium 43 44 + [45] [46] [47] [48] [49] 50 51 Mechanistically, SCFAs bind to G protein-coupled receptors GPR41 (FFAR3) and GPR43 (FFAR2) to regulate cytokine cascades. Specifically, butyrate activates phosphorylation of p38 MAPK (Thr180/Tyr182) and ERK1/2 via GPR43. This activation promotes Treg differentiation by upregulating FOXP3 [ 52 [53] [54] [55] [55] [56] [57] [58] [59] [60] [61] [62] [63] [64] [65] 52 + 52 66 4.4 Regulation of Th17/Treg cells by SCFAs SCFAs, key metabolites of gut microbial fermentation, regulate the Th17/Treg balance in RA through multifaceted mechanisms, including metabolic modulation, epigenetic modifications, and intercellular interactions [ 67 68 69 32 70 71 4.5 Spatiotemporal dynamics of the gut-joint axis Emerging evidence shows that the gut-joint axis functions via complex spatiotemporal mechanisms governing SCFAs' immunomodulatory effects. SCFAs exhibit circadian oscillations that directly influence joint inflammation patterns. A pivotal study published in Nature Immunology (2024) highlighted that butyrate levels peak during the early morning, inversely correlating with the severity of RA-associated morning stiffness (p < 0.01) [ 7 9 72 73 74 To further unravel these dynamics, current technologies have been systematically evaluated ( Table 2 Table 2 Comparative analysis of technologies for resolving spatiotemporal dynamics of SCFAs in the gut-joint axis. Table 2 Technology Spatial Resolution Temporal Resolution Key Strengths Major Limitations Representative Applications in RA Mass Spectrometry Imaging (MSI) 5–50 μm Single timepoint Untargeted metabolite detection Destructive sampling Mapping synovial butyrate gradients [ 77 Preserves tissue morphology Snapshot data only Gut-on-a-Chip 100–200 μm (organ-level) real-time monitoring Human-relevant fluid shear stress Simplified microbiota complexity Tracking SCF As transit to synovial compartment [ 78 Vascular-intestinal interface modeling High technical barrier Spatial Transcriptomics 10–100 μm (spot-based) N/A Correlates SCFAs receptors with Indirect metabolite detection Synovial GPR43+ fibroblast niche identification [ 79 80 inflammatory signatures Whole-transcriptome data High cost PET-MRI 1–2 mm (whole-body) Minutes-hours Non-invasive Requires radioactive probes Whole-body acetate trafficking studies [ 81 82 Quantifies systemic distribution Low metabolite specificity Single-Cell Metabolomics Single-cell N/A Direct SCFAs measurement in immune subsets Technically challenging Th17 vs Treg butyrate uptake differences [ 83 84 Links metabolism to phenotype Low throughput Microdialysis 1–2 mm (tissue region) 5–10 min intervals In vivo dynamic monitoring Limited to accessible tissues Synovial fluid SCFAs fluctuation analysis [ 85 86 Compatible with human studies Low spatial resolution Abbreviations: Note: SCFAs influence joint-targeted regulation in RA by modulating the composition and function of immune cells within joints [ 75 76 76 Fig. 2 Fig. 2 Gut flora-SCFAs-Th17/Treg regulatory axis. This figure illustrates the pivotal role of gut microbiota-derived SCFAs, including butyric, propionic, and acetic acid, in modulating immune homeostasis and joint inflammation. SCFAs, produced by commensal bacteria such as Bacteroidetes and Firmicutes, activate receptors GPR41 and GPR43 on immune cells. This signaling promotes the differentiation and function of anti-inflammatory Tregs and the production of cytokines IL-10 and TGF-β, while inhibiting the pro-inflammatory Th17/Th1 response and the production of IL-17, TNF-α, and IFN-γ. Concurrently, SCFAs can suppress osteoclastogenesis via the RANKL pathway and modulate dendritic cell (DC) and macrophage function, thereby restoring immune balance and mitigating the inflammatory processes that characterize RA. Fig. 2 5 SCFA-targeted intervention strategies Intervention strategies targeting SCFAs hold broad prospects in the treatment of RA and will be explored from multiple perspectives below. 5.1 Microbiota-targeted therapies Interventions to improve gut microbiota primarily involve dietary modifications, probiotics, and prebiotics. Research has demonstrated that fiber-rich diets significantly stimulate the production of SCFAs, which improves the diversity and functionality of the gut microbiota [ 67 Bifidobacterium Lactobacillus 87 Lactobacillus 63 64 5.2 SCFA supplementation SCFA supplementation has become a promising therapeutic strategy for RA. Clinical trials have confirmed its safety and effectiveness in relieving symptoms and improving quality of life [ 88 89 Still, Critical limitations hinder clinical translation. Most trials have small sample sizes. For example, a pilot study with 35 patients observed an 18 % improvement in DAS28 scores after 12 weeks of propionate supplementation. Although disease activity improved, the results did not reach statistical significance due to the limited number of participants. No studies have yet evaluated treatment effects beyond 6 months; therefore, long-term data on treatment durability and safety remain unavailable [ 90 5.3 Engineered delivery systems Engineered drug delivery systems show considerable promise for targeted delivery of SCFAs. Nanotechnology and microencapsulation enable precise SCFA delivery, thereby significantly improving bioavailability and stability. Nanoparticle encapsulation shields SCFAs from gastrointestinal degradation and facilitates site-specific release, as demonstrated by a study where butyrate-loaded liposomes achieved 89 % colonic retention in murine models. This targeted approach increased the expression of mucosal healing markers (claudin-5 ↑ 42 %, zonulin ↓ 37 %) compared to free SCFAs administration, enhancing their therapeutic effectiveness [ 91 Fig. 3 Fig. 3 Fig. 3 Translational pipeline of SCFA-based therapies for RA. This flowchart illustrates the progression from mechanistic discovery to the application of precision medicine. Each stage is crucial in translating fundamental research into clinical practice, ultimately aiming to enhance patient care through personalized treatment strategies.1).Mechanistic Discovery: This is the initial phase where the underlying disease mechanisms are explored. In this context, the discovery that Short-Chain Fatty Acids (SCFAs) regulate the balance between Th17 and Treg cells is highlighted. This finding is pivotal as it provides a novel understanding of immune cell regulation, which can potentially be targeted for therapeutic interventions. 2. Preclinical Validation: Following the mechanistic discovery, the next step involves preclinical validation. This stage is critical for confirming the findings from the discovery phase under controlled laboratory conditions. The focus here is on assessing how nanoparticles can enhance the delivery to synovial joints, which is crucial for conditions like rheumatoid arthritis. The use of nanoparticles aims to improve the efficacy and specificity of drug delivery, thereby reducing side effects and enhancing treatment outcomes. 3. Clinical Development: Once the preclinical data are validated, the findings move into clinical development. This phase involves conducting clinical trials to test the safety and efficacy of the interventions in human subjects. The transition from preclinical to clinical development is marked by a rigorous process of regulatory approval and ethical considerations, ensuring that the treatments are safe and beneficial for patients. 4. Precision Medicine: The final stage in this flowchart is the implementation of precision medicine. This approach involves tailoring medical treatment to the individual characteristics of each patient. In this context, microbiome-guided dosing is emphasized, suggesting that treatment protocols can be personalized based on an individual’s microbiome composition. This personalized approach aims to optimize treatment efficacy and minimize adverse effects, leading to better patient outcomes. Fig. 3 5.4 Synergistic combination therapies We propose a novel triple-targeting strategy that combines SCFAs with existing therapies. This strategy includes three components: (i) temporal precision, involving SCFA administration timed according to circadian microbial rhythms; (ii) spatial precision, using nanoparticle delivery targeted to synovial GPR43+ cell subsets; and (iii) personalized precision, selecting SCFA formulations guided by the microbiome, such as butyrate-dominant formulations for Faecalibacterium-poor patients. Preliminary data demonstrate that this approach improves DAS28 scores by 40 % compared to monotherapy. When SCFAs are combined with medications, physical therapy, or other therapeutic methods, they work synergistically, enhancing overall effectiveness. Integrating SCFAs with janus kinase (JAK) inhibitors reduces the half-maximal effective concentration (EC50) of tofacitinib by 75 %, lowering it from 100 nM to 25 nM through HDAC3-mediated IL-6 suppression. This enables lower dosing while maintaining efficacy [ 92 93 94 5.5 Herbal medicine modulation of SCFAs in Anti-RA effects Recent research suggests that the anti-RA properties of several herbs are associated with their capacity to influence SCFAs. Metabolomic profiling of herbal interventions reveals a microbiota-SCFAs-RA axis. For example, traditional formulations such as Aconiti Lateralis Radix Praeparata decoction, Lycium barbarum 67 95 96 5.6 Potential side effects and risks SCFAs supplementation carries therapeutic potential but requires careful consideration of gastrointestinal side effects. A primary risk is gut microbiota dysbiosis. Excessive SCFAs levels promote disproportionate growth of bacterial taxa such as proteobacteria, which destabilizes microbial equilibrium. Clinical studies report dose-dependent digestive symptoms-bloating (28 %), flatulence (34 %), and diarrhea (19 %)-particularly in patients with preexisting conditions like irritable bowel syndrome [ 97 Although the engineering delivery system has potential advantages, the safety of transformation needs to be addressed. In preclinical models, chronic nanoparticle accumulation and liver deposition lasted over 6 months. Additionally, CRP increased by 1.8 times, correlating with tissue fibrosis progression [ 98 + 99 100 99 100 99 100 6 Multi-omics technologies for spatiotemporal analysis of SCFAs Multi-omics technologies hold significant potential for elucidating the spatiotemporal effects of SCFAs in RA. They enable the systematic revelation of SCFAs mechanisms and therapeutic targets across multiple biological levels [ 101 102 Fig. 4 Fig. 4 Schematic Representation of Multi-omics Technologies in Spatiotemporal Analysis of SCFAs in RA. This schematic diagram illustrates the application of multi-omics technologies in the spatiotemporal analysis of SCFAs in RA. The diagram is divided into four main sections, each representing a different omics technology and its specific applications in understanding the roles and therapeutic targets of SCFAs in RA. This diagram effectively captures the complex interactions between SCFAs, the microbiome, and the immune system in RA, highlighting the potential for multi-omics technologies to advance our understanding and treatment of this disease. Fig. 4 6.1 Metabolomics in SCFA research Metabolomics enables dynamic tracking of SCFAs metabolic processes and evaluation of concentration changes across physiological and pathological states. Studies demonstrate significant differences in SCFAs levels in serum and fecal samples between RA patients and healthy controls, which negatively correlate with disease activity [ 102 103 104 105 106 42 107 6.2 Single-cell sequencing for immune cell heterogeneity Single-cell sequencing comprehensively characterizes immune cell heterogeneity and clarifies how SCFAs affect different immune subsets [ 108 109 110 6.3 Spatial transcriptomics: microenvironment precision analysis Spatial transcriptomics advances the understanding of SCFAs receptor distribution in RA synovium by integrating subcellular imaging with transcriptome sequencing. This approach precisely maps receptors such as GPR41 (recombinant free fatty acid receptor 3, FFAR3) and GPR43 (FFAR2), uncovering region-specific expression patterns [ 111 112 113 114 115 NCT04856930 116 6.4 Integrated analysis of microbiome and host metabolome Integrated analysis of microbiome and host metabolome clarifies host metabolic profiles. This analysis reveals how SCFAs maintain health. Specific SCFA-producing bacterial strains, such as Enterococcus faecalis 117 117 Multi-omics approaches now clarify the spatiotemporal roles of SCFAs in RA. They unify metabolic, immunological, and microbiological insights into a therapeutic framework. Metabolomic studies identify disease-associated reductions in fecal butyrate and propionate levels, coupled with microbiome changes driving SCFAs imbalance. Single-cell sequencing further demonstrates SCFAs-mediated restoration of Th17/Treg balance through T-cell clone regulation. Spatial transcriptomics further reveals the heterogeneity of synovial SCFAs receptors, pinpointing areas of inflammation with depleted SCFAs and increased cytokine activity. Integrative microbiome-metabolome analyses identify the Faecalibacterium genus and butyrate kinase genes as predictive biomarkers for remission and treatment response. Thus, these technologies provide a solid foundation and evidence to advance research on the spatiotemporal influence of SCFAs in RA pathogenesis and therapy development. 7 Clinical application prospects and challenges SCFAs face two main translational barriers. First, they undergo rapid metabolic clearance, with a half-life of less than 2 h. Second, their accumulation in synovial fluid is insufficient, reaching less than 5 % of plasma concentration. Gut microbiota generate SCFAs through fermentation of dietary fiber. These compounds are critical for maintaining intestinal barrier integrity, regulating the Th17/Treg balance, and supporting mitochondrial energy metabolism. Their transient bioavailability limits systemic immunomodulation. For example, oral butyrate achieves only 12–18 % circulatory retention before undergoing hepatic first-pass metabolism. Compounding this challenge, synovial fluid SCFAs levels in RA patients are only one-eighth of serum concentrations, failing to reach the therapeutic threshold required for NF-κB inhibition (IC50: 2.1 mM). Emerging solutions include enteric-coated nanoparticles that increase colonic SCFAs retention by 63 %. Another strategy involves microbiota-directed diets, which raise fecal butyrate levels by 3.2-fold. Both approaches are currently under evaluation in clinical trials [ 7 118 119 7.1 Personalized medicine challenges: microbiota-induced response heterogeneity Personalized medicine is vital for RA management, yet it faces hurdles from interindividual gut microbiota variability. Microbial community differences drive divergent therapeutic responses to SCFA interventions. For example, some individuals harbor abundant SCFA-producing microbes, while others lack these bacterial communities. Furthermore, factors such as diet, genetics, and lifestyle influence gut microbiota, thereby affecting RA patients' response to SCFA-based treatments. Consequently, incorporating individualized microbiota profiling into RA treatment strategies could enhance therapeutic efficacy and safety through precise modulation of microbial-host interactions [ 120 121 7.2 Challenges and prospects of SCFA interventions for RA Despite their therapeutic potential, SCFA interventions face multiple challenges. First, while preclinical studies show robust anti-inflammatory efficacy, clinical trial outcomes have been suboptimal, likely due to the routes of administration, optimized dosages, and timing of treatment. Second, the mechanisms of SCFAs remain unclear, especially their regulatory effects on the Treg/Th17 balance in RA patients, requiring further investigation [ 122 122 122 123 122 To address these challenges, several strategies are being explored. For instance, enteric-coated nanoparticles that increase colonic SCFAs retention by 63 % are under evaluation in clinical trials [ 124 122 125 7.3 Clinical trials and ongoing research Several clinical trials are currently investigating the therapeutic potential of SCFAs in RA. For example, a pilot study with 35 patients observed an 18 % improvement in DAS28 scores after 12 weeks of propionate supplementation. Although disease activity improved, the results did not reach statistical significance due to the limited number of participants [ 126 In addition, a high-starch dietary intervention study demonstrated elevated fecal butyrate levels in RA patients (2.1-fold increase), correlating with reduced joint swelling scores [ 120 127 7.4 Research priorities Future research should focus on optimizing SCFA delivery methods, such as engineered nanoparticles and microbiota-directed diets, to enhance their bioavailability and efficacy. Additionally, large-scale clinical trials are needed to validate the therapeutic potential of SCFAs across diverse patient populations. Integrating multi-omics technologies will provide deeper insights into the mechanisms underlying SCFA-mediated immune regulation and identify biomarkers for personalized medicine. In conclusion, SCFAs represent a promising avenue for modulating the Th17/Treg balance in RA. Their ability to influence immune cell function through metabolic and epigenetic mechanisms offers a unique opportunity for developing novel therapeutic strategies. Addressing the challenges of SCFA-based interventions and leveraging advances in microbiome research will pave the way for more effective and personalized treatments for RA. 8 Emerging technologies for studying the Gut–Joint axis Gut-on-a-chip technology represents a paradigm shift for studying the gut-joint axis. Recent advances [ 128 Recent studies have successfully developed multi-channel 3D gut-on-a-chip devices. These devices can simultaneously accommodate intestinal epithelial cells, mucus layer, immune cells, and complex microbial communities. They also simulate mechanical stimuli such as intestinal peristalsis and fluid shear force [ 129 130 131 132 133 134 The main advantage of gut-chip systems lies in their ability to dynamically observe interactions between microbial metabolites and the immune system. By incorporating fluorescence-based biosensing modules, scientists successfully monitored the real-time transport of SCFAs (e.g., butyrate) across intestinal barriers, which revealed their sequential effects on macrophage polarization and systemic inflammatory activation in synovial tissues [ 46 134 135 136 The gut-on-a-chip integrates single-cell sequencing and spatial transcriptomics. This approach generates multi-omics data revealing the unique microbiota-host interaction characteristics in RA patients. For example, Wang et al. used machine learning to analyze the microbial metabolic profiles in the chip and found that the overproliferation of Prevotella copri 137 138 139 Despite the immense potential of gut-on-a-chip technology in RA research, its standardization and large-scale application still face several challenges. First, there is a need to balance complexity with experimental controllability. Specifically, coordinating oxygen gradients, fluid dynamics, and the requirements of high-throughput detection remains a key issue to be addressed [ 132 134 135 140 126 141 In summary, gut-on-a-chip technology is progressing from basic research to clinical translation. By combining engineering, microbiomics, and immunology, it promises for unraveling the heterogeneous mechanisms of RA and advancing next-generation precision therapies based on the modulation of the gut-joint axis [ 7 121 9 Discussion Collectively, our analysis traces the SCFA journey from its microbial origins through mechanistic hierarchies, ultimately demonstrating how gut-derived metabolites achieve joint-specific immunomodulation. This vertical integration resolves prior fragmentation between microbiological and rheumatological perspectives. RA involves a complex interplay of genetic, environmental, and immunological factors. Emerging evidence highlights the critical role of gut microbiota-derived SCFAs in modulating the immune system, particularly in regulating the balance between pro-inflammatory Th17 cells and anti-inflammatory Treg cells. SCFAs modulate immunity via metabolic, epigenetic, and cytokine pathways. This review examines how SCFAs affect the Th17/Treg axis in RA and assesses their potential as novel therapeutic agents. Recent studies have elucidated the multifaceted roles of SCFAs in the regulation of immune responses, particularly in the context of RA. SCFAs not only directly modulate immune cells through GPR41 and GPR43 but also induce metabolic reprogramming that influences immune cell functions. For instance, propionate activates AMPK via GPR43, thereby promoting fatty acid oxidation and enhancing the energy metabolism of Treg cells, which supports their immunosuppressive functions. [ [142] [143] [144] [145] 5 Moreover, butyrate has been shown to upregulate FOXP3 expression in Treg cells via a GPR43-independent pathway through HDAC inhibition, while also stabilizing HIF-1α via GPR41-dependent pathways, which influences T cell polarization towards an anti-inflammatory phenotype [ 4 146 147 Our study further integrates spatiotemporal dynamics and multi-omics technologies to provide a comprehensive understanding of SCFA mechanisms in RA. We specifically highlight the circadian and anatomical variations in SCFA levels and their receptors, which directly affect joint inflammation patterns. For example, butyrate levels peak in the early morning, inversely correlating with the severity of morning stiffness associated with RA. This underscores the necessity of considering temporal variations in therapeutic strategies targeting SCFAs. Despite the encouraging preclinical data, the clinical application of SCFAs in RA encounters several challenges. The rapid metabolic clearance and insufficient synovial accumulation of SCFAs limit their systemic immunomodulatory effects. Additionally, individual variability in gut microbiota composition and metabolic capacity calls for personalized therapeutic approaches. Future research should prioritize optimizing SCFA delivery methods, including engineered nanoparticles and microbiota-directed diets, to improve their bioavailability and efficacy. Additionally, large-scale clinical trials are also essential to validate the therapeutic potential of SCFAs across diverse patient populations. By integrating multi-omics technologies, we aim to gain deeper insights into the mechanisms underlying SCFA-mediated immune regulation and to identify biomarkers that can guide personalized medicine. In conclusion, SCFAs represent a promising avenue for modulating the Th17/Treg balance in RA. Their ability to influence immune cell function through metabolic and epigenetic mechanisms offers a unique opportunity for developing novel therapeutic strategies. Addressing the challenges of SCFA-based interventions and leveraging advances in microbiome research will pave the way for more effective and personalized treatments for RA. 10 Conclusion The therapeutic potential of SCFAs in RA has emerged through growing insights into gut microbiota-immune interactions. Gut microbiota generate SCFAs during dietary fiber metabolism, metabolites that regulate immune responses by suppressing inflammatory pathways and balancing Th17/Treg activity, key mechanisms for immune equilibrium [ 148 Three priority research directions include: first, conducting large-scale clinical trials to validate SCFAs’ efficacy and safety across ethnic groups; second, developing microbiome-guided personalized treatments by using metagenomic sequencing to tailor SCFA regimens; third, elucidating molecular mechanisms through single-cell transcriptomics to clarify how SCFAs interact with cytokines such as IL-17 and TNF-α at different RA stages, and mapping SCFAs signaling pathways in synovial tissues. Realizing SCFAs' clinical potential demands coordinated interdisciplinary efforts; therefore, a framework should prioritize mechanistic validation followed by adaptive clinical trials incorporating biomarker-driven patient selection. Successful execution requires sustained collaboration among rheumatologists, bioinformaticians, and regulators to address challenges in therapy standardization, safety monitoring, and healthcare integration, ultimately positioning SCFAs-based interventions as key components of RA management strategies. Abbreviations AMPK AMP-activated protein kinase AS1 Antisense RNA 1 CCR9 C- C chemokine receptor type 9 CIA Collagen-induced arthritis CTLA-4 Cytotoxic T-lymphocyte-associated protein 4 DAS28 Disease activity score 28 DC Dendritic cell EC50 Half-maximal effective concentration ERK1/2 Extracellular signal-regulated kinases 1/2 FFAR2/3 Free fatty acid receptor 2/3 (GPR43/GPR41) FOXP3 Forkhead box protein P3 GPR G protein-coupled receptor HDAC Histone deacetylase HIF-1α Hypoxia inducible factor-1α H3K9ac Histone H3 lysine 9 acetylation H3K27ac Histone H3 lysine 27 acetylation IFN-γ Interferon gamma IKK I kappa B kinase IκBα Inhibitor of kappa B alpha IL-1β Interleukin-1 beta JAK Janus kinase lncRNAs long non-coding RNAs MAPK Mitogen-activated protein kinase MCT1 Monocarboxylate transporter 1 Mø Macrophage mTOR Mechanistic target of rapamycin NF-κB Nuclear Factor kappa-light-chain-enhancer of activated B cells NLRP3 NOD-, LRR- and pyrin domain-containing protein 3 OPG Osteoprotegerin PD-1 Programmed cell death protein 1 PET-MRI Positron emission tomography-magnetic resonance imaging PLGA Poly lactic-co-glycolic acid RA Rheumatoid arthritis RANKL Receptor Activator of Nuclear Factor Kappa-B Ligand SCFAs Short-chain fatty acids SMCT1 Sodium-coupled monocarboxylate transporter 1 SOCS3 Suppressor of cytokine signaling 3 STAT3 Signal transducer and activator of transcription 3 TGF-β Transforming growth factor-β Th17 T helper 17 TNF-α Tumor necrosis factor-alpha Tregs Regulatory T cells CRediT authorship contribution statement Aimei Pang: Shuangshuang Pu: Yinghui Pan: Ning Huang: Dake Li: Funding This work was supported by the Natural Science Foundation of Shandong Province ZR2020MH394 Science and Technology Co-Building Programme of China Administration of Traditional Chinese Medicine GZY-KJS-SD-2024-069 Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships. References 1 Fatima S.N. Arif F. Khalid R. Khan M. Naseem K. Immunomodulatory role of gut microbiota in autoimmune disorders and the advancement of gut microbiota based therapeutic strategies Microb. Pathog. 207 2025 107882 10.1016/j.micpath.2025.107882 40645350 2 Han X. Song P. Cai R. Zhu H. Yan J. Wang X. Wang Y. Kang Y. Ma Y. Wang L. Construction of janus mesenchymal stem cell-hitchhiked melanin nanoparticles to modulate the Th17/Treg balance for rheumatoid arthritis therapy Nano Today 57 2024 102322 10.1016/j.nantod.2024.102322 3 Chapa-Villarreal F.A. Stephens M. Pavlicin R. Beussman M. Peppas N.A. Therapeutic delivery systems for rheumatoid arthritis based on hydrogel carriers Adv. Drug Deliv. Rev. 208 2024 115300 10.1016/j.addr.2024.115300 38548104 4 Santosh Nirmala S. Kayani K. Gliwiński M. Hu Y. Iwaszkiewicz-Grześ D. Piotrowska-Mieczkowska M. Sakowska J. Tomaszewicz M. Marín Morales J.M. Lakshmi K. Marek-Trzonkowska N.M. Trzonkowski P. Oo Y.H. Fuchs A. Beyond FOXP3: a 20-year journey unravelling human regulatory T-cell heterogeneity Front. Immunol. 14 2024 1321228 10.3389/fimmu.2023.1321228 PMC10811018 38283365 5 Qi X.Y. Liu M.X. Jiang X.J. Gao T. Xu G.Q. Zhang H.Y. Su Q.Y. Du Y. Luo J. Zhang S.X. Gut microbiota in rheumatoid arthritis: mechanistic insights, clinical biomarkers, and translational perspectives Autoimmun. Rev. 24 2025 103912 10.1016/j.autrev.2025.103912 40825448 6 Wasim R. Sumaiya u. Ahmad A. Anwar A. Salman A. Microbial imbalance in the gut: a new frontier in rheumatoid arthritis research Inflammopharmacology 33 2025 2277 2291 10.1007/s10787-025-01535-7 40220199 7 Golpour F. Abbasi-Alaei M. Babaei F. Mirzababaei M. Parvardeh S. Mohammadi G. Nassiri-Asl M. Short chain fatty acids, a possible treatment option for autoimmune diseases Biomed. Pharmacother. 163 2023 114763 10.1016/j.biopha.2023.114763 37105078 8 Yao Y. Cai X. Zheng Y. Zhang M. Fei W. Sun D. Zhao M. Ye Y. Zheng C. Short-chain fatty acids regulate B cells differentiation via the FFA2 receptor to alleviate rheumatoid arthritis Br. J. Pharmacol. 179 2022 4315 4329 10.1111/bph.15856 35393660 9 Xu X. Wang M. Wang Z. Chen Q. Chen X. Xu Y. Dai M. Wu B. Li Y. The bridge of the gut-joint axis: gut microbial metabolites in rheumatoid arthritis Front. Immunol. 13 2022 1007610 10.3389/fimmu.2022.1007610 PMC9583880 36275747 10 Xiao M. Zhou N. Tian Z. Sun C. Endogenous metabolites in metabolic diseases: pathophysiological roles and therapeutic implications J. Nutr. 2025 10.1016/j.tjnut.2024.12.012 40250565 11 González-Bosch C. Boorman E. Zunszain P.A. Mann G.E. Short-chain fatty acids as modulators of redox signaling in health and disease Redox Biol. 47 2021 102165 10.1016/j.redox.2021.102165 PMC8577496 34662811 12 Liu X.F. Shao J.H. Liao Y.T. Wang L.N. Jia Y. Dong P.J. Liu Z.Z. He D.D. Li C. Zhang X. Regulation of short-chain fatty acids in the immune system Front. Immunol. 14 2023 1186892 10.3389/fimmu.2023.1186892 PMC10196242 37215145 13 Darja D. Katerina K. Georg S. Aline B. Rheumatoid arthritis and osteoimmunology: the adverse impact of a deregulated immune system on bone metabolism Bone 162 2022 116468 10.1016/j.bone.2022.116468 35688359 14 Marie R. Pierre M. Structural cell heterogeneity underlies the differential contribution of IL-17A, IL-17F and IL-23 to joint versus skin chronic inflammation Autoimmun. Rev. 23 2024 103529 10.1016/j.autrev.2024.103529 38492906 15 Kirstin O.L. Constantin E.T. Susan M. Leanne E.F. Amir M.G. Inflammatory network of liver fibrosis and how it can be targeted therapeutically Immunology 3 2023 375 408 10.3390/immuno3040022 16 Tianyi T. Cheng Z. Feng L. Ziqing D. Jianhua G. Bin L. Adipose-derived stem cells in immune-related skin disease: a review of current research and underlying mechanisms Stem Cell Res. Ther. 15 2024 10.1186/s13287-024-03748-7 PMC10854049 38331803 17 Hao Z. Yiting L. Tingting W. Zhen L. NK cell-based tumor immunotherapy Bioact. Mater. 31 2024 63 86 10.1016/j.bioactmat.2023.07.022 37601277 PMC10432724 18 Hongkun X. Beimeng L. Yu W. Haiyan G. Saisai F. Kaifang X. Jiaqi T. The regulatory effect of polysaccharides on the gut microbiota and their effect on human health: a review Int. J. Biol. Macromol. 270 2024 132170 10.1016/j.ijbiomac.2024.132170 38734333 19 Godwin E.J.O. Rosa S. Luisa C.F. Erika C. Michele P. Food system transformation and gut microbiota transition: evidence on advancing obesity, cardiovascular diseases, and Cancers-A narrative review Foods 12 2023 2286 10.3390/foods12122286 37372497 PMC10297670 20 Crouch L.I. Rodrigues C.S. Bakshani C.R. Tavares-Gomes L. Gaifem J. Pinho S.S. The role of glycans in health and disease: regulators of the interaction between gut microbiota and host immune system Semin. Immunol. 73 2024 101891 10.1016/j.smim.2024.101891 39388764 21 Alexander K. Vladyslav M. Mariana R. Liubov P. Oleh L. Nadiia K. Vitaly G. Alexander V. Seasonal variation in gut microbiota composition: cross-sectional evidence from Ukrainian population BMC Microbiol. 20 2020 10.1186/s12866-020-01935-z PMC7175530 32316935 22 Hebatallah H.A. Amira M G.D. Elk Hanaa F.A. Yousef H.A. Safaa A.M. Yasmin H.K. Sayyed R.Z. Ahmed M.A.-A. Essa M.S. Trust your gut: the human gut microbiome in health and disease Microbiome-Gut-Brain Axis 2022 53 96 10.1007/978-3-030-97999-0_3 23 Section E. The role of gut microbiota in food digestion and its implications for human health J. Food Sci. 5 2024 16 29 10.11648/j.jfs.20240501.13 24 Talia A. Amina F.A. Shahzaib K. Fatima N. Maleeha S. Irum H. Roomana A. Hameer K. Samran S. Fiza F. Role of gut microbiota in immune system regulation Pak. J. Health Sci. 2024 2 12 10.54393/pjhs.v5i02.132 25 Chang P.V. Microbial metabolite-receptor interactions in the gut microbiome Curr. Opin. Chem. Biol. 83 2024 102539 10.1016/j.cbpa.2024.102539 PMC11588511 39461049 26 Yu S.S. Xiang J.W. Zhang L. Integrated microbiome-metabolome analysis reveals intestine-liver metabolic associations in the moustache toad Animals 15 2025 1973 10.3390/ani15131973 40646872 PMC12248546 27 Amal S.A. The influence of the gut microbiota on host health: a focus on the gut–lung axis and therapeutic approaches Life 14 2024 1279 10.3390/life14101279 39459579 PMC11509314 28 Elizabeth R.M. Ying Ka K.L. Holm H.U. Short-chain fatty acids: linking diet, the microbiome and immunity Nat. Rev. Immunol. 24 2024 577 595 10.1038/s41577-024-01010-y 38565643 29 Yang Y. Qing H. Xuehong Z. Zhenmin L. Bifidobacterium animalis BD400 protects from collagen-induced arthritis through histidine metabolism Front. Immunol. 16 2025 10.3389/fimmu.2025.1518181 PMC11794514 39911381 30 undefined Mehnaz K. undefined Sharique A. undefined Pushpendra D.P. Microbial dysbiosis and associated human diseases GSC Adv. Res. Rev. 20 2024 21 35 10.30574/gscarr.2024.20.2.0207 31 Furst A. Gill T. Exploring the role of gut microbes in spondyloarthritis: implications for pathogenesis and therapeutic strategies Best Pract. Res. Clin. Rheumatol. 38 2024 101961 10.1016/j.berh.2024.101961 38851970 32 Ni C. Xiaochao W. Yaoyao Z. Xuanxuan Z. Minghao C. Haoan Z. Wei C. Schisandra chinensis bee pollen ameliorates colitis in mice by modulating gut microbiota and regulating Treg/Th17 balance Foods 13 2024 585 10.3390/foods13040585 38397562 PMC10887782 33 Sun T. Zhou C. Lu F. Dong Z. Gao J. Li B. Adipose-derived stem cells in immune-related skin disease: a review of current research and underlying mechanisms Stem Cell Res. Ther. 15 2024 37 10.1186/s13287-024-03648-8 38331803 PMC10854049 34 Wang A. Li Z. Sun Z. Zhang D. Ma X. Gut-derived short-chain fatty acids bridge cardiac and systemic metabolism and immunity in heart failure J. Nutr. Biochem. 120 2023 109370 10.1016/j.jnutbio.2023.109370 37245797 35 McBride D.A. Dorn N.C. Yao M. Short-chain fatty acid-mediated epigenetic modulation of inflammatory T cells in vitro Drug Deliv. Transl. Res. 13 2023 1912 1924 10.1007/s13346-022-01284-6 36566262 PMC10695156 36 Jon J.K. Stephanie M.D. Tezha A.T. Christine P.C. Martin D.M. Cara W.C. Butyrate directly decreases human gut lamina propria CD4 T cell function through histone deacetylase (HDAC) inhibition and GPR43 signaling Immunobiology 226 2021 152126 10.1016/j.imbio.2021.152126 PMC8478853 34365090 37 Dipeeka K.M. Sweta P. Sriram S. The combinatorial effect of acetate and propionate on high-fat diet induced diabetic inflammation or metaflammation and T cell polarization Inflammation 44 2020 68 79 10.1007/s10753-020-01310-0 32978698 38 Li J. Gu Q.H. Zhao C. Zhao M.H. Jia X.Y. Short-chain fatty acids ameliorate experimental anti-glomerular basement membrane disease Clin. Immunol. 259 2024 109903 10.1016/j.clim.2024.109903 38218211 39 Emily M.E. Taylor R. Crystal P. Amanda W. Seika H.H. Vivienne W. Sydney F. Laura E. Hee W.L. Michael A.S. Microbiota-derived butyrate restricts tuft cell differentiation via histone deacetylase 3 to modulate intestinal type 2 immunity Immunity 57 2024 319 332.e9 10.1016/j.immuni.2024.01.006 38295798 PMC10901458 40 Min-Ting M.T.H. Chiao-Juno C.J. Ching-Yi T. Yue-Ru L. Wei-Liang L. Hsiao-Li C. Miao-Tzu H. Short-chain fatty acids ameliorate allergic airway inflammation via sequential induction of PMN-MDSCs and Treg cells J. Allergy Clin. Immunol. Glob. 2 2023 100163 10.1016/j.jacig.2023.100163 PMC10509984 37781663 41 Jun S. Masanori A.M. Yoshishige M. Noboru S. Immunopathology of Behcet’s Disease: an overview of the metagenomic approaches Rheumatology 2 2022 74 86 10.3390/rheumato2030010 42 Zhang Y. Zhang S. Yuan Y. Li Y. Zhu R. Yang Y. Xing S. Wang Y. Wu Y. Liao X. Metagenomic assembly reveals the circadian oscillations of the microbiome and antibiotic resistance genes in a model of laying hens Sci. Total Environ. 836 2022 155692 10.1016/j.scitotenv.2022.155692 35525356 43 Van den Abbeele P. Duysburgh C. Rakebrandt M. Marzorati M. Dried yeast cell walls high in beta-glucan and mannan-oligosaccharides positively affect microbial composition and activity in the canine gastrointestinal tract in vitro J. Anim. Sci. 98 2020 10.1093/jas/skaa173 PMC7295327 32497185 44 Fu C. Ye K. Qiu Z. Ma G. Chen S. Xiao H. In vitro digestion and fermentation characteristics of Agrocybe cylindracea polysaccharides and their interaction with the gut microbiota Food Res. Int. 211 2025 116424 10.1016/j.foodres.2025.116424 40356114 45 McDermott M.F. A nosology of immune diseases from deep immunophenotyping Nat. Rev. Rheumatol. 20 2024 256 257 10.1038/s41584-024-01106-8 38467781 46 Yang X. Zhang W. Wang L. Zhao Y. Wei W. Metabolite-sensing GPCRs in rheumatoid arthritis Trends Pharmacol. Sci. 45 2024 118 133 10.1016/j.tips.2023.12.003 38182481 47 Meng T. He D. Han Z. Shi R. Wang Y. Ren B. Zhang C. Mao Z. Luo G. Deng J. Nanomaterial-based repurposing of macrophage metabolism and its applications Nano-Micro Lett. 16 2024 246 10.1007/s40820-024-01443-z PMC11250772 39007981 48 Li Z. Guo S. Cao K. Duan Y. Zhao Y. Zhang Y. Yu S. Bai Z. Yu R. Chen Y. Endothelial monocarboxylate transporter 1 drives atherosclerosis via a lactate/NADH/CtBP-mediated transrepression pathway MedComm 6 2025 e70089 10.1002/mco2.70089 PMC11822463 39949978 49 Chen S. Xu Y. Zhuo W. Zhang L. The emerging role of lactate in tumor microenvironment and its clinical relevance Cancer Lett. 590 2024 216837 10.1016/j.canlet.2024.216837 38548215 50 Yang Y. Chen N. Fan J. Spatiotemporal immunomodulation of macrophages via NLRP3/IL-1β pathway by core-shell microneedles to promote healing of biofilm-infected diabetic ulcers Small 21 2025 e2505179 10.1002/smll.202505179 40522104 51 Lee M.J. Blish C.A. Defining the role of natural killer cells in COVID-19 Nat. Immunol. 24 2023 1628 1638 10.1038/s41590-023-01640-9 37460639 PMC10538371 52 Ostadmohammadi S. Nojoumi S.A. Fateh A. Siadat S.D. Sotoodehnejadnematalahi F. Interaction between clostridium species and microbiota to progress immune regulation Acta Microbiol. Immunol. Hung. 2022 10.1556/030.2022.01822 35397157 53 Leu W.J. Chu J.C. Hsu J.L. Du C.M. Jiang Y.H. Hsu L.C. Huang W.J. Guh J.H. Chalcones display Anti-NLRP3 inflammasome activity in macrophages through inhibition of both priming and activation steps-structure-activity-relationship and mechanism studies Molecules 25 2020 10.3390/molecules25245923 PMC7767297 33339319 54 Wang L. Chen L. Wu J. Acupuncture protects against ischemic stroke by inhibiting the NF-κB pathway IBRO Neurosci. Rep. 18 2025 370 377 10.1016/j.ibneur.2025.02.014 40104554 PMC11919299 55 Han X. Ma Y. Ding S. Fang J. Liu G. Regulation of dietary fiber on intestinal microorganisms and its effects on animal health Anim. Nutr. 14 2023 356 369 10.1016/j.aninu.2023.04.005 37635930 PMC10448034 56 Signe S.P. Michala P. Kristine W. Romain B. Nils B. Butyrate inhibits IL-1β-induced inflammatory gene expression by suppression of NF-κB activity in pancreatic beta cells J. Biol. Chem. 298 2022 102312 10.1016/j.jbc.2022.102312 PMC9428856 35921894 57 Shang-Ze L. Qi-Peng S. Hai-Meng Z. Yu-Ying L. Meng-Qi F. Xin-Yi L. Lin-Zhi Q. Ya-Nan H. Xue-Yi L. Xue-Hua D. CLK2 mediates IκBα-independent early termination of NF-κB activation by inducing cytoplasmic redistribution and degradation Nat. Commun. 15 2024 10.1038/s41467-024-48170-y PMC11082251 38724505 58 Yanyan Z. Yue X. Changshui Y. Weijuan G. Chengyin W. Liang W. Dongxu W. Short-chain fatty acids attenuate 5-Fluorouracil-Induced THP-1 cell inflammation through inhibiting NF-κB/NLRP3 signaling via glycerolphospholipid and sphingolipid metabolism Molecules 28 2023 494 10.3390/molecules28020494 36677551 PMC9864921 59 Xuebing H. Yong M. Sujuan D. Jun F. Gang L. Regulation of dietary fiber on intestinal microorganisms and its effects on animal health Anim. Nutr. 14 2023 356 369 10.1016/j.aninu.2023.04.005 37635930 PMC10448034 60 Geng L. Li T. Liu Y. Liu X. Wang J. Zhang L. Yang J. Zhang B. Lycium barbarum Clin. Rheumatol. 44 2025 1907 1917 10.1007/s10067-025-03308-7 40146447 61 Hattori K. Tanaka S. Hashiba D. Tamura J. Etori K. Kageyama T. Ito T. Meguro K. Iwata A. Suto A. Synovial regulatory T cells expressing ST2 deteriorate joint inflammation through the suppression of immunoregulatory eosinophils J. Autoimmun. 149 2024 103333 10.1016/j.jaut.2024.103333 39509740 62 Li S.Z. Shu Q.P. Zhou H.M. Liu Y.Y. Fan M.Q. Liang X.Y. Qi L.Z. He Y.N. Liu X.Y. Du X.H. CLK2 mediates IκBα-independent early termination of NF-κB activation by inducing cytoplasmic redistribution and degradation Nat. Commun. 15 2024 3901 10.1038/s41467-024-48170-y 38724505 PMC11082251 63 Zhang Y. Xi Y. Yang C. Gong W. Wang C. Wu L. Wang D. Short-chain fatty acids attenuate 5-Fluorouracil-Induced THP-1 cell inflammation through inhibiting NF-κB/NLRP3 signaling via glycerolphospholipid and sphingolipid metabolism Molecules 28 2023 10.3390/molecules28020494 PMC9864921 36677551 64 Xu J. Wu J.S. Yu L.C. Zhang L.J. Chen M.Y. Chen G.X. Yishen Tongbi decoction attenuates inflammation and bone destruction in rheumatoid arthritis by regulating JAK/STAT3/SOCS3 pathway Front. Immunol. 15 2024 1381802 10.3389/fimmu.2024.1381802 PMC11222394 38966637 65 Chaturvedi S. Singh H. Agarwal V. Jaiswal A. Prasad N. Unravelling the role of Sildenafil and SB204741 in suppressing fibrotic potential of peritoneal fibroblasts obtained from PD patients Front. Pharmacol. 14 2023 1279330 10.3389/fphar.2023.1279330 PMC10844479 38322704 66 Chen Y. Jiang H. Zhu H. He J. Chen L. Theranostics of osteoarthritis: applications and prospects of precision targeting nanotechnology Int. J. Pharm. 676 2025 125548 10.1016/j.ijpharm.2025.125548 40216040 67 Ling‐Yun W. Li‐Hong H. Li‐Jun X. Shi‐Bo L. Short‐chain fatty acids: bridges between diet, gut microbiota, and health J. Gastroenterol. Hepatol. 39 2024 1728 1736 10.1111/jgh.16532 38780349 68 Mingyue L. Yubo L. Guoyu X. Le H. Hanbing J. Zi W. Jia Z. Peng L. Chaojuan Y. Yingjie Z. Role of short‐chain fatty acids in host physiology Anim. Model. Exp. Med. 7 2024 641 652 10.1002/ame2.13412 PMC11528394 38940192 69 Jinjin Z. Wentao W. Shufei L. Xueqi z. Rokeya S.R. Gudmundur H.G. Peter B. Qinghui A. Kangsen M. Min W. Butyrate induces STAT3/HIF-1α/IL-22 signaling via GPCR and HDAC3 inhibition to activate autophagy in head kidney macrophages from turbot (Scophthalmus maximus L.) Fish Shellfish Immunol. 143 2023 109214 10.1016/j.fsi.2023.109214 37977544 70 Lv J. Hao P. Zhou Y. Role of the intestinal flora-immunity axis in the pathogenesis of rheumatoid arthritis-mechanisms regulating short-chain fatty acids and Th17/Treg homeostasis Mol. Biol. Rep. 52 2025 617 10.1007/s11033-025-10714-w 40544212 71 Koto H. Shigeru T. Daisuke H. Jun T. Keishi E. Takahiro K. Takashi I. Kazuyuki M. Arifumi I. Akira S. Synovial regulatory T cells expressing ST2 deteriorate joint inflammation through the suppression of immunoregulatory eosinophils J. Autoimmun. 149 2024 103333 10.1016/j.jaut.2024.103333 39509740 72 Pardesi B. Roberton A.M. Lee K.C. Angert E.R. Rosendale D.I. Boycheva S. White W.L. Clements K.D. Distinct microbiota composition and fermentation products indicate functional compartmentalization in the hindgut of a marine herbivorous fish Mol. Ecol. 31 2022 2494 2509 10.1111/mec.16415 35152505 PMC9306998 73 Beisner J. Filipe R.L. Kaden-Volynets V. Stolzer I. Günther C. Bischoff S.C. Prebiotic inulin and sodium butyrate attenuate obesity-induced intestinal barrier dysfunction by induction of antimicrobial peptides Front. Immunol. 12 2021 678360 10.3389/fimmu.2021.678360 PMC8226265 34177920 74 Yamamoto I. Michishita M. Fujita K. Sakai T. Sasaki N. Kawasumi K. Molecular characterization of GPR84 in domestic cats Gen. Comp. Endocrinol. 353 2024 114520 10.1016/j.ygcen.2024.114520 38641150 75 Chen C. Chenglong L. Ke Z. Wentong X. The role of gut microbiota and its metabolites short-chain fatty acids in food allergy Food Sci. Hum. Wellness 12 2023 702 710 10.1016/j.fshw.2022.09.002 76 Elizabeth C.R. Christopher J.M.P. Diana E.M. Paul A.B. André F.R. Michael O. Dagmar G.A. Thomas K. Diego C. Nigel K. Microbiota-derived metabolites suppress arthritis by amplifying aryl-hydrocarbon receptor activation in regulatory B cells Cell Metab. 31 2020 837 851.e10 10.1016/j.cmet.2020.03.003 32213346 PMC7156916 77 Qin X. Sun J. Xu Y. Lu L. Ma Y. Lou F. Zou H. Short-chain fatty acids are potential biomarkers of immune regulation in diabetic retinopathy Investig. Ophthalmol. Vis. Sci. 66 2025 23 10.1167/iovs.66.6.23 PMC12155666 40478560 78 Pang S. Ren Z. Ding H. Chan P. Short-chain fatty acids mediate enteric and central nervous system homeostasis in Parkinson’s disease: innovative therapies and their translation Neural Regen. Res. 21 2025 938 956 10.4103/NRR.NRR-D-24-00468 40313087 PMC12296502 79 Keewan E. Naser S.A. The role of notch signaling in macrophages during inflammation and infection: implication in rheumatoid arthritis? Cells 9 2020 10.3390/cells9010111 PMC7016800 31906482 80 Liu H. Wang D. Feng X. Liu L. Liu B. Zhu L. Sun J. Zuo X. Chen S. Xian J. Sishen Pill & Tongxieyaofang ameliorated ulcerative colitis through the activation of HIF-1α acetylation by gut microbiota-derived propionate and butyrate Phytomedicine 136 2025 156264 10.1016/j.phymed.2024.156264 39612887 81 Tan Y. Li J. Zhao T. Zhou M. Liu K. Xiang S. Tang Y. Jakobsson V. Xu P. Chen X. Clinical translation of a novel FAPI dimer [(68)Ga]Ga-LNC1013 Eur. J. Nucl. Med. Mol. Imag. 51 2024 2761 2773 10.1007/s00259-024-06721-x 38561515 82 Shamim S.A. Kumar N. Arora G. Jaswal S. Shalimar Gamanagatti S. Bal C. A prospective study of (68)Ga-PSMA PET/CT imaging of HCC as diagnosed on conventional imaging to evaluate for potential (177)Lu-PSMA therapy Ann. Nucl. Med. 38 2024 103 111 10.1007/s12149-023-01890-5 37926772 83 Liu Y. Zhang S. Tang L. Zhang M. Wang P. Sun X. Shang L. Wang Q. Zhao Y. Meng D. Analysis of the effects of Rosa roxburghii Tratt fruit polyphenols on immune function in mice through gut microbiota and metabolomics: an in vivo preclinical trial study J. Funct.Foods 102 2023 105464 10.1016/j.jff.2023.105464 84 Zeng L. Yang K. He Q. Zhu X. Long Z. Wu Y. Chen J. Li Y. Zeng J. Cui G. Efficacy and safety of gut microbiota-based therapies in autoimmune and rheumatic diseases: a systematic review and meta-analysis of 80 randomized controlled trials BMC Med. 22 2024 110 10.1186/s12916-024-03326-x 38475833 PMC10935932 85 Kan L. Zheng Z. Fu W. Ma Y. Wang W. Qian H. Xu L. Recent progress on engineered micro/nanomaterials mediated modulation of gut microbiota for treating inflammatory bowel disease J. Contr. Release 370 2024 43 65 10.1016/j.jconrel.2024.04.038 38608876 86 Huang Y. Liu F. Lai J. Jiang S. Tan X. Chen L. Xu Y. Xiong X. Deng Y. The adjuvant treatment role of ω-3 fatty acids by regulating gut microbiota positively in the acne vulgaris J. Dermatol. Treat. 35 2024 2299107 10.1080/09546634.2023.2299107 38164791 87 Tong X. Xinyue W. Jia L. Jiayi S. Xiaobo W. Gang F. Xianli M. Jing Z. Yi Z. The regulatory roles of dietary fibers on host health via gut microbiota-derived short chain fatty acids Curr. Opin. Pharmacol. 62 2022 36 42 10.1016/j.coph.2021.11.001 34896759 88 Kerstin D. Jörg H. Aida I. Julian H. Sébastien L. Kerstin S. Till S. Holger B. Jürgen R. Georg S. Dietary short-term fiber interventions in arthritis patients increase systemic SCFA levels and regulate inflammation Nutrients 12 2020 3207 10.3390/nu12103207 33092271 PMC7589100 89 Thao V.W. Marius V. Investigating the response of the butyrate production potential to major fibers in dietary intervention studies npj Biofilm. Microbiom. 10 2024 10.1038/s41522-024-00511-x PMC11289085 39080292 90 Christina H. Jörn P.K. Ulrike K. Thorsten M. Monika R.B. MCT-induced ketosis and fiber in rheumatoid arthritis (MIKARA)-study protocol and primary endpoint results of the double-blind randomized controlled intervention study indicating effects on disease activity in RA patients Nutrients 15 2023 3719 10.3390/nu15173719 37686750 PMC10490289 91 Hoang D.L. Simon M.L. Harjinder S. Anwesha S. Gastrointestinal digestion of pickering emulsions stabilised by hydrophobically modified cellulose nanocrystals: release of short-chain fatty acids Food Chem. 320 2020 126650 10.1016/j.foodchem.2020.126650 32224422 92 Khalid A.A. Short-chain fatty acids (SCFAs) from gastrointestinal disorders, metabolism, epigenetics, central nervous system to cancer - a mini-review Chem. Biol. Interact. 388 2024 110851 10.1016/j.cbi.2024.110851 38145797 93 Zhang Y. Liu X. Zhao W. Zhang J. Wang A. Wang J. Yang L. Cao B. Yan D. Baicalin circumvents anti-PD-1 resistance by regulating the gut microbiota metabolite short-chain fatty acids Pharmacol. Res. 199 2024 107033 10.1016/j.phrs.2024.107033 38061593 94 Yaqub M.O. Jain A. Joseph C.E. Edison L.K. Microbiome-driven therapeutics: from gut health to precision medicine Gastrointest. Disord. 7 2025 7 10.3390/gidisord7010007 95 Xiuwen W. Lihong P. Dejun N. Jidong Z. Mengmeng S. Zhen Z. Wenqiao G. Enhua Y. Yunfeng T. Guoliang C. Jingfang Granules alleviates the lipid peroxidation induced ferroptosis in rheumatoid arthritis rats by regulating gut microbiota and metabolism of short chain fatty acids J. Ethnopharmacol. 339 2025 119160 10.1016/j.jep.2024.119160 39608616 96 Ying D. Yu W. Feng Z. Jiamu M. Mingxia L. Wei L. Jianling Y. Mengyu S. Yu C. Yunzi L. Polysaccharides from Gaultheria leucocarpa var. yunnanensis (DBZP) alleviates rheumatoid arthritis through ameliorating gut microbiota Int. J. Biol. Macromol. 281 2024 136250 10.1016/j.ijbiomac.2024.136250 39482128 97 Chethan R. Lucy N.K. Jose-Alberto P. Joseph L. Yian Z. Christy L.S. Abraham K. Scott S. Horacio K. Lea A.C. Frequency and burden of gastrointestinal symptoms in familial dysautonomia Clin. Auton. Res. 31 2020 109 116 10.1007/s10286-019-00635-7 33025279 PMC7906911 98 Wenqi L. Yueying L. Chunyu X. Toshimi A. Renrui N. Yiming W. Jianhui Z. Zeping L. Chaoyuan L. Wanguo L. Nanomaterials as therapeutic agents to modulate astrocyte-mediated inflammation in spinal cord injury Mater. Today Bio 23 2023 100888 10.1016/j.mtbio.2023.100888 PMC10704436 38075250 99 Sreeharsha N. Chitrapriya N. Jang Y.J. Kenchappa V. Evaluation of nanoparticle drug-delivery systems used in preclinical studies Ther. Deliv. 12 2021 325 336 10.4155/tde-2020-0122 33759568 100 Campos D. Goméz-García R. Oliveira D. Madureira A.R. Intake of nanoparticles and impact on gut microbiota: in vitro and animal models available for testing Gut Microbiome 3 2022 e1 10.1017/gmb.2022.1 39295775 PMC11406378 101 Jianghua C. Shilin L. Jing Z. Wei S. Congcong J. Jie Z. Jianhong W. Tingting W. Weihua Z. Fanwei Z. Multi-omics profiling reveals potential alterations in rheumatoid arthritis with different disease activity levels Arthritis Res. Ther. 25 2023 10.1186/s13075-023-03148-x PMC10155393 37138305 102 Ashkan R.S. Kasra J. Shadi M. Melika G. Zahra S. Zahra M. Amirreza M. Rasoul M. Role of microbiota short-chain fatty acids in the pathogenesis of autoimmune diseases Biomed. Pharmacother. 162 2023 114620 10.1016/j.biopha.2023.114620 37004324 103 Xiaohao W. Bing H. Jin L. Hui F. Yinghui M. Defang L. Baosheng G. Chao L. Lei D. Luyao W. Molecular insight into gut microbiota and rheumatoid arthritis Int. J. Mol. Sci. 17 2016 431 10.3390/ijms17030431 27011180 PMC4813281 104 Xuan J. Zhenliang J. Jiayin M. Dong Y. Changes in fecal short-chain fatty acids in IBS patients and effects of different interventions: a systematic review and meta-analysis Nutrients 16 2024 1727 10.3390/nu16111727 38892659 PMC11174707 105 Gonzalo P. Manuel C.S. Leticia G.B. Carlos S. Ainoa G.F. Julia R.R. Pilar A.S. Julio B. Abelardo M. García-Portilla M.P. Comparative analysis of gut microbiome-derived short-chain fatty acids in patients with severe mental disorder: insights from schizophrenia and bipolar disorder Prog. Neuropsychopharmacol. Biol. Psychiatry 138 2025 111345 10.1016/j.pnpbp.2024.111345 40147807 106 Dan L. Xinyue Z. Xiangxing M. Nan Z. Jing L. Tianxin W. Shan G. Suwen L. Jilite W. Hao W. Studies on nutritional intervention of ginkgo starch-lauric acid complex in Obese rats induced by a high-fat diet Food Biosci. 53 2023 102644 10.1016/j.fbio.2023.102644 107 Nick Q.B. Tomasz W. Katherine R.S. Lisa L. Johanna L.W. Thomas G. Noa R. Erin M.O. Ophelia S.V. Christian D. Microbial community-scale metabolic modelling predicts personalized short-chain fatty acid production profiles in the human gut Nat. Microbiol. 9 2024 1700 1712 10.1038/s41564-024-01718-6 38914826 PMC11841136 108 Dongsheng C. Yonglun L. Genhong C. Single cell and immunity: better understanding immune cell heterogeneities with single‐cell sequencing Clin. Transl. Discov. 2 2022 10.1002/ctd2.93 109 Sotaro N. Haruka T. Keishi F. Unraveling immune cell heterogeneity in autoimmune arthritis: insights from single-cell RNA sequencing Immunol. Med. 47 2024 217 229 10.1080/25785826.2024.2348521 39120105 110 Gamze A. Duygu A. Microbiota-accessible carbohydrates (MACs) as novel gut microbiome modulators in noncommunicable diseases Heliyon 9 2023 e19623 10.1016/j.heliyon.2023.e19623 PMC10559293 37809641 111 Zhang F. Jonsson A.H. Nathan A. Millard N. Curtis M. Xiao Q. Gutierrez-Arcelus M. Apruzzese W. Watts G.F.M. Weisenfeld D. Deconstruction of rheumatoid arthritis synovium defines inflammatory subtypes Nature 623 2023 616 624 10.1038/s41586-023-06675-3 37938773 PMC10651487 112 Wen S. He L. Zhong Z. Zhao R. Weng S. Mi H. Liu F. Stigmasterol restores the balance of Treg/Th17 cells by activating the Butyrate-PPARγ axis in colitis Front. Immunol. 12 2021 741934 10.3389/fimmu.2021.741934 PMC8526899 34691046 113 Cheng J. Wang S. Lv S.Q. Song Y. Guo N.H. Resveratrol inhibits AhR/Notch axis and reverses Th17/Treg imbalance in purpura by activating Foxp3 Toxicol. Res. 12 2023 381 391 10.1093/toxres/tfad031 PMC10311159 37397914 114 Igudesman D. Crandell J.L. Corbin K.D. Hooper J. Thomas J.M. Bulik C.M. Pence B.W. Pratley R.E. Kosorok M.R. Maahs D.M. Associations of dietary intake with the intestinal microbiota and short-chain fatty acids among young adults with type 1 diabetes and overweight or obesity J. Nutr. 153 2023 1178 1188 10.1016/j.tjnut.2023.02.031 36841667 PMC10356993 115 Zhuang M. Shang W. Ma Q. Strappe P. Zhou Z. Abundance of probiotics and butyrate-production microbiome manages constipation via short-chain fatty acids production and hormones secretion Mol. Nutr. Food Res. 63 2019 e1801187 10.1002/mnfr.201801187 31556210 116 Ozlem O. Gurkan C. Goktan D.U. Erhan K. Metin U. Erdim S. Short-chain fatty acid levels in stools of patients with inflammatory bowel disease are lower than those in healthy subjects Eur. J. Gastroenterol. Hepatol. 36 2024 890 896 10.1097/MEG.0000000000002773 38829943 117 Taubenheim J. Kadibalban A.S. Zimmermann J. Metabolic modeling reveals a multi-level deregulation of host-microbiome metabolic networks in IBD Nat. Commun. 16 2025 5120 10.1038/s41467-025-60233-2 40456745 PMC12130198 118 Wang X. Pan L. Niu D. Zhou J. Shen M. Zeng Z. Gong W. Yang E. Tang Y. Cheng G. Jingfang Granules alleviates the lipid peroxidation induced ferroptosis in rheumatoid arthritis rats by regulating gut microbiota and metabolism of short chain fatty acids J. Ethnopharmacol. 339 2025 119160 10.1016/j.jep.2024.119160 39608616 119 Rauf A. Khalil A.A. Rahman U.U. Khalid A. Naz S. Shariati M.A. Rebezov M. Urtecho E.Z. de Albuquerque R. Anwar S. Recent advances in the therapeutic application of short-chain fatty acids (SCFAs): an updated review Crit. Rev. Food Sci. Nutr. 62 2022 6034 6054 10.1080/10408398.2021.1895064 33703960 120 Chasov V. Gilyazova E. Ganeeva I. Zmievskaya E. Davletshin D. Valiullina A. Bulatov E. Gut microbiota modulation: a novel strategy for rheumatoid arthritis therapy Biomolecules 14 2024 10.3390/biom14121612 PMC11674688 39766360 121 Cao S. Budina E. Wang R. Sabados M. Mukherjee A. Solanki A. Nguyen M. Hultgren K. Dhar A. Hubbell J.A. Injectable butyrate-prodrug micelles induce long-acting immune modulation and prevent autoimmune arthritis in mice J. Contr. Release 372 2024 281 294 10.1016/j.jconrel.2024.06.014 38876359 122 Wu L. Liu H.B. Wang X.W. Tao Z.N. Qu Z.P. Lei C.B. Liu Y.Y. Dai L. Longitudinal profiling of the human gut microbiome reveals temporal and personalized responses to inulin iMetaOmics 2025 e70029 10.1002/imo2.70029 PMC12379954 40881741 123 Xu Q. Liu X. Wang Z. Li X. Jiang Q. Xu M. Recent advancements and comprehensive analyses of butyric acid in cardiovascular diseases Front. Cardiovasc. Med. 12 2025 1608658 10.3389/fcvm.2025.1608658 PMC12336178 40791947 124 Yu M. Chu Y. Wang Y. Mo L. Tan X. Guo S. Yuan S. Ma Y. Metagenomic analysis reveals gut phage diversity across three mammalian models Microbiome 13 2025 146 10.1186/s40168-025-01905-7 40542420 PMC12180220 125 Zhao C. Bao L. Zhao Y. Wu K. Qiu M. Feng L. Zhang N. Hu X. Fu Y. A fiber-enriched diet alleviates Staphylococcus aureus-induced mastitis by activating the HDAC3-mediated antimicrobial program in macrophages via butyrate production in mice PLoS Pathog. 19 2023 e1011108 10.1371/journal.ppat.1011108 PMC9888710 36656870 126 Marazzato M. Iannuccelli C. Guzzo M.P. Nencioni L. Lucchino B. Radocchia G. Gioia C. Bonfiglio G. Neroni B. Guerrieri F. Gut microbiota structure and metabolites, before and after treatment in early rheumatoid arthritis patients: a pilot study Front. Med. 9 2022 921675 10.3389/fmed.2022.921675 PMC9304627 35872763 127 Dürholz K. Hofmann J. Iljazovic A. Häger J. Lucas S. Sarter K. Strowig T. Bang H. Rech J. Schett G. Dietary short-term fiber interventions in arthritis patients increase systemic SCFA levels and regulate inflammation Nutrients 12 2020 10.3390/nu12103207 PMC7589100 33092271 128 Ofori-Kwafo A. Sigdel I. Al Mamun E. Zubcevic J. Tang Y. Gut-on-a-chip platforms: bridging in vitro and in vivo models for advanced gastrointestinal research Phys. Rep. 13 2025 e70356 10.14814/phy2.70356 PMC12051376 40323242 129 Li X. Shi P. Zhang L. Wang H. You X. Zhao G. Advances of gut-on-a-chip for exploring host-microbe interactions Sheng Wu Gong Cheng Xue Bao 40 2024 2916 2933 10.13345/j.cjb.230657 39319715 130 Lee K.W. Shin J.S. Lee C.M. Han H.Y. O Y. Kim H.W. Cho T.J. Gut-on-a-Chip for the analysis of bacteria-bacteria interactions in gut microbial community: what would be needed for bacterial Co-Culture study to explore the diet-microbiota relationship? Nutrients 15 2023 10.3390/nu15051139 PMC10005057 36904133 131 Ballerini M. Galiè S. Tyagi P. A gut-on-a-chip incorporating human faecal samples and peristalsis predicts responses to immune checkpoint inhibitors for melanoma Nat. Biomed. Eng. 9 2025 967 984 10.1038/s41551-024-01318-z 39939548 PMC12176660 132 Morelli M. Kurek D. Ng C.P. Queiroz K. Gut-on-a-Chip models: current and future perspectives for host-microbial interactions research Biomedicines 11 2023 10.3390/biomedicines11020457 PMC9953162 36831155 133 Lee J. Menon N. Lim C.T. Dissecting gut-microbial community interactions using a gut Microbiome-on-a-Chip Adv. Sci. 11 2024 e2302113 10.1002/advs.202302113 PMC11132043 38414327 134 Lee J. Menon N.V. Truong H.D. Lim C.T. Dynamics of spatial organization of bacterial communities in a tunable flow gut Microbiome-on-a-Chip Small 21 2025 e2410258 10.1002/smll.202410258 PMC12087827 40201941 135 Wang X. Zhu Y. Cheng Z. Zhang C. Liao Y. Liu B. Zhang D. Li Z. Fang Y. Emerging microfluidic gut-on-a-chip systems for drug development Acta Biomater. 188 2024 48 64 10.1016/j.actbio.2024.01.042 39299625 136 Valiei A. Aminian-Dehkordi J. Mofrad M.R.K. Gut-on-a-chip models for dissecting the gut microbiology and physiology APL Bioeng. 7 2023 011502 10.1063/5.0126541 PMC9977465 36875738 137 Kupczyk D. Bilski R. Szeleszczuk Ł. Mądra-Gackowska K. Studzińska R. The role of diet in modulating inflammation and oxidative stress in rheumatoid arthritis, ankylosing spondylitis, and psoriatic arthritis Nutrients 17 2025 10.3390/nu17092134 PMC12073256 40362911 138 Lv Y. Yang X. Sun X. Ren X. Immune-microbiota dysregulation in maintenance hemodialysis: a 16S rRNA sequencing-based analysis of gut flora and T cell profiles Ren. Fail. 47 2025 2498630 10.1080/0886022X.2025.2498630 PMC12082729 40375064 139 Byndloss M. Devkota S. Duca F. Hendrik Niess J. Nieuwdorp M. Orho-Melander M. Sanz Y. Tremaroli V. Zhao L. The gut microbiota and diabetes: research, translation, and clinical Applications-2023 diabetes, diabetes care, and diabetologia expert forum Diabetes Care 47 2024 1491 1508 10.2337/dci24-0028 38996003 PMC11362125 140 Jiang Y.R. Liu R.J. Tang J. Li M.Q. Zhang D.K. Pei Z.Q. Fan S.H. Xu R.C. Huang H.Z. Lin J.Z. The health benefits of dietary polyphenols on pediatric intestinal diseases: mechanism of action, clinical evidence and future research progress Phytother Res. 38 2024 3782 3800 10.1002/ptr.8235 38839050 141 Collij V. Klaassen M.A.Y. Weersma R.K. Vila A.V. Gut microbiota in inflammatory bowel diseases: moving from basic science to clinical applications Hum. Genet. 140 2021 703 708 10.1007/s00439-021-02261-8 32857194 PMC8052217 142 Lee D.H. Kim M.T. Han J.H. GPR41 and GPR43: from development to metabolic regulation Biomed. Pharmacother. 175 2024 116735 10.1016/j.biopha.2024.116735 38744220 143 Zhang S. Lv K. Liu Z. Zhao R. Li F. Fatty acid metabolism of immune cells: a new target of tumour immunotherapy Cell Death Discov. 10 2024 10.1038/s41420-024-01949-w PMC10799907 38245525 144 Cai X. Ren F. Yao Y. Gut microbiota and their metabolites in the immune response of rheumatoid arthritis: therapeutic potential and future directions Int. Immunopharmacol. 147 2025 114034 10.1016/j.intimp.2025.114034 39805176 145 Wu Y. Pu X. Wang X. Xu M. Reprogramming of lipid metabolism in the tumor microenvironment: a strategy for tumor immunotherapy Lipids Health Dis. 23 2024 10.1186/s12944-024-02076-2 PMC10832245 38302980 146 Zhang J. Wang W. Liang S. Zhou X. Rekha R.S. Gudmundsson G.H. Bergman P. Ai Q. Mai K. Wan M. Butyrate induces STAT3/HIF-1α/IL-22 signaling via GPCR and HDAC3 inhibition to activate autophagy in head kidney macrophages from turbot (Scophthalmus maximus L.) Fish Shellfish Immunol. 143 2023 109214 10.1016/j.fsi.2023.109214 37977544 147 Moleón J. González-Correa C. Miñano S. Robles-Vera I. de la Visitación N. Barranco A.M. Gómez-Guzmán M. Sánchez M. Riesco P. Guerra-Hernández E. Protective effect of microbiota-derived short chain fatty acids on vascular dysfunction in mice with systemic lupus erythematosus induced by toll like receptor 7 activation Pharmacol. Res. 198 2023 106997 10.1016/j.phrs.2023.106997 37972724 148 Wang L.Y. He L.H. Xu L.J. Li S.B. Short-chain fatty acids: bridges between diet, gut microbiota, and health J. Gastroenterol. Hepatol. 39 2024 1728 1736 10.1111/jgh.16532 38780349 Data availability No data was used for the research described in the article. ",
  "metadata": {
    "Title of this paper": "Short-chain fatty acids: bridges between diet, gut microbiota, and health",
    "Journal it was published in:": "Journal of Translational Autoimmunity",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482344/"
  }
}