{
  "title": "Paper_614",
  "abstract": "Biophys Rev Biophys Rev 3137 biophysrev Biophysical Reviews 1867-2450 1867-2469 Springer PMC11735760 PMC11735760.1 11735760 11735760 39830121 10.1007/s12551-024-01232-3 1232 1 Review Unveiling the multifaceted potential of amyloid fibrils: from pathogenic myths to biotechnological marvels Tyagi Gauri Sengupta Shinjinee ssengupt1@amity.edu https://ror.org/02n9z0v62 grid.444644.2 0000 0004 1805 0217 Amity Institute of Molecular Medicine and Stem Cell Research, Amity University Uttar Pradesh, 30 9 2024 12 2024 16 6 479689 737 751 29 7 2024 18 9 2024 30 09 2025 30 09 2025 17 01 2025 30 09 2025 © International Union for Pure and Applied Biophysics (IUPAB) and Springer-Verlag GmbH Germany, part of Springer Nature 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Amyloid fibrils, historically stigmatized due to their association with diseases like Alzheimer's and Parkinson's, are now recognized as a distinct class of functional proteins with extraordinary potential. These highly ordered, cross-β-sheet protein aggregates are found across all domains of life, playing crucial physiological roles. In bacteria, functional amyloids like curli fibers are essential for surface adhesion, biofilm formation, and viral DNA packaging. Fungal prions exploit amyloid conformations to regulate translation, metabolism, and virulence, while mammalian amyloids are integral to melanin synthesis, hormone storage, and antimicrobial defense. The stability and hydrophobic nature of amyloid scaffolds underpin these diverse biological functions. Beyond their natural roles, amyloid fibrils offer unique capabilities in biomedicine, nanotechnology, and materials science. Their exceptional mechanical strength and biocompatibility make them ideal for controlled drug delivery, tissue engineering scaffolds, and enzyme immobilization. The intrinsic fluorescence and optical properties of certain amyloids open up innovative applications in biosensors, molecular probes, and optoelectronic devices. Furthermore, amyloid fibrils can template metal nanowires, enhance conducting materials, and form nanocomposites by integrating with polymers. This newfound appreciation for the functional diversity of amyloids has ignited intense research efforts to elucidate their molecular mechanisms, stability, and tunable properties. By unraveling the structural intricacies of functional amyloids, researchers aim to harness their remarkable attributes for groundbreaking biomedical therapies, advanced nanomaterials, and sustainable biotechnological innovations. This review explores the transformative journey of amyloids from pathological entities to biotechnological marvels, highlighting their vast potential across agriculture, environmental remediation, and industrial processes. Keywords Amyloids Nanotechnology Hydrogel Antimicrobial Biosensors Drug delivery http://dx.doi.org/10.13039/501100009053 Wellcome Trust DBT India Alliance IA/E/17/1/503663 Sengupta Shinjinee pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © International Union for Pure and Applied Biophysics (IUPAB) and Springer-Verlag GmbH Germany, part of Springer Nature 2024 ",
  "metadata": {
    "Title of this paper": "Unveiling the multifaceted potential of amyloid fibrils: from pathogenic myths to biotechnological marvels",
    "Journal it was published in:": "Biophysical Reviews",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11735760/"
  }
}