{
  "title": "Paper_295",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12485083 PMC12485083.1 12485083 12485083 41028777 10.1038/s41598-025-07480-x 7480 1 Article Application of chemical similarity and bioisosteres to find allosteric inhibitors of type 2 lipid kinase γ Andola Priyanka Pagag Jishu Naresh Gatta K. R. S. Guruprasad Lalitha lalitha.guruprasad@uohyd.ac.in https://ror.org/04a7rxb17 grid.18048.35 0000 0000 9951 5557 School of Chemistry, University of Hyderabad, 30 9 2025 2025 15 478255 33890 16 1 2025 16 6 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Phosphatidylinositol phosphate kinases (PIPKs) exist in three isoforms: I, II, and III. Some of these enzymes are promising drug targets for cancer, metabolic disorders, and neurodegenerative diseases. Type II PIPKs are notable for their dual roles, to perform phosphorylation reactions acting as lipid kinases and to carry out catalytic-independent functions. The dysregulation of Type II PIPKs is linked to several diseases, including psychiatric disorders, cancer, and infections. There is still a need to explore for strong inhibitors of these kinases. This study used a similarity search method to find analogs of the known PI5P4K2C inhibitor, DVF (5-methyl-2-(2-propan-2-ylphenyl)-N-(pyridin-2-ylmethyl)pyrrolo[3,2-d]pyrimidin-4-amine). It utilized open-access platforms like SwissSimilarity, SwissBioisosteres, and the STITCH database for the initial screening of molecules. Drug-likeness assessment of the selected molecules was followed by molecular docking and molecular dynamics simulations to evaluate their binding affinity and stability. Post-simulation analysis revealed four promising hit compounds, each containing a pyrrole-pyrimidine core, which exhibited superior binding free energies and interactions at the allosteric site compared to DVF. These findings highlight potential candidates for further development as PI5P4K2C inhibitors. Keywords Type II phosphatidylinositol 5-phosphate 4-kinase Allosteric site Molecular docking Molecular dynamics simulations MM-PBSA Subject terms Cancer Computational biology and bioinformatics pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The involvement of phosphatidylinositol phosphate kinases (PIPKs) in multiple diseases, particularly human cancers such as lung cancer and breast cancer, has led to interest in developing small molecule inhibitors that target different classes of these kinases. The three types of PIPKs generating phosphatidylinositol bisphosphates are, Type I phosphatidylinositol-4-phosphate 5-kinases (Type I PI4P5Ks), Type II phosphatidylinositol-5-phosphate 4-kinases (Type II PI5P4Ks) and Type III phosphatidylinositol-3-phosphate 5-kinases (PIKfyve). These enzymes catalyze the hydroxyl phosphorylation reaction of specific PI species to form double-phosphorylated lipids sequentially, regulating both substrate and product levels. The PI5P4Ks use phosphatidylinositol 5 phosphate (PI5P) as a substrate to produce PI(4,5)P2, which is essential for autophagosome-lysosome fusion 1 2 3 4 The Type II PI5P4K family consists of three isoforms, encoded by the PI5P4K2A, PI5P4K2B, and PI5P4K2C genes, which give rise to α, β, and γ forms, respectively. Among these isoforms, PI5P4K2A is the most active, while PI5P4K2C has less catalytic activity 5 6 1 7 8 9 10 11 12 A precise regulation of the various PIPKs is crucial for maintaining the cellular PI pool. The altered expression of the α, β, and γ isoforms of Type II PIPKs has been observed in various cancers, including leukemias, glioblastomas, breast cancer and soft tissue sarcomas 13 The development of selective inhibitors for kinases has traditionally centered on the ATP-binding site. For example, I-OMe Tyrphostin AG-538 is a specific ATP-competitive inhibitor of PI5P4K2A, while SAR088m is a pyrimidine-2,4-diamine inhibitor specific to PI5P4K2B. PI5P4K2C has specific inhibitors, such as NCT 504 and NIH-12848 8 14 Recently, “compound 40”, 5-methyl-2-(2-propan-2-ylphenyl)- ~ {N}-(pyridin-2-ylmethyl)pyrrolo[3,2-d]pyrimidin-4-amine (DVF) 15 50 50 D Allosteric binding pockets have been well exploited in the recent past for the purpose of drug design. For example, the virtual screening of diverse molecules from commercial libraries, followed by docking calculations, binding energy prediction, and structural clustering identified inhibitors that bind the allosteric pocket in Caspase-6. These computational findings were confirmed experimentally based on fluorescence-based assays 16 17 18 19 20 22 Although potent inhibitors specific to PI5P4K2C have been reported, there is a need to develop more potent inhibitors specific to PI5P4K2C to explore their therapeutic potential as a drug target. Targeting allosteric binding pockets is a worthwhile strategy specifically for a protein target that has several structurally related proteins. Inhibitors that recognise different binding sites to target PI5P4Ks may improve the selectivity and minimize off-target effects, making them more effective therapeutic agents. Molecular similarity is a crucial concept in drug discovery, based on the assumption that structurally similar molecules display similar properties. Similarity assessments between small molecules proven to be effective in drug discovery are widely used in the early stages of drug development to find novel molecules and enhance the potency or pharmacokinetic properties of lead compounds. In the present work, we employed molecular similarity search and bioisosteric replacement strategies to improve the binding and efficacy of the previously identified small molecule DVF as an allosteric inhibitor of PI5P4K2C lipid kinase as summarised in Fig. 1 Fig. 1 Summary of workflow for the selection of molecules for in silico investigation as PI5P4K2C inhibitors. Results and discussion Allosteric site analysis and validation The structure of PI5P4K2C features an allosteric binding pocket that is bound with DVF (5-methyl-2-(2-propan-2-ylphenyl)- ~ {N}-(pyridin-2-ylmethyl)pyrrolo[3,2-d]pyrimidin-4-amine) and AMP-PNP located close to the N-terminal β-sheet region deposited in the RCSB PDB under ID 7QPN 15 2 pi-alkyl pi-alkyl pi-sigma pi-anion Fig. 2 The non-bonding interactions of the reference molecule, DVF at the allosteric site of PI5P4K2C. The validation of docking was performed to assess the accuracy of the docking procedure. This process involved redocking the reference molecule (DVF) into the allosteric site, followed by superposition and measuring the root mean square deviation (RMSD). The superposition of the docked conformations of the reference molecule DVF in the PI5P4K2C protein model, using PyRx and AutoDock 4.2 for validation purposes, is shown in Fig. 3 Fig. 3 ( A B C Molecule selection All the compounds retrieved from similarity criteria by SwissSimilarity, STITCH, and SwissBioisostere were filtered based on their drug-likeness to eliminate the unfavoured molecules from the present study. Initially, SwissSimilarity generated a total of 800 molecules, including the two classes: ChEMBL (actives only) and ZINC (lead-like) compounds. These molecules were then evaluated based on a similarity score, with a threshold set at 0.75. From this analysis, 143 molecules from the ChEMBL actives class and 115 molecules from the ZINC lead-like class were found to have a similarity score above the threshold, indicating a stronger potential for relatedness. Additionally, the query returned nine molecules in the STITCH server, that possessed Tanimoto scores between 0.53 to 0.57. A higher Tanimoto score (closer to 1) indicates greater similarity between the molecules. Molecules have been classified as similar molecules (Tanimoto scores are > 0.7) and as medium similar molecules (Tanimoto scores between 0.5 and 0.7) 23 The identified molecules were CHEMBL2418346, CHEMBL2418347, AGN-PC-069BQU, AGN-PC-069BM8, AGN-PC-069BM9, AGN-PC-BMA, AGN-PC-ALR, AGN-PC-oMU1T5, AGN-PC-oN9PGP. Chemical-protein interactions (Fig. 4 Fig. 4 The chemical-protein interactions existing between the chemical structures and protein targets. The SwissBioisostere database was utilized to identify similar structures or fragments that returned 33 entries as bioisosteric replacements for the pyrrole-pyrimidine group in the reference molecule DVF. The database provided several fragments along with information on their impact on activity, as well as changes in properties like ΔLogP, ΔTPSA, etc., based on data from literature (PubMed) or bioassays (Assay ID). The results (Fig. S1) were analyzed, and two bioisosteric replacements containing oxygen and sulfur heteroatoms as a replacement for nitrogen heteroatoms 24 ADME study The molecules obtained from different sources were assessed for their drug-likeness properties using a webserver called SwissADME. Among the molecules above the similarity threshold of 0.75, around 133 molecules from ChEMBL and 84 molecules from ZINC qualified for the preliminary drug-likeness properties and were taken further for molecular docking studies. Nine molecules obtained from the STITCH server and two molecules selected from SwissBioisostere also maintained favorable drug-likeness properties and were used for docking studies. The details about the pharmacokinetic properties of the molecules selected for molecular docking studies are provided in Table S1. The computational prediction of absorption, distribution, metabolism, excretion, and toxicity (ADMET) properties is important for the subsequent steps of in-silico drug design. The predicted ADME properties of chemical compounds derived from the SwissADME webserver were analysed and the following results were observed: The TPSA values of the selected molecules ranged between 33.95 to 114.51 Å 2 2 The lipophilicity measured as consensus Log Po/w varied between 0.90 and 4.62 within the optimal range of Log Po/w = -4.0 to 5.6 indicating that molecules can permeate cell membranes easily and distribute effectively. The water solubility determined by Log S value ranged between -2.42 to -6.06 concerning the optimal value of Log S < 6 for the selected molecules suggestive of moderate solubility. The skin permeation factor also termed as Log Kp was recorded between -4.22 cm/s to -7.69 cm/s with respect to optimal value of Log Kp = -6.1 to -0.19 cm/s indicative of moderate to low skin permeability. The synthetic accessibility suggesting ease of synthesis varied from 2.10 to 3.86 with respect to synthetic accessibility scale = 1 to 10. The selected compounds from the applied workflow (Fig. 5 Fig. 5 The workflow of methods employed to identify potential hit molecules using allosteric inhibitor DVF as the query. Molecular docking analysis After the assessment of the drug-likeness properties, the ligand structures obtained from various sources like ChEMBL (actives), ZINC (lead-like), STITCH, and SwissBioisosteres were prepared and utilized for docking purposes in PyRx and AutoDock software. The docking was first conducted in PyRx as a screening tool to identify molecules with greater binding affinity at the allosteric site. These molecules were docked again in AutoDock 4.2 tools to come up with the best hit molecules. In the docking process, a binding affinity value is assigned to each molecule to rank the molecules based on their binding potential. The lower the binding affinity score, the better the binding potential of the ligand. The allosteric binding site comprises residues, Asp161, Met162, Ser164, Asn165, Leu166, Tyr169, Leu182, Pro183, Phe185, Phe272, Leu273, Leu276, Ile278, Tyr281, Leu330, Ile331, Asp332, Ile333, Leu334 and Thr335. The docking results were exported to Discovery Studio Visualizer to examine the binding interactions of the ligands with the receptor. Analysis of two-dimensional (2D) ligand interactions was done to eliminate the molecules from the study that did not form any conventional hydrogen bonds or other non-bonding interactions with the residues present in the PI5P4K2C allosteric site. These 2D protein–ligand interactions are shown in Table 1 1 Pi-alkyl Pi-Pi Pi-Pi Pi-sigma Table 1 The docking scores of reference and ligand molecules at the allosteric site of PI5P4K2C along with the non-bonding interactions. Sl. no IUPAC nomenclature of ligand 2D plot of protein–ligand interactions Docking Score Amino acid residues in non-bonding interactions AutoDock/PyRx (kcal/mol) 1 DVF 2-(2-isopropylphenyl)-5-methyl-N-(pyridin-2-ylmethyl)-5H-pyrrolo[3,2-d]pyrimidin-4-amine -9.26/-10.4 Hydrogen bond- Asn165, Asp332, Thr335 Pi Anion- Asp161 Pi Sigma- Ile278 Pi Alkyl- Met162, Pro183 2 3-(4-morpholino-5H-pyrrolo[3,2-d]pyrimidin-2-yl)phenol -7.38/-8.0 Hydrogen bond- Met162, Leu330, Thr335 Pi Sigma-Tyr169 Pi-Pi T shaped-Phe185 Alkyl and Pi Alkyl- Leu166, Leu182, Pro183 3 (3-(4-morpholino-5H-pyrrolo[3,2-d]pyrimidin-2-yl)phenyl)methanol -7.31/-7.8 Hydrogen bond- Met162, Leu330 Pi-Pi T shaped- Phe185 Pi Alkyl- Leu166, Leu182, Leu273, Ile278 4 2-(2-isopropylphenyl)-5-methyl-4-(pyridin-2-ylmethoxy)-5H-pyrrolo[3,2-d]pyrimidine -9.07/-9.9 vdW and Carbon Hydrogen bond- Leu330 Hydrogen bond- Asn165, Thr335 Alkyl Pi Alkyl- Met162, Tyr169, Leu182, Pro183, Phe272 Pi Sigma- Ile278 5 2-(2-isopropylphenyl)-5-methyl-4-((pyridin-2-ylmethyl)thio)-5H-pyrrolo[3,2-d]pyrimidine -9.18/-8.7 Pi Donor hydrogen bond- Asn165 Hydrogen bond- Thr335 Pi Anion- Asp161 Alkyl and Pi Alkyl- Met162, Leu166, Tyr169, Leu182, Pro183, Phe272, Ile278 6 2-(2-methoxyphenyl)-N-((5-methylpyrazin-2-yl)methyl)quinazolin-4-amine -8.48/-9.6 Carbon Hydrogen bond- Leu330 Hydrogen bond- Asn165, Asp332, Thr335 Pi Sigma- Ile278 Pi-Pi Stacked- Phe185 Pi Sulfur- Met162 Alkyl and Pi Alkyl- Tyr169, Leu182, Pro183, Phe272, Leu273 7 N-(2-(2H-isoindol-1-yl)ethyl)-2-(pyridin-2-yl)quinazolin-4-amine -9.35/-10.0 Hydrogen bond- Met162, Asn165 Pi Anion- Asp161, Asp332 Pi-Pi Stacked-Tyr169 Pi Alkyl-Leu182 8 N-(2,3-dihydro-1H-inden-2-yl)-2-(6-methylpyridin-3-yl)quinazolin-4-amin -9.75/-10.9 Hydrogen bond- Met162, Thr335 Pi-Pi Stacked and Pi Pi T Shaped- Tyr169, Phe185 Alkyl and Pi Alkyl- Leu182, Pro183, Ile331 9 N-(2,3-dihydro-1H-inden-2-yl)-2-(5-methylpyridin-3-yl)quinazolin-4-amine -10.0/-11.1 Hydrogen bond- Met162, Thr335 Pi Pi Stacked- Tyr169 Alkyl and Pi Alkyl- Pro183, Phe185, Leu273, Ile278 10 2-(2-(pyridin-3-yl)quinazolin-4-yl)-2,3,4,9-tetrahydro-1H-pyrido[3,4-b]indole -9.11/-10.2 Hydrogen bond- Asp161, Thr335 vdW and Carbon Hydrogen bond- Asn165, Leu330 Pi Sigma- Met162 Pi Pi T shaped- Phe185 Pi Alkyl- Pro183 Pi Anion- Asp161 11 N4-((1-phenethyl-1H-imidazol-2-yl)methyl)pyrido[2,3-d]pyrimidine-4,7-diamine -8.86/-9.3 vdW and Carbon Hydrogen bond- Met162 Hydrogen bond- Asn165, Ile331 Pi Pi Stacked- Tyr169 Hydrogen bond- Asn165, Ile331 Pi Alkyl- Leu182, Pro183, Leu273, Ile278 12 3-(4-morpholino-5H-pyrrolo[3,2-d]pyrimidin-2-yl)aniline -7.06/-8.0 Hydrogen bond- Met162, Asp332, Thr335 Pi Sigma- Met162 Pi-Pi T shaped- Phe185 Pi Alkyl- Leu166 Thus, from this overall analysis, it was observed that the selected molecules were involved in the conventional non-bonding interactions with the allosteric binding pocket of PI5P4K2C. The protein–ligand interactions formed an essential criterion for the examination of hit molecules for further studies. In addition, the similarity scores between the reference and hit molecules (I-XI) selected from molecular docking were computed using ChemMine Tools available at https://chemminetools.ucr.edu/similarity/ Molecular dynamics simulations The MD simulations studies were used to identify stable protein–ligand complexes. Thirteen molecular systems were analyzed to investigate the protein dynamics of PI5P4K2C, both in its apo form and when complexed with the reference molecule DVF and hit compounds (Hit I to Hit XI), using GROMACS 5.1.4 software. Of these systems, four molecular complexes (Hit I to Hit IV) demonstrated greater stability during 250 ns MD simulations. The extent of deviations in the Cα atoms throughout the MD run was assessed using parameters like RMSD and root mean square fluctuations (RMSF), which were plotted as a function of time. From the protein RMSD plots (Fig. 6 6 6 Fig. 6 The RMSD plots for the apo and complexed states of PI5P4K2C bound to reference and hit molecules as ( A B C The interactions between the hit molecules and residues within the allosteric binding site were examined using the structures from most populated cluster obtained from MD simulations trajectories (Table 2 Table 2 Intermolecular interactions of reference molecule and identified hit molecules (I—IV) bound to PI5P4K2C from the structure of most populated clusters from MD simulations trajectories. Sl. No Ligands Cluster1 Non-bonding interactions in the complex 1 DVF 2-(2-isopropylphenyl)-5-methyl-N-(pyridin-2-ylmethyl)-5H-pyrrolo[3,2-d]pyrimidin-4-amine vdW and carbon hydrogen bond-Asp161 Hydrogen bond- Asn165, Thr335 Pi-Pi T shaped- Tyr169 Alkyl and Pi alkyl-Met162, Pro183, Leu273, Ile278 2 Hit I 3-(4-morpholino-5H-pyrrolo[3,2-d]pyrimidin-2-yl)phenol vdW and carbon hydrogen bond- Asn165 Hydrogen bond- Met162, Leu330 Alkyl and Pi-alkyl- Leu273, Leu276, Ile278 3 Hit II (3-(4-morpholino-5H-pyrrolo[3,2-d]pyrimidin-2-yl)phenyl)methanol vdW and carbon hydrogen bond-Asn165 Hydrogen bond- Met162, Thr335 Alkyl and Pi-alkyl- Leu273, Leu276, Ile278 4 Hit III 2-(2-isopropylphenyl)-5-methyl-4-(pyridin-2-ylmethoxy)-5H-pyrrolo[3,2-d]pyrimidine vdW and carbon hydrogen bond-Leu330 Hydrogen bond- Asn165, Thr335 Pi-sigma-Leu276 Pi-Pi T-shaped and Amide-Pi stacked- Tyr169, Phe185, Ile331 Alkyl and Pi-alkyl-Met162, Leu182, Pro183, Phe272, Ile278 5 Hit IV 2-(2-isopropylphenyl)-5-methyl-4-((pyridin-2-ylmethyl)thio)-5H-pyrrolo[3,2-d]pyrimidine Hydrogen bond- Asn165, Thr335 Pi-Pi stacked- Phe185 Alkyl and Pi-alkyl-Met162, Tyr169, Leu182, Pro183, Phe272, Leu273, Leu276, Ile278 Mechanical stiffness and normal mode analysis The mechanical stiffness plots of all the molecular systems were generated using the Anisotropic Network Model. The study was carried out to gain information about the relative mobilities of regions under tension and resistance to deformation as they might be relevant for biological function. The mean value of the effective spring constant was computed for all the molecular systems. In the mechanical resistance map (Fig. S4) the blue-colored regions indicate mechanically stiff regions while red-colored regions denote easily deformable parts of the protein. Interestingly, in the apo protein, only the disordered N-terminal amino acid region Val34-Gln36 was mechanically weak with a spring constant value close to 6.3 k (a.u), while the rest of the apo PI5P4K2C displayed a relative stable structure with > 7 k (a.u). The Hit II and Hit IV showed a mechanically weak region with a spring constant value close to 6.4 and 6.5 k (a.u) at Gly303-Phe305. While the PI5P4K2C complex with Hit III displayed mechanically weak region around His345-Thr360 with a spring constant value close to 6.2 k (a.u). In general, the regions Asn86-Arg91, glycine-rich loop Gly135-Asp138, Ser225-Lys231, Asn247-Asn249, Glu295-Phe305 and Lys341-Thr360 with an effective spring constant value lower than 8 k (a.u) reflected the lower mechanical stiffness. These regions are more disposed to deformation than others. While the stable regions in the protein with well-defined secondary structures displayed an effective spring constant value around 11 k (a.u) in the mean plots. Thus, through this study elastic nature of the PI5P4K2C protein was studied. NMA is a simple and fast method to determine the vibrational modes and flexibility in the protein. It provides a time-independent approach to gain an understanding of the mechanism of slow and large amplitude motions. The protein dynamics analysis using NMA was carried out and ten normal modes were calculated for each molecular system. Among these first three modes were chosen and studied for comparison with the apo structure of PI5P4K2C. The study revealed the flexible regions corresponding to the N-terminal loop region in the apo PI5P4K2C and in complex with Hit II and Hit III. In all the structures, residues Asn86-Arg91 that form a connecting loop between the two β strands in the N-terminal domain showed highest mobility. The complex with Hit IV showed the least mobility among all the molecular systems studied. The complex with Hit II displayed a dynamical structure in highly mobile loops situated near the hinge binding pocket i.e. Principal component analysis and free energy landscapes The various structural and conformational changes involved during protein–ligand binding can be studied using the essential dynamics, employing PCA. In this method, eigen vectors and eigen values are calculated to describe the motion of atoms as well as the atomic contribution for that movement during MD trajectories of protein. The PCA calculations were performed for the 250 ns MD simulations trajectories of each molecular system. The resultant 25,000 frames were utilized to know the Cα atom’s motion as a function of time. The PC1 and PC2 projected into two-dimensional space as they captured most of the variance and conformational ensembles of PI5P4K2C were analysed. The representation of scatter plots for each molecular system is provided in Fig. 7 7 Fig. 7 The PCA scatter plots for PI5P4K2C in (A) apo and complexes bound to (B) DVF (C) Hit I (D) Hit II (E) Hit III (F) Hit IV. The 2D free energy landscape (FEL) plots of PI5P4K2C in apo form and when bound to reference and hit molecules (Hit I to Hit IV) were constructed to understand the free energy profiles (Fig. S5) due to changes in the conformational dynamics during 250 ns MD simulations run. The plots were generated using the eigen vectors obtained from PCA. The 2D contour maps indicate the regions with high or low energy structures. The red colour patterns determine the maximum energy structures and the regions with minimum energy structures are indicated with a deep blue colour. The apo PI5P4K2C covered larger ranges of PC1 and PC2 (18.1 kJ/mol), indicating a more rugged free energy surface than the complexed protein. The apo protein clearly showed one free energy well in four basins. When complexed with reference, Hit II and Hit III molecules there are two energy wells in four basins. While the Hit I and Hit II displayed one conspicuous free energy well in more than 3 basins. The apo PI5P4K2C showed Gibbs free energy in the range of 0 to 18.1 kJ/mol while the PI5P4K2C bound to reference molecule DVF and other hit molecules exhibited Gibbs free energy in the range of 0 to 17 kJ/mol. This observation suggested that the apo protein underwent significant structural alterations compared to its initial state while the molecular complexes of PI5P4K2C bound to reference and hit molecules were more stable. CarcinoPred-EL study The toxicity of reference and selected hit molecules as potential carcinogens were studied from CarcinoPred-EL server. It was found that all the four hit molecules were predicted to be non-carcinogens by Ensemble RF, Ensemble SVM, and Ensemble XGBoost models. The details involved in the prediction of class for the studied molecules are represented in Table 3 Table 3 Prediction of chemical carcinogenicity for reference and identified hit molecules. Ligand Ensemble CDK CDKExt CDKGraph KR KRC MACCS Pubchem Average Class DVF RF 0.45 0.46 0.37 0.44 0.43 0.57 0.37 0.44 Non-Carcinogen SVM 0.60 0.43 0.49 0.46 0.46 0.60 0.52 0.51 Carcinogen XGBoost 0.07 0.19 0.47 0.45 0.85 0.63 0.76 0.49 Non-Carcinogen Hit I RF 0.42 0.34 0.34 0.46 0.62 0.34 0.42 0.42 Non-Carcinogen SVM 0.39 0.40 0.39 0.38 0.49 0.33 0.43 0.40 Non-Carcinogen XGBoost 0.07 0.19 0.47 0.45 0.78 0.63 0.76 0.48 Non-Carcinogen Hit II RF 0.39 0.36 0.35 0.39 0.54 0.30 0.32 0.38 Non-Carcinogen SVM 0.40 0.38 0.41 0.32 0.44 0.29 0.39 0.37 Non-Carcinogen XGBoost 0.07 0.19 0.47 0.45 0.78 0.63 0.76 0.48 Non-Carcinogen Hit III RF 0.40 0.39 0.48 0.36 0.53 0.35 0.40 0.42 Non-Carcinogen SVM 0.31 0.41 0.53 0.36 0.35 0.35 0.44 0.39 Non-Carcinogen XGBoost 0.07 0.19 0.47 0.45 0.70 0.63 0.76 0.47 Non-Carcinogen Hit IV RF 0.45 0.39 0.40 0.29 0.50 0.44 0.29 0.39 Non-Carcinogen SVM 0.36 0.38 0.52 0.24 0.28 0.38 0.37 0.36 Non-Carcinogen XGBoost 0.07 0.19 0.47 0.45 0.70 0.63 0.76 0.47 Non-Carcinogen Bioactivity prediction study The selected hit molecules were evaluated for the potential to inhibit Type II PI5P4K2C using the predict bioactivity tool in Molinspiration Chemoinformatics [Molinspiration Cheminformatics free web services, Slovensky Grob, Slovakia]. The predicted bioactivity scores as kinase inhibitor for reference and hit molecules (I-IV) were found to be 0.24, 0.33, 0.71, 0.47, and -0.07 respectively. The bioactivity prediction analysis indicated that the hit molecules can exhibit promising activity towards PI5P4K2C, as measured by bioactivity scores for kinase inhibitors. The hit molecules specifically Hit I to Hit III, showed higher scores than the reference molecule, with scores ranging from 0.33 to 0.71 as kinase inhibitors. In contrast, Hit IV exhibited the least potential and showed a negative value of predicted kinase inhibitory activity. Binding free energy calculations The binding energies of the molecular systems were calculated using the g_mmpbsa 4 Table 4 Binding free energies (kJ/mol) from MM-PBSA study of reference molecule DVF, and identified hit molecules bound to PI5P4K2C. Sl. No Ligand vdW Energy Electrostatic Energy Polar Solvation Energy SASA Energy ∆G (MM-PBSA) Ref -101.044 ± 2.127 -23.765 ± 0.519 65.324 ± 1.241 -8.954 ± 0.190 -68.439 ± 1.799 Hit I -102.695 ± 1.475 -35.003 ± 0.595 83.532 ± 1.062 -10.711 ± 0.149 -64.925 ± 1.192 Hit II -148.159 ± 1.479 -40.713 ± 0.422 99.208 ± 0.862 -13.890 ± 0.139 -103.639 ± 1.258 Hit III -215.035 ± 0.551 -41.866 ± 0.172 111.946 ± 0.365 -18.734 ± 0.048 -163.677 ± 0.488 Hit IV -200.877 ± 0.941 -35.015 ± 0.269 103.247 ± 0.520 -17.908 ± 0.084 -150.650 ± 0.849 Further breakdown of the energy components; vdW, electrostatic, polar, and apolar energies showed that the hit molecule-bound systems had higher contributions from these interactions than the reference molecule. This suggests that the enhanced stability of Hit II, Hit III, and Hit IV is likely due to stronger non-covalent interactions, which contribute to their more favorable binding energies. The contribution of individual residues to the binding free energy was also analyzed, as illustrated in Fig. 8 Fig. 8 The residue contribution in binding free energy values calculated for PI5P4K2C complexes bound to reference molecule DVF and identified hit molecules (Hit I-Hit IV). From the residue contribution plot, it was observed that amino acid residues such as Met162, Tyr169, Pro183, Phe185, Leu273, Leu276, Ile278, and Leu334 in the allosteric site contributed more towards the binding free energy values. The findings of the study aligned with results obtained from docking studies since these residues were seen to be involved in several non-bonding interactions with ligands. Thus, from this study, it is inferred that Hit II, Hit III, and Hit IV molecules possess lower ΔG values in comparison to the reference molecule. Conclusions PI5P4K lipid kinases are critical regulators of various cellular processes, including lipid transport, integral membrane protein signaling, and the recruitment of proteins to different intracellular locations. Previous studies have identified PI5P4Ks as promising drug targets for the treatment of neurodegenerative and immunological disorders, as well as cancer. However, the development of potent inhibitors against these lipid kinases has been limited, highlighting the need for further research. While the 3D crystal structures of PI5P4K2C complexed with inhibitors have been solved, these inhibitors bind at the ATP-binding site, presenting a challenge for achieving selectivity. Thus, targeting allosteric sites on lipid kinases offers a more selective therapeutic approach. One such allosteric inhibitor, DVF, has been identified to bind to PI5P4K2C, as in PDB ID 7QPN. This study aimed to identify structural analogs from different sources that bear similarity to the DVF molecule and investigate them as potential allosteric inhibitors by in-silico methods. Hence, structurally similar compounds were explored to identify potent molecules with enhanced binding affinity and improved pharmacokinetic properties than the reference molecule DVF. To achieve this, chemical and structurally similar molecules (~ 269) were collected from sources such as SwissSimilarity, STITCH, and Swiss Bioisostere. Initial screening of the generated output molecules for drug-likeness was followed by molecular docking and visualization of protein–ligand interactions to evaluate binding affinity. From the docking studies, 12 hit molecules were identified, which were further evaluated for their stability through MD simulations when complexed with PI5P4K2C. The dynamic behaviour and structural stability of PI5P4K2C bound to hit molecules were monitored. Post-simulation analysis revealed that molecular complexes involving Hit I to Hit IV molecules demonstrated strong binding at the allosteric site of PI5P4K2C and remained stable throughout the 250 ns MD simulations. In addition, NMA, mechanical stiffness, and PCA were carried out to study the structural conformations and variations of Type II PI5P4K2C bound to these hit molecules. Evaluation of the molecules (Hit I to Hit IV) for carcinogenicity and predicted bioactivity suggested Hit I, Hit II, and Hit III molecules to be better structural analogs for DVF as they exhibited greater predicted kinase inhibitory potential than DVF and were non-carcinogenic. Moreover, Hit II, Hit III, and Hit IV identified as (3-(4-morpholino-5H-pyrrolo[3,2-d]pyrimidin-2-yl)phenyl)methanol, 2-(2-isopropylphenyl)-5-methyl-4-(pyridin-2-ylmethoxy)-5H-pyrrolo[3,2-d]pyrimidine, and 2-(2-isopropylphenyl)-5-methyl-4-((pyridin-2-ylmethyl)thio)-5H-pyrrolo[3,2-d]pyrimidine, respectively exhibited greater binding free energies than the reference molecule, DVF. Thus, these findings highlight Hit I, Hit II, and Hit III with their favorable non-bonding interactions and greater binding free energies compared to DVF as potential candidates for further development as PI5P4K2C allosteric inhibitors. These hit molecules with pyrrole-pyrimidine as the core moiety similar to DVF have the potential to bind to Type II PI5P4K2C protein with good affinity and can be used to design novel anticancer agents. These analyses provide valuable insights for the future design of potent drug candidates, particularly for targeting cancer. Further experimental studies may be needed to gain a clear understanding of the allosteric inhibitory potential of Hit I, Hit II, and Hit III molecules against PI5P4K2C. Materials and methods Protein preparation The crystal structure of the γ isoform, PI5P4K2C, bound to the allosteric inhibitor DVF, with PDB ID 7QPN, was selected as the target protein for this study. The missing residues in the crystal structure of the protein (PDB ID: 7QPN) were built into the model structures predicted by the I-TASSER server 25 Construction of ligand library Drugs with similar chemical structures have been found to exhibit similar pharmacological actions 26 27 28 29 30 SwissSimilarity SwissSimilarity is a web tool that rapidly screens small molecules for potential ligands. It uses various approaches, including 2D molecular fingerprints (like FP2) and 3D similarity methods (such as Align-IT and Shape-IT), to make efficient predictions. SwissSimilarity has been used to build libraries for identifying histamine H3 receptor ligands 31 32 In this study, we chose the ChEMBL database 33 34 STITCH database The chemical structures available in the STITCH database, accessible at ( http://stitch.embl.de SwissBioisostere The lead optimization step in drug discovery is both time-consuming and challenging. This is because even slight modifications to active compounds against a target of interest can disrupt the balance between potency and key parameters like toxicity, bioavailability and metabolic stability. However, understanding bioisosteres can help identify analogs for synthesis, allow fine-tuning the biological and biophysical properties of the active compound, as seen with the reference molecule DVF in our study. The SwissBioisostere database, accessible at http://www.swissbioisostere.ch 35 The number of molecules with similar chemical structures to reference molecule DVF was compiled and downloaded in SDF format from SwissSimilarity, STITCH database, and SwissBioisostere. Before proceeding to molecular docking studies, these molecules were examined for their drug likeliness as a pre-filtering step. ADME study For a molecule to act as a drug, it must have the right physicochemical and pharmacokinetic properties. Studying ADMET properties of chemical structures early in the drug discovery pipeline can reduce failures in later clinical trials. Parameters like polarity, lipophilicity, size, water solubility, saturation, and gastrointestinal absorption are useful in determining a chemical compound’s drug-likeness. Moreover, evaluating molecules based on relevant pharmaceutical physicochemical properties—such as MW, number of rotatable bonds, number of hydrogen bond acceptors, number of hydrogen bond donors, and Lipinski’s rule of five helps ensure the study of clinically safer compounds. In the present study, we estimated lipophilicity, polar surface area, solubility, skin permeation, and synthetic accessibility scale (1–10) measured by descriptors like Log Po/w (-4.0 to 5.6), TPSA (0 to 140 Å 2 36 37 Molecular docking The type II lipid kinase PI5P4K2C bound to the reference molecule DVF was chosen as the target structure for virtual screening using PyRx 38 39 Similarly, ligands were loaded, and torsions were set to save them in pdbqt format. A grid box was defined around the inhibitor molecule DVF, centered at X = 63.470 Å, Y = 53.110 Å, and Z = 47.470 Å, which included the binding site residues. The grid box had a spacing of 0.375 Å. For each ligand, 10 docking poses were generated, with a maximum of 27,000 generations per GA run. The crossover rate was set to 0.8, and the gene mutation rate was set to 0.02. The conformers obtained for each ligand were visualized in the Discovery studio visualizer to analyze the non-bonding interactions at the allosteric site. To validate the docking protocol, the co-crystallized inhibitor DVF was re-docked at its allosteric site in the protein. The re-docked complex was superposed with the initial complex in UCSF Chimera, and the RMSD between the two complexes was calculated. This analysis assessed the docking protocols’ efficiency and accuracy. The molecules with high binding affinity and a greater number of interactions in the allosteric site were selected for further MD studies. Molecular dynamics simulations The MD simulations study provides information about the conformational stability of protein–ligand complexes. To investigate this, MD simulations were conducted for the Type 2 PI5P4K2C model structure in both its apo form and complexed state, where the latter was complexed with the reference molecule and shortlisted compounds from molecular docking. The simulations ran for 250 ns using GROMACS 5.1.4 software 40 41 42 43 44 + - 45 46 47 –6 The Lennard–Jones and real space electrostatic interactions were cut off at 9 Å, and hydrogen bonds were constrained using the LINCS algorithm 48 49 50 51 Mechanical stiffness and normal mode analysis The MechStiff application of ProDy 52 53 54 55 Principal component analysis and free energy landscapes The global or correlated motions of the protein 56 57 58 59 FEL analysis was performed for all the molecular complexes from 250 ns MD simulation trajectories to understand the essential movement of PI5P4K2C protein in apo state and in hit molecules bound complexes. The GROMACS ‘gmx covar’, ‘gmx anaeig’ and ‘gmx sham’ modules were employed to construct FEL from the principal components (PC1 and PC2). The distribution of stable conformations and structural states were analysed from these landscapes. The following equation was used to calculate FEL: ΔG(PC1,PC2) = -k B Here PC1 and PC2 represent the reaction coordinates, Boltzmann constant is represented by k B Carcinogenicity prediction study Evaluation of the proposed hit molecules for toxicity remains the most important step in the drug development process. Cancer-causing chemicals known as carcinogens may result in serious health effects. Therefore, to prevent drug-induced cancer carcinogenicity tests must be performed for the new compounds before approving their curability. An online carcinogenicity prediction server, CarcinoPred-EL 60 Bioactivity prediction The inhibitory potential of the hit molecules that formed stable protein–ligand complexes was examined through the prediction of bioactivities using an online server called Molinspiration Chemoinformatics available at https://www.molinspiration.com Binding free energy calculations The molecular processes including molecular associations, chemical reactions, and protein folding are all driven by free energy. Moreover, the binding affinity of ligands in the protein–ligand complex can be assessed from the binding free energy calculations. The MM-PBSA 61 The expression of ΔG binding 62 63 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\Delta {\\text{G}}_{{{\\text{binding}}}} = {\\text{ G}}_{{{\\text{complex}}}} {-} \\, \\left( {{\\text{G}}_{{{\\text{protein}}}} + {\\text{ G}}_{{{\\text{ligand}}}} } \\right);$$\\end{document} G complex G protein ligand Thus g_mmpbsa tool was utilized to compute binding free energies for protein–ligand complexes comprising the reference molecule DVF and hit molecules from MD studies. The output trajectories obtained from MD simulations (250 ns) in GROMACS were employed for evaluating the ΔG binding Supplementary Information  Supplementary Information. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-07480-x. Acknowledgements P.A. thanks UGC, New Delhi for research fellowship, J.P. thanks University of Hyderabad for UGC Non-NET fellowship and IoE PhD fellowship, G.K.R.S.N. thanks UGC Non-NET fellowship. The authors thanks CMSD, University of Hyderabad for computational facilities. The authors thank DST-PURSE and UGC UPE2 and IOE for funding and CMSD for computational facilities. Author contributions P.A. carried out the research work, methodologies and wrote the manuscript. J.P. assisted in carrying out some methodologies. G.K.R.S.N. provided skill support and discussed the methods. L.G. conceived the idea, supervised and wrote the manuscript. Data availability The datasets used and/or analysed during the current study are available from the supplementary data. Declarations Competing interests The authors declare no competing interests. References 1. Lundquist MR Goncalves MD Loughran RM Possik E Vijayaraghavan T Yang A Pauli C Ravi A Verma A Yang Z Johnson JL Phosphatidylinositol-5-phosphate 4-kinases regulate cellular lipid metabolism by facilitating autophagy Mol. Cell 2018 70 3 531 544 10.1016/j.molcel.2018.03.037 29727621 PMC5991623 Lundquist, M. R. et al. Phosphatidylinositol-5-phosphate 4-kinases regulate cellular lipid metabolism by facilitating autophagy. Mol. Cell 70 29727621 10.1016/j.molcel.2018.03.037 PMC5991623 2. De Leo MG Staiano L Vicinanza M Luciani A Carissimo A Mutarelli M Di Campli A Polishchuk E Di Tullio G Morra V Levtchenko E Autophagosome–lysosome fusion triggers a lysosomal response mediated by TLR9 and controlled by OCRL Nat. Cell Biol. 2016 18 8 839 850 10.1038/ncb3386 27398910 PMC5040511 De Leo, M. G. et al. Autophagosome–lysosome fusion triggers a lysosomal response mediated by TLR9 and controlled by OCRL. Nat. Cell Biol. 18 27398910 10.1038/ncb3386 PMC5040511 3. Jones DR Bultsma Y Keune WJ Halstead JR Elouarrat D Mohammed S Heck AJ D'Santos CS Divecha N Nuclear PtdIns5P as a transducer of stress signaling: an in vivo role for PIP4Kbeta Mol. Cell 2006 23 5 685 695 10.1016/j.molcel.2006.07.014 16949365 Jones, D. R. et al. Nuclear PtdIns5P as a transducer of stress signaling: an in vivo role for PIP4Kbeta. Mol. Cell 23 16949365 10.1016/j.molcel.2006.07.014 4. Wilcox A Hinchliffe KA Regulation of extranuclear PtdIns5P production by phosphatidylinositol phosphate 4-kinase 2α FEBS Lett. 2008 582 9 1391 1394 10.1016/j.febslet.2008.03.022 18364242 Wilcox, A. & Hinchliffe, K. A. Regulation of extranuclear PtdIns5P production by phosphatidylinositol phosphate 4-kinase 2α. FEBS Lett. 582 18364242 10.1016/j.febslet.2008.03.022 5. Bulley SJ Clarke JH Droubi A Giudici ML Irvine RF Exploring phosphatidylinositol 5-phosphate 4-kinase function Adv. Biol. Reg. 2015 1 57 193 202 10.1016/j.jbior.2014.09.007 PMC4359101 25311266 Bulley, S. J., Clarke, J. H., Droubi, A., Giudici, M. L. & Irvine, R. F. Exploring phosphatidylinositol 5-phosphate 4-kinase function. Adv. Biol. Reg. 1 10.1016/j.jbior.2014.09.007 PMC4359101 25311266 6. Clarke JH Irvine RF The activity, evolution and association of phosphatidylinositol 5-phosphate 4-kinases Adv. Biol. Regul. 2012 52 1 40 45 10.1016/j.advenzreg.2011.09.002 21945524 Clarke, J. H. & Irvine, R. F. The activity, evolution and association of phosphatidylinositol 5-phosphate 4-kinases. Adv. Biol. Regul. 52 21945524 10.1016/j.advenzreg.2011.09.002 7. Bultsma Y Keune WJ Divecha N PIP4Kβ interacts with and modulates nuclear localization of the high-activity PtdIns5 P-4-kinase isoform PIP4Kα Biochem. J. 2010 430 2 223 235 10.1042/BJ20100341 20583997 Bultsma, Y., Keune, W. J. & Divecha, N. PIP4Kβ interacts with and modulates nuclear localization of the high-activity PtdIns5 P-4-kinase isoform PIP4Kα. Biochem. J. 430 20583997 10.1042/BJ20100341 8. Al-Ramahi I Giridharan SS Chen YC Patnaik S Safren N Hasegawa J de Haro M Wagner Gee AK Titus SA Jeong H Clarke J Inhibition of PIP4Kγ ameliorates the pathological effects of mutant huntingtin protein Elife 2017 6 e29123 10.7554/eLife.29123 29256861 PMC5743427 Al-Ramahi, I. et al. Inhibition of PIP4Kγ ameliorates the pathological effects of mutant huntingtin protein. Elife 6 29256861 10.7554/eLife.29123 PMC5743427 9. Wang DG Paddock MN Lundquist MR Sun JY Mashadova O Amadiume S Bumpus TW Hodakoski C Hopkins BD Fine M Hill A PIP4Ks suppress insulin signaling through a catalytic-independent mechanism Cell Rep. 2019 27 7 1991 2001 10.1016/j.celrep.2019.04.070 31091439 PMC6619495 Wang, D. G. et al. PIP4Ks suppress insulin signaling through a catalytic-independent mechanism. Cell Rep. 27 31091439 10.1016/j.celrep.2019.04.070 PMC6619495 10. Sharma S Mathre S Ramya V Shinde D Raghu P Phosphatidylinositol 5 phosphate 4-kinase regulates plasma-membrane PIP3 turnover and insulin signaling Cell Rep. 2019 27 7 1979 1990 10.1016/j.celrep.2019.04.084 31091438 PMC6591132 Sharma, S., Mathre, S., Ramya, V., Shinde, D. & Raghu, P. Phosphatidylinositol 5 phosphate 4-kinase regulates plasma-membrane PIP3 turnover and insulin signaling. Cell Rep. 27 31091438 10.1016/j.celrep.2019.04.084 PMC6591132 11. Zheng L Conner SD PI5P4Kγ functions in DTX1-mediated Notch signaling Proc. Natl. Acad. Sci. 2018 115 9 E1983 E1990 10.1073/pnas.1712142115 29440432 PMC5834675 Zheng, L. & Conner, S. D. PI5P4Kγ functions in DTX1-mediated Notch signaling. Proc. Natl. Acad. Sci. 115 29440432 10.1073/pnas.1712142115 PMC5834675 12. Raychaudhuri S Remmers EF Lee AT Hackett R Guiducci C Burtt NP Gianniny L Korman BD Padyukov L Kurreeman FA Chang M Common variants at CD40 and other loci confer risk of rheumatoid arthritis Nat. Genet. 2008 40 10 1216 1223 10.1038/ng.233 18794853 PMC2757650 Raychaudhuri, S. et al. Common variants at CD40 and other loci confer risk of rheumatoid arthritis. Nat. Genet. 40 18794853 10.1038/ng.233 PMC2757650 13. Arora GK Palamiuc L Emerling BM Expanding role of PI5P4Ks in cancer: A promising druggable target FEBS Lett. 2022 596 1 3 16 10.1002/1873-3468.14237 34822164 PMC9154051 Arora, G. K., Palamiuc, L. & Emerling, B. M. Expanding role of PI5P4Ks in cancer: A promising druggable target. FEBS Lett. 596 34822164 10.1002/1873-3468.14237 PMC9154051 14. Clarke JH Giudici ML Burke JE Williams RL Maloney DJ Marugan J Irvine RF The function of phosphatidylinositol 5-phosphate 4-kinase γ (PI5P4Kγ) explored using a specific inhibitor that targets the PI5P-binding site Biochem. J. 2015 466 2 359 367 10.1042/BJ20141333 25495341 PMC4687057 Clarke, J. H. et al. The function of phosphatidylinositol 5-phosphate 4-kinase γ (PI5P4Kγ) explored using a specific inhibitor that targets the PI5P-binding site. Biochem. J. 466 25495341 10.1042/BJ20141333 PMC4687057 15. Boffey HK Rooney TP Willems HM Edwards S Green C Howard T Ogg D Romero T Scott DE Winpenny D Duce J Development of selective phosphatidylinositol 5-phosphate 4-kinase γ inhibitors with a non-ATP-competitive, allosteric binding mode J. Med. Chem. 2022 65 4 3359 3370 10.1021/acs.jmedchem.1c01819 35148092 PMC9097471 Boffey, H. K. et al. Development of selective phosphatidylinositol 5-phosphate 4-kinase γ inhibitors with a non-ATP-competitive, allosteric binding mode. J. Med. Chem. 65 35148092 10.1021/acs.jmedchem.1c01819 PMC9097471 16. Tubeleviciute-Aydin A Beautrait A Lynham J Sharma G Gorelik A Deny LJ Soya N Lukacs GL Nagar B Marinier A LeBlanc AC Identification of allosteric inhibitors against active caspase-6 Sci. Rep. 2019 9 1 5504 10.1038/s41598-019-41930-7 30940883 PMC6445123 Tubeleviciute-Aydin, A. et al. Identification of allosteric inhibitors against active caspase-6. Sci. Rep. 9 30940883 10.1038/s41598-019-41930-7 PMC6445123 17. Rana N Patel D Parmar M Mukherjee N Jha PC Manhas A Targeting allosteric binding site in methylenetetrahydrofolate dehydrogenase 2 (MTHFD2) to identify natural product inhibitors via structure-based computational approach Sci. Rep. 2023 13 1 18090 10.1038/s41598-023-45175-3 37872243 PMC10593809 Rana, N. et al. Targeting allosteric binding site in methylenetetrahydrofolate dehydrogenase 2 (MTHFD2) to identify natural product inhibitors via structure-based computational approach. Sci. Rep. 13 37872243 10.1038/s41598-023-45175-3 PMC10593809 18. Vettoretti G Moroni E Sattin S Tao J Agard DA Bernardi A Colombo G Molecular dynamics simulations reveal the mechanisms of allosteric activation of Hsp90 by designed ligands Sci. Rep. 2016 6 1 23830 10.1038/srep23830 27032695 PMC4817115 Vettoretti, G. et al. Molecular dynamics simulations reveal the mechanisms of allosteric activation of Hsp90 by designed ligands. Sci. Rep. 6 27032695 10.1038/srep23830 PMC4817115 19. Schoepfer J, Jahnke W, Berellini G, Buonamici S, Cotesta S, Cowan-Jacob SW, Dodd S, Drueckes P, Fabbro D, Gabriel T, Groell JM. Discovery of asciminib (ABL001), an allosteric inhibitor of the tyrosine kinase activity of BCR-ABL1. 10.1021/acs.jmedchem.8b01040 10.1021/acs.jmedchem.8b01040 30137981 20. Guruprasad L, Andola P, Banerjee A, Laxman D, Naresh GK. Structure-based methods in drug design. InCheminformatics, QSAR and Machine Learning Applications for Novel Drug Development 2023 Jan 1 (pp. 205–237). Academic Press. 10.1016/B978-0-443-18638-7.00003-7 21. Li R He X Wu C Li M Zhang J Advances in structure-based allosteric drug design Curr. Opin. Struct. Biol. 2025 1 90 102974 10.1016/j.sbi.2024.102974 39736214 Li, R., He, X., Wu, C., Li, M. & Zhang, J. Advances in structure-based allosteric drug design. Curr. Opin. Struct. Biol. 1 10.1016/j.sbi.2024.102974 39736214 22. Zhu R Wu C Zha J Lu S Zhang J Decoding allosteric landscapes: computational methodologies for enzyme modulation and drug discovery RSC Chem. Biol. 2025 10.1039/D4CB00282B 39981029 PMC11836628 Zhu, R., Wu, C., Zha, J., Lu, S. & Zhang, J. Decoding allosteric landscapes: computational methodologies for enzyme modulation and drug discovery. RSC Chem. Biol. 39981029 10.1039/d4cb00282b PMC11836628 23. He J Nittinger E Tyrchan C Czechtizky W Patronov A Bjerrum EJ Engkvist O Transformer-based molecular optimization beyond matched molecular pairs J. Cheminformatics. 2022 14 1 18 10.1186/s13321-022-00599-3 PMC8962145 35346368 He, J. et al. Transformer-based molecular optimization beyond matched molecular pairs. J. Cheminformatics. 14 10.1186/s13321-022-00599-3 PMC8962145 35346368 24. Oguro Y Miyamoto N Okada K Takagi T Iwata H Awazu Y Miki H Hori A Kamiyama K Imamura S Design, synthesis, and evaluation of 5-methyl-4-phenoxy-5H-pyrrolo [3, 2-d] pyrimidine derivatives: novel VEGFR2 kinase inhibitors binding to inactive kinase conformation Bioorg. Med. Chem. 2010 18 20 7260 7273 10.1016/j.bmc.2010.08.017 20833055 Oguro, Y. et al. Design, synthesis, and evaluation of 5-methyl-4-phenoxy-5H-pyrrolo [3, 2-d] pyrimidine derivatives: novel VEGFR2 kinase inhibitors binding to inactive kinase conformation. Bioorg. Med. Chem. 18 20833055 10.1016/j.bmc.2010.08.017 25. Zhang Y I-TASSER server for protein 3D structure prediction BMC Bioinf. 2008 9 1 8 10.1186/1471-2105-9-40 PMC2245901 18215316 Zhang, Y. I-TASSER server for protein 3D structure prediction. BMC Bioinf. 9 10.1186/1471-2105-9-40 PMC2245901 18215316 26. Martin YC Kofron JL Traphagen LM Do structurally similar molecules have similar biological activity? J. Med. Chem. 2002 45 19 4350 4358 10.1021/jm020155c 12213076 Martin, Y. C., Kofron, J. L. & Traphagen, L. M. Do structurally similar molecules have similar biological activity?. J. Med. Chem. 45 12213076 10.1021/jm020155c 27. MacMahon M Hwang W Yim S MacMahon E Abraham A Barton J Tharmakulasingam M Bilokon P Gaddi VP Han N An in silico drug repurposing pipeline to identify drugs with the potential to inhibit SARS-CoV-2 replication Inf. Med. Unlocked. 2023 1 43 101387 10.1016/j.imu.2023.101387 MacMahon, M. et al. An in silico drug repurposing pipeline to identify drugs with the potential to inhibit SARS-CoV-2 replication. Inf. Med. Unlocked. 1 28. Zoete V, Daina A, Bovigny C, Michielin O. SwissSimilarity: a web tool for low to ultra high throughput ligand-based virtual screening. 10.1021/acs.jcim.6b00174 10.1021/acs.jcim.6b00174 27391578 29. Kuhn M von Mering C Campillos M Jensen LJ Bork P STITCH: Interaction networks of chemicals and proteins Nucl. Acids Res. 2007 36 1 684 688 10.1093/nar/gkm795 PMC2238848 18084021 Kuhn, M., von Mering, C., Campillos, M., Jensen, L. J. & Bork, P. STITCH: Interaction networks of chemicals and proteins. Nucl. Acids Res. 36 10.1093/nar/gkm795 PMC2238848 18084021 30. Wirth M Zoete V Michielin O Sauer WH SwissBioisostere: a database of molecular replacements for ligand design Nucleic Acids Res. 2013 41 D1 D1137 D1143 10.1093/nar/gks1059 23161688 PMC3531158 Wirth, M., Zoete, V., Michielin, O. & Sauer, W. H. SwissBioisostere: a database of molecular replacements for ligand design. Nucleic Acids Res. 41 23161688 10.1093/nar/gks1059 PMC3531158 31. Ghamari N Zarei O Reiner D Dastmalchi S Stark H Hamzeh-Mivehroud M Histamine H3 receptor ligands by hybrid virtual screening, docking, molecular dynamics simulations, and investigation of their biological effects Chem. Biol. Drug Des. 2019 93 5 832 843 10.1111/cbdd.13471 30586225 Ghamari, N. et al. Histamine H3 receptor ligands by hybrid virtual screening, docking, molecular dynamics simulations, and investigation of their biological effects. Chem. Biol. Drug Des. 93 30586225 10.1111/cbdd.13471 32. Najjar A Platzer C Luft A Aßmann CA Elghazawy NH Erdmann F Sippl W Schmidt M Computer-aided design, synthesis and biological characterization of novel inhibitors for PKMYT1 Eur. J. Med. Chem. 2019 1 161 479 492 10.1016/j.ejmech.2018.10.050 30388464 Najjar, A. et al. Computer-aided design, synthesis and biological characterization of novel inhibitors for PKMYT1. Eur. J. Med. Chem. 1 10.1016/j.ejmech.2018.10.050 30388464 33. Zdrazil B Felix E Hunter F Manners EJ Blackshaw J Corbett S de Veij M Ioannidis H Lopez DM Mosquera JF Magarinos MP The ChEMBL Database in 2023: a drug discovery platform spanning multiple bioactivity data types and time periods Nucleic Acids Res. 2024 52 D1 D1180 D1192 10.1093/nar/gkad1004 37933841 PMC10767899 Zdrazil, B. et al. The ChEMBL Database in 2023: a drug discovery platform spanning multiple bioactivity data types and time periods. Nucleic Acids Res. 52 37933841 10.1093/nar/gkad1004 PMC10767899 34. Irwin JJ Tang KG Young J Dandarchuluun C Wong BR Khurelbaatar M Moroz YS Mayfield J Sayle RA ZINC20—a free ultralarge-scale chemical database for ligand discovery J. Chem. Inf. Model. 2020 60 12 6065 6073 10.1021/acs.jcim.0c00675 33118813 PMC8284596 Irwin, J. J. et al. ZINC20—a free ultralarge-scale chemical database for ligand discovery. J. Chem. Inf. Model. 60 33118813 10.1021/acs.jcim.0c00675 PMC8284596 35. Bemis GW Murcko MA The properties of known drugs. 1. Molecular frameworks J. Med. Chem. 1996 39 15 2887 2893 10.1021/jm9602928 8709122 Bemis, G. W. & Murcko, M. A. The properties of known drugs. 1. Molecular frameworks. J. Med. Chem. 39 8709122 10.1021/jm9602928 36. Daina A Michielin O Zoete V iLOGP: a simple, robust, and efficient description of n-octanol/water partition coefficient for drug design using the GB/SA approach J. Chem. Inf. Model. 2014 54 12 3284 3301 10.1021/ci500467k 25382374 Daina, A., Michielin, O. & Zoete, V. iLOGP: a simple, robust, and efficient description of n-octanol/water partition coefficient for drug design using the GB/SA approach. J. Chem. Inf. Model. 54 25382374 10.1021/ci500467k 37. Daina A Michielin O Zoete V SwissADME: A free web tool to evaluate pharmacokinetics, drug-likeness and medicinal chemistry friendliness of small molecules Sci. Rep. 2017 7 1 42717 10.1038/srep42717 28256516 PMC5335600 Daina, A., Michielin, O. & Zoete, V. SwissADME: A free web tool to evaluate pharmacokinetics, drug-likeness and medicinal chemistry friendliness of small molecules. Sci. Rep. 7 28256516 10.1038/srep42717 PMC5335600 38. Dallakyan S Olson AJ Small-molecule library screening by docking with PyRx Chem. Biol. Methods Protocols. 2015 10.1007/978-1-4939-2269-7_19 25618350 Dallakyan, S. & Olson, A. J. Small-molecule library screening by docking with PyRx. Chem. Biol. Methods Protocols. 10.1007/978-1-4939-2269-7_19 25618350 39. Morris GM Huey R Lindstrom W Sanner MF Belew RK Goodsell DS Olson AJ AutoDock4 and AutoDockTools4: Automated docking with selective receptor flexibility J. Comput. Chem. 2009 30 16 2785 2791 10.1002/jcc.21256 19399780 PMC2760638 Morris, G. M. et al. AutoDock4 and AutoDockTools4: Automated docking with selective receptor flexibility. J. Comput. Chem. 30 19399780 10.1002/jcc.21256 PMC2760638 40. Hess B Kutzner C Van Der Spoel D Lindahl E GROMACS 4: algorithms for highly efficient, load-balanced, and scalable molecular simulation J. Chem. Theory Comput. 2008 4 3 435 447 10.1021/ct700301q 26620784 Hess, B., Kutzner, C., Van Der Spoel, D. & Lindahl, E. GROMACS 4: algorithms for highly efficient, load-balanced, and scalable molecular simulation. J. Chem. Theory Comput. 4 26620784 10.1021/ct700301q 41. Wang J Wang W Kollman PA Case DA Automatic atom type and bond type perception in molecular mechanical calculations J. Mol. Graph. Model. 2006 25 2 247 260 10.1016/j.jmgm.2005.12.005 16458552 Wang, J., Wang, W., Kollman, P. A. & Case, D. A. Automatic atom type and bond type perception in molecular mechanical calculations. J. Mol. Graph. Model. 25 16458552 10.1016/j.jmgm.2005.12.005 42. Sousa da Silva AW Vranken WF ACPYPE-Antechamber python parser interface BMC Res. Notes. 2012 5 1 8 10.1186/1756-0500-5-367 22824207 PMC3461484 Sousa da Silva, A. W. & Vranken, W. F. ACPYPE-Antechamber python parser interface. BMC Res. Notes. 5 22824207 10.1186/1756-0500-5-367 PMC3461484 43. Hornak V Abel R Okur A Strockbine B Roitberg A Simmerling C Comparison of multiple Amber force fields and development of improved protein backbone parameters Prot. Struct. Funct. Bioinf. 2006 65 3 712 725 10.1002/prot.21123 PMC4805110 16981200 Hornak, V. et al. Comparison of multiple Amber force fields and development of improved protein backbone parameters. Prot. Struct. Funct. Bioinf. 65 10.1002/prot.21123 PMC4805110 16981200 44. Berendsen, H. J., Postma, J. P., van Gunsteren, W. F., & Hermans, J. (1981). Interaction models for water in relation to protein hydration. In Intermolecular forces (pp. 331–342). Springer, Dordrecht. 10.1007/978-94-015-7658-1_21 45. Bussi G Donadio D Parrinello M Canonical sampling through velocity rescaling J. Chem. Phys. 2007 126 1 014101 10.1063/1.2408420 17212484 Bussi, G., Donadio, D. & Parrinello, M. Canonical sampling through velocity rescaling. J. Chem. Phys. 126 17212484 10.1063/1.2408420 46. Parrinello M Rahman A Polymorphic transitions in single crystals: A new molecular dynamics method J. Appl. Phys. 1981 52 12 7182 7190 10.1063/1.328693 Parrinello, M. & Rahman, A. Polymorphic transitions in single crystals: A new molecular dynamics method. J. Appl. Phys. 52 47. Darden T York D Pedersen L Particle mesh Ewald: An N⋅ log (N) method for Ewald sums in large systems J. Chem. Phys. 1993 98 12 10089 10092 10.1063/1.464397 Darden, T., York, D. & Pedersen, L. Particle mesh Ewald: An N⋅ log (N) method for Ewald sums in large systems. J. Chem. Phys. 98 48. Hess B Bekker H Berendsen HJ Fraaije JG LINCS: A linear constraint solver for molecular simulations J. Comput. Chem. 1997 18 12 1463 1472 10.1002/(SICI)1096-987X(199709)18:12&#x0003c;1463::AID-JCC4&#x0003e;3.0.CO;2-H Hess, B., Bekker, H., Berendsen, H. J. & Fraaije, J. G. LINCS: A linear constraint solver for molecular simulations. J. Comput. Chem. 18 49. Purohit R Role of ELA region in auto-activation of mutant KIT receptor: a molecular dynamics simulation insight J. Biomol. Struct. Dyn. 2014 32 7 1033 1046 10.1080/07391102.2013.803264 23782055 Purohit, R. Role of ELA region in auto-activation of mutant KIT receptor: a molecular dynamics simulation insight. J. Biomol. Struct. Dyn. 32 23782055 10.1080/07391102.2013.803264 50. Daura X Gademann K Jaun B Seebach D Van Gunsteren WF Mark AE Peptide folding: when simulation meets experiment Angew. Chem. Int. Ed. 1999 38 1–2 236 240 10.1002/(SICI)1521-3773(19990115)38:1/2&#x0003c;236::AID-ANIE236&#x0003e;3.0.CO;2-M Daura, X. et al. Peptide folding: when simulation meets experiment. Angew. Chem. Int. Ed. 38 51. Roe DR Cheatham TE III PTRAJ and CPPTRAJ: software for processing and analysis of molecular dynamics trajectory data J. Chem. Theory Comput. 2013 9 7 3084 3095 10.1021/ct400341p 26583988 Roe, D. R. & Cheatham, T. E. III. PTRAJ and CPPTRAJ: software for processing and analysis of molecular dynamics trajectory data. J. Chem. Theory Comput. 9 26583988 10.1021/ct400341p 52. Bakan A Meireles LM Bahar I ProDy: protein dynamics inferred from theory and experiments Bioinformatics 2011 27 11 1575 1577 10.1093/bioinformatics/btr168 21471012 PMC3102222 Bakan, A., Meireles, L. M. & Bahar, I. ProDy: protein dynamics inferred from theory and experiments. Bioinformatics 27 21471012 10.1093/bioinformatics/btr168 PMC3102222 53. Eyal E Yang LW Bahar I Anisotropic network model: systematic evaluation and a new web interface Bioinformatics 2006 22 21 2619 2627 10.1093/bioinformatics/btl448 16928735 Eyal, E., Yang, L. W. & Bahar, I. Anisotropic network model: systematic evaluation and a new web interface. Bioinformatics 22 16928735 10.1093/bioinformatics/btl448 54. Bakan A Bahar I The intrinsic dynamics of enzymes plays a dominant role in determining the structural changes induced upon inhibitor binding Proc. Natl. Acad. Sci. 2009 106 34 14349 14354 10.1073/pnas.0904214106 19706521 PMC2728110 Bakan, A. & Bahar, I. The intrinsic dynamics of enzymes plays a dominant role in determining the structural changes induced upon inhibitor binding. Proc. Natl. Acad. Sci. 106 19706521 10.1073/pnas.0904214106 PMC2728110 55. Yang L Song G Carriquiry A Jernigan RL Close correspondence between the motions from principal component analysis of multiple HIV-1 protease structures and elastic network modes Structure. 2008 16 2 321 330 10.1016/j.str.2007.12.011 18275822 PMC2350220 Yang, L., Song, G., Carriquiry, A. & Jernigan, R. L. Close correspondence between the motions from principal component analysis of multiple HIV-1 protease structures and elastic network modes. Structure. 16 18275822 10.1016/j.str.2007.12.011 PMC2350220 56. Maisuradze GG Liwo A Scheraga HA Principal component analysis for protein folding dynamics J. Mol. Biol. 2009 385 1 312 329 10.1016/j.jmb.2008.10.018 18952103 PMC2652707 Maisuradze, G. G., Liwo, A. & Scheraga, H. A. Principal component analysis for protein folding dynamics. J. Mol. Biol. 385 18952103 10.1016/j.jmb.2008.10.018 PMC2652707 57. Chen J Wang J Yang W Zhao L Hu G Conformations of KRAS4B affected by its partner binding and G12C mutation: insights from GaMD trajectory-image transformation-based deep learning J. Chem. Inf. Model. 2024 64 17 6880 6898 10.1021/acs.jcim.4c01174 39197061 Chen, J., Wang, J., Yang, W., Zhao, L. & Hu, G. Conformations of KRAS4B affected by its partner binding and G12C mutation: insights from GaMD trajectory-image transformation-based deep learning. J. Chem. Inf. Model. 64 39197061 10.1021/acs.jcim.4c01174 58. Chen J Wang J Yang W Zhao L Zhao J Hu G Molecular mechanism of phosphorylation-mediated impacts on the conformation dynamics of GTP-Bound KRAS probed by GaMD trajectory-based deep learning Molecules 2024 29 10 2317 10.3390/molecules29102317 38792177 PMC11123822 Chen, J. et al. Molecular mechanism of phosphorylation-mediated impacts on the conformation dynamics of GTP-Bound KRAS probed by GaMD trajectory-based deep learning. Molecules 29 38792177 10.3390/molecules29102317 PMC11123822 59. Ross C Nizami B Glenister M Sheik Amamuddy O Atilgan AR Atilgan C Tastan BÖ MODE-TASK: large-scale protein motion tools Bioinformatics 2018 34 21 3759 3763 10.1093/bioinformatics/bty427 29850770 PMC6198866 Ross, C. et al. MODE-TASK: large-scale protein motion tools. Bioinformatics 34 29850770 10.1093/bioinformatics/bty427 PMC6198866 60. Zhang L Ai H Chen W Yin Z Hu H Zhu J Zhao J Zhao Q Liu H CarcinoPred-EL: Novel models for predicting the carcinogenicity of chemicals using molecular fingerprints and ensemble learning methods Sci. Rep. 2017 7 1 2118 10.1038/s41598-017-02365-0 28522849 PMC5437031 Zhang, L. et al. CarcinoPred-EL: Novel models for predicting the carcinogenicity of chemicals using molecular fingerprints and ensemble learning methods. Sci. Rep. 7 28522849 10.1038/s41598-017-02365-0 PMC5437031 61. Kumari R Kumar R Lynn A A GROMACS tool for high-throughput MM-PBSA calculations J. Chem. Inf. Model. 2014 54 7 1951 1962 10.1021/ci500020m 24850022 Kumari, R., Kumar, R. & Lynn, A. A GROMACS tool for high-throughput MM-PBSA calculations. J. Chem. Inf. Model. 54 24850022 10.1021/ci500020m 62. Kollman PA Massova I Reyes C Kuhn B Huo S Chong L Lee M Lee T Duan Y Wang W Donini O Calculating structures and free energies of complex molecules: combining molecular mechanics and continuum models Acc. Chem. Res. 2000 33 12 889 897 10.1021/ar000033j 11123888 Kollman, P. A. et al. Calculating structures and free energies of complex molecules: combining molecular mechanics and continuum models. Acc. Chem. Res. 33 11123888 10.1021/ar000033j 63. Gilson MK Honig B Calculation of the total electrostatic energy of a macromolecular system: solvation energies, binding energies, and conformational analysis Proteins: Struct., Funct., Bioinf. 1988 4 1 7 18 10.1002/prot.340040104 3186692 Gilson, M. K. & Honig, B. Calculation of the total electrostatic energy of a macromolecular system: solvation energies, binding energies, and conformational analysis. Proteins: Struct., Funct., Bioinf. 4 10.1002/prot.340040104 3186692 ",
  "metadata": {
    "Title of this paper": "Calculation of the total electrostatic energy of a macromolecular system: solvation energies, binding energies, and conformational analysis",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485083/"
  }
}