{
  "title": "Paper_593",
  "abstract": "pmc Front Cell Dev Biol Front Cell Dev Biol 2593 frontcdb Front. Cell Dev. Biol. Frontiers in Cell and Developmental Biology 2296-634X Frontiers Media SA PMC12477198 PMC12477198.1 12477198 12477198 41030636 10.3389/fcell.2025.1646072 1646072 1 Cell and Developmental Biology Review Mitochondrial fission process 1 protein: a comprehensive review of its core roles in mitochondrial dynamics, disease, and therapeutic targets Ran et al. 10.3389/fcell.2025.1646072 Ran Qingzhi  1 Gao Chen  1 Xiang Chunrong  1 He Xuanhui  1 Zhang Yongkang  2 Zhang Yin  1 * Chen Hengwen  1 *  1 Guang’anmen Hospital China Academy of Chinese Medical Sciences Beijing China  2 Innovation Research Institute of Traditional Chinese Medicine, Shanghai University of Traditional Chinese Medicine Shanghai China  Edited by: Jamal Bouitbir  Reviewed by: François Singh  Richard M. Monaghan  John Noone *Correspondence: Yin Zhang, shezhangyin@sina.com chenhengwen@163.com 15 9 2025 2025 13 480890 1646072 12 6 2025 26 8 2025 15 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Ran, Gao, Xiang, He, Zhang, Zhang and Chen. 2025 Ran, Gao, Xiang, He, Zhang, Zhang and Chen https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Mitochondrial fission process 1 (MTFP1) has emerged as a central regulator of mitochondrial dynamics, playing indispensable roles in maintaining organellar integrity, bioenergetic homeostasis, and stress adaptation - particularly in high-energy-demand tissues such as cardiac and skeletal muscle. Mounting evidence implicates MTFP1 dysfunction in the pathogenesis of diverse diseases including cardiovascular disorders, myopathies, and cancer. Beyond its canonical role in mediating mitochondrial fusion-fission balance, recent studies have unveiled MTFP1’s multifaceted involvement in calcium signaling modulation, ROS metabolism, and mitochondria-ER communication networks, substantially expanding its functional repertoire in cellular physiology. The protein’s pleiotropic effects stem from its ability to integrate metabolic status with organelle dynamics and quality control mechanisms. Particularly noteworthy is MTFP1’s cell-type-specific regulation of the ROS-calcium axis, which appears critical for its differential impacts in disease states. These discoveries position MTFP1 as both a mechanistic linchpin connecting mitochondrial dynamics to cellular homeostasis and a promising but challenging therapeutic target requiring precise contextual modulation. Current research frontiers focus on elucidating tissue-specific regulatory mechanisms of MTFP1 activity, developing microenvironment-sensitive targeting strategies, and exploring its potential as a biomarker for mitochondrial dysfunction-related pathologies. This evolving understanding of MTFP1’s integrative functions opens new avenues for developing precision therapies targeting mitochondrial dynamics in energy-metabolism-linked diseases. Graphical Abstract  Note: ADP, Adenosine Diphosphate; ATP, Adenosine Triphosphate; MTFP1, mitochondrial fission process 1. Overview of MTFP1 roles in mitochondrial dynamics and diseases. The first panel shows physiological properties, including mitochondrial fusion and fission. The second panel highlights MTFP1's influence on cardiovascular, metabolic diseases, and cancer. The third panel explores clinical prospects, including personalized medicine and therapy development, with emphasis on MTFP1 inhibitors and clinical studies. Each section uses diagrams to illustrate the functions and applications of MTFP1. mitochondrial fission process 1 protein Mitochondria cardiovascular disease Tumor drug Targets autophagy inflammation The author(s) declare that financial support was received for the research and/or publication of this article. This study was funded by a Beijing Natural Science Foundation Project (No. 7252257). The Clinical Research Funds for the Centralized High level Chinese Medicine Hospitals (HLCMHPP2023077). Scientific and Technological Innovation Project of complementary: China Academy of Chinese Medical Sciences (CI2023CO22YL). High level Traditional Chinese Medicine Hospital Clinical Research and Achievement Transformation Ability Enhancement Project (CZ40909). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cell Growth and Division 1 Introduction The mitochondrial fission process 1 (MTFP1) protein plays a pivotal role in regulating cellular energy metabolism and maintaining mitochondrial dynamics ( Hu et al., 2021 Ruiz et al., 2021 Aranda-Rivera et al., 2021 Tong et al., 2020 Naviaux, 2014 Valero, 2014 Jin et al., 2022 Rabinovich-Nikitin et al., 2021 Liu et al., 2024 Song et al., 2021 Hombrebueno et al., 2019 Recent studies have increasingly elucidated the diverse roles of MTFP1 in various pathological contexts. For example, within the cardiovascular system, MTFP1 has been demonstrated to protect myocardial cells from ischemia-reperfusion injury by modulating mitochondrial fusion ( Tian et al., 2022 Wang et al., 2020 Choi and Han, 2021 Panchal and Tiwari, 2019 Figure 1 Teodorof-Diedrich and Spector, 2018 Cen et al., 2021 FIGURE 1 MTFP1 studies the historical course chart from 2015 to 2024. MTFP1, Mitochondrial fission process 1; DoX, Doxorubicin; BiK, Bcl-2-like protein 11; ALR, Adenosine L-Ribose; AKI, Acute Kidney Injury; HK, Hexokinase; mTOR, mammalian target of rapamycin; BP1, Mitochondria-Related Biomarker 1; ROS, Reactive Oxygen Species; OSCC, Oral Squamous Cell Carcinoma; PrP1, Prion Protein 1; EPK1, Extracellular Signal-Regulated Kinase 1; PTSD, Post-Traumatic Stress Disorder; NAC, N-Acetylcysteine; EC, Endothelial Cell. Timeline of research findings from 2015 to 2024 detailing developments in mitochondrial dynamics concerning muscle, cancer, and cardiovascular areas. Key events include identifying MTFP1 protective proteins, the role of MTFP1 in OSCC growth, cardiac remodeling prevention, and Timm8a1 mutation effects. Various studies focus on mechanisms like apoptosis, mitochondrial fission, and fusion, as well as targeting mechanisms for prevention and treatment of conditions such as hearing loss, cardiovascular efficiency, and PTSD. 2 Physiological and biochemical properties of MTFP1 MTFP1 is a central protein located on the inner mitochondrial membrane and is widely expressed in various cell types, including cardiomyocytes, skeletal muscle cells, and neurons ( Chen and Chan, 2009 Rangaraju et al., 2019 Roca-Portoles and Tait, 2021 Celardo et al., 2014 Sas et al., 2007 Valero, 2014 Bastian et al., 2019 Wang et al., 2023b 2.1 Structural properties of MTFP1 MTFP1, a major protein of the inner mitochondrial membrane, is primarily structured to include transmembrane domains that embed it into the inner mitochondrial membrane ( Iorio et al., 2021 Park et al., 2018 White et al., 2017 Kulkarni et al., 2023 Ragunathan et al., 2022 Morris et al., 2024 Sun et al., 2024 Colombini, 2017 West et al., 2016 Ji and Kang, 2015 Luchetti et al., 2022 MTFP1 protein is widely expressed across various tissues, including the heart, liver, brain, skeletal muscle, and colon ( Rey et al., 2020 Sim et al., 2012 Table 1 Table 1 Boscolo et al., 2013 Sabat et al., 2021 Szabadkai et al., 2004 Golla et al., 2024 TABLE 1 RNA sequence analysis of MTFP1 in 27 human tissues. Sample BioSample RPKM Count Adrenal 3 samples 3.121 ± 0.358 44,693 Appendix 3 samples 4.722 ± 0.144 60,531 Bone marrow 4 samples 3.691 ± 1.712 978,646 Brain 3 samples 1.4 ± 0.521 24,268 Colon 5 samples 5.185 ± 1.44 190,645 Duodenum 2 samples 6.383 ± 0.117 56,011 Endometrium 3 samples 2.386 ± 1.209 41,102 Esophagus 3 samples 2.912 ± 0.696 68,073 Fat 3 samples 0.794 ± 0.252 11,420 Gall bladder 3 samples 3.59 ± 1.274 85,155 Heart 4 samples 3.476 ± 1.771 112,020 Kidney 4 samples 5.231 ± 0.462 89,070 Liver 3 samples 2.844 ± 0.503 51,457 Lung 5 samples 1.958 ± 0.583 48,101 Lymph node 5 samples 5.669 ± 1.061 233,527 Ovary 2 samples 0.741 ± 0.011 13,876 Pancreas 2 samples 0.677 ± 0.194 12,909 Placenta 4 samples 5.953 ± 4.365 203,435 Prostate 4 samples 4.877 ± 0.931 93,197 Salivary gland 3 samples 1.016 ± 0.146 30,405 Skin 3 samples 0.957 ± 0.13 24,568 Small intestine 4 samples 4.052 ± 0.662 84,368 Spleen 4 samples 3.92 ± 0.694 105,304 Stomach 3 samples 5.081 ± 2.251 107,541 Testis 7 samples 1.513 ± 0.402 93,234 Thyroid 4 samples 3.442 ± 1.096 125,481 Urinary bladder 2 samples 4.209 ± 0.284 65,111 RPKM, reads per kilobase of exon model per million mapped reads. 2.2 Function of MTFP1 in mitochondrial fusion MTFP1’s GTPase activity is a core functional element in mediating mitochondrial fusion. Mitochondrial fusion is a sequential process that requires the coordination of both the inner and outer membranes. Outer membrane fusion is primarily mediated by mitochondrial fusion proteins 1 and 2 (MFN1/2), which anchor adjacent mitochondria and promote outer membrane mixing ( Chen et al., 2024 Wu et al., 2024 Szabadkai et al., 2004 Rey et al., 2020 Xavier and Martinou, 2021 Li et al., 2025 Montes de Oca Balderas and Aguilera, 2015 The GTPase activity of MTFP1 is acritical component of its function. By binding and hydrolyzing guanosine triphosphate (GTP), MTFP1 drives the conformational change of the inner mitochondrial membrane proteins, which ultimately results in the binding and subsequent fusion of the two inner mitochondrial membranes ( Pang et al., 2024 Wisowski et al., 2022 Kruglik et al., 2017 Prastya et al., 2020 Matija et al., 2023 Montagnani Marelli et al., 2024 Scarpelli et al., 2019 Volkov and van Nuland, 2012 Shneyer et al., 2017 Zhou et al., 2017 Montes de Oca Balderas and Aguilera, 2015 Xavier and Martinou, 2021 Hensen et al., 2019 Singh et al., 2018 Figures 2 3 FIGURE 2 Physiology and biochemistry of MTFP1. (A) (B) (C) (D) (E) Diagram with four panels depicting genetic and protein data related to chromosome 22. Panel A shows a linear map of gene locations with notes on exon count and location. Panel B is a heatmap of amino acid residue sequences, color-coded for regions, uncertain areas, and pathogenic variants. Panel C illustrates a 3D protein structure with coiled regions. Panels D and E depict domain structures indicating GTPase, HR, TM, and PR regions, with phosphorylation sites marked. FIGURE 3 The clinicopathological diagram of MTFP1 in various tissues and organs of the human body. Abbreviations: MTFP1, Mitochondrial fission process 1; Drp1, Dynamin-related protein 1; FIS1, Fission 1 Protein; OMM, Outer Mitochondrial Membrane; IMM, Inner Mitochondrial Membrane; SMEM, Small Molecule Exchange Membrane; HSCTe, Human Stem Cell Transplantation; CMA, Chaperone-Mediated Autophagy. Diagram illustrating clinical and molecular studies of MTFP1 in major human diseases, annotated with lines connecting labeled body parts. Categories include neurological diseases, cardiovascular disease, liver diseases, muscles and movement diseases, cancer, mitochondria diseases, and metabolic diseases. Each category lists specific diseases or conditions related to the corresponding body part, such as neuroblastoma under neurological diseases and ischemic cardiomyopathy under cardiovascular diseases. 3 The role of MTFP1 in mitochondria: from mitochondrial fission to mitophagy As a crucial GTPase in the inner mitochondrial membrane, MTFP1 is essential for maintaining mitochondrial morphology and function. Mitochondrial fusion and fission play a pivotal role in cellular energy metabolism and exert a profound influence on mitophagy, cell fate determination, and intracellular signaling ( Chen et al., 2023 Rovira-Llopis et al., 2017 Wang et al., 2023a Shi et al., 2021 Zhong et al., 2023 Zhao et al., 2021 Chen et al., 2023 Yang et al., 2023 3.1 Coordination mechanism of mitochondrial fission and fusion Mitochondrial fusion and fission are highly coordinated processes that are co-regulated by proteins such as MTFP1 and dynamin-related protein 1 (Drp1) ( Yoo and Jung, 2018 Roca-Portoles and Tait, 2021 Reddy and Oliver, 2019 Wu et al., 2022a Figure 4A Yu et al., 2020 Xie et al., 2022 Wang et al., 2017b Figure 4B FIGURE 4 MTFP1 and mitochondria. (A) (B) (C) (D) (E) A scientific illustration with five sections labeled A to E. A: Interaction of Drp1 with MTFP1 in mitochondrial fission, illustrating mild and severe damage pathways leading to fusion or fission involving proteins MTFP1, MTP18, Drp1, and Fis1. B: Mitochondria and cell division, highlighting autophagy processes: macroautophagy, microautophagy, and chaperone-mediated autophagy with phagophore and autolysosome involvement. C: Metabolic pathways in the mitochondria, showing aerobic and anaerobic respiration, glycolysis, TCA cycle, and electron transfer, including mTOR and MTFP1 interaction. D: MTFP1 signaling pathway malfunction effects such as oxidative stress and mitochondrial apoptosis, indicating pathways like fatty acid oxidation and ATP production. E: Calcium dynamics in mitochondria and sarcoplasmic reticulum, MTFP1's role in contraction and electron transport, linked to reactive oxygen species (ROS) production. 3.1.1 Mitochondrial fusion and fission-related factors Mitochondrial fusion occurs in two distinct steps: outer mitochondrial membrane fusion (OMM fusion) and inner mitochondrial membrane fusion (IMM fusion). OMM fusion is mediated by Mitofusin 1 (MFN1) and Mitofusin 2 (MFN2), which interact through their transmembrane regions with the outer membranes of adjacent mitochondria, forming a complex. Additionally, MFN2 plays a role in the physical interaction between mitochondria and the endoplasmic reticulum (ER), as well as in calcium signaling exchange ( Guo et al., 2023 Silva Ramos et al., 2019 Klemmensen et al., 2024 Mitochondrial fission primarily relies on the recruitment and assembly of Drp1 in the cytoplasm. The localization of Drp1 is dependent on several anchoring proteins on the outer membrane, including Mitochondrial Fission 1 Protein (FIS1), Mitochondrial Fission Factor (MFF), and Mitochondrial Dynamics Proteins of 49 kDa (MID49) and MID51. These proteins recruit Drp1 to the fission sites via specific Drp1-binding domains and coordinate localization with the contact points of the endoplasmic reticulum (mitochondria-associated membranes, MAMs) ( Kerr et al., 2017 Wei et al., 2017 Iorio et al., 2021 3.2 Functional regulation of MTFP1 in mitophagy Mitochondrial adaptation to metabolic states is achieved through a coordinated process of fission and fusion. Mitochondrial dynamics, including these processes, are essential for maintaining mtDNA integrity and quality control. Damaged organelles undergo fragmentation, generating smaller mitochondria that are primed for autophagic degradation ( Silva Ramos et al., 2019 Oshima et al., 2021 Guo et al., 2023 MTFP1 plays a dual role in regulating both mitochondrial fusion and fission. Under normal conditions, MTFP1 promotes mitochondrial fusion, delaying the need for autophagy by facilitating the integration of partially damaged mitochondria into the existing mitochondrial network ( Miller and Thorburn, 2021 Klemmensen et al., 2024 Figures 4B–D MTFP1’s regulatory role extends beyond mitochondrial dynamics, influencing the autophagic process and inter-organelle interactions. The activity of MTFP1 is modulated by intracellular signaling molecules, including calcium levels, energy status, and post-translational modifications ( Han et al., 2023b Kerr et al., 2017 Kimura et al., 2017 Dhapola et al., 2021 Yan et al., 2020 In cardiomyocytes, apoptosis and autophagy are critical for maintaining cardiac function, and mitochondria play a central role in both processes. MTFP1 modulates the selectivity and efficiency of mitophagy by promoting mitochondrial fusion, thereby ensuring effective clearance of damaged mitochondria ( Wei et al., 2017 Lizama and Chu, 2021 Figure 4E 3.3 MTFP1 acts on immune cells and immunomodulates through mitochondria The function of immune cells is contingent upon the energy supply of mitochondria and the production of ROS, which are closely related to the morphological and functional status of mitochondria ( Rabinovich-Nikitin et al., 2021 Zhou et al., 2022 Lizama and Chu, 2021 Palikaras et al., 2015 Liu et al., 2021a Ma et al., 2023 3.4 Association between MTFP1 and inflammatory response and chronic inflammatory diseases The inflammatory response, defined as the body’s protective response to infection, injury, or other stressful conditions, can be considered a vital physiological process. However, excessive or persistent inflammation can lead to the development of a chronic disease ( Singh et al., 2021 Grimm et al., 2014 Aggarwal et al., 2024 Podor et al., 2015 Duroux-Richard et al., 2016 Wei et al., 2018 Tábara et al., 2014 Zhao et al., 2018 Soranno et al., 2016 4 The role of MTFP1 in the cardiovascular system: from mitochondrial function to cell fate The role of MTFP1 in the cardiovascular system is a subject that merits close examination. Its function extends beyond the mere regulation of mitochondrial fusion to encompass the regulation of energy metabolism, calcium homeostasis, stress response, and pivotal biological processes such as apoptosis and autophagy in cardiomyocytes ( Liu et al., 2020 Wang et al., 2022 4.1 The central role of MTFP1 in cardiomyocyte energy metabolism The elevated metabolic demands of cardiomyocytes underscore the significance of mitochondrial function (includes oxidative phosphorylation-driven ATP production processes and also covers the ability to maintain energy metabolism homeostasis through network structure). MTFP1 has been shown to optimize the ATP production process by promoting mitochondrial fusion and ensuring the integrity of the mitochondrial network ( Ahmad et al., 2019 Dorn, 2010 Figure 4C Wu et al., 2017 Marin-Garcia and Akhmedov, 2016 Tokuyama and Yanagi, 2023 4.2 The role of MTFP1 in regulating calcium homeostasis and myocardial contraction Mitochondrial division is a highly regulated process that is essential for the distribution of mitochondria during cell division, the clearance of damaged mitochondria, and the overall maintenance of mitochondrial function ( Vásquez-Trincado et al., 2016 Song and Dorn, 2015 Bhandari et al., 2015 2+ 2+ 2+ Leduc-Gaudet et al., 2021 The relationship between mitochondrial division and Ca 2+ Alevriadou et al., 2021 2+ Bravo-Sagua et al., 2017 2+ Abudureyimu et al., 2024 2+ 2+ 2+ Song et al., 2023 2+ Abudureyimu et al., 2023 Peng et al., 2020 Gӧbel et al., 2020 Bode et al., 2021 Figure 4E 4.3 The dual role of MTFP1 in the cardiac stress response: protector and destroyer When cardiomyocytes face stress such as ischemia-reperfusion injury, the dysfunction of MTFP1 often exacerbates the damage of cells ( Borkar et al., 2023 Li et al., 2022b Grumbach and Nguyen, 2019 Lozhkin et al., 2022 Wu et al., 2022b He et al., 2022 He et al., 2022 4.4 Mechanisms of action and therapeutic potential of MTFP1 in metabolic diseases The close association between metabolic diseases, such as diabetes, obesity, and non-alcoholic fatty liver disease (NAFLD), and mitochondrial dysfunction has been widely recognized ( Liu et al., 2020 Alevriadou et al., 2021 Bhandari et al., 2015 Song et al., 2023 Wu et al., 2017 He et al., 2024 Wu et al., 2024 5 The complex role of MTFP1 in cancer: multi-level regulation of mitochondrial dynamics and tumor biology As a key GTPase on the inner mitochondrial membrane, MTFP1 plays a multi-level regulatory role in mitochondrial fusion, metabolic reprogramming, cell fate determination, and tumor progression ( Tábara et al., 2024 Donnarumma et al., 2022 5.1 Mitochondrial dynamics and tumor metabolic reprogramming regulation of MTFP1 in cancer cells Metabolic reprogramming of cancer cells is a core feature of tumor growth and survival, and the regulatory role of MTFP1 in this process is crucial. MTFP1 maintains the integrity of the mitochondrial network and supports oxidative phosphorylation of cells by mediating the balance of mitochondrial fusion and division ( Patitucci et al., 2023 Xiao et al., 2020 Dong et al., 2024 Singh et al., 2024 Baek et al., 2023 Haque et al., 2024 Han et al., 2023a Schneegans et al., 2024 Figures 5A,B FIGURE 5 MTFP1 and cancer. (A) (B) (C) (D) (E) Diagram illustrating the role of MTFP1 in cancer, depicting mitochondrial dynamics in cancer cells, tumor microenvironment, and tumor heterogeneity. It shows excessive mitochondrial fragmentation and its reprogramming, marked by MTFP1 activation, leading to oxidative stress, nutrient deficiencies, and inflammation. Tumor microenvironment and heterogeneity affect calcium homeostasis, lipid metabolism, and signaling. The diagram also highlights tumor cell fate determination processes like apoptosis, metastasis, cell cycle arrest, self-renewal, and proliferation. It suggests MTFP1 as a potential cancer therapeutic target, with pharmacological dose-response curves and dynamic biomarker monitoring. 5.2 MTFP1 regulates the tumor microenvironment and tumor heterogeneity in treatment resistance The tumor microenvironment (TME) plays a crucial role in tumorigenesis and progression. MTFP1 affects calcium homeostasis, lipid metabolism, and signaling by regulating the formation of mitochondria-endoplasmic reticulum contact sites MAMs, which form a complex interaction between cancer cells and the microenvironment ( Kuo et al., 2022 Missiroli et al., 2023 Papachristodoulou et al., 2021 Yang et al., 2024 Juliana et al., 2020 Mima, 2022 Mamouni et al., 2021 Ji et al., 2024 Meng et al., 2024 Figures 5C,D 5.3 Relationship between MTFP1 and tumor cell fate determination By regulating mitochondrial division and fusion, MTFP1 determines the fate of cells under stressful conditions, especially the balance between apoptosis and autophagy. Its dysfunction is often associated with mitochondrial dysfunction, which promotes cancer cell resistance to apoptotic signals and further promotes the malignant progression of tumors ( Deng and Haynes, 2017 Zuo et al., 2022 He et al., 2023 Figure 5E 5.4 MTFP1 as a potential therapeutic target for cancer MTFP1 is considered a potential target in cancer therapy due to its critical role in a variety of cancers. Targeting the regulatory mechanism of MTFP1 may restore the normal function of mitochondria, reverse metabolic reprogramming, and inhibit the proliferation and survival of cancer cells ( Pokharel et al., 2023 Rolver et al., 2024 Li et al., 2022a Aberrant expression of MTFP1 in colorectal cancer can serve as a potential prognostic marker. By detecting the expression level of MTFP1, the investigator can predict the patient’s sensitivity to treatment and develop a personalized treatment plan ( Wu et al., 2024 Pan et al., 2024 Figure 5F Srinivasan et al., 2017 He et al., 2024 Maycotte et al., 2017 6 MTFP1 and muscle health As a key GTPase located in the mitochondrial inner membrane, MTFP1 plays a crucial role in regulating mitochondrial dynamics, particularly in skeletal muscle and cardiac systems. Its functions encompass metabolic homeostasis, muscle fiber type regulation, exercise adaptation, and muscle protective functions under pathological conditions ( Quiles and Gustafsson, 2022 Leduc-Gaudet et al., 2021 6.1 The core role of MTFP1 in maintaining mitochondrial dynamics in skeletal muscle and cardiac smooth muscle The high-energy demand of skeletal muscle and cardiac tissue makes mitochondrial dynamics a core aspect of cellular physiological activity. MTFP1 maintains mitochondrial network integrity by promoting mitochondrial fusion and supports oxidative phosphorylation within the cell ( Chan, 2020 Shi et al., 2024 Ihenacho et al., 2021 Kubat et al., 2023 Ihenacho et al., 2021 Donnarumma et al., 2022 Wang et al., 2022 Figure 6A FIGURE 6 Mechanism of action of MTFP1 on myocardial and skeletal muscles. (A) (B) (C) (D) (E) Infographic illustrating the role of MTFP1 in muscle and heart health. Section A shows mitochondrial fusion in the heart and skeletal muscle structure. Section B depicts types of muscle contractions, highlighting fast and slow-twitch fibers influenced by MTFP1. Section C explains how MTFP1 enhances muscle strength, endurance, and repair. Section D illustrates MTFP1's role in preventing mitochondrial damage and muscle atrophy. Section E outlines the process of sprouting angiogenesis in blood vessels, showing MTFP1's regulatory function. Key processes include oxidative phosphorylation, ischemia-reperfusion injury, and angiogenic stimuli regulation. 6.2 Role of MTFP1 in the differentiation and metabolic regulation of skeletal muscle fiber types Skeletal muscle is composed of a variety of fiber types, including type I slow-twitch fibers and type II fast-twitch fibers, which differ significantly in function and metabolic requirements. Type I slow-twitch fibers are oxidative phosphorylation dependent and have high mitochondrial density, making them suitable for endurance exercise ( Rahman et al., 2024 Castro-Sepulveda et al., 2023 Mima, 2022 Yasuda et al., 2023 Cui et al., 2024 Figure 6B 6.3 Role of MTFP1 in muscle adaptation and exercise endurance Exercise-induced mitochondrial biogenesis and adaptive changes in skeletal muscle depend on mitochondrial homeostasis. MTFP1 enhances exercise tolerance by enhancing mitochondrial fusion, improving oxidative phosphorylation efficiency, and optimizing the metabolic function of muscle cells. During exercise, MTFP1 expression is upregulated, allowing muscles to effectively adapt to high-intensity and long-term energy demands ( Axelrod et al., 2019 Campos et al., 2023 Figure 6C 6.4 Protective effect of MTFP1 in muscle pathological states MTFP1 plays a key protective role by maintaining mitochondrial functional integrity in a variety of muscle pathological states, especially in the presence of ischemia-reperfusion injury or metabolic disorders ( Hong et al., 2022 Morita et al., 2017 Cai et al., 2024 Cui et al., 2024 Figure 6D 6.5 Role of MTFP1 in angiogenesis and metabolic adaptation of skeletal muscle Skeletal muscle not only requires strong metabolic function, but also relies on adequate blood supply and angiogenesis. MTFP1 influences angiogenesis processes within skeletal muscle by regulating mitochondrial interactions with endoplasmic reticulum. Under exercise or pathological conditions, MTFP1 can promote angiogenesis and maintain blood supply by activating metabolic regulatory pathways such as PGC-1α ( You et al., 2024 Sollanek et al., 2017 Wang et al., 2017a in vitro in vivo Wang et al., 2017a Figure 6E MTFP1 is involved in the functional regulation of skeletal muscle through multi-level mechanisms, especially in mitochondrial dynamics, fibrous differentiation, metabolic adaptation, and protection under pathological conditions ( Ahuja et al., 2022 Dulac et al., 2021 7 Frontiers and challenges of targeting MTFP1 in precision medicine As a central regulatory factor in the mitochondrial fusion process, MTFP1 plays a pivotal role in maintaining cellular energy metabolism, redox homeostasis, and cell fate determination. Its broad expression and functional dysregulation in multiple disease systems—including metabolic disorders, cardiovascular diseases, and cancer—highlight its unique advantage as a “cross-system therapeutic target.” Under pathological conditions, MTFP1 modulates mitochondrial dynamic equilibrium, thereby influencing the cell’s capacity to respond to environmental stress and participating in key processes of programmed cell death, such as apoptosis, autophagy, and ferroptosis ( Fukuda et al., 2023 Future therapeutic interventions will increasingly rely on multi-target integration and system-level regulation. Mitochondrial dynamics–related proteins closely associated with MTFP1—such as Drp1, MFN1/2, and OPA1—have been shown to cooperatively regulate mitochondrial morphology and function across various pathological models, suggesting that combination targeting may further enhance therapeutic efficacy. Against this backdrop, small-molecule agonists and inhibitors of MTFP1, as well as RNA interference and gene-editing tools, have demonstrated potential in animal studies to improve metabolic disorders and suppress tumor progression. However, clinical translation still faces substantial challenges, including tissue-specific regulation, targeting and delivery efficiency, penetration across biological barriers, dose optimization, and safety evaluation. To address these issues, future directions should focus on developing intelligent delivery platforms, optimizing molecular screening systems, and integrating structural biology approaches to design next-generation regulatory tools. Moreover, the paradigm of personalized medicine demands systematic evaluation of MTFP1 genetic polymorphisms, disease subtype correlations, and interindividual variability in therapeutic responses. By combining artificial intelligence with multi-omics big data, predictive modeling and feedback-based therapeutic monitoring could be established, paving the way for truly “tailored therapeutics.” This approach holds promise for advancing MTFP1-targeted strategies from bench to bedside, benefiting patient populations burdened by metabolic diseases, cancer, and other high-impact conditions ( Table 2 TABLE 2 Proteins and peptides experimentally associated with MTFP1-related mitochondrial regulation. Compound class Compound Model Main mechanism of action Clinical therapeutic implications References Direct target drugs for MTFP1 STMP1 Xenograft mice STMP1 overexpression results in mitochondrial redistribution to the leading edge of the cell, enhancing lamodipodia formation STMP1 is a key regulator of metastasis and a novel unit of mitochondrial fission protein mechanism, providing a potential therapeutic target for the treatment of cancer metastasis  Xie et al. (2022) ALKBH5 Stellate cells, rat liver tissue LKBH5 regulates the m6A modification of Drp1, promotes its translation, and enhances mitochondrial fission, cell proliferation and migration in HSCs Modulating ALKBH5 activity to control mitochondrial fission and HSC behavior, alleviate liver fibrosis, MTFP1 provides a new target for the diagnosis and treatment of liver fibrosis  Geng et al. (2022) DEX C57BL/6J mice, NR8-383 cells DEX reduced oxidative stress index (OSI), ameliorated mitochondrial dysfunction, upregulated HIF-1α and HO-1 expression, and was associated with mitochondrial fusion DEX treatment ameliorates endotoxin-induced acute lung injury by modulating the HIF-1a/HO-1 signaling pathway to maintain the homeostasis of mitochondrial fusion/fission  Shi et al. (2021) Beta-amyloid protein (Aβ) overphosphorylates tau (P-Tau) Cardiomyocytes Aβ and P-Tau decrease autophagy and mitochondrial autophagy protein levels (Drp1/PINK1/parkin), resulting in damaged mitochondria and other cellular debris that cannot be effectively cleared in AD neurons Understanding the mechanisms by which Aβ and P-Tau lead to autophagy and mitophagy defects in Alzheimer’s disease can help develop new therapeutic strategies to improve neuronal function and delay disease progression  Reddy and Oliver (2019) MTP18/MTFP1 Retinal ganglion cells (RGCs) MTFP1 (MTP18) is essential for maintaining mitochondrial size and volume. Knockdown of MTP18 promoted axon outgrowth, suggesting that MTP18 expression was regulated by the transcription factors Kruppel-like factor (KLF)-7 and −9 The role of MTP18 in axonal regeneration signaling, and to study the therapeutic effectiveness of MTP18 expression inhibition in axonal degenerative events in the central nervous system (CNS)  Kreymerman et al. (2019) miR-125b-5p Endometrial cancer cells miR-125b-5p targets the putative binding site on MTFP1 3′UTR to reduce MTFP1 expression and inhibit cellular malignant behavior miR-125b-5p inhibits the EC cell malignant phenotype by targeting MTFP1, laying the foundation for the clinical treatment of endometrial cancer  Pan et al. (2023) Tumor suppressor p53 Tumor cells p53 inhibits the target of mammalian rapamycin complex 1 (mTORC1) signaling to attenuate protein levels of mitochondrial fission process 1 (MTFP1) and promote fission-promoting dynein-related protein 1 (Drp1) phosphorylation A novel mitochondria-dependent molecular mechanism was revealed, i.e., the basis of the metastatic phenotype of p53-damaged cancer was associated with MTFP1  Phan et al. (2022) Suvorexant Stress-restressed rats with PTSD-like symptoms SRS exposure leads to increased mitochondrial fission and decreased fusion, i.e., excessive increase in MTFP1, and activation of the mTOR pathway causes PTSD-like symptoms, while the combination of suvorexant and mTOR can improve mitochondrial dynamics Targeting orexinergic and mTOR pathways may have beneficial synergistic effects in the treatment of PTSD  Prajapati et al. (2024) Small molecule echinacoside (ECH) Middle cerebral artery occlusion mice (MCAO) CH allosterically regulates the conformation of CK2α′ to recruit the basic transcription factor 3 (BTF3) to form a bivalent protein complex. Then, the CK2α'/BTF3 complex promotes the nuclear translocation of β-catenin to activate the TCF/LEF transcription factor and stimulate the transcription of mitochondrial fusion gene Mfn2 Reveals that CK2 is essential for promoting mitochondrial fusion in a Wnt/β-catenin-dependent manner, and suggests pharmacologically targeted CK2 for the treatment of ischemic stroke treatment strategies, and is associated with an aberrant increase in gene hypertranscriptional grade MTFP1 for MFN  Zeng et al. (2021) QSYQ Myocardial infarction rats QSYQ promotes mitochondrial biogenesis (PGC-1α, Nrf1 and TFAM) and mitochondrial fusion (MFN-2 and OPA1) and inhibits phosphorylation of mitochondrial hyperdivision (Drp1) at ser616 in vitro in vivo QSYQ improves mitochondrial biogenesis and homeostasis to alleviate MI-induced ferroptosis  Wu et al. (2023) GTPBP8 Cell Depletion of GTPBP8 leads to dramatic elongation and interconnectivity of mitochondria. Overexpression of GTPBP8 shifts mitochondrial morphology from tubular to fragmented This study reveals the critical role of GTPBP8 in mitochondrial fission and its interrelationship with Drp1, providing potential targets and biomarkers for the treatment of mitochondrial dysfunction-related diseases  He et al. (2024) Indirect target drugs for MTFP1 Ilexgenin A (IA) Atherosclerotic mice IA promotes PSMB5 expression and activates Nrf2 signaling pathway, inhibits Drp1 expression and mitochondrial fission, improves endothelial dysfunction, reduces inflammation and oxidative stress, and exerts anti-atherosclerosis effects through MTFP1 IA promotes PSMB5 expression in an Nrf2-dependent manner, inhibits mitochondrial fission, and ameliorates endothelial dysfunction. It lays the foundation for the future development of IA as a drug for the prevention and treatment of AS  Zhu et al. (2019) Gypenosides (GYP) H9c2 cardiomyocytes rescue defective mitophagy to exert cardioprotective effects, and PI3K/Akt/GSK-3β/Mcl-1 signaling may be involved in its process Exert cardioprotective effects in cardiomyocytes by activating the PI3K/Akt/GSK-3β/Mcl-1 signaling pathway to rescue mitophagy, which provides a basis for their potential application in the treatment of heart failure (HF)  Zheng et al. (2024) Korean Red Ginseng (KRG) Testosterone propionate (TP)-induced BPH and TP-treated LNCaP cells KRG inhibits mitochondrial fission by enhancing DRP-1 (ser637) phosphorylation, thereby reducing cell proliferation and promoting apoptosis, effectively alleviating BPH symptoms KRG provides a promising clinical approach for the treatment of benign prostatic hyperplasia (BPH) by regulating mitochondrial dynamics, inhibiting cell proliferation and promoting apoptosis  Hong et al. (2024) Neuraminidase 1 DOX-induced cardiomyopathy rats DOX enhances Drp1-dependent mitochondrial fission and PINK1/Parkin-mediated mitophagy by upregulating NEU1 expression, leading to cardiomyocyte apoptosis and cardiac impairment, while OSE exerts cardioprotective effects by inhibiting this pathway NEU1 plays a key role in DOX-induced cardiomyopathy, while the NEU1 inhibitor oseltamivir (OSE) exhibits potential cardioprotective effects by inhibiting Drp1-dependent mitochondrial fission and mitophagy, which may provide a new clinical strategy for the prevention or treatment of anthracycline-induced cardiotoxicity  Qin et al. (2021) SNO-Drp1 Mice Inhibition of MAP4K4 mitigates cardiac insufficiency by promoting S-nitrosylation of Drp1 by inhibiting GPX4 expression, leading to mitochondrial dysfunction and cardiac microvascular disease, thereby exacerbating cardiac insufficiency MAP4K4 provides a new potential target for the treatment of diabetic cardiomyopathy by promoting cardiac microvascular dysfunction and cardiac insufficiency caused by S-nitrosylation of Drp1  Chen et al. (2024) ferulic acid Rats were fed high-fat/high-fructose/streptozotocin Under high glucose conditions, the distortion of MAM (mitochondria-associated endoplasmic reticulum membrane) and mitochondrial dysfunction lead to the occurrence and development of diabetic cardiomyopathy, and ferulic acid (FeA) can effectively reverse these pathological changes Ferulic acid may be an effective supplement for the treatment of diabetic cardiomyopathy by modulating MAM  Salin Raj et al. (2023) Copper (ii) complexes H9c2 cardiomyocytes The copper (ii) complex induces a mechanism of apoptosis leading to DNA damage and mitochondrial dysfunction, suggesting that it has potential antitumor effects, especially in cisplatin-resistant cells Studies have found that copper (ii) complexes can enhance apoptosis by inducing DNA damage and mitochondrial dysfunction, showing potential application value in anti-tumor therapy  Zerihun and Qvit (2023) BC1618 High-fat diet-induced obesity in mice BC1618 inhibits the action of the ubiquitin E3 ligase subunit protein Fbxo48, indirectly causes an excessive increase of MTFP1, prevents the polyubiquitination and proteasomal degradation of active phosphorylated Ampkα (pAmpkα), and improves the biological activity of Ampk BC1618 enhances Ampk activity, promotes mitochondrial fission, autophagy, and improves hepatic insulin sensitivity, which has potential application value in the treatment of obesity-related metabolic disorders  Liu et al. (2021b) Resveratrol High-fat (HF) diet is fed 15-week susceptible mice with accelerated senescence Resveratrol inhibits mitochondrial dynamics, reduces inflammation and activates the Wnt/β-catenin signaling pathway, preventing cognitive impairment and aging-related neurodegenerative diseases caused by high-fat diets Resveratrol may be a potential effective drug for the prevention or treatment of aging and neurodegenerative diseases, and the mechanism is related to MTFP1  Ludwig-Słomczyńska et al. (2024) 7.1 Regulation of MTFP1 in metabolic diseases: potential from basic biology to clinical applications The close relationship between metabolic diseases such as diabetes, obesity, and fatty liver disease and mitochondrial dysfunction has been extensively studied and confirmed ( Morita et al., 2017 Zhou et al., 2022 Yu et al., 2023 Grumbach and Nguyen, 2019 Haque et al., 2024 Markovinovic et al., 2022 Johnson et al., 2021 7.2 The complex role of MTFP1 in cancer: from metabolic reprogramming to cell fate determination A key feature of cancer cells is the reprogramming of their metabolism and the enhancement of their anti-apoptotic capacity, which are largely dependent on aberrant regulation of mitochondrial dynamics ( Cisneros et al., 2022 Lin and Beal, 2006 Romani et al., 2022 Yu et al., 2021 7.3 Future outlook of MTFP1 as a drug target: a new direction for precision medicine Although significant progress has been made in the study of MTFP1 as a drug target, its clinical application still faces challenges. First, the functional regulation of MTFP1 involves a complex intracellular signaling network with close interactions with a variety of mitochondrial kinetic proteins, which makes it difficult for a single targeting strategy to produce the desired effect ( Rocca et al., 2023 Rizzo et al., 2023 Sainero-Alcolado et al., 2022 8 Prospect of clinical application of MTFP1 protein: a new era of precision medicine and mitochondrial function regulation MTFP1 plays a central role in regulating mitochondrial dynamics and is involved in maintaining the balance between intracellular energy metabolism and signal transduction. As the central role of mitochondrial function in a variety of complex diseases has been gradually revealed in recent years, the exploration of MTFP1 as a potential therapeutic target has gradually become a hot topic ( Kerr et al., 2017 8.1 Centrality of MTFP1 in mitochondrial dynamics Mitochondria serve as the center of intracellular energy metabolism and their homeostasis is essential for maintaining cellular homeostasis. MTFP1 ensures the integrity and functionality of the mitochondrial network by regulating the mitochondrial fusion process. Mitochondrial homeostasis not only influences the production of ATP, but also plays a key role in regulating intracellular calcium balance, ROS production and transduction of apoptosis signals. Therefore, any deviation in MTFP1 function can lead to severe cellular dysfunction, which in turn can lead to the occurrence of various diseases ( Cen et al., 2021 8.2 Prospects for the use of MTFP1 in the treatment of metabolic diseases Metabolic diseases such as diabetes and obesity are often associated with significant changes in mitochondrial function (maintain cellular energy production, regulate apoptosis, and balance cellular stress responses). The central role of MTFP1 in maintaining the structural and functional integrity of mitochondria makes it a potential therapeutic target for these diseases. Studies have shown that loss of function of MTFP1 is closely related to mitochondrial fragmentation, energy metabolism disorders, and lipid peroxidation. These changes not only accelerate the progression of metabolic diseases, but can also lead to increased insulin resistance. Preclinical studies have shown that mitochondrial dynamics can be effectively improved by restoring or improving the function of MTFP1, thereby reversing metabolic disorders. For example, activation of MTFP1 in mouse models of obesity and type 2 diabetes was able to significantly improve mitochondrial fusion status, restore insulin sensitivity, and reduce blood glucose levels ( Prastya et al., 2020 8.3 Challenges and opportunities for the use of MTFP1 in cancer therapy Reprogramming energy metabolism in cancer cells is an important basis for their ability to rapidly proliferate and invade, and mitochondria play a central role in this process. MTFP1 regulates the metabolic flexibility and antiapoptotic capacity of cancer cells by affecting the balance of mitochondrial fusion and division. In a variety of cancers, MTFP1 dysfunction is strongly associated with tumor progression and drug resistance ( Ludwig-Słomczyńska et al., 2024 Zhao et al., 2021 Malik and Czajka, 2013 8.4 Prospects for clinical application of MTFP1 and personalized medicine With the development of genomics and personalized medicine, the clinical application prospects of MTFP1 have been further expanded. By analyzing the patient’s genetic background, the response to MTFP1-targeted therapy can be predicted to create a more accurate treatment plan. For example, polymorphisms in the MTFP1 gene can influence a patient’s sensitivity to certain modulators, and this information can help doctors choose the most appropriate treatment strategy ( Park et al., 2018 Liu et al., 2024 Duroux-Richard et al., 2016 9 Conclusion and outlook MTFP1, as a core regulator of mitochondrial dynamics, plays a crucial role in maintaining cellular metabolic homeostasis, redox balance, and cell fate decisions. Extensive research has demonstrated that MTFP1 dysfunction can lead to mitochondrial fragmentation, enhanced oxidative stress, and cell death, all of which contribute to the onset and progression of metabolic diseases, cardiovascular disorders, and cancer, underscoring its potential as a therapeutic target for multi-system diseases. Despite the promising therapeutic prospects of MTFP1, its clinical translation faces numerous challenges. The tissue-specific functional heterogeneity of MTFP1 suggests that targeted modulation could trigger tissue-specific side effects, while issues of dose control and target specificity must be rigorously addressed. Currently, gene therapy and small-molecule interventions have shown positive progress in animal models, but their safety and efficacy in humans still require further validation. Looking ahead, a deeper understanding of MTFP1’s functional properties in cellular signaling pathways and specific disease contexts will provide a more solid theoretical foundation for its targeted intervention. With advancements in gene editing, targeted delivery systems, and multi-omics technologies, the development of highly selective, low-toxicity MTFP1 modulation strategies has become increasingly feasible. Integrating MTFP1 biology into the framework of precision medicine holds the promise of advancing personalized treatment strategies for mitochondrial-related diseases, ultimately improving patient prognosis and fostering breakthroughs in the integration of mitochondrial biology with clinical therapies. FIGURE 7 Modern applications and precise targeting of MTFP1. Abbreviations: ADP, Adenosine Diphosphate; ROS, Reactive Oxygen Species; ATP, Adenosine Triphosphate. Diagram illustrating the role of MTFP1 in metabolic, neurodegenerative, and cancer treatments. It shows mitochondrial processes and dysfunctions related to Alzheimer’s and Parkinson’s diseases, energy metabolism disorders, and lipid peroxidation in metabolic diseases. Highlights precision medicine via AI/ML bioinformatics, animal experiments, and human clinical trials. Describes mitochondrial fusion, calcium balance, ROS generation, apoptotic signaling, and prospects for personalized medicine. Chemical compounds Alpha-Ketoglutarate (PubChem CID:51); Adenosine Diphosphate (PubChem CID:6022); Adenosine Triphosphate (PubChem SID:5957); Guanosine Triphosphate (PubChem CID:135398633); Nicotinamide Adenine Dinucleotide, Reduced Form (PubChem CID:21604869); N-Acetylcysteine (PubChem CID:12035); Reactive Oxygen Species (PubChem SID:53787197); STMP1 (PubChem SID:491314938); ALKBH5 (PubChem CID:2943205); Biotinyl-amyloid beta-protein (PubChem CID:3200381); MTP18 (PubChem SID:85123418); IH-310394-07 (PubChem SID:251848198); Tumor suppressor p53 (PubChem SID:472419474); Suvorexant (PubChem CID:24965990); GTPBP8 (PubChem SID:134287128); Ilexgenin A (PubChem CID:21672638); Gypenosides (PubChem CID:9898279); Korean Red Ginseng (PubChem CID:505635692); Neuraminidase 1 (PubChem CID:65028); SNO-Drp1 (PubChem CID:134817168); ferulic acid (PubChem CID:45858); Copper(ii) complexes (PubChem CID:3032555); Resveratrol PubChem CID:445154). We thank Biorender ( biorender.com Figures 3 7 Author contributions QR: Conceptualization, Formal Analysis, Methodology, Resources, Visualization, Writing – original draft. CG: Data curation, Investigation, Project administration, Validation, Writing – original draft. CX: Investigation, Project administration, Supervision, Visualization, Writing – original draft. XH: Methodology, Software, Supervision, Validation, Writing – review and editing. YoZ: Investigation, Project administration, Supervision, Validation, Writing – review and editing. YiZ: Data curation, Investigation, Project administration, Writing – review and editing. HC: Funding acquisition, Investigation, Project administration, Visualization, Writing – original draft, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References Abudureyimu M. Yang M. Wang X. Luo X. Ge J. Peng H. 2023 Berberine alleviates myocardial diastolic dysfunction by modulating Drp1-mediated mitochondrial fission and Ca(2+) homeostasis in a murine model of HFpEF Front. Med. 17 1219 1235 10.1007/s11684-023-0983-0 37656418 Abudureyimu M. Luo X. Jiang L. Jin X. Pan C. Yu W. 2024 FBXL4 protects against HFpEF through Drp1-mediated regulation of mitochondrial dynamics and the downstream SERCA2a Redox Biol. 70 103081 10.1016/j.redox.2024.103081 38359748 PMC10878117 Aggarwal A. Sunil S. Bendifallah I. Moon M. Drobizhev M. Zarowny L. 2024 Blue-shifted genetically encoded Ca(2+) indicator with enhanced two-photon absorption Neurophotonics 11 024207 10.1117/1.NPh.11.2.024207 38577628 PMC10993905 Ahmad F. Singh A. P. Tomar D. Rahmani M. Zhang Q. Woodgett J. R. 2019 Cardiomyocyte-GSK-3α promotes mPTP opening and heart failure in mice with chronic pressure overload J. Mol. Cell Cardiol. 130 65 75 10.1016/j.yjmcc.2019.03.020 30928428 PMC6502694 Ahuja P. Ng C. F. Pang B. P. S. Chan W. S. Tse M. C. L. Bi X. 2022 Muscle-generated BDNF (brain derived neurotrophic factor) maintains mitochondrial quality control in female mice Autophagy 18 1367 1384 10.1080/15548627.2021.1985257 34689722 PMC9225428 Alevriadou B. R. Patel A. Noble M. Ghosh S. Gohil V. M. Stathopulos P. B. 2021 Molecular nature and physiological role of the mitochondrial calcium uniporter channel Am. J. Physiol. Cell Physiol. 320 C465 C482 10.1152/ajpcell.00502.2020 33296287 PMC8260355 Aranda-Rivera A. K. Cruz-Gregorio A. Aparicio-Trejo O. E. Pedraza-Chaverri J. 2021 Mitochondrial redox signaling and oxidative stress in kidney diseases Biomolecules 11 1144 10.3390/biom11081144 34439810 PMC8391472 Axelrod C. L. Fealy C. E. Mulya A. Kirwan J. P. 2019 Exercise training remodels human skeletal muscle mitochondrial fission and fusion machinery towards a pro-elongation phenotype Acta Physiol. (Oxf) 225 e13216 10.1111/apha.13216 30408342 PMC6416060 Baek M. L. Lee J. Pendleton K. E. Berner M. J. Goff E. B. Tan L. 2023 Mitochondrial structure and function adaptation in residual triple negative breast cancer cells surviving chemotherapy treatment Oncogene 42 1117 1131 10.1038/s41388-023-02596-8 36813854 PMC10069007 Bastian T. W. Von Hohenberg W. C. Georgieff M. K. Lanier L. M. 2019 Chronic energy depletion due to iron deficiency impairs dendritic mitochondrial motility during Hippocampal neuron development J. Neurosci. 39 802 813 10.1523/JNEUROSCI.1504-18.2018 30523068 PMC6382976 Bhandari P. Song M. Dorn G. W. 2015 Dissociation of mitochondrial from sarcoplasmic reticular stress in Drosophila cardiomyopathy induced by molecularly distinct mitochondrial fusion defects J. Mol. Cell Cardiol. 80 71 80 10.1016/j.yjmcc.2014.12.018 25555803 PMC4346473 Bode D. Semmler L. Wakula P. Hegemann N. Primessnig U. Beindorff N. 2021 Dual SGLT-1 and SGLT-2 inhibition improves left atrial dysfunction in HFpEF Cardiovasc Diabetol. 20 7 10.1186/s12933-020-01208-z 33413413 PMC7792219 Borkar N. A. Thompson M. A. Bartman C. M. Sathish V. Prakash Y. S. Pabelick C. M. 2023 Nicotine affects mitochondrial structure and function in human airway smooth muscle cells Am. J. Physiol. Lung Cell Mol. Physiol. 325 L803 l818 10.1152/ajplung.00158.2023 37933473 PMC11068407 Boscolo A. Milanovic D. Starr J. A. Sanchez V. Oklopcic A. Moy L. 2013 Early exposure to general anesthesia disturbs mitochondrial fission and fusion in the developing rat brain Anesthesiology 118 1086 1097 10.1097/ALN.0b013e318289bc9b 23411726 PMC3879793 Bravo-Sagua R. Parra V. LóPEZ-Crisosto C. DíAZ P. Quest A. F. Lavandero S. 2017 Calcium transport and signaling in mitochondria Compr. Physiol. 7 623 634 10.1002/cphy.c160013 28333383 Cai Y. Tian B. Deng Y. Liu L. Zhang C. Peng W. 2024 Glutamine metabolism promotes renal fibrosis through regulation of mitochondrial energy generation and mitochondrial fission Int. J. Biol. Sci. 20 987 1003 10.7150/ijbs.89960 38250160 PMC10797689 Campos J. C. Marchesi Bozi L. H. Krum B. Grassmann Bechara L. R. Ferreira N. D. Arini G. S. 2023 Exercise preserves physical fitness during aging through AMPK and mitochondrial dynamics Proc. Natl. Acad. Sci. U. S. A. 120 e2204750120 10.1073/pnas.2204750120 36595699 PMC9926278 Castro-Sepulveda S. FernáNDEZ V. R. Zbinden-Foncea H. Rieusset J. 2023 Mitochondria-SR interaction and mitochondrial fusion/fission in the regulation of skeletal muscle metabolism Metabolism 144 155578 10.1016/j.metabol.2023.155578 37164310 Celardo I. Martins L. M. Gandhi S. 2014 Unravelling mitochondrial pathways to Parkinson’s disease Br. J. Pharmacol. 171 1943 1957 10.1111/bph.12433 24117181 PMC3976614 Cen X. Zhang M. Zhou M. Ye L. Xia H. 2021 Mitophagy regulates neurodegenerative diseases Cells 10 1876 10.3390/cells10081876 34440645 PMC8392649 Chan D. C. 2020 Mitochondrial dynamics and its involvement in disease Annu. Rev. Pathol. 15 235 259 10.1146/annurev-pathmechdis-012419-032711 31585519 Chen H. Chan D. C. 2009 Mitochondrial dynamics--fusion, fission, movement, and mitophagy--in neurodegenerative diseases Hum. Mol. Genet. 18 R169 R176 10.1093/hmg/ddp326 19808793 PMC2758711 Chen L. Pan H-T. Zhang Y-N. Duo L. Dong X. Wang G-M. 2024 Therapeutic effects of electroacupuncture at different sites on rats with neuropathic pain via the spinal Nrf2/HO-1 pathway World J. Acupunct-Mox. 34 2 130 137 10.1016/j.wjam.2024.03.003 Chen W. Zhao H. Li Y. 2023 Mitochondrial dynamics in health and disease: mechanisms and potential targets Signal Transduct. Target Ther. 8 333 10.1038/s41392-023-01547-9 37669960 PMC10480456 Chen Y. Li S. Guan B. Yan X. Huang C. Du Y. 2024 MAP4K4 exacerbates cardiac microvascular injury in diabetes by facilitating S-nitrosylation modification of Drp1 Cardiovasc Diabetol. 23 164 10.1186/s12933-024-02254-7 38724987 PMC11084109 Choi G. E. Han H. J. 2021 Glucocorticoid impairs mitochondrial quality control in neurons Neurobiol. Dis. 152 105301 10.1016/j.nbd.2021.105301 33609641 Cisneros J. Belton T. B. Shum G. C. Molakal C. G. Wong Y. C. 2022 Mitochondria-lysosome contact site dynamics and misregulation in neurodegenerative diseases Trends Neurosci. 45 312 322 10.1016/j.tins.2022.01.005 35249745 PMC8930467 Colombini M. 2017 Ceramide channels and mitochondrial outer membrane permeability J. Bioenerg. Biomembr. 49 57 64 10.1007/s10863-016-9646-z 26801188 Cui H. Hu D. Liu Y. Zhao J. 2024 Identifying Acss1, Mtfp1 and Oxct1 as key regulators and promising biomarkers of sarcopenia in various models Gene 896 148053 10.1016/j.gene.2023.148053 38042218 Deng P. Haynes C. M. 2017 Mitochondrial dysfunction in cancer: potential roles of ATF5 and the mitochondrial UPR Semin. Cancer Biol. 47 43 49 10.1016/j.semcancer.2017.05.002 28499833 PMC5681445 Dhapola R. Hota S. S. Sarma P. Bhattacharyya A. Medhi B. Reddy D. H. 2021 Recent advances in molecular pathways and therapeutic implications targeting neuroinflammation for Alzheimer’s disease Inflammopharmacology 29 1669 1681 10.1007/s10787-021-00889-6 34813026 PMC8608577 Dong X. Li Y. Sheng X. Zhou W. Sun A. Dai H. 2024 Mitochondria-related signaling pathways involved in breast cancer regulate ferroptosis Genes Dis. 11 358 366 10.1016/j.gendis.2023.03.019 37588231 PMC10425853 Donnarumma E. Kohlhaas M. Vimont E. Kornobis E. Chaze T. Gianetto Q. G. 2022 Mitochondrial fission process 1 controls inner membrane integrity and protects against heart failure Nat. Commun. 13 6634 10.1038/s41467-022-34316-3 36333300 PMC9636241 Dorn G. W. 2010 Mitochondrial pruning by Nix and BNip3: an essential function for cardiac-expressed death factors J. Cardiovasc Transl. Res. 3 374 383 10.1007/s12265-010-9174-x 20559783 PMC2900478 Dulac M. Leduc-Gaudet J. P. Cefis M. Ayoub M. B. Reynaud O. Shams A. 2021 Regulation of muscle and mitochondrial health by the mitochondrial fission protein Drp1 in aged mice J. Physiol. 599 4045 4063 10.1113/JP281752 34269418 Duroux-Richard I. Roubert C. Ammari M. Présumey J. Grün J. R. Häupl T. 2016 miR-125b controls monocyte adaptation to inflammation through mitochondrial metabolism and dynamics Blood 128 3125 3136 10.1182/blood-2016-02-697003 27702798 PMC5335801 Fukuda T. Furukawa K. Maruyama T. Yamashita S. I. Noshiro D. Song C. 2023 The mitochondrial intermembrane space protein mitofissin drives mitochondrial fission required for mitophagy Mol. Cell 83 2045 2058.e9 10.1016/j.molcel.2023.04.022 37192628 PMC10330776 Geng H. Jiang J. Shen J. Hou M. 2022 Cascading alignment for unsupervised domain-adaptive DETR with improved DeNoising anchor boxes Sensors (Basel) 22 9629 10.3390/s22249629 36560000 PMC9783326 Gӧbel J. Engelhardt E. Pelzer P. Sakthivelu V. Jahn H. M. Jevtic M. 2020 Mitochondria-endoplasmic reticulum contacts in reactive astrocytes promote vascular remodeling Cell Metab. 31 791 808 10.1016/j.cmet.2020.03.005 32220306 PMC7139200 Golla V. K. Boyd K. J. May E. R. 2024 Curvature sensing lipid dynamics in a mitochondrial inner membrane model Commun. Biol. 7 29 10.1038/s42003-023-05657-6 38182788 PMC10770132 Grimm M. Cetindis M. Lehmann M. Biegner T. Munz A. Teriete P. 2014 Association of cancer metabolism-related proteins with oral carcinogenesis - indications for chemoprevention and metabolic sensitizing of oral squamous cell carcinoma? J. Transl. Med. 12 208 10.1186/1479-5876-12-208 25048361 PMC4110933 Grumbach I. M. Nguyen E. K. 2019 Metabolic stress Arterioscler. Thromb. Vasc. Biol. 39 991 997 10.1161/ATVBAHA.118.312196 31070466 PMC6531338 Guo Y. Guan T. Shafiq K. Yu Q. Jiao X. Na D. 2023 Mitochondrial dysfunction in aging Ageing Res. Rev. 88 101955 10.1016/j.arr.2023.101955 37196864 Han M. Bushong E. A. Segawa M. Tiard A. Wong A. Brady M. R. 2023a Spatial mapping of mitochondrial networks and bioenergetics in lung cancer Nature 615 712 719 10.1038/s41586-023-05793-3 36922590 PMC10033418 Han R. Liu Y. Li S. Li X. J. Yang W. 2023b PINK1-PRKN mediated mitophagy: differences between in vitro in vivo Autophagy 19 1396 1405 10.1080/15548627.2022.2139080 36282767 PMC10240983 Haque P. S. Kapur N. Barrett T. A. Theiss A. L. 2024 Mitochondrial function and gastrointestinal diseases Nat. Rev. Gastroenterol. Hepatol. 21 537 555 10.1038/s41575-024-00931-2 38740978 PMC12036329 He X. Liu J. Zang W. J. 2022 Mitochondrial homeostasis and redox status in cardiovascular diseases: protective role of the vagal system Free Radic. Biol. Med. 178 369 379 10.1016/j.freeradbiomed.2021.12.255 34906725 He Y. Ji Z. Gong Y. Fan L. Xu P. Chen X. 2023 Numb/Parkin-directed mitochondrial fitness governs cancer cell fate via Cell Rep. 42 112033 10.1016/j.celrep.2023.112033 36724072 He X. Wang L. Tsang H. Y. Liu X. Yang X. Pu S. 2024 GTPBP8 modulates mitochondrial fission through a Drp1-dependent process J. Cell Sci. 137 jcs261612 10.1242/jcs.261612 38587461 PMC11112121 He Y. H. Zhang H. B. Bi M. G. 2024 Acupuncture for cancer pain: from clinical evidence to scientific research World J. Acupunct. Moxibust 34 1 74 75 10.1016/j.wjam.2023.12.003 Hensen F. Potter A. Van Esveld S. L. Tarres-Sole A. Chakraborty A. Sola M. 2019 Mitochondrial RNA granules are critically dependent on mtDNA replication factors twinkle and mtSSB Nucleic Acids Res. 47 3680 3698 10.1093/nar/gkz047 30715486 PMC6468249 Hombrebueno J. R. Cairns L. Dutton L. R. Lyons T. J. Brazil D. P. Moynagh P. 2019 Uncoupled turnover disrupts mitochondrial quality control in diabetic retinopathy JCI Insight 4 e129760 10.1172/jci.insight.129760 31661466 PMC6962019 Hong X. Isern J. Campanario S. Perdiguero E. Ramírez-Pardo I. Segalés J. 2022 Mitochondrial dynamics maintain muscle stem cell regenerative competence throughout adult life by regulating metabolism and mitophagy Cell Stem Cell 29 1506 1508 10.1016/j.stem.2022.09.002 36206734 Hong G. L. Kim K. H. Cho S. P. Lee H. J. Kim Y. J. Jung J. Y. 2024 Korean red ginseng alleviates benign prostatic hyperplasia by dysregulating androgen receptor signaling and inhibiting DRP1-mediated mitochondrial fission Chin. J. Nat. Med. 22 599 607 10.1016/S1875-5364(24)60671-0 39059829 Hu Y. Chen H. Zhang L. Lin X. Li X. Zhuang H. 2021 The AMPK-MFN2 axis regulates MAM dynamics and autophagy induced by energy stresses Autophagy 17 1142 1156 10.1080/15548627.2020.1749490 32249716 PMC8143230 Ihenacho U. K. Meacham K. A. Harwig M. C. Widlansky M. E. Hill R. B. 2021 Mitochondrial fission protein 1: emerging roles in organellar form and function in health and disease Front. Endocrinol. (Lausanne) 12 660095 10.3389/fendo.2021.660095 33841340 PMC8027123 Iorio R. Celenza G. Petricca S. 2021 Mitophagy: molecular mechanisms, new concepts on parkin activation and the emerging role of AMPK/ULK1 axis Cells 11 30 10.3390/cells11010030 35011593 PMC8750607 Ji L. L. Kang C. 2015 Role of PGC-1α in sarcopenia: etiology and potential intervention - a mini-review Gerontology 61 139 148 10.1159/000365947 25502801 Ji J. Wang Y. Jing A. Ma L. Yang J. Ren D. 2024 HIF1A-dependent overexpression of MTFP1 promotes lung squamous cell carcinoma development by activating the glycolysis pathway Heliyon 10 e28440 10.1016/j.heliyon.2024.e28440 38689964 PMC11059513 Jin P. Jiang J. Zhou L. Huang Z. Nice E. C. Huang C. 2022 Mitochondrial adaptation in cancer drug resistance: prevalence, mechanisms, and management J. Hematol. Oncol. 15 97 10.1186/s13045-022-01313-4 35851420 PMC9290242 Johnson J. Mercado-Ayon E. Mercado-Ayon Y. Dong Y. N. Halawani S. Ngaba L. 2021 Mitochondrial dysfunction in the development and progression of neurodegenerative diseases Arch. Biochem. Biophys. 702 108698 10.1016/j.abb.2020.108698 33259796 Juliana O. A. Leonardo M. Pereira C. Santos I. Soares A. Carneiro C. 2020 Strenuous acute exercise induces slow and fast twitch-dependent NADPH oxidase expression in rat skeletal muscle Antioxidants 9 1 57 10.3390/antiox9010057 31936265 PMC7022445 Kerr J. S. Adriaanse B. A. Greig N. H. Mattson M. P. Cader M. Z. Bohr V. A. 2017 Mitophagy and Alzheimer’s disease: cellular and molecular mechanisms Trends Neurosci. 40 151 166 10.1016/j.tins.2017.01.002 28190529 PMC5341618 Kimura T. Isaka Y. Yoshimori T. 2017 Autophagy and kidney inflammation Autophagy 13 997 1003 10.1080/15548627.2017.1309485 28441075 PMC5486362 Klemmensen M. M. Borrowman S. H. Pearce C. Pyles B. Chandra B. 2024 Mitochondrial dysfunction in neurodegenerative disorders Neurotherapeutics 21 e00292 10.1016/j.neurot.2023.10.002 38241161 PMC10903104 Kreymerman A. Buickians D. N. Nahmou M. M. Tran T. Galvao J. Wang Y. 2019 MTP18 is a novel regulator of mitochondrial fission in CNS neuron development, axonal growth, and injury responses Sci. Rep. 9 10669 10.1038/s41598-019-46956-5 31337818 PMC6650498 Kruglik S. G. Yoo B. K. Lambry J. C. Martin J. L. Negrerie M. 2017 Structural changes and picosecond to second dynamics of cytochrome c in interaction with nitric oxide in ferrous and ferric redox states Phys. Chem. Chem. Phys. 19 21317 21334 10.1039/c7cp02634j 28759066 Kubat G. B. Bouhamida E. Ulger O. Turkel I. Pedriali G. Ramaccini D. 2023 Mitochondrial dysfunction and skeletal muscle atrophy: causes, mechanisms, and treatment strategies Mitochondrion 72 33 58 10.1016/j.mito.2023.07.003 37451353 Kulkarni P. G. Mohire V. M. Bhaisa P. K. Joshi M. M. Puranik C. M. Waghmare P. P. 2023 Mitofusin-2: functional switch between mitochondrial function and neurodegeneration Mitochondrion 69 116 129 10.1016/j.mito.2023.02.001 36764501 Kuo C. L. Ponneri Babuharisankar A. Lin Y. C. Lien H. W. Lo Y. K. Chou H. Y. 2022 Mitochondrial oxidative stress in the tumor microenvironment and cancer immunoescape: foe or friend? J. Biomed. Sci. 29 74 10.1186/s12929-022-00859-2 36154922 PMC9511749 Leduc-Gaudet J. P. Hussain S. N. A. Barreiro E. Gouspillou G. 2021 Mitochondrial dynamics and mitophagy in skeletal muscle health and aging Int. J. Mol. Sci. 22 8179 10.3390/ijms22158179 34360946 PMC8348122 Li J. Ye Y. Liu Z. Zhang G. Dai H. Li J. 2022a Macrophage mitochondrial fission improves cancer cell phagocytosis induced by therapeutic antibodies and is impaired by glutamine competition Nat. Cancer 3 453 470 10.1038/s43018-022-00354-5 35484420 Li Y. Ma Y. Dang Q. Y. Fan X. R. Han C. T. Xu S. Z. 2022b Assessment of mitochondrial dysfunction and implications in cardiovascular disorders Life Sci. 306 120834 10.1016/j.lfs.2022.120834 35902031 Li Y-L. Li S-D. Wu Y. Yi W-J. Zuo Q-F. Yu X-C. 2025 China Association of Acupuncture and Moxibustion leading the development of acupuncture-moxibustion discipline: Achievement and practice World J. Acupunct-Mox. 10.1016/j.wjam.2025.08.003 Lin M. T. Beal M. F. 2006 Mitochondrial dysfunction and oxidative stress in neurodegenerative diseases Nature 443 787 795 10.1038/nature05292 17051205 Liu S. Zhao M. Zhou Y. Li L. Wang C. Yuan Y. 2020 A self-assembling peptide hydrogel-based drug co-delivery platform to improve tissue repair after ischemia-reperfusion injury Acta Biomater. 103 102 114 10.1016/j.actbio.2019.12.011 31843715 Liu L. Li Y. Wang J. Zhang D. Wu H. Li W. 2021a Mitophagy receptor FUNDC1 is regulated by PGC-1α/NRF1 to fine tune mitochondrial homeostasis EMBO Rep. 22 e50629 10.15252/embr.202050629 33554448 PMC7926232 Liu Y. Jurczak M. J. Lear T. B. Lin B. Larsen M. B. Kennerdell J. R. 2021b A Fbxo48 inhibitor prevents pAMPKα degradation and ameliorates insulin resistance Nat. Chem. Biol. 17 298 306 10.1038/s41589-020-00723-0 33495648 PMC8529588 Liu B. H. Xu C. Z. Liu Y. Lu Z. L. Fu T. L. Li G. R. 2024 Mitochondrial quality control in human health and disease Mil. Med. Res. 11 32 10.1186/s40779-024-00536-5 38812059 PMC11134732 Lizama B. N. Chu C. T. 2021 Neuronal autophagy and mitophagy in Parkinson’s disease Mol. Asp. Med. 82 100972 10.1016/j.mam.2021.100972 34130867 PMC8665948 Lozhkin A. Vendrov A. E. Ramos-MondragóN R. Canugovi C. Stevenson M. D. Herron T. J. 2022 Mitochondrial oxidative stress contributes to diastolic dysfunction through impaired mitochondrial dynamics Redox Biol. 57 102474 10.1016/j.redox.2022.102474 36183542 PMC9530618 Luchetti F. Carloni S. Nasoni M. G. Reiter R. J. Balduini W. 2022 Tunneling nanotubes and mesenchymal stem cells: new insights into the role of melatonin in neuronal recovery J. Pineal Res. 73 e12800 10.1111/jpi.12800 35419879 PMC9540876 Ludwig-Słomczyńska A. H. Seweryn M. T. Wiater J. Borys A. Ledwoń A. Druszczyńska M. 2024 Cytosolic nucleic acid sensing and mitochondrial transcriptomic changes as early triggers of metabolic disease in db/db mice Mamm. Genome 35 68 76 10.1007/s00335-023-10026-z 37979047 PMC10884043 Ma X. Manley S. Qian H. Li Y. Zhang C. Li K. 2023 Mitochondria-lysosome-related organelles mediate mitochondrial clearance during cellular dedifferentiation Cell Rep. 42 113291 10.1016/j.celrep.2023.113291 37862166 PMC10842364 Malik A. N. Czajka A. 2013 Is mitochondrial DNA content a potential biomarker of mitochondrial dysfunction? Mitochondrion 13 5 481 492 10.1016/j.mito.2012.10.011 23085537 Mamouni K. Kallifatidis G. Lokeshwar B. L. 2021 Targeting mitochondrial metabolism in prostate cancer with triterpenoids Int. J. Mol. Sci. 22 2466 10.3390/ijms22052466 33671107 PMC7957768 Marin-Garcia J. Akhmedov A. T. 2016 Mitochondrial dynamics and cell death in heart failure Heart Fail. Rev. 21 123 136 10.1007/s10741-016-9530-2 26872674 Markovinovic A. Greig J. MartíN-Guerrero S. M. Salam S. Paillusson S. 2022 Endoplasmic reticulum-mitochondria signaling in neurons and neurodegenerative diseases J. Cell Sci. 135 jcs248534 10.1242/jcs.248534 35129196 Matija L. R. Stankovic I. M. Puric M. Miličić M. Maksimović-Ivanić D. Mijatovic S. 2023 The second derivative of fullerene C(60) (SD-C(60)) and biomolecular machinery of hydrogen bonds: water-based nanomedicine Micromachines (Basel) 14 2152 10.3390/mi14122152 38138321 PMC10745578 Maycotte P. Marín-Hernández A. Goyri-Aguirre M. Anaya-Ruiz M. Reyes-Leyva J. Cortés-Hernández P. 2017 Mitochondrial dynamics and cancer Tumour Biol. 39 1010428317698391 10.1177/1010428317698391 28468591 Meng Y. Guo D. Lin L. Zhao H. Xu W. Luo S. 2024 Glycolytic enzyme PFKL governs lipolysis by promoting lipid droplet-mitochondria tethering to enhance β-oxidation and tumor cell proliferation Nat. Metab. 6 1092 1107 10.1038/s42255-024-01047-2 38773347 Miller D. R. Thorburn A. 2021 Autophagy and organelle homeostasis in cancer Dev. Cell 56 906 918 10.1016/j.devcel.2021.02.010 33689692 PMC8026727 Mima A. 2022 Mitochondria-targeted drugs for diabetic kidney disease Heliyon 8 e08878 10.1016/j.heliyon.2022.e08878 35265754 PMC8899696 Missiroli S. Perrone M. Gafà R. Nicoli F. Bonora M. Morciano G. 2023 PML at mitochondria-associated membranes governs a trimeric complex with NLRP3 and P2X7R that modulates the tumor immune microenvironment Cell Death Differ. 30 429 441 10.1038/s41418-022-01095-9 36450825 PMC9713080 Montagnani Marelli M. Macchi C. Ruscica M. Sartori P. Moretti R. M. 2024 Anticancer activity of delta-tocotrienol in human hepatocarcinoma: involvement of autophagy induction Cancers (Basel) 16 2654 10.3390/cancers16152654 39123382 PMC11311296 Montes De Oca Balderas P. Aguilera P. 2015 A metabotropic-like flux-independent NMDA receptor regulates Ca2+ exit from endoplasmic reticulum and mitochondrial membrane potential in cultured astrocytes PLoS One 10 e0126314 10.1371/journal.pone.0126314 25954808 PMC4425671 Morita M. Prudent J. Basu K. Goyon V. Katsumura S. Hulea L. 2017 mTOR controls mitochondrial dynamics and cell survival via MTFP1 Mol. Cell 67 922 935 10.1016/j.molcel.2017.08.013 28918902 Morris H. R. Spillantini M. G. Sue C. M. Williams-Gray C. H. 2024 The pathogenesis of Parkinson’s disease Lancet 403 293 304 10.1016/S0140-6736(23)01478-2 38245249 Naviaux R. K. 2014 Metabolic features of the cell danger response Mitochondrion 16 7 17 10.1016/j.mito.2013.08.006 23981537 Oshima Y. Cartier E. Boyman L. Verhoeven N. Polster B. M. Huang W. 2021 Parkin-independent mitophagy via Drp1-mediated outer membrane severing and inner membrane ubiquitination J. Cell Biol. 220 e202006043 10.1083/jcb.202006043 33851959 PMC8050842 Palikaras K. Lionaki E. Tavernarakis N. 2015 Coordination of mitophagy and mitochondrial biogenesis during ageing in C. elegans Nature 521 525 528 10.1038/nature14300 25896323 Pan S. Zhou J. Yang W. Zhu W. Zhu T. Yang B. 2023 MiR-125b-5p targets MTFP1 to inhibit cell proliferation, migration, and invasion and facilitate cell apoptosis in endometrial carcinoma Mol. Biotechnol. 65 961 969 10.1007/s12033-022-00601-1 36380260 Pan R. F. Ma S. Y. Gao T. Y. Zhang F. C. Li T. Y. Jia C. S. 2024 Acupoint selection rules in treatment of cancer with moxibustion World J. Acupunct. Moxibust 34 1 54 62 10.1016/j.wjam.2023.12.005 Panchal K. Tiwari A. K. 2019 Mitochondrial dynamics, a key executioner in neurodegenerative diseases Mitochondrion 47 151 173 10.1016/j.mito.2018.11.002 30408594 Pang S. Wu J. Guo F. F. Gao L. L. Tian X. Zhang J. 2024 Fluorogenic chemical probe strategy for precise tracking of mitochondrial polarity Anal. Chem. 96 14800 14808 10.1021/acs.analchem.4c02364 39213642 Papachristodoulou A. Rodriguez-Calero A. Panja S. Margolskee E. Virk R. K. Milner T. A. 2021 NKX3.1 localization to mitochondria suppresses prostate cancer initiation Cancer Discov. 11 2316 2333 10.1158/2159-8290.CD-20-1765 33893149 PMC7611624 Park Y. S. Choi S. E. Koh H. C. 2018 PGAM5 regulates PINK1/Parkin-mediated mitophagy via Toxicol. Lett. 284 120 128 10.1016/j.toxlet.2017.12.004 29241732 Patitucci C. HernáNDEZ-Camacho J. D. Vimont E. Yde S. Cokelaer T. Chaze T. 2023 Mtfp1 ablation enhances mitochondrial respiration and protects against hepatic steatosis Nat. Commun. 14 8474 10.1038/s41467-023-44143-9 38123539 PMC10733382 Peng W. Wong Y. C. Krainc D. 2020 Mitochondria-lysosome contacts regulate mitochondrial Ca(2+) dynamics via Proc. Natl. Acad. Sci. U. S. A. 117 19266 19275 10.1073/pnas.2003236117 32703809 PMC7430993 Phan T. T. T. Lin Y. C. Chou Y. T. Wu C. W. Lin L. Y. 2022 Tumor suppressor p53 restrains cancer cell dissemination by modulating mitochondrial dynamics Oncogenesis 11 26 10.1038/s41389-022-00401-x 35589683 PMC9120037 Podor B. Hu Y. L. Ohkura M. Nakai J. Croll R. Fine A. 2015 Comparison of genetically encoded calcium indicators for monitoring action potentials in mammalian brain by two-photon excitation fluorescence microscopy Neurophotonics 2 021014 10.1117/1.NPh.2.2.021014 26158004 PMC4478877 Pokharel M. D. Marciano D. P. Fu P. Franco M. C. Unwalla H. Tieu K. 2023 Metabolic reprogramming, oxidative stress, and pulmonary hypertension Redox Biol. 64 102797 10.1016/j.redox.2023.102797 37392518 PMC10363484 Prajapati S. K. Ahmed S. Rai V. Gupta S. C. Krishnamurthy S. 2024 Suvorexant improves mitochondrial dynamics with the regulation of orexinergic and mTOR activation in rats exhibiting PTSD-like symptoms J. Affect Disord. 350 24 38 10.1016/j.jad.2024.01.045 38185385 Prastya M. E. Astuti R. I. Batubara I. Takagi H. Wahyudi A. T. 2020 Natural extract and its fractions isolated from the marine bacterium Pseudoalteromonas flavipulchra STILL-33 have antioxidant and antiaging activities in Schizosaccharomyces pombe FEMS Yeast Res. 20 foaa014 10.1093/femsyr/foaa014 32175559 Qin Y. Lv C. Zhang X. Ruan W. Xu X. Chen C. 2021 Neuraminidase1 inhibitor protects against doxorubicin-induced cardiotoxicity via Front. Cell Dev. Biol. 9 802502 10.3389/fcell.2021.802502 34977042 PMC8719652 Quiles J. M. Gustafsson Å. B. 2022 The role of mitochondrial fission in cardiovascular health and disease Nat. Rev. Cardiol. 19 723 736 10.1038/s41569-022-00703-y 35523864 PMC10584015 Rabinovich-Nikitin I. Rasouli M. Reitz C. J. Posen I. Margulets V. Dhingra R. 2021 Mitochondrial autophagy and cell survival is regulated by the circadian clock gene in cardiac myocytes during ischemic stress Autophagy 17 3794 3812 10.1080/15548627.2021.1938913 34085589 PMC8632283 Ragunathan V. Chithra K. Shivanika C. Sudharsan M. S. 2022 Modelling and targeting mitochondrial protein tyrosine phosphatase 1: a computational approach Silico Pharmacol. 10 3 10.1007/s40203-022-00119-z 35111562 PMC8762535 Rahman F. A. Baechler B. L. Quadrilatero J. 2024 Key considerations for investigating and interpreting autophagy in skeletal muscle Autophagy 20 2121 2132 10.1080/15548627.2024.2373676 39007805 PMC11423691 Rangaraju V. Lewis T. L. Jr. Hirabayashi Y. Bergami M. Motori E. Cartoni R. 2019 Pleiotropic mitochondria: the influence of mitochondria on neuronal development and disease J. Neurosci. 39 8200 8208 10.1523/JNEUROSCI.1157-19.2019 31619488 PMC6794931 Reddy P. H. Oliver D. M. 2019 Amyloid beta and phosphorylated tau-induced defective autophagy and mitophagy in Alzheimer’s disease Cells 8 488 10.3390/cells8050488 31121890 PMC6562604 Rey T. Zaganelli S. Cuillery E. Vartholomaiou E. Croisier M. Martinou J. C. 2020 Mitochondrial RNA granules are fluid condensates positioned by membrane dynamics Nat. Cell Biol. 22 1180 1186 10.1038/s41556-020-00584-8 32989247 PMC7610405 Rizzo F. Bono S. Ruepp M. D. Salani S. Ottoboni L. Abati E. 2023 Combined RNA interference and gene replacement therapy targeting MFN2 as proof of principle for the treatment of charcot-marie-tooth type 2A Cell Mol. Life Sci. 80 373 10.1007/s00018-023-05018-w 38007410 PMC10676309 Roca-Portoles A. Tait S. W. G. 2021 Mitochondrial quality control: from molecule to organelle Cell Mol. Life Sci. 78 3853 3866 10.1007/s00018-021-03775-0 33782711 PMC8106605 Rocca C. Soda T. De Francesco E. M. Fiorillo M. Moccia F. Viglietto G. 2023 Mitochondrial dysfunction at the crossroad of cardiovascular diseases and cancer J. Transl. Med. 21 635 10.1186/s12967-023-04498-5 37726810 PMC10507834 Rolver M. G. Severin M. Pedersen S. F. 2024 Regulation of cancer cell lipid metabolism and oxidative phosphorylation by microenvironmental acidosis Am. J. Physiol. Cell Physiol. 327 C869 c883 10.1152/ajpcell.00429.2024 39099426 Romani P. Nirchio N. Arboit M. Barbieri V. Tosi A. Michielin F. 2022 Mitochondrial fission links ECM mechanotransduction to metabolic redox homeostasis and metastatic chemotherapy resistance Nat. Cell Biol. 24 168 180 10.1038/s41556-022-00843-w 35165418 PMC7615745 Rovira-Llopis S. Bañuls C. Diaz-Morales N. Hernandez-Mijares A. Rocha M. Victor V. M. 2017 Mitochondrial dynamics in type 2 diabetes: pathophysiological implications Redox Biol. 11 637 645 10.1016/j.redox.2017.01.013 28131082 PMC5284490 Ruiz L. M. Libedinsky A. Elorza A. A. 2021 Role of copper on mitochondrial function and metabolism Front. Mol. Biosci. 8 711227 10.3389/fmolb.2021.711227 34504870 PMC8421569 Sabat M. J. Wiśniewska-Becker A. M. Markiewicz M. Marzec K. M. Dybas J. Furso J. 2021 Tauroursodeoxycholic acid (TUDCA)-lipid interactions and antioxidant properties of TUDCA studied in model of photoreceptor membranes Membr. (Basel) 11 327 10.3390/membranes11050327 33946822 PMC8146903 Sainero-Alcolado L. Liaño-Pons J. Ruiz-Pérez M. V. Arsenian-Henriksson M. 2022 Targeting mitochondrial metabolism for precision medicine in cancer Cell Death Differ. 29 1304 1317 10.1038/s41418-022-01022-y 35831624 PMC9287557 Salin Raj P. Nair A. Preetha Rani M. R. Rajankutty K. Ranjith S. Raghu K. G. 2023 Ferulic acid attenuates high glucose-induced MAM alterations via Int. J. Cardiol. 372 101 109 10.1016/j.ijcard.2022.12.003 36481261 Sas K. Robotka H. Toldi J. Vecsei L. 2007 Mitochondria, metabolic disturbances, oxidative stress and the kynurenine system, with focus on neurodegenerative disorders J. Neurol. Sci. 257 221 239 10.1016/j.jns.2007.01.033 17462670 Scarpelli P. H. Tessarin-Almeida G. Viçoso K. L. Lima W. R. Borges-Pereira L. Meissner K. A. 2019 Melatonin activates FIS1, DYN1, and DYN2 Plasmodium falciparum related-genes for mitochondria fission: mitoemerald-GFP as a tool to visualize mitochondria structure J. Pineal Res. 66 e12484 10.1111/jpi.12484 29480948 PMC6585791 Schneegans S. Löptien J. Mojzisch A. Loreth D. Kretz O. Raschdorf C. 2024 HERC5 downregulation in non-small cell lung cancer is associated with altered energy metabolism and metastasis J. Exp. Clin. Cancer Res. 43 110 10.1186/s13046-024-03020-z 38605423 PMC11008035 Shi J. Yu T. Song K. Du S. He S. Hu X. 2021 Dexmedetomidine ameliorates endotoxin-induced acute lung injury in vivo and in vitro by preserving mitochondrial dynamic equilibrium through the HIF-1a/HO-1 signaling pathway Redox Biol. 41 101954 10.1016/j.redox.2021.101954 33774474 PMC8027777 Shi L. J. Hu X. Y. Tian Z. Y. Xiu W. C. Jiao R. M. Hu X. Y. 2024 Review acupuncture for fibromyalgia: an evidence map World J. Acupunct. Moxibust 34 1 31 39 10.1016/j.wjam.2023.07.001 Shneyer B. I. Usaj M. Wiesel-Motiuk N. Regev R. Henn A. 2017 ROS induced distribution of mitochondria to filopodia by Myo19 depends on a class specific tryptophan in the motor domain Sci. Rep. 7 11577 10.1038/s41598-017-11002-9 28912530 PMC5599611 Silva Ramos E. Motori E. Brüser C. Kühl I. Yeroslaviz A. Ruzzenente B. 2019 Mitochondrial fusion is required for regulation of mitochondrial DNA replication PLoS Genet. 15 e1008085 10.1371/journal.pgen.1008085 31170154 PMC6553695 Sim C. H. Gabriel K. Mills R. D. Culvenor J. G. Cheng H. C. 2012 Analysis of the regulatory and catalytic domains of PTEN-induced kinase-1 (PINK1) Hum. Mutat. 33 1408 1422 10.1002/humu.22127 22644621 Singh K. Sripada L. Lipatova A. Roy M. Prajapati P. Gohel D. 2018 NLRX1 resides in mitochondrial RNA granules and regulates mitochondrial RNA processing and bioenergetic adaptation Biochim. Biophys. Acta Mol. Cell Res. 1865 1260 1276 10.1016/j.bbamcr.2018.06.008 29932989 Singh K. Chen Y. C. Hassanzadeh S. Han K. Judy J. T. Seifuddin F. 2021 Network analysis and transcriptome profiling identify autophagic and mitochondrial dysfunctions in SARS-CoV-2 infection Front. Genet. 12 599261 10.3389/fgene.2021.599261 33796130 PMC8008150 Singh T. Sharma K. Jena L. Kaur P. Singh S. Munshi A. 2024 Mitochondrial bioenergetics of breast cancer Mitochondrion 79 101951 10.1016/j.mito.2024.101951 39218051 Sollanek K. J. Burniston J. G. Kavazis A. N. Morton A. B. Wiggs M. P. Ahn B. 2017 Global proteome changes in the rat diaphragm induced by endurance exercise training PLoS One 12 e0171007 10.1371/journal.pone.0171007 28135290 PMC5279855 Song M. Dorn G. W. 2015 Mitoconfusion: noncanonical functioning of dynamism factors in static mitochondria of the heart Cell Metab. 21 195 205 10.1016/j.cmet.2014.12.019 25651174 PMC4318266 Song Y. Xu Y. Liu Y. Gao J. Feng L. Zhang Y. 2021 Mitochondrial quality control in the maintenance of cardiovascular homeostasis: the roles and interregulation of UPS, mitochondrial dynamics and mitophagy Oxid. Med. Cell Longev. 2021 3960773 10.1155/2021/3960773 34804365 PMC8601824 Song Y. Cao H. Zuo C. Gu Z. Huang Y. Miao J. 2023 Mitochondrial dysfunction: a fatal blow in depression Biomed. Pharmacother. 167 115652 10.1016/j.biopha.2023.115652 37801903 Soranno D. E. Rodell C. B. Altmann C. Duplantis J. Andres-Hernando A. Burdick J. A. 2016 Delivery of interleukin-10 via injectable hydrogels improves renal outcomes and reduces systemic inflammation following ischemic acute kidney injury in mice Am. J. Physiol. Ren. Physiol. 311 F362 F372 10.1152/ajprenal.00579.2015 26962109 PMC5008670 Srinivasan S. Guha M. Kashina A. Avadhani N. G. 2017 Mitochondrial dysfunction and mitochondrial dynamics-the cancer connection Biochim. Biophys. Acta Bioenerg. 1858 602 614 10.1016/j.bbabio.2017.01.004 28104365 PMC5487289 Sun F. Fang M. Zhang H. Song Q. Li S. Li Y. 2024 Drp1: focus on diseases triggered by the mitochondrial pathway Cell Biochem. Biophys. 82 435 455 10.1007/s12013-024-01245-5 38438751 Szabadkai G. Simoni A. M. Chami M. Wieckowski M. R. Youle R. J. Rizzuto R. 2004 Drp-1-dependent division of the mitochondrial network blocks intraorganellar Ca2+ waves and protects against Ca2+-mediated apoptosis Mol. Cell 16 59 68 10.1016/j.molcel.2004.09.026 15469822 Tábara L. C. Poveda J. Martin-Cleary C. Selgas R. Ortiz A. Sanchez-Niño M. D. 2014 Mitochondria-targeted therapies for acute kidney injury Expert Rev. Mol. Med. 16 e13 10.1017/erm.2014.14 25104110 Tábara L. C. Burr S. P. Frison M. Chowdhury S. R. Paupe V. Nie Y. 2024 MTFP1 controls mitochondrial fusion to regulate inner membrane quality control and maintain mtDNA levels Cell 187 3619 3637.e27 10.1016/j.cell.2024.05.017 38851188 Teodorof-Diedrich C. Spector S. A. 2018 Human immunodeficiency virus type 1 gp120 and tat induce mitochondrial fragmentation and incomplete mitophagy in human neurons J. Virol. 92 e00993-18 10.1128/JVI.00993-18 30158296 PMC6206485 Tian H. Chen X. Liao J. Yang T. Cheng S. Mei Z. 2022 Mitochondrial quality control in stroke: from the mechanisms to therapeutic potentials J. Cell Mol. Med. 26 1000 1012 10.1111/jcmm.17189 35040556 PMC8831937 Tokuyama T. Yanagi S. 2023 Role of mitochondrial dynamics in heart diseases Genes (Basel) 14 1876 10.3390/genes14101876 37895224 PMC10606177 Tong M. Zablocki D. Sadoshima J. 2020 The role of Drp1 in mitophagy and cell death in the heart J. Mol. Cell Cardiol. 142 138 145 10.1016/j.yjmcc.2020.04.015 32302592 PMC7545744 Valero T. 2014 Mitochondrial biogenesis: pharmacological approaches Curr. Pharm. Des. 20 5507 5509 10.2174/138161282035140911142118 24606795 Vásquez-Trincado C. GarcíA-Carvajal I. Pennanen C. Parra V. Hill J. A. Rothermel B. A. 2016 Mitochondrial dynamics, mitophagy and cardiovascular disease J. Physiol. 594 509 525 10.1113/JP271301 26537557 PMC5341713 Volkov A. N. Van Nuland N. A. 2012 Electron transfer interactome of cytochrome C PLoS Comput. Biol. 8 e1002807 10.1371/journal.pcbi.1002807 23236271 PMC3516563 Wang K. Gan T. Y. Li N. Liu C. Y. Zhou L. Y. Gao J. N. 2017a Circular RNA mediates cardiomyocyte death via Cell Death Differ. 24 1111 1120 10.1038/cdd.2017.61 28498369 PMC5442477 Wang Y. Subramanian M. Yurdagul A. Jr. Barbosa-Lorenzi V. C. Cai B. De Juan-Sanz J. 2017b Mitochondrial fission promotes the continued clearance of apoptotic cells by macrophages Cell 171 331 345 10.1016/j.cell.2017.08.041 28942921 PMC5679712 Wang J. Toan S. Zhou H. 2020 Mitochondrial quality control in cardiac microvascular ischemia-reperfusion injury: new insights into the mechanisms and therapeutic potentials Pharmacol. Res. 156 104771 10.1016/j.phrs.2020.104771 32234339 Wang X. Ren L. Chen S. Tao Y. Zhao D. Wu C. 2022 Long non-coding RNA MIR4435-2HG/microRNA-125a-5p axis is involved in myocardial ischemic injuries Bioengineered 13 10707 10720 10.1080/21655979.2022.2051259 35475469 PMC9208505 Wang J. Yang Y. Sun F. Luo Y. Yang Y. Li J. 2023a ALKBH5 attenuates mitochondrial fission and ameliorates liver fibrosis by reducing Drp1 methylation Pharmacol. Res. 187 106608 10.1016/j.phrs.2022.106608 36566000 Wang S. F. Tseng L. M. Lee H. C. 2023b Role of mitochondrial alterations in human cancer progression and cancer immunity J. Biomed. Sci. 30 61 10.1186/s12929-023-00956-w 37525297 PMC10392014 Wei Y. Chiang W. C. Sumpter R. Jr. Mishra P. Levine B. 2017 Prohibitin 2 is an inner mitochondrial membrane mitophagy receptor Cell 168 224 238 10.1016/j.cell.2016.11.042 28017329 PMC5235968 Wei Q. Sun H. Song S. Liu Y. Liu P. Livingston M. J. 2018 MicroRNA-668 represses MTP18 to preserve mitochondrial dynamics in ischemic acute kidney injury J. Clin. Invest 128 5448 5464 10.1172/JCI121859 30325740 PMC6264638 West A. Brummel B. E. Braun A. R. Rhoades E. Sachs J. N. 2016 Membrane remodeling and mechanics: experiments and simulations of alpha-Synuclein Biochim. Biophys. Acta 1858 1594 1609 10.1016/j.bbamem.2016.03.012 26972046 PMC5081225 White C. R. Datta G. Giordano S. 2017 High-density lipoprotein regulation of mitochondrial function Adv. Exp. Med. Biol. 982 407 429 10.1007/978-3-319-55330-6_22 28551800 PMC5822681 Wisowski G. Pudelko A. Olczyk K. Paul-Samojedny M. Kozma E. M. 2022 Dermatan sulfate affects breast cancer cell function via the induction of necroptosis Cells 11 173 10.3390/cells11010173 35011734 PMC8750542 Wu S. Lu Q. Wang Q. Ding Y. Ma Z. Mao X. 2017 Binding of FUN14 domain containing 1 with inositol 1,4,5-Trisphosphate receptor in mitochondria-associated endoplasmic reticulum membranes maintains mitochondrial dynamics and function in hearts in vivo Circulation 136 2248 2266 10.1161/CIRCULATIONAHA.117.030235 28942427 PMC5716911 Wu D. Yang Y. Hou Y. Zhao Z. Liang N. Yuan P. 2022a Increased mitochondrial fission drives the reprogramming of fatty acid metabolism in hepatocellular carcinoma cells through suppression of Sirtuin 1 Cancer Commun. (Lond) 42 37 55 10.1002/cac2.12247 34981667 PMC8753313 Wu Q. Liu J. Mao Z. Tian L. Wang N. Wang G. 2022b Ligustilide attenuates ischemic stroke injury by promoting Drp1-mediated mitochondrial fission via Phytomedicine 95 153884 10.1016/j.phymed.2021.153884 34929562 Wu L. Fan Z. Gu L. Liu J. Cui Z. Yu B. 2023 QiShenYiQi dripping pill alleviates myocardial ischemia-induced ferroptosis via improving mitochondrial dynamical homeostasis and biogenesis J. Ethnopharmacol. 308 116282 10.1016/j.jep.2023.116282 36806343 Wu Y. Li Y. L. Li S. D. 2024 China Association of Acupuncture and Moxibustion (CAAM): Leading development of acupuncture, contributing Chinese wisdom to the world World J. Acupunct-Mox. 34 2 176 178 10.1016/j.wjam.2023.12.004 Wu Z. Xiao C. Long J. Huang W. You F. Li X. 2024 Mitochondrial dynamics and colorectal cancer biology: mechanisms and potential targets Cell Commun. Signal 22 91 10.1186/s12964-024-01490-4 38302953 PMC10835948 Xavier V. J. Martinou J. C. 2021 RNA granules in the mitochondria and their organization under mitochondrial stresses Int. J. Mol. Sci. 22 9502 10.3390/ijms22179502 34502411 PMC8431320 Xiao T. Sun J. Xing Z. Xie F. Yang L. Ding W. 2020 MTFP1 overexpression promotes the growth of oral squamous cell carcinoma by inducing ROS production Cell Biol. Int. 44 821 829 10.1002/cbin.11278 31814213 Xie C. Wang F. Y. Sang Y. Chen B. Huang J. H. He F. J. 2022 Mitochondrial micropeptide STMP1 enhances mitochondrial fission to promote tumor metastasis Cancer Res. 82 2431 2443 10.1158/0008-5472.CAN-21-3910 35544764 Yan C. Gong L. Chen L. Xu M. Abou-Hamdan H. Tang M. 2020 PHB2 (prohibitin 2) promotes PINK1-PRKN/Parkin-dependent mitophagy by the PARL-PGAM5-PINK1 axis Autophagy 16 419 434 10.1080/15548627.2019.1628520 31177901 PMC6999623 Yang M. Deng S. Jiang J. Tian M. Xiao L. Gong Y. 2023 Oxytocin improves intracerebral hemorrhage outcomes by suppressing neuronal pyroptosis and mitochondrial fission Stroke 54 1888 1900 10.1161/STROKEAHA.123.043391 37317879 Yang X. Feng H. Kim J. Ti G. Wang L. Wang K. 2024 PRR34-AS1 promotes mitochondrial division and glycolytic reprogramming in hepatocellular carcinoma cells through upregulation of MIEF2 Acta Biochim. Biophys. Sin. (Shanghai) 56 1604 1617 10.3724/abbs.2024083 38779765 PMC11659787 Yasuda T. Ishihara T. Ichimura A. Ishihara N. 2023 Mitochondrial dynamics define muscle fiber type by modulating cellular metabolic pathways Cell Rep. 42 112434 10.1016/j.celrep.2023.112434 37097817 Yoo S. M. Jung Y. K. 2018 A molecular approach to mitophagy and mitochondrial dynamics Mol. Cells 41 18 26 10.14348/molcells.2018.2277 29370689 PMC5792708 You W. Knoops K. Berendschot T. Benedikter B. J. Webers C. A. B. Reutelingsperger C. P. M. 2024 PGC-1a mediated mitochondrial biogenesis promotes recovery and survival of neuronal cells from cellular degeneration Cell Death Discov. 10 180 10.1038/s41420-024-01953-0 38632223 PMC11024166 Yu F. Abdelwahid E. Xu T. Hu L. Wang M. Li Y. 2020 The role of mitochondrial fusion and fission in the process of cardiac oxidative stress Histol. Histopathol. 35 541 552 10.14670/HH-18-191 31820815 Yu Y. Peng X. D. Qian X. J. Zhang K. M. Huang X. Chen Y. H. 2021 Fis1 phosphorylation by met promotes mitochondrial fission and hepatocellular carcinoma metastasis Signal Transduct. Target Ther. 6 401 10.1038/s41392-021-00790-2 34848680 PMC8632923 Yu T. Wang L. Zhang L. Deuster P. A. 2023 Mitochondrial fission as a therapeutic target for metabolic diseases: insights into antioxidant strategies Antioxidants (Basel) 12 1163 10.3390/antiox12061163 37371893 PMC10295595 Zeng K. W. Wang J. K. Wang L. C. Guo Q. Liu T. T. Wang F. J. 2021 Small molecule induces mitochondrial fusion for neuroprotection via targeting CK2 without affecting its conventional kinase activity Signal Transduct. Target Ther. 6 71 10.1038/s41392-020-00447-6 33602894 PMC7893052 Zerihun M. Qvit N. 2023 Selective inhibitors targeting Fis1/Mid51 protein-protein interactions protect against hypoxia-induced damage in cardiomyocytes Front. Pharmacol. 14 1275370 10.3389/fphar.2023.1275370 38192411 PMC10773907 Zhao M. Zhou Y. Liu S. Li L. Chen Y. Cheng J. 2018 Control release of mitochondria-targeted antioxidant by injectable self-assembling peptide hydrogel ameliorated persistent mitochondrial dysfunction and inflammation after acute kidney injury Drug Deliv. 25 546 554 10.1080/10717544.2018.1440445 29451033 PMC6058479 Zhao J. Zhu H. Duan K. Petralia R. S. Wang Y. X. Gu Q. 2021 Dysbindin-1 regulates mitochondrial fission and gamma oscillations Mol. Psychiatry 26 4633 4651 10.1038/s41380-021-01038-9 33589740 PMC8364574 Zheng Y. Wei W. Wang Y. Li T. Wei Y. Gao S. 2024 Gypenosides exert cardioprotective effects by promoting mitophagy and activating PI3K/Akt/GSK-3β/Mcl-1 signaling PeerJ 12 e17538 10.7717/peerj.17538 38912051 PMC11193969 Zhong W. J. Zhang J. Duan J. X. Zhang C. Y. Ma S. C. Li Y. S. 2023 TREM-1 triggers necroptosis of macrophages through mTOR-dependent mitochondrial fission during acute lung injury J. Transl. Med. 21 179 10.1186/s12967-023-04027-4 36879273 PMC9990355 Zhou W. Marinelli F. Nief C. Faraldo-GóMEZ J. D. 2017 Atomistic simulations indicate the c-subunit ring of the F(1)F(o) ATP synthase is not the mitochondrial permeability transition pore Elife 6 e23781 10.7554/eLife.23781 28186490 PMC5323039 Zhou J. Li X. Y. Liu Y. J. Feng J. Wu Y. Shen H. M. 2022 Full-coverage regulations of autophagy by ROS: from induction to maturation Autophagy 18 1240 1255 10.1080/15548627.2021.1984656 34662529 PMC9225210 Zhu Y. Li M. Lu Y. Li J. Ke Y. Yang J. 2019 Ilexgenin A inhibits mitochondrial fission and promote Drp1 degradation by Nrf2-induced PSMB5 in endothelial cells Drug Dev. Res. 80 481 489 10.1002/ddr.21521 30762899 Zuo Y. Zhang C. Z. Ren Q. Chen Y. Li X. Yang J. R. 2022 Activation of mitochondrial-associated apoptosis signaling pathway and inhibition of PI3K/Akt/mTOR signaling pathway by voacamine suppress breast cancer progression Phytomedicine 99 154015 10.1016/j.phymed.2022.154015 35278901 Glossary α-KG Alpha-Ketoglutarate ADP Adenosine Diphosphate ANT Adenylate translocase ALR Adenosine L-Ribose AKI Acute Kidney Injury AKT RAC Alpha Serine/Threonine-Protein Kinase AMPK AMP-activated protein kinase ATP Adenosine Triphosphate BiK Bcl-2-like protein 11 BP1 Mitochondria-Related Biomarker 1 cDEG cavity differentially expressed genes CMA Chaperone-Mediated Autophagy CypD cyclic adenosine monophosphate-dependent phosphokinase Cyt C cytochrome C DAMPs Damage-Associated Molecular Patterns DoX Doxorubicin Drp1 Dynamin-related protein 1 EPK1 Extracellular Signal-Regulated Kinase 1 ER Endoplasmic reticulum EC Endothelial Cell FADH2 Flavin Adenine Dinucleotide fDEGs Fasting differential genes FIS1 Fission 1 Protein GYP Gypenosides GTP Guanosine triphosphate HCC hepatocellular carcinoma HK Hexokinase HR1 Hemagglutinin Receptor 1 HSCTe Human Stem Cell Transplantation HSP27 Heat Shock Protein 27 IA Ilexgenin A IMM Inner Mitochondrial Membrane KRG Korean Red Ginseng MTFP1 mitochondrial fission process 1 mTORC1 mammalian targeting Rapamycin complex 1 mPTP mitochondrial permeability transition pore MAMs Mitochondria Associated Membranes MCU mitochondrial calcium unidirectional transporter MCAO Middle cerebral artery occlusion mice MUL1 Mitochondrial E3 Ubiquitin Protein Ligase 1 MKK Mitogen-Activated Protein Kinase Kinase MAPK Mitogen-Activated Protein Kinase NADH Nicotinamide Adenine Dinucleotide, Reduced Form nDNA nuclear DNA NSCLC Non-small cell lung cancer NAC N-Acetylcysteine OXPHOS oxidative phosphorylation NLRP3 NOD-like Receptor Family Pyrin Domain Containing 3 OMM Outer Mitochondrial Membrane OSCC Oral Squamous Cell Carcinoma PrP1 Prion Protein 1 PTSD Post-Traumatic Stress Disorder PI3k Phosphoinositide 3-Kinase PDK1 3-Phosphoinositide-Dependent Protein Kinase 1 ROS Reactive Oxygen Species ROS Reactive oxygen species RGCs Retinal ganglion cells SMEM Small Molecule Exchange Membrane SMURF1 Smad Ubiquitin Ligase E3 SRC Src Proto-Oncogene, Non-Receptor Tyrosine Kinase TCA Tricarboxylic Acid Cycle TM Transmembrane TME tumor microenvironment TSC1 Tuberous Sclerosis Complex 1 RPKM Reads Per Kilobase of exon model per Million mapped reads RhEb Ras Homolog Enriched in Brain TP Testosterone propionate VRAP Vacuolar ATPase Assembly Protein ",
  "metadata": {
    "Title of this paper": "Activation of mitochondrial-associated apoptosis signaling pathway and inhibition of PI3K/Akt/mTOR signaling pathway by voacamine suppress breast cancer progression",
    "Journal it was published in:": "Frontiers in Cell and Developmental Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477198/"
  }
}