{
  "title": "Paper_203",
  "abstract": "pmc Int J Mol Med Int J Mol Med 1936 ijmm IJMM International Journal of Molecular Medicine 1107-3756 1791-244X Spandidos Publications PMC12488210 PMC12488210.1 12488210 12488210 40999978 10.3892/ijmm.2025.5643 ijmm-56-06-05643 1 Review Mechanisms of action of retinal microglia in diabetic retinopathy (Review) Bai Yuyang 1 Wang Xinrong 1 Qi Fan 1 Zuo Xiaoyang 1 Zou Gang 2  1  2 Correspondence to: Dr Gang Zou, Department of Ophthalmology, Ningxia Eye Hospital, People's Hospital of Ningxia Hui Autonomous Region, Third Clinical School of Medicine, Ningxia Medical University, 301 Zhengyuan North Street, Yinchuan, Ningxia Hui Autonomous Region 750001, P.R. China, E-mail: zougang_2000@163.com 12 2025 22 9 2025 56 6 497464 202 09 4 2025 07 7 2025 22 09 2025 02 10 2025 02 10 2025 Copyright: © 2025 Bai et al. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Diabetic retinopathy (DR), a leading cause of blindness in diabetic microvascular complications, is pathologically associated with the dynamic regulation of retinal microglia. The present review systematically elucidated the dual roles of microglia in DR pathogenesis. Under physiological conditions, microglia maintain blood-retinal barrier (BRB) integrity by phagocytosing metabolic debris and secreting neurotrophic factors. However, hyperglycaemic stress induces pathological M1 polarization, triggering a cytokine storm (TNF-α and IL-1β) via the Toll-like receptor 4/myeloid differentiation primary response 88/NF-κB signalling axis, which synergizes with proangiogenic factors (such as VEGF and insulin-like growth factor 1) to exacerbate BRB breakdown and pathological neovascularization. Notably, activated microglia amplify inflammatory cascades through astrocyte-Müller cell interaction networks, accelerating neurovascular unit dysfunction. Emerging therapeutic strategies targeting microglial polarization homeostasis (such as promoting M2 anti-inflammatory phenotypic shifts) and blocking critical inflammatory signalling pathways present novel opportunities for developing multitarget therapeutic agents with combined neuroprotective and anti-vasopermeability properties. By elucidating microglial heterogeneity and intercellular regulatory networks, the present review highlighted the importance of precise modulation of immune homeostasis in DR management, providing a theoretical foundation for overcoming the limitations of single-target therapies. Key words diabetic retinopathy microglial cell blood-retinal barrier neurovascular unit targeted therapy Natural Science Foundation of Ningxia 2024AAC02067 Supported by the Natural Science Foundation of Ningxia (grant no. 2024AAC02067). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The prevalence of diabetes mellitus (DM), a global chronic metabolic disorder, is rapidly increasing in developing countries, with >400 million current global cases; approximately one-third of individuals with DM develop diabetic retinopathy (DR) ( 1 4 5 9 2 10 Fig. 1 11 14 14 Microglia, the resident immune cells of the CNS, originate from erythromyeloid progenitors in the yolk sac during embryogenesis. These cells possess unique self-renewal capabilities and maintain homeostatic density through localized proliferation throughout their lifespan ( 13 13 15 16 17 Fig. 2 18 As a critical component of the mononuclear phagocyte system, retinal microglia colonize the retina during embryogenesis and participate in the regulation of vascular development ( 15 19 20 21 24 16 25 Under physiological conditions, retinal microglia sustain a dynamic equilibrium by forming a functional interaction network with neurons, vascular endothelial cells and Müller cells. The roles of retinal microglia include phagocytosing pathogens, clearing cellular debris and modulating synaptic plasticity ( 16 24 26 17 27 The BRB, comprising the inner (iBRB) and outer barriers, safeguards retinal homeostasis through its NVU ( 18 28 30 31 32 33 35 36 39 40 41 2. Phenotypic polarization of microglia in DR Microglia can be classified into multiple subtypes based on morphological features, gene expression profiles, anatomical localization and functional states. The classical categorization distinguishes between M1-like and M2-like phenotypes ( 42 43 45 17 46 48 49 Advances in single-cell RNA sequencing have improved the understanding of microglial transcriptional and metabolic dynamics ( 50 51 52 53 54 Although individual microglia have a finite lifespan, their self-renewal capacity compensates for cellular attrition, preserving region-specific population densities ( 13 55 55 56 57 58 59 3. Mechanisms of microglial involvement in DR Impact of a hyperglycaemic microenvironment on microglial activation The pathogenesis of DR is closely associated with chronic hyperglycaemia ( 2 Fig. 3 60 63 61 63 60 64 65 64 66 69 Clinical studies have indicated that under hyperglycaemic conditions, microglia rapidly activate and release various inflammatory cytokines, such as TNF-α, IL-1β and IL-6, forming a proinflammatory cycle ( 70 72 73 74 Retinal microglial effects on retinal vasculature Hyperglycaemia-induced microglial activation serves as a central link connecting metabolic dysregulation and retinal vascular injury. Activated M1-like microglia disrupt BRB function and promote pathological neovascularization through the release of inflammatory mediators and the modulation of key signalling pathways ( 75 76 77 The dual regulatory role of retinal microglia in BRB homeostasis is central to vascular pathology in DR. While maintaining ocular immune privilege through selective molecular transport regulation ( 34 35 78 80 80 41 81 86 79 These microglial-mediated vascular barrier alterations create a proangiogenic microenvironment that synergistically promotes the pathological neovascularization processes. In retinal diseases, microglial activation promotes inflammatory factor production and BRB damage, leading to a hypoxic retinal microenvironment. This hypoxia further drives aberrant neovascularization, exacerbating disease progression ( 87 Microglia exert both direct and indirect effects on pathological neovascularization in DR. A previous study demonstrated that microglia cultured under hypoxic conditions in vitro 88 90 89 90 Microglia regulate pathological neovascularization through the release of inflammatory mediators. VEGFR1 expression increases with M1-like microglial activation, promoting pathological angiogenesis ( 89 91 92 93 94 95 Certain microglial subtypes mitigate neovascularization. Fas ligand-positive (FasL+) microglia induce the apoptosis of Fas+ endothelial cells and phagocytose them ( 96 97 Microglia also regulate retinal neovascularization through specific signalling pathways. Enhanced CD200R-CD200 (on microglia and endothelial cells, respectively) interactions critically drive angiogenesis ( 98 99 100 101 102 These findings underscore the dual roles of microglia in retinal vascular pathology. The phenotypic heterogeneity of microglia and their interactions with hypoxic microenvironments exacerbate vascular lesions, suggesting that targeting microglial polarization or key signalling pathways may offer novel therapeutic strategies for DR. Dual roles of microglia in neuroprotection and neurotoxicity in DR As resident immune cells of the retina, microglia serve critical roles in maintaining retinal homeostasis and responding to injury. Under physiological conditions, microglia exert neuroprotective effects by releasing anti-inflammatory factors, such as IL-10 and TGF-β, to suppress inflammatory responses and safeguard retinal neurons ( 103 104 During DR progression, however, microglia shift towards a proinflammatory phenotype, contributing to neural injury. Under hyperglycaemic conditions, activated microglia release excessive proinflammatory cytokines, including TNF-α and IL-1β, which disrupt synaptic connectivity and impair neuronal signalling, exacerbating retinal inflammation and neurodegeneration ( 16 105 In the systemic hyperglycaemic milieu, retinal microglia generate excessive ROS, which directly damage neuronal cell membranes and mitochondria ( 106 74 In summary, microglia exhibit dual mechanisms in DR, balancing neuroprotection and neurotoxicity. A deeper understanding of these mechanisms may inform novel therapeutic strategies to delay DR progression. Altered microglial intercellular interactions in DR During retinal vascular development, macroglia, such as astrocytes, form scaffold-like structures with loose ensheathment around nascent vessels, whereas Müller cells collaborate with astrocytes to maintain BRB integrity ( 107 109 110 Microglial-Müller cell interactions Müller cells respond to microglial activation at the molecular and functional levels, enhancing microglial activation and migration through bidirectional signalling between the two cell types ( 111 111 112 113 114 Microglia-astrocyte interactions In the early DR stages, activated retinal microglia release inflammatory mediators that stimulate astrocyte activation, driving their proliferation and further cytokine secretion ( 115 115 116 117 115 4. Signalling pathways of microglia in DR TLR4/MyD88/NF-κB p65 signalling pathway The activation of retinal microglia involves multiple signalling pathways, with the TLR4/MyD88/NF-κB p65 pathway serving a pivotal role ( Fig. 4 118 119 120 MAPK signalling pathway The MAPK pathway also plays a critical role in microglial activation. In DR, hyperglycemia-induced oxidative stress and AGEs first trigger Toll-like/IL-1 receptors on retinal microglia. Receptor engagement leads to phosphorylation of IRAK-1/4, which forms a complex with TRAF6 and initiates downstream MAPK cascades, sequentially activating the MKK3/6-p38 MAPK and MKK4/7-JNK pathways ( 121 83 122 Interactions with Müller cells and endothelial cells Proinflammatory IL-1β binds to IL-1 receptors (IL-1Rs) on Müller cells, enhancing VEGF transcription and secretion ( 78 3 4 5 123 123 124 125 Complement system activation The C3a and C5a complement components activate microglia by binding their respective receptors, inducing the secretion of inflammatory mediators ( 126 127 128 129 Hyperglycaemia-specific signalling features Under hyperglycaemic conditions, microglia upregulate TLR4 expression, which increases their sensitivity to PAMPs and DAMPs, thereby sustaining chronic inflammation ( 119 130 131 Studies have demonstrated that inhibition of the NF-κB pathway significantly reduces microglial activation and inflammation in diabetic retinas ( 83 132 134 5. Potential therapeutic applications of microglia in DR Current standard treatments for PDR include panretinal photocoagulation (PRP), intravitreal anti-VEGF agents (used alone or combined with surgery), angiopoietin inhibitors and vitrectomy ( 135 136 137 138 139 140 135 141 142 Abnormal aggregation and polarization of microglia serve pivotal roles in DR pathogenesis ( 143 Reducing activated microglial populations Previous studies have demonstrated that certain anti-VEGF therapies influence microglial activity ( 89 144 145 et al 145 146 In addition to anti-VEGF therapies, various novel approaches have demonstrated the potential to suppress or reduce activated microglia, thereby attenuating pathological retinal angiogenesis. These approaches include melatonin ( 147 148 149 149 150 151 152 153 Promoting M1-to-M2 phenotype shift M2-polarized microglia exhibit inhibitory effects on DR progression, making the conversion of M1 microglia to M2 microglia a potential therapeutic strategy to suppress DR pathogenesis ( 154 et al 155 156 157 Arginase-1, an enzyme involved in the urea cycle and immune regulation, serves a key role in regulating microglial polarization ( 158 160 43 35 Inhibiting proangiogenic cytokine secretion In addition to TNF-α and IL-1β, VEGF is a key proangiogenic biomarker secreted by microglia that promotes retinal neovascularization through direct or indirect pathways ( 87 89 161 162 163 93 164 96 165 166 167 Risks and challenges in microglial-targeted therapies Although microglial-targeted therapies show promising potential for DR treatment, significant risks and challenges are faced. Under physiological conditions, microglia perform critical functions, such as immune surveillance and maintenance of retinal microenvironment homeostasis ( 168 169 The activation states and functional regulation of microglia are highly complex. Single intervention approaches often fail to precisely steer the polarization of microglia towards a therapeutically beneficial phenotype, limiting treatment efficacy ( 170 171 52 Furthermore, the long-term efficacy and safety of microglial-targeted therapies require further validation. Current studies predominantly focus on short-term outcomes, with limited experimental or clinical data addressing critical issues such as long-term functional changes in microglia, delayed adverse effects or persistent impacts on retinal physiology. This includes research demonstrating the significant therapeutic potential of the NOX1/4 inhibitor GKT137831 (Setanaxib) in diabetic retinopathy models, which effectively reduces Iba1-positive microglia population, lowers their production of reactive oxygen species, and decreases expression of inflammatory factors such as VEGF, IL-6 and TNF-α ( 74 170 172 173 174 Advancements in localized drug delivery technologies, however, offer new avenues to address these challenges. For example, nanoparticle-based retinal targeting systems are rapidly evolving. By engineering nanocarriers for precise intraretinal drug delivery and sustained release, these systems increase the drug concentration at lesion sites while minimizing systemic side effects ( 175 176 6. Conclusions and perspectives In DR, microglia serve dual roles; microglia migrate and proliferate to participate in ocular immune privilege, vascular debris clearance and retinal protection/repair, and simultaneously contribute to BRB disruption via activation of the TLR4/MyD88/NF-κB p65 signalling pathway. Furthermore, activated microglia promote NVU dysfunction and pathological neovascularization through the release of inflammatory mediators and the modulation of signalling pathways. Given this dual functionality, microglial-targeted therapies, such as reducing activated microglial populations, promoting M1-M2 phenotypic shifts and inhibiting proangiogenic cytokine secretion, offer a novel approach to DR management. These strategies may complement existing treatments, such as PRP and intravitreal anti-VEGF injections, while mitigating their side effects. However, as microglia are also present in the CNS, therapeutic interventions must be localized to the retina to avoid systemic impacts. The development of precise microglial-targeted therapies remains challenging owing to an incomplete understanding of the exact contributions of microglia to DR progression. Future research should prioritize comprehensive investigations into microglial subtypes, their functional dynamics in the diabetic retina and their interactions with other glial cells. This includes developing strategies to precisely regulate microglial activity without off-target effects and exploring microglia-derived biomarkers for early DR detection and intervention. Advances in these areas will provide transformative therapeutic solutions for this high-incidence disease that severely impacts quality of life. Acknowledgements Not applicable. Availability of data and materials Not applicable. Authors' contributions YB wrote the manuscript and drew the figures. XZ performed the literature search and drafted the manuscript. XW revised the manuscript. FQ and GZ reviewed and edited the manuscript. All authors read and approved the final version of the manuscript. Data authentication is not applicable. Ethics approval and consent to participate Not applicable. Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. References 1 World Health Organization (WHO) Global report on diabetes WHO Geneva 1 88 2016 2 Altmann C Schmidt MHH The role of microglia in diabetic retinopathy: Inflammation, microvasculature defects and neurodegeneration Int J Mol Sci 19 110 2018 10.3390/ijms19010110 29301251 PMC5796059 3 Obrosova IG Kador PF Aldose reductase/polyol inhibitors for diabetic retinopathy Curr Pharm Biotechnol 12 373 385 2011 10.2174/138920111794480642 20939801 4 Cheung N Mitchell P Wong TY Diabetic retinopathy Lancet 376 124 136 2010 10.1016/S0140-6736(09)62124-3 20580421 5 Teo ZL Tham YC Yu M Chee ML Rim TH Cheung N Bikbov MM Wang YX Tang Y Lu Y Global prevalence of diabetic retinopathy and projection of burden through 2045: Systematic review and meta-analysis Ophthalmology 128 1580 1591 2021 10.1016/j.ophtha.2021.04.027 33940045 6 Yang QH Zhang Y Zhang XM Li XR Prevalence of diabetic retinopathy, proliferative diabetic retinopathy and non-proliferative diabetic retinopathy in Asian T2DM patients: A systematic review and meta-analysis Int J Ophthalmol 12 302 311 2019 30809489 10.18240/ijo.2019.02.19 PMC6376231 7 Cheyne CP Burgess PI Broadbent DM García-Fiñana M Stratton IM Criddle T Wang A Alshukri A Rahni MM Vazquez-Arango P Incidence of sight-threatening diabetic retinopathy in an established urban screening programme: An 11-year cohort study Diabet Med 38 e14583 2021 10.1111/dme.14583 33830513 8 Das A Stroud S Mehta A Rangasamy S New treatments for diabetic retinopathy Diabetes Obes Metab 17 219 230 2015 10.1111/dom.12384 25160598 9 Wei L Sun X Fan C Li R Zhou S Yu H The pathophysiological mechanisms underlying diabetic retinopathy Front Cell Dev Biol 10 963615 2022 10.3389/fcell.2022.963615 36111346 PMC9468825 10 Arroba AI Alcalde-Estevez E García-Ramírez M Cazzoni D de la Villa P Sánchez-Fernández EM Mellet CO García Fernández JM Hernández C Simó R Valverde ÁM Modulation of microglia polarization dynamics during diabetic retinopathy in db/db mice Biochim Biophys Acta 1862 1663 1674 2016 10.1016/j.bbadis.2016.05.024 27267343 11 Kinuthia UM Wolf A Langmann T Microglia and inflammatory responses in diabetic retinopathy Front Immunol 11 564077 2020 10.3389/fimmu.2020.564077 33240260 PMC7681237 12 Arnett HA Mason J Marino M Suzuki K Matsushima GK Ting JPY TNF alpha promotes proliferation of oligodendrocyte progenitors and remyelination Nat Neurosci 4 1116 1122 2001 10.1038/nn738 11600888 13 Prinz M Jung S Priller J Microglia biology: One century of evolving concepts Cell 179 292 311 2019 10.1016/j.cell.2019.08.053 31585077 14 Yang S Zhang J Chen L The cells involved in the pathological process of diabetic retinopathy Biomed Pharmacother 132 110818 2020 10.1016/j.biopha.2020.110818 33053509 15 Van Furth R Cohn ZA Hirsch JG Humphrey JH Spector WG Langevoort HL The mononuclear phagocyte system: A new classification of macrophages, monocytes, and their precursor cells Bull World Health Organ 46 845 852 1972 4538544 PMC2480884 16 Rao B Liu X Xiao J Wu X He F Yang Q Zhao W Lin X Zhang J Microglia heterogeneity during neuroinflammation and neurodegeneration in the mouse retina Brain Struct Funct 230 19 2024 10.1007/s00429-024-02875-4 39720969 17 Karlstetter M Scholz R Rutar M Wong WT Provis JM Langmann T Retinal microglia: Just bystander or target for therapy? Prog Retin Eye Res 45 30 57 2015 10.1016/j.preteyeres.2014.11.004 25476242 18 Usui Y Elucidation of pathophysiology and novel treatment for diabetic macular edema derived from the concept of neurovascular unit JMA J 3 201 207 2020 10.31662/jmaj.2020-0022 33150254 PMC7590397 19 Hughes S Yang H Chan-Ling T Vascularization of the human fetal retina: Roles of vasculogenesis and angiogenesis Invest Ophthalmol Vis Sci 41 1217 1228 2000 10752963 20 Frost JL Schafer DP Microglia: Architects of the developing nervous system Trends Cell Biol 26 587 597 2016 10.1016/j.tcb.2016.02.006 27004698 PMC4961529 21 Rymo SF Gerhardt H Wolfhagen Sand F Lang R Uv A Betsholtz C A two-way communication between microglial cells and angiogenic sprouts regulates angiogenesis in aortic ring cultures PLoS One 6 e15846 2011 10.1371/journal.pone.0015846 21264342 PMC3018482 22 Haupt F Krishnasamy K Napp LC Augustynik M Limbourg A Gamrekelashvili J Bauersachs J Haller H Limbourg FP Retinal myeloid cells regulate tip cell selection and vascular branching morphogenesis via Notch ligand Delta-like 1 Sci Rep 9 9798 2019 10.1038/s41598-019-46308-3 31278348 PMC6611798 23 Endo Y Asanuma D Namiki S Sugihara K Hirose K Uemura A Kubota Y Miura T Quantitative modeling of regular retinal microglia distribution Sci Rep 11 22671 2021 10.1038/s41598-021-01820-3 34811401 PMC8608893 24 Asare-Bediako B Adu-Agyeiwaah Y Abad A Li Calzi S Floyd JL Prasad R DuPont M Asare-Bediako R Bustelo XR Grant MB Hematopoietic cells influence vascular development in the retina Cells 11 3207 2022 10.3390/cells11203207 36291075 PMC9601270 25 Perochon T Krsnik Z Massimo M Ruchiy Y Romero AL Mohammadi E Li X Long KR Parkkinen L Blomgren K Unraveling microglial spatial organization in the developing human brain with DeepCellMap, a deep learning approach coupled with spatial statistics Nat Commun 16 1577 2025 10.1038/s41467-025-56560-z 39948387 PMC11825940 26 Li F Jiang D Samuel MA Microglia in the developing retina Neural Dev 14 12 2019 10.1186/s13064-019-0137-x 31888774 PMC6938006 27 Zhou LY Liu ZG Sun YQ Li YZ Teng ZQ Liu CM Preserving blood-retinal barrier integrity: A path to retinal ganglion cell protection in glaucoma and traumatic optic neuropathy Cell Regen 14 13 2025 10.1186/s13619-025-00228-y 40172766 PMC11965071 28 Klaassen I Van Noorden CJF Schlingemann RO Molecular basis of the inner blood-retinal barrier and its breakdown in diabetic macular edema and other pathological conditions Prog Retin Eye Res 34 19 48 2013 10.1016/j.preteyeres.2013.02.001 23416119 29 Guymer RH Bird AC Hageman GS Cytoarchitecture of choroidal capillary endothelial cells Invest Ophthalmol Vis Sci 45 1660 1666 2004 10.1167/iovs.03-0913 15161823 30 Hormel TT Jia Y Jian Y Hwang TS Bailey ST Pennesi ME Wilson DJ Morrison JC Huang D Plexus-specific retinal vascular anatomy and pathologies as seen by projection-resolved optical coherence tomographic angiography Prog Retin Eye Res 80 100878 2021 10.1016/j.preteyeres.2020.100878 32712135 PMC7855241 31 Amoaku WM Ghanchi F Bailey C Banerjee S Banerjee S Downey L Gale R Hamilton R Khunti K Posner E Diabetic retinopathy and diabetic macular oedema pathways and management: UK consensus working group Eye (Lond) 34 Suppl 1 S1 S51 2020 10.1038/s41433-020-0961-6 PMC7337227 32504038 32 Opdenakker G Abu El-Asrar A Metalloproteinases mediate diabetes-induced retinal neuropathy and vasculopathy Cell Mol Life Sci 76 3157 3166 2019 10.1007/s00018-019-03177-3 31183508 PMC11105743 33 O'Leary F Campbell M The blood-retina barrier in health and disease FEBS J 290 878 891 2023 10.1111/febs.16330 34923749 34 Schafer DP Lehrman EK Kautzman AG Koyama R Mardinly AR Yamasaki R Ransohoff RM Greenberg ME Barres BA Stevens B Microglia sculpt postnatal neural circuits in an activity and complement-dependent manner Neuron 74 691 705 2012 10.1016/j.neuron.2012.03.026 22632727 PMC3528177 35 Zhu X Hong J Zhou X Biological immune mechanism of retina Front Biosci (Landmark Ed) 28 363 2023 10.31083/j.fbl2812363 38179761 36 Kumar A Kumar A Kumar J Bai G Jeewnani R Dembra M Kanwal K Qadeer U Khawar MH Yaseen Khan I Comparative efficacy of anti-vascular endothelial growth factor (anti-VEGF) agents and corticosteroids in managing diabetic retinopathy-associated diabetic macular edema: A meta-analysis and comprehensive systematic review Cureus 16 e51910 2024 38333510 10.7759/cureus.51910 PMC10850611 37 Lee WJ Kang MH Seong M Cho HY Comparison of aqueous concentrations of angiogenic and inflammatory cytokines in diabetic macular oedema and macular oedema due to branch retinal vein occlusion Br J Ophthalmol 96 1426 1430 2012 10.1136/bjophthalmol-2012-301913 22930681 38 Meng C Gu C He S Su T Lhamo T Draga D Qiu Q Pyroptosis in the retinal neurovascular unit: New insights into diabetic retinopathy Front Immunol 12 763092 2021 10.3389/fimmu.2021.763092 34737754 PMC8560732 39 Romero-Aroca P Baget-Bernaldiz M Pareja-Rios A Lopez-Galvez M Navarro-Gil R Verges R Diabetic macular edema pathophysiology: Vasogenic versus inflammatory J Diabetes Res 2016 2156273 2016 10.1155/2016/2156273 27761468 PMC5059543 40 Zhang Y Zhao L Wang X Ma W Lazere A Qian HH Zhang J Abu-Asab M Fariss RN Roger JE Wong WT Repopulating retinal microglia restore endogenous organization and function under CX3CL1-CX3CR1 regulation Sci Adv 4 eaap8492 2018 10.1126/sciadv.aap8492 29750189 PMC5943055 41 Zhao L Zabel MK Wang X Ma W Shah P Fariss RN Qian H Parkhurst CN Gan WB Wong WT Microglial phagocytosis of living photoreceptors contributes to inherited retinal degeneration EMBO Mol Med 7 1179 1197 2015 10.15252/emmm.201505298 26139610 PMC4568951 42 Wang J He W Zhang J A richer and more diverse future for microglia phenotypes Heliyon 9 e14713 2023 10.1016/j.heliyon.2023.e14713 37025898 PMC10070543 43 Fouda AY Xu Z Suwanpradid J Rojas M Shosha E Lemtalsi T Patel C Xing J Zaidi SA Zhi W Targeting proliferative retinopathy: Arginase 1 limits vitreoretinal neovascularization and promotes angiogenic repair Cell Death Dis 13 745 2022 10.1038/s41419-022-05196-8 36038541 PMC9424300 44 Li X Yu ZW Li HY Yuan Y Gao XY Kuang HY Retinal microglia polarization in diabetic retinopathy Vis Neurosci 38 E006 2021 10.1017/S0952523821000031 33934736 45 Ikeda T Nakamura K Kida T Oku H Possible roles of anti-type II collagen antibody and innate immunity in the development and progression of diabetic retinopathy Graefes Arch Clin Exp Ophthalmol 260 387 403 2022 10.1007/s00417-021-05342-6 34379187 PMC8786754 46 Ibrahim AS El-Shishtawy MM Peña A Jr Liou GI Genistein attenuates retinal inflammation associated with diabetes by targeting of microglial activation Mol Vis 16 2033 2042 2010 21042558 PMC2965567 47 Cukras CA Petrou P Chew EY Meyerle CB Wong WT Oral minocycline for the treatment of diabetic macular edema (DME): Results of a phase I/II clinical study Invest Ophthalmol Vis Sci 53 3865 3874 2012 10.1167/iovs.11-9413 22589436 PMC3390218 48 Madeira MH Boia R Santos PF Ambrósio AF Santiago AR Contribution of microglia-mediated neuroinflammation to retinal degenerative diseases Mediators Inflamm 2015 673090 2015 10.1155/2015/673090 25873768 PMC4385698 49 Grigsby JG Cardona SM Pouw CE Muniz A Mendiola AS Tsin ATC Allen DM Cardona AE The role of microglia in diabetic retinopathy J Ophthalmol 2014 705783 2014 10.1155/2014/705783 25258680 PMC4166427 50 Paolicelli RC Sierra A Stevens B Tremblay ME Aguzzi A Ajami B Amit I Audinat E Bechmann I Bennett M Microglia states and nomenclature: A field at its crossroads Neuron 110 3458 3483 2022 10.1016/j.neuron.2022.10.020 36327895 PMC9999291 51 Sun N Victor MB Park YP Xiong X Scannail AN Leary N Prosper S Viswanathan S Luna X Boix CA Human microglial state dynamics in Alzheimer's disease progression Cell 186 4386 4403.e29 2023 10.1016/j.cell.2023.08.037 37774678 PMC10644954 52 He J Fu Y Ge L Dai J Fang Y Li Y Gu X Tao Z Zou T Li M Disease-associated microglial activation prevents photoreceptor degeneration by suppressing the accumulation of cell debris and neutrophils in degenerating rat retinas Theranostics 12 2687 2706 2022 10.7150/thno.67954 35401812 PMC8965480 53 Shemer A Grozovski J Tay TL Tao J Volaski A Süß P Ardura-Fabregat A Gross-Vered M Kim JS David E Engrafted parenchymal brain macrophages differ from microglia in transcriptome, chromatin landscape and response to challenge Nat Commun 9 5206 2018 10.1038/s41467-018-07548-5 30523248 PMC6284018 54 Buttgereit A Lelios I Yu X Vrohlings M Krakoski NR Gautier EL Nishinakamura R Becher B Greter M Sall1 is a transcriptional regulator defining microglia identity and function Nat Immunol 17 1397 1406 2016 10.1038/ni.3585 27776109 55 Jurga AM Paleczna M Kuter KZ Overview of general and discriminating markers of differential microglia phenotypes Front Cell Neurosci 14 198 2020 10.3389/fncel.2020.00198 32848611 PMC7424058 56 Wolf J Boneva S Rosmus DD Agostini H Schlunck G Wieghofer P Schlecht A Lange C In-depth molecular profiling specifies human retinal microglia identity Front Immunol 13 863158 2022 10.3389/fimmu.2022.863158 35371110 PMC8971200 57 Masuda T Amann L Sankowski R Staszewski O Lenz M D'Errico P Snaidero N Costa Jordão MJ Böttcher C Kierdorf K Novel Hexb-based tools for studying microglia in the CNS Nat Immunol 21 802 815 2020 10.1038/s41590-020-0707-4 32541832 58 Kenkhuis B Somarakis A Kleindouwel LRT Van Roon-Mom WMC Höllt T Van Der Weerd L Co-expression patterns of microglia markers Iba1, TMEM119 and P2RY12 in Alzheimer's disease Neurobiol Dis 167 105684 2022 10.1016/j.nbd.2022.105684 35247551 59 Qin Z He S Yang C Yung JSY Chen C Leung CKS Liu K Qu JY Adaptive optics two-photon microscopy enables near-diffraction-limited and functional retinal imaging in vivo Light Sci Appl 9 79 2020 10.1038/s41377-020-0317-9 32411364 PMC7203252 60 Wu MY Yiang GT Lai TT Li CJ The oxidative stress and mitochondrial dysfunction during the pathogenesis of diabetic retinopathy Oxidative Med Cell Longev 2018 3420187 2018 10.1155/2018/3420187 PMC6145164 30254714 61 Lv K Ying H Hu G Hu J Jian Q Zhang F Integrated multi-omics reveals the activated retinal microglia with intracellular metabolic reprogramming contributes to inflammation in STZ-induced early diabetic retinopathy Front Immunol 13 942768 2022 10.3389/fimmu.2022.942768 36119084 PMC9479211 62 Du XL Edelstein D Rossetti L Fantus IG Goldberg H Ziyadeh F Wu J Brownlee M Hyperglycemia-induced mitochondrial superoxide overproduction activates the hexosamine pathway and induces plasminogen activator inhibitor-1 expression by increasing Sp1 glycosylation Proc Natl Acad Sci USA 97 12222 12226 2000 10.1073/pnas.97.22.12222 11050244 PMC17322 63 Du X Matsumura T Edelstein D Rossetti L Zsengellér Z Szabó C Brownlee M Inhibition of GAPDH activity by poly(ADP-ribose) polymerase activates three major pathways of hyperglycemic damage in endothelial cells J Clin Investig 112 1049 1057 2003 10.1172/JCI18127 14523042 PMC198524 64 Kowluru RA Effect of advanced glycation end products on accelerated apoptosis of retinal capillary cells under in vitro conditions Life Sci 76 1051 1060 2005 10.1016/j.lfs.2004.10.017 15607333 65 Glomb MA Monnier VM Mechanism of protein modification by glyoxal and glycolaldehyde, reactive intermediates of the maillard reaction J Biol Chem 270 10017 10026 1995 10.1074/jbc.270.17.10017 7730303 66 Funatsu H Yamashita H Pathogenesis of diabetic retinopathy and the renin-angiotensin system Ophthalmic Physiol Opt 23 495 501 2003 10.1046/j.1475-1313.2003.00134.x 14622351 67 Cai Y Li W Tu H Chen N Zhong Z Yan P Dong J Curcumolide reduces diabetic retinal vascular leukostasis and leakage partly via inhibition of the p38MAPK/NF-κB signaling Bioorg Med Chem Lett 27 1835 1839 2017 10.1016/j.bmcl.2017.02.045 28274631 68 Stitt AW The role of advanced glycation in the pathogenesis of diabetic retinopathy Exp Mol Pathol 75 95 108 2003 10.1016/S0014-4800(03)00035-2 12834631 69 Yamagishi SI Matsui T Advanced glycation end products (AGEs), oxidative stress and diabetic retinopathy Curr Pharm Biotechnol 12 362 368 2011 10.2174/138920111794480534 20939798 70 Song J Lee JE ASK1 modulates the expression of microRNA Let7A in microglia under high glucose in vitro condition Front Cell Neurosci 9 198 2015 10.3389/fncel.2015.00198 26041997 PMC4438231 71 Du A Xie Y Ouyang H Lu B Jia W Xu H Ji L Si-miao-yong-an decoction for diabetic retinopathy: A combined network pharmacological and in vivo approach Front Pharmacol 12 763163 2021 10.3389/fphar.2021.763163 34899317 PMC8661904 72 Vargas-Soria M García-Alloza M Corraliza-Gómez M Effects of diabetes on microglial physiology: A systematic review of in vitro, preclinical and clinical studies J Neuroinflammation 20 57 2023 10.1186/s12974-023-02740-x 36869375 PMC9983227 73 Quiriconi P Hristov V Aburaya M Greferath U Jobling AI Fletcher EL The role of microglia in the development of diabetic retinopathy NPJ Metab Health Dis 2 7 2024 10.1038/s44324-024-00009-2 40603568 PMC12118658 74 Cai L Xia M Zhang F Redox regulation of immunometabolism in microglia underpinning diabetic retinopathy Antioxidants (Basel) 13 423 2024 10.3390/antiox13040423 38671871 PMC11047590 75 Yamaguchi M Nakao S Arima M Little K Singh A Wada I Kaizu Y Zandi S Garweg JG Matoba T Heterotypic macrophages/microglia differentially contribute to retinal ischaemia and neovascularisation Diabetologia 67 2329 2345 2024 10.1007/s00125-024-06215-3 38977459 76 Wang J Liu X Wei W Yang J Li Q Chu S Liu P Zhang J He W Regulation of oxygen-glucose deprivation/reperfusion-induced inflammatory responses and M1-M2 phenotype switch of BV2 microglia by lobetyolin Metab Brain Dis 38 2627 2644 2023 10.1007/s11011-023-01292-6 37837601 77 Nian S Lo ACY Mi Y Ren K Yang D Neurovascular unit in diabetic retinopathy: Pathophysiological roles and potential therapeutical targets Eye Vis (Lond Engl) 8 15 2021 10.1186/s40662-021-00239-1 PMC8088070 33931128 78 Inada M Xu H Takeuchi M Ito M Chen M Microglia increase tight-junction permeability in coordination with Müller cells under hypoxic condition in an in vitro model of inner blood-retinal barrier Exp Eye Res 205 108490 2021 10.1016/j.exer.2021.108490 33607076 79 Fang M Wan W Li Q Wan W Long Y Liu H Yang X Asiatic acid attenuates diabetic retinopathy through TLR4/MyD88/NF-κB p65 mediated modulation of microglia polarization Life Sci 277 119567 2021 10.1016/j.lfs.2021.119567 33965378 80 Mehrabadi AR Korolainen MA Odero G Miller DW Kauppinen TM Poly(ADP-ribose) polymerase-1 regulates microglia mediated decrease of endothelial tight junction integrity Neurochem Int 108 266 271 2017 10.1016/j.neuint.2017.04.014 28461173 81 Usui-Ouchi A Usui Y Kurihara T Aguilar E Dorrell MI Ideguchi Y Sakimoto S Bravo S Friedlander M Retinal microglia are critical for subretinal neovascular formation JCI Insight 5 e137317 2020 10.1172/jci.insight.137317 32437334 PMC7406258 82 Xie H Zhang C Liu D Yang Q Tang L Wang T Tian H Lu L Xu JY Gao F Erythropoietin protects the inner blood-retinal barrier by inhibiting microglia phagocytosis via Src/Akt/cofilin signalling in experimental diabetic retinopathy Diabetologia 64 211 225 2021 10.1007/s00125-020-05299-x 33104828 83 Zhang T Ouyang H Mei X Lu B Yu Z Chen K Wang Z Ji L Erianin alleviates diabetic retinopathy by reducing retinal inflammation initiated by microglial cells via inhibiting hyperglycemia-mediated ERK1/2-NF-κB signaling pathway FASEB J 33 11776 11790 2019 10.1096/fj.201802614RRR 31365278 PMC6902687 84 Behnke V Wolf A Langmann T The role of lymphocytes and phagocytes in age-related macular degeneration (AMD) Cell Mol Life Sci 77 781 788 2020 10.1007/s00018-019-03419-4 31897541 PMC11104950 85 Ogura S Baldeosingh R Bhutto IA Kambhampati SP McLeod DS Edwards MM Rais R Schubert W Lutty GA A role for mast cells in geographic atrophy FASEB J 34 10117 10131 2020 10.1096/fj.202000807R 32525594 PMC7688488 86 Lueck K Busch M Moss SE Greenwood J Kasper M Lommatzsch A Pauleikhoff D Wasmuth S Complement stimulates retinal pigment epithelial cells to undergo pro-inflammatory changes Ophthalmic Res 54 195 203 2015 10.1159/000439596 26502094 87 Fu X Feng S Qin H Yan L Zheng C Yao K Microglia: The breakthrough to treat neovascularization and repair blood-retinal barrier in retinopathy Front Mol Neurosci 16 1100254 2023 10.3389/fnmol.2023.1100254 36756614 PMC9899825 88 Ding X Gu R Zhang M Ren H Shu Q Xu G Wu H Microglia enhanced the angiogenesis, migration and proliferation of co-cultured RMECs BMC Ophthalmol 18 249 2018 10.1186/s12886-018-0886-z 30223824 PMC6142340 89 Hu A Schmidt MHH Heinig N Microglia in retinal angiogenesis and diabetic retinopathy Angiogenesis 27 311 331 2024 10.1007/s10456-024-09911-1 38564108 PMC11303477 90 Tang L Xu GT Zhang JF Inflammation in diabetic retinopathy: Possible roles in pathogenesis and potential implications for therapy Neural Regen Res 18 976 982 2023 10.4103/1673-5374.355743 36254977 PMC9827774 91 Ogura S Kurata K Hattori Y Takase H Ishiguro-Oonuma T Hwang Y Ahn S Park I Ikeda W Kusuhara S Sustained inflammation after pericyte depletion induces irreversible blood-retina barrier breakdown JCI Insight 2 e90905 2017 10.1172/jci.insight.90905 28194443 PMC5291729 92 He C Liu Y Huang Z Yang Z Zhou T Liu S Hao Z Wang J Feng Q Liu Y A specific RIP3 + Proc Natl Acad Sci USA 118 e2023290118 2021 10.1073/pnas.2023290118 33836603 PMC7980367 93 Connor KM SanGiovanni JP Lofqvist C Aderman CM Chen J Higuchi A Hong S Pravda EA Majchrzak S Carper D Increased dietary intake of omega-3-polyunsaturated fatty acids reduces pathological retinal angiogenesis Nat Med 13 868 873 2007 10.1038/nm1591 17589522 PMC4491412 94 Yin J Xu WQ Ye MX Zhang Y Wang HY Zhang J Li Y Wang YS Up-regulated basigin-2 in microglia induced by hypoxia promotes retinal angiogenesis J Cell Mol Med 21 3467 3480 2017 10.1111/jcmm.13256 28661035 PMC5706566 95 Zhao C Liu Y Meng J Wang X Liu X Li W Zhou Q Xiang J Li N Hou S LGALS3BP in microglia promotes retinal angiogenesis through PI3K/AKT pathway during hypoxia Invest Ophthalmol Vis Sci 63 25 2022 10.1167/iovs.63.8.25 35895036 PMC9344220 96 Murinello S Usui Y Sakimoto S Kitano M Aguilar E Friedlander HM Schricker A Wittgrove C Wakabayashi Y Dorrell MI miR-30a-5p inhibition promotes interaction of Fas+ endothelial cells and FasL + Glia 67 332 344 2019 10.1002/glia.23543 30484883 PMC6349526 97 Luo Q Jiang Z Jiang J Wan L Li Y Huang Y Qiu J Yu K Zhuang J Tsp-1 + Theranostics 13 3689 3706 2023 10.7150/thno.84236 37441592 PMC10334831 98 Hu Y Wei T Gao S Cheng Q Anti-angiogenic and anti-inflammatory effects of CD200-CD200R1 axis in oxygen-induced retinopathy mice model Inflamm Res 68 945 955 2019 10.1007/s00011-019-01276-2 31444514 99 Dejda A Mawambo G Daudelin JF Miloudi K Akla N Patel C Andriessen EMMA Labrecque N Sennlaub F Sapieha P Neuropilin-1-expressing microglia are associated with nascent retinal vasculature yet dispensable for developmental angiogenesis Invest Ophthalmol Vis Sci 57 1530 1536 2016 10.1167/iovs.15-18598 27035626 100 Dejda A Mawambo G Cerani A Miloudi K Shao Z Daudelin JF Boulet S Oubaha M Beaudoin F Akla N Neuropilin-1 mediates myeloid cell chemoattraction and influences retinal neuroimmune crosstalk J Clin Investig 124 4807 4822 2014 10.1172/JCI76492 25271625 PMC4347252 101 Bai Q Wang X Yan H Wen L Zhou Z Ye Y Jing Y Niu Y Wang L Zhang Z Microglia-derived Spp1 promotes pathological retinal neovascularization via activating endothelial Kit/Akt/mTOR signaling J Pers Med 13 146 2023 10.3390/jpm13010146 36675807 PMC9866717 102 Zhou ZY Chang TF Lin ZB Jing YT Wen LS Niu YL Bai Q Guo CM Sun JX Wang YS Dou GR Microglial Galectin3 enhances endothelial metabolism and promotes pathological angiogenesis via notch inhibition by competitively binding to Jag1 Cell Death Dis 14 380 2023 10.1038/s41419-023-05897-8 37369647 PMC10300109 103 Li L Sun B Harris OA Luo J TGF-β signaling in microglia: A key regulator of development, homeostasis and reactivity Biomedicines 12 2468 2024 10.3390/biomedicines12112468 39595034 PMC11592028 104 Wiens KR Wasti N Ulloa OO Klegeris A Diversity of microglia-derived molecules with neurotrophic properties that support neurons in the central nervous system and other tissues Molecules 29 5525 2024 10.3390/molecules29235525 39683685 PMC11643984 105 Liu W Tong B Xiong J Zhu Y Lu H Xu H Yang X Wang F Yu P Hu Y Identification of macrophage polarisation and mitochondria-related biomarkers in diabetic retinopathy J Transl Med 23 23 2025 10.1186/s12967-024-06038-1 39762849 PMC11706200 106 Amankwa CE Acha LG Dibas A Chavala SH Roth S Mathew B Acharya S Neuroprotective and anti-inflammatory activities of hybrid small-molecule SA-10 in ischemia/reperfusion-induced retinal neuronal injury models Cells 13 396 2024 10.3390/cells13050396 38474360 PMC10931063 107 Paisley CE Kay JN Seeing stars: Development and function of retinal astrocytes Dev Biol 478 144 154 2021 10.1016/j.ydbio.2021.07.007 34260962 PMC8542354 108 Chan-Ling T Development of the retinal vasculature Encyclopedia of the eye D'Amore P Academic Press Cambridge 22 33 2010 10.1016/B978-0-12-374203-2.00142-1 109 Gnanaguru G Tabor SJ Bonilla GM Sadreyev R Yuda K Köhl J Connor KM Microglia refine developing retinal astrocytic and vascular networks through the complement C3/C3aR axis Development 150 dev201047 2023 10.1242/dev.201047 36762625 PMC10110418 110 Checchin D Sennlaub F Levavasseur E Leduc M Chemtob S Potential role of microglia in retinal blood vessel formation Invest Ophthalmol Vis Sci 47 3595 3602 2006 10.1167/iovs.05-1522 16877434 111 Wang M Ma W Zhao L Fariss RN Wong WT Adaptive Müller cell responses to microglial activation mediate neuroprotection and coordinate inflammation in the retina J Neuroinflammation 8 173 2011 10.1186/1742-2094-8-173 22152278 PMC3251543 112 Tewari M Michalski S Egan TM Modulation of microglial function by ATP-gated P2X7 receptors: Studies in rat, mice and human Cells 13 161 2024 10.3390/cells13020161 38247852 PMC10814008 113 Kong H Zhao H Chen T Song Y Cui Y Targeted P2X7/NLRP3 signaling pathway against inflammation, apoptosis, and pyroptosis of retinal endothelial cells in diabetic retinopathy Cell Death Dis 13 336 2022 10.1038/s41419-022-04786-w 35410316 PMC9001662 114 Antonetti DA Silva PS Stitt AW Current understanding of the molecular and cellular pathology of diabetic retinopathy Nat Rev Endocrinol 17 195 206 2021 10.1038/s41574-020-00451-4 33469209 PMC9053333 115 Wang X Ye J Liu W GPER-mediated inhibition of astrocyte activation mitigates retinal neovascularization in oxygen-induced retinopathy mice J Army Med Univ 46 1369 1377 2024 116 Kaur C Foulds W Ling E Blood-retinal barrier in hypoxic ischaemic conditions: Basic concepts, clinical features and management Prog Retin Eye Res 27 622 647 2008 10.1016/j.preteyeres.2008.09.003 18940262 117 Puebla M Tapia PJ Espinoza H Key role of astrocytes in postnatal brain and retinal angiogenesis Int J Mol Sci 23 2646 2022 10.3390/ijms23052646 35269788 PMC8910249 118 Navarro HI Daly AE Rodriguez B Wu S Ngo KA Fraser A Schiffman A Liu Y Smale ST Chia JJ Hoffmann A NF-κB RelB suppresses the inflammatory gene expression programs of dendritic cells by competing with RelA for binding to target gene promoters Cell Discov 11 13 2025 10.1038/s41421-024-00767-9 39929805 PMC11811218 119 Acioglu C Elkabes S Innate immune sensors and regulators at the blood brain barrier: Focus on toll-like receptors and inflammasomes as mediators of neuro-immune crosstalk and inflammation J Neuroinflammation 22 39 2025 10.1186/s12974-025-03360-3 39955600 PMC11829548 120 Song Y Dou H Gong W Liu X Yu Z Li E Tan R Hou Y Bis-N-norgliovictin, a small-molecule compound from marine fungus, inhibits LPS-induced inflammation in macrophages and improves survival in sepsis Eur J Pharmacol 705 49 60 2013 10.1016/j.ejphar.2013.02.008 23438875 121 Abcouwer SF Neural inflammation and the microglial response in diabetic retinopathy J Ocul Biol Dis Infor 4 25 33 2012 10.1007/s12177-012-9086-x 23614055 PMC3342409 122 Sun H Ma X Ma H Li S Xia Y Yao L Wang Y Pang X Zhong J Yao G High glucose levels accelerate atherosclerosis via NLRP3-IL/MAPK/NF-κB-related inflammation pathways Biochem Biophys Res Commun 704 149702 2024 10.1016/j.bbrc.2024.149702 38422898 123 He Y Sun MM Zhang GG Yang J Chen KS Xu WW Li B Targeting PI3K/Akt signal transduction for cancer therapy Signal Transduct Target Ther 6 425 2021 10.1038/s41392-021-00828-5 34916492 PMC8677728 124 Chidiac R Zhang Y Tessier S Faubert D Delisle C Gratton JP Comparative phosphoproteomics analysis of VEGF and angiopoietin-1 signaling reveals ZO-1 as a critical regulator of endothelial cell proliferation Mol Cell Proteom 15 1511 1525 2016 10.1074/mcp.M115.053298 PMC4858936 26846344 125 Greene C Hanley N Campbell M Claudin-5: Gatekeeper of neurological function Fluids Barriers CNS 16 3 2019 10.1186/s12987-019-0123-z 30691500 PMC6350359 126 Zhao H Lv Y Xu J Song X Wang Q Zhai X Ma X Qiu J Cui L Sun Y The activation of microglia by the complement system in neurodegenerative diseases Ageing Res Rev 104 102636 2025 10.1016/j.arr.2024.102636 39647582 127 Ricklin D Hajishengallis G Yang K Lambris JD Complement: A key system for immune surveillance and homeostasis Nat Immunol 11 785 797 2010 10.1038/ni.1923 20720586 PMC2924908 128 Ayyubova G Madhu LN Microglial NLRP3 inflammasomes in Alzheimer's disease pathogenesis: From interaction with autophagy/mitophagy to therapeutics Mol Neurobiol 62 7124 7143 2025 10.1007/s12035-025-04758-z 39951189 129 Yanai R Thanos A Connor KM Complement involvement in neovascular ocular diseases Adv Exp Med Biol 946 161 183 2012 10.1007/978-1-4614-0106-3_10 21948368 130 Padmakumar L Menon RN Gopala S Vilanilam GC MTH1 in the disorders of the central nervous system: Scope beyond brain tumors and challenges Acta Neurol Belg Feb 17 2025 Epub ahead of print 10.1007/s13760-025-02747-6 39960601 131 Chung J Jernigan J Menees KB Lee JK RGS10 mitigates high glucose-induced microglial inflammation via the reactive oxidative stress pathway and enhances synuclein clearance in microglia Front Cell Neurosci 18 1374298 2024 10.3389/fncel.2024.1374298 38812790 PMC11133718 132 Homme RP Sandhu HS George AK Tyagi SC Singh M Sustained inhibition of NF-κB activity mitigates retinal vasculopathy in diabetes Am J Pathol 191 947 964 2021 10.1016/j.ajpath.2021.01.016 33640319 PMC8101051 133 Park SS Retinal glia and NF-κB in diabetic retinopathy pathogenesis Ann Transl Med 11 307 2023 10.21037/atm-23-1166 37404990 PMC10316105 134 Chen W Wu Z Cheng Z Zhang Y Luo Q Yin M HO-1 represses NF-κB signaling pathway to mediate microglia polarization and phagocytosis in intracerebral hemorrhage Neuroscience 566 17 27 2025 10.1016/j.neuroscience.2024.12.020 39672459 135 Gonzalez-Cortes JH Martinez-Pacheco VA Gonzalez-Cantu JE Bilgic A de Ribot FM Sudhalkar A Mohamed-Hamsho J Kodjikian L Mathis T Current treatments and innovations in diabetic retinopathy and diabetic macular edema Pharmaceutics 15 122 2022 10.3390/pharmaceutics15010122 36678750 PMC9866607 136 Mounirou BAM Adam ND Yakoura AKH Aminou MSM Liu YT Tan LY Diabetic retinopathy: An overview of treatments Indian J Endocrinol Metab 26 111 118 2022 10.4103/ijem.ijem_480_21 35873941 PMC9302419 137 Arrigo A Aragona E Bandello F VEGF-targeting drugs for the treatment of retinal neovascularization in diabetic retinopathy Ann Med 54 1089 1111 2022 10.1080/07853890.2022.2064541 35451900 PMC9891228 138 Zhang W Geng J Sang A Effectiveness of panretinal photocoagulation plus intravitreal anti-VEGF treatment against PRP alone for diabetic retinopathy: A systematic review with meta-analysis Front Endocrinol (Lausanne) 13 807687 2022 10.3389/fendo.2022.807687 35422768 PMC9004461 139 Shukla UV Tripathy K Diabetic retinopathy StatPearls [Internet] StatPearls Publishing Treasure Island, FL 2025 32809640 140 Vergmann AS Nguyen TT Lee Torp T Kawasaki R Wong TY Peto T Grauslund J Efficacy and side effects of individualized panretinal photocoagulation Ophthalmol Retina 4 642 644 2020 10.1016/j.oret.2020.02.006 32278741 141 Xu W Cheng W Cui X Xu G Therapeutic effect against retinal neovascularization in a mouse model of oxygen-induced retinopathy: Bone marrow-derived mesenchymal stem cells versus Conbercept BMC Ophthalmol 20 7 2020 10.1186/s12886-019-1292-x 31906900 PMC6945477 142 Martinez-Alejo JM Baiza-Duran LM Quintana-Hau JDD Novel therapies for proliferative retinopathies Ther Adv Chronic Dis 13 20406223221140395 2022 10.1177/20406223221140395 36479142 PMC9720790 143 Xu W Hu Z Lv Y Dou G Zhang Z Wang H Wang Y Microglial density determines the appearance of pathological neovascular tufts in oxygen-induced retinopathy Cell Tissue Res 374 25 38 2018 10.1007/s00441-018-2847-5 29767277 144 Qin S Zhang C Qin H Xie H Luo D Qiu Q Liu K Zhang J Xu G Zhang J Hyperreflective foci and subretinal fluid are potential imaging biomarkers to evaluate anti-VEGF effect in diabetic macular edema Front Physiol 12 791442 2021 10.3389/fphys.2021.791442 35002773 PMC8733589 145 Rojo Arias JE Englmaier VE Jászai J VEGF-trap modulates retinal inflammation in the murine oxygen-induced retinopathy (OIR) model Biomedicines 10 201 2022 10.3390/biomedicines10020201 35203414 PMC8869660 146 Palmhof M Lohmann S Schulte D Stute G Wagner N Dick HB Joachim SC Fewer functional deficits and reduced cell death after ranibizumab treatment in a retinal ischemia model Int J Mol Sci 19 1636 2018 10.3390/ijms19061636 29857531 PMC6032266 147 Xu Y Lu X Hu Y Yang B Tsui CK Yu S Lu L Liang X Melatonin attenuated retinal neovascularization and neuroglial dysfunction by inhibition of HIF-1α-VEGF pathway in oxygen-induced retinopathy mice J Pineal Res 64 e12473 2018 10.1111/jpi.12473 29411894 148 Wang JH Lin FL Chen J Zhu L Chuang YF Tu L Ma C Ling D Hewitt AW Tseng CL TAK1 blockade as a therapy for retinal neovascularization Pharmacol Res 187 106617 2023 10.1016/j.phrs.2022.106617 36535572 149 Church KA Rodriguez D Mendiola AS Vanegas D Gutierrez IL Tamayo I Amadu A Velazquez P Cardona SM Gyoneva S Pharmacological depletion of microglia alleviates neuronal and vascular damage in the diabetic CX3CR1-WT retina but not in CX3CR1-KO or hCX3CR 1I249/M280 Front Immunol 14 1130735 2023 10.3389/fimmu.2023.1130735 37033925 PMC10077890 150 Church KA Rodriguez D Vanegas D Gutierrez IL Cardona SM Madrigal JLM Kaur T Cardona AE Models of microglia depletion and replenishment elicit protective effects to alleviate vascular and neuronal damage in the diabetic murine retina J Neuroinflammation 19 300 2022 10.1186/s12974-022-02659-9 36517889 PMC9753268 151 Zhao F Gao X Ge X Cui J Liu X Cyanidin-3-o-glucoside (C3G) inhibits vascular leakage regulated by microglial activation in early diabetic retinopathy and neovascularization in advanced diabetic retinopathy Bioengineered 12 9266 9278 2021 10.1080/21655979.2021.1996512 34699316 PMC8810139 152 Yang B Xu Y Yu S Huang Y Lu L Liang X Anti-angiogenic and anti-inflammatory effect of Magnolol in the oxygen-induced retinopathy model Inflamm Res 65 81 93 2016 10.1007/s00011-015-0894-x 26547789 153 Tang X Cui K Lu X Wu P Yu S Yang B Xu Y Liang X A novel hypoxia-inducible factor 1α inhibitor KC7F2 attenuates oxygen-induced retinal neovascularization Invest Ophthalmol Vis Sci 63 13 2022 10.1167/iovs.63.6.13 PMC9202333 35695808 154 Song GJ Suk K Pharmacological modulation of functional phenotypes of microglia in neurodegenerative diseases Front Aging Neurosci 9 139 2017 10.3389/fnagi.2017.00139 28555105 PMC5430023 155 Sun X Ma L Li X Wang J Li Y Huang Z Ferulic acid alleviates retinal neovascularization by modulating microglia/macrophage polarization through the ROS/NF-κB axis Front Immunol 13 976729 2022 10.3389/fimmu.2022.976729 36119027 PMC9478033 156 Wang Y Chang T Wu T Xu W Dou G Wang Y Guo C M2 macrophages promote vasculogenesis during retinal neovascularization by regulating bone marrow-derived cells via SDF-1/VEGF Cell Tissue Res 380 469 486 2020 10.1007/s00441-019-03166-9 31989253 157 Zhou Y Yoshida S Nakao S Yoshimura T Kobayashi Y Nakama T Kubo Y Miyawaki K Yamaguchi M Ishikawa K M2 macrophages enhance pathological neovascularization in the mouse model of oxygen-induced retinopathy Invest Ophthalmol Vis Sci 56 4767 4777 2015 10.1167/iovs.14-16012 26218904 158 Caldwell RW Rodriguez PC Toque HA Narayanan SP Caldwell RB Arginase: A multifaceted enzyme important in health and disease Physiol Rev 98 641 665 2018 10.1152/physrev.00037.2016 29412048 PMC5966718 159 Monticelli LA Buck MD Flamar AL Saenz SA Tait Wojno ED Yudanin NA Osborne LC Hepworth MR Tran SV Rodewald HR Arginase 1 is an innate lymphoid-cell-intrinsic metabolic checkpoint controlling type 2 inflammation Nat Immunol 17 656 665 2016 10.1038/ni.3421 27043409 PMC4873382 160 Chen T Huang X Zhao YX Zhou ZW Zhou WS NEAT1 inhibits the angiogenic activity of cerebral arterial endothelial cells by inducing the M1 polarization of microglia through the AMPK signaling pathway Cell Mol Biol Lett 29 62 2024 10.1186/s11658-024-00579-5 38684954 PMC11059773 161 Niu G Chen X Vascular endothelial growth factor as an anti-angiogenic target for cancer therapy Curr Drug Targets 11 1000 1017 2010 10.2174/138945010791591395 20426765 PMC3617502 162 Cho H Kambhampati SP Lai MJ Zhou L Lee G Xie Y Hui Q Kannan RM Duh EJ Dendrimer-triamcinolone acetonide reduces neuroinflammation, pathological angiogenesis, and neuroretinal dysfunction in ischemic retinopathy Adv Ther (Weinh) 4 2000181 2021 10.1002/adtp.202000181 34527806 PMC8436818 163 Fan W Huang W Chen J Li N Mao L Hou S Retinal microglia: Functions and diseases Immunology 166 268 286 2022 10.1111/imm.13479 35403700 164 Wang S Zhang J Chen J Tang L Ke M Xue Y He Y Gong Y Li Z ω-3PUFAs inhibit hypoxia-induced retinal neovascularization via regulating microglial pyroptosis through METTL14-mediated m6A modification of IFNB1 mRNA Appl Biochem Biotechnol 196 5936 5952 2024 10.1007/s12010-023-04795-1 38175416 165 Mei X Zhou L Zhang T Lu B Sheng Y Ji L Chlorogenic acid attenuates diabetic retinopathy by reducing VEGF expression and inhibiting VEGF-mediated retinal neoangiogenesis Vasc Pharmacol 101 29 37 2018 10.1016/j.vph.2017.11.002 29146180 166 Yu Z Zhang T Gong C Sheng Y Lu B Zhou L Ji L Wang Z Erianin inhibits high glucose-induced retinal angiogenesis via blocking ERK1/2-regulated HIF-1α-VEGF/VEGFR2 signaling pathway Sci Rep 6 34306 2016 10.1038/srep34306 27678303 PMC5039671 167 Zhao K Jiang Y Zhang J Shi J Zheng P Yang C Chen Y Celastrol inhibits pathologic neovascularization in oxygen-induced retinopathy by targeting the miR-17-5p/HIF-1α/VEGF pathway Cell Cycle 21 2091 2108 2022 10.1080/15384101.2022.2087277 35695424 PMC9467611 168 Guo L Choi S Bikkannavar P Cordeiro MF Microglia: Key players in retinal ageing and neurodegeneration Front Cell Neurosci 16 804782 2022 10.3389/fncel.2022.804782 35370560 PMC8968040 169 Shao F Wang X Wu H Wu Q Zhang J Microglia and neuroinflammation: Crucial pathological mechanisms in traumatic brain injury-induced neurodegeneration Front Aging Neurosci 14 825086 2022 10.3389/fnagi.2022.825086 35401152 PMC8990307 170 Gao C Jiang J Tan Y Chen S Microglia in neurodegenerative diseases: Mechanism and potential therapeutic targets Signal Transduct Target Ther 8 359 2023 10.1038/s41392-023-01588-0 37735487 PMC10514343 171 Yang I Han SJ Kaur G Crane C Parsa AT The role of microglia in central nervous system immunity and glioma immunology J Clin Neurosci 17 6 10 2010 10.1016/j.jocn.2009.05.006 19926287 PMC3786731 172 Masuda T Sankowski R Staszewski O Prinz M Microglia heterogeneity in the single-cell era Cell Rep 30 1271 1281 2020 10.1016/j.celrep.2020.01.010 32023447 173 Jiao W Ji J Li F Guo J Zheng Y Li S Xu W Activation of the Notch-Nox4-reactive oxygen species signaling pathway induces cell death in high glucose-treated human retinal endothelial cells Mol Med Rep 19 667 677 2019 30431086 10.3892/mmr.2018.9637 174 Seo H Park SJ Song M Diabetic retinopathy (DR): Mechanisms, current therapies, and emerging strategies Cells 14 376 2025 10.3390/cells14050376 40072104 PMC11898816 175 Radwan SES El-Kamel A Zaki EI Burgalassi S Zucchetti E El-Moslemany RM Hyaluronic-coated albumin nanoparticles for the non-invasive delivery of apatinib in diabetic retinopathy Int J Nanomedicine 16 4481 4494 2021 10.2147/IJN.S316564 34239300 PMC8259843 176 Wang S Yang H Zheng J Tong A Mu S Wang D Zhao M Li J Recent advances and prospects of nanoparticle-based drug delivery for diabetic ocular complications Theranostics 15 3551 3570 2025 10.7150/thno.108691 40093887 PMC11905120 Figure 1 Mechanisms of vascular and neuronal modulation of retinal microglia in DR. Under physiological conditions, M2 polarization dominates, releasing anti-inflammatory and neurotrophic factors such as IL-4, IL-10, TGF-β and BDNF. Microglia maintain retinal homeostasis via phagocytosis of metabolic waste, cell migration and interactions with Müller and astrocytes, preserving the BRB. In pathological states, M1 polarization prevails, producing pro-inflammatory and angiogenic factors, including IL-1β, IL-6, TNF-α, VEGF-A and IGF-1. These factors disrupt the BRB, causing BRB leakage and RNV. The imbalance between M1 and M2 polarization also disrupts cellular interactions, retinal homeostasis and the neurovascular-immune network, ultimately damaging the NVU. DR, diabetic retinopathy; BDNF, brain-derived neurotrophic factor; BRB, blood-retinal barrier; RNV, retinal neovascularization; IGF-1, insulin-like growth factor 1; NVU, neurovascular unit. Figure 2 Composition of neurovascular unit. The neurovascular unit comprises endothelial cells, pericytes, basement membrane, tight junctions, microglia, Müller cells and ganglion cells, which together maintain retinal homeostasis. Endothelial cells line blood vessels and form tight junctions regulating substance exchange. Pericytes embedded in the basement membrane support vascular stability. Microglia serve as resident immune cells, while Müller cells provide metabolic and structural support to neurons. Ganglion cells transmit visual information. Collectively, these components regulate the blood-retinal barrier, blood flow and support neuronal function. Figure 3 Effects of hyperglycaemic microenvironment on the activation of microglia. Diabetes leads to elevated blood glucose levels, which activate several metabolic pathways: the polyol pathway, hexosamine pathway, PKC-β/δ pathway, AGE accumulation and ANG-II signalling. These pathways converge to activate NF-κB and increase ROS production. The interplay between NF-κB and ROS creates a positive feedback loop, further amplifying the inflammatory response. This results in the release of pro-inflammatory cytokines such as IL-6, TNF-α and IL-1β, ultimately promoting M1 polarization of immune cells and impairing M2 polarization. AGE, advanced glycation end products; ANG-II, angiotensin II; ROS, reactive oxygen species. Figure 4 Signalling pathways and cellular interactions mediated by microglia in DR. In DR, microglia express receptors such as C3a and C5a receptors, VEGFR and TLR4. The activation of these receptors triggers intracellular signalling pathways which subsequently activate downstream kinases. These signalling cascades lead to the activation of transcription factors such as NF-κB, resulting in the production and release of pro-inflammatory cytokines including IL-1β, TNF-α and IL-6. The released pro-inflammatory cytokines then act on Müller cells, promoting the release of VEGF. This process highlights the role of microglia in mediating inflammatory responses and angiogenesis in DR through these signalling pathways. DR, diabetic retinopathy; TLR-4, Toll-like receptor 4; MyD88, myeloid differentiation primary response 88; IRAK-4, interleukin-1 receptor-associated kinase 4; TRAF6, TNF receptor-associated factor 6; IKK, IκB kinase. ",
  "metadata": {
    "Title of this paper": "Recent advances and prospects of nanoparticle-based drug delivery for diabetic ocular complications",
    "Journal it was published in:": "International Journal of Molecular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488210/"
  }
}