{
  "title": "Paper_1115",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468451 PMC12468451.1 12468451 12468451 41020896 10.3390/cimb47090774 cimb-47-00774 1 Article Metabolome and Transcriptome Analyses of the Molecular Mechanism Underlying Light-Induced Anthocyanin Accumulation in Pepper ( Capsicum annuum He Qinqin Conceptualization Validation Data curation Writing – original draft Visualization Supervision Project administration 1 He Liming Conceptualization Methodology Formal analysis Investigation Writing – original draft 1 Feng Zongqin Formal analysis Writing – original draft Visualization 1 Xiao Yunyi Formal analysis Visualization Project administration 1 Qiu Qiucheng Validation Investigation Resources Writing – original draft 2 Liu Jiefeng Methodology Software Investigation Data curation Writing – review & editing Funding acquisition 1 Han Hanbing Methodology Formal analysis Writing – review & editing Supervision Project administration Funding acquisition 1 https://orcid.org/0000-0001-5057-8749 Huang Xinmin Conceptualization Software Data curation Writing – review & editing Project administration Funding acquisition 1 * Nicolae Alina Crenguta Academic Editor 1 xiaohe1507@126.com heliming7799@163.com zongqinfeng@163.com xyunyi@126.com gdmmljf@126.com hhb05@126.com 2 mszyqqc@126.com * hxmscau@163.com 18 9 2025 9 2025 47 9 497442 774 21 8 2025 12 9 2025 17 9 2025 18 09 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Under light exposure, certain pepper cultivars synthesize large amounts of anthocyanins in their pericarps, with the illuminated areas exhibiting black coloration. However, research on light-induced anthocyanin formation in pepper fruit, particularly the related metabolites and genetic changes, remains limited. To identify the key genes involved in localized anthocyanin synthesis under light conditions, we investigated the black pericarps (light-exposed) and green pericarps of pepper variety MSCJ1 under illumination. Metabolomics analysis identified 579 metabolites in the black and green pepper pericarps, with 50 differentially accumulated metabolites. Petunidin-3-(6″- p p- Capana09g002200 Capna09g002190 Capana06g000273 Capana05g002274 Capana02g002586 MSTRG.15987 Capana02g002763 Capana01g000365 Capana03g000135 Capana02g002285 Capana09g001426 Capana09g001427 Capana05g000086 Capana07g002142 pepper anthocyanin biosynthesis light metabolic network transcription factor Guangdong Basic and Applied Basic Research Foundation 2022A1515010647 Maoming Science and Technology Plan Project 2019S001006 2022S033 The Special Projects in Key Areas of Rural Revitalization in Universities of Guangdong Provincial Department of Education 2020ZDZX1056 This study was funded by the Guangdong Basic and Applied Basic Research Foundation (2022A1515010647), the Maoming Science and Technology Plan Project (2019S001006 and 2022S033), and The Special Projects in Key Areas of Rural Revitalization in Universities of Guangdong Provincial Department of Education (2020ZDZX1056). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Pepper ( Capsicum annuum 1 2 3 4 5 6 7 8 9 10 11 12 Fruit color is an important characteristic of pepper because the pigments that form the color are related to the nutrition and flavor of chili peppers and confer special health benefits, such as beneficial antioxidant effects and cancer prevention activity [ 3 13 14 15 16 17 15 18 Anthocyanins are a class of water-soluble natural pigments widely present in plants, and they are also flavonoid compounds, which mainly include six categories: cyanidin, pelargonidin, peonidin, delphinidin, petunidin, and malvidin [ 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 Anthocyanins are synthesized in the cytoplasm of plant cells, starting from the phenylalanine metabolic pathway, and catalyzed by phenylalanine ammonia lyase (PAL), cinnamic acid hydroxylase (C4H), and coumarin CoA ligase (4CL) to form p- 36 37 38 39 With the increasing demand of consumers for chili peppers rich in anthocyanins, breeding purple chili varieties has become one of the main directions for chili variety breeding. In addition, studying the regulation mechanism of anthocyanin synthesis in chili peppers is the basis for breeding new varieties. The anthocyanins in the fruits of the chili varieties Árbol and Uvilla are mainly composed of the glycoside delphinidin, and the highest content is observed at 20 days after flowering. The anthocyanin content in the purple-skinned Uvilla variety is higher than that in Árbol. The expression levels of the F3′5′H DFR UFGT GST 40 PAL C4H CHI DFR ANS UFGT 35 F3′H F3′5′H CaANT1 CaANT2 CaAN1 CaTTG1 34 CHS DFR CHI EGL1 MATE WRKY44 41 42 Although progress has been made in identifying the key genes related to anthocyanin composition and synthesis in purple or black peppers, most studies have focused on different color varieties or different developmental stages. Moreover, research on the metabolites and genetic changes of light-induced anthocyanin formation in pepper fruit is relatively limited. Therefore, we used the MSCJ1 variety as the material because it accumulates anthocyanins when exposed to natural sunlight, resulting in a black color, while the shaded area remains green. By identifying and analyzing the metabolic change landscape and potential metabolic regulatory network between black and green fruit peels through metabolomics and transcriptome analysis, this study can deepen our understanding of the regulatory mechanism underlying light-induced changes in anthocyanin biosynthesis in pepper. Moreover, the findings may provide new target genes or screening markers for the breeding of new varieties of high-anthocyanin pepper. 2. Materials and Methods 2.1. Plant Materials The pepper variety MSCJ1 was obtained from Maoming Maoshu Seed Industry Technology Co., Ltd. (Maoming, China), and planted in the experimental field of Guangdong University of Petrochemical Technology under conventional cultivation management. Black (B) and green (G) parts of the pepper peel were collected 20 days after flowering, and 30 fruits were mixed into one sample. The samples were then frozen with liquid nitrogen and stored in an ultra-low temperature refrigerator until required for metabolomics, transcriptome, and qPCR analyses. Three biological replicates were performed per sample. 2.2. Metabolite Detection and Analysis Vacuum freeze-drying was performed on the pepper samples, followed by grinding. Subsequently, 100 mg of the powdered sample was weighed, and metabolites were extracted using 1.0 mL of 70% methanol containing 0.1 mg/L lidocaine as an internal standard at 4 °C for 16 h. The sample was vortexed every 4 h for more thorough extraction. The extraction solution was centrifuged at 10,000× g p T 43 2.3. RNA Sequencing Total RNA was extracted from pepper fruits using the TRIzol reagent kit (Invitrogen, Carlsbad, CA, USA), and evaluated by agarose gel electrophoresis, Agilent 2100 bioanalyzer (Agilent Technologies, Palo Alto, CA, USA), and Qubit2.0 Fluorometer (Invitrogen, Carlsbad, CA, USA) for RNA integrity, purity, and concentration, respectively. Qualified samples were subjected to a Ribo-Zero TM 44 2.4. Differentially Expressed Gene Screening and Enrichment Analysis Fragments per kilobase of transcript per million mapped reads method was used to calculate gene expression levels. OmicSmart ( https://www.omicsmart.com/ 45 46 47 48 p 49 2.5. Association Analysis of Key Metabolites and Genes Involved in Anthocyanin Synthesis The regulatory mechanism of anthocyanin synthesis in chili can be better clarified by conducting correlation analyses on metabolites and genes that regulate anthocyanin synthesis. Differential metabolites, key enzyme genes, and transcription factors in the anthocyanin synthesis pathways were screened based on KEGG pathway analyses, and the correlation between them was assessed using Pearson correlation coefficients. Heatmaps and correlation analyses were performed using OmicSmart ( https://www.omicsmart.com/ 45 2.6. Quantitative Reverse Transcription PCR (qRT-PCR) Twelve DEGs were randomly selected, and specific qRT-PCR primers were designed based on genomic data ( Supplementary Table S1 CaActin −ΔΔCT 50 3. Results 3.1. Global Metabolic Characteristics of Different-Colored Pepper Peels When the chili variety MSCJ1 is planted in the field, the area of the fruit exposed to light accumulates a large amount of anthocyanins and appears black, while the backlit surface shows no anthocyanin accumulation and appears green ( Figure 1 Figure S1 Figure S2a Figure S2b Figure 1 Figure 1 Supplementary Table S2 3.2. DAMs Between Two Different-Colored Pepper Peels OPLS-DA was used to perform multivariate statistical analyses on the metabolites of the two different colors of pepper skin and establish a model. The results showed that the R2Y of the obtained model was 0.999 and Q2Y was 0.98, indicating the sufficient capture of metabolite grouping information and excellent predictive ability of the model ( Figure S3a Figure S3b Figure 2 Supplementary Table S3 Figure 2 Figure 2 -O- p- -O- p- p- p- Figure 2 3.3. Analysis of Differentially Expressed Genes Between the Two Different-Colored Pepper Fruit Peels A total of 43.32 GB of raw data were obtained from six samples of fruit peels with two different colors. After filtering, the HQ clean data ratio of each sample was above 98.17%, and the Q30 of all samples was above 92.40%, indicating high sequencing quality ( Supplementary Table S4 Supplementary Table S4 Figure 3 Figure 3 Supplementary Table S5 3.4. Functional Analysis of DEGs of Two Different-Colored Peppers Fruit Peels A total of 44 DEGs were enriched in 46 pathways, including metabolic pathways (ko01100, 23 DEGs), biosynthesis of secondary metabolites (ko01110, 22 DEGs), flavonoid biosynthesis (ko00941, 6 DEGs), phenylpropanoid biosynthesis (ko00940, 5 DEGs), and MAPK signaling pathway plant (ko04016, 5 DEGs). Among these pathways, flavonoid biosynthesis (ko00941), biosynthesis of secondary metabolites (ko01110), biosynthesis of unsaturated fatty acids (ko01040), and fatty acid metabolism (ko01212) were significantly enriched ( Figure 4 Figure 4 Figure 4 3.5. Transcriptome and Metabolome Correlation Analysis in Anthocyanin Biosynthesis Process Metabolome analysis revealed that flavonoids were differentially up-accumulated in black pepper peel and included three anthocyanins. Transcriptome analysis also found that DEGs were significantly enriched in “flavonoid biosynthesis,” indicating that the observed metabolites and DEGs were key factors affecting the biosynthesis of anthocyanin in pepper peel. Accordingly, we constructed a biosynthetic regulatory pathway for flavonoids and anthocyanins in pepper peel. In phenylpropanoid biosynthesis, two PAL genes ( Capana09g002200 Capana09g002190 Capana06g000273 Capana05g002274 Capana02g002586 MSTRG.15987 Capana02g002763 Capana01g000365 -O- p- Lmpp003789 -O- p- Lmpp003662 p- Lmpp003815 p- Zmmp003591 Capana03g000135 apana02g002285 Figure 5 3.6. Correlation Analysis of Transcription Factors Related to Anthocyanin Synthesis with Differentially Accumulated Metabolites and Differentially Expressed Genes The synthesis of secondary metabolites in plants is precisely regulated by transcription factors. Four transcription factors, including bHLH ( Capana09g001426, Capana09g001427 Capana07g002142 Capana05g000086 Figure 6 To further investigate their potential regulatory roles in anthocyanin synthesis in pepper peel, a correlation analysis was conducted between these transcription factors and six DAMs involved in anthocyanin synthesis pathways. The results revealed that bHLH ( Capana09g001426, Capana09g001427 Capana05g000086 Figure 7 Capana07g002142 pme2960 -O- p- Lmpp003789 p- Lmpp003815 p- Zmmp003591 Figure 7 Further analysis of the correlations between the four transcription factors and key enzyme genes differentially expressed in the anthocyanin synthesis pathway revealed that bHLH ( Capana09g001426, Capana09g001427 Capana05g000086 Figure 7 Capana07g002142 MSTRG.15987 Figure 7 3.7. qRT-PCR To further verify the accuracy and reproducibility of the transcriptome sequencing results, 12 DEGs were selected for qRT-PCR validation, including GT1 ( Capana03g000135 Capana09g001426 Capana02g002763 Capana02g002285 Figure 8 4. Discussion Damage to plant cells caused by strong light and ultraviolet radiation is reduced by increasing the content of anthocyanins in plant tissues, thereby protecting plant growth [ 25 29 30 31 32 33 51 52 53 Vaccinium corymbosm 54 55 Vaccinium myrtillus 56 57 With the widespread application of metabolomics, the material basis of anthocyanin synthesis in different-colored peppers has been comprehensively studied [ 35 43 -O- -O-p- -O- -O- -O-p- -O- 58 -O- -O- -O- 59 -O- p- -O- p- p- p- 60 p- p- p- p- p- Anthocyanin synthesis involves pathways, such as phenylalanine metabolism, flavonoid biosynthesis, and anthocyanin synthesis. PAL is the rate-limiting enzyme in the phenylpropanoid pathway for anthocyanin synthesis. PAL gene expression and PAL enzyme activity are significantly positively correlated with anthocyanin synthesis [ 61 62 63 64 Capana09g002200 Capna09g002190 Capana06g000273 The flavonoid pathway can form anthocyanin substrates, and based on this synthesis pathway, anthocyanin synthesis genes can be divided into two categories: early structural genes ( CHS CHI F3H F3′H F3′5′H DFR ANS UFGT 60 65 BpCHS2 Broussonetia papyrifera BpCHS2 Nicotiana tabacum 66 Vitis davidii CHI F3H F3′5′H DFR4 LDOX 67 VcF3H2 Malus domestica Vaccinium 68 FtF3 H1 DFR ANS FLS 69 OsF3 H OsDFR OsLDOX 70 PAL, C4H, CHS, CHI, DFR, ANS, UGT, C. annuum 34 35 41 Capana05g002274 Capana02g002586 MSTRG.15987 Capana02g002763 Capana01g000365 Capana03g000135 C. annuum The synthesized anthocyanins in the cytoplasm are unstable and prone to degradation. Plants typically transport anthocyanins to vacuoles for storage [ 71 72 73 74 75 Gossypium hirsutum GhGSTF1 GhGSTF2 GhGSTF1 GhGSTF2 Arabidopsis 76 Rosa chinensis RcGSTF2 RcGSTF1 RcGSTF1 RcGSTF2 77 GSTF Capana02g002285 The genes involved in plant anthocyanin synthesis are precisely regulated by transcription factors, including MYB, bHLH, WD40, MAD, and WRKY, which are involved in the regulation of anthocyanin biosynthesis [ 65 FabHLH110 Fragaria × ananassa FabHLH10 78 Malus halliana MhCHI MhF3 H 79 Arabidopsis 80 81 Capana09g001426 Capana09g001427 Capana05g000086 Capana07g002142 However, this study only investigated the effects of light on metabolite and gene expression in pepper fruit as well as the anthocyanin metabolism pathways and key transcription factors. Moreover, how these transcription factors regulate the expression of key enzyme genes remains unclear. Further research will be conducted on the specific functions of these key enzyme genes and transcription factors to provide a deeper understanding of the regulatory mechanisms of anthocyanin biosynthesis and promote the breeding of new varieties of peppers rich in anthocyanins. 5. Conclusions In this study, 579 metabolites were identified from the skin of black and green peppers, of which 50 were differentially accumulated. Key anthocyanin pathway DAMs included naringenin, naringenin chalcone, cyanidin-3 -O- p- -O- p- p- p- p- p- Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/cimb47090774/s1 Author Contributions Conceptualization, X.H., Q.H. and L.H.; methodology, H.H., J.L. and L.H.; software, J.L. and X.H.; validation, Q.H. and Q.Q.; formal analysis, Y.X., Z.F., L.H. and H.H.; investigation, L.H., J.L. and Q.Q.; resources, Q.Q.; data curation, Q.H., J.L. and X.H.; writing—original draft preparation, Q.H., L.H., Z.F. and Q.Q.; writing—review and editing, X.H., J.L. and H.H.; visualization, Q.H., Z.F. and Y.X.; supervision, H.H. and Q.H.; project administration, X.H., Y.X., H.H. and Q.H.; funding acquisition, X.H., J.L. and H.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The raw sequence data reported in this paper have been deposited in the China National Center for Bioinformation ( https://ngdc.cncb.ac.cn/gsa Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript VIP variable importance in projection QC quality control ROS reactive oxygen species PAL Phenylalanine ammonia lyase C4H cinnamic acid hydroxylase 4CL coumarin CoA ligase CHS chalcone synthase CHI chalcone isomerase F3H flavonoid 3-hydroxylase, F3′H flavonoid 3′-hydroxylase F3,5′H flavonoid 3′-hydroxylase DFR dihydroflavonol 4-reductase ANS anthocyanin synthase UGT (GT1) UDP glucosyltransferase GSTF glutathione S-transferase TIC total ion chromatogram GSEA gene set enrichment analysis OPLS-DA Orthogonal partial least squares—discriminant analysis PCA PCA References 1. Gu L.B. Pang H.L. Lu K.K. Liu H.M. Wang X.D. Qin G.Y. Process optimization and characterization of fragrant oil from red pepper ( Capsicum annuum J. Sci. Food Agric. 2017 97 1894 1903 10.1002/jsfa.7992 27528006 2. Rahmani F. Kouki H. Hamdi M. Bouazizi S. Khammassi M.A. Zernadji W. Bulka S. Gryczka U. Hmaied F. Implementation of low energy e-beam for dried vegetable treatment: Effect on microbial and physicochemical qualities of dried red chili pepper ( Capsicum annuum Innov. Food Sci. Emerg. 2025 101 103954 10.1016/j.ifset.2025.103954 3. Batiha G.E. Alqahtani A. Ojo O.A. Shaheen H.M. Wasef L. Elzeiny M. Ismail M. Shalaby M. Murata T. Zaragoza-Bastida A. Biological properties, bioactive constituents, and pharmacokinetics of some Capsicum Int. J. Mol. Sci. 2020 21 5179 10.3390/ijms21155179 32707790 PMC7432674 4. Huei C.S. Azlan A. Ismail A. Shafie N.H. Sultana S. Antioxidant and anti-obesity properties of local chilies varieties in Malaysia J. Food Sci. Technol. 2020 10 3677 3687 10.1007/s13197-020-04400-x PMC7447724 32903949 5. Wu D. Duan R. Tang L. Zhou D. Zeng Z. Wu W. Hu J. Sun Q. In-vitro binding analysis and inhibitory effect of capsaicin on lipase LWT 2022 154 112674 10.1016/j.lwt.2021.112674 6. Sanatombi K. Antioxidant potential and factors influencing the content of antioxidant compounds of pepper: A review with current knowledge Compr. Rev. Food Sci. Food Saf. 2023 22 3011 3052 10.1111/1541-4337.13170 37184378 7. Chen M. Xiao C. Jiang W. Yang W. Qin Q. Tan Q. Lian B. Liang Z. Wei C. Capsaicin inhibits proliferation and induces apoptosis in breast cancer by down-regulating FBI-1-mediated NF-κB pathway Drug. Des. Dev. Ther. 2021 15 125 140 10.2147/DDDT.S269901 33469265 PMC7811378 8. Que T. Ren B. Fan Y. Liu T. Hou T. Dan W. Liu B. Wei Y. Lei Y. Zeng J. Capsaicin inhibits the migration, invasion and EMT of renal cancer cells by inducing AMPK/mTOR-mediated autophagy Chem. Biol. Interact 2022 366 110043 10.1016/j.cbi.2022.110043 36044967 9. Brudzyńska P. Sionkowska A. Grisel M. Plant-derived colorants for food, cosmetic and textile industries: A review Materials 2021 14 3484 10.3390/ma14133484 34201459 PMC8269454 10. Mate D. Ramlunalanaglu K. Pimple B. Vadge S. Kuchekar M. Nipate S. Tare M. Baheti D. Comparative evaluation of lipsticks developed using isolated pigments of Capsicum annuum Lycopersicon esculentum Int. J. Exp. Res. Rev. 2023 30 352 358 10.52756/ijerr.2023.v30.032 11. Guo Y. Bai J. Duan X. Wang J. Accumulation characteristics of carotenoids and adaptive fruit color variation in ornamental pepper Sci. Hortic. 2021 275 109699 10.1016/j.scienta.2020.109699 12. Wang J. Duan X. An Y. He J. Li J. Xian J. Zhou D. An Analysis of capsaicin, dihydrocapsaicin, Vitamin C and flavones in different tissues during the development of ornamental pepper Plants 2024 13 2038 10.3390/plants13152038 39124156 PMC11313734 13. Liu Y. Lv J. Liu Z. Wang J. Yang B. Chen W. Ou L. Dai X. Zhang Z. Zou X. Integrative analysis of metabolome and transcriptome reveals the mechanism of color formation in pepper fruit ( Capsicum annuum Food Chem. 2020 306 125629 10.1016/j.foodchem.2019.125629 31629298 14. Wang L. Zhong Y. Liu J. Ma R. Miao Y. Chen W. Zheng J. Pang X. Wan H. Pigment biosynthesis and molecular genetics of fruit color in pepper Plants 2023 12 2156 10.3390/plants12112156 37299134 PMC10255413 15. Choi M.H. Kim M.H. Han Y.S. Physicochemical properties and antioxidant activity of colored peppers ( Capsicum annuum Food Sci. Biotech. 2023 32 209 219 10.1007/s10068-022-01177-x PMC9839908 36647520 16. Gómez-García M.D.R. Ochoa-Alejo N. Biochemistry and molecular biology of carotenoid biosynthesis in Chili peppers ( Capsicum Int. J. Mol. Sci. 2013 14 19025 19053 10.3390/ijms140919025 24065101 PMC3794819 17. Sun T. Xu Z. Wu C.T. Janes M. Prinyawiwatkul W. No H.K. Antioxidant activities of different colored sweet bell peppers ( Capsicum annuum J. Food Sci. 2007 72 S98 S102 10.1111/j.1750-3841.2006.00245.x 17995862 18. Shifriss C. Pilovsky M. Studies of the inheritance of mature fruit color in Capsicum annuum Euphytica 1992 60 Euphytica 1992 60 123 126 10.1007/BF00029667 19. Kayesh E. Shangguan L. Korir N.K. Sun X. Bilkish N. Zhang Y. Han J. Song C. Cheng Z. Fang J. Fruit skin color and the role of anthocyanin Acta Physiol. Plantar. 2013 35 2879 2890 10.1007/s11738-013-1332-8 20. Passeri V. Koes R. Quattrocchio F.M. New challenges for the design of high value plant products: Stabilization of anthocyanins in plant vacuoles Front. Plant Sci. 2016 7 153 10.3389/fpls.2016.00153 26909096 PMC4754442 21. Saito N. Harborne J.B. Correlations between anthocyanin type, pollinator and flower colour in the Labiatae Phytochemistry 1992 31 3009 3015 10.1016/0031-9422(92)83437-4 22. Narbona E. del Valle J.C. Arista M. Buide M.L. Ortiz P.L. Major flower pigments originate different colour signals to pollinators Front. Ecol. Evol. 2021 9 743850 10.3389/fevo.2021.743850 23. Nevo O. Valenta K. Razafimandimby D. Melin A.D. Ayasse M. Chapman C.A. Frugivores and the evolution of fruit colour Biol. Lett. 2018 14 20180377 10.1098/rsbl.2018.0377 30258028 PMC6170762 24. Martin-Eberhardt S.A. Weber M.G. Gilbert K.J. Anthocyanin impacts multiple plant-insect interactions in a carnivorous plant Amer. Natural. 2025 205 502 515 10.1086/735010 40258286 25. Cirillo V. D’Amelia V. Esposito M. Amitrano C. Carillo P. Carputo D. Maggio A. Anthocyanins are key regulators of drought stress tolerance in tobacco Biology 2021 10 139 10.3390/biology10020139 33578910 PMC7916658 26. Buitrago S. Yang X. Wang L. Pan R. Zhang W. Evolutionary analysis of anthocyanin biosynthetic genes: Insights into abiotic stress adaptation Plant Mol. Biol. 2025 115 6 10.1007/s11103-024-01540-y 39680184 27. Ma M. Li R. Li Y. Dai W. Shang J. He Y. Xiang F. Yang Y. Wang J. Huang Z. Anthocyanin biosynthesis and transport synergistically modulated by RcMYB75 and RcGSTFL11 play a pivotal role in the feedforward loop in response to drought stress Plant J. 2025 121 e17240 10.1111/tpj.17240 39935020 28. Li C. Du J. Xu H. Feng Z. Chater C.C. Duan Y. Yang Y. Sun X. UVR8-TCP4-LOX2 module regulates UV-B tolerance in Arabidopsis J. Integ. Plant Biol. 2024 66 897 908 10.1111/jipb.13648 38506424 29. Mozos I. Flangea C. Vlad D.C. Gug C. Mozos C. Stoian D. Luca C.T. Horbańczuk J.O. Horbańczuk O.K. Atanasov A.G. Effects of anthocyanins on vascular health Biomolecules 2021 11 811 10.3390/biom11060811 34070757 PMC8227852 30. Chen L. Li M. Zhou H. Liu Y. Pang W. Ma T. Niu C. Yang Z. Chang A.K. Li X. Sirtuin1 (SIRT1) is involved in the anticancer effect of black raspberry anthocyanins in colorectal cancer Eur. J. Nutr. 2023 62 395 406 10.1007/s00394-022-02989-7 36056948 31. Szot I. Łysiak G.P. Sosnowska B. Chojdak-Łukasiewicz J. Health-promoting properties of anthocyanins from cornelian cherry ( Cornus mas Molecules 2024 29 449 10.3390/molecules29020449 38257363 PMC10818799 32. Abdelrahman K.N. Ghany A.G.A.A. Saber R.A. Osman A. Sitohy B. Sitohy M. Anthocyanins from pomegranate peel ( Punica granatum Capsicum annuum Bougainvillea spectabilis Heliyon 2024 10 10.1016/j.heliyon.2024.e32222 PMC11168436 38868073 33. Niu B. Gao W. Li F. Pei Z. Wang H. Tian F. Zhao J. Lu W. Enhancing colonic health with encapsulated grape seed anthocyanins: Oral capsule for Colon-targeted delivery Food Chem. 2025 469 142544 10.1016/j.foodchem.2024.142544 39721444 34. Tang B. Li L. Hu Z. Chen Y. Tan T. Jia Y. Xie Q. Chen G. Anthocyanin accumulation and transcriptional regulation of anthocyanin biosynthesis in purple pepper J. Agric. Food Chem. 2020 68 12152 12163 10.1021/acs.jafc.0c02460 33054200 35. Meng Y. Zhang H. Fan Y. Yan L. Anthocyanins accumulation analysis of correlated genes by metabolome and transcriptome in green and purple peppers ( Capsicum annuum BMC Plant Biol. 2022 22 358 10.1186/s12870-022-03746-y 35869427 PMC9308287 36. An J.P. Xu R.R. Wang X.N. Zhang X.W. You C.X. Han Y. MdbHLH162 connects the gibberellin and jasmonic acid signals to regulate anthocyanin biosynthesis in apple J. Integrat. Plant Biol. 2024 66 265 284 10.1111/jipb.13608 38284786 37. Sharma H. Sharma P. Kumar A. Chawla N. Dhatt A.S. Multifaceted regulation of anthocyanin biosynthesis in plants: A comprehensive review J. Plant Growth Regul. 2024 43 3048 3062 10.1007/s00344-024-11306-x 38. Shao D. Li Y. Zhu Q. Zhang X. Liu F. Xue F. Sun J. GhGSTF12, a glutathione S-transferase gene, is essential for anthocyanin accumulation in cotton ( Gossypium hirsutum Plant Sci. 2021 305 110827 10.1016/j.plantsci.2021.110827 33691961 39. Zhang Z. Zhang H. Liu T. Zhao Y. Zhao X. Liu J. Zhang J. Functional analysis of the anthocyanin-associated glutathione s-transferase gene StGST1 Potato Res. 2023 66 215 230 10.1007/s11540-022-09582-9 40. Aza-González C. Herrera-Isidrón L. Núñez-Palenius H.G. Martínez De La Vega O. Ochoa-Alejo N. Anthocyanin accumulation and expression analysis of biosynthesis-related genes during chili pepper fruit development Biol. Plant. 2013 57 49 55 10.1007/s10535-012-0265-1 41. Zhou Y. Mumtaz M.A. Zhang Y. Shu H. Hao Y. Lu X. Cheng S. Zhu G. Wang Z. Response of anthocyanin accumulation in pepper ( Capsicum annuum Int. J. Mol. Sci. 2022 23 8357 10.3390/ijms23158357 35955513 PMC9369206 42. Wang Y. Liu S. Wang H. Zhang Y. Li W. Liu J. Cheng Q. Sun L. Shen H. Identification of the regulatory genes of UV-B-induced anthocyanin biosynthesis in pepper fruit Int. J. Mol. Sci. 2022 23 1960 10.3390/ijms23041960 35216077 PMC8879456 43. Zhou Y. Wu W. Sun Y. Shen Y. Mao L. Dai Y. Yang B. Liu Z. Integrated transcriptome and metabolome analysis reveals anthocyanin biosynthesis mechanisms in pepper ( Capsicum annuum BMC Plant Biol. 2024 24 210 10.1186/s12870-024-04888-x 38519909 PMC10960449 44. Langmead B. Salzberg S.L. Fast gapped-read alignment with Bowtie 2 Nat. Methods 2012 9 357 359 10.1038/nmeth.1923 22388286 PMC3322381 45. Mu H. Chen J. Huang W. Huang G. Deng M. Hong S. Ai P. Gao C. Zhou H. OmicShare tools: A zero-code interactive online platform for biological data analysis and visualization Imeta 2024 3 e228 10.1002/imt2.228 39429881 PMC11488081 46. Love M.I. Huber W. Anders S. Moderated estimation of fold change and dispersion for RNA-Seq data with DESeq2 Genome Biol. 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 47. Ashburner M. Ball C.A. Blake J.A. Botstein D. Butler H. Cherry J.M. Davis A.P. Dolinski K. Dwight S.S. Eppig J.T. Gene ontology: Tool for the unification of biology Nat. Genet. 2000 25 25 29 10.1038/75556 10802651 PMC3037419 48. Kanehisa M. Goto S. KEGG: Kyoto Encyclopedia of Genes and Genomes Nucleic Acids Res. 2000 28 27 30 10.1093/nar/28.1.27 10592173 PMC102409 49. Subramanian A. Tamayo P. Mootha V.K. Mukherjee S. Ebert B.L. Gillette M.A. Paulovich A. Pomeroy S.L. Golub T.R. Lander E.S. Gene set enrichment analysis: A knowledge-based approach for interpreting genome-wide expression profiles Proc. Natl. Acad. Sci. USA 2005 102 15545 15550 10.1073/pnas.0506580102 16199517 PMC1239896 50. Huang X. He L. Tan H. Liu J. Qiu Q. Sun Q. Ouyang L. Han H. He Q. Transcriptome and Physiological Analyses of Resistant and Susceptible Pepper ( Capsicum annuum Verticillium dahliae Horticulturae 2024 10 1160 10.3390/horticulturae10111160 51. Sunil L. Shetty N.P. Biosynthesis and regulation of anthocyanin pathway genes Appl. Microbiol. Biotechnol. 2022 106 1783 1798 10.1007/s00253-022-11835-z 35171341 52. Chen J. Liu Y. Zhao H. Xu J. Zheng P. Liu S. Sun B. CsHY5 Regulates Light-Induced Anthocyanin Accumulation in Camellia sinensis Int. J. Mol. Sci. 2025 26 3253 10.3390/ijms26073253 40244121 PMC11989487 53. LaFountain A.M. Yuan Y.W. Repressors of anthocyanin biosynthesis New Phytol. 2021 231 933 949 10.1111/nph.17397 33864686 PMC8764531 54. Wei Z. Yang H. Shi J. Duan Y. Wu W. Lyu L. Li W. Effects of different light wavelengths on fruit quality and gene expression of anthocyanin biosynthesis in blueberry ( Vaccinium corymbosm Cells 2023 12 1225 10.3390/cells12091225 37174623 PMC10177116 55. Zhang J. Li S. An H. Zhang X. Zhou B. Integrated transcriptome and metabolome analysis reveals the anthocyanin biosynthesis mechanisms in blueberry ( Vaccinium corymbosum Front. Plant Sci. 2022 13 1073332 10.3389/fpls.2022.1073332 36570935 PMC9772006 56. Samkumar A. Jones D. Karppinen K. Dare A.P. Sipari N. Espley R.V. Martinussen I. Jaakola L. Red and blue light treatments of ripening bilberry fruits reveal differences in signalling through abscisic acid-regulated anthocyanin biosynthesis Plant Cell Environ. 2021 44 3227 3245 10.1111/pce.14158 34337774 57. Satitmunnaithum J. Abe I. Mitsuzuka R. Onozawa T. Ikeda T. Night blue-light radiation enhances anthocyanin production in purple paprika ‘Tequila’ by increasing its structural-gene expression during fruit growth J. Am. Soc. Hortic. Sci 2024 149 294 301 10.21273/JASHS05421-24 58. Wang Y. Li X. Qiu H. Chen R. Zhang Z. Xiong A. Xu Z. Chen R. Zhang X. Liu X. Metabolomics and transcriptomics analyses provide insights into the dynamic of metabolites and the molecular mechanisms of natural pigment formation of different color-transition types of red pepper ( Capsicum Sci. Hortic. 2025 342 114062 10.1016/j.scienta.2025.114062 59. Gao J. Dou Y. Wang X. Zhang D. Wei M. Li Y. Transcriptome analysis reveals the mechanism for blue-light–induced biosynthesis of delphinidin derivatives in harvested purple pepper fruit Front. Plant Sci. 2023 14 1289120 10.3389/fpls.2023.1289120 37965026 PMC10640979 60. Wang X. Luo S. Li Q. Song L. Zhang W. Yu P. Xuan S. Wang Y. Zhao J. Chen X. Delphinidins and naringenin chalcone underlying the fruit color changes during maturity stages in eggplant Agronomy 2022 12 1036 10.3390/agronomy12051036 61. Cheng G.W. Breen P.J. Activity of phenylalanine ammonia-lyase (PAL) and concentrations of anthocyanins and phenolics in develoment strawberry fruit J. Am. Soc. Hortic. Sci. 1991 116 865 869 10.21273/JASHS.116.5.865 62. Saengnil K. Lueangprasert K. Uthaibutra J. Sunlight-stimulated phenylalanine ammonia-lyase (PAL) activity and anthocyanin accumulation in exocarp of ‘Mahajanaka’ mango Maejo Int. J. Sci. Technol. 2011 5 365 63. Chen X. Wang P. Gu M. Hou B. Zhang C. Zheng Y. Sun Y. Jin S. Ye N. Identification of PAL genes related to anthocyanin synthesis in tea plants and its correlation with anthocyanin content Hortic. Plant J. 2022 8 381 394 10.1016/j.hpj.2021.12.005 64. Shan B. Mo J. Yang J. Qin X. Yu H. Cloning and functional characterization of a cinnamate 4-hydroxylase gene from the hornwort Anthoceros angustus Plant Sci. 2024 341 111989 10.1016/j.plantsci.2024.111989 38232819 65. Kuang L. Chen J. Bao X. Zhang D. Liu J. Wang W. Wei Y. Zong C. Environmental and phytohormonal factors regulating anthocyanin biosynthesis in fruits Horticulturae 2025 11 681 10.3390/horticulturae11060681 66. Fu D. Qi J. Su L. Wang X. Wang M. Chen B. Yu X. Zhao X. Gao W. Guo X. Chalcone synthase 2 ( BpCHS2 Broussonetia papyrifera Plant Physiol. Biochem. 2025 222 109656 10.1016/j.plaphy.2025.109656 40020598 67. He L. Lai G. Lin J. Guo A. Yang F. Pan R. Che J. Lai C. VdCHS2 Overexpression Enhances Anthocyanin Biosynthesis, Modulates the Composition Ratio, and Increases Antioxidant Activity in Vitis davidii Antioxidants 2024 13 1472 10.3390/antiox13121472 39765801 PMC11673275 68. Li R. Guo S. Hao S. Du S. Zhang J. Liu R. Li J. Zhang Y. Cheng C. Characterization of the anthocyanin-related flavanone 3-hydroxylase F3H VcF3H2 Fruit Res. 2025 5 e022 10.48130/frures-0025-0012 69. Li C. Yang J. Yang K. Wu H. Chen H. Wu Q. Zhao H. Tartary buckwheat FtF3′H1 Front. Plant Sci. 2022 13 959698 10.3389/fpls.2022.959698 36092410 PMC9452690 70. Jung Y.J. Lee H.J. Kim J.H. Kim D.H. Kim H.K. Cho Y.G. Bae S. Kang K.K. CRISPR/Cas9-targeted mutagenesis of F3′ H, DFR and LDOX, genes related to anthocyanin biosynthesis in black rice ( Oryza sativa Plant Biotechnol. Rep. 2019 13 521 531 10.1007/s11816-019-00579-4 71. Karamat U. Guo J. Jiang S. Khan I. Lu M. Li G. Fu M. Integrated omics and functional insights into BjMYB90-mediated regulation of BjGSTF12 for enhanced anthocyanin biosynthesis in mustard ( Brassica juncea Plant Cell Rep. 2025 44 166 10.1007/s00299-025-03542-6 40601061 72. Zhao J. Dixon R.A. The ‘ins’ and ‘outs’ of flavonoid transport Trends Plant Sci. 2010 15 72 80 10.1016/j.tplants.2009.11.006 20006535 73. Luo H. Dai C. Li Y. Feng J. Liu Z. Kang C. Reduced Anthocyanins in petioles codes for a GST anthocyanin transporter that is essential for the foliage and fruit coloration in strawberry J. Exp. Bot. 2018 69 2595 2608 10.1093/jxb/ery096 29538703 PMC5920330 74. Lu Z. Cao H. Pan L. Niu L. Wei B. Cui G. Wang L. Yao J. Zeng W. Wang Z. Two loss-of-function alleles of the glutathione S-transferase GST Prunus persica Plant J. 2021 107 1320 1331 10.1111/tpj.15312 33964100 75. Zhao Y.W. Wang C.K. Huang X.Y. Hu D.G. Genome-wide analysis of the glutathione S-transferase (GST) genes and functional identification of MdGSTU12 Genes 2021 12 1733 10.3390/genes12111733 34828339 PMC8619396 76. Li S. Zuo D. Cheng H. Ali M. Wu C. Ashraf J. Zhang Y. Feng X. Lin Z. Wang Q. Glutathione S-transferases GhGSTF1 GhGSTF2 Gossypium hirsutum Int J. Biol. Macromol. 2020 165 2565 2575 10.1016/j.ijbiomac.2020.10.101 33736275 77. Zhang T. Wu H. Sun Y. Zhang P. Li L. Luo D. Wu Z. Identification of the GST RcGSTF2 Rosa chinensis Plants 2025 14 932 10.3390/plants14060932 40265850 PMC11944598 78. Yang S. Liu M. Zhao C. Wang R. Xue L. Lei J. A novel bHLH transcription factor, FabHLH110, is involved in regulation of anthocyanin synthesis in petals of pink-flowered strawberry Plant Physiol. Biochem. 2025 222 109713 10.1016/j.plaphy.2025.109713 40037177 79. Meng J. Yin J. Wang H. Li H. A TCP transcription factor in Malus halliana Int. J. Mol. Sci. 2022 23 9051 10.3390/ijms23169051 36012317 PMC9409405 80. Tao R. Trivedi I. Trimborn L. Ponnu J. Tóth B.V. Hoecker U. TCP3 is a substrate of the COP1/SPA ubiquitin ligase to regulate anthocyanin accumulation and flowering time in Arabidopsis Proc. Natl. Acad. Sci. USA 2025 122 e2426423122 10.1073/pnas.2426423122 40359052 PMC12107181 81. Bian X.-H. Li W. Niu C.-F. Wei W. Hu Y. Han J.-Q. Lu X. Tao J.-J. Jin M. Qin H. A class B heat shock factor selected for during soybean domestication contributes to salt tolerance by promoting flavonoid biosynthesis New Phytol. 2020 225 268 283 10.1111/nph.16104 31400247 Figure 1 Summary of the metabolome of pepper ( Capsicum annuum a b c Figure 2 Differentially accumulated metabolites of pepper ( Capsicum annuum a b c Figure 3 Correlation between gene expression levels and differentially expressed genes in different-colored pepper ( Capsicum annuum a b Figure 4 GO ( a b Capsicum annuum c d Figure 5 Metabolite content and gene expression characteristics of flavonoid and anthocyanin synthesis pathways in pepper ( Capsicum annuum Figure 6 Heatmap of four differentially expressed transcription factors. The heatmap displays Z-score-normalized FPKM values. B: black fruit peel, G: green fruit peel. Figure 7 Correlation analysis of transcription factors with differentially accumulated metabolites ( a b p p p Figure 8 Quantitative reverse transcription PCR (qRT-PCR) and RNA-Seq data of 12 differentially expressed genes. B: black fruit peel, G: green fruit peel. ",
  "metadata": {
    "Title of this paper": "A class B heat shock factor selected for during soybean domestication contributes to salt tolerance by promoting flavonoid biosynthesis",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468451/"
  }
}