{
  "title": "Paper_633",
  "abstract": "pmc World J Gastrointest Surg 1325 worldjgastrosurg WJGS World Journal of Gastrointestinal Surgery 1948-9366 Baishideng Publishing Group Inc PMC12476749 PMC12476749.1 12476749 12476749 41024809 10.4240/wjgs.v17.i9.109952 jWJGS.v17.i9.eid109952 1 Case Report Endoscopic and laparoscopic treatment of ileocecal laterally spreading tumor with concomitant appendiceal adenoma: A case report and review of literature Huang YH et al Huang Ying-Hui Department of Gastroenterology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China Ma Li Department of Clinical Nutrition, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China Cao Bin Department of Gastroenterology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China Zhang Yue-Juan Department of Pathology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China Gao Qun Department of Gastroenterology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China Zhu Zhen-Ming Department of Gastroenterology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China Qiao Xiao-Lu Department of Gastroenterology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China Wang Lei Department of Gastroenterology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China He Bao-Guo Department of Gastroenterology, The Affiliated Hospital of Qingdao University, Qingdao 266000, Shandong Province, China. hebaoguo@qduhospital.cn Author contributions: Huang YH wrote the manuscript; He BG performed the surgery; Ma L reviewed and edited the manuscript; Cao B done the supervision; Zhang YJ finished the pathology diagnose section; Gao Q, Zhu ZM, Qiao XL, and Wang L helped in data collection. All authors approved the final version. Corresponding author: Bao-Guo He, Department of Gastroenterology, The Affiliated Hospital of Qingdao University, No. 1677 Wutaishan Road, Qingdao 266000, Shandong Province, China. hebaoguo@qduhospital.cn 27 9 2025 27 9 2025 17 9 497733 109952 4 6 2025 24 6 2025 31 7 2025 27 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Ileocecal laterally spreading tumors (LSTs) complicated by appendiceal tubular adenoma are rare and challenging to diagnose because of the absence of typical symptoms and specific diagnostic signs. Traditionally, the primary treatment has been laparoscopic appendectomy (LA). CASE SUMMARY A 63-year-old female presented with changes in bowel habits. Colonoscopy revealed an ileocecal LST. The patient underwent endoscopic submucosal dissection. Postoperative follow-up colonoscopy revealed mucosal elevation at the appendiceal orifice, with pathology confirming tubular adenoma. Abdominal computed tomography indicated a suspicious appendiceal tumor, leading to LA with partial cecectomy. The postoperative recovery was uneventful. At the 1-year follow-up, colonoscopy revealed no evidence of tumor recurrence. CONCLUSION Ileocecal LSTs with appendiceal tubular adenomas are traditionally treated with LA. endoscopic submucosal dissection can also yield favorable outcomes. Appendiceal tubular adenoma Ileocecal laterally spreading tumor Appendiceal laterally spreading tumor Endoscopic submucosal dissection Laparoscopic appendectomy Case report pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Laterally spreading tumors (LSTs) are critical lesions in colorectal cancer, with a prevalence of 0.8% in the general population undergoing colonoscopy[ 1 2 3 4 5 CASE PRESENTATION Chief complaints A 63-year-old female presented to The Affiliated Hospital of Qingdao University with a chief complaint of “changes in bowel habits for six months”. History of present illness Colonoscopy revealed a 5 cm × 6 cm nodular-mixed type LST in the ileocecal region (Figure 1 Figure 1  Imaging manifestations. During ESD, the lesion was found to extend into the appendiceal orifice. The mucosal tissue invading the appendix was transected endoscopically, and biopsies were taken from the residual tissue at the appendiceal orifice. The final pathology of the ESD specimen revealed a tubulovillous adenoma with high-grade dysplasia and focal carcinoma, and the histologic grade is moderate differentiated (Figure 2 Figure 2  The final pathology of the endoscopic submucosal dissection. Five months later, follow-up colonoscopy revealed good healing at the surgical site. An 8 mm × 8 mm mucosal elevation was noted at the appendiceal orifice, which was clearly visualized (Figure 1 1 1 2 1 3 Figure 3 Timeline of diagnosis and treatment. History of past illness The patient did have past illness. Personal and family history The patient did have personal and family history. Physical examination Inspection: The abdomen is symmetric in shape, without distension or depression. Abdominal respiration is present. There is no varicose vein on the abdominal wall, and no rash, scar, gastrointestinal pattern, or peristaltic wave is observed. Palpation: The abdominal wall is soft without muscular tension. No tenderness, rebound tenderness, or abnormal mass is detected throughout the abdomen. The liver and spleen are not palpable below the costal margin. The Murphy’s sign is negative, and there is no percussion pain in the renal area. Percussion: The hepatic dullness boundary is present, located from the 5 th th Laboratory examinations No obvious abnormalities were found in the patient’s laboratory examinations. Imaging examinations March 20, 2023: Colonoscopy (flexible fiberoptic endoscopy of the colon) revealed an approximately 5 cm × 6 cm LST at the appendiceal orifice region of the cecum. August 4, 2023: Colonoscopy showed good healing of the postoperative wound. At the appendiceal orifice, there was a mucosal elevation approximately 8 mm × 8 mm in diameter, and the appendiceal orifice was visible. October 23, 2023: Colonoscopy revealed a mucosal elevation approximately 8 mm × 6 mm in diameter at the appendiceal orifice, with surrounding scarring. October 23, 2023: Dynamic enhanced CT scan of the lower abdomen: The proximal part of the appendix shows uneven thickening with mild dilation of the appendiceal cavity. Slightly enlarged lymph node shadows are seen medially in the ileocecal region. A tumor in the appendiceal area is suspected. Please make a comprehensive diagnosis combined with clinical history and colonoscopy. October 30, 2024: Colonoscopy showed no obvious abnormalities. FINAL DIAGNOSIS Ileocecal LST with concomitant appendiceal adenoma. TREATMENT March 24, 2023: ESD was performed for the ileocecal LST. October 24, 2023: LA and partial cecectomy were performed. OUTCOME AND FOLLOW-UP The appendiceal adenoma was completely resected. And one-year follow-up after surgery showed no obvious abnormalities on colonoscopy. DISCUSSION This case highlights a rare presentation of an ileocecal LST complicated by an appendiceal tubular adenoma. While ileocecal LSTs are not uncommon, their extension into the appendix is rare. Appendiceal epithelial tumors are observed in 0.2%-0.3% of appendectomy samples, most frequently in individuals aged 50-70 years[ 6 7 Appendiceal tumors are often difficult to diagnose. Indeed, in most cases, these lesions are asymptomatic and incidentally detected during surgery or pathological examination of surgical samples. A review of appendiceal adenomas indicated that over 93% of these benign lesions are diagnosed postappendectomy or at autopsy[ 8 9 10 After the diagnosis of an appendiceal adenoma, treatment is critical to avoid potential complications such as metastasis, appendicitis, or vomiting. Surgery is widely considered as the gold standard for managing appendiceal tumors[ 11 13 14 With advancements in endoscopic technology, is being applied to regions once considered too complex for endoscopic management. ESD is widely used in many specialized centers for treating superficial colonic neoplasia owing to its lower incidence of postoperative adverse events than that of traditional surgery[ 15 16 17 18 19 Endoscopic mucosal resection (EMR) has been described for managing lesions involving the appendiceal orifice. Tate et al 20 21 22 22 24 Historically, for lesions extending deeply into the appendiceal orifice (as in this case), full-thickness resection with a disc-shaped snare has been considered an ideal endoluminal approach, as retracting the lesion into a cap allows resection to deeper portions of the orifice. For lesions > 2 cm in diameter, endoscopic full-thickness resection can also be combined with prior EMR via 25 et al 26 et al 27 28 The most recent study by Jacob et al 29 en bloc en bloc et al 30 en bloc An alternative approach is to recommend combined endoscopic and laparoscopic surgery, which addresses challenges in identifying lesion margins, ensures en bloc 31 33 In the present case, the physician innovatively performed ESD for the ileocecal region and appendiceal orifice first, followed by LA with preservation of the ileocecal valve for a type 3 Lesion. Preoperative endoscopic treatment of the ileocecal mass ensured negative margins and provided high-quality specimens for pathologists to accurately stage the resected lesion, guiding further management (postoperative follow-up vs This case demonstrates that laparoscopic surgery following endoscopic ESD for appendiceal adenoma is safe and effective in achieving curative outcomes. However, a thorough histopathological examination is mandatory postoperatively. If appendectomy pathology reveals cancer, curative resection and lymph node dissection following colorectal cancer guidelines are needed. Additionally, patients should be counselled on the risks of cancer-related complications or the need for further resection after appendectomy. CONCLUSION An ileocecal LST with an appendiceal tubular adenoma is a clinically rare condition that is often incidentally detected during surgery. The preoperative diagnosis is limited by the frequent absence of symptoms and nonspecific diagnostic signs. With the advancement of endoscopic techniques and their lower postoperative complication rates, colorectal tumor lesions invading the appendiceal orifice should no longer be considered contraindications for endoscopic resection. Lesions should be classified according to the degree of invasion into the appendiceal orifice to guide the selection of different resection strategies.  Informed consent statement:  Conflict-of-interest statement:  CARE Checklist (2016) statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Bogie RMM Veldman MHJ Snijders LARS Winkens B Kaltenbach T Masclee AAM Matsuda T Rondagh EJA Soetikno R Tanaka S Chiu HM Sanduleanu-Dascalescu S Endoscopic subtypes of colorectal laterally spreading tumors (LSTs) and the risk of submucosal invasion: a meta-analysis Endoscopy 2018 50 263 282 29179230 10.1055/s-0043-121144 2 Leonards LM Pahwa A Patel MK Petersen J Nguyen MJ Jude CM Neoplasms of the Appendix: Pictorial Review with Clinical and Pathologic Correlation Radiographics 2017 37 1059 1083 28598731 10.1148/rg.2017160150 3 Collins DC 71,000 Human Appendix Specimens. A Final Report, Summarizing Forty Years' Study Am J Proctol 1963 14 265 281 14098730 4 Shinya H Wolff WI Morphology, anatomic distribution and cancer potential of colonic polyps Ann Surg 1979 190 679 683 518167 10.1097/00000658-197912000-00001 PMC1345622 5 Connor SJ Hanna GB Frizelle FA Appendiceal tumors: retrospective clinicopathologic analysis of appendiceal tumors from 7,970 appendectomies Dis Colon Rectum 1998 41 75 80 9510314 10.1007/BF02236899 6 Turaga KK Pappas SG Gamblin T Importance of histologic subtype in the staging of appendiceal tumors Ann Surg Oncol 2012 19 1379 1385 22302267 10.1245/s10434-012-2238-1 7 Carr NJ Cecil TD Mohamed F Sobin LH Sugarbaker PH González-Moreno S Taflampas P Chapman S Moran BJ Peritoneal Surface Oncology Group International A Consensus for Classification and Pathologic Reporting of Pseudomyxoma Peritonei and Associated Appendiceal Neoplasia: The Results of the Peritoneal Surface Oncology Group International (PSOGI) Modified Delphi Process Am J Surg Pathol 2016 40 14 26 26492181 10.1097/PAS.0000000000000535 8 Graham RP Williams NP West KA Primary epithelial tumours of the appendix in a black population: a review of cases World J Gastroenterol 2009 15 1472 1474 19322920 10.3748/wjg.15.1472 PMC2665141 9 B B SK Jasuja P Appendiceal mucocele-A rare case report Int J Surg Case Rep 2019 58 21 25 30999148 10.1016/j.ijscr.2019.04.008 PMC6468153 10 Pickhardt PJ Levy AD Rohrmann CA Jr Kende AI Primary neoplasms of the appendix manifesting as acute appendicitis: CT findings with pathologic comparison Radiology 2002 224 775 781 12202713 10.1148/radiol.2243011545 11 Chang P Attiyeh FF Adenocarcinoma of the appendix Dis Colon Rectum 1981 24 176 180 6164526 10.1007/BF02962328 12 Cortina R McCormick J Kolm P Perry RR Management and prognosis of adenocarcinoma of the appendix Dis Colon Rectum 1995 38 848 852 7634979 10.1007/BF02049842 13 Ito H Osteen RT Bleday R Zinner MJ Ashley SW Whang EE Appendiceal adenocarcinoma: long-term outcomes after surgical therapy Dis Colon Rectum 2004 47 474 480 14978617 10.1007/s10350-003-0077-7 14 Kulaylat AS Boltz MM Moyer M Mathew A McKenna K Messaris E Management of Large Cecal Polyps: When Can the Ileocecal Valve Be Spared? Dis Colon Rectum 2018 61 1089 1095 30086058 10.1097/DCR.0000000000001159 15 Saito Y Uraoka T Yamaguchi Y Hotta K Sakamoto N Ikematsu H Fukuzawa M Kobayashi N Nasu J Michida T Yoshida S Ikehara H Otake Y Nakajima T Matsuda T Saito D A prospective, multicenter study of 1111 colorectal endoscopic submucosal dissections (with video) Gastrointest Endosc 2010 72 1217 1225 21030017 10.1016/j.gie.2010.08.004 16 Fujishiro M Yahagi N Kakushima N Kodashima S Muraki Y Ono S Yamamichi N Tateishi A Oka M Ogura K Kawabe T Ichinose M Omata M Outcomes of endoscopic submucosal dissection for colorectal epithelial neoplasms in 200 consecutive cases Clin Gastroenterol Hepatol 2007 5 678 683; quiz 645 17466600 10.1016/j.cgh.2007.01.006 17 Horimatsu T Fu KI Sano Y Yano T Saito Y Matsuda T Fujimori T Yoshida S Acute appendicitis as a rare complication after endoscopic mucosal resection Dig Dis Sci 2007 52 1741 1744 17429724 10.1007/s10620-006-9467-8 18 Boda K Oka S Tanaka S Tanaka H Matsumoto K Yamashita K Sumimoto K Hirano D Tamaru Y Ninomiya Y Hayashi N Chayama K Short-term outcomes of endoscopic submucosal dissection for superficial cecal tumors: a comparison between extension and nonextension into the appendiceal orifice Therap Adv Gastroenterol 2018 11 1756284818772794 10.1177/1756284818772794 PMC5991193 29899756 19 Song EM Yang HJ Lee HJ Lee HS Cha JM Kim HG Jung Y Moon CM Kim BC Byeon JS Endoscopic Resection of Cecal Polyps Involving the Appendiceal Orifice: A KASID Multicenter Study Dig Dis Sci 2017 62 3138 3148 28936593 10.1007/s10620-017-4760-2 20 Tate DJ Desomer L Awadie H Goodrick K Hourigan L Singh R Williams SJ Bourke MJ EMR of laterally spreading lesions around or involving the appendiceal orifice: technique, risk factors for failure, and outcomes of a tertiary referral cohort (with video) Gastrointest Endosc 2018 87 1279 1288.e2 29309777 10.1016/j.gie.2017.12.018 21 Lambin T Albouys J Yzet C Brun S Rostain F Rivory J Pioche M Endoscopic submucosal dissection of a lateral spreading tumor involving the appendiceal orifice using a multi-traction device Endoscopy 2022 54 E425 E426 34496432 10.1055/a-1581-7411 22 De Cristofaro E Masgnaux LJ Lupu A Wallenhorst T Jacques J Rivory J Pioche M Treatment of a sessile serrated adenoma/polyp deeply invading the appendiceal orifice enabled by combined adaptive traction and underwater endoscopic submucosal dissection Endoscopy 2024 56 E215 E216 38428918 10.1055/a-2268-5673 PMC10907116 23 Iwasaki M Okimoto K Akizue N Ota Y Taida T Matsumura T Kato J Kato N Underwater modified strip biopsy for colorectal polyp invading into the appendiceal orifice VideoGIE 2024 9 344 347 39070680 10.1016/j.vgie.2024.03.013 PMC11281918 24 Binmoeller KF Hamerski CM Shah JN Bhat YM Kane SD Underwater EMR of adenomas of the appendiceal orifice (with video) Gastrointest Endosc 2016 83 638 642 26375437 10.1016/j.gie.2015.08.079 25 Mahadev S Vareedayah AA Yuen S Yuen W Koller KA Haber GB Outcomes of a hybrid technique using EMR and endoscopic full-thickness resection for polyps not amenable to standard techniques (with video) Gastrointest Endosc 2021 94 358 367.e1 33592228 10.1016/j.gie.2021.02.009 26 Schmidbaur S Wannhoff A Walter B Meier B Schäfer C Meining A Caca K Risk of appendicitis after endoscopic full-thickness resection of lesions involving the appendiceal orifice: a retrospective analysis Endoscopy 2021 53 424 428 32894866 10.1055/a-1227-4555 27 Ichkhanian Y Barawi M Seoud T Thakkar S Kothari TH Halabi ME Ullah A Edris W Aepli P Kowalski T Shinn B Shariaha RZ Mahadev S Mosko JD Andrisani G Di Matteo FM Albrecht H Giap AQ Tang SJ Naga YM van Geenen E Friedland S Tharian B Irani S Ross AS Jamil LH Lew D Nett AS Farha J Runge TM Jovani M Khashab MA Endoscopic full-thickness resection of polyps involving the appendiceal orifice: a multicenter international experience Endoscopy 2022 54 16 24 33395714 10.1055/a-1345-0044 28 Dumoulin FL Gorris DG Berger S Hildenbrand R Sido B Full-thickness resection with an over-the-scope device: possible translocation of adenoma tissue in a case of an incomplete resection at the appendix Endosc Int Open 2018 6 E622 E624 29756021 10.1055/a-0589-9850 PMC5943692 29 Jacob H Toyonaga T Ohara Y Tsubouchi E Takihara H Baba S Yoshizaki T Kawara F Tanaka S Ishida T Hoshi N Morita Y Umegaki E Azuma T Endoscopic submucosal dissection of cecal lesions in proximity to the appendiceal orifice Endoscopy 2016 48 829 836 27467815 10.1055/s-0042-110396 30 Oung B Rivory J Chabrun E Legros R Faller J Léger-Nguyen F Rostain F Ber CE Hervieu V Saurin JC Ponchon T Jacques J Pioche M ESD with double clips and rubber band traction of neoplastic lesions developed in the appendiceal orifice is effective and safe Endosc Int Open 2020 8 E388 E395 32118111 10.1055/a-1072-4830 PMC7035042 31 Jiang X Wang M Fu M Wang Y Zhao L Fan Z Breaking boundaries: laparoscopic and endoscopic collaboration in appendectomy Rev Esp Enferm Dig 2024 116 727 728 38031906 10.17235/reed.2023.10092/2023 32 Crawford AB Yang I Wu RC Moloo H Boushey RP Dynamic article: combined endoscopic-laparoscopic surgery for complex colonic polyps: postoperative outcomes and video demonstration of 3 key operative techniques Dis Colon Rectum 2015 58 363 369 25664717 10.1097/DCR.0000000000000311 33 Zhang YY Lu JY Wang Q Yang AM Resection of polyps involving the appendiceal orifice by combined endo-laparoscopic surgery: Two case reports World J Gastrointest Surg 2024 16 1948 1952 38983360 10.4240/wjgs.v16.i6.1948 PMC11229993 ",
  "metadata": {
    "Title of this paper": "Resection of polyps involving the appendiceal orifice by combined endo-laparoscopic surgery: Two case reports",
    "Journal it was published in:": "World Journal of Gastrointestinal Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476749/"
  }
}