{
  "title": "Paper_1026",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469626 PMC12469626.1 12469626 12469626 41009329 10.3390/ijms26188759 ijms-26-08759 1 Article The Omega-3 Fatty Acids Eicosapentaenoic Acid and Docosahexaenoic Acid Enhance the Effects of Temozolomide Chemotherapy in Glioblastoma Cells https://orcid.org/0000-0002-7896-8893 Silva Janaína Alessandra https://orcid.org/0000-0002-0691-2364 Colquhoun Alison * Boussios Stergios Academic Editor Department of Cell and Developmental Biology, Institute of Biomedical Sciences, University of São Paulo, São Paulo 05508-000, Brazil; janaina.alessandra.silva@usp.br * alison@usp.br 09 9 2025 9 2025 26 18 497349 8759 04 7 2025 03 9 2025 05 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Overcoming resistance to temozolomide (TMZ) chemotherapy is a major challenge in glioma treatment. Polyunsaturated fatty acids (PUFAs) can interfere with drug resistance in glioma but their mechanism of action is poorly understood. Eicosapentaenoic acid (EPA) or docosahexaenoic acid (DHA) effects were assessed using proliferation and clonogenic assays, adhesion and migration assays, glucose and lactate metabolism, detection of lipid droplets, acidic vesicles, reactive oxygen species, and phosphokinase proteome analysis. EPA or DHA caused significant reductions in cell number, colony formation, adhesion, and migration in comparison with TMZ alone, increasing lipid droplet accumulation, reactive oxygen species formation, acidic vesicle number and apoptosis, while also altering glucose and lactate metabolism. TMZ increased phosphorylation of ERK 1/2, GSK3α/β, AMPKα1, Akt 1/2/3, PRAS40, CREB, HSP27, WNK1, and c-Jun in U87MG TMZR cells. EPA in the presence of TMZ reduced the phosphorylation of GSK3α/β, Akt 1/2/3, HSP27, and WNK1, while DHA reduced the phosphorylation of ERK 1/2, GSK3α/β, AMPKα1, Akt 1/2/3, and WNK1, thereby leading to additive or synergistic effects of EPA or DHA in combination with TMZ. Overall, the present study highlights the alterations seen in TMZ-resistant glioma cells when exposed to EPA or DHA and demonstrates the therapeutic potential that modulation of lipid metabolism can exert upon important aspects of glioma cell biology. omega-3 fatty acids glioblastoma temozolomide drug resistance apoptosis FAPESP 2022/07090-4 This work was supported by FAPESP 2022/07090-4. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Gliomas are primary tumors of the central nervous system (CNS) and are considered to be of glial origin. Diffuse gliomas are currently classified with emphasis on isocitrate dehydrogenase (IDH) mutation status. Astrocytomas with classic high-grade morphology and IDH wildtype are classified as glioblastomas (GBMs). Additionally, astrocytomas without classic GBM morphology, but with one or more of the genetic parameters of EGFR amplification, TERT promoter mutation, or gain of chromosome 7 with loss of chromosome 10 (+7/−10), are also classified as GBMs [ 1 2 3 3 4 3 Poor prognosis and low survival are related to several factors that make the treatment of high-grade gliomas difficult. Firstly, the location of the tumor often prevents total surgical resection of the lesion. Secondly, the tumor cells that remain after surgery have a high migratory and invasive capacity, causing tumor re-incidence close to the original site of surgical resection [ 5 6 7 8 9 Polyunsaturated fatty acids (PUFAs) are known to induce apoptosis in many different tumor cells [ 10 11 12 11 13 14 15 n 16 17 n 18 There is considerable evidence that eicosapentaenoic acid (20:5 n 19 20 21 19 22 Previous studies have shown that in U87MG human glioma cells sensitive or resistant to TMZ, the presence of the PUFAs EPA or DHA has diverse additive or synergistic effects on the cells’ proliferative response to chemotherapy during the 72 h of exposure to PUFAs [ 23 n 17 In the present study, we have established several TMZ-resistant human glioma cell lines to further investigate the effects of EPA and DHA in the absence or presence of TMZ at concentrations which reflect achievable intratumoral TMZ concentrations, which are reported to range from 15 to 35 µm [ 24 25 26 2. Results 2.1. Influence of EPA or DHA on Cell Number Initially, the effects of 25 µm TMZ were studied in TMZ-sensitive and TMZ-resistant (TMZR) human glioma cell lines ( Figure 1 Figure 1 Figure 1 U87MG cells were more sensitive to the effects of EPA or DHA than A172, with a reduction of 76.4% and 91.2%, respectively ( Figure 1 Figure 1 U138MG cells had reduced cell numbers in the presence of EPA (23.9%) or DHA (23.9%) ( Figure 1 Figure 1 U251 cell numbers were significantly reduced by both EPA (29.4%) and DHA (29.4%) ( Figure 1 Figure 1 Finally, the T98G cell line had reduced cell numbers in the presence of EPA (54.7%) or DHA (48.8%) ( Figure 1 Figure 1 2.2. Influence of TMZ, EPA, or DHA on Clonogenic Capacity The effects of EPA or DHA on clonogenic capacity were studied and are presented in Figure 2 Figure 2 Figure 2 U251 cells had significantly reduced capacity in the presence of EPA or DHA, which was also seen for the U251 TMZR cells ( Figure 2 Figure 2 The clonogenic capacity of T98G cells was reduced in the presence of EPA or DHA as was the capacity of T98G TMZR ( Figure 2 Figure 2 A172 had significantly reduced clonogenic capacity in the presence of EPA or DHA ( Figure 2 Figure 2 Colony areas were also calculated to compare the growth of colonies after successful formation and showed that the presence of EPA or DHA caused significant reductions in colony area in addition to reduced capacity for colony formation in the majority of cells ( Supplementary Figure S1 2.3. Influence of EPA or DHA on Cellular Adhesion and Spreading To further understand the effects of PUFA exposure on glioma cell biology, cells were exposed to EPA or DHA for 72 h then tested for adhesion capacity. Pretreatment with EPA caused an increase in adhesion in A172 cells, which was not seen for DHA-treated cells ( Figure 3 Figure 3 Figure 3 Figure 3 In U87MG cells, EPA caused a reduction in adhesion while DHA had no significant effects ( Figure 4 Figure 4 Both EPA and DHA caused significant reductions in adhesion in U138MG cells ( Figure 4 Figure 4 U251 cell adhesion was reduced by both EPA and DHA pretreatment ( Figure 4 Figure 4 Since the results for T98G and T98G TMZR cells are very similar for cell number and clonogenic capacity ( Figure 1 Figure 2 Figure 4 2.4. Influence of EPA or DHA on Glioma Cell Migration The effect of EPA or DHA exposure on glioma cell transwell migration was tested and the results are presented in Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 U251 cells displayed significant inhibition of migration in the presence of DHA ( Figure 6 Figure 6 Figure 6 2.5. Alterations in Energy Metabolism Caused by EPA or DHA In order to test the effects of EPA or DHA on glioma cell metabolism, lactate and glucose concentrations were determined in the culture medium. Initially, the lactate concentration was analyzed and a decrease in lactate accumulation was evident in the medium of U87MG and U87MG TMZR in the absence or presence of 25 µm TMZ when EPA or DHA were present ( Figure 7 Figure 7 Figure 7 When lactate production and glucose consumption were normalized by cell number, it was evident that EPA and DHA altered cell metabolism ( Figure 8 Figure 9 Figure 8 Figure 9 Figure 8 Figure 8 Figure 9 Figure 9 10 27 28 2.6. Lipid Accumulation, Cellular Damage, and Morphological Alterations Caused by EPA or DHA Based on the results, U87MG and U87MG TMZR were chosen to further investigate the effects of EPA and DHA on cellular metabolism and morphology and the results are presented in Figure 10 Figure 10 Figure 10 Figure 10 Figure 10 Figure 10 Acridine orange was used as a fluorescent probe for both nuclear labeling to observe apoptosis and to identify the acidic vesicle/lysosomal compartment of the cells. There was a tendency to increase lysosomal fluorescence in U87MG cells in the presence of EPA, but statistical significance was only observed in the presence of DHA ( Figure 10 Figure 10 U87MG cells showed nuclear condensation typical of cells entering apoptosis in the presence of EPA or DHA and this was particularly evident in DHA-exposed cells stained with acridine orange ( Figure 11 Figure 11 Figure 11 2.7. Human Phosphokinase Proteome Array The effects of EPA or DHA on signaling pathways were studied in U87MG TMZR cells using a human phosphokinase proteome array and the results are presented in Figure 12 Figure 12 The presence of TMZ caused a significant increase in phospho-AMPK α1(T183) and phospho-Akt 1/2/3 (S473) ( Figure 12 The presence of TMZ caused a significant increase in phospho-PRAS40 (T246) ( Figure 12 The presence of TMZ caused a significant increase in phospho-CREB (S133) and phospho-HSP27 (S78/S82) ( Figure 12 The presence of TMZ caused an increase in phospho-WNK1 ( Figure 12 The presence of TMZ caused a significant increase in phospho-c-Jun (S63) ( Figure 12 The phosphorylation profiles of Src (Y419), STAT 2 (Y689), STAT 5a (Y694), STAT 5a/b (Y694/Y699), Fyn (Y420), Yes (Y426), STAT 6 (Y641), STAT 5b (Y699), p53 (S46 and S15)s and Akt 1/2/3 (T308) were not significantly altered by TMZ or TMZ in the presence of EPA or DHA ( Figure 12 3. Discussion Each of the human glioma cells, when grown in the presence of 25 µm TMZ, had reduced cell numbers in comparison with the control, ranging from 28 to 57%. Each of the TMZ-resistant cells used in this study had a significantly increased IC50 for TMZ in comparison with the parent cell lines and, proving the acquisition of TMZ resistance; none of the TMZR cells had altered cell numbers in the presence of TMZ. The T98G and T98G TMZR cells had similar responses, showing the intrinsic TMZ resistance of this cell line, which is known to express unmethylated MGMT [ 29 24 25 26 30 31 32 33 18 34 In order to test the difference in survival ability between parent cells and their TMZR derived cells, a clonogenic assay was performed in the presence of EPA or DHA. In all of the TMZ-sensitive cells the presence of EPA or DHA significantly reduced the clonogenic capacity and the TMZR cells were also inhibited by the presence of EPA or DHA. When the assay was performed in the presence of TMZ, both the TMZ-sensitive and TMZR cells were again inhibited in the presence of EPA or DHA. In the case of the U138MG TMZR and U251 TMZR cells, DHA had a synergistic, enhancing effect on the inhibition of colony formation in the presence of TMZ. Similarly, in U251 TMZR, T98G TMZR, and A172 TMZR cells, EPA had a synergistic, enhancing effect on the inhibition of colony formation in the presence of TMZ. It is important to point out that many previous studies have shown that PUFAs such as EPA and DHA, at concentrations similar to those used in the present study, do not have adverse effects on normal brain cells such as neurons and astrocytes [ 35 36 37 38 39 40 These initial results showing inhibitory effects of EPA or DHA raised the question of whether the pretreatment of cells with EPA or DHA could interfere with cell adhesion, which is an important factor in cell survival. The effects of EPA or DHA were variable among cell lines, with A172 cells having increased adhesion in the presence of EPA, while, in contrast, EPA caused a significant reduction in adhesion in the U87MG, U138MG, and U251 cells. DHA caused a significant reduction in adhesion in the U138MG and U251 cells. These effects were considerably reduced in the TMZR cells, with EPA increasing adhesion in the A172 TMZR cells, EPA and DHA causing inhibition in the U87MG TMZR cells, and DHA causing inhibition in the U138MG TMZR cells. The variable effects of EPA or DHA on cell adhesion may be related to the heterogeneous expression of cell adhesion molecules, such as integrins, among the cell lines, which has previously been linked to radio sensitivity in several of these cell lines [ 41 42 43 The next step in the study was to identify possible effects of EPA or DHA on glioma cell migratory capacity. Using the transwell migration assay, we identified variable effects in the different cell lines with A172 cell migration inhibited by DHA, with a tendency of inhibition by EPA. In the presence of TMZ, both EPA and DHA caused significant inhibition of migration in the A172 cells. A172 TMZR cell migration was inhibited by DHA in the absence and presence of TMZ, while EPA showed a tendency to inhibit migration which did not reach statistical significance. The U87MG cells were unaffected by EPA or DHA under any condition, while the U87MG TMZR cells’ migration was only inhibited by EPA in the absence of TMZ. The U251 cells had significantly reduced migration with DHA in the absence of TMZ, while the U251 TMZR cells were inhibited by EPA in the absence of TMZ and inhibited by DHA in both the absence and presence of TMZ. T98G TMZR cell migration was significantly inhibited by both EPA and DHA in the absence and presence of TMZ. Overall, in the present study, DHA had a more inhibitory effect on migration then EPA. EPA has previously been reported to inhibit cell migration in various tumors including esophageal and breast tumors [ 44 45 45 46 47 48 49 To test the effects of EPA or DHA on metabolism, we measured lactate accumulation and glucose utilization in the culture medium. EPA and DHA caused significant reductions in lactate accumulation in the medium of U87MG cells in the absence and presence of TMZ. Similar effects were seen on lactate accumulation in the U87MG TMZR cells. When lactate production and glucose consumption were normalized by cell number, it was evident that EPA and DHA altered cell metabolism, with increases in glucose consumption and lactate production seen for various cell lines. The variable response to EPA or DHA among the different cell lines may be related to metabolic preferences. Previous studies have shown that the cell lines used in the present study have differing metabolic profiles and differing responses to substrate availability particularly in relation to glycolysis and fatty acid oxidation [ 50 51 52 53 54 11 27 28 55 Using U87MG and U87MG TMZR cells as a representative model we found significant increases in Nile red fluorescence in the presence of EPA or DHA, indicative of an increase in lipid droplet content in the cells, as previously reported in [ 23 11 27 28 56 57 16 58 The data obtained from the phosphokinase proteome assay pointed to several important changes in the protein phosphorylation state of U87MG TMZR cells in response to the presence of TMZ. Increases in phosphorylated ERK 1/2, GSK 3α/β, AMPK α1, Akt 1/2/3, PRAS40, CREB, HSP27, WNK1, and c-Jun were identified in the presence of TMZ. The cellular response in favor of survival and inhibition of cell death was evident, leading to effective resistance to TMZ. These changes and their role in intracellular signaling are summarized in Figure 13 Previous studies have shown that TMZ causes an increase in ERK phosphorylation in U87MG cells and C6 glioma cells [ 59 60 61 62 63 64 65 66 When U87MG TMZR cells in the presence of TMZ were exposed to EPA, the phosphorylation of GSK 3α/β, Akt 1/2/3, WNK1, and c-Jun was decreased. When U87MG TMZR cells in the presence of TMZ were exposed to DHA, the phosphorylation of ERK 1/2, GSK 3α/β, AMPK α1, Akt 1/2/3, and WNK1 was decreased. However, when U87MG TMZR cells in the presence of TMZ were exposed to DHA, the phosphorylation of FAK, HSP27, and c-Jun was increased. When U87MG TMZR cells were exposed to TMZ and EPA or TMZ and DHA, HSP60 expression was increased in comparison with U87MG TMZR alone. Previous studies have reported that 50 µm DHA caused a significant reduction in p-Akt (S473) in U87MG cells [ 16 These data show that both EPA and DHA inhibit the phosphorylation of several proteins which have increased phosphorylation in U87MG TMZR cells in response to TMZ. Together with the phosphorylation profiles in various glioma cells mentioned previously, our data support the hypothesis that these proteins play an important role in the development of TMZR in these cells and that the presence of EPA or DHA can reduce TMZR by altering their phosphorylation profiles. Despite studies showing that EPA and DHA improve the efficacy of chemotherapies in several tumor types, there is a paucity of data showing similar effects in relation to TMZ. There are limitations to the study which should be addressed in the future, including by longer periods of exposure to TMZ, which may allow the identification of higher rates of apoptosis and of senescence occurring in the cells. Also, since cell counts were determined, bromodeoxyuridine incorporation assays would permit further analysis of the proliferative rate of the cells under the different experimental conditions. Finally, the use of patient-derived primary cells in 3D culture will also be an important approach in future studies. Despite its limitations, the present study highlights the alterations which occur in TMZR cells when exposed to EPA or DHA and builds on the findings previously reported in the U87MG TMZR model, where these PUFAs were shown to interfere with drug resistance, in part through modulation of ABC transporter proteins [ 23 Future studies will investigate the downstream signaling mechanisms involved in PUFA modulation of TMZ resistance in established glioma cells and in patient-derived primary cells in both 2D and 3D culture conditions. In vivo glioma models where TMZ and PUFAs can be administered concomitantly either orally or by osmotic pump infusion will also be used to test combination therapies, as previously reported in GLA-treated glioma models [ 18 67 4. Materials and Methods 4.1. Cell Culture A172, U87MG, U138MG, U251, and T98G human glioblastoma cells were cultured in DMEM:F12 (Dulbecco’s Modified Eagle Medium and F12—Gibco Inc., Thermo Fisher Scientific, Grand Island, NY, USA) 1:1, supplemented with 10% ( v v 2 2 4.2. Establishing the Temozolomide Drug-Resistant Cell Lines Cells were grown in culture medium, as detailed in Section 4.1 4 68 69 70 The treatment scheme was as follows: 0–7 days, 1 μm; 8–14 days, 2 μm; 15–21 days, 4 μm; 22–28 days, 8 μm; 29–35 days, 10 μm; 36–45 days, 15 μm; 46–60 days, 20 μm; 61–90 days, 25 μm [ 10 50 23 50 4.3. Cell Counts Assay Control and TMZR cells were seeded at 3 × 10 4 27 4.4. Clonogenic Assay Control or TMZR cells were seeded in 12-well plates at a concentration of 1 × 10 2 4.5. Adhesion and Cell Spreading Assay Control or TMZR cells were cultured in the presence of 100 µm EPA or DHA for 72 h before being collected and seeded in 24-well plates at concentrations of 1 × 10 4 4.6. Transwell Migration Assay The transwell migration assay was performed using a 24-well plate with 8.0 μm pore polycarbonate membrane transwell inserts (Corning), as previously described [ 71 72 4 2 4.7. Lactate and Glucose Assay Cells were seeded at 3 × 10 4 11 27 28 + + + + 4.8. Nile Red Staining of Neutral Lipids Cells were seeded at 3 × 10 4 28 73 After following the same treatment for 72 h, live cells were stained with Nile red, washed ×3 with PBS, resuspended in PBS and fluorescence measured at λ ext. em. 4.9. Propidium Iodide Staining Cells were cultured as described in Section 4.8 ext. em. 4.10. Dihydroethidium Staining Cells were cultured as described in Section 4.8 ext. em. 4.11. Acridine Orange Staining Cells were cultured as described in Section 4.8 ext. em. ext. em. Cells were cultured as described in Section 4.8 Cells were cultured as described in Section 4.8 4.12. DAPI Staining Cells were cultured as described in Section 4.8 4.13. Proteome Profiler Antibody Array The human phospho-kinase assay was carried out following manufacturer’s instructions (R&D Systems, Minneapolis, MN, USA). After 72 h treatment with EPA or DHA in the presence of TMZ, U87MG TMZR cells were collected and diluted to produce a lysate containing 1 × 10 7 4.14. Statistical Analysis All data were plotted and analyzed using GraphPad Prism 10 (GraphPad Prism 10 Software, San Diego, CA, USA). Values express the arithmetic mean ± standard error. Analysis between two groups was performed with Student’s t p Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26188759/s1 Author Contributions Both authors, J.A.S. and A.C., developed this project. A.C. directed, revised, and edited the manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Access to original data can be provided upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript, or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: CNS Central nervous system DHA Docosahexaenoic acid GLA Gamma-linolenic acid EPA Eicosapentaenoic acid GBM Glioblastoma IDH Isocitrate dehydrogenase MDR Multiple drug resistance MGMT O6-methylguanine-DNA methyltransferase PUFA Polyunsaturated fatty acids TMZ Temozolomide TMZR Temozolomide resistant References 1. Louis D.N. WHO Classification of Tumors of the Central Nervous System 5th ed. IARC Lyon, France 2021 2. Louis D.N. Perry A. Wesseling P. Brat D.J. Cree I.A. Figarella-Branger D. Hawkins C. Ng H.K. Pfister S.M. Reifenberger G. The 2021 WHO Classification of Tumors of the Central Nervous System: A summary Neuro-Oncology 2021 23 1231 1251 10.1093/neuonc/noab106 34185076 PMC8328013 3. Ostrom Q.T. Cioffi G. Waite K. Kruchko C. Barnholtz-Sloan J.S. CBTRUS Statistical Report: Primary Brain and Other Central Nervous System Tumors Diagnosed in the United States in 2014–2018 Neuro-Oncology 2021 23 (Suppl. S3) iii1 iii105 10.1093/neuonc/noab200 34608945 PMC8491279 4. Vartanian A. Singh S.K. Agnihotri S. Jalali S. Burrell K. Aldape K.D. Zadeh G. GBM’s multifaceted landscape: Highlighting regional and microenvironmental heterogeneity Neuro-Oncology 2014 16 1167 1175 10.1093/neuonc/nou035 24642524 PMC4136895 5. Giese A. Bjerkvig R. Berens M. Westphal M. Cost of migration: Invasion of malignant gliomas and implications for treatment J. Clin. Oncol. 2003 21 1624 1636 10.1200/JCO.2003.05.063 12697889 6. Okolie O. Bago J.R. Schmid R.S. Irvin D.M. Bash R.E. Miller C.R. Hingtgen S.D. Reactive astrocytes potentiate tumor aggressiveness in a murine glioma resection and recurrence model Neuro-Oncology 2016 18 1622 1633 10.1093/neuonc/now117 27298311 PMC5791515 7. Choi C.H. ABC transporters as multidrug resistance mechanisms and the development of chemosensitizers for their reversal Cancer Cell Int. 2005 5 30 10.1186/1475-2867-5-30 16202168 PMC1277830 8. Perazzoli G. Prados J. Ortiz R. Caba O. Cabeza L. Berdasco M. Gónzalez B. Melguizo C. Alonso M.M. Temozolomide Resistance in Glioblastoma Cell Lines: Implication of MGMT, MMR, P-Glycoprotein and CD133 Expression PLoS ONE 2015 10 e0140131 10.1371/journal.pone.0140131 26447477 PMC4598115 9. Stavrovskaya A.A. Cellular mechanisms of multidrug resistance of tumor cells Biochemistry 2016 81 91 100 10702644 10. Colquhoun A. Mechanisms of action of eicosapentaenoic acid in bladder cancer cells in vitro: Alterations in mitochondrial metabolism, reactive oxygen species generation and apoptosis induction J. Urol. 2009 181 1885 1893 10.1016/j.juro.2008.11.092 19237174 11. Colquhoun A. Lipids, Mitochondria and Cell Death: Implications in Neuro-oncology Mol. Neurobiol. 2010 42 76 88 10.1007/s12035-010-8134-4 20429043 12. Das M. Das S. Identification of cytotoxic mediators and their putative role in the signaling pathways during docosahexaenoic acid (DHA)-induced apoptosis of cancer cells Apoptosis 2016 21 1408 1421 10.1007/s10495-016-1298-2 27704276 13. Benadiba M. Miyake J.A. Colquhoun A. Gamma-linolenic Acid Alters Ku80, E2F1, and Bax Expression and Induces Micronucleus Formation in C6 Glioma Cells In Vitro IUBMB Life 2009 61 244 251 10.1002/iub.154 19180667 14. Zahid S. El Dahan M.S. Iehl F. Fernandez-Varela P. Le Du M.-H. Ropars V. Charbonnier J.B. The Multifaceted Roles of Ku70/80 Int. J. Mol. Sci. 2021 22 4134 10.3390/ijms22084134 33923616 PMC8073936 15. Yuan Y. Shah N. Almohaisin M.I. Saha S. Lu F. Assessing fatty acid-induced lipotoxicity and its therapeutic potential in glioblastoma using stimulated Raman microscopy Sci. Rep. 2021 11 7422 10.1038/s41598-021-86789-9 33795756 PMC8016949 16. Kim S. Jing K. Shin S. Jeong S. Han S.-H. Oh H. Yoo Y.-S. Han J. Jeon Y.-J. Heo J.-Y. ω3-polyunsaturated fatty acids induce cell death through apoptosis and autophagy in glioblastoma cells: In vitro and in vivo Oncol. Rep. 2018 39 239 246 10.3892/or.2017.6101 29192322 17. Faragó N. Fehér L.Z. Kitajka K. Das U.N. Puskás L.G. MicroRNA profile of polyunsaturated fatty acid treated glioma cells reveal apoptosis-specific expression changes Lipids Health Dis. 2011 10 173 10.1186/1476-511X-10-173 21961478 PMC3203338 18. Miyake J.A. Benadiba M. Colquhoun A. Gamma-linolenic acid inhibits both tumour cell cycle progression and angiogenesis in the orthotopic C6 glioma model through changes in VEGF, Flt1, ERK1/2, MMP2, cyclin D1, pRb, p53 and p27 protein expression Lipids Health Dis. 2009 8 8 10.1186/1476-511X-8-8 19292920 PMC2661078 19. Soni S. Torvund M. Mandal C.C. Omega-3 Fatty Acid Treatment Combined with Chemotherapy to Prevent Toxicity, Drug Resistance, and Metastasis in Cancer Curr. Drug Targets 2022 23 574 596 10.2174/1389450122666210901121935 34488585 20. Wang F. Bhat K. Doucette M. Zhou S. Gu Y. Law B. Liu X. Wong E.T. Kang J.X. Hsieh T.C. Docosahexaenoic Acid (DHA) Sensitizes Brain Tumor Cells to Etoposide-Induced Apoptosis Curr. Mol. Med. 2011 11 503 511 10.2174/156652411796268740 21663587 PMC3206959 21. Harvey K.A. Xu Z. Saaddatzadeh M.R. Wang H. Pollok K. Cohen-Gadol A.A. Siddiqui R.A. Enhanced anticancer properties of lomustine in conjunction with docosahexaenoic acid in glioblastoma cell lines J. Neurosurg. 2015 122 547 556 10.3171/2014.10.JNS14759 25526274 22. Huang T. Chen X. Liu C. Gao Y. Hu W. Eicosapentaenoic acid enhances the sensitivity of glioma cell line U87 to temozolomide via inhibiting endoplasmic reticulum stress Chin. J. Clin. Nutr. 2017 25 361 365 23. Silva J.A. Colquhoun A. Effect of Polyunsaturated Fatty Acids on Temozolomide Drug-Sensitive and Drug-Resistant Glioblastoma Cells Biomedicines 2023 11 779 10.3390/biomedicines11030779 36979758 PMC10045395 24. Rosso L. Brock C.S. Gallo J.M. Saleem A. Price P.M. Turkheimer F.E. Aboagye E.O. A New model for prediction of drug distribution in tumor and normal tissues: Pharmacokinetics of temozolomide in glioma patients Cancer Res. 2009 69 120 127 10.1158/0008-5472.CAN-08-2356 19117994 25. Ostermann S. Csajka C. Buclin T. Leyvraz S. Lejeune F. Decosterd L.A. Stupp R. Plasma and Cerebrospinal Fluid Population Pharmacokinetics of Temozolomide in Malignant Glioma Patients Clin. Cancer Res. 2004 10 3728 3736 10.1158/1078-0432.CCR-03-0807 15173079 26. Beltzig L. Schwarzenbach C. Leukel P. Frauenknecht K.B.M. Sommer C. Tancredi A. Hegi M.E. Christmann M. Kaina B. Senescence Is the Main Trait Induced by Temozolomide in Glioblastoma Cells Cancers 2022 14 2233 10.3390/cancers14092233 35565362 PMC9102829 27. Colquhoun A. Schumacher R.I. γ-Linolenic acid and eicosapentaenoic acid induce modifications in mitochondrial metabolism, reactive oxygen species generation, lipid peroxidation and apoptosis in Walker 256 rat carcinosarcoma cells Biochim. Biophys. Acta 2001 1533 207 219 10.1016/S1388-1981(01)00136-6 11731331 28. Ramos K.L. Colquhoun A. Protective role of glucose-6-phosphate dehydrogenase activity in the metabolic response of C6 rat glioma cells to polyunsaturated fatty acid exposure Glia 2003 43 149 166 10.1002/glia.10246 12838507 29. Huang H. Lin H. Zhang X. Li J. Resveratrol reverses temozolomide resistance by downregulation of MGMT in T98G glioblastoma cells by the NF-κB-dependent pathway Oncol. Rep. 2012 27 2050 2056 10.3892/or.2012.1715 22426504 30. Braeckman R.A. Stirtan W.G. Soni P.N. Pharmacokinetics of Eicosapentaenoic Acid in Plasma and Red Blood Cells After Multiple Oral Dosing With Icosapent Ethyl in Healthy Subjects Clin. Pharmacol. Drug Dev. 2013 3 101 108 10.1002/cpdd.84 26097787 PMC4467252 31. Moloudizargari M. Mortaz E. Asghari M.H. Adcock I.M. Redegeld F.A. Garssen J. Effects of the polyunsaturated fatty acids, EPA and DHA, on hematological malignancies: A systematic review Oncotarget 2018 9 11858 11875 10.18632/oncotarget.24405 29545942 PMC5837752 32. von Schacky C. Importance of EPA and DHA Blood Levels in Brain Structure and Function Nutrients 2021 13 1074 10.3390/nu13041074 33806218 PMC8066148 33. Rapaport S. Ramadan E. Basselin M. Docosahexaenoic acid (DHA) incorporation into the brain from plasma, as an in vivo biomarker of brain DHA metabolism and neurotransmission Prostaglandins Other Lipid Mediat. 2011 96 109 113 10.1016/j.prostaglandins.2011.06.003 21704722 PMC3202024 34. Nasrollahzadeh J. Siassi F. Doosti M. Eshraghian M.R. Shokri F. Modarressi M.H. Mohammadi-Asl J. Abdi K. Nikmanesh A. Karimian S.M. The influence of feeding linoleic, gamma-linolenic and docosahexaenoic acid rich oils on rat brain tumor fatty acids composition and fatty acid binding protein 7 mRNA expression Lipids Health Dis. 2008 7 45 10.1186/1476-511X-7-45 19014610 PMC2605445 35. Yassine H.N. Croteau E. Rawat V. Hibbeln J.R. Rapoport S.I. Cunnane S.C. Umhau J.C. DHA brain uptake and APOE4 status: A PET study with [1-11C]-DHA Alzheimer’s Res. Ther. 2017 9 23 10.1186/s13195-017-0250-1 28335828 PMC5364667 36. Zhang Y.P. Brown R.E. Zhang P.-C. Zhao Y.-T. Ju X.-H. Song C. DHA, EPA and their combination at various ratios differently modulated Aβ25-35-induced neurotoxicity in SH-SY5Y cells Prostaglandins Leukot. Essent. Fat. Acids 2018 136 85 94 10.1016/j.plefa.2017.07.003 28778752 37. Banaszak M. Dobrzyńska M. Kawka A. Górna I. Woźniak D. Przysławski J. Drzymała-Czyż S. Role of Omega-3 fatty acids eicosapentaenoic (EPA) and docosahexaenoic (DHA) as modulatory and anti-inflammatory agents in noncommunicable diet-related diseases—Reports from the last 10 years Clin. Nutr. ESPEN 2024 63 240 258 10.1016/j.clnesp.2024.06.053 38980796 38. Joardar A. Sen A.K. Das S. Docosahexaenoic acid facilitates cell maturation and beta-adrenergic transmission in astrocytes J. Lipid Res. 2006 47 571 581 10.1194/jlr.M500415-JLR200 16352524 39. Champeil-Potokar G. Hennebelle M. Latour A. Vancassel S. Denis I. Docosahexaenoic acid (DHA) prevents corticosterone-induced changes in astrocyte morphology and function J. Neurochem. 2016 136 1155 1167 10.1111/jnc.13510 26709611 40. Zgorzynska E. Dziedzic B. Markiewicz M. Walczewska A. Omega-3 PUFAs Suppress IL-1β-Induced Hyperactivity of Immunoproteasomes in Astrocytes Int. J. Mol. Sci. 2021 22 5410 10.3390/ijms22115410 34063751 PMC8196670 41. Serafim R.B. da Silva P. Cardoso C. Di Cristofaro L.F.M. Netto R.P. de Almeida R. Navegante G. Storti C.B. de Sousa J.F. de Souza F.C. Expression Profiling of Glioblastoma Cell Lines Reveals Novel Extracellular Matrix-Receptor Genes Correlated With the Responsiveness of Glioma Patients to Ionizing Radiation Front. Oncol. 2021 11 668090 10.3389/fonc.2021.668090 34211843 PMC8240593 42. Delamarre E. Taboubi S. Mathieu S. Bérenguer C. Rigot V. Lissitzky J.-C. Figarella-Branger D. Ouafik L. Luis J. Expression of Integrin 6 1 Enhances Tumorigenesis in Glioma Cells Am. J. Pathol. 2009 175 844 855 10.2353/ajpath.2009.080920 19574430 PMC2716979 43. Ellert-Miklaszewska A. Poleszak K. Pasierbinska M. Kaminska B. Integrin Signaling in Glioma Pathogenesis: From Biology to Therapy Int. J. Mol. Sci. 2020 21 888 10.3390/ijms21030888 32019108 PMC7037280 44. Kubota H. Hirai T. Yamauchi A. Ogo A. Matsumoto H. Ueno T. Inhibitory Effect of Eicosapentaenoic Acid on the Migration of the Esophageal Squamous Cell Carcinoma Cell Line TE-1 Anticancer Res. 2020 40 5043 5048 10.21873/anticanres.14507 32878792 45. Rahman M. Veigas J.M. Williams P.J. Fernandes G. DHA is a more potent inhibitor of breast cancer metastasis to bone and related osteolysis than EPA Breast Cancer Res. Treat. 2013 141 341 352 10.1007/s10549-013-2703-y 24062211 PMC3839302 46. Jiang Y.L. Li X. Tan Y.-W. Fang Y.-J. Liu K.-Y. Wang Y.-F. Ma T. Ou Q.-J. Zhang C.-X. Docosahexaenoic acid inhibits the invasion and migration of colorectal cancer by reversing EMT through the TGF-β1/Smad signaling pathway Food Funct. 2024 15 9420 9433 10.1039/d4fo02346c 39189524 47. Javadian M. Shekari N. Zangbar M.S.S. Mohammadi A. Mansoori B. Maralbashi S. Shanehbandi D. Baradaran B. Darabi M. Kazemi T. Docosahexaenoic acid suppresses migration of triple-negative breast cancer cell through targeting metastasis-related genes and microRNA under normoxic and hypoxic conditions J. Cell. Biochem. 2020 121 2416 2427 10.1002/jcb.29464 31713924 48. Yun E.J. Song K.-S. Shin S. Kim S. Heo J.-Y. Kweon G.-R. Wu T. Park J.-I. Lim K. Docosahexaenoic acid suppresses breast cancer cell metastasis by targeting matrix-metalloproteinases Oncotarget 2016 7 49961 49971 10.18632/oncotarget.10266 27363023 PMC5226561 49. Xu X. Wang Y. Choi W.-S. Sun X. Godbout R. Super resolution microscopy reveals DHA-dependent alterations in glioblastoma membrane remodelling and cell migration Nanoscale 2021 13 9706 9722 10.1039/D1NR02128A 34018532 50. Kim J. Han J. Jang Y. Kim S.J. Lee M.J. Ryu M.J. Kweon G.R. Heo J.Y. High-capacity glycolytic and mitochondrial oxidative metabolisms mediate the growth ability of glioblastoma Int. J. Oncol. 2015 47 1009 1016 10.3892/ijo.2015.3101 26202438 51. Zhou Y. Zhou Y. Shingu T. Feng L. Chen Z. Ogasawara M. Keating M.J. Kondo S. Huang P. Metabolic Alterations in Highly Tumorigenic Glioblastoma Cells J. Biol. Chem. 2011 286 32843 32853 10.1074/jbc.M111.260935 21795717 PMC3173179 52. Cheng S.-Y. Chen N.-F. Wen Z.-H. Yao Z.-K. Tsui K.-H. Kuo H.-M. Chen W.-F. Glutathione S-Transferase M3 Is Associated with Glycolysis in Intrinsic Temozolomide-Resistant Glioblastoma Multiforme Cells Int. J. Mol. Sci. 2021 22 7080 10.3390/ijms22137080 34209254 PMC8268701 53. Martins F. van der Kellen D. Gonçalves L.G. Serpa J. Metabolic Profiles Point Out Metabolic Pathways Pivotal in Two Glioblastoma (GBM) Cell Lines, U251 and U-87MG Biomedicines 2023 11 2041 10.3390/biomedicines11072041 37509679 PMC10377067 54. Caragher S. Miska J. Shireman J. Park C.H. Muroski M. Lesniak M.S. Ahmed A.U. Temozolomide Treatment Increases Fatty Acid Uptake in Glioblastoma Stem Cells Cancers 2020 2 3126 10.3390/cancers12113126 PMC7693784 33114573 55. Katsnelson G. Ceddia R.B. Docosahexaenoic and eicosapentaenoic fatty acids differentially regulate glucose and fatty acid metabolism in L6 rat skeletal muscle cells Am. J. Physiol. Cell Physiol. 2020 319 C1120 C1129 10.1152/ajpcell.00304.2020 32966124 56. Hari A. Vegi N. Das U. Arachidonic and eicosapentaenoic acids induce oxidative stress to suppress proliferation of human glioma cells Arch. Med. Sci. 2020 16 974 983 10.5114/aoms.2020.92293 32542101 PMC7286332 57. Campos-Sandoval J.A. Gómez-García M.C. Santos-Jiménez J.d.L. Matés J.M. Alonso F.J. Márquez J. Antioxidant responses related to temozolomide resistance in glioblastoma Neurochem. Int. 2021 149 105136 10.1016/j.neuint.2021.105136 34274381 58. Clark C. Behrooz A.B. Cordani M. Shojaei S. Ghavami S. Assessing Autophagy Flux in Glioblastoma Temozolomide Resistant Cells Methods Mol. Biol. 2025 2879 225 238 10.1007/7651_2024_571 39331341 59. Zeng H. Yang Z. Xu N. Liu B. Fu Z. Lian C. Guo H. Connective tissue growth factor promotes temozolomide resistance in glioblastoma through TGF-β1-dependent activation of Smad/ERK signaling Cell Death Dis. 2017 8 e2885 10.1038/cddis.2017.248 28617438 PMC5520906 60. Wang Y. Gao S. Wang W. Liang J. Temozolomide inhibits cellular growth and motility via targeting ERK signaling in glioma C6 cells Mol. Med. Rep. 2016 14 5732 5738 10.3892/mmr.2016.5964 27878252 61. Yi G.Z. Liu Y.-W. Xiang W. Wang H. Chen Z.-Y. Xie S.-D. Qi S.-T. Akt and β-catenin contribute to TMZ resistance and EMT of MGMT negative malignant glioma cell line J. Neurol. Sci. 2016 367 101 106 10.1016/j.jns.2016.05.054 27423571 62. Sun S. Wang X. Xu X. Di H. Du J. Xu B. Wang Q. Wang J. MiR-433-3p suppresses cell growth and enhances chemosensitivity by targeting CREB in human glioma Oncotarget 2017 8 5057 5068 10.18632/oncotarget.13789 27926502 PMC5354892 63. Kıyga E. Adıgüzel Z. Uçar E.Ö. Temozolomide increases heat shock proteins in extracellular vesicles released from glioblastoma cells Mol. Biol. Rep. 2022 49 8701 8713 10.1007/s11033-022-07714-5 35752701 64. Zhu W. Begum G. Pointer K. Clark P.A. Yang S.-S. Lin S.-H. Kahle K.T. Kuo J.S. Sun D. WNK1-OSR1 kinase-mediated phospho-activation of Na+-K+-2Cl- cotransporter facilitates glioma migration Mol. Cancer 2014 13 31 10.1186/1476-4598-13-31 24555568 PMC3936893 65. Luo L. Wang J. Ding D. Hasan N. Yang S.-S. Lin S.-H. Schreppel P. Sun B. Yin Y. Erker T. Role of NKCC1 Activity in Glioma K+ Homeostasis and Cell Growth: New Insights With the Bumetanide-Derivative STS66 Front. Physiol. 2020 11 911 10.3389/fphys.2020.00911 32848856 PMC7413028 66. Munoz J.L. Rodriguez-Cruz V. Greco S.J. Ramkissoon S.H. Ligon K.L. Rameshwar P. Temozolomide resistance in glioblastoma cells occurs partly through epidermal growth factor receptor-mediated induction of connexin 43 Cell Death Dis. 2014 5 e1145 10.1038/cddis.2014.111 24675463 PMC3973225 67. Miyake J.A. Benadiba M. Ribeiro G. Silva D.D. Colquhoun A. Novel Ruthenium—Gamma-linolenic Acid Complex Inhibits C6 Rat Glioma Cell Proliferation In Vitro and in the Orthotopic C6 Model In Vivo After Osmotic Pump Infusion Anticancer Res. 2014 34 1901 1912 24692725 68. Yoshino A. Ogino A. Yachi K. Ohta T. Fukushima T. Watanabe T. Katayama Y. Okamoto Y. Naruse N. Sano E. Gene expression profiling predicts response to temozolomide in malignant gliomas Int. J. Oncol. 2010 36 1367 1377 10.3892/ijo_00000621 20428759 69. Barazzuol L. Jena R. Burnet N.G. Meira L.B. Jeynes J.C.G. Kirkby K.J. Kirkby N.F. Evaluation of poly (ADP-ribose) polymerase inhibitor ABT-888 combined with radiotherapy and temozolomide in glioblastoma Radiat. Oncol. 2013 8 65 10.1186/1748-717X-8-65 23510353 PMC3622565 70. Catanzaro D. Milani G. Bozza A. Bernardi M. Chieregato K. Menarin M. Merlo A. Celli P. Belli R. Peroni D. Selective cell cycle arrest in glioblastoma cell lines by quantum molecular resonance alone or in combination with temozolomide Br. J. Cancer 2022 127 824 835 10.1038/s41416-022-01865-9 35715634 PMC9427848 71. Souza F.D.C. Ferreira M.T. Colquhoun A. Influence of Lipoxygenase Inhibition on Glioblastoma Cell Biology Int. J. Mol. Sci. 2020 21 8395 10.3390/ijms21218395 33182324 PMC7664864 72. Ferreira M.T. Miyake J.A. Gomes R.N. Feitoza F. Stevannato P.B. da Cunha A.S. Serachi F.d.O. Panagopoulos A.T. Colquhoun A. Cyclooxygenase Inhibition Alters Proliferative, Migratory, and Invasive Properties of Human Glioblastoma Cells In Vitro Int. J. Mol. Sci. 2021 22 4297 10.3390/ijms22094297 33919029 PMC8122446 73. Ribeiro G. Benadiba M. Silva D.d.O. Colquhoun A. The novel ruthenium-γ-linolenic complex [Ru 2 4 Cell Biochem. Funct. 2010 28 15 23 10.1002/cbf.1626 19927275 Figure 1 Effect of 100 µm EPA or DHA on cell number after 72 h in the presence or absence of 25 µm temozolomide (TMZ) for control or TMZ-resistant (TMZR) cells. ( A B C D E N p p p p p Figure 2 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on the clonogenic capacity of control or TMZ-resistant cells. Colonies were counted using Image J software (version 1.54p). Data are presented as mean ± SEM, N p p p p p Figure 3 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on adhesion and spreading of A172 and A172 TMZR cells. Images and cell area calculations are after 60 min adhesion. Data are presented as mean ± SEM, N p p p p Figure 4 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on adhesion of control or TMZ-resistant cells. ( A B C D E F G N p p p p p Figure 5 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on migration of control or TMZ-resistant cells. ( A C E G B D F H N p p p Figure 6 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on migration of control or TMZ-resistant cells. ( A C E B D F N p p p Figure 7 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on lactate concentration in the medium of control or TMZ-resistant cells. ( A B C D E F G H N p p p p p Figure 8 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on lactate production and glucose consumption of control or TMZ-resistant cells. Lactate production for ( A B C D I J K L E F G H M N O P N p p p p p Figure 9 Effect of 100 µm EPA or DHA in the absence or presence of 25 µm temozolomide on lactate production and glucose consumption of control or TMZ-resistant cells. Lactate production for ( A B C D I J K L E F G H M N O P N p p p Figure 10 Effect of 100 µm EPA or DHA on Nile red, propidium iodide, dihydroethidium and acridine orange incorporation of U87MG or U87MG TMZR cells. ( A B C D E F G H I J H J N p p p Figure 11 Effect of 100 µm EPA or DHA on acridine orange incorporation and DAPI staining of control or TMZ-resistant cells. ( A B C N p p p p p Figure 12 Effect of 100 µm EPA or DHA on phosphoprotein profiles of U87MG TMZR cells in the presence of 25 µm temozolomide. ( A B C D E F G H I J Supplementary Figure S2 N p p p p p Figure 13 Outline of phosphoproteins significantly altered by the presence of temozolomide (TMZ) in U87MG TMZR cells. The proteins in green are activated when phosphorylated—CREB, ERK, Akt, WNK, HSP27, PRAS40. The protein in red, GSK3β, is inactivated when phosphorylated. Pathways influenced by these proteins are related to cell survival, resistance to apoptosis, control of cell migration, and chemotherapy treatment resistance. Akt—Akt kinase or protein kinase B; ATP—adenosine triphosphate; cAMP—cyclic adenosine monophosphate; c-JUN—cellular homolog of viral JUN; CREB—cAMP response element binding protein; Epac—exchange protein activated by cAMP; ERK—extracellular signal regulated protein; FAK—focal adhesion kinase; GPCR—G protein coupled receptor; GSK3β—glycogen synthase kinase 3 beta; HSP27—heat shock protein 27; INT—integrin; JNK—JUN terminal kinase; MEK—mitogen-activated protein kinase kinase; mTORC1 or 2—mammalian target of rapamycin complex 1 or 2; PDK1—phosphoinositide-dependent kinase 1; PI3K—phosphoinostide-3-kinase; PIP 3 ",
  "metadata": {
    "Title of this paper": "The novel ruthenium-γ-linolenic complex [Ru",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469626/"
  }
}