{
  "title": "Paper_820",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472719 PMC12472719.1 12472719 12472719 41011176 10.3390/ph18091304 pharmaceuticals-18-01304 1 Article From Gene Networks to Therapeutics: A Causal Inference and Deep Learning Approach for Drug Discovery https://orcid.org/0000-0003-3996-992X Ghandikota Sudhir Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization 1 https://orcid.org/0000-0002-4881-7752 Jegga Anil G. Conceptualization Methodology Investigation Resources Data curation Writing – review & editing Supervision 1 2 * Zhao Yunjie Academic Editor 1 sudhir.ghandikota@cchmc.org 2 * anil.jegga@cchmc.org 30 8 2025 9 2025 18 9 497460 1304 11 7 2025 27 8 2025 29 8 2025 30 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods Results ITM2C, PRTFDC1, CRABP2, CPNE7, NMNAT2 Conclusions drug repurposing drug repositioning drug discovery deep learning mediation analysis network analysis idiopathic pulmonary fibrosis This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Target selection and engagement is a crucial first step in drug discovery, and a significant percentage of the clinical trial failures are linked to incorrect target selection and poor target engagement [ 1 Conventional drug discovery approaches are mostly based on a one-drug–one-gene paradigm [ 2 3 4 3 2 5 6 6 We present a bioinformatic methodology that combines network analysis, statistical mediation models, and DL-based small-molecule compound screening frameworks for therapeutic drug discovery (See Materials and Methods). Our methodology starts with analyzing one (or more) transcriptomic datasets, converting them into gene co-expression networks, and applying a network analysis framework [ 7 8 9 2 Figure 1 10 To demonstrate the utility of our methodology, we used idiopathic pulmonary fibrosis (IPF) as a disease case study. IPF is a severe fibrotic lung disease characterized by chronic, progressive scarring, and destruction of the lung parenchyma, often requiring a lung transplant in advanced cases [ 11 12 13 14 In this study, we applied our methodology and identified several novel candidate causal genes potentially important in the progression of IPF. Several of these were found to be significantly correlated with the forced vital capacity (FVC) and diffusing capacity of lungs for carbon monoxide (DLCO) lung function traits. Furthermore, we ran machine learning models to evaluate whether these mediator genes can predict the phenotype status using independent study cohorts. Finally, we ran a DL-based compound screening method to identify small-molecule candidates that can potentially modulate the IPF causal signature. 2. Results 2.1. Transcriptomic Datasets In our IPF case study, we implemented a network analysis framework on a gene co-expression network, layered with a statistical mediation analysis. For constructing the gene network, we used RNA-seq data from whole lung tissues of 103 IPF samples and 103 healthy controls [ 15 GSE124685 16 GSE213001 17 Table 1 18 19 2.2. Correlated Gene Modules Gene expression profiles from whole lung tissues ( GSE150910 7 voom 20 Figure 2 p File S1 greenyellow Figure 2 greenyellow, brown, yellow, red, purple) Figure 2 2.3. Candidate Causal Genes in IPF We implemented mediation analysis among the phenotype, the module, and the module genes using the CWGCNA framework [ 9 File S2 l o g 2 F C > 0.58 p Figure 3 p File S2 21 22 23 Furthermore, we identified a significant ( p 24 File S2 2.4. Candidate Genes Enriched in Pro-Fibrotic Niches To identify potential disease-driving mediator candidates localized in the lung tissue, we utilized a spatial transcriptomics study in IPF [ 25 l o g 2 F C > 0.25 p File S3 26 27 Additionally, we identified 24 genes ( p 25 p + File S3 p File S3 2.5. Mediator Genes Associated with IPF Severity Next, to identify candidate causal genes associated with severe IPF phenotypes, we intersected the significant mediator candidates with the upregulated genes ( l o g 2 F C > 0.58 p GSE124685 16 p −13 p −14 p −16 File S4 2.6. Biomarker Candidates in IPF To assess the predictive ability of the mediator candidate genes and identify potential biomarker candidates in IPF, we ran generalized linear models (GLMs) via penalized maximum likelihood [ 28 29 Table 1 Table 2 Figure 4 30 31 We also trained GLM models to distinguish severe and advanced IPF samples from controls ( Figure 4 Table 2 Table 2 File S5 2.7. Small-Molecule Compounds Targeting the Causal Genes Finally, we used a modified version of the DeepCE [ 2 Section 2.3 p File S6 Table 3 Among them, the compound Telaglenastat (CB-839), a glutaminase 1 (GLS1) inhibitor, was significantly negatively correlated with our causal signature in five out of the seven cell lines. This compound has been shown to be therapeutically efficacious in treating both bleomycin- and transforming growth factor-β1-induced pulmonary fibrosis in mice [ 32 32 33 34 35 36 37 38 39 40 File S6 2.8. Causal Candidate Genes and Small-Molecule Targets To understand the potential mechanism of actions (MOAs) associated with some of the top small-molecule compound hits explicitly to IPF, we computed functional enrichment analysis by combining the 145 mediator candidate genes and drug targets ( Figure 5 41 File S7 −6 −6 −5 42 −3 −3 −8 43 Furthermore, to illustrate the connectivity (protein–protein interactions—PPIs) between the mediator genes and the small-molecule targets, we also constructed a joint interactome ( Figure S2 Figure S2 https://toppgene.cchmc.org/ 44 File S7 45 3. Discussion In this study, we presented a therapeutic target and compound discovery approach by combining unsupervised network analysis, statistical mediation analysis, and Deep Learning (DL) models. We applied this framework to IPF and identified 16 non-overlapping gene modules, including 7 candidate modules significantly upregulated in the phenotype. From these modules, we identified 145 mediator gene candidates with significant mediation effects, after adjusting for confounders. These genes are hypothesized to cause 9 The significant mediator genes were used as the phenotype signature for compound screening to identify small-molecule candidates that can potentially reverse the IPF phenotypic effects. By using Spearman rank-order correlations between the IPF signature and drug perturbation profiles, we identified more than 120 compounds with significant negative correlations with the IPF signature across different cell lines. Several of our identified candidate drugs have been reported to have therapeutic (antifibrotic) effects in in vitro and animal models. Functional enrichment analysis has shown several IPF-relevant pathways and processes shared between the causal mediator genes and the targets of the top hit small molecules. Further validation studies centered around some of the other small-molecule candidates are warranted to identify new therapeutic strategies for attenuating or reversing lung fibrosis. Phenotype-based compound screening is generally considered systematic and comprehensive as it utilizes drug-induced gene expression profiles as readouts [ 2 2 19 https://doi.org/10.5281/zenodo.16935145 Our approach does hold certain limitations. Firstly, our mechanism-driven compound screening approach is highly dependent on the input signature and the quality of the gene expression profiles used in the analysis. Irrelevant target genes within the signature can lead to false-positive small-molecule hits. Secondly, our mediation models assume linear relationships between the phenotype and the modules and therefore cannot identify non-linear effects. Also, unmeasured confounding effects can impact the statistical mediation models, which in turn can influence the causal phenotype signatures used in the compound screening step. Hence, proper attention should be given to test and adjust for all possible confounding variables during the mediation analysis step. Additionally, noisy and unreliable perturbation profiles can lead to unsuccessful compound hits. To manage this issue, we utilized a DL model that employs an effective data augmentation technique, which can extract useful information from noisy or unreliable expression profiles [ 2 As a future direction, we plan to develop compound screening approaches that can leverage single-cell expression profiles and spatially resolved cellular niches towards drug discovery applications. Using such frameworks, we can also include cell–cell interaction information to potentially capture and adjust for off-target activity of the identified drug compounds. With the help of interpretable DL models, non-linear relationships between drugs, targets, and phenotypes can be efficiently captured and better understood. 4. Materials and Methods 4.1. WGCNA and Candidate Correlated Modules The weighted gene co-expression network analysis (WGCNA) framework is useful for identifying modules of highly co-expressed genes. Briefly, WGCNA uses pairwise Pearson correlations for constructing gene networks and converts them into topological overlap matrices that encode relative gene interconnectedness within the network [ 8 Figure 2 46 ( β = 8 ) Figure 2 8 p Figure 2 p 4.2. Mediation Analysis and Candidate Causal Genes We implemented statistical mediation analysis to reveal the causal relationships between the modules and the phenotype. Specifically, we used the CWGCNA package [ 9 47 9 We applied mediation analysis models using the seven modules that showed positive correlations with the IPF phenotype ( Figure 3 4.3. Machine Learning Models for Biomarker Analysis For identifying a subset of biomarker candidate genes, we used generalized linear models (GLMs) that were trained with the elastic net penalty [ 28 GSE150910 GSE213001 4.4. DeepCE Model for Small-Molecule Screening For screening small-molecule candidates, we followed the mechanism-driven approach used in [ 2 48 49 50 19 2 To increase the coverage of the small-molecule perturbation profiles, we trained a new DeepCE model using the level 5 L1000 data of 10,174 BING genes (978 landmark + 9196 well-inferred genes with high fidelity). We reused the original hyperparameter values and followed the same procedure to train the new model by selecting the gene expression profiles from the seven most popular cell lines (MCF7, A375, HT29, PC3, HA1E, YAPC, HELA) and the six most popular dosages (0.04 μm, 0.12 μm, 0.37 μm, 1.11 μm, 3.33 μm, 10.0 μm). We reused the high-quality signatures to train the new model and predicted the perturbation levels of approximately 2000 small molecules and nearly 6000 compounds from the BROAD Drug Repurposing Hub [ 23 Section 4.2 Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091304/s1 GSE213001 Author Contributions Conceptualization, S.G. and A.G.J.; methodology, S.G.; formal analysis, S.G.; investigation, S.G. and A.G.J.; resources, S.G. and A.G.J.; data curation, S.G. and A.G.J.; writing—original draft preparation, S.G.; writing—review and editing, S.G. and A.G.J.; visualization, S.G.; supervision, A.G.J. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement All data supporting reported results can be found in the manuscript and supplementary material Conflicts of Interest The authors declare no conflicts of interest. References 1. Sun D. Gao W. Hu H. Zhou S. Why 90% of clinical drug development fails and how to improve it? Acta Pharm. Sin. B 2022 12 3049 3062 10.1016/j.apsb.2022.02.002 35865092 PMC9293739 2. Pham T.H. Qiu Y. Zeng J. Xie L. Zhang P. A deep learning framework for high-throughput mechanism-driven phenotype compound screening and its application to COVID-19 drug repurposing Nat. Mach. Intell. 2021 3 247 257 10.1038/s42256-020-00285-9 33796820 PMC8009091 3. Xie L. Ge X. Tan H. Xie L. Zhang Y. Hart T. Yang X. Bourne P.E. Towards Structural Systems Pharmacology to Study Complex Diseases and Personalized Medicine PLoS Comput. Biol. 2014 10 e1003554 10.1371/journal.pcbi.1003554 24830652 PMC4022462 4. Zhavoronkov A. Ivanenkov Y.A. Aliper A. Veselov M.S. Aladinskiy V.A. Aladinskaya A.V. Terentiev V.A. Polykovskiy D.A. Kuznetsov M.D. Asadulaev A. Deep learning enables rapid identification of potent DDR1 kinase inhibitors Nat. Biotechnol. 2019 37 1038 1040 10.1038/s41587-019-0224-x 31477924 5. Lounkine E. Keiser M.J. Whitebread S. Mikhailov D. Hamon J. Jenkins J.L. Lavan P. Weber E. Doak A.K. Côté S. Large-scale prediction and testing of drug activity on side-effect targets Nature 2012 486 361 367 10.1038/nature11159 22722194 PMC3383642 6. Ghandikota S.K. Jegga A.G. Chapter Seven—Application of artificial intelligence and machine learning in drug repurposing Progress in Molecular Biology and Translational Science Singh V. Academic Press Cambridge, MA, USA 2024 171 211 10.1016/bs.pmbts.2024.03.030 38789178 7. Langfelder P. Horvath S. WGCNA: An R package for weighted correlation network analysis BMC Bioinform. 2008 9 559 10.1186/1471-2105-9-559 PMC2631488 19114008 8. Zhang B. Horvath S. A General Framework for Weighted Gene Co-Expression Network Analysis Stat. Appl. Genet. Mol. Biol. 2005 4 17 10.2202/1544-6115.1128 16646834 9. Liu Y. CWGCNA: An R package to perform causal inference from the WGCNA framework NAR Genom. Bioinform. 2024 6 lqae042 10.1093/nargab/lqae042 38666214 PMC11044439 10. Porcu E. Sadler M.C. Lepik K. Auwerx C. Wood A.R. Weihs A. Sleiman M.S.B. Ribeiro D.M. Bandinelli S. Tanaka T. Differentially expressed genes reflect disease-induced rather than disease-causing changes in the transcriptome Nat. Commun. 2021 12 5647 10.1038/s41467-021-25805-y 34561431 PMC8463674 11. Kaur A. Mathai S.K. Schwartz D.A. Genetics in Idiopathic Pulmonary Fibrosis Pathogenesis, Prognosis, and Treatment Front. Med. 2017 4 154 10.3389/fmed.2017.00154 PMC5622313 28993806 12. Maher T.M. Interstitial Lung Disease: A Review JAMA 2024 331 1655 1665 10.1001/jama.2024.3669 38648021 13. Wang Y. Yella J.K. Ghandikota S. Cherukuri T.C. Ediga H.H. Madala S.K. Jegga A.G. Pan-transcriptome-based candidate therapeutic discovery for idiopathic pulmonary fibrosis Ther. Adv. Respir. Dis. 2020 14 1753466620971143 10.1177/1753466620971143 33167785 PMC7659024 14. Kolb M. Bonella F. Wollin L. Therapeutic targets in idiopathic pulmonary fibrosis Respir. Med. 2017 131 49 57 10.1016/j.rmed.2017.07.062 28947042 15. Furusawa H. Cardwell J.H. Okamoto T. Walts A.D. Konigsberg I.R. Kurche J.S. Bang T.J. Schwarz M.I. Brown K.K. Kropski J.A. Chronic Hypersensitivity Pneumonitis, an Interstitial Lung Disease with Distinct Molecular Signatures Am. J. Respir. Crit. Care Med. 2020 202 1430 1444 10.1164/rccm.202001-0134OC 32602730 PMC7667907 16. McDonough J.E. Ahangari F. Li Q. Jain S. Verleden S.E. Herazo-Maya J. Vukmirovic M. DeIuliis G. Tzouvelekis A. Tanabe N. Transcriptional regulatory model of fibrosis progression in the human lung JCI Insight 2019 4 e131597 10.1172/jci.insight.131597 31600171 PMC6948862 17. Jaffar J. Wong M. Fishbein G.A. Alhamdoosh M. McMillan L. Gamell-Fulla C. Ng M. Wilson N. Symons K. Glaspole I. Matrix metalloproteinase-7 is increased in lung bases but not apices in idiopathic pulmonary fibrosis ERJ Open Res. 2022 8 00191 2022 10.1183/23120541.00191-2022 36299365 PMC9589331 18. Barrett T. Wilhite S.E. Ledoux P. Evangelista C. Kim I.F. Tomashevsky M. Marshall K.A. Phillippy K.H. Sherman P.M. Holko M. NCBI GEO: Archive for functional genomics data sets—Update Nucleic Acids Res. 2013 41 D991 D995 10.1093/nar/gks1193 23193258 PMC3531084 19. Subramanian A. Narayan R. Corsello S.M. Peck D.D. Natoli T.E. Lu X. Gould J. Davis J.F. Tubelli A.A. Asiedu J.K. A Next Generation Connectivity Map: L1000 Platform and the First 1,000,000 Profiles Cell 2017 171 1437 1452.e17 10.1016/j.cell.2017.10.049 29195078 PMC5990023 20. Law C.W. Chen Y. Shi W. Smyth G.K. voom: Precision weights unlock linear model analysis tools for RNA-seq read counts Genome Biol. 2014 15 R29 10.1186/gb-2014-15-2-r29 24485249 PMC4053721 21. Wishart D.S. Knox C. Guo A.C. Shrivastava S. Hassanali M. Stothard P. Chang Z. Woolsey J. DrugBank: A comprehensive resource for in silico drug discovery and exploration Nucleic Acids Res. 2006 34 D668 D672 10.1093/nar/gkj067 16381955 PMC1347430 22. Cannon M. Stevenson J. Stahl K. Basu R. Coffman A. Kiwala S. McMichael J.F. Kuzma K. Morrissey D. Cotto K. DGIdb 5.0: Rebuilding the drug-gene interaction database for precision medicine and drug discovery platforms Nucleic Acids Res. 2024 52 D1227 D1235 10.1093/nar/gkad1040 37953380 PMC10767982 23. Corsello S.M. Bittker J.A. Liu Z. Gould J. McCarren P. Hirschman J.E. Johnston S.E. Vrcic A. Wong B. Khan M. The Drug Repurposing Hub: A next-generation drug library and information resource Nat. Med. 2017 23 405 408 10.1038/nm.4306 28388612 PMC5568558 24. Buniello A. Suveges D. Cruz-Castillo C. Llinares M.B. Cornu H. Lopez I. Tsukanov K. Roldan-Romero J.M. Mehta C. Fumis L. Open Targets Platform: Facilitating therapeutic hypotheses building in drug discovery Nucleic Acids Res. 2025 53 D1467 D1475 10.1093/nar/gkae1128 39657122 PMC11701534 25. Mayr C.H. Santacruz D. Jarosch S. Bleck M. Dalton J. McNabola A. Lempp C. Neubert L. Rath B. Kamp J.C. Spatial transcriptomic characterization of pathologic niches in IPF Sci. Adv. 2024 10 eadl5473 10.1126/sciadv.adl5473 39121212 PMC11313858 26. Ghandikota S. Sharma M. Ediga H.H. Madala S.K. Jegga A.G. Consensus Gene Co-Expression Network Analysis Identifies Novel Genes Associated with Severity of Fibrotic Lung Disease Int. J. Mol. Sci. 2022 23 5447 10.3390/ijms23105447 35628257 PMC9141193 27. Hanaka T. Kido T. Noguchi S. Yamada S. Noguchi H. Guo X. Nawata A. Wang K.Y. Oda K. Takaki T. The overexpression of peroxiredoxin-4 affects the progression of idiopathic pulmonary fibrosis BMC Pulm. Med. 2019 19 265 10.1186/s12890-019-1032-2 31888585 PMC6936055 28. Friedman J.H. Hastie T. Tibshirani R. Regularization Paths for Generalized Linear Models via Coordinate Descent J. Stat. Softw. 2010 33 1 22 10.18637/jss.v033.i01 20808728 PMC2929880 29. Tay J.K. Narasimhan B. Hastie T. Elastic Net Regularization Paths for All Generalized Linear Models J. Stat. Softw. 2023 106 1 31 10.18637/jss.v106.i01 37138589 PMC10153598 30. Zhang T. Hou Z. Ding Z. Wang P. Pan X. Li X. Single Cell RNA-Seq Identifies Cell Subpopulations Contributing to Idiopathic Pulmonary Fibrosis in Humans J. Cell. Mol. Med. 2025 29 e70402 10.1111/jcmm.70402 39928535 PMC11809556 31. Prele C.M. Miles T. Pearce D.R. O’Donoghue R.J. Grainge C. Barrett L. Birnie K. Lucas A.D. Baltic S. Ernst M. Plasma cell but not CD20-mediated B-cell depletion protects from bleomycin-induced lung fibrosis Eur. Respir. J. 2022 60 2101469 10.1183/13993003.01469-2021 35798357 PMC9684624 32. Cui H. Xie N. Jiang D. Banerjee S. Ge J. Sanders Y.Y. Liu G. Inhibition of Glutaminase 1 Attenuates Experimental Pulmonary Fibrosis Am. J. Respir. Cell Mol. Biol. 2019 61 492 500 10.1165/rcmb.2019-0051OC 30943369 PMC6775943 33. Ge J. Cui H. Xie N. Banerjee S. Guo S. Dubey S. Barnes S. Liu G. Glutaminolysis Promotes Collagen Translation and Stability via alpha-Ketoglutarate-mediated mTOR Activation and Proline Hydroxylation Am. J. Respir. Cell Mol. Biol. 2018 58 378 390 10.1165/rcmb.2017-0238OC 29019707 PMC5854958 34. He A.R. Cohen R.B. Denlinger C.S. Sama A. Birnbaum A. Hwang J. Sato T. Lewis N. Mynderse M. Niland M. First-in-Human Phase I Study of Merestinib, an Oral Multikinase Inhibitor, in Patients with Advanced Cancer Oncologist 2019 24 e930 e942 10.1634/theoncologist.2018-0411 30833489 PMC6738318 35. Crestani B. Marchand-Adam S. Quesnel C. Plantier L. Borensztajn K. Marchal J. Mailleux A. Soler P. Dehoux M. Hepatocyte growth factor and lung fibrosis Proc. Am. Thorac. Soc. 2012 9 158 163 10.1513/pats.201202-018AW 22802291 36. Stella G.M. Gentile A. Balderacchi A. Meloni F. Milan M. Benvenuti S. Ockham’s razor for the MET-driven invasive growth linking idiopathic pulmonary fibrosis and cancer J. Transl. Med. 2016 14 256 10.1186/s12967-016-1008-4 27590450 PMC5010719 37. Stella G.M. D’Agnano V. Piloni D. Saracino L. Lettieri S. Mariani F. Lancia A. Bortolotto C. Rinaldi P. Falanga F. The oncogenic landscape of the idiopathic pulmonary fibrosis: A narrative review Transl. Lung Cancer Res. 2022 11 472 496 10.21037/tlcr-21-880 35399571 PMC8988078 38. El Awdan S.A. Abdel Rahman R.F. Ibrahim H.M. Hegazy R.R. El Marasy S.A. Badawi M. Arbid M.S. Regression of fibrosis by cilostazol in a rat model of thioacetamide-induced liver fibrosis: Up regulation of hepatic cAMP, and modulation of inflammatory, oxidative stress and apoptotic biomarkers PLoS ONE 2019 14 e0216301 10.1371/journal.pone.0216301 31067255 PMC6505801 39. Hada Y. Uchida H.A. Umebayashi R. Yoshida M. Wada J. Cilostazol Attenuates AngII-Induced Cardiac Fibrosis in apoE Deficient Mice Int. J. Mol. Sci. 2022 23 9065 10.3390/ijms23169065 36012328 PMC9408896 40. Zhou Y. Huang X. Hecker L. Kurundkar D. Kurundkar A. Liu H. Jin T.-H. Desai L. Bernard K. Thannickal V.J. Inhibition of mechanosensitive signaling in myofibroblasts ameliorates experimental pulmonary fibrosis J. Clin. Investig. 2013 123 1096 1108 10.1172/JCI66700 23434591 PMC3582144 41. Kim S. Chen J. Cheng T. Gindulyte A. He J. He S. Li Q. Shoemaker B.A. Thiessen P.A. Yu B. PubChem 2025 update Nucleic Acids Res. 2025 53 D1516 D1525 10.1093/nar/gkae1059 39558165 PMC11701573 42. Travaglini K.J. Nabhan A.N. Penland L. Sinha R. Gillich A. Sit R.V. Chang S. Conley S.D. Mori Y. Seita J. A molecular cell atlas of the human lung from single-cell RNA sequencing Nature 2020 587 619 625 10.1038/s41586-020-2922-4 33208946 PMC7704697 43. Piñero J. Bravo À. Queralt-Rosinach N. Gutiérrez-Sacristán A. Deu-Pons J. Centeno E. García-García J. Sanz F. Furlong L.I. DisGeNET: A comprehensive platform integrating information on human disease-associated genes and variants Nucleic Acids Res. 2017 45 D833 D839 10.1093/nar/gkw943 27924018 PMC5210640 44. Chen J. Bardes E.E. Aronow B.J. Jegga A.G. ToppGene Suite for gene list enrichment analysis and candidate gene prioritization Nucleic Acids Res. 2009 37 (Suppl. 2) W305 W311 10.1093/nar/gkp427 19465376 PMC2703978 45. Shannon P. Markiel A. Ozier O. Baliga N.S. Wang J.T. Ramage D. Amin N. Schwikowski B. Ideker T. Cytoscape: A software environment for integrated models of biomolecular interaction networks Genome Res. 2003 13 2498 2504 10.1101/gr.1239303 14597658 PMC403769 46. Langfelder P. Zhang B. Horvath S. Defining clusters from A hierarchical cluster tree: The Dynamic Tree Cut package for R Bioinformatics 2008 24 719 720 10.1093/bioinformatics/btm563 18024473 47. VanderWeele T.J. Mediation Analysis: A Practitioner’s Guide Annu. Rev. Public Health 2016 37 17 32 10.1146/annurev-publhealth-032315-021402 26653405 48. Weininger D. SMILES, a chemical language and information system. 1. Introduction to methodology and encoding rules J. Chem. Inf. Comput. Sci. 1988 28 31 36 10.1021/ci00057a005 49. Grover A. Leskovec J. node2vec: Scalable feature learning for networks Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining San Francisco, CA, USA 13–17 August 2016 855 864 10.1145/2939672.2939754 PMC5108654 27853626 50. Szklarczyk D. Kirsch R. Koutrouli M. Nastou K. Mehryary F. Hachilif R. Gable A.L. Fang T. Doncheva N.T. Pyysalo S. The STRING database in 2023: Protein-protein association networks and functional enrichment analyses for any sequenced genome of interest Nucleic Acids Res. 2023 51 D638 D646 10.1093/nar/gkac1000 36370105 PMC9825434 Figure 1 Overall workflow of our proposed compound screening methodology. Starting with a matrix of gene expression profiles as the input, the network analysis step identifies all gene modules co-expressed with respect to a phenotype. From the modules significantly associated with a phenotype, causal genes are identified by implementing statistical mediation analysis models. Finally, a multimodal deep learning model is used to identify candidate small-molecule compounds that potentially target the causal genes. Figure 2 WGCNA Steps: A B C Figure 3 Volcano plots of the six candidate modules with significant mediator genes (red—forward; blue—reverse; gray—nonsignificant) highlighted in each of them. Figure 4 Forest plots of the top-performing biomarker candidates in classifying IPF samples. Panel ( A GSE213001 B C bottom row top row Figure 5 Functional enrichment network of significant mediator genes and drug targets of top hit small molecules. The mediator genes are represented as yellow elliptical nodes while the drug targets are represented in blue, green, or magenta colors. Targets genes of Cilostazol are highlighted in blue, while the green and magenta nodes represent the target genes of Merestinib and Telaglenastat, respectively. Enriched functional terms relevant to IPF are shown in turquoise-colored rectangular nodes. The network was generated using Cytoscape application (v3.10.3) and the functional enrichment was carried out using ToppFun application of the ToppGene Suite ( https://toppgene.cchmc.org/ pharmaceuticals-18-01304-t001_Table 1 Table 1 List of IPF transcriptomic datasets used. GEO Accession ID # IPF # Controls Reference GSE150910 103 103 [ 15 GSE124685 49 (19 = mild (IPF1); 16 = moderate (IPF2); 14 = advanced (IPF3)) 35 [ 16 GSE213001 61 (22 = Advanced, 27 = Severe) 40 [ 17 pharmaceuticals-18-01304-t002_Table 2 Table 2 Best-performing causal mediator genes in categorizing the IPF samples (including severe and advanced IPF) from healthy controls in an independent validation cohort ( GSE213001 File S5  Gene AUPRC AUROC  IPF vs. Controls ITM2C 0.993  ± 0.987  ± PRTFDC1 0.989  ± 0.983  ± CRABP2 0.984  ± 0.971  ± CPNE7 0.969  ± 0.955  ± FAM83D 0.965  ± 0.943  ± NMNAT2 0.964  ± 0.945  ± P4HA3 0.95  ± 0.933  ± PDGFD 0.945  ± 0.932  ± PAPPA2 0.943  ± 0.902  ±  Severe IPF vs. Controls ITM2C 0.996  ± 0.997  ± CPNE7 0.97  ± 0.98  ± PRTFDC1 0.969  ± 0.975  ± CRABP2 0.96  ± 0.958  ± NMNAT2 0.943  ± 0.956  ± LAX1 0.943  ± 0.957  ± PAPPA2 0.92  ± 0.927  ±  Advanced IPF vs. Controls ITM2C 0.996  ± 0.998  ± CRABP2 0.991  ± 0.994  ± PRTFDC1 0.983  ± 0.99  ± FAM83D 0.976  ± 0.986  ± NMNAT2 0.947  ± 0.968  ± MYOF 0.936  ± 0.955  ± P4HA3 0.927  ± 0.965  ± CDH3 0.923  ± 0.949  ± CPNE7 0.903  ± 0.936  ± pharmaceuticals-18-01304-t003_Table 3 Table 3 List of top compounds with significant negative correlation (Spearman rank-order) with the causal IPF signature. The correlations in each of the seven distinct cell lines, along with the significance p File S6 Drug A375 HA1E HELA HT29 MCF7 PC3 YAPC 1,4-Bis((3,4-dimethoxyphenyl)sulfonyl)-1,4-diazepane −0.25 (0.051)  − 0.27 (0.036)  − 0.34 (0.006)  − 0.28 (0.027)  − 0.33 (0.009) −0.25 (0.053)  − 0.28 (0.03) CB-839 (Telaglenastat)  − 0.29 (0.023) 0.04 (0.76)  − 0.29 (0.02)  − 0.26 (0.044)  − 0.25 (0.049)  − 0.28 (0.03) −0.18 (0.16) [2-(4-Amino-1,2,5-oxadiazol-3-yl)-1-ethylimidazo[4,5-c]pyridin-7-yl]-[(3S)-3-aminopyrrolidin-1-yl]methanone − 0.31 (0.014) −0.18 (0.17)  − 0.26 (0.041)  − 0.32 (0.014)  − 0.31 (0.015)  − 0.29 (0.02) −0.19 (0.13) Aminofurazanyl-azabenzimidazole 6n  − 0.35 (0.005)  − 0.27 (0.03)  − 0.3 (0.02) −0.23 (0.07)  − 0.29 (0.023) −0.25 (0.053) −0.19 (0.15) [2-(4-Amino-furazan-3-yl)-1-ethyl-1H-imidazo[4,5-c]pyridin-7-ylmethyl]-piperidin-4-yl-amine  − 0.28 (0.025) −0.1 (0.42) −0.25 (0.052)  − 0.3 (0.02)  − 0.28 (0.026)  − 0.3 (0.02) −0.09 (0.51) Pentamidine  − 0.31 (0.015) −0.16 (0.24) −0.21 (0.098) −0.21 (0.11)  − 0.26 (0.046)  − 0.26 (0.044)  − 0.27 (0.034) RHC-80267 −0.22 (0.089) 0.08 (0.52) −0.18 (0.16)  − 0.35 (0.006)  − 0.29 (0.023) −0.23 (0.075)  − 0.26 (0.039) RK-682  − 0.27 (0.033) 0.12 (0.35) 0.019 (0.88) 0.22 (0.097) −0.18 (0.17) −0.22 (0.091)  − 0.29 (0.025) Merestinib −0.08 (0.54) −0.09 (0.48)  − 0.33 (0.008) −0.06 (0.64)  − 0.28 (0.03) −0.07 (0.57) −0.05 (0.73) LY-255283 −0.25 (0.053) 0.17 (0.2) −0.18 (0.16)  − 0.26 (0.047) −0.2 (0.12) − 0.28 (0.028) −0.07 (0.58) Cilostazol  − 0.31 (0.015) 0.018 (0.89) −0.15 (0.25) −0.16 (0.22) −0.11 (0.41) −0.06 (0.67)  − 0.28 (0.033) M2-PK-activator −0.19 (0.15)  − 0.26 (0.04) −0.21 (0.11) 0.25 (0.05) −0.22 (0.089) −0.23 (0.07)  − 0.29 (0.02) NNC-711 −0.11 (0.4) −0.03 (0.79) −0.2 (0.11)  − 0.3 (0.018)  − 0.27 (0.038) 0.1 (0.44) 0.009 (0.95) CID 11973736 −0.23 (0.077) −0.2 (0.12)  − 0.33 (0.009) −0.24 (0.06)  − 0.32 (0.014) −0.18 (0.16) −0.07 (0.6) Azeloyl diethyl salicylate −0.15 (0.26) 0.1 (0.45)  − 0.34 (0.008)  − 0.32 (0.011) −0.16 (0.22) −0.19 (0.13) 0.02 (0.88) Cetrimonium  − 0.31 (0.015) −0.04 (0.78) −0.15 (0.26) 0.23 (0.07) −0.2 (0.13)  − 0.28 (0.027) −0.24 (0.06) Decamethonium  − 0.26 (0.043) −0.04 (0.75) −0.06 (0.65)  − 0.26 (0.047) −0.23 (0.072) −0.23 (0.07) −0.24 (0.056) Gemcadiol  − 0.29 (0.021) −0.004 (0.98) −0.06 (0.63)  − 0.25 (0.049) −0.14 (0.29) −0.25 (0.056) 0.24 (0.066) Clofilium  − 0.28 (0.026) 0.23 (0.079) −0.19 (0.14) −0.25 (0.051) −0.14 (0.29)  − 0.27 (0.03) −0.06 (0.64) 1-[[4,5-Bis(4-methoxyphenyl)-2-thiazolyl]carbonyl]-4-methylpiperazine −0.13 (0.33) −0.15 (0.24)  − 0.29 (0.025) −0.17 (0.19)  − 0.28 (0.029) −0.17 (0.19) 0.04 (0.78) Zindotrine −0.03 (0.82) 0.17 (0.18) 0.05 (0.68)  − 0.28 (0.03) −0.19 (0.15) 0.04 (0.74)  − 0.31 (0.015) Eliglustat −0.04 (0.78) −0.01 (0.94)  − 0.26 (0.04)  − 0.27 (0.036) −0.1 (0.44) −0.16 (0.22) −0.01 (0.93) 3-(Azepan-1-ylsulfonyl)-N-(3-bromophenyl)benzamide −0.02 (0.87) −0.25 (0.054)  − 0.26 (0.04) −0.08 (0.54) −0.11 (0.43) −0.08 (0.53)  − 0.25 (0.047) ",
  "metadata": {
    "Title of this paper": "The STRING database in 2023: Protein-protein association networks and functional enrichment analyses for any sequenced genome of interest",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472719/"
  }
}