{
  "title": "Paper_1198",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467016 PMC12467016.1 12467016 12467016 41007653 10.3390/biomedicines13092088 biomedicines-13-02088 1 Article Impact of Prolonged Fasting and Refeeding on Enteroendocrine Hormone Expression: One More Piece of the Fasting/Refeeding Metabolic Puzzle https://orcid.org/0000-0003-4920-9158 Nunes Gonçalo Conceptualization Investigation Writing – original draft 1 2 3 * https://orcid.org/0000-0001-8094-7197 Guimarães Marta Writing – review & editing Supervision 4 5 Oliveira Sofia B. Methodology Supervision 4 5 https://orcid.org/0000-0001-6947-4560 Pereira Sofia S. Writing – review & editing 4 5 https://orcid.org/0000-0002-3757-6172 Vara-Luiz Francisco Writing – review & editing 1 3 Mendes Ivo Writing – review & editing 1 3 https://orcid.org/0009-0002-3749-4342 Palma Carolina Writing – review & editing 1 3 https://orcid.org/0000-0001-8753-124X Oliveira Cátia Resources Writing – review & editing 1 https://orcid.org/0000-0001-6477-7028 Fonseca Jorge Conceptualization Methodology Writing – review & editing Supervision 1 2 3 Sipos Ferenc Academic Editor 1 2 3 4 5 * goncalo.n@hotmail.com 27 8 2025 9 2025 13 9 497614 2088 13 7 2025 24 8 2025 25 8 2025 27 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Introduction: Objective: Methods: Results: p p p Conclusions: gastrointestinal hormones incretins refeeding syndrome enteral feeding gastrostomy Fundação Para a Ciência e Tecnologia (FCT) UIDB/00215/2020 UIDP/00215/2020 LA/P/0064/2020 FCT/MCTES This study was funded by Fundação Para a Ciência e Tecnologia (FCT) (UIDB/00215/2020 (DOI: 10.54499/UIDB/00215/2020); UIDP/00215/2020 (DOI: 10.54499/UIDP/00215/2020); and LA/P/0064/2020 (DOI: 10.54499/LA/P/0064/2020). The authors thank FCT/MCTES for the financial support to CiiEM (10.54499/UIDB/04585/2020) through national funds. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Protein-energy malnutrition is a highly prevalent condition associated with adverse functional and clinical outcomes. Acute and chronic inflammation plays a central role in disease-related malnutrition, leading to decreased food intake and muscle catabolism. Recent advances in clinical and artificial nutrition observed during the last decades have allowed an effective and safe implementation of nutritional therapy in different inflammatory and fasting clinical settings [ 1 2 Refeeding syndrome (RS) is a potential life-threatening condition caused by metabolic and electrolyte disturbances, occurring alongside the reintroduction of nutrition in predisposed patients exposed to long-term caloric deficiency [ 3 4 2 3 Patients undergoing percutaneous endoscopic gastrostomy (PEG) for long-term enteral feeding due to chronic disease with prolonged dysphagia are at particularly high risk; nevertheless, clinical and laboratory signs of RS are seldom identified in PEG-fed patients [ 5 6 Gastrointestinal hormones are a heterogenous group of polypeptides secreted by enteroendocrine cells (EECs) widely distributed throughout the mucosa of the digestive tract. These hormones regulate intestinal and pancreatic functions and contribute to digestive homeostasis by affecting secretion, motility, absorption, digestion, and cell proliferation [ 7 Chromogranin-A (CgA) is one of the most abundant neuroendocrine secretory proteins localized in the secretory granules of the EEC in the gastrointestinal tract, being also secreted in other tissues such as the pancreas, adrenal medulla, and pulmonary alveoli. CgA is a precursor of several functional peptides that regulate a wide range of physiological processes including pancreatic secretion, cardiovascular function, and immune response [ 8 Neurotensin is also produced by EEC despite being mainly distributed throughout the central nervous system where it is involved in analgesia, sleep control, thermoregulation and pituitary hormone secretion. Its digestive functions include stimulation of pancreatic and biliary secretions, inhibition of gastric acid secretion and motility, stimulation of colon motility and inhibition of jejuno-ileum motility favoring absorption. It also promotes the growth of normal gastrointestinal tissues [ 9 Glucagon-like peptide 1 (GLP-1) and Gastric inhibitory polypeptide (GIP) are the two primary incretin hormones secreted from the intestine after ingestion of glucose or other nutrients to stimulate insulin secretion from pancreatic beta cells. In addition to their insulinotropic effects, GIP and GLP-1 play critical roles in several biological processes in different tissues. Within the pancreas, GIP and GLP-1 together also promote beta cell proliferation and inhibit apoptosis, but while GIP enhances postprandial glucagon response, GLP-1 suppresses it. In adipose tissues, GIP but not GLP-1 facilitates fat deposition. In bone, GIP induces bone formation while GLP-1 inhibits bone reabsorption. In the brain, both GIP and GLP-1 are thought to be involved in memory formation and appetite control [ 10 11 The chronic decrease of nutrient load into the intestinal lumen has a high potential to impact the mucosa hormonal secretion. The present study of tissue expression of gastrointestinal hormones will contribute to understanding the metabolic shifts between long-term fasting and adequate feeding, as well as the complex functional mechanisms behind the previously described histological and ultrastructural changes induced by prolonged fasting and the recovery observed after enteral refeeding. The authors aim to analyze the intestinal tissue expression of gastrointestinal hormones in malnourished patients when submitted to endoscopic gastrostomy after a significant period of fasting and to assess the hormonal expression pattern after enteral refeeding. 2. Material and Methods 2.1. Study Design This single center, observational, and prospective study was conducted in a tertiary hospital. The present study was approved by the institutional ethics committee. 2.2. Patients Consecutive ambulatory adult patients (≥18 years) with oral ingestion below 50% of energy daily needs for a minimum period of 1 month that were referred to PEG for long-term enteral nutrition were initially eligible. For each patient enrolled, the following methodology was applied: 1. Nutritional anamnesis performed by a trained dietitian through a dietary recall. 2. Estimation of the energy needs according to age, gender, height, weight, and clinical setting to assess the reduction of food ingestion in the last month before PEG. 3. Prospective clinical and demographic database registry that includes age, gender, clinical indication for PEG, anthropometry, laboratorial parameters, and survival after the gastrostomy. 4. PEG performed by two gastroenterologists using the “pull” method described by Gauderer–Ponsky with patients under deep sedation. Antithrombotic therapy was managed according to international guidelines [ 12 5. Collection of 4–6 duodenal biopsies (second portion) at the time of the gastrostomy procedure (T0) and after 3–6 months of PEG-feeding at the moment of endoscopic tube replacement (T1). 6. Every patient underwent an adapted diet calculated by the dietitian, considering individual needs and preferences, sometimes with formula supplementation administered through the tube. No standardized diets were applied to PEG patients by routine. All participants or their representatives signed the informed consent. Patients with oncologic disease, quantified food ingestion above 50% of energy daily needs during the last month before PEG, evident inability to provide credible anamnestic data, or those who refused to participate in the study were excluded. Additionally, patients with diabetes mellitus and other clinical conditions (e.g., celiac disease, peptic ulcer, inflammatory bowel disease, and any endocrine disorder) or taking specific medications that could interfere with intestinal mucosa hormonal physiology were not included. The technical impossibility of obtaining duodenal biopsies and the expected inability to have an appropriate clinical and nutritional follow-up were additional exclusion criteria. Random healthy individuals that underwent upper gastrointestinal endoscopy to investigate ferropenic anemia also collected duodenal biopsies, being used as normal controls if no endoscopic and histologic abnormality was diagnosed, and a non-duodenal source of bleeding was found. 2.3. Anthropometric Evaluation Anthropometric evaluation was performed by a dietitian before the procedure, according to the ISAK Manual of International Society for the Advancement of Kinanthropometry 13 The body mass index (BMI) was obtained in most patients using the equation Weight/Height 2 14 15 MUAC was measured in centimeters, using a flexible measuring tape wrapped around the mid upper arm, halfway between the olecranon and the acromion process. According to the GLIM (Global Leadership Initiative on Malnutrition) criteria for diagnosing malnutrition [ 16 2 2 2.4. Laboratory Evaluation A blood sample was obtained just before the gastrostomy procedure. Serum albumin, transferrin, total cholesterol, and electrolytes, namely phosphorus, magnesium, and potassium, were measured at baseline (T0) and during follow-up (T1) as part of patient global nutritional and metabolic evaluation. Values of albumin below 3.5 g/dL, transferrin below 200 mg/dL, and total cholesterol below 160 mg/dL were considered low values, suggestive of malnutrition and/or poor prognosis. Normal cut-off values for serum electrolytes were considered, according to the laboratory institutional protocol, as follows: phosphorus: 2.5–4.8 mg/dL; magnesium: 1.5–2.1 mg/dL; and potassium: 3.5–5.0 mmol/L. Patients with low levels of these serum electrolytes would not start enteral refeeding until replacement and complete normalization. 2.5. Duodenal Biopsies Analysis All paraffin-embedded tissue blocks were processed and four cuts per block with a three-micrometer thickness were performed. Tissue expression of CgA, GLP-1, GIP, and neurotensin were studied through an immunohistochemical analysis in both study moments. Briefly, antigen retrieval was performed by microwave heating in 10 mM citrate buffer (pH 6.0). Endogenous peroxidase was blocked using 3% hydrogen peroxide for 20 min, followed by a 30-min blocking step with normal serum. Slides were incubated overnight at 4 °C in 5% BSA with the following antibodies: CgA (1:200, ab17064, Abcam, Cambridge, UK), neurotensin (1:5000, 3488-7), GIP (1:500, ab30679, Abcam), and GLP-1 (1:4000, ab22625, Abcam). Sections were then incubated for 30 min with biotinylated polyclonal secondary antibodies (1:200; EO35301-2 or EO35401-2, Dako, Glostrup, Denmark), followed by a 30-min incubation with the avidin–biotin complex (ABC, 1:100 dilution in 5% BSA; Vector Laboratories, Peterborough, UK). 3,3′-diaminobenzidine (DAB; Dako) was used as chromogen, with the incubation times of 2 min for CgA, 30 s for GIP and GLP-1, and 10 s for neurotensin. All tissue sections were counterstained with Mayer’s hematoxylin. Slides stained by immunohistochemistry were scanned and the acquired images were processed using ImageJ 1.54p software (National Institutes of Health), incorporating a color deconvolution plugin to isolate the stained regions from the background, enabling quantification of the specific area stained by the respective antibodies. The ratio of GIP, GLP-1, or NT to CgA percentage-stained area was calculated as an estimate of the proportion of the respective positive cells within the overall enteroendocrine cell population. The percentage of stained tissue in the total tissue area was analyzed in every patient at baseline and after PEG refeeding. All findings were compared with duodenal samples of controls. 2.6. Statistical Analysis The statistical analysis was performed using the Statistical Package for Social Sciences (IBM SPSS ® 3. Results 3.1. Patients A total of 30 patients that fulfilled the inclusion criteria were initially included in the study: 16 men and 14 women, aged between 38 and 87 years (mean 67.1 ± 13.5). Thirteen patients (43.3%) were below 70 years. The main characteristics of the population are described in Table 1 A total of 10 citizens (3 men and 7 women) aged between 42 and 77 years (mean 52.7 ± 11.3) who underwent upper gastrointestinal endoscopy with duodenal biopsies to investigate ferropenic anemia were included in the control group. All of them presented normal endoscopic and histologic duodenal evaluation and no cause for anemia was detected in upper gastrointestinal tract. 3.2. Nutritional Assessment: GLIM, NRS 2002, Anthropometry, and Laboratorial Data All patients presented major reduction of oral ingestion and significant weight loss, allowing the diagnosis of malnutrition according to the GLIM criteria. NRS 2002 was ≥3 points in all patients, signaling high nutritional risk. BMI before PEG ranged from 14.5 to 27.9 kg/m 2 2 p Nutritional assessment data are highlighted in Table 1 3.3. Duodenal Mucosa Immunohistochemistry In most of the 30 patients initially included in the protocol, it was possible to perform the immunohistochemical analysis at baseline: 29 patients for CgA, 28 patients for GLP-1, 28 patients for GIP, and 26 patients for neurotensin. This variation in sample numbers occurred because suitable histological tissue was not available for all markers in every case, either due to insufficient biopsy material or high background staining that did not allow a clear color isolation and reliable quantification of the immunohistochemical staining. Median stained area was 1.04% [IQR 0.75–1.47] for chromogranin-A, 0.17% [IQR 0.11–0.23] for GLP-1, 0.19% [IQR 0.13–0.32] for GIP, and 0.01% [IQR 0.01–0.02] for neurotensin. In the control group, the median stained area was lower for most hormones: 0.41% [IQR 0.35–0.63] for chromogranin-A, 0.03% [IQR 0–0.1] for GLP-1, and 0.03% [IQR 0–0.09] for GIP. Nevertheless, it was similar for neurotensin—0.01% [IQR 0–0.03]. Tissue expression of chromogranin-A, GLP-1, and GIP in patients at baseline was significantly higher than in controls ( p p Figure 1 Figure 2 Figure 3 Figure 4 p After PEG tube feeding, duodenal mucosa immunohistochemistry could be assessed in 12 patients. In 2 patients, tissue samples were not adequate for immunohistochemical analysis. The median stained area was 0.88% [IQR 0.74–1.02] for chromogranin-A, 0.16% [IQR 0.12–0.19] for GLP-1, 0.19% [0.11–0.19] for GIP, and 0.01% [0.01–0.02] for neurotensin. No significant differences were observed between the two periods ( p Table 2 4. Discussion Protein-energy malnutrition is highly prevalent in gastroenterology clinical practice, especially when food intake is severely reduced for long periods. This condition, which is also exacerbated by disease-related inflammation, is commonly observed in patients undergoing PEG [ 3 Prolonged fasting promotes several hormonal adaptative responses similar to stress-induced hypercatabolism, which includes increased levels of cortisol, downregulation of the hypothalamic–pituitary axis, high plasma catecholamine concentration, and decreased insulin/glucagon ratio, which increase lipolysis, proteolysis, and ketogenesis [ 17 18 19 In the current study, the authors analyzed patients referred for PEG with significant low caloric intake and absence of previous nutritional support by tube feeding, looking for the mucosa tissue expression of gastrointestinal hormones including the incretins GLP-1 and GIP, CgA, and neurotensin. A large number of patients were diagnosed with amyotrophic lateral sclerosis (ALS), as significant reduction in oral ingestion was commonly observed during the early stages of this neurodegenerative disease [ 20 A histomorphometric analysis performed by our group in a previous reported study using the same patient samples revealed that more than two-thirds of starved patients presented median villi length below 0.5 mm being significantly shorter compared to controls. Additionally, enterocytes displayed changes in the striated plate with disarrangement of microvilli and increased autophagy demonstrated by the presence of cytoplasmic vacuoles. An increased length of intercellular spaces and cell detachment of basal membrane suggested compromised absorption. All these changes were not observed in controls and seem to be reverted after 3–6 months of enteral nutrition with an adequate intake [ 6 The immunohistochemical evaluation of duodenal biopsies in the current study showed that mucosa expression of CgA, GLP-1, and GIP were significantly higher in patients compared with controls, suggesting an increased intracellular concentration of these substrates induced by prolonged fasting and malnutrition. Incretin secretion is stimulated by the presence of nutrients in the duodenal lumen, aiming to improve pancreatic insulin production for anabolism. The serum incretin concentration is typically low during fasting and increases immediately after eating [ 10 11 After 3–6 months of enteral refeeding, CgA and GLP-1 expression present a minor reduction, approaching the values of the control mucosa but without statistical significance. GIP and neurotensin did not present any change. Unlike what it was verified in the previous histological and ultrastructural analysis, duodenal tissue expression of incretins and neuroendocrine peptides in patients did not normalize after enteral nutrition during 3–6 months, suggesting that this time is probably insufficient to correct the hormonal adaptative responses induced by prolonged fasting. Actually, enterochromaffin cell turnover is much slower than the rapid turnover of the enterocytes, which can explain the potential long time needed for the normalization of hormonal expression in the duodenal mucosa after refeeding. Despite the adaptative changes observed in the duodenal histology and ultrastructure that suggest loss of absorptive function, which seems to protect patients from RS in the early post-PEG period, the increased tissue expression of incretins may otherwise contribute to exacerbating this risk. Although absorption is compromised in prolonged fasting patients, the incretin effect obtained after enteral refeeding and responsible for the insulin peak would probably be increased considering the high baseline expression of these hormones induced by chronic low ingestion. These findings associated with the long turnover of enterochromaffin cells of 16–150 days already reported may contribute to explaining the impact of RS beyond the first days of enteral nutrition, which was also addressed in a retrospective study previously reported by our group, where RS markers were shown to influence patient mortality during the first month of PEG-feeding [ 5 21 Nevertheless, the present study displays some minor limitations that need to be considered. Thirty patients were initially included and assessed at baseline; however, only 14 completed the follow-up, and duodenal biopsies could be reanalyzed after refeeding. This occurred because one-third died before endoscopic control due to disease evolution. One patient recovered from dysphagia, and six were lost during follow-up. This may have influenced the interpretation of our results after PEG refeeding given the lower number of duodenal samples in the second period of the study. Further studies recruiting more patients during a longer period of follow-up will probably overcome this bias. Additionally, tissue overexpression of CgA, GLP-1, and GIP obtained in the immunohistochemical analysis compared to controls was interpreted as a surrogate marker of higher cellular activity and function of these proteins in fasting duodenal mucosa, which is debatable. Serum metabolic biomarkers for mucosa absorption and enteroendocrine cell function are required and deserve future research. Also, more studies to analyze the variation of serum concentration of these hormones during fasting and refeeding using mixed meal tolerance tests can probably also complement our results and clarify the association between tissue expression and biological activity of these substances. Finally, this study only addresses changes in the duodenal mucosa during fasting and immediate refeeding and does not assess if RS develops during follow-up from a clinical perspective. In conclusion, the results obtained in this study suggest that prolonged fasting induces overexpression of duodenal mucosa gastrointestinal hormones and peptides assessed in an immunohistochemical analysis, which is associated with the already reported morphological changes. It included increased tissue expression of incretins and CgA as a potential adaptative mechanism to compensate for fasting-induced decreased absorption in order to maintain basal metabolism even under negative caloric supply. However, these changes may potentially increase RS risk after oral or enteral refeeding. As the present study also described, an immediate period of adequate enteral refeeding during 3–6 months was not sufficient to normalize these changes and to reestablish hormonal homeostasis in the duodenal mucosa. These findings may have potential implications for clinical practice as the risk of RS seems to be maintained despite chronic impairment to the intestinal mucosa. This occurs at the expense of hormonal metabolic rearrangements induced by prolonged fasting that persist longer due to enterochromaffin cell activity with slow turnover. The impact of these adaptative changes in RS management and clinical outcome may justify further research projects. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, G.N. and J.F.; Methodology, S.B.O. and J.F.; Investigation, G.N.; Resources, C.O.; Writing—original draft, G.N.; Writing—review & editing, M.G., S.S.P., F.V.-L., I.M., C.P., C.O. and J.F.; Supervision, M.G., S.B.O. and J.F. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Institutional Ethics Committee of Hospital Garcia de Orta (protocol code 52/2016; approval in 3 May 2021). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflict of interest. References 1. Cederholm T. Barazzoni R. Austin P. Ballmer P. Biolo G. Bischoff S.C. Compher C. Correia I. Higashiguchi T. Holst M. ESPEN guidelines on definitions and terminology of clinical nutrition Clin. Nutr. 2017 36 49 64 10.1016/j.clnu.2016.09.004 27642056 2. Gramlich L. Guenter P. Enteral Nutrition in Hospitalized Adults N. Engl. J. Med. 2025 392 1518 1530 10.1056/NEJMra2406954 40239069 3. Nunes G. Brito M. Santos C.A. Fonseca J. Refeeding syndrome in the gastroenterology practice how concerned should we be? Eur. J. Gastroenterol. Hepatol. 2018 30 1270 1276 10.1097/MEG.0000000000001202 29994872 4. da Silva J.S.V. Seres D.S. Sabino K. Adams S.C. Berdahl G.J. Citty S.W. Cober M.P. Evans D.C. Greaves J.R. Gura K.M. Parenteral Nutrition Safety and Clinical Practice Committees, American Society for Parenteral and Enteral Nutrition. ASPEN Consensus Recommendations for Refeeding Syndrome Nutr. Clin. Pract. 2020 35 178 195 10.1002/ncp.10474 32115791 5. Nunes G. Brito M. Patita M. Santos C.A. Fonseca J. Hypophosphatemia before endoscopic gastrostomy predicts higher mortality during the first week and first month post-gastrostomy a risk marker of refeeding syndrome in gastrostomy-fed patients Nutr. Hosp. 2019 36 247 252 30810047 10.20960/nh.2251 6. Nunes G. Guimarães M. Coelho H. Carregosa R. Oliveira C. Pereira S.S. de Matos A.A. Fonseca J. Prolonged Fasting Induces Histological and Ultrastructural Changes in the Intestinal Mucosa That May Reduce Absorption and Revert after Enteral Refeeding Nutrients 2023 16 128 10.3390/nu16010128 38201958 PMC10780540 7. Ahmed M. Ahmed S. Functional, Diagnostic and Therapeutic Aspects of Gastrointestinal Hormones Gastroenterol. Res. 2019 12 233 244 10.14740/gr1219 31636773 PMC6785288 8. D’Amico M.A. Ghinassi B. Izzicupo P. Manzoli L. Di Baldassarre A. Biological function and clinical relevance of chromogranin A and derived peptides Endocr. Connect. 2014 3 R45 R54 10.1530/EC-14-0027 24671122 PMC5395093 9. Evers B.M. Neurotensin and growth of normal and neoplastic tissues Peptides 2006 27 2424 2433 10.1016/j.peptides.2006.01.028 16904238 10. Seino Y. Fukushima M. Yabe D. GIP and GLP-1, the two incretin hormones: Similarities and differences J. Diabetes Investig. 2010 1 8 23 10.1111/j.2040-1124.2010.00022.x 24843404 PMC4020673 11. Yabe D. Seino Y. Two incretin hormones GLP-1 and GIP: Comparison of their actions in insulin secretion and β cell preservation Prog. Biophys. Mol. Biol. 2011 107 248 256 10.1016/j.pbiomolbio.2011.07.010 21820006 12. Veitch A.M. Radaelli F. Alikhan R. Dumonceau J.-M. Eaton D. Jerrome J. Lester W. Nylander D. Thoufeeq M. Vanbiervliet G. Endoscopy in patients on antiplatelet or anticoagulant therapy: British Society of Gastroenterology (BSG) and European Society of Gastrointestinal Endoscopy (ESGE) guideline update Endoscopy 2021 53 947 969 10.1055/a-1547-2282 34359080 PMC8390296 13. Stewart A. Marfell-Jones M. Olds T. International Standards for Anthropometric Assessment International Society for the Advancement of Kinanthropometry Lower Hutt, New Zealand 2011 14. Powell-Tuck J. Hennessy E. A comparison of mid upper arm circumference, body mass index and weight loss as indices of undernutrition in acutely hospitalized patients Clin. Nutr. 2003 22 307 312 10.1016/S0261-5614(03)00009-8 12765671 15. Barosa R. Ramos L.R. Santos C.A. Pereira M. Fonseca J. Mid upper arm circumference and Powell-Tuck and Hennessy’s equation correlate with body mass index and can be used sequentially in gastrostomy fed patients Clin. Nutr. 2017 37 1584 1588 10.1016/j.clnu.2017.08.011 28869072 16. Jensen G.L. Cederholm T. Correia M.I.T. Gonzalez M.C. Fukushima R. Higashiguchi T. de Baptista G.A. Barazzoni R. Blaauw R. Coats A.J. GLIM Criteria for the Diagnosis of Malnutrition: A Consensus Report from the Global Clinical Nutrition Community J. Parenter. Enter. Nutr. 2019 43 32 40 10.1002/jpen.1440 30175461 17. Karimi R. Yanovich A. Elbarbry F. Cleven A. Adaptive Effects of Endocrine Hormones on Metabolism of Macronutrients during Fasting and Starvation: A Scoping Review Metabolites 2024 14 336 10.3390/metabo14060336 38921471 PMC11205672 18. Obeid O.A. Hachem D.H. Ayoub J.J. Refeeding and metabolic syndromes: Two sides of the same coin Nutr. Diabetes 2014 4 e120 10.1038/nutd.2014.21 24979149 PMC4079929 19. Zeki S. Culkin A. Gabe S.M. Nightingale J.M. Refeeding hypophosphataemia is more common in enteral than parenteral feeding in adult in patients Clin. Nutr. 2011 30 365 368 10.1016/j.clnu.2010.12.001 21256638 20. López-Gómez J.J. Ballesteros-Pomar M.D. Torres-Torres B. la Maza B.P.-D. Penacho-Lázaro M.A. Palacio-Mures J.M. Abreu-Padín C. Sanz-Gallego I. De Luis-Román D.A. Impact of Percutaneous Endoscopic Gastrostomy (PEG) on the Evolution of Disease in Patients with Amyotrophic Lateral Sclerosis (ALS) Nutrients 2021 13 2765 10.3390/nu13082765 34444925 PMC8401888 21. Tao E. Zhu Z. Hu C. Long G. Chen B. Guo R. Fang M. Jiang M. Potential Roles of Enterochromaffin Cells in Early Life Stress-Induced Irritable Bowel Syndrome Front. Cell. Neurosci. 2022 16 837166 10.3389/fncel.2022.837166 35370559 PMC8964523 Figure 1 Duodenal mucosa histology with IHC analysis for chromogranin-A (magnification 34.1×), showing tissue coloration in the control group ( A B C Figure 2 Duodenal mucosa histology with IHC analysis for neurotensin (magnification 34.1×), showing tissue coloration in the control group ( A B C Figure 3 Duodenal mucosa histology with IHC analysis for the incretin GLP-1 (magnification 34.1×), showing tissue coloration in the control group ( A B C Figure 4 Duodenal mucosa histology with IHC analysis for the incretin GIP (magnification 34.1×), showing tissue coloration in the control group ( A B C biomedicines-13-02088-t001_Table 1 Table 1 Baseline characteristics of patients.  Patient Characteristics  Age M = 67.1 ± 13.5 years  Gender Male: 16 (53.3%)  Indication for PEG Amyotrophic lateral sclerosis Post-stroke Esophageal dysmotility: (90%)  Body Mass Index Low Normal: (40%)  Albumin Low Normal (3.3%)  Transferrin Low Normal (30%)  Total Cholesterol Low Normal (26.7%)  Duodenal Mucosa Immunohistochemistry (% tissue stained area)  Chromogranin-A GLP-1 GIP Neurotensin (1.04%) biomedicines-13-02088-t002_Table 2 Table 2 Evolution of gastrointestinal hormone tissue stained area at baseline and after PEG.  Baseline (T0) After PEG Feeding (T1) p Median Tissue Stained Area  Chromogranin-A 1.04% 0.88% 0.94  GLP-1 0.17% 0.16% 0.36  GIP 0.19% 0.19% 0.31  Neurotensin 0.01% 0.01% 0.69 ",
  "metadata": {
    "Title of this paper": "Potential Roles of Enterochromaffin Cells in Early Life Stress-Induced Irritable Bowel Syndrome",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467016/"
  }
}