{
  "title": "Paper_961",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470572 PMC12470572.1 12470572 12470572 41009713 10.3390/ijms26189155 ijms-26-09155 1 Review Exosome-like Nanoparticles Extracted from Plant Cells for Diabetes Therapy Xiao Xin 1 Guo Yuliang 1 https://orcid.org/0000-0003-2849-7533 Msomi Nontokozo Zimbili 2 https://orcid.org/0000-0003-0309-9491 Islam Md. Shahidul 3 Chu Maoquan 1 * Marunaka Yoshinori Academic Editor 1 xinxiao_josh@tongji.edu.cn 2 3 * mqchu98@tongji.edu.cn 19 9 2025 9 2025 26 18 497349 9155 19 8 2025 13 9 2025 16 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Diabetes mellitus (DM) is a complex metabolic disorder characterized by chronic hyperglycemia and associated complications such as cardiovascular disease, nephropathy, retinopathy, neuropathy, and chronic non-healing wounds. Current antidiabetic therapies offer only partial glycemic control and are limited by poor bioavailability, adverse effects, and an inability to prevent disease progression. Plant-derived exosome-like nanoparticles (PENPs) have emerged as a promising class of natural nanocarriers with excellent biocompatibility, low immunogenicity, and intrinsic multi-component bioactivity. However, few reviews have addressed recent progress in PENPs for DM therapy. To capture the recent developments in this area, this review provides a systematic synthesis of recent advances in PENPs for DM therapy, covering plant sources, extraction and purification methods, molecular compositions, and therapeutic mechanisms. Preclinical studies have demonstrated that PENPs can improve hyperglycemia, enhance insulin sensitivity, regulate hepatic lipid metabolism, and promote wound healing by modulating oxidative stress, inflammation, gut microbiota, glucose metabolism, and insulin signaling. Additionally, PENPs have been shown to promote angiogenesis via glycolytic reprogramming. Despite these promising findings, challenges including scalable isolation, standardized physicochemical characterization, and clinical translation remain. Future directions include engineering multifunctional PENPs, establishing Good Manufacturing Practice (GMP)-compliant production, and conducting clinical trials to facilitate their integration into precision therapeutics for diabetes management. plant-derived exosome-like nanoparticles diabetes and its complications natural nanocarriers nanobiomedicine precision therapy Shanghai Pujiang Program of the Shanghai Magnolia Talent Plan 24PJA132 This research was sponsored by the Shanghai Pujiang Program of the Shanghai Magnolia Talent Plan, a co-funded initiative of the Shanghai Municipal Government, awarded to Xin Xiao (Grant No. 24PJA132). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Diabetes mellitus (DM) has emerged as a critical global health burden [ 1 2 3 4 5 6 7 Standard treatments for T2DM include insulin and metformin, alongside newer agents such as glucagon-like peptide-1 (GLP-1) receptor agonists and sodium–glucose cotransporter 2 inhibitors [ 8 9 10 11 12 13 14 15 16 Exosomes are nano-sized extracellular vesicles first described by Johnstone et al. in 1987 [ 17 18 19 20 21 The field of plant-derived exosomes was initiated in 2009, when Regente et al. reported the presence of exosome-like vesicles in sunflower seedlings using transmission electron microscopy and proteomic analysis [ 22 23 24 25 26 27 28 29 30 31 32 33 34 35 Emerging evidence suggests that PENPs modulate oxidative stress [ 36 37 38 39 40 41 42 This review aims to provide a comprehensive overview of recent advancements in the field, focusing on (i) the biogenesis, structural characteristics, and in vivo behavior of PENPs; (ii) their molecular mechanisms in regulating metabolic and inflammatory pathways; (iii) preclinical evidence supporting their therapeutic efficacy and delivery advantages; and (iv) existing bottlenecks and prospective strategies for clinical translation. Unlike previous reviews that broadly surveyed PENPs in diverse biomedical contexts [ 24 42 Figure 1 2. Biogenesis Mechanisms of PENPs According to the Food and Agriculture Organization of the United Nations, more than 50,000 plant species with pharmacological potential have been identified worldwide, offering a vast natural reservoir for the development of PENPs [ 43 44 45 46 47 48 49 Momordica charantia 50 Panax ginseng 51 Pueraria lobata 52 Lonicera japonica 53 Portulaca oleracea 54 55 As early as the 1960s, MVBs were observed in carrot cell cultures fusing with the plasma membrane to release vesicles, providing early evidence of their role in extracellular vesicle secretion [ 56 Citrus paradisi 57 Figure 2 58 Arabidopsis thaliana 58 Overall, existing studies support the view that the MVB pathway serves as the predominant mechanism for constitutive PENP secretion across diverse plant species whereas the vacuole-associated route functions mainly as a stress-inducible and context-dependent alternative. By contrast, the EXPO pathway remains insufficiently characterized, and its evolutionary conservation has yet to be established. 3. Structural and Compositional Characteristics of PENPs 3.1. Proteins PENPs are enriched with a diverse array of functional proteins, including stress-responsive proteins, defense-associated proteins, annexins, aquaporins, heat shock proteins, metabolic enzymes, and signal transduction mediators [ 24 59 22 60 The proteomic profiles of PENPs vary significantly across plant species, influencing their biological interactions and uptake mechanisms. For instance, lectin-like proteins present on the surface of garlic-derived PENPs have been shown to bind specifically to CD98 receptors on HepG2 cells, thereby facilitating endocytic internalization. Consequently, blocking CD98 markedly reduces uptake efficiency [ 61 62 Stevia rebaudiana Vaccaria hispanica 63 42 3.2. Lipids Lipids form the structural backbone of PENPs and play essential roles in vesicle biogenesis, membrane stability, transmembrane transport, and cellular recognition. Recent studies have identified that PENPs are typically rich in phospholipids such as phosphatidic acid (PA), phosphatidylethanolamine (PE), phosphatidylcholine (PC), and plant-specific glycolipids including digalactosyldiacylglycerol (DGDG) and monogalactosyldiacylglycerol (MGDG). The composition and abundance of lipid species vary markedly among plant-derived sources, resulting in differences in biodistribution, cellular uptake, and functional properties. For example, grapefruit-derived PENPs are predominantly composed of PE and PC (approximately 46% and 29%, respectively) and exhibit enhanced intestinal absorption with preferential hepatic accumulation [ 64 65 66 32 Table 1 Lipid composition also modulates interactions with the gut microbiota. Experimental evidence indicates that PA-enriched PENPs are preferentially internalized by Lactobacillus Ruminococcus 39 67 In addition to structural and targeting functions, lipid constituents of PENPs have demonstrated intrinsic therapeutic activities. For instance, PA-enriched ginger-derived PENPs exhibit antimicrobial effects by binding to the hemin-binding protein 35 (HBP35) of Porphyromonas gingivalis 68 65 66 Notably, lipid composition can be influenced by extraction conditions, including buffer pH and endogenous phospholipase activity. For example, ginger-derived PENPs purified at acidic pH (4–5) exhibited more intense lipid-band signals and higher polyphenol content, suggesting a pH-dependent enrichment of certain lipid classes and improved vesicle yield [ 69 70 3.3. Nucleic Acids PENPs are enriched with small RNAs, particularly miRNAs, which function as key non-coding regulators in intercellular signaling and gene expression modulation [ 71 72 73 74 Remarkably, plant-derived miRNAs can mediate cross-kingdom regulation when delivered via PENPs. Several plant miRNAs have been identified in human serum, where they modulate mammalian gene expression in a manner analogous to endogenous miRNAs [ 33 LDLRAP1 miR156a miR167a b c miR166a b c d e PIK3R1 STAT1 34 miR-162 miR-156e 35 Additionally, Osa-miR-530-5p ORF1ab 28 mdomiR7267-3p ycnE 39 Figure 3 miR156a JAM-A 75 3.4. Functional Small Molecules PENPs are also rich in functional small molecules and secondary metabolites including gingerols, saponins, isothiocyanates, polysaccharides, and polyphenols that significantly contribute to their bioactivity. For instance, ginger-derived PENPs contain 6-gingerol and 6-shogaol, compounds known for their potent anti-inflammatory properties [ 76 32 77 The accumulation of small molecules in PENPs is influenced by plant species, tissue type, and extraction parameters, all of which can alter the encapsulated metabolite profiles. For example, different density fractions of ginger-derived PENPs contain varying amounts of shogaol, suggesting a relationship between vesicle density and compound loading specificity. In another study, sulforaphane was selectively enriched in the 100,000× g 49 Encapsulation within PENPs significantly improves the pharmacokinetics and targeting of bioactive compounds. Compared to free molecules, PENP-encapsulated agents exhibit enhanced oral bioavailability, improved gastrointestinal stability, and increased tissue-targeting capability. For instance, in studies, β-glucan, which typically demonstrates poor BBB permeability, was able to penetrate the central nervous system when delivered via oat-derived PENPs, thereby alleviating alcohol-induced neuroinflammation and cognitive impairment [ 68 78 64 4. Extraction and Purification Methods of PENPs 4.1. Pre-Treatment of Plant Tissues The extraction of PENPs requires an initial tissue pre-treatment step to facilitate the release of extracellular vesicles. Two commonly employed strategies are tissue disruption and apoplastic infiltration–centrifugation, each offering distinct advantages in terms of yield and purity [ 79 4.1.1. Tissue Disruption Method This approach involves the mechanical homogenization of plant tissues to produce a crude slurry, followed by differential centrifugation to remove cellular debris and isolate vesicles. It is simple to implement and well-suited for large-scale processing. For example, De Robertis et al. utilized this method in combination with ultrafiltration to extract high concentrations of blueberry-derived PENPs [ 35 4.1.2. Apoplastic Infiltration–Centrifugation Method This technique involves the vacuum-assisted infiltration of buffer into the leaf apoplast, followed by low-speed centrifugation to collect extracellular vesicles with minimal intracellular contamination. Rutter et al. successfully employed this method to isolate high-purity PENPs from Arabidopsis thaliana 80 4.2. Overview of Extraction and Purification Strategies A diverse range of strategies has been developed for the extraction and purification of PENPs. Differential centrifugation (DC) remains the most commonly employed initial method, suitable for bulk vesicle recovery [ 81 82 83 84 Immunoaffinity capture allows for high-specificity isolation based on candidate vesicle surface markers such as plant tetraspanin-8 (TET8), PEN1, and ATP-binding cassette transporter G36 (PEN3) [ 55 80 85 86 45 87 88 89 Table 2 4.3. Extraction Strategy Selection and Yield Enhancement Approaches Building on these comparative trade-offs ( Table 2 42 57 90 24 91 92 93 87 42 94 In parallel, yield enhancement strategies must consider both physiological and processing variables. For instance, modulating buffer pH has been shown to promote MVB fusion and enhance vesicle secretion, thereby improving overall extraction efficiency [ 69 80 95 63 96 5. Physicochemical Characterization of PENPs The physicochemical characteristics of PENPs are fundamental to their biological activity and therapeutic potential. Key parameters such as particle size, surface charge (zeta potential), and morphology govern in vivo stability, cellular uptake mechanisms, and the transmembrane transport efficiency of PENPs. Reported data indicate that PENPs typically range from 30 to 500 nm in diameter, with zeta potentials varying from neutral to approximately −50 mV [ 97 98 Particle size measurement is most commonly performed using dynamic light scattering (DLS) and nanoparticle tracking analysis (NTA). DLS provides rapid estimations of average particle size but suffers from limited resolution in polydisperse samples, where the size difference between particles must exceed a factor of three to be distinguishable [ 99 100 Morphological characterization is typically conducted using TEM, cryogenic electron microscopy (Cryo-EM), and atomic force microscopy (AFM) [ 101 102 103 Given that PENP preparations often contain non-vesicular contaminants, sample purity represents a critical determinant of characterization accuracy. For example, You et al. reported that cabbage-derived PENPs reached a particle concentration of approximately 10 10 44 11 104 105 6. In Vivo Transport and Biodistribution of PENPs 6.1. Cellular Uptake Mechanisms and Intracellular Fate of PENPs Efficient cellular internalization by mammalian cells is a prerequisite for PENPs to exert biological functions or serve as drug delivery vehicles [ 23 30 64 106 47 Current findings indicate that PENPs enter target cells via three principal pathways. First, PENPs may directly fuse with the plasma membrane, allowing for the immediate release of their cargo into the cytosol. Second, PENPs are frequently internalized via endocytic processes, including macropinocytosis, caveolin-mediated endocytosis, and clathrin-mediated endocytosis. These nonspecific mechanisms have been widely supported by experimental data across diverse plant sources and cellular models. For instance, in macrophages and intestinal stem cells, cytochalasin D treatment significantly reduced the uptake of grapefruit-derived PENPs, implicating macropinocytosis [ 70 48 59 The third uptake mechanism is receptor-mediated endocytosis, driven by specific interactions between surface glycoproteins or proteins on PENPs and receptors on the target cell membrane. For example, type II lectins on garlic-derived PENPs have been shown to specifically bind CD98 glycoproteins on HepG2 cell membranes, thereby promoting receptor-dependent internalization, as schematically illustrated in Figure 4 61 PENP uptake efficiency is influenced by multiple variables and often displays clear time- and dose-dependent patterns. For example, blueberry-derived PENPs demonstrate dose-dependent internalization in endothelial cells whereas ginseng-derived PENPs exhibit progressive accumulation in mesenchymal stem cells over time [ 44 107 55 Importantly, cellular internalization does not necessarily ensure effective intracellular delivery. Evidence suggests that internalized PENPs are frequently trafficked into the endosomal–lysosomal system, where their cargo may undergo degradation. For example, in a study, grapefruit-derived PENPs were observed to colocalize with lysosomes in HaCaT cells within six hours post uptake, suggesting that acidic lysosomal environments may inactivate their bioactive components [ 47 108 6.2. Biodistribution Patterns and Delivery Strategy-Dependent Effects of PENPs The biodistribution characteristics of PENPs play a critical role in determining their delivery efficiency and therapeutic specificity. Among the key factors influencing in vivo transport and organ accumulation are the route of administration and the vesicle lipid composition. PENPs from different plant origins exhibit diverse systemic stability and tissue distribution profiles, with their therapeutic efficacy being strongly dependent on delivery modality and structural attributes. In particular, lipid composition significantly affects biodistribution. For example, ginger-derived PENPs enriched in PA display strong intestinal adhesion and prolonged mucosal retention [ 109 68 Different administration routes result in distinct pharmacokinetic behaviors and tissue distribution profiles, allowing for application across various disease contexts. Oral administration offers superior patient compliance and is well-suited for chronic conditions, particularly those related to gastrointestinal disorders. Multiple studies have demonstrated that orally delivered PENPs predominantly accumulate in the distal small intestine, cecum, and colon, where they are taken up by intestinal stem cells and macrophages. For instance, ginger-derived PENPs have been shown to reach the liver via the bloodstream, bypassing the lymphatic system. This supports their role in gut–liver axis regulation [ 98 110 57 Intravenous injection circumvents gastrointestinal degradation and first-pass metabolism, thereby enhancing systemic stability and promoting targeted organ delivery. DiR-based fluorescence imaging has revealed that ginseng-derived PENPs predominantly accumulate in the liver and spleen following intravenous or intraperitoneal administration. This persists in circulation beyond 48 h, indicating a relatively long systemic half-life [ 111 112 47 70 Transdermal and intranasal routes represent non-invasive delivery alternatives that are especially promising for localized wound repair and brain-targeted therapy, respectively. Studies have shown that broccoli-derived PENPs can penetrate the stratum corneum and reach the dermal layer [ 113 70 114 Table 3 7. Engineering Strategies and Therapeutic Applications of PENPs as Drug Delivery Platforms 7.1. Surface Engineering and Functionalization of PENPs Surface engineering and the functionalization of PENPs constitute pivotal strategies to enhance their drug delivery efficiency, targeting specificity, and therapeutic performance. Rational surface modification enables improved drug loading capacity and facilitates selective accumulation in specific tissues or cell types, thereby optimizing treatment outcomes. Initial engineering efforts have primarily focused on passive targeting approaches. For example, surface conjugation with hydrophilic polymers such as PEG has been widely employed to prolong systemic circulation and enhance biocompatibility. PEGylated PENPs exhibit extended blood half-life and reduced clearance by the reticuloendothelial system (RES) [ 115 116 65 117 118 7.2. Advantages of PENPs as Drug Carriers PENPs offer several advantages as drug delivery vehicles owing to their natural origin, excellent biocompatibility, and low immunogenicity. As illustrated in Figure 1 24 64 70 31 7.3. Drug Loading Techniques To achieve efficient therapeutic delivery and enhance the bioavailability of therapeutic cargos, a variety of drug loading techniques have been developed for PENPs. Common strategies include co-incubation, sonication, electroporation, and freeze–thaw cycling. Each method differs in terms of operational complexity, drug compatibility, and encapsulation efficiency, and is selected based on specific physicochemical properties and delivery requirements. Co-incubation is the most commonly used and technically straightforward method, relying on the passive diffusion of drug molecules into PENPs by co-incubating them at an optimal temperature. This approach is particularly suitable for hydrophobic drugs. However, it exhibits limited efficiency for hydrophilic molecules and lacks precise control over encapsulation rates. For instance, in an attempt to encapsulate miRNA mimics such as hsa-miR-340 119 116 BACE1 120 121 122 90 Each loading technique presents trade-offs between ease of operation, encapsulation yield, and vesicle stability. Therefore, method selection should be guided by the physicochemical properties of the drug and the intended therapeutic application. Recent studies suggest that combinatorial strategies including sonication followed by co-incubation can further enhance encapsulation efficiency and bioavailability [ 123 7.4. Drug Delivery Applications As a natural nanocarrier system, PENPs exhibit outstanding biocompatibility, high cellular uptake efficiency, and inherent cross-species delivery capability. These properties have enabled their successful application across a wide range of disease models. Their unique lipid bilayer structure supports the encapsulation of both small-molecule compounds and macromolecular biologics, such as nucleic acids and proteins. This enables PENPs to hold substantial potential in the treatment of cancers, inflammatory disorders, autoimmune diseases, and metabolic syndromes [ 124 125 In oncology, PENPs have demonstrated enhanced tumor-targeting efficacy, particularly when surface-engineered with disease-specific ligands. This modification enables the precise delivery of chemotherapeutic agents while minimizing systemic toxicity. For example, folic-acid-modified ginger-derived PENPs selectively bind to folate receptors overexpressed on tumor cells. This targeted interaction results in increased siRNA delivery to the tumor site, enhanced antitumor activity, and reduced off-target cytotoxicity [ 117 Figure 5 126 Additionally, lemon-derived PENPs have been employed to deliver TRAIL pathway activators, inducing apoptosis in chronic myeloid leukemia (CML) cells and highlighting their potential utility in tumor immunotherapy [ 30 In the field of inflammation and immune regulation, PENPs have shown significant therapeutic benefits. Grape-derived PENPs have effectively targeted lamina propria macrophages in murine colitis, delivering the immunosuppressive agent methotrexate and alleviating key inflammatory symptoms, including colon shortening, weight loss, and tissue injury [ 64 49 127 Collectively, these findings underscore the high targeting specificity, biological stability, and therapeutic versatility of PENPs across diverse disease contexts. With continued advances in drug loading and surface engineering technologies, PENPs are poised to evolve into next-generation, multifunctional, and low-toxicity nanocarriers, facilitating clinical translation in the treatment of major chronic and immune-mediated diseases. 8. Mechanisms of PENPs in the Treatment of Diabetes and Its Complications 8.1. Antioxidant and Anti-Inflammatory Activities Oxidative stress and chronic low-grade inflammation are widely recognized as key pathogenic drivers in the onset and progression of T2DM [ 128 129 130 Recent studies have identified PENPs, which are enriched in antioxidative and immunomodulatory components, as promising natural nanotherapeutics capable of mitigating diabetes-induced oxidative and inflammatory damage. For instance, PENPs derived from mung bean sprouts were shown to activate the Nrf2/heme oxygenase-1 (HO-1) pathway, increase the activity of glutathione peroxidase (GSH-Px) and superoxide dismutase (SOD), and reduce hepatic malondialdehyde (MDA) levels, thereby attenuating lipid peroxidation and preserving liver function [ 131 Figure 6 Similarly, a dual-delivery system composed of Rumex acetosa 8 65 132 In addition to their antioxidative functions, PENPs exert potent anti-inflammatory effects. GDNPs have been shown to modulate the gut–liver axis, downregulate pro-inflammatory cytokines (TNF-α, IL-6), and upregulate the anti-inflammatory cytokine IL-10 in diabetic models [ 65 Aloe vera Curcuma longa Gardenia jasminoides 133 Notably, lemon-derived PENPs embedded in a biofunctional hydrogel have been shown to induce M2 macrophage polarization, characterized by the downregulation of inducible nitric oxide synthase (iNOS) and TNF-α, upregulation of arginase-1 (Arg-1) and IL-10, and suppression of nuclear factor-kappa B (NF-κB) signaling. These changes ultimately remodel the inflammatory microenvironment in diabetic wounds [ 134 Akkermansia muciniphila 40 Collectively, these findings suggest that PENPs orchestrate antioxidant and immunoregulatory responses through multiple signaling axes, including the Nrf2/HO-1, NF-κB, and aryl hydrocarbon receptor (AhR) pathways. These mechanisms provide a promising foundation for the development of multi-targeted therapeutic strategies for T2DM and its complications. However, the current evidence remains largely restricted to preclinical studies, and further investigation is required to assess long-term efficacy and clinical safety. 8.2. Modulation of Gut Microbiota and Immune Homeostasis The dysregulation of the gut microbiota is closely associated with the pathogenesis of T2DM [ 135 136 137 138 As multifunctional natural nanocarriers, PENPs have demonstrated significant potential in modulating gut microbial composition, reinforcing epithelial barrier function, and reestablishing immune homeostasis. In diabetic mouse models, a dual-delivery system comprising Rumex acetosa Dubosiella Lachnospiraceae Helicobacter 139 Additional studies reported that the ginger-derived HMS/A@GE platform promoted the expansion of Lactobacillus 132 Likewise, PENPs derived from orange peel were shown to modulate bile acid metabolism and promote SCFA production in db db 41 Akkermansia muciniphila 40 Moreover, ginger-derived PENPs (GDNPs) were reported to activate the Forkhead box A2 (Foxa2) signaling pathway, enhance the expression of tight junction proteins in the small intestine, and alleviate inflammation through reductions in ROS ( Figure 7 65 2 65 132 In summary, PENPs exert multifaceted regulatory effects on diabetes-associated gut dysbiosis by promoting probiotic colonization, elevating SCFA and tryptophan-derived metabolite production, reinforcing epithelial barrier architecture, and suppressing inflammatory signaling. These integrated actions highlight the promise of PENPs as microbiota-targeted nanotherapeutics for immune metabolic diseases such as T2DM. Nevertheless, despite these therapeutic benefits in diabetic models, the long-term safety of PENP-mediated microbiota modulation remains poorly defined. In particular, potential risks such as unintended alterations in microbial composition, persistence or reversibility after treatment withdrawal, and interactions with dietary factors or antibiotics have not been systematically investigated. To address these unresolved issues, future studies should incorporate longitudinal multi-omics approaches and dose–response designs. 8.3. Regulation of Glucose Metabolism and Insulin Signaling Pathways The pathogenesis of T2DM is primarily characterized by insufficient insulin secretion and peripheral insulin resistance, resulting in impaired glucose uptake and increased hepatic gluconeogenesis [ 140 141 An increasing body of evidence suggests that PENPs exert significant regulatory effects on glucose metabolism and insulin signaling pathways. In high-fat diet and streptozotocin (HFD/STZ)-induced diabetic mice, mung-bean-sprout-derived PENPs significantly lowered fasting blood glucose, total cholesterol, and triglyceride levels. These improvements were accompanied by enhanced performance in oral glucose tolerance tests (OGTTs) and insulin tolerance tests (ITTs), reduced hepatic lipid deposition, and improved islet morphology and functional preservation [ 131 A dual-delivery formulation composed of Rumex acetosa 139 Ginger-derived PENPs were shown to enhance the intestinal expression of glucose transporter 2 and facilitate glucose translocation by upregulating the Foxa2 signaling axis, effectively mitigating HFD-induced insulin resistance [ 65 2 132 Similarly, orange-peel-derived PENPs restored the expression of key metabolic regulators including peroxisome proliferator-activated receptor gamma coactivator 1-alpha (PGC-1α), insulin receptor substrate-1 (IRS-1), and GLUT4 in db db 41 Akkermansia muciniphila 40 Collectively, PENPs orchestrate metabolic reprogramming through multiple synergistic pathways. On one hand, they activate PI3K/Akt and AMPK signaling to inhibit gluconeogenesis and lipogenesis while promoting glucose uptake and utilization. On the other hand, they enhance the expression of glucose transporters and stimulate GLP-1 secretion, thereby indirectly improving insulin sensitivity and islet function. These therapeutic effects are frequently accompanied by reductions in systemic inflammation and oxidative stress, highlighting the promise of PENPs in mediating multi-targeted metabolic regulation. Future studies should focus on elucidating the upstream molecular targets and signaling networks responsible for these effects to support the clinical translation of PENP-based metabolic interventions. 8.4. Promotion of Angiogenesis and Metabolic Reprogramming Diabetic microangiopathy and ischemic tissue injury, particularly impaired wound healing, are closely associated with defective angiogenesis and local metabolic dysfunction [ 142 57 Ginseng-derived PENPs are enriched with bioactive constituents, notably specific miRNAs and ginsenosides Rg1, Re, and Rb1. In a study, in high-glucose-stimulated human umbilical vein endothelial cells (HUVECs), these PENPs significantly upregulated glycolytic enzymes including phosphofructokinase muscle-type (PFKM), phosphoglycerate kinase 1 (PGK1), and enolase 1 (ENO1). Consequently, anaerobic glycolysis was upregulated, leading to an increase in intracellular ATP levels and suppression of mitochondrial oxidative phosphorylation ( Figure 8 143 db db 143 Lemon-derived PENPs embedded within functionalized hydrogels promoted M2 macrophage polarization in diabetic wounds, enhanced endothelial nitric oxide synthase (eNOS) expression and nitric oxide (NO) production, and downregulated pro-inflammatory markers such as inducible nitric oxide synthase (iNOS) and tumor necrosis factor-alpha (TNF-α) in a study. These immunomodulatory effects contributed to improved local immune homeostasis and endothelial function [ 134 134 Taken together, these findings highlight that PENPs support diabetic tissue repair through multifactorial mechanisms involving metabolic rewiring, immunomodulation, and angiogenic activation. By enhancing glycolytic flux and energy availability, PENPs promote endothelial cell proliferation and migration. Simultaneously, they modulate macrophage phenotypes and inflammatory pathways to generate a regenerative niche conducive to neovascularization and wound healing. In summary, PENPs represent a promising nanotherapeutic modality for the management of diabetic vascular complications, chronic non-healing wounds, and ischemia-associated disorders. Their integration into biomaterial-based delivery systems may further enhance targeting precision, therapeutic responsiveness, and tissue-specific regeneration, paving the way for next-generation regenerative nanomedicine. 9. Application of PENPs in the Treatment of Diabetes and Its Complications Despite recent advances in conventional therapies for diabetes, the long-term use of hypoglycemic agents remains associated with several limitations, including adverse side effects, drug resistance, and the disruption of metabolic homeostasis. As a result, natural plant-derived bioactive constituents have attracted growing attention in biomedical research due to their multi-targeted mechanisms, improved safety profiles, and intrinsic biocompatibility. The integration of nanotechnology into the delivery of these phytochemicals has been actively investigated as a strategy to enhance their therapeutic efficacy and overcome barriers such as poor solubility, low bioavailability, and instability in physiological environments [ 144 145 For example, pterostilbene-loaded nanoparticles significantly reduced blood glucose levels following intravenous administration in diabetic rat models [ 146 147 27 Against this backdrop, PENPs have emerged as a novel and promising platform in the treatment of diabetes and its associated complications. Unlike synthetic nanocarriers, PENPs possess a dual-functional role, acting both as endogenous nanocarriers and as intrinsic bioactive agents [ 108 57 148 149 9.1. Antihyperglycemic Effects In high-fat diet/streptozotocin (HFD/STZ)-induced T2DM mouse models, mung-bean-sprout-derived PENPs have demonstrated pronounced antihyperglycemic effects. These PENPs significantly lowered fasting blood glucose levels, improved glucose tolerance in OGTT, and enhanced insulin sensitivity in ITT. Furthermore, treatment with mung-bean-sprout-derived PENPs effectively alleviated hepatic lipid accumulation and increased the islet β-cell area, indicating improved pancreatic function and β-cell preservation [ 131 Similarly, a dual-carrier exosomal platform composed of Rumex acetosa-derived PENPs and selenium nanoparticles (TB-ELNs@SeNPs) exhibited robust glycemic control in T2DM mice. This hybrid system significantly reduced fasting blood glucose levels, improved glucose tolerance, attenuated dysregulated lipid metabolism, and broadly ameliorated metabolic disturbances in diabetic animals [ 139 Collectively, these findings underscore the potential of PENPs to restore glucose homeostasis and enhance pancreatic islet function in diabetic models. Nevertheless, the precise molecular mechanisms underlying these effects remain to be fully elucidated and warrant further investigation. 9.2. Amelioration of Hepatic Lipid Metabolism Dysregulation Non-alcoholic fatty liver disease and T2DM frequently coexist, sharing key pathophysiological features such as hepatic lipid accumulation and insulin resistance [ 150 151 In db db 41 Figure 9 Furthermore, the HMS/A@GE platform, which consists of a borane and ginger composite system, exhibited potent hepatoprotective effects in HFD-induced T2DM models. By co-delivering ginger-derived PENPs and molecular H 2 132 Figure 10 Collectively, PENPs exert multifaceted regulatory effects on hepatic lipid metabolism in diabetes by modulating lipid synthesis and degradation pathways, reducing oxidative stress, restoring gut barrier function, and rebalancing microbiota composition. Future studies should focus on elucidating the underlying signaling pathways, transcriptional regulators, and lipid droplet metabolism networks involved in PENP-mediated hepatic protection to facilitate clinical translation. 9.3. Therapeutic Applications of PENPs in Diabetic Wound Healing Chronic, non-healing wounds are a prevalent and challenging complication of DM, primarily driven by sustained hypoxia, chronic inflammation, impaired angiogenesis, and reduced cellular migration [ 152 Studies on ginseng-derived exosomes (GExos) have revealed that these nanovesicles are enriched with functional miRNAs and active ginsenosides, notably Rg1, Re, and Rb1. GExos were shown to enhance glycolytic metabolism, elevate intracellular ATP production, and activate key regenerative pathways including PI3K/Akt and eNOS signaling. In a full-thickness skin wound model using db db 143 Similarly, lemon-derived PENPs incorporated into a functionalized hydrogel matrix significantly modulated the diabetic wound microenvironment. This hydrogel system promoted M2 macrophage polarization, upregulated IL-10 expression, and inhibited iNOS expression, thereby reducing local inflammation and improving tissue perfusion. These immunomodulatory and angiogenic effects facilitated granulation tissue formation and neovascularization. Furthermore, the hydrogel exhibited favorable bioadhesive and sustained-release properties, allowing prolonged PENP activity at the wound site [ 134 Figure 11 In another study, a composite chitosan nanomembrane loaded with PENPs derived from aloe ( Aloe barbadensis Zingiber officinale Azadirachta indica 133 Collectively, these findings suggest that PENPs accelerate diabetic wound healing through multiple synergistic mechanisms, including the promotion of angiogenesis, immune microenvironment remodeling, and the stimulation of cellular migration and tissue regeneration. Future research should focus on the development of targeted PENP-based hydrogels, stimuli-responsive delivery systems, and combination therapies with stem cells or bioceramic scaffolds to establish comprehensive and integrative strategies for managing chronic diabetic wounds. Although preclinical studies of PENPs in diabetes have yielded promising results, substantial methodological limitations persist. Most investigations rely on fixed dosing regimens without systematic evaluations of dose–response relationships or pharmacokinetic parameters. Evidence regarding long-term safety, in vivo stability, biodistribution, and the durability of therapeutic effects after single administration remains scarce, and findings are frequently restricted to single animal models with limited reproducibility. Future research should prioritize establishing dose–response relationships, elucidating pharmacokinetics and biodistribution, assessing long-term safety, and validating efficacy across models to advance clinical translation. Furthermore, extracellular vesicles from mammalian sources, such as adipose tissue, hepatocytes, and mesenchymal stem cells, have also exhibited antioxidant, immunomodulatory, and metabolic regulatory effects in diabetic models [ 153 154 10. Current Challenges and Future Directions 10.1. Challenges and Optimization Strategies in the Development of PENPs PENPs have emerged as highly promising natural nanocarriers for the treatment of diabetes due to their favorable biocompatibility, multi-component bioactivity, and widespread availability. However, several critical challenges continue to hinder their development. Firstly, the lack of standardized protocols for isolation and purification remains a major obstacle. Common methods such as ultracentrifugation, density-gradient centrifugation, and ultrafiltration often suffer from inconsistent operational parameters, low yield, and significant batch-to-batch variability. These limitations impede reproducibility and restrict scalability for industrial application. Furthermore, the physiological status of the plant species, tissue types, harvest time, and processing methods can introduce substantial heterogeneity in particle size, composition, and biofunctionality. Secondly, the natural constituents of PENPs, including microRNAs, polyphenols, and proteins, exhibit complex pharmacological activities. Potential synergistic or antagonistic interactions between these bioactive components and the therapeutic cargos may influence the ultimate efficacy. Yet, comprehensive studies on these interaction mechanisms are still lacking, introducing uncertainty for clinical translation. Thirdly, insufficient targeting capability remains a bottleneck for effective delivery. Due to the limited presence of functional surface proteins on native PENPs, nonspecific biodistribution often occurs in vivo. Although exogenous ligand modification has been explored to enhance tissue-specific targeting, concerns regarding immunogenicity have not been adequately addressed, particularly in diabetic populations where immune responses are often dysregulated. Moreover, a unified nomenclature, classification criteria, and quality control metrics for PENPs have not been established. Systematic toxicological evaluation, especially for non-oral routes such as intravenous administration, is also lacking. Although a few preliminary clinical trials have investigated the oral safety of PENPs, the field remains in its infancy. 10.2. Challenges in the Treatment of Diabetes of PENPs Despite the remarkable potential of PENPs as natural nanodelivery systems, their application in the treatment of diabetes and its complications remains at an early stage. To facilitate effective clinical translation, several disease-specific challenges must be addressed. Diabetes is characterized by a complex pathophysiology that involves multiple target organs, including the liver, pancreas, kidneys, and skin. However, current studies have not systematically evaluated the biodistribution, targeting specificity, or delivery efficiency of PENPs in these tissues. The diabetic microenvironment is often dominated by chronic hyperglycemia and low-grade inflammation. These pathological conditions may compromise the structural stability and functional integrity of PENPs, thereby diminishing their therapeutic potential. Another critical issue concerns the interaction of PENPs with conventional antidiabetic medications. There is currently insufficient evidence to determine whether PENPs are compatible or synergistic with mainstream therapies, such as insulin analogs, metformin, GLP-1R agonists, or sodium–glucose co-transporter 2 (SGLT2) inhibitors. Moreover, diabetic patients exhibit considerable heterogeneity in metabolic phenotypes, underscoring the urgent need for predictive biomarkers and therapeutic response criteria to identify suitable patient populations. Without individualized selection strategies, future clinical trials may face challenges in efficacy evaluation and safety assessment. 10.3. Barriers in the Treatment of Diabetic Complications The treatment of diabetic complications frequently involves overcoming multiple physiological barriers, including the skin barrier in chronic non-healing wounds, the BBB in diabetic encephalopathy, and the glomerular filtration barrier in diabetic nephropathy. Although some studies suggest that PENPs are capable of penetrating these barriers, their performance under chronic pathological conditions remains largely unverified. For instance, it is still unclear whether PENPs can effectively access fibrotic or ischemic tissues and maintain functional activity within injured microenvironments such as diabetic wounds or fibrotic renal tissues. Moreover, most existing research has been conducted in acute or short-term animal models. However, long-term studies assessing the stability, tolerability, and immune responses of PENPs during prolonged disease progression are still lacking. This absence of chronic exposure data limits the comprehensive evaluation of safety and reduces the translational relevance of PENPs for treating chronic diabetic complications. In addition to wound healing and diabetic nephropathy, diabetes is commonly associated with severe complications such as cardiovascular disease, diabetic retinopathy, and both central and peripheral neuropathies. However, investigations into the therapeutic potential of PENPs for these conditions are extremely limited. For example, no study has systematically evaluated the role of PENPs in modulating cardiac inflammation, endothelial dysfunction, or vascular remodeling, all of which are recognized as key mechanisms in the development of diabetic cardiovascular complications. Similarly, it remains poorly understood whether PENPs can effectively cross the blood–retina barrier, maintain retinal vascular integrity, or alleviate oxidative stress and inflammatory responses within the retinal microenvironment. While preliminary evidence suggests the neuroprotective potential of PENPs, their specific role in diabetic neuropathy has not been directly demonstrated. Research into their mechanisms of action in regulating neuroinflammation, axonal injury, Schwann cell function, or neurotrophic factor signaling remains scarce. These knowledge gaps highlight the pressing need for systematic investigations into the use of PENPs in the management of high-burden diabetic complications. Addressing these issues may enable the development of multi-targeted therapeutic strategies that simultaneously alleviate metabolic dysregulation and organ-specific damage. 10.4. Translational Barriers and Application Limitations Despite promising preclinical data, the clinical translation of PENPs is limited by key challenges, notably the lack of standardized experimental models. Differences in the use of high-fat diet combined with streptozotocin (HFD/STZ) models, db db Additionally, toxicological assessments remain insufficient. Existing studies predominantly focus on acute toxicity or short-term administration. Comprehensive evaluations of long-term safety, immunogenicity, and potential off-target effects under conditions of chronic or repeated exposure are still lacking. This is particularly critical for vulnerable patient populations, including those with advanced diabetes, impaired renal function, or compromised immune systems. Moreover, the absence of standardized GMP protocols for the large-scale production, purification, and quality control of PENPs represents a significant bottleneck for clinical translation and industrial scalability. 10.5. Future Research Directions PENPs, as natural nanocarrier platforms, have demonstrated excellent biocompatibility and multi-target regulatory potential in the treatment of diabetes and its complications. However, the development of PENPs, from platform construction to clinical application, continues to face multiple challenges, including source variability, compositional complexity, limited targeting efficiency, and the need to maintain structural stability and functional integrity within hyperglycemic and inflammatory microenvironments. To achieve efficient delivery and precise therapy, future research should focus on standardizing production processes, elucidating biological mechanisms, and developing organ-specific delivery strategies. Given that diabetes is a systemic and chronic metabolic disorder characterized by complex clinical phenotypes and a narrow therapeutic window, with complications affecting the cardiovascular system, kidneys, nervous system, retina, and skin, the design and efficacy evaluation of nanomedicine systems is particularly demanding. Therefore, it is necessary to develop delivery platforms based on PENPs that possess enhanced targeting specificity, multimodal regulatory capacity, and adaptability to pathological tissues. A comprehensive progression from mechanistic understanding to precise intervention across multiple pathways should be pursued. A key research priority is the systematic elucidation of the molecular mechanisms by which PENPs exert their therapeutic effects. The application of multi-omics technologies, including transcriptomics, proteomics, lipidomics, and metabolomics, should be employed to systematically investigate the regulatory functions of PENPs in diabetes-related target cells. Particular emphasis should be placed on their involvement in modulating inflammatory responses, oxidative stress, insulin signaling, and metabolic homeostasis. Further clarification of the functional roles and synergistic interactions of endogenous bioactive components within PENPs will facilitate the construction of a regulatory network linking bioactive constituents, molecular targets, and disease phenotypes. Equally important is the enhancement of tissue and organ specificity for PENP-based delivery. Owing to their broad biodistribution in vivo, enhancing delivery specificity to diabetic target organs such as the pancreas, liver, kidneys, myocardium, retina, and nervous system is essential. Approaches such as surface functionalization, the enrichment of natural adhesion molecules, and the engineering of ligand modifications may significantly improve their accumulation within specific tissues and enhance cellular uptake, thereby strengthening local therapeutic efficacy. To ensure therapeutic effectiveness under the adverse microenvironments characteristic of diabetic complications, including acidic pH, hypoxia, and oxidative stress, future efforts should develop hybrid delivery platforms. By integrating PENPs with functional biomaterials including stimuli-responsive hydrogels, antioxidant nanocarriers, and controlled-release systems, one may enhance their stability and sustained bioactivity in pathological tissues. Such strategies may be particularly beneficial in addressing lesions with high microenvironmental sensitivity, including chronic wounds and fibrotic kidney tissues. Furthermore, to address the heterogeneity among diabetic patients, developing predictive biomarkers and individualized strategies is essential. Screening systems based on metabolic profiles and treatment responses, coupled with omics-integrated machine learning models, can further improve patient stratification and optimize clinical trial design. Finally, to support clinical translation, more pathophysiologically relevant animal models that recapitulate the chronic nature of diabetes and its complications should be employed. Long-term, multi-dose exposure studies are needed to comprehensively evaluate safety, immunogenicity, and metabolic effects. Simultaneously, the establishment of GMP-compliant production pipelines and standardized quality control procedures is critical for enabling the scalable production and regulatory approval of PENP-based therapies. In summary, future investigations of PENPs in the treatment of diabetes and its complications should adopt a fully integrated and systematic approach encompassing platform optimization, mechanistic elucidation, targeted delivery, multi-targeted combination therapy, and clinical validation. Through interdisciplinary collaboration and close integration of preclinical and clinical studies, a precision therapeutic paradigm centered on PENPs can be established, offering a practical and effective solution for the comprehensive management of diabetes and its complications. Practically, we propose a staged roadmap comprising three phases. In the first phase, dose–response relationships, biodistribution profiles, and pharmacokinetic baselines of PENPs should be established across at least two diabetic models under harmonized endpoints. In the second phase, repeat-dose toxicology and the immunogenicity of PENPs are expected to be evaluated with prespecified stopping rules and predefined potency criteria. In the third phase, GMP-compliant manufacturing processes for PENPs need to be finalized and validated with defined release specifications, and reporting aligned with MISEV and EV-TRACK ought to be implemented to facilitate regulatory engagement. 11. Conclusions Current evidence indicates that PENPs hold considerable potential as bioactive nanomaterials for diabetes therapy. Although a wide range of studies have demonstrated beneficial effects on oxidative stress, inflammation, metabolic regulation, and tissue repair, the majority of available data remain confined to preclinical models. Moreover, heterogeneity in plant sources, dosing units, and experimental protocols continues to limit the reproducibility and comparability of findings. Future progress will depend on methodological standardization across isolation, purification, and characterization procedures, as well as on the establishment of rigorous quality control systems capable of addressing batch-to-batch and source-related variability. Particular attention should be devoted to systematic investigations of dose–response relationships, pharmacokinetic and biodistribution profiles, and long-term safety under repeat administration since these aspects remain insufficiently documented. To accelerate translation, research efforts need to achieve defined milestones that include reproducible pharmacological outcomes in multiple diabetic models under harmonized endpoints, validated criteria for repeat-dose toxicology and immunogenicity, and the development of GMP-compliant manufacturing processes with clearly defined release specifications. Alignment with international reporting standards such as MISEV and EV-TRACK will further enhance transparency and regulatory preparedness. By addressing these scientific and translational challenges, PENPs may evolve from experimental observations into clinically testable nanotherapeutics with the potential to advance the precision management of diabetes and its complications. Disclaimer/Publisher’s Note: Author Contributions X.X. contributed to literature integration, manuscript drafting, and critical revisions. Y.G. contributed to reference integration and figure preparation. N.Z.M. and M.S.I. assisted with language refinement and structural revision. M.C. conceptualized the review topic, supervised the framework development, assisted in figure design, and contributed to critical revisions. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors report no conflicts of interest. References 1. Ong K.L. Stafford L.K. McLaughlin S.A. Boyko E.J. Vollset S.E. Smith A.E. Dalton B.E. Duprey J. Cruz J.A. Hagins H. GBD 2021 Diabetes Collaborators: Global, regional, and national burden of diabetes from 1990 to 2021, with projections of prevalence to 2050: A systematic analysis for the Global Burden of Disease Study 2021 Lancet 2023 402 203 234 Erratum in Lancet 2025 405 10.1016/S0140-6736(23)01301-6 37356446 PMC10364581 2. International Diabetes Federation IDF Diabetes Atlas 11th ed. International Diabetes Federation Brussels, Belgium 2025 Available online: https://idf.org/news/idf-diabetes-atlas-11th-edition (accessed on 4 July 2025) 3. Zheng Y. Ley S.H. Hu F.B. Global aetiology and epidemiology of type 2 diabetes mellitus and its complications Nat. Rev. Endocrinol. 2018 14 88 98 10.1038/nrendo.2017.151 29219149 4. Forbes J.M. Cooper M.E. Mechanisms of diabetic complications Physiol. Rev. 2013 93 137 188 10.1152/physrev.00045.2011 23303908 5. Yu M.G. Gordin D. Fu J. Park K. Li Q. King G.L. Protective Factors and the Pathogenesis of Complications in Diabetes Endocr. Rev. 2024 45 227 252 10.1210/endrev/bnad030 37638875 PMC10911956 6. Ferguson D. Finck B.N. Emerging therapeutic approaches for the treatment of NAFLD and type 2 diabetes mellitus Nat. Rev. Endocrinol. 2021 17 484 495 10.1038/s41574-021-00507-z 34131333 PMC8570106 7. Wang D.D. Hu F.B. Precision nutrition for prevention and management of type 2 diabetes Lancet Diabetes Endocrinol. 2018 6 416 426 10.1016/S2213-8587(18)30037-8 29433995 8. Gieroba B. Kryska A. Sroka-Bartnicka A. Type 2 diabetes mellitus—Conventional therapies and future perspectives in innovative treatment Biochem. Biophys. Rep. 2025 42 102037 10.1016/j.bbrep.2025.102037 40395625 PMC12090304 9. Shi Q. Nong K. Vandvik P.O. Guyatt G.H. Schnell O. Rydén L. Marx N. Brosius F.C. III Mustafa R.A. Agarwal A. Benefits and harms of drug treatment for type 2 diabetes: Systematic review and network meta-analysis of randomised controlled trials BMJ 2023 381 e074068 10.1136/bmj-2022-074068 37024129 PMC10077111 10. Tsapas A. Avgerinos I. Karagiannis T. Malandris K. Manolopoulos A. Andreadis P. Liakos A. Matthews D.R. Bekiari E. Comparative Effectiveness of Glucose-Lowering Drugs for Type 2 Diabetes: A Systematic Review and Network Meta-analysis Ann. Intern. Med. 2020 173 278 286 10.7326/M20-0864 32598218 11. Bouchoucha M. Uzzan B. Cohen R. Metformin and digestive disorders Diabetes Metab. 2011 37 90 96 10.1016/j.diabet.2010.11.002 21236717 12. Fatima M. Sadeeqa S. Nazir S.U.R. Metformin and its gastrointestinal problems: A review Biomed. Res. 2018 29 2285 2289 10.4066/biomedicalresearch.40-18-526 13. Dornhorst A. Insulinotropic meglitinide analogues Lancet 2001 358 1709 1716 10.1016/S0140-6736(01)06715-0 11728565 14. Desai N. Rana D. Patel M. Bajwa N. Prasad R. Vora L.K. Nanoparticle Therapeutics in Clinical Perspective: Classification, Marketed Products, and Regulatory Landscape Small 2025 21 e2502315 10.1002/smll.202502315 40454890 PMC12288819 15. Zhang P. Xiao Y. Sun X. Lin X. Koo S. Yaremenko A.V. Qin D. Kong N. Farokhzad O.C. Tao W. Cancer nanomedicine toward clinical translation: Obstacles, opportunities, and future prospects Med 2023 4 147 167 10.1016/j.medj.2022.12.001 36549297 16. Afonin K.A. Dobrovolskaia M.A. Ke W. Grodzinski P. Bathe M. Critical review of nucleic acid nanotechnology to identify gaps and inform a strategy for accelerated clinical translation Adv. Drug Del. Rev. 2022 181 114081 10.1016/j.addr.2021.114081 PMC8886801 34915069 17. Johnstone R.M. Adam M. Hammond J. Orr L. Turbide C. Vesicle formation during reticulocyte maturation. Association of plasma membrane activities with released vesicles (exosomes) J. Biol. Chem. 1987 262 9412 9420 10.1016/S0021-9258(18)48095-7 3597417 18. Van Niel G. d’Angelo G. Raposo G. Shedding light on the cell biology of extracellular vesicles Nat. Rev. Mol. Cell Biol. 2018 19 213 228 10.1038/nrm.2017.125 29339798 19. Herrmann I.K. Wood M.J.A. Fuhrmann G. Extracellular vesicles as a next-generation drug delivery platform Nat. Nanotechnol. 2021 16 748 759 10.1038/s41565-021-00931-2 34211166 20. Rezaie J. Feghhi M. Etemadi T. A review on exosomes application in clinical trials: Perspective, questions, and challenges Cell Commun. Signal. 2022 20 145 10.1186/s12964-022-00959-4 36123730 PMC9483361 21. Sergazy S. Adekenov S. Khabarov I. Adekenova K. Maikenova A. Aljofan M. Harnessing Mammalian-and Plant-Derived Exosomes for Drug Delivery: A Comparative Review Int. J. Mol. Sci. 2025 26 4857 10.3390/ijms26104857 40429997 PMC12112361 22. Regente M. Corti-Monzón G. Maldonado A.M. Pinedo M. Jorrín J. de la Canal L. Vesicular fractions of sunflower apoplastic fluids are associated with potential exosome marker proteins FEBS Lett. 2009 583 3363 3366 10.1016/j.febslet.2009.09.041 19796642 23. Mu J. Zhuang X. Wang Q. Jiang H. Deng Z.B. Wang B. Zhang L. Kakar S. Jun Y. Miller D. Interspecies communication between plant and mouse gut host cells through edible plant derived exosome-like nanoparticles Mol. Nutr. Food Res. 2014 58 1561 1573 10.1002/mnfr.201300729 24842810 PMC4851829 24. Dad H.A. Gu T.W. Zhu A.Q. Huang L.Q. Peng L.H. Plant Exosome-like Nanovesicles: Emerging Therapeutics and Drug Delivery Nanoplatforms Mol. Ther. 2021 29 13 31 10.1016/j.ymthe.2020.11.030 33278566 PMC7791080 25. Sasaki D. Suzuki H. Kusamori K. Itakura S. Todo H. Nishikawa M. Development of rice bran-derived nanoparticles with excellent anti-cancer activity and their application for peritoneal dissemination J. Nanobiotechnol. 2024 22 114 10.1186/s12951-024-02381-z PMC10943818 38493106 26. Li D. Cao G. Yao X. Yang Y. Yang D. Liu N. Yuan Y. Nishinari K. Yang X. Tartary buckwheat-derived exosome-like nanovesicles against starch digestion and their interaction mechanism Food Hydrocoll. 2023 141 108739 10.1016/j.foodhyd.2023.108739 27. Abdel-Mageid A.D. Abou-Salem M.E.S. Salaam N.M.H.A. El-Garhy H.A.S. The potential effect of garlic extract and curcumin nanoparticles against complication accompanied with experimentally induced diabetes in rats Phytomedicine 2018 43 126 134 10.1016/j.phymed.2018.04.039 29747745 28. Kalarikkal S.P. Sundaram G.M. Edible plant-derived exosomal microRNAs: Exploiting a cross-kingdom regulatory mechanism for targeting SARS-CoV-2 Toxicol. Appl. Pharmacol. 2021 414 115425 10.1016/j.taap.2021.115425 33516820 PMC7844364 29. Stanly C. Alfieri M. Ambrosone A. Leone A. Fiume I. Pocsfalvi G. Grapefruit-Derived Micro and Nanovesicles Show Distinct Metabolome Profiles and Anticancer Activities in the A375 Human Melanoma Cell Line Cells 2020 9 2722 10.3390/cells9122722 33371199 PMC7766354 30. Raimondo S. Naselli F. Fontana S. Monteleone F. Lo Dico A. Saieva L. Zito G. Flugy A. Manno M. Di Bella M.A. Citrus limon-derived nanovesicles inhibit cancer cell proliferation and suppress CML xenograft growth by inducing TRAIL-mediated cell death Oncotarget 2015 6 19514 19527 10.18632/oncotarget.4004 26098775 PMC4637302 31. Kim J. Zhu Y. Chen S. Wang D. Zhang S. Xia J. Li S. Qiu Q. Lee H. Wang J. Anti-glioma effect of ginseng-derived exosomes-like nanoparticles by active blood-brain-barrier penetration and tumor microenvironment modulation J. Nanobiotechnol. 2023 21 253 10.1186/s12951-023-02006-x PMC10401762 37542285 32. Cao M. Yan H. Han X. Weng L. Wei Q. Sun X. Lu W. Wei Q. Ye J. Cai X. Ginseng-derived nanoparticles alter macrophage polarization to inhibit melanoma growth J. Immunother. Cancer 2019 7 326 10.1186/s40425-019-0817-4 31775862 PMC6882204 33. Zhang L. Hou D. Chen X. Li D. Zhu L. Zhang Y. Li J. Bian Z. Liang X. Cai X. Exogenous plant MIR168a specifically targets mammalian LDLRAP1: Evidence of cross-kingdom regulation by microRNA Cell Res. 2012 22 107 126 10.1038/cr.2011.158 21931358 PMC3351925 34. Chapado L.A. Martín-Hernández R. Hernández de la Red S. Tomé-Carneiro J. Gil-Zamorano J. Ruiz-Roso M.B. Del Saz A. Crespo M.C. Del Pozo-Acebo L. Arantes Ferreira Peres W. Connection between miRNA Mediation and the Bioactive Effects of Broccoli (Brassica oleracea var. italica): Exogenous miRNA Resistance to Food Processing and GI Digestion J. Agric. Food Chem. 2021 69 9326 9337 10.1021/acs.jafc.1c04087 34358423 35. De Robertis M. Sarra A. D’Oria V. Mura F. Bordi F. Postorino P. Fratantonio D. Blueberry-Derived Exosome-Like Nanoparticles Counter the Response to TNF-α-Induced Change on Gene Expression in EA.hy926 Cells Biomolecules 2020 10 742 10.3390/biom10050742 32397678 PMC7277966 36. Kim D.K. Rhee W.J. Antioxidative Effects of Carrot-Derived Nanovesicles in Cardiomyoblast and Neuroblastoma Cells Pharmaceutics 2021 13 1203 10.3390/pharmaceutics13081203 34452164 PMC8400689 37. Liu J. Li W. Bian Y. Jiang X. Zhu F. Yin F. Yin L. Song X. Guo H. Liu J. Garlic-derived exosomes regulate PFKFB3 expression to relieve liver dysfunction in high-fat diet-fed mice via macrophage-hepatocyte crosstalk Phytomedicine 2023 112 154679 10.1016/j.phymed.2023.154679 36791628 38. Zu M. Xie D. Canup B.S.B. Chen N. Wang Y. Sun R. Zhang Z. Fu Y. Dai F. Xiao B. ‘Green’ nanotherapeutics from tea leaves for orally targeted prevention and alleviation of colon diseases Biomaterials 2021 279 121178 10.1016/j.biomaterials.2021.121178 34656857 39. Teng Y. Ren Y. Sayed M. Hu X. Lei C. Kumar A. Hutchins E. Mu J. Deng Z. Luo C. Plant-Derived Exosomal MicroRNAs Shape the Gut Microbiota Cell Host Microbe 2018 24 637 652.e638 10.1016/j.chom.2018.10.001 30449315 PMC6746408 40. Sundaram K. Teng Y. Mu J. Xu Q. Xu F. Sriwastva M.K. Zhang L. Park J.W. Zhang X. Yan J. Outer Membrane Vesicles Released from Garlic Exosome-like Nanoparticles (GaELNs) Train Gut Bacteria that Reverses Type 2 Diabetes via the Gut-Brain Axis Small 2024 20 e2308680 10.1002/smll.202308680 38225709 PMC11102339 41. Zou J. Song Q. Shaw P.C. Wu Y. Zuo Z. Yu R. Tangerine Peel-Derived Exosome-like Nanovesicles Alleviate Hepatic Steatosis Induced by Type 2 Diabetes: Evidenced by Regulating Lipid Metabolism and Intestinal Microflora Int. J. Nanomed. 2024 19 10023 10043 10.2147/IJN.S478589 PMC11451394 39371479 42. Lian M.Q. Chng W.H. Liang J. Yeo H.Q. Lee C.K. Belaid M. Tollemeto M. Wacker M.G. Czarny B. Pastorin G. Plant-derived extracellular vesicles: Recent advancements and current challenges on their use for biomedical applications J. Extracell. Vesicles 2022 11 e12283 10.1002/jev2.12283 36519808 PMC9753580 43. Chen S.L. Yu H. Luo H.M. Wu Q. Li C.F. Steinmetz A. Conservation and sustainable use of medicinal plants: Problems, progress, and prospects Chin. Med. 2016 11 37 10.1186/s13020-016-0108-7 27478496 PMC4967523 44. Ju S. Mu J. Dokland T. Zhuang X. Wang Q. Jiang H. Xiang X. Deng Z.B. Wang B. Zhang L. Grape exosome-like nanoparticles induce intestinal stem cells and protect mice from DSS-induced colitis Mol. Ther. 2013 21 1345 1357 10.1038/mt.2013.64 23752315 PMC3702113 45. Yang M. Liu X. Luo Q. Xu L. Chen F. An efficient method to isolate lemon derived extracellular vesicles for gastric cancer therapy J. Nanobiotechnol. 2020 18 100 10.1186/s12951-020-00656-9 PMC7370524 32690102 46. Fujita D. Arai T. Komori H. Shirasaki Y. Wakayama T. Nakanishi T. Tamai I. Apple-Derived Nanoparticles Modulate Expression of Organic-Anion-Transporting Polypeptide (OATP) 2B1 in Caco-2 Cells Mol. Pharm. 2018 15 5772 5780 10.1021/acs.molpharmaceut.8b00921 30359033 47. Wang Q. Ren Y. Mu J. Egilmez N.K. Zhuang X. Deng Z. Zhang L. Yan J. Miller D. Zhang H.G. Grapefruit-Derived Nanovectors Use an Activated Leukocyte Trafficking Pathway to Deliver Therapeutic Agents to Inflammatory Tumor Sites Cancer Res. 2015 75 2520 2529 Erratum in Cancer Res. 2016 76 10.1158/0008-5472.CAN-14-3095 25883092 PMC4470740 48. Zhang M. Viennois E. Prasad M. Zhang Y. Wang L. Zhang Z. Han M.K. Xiao B. Xu C. Srinivasan S. Edible ginger-derived nanoparticles: A novel therapeutic approach for the prevention and treatment of inflammatory bowel disease and colitis-associated Cancer Biomaterials 2016 101 321 340 10.1016/j.biomaterials.2016.06.018 27318094 PMC4921206 49. Deng Z. Rong Y. Teng Y. Mu J. Zhuang X. Tseng M. Samykutty A. Zhang L. Yan J. Miller D. Broccoli-Derived Nanoparticle Inhibits Mouse Colitis by Activating Dendritic Cell AMP-Activated Protein Kinase Mol. Ther. 2017 25 1641 1654 10.1016/j.ymthe.2017.01.025 28274798 PMC5498816 50. Cai H. Huang L.Y. Hong R. Song J.X. Guo X.J. Zhou W. Hu Z.L. Wang W. Wang Y.L. Shen J.G. Momordica charantia Exosome-Like Nanoparticles Exert Neuroprotective Effects Against Ischemic Brain Injury via Inhibiting Matrix Metalloproteinase 9 and Activating the AKT/GSK3β Signaling Pathway Front. Pharmacol. 2022 13 908830 10.3389/fphar.2022.908830 35814200 PMC9263912 51. Han X. Wei Q. Lv Y. Weng L. Huang H. Wei Q. Li M. Mao Y. Hua D. Cai X. Ginseng-derived nanoparticles potentiate immune checkpoint antibody efficacy by reprogramming the cold tumor microenvironment Mol. Ther. 2022 30 327 340 10.1016/j.ymthe.2021.08.028 34450250 PMC8753455 52. Zhang W. Song Q. Bi X. Cui W. Fang C. Gao J. Li J. Wang X. Qu K. Qin X. Preparation of Pueraria lobata Root-Derived Exosome-Like Nanovesicles and Evaluation of Their Effects on Mitigating Alcoholic Intoxication and Promoting Alcohol Metabolism in Mice Int. J. Nanomed. 2024 19 4907 4921 10.2147/IJN.S462602 PMC11141763 38828197 53. Chi Y. Shi L. Lu S. Cui H. Zha W. Shan L. Shen Y. Inhibitory effect of Lonicera japonica-derived exosomal miR2911 on human papilloma virus J. Ethnopharmacol. 2024 318 116969 10.1016/j.jep.2023.116969 37516391 54. Zhu M.Z. Xu H.M. Liang Y.J. Xu J. Yue N.N. Zhang Y. Tian C.M. Yao J. Wang L.S. Nie Y.Q. Edible exosome-like nanoparticles from portulaca oleracea L mitigate DSS-induced colitis via facilitating double-positive CD4 + + J. Nanobiotechnol. 2023 21 309 10.1186/s12951-023-02065-0 PMC10469825 37653406 55. Mu N. Li J. Zeng L. You J. Li R. Qin A. Liu X. Yan F. Zhou Z. Plant-Derived Exosome-Like Nanovesicles: Current Progress and Prospects Int. J. Nanomed. 2023 18 4987 5009 10.2147/IJN.S420748 37693885 PMC10492547 56. Halperin W. Jensen W.A. Ultrastructural changes during growth and embryogenesis in carrot cell cultures J. Ultrastruct. Res. 1967 18 428 443 10.1016/S0022-5320(67)80128-X 6025110 57. Zhao B. Lin H. Jiang X. Li W. Gao Y. Li M. Yu Y. Chen N. Gao J. Exosome-like nanoparticles derived from fruits, vegetables, and herbs: Innovative strategies of therapeutic and drug delivery Theranostics 2024 14 4598 4621 10.7150/thno.97096 39239509 PMC11373634 58. Wang J. Ding Y. Wang J. Hillmer S. Miao Y. Lo S.W. Wang X. Robinson D.G. Jiang L. EXPO, an exocyst-positive organelle distinct from multivesicular endosomes and autophagosomes, mediates cytosol to cell wall exocytosis in Arabidopsis and tobacco Cells Plant Cell 2010 22 4009 4030 10.1105/tpc.110.080697 21193573 PMC3027174 59. Stanly C. Moubarak M. Fiume I. Turiák L. Pocsfalvi G. Membrane Transporters in Citrus clementina Fruit Juice-Derived NanoVesicles Int. J. Mol. Sci. 2019 20 6205 10.3390/ijms20246205 31835328 PMC6941005 60. Ekström K. Crescitelli R. Pétursson H.I. Johansson J. Lässer C. Olofsson Bagge R. Characterization of surface markers on extracellular vesicles isolated from lymphatic exudate from patients with breast Cancer BMC Cancer 2022 22 50 10.1186/s12885-021-08870-w 35012489 PMC8744234 61. Song H. Canup B.S.B. Ngo V.L. Denning T.L. Garg P. Laroui H. Internalization of Garlic-Derived Nanovesicles on Liver Cells is Triggered by Interaction With CD98 ACS Omega 2020 5 23118 23128 10.1021/acsomega.0c02893 32954162 PMC7495725 62. Wang F. Yuan M. Shao C. Ji N. Zhang H. Li C. Momordica charantia-Derived Extracellular Vesicles Provide Antioxidant Protection in Ulcerative Colitis Molecules 2023 28 6182 10.3390/molecules28176182 37687011 PMC10488752 63. Kırbaş O.K. Sağraç D. Çiftçi Ö.C. Özdemir G. Öztürkoğlu D. Bozkurt B.T. Derman Ü.C. Taşkan E. Taşlı P.N. Özdemir B.S. Unveiling the potential: Extracellular vesicles from plant cell suspension cultures as a promising source Biofactors 2025 51 e2090 10.1002/biof.2090 38989918 PMC11680973 64. Wang B. Zhuang X. Deng Z.B. Jiang H. Mu J. Wang Q. Xiang X. Guo H. Zhang L. Dryden G. Targeted Drug Delivery to Intestinal Macrophages by Bioactive Nanovesicles Released from Grapefruit Mol. Ther. 2014 22 522 534 10.1038/mt.2013.190 23939022 PMC3944329 65. Kumar A. Sundaram K. Teng Y. Mu J. Sriwastva M.K. Zhang L. Hood J.L. Yan J. Zhang X. Park J.W. Ginger nanoparticles mediated induction of Foxa2 prevents high-fat diet-induced insulin resistance Theranostics 2022 12 1388 1403 10.7150/thno.62514 35154496 PMC8771553 66. Xu F. Mu J. Teng Y. Zhang X. Sundaram K. Sriwastva M.K. Kumar A. Lei C. Zhang L. Liu Q.M. Restoring Oat Nanoparticles Mediated Brain Memory Function of Mice Fed Alcohol by Sorting Inflammatory Dectin-1 Complex into Microglial Exosomes Small 2021 18 e2105385 10.1002/smll.202105385 34897972 PMC8858573 67. Fawzy M.P. Hassan H.A. Amin M.U. Preis E. Bakowsky U. Fahmy S.A. Deploying nucleic acids-loaded plant-derived exosomes as green nano gadget in cancer gene therapy Mater. Adv. 2025 6 1230 1261 10.1039/D4MA01189A 68. Sundaram K. Miller D.P. Kumar A. Teng Y. Sayed M. Mu J. Lei C. Sriwastva M.K. Zhang L. Yan J. Plant-derived exosomal nanoparticles inhibit pathogenicity of porphyromonas gingivalis iScience 2019 21 308 327 Erratum in iScience 2020 23 10.1016/j.isci.2019.10.032 31678913 PMC6838522 69. Suresh A.P. Kalarikkal S.P. Pullareddy B. Sundaram G.M. Low pH-Based Method to Increase the Yield of Plant-Derived Nanoparticles from Fresh Ginger Rhizomes ACS Omega 2021 6 17635 17641 10.1021/acsomega.1c02162 34278148 PMC8280662 70. Wang Q. Zhuang X. Mu J. Deng Z.B. Jiang H. Zhang L. Xiang X. Wang B. Yan J. Miller D. Delivery of therapeutic agents by nanoparticles made of grapefruit-derived lipids Nat. Commun. 2013 4 1867 10.1038/ncomms2886 23695661 PMC4396627 71. Baldrich P. Rutter B.D. Karimi H.Z. Podicheti R. Meyers B.C. Innes R.W. Plant Extracellular Vesicles Contain Diverse Small RNA Species and Are Enriched in 10- to 17-Nucleotide “Tiny” RNAs Plant Cell 2019 31 315 324 10.1105/tpc.18.00872 30705133 PMC6447009 72. Shen C. Li X. Qin J. Duan L. Characterization of miRNA profiling in konjac-derived exosome-like nanoparticles and elucidation of their multifaceted roles in human health Front. Plant Sci. 2024 15 1444683 10.3389/fpls.2024.1444683 39175488 PMC11338808 73. Garcia-Martin R. Wang G. Brandão B.B. Zanotto T.M. Shah S. Kumar Patel S. Schilling B. Kahn C.R. MicroRNA sequence codes for small extracellular vesicle release and cellular retention Nature 2022 601 446 451 10.1038/s41586-021-04234-3 34937935 PMC9035265 74. Leidal A.M. Huang H.H. Marsh T. Solvik T. Zhang D. Ye J. Kai F. Goldsmith J. Liu J.Y. Huang Y.H. The LC3-conjugation machinery specifies the loading of RNA-binding proteins into extracellular Vesicles Nat. Cell Biol. 2020 22 187 199 10.1038/s41556-019-0450-y 31932738 PMC7007875 75. Hou D. He F. Ma L. Cao M. Zhou Z. Wei Z. Xue Y. Sang X. Chong H. Tian C. The potential atheroprotective role of plant MIR156a as a repressor of monocyte recruitment on inflamed human endothelial Cells J. Nutr. Biochem. 2018 57 197 205 10.1016/j.jnutbio.2018.03.026 29751293 76. Chen X. Zhou Y. Yu J. Exosome-like Nanoparticles from Ginger Rhizomes Inhibited NLRP3 Inflammasome Activation Mol. Pharm. 2019 16 2690 2699 10.1021/acs.molpharmaceut.9b00246 31038962 77. Baldini N. Torreggiani E. Roncuzzi L. Perut F. Zini N. Avnet S. Exosome-like Nanovesicles Isolated from Citrus limon Curr. Pharm. Biotechnol. 2018 19 877 885 10.2174/1389201019666181017115755 30332948 78. Alzahrani F.A. Khan M.I. Kameli N. Alsahafi E. Riza Y.M. Plant-Derived Extracellular Vesicles and Their Exciting Potential as the Future of Next-Generation Drug Delivery Biomolecules 2023 13 839 10.3390/biom13050839 37238708 PMC10216196 79. Ly N.P. Han H.S. Kim M. Park J.H. Choi K.Y. Plant-derived nanovesicles: Current understanding and applications for cancer therapy Bioact. Mater. 2023 22 365 383 10.1016/j.bioactmat.2022.10.005 36311046 PMC9588993 80. Rutter B.D. Innes R.W. Extracellular Vesicles Isolated from the Leaf Apoplast Carry Stress-Response Proteins Plant Physiol. 2017 173 728 741 10.1104/pp.16.01253 27837092 PMC5210723 81. Li P. Kaslan M. Lee S.H. Yao J. Gao Z. Progress in Exosome Isolation Techniques Theranostics 2017 7 789 804 10.7150/thno.18133 28255367 PMC5327650 82. Dong L. Zieren R.C. Horie K. Kim C.J. Mallick E. Jing Y. Feng M. Kuczler M.D. Green J. Amend S.R. Comprehensive evaluation of methods for small extracellular vesicles separation from human plasma, urine and cell culture medium J. Extracell. Vesicles 2020 10 e12044 10.1002/jev2.12044 33489012 PMC7810129 83. Visan K.S. Lobb R.J. Ham S. Lima L.G. Palma C. Edna C.P.Z. Wu L.Y. Gowda H. Datta K.K. Hartel G. Comparative analysis of tangential flow filtration and ultracentrifugation, both combined with subsequent size exclusion chromatography, for the isolation of small extracellular Vesicles J. Extracell. Vesicles 2022 11 e12266 10.1002/jev2.12266 36124834 PMC9486818 84. Gandham S. Su X. Wood J. Nocera A.L. Alli S.C. Milane L. Zimmerman A. Amiji M. Ivanov A.R. Technologies and Standardization in Research on Extracellular Vesicles Trends Biotechnol. 2020 38 1066 1098 10.1016/j.tibtech.2020.05.012 32564882 PMC7302792 85. Böing A.N. van der Pol E. Grootemaat A.E. Coumans F.A. Sturk A. Nieuwland R. Single-step isolation of extracellular vesicles by size-exclusion chromatography J. Extracell. Vesicles 2014 3 23430 10.3402/jev.v3.23430 PMC4159761 25279113 86. Zhang H. Freitas D. Kim H.S. Fabijanic K. Li Z. Chen H. Mark M.T. Molina H. Martin A.B. Bojmar L. Identification of distinct nanoparticles and subsets of extracellular vesicles by asymmetric flow field-flow fractionation Nat. Cell Biol. 2018 20 332 343 10.1038/s41556-018-0040-4 29459780 PMC5931706 87. Shin H. Han C. Labuz J.M. Kim J. Kim J. Cho S. Gho Y.S. Takayama S. Park J. High-yield isolation of extracellular vesicles using aqueous two-phase system Sci. Rep. 2015 5 13103 10.1038/srep13103 26271727 PMC4536486 88. Woith E. Melzig M.F. Extracellular Vesicles from Fresh and Dried Plants-Simultaneous Purification and Visualization Using Gel Electrophoresis Int. J. Mol. Sci. 2019 20 357 10.3390/ijms20020357 30654488 PMC6359398 89. De Sousa K.P. Rossi I. Abdullahi M. Ramirez M.I. Stratton D. Inal J.M. Isolation and characterization of extracellular vesicles and future directions in diagnosis and therapy Wiley Interdiscip. Rev. Nanomed. Nanobiotechnol. 2023 15 e1835 10.1002/wnan.1835 35898167 PMC10078256 90. Li Y. Wang Y. Zhao H. Pan Q. Chen G. Engineering Strategies of Plant-Derived Exosome-like Nanovesicles: Current Knowledge and Future Perspectives Int. J. Nanomed. 2024 19 12793 12815 10.2147/IJN.S496664 PMC11618857 39640047 91. Mun J.G. Song D.H. Kee J.Y. Han Y. Recent Advances in the Isolation Strategies of Plant-Derived Exosomes and Their Therapeutic Applications Curr. Issues Mol. Biol. 2025 47 144 10.3390/cimb47030144 40136398 PMC11941663 92. Sidhom K. Obi P.O. Saleem A. A Review of Exosomal Isolation Methods: Is Size Exclusion Chromatography the Best Option? Int. J. Mol. Sci. 2020 21 6466 10.3390/ijms21186466 32899828 PMC7556044 93. Zhang H. Lyden D. Asymmetric-flow field-flow fractionation technology for exomere and small extracellular vesicle separation and characterization Nat. Protoc. 2019 14 1027 1053 10.1038/s41596-019-0126-x 30833697 PMC6733524 94. Gorgzadeh A. Nazari A. Ali Ehsan Ismaeel A. Safarzadeh D. Hassan J.A.K. Mohammadzadehsaliani S. Kheradjoo H. Yasamineh P. Yasamineh S. A state-of-the-art review of the recent advances in exosome isolation and detection methods in viral infection Virol. J. 2024 21 34 10.1186/s12985-024-02301-5 38291452 PMC10829349 95. Viršilė A. Samuolienė G. Laužikė K. Mikalauskienė E. Balion Z. Jekabsone A. The Impact of Genotype and Controlled Environment Cultivation Parameters on Tomato-Leaf-Derived Exosome-like Nanoparticle Yield and Properties Horticulturae 2024 10 477 10.3390/horticulturae10050477 96. Kocholatá M. Malý J. Kříženecká S. Janoušková O. Diversity of extracellular vesicles derived from calli, cell culture and apoplastic fluid of tobacco Sci. Rep. 2024 14 30111 10.1038/s41598-024-81940-8 39627311 PMC11615035 97. Li A. Li D. Gu Y. Liu R. Tang X. Zhao Y. Qi F. Wei J. Liu J. Plant-derived nanovesicles: Further exploration of biomedical function and application potential Acta Pharm. Sin. B 2023 13 3300 3320 10.1016/j.apsb.2022.12.022 37655320 PMC10465964 98. Kim J. Li S. Zhang S. Wang J. Plant-derived exosome-like nanoparticles and their therapeutic activities Asian J. Pharm. Sci. 2022 17 53 69 10.1016/j.ajps.2021.05.006 35261644 PMC8888139 99. Kalarikkal S.P. Prasad D. Kasiappan R. Chaudhari S.R. Sundaram G.M. A cost-effective polyethylene glycol-based method for the isolation of functional edible nanoparticles from ginger rhizomes Sci. Rep. 2020 10 4456 10.1038/s41598-020-61358-8 32157137 PMC7064537 100. Zhu H. He W. Ginger: A representative material of herb-derived exosome-like nanoparticles Front. Nutr. 2023 10 1223349 10.3389/fnut.2023.1223349 37521414 PMC10374224 101. Parisse P. Rago I. Ulloa Severino L. Perissinotto F. Ambrosetti E. Paoletti P. Ricci M. Beltrami A.P. Cesselli D. Casalis L. Atomic force microscopy analysis of extracellular Vesicles Eur. Biophys. J. 2017 46 813 820 10.1007/s00249-017-1252-4 28866771 102. Chuo S.T. Chien J.C. Lai C.P. Imaging extracellular vesicles: Current and emerging methods J. Biomed. Sci. 2018 25 91 10.1186/s12929-018-0494-5 30580764 PMC6304785 103. Koifman N. Biran I. Aharon A. Brenner B. Talmon Y. A direct-imaging cryo-EM study of shedding extracellular vesicles from leukemic monocytes J. Struct. Biol. 2017 198 177 185 10.1016/j.jsb.2017.02.004 28254382 104. You J.Y. Kang S.J. Rhee W.J. Isolation of cabbage exosome-like nanovesicles and investigation of their biological activities in human Cells Bioact. Mater. 2021 6 4321 4332 10.1016/j.bioactmat.2021.04.023 33997509 PMC8105599 105. Kürtösi B. Kazsoki A. Zelkó R. A Systematic Review on Plant-Derived Extracellular Vesicles as Drug Delivery Systems Int. J. Mol. Sci. 2024 25 7559 10.3390/ijms25147559 39062803 PMC11277065 106. Zhuang X. Deng Z.B. Mu J. Zhang L. Yan J. Miller D. Feng W. McClain C.J. Zhang H.G. Ginger-derived nanoparticles protect against alcohol-induced liver damage J. Extracell. Vesicles 2015 4 28713 10.3402/jev.v4.28713 26610593 PMC4662062 107. Nemati M. Singh B. Mir R.A. Nemati M. Babaei A. Ahmadi M. Rasmi Y. Golezani A.G. Rezaie J. Plant-derived extracellular vesicles: A novel nanomedicine approach with advantages and challenges Cell Commun. Signal. 2022 20 69 10.1186/s12964-022-00889-1 35606749 PMC9128143 108. Sha A. Luo Y. Xiao W. He J. Chen X. Xiong Z. Peng L. Zou L. Liu B. Li Q. Plant-Derived Exosome-like Nanoparticles: A Comprehensive Overview of Their Composition, Biogenesis, Isolation, and Biological Applications Int. J. Mol. Sci. 2024 25 12092 10.3390/ijms252212092 39596159 PMC11593521 109. Liu H. Deng Y. Li J. Lin W. Liu C. Yang X. Zhou Z. Jiang Y. Ginger-derived exosome-like nanoparticles: A representative of plant-based natural nanostructured drug delivery system Front. Bioeng. Biotechnol. 2025 13 1569889 10.3389/fbioe.2025.1569889 40534611 PMC12174126 110. Bahri F. Mansoori M. Vafaei S. Fooladi S. Mir Y. Mehrabani M. Hozhabri Y. Nematollahi M.H. Iravani S. A comprehensive review on ginger-derived exosome-like nanoparticles as feasible therapeutic nano-agents against diseases Mater. Adv. 2024 5 1846 1867 10.1039/D3MA00856H 111. Raguraman R. Bhavsar D. Kim D. Ren X. Sikavitsas V. Munshi A. Ramesh R. Tumor-targeted exosomes for delivery of anticancer drugs Cancer Lett. 2023 558 216093 10.1016/j.canlet.2023.216093 36822543 PMC10025995 112. Suk J.S. Xu Q. Kim N. Hanes J. Ensign L.M. PEGylation as a strategy for improving nanoparticle-based drug and gene delivery Adv. Drug Deliv. Rev. 2016 99 28 51 10.1016/j.addr.2015.09.012 26456916 PMC4798869 113. Del Pozo-Acebo L. Hazas M.-C.L.d.L. Tomé-Carneiro J. Del Saz-Lara A. Gil-Zamorano J. Balaguer L. Chapado L.A. Busto R. Visioli F. Dávalos A. Therapeutic potential of broccoli-derived extracellular vesicles as nanocarriers of exogenous miRNAs Pharmacol. Res. 2022 185 106472 10.1016/j.phrs.2022.106472 36182038 114. Zhuang X. Teng Y. Samykutty A. Mu J. Deng Z. Zhang L. Cao P. Rong Y. Yan J. Miller D. Grapefruit-derived Nanovectors Delivering Therapeutic miR17 Through an Intranasal Route Inhibit Brain Tumor Progression Mol. Ther. 2016 24 96 105 10.1038/mt.2015.188 26444082 PMC4754550 115. Sasaki D. Kusamori K. Nishikawa M. Delivery of Corn-Derived Nanoparticles with Anticancer Activity to Tumor Tissues by Modification with Polyethylene Glycol for Cancer Therapy Pharm. Res. 2023 40 917 926 10.1007/s11095-022-03431-7 36352200 116. Zhang M. Xiao B. Wang H. Han M.K. Zhang Z. Viennois E. Xu C. Merlin D. Edible Ginger-derived Nano-lipids Loaded with Doxorubicin as a Novel Drug-delivery Approach for Colon Cancer Therapy Mol. Ther. 2016 24 1783 1796 10.1038/mt.2016.159 27491931 PMC5112046 117. Li Z. Wang H. Yin H. Bennett C. Zhang H.G. Guo P. Arrowtail RNA for Ligand Display on Ginger Exosome-like Nanovesicles to Systemic Deliver siRNA for Cancer Suppression Sci. Rep. 2018 8 14644 10.1038/s41598-018-32953-7 30279553 PMC6168523 118. Xiao Q. Zhao W. Wu C. Wang X. Chen J. Shi X. Sha S. Li J. Liang X. Yang Y. Lemon-Derived Extracellular Vesicles Nanodrugs Enable to Efficiently Overcome Cancer Multidrug Resistance by Endocytosis-Triggered Energy Dissipation and Energy Production Reduction Adv. Sci. 2022 9 2105274 10.1002/advs.202105274 PMC9284146 35187842 119. Umezu T. Takanashi M. Murakami Y. Ohno S.I. Kanekura K. Sudo K. Nagamine K. Takeuchi S. Ochiya T. Kuroda M. Acerola exosome-like nanovesicles to systemically deliver nucleic acid medicine via oral administration Mol. Ther.-Methods Clin. Dev. 2021 21 199 208 10.1016/j.omtm.2021.03.006 33850951 PMC8010214 120. Alvarez-Erviti L. Seow Y. Yin H. Betts C. Lakhal S. Wood M.J.A. Delivery of siRNA to the mouse brain by systemic injection of targeted exosomes Nat. Biotechnol. 2011 29 341 345 10.1038/nbt.1807 21423189 121. Barjesteh T. Mansur S. Bao Y. Inorganic Nanoparticle-Loaded Exosomes for Biomedical Applications Molecules 2021 26 1135 10.3390/molecules26041135 33672706 PMC7924372 122. Kim K. Park J. Sohn Y. Oh C.E. Park J.H. Yuk J.M. Yeon J.H. Stability of plant leaf-derived extracellular vesicles according to preservative and storage temperature Pharmaceutics 2022 14 457 10.3390/pharmaceutics14020457 35214189 PMC8879201 123. Tinnirello V. Rabienezhad Ganji N. De Marcos Lousa C. Alessandro R. Raimondo S. Exploiting the Opportunity to Use Plant-Derived Nanoparticles as Delivery Vehicles Plants 2023 12 1207 10.3390/plants12061207 36986896 PMC10053153 124. Che K. Wang C. Chen H. Advancing functional foods: A systematic analysis of plant-derived exosome-like nanoparticles and their health-promoting properties Front. Nutr. 2025 12 1544746 10.3389/fnut.2025.1544746 40115388 PMC11924939 125. Yi Q. Xu Z. Thakur A. Zhang K. Liang Q. Liu Y. Yan Y. Current understanding of plant-derived exosome-like nanoparticles in regulating the inflammatory response and immune system microenvironment Pharmacol. Res. 2023 190 106733 10.1016/j.phrs.2023.106733 36931541 126. Niu W. Xiao Q. Wang X. Zhu J. Li J. Liang X. Peng Y. Wu C. Lu R. Pan Y. A Biomimetic Drug Delivery System by Integrating Grapefruit Extracellular Vesicles and Doxorubicin-Loaded Heparin-Based Nanoparticles for Glioma Therapy Nano Lett. 2021 21 1484 1492 10.1021/acs.nanolett.0c04753 33475372 127. Pomatto M.A.C. Gai C. Negro F. Massari L. Deregibus M.C. Grange C. De Rosa F.G. Camussi G. Plant-Derived Extracellular Vesicles as a Delivery Platform for RNA-Based Vaccine: Feasibility Study of an Oral and Intranasal SARS-CoV-2 Vaccine Pharmaceutics 2023 15 974 10.3390/pharmaceutics15030974 36986835 PMC10058531 128. Oguntibeju O.O. Type 2 diabetes mellitus, oxidative stress and inflammation: Examining the links Int. J. Physiol. Pathophysiol. Pharmacol. 2019 11 45 63 31333808 PMC6628012 129. Hou N. Torii S. Saito N. Hosaka M. Takeuchi T. Reactive oxygen species-mediated pancreatic β-cell death is regulated by interactions between stress-activated protein kinases, p38 and c-Jun N-terminal kinase, and mitogen-activated protein kinase phosphatases Endocrinology 2008 149 1654 1665 10.1210/en.2007-0988 18187551 130. Varthaliti A. Lygizos V. Fanaki M. Pergialiotis V. Papapanagiotou A. Pappa K. Theodora M. Daskalaki M.A. Antsaklis P. Daskalakis G. The Role of IL-6 and TNF-α as Early Biomarkers in the Prediction and Diagnosis of Gestational Diabetes Mellitus Biomedicines 2025 13 1627 10.3390/biomedicines13071627 40722699 PMC12292796 131. He C. Wang K. Xia J. Qian D. Guo J. Zhong L. Tang D. Chen X. Peng W. Chen Y. Natural exosomes-like nanoparticles in mung bean sprouts possesses anti-diabetic effects via activation of PI3K/Akt/GLUT4/GSK-3β signaling pathway J. Nanobiotechnol. 2023 21 349 10.1186/s12951-023-02120-w PMC10536756 37759297 132. Wang X. Tian R. Liang C. Jia Y. Zhao L. Xie Q. Huang F. Yuan H. Biomimetic nanoplatform with microbiome modulation and antioxidant functions ameliorating insulin resistance and pancreatic β-cell dysfunction for T2DM management Biomaterials 2025 313 122804 10.1016/j.biomaterials.2024.122804 39236631 133. Miya M.B. Ashutosh M. Dey D. Pathak V. Khare E. Kalani K. Chaturvedi P. Singh V. Chaturvedi P. Kalani A. Accelerated diabetic wound healing using a chitosan-based nanomembrane incorporating nanovesicles from Aloe barbadensis Azadirachta Zingiber officinale Int. J. Biol. Macromol. 2025 310 143169 10.1016/j.ijbiomac.2025.143169 40239792 134. Jin E. Yang Y. Cong S. Chen D. Chen R. Zhang J. Hu Y. Chen W. Lemon-derived nanoparticle-functionalized hydrogels regulate macrophage reprogramming to promote diabetic wound healing J. Nanobiotechnol. 2025 23 68 10.1186/s12951-025-03138-y 39891270 PMC11783766 135. Yu Y. Ding Y. Wang S. Jiang L. Gut Microbiota Dysbiosis and Its Impact on Type 2 Diabetes: From Pathogenesis to Therapeutic Strategies Metabolites 2025 15 397 10.3390/metabo15060397 40559421 PMC12195007 136. Liu J. Li F. Yang L. Luo S. Deng Y. Gut microbiota and its metabolites regulate insulin resistance: Traditional Chinese medicine insights for T2DM Front. Microbiol. 2025 16 1554189 10.3389/fmicb.2025.1554189 40177494 PMC11963813 137. Cani P.D. Neyrinck A.M. Fava F. Knauf C. Burcelin R.G. Tuohy K.M. Gibson G.R. Delzenne N.M. Selective increases of bifidobacteria in gut microflora improve high-fat-diet-induced diabetes in mice through a mechanism associated with endotoxaemia Diabetologia 2007 50 2374 2383 10.1007/s00125-007-0791-0 17823788 138. Chong S. Lin M. Chong D. Jensen S. Lau N.S. A systematic review on gut microbiota in type 2 diabetes mellitus Front. Endocrinol. 2025 15 1486793 10.3389/fendo.2024.1486793 39897957 PMC11782031 139. Li D. Yi G. Cao G. Midgley A.C. Yang Y. Yang D. Liu W. He Y. Yao X. Li G. Dual-Carriers of Tartary Buckwheat-Derived Exosome-like Nanovesicles Synergistically Regulate Glucose Metabolism in the Intestine-Liver Axis Small 2025 21 e2410124 10.1002/smll.202410124 40079102 140. Barroso E. Jurado-Aguilar J. Wahli W. Palomer X. Vázquez-Carrera M. Increased hepatic gluconeogenesis and type 2 diabetes mellitus Trends Endocrinol. Metab. 2024 35 1062 1077 10.1016/j.tem.2024.05.006 38816269 141. Li M. Chi X. Wang Y. Setrerrahmane S. Xie W. Xu H. Trends in insulin resistance: Insights into mechanisms and therapeutic strategy Signal Transduct. Target. Ther. 2022 7 216 10.1038/s41392-022-01073-0 35794109 PMC9259665 142. Frykberg R.G. Banks J. Challenges in the treatment of chronic wounds Adv. Wound Care 2015 4 560 582 10.1089/wound.2015.0635 26339534 PMC4528992 143. Tan M. Liu Y. Xu Y. Yan G. Zhou N. Chen H. Jiang Z. Peng L. Plant-Derived Exosomes as Novel Nanotherapeutics Contrive Glycolysis Reprogramming-Mediated Angiogenesis for Diabetic Ulcer Healing Biomater. Res. 2024 28 0035 10.34133/bmr.0035 38840655 PMC11151174 144. Kumari S. Goyal A. Sönmez Gürer E. Algın Yapar E. Garg M. Sood M. Sindhu R.K. Bioactive loaded novel nano-formulations for targeted drug delivery and their therapeutic potential Pharmaceutics 2022 14 1091 10.3390/pharmaceutics14051091 35631677 PMC9146286 145. Hu F. Sun D.S. Wang K.L. Shang D.Y. Nanomedicine of Plant Origin for the Treatment of Metabolic Disorders Front. Bioeng. Biotechnol. 2022 9 811917 10.3389/fbioe.2021.811917 35223819 PMC8873594 146. Zhao X. Shi A. Ma Q. Yan X. Bian L. Zhang P. Wu J. Nanoparticles prepared from pterostilbene reduce blood glucose and improve diabetes complications J. Nanobiotechnol. 2021 19 191 10.1186/s12951-021-00928-y PMC8237509 34176494 147. Dewanjee S. Chakraborty P. Mukherjee B. De Feo V. Plant-Based Antidiabetic Nanoformulations: The Emerging Paradigm for Effective Therapy Int. J. Mol. Sci. 2020 21 2217 10.3390/ijms21062217 32210082 PMC7139625 148. Liu R. Zhang F. He X. Huang K. Plant derived Exosome-Like nanoparticles and their therapeutic applications in glucolipid metabolism diseases J. Agric. Food Chem. 2025 73 6385 6399 10.1021/acs.jafc.4c12480 40048449 149. Yan L. Cao Y. Hou L. Luo T. Li M. Gao S. Wang L. Sheng K. Zheng L. Ginger exosome-like nanoparticle-derived miRNA therapeutics: A strategic inhibitor of intestinal inflammation J. Adv. Res. 2025 69 1 15 10.1016/j.jare.2024.04.001 38588850 PMC11954804 150. Mu W. Cheng X.F. Liu Y. Lv Q.Z. Liu G.L. Zhang J.G. Li X.Y. Potential Nexus of Non-alcoholic Fatty Liver Disease and Type 2 Diabetes Mellitus: Insulin Resistance Between Hepatic and Peripheral Tissues Front. Pharmacol. 2019 9 1566 10.3389/fphar.2018.01566 30692925 PMC6339917 151. Lonardo A. Lombardini S. Ricchi M. Scaglioni F. Loria P. Review article: Hepatic steatosis and insulin resistance Aliment. Pharmacol. Ther. 2005 22 (Suppl. 2) 64 70 10.1111/j.1365-2036.2005.02600.x 16225477 152. Guan Y. Niu H. Liu Z. Dang Y. Shen J. Zayed M. Ma L. Guan J. Sustained oxygenation accelerates diabetic wound healing by promoting epithelialization and angiogenesis and decreasing inflammation Sci. Adv. 2021 7 eabj0153 10.1126/sciadv.abj0153 34452918 PMC8397271 153. Liu Z.J. Yin R.Y. Tian J.X. Extracellular vesicles: Mechanisms and prospects in type 2 diabetes and its complications Front. Endocrinol. 2025 15 1521281 10.3389/fendo.2024.1521281 40212823 PMC11983144 154. Xu G.L. Jin J. Fu Z.H. Wang G.M. Lei X.H. Xu J. Wang J.Z. Extracellular vesicle-based drug overview: Research landscape, quality control and nonclinical evaluation strategies Signal Transduct. Target. Ther. 2025 10 255 10.1038/s41392-025-02312-w 40804047 PMC12350758 Figure 1 Therapeutic roles and bioactive components of PENPs. PENPs are natural nanocarriers composed of a lipid bilayer containing lipids, proteins, and cholesterol and enriched with internal cargos such as mRNA, microRNA, DNA, proteins, and enzymes. They exert multiple therapeutic effects by enhancing insulin sensitivity, regulating glucose and lipid metabolism, modulating gut microbiota and intestinal homeostasis, promoting tissue repair, and reducing inflammation and oxidative stress. PENPs also contribute to neuroprotection and antifibrotic and antitumor activities and support targeted delivery of therapeutic agents. Figure 2 Schematic model of EXPO-mediated unconventional secretion. EXPOs fuse with the plasma membrane and release single-membrane vesicles into the apoplast, where they rupture and deliver cytosolic proteins such as SAMS2 to the cell wall region [ 58 Figure 3 Schematic representation of the cross-kingdom regulatory mechanism by which ginger-derived PENPs deliver miRNAs to gut microbes. In addition to mdo-miR7267-3p ycnE ath-miR167a spaC 39 Figure 4 Schematic model of receptor-mediated endocytosis of garlic-derived PENPs via CD98 recognition. ( A B C 61 Figure 5 Grapefruit-derived extracellular-vesicle-based hybrid nanoparticles (EV-DNs) for glioma therapy. ( a b 126 Figure 6 Proposed molecular mechanisms of mung-bean-sprout-derived PENPs in ameliorating diabetic hepatic injury. Mung-bean-sprout-derived PENPs improve diabetic conditions in HFD/STZ mice by modulating the PI3K/Akt/GLUT4/GSK-3β pathway, promoting glucose uptake and glycogen synthesis, and activating Nrf2-mediated antioxidant responses to alleviate oxidative stress-induced hepatocellular injury [ 131 Figure 7 GDNPs activate Foxa2 signaling and improve metabolic health in HFD-fed mice. ( A B C D 65 p p p Figure 8 GExos promote angiogenesis and wound healing via glycolytic reprogramming. ( A B C D 143 p p p Figure 9 Overview of the isolation, characterization, and gut–liver regulatory effects of TNVs. TNVs were extracted via differential centrifugation and found to contain lipids, phenols, flavones, and proteins. Upon oral administration, TNVs modulated gut microbiota and promoted SCFA production, which in turn influenced bile acid metabolism and FXR-FGF19 signaling in the liver, contributing to metabolic improvement. Adapted from ref [ 41 Figure 10 Illustration of construction and therapeutic mechanism of a biomimetic-acid-responsive nano hydrogen producer (HMS/A@GE). ( A B 132 Figure 11 GelMA/DAS/Exo hydrogel was used as a dressing for diabetic wound healing. ( A B 134 ijms-26-09155-t001_Table 1 Table 1 Comparative lipid profiles of PENPs from different plant sources and their correlation with potential in vivo targeting. Plant Sources Dominant Lipid Species and Composition Potential In Vivo Targeting Ref. Grapefruit PE (~46%), PC (~29%) Intestine (enhanced uptake), liver (preferential accumulation) [ 64 Ginger PA (~38%), DGDG (~33%), MGDG (~21%) Small intestine (uptake by epithelial cells, oral) [ 65 Oat PC (~30%), DGDG (~29.8%) Brain (crosses BBB; microglial uptake) [ 66 ijms-26-09155-t002_Table 2 Table 2 Comparative trade-offs of PENP extraction and purification methods in terms of purity, scalability, and vesicle integrity. Method Isolation Principle Purity Scalability Vesicle Integrity Advantages Limitations Differential centrifugation (DC) Sequential centrifugation with gradually increasing g force to pellet particles Low to moderate High Moderate to low Simple, low cost, widely accessible High risk of co-pelleting proteins and organelle fragments, variability between batches Density-gradient ultracentrifugation (DGUC) Separation by buoyant density in sucrose or iodixanol medium High Low Moderate High resolution and purity Time-consuming, low-throughput, possible osmotic stress Ultrafiltration (UF, including TFF) Filtration based on membrane pore size and continuous flow Moderate High Moderate to high Suitable for large volumes, relatively fast Membrane fouling, loss of small vesicles Size-exclusion chromatography (SEC) Gel filtration to separate vesicles from proteins and small molecules High Moderate High Gentle on vesicles, preserves bioactivity Limited-throughput, dilution and reduced yield Polyethylene glycol precipitation (PEG) Polymer induced precipitation of vesicles Low to moderate High Moderate to low Rapid, inexpensive, scalable Co-precipitation of contaminants, polymer residues Immunoaffinity capture Isolation based on specific vesicle surface markers such as TET8 or PEN1 Very high Low High High specificity for target subpopulations High cost, dependence on antibody availability, limited yield Asymmetric flow field-flow fractionation (AF4) Fractionation of vesicles by size under a flow field High Low to moderate High High resolution, maintains structural integrity Specialized instrumentation, method complexity Aqueous two-phase system (ATPS) Partitioning of vesicles between two immiscible polymer phases Moderate to high High High Gentle on vesicles, potentially scalable Need for removal of residual polymers, optimization required Electrophoresis–dialysis hybrid Use of electric field with dialysis membrane to remove charged impurities High Low High Effective for charged impurities, precise separation Low-throughput, labor-intensive Microfluidic platforms On-chip vesicle sorting by hydrodynamic or affinity based principles High Low to moderate High Rapid, automated, requires minimal sample Scale up not established, device-specific variability ijms-26-09155-t003_Table 3 Table 3 Comparative summary of PENP biodistribution and disease applicability under different administration routes. Route of Administration Plant Sources Primary Target Organs/Tissues Key Advantages Applicable Disease Models Ref. Oral Administration Ginger, Grapefruit, Ginseng Distal small intestine, cecum, colon, liver High stability, strong dependence on the enterohepatic axis Inflammatory bowel disease, intestinal cancer, non-alcoholic fatty liver disease [ 98 109 110 Intravenous Administration Ginseng, Corn Liver, spleen, systemic circulation Bypasses first-pass metabolism, high systemic delivery efficiency Cancer, liver diseases, cerebral ischemia, and other systemic diseases [ 111 112 Intraperitoneal Administration Grapefruit, Ginseng Liver, spleen, kidneys, lungs Stable pharmacokinetics, suitable for animal studies Inflammation, systemic immune-related diseases [ 47 70 111 Intranasal Delivery Grapefruit Lungs, brain Non-invasive, bypasses the BBB Brain tumors, neuroinflammation, pulmonary diseases [ 70 114 Transdermal Delivery Safflower, Ginseng Dermis, subcutaneous tissue Targeted to wound sites, suitable for localized therapy Wound healing, chronic dermatitis [ 113 ",
  "metadata": {
    "Title of this paper": "Extracellular vesicle-based drug overview: Research landscape, quality control and nonclinical evaluation strategies",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470572/"
  }
}