{
  "title": "Paper_703",
  "abstract": "pmc Adv Ther Adv Ther 365 springeropen Advances in Therapy 0741-238X 1865-8652 pmc-is-collection-domain yes pmc-collection-title Springer PMC12474609 PMC12474609.1 12474609 12474609 40875187 10.1007/s12325-025-03328-y 3328 1 Original Research Safety Profile of Upadacitinib: Descriptive Analysis in Over 27,000 Patient-Years Across Rheumatoid Arthritis, Psoriatic Arthritis, Axial Spondyloarthritis, Atopic Dermatitis, and Inflammatory Bowel Disease http://orcid.org/0000-0001-7518-1131 Burmester Gerd R. gerd.burmester@charite.de 1 Deodhar Atul 2 Irvine Alan D. 3 4 Panaccione Remo 5 Winthrop Kevin L. 6 Vleugels Ruth Ann 7 8 Levy Gweneth 9 Suravaram Smitha 9 Palac Hannah 9 Wegrzyn Lani 9 Ford Sharanya 9 Meerwein Sebastian 10 Guttman-Yassky Emma 11 12 1 https://ror.org/001w7jn25 grid.6363.0 0000 0001 2218 4662 Department of Rheumatology and Clinical Immunology, Freie Universität Berlin and Humboldt-Universität zu Berlin, Charité Universitätsmedizin Berlin, 2 https://ror.org/009avj582 grid.5288.7 0000 0000 9758 5690 Division of Arthritis and Rheumatic Diseases, Oregon Health and Science University, 3 https://ror.org/02tyrky19 grid.8217.c 0000 0004 1936 9705 Department of Clinical Medicine, Trinity College Dublin, 4 https://ror.org/04c6bry31 grid.416409.e 0000 0004 0617 8280 Wellcome-HRB Clinical Research Facility, St. James’ Hospital, 5 https://ror.org/03yjb2x39 grid.22072.35 0000 0004 1936 7697 Inflammatory Bowel Disease Unit, Division of Gastroenterology and Hepatology, University of Calgary, 6 https://ror.org/009avj582 grid.5288.7 0000 0000 9758 5690 Division of Infectious Diseases, School of Medicine, School of Public Health, Oregon Health and Science University, 7 https://ror.org/03vek6s52 grid.38142.3c 000000041936754X Department of Dermatology, Brigham and Women’s Hospital, Harvard Medical School, 8 https://ror.org/00dvg7y05 grid.2515.3 0000 0004 0378 8438 Dermatology Program, Division of Immunology, Boston Children’s Hospital, 9 https://ror.org/02g5p4n58 grid.431072.3 0000 0004 0572 4227 AbbVie Inc., 10 https://ror.org/03538jp08 grid.467162.0 0000 0004 4662 2788 AbbVie Deutschland GmbH & Co. KG, 11 https://ror.org/04a9tmd77 grid.59734.3c 0000 0001 0670 2351 Department of Dermatology, Icahn School of Medicine at Mount Sinai, 12 https://ror.org/0420db125 grid.134907.8 0000 0001 2166 1519 Laboratory for Investigative Dermatology, Rockefeller University, 28 8 2025 2025 42 10 497685 5215 5237 25 6 2025 22 7 2025 28 08 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ Open Access http://creativecommons.org/licenses/by-nc/4.0/ Introduction We report the long-term safety of upadacitinib (oral, selective, and reversible Janus kinase inhibitor) in rheumatoid arthritis (RA), psoriatic arthritis (PsA), ankylosing spondylitis (AS), non-radiographic axial spondyloarthritis (nr-axSpA), atopic dermatitis (AD), Crohn’s disease (CD), and ulcerative colitis (UC). Methods Data were analyzed from 16 studies (data cutoff August 15, 2024). Each treatment group was pooled across studies within each indication. Active comparator arms included adalimumab (RA/PsA) and methotrexate (RA). Treatment-emergent adverse events (TEAEs) were reported as exposure-adjusted incidence rates per 100 patient-years ( n Results This analysis included 8632 (RA, n n n n n n n n Conclusion This descriptive analysis indicates a long-term safety profile of upadacitinib consistent with previous reports, further supporting long-term treatment of chronic diseases with upadacitinib. Variations in TEAE rates across indications likely reflected differences in populations and underlying comorbidities. Trial Registration ClinicalTrials.gov identifiers NCT02675426 NCT02706951 NCT02706847 NCT02629159 NCT02706873 NCT03086343 NCT03104374 NCT03104400 NCT03178487 NCT04169373 NCT03569293 NCT03568318 NCT03607422 NCT03345823 NCT02819635 Supplementary Information The online version contains supplementary material available at 10.1007/s12325-025-03328-y. Keywords Arthritis Atopic dermatitis Axial spondyloarthritis Infections Inflammatory bowel diseases Major adverse cardiovascular events Malignancy Rheumatoid Safety Upadacitinib http://dx.doi.org/10.13039/100006483 AbbVie Charité - Universitätsmedizin Berlin (3093) Open Access funding enabled and organized by Projekt DEAL. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Healthcare Ltd., part of Springer Nature 2025 Key Summary Points   Why carry out this study? Janus kinase (JAK) inhibitors have been associated with an increased risk of several adverse events, including serious infections, herpes zoster, malignancies, major adverse cardiovascular events (MACE), venous thromboembolisms (VTE), and laboratory-related abnormalities. An integrated safety analysis characterized the safety profile of upadacitinib, an oral, reversible JAK inhibitor, across rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, and atopic dermatitis; to build upon these findings, the analysis was expanded to increase follow-up duration and include additional approved indications (non-radiographic axial spondyloarthritis, Crohn’s disease, and ulcerative colitis).  What was learned from the study? Findings from this descriptive integrated safety analysis, based on over 8600 patients and 27,000 patient-years of exposure across 16 studies, indicate that upadacitinib is well tolerated over long-term follow-up; these long-term data are consistent with the known safety profile of upadacitinib. In rheumatoid arthritis and psoriatic arthritis, malignancy (excluding nonmelanoma skin cancer, [NMSC]), MACE, and VTE occurred at similar rates between upadacitinib and active comparators (adalimumab and methotrexate), while herpes zoster, NMSC, and elevated creatine kinase occurred more frequently with upadacitinib. Variations in rates of adverse events of special interest across indications were likely due to differences in patient populations and underlying comorbidities. Introduction Immune-mediated inflammatory diseases have traditionally been managed with corticosteroids, conventional synthetic disease-modifying antirheumatic drugs (csDMARDs), and biologic agents [ 1 2 3 2 Safety concerns surrounding JAK inhibitors increased following the Oral Rheumatoid Arthritis Trial (ORAL) Surveillance study, an event-driven, randomized, postmarketing, noninferiority trial that evaluated the JAK inhibitor tofacitinib vs tumor necrosis factor inhibitors in patients with rheumatoid arthritis (RA) receiving background methotrexate [ 4 5 9 Upadacitinib is an oral, selective, and reversible JAK inhibitor approved to treat multiple immune-mediated inflammatory diseases, including RA, psoriatic arthritis (PsA), atopic dermatitis (AD), ulcerative colitis (UC), Crohn’s disease (CD), ankylosing spondylitis (AS), non-radiographic axial spondyloarthritis (nr-axSpA), polyarticular juvenile idiopathic arthritis, and giant cell arteritis [ 10 11 15 An analysis of integrated data from upadacitinib clinical trials, encompassing over 15,000 patient-years (PY) of exposure in RA, PsA, AS, and AD, characterized the safety profile of upadacitinib and those of active comparators (where available) [ 16 Methods Patients and Studies This analysis included safety data from 16 upadacitinib studies (data cutoff date August 15, 2024). All studies were phase 3 studies, except for SELECT-AXIS 1, which was a phase 2/3 study. The patient populations from these studies have been described previously (Table S1 17 31 Treatment Data for each of the following treatment groups were pooled across studies within each indication: upadacitinib 15 mg once daily (RA, PsA, AS, nr-axSpA, AD, CD, and UC), upadacitinib 30 mg once daily (AD, CD, and UC), adalimumab 40 mg every other week (RA and PsA), and methotrexate (RA). For the RA and PsA studies, patients received upadacitinib or adalimumab as monotherapy or in combination with methotrexate or another csDMARD. Data for the methotrexate group were from SELECT-EARLY and reflect methotrexate use as monotherapy in patients with methotrexate-naive RA. The methotrexate dose (7.5–20 mg/week) varied by region and patient tolerability. For the AD studies, patients received upadacitinib as monotherapy or in combination with topical corticosteroids. UC and CD study data were from patients who responded to 8 or 12 weeks (or longer for extended induction) of once-daily upadacitinib 45 mg induction therapy, respectively, and then received once-daily upadacitinib 15 mg or 30 mg maintenance treatment. Safety Assessments Treatment-emergent adverse events (TEAEs) were coded according to the Medical Dictionary for Regulatory Activities. TEAEs were defined as any adverse event with an onset date on or after the first dose of study drug and up to 30 days after the last dose of upadacitinib or methotrexate, or up to 70 days after the last dose of adalimumab. Adverse events of special interest (AESIs) included serious infection, opportunistic infection (excluding herpes zoster and tuberculosis), herpes zoster, active tuberculosis, MACE (cardiovascular death, nonfatal myocardial infarction, and nonfatal stroke), VTE (deep vein thrombosis and pulmonary embolism), malignancy (excluding NMSC), NMSC, investigator-reported laboratory-related abnormalities (anemia, lymphopenia, neutropenia, elevated creatine kinase [CK]), hepatic disorder, renal dysfunction, gastrointestinal (GI) perforation, bone fracture, retinal detachment, and serious hypersensitivity reaction. An independent, external cardiovascular adjudication committee evaluated MACE and VTE in a blinded manner, and an independent, sponsor-employed committee of experts adjudicated GI perforations in a blinded manner. The proportion of patients who met criteria for potentially clinically significant changes (grade 3/4) in select laboratory parameters relevant to the JAK inhibitor class was evaluated. To grade laboratory changes for RA, the Rheumatology Common Toxicity Criteria version 2.0, developed by the Outcome Measures in Rheumatology Drug Safety Working Group [ 32 Statistical Analysis TEAEs are reported as exposure-adjusted incidence rates (EAIR) and, in the supplemental materials, as exposure-adjusted event rates (EAER). EAIR represents the number of patients with ≥ 1 event per 100 PY ( n Results Patients and Exposure This analysis included 8632 patients treated with upadacitinib over 27,164.2 PY. Based on data available up to the time of analysis, the median upadacitinib treatment duration was shorter in the nr-axSpA (53.8 weeks), CD (51.6 weeks), and UC (51.7 weeks) programs and longer in the RA (216.3 weeks) and AD (230.1 weeks) programs, reflecting differences in planned study durations. Adalimumab was a reference comparator arm in one RA (579 patients; 1978.0 PY) and one PsA (429 patients; 1520.0 PY) study. Methotrexate was a reference comparator arm in one RA study (314 patients; 860.1 PY). There were notable differences in baseline characteristics, such as mean age and proportions of male and female patients across studies, which were expected on the basis of the patient populations studied in this analysis (Table 1 2 Table 1 Baseline patient demographics and clinical characteristics Characteristic RA PsA AS nr-axSpA AD CD a UC a UPA n ADA n MTX n UPA n ADA n UPA n UPA n UPA n UPA n UPA n UPA n UPA n UPA n Age, years, mean (SD) 54.3 (12.0) 54.2 (11.7) 53.3 (12.9) 51.5 (12.1) 51.4 (12.0) 43.3 (12.3) 42.2 (12.2) 31.9 (15.2) 33.1 (15.9) 37.5 (13.4) 37.0 (13.0) 41.9 (14.2) 42.8 (14.5) Sex Female 2581 (80.4) 470 (81.2) 240 (76.4) 478 (52.7) 222 (51.7) 162 (27.2) 167 (58.4) 593 (44.4) 585 (43.5) 87 (39.4) 98 (42.8) 91 (36.4) 97 (38.6) Male 628 (19.6) 109 (18.8) 74 (23.6) 429 (47.3) 207 (48.3) 434 (72.8) 119 (41.6) 744 (55.6) 761 (56.5) 134 (60.6) 131 (57.2) 159 (63.6) 154 (61.4) BMI, mean (SD) 29.1 (6.7) b 29.4 (7.1) 28.0 (6.3) 30.6 (6.9) 30.7 (7.2) 26.8 (5.2) 28.2 (5.9) 25.7 (6.0) c 25.8 (5.6) d 24.2 (5.9) 24.4 (6.3) 24.9 (5.7) 25.3 (5.9) e Time since diagnosis, years, mean (SD) 8.5 (8.4) b 8.2 (8.0) 2.6 (5.1) 7.2 (7.8) 5.9 (7.1) 7.4 (7.9) 5.0 (5.8) 20.5 (14.2) 20.8 (14.7) f 10.5 (8.6) 9.4 (8.6) 8.4 (7.3) 8.2 (6.9) Concomitant therapies csDMARDs 2548 (79.4) 579 (100) 0 652 (71.9) 346 (80.7) 159 (26.7) 88 (30.8) N/A N/A N/A N/A N/A N/A MTX alone 2180 (67.9) 534 (92.2) 0 490 (54.0) 255 (59.4) 52 (8.7) 32 (11.2) N/A N/A N/A N/A N/A N/A csDMARD other than MTX 198 (6.2) 45 (7.8) 0 126 (13.9) 74 (17.2) 102 (17.1) 52 (18.2) N/A N/A N/A N/A N/A N/A Corticosteroids 1756 (54.7) 350 (60.4) 164 (52.2) 133 (14.7) 70 (16.3) 59 (9.9) 31 (10.8) N/A N/A 80 (36.2) 85 (37.1) 95 (38.0) 89 (35.5) Topical corticosteroids N/A N/A N/A N/A N/A N/A N/A 436 (32.6) 444 (33.0) N/A N/A N/A N/A NSAIDs 2032 (63.3) 364 (62.9) 223 (71.0) 566 (62.4) 281 (65.5) 471 (79.0) 213 (74.5) N/A N/A 5 (2.3) 4 (1.7) 4 (1.6) 3 (1.2) Aspirin 269 (8.4) 36 (6.2) 24 (7.6) 89 (9.8) 27 (6.3) 17 (2.9) 5 (1.7) 25 (1.9) 45 (3.3) 2 (0.9) 7 (3.1) 6 (2.4) 8 (3.2) Statins 321 (10.0) 42 (7.3) 26 (8.3) 82 (9.0) 28 (6.5) 17 (2.9) 8 (2.8) 8 (0.6) 6 (0.4) 2 (0.9) 3 (1.3) 8 (3.2) 12 (4.8) History of HZ 71 (2.2) 12 (2.1) 4 (1.3) 27 (3.0) 7 (1.6) 10 (1.7) 4 (1.4) 29 (2.2) 46 (3.4) 6 (2.7) 4 (1.7) 7 (2.8) 8 (3.2) Prior HZ vaccination 92 (2.9) 15 (2.6) 4 (1.3) 35 (3.9) 14 (3.3) 11 (1.8) 9 (3.1) 51 (3.8) 67 (5.0) 16 (7.2) 17 (7.4) 5 (2.0) 12 (4.8) Presence/history of CV risk factors 2610 (81.3) 467 (80.7) 240 (76.4) 783 (86.3) 359 (83.7) 436 (73.2) 200 (69.9) 711 (53.2) 694 (51.6) 138 (62.4) 137 (59.8) 141 (56.4) 156 (62.2) Age ≥ 65 years 643 (20.0) 106 (18.3) 58 (18.5) 129 (14.2) 67 (15.6) 32 (5.4) 8 (2.8) 48 (3.6) 68 (5.1) 7 (3.2) 8 (3.5) 23 (9.2) 21 (8.4) BMI ≥ 30 kg/m 2 1201 (37.4) 227 (39.2) 97 (30.9) 431 (47.5) 209 (48.7) 140 (23.5) 92 (32.2) 251 (18.9) 258 (19.3) 44 (19.9) 44 (19.2) 43 (17.2) 43 (17.3) Current or former smoker g 944 (29.4) 151 (26.1) 95 (30.3) 290 (32.0) 129 (30.1) 237 (39.8) 78 (27.3) 357 (26.7) 352 (26.2) 73 (33.0) 68 (29.7) 65 (26.0) 73 (29.1) > 4 alcoholic drinks/day 4 (0.1) 1 (0.2) 2 (0.6) 3 (0.3) 1 (0.2) 3 (0.5) 0 14 (1.0) 13 (1.0) 0 0 2 (0.8) 1 (0.4) CV disease 344 (10.7) 48 (8.3) 22 (7.0) 98 (10.8) 31 (7.2) 27 (4.5) 15 (5.2) 33 (2.5) 39 (2.9) 6 (2.7) 8 (3.5) 13 (5.2) 14 (5.6) Diabetes mellitus h 384 (12.0) 61 (10.5) 31 (9.9) 124 (13.7) 48 (11.2) 24 (4.0) 15 (5.2) 27 (2.0) 28 (2.1) 4 (1.8) 7 (3.1) 15 (6.0) 17 (6.8) HTN i 1427 (44.5) 255 (44.0) 114 (36.3) 408 (45.0) 184 (42.9) 120 (20.1) 62 (21.7) 149 (11.1) 131 (9.7) 21 (9.5) 33 (14.4) 28 (11.2) 43 (17.1) VTE 37 (1.2) 7 (1.2) 3 (1.0) 18 (2.0) 3 (0.7) 1 (0.2) 1 (0.3) 4 (0.3) 6 (0.4) 4 (1.8) 2 (0.9) 3 (1.2) 5 (2.0) CKD 25 (0.8) 5 (0.9) 2 (0.6) 11 (1.2) 5 (1.2) 4 (0.7) 1 (0.3) 4 (0.3) 4 (0.3) 3 (1.4) 0 3 (1.2) 1 (0.4) Dyslipidemia 650 (20.3) 98 (16.9) 51 (16.2) 225 (24.8) 96 (22.4) 72 (12.1) 42 (14.7) 95 (7.1) 91 (6.8) 8 (3.6) 16 (7.0) 21 (8.4) 26 (10.4) Elevated LDL-C (≥ 160 mg/dL) 265 (8.3) 61 (10.5) 25 (8.0) 75 (8.5) 39 (9.3) 59 (9.9) 38 (13.4) 44 (3.3) 43 (3.2) 4 (1.8) 1 (0.4) 7 (2.9) 7 (2.9) Lowered HDL-C (< 40 mg/dL) 354 (11.0) 53 (9.2) 39 (12.4) 176 (19.6) 95 (22.4) 135 (22.7) 51 (17.8) 177 (13.2) 168 (12.5) 51 (23.1) 46 (20.1) 30 (12.3) 42 (17.3) Data are n AD ADA AS BMI CD CKD csDMARD CV HDL-C HTN HZ LDL-C MTX N/A nr-axSpA NSAID PsA RA SD UC UPA VTE a b n c n d n e n f n g h i General Safety Overview EAIRs of any TEAEs with upadacitinib ranged from 112.0 n n 2 n S2 n n S3 n n n n n Table 2 Summary of drug exposure and exposure-adjusted incidence rates of TEAEs Parameter RA PsA AS nr-axSpA AD CD UC UPA n ADA n MTX n UPA n ADA n UPA n UPA n UPA n UPA n UPA n UPA n UPA n UPA n Exposure Total PY 12,315.8 1978.0 860.1 2971.7 1520.0 1015.3 380.7 4435.2 4752.5 387.2 487.9 199.4 218.5 Weeks, median (min, max) 216.3 (0.3, 441.0) 114.3 (0.1, 446.6) 134.1 (1.0, 263.1) 190.1 (0.1, 332.9) 259.7 (2.0, 294.4) 91.0 (0.1, 198.0) 53.8 (0.1, 119.6) 214.1 (0.1, 305.4) 230.1 (0.1, 302.3) 51.6 (1.3, 295.7) 103.1 (1.1, 294.0) 51.7 (0.3, 57.0) 52.0 (1.1, 64.0) TEAEs, n Any TEAE 401.1 (386.6, 416.0) 354.2 (322.8, 387.8) 391.7 (346.3, 441.4) 145.3 (135.6, 155.6) 126.5 (114.3, 139.7) 112.0 (101.9, 122.8) 137.8 (119.9, 157.7) 138.4 (130.7, 146.5) 175.6 (166.0, 185.6) 199.0 (171.6, 229.5) 199.1 (172.8 (228.2) 241.0 (208.2, 277.5) 229.1 (198.4, 263.2) Any serious TEAE 10.5 (9.8, 11.2) 11.0 (9.3, 12.9) 6.8 (5.1, 9.0) 7.8 (6.7, 8.9) 6.3 (5.1, 7.8) 6.7 (5.2, 8.6) 7.9 (5.3, 11.4) 4.5 (3.9, 5.2) 5.3 (4.6, 6.0) 10.5 (7.5, 14.5) 10.2 (7.4, 13.6) 11.0 (6.8, 16.8) 9.9 (6.1, 15.1) Any treatment-related TEAE a 36.9 (35.2, 38.7) 28.3 (24.9, 31.9) 50.3 (43.0, 58.4) 29.0 (26.5, 31.7) 30.4 (26.7, 34.4) 29.9 (26.1, 34.2) 30.6 (24.6, 37.7) 30.1 (27.9, 32.3) 43.2 (40.4, 46.1) 33.0 (26.4, 40.7) 38.1 (31.2, 46.0) 59.0 (47.3, 72.7) 61.3 (49.7, 74.7) Any TEAE leading to treatment discontinuation 4.3 (3.9, 4.7) 4.4 (3.5, 5.5) 5.3 (3.8, 7.1) 4.3 (3.6, 5.1) 3.4 (2.5, 4.4) 2.9 (1.9, 4.1) 4.2 (2.4, 6.8) 3.6 (3.1, 4.2) 3.9 (3.4, 4.5) 5.4 (3.4, 8.3) 4.8 (3.0, 7.1) 5.5 (2.8, 9.9) 8.3 (4.9, 13.1) Any TEAE leading to death 0.7 (0.5, 0.8) 0.7 (0.4, 1.1) 0.1 (0, 0.6) 0.6 (0.4, 1.0) 0.2 (0, 0.6) < 0.1 (0, 0.5) 0 (0, 1.0) < 0.1 (0, 0.2) 0.1 (0, 0.2) 0.3 (0, 1.4) 0 (0, 0.8) 0 (0, 1.8) 0 (0, 1.7) Any death b n 0.8 (0.6, 1.0) 0.9 (0.5, 1.4) 0.9 (0.4, 1.8) 0.8 (0.5, 1.2) 0.3 (0.1, 0.8) < 0.1 (0, 0.5) 0 (0, 1.0) 0.1 (0, 0.3) 0.1 (0, 0.3) 0.3 (0, 1.4) 0 (0, 0.8) 0 (0, 1.8) 0 (0, 1.7) AD ADA AS CD max min CI MTX n nr-axSpA PsA PY RA TEAE UC UPA a b AESIs AESIs are reported as EAIR in the text and presented in Figs. 1 2 3 S1 S3 Fig. 1 Exposure-adjusted incidence rates of infections, malignancies, and cardiovascular events a AD ADA AS CD CI excl. HZ MACE MTX NMSC n nr-axSpA PsA RA TB UC UPA VTE a n n n n n n n n n n n n n Fig. 2 Exposure-adjusted incidence rates of investigator-reported laboratory-related abnormalities a AD ADA AS CD CI CK MTX n nr-axSpA PsA RA UC UPA a n n n n n n n n n n n n n Fig. 3 Exposure-adjusted incidence rates of GI perforation, bone fracture, retinal detachment, and serious hypersensitivity reaction a AD ADA AS CD CI GI MTX n nr-axSpA PsA RA UC UPA a n n n n n n n n n n n n n Serious and Opportunistic Infections Across indications, EAIRs of serious infections with upadacitinib treatment ranged from 1.3 n n 1 n n n n n Opportunistic infections (excluding herpes zoster and tuberculosis) were reported in all indications, with the lowest EAIR observed in rheumatological diseases (≤ 0.3 n 1 S4 n n Pneumocystis jirovecii The EAIRs of herpes zoster in patients treated with upadacitinib ranged from 2.4 to 6.6 n 1 33 n n n n S5 Tuberculosis was rare (EAIR of < 0.1 n 1 Malignancies The EAIR of malignancy (excluding NMSC) was low, occurring at rates of < 1.0 n 1 S6 n Across all treatment groups and indications, EAIRs of NMSC were < 1.5 n n 1 Adjudicated MACE and VTE The EAIR of MACE was low, occurring at rates of ≤ 0.5 n 1 n n Among patients treated with upadacitinib, VTE was observed more commonly in the nr-axSpA (0.8 n n n n 1 S7 Laboratory-Related Abnormalities EAIRs of investigator-reported anemia and lymphopenia varied across indications and trended higher in patients with CD and UC (Fig. 2 n n 34 36 n n n n n In RA, the proportion of patients with grade 3/4 laboratory abnormalities was generally comparable between upadacitinib 15 mg and adalimumab; grade 3 decreases in lymphocytes and grade 3 elevations in alanine aminotransferase, aspartate aminotransferase, and CK occurred more frequently with methotrexate than with upadacitinib 15 mg (Tables S8 S9 GI Perforation, Bone Fracture, Retinal Detachment, and Serious Hypersensitivity Reaction The EAIR of GI perforation was low (≤ 0.1 n n n 3 22 n n n Rates of AESIs Over Time Across all indications, EAIRs of serious infection, herpes zoster, malignancy (excluding NMSC), NMSC, MACE, and VTE remained stable over time (Figs. S4 S9 AESIs by Age EAIRs of several AESIs were generally higher in patients aged ≥ 65 years vs < 65 years, including serious infection, herpes zoster, malignancy, VTE, anemia, renal dysfunction, and bone fracture (Tables S10 S11 Discussion This descriptive integrated safety analysis, comprising data from 16 studies and over 27,000 patient-years of exposure, provides a comprehensive characterization of the long-term safety profile of upadacitinib across a broad spectrum of immune-mediated inflammatory diseases. Our analysis indicates that long-term treatment of chronic diseases with upadacitinib remains well tolerated. EAIRs of AESIs remained stable over time, suggesting no clear evidence of a cumulative increase in safety risk with longer upadacitinib exposure. Variations in EAIRs of TEAEs among different indications likely reflect differences in patient populations and underlying background risks [ 37 42 2 43 44 45 46 47 47 n n 22 Data from ORAL Surveillance, a head-to-head study conducted in a RA population enriched for cardiovascular risk, showed that one or both doses of tofacitinib were associated with a higher incidence of several adverse events compared with tumor necrosis factor inhibitors [ 4 48 49 n 46 50 52 53 3 10 54 55 Other known safety risks of JAK inhibitors include herpes zoster, NMSC, and elevated CK levels [ 2 56 10 57 58 2 3 59 3 Higher EAIRs of several AESIs were observed among patients aged ≥ 65 years vs < 65 years, which may be due to factors related to advanced age, such as increased frailty, comorbidities, and concomitant medications. Although we were unable to directly compare the incidence of AESIs in the studied populations with the background incidence in older patients because of methodological challenges, other studies have also identified older age as a significant risk factor for several AESIs [ 4 60 62 JAK inhibitors, including upadacitinib, have demonstrated efficacy in managing a range of immune-mediated inflammatory diseases, and their overall safety profiles are increasingly well characterized through extensive clinical trial programs and real-world experience [ 10 63 71 Major strengths of this analysis include its large sample size, long-term follow-up, and the inclusion of data from seven indications. The use of adalimumab (RA and PsA) and methotrexate (RA only) as comparator arms in long-term treatment enabled meaningful contextualization of safety data. Our findings provide clinicians with a comprehensive and detailed understanding of the long-term safety profile of upadacitinib, minimizing the need to extrapolate safety results from other JAK inhibitors or different indications. Limitations include the lack of comparator arms in indications other than RA and PsA. Additionally, safety data for polyarticular juvenile idiopathic arthritis and giant cell arteritis were not included because of insufficient long-term data to support an assessment of long-term safety. As all safety data were reported in clinical trial settings, further research is warranted to characterize the safety profile of upadacitinib across multiple indications in real-world settings. The median observation time varied across indications; the median observation time was about 1 year in three indications and approximately 5 years in two indications. No statistical tests for significance were performed, and all analyses are descriptive. Therefore, comparisons across treatments and indications should be made with caution. Differences in patient characteristics and varying comorbidities across indications further complicate the interpretation of safety data. For an individual indication in which data were pooled from multiple studies, the populations in these studies were generally similar; however, variability in factors, such as age, sex, disease severity, and prior treatment history, may have influenced the observed safety outcomes. Lastly, the proportion of patients aged ≥ 65 years was small for several indications; however, safety findings by age were consistent with those reported in other studies characterizing JAK inhibitor safety [ 4 60 62 Conclusions This descriptive safety analysis characterized the long-term safety profile of upadacitinib in multiple indications. Findings from this analysis indicate that long-term treatment of chronic diseases with upadacitinib remains well tolerated across various inflammatory diseases. Variations in EAIRs of TEAEs were observed across indications, potentially reflecting differences in patient populations and underlying background risks. Findings from this analysis can provide clinicians with a comprehensive understanding of the long-term safety profile of upadacitinib, enabling more informed treatment decisions tailored to individual patient needs. Supplementary Information Below is the link to the electronic supplementary material. Supplementary file1 (PDF 1414 KB) Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements AbbVie and the authors thank all trial investigators and the patients who participated in these clinical trials. Author Contributions Gerd R Burmester, Gweneth Levy, Smitha Suravaram, Hannah Palac, Lani Wegrzyn, and Sebastian Meerwein contributed to the study conception and design. Gerd R Burmester, Atul Deodhar, Alan D Irvine, Remo Panaccione, Sebastian Meerwein, and Emma Guttman-Yassky participated in data acquisition. Hannah Palac, Lani Wegrzyn, and Sebastian Meerwein contributed to the statistical analysis of the data. Gerd R Burmester, Atul Deodhar, Alan D Irvine, Remo Panaccione, Kevin L Winthrop, Ruth Ann Vleugels, Gweneth Levy, Smitha Suravaram, Hannah Palac, Lani Wegrzyn, Sharanya Ford, Sebastian Meerwein, and Emma Guttman-Yassky interpreted the data, critically reviewed the manuscript, approved the final manuscript, and agreed to be accountable for the integrity and accuracy of the manuscript. Funding AbbVie funded this study and participated in the study design, research, analysis, data collection, interpretation of data, reviewing, and approval of the publication. The journal’s Rapid Service and Open Access Fees were funded by AbbVie. All authors had access to relevant data and participated in the drafting, review, and approval of this publication. No honoraria or payments were made for authorship. Data Availability AbbVie is committed to responsible data sharing regarding the studies we sponsor. This includes access to anonymized individual data, as well as other information (e.g., protocols and analysis plans). These data can be requested by any qualified researchers who engage in rigorous, independent, scientific research, and will be provided following review and approval of a research proposal, statistical analysis plan (SAP), and execution of a data sharing agreement (DSA). Data requests can be submitted at any time after approval in the United States and Europe, and after acceptance of this manuscript for publication. The data will be accessible for 12 months, with possible extensions considered. For more information on the process or to submit a request, visit the following link: https://vivli.org/ourmember/abbvie/ Declarations Medical Writing/Editorial Assistance Medical writing support was provided by Jay Parekh, PharmD, ISMPP CMPP™, of JB Ashtin, and funded by AbbVie. Conflict of Interest Gerd R Burmester reports consulting fees from AbbVie, Amgen, Bristol Myers Squibb, Galapagos, Lilly, Pfizer, and Sanofi; and speaker fees from AbbVie, Amgen, Bristol Myers Squibb, Chugai, Galapagos, Lilly, Pfizer, and Sanofi. Atul Deodhar has received speaker fees from Johnson & Johnson, Novartis, Pfizer, and UCB; consulting fees from Bristol Myers Squibb, Johnson & Johnson, Lilly, MoonLake, Novartis, Pfizer, and UCB; and grant/research support from Bristol Myers Squibb, Johnson & Johnson, Lilly, MoonLake, Novartis, Pfizer, and UCB. Alan D Irvine has received grants, consulting fees, and/or advisory board honoraria from AbbVie, Almirall, Arena, Benevolent AI, Connect Biopharma, Janssen, LEO Pharma, Lilly, Novartis, Pfizer, RAPT Therapeutics, Regeneron, Sanofi, and UCB. He is on the board of directors of the International Eczema Council. Remo Panaccione has received consulting fees from AbbVie, Abbott, Abbivax, Alimentiv, Amgen, AnaptysBio, AstraZeneca, Biogen, Boehringer Ingelheim, Bristol Myers Squibb, Celgene, Celltrion, Cosmos Pharmaceuticals, Eisai, Elan, Ferring, Fresenius Kabi, Galapagos, Inviva, Genentech, Gilead Sciences, GSK, JAMP Bio, Janssen, Lilly, Merck, Mirador, Novartis, Oppilan Pharma, Odyssey, Organon, Pandion Pharma, Pendopharm, Pfizer, Progenity, Prometheus Biosciences, Protagonist Therapeutics, Roche, Sandoz, Sanofi, Satisfai Health, Shire, Spyre Therapeutics, Sublimity Therapeutics, Takeda, Teva, Tillots, Trellus, Union Biopharma, Viatris, Ventyx, and UCB; speaker fees from AbbVie, Amgen, Arena Pharmaceuticals, Bristol Myers Squibb, Celgene, Ferring, Fresenius Kabi, Gilead Sciences, Janssen, Lilly, Merck, Organon, Pfizer, Roche, Sandoz, Shire, Takeda; and has served on advisory boards for AbbVie, Alimentiv, Amgen, Arena Pharmaceuticals, AstraZeneca, Biogen, Boehringer Ingelheim, Bristol Myers Squibb, Celgene, Ferring, Fresenius Kabi, Genentech, Gilead Sciences, GSK, JAMP Bio, Janssen, Lilly, Merck, Mylan, Novartis, Oppilan Pharma, Organon, Pandion Pharma, Pfizer, Progenity, Protagonist Therapeutics, Roche, Sandoz, Sanofi, Sublimity Therapeutics, Takeda, and Ventyx. Kevin L Winthrop has received consulting fees, grants and/or research support from AbbVie, AstraZeneca, Bristol Myers Squibb, Galapagos, Gilead, GSK, Lilly, Novartis, Pfizer, Regeneron, Roche, Sanofi, and UCB. Ruth Ann Vleugels is an investigator and/or consultant for AbbVie, AstraZeneca, Lilly, Pfizer, and Priovant. Gweneth Levy, Smitha Suravaram, Hannah Palac, Lani Wegrzyn, Sharanya Ford, and Sebastian Meerwein are full-time employees of AbbVie, and may hold AbbVie stock and/or stock options. Emma Guttman-Yassky is an employee of Mount Sinai and has received research grants (paid to the institution) from and/or a consultant for AbbVie, Aclaris, Almirall, Alumis, Amgen, AnaptysBio, Apogee, Apollo, Arcutis, Artax, Astria, Boehringer Ingelheim, Bristol Myers Squibb, Celldex, Centrexion, Concerto, Connect, Coty, DBV, Dualitas, Enveda, Escient, Galderma, Gate Bio, GSK, Incyte, Inmagene, Janssen, Jasper, Kymera, Kyowa Kirin, LEO Pharma, Lilly, Matchpoint, Merck, Nektar, NUMAB, Opsidio, OTSUKA, Pfizer, Pharmaxis, Proteologix, Q32 Bio, RAPT, RayThera, Regeneron, Ribon, Sanofi, SATO, Schrödinger, Sitryx, Sun Pharma, Takeda, Teva, TRex, UCB, VRG Therapeutics, and Xencor. Ethical Approval All studies were conducted in accordance with the Declaration of Helsinki, the International Council for Harmonisation guidelines, and applicable local regulations. An independent ethics committee or institutional review board at each study site approved the protocol. Patients (or legal guardians of adolescents) provided written informed consent before beginning the study. References 1. Monteleone G Moscardelli A Colella A Marafini I Salvatori S Immune-mediated inflammatory diseases: common and different pathogenic and clinical features Autoimmun Rev 2023 22 103410 37597601 10.1016/j.autrev.2023.103410 Monteleone G, Moscardelli A, Colella A, Marafini I, Salvatori S. Immune-mediated inflammatory diseases: common and different pathogenic and clinical features. Autoimmun Rev. 2023;22:103410. 37597601 10.1016/j.autrev.2023.103410 2. Kraev K, Geneva-Popova MG, Hristov BK, et al. Examining the safety profile of Janus kinase (JAK) inhibitors in the management of immune-mediated diseases: a comprehensive review. Life (Basel). 2023;13:2244. 10.3390/life13122244 PMC10744491 38137845 3. Nash P Kerschbaumer A Dörner T Points to consider for the treatment of immune-mediated inflammatory diseases with Janus kinase inhibitors: a consensus statement Ann Rheum Dis 2021 80 71 87 33158881 10.1136/annrheumdis-2020-218398 PMC7788060 Nash P, Kerschbaumer A, Dörner T, et al. Points to consider for the treatment of immune-mediated inflammatory diseases with Janus kinase inhibitors: a consensus statement. Ann Rheum Dis. 2021;80:71–87. 33158881 10.1136/annrheumdis-2020-218398 PMC7788060 4. Ytterberg SR Bhatt DL Mikuls TR Cardiovascular and cancer risk with tofacitinib in rheumatoid arthritis N Engl J Med 2022 386 316 326 35081280 10.1056/NEJMoa2109927 Ytterberg SR, Bhatt DL, Mikuls TR, et al. Cardiovascular and cancer risk with tofacitinib in rheumatoid arthritis. N Engl J Med. 2022;386:316–26. 35081280 10.1056/NEJMoa2109927 5. Balanescu AR Citera G Pascual-Ramos V Infections in patients with rheumatoid arthritis receiving tofacitinib versus tumour necrosis factor inhibitors: results from the open-label, randomised controlled ORAL Surveillance trial Ann Rheum Dis 2022 81 1491 1503 35922124 10.1136/ard-2022-222405 PMC9606533 Balanescu AR, Citera G, Pascual-Ramos V, et al. Infections in patients with rheumatoid arthritis receiving tofacitinib versus tumour necrosis factor inhibitors: results from the open-label, randomised controlled ORAL Surveillance trial. Ann Rheum Dis. 2022;81:1491–503. 35922124 10.1136/ard-2022-222405 PMC9606533 6. Charles-Schoeman C Buch MH Dougados M Risk of major adverse cardiovascular events with tofacitinib versus tumour necrosis factor inhibitors in patients with rheumatoid arthritis with or without a history of atherosclerotic cardiovascular disease: a post hoc analysis from ORAL Surveillance Ann Rheum Dis 2023 82 119 129 36137735 10.1136/ard-2022-222259 PMC9811099 Charles-Schoeman C, Buch MH, Dougados M, et al. Risk of major adverse cardiovascular events with tofacitinib versus tumour necrosis factor inhibitors in patients with rheumatoid arthritis with or without a history of atherosclerotic cardiovascular disease: a post hoc analysis from ORAL Surveillance. Ann Rheum Dis. 2023;82:119–29. 36137735 10.1136/ard-2022-222259 PMC9811099 7. Curtis JR Yamaoka K Chen YH Malignancy risk with tofacitinib versus TNF inhibitors in rheumatoid arthritis: results from the open-label, randomised controlled ORAL Surveillance trial Ann Rheum Dis 2023 82 331 343 36600185 10.1136/ard-2022-222543 PMC9933177 Curtis JR, Yamaoka K, Chen YH, et al. Malignancy risk with tofacitinib versus TNF inhibitors in rheumatoid arthritis: results from the open-label, randomised controlled ORAL Surveillance trial. Ann Rheum Dis. 2023;82:331–43. 36600185 10.1136/ard-2022-222543 PMC9933177 8. Karpouzas G Szekanecz Z Baecklund E POS0519 Relationship between disease activity and major adverse events in patients with rheumatoid arthritis on tofacitinib or TNF inhibitors: a post hoc analysis of ORAL Surveillance Ann Rheum Dis 2022 81 517 518 Karpouzas G, Szekanecz Z, Baecklund E, et al. POS0519 Relationship between disease activity and major adverse events in patients with rheumatoid arthritis on tofacitinib or TNF inhibitors: a post hoc analysis of ORAL Surveillance. Ann Rheum Dis. 2022;81:517–8. 9. Kristensen LE Danese S Yndestad A Identification of two tofacitinib subpopulations with different relative risk versus TNF inhibitors: an analysis of the open label, randomised controlled study ORAL Surveillance Ann Rheum Dis 2023 82 901 910 36931693 10.1136/ard-2022-223715 PMC10314011 Kristensen LE, Danese S, Yndestad A, et al. Identification of two tofacitinib subpopulations with different relative risk versus TNF inhibitors: an analysis of the open label, randomised controlled study ORAL Surveillance. Ann Rheum Dis. 2023;82:901–10. 36931693 10.1136/ard-2022-223715 PMC10314011 10. RINVOQ (upadacitinib). Prescribing information. AbbVie Inc.; 2025. https://www.rxabbvie.com/pdf/rinvoq_pi.pdf 11. A study to assess change in disease activity and adverse events of oral upadacitinib in adult and adolescent participants with moderate to severe hidradenitis suppurativa who have failed anti-TNF therapy (step-up HS). ClinicalTrials.gov identifier NCT05889182 https://clinicaltrials.gov/study/NCT05889182 12. A study to assess adverse events and effectiveness of upadacitinib oral tablets in adult and adolescent participants with vitiligo (Viti-Up). ClinicalTrials.gov identifier NCT06118411 https://clinicaltrials.gov/study/NCT06118411 13. A study to evaluate the safety and effectiveness of upadacitinib tablets in adult and adolescent participants with severe alopecia areata (Up-AA). ClinicalTrials.gov identifier NCT06012240 https://clinicaltrials.gov/study/NCT06012240 14. Program to assess adverse events and change in disease activity of oral upadacitinib in adult participants with moderate to severe systemic lupus erythematosus (SELECT-SLE). ClinicalTrials.gov identifier NCT05843643 https://clinicaltrials.gov/study/NCT05843643 15. A study to evaluate the efficacy and safety of upadacitinib in participants with takayasu arteritis (TAK) (SELECT-TAK). ClinicalTrials.gov identifier NCT04161898 https://clinicaltrials.gov/study/NCT04161898 16. Burmester GR Cohen SB Winthrop KL Safety profile of upadacitinib over 15 000 patient-years across rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis and atopic dermatitis RMD Open 2023 9 e002735 36754548 10.1136/rmdopen-2022-002735 PMC9923346 Burmester GR, Cohen SB, Winthrop KL, et al. Safety profile of upadacitinib over 15 000 patient-years across rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis and atopic dermatitis. RMD Open. 2023;9:e002735. 36754548 10.1136/rmdopen-2022-002735 PMC9923346 17. Burmester GR Kremer JM Van den Bosch F Safety and efficacy of upadacitinib in patients with rheumatoid arthritis and inadequate response to conventional synthetic disease-modifying anti-rheumatic drugs (SELECT-NEXT): a randomised, double-blind, placebo-controlled phase 3 trial Lancet 2018 391 2503 2512 29908669 10.1016/S0140-6736(18)31115-2 Burmester GR, Kremer JM, Van den Bosch F, et al. Safety and efficacy of upadacitinib in patients with rheumatoid arthritis and inadequate response to conventional synthetic disease-modifying anti-rheumatic drugs (SELECT-NEXT): a randomised, double-blind, placebo-controlled phase 3 trial. Lancet. 2018;391:2503–12. 29908669 10.1016/S0140-6736(18)31115-2 18. Deodhar A Van den Bosch F Poddubnyy D Upadacitinib for the treatment of active non-radiographic axial spondyloarthritis (SELECT-AXIS 2): a randomised, double-blind, placebo-controlled, phase 3 trial Lancet 2022 400 369 379 35908570 10.1016/S0140-6736(22)01212-0 Deodhar A, Van den Bosch F, Poddubnyy D, et al. Upadacitinib for the treatment of active non-radiographic axial spondyloarthritis (SELECT-AXIS 2): a randomised, double-blind, placebo-controlled, phase 3 trial. Lancet. 2022;400:369–79. 35908570 10.1016/S0140-6736(22)01212-0 19. Fleischmann R Pangan AL Song IH Upadacitinib versus placebo or adalimumab in patients with rheumatoid arthritis and an inadequate response to methotrexate: results of a phase III, double-blind, randomized controlled trial Arthritis Rheumatol 2019 71 1788 1800 31287230 10.1002/art.41032 Fleischmann R, Pangan AL, Song IH, et al. Upadacitinib versus placebo or adalimumab in patients with rheumatoid arthritis and an inadequate response to methotrexate: results of a phase III, double-blind, randomized controlled trial. Arthritis Rheumatol. 2019;71:1788–800. 31287230 10.1002/art.41032 20. Genovese MC Fleischmann R Combe B Safety and efficacy of upadacitinib in patients with active rheumatoid arthritis refractory to biologic disease-modifying anti-rheumatic drugs (SELECT-BEYOND): a double-blind, randomised controlled phase 3 trial Lancet 2018 391 2513 2524 29908670 10.1016/S0140-6736(18)31116-4 Genovese MC, Fleischmann R, Combe B, et al. Safety and efficacy of upadacitinib in patients with active rheumatoid arthritis refractory to biologic disease-modifying anti-rheumatic drugs (SELECT-BEYOND): a double-blind, randomised controlled phase 3 trial. Lancet. 2018;391:2513–24. 29908670 10.1016/S0140-6736(18)31116-4 21. Guttman-Yassky E Teixeira HD Simpson EL Once-daily upadacitinib versus placebo in adolescents and adults with moderate-to-severe atopic dermatitis (Measure Up 1 and Measure Up 2): results from two replicate double-blind, randomised controlled phase 3 trials Lancet 2021 397 2151 2168 34023008 10.1016/S0140-6736(21)00588-2 Guttman-Yassky E, Teixeira HD, Simpson EL, et al. Once-daily upadacitinib versus placebo in adolescents and adults with moderate-to-severe atopic dermatitis (Measure Up 1 and Measure Up 2): results from two replicate double-blind, randomised controlled phase 3 trials. Lancet. 2021;397:2151–68. 34023008 10.1016/S0140-6736(21)00588-2 22. Loftus EV Jr Panés J Lacerda AP Upadacitinib induction and maintenance therapy for Crohn’s disease N Engl J Med 2023 388 1966 1980 37224198 10.1056/NEJMoa2212728 Loftus EV Jr, Panés J, Lacerda AP, et al. Upadacitinib induction and maintenance therapy for Crohn’s disease. N Engl J Med. 2023;388:1966–80. 37224198 10.1056/NEJMoa2212728 23. McInnes IB Anderson JK Magrey M Trial of upadacitinib and adalimumab for psoriatic arthritis N Engl J Med 2021 384 1227 1239 33789011 10.1056/NEJMoa2022516 McInnes IB, Anderson JK, Magrey M, et al. Trial of upadacitinib and adalimumab for psoriatic arthritis. N Engl J Med. 2021;384:1227–39. 33789011 10.1056/NEJMoa2022516 24. Mease PJ Lertratanakul A Anderson JK Upadacitinib for psoriatic arthritis refractory to biologics: SELECT-PsA 2 Ann Rheum Dis 2021 80 312 320 33272960 10.1136/annrheumdis-2020-218870 PMC7892371 Mease PJ, Lertratanakul A, Anderson JK, et al. Upadacitinib for psoriatic arthritis refractory to biologics: SELECT-PsA 2. Ann Rheum Dis. 2021;80:312–20. 33272960 10.1136/annrheumdis-2020-218870 PMC7892371 25. Reich K Teixeira HD de Bruin-Weller M Safety and efficacy of upadacitinib in combination with topical corticosteroids in adolescents and adults with moderate-to-severe atopic dermatitis (AD Up): results from a randomised, double-blind, placebo-controlled, phase 3 trial Lancet 2021 397 2169 2181 34023009 10.1016/S0140-6736(21)00589-4 Reich K, Teixeira HD, de Bruin-Weller M, et al. Safety and efficacy of upadacitinib in combination with topical corticosteroids in adolescents and adults with moderate-to-severe atopic dermatitis (AD Up): results from a randomised, double-blind, placebo-controlled, phase 3 trial. Lancet. 2021;397:2169–81. 34023009 10.1016/S0140-6736(21)00589-4 26. Rubbert-Roth A Enejosa J Pangan AL Trial of upadacitinib or abatacept in rheumatoid arthritis N Engl J Med 2020 383 1511 1521 33053283 10.1056/NEJMoa2008250 Rubbert-Roth A, Enejosa J, Pangan AL, et al. Trial of upadacitinib or abatacept in rheumatoid arthritis. N Engl J Med. 2020;383:1511–21. 33053283 10.1056/NEJMoa2008250 27. Smolen JS Pangan AL Emery P Upadacitinib as monotherapy in patients with active rheumatoid arthritis and inadequate response to methotrexate (SELECT-MONOTHERAPY): a randomised, placebo-controlled, double-blind phase 3 study Lancet 2019 393 2303 2311 31130260 10.1016/S0140-6736(19)30419-2 Smolen JS, Pangan AL, Emery P, et al. Upadacitinib as monotherapy in patients with active rheumatoid arthritis and inadequate response to methotrexate (SELECT-MONOTHERAPY): a randomised, placebo-controlled, double-blind phase 3 study. Lancet. 2019;393:2303–11. 31130260 10.1016/S0140-6736(19)30419-2 28. van der Heijde D Baraliakos X Sieper J Efficacy and safety of upadacitinib for active ankylosing spondylitis refractory to biological therapy: a double-blind, randomised, placebo-controlled phase 3 trial Ann Rheum Dis 2022 81 1515 1523 35788492 10.1136/ard-2022-222608 PMC9606523 van der Heijde D, Baraliakos X, Sieper J, et al. Efficacy and safety of upadacitinib for active ankylosing spondylitis refractory to biological therapy: a double-blind, randomised, placebo-controlled phase 3 trial. Ann Rheum Dis. 2022;81:1515–23. 35788492 10.1136/ard-2022-222608 PMC9606523 29. van der Heijde D Song IH Pangan AL Efficacy and safety of upadacitinib in patients with active ankylosing spondylitis (SELECT-AXIS 1): a multicentre, randomised, double-blind, placebo-controlled, phase 2/3 trial Lancet 2019 394 2108 2117 31732180 10.1016/S0140-6736(19)32534-6 van der Heijde D, Song IH, Pangan AL, et al. Efficacy and safety of upadacitinib in patients with active ankylosing spondylitis (SELECT-AXIS 1): a multicentre, randomised, double-blind, placebo-controlled, phase 2/3 trial. Lancet. 2019;394:2108–17. 31732180 10.1016/S0140-6736(19)32534-6 30. van Vollenhoven R Takeuchi T Pangan AL Efficacy and safety of upadacitinib monotherapy in methotrexate-naive patients with moderately-to-severely active rheumatoid arthritis (SELECT-EARLY): a multicenter, multi-country, randomized, double-blind, active comparator-controlled trial Arthritis Rheumatol 2020 72 1607 1620 32638504 10.1002/art.41384 PMC7589375 van Vollenhoven R, Takeuchi T, Pangan AL, et al. Efficacy and safety of upadacitinib monotherapy in methotrexate-naive patients with moderately-to-severely active rheumatoid arthritis (SELECT-EARLY): a multicenter, multi-country, randomized, double-blind, active comparator-controlled trial. Arthritis Rheumatol. 2020;72:1607–20. 32638504 10.1002/art.41384 PMC7589375 31. Vermeire S Danese S Zhou W Efficacy and safety of upadacitinib maintenance therapy for moderately to severely active ulcerative colitis in patients responding to 8 week induction therapy (U-ACHIEVE Maintenance): overall results from the randomised, placebo-controlled, double-blind, phase 3 maintenance study Lancet Gastroenterol Hepatol 2023 8 976 989 37683686 10.1016/S2468-1253(23)00208-X Vermeire S, Danese S, Zhou W, et al. Efficacy and safety of upadacitinib maintenance therapy for moderately to severely active ulcerative colitis in patients responding to 8 week induction therapy (U-ACHIEVE Maintenance): overall results from the randomised, placebo-controlled, double-blind, phase 3 maintenance study. Lancet Gastroenterol Hepatol. 2023;8:976–89. 37683686 10.1016/S2468-1253(23)00208-X 32. Woodworth T Furst DE Alten R Standardizing assessment and reporting of adverse effects in rheumatology clinical trials II: the Rheumatology Common Toxicity Criteria v.2.0 J Rheumatol 2007 34 1401 1414 17552067 Woodworth T, Furst DE, Alten R, et al. Standardizing assessment and reporting of adverse effects in rheumatology clinical trials II: the Rheumatology Common Toxicity Criteria v.2.0. J Rheumatol. 2007;34:1401–14. 17552067 33. Sunzini F McInnes I Siebert S JAK inhibitors and infections risk: focus on herpes zoster Ther Adv Musculoskelet Dis 2020 12 1759720X20936059 32655703 10.1177/1759720X20936059 PMC7328488 Sunzini F, McInnes I, Siebert S. JAK inhibitors and infections risk: focus on herpes zoster. Ther Adv Musculoskelet Dis. 2020;12:1759720X20936059. 32655703 10.1177/1759720X20936059 PMC7328488 34. Tada M Okano T Mamaoto K Comparison of creatine kinase elevation caused by Janus kinase inhibitors and interleukin-6 inhibitors in patients with rheumatoid arthritis: a propensity score-matched study Arch Rheumatol 2024 39 350 357 39507842 10.46497/ArchRheumatol.2024.10645 PMC11537686 Tada M, Okano T, Mamaoto K, et al. Comparison of creatine kinase elevation caused by Janus kinase inhibitors and interleukin-6 inhibitors in patients with rheumatoid arthritis: a propensity score-matched study. Arch Rheumatol. 2024;39:350–7. 39507842 10.46497/ArchRheumatol.2024.10645 PMC11537686 35. Manzar D Suntres E Nair N Patel Y Abu-Hilal M Elevation of creatine phosphokinase in moderate-to-severe atopic dermatitis is associated with the use of JAK inhibitors but not dupilumab: a systematic review and meta-analysis J Am Acad Dermatol 2024 91 168 169 38554937 10.1016/j.jaad.2024.03.027 Manzar D, Suntres E, Nair N, Patel Y, Abu-Hilal M. Elevation of creatine phosphokinase in moderate-to-severe atopic dermatitis is associated with the use of JAK inhibitors but not dupilumab: a systematic review and meta-analysis. J Am Acad Dermatol. 2024;91:168–9. 38554937 10.1016/j.jaad.2024.03.027 36. Falcon BTQ, de Mello Guimaraes T, Halpern GA, Gomes C, de Mello Guimaraes T. Insights into adverse events and safety profile of upadacitinib in the management of inflammatory bowel diseases—a meta-analysis of randomized controlled trials. Indian J Gastroenterol. 2025;44(2):154–62. 10.1007/s12664-024-01720-0 39921836 37. Figus FA Piga M Azzolin I McConnell R Iagnocco A Rheumatoid arthritis: extra-articular manifestations and comorbidities Autoimmun Rev 2021 20 102776 33609792 10.1016/j.autrev.2021.102776 Figus FA, Piga M, Azzolin I, McConnell R, Iagnocco A. Rheumatoid arthritis: extra-articular manifestations and comorbidities. Autoimmun Rev. 2021;20:102776. 33609792 10.1016/j.autrev.2021.102776 38. Perez-Chada LM Merola JF Comorbidities associated with psoriatic arthritis: review and update Clin Immunol 2020 214 108397 32229290 10.1016/j.clim.2020.108397 Perez-Chada LM, Merola JF. Comorbidities associated with psoriatic arthritis: review and update. Clin Immunol. 2020;214:108397. 32229290 10.1016/j.clim.2020.108397 39. Rosenbaum J Chandran V Management of comorbidities in ankylosing spondylitis Am J Med Sci 2012 343 364 366 22543539 10.1097/MAJ.0b013e3182514059 Rosenbaum J, Chandran V. Management of comorbidities in ankylosing spondylitis. Am J Med Sci. 2012;343:364–6. 22543539 10.1097/MAJ.0b013e3182514059 40. Silverberg JI Comorbidities and the impact of atopic dermatitis Ann Allergy Asthma Immunol 2019 123 144 151 31034875 10.1016/j.anai.2019.04.020 Silverberg JI. Comorbidities and the impact of atopic dermatitis. Ann Allergy Asthma Immunol. 2019;123:144–51. 31034875 10.1016/j.anai.2019.04.020 41. Barreiro-de Acosta M Molero A Artime E Epidemiological, clinical, patient-reported and economic burden of inflammatory bowel disease (ulcerative colitis and Crohn’s disease) in Spain: a systematic review Adv Ther 2023 40 1975 2014 36928496 10.1007/s12325-023-02473-6 PMC10129998 Barreiro-de Acosta M, Molero A, Artime E, et al. Epidemiological, clinical, patient-reported and economic burden of inflammatory bowel disease (ulcerative colitis and Crohn’s disease) in Spain: a systematic review. Adv Ther. 2023;40:1975–2014. 36928496 10.1007/s12325-023-02473-6 PMC10129998 42. Zhao SS Ermann J Xu C Comparison of comorbidities and treatment between ankylosing spondylitis and non-radiographic axial spondyloarthritis in the United States Rheumatology (Oxford) 2019 58 2025 2030 31081033 10.1093/rheumatology/kez171 PMC7967894 Zhao SS, Ermann J, Xu C, et al. Comparison of comorbidities and treatment between ankylosing spondylitis and non-radiographic axial spondyloarthritis in the United States. Rheumatology (Oxford). 2019;58:2025–30. 31081033 10.1093/rheumatology/kez171 PMC7967894 43. Exarchou S Di Giuseppe D Klingberg E Mortality in patients with psoriatic arthritis in Sweden: a nationwide, population-based cohort study Ann Rheum Dis 2024 83 446 456 38049985 10.1136/ard-2023-224965 Exarchou S, Di Giuseppe D, Klingberg E, et al. Mortality in patients with psoriatic arthritis in Sweden: a nationwide, population-based cohort study. Ann Rheum Dis. 2024;83:446–56. 38049985 10.1136/ard-2023-224965 44. Taylor PC, Atzeni F, Balsa A, Gossec L, Müller-Ladner U, Pope J. The key comorbidities in patients with rheumatoid arthritis: a narrative review. J Clin Med. 2021;10(3):509. 10.3390/jcm10030509 PMC7867048 33535498 45. Wollenberg A Kircik L Simpson E Pooled analysis of baricitinib tolerability in patients with atopic dermatitis in relation to acne, headache, and gastrointestinal events from 8 clinical trials Dermatitis 2023 34 308 314 36749121 10.1089/derm.2022.0027 PMC10357532 Wollenberg A, Kircik L, Simpson E, et al. Pooled analysis of baricitinib tolerability in patients with atopic dermatitis in relation to acne, headache, and gastrointestinal events from 8 clinical trials. Dermatitis. 2023;34:308–14. 36749121 10.1089/derm.2022.0027 PMC10357532 46. Simpson EL Silverberg JI Nosbaum A Integrated safety analysis of abrocitinib for the treatment of moderate-to-severe atopic dermatitis from the phase II and phase III clinical trial program Am J Clin Dermatol 2021 22 693 707 34406619 10.1007/s40257-021-00618-3 PMC8370859 Simpson EL, Silverberg JI, Nosbaum A, et al. Integrated safety analysis of abrocitinib for the treatment of moderate-to-severe atopic dermatitis from the phase II and phase III clinical trial program. Am J Clin Dermatol. 2021;22:693–707. 34406619 10.1007/s40257-021-00618-3 PMC8370859 47. Mendes-Bastos P Ladizinski B Guttman-Yassky E Characterization of acne associated with upadacitinib treatment in patients with moderate-to-severe atopic dermatitis: a post hoc integrated analysis of 3 phase 3 randomized, double-blind, placebo-controlled trials J Am Acad Dermatol 2022 87 784 791 35714786 10.1016/j.jaad.2022.06.012 Mendes-Bastos P, Ladizinski B, Guttman-Yassky E, et al. Characterization of acne associated with upadacitinib treatment in patients with moderate-to-severe atopic dermatitis: a post hoc integrated analysis of 3 phase 3 randomized, double-blind, placebo-controlled trials. J Am Acad Dermatol. 2022;87:784–91. 35714786 10.1016/j.jaad.2022.06.012 48. US Food and Drug Administration. Janus kinase (JAK) inhibitors: drug safety communication—FDA requires warnings about increased risk of serious heart-related events, cancer, blood clots, and death. https://www.fda.gov/safety/medical-product-safety-information/janus-kinase-jak-inhibitors-drug-safety-communication-fda-requires-warnings-about-increased-risk 49. European Medicines Agency. Janus kinase inhibitors (JAKi)—referral. https://www.ema.europa.eu/en/medicines/human/referrals/janus-kinase-inhibitors-jaki 50. Burmester GR, Nash P, Sands BE, et al. Adverse events of special interest in clinical trials of rheumatoid arthritis, psoriatic arthritis, ulcerative colitis and psoriasis with 37 066 patient-years of tofacitinib exposure. RMD Open. 2021;7:e001595. 10.1136/rmdopen-2021-001595 PMC8162077 34045358 51. Taylor PC Takeuchi T Burmester GR Safety of baricitinib for the treatment of rheumatoid arthritis over a median of 4.6 and up to 9.3 years of treatment: final results from long-term extension study and integrated database Ann Rheum Dis 2022 81 335 343 34706874 10.1136/annrheumdis-2021-221276 PMC8862028 Taylor PC, Takeuchi T, Burmester GR, et al. Safety of baricitinib for the treatment of rheumatoid arthritis over a median of 4.6 and up to 9.3 years of treatment: final results from long-term extension study and integrated database. Ann Rheum Dis. 2022;81:335–43. 34706874 10.1136/annrheumdis-2021-221276 PMC8862028 52. Winthrop KL Tanaka Y Takeuchi T Integrated safety analysis of filgotinib in patients with moderately to severely active rheumatoid arthritis receiving treatment over a median of 1.6 years Ann Rheum Dis 2022 81 184 192 34740884 10.1136/annrheumdis-2021-221051 PMC8762003 Winthrop KL, Tanaka Y, Takeuchi T, et al. Integrated safety analysis of filgotinib in patients with moderately to severely active rheumatoid arthritis receiving treatment over a median of 1.6 years. Ann Rheum Dis. 2022;81:184–92. 34740884 10.1136/annrheumdis-2021-221051 PMC8762003 53. Fleischmann R Curtis JR Charles-Schoeman C Safety profile of upadacitinib in patients at risk of cardiovascular disease: integrated post hoc analysis of the SELECT phase III rheumatoid arthritis clinical programme Ann Rheum Dis 2023 82 1130 1141 37308218 10.1136/ard-2023-223916 PMC10423494 Fleischmann R, Curtis JR, Charles-Schoeman C, et al. Safety profile of upadacitinib in patients at risk of cardiovascular disease: integrated post hoc analysis of the SELECT phase III rheumatoid arthritis clinical programme. Ann Rheum Dis. 2023;82:1130–41. 37308218 10.1136/ard-2023-223916 PMC10423494 54. Smolen JS Landewé RBM Bergstra SA EULAR recommendations for the management of rheumatoid arthritis with synthetic and biological disease-modifying antirheumatic drugs: 2022 update Ann Rheum Dis 2023 82 3 18 36357155 10.1136/ard-2022-223356 Smolen JS, Landewé RBM, Bergstra SA, et al. EULAR recommendations for the management of rheumatoid arthritis with synthetic and biological disease-modifying antirheumatic drugs: 2022 update. Ann Rheum Dis. 2023;82:3–18. 36357155 10.1136/ard-2022-223356 55. Charles-Schoeman C, Choy E, McInnes IB, et al. MACE and VTE across upadacitinib clinical trial programmes in rheumatoid arthritis, psoriatic arthritis and ankylosing spondylitis. RMD Open. 2023;9:e003392. 10.1136/rmdopen-2023-003392 PMC10649869 37945286 56. Samuel C Cornman H Kambala A Kwatra SG A review on the safety of using JAK inhibitors in dermatology: clinical and laboratory monitoring Dermatol Ther (Heidelb) 2023 13 729 749 36790724 10.1007/s13555-023-00892-5 PMC9930707 Samuel C, Cornman H, Kambala A, Kwatra SG. A review on the safety of using JAK inhibitors in dermatology: clinical and laboratory monitoring. Dermatol Ther (Heidelb). 2023;13:729–49. 36790724 10.1007/s13555-023-00892-5 PMC9930707 57. Furer V Rondaan C Heijstek MW 2019 update of EULAR recommendations for vaccination in adult patients with autoimmune inflammatory rheumatic diseases Ann Rheum Dis 2020 79 39 52 31413005 10.1136/annrheumdis-2019-215882 Furer V, Rondaan C, Heijstek MW, et al. 2019 update of EULAR recommendations for vaccination in adult patients with autoimmune inflammatory rheumatic diseases. Ann Rheum Dis. 2020;79:39–52. 31413005 10.1136/annrheumdis-2019-215882 58. Winthrop KL Penn SK Klaff J OP0020 Immunogenicity of an adjuvant recombinant zoster vaccine in patients with rheumatoid arthritis treated with upadacitinib: 60-week results from a randomized substudy Ann Rheum Dis 2024 83 80 81 Winthrop KL, Penn SK, Klaff J, et al. OP0020 Immunogenicity of an adjuvant recombinant zoster vaccine in patients with rheumatoid arthritis treated with upadacitinib: 60-week results from a randomized substudy. Ann Rheum Dis. 2024;83:80–1. 59. Rubbert-Roth A Kakehasi AM Takeuchi T Malignancy in the upadacitinib clinical trials for rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondyloarthritis Rheumatol Ther 2024 11 97 112 37982966 10.1007/s40744-023-00621-6 PMC10796874 Rubbert-Roth A, Kakehasi AM, Takeuchi T, et al. Malignancy in the upadacitinib clinical trials for rheumatoid arthritis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondyloarthritis. Rheumatol Ther. 2024;11:97–112. 37982966 10.1007/s40744-023-00621-6 PMC10796874 60. Simpson EL Silverberg JI Nosbaum A Integrated safety update of abrocitinib in 3802 patients with moderate-to-severe atopic dermatitis: data from more than 5200 patient-years with up to 4 years of exposure Am J Clin Dermatol 2024 25 639 654 38888681 10.1007/s40257-024-00869-w PMC11193687 Simpson EL, Silverberg JI, Nosbaum A, et al. Integrated safety update of abrocitinib in 3802 patients with moderate-to-severe atopic dermatitis: data from more than 5200 patient-years with up to 4 years of exposure. Am J Clin Dermatol. 2024;25:639–54. 38888681 10.1007/s40257-024-00869-w PMC11193687 61. Burmester GR Gottenberg JE Caporali R Integrated safety analysis of filgotinib in patients with moderate-to-severe rheumatoid arthritis over a treatment duration of up to 8.3 years Ann Rheum Dis 2024 83 1110 1117 38782549 10.1136/ard-2024-225759 PMC11883750 Burmester GR, Gottenberg JE, Caporali R, et al. Integrated safety analysis of filgotinib in patients with moderate-to-severe rheumatoid arthritis over a treatment duration of up to 8.3 years. Ann Rheum Dis. 2024;83:1110–7. 38782549 10.1136/ard-2024-225759 PMC11883750 62. Khan N Vallarino C Lissoos T Darr U Luo M Risk of malignancy in a nationwide cohort of elderly inflammatory bowel disease patients Drugs Aging 2017 34 859 868 29170864 10.1007/s40266-017-0498-y PMC5705754 Khan N, Vallarino C, Lissoos T, Darr U, Luo M. Risk of malignancy in a nationwide cohort of elderly inflammatory bowel disease patients. Drugs Aging. 2017;34:859–68. 29170864 10.1007/s40266-017-0498-y PMC5705754 63. Li Z, Wang Y, Wu Y, et al. Real-world efficacy and safety of abrocitinib in Chinese atopic dermatitis patients: a single-center prospective study. Allergy. 2025;80(5):1417–27. 10.1111/all.16495 39927851 64. Nogami A Asonuma K Okabayashi S Real-world comparative effectiveness and safety of filgotinib and upadacitinib for ulcerative colitis: a multicentre cohort study United Eur Gastroenterol J 2024 12 1357 1366 10.1002/ueg2.12704 PMC11652322 39535492 Nogami A, Asonuma K, Okabayashi S, et al. Real-world comparative effectiveness and safety of filgotinib and upadacitinib for ulcerative colitis: a multicentre cohort study. United Eur Gastroenterol J. 2024;12:1357–66. 10.1002/ueg2.12704 PMC11652322 39535492 65. Patruno C Lauletta G Pezzolo E Effectiveness and safety of upadacitinib for adolescents with atopic dermatitis in a real-world setting Clin Drug Investig 2024 44 629 634 39012535 10.1007/s40261-024-01382-y Patruno C, Lauletta G, Pezzolo E, et al. Effectiveness and safety of upadacitinib for adolescents with atopic dermatitis in a real-world setting. Clin Drug Investig. 2024;44:629–34. 39012535 10.1007/s40261-024-01382-y 66. Taxonera C Olivares D Alba C Real-world effectiveness and safety of tofacitinib in patients with ulcerative colitis: systematic review with meta-analysis Inflamm Bowel Dis 2022 28 32 40 33586766 10.1093/ibd/izab011 Taxonera C, Olivares D, Alba C. Real-world effectiveness and safety of tofacitinib in patients with ulcerative colitis: systematic review with meta-analysis. Inflamm Bowel Dis. 2022;28:32–40. 33586766 10.1093/ibd/izab011 67. Iwamoto N Sato S Kurushima S Real-world comparative effectiveness and safety of tofacitinib and baricitinib in patients with rheumatoid arthritis Arthritis Res Ther 2021 23 197 34301311 10.1186/s13075-021-02582-z PMC8299678 Iwamoto N, Sato S, Kurushima S, et al. Real-world comparative effectiveness and safety of tofacitinib and baricitinib in patients with rheumatoid arthritis. Arthritis Res Ther. 2021;23:197. 34301311 10.1186/s13075-021-02582-z PMC8299678 68. XELJANZ (tofacitinib). Prescribing information. Pfizer Inc.; 2024. http://labeling.pfizer.com/showlabeling.aspx?id=959 69. OLUMIANT (baricitinib). Prescribing information. Eli Lilly and Company; 2022. https://uspl.lilly.com/olumiant/olumiant.html#pi 70. CIBINQO (abrocitinib). Prescribing information. Pfizer Inc; 2023. https://labeling.pfizer.com/ShowLabeling.aspx?id=16652 71. JYSELECA (filgotinib). Summary of Product Characteristics. Alfasigma S.p.A.; 2024. https://www.ema.europa.eu/en/documents/product-information/jyseleca-epar-product-information_en.pdf ",
  "metadata": {
    "Title of this paper": "Real-world comparative effectiveness and safety of tofacitinib and baricitinib in patients with rheumatoid arthritis",
    "Journal it was published in:": "Advances in Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474609/"
  }
}