{
  "title": "Paper_841",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472567 PMC12472567.1 12472567 12472567 41010451 10.3390/nu17182925 nutrients-17-02925 1 Review The Microecological-Immune Axis in Pediatric Allergic Diseases: Imbalance Mechanisms and Regulatory Interventions Jiang Ziyi Zhu Jie Shen Zhicheng Gao Linglin Chen Zihan Zhang Li https://orcid.org/0000-0001-7420-8646 Wang Qiang * Pastor-Vargas Carlos Academic Editor Institute of Infection, Immunology and Tumor Microenvironment, Hubei Province Key Laboratory of Occupational Hazard Identification and Control, Medical College, Wuhan University of Science and Technology, Wuhan 430065, China; 18694017286@163.com 17703698702@163.com * wangqiang@wust.edu.cn 11 9 2025 9 2025 17 18 497660 2925 09 8 2025 06 9 2025 09 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ In recent years, the global prevalence of pediatric allergic diseases—including atopic dermatitis, allergic rhinitis, and asthma—has increased significantly. Accumulating evidence underscores the pivotal role of the microbiota–immune axis in the regulation of immune tolerance, wherein microbial dysbiosis is a critical driver in the onset and progression of these conditions. Notably, reduced microbial diversity and imbalanced proportions can also cause immune dysregulation and cross-organ signaling. The skin–lung–gut axis has emerged as a key conduit for multi-organ immune communication. Microbial communities at barrier sites not only mediate local immune homeostasis but also influence distant organs through metabolite production and immune signaling pathways, forming a complex network of organ crosstalk. This mechanism is integral to the maintenance of both innate (e.g., epithelial barrier integrity and phagocytic activity) and adaptive (e.g., the Type 1/Type 2 cytokine balance and regulatory T cell function) immunity, thereby suppressing allergic inflammation. Early microbial colonization is crucial for immune system maturation, and its perturbation is strongly linked to abnormal allergic immune responses. As such, the skin–lung–gut axis functions as a cross-organ microecological–immune regulatory network that is particularly relevant in the context of infantile allergic disorders. Intervention strategies targeting the microbiota—including probiotics, prebiotics, synbiotics, and postbiotics—have demonstrated potential in modulating host immunity. Furthermore, emerging approaches such as engineered probiotics, advanced delivery systems, and fecal microbiota transplantation (FMT) offer promising therapeutic avenues. This review provides a comprehensive overview of microbiota development in early life, its association with allergic disease pathogenesis, and the current progress in microbiota-targeted interventions, offering a theoretical foundation for individualized prevention and treatment strategies. allergic diseases children microbiota-immune crosstalk microbiota modulators skin–lung–gut axis the program for the Wuhan Yaxin General Hospital Scientific Research and Innovation Fund Key Projects 2025KYCX1-A04 the Wuhan Wuchang Hospital Scientific Research and Innovation Fund Key Projects WCYY2022K02 This research was funded by the program for the Wuhan Yaxin General Hospital Scientific Research and Innovation Fund Key Projects (2025KYCX1-A04) and the Wuhan Wuchang Hospital Scientific Research and Innovation Fund Key Projects (WCYY2022K02). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In recent years, the prevalence of allergic diseases has risen sharply, emerging as a major global public health concern. According to the World Allergy Organization, approximately 30–40% of the global population is affected, with particularly high incidence rates observed among children in industrialized countries [ 1 2 Figure 1 3 4 5 6 7 8 9 10 Recent research has highlighted the intricate interplay between the microbiota and the immune system across the skin, lungs, and gut, which are collectively referred to as the skin–lung–gut axis. This axis facilitates cross-organ immune regulation through both microbial metabolites, such as short-chain fatty acids (SCFAs), and immunoregulatory mediators, including IL-10 and transforming growth factor-β (TGF-β). Local microbial communities not only shape immune responses at their respective sites but also exert systemic effects. For example, gut microbiota modulate pulmonary inflammation via the gut–lung axis, whereas links between gut and skin microbiota point to a shared pathogenic mechanism in atopic dermatitis [ 11 These insights have positioned microbiota-targeted therapies as a rapidly expanding area of investigation. Conventional strategies—including probiotics, prebiotics, synbiotics, and postbiotics—aim to restore microbial homeostasis by strengthening mucosal barriers, regulating host metabolism, and suppressing pathogenic organisms. In parallel, emerging approaches such as FMT, engineered probiotic strains, and advanced cell–probiotic delivery systems have shown promise for re-establishing immune equilibrium. Through the multi-level modulation of host–microbe interactions, these interventions represent novel and potentially transformative strategies for the management of allergic diseases associated with microbial dysbiosis. This review provides a comprehensive summary of early-life microbial colonization along the skin–lung–gut axis, its critical role in immune maturation, and recent advances in microbiota-based preventive and therapeutic approaches for allergic diseases. 2. Gut Microbiota Development and the Risk of Allergic Diseases 2.1. Prenatal Period Recent studies have illuminated the early colonization of the gut microbiota, thereby challenging the long-standing “sterile womb” hypothesis, which posits that fetuses are devoid of microbes until birth [ 12 13 14 15 16 FOXP3 FOXP3 17 18 19 2.2. Mode of Delivery The delivery process significantly influences the microbial composition found in infants, with different delivery modes leading to distinct infant microbiota [ 20 Figure 2 21 22 Bacteroides Bifidobacterium Lactobacillus 23 Staphylococcus Streptococcus Clostridium 24 25 Bifidobacterium 26 Lactobacillus 27 2.3. After Birth Multiple factors shape the development of the infant gut microbiota, including feeding practices, medication exposure, and the timing of introducing allergenic foods. Among these, feeding practices exert a particularly direct influence on early microbial colonization and the maturation of the immune system [ 28 29 30 31 Fusobacterium nucleatum Streptococcus anginosus 32 33 34 35 36 37 3. Skin–Lung–Gut Axis Microbiota 3.1. Interaction Between the Skin Microbiota and Lung Microbiota As microbiota research advances, accumulating evidence suggests that the skin and lungs—previously considered distinct barrier systems—interact through their respective microbial communities. Under physiological conditions, the skin maintains its microbiota through the stratum corneum and sebum [ 38 39 Staphylococcus aureus Propionibacterium acnes 40 Eikenella corrodens 41 Two primary mechanisms are thought to underpin this cross-site microbial interaction. First, respiratory infections such as influenza or respiratory syncytial virus (RSV) can compromise mucosal defenses, facilitating the migration of skin-derived microbes. Second, chronic dermatological conditions like atopic dermatitis can stimulate the release of systemic immune mediators—such as IL-33 and IL-36 [ 42 This evolving understanding has prompted the development of innovative strategies aimed at modulating the skin or lung microbiota to reduce systemic inflammation. Such approaches include reinforcing the skin barrier with topical probiotics, stabilizing the pulmonary microbiota through inhaled microbial formulations, and implementing adjunctive measures such as ceramide-based barrier repairs or enhanced oral hygiene to minimize microbial transmission [ 43 Figure 3 3.2. Interactions Between the Skin Microbiota and the Gut Microbiota The skin and gut represent the body’s largest external and internal barrier systems, respectively, each hosting diverse and dynamic microbial communities [ 44 45 46 47 The gut microbiota contributes to skin health by producing bioactive signaling molecules, such as SCFAs (e.g., butyrate and propionate) and tryptophan metabolites, which are known to regulate immune tolerance and inflammatory processes [ 48 49 50 51 52 These interconnections suggest that targeting the gut microbiota represents a promising therapeutic approach for managing skin disorders. Interventions such as probiotics (e.g., Bifidobacterium Lactobacillus 53 The clinical integration of the “skin–gut axis” concept is gaining traction, offering comprehensive strategies for managing inflammatory skin conditions such as atopic dermatitis, acne, psoriasis, and rosacea. Oral probiotic supplementation has demonstrated benefits for children with eczema, while gut microbiota profiling now supports personalized dietary interventions and microbiota restoration therapies in psoriasis patients. In high-risk groups, such as immunocompromised individuals, modulating the gut microbiota may reduce colonization by opportunistic pathogens and may subsequently lower the incidence of secondary skin infections. However, careful risk assessment is essential: while low-risk individuals may be suitable candidates for synbiotic therapy, its use is strictly contraindicated in vulnerable populations such as infants with severe combined immunodeficiency (SCID) issues [ 54 3.3. Interactions Between the Lung Microbiota and the Gut Microbiota Although anatomically distinct, the lungs and intestines function in concert to sustain a complex and dynamically regulated microbial ecosystem. The concept of the gut–lung axis has gained increasing empirical support, emphasizing the critical role of the gut microbiota in maintaining pulmonary immune homeostasis and modulating susceptibility to respiratory diseases. Furthermore, the immune status and microbial composition of the lungs can reciprocally influence gastrointestinal physiology, forming a bidirectional regulatory network that is mediated by microbiota-derived signals [ 55 Gut microbes affect lung immunity through several mechanisms, including the production of SCFAs, bile acid metabolites, microbial toxins, and the activation of pattern recognition receptors such as Toll-like receptors (TLRs) [ 56 57 58 Firmicutes Bacteroidetes 59 Roseburia Lachnospira 60 Faecalibacterium prausnitzii Eubacterium rectale Clostridium hathewayi Ruminococcus 61 62 63 Conversely, the lung and oral microbiota can influence the gut microbiota through both mechanical and physiological routes [ 64 Porphyromonas gingivalis P. gingivalis Fusobacterium nucleatum 65 66 67 68 69 70 Klebsiella pneumoniae P. gingivalis 71 Mycoplasma pneumoniae 72 Within this framework, the therapeutic modulation of the gut microbiota is emerging as a strategy to enhance respiratory health. For instance, isovaleric acid—a gut-derived metabolite—has been shown to mitigate H9N2 influenza virus-induced pulmonary infection, illustrating the antiviral potential of microbial metabolites [ 73 Acinetobacter lwoffii 74 Klebsiella pneumoniae 75 P. gingivalis + 76 77 Lactobacillus rhamnosus GG 78 With advances in metagenomics, metabolomics, and immunomics, future research is well-positioned to dissect the molecular circuits that underlie gut–lung communication in greater detail. Such efforts are expected to yield novel biomarkers and therapeutic targets for the early detection, stratification, and individualized treatment of respiratory diseases. More broadly, integrative therapeutic strategies addressing the gut–lung axis and other inter-organ microbial networks may reshape the prevention of and management paradigms for chronic inflammatory conditions. 4. The Immune Crosstalk Mechanism of the Skin–Lung–Gut Axis Microbiota in Allergic Diseases The regulatory role of the microbiota in various systemic diseases has garnered growing attention. Of particular interest is its involvement in allergic disorders, whereby the interconnected microbial networks of the skin, lungs, and gut—collectively referred to as the “skin–lung–gut axis”—have become a central focus of current research [ 79 80 Immune crosstalk within the skin–lung–gut axis operates through multiple layers of regulation. A key driver is the systemic impact of microbial dysbiosis and its associated metabolites. Studies consistently demonstrate that individuals with atopic dermatitis exhibit markedly reduced gut microbial diversity, particularly with the significant depletion of beneficial genera such as Bifidobacterium Lactobacillus 81 82 83 Another central mechanism involves chemokine-mediated immune cell migration across organ systems, establishing immunological continuity between otherwise distant tissues. In murine models of food allergy, intestinal allergen exposure prompts the epithelial cells to secrete chemokines such as CCL20 [ 84 85 86 A further regulatory layer is provided by the systemic effects of microbial metabolites, which exert influence through circulatory dissemination. For instance, oral administration of ginsenoside F2 has been shown to alleviate skin inflammation in atopic dermatitis mouse models [ 87 Bacteroides Lactobacillus Together, these findings delineate a complex, dynamic, and interdependent regulatory network that interlinks the skin, lungs, and gut. Disruption of this network may drive the onset and progression of multi-organ allergic diseases. Therefore, unraveling the mechanisms of immune crosstalk within the skin–lung–gut axis not only advances our understanding of allergic pathophysiology but also lays the foundation for integrated microbiota-based therapeutic strategies aimed at systemic allergy modulation. 5. The Role of Common Microecological Regulators in the Treatment of Allergic Diseases 5.1. Probiotics Probiotics have recently garnered increasing interest as a promising therapeutic strategy for allergic diseases. Defined by the World Health Organization as live microorganisms that confer health benefits when administered in adequate amounts, probiotics exert their effects through multiple immune-regulatory and microbiota-modulating mechanisms [ 88 89 90 91 ALDH1A1 A variety of probiotic strains have demonstrated anti-allergic effects in both preclinical and clinical settings. Lactobacillus rhamnosus 92 Lactobacillus plantarum DPUL-F232 93 Bifidobacterium 94 Bifidobacterium strain 35624 + + 95 L. rhamnosus GG 96 L. paracasei AH2 97 In summary, probiotics offer a multifactorial and biologically plausible approach for the management of allergic diseases. By modulating gut microbiota composition, enhancing mucosal barrier function, restoring immune tolerance, and attenuating systemic inflammation, probiotics present the potential to reduce pharmacological dependency and improve overall quality of life for patients ( Figure 4 5.2. Prebiotics Prebiotics are a class of substances that are selectively utilized by host microbiota to confer health benefits, with their primary function being the regulation of intestinal microecological balance. Unlike probiotics, which involve the direct administration of beneficial microorganisms, prebiotics provide fermentable substrates that promote the proliferation and metabolic activity of specific commensal microbiota, such as Bifidobacterium Lactobacillus 98 99 Prebiotics exert their effects through both indirect and direct mechanisms. Indirectly, they serve as fermentable substrates for targeted microbial taxa, leading to the production of SCFAs, including acetate, propionate, and butyrate [ 100 101 ALDH1A1 102 103 104 The therapeutic potential of prebiotics for preventing and managing allergic diseases is increasingly supported by empirical evidence. Inulin supplementation, for example, has been shown to significantly increase the abundance of Bifidobacterium Lactobacillus Clostridium difficile 105 106 5.3. Synbiotics As research has progressed, the concept of “synbiotics” has emerged—referring to the synergistic combination of probiotics and prebiotics, which interact through complementary mechanisms to enhance host health outcomes. In 2019, the International Scientific Association for Probiotics and Prebiotics (ISAPP) redefined synbiotics as “a mixture comprising live microorganisms and substrates selectively utilized by host microorganisms that confers a health benefit on the host” [ 107 108 109 110 Anaerostipes caccae + + Clinical studies have further reinforced the therapeutic promise of synbiotics in allergic disorders. In one investigation, synbiotic supplementation effectively suppressed Type 2 immune responses induced by grass pollen extract (GPE) in peripheral blood mononuclear cells (PBMCs) derived from allergic patients [ 111 5.4. Postbiotics Beyond probiotics, prebiotics, and synbiotics, postbiotics have emerged as a promising new category of interventions that are receiving increasing attention. Defined by Tsilingiri et al. as non-viable microbial products or metabolic byproducts that confer health benefits, postbiotics deliver effects that are comparable to those of probiotics without the inclusion of live microorganisms [ 112 113 114 Streptococcus pneumoniae Haemophilus influenzae Moraxella catarrhalis Streptococcus pyogenes Streptococcus viridans Staphylococcus aureus Klebsiella pneumoniae Klebsiella oxytoca 115 p 116 117 6. Discussion Microbiota also hold significant therapeutic potential in other disease areas, particularly within innovative strategies aimed at restoring intestinal microbiota homeostasis. A noteworthy example is FMT, a novel therapeutic intervention designed to reestablish the gut microbial balance. FMT has shown promising outcomes in conditions such as IBD and Parkinson’s disease (PD) [ 118 119 120 121 Escherichia coli Nissle 1917 ECN 122 In parallel, engineered probiotics are emerging at the intersection of synthetic biology and materials science. Techniques such as CRISPR/dCas9 123 124 Moreover, targeted screening platforms for assessing the heterogeneity of influenza virus infections have identified specific gut microbial strains and metabolites with strong antiviral properties. Although these emerging microbiota-based therapies have not yet been fully evaluated in allergic disease models, their established roles in immune modulation, inflammation reduction, and microbial ecosystem restructuring suggest meaningful translational potential in allergic contexts. Another promising avenue involves the interplay between tryptophan (Trp) metabolism and the gut microbiota [ 125 126 Vaccination remains a cornerstone in the prevention and control of respiratory infections. A large-scale, multicenter, double-blind Phase III clinical trial conducted across 18 countries demonstrated that maternal immunization with the RSVpreF vaccine significantly prevented severe lower respiratory tract infections (LRTIs) caused by respiratory syncytial virus (RSV) in infants [ 127 128 129 Correcting gut microbiota dysbiosis may, thus, become a cornerstone strategy in precision medicine, optimizing immune responses to both pathogens and vaccines, and paving the way for personalized preventive interventions. With growing insights into host–microbiota interactions, the “skin–lung–gut axis” has gained traction as a therapeutic target in allergic disease management. This interconnected mucosal immune network is orchestrated via microbial metabolites (e.g., SCFAs), cytokine signaling, and neuroendocrine pathways. Precision modulation through microbiota-targeted therapies may allow for the concurrent restoration of immune balance and microbial homeostasis across multiple organ systems. Both clinical and preclinical studies support this concept. For example, a clinical trial in patients with enteric dermatologic conditions found that the oral administration of E. coli Nissle 130 Lactobacillus acidophilus TW01 131 Lactobacillus rhamnosus GG 132 7. Conclusions While selected probiotics have demonstrated clinical benefits, further studies are required to define the optimal strains, dosages, and treatment timelines. The use of unverified probiotics with no documented efficacy should be discouraged [ 133 In conclusion, the strategic modulation of the skin–lung–gut axis through tailored delivery systems and functional microbiota engineering offers organ-specific and pathway-specific treatment opportunities. This emerging paradigm enhances therapeutic precision and safety, enabling cross-organ immune regulation for allergic diseases, IBD, and respiratory immune disorders. Future integration of host microbiota profiles, immune phenotypes, and clinical signatures may ultimately enable the realization of fully personalized microbiota-based medicine. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Z.J. and J.Z.; writing—original draft preparation, Z.J.; writing—review and editing, Z.J. and J.Z.; supervision, Z.S., L.G., Z.C., and L.Z.; funding acquisition, Q.W. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflict of interest. References 1. Pawankar R. Canonica G.W. Holgate S.T. Lockey R.F. Blaiss M. The WAO White Book on Allergy (Update 2013) WAO Milwaukee, WI, USA 2013 2. Yao Y. Chen C.L. Yu D. Liu Z. Roles of follicular helper and regulatory T cells in allergic diseases and allergen immunotherapy Allergy 2021 76 456 470 10.1111/all.14639 33098663 3. Warren C.M. Jiang J. Gupta R.S. Epidemiology and Burden of Food Allergy Curr. Allergy Asthma Rep. 2020 20 6 10.1007/s11882-020-0898-7 32067114 PMC7883751 4. Afaa T.J. Afrane A.K. Etwire V. Gastrointestinal food allergy in Ghanaian children: A case series Ghana Med. J. 2017 51 138 142 10.4314/gmj.v51i3.7 29622825 PMC5870227 5. Potaczek D.P. Kabesch M. Current concepts of IgE regulation and impact of genetic determinants Clin. Exp. Allergy 2012 42 852 871 10.1111/j.1365-2222.2011.03953.x 22909159 6. Hellman L. Regulation of IgE homeostasis, and the identification of potential targets for therapeutic intervention Biomed. Pharmacother. 2007 61 34 49 10.1016/j.biopha.2006.10.001 17145160 7. Palomares Ó. Sánchez-Ramón S. Dávila I. Prieto L. Pérez de Llano L. Lleonart M. Domingo C. Nieto A. dIvergEnt: How IgE Axis Contributes to the Continuum of Allergic Asthma and Anti-IgE Therapies Int. J. Mol. Sci. 2017 18 1328 10.3390/ijms18061328 28635659 PMC5486149 8. Wu B.B. Yang Y. Xu X. Wang W.P. Effects of Bifidobacterium supplementation on intestinal microbiota composition and the immune response in healthy infants World J. Pediatr. 2016 12 177 182 10.1007/s12519-015-0025-3 25846071 9. Pfefferle P.I. Keber C.U. Cohen R.M. Garn H. The Hygiene Hypothesis—Learning From but Not Living in the Past Front. Immunol. 2021 12 635935 10.3389/fimmu.2021.635935 33796103 PMC8007786 10. von Mutius E. The “Hygiene Hypothesis” and the Lessons Learnt From Farm Studies Front. Immunol. 2021 12 635522 10.3389/fimmu.2021.635522 33868259 PMC8044987 11. Tuniyazi M. Li S. Hu X. Fu Y. Zhang N. The Role of Early Life Microbiota Composition in the Development of Allergic Diseases Microorganisms 2022 10 1190 10.3390/microorganisms10061190 35744708 PMC9227185 12. Campisciano G. Zanotta N. Quadrifoglio M. Careri A. Torresani A. Cason C. De Seta F. Ricci G. Comar M. Stampalija T. The Bacterial DNA Profiling of Chorionic Villi and Amniotic Fluids Reveals Overlaps with Maternal Oral, Vaginal, and Gut Microbiomes Int. J. Mol. Sci. 2023 24 2873 10.3390/ijms24032873 36769194 PMC9917689 13. Walker R.W. Clemente J.C. Peter I. Loos R.J.F. The prenatal gut microbiome: Are we colonized with bacteria in utero? Pediatr. Obes. 2017 12 (Suppl. S1) 3 17 10.1111/ijpo.12217 28447406 PMC5583026 14. Ege M.J. Bieli C. Frei R. van Strien R.T. Riedler J. Ublagger E. Schram-Bijkerk D. Brunekreef B. van Hage M. Scheynius A. Prenatal farm exposure is related to the expression of receptors of the innate immunity and to atopic sensitization in school-age children J. Allergy Clin. Immunol. 2006 117 817 823 10.1016/j.jaci.2005.12.1307 16630939 15. Lin X. Ren X. Xiao X. Yang Z. Yao S. Wong G.W. Liu Z. Wang C. Su Z. Li J. Important Role of Immunological Responses to Environmental Exposure in the Development of Allergic Asthma Allergy Asthma Immunol. Res. 2020 12 934 948 10.4168/aair.2020.12.6.934 32935487 PMC7492518 16. Acevedo N. Alashkar Alhamwe B. Caraballo L. Ding M. Ferrante A. Garn H. Garssen J. Hii C.S. Irvine J. Llinás-Caballero K. Perinatal and Early-Life Nutrition, Epigenetics, and Allergy Nutrients 2021 13 724 10.3390/nu13030724 33668787 PMC7996340 17. van Esch B. Porbahaie M. Abbring S. Garssen J. Potaczek D.P. Savelkoul H.F.J. van Neerven R.J.J. The Impact of Milk and Its Components on Epigenetic Programming of Immune Function in Early Life and Beyond: Implications for Allergy and Asthma Front. Immunol. 2020 11 2141 10.3389/fimmu.2020.02141 33193294 PMC7641638 18. Furusawa Y. Obata Y. Fukuda S. Endo T.A. Nakato G. Takahashi D. Nakanishi Y. Uetake C. Kato K. Kato T. Commensal microbe-derived butyrate induces the differentiation of colonic regulatory T cells Nature 2013 504 446 450 10.1038/nature12721 24226770 19. Hu M. Alashkar Alhamwe B. Santner-Nanan B. Miethe S. Harb H. Renz H. Potaczek D.P. Nanan R.K. Short-Chain Fatty Acids Augment Differentiation and Function of Human Induced Regulatory T Cells Int. J. Mol. Sci. 2022 23 5740 10.3390/ijms23105740 35628549 PMC9143307 20. Liu Y. Qin S. Song Y. Feng Y. Lv N. Xue Y. Liu F. Wang S. Zhu B. Ma J. The Perturbation of Infant Gut Microbiota Caused by Cesarean Delivery Is Partially Restored by Exclusive Breastfeeding Front. Microbiol. 2019 10 598 10.3389/fmicb.2019.00598 30972048 PMC6443713 21. Fonseca W. Lukacs N.W. Ptaschinski C. Factors Affecting the Immunity to Respiratory Syncytial Virus: From Epigenetics to Microbiome Front. Immunol. 2018 9 226 10.3389/fimmu.2018.00226 29515570 PMC5825926 22. Moya-Pérez A. Luczynski P. Renes I.B. Wang S. Borre Y. Anthony Ryan C. Knol J. Stanton C. Dinan T.G. Cryan J.F. Intervention strategies for cesarean section-induced alterations in the microbiota-gut-brain axis Nutr. Rev. 2017 75 225 240 10.1093/nutrit/nuw069 28379454 PMC5410982 23. Dominguez-Bello M.G. Costello E.K. Contreras M. Magris M. Hidalgo G. Fierer N. Knight R. Delivery mode shapes the acquisition and structure of the initial microbiota across multiple body habitats in newborns Proc. Natl. Acad. Sci. USA 2010 107 11971 11975 10.1073/pnas.1002601107 20566857 PMC2900693 24. Coelho G.D.P. Ayres L.F.A. Barreto D.S. Henriques B.D. Prado M. Passos C.M.D. Acquisition of microbiota according to the type of birth: An integrative review Rev. Lat. Am. Enferm. 2021 29 e3446 10.1590/1518.8345.4466.3446 PMC8294792 34287544 25. Nunez H. Nieto P.A. Mars R.A. Ghavami M. Sew Hoy C. Sukhum K. Early life gut microbiome and its impact on childhood health and chronic conditions Gut Microbes 2025 17 2463567 10.1080/19490976.2025.2463567 39916516 PMC11810090 26. Yang S. Cai J. Su Q. Li Q. Meng X. Human milk oligosaccharides combine with Bifidobacterium longum to form the “golden shield” of the infant intestine: Metabolic strategies, health effects, and mechanisms of action Gut Microbes 2024 16 2430418 10.1080/19490976.2024.2430418 39572856 PMC11587862 27. Steiner N.C. Lorentz A. Probiotic Potential of Lactobacillus Species in Allergic Rhinitis Int. Arch. Allergy Immunol. 2021 182 807 818 10.1159/000515352 33882482 28. Wu W. Zhang J. Silva Zolezzi I. Fries L.R. Zhao A. Factors influencing breastfeeding practices in China: A meta-aggregation of qualitative studies Matern. Child. Nutr. 2021 17 e13251 10.1111/mcn.13251 34355869 PMC8476444 29. Coker M.O. Laue H.E. Hoen A.G. Hilliard M. Dade E. Li Z. Palys T. Morrison H.G. Baker E. Karagas M.R. Infant Feeding Alters the Longitudinal Impact of Birth Mode on the Development of the Gut Microbiota in the First Year of Life Front. Microbiol. 2021 12 642197 10.3389/fmicb.2021.642197 33897650 PMC8059768 30. Williams J.E. Carrothers J.M. Lackey K.A. Beatty N.F. Brooker S.L. Peterson H.K. Steinkamp K.M. York M.A. Shafii B. Price W.J. Strong Multivariate Relations Exist Among Milk, Oral, and Fecal Microbiomes in Mother-Infant Dyads During the First Six Months Postpartum J. Nutr. 2019 149 902 914 10.1093/jn/nxy299 31063198 PMC6543206 31. Bégin F. Arts M. White J. Clark D. Sint T.T. Taqi I. Holland D. From the First Hour of Life UNICEF New York, NY, USA 2016 Available online: https://www.unicef.org/media/49801/file/From-the-first-hour-of-life-ENG (accessed on 9 August 2025) 32. Schmiechen Z.C. Weissler K.A. Frischmeyer-Guerrerio P.A. Recent developments in understanding the mechanisms of food allergy Curr. Opin. Pediatr. 2019 31 807 814 10.1097/MOP.0000000000000806 31693591 PMC6993896 33. Zhu J. Sun C. Li M. Hu G. Zhao X.M. Chen W.H. Compared to histamine-2 receptor antagonist, proton pump inhibitor induces stronger oral-to-gut microbial transmission and gut microbiome alterations: A randomised controlled trial Gut 2024 73 1087 1097 10.1136/gutjnl-2023-330168 38050061 PMC11187400 34. Kim J.H. Min J.H. Jo Y.W. Kwon J.W. Her Y. Association between acid-suppressive drugs and risk of psoriasis: Retrospective study using Korean National Health Insurance Service-National Sample Cohort Korean J. Intern. Med. 2025 40 57 64 10.3904/kjim.2024.096 39778526 PMC11725478 35. Jones-Nelson O. Tovchigrechko A. Glover M.S. Fernandes F. Rangaswamy U. Liu H. Tabor D.E. Boyd J. Warrener P. Martinez J. Antibacterial Monoclonal Antibodies Do Not Disrupt the Intestinal Microbiome or Its Function Antimicrob. Agents Chemother. 2020 64 e02347-19 10.1128/AAC.02347-19 32152087 PMC7179586 36. Aldars-García L. Marin A.C. Chaparro M. Gisbert J.P. The Interplay between Immune System and Microbiota in Inflammatory Bowel Disease: A Narrative Review Int. J. Mol. Sci. 2021 22 3076 10.3390/ijms22063076 33802883 PMC8002696 37. Pierau M. Arra A. Brunner-Weinzierl M.C. Preventing Atopic Diseases During Childhood—Early Exposure Matters Front. Immunol. 2021 12 617731 10.3389/fimmu.2021.617731 33717110 PMC7946845 38. Nicolaou A. Kendall A.C. Bioactive lipids in the skin barrier mediate its functionality in health and disease Pharmacol. Ther. 2024 260 108681 10.1016/j.pharmthera.2024.108681 38897295 39. Adivitiya Kaushik M.S. Chakraborty S. Veleri S. Kateriya S. Mucociliary Respiratory Epithelium Integrity in Molecular Defense and Susceptibility to Pulmonary Viral Infections Biology 2021 10 95 10.3390/biology10020095 33572760 PMC7911113 40. Morell E.A. Balkin D.M. Methicillin-resistant Staphylococcus aureus: A pervasive pathogen highlights the need for new antimicrobial development Yale J. Biol. Med. 2010 83 223 233 21165342 PMC3002151 41. Melton K.S. DeRosa D.C. Agee W.A. 3rd Pires V.L. Yim D.G. Ngauy V. Mouth in Foot Disease Hawaii J. Med. Public Health 2015 74 30 32 26793413 PMC4582370 42. Borek F. Nagashima S. Villalobos W.R. Gmyterco V.C. Sell T. de Farias M.R. Bechara G.H. Immunoexpression of IL-33 in the different clinical aspects of canine atopic dermatitis Vet. Immunol. Immunopathol. 2024 273 110786 10.1016/j.vetimm.2024.110786 38824908 43. Fujii M. The Pathogenic and Therapeutic Implications of Ceramide Abnormalities in Atopic Dermatitis Cells 2021 10 2386 10.3390/cells10092386 34572035 PMC8468445 44. Wang X. Cheng L. Liu Y. Zhang R. Wu Z. Weng P. Zhang P. Zhang X. Polysaccharide Regulation of Intestinal Flora: A Viable Approach to Maintaining Normal Cognitive Performance and Treating Depression Front. Microbiol. 2022 13 807076 10.3389/fmicb.2022.807076 35369451 PMC8966502 45. Jain A. Meshram R.J. Lohiya S. Patel A. Kaplish D. Exploring the Microbial Landscape of Neonatal Skin Flora: A Comprehensive Review Cureus 2024 16 e52972 10.7759/cureus.52972 38406113 PMC10894447 46. Mahmud M.R. Akter S. Tamanna S.K. Mazumder L. Esti I.Z. Banerjee S. Akter S. Hasan M.R. Acharjee M. Hossain M.S. Impact of gut microbiome on skin health: Gut-skin axis observed through the lenses of therapeutics and skin diseases Gut Microbes 2022 14 2096995 10.1080/19490976.2022.2096995 35866234 PMC9311318 47. Qu B. Zhang X.E. Feng H. Yan B. Bai Y. Liu S. He Y. Microbial perspective on the skin-gut axis and atopic dermatitis Open Life Sci. 2024 19 20220782 10.1515/biol-2022-0782 38623584 PMC11017189 48. Fang Z. Pan T. Li L. Wang H. Zhu J. Zhang H. Zhao J. Chen W. Lu W. Bifidobacterium longum mediated tryptophan metabolism to improve atopic dermatitis via the gut-skin axis Gut Microbes 2022 14 2044723 10.1080/19490976.2022.2044723 35239463 PMC8903757 49. Kim W.K. Jang Y.J. Han D.H. Jeon K. Lee C. Han H.S. Ko G. Lactobacillus paracasei KBL382 administration attenuates atopic dermatitis by modulating immune response and gut microbiota Gut Microbes 2020 12 1 14 10.1080/19490976.2020.1819156 PMC7553742 33016202 50. Qu L. Ma X. Wang F. The roles of gut microbiome and metabolites associated with skin photoaging in mice by intestinal flora sequencing and metabolomics Life Sci. 2024 341 122487 10.1016/j.lfs.2024.122487 38316265 51. Dokoshi T. Chen Y. Cavagnero K.J. Rahman G. Hakim D. Brinton S. Schwarz H. Brown E.A. O’Neill A. Nakamura Y. Dermal injury drives a skin to gut axis that disrupts the intestinal microbiome and intestinal immune homeostasis in mice Nat. Commun. 2024 15 3009 10.1038/s41467-024-47072-3 38589392 PMC11001995 52. Conteville L.C. Vicente A.C.P. Skin exposure to sunlight: A factor modulating the human gut microbiome composition Gut Microbes 2020 11 1135 1138 10.1080/19490976.2020.1745044 32339065 PMC7524261 53. Long J. Gu J. Yang J. Chen P. Dai Y. Lin Y. Wu M. Wu Y. Exploring the Association between Gut Microbiota and Inflammatory Skin Diseases: A Two-Sample Mendelian Randomization Analysis Microorganisms 2023 11 2586 10.3390/microorganisms11102586 37894244 PMC10609507 54. Van den Nieuwboer M. Brummer R.J. Guarner F. Morelli L. Cabana M. Claasen E. The administration of probiotics and synbiotics in immune compromised adults: Is it safe? Benef. Microbes 2015 6 3 17 10.3920/BM2014.0079 25304690 55. Song X. Dou X. Chang J. Zeng X. Xu Q. Xu C. The role and mechanism of gut-lung axis mediated bidirectional communication in the occurrence and development of chronic obstructive pulmonary disease Gut Microbes 2024 16 2414805 10.1080/19490976.2024.2414805 39446051 PMC11509012 56. Sun J. Chen F. Wu G. Potential effects of gut microbiota on host cancers: Focus on immunity, DNA damage, cellular pathways, and anticancer therapy ISME J. 2023 17 1535 1551 10.1038/s41396-023-01483-0 37553473 PMC10504269 57. Mostafavi Abdolmaleky H. Zhou J.R. Gut Microbiota Dysbiosis, Oxidative Stress, Inflammation, and Epigenetic Alterations in Metabolic Diseases Antioxidants 2024 13 985 10.3390/antiox13080985 39199231 PMC11351922 58. Romero-Figueroa M.D.S. Ramírez-Durán N. Montiel-Jarquín A.J. Horta-Baas G. Gut-joint axis: Gut dysbiosis can contribute to the onset of rheumatoid arthritis via multiple pathways Front. Cell. Infect. Microbiol. 2023 13 1092118 10.3389/fcimb.2023.1092118 36779190 PMC9911673 59. Callejo M. Mondejar-Parreño G. Barreira B. Izquierdo-Garcia J.L. Morales-Cano D. Esquivel-Ruiz S. Moreno L. Cogolludo Á. Duarte J. Perez-Vizcaino F. Pulmonary Arterial Hypertension Affects the Rat Gut Microbiome Sci. Rep. 2018 8 9681 10.1038/s41598-018-27682-w 29946072 PMC6018770 60. Ma P.J. Wang M.M. Wang Y. Gut microbiota: A new insight into lung diseases Biomed. Pharmacother. 2022 155 113810 10.1016/j.biopha.2022.113810 36271581 61. Zhang F. Lau R.I. Liu Q. Su Q. Chan F.K.L. Ng S.C. Gut microbiota in COVID-19: Key microbial changes, potential mechanisms and clinical applications Nat. Rev. Gastroenterol. Hepatol. 2023 20 323 337 10.1038/s41575-022-00698-4 36271144 PMC9589856 62. Tian S. Hu W. Niu L. Liu H. Xu H. Xiao S.Y. Pulmonary Pathology of Early-Phase 2019 Novel Coronavirus (COVID-19) Pneumonia in Two Patients With Lung Cancer J. Thorac. Oncol. 2020 15 700 704 10.1016/j.jtho.2020.02.010 32114094 PMC7128866 63. Venzon M. Cadwell K. COVID-19 and the Forgotten Organ: Prolonged Changes to the Metabolic Output of the Gut Microbiome Gastroenterology 2022 162 394 396 10.1053/j.gastro.2021.11.017 34800482 PMC8596650 64. Lei Y. Li S. He M. Ao Z. Wang J. Wu Q. Wang Q. Oral Pathogenic Bacteria and the Oral-Gut-Liver Axis: A New Understanding of Chronic Liver Diseases Diagnostics 2023 13 3324 10.3390/diagnostics13213324 37958220 PMC10648517 65. Milhem A. Abu Toamih-Atamni H.J. Karkar L. Houri-Haddad Y. Iraqi F.A. Studying host genetic background effects on multimorbidity of intestinal cancer development, type 2 diabetes and obesity in response to oral bacterial infection and high-fat diet using the collaborative cross (CC) lines Anim. Model. Exp. Med. 2021 4 27 39 10.1002/ame2.12151 33738434 PMC7954829 66. Qi Y. Wu H.M. Yang Z. Zhou Y.F. Jin L. Yang M.F. Wang F.Y. New Insights into the Role of Oral Microbiota Dysbiosis in the Pathogenesis of Inflammatory Bowel Disease Dig. Dis. Sci. 2022 67 42 55 10.1007/s10620-021-06837-2 33527328 67. Zhou T. Xu W. Wang Q. Jiang C. Li H. Chao Y. Sun Y. Lan A. The effect of the “Oral-Gut” axis on periodontitis in inflammatory bowel disease: A review of microbe and immune mechanism associations Front. Cell. Infect. Microbiol. 2023 13 1132420 10.3389/fcimb.2023.1132420 36923589 PMC10008960 68. Feng Z. Chen Z. Wang X. Zhou M. Liu S. Immune-Mediated Bidirectional Causality Between Inflammatory Bowel Disease and Chronic Periodontitis: Evidence from Mendelian Randomization and Integrative Bioinformatics Analysis Biomedicines 2025 13 476 10.3390/biomedicines13020476 40002889 PMC11853167 69. Grössner-Schreiber B. Fetter T. Hedderich J. Kocher T. Schreiber S. Jepsen S. Prevalence of dental caries and periodontal disease in patients with inflammatory bowel disease: A case-control study J. Clin. Periodontol. 2006 33 478 484 10.1111/j.1600-051X.2006.00942.x 16820035 70. Agossa K. Roman L. Gosset M. Yzet C. Fumery M. Periodontal and dental health in inflammatory bowel diseases: A systematic review Expert Rev. Gastroenterol. Hepatol. 2021 1 15 10.1080/17474124.2021.1952866 34227446 71. Wang Z. Gong J. Ding C. Genetic evidence for the oral-gut axis between periodontitis and inflammatory bowel disease J. Dent. Sci. 2023 18 1904 1905 10.1016/j.jds.2023.07.017 37799865 PMC10548031 72. Li B. Liu M. Du W. Wang S. Xu Z. Zhang X. Zhang Y. Hua S. Cecropin AD ameliorates pneumonia and intestinal injury in mice with mycoplasma pneumoniae by mediating gut microbiota BMC Vet. Res. 2025 21 39 10.1186/s12917-025-04500-w 39881281 PMC11776147 73. Xing J. Niu T. Yu T. Zou B. Fan S. Wang C. Shi C. Zhang D. Wang N. Jiang Y. Gut microbiota-derived isovaleric acid ameliorates influenza virus infection via gut-lung axis npj Biofilms Microbiomes 2025 11 116 10.1038/s41522-025-00753-3 40593739 PMC12216287 74. Alashkar Alhamwe B. Gao Z. Alhamdan F. Harb H. Pichene M. Garnier A. El Andari J. Kaufmann A. Graumann P.L. Kesper D. Intranasal administration of Acinetobacter lwoffii in a murine model of asthma induces IL-6-mediated protection associated with cecal microbiota changes Allergy 2023 78 1245 1257 10.1111/all.15606 36458896 PMC10160012 75. Tang Y. Chen L. Yang J. Zhang S. Jin J. Wei Y. Gut microbes improve prognosis of Klebsiella pneumoniae pulmonary infection through the lung-gut axis Front. Cell. Infect. Microbiol. 2024 14 1392376 10.3389/fcimb.2024.1392376 38903943 PMC11188585 76. Huang X. Li Y. Zhang J. Feng Q. Linking Periodontitis with Inflammatory Bowel Disease through the Oral-Gut Axis: The Potential Role of Porphyromonas gingivalis Biomedicines 2024 12 685 10.3390/biomedicines12030685 38540299 PMC10968003 77. Li C. Yu R. Ding Y. Association between Porphyromonas Gingivalis and systemic diseases: Focus on T cells-mediated adaptive immunity Front. Cell. Infect. Microbiol. 2022 12 1026457 10.3389/fcimb.2022.1026457 36467726 PMC9712990 78. Tong L. Zhang X. Hao H. Liu Q. Zhou Z. Liang X. Liu T. Gong P. Zhang L. Zhai Z. Lactobacillus rhamnosus GG Derived Extracellular Vesicles Modulate Gut Microbiota and Attenuate Inflammatory in DSS-Induced Colitis Mice Nutrients 2021 13 3319 10.3390/nu13103319 34684320 PMC8541209 79. Zhu T.H. Zhu T.R. Tran K.A. Sivamani R.K. Shi V.Y. Epithelial barrier dysfunctions in atopic dermatitis: A skin-gut-lung model linking microbiome alteration and immune dysregulation Br. J. Dermatol. 2018 179 570 581 10.1111/bjd.16734 29761483 80. Dissanayake E. Tani Y. Nagai K. Sahara M. Mitsuishi C. Togawa Y. Suzuki Y. Nakano T. Yamaide F. Ohno H. Skin Care and Synbiotics for Prevention of Atopic Dermatitis or Food Allergy in Newborn Infants: A 2 × 2 Factorial, Randomized, Non-Treatment Controlled Trial Int. Arch. Allergy Immunol. 2019 180 202 211 10.1159/000501636 31394530 81. Tang H. Li W. Xu Y. Zhou Y. Hamblin M.R. Wen X. Gut microbiota modulation: A key determinant of atopic dermatitis susceptibility in children Front. Microbiol. 2025 16 1549895 10.3389/fmicb.2025.1549895 40356648 PMC12066585 82. Augustine T. Kumar M. Al Khodor S. van Panhuys N. Microbial Dysbiosis Tunes the Immune Response Towards Allergic Disease Outcomes Clin. Rev. Allergy Immunol. 2023 65 43 71 10.1007/s12016-022-08939-9 35648372 PMC10326151 83. Ouyang Q. Li X. Liang Y. Liu R. Sea Buckthorn Polysaccharide Ameliorates Colitis Nutrients 2024 16 1280 10.3390/nu16091280 38732527 PMC11085905 84. Huang C.H. Lu S.Y. Tsai W.C. Relevant fecal microbes isolated from mice with food allergy elicited intestinal cytokine/chemokine network and T-cell immune responses Biosci. Microbiota Food Health 2020 39 234 242 10.12938/bmfh.2020-014 33117622 PMC7573112 85. Sze M.A. Tsuruta M. Yang S.W. Oh Y. Man S.F. Hogg J.C. Sin D.D. Changes in the bacterial microbiota in gut, blood, and lungs following acute LPS instillation into mice lungs PLoS ONE 2014 9 e111228 10.1371/journal.pone.0111228 25333938 PMC4205020 86. Qian G. Jiang W. Zou B. Feng J. Cheng X. Gu J. Chu T. Niu C. He R. Chu Y. LPS inactivation by a host lipase allows lung epithelial cell sensitization for allergic asthma J. Exp. Med. 2018 215 2397 2412 10.1084/jem.20172225 30021797 PMC6122967 87. Li D. Luo Z.B. Zhu J. Wang J.X. Jin Z.Y. Qi S. Jin M. Quan L.H. Ginsenoside F2-Mediated Intestinal Microbiota and Its Metabolite Propionic Acid Positively Impact the Gut-Skin Axis in Atopic Dermatitis Mice J. Agric. Food Chem. 2024 72 339 350 10.1021/acs.jafc.3c06015 38150707 88. Oelschlaeger T.A. Mechanisms of probiotic actions—A review Int. J. Med. Microbiol. 2010 300 57 62 10.1016/j.ijmm.2009.08.005 19783474 89. Mazzeo M.F. Luongo D. Sashihara T. Rossi M. Siciliano R.A. Secretome Analysis of Mouse Dendritic Cells Interacting with a Probiotic Strain of Lactobacillus gasseri Nutrients 2020 12 555 10.3390/nu12020555 32093322 PMC7071482 90. Overby H.B. Ferguson J.F. Gut Microbiota-Derived Short-Chain Fatty Acids Facilitate Microbiota:Host Cross talk and Modulate Obesity and Hypertension Curr. Hypertens. Rep. 2021 23 8 10.1007/s11906-020-01125-2 33537923 PMC7992370 91. Xiao S. Jing S. Jiakui S. Lei Z. Ying L. Han L. Xinwei M. Weiqin L. Butyrate Ameliorates Intestinal Epithelial Barrier Injury Via Enhancing Foxp3+ Regulatory T-Cell Function in Severe Acute Pancreatitis Model Turk. J. Gastroenterol. 2022 33 710 719 10.5152/tjg.2022.21307 35943149 PMC9524497 92. Rautava S. Kalliomäki M. Isolauri E. Probiotics during pregnancy and breast-feeding might confer immunomodulatory protection against atopic disease in the infant J. Allergy Clin. Immunol. 2002 109 119 121 10.1067/mai.2002.120273 11799376 93. Feng L. Chen G. Guo Z. Yao W. Li X. Mu G. Zhu X. Both live and heat killed Lactiplantibacillus plantarum DPUL-F232 alleviate whey protein-induced food allergy by regulating cellular immunity and repairing the intestinal barrier Food Funct. 2024 15 5496 5509 10.1039/D4FO00105B 38690869 94. Isolauri E. Arvola T. Sütas Y. Moilanen E. Salminen S. Probiotics in the management of atopic eczema Clin. Exp. Allergy 2000 30 1604 1610 10.1046/j.1365-2222.2000.00943.x 11069570 95. Konieczna P. Ferstl R. Ziegler M. Frei R. Nehrbass D. Lauener R.P. Akdis C.A. O’Mahony L. Immunomodulation by Bifidobacterium infantis 35624 in the murine lamina propria requires retinoic acid-dependent and independent mechanisms PLoS ONE 2013 8 e62617 10.1371/journal.pone.0062617 23704880 PMC3660574 96. Ganguli K. Collado M.C. Rautava J. Lu L. Satokari R. von Ossowski I. Reunanen J. de Vos W.M. Palva A. Isolauri E. Lactobacillus rhamnosus GG and its SpaC pilus adhesin modulate inflammatory responsiveness and TLR-related gene expression in the fetal human gut Pediatr. Res. 2015 77 528 535 10.1038/pr.2015.5 25580735 PMC4465787 97. Chen C. Liu C. Mu K. Xue W. Lactobacillus paracasei AH2 isolated from Chinese sourdough alleviated gluten-induced food allergy through modulating gut microbiota and promoting short-chain fatty acid accumulation in a BALB/c mouse model J. Sci. Food Agric. 2024 104 664 674 10.1002/jsfa.12957 37653286 98. Lordan C. Thapa D. Ross R.P. Cotter P.D. Potential for enriching next-generation health-promoting gut bacteria through prebiotics and other dietary components Gut Microbes 2020 11 1 20 10.1080/19490976.2019.1613124 31116628 PMC6973326 99. Sprenger N. Tytgat H.L.P. Binia A. Austin S. Singhal A. Biology of human milk oligosaccharides: From basic science to clinical evidence J. Hum. Nutr. Diet. Off. J. Br. Diet. Assoc. 2022 35 280 299 10.1111/jhn.12990 PMC9304252 35040200 100. Arora K. Green M. Prakash S. The Microbiome and Alzheimer’s Disease: Potential and Limitations of Prebiotic, Synbiotic, and Probiotic Formulations Front. Bioeng. Biotechnol. 2020 8 537847 10.3389/fbioe.2020.537847 33384986 PMC7771210 101. Xiao K. Li K. Xiao K. Yang J. Zhou L. Gut Microbiota and Hepatocellular Carcinoma: Metabolic Products and Immunotherapy Modulation Cancer Med. 2025 14 e70914 10.1002/cam4.70914 40314129 PMC12046294 102. Huang Y. Chen L. Liu F. Xiong X. Ouyang Y. Deng Y. Tryptophan, an important link in regulating the complex network of skin immunology response in atopic dermatitis Front. Immunol. 2023 14 1300378 10.3389/fimmu.2023.1300378 38318507 PMC10839033 103. Liu Y. Tran D.Q. Lindsey J.W. Rhoads J.M. The Association of Gut Microbiota and Treg Dysfunction in Autoimmune Diseases Adv. Exp. Med. Biol. 2021 1278 191 203 10.1007/978-981-15-6407-9_10 33523449 PMC9290759 104. Michael C.F. Waters C.M. LeMessurier K.S. Samarasinghe A.E. Song C.Y. Malik K.U. Lew D.B. Airway Epithelial Repair by a Prebiotic Mannan Derived from Saccharomyces cerevisiae J. Immunol. Res. 2017 2017 8903982 10.1155/2017/8903982 28770233 PMC5523272 105. Vandeputte D. Falony G. Vieira-Silva S. Wang J. Sailer M. Theis S. Verbeke K. Raes J. Prebiotic inulin-type fructans induce specific changes in the human gut microbiota Gut 2017 66 1968 1974 10.1136/gutjnl-2016-313271 28213610 PMC5739857 106. Arslanoglu S. Moro G.E. Boehm G. Wienz F. Stahl B. Bertino E. Early neutral prebiotic oligosaccharide supplementation reduces the incidence of some allergic manifestations in the first 5 years of life J. Biol. Regul. Homeost. Agents 2012 26 49 59 23158515 107. Swanson K.S. Gibson G.R. Hutkins R. Reimer R.A. Reid G. Verbeke K. Scott K.P. Holscher H.D. Azad M.B. Delzenne N.M. The International Scientific Association for Probiotics and Prebiotics (ISAPP) consensus statement on the definition and scope of synbiotics Nat. Rev. Gastroenterol. Hepatol. 2020 17 687 701 10.1038/s41575-020-0344-2 32826966 PMC7581511 108. Bhardwaj A. Sapra L. Tiwari A. Mishra P.K. Sharma S. Srivastava R.K. “Osteomicrobiology”: The Nexus Between Bone and Bugs Front. Microbiol. 2021 12 812466 10.3389/fmicb.2021.812466 35145499 PMC8822158 109. Rodiño-Janeiro B.K. Vicario M. Alonso-Cotoner C. Pascua-García R. Santos J. A Review of Microbiota and Irritable Bowel Syndrome: Future in Therapies Adv. Ther. 2018 35 289 310 10.1007/s12325-018-0673-5 29498019 PMC5859043 110. Hesser L.A. Puente A.A. Arnold J. Ionescu E. Mirmira A. Talasani N. Lopez J. Maccio-Maretto L. Mimee M. Nagler C.R. A synbiotic of Anaerostipes caccae and lactulose prevents and treats food allergy in mice Cell Host Microbe 2024 32 1163 1176.e6 10.1016/j.chom.2024.05.019 38906158 PMC11239278 111. Heldner A. Heath M.D. Schnautz B. Kotz S. Chaker A. Kramer M.F. Jakwerth C.A. Zissler U.M. Schmidt-Weber C.B. Blank S. Ex Vivo Immunomodulatory Effects of Lactobacillus-, Lacticaseibacillus-, and Bifidobacterium-Containing Synbiotics on Human Peripheral Blood Mononuclear Cells and Monocyte-Derived Dendritic Cells in the Context of Grass Pollen Allergy Probiot. Antimicrob. Proteins 2023 15 868 879 10.1007/s12602-022-09920-w PMC10393851 35113319 112. Tsilingiri K. Rescigno M. Postbiotics: What else? Benef. Microbes 2013 4 101 107 10.3920/BM2012.0046 23271068 113. Salminen S. Collado M.C. Endo A. Hill C. Lebeer S. Quigley E.M.M. Sanders M.E. Shamir R. Swann J.R. Szajewska H. The International Scientific Association of Probiotics and Prebiotics (ISAPP) consensus statement on the definition and scope of postbiotics Nat. Rev. Gastroenterol. Hepatol. 2021 18 649 667 10.1038/s41575-021-00440-6 33948025 PMC8387231 114. Żółkiewicz J. Marzec A. Ruszczyński M. Feleszko W. Postbiotics—A Step Beyond Pre- and Probiotics Nutrients 2020 12 2189 10.3390/nu12082189 32717965 PMC7468815 115. Emeryk A. Vallet T. Wawryk-Gawda E. Jędrzejewski A. Durmont F. Ruiz F. Acceptability of a Sublingual Drug Formulation for Respiratory Tract Infections in Children Aged 3 to 5 Years Pharmaceutics 2021 13 294 10.3390/pharmaceutics13020294 33672395 PMC7926363 116. de Boer G.M. Żółkiewicz J. Strzelec K.P. Ruszczyński M. Hendriks R.W. Braunstahl G.J. Feleszko W. Tramper-Stranders G.A. Bacterial lysate therapy for the prevention of wheezing episodes and asthma exacerbations: A systematic review and meta-analysis Eur. Respir. Rev. 2020 29 190175 10.1183/16000617.0175-2019 33246991 PMC9488706 117. Bodemer C. Guillet G. Cambazard F. Boralevi F. Ballarini S. Milliet C. Bertuccio P. La Vecchia C. Bach J.F. de Prost Y. Adjuvant treatment with the bacterial lysate (OM-85) improves management of atopic dermatitis: A randomized study PLoS ONE 2017 12 e0161555 10.1371/journal.pone.0161555 28333952 PMC5363804 118. Boicean A. Birlutiu V. Ichim C. Anderco P. Birsan S. Fecal Microbiota Transplantation in Inflammatory Bowel Disease Biomedicines 2023 11 1016 10.3390/biomedicines11041016 37189634 PMC10135988 119. Clancy A.K. Lee C. Hamblin H. Gunaratne A.W. LeBusque A. Beck E.J. Dawson M.V. Borody T.J. Dietary Intakes of Recipients of Faecal Microbiota Transplantation: An Observational Pilot Study Nutrients 2021 13 1487 10.3390/nu13051487 33924834 PMC8147000 120. Zhang W. Zou G. Li B. Du X. Sun Z. Sun Y. Jiang X. Fecal Microbiota Transplantation (FMT) Alleviates Experimental Colitis in Mice by Gut Microbiota Regulation J. Microbiol. Biotechnol. 2020 30 1132 1141 10.4014/jmb.2002.02044 32423189 PMC9728197 121. Huang H. Xu H. Luo Q. He J. Li M. Chen H. Tang W. Nie Y. Zhou Y. Fecal microbiota transplantation to treat Parkinson’s disease with constipation: A case report Medicine 2019 98 e16163 10.1097/MD.0000000000016163 31261545 PMC6616439 122. Gu S. Zhao X. Wan F. Gu D. Xie W. Gao C. Intracellularly Gelated Macrophages Loaded with Probiotics for Therapy of Colitis Nano Lett. 2024 24 13504 13512 10.1021/acs.nanolett.4c02699 39418594 123. Yu J. Li S. Xiong B. Shen Y. Guan X. Zhu Y. Fang Y. Zhang S. Ding S. Liu C. Probiotics Bi-Enzymatic Cascade Repair System for Editing the Inflammatory Microenvironment to Boost Probiotic Therapy in Inflammatory Bowel Disease Adv. Mater. 2025 37 e2412429 10.1002/adma.202412429 39641224 124. Li M. Liu N. Zhu J. Wu Y. Niu L. Liu Y. Chen L. Bai B. Miao Y. Yang Y. Engineered probiotics with sustained release of interleukin-2 for the treatment of inflammatory bowel disease after oral delivery Biomaterials 2024 309 122584 10.1016/j.biomaterials.2024.122584 38735180 125. Pei T. Li W. Zhou Z. Zhang Q. Yu G. Yin S. Chen H. Tang J. The relationship between tryptophan metabolism and gut microbiota: Interaction mechanism and potential effects in infection treatment Microbiol. Res. 2025 298 128211 10.1016/j.micres.2025.128211 40393170 126. Hu H. Lu X. Wu M. Bai Z. Liu X. Effects of Environmental Pollutants on Tryptophan Metabolism Toxics 2025 13 311 10.3390/toxics13040311 40278627 PMC12031123 127. Kampmann B. Madhi S.A. Munjal I. Simões E.A.F. Pahud B.A. Llapur C. Baker J. Pérez Marc G. Radley D. Shittu E. Bivalent Prefusion F Vaccine in Pregnancy to Prevent RSV Illness in Infants N. Engl. J. Med. 2023 388 1451 1464 10.1056/NEJMoa2216480 37018474 128. Feldman R.G. Antonelli-Incalzi R. Steenackers K. Lee D.G. Papi A. Ison M.G. Fissette L. David M.P. Maréchal C. Van der Wielen M. Respiratory Syncytial Virus Prefusion F Protein Vaccine Is Efficacious in Older Adults with Underlying Medical Conditions Clin. Infect. Dis. Off. Publ. Infect. Dis. Soc. Am. 2024 78 202 209 10.1093/cid/ciad471 PMC10810713 37698366 129. Mojgani N. Ashique S. Moradi M. Bagheri M. Garg A. Kaushik M. Hussain M.S. Yasmin S. Ansari M.Y. Gut Microbiota and Postbiotic Metabolites: Biotic Intervention for Enhancing Vaccine Responses and Personalized Medicine for Disease Prevention Probiot. Antimicrob. Proteins 2025 10.1007/s12602-025-10477-7 39964413 130. Manzhalii E. Hornuss D. Stremmel W. Intestinal-borne dermatoses significantly improved by oral application of Escherichia coli Nissle 1917 World J. Gastroenterol. 2016 22 5415 5421 10.3748/wjg.v22.i23.5415 27340358 PMC4910662 131. Luo S.M. Chen M.J. Lactobacillus acidophilus TW01 Mitigates PM(2.5)-Induced Lung Injury and Improves Gut Health in Mice Nutrients 2025 17 831 10.3390/nu17050831 40077701 PMC11901689 132. Liu Y. Chen Y. Liao H. Sun S. Zhang X. Xie L. Liu H. Research progress on the application of Lacticaseibacillus rhamnosus GG in pediatric respiratory diseases Front. Nutr. 2025 12 1553674 10.3389/fnut.2025.1553674 40062233 PMC11885142 133. Szajewska H. Berni Canani R. Domellöf M. Guarino A. Hojsak I. Indrio F. Lo Vecchio A. Mihatsch W.A. Mosca A. Orel R. Probiotics for the Management of Pediatric Gastrointestinal Disorders: Position Paper of the ESPGHAN Special Interest Group on Gut Microbiota and Modifications J. Pediatr. Gastroenterol. Nutr. 2023 76 232 247 10.1097/MPG.0000000000003633 36219218 Figure 1 The allergy march and its main causes. The concept of the “allergic march” refers to the progressive sequence of allergic conditions that typically begins with eczema in infancy and may evolve into asthma and allergic rhinitis during childhood. Each of these conditions is influenced by distinct etiological factors. This figure was drawn using Figdraw software ( https://www.figdraw.com/ Figure 2 Factors affecting the gut microbiota of infants and young children. Multiple factors during delivery, as well as throughout the prenatal and postnatal periods, can significantly influence the composition and development of the intestinal microbiota in fetuses and infants. This figure was drawn using Figdraw software ( https://www.figdraw.com/ Figure 3 Microbiota and immune crosstalk in the skin–lung–gut axis. The composition of the human skin, lung, and intestinal microbiota varies, and these microbiota interact with one another, facilitating immune crosstalk across different organ systems. This figure was drawn using Figdraw software ( https://www.figdraw.com/ Figure 4 The primary types of microbiota modulators. Composition and primary mechanisms of action of four microbial preparations. This figure was drawn using Figdraw software ( https://www.figdraw.com/ ",
  "metadata": {
    "Title of this paper": "Probiotics for the Management of Pediatric Gastrointestinal Disorders: Position Paper of the ESPGHAN Special Interest Group on Gut Microbiota and Modifications",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472567/"
  }
}