{
  "title": "Paper_860",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472280 PMC12472280.1 12472280 12472280 41011467 10.3390/microorganisms13092136 microorganisms-13-02136 1 Article Bacillus amyloliquefaciens Clostridium perfringens https://orcid.org/0000-0002-3028-0467 Deng Hongbin Methodology Software Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 † Cheng Si Methodology Software Validation Formal analysis Investigation Data curation 1 † Fan Jiemei Conceptualization Software Validation Formal analysis Investigation Data curation 1 Hao Haibin Methodology Formal analysis Investigation Resources Data curation Supervision 1 Fang Dandong Methodology Validation Formal analysis Investigation Resources 1 https://orcid.org/0000-0002-8483-6264 Li Weiqin Methodology Software Validation Formal analysis Data curation Funding acquisition 1 * Wang Qi Methodology Software Validation Formal analysis Investigation Resources Data curation Writing – original draft 1 2 * Galanis Alex Academic Editor 1 hongbindeng@yeah.net chengsi163@yeah.net aiguoshu3@163.com haoweipei104@163.com fangdandong96@163.com 2 * liweiqindr@nju.edu.cn 21917012@zju.edu.cn † These authors contributed equally to this work. 12 9 2025 9 2025 13 9 496716 2136 15 7 2025 08 9 2025 10 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The objective of our study was to verify the intervention effect of Bacillus amyloliquefaciens C. perfringens C. perfringens C. perfringens C. perfringens C. perfringens Bacillus amyloliquefaciens Necrotic enteritis Clostridium perfringens jejunum organoids Intestinal stem cells (ISCs) Wnt/β-catenin pathway National Natural Science Foundation 82070669 This research was funded by National Natural Science Foundation (Grant Number: 82070669). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Clostridium perfringens 1 2 3 4 C. perfringens 5 6 7 C. perfringens 8 9 10 11 12 13 14 15 Bacillus amyloliquefaciens B. amyloliquefaciens 16 17 18 B. amyloliquefaciens B. amyloliquefaciens 19 B. amyloliquefaciens In the present study, the therapeutic effect of B. amyloliquefaciens C. perfringens B. amyloliquefaciens C. perfringens B. amyloliquefaciens 2. Materials and Methods 2.1. Animal and Probiotic Strain The B. amyloliquefaciens C. perfringens g After acclimatization for 3 days, mice were randomly divided into 4 groups (n = 10): the control (CON, orally administered physiological saline), C. perfringens 8 C. perfringens B. amyloliquefaciens 8 B. amyloliquefaciens B. amyloliquefaciens C. perfringens 8 B. amyloliquefaciens 8 Clostridium perfringen Figure 1 g 2.2. Biochemical Assays The concentrations of serum TNF-α (tumor necrosis factor), IL-1β (interleukin-1β), IL-6 (interleukin-6), and IL-8 (interleukin-8), D-LA (D-lactic acid), DAO (diamine oxidase), and endotoxin were quantified using assay kits (Nanjing Jiancheng Bioengineering Institute, Nanjing, China).on a spectrophotometer (SpectraMax M5, Molecular Devices, Sunnyvale, CA, USA) in accordance with the manufacturer’s instructions. 2.3. Hematoxylin and Eosin (H&E) Staining An analysis of the morphological characteristics of the intestinal tissue was conducted by dehydrating the specimens using a series of ethanol and xylene solutions. This was performed after the tissue had been fixed in a paraformaldehyde solution for a period of 24 h at room temperature. Subsequently, the samples were processed into paraffin blocks. Each specimen was cut into 5 μm cross-sections and stained with haematoxylin and eosin (Sigma-Aldrich, St. Louis, MO, USA). Subsequently, the segments were dehydrated for 10 min with 90% and 100% ethanol solutions, respectively. Subsequently, the tissues were examined, and images were captured using a microscope (BX63, Olympus, Tokyo, Japan) following the application of cedar oil for sealing. Concurrently, measurements were taken of the villus height and crypt depth. 2.4. Morphology of Jejunum Microvilli Experiments using transmission electron microscopy (TEM) were performed on jejunum tissues after they were first fixed in 1% hungry acid and then submerged in a glutaraldehyde solution that contained 2.5% glutaraldehyde. In a nutshell, the samples were dehydrated by means of a succession of graded alcohols, which were then replaced with acetone, and then those samples were embedded in Epon 812 resin (SPI Supplies Inc., West Chester, PA, USA). Uranyl acetate citrate was used in a twofold staining method so that the sections could be examined more closely. The sample sections were observed using a Hitachi H-7650 transmission electron microscope (TEM) (Hitachi, Ibaraki, Japan) and photographed with a Gatan 830 charge-coupled device (CCD) camera (Gatan, CA, USA). 2.5. Crypt Isolation and Intestinal Organoid Culture The preparation of intestinal organoids was carried out in accordance with the methods that Mahé et al. Disclosed [ 20 g g 2 8 8 C. perfringens 8 8 C. perfringens 21 2.6. Total RNA Extraction, Reverse Transcription, and Relative Quantitative Real-Time PCR The TRIZOL reagent (TaKaRa, Tokyo, Japan) was effectively used to isolate total RNA from the jejunal mucosa and organoids. Agar gel electrophoresis was used to assess the RNA’s integrity. In accordance with the instructions provided in the manufacturer’s manual, the PrimeScript II 1st Strand cDNA Synthesis Kit (Vazyme, Nanjing, China) should be utilized to synthesize cDNA. In accordance with the instructions provided by the manufacturer, the total RNA was reverse-transcribed using a PrimeScript RT reagent kit (Vazyme, Nanjing, China). Subsequently, the cDNA was stored at −20 °C. Utilizing the HiScript II One Step RT-qPCR SYBR Green Kit (Vazyme, Nanjing, China) and the StepOne Plus Real-Time PCR system (Applied Biosystems, Carlsbad, CA, USA) to performer RT-qPCR analysis. To design the primers utilized in this investigation, the NCBI Primer-Blast tool was applied ( Table 1 −ΔΔCt 22 2.7. Immunofluorescence and Tunel Analysis Immediately after a fixation period of five minutes in cold methanol, the samples were blocked for two hours at a temperature of twenty-six degrees Celsius with 2.5% bovine serum albumin (BSA). The samples were then subjected to a 12 h incubation at a temperature of 4 °C with the appropriate antibody (Ki67, MUC2, LYZ, Abcam, Cambridge, MA, USA). A solution of 4′,6-diamidino-2-phenylindole (DAPI) and an antibody that was conjugated with Alexa Fluor 488 (Biotime Biotechnology, Xiamen, China) were used to stain the nuclei and the cells. Through the use of a confocal microscope (BX61W1-FV1000, manufactured by Olympus Corporation in Tokyo, Japan), images were acquired. The preparation and staining of the jejunum section were accomplished with the use of a commercial TdT-mediated dUTP Nick-End labeling (TUNEL) kit manufactured (Fluorescein, Basel, Switzerland). When using fluorescence microscopy, it was possible to identify TUNEL-positive nuclei by their green fluorescence. On the other hand, all of the other nuclei in the jejunum were shown to have a blue fluorescence. At a high magnification of 200 times, the pictures were obtained, and for the purpose of statistical analysis, a total of five sections were chosen from each of the groups. In order to determine the apoptotic index, it was necessary to multiply the number of nuclei that were positive for TUNEL by the total number of nuclei [ 23 2.8. Western Blot Analysis Colon tissue lysates prepared with RIPA buffer underwent BCA protein quantification (Sigma, Saint Louis, MO, USA). Equal protein concentrations were separated via 12% SDS-PAGE and electrotransferred onto PVDF membranes (Millipore, MA, USA). Membranes were blocked with 5% skim milk (2 h, 26 °C) and subsequently incubated with primary antibodies overnight at 4 °C against: β-catenin, FZD7 and β-actin (Cell Signaling Technology, Danvers, MA, USA). After five TBST washes, HRP-conjugated secondary antibodies were applied (2 h, 26 °C). Protein bands were visualized using a Millipore chemiluminescent HRP substrate kit (Burlington, MA, USA) imaged on a Tanon system (China). Band intensities quantified by ImageJ 1.8.0 software normalized protein levels to β-actin. 2.9. Statistical Analysis One-way ANOVA and multiple comparison tests were performed using SPSS software (version 20.0; IBM Inc., New York, NY, USA) to evaluate Turkey’s method of data detection. The mean values were reported with their respective standard errors (SD), and p 3. Results 3.1. B. amyloliquefaciens SC06 Improved the Growth Performance and Intestinal Integrity of C. perfringens-Challenged Mouse The NE mouse model was developed through the administration of C. perfringens C. perfringens p Figure 2 p C. perfringens Figure 2 p Figure 2 C. perfringens p Figure 3 C. perfringens p Claudin-1 Claudin-2 Claudin-5 Occludin ZO-1 Figure 3 3.2. B. amyloliquefaciens SC06 Suppressed the Levels of Inflammatory Cytokines and Oxidative Stress in C. perfringens-Challenged Mouse As illustrated in Figure 4 p p p p Figure 4 p C. perfringens Figure 5 3.3. B. amyloliquefaciens SC06 Decreased the Intestinal Cell Apoptosis Rates of Cells in C. perfringens-Challenged Mice On the jejunum, the presence of C. perfringens p Figure 6 p 3.4. B. amyloliquefaciens SC06 Promoted ISC Proliferation and Differentiation in C. perfringens-Challenged Mice The results of the immunofluorescence analysis targeting the Paneth cell marker (LYZ) and goblet cell (MUC2) indicated that the treatment with SC06 significantly increased ( p Figure 7 p Lgr5 Olfm4 Sox9 LYZ MMP7 MUC2 ATOH1 Spink4 Figure 7 3.5. B. amyloliquefaciens SC06 Activated the Wnt/β-Catenin Signaling Pathway in C. perfringens-Challenged Mice The results of the immunofluorescence analysis demonstrated that C. perfringens p Figure 8 p Figure 8 p Figure 8 3.6. B. amyloliquefaciens SC06 Accelerates ISC Proliferation in Jejunum Organoids of Mouse In previous experiments, we observed that SC06 facilitated the proliferation of ISCs following C. perfringens Figure 9 C. perfringens 8 p p Figure 9 p Ki67 PCNA C-myc C. perfringens Figure 9 3.7. B. amyloliquefaciens SC06 Accelerated ISC Proliferation and Differentiation in C. perfringens-Challenged Organoid The qPCR results demonstrated that, in comparison with the CON group, the C. perfringens p Lgr5 SOX9 OLFM4 MUC2 ATOH1 SPINK4 LYZ MMP7 p Figure 10 3.8. Wnt Inhibition Attenuated the Protective Effect of B. amyloliquefaciens SC06 on C. perfringens–Challenged Jejunum Organoids As shown in Figure 11 p β-catenin Cyclin-D1 Wnt3 Axin BMI-1 LRP5 LRP6 p 4. Discussion Bacillus have been shown to be beneficial for intestinal health and have been employed to prevent and treat a variety of gastrointestinal disorders in numerous studies [ 24 25 26 B amyloliquefaciens C. perfringens In the present study, we selected C. perfringens C. perfringens 27 28 29 C. perfringens C. perfringens NetB-positive C. perfringens C. perfringens ATCC 13124 strain produces α-toxin (phospholipase C) and perfringolysin O, and the pathological features observed in our study can be understood in relation to their actions. α-toxin hydrolyzes membrane phospholipids and disrupts tight junction integrity, consistent with our findings of reduced Claudin, Occludin, and ZO-1 expression as well as increased serum D-lactic acid, DAO, and endotoxin [ 28 30 31 28 31 32 30 31 The intestine plays a significant role in nutrient absorption [ 33 34 35 C. perfringens 36 37 B. amyloliquefaciens 38 39 C. perfringens 40 C. perfringens 41 42 43 B. amyloliquefaciens C. perfringens 44 C. perfringens B. amyloliquefaciens 45 C. perfringens B. amyloliquefaciens The interaction between pathogenic bacteria and immune cells may result in damage to the intestinal epithelium, thereby allowing pathogenic bacteria to enter the mucosal layer and submucosa. This process may ultimately lead to the development of NE [ 46 47 44 48 49 50 Limosilactobacillus reuteri C. sakazakii C. perfringens 51 52 53 C. perfringens In the presence of normal physiological circumstances, the process of ISC renewal and differentiation takes place within an in vivo environment that is referred to as the intestinal stem cell niche. This niche comprises signaling molecules and cell-to-cell contacts that regulate the activity of IS cells [ 54 55 56 57 C. perfringens 58 59 60 21 61 62 63 C. perfringens L. reuteri 64 C. perfringens This study has several limitations that should be noted. First, mice were not pretreated with antibiotics, and baseline microbiota composition was not analyzed. While this design provided a relatively stable background to evaluate the protective effects of SC06 against C. perfringens 5. Conclusions In conclusion, SC06 demonstrated efficacy in mitigating intestinal mucosal damage and promoting ISC differentiation and regeneration in a C. perfringens C. perfringens C. perfringens Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/microorganisms13092136/s1 Author Contributions Conceptualization, J.F.; Methodology, H.D., S.C., H.H., D.F., W.L. and Q.W.; Software, H.D., S.C., J.F., W.L. and Q.W.; Validation, S.C., J.F., D.F., W.L. and Q.W.; Formal analysis, H.D., S.C., J.F., H.H., D.F., W.L. and Q.W.; Investigation, H.D., S.C., J.F., H.H., D.F. and Q.W.; Resources, H.H., D.F. and Q.W.; Data curation, H.D., S.C., J.F., H.H., W.L. and Q.W.; Writing—original draft, H.D. and Q.W.; Writing—review and editing, H.D.; Supervision, H.H.; Funding acquisition, W.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal experiments in this study were approved by the Laboratory Animal Welfare and Ethics Committee of Zhejiang University (Ethical Code License No. ZJU20230360; approval date: 12 March 2023). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. References 1. Mehdizadeh Gohari I. Kropinski A.M. Weese S.J. Parreira V.R. Whitehead A.E. Boerlin P. Prescott J.F. Plasmid Characterization and Chromosome Analysis of Two netF plus Clostridium perfringens PLoS ONE 2016 11 e0148344 10.1371/journal.pone.0148344 26859667 PMC4747519 2. Hassan K.A. Elbourne L.D. Tetu S.G. Melville S.B. Rood J.I. Paulsen I.T. Genomic analyses of Clostridium perfringens Res. Microbiol. 2015 166 255 263 10.1016/j.resmic.2014.10.003 25445567 3. Huang K.Y. Liang B.S. Zhang X.Y. Chen H. Ma N. Lan J.L. Li D.Y. Zhou Z.W. Yang M. Molecular characterization of Clostridium perfringens Gut Pathog. 2023 15 47 10.1186/s13099-023-00572-x 37807056 PMC10561448 4. Moustafa S. Zakaria I. Moustafa A. AboSakaya R. Selim A. Molecular epidemiology and genetic characterization of Clostridium perfringens Microb. Pathog. 2022 173 105822 10.1016/j.micpath.2022.105822 36220398 5. Bendary M.M. Abd El-Hamid M.I. El-Tarabili R.M. Hefny A.A. Algendy R.M. Elzohairy N.A. Ghoneim M.M. Al-Sanea M.M. Nahari M.H. Moustafa W.H. Clostridium perfringens Biology 2022 11 551 10.3390/biology11040551 35453750 PMC9028928 6. Hessain A.M. Alhazmi M.I. Moussa I.M. Clostridium perfringens J. Pure Appl. Microbiol. 2013 7 1877 1884 7. Lyhs U. Perko-Makela P. Kallio H. Brockmann A. Heinikainen S. Tuuri H. Pedersen K. Characterization of Clostridium perfringens Poult. Sci. 2013 92 1750 1757 10.3382/ps.2012-02903 23776261 8. Marlow M.A. Luna-Gierke R.E. Griffin P.M. Vieira A.R. Foodborne Disease Outbreaks in Correctional Institutions-United States, 1998–2014 Am. J. Public Health 2017 107 1150 1156 10.2105/AJPH.2017.303816 28520482 PMC5463225 9. Scallan E. Hoekstra R.M. Mahon B.E. Jones T.F. Griffin P.M. An assessment of the human health impact of seven leading foodborne pathogens in the United States using disability adjusted life years Epidemiol. Infect. 2015 143 2795 2804 10.1017/S0950268814003185 25633631 PMC9151020 10. Colombel J.-F. D’Haens G. Lee W.-J. Petersson J. Panaccione R. Outcomes and Strategies to Support a Treat-to-target Approach in Inflammatory Bowel Disease: A Systematic Review J. Crohns Colitis 2020 14 254 266 10.1093/ecco-jcc/jjz131 31403666 PMC7008150 11. Liu C.Y. Cham C.M. Chang E.B. Epithelial wound healing in inflammatory bowel diseases: The next therapeutic frontier Transl. Res. 2021 236 35 51 10.1016/j.trsl.2021.06.001 34126257 PMC8380699 12. Qi Z. Chen Y.-G. Efficient Culture of Intestinal Organoids with Blebbistatin Organoids: Stem Cells, Structure, and Function Turksen K. Methods in Molecular Biology; Springer Science + Business Media New York, NY, USA 2019 Volume 1576 113 121 10.1007/7651_2017_70 29589266 13. Clevers H. The Intestinal Crypt, A Prototype Stem Cell Compartment Cell 2013 154 274 284 10.1016/j.cell.2013.07.004 23870119 14. Hatzis P. Snippert H.J.G. Long noncoding RNAs in gut stem cells Nat. Cell Biol. 2018 20 1106 1107 10.1038/s41556-018-0208-y 30258127 15. Zhang H.-M. Yuan S. Meng H. Hou X.-T. Li J. Xue J.-C. Li Y. Wang Q. Nan J.-X. Jin X.-J. Stem Cell-Based Therapies for Inflammatory Bowel Disease Int. J. Mol. Sci. 2022 23 8494 10.3390/ijms23158494 35955628 PMC9368934 16. Kuang J.-H. Huang Y.-Y. Hu J.-S. Yu J.-J. Zhou Q.-Y. Liu D.-M. Exopolysaccharides from Bacillus amyloliquefaciens J. Funct. Foods 2020 75 104212 10.1016/j.jff.2020.104212 17. Kang M. Choi H.J. Yun B. Lee J. Yoo J. Yang H.-J. Jeong D.-Y. Kim Y. Oh S. Bacillus amyloliquefaciens J. Med. Food 2021 24 709 719 10.1089/jmf.2021.K.0044 34280033 18. Chen X. Zhao H. Lu Y. Meng F. Lu Z. Lu Y. Surfactin Mitigates Dextran Sodium Sulfate-Induced Colitis and Behavioral Disorders in Mice by Mediating Gut-Brain-Axis Balance J. Agric. Food Chem. 2023 71 1577 1592 10.1021/acs.jafc.2c07369 36634244 19. Wang Y. Wu Y.P. Wang B.K. Xu H. Mei X.Q. Xu X.G. Zhang X.P. Ni J.J. Li W.F. Bacillus amyloliquefaciens Front. Microbiol. 2019 10 1161 10.3389/fmicb.2019.01161 31191487 PMC6547872 20. Mahe M.M. Aihara E. Schumacher M.A. Zavros Y. Montrose M.H. Helmrath M.A. Sato T. Shroyer N.F. Establishment of Gastrointestinal Epithelial Organoids Curr. Protoc. Mouse Biol. 2013 3 217 240 10.1002/9780470942390.mo130179 25105065 PMC4120977 21. Sato T. Vries R.G. Snippert H.J. van de Wetering M. Barker N. Stange D.E. van Es J.H. Abo A. Kujala P. Peters P.J. Single Lgr5 stem cells build crypt-villus structures in vitro without a mesenchymal niche Nature 2009 459 262 265 10.1038/nature07935 19329995 22. Sahu A.R. Kumar S. Jain S.K. Raj R.C. Relative mRNA expression of CRBP IV gene and its association with layer economic traits in Rhode Island Red chicken Indian J. Anim. Sci. 2019 89 1345 1348 10.56093/ijans.v89i12.96636 23. Han Y. Tang C. Zhao Q. Fan S. Yang P. Zhang J. Butyrate Mitigates Lipopolysaccharide-Induced Intestinal Morphological Changes in Weanling Piglets by Regulating the Microbiota and Energy Metabolism, and Alleviating Inflammation and Apoptosis Microorganisms 2022 10 2001 10.3390/microorganisms10102001 36296277 PMC9606874 24. Deng Z. Duarte M.E. Kim S.Y. Hwang Y. Kim S.W. Comparative effects of soy protein concentrate, enzyme-treated soybean meal, and fermented soybean meal replacing animal protein supplements in feeds on growth performance and intestinal health of nursery pigs J. Anim. Sci. Biotechnol. 2023 14 89 10.1186/s40104-023-00888-3 37393326 PMC10315043 25. Wen C. Zhang H. Guo Q. Duan Y. Chen S. Han M. Li F. Jin M. Wang Y. Engineered Bacillus subtilis alleviates intestinal oxidative injury through Nrf2-Keap1 pathway in enterotoxigenic Escherichia coli (ETEC) K88-infected piglet J. Zhejiang Univ.-Sci. B 2023 24 496 509 10.1631/jzus.B2200674 37309041 PMC10264173 26. Zhang Y. Tian X. Dong Y. Li R. Shen M. Yi D. Wu T. Wang L. Zhao D. Hou Y. Bacillus coagulans prevents the decline in average daily feed intake in young piglets infected with enterotoxigenic Escherichia coli K88 by reducing intestinal injury and regulating the gut microbiota Front. Cell. Infect. Microbiol. 2023 13 1284166 10.3389/fcimb.2023.1284166 38035331 PMC10686232 27. Mehdizadeh Gohari I. Navarro M.A. Li J. Shrestha A. Uzal F. McClane B.A. Pathogenicity and virulence of Clostridium perfringens Virulence 2021 12 723 753 10.1080/21505594.2021.1886777 33843463 PMC8043184 28. Camargo A. Ramírez J.D. Kiu R. Hall L.J. Muñoz M. Unveiling the pathogenic mechanisms of Clostridium perfringens Emerg. Microbes Infect. 2024 13 2341968 10.1080/22221751.2024.2341968 38590276 PMC11057404 29. Lee K. Lillehoj H. Role of Clostridium perfringens Vaccines 2021 10 61 10.3390/vaccines10010061 35062722 PMC8780507 30. Goossens E. Valgaeren B.R. Pardon B. Haesebrouck F. Ducatelle R. Deprez P.R. Van Immerseel F. Rethinking the role of alpha toxin in Clostridium perfringens Vet. Res. 2017 48 9 10.1186/s13567-017-0413-x 28209206 PMC5314468 31. Moe P.C. Heuck A.P. Phospholipid hydrolysis caused by Clostridium perfringens Biochemistry 2010 49 9498 9507 10.1021/bi1013886 20886855 32. Yamamura K. Ashida H. Okano T. Kinoshita-Daitoku R. Suzuki S. Ohtani K. Hamagaki M. Ikeda T. Suzuki T. Inflammasome activation induced by Perfringolysin O of Clostridium perfringens Front. Microbiol. 2019 10 2406 10.3389/fmicb.2019.02406 31708887 PMC6823607 33. Li B. Lee C. Chuslip S. Lee D. Biouss G. Wu R. Koike Y. Miyake H. Ip W. Gonska T. Intestinal epithelial tight junctions and permeability can be rescued through the regulation of endoplasmic reticulum stress by amniotic fluid stem cells during necrotizing enterocolitis FASEB J. 2021 35 e21265 10.1096/fj.202001426R 33373067 34. Celi P. Cowieson A.J. Fru-Nji F. Steinert R.E. Kluenter A.M. Verlhac V. Gastrointestinal functionality in animal nutrition and health: New opportunities for sustainable animal production Anim. Feed. Sci. Technol. 2017 234 88 100 10.1016/j.anifeedsci.2017.09.012 35. Zhang J. Zhu S. Ma N. Johnston L.J. Wu C. Ma X. Metabolites of microbiota response to tryptophan and intestinal mucosal immunity: A therapeutic target to control intestinal inflammation Med. Res. Rev. 2021 41 1061 1088 10.1002/med.21752 33174230 36. Jiang Z. Su W. Wen C. Li W. Zhang Y. Gong T. Du S. Wang X. Lu Z. Jin M. Effect of Porcine Clostridium perfringens Front. Vet. Sci. 2022 9 881878 10.3389/fvets.2022.881878 35769317 PMC9234579 37. Fernandez-Miyakawa M.E. Sayeed S. Fisher D.J. Poon R. Adams V. Rood J.I. McClane B.A. Saputo J. Uzal F.A. Development and application of an oral challenge mouse model for studying Clostridium perfringens Infect. Immun. 2007 75 4282 4288 10.1128/IAI.00562-07 17562765 PMC1951146 38. Wang Y. Dong J. Jin Z. Bai Y. Analysis of the action pattern of sequential a-amylases from B. stearothermophilus B. amyloliquefaciens Carbohydr. Polym. 2023 320 121190 10.1016/j.carbpol.2023.121190 37659787 39. Bomba L. Minuti A. Moisa S.J. Trevisi E. Eufemi E. Lizier M. Chegdani F. Lucchini F. Rzepus M. Prandini A. Gut response induced by weaning in piglet features marked changes in immune and inflammatory response Funct. Integr. Genom. 2014 14 657 671 10.1007/s10142-014-0396-x 25199657 40. Uzal F.A. McClane B.A. Animal models to study the pathogenesis of enterotoxigenic Clostridium perfringens Microbes Infect. 2012 14 1009 1016 10.1016/j.micinf.2012.06.003 22713745 PMC3572749 41. Saladrigas-Garcia M. Sola-Oriol D. Lopez-Verge S. D’Angelo M. Collado M.C. Nielsen B. Faldyna M. Perez J.F. Martin-Orue S.M. Potential effect of two Bacillus probiotic strains on performance and fecal microbiota of breeding sows and their piglets J. Anim. Sci. 2022 100 skac163 10.1093/jas/skac163 35512239 PMC9175292 42. Jiang Z. Li W. Su W. Wen C. Gong T. Zhang Y. Wang Y. Jin M. Lu Z. Protective Effects of Bacillus amyloliquefaciens Clostridium perfringens Front. Nutr. 2021 8 733591 10.3389/fnut.2021.733591 34746206 PMC8566672 43. Feng J. Cai Z. Chen Y. Zhu H. Chang X. Wang X. Liu Z. Zhang J. Nie G. Effects of an exopolysaccharide from Lactococcus lactis Aeromonas hydrophila Cyprinus carpio Fish Shellfish Immunol. 2020 98 324 333 10.1016/j.fsi.2020.01.037 31981775 44. Zhou Q. Shen B. Huang R. Liu H. Zhang W. Song M. Liu K. Lin X. Chen S. Liu Y. Bacteroides fragilis strain ZY-312 promotes intestinal barrier integrity via upregulating the STAT3 pathway in a radiation-induced intestinal injury mouse model Front. Nutr. 2022 9 1063699 10.3389/fnut.2022.1063699 36590229 PMC9798896 45. Zhao Y.Q. Wang T.C. Li P. Chen J. Nepovimova E. Long M. Wu W.D. Kuca K. Bacillus amyloliquefaciens Ecotoxicol. Environ. Saf. 2021 218 112286 10.1016/j.ecoenv.2021.112286 33933810 46. Rumah K.R. Linden J. Fischetti V.A. Vartanian T. Isolation of Clostridium perfringens PLoS ONE 2013 8 e76359 10.1371/journal.pone.0076359 24146858 PMC3797790 47. Posthaus H. Kittl S. Tarek B. Bruggisser J. Clostridium perfringens J. Vet. Diagn. Investig. 2020 32 203 212 10.1177/1040638719900180 31955664 PMC7081500 48. Li X. Liu J. Zhou Y. Wang L. Wen Y. Ding K. Zou L. Liu X. Li A. Wang Y. Jwa participates the maintenance of intestinal epithelial homeostasis via ERK/FBXW7-mediated NOTCH1/PPARγ/STAT5 axis and acts as a novel putative aging related gene Int. J. Biol. Sci. 2022 18 5503 5521 10.7150/ijbs.72751 36147468 PMC9461671 49. Duan C. Wu J. Wang Z. Tan C. Hou L. Qian W. Han C. Hou X. Fucose promotes intestinal stem cell-mediated intestinal epithelial development through promoting Akkermansia Gut Microbes 2023 15 2233149 10.1080/19490976.2023.2233149 37424378 PMC10334863 50. Wang W.M. Geng M. Zhu C.X. Huang L. Zhang Y. Zhang T.X. Zhao C.J. Zhang T.C. Du X.J. Wang N. Protective Effects and Mechanism of a Novel Probiotic Strain Ligilactobacillus salivarius YL20 against Cronobacter sakazakii-Induced Necrotizing Enterocolitis In Vitro and In Vivo Nutrients 2022 14 3827 10.3390/nu14183827 36145205 PMC9501190 51. Yan M. Su A. Pavasutthipaisit S. Spriewald R. GraSsl G.A. Beineke A. Hoeltig D. Herrler G. Becher P. Infection of porcine enteroids and 2D differentiated intestinal epithelial cells with rotavirus A to study cell tropism and polarized immune response Emerg. Microbes Infect. 2023 12 2239937 10.1080/22221751.2023.2239937 37483148 PMC10399479 52. Liu Y. Reyes E. Castillo-Azofeifa D. Klein O.D. Nystul T. Barber D.L. Intracellular pH dynamics regulates intestinal stem cell lineage specification Nat. Commun. 2023 14 3745 10.1038/s41467-023-39312-9 37353491 PMC10290085 53. Lunnemann H.M. Shealy N.G. Reyzer M.L. Shupe J.A. Green E.H. Siddiqi U. Lacy D.B. Byndloss M.X. Markham N.O. Cecum axis (CecAx) preservation reveals physiological and pathological gradients in mouse gastrointestinal epithelium Gut Microbes 2023 15 2185029 10.1080/19490976.2023.2185029 36872510 PMC10012889 54. Calibasi-Kocal G. Mashinchian O. Basbinar Y. Ellidokuz E. Cheng C.-W. Yilmaz O.H. Nutritional Control of Intestinal Stem Cells in Homeostasis and Tumorigenesis Trends Endocrinol. Metab. 2021 32 20 35 10.1016/j.tem.2020.11.003 33277157 55. Yan Y. Cheng Y.-Y. Li Y.-R. Jiao X.-W. Liu Y.-M. Cai H.-Y. Ding Y.-X. Inhibitor of Wnt receptor 1 suppresses the effects of Wnt1, Wnt3a and beta-catenin on the proliferation and migration of C6 GSCs induced by low-dose radiation Oncol. Rep. 2024 51 22 10.3892/or.2023.8681 38099414 PMC10777445 56. Mohapatra P. Madhulika S. Behera S. Singh P. Sa P. Prasad P. Swain R.K. Sahoo S.K. Nimbolide-based nanomedicine inhibits breast cancer stem-like cells by epigenetic reprogramming of DNMTs-SFRP1-Wnt/fβ-catenin signaling axis Mol. Ther.-Nucleic Acids 2023 34 102031 10.1016/j.omtn.2023.102031 37771911 PMC10523002 57. Yang L. Wang X. Zhao G. Deng L. Yin X. Leveraging Temporal Wnt Signal for Efficient Differentiation of Intestinal Stem Cells in an Organoid Model Stem Cells Dev. 2023 33 11 26 10.1089/scd.2023.0186 37897075 58. Li X.-G. Zhu M. Chen M.-X. Fan H.-B. Fu H.-L. Zhou J.-Y. Zhai Z.-Y. Gao C.-Q. Yan H.-C. Wang X.-Q. Acute exposure to deoxynivalenol inhibits porcine enteroid activity via suppression of the Wnt/β-catenin pathway Toxicol. Lett. 2019 305 19 31 10.1016/j.toxlet.2019.01.008 30690062 59. Zhou J.-Y. Huang D.-G. Gao C.-Q. Yan H.-C. Zou S.-G. Wang X.-Q. Heat-stable enterotoxin inhibits intestinal stem cell expansion to disrupt the intestinal integrity by downregulating the Wnt/β-catenin pathway Stem Cells 2021 39 482 496 10.1002/stem.3324 33373490 60. Flanagan D.J. Phesse T.J. Barker N. Schwab R.H.M. Amin N. Malaterre J. Stange D.E. Nowell C.J. Currie S.A. Saw J.T.S. Frizzled7 Functions as a Wnt Receptor in Intestinal Epithelial Lgr5 + Stem Cell Rep. 2015 4 759 767 10.1016/j.stemcr.2015.03.003 PMC4437483 25892522 61. Du Y. de Jong I.E.M. Gupta K. Waisbourd-Zinman O. Har-Zahav A. Soroka C.J. Boyer J.L. Llewellyn J. Liu C.Y. Naji A. Human vascularized bile duct-on-a chip: A multi-cellular micro-physiological system for studying cholestatic liver disease Biofabrication 2024 16 015004 10.1088/1758-5090/ad0261 PMC10587873 37820623 62. Nishimura R. Shirasaki T. Tsuchiya K. Miyake Y. Watanabe Y. Hibiya S. Watanabe S. Nakamura T. Watanabe M. Establishment of a system to evaluate the therapeutic effect and the dynamics of an investigational drug on ulcerative colitis using human colonic organoids J. Gastroenterol. 2019 54 608 620 10.1007/s00535-018-01540-y 30599053 63. Chen L. Li S. Peng C. Gui Q. Li J. Xu Z. Yang Y. Lactobacillus rhamnosus GG Promotes Recovery of the Colon Barrier in Septic Mice through Accelerating ISCs Regeneration Nutrients 2023 15 672 10.3390/nu15030672 36771378 PMC9921111 64. Wu H.Q. Xie S. Miao J.F. Li Y.C. Wang Z.H. Wang M.J. Yu Q.H. Lactobacillus reuteri maintains intestinal epithelial regeneration and repairs damaged intestinal mucosa Gut Microbes 2020 11 997 1014 10.1080/19490976.2020.1734423 32138622 PMC7524370 Figure 1 Experimental design and animal groups. Figure 2 Effects of SC06 on the intestinal physical barrier function in C. perfringens A B p p C D E a–c p Figure 3 Effects of SC06 on the expression of jejunum tight junction proteins and serum intestinal barrier markers in C. perfringens A B Claudin-1 Claudin-2 Claudin-5 Occludin ZO-1 a–d p Figure 4 Effects of SC06 on the content of cytokines and antioxidant indicators in C. perfringens A B a–c p Figure 5 Effects of SC06 on the content of antioxidant indicators in C. perfringens A B a–c p Figure 6 Effects of SC06 on jejunum apoptosis status in C. perfringens A B a–c p Figure 7 Effects of SC06 on jejunum stem cell proliferation and differentiation of C. perfringens A B C Lgr5 Sox-9 Olfm4 D LYZ MMP7 MUC2 ATOH1 Spink4 a–d p Figure 8 Effects of SC06 on the activation of the Wnt/β-catenin signaling pathway in C. perfringens A B C a–d p Figure 9 SC06 upregulated intestinal organoid proliferation under C. perfringens A B 8 C. perfringen 8 C D C-myc PCNA Ki67 a–d p Figure 10 SC06 upregulated intestinal organoid differentiation under C. perfringens A Lgr5 Sox-9 Olfm4 B LYZ MMP7 C MUC2 ATOH1 Spink4 a–d p Figure 11 Effects of Wnt inhibition on the protective role of SC06 in intestinal organoids challenged with C. perfringens. SC06 + CP + Wnt-C59: Pre-treated with 100 nM Wnt-C59 for 24 h before SC06 and CP. ( A B β-catenin Cyclin Wnt3 Axin BMI-1 LRP5 LRP6 a,b p microorganisms-13-02136-t001_Table 1 Table 1 Sequences of the oligonucleotide primers used for quantitative real-time PCR. Primer Name Accession Numbers Primer Sequence (5′-3′)  Ki67 NM_001081117.2 F: TCATTGACCGCTCCTTTAGGTATG R: TTGGTATCTTGACCTTCCCCA  C-myc NM_010849.4 F: CGTTGGAAACCCCGCAGA R: TACGGAGTCGTAGTCGAGGT  PCNA NM_011045.2 F: GGGTTGGTAGTTGTCGCTGT R: GATTCACGATGCAGAAGCGG  Claudin-1 NM_016674.4 F: CAACCCGAGCCTTGATGGTA R: TCATGCCAATGGTGGACACA  Claudin-2 XM_006528486.4 F: ACCTAGTCCTTGTCCCCAGAA R: GAAGGCATCTAGAAAACGACCAG  Claudin-5 NM_013805.4 F: CCCAGTTAAGGCACGGGTAG R: GGCACCGTCGGATCATAGAA  β-catenin NM_001165902.2 F: CTCGTGTCCTGTGAAGCCC R: CAGGTCAGCTTGAGTAGCCA  Wnt3A NM_009522.3 F: TCCTGTCTGGGATACGGGTT R: TGTCGGGTCAAGAGAGGAGT  Cyclin-D1 NM_001379248.1 F: CAACTTCCTCTCCTGCTACCG R: TGGAGGGGGTCCTTGTTTAG  LRP5 NM_008513.3 F: TGGACTGGATGGGCAAGAAC R: CCTGGGGTTGTCAAGGTCTC  LRP6 NM_008514.4 F: CTGCGGTGGACTTTGTGTTT R: CTCCAAGCCAATCACATGCC  FZD7 NM_008057.3 F: ACCCTACTGCTCCCTACCTG R: AGAAGGGGAAAGACAAGCGG  BMI-1 NM_001416911.1 F: TGCTGGAGAGCTGGAAAGTG R: GTGAGGGAACTGTGGGTGAG  AXIN NM_001159598.2 F: CTTCAGGGCTCTGGGCTC R: AAAACCGGCTGCTCACTCTC  Lgr5 NM_010195.2 F: AATGCCTCTCCACACTTCGG R: ACATCGAACACCTGCGTGAA  SOX9 NM_011448.4 F: AGCACAAGAAAGACCACCCC R: CTCCGCTTGTCCGTTCTTCA  OLFM4 NM_001351947.1 F: GGCACGATGAGTTACAGCCT R: TTCTGCCCAAGAAGTGCCTC  MUC2 NM_023566.4 F: GAAGCCAGATCCCGAAACCA R: GAATCGGTAGACATCGCCGT  ATOH1 NM_007500.5 F: CCCGTCAAAGTACGGGAACA R: CTCGTCCACTACAACCCCAC  Spink4 NM_011463.2 F: CTTGGCATGGACAGGGAACT R: TGGTTTTCATCCGGGTCAGG  LYZ NM_013590.4 F: GACTAGTGAGCTGTGCCTGT R: TGCTCCTGTGGTTATTGGCTG  MMP7 NM_001319986.2 F: TTGGGCAGAATGTTCCTGGTT R: TTTTCCAGTCATGGGCAGGC ",
  "metadata": {
    "Title of this paper": "Lactobacillus reuteri maintains intestinal epithelial regeneration and repairs damaged intestinal mucosa",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472280/"
  }
}