{
  "title": "Paper_1069",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468957 PMC12468957.1 12468957 12468957 41020835 10.3390/cimb47090713 cimb-47-00713 1 Review Methane, Bacteria, Fungi, and Fermentation: Pathophysiology, Diagnosis and Treatment Strategies for Small Intestinal Bacterial Overgrowth, Intestinal Methanogen Overgrowth and Small Intestinal Fungal Overgrowth Wawrzeńczyk Adam 1 https://orcid.org/0009-0002-4547-2098 Czarnowska Marta 2 https://orcid.org/0009-0002-2752-5440 Darwish Samira 2 https://orcid.org/0009-0000-3171-6085 Ćwirko-Godycka Aleksandra 2 https://orcid.org/0000-0003-2651-8468 Lis Kinga 1 Szota Maciej 1 https://orcid.org/0000-0002-8407-4642 Treichel Paweł 2 https://orcid.org/0009-0003-7926-8025 Wojtkiewicz Aleksandra 2 https://orcid.org/0000-0003-2202-3222 Napiórkowska-Baran Katarzyna 1 * Bhatia Madhav Academic Editor 1 adam.wawrzenczyk@cm.umk.pl kinga.lis@cm.umk.pl maciejszota98@gmail.com 2 marta.czarnowska.med@gmail.com samiradarwish00@gmail.com aleksandragood7@gmail.com treichel.pawel@gmail.com wojtkiewiczaleksandra16@gmail.com * knapiorkowska@cm.umk.pl 02 9 2025 9 2025 47 9 497442 713 23 7 2025 27 8 2025 28 8 2025 02 09 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The human gastrointestinal tract hosts a complex ecosystem known as the gut microbiota, which plays a crucial part in digestion and immune system function. Among the clinically recognized manifestations of dysbiosis in this system are Small Intestinal Bacterial Overgrowth (SIBO), Intestinal Methanogen Overgrowth (IMO), Small Intestinal Fungal Overgrowth (SIFO), and Large Intestinal Bacterial Overgrowth (LIBO). This study aims to investigate the complex pathophysiological mechanisms underlying these syndromes and their diagnostics and therapeutic options, focusing primarily on the roles of methane-producing archaea and fungal overgrowth. The methods employed in this study involve a comprehensive analysis and synthesis of peer-reviewed articles, systematic reviews, clinical trials, and meta-analyses. This review summarizes that methane production by Methanobrevibacter smithii gastrointestinal dysbiosis small intestinal bacterial overgrowth (SIBO) intestinal methanogen overgrowth (IMO) small intestinal fungal overgrowth (SIFO) large intestinal bacterial overgrowth (LIBO) This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Gastrointestinal Dysbiosis Overview The gut microbiota, a complex ecosystem of microorganisms, plays a vital role within the human gastrointestinal tract in digestion, immune modulation, and the maintenance of intestinal homeostasis. In recent years, growing attention has been directed toward gastrointestinal dysbiosis as a disruption of this microbial balance, which has been linked to a variety of gastrointestinal and systemic conditions. Clinically recognized forms of dysbiosis include Small Intestinal Bacterial Overgrowth (SIBO), Intestinal Methanogen Overgrowth (IMO), Small Intestinal Fungal Overgrowth (SIFO), and Large Intestinal Bacterial Overgrowth (LIBO), although the last one remains less characterized in the literature and lacks standardized diagnostic criteria [ 1 2 3 4 Understanding gastrointestinal dysbiosis requires analyzing the complex imbalances within the microbiota and their clinical consequences. These conditions are multifactorial and present significant clinical challenges. Methanogenic archaea, such as Methanobrevibacter smithii 3 5 3 This review aims to synthesize current knowledge about the mechanisms driving gut dysbiosis, with particular focus on the roles of methanogens and fungi, and to present available diagnostic methods and therapeutic options. Only through a comprehensive understanding of physiological and pathophysiological relationships is it possible to achieve a clearer picture of the clinical manifestations and guide appropriate therapeutic interventions that emerge later in the text [ 1 2 2. Small Intestinal Bacterial and Methanogen Overgrowth The clinical criteria for diagnosing Small Intestinal Bacterial Overgrowth (SIBO) and Intestinal Methanogen Overgrowth (IMO) remain a subject of debate, complicating standardization efforts within clinical practice [ 6 3 5 7 8 6 7 Methanogen overgrowth, commonly driven by Methanobrevibacter smithii 4 6 8 4 8 6 7 The prevalence rates of SIBO and IMO vary widely among populations, highlighting the multifactorial and heterogeneous nature of these conditions [ 3 9 4 9 9 3 9 3 4 9 The development of SIBO and IMO is influenced by a range of risk factors, including impaired gastric motility, anatomical abnormalities, and the use of proton pump inhibitors (PPIs). PPIs are particularly significant because they reduce gastric acidity, disrupting gut homeostasis by impairing the natural defense mechanisms against bacterial migration into the small intestine [ 9 10 3 9 11 10 12 13 10 Additionally, lifestyle factors such as unhealthy dietary patterns, obesity, and metabolic syndrome exacerbate this disruption, illustrating the complex interaction between systemic metabolic disorders and gastrointestinal health. Addressing these risk factors holistically is essential for a comprehensive understanding of dysbiosis and its treatment [ 3 10 11 Helicobacter pylori H. pylori H. pylori H. pylori Moreover, in a meta-analysis, Liao at al. have shown that, compared to adults without HP infection, those with HP infection were associated with a higher prevalence of SIBO. The association between HP infection and SIBO was stronger in younger than older patients [ 14 H. pylori H. pylori H. pylori 15 16 H. pylori Escherichia coli Klebsiella 17 The clinical presentations of SIBO and IMO frequently overlap, complicating differential diagnosis and treatment strategies. SIBO often manifests as bloating, diarrhea, and abdominal pain, while IMO is predominantly associated with constipation [ 18 19 18 8 18 Hydrogen and methane breath tests are widely used for diagnosing SIBO and IMO due to their non-invasive nature and accessibility. A rise in hydrogen levels of ≥20 parts per million (ppm) above baseline following carbohydrate ingestion indicates SIBO, while methane levels of ≥10 ppm suggest IMO [ 4 6 20 4 6 7 20 Given the limitations of breath testing, alternative diagnostic methods warrant exploration to enhance clinical precision. Small bowel aspirates and cultures provide a more definitive diagnostic approach by directly quantifying bacterial populations in the small intestine, although their invasive nature limits routine use [ 21 8 10 22 8 10 8 10 22 In summary, the diagnosis and management of SIBO and IMO involve navigating complex and often overlapping clinical presentations, influenced by diverse risk factors and diagnostic limitations. The interplay between evolving diagnostic criteria, symptom heterogeneity, and emerging molecular tools underscores the importance of a multi-faceted approach to these conditions. 3. Key Findings Methanogenic archaea, such as Methanobrevibacter smithii 23 24 23 3 24 The slowing of the intestinal transit in constipation-dominant conditions is one of the hallmark features distinguishing methane-dominant dysbiosis from other types, such as hydrogen-producing bacterial overgrowths, which are often associated with diarrhea [ 22 24 22 23 23 The unique metabolic pathways that allow methanogenic archaea to thrive in anaerobic environments give them a notable advantage in conditions of dysbiosis [ 24 25 24 25 Methanogen activity also indirectly affects the production of SCFAs, critical byproducts of microbial fermentation in the gut. The altered fermentation process resulting from reduced hydrogen availability due to methanogenesis leads to an accumulation of SCFAs, which can influence various aspects of gut physiology. While SCFAs are generally considered beneficial in maintaining gut health, the excessive presence of SCFA-producing bacteria in the context of dysbiosis can exacerbate bloating and other gastrointestinal symptoms, further complicating the clinical presentation of conditions like IMO [ 3 26 24 Therapeutic interventions aimed at methanogens have demonstrated potential in alleviating dysbiosis-related symptoms by disrupting methane production and restoring microbial balance. For instance, reducing populations of Methanobrevibacter smithii 23 23 24 23 Fungal overgrowth, particularly involving species such as Candida albicans 25 In the small intestine, dysmotility, bacterial overgrowth, dysbiosis, and epithelial barrier dysfunction are interrelated and collectively contribute to the development of “leaky gut”, which permits the translocation of various microbial products. These include lipopolysaccharide (LPS), a key endotoxin of Gram-negative bacteria, as well as peptidoglycans, lipopeptides, and bacterial DNA from both Gram-positive and Gram-negative bacteria, along with fungal components. Such translocated products interact with Toll-like receptors (TLRs) on immune and other host cells, triggering innate immune responses and promoting proinflammatory signaling cascades. This leads to elevated levels of cytokines such as IL-1β and TNF-α, exacerbates gastrointestinal symptoms, and contributes to systemic complications [ 27 25 Increased intestinal permeability, or “leaky gut,” is a hallmark feature of excessive fungal proliferation and is often driven by the ability of fungi, such as Candida albicans 28 The interaction between fungal and bacterial populations further amplifies the pathogenicity of dysbiosis syndromes. For example, biofilm formation resulting from interactions between Candida albicans Escherichia coli 6 29 Alterations in fungal communities also have systemic implications, as evidenced by studies associating elevated fungal colonization with increased systemic markers of inflammation. These findings link fungal dysbiosis with inflammatory conditions beyond the gastrointestinal tract, including neuropsychiatric disorders. Such systemic effects emphasize the broader significance of fungal contributions to health and the need for comprehensive strategies to address their pathogenicity. This further solidifies the rationale for antifungal therapies extending beyond gastrointestinal symptom management to include systemic inflammatory conditions [ 28 Methane production profoundly affects bacterial hydrogen utilization, disrupting microbial fermentation processes and leading to excessive gas accumulation [ 24 24 30 The impaired gut motility results in prolonged retention of luminal contents, creating an environment conducive to imbalances in bacterial and fungal communities. This perpetuation of dysbiosis underscores the interconnectedness of methane production, microbial imbalances, and symptoms such as constipation. Strategies to improve motility, such as prokinetics or methane-targeting therapies, may mitigate microbial overgrowth, further supporting their integration into treatment paradigms for IMO and related disorders. Elevated methane levels detected through breath testing provide a valuable diagnostic tool for identifying methanogen-predominant conditions like IMO. However, while these tests offer insights into microbial activity, they must be complemented by other diagnostic tools to ensure accurate detection and effective treatment planning [ 6 Interactions between fungi and bacteria are central to the dysbiosis syndromes of both the small and large intestines. For instance, the co-proliferation of Candida tropicalis Escherichia coli 29 31 29 31 Mixed infections involving fungi and bacteria often lead to overlapping symptoms, complicating the clinical presentation and delaying accurate diagnosis. Emerging molecular diagnostic techniques, such as advanced fungal and bacterial DNA sequencing, offer critical insights into these mixed infections. These tools are poised to be indispensable in guiding targeted interventions, especially for patients with complex dysbiosis syndromes [ 8 Effective management of bacterial and fungal imbalances necessitates combination therapies incorporating biofilm-targeting agents alongside traditional antibiotics and antifungals. Addressing biofilms is pivotal in overcoming microbial resistance and achieving long-term remission in dysbiosis conditions. These treatment strategies signify a more holistic approach to restoring microbial equilibrium and resolving persistent symptoms [ 29 Motility disorders and immune dysfunction are fundamental contributors to dysbiosis, as they facilitate the colonization of pathogenic species. Impaired intestinal transit, as observed in IBS-C, creates an environment conducive to bacterial and fungal overgrowth, while immune system dysregulation increases susceptibility to these colonizations. These physiological dysfunctions underscore the importance of addressing both gut transit and immune health to manage dysbiosis effectively [ 32 Immune dysregulation, often observed in conditions like Crohn’s disease and IBS, is intricately linked to increased bacterial and fungal colonization in the gut. These findings highlight the role of immune system dysfunction in initiating and perpetuating dysbiosis, emphasizing the importance of immune-focused therapies as part of a multifaceted treatment approach [ 33 The interplay between gut transit, immune pathways, and microbial composition underscores the complexity of dysbiosis syndromes and the need for multifaceted diagnostic and therapeutic strategies. For instance, variations in Methanosphaera stadtmanae 22 25 Molecular diagnostic advancements, such as shotgun metagenomic sequencing, facilitate the precise detection of microbial contributors to dysbiosis, including traditionally under-recognized players like methanogens and fungi. Tools such as molecular diagnostic advancements (especially shotgun metagenomic sequencing) not only improve diagnostic accuracy but also inform the development of tailored therapeutic strategies that address individual patients’ microbial profiles, promising advancements in personalized medicine [ 8 Comprehensive treatment strategies combining antifungal drugs, biofilm-disrupting agents, and microbiome-based therapies, such as fecal microbiota transplantation (FMT), hold significant potential for achieving gut homeostasis and improving outcomes in dysbiosis syndromes. These interventions represent a critical step towards integrating innovative therapeutic approaches into standard care practices [ 28 34 Altogether, the mechanisms driving dysbiosis syndromes are profoundly influenced by the actions of methanogens and fungi. Thorough understanding and targeted interventions can pave the way for improved clinical management and patient outcomes. 3.1. Microbiota-Mediated Mechanisms of the Mediterranean Diet: Implications for Intestinal and Metabolic Health The Mediterranean diet (MD) has a significant positive influence on gut microbiota, contributing to increased microbial biodiversity and promoting the abundance of beneficial bacterial species such as Faecalibacterium prausnitzii Bifidobacterium Prevotella 35 36 35 36 36 The MD’s content of polyunsaturated fatty acids (especially omega-3) supports cardiovascular and immune health by modulating gut microbiota and improving intestinal barrier function. Mediterranean diet adherence is consistently associated with increased α-diversity (greater bacterial species richness), a key indicator of a healthy gut microbiome. While strong associations exist between MD, microbiota composition, and occurrence of diseases, establishing direct cause-effect relationships often remains challenging due to the complexity and variability of microbiota responses [ 36 What is certain is that minerals and micronutrients (e.g., magnesium, calcium, zinc, selenium, and vitamin B6) found in plant-based components of the MD influence microbial diversity and intestinal health through both direct and synergistic dietary effects. In contrast, the low intake of refined carbohydrates, saturated fats, and trans fats in the MD helps prevent gut dysbiosis, gut wall permeability (“leaky gut”), and associated metabolic disturbances commonly linked to the Western diet. Thus, the MD exerts its health-promoting effects, in part, through favorable modulation of the gut microbiota [ 35 Additionally, the use of probiotics in MAFLD (Metabolic Associated Fatty Liver Disease) patients, by modulating the gut microbiota, led to a significant decrease in intrahepatic fat fraction, greater reductions in triglyceride levels, and improvements in liver enzymes including ALT, AST, and GGT, indicating enhanced liver function and metabolic health [ 37 Pistacia lentiscus 38 38 3.2. Mediterranean Diet in Irritable Bowel Syndrome and Dysbiosis The MD possesses several characteristics that may support gut health. Its rich content of phenolic compounds has demonstrated anti-inflammatory effects, such as the reduction in inflammatory molecule expression. Additionally, adherence to the MD is linked to a higher presence of microbiota that produce short-chain fatty acids, which are important for maintaining the integrity and function of the intestinal lining [ 39 39 Although the generally favorable characteristics of the MD with its anti-inflammatory features and increased consumption of fiber may suggest that this diet would be a suitable match for IBS patients, it is not certain. Chen et al.’s study found no overall difference in MD adherence between IBS patients (106 patients) and healthy controls (108 patients), nor a correlation between MD adherence and IBS symptoms. However, specific food items revealed unexpected associations—some typically healthy (pro-MD) foods like cantaloupe were linked to worse symptoms, while some unhealthy (anti-MD) foods like soda were linked to milder symptoms [ 40 41 3.3. The Role of Laboratory Analysis in the Assessment of Gut Microbiota Composition Laboratory analysis plays a crucial role in evaluating gut microbiota composition by offering precise and quantifiable insights into the diversity and abundance of microbial species. Techniques such as 16S rRNA gene sequencing, 18S rRNA gene sequencing, ITS, and metagenomic analysis enable the identification of even low-abundance microorganisms that may have significant clinical relevance [ 42 43 In the context of SIBO, small bowel aspirate and culture—detecting bacterial growth between 10 3 5 44 3 p 5 p 45 46 p 46 3.4. Clinical Assessment A thorough understanding of clinical assessment is critical for diagnosing gastrointestinal dysbiosis syndromes, including SIBO, IMO, and SIFO. By examining various diagnostic methods and treatment approaches, this section will elucidate the complexities of identifying microbial imbalances and the strategies employed to manage them effectively. Readers will gain insight into how combining innovative technologies with traditional practices can enhance diagnostic accuracy and patient outcomes, reinforcing the necessity of a comprehensive approach to addressing these multifaceted conditions. Hydrogen and methane breath tests are among the most frequently employed non-invasive diagnostic tools for identifying SIBO and IMO. These tests measure exhaled gas concentrations after ingesting carbohydrate substrates such as glucose or lactulose. An increase in hydrogen levels of 20 ppm or more above baseline within 90 min of administration confirms SIBO, while methane levels of 10 ppm or higher at any time are considered diagnostic for IMO [ 6 4 7 The primary advantage of hydrogen and methane breath tests lies in their widespread availability and overall safety profile. They represent a practical diagnostic option for diverse patient populations, particularly those with contraindications for invasive diagnostic methods. However, their diagnostic accuracy is compromised by several factors, including patient preparation, substrate selection, and the overlapping fermentation processes in the colon. For example, using glucose as a substrate, while advantageous for its rapid absorption in the proximal small intestine, often fails to detect overgrowth located in the distal sections [ 7 Small-bowel aspiration and culture, particularly using the Rao technique during upper esophagogastroduodenoscopy, is often regarded as the gold-standard diagnostic tool for SIBO. This method involves obtaining direct samples from the duodenum or jejunum for microbial analysis, with bacterial counts exceeding 10 3 5 7 21 Molecular diagnostic techniques, such as next-generation sequencing and shotgun metagenomic sequencing, represent notable advancements in detecting microbial populations implicated in dysbiosis conditions such as SIBO, IMO, and SIFO. These methods enable the detailed identification of bacterial and fungal species, including Methanobrevibacter smithii Candida albicans 22 47 The diagnostic challenges associated with fungal overgrowth, particularly SIFO, further underscore the need for advanced methodologies. Traditional fungal culture techniques often fail to adequately identify pathogenic fungal species due to their limited sensitivity and specificity. Emerging methods such as fungal DNA sequencing and duodenal aspirate culture have improved diagnostic accuracy by directly identifying fungal species and assessing their contribution to mucosal inflammation [ 28 47 Long-term PPI use is a well-documented risk factor for SIBO, as PPIs reduce gastric acidity, thereby impairing natural defense mechanisms against bacterial colonization in the small intestine. Studies indicate an increased prevalence of SIBO among PPI users, with rates reaching up to 72% [ 45 48 8 A multimodal approach to diagnosis is increasingly recognized as essential for improving the accuracy of dysbiosis detection. By integrating breath tests with molecular diagnostics and invasive techniques such as aspiration and culture, clinicians can address the respective limitations of each method [ 49 50 51 Future research should prioritize the development of comprehensive diagnostic protocols that integrate these diverse methodologies while also addressing practical considerations such as cost, accessibility, and procedural feasibility [ 50 52 In conclusion, diagnostic methods for conditions like SIBO, IMO, and SIFO must evolve to address the inherent limitations of existing approaches. Integrating non-invasive, invasive, and molecular techniques offers the most promise for achieving diagnostic accuracy and informing individualized treatment strategies. Continued advancements in this area are critical for improving patient outcomes and expanding the understanding of gastrointestinal dysbiosis. 3.5. Treatment Approaches Treatment approaches for gastrointestinal dysbiosis syndromes are diverse, encompassing a range of pharmacological, dietary, and microbiome-modulating strategies tailored to address the underlying microbial imbalances. Antibiotic therapies form the cornerstone of management for SIBO and IMO. Rifaximin, a minimally absorbed antibiotic, stands out with documented efficacy rates ranging between 61% and 78% for SIBO treatment [ 6 53 Combination antibiotic therapy offers an enhanced approach for specific dysbiosis profiles, particularly for methane-dominant IMO. Rifaximin combined with neomycin has demonstrated clinical superiority in eradicating methane-producing archaea compared to monotherapy [ 6 Methanobrevibacter smithii 54 In summary, the combination of rifaximin and neomycin is one of the most effective treatment regimens for small intestinal bacterial overgrowth with dominant methane production. Adjunctive therapies, including probiotics, offer promising avenues to reduce recurrence and enhance microbial equilibrium following antibiotic treatments. Probiotic administration aims to restore dysbiosis-induced imbalances by replenishing beneficial bacterial populations while countering the disruptive effects of antibiotic overuse on gut microbiota. While some studies have demonstrated that probiotics reduce recurrence rates of SIBO and improve symptom management, inconsistencies in strain selection, dosage, and duration pose challenges to their widespread clinical adoption [ 8 55 Streptococcus Bacteroides 56 Saccharomyces boulardii 56 57 S. boulardii) 57 Exclusive elemental diets (EDs) have shown significant efficacy as a non-pharmacological intervention for dysbiosis syndromes, particularly hydrogen-dominant SIBO. These diets, consisting of pre-digested nutrients that minimize microbial fermentative activity, have demonstrated normalization of breath test results in 80% of patients within 14 days, with an additional 5% achieving normalization after a 21-day extension [ 58 58 Building on this concept of dietary modulation, probiotics and prebiotics represent a complementary approach that directly targets the composition and function of the gut microbiota, focusing on rebalancing the gut ecosystem to mitigate symptoms and restore equilibrium. Probiotics, because of their ability to promote beneficial changes in microbiota composition, show potential for symptom alleviation in dysbiosis, but their standalone effectiveness for conditions like SIBO and IMO remains inconsistent [ 8 55 While probiotics and prebiotics primarily aim to restore bacterial balance, antifungal therapies remain indispensable when fungal overgrowth, such as SIFO, is the dominant driver of dysbiosis. Fluconazole and nystatin are commonly employed agents targeting fungal pathogens like Candida albicans 8 51 Candida albicans 56 59 Fecal microbiota transplantation (FMT) has emerged as an innovative therapeutic option with significant potential for restoring microbial balance in dysbiosis syndromes. As widely used for Clostridioides difficile Clostridium difficile Clostridioides difficile 34 60 Biofilm formation represents a critical therapeutic challenge in treating dysbiosis-related syndromes complicated by bacterial and fungal overgrowth. Pathogenic biofilms, such as those formed by Candida tropicalis Escherichia coli 59 61 Therapeutic strategies targeting immune pathways are an emerging area of interest. These include the use of biologics and small molecules that modulate inflammatory cytokines (e.g., TNF-α, IL-6, IL-17), many of which are already used in conditions such as inflammatory bowel disease. While such treatments are not yet standard for SIBO or related dysbiosis syndromes, early evidence suggests that regulating immune responses could help break the cycle of inflammation and dysbiosis, particularly in treatment-resistant or recurrent cases. Additionally, some novel approaches aim to modulate the immune system indirectly by targeting the gut microbiota itself through postbiotics, engineered probiotics, or immunobiotics that can enhance regulatory T-cell activity and restore mucosal tolerance. However, these therapies are still largely experimental, and more clinical studies are needed to define their role in dysbiosis treatment. In conclusion, by addressing the specific microbial imbalances underlying each condition, these targeted interventions hold promise for improving clinical outcomes and reducing recurrence. Table 1 4. Conclusions By summarizing and contextualizing these findings, the work underscores its contributions to advancing the understanding of dysbiosis syndromes while recognizing the need for continued innovation to overcome current limitations. Across the literature, several critical gaps persist: the lack of standardized diagnostic protocols that integrate non-invasive and molecular tools; limited understanding of the interplay between bacteria, archaea, and fungi in shaping dysbiosis trajectories; insufficient data on long-term outcomes of microbiome-modulating therapies; and insufficient personalization of interventions based on individual microbial profiles. Future research must therefore prioritize harmonizing diagnostic criteria, advancing cost-effective sequencing-based tools, and developing standardized biofilm-targeting and microbiome-restoring interventions. A proposed diagnostic and therapeutic algorithm is illustrated in Figure 1 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.W. (Adam Wawrzeńczyk) and K.N.-B.; data collection and analysis, K.N.-B., M.S., M.C., S.D., A.Ć.-G., P.T., and A.W. (Aleksandra Wojtkiewicz); writing—original draft preparation, A.W. (Adam Wawrzeńczyk), M.S., M.C., S.D., A.Ć.-G., P.T., and A.W. (Aleksandra Wojtkiewicz); writing—review and editing, K.N.-B. and K.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Velasco-Aburto S. Llama-Palacios A. Sánchez M.C. Ciudad M.J. Collado L. Nutritional Approach to Small Intestinal Bacterial Overgrowth: A Narrative Review Nutrients 2025 17 1410 10.3390/nu17091410 40362719 PMC12073203 2. Soliman N. Kruithoff C. San Valentin E.M. Gamal A. McCormick T.S. Ghannoum M. Small Intestinal Bacterial and Fungal Overgrowth: Health Implications and Management Perspectives Nutrients 2025 17 1365 10.3390/nu17081365 40284229 PMC12030604 3. Banaszak M. Górna I. Woźniak D. Przysławski J. Drzymała-Czyż S. Association between Gut Dysbiosis and the Occurrence of SIBO, LIBO, SIFO and IMO Microorganisms 2023 11 573 10.3390/microorganisms11030573 36985147 PMC10052891 4. Mares C.R. Săsăran M.O. Mărginean C.O. The Relationship between Small Intestinal Bacterial Overgrowth and Constipation in Children—A Comprehensive Review Front. Cell. Infect. Microbiol. 2024 14 1431660 10.3389/fcimb.2024.1431660 38994003 PMC11236546 5. Khan M.Z. Lyu R. McMichael J. Gabbard S. Chronic Intestinal Pseudo-Obstruction Is Associated with Intestinal Methanogen Overgrowth Dig. Dis. Sci. 2022 67 4834 4840 10.1007/s10620-021-07343-1 35001241 6. Pimentel M. Saad R.J. Long M.D. Rao S.S.C. ACG Clinical Guideline: Small Intestinal Bacterial Overgrowth Off. J. Am. Coll. Gastroenterol. 2020 115 165 10.14309/ajg.0000000000000501 32023228 7. Roszkowska P. Klimczak E. Ostrycharz E. Rączka A. Wojciechowska-Koszko I. Dybus A. Cheng Y.-H. Yu Y.-H. Mazgaj S. Hukowska-Szematowicz B. Small Intestinal Bacterial Overgrowth (SIBO) and Twelve Groups of Related Diseases—Current State of Knowledge Biomedicines 2024 12 1030 10.3390/biomedicines12051030 38790992 PMC11117733 8. Guardiola-Arévalo A. Mascort Roca J. Álvarez M.N. Carrillo Muñoz R. Mendive Arbeloa J.M. Amador Romero J. Sobrecrecimiento Bacteriano Intestinal: Mitos y Realidades Aten. Primaria 2025 57 103201 10.1016/j.aprim.2024.103201 39799751 PMC11770485 9. Efremova I. Maslennikov R. Poluektova E. Vasilieva E. Zharikov Y. Suslov A. Letyagina Y. Kozlov E. Levshina A. Ivashkin V. Epidemiology of Small Intestinal Bacterial Overgrowth World J. Gastroenterol. 2023 29 3400 3421 10.3748/wjg.v29.i22.3400 37389240 PMC10303511 10. Rotaru M. Singeap A.-M. Ciobica A. Huiban L. Stanciu C. Romila L. Burlui V. Mavroudis I. Trifan A. Oral Health and “Modern” Digestive Diseases: Pathophysiologic and Etiologic Factors Biomedicines 2024 12 1854 10.3390/biomedicines12081854 39200318 PMC11351600 11. Shah A. Fairlie T. Morrison M. Martin N. Hammer K. Hammer J. Koloski N. Rezaie A. Pimentel M. Kashyap P. Prevalence of Small Intestinal Bacterial Overgrowth in Intestinal Failure Syndrome: A Systematic Review and Meta-Analysis J. Gastroenterol. Hepatol. 2024 39 2308 2318 10.1111/jgh.16668 38934370 PMC11618250 12. Cerdó T. García-Santos J.A. Rodríguez-Pöhnlein A. García-Ricobaraza M. Nieto-Ruíz A. Bermúdez M.G. Campoy C. Impact of Total Parenteral Nutrition on Gut Microbiota in Pediatric Population Suffering Intestinal Disorders Nutrients 2022 14 4691 10.3390/nu14214691 36364953 PMC9658482 13. Zhang J. Deng J. Li J. Su Y. Hu J. Lin D. Su M. Chen Y. Liao S. Bai X. Changes of Gut Microbiota under Different Nutritional Methods in Elderly Patients with Severe COVID-19 and Their Relationship with Prognosis Front. Immunol. 2023 14 1260112 10.3389/fimmu.2023.1260112 37781374 PMC10533997 14. Liao L. Su B.-B. Xu S.-P. Helicobacter Pylori Infection and Small Intestinal Bacterial Overgrowth: A Systematic Review and Meta-Analysis BMC Microbiol. 2023 23 386 10.1186/s12866-023-03063-w 38053022 PMC10698970 15. Konrad P. Chojnacki J. Gąsiorowska A. Rudnicki C. Kaczka A. Chojnacki C. Therapeutic Efficacy of Amoxicillin and Rifaximin in Patients with Small Intestinal Bacterial Overgrowth and Helicobacter Pylori Infection Przeglad Gastroenterol. 2018 13 213 217 10.5114/pg.2018.74228 PMC6173078 30302165 16. Gatta L. Scarpignato C. Systematic Review with Meta-Analysis: Rifaximin Is Effective and Safe for the Treatment of Small Intestine Bacterial Overgrowth Aliment. Pharmacol. Ther. 2017 45 604 616 10.1111/apt.13928 28078798 PMC5299503 17. Xiong Y. Liu L. Zhou X. Wen Y. Wang R. Anti-Helicobacter Pylori Treatment Can Effectively Improve the Clinical Remission Rates of Irritable Bowel Syndrome: A Controlled Clinical Trial Meta-Analysis Clin. Sao Paulo Braz. 2020 75 e1857 10.6061/clinics/2020/e1857 PMC7603230 33206753 18. Rosenthal B.E. Zoll B. Ryan H.N. Toto E. Reynolds J.C. Ahuja N.K. Comparing Small Intestinal Bacterial Overgrowth and Intestinal Methanogen Overgrowth: A Single-Center Retrospective Cohort Study Gastro Hep Adv. 2023 2 925 927 10.1016/j.gastha.2023.07.001 39130770 PMC11308632 19. Mechlińska A. Frąckiewicz K. Gładyś-Cieszyńska K. Buczek D. Dziadziuszko R. Small Intestinal Bacterial Overgrowth and Intestinal Methanogen Overgrowth in Gastrointestinal Malignancies Contemp. Oncol. Onkol. 2025 29 11 21 10.5114/wo.2025.148643 40330452 PMC12051882 20. Sroka N. Rydzewska-Rosołowska A. Kakareko K. Rosołowski M. Głowińska I. Hryszko T. Show Me What You Have Inside—The Complex Interplay between SIBO and Multiple Medical Conditions—A Systematic Review Nutrients 2023 15 90 10.3390/nu15010090 PMC9824151 36615748 21. Karunaratne T.B. Sharma A. Rao S.S.C. Small-Bowel Aspiration during Upper Esophagogastroduodenoscopy: Rao Technique VideoGIE 2021 6 152 154 10.1016/j.vgie.2020.11.008 33898888 PMC8058106 22. Rezaie A. Rao S.S.C. Chapter 15—Intestinal Bacterial, Fungal, and Methanogen Overgrowth Handbook of Gastrointestinal Motility and Disorders of Gut-Brain Interactions 2nd ed. Rao S.S.C. Parkman H.P. McCallum R.W. Academic Press Cambridge, MA, USA 2023 205 221 978-0-443-13911-6 23. Cisek A.A. Szymańska E. Aleksandrzak-Piekarczyk T. Cukrowska B. The Role of Methanogenic Archaea in Inflammatory Bowel Disease—A Review J. Pers. Med. 2024 14 196 10.3390/jpm14020196 38392629 PMC10890621 24. Zengin Ö.D. Aydin S. Zengin Ö.D. Aydin S. The Hidden Influence of Methanogens in the Gut Microbiota Methanogens—Unique Prokaryotes IntechOpen London, UK 2025 978-1-83634-154-3 25. Garcia-Bonete M.J. Rajan A. Suriano F. Layunta E. The Underrated Gut Microbiota Helminths, Bacteriophages, Fungi, and Archaea Life 2023 13 1765 10.3390/life13081765 37629622 PMC10455619 26. Fusco W. Lorenzo M.B. Cintoni M. Porcari S. Rinninella E. Kaitsas F. Lener E. Mele M.C. Gasbarrini A. Collado M.C. Short-Chain Fatty-Acid-Producing Bacteria: Key Components of the Human Gut Microbiota Nutrients 2023 15 2211 10.3390/nu15092211 37432351 PMC10180739 27. Kinashi Y. Hase K. Partners in Leaky Gut Syndrome: Intestinal Dysbiosis and Autoimmunity Front. Immunol. 2021 12 673708 10.3389/fimmu.2021.673708 33968085 PMC8100306 28. Hadrich I. Turki M. Chaari I. Abdelmoula B. Gargouri R. Khemakhem N. Elatoui D. Abid F. Kammoun S. Rekik M. Gut Mycobiome and Neuropsychiatric Disorders: Insights and Therapeutic Potential Front. Cell. Neurosci. 2025 18 1495224 10.3389/fncel.2024.1495224 39845646 PMC11750820 29. Matijašić M. Meštrović T. Čipčić Paljetak H. Perić M. Barešić A. Verbanac D. Gut Microbiota beyond Bacteria—Mycobiome, Virome, Archaeome, and Eukaryotic Parasites in IBD Int. J. Mol. Sci. 2020 21 2668 10.3390/ijms21082668 32290414 PMC7215374 30. Mathur R. Barlow G.M. Obesity and the Microbiome Expert Rev. Gastroenterol. Hepatol. 2015 9 1087 1099 10.1586/17474124.2015.1051029 26082274 31. Rashed R. Valcheva R. Dieleman L.A. Manipulation of Gut Microbiota as a Key Target for Crohn’s Disease Front. Med. 2022 9 887044 10.3389/fmed.2022.887044 35783604 PMC9244564 32. Bushyhead D. Quigley E.M.M. Small Intestinal Bacterial Overgrowth—Pathophysiology and Its Implications for Definition and Management Gastroenterology 2022 163 593 607 10.1053/j.gastro.2022.04.002 35398346 33. Qiao T. Wen X.-H. Exploring Gut Microbiota as a Novel Therapeutic Target in Crohn’s Disease: Insights and Emerging Strategies World J. Gastroenterol. 2025 31 100827 10.3748/wjg.v31.i2.100827 39811502 PMC11684203 34. Sorbara M.T. Pamer E.G. Microbiome-Based Therapeutics Nat. Rev. Microbiol. 2022 20 365 380 10.1038/s41579-021-00667-9 34992261 35. Barber T.M. Kabisch S. Pfeiffer A.F.H. Weickert M.O. The Effects of the Mediterranean Diet on Health and Gut Microbiota Nutrients 2023 15 2150 10.3390/nu15092150 37432307 PMC10180651 36. Merra G. Noce A. Marrone G. Cintoni M. Tarsitano M.G. Capacci A. De Lorenzo A. Influence of Mediterranean Diet on Human Gut Microbiota Nutrients 2020 13 7 10.3390/nu13010007 33375042 PMC7822000 37. The Many Faces of Metabolic Dysfunction-Associated Fatty Liver Disease Treatment: From the Mediterranean Diet to Fecal Microbiota Transplantation Available online: https://www.mdpi.com/1648-9144/60/4/563 (accessed on 21 May 2025) 10.3390/medicina60040563 PMC11051743 38674209 38. Amerikanou C. Dimitropoulou E. Gioxari A. Papada E. Tanaini A. Fotakis C. Zoumpoulakis P. Kaliora A.C. Linking the IL-17A Immune Response with NMR-Based Faecal Metabolic Profile in IBD Patients Treated with Mastiha Biomed. Pharmacother. 2021 138 111535 10.1016/j.biopha.2021.111535 34311533 39. Gut High-Level Adherence to a Mediterranean Diet Beneficially Impacts the Gut Microbiota and Associated Metabolome Available online: https://gut.bmj.com/content/65/11/1812.long (accessed on 21 May 2025) 10.1136/gutjnl-2015-309957 26416813 40. Chen E.Y. Mahurkar-Joshi S. Liu C. Jaffe N. Labus J.S. Dong T.S. Gupta A. Patel S. Mayer E.A. Chang L. The Association Between a Mediterranean Diet and Symptoms of Irritable Bowel Syndrome Clin. Gastroenterol. Hepatol. Off. Clin. Pract. J. Am. Gastroenterol. Assoc. 2024 22 164 172.e6 10.1016/j.cgh.2023.07.012 PMC10849937 37517631 41. Zito F.P. Polese B. Vozzella L. Gala A. Genovese D. Verlezza V. Medugno F. Santini A. Barrea L. Cargiolli M. Good Adherence to Mediterranean Diet Can Prevent Gastrointestinal Symptoms: A Survey from Southern Italy World J. Gastrointest. Pharmacol. Ther. 2016 7 564 571 10.4292/wjgpt.v7.i4.564 27867690 PMC5095576 42. Johnson J.S. Spakowicz D.J. Hong B.-Y. Petersen L.M. Demkowicz P. Chen L. Leopold S.R. Hanson B.M. Agresta H.O. Gerstein M. Evaluation of 16S rRNA Gene Sequencing for Species and Strain-Level Microbiome Analysis Nat. Commun. 2019 10 5029 10.1038/s41467-019-13036-1 31695033 PMC6834636 43. Nash A.K. Auchtung T.A. Wong M.C. Smith D.P. Gesell J.R. Ross M.C. Stewart C.J. Metcalf G.A. Muzny D.M. Gibbs R.A. The Gut Mycobiome of the Human Microbiome Project Healthy Cohort Microbiome 2017 5 153 10.1186/s40168-017-0373-4 29178920 PMC5702186 44. Rao S.S.C. Bhagatwala J. Small Intestinal Bacterial Overgrowth: Clinical Features and Therapeutic Management Clin. Transl. Gastroenterol. 2019 10 e00078 10.14309/ctg.0000000000000078 31584459 PMC6884350 45. Jacobs C. Coss Adame E. Attaluri A. Valestin J. Rao S. Dysmotility and Ppi Use Are Independent Risk Factors for Small Intestinal Bacterial and/or Fungal Overgrowth Aliment. Pharmacol. Ther. 2013 37 1103 1111 10.1111/apt.12304 23574267 PMC3764612 46. Posserud I. Stotzer P. Björnsson E.S. Abrahamsson H. Simrén M. Small Intestinal Bacterial Overgrowth in Patients with Irritable Bowel Syndrome Gut 2007 56 802 808 10.1136/gut.2006.108712 17148502 PMC1954873 47. Khor B. Snow M. Herrman E. Ray N. Mansukhani K. Patel K.A. Said-Al-Naief N. Maier T. Machida C.A. Interconnections between the Oral and Gut Microbiomes: Reversal of Microbial Dysbiosis and the Balance between Systemic Health and Disease Microorganisms 2021 9 496 10.3390/microorganisms9030496 33652903 PMC7996936 48. Kiecka A. Szczepanik M. Proton Pump Inhibitor-Induced Gut Dysbiosis and Immunomodulation: Current Knowledge and Potential Restoration by Probiotics Pharmacol. Rep. 2023 75 791 804 10.1007/s43440-023-00489-x 37142877 PMC10159235 49. Napolitano M. Fasulo E. Ungaro F. Massimino L. Sinagra E. Danese S. Mandarino F.V. Gut Dysbiosis in Irritable Bowel Syndrome: A Narrative Review on Correlation with Disease Subtypes and Novel Therapeutic Implications Microorganisms 2023 11 2369 10.3390/microorganisms11102369 37894027 PMC10609453 50. Fjeldheim Dale H. Arslan Lied G. Gut Microbiota and Therapeutic Approaches for Dysbiosis in Irritable Bowel Syndrome: Recent Developments and Future Perspectives Turk. J. Med. Sci. 2020 50 1632 1641 10.3906/sag-2002-57 32222124 PMC7672353 51. Shukla V. Singh S. Verma S. Verma S. Rizvi A.A. Abbas M. Targeting the Microbiome to Improve Human Health with the Approach of Personalized Medicine: Latest Aspects and Current Updates Clin. Nutr. ESPEN 2024 63 813 820 10.1016/j.clnesp.2024.08.005 39178987 52. Dasgupta N. Srivastava A. Rao A. Murugkar V. Shroff R. Das G. Microbiome Diagnostics and Interventions in Health and Disease Microbiome in Human Health and Disease Bramhachari P.V. Springer Singapore 2021 157 215 9789811631559 53. Takakura W. Rezaie A. Chey W.D. Wang J. Pimentel M. Symptomatic Response to Antibiotics in Patients with Small Intestinal Bacterial Overgrowth: A Systematic Review and Meta-Analysis J. Neurogastroenterol. Motil. 2024 30 7 16 10.5056/jnm22187 38173154 PMC10774808 54. Fang G. Liu S. Liu B. Preventive and Therapeutic Effects of Rifaximin on Hepatic Encephalopathy with Differential Application Dosages and Strategies: A Network Meta-Analysis BMC Gastroenterol. 2024 24 94 10.1186/s12876-024-03184-0 38439005 PMC10910798 55. Ma T. Shen X. Shi X. Sakandar H.A. Quan K. Li Y. Jin H. Kwok L.-Y. Zhang H. Sun Z. Targeting Gut Microbiota and Metabolism as the Major Probiotic Mechanism—An Evidence-Based Review Trends Food Sci. Technol. 2023 138 178 198 10.1016/j.tifs.2023.06.013 56. Maeda Y. Murakami T. Diagnosis by Microbial Culture, Breath Tests and Urinary Excretion Tests, and Treatments of Small Intestinal Bacterial Overgrowth Antibiotics 2023 12 263 10.3390/antibiotics12020263 36830173 PMC9952535 57. Wielgosz-Grochowska J.P. Domanski N. Drywień M.E. Efficacy of an Irritable Bowel Syndrome Diet in the Treatment of Small Intestinal Bacterial Overgrowth: A Narrative Review Nutrients 2022 14 3382 10.3390/nu14163382 36014888 PMC9412469 58. Nasser J. Mehravar S. Pimentel M. Lim J. Mathur R. Boustany A. Rezaie A. Elemental Diet as a Therapeutic Modality: A Comprehensive Review Dig. Dis. Sci. 2024 69 3344 3360 10.1007/s10620-024-08543-1 39001958 PMC11415405 59. Redondo-Cuevas L. Belloch L. Martín-Carbonell V. Nicolás A. Alexandra I. Sanchis L. Ynfante M. Colmenares M. Mora M. Liebana A.R. Do Herbal Supplements and Probiotics Complement Antibiotics and Diet in the Management of SIBO? A Randomized Clinical Trial Nutrients 2024 16 1083 10.3390/nu16071083 38613116 PMC11013329 60. Sahle Z. Engidaye G. Shenkute Gebreyes D. Adenew B. Abebe T.A. Fecal Microbiota Transplantation and Next-Generation Therapies: A Review on Targeting Dysbiosis in Metabolic Disorders and Beyond SAGE Open Med. 2024 12 20503121241257486 10.1177/20503121241257486 38826830 PMC11143861 61. Olteanu G. Ciucă-Pană M.-A. Busnatu Ș.S. Lupuliasa D. Neacșu S.M. Mititelu M. Musuc A.M. Ioniță-Mîndrican C.-B. Boroghină S.C. Unraveling the Microbiome–Human Body Axis: A Comprehensive Examination of Therapeutic Strategies, Interactions and Implications Int. J. Mol. Sci. 2024 25 5561 10.3390/ijms25105561 38791599 PMC11122276 62. Martyniak A. Wójcicka M. Rogatko I. Piskorz T. Tomasik P.J. A Comprehensive Review of the Usefulness of Prebiotics, Probiotics, and Postbiotics in the Diagnosis and Treatment of Small Intestine Bacterial Overgrowth Microorganisms 2025 13 57 10.3390/microorganisms13010057 39858825 PMC11768010 63. Louie T.J. Miller M.A. Mullane K.M. Weiss K. Lentnek A. Golan Y. Gorbach S. Sears P. Shue Y.-K. OPT-80-003 Clinical Study Group Fidaxomicin versus Vancomycin for Clostridium Difficile Infection N. Engl. J. Med. 2011 364 422 431 10.1056/NEJMoa0910812 21288078 64. Crook D.W. Walker A.S. Kean Y. Weiss K. Cornely O.A. Miller M.A. Esposito R. Louie T.J. Stoesser N.E. Young B.C. Fidaxomicin Versus Vancomycin for Clostridium Difficile Infection: Meta-Analysis of Pivotal Randomized Controlled Trials Clin. Infect. Dis. Off. Publ. Infect. Dis. Soc. Am. 2012 55 S93 S103 10.1093/cid/cis499 22752871 PMC3388031 65. European Consensus Conference on Faecal Microbiota Transplantation in Clinical Practice—PubMed Available online: https://pubmed.ncbi.nlm.nih.gov/28087657/ (accessed on 16 June 2025) Figure 1 Diagnostic and therapeutic algorithm. cimb-47-00713-t001_Table 1 Table 1 Treatment approaches for gastrointestinal dysbiosis syndromes. Therapy Target Condition Mechanism of Action Efficacy Limitations/Considerations  Rifaximin SIBO, IMO Minimally absorbed antibiotic; reduces bacterial overgrowth [ 6 53 61–78% efficacy in SIBO; NNT = 2.8 [ 53 High recurrence (43–70%); ↑ resistance; reduced long-term efficacy  Rifaximin + Neomycin Methane-dominant IMO Synergistic antibiotic combination; targets methane-producing archaea [ 6 62 More effective than monotherapy for methane eradication Risk of resistance; impacts on commensal flora  Fluconazole/Nystatin SIFO Antifungal agents; inhibit fungal cell membrane synthesis Effective against Candida albicans 17 53 Requires accurate diagnosis; antifungal resistance is a concern [ 8 52 63 64  Biofilm-Disruptive Agents Biofilm-associated SIBO/SIFO Enzymes or compounds targeting biofilm matrices Enhance mucolysis, penetration, and efficacy [ 59 61 Still under investigation; requires integration with main therapy [ 59 61  Elemental Diet Hydrogen-dominant SIBO, IMO Starves fermentative bacteria; reduces complex substrates Normalization of breath tests in ~80% after 14 days [ 58 Poor palatability; long-term sustainability concerns [ 6 58  Probiotics Post-antibiotic dysbiosis, SIBO, IMO Replenish beneficial bacteria; reduce pathogen load May reduce recurrence and improve outcomes [ 8 55 Variable outcomes; strain- and dose-dependent inconsistencies [ 8 14 38 63 64  Prebiotics General dysbiosis Encourage growth of beneficial microbes Modulate microbiota composition May worsen symptoms due to fermentation [ 55  Synbiotics (Probiotics + Prebiotics) Resistant dysbiosis Combined substrate + strain Promising for microbial restoration Lacks standardized protocols [ 55  Fecal Microbiota Transplantation (FMT) SIBO, IMO, SIFO (recurrent) Restores diverse and balanced microbiota Efficacy of 85% for recurrent C. difficile C. difficile 60 Donor variability, safety concerns, limited data for SIBO/IMO [ 8 34 65  Vancomycin/Fidaxomicin/Metronidazole Clostridioides difficile Inhibit bacterial cell wall synthesis or DNA function Fidaxomicin: similar initial cure rates to vancomycin but lower recurrence (< 50%) [ 63 64 63 64 CDI may recur; secondary dysbiosis; use if recurrence is common [ 63 64 ",
  "metadata": {
    "Title of this paper": "European Consensus Conference on Faecal Microbiota Transplantation in Clinical Practice—PubMed",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468957/"
  }
}