{
  "title": "Paper_1065",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469012 PMC12469012.1 12469012 12469012 41008917 10.3390/cancers17183075 cancers-17-03075 1 Systematic Review IDH Mutations and Intraoperative 5-ALA Fluorescence in Gliomas: A Systematic Literature Review with Novel Exploratory Hypotheses on the Modulatory Effect of Vorasidenib https://orcid.org/0000-0001-9627-7781 Rybaczek Magdalena 1 * Jadeszko Marek 1 Lebejko Aleksander 1 Sawicka Magdalena 2 https://orcid.org/0000-0003-4132-9278 Mariak Zenon 1 Łysoń Tomasz 1 Car Halina 3 https://orcid.org/0000-0003-3759-6058 Wielgat Przemysław 3 Eisenstat David Academic Editor 1 mjadeszko63@gmail.com alebejko@gmail.com zenon.mariak@umb.edu.pl tomasz.lyson@umb.edu.pl 2 magdalena.sawicka@umb.edu.pl 3 hcar@umb.edu.pl przemyslaw.wielgat@umb.edu.pl * magdalenarybaczek@interia.pl 19 9 2025 9 2025 17 18 497140 3075 19 8 2025 17 9 2025 18 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Gliomas are primary brain tumors in which the extent of surgical resection is a critical factor influencing patient prognosis. Fluorescence-guided surgery with oral administration of 5-aminolevulinic acid enables the intraoperative visualization of tumor tissue, thereby facilitating more complete resections. Nevertheless, the intensity of fluorescence differs substantially between tumor grades and molecular subtypes. In particular, gliomas harboring mutations in the isocitrate dehydrogenase gene frequently exhibit weak or absent fluorescence, which complicates the intraoperative identification of tumor margins and may limit surgical efficacy. Our systematic review presents the correlation between fluorescence intensity, tumor grade, and molecular status, and emphasizes its impact on resection rates and survival outcomes. Furthermore, we introduce an exploratory hypothesis that vorasidenib, a novel inhibitor of mutant isocitrate dehydrogenase recently approved for clinical use, could restore metabolic balance and enhance fluorescence in these tumors. This concept may open new avenues for integrating targeted metabolic therapy with fluorescence-guided neurosurgery. Abstract Background Methods Results Conclusions glioma IDH 5-ALA fluorescence vorasidenib This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Gliomas constitute a heterogeneous group of central nervous system tumors characterized by distinct clinical courses, molecular profiles, and prognoses. According to the latest CNS World Health Organization (WHO) classification, a pivotal diagnostic criterion is the presence of mutations in the isocitrate dehydrogenase (IDH) genes, IDH1 or IDH2 [ 1 2 Neurosurgical resection remains the cornerstone of initial glioma management, with the extent of tumor removal being a critical determinant of both progression-free survival (PFS) and overall survival (OS) [ 3 This association has been consistently confirmed in large-scale analyses and meta-analyses, demonstrating that greater extent of resection correlates with improved overall survival in glioblastoma [ 4 5 6 7 Following oral administration and subsequent cellular uptake, 5-ALA is converted to porphobilinogen (PBG), which is further metabolized via the heme biosynthesis pathway through a cascade of enzymatic reactions catalyzed by coproporphyrinogen oxidase (CPOX) and protoporphyrinogen oxidase (PPOX), ultimately yielding protoporphyrin IX (PpIX), a compound with fluorescent properties. Within mitochondria, PpIX serves as a direct precursor to heme and undergoes conversion via the insertion of ferrous iron by ferrochelatase (FECH) [ 8 9 Nevertheless, the clinical usefulness of 5-ALA varies considerably between glioma subtypes. High-grade tumors, especially glioblastomas, usually display strong and consistent fluorescence, whereas low-grade gliomas are widely regarded as non-fluorescent after 5-ALA administration. This limitation is particularly risky in IDH-mutant gliomas, which, despite their generally favorable prognosis, exhibit distinct metabolic alterations that impair PpIX accumulation. The mutation in the isocitrate dehydrogenase gene promotes a neomorphic enzymatic reaction leading to the production of the oncometabolite 2-hydroxyglutarate [ 10 11 12 In recent years, a novel and evolving oncological strategy has focused on targeting IDH mutations as a therapeutic approach in glioma treatment. Vorasidenib—a selective oral inhibitor of mutant IDH1 and IDH2 enzymes—has emerged as a novel therapeutic option. It is the first IDH-directed glioma therapy approved by the U.S. Food and Drug Administration (FDA) [ 11 12 The therapeutic effect of vorasidenib is mediated through the selective inhibition of mutant IDH1 and IDH2 enzymes, thereby lowering intracellular concentrations of 2-HG, which is known to disrupt the heme biosynthesis pathway [ 13 In this context, we conducted a systematic review to synthesize current evidence on intraoperative 5-ALA-induced fluorescence across glioma grades and molecular subgroups, with particular emphasis on the role of IDH mutation status. Based on this foundation, we propose an exploratory hypothesis that vorasidenib, through its metabolic effects, may enhance PpIX accumulation and thereby improve intraoperative fluorescence in IDH-mutant gliomas. We present, for the first time, this hypothesis as a speculative framework intended to provide a rationale for future translational studies aimed at bridging targeted metabolic therapy with fluorescence-guided resection. 2. Materials and Methods 2.1. Search Strategy The presented systematic review was performed according to the Preferred Reporting Items for Systematic Reviews and Meta-Analysis (PRISMA) guidelines. This systematic review has not been registered in any database. The PubMed, Cochrane Library, SCOPUS and Web of Science databases were searched using the terms combinations: “5-ALA + IDH”, “5-aminolevulinic + IDH”, “vorasidenib + 5-ALA”, “vorasidenib + 5-aminolevulinic” up to May 2025. A schematic PRISMA flow diagram depicting the selection of the studies included in this review is presented in Figure 1 The choice of search terms was intentionally limited to ensure clinical relevance to the review question. Pilot searches with broader terms (e.g., “protoporphyrin IX”, “fluorescence-guided resection”) retrieved predominantly basic science papers or highly heterogeneous surgical reports not specific to intraoperative 5-ALA fluorescence. Importantly, because we did not restrict keywords to title/abstract fields, studies using broader descriptors but also mentioning 5-ALA were captured. This approach minimized irrelevant results while maintaining sensitivity for clinically meaningful studies. 2.2. Study Selection and Data Extraction Two authors independently screened the literature by reviewing the full texts of eligible manuscripts to extract data on authorship and publication year, study methodology, sample size, glioma subtypes classified by WHO grade, the percentage of 5-ALA-induced fluorescence observed across glioma grades, associations between fluorescence and IDH mutation status, the clinical significance of fluorescence in the context of surgical resection, and technical details such as the type of operative microscope and fluorescence detection techniques used. Study limitations and available long-term outcomes, including survival data and treatment efficacy, were also analyzed. 2.3. Inclusion Criteria The inclusion criteria were defined according to the PICOS framework: P (Population): I (Intervention): C (Comparison): O (Outcomes): S (Study Design): 2.4. Exclusion Criteria As part of the systematic literature review, studies were excluded if they focused on variable epigenetic profiles or mutations in enzymes or receptors other than IDH, investigated the effects of unrelated pharmacological agents, assessed outcomes based on PET imaging, tractography, laser therapy, or photodynamic therapy; relied on the previous WHO classification (2016, 4th edition) or were limited to case reports. 2.5. Bias Considerations Independent dual screening with consensus was used to minimize reviewer bias. Only studies applying the WHO 2021 CNS classification (not the 2016 edition) were included. Remaining risks include selection/database-coverage bias, language bias (English only), and measurement bias from non-standardized fluorescence assessment. 2.6. Statistical Analysis Due to the substantial heterogeneity of study methodologies (non-standardized fluorescence grading, variable IDH testing, and inconsistently reported outcomes), a formal meta-analysis was not feasible. In accordance with PRISMA recommendations, we therefore adopted a descriptive synthesis of the extracted data. Results from the included studies were summarized using basic summary statistics, including frequencies, percentages, and ranges. Statistical outcomes, such as p-values and confidence intervals, are reported as presented in the original publications. No additional statistical analyses were conducted due to heterogeneity in study designs and reported outcomes. 3. Results 3.1. Study Selection A literature search conducted by PRISMA methodology yielded a total of 195 records: 99 related to “5-ALA + IDH” and 96 to “5-aminolevulinic acid + IDH.” No results were identified for either “vorasidenib + 5-ALA” or “vorasidenib + 5-aminolevulinic acid.” After the removal of 138 duplicate records, titles and abstracts of the remaining studies were screened, resulting in the exclusion of 10 records due to irrelevant subject matter. Full-text review was then conducted for the remaining 47 articles, of which 40 were excluded based on criteria outlined in the Exclusion Criteria section. Ultimately, seven articles were included in the final analysis [ 14 15 16 17 18 19 20 Figure 1 The studies, published between 2015 and 2025, were conducted in Italy ( n n n n n 3.2. Intraoperative Fluorescence and Its Association with Tumor Grade and IDH Mutation In the seven studies included in this review, a total of 621 patients were analyzed, encompassing both primary and recurrent gliomas across WHO grades 2 to 4. The individual cohorts were as follows: 112 patients with lower-grade IDH-mutant gliomas (69 astrocytomas and 43 1p/19q-codeleted oligodendrogliomas, WHO grades 2–3) [ 14 15 16 17 n n 18 19 20 Fluorescence detection rates were reported across glioma grades. In WHO grade 4 gliomas, fluorescence was observed in 94% to 100% of cases [ 15 17 18 19 20 14 16 18 19 14 16 19 Most investigations provided subgroup analyses stratified by IDH mutation status, generally demonstrating reduced fluorescence in IDH-mutant gliomas compared to tumors without IDH mutations. However, some series did not confirm a statistically significant correlation [ 14 Table 1 3.3. Surgical and Oncological Outcomes The potential of fluorescence in improving patient outcomes is significant. Gross total resection was significantly more achievable in tumors exhibiting strong fluorescence. In the study by Müther et al. [ 16 15 p p 20 In terms of progression-free survival (PFS) and overall survival (OS), Kim et al. [ 17 p 14 p p 20 This paradoxical finding does not indicate that fluorescence itself worsens outcomes, but rather that intraoperative fluorescence in lower-grade gliomas tends to occur in tumors with higher biological aggressiveness [ 14 In contrast, IDH-mutant gliomas without fluorescence, typically less aggressive in their behavior, were associated with slightly lower GTR rates but more favorable long-term outcomes. Nevertheless, across studies, complete resection of all fluorescent tissue consistently correlated with improved PFS and OS when present, underscoring the clinical value of reliable intraoperative visualization. Large surgical series further support that maximal safe resection, even beyond conventional contrast-enhancing boundaries, is associated with incremental survival benefit [ 21 3.4. Comprehensive Findings from the Literature Review Bianconi et al. [ 14 The occurrence of visible fluorescence in this subgroup should be regarded not primarily as a technical adjunct facilitating resection, but rather as a potential surrogate marker of underlying biological aggressiveness. Focal areas of intraoperative fluorescence within otherwise low-grade tumors may represent regions of increased anaplasia or early malignant transformation. Identifying these areas enables targeted resection and histopathological sampling, thereby improving diagnostic accuracy and supporting therapeutic decisions in the postoperative setting. In a retrospective single-center study, Specchia et al. [ 15 The results showed that fluorescence intensity varied according to IDH mutation status. In the IDH-wildtype group ( n n p Additionally, no statistically significant associations were found between fluorescence grade and other biological or clinical factors, including MGMT (O 6 p It is important to note that the study did not evaluate outcome measures such as GTR, OS, or PFS. Limitations include the small sample size, lack of objective quantitative assessment of fluorescence (e.g., PpIX spectroscopy), and potential selection bias. While 5-ALA remains a valuable intraoperative adjunct, its variable reliability—particularly in IDH-mutant tumors—highlights the importance of multimodal guidance and personalized surgical decision-making. The study by Müther et al. [ 16 The presence and intensity of contrast enhancement predicted intraoperative fluorescence with an overall accuracy of 91.9%, with subgroup accuracies of 81.0% for WHO grade 2 gliomas and 93.0% for WHO grade 3 gliomas. Visible fluorescence was observed in 75–85% of grade 3 tumors and 16–20% of grade 2 tumors, aligning with previously reported ranges. The probability of intraoperative fluorescence increased proportionally with the degree of contrast enhancement. For instance, non-enhancing tumors (CE 0) had a 91.2% probability of lacking fluorescence, while tumors with abundant enhancement (CE 3) had a 91.3% probability of demonstrating fluorescence. Additionally, fluorescence showed a significant correlation with the MIB-1 proliferation index ( p p Although the study did not include outcome measures such as gross total resection GTR, OS, or (PFS, it underscores the predictive value of MRI contrast enhancement for intraoperative fluorescence. This finding highlights the potential utility of 5-ALA in identifying biologically aggressive tumor regions in intermediate-grade gliomas. In their institutional series, Kim et al. [ 17 Among pink-fluorescent areas, 50% demonstrated definitive infiltration by tumor cells, while only 29% of blue-fluorescent samples showed such infiltration. However, there was no statistically significant association between residual fluorescence and histopathological tumor cell presence in either the resection cavity ( p p The median PFS was 12.5 ± 2.1 months, and the median OS was 21.1 ± 3.5 months. Univariate analysis revealed that the presence of infiltrating tumor cells in peritumoral regions was significantly associated with shorter PFS ( p p p p These findings suggest that while residual 5-ALA fluorescence may offer intraoperative guidance, it does not reliably predict microscopic tumor infiltration. Instead, histological confirmation of infiltrating tumor cells beyond the enhancing core appears to carry stronger prognostic significance. This supports the role of supramarginal resection in selected patients, even in the absence of visible fluorescence. In a retrospective analysis, Hickmann et al. [ 18 Non-fluorescent tumors were significantly more likely to be of WHO grade 3, IDH-mutant status, and exhibit oligodendroglial histology. Molecular profiling demonstrated a strong association between fluorescence and IDH mutation status: 100% of non-fluorescent tumors were IDH-mutant, whereas only 48.9% of fluorescent tumors harbored IDH mutations ( p p p p Another study, by Ohba et al. [ 19 Analysis of molecular markers indicated that IDH1 and IDH2 mutations, which were present in 35.6% of tumors, were significantly associated with reduced intraoperative fluorescence (51.4% in IDH-mutant tumors compared to 94.0% in IDH-wildtype tumors, p p In vitro analyses using glioma cell lines engineered to express IDH1 mutations demonstrated elevated levels of ferrochelatase (FECH) and heme oxygenase-1 (HO-1), enzymes involved in heme metabolism. This expression pattern suggests increased degradation PpIX in IDH-mutant cells. The molecular phenotype correlated with progressively diminished fluorescence across serial cell passages, further indicating that IDH mutation status may impair PpIX accumulation and thereby reduce intraoperative fluorescence in these tumors. All patients underwent surgery using a Zeiss OPMI Pentero microscope with the BLUE400 filter. The study did not assess the extent of resection or long-term clinical outcomes, including PFS and OS. Finally, in a retrospective single-center study, Zeppa et al. [ 20 The analysis demonstrated that intraoperative fluorescence was consistently detectable across all groups, reflecting the high prevalence of fluorescence in glioblastoma. Extent of resection ≥ 90% was achieved in 87.5% of cases with 5-ALA, 77.3% with fluorescein sodium, and 80% with the combined approach, with no statistically significant differences between groups ( p p Overall survival for the entire cohort was 14.9 months. Median OS was 20.0 months in the 5-ALA group, 12.3 months in the fluorescein sodium group, and 18.1 months in the combined group, with no significant survival differences observed (trend toward longer OS in the 5-ALA and combined groups; p Limitations include the retrospective design, lack of randomization, single-center setting, and relatively small subgroup sizes, particularly in the combined fluorophore cohort. Despite these constraints, the study contributes valuable evidence regarding the relative performance of 5-ALA and fluorescein sodium in fluorescence-guided surgery for glioblastoma. It supports their role as reliable adjuncts in optimizing the extent of resection without increasing postoperative morbidity. 4. Discussion This literature review provides evidence that the intraoperative detection of 5-ALA-induced fluorescence is strongly influenced by WHO tumor grade, with fluorescence being almost universally observed in grade 4 gliomas [ 17 18 19 20 18 19 18 19 14 15 In glioblastoma without IDH mutations, intraoperative fluorescence was consistently detectable and enabled high rates of ≥90% resection with comparable functional outcomes [ 20 These observations are consistent with a recent systematic review that specifically examined intraoperative fluorescence in lower-grade gliomas, synthesizing evidence from 16 clinical series employing 5-ALA as well as reports on alternative fluorophores including sodium fluorescein, indocyanine green, and tozuleristide [ 22 Collectively, the available evidence indicates that 5-ALA-induced fluorescence is a reliable adjunct in the surgical management of high-grade gliomas, where it facilitates maximal safe resection. In contrast, its value in lower-grade gliomas appears limited. In this setting, the presence of intraoperative fluorescence may provide important prognostic information, reflecting areas of histological progression. However, it cannot be considered a consistent or comprehensive tool for guiding the extent of resection. Our systematic review confirms that intraoperative 5-ALA fluorescence is strongly associated with WHO tumor grade and variably influenced by IDH mutation status. Based on this finding, we propose an exploratory hypothesis that the IDH inhibitor vorasidenib may modulate porphyrin metabolism and enhance intraoperative fluorescence in IDH-mutant gliomas. Importantly, this concept is speculative and has not yet been investigated experimentally. As outlined in the introduction and presented in Figure 2 The reduced fluorescence observed in IDH-mutant gliomas has been associated with the intracellular accumulation of the oncometabolite 2-HG, which is produced as a result of the neomorphic enzymatic activity of mutant IDH1 and IDH2 isoforms [ 10 Figure 3 IDH mutations profoundly affect tumor biology through epigenetic and metabolic mechanisms. While wild-type IDH enzymes support physiological cellular metabolism, mutant isoforms disrupt TCA cycle flux and promote the accumulation of 2-HG in distinct subcellular compartments, depending on the specific mutation. In IDH1-mutant tumors, 2-HG accumulates primarily in the cytoplasm, where it inhibits α-ketoglutarate-dependent dioxygenases, including DNA and histone demethylases, leading to widespread epigenetic dysregulation and global hypermethylation [ 23 24 24 25 23 26 Figure 4 This dual mechanism of epigenetic and metabolic disruption promotes an immature and less differentiated cellular phenotype characterized by impaired lineage commitment, reduced cellular proliferation rates, and altered tumor microenvironment interactions. These features are associated with slower tumor growth and may partly account for the more favorable prognosis typically observed in patients with IDH-mutant gliomas [ 2 23 26 Among the specific metabolic pathways affected by 2-HG accumulation, the mitochondrial heme biosynthesis cascade is of particular interest due to its direct role in 5-ALA-induced intraoperative fluorescence. Disruption of this pathway involves inhibition of key mitochondrial enzymes—CPOX and PPOX, as shown in Figure 5 26 Despite their generally favorable clinical course and prognosis, the fluorescence deficit observed in IDH-mutant tumors has practical implications for neurosurgical management. Reduced PpIX synthesis leads to diminished or absent intraoperative fluorescence, which significantly complicates the surgical resection of IDH-mutant tumors, as they are often difficult to distinguish from surrounding healthy brain tissue. This fluorescence attenuation poses a challenge to achieving GTR—an outcome that remains critical for long-term disease control. This limitation highlights the need for novel strategies to improve intraoperative visualization. Given these challenges, vorasidenib—a selective inhibitor of mutant IDH1 and IDH2—may represent a promising and potentially transformative adjunct in the surgical management of low-grade gliomas. 4.1. Vorasidenib: A Targeted IDH Inhibitor Redefining Glioma Metabolism Building on its metabolic mechanism of action, vorasidenib has demonstrated significant biochemical effects in both preclinical models and clinical trials, particularly through effective suppression of α-ketoglutarate to the oncometabolite 2-HG [ 13 25 27 12 13 13 Ongoing clinical trials, with a primary focus on WHO grade 2 IDH-mutant gliomas, are actively exploring the potential of vorasidenib. Early data suggest that vorasidenib may be less effective in tumors exhibiting radiographic contrast enhancement, a radiological feature commonly associated with higher-grade transformation and a more aggressive tumor phenotype [ 12 4.2. IDH Mutations and Vorasidenib: Understanding the Paradox of Favorable Genetics and Targeted Therapy A clinically relevant dilemma arises—if IDH mutations in gliomas are associated with favorable prognosis and prolonged survival, how can vorasidenib—a drug that inhibits effects of these mutations—further improve therapeutic outcomes? Vorasidenib exerts its therapeutic effect by inhibiting the aberrant production and accumulation of 2-HG, which drives a cascade of deleterious molecular events, including secondary genetic alterations, impaired cellular differentiation, mitochondrial dysfunction, oxidative stress, and widespread metabolic dysregulation [ 23 25 24 28 24 27 28 This hypothesis is supported by recent clinical data. In the phase 3 INDIGO trial, which enrolled patients with IDH-mutant grade 2 gliomas who had not undergone prior radiotherapy or chemotherapy, vorasidenib more than doubled the median PFS compared to placebo (27.7 months vs. 11.1 months), while significantly delaying the initiation of additional therapeutic interventions [ 13 4.3. Implications for Future Research: Exploring the Potential of Vorasidenib to Enhance 5-ALA-Guided Fluorescence To date, no preclinical or clinical studies have directly investigated the potential interaction between vorasidenib and 5-ALA-induced fluorescence. However, based on established biochemical mechanisms, it is reasonable to hypothesize that inhibition of 2-HG production by vorasidenib could restore α-ketoglutarate-dependent mitochondrial function and reactivate key enzymes involved in heme biosynthesis. In particular, enhanced activity of CPOX and PPOX may increase the accumulation of fluorescent PpIX following 5-ALA administration. This hypothetical pathway is illustrated in Figure 5 Clinically, this effect may be especially relevant in low-grade IDH-mutant gliomas, where intraoperative fluorescence is typically weak or absent, posing a challenge to achieve GTR [ 29 30 13 4.4. Limitations This literature review has certain limitations. The included studies demonstrated substantial methodological heterogeneity, particularly in terms of fluorescence assessment protocols. Most investigations relied on subjective visual grading of intraoperative fluorescence, while only a limited number employed objective quantification methods. Furthermore, critical outcome measures—such as the extent of resection, PFS, and OS—were inconsistently reported across studies, thereby limiting the robustness and generalizability of the synthesized findings. A further limitation concerns the exploratory hypothesis regarding vorasidenib, which remains entirely speculative and is not supported by preclinical or clinical data. Experimental validation is urgently needed, particularly in IDH-mutant low-grade glioma cell lines, to assess PpIX accumulation and fluorescence following combined exposure to 5-ALA and vorasidenib. The development of a standardized experimental protocol—including optimized dosing regimens, timing of drug administration, and fluorescence measurement intervals—will be essential to generate reproducible and clinically meaningful data. Notably, preclinical studies addressing this question are currently being conducted in our laboratory, which are expected to provide the first empirical evidence to support or refute this hypothesis. 5. Conclusions This systematic review demonstrates that the effectiveness of 5-ALA-guided fluorescence in glioma surgery is strongly dependent on WHO grade and variably influenced by IDH mutation status, with markedly reduced detection in many IDH-mutant tumors. For the first time, we propose the exploratory hypothesis that vorasidenib may enhance intraoperative fluorescence in this setting by restoring heme biosynthesis pathways. While this concept remains speculative, it represents a compelling target for future translational research and requires rigorous experimental validation. Disclaimer/Publisher’s Note: Author Contributions Conceptualization M.R., M.J. and P.W.; methodology M.R.; software M.R., M.J. and P.W.; validation M.R., P.W. and Z.M.; formal analysis M.R. and P.W.; resources M.R., M.S. and P.W.; data curation M.R., A.L., Z.M., T.Ł., H.C. and P.W.; original draft preparation M.R.; writing—review and editing M.R. and P.W.; visualization M.R.; supervision P.W.; project administration M.R. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: 5-ALA 5-aminolevulinic acid IDH isocitrate dehydrogenase PFS progression-free survival OS overall survival GTR gross total resection WHO World Health Organization PGB porphobilinogen CPOX coproporphyrinogen oxidase PPOX protoporphyrinogen oxidase PpIX protoporphyrin IX FECH ferrochelatase 2-HG 2-hydroxyglutarate FDA the U.S. Food and Drug Administration PRISMA Preferred Reporting Items for Systematic Reviews and Meta-Analysis GBM Glioblastoma LGGs low-grade gliomas MGMT O 6 CE contrast enhancement LOOCV leave-one-out cross-validation EOR extent of resection HO-1 heme oxygenase-1 TCA tricarboxylic acid cycle References 1. Louis D.N. Perry A. Wesseling P. Brat D.J. Cree I.A. Figarella-Branger D. Hawkins C. Ng H.K. Pfister S.M. Reifenberger G. The 2021 WHO Classification of Tumors of the Central Nervous System: A Summary Neuro-Oncol. 2021 23 1231 1251 10.1093/neuonc/noab106 34185076 PMC8328013 2. Jiang S. Zanazzi G.J. Hassanpour S. Predicting prognosis and IDH mutation status for patients with lower-grade gliomas using whole slide images Sci. Rep. 2021 11 16849 Available online: https://www.nature.com/articles/s41598-021-95948-x (accessed on 17 September 2025) 10.1038/s41598-021-95948-x 34413349 PMC8377095 3. Jakola A.S. Myrmel K.S. Kloster R. Torp S.H. Lindal S. Unsgård G. Solheim O. Comparison of a Strategy Favoring Early Surgical Resection vs a Strategy Favoring Watchful Waiting in Low-Grade Gliomas JAMA 2012 308 1881 1888 Available online: https://jamanetwork.com/journals/jama/fullarticle/1386639 (accessed on 17 September 2025) 10.1001/jama.2012.12807 23099483 4. Brown T.J. Brennan M.C. Li M. Church E.W. Brandmeir N.J. Rakszawski K.L. Patel A.S. Rizk E.B. Suki D. Sawaya R. Association of the Extent of Resection with Survival in Glioblastoma: A Systematic Review and Meta-analysis JAMA Oncol. 2016 2 1460 1469 Available online: https://jamanetwork.com/journals/jamaoncology/fullarticle/2528564 (accessed on 17 September 2025) 10.1001/jamaoncol.2016.1373 27310651 PMC6438173 5. Sanai N. Polley M.Y. McDermott M.W. Parsa A.T. Berger M.S. An extent of resection threshold for newly diagnosed glioblastomas J. Neurosurg. 2011 115 3 8 Available online: https://thejns.org/view/journals/j-neurosurg/115/1/article-p3.xml (accessed on 17 September 2025) 10.3171/2011.2.JNS10998 21417701 6. Roberts D.W. Valdés P.A. Harris B.T. Fontaine K.M. Hartov A. Fan X. Ji S. Lollis S.S. Pogue B.W. Leblond F. Coregistered fluorescence-enhanced tumor resection of malignant glioma: Relationships between δ-aminolevulinic acid-induced protoporphyrin IX fluorescence, magnetic resonance imaging enhancement, and neuropathological parameters J. Neurosurg. 2011 114 595 603 Available online: https://thejns.org/view/journals/j-neurosurg/114/3/article-p595.xml (accessed on 17 September 2025) 10.3171/2010.2.JNS091322 20380535 PMC2921008 7. Hadjipanayis C.G. Stummer W. 5-ALA and FDA approval for glioma surgery J. Neurooncol. 2019 141 479 486 Available online: https://link.springer.com/article/10.1007/s11060-019-03098-y (accessed on 17 September 2025) 10.1007/s11060-019-03098-y 30644008 PMC6445645 8. Rybaczek M. Chaurasia B. Advantage and challenges in the use of 5-Aminolevulinic acid (5-ALA) in neurosurgery Neurosurg. Rev. 2024 47 1 3 10.1007/s10143-024-02974-0 39349885 9. Stummer W. Pichlmeier U. Meinel T. Wiestler O.D. Zanella F. Reulen H.-J. ALA-Glioma Study Group Fluorescence-guided surgery with 5-aminolevulinic acid for resection of malignant glioma: A randomised controlled multicentre phase III trial Lancet Oncol. 2006 7 392 401 Available online: https://www.thelancet.com/journals/lanonc/article/PIIS1470-2045(06)70665-9/abstract (accessed on 17 September 2025) 10.1016/S1470-2045(06)70665-9 16648043 10. Dang L. White D.W. Gross S. Bennett B.D. Bittinger M.A. Driggers E.M. Fantin V.R. Jang H.G. Jin S. Keenan M.C. Cancer-associated IDH1 mutations produce 2-hydroxyglutarate Nature 2009 462 739 744 Erratum in Nature 2010 465 Available online: https://www.nature.com/articles/nature08617 (accessed on 17 September 2025) 10.1038/nature08617 19935646 PMC2818760 11. U.S. Food and Drug Administration FDA Approves Vorasidenib for Grade 2 Astrocytoma or Oligodendroglioma with a Susceptible IDH1 or IDH2 Mutation 2024 Available online: https://www.fda.gov/drugs/resources-information-approved-drugs/fda-approves-vorasidenib-grade-2-astrocytoma-or-oligodendroglioma-susceptible-idh1-or-idh2-mutation (accessed on 22 May 2025) 12. Mellinghoff I.K. Bent M.J.V.D. Blumenthal D.T. Touat M. Peters K.B. Clarke J. Mendez J. Yust-Katz S. Welsh L. Mason W.P. Vorasidenib in IDH1- or IDH2-Mutant Low-Grade Glioma N. Engl. J. Med. 2023 389 589 601 Available online: https://www.nejm.org/doi/full/10.1056/NEJMoa2304194 (accessed on 17 September 2025) 10.1056/NEJMoa2304194 37272516 PMC11445763 13. Mellinghoff I.K. Lu M. Wen P.Y. Taylor J.W. Maher E.A. Arrillaga-Romany I. Peters K.B. Ellingson B.M. Rosenblum M.K. Chun S. Vorasidenib and ivosidenib in IDH1-mutant low-grade glioma: A randomized, perioperative phase 1 trial Nat. Med. 2023 29 615 622 Available online: https://www.nature.com/articles/s41591-022-02141-2 (accessed on 17 September 2025) 10.1038/s41591-022-02141-2 36823302 PMC10313524 14. Bianconi A. Bonada M. Zeppa P. Bruno F. La Cava P. Panico F. Rudà R. Melcarne A. Garbossa D. Cofano F. Double fluorescence-guided surgery with 5-ALA and fluorescein sodium in grade 2 and grade 3 adult-type diffuse gliomas: Retrospective analysis of 112 cases Brain Spine. 2025 5 104277 10.1016/j.bas.2025.104277 40487874 PMC12145845 15. Specchia F.M.C. Monticelli M. Zeppa P. Bianconi A. Zenga F. Altieri R. Pugliese B. Di Perna G. Cofano F. Tartara F. Let Me See: Correlation between 5-ALA Fluorescence and Molecular Pathways in Glioblastoma: A Single Center Experience Brain Sci. 2021 11 795 10.3390/brainsci11060795 34208653 PMC8235669 16. Müther M. Jaber M. Johnson T.D. Orringer D.A. Stummer W. A Data-Driven Approach to Predicting 5-Aminolevulinic Acid–Induced Fluorescence and World Health Organization Grade in Newly Diagnosed Diffuse Gliomas Neurosurgery 2022 90 800 806 Available online: https://journals.lww.com/neurosurgery/fulltext/2022/06000/a_data_driven_approach_to_predicting.19.aspx (accessed on 17 September 2025) 10.1227/neu.0000000000001914 35285461 PMC9067086 17. Kim J.K. Jung T.Y. Jung S. Kim I.Y. Jang W.Y. Moon K.S. Kim S.K. Kim J.H. Lee K.H. Relationship between tumor cell infiltration 5-aminolevulinic acid fluorescence signals after resection of MR-enhancing lesions its prognostic significance in glioblastoma Clin. Transl. Oncol. 2021 23 459 467 10.1007/s12094-020-02438-z 32617871 18. Hickmann A.K. Nadji-Ohl M. Hopf N.J. Feasibility of fluorescence-guided resection of recurrent gliomas using five-aminolevulinic acid: Retrospective analysis of surgical and neurological outcome in 58 patients J. Neuro-Oncol. 2015 122 151 160 10.1007/s11060-014-1694-9 25557106 19. Ohba S. Murayama K. Kuwahara K. Pareira E.S. Nakae S. Nishiyama Y. Adachi K. Yamada S. Sasaki H. Yamamoto N. The Correlation of Fluorescence of Protoporphyrinogen IX and Status of Isocitrate Dehydrogenase in Gliomas Neurosurgery 2020 87 408 417 Available online: https://journals.lww.com/neurosurgery/abstract/2020/08000/the_correlation_of_fluorescence_of.29.aspx (accessed on 17 September 2025) 10.1093/neuros/nyz524 31833548 20. Zeppa P. De Marco R. Monticelli M. Massara A. Bianconi A. Di Perna G. Greco Crasto S. Cofano F. Melcarne A. Lanotte M.M. Fluorescence-Guided Surgery in Glioblastoma: 5-ALA, SF or Both? Differences between Fluorescent Dyes in 99 Consecutive Cases Brain Sci. 2022 12 555 10.3390/brainsci12050555 35624942 PMC9138621 21. Li Y.M. Suki D. Hess K. Sawaya R. The influence of maximum safe resection of glio-blastoma on survival in 1229 patients: Can we do better than gross-total resection? J. Neurosurg. 2016 124 977 988 10.3171/2015.5.JNS142087 26495941 22. Bianconi A. Bonada M. Zeppa P. Colonna S. Tartara F. Melcarne A. Garbossa D. Cofano F. How Reliable Is Fluorescence-Guided Surgery in Low-Grade Gliomas? A Systematic Review Concerning Different Fluorophores Cancers 2023 15 4130 10.3390/cancers15164130 37627158 PMC10452554 23. Xu W. Yang H. Liu Y. Yang Y. Wang P. Kim S.H. Ito S. Yang C. Wang P. Xiao M.T. Oncometabolite 2-hydroxyglutarate is a competitive inhibitor of α-ketoglutarate-dependent dioxygenases Cancer Cell 2011 19 17 30 10.1016/j.ccr.2010.12.014 21251613 PMC3229304 24. Turcan S. Rohle D. Goenka A. Walsh L.A. Fang F. Yilmaz E. Campos C. Fabius A.W.M. Lu C. Ward P.S. IDH1 mutation is sufficient to establish the glioma hypermethylator phenotype Nature 2012 483 479 483 10.1038/nature10866 22343889 PMC3351699 25. Rohle D. Popovici-Muller J. Palaskas N. Turcan S. Grommes C. Campos C. Tsoi J. Clark O. Oldrini B. Komisopoulou E. An Inhibitor of Mutant IDH1 Delays Growth and Promotes Differentiation of Glioma Cells Science 2013 340 626 630 Available online: https://www.science.org/doi/10.1126/science.1236062 (accessed on 17 September 2025) 10.1126/science.1236062 23558169 PMC3985613 26. Traylor J.I. Pernik M.N. Sternisha A.C. McBrayer S.K. Abdullah K.G. Molecular and Metabolic Mechanisms Underlying Selective 5-Aminolevulinic Acid-Induced Fluorescence in Gliomas Cancers 2021 13 580 10.3390/cancers13030580 33540759 PMC7867275 27. Furth N. Cohen N. Spitzer A. Salame T.M. Dassa B. Mehlman T. Brandis A. Moussaieff A. Friedmann-Morvinski D. Castro M.G. Oncogenic IDH1 mut Proc. Natl. Acad. Sci. USA 2025 122 e2403862122 Available online: https://www.pnas.org/doi/10.1073/pnas.2403862122 (accessed on 17 September 2025) 10.1073/pnas.2403862122 39793065 PMC11725805 28. Yan H. Parsons D.W. Jin G. McLendon R. Rasheed B.A. Yuan W. Kos I. Batinic-Haberle I. Jones S. Riggins G.J. IDH1 and IDH2 mutations in gliomas N. Engl. J. Med. 2009 360 765 773 Available online: https://www.nejm.org/doi/full/10.1056/NEJMoa0808710 (accessed on 17 September 2025) 10.1056/NEJMoa0808710 19228619 PMC2820383 29. Widhalm G. Kiesel B. Woehrer A. Traub-Weidinger T. Preusser M. Marosi C. Prayer D. Hainfellner J.A. Knosp E. Wolfsberger S. 5-Aminolevulinic acid induced fluorescence is a powerful intraoperative marker for precise histopathological grading of gliomas with non-significant contrast-enhancement PLoS ONE 2013 8 e76988 Available online: https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0076988 (accessed on 17 September 2025) 10.1371/journal.pone.0076988 24204718 PMC3800004 30. Valdés P.A. Jacobs V. Harris B.T. Wilson B.C. Leblond F. Paulsen K.D. Roberts D.W. Quantitative fluorescence using 5-aminolevulinic acid–induced protoporphyrin IX as a surgical adjunct in low-grade glioma surgery J. Neurosurg. 2015 123 771 780 Available online: https://thejns.org/view/journals/j-neurosurg/123/3/article-p771.xml (accessed on 17 September 2025) 10.3171/2014.12.JNS14391 26140489 PMC4646619 Figure 1 PRISMA flow diagram illustrating the study selection process for the systematic literature review. Figure 2 Schematic overview of the heme biosynthesis pathway, illustrating the enzymatic conversion of 5-ALA to protoporphyrin IX (PpIX) via cytosolic and mitochondrial intermediates. Created with BioRender.com. https://BioRender.com/dv7t31k Figure 3 Comparison of physiological TCA cycle activity under wildtype IDH conditions with the reprogrammed metabolic flux in IDH-mutant cells, highlighting the neomorphic conversion of α-ketoglutarate to 2-hydroxyglutarate (2-HG) catalyzed by mutant IDH enzymes. Created with BioRender.com. https://BioRender.com/swpyo6h Figure 4 Compartment-specific effects of mutant IDH1- and IDH2-driven 2-hydroxyglutarate (2-HG) accumulation, illustrating distinct cytoplasmic and mitochondrial molecular disruptions, including epigenetic reprogramming, redox imbalance, and impaired biosynthetic processes. Created with BioRender.com. https://BioRender.com/72aqrdl Figure 5 ( A B https://BioRender.com/hom3680 cancers-17-03075-t001_Table 1 Table 1 Characteristics of the included studies.  Bianconi et al., 2025 [ 14 Specchia et al., 2021 [ 15 Muther et al., 2022 [ 16 Kim et al., 2021 [ 17 Hickmann et al., 2015 [ 18 Ohba et al., 2020 [ 19 Zeppa et al., 2022 [ 20  Study methodology Retrospective single-center cohort study Retrospective study Retrospective single-center cohort study Retrospective single-center study Retrospective controlled cohort study Retrospective observational study Retrospective single-center cohort study  Study group 112 patients: 69 IDH-mutant astrocytomas (28 WHO G2, 41 WHO G3). 43 IDH-mutant oligodendrogliomas (24 WHO G2, 19 WHO G3) 44 GBM patients 179 patients: Final study cohort: 25 patients GBM IDH-wildtype 5-ALA group: 58 104 patients, (68 underwent initial surgery, 36 were reoperated) 99 GBM patients  5-ALA fluorescence rate - WHO G4 Not included IDH-mutant Not included Pink ( n n Fluorescence in 36/38 (94.7%) Fluorescence in 57/59 100%  5-ALA fluorescence rate - WHO G3 43.3% (26/60) --- 75–85% Not included 17/25 (68.0%) 20/26 (76.9%) ---  5-ALA fluorescence rate - WHO G2 25.0% (15/60) --- 16–20% Not included Not reported 5/19 (26.3%) ---  Association with IDH mutations No significant correlation between IDH mutation status and fluorescence ( p Grade 2 in 66.7% p Fluorescence did not significantly correlate with IDH mutation status ( p Study focused exclusively on IDH-wildtype GBM 100% of non-fluorescent tumors were IDH-mutant, vs. 48.9% of fluorescent tumors ( p IDH mutations were present in 35.6% of tumors (37/104), fluorescence was significantly lower in IDH-mutant tumors compared to IDH-wildtype across all WHO grades (51.4% vs. 94.0%, p all cases IDH–wildtype  Impact on surgical resection Gross total resection (GTR) achieved in 71% (80/112); fluorescence was not significantly correlated with extent of resection GTR rate not directly assessed GTR rate not directly assessed No correlation between residual fluorescence and tumor infiltration Complete resection (EOR ≥ 98%) was achieved in: 58.8% of fluorescent cases, 50% of non-fluorescent cases (not significant, p Not reported ≥90% extent of resection: 87.5% (5-ALA), 77.3% (SF), 80% (combined); no significant difference ( p  Fluorescence technology/ surgical equipment Leica M530 OHX microscope with FL400 (5-ALA) and FL560 (FS) filters Pentero Zeiss Microscope with a proper UV 400 nm filter Zeiss Meditech Pentero, Zeiss Pentero 900, both equipped with BLUE400 module Zeiss BLUE400 filter system Blue light operating microscope with BLUE400 module Pentero surgical microscope (Carl Zeiss Meditec, Germany) with the BLUE400 module Operating microscopes with dedicated fluorescence filters (5-ALA and SF); specific device not reported.  Long-term outcomes 5-ALA positivity associated with ~2.5-fold higher risk of shorter OS ( p p p Not reported Not reported Median PFS: 12.5 ± 2.1 months PFS: 5-ALA group: 10.7 months p Not reported Median OS: 20.0 months (5-ALA), 12.3 months (SF), 18.1 months (combined); overall cohort median OS 14.9 months; no significant differences  Study limitations Lack of quantitative fluorescence assessment, no standardized grading of fluorescence intensity No quantitative fluorescence assessment, Lack of outcome data Small sample size, Subjective fluorescence assessment, no histological confirmation of residual fluorescent areas Relatively small sample size, especially for subgroup analyses. Lack of outcome data Limited generalizability (IDH-wildtype GBM only), small subgroup sizes ",
  "metadata": {
    "Title of this paper": "Quantitative fluorescence using 5-aminolevulinic acid–induced protoporphyrin IX as a surgical adjunct in low-grade glioma surgery",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469012/"
  }
}