{
  "title": "Paper_208",
  "abstract": "pmc JCI Insight JCI Insight 3101 jciinsight JCI Insight JCI Insight 2379-3708 American Society for Clinical Investigation PMC12487850 PMC12487850.1 12487850 12487850 40773292 10.1172/jci.insight.194497 194497 1 Clinical Research and Public Health Longitudinal single-cell analysis of glucagon-like peptide-2 treatment in patients with short bowel syndrome Kudo Yumi marineblue.0721@gmail.com 1 https://orcid.org/0000-0001-5302-2607 Miyamoto Kentaro k.miyamoto@miyarisan.com 2 3 Suzuki Shohei sho-suzuki-entero@keio.jp 2 Chida Akihiko akihiko.chida.214@gmail.com 2 Tojo Anna anpanna.live.s.42@gmail.com 2 4 Hasegawa Mai maishibata@keio.jp 2 Shigehara Arina arinashigehara@gmail.com 2 Koya Ikuko ikuko.koya@riken.jp 5 Ando Yoshinari yoshinari.ando@riken.jp 5 Sato Masayasu aikidomasa@gmail.com 1 Kondo Aya ayakondo522@keio.jp 1 Kumagai Tomoko kumagai1311m@keio.jp 1 Deguchi Harunori haru999222999@gmail.com 1 Sugiyama Yoshiki yoshi24@keio.jp 1 Ito Yoko yoko.i@keio.jp 1 Shirosaki Koji k.shirosaki@keio.jp 1 Yamagishi Satoko syamagishi@keio.jp 1 Maeda Yutaro maedayutaro@yahoo.co.jp 1 Kanamori Hiroki kanamori06@yahoo.co.jp 1 6 Kano Motohiro knmthr@keio.jp 1 Kato Mototoshi mototoshi77@keio.jp 1 Tsujikawa Hanako hanako@keio.jp 7 8 Yoshimatsu Yusuke yyyy1y8yyyy@gmail.com 2 Takabayashi Kaoru kaoru0902.a2.@keio.jp 4 Okabayashi Koji okabayashikoji@gmail.com 9 Kanai Takanori takagast@keio.jp 2 https://orcid.org/0000-0002-4516-5648 Hosoe Naoki hosenao@db3.so-net.ne.jp 4 Kato Motohiko motohikokato@keio.jp 4 Moody Jonathan jonathan.moody@riken.jp 5 Hon Chung-Chau chungchau.hon@riken.jp 5 Kuroda Tatsuo kuroda-t@keio.jp 1 10 Yamada Yohei yohei.z7@keio.jp 1 Fujino Akihiro a.fujino@keio.jp 1 Sujino Tomohisa tsujino1224@keio.jp 11 12 1 2 3 4 5 6 7 8 9 10 11 12 Address correspondence to: Tomohisa Sujino, Department of Multidimensional Analysis of Gastrointestinal Biology, School of Medicine, The Sakaguchi Laboratory, Keio University School of Medicine, 35 Shinanomachi, Shinjyuku-ku, Tokyo 160-8582, Japan. Phone: 81.3.3353.1211; Email: tsujino1224@keio.jp 7 8 2025 23 9 2025 10 18 498101 e194497 14 4 2025 31 7 2025 07 08 2025 02 10 2025 02 10 2025 © 2025 Kudo et al. 2025 Kudo et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://insight.jci.org/articles/view/194497 BACKGROUND Glucagon-like peptide-2 (GLP-2) analogs are used clinically to enhance nutrient absorption in patients with short bowel syndrome (SBS); however, the precise mechanism remains unclear. To address this, the study aimed to clarify the dynamics of intestinal epithelial cells and immune cells in patients with SBS treated with GLP-2 analogs. METHODS Five male patients diagnosed with SBS, all of whom received treatment with the GLP-2 analog teduglutide, were included in the study. We conducted longitudinal single-cell RNA sequencing (scRNA-Seq) analysis of intestinal tissue from patients with SBS over a year, integrating microbiome composition analysis. RESULTS After treatment, the α-diversity of the gut microbiome increased, indicating a more varied microbial environment. ScRNA-Seq analysis revealed a reduction of T helper 2 cells and an increase in regulatory T cells, suggesting a shift toward an immunoregulatory intestinal environment. Additionally, nutrient-absorbing enterocyte-Top2 and middle clusters expanded, enhancing the absorption capacity, whereas major histocompatibility complex class I/II–expressing enterocyte-Top1 cells declined, potentially modulating immune responses. CONCLUSION The study findings indicate that GLP-2 analogs reshape intestinal immunity and microbiota, fostering a less inflammatory environment while promoting nutrient uptake efficiency. These insights offer a deeper understanding of the role of GLP-2 analogs in gut adaptation and provide a foundation for refining clinical strategies for SBS treatment. FUNDING This work was supported by Sakaguchi Memorial Foundation, Grants-in-Aid from the Japanese Society for the Promotion of Science (JSPS) (21K18272, 23H03665, 23H02899, 23K27590, 25K22627, 23K08037), JST FOREST(21457195), and the Takeda Japan Medical Office Funded Research Grant 2022.  GLP-2 analogs induce nutrient-absorbing enterocyte clusters and immune suppressive cells with icreased alpha-diversity of microbiota in small intestine. Clinical Research Gastroenterology Drug therapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Glucagon-like peptide-2 (GLP-2) is an intestinal hormone crucial for maintaining gut health and function. It is derived from the pro-glucagon gene, which produces multiple peptides, including GLP-1 and GLP-2, primarily secreted by intestinal L cells ( 1 2 3 6 4 6 11 GLP-2 plays multiple roles in digestive function: (a) It promotes intestinal mucosal growth by stimulating cell proliferation and inhibiting apoptosis, thereby increasing the surface area for nutrient absorption. (b) It maintains intestinal barrier integrity and prevents harmful bacterial invasion. (c) It prolongs intestinal transit time, thereby optimizing nutrient digestion and absorption ( 12 15 16 21 Results GLP-2 analog therapy is effective for patients with SBS. This study enrolled 5 male patients diagnosed with SBS who were treated with the GLP-2 analog teduglutide ( Supplemental Table 1 https://doi.org/10.1172/jci.insight.194497DS1 Figure 1A After 12 months of teduglutide therapy, 4 of the 5 patients exhibited weight gain, with the exception of case 2 ( Figure 1B Figure 1, C and D Figure 1E Figure 1F Figure 1G Supplemental Figure 1 Supplemental Table 2 GLP-2 analog therapy enhances microbial diversity and functional capacity without uniform taxonomic shifts in SBS. We analyzed the composition of the intestinal microbiota at 0M, 6M, and 12M using 16S rRNA gene sequencing. The gut microbiota exhibited dynamic alterations throughout the treatment period. Principal coordinate analysis based on Bray-Curtis dissimilarity and weighted and unweighted UniFrac plot revealed marked interindividual variation, with no consistent clustering pattern across time points ( Figure 2A Supplemental Figure 2A Figure 2B The microbiota composition patterns varied across patients. Cases 1 and 3 exhibited a dominance of Proteobacteria at 0M and 6M, which decreased at 12M. Cases 2 and 4 initially harbored Firmicutes-dominant profiles, with a posttreatment increase in Bacteroides. Case 5 demonstrated transient Proteobacteria enrichment at 6M, followed by a shift in microbial community structure at 12M ( Figure 2C TM7x Porphyromonas Neisseria Peptostreptococcus Lachnoanerobaculum Parvimonas Gemella Limosilactobacillus Saccharopolyspora Romboutsia Lachnospiraceae HT002 Roseburia Reyranella A2 Aquabacterium Figure 2D To infer microbial functional potential, we performed PICRUSt2-based pathway prediction. The posttreatment (12M) microbiota tended to be enriched in several metabolic pathways, including nitrate reduction, pyrimidine deoxyribonucleotides de novo biosynthesis, O d Figure 2E Supplemental Figure 2B Single-cell transcriptomics reveals epithelial expansion and mucosal remodeling during GLP-2 therapy. To characterize cellular alterations in the small intestine during GLP-2 analog therapy, we conducted scRNA-Seq on intestinal biopsy samples collected at 0M, 6M, and 12M from cases 1, 2, 3, and 5. Case 4 was excluded because of dialysis-related fluctuations in dietary intake, which could confound quantitative assessments. Additionally, 12M samples from cases 2 and 5 were not available. Unsupervised clustering of transcriptomic data identified 19 distinct cell populations ( Figure 3A EPCAM + + CD3E PTPRC Figure 3B Figure 3C Supplemental Figure 2 Figure 3D Supplemental Figure 3 GLP-2 therapy modulates the intestinal immune cell landscape with selective changes in T cell subsets. To delineate changes in the immune cell landscape during GLP-2 analog therapy, we identified immune cells by PTPRC Figure 4A + + Figure 4B + + TRDC NCAM1 RORC MKI67 Supplemental Figure 4A Supplemental Figure 4 + Figure 4, C and D Supplemental Figure 4 + + GLP-2 analog treatment selectively expands Tregs and activates growth-associated signaling pathways in the CD4 + Single-cell transcriptomic profiling of CD4 + Figure 5A + CCR7 FOXP3 GATA3 RORC CXCR3 TBX21 + SLC4A10 KIT Figure 5B Supplemental Figure 5A Quantitative analysis revealed a consistent increase in the proportion of Tregs within the CD4 + Figure 5, C–E Supplemental Figure 5 Figure 5, F and G Supplemental Figure 5 + Diverse CD8 + Within the CD8 + Figure 6A CD69 ITGAE CD69 TGFB1 Figure 6B Supplemental Figure 6A While no single CD8 + Supplemental Figure 6 Figure 6, C and D + Figure 6, E and F + + GLP-2 therapy promotes nutrient-absorptive epithelial lineages while suppressing immune-associated enterocyte subtypes. We analyzed epithelial cells to assess changes following GLP-2 treatment and identified 7 distinct enterocyte clusters based on gene expression and zonation-specific markers ( 22 23 Figure 7, A–C Supplemental Figure 7 ALPI APOC3 APOA4 APOB SELENOP DGAT1 RBP2 GSTA1 GPX2 REG1A HEXIM1 SOX4 CSKMT DMBT1 PLCG2 TRPM5 IGF1R As expected, total epithelial cell numbers increased following GLP-2 treatment. Analysis of relative cluster proportions revealed a decrease in enterocyte-Top1 and an increase in enterocyte-Top2 posttreatment ( Figure 7, C and D Supplemental Figure 8 GO analysis indicated that enterocyte-Top1 was enriched in immune-related pathways, including T cell activation, leukocyte adhesion, and TCR signaling ( Supplemental Figure 8C Supplemental Figure 8D Figure 7E Supplemental Figure 9 Longitudinal gene expression profiling uncovers coordinated enhancement of absorptive function and barrier integrity in response to GLP-2. We next examined transcriptomic changes over the treatment period. Differential gene expression analysis showed significant upregulation of genes involved in differentiation ( KRT20 BNIP5 BIRC3 MUC13 MUC17 CD55 GLS TMC5 MYH14 ACTN4 Figure 8, A and B Supplemental Figure 10 Figure 8C Figure 8D To validate these functional shifts, we reassessed expression of key gene sets over time ( Figure 8E Supplemental Figure 11 In addition, we analyzed gene expression changes within the enterocyte-Top2 population over the treatment course ( Figure 9A MUC13 GCNT3 APOA4 PTPRR XKR9 PCLO RASAL2 Figure 9, B and C Figure 9D Figure 9E GPAT3 LPCAT3 PLA2G4A CHKA Figure 9F LPCAT3 CHKA PCYT1A Figure 9, G and H Figure 9H To further explore potential mediators of enterocyte-Top2 cell expansion, we conducted ligand–receptor interaction analysis using our single-cell transcriptomics dataset ( Figure 10, A–C To further dissect cellular crosstalk, we examined interactions between immune and nonimmune cell populations, including epithelial cells and CD34 + + Figure 11A + Figure 11B Supplemental Figure 12 Figure 11, C and D + Discussion GLP-2 analogs are clinically effective in promoting intestinal adaptation in patients with SBS, reducing dependence on parenteral nutrition. While their trophic effects on the intestinal mucosa are well established ( 17 18 Clinically, patients showed improvements in nutritional status, including weight gain, reduced parenteral support, and increased levels of citrulline and lipase, consistent with enhanced absorptive function. These improvements were accompanied by histological increases in villus height and crypt depth, reinforcing the known trophic effects of GLP-2 on mucosa. These physiological adaptations aligned with decreased stool output and reduced need for parenteral nutrition, underscoring the therapeutic impact of GLP-2 analog in SBS management. Despite clinical improvements, microbiome responses to GLP-2 analog were heterogeneous across the patients, echoing prior findings on interindividual variability in upper gastrointestinal microbiome composition ( 24 27 Immunologically, we observed an increase in Tregs and a concurrent decrease in Th2 cells across patients. This immunological shift likely reflects improved epithelial barrier function and reduced antigen exposure ( 28 30 31 39 40 41 42 43 54 Concurrently, scRNA-Seq of intestinal biopsies revealed that GLP-2 analog treatment promotes a shift toward absorptive phenotypes. Specifically, we observed expansion of enterocyte-Top2 and middle clusters enriched for genes involved in lipids, amino acids, and vitamin transport along with upregulation of barrier function markers ( 22 23 55 56 2 3 5 11 57 59 IGF1R 60 EGFR 61 64 This study has limitations. The sample size was small, was restricted to male patients, and lacked certain stromal and innate immune populations, such as fibroblasts, mesenchymal cells, and granulocytes. Additionally, ligand–receptor and pathway activity were inferred computationally and will require experimental validation. Nonetheless, the longitudinal single-cell approach provides a view of epithelial, immune, and microbial remodeling in human SBS during GLP-2 therapy. Despite these constraints, our longitudinal design and integrative single-cell approach offer a comprehensive view of the cellular ecosystem remodeling that occurs during GLP-2 therapy in humans. In conclusion, GLP-2 analog treatment in SBS orchestrated a coordinated remodeling of the intestinal ecosystem, promoting absorptive epithelial differentiation, regulatory immune adaptation, and SCFA-associated microbial function. These findings provide mechanistic insights into GLP-2–driven intestinal rehabilitation and may inform therapeutic strategies for malabsorptive and inflammatory intestinal disorders. Methods See the Supplemental Methods Sex as a biological variable. Our study involved 5 male participants due to the limited availability of eligible patients. However, the underlying mechanisms targeted in GLP-2 analog are conserved in female and used clinically in both male and female individuals, and thus the findings are expected to be relevant to both sexes. Statistics. All graphs show mean ± SD unless otherwise stated. P Study approval. All human samples were obtained from individuals providing written informed consent following protocols approved by the Keio University IRB. Data availability. All data are available in the main text or the supplemental material. Individual data points for each figure are available in the Supporting Data Values 16S-rRNA-Seq data are available on the NCBI BioProject with the entry number PRJDB20353. ScRNA-Seq data are available on the NCBI GEO with the entry number GSE294205 Author contributions YK, Y Yamada, and TS conceptualized and designed the study. Investigation was performed by YK, AC, AT, MH, AS, IK, YA, and SS (human tissue preparation and analysis) and MS, AK, T Kumagai, HD, YS, YI, KS, SY, YM, HK, M Kano, Mototoshi Kato, Y Yoshimatsu, KT, KO, T Kanai, NH, Motohiko Kato, T Kumagai and T Kuroda (clinical data analysis). YK and HT performed pathological data analysis. ScRNA-Seq and microbiome analyses, as well as data visualization, were conducted by YK and KM. Funding acquisition was carried out by Y Yamada and TS. AF, Y Yamada, and TS supervised the study. YK, KM, and TS wrote the original draft. Review and editing were performed by JM, CCH, AF, Y Yamada, and TS. All authors reviewed and approved the manuscript. Supplementary Material Supplemental data ICMJE disclosure forms Supporting data values We thank all the members of the Pediatric Surgery Department. This work was supported by Sakaguchi Memorial Foundation (to TS), Grants-in-Aid from the Japanese Society for the Promotion of Science (21K18272, 23H03665, 23H02899, 23K27590, 25K22627 to TS; 23K08037 to Y Yamada), JST FOREST (21457195 to TS), and the Takeda Japan Medical Office Funded Research Grant 2022 to Y Yamada. Conflict of interest: Copyright: Reference information: JCI Insight 1 Orskov C et al Glucagon-like peptides GLP-1 and GLP-2, predicted products of the glucagon gene, are secreted separately from pig small intestine but not pancreas Endocrinology 1986 119 4 1467 1475 10.1210/endo-119-4-1467 3530719 2 Dube PE et al The essential role of insulin-like growth factor-1 in the intestinal tropic effects of glucagon-like peptide-2 in mice Gastroenterology 2006 131 2 589 605 10.1053/j.gastro.2006.05.055 16890611 3 Rowland KJ et al Loss of glucagon-like peptide-2-induced proliferation following intestinal epithelial insulin-like growth factor-1-receptor deletion Gastroenterology 2011 141 6 2166 2175 10.1053/j.gastro.2011.09.014 21925122 4 Burrin DG et al Glucagon-like peptide 2 dose-dependently activates intestinal cell survival and proliferation in neonatal piglets Endocrinology 2005 146 1 22 32 10.1210/en.2004-1119 15486229 5 Fesler Z et al GLP-2, EGF, and the intestinal epithelial IGF-1 receptor interactions in the regulation of crypt cell proliferation Endocrinology 2020 161 4 bqaa040 10.1210/endocr/bqaa040 32147716 PMC7098877 6 Burrin DG et al GLP-2 rapidly activates divergent intracellular signaling pathways involved in intestinal cell survival and proliferation in neonatal piglets Am J Physiol Endocrinol Metab 2007 292 1 E281 E291 10.1152/ajpendo.00129.2006 16954336 7 Munroe DG et al Prototypic G protein-coupled receptor for the intestinotrophic factor glucagon-like peptide 2 Proc Natl Acad Sci U S A 1999 96 4 1569 1573 10.1073/pnas.96.4.1569 9990065 PMC15520 8 Tsai CH et al Biological determinants of intestinotrophic properties of GLP-2 in vivo Am J Physiol 1997 272 3 pt 1 G662 G668 10.1152/ajpgi.1997.272.3.G662 9124589 9 Tsai CH et al Intestinal growth-promoting properties of glucagon-like peptide-2 in mice Am J Physiol 1997 273 1 pt 1 E77 E84 10.1152/ajpendo.1997.273.1.E77 9252482 10 Drucker DJ et al Induction of intestinal epithelial proliferation by glucagon-like peptide 2 Proc Natl Acad Sci U S A 1996 93 15 7911 7916 10.1073/pnas.93.15.7911 8755576 PMC38848 11 Bahrami J et al ErbB activity links the glucagon-like peptide-2 receptor to refeeding-induced adaptation in the murine small bowel Gastroenterology 2010 138 7 2447 2456 10.1053/j.gastro.2010.03.006 20226187 12 Benjamin MA et al Glucagon-like peptide-2 enhances intestinal epithelial barrier function of both transcellular and paracellular pathways in the mouse Gut 2000 47 1 112 119 10.1136/gut.47.1.112 10861272 PMC1727982 13 Furness JB et al The gut as a sensory organ Nat Rev Gastroenterol Hepatol 2013 10 12 729 740 10.1038/nrgastro.2013.180 24061204 14 Drucker DJ Yusta B Physiology and pharmacology of the enteroendocrine hormone glucagon-like peptide-2 Annu Rev Physiol 2014 76 561 583 10.1146/annurev-physiol-021113-170317 24161075 15 Guan X et al GLP-2 receptor in POMC neurons suppresses feeding behavior and gastric motility Am J Physiol Endocrinol Metab 2012 303 7 E853 E864 10.1152/ajpendo.00245.2012 22829581 PMC3469617 16 Boushey RP et al Glucagon-like peptide 2 decreases mortality and reduces the severity of indomethacin-induced murine enteritis Am J Physiol 1999 277 5 E937 E947 10.1152/ajpendo.1999.277.5.E937 10567023 17 Jeppesen PB et al Glucagon-like peptide 2 improves nutrient absorption and nutritional status in short-bowel patients with no colon Gastroenterology 2001 120 4 806 815 10.1053/gast.2001.22555 11231933 18 Jeppesen PB et al Randomised placebo-controlled trial of teduglutide in reducing parenteral nutrition and/or intravenous fluid requirements in patients with short bowel syndrome Gut 2011 60 7 902 914 10.1136/gut.2010.218271 21317170 PMC3112364 19 Tavakkolizadeh A et al Glucagon-like peptide 2: a new treatment for chemotherapy-induced enteritis J Surg Res 2000 91 1 77 82 10.1006/jsre.2000.5917 10816354 20 Kaji T et al Temporal changes in the intestinal growth promoting effects of glucagon-like peptide 2 following intestinal resection J Surg Res 2009 152 2 271 280 10.1016/j.jss.2008.05.007 19062041 21 Koopmann MC et al Exogenous glucagon-like peptide-2 (GLP-2) augments GLP-2 receptor mRNA and maintains proglucagon mRNA levels in resected rats JPEN J Parenter Enteral Nutr 2008 32 3 254 265 10.1177/0148607108316198 18443137 PMC3631545 22 Harnik Y et al A spatial expression atlas of the adult human proximal small intestine Nature 2024 632 8027 1101 1109 10.1038/s41586-024-07793-3 39112711 23 Moor AE et al Spatial reconstruction of single enterocytes uncovers broad zonation along the intestinal villus axis Cell 2018 175 4 1156 1167 10.1016/j.cell.2018.08.063 30270040 24 Cani PD et al Changes in gut microbiota control inflammation in obese mice through a mechanism involving GLP-2-driven improvement of gut permeability Gut 2009 58 8 1091 1103 10.1136/gut.2008.165886 19240062 PMC2702831 25 Madsen MSA et al Metabolic and gut microbiome changes following GLP-1 or dual GLP-1/GLP-2 receptor agonist treatment in diet-induced obese mice Sci Rep 2019 9 1 15582 10.1038/s41598-019-52103-x 31666597 PMC6821799 26 Kayashima A et al Unique bile acid profiles in the bile ducts of patients with primary sclerosing cholangitis Hepatol Commun 2024 8 6 e0452 10.1097/HC9.0000000000000452 38780302 PMC11124737 27 Kubosawa Y et al Distinctive duodenal microbiomes and bile acid profiles in duodenal tumor patients revealed by prospective observational study Sci Rep 2024 14 1 18705 10.1038/s41598-024-69820-7 39134638 PMC11319767 28 Rath E Haller D Intestinal epithelial cell metabolism at the interface of microbial dysbiosis and tissue injury Mucosal Immunol 2022 15 4 595 604 10.1038/s41385-022-00514-x 35534699 PMC9259489 29 Hammad H Lambrecht BN Barrier epithelial cells and the control of type 2 immunity Immunity 2015 43 1 29 40 10.1016/j.immuni.2015.07.007 26200011 30 Noval Rivas M et al Regulatory T cell reprogramming toward a Th2-cell-like lineage impairs oral tolerance and promotes food allergy Immunity 2015 42 3 512 523 10.1016/j.immuni.2015.02.004 25769611 PMC4366316 31 Arpaia N et al Metabolites produced by commensal bacteria promote peripheral regulatory T-cell generation Nature 2013 504 7480 451 455 10.1038/nature12726 24226773 PMC3869884 32 Atarashi K et al Treg induction by a rationally selected mixture of Clostridia strains from the human microbiota Nature 2013 500 7461 232 236 10.1038/nature12331 23842501 33 Yoshimatsu Y et al Aryl hydrocarbon receptor signals in epithelial cells govern the recruitment and location of Helios + Cell Rep 2022 39 6 110773 10.1016/j.celrep.2022.110773 35545035 34 Miyamoto K et al The gut microbiota-induced kynurenic acid recruits GPR35-positive macrophages to promote experimental encephalitis Cell Rep 2023 42 8 113005 10.1016/j.celrep.2023.113005 37590143 35 Miyamoto K et al The tryptophan metabolic pathway of the microbiome and host cells in health and disease Int Immunol 2024 36 12 601 616 10.1093/intimm/dxae035 38869080 PMC11562643 36 Mucida D et al Retinoic acid can directly promote TGF-beta-mediated Foxp3(+) Treg cell conversion of naive T cells Immunity 2009 30 4 471 472 10.1016/j.immuni.2009.03.008 19371709 PMC2864308 37 Sato Y et al Novel bile acid biosynthetic pathways are enriched in the microbiome of centenarians Nature 2021 599 7885 458 464 10.1038/s41586-021-03832-5 34325466 38 Lim SA et al Lipid signalling enforces functional specialization of T reg Nature 2021 591 7849 306 311 10.1038/s41586-021-03235-6 33627871 PMC8168716 39 Pompura SL et al Oleic acid restores suppressive defects in tissue-resident FOXP3 Tregs from patients with multiple sclerosis J Clin Invest 2021 131 2 e138519 10.1172/JCI138519 33170805 PMC7810477 40 Nelson DW et al Localization and activation of glucagon-like peptide-2 receptors on vagal afferents in the rat Endocrinology 2007 148 5 1954 1962 10.1210/en.2006-1232 17234710 41 DiToro D et al Insulin-like growth factors are key regulators of T helper 17 regulatory T cell balance in autoimmunity Immunity 2020 52 4 650 667 10.1016/j.immuni.2020.03.013 32294406 PMC8078727 42 Huang Y et al Differential expression of insulin-like growth factor type 1 receptor identifies heterogeneous intrahepatic regulatory T subsets in mouse hepatocellular carcinoma Clin Exp Immunol 2022 208 1 47 59 10.1093/cei/uxac011 35560184 PMC9113327 43 Sujino T et al Regulatory T cells suppress development of colitis, blocking differentiation of T-helper 17 into alternative T-helper 1 cells Gastroenterology 2011 141 3 1014 1023 10.1053/j.gastro.2011.05.052 21699791 44 Sujino T et al Tissue adaptation of regulatory and intraepithelial CD4+ T cells controls gut inflammation Science 2016 352 6293 1581 1586 10.1126/science.aaf3892 27256884 PMC4968079 45 Ono K et al Downregulation of chemokine receptor 9 facilitates CD4 + + Nat Commun 2023 14 1 5152 10.1038/s41467-023-40950-2 37620389 PMC10449822 46 Lockhart A et al Dietary protein shapes the profile and repertoire of intestinal CD4+ T cells J Exp Med 2023 220 8 e20221816 10.1084/jem.20221816 37191720 PMC10192604 47 Canesso MCC et al Identification of antigen-presenting cell-T cell interactions driving immune responses to food Science 2025 387 6739 eado5088 10.1126/science.ado5088 39700315 PMC12017586 48 Aparicio-Domingo P et al Type 3 innate lymphoid cells maintain intestinal epithelial stem cells after tissue damage J Exp Med 2015 212 11 1783 1791 10.1084/jem.20150318 26392223 PMC4612094 49 Spits H Cupedo T Innate lymphoid cells: emerging insights in development, lineage relationships, and function Annu Rev Immunol 2012 30 647 675 10.1146/annurev-immunol-020711-075053 22224763 50 Hanash AM et al Interleukin-22 protects intestinal stem cells from immune-mediated tissue damage and regulates sensitivity to graft versus host disease Immunity 2012 37 2 339 350 10.1016/j.immuni.2012.05.028 22921121 PMC3477611 51 Artis D Spits H The biology of innate lymphoid cells Nature 2015 517 7534 293 301 10.1038/nature14189 25592534 52 Romera-Hernandez M et al Yap1-driven intestinal repair is controlled by group 3 innate lymphoid cells Cell Rep 2020 30 1 37 45 10.1016/j.celrep.2019.11.115 31914395 53 Castellanos JG Longman RS The balance of power: innate lymphoid cells in tissue inflammation and repair J Clin Invest 2019 129 7 2640 2650 10.1172/JCI124617 31180335 PMC6597213 54 Diefenbach A et al Innate lymphoid cell-epithelial cell modules sustain intestinal homeostasis Immunity 2020 52 3 452 463 10.1016/j.immuni.2020.02.016 32187516 55 Shao L et al Non-classical MHC class I molecules on intestinal epithelial cells: mediators of mucosal crosstalk Immunol Rev 2005 206 160 176 10.1111/j.0105-2896.2005.00295.x 16048548 56 Heuberger C et al Why do intestinal epithelial cells express MHC class II? Immunology 2021 162 4 357 367 10.1111/imm.13270 32966619 PMC7968399 57 Orskov C et al GLP-2 stimulates colonic growth via KGF, released by subepithelial myofibroblasts with GLP-2 receptors Regul Pept 2005 124 1–3 105 112 10.1016/j.regpep.2004.07.009 15544847 58 Ramsanahie A et al Effect of GLP-2 on mucosal morphology and SGLT1 expression in tissue-engineered neointestine Am J Physiol Gastrointest Liver Physiol 2003 285 6 G1345 G1352 10.1152/ajpgi.00374.2002 12919941 59 Chen ME et al Glucagon-like peptide-2 stimulates S-phase entry of intestinal Lgr5+ stem cells Cell Mol Gastroenterol Hepatol 2022 13 6 1829 1842 10.1016/j.jcmgh.2022.02.011 35218981 PMC9123588 60 Zheng Y et al Intestinal epithelial cell-specific IGF1 promotes the expansion of intestinal stem cells during epithelial regeneration and functions on the intestinal immune homeostasis Am J Physiol Endocrinol Metab 2018 315 4 E638 E649 10.1152/ajpendo.00022.2018 29783855 61 Lupo B et al Colorectal cancer residual disease at maximal response to EGFR blockade displays a druggable Paneth cell-like phenotype Sci Transl Med 2020 12 555 eaax8313 10.1126/scitranslmed.aax8313 32759276 PMC7617202 62 Zhang X et al Elevating EGFR-MAPK program by a nonconventional Cdc42 enhances intestinal epithelial survival and regeneration JCI Insight 2020 5 16 e135923 10.1172/jci.insight.135923 32686657 PMC7455142 63 Basak O et al Induced quiescence of Lgr5+ stem cells in intestinal organoids enables differentiation of hormone-producing enteroendocrine cells Cell Stem Cell 2017 20 2 177 190 10.1016/j.stem.2016.11.001 27939219 64 Gehart H Clevers H Tales from the crypt: new insights into intestinal stem cells Nat Rev Gastroenterol Hepatol 2019 16 1 19 34 10.1038/s41575-018-0081-y 30429586 Version 1 08/07/2025 In-Press Preview Version 2 09/23/2025 Electronic publication Figure 1 GLP-2 analog is effective for patients with SBS. ( A B D B D C E F G t B F G Figure 2 GLP-2 analog therapy enhances microbial diversity and functional capacity without uniform taxonomic shifts in SBS. ( A B C D E x P A B E Figure 3 Single-cell transcriptomics reveals epithelial expansion and mucosal remodeling during GLP-2 therapy. ( A B C D Figure 4 GLP-2 therapy modulates the intestinal immune cell landscape with selective changes in T cell subsets. ( A PTPRC B C D Figure 5 GLP-2 analog treatment selectively expands Tregs and activates growth-associated signaling pathways in the CD4 + ( A + CD4 B + C D + E F y P q G y P q F G F G P t E F G Figure 6 Diverse CD8 + ( A + CD8A CD8B B + C D + E y P q F y P q E F E F P E F Figure 7 GLP-2 therapy promotes nutrient-absorptive epithelial lineages while suppressing immune-associated enterocyte subtypes. ( A EPCAM B C D E Z Figure 8 Longitudinal gene expression profiling uncovers coordinated enhancement of absorptive function and barrier integrity in response to GLP-2. ( A x y P P –10 B P q P C D C D C D P q C P q D P E Z B D C D E Figure 9 Longitudinal gene expression analysis of enterocyte-Top2 cluster reveals functional reprogramming in response to GLP-2. ( A x y P P B C Z A B C D E D E P q P F G H Z G H D E D E B C G H Figure 10 Changes in ligand–receptor interactions between clusters reveal enhanced intercellular communication following GLP-2 analog treatment. ( A C A B C Figure 11 GLP-2 analog treatment enhances communication between epithelial, immune, and CD34 + ( A D A B D C ",
  "metadata": {
    "Title of this paper": "Tales from the crypt: new insights into intestinal stem cells",
    "Journal it was published in:": "JCI Insight",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487850/"
  }
}