{
  "title": "Paper_619",
  "abstract": "Head Neck Pathol Head Neck Pathol 956 hnpath Head and Neck Pathology 1936-055X 1936-0568 Springer PMC11442710 PMC11442710.1 11442710 11442710 39347880 10.1007/s12105-024-01696-5 1696 1 Case Report Striated Duct Adenoma: A Case Report and a Scoping Review https://orcid.org/0000-0001-6182-9232 Martins-Chaves Roberta Rayra roberta.chaves@cienciasmedicasmg.edu.br 1 3 https://orcid.org/0000-0002-0630-0966 Avelar Maria Clara Martins 1 https://orcid.org/0009-0003-6108-5335 Ferreira Artur Luiz Dias 1 https://orcid.org/0009-0000-9143-1241 de Almeida Angellica Pereira 1 https://orcid.org/0009-0009-4037-0245 Gomes Gabriel Vasconcellos Sabido 1 https://orcid.org/0000-0002-7276-9500 Neves Pedro Lobo Alcântra 2 https://orcid.org/0000-0002-6657-4547 Fonseca Felipe Paiva 3 https://orcid.org/0000-0001-8770-8009 Gomez Ricardo Santiago ricardosgomez@outlook.com professor@ricardogomez.com.br 1 3 1 https://ror.org/01p7p3890 grid.419130.e 0000 0004 0413 0953 Faculty of Medical Sciences of Minas Gerais, 2 https://ror.org/04q9me654 grid.466673.6 Technical Manager of the Pathology Laboratory at Hermes Pardini, Fleury Group, 3 https://ror.org/0176yjw32 grid.8430.f 0000 0001 2181 4888 Department of Oral Surgery and Pathology, School of Dentistry, Universidade Federal de Minas Gerais, 30 9 2024 12 2024 18 1 453710 90 13 6 2024 28 8 2024 30 09 2025 30 09 2025 10 01 2025 30 09 2025 © The Author(s), under exclusive licence to Springer Science+Business Media, LLC, part of Springer Nature 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Introduction Striated duct adenoma (SDA) is a rare benign salivary gland tumor with a recently described genetic signature. Recurrent oncogenic mutations affecting the IDH2 IDH1/2 https://osf.io/7mztg Conclusion Awareness of the clinicopathological features and the use of IDH1/2 Supplementary Information The online version contains supplementary material available at 10.1007/s12105-024-01696-5. Keywords Striated duct adenoma IDH2 Immunohistochemistry Diagnosis Review of reported cases pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2024 ",
  "metadata": {
    "Title of this paper": "Striated Duct Adenoma: A Case Report and a Scoping Review",
    "Journal it was published in:": "Head and Neck Pathology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11442710/"
  }
}