{
  "title": "Paper_671",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12476081 PMC12476081.1 12476081 12476081 41018418 10.7759/cureus.91171 1 Pulmonology Allergy/Immunology Intravesical Bacillus Calmette-Guérin (BCG) Immunotherapy-Related Pneumonitis: A Case Report Muacevic Alexander Adler John R Gullu Arslan Nevra 1 Aksakal Sengul 2  1  2 Nevra Gullu Arslan nevragullu@hotmail.com 28 8 2025 8 2025 17 8 494304 e91171 22 8 2025 28 08 2025 28 09 2025 29 09 2025 Copyright © 2025, Gullu Arslan et al. 2025 Gullu Arslan et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/386600-intravesical-bacillus-calmette-gurin-bcg-immunotherapy-related-pneumonitis-a-case-report Intravesical bacillus Calmette-Guérin (BCG) immunotherapy is widely used as a standard adjuvant treatment for non-muscle invasive bladder cancer. The exact mechanism of BCG action and the mechanisms responsible for early and late complications after intravesical BCG treatment remain poorly understood, and it is still unclear in which patients local or systemic adverse effects will develop. The patient who received intravesical BCG treatment for six weeks presented with complaints of arthralgia, loss of appetite, fatigue, and intermittent low-grade fever. High-resolution chest computed tomography showed bilateral ground-glass opacities and showed no response to antiviral or antimicrobial treatments. Bronchoalveolar lavage flow cytometry demonstrated a markedly elevated CD4/CD8 ratio (6:1). Based on clinical, radiologic, and immunologic findings, pneumonitis secondary to BCG-related inflammation (BCG-itis) was diagnosed. Differentiating infectious from immune-mediated adverse events in BCG-itis can be challenging. bronchoalveolar lavage cd4 t cells complication intravesical bcg pneumonitis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Bacillus Calmette-Guérin (BCG), a live attenuated strain of Mycobacterium bovis 1 2 3 4 Local complications, such as cystitis, urinary frequency, hematuria, incontinence, spinal tuberculosis, or systemic effects such as malaise, fever, hepatitis, purpura, and septicemia, occur in about 8% of cases. Pneumonitis after intravesical BCG affects fewer than 1% of patients [ 5 6 7 Diagnosing BCG-related complications is challenging, as culture or histological confirmation is often lacking. Therefore, a history of BCG therapy is essential to avoid delays in diagnosis. Understanding BCG’s immunological effects may clarify the mechanisms behind its side effects. Based on the findings recorded in this case, we aimed to evaluate the immune mechanisms that may cause BCG-associated pneumonitis. Case presentation An 80-year-old male patient presented to an external infectious disease clinic with complaints of fatigue, loss of appetite, intermittent vomiting, and diffuse joint pain lasting for two weeks. He had a known history of hypertension and had been receiving intravesical BCG therapy for bladder cancer for the past six weeks. Physical examination was unremarkable. Chest X-ray was unremarkable (Figure 1A Figure 1 Chest X-ray. (A) Normal posteroanterior chest radiograph in first application. (B) Bilateral basal heterogeneous infiltrates In the patient’s initial hospitalization, during laboratory tests, creatinine, C-reactive protein, sedimentation, and gamma-glutamyl transferase (GGT) values were elevated (Table 1 Table 1 Laboratory findings. ALT: alanine transaminase; AST: aspartate aminotransferase; CRP: C-reactive protein; GGT: gamma-glutamyl transferase; WBC: white blood cell Laboratory value Normal range Initial Follow-up Creatinine 0.7-1.2 mg/dL 1.3 0.9 WBC 4-11 x 10 3 3 8.69 7.8 AST 0-33 U/L 30 31 ALT 0-45 U/L 32 71 GGT 5-36 U/L 231 110 CRP 0-0.5 mg/dL 8.5 2.6 Sedimentation 0-15/20 mm/h 59 48 Due to intermittent fever, the patient was admitted for infectious disease evaluation. Empiric antiviral and quinolone treatments were started despite negative cultures. Persistent low-grade fever and unchanged acute phase reactants prompted a chest X-ray showing bilateral diffuse reticular infiltrates (Figure 1B At admission, the patient still had fatigue and arthralgia; vital signs were stable, with rare crackles in the lung bases. High-resolution chest CT showed bilateral patchy ground-glass opacities (Figure 2 1 Figure 2 Thorax computed tomography. (A-D) Bilateral patchy ground-glass infiltrates Bronchoalveolar lavage (BAL) was performed in the right middle lobe. Microbiological studies, including bacterial cultures, acid-fast bacilli (AFB) smear and culture, tuberculosis polymerase chain reaction (PCR), and viral PCR panel of respiratory pathogens (coronavirus and subtypes, influenza A-B, parainfluenza and subtypes, Metapneumovirus Enterovirus Based on clinical, radiologic, and pathological findings, BCG-related lymphocytic pneumonitis was suspected. The patient's piperasilin-tazobactam treatment, which was initiated at an external center, was continued and completed to a total duration of 14 days. The patient was started on methylprednisolone at a dose of 1 mg/kg/day for five days, followed by maintenance therapy at 0.5 mg/kg/day without concurrent antibiotic therapy. A rapid clinical response was observed under steroid treatment, and the patient was discharged on an oral corticosteroid regimen. At the one-month follow-up, near-complete radiological regression was achieved. The dose was tapered off and discontinued within three months. Discussion Intravesical BCG administration and its mechanism of action used as adjuvant immunotherapy in bladder tumors have received significant attention due to BCG intolerance, BCG resistance, BCG relapse, and other serious side effects. As in our case, an immediate systemic reaction following BCG instillation, inability to isolate the causative agent microbiologically or cytopathologically, and a rapid response to steroid therapy should raise suspicion for BCG-itis. The diagnosis and management of BCG-related complications remain challenging. The variability in the onset of symptoms after the last instillation, together with radiological and clinical manifestations that may mimic malignancy or other infections, has emphasized the need for individualized, case-based management. Treatment decisions are guided by the severity, extent, and localization (local or systemic) of the complication, as well as the invasiveness of the biopsy procedure. In cases with a strong suspicion of severe systemic reactivated infection unresponsive to conventional antibacterial therapy - even in the absence of definitive diagnostic evidence - antimycobacterial therapy is recommended; in severe cases progressing to sepsis, a combination of antimycobacterial agents with corticosteroids is advised [ 8 In local complications with non-diagnostic urine culture results and no response to antibiotics, empirical treatment targeting BCG infection may be considered. If there is no clinical improvement with this approach, biopsy may be performed; while granulomatous reaction per se does not require treatment, management strategies may vary depending on the affected organ (e.g., a testicular abscess unresponsive to antimycobacterial therapy may ultimately require orchiectomy) [ 8 In a case series by Gonzalez et al. [ 9 6 Beyond its direct cytotoxic effects, BCG induces apoptosis, necrocytosis, and oxidative stress in tumor cells. Acting as a pathogen-associated molecular pattern (PAMP), BCG activates pattern recognition receptors (PRRs) such as Toll-like receptors (TLRs) on bladder tumor cells, macrophages, and antigen-presenting cells (APCs). The myeloid differentiation primary response 88 (MyD88) pathway is a key signaling route in the innate immune system, particularly involved in TLR and IL-1 receptor (IL-1R) signaling. Activation of TLRs leads to nuclear translocation of NF-κB and transcription of pro-inflammatory cytokines that sustain rapid inflammatory responses against pathogens, playing a critical role in early defense [ 10 11 CD4+ T-helper cells support immune defense by activating B cells and macrophages and enhancing CD8+ T-cell activity. Predominance of CD4+ T lymphocytes in bronchoalveolar lavage fluid indicates a helper T-cell-driven immune response, as seen in granulomatous diseases, such as sarcoidosis, autoimmune and opportunistic infections, or in chronic stages of certain interstitial lung diseases. Israel-Biet et al. [ 12 Additionally, as a result of BCG internalization or macrophage-mediated phagocytosis, APCs process BCG and present its antigens to CD4+ and CD8+T cells by binding them to major histocompatibility complex class II (MHC-II) molecules. This mechanism promotes the activation of adaptive immune responses. Following antigen presentation by APCs, CD4+ T cells release a range of cytokines, including IL-1, IL-2, IL-6, IL-8, IL-10, IL-12, IL-17, IL-18, TNF-α, IFN-γ, and GM-CSF. Tumor cells and innate immune cells also produce large amounts of cytokines upon stimulation by BCG. Notably, many of these cytokines are Th1-type, creating a cytokine milieu that is particularly favorable for the activation of CD8+ T cells [ 13 14 There are no clear recommendations to treat intravesical BCG-related adverse events. Treatment usually varies depending on the extent (local versus systemic) and severity of symptoms; antipyretics, nonsteroidal anti-inflammatory drugs to antituberculosis therapy and systemic corticosteroids can be used. Conclusions This case underscores the diagnostic challenges associated with BCG-related adverse effects, which are believed to arise from immune dysregulation and may present as active infection, hypersensitivity reactions, or granuloma formation. The timing of symptom onset is critical, as it often reflects the underlying pathophysiological mechanism. Due to the lack of specific clinical features and the frequent absence of definitive microbiological or histopathological findings, establishing a diagnosis can be difficult. In this patient, the BAL findings point to an early systemic reaction following intravesical BCG therapy, supporting the hypothesis of a hypersensitivity response triggered by the immune system’s attempt to control systemic dissemination. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: References 1 Disseminated Mycobacterium bovis after intravesicular bacillus Calmette-Guérin treatments for bladder cancer Cancer Control Elkabani M Greene JN Vincent AL VanHook S Sandin RL 476 481 7 2000 11000618 10.1177/107327480000700512 2 Can intravesical bacillus Calmette-Guérin reduce recurrence in patients with superficial bladder cancer? A meta-analysis of randomized trials Urology Han RF Pan JG 1216 1223 67 2006 16765182 10.1016/j.urology.2005.12.014 3 Bacille Calmette-Guérin in superficial transitional cell carcinoma Br J Urol Mungan NA Witjes JA 213 223 82 1998 9722756 10.1046/j.1464-410x.1998.00720.x 4 PD-L1 (B7-H1) expression by urothelial carcinoma of the bladder and BCG-induced granulomata: associations with localized stage progression Cancer Inman BA Sebo TJ Frigola X 1499 1505 109 2007 17340590 10.1002/cncr.22588 5 Side effects of bacillus Calmette-Guérin (BCG) in the treatment of intermediate- and high-risk Ta, T1 papillary carcinoma of the bladder: results of the EORTC genito-urinary cancers group randomised phase 3 study comparing one-third dose with full dose and 1 year with 3 years of maintenance BCG Eur Urol Brausi M Oddens J Sylvester R 69 76 65 2014 23910233 10.1016/j.eururo.2013.07.021 6 A novel view on the pathogenesis of complications after intravesical BCG for bladder cancer Int J Infect Dis Bilsen MP van Meijgaarden KE de Jong HK 63 68 72 2018 29778583 10.1016/j.ijid.2018.05.006 7 Incidence and treatment of complications of bacillus Calmette-Guerin intravesical therapy in superficial bladder cancer J Urol Lamm DL van der Meijden PM Morales A 596 600 147 1992 1538436 10.1016/s0022-5347(17)37316-0 8 Complications of intravesical BCG immunotherapy for bladder cancer Radiographics Green DB Kawashima A Menias CO 80 94 39 2019 30526332 10.1148/rg.2019180014 9 Spectrum of bacille Calmette-Guérin (BCG) infection after intravesical BCG immunotherapy Clin Infect Dis Gonzalez OY Musher DM Brar I 140 148 36 2003 12522745 10.1086/344908 10 The regulatory effects of polyporus polysaccharide on the nuclear factor kappa B signal pathway of bladder cancer cells stimulated by bacillus Calmette-Guerin Chin J Integr Med Wei JA Zeng X Han L Huang Y 531 536 17 2011 21725879 10.1007/s11655-010-0787-y 11 BCG therapy in bladder cancer and its tumor microenvironment interactions Clin Microbiol Rev Jian N Yu L Ma L Zheng B Huang W 0 38 2025 10.1128/cmr.00212-24 PMC12180517 40111053 12 Pulmonary complications of intravesical bacille Calmette-Guérin immunotherapy Am Rev Respir Dis Israel-Biet D Venet A Sandron D Ziza JM Chretien J 763 765 135 1987 https://pubmed.ncbi.nlm.nih.gov/3826901/ 3826901 10.1164/arrd.1987.135.3.763 13 Cytokine panel for response to intravesical therapy (CyPRIT): nomogram of changes in urinary cytokine levels predicts patient response to bacillus Calmette-Guérin Eur Urol Kamat AM Briggman J Urbauer DL 197 200 69 2016 26119560 10.1016/j.eururo.2015.06.023 PMC4691211 14 Intratumoral Th2 predisposition combines with an increased Th1 functional phenotype in clinical response to intravesical BCG in bladder cancer Cancer Immunol Immunother Pichler R Gruenbacher G Culig Z 427 440 66 2017 28005163 10.1007/s00262-016-1945-z PMC5359386 ",
  "metadata": {
    "Title of this paper": "Intratumoral Th2 predisposition combines with an increased Th1 functional phenotype in clinical response to intravesical BCG in bladder cancer",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476081/"
  }
}