{
  "title": "Paper_332",
  "abstract": "pmc Front Pain Res (Lausanne) Front Pain Res (Lausanne) 4172 fpain Front. Pain Res. Frontiers in Pain Research 2673-561X 2673-561X Frontiers Media SA PMC12484128 PMC12484128.1 12484128 12484128 41041601 10.3389/fpain.2025.1657014 1 Pain Research Systematic Review Effectiveness of digital pain management for older adults with musculoskeletal pain: systematic review with meta-analysis Silva Anabela G.  1 * Santos Ana J.  2 Andias Rosa  3 Rocha Nelson P.  4 1 RISE-Health, School of Health Sciences, University of Aveiro Aveiro Portugal 2 RISE-Health, Department of Education and Psychology, University of Aveiro Aveiro Portugal 3 RISE-Health, University of Aveiro Aveiro Portugal 4 Department of Medical Sciences, Institute of Electronics and Informatics Engineering of Aveiro, University of Aveiro Aveiro Portugal Edited by: Janet H. Van Cleave Reviewed by: Hayk Petrosyan Hao-Nan Wang * Correspondence: asilva@ua.pt 17 9 2025 2025 6 482048 1657014 30 6 2025 02 9 2025 17 09 2025 02 10 2025 03 10 2025 © 2025 Silva, Santos, Andias and Rocha. 2025 Silva, Santos, Andias and Rocha https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Introduction Musculoskeletal pain is highly prevalent among older adults and a leading cause of disability. Digital health promises to deliver timely and quality care, but existing reviews fail to be specific for older adults, focus on a single type of technology or a single body site, and do not provide an integrated overview of the effectiveness of current digital interventions. This systematic review with meta-analysis (Prospero ID: CRD42024549668) aimed to assess the effectiveness of digital interventions for pain management in reducing pain intensity and self-reported disability in older adults with musculoskeletal pain. Methods We searched PubMed, Web of Science, Scopus, and Academic Search Complete from inception to April 2025; extracted data on participants, interventions, and primary (pain intensity and self-reported disability) and secondary outcomes (performance, pain-related psychological variables, and adverse events). Results Thirty-six RCTs were included ( n Discussion The evidence is very uncertain on the effect of digital interventions on pain intensity and disability. They may decrease pain intensity and disability similarly to other interventions, but more research is needed to investigate the effect of digital interventions and identify key aspects that maximise the intervention. Systematic Review Registration https://www.crd.york.ac.uk/PROSPERO/view/CRD42024549668 pain older adults digital health telerehabilitation mobile health FCT- Fundação para a Ciência e a Tecnologia COMPETE2030-FEDER-00781500 FEDER - Fundo Europeu de Desenvolvimento Regional The author(s) declare that financial support was received for the research and/or publication of this article. This work was funded by FEDER - Fundo Europeu de Desenvolvimento Regional funds through the COMPETE 2030 and by Portuguese funds through FCT- Fundação para a Ciência e a Tecnologia in the framework of the project COMPETE2030-FEDER-00781500. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Geriatric Pain Introduction Musculoskeletal pain affects more than 60% of older adults ( 1 2 3 3 4 5 6 Pain is one of the main reasons for healthcare use ( 7 9 10 11 2 7 8 12 Digital health offers the possibility to overcome current barriers to provide quality and timely non-pharmacological pain management interventions to larger numbers of individuals at lower costs ( 13 14 15 16 Existing systematic reviews suggest that some types of technology might be effective in reducing pain and improving functioning ( 17 18 17 17 18 Methods This systematic review followed PRISMA guidelines ( 19 Search strategy Pubmed, Web of Science, Scopus, and Academic Search Complete were searched from inception to the 20th of April 2024 and updated on the 14th of April 2025, using the search terms available in the Supplementary Material 1 https://www.cadima.info Selection of studies Two authors (combined pairs of two of the four authors) independently screened the titles and abstracts, and the full texts. Discrepancies were resolved by consensus in a meeting with the four authors. At the full-text level, reasons for exclusion were documented. Reference screening was conducted with the support of CADIMA software. Eligibility criteria We included studies with older adults with acute (including post-surgical) or chronic musculoskeletal pain aged 60 and over (mean age of at least 60 years old). Musculoskeletal pain was defined as nociceptive pain that arises as part of a disease process directly affecting bone(s), joint(s), muscle(s), or related soft tissue(s) ( 20 21 Interventions included any pain management asynchronous or synchronous digital intervention delivered at a distance from the clinical center/hospital and constituting the main component of the intervention. This was defined as an intervention delivered via any web-based or online platforms, mobile applications, or virtual reality, accounting for at least 75% of the total intervention. The percentage of the intervention delivered digitally was calculated by dividing the total duration or total number of sessions of the intervention administered digitally by the total duration or total number of sessions of the intervention, respectively, multiplied by 100. Additionally, the participant and the health professional were in separate settings (e.g., the participant at home and the professional in a clinical environment). Studies employing digital interventions delivered by health professionals to participants in clinical settings were excluded as this was not considered to be delivered at a distance, and the potential for contact with healthcare professionals was very high, potentially affecting the effect of the intervention. Also, studies that used digital tools solely for data collection or self-monitoring (e.g., number of steps collected from a wearable sensor or mobile application) were excluded. Comparisons included usual care, no treatment, waiting-list, a placebo (a digital intervention with limited features), or any non-digital pain management intervention. Studies using an active digital intervention in both arms were excluded, as these studies would not provide data on the beneficial effect of digital interventions. Primary outcomes were pain intensity and self-reported disability measured using any validated instrument. Disability is usually characterized by both self-reported measures, which assess the individuals' perception of their capability to perform a range of tasks, and performance-based measures that capture how well an individual can perform a task and usually involve the completion or timing of strength, balance, or mobility tasks by an assessor ( 3 22 The type of studies included were randomized controlled trials, as randomized controlled trials are one of the highest-quality trial designs for establishing effectiveness. We excluded other study designs, conference abstracts, dissertations, and papers that were not peer-reviewed. Data extraction A customized Excel form for data extraction was tested in three studies to ensure completeness of headings, clear and consistent coding, and response options, and to train researchers ( 23 24 Risk of bias We used the Cochrane Risk of Bias tool (Rob-2) to judge the risk of bias ( 25 Grading of evidence The certainty of evidence was assessed using the Grading of Recommendations Assessment, Development and Evaluation (GRADE) approach and rated as high, moderate, low, or very low ( 26 I 2 Summary of evidence Meta-analysis Comparisons or outcomes were performed at post-intervention and follow-up (when possible). Meta-analyses were conducted using SPSS (IBM, version 28). When data were not available or suitable (e.g., means not reported) for a meta-analysis, we contacted the corresponding author, requesting the necessary data. When needed data was not directly available, but it was possible to compute from available metrics (e.g., standard errors or confidence intervals to calculate SD), conversion was carried out as specified in the Cochrane Handbook ( 27 27 I 2 27 28 Considering the moderate heterogeneity of the main meta-analyses, we explored subgroup analysis for type of patients (i.e., patients with chronic conditions and patients with post-surgery conditions) and sensitivity analysis isolating studies with asynchronous administration of the digital intervention and no personalization/one personalization strategy. Lower pain intensity, lower self-perceived functioning scores, and lower performance scores represent better outcomes. When more than one instrument was used to assess the same outcome of interest, we prioritize the outcome reported more consistently across studies. Results The search yielded 4,566 records, and after the removal of duplicates, 4,462 unique references were screened, of which 181 full texts were read (164 resulting from database searches and 17 resulting from citation searching). A total of 36 articles, reflecting 36 studies, met the inclusion criteria and were included in this systematic review. The PRISMA flowchart ( Figure 1 Figure 1 PRISMA 2020 flow diagram. Flowchart displaying the identification and screening process for studies. It details the number of records identified from databases and other methods, duplicates removed, records screened and excluded, reports retrieved and assessed for eligibility, and those included in the review. From databases, 4,462 records were screened, and 4,298 were excluded. Of 164 reports sought, 134 were excluded for specific criteria. From other methods, 56 records were identified, with 12 of 18 assessed reports excluded. Ultimately, 36 studies were included in the review. Study characteristics A total of 36 manuscripts were included that assessed at least one of the main variables of interest (pain intensity or functioning). Included studies represented 4,041 participants, of which 2,270 were females (56.2%). Nineteen studies involved patients with chronic conditions (knee or hip osteoarthritis: n n n n n n n n Table 1 Table 1 Description of the characteristics of included studies. References Number per group Age Clinical condition Control group Digital intervention Personalization a A/S Description Duration (D), Frequency (F) Sessions (S) 1 2 3 4 Weber et al. ( 56 D: n n D C OA Usual care; 12-week exercise, physical activity, and education program App - Join2Move; consists of three modules: graded physical activity, exercise, and education D: 12 weeks x x x A Barret et al. ( 30 D: n n D C Carpometacarpal surgery Face-to-face sessions; 1x/week, 30 min per session Video therapy; patients received links to 3 prerecorded exercise videos, each 3 to 4 min long D: 8 weeks A Moutzouri et al. ( 57 D: n n D C Knee OA Usual care; General web-based information and advice for OA and encouragement to follow outdoor physical activity 5 times/week and access to the same website as the experimental group, but only to the general recommendations Blended web-based rehabilitation including a web-based structured video exercise program, OA disease consultatory video sessions, and encouragement to follow an outdoor physical activity walk journey D: 6 weeks A Master et al. ( 58 D: n n D C Spine surgery Usual care; this included lifting restrictions, advice to stay active, and oral analgesics as needed. Postoperative physical therapist referral was at the discretion of the surgeon Zoom; a physical activity intervention including motivational interviewing and SMART goal setting; participants received a Fitbit and a folder that included an introduction to their therapist and the program, a daily step goal tracking sheet, and weekly walking goal D: 8 weeks x x x x S Zhao et al. ( 29 D: n n D C Knee arthroplasty Home-based rehabilitation following written instructions. The surgeon provided patients with rehabilitation instructions before discharge from the hospital and a rehabilitation manual on how to perform the same training protocol as in the telerehabilitation group Vital Health Remote Rehabilitation System that consists of three parts: patient-side app, wearable sensors, and surgeon-side websites. The program includes exercises and education D: 12 weeks x x x A Shim et al. ( 59 D: n n D C Knee arthroplasty Brochure-based home exercises according to the standard rehabilitation protocol. Both groups performed the same exercises Augmented-reality; exercise was performed using an AR-based digital system that allowed movement tracking via camera sensors D: 12 weeks A Lee et al. ( 60 D: n n D C Knee OA No intervention. An app attached to an external device that assesses ROM before each exercise and provides electrostimulation D:8 weeks x x A Janhunem et al. ( 61 D: n n D C Knee arthroplasty Home-based exercise. A standard postoperative home exercise program instructed by a physiotherapist Exergames played using a motion sensor (Kinect 2.0) connected to a laptop and controlled with a tablet D: 16 weeks A Sánchez-Laulhé et al. ( 62 D: n n D C Hand OA Home-based exercises delivered using a paper sheet that included pictures and explanations of exercises and dosage App home exercise program, delivered with the CareHand mobile app D: 12 weeks x x A Thiengwittayaporn et al. ( 63 D: n n D C Knee OA Handouts exercises, which were the same as the intervention group Mobile app featuring four separate modules: basic knowledge of the disease and symptoms, available treatment options, personalized assessment of the stage of severity, and appropriate exercise instructions D: 4 weeks A Nuevo et al. ( 64 D: n n D C Knee arthroplasty Leaflet with exercises. Telerehabilitation system Rehub composed of a web platform and an inertial motion sensor. Patients received a home training session by a physiotherapist and a ReHub® technician 24 h after hospital discharge. The physiotherapist repeated the visit on the D: 4 weeks x x x A Cheng et al. ( 65 D: n n D C Hip fracture Exercise and caregiver skill pamphlet instead of the app. The same home-based rehabilitation program as the digital group A mobile app on a smart tablet to assist in performing exercises. Both groups received the same homebased rehabilitation program and caregiver skill information D: 8 weeks x A An et al. ( 66 D: n n n D Knee OA (preoperative) C1—education about home exercise safety and 40 min of self-home exercise (30 min, 2 times/day, 5 days/week). Telephone calls once a day. C2 - Usual care, including progress monitoring, discharge destination determination, and simple quadriceps exercise performed several times daily Telerehabilitation program including exercises (mobility, flexibility, strength, balance). The therapist provided supervision and intervention with real-time visual feedback and verbal cues. D: 3 weeks S Fanning et al. ( 67 D: n n D C OA with obesity and chronic pain Waiting list Companion App - MORPH, plus Fitbit wearable activity monitor. A mix of in-person group meetings, individual digital calls, and group digital calls. The meetings aimed at providing didactic content related to dietary behaviour change, increasing physical activity, pain management, and mindfulness. Participants received access to weekly educational podcasts and animated videos that reinforced educational content, and they also received regular messages within a “newsfeed” feature D: 12 weeks x x x x A Doiron-Cadrin et al. ( 68 D: n n n D Hip and knee OA C1: face-to-face intervention; C2: provided with the hospital's usual documentation before joint arthroplasty, consisting of information regarding the pre- and post-surgery course and medication use. Web-based platform; subjects in the tele-prehabilitation group received the same exercise program and advice as C1 through an internet-based telecommunication mobile application after initial assessment. D: 12 weeks S Pronk et al. ( 69 D: n n D C Knee arthroplasty Usual care including pre-, peri-, and postoperative pain medication, participated in group information meetings, received an information booklet, and could contact the clinic at any time. Mobile app – PainCoach + usual care; the app gave the same advice as that during usual care and allowed patients to input their pain level whenever they wanted until day 14 after surgery. Based on the patient's input and number of days after surgery, the app provided advice on pain medication use, physiotherapy exercises including videos, D: 4 weeks x A Pelle et al. ( 70 D: n n D C Knee and hip OA Usual care defined as non-standardized care initiated by the participant (self-medication, self-referral) to non-medical professionals or initiated by the general practitioner (after consultation initiated by the participant). The dr. Bart app, which invites users to select pre-formulated goals (i.e., “tiny habits”) and triggers to a healthier lifestyle. The pre-formulated goals are based on four themes: education regarding OA and its treatment, the benefits of a healthy lifestyle, physical activity, vitality, and nutrition Not specified x x x A Bettger et al. ( 31 D: n n EG = 65.4 ± 7.7 CG = 65.1 ± 9.2 Knee arthroplasty Usual care including the patients’ care team's recommendations for all preoperative and postoperative The Virtual Exercise Rehabilitation Assistant (VERA), which uses 3D tracking technology to quantify pose and motion, an avatar (digitally simulated coach) to demonstrate and guide activity, visual and audible instructions and immediate feedback on exercise quality, and a virtual video connection for synchronous telehealth visits with an assigned intervention telehealth physical therapist. Individualized prescribed therapy regimens were electronically programmed. D & F: were unrestricted x A Zadro et al. ( 71 D: n n D C Low back pain Usual activities Video-game; participants engaged in an unsupervised preselected home-based exercise program for 8 weeks using a Nintendo Wii U console; including flexibility, body weight resistance, and aerobic exercises D: 8 weeks x A Kloek et al. ( 72 D: n n D C Hip or knee OA Face-to-face physiotherapy according to the Dutch OA guideline, which recommends: information, physical exercise, and strength and stability exercises (i.e., the same elements as in the intervention group). Web based platform; including a combination of about 5 face-to-face sessions with a physical therapist and an online application focusing on behavioural graded activity/exercises (grade activity, strength, and stability) and information on OA, pain management, and weight management. Weekly automatic emails informed and reminded patients about new assignments and content. D: 12 weeks x x S Bennell et al. ( 32 D: n n D C Knee pain Internet-based educational material, similar to the intervention group. PainCOACH + 7 Skype sessions with a physiotherapist; Included educational modules about exercise and physical activity, pain management, emotions, healthy eating, complementary therapies, and medications and practice pain-coping skills daily. D: 12 weeks x x A Rini et al. ( 73 D: n n D C Knee or hip OA No intervention PainCOACH program, which translates an in-person pain coping skills training protocol, including eight modules completed without therapist contact, at the rate of one per week. Each module provided interactive training in a cognitive or behavioral pain coping skill. Participants were asked to practice each new skill after learning it, and their completion of and experiences were reviewed at the beginning of the next module. D: 8 weeks x x x A Bossen et al. ( 74 D: n n D C Knee or hip OA Waiting list Web-based platform Join2move, which incorporates a baseline test, goal setting, time-contingent PA objectives, and text messages to promote PA. It is a fully automated Web-based intervention that contains automatic functions (web-based text messaging and automatic emails). The patient's favourite recreational activity is gradually increased in a time-contingent way. D: 9 weeks x x x A Gohir et al. ( 75 D: n n D C Knee or hip OA Exercise and information following the NICE guidelines. Participants in the usual care group could continue to seek health care input for their knee pain as required during the duration of their study participation. Mobile app, with structured exercise and OA disease information. Adherence was encouraged by daily emails or smartphone notifications, or by the physiotherapist via D: 6 weeks x x A Duong et al. ( 33 D: n n D C Knee arthroplasty Usual care Usual care + 6-month digital technology package consisting of an exercise program delivered through an app (PhysiApp), a Fitbit tracker (step, sleep, and active hours monitoring), and fortnightly health coaching for 3 months. Participants also received motivational text messages on alternating weeks, updating them about their progress D: 24 weeks x x A Charlton et al. ( 76 D: n n D C Knee OA No intervention/ waiting list Five weekly videoconference appointments involving 15–20-minute Zoom meetings to support participants as they integrated the gait modification into their at-home walking. Behaviour change techniques were used, which involved discussing the benefits of the intervention, identifying barriers and potential solutions, setting weekly goals, and self-monitoring with the walking diary D: 6 weeks x S Moffet et al. ( 77 D: n n E Knee arthroplasty Standard rehabilitation; home visits by the physiotherapist. Videoconference; the intervention included an assessment before and after exercise, supervised exercises (mobility, strengthening, function, and balance), exercises to perform on days without supervised sessions, and advice concerning pain control, walking aids, and the return to activities D: 8 weeks x S Osterloh et al. ( 78 D: n n D C Hip and knee arthroplasty Usual care. Outpatient therapy (a mean of 21 sessions per participant). Video-based rehabilitation tool—YOLii - twice a week (30 min each session) from the 1st to the 6th postoperative month. Participants received standardized group therapy with the video-based rehabilitation tool YOLii. a pre-selection of exercises was suggested to the physiotherapist, which was then individually adapted to the patient's needs. This allows supervision of up to five patients simultaneously by one therapist. D: 20 weeks x S Timmers et al. ( 79 D: n n D C Knee arthroplasty Sham. The Patient Journey App; The control group only received basic information about the recovery process, about two times per week The Patient Journey App; during the 28 days after discharge, every patient received over 30 notifications with supporting information, related to topics such as pain, physiotherapy exercises, wound care, and daily self-care activities D: 4 weeks x x A Crawford et al. ( 34 D: n n D C Knee arthroplasty Standard of care rehabilitation. All participating sites engaged in rapid recovery pathways and nearly universally prescribed physiotherapy following surgery, three times per week. Protocols and instructional and educational content were site-specific. Smartphone-based telerehabilitation consisting of a patient app on both the iPhone and Apple Watch, as well as a web portal for clinicians that allows them to view details on the patient's engagement, D: 6 weeks x A Tousignant et al. ( 80 D: n n D C Knee arthroplasty Usual home care/outpatient clinic group delivered as usual over about two months; 1 h per session. Telerehabilitation guided by a physical therapist D:8 weeks S Kane et al. ( 81 EG: n n D C Rotator cuff Face-to-face visits. Patients in the control group were seen by the operating surgeon in the office at 2, 6, and 12 weeks after surgery and received in-person instructions to perform ROM activities. Telemedicine platform allowing follow-ups with the surgeon at 2, 6, and 12 weeks after surgery and enabled patients to connect with the operative surgeon via webcam using a smartphone, computer, or tablet. Subjects received instructions via mail after the second visit (6 weeks) to begin active-assisted ROM. Unclear S Nelson et al. ( 82 D: n n D C Hip arthroplasty Paper-based home exercise programme performed by physiotherapists; The programme was progressed based on the physiotherapists’ assessment during the six-week intervention period. Two apps; the intervention was identical in content to the control programme, delivery via telerehabilitation technology on an Apple iPadTM. Home exercises were facilitated using an application, and physical therapy sessions were conducted via another app. Compliance was monitored, communication via a messaging feature was possible, and real-time videoconferencing. D: 2 to 6 weeks x x A Allen et al. ( 83 D: n n n E Knee OA C1: Face-to-face physical therapy; participants could receive up to eight one-hour sessions Therapeutic Exercise Resource Center (TERC), a comprehensive web-based system designed to evaluate, prescribe, monitor, and adjust therapeutic exercise programs for patients with knee OA. D: 48 weeks x x A Lo et al. ( 35 D: n n D C Knee OA Home exercise. A 30-minute health talk led by a physical therapist to explain and demonstrate VR iKnee group was instructed to D: 12 weeks X A Akgül et al. ( 84 D: n n D C Knee OA Standard education + exercises (the same as the intervention group)+smartwatch 1 h face-to-face education + digitally supported walking programme recommendations (WhatsApp) and smartwatches + home exercise programme D: 8 weeks x x x A D, digital intervention group; C, control group; OA, osteoarthritis; PA, physical activity; S, synchronous; A, asynchronous; ROM, range of motion; VR, virtual reality.  a Elements of personalization of the digital intervention: (1) goal setting; (2) adjusting the plan; (3) data-driven approaches; (4) motivating behavioural changes. The digital intervention was delivered synchronously, via teleconference software, in 8 (22%) studies, and asynchronously, via mobile apps, web-based platforms, video, exergames, or virtual reality, with or without external sensors for data collection, in 22 (61%) studies. In addition, 6 (17%) studies combined a synchronous and an asynchronous component. The digital intervention was compared against other interventions in 31 (86%) studies, defined as usual care ( n n n n n Regarding personalization strategies, 9 (25%) studies did not include any, 9 (25%) included only 1, and an additional 9 (25%) studies included two. Only 9 (25%) studies used 3 or 4 personalization strategies. The duration of the digital intervention varied (range: 3 weeks–48 weeks), with 24 (67%) studies reporting 8 or more weeks, 10 (28%) reporting 6 or fewer weeks, and 2 (5%) were unclear. Of 36 included studies, 32 reported on pain intensity, 34 reported on self-reported disability, and 22 reported on a performance measure. The most commonly used instruments to assess pain intensity were the numeric pain rating scale or the visual analogue scale ( n n n n Adverse events Studies that reported on adverse events n n 29 30 31 n n 32 n 33 n p 34 35 Risk of bias For subjective measurements (pain intensity and self-reported disability), the overall risk of bias was judged as high, due to bias in domain 4 (measurement of the outcome) introduced by lack of blinding. Among the remaining domains, bias was considered low in 26 studies (72%) for domain 1 (randomization process), 21 (58%) for domain 2 (deviations from intended interventions), 86% for domain 3 (missing outcome data) and 5 (14%) for domain 5 (selection of the reported results). For performance measurements and the 22 studies that reported on them, the overall risk of bias was judged as some concerns for 7 studies (32%) and high risk for 15 (68%) studies. Low risk of bias was found for 14 (64%) studies in domain 1, 10 (45%) in domain 2, 19 (86%) in domain 3, 12 (55%) in domain 4, and 3 (14%) in domain 5. The risk of bias for pain intensity and self-reported disability (patient-reported outcomes) is presented in Figure 2 Supplementary Material 2 Figure 2 Risk of bias for all studies (pain intensity and self-reported disability—patient-reported outcome measures). Table evaluating risk of bias across various studies from 2011 to 2025. Columns D1 to D5 assess different risk factors: randomisation, deviations, missing data, measurement, and result selection. Green plus indicates low risk, yellow exclamation indicates some concerns, and red circle indicates high risk. Overall risk is summarized in the final column. Meta-analysis on the effects of the digital intervention Of the 32 studies that reported pain intensity, 29 provided data that could be included in the meta-analysis (23 compared a digital intervention against another active intervention, and 6 against no intervention). Of the 33 studies that reported self-reported disability, 28 provided data that could be included in the meta-analysis (24 compared a digital intervention against another active intervention, and 4 against no intervention). GRADE tables for all meta-analyses performed are presented in Supplementary Material 3 Supplementary Material 4 Effect of the digital interventions when compared against other forms of treatment on pain intensity and self-reported disability There was low certainty evidence of a small beneficial effect of digital interventions in reducing pain intensity at post-treatment (SMD = −0.23, 95%CI = −0.37 to −0.09, I 2 k Figure 3 I 2 k k Figure 3 Forest plot for pain intensity when comparing digital interventions against other interventions. Forest plot displaying the effect sizes of various studies. Each blue square represents an effect size with horizontal lines indicating confidence intervals. Diamonds represent estimated overall effect sizes. The red dashed line denotes the overall effect size value. Subgroups include chronic conditions and post-surgical studies, with overall effects of −0.40 and −0.06 respectively. The overall effect size across all studies is −0.23. The plot uses a random-effects model with associated heterogeneity statistics. There was low certainty evidence of a small beneficial effect of digital interventions in reducing disability at post-treatment (SMD = −0.22, 95%CI = −0.39 to −0.04; I 2 k Figure 4 I 2 k I 2 k Supplementary Material 5 Supplementary Material 6 Figure 4 Forest plot for self-reported disability when comparing digital interventions against other interventions. Forest plot showing the effect sizes and confidence intervals for various studies on chronic conditions and post-surgery interventions. Each blue square represents a study's effect size, with horizontal lines indicating confidence intervals. A red dashed line marks the overall effect size of −0.22. Two diamonds represent subgroup overall effects for chronic conditions (−0.51) and post-surgery interventions (0.00). The plot is part of a random-effects model, indicating heterogeneity and statistical measures at the bottom. Effect of the digital interventions when compared to no intervention Meta-analysis included only studies with chronic conditions There was very low certainty of evidence of a small beneficial effect of digital interventions in reducing pain intensity at post-treatment (SMD = −0.24, 95%CI = −0.40 to −0.08, I 2 k There was very low certainty of evidence of no between-group differences at post-treatment for self-reported disability (SMD = −0.09, 95%CI = −0.30 to 0.12, I 2 k No meta-analysis was possible at follow-up due to the small number of studies with the same time-point ( k Effect of the digital interventions on performance (secondary outcome) Of the 22 studies that reported performance, 18 provided data for the meta-analysis (15 compared a digital intervention against another active intervention and 3 against no intervention). When compared against other interventions, there was very low certainty evidence of a small beneficial effect of digital interventions improving performance at post-treatment (SMD = −0.26, 95%CI = −0.44 to −0.08; I 2 k Figure 5 k Figure 5 Forest plot for performance when comparing digital interventions against other interventions. Forest plot showing effect sizes for two groups: chronic conditions and post-surgery. Blue squares represent individual study effect sizes with confidence intervals as horizontal lines. Diamonds indicate subgroup and overall effect sizes. The red dashed line marks the overall effect size value of negative 0.26. Effect sizes range from negative two to one. The overall effect size is negative 0.26, with a confidence interval from negative 0.44 to negative 0.08. The model is a random-effects model, with heterogeneity statistics provided below the plot. When compared against no interventions, there was very low certainty of evidence of a small beneficial effect of digital interventions in improving performance at post-treatment for older adults with chronic painful conditions (SMD = −0.49, 95%CI = −0.95 to −0.03, I 2 k Effect of the digital interventions on psychological variables (secondary outcome) Six studies assessed at least one psychological variable (self-efficacy, fear of movement, catastrophizing, or anxiety). Meta-analysis was possible only for self-efficacy at post-intervention, when the comparison group was other interventions, and there was very low certainty of evidence of no between-group differences (SMD = 0.39; 95%CI −0.19 to 0.98, I 2 k Subgroup and sensitivity analysis for the comparison of digital interventions against other interventions Given the variability in patients' characteristics, particularly post-operative individuals and patients with chronic conditions, and the moderate heterogeneity identified, we conducted a subgroup analysis based on the type of patients and a sensitivity analysis grouping only studies using one or no personalization strategies, and studies using asynchronous digital interventions. These analyses were only possible when the comparisons were other interventions, due to the small number of studies that used no intervention as a comparison. Sub-group analysis by type of patients revealed low certainty of evidence of a small beneficial effect of digital interventions when compared to other interventions for pain intensity in participants with chronic conditions (−0.40, 95% CI −0.60 to −0.20; p I 2 k p I 2 k p I 2 k p I 2 k For self-reported disability, sub-group analysis by type of patients revealed low certainty of evidence of a medium beneficial effect of digital interventions when compared to other interventions for patients with chronic conditions (−0.51, 95% CI −0.77 to −0.24; I 2 k I 2 k I 2 k I 2 k Sub-group analysis by type of patients revealed very low certainty evidence of a small beneficial effect of digital interventions when compared to other interventions for performance in postoperative patients (−0.18, 95% CI −0.31 to −0.05; I 2 k I 2 k I 2 k I 2 k Subgroup analysis did not apply when the comparison was no intervention (all studies in the same type of patients), and sensitivity analysis was not possible ( k Discussion This review is a comprehensive evaluation of the effectiveness of digital interventions for older adults with pain. Our results suggest that digital interventions may reduce pain intensity and pain disability slightly at post-intervention and compared to other interventions for older adults with painful chronic conditions, but not for older adults with post-surgical/acute conditions. The evidence is very uncertain on the effect of digital interventions at follow-up on pain intensity and disability. The evidence also suggests that digital interventions may improve performance compared to other interventions, but only for older adults with post-surgical conditions. The evidence is very uncertain and scarce about the effect of digital interventions on self-efficacy. This review provides a broad overview of the effectiveness of digital interventions delivered at a distance for older adults, adding to previous reviews that focus on a single body region, clinical condition or intervention (for example, exercise), do not limit studies to those conducted in older adults or do not clarify whether the digital intervention administered at a distance corresponds to the main component of the intervention ( 36 37 Sub-group analysis by type of patients and sensitivity analysis for studies using fewer personalization strategies and delivering the intervention asynchronously showed a decrease in heterogeneity of varying degrees for pain intensity. For self-reported disability and performance, a decrease in heterogeneity was found only in the analyses by type of patients and asynchronous interventions. These findings suggest that type of patients, number of personalization strategies and mode of administration (synchronous vs. asynchronous) partially explain the variability across studies, but its impact on variability depends on the outcome. Furthermore, the sensitivity analysis also suggests that the mode of administration of the digital intervention (synchronous or asynchronous) might impact its effectiveness, as when analysing only the trials with an asynchronous administration of the intervention, the between-group differences for pain disability and performance were no longer present. Similarly, when analysing the trials with no or one personalization strategy, the between-group differences were no longer present for pain intensity and pain disability. Caution should be taken when interpreting the sensitivity analysis, as a few of them included a low number of studies. Nevertheless, these results highlight the importance of reporting the mode of administration (synchronous vs. asynchronous) and the number of personalization strategies in future trials. These factors should also be considered when aggregating data from different trials. It is unclear why the type of subjects, mode of administration, and interaction strategies impact the effectiveness of digital interventions. Conceivably, there is more room for improvement in patients submitted to a recent surgery, which, adding to the general positive expectations of patients ( 38 39 40 41 41 42 42 Personalization, more likely in synchronous and interactive interventions, is also valued by older adults ( 39 43 44 24 24 24 The overall finding of the current review that digital pain interventions may have similar or greater effects on pain intensity and disability than other interventions align well with previous reviews, even though we were more stringent in the inclusion criteria, as the digital component needed to correspond to at least 75% of the intervention for a study to be included in the present review. It has been found that remote exercise programs were not less effective than in-person physical therapy for pain intensity in patients with osteoarthritis ( 45 47 48 47 Very few studies explored the effect of digital interventions on self-efficacy, catastrophizing, fear of movement, and anxiety. These variables need to be included in future trials evaluating the effectiveness of digital interventions for older adults, considering their impact and relevance on pain intensity and pain-associated disability. Higher self-efficacy is associated with higher outcome expectations ( 49 49 50 51 This systematic review also suggests that digital interventions are safe with few non-serious adverse events, most often similar to those occurring in the group receiving other interventions, suggesting that it is safe to use digital interventions with older adults with both chronic and post-surgical painful conditions. However, caution should be taken when interpreting these data and a systematic assessment of serious and non-serious adverse events is recommended in all future trials. More than 40% of included trials did not report on adverse events, and among those that reported on adverse events, the methodology used for their assessment was not always clear. Study limitations The low quality of included studies, as assessed using Rob2, mostly resulted from the inability to blind outcome assessors for self-reported (participant-reported) measures, which are potentially influenced by the participants' knowledge of the intervention received. This led to the downgrading of the evidence when applying the GRADE. The small sample sizes ( n 52 Research and clinical practice recommendations The apparent safety of digital interventions and the potential for a positive impact on pain and disability cautiously suggest that digital interventions can be used in clinical practice to decrease pain and self-reported disability and improve performance. The choice between a face-to-face intervention and a digital intervention might be left to patients' preferences and ability to safely and correctly use the digital means needed for the intervention. This is particularly relevant as older adults have less access to digital means and lower digital literacy skills than younger groups ( 53 53 Future trials, in addition to employing more methodologically robust designs that overcome the limitations identified in this review, can compare digital interventions with different degrees of personalization and the synchronous and asynchronous administration of the same intervention. Furthermore, most existing trials use older adults with knee and hip osteoarthritis or patients who have undergone hip or knee replacement. Therefore, there is a need to investigate the effectiveness of digital interventions for other painful conditions that are prevalent in older adults, such as low back pain ( 54 55 3 Conclusion Our results suggest that digital interventions are at least as good as other interventions at decreasing pain and self-reported disability and improving performance. Furthermore, for older adults with painful chronic conditions, they may reduce pain intensity and pain disability, at post-intervention, slightly more. The evidence is very uncertain on the effect of digital interventions on pain intensity and disability at follow-up, and on the effect of digital interventions on self-efficacy. Further studies are needed to investigate digital pain management for currently under-investigated clinical conditions, such as low back pain and multisite pain, and to investigate which aspects of digital pain management (e.g., interaction) are likely to have a higher impact on the intervention effect. Data availability statement The original contributions presented in the study are included in the article/ Supplementary Material Author contributions AGS: Funding acquisition, Project administration, Writing – review & editing, Formal analysis, Methodology, Writing – original draft, Data curation, Conceptualization, Investigation. AJS: Methodology, Data curation, Investigation, Writing – review & editing. RA: Writing – review & editing, Investigation, Data curation. NR: Writing – review & editing, Data curation, Conceptualization. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fpain.2025.1657014/full#supplementary-material References 1. Lehti TE Rinkinen M-O Aalto U Roitto HM Knuutila M Öhman H Prevalence of musculoskeletal pain and analgesic treatment among community-dwelling older adults: changes from 1999 to 2019 Drugs Aging 2021 38 931 7 10.1007/s40266-021-00888-w 34386937 PMC8484214 2. Domenichiello AF Ramsden CE The silent epidemic of chronic pain in older adults Prog Neuro Psychopharmacol Biol Psychiatry 2019 93 284 90 10.1016/j.pnpbp.2019.04.006 PMC6538291 31004724 3. Silva A Queirós A Sa-Couto P Rocha N Self-reported disability: association with lower extremity performance and other determinants in older adults attending primary care Phy Ther 2015 95 1628 37 10.2522/ptj.20140323 26023215 4. Niknejad B Bolier R Henderson CR Delgado D Kozlov E Löckenhoff CE Association between psychological interventions and chronic pain outcomes in older adults JAMA Intern Med 2018 178 830 10.1001/jamainternmed.2018.0756 29801109 PMC6145761 5. Alpalhão V Cordeiro N Pezarat-Correia P Kinesiophobia and fear avoidance in older adults: a scoping review on the state of research activity J Aging Phys Act 2022 30 1075 84 10.1123/japa.2021-0409 35303715 6. Zhaoyang R Martire LM Darnall BD Daily pain catastrophizing predicts less physical activity and more sedentary behavior in older adults with osteoarthritis Pain 2020 161 2603 10 10.1097/j.pain.0000000000001959 32569091 PMC7572728 7. Azevedo LF Costa-Pereira A Mendonça L Dias CC Castro-Lopes JM Chronic pain and health services utilization Med Care 2013 51 859 69 10.1097/MLR.0b013e3182a53e4e 23969588 8. Mäntyselkä P Kumpusalo E Ahonen R Kumpusalo A Kauhanen J Viinamäki H Pain as a reason to visit the doctor: a study in Finnish primary health care Pain 2001 89 175 80 10.1016/S0304-3959(00)00361-4 11166473 9. Torres JL da Silva SLA Ferreira FR Mendes LPS Machado LA Chronic pain is associated with increased health care use among community-dwelling older adults in Brazil: the pain in the elderly (PAINEL) study Fam Pract 2019 36 594 9 10.1093/fampra/cmy123 30517627 10. Silva AG Queiros A Rocha NP Functioning and primary healthcare utilization in older adults: a 1-year follow-up study Physiother Theory Pr 2018 35 1 10 10.1080/09593985.2018.1442536 29461129 11. Ferreira ML Machado G Latimer J Maher C Ferreira PH Smeets RJ Factors defining care-seeking in low back pain—a meta-analysis of population based surveys Eur J Pain 2010 14 7 747.e1 7 10.1016/j.ejpain.2009.11.005 20036168 12. Suntai Z Won CR Noh H Access barrier in rural older adults’ use of pain management and palliative care services: a systematic review Am J Hosp Palliat Med 2021 38 494 502 10.1177/1049909120959634 32959683 13. Fatoye F Gebrye T Mbada C Useh U Economic evaluations of digital health interventions for the management of musculoskeletal disorders: systematic review and meta-analysis J Med Internet Res 2023 25 e41113 10.2196/41113 37410542 PMC10359913 14. Digital Health and Innovation Global Strategy on Digital Health 2020–2025 Geneva WHO 2021 15. Culmer N Smith TB Stager C Wright A Fickel A Tan J Asynchronous telemedicine: a systematic literature review Telemed Rep 2023 4 366 86 10.1089/tmr.2023.0052 38143795 PMC10739789 16. Ghanvatkar S Kankanhalli A Rajan V User models for personalized physical activity interventions: scoping review JMIR Mhealth Uhealth 2019 7 e11098 10.2196/11098 30664474 PMC6352015 17. Mapinduzi J Ndacayisaba G Verbrugghe J Timmermans A Kossi O Bonnechère B Effectiveness of mHealth interventions to improve pain intensity and functional disability in individuals with hip or knee osteoarthritis: a systematic review and meta-analysis Arch Phys Med Rehabil 2025 106 280 91 10.1016/j.apmr.2024.06.008 38945508 18. Edward H Nicolau D Wu J Paramanantharajah N Wojkowski S Macedo L Effectiveness of physiotherapist-led tele-rehabilitation for older adults with chronic conditions: a systematic review and meta-analysis Disabil Rehabil 2024 106 1 15 10.1080/09638288.2024.2423770 39503435 19. Page MJ McKenzie JE Bossuyt PM Boutron I Hoffmann TC Mulrow CD The PRISMA 2020 statement: an updated guideline for reporting systematic reviews Br Med J 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 20. Treede R-D Rief W Barke A Aziz Q Bennett MI Benoliel R A classification of chronic pain for ICD-11 Pain 2015 156 1003 7 10.1097/j.pain.0000000000000160 25844555 PMC4450869 21. Treede R Rief W Barke A Aziz Q Bennett M Benoliel R Chronic pain as a symptom or a disease: the IASP classification of chronic pain for the International Classification of Diseases (ICD-11) Pain 2019 160 1 19 27 10.1097/j.pain.0000000000001384 30586067 22. Latham NK Mehta V Nguyen AM Jette AM Olarsch S Papanicolaou D Performance-based or self-report measures of physical function: which should be used in clinical trials of hip fracture patients? Arch Phys Med Rehabil 2008 89 2146 55 10.1016/j.apmr.2008.04.016 18996244 23. Büchter RB Weise A Pieper D Development, testing and use of data extraction forms in systematic reviews: a review of methodological guidance BMC Med Res Methodol 2020 20 259 10.1186/s12874-020-01143-3 33076832 PMC7574308 24. Hwang M Jiang Y Personalization in digital health interventions for older adults with cancer: a scoping review J Geriatr Oncol 2023 14 101652 10.1016/j.jgo.2023.101652 37866009 25. Sterne JAC Savović J Page MJ Elbers RG Blencowe NS Boutron I Rob 2: a revised tool for assessing risk of bias in randomised trials Br Med J 2019 366 l4898 10.1136/bmj.l4898 31462531 26. Schünemann H Brożek J Guyatt G Oxman A Handbook for Grading the Quality of Evidence and the Strength of Recommendations Using the GRADE Approach The GRADE Working Group 2013 Available online at https://gdt.gradepro.org/app/handbook/handbook.html 27. Higgins J Thomas J Chandler J Cumpston M Li T Page M Cochrane Handbook for Systematic Reviews of Interventions version 6.5 2024 (Accessed August 2024) 28. Santesso N Glenton C Dahm P Garner P Akl EA Alper B GRADE guidelines 26: informative statements to communicate the findings of systematic reviews of interventions J Clin Epidemiol 2020 119 126 35 10.1016/j.jclinepi.2019.10.014 31711912 29. Zhao R Cheng L Zheng Q Lv Y Wang Y-M Ni M A smartphone application-based remote rehabilitation system for post-total knee arthroplasty rehabilitation: a randomized controlled trial J Arthroplast. 2024 39 3 575 81.e8 10.1016/j.arth.2023.08.019 37572720 30. Barrett PC Hackley DT Yu-Shan AA Shumate TG Larson KG Deneault CR Provision of a home-based video-assisted therapy program is noninferior to in-person hand therapy after thumb carpometacarpal arthroplasty J Bone Jt Surg. 2024 106 8 674 80 10.2106/JBJS.23.00597 38608035 31. Bettger JP Green CL Holmes DN Chokshi A Mather RC Hoch BT Effects of virtual exercise rehabilitation in-home therapy compared with traditional care after total knee arthroplasty: vERITAS, a randomized controlled trial J Bone Jt Surg 2020 102 2 101 9 10.2106/JBJS.19.00695 31743238 32. Bennell KL Nelligan R Dobson F Rini C Keefe F Kasza J Effectiveness of an internet-delivered exercise and pain-coping skills training intervention for persons with chronic knee pain: a randomized trial Ann Intern Med 2017 166 7 453 62 10.7326/M16-1714 28241215 33. Duong V Robbins SR Dennis S Venkatesha V Ferreira ML Hunter DJ Combined digital interventions for pain reduction in patients undergoing knee replacement JAMA Netw OPEN 2023 6 9 e2333172 10.1001/jamanetworkopen.2023.33172 37713201 PMC10504613 34. Crawford DA Duwelius PJ Sneller MA Morris MJ Hurst JM Berend KR 2021 Mark coventry award: use of a smartphone-based care platform after primary partial and total knee arthroplasty: a prospective randomized controlled trial Bone Jt J 2021 103-B 3 12 10.1302/0301-620X.103B6.BJJ-2020-2352.R1 34053272 35. Lo HHM Ng MSN Fong HPY Lai HH-K Wang B Wong SY Examining the feasibility, acceptability and preliminary efficacy of an immersive virtual reality-assisted lower limb strength training for knee osteoarthritis: a mixed-method pilot randomized controlled trial JMIR Serious Games 2024 12 1 15 10.2196/52563 PMC11451550 39331525 36. Wang H-N Luo P Liu S Liu Y Zhang X Li J Effectiveness of internet-based telehealth programs in patients with hip or knee osteoarthritis: systematic review and meta-analysis J Med Internet Res 2024 26 e55576 10.2196/55576 39348685 PMC11474128 37. Xiang X-N Wang Z-Z Hu J Zhang J-Y Li K Chen Q-X Telehealth-supported exercise or physical activity programs for knee osteoarthritis: systematic review and meta-analysis J Med Internet Res 2024 26 e54876 10.2196/54876 39094114 PMC11329855 38. Conner-Spady BL Bohm E Loucks L Dunbar MJ Marshall DA Noseworthy TW Patient expectations and satisfaction 6 and 12 months following total hip and knee replacement Qual Life Res 2020 29 705 19 10.1007/s11136-019-02359-7 31741216 39. Laukka E Lakoma S Harjumaa M Hiltunen S Härkönen H Jansson M Older adults’ preferences in the utilization of digital health and social services: a qualitative analysis of responses to open-ended questions BMC Health Serv Res 2024 24 1184 10.1186/s12913-024-11564-1 39367429 PMC11451244 40. Sturm J Dierick A Christianen M van Gelder M Wouters E Possibilities patience, and perseverance: a preliminary analysis of the needs and experiences of ten older adults regarding their use of digital health technology Healthcare 2023 11 1612 10.3390/healthcare11111612 37297752 PMC10252237 41. Judson TJ Subash M Harrison JD Yeager J Williams AM Grouse CK Patient perceptions of e-visits: qualitative study of older adults to inform health system implementation JMIR Aging 2023 6 e45641 10.2196/45641 37234031 PMC10257108 42. Timurtaş E Hüzmeli İ demirbüken İ Polat MG Clinical outcomes of asynchronous telerehabilitation through a mobile app are equivalent to synchronous telerehabilitation in patients with fibromyalgia: a randomized control study BMC Musculoskelet Disord 2025 26 118 10.1186/s12891-025-08377-6 39905353 PMC11796233 43. Zou J Wang F Yang X Wang H Niswander L Zhang T Association between rare variants in specific functional pathways and human neural tube defects multiple subphenotypes Neural Dev 2020 15 8 10.1186/s13064-020-00145-7 32650820 PMC7353782 44. Villalobos-Zúñiga G Cherubini M Apps that motivate: a taxonomy of app features based on self-determination theory Int J Hum Comput Stud 2020 140 102449 10.1016/j.ijhcs.2020.102449 45. McHugh CG Kostic AM Katz JN Losina E Effectiveness of remote exercise programs in reducing pain for patients with knee osteoarthritis: a systematic review of randomized trials Osteoarthr Cartil Open 2022 4 100264 10.1016/j.ocarto.2022.100264 36474946 PMC9718080 46. Xie S-H Wang Q Wang L-Q Wang L Song K-P He C-Q Effect of internet-based rehabilitation programs on improvement of pain and physical function in patients with knee osteoarthritis: systematic review and meta-analysis of randomized controlled trials J Med Internet Res 2021 23 1 e21542 10.2196/21542 33399542 PMC7815452 47. Safari R Jackson J Sheffield D Digital self-management interventions for people with osteoarthritis: systematic review with meta-analysis J Med Internet Res 2020 22 7) e15365 10.2196/15365 32706657 PMC7428148 48. Tsang MP Man GCW Xin H Chong YC Ong MT-Y Yung PS-H The effectiveness of telerehabilitation in patients after total knee replacement: a systematic review and meta-analysis of randomized controlled trials J Telemed Telecare 2024 30 795 808 10.1177/1357633X221097469 35549756 49. Marszalek J Price LL Harvey WF Driban JB Wang C Outcome expectations and osteoarthritis: association of perceived benefits of exercise with self-efficacy and depression Arthritis Care Res (Hoboken) 2017 69 491 8 10.1002/acr.22969 27390257 PMC5219866 50. Naugle KM Blythe C Naugle KE Keith N Riley ZA Kinesiophobia predicts physical function and physical activity levels in chronic pain-free older adults Front Pain Res 2022 3 874205 10.3389/fpain.2022.874205 PMC9091550 35571145 51. LaRowe LR Bakhshaie J Vranceanu A-M Greenberg J Anxiety, pain catastrophizing, and pain outcomes among older adults with chronic orofacial pain J Behav Med 2024 47 537 43 10.1007/s10865-024-00473-7 38383685 52. Liang Z Tian S Wang C Zhang M Guo H Yu Y The best exercise modality and dose for reducing pain in adults with low back pain: a systematic review with model-based Bayesian network meta-analysis J Orthop Sport Phys Ther 2024 54 315 27 10.2519/jospt.2024.12153 38457134 53. Lythreatis S Singh SK El-Kassar A-N The digital divide: a review and future research agenda Technol Forecast Soc Change 2022 175 121359 10.1016/j.techfore.2021.121359 54. Wong CK Mak RY Kwok TS Tsang JS Leung MY Funabashi M Prevalence, incidence, and factors associated with non-specific chronic low back pain in community-dwelling older adults aged 60 years and older: a systematic review and meta-analysis J Pain 2022 23 509 34 10.1016/j.jpain.2021.07.012 34450274 55. Cai Y Liu F Wanigatunga AA Urbanek JK Simonsick EM Ferrucci L Musculoskeletal pain characteristics and objectively measured physical activity in older adults J Gerontol A Biol Sci Med Sci 2024 79 4 glae039 10.1093/gerona/glae039 38310640 PMC10960625 56. Weber F Kloek C Stuhrmann S Blum Y Grüneberg C Veenhof C Usability and preliminary effectiveness of an app-based physical activity and education program for people with hip or knee osteoarthritis—a pilot randomized controlled trial Arthritis Res Ther 2024 26 83 10.1186/s13075-024-03291-z 38600607 PMC11005282 57. Moutzouri M Koumantakis GA Hurley M Kladouchou AG Gioftsos G Effectiveness of a web-guided self-managed telerehabilitation program enhanced with outdoor physical activity on physical function, physical activity levels and pain in patients with knee osteoarthritis: a randomized controlled trial J Clin Med 2024 13 4 934 10.3390/jcm13040934 38398248 PMC10889528 58. Master H Coronado RA Whitaker S Block S Vanston SW Pennings JS Combining wearable technology and telehealth counseling for rehabilitation after lumbar spine surgery: feasibility and acceptability of a physical activity intervention Phys Ther 2024 104 2 pzad096 10.1093/ptj/pzad096 37478463 PMC10851843 59. Shim GY Kim EH Lee SJ Chang CB Lee YS Lee JI Postoperative rehabilitation using a digital healthcare system in patients with total knee arthroplasty: a randomized controlled trial Arch Orthop Trauma Surg 2023 143 6361 70 10.1007/s00402-023-04894-y 37129691 60. Lee E-L Jang MH Lee B-J Han SH Lee HM Choi SU Home-based remote rehabilitation leads to superior outcomes for older women with knee osteoarthritis: a randomized controlled trial J Am Med Dir Assoc 2023 24 10 1555 61 10.1016/j.jamda.2023.08.013 37699531 61. Janhunen M Katajapuu N Paloneva J Pamilo K Oksanen A Keemu H Effects of a home-based, exergaming intervention on physical function and pain after total knee replacement in older adults: a randomised controlled trial BMJ Open Sport Exerc Med 2023 9 e001416 10.1136/bmjsem-2022-001416 36896366 PMC9990686 62. Sánchez-Laulhé PR Biscarri-Carbonero Á Suero-Pineda A Luque-Romero LG Barrerogarcía FJ Blanquero J The effects of a mobile app-delivered intervention in people with symptomatic hand osteoarthritis: a pragmatic randomized controlled trial Eur J Phys Rehabil Med 2023 59 1 54 64 10.23736/S1973-9087.22.07744-9 36633498 PMC10035439 63. Thiengwittayaporn S Wattanapreechanon P Sakon P Peethong A Ratisoontorn N Charoenphandhu N Development of a mobile application to improve exercise accuracy and quality of life in knee osteoarthritis patients: a randomized controlled trial Arch Orthop Trauma Surg 2023 143 729 38 10.1007/s00402-021-04149-8 34453570 PMC8397851 64. Nuevo M Rodríguez-Rodríguez D Jauregui R Fabrellas N Zabalegui A Conti M Telerehabilitation following fast-track total knee arthroplasty is effective and safe: a randomized controlled trial with the ReHub® platform Disabil Rehabil 2023 46 2629 39 10.1080/09638288.2023.2228689 37403684 65. Cheng KC Lau KMK Cheng ASK Lau TSK Lau FOT Lau MCH Use of mobile app to enhance functional outcomes and adherence of home-based rehabilitation program for elderly with hip fracture: a randomized controlled trial Hong Kong Physiother J 2022 42 02 99 110 10.1142/S101370252250010X 37560168 PMC10406639 66. An J Ryu H-K Lyu S-J Yi H-J Lee B-H Effects of preoperative telerehabilitation on muscle strength, range of motion, and functional outcomes in candidates for total knee arthroplasty: a single-blind randomized controlled trial Int J Environ Res Public Health 2021 18 11 6071 10.3390/ijerph18116071 34199913 PMC8200128 67. Fanning J Brooks AK Ip E Nicklas BJ Rejeski WJ Nesbit B A mobile health behavior intervention to reduce pain and improve health in older adults with obesity and chronic pain: the MORPH pilot trial Front Digit Heal 2020 2 598456 10.3389/fdgth.2020.598456 PMC8018691 33817686 68. Doiron-Cadrin P Kairy D Vendittoli P-A Lowry V Poitras S Desmeules F Feasibility and preliminary effects of a tele-prehabilitation program and an in-person prehablitation program compared to usual care for total hip or knee arthroplasty candidates: a pilot randomized controlled trial Disabil Rehabil 2020 42 7 989 98 10.1080/09638288.2018.1515992 30638076 69. Pronk Y Peters M Sheombar MCW Brinkman JM Effectiveness of a mobile eHealth app in guiding patients in pain control and opiate use after total knee replacement: randomized controlled trial JMIR Mhealth Uhealth 2020 8 1 14 10.2196/16415 PMC7101497 32167483 70. Pelle T Bevers K van der Palen J van den Hoogen FHJ van den Ende CHM Effect of the Dr. Bart application on healthcare use and clinical outcomes in people with osteoarthritis of the knee and/or hip in The Netherlands; a randomized controlled trial Osteoarthr Cartil 2020 28 4 418 27 10.1016/j.joca.2020.02.831 32119972 71. Zadro JR Shirley D Simic M Mousavi SJ Ceprnja D Maka K Video-game-based exercises for older people with chronic low back pain: a randomized controlled table trial (GAMEBACK) Phys Ther 2019 99 1 14 27 10.1093/ptj/pzy112 30247715 72. Kloek CJJ Bossen D Spreeuwenberg PM Dekker J de Bakker DH Veenhof C Effectiveness of a blended physical therapist intervention in people with hip osteoarthritis, knee osteoarthritis, or both: a cluster- randomized controlled trial Phys Ther 2018 98 7 560 70 10.1093/ptj/pzy045 29788253 PMC6016690 73. Rini C Porter LS Somers TJ McKee DC DeVellis RF Smith M Automated internet-based pain coping skills training to manage osteoarthritis pain: a randomized controlled trial Pain 2015 156 5 837 48 10.1097/j.pain.0000000000000121 25734997 PMC4402249 74. Bossen D Veenhof C Van Beek KE Spreeuwenberg PM Dekker J Bakker D Effectiveness of a web-based physical activity intervention in patients with knee and/or hip osteoarthritis: randomized controlled trial J Med Internet Res 2013 15 e257 10.2196/jmir.2662 24269911 PMC3841352 75. Gohir SA Eek F Kelly A Abhishek A Valdes AM Effectiveness of internet-based exercises aimed at treating knee osteoarthritis the iBEAT-OA randomized clinical trial JAMA Netw Open 2021 4 2 e210012 10.1001/jamanetworkopen.2021.0012 33620447 PMC7903254 76. Charlton JM Krowchuk NM Eng JJ Li LC Hunt MA Remotely delivered, individualized, and self-directed gait modification for knee osteoarthritis: a pilot trial Clin Biomech (Bristol, Avon) 2023 106 105981 10.1016/j.clinbiomech.2023.105981 37201438 77. Moffet H Tousignant M Nadeau S Mérette C Boissy P Corriveau H In-home telerehabilitation compared with face to-face rehabilitation after total knee arthroplasty: a noninferiority randomized controlled trial J Bone Jt Surg Am 2015 97 14 1129 41 10.2106/JBJS.N.01066 26178888 78. Osterloh J Knaack F Bader R Behrens M Peschers J Nawrath L The effect of a digital-assisted group rehabilitation on clinical and functional outcomes after total hip and knee arthroplasty—a prospective randomized controlled pilot study BMC Musculoskelet Disord 2023 24 1 11 10.1186/s12891-023-06270-8 36915066 PMC10010966 79. Timmers T Janssen L van der Weegen W Das D Marijnissen WJ Hannink G The effect of an app for day-to-day postoperative care education on patients with total knee replacement: randomized controlled trial JMIR Mhealth Uhealth 2019 7 1 16 10.2196/15323 PMC6914303 31638594 80. Tousignant M Moffet H Boissy P Corriveau H Cabana F Marquis F A randomized controlled trial of home telerehabilitation for post-knee arthroplasty J Telemed Telecare 2011 17 195 8 10.1258/jtt.2010.100602 21398389 81. Kane LT Thakar O Jamgochian G Lazarus MD Abboud JA Namdari S The role of telehealth as a platform for postoperative visits following rotator cuff repair: a prospective, randomized controlled trial J Shoulder Elb Surg 2020 29 775 83 10.1016/j.jse.2019.12.004 32197766 82. Nelson M Bourke M Crossley K Russell T Telerehabilitation is non-inferior to usual care following total hip replacement—a randomized controlled non-inferiority trial Physiother (United Kingdom) 2020 107 19 27 10.1016/j.physio.2019.06.006 32026820 83. Allen KD Arbeeva L Callahan LF Golightly YM Goode AP Heiderscheit BC Physical therapy vs internet-based exercise training for patients with knee osteoarthritis: results of a randomized controlled trial Osteoarthr Cartil 2018 26 383 96 10.1016/j.joca.2017.12.008 PMC6021028 29307722 84. Akgül H Birtane M Tonga E Effects of a digitally supported physical activity intervention in knee osteoarthritis: a pilot randomized controlled trial Musculoskeletal Care 2025 23 1 12 10.1002/msc.70085 PMC11949769 40148223 ",
  "metadata": {
    "Title of this paper": "Effects of a digitally supported physical activity intervention in knee osteoarthritis: a pilot randomized controlled trial",
    "Journal it was published in:": "Frontiers in Pain Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484128/"
  }
}