{
  "title": "Paper_790",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473007 PMC12473007.1 12473007 12473007 41012502 10.3390/pharmaceutics17091166 pharmaceutics-17-01166 1 Article Bioavailability Enhancement of Curcumin by PEG-Based Gastroretentive System: Development and In Vitro Evaluation https://orcid.org/0009-0001-3945-2253 Csendes Orsolya Conceptualization Methodology Investigation Data curation Writing – original draft 1 2 https://orcid.org/0000-0002-0258-2599 Vasvári Gábor Conceptualization Investigation Resources Data curation Writing – original draft 1 https://orcid.org/0000-0003-2123-5821 Haimhoffer Ádám Conceptualization Data curation Writing – review & editing 1 https://orcid.org/0000-0003-1466-7052 Horváth László Methodology Investigation 3 https://orcid.org/0000-0001-8610-3788 Béresová Monika Methodology Investigation Writing – original draft 4 https://orcid.org/0000-0002-0617-6264 Bényei Attila Methodology Investigation Writing – original draft 5 https://orcid.org/0000-0001-8663-2890 Bácskay Ildikó Conceptualization Resources Writing – original draft Writing – review & editing Funding acquisition 1 6 Fehér Pálma Methodology Investigation 1 https://orcid.org/0000-0001-9724-0614 Ujhelyi Zoltán Investigation Resources Writing – review & editing 7 https://orcid.org/0000-0002-5477-0540 Nemes Dániel Conceptualization Methodology Writing – review & editing 1 2 * Izake Emad L. Academic Editor 1 csendes.orsolya@pharm.unideb.hu haimhoffer.adam@euipar.unideb.hu bacskay.ildiko@pharm.unideb.hu feher.palma@pharm.unideb.hu 2 3 horvath.laszlo@pharm.unideb.hu 4 beres.monika@med.unideb.hu 5 benyei.attila@science.unideb.hu 6 7 ujhelyi.zoltan@pharm.unideb.hu * nemes.daniel@pharm.unideb.hu 05 9 2025 9 2025 17 9 497664 1166 11 7 2025 25 8 2025 29 8 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Results: Conclusions: curcumin self-emulsifying system gastroretention bioavailability melt-foaming extended release TKP2021-EGA-18 Ministry of Culture and Innovation of Hungary from the National Research, Development and Innovation Fund TKP2021-EGA 2022-1.2.2-TÉT-IPARI-UZ-2022-00006 This research was funded by TKP2021-EGA-18, implemented with support provided by the Ministry of Culture and Innovation of Hungary from the National Research, Development and Innovation Fund, financed under the TKP2021-EGA funding scheme, and by 2022-1.2.2-TÉT-IPARI-UZ-2022-00006 for the common research and development of different prototypes containing natural herb extracts for industrial utilization. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Oral drug delivery is the most frequently used method of drug administration worldwide. The main reasons for this are easy administration and consequently higher patient compliance compared to other drug delivery routes. Although oral delivery is widespread, it has certain limitations. One of the most significant factors is the variability in absorption from the gastrointestinal tract. Many factors influence the absorption process, such as age, sex, diet, genetics, and various diseases. Another important factor is gastric emptying. Some active pharmaceutical ingredients are best absorbed in the upper parts of the gastrointestinal tract, namely, the stomach and duodenum. Moreover, for drugs that are best absorbed in the stomach, short gastric emptying results in incomplete drug absorption from the delivery system and a decrease in effect [ 1 2 3 The biopharmaceutical classification system (BCS) is a well-established method for classifying active pharmaceutical ingredients (APIs) based on their water solubility and lipid permeability [ 4 5 6 Curcumin (CUR) was selected as the model active ingredient in this study. This is due to the fact that curcumin belongs to the BCS class IV, as its water solubility is only 5.75 µg/mL [ 7 −6 8 9 10 11 12 13 14 15 16 Solid self-emulsifying drug delivery systems (SEDDSs) combine the benefits of solid dosage forms and self-emulsifying systems. Compared to liquid SEDDSs, solid systems possess more advantageous microbiological and thermodynamic stability [ 17 18 19 20 21 Lipid-based drug carrier systems can be sorted into four major groups based on their composition, as previously researched by Pouton et al. [ 22 23 24 25 The emulsions formed by these self-emulsifying systems can be further characterized as macro-, micro-, and nanoemulsions. Macroemulsions have a particle size range of 1–100 µm and large polydispersity, which causes them to appear opaque. These systems are thermodynamically unstable and exhibit weak kinetic stability [ 20 26 27 26 27 16 26 28 By extending the release of the API from the product, the absorption and effect of the drug are increased. Gastroretention is the ability to resist gastric motility, thus remaining inside the stomach and ensuring an extended drug release into the gastric juice [ 29 30 31 Helicobacter pylori 32 33 34 35 36 37 The combination of gastroretentive and self-emulsifying systems offers longer gastric retention time and ensures that the API has increased dissolution in the gastric juice, resulting in higher bioavailability of the drug [ 20 38 2. Materials and Methods 2.1. Materials When selecting excipients, safe oral administration and low toxicity were the most important parameters. The selected materials are considered “Generally Regarded As Safe” (GRAS) by the FDA, and their previous safe use has been documented by multiple research groups. Glycerol distearate (type I) (GS; Precirol ATO 5 [ 39 40 40 41 42 42 41 43 2.2. Preparation of Self-Emulsifying Systems Curcumin and other components were measured using an analytical balance. All components, except CUR, were heated to 70 °C and mixed to form a homogenous melt. Then, CUR was added and dissolved by mixing on a heating magnetic stirrer. The amounts of each component are listed in Table 1 22 26 44 45 2.3. Dynamic Light Scattering (DLS) Measurements for Droplet Size Distribution An amount of 0.1 g of each composition was dispersed in 90 mL of artificial gastric juice (prepared according to Ph. Eur.). Fragmentation using a spatula spoon aided the rapid disintegration and dissolution of the sample. After the total dissolution of the samples, the dispersion was pipetted into polystyrene cuvettes and immediately measured. Three parallel measurements were performed using a Malvern Nano-ZSP Zetasizer instrument (Malvern Instruments, Malvern, UK). 2.4. Apparent Viscosity Measurement of the Molten SEDDS Containing Curcumin The apparent viscosity of the samples was studied using a Rheolab QC rotational rheometer (Anton Paar GmbH, Graz, Austria) with a CC27 concentric cylinder system and a constant temperature maintained using a rheometer-controlled water bath. Three parallel measurements were performed at a constant shear rate of 1000 RPM. After adding the solid samples into the measuring cup, they were heated to 61 °C, and the measurement was started. The viscosity curves were recorded using the manufacturer-developed RheoPlus 2.6x software between 61 °C and 45 °C. 2.5. Melt Foaming Melt foaming was carried out according to our previously developed and published technology to create molten dispersions at atmospheric pressure using benchtop equipment [ 38 42 Section 2.2 2.6. PXRD Study Paraffin oil was used to fix the pulverized samples on a MiTeGen MicroMeshes (MiTeGen LLC., Ithaca, NY, USA) sample holder. A Bruker-D8 Venture diffractometer (Bruker, Billerica, MA, USA) equipped with INCOATEC IμS 3.0 dual (Cu and Mo) sealed tube microsources (Incoatec GmbH, Geesthacht, Germany) and a Photon 200 Charge-integrating Pixel Array detector was used for data collection with Debye–Scherrer geometry. For all measurements, room temperature and CuKα (λ = 1.54178 Å) radiation were used. Data collection was performed by 360° phi scans for 2 min at theta = 12, 24, and 36°; omega = −6°; chi 0° with 150 mm sample-detector distance. Images were created in the phi scan mode and merged. Data evaluation was carried out using APEX3 (Version 2018.7-2, BrukerAXS Inc., Madison, WI, USA) and DiffracEva software (Version 4.2.2.3, BrukerAXS Inc., Madison, WI, USA), respectively. 2.7. Differential Scanning Calorimetry A DSC 300 Caliris Supreme (Netzsch-Gerätebau GmbH, Selb, Bavaria, Germany) instrument was used for the experiments. The samples (10 ± 1 mg) were encapsulated into aluminum pans (V = 40 µL), which were then hermetically sealed and manually pierced. DSC curves were recorded from 20 °C (293 K) to 250 °C (523 K) with a heating rate of 10 K min −1 3 −1 ® 2.8. In Vitro Drug Dissolution An ERWEKA DT 626 dissolution tester (ERWEKA GmbH, Langen, Hessen, Germany) assembled for the rotating paddle method with a paddle speed of 75 RPM was used for the three parallel samples of the two selected formulations. Hydrochloric acid medium (900 mL, pH 1.2) was loaded into the dissolution vessels and maintained at 37 °C during the tests [ 38 (v v) Mathematical analysis was used to determine the dissolution profiles of the two compositions. The measured concentrations of the released curcumin were fitted to first-order, zero-order, and Korsmeyer–Peppas model equations. The determination coefficients of the obtained linear equations were evaluated, and release kinetics with a similarity index more than 0.9 were accepted as correlating with a certain model. The following equations were used for the evaluation: For the zero-order kinetics model: (1) Q = Q 0 + k 0 t For the first-order kinetics model: (2) Q t = Q 0 × e − k 1 × t For the Korsmeyer–Peppas kinetics: (3) Q t Q ∞ = k k p × t n Q t Q 0 Q t t Q t Q ∞ t k 0 k 1 k kp n 38 2.9. Microtomography and Size Distribution of Foam Bubbles The internal structure of the bullet-shaped sample was assessed using a compact desktop micro-CT system, SkyScan 1272 (Bruker, Billerica, MA, USA). The image pixel size was 5 µm with a 2688 × 4032 matrix size, without any further correction, at 50 kV and 200 µA. The cross-sectional images were reconstructed from tomography projection images using the SkyScan NRecon package (version: 2.0.4.2) with post-alignment, beam-hardening correction, ring artifact correction, and smoothing. DICOM and BPM formats were used for the images. CTAn software (version: 1.18.8.0 64-bit) was used for the 3D ROI analyses. Thresholding, region of interest (ROI) shrink-wrap, Relode Image, and 3D analysis plugins were applied. After removing the background, the bubbles inside the sample were automatically segmented (threshold based) from the ROI area (global gray scale 0–255, bubble 0–80). The 3D visualization was performed using DataViewer (version: 1.5.6.2 64-bit) and CTVox (version: 3.3.0 r1403 64-bit) software, depicting the ROI region with RGB color coding. 2.10. Cell Culturing and Cytotoxicity Assays The Caco-2 cell line, which is a well-established in vitro model for both intestinal absorption and oral toxicity [ 46 47 2 The cytotoxic effects of composition S14 with 10% SM were tested using MTT and Neutral Red assays. We employed two assays to complement each other, as yellow MTT is reduced to purple formazan crystals through mitochondrial activity, while the Neutral Red stain is taken up by passive diffusion [ 48 4 2.11. Cellular Transportation Test Cells were seeded into Corning ® ® 2 49 2 Samples of curcumin and curcumin-containing SEDDSs were prepared in Fetal Bovine Serum. The SEDDS sample was created by dispersing 1 g of the SEDDS in 900 mL of FBS. The control sample was prepared by dispersing 35.29 mg of pure curcumin in 900 mL of FBS. The protein fraction was precipitated using acetonitrile at a 2:1 volume ratio (acetonitrile/sample). The solutions obtained were analyzed using a Hitachi LaChrom ELITE HPLC system equipped with a Photodiode Array Detector (Hitachi High-Tech Corp., Tokyo, Japan). An Agilent HC-C18(2) (Agilent Technologies Inc., Santa Clara, CA, USA) reverse-phase column (4.6 × 150 mm, 5 µm, 400 bar) was used for the experiments, heated to and kept at 40 °C. The detector was set at 430 nm. A 4:6 ratio of acetonitrile and 2% acetic acid solution was used as the mobile phase with a flow rate of 1.0 m/min. Data collection, processing, and analysis were performed using EZChrom Elite Software™ version 3.2.0 (Hitachi High-Tech Corp., Tokyo, Japan) from 10 µL of both samples. 3. Results 3.1. Droplet Sizes of Self-Emulsifying Systems Using DLS analysis, each original composition was examined in a biorelevant solution. We determined the particle sizes and polydispersity indices of the hydrated emulsion droplets in each solution. The received particle sizes are listed in Table 2 Compositions with less ideal traits were discarded when selecting candidates for further experiments. These critical traits were the average particle size (z average) and the polydispersity index (PDI). We aimed to create type IV self-nanoemulsifying systems; therefore, the upper limit of particle size was set to 32 nm, whereas the upper limit of PDI was 0.3. Thus, 9 out of 20 samples (S5–S8, S11, S14, S15, S17, and S18) were selected for further viscosity studies, where their respective melting/freezing points were determined. 3.2. Apparent Viscosity of Molten Curcumin-Loaded SEDDSs Based on the DLS measurement results, only the previously selected SEDDSs were used for viscosity measurements. Figure 1 As shown in Figure 1 3.3. Effect of Dissolution Retardants on the Droplet Size Following the viscosity measurement, dissolution retardants were added to the formulation, and their droplet sizes were measured again using DLS. These formulations were prepared using the same method described in Section 2.2 Table 3 As expected, droplet sizes increased after the addition of lipophilic dissolution retardants to the mixtures. Comparing the results, we can conclude that SA had the most prominent effect on modifying the particle size of the original nanoemulsions. GS also increased the average droplet sizes (range of 1038–3772 nm), while in the case of 5% SM, the droplet sizes were less than 1 micron for formulations S6 and S7. However, S17, S14, and S18 showed average droplet sizes greater than 2 or 3 microns. Considering the unfavorable effects of GS and SA on particle size, further experiments were conducted only with different concentrations of SM. 3.4. Effect of Stearylamine Content 3.4.1. Droplet Size Distribution We examined compositions (S5–S18) containing 5 and 10% ( m m Table 4 The z average values indicate that the level of lipophilic dissolution retardants should be optimized in the solid formulations. Interestingly, in the cases of S6, S7, and S17, the droplet sizes increased to 2.5 and 6.3 µm. However, S14 and S15 showed a decrease in the z-average values. Namely, from 2687 nm to 2122 in the case of S14 and from 1203 to 666.6 nm for the composition of S15. Compositions S14 S10% and S15 SM10% had the lowest z-average values among all tested compositions; thus, they were selected for the dissolution tests. 3.4.2. Drug Dissolution The results of the dissolution tests are shown in Figure 2 Figure 2 As shown in Figure 2 Table 5 50 51 3.5. Structural Characterization of S14 SM10% Using PXRD Using the X-Ray Powder Diffraction technique, we analyzed the diffractograms of the solid S14 SM10% formulation, as well as pure crystalline curcumin, PEG 6000, Gelucire 44/14, Kolliphor RH40, and octadecylamine. The diffractogram of S14 SM10% was compared to all three materials. The diffractogram of CUR ( Figure 3 52 Figure 3 3.6. Results of Foaming Process After confirming the optimal dissolution of the API in the formulation, we produced a solid system with a lower density than water using the method and parameters described in our previous publications [ 38 42 Section 2.5 After demolding the solidified products, we gently brushed their surfaces. The cleaned products were measured using an analytical balance, and the density was calculated by knowing the volume of the molding forms. The resulting average density was 0.97 g/cm 3 3 3.7. Microtomographic Assessment of Solid Foam Structure Looking at Figure 4 Moreover, as shown in Figure 5 3.8. Differential Scanning Calorimetry The results of the tests are shown in Figure 6 53 54 55 2 56 3.9. Results of Cytotoxicity Assays As mentioned in Section 2.10 As shown in Figure 7 Figure 8 57 58 3.10. Cellular Transportation Test Caco-2 cells were seeded on cell culture inserts and grown until a stable cellular monolayer was formed. We compared the cellular transport of pure curcumin with that of our developed formulation. The results are shown in Figure 9 app −6 −7 4. Discussion Our aim was to create a gastroretentive self-emulsifying drug delivery system using curcumin as a model API. First, 20 solid formulations were created ( Table 1 PEG 4000 and PEG 6000 were selected as the hydrophilic carriers. They are widely used as water-soluble carriers for water-insoluble drugs [ 59 60 20 61 62 63 Table 2 Regarding the apparent viscosity values of the molten formulations, no formulations were discarded; however, it was determined that to achieve an ideal texture, the freezing point of the formulation should fall between 47 and 49 °C. In contrast, PEGs increased the viscosity of the molten formulations, as shown in Figure 1 The next step in the development process was to add dissolution retardants to the composition. All three compounds, glycerol distearate (GS; Precirol ATO 5), stearic acid (SA; type 50), and stearylamine (SM), are well-established excipients in the field of pharmaceutical technology [ 64 65 66 62 67 To find a suitable formulation for extended release, we examined the sample with the closest composition to S15. This formulation was S14, with PEG 6000 instead of 4000 and Gelucire 44/14 instead of 48/16. The ratio of the related components in this one was the same as that in S15. Although S14 almost does not fit the criteria regarding the particle size and polydispersity index, it still produced the third-smallest particles when 10% SM was added to the formulation. The only formulations that produced smaller vesicles were S15 and S8; however, S8 was discarded because of its soft and malleable consistency during the viscosity measurements. S15 SM10% released nearly 90% of its API content in 3 h, similar to first-order release kinetics. This was disadvantageous for us, since such a release profile indicates a tendency for dose dumping. However, the slower drug release of S14 SM10% would contribute to a more balanced drug release, with a well-predictable drug release profile. The S14 SM10% formulation required 5 h to release 55% of its curcumin content. The ICH guidelines declare that three sampling points, roughly at 20–30%, ~50%, and 80% of API release, should be used when evaluating the dissolution test of modified release products [ 68 69 70 71 We used our previously published method to formulate a hot-melt foam system to ensure gastroretentive properties of the system. Micro-computed tomography investigation verified a homogeneous internal structure, as the majority of the air vesicles had a diameter of 80 µm and the vesicles had a narrow size range. Thus, we were able to conclude that the structure was homogenous. The density was calculated using the previously determined volume of the cavities (1.027 mL). Fifteen intact samples were demolded and measured, and each had a density lower than 0.99336 g/mL, with the density of water at 37 °C. This was further confirmed by flotation tests using three random samples in 900 mL of 37 °C artificial gastric juice; all three samples floated on top of the medium. All the components, as well as the S14 SM10% formulation, were examined using differential scanning calorimetry ( Figure 6 72 73 Figure 3 74 In the cytotoxicity assays, a serial dilution was tested on human colorectal Caco-2 cells. Neutral Red assays revealed no harmful effects on the cells ( Figure 8 Figure 7 75 76 After evaluating the low cytotoxic potential of our samples, we compared pure curcumin to our formulation using a well-established in vitro model of intestinal absorption [ 49 Figure 9 67 5. Conclusions In summary, we created a solid self-emulsifying system using Stearylamine, Kolliphor RH40, Gelucire 44/14, and PEG 6000 for the extended release of curcumin as a model API. The solid dispersion was foamed at atmospheric pressure using our batch technology, resulting in a unique, novel combination of solid SEDDSs and targeted gastroretentive systems. Physicochemical investigations confirmed that the API was dissolved in the foamed matrix, while drug dissolution experiments confirmed extended release. In vitro investigations on human Caco-2 cells confirmed a high degree of biocompatibility and enhanced transmembrane permeability. Acknowledgments The authors express their gratitude to Gattefossé and Azelis Hungary Ltd. for providing the material samples. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, O.C., G.V., Á.H., I.B. and D.N.; methodology, O.C., L.H., M.B., A.B., P.F. and D.N.; investigation, O.C., G.V., L.H., M.B., A.B., P.F. and Z.U.; resources, G.V., Z.U. and I.B.; data curation, O.C., G.V. and Á.H.; writing—original draft preparation, O.C., G.V., M.B., A.B. and I.B.; writing—review and editing, Á.H., Z.U., I.B. and D.N.; funding acquisition, I.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in the study are included in the article, further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of this study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. References 1. Durán-Lobato M. Niu Z. Alonso M.J. Oral Delivery of Biologics for Precision Medicine Adv. Mater. 2020 32 1901935 10.1002/adma.201901935 31222910 2. Alqahtani M.S. Kazi M. Alsenaidy M.A. Ahmad M.Z. Advances in Oral Drug Delivery Front. Pharmacol. 2021 12 618411 10.3389/fphar.2021.618411 33679401 PMC7933596 3. Ruiz-Picazo A. Lozoya-Agullo I. González-Álvarez I. Bermejo M. González-Álvarez M. Effect of Excipients on Oral Absorption Process According to the Different Gastrointestinal Segments Expert Opin. Drug Deliv. 2021 18 1005 1024 10.1080/17425247.2020.1813108 32842776 4. Mishra V. Gupta U. Jain N.K. Biowaiver: An Alternative to in Vivo Pharmacokinetic Bioequivalence Studies Pharmazie 2010 65 155 161 10.1691/ph.2010.9231 20383933 5. Kalepu S. Nekkanti V. Insoluble Drug Delivery Strategies: Review of Recent Advances and Business Prospects Acta Pharm. Sin. B 2015 5 442 453 10.1016/j.apsb.2015.07.003 26579474 PMC4629443 6. Vesicular Drug Delivery Systems for Oral Absorption Enhancement Chin. Chem. Lett. 2024 35 109129 10.1016/j.cclet.2023.109129 7. DrugBank Curcumin: Uses, Interactions, Mechanism of Action Available online: https://go.drugbank.com/drugs/DB11672 (accessed on 30 May 2025) 8. Wahlang B. Pawar Y.B. Bansal A.K. Identification of Permeability-Related Hurdles in Oral Delivery of Curcumin Using the Caco-2 Cell Model Eur. J. Pharm. Biopharm. 2011 77 275 282 10.1016/j.ejpb.2010.12.006 21147222 9. Zhang D.W. Fu M. Gao S.H. Liu J.L. Curcumin and Diabetes: A Systematic Review Evid.-Based Complement. Altern. Med. 2013 2013 636053 10.1155/2013/636053 PMC3857752 24348712 10. Li H. Sureda A. Devkota H.P. Pittalà V. Barreca D. Silva A.S. Tewari D. Xu S. Nabavi S.M. Curcumin, the Golden Spice in Treating Cardiovascular Diseases Biotechnol. Adv. 2020 38 107343 10.1016/j.biotechadv.2019.01.010 30716389 11. Cheraghipour K. Ezatpour B. Masoori L. Marzban A. Sepahvand A. Rouzbahani A.K. Moridnia A. Khanizadeh S. Mahmoudvand H. Anti-Candida Activity of Curcumin: A Systematic Review Curr. Drug Discov. Technol. 2021 18 379 390 10.2174/1570163817666200518074629 32418527 12. Cas M.D. Ghidoni R. Dietary Curcumin: Correlation between Bioavailability and Health Potential Nutrients 2019 11 2147 10.3390/nu11092147 31500361 PMC6770259 13. Santos A.C. Costa D. Ferreira L. Guerra C. Pereira-Silva M. Pereira I. Peixoto D. Ferreira N.R. Veiga F. Cyclodextrin-Based Delivery Systems for in Vivo-Tested Anticancer Therapies Drug Deliv. Transl. Res. 2021 11 49 71 10.1007/s13346-020-00778-5 32441011 14. Kotagale N.R. Charde P.B. Helonde A. Gupta K.R. Umekar M.J. Raut N.S. Studies on Bioavailability Enhancement of Curcumin Int. J. Pharm. Pharm. Sci. 2019 12 20 25 10.22159/ijpps.2020v12i2.36027 15. Agrawal N. Jaiswal M. Bioavailability Enhancement of Curcumin via Esterification Processes: A Review Eur. J. Med. Chem. Rep. 2022 6 100081 10.1016/j.ejmcr.2022.100081 16. Cui J. Yu B. Zhao Y. Zhu W. Li H. Lou H. Zhai G. Enhancement of Oral Absorption of Curcumin by Self-Microemulsifying Drug Delivery Systems Int. J. Pharm. 2009 371 148 155 10.1016/j.ijpharm.2008.12.009 19124065 17. Friedl J.D. Jörgensen A.M. Le-Vinh B. Braun D.E. Tribus M. Bernkop-Schnürch A. Solidification of Self-Emulsifying Drug Delivery Systems (SEDDS): Impact on Storage Stability of a Therapeutic Protein J. Colloid Interface Sci. 2021 584 684 697 10.1016/j.jcis.2020.11.051 33234314 18. Maji I. Mahajan S. Sriram A. Medtiya P. Vasave R. Khatri D.K. Kumar R. Singh S.B. Madan J. Singh P.K. Solid Self Emulsifying Drug Delivery System: Superior Mode for Oral Delivery of Hydrophobic Cargos J. Control. Release 2021 337 646 660 10.1016/j.jconrel.2021.08.013 34384795 19. Thakare P. Mogal V. Borase P. Dusane J. Kshirsagar S. A Review on Self-Emulsified Drug Delivery System Self-Emulsifying Pharm. Biol. Eval. 2016 3 140 153 20. Uttreja P. Karnik I. Adel Ali Youssef A. Narala N. Elkanayati R.M. Baisa S. Alshammari N.D. Banda S. Vemula S.K. Repka M.A. Self-Emulsifying Drug Delivery Systems (SEDDS): Transition from Liquid to Solid—A Comprehensive Review of Formulation, Characterization, Applications, and Future Trends Pharmaceutics 2025 17 63 10.3390/pharmaceutics17010063 39861711 PMC11768142 21. Ujhelyi Z. Vecsernyés M. Fehér P. Kósa D. Arany P. Nemes D. Sinka D. Vasvári G. Fenyvesi F. Váradi J. Physico-Chemical Characterization of Self-Emulsifying Drug Delivery Systems Drug Discov. Today Technol. 2018 27 81 86 10.1016/j.ddtec.2018.06.005 30103867 22. Pouton C.W. Lipid Formulations for Oral Administration of Drugs: Non-Emulsifying, Self-Emulsifying and ‘Self-Microemulsifying’ Drug Delivery Systems Eur. J. Pharm. Sci. 2000 11 S93 S98 10.1016/S0928-0987(00)00167-6 11033431 23. Brinkmann J. Exner L. Luebbert C. Sadowski G. In-Silico Screening of Lipid-Based Drug Delivery Systems Pharm. Res. 2020 37 249 10.1007/s11095-020-02955-0 33230602 PMC7683453 24. Xiao L. Yi T. Liu Y. Zhou H. The In Vitro Lipolysis of Lipid-Based Drug Delivery Systems: A Newly Identified Relationship between Drug Release and Liquid Crystalline Phase BioMed Res. Int. 2016 2016 2364317 10.1155/2016/2364317 27294110 PMC4884793 25. Paulus F. Bauer-Brandl A. Stappaerts J. Holm R. Exploring Supersaturated Type IV Lipid-Based Formulations: Impact of Supersaturation, Digestion and Precipitation wInhibition on Cinnarizine Absorption Int. J. Pharm. 2025 678 125725 10.1016/j.ijpharm.2025.125725 40368002 26. Gupta A. Eral H.B. Hatton T.A. Doyle P.S. Nanoemulsions: Formation, Properties and Applications Soft Matter 2016 12 2826 2841 10.1039/C5SM02958A 26924445 27. Suhail N. Alzahrani A.K. Basha W.J. Kizilbash N. Zaidi A. Ambreen J. Khachfe H.M. Microemulsions: Unique Properties, Pharmacological Applications, and Targeted Drug Delivery Front. Nanotechnol. 2021 3 754889 10.3389/fnano.2021.754889 28. Baloch J. Sohail M.F. Sarwar H.S. Kiani M.H. Khan G.M. Jahan S. Rafay M. Chaudhry M.T. Yasinzai M. Shahnaz G. Self-Nanoemulsifying Drug Delivery System (Snedds) for Improved Oral Bioavailability of Chlorpromazine: In Vitro and in Vivo Evaluation Medicina 2019 55 210 10.3390/medicina55050210 31137751 PMC6572212 29. Sanghavi R.S. Agrawal O. Usman M.R.M. Gastroretentive Drug Delivery System: An Overview Res. J. Pharm. Technol. 2022 15 1343 1347 10.52711/0974-360X.2022.00224 30. Vrettos N.-N. Roberts C.J. Zhu Z. Gastroretentive Technologies in Tandem with Controlled-Release Strategies: A Potent Answer to Oral Drug Bioavailability and Patient Compliance Implications Pharmaceutics 2021 13 1591 10.3390/pharmaceutics13101591 34683884 PMC8539558 31. Rajora A. Nagpal K. A Critical Review on Floating Tablets as a Tool for Achieving Better Gastric Retention CRT 2022 39 65 103 10.1615/CritRevTherDrugCarrierSyst.2021038568 34936318 32. Gupta A. Shetty S. Mutalik S. Chandrashekar H.R. Krishnadas N. Mathew E.M. Jha A. Mishra B. Rajpurohit S. Ravi G. Treatment of H. Pylori Infection and Gastric Ulcer: Need for Novel Pharmaceutical Formulation Heliyon 2023 9 e20406 10.1016/j.heliyon.2023.e20406 37810864 PMC10550623 33. Lin H.-L. Chen L.-C. Cheng W.-T. Cheng W.-J. Ho H.-O. Sheu M.-T. Preparation and Characterization of a Novel Swellable and Floating Gastroretentive Drug Delivery System (sfGRDDS) for Enhanced Oral Bioavailability of Nilotinib Pharmaceutics 2020 12 137 10.3390/pharmaceutics12020137 32041184 PMC7076507 34. Grosso R. de-Paz M.-V. Scope and Limitations of Current Antibiotic Therapies against Helicobacter Pylori: Reviewing Amoxicillin Gastroretentive Formulations Pharmaceutics 2022 14 1340 10.3390/pharmaceutics14071340 35890236 PMC9320814 35. Soni H. Pate V.A. Gastro Retentive Drug Delivery System Int. J. Pharm. Sci. Rev. Res. 2015 31 81 85 36. Blynskaya E.V. Tishkov S.V. Vinogradov V.P. Alekseev K.V. Marakhova A.I. Vetcher A.A. Polymeric Excipients in the Technology of Floating Drug Delivery Systems Pharmaceutics 2022 14 2779 10.3390/pharmaceutics14122779 36559272 PMC9786229 37. Almutairi M. Srinivasan P. Zhang P. Austin F. Butreddy A. Alharbi M. Bandari S. Ashour E.A. Repka M.A. Hot-Melt Extrusion Coupled with Pressurized Carbon Dioxide for Enhanced Processability of Pharmaceutical Polymers and Drug Delivery Applications—An Integrated Review Int. J. Pharm. 2022 629 122291 10.1016/j.ijpharm.2022.122291 36252646 38. Vasvári G. Haimhoffer Á. Horváth L. Budai I. Trencsényi G. Béresová M. Dobó-Nagy C. Váradi J. Bácskay I. Ujhelyi Z. Development and Characterisation of Gastroretentive Solid Dosage Form Based on Melt Foaming AAPS PharmSciTech 2019 20 290 10.1208/s12249-019-1500-2 31428895 PMC6700043 39. Farag M.M. Abd El Malak N.S. Yehia S.A. Controlled Buccal Patches of Zaleplon Using Melt Granulation Technique: An Approach to Overcome Early Morning Awakening J. Drug Deliv. Sci. Technol. 2018 43 439 445 10.1016/j.jddst.2017.11.014 40. Içten E. Purohit H.S. Wallace C. Giridhar A. Taylor L.S. Nagy Z.K. Reklaitis G.V. Dropwise Additive Manufacturing of Pharmaceutical Products for Amorphous and Self Emulsifying Drug Delivery Systems Int. J. Pharm. 2017 524 424 432 10.1016/j.ijpharm.2017.04.003 28380390 41. Raman Kallakunta V. Dudhipala N. Nyavanandi D. Sarabu S. Yadav Janga K. Ajjarapu S. Bandari S. Repka M.A. Formulation and Processing of Solid Self-Emulsifying Drug Delivery Systems (HME S-SEDDS): A Single-Step Manufacturing Process via Hot-Melt Extrusion Technology through Response Surface Methodology Int. J. Pharm. 2023 641 123055 10.1016/j.ijpharm.2023.123055 37207857 PMC10429704 42. Haimhoffer Á. Vasvári G. Trencsényi G. Béresová M. Budai I. Czomba Z. Rusznyák Á. Váradi J. Bácskay I. Ujhelyi Z. Process Optimization for the Continuous Production of a Gastroretentive Dosage Form Based on Melt Foaming AAPS PharmSciTech 2021 22 187 10.1208/s12249-021-02066-y 34155595 PMC8217006 43. Tran T. Rades T. Müllertz A. Formulation of Self-Nanoemulsifying Drug Delivery Systems Containing Monoacyl Phosphatidylcholine and Kolliphor ® Asian J. Pharm. Sci. 2018 13 536 545 10.1016/j.ajps.2017.09.006 32104428 PMC7037638 44. Barea S.A. Mattos C.B. Cruz A.C.C. Chaves V.C. Pereira R.N. Simões C.M.O. Kratz J.M. Koester L.S. Solid Dispersions Enhance Solubility, Dissolution, and Permeability of Thalidomide Drug Dev. Ind. Pharm. 2017 43 511 518 10.1080/03639045.2016.1268152 27915573 45. Upadhyay P. Pandit J.K. Wahi A.K. Studies on Biological Macromolecules Lipid-Gelucire Based Gastroretentive Multiparticulate Int. J. Biol. Macromol. 2014 67 463 477 10.1016/j.ijbiomac.2014.03.045 24699418 46. Youhanna S. Lauschke V.M. The Past, Present and Future of Intestinal In Vitro Cell Systems for Drug Absorption Studies J. Pharm. Sci. 2021 110 50 65 10.1016/j.xphs.2020.07.001 32628951 47. Qiu J. Zhang J. Li A. Cytotoxicity and Intestinal Permeability of Phycotoxins Assessed by the Human Caco-2 Cell Model Ecotoxicol. Environ. Saf. 2023 249 114447 10.1016/j.ecoenv.2022.114447 38321666 48. Skrzydlewski P. Twarużek M. Grajewski J. Cytotoxicity of Mycotoxins and Their Combinations on Different Cell Lines: A Review Toxins 2022 14 244 10.3390/toxins14040244 35448853 PMC9031280 49. de Bruijn V.M.P. te Kronnie W. Rietjens I.M.C.M. Bouwmeester H. Intestinal in Vitro Transport Assay Combined with Physiologically Based Kinetic Modeling as a Tool to Predict Bile Acid Levels In Vivo ALTEX-Altern. Anim. Exp. 2024 41 20 36 10.14573/altex.2302011 37528756 50. Paarakh M.P. Jose P.A. Setty C.M. Peterchristoper G.V. Release Kinetics—Concepts and Applications Int. J. Pharm. Res. Technol. 2019 8 12 20 10.31838/ijprt/08.01.02 51. Haimhoffer Á. Vasvári G. Budai I. Béresová M. Deák Á. Németh N. Váradi J. Sinka D. Bácskay I. Vecsernyés M. In Vitro and In Vivo Studies of a Verapamil-Containing Gastroretentive Solid Foam Capsule Pharmaceutics 2022 14 350 10.3390/pharmaceutics14020350 35214082 PMC8878168 52. Mashaqbeh H. Obaidat R. Al-shar’i N.A. Evaluation of EDTA Dianhydride Versus Diphenyl Carbonate Nanosponges for Curcumin AAPS PharmSciTech 2022 23 229 10.1208/s12249-022-02372-z 35974237 53. Xie H. Ma L. Li Y. Fu J. Li Z. Yu X. Gao Q. Preparation and Characterizations of Curcumin Protection and Delivery System Using Linear Dextrin Compounds 2022 2 353 366 10.3390/compounds2040029 54. Otun S. Meehan E. Qi S. Craig D. The Use of Quasi-Isothermal Modulated Temperature Differential Scanning Calorimetry for the Characterization of Slow Crystallization Processes in Lipid-Based Solid Self-Emulsifying Systems Pharm. Res. 2014 32 1316 1324 10.1007/s11095-014-1535-8 25330742 PMC4356888 55. Sharma R. Ansu A. Laiker U. Development of Eutectic Phase Change Materials for Solar Thermal Energy Storage IOP Conf. Ser. Mater. Sci. Eng. 2021 1127 012009 10.1088/1757-899X/1127/1/012009 56. Kiani A. Acocella M. Guerra G. Solid-State Reaction of Alkylamines with CO 2 ChemSusChem 2024 17 e202400264 10.1002/cssc.202400264 38869009 57. Bacanli M. Anlar H.G. Başaran A.A. Başaran N. Assessment of Cytotoxicity Profiles of Different Phytochemicals: Comparison of Neutral Red and MTT Assays in Different Cells in Different Time Periods Turk. J. Pharm. Sci. 2017 14 95 107 10.4274/tjps.07078 32454600 PMC7227846 58. Gomez Perez M. Fourcade L. Mateescu M.A. Paquin J. Neutral Red versus MTT Assay of Cell Viability in the Presence of Copper Compounds Anal. Biochem. 2017 535 43 46 10.1016/j.ab.2017.07.027 28778493 59. Alam M.A. Ali R. Al-Jenoobi F.I. Al-Mohizea A.M. Solid Dispersions: A Strategy for Poorly Aqueous Soluble Drugs and Technology Updates Expert Opin. Drug Deliv. 2012 9 1419 1440 10.1517/17425247.2012.732064 23043303 60. Gangurde A.B. Kundaikar H.S. Javeer S.D. Jaiswar D.R. Degani M.S. Amin P.D. Enhanced Solubility and Dissolution of Curcumin by a Hydrophilic Polymer Solid Dispersion and Its Molecular Modeling Studies J. Drug Deliv. Sci. Technol. 2015 29 226 237 10.1016/j.jddst.2015.08.005 61. Saka O.M. Aygüler C.İ. Özdemir N.S. Sürücü B. Çakırlı E. Nemutlu E. Demirbolat G.M. An Experimental Design Approach for Producing Curcumin-Loaded Solid Lipid Nanoparticles Pharmaceuticals 2025 18 470 10.3390/ph18040470 40283907 PMC12030020 62. Eid A. Elmarzugi N. El Enshasy H. Preparation and Evaluation of Olive Oil Nanoemulsion Using Sucrose Monoester Int. J. Pharm. Pharm. Sci. 2013 5 434 440 63. Zheng K. Zhao J. Wang Q. Zhao Y. Yang H. Yang X. He L. Design and Evaluation of Ginkgolides Gastric Floating Controlled Release Tablets Based on Solid Supersaturated Self-Nanoemulsifying AAPS PharmSciTech 2023 25 7 10.1208/s12249-023-02717-2 38147267 64. Shehata T.M. Abdallah M.H. Ibrahim M.M. Proniosomal Oral Tablets for Controlled Delivery and Enhanced Pharmacokinetic Properties of Acemetacin AAPS PharmSciTech 2015 16 375 383 10.1208/s12249-014-0233-5 25319057 PMC4370976 65. Abd-Elbary A. Tadros M.I. Alaa-Eldin A.A. Sucrose Stearate-Enriched Lipid Matrix Tablets of Etodolac: Modulation of Drug Release, Diffusional Modeling and Structure Elucidation Studies AAPS PharmSciTech 2013 14 656 668 10.1208/s12249-013-9951-3 23572253 PMC3665988 66. Devi R. Comparison of Release Retardant Effect of Some Novel Lipids by Formulating Sustained Release Tablet of BCS Class 1 Drug Indian J. Pharm. Educ. Res. 2020 54 s241 s250 10.5530/ijper.54.2s.80 67. Morakul B. Teeranachaideekul V. Limwikrant W. Junyaprasert V.B. Dissolution and Antioxidant Potential of Apigenin Self Nanoemulsifying Drug Delivery System (SNEDDS) for Oral Delivery Sci. Rep. 2024 14 8851 10.1038/s41598-024-59617-z 38632321 PMC11024192 68. Guideline on Quality of Oral Modified Release Products Available online: https://www.ema.europa.eu/en/documents/scientific-guideline/guideline-quality-oral-modified-release-products_en.pdf (accessed on 7 August 2025) 69. Laracuente M.-L. Yu M.H. McHugh K.J. Zero-Order Drug Delivery: State of the Art and Future Prospects J. Control. Release 2020 327 834 856 10.1016/j.jconrel.2020.09.020 32931897 70. da Fonseca Antunes A.B. De Geest B.G. Vervaet C. Remon J.P. Gelucire 44/14 Based Immediate Release Formulations for Poorly Water-Soluble Drugs Drug Dev. Ind. Pharm. 2013 39 791 798 10.3109/03639045.2012.709251 22871141 71. Kim M.-S. Kim J.-S. Hwang S.-J. Enhancement of Wettability and Dissolution Properties of Cilostazol Using the Supercritical Antisolvent Process: Effect of Various Additives Chem. Pharm. Bull. 2010 58 230 233 10.1248/cpb.58.230 20118585 72. Hu L. Shi Y. Li J.H. Gao N. Ji J. Niu F. Chen Q. Yang X. Wang S. Enhancement of Oral Bioavailability of Curcumin by a Novel Solid Dispersion System AAPS PharmSciTech 2015 16 1327 1334 10.1208/s12249-014-0254-0 25804949 PMC4666267 73. Sharma V. Pathak K. Effect of Hydrogen Bond Formation/Replacement on Solubility Characteristics, Gastric Permeation and Pharmacokinetics of Curcumin by Application of Powder Solution Technology Acta Pharm. Sin. B 2016 6 600 613 10.1016/j.apsb.2016.05.015 27818928 PMC5071626 74. Valenti S. Barrio M. Negrier P. Romanini M. Macovez R. Tamarit J.-L. Comparative Physical Study of Three Pharmaceutically Active Benzodiazepine Derivatives: Crystalline versus Amorphous State and Crystallization Tendency Mol. Pharm. 2021 18 1819 1832 10.1021/acs.molpharmaceut.1c00081 33689364 PMC8594866 75. Alam F. Najum us Saqib Q. Waheed A. Cytotoxic Activity of Extracts and Crude Saponins from Zanthoxylum Armatum DC. against Human Breast (MCF-7, MDA-MB-468) and Colorectal (Caco-2) Cancer Cell Lines BMC Complement. Altern. Med. 2017 17 368 10.1186/s12906-017-1882-1 28716103 PMC5514500 76. Wiater A. Paduch R. Trojnar S. Choma A. Pleszczyńska M. Adamczyk P. Pięt M. Próchniak K. Szczodrak J. Strawa J. The Effect of Water-Soluble Polysaccharide from Jackfruit ( Artocarpus heterophyllus Plants 2020 9 103 10.3390/plants9010103 31947694 PMC7020216 Figure 1 Viscosity curves of selected SEDDS formulations as a function of temperature. The figure also represents the behavior of the particles during solidification. Figure 2 Dissolution test results of S14 and S15 with 10% SM content. Figure 3 Acquired RTG diffractograms of S14 SM10% ( A B C D E F Figure 4 MicroCT-scan imaging of S14 SM10% solid foam structure. Figure 5 Percentage distribution of vesicle sizes in the foamed S14 SM10% formulation. Figure 6 The DSC curves of the materials were obtained in the following order: S14 SM10% formulation ( A B C D E F Figure 7 Viability of cells treated with S14 SM10% (compared to negative control) using the MTT staining method. Figure 8 Viability of cells treated with S14 SM10% (compared to the negative control) using the NR staining method. Figure 9 Amount of curcumin permeated through Caco-2 cell monolayers. pharmaceutics-17-01166-t001_Table 1 Table 1 Compositions of CUR containing solid SEDDSs 1 Sample Gelucire 44/14 Gelucire 48/16 Kolliphor RH40 PEG PEG CUR S1 4375 0 4375 1500 0 375 S2 4375 0 4375 0 1500 375 S3 3875 0 3875 2500 0 375 S4 3875 0 3875 0 2500 375 S5 0 4375 4375 1500 0 375 S6 0 4375 4375 0 1500 375 S7 0 3875 3875 2500 0 375 S8 0 3875 3875 0 2500 375 S9 3375 0 3375 3500 0 375 S10 3375 0 3375 0 3500 375 S11 0 3375 3375 3500 0 375 S12 0 3375 3375 0 3500 375 S13 2875 0 2875 4500 0 375 S14 2875 0 2875 0 4500 375 S15 0 2875 2875 4500 0 375 S16 0 2875 2875 0 4500 375 S17 2375 0 2375 5500 0 375 S18 2375 0 2375 0 5500 375 S19 0 2375 2375 5500 0 375 S20 0 2375 2375 0 5500 375 1 pharmaceutics-17-01166-t002_Table 2 Table 2 Droplet size distribution of the SEDDS composition aqueous phase. Sample z Average 1 z SD 1 PDI Average 2 PDI SD 2 S1 880.3 112.5 0.823 0.086 S2 948.2 158 0.846 0.091 S3 1369 1292 0.828 0.149 S4 851.2 87.5 0.929 0.09 S5 26.31 22.61 0.154 0.034 S6 13.17 0.032 0.070 0.020 S7 13.08 0.037 0.053 0.006 S8 13.7 0.034 0.161 0.004 S9 504.7 43.64 0.584 0.016 S10 285.6 28.82 0.545 0.082 S11 24.61 19.28 0.162 0.031 S12 67.31 39.81 0.216 0.042 S13 103.7 81.97 0.290 0.035 S14 31.96 25.1 0.300 0.120 S15 15.85 0.19 0.259 0.036 S16 45.01 26.07 0.296 0.077 S17 20.02 8.156 0.185 0.052 S18 14.62 0.12 0.140 0.023 S19 35.2 13.84 0.290 0.097 S20 34.2 17.95 0.329 0.099 1 2 pharmaceutics-17-01166-t003_Table 3 Table 3 Droplet size distribution of SEDDSs with different dissolution retardants. Sample z Average 1 z SD 1 PDI Average 2 PDI SD 2 5% SA S5 3285 177.5 0.983 0.06 S6 3128 663.8 1.000 0 S7 2298 280.3 1.000 0 S8 3369 1668 0.992 0.014 S11 4857 1439 1.000 0 S14 7047 3873 0.744 0.296 S15 4065 1426 0.998 0.02 S17 6178 515.2 0.953 0.082 S18 5908 1153 0.782 0.193 5% GS S5 1038 73.38 0.796 0.039 S6 1063 290.8 0.983 0.120 S7 1801 331.9 0.886 0.103 S8 1797 547.4 0.822 0.168 S11 1304 293.9 0.819 0.114 S14 3195 292.1 1.000 0 S15 2618 1134 0.913 0.151 S17 3407 1673 0.908 0.158 S18 3772 3035 0.944 0.097 5% SM S5 1706 741.9 0.687 0.116 S6 855.2 50.22 0.784 0.066 S7 909.8 219.6 0.824 0.117 S8 1074 200.9 0.817 0.023 S11 1185 66 0.701 0.256 S14 2687 521.8 1.000 0 S15 1203 254.8 0.732 0.070 S17 2290 973.4 0.949 0.088 S18 3663 1264 0.891 0.789 1 2 pharmaceutics-17-01166-t004_Table 4 Table 4 Particle sizes of formulations containing 5 and 10% stearylamine, based on DLS measurements. Sample z Average 1 z SD 1 PDI Average 2 PDI SD 2 5% SM S5 1197 108.1 0.893 0.116 S6 855.2 50.22 0.784 0.066 S7 909.8 219.6 0.824 0.117 S8 1074 200.9 0.817 0.023 S11 1185 66 0.701 0.256 S14 2687 521.8 1.000 0 S15 1203 254.8 0.732 0.070 S17 2290 973.4 0.949 0.088 S18 3663 1264 0.891 0.789 10% SM S5 3709 310.2 0.453 0.358 S6 2539 108.9 0.995 0.008 S7 6384 919.9 1 0 S8 2391 101.4 0.875 0.031 S11 4823 631.0 1 0 S14 2122 172.0 0.883 0.283 S15 666.6 155.2 0.633 0.094 S17 3209 433.4 1 0 S18 5908 1153 0.782 0.193 1 2 pharmaceutics-17-01166-t005_Table 5 Table 5 Correlation coefficients of dissolution tests of S14 and S15 with 10% SM content.  S14 SM10% S15 SM10% Zero-order 0.9806 0.9649 First-order 0.9898 0.9893 Korsmeyer-Peppas 0.8745 0.9017 ",
  "metadata": {
    "Title of this paper": "The Effect of Water-Soluble Polysaccharide from Jackfruit (",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473007/"
  }
}