{
  "title": "Paper_869",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472109 PMC12472109.1 12472109 12472109 41011028 10.3390/medicina61091637 medicina-61-01637 1 Article Managing Bone Metastases with Denosumab: Real-World Data and Critical Monitoring Points in Breast, Lung, and Prostate Cancers https://orcid.org/0000-0001-8217-3471 Oyucu Orhan Sibel Conceptualization Methodology Investigation Writing – original draft Data curation Writing – review & editing 1 * https://orcid.org/0000-0003-3970-2344 Orhan Bedrettin Data curation Conceptualization Methodology Formal analysis Writing – original draft 2 https://orcid.org/0000-0001-7491-8058 Esenbuğa Şeyma Data curation Writing – original draft Formal analysis 3 https://orcid.org/0000-0001-8575-5477 Sali Seda Conceptualization Methodology 1 https://orcid.org/0000-0003-1591-3323 Caner Burcu Conceptualization Methodology 4 https://orcid.org/0000-0001-7537-1699 Ocak Birol Writing – original draft Writing – review & editing 5 https://orcid.org/0000-0002-7846-0870 Şahin Ahmet Bilgehan Writing – original draft Writing – review & editing 6 https://orcid.org/0000-0002-3669-6391 Deligönül Adem Writing – original draft Writing – review & editing 6 https://orcid.org/0000-0002-9732-5340 Evrensel Türkkan Writing – original draft Writing – review & editing 6 https://orcid.org/0000-0002-0070-0889 Çubukçu Erdem Writing – review & editing Writing – original draft Supervision 6 Rajiah Kingston Academic Editor Kammar-García Ashuin Academic Editor 1 seda_ist1987@hotmail.com 2 borhan18@gmail.com 3 ss.esenbuga@gmail.com 4 drburcucaner@gmail.com 5 birol08ocak@gmail.com 6 absahin@uludag.edu.tr ademdeligonul@yahoo.com turkkanevrensel@gmail.com erdemcubukcu@uludag.edu.tr * sibeloyucu@yahoo.com 10 9 2025 9 2025 61 9 497654 1637 17 8 2025 06 9 2025 08 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results p p p p p Conclusions denosumab skeletal-related events hypocalcemia bone metastasis This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Bone metastases are prevalent in some patients with advanced cancer with an incidence of approximately 55%, 90%, and 33% in breast, prostate, and lung cancers, respectively [ 1 2 3 4 4 Denosumab is a monoclonal antibody with affinity for receptor activator of nuclear factor-kappa ligand (RANKL). Osteoblasts secrete RANKL and RANKL activates osteoclast precursors and subsequent osteolysis that induces release of bone-derived growth factors, including insulin-like growth factor-1 (IGF1) and transforming growth factor-beta (TGF-beta), and increases serum calcium levels. Denosumab binds to RANKL, blocks the interaction between RANKL and RANK (a receptor located on osteoclast surfaces), and prevents osteoclasts, leading to decreased bone resorption and increased bone mass in osteoporosis. RANKL inhibition decreases osteoclastic activity, leading to decreased SREs and tumor-induced bone destruction in solid tumors with bone metastases [ 5 6 4 5 7 8 p p 4 Phase III studies reported that the most prevalent adverse effects of denosumab included nausea, anemia, fatigue, back pain, and decreased appetite with the incidence similar to that of zoledronic acid [ 4 7 6 p 9 Existing research on denosumab for treating BMs frequently encompasses diverse cancer types and often centers on comparisons with zoledronic acid. This approach, while informative, has limitations. Most studies on denosumab combine heterogeneous cancer types, limiting insights into tumor-specific efficacy and safety. Few reports directly compare its outcomes in breast, lung, and prostate cancers—the three tumors where bone metastases are most common. For example, a notable study investigating denosumab-induced hypocalcemia included patients with multiple myeloma and focused on a comparison with zoledronic acid [ 4 10 Therefore, this study aimed to comparatively evaluate the efficacy and adverse effect profiles of denosumab in patients with BMs originating from breast, lung, and prostate cancer. 2. Materials and Methods Patients with solid organ malignancies and BMs were retrospectively reviewed by the Medical Oncology Department of Bursa Uludag University Hospital between 2012 and 2022. Patients older than 18 years of age with a histologically confirmed diagnosis of breast, lung, or prostate cancer and radiologically confirmed bone metastases were included in the study. Additionally, patients with baseline chronic kidney disease were also included. Patients were excluded if they had any prior use of bisphosphonates, had a concurrent primary malignancy, had incomplete clinical data, or were lost to follow-up. Age, sex, ECOG performance status, comorbidities, diagnoses, chemotherapies, SREs before denosumab; creatinine, calcium, and magnesium levels at the time of diagnosis and at months 3 and 6; and adverse effects during denosumab treatment, palliative bone surgery or radiotherapy status, total follow-up time, and overall survival were evaluated. Denosumab treatment started immediately after detecting an SRE. Hypocalcemia and hypomagnesemia were defined and classified pursuant to the Common Terminology Criteria for Adverse Effects (CTCAE) version 5.0 of National Cancer Institute [ 11 12 The Statistical Package for the Social Sciences (SPSS, IBM Corp., Armonk, NY, USA) software for Windows Version 25.0 was used for the statistical analyses. Descriptive statistics are presented as number (n) and percentage (%) for categorical variables and mean ± standard deviation (SD) or median (range) for continuous variables. Shapiro–Wilk test was used to test the normal distribution hypothesis for the study data. Friedman test was used for repeated data that did not meet normal distribution hypothesis. Each group was compared pairwise, when an intergroup difference was detected as a result of the Friedman test. Because the data were dependent in pairwise comparisons, the Wilcoxon test was used. Because the data did not meet the normal distribution hypothesis, Kruskal–Wallis test was used between the cancer types. When differences were detected using the Kruskal–Wallis test, Mann–Whitney U p 3. Results A total of 146 patients with breast, lung, or prostate cancer with available data were included in the study. Demographics and clinical characteristics of the patients are presented in Table 1 Table 2 According to our analysis of denosumab adverse effects by cancer types, hypocalcemia was observed in 5.6% (3/53) of patients with breast cancer, 4% (1/25) of those with prostate cancer, and 10.2% (7/68) of those with lung cancer. There was no significant intergroup difference ( p 2 Table 2 p 2 p 2 p 2 Table 3 p 2 Table 2 Figure 1 p The effect of denosumab administration on calcium and creatinine levels at baseline and at months 3 and 6 for each cancer type is shown in Figure 2 p p p There was no significant difference by creatinine levels of patients with breast cancer after denosumab use at months 3 and 6 ( p p p The effects of denosumab administration on magnesium, calcium, and creatinine at months 3 and 6 are shown in Figure 3 p p Regarding the calcium levels, there was no significant difference between the cancer groups at baseline and months 3 or 6. Analysis of the creatinine levels showed a significant intergroup difference by baseline creatinine levels. Baseline creatinine levels of patients with both prostate and lung cancer were significantly higher than those of patients with breast cancer (mean ± SD; prostate 1.35 ± 0.83, lung cancer 0.95 ± 0.43, breast 0.79 ± 0.29; p p p p p Figure 2 Patient groups were also analyzed for overall survival (OS) and post-denosumab survival. The median OS for breast cancer, prostate cancer, and lung cancer was 112.9 (range: 85.3–124) months, 63.4 (range: 44.7–70.1) months, and 12.9 (range: 15.4–29.3) months, respectively, and the intergroup difference was statistically significant ( p p 4. Discussion The significant burden and effect of BMs and SREs on quality of life in patients with breast, prostate, and lung cancer require effective therapeutic management. Agents that target bone, delay complications, relieve symptoms, and improve quality of life, and these agents should be started at the time of diagnosis of metastatic bone disease [ 13 4 14 15 Male predominance was generally observed in studies examining the use of denosumab in metastatic solid organ tumors [ 4 5 16 17 A study by Mizuta et al. on lung, breast, prostate, renal, and colorectal cancers reported the median follow-up period as 13 months and the rate of hypocalcemia as 6.9% for all solid organ tumors, and the rate of SREs during denosumab treatment was only 0.8% [ 16 18 19 4 5 7 20 5 16 18 13 14 21 p 14 8 14 Hypocalcemia is a well-recognized adverse effect of denosumab, attributed to its potent inhibition of osteoclast-mediated calcium release from bone [ 6 22 p p p 22 23 22 22 24 p 22 24 25 26 27 15 Regarding renal safety, denosumab is generally considered to have a favorable profile compared to intravenous bisphosphonates, particularly zoledronic acid [ 5 7 p p p 7 Unsurprisingly, overall survival (OS) and post-denosumab survival were significantly different among the groups, with lung cancer patients having the shortest median survival, followed by prostate and then breast cancer ( p 28 4 13 Figure 1 Limitations The retrospective design is susceptible to selection bias, missing data, and confounding variables (e.g., specific chemotherapy regimens, performance status changes, baseline vitamin D levels, precise reasons for creatinine changes). The sample size, particularly for the prostate cancer group, is relatively small, limiting the statistical power to detect smaller differences between groups. The absence of a direct comparator group (like zoledronic acid or no bone-targeting agent) restricts conclusions about relative efficacy or safety. Furthermore, the laboratory follow-up was limited to 6 months for this analysis, and systematic data on osteonecrosis of the jaw (ONJ) were not specifically presented. 5. Conclusions This real-world study confirms denosumab’s efficacy in reducing SREs in patients with bone metastases from breast, lung, and prostate cancer, but highlights that hypocalcemia risk varies by tumor type. Lung cancer patients are most vulnerable, showing a significant calcium decline and the highest rate of clinical hypocalcemia, necessitating vigilant monitoring and proactive supplementation, especially in the initial 3–6 months. While breast cancer patients also require routine surveillance due to a significant calcium drop, this effect was not observed in our prostate cancer cohort, though this finding requires cautious interpretation given the sample size. Therefore, tailoring biochemical monitoring strategies based on the primary malignancy is essential to maximize the benefit–risk profile of denosumab. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.O.O., S.S., B.O. (Birol Ocak), E.Ç. and B.C.; methodology, S.O.O., A.B.Ş., S.S. and B.C.; software, S.O.O., B.O. (Bedrettin Orhan), A.D. and Ş.E.; validation, S.O.O., B.O. (Bedrettin Orhan), A.D., E.Ç. and Ş.E.; formal analysis, T.E., A.D., T.E. and B.O. (Bedrettin Orhan); investigation, S.O.O. and Ş.E.; resources, B.O. (Bedrettin Orhan); data curation, S.O.O.; writing—original draft preparation, S.O.O., B.O. (Bedrettin Orhan), A.B.Ş., T.E. and A.D.; writing—review and editing, S.O.O., B.O. (Bedrettin Orhan), B.O. (Birol Ocak), S.S. and A.B.Ş.; visualization, Ş.E. and B.O. (Bedrettin Orhan); supervision, B.O. (Birol Ocak), A.D., T.E. and E.Ç.; project administration, B.O. (Birol Ocak), A.D., T.E. and E.Ç.; funding acquisition, S.O.O. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted according to the guidelines of the Declaration of Helsinki, and approved by the Institutional Ethics Committee of Bursa Uludag University Faculty of Medicine (protocol code 2022-5/24, date of approval 2 March 2022). Informed Consent Statement The Ethics Committee of the Uludag University Faculty of Medicine waived the need for ethics approval and the need to obtain consent for the collection, analysis, and publication of the retrospectively obtained and anonymized data for this non-interventional study. Data Availability Statement The data that support the findings of this study are available on request from the corresponding author, [S.O.O]. The data are not publicly available due to ethical reasons. Conflicts of Interest The authors declare no conflicts of interest. References 1. Body J.J. Quinn G. Talbot S. Booth E. Demonty G. Taylor A. Amelio J. Systematic review and meta-analysis on the proportion of patients with breast cancer who develop bone metastases Crit. Rev. Oncol. Hematol. 2017 115 67 80 10.1016/j.critrevonc.2017.04.008 28602171 2. Guo X. Li S. Bone metastases of prostate cancer: Molecular mechanisms, targeted diagnosis and targeted therapy (Review) Oncol. Rep. 2025 53 46 10.3892/or.2025.8879 39981932 PMC11865881 3. Long N. Woodlock D. D’Agostino R. Nguyen G. Gangai N. Sevilimedu V. Do R.K.G. Incidence and Prevalence of Bone Metastases in Different Solid Tumors Determined by Natural Language Processing of CT Reports Cancers 2025 17 218 10.3390/cancers17020218 39858000 PMC11763382 4. Lipton A. Fizazi K. Stopeck A.T. Henry D.H. Brown J.E. Yardley D.A. Richardson G.E. Siena S. Maroto P. Clemens M. Superiority of denosumab to zoledronic acid for prevention of skeletal-related events: A combined analysis of 3 pivotal, randomised, phase 3 trials Eur. J. Cancer 2012 48 3082 3092 10.1016/j.ejca.2012.08.002 22975218 5. Henry D.H. Costa L. Goldwasser F. Hirsh V. Hungria V. Prausova J. Scagliotti G.V. Sleeboom H. Spencer A. Vadhan-Raj S. Randomized, double-blind study of denosumab versus zoledronic acid in the treatment of bone metastases in patients with advanced cancer (excluding breast and prostate cancer) or multiple myeloma J. Clin. Oncol. 2011 29 1125 1132 10.1200/JCO.2010.31.3304 21343556 6. Body J.J. Denosumab for the management of bone disease in patients with solid tumors Expert Rev. Anticancer Ther. 2012 12 307 322 10.1586/era.11.204 22192269 7. Stopeck A.T. Lipton A. Body J.J. Steger G.G. Tonkin K. de Boer R.H. Lichinitser M. Fujiwara Y. Yardley D.A. Viniegra M. Denosumab compared with zoledronic acid for the treatment of bone metastases in patients with advanced breast cancer: A randomized, double-blind study J. Clin. Oncol. 2010 28 5132 5139 10.1200/JCO.2010.29.7101 21060033 8. Fizazi K. Carducci M. Smith M. Damião R. Brown J. Karsh L. Milecki P. Shore N. Rader M. Wang H. Denosumab versus zoledronic acid for treatment of bone metastases in men with castration-resistant prostate cancer: A randomised, double-blind study Lancet 2011 377 813 822 10.1016/S0140-6736(10)62344-6 21353695 PMC3090685 9. Saad F. Brown J.E. Van Poznak C. Ibrahim T. Stemmer S.M. Stopeck A.T. Diel I.J. Takahashi S. Shore N. Henry D.H. Incidence, risk factors, and outcomes of osteonecrosis of the jaw: Integrated analysis from three blinded active-controlled phase III trials in cancer patients with bone metastases Ann. Oncol. 2012 23 1341 1347 10.1093/annonc/mdr435 21986094 10. Leigh J. Lee S.F. Fawaz A. Jia J. Theriau C.F. Rodrigues J. Brown J. Ng T.L. Assessment of the benefits of bone modifying agents in the management of advanced breast, prostate, and lung cancers Curr. Opin. Support. Palliat. Care 2025 19 117 129 10.1097/SPC.0000000000000749 39946089 11. Common Terminology Criteria for Adverse Events (CTCAE), Version 5.0: National Institutes of Health, National Cancer Institute 2017 Available online: https://ctep.cancer.gov/protocolDevelopment/electronic_applications/docs/CTCAE_v5_Quick_Reference_5x7.pdf (accessed on 5 June 2025) 12. Wei Z. Pan B. Jia D. Yu Y. Long-term safety and efficacy of bisphosphonate therapy in advanced lung cancer with bone metastasis Future Oncol. 2022 18 2257 2267 10.2217/fon-2022-0098 35414201 13. De Castro J. García R. Garrido P. Isla D. Massuti B. Blanca B. Vázquez J. Therapeutic Potential of Denosumab in Patients With Lung Cancer: Beyond Prevention of Skeletal Complications Clin. Lung Cancer 2015 16 431 446 10.1016/j.cllc.2015.06.004 26264596 14. Wong S.K. Mohamad N.V. Giaze T.R. Chin K.Y. Mohamed N. Ima-Nirwana S. Prostate Cancer and Bone Metastases: The Underlying Mechanisms Int. J. Mol. Sci. 2019 20 2587 10.3390/ijms20102587 31137764 PMC6567184 15. Nakamura K. Kaya M. Yanagisawa Y. Yamamoto K. Takayashiki N. Ukita H. Nagura M. Sugiue K. Kitajima M. Hirano K. Denosumab-induced hypocalcemia in patients with solid tumors and renal dysfunction: A multicenter, retrospective, observational study BMC Cancer 2024 24 218 10.1186/s12885-024-11942-2 38360579 PMC10870527 16. Mizuta K. Oshiro H. Katsuki R. Tsuha Y. Aoki Y. Tome Y. Nishida K. Denosumab administration for bone metastases from solid tumors: A retrospective cross-sectional study BMC Cancer 2023 23 999 10.1186/s12885-023-11495-w 37853409 PMC10585877 17. Gnant M. Frantal S. Pfeiler G. Steger G.G. Egle D. Greil R. Fitzal F. Wette V. Balic M. Haslbauer F. Long-Term Outcomes of Adjuvant Denosumab in Breast Cancer NEJM Evid. 2022 1 EVIDoa2200162 10.1056/EVIDoa2200162 38319865 18. Henry D. Vadhan-Raj S. Hirsh V. von Moos R. Hungria V. Costa L. Woll P.J. Scagliotti G. Smith G. Feng A. Delaying skeletal-related events in a randomized phase 3 study of denosumab versus zoledronic acid in patients with advanced cancer: An analysis of data from patients with solid tumors Support. Care Cancer 2014 22 679 687 10.1007/s00520-013-2022-1 24162260 19. Cadieux B. Coleman R. Jafarinasabian P. Lipton A. Orlowski R.Z. Saad F. Scagliotti G.V. Shimizu K. Stopeck A. Experience with denosumab (XGEVA ® J. Bone Oncol. 2022 33 100416 10.1016/j.jbo.2022.100416 35242510 PMC8857591 20. Peddi P. Lopez-Olivo M.A. Pratt G.F. Suarez-Almazor M.E. Denosumab in patients with cancer and skeletal metastases: A systematic review and meta-analysis Cancer Treat. Rev. 2013 39 97 104 10.1016/j.ctrv.2012.07.002 22898302 PMC3691016 21. Giannakeas V. Cadarette S.M. Ban J.K. Lipscombe L. Narod S.A. Kotsopoulos J. Denosumab and breast cancer risk in postmenopausal women: A population-based cohort study Br. J. Cancer 2018 119 1421 1427 10.1038/s41416-018-0225-4 30420611 PMC6265331 22. Body J.J. Bone H.G. de Boer R.H. Stopeck A. Van Poznak C. Damião R. Fizazi K. Henry D.H. Ibrahim T. Lipton A. Hypocalcaemia in patients with metastatic bone disease treated with denosumab Eur. J. Cancer 2015 51 1812 1821 10.1016/j.ejca.2015.05.016 26093811 23. Fizazi K. Lipton A. Mariette X. Body J.J. Rahim Y. Gralow J.R. Gao G. Wu L. Sohn W. Jun S. Randomized phase II trial of denosumab in patients with bone metastases from prostate cancer, breast cancer, or other neoplasms after intravenous bisphosphonates J. Clin. Oncol. 2009 27 1564 1571 10.1200/JCO.2008.19.2146 19237632 24. Lau L.H. Cliff E.R.S. Wong V. Wong H. Torkamani N. Eer A. Weickhardt A. Grossmann M. Hypocalcaemia following denosumab in prostate cancer: A clinical review Clin. Endocrinol. 2020 92 495 502 10.1111/cen.14169 32017154 25. Scagliotti G.V. Hirsh V. Siena S. Henry D.H. Woll P.J. Manegold C. Solal-Celigny P. Rodriguez G. Krzakowski M. Mehta N.D. Overall survival improvement in patients with lung cancer and bone metastases treated with denosumab versus zoledronic acid: Subgroup analysis from a randomized phase 3 study J. Thorac. Oncol. 2012 7 1823 1829 10.1097/JTO.0b013e31826aec2b 23154554 26. Iizumi S. Shimoi T. Nishikawa T. Kitano A. Sasada S. Shimomura A. Noguchi E. Yunokawa M. Yonemori K. Shimizu C. Prolonged Hypocalcemia Following a Single Dose of Denosumab for Diffuse Bone Metastasis of Gastric Cancer after Total Gastrectomy Intern. Med. 2017 56 2879 2882 10.2169/internalmedicine.8908-17 28943574 PMC5709630 27. Mori M. Shirasawa M. Oguri A. Yamamoto H. Manabe H. Nakahara Y. Sato T. Naoki K. Severe denosumab-induced hypocalcemia requiring long-term intensified medication in a patient with EGFR-mutant lung cancer and diffuse osteoblastic bone metastases Respir. Med. Case Rep. 2025 54 102183 10.1016/j.rmcr.2025.102183 40104434 PMC11915153 28. Paz-Ares L.G. de Marinis F. Dediu M. Thomas M. Pujol J.L. Bidoli P. Molinier O. Sahoo T.P. Laack E. Reck M. PARAMOUNT: Final overall survival results of the phase III study of maintenance pemetrexed versus placebo immediately after induction treatment with pemetrexed plus cisplatin for advanced nonsquamous non-small-cell lung cancer J. Clin. Oncol. 2013 31 2895 2902 10.1200/JCO.2012.47.1102 23835707 Figure 1 Kaplan–Meier analysis of time to first Skeletal-Related Event (SRE) after the start of Denosumab therapy and number of patients at risk by time. Figure 2 Effect of Denosumab administration on calcium (Ca) and creatinine (Cre) levels in different cancer types (breast, prostate, and lung). ( A B C D E F p p p p Figure 3 Effect of Denosumab administration on magnesium (Mg), calcium (Ca) and creatinine (Cre) levels in different cancer types (breast, prostate, and lung). ( A B C D E F G H I p p p p medicina-61-01637-t001_Table 1 Table 1 Distribution of sociodemographic and clinical characteristics of the patients. Variables N %  Gender Male 76 52.1 Female 70 47.9  Age Mean ± std  ECOG Median (min–max)  Comorbidities CKD 22 COPD 10 CAD 33 HT 67 DM 31  Cancer Type Breast 53 36.3 Prostate 25 17.1 Lung 68 46.6  Treatment type Chemotherapy 66 45.2 Chemotherapy + targeted therapy 17 11.6 Chemotherapy + immunotherapy 15 10.2 Hormonotherapy 1 0.06 Chemotherapy + hormonotherapy 47 32.2  SRE No 93 63.7 Yes 53 36.3  Calcium level (mg/dL) Before denosumab 9.3 7.9–14.1 3rd month 9.0 6.1–11.2 6th month 9.0 6.3–12.7  Magnesium level (mg/dL) Before denosumab 2.0 1.1–2.9 3rd month 2.0 1.1–2.3 6th month 2.0 1.0–2.9  Creatinine level (mg/dL) Before denosumab 0.78 0.39–4.48 3rd month 0.68 0.50–5.20 6th month 0.64 0.34–4.10  Denosumab months Median  Radiotherapy No 57 39 Yes 89 61  Surgery No 133 91 Yes 13 9  Follow-up, months Median CAD: Coronary artery disease; CKD: Chronic kidney disease; COPD: Chronic obstructive pulmonary disease; dL: deciliter; DM: Diabetes Mellitus; ECOG: Eastern Cooperative Oncology Group; HT: Hypertension; mg: milligram; SRE: Skeletal-related event; std: standard deviation. medicina-61-01637-t002_Table 2 Table 2 Effect of Denosumab administration on different cancer types (breast, prostate, and lung) on frequency of skeletal-related event, toxicities, and pathological fracture.  Breast Prostate Lung p 2 Skeletal-related event (before denosumab) 23 7 23 0.354 Any toxicity 10 6 26 0.056 Hypocalcemia 3 1 7 0.459 * Creatinine elevation 3 4 13 0.101 Infection 6 5 12 0.593 Malign hypercalcemia 10 1 13 0.173 * Skeletal-related event (after denosumab) 5 4 6 0.668 * Data were evaluated by Pearson Chi Square test or (*) Fisher’s Exact Chi Square Test ( p medicina-61-01637-t003_Table 3 Table 3 Grades of adverse events under denosumab therapy.  Grade Event 1 2 3 4 Hypocalcemia, # 1 7 3 - Infection, # - 4 15 4 Creatinine Elevation, # 12 8 - - #: number of patients. ",
  "metadata": {
    "Title of this paper": "PARAMOUNT: Final overall survival results of the phase III study of maintenance pemetrexed versus placebo immediately after induction treatment with pemetrexed plus cisplatin for advanced nonsquamous non-small-cell lung cancer",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472109/"
  }
}