{
  "title": "Paper_1049",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469297 PMC12469297.1 12469297 12469297 41009485 10.3390/ijms26188913 ijms-26-08913 1 Article Imeglimin Alleviates High-Glucose-Induced Bioenergetic and Oxidative Stress Thereby Enhancing Intercellular Adhesion in H9c2 Cardiomyoblasts Ohguro Hiroshi 1 * https://orcid.org/0000-0002-8026-6532 Watanabe Megumi 1 Suzuki Megumi 1 Ohara Naruki 1 Ogawa Toshifumi 2 3 https://orcid.org/0000-0001-7876-1772 Sato Tatsuya 2 3 * Yano Toshiyuki 3 Kusmic Claudia Academic Editor 1 watanabe@sapmed.ac.jp sapmed15m018@gmail.com 2 a08m024@yahoo.co.jp 3 oltomwaits55@gmail.com * ooguro@sapmed.ac.jp satatsu.bear@gmail.com 12 9 2025 9 2025 26 18 497349 8913 06 8 2025 04 9 2025 10 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ To elucidate the effects of the new antidiabetic agent, imeglimin (Ime, 2 mM), on high-glucose-induced cellular stress in cardiac cells, its effects were compared with those of the conventional antidiabetic agent metformin (Met, 2 mM) based on various cellular pathophysiological functions. H9c2 cardiomyoblasts were cultured under normal-glucose (5.5 mM, N-Glu) or high-glucose (50 mM, H-Glu) conditions. Cellular metabolic function was evaluated using a Seahorse XFe96 Bioanalyzer, along with measurements of reactive oxygen species (ROS) production, expression levels of the autophagy-related marker LC3, and intercellular adhesion properties measured based on transepithelial electrical resistance (TEER). Cells cultured under H-Glu conditions showed enhanced mitochondrial and glycolytic activities, which were suppressed by Met or Ime. Under H-Glu conditions, total cellular ROS (t-ROS) levels were significantly increased. Met had little effect on t-ROS under H-Glu conditions, whereas Ime markedly reduced both t-ROS and mitochondrial ROS (m-ROS) levels under H-Glu conditions. The LC3-II/LC3-I ratio, a marker of autophagic activity, decreased under H-Glu conditions; however, this reduction was not significantly affected by treatment with either Met or Ime. Regarding intercellular adhesion properties, TEER values were elevated under H-Glu conditions compared to N-Glu conditions, and those under H-Glu conditions were further increased by Ime but not Met. In support of these results, the mRNA levels of cell-adhesion-related molecules, including β-catenin and N-cadherin, were also altered by Ime. Collectively, Ime modulated high-glucose-induced alterations in the biological properties of H9c2 cardiomyoblasts, independent of changes in autophagic activity. H9c2 cell metformin imeglimin extracellular flux analyzer ROS the educational research grant of Sapporo Medical University T.S. 22K08210 Japan Society for the Promotion of Science 25K11392 This research was partly supported by the educational research grant of Sapporo Medical University and by KAKENHI grants from Japan Society for the Promotion of Science (T.S. 22K08210 and 25K11392). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Diabetes is characterized by elevated circulating glucose and fatty acid (FA) levels, leading to substantial metabolic remodeling in various organs, including the heart. Altered substrate availability in the myocardium plays a key role in impairing cardiac energy metabolism and promoting the excessive generation of reactive oxygen species (ROS), which can contribute to the development of diabetes-induced cardiac dysfunction [ 1 2 3 4 3 4 5 6 7 8 9 10 11 Metformin (Met) is the most commonly used glucose-lowering agent for patients with type 2 diabetes (T2D) primarily because of its ability to suppress hepatic gluconeogenesis via an adenosine 5′-monophosphate (AMP)-activated protein kinase (AMPK)-dependent mechanism [ 12 13 14 15 16 17 18 19 20 21 22 Recently, imeglimin (Ime), a novel oral antidiabetic agent that shares mechanistic similarities with Met, has emerged in clinical practice. Ime is expected to address several unmet medical needs of patients with T2D using Met or other antihyperglycemic therapies [ 23 24 25 26 27 28 29 30 In addition to metabolic remodeling and oxidative stress, chronic hyperglycemia induces cellular adhesion disturbances [ 31 32 33 34 35 36 Therefore, to elucidate how Ime functions under high-glucose-induced stress responses, its effects were compared with those of Met in H9c2 cardiomyoblasts. We utilized TEER to assess T2D-related cardiac dysfunction markers, cellular metabolic function, ROS generation, autophagy, as a process regulated by oxidative stress, and intercellular binding properties. 2. Results The aim of the current study was to characterize the effects of the newly developed antidiabetic agent Ime on high-glucose-stimulated cellular functional alterations in cardiac cells in comparison with Met, of which the pharmacological effects on the heart have been well established [ 37 38 39 40 41 42 Figure 1 Initially, the pharmacological effects of Met and Ime on essential cellular metabolism, including mitochondrial function and glycolysis, were studied using an extracellular flux analyzer. As shown in Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 To test this hypothesis, the major oxidative-stress-related biological indices, ROS levels, and autophagy were assessed in H9c2 cells under various conditions. As shown in Figure 3 Figure 3 Figure 4 Finally, the additional pharmacological effects of these antidiabetic agents on intercellular binding properties, which may be related to cell-to-cell electrical conduction, were evaluated using TEER measurements. As shown in Figure 5 Figure 5 Figure 6 3. Discussion In the present study, to explore the pharmacological effects of Ime on high-glucose-induced cellular stress in cardiomyocytes, the metabolic functions, levels of ROS, autophagy, and intercellular binding properties of H9c2 cells were compared between Ime and Met under a H-Glu condition and the following results were observed: (1) significantly elevated mitochondrial respiratory functions under H-Glu conditions were suppressed by both Met and Ime; (2) the increased trends of t-ROS and m-ROS under H-Glu conditions were significantly reduced by Ime but not Met; (3) the H-Glu-induced decrease in autophagic activities assessed by the LC3-II/LC3-I ratio was not significantly affected by treatment with either Met or Ime; (4) the intercellular binding property, evaluated based on TEER, was significantly increased by Ime but not Met. Collectively, these findings suggest that Ime exerts more potent and beneficial effects than Met on H9c2 cells under H-Glu-stimulated stress by decreasing ROS production and fine-tuning excessive mitochondrial respiratory functions, independent of autophagic regulation. In addition, Ime modulated intercellular adhesion, which may contribute to enhanced electrical conduction and cell-to-cell interactions in cardiomyocytes. Several clinical observational studies have suggested the possible beneficial effect of Met on the failing heart in patients with T2D. In a meta-analysis involving 35,950 T2D patients with heart failure, total mortality in those receiving Met was approximately 22% less than in those not receiving Met [HR: 0.78, (95%: 0.71–0.87)] [ 43 44 45 46 29 47 Several lines of evidence suggest that a chronic-hyperglycemia-induced increase in both ROS production and oxidative stress plays an essential role in the development and progression of cardiac function [ 8 9 10 11 48 49 50 51 52 53 54 29 Figure 2 55 With respect to cell-to-cell adhesion, it has been demonstrated, in an in vitro blood–brain barrier (BBB) model, that high-glucose conditions decrease TEER values and the expression of tight junction proteins [ 56 57 58 59 40 40 40 60 In conclusion, the present study demonstrated that treatment with Ime effectively alleviates high-glucose-induced metabolic alterations and ROS overproduction in H9c2 cardiomyoblasts, while enhancing intercellular adhesion, in comparison to Met. These findings may lead to improved electrical conduction coupling in impaired cardiomyocytes. Further in vivo studies using diabetic heart models are warranted to validate the underlying signaling pathways that may contribute to the cardioprotective effects of Ime against diabetes-induced cardiac dysfunction. 4. Materials and Methods 4.1. Planar Culture of H9c2 Cells Planar cultures of H9c2 rat cardiomyoblasts, purchased from the ATCC (American Type Culture Collection), were processed in two-dimensional (2D) culture dishes (150 mm diameter) using Dulbecco’s Modified Eagle Medium (DMEM) (Wako, Osaka, Japan) supplemented with 10% fetal bovine serum (Biosera, Cholet, France), 1% L-glutamine (Wako, Osaka, Japan), and 1% antibiotic-antimycotic (Thermo Fisher Scientific, Tokyo, Japan) under standard conditions (37 °C, 5% CO 2 61 4.2. Cell Viability Assay Cell viability was determined using a commercially available kit (Cell Counting Kit-8, CCK-8; DOJINDO, Kumamoto, Japan). In brief, H9c2 cells were seeded at 5000 cells per well in an ordinary 96-well culture plate under standard conditions (37 °C, 5% CO 2 ® 4.3. Seahorse Extracellular Flux Analysis A total of 20,000 H9c2 cells were plated onto Seahorse XFe96 Cell Culture Microplates (Agilent Technologies, #103794-100, Santa Clara, CA, USA) and cultured under N-Glu (5.5 mM) or H-Glu (50 mM) conditions with 2 mM Met, 2 mM Ime, or vehicle control containing dimethyl sulfoxide (DMSO) for 24 hrs. On the day of measurement, the culture medium was exchanged with 180 μL of the same Seahorse XF DMEM assay medium (Agilent Technologies, #103575-100, Santa Clara, CA, USA) supplemented with 5.5 mM glucose, 2.0 mM glutamine, and 1.0 mM sodium pyruvate for all groups to evaluate the effects of prior high-glucose-induced stress under standardized conditions. The plates were then placed in a CO 2 Several mitochondrial and glycolytic parameters, including the basal respiration, ATP-linked respiration, proton leak, maximal respiration, non-mitochondrial respiration, basal ECAR, glycolytic reserve, non-glycolytic acidification, and baseline OCR/ECAR ratio, were calculated according to previously described methods [ 62 4.4. Measurement of Levels of Reactive Oxygen Species (ROS) Levels of total cellular ROS (t-ROS) and mitochondrial ROS (m-ROS) in H9c2 cells were determined using commercially available kits (t-ROS: ROS Assay Kit-Highly Sensitive DCFH-DA, m-ROS: MitoBright ROS Deep Red-mitochondrial Superoxide Detection, DOJINDO, Kumamoto, Japan) according to the manufacturer’s instructions. In brief, a total of 20,000 H9c2 cells were seeded in a 96-well clear-bottom black plate (96 Well Black/Clear Bottom Plate, TC Surface, Thermo Scientific™, Waltham, MA, USA) and cultured in DMEM containing either N-Glu (5.5 mM), H-Glu (50 mM), H-Glu with 2 mM Met, or H-Glu with 2 mM Ime for 24 hrs under standard conditions (37 °C, 5% CO 2 2 4.5. Measurement of TEER TEER values for the monolayers of H9c2 cells were measured by using a commercially available TEER plate (pore size of 0.4 μm, diameter of 12 mm; Corning Transwell 12-well plate, Sigma-Aldrich, St. Louis, MO, USA) with an electrical resistance system (KANTO CHEMICAL CO. INC., Tokyo, Japan) as previously reported [ 63 64 2 4.6. Western Blotting Cells were lysed on ice using CelLytic™ MT Cell Lysis Reagent (#C3228, Sigma-Aldrich, St. Louis, MO, USA) supplemented with a protease inhibitor cocktail (#786-437, G-Biosciences, St. Louis, MO, USA). The lysates were centrifuged at 12,000× g 4.7. Quantitative Real-Time PCR The extraction of total RNA, reverse transcription, and quantitative real-time PCR (qRT-PCR) were performed as described in our previous reports [ 65 66 Supplementary Table S1 4.8. Statistics All statistical analyses were carried out using GraphPad Prism 8 or 9 (GraphPad Software, San Diego, CA, USA). Data are presented as the mean ± standard error of the mean (SEM), with individual data points displayed in the plots where applicable. Comparisons among multiple groups were assessed using one-way analysis of variance (ANOVA) followed by Tukey’s Honestly Significant Difference (HSD) post-hoc test. A two-tailed p Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26188913/s1 Author Contributions M.W. performed the experiments, analyzed the data, and wrote this paper. M.S. performed the experiments, analyzed the data, and wrote this paper. N.O. performed the experiments, analyzed the data, and wrote this paper. T.O. performed the experiments, analyzed the data, and wrote this paper. T.Y. performed experiments and provided conceptual advice. T.S. designed the experiments, analyzed the data, and wrote this manuscript. H.O. designed the experimental plans, summarized the obtained data, and prepared the final version of this manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest Sato has received honoraria from Daiichi Sankyo Co., Ltd., Sumitomo Pharma Co., Ltd., and Nippon Boehringer Ingelheim Co., Ltd. Yano has received honoraria from Sumitomo Pharma Co., Ltd. References 1. Boudina S. Abel E.D. Diabetic cardiomyopathy, causes and effects Rev. Endocr. Metab. Disord. 2010 11 31 39 10.1007/s11154-010-9131-7 20180026 PMC2914514 2. Anderson E.J. Lustig M.E. Boyle K.E. Woodlief T.L. Kane D.A. Lin C.T. Price J.W. III. Kang L. Rabinovitch P.S. Szeto H.H. Mitochondrial H 2 2 J. Clin. Investig. 2009 119 573 581 10.1172/JCI37048 19188683 PMC2648700 3. Randle P.J. Garland P.B. Hales C.N. Newsholme E.A. The glucose fatty-acid cycle. Its role in insulin sensitivity and the metabolic disturbances of diabetes mellitus Lancet 1963 1 785 789 10.1016/S0140-6736(63)91500-9 13990765 4. Hue L. Taegtmeyer H. The Randle cycle revisited: A new head for an old hat Am. J. Physiol. Endocrinol. Metab. 2009 297 E578 E591 10.1152/ajpendo.00093.2009 19531645 PMC2739696 5. Caturano A. Rocco M. Tagliaferri G. Piacevole A. Nilo D. Di Lorenzo G. Iadicicco I. Donnarumma M. Galiero R. Acierno C. Oxidative Stress and Cardiovascular Complications in Type 2 Diabetes: From Pathophysiology to Lifestyle Modifications Antioxidants 2025 14 72 10.3390/antiox14010072 39857406 PMC11759781 6. Williamson J.R. Chang K. Frangos M. Hasan K.S. Ido Y. Kawamura T. Nyengaard J.R. van den Enden M. Kilo C. Tilton R.G. Hyperglycemic pseudohypoxia and diabetic complications Diabetes 1993 42 801 813 10.2337/diab.42.6.801 8495803 7. Brownlee M. Biochemistry and molecular cell biology of diabetic complications Nature 2001 414 813 820 10.1038/414813a 11742414 8. Tiwari B.K. Pandey K.B. Abidi A.B. Rizvi S.I. Markers of Oxidative Stress during Diabetes Mellitus J. Biomark. 2013 2013 378790 10.1155/2013/378790 26317014 PMC4437365 9. Davargaon R.S. Sambe A.D. Muthangi V.V.S. Toxic effect of high glucose on cardiomyocytes, H9c2 cells: Induction of oxidative stress and ameliorative effect of trolox J. Biochem. Mol. Toxicol. 2019 33 e22272 10.1002/jbt.22272 30512247 10. Giacco F. Brownlee M. Oxidative stress and diabetic complications Circ. Res. 2010 107 1058 1070 10.1161/CIRCRESAHA.110.223545 21030723 PMC2996922 11. Kayama Y. Raaz U. Jagger A. Adam M. Schellinger I.N. Sakamoto M. Suzuki H. Toyama K. Spin J.M. Tsao P.S. Diabetic Cardiovascular Disease Induced by Oxidative Stress Int. J. Mol. Sci. 2015 16 25234 25263 10.3390/ijms161025234 26512646 PMC4632800 12. Zhang C.S. Jiang B. Li M. Zhu M. Peng Y. Zhang Y.L. Wu Y.Q. Li T.Y. Liang Y. Lu Z. The lysosomal v-ATPase-Ragulator complex is a common activator for AMPK and mTORC1, acting as a switch between catabolism and anabolism Cell Metab. 2014 20 526 540 10.1016/j.cmet.2014.06.014 25002183 13. Jaul E. Barron J. Age-Related Diseases and Clinical and Public Health Implications for the 85 Years Old and Over Population Front. Public Health 2017 5 335 10.3389/fpubh.2017.00335 29312916 PMC5732407 14. Foretz M. Guigas B. Bertrand L. Pollak M. Viollet B. Metformin: From mechanisms of action to therapies Cell Metab. 2014 20 953 966 10.1016/j.cmet.2014.09.018 25456737 15. Dutta S. Shah R.B. Singhal S. Dutta S.B. Bansal S. Sinha S. Haque M. Metformin: A Review of Potential Mechanism and Therapeutic Utility Beyond Diabetes Drug Des. Dev. Ther. 2023 17 1907 1932 10.2147/DDDT.S409373 PMC10312383 37397787 16. Hsu S.K. Cheng K.C. Mgbeahuruike M.O. Lin Y.H. Wu C.Y. Wang H.D. Yen C.H. Chiu C.C. Sheu S.J. New Insight into the Effects of Metformin on Diabetic Retinopathy, Aging and Cancer: Nonapoptotic Cell Death, Immunosuppression, and Effects beyond the AMPK Pathway Int. J. Mol. Sci. 2021 22 9453 10.3390/ijms22179453 34502359 PMC8430477 17. Johnson R. Sangweni N.F. Mabhida S.E. Dludla P.V. Mabasa L. Riedel S. Chapman C. Mosa R.A. Kappo A.P. Louw J. An In Vitro Study on the Combination Effect of Metformin and N-Acetyl Cysteine against Hyperglycaemia-Induced Cardiac Damage Nutrients 2019 11 2850 10.3390/nu11122850 31766382 PMC6950330 18. Sanit J. Prompunt E. Adulyaritthikul P. Nokkaew N. Mongkolpathumrat P. Kongpol K. Kijtawornrat A. Petchdee S. Barrère-Lemaire S. Kumphune S. Combination of metformin and p38 MAPK inhibitor, SB203580, reduced myocardial ischemia/reperfusion injury in non-obese type 2 diabetic Goto-Kakizaki rats Exp. Ther. Med. 2019 18 1701 1714 10.3892/etm.2019.7763 31410128 PMC6676201 19. Zhang J. Huang L. Shi X. Yang L. Hua F. Ma J. Zhu W. Liu X. Xuan R. Shen Y. Metformin protects against myocardial ischemia-reperfusion injury and cell pyroptosis via AMPK/NLRP3 inflammasome pathway Aging 2020 12 24270 24287 10.18632/aging.202143 33232283 PMC7762510 20. Li W. Jin S. Hao J. Shi Y. Li W. Jiang L. Metformin attenuates ischemia/reperfusion-induced apoptosis of cardiac cells by downregulation of p53/microRNA-34a via activation of SIRT1 Can. J. Physiol. Pharmacol. 2021 99 875 884 10.1139/cjpp-2020-0180 33517853 21. Wu Z. Bai Y. Qi Y. Chang C. Jiao Y. Bai Y. Guo Z. Metformin ameliorates ferroptosis in cardiac ischemia and reperfusion by reducing NOX4 expression via promoting AMPKα Pharm. Biol. 2023 61 886 896 10.1080/13880209.2023.2212700 37288723 PMC10251788 22. Fontaine E. Metformin-Induced Mitochondrial Complex I Inhibition: Facts, Uncertainties, and Consequences Front. Endocrinol. 2018 9 753 10.3389/fendo.2018.00753 PMC6304344 30619086 23. Vuylsteke V. Chastain L.M. Maggu G.A. Brown C. Imeglimin: A Potential New Multi-Target Drug for Type 2 Diabetes Drugs RD 2015 15 227 232 10.1007/s40268-015-0099-3 PMC4561051 26254210 24. Konkwo C. Perry R.J. Imeglimin: Current Development and Future Potential in Type 2 Diabetes Drugs 2021 81 185 190 10.1007/s40265-020-01434-5 33247829 PMC7933057 25. Pirags V. Lebovitz H. Fouqueray P. Imeglimin, a novel glimin oral antidiabetic, exhibits a good efficacy and safety profile in type 2 diabetic patients Diabetes Obes. Metab. 2012 14 852 858 10.1111/j.1463-1326.2012.01611.x 22519919 26. Fouqueray P. Pirags V. Diamant M. Schernthaner G. Lebovitz H.E. Inzucchi S.E. Bailey C.J. The efficacy and safety of imeglimin as add-on therapy in patients with type 2 diabetes inadequately controlled with sitagliptin monotherapy Diabetes Care 2014 37 1924 1930 10.2337/dc13-2349 24722500 27. Fouqueray P. Pirags V. Inzucchi S.E. Bailey C.J. Schernthaner G. Diamant M. Lebovitz H.E. The efficacy and safety of imeglimin as add-on therapy in patients with type 2 diabetes inadequately controlled with metformin monotherapy Diabetes Care 2013 36 565 568 10.2337/dc12-0453 23160726 PMC3579350 28. Theurey P. Vial G. Fontaine E. Monternier P.A. Fouqueray P. Bolze S. Moller D.E. Hallakou-Bozec S. Reduced lactic acidosis risk with Imeglimin: Comparison with Metformin Physiol. Rep. 2022 10 e15151 10.14814/phy2.15151 35274817 PMC8915386 29. Lachaux M. Soulié M. Hamzaoui M. Bailly A. Nicol L. Rémy-Jouet I. Renet S. Vendeville C. Gluais-Dagorn P. Hallakou-Bozec S. Short-and long-term administration of imeglimin counters cardiorenal dysfunction in a rat model of metabolic syndrome Endocrinol. Diabetes Metab. 2020 3 e00128 10.1002/edm2.128 32704553 PMC7375119 30. Aoyagi K. Nishiwaki C. Nakamichi Y. Yamashita S.I. Kanki T. Ohara-Imaizumi M. Imeglimin mitigates the accumulation of dysfunctional mitochondria to restore insulin secretion and suppress apoptosis of pancreatic β-cells from db/db mice Sci. Rep. 2024 14 6178 10.1038/s41598-024-56769-w 38485716 PMC10940628 31. Narukawa Y. Sugiyama N. Miura J. Yamashita R. Tominaga S. Izumi Y. Bamba T. Ishihama Y. Kashiwagi Y. Murakami S. Chronic hyperglycemia reduces the expression of intercellular adhesion molecules and increases intercellular hyperpermeability in the periodontal epithelium J. Periodontal Res. 2023 58 813 826 10.1111/jre.13140 37221815 32. Tien T. Barrette K.F. Chronopoulos A. Roy S. Effects of high glucose-induced Cx43 downregulation on occludin and ZO-1 expression and tight junction barrier function in retinal endothelial cells Investig. Ophthalmol Vis. Sci. 2013 54 6518 6525 10.1167/iovs.13-11763 24008412 PMC3790390 33. Isaksen J.L. Sivertsen C.B. Jensen C.Z. Graff C. Linz D. Ellervik C. Jensen M.T. Jørgensen P.G. Kanters J.K. Electrocardiographic markers in patients with type 2 diabetes and the role of diabetes duration J. Electrocardiol. 2024 84 129 136 10.1016/j.jelectrocard.2024.04.003 38663227 34. Sato T. Kobayashi T. Kuno A. Miki T. Tanno M. Kouzu H. Itoh T. Ishikawa S. Kojima T. Miura T. Type 2 diabetes induces subendocardium-predominant reduction in transient outward K+ current with downregulation of Kv4.2 and KChIP2 Am. J. Physiol. Heart Circ. Physiol. 2014 306 H1054 H1065 10.1152/ajpheart.00414.2013 24486512 35. Gallego M. Zayas-Arrabal J. Alquiza A. Apellaniz B. Casis O. Electrical Features of the Diabetic Myocardium. Arrhythmic and Cardiovascular Safety Considerations in Diabetes Front. Pharmacol. 2021 12 687256 10.3389/fphar.2021.687256 34305599 PMC8295895 36. Jin X. Jiang Y. Xue G. Yuan Y. Zhu H. Zhan L. Zhuang Y. Huang Q. Shi L. Zhao Y. Increase of late sodium current contributes to enhanced susceptibility to atrial fibrillation in diabetic mice Eur. J. Pharmacol. 2019 857 172444 10.1016/j.ejphar.2019.172444 31185218 37. Dziubak A. Wójcicka G. Wojtak A. Bełtowski J. Metabolic Effects of Metformin in the Failing Heart Int. J. Mol. Sci. 2018 19 2869 10.3390/ijms19102869 30248910 PMC6213955 38. Schernthaner G. Brand K. Bailey C.J. Metformin and the heart: Update on mechanisms of cardiovascular protection with special reference to comorbid type 2 diabetes and heart failure Metab. Clin. Exp. 2022 130 155160 10.1016/j.metabol.2022.155160 35143848 39. Li J.Z. Li Y.R. Cardiovascular Protection by Metformin: Latest Advances in Basic and Clinical Research Cardiology 2023 148 374 384 10.1159/000531432 37307806 40. Nishikiori N. Watanabe M. Higashide M. Umetsu A. Ogawa T. Furuhashi M. Ohguro H. Sato T. The Combination of PPARα Agonist GW7647 and Imeglimin Has Potent Effects on High-Glucose-Induced Cellular Biological Responses in Human Retinal Pigment Epithelium Cells Bioengineering 2025 12 265 10.3390/bioengineering12030265 40150729 PMC11939608 41. Nishikiori N. Ohguro H. Watanabe M. Higashide M. Ogawa T. Furuhashi M. Sato T. High-Glucose-Induced Metabolic and Redox Alterations Are Distinctly Modulated by Various Antidiabetic Agents and Interventions Against FABP5/7, MITF and ANGPTL4 in Melanoma A375 Cells Int. J. Mol. Sci. 2025 26 1014 10.3390/ijms26031014 39940783 PMC11817646 42. Ohguro H. Higashide M. Nishikiori N. Ogawa T. Furuhashi M. Sato T. Watanabe M. The distinct effects of metformin and imeglimin on high glucose-induced alterations in metabolic function and reactive oxygen species production in mouse Schwann cells are modulated by pemafibrate and/or fatty acid-binding proteins Front. Cell. Neurosci. 2025 19 1634262 10.3389/fncel.2025.1634262 40917479 PMC12411464 43. Crowley M.J. Diamantidis C.J. McDuffie J.R. Cameron C.B. Stanifer J.W. Mock C.K. Wang X. Tang S. Nagi A. Kosinski A.S. Clinical Outcomes of Metformin Use in Populations With Chronic Kidney Disease, Congestive Heart Failure, or Chronic Liver Disease: A Systematic Review Ann. Intern. Med. 2017 166 191 200 10.7326/M16-1901 28055049 PMC5293600 44. Cheng G. Li L. High-glucose-induced apoptosis, ROS production and pro-inflammatory response in cardiomyocytes is attenuated by metformin treatment via PP2A activation J. Biosci. 2020 45 126 10.1007/s12038-020-00096-5 33184242 45. Yang F. Qin Y. Wang Y. Meng S. Xian H. Che H. Lv J. Li Y. Yu Y. Bai Y. Metformin Inhibits the NLRP3 Inflammasome via AMPK/mTOR-dependent Effects in Diabetic Cardiomyopathy Int. J. Biol. Sci. 2019 15 1010 1019 10.7150/ijbs.29680 31182921 PMC6535781 46. Yendapally R. Sikazwe D. Kim S.S. Ramsinghani S. Fraser-Spears R. Witte A.P. La-Viola B. A review of phenformin, metformin, and imeglimin Drug Dev. Res. 2020 81 390 401 10.1002/ddr.21636 31916629 47. Kitakata H. Endo J. Hashimoto S. Mizuno E. Moriyama H. Shirakawa K. Goto S. Katsumata Y. Fukuda K. Sano M. Imeglimin prevents heart failure with preserved ejection fraction by recovering the impaired unfolded protein response in mice subjected to cardiometabolic stress Biochem. Biophys. Res. Commun. 2021 572 185 190 10.1016/j.bbrc.2021.07.090 34375928 48. Cai H. Zhang G. Chen W. Zhang B. Zhang J. Chang J. Tang C. Qi Y. Yin X. Metformin protects the myocardium against isoproterenol-induced injury in rats through alleviating endoplasmic reticulum stress Die Pharm. 2014 69 64 69 24601227 49. Ren J. Dominguez L.J. Sowers J.R. Davidoff A.J. Metformin but not glyburide prevents high glucose-induced abnormalities in relaxation and intracellular Ca 2+ Diabetes 1999 48 2059 2065 10.2337/diabetes.48.10.2059 10512374 50. Wang G.Y. Bi Y.G. Liu X.D. Zhao Y. Han J.F. Wei M. Zhang Q.Y. Autophagy was involved in the protective effect of metformin on hyperglycemia-induced cardiomyocyte apoptosis and Connexin43 downregulation in H9c2 cells Int. J. Med. Sci. 2017 14 698 704 10.7150/ijms.19800 28824303 PMC5562122 51. Kajbaf F. De Broe M.E. Lalau J.D. Therapeutic Concentrations of Metformin: A Systematic Review Clin. Pharmacokinet. 2016 55 439 459 10.1007/s40262-015-0323-x 26330026 52. Liu X.D. Li Y.G. Wang G.Y. Bi Y.G. Zhao Y. Yan M.L. Liu X. Wei M. Wan L.L. Zhang Q.Y. Metformin protects high glucose-cultured cardiomyocytes from oxidative stress by promoting NDUFA13 expression and mitochondrial biogenesis via the AMPK signaling pathway Mol. Med. Rep. 2020 22 5262 5270 10.3892/mmr.2020.11599 33174032 PMC7646981 53. Hu M. Ye P. Liao H. Chen M. Yang F. Metformin Protects H9C2 Cardiomyocytes from High-Glucose and Hypoxia/Reoxygenation Injury via Inhibition of Reactive Oxygen Species Generation and Inflammatory Responses: Role of AMPK and JNK J. Diabetes Res. 2016 2016 2961954 10.1155/2016/2961954 27294149 PMC4884853 54. Kato H. Iwashita K. Iwasa M. Kato S. Yamakage H. Suganami T. Tanaka M. Satoh-Asahara N. Imeglimin Exhibits Novel Anti-Inflammatory Effects on High-Glucose-Stimulated Mouse Microglia through ULK1-Mediated Suppression of the TXNIP-NLRP3 Axis Cells 2024 13 284 10.3390/cells13030284 38334676 PMC10854746 55. Vial G. Lamarche F. Cottet-Rousselle C. Hallakou-Bozec S. Borel A.L. Fontaine E. The mechanism by which imeglimin inhibits gluconeogenesis in rat liver cells Endocrinol. Diabetes Metab. 2021 4 e00211 10.1002/edm2.211 33855213 PMC8029524 56. Yan J. Zhang Z. Shi H. HIF-1 is involved in high glucose-induced paracellular permeability of brain endothelial cells Cell. Mol. Life Sci. CMLS 2012 69 115 128 10.1007/s00018-011-0731-5 21617913 PMC11115066 57. Sajja R.K. Prasad S. Cucullo L. Impact of altered glycaemia on blood-brain barrier endothelium: An in vitro study using the hCMEC/D3 cell line Fluids Barriers CNS 2014 11 8 10.1186/2045-8118-11-8 24708805 PMC3985548 58. Brown R.C. Morris A.P. O’Neil R.G. Tight junction protein expression and barrier properties of immortalized mouse brain microvessel endothelial cells Brain Res. 2007 1130 17 30 10.1016/j.brainres.2006.10.083 17169347 PMC1995120 59. Zhou D. Petersen A. Adelöf J. Hernebring M. Zetterberg M. A Novel Primary Porcine Retinal Pigment Epithelium Cell Model with Preserved Properties Curr. Eye Res. 2024 49 97 107 10.1080/02713683.2023.2259636 37725007 60. Dubourg J. Perrimond-Dauchy S. Felices M. Bolze S. Voiriot P. Fouqueray P. Absence of QTc prolongation in a thorough QT study with imeglimin, a first in class oral agent for type 2 diabetes mellitus Eur. J. Clin. Pharmacol. 2020 76 1393 1400 10.1007/s00228-020-02929-6 32556539 61. Abe K. Yano T. Tanno M. Miki T. Kuno A. Sato T. Kouzu H. Nakata K. Ohwada W. Kimura Y. mTORC1 inhibition attenuates necroptosis through RIP1 inhibition-mediated TFEB activation Biochim. Biophys. Acta.—Mol. Basis Dis. 2019 1865 165552 10.1016/j.bbadis.2019.165552 31499159 62. Watanabe M. Yano T. Sato T. Umetsu A. Higashide M. Furuhashi M. Ohguro H. mTOR Inhibitors Modulate the Physical Properties of 3D Spheroids Derived from H9c2 Cells Int. J. Mol. Sci. 2023 24 11459 10.3390/ijms241411459 37511214 PMC10380298 63. Oouchi Y. Watanabe M. Ida Y. Ohguro H. Hikage F. Rosiglitasone and ROCK Inhibitors Modulate Fibrogenetic Changes in TGF-β2 Treated Human Conjunctival Fibroblasts (HconF) in Different Manners Int. J. Mol. Sci. 2021 22 7335 10.3390/ijms22147335 34298955 PMC8307967 64. Kaneko Y. Ohta M. Inoue T. Mizuno K. Isobe T. Tanabe S. Tanihara H. Effects of K-115 (Ripasudil), a novel ROCK inhibitor, on trabecular meshwork and Schlemm’s canal endothelial cells Sci. Rep. 2016 6 19640 10.1038/srep19640 26782355 PMC4725980 65. Ida Y. Hikage F. Itoh K. Ida H. Ohguro H. Prostaglandin F2α agonist-induced suppression of 3T3-L1 cell adipogenesis affects spatial formation of extra-cellular matrix Sci. Rep. 2020 10 7958 10.1038/s41598-020-64674-1 32409724 PMC7224398 66. Itoh K. Hikage F. Ida Y. Ohguro H. Prostaglandin F2α Agonists Negatively Modulate the Size of 3D Organoids from Primary Human Orbital Fibroblasts Investig. Ophthalmol. Vis. Sci. 2020 61 13 10.1167/iovs.61.6.13 PMC7415291 32503053 Figure 1 Met- or Ime-induced cytotoxicity in planner cultured H9c2 cells under high-glucose conditions. The cytotoxicity of 2 mM metformin (Met) and 2 mM imeglimin (Ime) towards H9c2 cells under high-glucose (50 mM, H-Glu) conditions was assessed and compared with that under normal glucose (5.5 mM, N-Glu) conditions. Viable cells in planar cultured H9c2 cells were evaluated using a commercially available kit (Cell Counting Kit-8, Dojin Laboratories, Kumamoto, Japan), and the values were plotted ( n Figure 2 Effects of Met or Ime on the cellular metabolic functions of H9c2 cells under high-glucose conditions. H9c2 cells were cultured under normal-glucose (5.5 mM, N-Glu) conditions and then incubated for 24 hrs under N-Glu or high-glucose (50 mM, H-Glu) conditions, with or without 2 mM metformin (Met) or 2 mM imeglimin (Ime). Metabolic function was assessed using a Seahorse XFe96 Bioanalyzer. Panel ( A B C D E F G H I J K n p Figure 3 H9c2 cells were cultured under normal-glucose (5.5 mM, N-Glu) conditions and then incubated for 24 hrs under N-Glu or high-glucose (50 mM, H-Glu) conditions, with or without 2 mM metformin (Met) or 2 mM imeglimin (Ime). Reactive oxygen species (ROS) production was assessed using DCFH-DA. Panel ( A B n p p Figure 4 Evaluation of autophagy-related LC3-I and LC3-II expression levels via Western blotting. Lysates from H9c2 cells cultured under normal-glucose (N-Glu), high-glucose (H-Glu), high-glucose-with-metformin (Met), and high-glucose-with-imeglimin (Ime) conditions were subjected to Western blot analysis. Panel ( A B C D p Figure 5 Effects of Met or Ime on transepithelial electrical resistance (TEER) values of planar H9c2 cell monolayers. H9c2 cells were cultured under normal-glucose (5.5 mM, N-Glu) conditions and then incubated for 24 h under N-Glu or high-glucose (50 mM, H-Glu) conditions, with or without 2 mM metformin (Met) or 2 mM imeglimin (Ime). H9c2 cell monolayers were then subjected to electric resistance (Ωcm 2 n p Figure 6 H9c2 cells were cultured under normal-glucose (5.5 mM, N-Glu) conditions and then incubated for 24 h under N-Glu or high-glucose (50 mM, H-Glu) conditions, with or without 2 mM metformin (Met) or 2 mM imeglimin (Ime). Each sample was subjected to qRT-PCR analysis, and the mRNA expression levels of β-catenin (Ctnnb) Panel ( A B C n p p p ",
  "metadata": {
    "Title of this paper": "Prostaglandin F2α Agonists Negatively Modulate the Size of 3D Organoids from Primary Human Orbital Fibroblasts",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469297/"
  }
}