{
  "title": "Paper_278",
  "abstract": "pmc J Dent Sci J Dent Sci 3597 jds Journal of Dental Sciences 1991-7902 2213-8862 Association for Dental Sciences of the Republic of China PMC12485405 PMC12485405.1 12485405 12485405 41040584 10.1016/j.jds.2025.05.032 S1991-7902(25)00180-1 1 Original Article Single-cell isolation reveals 5 fluorouracil-resistant subclones in oral squamous cell carcinoma: New insights into stemness and epithelial–mesenchymal transition for targeted therapies Su Wei-Chia a b 1 Chang Yi-Ming c d 1 Chen Hsin-Hu a Chen Su-Feng a Yang Meng-Hua d Lin Yu-Chun yuchunlin@mail.ndmctsgh.edu.tw d e f ⁎⁎ Yu Jian-Hong kenkoyu@mail.cmu.edu.tw a g ⁎ a b c d e f g ⁎ kenkoyu@mail.cmu.edu.tw ⁎⁎ yuchunlin@mail.ndmctsgh.edu.tw 1 These authors contributed equally to this work. 10 2025 06 6 2025 20 4 498055 2283 2291 8 4 2025 27 5 2025 06 06 2025 02 10 2025 03 10 2025 © 2025 Association for Dental Sciences of the Republic of China. Publishing services by Elsevier B.Vé. 2025 Association for Dental Sciences of the Republic of China https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background/purpose Oral squamous cell carcinoma (OSCC) often recurs and has poor clinical outcomes, partly attributable to subpopulations that develop resistance to 5 fluorouracil (5FU). Elucidating how these resistant clones emerge and drive tumour aggressiveness is essential for improving OSCC treatment approaches. Materials and methods To establish 5FU-resistant cells, SCC25 cells were repeatedly exposed to 5FU, and single-cell clones were subsequently isolated using a microfluidic system. Three subclones-Holoclone, Meroclone, and Paraclone-were evaluated for their 5FU responses, expression of drug-efflux pumps (ABCB1, ABCG2), and resistance in three-dimensional (3D) cultures. Their levels of cancer stem cell (CSC) markers (OCT4, SOX2, CD44, CD133) and epithelial–mesenchymal transition (EMT) markers (E-cadherin, Vimentin, Twist) were also examined. In addition, Transwell assays were performed to assess migration and invasion. Results Compared with parental SCC25 cells, the three subclones exhibited markedly higher resistance to 5FU under 3D spheroid conditions, concurrent with upregulated ABCB1 and ABCG2 expression. All three subclones showed enhanced sphere-forming capacity and increased OCT4 and SOX2 levels, consistent with higher proportions of CD44 + + Conclusion Extended 5FU treatment in OSCC selects for distinct subclones that exhibit CSC-like traits and EMT-related motility, promoting robust chemoresistance and heightened malignancy. These findings emphasise the importance of developing comprehensive therapeutic strategies that simultaneously target drug-efflux mechanisms, CSC markers, and EMT pathways to more effectively control OSCC progression. Keywords Resistant subclones Cancer stem cells Epithelial-mesenchymal transition Microfluidic single-cell isolation 3D spheroid culture pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Oral squamous cell carcinoma (OSCC) ranks among the most common malignancies of the head and neck, posing a considerable global health burden. Although surgical techniques, radiotherapy, and chemotherapy have evolved, many patients still experience local or distant recurrence. 1 , 2 3 , 4 Multiple processes are implicated in chemotherapy resistance. In addition to well-characterised genetic mutations, 5 , 6 7 , 8 9 , 10 11 12 13 14 , 15 6 , 16 17 , 18 19 , 20 21 , 22 22 , 23 In this study, we established a comprehensive platform that integrates microfluidic single-cell isolation, 24 25 26 9 , 27 , 28 29 , 30 31 Our findings underscore the considerable heterogeneity of 5FU-resistant OSCC subclones and the pivotal roles of both CSC-associated and EMT-related pathways in shaping chemotherapy resistance. By focussing on adaptive changes at the single-cell level, this work provides new perspectives for developing targeted therapies that confront not only specific mutations but also the dynamic phenotypic shifts that drive disease progression. Materials and methods Cell culture and reagents SCC25 human OSCC cells (American Type Culture Collection, ATCC) were maintained in Dulbecco's Modified Eagle Medium/Ham's F-12 (DMEM/F-12) supplemented with 10 % foetal bovine serum (FBS) and 1 % penicillin–streptomycin at 37 °C in a 5 % CO 2 Generation of 5FU-resistant SCC25 subclone To emulate clinical chemotherapy regimens more closely, a pulse-exposure approach was adopted. Initially, SCC25 cells were treated with 5FU at its half-maximal inhibitory concentration (IC 50 Single-cell isolation and clonal expansion A microfluidic-based single-cell sorting device (CellGem®; OriGem Biotech Inc., Taichung, Taiwan) was used to isolate individual cells from the 5FU-resistant SCC25 pool. A suspension of 1 × 10 6 26 3D spheroid culture For three-dimensional growth, we employed a scaffold-free microfluidic system (CellHD256®; OriGem Biotech Inc., Taichung, Taiwan) equipped with microwells. Typically, 1 × 10 3 Reverse-transcription quantitative PCR (RT-qPCR) Total RNA was extracted using TRIzol reagent (Invitrogen, USA). One microgram of RNA was reverse-transcribed into cDNA (Applied Biosystems, Foster, CA, USA), and RT-qPCR was performed using a SYBR Green detection system on a StepOnePlus Real-Time PCR instrument (Applied Biosystems). GAPDH served as an internal reference. Relative expression levels of ABCB1, ABCG2, OCT4, SOX2, CD44, and CD133 were determined by the ΔΔCt method. Details of primer sequences and reagents are provided in Table 1 Table 1 Detailed list of primers used. Table 1 Oligo Title Sequences (5’ to 3’) Amplicon Size GAPDH (Reference Gene) qFP -AAGGTGAAGGTCGGAGTCAA 314 bp qRP -AATGAAGGGGTCATTGATGG MDR1 qFP -ATTCCTCGAGAAACTGCGAA 150 bp qRP -TCACTTCAGGCAACCAG ABCG2 qFP -CTGAGATCCTGAGCCTTTGG 122 bp qRP -TGCCCATCACAACATCATCT SOX2 qFP -GGCAGCTACGCATGATGCAGGAGC 150 bp qRP -CTGGTCATGGAGTTGTACTGCACG OCT-4 qFP -CGCACCACTGGCATTGTCAT 247 bp qRP -TTCTCCTTGATGTCACGCAC E cadherin qFP - CGCATTGCCACATACACTCT 252 bp qRP - TTGGCTGAGGATGGTGTAAG Vimentin qFP - GAGCTGCAGGAGCTGAATG 344 bp qRP - GGTCAAGACGTGCCAGAG Twist qFP - ACGAGCTGGACTCCAAGATG 484 bp qRP - GGCACGACCTCTTGAGAA TG Abbreviation: GAPDH = Glyceraldehyde 3-phosphate dehydrogenase; MDR1 = Multidrug Resistance 1; ABCG2 = ATP binding cassette subfamily G member 2; SOX2 = SRY-Box Transcription Factor 2; OCT-4 = octamer-binding transcription factor 4. Western blot analysis Cell lysates were prepared in RIPA buffer and quantified using the bicinchoninic acid (BCA) assay (Thermo Fisher Scientific, Waltham, MA, USA). Equal amounts of protein (30–50 μg) were separated by 8–12 % SDS-PAGE, transferred onto polyvinylidene fluoride (PVDF) membranes, and blocked with 5 % non-fat milk for 1 h. Primary antibodies against ABCB1, ABCG2, OCT4, SOX2, E-cadherin, N-cadherin, Vimentin, and Twist (see Table 2 Table 2 Detailed list of primary antibodies used. Table 2 Antibody name Clone Dilute WB/Flow/IHC Company MDR-1 Rabbit pAb (GTX108370) 1:1000 Gene Tex, USA. ABCG2 Rabbit pAb (GTX100437) 1:1000 Gene Tex, USA. OCT4 Rabbit pAb (GTX101497) 1:500 Gene Tex, USA. SOX2 Rabbit pAb (bs0523R) 1:500 Bioss Antibodies, USA. PE-CD44 Mouse mab (338807) 1:100 BioLegend, USA. PE-CD133 Mouse mab (393903) 1:50 BioLegend, USA. E-cadherin Rabbit pAb (GTX100443) 1:1000/1:300 Gene Tex, USA. Vimentin Rabbit pAb (GTX100619) 1:1000/1:500 Gene Tex, USA. Twist Rabbit pAb (GTX127310) 1:500 Gene Tex, USA. b-actin Mouse mab (ab213262) 1:3000 Abcam, UK Abbreviation: MDR1 = Multidrug Resistance 1; ABCG2 = ATP binding cassette subfamily G member 2; OCT-4 = octamer-binding transcription factor 4; SOX2 = SRY-Box Transcription Factor 2; PE-CD44 = Phycoerythrin - cluster of differentiation 44; PE-CD133 = Phycoerythrin - cluster of differentiation 133. Flow cytometry for CSC markers Subclones were dissociated with trypsin–EDTA, washed in PBS, and adjusted to a concentration of 1 × 10 6 Table 2 Migration and invasion assays Cell migration and invasion were assessed using Transwell chambers (8-μm pore size; Corning®, NY, USA). For migration assays, 1 × 10 5 Statistical analysis All data are expressed as mean ± standard deviation, based on at least three independent experiments. Statistical analyses were conducted using GraphPad Prism (v10, GraphPad Software Inc., La Jolla, CA, USA). Differences between two groups were evaluated with a two-tailed Student's t P Results Generation and morphological characterisation of 5FU-resistant subclones via microfluidic single-cell isolation Repeated treatment of SCC25 cells with 5FU at its IC 50 Fig. 1 Figure 1 Establishing Drug-Resistant Subclones. Repeated treatment of SCC25 cells with 5FU at IC 50 Figure 1 To explore subclonal variation within this resistant population, we employed a microfluidic single-cell isolation platform that allowed individual cells to be cultured in separate microwells under uniform conditions. After 10–14 days, three distinct colony types emerged: Holoclone, Meroclone, and Paraclone ( Fig. 1 Distinct 5FU responses under 3D culture conditions reflect subclonal heterogeneity and drug efflux mechanisms Next, we investigated multiple drug resistant associated gene and protein. RT-qPCR and Western blotting analyses demonstrated marked upregulation of ABCB1 and ABCG2 in Holoclone and Paraclone ( Fig. 2 P Figure 2 Differences in 5FU resistance markers among subclones. RT-qPCR and Western blot analyses reveal marked upregulation of ABCB1 (P-glycoprotein) and ABCG2 in Holoclone and Paraclone, suggesting enhanced drug efflux capacity (A, B). In three-dimensional (3D) spheroid cultures, all subclones exhibit greater tolerance to 5FU, underscoring the influence of the microenvironment on chemotherapeutic resistance (C). Data are expressed as mean ± SD. White points as sample size; ∗: P P Figure 2 Three-dimensional (3D) spheroid assays revealed that all subclones exhibited greater drug tolerance compared to two-diamensional (2D) cultures ( Fig. 2 P Assessment of CSC-like properties in 5FU-resistant OSCC subclones To elucidate the molecular basis of these cancer stem cell (CSC)-like features, we investigated whether our three subclones possessed such properties. In accordance with the existing literature, which suggests that drug-resistant tumour cells frequently exhibit CSC-like attributes, we performed the expression of the core pluripotency factors SOX2 and OCT4 at both the mRNA and protein levels. Holoclone and Paraclone showed markedly elevated expression of these stemness-related genes, while Meroclone exhibited comparatively lower levels, and the parental SCC25 cells expressed minimal or negligible amounts ( Fig. 3 P Figure 3 Characterization of CSC-like features in 5FU-resistant OSCC subclones. Analysis of SOX2 and OCT4 at both the mRNA and protein levels shows that Holoclone and Paraclone exhibit markedly elevated expression of these stemness-related factors, whereas Meroclone displays comparatively lower levels and the parental SCC25 cells show minimal or negligible amounts (A, B). Flow cytometric analysis indicates that the parental SCC25 cells have fewer than 50% CD133⁺/CD44⁺ populations, while all three subclones exceed 99% for CD133 expression. Among the subclones, Holoclone exhibits the highest CD44 levels, followed by Paraclone and Meroclone (C). Data are expressed as mean ± SD. White points as sample size; ∗: P P Figure 3 We further evaluated flow cytometric analysis of the established CSC markers CD133 and CD44 in both the parental SCC25 cells and each subclone. The parental SCC25 cells displayed fewer than 50 % CD133 + + Fig. 3 Differential EMT marker expression and increased invasiveness in SCC25 subclones In this study, we utilised the SCC25 oral squamous cell carcinoma cell line to isolate three distinct subclones-Holoclone, Meroclone, and Paraclone-and investigated the expression of epithelial–mesenchymal transition (EMT) markers (E-cadherin, Vimentin) and the transcription factor Twist. Through RT-qPCR and Western blot analyses, we observed that E-cadherin levels were highest in the parental SCC25 cells, followed by Meroclone, whereas Holoclone and Paraclone both exhibited reduced E-cadherin expression. In contrast, Vimentin was upregulated in Holoclone, Meroclone, and Paraclone, but remained comparatively low in the parental cells. Moreover, Twist expression was most pronounced in Holoclone, moderate in Paraclone, and lower in both the parental SCC25 cells and Meroclone ( Fig. 4 P Figure 4 EMT marker profiling and migratory capacity of SCC25-derived subclones. RT-qPCR and Western blot analyses show that the parental SCC25 cells exhibit the highest E-cadherin expression, followed by Meroclone, whereas Holoclone and Paraclone display markedly reduced E-cadherin. In contrast, Vimentin is elevated in all three subclones compared with the parental cells, and Twist is most strongly expressed in Holoclone, moderate in Paraclone, and lower in both parental SCC25 cells and Meroclone (A, B). Transwell-based migration and invasion assays confirm that Holoclone and Paraclone possess significantly enhanced migratory and invasive capacities (C). Scale bars 500 μm. Data are expressed as mean ± SD. White points as sample size; ∗: P P Figure 4 Subsequent migration and invasion assays demonstrated that Holoclone and Paraclone displayed markedly enhanced migratory capacity ( Fig. 4 P Discussion The current study reveals that sustained 5 fluorouracil (5FU) treatment in oral squamous cell carcinoma (OSCC) leads to the emergence of distinct drug-resistant subclones-Holoclone, Meroclone, and Paraclone-with divergent phenotypes, varying degrees of chemotherapy tolerance, and unique molecular profiles. By using a microfluidic-based single-cell isolation method, we were able to separate and expand individual clones, thereby exposing the inherent heterogeneity that underpins chemotherapy resistance in OSCC. Despite focusing on a single OSCC line (SCC25) which may limit broader applicability future investigations incorporating additional lines (e.g., HSC-3, OECM-1) or patient-derived models could still deepen our understanding of 5-FU resistance mechanisms. These findings highlight an important reality in cancer biology: a single cell line can generate multiple subpopulations, each adopting a different strategy for survival under chemotherapeutic pressure. Our observations corroborate earlier studies showing that repeated drug exposure enriches subpopulations with enhanced drug-efflux mechanisms. 32 33 Beyond drug efflux, our data highlight two additional drivers of resistance and aggressiveness: cancer stem cell (CSC)–like properties and epithelial–mesenchymal transition (EMT). Holoclone and Paraclone exhibited increased levels of OCT4 and SOX2, as well as a higher proportion of CD44 + + 34 5 23 , 29 Several important considerations follow from these findings. First, the presence of multiple resistant clones within a single cell line suggests that therapies targeting a single pathway may be insufficient for complete tumour eradication. Second, we highlight the potential cross-talk between EMT and CSC pathways, noting in particular how TGF-β, Wnt/β-catenin, and Notch signaling may converge to drive the EMT phenotype and sustain CSC properties in 5-FU-resistant OSCC cells. Furthermore, the strong linkage among CSC-associated traits, drug efflux mechanisms, and EMT underscores the need for combination therapies that simultaneously target stemness signaling, transporter activity, and mesenchymal transformation. Third, our results underscore the value of integrating 3D culture methodologies with single-cell analyses to more accurately capture the complexity of tumour subclones. Incorporating patient-derived specimens into these approaches could further support personalised treatment planning in OSCC. In conclusion, we show that continuous 5-FU exposure selects for OSCC subclones with robust CSC-like phenotypes, EMT traits, and augmented efflux capacities, collectively driving drug resistance and invasive potential. By elucidating these mechanisms, our study establishes a framework for targeted interventions to overcome 5-FU resistance in OSCC. Pursuing dual-target therapies that combine ABC transporter inhibitors (e.g., ABCG2/ABCB1) with EMT/CSC pathway blockers may reduce chemoresistance and prevent relapse. Furthermore, integrating single-cell isolation and 3D spheroid methods into personalized pipelines could quickly profile patient-derived OSCC cells for resistance patterns and guide combination therapies before clinical administration. Such an approach promises therapeutic outcomes for OSCC. Declaration of competing interest The authors have no conflicts of interest relevant to this article. References 1 Li Q. Xia C. Li H. Disparities in 36 cancers across 185 countries: secondary analysis of global cancer statistics Front Med 18 2024 911 920 39167345 10.1007/s11684-024-1058-6 2 Bray F. Laversanne M. Sung H. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 74 2024 229 263 38572751 10.3322/caac.21834 3 Noronha V. Patil V. Chaturvedi P. Phase 3 RCT comparing docetaxel-platinum with docetaxel-platinum-5FU as neoadjuvant chemotherapy in borderline resectable oral cancer Eur J Cancer 200 2024 113560 10.1016/j.ejca.2024.113560 38306841 4 Pignon J.P. le Maitre A. Maillard E. Bourhis J. Group M.N.C. Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): an update on 93 randomised trials and 17,346 patients Radiother Oncol 92 2009 4 14 19446902 10.1016/j.radonc.2009.04.014 5 P J.N. Patil S.R. Veeraraghavan V.P. Daniel S. Aileni K.R. Karobari M.I. Oral cancer stem cells: a comprehensive review of key drivers of treatment resistance and tumor recurrence Eur J Pharmacol 989 2025 177222 10.1016/j.ejphar.2024.177222 39755243 6 Atashi F. Vahed N. Emamverdizadeh P. Fattahi S. Paya L. Drug resistance against 5 fluorouracil and cisplatin in the treatment of head and neck squamous cell carcinoma: a systematic review J Dent Res Dent Clin Dent Prospects 15 2021 219 225 34712414 10.34172/joddd.2021.036 PMC8538146 7 Gupta I. Badrzadeh F. Tsentalovich Y. Gaykalova D.A. Connecting the dots: investigating the link between environmental, genetic, and epigenetic influences in metabolomic alterations in oral squamous cell carcinoma J Exp Clin Cancer Res 43 2024 239 39169426 10.1186/s13046-024-03141-5 PMC11337877 8 Mesgari H. Esmaelian S. Nasiri K. Ghasemzadeh S. Doroudgar P. Payandeh Z. Epigenetic regulation in oral squamous cell carcinoma microenvironment: a comprehensive review Cancers (Basel) 15 2023 5600 38067304 10.3390/cancers15235600 PMC10705512 9 Sun J. Skanata A. Movileanu L. Single-molecule observation of competitive protein-protein interactions utilizing a nanopore ACS Nano 19 2025 103 115 10.1021/acsnano.4c13072 PMC11752528 39718930 10 Ali M. Zhang Z. Ibrahim M.A.A. Soliman M.E.S. Heat shock protein (Hsp27)-ceramide synthase (Cers1) protein-protein interactions provide a new avenue for unexplored anti-cancer mechanism and therapy J Recept Signal Transduct Res 44 2024 41 53 39189140 10.1080/10799893.2024.2392711 11 Gupta S. Silveira D.A. Lorenzoni P.R. Mombach J.C.M. Hashimoto R.F. LncRNA PTENP1/miR-21/PTEN axis modulates EMT and drug resistance in cancer: dynamic boolean modeling for cell fates in DNA damage response Int J Mol Sci 25 2024 8264 39125832 10.3390/ijms25158264 PMC11311614 12 Feng Q. Yang P. Wang H. ID09, A newly-designed tubulin inhibitor, regulating the proliferation, migration, emt process and apoptosis of oral squamous cell carcinoma Int J Biol Sci 18 2022 473 490 35002504 10.7150/ijbs.65824 PMC8741845 13 Hamoui M.Z. Rizvi S. Arnouk H. Roberts C.M. Putative biomarkers for prognosis, epithelial-to-mesenchymal transition, and drug response in cell lines representing oral squamous cell carcinoma progression Genes 16 2025 209 40004538 10.3390/genes16020209 PMC11855662 14 Acharya S.K. Shai S. Choon Y.F. Cancer stem cells in oral squamous cell carcinoma: a narrative review on experimental characteristics and methodological challenges Biomedicines 12 2024 2111 39335624 10.3390/biomedicines12092111 PMC11429394 15 Biddle A. Gammon L. Liang X. Costea D.E. Mackenzie I.C. Phenotypic plasticity determines cancer stem cell therapeutic resistance in oral squamous cell carcinoma EBioMedicine 4 2016 138 145 26981578 10.1016/j.ebiom.2016.01.007 PMC4776071 16 Tandon A. Singh N.N. Gulati N. CD44 related stemness maneuvers oral squamous cell carcinoma biology Indian J Pathol Microbiol 65 2022 268 273 35435358 10.4103/IJPM.IJPM_1139_20 17 Wen X.T. Ma Z. Zhang C. Tao S.C. Chen X.J. Mai H.M. Maintenance of the stemness in CD133(+)primary oral squamous cell carcinoma cells under different culture conditions Shang Hai Kou Qiang Yi Xue 31 2022 343 348 36710544 18 Ma Z. Zhang C. Liu X. Characterisation of a subpopulation of CD133(+) cancer stem cells from Chinese patients with oral squamous cell carcinoma Sci Rep 10 2020 8875 32483269 10.1038/s41598-020-64947-9 PMC7264286 19 Dai Y. Wu Z. Chen Y. Ye X. Wang C. Zhu H. OCT4's role and mechanism underlying oral squamous cell carcinoma J Zhejiang Univ - Sci B 24 2023 796 806 37701956 10.1631/jzus.B2200602 PMC10500100 20 Sun S. Yang H. Wang F. Zhao S. Oct4 downregulation-induced inflammation increases the migration and invasion rate of oral squamous cell carcinoma Acta Biochim Biophys Sin 53 2021 1440 1449 34553218 10.1093/abbs/gmab127 21 Sacco A. Battaglia A.M. Santamaria G. SOX2 promotes a cancer stem cell-like phenotype and local spreading in oral squamous cell carcinoma PLoS One 18 2023 e0293475 10.1371/journal.pone.0293475 PMC10721099 38096163 22 Rizzo D. Graziani C. Gallus R. Stem cell markers in oral and oropharyngeal squamous cell carcinomas in relation to the site of origin and HPV infection: clinical implications Acta Otorhinolaryngol Ital 40 2020 90 98 32469002 10.14639/0392-100X-2419 PMC7256905 23 Tokozlu B. Yucel O.O. Gultekin S.E. Bozdag L.A. Epithelial mesenchymal transition and cancer stem cell markers in oral epithelial dysplasia and oral squamous cell carcinoma Pol J Pathol 75 2024 305 314 39849873 10.5114/pjp.2024.145818 24 Wang C. Qiu J. Liu M. Microfluidic biochips for single-cell isolation and single-cell analysis of multiomics and exosomes Adv Sci (Weinh) 11 2024 e2401263 10.1002/advs.202401263 PMC11267386 38767182 25 Hochstetter A. Lab-on-a-chip technologies for the single cell level: separation, analysis, and diagnostics Micromachines (Basel) 11 2020 468 32365567 10.3390/mi11050468 PMC7281269 26 Chen H.H. Nguyen T.V. Shih Y.H. Combining microfluidic chip and low-attachment culture devices to isolate oral cancer stem cells J Dent Sci 19 2024 560 567 38303836 10.1016/j.jds.2023.10.005 PMC10829749 27 Chen Z. Park S. Three-dimensional hanging drop spheroid plates for easy chimeric antigen receptor (car) t cytotoxicity assay Methods Mol Biol 2764 2024 35 42 38393587 10.1007/978-1-0716-3674-9_4 28 Rasouli M. Safari F. Kanani M.H. Ahvati H. Principles of hanging drop method (spheroid formation) in cell culture Methods Mol Biol 2879 2025 289 300 38411887 10.1007/7651_2024_527 29 Tieche C.C. Gao Y. Buhrer E.D. Tumor initiation capacity and therapy resistance are differential features of emt-related subpopulations in the nsclc cell line a549 Neoplasia (New York, N Y) 21 2019 185 196 30591423 10.1016/j.neo.2018.09.008 PMC6309124 30 Chen S.H. Yu J.H. Lin Y.C. Chang Y.M. Liu N.T. Chen S.F. Application of an integrated single-cell and three-dimensional spheroid culture platform for investigating drug resistance heterogeneity and epithelial-mesenchymal transition (EMT) in lung cancer subclones Int J Mol Sci 26 2025 1766 40004228 10.3390/ijms26041766 PMC11855057 31 Lu X. Wang Z. Huang H. Wang H. Hedgehog signaling promotes multidrug resistance by regulation of ABC transporters in oral squamous cell carcinoma J Oral Pathol Med 49 2020 897 906 32512620 10.1111/jop.13050 32 Wang S. Wang S.Q. Chen X.B. Cell-based screen identifies a highly potent and orally available abcb1 modulator for treatment of multidrug resistance J Med Chem 67 2024 18764 18780 39425773 10.1021/acs.jmedchem.4c01081 33 Bhuker S. Sinha A.K. Arora A. Genes and proteins expression profile of 2D vs 3D cancer models: a comparative analysis for better tumor insights Cytotechnology 77 2025 51 39867829 10.1007/s10616-025-00714-w PMC11759753 34 Adnan Y. Ali S.M.A. Farooqui H.A. Kayani H.A. Idrees R. Awan M.S. High CD44 immunoexpression correlates with poor overall survival: assessing the role of cancer stem cell markers in oral squamous cell carcinoma patients from the high-risk population of Pakistan Int J Surg Oncol 2022 2022 9990489 10.1155/2022/9990489 PMC8920653 35296132 Acknowledgment The study was funded by the Tri-Service General Hospital TSGHD-113082 ",
  "metadata": {
    "Title of this paper": "High CD44 immunoexpression correlates with poor overall survival: assessing the role of cancer stem cell markers in oral squamous cell carcinoma patients from the high-risk population of Pakistan",
    "Journal it was published in:": "Journal of Dental Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485405/"
  }
}