{
  "title": "Paper_1092",
  "abstract": "pmc Dent J (Basel) Dent J (Basel) 3384 dentj dentistry Dentistry Journal 2304-6767 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468662 PMC12468662.1 12468662 12468662 41002663 10.3390/dj13090390 dentistry-13-00390 1 Article Embracing Artificial Intelligence in Dental Practice: An Exploratory Study of Romanian Clinicians’ Perspectives and Experiences Cozmescu Alin Flavius Conceptualization Methodology Resources Writing – original draft 1 https://orcid.org/0009-0003-6970-1307 Cernega Ana Resources Supervision 1 * Mincă Dana Galieta Validation 2 * https://orcid.org/0000-0002-2915-5124 Didilescu Andreea Cristiana Supervision 3 Imre Marina Meleșcanu Data curation 4 https://orcid.org/0000-0002-4345-282X Totan Alexandra Ripszky Data curation 5 Pârvu Simona Data curation 6 Pițuru Silviu-Mirel Conceptualization Methodology Validation Supervision 1 Boffano Paolo Academic Editor 1 alin-flavius.cozmescu@drd.umfcd.ro silviu.pituru@umfcd.ro 2 3 andreea.didilescu@umfcd.ro 4 marina.imre@umfcd.ro 5 alexandra.ripszky@umfcd.ro 6 simona.parvu@umfcd.ro * ana.cernega@umfcd.ro dana.minca@umfcd.ro 27 8 2025 9 2025 13 9 497630 390 14 7 2025 21 8 2025 25 8 2025 27 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Results: Conclusions: artificial intelligence doctor–patient relationship healthcare system education management diagnostics treatment This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction 1.1. A Brief History of Artificial Intelligence and Its Applications in Dentistry Artificial intelligence (AI), in its modern sense, refers to computer technologies that are capable of mimicking human cognitive functions such as learning, decision-making, and complex reasoning. Alan Turing, a key pioneer of artificial intelligence, proposed the “Turing Test” in 1950 to judge whether a machine can imitate human behavior convincingly enough to deceive an interrogator communicating solely through written messages. If the interrogator cannot reliably distinguish the machine from a human participant, the machine is considered to have demonstrated human-like intelligence [ 1 2 In 1956, mathematician John McCarthy, who is considered the father of AI, introduced the term at a conference held in Dartmouth, USA, officially marking AI as an independent field of research [ 3 4 5 6 7 8 To outline a clearer and more comprehensive picture regarding the future of AI in the healthcare sector, we conducted a multidimensional study based on the three primary components of the dental healthcare system: the dentist, who represents the core element of expertise and clinical practice; the dental practice manager, who is responsible for the administrative and organizational dimension of the system; and finally, the patient, who is the direct beneficiary of the development and improvement of therapeutic options [ 9 10 11 12 13 14 15 16 17 1.2. Legislative Context Given that AI is a field with a pronounced dynamic, the legislative spectrum plays an extremely important role in its regulation [ 18 19 20 20 The transition to an increasingly digital world in which AI makes its presence felt more and more, as well as the paradigm shift and the increased agency of the patient within the doctor–patient relationship, represents a historical moment, comparable to the moment of the appearance of the Hippocratic Oath. The study presented in this scientific article is part of a broader research initiative designed to answer three fundamental questions concerning dentists’ perceptions of AI integration into clinical practice: What level of difficulty do dentists experience in utilizing AI within dental practices? How willing are dentists to adopt new technologies based on AI? Lastly, what is the impact of AI-driven digital tools on their current clinical practices? Beyond the perspectives of dental professionals, this research project also aims to explore insights from dental practice managers, representing the administrative and organizational dimensions of the broader dental healthcare system, as well as patient perspectives on these transformative changes. These additional viewpoints will be discussed in forthcoming scientific articles, ultimately assembling a comprehensive and multidimensional picture of this evolving landscape. 2. Materials and Methods 2.1. Statistical Methods The Materials and Methods section outlines the research design, participant selection, data collection instruments, procedural steps, and analytical techniques employed in this study. In conducting this study, we applied the STROBE recommendations required for cross-sectional studies, thus ensuring a high degree of rigor in the work [ 21 Statistical analysis was performed using IBM SPSS Statistics for Windows, version 25 (IBM Corp., Armonk, NY, USA) and Microsoft Office Excel/Word 2024. Quantitative variables were reported as means with standard deviations or medians with interpercentile ranges; their distribution was assessed using the Shapiro–Wilk test. Non-parametric independent quantitative variables were compared between investigated factors via Kruskal–Wallis H tests (with Dunn–Bonferroni post-hoc tests), while correlations between non-parametric independent quantitative variables were evaluated using Spearman’s rho correlation coefficient. Qualitative variables were expressed as absolute values or percentages, and intergroup differences were tested with Fisher’s Exact Test. Z-tests with Bonferroni corrections provided further detail in contingency tables. The investigated subdomains were as follows: scheduling, diagnosis, treatment planning, feedback, and follow-up (dispensarization), each containing 15 items in the survey. In each of the subdomains, exploratory Principal Component Analysis (PCA) models were used, retaining the first component with the highest explained variance (largest eigenvalue, λ), and with items included in the first component having at least an absolute loading of ≥0.30. Analyzing all items in the survey, an overall exploratory PCA was made in order to observe overall digitalization scores, in which four components emerged. Each item received a score from 1 (minimum interest) to 5 (maximum interest), reversed for items showing negative PCA coefficients. The overall score was the arithmetic mean of all included items. PCA was used only for the exploration of item loading patterns, in which items that needed reverse scoring could be identified; as such, validation assessments for PCA models were not necessary. Observed scores in the exploratory PCA models were validated via Cronbach’s alpha, where internal consistency was measured, examining changes in the coefficient upon item removal. Statistical significance was set at α = 0.05. 2.2. The Design of the Questionnaire Data collection was carried out through an anonymous structured questionnaire administered on paper ( Supplementary Materials Three dependent variables were evaluated: perceived difficulty in utilizing digital tools, willingness to integrate AI technologies, and perceived impact of AI on routine clinical practice. The questions were designed to analyze the five key stages of a patient’s visit to a dental clinic: scheduling appointments, diagnosing dental conditions, planning treatment, patient feedback, and follow-up/dispensing procedures. The variable regarding perceived difficulty was identified from a set of questions that sought to identify possible challenges that may arise in the five stages mentioned above (efficient time management, compliance with legislation, operational efficiency, communication, and compliance with internal regulations). The variable regarding willingness to adopt AI-based technologies was measured through a parallel set of questions focused on identifying and classifying opportunities for improvement through digital technologies (optimization of medical times and processes, integration and interoperability of systems, preliminary and personalized assessment, extended access to users, and updating and simplifying information). The perceived impact was also assessed by analyzing responses to questions about the potential threats posed by the integration of digital processes and artificial intelligence (technological obsolescence, data security risks, algorithm errors, excessive dependence on automation, and depersonalization of communication). 2.3. The Studied Group As the main eligibility criterion, the selection was made among clinicians actively involved in dental practice in Bucharest and adjacent areas who were willing to complete and participate in this research. In order to qualify, participants had to hold one of the following professional qualifications officially conferred by the Romanian dental regulatory authority: general dentist, resident, specialist, or primary care physician. There were no restrictions on age, gender, or seniority in clinical practice. Practitioners who did not routinely provide direct dental care to patients were excluded. As a method of selection, participants were recruited through purposive and convenience sampling methods, employing direct communication via professional channels and online platforms frequently accessed by Romanian dental professionals. The study population comprised dental professionals across different career stages, including general dentists, residents, specialists, and senior practitioners. Independent variables encompassed demographic and professional attributes, specifically age, gender, practice setting, professional status, and clinical experience level. This combined methodological framework aimed to yield a nuanced understanding of factors influencing the adoption of AI and digital technologies within dentistry. To ensure methodological rigor, these demographic and professional categories were determined through a structured questionnaire administered under standardized conditions. Informed consent was obtained from all participants prior to data collection, and responses were aggregated and analyzed in accordance with established ethical and academic standards. These stratifications and demographic summaries provided an essential foundation for interpreting this study’s subsequent findings. The questionnaire was reviewed and approved by the Scientific Research Ethics Committee of the Carol Davila University of Medicine and Pharmacy, Bucharest. This approval bears the code PO-35-F-03 and has the registration number 28,287 from 1 October 2024. This study was conducted over a period spanning from October 2024 to March 2025. No missing data were present, as all returned questionnaires were fully completed. No formal sample size calculation was performed, as this research was designed as a pilot study to address AI interference in the doctor–patient relationship. Given the early stage of the study, we identified a number of limitations in its implementation, such as the different distribution of physician categories according to age (with younger physicians being more open to completing the survey), their experience, professional level, work environment (urban and rural), and the time when the research was conducted. These limitations can be addressed in future research. The current study represents a starting point and orientation for future approaches. 3. Results and Discussions 3.1. Demographic Results The findings of this study emphasize commonly held views on the acceptance and use of AI-driven digital technologies while also revealing issues that warrant further scrutiny. This Results section offers an overview of dentists’ attitudes, highlighting both established practices and unresolved questions surrounding the integration of AI into clinical workflows. In total, 200 dentists completed the questionnaire, providing data on their attitudes toward digitalization and the integration of AI in dental practice, perceptions about doctor–patient relationships, data security concerns, implementation costs, and legal implications. The study sample consisted of dental practitioners selected from a total population of 5708 dentists officially registered with the College of Dentists in Bucharest [ 22 3.1.1. Distribution of Participants by Age Within the framework of this study, the participants were stratified into specific age groups with the following distribution: 25.9% aged 25–30 years, 30% aged 31–35 years, 16.4% aged 36–40 years, 11.8% aged 41–45 years, 7.7% aged 46–50 years, 3.2% aged 51–55 years, 4.5% aged 56–60 years, and 0.5% aged over 60 years. In terms of gender representation, 57.7% of respondents were male, while 42.3% were female. Regarding the primary practice setting, the majority (85.9%) of participants reported working in urban areas, with 14.1% working within rural environments. 3.1.2. Distribution of Participants by Professional Qualification Conducted in Romania—where dental school graduates may hold one of the following professional qualifications: general dentist, resident, specialist, or primary dentist—this study found that 55.9% of respondents were general dentists, followed by specialists (29.5%), residents (9.5%), and primary dentists (5%). Participants were further categorized based on years of clinical experience: 26.4% had 0–3 years, 36.8% had 4–10 years, 17.7% had 11–15 years, 10% had 16–20 years, 3.6% had 21–25 years, 4.5% had 26–30 years, and 0.9% had more than 31 years of experience. In order to gain a more nuanced understanding of how willing dental practitioners are to transition toward an increasingly digital working environment and to incorporate applications and technologies supported by various AI systems into their routine practice, the questionnaire included three specific items aimed at distinguishing participants’ competencies, readiness, and current stage of digital technology adoption. 3.2. Subdomains of Dental Treatment Stages such as scheduling, establishing a diagnosis, treatment planning, dispensing, and feedback are the focus of current and future digital tools. Maintaining the doctor–patient relationship, efficiency, data interoperability, and concerns regarding data security and protection represented key elements in the concerns of dentists throughout the questionnaire. Figure 1 The results of this analysis highlight clear trends regarding dentists’ interest in integrating AI at different stages of clinical activity. The analysis of the subdomains relevant to dental practice, namely patient scheduling, diagnosis, treatment planning, feedback, and dispensing, reflects varying levels of concern and readiness for the adoption of innovative technologies based on AI tools. 3.2.1. Analysis of Subdomain—Diagnosis Diagnosis, an essential stage involving the identification of various oro–maxillo–facial conditions with resonance and effects on the health of the whole organism and the formulation of coherent clinical reasoning, saw high interest, suggesting that dentists perceive AI as a valuable resource in the accuracy and speed of clinical decisions. This trend indicates that dentists recognize the potential of technology in supporting their own expertise and reducing diagnostic errors, as well as in improving the quality of patient care. A comparable interest was also identified in the patient’s dispensary stage, which includes monitoring treatment results, prevention, education, and ongoing care. This result shows that doctors understand the importance of using digital technologies for the long-term follow-up of oral health and the early identification of possible complications, essential aspects of the doctor–patient relationship and loyalty. These solutions can improve patients’ awareness of oral health and stimulate the adoption of effective preventive behaviors. Thus, the use of technology for education and prevention can translate into reducing the incidence of oral diseases, optimizing long-term therapeutic costs, and strengthening the doctor–patient relationship by actively involving patients in managing their own oral health. This approach reflects a fundamental paradigm shift from predominantly curative treatment to preventive dentistry and is oriented towards continuous patient education, optimally using digital tools and AI as essential support in this process. 3.2.2. Analysis of Subdomain—Treatment Planning Treatment planning, which involves structuring interventions based on diagnostic information, saw moderate interest, which reflects an awareness of the relevance of this stage, but also a relative reluctance to fully adopt new digital tools. It is crucial to note that one potential reason may be the difficulty of integrating cutting-edge technical solutions into everyday operations; this is an area that needs more focus through specialized training courses and user-friendly interfaces. 3.2.3. Analysis of Subdomain—Feedback When discussing the interest expressed regarding feedback after completing dental treatments, which involves a broader discussion with the patient regarding the results expected by them and the actual results of the treatment, the response of the doctors and their degree of interest was moderate. The doctors were aware of the importance of better communication with the patient and the degree of satisfaction and trust felt by the patient. Still, they were not fully prepared to adopt a completely digital or mostly digital approach to this stage. To improve this aspect, it is essential to develop systems that facilitate the rapid assessment of patient satisfaction, integrating intuitive and easily accessible digital technologies. 3.2.4. Analysis of Subdomain—Appointment On the other hand, the lowest interest was observed in the appointment stage, which suggests that dentists consider managing appointments as a less relevant task for their direct clinical work. This attitude may emphasize the perception that administrative activities are secondary compared to actual medical decisions. From another perspective, this lack of focus on using AI in the programming phase can be justified by doctors’ desire to maintain a human touch in administrative processes, so that they can respond to patients’ needs for safety through human connection. However, increasing interest and adoption of digital technologies in this stage can optimize the workflow, reduce time lost in administrative activities, and allow for better focus on clinical aspects and direct patient relationships. Overall, these results underscore the priority placed on direct clinical decision-making and continuous patient engagement over preliminary logistical tasks. 3.3. The Perceived Degree of Difficulty To create a more accurate understanding of the interviewed dental practitioners’ perspectives, they responded to a question evaluating the degree of difficulty encountered when using digital tools within their current practice. The findings from our study highlight an improved perception among dental practitioners regarding the level of difficulty experienced when utilizing digital instruments. Specifically, only 9.1% of respondents indicated a high degree of difficulty, 37.3% reported a moderate degree of difficulty, and 53.6% perceived a low degree of difficulty. A detailed analysis according to age categories, professional experience, and practice setting yielded the following results. 3.3.1. Analysis of Perceived Difficulty by Age Group Table 1 p 3.3.2. Analysis of Perceived Difficulty in Relation to Professional Experience Table 2 p The data underscore a clear correlation between professional experience and perceived difficulty with digital tools, indicating that younger dentists, or those with fewer years in practice, tend to adapt more readily to digital technologies. Conversely, practitioners with extensive professional experience may face greater challenges, highlighting the importance of further discussions and studies to bridge gaps among more experienced professionals. 3.3.3. Analysis of the Perception of the Degree of Difficulty in Relation to the Professional Environment The data presented in Figure 2 p Furthermore, Z-tests with Bonferroni correction indicated that rural practitioners reported a moderate or high level of difficulty rather than a low level (30%/20.7% vs. 6.8%) significantly more frequently, whereas urban practitioners reported a low level of difficulty rather than moderate or high levels of difficulty (93.2% vs. 79.3%/70%) significantly more frequently. These findings highlight a significant variation in perceived difficulty concerning the use of digital instruments between urban and rural dental practitioners. Specifically, rural dentists reported encountering higher levels of difficulty significantly more often than their urban counterparts. Several factors may explain this discrepancy. While infrastructure challenges remain significant, individual barriers—such as digital literacy and limited peer support—often hinder rural dentists’ adoption of new technologies. Viewing this gap as an opportunity for targeted empowerment at the practitioner and clinic level can make a substantial impact. 3.4. The Degree of Willingness 3.4.1. Analysis of Willingness by Age Group Table 3 p When examining the willingness of dental practitioners to adopt new, AI-based technologies, psychological and behavioral factors play a pivotal role. The way a dentist perceives and approaches technology adoption is closely tied to their interpretation of the new information made available to them. Professional socialization further contributes to this attitude. Younger dentists have been socialized in an era of rapid technological advancement and likely experienced mentors or curricula encouraging the use of digital tools. Meanwhile, many older dentists were socialized under earlier norms that emphasized manual expertise and physician autonomy, which might predispose them to view AI as an external disruptor rather than an integral part of care. Risk perception is another differentiator: older clinicians are generally more risk-averse, which can lead them to perceive implementing AI as a potential risk, whether due to technical uncertainties, patient safety concerns, or disruptions to workflow, that they are reluctant to undertake this new technology without clear proof of benefit. Younger clinicians, having slightly lower risk aversion on average and fewer ingrained practice habits, may be more willing to pilot new technologies with the hope of gaining efficiency or improved outcomes. Lastly, perceived threats to professional autonomy and role identity influence adoption. Some experienced dentists fear that AI could encroach on their decision-making authority or undermine their expertise, fueling reluctance to adopt tools that might dictate or second-guess their clinical judgment. In contrast, the younger clinicians accustomed to working with decision-support software and evidence-based guidelines, may tend to see AI as an augmentative partner that streamlines workflows rather than a threat to their autonomy. These sociocultural and psychological factors together help explain why the younger group is more enthusiastic about integrating AI, and they suggest that as tech-confident generations become the majority, the overall trajectory of AI adoption in dental practice will accelerate, driven by those younger professionals who are shaping the future and setting new trends in the field. 3.4.2. Analysis of Willingness in Relation to Professional Experience Table 4 p The data also show a dynamic interaction between professional experience and technology acceptance among dentists, suggesting that those with fewer years of practice may be more receptive to innovations. In contrast, those with more experience may be wary of new tools, possibly due to well-established traditional clinical experience and perceived complexities. Correcting these divergences can create a unified practice environment in which all specialists capitalize on technological advances, leading to direct patient benefit and optimizing procedures for the real benefit of the physician by optimizing allocated resources, be they time, financial, or human resources involved. Encouraging peer mentoring to share experiences, both traditional and digital clinical, can benefit both parties involved in this exchange of experiences. Providing easily accessible training resources and highlighting tangible clinical benefits can help align the degree of technology adoption across different levels of experience. Younger practitioners seem more enthusiastic about adopting new technologies, perhaps due to greater familiarity with digital innovations or more recent training. In contrast, the moderate willingness observed in certain intermediate-age segments suggests a cautious approach, possibly influenced by existing workflows or implementation challenges. It is also important to remember the reasons for some degree of reluctance in terms of the availability, degree of use, and adoption of digital tools. Medical professionals are aware of the security risks that come with collecting large packages of sensitive data, such as medical data, the level of protection that must be offered to these types of data, the costs involved in digitization, integration of artificial intelligence as well as protection solutions, and perhaps most importantly, preserving the doctor–patient relationship. 3.4.3. Analysis of Willingness in Relation to the Professional Environment Figure 3 p The area of origin of the people who participated in this study highlighted a pronounced digital gap between dentists from urban areas and those from rural areas, reflected by the significant difference in the difficulty of using digital tools. The data suggest that rural dentists show less enthusiasm for adopting new digital solutions than their urban counterparts, who declare themselves more prepared for technological advances and the integration of technologies based on artificial intelligence. With limited access to technological resources and training opportunities that are more difficult to access than their urban colleagues, specialists from rural areas more often reported moderate and high levels of difficulty. The survey results that we managed to obtain during this study suggest an excellent opportunity for training programs and an excellent timeframe to improve technological and digital infrastructure in certain areas, ensuring equal access to the newest digital innovations. The implications include increased competitiveness and higher quality of medical services through the adoption of modern technologies, as well as the need for collaboration between authorities, professionals, and professional organizations to reduce discrepancies. For better results, it is necessary to bridge the gap, ensuring equitable patient experiences, improved diagnostic accuracy, and better workflows across practice types. In connection with the point previously mentioned, investments in continuing distance education can bring a seamless integration of digital technologies into dental practice. This step is crucial for major progress in dental services across the country. 3.5. The Use of Digital Tools in Current Practice 3.5.1. Analysis of the Use of Digital Tools by Age Group Table 5 p According to this study’s results, dentists aged 31 to 35 encounter the fewest difficulties in using digital tools, indicating an easier adoption of new technologies. In contrast, more experienced practitioners face more significant challenges, particularly those over 46. We observed a special category of respondents, aged between 25 and 30, who presented some difficulties when using digital tools. These findings highlight a generational gap in digital skills, highlighting the need for well-structured training and support programs addressed to a well-defined target audience. Programs should be designed with the primary intention to help dentists with extensive clinical experience integrate new tools and young and very young dentists who are at the beginning of their careers adopt a fully digital approach. Overcoming these technological hurdles could increase office efficiency, improve patient care, and encourage broader acceptance of innovations. 3.5.2. Analysis of the Use of Digital Tools in Relation to Professional Experience The data in Table 6 p If we discuss the level of professional experience, the results obtained in the questionnaire indicate a clear correlation between the number of years of professional practice and the perceived difficulty in using digital tools. Mid-career dentists seem more familiar with technology, while more experienced medical professionals often face greater challenges, usually due to work habits formed over time and a lack of contact with recent innovations. The differences observed both from the individual perspective of the respondents and from the results considered as a whole emphasize the need for personalized training programs both at the individual and group levels. These training programs and the allocation of resources adapted to different levels of knowledge and experience aim to strengthen the variety of digital skills of dentists for a modern practice within the office. From a practical perspective, the development and practice of these skills can transform administrative tasks, which are generally seen as time-consuming, into activities that are performed automatically and, at the same time, can improve communication with patients, strengthening the doctor–patient relationship. Overall, the efficiency of clinical activity can increase, and the time allocated to the patient can also increase considerably. Ultimately, reducing the digital skills gap is essential to maintain the pace of growth, innovation, and quality in modern dentistry. 3.5.3. Analysis of the Use of Digital Tools in Relation to the Professional Environment Figure 4 p Digitalization and the integration of artificial intelligence allow dentists to overcome the barriers of space, time, and resources. Thus, they facilitate equal and continuous access to specialized services and reduce the geographical discrepancies between urban and rural dental practices. These aspects highlight the need for personalized and differentiated approaches in continuous professional development designed to adapt to the specifics of each targeted professional segment. The information obtained also draws attention to the implementation of personalized support policies and a technological infrastructure specifically adapted to the work environment. These measures are intended to narrow the technology gap and alleviate the identified difficulties. At the same time, they facilitate the acceptance and actual integration of digital techniques and artificial intelligence in dental offices. A more uniform and equitable distribution of dental services can be achieved, which ultimately benefits the patient directly. 3.6. Time Management Thinking The data in Figure 5 p p The results of this study highlight a negative correlation of low intensity between age and the desire to reduce the duration of the medical act through digitization and automation of processes. In other words, younger or less experienced doctors tend to give greater importance to time efficiency, while more experienced practitioners may focus less on this dimension. The fact that the distribution of both variables is non-parametric, confirmed by the Shapiro–Wilk test, indicates a significant heterogeneity of the responses. Although the level of statistical significance validates the relationship, the low strength of the correlation signals that the differences are not uniform and that there are exceptions. Thus, although the general trend suggests that less experienced doctors place greater emphasis on reducing clinical time, some senior practitioners may share the same views, depending on personal factors or the professional context. Analyzing the results obtained, we can assert that this study identified one of the major perceived benefits of implementing artificial intelligence in the medical sector: time efficiency. The time saved through AI integration does not merely refer to a reduction in the duration of patient interactions but rather represents a comprehensive gain for the entire medical team. Each instance of time optimization across the various stages of treatment constitutes a significant advantage for clinicians, patients, and administrative personnel alike. The relevance of this finding is therefore critical. It can be reasonably argued that artificial intelligence not only contributes to time savings but also plays a role in minimizing errors—particularly those resulting from fatigue, inattention, or burnout. Considering the increasing prevalence of burnout syndrome among healthcare professionals in current practice, AI has the potential to play a decisive role in mitigating its impact and supporting clinical efficiency and well-being. As a whole, this result confirms the general desire for the efficiency of the medical act and a much more intelligent allocation of one of the most valuable, if not the most valuable, resources: time 3.7. Interest Scores in Relation to Digitalization Figure 6 The results of this study highlight broad trends in digital adoption and usage, identify persistent challenges, and reveal prevailing attitudes toward AI-based technologies. Across sectors, the adoption of digital tools is expanding, yet participants face ongoing challenges in effective implementation and integration. Attitudes toward AI remain generally positive but cautious, reflecting enthusiasm for innovation balanced by awareness of potential risks. This overview of key findings provides a foundation for further analysis, bridging the results to future, deeper exploration. By analyzing the previously obtained data, a number of advantages can be substantiated for both dental practitioners and their patients. One of the most prominent benefits lies in the reduction in time associated with the digitalization of various medical processes. This reduction shortens the duration of clinical encounters, allowing both the dentist and the patient to gain valuable time. As a result, the doctor–patient relationship is strengthened, and clinical appointments become more efficient and purposeful. Furthermore, the minimization of potential errors during treatment increases the success rate of implementing therapeutic plans, ultimately leading to higher patient satisfaction and deeper trust between the two parties. The security of medical data plays a crucial role in the process of collecting, using, and storing sensitive health information. When clinicians demonstrate confidence in the technologies employed, this assurance is naturally conveyed to the patient as well. In the context of healthcare, data management is bound by both professional confidentiality and legal obligations related to the protection of personal data. Ultimately, if these technological implementations are achieved at a cost that both the practitioner and the patient are willing to assume, artificial intelligence can be considered to have fulfilled its objective: to support the development and enhancement of the doctor–patient relationship, along with all its derived dimensions. 3.8. Inadaptation to Digitalization The last item that we discussed is presented in Figure 7 p p p p A particularly interesting aspect of the study, which emerged from the data collected and analyzed, shows that dentists with experience between 0 and 3 years and those with experience between 16 and 20 years experience significantly greater difficulties in adapting to digital workflows. The less experienced group, despite having benefited from a more extensive digital education in college, faces challenges in applying theoretical knowledge in real clinical practice, facing a steep learning curve and limited practical support. On the other hand, the group with 16–20 years of experience received little or no digital training in the early years of their careers and developed solid analog workflows that were difficult to replace mid-career. Thus, this group may show greater resistance to adopting new systems. Compared to these two subgroups, dentists with 4 to 15 years of experience show lower levels of inadaptability, suggesting that they have benefited from progressive exposure to technology and frequent updates to their work infrastructure. The latter group, in turn, has benefited from digital knowledge acquired in academia and clinical practice with a strong digital character, requiring them to keep up with frequent updates to international protocols and recommendations. This dynamic highlights how both generational and professional factors contribute to adaptation difficulties. Younger dentists face practical barriers, while those mid-career face already ingrained methods. Overall, these findings highlight the importance of tailored support, from hands-on mentoring for beginners to targeted retraining programs for mid-career clinicians, so that the integration of digital technology is as smooth as possible at all levels of experience. Overall, nuanced models of adaptation show that the success of implementing digital solutions depends on reducing both educational gaps and practical limitations. Correcting these divergences can create a unified practice environment in which all specialists capitalize on technological advances, leading to direct patient benefit and optimizing procedures for the real benefit of the physician by optimizing allocated resources, be they time, financial, or human resources involved. 3.9. Implications of AI in Dentistry As dentistry moves firmly into the digital age, AI is beginning to influence the entire career path of the clinician, from pre-clinical training to decisions made at the dental chair, and its long-term value will depend on the extent to which these tools reinforce, rather than replace, the human dimensions of the medical act. In education, the virtual reality-based curriculum evaluated by Sukotjo and collaborators shows that immersive simulation not only accelerates the acquisition of procedural competence but also personalizes learning through real-time feedback, anticipating an AI-supported pedagogy in which algorithms tailor scenarios to each student’s performance and democratize access for those in remote or resource-limited areas [ 23 Once in clinical practice, the high fidelity reported for modern intraoral scanners by Canullo and colleagues provides the quality data needed by systems relying on AI algorithms to detect early lesions, optimize implant positioning, and automate CAD/CAM flows with a consistency that surpasses manual interpretation [ 24 25 The importance of the issue analyzed in this study is supported by a number of studies identified in the literature. We identified analyses of certain indicators that we have examined. Referring to the specialized literature and findings from other studies focused on diagnostic procedures in dentistry, a study conducted in 2025 on the capacity of AI-based software to diagnose periodontal diseases showed that the detection capabilities of the presented software are comparable to those of a specialized dentist with extensive experience in the field [ 26 Also, studies show genuine benefits from implementing AI-based digital tools during the treatment planning stage. For example, by minimizing errors, improving workflow efficiency, and refining diagnostic precision, virtual articulators significantly enhance prosthodontic, orthodontic, and orthognathic treatments. This advanced technology improves condylar guidance accuracy and supports more reliable treatment modalities [ 27 An interesting study conducted by the University of Trieste in Italy further substantiates the concept of involving AI in patient monitoring. Dentists are advised to take this approach into consideration by directing patients toward reliable sources of information. This research specifically examines the responses provided by ChatGPT version 3.5 to patients, as evaluated by specialists in the field, and the results are remarkable. The accuracy of the answers is notably high, indicating that virtual assistants are playing an increasingly significant role in patient education [ 28 At the same time, we identified a set of intriguing findings from a study conducted in Germany (Eschert, 2022), where 23.2% of the surveyed dental practitioners evaluated their knowledge regarding digital technologies based on AI-driven tools as very poor, 37.1% assessed their knowledge as average, and 22.2% considered it above average [ 29 Enhanced digital literacy through continuing education and hands-on training builds confidence and competence. Structured mentorships, pairing tech-competent mentors with colleagues less familiar with digital workflows, can further accelerate skill acquisition—an approach already proven to foster technology uptake in healthcare. Likewise, peer support networks like online forums, Facebook groups, or WhatsApp conversation groups facilitate knowledge-sharing and reduce professional isolation in remote areas [ 30 31 For a better understanding of the whole process, we designed a diagram, as shown in Figure 8 32 33 34 35 36 On the left, eight AI-enabled advantages cascade across these tiers. Enhanced diagnostic accuracy and predictive treatment planning inform evidence-based decision-making at both managerial and clinical nodes [ 34 37 38 39 40 Conversely, the right flank enumerates eight red-coded vulnerabilities that threaten the same levels. Data security and cyber threats imperil the integrity of patient records, while algorithmic bias jeopardizes diagnostic equity. Legal and liability issues, compounded by a lack of standardization and regulation, expose providers and managers to compliance uncertainty. Organizational inertia manifests as resistance to change and adoption, whereas technological dependency raises concerns about operational resilience [ 41 42 Understanding and strategically balancing these interlinked forces is indispensable for achieving ethically grounded, high-quality, and sustainable AI integration in dentistry. 3.10. The Importance of the Learning Curve In relation to the learning curve, at this stage of implementation and integration of AI in medical practice, every dentist experiences a learning curve when beginning to utilize AI-based tools, and understanding this curve—particularly its initial stages—is critical for effective innovation implementation. The classic model of the four stages of competence (also known as the “conscious competence model”) describes progression from unconscious incompetence (when individuals do not know what they do not know) to conscious incompetence (when they recognize their knowledge gaps and begin learning), then to conscious competence (when they can perform the new skill but only with deliberate effort), and ultimately to unconscious competence (mastering the skill effortlessly, automatically). In the context of dentists’ adoption of AI, the initial stage—unconscious incompetence—holds particular significance [ 42 43 44 45 46 47 To facilitate AI adoption, it is crucial to accelerate dentists’ progression from this initial stage toward conscious incompetence—essentially, helping them recognize what they do not know and the value of acquiring this knowledge. This can be accomplished through education and clearly presenting both the benefits and vulnerabilities of AI via demonstration workshops, introductory courses on AI in dentistry, consultation of specialized research studies, and, importantly, learning from the experiences and mistakes of others. When dentists practically observe how an algorithm can detect hidden lesions or save time in treatment planning, they may experience a revelatory moment (“Eureka!”) [ 48 The results of this study reveal a profound need for change through learning, a difficult process of adaptation and acceptance of the cycle of learning, unlearning, and relearning, which is essential in this changing world. With this in mind, we consider it essential to implement a dual perspective in terms of European policies and strategies with national implementation. On the one hand, we discussed the need to ensure a high level of safety for practitioners in the use of AI by developing the legal framework for regulating its intervention in healthcare. On the other hand, we discussed the need to fill the information gaps of both students who will be future doctors and doctors whose learning process took place before AI was introduced into professional practice. Thus, strategies should aim to adapt the university curriculum to include learning elements specific to the digital age for students, as well as organizing certifications for the acquisition of skills by doctors already in the workforce. To ensure that the full potential of AI is realized in dentistry, it is imperative to construct a regulatory architecture that upholds ethical standards, clinical safety, and sustainability. Achieving this goal requires coordinated efforts among regulatory bodies, academic institutions, and professional organizations, ensuring that the principles of responsibility, transparency, and patient-centered care guide implementation. In this light, AI must not be perceived as a replacement for clinical expertise, but rather as a complementary instrument that augments professional judgement, reinforces medical precision, and humanizes clinical interactions in the digital era. This study, conducted by the research team, has certain limitations regarding the number of participants, the restricted environment of their practical activity, the research being conducted only in Bucharest and adjacent areas, and also the extremely rapid dynamics of the field analyzed. It is necessary that in future, based on the results obtained and the conclusions drawn from this research, the field of AI and its integration in the current practice of dentists should include as many adjacent studies as possible. In order to better understand the world in which dentists work, we also need to address the challenges of the future. 4. Conclusions The integration of AI into dental medicine represents a critical catalyst for the transformation of the doctor–patient dynamic. By facilitating the optimization of both clinical and administrative processes and enabling a more equitable distribution of resources, AI contributes significantly to reducing disparities in access to oral healthcare. Moreover, its capacity to enhance communication, enable continuous treatment monitoring, and improve diagnostic precision supports a more personalized and effective dispensary process. These advancements collectively foster stronger patient loyalty, elevate satisfaction levels, and promote the organic development of dental practices through enhanced trust and engagement. Change is no longer imminent; it is already unfolding. It falls upon each of us to embrace it, comprehend its implications, and utilize its potential to the highest degree. In conclusion, Marcus Tullius Cicero’s enduring relevance serves as a guiding principle: “Character without intelligence can accomplish much; intelligence without character can accomplish nothing” Acknowledgments This article was completed with the support of The Interdisciplinary Center for Dental Research and Development, the “Carol Davila” University of Medicine and Pharmacy, Bucharest, Romania, through the institutional program “Publish not Perish”. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/dj13090390/s1 Author Contributions Conceptualization, A.F.C. and S.-M.P.; methodology, A.F.C. and S.-M.P.; validation, S.-M.P. and. D.G.M.; resources, A.F.C. and A.C.; data curation, S.P., M.M.I. and A.R.T.; writing—original draft preparation, A.F.C.; supervision, S.-M.P., A.C.D. and A.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of Carol Davila University of Medicine and Pharmacy, Bucharest (protocol code PO-35-F-03/01.10.2024). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Tripathi S. Augustin A. Dako F. Kim E. Turing test-inspired method for analysis of biases prevalent in artificial intelligence-based medical imaging AI Ethics 2023 3 1193 1201 10.1007/s43681-022-00227-8 36313215 PMC9590390 2. Turing I. Computing Machinery and Intelligence Mind 1950 LIX 433 460 10.1093/mind/LIX.236.433 3. Jones L.D. Golan D. Hanna S.A. Ramachandran M. Artificial intelligence, machine learning and the evolution of healthcare: A bright future or cause for concern? Bone Jt. Res. 2018 7 223 225 10.1302/2046-3758.73.BJR-2017-0147.R1 PMC5987686 29922439 4. Stogiannos N. Walsh G. Ohene-Botwe B. McHugh K. Potts B. Tam W. O’Sullivan C. Quinsten A.S. Gibson C. Gorga R.G. R-AI-diographers: A European survey on perceived impact of AI on professional identity, careers, and radiographers’ roles Insights Imaging 2025 16 43 10.1186/s13244-025-01918-6 39962024 PMC11832980 5. Rokhshad R. Ducret M. Chaurasia A. Karteva T. Radenkovic M. Roganovic J. Hamdan M. Mohammad-Rahimi H. Krois J. Lahoud P. Ethical considerations on artificial intelligence in dentistry: A framework and checklist J. Dent. 2023 135 104593 10.1016/j.jdent.2023.104593 37355089 6. Schwendicke F. Samek W. Krois J. Artificial Intelligence in Dentistry: Chances and Challenges J. Dent. Res. 2020 99 769 774 10.1177/0022034520915714 32315260 PMC7309354 7. Khanagar S.B. Al-ehaideb A. Maganur P.C. Vishwanathaiah S. Patil S. Baeshen H.A. Sarode S.C. Bhandi S. Developments, application, and performance of artificial intelligence in dentistry—A systematic review J. Dent. Sci. 2021 16 508 522 10.1016/j.jds.2020.06.019 33384840 PMC7770297 8. Tomášik J. Zsoldos M. Majdáková K. Fleischmann A. Oravcová Ľ. Sónak Ballová D. Thurzo A. The Potential of AI-Powered Face Enhancement Technologies in Face-Driven Orthodontic Treatment Planning Appl. Sci. 2024 14 7837 10.3390/app14177837 9. Katsumata A. Deep learning and artificial intelligence in dental diagnostic imaging Jpn. Dent. Sci. Rev. 2023 59 329 333 10.1016/j.jdsr.2023.09.004 37811196 PMC10551806 10. Fatima A. Shafi I. Afzal H. Díez I.T. Lourdes D.R.M. Breñosa J. Espinosa J.C.M. Ashraf I. Advancements in Dentistry with Artificial Intelligence: Current Clinical Applications and Future Perspectives Healthcare 2022 10 2188 10.3390/healthcare10112188 36360529 PMC9690084 11. Lee S.J. Chung D. Asano A. Sasaki D. Maeno M. Ishida Y. Kobayashi T. Kuwajima Y. Da Silva J.D. Nagai S. Diagnosis of Tooth Prognosis Using Artificial Intelligence Diagnostics 2022 12 1422 10.3390/diagnostics12061422 35741232 PMC9221626 12. Geetha V. Aprameya K.S. Hinduja D.M. Dental caries diagnosis in digital radiographs using back-propagation neural network Health Inf. Sci. Syst. 2020 8 8 10.1007/s13755-019-0096-y 31949895 PMC6942116 13. Prados-Privado M. García Villalón J. Martínez-Martínez C.H. Ivorra C. Prados-Frutos J.C. Dental Caries Diagnosis and Detection Using Neural Networks: A Systematic Review J. Clin. Med. 2020 9 3579 10.3390/jcm9113579 33172056 PMC7694692 14. Casalegno F. Newton T. Daher R. Abdelaziz M. Lodi-Rizzini A. Schürmann F. Krejci I. Markram H. Caries Detection with Near-Infrared Transillumination Using Deep Learning J. Dent. Res. 2019 98 1227 1233 10.1177/0022034519871884 31449759 PMC6761787 15. Çakmak G. Cho J.-H. Choi J. Yoon H.-I. Yilmaz B. Schimmel M. Can deep learning-designed anterior tooth-borne crown fulfill morphologic, aesthetic, and functional criteria in clinical practice? J. Dent. 2024 150 105368 10.1016/j.jdent.2024.105368 39326724 16. Revilla-León M. Gómez-Polo M. Vyas S. Barmak B.A. Galluci G.O. Att W. Krishnamurthy V.R. Artificial intelligence applications in implant dentistry: A systematic review J. Prosthet. Dent. 2023 129 293 300 10.1016/j.prosdent.2021.05.008 34144789 17. Takahashi T. Nozaki K. Gonda T. Mameno T. Wada M. Ikebe K. Identification of dental implants using deep learning-pilot study Int. J. Implant. Dent. 2020 6 53 10.1186/s40729-020-00250-6 32959154 PMC7505912 18. de Fine Licht K. de Fine Licht J. Artificial intelligence, transparency, and public decision-making: Why explanations are key when trying to produce perceived legitimacy AI Soc. 2020 35 917 926 10.1007/s00146-020-00960-w 19. Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the Protection of Natural Persons with Regard to the Processing of Personal Data and on the Free Movement of Such Data, and Repealing Directive 95/46/EC (General Data Protection Regulation) Available online: https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32016R0679 (accessed on 12 December 2024) 20. Regulation (EU) 2024/1689 of the European Parliament and of the Council of 13 June 2024 Laying Down Harmonised Rules on Artificial Intelligence and Amending Regulations (EC) No 300/2008, (EU) No 167/2013, (EU) No 168/2013, (EU) 2018/858, (EU) 2018/1139 and (EU) 2019/2144 and Directives 2014/90/EU, (EU) 2016/797 and (EU) 2020/1828 (Artificial Intelligence Act) Available online: https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=OJ:L_202401689 (accessed on 12 December 2024) 21. Von Elm E. Altman D.G. Egger M. Pocock S.J. Gøtzsche P.C. Vandenbroucke J.P. The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) Statement: Guidelines for Reporting Observational Studies PLoS Med. 2007 4 e296 10.1371/journal.pmed.0040296 17941714 PMC2020495 22. College of Dentists in Bucharest Available online: https://cmsr.ro/ (accessed on 14 December 2024) 23. Sukotjo C. Schreiber S. Li J. Zhang M. Yuan J.C. Santoso M. Development and student perception of virtual reality for implant surgery Educ. Sci. 2021 11 176 10.3390/educsci11040176 24. Canullo L. Colombo M. Menini M. Sorge P. Pesce P. Trueness of intraoral scanners considering operator experience and three different implant scenarios: A preliminary report Int. J. Prosthodont. 2020 34 250 253 10.11607/ijp.6224 32589002 25. Moore R. Trusting the Dentist—Expecting a Leap of Faith vs. a Well-Defined Strategy for Anxious Patients Dent. J. 2022 10 66 10.3390/dj10040066 35448060 PMC9032626 26. Butnaru O.-M. Tatarciuc M. Luchian I. Tudorici T. Balcos C. Budala D.G. Sirghe A. Virvescu D.I. Haba D. AI Efficiency in Dentistry: Comparing Artificial Intelligence Systems with Human Practitioners in Assessing Several Periodontal Parameters Medicina 2025 61 572 10.3390/medicina61040572 40282863 PMC12028870 27. Lobo S. Argolinha I. Machado V. Botelho J. Rua J. Li J. Mendes J.J. Advances in Digital Technologies in Dental Medicine: Enhancing Precision in Virtual Articulators J. Clin. Med. 2025 14 1495 10.3390/jcm14051495 40094941 PMC11900346 28. Troian M. Lovadina S. Ravasin A. Arbore A. Aleksova A. Baratella E. Cortale M. An Assessment of ChatGPT’s Responses to Common Patient Questions About Lung Cancer Surgery: A Preliminary Clinical Evaluation of Accuracy and Relevance J. Clin. Med. 2025 14 1676 10.3390/jcm14051676 40095693 PMC11900997 29. Eschert T. Schwendicke F. Krois J. Bohner L. Vinayahalingam S. Hanisch M. A Survey on the Use of Artificial Intelligence by Clinicians in Dentistry and Oral and Maxillofacial Surgery Medicina 2022 58 1059 10.3390/medicina58081059 36013526 PMC9412897 30. Pahune S.A. A Brief Overview of How AI Enables Healthcare Sector Rural Development 2024 10.13140/RG.2.2.16675.63525 31. Lamem M.F.H. Sahid M.I. Ahmed A. Artificial intelligence for access to primary healthcare in rural settings, Journal of Medicine Surg. Public Health 2025 5 100173 10.1016/j.glmedi.2024.100173 32. Al Kuwaiti A. Nazer K. Al-Reedy A. Al-Shehri S. Al-Muhanna A. Subbarayalu A.V. Al Muhanna D. Al-Muhanna F.A. A Review of the Role of Artificial Intelligence in Healthcare J. Pers. Med. 2023 13 951 10.3390/jpm13060951 37373940 PMC10301994 33. Williams O.D. COVID-19 and Private Health: Market and Governance Failure Development 2020 63 181 190 10.1057/s41301-020-00273-x 33223765 PMC7670110 34. Bajwa J. Munir U. Nori A. Williams B. Artificial intelligence in healthcare: Transforming the practice of medicine Future Healthc. J. 2021 8 e188 e194 10.7861/fhj.2021-0095 34286183 PMC8285156 35. Faiyazuddin M. Rahman S.J.Q. Anand G. Siddiqui R.K. Mehta R. Khatib M.N. Gaidhane S. Zahiruddin Q.S. Hussain A. Sah R. The Impact of Artificial Intelligence on Healthcare: A Comprehensive Review of Advancements in Diagnostics, Treatment, and Operational Efficiency Health Sci. Rep. 2025 8 e70312 10.1002/hsr2.70312 39763580 PMC11702416 36. Bekbolatova M. Mayer J. Ong C.W. Toma M. Transformative Potential of AI in Healthcare: Definitions, Applications, and Navigating the Ethical Landscape and Public Perspectives Healthcare 2024 12 125 10.3390/healthcare12020125 38255014 PMC10815906 37. Nguyen T.M. Bridge G. Hall M. Theodore K. Lin C. Scully B. Heredia R. Le L.K. Mihalopoulos C. Calache H. Is value-based healthcare a strategy to achieve universal health coverage that includes oral health? An Australian case study J. Public Health Policy 2023 44 310 324 10.1057/s41271-023-00414-9 37142745 PMC10232653 38. Semerci Z.M. Yardımcı S. Empowering Modern Dentistry: The Impact of Artificial Intelligence on Patient Care and Clinical Decision Making Diagnostics 2024 14 1260 10.3390/diagnostics14121260 38928675 PMC11202919 39. Shinners L. Grace S. Smith S. Stephens A. Aggar C. Exploring healthcare professionals’ perceptions of artificial intelligence: Piloting the Shinners Artificial Intelligence Perception tool Digit. Health 2022 8 20552076221078110 10.1177/20552076221078110 35154807 PMC8832586 40. Habli I. Lawton T. Porter Z. Artificial intelligence in health care: Accountability and safety Bull. World Health Organ. 2020 98 251 256 10.2471/BLT.19.237487 32284648 PMC7133468 41. Khan B. Fatima H. Qureshi A. Kumar S. Hanan A. Hussain J. Abdullah S. Drawbacks of Artificial Intelligence and Their Potential Solutions in the Healthcare Sector Biomed. Mater. Devices 2023 1 731 738 10.1007/s44174-023-00063-2 PMC9908503 36785697 42. Howard N.M. Cook D.A. Hatala R. Pusic M.V. Learning Curves in Health Professions Education Simulation Research: A Systematic Review Simul. Healthc. 2021 16 128 135 10.1097/SIH.0000000000000477 32675731 43. Pusic M.V. Boutis K. Hatala R. Cook D.A. Learning curves in health professions education Acad. Med. 2015 90 1034 1042 10.1097/ACM.0000000000000681 25806621 44. Cernega A. Nicolescu D.N. Meleșcanu Imre M. Ripszky Totan A. Arsene A.L. Șerban R.S. Perpelea A.-C. Nedea M.-I. Pițuru S.-M. Volatility, Uncertainty, Complexity, and Ambiguity (VUCA) in Healthcare Healthcare 2024 12 773 10.3390/healthcare12070773 38610195 PMC11011466 45. Cernega A. Meleșcanu Imre M. Ripszky Totan A. Arsene A.L. Dimitriu B. Radoi D. Ilie M.-I. Pițuru S.-M. Collateral Victims of Defensive Medical Practice Healthcare 2023 11 1007 10.3390/healthcare11071007 37046933 PMC10094659 46. Leppink J. Data analysis in medical education research: A multilevel perspective Perspect. Med. Educ. 2015 4 14 24 10.1007/S40037-015-0160-5 25609172 PMC4348225 47. Vargas-Santiago M. León-Velasco D.A. Maldonado-Sifuentes C.E. Chanona-Hernandez L. A State-of-the-Art Review of Artificial Intelligence (AI) Applications in Healthcare: Advances in Diabetes, Cancer, Epidemiology, and Mortality Prediction Computers 2025 14 143 10.3390/computers14040143 48. Ammalainen A. Moroshkina N. Where Does Eureka Come From? The Effect of Unreportable Hints on the Phenomenology of Insight J. Intell. 2022 10 110 10.3390/jintelligence10040110 36412790 PMC9703963 Figure 1 Illustrating scores by subdomains. Figure 2 Degree of difficulty—urban vs. rural. Figure 3 Distribution of doctors according to environment and availability. Figure 4 Distribution of doctors by environment and use of digitalization. Figure 5 The correlation between the desire score for a decrease in the duration of the medical act and experience. Figure 6 Description of interest scores in relation to digitalization. Figure 7 A comparison of maladaptation scores in relation to the level of experience. Figure 8 Illustrating dental health system and AI benefits and vulnerability. dentistry-13-00390-t001_Table 1 Table 1 Tabular representation of perceived difficulty by age group (* Fisher’s Exact Test). Age/ Low Moderate Raised p Nr. % Nr. % Nr. %  25–30 years 35 29.7% 15 18.3% 7 35% <0.001  31–35 years  48  40.7%  17  20.7%  1  5%  36–40 years 18 15.3% 18 22% 0 0%  41–45 years 11 9.3% 14 17.1% 1 5%  46–50 years  4  3.4% 9 11%  4  20%  51–55 years  0  0%  4  4.9%  3  15%  56–60 years  2  1.7% 5 6.1%  3  15%  >60 years  0  0% 0 0%  1  5% dentistry-13-00390-t002_Table 2 Table 2 Tabular representation of perceived difficulty in relation to professional experience (* Fisher’s Exact Test). Experience/ Low Moderate Raised p Nr. % Nr. % Nr. %  0–3 years 35 29.7% 16 19.5% 7 35% <0.001  4–10 years  57  48.3%  23  28%  1  5%  11–15 years 16 13.6% 23 28% 0 0%  16–20 years 7 5.9% 11 13.4% 4 20%  21–25 years  1  0.8% 4 4.9%  3  15%  26–30 years  2  1.7% 4 4.9%  4  20%  31–35 years  0  0% 1 1.2%  1  5% dentistry-13-00390-t003_Table 3 Table 3 Tabular representation of willingness by age group (* Fisher’s Exact Test). Age/ Low Moderate Raised p Nr. % Nr. % Nr. %  25–30 years 3 12% 12 18.2% 42 32.6% <0.001  31–35 years 4 16%  12  18.2%  50  38.8%  36–40 years 4 16% 13 19.7% 19 14.7%  41–45 years 3 12%  13  19.7%  10  7.8%  46–50 years 7 28% 8 12.1% 2 1.6%  51–55 years 2 8% 3 4.5% 2 1.6%  56–60 years 1 4% 5 7.6% 4 3.1%  >60 years 1 4% 0 0% 0 0% dentistry-13-00390-t004_Table 4 Table 4 Tabular representation of willingness in relation to professional experience (* Fisher’s Exact Test). Experience/ Low Moderate Raised p Nr. % Nr. % Nr. %  0–3 years 3 12% 12 18.2% 43 33.3% <0.001  4–10 years 6 24%  16  24.2%  59  45.7%  11–15 years 4 16%  19  28.8%  16  12.4%  16–20 years  8  32%  10  15.2%  4  3.1%  21–25 years 1 4% 4 6.1% 3 2.3%  26–30 years 2 8% 4 6.1% 4 3.1%  31–35 years 1 4% 1 1.5% 0 0% dentistry-13-00390-t005_Table 5 Table 5 A tabular representation of the use of digital tools by age group (* Fisher’s Exact Test). Age/Utilization Absent Present p Nr. % Nr. %  25–30 years 10 23.3% 47 26.6% 0.003  31–35 years  7  16.3%  59  33.3%  36–40 years 5 11.6% 31 17.5%  41–45 years 6 14% 20 11.3%  46–50 years  10  23.3%  7  4%  51–55 years 2 4.7% 5 2.8%  56–60 years 3 7% 7 4%  >60 years 0 0% 1 0.6% dentistry-13-00390-t006_Table 6 Table 6 A tabular representation of the distribution of practitioners according to their level of experience and the use of digital technology (* Fisher’s Exact Test). Experience/Utilization Absent Present p Nr. % Nr. %  0–3 years 10 23.3% 48 27.1% 0.006  4–10 years  8  18.6%  73  41.2%  11–15 years 9 20.9% 30 16.9%  16–20 years  10  23.3%  12  6.8%  21–25 years 2 4.7% 6 3.4%  26–30 years 4 9.3% 6 3.4%  31–35 years 0 0% 2 1.1% ",
  "metadata": {
    "Title of this paper": "Where Does Eureka Come From? The Effect of Unreportable Hints on the Phenomenology of Insight",
    "Journal it was published in:": "Dentistry Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468662/"
  }
}