{
  "title": "Paper_1121",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468367 PMC12468367.1 12468367 12468367 41020813 10.3390/cimb47090691 cimb-47-00691 1 Article Correlation Between In Silico Docking/Simulation Results and In Vitro MAGL Inhibition Potency of Selected Triterpenes https://orcid.org/0000-0003-3132-5935 Masocha Willias 1 * Khedr Mohammed A. 2 Zou Quan Academic Editor 1 2 mohammed_abdou0@yahoo.com * willias.masocha@ku.edu.kw 27 8 2025 9 2025 47 9 497442 691 23 7 2025 17 8 2025 19 8 2025 27 08 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Monoacylglycerol lipase (MAGL) degrades the endocannabinoid 2-arachidonyl glycerol. MAGL inhibitors, such as the triterpene pristimerin, alleviate neuropathic pain in animal models. In silico studies were carried out using SwissDock, PyRx-0.8 and CB-Dock2, to check if they correlated with the in vitro MAGL inhibition potency of various triterpenes. In terms of affinity, free energy of binding and docking scores to MAGL, pristimerin (52.75, −9.32, −10.83, and −11.5 kcal/mol) was better than euphol (44.86, −8.49, −9.56, and −10.7 kcal/mol), which in turn was better than β-amyrin (35.17, −7.37, −8.21, and −8.8 kcal/mol). Finally, β-amyrin was better than or equal to α-amyrin (35.10, −7.19, −7.95, and −8.6 kcal/mol). In molecular dynamic simulations (MDSs), pristimerin exhibited the highest stability and reached the steady state after 20 ns with the lowest root mean square fluctuation (RMSF) at the binding site, compared to the triterpenes. The reported half maximal inhibitory concentration (IC 50 50 MAGL inhibition endocannabinoids molecular docking molecular dynamic simulation triterpenes pristimerin in vitro screening correlation 2-arichdonyl glycerol This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Monoacylglycerol lipase (MAGL) is an enzyme that degrades 2-arachidonoylglycerol (2-AG), which is an endocannabinoid [ 1 2 3 4 5 4 6 7 7 8 9 The first characterized natural compounds that inhibited MAGL activity are the triterpenes, pristimerin and euphol [ 10 10 11 8 8 Triterpenes are bioactive secondary metabolites found in various herbal plants used in ethnomedicine such as Swertia mileensis, Euphorbia kansui, Alismatis rhizome, Panax ginseng 12 13 14 15 16 12 13 14 15 16 8 11 17 18 8 11 There is a possibility that other triterpenes found in plants used in ethnomedicine inhibit MAGL activity. To reduce the cost and time of evaluating triterpene activity in in vitro and in vivo experiments, it would be necessary to evaluate them in silico to enable selection of triterpenes with the best MAGL inhibitory activities. Molecular docking has been used to evaluate the interaction of triterpenes, as well as other molecules, with MAGL [ 10 19 20 21 22 23 24 In this study, the free energy of binding of triterpenes on MAGL was computed. The affinity (kcal/mol) was calculated using SwissDock server, and docking was carried out by using a publicly available docking server, CB-Dock2, from the Young Cao Lab, [ 23 50 10 11 2. Materials and Methods 2.1. Literature Search A search of articles in the U.S. National Library of Medicine, Washington, DC (MED-LINE-PubMed) was conducted for this study up to 21 June 2024. The following keywords were proposed and searched for in PubMed: “pristimerin”, “triterpene”, “euphol’, “monoacylglycerol lipase”, “inhibitor”, and “inhibition”. Six searches were carried out using different combinations of the keywords or phrases (“pristimerin” OR “euphol” OR “triterpene”) AND (“monoacylglycerol lipase”) AND (“inhibitor” OR “inhibition”). Only primary research articles that reported the evaluation of the inhibition of MAGL activity, and the IC 50 2.2. Molecular Docking and Molecular Dynamics Simulations The three-dimensional (3D) structures of the triterpenes α-amyrin (PubChem CID 73170), β-amyrin (PubChem CID 73145), euphol (PubChem CID 441678), and pristimerin (Pub-Chem CID 159516) were downloaded from PubChem database in .sdf 3D conformer format ( https://pubchem.ncbi.nlm.nih.gov/ https://www.rcsb.org/ Similar to our recent study [ 25 https://cadd.labshare.cn/cb-dock2/index.php 23 The studied compounds and the protein were prepared for docking. The free energy of binding was computed, and the affinity (kcal/mol) was calculated using SwissDock server [ 26 27 28 25 29 The affinity, free energy of binding, and docking scores by both PyRx-0.8 and CB-Dock2 (AutoDock vina scores) of the triterpenes were used for comparison of the triterpenes. Preliminary MDSs were conducted for the best docking pose for the four ligand–MAGL complexes to enable RMSF calculation. The best conformation from each docking process was kept inside the active site. All hydrogens were added, and energy minimization was computed. The solvent molecules that were in the system were deleted before solvation and salt atoms were added to ensure complete neutralization of the system. Solvent atoms were added to surround the system in a spherical shape. The protein–ligand complex was surrounded by a sphere shape of solvent (water) and NaCl was used as a salt to neutralize the charged system. Amber12: EHT was selected as an all-atom forcefield. All bonds, van der Waals, electrostatics, and restraints were enabled. Energy minimization was performed. Root mean square deviation gradient was 1.0. Start time was zero. The MDS protocol was carried out using NPA (Nose–Poincare–Andersen) as a method for solving the equation of motion. Temperature was 300 K and time scale was 50 ns. 2.3. Correlation of Affinity, Free Energy of Binding, and Docking Scores and IC 50 The GraphPad Prism software (version 10.3) was used to assess the association between the affinity, free energy of binding, and docking scores by both PyRx-0.8 and CB-Dock2 (AutoDock vina scores) of the triterpenes and their in vitro IC 50 10 11 2.4. In Silico Prediction of the Pharmacokinetic Parameters All prediction was carried out using pkCSM ( https://biosig.lab.uq.edu.au/pkcsm/ 3. Results 3.1. Articles That Reported the Evaluation of the Inhibition of MAGL Activity by Triterpenes, Including Euphol and/or Pristimerin The PubMed searches produced twenty-four articles, which were reduced to eight articles after the removal of duplicates. Five articles were excluded for several reasons, detailed in Table A1 Figure A1 Table 1 10 Table 1 11 8 10 8 8 10 3.2. Molecular Docking and Molecular Dynamic Simulations of Triterpenes on MAGL The results of the molecular docking of the four triterpenes, α-amyrin, β-amyrin, euphol, and pristimerin on MAGL using CB-Dock2 are shown in Table 2 Figure 1 According to the docking scores ( Table 3 Figure 2 Figure 2 Figure 2 Figure 2 The compounds studied were subjected to an MDS study over 50 ns. During this period, pristimerin showed the highest stability and reached the steady state after 20 ns with the lowest root mean square fluctuation (RMSF), especially at the binding site (docking site) ( Figure 3 Figure 4 3.3. Comparison of Affinity, Free Energy of Binding and Docking Scores by Both PyRx-0.8, and CB-Dock2 and IC 50 Free energy of binding had a significantly negative correlation with affinity and positive correlation with docking scores ( Figure 5 Figure 5 Figure 5 Molecular docking scores with CB-Dock2 and PyRx-0.8 showed that pristimerin had higher binding affinity (docking scores of −11.5 and −10.83 kcal/mol, respectively) than euphol (docking scores of −10.7 and −9.56 kcal/mol). The binding affinity of the two triterpenes significantly correlated with the IC 50 p 10 Figure 6 Figure 6 Pristimerin had higher binding affinity (Vina score of −11.5 kcal/mol) than β-amyrin (Vina score of −10.7 kcal/mol), and β-amyrin had higher binding affinity than α-amyrin. The binding affinity of the three triterpenes significantly correlated with the IC 50 p 11 Figure 6 3.4. Results of In Silico Prediction of Pharmacokinetic Parameters Pharmacokinetic predictions were carried out using pkCSM ( https://biosig.lab.uq.edu.au/pkcsm/ Table A2 According to the predicted absorption, distribution, metabolism, excretion, and toxicity (ADMET), all compounds showed almost similar absorption properties (water solubility, Caco2 permeability, intestinal absorption, skin permeability, P-glycoprotein substrate, P-glycoprotein I inhibition, and P-glycoprotein II inhibition properties. All compounds showed high predicted intestinal permeability, as they have Caco2 permeability values > 0.9. The compounds illustrated high skin permeability log Kp values. Regarding the distribution parameters, pristimerin was the only compound to show low steady state volume of distribution (VDss), which means low distribution in tissues rather than plasma. The other three compounds showed high VDss in tissues, which can be affected in the case of patients with renal failure. For the blood–brain barrier (BBB) permeability, alpha- and beta- amyrin, and euphol showed Log BB > 0.3, which means they have good distribution in the brain. Pristimerin had a poor BBB permeability, which means it is poorly distributed in the brain when compared to the other three compounds. All compounds have the same predicted metabolism profile. They all have low maximum tolerated dose (<0.0477 log mg/kg/day). Neither hepatotoxicity nor skin sensitization was detected in the in silico predictions. 4. Discussion MAGL is a target for managing neuropathic pain. A systematic search identified four triterpenes, α-amyrin, β-amyrin, euphol and pristimerin, that had IC 50 12 15 30 31 50 50 The endocannabinoid 2-AG is produced on demand and rapidly metabolized by the enzyme MAGL [ 4 5 6 7 32 33 7 8 34 7 8 34 35 8 10 11 King and colleagues evaluated the MAGL inhibitory activities of pristimerin and euphol using purified recombinant rat MAGL and non-purified HeLa cell MAGL. Pristimerin and euphol were more potent in inhibiting purified recombinant rat MAGL than non-purified HeLa cell MAGL [ 10 10 50 8 50 10 Chicca and colleagues evaluated the MAGL inhibitory activities of pristimerin, α-amyrin and β-amyrin using purified recombinant human MAGL. Pristimerin was more potent than β-amyrin, which was more potent than α-amyrin in inhibiting purified recombinant human MAGL [ 11 50 The molecular docking studies also show that the trieterpenes interacted with the active site of MAGL. All triterpenes interacted with Ser122 of the catalytic triad, while all others except pristimerin interacted with HIS269, but none interacted with ASP239 [ 36 37 37 38 37 39 One of the limitations of this study is that only a few data points were available (IC 50 5. Conclusions The findings of this study show that molecular docking, using the CB-Dock2 server and PyRx-0.8, correlate with the potency of triterpenes found in herbal plants used in ethnomedicine and their inhibition of MAGL activity in vitro. In terms of affinity and docking scores to MAGL, pristimerin was better than euphol, which was better than β-amyrin, which was better than or equal to α-amyrin, respectively. The IC 50 50 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, W.M. methodology, W.M. and M.A.K.; software, W.M. and M.A.K.; validation, W.M. and M.A.K.; formal analysis, W.M. and M.A.K.; investigation, W.M. and M.A.K.; resources, W.M. and M.A.K.; data curation, W.M. and M.A.K.; writing—original draft preparation, W.M.; writing—review and editing, W.M. and M.A.K.; project administration, W.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data will be made available on request. The docking files have been uploaded to Zenodo. https://doi.org/10.5281/zenodo.16890027 Conflicts of Interest The authors declare no conflicts of interest. Appendix A Figure A1 Flow diagram of the different phases of the systematic article selection. Appendix B cimb-47-00691-t0A1_Table A1 Table A1 Articles found in PubMed that were excluded from the analysis. Article Number Primary Reason for Exclusion Article Type Reference 1. Review article Review [ 25 2. Did not evaluate MAGL inhibition by either pristimerin or euphol Original research [ 40 3. Did not evaluate MAGL inhibition by either pristimerin or euphol Original research [ 41 4. Did not evaluate MAGL inhibition by either pristimerin or euphol Original research [ 42 5. Did not evaluate MAGL inhibition by either pristimerin or euphol Original research [ 43 Appendix C cimb-47-00691-t0A2_Table A2 Table A2 In silico prediction of the pharmacokinetic parameters.  Model Name α-Amyrin β-Amyrin Euphol Pristimerin  Absorption Water solubility (log mol/L) −6.804 −6.84 −7.53 −5.902 Caco2 permeability (log Papp in 10–6 cm/s) 1.288 1.287 1.218 1.077 Intestinal absorption (human) (% Absorbed) 97.574 97.246 93.056 100 Skin Permeability (log Kp) −2.898 −2.894 −2.933 −2.649 P-glycoprotein substrate (Yes/No) No No No No P-glycoprotein I inhibitor (Yes/No) Yes Yes Yes Yes P-glycoprotein II inhibitor (Yes/No) Yes Yes Yes Yes  Distribution VDss (human) (log L/kg) 0.443 0.446 0.692 −0.353 Fraction unbound (human) 0 0 0 0 BBB permeability (log BB) 0.735 0.728 0.702 −0.344 CNS permeability (log PS) −1.971 −1.971 −2.247 −1.102  Metabolism CYP2D6 substrate (Yes/No) No No No No CYP3A4 substrate (Yes/No) Yes Yes Yes Yes CYP1A2 inhibitor (Yes/No) No No No No CYP2C19 inhibitor (Yes/No) No No No No CYP2C9 inhibitor (Yes/No) No No No No CYP2D6 inhibitor (Yes/No) No No No No CYP3A4 inhibitor (Yes/No) No No No No  Execretion Total Clearance (log mL/min/kg) 0.119 −0.044 0.403 −0.034 Renal OCT2 substrate (Yes/No) No No No No  Toxicity Max. tolerated dose (human) (log mg/kg/day) 0.203 0.212 −0.35 0.324 Oral Rat Acute Toxicity (LD50) (mol/kg) 2.156 2.169 1.867 3.234 Oral Rat Chronic Toxicity (LOAEL) (log mg/kg_bw/day) 0.908 0.926 0.775 1.757 Hepatotoxicity (Yes/No) No No No No Skin Sensitisation (Yes/No) No No No No References 1. Dinh T.P. Carpenter D. Leslie F.M. Freund T.F. Katona I. Sensi S.L. Kathuria S. Piomelli D. Brain monoglyceride lipase participating in endocannabinoid inactivation Proc. Natl. Acad. Sci. USA 2002 99 10819 10824 10.1073/pnas.152334899 12136125 PMC125056 2. Saario S.M. Savinainen J.R. Laitinen J.T. Jarvinen T. Niemi R. Monoglyceride lipase-like enzymatic activity is responsible for hydrolysis of 2-arachidonoylglycerol in rat cerebellar membranes Biochem. Pharmacol. 2004 67 1381 1387 10.1016/j.bcp.2003.12.003 15013854 3. Zou S. Kumar U. Cannabinoid Receptors and the Endocannabinoid System: Signaling and Function in the Central Nervous System Int. J. Mol. Sci. 2018 19 833 10.3390/ijms19030833 29533978 PMC5877694 4. Chen C. Inhibiting degradation of 2-arachidonoylglycerol as a therapeutic strategy for neurodegenerative diseases Pharmacol. Ther. 2023 244 108394 10.1016/j.pharmthera.2023.108394 36966972 PMC10123871 5. Sugiura T. Kishimoto S. Oka S. Gokoh M. Biochemistry, pharmacology and physiology of 2-arachidonoylglycerol, an endogenous cannabinoid receptor ligand Prog. Lipid Res. 2006 45 405 446 10.1016/j.plipres.2006.03.003 16678907 6. Hashimotodani Y. Ohno-Shosaku T. Tanimura A. Kita Y. Sano Y. Shimizu T. Di Marzo V. Kano M. Acute inhibition of diacylglycerol lipase blocks endocannabinoid-mediated retrograde signalling: Evidence for on-demand biosynthesis of 2-arachidonoylglycerol J. Physiol. 2013 591 4765 4776 10.1113/jphysiol.2013.254474 23858009 PMC3800453 7. Thomas A. Okine B.N. Finn D.P. Masocha W. Peripheral deficiency and antiallodynic effects of 2-arachidonoyl glycerol in a mouse model of paclitaxel-induced neuropathic pain Biomed. Pharmacother. 2020 129 110456 10.1016/j.biopha.2020.110456 32603895 8. Al-Romaiyan A. Masocha W. Pristimerin, a triterpene that inhibits monoacylglycerol lipase activity, prevents the development of paclitaxel-induced allodynia in mice Front. Pharmacol. 2022 13 944502 10.3389/fphar.2022.944502 36016571 PMC9395968 9. Curry Z.A. Wilkerson J.L. Bagdas D. Kyte S.L. Patel N. Donvito G. Mustafa M.A. Poklis J.L. Niphakis M.J. Hsu K.L. Monoacylglycerol Lipase Inhibitors Reverse Paclitaxel-Induced Nociceptive Behavior and Proinflammatory Markers in a Mouse Model of Chemotherapy-Induced Neuropathy J. Pharmacol. Exp. Ther. 2018 366 169 183 10.1124/jpet.117.245704 29540562 PMC6038031 10. King A.R. Dotsey E.Y. Lodola A. Jung K.M. Ghomian A. Qiu Y. Fu J. Mor M. Piomelli D. Discovery of potent and reversible monoacylglycerol lipase inhibitors Chem. Biol. 2009 16 1045 1052 10.1016/j.chembiol.2009.09.012 19875078 PMC3034734 11. Chicca A. Marazzi J. Gertsch J. The antinociceptive triterpene beta-amyrin inhibits 2-arachidonoylglycerol (2-AG) hydrolysis without directly targeting cannabinoid receptors Br. J. Pharmacol. 2012 167 1596 1608 10.1111/j.1476-5381.2012.02059.x 22646533 PMC3525863 12. Shen J. Kai J. Tang Y. Zhang L. Su S. Duan J.A. The Chemical and Biological Properties of Euphorbia kansui Am. J. Chin. Med. 2016 44 253 273 10.1142/S0192415X16500154 27080940 13. Yuan X. Yan Q. Hu H. He X.-P. Wang L.-X. Liu Y.-C. Liu Y. Guo K. Li S.-H. Bioactive triterpenoids from the traditional Chinese medicine Swertia mileensis Phytochem. Lett. 2023 55 1 5 10.1016/j.phytol.2023.03.001 14. Zhang L. Xu Z.J. Feng Y.J. Wang D.Y. Chemical constituents of roots of Celastrus orbiculatus Zhong Yao Cai 2013 36 569 572 24134003 15. Zhang Q. Zhou Q.R. Lou J.W. Chen P.D. Yao W.F. Tao W.W. Tang Y.P. Dai G.C. Wang K. Zhang L. Chemical Constituents from Euphorbia kansui Molecules 2017 22 2176 10.3390/molecules22122176 29292735 PMC6150036 16. Zhuo Y. Li M. Jiang Q. Ke H. Liang Q. Zeng L.F. Fang J. Evolving Roles of Natural Terpenoids From Traditional Chinese Medicine in the Treatment of Osteoporosis Front. Endocrinol. 2022 13 901545 10.3389/fendo.2022.901545 PMC9150774 35651977 17. Dutra R.C. Simao da Silva K.A. Bento A.F. Marcon R. Paszcuk A.F. Meotti F.C. Pianowski L.F. Calixto J.B. Euphol, a tetracyclic triterpene produces antinociceptive effects in inflammatory and neuropathic pain: The involvement of cannabinoid system Neuropharmacology 2012 63 593 605 10.1016/j.neuropharm.2012.05.008 22613837 18. Maia J.L. Lima-Junior R.C. Melo C.M. David J.P. David J.M. Campos A.R. Santos F.A. Rao V.S. Oleanolic acid, a pentacyclic triterpene attenuates capsaicin-induced nociception in mice: Possible mechanisms Pharmacol. Res. 2006 54 282 286 10.1016/j.phrs.2006.06.003 16879974 19. Dato F.M. Neudorfl J.M. Gutschow M. Goldfuss B. Pietsch M. omega-Quinazolinonylalkyl aryl ureas as reversible inhibitors of monoacylglycerol lipase Bioorg. Chem. 2020 94 103352 10.1016/j.bioorg.2019.103352 31668797 20. Di Stefano M. Masoni S. Bononi G. Poli G. Galati S. Gado F. Manzi S. Vagaggini C. Brai A. Caligiuri I. Design, synthesis, ADME and biological evaluation of benzylpiperidine and benzylpiperazine derivatives as novel reversible monoacylglycerol lipase (MAGL) inhibitors Eur. J. Med. Chem. 2024 263 115916 10.1016/j.ejmech.2023.115916 37976705 21. Hernandez-Torres G. Cipriano M. Heden E. Bjorklund E. Canales A. Zian D. Feliu A. Mecha M. Guaza C. Fowler C.J. A reversible and selective inhibitor of monoacylglycerol lipase ameliorates multiple sclerosis Angew. Chem. Int. Ed. Engl. 2014 53 13765 13770 10.1002/anie.201407807 25298214 22. Kochnev Y. Ahmed M. Maldonado A.M. Durrant J.D. MolModa: Accessible and secure molecular docking in a web browser Nucleic Acids Res. 2024 52 W498 W506 10.1093/nar/gkae406 38783339 PMC11223821 23. Liu Y. Cao Y. Protein-Ligand Blind Docking Using CB-Dock2 Methods Mol. Biol. 2024 2714 113 125 10.1007/978-1-0716-3441-7_6 37676595 24. Singh N. Chaput L. Villoutreix B.O. Virtual screening web servers: Designing chemical probes and drug candidates in the cyberspace Brief. Bioinform. 2021 22 1790 1818 10.1093/bib/bbaa034 32187356 PMC7986591 25. Masocha W. Aly E. Albaloushi A. Al-Romaiyan A. Licofelone, a Dual COX/LOX Inhibitor, Ameliorates Paclitaxel-Induced Mechanical Allodynia in Rats in a Cannabinoid Receptor-Dependent Manner Biomedicines 2024 12 1545 10.3390/biomedicines12071545 39062118 PMC11274467 26. Bugnon M. Rohrig U.F. Goullieux M. Perez M.A.S. Daina A. Michielin O. Zoete V. SwissDock Nucleic Acids Res. 2024 52 W324 W332 10.1093/nar/gkae300 38686803 PMC11223881 27. Eberhardt J. Santos-Martins D. Tillack A.F. Forli S. AutoDock Vina 1.2.0: New Docking Methods, Expanded Force Field, and Python Bindings J. Chem. Inf. Model. 2021 61 3891 3898 10.1021/acs.jcim.1c00203 34278794 PMC10683950 28. Dallakyan S. Olson A.J. Small-molecule library screening by docking with PyRx Methods Mol. Biol. 2015 1263 243 250 10.1007/978-1-4939-2269-7_19 25618350 29. Soliman A.M. Ghorab M.M. Higgins M. Dinkova-Kostova A.T. Korany M. Amin M.A. Khedr M.A. Sakr T.M. NQO1 induction and radiation-based biodistribution study of a new quinoline derivative identified in a screen of 6,8-diiodoquinazolinone sulfonamide conjugates Eur. J. Med. Chem. 2025 296 117855 10.1016/j.ejmech.2025.117855 40554306 30. Chen R.Z. Yang F. Zhang M. Sun Z.G. Zhang N. Cellular and Molecular Mechanisms of Pristimerin in Cancer Therapy: Recent Advances Front. Oncol. 2021 11 671548 10.3389/fonc.2021.671548 34026649 PMC8138054 31. Sun J. Tian Z. Wu J. Li J. Wang Q. Huang S. Wang M. Pristimerin Exerts Pharmacological Effects Through Multiple Signaling Pathways: A Comprehensive Review Drug Des. Devel. Ther. 2024 18 1673 1694 10.2147/DDDT.S460093 PMC11110813 38779590 32. Mechoulam R. Ben-Shabat S. Hanus L. Ligumsky M. Kaminski N.E. Schatz A.R. Gopher A. Almog S. Martin B.R. Compton D.R. Identification of an endogenous 2-monoglyceride, present in canine gut, that binds to cannabinoid receptors Biochem. Pharmacol. 1995 50 83 90 10.1016/0006-2952(95)00109-D 7605349 33. Munawar N. Oriowo M.A. Masocha W. Antihyperalgesic Activities of Endocannabinoids in a Mouse Model of Antiretroviral-Induced Neuropathic Pain Front. Pharmacol. 2017 8 136 10.3389/fphar.2017.00136 28373843 PMC5357623 34. Guindon J. Lai Y. Takacs S.M. Bradshaw H.B. Hohmann A.G. Alterations in endocannabinoid tone following chemotherapy-induced peripheral neuropathy: Effects of endocannabinoid deactivation inhibitors targeting fatty-acid amide hydrolase and monoacylglycerol lipase in comparison to reference analgesics following cisplatin treatment Pharmacol. Res. 2013 67 94 109 10.1016/j.phrs.2012.10.013 23127915 PMC3525790 35. Scalvini L. Piomelli D. Mor M. Monoglyceride lipase: Structure and inhibitors Chem. Phys. Lipids 2016 197 13 24 10.1016/j.chemphyslip.2015.07.011 26216043 PMC4728057 36. Karlsson M. Contreras J.A. Hellman U. Tornqvist H. Holm C. cDNA cloning, tissue distribution, and identification of the catalytic triad of monoglyceride lipase. Evolutionary relationship to esterases, lysophospholipases, and haloperoxidases J. Biol. Chem. 1997 272 27218 27223 10.1074/jbc.272.43.27218 9341166 37. Liu C. Guan S. E J. Yang Z. Zhang X. Ju J. Wang S. Zhang H. Insight into the Inhibitory Mechanism of Aryl Formyl Piperidine Derivatives on Monoacylglycerol Lipase through Molecular Dynamics Simulations Molecules 2022 27 7512 10.3390/molecules27217512 36364337 PMC9655140 38. Afzal O. Kumar S. Kumar R. Firoz A. Jaggi M. Bawa S. Docking based virtual screening and molecular dynamics study to identify potential monoacylglycerol lipase inhibitors Bioorg. Med. Chem. Lett. 2014 24 3986 3996 10.1016/j.bmcl.2014.06.029 25011912 39. Jha V. Galati S. Volpi V. Ciccone L. Minutolo F. Rizzolio F. Granchi C. Poli G. Tuccinardi T. Discovery of a new ATP-citrate lyase (ACLY) inhibitor identified by a pharmacophore-based virtual screening study J. Biomol. Struct. Dyn. 2021 39 3996 4004 10.1080/07391102.2020.1773314 32448086 40. Parkkari T. Haavikko R. Laitinen T. Navia-Paldanius D. Rytilahti R. Vaara M. Lehtonen M. Alakurtti S. Yli-Kauhaluoma J. Nevalainen T. Discovery of triterpenoids as reversible inhibitors of alpha/beta-hydrolase domain containing 12 (ABHD12) PLoS ONE 2014 9 e98286 10.1371/journal.pone.0098286 24879289 PMC4045134 41. Benabdelaziz I. Gomez-Ruiz S. Benkhaled M. Carralero S. Schenker P. Salm A. Gertsch J. Haba H. New cycloartane-type ester triterpenes from Euphorbia pterococca and biological evaluation Fitoterapia 2018 127 271 278 10.1016/j.fitote.2018.02.027 29524564 42. Veloso C.C. Ferreira R.C.M. Rodrigues V.G. Duarte L.P. Klein A. Duarte I.D. Romero T.R.L. Perez A.C. Tingenone, a pentacyclic triterpene, induces peripheral antinociception due to cannabinoid receptors activation in mice Inflammopharmacology 2018 26 227 233 10.1007/s10787-017-0391-7 28889355 43. Merali Z. Cayer C. Kent P. Liu R. Cal V. Harris C.S. Arnason J.T. Sacred Maya incense, copal (Protium copal-Burseraceae), has antianxiety effects in animal models J. Ethnopharmacol. 2018 216 63 70 10.1016/j.jep.2018.01.027 29414121 Figure 1 Illustration of the molecular docking of triterpenes to MAGL (5ZUN). α-amyrin, β-amyrin, euphol, and pristimerin interact with the same MAGL cavities. The best potential cavity regions on MAGL were detected by a structure-based approach. The interactive visualization for the 3D structure of MAGL with ( A B C D https://doi.org/10.5281/zenodo.16890027 Figure 2 The best docking pose for ( A B C D Figure 3 Root mean square fluctuation (RMSF) of ( A B C D Figure 4 Collective root mean square fluctuation (RMSF) graph of the studied MAGL–ligand complexes. Figure 5 Relationships of α-amyrin, β-amyrin, euphol and pristimerin scores on interaction with MAGL for affinity, free energy of binding, and docking score by both PyRx-0.8 and CB-Dock2. Correlation of ( A B C D Figure 6 Correlation of CB-Dock2 and PyrX dock docking scores with IC 50 50 A B 10 C 50 11 50 D E 10 F 50 cimb-47-00691-t001_Table 1 Table 1 IC 50 Triterpene IC 50 Source/Type of MAGL Reference α-Amyrin 9300 ± 1200 nM Recombinant human MAGL [ 11 β-Amyrin 2800 ± 500 nM Recombinant human MAGL [ 11 Euphol 315 ± 1 nM Purified recombinant rat MAGL [ 10 882 ± 78 nM Non-purified (cell lysates of MAGL-transfected HeLa cells) [ 10 Pristimerin 93 ± 8 nM Purified recombinant rat MAGL [ 10 398 ± 68 nM Non-purified (cell lysates of MGL-transfected HeLa cells [ 10  204 ± 16.2 nM Recombinant human MAGL [ 11  130 nM Recombinant human MAGL [ 8  1600 nM Non-purified mouse brain [ 8  596 nM Non-purified Mouse paw skin [ 8 * IC 50 cimb-47-00691-t002_Table 2 Table 2 Comparison of the best CB-Dock2 molecular docking Vina scores (kcal/mol) of α-amyrin, β-amyrin, euphol, and pristimerin on MAGL (5ZUN). Cavity volume (1904, Å3), center (x, y, z; 10, 17, −6), and docking size (x, y, z; 23, 23, 23). Triterpene Vina Score (kcal/mol) Contact Residues α-Amyrin −8.6 GLY50 ALA51 MET88 SER122 MET123 LEU148 ALA151 ASN152 GLU154 SER155 ALA156 THR158 PHE159 SER176 GLY177 PRO178 ILE179 ASP180 VAL183 LEU184 LEU205 PHE209 GLY210 LEU213 LEU214 ARG240 LEU241 HIS269 β-Amyrin −8.8 GLY50 ALA51 GLY52 HIS121 SER122 MET123 LEU148 ALA151 ASN152 GLU154 SER155 ALA156 THR158 PHE159 SER176 GLY177 PRO178 ILE179 ASP180 SER181 VAL183 LEU184 LEU205 PHE209 GLY210 LEU213 LEU214 VAL217 ARG240 LEU241 CYS242 HIS269 Euphol −10.7 GLY50 ALA51 MET88 SER122 MET123 LEU148 LEU150 ALA151 ASN152 GLU154 SER155 ALA156 THR158 PHE159 LYS160 SER176 GLY177 PRO178 ILE179 ASP180 VAL183 LEU184 LEU205 PHE209 GLY210 LEU213 LEU214 VAL217 ARG240 LEU241 CYS242 HIS269 Pristimerin −11.5 GLY50 ALA51 MET88 SER122 MET123 LEU148 ALA151 SER155 ALA156 THR158 PHE159 SER176 GLY177 PRO178 ILE179 ASP180 VAL183 LEU184 LEU205 GLY210 LEU213 LEU214 VAL217 ARG240 LEU241 cimb-47-00691-t003_Table 3 Table 3 Affinity and docking scores obtained using SwissDock, PyRx-0.8 dock, and CB-Dock2. All three virtual screening software/servers utilize AutoDock Vina docking system. Scores α-Amyrin β-Amyrin Euphol Pristimerin PubChem CID 73,170 73,145 441,678 159,516 Free energy of binding (kcal/mol) −7.19 −7.37 −8.49 −9.32 Affinity (kcal/mol) 35.10 35.17 44.86 52.75 PyRx-0.8 dock (kcal/mol) −7.95 −8.21 −9.56 −10.83 CB-Dock2 (kcal/mol) −8.6 −8.8 −10.7 −11.5 ",
  "metadata": {
    "Title of this paper": "Sacred Maya incense, copal (Protium copal-Burseraceae), has antianxiety effects in animal models",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468367/"
  }
}