{
  "title": "Paper_1095",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468650 PMC12468650.1 12468650 12468650 41008852 10.3390/cancers17183008 cancers-17-03008 1 Review Sequencing Choices and Real-World Clinical Management in Advanced Grade 2/3 GEP-NET Treatment: The Emerging Role of PRRT Chauhan Aman 1 * https://orcid.org/0000-0001-8460-1257 Halfdanarson Thorvardur R. 2 https://orcid.org/0000-0001-6469-4759 Vijayvergia Namrata 3 Lopes Jose Manuel Academic Editor 1 2 3 namrata.vijayvergia@fccc.edu * axc3268@med.miami.edu 15 9 2025 9 2025 17 18 497140 3008 13 6 2025 29 8 2025 01 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary For higher-grade, advanced gastroenteropancreatic neuroendocrine tumors, there is not a clear standard treatment sequence, and many current approaches are based on lower-grade cases or small retrospective studies. The importance of using specific imaging tests to guide treatment decisions for these tumors is highlighted and the potential of peptide receptor radionuclide therapy, a targeted therapy, as a first-line option for certain patients is discussed. Other treatments like somatostatin analogs may help some patients with slower-growing tumors, while chemotherapy is often needed for those in need of urgent treatment. Overall, this review aims to provide updated recommendations for the sequence of treatments for these complex tumors. Abstract The prognosis of high-grade gastroenteropancreatic neuroendocrine tumors (GEP-NETs) is highly variable and reported median overall survival remains low. There is no established standard of care for patients with higher grade 2 (G2) (Ki-67 ≥ 10% and ≤ 20%) and grade 3 (G3) (Ki-67 ≥ 20% and ≤ 55%) GEP-NETs and most of the current treatment regimens, particularly for G3 NETs, are extrapolated from lower-grade GEP-NET treatments or based on data from small retrospective studies. Robust evidence to support treatment recommendations for high-grade NETs, especially in the first-line (1L) setting, is limited and the optimal treatment sequence has not been clearly defined. This review summarizes the latest literature on sequencing of therapies, identifies patient selection considerations for utilizing peptide receptor radionuclide therapy (PRRT), and offers data-driven expert opinions and clinical practice recommendations in high-grade GEP-NETs. As authors, we recommend that all patients with well-differentiated, higher G2 and G3 NETs are evaluated with [ 68 68 advanced GEP-NETs PRRT treatment sequencing This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. GEP-NETs Overview 1.1. GEP-NET Background Information and GEP-NET World Health Organization Classification Neuroendocrine neoplasms (NENs) arise from the neuroendocrine system and are classified by the status of their differentiation, with the two major categories of clinical and prognostic significance represented by neuroendocrine tumors (NETs; well differentiated) and neuroendocrine carcinomas (NEC; poorly differentiated) [ 1 2 3 1 1 4 5 Although regularly classified as a rare malignancy, the incidence and prevalence of GEP-NETs have been on the rise over the past few decades, likely driven by increases in clinician awareness, improved capabilities of diagnostic endoscopies, as well as the long survival of patients with localized and/or low-grade disease [ 1 6 7 8 9 10 11 12 2 1 13 1 14 15 12 Even though G3 NETs and NECs are often readily distinguished by morphology, the diagnosis may be challenging even for NET specialists, particularly with small biopsy samples [ 16 17 18 19 2 4 20 21 Figure 1 22 23 24 25 25 1.2. High-Grade GEP-NET Current Treatment Landscape Overview Given the relative infrequency of high-grade NENs, there are few prospectively collected data to guide practitioners as to optimal patient management, and best practices are therefore based largely upon expert opinion [ 17 17 For patients with localized G3 NET, the goals of surgery are oncologic resection of the primary tumor and regional lymph nodes [ 17 13 26 17 17 27 16 28 177 NCT01578239 177 29 30 NCT03972488 177 31 1.3. Outcomes from Current Treatments for Patients with G2/G3 GEP-NETs Surgical resection for locoregional control, and possible cure, is recommended for appropriate patients, yielding a median survival of 43–55 months in patients with G3 NET [ 17 32 33 34 35 36 37 38 An overview of key safety and efficacy data of current GEP-NET–targeted treatments is included in Table 1 39 p 40 41 42 NCT00428597 43 25 25 44 NCT03079440 45 177 31 34 cancers-17-03008-t001_Table 1 Table 1 Efficacy and safety data of common GEP-NET treatments. Trial Type Grade Therapy Line mPFS (Months) ORR (%, 95% CI) Safety Events SSAs CLARINET [ 40 GEP-NET G1/G2 Lanreotide 1L/2L NR NR Hyperglycemia, cholelithiasis PROMID [ 39 Midgut NET G1/G2 Octreotide LAR 1L 14.3 NR GI events, hematologic events, fatigue, fever, bile stones PRRT NETTER-1 [ 46 Midgut NET G1/G2 [ 177 2L NR 18 (10–25) Hematologic toxicity, nausea, vomiting NETTER-2 [ 31 GEP-NET G2/G3 [ 177 1L 22.8 43 (35–51) Hematologic toxicity, nausea, diarrhea, abdominal pain Rotterdam [ 47 GEP-NET G1–G3 [ 177 2L 40 46 (NR) Hematologic toxicities, nausea, vomiting, abdominal cramps COMPETE [ 48 GEP-NET G1/G2 [ 177 1L/2L 23.9 NR NR OCLURANDOM [ 49 pNET Advanced progressive [ 177 ≥ 2L 20.7 63 Hematologic toxicity, GI events, fatigue, hypertension, CKD, second cancers mTOR inhibitors RADIANT-3 [ 42 pNET G1/G2 Everolimus 2L 11 5 (confirmed responses) Stomatitis, rash, diarrhea, fatigue RADIANT-4 [ 50 GEP-NET G1–G3 Everolimus 2L 11 2 (confirmed responses) Stomatitis, diarrhea, infections, anemia, fatigue TKIs NCT00428597 43 pNET G1/G2 Sunitinib 2L 11.4 9.3 Diarrhea, nausea, vomiting, asthenia CABINET [ 27 NETs G1–G3 Cabozantinib 3L 8.4 (extrapancreatic) 5 (extrapancreatic) Hypertension, fatigue, diarrhea, thromboembolic events 1L = first line; 2L = second line; 3L = third line; CI = confidence interval; G = grade; CKD, chronic kidney disease; GEP-NET = gastroenteropancreatic neuroendocrine tumor; GI = gastrointestinal; LAR = long-acting release; mPFS = median progression-free survival; mTOR = mammalian target of rapamycin; NET = neuroendocrine tumor; NR = not reported; ORR = overall response rate; pNET = pancreatic neuroendocrine tumor; PRRT = peptide receptor radionuclide therapy; SSA = somatostatin analog; TKI = tyrosine kinase inhibitor. Outcomes for patients with well-differentiated high-grade NETs demonstrate that those with a poor prognosis may benefit from more aggressive therapies early in their treatment journey, sparing more tolerable therapies like SSAs for those patients with indolent disease and a presumably longer survival [ 51 37 51 2. Treatment Sequencing Strategies for G2/G3 GEP-NETs There is no established standard of care (SoC) for patients with higher G2 (Ki-67 ≥ 10% and ≤20%) and G3 (Ki-67 ≥ 20% and ≤55%) GEP-NETs and a paucity of high-quality evidence for treatment recommendations, especially in the 1L setting [ 31 37 38 2.1. Role of Imaging and Biomarkers in G2/G3 GEP-NET Treatment Planning For many institutions, it is now standard practice to determine whether there is a more aggressive component of the disease that should be treated with an alternate therapy [ 52 53 54 55 1 56 68 18 13 53 57 58 59 54 68 52 60 61 62 63 64 18 68 54 The relationship between FDG and SSTR uptake is complex and can be heterogeneous; certain tumors co-express both markers, whereas others may express neither [ 65 68 Figure 2 18 Figure 2 Additionally, metabolic response assessment using [ 18 65 18 66 177 18 18 67 18 177 65 2.2. Treatment Sequence Practices 2.2.1. Existing Guidelines Most existing guidelines, which are based on older data and thus may not reflect latest advancements in the field, provide limited direction on treatment sequencing for higher-grade GEP-NETs [ 53 68 69 70 69 53 52 71 Table 2 53 53 69 72 177 56 17 cancers-17-03008-t002_Table 2 Table 2 Major societies’ higher-grade GEP-NET treatment recommendations. Society Midgut NETs pNETs   G2  G3  G2  G3 American Society of Clinical Oncology (ASCO), 53 1L: Octreotide/lanreotide 1L: Octreotide/lanreotide (SSTR-positive, low 1L: Octreotide/lanreotide 1L: European 69 1L: SSA or everolimus PRRT may be considered 1L: SSA (Ki-67 < 10%) 1L: CAPTEM, North American 73 70 17 1L: SSA (octreotide/lanreotide) 177 1L: 1L: 1L: National 56 Preferred regimens: Cabozantinib, everolimus, [ 177 177 Preferred: Clinical trial 177 Preferred regimens: Cabozantinib, everolimus, sunitinib, SSAs 177 177 Preferred: Clinical trial 177 1L = first line; 2L = second line; 3L = third line; 5-FU = fluorouracil; CAPEOX = capecitabine and oxaliplatin; CAPTEM = capecitabine and temozolomide; FOLFIRI = folinic acid, fluorouracil, and irinotecan; FOLFOX = folinic acid, fluorouracil, and oxaliplatin; G = grade; NET = neuroendocrine tumor; pNET = pancreatic neuroendocrine tumor; PRRT = peptide receptor radionuclide therapy; SSA = somatostatin analog; SSTR = somatostatin receptor. 2.2.2. Factors That Influence Sequence of Treatment a. Clinical Evidence The level of clinical evidence on treatment modalities specifically for high-grade GEP-NETs is low. A 2023 systematic review examining the available data on the epidemiology, diagnosis, molecular changes, and treatment of G3 GEP-NETs found that most studies were retrospective and that the scientific evidence on those lacks significant quality [ 58 74 74 55 b. Patient Characteristics and Preferences Disease-related factors such as site of tumor origin, volume of disease, and patient-related characteristics including comorbidities, goal of treatment, and patient preferences should aid treatment sequencing strategies [ 55 74 53 55 55 75 2.2.3. Multidisciplinary Approach The importance of a multidisciplinary approach of high-grade GEP-NET management is increasingly being highlighted. Optimization of treatment strategies can be supported by incorporating perspectives from all relevant medical specialties (e.g., medical oncology, interventional radiology, surgery, and nuclear medicine) [ 52 36 76 2.2.4. Beyond Progression Treatment Beyond 1L therapy, treatment options depend on the tumor primary site [ 52 177 27 52 54 52 3. PRRT in Clinical Practice Although the NETTER-1 trial enrolled patients with midgut NETs only, [ 177 177 52 17 177 6 177 77 78 79 177 77 3.1. Patient Selection Criteria For a patient with GEP-NETs, SSTR uptake in all lesions is considered a requirement for PRRT eligibility [ 76 52 80 76 81 82 83 177 84 177 6 3.2. PRRT as 1L in G2/G3 GEP-NETs (10% ≤ Ki-67 ≤ 55%) 3.2.1. Rationale PRRT has been reserved for later lines of therapy, predominantly used in advanced NENs when all other therapies fail [ 85 52 16 86 3.2.2. Safety In NETTER-2, commonly reported adverse events included nausea, diarrhea, and hematologic toxicities (i.e., thrombocytopenia); however, no unexpected safety signals were observed compared with other trials evaluating PRRT in GEP-NETs [ 31 87 88 89 90 31 177 46 177 177 49 91 177 177 48 177 31 46 92 93 94 89 95 96 3.2.3. Efficacy In NETTER-2 a significant PFS benefit of [ 177 31 177 31 177 97 177 98 177 177 49 91 177 48 3.2.4. PRRT Retreatment Practices Off-label use of PRRT retreatment in progressive NETs is common global practice [ 99 55 76 99 100 101 102 100 102 177 NCT05773274 103 225 225 177 NCT05477576 104 4. Future Directions 4.1. Investigation of New Isotopes in PRRT The preferred β − 177 90 80 − 90 80 − 80 100 177 90 177 105 Other radionuclides besides Y-90 and Lu-177, such as the α emitters Ac-225, Tb-161 and Pb-212 are also being studied [ 80 106 52 212 212 225 − NCT03466216 NCT05636618 NCT06732505 107 108 109 4.2. Other Ongoing PRRT Studies Data from other PRRT trials will shed light on the earlier positioning of PRRT in the treatment algorithm [ 106 177 NCT04919226 177 NCT04525638 177 NCT05724108 177 4.2.1. COMPOSE ([ 177 The COMPOSE study is currently evaluating the early use (including 1L) of PRRT with [ 177 NCT04919226 4.2.2. NCT04525638 177 Clinical evidence on potential synergistic effects associated with combining treatments is scarce [ 6 6 177 NCT04525638 4.2.3. NCT05724108 177 Triapine is a ribonucleotide reductase inhibitor and promising preclinical data support its role as a radiosensitizer in pNET models [ 110 177 177 NCT05724108 111 4.2.4. [ 177 Peposertib is a selective inhibitor of DNA-dependent protein kinase that is involved in DNA repair mechanisms and has been used as a radiosensitizer in preclinical NET models. A phase 1 trial evaluating [ 177 112 4.2.5. PRRT + Chemotherapy Combination Some evidence indicates that concurrent or sequential administration of cytotoxic chemotherapy may increase the risk of MDS or acute leukemia [ 52 113 114 5. Conclusions 5.1. How Can the Data from Recent 1L Studies of PRRT Impact the Treatment Sequencing Guidelines? Until the recent NETTER-2 trial, data on PRRT for G3 NETs were scant and primarily retrospective, and while patients with G2 NETs were included in some of the previously published randomized controlled trials, there are relatively few data to be found with regard to the 10–20% Ki-67 subgroup [ 16 31 16 97 5.2. Clinical Practice Recommendations/Expert Opinions from the Authors After NETTER-2, there is robust randomized data that support PRRT as 1L therapy in NETs with more aggressive biology. The authors recommend that all patients with well-differentiated, higher G2 and G3 NETs are evaluated for baseline SSTR expression using [ 68 18 115 68 Figure 3 5.3. Further Research Needed for G2/G3 GEP-NET Management Studies should focus more on the identification of biomarkers that can predict response to PRRTs in patients with G2 and G3 GEP-NETs. This will not only aid personalized treatment planning but also allow for better monitoring of these patients thus improving their prognosis. There is also a need for more long-term follow-up studies after treatment, to assess the durability of response, PFS, and OS in patients with GEP-NETs. These long-term insights can be instrumental in refining treatment protocol and improving patient care. Research should also be directed toward developing new therapeutic agents specific to higher-grade tumors (G2/G3), that can either be used in combination with existing therapies or serve as standalone treatments for GEP-NETs. These novel agents could offer better therapeutic results and improved QoL in patients with high-grade NETs. Acknowledgments Medical writing support from Nucleus Global funded by Novartis Pharmaceuticals Corporation. Disclaimer/Publisher’s Note: Author Contributions A.C., T.R.H. and N.V. contributed to conceptualization, data curation, writing, review and editing of the manuscript. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest A.C.: Curium, Boehringer-Ingelheim, Crinetics, Exelixis, Novartis, Sanofi: advisory. T.R.H.: Boehringer-Ingelheim, Biomea Fusion, Curium, Exelixis: consulting fees; Camurus, Crinetics, Perspective Therapeutics, RayzeBio, Thermo Fisher Scientific: grants (to institution); ITM, Novartis: grants and consulting fees (to institution). N.V.: Guidepoint Global: honoraria; Exelixis, Pfizer, RayzeBio: advisory; Bristol-Myers Squibb/Medarex, ITM, Oryzon Genomics, Puma Biotechnology, Zymeworks: grants (to institution). References 1. Chauhan A. Chan K. Halfdanarson T.R. Bellizzi A.M. Rindi G. O’Toole D. Ge P.S. Jain D. Dasari A. Anaya D.A. Critical updates in neuroendocrine tumors: Version 9 American Joint Committee on Cancer staging system for gastroenteropancreatic neuroendocrine tumors CA Cancer J. Clin. 2024 74 359 367 10.3322/caac.21840 38685134 PMC11938941 2. McMurry H.S. Rivero J.D. Chen E.Y. Kardosh A. Lopez C.D. Pegna G.J. Gastroenteropancreatic neuroendocrine tumors: Epigenetic landscape and clinical implications Curr. Probl. Cancer 2024 52 101131 10.1016/j.currproblcancer.2024.101131 39173542 3. Oronsky B. Ma P.C. Morgensztern D. Carter C.A. Nothing but NET: A review of neuroendocrine tumors and carcinomas Neoplasia 2017 19 991 1002 10.1016/j.neo.2017.09.002 29091800 PMC5678742 4. Sonbol M.B. Mazza G.L. Mi L. Oliver T. Starr J. Gudmundsdottir H. Cleary S.P. Hobday T. Halfdanarson T.R. Survival and incidence patterns of pancreatic neuroendocrine tumors over the last 2 decades: A SEER database analysis Oncologist 2022 27 573 578 10.1093/oncolo/oyac049 35348774 PMC9255979 5. Stang A. Wellmann I. Holleczek B. Kim-Wanner S.Z. Müller-Nordhorn J. Sirri E. Wittenberg I. Siveke J.T. Kajüter H. Incidence and survival of patients with malignant pancreatic neuroendocrine neoplasms in Germany, 2009–2021 Cancer Epidemiol. 2024 93 102659 10.1016/j.canep.2024.102659 39243580 6. Hoogenkamp D.S. de Wit-van der Veen L.J. Huizing D.M.V. Tesselaar M.E.T. van Leeuwaarde R.S. Stokkel M.P.M. Lam M. Braat A. Advances in radionuclide therapies for patients with neuro-endocrine tumors Curr. Oncol. Rep. 2024 26 551 561 10.1007/s11912-024-01521-w 38598035 PMC11062977 7. Dasari A. Shen C. Halperin D. Zhao B. Zhou S. Xu Y. Shih T. Yao J.C. Trends in the incidence, prevalence, and survival outcomes in patients with neuroendocrine tumors in the United States JAMA Oncol. 2017 3 1335 1342 10.1001/jamaoncol.2017.0589 28448665 PMC5824320 8. White B.E. Rous B. Chandrakumaran K. Wong K. Bouvier C. Van Hemelrijck M. George G. Russell B. Srirajaskanthan R. Ramage J.K. Incidence and survival of neuroendocrine neoplasia in England 1995–2018: A retrospective, population-based study Lancet Reg. Health Eur. 2022 23 100510 10.1016/j.lanepe.2022.100510 36176500 PMC9513765 9. Thiis-Evensen E. Boyar Cetinkaya R. Incidence and prevalence of neuroendocrine neoplasms in Norway 1993–2021 J. Neuroendocrinol. 2023 35 e13264 10.1111/jne.13264 36988112 10. Pathak S. Starr J.S. Halfdanarson T. Sonbol M.B. Understanding the increasing incidence of neuroendocrine tumors Expert. Rev. Endocrinol. Metab. 2023 18 377 385 10.1080/17446651.2023.2237593 37466336 11. Dasari A. Wallace K. Halperin D.M. Maxwell J. Kunz P. Singh S. Chasen B. Yao J.C. Epidemiology of Neuroendocrine Neoplasms in the US JAMA Netw. Open 2025 8 e2515798 10.1001/jamanetworkopen.2025.15798 40553474 PMC12188367 12. Rindi G. Mete O. Uccella S. Basturk O. La Rosa S. Brosens L.A.A. Ezzat S. de Herder W.W. Klimstra D.S. Papotti M. Overview of the 2022 WHO classification of neuroendocrine neoplasms Endocr. Pathol. 2022 33 115 154 10.1007/s12022-022-09708-2 35294740 13. Sultana Q. Kar J. Verma A. Sanghvi S. Kaka N. Patel N. Sethi Y. Chopra H. Kamal M.A. Greig N.H. A comprehensive review on neuroendocrine neoplasms: Presentation, pathophysiology and management J. Clin. Med. 2023 12 5138 10.3390/jcm12155138 37568540 PMC10420169 14. Garcia-Carbonero R. Anton-Pascual B. Modrego A. Del Carmen Riesco-Martinez M. Lens-Pardo A. Carretero-Puche C. Rubio-Cuesta B. Soldevilla B. Advances in the treatment of gastroenteropancreatic neuroendocrine carcinomas: Are we moving forward? Endocr. Rev. 2023 44 724 736 10.1210/endrev/bnad006 36879384 PMC10335166 15. Sorbye H. Grande E. Pavel M. Tesselaar M. Fazio N. Reed N.S. Knigge U. Christ E. Ambrosini V. Couvelard A. European Neuroendocrine Tumor Society (ENETS) 2023 guidance paper for digestive neuroendocrine carcinoma J. Neuroendocrinol. 2023 35 e13249 10.1111/jne.13249 36924180 16. Sorbye H. Kong G. Grozinsky-Glasberg S. Strosberg J. PRRT in high-grade digestive neuroendocrine neoplasms (NET G3 and NEC) J. Neuroendocrinol. 2024 37 e13443 10.1111/jne.13443 39243213 PMC11919471 17. Eads J.R. Halfdanarson T.R. Asmis T. Bellizzi A.M. Bergsland E.K. Dasari A. El-Haddad G. Frumovitz M. Meyer J. Mittra E. Expert consensus practice recommendations of the North American Neuroendocrine Tumor Society for the management of high grade gastroenteropancreatic and gynecologic neuroendocrine neoplasms Endocr. Relat. Cancer 2023 30 e220206 10.1530/ERC-22-0206 37184955 PMC10388681 18. Sigel C.S. Krauss Silva V.W. Reid M.D. Chhieng D. Basturk O. Sigel K.M. Daniel T.D. Klimstra D.S. Tang L.H. Assessment of cytologic differentiation in high-grade pancreatic neuroendocrine neoplasms: A multi-institutional study Cancer Cytopathol. 2018 126 44 53 10.1002/cncy.21934 29044913 PMC5766365 19. Tang L.H. Basturk O. Sue J.J. Klimstra D.S. A Practical Approach to the Classification of WHO Grade 3 (G3) Well-differentiated Neuroendocrine Tumor (WD-NET) and Poorly Differentiated Neuroendocrine Carcinoma (PD-NEC) of the Pancreas Am. J. Surg. Pathol. 2016 40 1192 1202 10.1097/PAS.0000000000000662 27259015 PMC4988129 20. Xu Z. Wang L. Dai S. Chen M. Li F. Sun J. Luo F. Epidemiologic trends of and factors associated with overall survival for patients with gastroenteropancreatic neuroendocrine tumors in the United States JAMA Netw. Open 2021 4 e2124750 10.1001/jamanetworkopen.2021.24750 34554237 PMC8461504 21. Laffi A. Spada F. Bagnardi V. Frassoni S. Pisa E. Rubino M. Barberis M. Fazio N. Gastroenteropancreatic grade 3 neuroendocrine tumors: A single entity or a heterogeneous group? A retrospective analysis J. Endocrinol. Investig. 2022 45 317 325 10.1007/s40618-021-01642-0 34282554 22. Tang L.H. Untch B.R. Reidy D.L. O’Reilly E. Dhall D. Jih L. Basturk O. Allen P.J. Klimstra D.S. Well-differentiated neuroendocrine tumors with a morphologically apparent high-grade component: A pathway distinct from poorly differentiated neuroendocrine carcinomas Clin. Cancer Res. 2016 22 1011 1017 10.1158/1078-0432.CCR-15-0548 26482044 PMC4988130 23. Melhorn P. Raderer M. Mazal P. Kozakowski N. Kiesewetter B. NEC versus NET G3—Is there a grey zone? Case report of pancreatic NET G3 with rapid disease progression memo Mag. Eur. Med. Oncol. 2024 17 310 314 10.1007/s12254-024-00976-8 24. Pellat A. Cottereau A.S. Palmieri L.J. Soyer P. Marchese U. Brezault C. Coriat R. Digestive well-differentiated grade 3 neuroendocrine tumors: Current management and future directions Cancers 2021 13 2448 10.3390/cancers13102448 34070035 PMC8158108 25. Zhang X.B. Fan Y.B. Jing R. Getu M.A. Chen W.Y. Zhang W. Dong H.X. Dakal T.C. Hayat A. Cai H.J. Gastroenteropancreatic neuroendocrine neoplasms: Current development, challenges, and clinical perspectives Mil. Med. Res. 2024 11 35 10.1186/s40779-024-00535-6 38835066 PMC11149301 26. Kulke M.H. Benson A.B. Dasari A. Huynh L. Cai B. Totev T. Roesner N. Duh M.S. Neary M.P. Maurer V.E. Real-world treatment patterns and clinical outcomes in advanced gastrointestinal neuroendocrine tumors (GI NET): A multicenter retrospective chart review study Oncologist 2019 24 1056 1065 10.1634/theoncologist.2018-0519 30606883 PMC6693731 27. Chan J.A. Geyer S. Zemla T. Knopp M.V. Behr S. Pulsipher S. Ou F.S. Dueck A.C. Acoba J. Shergill A. Phase 3 Trial of Cabozantinib to Treat Advanced Neuroendocrine Tumors N. Engl. J. Med. 2025 392 653 665 10.1056/NEJMoa2403991 39282913 PMC11821447 28. Fjällskog M.L. Ludvigsen E. Stridsberg M. Oberg K. Eriksson B. Janson E.T. Expression of somatostatin receptor subtypes 1 to 5 in tumor tissue and intratumoral vessels in malignant endocrine pancreatic tumors Med. Oncol. 2003 20 59 67 10.1385/MO:20:1:59 12665686 29. US Food and Drug Administration FDA Approves Lutetium Lu 177 Dotatate for Treatment of GEP-NETS Available online: https://www.fda.gov/drugs/resources-information-approved-drugs/fda-approves-lutetium-lu-177-dotatate-treatment-gep-nets (accessed on 9 April 2025) 30. European Medicines Agency Authorization Details for Lutathera® in Europe Available online: https://www.ema.europa.eu/en/medicines/human/EPAR/lutathera#product-info (accessed on 9 April 2025) 31. Singh S. Halperin D. Myrehaug S. Herrmann K. Pavel M. Kunz P.L. Chasen B. Tafuto S. Lastoria S. Capdevila J. [ 177 Lancet 2024 403 2807 2817 10.1016/s0140-6736(24)00701-3 38851203 32. Ammann M. Gudmundsdottir H. Antwi S.K.A. Santol J. Podrascanin V. Thiels C.A. Warner S.G. Truty M.J. Kendrick M.L. Smoot R.L. Long-term outcome of cytoreductive hepatectomy in metastatic neuroendocrine neoplasia G3: A single center retrospective analysis Eur. J. Surg. Oncol. 2025 51 109678 10.1016/j.ejso.2025.109678 40215606 33. Apostolidis L. Dal Buono A. Merola E. Jann H. Jäger D. Wiedenmann B. Winkler E.C. Pavel M. Multicenter analysis of treatment outcomes for systemic therapy in well differentiated grade 3 neuroendocrine tumors (NET G3) Cancers 2021 13 1936 10.3390/cancers13081936 33923759 PMC8073753 34. Chan D.L. Bergsland E.K. Chan J.A. Gadgil R. Halfdanarson T.R. Hornbacker K. Kelly V. Kunz P.L. McGarrah P.W. Raj N.P. Temozolomide in grade 3 gastroenteropancreatic neuroendocrine neoplasms: A multicenter retrospective review Oncologist 2021 26 950 955 10.1002/onco.13923 34342086 PMC8571741 35. de Mestier L. Lamarca A. Hernando J. Zandee W. Alonso-Gordoa T. Perrier M. Walenkamp A.M. Chakrabarty B. Landolfi S. Van Velthuysen M.F. Treatment outcomes of advanced digestive well-differentiated grade 3 NETs Endocr. Relat. Cancer 2021 28 549 561 10.1530/ERC-21-0109 34061764 36. Lithgow K. Venkataraman H. Hughes S. Shah H. Kemp-Blake J. Vickrage S. Smith S. Humphries S. Elshafie M. Taniere P. Well-differentiated gastroenteropancreatic G3 NET: Findings from a large single centre cohort Sci. Rep. 2021 11 17947 10.1038/s41598-021-97247-x 34504148 PMC8429701 37. Liu A.J. Ueberroth B.E. McGarrah P.W. Buckner Petty S.A. Kendi A.T. Starr J. Hobday T.J. Halfdanarson T.R. Sonbol M.B. Treatment outcomes of well-differentiated high-grade neuroendocrine tumors Oncologist 2021 26 383 388 10.1002/onco.13686 33496040 PMC8100548 38. Boutin M. Mathews A. Badesha J. Paul A. Safro M. Gill S. Stuart H.C. Schaeffer D. Farnell D. Loree J.M. Well-differentiated grade 3 neuroendocrine tumors: Characteristics, treatments, and outcomes from a population-based study Pancreas 2022 51 756 762 10.1097/MPA.0000000000002100 36395400 PMC9722384 39. Rinke A. Müller H.H. Schade-Brittinger C. Klose K.J. Barth P. Wied M. Mayer C. Aminossadati B. Pape U.F. Bläker M. Placebo-controlled, double-blind, prospective, randomized study on the effect of octreotide LAR in the control of tumor growth in patients with metastatic neuroendocrine midgut tumors: A report from the PROMID Study Group J. Clin. Oncol. 2009 27 4656 4663 10.1200/JCO.2009.22.8510 19704057 40. Caplin M.E. Pavel M. Ćwikła J.B. Phan A.T. Raderer M. Sedláčková E. Cadiot G. Wolin E.M. Capdevila J. Wall L. Lanreotide in metastatic enteropancreatic neuroendocrine tumors N. Engl. J. Med. 2014 371 224 233 10.1056/NEJMoa1316158 25014687 41. Merola E. Alonso Gordoa T. Zhang P. Al-Toubah T. Pellè E. Kolasińska-Ćwikła A. Zandee W. Laskaratos F. de Mestier L. Lamarca A. Somatostatin analogs for pancreatic neuroendocrine tumors: Any benefit when Ki-67 is ≥10%? Oncologist 2021 26 294 301 10.1002/onco.13633 33301235 PMC8018333 42. Yao J.C. Shah M.H. Ito T. Bohas C.L. Wolin E.M. Van Cutsem E. Hobday T.J. Okusaka T. Capdevila J. de Vries E.G. Everolimus for advanced pancreatic neuroendocrine tumors N. Engl. J. Med. 2011 364 514 523 10.1056/NEJMoa1009290 21306238 PMC4208619 43. Raymond E. Dahan L. Raoul J.L. Bang Y.J. Borbath I. Lombard-Bohas C. Valle J. Metrakos P. Smith D. Vinik A. Sunitinib malate for the treatment of pancreatic neuroendocrine tumors N. Engl. J. Med. 2011 364 501 513 10.1056/NEJMoa1003825 21306237 44. Kunz P.L. Graham N.T. Catalano P.J. Nimeiri H.S. Fisher G.A. Longacre T.A. Suarez C.J. Martin B.A. Yao J.C. Kulke M.H. Randomized study of temozolomide or temozolomide and capecitabine in patients with advanced pancreatic neuroendocrine tumors (ECOG-ACRIN E2211) J. Clin. Oncol. 2023 41 1359 1369 10.1200/JCO.22.01013 36260828 PMC9995105 45. Jeong H. Shin J. Jeong J.H. Kim K.P. Hong S.M. Kim Y.I. Ryu J.S. Ryoo B.Y. Yoo C. Capecitabine plus temozolomide in patients with grade 3 unresectable or metastatic gastroenteropancreatic neuroendocrine neoplasms with Ki-67 index <55%: Single-arm phase II study ESMO Open 2021 6 100119 10.1016/j.esmoop.2021.100119 33901869 PMC8099746 46. Strosberg J. El-Haddad G. Wolin E. Hendifar A. Yao J. Chasen B. Mittra E. Kunz P.L. Kulke M.H. Jacene H. Phase 3 trial of 177 N. Engl. J. Med. 2017 376 125 135 10.1056/NEJMoa1607427 28076709 PMC5895095 47. Kwekkeboom D.J. de Herder W.W. Kam B.L. van Eijck C.H. van Essen M. Kooij P.P. Feelders R.A. van Aken M.O. Krenning E.P. Treatment with the radiolabeled somatostatin analog [ 177 0 3 J. Clin. Oncol. 2008 26 2124 2130 10.1200/JCO.2007.15.2553 18445841 48. Capdevila J.A.H. Ansquer C. Deshayes E. Garcia-Carbonero R. TeuléVega A. Wilmink J. Cwikla J.B. Srirajaskanthan R. Buck A. Grana C.M. Efficacy and safety of [ 177 Proceedings of the European Neuroendocrine Tumor Society (ENETS) Krakow, Poland 5–7 March 2025 49. Baudin E.W.T. Beron A. Smith D. Deandreis D. Taieb D. Ansquer C. Diericks L. de Mestier L. Assenat E. Hadoux J. Secondary endpoint results of the first academic multicentric randomized phase II trial investigating the antitumor efficacy of 177 Proceedings of the European Neuroendocrine Tumor Society (ENETS) Krakow, Poland 5–7 March 2025 50. Yao J.C. Fazio N. Singh S. Buzzoni R. Carnaghi C. Wolin E. Tomasek J. Raderer M. Lahner H. Voi M. Everolimus for the treatment of advanced, non-functional neuroendocrine tumours of the lung or gastrointestinal tract (RADIANT-4): A randomised, placebo-controlled, phase 3 study Lancet 2016 387 968 977 10.1016/S0140-6736(15)00817-X 26703889 PMC6063317 51. Pusceddu S. Barretta F. Trama A. Botta L. Milione M. Buzzoni R. De Braud F. Mazzaferro V. Pastorino U. Seregni E. A classification prognostic score to predict OS in stage IV well-differentiated neuroendocrine tumors Endocr. Relat. Cancer 2018 25 607 618 10.1530/ERC-17-0489 29559553 PMC5920017 52. Strosberg J.R. Al-Toubah T. El-Haddad G. Reidy Lagunes D. Bodei L. Sequencing of somatostatin-receptor-based therapies in neuroendocrine tumor patients J. Nucl. Med. 2024 65 340 348 10.2967/jnumed.123.265706 38238038 53. Del Rivero J. Perez K. Kennedy E.B. Mittra E.S. Vijayvergia N. Arshad J. Basu S. Chauhan A. Dasari A.N. Bellizzi A.M. Systemic therapy for tumor control in metastatic well-differentiated gastroenteropancreatic neuroendocrine tumors: ASCO guideline J. Clin. Oncol. 2023 41 5049 5067 10.1200/JCO.23.01529 37774329 54. Kong G. Boehm E. Prall O. Murray W.K. Tothill R.W. Michael M. Integrating functional imaging and molecular profiling for optimal treatment selection in neuroendocrine neoplasms (NEN) Curr. Oncol. Rep. 2023 25 465 478 10.1007/s11912-023-01381-w 36826704 PMC10110720 55. Bartolomei M. Berruti A. Falconi M. Fazio N. Ferone D. Lastoria S. Pappagallo G. Seregni E. Versari A. Clinical management of neuroendocrine neoplasms in clinical practice: A formal consensus exercise Cancers 2022 14 2501 10.3390/cancers14102501 35626105 PMC9140035 56. NCCN Guidelines® Neuroendocrine and Adrenal Tumors Version 2.2025 NCCN Plymouth Meeting, PA, USA 28 May 2025 57. Albertelli M. Dotto A. Di Dato C. Malandrino P. Modica R. Versari A. Colao A. Ferone D. Faggiano A. PRRT: Identikit of the perfect patient Rev. Endocr. Metab. Disord. 2021 22 563 579 10.1007/s11154-020-09581-6 32978685 PMC8346456 58. Donadio M.D. Brito Â.B. Riechelmann R.P. A systematic review of therapeutic strategies in gastroenteropancreatic grade 3 neuroendocrine tumors Ther. Adv. Med. Oncol. 2023 15 17588359231156218 10.1177/17588359231156218 36950274 PMC10026121 59. Han S. Lee H.S. Woo S. Kim T.H. Yoo C. Ryoo B.Y. Ryu J.S. Prognostic value of 18 Clin. Nucl. Med. 2021 46 723 731 10.1097/RLU.0000000000003682 34028406 60. Chan D.L. Hayes A.R. Karfis I. Conner A. Furtado O’Mahony L. Mileva M. Bernard E. Roach P. Marin G. Pavlakis N. Dual [ 68 18 Br. J. Cancer 2023 128 549 555 10.1038/s41416-022-02061-5 36434154 PMC9938218 61. Chan D.L. Hayes A.R. Karfis I. Conner A. Mileva M. Bernard E. Schembri G. Navalkissoor S. Gnanasegaran G. Pavlakis N. [ 18 J. Nucl. Med. 2024 65 185 191 10.2967/jnumed.123.266346 38164579 PMC10858377 62. Hayes A.R. Furtado O’Mahony L. Quigley A.M. Gnanasegaran G. Caplin M.E. Navalkissoor S. Toumpanakis C. The combined interpretation of 68 18 Clin. Nucl. Med. 2022 47 26 35 10.1097/RLU.0000000000003937 34874347 63. Metser U. Nunez J.E. Chan D. Kulanthaivelu R. Murad V. Santiago A.T. Singh S. Dual somatostatin receptor/ 18 J. Nucl. Med. 2024 65 1591 1596 10.2967/jnumed.124.267982 39266292 64. Paiella S. Landoni L. Tebaldi S. Zuffante M. Salgarello M. Cingarlini S. D’Onofrio M. Parisi A. Deiro G. Manfrin E. Dual-tracer ( 68 18 Neuroendocrinology 2022 112 143 152 10.1159/000514809 33508821 65. Pattison D.A. Hofman M.S. Role of Fluorodeoxyglucose PET/Computed Tomography in Targeted Radionuclide Therapy for Endocrine Malignancies PET Clin. 2015 10 461 476 10.1016/j.cpet.2015.05.005 26384593 66. Ambrosini V. Caplin M. Castaño J.P. Christ E. Denecke T. Deroose C.M. Dromain C. Falconi M. Grozinsky-Glasberg S. Hicks R.J. Use and perceived utility of [ 18 J. Neuroendocrinol. 2024 36 e13359 10.1111/jne.13359 38097193 67. Severi S. Nanni O. Bodei L. Sansovini M. Ianniello A. Nicoletti S. Scarpi E. Matteucci F. Gilardi L. Paganelli G. Role of 18 177 Eur. J. Nucl. Med. Mol. Imaging 2013 40 881 888 10.1007/s00259-013-2369-z 23443937 68. Panzuto F. Ramage J. Pritchard D.M. van Velthuysen M.F. Schrader J. Begum N. Sundin A. Falconi M. O’Toole D. European Neuroendocrine Tumor Society (ENETS) 2023 guidance paper for gastroduodenal neuroendocrine tumours (NETs) G1–G3 J. Neuroendocrinol. 2023 35 e13306 10.1111/jne.13306 37401795 69. Pavel M. Öberg K. Falconi M. Krenning E.P. Sundin A. Perren A. Berruti A. Gastroenteropancreatic neuroendocrine neoplasms: ESMO Clinical Practice Guidelines for diagnosis, treatment and follow-up Ann. Oncol. 2020 31 844 860 10.1016/j.annonc.2020.03.304 32272208 70. Halfdanarson T.R. Strosberg J.R. Tang L. Bellizzi A.M. Bergsland E.K. O’Dorisio T.M. Halperin D.M. Fishbein L. Eads J. Hope T.A. The North American Neuroendocrine Tumor Society consensus guidelines for surveillance and medical management of pancreatic neuroendocrine tumors Pancreas 2020 49 863 881 10.1097/MPA.0000000000001597 32675783 71. Hope T.A. Pavel M. Bergsland E.K. Neuroendocrine tumors and peptide receptor radionuclide therapy: When is the right time? J. Clin. Oncol. 2022 40 2818 2829 10.1200/JCO.22.00176 35649195 PMC9390818 72. Aalbersberg E.A. Huizing D.M.V. Walraven I. de Wit-van der Veen B.J. Kulkarni H.R. Singh A. Stokkel M.P.M. Baum R.P. Parameters to predict progression-free and overall survival after peptide receptor radionuclide therapy: A multivariate analysis in 782 patients J. Nucl. Med. 2019 60 1259 1265 10.2967/jnumed.118.224386 30850483 73. Strosberg J.R. Halfdanarson T.R. Bellizzi A.M. Chan J.A. Dillon J.S. Heaney A.P. Kunz P.L. O’Dorisio T.M. Salem R. Segelov E. The North American Neuroendocrine Tumor Society consensus guidelines for surveillance and medical management of midgut neuroendocrine tumors Pancreas 2017 46 707 714 10.1097/MPA.0000000000000850 28609356 PMC5642985 74. Chauhan A. Del Rivero J. Ramirez R.A. Soares H.P. Li D. Treatment sequencing strategies in advanced neuroendocrine tumors: A review Cancers 2022 14 5248 10.3390/cancers14215248 36358667 PMC9656186 75. Naraev B.G. Mailman J. Halfdanarson T.R. Soares H.P. Mittra E.S. Hallet J. Consideration of quality of life in the treatment decision-making for patients with advanced gastroenteropancreatic neuroendocrine tumors Expert. Rev. Anticancer Ther. 2023 23 601 615 10.1080/14737140.2023.2207829 37158050 76. Becx M.N. Minczeles N.S. Brabander T. de Herder W.W. Nonnekens J. Hofland J. A clinical guide to peptide receptor radionuclide therapy with 177 Cancers 2022 14 5792 10.3390/cancers14235792 36497273 PMC9737149 77. Strosberg J. Wolin E. Chasen B. Kulke M. Bushnell D. Caplin M. Baum R.P. Kunz P. Hobday T. Hendifar A. Health-related quality of life in patients with progressive midgut neuroendocrine tumors treated with 177 J. Clin. Oncol. 2018 36 2578 2584 10.1200/JCO.2018.78.5865 29878866 PMC6366953 78. Edfeldt K. Hellman P. Granberg D. Lagergren P. Thiis-Evensen E. Sundin A. Andersson C. Improved health-related quality of life during peptide receptor radionuclide therapy in patients with neuroendocrine tumours J. Neuroendocrinol. 2023 35 e13342 10.1111/jne.13342 37807573 79. Martini C. Buxbaum S. Rodrigues M. Nilica B. Scarpa L. Holzner B. Virgolini I. Gamper E.M. Quality of life in patients with metastatic gastroenteropancreatic neuroendocrine tumors receiving peptide receptor radionuclide therapy: Information from a monitoring program in clinical routine J. Nucl. Med. 2018 59 1566 1573 10.2967/jnumed.117.204834 30042164 80. Burkett B.J. Dundar A. Young J.R. Packard A.T. Johnson G.B. Halfdanarson T.R. Eiring R.A. Gansen D.N. Patton C.M. Kendi A.T. How we do it: A multidisciplinary approach to 177 Radiology 2021 298 261 274 10.1148/radiol.2020201745 33231532 81. Merola E. Michielan A. Rozzanigo U. Erini M. Sferrazza S. Marcucci S. Sartori C. Trentin C. de Pretis G. Chierichetti F. Therapeutic strategies for gastroenteropancreatic neuroendocrine neoplasms: State-of-the-art and future perspectives World J. Gastrointest. Surg. 2022 14 78 106 10.4240/wjgs.v14.i2.78 35317548 PMC8908345 82. Alsadik S. Gnanasegaran G. Chen L. Mandair D. Toumpanakis C. Caplin M. Navalkissoor S. Safety of peptide receptor radionuclide therapy with 177 J. Nucl. Med. 2022 63 1503 1508 10.2967/jnumed.121.263056 35210299 PMC9536708 83. Baum R.P. Fan X. Jakobsson V. Yu F. Schuchardt C. Chen X. Zhang J. Long-term nephrotoxicity after PRRT: Myth or reality Theranostics 2024 14 451 459 10.7150/thno.92487 38169589 PMC10758070 84. Strosberg J.R. Al-Toubah T. Pellè E. Smith J. Haider M. Hutchinson T. Fleming J.B. El-Haddad G. Risk of bowel obstruction in patients with mesenteric or peritoneal disease receiving peptide receptor radionuclide therapy J. Nucl. Med. 2021 62 69 72 10.2967/jnumed.120.242875 32444368 85. Fernandez C.J. Agarwal M. Pottakkat B. Haroon N.N. George A.S. Pappachan J.M. Gastroenteropancreatic neuroendocrine neoplasms: A clinical snapshot World J. Gastrointest. Surg. 2021 13 231 255 10.4240/wjgs.v13.i3.231 33796213 PMC7993001 86. Raymond L.M. Korzun T. Kardosh A. Kolbeck K.J. Pommier R. Mittra E.S. The state of peptide receptor radionuclide therapy and its sequencing among current therapeutic options for gastroenteropancreatic neuroendocrine tumors Neuroendocrinology 2021 111 1086 1098 10.1159/000516015 33744879 87. Hope T.A. Abbott A. Colucci K. Bushnell D.L. Gardner L. Graham W.S. Lindsay S. Metz D.C. Pryma D.A. Stabin M.G. NANETS/SNMMI Procedure Standard for Somatostatin Receptor-Based Peptide Receptor Radionuclide Therapy with 177 J. Nucl. Med. 2019 60 937 943 10.2967/jnumed.118.230607 31263080 PMC12079155 88. Padilla-Morales E. Tan A. Hope T. Bergsland E. Comparison of Patient Experience with Commercial Versus Compounded Amino Acid Infusion for 177 J. Nucl. Med. 2019 60 2015 89. Al-Toubah T.E. Pelle E. Strosberg J.R. Risk of myelodysplastic syndrome/acute leukemia with sequential capecitabine/temozolomide and 177 J. Clin. Oncol. 2022 40 513 10.1200/JCO.2022.40.4_suppl.513 90. Alonzo N. Seyer M. Kim E.-J. Keshavarzi R. Yee K. Kunz P.L. Evaluation of the incidence of acute nausea and vomiting after administration of an amino acid solution containing only arginine and lysine with lutetium Lu-177 dotatate J. Clin. Oncol. 2020 38 12113 10.1200/JCO.2020.38.15_suppl.12113 91. Carlsen E.A. Fazio N. Granberg D. Grozinsky-Glasberg S. Ahmadzadehfar H. Grana C.M. Zandee W.T. Cwikla J. Walter M.A. Oturai P.S. Peptide receptor radionuclide therapy in gastroenteropancreatic NEN G3: A multicenter cohort study Endocr. Relat. Cancer 2019 26 227 239 10.1530/ERC-18-0424 30540557 92. Brabander T. van der Zwan W.A. Teunissen J.J.M. Kam B.L.R. Feelders R.A. de Herder W.W. van Eijck C.H.J. Franssen G.J.H. Krenning E.P. Kwekkeboom D.J. Long-term efficacy, survival, and safety of [ 177 0 3 Clin. Cancer Res. 2017 23 4617 4624 10.1158/1078-0432.CCR-16-2743 28428192 93. Pritzl S.L. Kusne Y. Halfdanarson T.R. Hobday T. Sonbol M.B. Kendi A.T. Mangaonkar A.A. Gangat N. Shah M. Patnaik M.M. Spectrum of therapy-related clonal cytopenias and neoplasms after exposure to Lutetium-177-Dotatate Leuk. Res. 2024 136 107434 10.1016/j.leukres.2023.107434 38154192 94. Sonbol M.B. Halfdanarson T.R. Hilal T. Assessment of therapy-related myeloid neoplasms in patients with neuroendocrine tumors after peptide receptor radionuclide therapy: A systematic review JAMA Oncol. 2020 6 1086 1092 10.1001/jamaoncol.2020.0078 32297906 95. Brieau B. Hentic O. Lebtahi R. Palazzo M. Ben Reguiga M. Rebours V. Maire F. Hammel P. Ruszniewski P. Fenaux P. High risk of myelodysplastic syndrome and acute myeloid leukemia after 177 Endocr. Relat. Cancer 2016 23 L17-23 10.1530/ERC-15-0543 26932783 96. Morton L.M. Dores G.M. Schonfeld S.J. Linet M.S. Sigel B.S. Lam C.J.K. Tucker M.A. Curtis R.E. Association of chemotherapy for solid tumors with development of therapy-related myelodysplastic syndrome or acute myeloid leukemia in the modern era JAMA Oncol. 2019 5 318 325 10.1001/jamaoncol.2018.5625 30570657 PMC6439835 97. Singh S. Halperin D. Myrehaug S. Herrmann K. Pavel M.E. Kunz P.L. Chasen B. Capdevila J. Tafuto S. Oh D.Y. 211MO First-line efficacy of [ 177 Ann. Oncol. 2024 35 S92 S93 10.1016/j.annonc.2024.05.219 98. Kunz P.L. Ferone D. Halperin D.M. Myrehaug S. Herrmann K. Pavel M. Chasen B. Capdevila J. Tafuto S. Oh D.-Y. Safety and time to response of [ 177 J. Clin. Oncol. 2024 42 4131 10.1200/JCO.2024.42.16_suppl.4131 99. Singh S. Hope T.A. Bergsland E.B. Bodei L. Bushnell D.L. Chan J.A. Chasen B.R. Chauhan A. Das S. Dasari A. Consensus report of the 2021 National Cancer Institute neuroendocrine tumor clinical trials planning meeting J. Natl. Cancer Inst. 2023 115 1001 1010 10.1093/jnci/djad096 37255328 PMC10483264 100. Baum R.P. Kulkarni H.R. Singh A. Kaemmerer D. Mueller D. Prasad V. Hommann M. Robiller F.C. Niepsch K. Franz H. Results and adverse events of personalized peptide receptor radionuclide therapy with 90 177 Oncotarget 2018 9 16932 16950 10.18632/oncotarget.24524 29682195 PMC5908296 101. Strosberg J. Leeuwenkamp O. Siddiqui M.K. Peptide receptor radiotherapy re-treatment in patients with progressive neuroendocrine tumors: A systematic review and meta-analysis Cancer Treat. Rev. 2021 93 102141 10.1016/j.ctrv.2020.102141 33418096 102. van der Zwan W.A. Brabander T. Kam B.L.R. Teunissen J.J.M. Feelders R.A. Hofland J. Krenning E.P. de Herder W.W. Salvage peptide receptor radionuclide therapy with [ 177 3 Eur. J. Nucl. Med. Mol. Imaging 2019 46 704 717 10.1007/s00259-018-4158-1 30267116 PMC6351514 103. Chauhan A. O’Callaghan C. Myrehaug S. Bodei L. Kunz P. Dasari A. Strosberg J. Alexander S. Cheung W. Singh S. NET RETREAT: A Phase II study of 177 Endocr. Abstr. 2023 98 23777 10.1530/endoabs.98.T11 104. Halperin D.M. Morris M. Ulaner G.A. Strosberg J.R. Mehr S.H. Li D. Soares H.P. Anthony L.B. Kotiah S.D. Jacene H. Phase Ib portion of the ACTION-1 phase Ib/3 trial of RYZ101 in gastroenteropancreatic neuroendocrine tumors (GEP-NET) progressing after 177 J. Clin. Oncol. 2024 42 3091 10.1200/JCO.2024.42.16_suppl.3091 105. Urso L. Panareo S. Castello A. Ambrosio M.R. Zatelli M.C. Caracciolo M. Tonini E. Valpiani G. Boschi A. Uccelli L. Glucose Metabolism Modification Induced by Radioligand Therapy with [ 177 90 Pharmaceutics 2022 14 2009 10.3390/pharmaceutics14102009 36297443 PMC9612170 106. Harris P.E. Zhernosekov K. The evolution of PRRT for the treatment of neuroendocrine tumors; What comes next? Front. Endocrinol. 2022 13 941832 10.3389/fendo.2022.941832 PMC9659917 36387893 107. Prasad V. Trikalinos N. Hanna A. Johnson F. Puhlmann M. Wahl R. A Phase I/IIa of [212Pb]VMT-α-NET targeted alpha-particle therapy for advanced SSTR2 positive neuroendocrine tumors J. Nucl. Med. 2024 65 242430 108. Delpassand E.S. Tworowska I. Esfandiari R. Torgue J. Hurt J. Shafie A. Núñez R. Targeted α-emitter therapy with 212 J. Nucl. Med. 2022 63 1326 1333 10.2967/jnumed.121.263230 34992153 PMC9454455 109. Santo G. di Santo G. Cicone F. Virgolini I. Peptide receptor radionuclide therapy with somatostatin analogs beyond gastroenteropancreatic neuroendocrine tumors J. Neuroendocrinol. 2025 37 e70013 10.1111/jne.70013 40064181 PMC11919479 110. Chow Z. Johnson J. Chauhan A. Jeong J.C. Castle J.T. Izumi T. Weiss H. Townsend C.M. Jr. Schrader J. Anthony L. Inhibition of ribonucleotide reductase subunit M2 enhances the radiosensitivity of metastatic pancreatic neuroendocrine tumor Cancer Lett. 2024 596 216993 10.1016/j.canlet.2024.216993 38801884 PMC11299177 111. Chauhan A. Arnold S. Kolesar J. Carson W. Weiss H. Jayswal R. Yan D. Khouli R.E. Khurana A. Beumer J. Abstract CT194: ETCTN 10388: A first in human phase I trial of triapine and lutetium Lu 177 DOTATATE in well-differentiated somatostatin receptor-positive gastroenteropancreatic neuroendocrine tumors (GEP-NETs) Cancer Res. 2023 83 CT194 10.1158/1538-7445.AM2023-CT194 112. Chauhan A. Kolesar J. Yan D. Li D. Khurana A. Carson W.E. Arnold S.M. Gore S. Rubinstein L. Kohn E.C. ETCTN 10450: A phase I trial of peposertib and lutetium 177 DOTATATE in well-differentiated somatostatin receptor-positive gastroenteropancreatic neuroendocrine tumors (GEP-NETs) J. Clin. Oncol. 2023 41 TPS658 10.1200/JCO.2023.41.4_suppl.TPS658 113. Parghane R.V. Ostwal V. Ramaswamy A. Bhandare M. Chaudhari V. Talole S. Shrikhande S.V. Basu S. Long-term outcome of “Sandwich” chemo-PRRT: A novel treatment strategy for metastatic neuroendocrine tumors with both FDG- and SSTR-avid aggressive disease Eur. J. Nucl. Med. Mol. Imaging 2021 48 913 923 10.1007/s00259-020-05004-5 32876706 114. Nicolini S. Bodei L. Bongiovanni A. Sansovini M. Grassi I. Ibrahim T. Monti M. Caroli P. Sarnelli A. Diano D. Combined use of 177 Eur. J. Nucl. Med. Mol. Imaging 2021 48 3260 3267 10.1007/s00259-021-05236-z 33604690 PMC9346628 115. Calomino N. Poto G.E. Carbone L. Bagnacci G. Piccioni S. Andreucci E. Nenci L. Marano L. Verre L. Petrioli R. Neuroendocrine tumors’ patients treated with somatostatin analogue could complicate with emergency cholecystectomy Ann. Ital. Chir. 2023 94 518 522 38051513 Figure 1 Disease-specific survival of stage-matched, well-differentiated pNETs with or without high-grade component and poorly differentiated pNECs. Figure adapted with permission from Tang et al. [ 22 a n b n c n Figure 2 Comparative PET imaging in a patient with a G3 NET. ( Left 68 Right 18 Figure 3 Suggested treatment algorithm for the management of G2/G3 metastatic GEP-NETs. a b ",
  "metadata": {
    "Title of this paper": "Neuroendocrine tumors’ patients treated with somatostatin analogue could complicate with emergency cholecystectomy",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468650/"
  }
}