{
  "title": "Paper_1145",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467878 PMC12467878.1 12467878 12467878 41008547 10.3390/biom15091240 biomolecules-15-01240 1 Review The Impact of PCSK9 on Diabetic Cardiomyopathy: Mechanisms and Implications Wang Haixia 1 † Wang Pei 1 † Wang Yubo 1 Du Shuzhen 1 Zhao Jing 2 * Zhang Zheng 2 * Joven Jorge Academic Editor Stec David E. Academic Editor 1 wanghx2024@lzu.edu.cn pwang20@lzu.edu.cn wyubo2024@lzu.edu.cn dushuzh2023@lzu.edu.cn 2 * ldyy_jingzhao@lzu.edu.cn zhangzh@lzu.edu.cn † These authors contributed equally to this work. 27 8 2025 9 2025 15 9 497615 1240 05 6 2025 28 7 2025 20 8 2025 27 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Diabetic cardiomyopathy (DCM) is a common and clinically relevant complication of diabetes mellitus, defined by myocardial dysfunction in the absence of overt coronary artery disease or systemic hypertension. Recent studies have identified proprotein convertase subtilisin/kexin type 9 (PCSK9) as a pivotal mediator in the pathogenesis of DCM. PCSK9 contributes not only to dyslipidemia via degradation of LDLR and consequent elevation of circulating LDL-C, but also to metabolic derangements and inflammation through interactions with receptors such as CD36 and Toll-like receptor 4 (TLR4). In DCM, PCSK9 has been shown to exacerbate inflammation and pyroptosis and is closely linked to impaired autophagic function. Elevated circulating PCSK9 has emerged as a potential biomarker for cardiovascular events in patients with type 2 diabetes mellitus (T2DM). At the same time, long-term administration of PCSK9 inhibitors (PCSK9i) has not been associated with a significant increase in incident diabetes. Furthermore, PCSK9 loss-of-function mutations have been linked to a modestly heightened risk of T2DM, underscoring its complex involvement in cardiometabolic regulation and disease. This review synthesizes current insights into the mechanistic and therapeutic roles of PCSK9 in DCM, aiming to inform precision cardiovascular risk management strategies in T2DM populations. PCSK9 DCM PCSK9 inhibitor inflammatory response NLRP3 inflammasome lipid metabolism the Clinical Cooperative Pilot Project of Traditional Chinese and Western Medicine for Major Diseases 3 National Key R&D Program of China 2018YFC1311505 National Natural Science Foundation of China 820608071003910 Gansu Provincial Clinical Research Center for Cardiovascular Diseases 18JR2FA005 This research was funded by the Clinical Cooperative Pilot Project of Traditional Chinese and Western Medicine for Major Diseases (no. Administration of State Administration of Traditional Chinese Medicine (2018), no. 3), National Key R&D Program of China (no. 2018YFC1311505), Gansu Provincial Clinical Research Center for Cardiovascular Diseases (no. 18JR2FA005), National Natural Science Foundation of China (no. 820608071003910). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Diabetes mellitus is a chronic metabolic disease that poses a serious threat to human health. Currently, type 2 diabetes mellitus (T2DM) affects approximately 540 million individuals worldwide, including 6.1 million in Europe. Projections estimate that by 2045, the global prevalence of diabetes will rise to 783 million, representing 12.2% of the worldwide population [ 1 2 3 2 The pathogenesis of DCM is complex and involves multiple pathological processes, such as inflammatory response, oxidative stress, cardiomyocyte death, autophagy, metabolic disorders, insulin resistance, mitochondrial damage, endoplasmic reticulum stress, and accumulation of advanced glycation end products (AGEs) [ 4 5 6 7 PCSK9 plays a pivotal role in lipid metabolism by regulating low-density lipoprotein receptor (LDLR) degradation. Beyond this canonical function, PCSK9 influences fatty acid uptake, inflammatory pathways, and mitochondrial function through its interactions with key signalling mediators such as CD36 and Toll-like receptor 4 (TLR4), exerting profound effects on myocardial homeostasis [ 8 9 10 Although Mendelian randomisation studies [ 11 12 13 14 15 16 Table 1 This review aims to systematically summarise the pathological mechanisms and recent advances concerning PCSK9 in DCM, focusing particularly on its cell-type-specific functions within the heart. It further explores the cross-talk between PCSK9 and key regulatory pathways, including lipid and glucose metabolism, inflammation, autophagy, and ferroptosis, while highlighting its potential clinical value as a therapeutic target. 2. Mechanisms of Diabetic Cardiomyopathy DCM is characterised by myocardial hypertrophy and progressive impairment of cardiac function, which may ultimately culminate in heart failure [ 17 18 2 19 Metabolic dysregulation is a central pathological hallmark of DCM. Recent studies have identified the TGR5 signalling pathway as a critical regulator of lipid metabolism and myocardial function. Loss of TGR5 promotes aberrant membrane trafficking of CD36 through DHHC4-mediated palmitoylation, leading to intracellular lipid accumulation and compromised cardiac performance. Conversely, TGR5 activation significantly limits abnormal fatty acid influx into cardiomyocytes, exerting cardioprotective effects [ 20 21 Diabetes is increasingly recognised as a chronic, low-grade inflammatory disease. Experimental studies have demonstrated that inhibition of reactive oxygen species (ROS) production significantly attenuates myocardial pro-inflammatory signalling, underscoring the ROS–NLRP3 inflammasome axis as a key molecular bridge linking metabolic dysregulation to cardiac injury [ 22 23 24 25 26 27 AGEs further exacerbate inflammation by forming a ternary complex with TLR4 and MD2, activating pro-inflammatory cascades in the diabetic milieu [ 28 29 30 Chronic low-grade inflammation is a key player in driving insulin resistance (IR) in the context of obesity and T2DM. Inflammatory cascades begin with IgG deposition in adipose tissue, which triggers macrophage infiltration and disrupts insulin signalling [ 31 32 33 34 Figure 1 Branched-chain amino acids promote polarisation of macrophages toward the pro-inflammatory M1 phenotype via activation of the Janus kinase 1/signal transducer and activator of transcription 1 (JAK1/STAT1) pathway, thereby impairing insulin sensitivity [ 35 36 Figure 1 37 SOSTDC1, secreted by CD4 + 38 39 40 3. Mechanisms of PCSK9 3.1. PCSK9 Biology PCSK9, a member of the proprotein convertase family, plays a pivotal role in the proteolytic activation, modification, and degradation of secreted proteins. The protein comprises 692 amino acids, with a molecular mass of approximately 74.3 kDa, and contains three characteristic functional domains arranged from the N-terminus: a prodomain, a catalytic domain, and a cysteine–histidine-rich C-terminal domain (CRD) [ 41 42 43 44 45 46 47 48 PCSK9 modulates several membrane-bound receptors on pancreatic β-cells, including very low-density lipoprotein receptor (VLDLR), CD36, and fatty acid transport proteins, thereby influencing insulin secretion and fatty acid uptake, and ultimately contributing to glucose homeostasis [ 49 50 51 52 p p p 53 54 3.2. PCSK9 Demographics PCSK9i, such as evolocumab, are suitable for patients across all age groups. Notably, initiating long-term evolocumab therapy in older adults with atherosclerotic cardiovascular disease yields cardiovascular benefits comparable to, if not exceeding, those seen in younger individuals [ 55 56 Emerging genomic data suggest that the metabolic effects of PCSK9 inhibition may vary by ancestry. Rosoff et al. [ 57 58 Sex has been identified as a biological determinant of plasma PCSK9 concentrations in patients with diabetes, with variations observed across different age strata. PCSK9i significantly reduces LDL-C and MACE risk in both sexes, with no significant sex differences in MACE reduction. However, LDL-C reduction is greater in males [ 59 60 3.3. PCSK9 and Lipid Metabolism 3.3.1. HNF1α HNF1α serves as a central transcriptional activator in hepatic metabolic regulation by binding its conserved recognition sequence (5′-GTTAATNATTAAC-3′) via the N-terminal POU domain, thereby directly promoting PCSK9 transcription [ 61 62 63 DC371739 64 65 66 67 Figure S1 3.3.2. SREBP2 Sterol regulatory element-binding protein 2 (SREBP2) plays a pivotal role in regulating intracellular cholesterol homeostasis by modulating genes involved in lipid metabolism. Through its basic helix-loop-helix structural motif, SREBP2 selectively binds sterol regulatory elements (SREs) within the promoter regions of target genes, including PCSK9, LDLR, and HMGCR, thereby initiating their transcription [ 68 Figure S1 69 SREBP2 activation is also modulated by inflammatory signalling. Proinflammatory cytokines such as TNF-α and IFN-γ upregulate PCSK9 expression in hepatocytes through synergistic activation of SREBP2 [ 70 71 3.3.3. CD36 CD36 is a pivotal fatty acid translocase that regulates transmembrane fatty acid transport via a dynamic membrane recycling mechanism. Aberrant intracellular localisation of CD36 has been implicated in multiple metabolic disorders [ 72 73 74 75 76 77 78 79 Figure S1 3.4. PCSK9 and Glucose Metabolism 3.4.1. PCSK9 and T2DM The functional role of PCSK9 within pancreatic islet cells remains controversial. Although circulating and liver-derived PCSK9 appear to exert minimal influence on pancreatic β-cell physiology, targeted PCSK9 deficiency within β-cells has been associated with intracellular cholesterol accumulation and impaired insulin secretion, suggesting a context-specific requirement for endogenous PCSK9 in maintaining islet homeostasis [ 80 8 15 81 44 From a clinical perspective, elevated serum PCSK9 concentrations have been documented in individuals with impaired glucose metabolism, including those with impaired glucose tolerance and T2DM [ 82 83 Current evidence suggests that prolonged use of PCSK9i does not confer a heightened risk of developing NODM [ 84 85 14 80 PCSK9i has consistently demonstrated substantial cardiovascular benefits in patients with diabetes mellitus. Meta-analyses and large-scale randomised controlled trials report an approximate 18% relative risk reduction in MACEs among diabetic patients receiving PCSK9i therapy, alongside significant improvements in lipid indices [ 86 87 88 biomolecules-15-01240-t001_Table 1 Table 1 The Relationship Between PCSK9i, Lipid Profiles, and NODM (The arrows in the table indicate the changes: downward arrows indicate a decrease, while hyphens (–) represent no significant effect observed). Author Dose of the Intervention Year Number of Participants Follow-Up (Mean or Median) Years Inclusion Criteria Type Outcome Change Imbalzano et al. [ 89 Alirocumab/ 2023 20651(aggregated) 51 weeks DM + hypercholesterolemia, RCTs comparing PCSK9i vs. placebo Meta-analysis of 8 RCTs MACE 18% ↓; LDL-C, HDL-C, TG, Lp(a), and ApoB ↓. Ray et al. [ 90 Alirocumab 75 mg every 2 weeks (Q2W), increased to 150 mg if required 2019 413 24 weeks Type 2 Diabetes Mellitus (T2DM), mixed dyslipidemia, LDL-C ≥ 100 mg/dL, ASCVD, on stable maximally tolerated statin therapy RCT LDL-C, non-HDL-C, ApoB, and LDL particle number (LDL-PN) ↓ Fischer et al. [ 91 Alirocumab (75 mg or 150 mg) and Evolocumab (140 mg) 2021 237 Median 18 months Age > 18 years; PCSK9 inhibitors (alirocumab or evolocumab) for secondary prevention; Available LDL-C data at baseline and during follow-up for at least 3 months Observational study MACE ↓; LDL-C, non-HDL-C, and ApoB ↓ Rosenson et al. [ 92 Evolocumab 420 mg subcutaneously once a month 2019 421 12 weeks Type 2 diabetes, hyperlipidemia or mixed dyslipidemia, background atorvastatin 20 mg/d RCT LDL-C 54.3% ↓ (12 weeks); non-HDL-C, and ApoB ↓. Chen et al. [ 93 Evolocumab 2019 453 12 weeks T2DM with hyperlipidemia, LDL-C ≥ 2.6 mmol/L on statin or ≥3.4 mmol/L without statin RCT LDL-C ↓ Non-HDL-C, ApoB100, triglycerides, and Lp(a) ↓; HbA1c and FSG(–) Schwartz et al. [ 16 Alirocumab (75 mg or 150 mg every 2 weeks) 2025 8107 Median follow-up of 2.4 years Patients with recent acute coronary syndrome, elevated lipoproteins, and no diabetes at baseline RCT NODM(–) Sabatine et al. [ 94 Evolocumab 140 mg every 2 weeks or 420 mg monthly 2017 27,564 104 weeks Atherosclerotic cardiovascular disease, LDL-C ≥ 1.8 mmol/L, on statin therapy RCT NODM(–) Moura et al. [ 95 Evolocumab 140 mg every 2 weeks vs. placebo 2025 9388 (No diabetes at baseline) Median follow-up of 2.3 years Age 40–85, stable cardiovascular disease, LDL ≥ 70 mg/dL, on statin therapy, no T2D at baseline RCT NODM(–) González-Lleó et al. [ 14 Alirocumab 75 or 150 mg or evolocumab 140 mg every 2 weeks 2024 218 Mean follow-up of 3.2 years Patients over 18 years with hypercholesterolemia, including familial hypercholesterolemia (FH), undergoing treatment with PCSK9 inhibitors Observational study NODM (2.6%/year); 3.4.2. PCSK9 and Antihyperglycemic Drug Emerging evidence indicates a complex and potentially synergistic relationship between PCSK9 signalling and antidiabetic pharmacotherapies. The current therapeutic landscape for DCM is dominated by SGLT-2 inhibitors, GLP-1 receptor agonists, and their combined use. While efficacious in glycemic control, these agents often induce gastrointestinal adverse effects that compromise long-term adherence. Combination regimens have shown enhanced clinical outcomes, including reductions in HbA1c, fasting plasma glucose, and body weight compared to monotherapy [ 96 97 98 Dapagliflozin similarly modulates hepatic lipid metabolism through the PCSK9/LDLR pathway [ 67 99 100 101 102 Insulin exerts a pivotal influence on both systemic and hepatic expression of PCSK9. Miao et al. [ 103 104 105 3.4.3. PCSK9 and Atherogenic Dyslipidemia Circulating PCSK9 has emerged as a potential prognostic biomarker for cardiovascular (CV) events in patients with T2DM [ 45 106 107 108 109 110 111 In a cohort of 2984 participants, higher serum PCSK9 levels were significantly associated with multivessel coronary heart disease (CHD) and elevated Gensini scores. They were identified as an independent predictor of CHD and MACEs in individuals with T2DM [ 107 112 89 Table 1 3.4.4. PCSK9 Mutations and Gene Silencing Genetic polymorphisms affecting PCSK9 function are increasingly recognised for their metabolic consequences. Several PCSK9 loss-of-function (LOF) variants, including rs11583680, rs11591147, rs2479409, and rs11206510, have been associated with modest elevations in fasting glucose, increased body weight, and a higher risk for T2DM development [ 113 114 115 Therapeutically, gene silencing of PCSK9 is being explored as a novel strategy for mitigating DCM. Sustained suppression of PCSK9 expression has been achieved through the transient delivery of ethyl transfer RNA (ETR), leading to durable reductions in LDL-C [ 49 45 116 3.5. PCSK9 and Inflammation 3.5.1. PCSK9 Activates the TLR4/NF-κB Pathway PCSK9 directly interacts with TLR4 via its cysteine-rich domain (CRD), activating the TLR4/MyD88/NF-κB signalling pathway and promoting the expression of key pro-inflammatory mediators, including TNF-α, IL-1β, and tissue factor [ 117 118 119 120 51 121 122 123 124 125 PCSK9 activates the NLRP3 inflammasome signalling pathway by inducing damage to mtDNA [ 126 127 128 126 3.5.2. NLRP3 Inflammasome Via IL-1β Regulates PCSK9 Secretion NLRP3 inflammasome also inversely regulates PCSK9 expression [ 44 44 109 44 126 129 130 131 132 3.6. Pyroptosis Oxidative stress, endoplasmic reticulum stress, and immune activation induced by hyperglycemia are primary drivers of focal cellular death in diabetes. Elevated glucose concentrations stimulate the expression of multiple classes of endogenous non-coding RNAs—including miRNAs, circRNAs, and lncRNAs—which modulate transcriptional and post-transcriptional pathways involved in inflammation and programmed cell death [ 133 Mechanistically, persistent hyperglycemia activates the CaMK2α/O-GlcNAcylation positive feedback loop in endothelial cells, which remains active even after restoring normoglycemia. It promotes phosphorylation of Stat1, enhances transcription of miR-15/16 precursors, increases secretion of small extracellular vesicle-associated miR-15/16, and sustains a state of chronic low-grade inflammation [ 134 135 126 136 Activation of the NLRP3 inflammasome appears to be a critical pathogenic node linking programmed cell death to inflammatory amplification in diabetic vasculature. Through caspase-1-dependent release of proinflammatory mediators, NLRP3 drives localised immune activation within vascular tissues, contributing to endothelial dysfunction and structural remodelling of the vascular wall. This mechanistic axis provides a key inflammatory framework underpinning the progression of diabetic vascular complications [ 137 3.7. Autophagy Under low-grade inflammation and reduced PCSK9 expression, VSMCs mitigate cellular injury by activating autophagy or entering senescence via limited proliferation, allowing adaptation to external stressors. While these processes are considered protective, experimental studies show that VSMCs undergoing autophagy or senescence exhibit distinct morphological remodelling and metabolic reprogramming [ 138 Emerging evidence suggests that PCSK9i may modulate autophagy-related mechanisms during vascular inflammation. For instance, PCSK9i suppresses IL-6–induced autophagy activation in endothelial cells [ 139 4 140 3.8. Ferroptosis Ferroptosis is a distinct form of programmed cell death characterized by intracellular iron accumulation, reactive oxygen species (ROS) generation via the Fenton reaction, and lipid peroxidation, ultimately leading to membrane disruption and cell death [ 141 142 Preclinical studies suggest that PCSK9 could be involved in regulating ferroptosis in cardiomyocytes, potentially through effects on mitochondrial dynamics and oxidative stress, thereby influencing disease progression. However, these findings are derived primarily from experimental models, and the clinical significance remains to be established. Furthermore, it may represent a mechanistic link between inflammation and ferroptosis. Experimental silencing of TLR4 by siRNA has been shown to attenuate ferroptosis and ameliorate cardiac pathology in DCM models. In vitro and in vivo evidence indicates that PCSK9 expression correlates positively with TLR4 levels; overexpression of PCSK9 increases TLR4 expression in macrophages, whereas pharmacological or genetic inhibition of PCSK9 downregulates TLR4 in vascular tissues [ 143 144 4. PCSK9 Involvement in the Pathological Processes of DCM 4.1. Cardiomyocytes Despite its relatively low expression in cardiomyocytes, PCSK9 plays an essential role in cardiac metabolic regulation. Cardiomyocytes endogenously synthesise and secrete PCSK9, contributing to functional impairment via autocrine mechanisms [ 145 115 146 Experimental deletion of Pcsk9 specifically in cardiomyocytes induces a progressive, dilated cardiomyopathy-like phenotype in mice, marked by myocardial hypertrophy, fibrotic remodelling, and loss of systolic function, ultimately progressing to end-stage heart failure and early mortality [ 115 −/− 147 PCSK9 contributes to regulating glucose metabolism reprogramming in cardiomyocytes under pathological stress. In DCM, elevated β-hydroxybutyric acid (βOHB) levels promote epigenetic activation of the lipocalin-2 (Lcn2) promoter via H3K9bhb modification, leading to nuclear translocation of the NF-κB/RPS3 complex and initiating proinflammatory and profibrotic gene expression programs [ 148 149 77 Evidence indicates that PCSK9i mitigates cardiac fibrosis following myocardial infarction through multiple converging mechanisms. Evolocumab improves myocardial remodelling and cardiac function in metabolic syndrome models by suppressing PCSK9-mediated activation of the NLRP3 inflammasome and its downstream Caspase-1/IL-1β axis [ 150 151 In reperfusion injury models, PCSK9i attenuate myocardial fibrosis by inhibiting the TGF-β1/Smad3 signalling cascade and dampening local inflammatory responses [ 152 153 154 4.2. Endothelial Cells Endothelial cells constitute a dynamic interface for vascular immune responses. Deletion of endothelial epsins delays dysfunction by inhibiting FGFR1/TGF-β–driven EndMT, thereby preserving barrier integrity under stress conditions [ 155 156 157 136 PCSK9 emerges as a key modulator of endothelial integrity in diabetes. Hyperglycemic and hypoxic stimuli upregulate PCSK9 expression in endothelial cells, triggering focal cell death and functional decline [ 127 158 159 160 4.3. Monocyte Monocytes are key cellular mediators in the inflammatory and immunological disturbances associated with diabetes. Under hyperglycemic stress, monocytes secrete pro-cathepsin D, which facilitates blood–brain barrier transcytosis and promotes neurovascular injury [ 161 162 163 PCSK9 exerts immunoregulatory effects on monocytes, extending beyond lipid metabolism. Neutralising PCSK9 with monoclonal antibodies attenuates CCR2-mediated chemotaxis and dampens pro-inflammatory monocyte activation in familial hypercholesterolemia [ 164 p p 165 166 Evolocumab therapy has downregulated monocyte activation markers in high-risk ASCVD populations [ 167 168 4.4. Macrophage Macrophages are increasingly recognised as central mediators of inflammatory remodelling in diabetic left ventricular fibrosis and myocardial dysfunction [ 169 170 171 Phenylpyruvic acid, a microbial-derived metabolite, enters macrophages via CD36-dependent uptake, binds to palmitoyl-protein thioesterase 1 (PPT1), and inhibits its depalmitoylase activity. It enhances NLRP3 palmitoylation and activates the inflammasome, leading to proinflammatory cytokine secretion and M1-like macrophage polarisation [ 172 173 155 PCSK9 emerges as a potent regulator of macrophage polarisation and function. By downregulating CD36 and inhibiting lipid uptake, PCSK9 reinforces an inflammatory macrophage phenotype characterised by increased IFN-γ production and T cell stimulation [ 70 125 174 Functionally, PCSK9 operates both intracellularly and as a circulating mediator to regulate macrophage antiviral immunity and vascular inflammation [ 175 176 177 4.5. Vascular Smooth Muscle Cells PCSK9 maintains mitochondrial homeostasis in VSMCs. Its upregulation leads to enhanced phosphorylation of p38 MAPK, which subsequently activates the mitochondrial fission mediator dynamin-related protein 1 (DRP1), resulting in marked changes in mitochondrial morphology and function. It is accompanied by increased intracellular reactive oxygen species (ROS) levels, ultimately impairing cellular function and viability. DRP1, as a central regulator of mitochondrial dynamics, appears to be a critical downstream effector of PCSK9, suggesting the presence of a feedback regulatory loop between PCSK9 and DRP1 [ 178 179 PCSK9 also promotes vascular ageing through multiple mechanisms. Its overexpression downregulates apolipoprotein E receptor 2, promotes polyploidization of VSMCs, and accelerates senescence-associated vascular changes [ 138 174 180 5. Research Progress on PCSK9 in Other Fields 5.1. PCSK9 and Ischemia/Reperfusion Injury PCSK9 is increasingly recognised as a pathophysiological mediator and therapeutic target in ischemia–reperfusion (I/R) injury following ST-segment elevation myocardial infarction (STEMI). Experimental models indicate that PCSK9 inhibition via evolocumab protects cardiomyocytes by suppressing LIAS-dependent cuproptosis, a copper-induced cell death pathway implicated in I/R-associated myocardial damage [ 10 Clinically, serial measurements in STEMI patients reveal a delayed but sustained rise in circulating PCSK9 levels within 48 h post-percutaneous coronary intervention. While early elevations (at 24 h) do not correlate with myocardial or microvascular injury, higher PCSK9 levels at 48 h are strongly associated with intramyocardial haemorrhage, microvascular obstruction, infarct expansion, and adverse clinical prognosis [ 9 5.2. PCSK9 and Cancer PCSK9 has been proposed as a multifunctional regulator of tumour progression and metastasis through its ability to reprogram the tumour microenvironment and intracellular signalling networks. It modulates metastatic competency by downregulating low-density lipoprotein receptor–related protein 1 (LRP1), thereby derepressing transcriptional programs associated with invasion and dissemination [ 181 182 Mechanistically, PCSK9 overexpression has been associated with enhanced phosphorylation of mitogen-activated protein kinases (MAPKs), including p38MAPK, ERK1/2, and JNK, which may facilitate tumour cell migration and invasion. Gene silencing of PCSK9 in model systems attenuates this phosphorylation cascade and impairs tumour cell motility [ 183 184 Moreover, PCSK9 may also influence the metabolic adaptation of cancer cells in distinct microenvironments. In pancreatic cancer, low PCSK9 expression promotes extracellular cholesterol uptake, leveraging hepatic cholesterol abundance. Conversely, elevated PCSK9 levels shift cancer cells toward intrinsic cholesterol biosynthesis and antioxidant production, enhancing their survival in oxidative niches such as the lungs [ 185 6. Conclusions and Perspectives PCSK9 has garnered recognition beyond its canonical role in lipid metabolism, emerging as a pleiotropic effector in DCM. In this review, we delineate the multifaceted roles of PCSK9 in metabolic dysregulation, immune activation, and programmed cell death, and examine its cell-specific effects in cardiomyocytes, endothelial cells, macrophages, monocytes, and vascular smooth muscle cells. Mechanistically, PCSK9 contributes to chronic lipotoxic and inflammatory signalling via CD36- and TLR4-dependent pathways, fostering maladaptive cardiac remodelling in the diabetic milieu. Pharmacologically, PCSK9 inhibition offers dual benefits—practical LDL-C reduction and favourable metabolic neutrality. Evidence from clinical trials and Mendelian randomisation studies suggests that PCSK9i do not increase the incidence of NODM, and that associated T2DM risk from partial loss-of-function mutations is minimal. Beyond lipid-lowering, PCSK9i demonstrate anti-inflammatory, anti-fibrotic, and cardio-metabolic effects that support their use in diabetic populations, especially among statin-intolerant patients or those with severe dysmetabolism. Notable therapeutic candidates include Tafolecimab, which induces significant and sustained LDL-C reductions with favourable safety in Chinese HeFH cohorts at biweekly and monthly dosing intervals [ 186 187 Critical knowledge gaps remain. Future studies must clarify the intracellular pathways modulated by PCSK9 in DCM, including mitochondrial bioenergetics, ferroptosis, and autophagy. Additionally, the pathophysiologic relevance of PCSK9 across various diabetic subtypes (T1DM, T2DM, GDM) must be elucidated through multicenter, phenotype-specific cohorts. Finally, combinatorial regimens with GLP-1 receptor agonists or SGLT2 inhibitors require rigorous investigation to determine additive or antagonistic effects. Of note, targeted epigenetic editing of the PCSK9 promoter has emerged as a promising strategy for personalised intervention. In summary, targeting PCSK9 represents a novel and promising strategy for DCM management, potentially improving both survival outcomes and quality of life in patients with diabetes-related heart disease. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/biom15091240/s1 Author Contributions H.W., Z.Z., P.W., J.Z., Y.W. and S.D. performed the literature searches. H.W., Z.Z., P.W. and J.Z. wrote the first draft of the manuscript. Y.W. and S.D. wrote sections of the manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflicts of interest. References 1. Sun H. Saeedi P. Karuranga S. Pinkepank M. Ogurtsova K. Duncan B.B. Stein C. Basit A. Chan J.C.N. Mbanya J.C. IDF Diabetes Atlas: Global, Regional and Country-Level Diabetes Prevalence Estimates for 2021 and Projections for 2045 Diabetes Res. Clin. Pract. 2022 183 109119 Erratum in Diabetes Res. Clin. Pract. 2023 204 10.1016/j.diabres.2021.109119 34879977 PMC11057359 2. Seferović P.M. Paulus W.J. Rosano G. Polovina M. Petrie M.C. Jhund P.S. Tschöpe C. Sattar N. Piepoli M. Papp Z. Diabetic Myocardial Disorder. A Clinical Consensus Statement of the Heart Failure Association of the ESC ESC Eur. J. Heart Fail. 2024 26 1893 1903 10.1002/ejhf.3347 38896048 3. Cavallari I. Bhatt D.L. Steg P.G. Leiter L.A. McGuire D.K. Mosenzon O. Im K. Raz I. Braunwald E. Scirica B.M. Causes and Risk Factors for Death in Diabetes J. Am. Coll. Cardiol. 2021 77 1837 1840 10.1016/j.jacc.2021.02.030 33832610 4. Wu Q. Zeng Y. Geng K. Guo M. Teng F. Yan P. Lei Y. Long Y. Jiang Z. Law B.Y.-K. The Role of IL-1 Family Cytokines in Diabetic Cardiomyopathy Metabolism 2025 163 156083 10.1016/j.metabol.2024.156083 39603339 5. Akhtar M.S. Alavudeen S.S. Raza A. Imam M.T. Almalki Z.S. Tabassum F. Iqbal M.J. Current Understanding of Structural and Molecular Changes in Diabetic Cardiomyopathy Life Sci. 2023 332 122087 10.1016/j.lfs.2023.122087 37714373 6. Congur I. Mingrone G. Guan K. Targeting Endoplasmic Reticulum Stress as a Potential Therapeutic Strategy for Diabetic Cardiomyopathy Metabolism 2025 162 156062 10.1016/j.metabol.2024.156062 39515414 7. Liu P. Zhang Z. Chen H. Chen Q. Pyroptosis: Mechanisms and Links with Diabetic Cardiomyopathy Ageing Res. Rev. 2024 94 102182 10.1016/j.arr.2023.102182 38182080 8. Peyot M.-L. Roubtsova A. Lussier R. Chamberland A. Essalmani R. Murthy Madiraju S.R. Seidah N.G. Prentki M. Prat A. Substantial PCSK9 Inactivation in β-Cells Does Not Modify Glucose Homeostasis or Insulin Secretion in Mice Biochim. Biophys. Acta BBA-Mol. Cell Biol. Lipids 2021 1866 158968 10.1016/j.bbalip.2021.158968 33992809 9. Tiller C. Holzknecht M. Lechner I. Oberhollenzer F. Von Der Emde S. Kremser T. Gollmann-Tepeköylü C. Mayr A. Bauer A. Metzler B. Association of Circulating PCSK9 With Ischemia-Reperfusion Injury in Acute ST-Elevation Myocardial Infarction Circ. Cardiovasc. Imaging 2024 17 e016482 10.1161/CIRCIMAGING.123.016482 39163371 10. Li Z.-Z. Guo L. An Y.-L. Yu W.-J. Shi D.-Y. Lin Q.-Y. Zhang B. Evolocumab Attenuates Myocardial Ischemia/Reperfusion Injury by Blocking PCSK9/LIAS-Mediated Cuproptosis of Cardiomyocytes Basic Res. Cardiol. 2025 120 301 320 10.1007/s00395-025-01100-5 39930254 11. Ference B.A. Robinson J.G. Brook R.D. Catapano A.L. Chapman M.J. Neff D.R. Voros S. Giugliano R.P. Davey Smith G. Fazio S. Variation in PCSK9 HMGCR N. Engl. J. Med. 2016 375 2144 2153 10.1056/NEJMoa1604304 27959767 12. Chen Q. Wu G. Li C. Qin X. Liu R. Zhang M. Safety of Proprotein Convertase Subtilisin/Kexin Type 9 Monoclonal Antibodies in Regard to Diabetes Mellitus: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Am. J. Cardiovasc. Drugs 2020 20 343 353 10.1007/s40256-019-00386-w 31823301 13. Rojo-Martínez G. Valdés S. Soriguer F. Vendrell J. Urrutia I. Pérez V. Ortega E. Ocón P. Montanya E. Menéndez E. Incidence of Diabetes Mellitus in Spain as Results of the Nation-Wide Cohort Diabet.es Study Sci. Rep. 2020 10 2765 10.1038/s41598-020-59643-7 32066839 PMC7026031 14. González-Lleó A.M. Sánchez-Hernández R.M. Plana N. Ibarretxe D. Rehues P. Ribalta J. Llop D. Wägner A.M. Masana L. Boronat M. Impact of PCSK9 Inhibitors in Glycaemic Control and New-Onset Diabetes Cardiovasc. Diabetol. 2024 23 4 10.1186/s12933-023-02077-y 38172901 PMC10765818 15. Ramin-Mangata S. Thedrez A. Nativel B. Diotel N. Blanchard V. Wargny M. Aguesse A. Billon-Crossouard S. Vindis C. Le May C. Effects of Proprotein Convertase Subtilisin Kexin Type 9 Modulation in Human Pancreatic Beta Cells Function Atherosclerosis 2021 326 47 55 10.1016/j.atherosclerosis.2021.03.044 33933263 16. Schwartz G.G. Szarek M. Jukema J.W. Cobbaert C.M. Reijnders E. Bittner V.A. Schwertfeger M. Bhatt D.L. Fazio S. Garon G. Risk of Incident Diabetes Related to Lipoprotein(a), LDL Cholesterol, and Their Changes with Alirocumab: Post Hoc Analyses of the ODYSSEY OUTCOMES Randomized Trial Diabetes Care 2025 48 596 604 10.2337/dc24-2110 39913634 PMC11932820 17. Chen W. Zhao M. Zhao S. Lu Q. Ni L. Zou C. Lu L. Xu X. Guan H. Zheng Z. Activation of the TXNIP/NLRP3 Inflammasome Pathway Contributes to Inflammation in Diabetic Retinopathy: A Novel Inhibitory Effect of Minocycline Inflamm. Res. 2017 66 157 166 10.1007/s00011-016-1002-6 27785530 18. Weissman D. Maack C. Bile Acids for Diabetic Cardiomyopathy Nat. Metab. 2024 6 993 995 10.1038/s42255-024-01032-9 38698280 19. Winell K. Pietilä A. Salomaa V. Incidence and Prognosis of Heart Failure in Persons with Type 2 Diabetes Compared with Individuals without Diabetes—A Nation-Wide Study from Finland in 1996–2012 Ann. Med. 2019 51 174 181 10.1080/07853890.2019.1602734 31055965 PMC7857487 20. Li Z. Wang Z. Yin Z. Zhang Y. Xue X. Han J. Zhu Y. Zhang J. Emmert M.Y. Wang H. Gender Differences in Fibrosis Remodeling in Patients with Long-Standing Persistent Atrial Fibrillation Oncotarget 2017 8 53714 53729 10.18632/oncotarget.16342 28881845 PMC5581144 21. Wang H. Wang J. Cui H. Fan C. Xue Y. Liu H. Li H. Li J. Li H. Sun Y. Inhibition of Fatty Acid Uptake by TGR5 Prevents Diabetic Cardiomyopathy Nat. Metab. 2024 6 1161 1177 10.1038/s42255-024-01036-5 38698281 PMC11199146 22. Huynh K. Kiriazis H. Du X.-J. Love J.E. Gray S.P. Jandeleit-Dahm K.A. McMullen J.R. Ritchie R.H. Targeting the Upregulation of Reactive Oxygen Species Subsequent to Hyperglycemia Prevents Type 1 Diabetic Cardiomyopathy in Mice Free Radic. Biol. Med. 2013 60 307 317 10.1016/j.freeradbiomed.2013.02.021 23454064 23. Mariappan N. Elks C.M. Sriramula S. Guggilam A. Liu Z. Borkhsenious O. Francis J. NF-κB-Induced Oxidative Stress Contributes to Mitochondrial and Cardiac Dysfunction in Type II Diabetes Cardiovasc. Res. 2010 85 473 483 10.1093/cvr/cvp305 19729361 PMC2860708 24. Meng L. Lu Y. Wang X. Cheng C. Xue F. Xie L. Zhang Y. Sui W. Zhang M. Zhang Y. NPRC Deletion Attenuates Cardiac Fibrosis in Diabetic Mice by Activating PKA/PKG and Inhibiting TGF-Β1/Smad Pathways Sci. Adv. 2023 9 eadd4222 10.1126/sciadv.add4222 37531438 PMC10396312 25. Ralston J.C. Lyons C.L. Kennedy E.B. Kirwan A.M. Roche H.M. Fatty Acids and NLRP3 Inflammasome–Mediated Inflammation in Metabolic Tissues Annu. Rev. Nutr. 2017 37 77 102 10.1146/annurev-nutr-071816-064836 28826373 26. Zhang Z.-Y. Dang S.-P. Li S.-S. Liu Y. Qi M.-M. Wang N. Miao L.-F. Wu Y. Li X.-Y. Wang C.-X. Glucose Fluctuations Aggravate Myocardial Fibrosis via the Nuclear Factor-κB-Mediated Nucleotide-Binding Oligomerization Domain-Like Receptor Protein 3 Inflammasome Activation Front. Cardiovasc. Med. 2022 9 748183 10.3389/fcvm.2022.748183 35592403 PMC9110689 27. Xu J. Zhang D. Ma Y. Du H. Wang Y. Luo W. Wang R. Yi F. ROS in Diabetic Atria Regulate SK2 Degradation by Atrogin-1 through the NF-κB Signaling Pathway J. Biol. Chem. 2024 300 105735 10.1016/j.jbc.2024.105735 38336298 PMC10938124 28. Wang Y. Luo W. Han J. Khan Z.A. Fang Q. Jin Y. Chen X. Zhang Y. Wang M. Qian J. MD2 Activation by Direct AGE Interaction Drives Inflammatory Diabetic Cardiomyopathy Nat. Commun. 2020 11 2148 10.1038/s41467-020-15978-3 32358497 PMC7195432 29. Zhang H. Thai P.N. Shivnaraine R.V. Ren L. Wu X. Siepe D.H. Liu Y. Tu C. Shin H.S. Caudal A. Multiscale Drug Screening for Cardiac Fibrosis Identifies MD2 as a Therapeutic Target Cell 2024 187 7143 7163.e22 10.1016/j.cell.2024.09.034 39413786 PMC11645214 30. Wan L. Bai X. Zhou Q. Chen C. Wang H. Liu T. Xue J. Wei C. Xie L. The Advanced Glycation End-Products (AGEs)/ROS/NLRP3 Inflammasome Axis Contributes to Delayed Diabetic Corneal Wound Healing and Nerve Regeneration Int. J. Biol. Sci. 2022 18 809 825 10.7150/ijbs.63219 35002527 PMC8741862 31. Yu L. Yang Y.X. Gong Z. Wan Q. Du Y. Zhou Q. Xiao Y. Zahr T. Wang Z. Yu Z. FcRn-Dependent IgG Accumulation in Adipose Tissue Unmasks Obesity Pathophysiology Cell Metab. 2025 37 656 672.e7 10.1016/j.cmet.2024.11.001 39674176 PMC11885036 32. Liu Y. Su W. Liu Z. Hu Z. Shen J. Zheng Z. Ding D. Huang W. Li W. Cai G. Macrophage CREBZF Orchestrates Inflammatory Response to Potentiate Insulin Resistance and Type 2 Diabetes Adv. Sci. 2024 11 e2306685 10.1002/advs.202306685 PMC10987118 38286660 33. Li X. Zhang X. Xia J. Zhang L. Chen B. Lian G. Yun C. Yang J. Yan Y. Wang P. Macrophage HIF-2α Suppresses NLRP3 Inflammasome Activation and Alleviates Insulin Resistance Cell Rep. 2021 36 109607 10.1016/j.celrep.2021.109607 34433035 34. You D. Jung B.C. Villivalam S.D. Lim H.-W. Kang S. JMJD8 Is a Novel Molecular Nexus Between Adipocyte-Intrinsic Inflammation and Insulin Resistance Diabetes 2022 71 43 59 10.2337/db21-0596 PMC8763873 34686520 35. Huang H. Chen H. Yao Y. Lou X. Branched-Chain Amino Acids Supplementation Induces Insulin Resistance and pro-Inflammatory Macrophage Polarization via INFGR1/JAK1/STAT1 Signal Pathway Mol. Med. 2024 30 149 10.1186/s10020-024-00894-9 39267003 PMC11391606 36. Larsen J.K. Stocks B. Henderson J. Andersson D. Bäckdahl J. Eriksson-Hogling D. Stidsen J.V. Sakamoto K. Højlund K. Rydén M. Personalized Molecular Signatures of Insulin Resistance and Type 2 Diabetes 2024 Cell 2025 188 4106 4122.e16 40436015 10.1016/j.cell.2025.05.005 37. Chen L. Lin Y. Zhu X. Zhuo S. Li Z. Guo C. Ye X. Chen J. Wang S. Chen Y. MCT1-Mediated Lactate Shuttle to Mitochondria Governs Macrophage Polarization and Modulates Glucose Homeostasis by Affecting β Cells Adv. Sci. 2025 e14760 10.1002/advs.202414760 40660708 38. Li D. Zhu J. Zhang M. Shi Q. Guo R. Zhang D. Zheng P. Zhang H. Li G. Wu J. SOSTDC1 Downregulation in CD4+ T Cells Confers Protection against Obesity-Induced Insulin Resistance Cell Rep. 2025 44 115496 10.1016/j.celrep.2025.115496 40173040 39. Cho H. Lai C.-C. Bonnavion R. Alnouri M.W. Wang S. Roquid K.A. Kawase H. Campos D. Chen M. Weinstein L.S. Endothelial Insulin Resistance Induced by Adrenomedullin Mediates Obesity-Associated Diabetes Science 2025 387 674 682 10.1126/science.adr4731 39913566 40. She J. Tuerhongjiang G. Guo M. Liu J. Hao X. Guo L. Liu N. Xi W. Zheng T. Du B. Statins Aggravate Insulin Resistance through Reduced Blood Glucagon-like Peptide-1 Levels in a Microbiota-Dependent Manner Cell Metab. 2024 36 408 421.e5 10.1016/j.cmet.2023.12.027 38325336 41. Seidah N.G. Prat A. The Multifaceted Biology of PCSK9 Endocr. Rev. 2022 43 558 582 10.1210/endrev/bnab035 35552680 PMC9113161 42. Walley K.R. Thain K.R. Russell J.A. Reilly M.P. Meyer N.J. Ferguson J.F. Christie J.D. Nakada T. Fjell C.D. Thair S.A. PCSK9 Is a Critical Regulator of the Innate Immune Response and Septic Shock Outcome Sci. Transl. Med. 2014 6 258ra143 10.1126/scitranslmed.3008782 PMC4342147 25320235 43. Luna Saavedra Y.G. Zhang J. Seidah N.G. PCSK9 Prosegment Chimera as Novel Inhibitors of LDLR Degradation PLoS ONE 2013 8 e72113 10.1371/journal.pone.0072113 23951290 PMC3741231 44. Ding Z. Wang X. Liu S. Zhou S. Kore R.A. Mu S. Deng X. Fan Y. Mehta J.L. NLRP3 Inflammasome via IL-1β Regulates PCSK9 Secretion Theranostics 2020 10 7100 7110 10.7150/thno.45939 32641981 PMC7330863 45. Yao Y. Liu H. PCSK9/LOX-1 Is Associated with T2DM and Regulates High Glucose-Induced Lipid Metabolism Dysfunction in Human Microvascular Endothelial Cells Endokrynol. Pol. 2025 76 116 123 10.5603/ep.101052 40071808 46. Adorni M.P. Cipollari E. Favari E. Zanotti I. Zimetti F. Corsini A. Ricci C. Bernini F. Ferri N. Inhibitory Effect of PCSK9 on Abca1 Protein Expression and Cholesterol Efflux in Macrophages Atherosclerosis 2017 256 1 6 10.1016/j.atherosclerosis.2016.11.019 27940374 47. Ding Z. Liu S. Wang X. Deng X. Fan Y. Sun C. Wang Y. Mehta J.L. Hemodynamic Shear Stress via ROS Modulates PCSK9 Expression in Human Vascular Endothelial and Smooth Muscle Cells and Along the Mouse Aorta Antioxid. Redox Signal. 2015 22 760 771 10.1089/ars.2014.6054 25490141 PMC4361218 48. Ding Z. Liu S. Wang X. Deng X. Fan Y. Shahanawaz J. Shmookler Reis R.J. Varughese K.I. Sawamura T. Mehta J.L. Cross-Talk between LOX-1 and PCSK9 in Vascular Tissues Cardiovasc. Res. 2015 107 556 567 10.1093/cvr/cvv178 26092101 49. Cappelluti M.A. Mollica Poeta V. Valsoni S. Quarato P. Merlin S. Merelli I. Lombardo A. Durable and Efficient Gene Silencing in Vivo by Hit-and-Run Epigenome Editing Nature 2024 627 416 423 10.1038/s41586-024-07087-8 38418872 PMC10937395 50. Reduction of Low-Density Lipoprotein Cholesterol by Monoclonal Antibody Inhibition of PCSK9 | Annual Reviews Available online: https://www.annualreviews.org/content/journals/10.1146/annurev-med-022613-090402 (accessed on 7 December 2024) 51. Tang Y. Li S.-L. Hu J.-H. Sun K.-J. Liu L.-L. Xu D.-Y. Research Progress on Alternative Non-Classical Mechanisms of PCSK9 in Atherosclerosis in Patients with and without Diabetes Cardiovasc. Diabetol. 2020 19 33 10.1186/s12933-020-01009-4 32169071 PMC7071562 52. Guan Y. Liu X. Yang Z. Zhu X. Liu M. Du M. Pan X. Wang Y. PCSK9 Promotes LDLR Degradation by Preventing SNX17-Mediated LDLR Recycling Circulation 2025 151 1512 1526 10.1161/CIRCULATIONAHA.124.072336 40071387 53. Ding Z. Wang X. Liu S. Shahanawaz J. Theus S. Fan Y. Deng X. Zhou S. Mehta J.L. PCSK9 Expression in the Ischaemic Heart and Its Relationship to Infarct Size, Cardiac Function, and Development of Autophagy Cardiovasc. Res. 2018 114 1738 1751 10.1093/cvr/cvy128 29800228 54. Seidah N.G. Awan Z. Chrétien M. Mbikay M. PCSK9: A Key Modulator of Cardiovascular Health Circ. Res. 2014 114 1022 1036 10.1161/CIRCRESAHA.114.301621 24625727 55. Al Said S. O’Donoghue M.L. Ran X. Murphy S.A. Atar D. Keech A. Flores-Arredondo J.H. Wang B. Sabatine M.S. Giugliano R.P. Long-Term Lipid Lowering with Evolocumab in Older Individuals J. Am. Coll. Cardiol. 2025 85 504 512 10.1016/j.jacc.2024.11.019 39909681 56. Dhar K. Berger J. Newman J. Schwartzbard A. Pernia A.C.J. Weintraub H.S. Evolocumab in Older Individuals J. Am. Coll. Cardiol. 2025 85 513 514 10.1016/j.jacc.2024.11.043 39909682 57. Rosoff D.B. Wagner J. Jung J. Pacher P. Christodoulides C. Davey Smith G. Ray D. Lohoff F.W. Multiomic Mendelian Randomization Study Investigating the Impact of PCSK9 and HMGCR Inhibition on Type 2 Diabetes Across Five Populations Diabetes 2025 74 120 130 10.2337/db24-0451 39418486 PMC11664021 58. Rosoff D.B. Bell A.S. Wagner J. Mavromatis L.A. Hamandi A. Park L. Jung J. Lohoff F.W. Assessing the Impact of PCSK9 and HMGCR Inhibition on Liver Function: Drug-Target Mendelian Randomization Analyses in Four Ancestries Cell. Mol. Gastroenterol. Hepatol. 2024 17 29 40 10.1016/j.jcmgh.2023.09.001 37703945 PMC10665960 59. Rivera F.B. Cha S.W. Aparece J.P. Rocimo A. Ong B.A. Golbin J.M. Alfonso P.G. Enkhmaa B. Khan S.U. Cainzos-Achirica M. Sex Differences in Cardiovascular Outcomes and Cholesterol-Lowering Efficacy of PCSK9 Inhibitors JACC Adv. 2023 2 100669 10.1016/j.jacadv.2023.100669 38938736 PMC11198239 60. Hodeda L. Eisen A. Rotholz A. Kornowski R. Gurevitz C. Sex Differences in the Treatment with PCSK9 Monoclonal Antibodies- Real World Experience from a Dedicated Preventive Cardiology Clinic Am. J. Prev. Cardiol. 2025 23 101022 10.1016/j.ajpc.2025.101022 40677276 PMC12269634 61. Li H. Dong B. Park S.W. Lee H.-S. Chen W. Liu J. Hepatocyte Nuclear Factor 1α Plays a Critical Role in PCSK9 Gene Transcription and Regulation by the Natural Hypocholesterolemic Compound Berberine J. Biol. Chem. 2009 284 28885 28895 10.1074/jbc.M109.052407 19687008 PMC2781434 62. Guo Y. Yan B. Gui Y. Tang Z. Tai S. Zhou S. Zheng X. Physiology and Role of PCSK9 in Vascular Disease: Potential Impact of Localized PCSK9 in Vascular Wall J. Cell. Physiol. 2021 236 2333 2351 10.1002/jcp.30025 32875580 63. Ai D. Chen C. Han S. Ganda A. Murphy A.J. Haeusler R. Thorp E. Accili D. Horton J.D. Tall A.R. Regulation of Hepatic LDL Receptors by mTORC1 and PCSK9 in Mice J. Clin. Invest. 2012 122 1262 1270 10.1172/JCI61919 22426206 PMC3314476 64. Wang J. Zhao J. Yan C. Xi C. Wu C. Zhao J. Li F. Ding Y. Zhang R. Qi S. Identification and Evaluation of a Lipid-Lowering Small Compound in Preclinical Models and in a Phase I Trial Cell Metab. 2022 34 667 680.e6 10.1016/j.cmet.2022.03.006 35427476 65. Wang M. Shu H. Xie J. Huang Y. Wang K. Feng R. Yu X. Guan J. Feng W. Liu M. An Intron Mutation of HNF1A Causes Abnormal Splicing and Impairs Its Activity as a Transcription Factor Mol. Cell. Endocrinol. 2022 545 111575 10.1016/j.mce.2022.111575 35081418 66. Beucher A. Miguel-Escalada I. Balboa D. De Vas M.G. Maestro M.A. Garcia-Hurtado J. Bernal A. Gonzalez-Franco R. Vargiu P. Heyn H. The HASTER lncRNA Promoter Is a Cis-Acting Transcriptional Stabilizer of HNF1A Nat. Cell Biol. 2022 24 1528 1540 10.1038/s41556-022-00996-8 36202974 PMC9586874 67. Lu F. Li E. Gao Y. Zhang Y. Kong L. Yang X. Dapagliflozin Modulates Hepatic Lipid Metabolism through the Proprotein Convertase Subtilisin/Kexin Type 9/Low Density Lipoprotein Receptor Pathway Diabetes Obes. Metab. 2025 27 2096 2109 10.1111/dom.16202 39831337 68. Luo J. Yang H. Song B.-L. Mechanisms and Regulation of Cholesterol Homeostasis Nat. Rev. Mol. Cell Biol. 2020 21 225 245 10.1038/s41580-019-0190-7 31848472 69. Lebeau P.F. Byun J.H. Platko K. Saliba P. Sguazzin M. MacDonald M.E. Paré G. Steinberg G.R. Janssen L.J. Igdoura S.A. Caffeine Blocks SREBP2-Induced Hepatic PCSK9 Expression to Enhance LDLR-Mediated Cholesterol Clearance Nat. Commun. 2022 13 770 10.1038/s41467-022-28240-9 35140212 PMC8828868 70. Zhang X. Xu H. Yu J. Cui J. Chen Z. Li Y. Niu Y. Wang S. Ran S. Zou Y. Immune Regulation of the Liver Through the PCSK9/CD36 Pathway During Heart Transplant Rejection Circulation 2023 148 336 353 10.1161/CIRCULATIONAHA.123.062788 37232170 71. Liu J. Ma K.L. Zhang Y. Wu Y. Hu Z.B. Lv L.L. Tang R.N. Liu H. Ruan X.Z. Liu B.C. Activation of mTORC1 Disrupted LDL Receptor Pathway: A Potential New Mechanism for the Progression of Non-Alcoholic Fatty Liver Disease Int. J. Biochem. Cell Biol. 2015 61 8 19 10.1016/j.biocel.2015.01.011 25622557 72. Hao J.-W. Wang J. Guo H. Zhao Y.-Y. Sun H.-H. Li Y.-F. Lai X.-Y. Zhao N. Wang X. Xie C. CD36 Facilitates Fatty Acid Uptake by Dynamic Palmitoylation-Regulated Endocytosis Nat. Commun. 2020 11 4765 10.1038/s41467-020-18565-8 32958780 PMC7505845 73. Heather L.C. Gopal K. Srnic N. Ussher J.R. Redefining Diabetic Cardiomyopathy: Perturbations in Substrate Metabolism at the Heart of Its Pathology Diabetes 2024 73 659 670 10.2337/dbi23-0019 38387045 PMC11043056 74. Tan Y. Zhang Z. Zheng C. Wintergerst K.A. Keller B.B. Cai L. Mechanisms of Diabetic Cardiomyopathy and Potential Therapeutic Strategies: Preclinical and Clinical Evidence Nat. Rev. Cardiol. 2020 17 585 607 10.1038/s41569-020-0339-2 32080423 PMC7849055 75. Roubtsova A. Munkonda M.N. Awan Z. Marcinkiewicz J. Chamberland A. Lazure C. Cianflone K. Seidah N.G. Prat A. Circulating Proprotein Convertase Subtilisin/Kexin 9 (PCSK9) Regulates VLDLR Protein and Triglyceride Accumulation in Visceral Adipose Tissue Arterioscler. Thromb. Vasc. Biol. 2011 31 785 791 10.1161/ATVBAHA.110.220988 21273557 76. Levy E. Ouadda A.B.D. Spahis S. Sane A.T. Garofalo C. Grenier É. Emonnot L. Yara S. Couture P. Beaulieu J.-F. PCSK9 Plays a Significant Role in Cholesterol Homeostasis and Lipid Transport in Intestinal Epithelial Cells Atherosclerosis 2013 227 297 306 10.1016/j.atherosclerosis.2013.01.023 23422832 77. Rohrbach S. Li L. Novoyatleva T. Niemann B. Knapp F. Molenda N. Schulz R. Impact of PCSK9 on CTRP9-Induced Metabolic Effects in Adult Rat Cardiomyocytes Front. Physiol. 2021 12 593862 10.3389/fphys.2021.593862 33643060 PMC7904879 78. Jaafar A.K. Paulo-Ramos A. Rastoldo G. Veeren B. Planesse C. Bringart M. Rondeau P. Chemello K. Meilhac O. Lambert G.C. PCSK9 Deficiency Promotes the Development of Peripheral Neuropathy JCI Insight 2025 10 e183786 10.1172/jci.insight.183786 40338666 PMC12220952 79. Zeng H. Qin H. Liao M. Zheng E. Luo X. Xiao A. Li Y. Chen L. Wei L. Zhao L. CD36 Promotes de Novo Lipogenesis in Hepatocytes through INSIG2-Dependent SREBP1 Processing Mol. Metab. 2022 57 101428 10.1016/j.molmet.2021.101428 34974159 PMC8810570 80. Da Dalt L. Ruscica M. Bonacina F. Balzarotti G. Dhyani A. Di Cairano E. Baragetti A. Arnaboldi L. De Metrio S. Pellegatta F. PCSK9 Deficiency Reduces Insulin Secretion and Promotes Glucose Intolerance: The Role of the Low-Density Lipoprotein Receptor Eur. Heart J. 2019 40 357 368 10.1093/eurheartj/ehy357 29982592 81. Zaid A. Roubtsova A. Essalmani R. Marcinkiewicz J. Chamberland A. Hamelin J. Tremblay M. Jacques H. Jin W. Davignon J. Proprotein Convertase Subtilisin/Kexin Type 9 (PCSK9): Hepatocyte-Specific Low-Density Lipoprotein Receptor Degradation and Critical Role in Mouse Liver Regeneration Hepatology 2008 48 646 654 10.1002/hep.22354 18666258 82. Guo W. Gong Y. Gu Y. Fu Z. Fan H. Gao B. Zhu X. Fu J. Zhao Y. Sun M. Circulating PCSK9 Levels and 2-hPG Are Positively Correlated in Metabolic Diseases in a Chinese Han Population Lipids Health Dis. 2018 17 10.1186/s12944-018-0658-z PMC5772698 29343301 83. Wu Y. Shi J. Su Q. Yang Z. Qin L. Correlation Between Circulating PCSK9 Levels and Gestational Diabetes Mellitus in a Chinese Population Front. Endocrinol. 2022 13 826757 10.3389/fendo.2022.826757 PMC9043651 35498417 84. Nelson C.P. Lai F.Y. Nath M. Ye S. Webb T.R. Schunkert H. Samani N.J. Genetic Assessment of Potential Long-Term On-Target Side Effects of PCSK9 (Proprotein Convertase Subtilisin/Kexin Type 9) Inhibitors Circ. Genomic Precis. Med. 2019 12 e002196 10.1161/CIRCGEN.118.002196 30645167 85. Ray K.K. Colhoun H.M. Szarek M. Baccara-Dinet M. Bhatt D.L. Bittner V.A. Budaj A.J. Diaz R. Goodman S.G. Hanotin C. Effects of Alirocumab on Cardiovascular and Metabolic Outcomes after Acute Coronary Syndrome in Patients with or without Diabetes: A Prespecified Analysis of the ODYSSEY OUTCOMES Randomised Controlled Trial Lancet Diabetes Endocrinol. 2019 7 618 Erratum in Lancet Diabetes Endocrinol. 2019 7 628 10.1016/S2213-8587(19)30158-5 31272931 86. Nishikido T. Ray K.K. Targeting the Peptidase PCSK9 to Reduce Cardiovascular Risk: Implications for Basic Science and Upcoming Challenges Br. J. Pharmacol. 2021 178 2168 2185 10.1111/bph.14851 31465540 87. Nicholls S.J. PCSK9 Inhibitors and Reduction in Cardiovascular Events: Current Evidence and Future Perspectives Pol. Heart J. Kardiologia Pol. 2023 81 115 122 10.33963/KP.a2023.0030 36739653 88. McClintick D.J. O’Donoghue M.L. De Ferrari G.M. Ferreira J. Ran X. Im K. López J.A.G. Elliott-Davey M. Wang B. Monsalvo M.L. Long-Term Efficacy of Evolocumab in Patients With or Without Multivessel Coronary Disease J. Am. Coll. Cardiol. 2024 83 652 664 10.1016/j.jacc.2023.11.029 38325990 89. Imbalzano E. Ilardi F. Orlando L. Pintaudi B. Savarese G. Rosano G. The Efficacy of PCSK9 Inhibitors on Major Cardiovascular Events and Lipid Profile in Patients with Diabetes: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Eur. Heart J.-Cardiovasc. Pharmacother. 2023 9 318 327 10.1093/ehjcvp/pvad019 36972610 90. Ray K.K. Del Prato S. Müller-Wieland D. Cariou B. Colhoun H.M. Tinahones F.J. Domenger C. Letierce A. Mandel J. Samuel R. Alirocumab Therapy in Individuals with Type 2 Diabetes Mellitus and Atherosclerotic Cardiovascular Disease: Analysis of the ODYSSEY DM-DYSLIPIDEMIA and DM-INSULIN Studies Cardiovasc. Diabetol. 2019 18 149 10.1186/s12933-019-0951-9 31706300 PMC6842201 91. Fischer L.T. Hochfellner D.A. Knoll L. Pöttler T. Mader J.K. Aberer F. Real-World Data on Metabolic Effects of PCSK9 Inhibitors in a Tertiary Care Center in Patients with and without Diabetes Mellitus Cardiovasc. Diabetol. 2021 20 89 10.1186/s12933-021-01283-w 33894772 PMC8070307 92. Rosenson R.S. Daviglus M.L. Handelsman Y. Pozzilli P. Bays H. Monsalvo M.L. Elliott-Davey M. Somaratne R. Reaven P. Efficacy and Safety of Evolocumab in Individuals with Type 2 Diabetes Mellitus: Primary Results of the Randomised Controlled BANTING Study Diabetologia 2019 62 948 958 10.1007/s00125-019-4856-7 30953107 PMC6509076 93. Chen Y. Yuan Z. Lu J. Eliaschewitz F.G. Lorenzatti A.J. Monsalvo M.L. Wang N. Hamer A.W. Ge J. Randomized Study of Evolocumab in Patients with Type 2 Diabetes and Dyslipidaemia on Background Statin: Pre-specified Analysis of the Chinese Population from the BERSON Clinical Trial Diabetes Obes. Metab. 2019 21 1464 1473 10.1111/dom.13700 30851062 PMC6594089 94. Sabatine M.S. Leiter L.A. Wiviott S.D. Giugliano R.P. Deedwania P. De Ferrari G.M. Murphy S.A. Kuder J.F. Gouni-Berthold I. Lewis B.S. Cardiovascular Safety and Efficacy of the PCSK9 Inhibitor Evolocumab in Patients with and without Diabetes and the Effect of Evolocumab on Glycaemia and Risk of New-Onset Diabetes: A Prespecified Analysis of the FOURIER Randomised Controlled Trial Lancet Diabetes Endocrinol. 2017 5 941 950 10.1016/S2213-8587(17)30313-3 28927706 95. Moura F.A. Kamanu F.K. Wiviott S.D. Giugliano R.P. Udler M.S. Florez J.C. Ellinor P.T. Sabatine M.S. Ruff C.T. Marston N.A. Type 2 Diabetes Genetic Risk and Incident Diabetes across Diabetes Risk Enhancers Diabetes Obes. Metab. 2025 27 1287 1295 10.1111/dom.16123 39696834 96. Mousavi A. Shojaei S. Soleimani H. Semirani-Nezhad D. Ebrahimi P. Zafari A. Ebrahimi R. Roozbehi K. Harrison A. Syed M.A. Safety, Efficacy, and Cardiovascular Benefits of Combination Therapy with SGLT-2 Inhibitors and GLP-1 Receptor Agonists in Patients with Diabetes Mellitus: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Diabetol. Metab. Syndr. 2025 17 68 10.1186/s13098-025-01635-6 39994802 PMC11849334 97. Yang S.-H. Xu R.-X. Cui C.-J. Wang Y. Du Y. Chen Z.-G. Yao Y.-H. Ma C.-Y. Zhu C.-G. Guo Y.-L. Liraglutide Downregulates Hepatic LDL Receptor and PCSK9 Expression in HepG2 Cells and Db/Db Mice through a HNF-1a Dependent Mechanism Cardiovasc. Diabetol. 2018 17 48 10.1186/s12933-018-0689-9 29618348 PMC5885408 98. Vergès B. Duvillard L. de Barros J.P.P. Bouillet B. Baillot-Rudoni S. Rouland A. Petit J.M. Degrace P. Demizieux L. Liraglutide Increases the Catabolism of Apolipoprotein B100–Containing Lipoproteins in Patients with Type 2 Diabetes and Reduces Proprotein Convertase Subtilisin/Kexin Type 9 Expression Diabetes Care 2021 44 1027 1037 10.2337/dc20-1843 33531418 99. Tricò D. Raggi F. Distaso M. Ferrannini E. Solini A. Effect of Empagliflozin on Plasma Proprotein Convertase Subtilisin/Kexin Type 9 (PCSK9) in Patients with Type 2 Diabetes Diabetes Res. Clin. Pract. 2022 190 109983 10.1016/j.diabres.2022.109983 35803317 100. Hu D. Guo Y. Wu R. Shao T. Long J. Yu B. Wang H. Luo Y. Lu H. Zhang J. New Insight into Metformin-Induced Cholesterol-Lowering Effect Crosstalk Between Glucose and Cholesterol Homeostasis via ChREBP (Carbohydrate-Responsive Element-Binding Protein)-Mediated PCSK9 (Proprotein Convertase Subtilisin/Kexin Type 9) Regulation Arterioscler. Thromb. Vasc. Biol. 2021 41 e208 e223 10.1161/ATVBAHA.120.315708 33535788 101. Amput P. Palee S. Arunsak B. Pratchayasakul W. Thonusin C. Kerdphoo S. Jaiwongkam T. Chattipakorn S.C. Chattipakorn N. PCSK9 Inhibitor and Atorvastatin Reduce Cardiac Impairment in Ovariectomized Prediabetic Rats via Improved Mitochondrial Function and Ca 2+ J. Cell. Mol. Med. 2020 24 9189 9203 10.1111/jcmm.15556 32628813 PMC7417720 102. Hummelgaard S. Hvid H. Birn H. Glerup S. Tom N. Bilgin M. Kirchhoff J.E. Weyer K. Lack of Renoprotective Effects by Long-Term PCSK9 and SGLT2 Inhibition Using Alirocumab and Empagliflozin in Obese ZSF1 Rats Am. J. Physiol.-Ren. Physiol. 2025 328 F48 F67 10.1152/ajprenal.00065.2024 39556312 103. Miao J. Manthena P.V. Haas M.E. Ling A.V. Shin D.-J. Graham M.J. Crooke R.M. Liu J. Biddinger S.B. Role of Insulin in the Regulation of Proprotein Convertase Subtilisin/Kexin Type 9 Arterioscler. Thromb. Vasc. Biol. 2015 35 1589 1596 10.1161/ATVBAHA.115.305688 26023080 PMC4484737 104. Niesen M. Bedi M. Lopez D. Diabetes Alters LDL Receptor and PCSK9 Expression in Rat Liver Arch. Biochem. Biophys. 2008 470 111 115 10.1016/j.abb.2007.11.009 18054320 105. Persson L. Gälman C. Angelin B. Rudling M. Importance of Proprotein Convertase Subtilisin/Kexin Type 9 in the Hormonal and Dietary Regulation of Rat Liver Low-Density Lipoprotein Receptors Endocrinology 2009 150 1140 1146 10.1210/en.2008-1281 19008317 106. Ruscica M. Macchi C. Giuliani A. Rizzuto A.S. Ramini D. Sbriscia M. Carugo S. Bonfigli A.R. Corsini A. Olivieri F. Circulating PCSK9 as a Prognostic Biomarker of Cardiovascular Events in Individuals with Type 2 Diabetes: Evidence from a 16.8-Year Follow-up Study Cardiovasc. Diabetol. 2023 22 222 10.1186/s12933-023-01948-8 37620933 PMC10464486 107. Huang J. Gu J.-X. Wang K. Zhang A.-M. Hong T.-T. Li S.-S. Yao X.-Q. Yang M. Yin Y. Zhang N. Association between Serum PCSK9 and Coronary Heart Disease in Patients with Type 2 Diabetes Mellitus Diabetol. Metab. Syndr. 2023 15 260 10.1186/s13098-023-01238-z 38115042 PMC10731704 108. Brouwers M.C.G.J. Troutt J.S. Van Greevenbroek M.M.J. Ferreira I. Feskens E.J. Van Der Kallen C.J.H. Schaper N.C. Schalkwijk C.G. Konrad R.J. Stehouwer C.D.A. Plasma Proprotein Convertase Subtilisin Kexin Type 9 Is Not Altered in Subjects with Impaired Glucose Metabolism and Type 2 Diabetes Mellitus, but Its Relationship with Non-HDL Cholesterol and Apolipoprotein B May Be Modified by Type 2 Diabetes Mellitus: The CODAM Study Atherosclerosis 2011 217 263 267 10.1016/j.atherosclerosis.2011.03.023 21497351 109. Ding Z. Liu S. Wang X. Theus S. Deng X. Fan Y. Zhou S. Mehta J.L. PCSK9 Regulates Expression of Scavenger Receptors and Ox-LDL Uptake in Macrophages Cardiovasc. Res. 2018 114 1145 1153 Erratum in Cardiovasc. Res. 2022 118 10.1093/cvr/cvy079 29617722 110. Ridker P.M. Rifai N. Bradwin G. Rose L. Plasma Proprotein Convertase Subtilisin/Kexin Type 9 Levels and the Risk of First Cardiovascular Events Eur. Heart J. 2016 37 554 560 10.1093/eurheartj/ehv568 26508163 PMC4744620 111. Ravi A. Koyama S. Ellinor P.T. Natarajan P. Genetic Predisposition to Low-Density Lipoprotein Cholesterol and Incident Type 2 Diabetes JAMA Cardiol. 2025 10 379 10.1001/jamacardio.2024.5072 39813027 PMC11983226 112. Armentaro G. Carbone F. Cassano V. Liberale L. Minetti S. Bertolotto M.B. Mannino G. Fiorentino T.V. Perticone M. Succurro E. Serum Proprotein Convertase Subtilisin/Kexin Type 9 and Vascular Disease in Type 2 Diabetic Patients Eur. J. Clin. Invest. 2023 53 e13900 10.1111/eci.13900 36346620 113. Schmidt A.F. Swerdlow D.I. Holmes M.V. Patel R.S. Fairhurst-Hunter Z. Lyall D.M. Hartwig F.P. Horta B.L. Hyppönen E. Power C. PCSK9 Genetic Variants and Risk of Type 2 Diabetes: A Mendelian Randomisation Study Lancet Diabetes Endocrinol. 2017 5 97 105 10.1016/S2213-8587(16)30396-5 27908689 PMC5266795 114. Sarkar S.K. Matyas A. Asikhia I. Hu Z. Golder M. Beehler K. Kosenko T. Lagace T.A. Pathogenic Gain-of-Function Mutations in the Prodomain and C-Terminal Domain of PCSK9 Inhibit LDL Binding Front. Physiol. 2022 13 960272 10.3389/fphys.2022.960272 36187800 PMC9515655 115. Laudette M. Cardiomyocyte-Specific PCSK9 Deficiency Compromises Mitochondrial Bioenergetics and Heart Function J. Mol. Cell. Cardiol. 2022 173 S184 10.1016/j.yjmcc.2022.08.348 PMC10318396 36880401 116. Tremblay F. Xiong Q. Shah S.S. Ko C.-W. Kelly K. Morrison M.S. Giancarlo C. Ramirez R.N. Hildebrand E.M. Voytek S.B. A Potent Epigenetic Editor Targeting Human PCSK9 for Durable Reduction of Low-Density Lipoprotein Cholesterol Levels Nat. Med. 2025 31 1329 1338 10.1038/s41591-025-03508-x 39930141 PMC12003160 117. Scalise V. Sanguinetti C. Neri T. Cianchetti S. Lai M. Carnicelli V. Celi A. Pedrinelli R. PCSK9 Induces Tissue Factor Expression by Activation of TLR4/NFkB Signaling Int. J. Mol. Sci. 2021 22 12640 10.3390/ijms222312640 34884442 PMC8657476 118. Punch E. Klein J. Diaba-Nuhoho P. Morawietz H. Garelnabi M. Effects of PCSK9 Targeting: Alleviating Oxidation, Inflammation, and Atherosclerosis J. Am. Heart Assoc. Cardiovasc. Cerebrovasc. Dis. 2022 11 e023328 10.1161/JAHA.121.023328 PMC9238481 35048716 119. Jang H.-D. Lee S.E. Yang J. Lee H.-C. Shin D. Lee H. Lee J. Jin S. Kim S. Lee S.J. Cyclase-Associated Protein 1 Is a Binding Partner of Proprotein Convertase Subtilisin/Kexin Type-9 and Is Required for the Degradation of Low-Density Lipoprotein Receptors by Proprotein Convertase Subtilisin/Kexin Type-9 Eur. Heart J. 2020 41 239 252 10.1093/eurheartj/ehz566 31419281 PMC6945527 120. Lee S. Lee H.-C. Kwon Y.-W. Lee S.E. Cho Y. Kim J. Lee S. Kim J.-Y. Lee J. Yang H.-M. Adenylyl Cyclase-Associated Protein 1(CAP1) Is a Receptor for Human Resistin and Mediates Inflammatory Actions of Human Monocytes Cell Metab. 2014 19 484 497 10.1016/j.cmet.2014.01.013 24606903 PMC3969988 121. Tuñón J. Badimón L. Bochaton-Piallat M.-L. Cariou B. Daemen M.J. Egido J. Evans P.C. Hoefer I.E. Ketelhuth D.F.J. Lutgens E. Identifying the Anti-Inflammatory Response to Lipid Lowering Therapy: A Position Paper from the Working Group on Atherosclerosis and Vascular Biology of the European Society of Cardiology Cardiovasc. Res. 2019 115 10 19 10.1093/cvr/cvy293 30534957 PMC6302260 122. Chung C.-C. Kao Y.-H. Chen Y.-C. Lin Y.-K. Higa S. Hsu K.-C. Chen Y.-J. PCSK9 Enhances Cardiac Fibrogenesis via the Activation of Toll-like Receptor and NLRP3 Inflammasome Signaling Int. J. Mol. Sci. 2025 26 1921 10.3390/ijms26051921 40076547 PMC11900342 123. Huang L. Li Y. Cheng Z. Lv Z. Luo S. Xia Y. PCSK9 Promotes Endothelial Dysfunction During Sepsis Via the TLR4/MyD88/NF-κB and NLRP3 Pathways Inflammation 2023 46 115 128 10.1007/s10753-022-01715-z 35930089 124. Huang L. Li Y. Cheng Z. Lv Z. Luo S. Xia Y. PCSK9 Promotes Endothelial Dysfunction in Sepsis via TLR4/MyD88/NF-κB and NLRP3 Pathways Research Square 2022 10.1007/s10753-022-01715-z 35930089 125. Badimon L. Luquero A. Crespo J. Peña E. Borrell-Pages M. PCSK9 and LRP5 in Macrophage Lipid Internalization and Inflammation Cardiovasc. Res. 2021 117 2054 2068 10.1093/cvr/cvaa254 32991689 126. Wang X. Li X. Liu S. Brickell A.N. Zhang J. Wu Z. Zhou S. Ding Z. PCSK9 Regulates Pyroptosis via mtDNA Damage in Chronic Myocardial Ischemia Basic Res. Cardiol. 2020 115 66 10.1007/s00395-020-00832-w 33180196 127. Zhang M. Chen Y. Qiu Y. Sun J. He J. Liu Z. Shi J. Wei W. Wu G. Liang J. PCSK9 Promotes Hypoxia-Induced EC Pyroptosis by Regulating Smac Mitochondrion-Cytoplasm Translocation in Critical Limb Ischemia JACC Basic Transl. Sci. 2023 8 1060 1077 10.1016/j.jacbts.2023.05.016 37791316 PMC10544082 128. Jiang K. Tu Z. Chen K. Xu Y. Chen F. Xu S. Shi T. Qian J. Shen L. Hwa J. Gasdermin D Inhibition Confers Antineutrophil-Mediated Cardioprotection in Acute Myocardial Infarction J. Clin. Invest. 2022 132 e151268 10.1172/JCI151268 34752417 PMC8718151 129. Zhang W. Thompson B.J. Hietakangas V. Cohen S.M. MAPK/ERK Signaling Regulates Insulin Sensitivity to Control Glucose Metabolism in Drosophila PLoS Genet. 2011 7 e1002429 10.1371/journal.pgen.1002429 22242005 PMC3248469 130. Ridker P.M. Everett B.M. Thuren T. MacFadyen J.G. Chang W.H. Ballantyne C. Fonseca F. Nicolau J. Koenig W. Anker S.D. Antiinflammatory Therapy with Canakinumab for Atherosclerotic Disease N. Engl. J. Med. 2017 377 1119 1131 10.1056/NEJMoa1707914 28845751 131. Everett B.M. Cornel J.H. Lainscak M. Anker S.D. Abbate A. Thuren T. Libby P. Glynn R.J. Ridker P.M. Anti-Inflammatory Therapy With Canakinumab for the Prevention of Hospitalization for Heart Failure Circulation 2019 139 1289 1299 10.1161/CIRCULATIONAHA.118.038010 30586730 132. Maurea N. Bisceglia I. Paccone A. Buccolo S. Iovine M. Quagliariello V. Dapagliflozin Reduces Systemic Pcsk9 Levels in Preclinical Models of Short-Term Doxorubicin Cardiotoxicity through Nlrp3 Inflammasome/Il-1β: A First Evidence of Sglt-2/Pcsk9 Cross-Talk in Cardioncology J. Am. Coll. Cardiol. 2023 81 2269 10.1016/S0735-1097(23)02713-4 133. Higashikuni Y. Liu W. Numata G. Tanaka K. Fukuda D. Tanaka Y. Hirata Y. Imamura T. Takimoto E. Komuro I. NLRP3 Inflammasome Activation Through Heart-Brain Interaction Initiates Cardiac Inflammation and Hypertrophy During Pressure Overload Circulation 2023 147 338 355 10.1161/CIRCULATIONAHA.122.060860 36440584 134. Ding M. Shi R. Du Y. Chang P. Gao T. De D. Chen Y. Li M. Li J. Li K. O-GlcNAcylation-Mediated Endothelial Metabolic Memory Contributes to Cardiac Damage via Small Extracellular Vesicles Cell Metab. 2025 37 1344 1363.e6 10.1016/j.cmet.2025.03.006 40179889 135. Liu Y. Yang Y. Xu C. Liu J. Chen J. Li G. Huang B. Pan Y. Zhang Y. Wei Q. Circular RNA circGlis3 Protects against Islet β-Cell Dysfunction and Apoptosis in Obesity Nat. Commun. 2023 14 351 10.1038/s41467-023-35998-z 36681689 PMC9867769 136. Duan Y. Li Q. Wu J. Zhou C. Liu X. Yue J. Chen X. Liu J. Zhang Q. Zhang Y. A Detrimental Role of Endothelial S1PR2 in Cardiac Ischemia-Reperfusion Injury via Modulating Mitochondrial Dysfunction, NLRP3 Inflammasome Activation, and Pyroptosis Redox Biol. 2024 75 103244 10.1016/j.redox.2024.103244 38909407 PMC11254837 137. Li J.-P. Qiu S. Tai G.-J. Liu Y.-M. Wei W. Fu M.-M. Fang P.-Q. Otieno J.N. Battulga T. Li X.-X. NLRP3 Inflammasome-Modulated Angiogenic Function of EPC via PI3K/ Akt/mTOR Pathway in Diabetic Myocardial Infarction Cardiovasc. Diabetol. 2025 24 6 10.1186/s12933-024-02541-3 39762890 PMC11705910 138. Wang X. Liu L. Zhai L. Palade P. Wang X. Mehta J.L. Direct Impact of PCSK9 on SMC Senescence and Apoptosis: A New Focus in Cardiovascular Diseases Arterioscler. Thromb. Vasc. Biol. 2024 44 1491 1496 10.1161/ATVBAHA.124.320140 38924434 139. D’Onofrio N. Prattichizzo F. Marfella R. Sardu C. Martino E. Scisciola L. Marfella L. Grotta R.L. Frigé C. Paolisso G. SIRT3 Mediates the Effects of PCSK9 Inhibitors on Inflammation, Autophagy, and Oxidative Stress in Endothelial Cells Theranostics 2023 13 531 542 10.7150/thno.80289 36632236 PMC9830434 140. Ouyang Z. Ma M. Zhang Z. Wu H. Xue Y. Jian Y. Yin K. Yu S. Zhao C. Guo W. Targeted Degradation of PCSK9 In Vivo by Autophagy-Tethering Compounds J. Med. Chem. 2024 67 433 449 10.1021/acs.jmedchem.3c01634 38112492 141. Xu Q. Zhao Y. He N. Gao R. Xu W. Zhuo X. Ren Z. Wu C. Liu L. PCSK9: A Emerging Participant in Heart Failure Biomed. Pharmacother. 2023 158 114106 10.1016/j.biopha.2022.114106 36535197 142. Luo C. Fang C. Zou R. Jiang J. Zhang M. Ge T. Zhou H. Fan X. Zheng B. Zeng Z. Hyperglycemia-Induced DNA Damage Response Activates DNA-PK Complex to Promote Endothelial Ferroptosis in Type 2 Diabetic Cardiomyopathy Theranostics 2025 15 4507 4525 10.7150/thno.109514 40225587 PMC11984385 143. Tang Z.-H. Peng J. Ren Z. Yang J. Li T.-T. Li T.-H. Wang Z. Wei D.-H. Liu L.-S. Zheng X.-L. New Role of PCSK9 in Atherosclerotic Inflammation Promotion Involving the TLR4/NF-κB Pathway Atherosclerosis 2017 262 113 122 10.1016/j.atherosclerosis.2017.04.023 28535426 144. Chen Z. Li S. Liu M. Yin M. Chen J. Li Y. Li Q. Zhou Y. Xia Y. Chen A. Nicorandil Alleviates Cardiac Microvascular Ferroptosis in Diabetic Cardiomyopathy: Role of the Mitochondria-Localized AMPK-Parkin-ACSL4 Signaling Pathway Pharmacol. Res. 2024 200 107057 10.1016/j.phrs.2024.107057 38218357 145. Wolf A. Kutsche H.S. Schreckenberg R. Weber M. Li L. Rohrbach S. Schulz R. Schlüter K.-D. Autocrine Effects of PCSK9 on Cardiomyocytes Basic Res. Cardiol. 2020 115 65 10.1007/s00395-020-00824-w 33169229 PMC7652747 146. Da Dalt L. Castiglioni L. Baragetti A. Audano M. Svecla M. Bonacina F. Pedretti S. Uboldi P. Benzoni P. Giannetti F. PCSK9 Deficiency Rewires Heart Metabolism and Drives Heart Failure with Preserved Ejection Fraction Eur. Heart J. 2021 42 3078 3090 10.1093/eurheartj/ehab431 34252181 PMC8380058 147. Laudette M. Lindbom M. Cinato M. Bergh P.-O. Skålén K. Muhammad A. Miljanovic A. Czuba T. Perkins R. Smith J.G. PCSK9 Regulates Cardiac Mitochondrial Cholesterol by Promoting TSPO Degradation Circ. Res. 2025 136 924 942 10.1161/CIRCRESAHA.124.325629 40171648 148. Xu B. Wan S. Wu Q. Xing Y. He Y. Huang W. Long Y. Zhang C. Xu Y. Jiang Z. BDH1 Overexpression Alleviates Diabetic Cardiomyopathy through Inhibiting H3K9bhb-Mediated Transcriptional Activation of LCN2 Cardiovasc. Diabetol. 2025 24 101 10.1186/s12933-025-02646-3 40022118 PMC11871690 149. Cai D. Liu C. Li H. Wang C. Bai L. Feng J. Hu M. Wang H. Song S. Xie Y. Foxk1 and Foxk2 Promote Cardiomyocyte Proliferation and Heart Regeneration Nat. Commun. 2025 16 2877 10.1038/s41467-025-57996-z 40128196 PMC11933303 150. Ahmed E.I. Moneam Shamardl H.A. Elsayed A.M. Sadik S.A. Evolocumab Ameliorates Myocardial Fibrosis and Improves Metabolic Syndrome–Induced Cardiac Dysfunction in Rats via Inhibiting PCSK9/NLRP3 Inflammasome and Caspase-1/IL-1β Pathways Eur. J. Pharmacol. 2025 998 177499 10.1016/j.ejphar.2025.177499 40064223 151. Bao H. Wang X. Zhou H. Zhou W. Liao F. Wei F. Yang S. Luo Z. Li W. PCSK9 Regulates Myofibroblast Transformation through the JAK2/STAT3 Pathway to Regulate Fibrosis after Myocardial Infarction Biochem. Pharmacol. 2024 220 115996 10.1016/j.bcp.2023.115996 38154546 152. Huang Q. Zhou Z. Xu L. Zhan P. Huang G. PCSK9 Inhibitor Attenuates Cardiac Fibrosis in Reperfusion Injury Rat by Suppressing Inflammatory Response and TGF-Β1/Smad3 Pathway Biochem. Pharmacol. 2024 230 116563 10.1016/j.bcp.2024.116563 39362501 153. Wu C. Lin D. Ji J. Jiang Y. Jiang F. Wang Y. PCSK9 Inhibition Regulates Infarction-Induced Cardiac Myofibroblast Transdifferentiation via Notch1 Signaling Cell Biochem. Biophys. 2023 81 359 369 10.1007/s12013-023-01136-1 37081375 154. Wang S.-H. Cui L.-G. Su X.-L. Komal S. Ni R.-C. Zang M.-X. Zhang L.-R. Han S.-N. GSK-3β-Mediated Activation of NLRP3 Inflammasome Leads to Pyroptosis and Apoptosis of Rat Cardiomyocytes and Fibroblasts Eur. J. Pharmacol. 2022 920 174830 10.1016/j.ejphar.2022.174830 35182545 155. Dong Y. Wang B. Du M. Zhu B. Cui K. Li K. Yuan K. Cowan D.B. Bhattacharjee S. Wong S. Targeting Epsins to Inhibit Fibroblast Growth Factor Signaling While Potentiating Transforming Growth Factor-β Signaling Constrains Endothelial-to-Mesenchymal Transition in Atherosclerosis Circulation 2023 147 669 685 10.1161/CIRCULATIONAHA.122.063075 36591786 PMC10136057 156. Tuleta I. Hanna A. Humeres C. Aguilan J.T. Sidoli S. Zhu F. Frangogiannis N.G. Fibroblast-Specific TGF-β Signaling Mediates Cardiac Dysfunction, Fibrosis, and Hypertrophy in Obese Diabetic Mice Cardiovasc. Res. 2024 120 2047 2063 10.1093/cvr/cvae210 39373248 PMC12097992 157. Wu W. Bao W. Chen X. Lu Y. Fang J. Liu J. Peng S. Pi J. Tomlinson B. Chan P. Endothelial Gata6 Deletion Reduces Monocyte Recruitment and Proinflammatory Macrophage Formation and Attenuates Atherosclerosis through Cmpk2-Nlrp3 Pathways Redox Biol. 2023 64 102775 Erratum in Redox Biol. 2023 66 10.1016/j.redox.2023.102775 37339559 PMC10363430 158. Gao J.-J. Wu F.-Y. Liu Y.-J. Li L. Lin Y.-J. Kang Y.-T. Peng Y.-M. Liu Y.-F. Wang C. Ma Z.-S. Increase of PCSK9 Expression in Diabetes Promotes VEGFR2 Ubiquitination to Inhibit Endothelial Function and Skin Wound Healing Sci. China Life Sci. 2024 67 2635 2649 10.1007/s11427-023-2688-8 39153050 159. Zeng J. Tao J. Xi L. Wang Z. Liu L. PCSK9 Mediates the Oxidative Low-density Lipoprotein-induced Pyroptosis of Vascular Endothelial Cells via the UQCRC1/ROS Pathway Int. J. Mol. Med. 2021 47 53 10.3892/ijmm.2021.4886 33576442 PMC7895513 160. Marston N.A. Kamanu F.K. Melloni G.E.M. Schnitzler G. Hakim A. Ma R.X. Kang H. Chasman D.I. Giugliano R.P. Ellinor P.T. Endothelial Cell-Related Genetic Variants Identify LDL Cholesterol-Sensitive Individuals Who Derive Greater Benefit from Aggressive Lipid Lowering Nat. Med. 2025 31 963 969 10.1038/s41591-025-03533-w 40011692 161. Zhao D. Huang Z.-K. Liang Y. Li Z.-J. Zhang X.-W. Li K.-H. Wu H. Zhang X.-D. Li C.-S. An D. Monocytes Release Pro-Cathepsin D to Drive Blood-to-Brain Transcytosis in Diabetes Circ. Res. 2024 134 e17 e33 10.1161/CIRCRESAHA.123.323622 38420756 162. Luo T. Guo W. Ji W. Du W. Lv Y. Feng Z. Monocyte CCL2 Signaling Possibly Contributes to Increased Asthma Susceptibility in Type 2 Diabetes Sci. Rep. 2025 15 10768 10.1038/s41598-025-95039-1 40155667 PMC11953320 163. Peng H. Pan Y. Sun Y. Wang X. Fan X. Wang Y. Zhao L. Li X. Dong Y. Chen J. Hyperglycemia Induces an Immunosuppressive Microenvironment in Colorectal Cancer Liver Metastases by Recruiting Peripheral Blood Monocytes through the CCL3-CCR1 Axis J. Immunother. Cancer 2025 13 e011310 10.1136/jitc-2024-011310 40550559 PMC12184404 164. Moens S.J.B. Neele A.E. Kroon J. Van Der Valk F.M. Van Den Bossche J. Hoeksema M.A. Hoogeveen R.M. Schnitzler J.G. Baccara-Dinet M.T. Manvelian G. PCSK9 Monoclonal Antibodies Reverse the Pro-Inflammatory Profile of Monocytes in Familial Hypercholesterolaemia Eur. Heart J. 2017 38 1584 1593 10.1093/eurheartj/ehx002 28329114 165. Krychtiuk K.A. Lenz M. Hohensinner P. Distelmaier K. Schrutka L. Kastl S.P. Huber K. Dostal E. Oravec S. Hengstenberg C. Circulating Levels of Proprotein Convertase Subtilisin/Kexin Type 9 (PCSK9) Are Associated with Monocyte Subsets in Patients with Stable Coronary Artery Disease J. Clin. Lipidol. 2021 15 512 521 10.1016/j.jacl.2021.02.005 33789832 166. Filatova A.Y. Afanasieva O.I. Arefieva T.I. Potekhina A.V. Tyurina A.V. Klesareva E.A. Razova O.A. Ezhov M.V. Pokrovsky S.N. The Concentration of PCSK9-Lp(a) Complexes and the Level of Blood Monocytes in Males with Coronary Atherosclerosis J. Pers. Med. 2023 13 1077 10.3390/jpm13071077 37511689 PMC10381556 167. Rosenson R.S. Tate A. Mar P. Grushko O. Chen Q. Goonewardena S.N. Inhibition of PCSK9 with Evolocumab Modulates Lipoproteins and Monocyte Activation in High-Risk ASCVD Subjects Atherosclerosis 2024 392 117529 10.1016/j.atherosclerosis.2024.117529 38583289 168. Desouky D.A. Nosair N.A. Salama M.K. El-Magd M.A. Desouky M.A. Sherif D.E. PCSK9 and Its Relationship with HMGB1, TLR4, and TNFα in Non-Statin and Statin-Treated Coronary Artery Disease Patients Mol. Cell. Biochem. 2025 480 2935 2949 10.1007/s11010-024-05154-2 39541017 169. Zhang Y.-Z. Wu Y. Li M. Mijiti A. Cheng L.-F. Identification of Macrophage Driver Genes in Fibrosis Caused by Different Heart Diseases Based on Omics Integration J. Transl. Med. 2024 22 839 10.1186/s12967-024-05624-7 39267173 PMC11391649 170. Mao J. Xia W. Wu Y. Li M. Zhao Y. Zhai P. Zhang Y. Zan T. Cui W. Sun X. Biosynthesis of Lysosomally Escaped Apoptotic Bodies Inhibits Inflammasome Synthesis in Macrophages Research 2025 8 0581 10.34133/research.0581 39850366 PMC11754539 171. Wolf S.J. Audu C.O. Moon J.Y. Joshi A.D. Melvin W.J. Barrett E.C. Mangum K. De Jimenez G.S. Rocco S. Buckley S. Diabetic Wound Keratinocytes Induce Macrophage JMJD3-Mediated Nlrp3 Expression via IL-1R Signaling Diabetes 2024 73 1462 1472 10.2337/db23-0968 38869447 PMC11333374 172. Lv D. Cao X. Zhong L. Dong Y. Xu Z. Rong Y. Xu H. Wang Z. Yang H. Yin R. Targeting Phenylpyruvate Restrains Excessive NLRP3 Inflammasome Activation and Pathological Inflammation in Diabetic Wound Healing Cell Rep. Med. 2023 4 101129 10.1016/j.xcrm.2023.101129 37480849 PMC10439185 173. Zhang X. McDonald J.G. Aryal B. Canfrán-Duque A. Goldberg E.L. Araldi E. Ding W. Fan Y. Thompson B.M. Singh A.K. Desmosterol Suppresses Macrophage Inflammasome Activation and Protects against Vascular Inflammation and Atherosclerosis Proc. Natl. Acad. Sci. USA 2021 118 e2107682118 10.1073/pnas.2107682118 34782454 PMC8617522 174. Zou Y. Chen Z. Zhang X. Yu J. Xu H. Cui J. Li Y. Niu Y. Zhou C. Xia J. Targeting PCSK9 Ameliorates Graft Vascular Disease in Mice by Inhibiting NLRP3 Inflammasome Activation in Vascular Smooth Muscle Cells Front. Immunol. 2022 13 894789 10.3389/fimmu.2022.894789 35720337 PMC9204514 175. Fang H. Shi M. Wang C. Zhang S. Kong N. Ji M. Wang Y. Zhou Y. Zhu Q. Zhang Y. PCSK9 Potentiates Innate Immune Response to RNA Viruses by Preventing AIP4-Mediated Polyubiquitination and Degradation of VISA/MAVS Proc. Natl. Acad. Sci. USA 2025 122 e2412206122 10.1073/pnas.2412206122 40233407 PMC11874596 176. Katsuki S. Jha P.K. Lupieri A. Nakano T. Passos L.S.A. Rogers M.A. Becker-Greene D. Le T.-D. Decano J.L. Ho Lee L. Proprotein Convertase Subtilisin/Kexin 9 (PCSK9) Promotes Macrophage Activation via LDL Receptor-Independent Mechanisms Circ. Res. 2022 131 873 889 10.1161/CIRCRESAHA.121.320056 36263780 PMC9973449 177. Yang C.-L. Zeng Y.-D. Hu Z.-X. Liang H. PCSK9 Promotes the Secretion of Pro-Inflammatory Cytokines by Macrophages to Aggravate H/R-Induced Cardiomyocyte Injury via Activating NF-κB Signalling Gen. Physiol. Biophys. 2020 39 123 134 10.4149/gpb_2019057 32329440 178. Xu R. Li T. Luo J. Zhang X. Wang T. Wang Y. Ma Y. Yang B. Jia J. Dmytriw A.A. PCSK9 CNS Neurosci. Ther. 2024 30 e14640 10.1111/cns.14640 38402551 PMC10894644 179. Song B. Zhang G. Bao Y. Zhang M. Involvement of Oxidative Stress-AMPK-Cx43-NLRP3 Pathway in Extracellular Matrix Remodeling of Gastric Smooth Muscle Cells in Rats with Diabetic Gastroparesis Cell Stress Chaperones 2024 29 440 455 10.1016/j.cstres.2024.04.005 38653383 PMC11087914 180. Wang X. Zhu L. Liu J. Ma Y. Qiu C. Liu C. Gong Y. Yuwen Y. Guan G. Zhang Y. Palmitic Acid in Type 2 Diabetes Mellitus Promotes Atherosclerotic Plaque Vulnerability via Macrophage Dll4 Signaling Nat. Commun. 2024 15 1281 10.1038/s41467-024-45582-8 38346959 PMC10861578 181. Mei W. Faraj Tabrizi S. Godina C. Lovisa A.F. Isaksson K. Jernström H. Tavazoie S.F. A Commonly Inherited Human PCSK9 Germline Variant Drives Breast Cancer Metastasis via LRP1 Receptor Cell 2025 188 371 389.e28 10.1016/j.cell.2024.11.009 39657676 PMC11770377 182. Wang L. Li S. Luo H. Lu Q. Yu S. PCSK9 Promotes the Progression and Metastasis of Colon Cancer Cells through Regulation of EMT and PI3K/AKT Signaling in Tumor Cells and Phenotypic Polarization of Macrophages J. Exp. Clin. Cancer Res. 2022 41 303 10.1186/s13046-022-02477-0 36242053 PMC9563506 183. Xu B. Li S. Fang Y. Zou Y. Song D. Zhang S. Cai Y. Proprotein Convertase Subtilisin/Kexin Type 9 Promotes Gastric Cancer Metastasis and Suppresses Apoptosis by Facilitating MAPK Signaling Pathway Through HSP70 Up-Regulation Front. Oncol. 2021 10 609663 10.3389/fonc.2020.609663 33489919 PMC7817950 184. Zhang Y. Su W. Ji X. Yang Z. Guan Q. Pang Y. Zhong L. Wang Y. Xiang J. PCSK9 Promotes Progression of Anaplastic Thyroid Cancer through E-Cadherin Endocytosis Cell Death Dis. 2025 16 362 10.1038/s41419-025-07690-1 40328788 PMC12056021 185. Rademaker G. Hernandez G.A. Seo Y. Dahal S. Miller-Phillips L. Li A.L. Peng X.L. Luan C. Qiu L. Liegeois M.A. PCSK9 Drives Sterol-Dependent Metastatic Organ Choice in Pancreatic Cancer Nature 2025 643 1381 1390 10.1038/s41586-025-09017-8 40399683 186. Chai M. He Y. Zhao W. Han X. Zhao G. Ma X. Qiao P. Shi D. Liu Y. Han W. Efficacy and Safety of Tafolecimab in Chinese Patients with Heterozygous Familial Hypercholesterolemia: A Randomized, Double-Blind, Placebo-Controlled Phase 3 Trial (CREDIT-2) BMC Med. 2023 21 77 10.1186/s12916-023-02797-8 36855099 PMC9976471 187. Koren M.J. Vega R.B. Agrawal N. Xu Y. Barbour A.M. Yu H. Wallerstedt E. Carter D. Middlemiss J. Twaddle L. An Oral PCSK9 Inhibitor for Treatment of Hypercholesterolemia J. Am. Coll. Cardiol. 2025 85 1996 2007 10.1016/j.jacc.2025.03.499 40167413 Figure 1 Mechanistic Pathways Linking Inflammation and Insulin Resistance. Legend: the red lines represent inhibitory effects. ",
  "metadata": {
    "Title of this paper": "An Oral PCSK9 Inhibitor for Treatment of Hypercholesterolemia",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467878/"
  }
}