{
  "title": "Paper_146",
  "abstract": "pmc Virulence Virulence 1371 viru Virulence 2150-5594 2150-5608 Taylor & Francis PMC12490000 PMC12490000.1 12490000 12490000 41025638 10.1080/21505594.2025.2566255 2566255 1 Version of Record Review Article Host Response Deciphering the immunomodulatory cross-talk: Bacterial extracellular vesicles in gut homeostasis H. YI ET AL. VIRULENCE https://orcid.org/0009-0004-9555-3915 Yi Hui Conceptualization Writing – original draft Writing – review & editing Li Mei Data curation Writing – review & editing Xu Le Writing – review & editing https://orcid.org/0000-0001-9511-4745 Mao Huajie Funding acquisition Resources Supervision Writing – review & editing Department of Clinical Laboratory, The People’s Hospital of Wenjiang Chengdu China CONTACT Huajie Mao 383185864@qq.com 30 9 2025 2025 16 1 478704 2566255 30 09 2025 03 10 2025 03 10 2025 Integra 30 9 2025 Integra 30 9 2025 16 3 2025 21 8 2025 21 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http://creativecommons.org/licenses/by/4.0/ ABSTRACT Within mammalian gastrointestinal ecosystems, trillions of microorganisms generate sophisticated ecological networks through bacterial extracellular vesicles (bEVs). Emerging evidence positions these bEVs as pivotal mediators in gut homeostasis maintenance and host-microbiota crosstalk, capable of transporting bioactive cargo including virulence determinants, genetic transfer components, and host-derived defense molecules. This molecular payload enables bEVs to exert multifaceted immunomodulatory effects through: 1) Immune cell activation and differentiation. 2) Microbial community regulation. 3) Epithelial barrier reinforcement. This review systematically examines current understanding of bEV biology: First, we characterize the structural complexity and compositional diversity of bEVs across bacterial species. Second, we elucidate the molecular machinery governing bEV biogenesis and secretion pathways. Third, we analyze mechanisms underlying bEV-immune interactions through receptor-mediated signaling and cargo delivery processes. By integrating recent advances in bEV immunobiology with mechanistic insights into host-pathobiont communication networks, our framework not only clarifies current knowledge gaps but also proposes standardized methodologies for future investigations. KEYWORDS Bacteria extracellular vesicles immunity intestinal tract No funding was received for this work. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction The gut, a vital organ with dual functions of digestion/absorption and intestinal defense, hosts a dynamic microbial ecosystem comprising thousands of bacterial species and over 10 trillion microorganisms [ 1 2 3 4 5 6 7 bEVs are spherical, bilayer lipid membrane-enclosed nanoparticles (20–350 nm in diameter) secreted by both pathogenic and commensal gut bacteria [ 8 9 10 11 12–16 17–19 This review synthesizes recent advances in bEV biology, focusing on their biogenesis, immunoregulatory functions, and interactions with host immune cells. We further evaluate the therapeutic potential of bEVs in modulating intestinal immunity and address current challenges in translating bEV research into clinical applications, including limitations in mechanistic understanding and methodological standardization. Classifications and biogenesis of bEVs The intestinal microbiota exhibits profound metabolic activity, with emerging evidence highlighting fecal bacterial extracellular vesicles (bEVs) as critical mediators of intercellular communication and energy exchange within the gut microenvironment. Bacteria can be classified as gram-negative or gram-positive according to gram staining, their EVs components and biogenetic pathways are different [ 20 21 Figure 1 22 23 Figure 1. Biogenesis models and types of bEVs. Gram-negative bacteria can release outer membrane vesicles (OMVs) by blebbing of the outer membrane and explosive outer membrane vesicles (EOMVs) and outer-inner membrane vesicles (OIMVs) by explosive cell lysis produce, respectively (above panel). In the explosive cell lysis pathway, phage-encoded endolysins are produced and destroy the bacterial envelope. Gram-positive bacteria can secretory cytoplasmic vesicles (CMVs) by blebbing of the outer membrane and explosive CMVs (ECMVs) via “bubbling cell death,” respectively (below panel). Bubbling cell death refers to endolysin creating holes in the cell wall through which the bacterial membrane can bulge, leading to the release of bEV. Over five decades of research have established that gram-negative bacteria employ three distinct vesiculation pathways, including OMVs [ 24 25 26 27 28 29 30 23 31 bEV is secreted from the surface of bacteria. Common methods for the extraction and purification of bEVs include ultrafiltration, density gradient centrifugation, ultracentrifugation, particle size exclusion chromatography, immunomagnetic bead separation, microfluidics, and aptamer-based magnetic separation [ 32 33 34 35 36 The structure and content of the many types of bEV mentioned above depend on how they are produced and secreted. bEV production is dynamically regulated by intrinsic bacterial factors (adhesion machinery, antibiotic resistance genes) and extrinsic parameters including host age, diet, gastrointestinal physiology, and microbial community structure [ 37–41 42 Substances in bEVs As nanoscale spherical transporters, bEVs feature a phospholipid bilayer encapsulating diverse bioactive components. Their outer membrane is uniquely characterized by the directional embedding of lipopolysaccharides (LPS) and outer membrane proteins [ 43 44 45 46 47 48 49 50 51 52–54 55 56 57 58 59 bEVs in intestinal immune regulation The intestinal barrier system, essential for maintaining gut homeostasis, comprises three interdependent layers: chemical, physical, and immune barriers [ 60–62 63 64 65 66 Bacterial extracellular vesicles (bEVs) serve as critical mediators of host-microbe crosstalk ( Figure 2 67 68 69 70 71 72 73 74 75 76 77 78 Table 1 81 82 83 84 85 86 5 87 69 71 75 78 7 88 Figure 2. The regulations of bEVs in intestinal immune. Multiple cargoes carried by bEVs are recognized as pathogen-associated molecular patterns by toll-like receptors (TLRs) on the cell surface or endosome. This activation induces the release of cytokines that promote the inflammatory process. Some vesicles can penetrate the mucosal barrier through the paracellular pathway, enter the bloodstream and spread in the body. Some of bEVs may carry small RNAs (sRNAs) that bind to host mRNA to regulate their function. Table 1. Comparative effects of commensal vs. pathogenic bEVs on immunity. Feature Commensal-Derived bEVs Pathogen-Derived bEVs Key Components Polysaccharides, anti-inflammatory miRNAs Toxins (e.g. CNF1, VacA), virulence factors TLR Activation TLR2/TLR4 (moderate; promotes Tregs) Cytokine Profile: ↑ IL-10, TGF-β; ↓ TNF-α Cytokine Profile ↑ IL-10, TGF-β; ↑ IL-1β, IL-8, TNF-α; Barrier Function Enhance epithelial integrity Disrupt tight junctions (e.g. via proteases) Immune Cell Targets Dendritic cells → Treg differentiation Macrophages → pyroptosis; Neutrophils → NETosis Clinical Association Protection in colitis (e.g. A. muciniphila) Sepsis, IBD exacerbation (e.g. EHEC) References [ 77 79 [ 71 80 Summarizing, the dual nature of bEVs – acting as both disruptors and regulators of intestinal barriers – underscores their pivotal role in gut homeostasis. These findings illuminate the sophisticated dialogue between gut microbiota and host immunity, providing mechanistic insights into microbial contributions to health and disease pathogenesis. bEVs and macrophage-mediated inflammation As key effectors of innate immunity, macrophages actively internalize bacterial extracellular vesicles (bEVs) that breach mucosal barriers. Similar to epithelial cells, macrophages respond to bEVs through TLR activation, triggering inflammatory mediator release [ 89 Table 2 Figure 3 80 90 106 107 108 91 92 93 78 94 109 95 96 Figure 3. The functions of bEVs with intestinal immune cells. Some of the bEVs secreted and released by bacteria are absorbed by epithelial cells and increase their cytokines release, and some are captured by immune cells after passing gut vascular barrier (GVB). The multiple cargo carried by bEVs is recognized by cell surface receptors (such as TLRs) and intracellular receptors (such as NODs) as pathogen-associated molecular patterns (PPRs). This activation induces the release of cytokines that promote inflammatory processes, such as the secretion of IL-8, and promotes recruitment and activity of neutrophils. Table 2. The function of bEVs in immune cells. Cell types Bacteria Effective contents Molecules Influences Reference Macrophages E. coli Virulence factors TNF-α↑ and IL-6↑ SIRS and sepsis [ 90 E. coli HlyF IL-1β↑ macrophages death [ 91 A. baumannii OmpA NA Disrupted the mitochondrial morphology [ 92 p. aeruginosa and S. typhimurium NLRC4 caspase-1↑ and IL-1β↑ Inflammation [ 93 Clostridium PI3K and MyD88 TNF↑, IL-6↑ and IL-1β↑ Inflammation [ 78 S. aureus NA IFN-β↑ Inflammation [ 94 B. anthracis edema toxins and lethal toxins NA Anthrax [ 95 B. thetaiotaomicron NA NA Colitis [ 96 DCs Bacteroides tenuis Gadd45α IL-10↑ anti-inflammation [ 77 L. paracasei COX-2, iNOS, NF-κB and NO TNF-α↓, IL-1α↓, IL-1β↓, IL-2↓, TGF-β↑ and IL-10↑ anti-inflammation [ 97 A. muciniphila NA NA Relieve colitis [ 79 V. cholerae  GM-CSF↑, IL-8↑, CCL20↑ and CCL2↑ T-cell polarization [ 98 H. pylori VacA IL-10↑ and IL-6↑ T cell apoptosis [ 99 Neutrophils H. pylori LPS IL-8↑ sepsis [ 100 101 NA MyD88 IL-6↑, TNF-α↑, MCP-1↑, ROS↑ and IL-10↑ Inflammation [ 102 S. aureus NA TNF↑, IL-12↑ and IL-6↑ Neutrophils polarization [ 103 E. coli CNF1 CD18↓ and CD11b↓ Reduce the phagocytosis and chemotaxis of neutrophils [ 104 105 NA: No accessible data in the study. Taken together, bEVs drive context-specific inflammation via TLR/NLR ligation and toxin delivery, with pathogen-derived vesicles promoting cytotoxicity (e.g. E. coli HlyF-induced pyroptosis) and commensal vesicles resolving inflammation [ 77 91 bEVs and dendritic cells with immunomodulatory effects bEVs activate dendritic cells (DCs) through pathogen-associated molecular patterns (PAMPs), which include surface-exposed molecules like lipopolysaccharides (LPS) and peptidoglycans, as well as intracellular components such as bacterial DNA ( Table 2 Figure 3 110 81 111 77 97 79 80 98 112 99 113 114 115 116 117 In summary, DC responses are cargo- and source-dependent: probiotic bEVs (e.g. B. thetaiotaomicron, L. paracasei) induce anti-inflammatory IL-10/TGF-β, while pathogenic bEVs (e.g. V. cholerae, H. pylori) drive Th17 polarization and immune evasion [ 77 97–99 A bidirectional immunomodulatory relationship between bEVs and neutrophils The interaction between gastric epithelial cells and Helicobacter pylori (H. pylori)-derived bEVs represents the earliest identified mechanism linking bacterial vesicles to neutrophil-mediated inflammation ( Table 2 118 100 Figure 3 119 101 120 121–123 102 124 125 103 104 105 To summarize, bEVs exhibit dose-dependent duality – low doses prime neutrophil activity (ROS/phagocytosis), while high doses induce tolerance (IL-10 ↑, migration ↓). Pathogen-derived vesicles (e.g. E. coli CNF1) directly subvert antimicrobial functions [ 102 104 119 Related diseases and therapeutic applications Given the significant role of bEVs in maintaining intestinal homeostasis, we can appropriately study their possible involvement in the occurrence and progression of intestinal-related diseases. Current research indicates that bEV plays a key role in various intestinal-related diseases, including infections, inflammatory bowel disease (IBD), and cancer. Many studies have discovered the role of bEV in infecting and harming the host. bEVs can promote the formation of biofilms and complex microbial communities [ 25 126 127 128 129 130 131 132 133 134 Due to the complex interaction between bEV and host cells, it may play a key role in the pathogenesis of diseases. Therefore, bEV can be applied in the treatment of diseases. bEVs demonstrate significant diagnostic potential, where 16S rRNA profiling effectively discriminates Crohn’s disease from ulcerative colitis, enabling noninvasive IBD diagnostics [ 135 36 136 137 138 139 Conclusion and future prospects The gut microbiota plays a pivotal role in modulating human health and disease pathogenesis. Bacterial extracellular vesicles (bEVs), nanosized particles secreted by gut microbes, carry a diverse cargo of bioactive molecules such as lipopolysaccharides, peptidoglycans, proteins, nucleic acids, and virulence factors. These components enable bEVs to participate in critical biological processes including bacterial communication, antibiotic resistance, host-microbe interactions, and immune regulation. Over the past decade, bEV research has advanced significantly, revealing their therapeutic potential in maintaining intestinal homeostasis, serving as drug delivery vehicles, and functioning as immune modulators. Current applications predominantly focus on vaccine development, targeted therapies, and diagnostic biomarker discovery. Notably, emerging evidence demonstrates growth phase-dependent variations in bEV composition, with selective enrichment of negatively charged lipoproteins containing signaling peptides in outer membrane vesicles (OMVs) [ 31 Critical unresolved questions persist regarding whether bEVs from dysbiotic microbiota contribute to extraintestinal pathologies and if engineered bEVs can overcome biological barriers for targeted drug delivery. Addressing these requires prioritized clinical initiatives: 1) establishment of standardized isolation protocols and reference bEV panels; 2) development of engineered bEV platforms with tunable immunogenicity; and 3) implementation of advanced technologies like AIEgen-based in vivo tracking and single-vesicle omics [ 36 31 88 136 137 36 135 Acknowledgements Huajie Mao conceived and outlined the review. Hui Yi wrote the manuscript and designed the figures. Mei Li coordinated the revision and manuscript preparation. Le Xe analyzed the literature. All authors read, edited, and approved the final manuscript. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement No new data are included in this article. Data in referenced prior studies may be accessible in the original works. References [1] Thursby E Juge N. Introduction to the human gut microbiota Biochem J 2017 474 11 1823 15 10.1042/BCJ20160510 28512250 PMC5433529 [2] Adak A Khan MR An insight into gut microbiota and its functionalities Cell Mol Life Sci 2019 76 3 473 493 10.1007/s00018-018-2943-4 30317530 PMC11105460 [3] Hill DA Artis D Intestinal bacteria and the regulation of immune cell homeostasis Annu Rev Immunol 2010 28 1 623 667 10.1146/annurev-immunol-030409-101330 20192812 PMC5610356 [4] Fung TC Olson CA Hsiao EY Interactions between the microbiota, immune and nervous systems in health and disease Nat Neurosci 2017 20 2 145 155 10.1038/nn.4476 28092661 PMC6960010 [5] Zheng D Liwinski T Elinav E Interaction between microbiota and immunity in health and disease Cell Res 2020 30 6 492 506 10.1038/s41422-020-0332-7 32433595 PMC7264227 [6] Jahromi LP Fuhrmann G Bacterial extracellular vesicles: understanding biology promotes applications as nanopharmaceuticals Adv Drug Deliv Rev 2021 173 125 140 10.1016/j.addr.2021.03.012 33774113 [7] Unal CM Schaar V Riesbeck K Bacterial outer membrane vesicles in disease and preventive medicine Semin Immunopathol 2011 33 5 395 408 10.1007/s00281-010-0231-y 21153593 [8] Xie J Haesebrouck F Van Hoecke L Bacterial extracellular vesicles: an emerging avenue to tackle diseases Trends Microbiol 2023 31 12 1206 1224 10.1016/j.tim.2023.05.010 37330381 [9] Liu H Zhang Q Wang S Bacterial extracellular vesicles as bioactive nanocarriers for drug delivery: advances and perspectives Bioact Mater 2022 14 169 181 10.1016/j.bioactmat.2021.12.006 35310361 PMC8892084 [10] Toyofuku M Schild S Kaparakis-Liaskos M Composition and functions of bacterial membrane vesicles Nat Rev Microbiol 2023 21 7 415 430 10.1038/s41579-023-00875-5 36932221 [11] Gill S Catchpole R Forterre P Extracellular membrane vesicles in the three domains of life and beyond FEMS Microbiol Rev 2019 43 3 273 303 10.1093/femsre/fuy042 30476045 PMC6524685 [12] Schwechheimer C Kuehn MJ Outer-membrane vesicles from Gram-negative bacteria: biogenesis and functions Nat Rev Microbiol 2015 13 10 605 619 10.1038/nrmicro3525 26373371 PMC5308417 [13] Li DF Yang MF Xu J Extracellular vesicles: the next generation theranostic nanomedicine for inflammatory bowel disease Int J Nanomed 2022 17 3893 3911 10.2147/IJN.S370784 PMC9462519 36092245 [14] Li Z Wang X Wang X Research progress on the role of extracellular vesicles in neurodegenerative diseases Transl NeurodeGener 2023 12 1 12 10.1186/s40035-023-00375-9 37697342 PMC10494410 [15] Meng F Xue X Yin Z Research progress of exosomes in bone diseases: mechanism, diagnosis and therapy Front Bioeng Biotechnol 2022 10 10 10.3389/fbioe.2022.866627 PMC9039039 35497358 [16] Yu YJ Wang XH Fan GC Versatile effects of bacterium-released membrane vesicles on mammalian cells and infectious/inflammatory diseases Acta Pharmacol Sin 2018 39 4 514 533 10.1038/aps.2017.82 28858295 PMC5888691 [17] Caruana JC Walper SA Bacterial membrane vesicles as mediators of microbe – microbe and microbe – host community interactions Front Micro Biol 2020 11 432 10.3389/fmicb.2020.00432 PMC7105600 32265873 [18] Sartorio MG Pardue EJ Feldman MF Bacterial outer membrane vesicles: from discovery to applications Annu Rev microbiol 2021 75 1 609 630 10.1146/annurev-micro-052821-031444 34351789 PMC8500939 [19] Hosseini-Giv N Basas A Hicks C Bacterial extracellular vesicles and their novel therapeutic applications in health and cancer Front Cell Infect Micro Biol 2022 12 962216 10.3389/fcimb.2022.962216 PMC9691856 36439225 [20] Furuyama N Sircili MP Gebre AK Outer membrane vesicles (OMVs) produced by Gram-negative bacteria: structure, functions, biogenesis, and vaccine application Biomed Res Int 2021 2021 1 1490732 10.1155/2021/1490732 33834062 PMC8016564 [21] Meldolesi J Extracellular vesicles, news about their role in immune cells: physiology, pathology and diseases Clin Exp Immunol 2019 196 3 318 327 10.1111/cei.13274 30756386 PMC6514371 [22] Kulp A Kuehn MJ Biological functions and biogenesis of secreted bacterial outer membrane vesicles Annu Rev microbiol 2010 64 1 163 184 10.1146/annurev.micro.091208.073413 20825345 PMC3525469 [23] Toyofuku M Nomura N Eberl L Types and origins of bacterial membrane vesicles Nat Rev microbiol 2019 17 1 13 24 10.1038/s41579-018-0112-2 30397270 [24] Gilmore WJ Bitto NJ Kaparakis-Liaskos M Pathogenesis mediated by bacterial membrane vesicles Subcell biochem 2021 97 101 150 33779916 10.1007/978-3-030-67171-6_6 [25] Juodeikis R Carding SR Outer membrane vesicles: biogenesis, functions, and issues Microbiol Mol Biol Rev 2022 86 4 e0003222 10.1128/mmbr.00032-22 36154136 PMC9881588 [26] Michel LV Gaborski T Outer membrane vesicles as molecular biomarkers for gram-negative sepsis: taking advantage of nature’s perfect packages J Biol Chem 2022 298 10 102483 10.1016/j.jbc.2022.102483 36108741 PMC9576880 [27] Avila-Calderón ED Ruiz-Palma MDS Aguilera-Arreola MG Outer membrane vesicles of Gram-negative bacteria: an outlook on biogenesis Front Micro Biol 2021 12 557902 10.3389/fmicb.2021.557902 PMC7969528 33746909 [28] Pérez-Cruz C Carrión O Delgado L New type of outer membrane vesicle produced by the gram-negative bacterium Shewanella vesiculosa M7T: implications for DNA content Appl Environ microbiol 2013 79 6 1874 1881 10.1128/AEM.03657-12 23315742 PMC3592255 [29] Turnbull L Toyofuku M Hynen AL Explosive cell lysis as a mechanism for the biogenesis of bacterial membrane vesicles and biofilms Nat Commun 2016 7 1 11220 10.1038/ncomms11220 27075392 PMC4834629 [30] Bhar S Edelmann MJ Jones MK Characterization and proteomic analysis of outer membrane vesicles from a commensal microbe, Enterobacter cloacae J proteomics 2021 231 103994 10.1016/j.jprot.2020.103994 33007464 [31] Juodeikis R Martins C Saalbach G Differential temporal release and lipoprotein loading in B. thetaiotaomicron bacterial extracellular vesicles J Extracell Vesicle 2024 13 1 10.1002/jev2.12406 PMC10797578 38240185 [32] Humaira AI Shakir HA Franco M Bacterial extracellular vesicles: potential therapeutic applications, challenges, and future prospects J Basic microbiol 2024 64 10 e2400221 10.1002/jobm.202400221 39148315 [33] Bitto NJ Kaparakis-Liaskos M Methods of bacterial membrane vesicle production, purification, quantification, and examination of their immunogenic functions Methods Mol Biol 2022 2523 43 61 35759190 10.1007/978-1-0716-2449-4_4 [34] Van Deun J Mestdagh P Sormunen R The impact of disparate isolation methods for extracellular vesicles on downstream RNA profiling J Extracell Vesicles 2014 3 1 3 10.3402/jev.v3.24858 PMC4169610 25317274 [35] Shao H Im H Castro CM New technologies for analysis of extracellular vesicles Chem Rev 2018 118 4 1917 1950 10.1021/acs.chemrev.7b00534 29384376 PMC6029891 [36] Ye Z He W Zhang Z Aiegens for microorganism‐related visualization and therapy Interdiscip Med 2023 1 2 1 10.1002/INMD.20220011 [37] Schwechheimer C Sullivan CJ Kuehn MJ Envelope control of outer membrane vesicle production in Gram-negative bacteria Biochemistry 2013 52 18 3031 3040 10.1021/bi400164t 23521754 PMC3731998 [38] Prados-Rosales R Weinrick BC Piqué DG Role for Mycobacterium tuberculosis membrane vesicles in iron acquisition J Bacteriol 2014 196 6 1250 1256 10.1128/JB.01090-13 24415729 PMC3957709 [39] Orench-Rivera N Kuehn MJ Environmentally controlled bacterial vesicle-mediated export Cell microbiol 2016 18 11 1525 1536 10.1111/cmi.12676 27673272 PMC5308445 [40] Kim SW Seo JS Park SB Significant increase in the secretion of extracellular vesicles and antibiotics resistance from methicillin-resistant Staphylococcus aureus induced by ampicillin stress Sci Rep 2020 10 1 21066 10.1038/s41598-020-78121-8 33273518 PMC7713300 [41] Bos J Cisneros LH Mazel D Real-time tracking of bacterial membrane vesicles reveals enhanced membrane traffic upon antibiotic exposure Sci Adv 2021 7 4 10.1126/sciadv.abd1033 PMC7817102 33523924 [42] Woith E Fuhrmann G Melzig MF Extracellular vesicles—connecting kingdoms Int J Mol Sci 2019 20 22 20 10.3390/ijms20225695 PMC6888613 31739393 [43] Strahl H Errington J Bacterial membranes: structure, domains, and function Annu Rev microbiol 2017 71 1 519 538 10.1146/annurev-micro-102215-095630 28697671 [44] van Niel G D’Angelo G Raposo G Shedding light on the cell biology of extracellular vesicles Nat Rev Mol Cell Biol 2018 19 4 213 228 10.1038/nrm.2017.125 29339798 [45] Chen Y Liu L Fu H Comparative proteomic analysis of outer membrane vesicles from Shigella flexneri under different culture conditions Biochem Biophys Res Commun 2014 453 4 696 702 10.1016/j.bbrc.2014.09.142 25445584 [46] Kim YS Choi EJ Lee WH Extracellular vesicles, especially derived from gram-negative bacteria, in indoor dust induce neutrophilic pulmonary inflammation associated with both Th1 and Th17 cell responses Clin Exp Allergy 2013 43 4 443 454 10.1111/cea.12085 23517040 [47] Cahill BK Seeley KW Gutel D Klebsiella pneumoniae O antigen loss alters the outer membrane protein composition and the selective packaging of proteins into secreted outer membrane vesicles Microbiol Res 2015 180 1 10 10.1016/j.micres.2015.06.012 26505306 [48] Wei Z Batagov AO Schinelli S Coding and noncoding landscape of extracellular RNA released by human glioma stem cells Nat Commun 2017 8 1 1145 10.1038/s41467-017-01196-x 29074968 PMC5658400 [49] Altindis E Fu Y Mekalanos JJ Proteomic analysis of Vibrio cholerae outer membrane vesicles Proc Natl Acad Sci USA 2014 111 15 E1548 56 10.1073/pnas.1403683111 24706774 PMC3992640 [50] Jan AT Outer membrane vesicles (OMVs) of Gram-negative bacteria: a perspective update Front Micro Biol 2017 8 1053 10.3389/fmicb.2017.01053 PMC5465292 28649237 [51] Lee J Kim OY Gho YS Proteomic profiling of Gram-negative bacterial outer membrane vesicles: current perspectives Proteomics Clin Apps 2016 10 9–10 897 909 10.1002/prca.201600032 27480505 [52] Valadi H Ekström K Bossios A Exosome-mediated transfer of mRNAs and microRNAs is a novel mechanism of genetic exchange between cells Nat Cell Biol 2007 9 6 654 659 10.1038/ncb1596 17486113 [53] Nolte-‘t Hoen EN Buermans HP Waasdorp M Deep sequencing of RNA from immune cell-derived vesicles uncovers the selective incorporation of small non-coding RNA biotypes with potential regulatory functions Nucleic Acids Res 2012 40 18 9272 9285 10.1093/nar/gks658 22821563 PMC3467056 [54] Li Z Chen D Pan R MicroRNAs profiling of small extracellular vesicles from midbrain tissue of Parkinson’s disease Front Mol Neuro Sci 2023 16 1090556 10.3389/fnmol.2023.1090556 PMC9935574 36818649 [55] Skog J Würdinger T van Rijn S Glioblastoma microvesicles transport RNA and proteins that promote tumour growth and provide diagnostic biomarkers Nat Cell Biol 2008 10 12 1470 1476 10.1038/ncb1800 19011622 PMC3423894 [56] Lo Cicero A Stahl PD Raposo G Extracellular vesicles shuffling intercellular messages: for good or for bad Curr Opin Cell Biol 2015 35 69 77 10.1016/j.ceb.2015.04.013 26001269 [57] György B Hung ME Breakefield XO Therapeutic applications of extracellular vesicles: clinical promise and open questions Annu Rev Pharmacol Toxic 2015 55 1 439 464 10.1146/annurev-pharmtox-010814-124630 PMC4445965 25292428 [58] Raetz CR Whitfield C Lipopolysaccharide endotoxins Annu Rev Bio Chem 2002 71 1 635 700 10.1146/annurev.biochem.71.110601.135414 PMC2569852 12045108 [59] Kulkarni HM Jagannadham MV Biogenesis and multifaceted roles of outer membrane vesicles from Gram-negative bacteria Microbiology 2014 160 10 2109 2121 10.1099/mic.0.079400-0 25069453 [60] Liu W Luo X Tang J A bridge for short-chain fatty acids to affect inflammatory bowel disease, type 1 diabetes, and non-alcoholic fatty liver disease positively: by changing gut barrier Eur J Nutr 2021 60 5 2317 2330 10.1007/s00394-020-02431-w 33180143 [61] Młynarska E Wasiak J Gajewska A Exploring the significance of gut microbiota in diabetes pathogenesis and management—a narrative review Nutrients 2024 16 12 1938 10.3390/nu16121938 38931292 PMC11206785 [62] Dilixiati Y Aipire A Song M The potential role of plant polysaccharides in treatment of ulcerative colitis Pharmaceutics 2024 16 8 1073 10.3390/pharmaceutics16081073 39204418 PMC11360206 [63] Mu Q Kirby J Reilly CM Leaky gut as a danger signal for autoimmune diseases Front Immunol 2017 8 598 10.3389/fimmu.2017.00598 28588585 PMC5440529 [64] Horowitz A Chanez-Paredes SD Haest X Paracellular permeability and tight junction regulation in gut health and disease Nat Rev Gastroenterol Hepatol 2023 20 7 417 432 10.1038/s41575-023-00766-3 37186118 PMC10127193 [65] Cavalari VC Cardoso Garcia LF Massuda R Toxoplasma gondii, endothelial cells and schizophrenia: is it just a barrier matter? Front Cell Infect Micro Biol 2025 15 1468936 10.3389/fcimb.2025.1468936 PMC12018487 40276385 [66] Kunath BJ De Rudder C Laczny CC The oral–gut microbiome axis in health and disease Nat Rev microbiol 2024 22 12 791 805 10.1038/s41579-024-01075-5 39039286 [67] Martínez-Ruiz S Sáez-Fuertes L Casanova-Crespo S Microbiota-derived extracellular vesicles promote immunity and intestinal maturation in suckling rats Nutrients 2023 15 21 15 10.3390/nu15214701 PMC10649425 37960354 [68] Kaparakis M Turnbull L Carneiro L Bacterial membrane vesicles deliver peptidoglycan to NOD1 in epithelial cells Cell microbiol 2010 12 3 372 385 10.1111/j.1462-5822.2009.01404.x 19888989 [69] Thapa HB Kohl P Zingl FG Characterization of the inflammatory response evoked by bacterial membrane vesicles in intestinal cells reveals an RIPK2-dependent activation by enterotoxigenic Escherichia coli vesicles Microbiol spectr 2023 11 4 e0111523 10.1128/spectrum.01115-23 37306596 PMC10433812 [70] Mantel M Durand T Bessard A Propionibacterium freudenreichii CIRM-BIA 129 mitigates colitis through S layer protein B-dependent epithelial strengthening Am J Physiol Gastrointestinal Liver Physiol 2024 326 2 G163 g75 10.1152/ajpgi.00198.2023 37988603 [71] Bielaszewska M Marejková M Bauwens A Enterohemorrhagic Escherichia coli O157 outer membrane vesicles induce interleukin 8 production in human intestinal epithelial cells by signaling via Toll-like receptors TLR4 and TLR5 and activation of the nuclear factor NF-κB Int J Med microbiol 2018 308 7 882 889 10.1016/j.ijmm.2018.06.004 29934223 [72] Tiku V Tan MW Host immunity and cellular responses to bacterial outer membrane vesicles Trends Immunol 2021 42 11 1024 1036 10.1016/j.it.2021.09.006 34635395 [73] Li D Wu M Pattern recognition receptors in health and diseases Signal trans targeted therapy 2021 6 1 291 10.1038/s41392-021-00687-0 PMC8333067 34344870 [74] Bitto NJ Zavan L Johnston EL Considerations for the analysis of bacterial membrane vesicles: methods of vesicle production and quantification can influence biological and experimental outcomes Microbiol spectr 2021 9 3 e0127321 10.1128/Spectrum.01273-21 34937167 PMC8694105 [75] Bitto NJ Cheng L Johnston EL Staphylococcus aureus membrane vesicles contain immunostimulatory DNA, RNA and peptidoglycan that activate innate immune receptors and induce autophagy J Extracell Vesicles 2021 10 6 e12080 10.1002/jev2.12080 33815695 PMC8015888 [76] Irving AT Mimuro H Kufer TA The immune receptor NOD1 and kinase RIP2 interact with bacterial peptidoglycan on early endosomes to promote autophagy and inflammatory signaling Cell Host Microbe 2014 15 5 623 635 10.1016/j.chom.2014.04.001 24746552 [77] Cañas MA Fábrega MJ Giménez R Outer membrane vesicles from probiotic and commensal Escherichia coli activate NOD1-mediated immune responses in intestinal epithelial cells Front Micro Biol 2018 9 498 10.3389/fmicb.2018.00498 PMC5869251 29616010 [78] Kobayashi N Abe K Akagi S Membrane vesicles derived from Clostridium botulinum and related clostridial species induce innate immune responses via MyD88/TRIF signaling in vitro Front Micro Biol 2022 13 720308 10.3389/fmicb.2022.720308 PMC8851338 35185840 [79] Kang CS Ban M Choi EJ Extracellular vesicles derived from gut microbiota, especially Akkermansia muciniphila, protect the progression of dextran sulfate sodium-induced colitis PLOS ONE 2013 8 10 e76520 10.1371/journal.pone.0076520 24204633 PMC3811976 [80] Kim JH Lee J Park KS Drug repositioning to alleviate systemic inflammatory response syndrome caused by gram-negative bacterial outer membrane vesicles Adv Healthc Mater 2018 7 13 e1701476 10.1002/adhm.201701476 29683274 [81] Kaparakis-Liaskos M Ferrero RL Immune modulation by bacterial outer membrane vesicles Nat Rev Immunol 2015 15 6 375 387 10.1038/nri3837 25976515 [82] Li Z Liu L Sun Y Mesenchymal stem/stromal cells-derived exosomes: possible therapeutic mechanism in inflammatory bowel disease Hum Cell 2025 38 4 111 10.1007/s13577-025-01243-6 40434563 [83] Diaz-Garrido N Fábrega M-J Vera R Membrane vesicles from the probiotic Nissle 1917 and gut resident Escherichia coli strains distinctly modulate human dendritic cells and subsequent T cell responses J Funct Foods 2019 61 103495 10.1016/j.jff.2019.103495 [84] Koeppen K Hampton TH Jarek M A novel mechanism of host-pathogen interaction through sRNA in bacterial outer membrane vesicles PLOS Pathog 2016 12 6 e1005672 10.1371/journal.ppat.1005672 27295279 PMC4905634 [85] Banerjee R Tiny but mighty: small RNAs-the micromanagers of bacterial survival, virulence, and host-pathogen interactions Noncoding RNA 2025 11 10.3390/ncrna11030036 40407594 PMC12101431 [86] Nonaka S Okamoto R Katsuta Y Gingipain-carrying outer membrane vesicles from Porphyromonas gingivalis cause barrier dysfunction of Caco-2 cells by releasing gingipain into the cytosol Biochem Biophys Res Commun 2024 707 149783 10.1016/j.bbrc.2024.149783 38493746 [87] Chen K Wang H Yang Y Common mechanisms of gut microbe-based strategies for the treatment of intestine-related diseases: based on multi-target interactions with the intestinal barrier Cell Commun Signal 2025 23 1 288 10.1186/s12964-025-02299-5 40528179 PMC12175372 [88] Tulkens J Vergauwen G Van Deun J Increased levels of systemic LPS-positive bacterial extracellular vesicles in patients with intestinal barrier dysfunction Gut 2020 69 1 191 193 10.1136/gutjnl-2018-317726 30518529 PMC6943244 [89] Hirayama D Iida T Nakase H The phagocytic function of macrophage-enforcing innate immunity and tissue homeostasis Int J Mol Sci 2017 19 1 92 10.3390/ijms19010092 29286292 PMC5796042 [90] Kesty NC Mason KM Reedy M Enterotoxigenic Escherichia coli vesicles target toxin delivery into mammalian cells Embo J 2004 23 23 4538 4549 10.1038/sj.emboj.7600471 15549136 PMC533055 [91] David L Taieb F Pénary M Outer membrane vesicles produced by pathogenic strains of Escherichia coli block autophagic flux and exacerbate inflammasome activation Autophagy 2022 18 12 2913 2925 10.1080/15548627.2022.2054040 35311462 PMC9673956 [92] Tiku V Kofoed EM Yan D Outer membrane vesicles containing OmpA induce mitochondrial fragmentation to promote pathogenesis of Acinetobacter baumannii Sci Rep 2021 11 1 618 10.1038/s41598-020-79966-9 33436835 PMC7804284 [93] Yang J Hwang I Lee E Bacterial outer membrane vesicle-mediated cytosolic delivery of flagellin triggers host NLRC4 canonical inflammasome signaling Front Immunol 2020 11 581165 10.3389/fimmu.2020.581165 33312172 PMC7708323 [94] Rodriguez BV Kuehn MJ Staphylococcus aureus secretes immunomodulatory RNA and DNA via membrane vesicles Sci Rep 2020 10 1 18293 10.1038/s41598-020-75108-3 33106559 PMC7589478 [95] Rivera J Cordero RJ Nakouzi AS Bacillus anthracis produces membrane-derived vesicles containing biologically active toxins Proc Natl Acad Sci USA 2010 107 44 19002 19007 10.1073/pnas.1008843107 20956325 PMC2973860 [96] Hickey CA Kuhn KA Donermeyer DL Colitogenic Bacteroides thetaiotaomicron antigens access host immune cells in a sulfatase-dependent manner via outer membrane vesicles Cell Host Microbe 2015 17 5 672 680 10.1016/j.chom.2015.04.002 25974305 PMC4432250 [97] Choi JH Moon CM Shin TS Lactobacillus paracasei-derived extracellular vesicles attenuate the intestinal inflammatory response by augmenting the endoplasmic reticulum stress pathway Exp Mol Med 2020 52 3 423 437 10.1038/s12276-019-0359-3 32123288 PMC7156483 [98] Chatterjee D Chaudhuri K Vibrio cholerae O395 outer membrane vesicles modulate intestinal epithelial cells in a NOD1 protein-dependent manner and induce dendritic cell-mediated Th2/Th17 cell responses J Biol Chem 2013 288 6 4299 4309 10.1074/jbc.M112.408302 23275338 PMC3567681 [99] Winter J Letley D Rhead J Helicobacter pylori membrane vesicles stimulate innate pro- and anti-inflammatory responses and induce apoptosis in Jurkat T cells Infect Immun 2014 82 4 1372 1381 10.1128/IAI.01443-13 24421041 PMC3993389 [100] Ismail S Hampton MB Keenan JI Helicobacter pylori outer membrane vesicles modulate proliferation and interleukin-8 production by gastric epithelial cells Infect Immun 2003 71 10 5670 5675 10.1128/IAI.71.10.5670-5675.2003 14500487 PMC201067 [101] Lee J Yoon YJ Kim JH Outer membrane vesicles derived from Escherichia coli regulate neutrophil migration by induction of endothelial IL-8 Front Micro Biol 2018 9 2268 10.3389/fmicb.2018.02268 PMC6194319 30369908 [102] Lajqi T Köstlin-Gille N Hillmer S Gut microbiota-derived small extracellular vesicles endorse memory-like inflammatory responses in murine neutrophils Biomedicines 2022 10 2 10 10.3390/biomedicines10020442 PMC8962420 35203650 [103] Kim MR Hong SW Choi EB Staphylococcus aureus-derived extracellular vesicles induce neutrophilic pulmonary inflammation via both Th1 and Th17 cell responses Allergy 2012 67 10 1271 1281 10.1111/all.12001 22913540 [104] Davis JM Carvalho HM Rasmussen SB Cytotoxic necrotizing factor type 1 delivered by outer membrane vesicles of uropathogenic Escherichia coli attenuates polymorphonuclear leukocyte antimicrobial activity and chemotaxis Infect Immun 2006 74 8 4401 4408 10.1128/IAI.00637-06 16861625 PMC1539604 [105] Davis JM Rasmussen SB O’Brien AD Cytotoxic necrotizing factor type 1 production by uropathogenic Escherichia coli modulates polymorphonuclear leukocyte function Infect Immun 2005 73 9 5301 5310 10.1128/IAI.73.9.5301-5310.2005 16113245 PMC1231104 [106] Rehman ZU Obi I Nadeem A Bacterial extracellular vesicles exploit filopodial surfing and retraction mechanisms to reach the host cell body in an actin-dependent manner J Extracell Vesicles 2025 14 6 e70107 10.1002/jev2.70107 40545962 PMC12183400 [107] Salvador-Erro J Pastor Y Gamazo C A recombinant Shigella flexneri strain expressing ETEC heat-labile enterotoxin B subunit shows promise for vaccine development via OMVs Int J Mol Sci 2024 25 23 12535 10.3390/ijms252312535 39684252 PMC11641383 [108] Murase K Martin P Porcheron G HlyF produced by extraintestinal pathogenic Escherichia coli is a virulence factor that regulates outer membrane vesicle biogenesis J Infect Dis 2016 213 5 856 865 10.1093/infdis/jiv506 26494774 [109] Kovarik P Castiglia V Ivin M Type I interferons in bacterial infections: a balancing act Front Immunol 2016 7 652 10.3389/fimmu.2016.00652 28082986 PMC5183637 [110] Cecil JD O’Brien-Simpson NM Lenzo JC Outer membrane vesicles prime and activate macrophage inflammasomes and cytokine secretion in vitro and in vivo Front Immunol 2017 8 1017 10.3389/fimmu.2017.01017 28890719 PMC5574916 [111] Kuipers ME Hokke CH Smits HH Pathogen-derived extracellular vesicle-associated molecules that affect the host immune system: an overview Front Micro Biol 2018 9 2182 10.3389/fmicb.2018.02182 PMC6143655 30258429 [112] Zingl FG Thapa HB Scharf M Outer membrane vesicles of Vibrio cholerae protect and deliver active cholera toxin to host cells via porin-dependent uptake MBio 2021 12 3 e0053421 10.1128/mBio.00534-21 34076466 PMC8262896 [113] Schlatterer K Beck C Hanzelmann D The mechanism behind bacterial lipoprotein release: phenol-soluble modulins mediate toll-like receptor 2 activation via extracellular vesicle release from Staphylococcus aureus MBio 2018 9 6 10.1128/mBio.01851-18 PMC6247081 30459192 [114] Elizagaray ML Gomes MTR Guimaraes ES Canonical and non-canonical inflammasome activation by outer membrane vesicles derived from Bordetella pertussis Front Immunol 2020 11 1879 10.3389/fimmu.2020.01879 32973778 PMC7468456 [115] Schetters STT Jong WSP Horrevorts SK Outer membrane vesicles engineered to express membrane-bound antigen program dendritic cells for cross-presentation to CD8+ T cells Acta biomater 2019 91 248 257 10.1016/j.actbio.2019.04.033 31003032 [116] Mobarak H Javid F Narmi MT Prokaryotic microvesicles ortholog of eukaryotic extracellular vesicles in biomedical fields Cell Commun Signal 2024 22 1 80 10.1186/s12964-023-01414-8 38291458 PMC10826215 [117] Li J Luo T Wang D Therapeutic application and potential mechanism of plant-derived extracellular vesicles in inflammatory bowel disease J Adv Res 2025 68 63 74 10.1016/j.jare.2024.01.035 38341033 PMC11785581 [118] Ye H Wang H Han B Guizhi Shaoyao Zhimu decoction inhibits neutrophil extracellular traps formation to relieve rheumatoid arthritis via gut microbial outer membrane vesicles Phytomedicine 2025 136 156254 10.1016/j.phymed.2024.156254 39586125 [119] Jang SC Kim SR Yoon YJ In vivo kinetic biodistribution of nano-sized outer membrane vesicles derived from bacteria Small 2015 11 4 456 461 10.1002/smll.201401803 25196673 [120] Goman A Ize B Jeannot K Uncovering a new family of conserved virulence factors that promote the production of host-damaging outer membrane vesicles in Gram-negative bacteria J Extracell Vesicles 2025 14 1 e270032 10.1002/jev2.70032 39840902 PMC11752146 [121] Lajqi T Lang GP Haas F Memory-like inflammatory responses of microglia to rising doses of LPS: key role of PI3Kγ Front Immunol 2019 10 2492 10.3389/fimmu.2019.02492 31781091 PMC6856213 [122] Kozłowska E Agier J Różalska S Fungal β-glucans shape innate immune responses in human peripheral blood mononuclear cells (PBMCs): an in vitro study on PRR regulation, cytokine expression, and oxidative balance IJMS 2025 26 13 26 10.3390/ijms26136458 PMC12250429 40650232 [123] Hou X Ding H Wang H Gut bacteriophages induce specific-reprogramming of macrophages to generate a protective innate immunity response to lipopolysaccharide exposure Gut Microbes 2025 17 1 2524540 10.1080/19490976.2025.2524540 40574460 PMC12218588 [124] Lajqi T Stojiljkovic M Williams DL Memory-like responses of brain microglia are controlled by developmental state and pathogen dose Front Immunol 2020 11 546415 10.3389/fimmu.2020.546415 33101271 PMC7546897 [125] Geng S Chen K Yuan R The persistence of low-grade inflammatory monocytes contributes to aggravated atherosclerosis Nat Commun 2016 7 1 13436 10.1038/ncomms13436 27824038 PMC5105176 [126] Motta JP Wallace JL Buret AG Gastrointestinal biofilms in health and disease Nat Rev Gastroenterol Hepatol 2021 18 5 314 334 10.1038/s41575-020-00397-y 33510461 [127] Metruccio MM Evans DJ Gabriel MM Pseudomonas aeruginosa outer membrane vesicles triggered by human mucosal fluid and lysozyme can prime host tissue surfaces for bacterial adhesion Front microbiol 2016 7 871 10.3389/fmicb.2016.00871 27375592 PMC4891360 [128] Kulkarni HM Nagaraj R Jagannadham MV Protective role of E. coli outer membrane vesicles against antibiotics Microbiol Res 2015 181 1 7 10.1016/j.micres.2015.07.008 26640046 [129] Wang X Ni J You Y Snx10-mediated LPS sensing causes intestinal barrier dysfunction via a caspase-5-dependent signaling cascade Embo J 2021 40 24 e108080 10.15252/embj.2021108080 34747049 PMC8672282 [130] Diallo I Ho J Lambert M A tRNA-derived fragment present in E. coli OMVs regulates host cell gene expression and proliferation PLOS Pathog 2022 18 9 e1010827 10.1371/journal.ppat.1010827 36108089 PMC9514646 [131] Munshi R Characterization of outer membrane vesicles from Fusobacterium nucleatum Indian J Sci Technol 2020 13 2 161 192 10.17485/ijst/2020/v13i02/148492 [132] Hashemi Goradel N Heidarzadeh S Jahangiri S Fusobacterium nucleatum and colorectal cancer: a mechanistic overview J Cell Physiol 2019 234 3 2337 2344 10.1002/jcp.27250 30191984 [133] Wang S Liu Y Li J Fusobacterium nucleatum acts as a pro-carcinogenic bacterium in colorectal cancer: from association to causality Front Cell Dev Biol 2021 9 710165 10.3389/fcell.2021.710165 34490259 PMC8417943 [134] Chen G Gao C Jiang S Fusobacterium nucleatum outer membrane vesicles activate autophagy to promote oral cancer metastasis J Adv Res 2024 56 167 179 10.1016/j.jare.2023.04.002 37059221 PMC10834801 [135] Jones E Stentz R Telatin A The origin of plasma-derived bacterial extracellular vesicles in healthy individuals and patients with inflammatory bowel disease: a pilot study Genes (Basel) 2021 12 10 12 10.3390/genes12101636 PMC8535827 34681030 [136] Liu H Li M Zhang T Engineered bacterial extracellular vesicles for osteoporosis therapy Chem Eng J 2022 450 450 10.1016/j.cej.2022.138309 [137] Fan J Zhang Y Zuo M Novel mechanism by which extracellular vesicles derived from Lactobacillus murinus alleviates deoxynivalenol-induced intestinal barrier disruption Environ Int 2024 185 108525 10.1016/j.envint.2024.108525 38408410 [138] Liu H Zhang H Han Y Bacterial extracellular vesicles-based therapeutic strategies for bone and soft tissue tumors therapy Theranostics 2022 12 15 6576 6594 10.7150/thno.78034 36185613 PMC9516228 [139] Wen M Wang J Ou Z Bacterial extracellular vesicles: a position paper by the Microbial Vesicles Task Force of the Chinese Society for Extracellular Vesicles Interdiscip Med 2023 1 3 1 10.1002/INMD.20230017 ",
  "metadata": {
    "Title of this paper": "Bacterial extracellular vesicles: a position paper by the Microbial Vesicles Task Force of the Chinese Society for Extracellular Vesicles",
    "Journal it was published in:": "Virulence",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490000/"
  }
}