{
  "title": "Paper_148",
  "abstract": "pmc Food Chem X Food Chem X 3708 fochx Food Chemistry: X 2590-1575 Elsevier PMC12489916 PMC12489916.1 12489916 12489916 10.1016/j.fochx.2025.103020 S2590-1575(25)00867-3 103020 1 Analytical Methods Walnut kernel pellicle polyphenols: subcritical water extraction, digestive characteristics, and their effect on gut microbiota and metabolites Yuan Xinyu a Feng Qiqi a Wang Qing a Wang Tao a Qiao Zhu c Pan Hongyu a Zhong Yujie zyj0048@kust.edu.cn a ⁎ Zhuang Yongliang a b d a b c d ⁎ zyj0048@kust.edu.cn 10 2025 18 9 2025 31 497596 103020 3 7 2025 5 9 2025 10 9 2025 18 09 2025 03 10 2025 03 10 2025 © 2025 The Authors. Published by Elsevier Ltd. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Walnut kernel pellicle, a by-product of the walnut industry, is rich in polyphenols. However, research on walnut kernel pellicle polyphenols (WPP) remains limited, and the composition and bioactivity of WPP are influenced by extraction methods, gastrointestinal digestion, and colonic fermentation. Therefore, this study aimed to optimize subcritical water extraction (SWE) and NKA-9 resin purification of WPP. Next, the changes in WPP throughout simulated gastrointestinal digestion and colonic fermentation were evaluated. The results demonstrated that SWE achieved higher polyphenol yield compared to ultrasound-assisted extraction, with ellagic acid and ellagitannins as the main components. Although digestion and fermentation reduced WPP contents and antioxidant activities, they facilitated the biotransformation of ellagic acid and ellagitannins into urolithins. Meanwhile, WPP modulated the gut microbiota by promoting beneficial bacteria. Additionally, WPP enhanced beneficial microbial metabolites, including short-chain fatty acids and indole derivatives. These findings highlighted the potential of WPP as a functional ingredient for gut health. Graphical abstract Unlabelled Image Highlights • Subcritical water-extracted walnut pellicle polyphenols (WPP) are ellagitannins-rich. • WPP content and activity decreases to some content after gastrointestinal digestion. • WPP enhances beneficial gut microbiota while suppressing harmful bacteria. • WPP can promote short chain fatty acids levels produced by gut microbiota. • WPP can promote indole derivatives levels produced by gut microbiota. Keywords Walnut pellicle polyphenols Gastrointestinal digestion Colonic fermentation Intestinal microbiota Short-chain fatty acids Indole derivatives pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Yunnan walnuts ( Juglans sigillata Pycia & Ivanisova, 2020 Fang et al., 2021 etc. Zhang et al., 2020 Sedem Dzah et al. (2020) Polyphenols exhibit diverse physiological benefits, including antioxidant and anti-inflammatory activities, anticarcinogenic potential, cardiovascular protective effects, and metabolic regulatory properties ( Aziz et al., 2024 Morzel et al., 2022 Wojtunik-Kulesza et al., 2020 Although a proportion of polyphenols is degraded during gastrointestinal digestion, the majority will reach the colon intact, where they undergo complex interactions with gut microbiota. Studies have shown that polyphenols can promote the growth of beneficial microbes and inhibit the abundance of detrimental bacteria ( Nash et al., 2018 Bifidobacterium Lactobacillus Roche Escherichia coli Enterobacter cloacae Nash et al., 2018 Akkermansia muciniphila Tan et al., 2021 Kalkan et al., 2025 Gao et al., 2020 Hua et al., 2024 Massaga et al., 2025 Thus, to evaluate the potential of WPP as a functional bioactive compound, the present study aims to 1) optimize the parameters for extracting WPP by SWE, 2) purify WPP using NKA-9 macroporous resin, 3) assess the gastrointestinal digestive stability of WPP, 4) examine how WPP affects gut microbiota composition and metabolism, and 5) investigate the transformation of WPP by gut microbiota. 2 Materials and methods 2.1 Materials Folin-Ciocalteu's phenol reagent, indole-3-acrylic acid, indole-3-acetic acid, indole-3-propionic acid, indole-3-pyruvic acid, and indole-3-butyric acid were purchased from Macklin Biochemical Co., Ltd. (Shanghai, China). Yeast extract, heme chloride, bile salt, L-cysteine salt, bladed azurite, vitamin K 1 S 2.2 Preparation of WPP Walnut kernel pellicle was provided by the Yunnan Academy of Forestry and Grassland Science. The walnut kernel pellicle powder was prepared by drying, crushing, and then sieving it through a 60-mesh screen. Subsequently, single-factor experiments and response surface methodology (RSM) were employed to determine the optimal conditions for extracting WPP from the powder using SWE. Three single factors are as follows: Temperatures (100, 110, 120, 140, 160, and 180 °C), time (5, 10, 15, 20, 25, and 30 min), and solid-liquid ratios (1:30, 1:40, 1:50, 1:60, 1:70, 1:80 g/mL). The three factors and levels for response surface methodology (RSM) are as follows: temperatures (100, 110, and 120 °C); time (5, 15, and 25 min); solid-liquid ratios (1:40, 1:50, and 1:60 g/mL). After extraction, the supernatant was collected by centrifugation (3000 g 2.3 Purification of WPP Macroporous resin was used to purify the crude WPP. Firstly, the optimal resin for purifying crude WPP was screened by evaluating its adsorption and desorption rates. Then, the concentration and pH of crude WPP, and the ethanol volume fraction for washing WPP, were determined using static adsorption-desorption experiments. Subsequently, dynamic adsorption-desorption experiments were carried out to derive the up-sampling flow rate and volume. Briefly, macroporous resin was packed into a φ1.6 cm × 26 cm glass column, and the crude WPP solution (2 mg/mL, pH = 2) was loaded onto the column at a flow rate of 1 mL/min, 2 mL/min, and 3 mL/min. Subsequently, WPP was eluted with 45 % ethanol at a flow rate of 2 mL/min. Effluent was collected until the polyphenol content reached the leakage point of 1/10. The collected eluate fractions were concentrated and freeze-dried to obtain purified WPP. 2.4 Identification of WPP components Ultra-performance liquid chromatography quadrupole Orbitrap tandem mass spectrometry (UPLC-Q-Orbitrap-MS 2 18 m z d 2.5 Detection of polyphenol contents The total WPP content was determined using the Folin-Ciocalteu method. Briefly, WPP solution (0.5 mL, 0.01 mg/mL) was mixed with 10 % Folin-Ciocalteu's phenol reagent (2.5 mL) and allowed to react for 5 min. Subsequently, 2.0 mL of 7.5 % Na 2 3 2.6 Antioxidant activity assay 2.6.1 The capacity of WPP to scavenge DPPH free radicals WPP (0.4 mL, 0.01 mg/mL) was thoroughly mixed with 0.1 mM/L DPPH solution (2 mL). The mixture was then incubated in the dark for 30 min. The absorbance was measured at 517 nm by a UV spectrophotometer (T9CS, Persee General Instrument Co., Ltd., Beijing, China). 2.6.2 The capacity of WPP to scavenge ABTS free radicals A 0.5 mL of WPP solution (0.01 mg/mL) was thoroughly combined with 4 mL of 0.1 mM ABTS solution, and incubated in the dark at 30 °C for 6 min. The absorbance was measured at 734 nm by a UV spectrophotometer (T9CS, Persee General Instrument Co., Ltd., Beijing, China). 2.6.3 The capacity of WPP to reduce iron ions A 150 μL of WPP (0.01 mg/mL) was uniformly combined with 4.5 mL of 0.1 mM FRAP solution and then incubated at 37 °C in the dark for 60 min. The absorbance was measured at 593 nm by a UV spectrophotometer (T9CS, Persee General Instrument Co., Ltd., Beijing, China). 2.7 Simulated in vitro The methods of in vitro Tan et al. (2023) g A gastric digestion mixture was used to simulate intestinal digestion. Briefly, 40 mL of gastric digestion mixture was transferred into an anaerobic incubator and mixed thoroughly with 20 mL of artificial small intestine solution. Then, 6 M NaOH was used to adjust the pH to 7. Next, the anaerobic incubator was sealed and incubated at 37 °C, 100 rpm, 8 % O₂ for 3 h. The supernatant was obtained by centrifuging the digested mixture (3000 g 2.8 In vitro The method of in vitro Tan et al. (2023) in vitro Cui et al., 2024 Ge et al., 2024 Wang et al., 2025 Xie et al., 2022 w v 2.9 16S rRNA sequencing The 16S rRNA sequencing was performed by Marjorie Biomedical Technology Co., Ltd. (Shanghai, China). The DNA concentration and purity were checked on 1 % agarose gel and a NanoDrop 2000 spectrophotometer (Thermo Scientific, United States). The V3-V4 variable region was amplified using upstream primer 27F (5’-AGRGTTYGATYMTGGGGGGGCTCAG-3′) and downstream primer 1492R (5’-RGYTACCTTGTTACGACTT-3′). The quality of amplification products was first evaluated using 2 % agarose gel electrophoresis. Following this, the desired bands were excised from the gel, and the products were recovered using the AxyPrepDNA Gel Recovery Kit (AXYGEN, NY 14831, USA). Quantification of the recovered products was then performed with the QuantiFluor™-ST Blue Fluorescent Quantification System (Corporate Campus, Madison, USA). DNA libraries were constructed from equimolar mixtures of purified products using the SMRTbell Pretreatment Kit 3.0 (Pacific Biosciences, California, USA). The purified libraries were sequenced by Majorbio Bio-Pharm Technology Co., Ltd. Then, optimized HiFi reads were clustered into operational taxonomic units (OTUs) using UPARSE 7.1 with 97 % sequence similarity. Classification analyses were performed on each OTU representative sequence. 2.10 Determination of SCFAs The fermentation supernatant was obtained by centrifugation (4 °C, 11000 g 2 4 g 2.11 Determination of indole metabolites The fermentation solution was centrifuged (4 °C, 11000 g g 2 section 2.4 m z 2.12 Statistical analysis As for multiple comparisons, the data were expressed as mean ± standard deviation (SD). One-way analysis of variance (ANOVA) was performed using SPSS 25 to analyze significant differences between different groups, and Duncan's test was applied to analyze differences between groups, with p 3 Results and discussion 3.1 Optimization of WPP extraction process: one-way and response surface experiments SWE offers significant advantages, including environmental friendliness and high efficiency. Therefore, SWE was employed to extract polyphenols from walnut kernel pellicle. Firstly, the optimal temperature, time, and solid-liquid ratio were determined through single-factor experiments. The highest polyphenol yield (332.47 mg GAE/g) was achieved at 110 °C ( Fig. 1 Ferreira et al., 2022 Fig. 1 Fig. 1 Fig. 1 Çalhan et al., 2023 2 2 2 p p Wang et al., 2021 Fig. 1 Optimization for the extraction of walnut kernel pellicle polyphenols (WPP) using subcritical water extraction (SWE). (A) The effect of extraction temperature on WPP contents, (B) The effect of extraction time on WPP contents, (C) The effect of solid-liquid ratio on WPP contents, (D) 3D surface plot of extraction temperature and time, (E) 3D surface plot of extraction time and solid-liquid ratio, (F) 3D surface plot of extraction time and solid-liquid ratio. Three replicates were performed for each experiment. Fig. 1 3.2 Optimization of the polyphenol purification process Macroporous resins are ideal for polyphenol purification due to their ability to effectively adsorb polyphenols while removing impurities like sugars, fats, and inorganic salts ( Chen et al., 2022 Fig. 2 Fig. 2 Fig. 2 Fig. 2 Hou et al. (2025) Fig. 2 Fig. 2 Fig. 2 Optimization for walnut kernel pellicle polyphenols (WPP) purification using macroporous resins. (A) Effect of different macroporous resin on the adsorption and desorption of WPP, (B) Effect of WPP concentration on the adsorption rate, (C) Effect of WPP pH on the adsorption rate, (D) Effect of ethanol volume fraction on the desorption rate, (E) Kinetic curves of up-sampling flow rate and volume versus p Fig. 2 3.3 Effect of in vitro Polyphenols are highly sensitive to gastrointestinal conditions. To evaluate the impact of digestion on the stability and bioactivity of WPP, we measured the changes in WPP content and antioxidant activity during in vitro in vitro vs Shang et al., 2022 Fig. 3 Fig. 3 Effect of gastrointestinal digestion and subsequent colonic fermentation on walnut kernel pellicle polyphenols (WPP) contents and antioxidant activities. (A) Changes in total polyphenol content, (B) Changes in DPPH free radical scavenging capacity, (C) Changes in ABTS free radical scavenging capacity, (D) Changes in FRAP iron ion reduction capacity. Three replicates were performed for each experiment. Different letters indicate significant differences, p Fig. 3 Consistent with the observed reduction in WPP content, DPPH and ABTS free radical scavenging capacity, as well as FRAP iron ion reducing activity, decreased during in vitro Fig. 3 Fig. 3 Aronia melanocarpa Li et al., 2024 3.4 Effect of in vitro The variations in WPP content and antioxidant activity during simulated gastrointestinal digestion and fermentation likely reflect compositional changes in WPP components. Therefore, the changes in WPP components during simulated digestion and fermentation were studied. As shown in Table 1 etc. van der Beek et al., 2015 Shang et al., 2022 Table 1 Changes in walnut kernel pellicle polyphenols (WPP) fractions after simulated digestion and fermentation(μg/mg). Table 1 Category Components WPP WPP (Gastric digestion) WPP (Intestinal digestion) WPP (Fermentation) 0 h 6 h 12 h 24 h 48 h Phenolic acid Syringic acid 1.23 ± 0.09a 1.22 ± 0.05a 1.17 ± 0.09a 0.93 ± 0.17d 1.88 ± 0.32c 2.83 ± 0.57b 4.13 ± 0.06a 2.8 ± 0.1b Protocatechuic acid 1.63 ± 0.01a 1.54 ± 0.05b 0.99 ± 0.03c 1.27 ± 0.06a 0.98 ± 0.07b 0.76 ± 0.06c 0.74 ± 0.04c 0.68 ± 0.05c Ellagic acid 5.42 ± 0.08a 5.12 ± 0.07b 2.66 ± 0.01c 25.52 ± 2.39b 35.35 ± 2.89a 34.32 ± 1.63a 37.01 ± 1.56a 11.94 ± 0.47c Gallic acid 39.29 ± 1.82a 43.09 ± 2.41a 23.89 ± 0.17b 39.53 ± 1.09a 11.83 ± 1.82b 8.13 ± 0.62c 1.49 ± 0.14d 0.66 ± 0.17d Ellagic acid derivatives Ellagic acid pentoside 16.89 ± 0.12a 15.58 ± 0.33b 11.33 ± 0.41c 4.31 ± 0.65a 1.27 ± 0.05b 1.19 ± 0.04b 1.17 ± 0.06b 1.17 ± 0.13b Ellagic acid hexoside 3.73 ± 0.1b 4.01 ± 0.05a 3.11 ± 0.04c 1.28 ± 0.07c 1.51 ± 0.03a 1.49 ± 0.02a 1.36 ± 0.01b 1.37 ± 0.03b Ellagitannin Galloyl-HHDP-glucose 44.91 ± 2.49a 42.99 ± 0.5a 19.02 ± 0.21b 19.61 ± 0.3a 4.27 ± 0.67b 2.76 ± 0.16c 0.72 ± 0.1d 0.7 ± 0.1d Trigalloyl-HHDP-glucose 143.09 ± 5.73a 127.48 ± 8.57a 20 ± 1.37c 20.54 ± 2.03b 50.91 ± 24.71a 29.62 ± 12.53ab 29.93 ± 12.01ab 19.91 ± 8.75b HHDP-glucose 65.85 ± 0.25a 57.82 ± 0.87b 41.37 ± 1.05c 42.71 ± 3.95a 5.92 ± 1.66b 3.58 ± 0.35b 2.05 ± 0.12b 1.89 ± 0.41b Galloyl-bis-HHDP-glucose 2.02 ± 0.42a ND ND ND ND ND ND ND Bis-HHDP-glucose 35.51 ± 0.42a 31.16 ± 0.39b 16.24 ± 0.21c 14.39 ± 0.61c 21.76 ± 2.16a 23.09 ± 0.57a 21.76 ± 0.88a 19.11 ± 0.3b Digalloyl-HHDP glucose 4.21 ± 0.07a 4.28 ± 0.03a 2.13 ± 0.01b 1.81 ± 0.03a 1.54 ± 0.08b 1.36 ± 0.03c 1.17 ± 0.1d 1.15 ± 0.1d Casuarinin 24.72 ± 0.37b 31.16 ± 0.56a 23.32 ± 0.37c 1.33 ± 0.02a 1.25 ± 0.02b 1.22 ± 0.01b 1.17 ± 0.01c 1.19 ± 0.01c Gallic acid derivatives Monogalloyl-glucose 8.88 ± 0.28a 2.66 ± 0.11b 8.86 ± 0.54a 14.45 ± 0.52a 3.55 ± 0.15b 3.26 ± 0.03b 0.3 ± 0.1c 0.31 ± 0.01c Digalloyl-glucose 5.94 ± 0.48a 5.97 ± 0.31a 2.54 ± 0.09b 3.74 ± 0.71a 0.36 ± 0.01b 0.32 ± 0.1b 0.27 ± 0.01b ND 1,3,6-Tri-O-galloyl-β- d 3.45 ± 0.3a 2.99 ± 0.09a 0.67 ± 0.02b 0.48 ± 0.3a 0.27 ± 0.01a 0.26 ± 0.01a ND ND Flavone Quercetin 0.42 ± 0.01b 0.42 ± 0.02a ND 0.25 ± 0.02a 0.24 ± 0.01d 0.24 ± 0.03d 0.24 ± 0.01c 0.24 ± 0.01b Kaempferol 0.41 ± 0.01b 0.41 ± 0.01a ND 0.23 ± 0.01b 0.23 ± 0.05a 0.23 ± 0.01ab 0.23 ± 0.02ab 0.23 ± 0.01b Different letters indicate significant differences, p Ellagitannins are hydrolyzable tannins characterized by a glucose/polyol core esterified with gallic acid-derived hexahydroxydibenzoyl (HHDP) units ( Lipinska et al., 2014 After colonic fermentation, most WPP components exhibited further degradation, presumably due to microbial utilization. While there were still some fractions that increased first and then decreased. The content of trigalloyl-HHDP-glucose increased from 20.54 to 50.91 μg/mL after 6 h of fermentation, and then decreased to 19.91 μg/mL after 48 h of fermentation. The content of bis-HHDP-glucose increased from 14.39 to 23.09 μg/mL at 12 h fermentation, and then decreased to 19.11 μg/mL at 48 h fermentation. Ellagic acid was increased from 0 to 24 h, while it decreased greatly at 48 h, which may be due to some ellagitannins being converted into ellagic acid at 0–24 h, while ellagic acid was metabolized into urolithins by the intestinal microbiota. Urolithins are products of ellagic acid metabolism by the gut microbiota. In support of this metabolic pathway, we detected several urolithin metabolites. There was a significant accumulation of urolithins (especially urolithin A, urolithin C, urolithin M5, and urolithin M6), with urolithin M5 showing the most marked accumulation during fermentation ( Table 2 Fig. 4 Table 2 Urolithins levels after colonic fermentation. Table 2 Urolithins Fermentation (peak area×10 −7 0 h 6 h 12 h 24 h 48 h Urolithin B ND 0.19 ± 0.01b 0.27 ± 0.01ab 0.26 ± 0.04ab 0.28 ± 0.04a Urolithin A 1.03 ± 0.22c 4.00 ± 0.57c 2.08 ± 0.17c 104.28 ± 4.42b 431.25 ± 15.91a Urolithin C 0.16 ± 0.10c 9.65 ± 0.68c 62.07 ± 4.53c 382.62 ± 27.44b 923.76 ± 70.37a Urolithin M6 0.56 ± 0.03c 13.83 ± 1.12c 54.14 ± 4.84c 268.47 ± 28.70b 420.41 ± 35.71a Urolithin D 10.18 ± 0.70a 1.35 ± 0.10b 0.36 ± 0.19b ND ND Urolithin M5 10.17 ± 6.36c 2548.11 ± 504.58ab 1995.27 ± 304.87b 2145.21 ± 222.76ab 2843.78 ± 298.10a Different letters indicate significant differences, p Fig. 4 Proposed biotransformation pathways of walnut kernel pellicle polyphenols (WPP) through gastrointestinal digestion and colonic fermentation. Trigalloyl-HHDP-glucose and galloyl-bis-HHDP-glucose undergo initial hydrolysis, facilitated by enzymatic activity, gut microbiota, or acidic/alkaline conditions, releasing galloyl units and yielding intermediates such as galloyl-HHDP-glucose and HHDP-glucose. The HHDP is highly unstable and rapidly undergoes spontaneous lactonization to form ellagic acid. Additionally, ellagic acid derivatives, including ellagic acid hexoside and ellagic acid pentoside, can be hydrolyzed under similar conditions (acidic/alkaline environments or microbial action) to release ellagic acid along with their corresponding sugar moieties. Subsequently, ellagic acid can be further metabolized by the gut microbiota through a series of dehydroxylation and decarboxylation reactions, ultimately yielding bioactive urolithins such as Urolithin A, B, and C. Fig. 4 3.5 Bioaccessibility of WPP Bioaccessibility refers to the proportion of food-derived bioactive compounds that are released from the food matrix during digestion and become available for intestinal absorption ( Dominguez-Fernandez et al., 2021 Table 3 d Table 3 Accessibility of walnut kernel pellicle polyphenols (WPP) after intestinal digestion. Table 3 Category Components WPP (μg/mg) WPP (Intestinal digestion) (μg/mg) Bio-accessibility(%)(Intestinal digestion) Phenolic acid Syringic acid 1.23 ± 0.09 1.17 ± 0.09 95.17 ± 0.11 Protocatechuic acid 1.63 ± 0.01 0.99 ± 0.03 60.98 ± 0.02 Ellagic acid 5.42 ± 0.08 2.66 ± 0.01 49.10 ± 0.01 Gallic acid 39.29 ± 1.82 23.89 ± 0.17 61.00 ± 0.02 Ellagic acid derivatives Ellagic acid pentoside 16.89 ± 0.12 11.33 ± 0.41 67.00 ± 0.08 Ellagic acid hexoside 3.73 ± 0.1 3.11 ± 0.04 83.40 ± 0.01 Ellagitannin Galloyl-HHDP-glucose 44.91 ± 2.49 19.02 ± 0.21 42.36 ± 0.04 Trigalloyl-HHDP-glucose 143.09 ± 5.73 20 ± 1.37 13.98 ± 0.10 HHDP-glucose 65.85 ± 0.25 41.37 ± 1.05 62.80 ± 0.02 Galloyl-bis-HHDP-glucose 2.02 ± 0 ND None Bis-HHDP-glucose 35.51 ± 0.42 16.24 ± 0.21 45.77 ± 0.01 Digalloyl-HHDP glucose 10.52 ± 0.28 10.49 ± 0.55 99.71 ± 0.05 Cauarinin 24.72 ± 0.37 23.32 ± 0.37 94.39 ± 0.01 Gallic acid derivatives Monogalloyl-glucose 8.88 ± 0.28 8.86 ± 0.54 99.78 ± 0.06 Digalloyl-glucose 5.94 ± 0.48 2.54 ± 0.09 42.74 ± 0.02 1,3,6-Tri-O-galloyl-β- d 3.45 ± 0.3 0.67 ± 0.02 19.43 ± 0.01 3.6 Effect of WPP on the diversity of intestinal microbiota Polyphenols retained during the gastrointestinal digestion stage will reach the colon, where they play a pivotal role in modulating intestinal microbiota ( Zhao et al., 2021 Fig. 5 Chen et al., 2021 Stojanov et al., 2020 Fig. 5 Fig. 5 Effect of walnut kernel pellicle polyphenols (WPP) on gut microbiota. (A) Hierarchical clustering dendrogram, (B) Principal coordinate analysis (PCoA), (C) Gut microbiota composition at phylum level, (D) Gut microbiota composition at genus level, (E) Gut microbiota composition at species level. Three replicates were performed for each experiment. Fig. 5 From the genus level analysis, fermentation with WPP caused a significant rise in the abundance of Megamonas Faecalibacterium Ruminococcus Dorea Mediterraneibacter Blautia Fig. 4 Fig. 6 Megamonas rupellensis Faecalibacterium prausnitzii Fig. 5 Fig. 6 Megamonas rupellensis Jia et al., 2022 Faecalibacterium prausnitzii Leylabadlo et al., 2020 Blautia wexlerae Dorea longicatena Ruminococcus sp. Mediterraneibacter faecis Ruminococcus sp. Dorea formicigenerans Dorea formicigenerans Dorea formicigenerans Ferreiro et al., 2023 Dorea longicatena Liu et al., 2017 Ruminococcus Ruminococcus gnavus Ruminococcus sp. Ruminococcus sp. Blautia wexlerae Yan et al., 2023 g_Megamonas s_Megamonas_rupellensis Fig. 6 Fig. 6 Effect of walnut kernel pellicle polyphenols (WPP) on gut microbiota. (A) Genus-level comparison of gut microbiota, (B) Genus-level comparison of gut microbiota, (C) LDA effect size (LEfSe) analysis. Three replicates were performed for each experiment. * p p p Fig. 6 Overall, WPP could regulate intestinal microbiota through increasing Megamonas rupellensis Faecalibacterium prausnitzii Blautia wexlerae Dorea longicatena Ruminococcus sp. Mediterraneibacter faecis Ruminococcus sp. Dorea formicigenerans 3.7 Effect of WPP on intestinal microbiota metabolites 3.7.1 SCFAs contents Polyphenols engage in a bidirectional relationship with gut microbiota: while undergoing microbial metabolism, they simultaneously regulate microbial composition and metabolic activity. A key consequence of this interaction is the production of SCFAs, including acetate, propionate, and butyrate. SCFAs confer multiple health benefits by strengthening intestinal barrier integrity, reducing systemic endotoxin levels, and suppressing inflammatory responses ( Parada Venegas et al., 2019 Lonicera caerulea Cao et al., 2023 Arctium lappa Lou et al., 2024 Our results agreed with these findings, demonstrating that WPP fermentation significantly altered SCFAs profiles. As shown in Fig. 7 vs. Fig. 7 Fig. 7 Ban et al., 2023 Fig. 7 Ding et al., 2019 versus Fig. 7 van der Beek et al., 2015 Fig. 7 Liu et al., 2024 Fig. 7 Effect of walnut kernel pellicle polyphenols (WPP) on gut short chain fatty acids (SCFAs) levels. (A) Changes in pH, (B) Changes in total SCFAs level, (C) Changes in acetic acid level, (D) Changes in propionic acid level, (E) Changes in butyric acid level, (F) Changes in isovaleric acid level. Three replicates were performed for each experiment. Different letters indicate significant differences, p Fig. 7 3.7.2 Indole derivatives Indole and its derivatives constitute a class of biologically active metabolites produced through gut microbial metabolism of tryptophan. These compounds serve as critical mediators in host physiology and have been associated with various pathological conditions, including neuropsychiatric disorders, inflammatory bowel diseases, colorectal cancer, metabolic syndrome, and immune dysregulation ( Ala, 2022 Wang et al., 2024 Fig. 8 Fig. 8 Liu et al., 2022 Sehgal et al., 2022 Fig. 8 Effect of walnut kernel pellicle polyphenols (WPP) on gut indole derivative contents. (A) Changes in indole-3-carboxaldehyde content, (B) Changes in indole-3-acetic acid content, (C) Changes in indole-3-propionic acid content, (D) Changes in indole-3-acrylic acid content, (E) Changes in indole-3-pyruvic acid content, (F) Changes in indole-3-butyric acid content. Three replicates were performed for each experiment. Different letters indicate significant differences, p Fig. 8 3.8 Correlation analysis between gut microbiota and microbial metabolites To evaluate the relationship between gut microbiota and microbial metabolites, we conducted a correlation analysis. As shown in Fig. 9 Gemmiger Ruminococcus Mediterraneibacter Anaerobutyricum Blautia Fusicatenibacter Dorea Coprococcus Clostridium Phascolarctobacterium Megamonas Blautia wexlerae Fusicatenibacter saccharivorans Mediterraneibacter faecis Anaerobutyricum hallii Faecalibacterium sp. Phascolarctobacterium succinatutens Megamonas rupellensis Fig. 9 Correlation analysis between the most abundant gut microbiota (top 30 species) and microbial metabolites. (A) The genus level, (B) The species level. * p p Fig. 9 Furthermore, as WPP has excellent antioxidant and gut microbiota-regulating activities, it can be used in the food industry, such as fortification of walnut-based products ( e.g. 4 Conclusion Our study developed an optimized extraction and purification protocol for WPP, yielding a high-purity polyphenol containing 585.30 mg GAE/g, predominantly composed of ellagic acid and ellagitannins. After gastrointestinal digestion, WPP contents and antioxidant activity decreased to some extent. During in vitro Megamonas rupellensis Faecalibacterium prausnitzii Dorea longicatena Blautia wexlerae e.g. Megamonas rupellensis e.g. in vitro e.g. e.g. CRediT authorship contribution statement Xinyu Yuan: Qiqi Feng: Qing Wang: Tao Wang: Zhu Qiao: Hongyu Pan: Yujie Zhong: Yongliang Zhuang: Funding This work was supported by the 10.13039/501100005273 Yunnan Provincial Natural Science Foundation 202401CF070119 Major Science and Technology Projects in Yunnan Province 202402AE090031 Yunnan Fundamental Research Projects 202501AT070356 Special Project for High-level Scientific and Technological Talents and Innovation Teams of Yunnan Province 202405AS350005 Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References Ala M. Tryptophan metabolites modulate inflammatory bowel disease and colorectal cancer by affecting immune system International Reviews of Immunology 41 3 2022 326 345 10.1080/08830185.2021.1954638 34289794 Aziz T. Hussain N. Hameed Z. Lin L. Elucidating the role of diet in maintaining gut health to reduce the risk of obesity, cardiovascular and other age-related inflammatory diseases: Recent challenges and future recommendations Gut Microbes 16 1 2024 2297864 10.1080/19490976.2023.2297864 38174551 PMC10773664 Ban Q. Chi W. Tan Y. Wang S. Li N. Song L. Huang X. Wang D. Peng W. Granato D. Zhao G. Melatonin improved glucose homeostasis is associated with the reprogrammed gut microbiota and reduced fecal levels of short-chain fatty acids in db/db mice Food Science & Nutrition 11 4 2023 2012 2026 10.1002/fsn3.3237 37051358 PMC10084979 van der Beek C.M. Bloemen J.G. van den Broek M.A. Lenaerts K. Venema K. Buurman W.A. Dejong C.H. Hepatic uptake of rectally administered butyrate prevents an increase in systemic butyrate concentrations in humans Journal of Nutrition 145 9 2015 2019 2024 10.3945/jn.115.211193 26156796 Çalhan S.D. Meryemoglu B. Eroglu P. Sacli B. Kalderis D. Subcritical water extraction of Onosma mutabilis Molecules 28 5 2023 2314 10.3390/molecules28052314 36903560 PMC10005700 Cao X. Wang X. Ren Y. Sun Y. Yang Z. Ge J. Ping W. Lonicera caerulea L. polyphenols improve short-chain fatty acid levels by reshaping the microbial structure of fermented feces in vitro Frontiers in Microbiology 14 2023 1 15 10.3389/fmicb.2023.1228700 PMC10641692 37965545 Chen B. Misrani A. Long C. He Z. Chen K. Yang L. Pigment of Ceiba speciosa Molecules 27(11), Article 3555 2022 10.3390/molecules27113555 PMC9182074 35684492 Chen Y. Zhou J. Wang L. Role and mechanism of gut microbiota in human disease. Frontiers in Cellular and Infection Microbiology 11 2021 625913 10.3389/fcimb.2021.625913 PMC8010197 33816335 Cui W.Y. Chen F.C. Sun Z.Y. Cui C.F. Xu B. Shen W.J. … Cheng A. Catabolism of phenolics from grape peel and its effects on gut microbiota during in vitro Journal of the Science of Food and Agriculture 104 2024 7182 7193 10.1002/jsfa.13540 38624038 Ding Y. Yan Y. Peng Y. Chen D. Mi J. Lu L. Luo Q. Li X. Zeng X. Cao Y. In vitro Lycium barbarum International Journal of Biological Macromolecules 125 2019 751 760 10.1016/j.ijbiomac.2018.12.081 30552927 Dominguez-Fernandez M. Ludwig I.A. De Pena M.-P. Cid C. Bioaccessibility of Tudela artichoke ( Cynara scolymus Food & Function 12 5 2021 1996 2011 10.1039/d0fo03119d 33537693 Fang X. Wu T. Xiao L. Broadly targeted metabolomics analysis of differential metabolites between light yellow and purple walnut endocarps Food Science 42 12 2021 215 221 10.7506/spkx1002-6630-20191108-099 Ferreira A.S. Silva A.M. Pinto D. Moreira M.M.M. Ferraz R. Svarc-Gajic J. … Rodrigues F. New perspectives on the sustainable employment of chestnut shells as active ingredient against oral mucositis: A first screening International Journal of Molecular Sciences 23(23), Article 14956 2022 10.3390/ijms232314956 PMC9737246 36499282 Ferreiro A.L. Choi J. Ryou J. Newcomer E.P. Thompson R. Bollinger R.M. … Dantas G. Gut microbiome composition may be an indicator of preclinical alzheimer’s disease Science Translational Medicine 15(700), Article eabo2984 2023 10.1126/scitranslmed.abo2984 PMC10680783 37315112 Gao K. Mu C. Farzi A. Zhu W. Tryptophan metabolism: A link between the gut microbiota and brain Advances in Nutrition 11 3 2020 709 723 10.1093/advances/nmz127 31825083 PMC7231603 Ge Q. Hou C.L. Rao X.H. Zhang A.Q. Xiao G.M. Wang L.Y. … Chen L.C. In vitro International Journal of Biological Macromolecules 262 2 2024 129994 10.1016/j.ijbiomac.2024.129994 38325690 Hou M. Zhou Y. Lin C. Shi J. Hou H. Ma Y. Zhu L. Bian Z. Green valorization of chaenomelis fructus agro-industrial by-products as a source of phenolics: Ultrasound-assisted extraction, adsorptive enrichment and quality control Food Chemistry 472 2025 10.1016/j.foodchem.2025.142908 39842195 Hua Z. Wu Q. Yang Y. Liu S. Jennifer T.G. Zhao D. Fang Y. Essential roles of ellagic acid-to-urolithin converting bacteria in human health and health food industry: An updated review Trends in Food Science & Technology 151, Article 104622 2024 10.1016/j.tifs.2024.104622 Jia M. Li D. Wang R. Wang A. Strappe P. Wu Q. Shang W. Wang X. Zhuang M. Blanchard C. Zhou Z. Gut microbiota derived structural changes of phenolic compounds from colored rice and its corresponding fermentation property Food & Function 13 20 2022 10759 10768 10.1039/d2fo01678h 36190142 Kalkan A.E. Binmowyna M.N. Raposo A. Ahmad M.F. Ahmed F. Otayf A.Y. … Karav S. Beyond the gut: Unveiling butyrate’s global health impact through gut health and dysbiosis-related conditions: A narrative review Nutrients 17 8 2025 1305 10.3390/nu17081305 40284169 PMC12029953 Leylabadlo H.E. Ghotaslou R. Feizabadi M.M. Farajnia S. Moaddab S.Y. Ganbarov K. … Kafil H.S. The critical role of faecalibacterium prausnitzii in human health: An overview Microbial Pathogenesis 149, Article 104344 2020 10.1016/j.micpath.2020.104344 32534182 Li Y. Wang W. Deng Y. Gao J. Shi J. Cai L. Antioxidant properties and changes in vitro Food Chemistry 442 2024 10.1016/j.foodchem.2024.138416 38241988 Lipinska L. Klewicka E. Sojka M. The structure, occurrence and biological activity of ellagitannins: A general review Acta Scientiarum Polonorum. Technologia Alimentaria 13 3 2014 289 299 10.17306/J.AFS.2014.3.7 24887944 Liu J. Tan Y. Cheng H. Zhang D. Feng W. Peng C. Functions of gut microbiota metabolites, current status and future perspectives Aging and Disease 13 4 2022 1106 1126 10.14336/AD.2022.0104 35855347 PMC9286904 Liu M. Zhang Y. Liu J. Xiang C. Lu Q. Lu H. Yang T. Wang X. Zhang Q. Fan C. Feng C. Zou D. Li H. Tang W. Revisiting the role of valeric acid in manipulating ulcerative colitis Inflammatory Bowel Diseases 30 4 2024 617 628 10.1093/ibd/izad187 38206334 Liu R. Hong J. Xu X. Feng Q. Zhang D. Gu Y. Shi J. Zhao S. Liu W. Wang X. Xia H. Liu Z. Cui B. Liang P. Xi L. Jin J. Ying X. Wang X. Zhao X. … Wang W. Gut microbiome and serum metabolome alterations in obesity and after weight-loss intervention Nature Medicine 23 7 2017 859 868 10.1038/nm.4358 28628112 Lou J. Liu Y. Xu N. Cai Q. Liu M. Zheng Y. Sun Y. Qu Y. Arctium lappa Journal of Functional Foods 120 2024 10.1016/j.jff.2024.106348 Massaga C. Paul L. Kwiyukwa L.P. Vianney J.-M. Chacha M. Raymond J. Computational analysis of urolithin a as a potential compound for anti-inflammatory, antioxidant, and neurodegenerative pathways Free Radical Biology and Medicine 227 2025 508 520 10.1016/j.freeradbiomed.2024.12.003 39643139 Morzel M. Canon F. Guyot S. Interactions between salivary proteins and dietary polyphenols: Potential consequences on gastrointestinal digestive events Journal of Agricultural and Food Chemistry 70 21 2022 6317 6327 10.1021/acs.jafc.2c01183 35583948 Nash V. Ranadheera C.S. Georgousopoulou E.N. Mellor D.D. Panagiotakos D.B. McKune A.J. … Naumovski N. The effects of grape and red wine polyphenols on gut microbiota-a systematic review Food Research International 113 2018 277 287 10.1016/j.foodres.2018.07.019 30195522 Parada Venegas D. De la Fuente M.K. Landskron G. Julieta Gonzalez M. Quera R. Dijkstra G. … Hermoso M.A. Short chain fatty acids (SCFAs)-mediated gut epithelial and immune regulation and its relevance for inflammatory bowel diseases Frontiers in Immunology 10 2019 277 10.3389/fimmu.2019.00277 30915065 PMC6421268 Pycia K. Ivanisova E. Physicochemical and antioxidant properties of wheat bread enriched with hazelnuts and walnuts Foods 9 8 2020 1081 10.3390/foods9081081 32784390 PMC7466170 Sedem Dzah C. Duan Y. Zhang H. Authur D.A. Ma H. Ultrasound-, subcritical water- and ultrasound assisted subcritical water-derived tartary buckwheat polyphenols show superior antioxidant activity and cytotoxicity in human liver carcinoma cells Food Research International 137, Article 109598 2020 10.1016/j.foodres.2020.109598 33233198 Sehgal R. de Mello V.D. Mannisto V. Lindstrom J. Tuomilehto J. Pihlajamaki J. Uusitupa M. Indolepropionic acid, a gut bacteria-produced tryptophan metabolite and the risk of type 2 diabetes and non-alcoholic fatty liver disease Nutrients 14(21), Article 4695 2022 10.3390/nu14214695 PMC9653718 36364957 Shang Y.F. Miao J.H. Zeng J. Zhang T.H. Zhang R.M. Zhang B.Y. Wang C. Ma Y.L. Niu X.L. Ni X.L. Wei Z.J. Evaluation of digestibility differences for apple polyphenolics using in vitro elderly and adult digestion models Food Chemistry 390 2022 133154 10.1016/j.foodchem.2022.133154 35584576 Stojanov S. Berlec A. Strukelj B. The influence of probiotics on the firmicutes/bacteroidetes ratio in the treatment of obesity and inflammatory bowel disease Microorganisms 8 11 2020 1715 10.3390/microorganisms8111715 33139627 PMC7692443 Tan J. Ma Q. Li J. Liu Q. Zhuang Y. Bioavailability and antioxidant activity of rambutan ( Nephelium lappaceum in vitro Journal of Agricultural and Food Chemistry 71 42 2023 15829 15841 10.1021/acs.jafc.3c04106 37827988 Tan Y. Tam C.C. Rolston M. Alves P. Chen L. Meng S. … Yokoyama W. Quercetin ameliorates insulin resistance and restores gut microbiome in mice on high-fat diets Antioxidants 10 8 2021 1251 10.3390/antiox10081251 34439499 PMC8389224 Wang G. Fan Y. Zhang G. Cai S. Ma Y. Yang L. Wang Y. Yu H. Qiao S. Zeng X. Microbiota-derived indoles alleviate intestinal inflammation and modulate microbiome by microbial cross-feeding Microbiome 12 1 2024 59 10.1186/s40168-024-01750-y 38504383 PMC10949743 Wang G.D. Ren X.B. Liu J.Y. Wang W.J. Zhang C. Yuan C.L. Li J.J. Functional properties of insoluble dietary fibers extracted from different grape pomaces during simulated digestion and in vitro Food & Function 16 12 2025 10.1039/d4fo06074a 40271898 Wang Y. Ye Y. Wang L. Yin W. Liang J. Antioxidant activity and subcritical water extraction of anthocyanin from raspberry process optimization by response surface methodology Food Bioscience 44 2021 101394 10.1016/j.fbio.2021.101394 Wojtunik-Kulesza K. Oniszczuk A. Oniszczuk T. Combrzynski M. Nowakowska D. Matwijczuk A. Influence of in vitro digestion on composition, bioaccessibility and antioxidant activity of food polyphenols-a non-systematic review Nutrients 12 5 2020 1401 10.3390/nu12051401 32414132 PMC7284996 Xie J.Y. Sun N. Huang H.R. Xie J.H. Chen Y. Hu X.B. … Yu Q. Catabolism of polyphenols released from mung bean coat and its effects on gut microbiota during in vitro Food Chemistry 396 2022 133719 10.1016/j.foodchem.2022.133719 35868282 Yan Y. Wang Z. Zhou Y.-L. Gao Z. Ning L. Zhao Y. Xuan B. Ma Y. Tong T. Huang X. Hu M. Fang J.-Y. Cui Z. Chen H. Hong J. Commensal bacteria promote azathioprine therapy failure in inflammatory bowel disease via decreasing 6-mercaptopurine bioavailability Cell Reports Medicine 4 2023 10.1016/j.xcrm.2023.101153 PMC10439275 37586320 Zhang J. Wen C. Zhang H. Duan Y. Ma H. Recent advances in the extraction of bioactive compounds with subcritical water: A review Trends in Food Science & Technology 95 2020 183 195 10.1016/j.tifs.2019.11.018 Zhao M. Chang L. Song Z. He X. Interactions between plant polyphenols and intestinal microbiota and their effects on metabolic diseases Food Science 42 5 2021 305 313 10.7506/spkx1002-6630-20200228-326 Appendix A Supplementary data  Supplementary material: Table S1 Table S2 Figure S1A Figure S1B Image 1 Data availability Data will be made available on request. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.fochx.2025.103020 ",
  "metadata": {
    "Title of this paper": "Interactions between plant polyphenols and intestinal microbiota and their effects on metabolic diseases",
    "Journal it was published in:": "Food Chemistry: X",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489916/"
  }
}