{
  "title": "Paper_872",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472087 PMC12472087.1 12472087 12472087 41010969 10.3390/medicina61091578 medicina-61-01578 1 Review Imaging Modalities in Medication-Related Osteonecrosis of the Jaw: A Narrative Review of Diagnostic Findings and Staging Manole Marius Ciprian 1 † Nicoară Mihnea 2 † Burde Alexandru Victor 3 * Hedeșiu Ioana 4 Bele Dan Nicolae 5 Hedeșiu Mihaela 6 Crișan Florin 2 Grecu Alexandru 1 https://orcid.org/0000-0002-5651-7215 Sinescu Cosmin 7 https://orcid.org/0000-0002-1126-3944 Negrutiu Meda Lavinia 7 Chrcanovic Bruno Academic Editor 1 marius.manole@umfcluj.ro grecu.alexandru@umfcluj.ro 2 mihnea.ionu.nicoara@elearn.umfcluj.ro florin.crisan@institutulinimii.ro 3 4 hlihedes@liverpool.ac.uk 5 nicolae.bele@umfcluj.ro 6 mhedesiu@umfcluj.ro 7 sinescu.cosmin@umft.ro negrutiu.meda@umft.ro * burde.alexandru@umfcluj.ro † These authors contributed equally to this work. 31 8 2025 9 2025 61 9 497654 1578 27 7 2025 14 8 2025 19 8 2025 31 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results Conclusions osteonecrosis bisphosphonates osteolysis imaging cone-beam CT This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Antiresorptive agents such as bisphosphonates (BP) and denosumab (DNB) are useful in the treatment of cancer-related conditions [ 1 2 3 4 MRONJ is a severe complication marked by progressive jawbone degradation and structural changes. BPs, particularly pamidronate, are associated with the highest risk (up to 500-fold increase) [ 5 6 7 8 9 10 4 Local factors further modulate MRONJ risk. Tooth extractions are involved in most cases (up to 82%) [ 11 12 4 13 The overall prevalence of MRONJ remains low in patients treated for osteoporosis or nonmalignant bone diseases, with oral BPs (e.g., alendronate) showing a prevalence of 0.02–0.05% and intravenous zoledronate ≤ 0.02% [ 4 14 15 4 16 4 17 The MASCC/ISOO/ASCO guideline categorizes the risk of medication-related osteonecrosis of the jaw based on the intensity of bone-modifying agents and the clinical circumstances [ 18 4 18 18 For individuals receiving high-intensity BMAs, especially those undergoing or commencing cancer therapy, rigorous dental surveillance and proactive preventive measures, including pre-treatment dental assessments, are strongly advised. Patients using low-intensity BMAs, particularly those with additional risk factors or treatment durations exceeding three years, also warrant risk-stratified evaluations and individualized monitoring. Effective management necessitates close collaboration among oncologists, dentists, and oral health professionals throughout the treatment [ 4 18 19 20 2. Materials and Methods This narrative review followed the good-practice recommendations for scoping and synthesizing evidence in qualitative (narrative) literature reviews [ 21 Appendix A Studies eligible for inclusion investigated imaging findings in medication-related osteonecrosis of the jaw among human subjects who had been administered intravenous or oral BPs. The research designs incorporated observational studies, including clinical trials, case–control studies, cohort studies, and cross-sectional analyses. Studies such as case reports, reviews, investigations on animal subjects, laboratory research, and articles focusing on osteonecrosis affecting bones other than the jaw were excluded from the analysis. The titles and abstracts of all identified articles were screened against predefined eligibility criteria by two independent reviewers. Subsequently, full texts of articles deemed potentially relevant underwent detailed assessment. Disagreements were resolved through discussion, with a third reviewer consulted when necessary. Data extraction was conducted independently by the same two reviewers, utilizing a standardized form to document study design, participant characteristics, interventions, imaging modalities, and quantitative results. All outcomes of interest were predefined, with a focus on radiologic imaging features of MRONJ, such as cortical disruption, bone sclerosis, sequestration, periosteal reaction, and soft tissue involvement. Data were extracted from all-time points and imaging sequences, if available. In addition, other variables were recorded, such as duration of therapy, drug type (BPs or DNB), underlying disease (e.g., osteoporosis or cancer), MRONJ stage, and imaging protocol details. Due to substantial heterogeneity in study designs, imaging techniques, and reported outcomes, a meta-analysis was not feasible. As a result, no formal effect measures (e.g., odds ratios or mean differences) were applied. Instead, a qualitative narrative synthesis was conducted. Imaging findings were compared across modalities, MRONJ stages, and patient subgroups to identify diagnostic patterns, clinical implications, and gaps in the literature. The certainty of evidence for each imaging modality and diagnostic feature was evaluated qualitatively, based on study quality, consistency of findings, and clarity of data reporting. The methodological quality of the included studies was evaluated using a modified version of the Newcastle–Ottawa Scale, assessing three domains: selection of participants (max 4 points), comparability of groups (max 2 points), and quality of outcome/exposure assessment (max 3 points). A summary of these evaluations, along with individual justifications, is presented in Appendix B 3. Results A total of 32 studies, encompassing 3100 participants, met the predefined inclusion criteria and were incorporated into the final analysis. Among these participants, 1148 were diagnosed with medication-related osteonecrosis of the jaw, while 1952 individuals served as controls. The study designs varied, including retrospective and prospective cohorts, case–control studies, and cross-sectional analyses. The majority of studies focused on patients treated with BPs alone, while several investigations also included individuals receiving DNB or corticosteroids. The duration of antiresorptive therapy varied considerably across studies, ranging from a few months to over ten years. Commonly reported comorbidities among MRONJ cases included osteoporosis, diabetes mellitus, and various malignancies, notably breast cancer, prostate cancer, and multiple myeloma. A detailed summary of the included studies, including reference, publication year, study type, sample size, drug exposure, treatment duration, and major comorbidities, is presented in Table 1 The reviewed studies show that 18 employed conventional radiography, 21 used cone-beam computed tomography, and 9 explored magnetic resonance imaging. Several investigations incorporated multiple imaging modalities, allowing for comparative assessment. The utility of each modality varied depending on the disease stage. Radiography was commonly used for initial screening but showed limited sensitivity in early MRONJ detection. CBCT was the most frequently employed modality, offering high-resolution, three-dimensional visualization of cortical and trabecular bone changes, particularly useful for assessing the extent of bone involvement in intermediate- and late-stage disease. MRI, although used less frequently, provided valuable insights into early medullary bone changes and soft tissue involvement, potentially making it superior for identifying stage 0 MRONJ or subclinical cases. Table 2 The main imaging findings on 2D radiography and CBCT were osteosclerosis (with a prevalence ranging from 24% to 95.6%), osteolysis (23.6% to 95.6%), periosteal reaction (10% to 64%), and sequestrum formation (9.2% to 75%), as can be observed in Table 3 26 40 26 26 51 The methodological quality of the included studies was assessed using a modified Newcastle–Ottawa Scale, and the results are summarized in Appendix B 39 41 27 53 34 36 3.1. Imaging Patterns in Early Diagnosis of MRONJ (Stage 0) 3.1.1. Panoramic Images and CT/CBCT Early MRONJ imaging typically reveals osteosclerotic or lytic patterns, along with morphometric alterations visible on plain radiographs and CT scans [ 23 29 32 34 38 39 54 55 Lamina dura thickening, inferior alveolar canal prominence, and osseous sclerosis are common early indicators on panoramic and CT imaging [ 29 34 Mixed lytic-sclerotic changes dominate radiographic presentations (68.6%), whereas periosteal reactions are rare (7.1%) [ 22 38 3.1.2. MRI Examination MRI is valuable for detecting early MRONJ changes, particularly cancellous bone involvement and ill-defined lytic areas. Loss of the normal T1 hyperintensity in the mandible and maxilla has been identified as an early marker, preceding bone destruction [ 56 57 Quantitative techniques such as diffusion-weighted imaging (DWI) and apparent diffusion coefficient (ADC) mapping have shown promise. With an ADC cutoff of 1.06 × 10 3 2 51 Dynamic contrast-enhanced MRI (DCE) has demonstrated perfusion abnormalities in MRONJ, correlating with qualitative findings from UTE-MRI. Significant parameters included wash-in rate, peak perfusion, and time to peak, though no differences were linked to lesion morphology (osteolytic vs. sclerotic) [ 52 Both CT and MRI outperform panoramic radiographs in early lesion detection (accuracy: 96% and 92% vs. 54%), though both tend to overestimate lesion extent intraoperatively [ 25 50 3.2. Imaging Findings for Late Diagnosis of MRONJ (Stages I–III) 3.2.1. Panoramic Images and CT/CBCT In advanced MRONJ (stages I–III), imaging typically reveals sclerosis, osteolysis, sequestration, and periosteal reaction, with the latter more frequently associated with stage III disease [ 36 29 CBCT has shown significantly higher diagnostic accuracy than panoramic radiography for identifying non-vital bone (AUC: 0.88 vs. 0.562, p 39 33 Quantitative morphometric analysis improves CT-based staging by measuring changes in cortical and trabecular structures. Indicators such as elevated mandibular cortical index (MCI) [ 23 28 44 Measurements of cortical thickness around the mental foramen demonstrated high reproducibility and strong association with MRONJ presence [ 41 31 42 Panoramic radiography detects MRONJ lesions in only approximately 54% of cases, while CT and MRI yield much higher accuracy (96% and 92%, respectively), independent of clinical stage [ 25 27 3.2.2. MRI Examination MRI complemented CT in MRONJ stage III by highlighting adjacent soft tissue involvement, seen as areas of high STIR signal intensity. Bedogni et al. [ 58 Krishnan et al. [ 56 49 3.3. Imaging Pattern of MRONJ in the Presence of Comorbidities, Other Medications, and Dental Infections Several imaging features appear more frequently in patients treated with antiresorptive agents, including sclerosis, visible alveolar sockets, enhanced lamina dura and mandibular canal, periosteal reaction, and cortical osteolysis, particularly in oncologic patients compared to those treated for non-malignant conditions [ 30 Widening of the periodontal ligament (PDL) and generalized bone loss have also been investigated as potential radiographic biomarkers. In patients treated with zoledronic acid, PDL widening was noted in 25% of MRONJ cases (with 75% generalized), while multiple myeloma patients more often showed localized changes (96%). The average periodontal bone loss reached 30.2% [ 37 Comparisons between cancer patients treated with zoledronate and healthy controls revealed radiographic changes in the alveolar cortex, medullary bone, and dentoalveolar region, most commonly in the posterior mandible (45.3%), likely due to local vascular differences. However, associations with cancer type or regimen remained inconclusive [ 32 The route of drug administration appears to influence radiographic patterns, as buccolingual cortical perforations were more frequently seen in patients receiving intravenous BPs, although no clear correlation was found with treatment duration or clinical staging [ 40 CBCT evaluations following tooth extraction have identified imaging features strongly associated with subsequent MRONJ development. Findings such as lamina dura thickening, widened PDL space, osteosclerosis, osteolysis, and sequestration were notably present in patients who later developed osteonecrosis. Substantial inter-reader agreement (κ = 0.69) confirmed the reliability of this diagnostic framework [ 43 3.4. Imaging Pattern of MRONJ in the Presence of Osteomyelitis (OM) and Osteoradionecrosis (ORN) Given the similarities between the histopathologies of MROJN, OM, and ORN, a certain degree of radiological feature overlap is to be expected. Both conventional 2D radiography and CBCT tend to reveal the same patterns of structural bone changes with varying degrees of diagnostic accuracy [ 42 59 60 25 24 In MRONJ, CBCT scans commonly reveal internal bone textures that are both lytic and sclerotic, along with sequestration, buccal or lingual periosteal reactions, and cortical perforation. These characteristics are observed more frequently than in ORN, where periosteal changes are typically absent [ 45 To standardize assessment, composite radiographic indices (CRIs) have been proposed. One such CRI scores sclerosis, lysis, periosteal reaction, and sequestration (0–2 per feature), yielding a total between 0–8. Scores above 6 correlate with advanced clinical staging [ 36 34 Yfanti et al. [ 46 Advanced approaches using radiomics and texture analysis have also emerged. A CT-based model incorporating gray-level run length and zone length matrix features achieved promising diagnostic performance for staging MRONJ by capturing bone marrow changes [ 47 4. Discussion This review focused on structural imaging findings of MRONJ as evidenced through clinical studies. The modalities that were discussed were dental radiographs, CT/CBCT, and MRI, with the first two being part of routine practice in dentistry and the latter enjoying widespread use in general medicine and gradually being adapted to the needs of the dental community. The studies included in our analysis reflect this fact: only 29 out of the 32 studies described CT or 2D radiological findings, and only 3 studies focused solely on MRI. Studies that compared CT with MRI (five studies) highlight the ongoing need to validate the more expensive and time-consuming examination as a practical alternative to the established standard. Different imaging modalities offer distinct advantages and trade-offs. Dental radiographs and CBCT remain the first-line diagnostic tools due to their accessibility and cost-effectiveness. However, their limitations, such as the need for significant bone loss to detect changes, restrict their utility in early-stage diagnosis. Studies like those by Stockmann et al. [ 25 39 MRI, though underutilized, offers unique advantages in soft tissue characterization and early bone marrow changes. For example, Krishnan et al. [ 56 57 51 Imaging findings such as osteosclerosis, osteolysis, periosteal reaction, and sequestration provide critical insights into the disease’s pathophysiology and progression. For example, Walton et al. [ 36 41 31 Imaging modalities are indispensable for monitoring treatment responses and disease progression. Features like sequestration and cortical irregularity, as reported by Ogura et al. [ 45 36 To support clinical decision-making, we synthesized data from the included studies into a comparative summary of each imaging modality’s diagnostic limitations, accessibility, and institutional impact. Table 4 Additionally, imaging plays a role in evaluating the impact of treatment interventions, such as drug holidays or surgical procedures. For instance, Soundia et al. [ 34 4.1. Challenges and Future Directions The variability in imaging findings across studies highlights the need for standardized protocols and scoring systems. The lack of consensus on imaging patterns and their correlation with clinical stages impedes the development of universal diagnostic and management guidelines. Future research should focus on establishing such standards, particularly for advanced imaging techniques like MRI and PET/CT. Functional imaging (e.g., SPECT and PET) is a promising avenue for MRONJ diagnosis, as it can reveal metabolic changes beyond the detection capabilities of structural imaging. Single-photon emission computer tomography can create a 3D metabolic map of the entire body, with every voxel having a specific uptake value (SUV), using molecules known as tracers to target specific tissues. Spatial resolution can be further enhanced in conjunction with CT imaging (SPECT/CT). Some of the available radiotracers helpful in imaging MRONJ are 99Tcm-DPD, 99Tcm-MDP, and 99mTc-HMDP. In a recent small study, 18F-fluoride PET showed markedly higher uptake in MRONJ-affected bone than 18F-FDG, corresponding with greater osteocyte density on histology, whereas micro-CT revealed no significant microarchitectural differences [ 60 66 67 Furthermore, functional imaging findings can have clinical significance. The sensitivity of SPECT/CT has outpaced CT and MRI imaging for quite some time [ 63 45 68 69 69 Of course, there is still much room for improvement. PET/CT has started to be investigated as a potential way to combine the high sensitivity of functional imaging with the fidelity and spatial resolution of conventional imaging techniques. Abnormal FDG uptake was demonstrated in MRONJ-affected bone when compared with normal jaw [ 65 70 When comparing the clinical applications of functional and structural imaging, Guggenberger et al. [ 50 Radiomics and artificial intelligence (AI) offer promising avenues for addressing these challenges. Textural analysis and machine learning models, such as that by Ito et al. [ 47 70 As of the writing of this article, no validated imaging-based deep learning model for the prediction of MRONJ exists. However, this approach could lead to promising results, as was the case for osteonecrosis of the hip, where such models showed comparable diagnostic accuracy to experienced orthopedic surgeons [ 71 65 Similarly, micro-CT studies, such as those by Schoenhof et al. [ 72 4.2. Limitations The present review highlights several limitations that restrict the generalizability and clinical applicability of the findings. Patient cohorts varied in clinical indication, antiresorptive drug type, treatment duration (from a few months to over ten years), and MRONJ stage distribution. Imaging protocols were inconsistent, encompassing diverse modalities with variable technical parameters (e.g., CT voxel resolution, MRI sequence type) and heterogeneous image analysis or scoring methods. Definitions of diagnostic outcomes also varied: studies assessed different radiographic parameters of disease extent or severity and often applied non-uniform MRONJ staging or lesion classification systems. All 32 studies were observational and non-randomized (Levels 3–4 evidence per Oxford criteria [ 73 74 40 31 32 39 25 Imaging protocols and outcome definitions varied considerably, complicating cross-study comparisons. Inconsistencies were noted in voxel size, MRI sequences, image scoring, and MRONJ staging systems. Emerging modalities (e.g., texture analysis [ 47 49 50 56 57 7 18 55 18 55 54 5. Conclusions Imaging is essential for diagnosing and managing MRONJ, but current approaches vary across different types. Differences in imaging results, terminology, and diagnostic thresholds mirror the different protocols, study designs, and disease presentations. Standard tools like panoramic radiography and CBCT are common, but they are limited in identifying the disease in its early stages. Newer methods, such as PET/CT and radiomics, could offer quantifiable indicators of the disease, but they are not standardized or routinely employed yet. To enhance diagnostic accuracy and clinical decision-making, there is a clear need for unified imaging criteria, validated scoring systems, and greater integration of functional and structural imaging. Future large-scale, prospective studies are essential to establish the reliability and clinical utility of these advanced techniques, ultimately contributing to earlier detection, more accurate staging, and improved outcomes for MRONJ patients. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.C.M., M.L.N. and A.V.B.; methodology, M.C.M., I.H. and A.V.B.; data curation, M.C.M., A.G. and A.V.B., with support from I.H., D.N.B., M.N. and M.H.; formal analysis, M.C.M., M.L.N. and A.V.B.; investigation, M.C.M. and A.V.B., with support from I.H., D.N.B., M.N., C.S. and M.H.; writing—original draft preparation, A.V.B., M.C.M., M.L.N. and F.C.; writing—review and editing, A.V.B. and M.H.; visualization, M.C.M. and A.V.B.; supervision, M.C.M.,C.S., M.L.N. and A.V.B.; project administration, F.C., M.C.M. and A.V.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical review and approval were waived for this study because it did not involve humans or animals. Informed Consent Statement Not applicable. Data Availability Statement No datasets were generated or analyzed during the current study. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ADC apparent diffusion coefficient AI artificial intelligence AUC area under the curve BC breast cancer BMD bone mineral density BP bisphosphonates BRONJ bisphosphonate-related osteonecrosis of the jaw CBCT cone-beam computed tomography CRI composite radiographic index CS corticosteroids CT computed tomography DNB denosumab DM diabetes mellitus DWI diffusion-weighted imaging JM jaw metastases m-TOR mammalian target of rapamycin MDP technetium-99m-methylene diphosphonate MM multiple myeloma MRI magnetic resonance imaging MRONJ medication-related osteonecrosis of the jaw OM osteomyelitis OPT orthopantomogram (panoramic radiograph) ONJ osteonecrosis of the jaw ORN osteoradionecrosis PCa prostate cancer PET/CT positron emission tomography/computed tomography PET/MRI positron emission tomography/magnetic resonance imaging RA rheumatoid arthritis RANKL receptor activator of nuclear factor kappa-B ligand ROC receiver operating characteristic SLE systemic lupus erythematosus STIR short tau inversion recovery SUV standardized uptake value SPECT single-photon emission computed tomography T1 T1-weighted MRI signal T2 T2-weighted MRI signal UTE-MRI ultrashort echo time magnetic resonance imaging 99mTc-DPD technetium-99m-dicarboxypropane diphosphonate 99mTc-HMDP technetium-99m-hydroxymethylene diphosphonate 3D three-dimensional Appendix A medicina-61-01578-t0A1_Table A1 Table A1 Detailed search strategy for systematic review. Variable Search Strategy Database searched MEDLINE (accessed through PubMed) and EBSCO databases from their origin until 23 January 2024 Search strategy for PubMed (“Bisphosphonate-Associated Osteonecrosis of the Jaw/diagnostic imaging”[Mesh]) OR ((“osteonecrosis “OR”MRONJ“OR”BRONJ”) AND “jaw” AND (“medication” OR “drug” OR “bisphosphonate” OR “alendronate” OR “ibandronate” OR “risedronate” OR “zoledronate” OR “zoledronic acid” OR “antiresorptive” OR “Diphosphonates”[MeSH]) AND (“Diagnostic Imaging”[Mesh] OR “Imaging” OR “MRI” OR “magnetic resonance” OR “CBCT” OR “cone-beam” OR “OPT” OR “radiography” OR “X-ray”)) Search strategy for EBSCO ((((“medication-related osteonecrosis of the jaw” OR MRONJ OR BRONJ) AND (imaging OR radiography OR MRI OR CBCT OR “cone-beam computed tomography”)))) Other sources The reference lists of selected articles and reviews were hand-searched to identify any additional relevant articles. Appendix B medicina-61-01578-t0A2_Table A2 Table A2 Quality assessment of included studies based on a modified Newcastle–Ottawa Scale (NOS). Study Selection * Comparability * Outcome/Exposure * Total * Justification/Notes Assaf et al. [ 26 2 1 2 5 Matched controls; objective measurement of periodontal ligament width; no control for systemic confounders. Baba et al. [ 40 3 1 2 6 Multivariate logistic regression performed; blinded CT assessment; no control group included. Demir et al. [ 27 1 0 1 2 Case series with minimal sample; no control group; unblinded imaging assessment. Garcia-Ferrer et al. [ 53 1 0 1 2 Descriptive MRI case series; no comparator or validation of outcome. Goller-Bulut et al. [ 28 2 1 2 5 Matched case–control; blinded measurement of canal diameters; no multivariate adjustment. Gonen et al. [ 44 2 1 2 5 Small matched cohort; objective cortical measurement; unclear blinding. Guggenberger et al. [ 50 2 1 2 5 Prospective design; blinded imaging assessment; no control group. Guo et al. [ 29 1 0 1 2 Retrospective comparison; no control group; descriptive imaging analysis. Huber et al. [ 49 2 1 2 5 CBCT vs. UTE-MRI; blinded reviewers; absence of control group and confounder adjustment. Hutchinson et al. [ 23 2 1 1 4 The study highlights radiographic features of stage 0 MRONJ but lacks a control group and uses a small, self-selected cohort Ito et al. [ 47 2 0 2 4 Texture analysis of stage 0 MRONJ; no external control group; objective but unvalidated features. Kammerer et al. [ 24 2 0 1 3 Retrospective CBCT/OPT study; small sample; unblinded evaluation. Klingelhoffer et al. [ 30 2 1 2 5 Matched cases; randomization and blinding of radiographs; limited confounder control. Koo et al. [ 42 2 1 2 5 Cross-sectional comparison; clear inclusion; group comparisons only. Kubo et al. [ 31 3 2 2 7 Matched controls; analyzed morphometric variables; limited statistical adjustment. Moreno-Rabie et al. [ 43 2 1 2 5 Case–control with 3 groups; substantial inter-observer agreement; no multivariable analysis. Muraoka et al. [ 51 2 1 2 5 ADC-based MRI study; control group included; no blinding or full confounder adjustment. Ogura et al. [ 45 2 1 2 5 Surgical specimens compared to ORN; histopathologic gold standard; no multivariable control. Ristow et al. [ 39 3 2 3 8 Histology-validated diagnostic accuracy study; blinded examiners; no adjustment for stage. Rocha et al. [ 32 2 1 2 5 Oncology vs. control patients; radiographic signs compared; no multivariable control. Sahin et al. [ 33 2 1 2 5 Stratified MRONJ severity; no control group; small sample. Sakamoto et al. [ 48 1 0 2 3 Compared osteolytic patterns; no confounder adjustment or control group. Schumann et al. [ 52 2 1 2 5 UTE-MRI perfusion correlation; no adjustment for confounders. Shin et al. [ 22 3 2 2 7 Large cohort with antiresorptive exposure; stratified analyses by imaging features; no follow-up. Soundia et al. [ 34 2 1 2 5 Blinded imaging index for stage 0 progression; small cohort; no adjustment. Stockmann et al. [ 25 2 1 2 5 Compared CT/MRI to intra-op findings; no confounder control; prospective. Torres et al. [ 41 3 2 3 8 CBCT-based morphometry; matched controls; strong reliability metrics. Treister et al. [ 35 2 0 2 4 Descriptive analysis of BONJ imaging signs; no controls or blinding. Walton et al. [ 36 2 1 2 5 Composite index scoring; no multivariable analysis. Wazzan et al. [ 37 2 1 1 4 Retrospective controls; matching methods unclear; poor methodological detail. Yfanti et al. [ 46 2 1 2 5 CRI-based severity score; no external validation; limited confounder adjustment. Zaman et al. [ 38 2 1 1 4 Small radiograph comparison study; unblinded, limited reproducibility. * Scoring criteria: Selection (max. 4 points), Comparability (max. 2 points), and Outcome/Exposure Assessment (max. 3 points), for a total maximum score of 9. Individual justifications are provided to ensure transparency in scoring. References 1. Talreja D.B. Importance of Antiresorptive Therapies for Patients with Bone Metastases from Solid Tumors Cancer Manag. Res. 2012 4 287 297 10.2147/CMAR.S33983 23049278 PMC3459591 2. Lamy O. Everts-Graber J. Rodriguez E.G. Denosumab for Osteoporosis Treatment: When, How, for Whom, and for How Long. A Pragmatical Approach Aging Clin. Exp. Res. 2025 37 70 10.1007/s40520-025-02991-z 40055268 PMC11889064 3. Hadji P. Aapro M. Costa L. Gnant M. Antiresorptive Treatment Options and Bone Health in Cancer Patients—Safety Profiles and Clinical Considerations Cancer Treat. Rev. 2012 38 815 824 10.1016/j.ctrv.2012.03.002 22482938 4. Ruggiero S.L. Dodson T.B. Aghaloo T. Carlson E.R. Ward B.B. Kademani D. American Association of Oral and Maxillofacial Surgeons’ Position Paper on Medication-Related Osteonecrosis of the Jaws—2022 Update J. Oral Maxillofac. Surg. 2022 80 920 943 10.1016/j.joms.2022.02.008 35300956 5. Zhang X. Hamadeh I.S. Song S. Katz J. Moreb J.S. Langaee T.Y. Lesko L.J. Gong Y. Osteonecrosis of the Jaw in the United States Food and Drug Administration’s Adverse Event Reporting System (FAERS) J. Bone Miner. Res. 2016 31 336 340 10.1002/jbmr.2693 26288087 6. Zhong Y. Dai W. Yin L. Wu G. Wang X. Real-World Study of Medication-Related Osteonecrosis of the Jaw from 2010 to 2023 Based on Food and Drug Administration Adverse Event Reporting System JBMR Plus 2025 9 ziaf003 10.1093/jbmrpl/ziaf003 39990280 PMC11843447 7. McGowan K. McGowan T. Ivanovski S. Risk Factors for Medication-related Osteonecrosis of the Jaws: A Systematic Review Oral Dis. 2018 24 527 536 10.1111/odi.12708 28656643 8. Wick A. Bankosegger P. Otto S. Hohlweg-Majert B. Steiner T. Probst F. Ristow O. Pautke C. Risk Factors Associated with Onset of Medication-Related Osteonecrosis of the Jaw in Patients Treated with Denosumab Clin. Oral Investig. 2022 26 2839 2852 10.1007/s00784-021-04261-4 34812959 PMC8898220 9. Sánchez-Gallego Albertos C. Del Castillo Pardo de Vera J.L. Viejo Llorente A. Cebrián Carretero J.L. Medication Related Osteonecrosis of the Jaws (MRONJ): Factors Related to Recurrence after Treatment with Surgery and Platelet Rich Plasma (PRP) Placement Med. Oral Patol. Oral Cirugia Bucal 2021 26 e684 e690 10.4317/medoral.24007 PMC8601641 34704981 10. Wang E.P. Kaban L.B. Strewler G.J. Raje N. Troulis M.J. Incidence of Osteonecrosis of the Jaw in Patients with Multiple Myeloma and Breast or Prostate Cancer on Intravenous Bisphosphonate Therapy J. Oral Maxillofac. Surg. 2007 65 1328 1331 10.1016/j.joms.2007.03.006 17577497 11. Alawawda O. Urvasızoğlu G. Bayındır F. Medication-Related Osteonecrosis of the Jaw: Risk Factors, Management and Prevention in Dental Practices New Trends Med. Sci. 2025 6 26 36 10.56766/ntms.1528563 12. Kwoen M. Park J. Kim K. Lee J. Kim J. Lee H. Lee H. Association between Periodontal Disease, Tooth Extraction, and Medication-related Osteonecrosis of the Jaw in Women Receiving Bisphosphonates: A National Cohort-based Study J. Periodontol. 2023 94 98 107 10.1002/JPER.21-0611 35856336 13. Vahtsevanos K. Kyrgidis A. Verrou E. Katodritou E. Triaridis S. Andreadis C.G. Boukovinas I. Koloutsos G.E. Teleioudis Z. Kitikidou K. Longitudinal Cohort Study of Risk Factors in Cancer Patients of Bisphosphonate-Related Osteonecrosis of the Jaw J. Clin. Oncol. 2009 27 5356 5362 10.1200/JCO.2009.21.9584 19805682 14. AlRowis R. Aldawood A. AlOtaibi M. Alnasser E. AlSaif I. Aljaber A. Natto Z. Medication-Related Osteonecrosis of the Jaw (MRONJ): A Review of Pathophysiology, Risk Factors, Preventive Measures and Treatment Strategies Saudi Dent. J. 2022 34 202 210 10.1016/j.sdentj.2022.01.003 35935720 PMC9346931 15. Papapoulos S. Chapurlat R. Libanati C. Brandi M.L. Brown J.P. Czerwiński E. Krieg M.-A. Man Z. Mellström D. Radominski S.C. Five Years of Denosumab Exposure in Women with Postmenopausal Osteoporosis: Results from the First Two Years of the FREEDOM Extension J. Bone Miner. Res. 2012 27 694 701 10.1002/jbmr.1479 22113951 PMC3415620 16. Querrer R. Ferrare N. Melo N. Stefani C.M. dos Reis P.E.D. Mesquita C.R.M. Borges G.A. Leite A.F. Figueiredo P.T. Differences between Bisphosphonate-Related and Denosumab-Related Osteonecrosis of the Jaws: A Systematic Review Support. Care Cancer 2021 29 2811 2820 10.1007/s00520-020-05855-6 33140246 17. Guarneri V. Miles D. Robert N. Diéras V. Glaspy J. Smith I. Thomssen C. Biganzoli L. Taran T. Conte P. Bevacizumab and Osteonecrosis of the Jaw: Incidence and Association with Bisphosphonate Therapy in Three Large Prospective Trials in Advanced Breast Cancer Breast Cancer Res. Treat. 2010 122 181 188 10.1007/s10549-010-0866-3 20361252 18. Yarom N. Shapiro C.L. Peterson D.E. Van Poznak C.H. Bohlke K. Ruggiero S.L. Migliorati C.A. Khan A. Morrison A. Anderson H. Medication-Related Osteonecrosis of the Jaw: MASCC/ISOO/ASCO Clinical Practice Guideline J. Clin. Oncol. 2019 37 2270 2290 10.1200/JCO.19.01186 31329513 19. Byrne H. O’Reilly S. Weadick C.S. Brady P. Ríordáin R.N. How We Manage Medication-Related Osteonecrosis of the Jaw Eur. J. Med. Res. 2024 29 402 10.1186/s40001-024-01912-6 39095845 PMC11297747 20. Ruan H.-J. Chen H. Hou J.-S. An J.-G. Guo Y.-X. Liu B. Tian L. Pan J. Li J.-S. Jiang C.-H. Chinese Expert Consensus on the Diagnosis and Clinical Management of Medication-Related Osteonecrosis of the Jaw J. Bone Oncol. 2024 49 100650 10.1016/j.jbo.2024.100650 39651419 PMC11621599 21. Green B.N. Johnson C.D. Adams A. Writing Narrative Literature Reviews for Peer-Reviewed Journals: Secrets of the Trade J. Chiropr. Med. 2006 5 101 117 10.1016/S0899-3467(07)60142-6 19674681 PMC2647067 22. Shin J.W. Kim J.-E. Huh K.-H. Yi W.-J. Heo M.-S. Lee S.-S. Choi S.-C. Clinical and Panoramic Radiographic Features of Osteomyelitis of the Jaw: A Comparison between Antiresorptive Medication-Related and Medication-Unrelated Conditions Imaging Sci. Dent. 2019 49 287 10.5624/isd.2019.49.4.287 31915614 PMC6941834 23. Hutchinson M. O’Ryan F. Chavez V. Lathon P.V. Sanchez G. Hatcher D.C. Indresano A.T. Lo J.C. Radiographic Findings in Bisphosphonate-Treated Patients with Stage 0 Disease in the Absence of Bone Exposure J. Oral Maxillofac. Surg. 2010 68 2232 2240 10.1016/j.joms.2010.05.003 20728032 24. Kämmerer P.W. Thiem D. Eisenbeiß C. Dau M. Schulze R.K.W. Al-Nawas B. Draenert F.G. Surgical Evaluation of Panoramic Radiography and Cone Beam Computed Tomography for Therapy Planning of Bisphosphonate-Related Osteonecrosis of the Jaws Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2016 121 419 424 10.1016/j.oooo.2015.11.012 26876493 25. Stockmann P. Hinkmann F.M. Lell M.M. Fenner M. Vairaktaris E. Neukam F.-W. Nkenke E. Panoramic Radiograph, Computed Tomography or Magnetic Resonance Imaging. Which Imaging Technique Should Be Preferred in Bisphosphonate-Associated Osteonecrosis of the Jaw? A Prospective Clinical Study Clin. Oral Investig. 2010 14 311 317 10.1007/s00784-009-0293-1 19513765 26. Assaf A.T. Amberg V. Smeets R. Wikner J. Hanken H. Semmusch J. Ewald F. Rashad A. FriEDRICH R.E. Evaluation of Periodontal Space Widening in Patients with Antiresorptive Drug-Related Osteonecrosis of the Jaws (ARONJ) on Panoramic Radiographs Anticancer Res. 2018 38 5305 5314 10.21873/anticanres.12857 30194182 27. Demir A. Pekiner F. Radiographic Findings of Bisphosphonate-Related Osteonecrosis of the Jaws: Comparison with Cone-Beam Computed Tomography and Panoramic Radiography Niger. J. Clin. Pract. 2017 20 346 10.4103/1119-3077.183241 28256491 28. Goller-Bulut D. Ozcan G. Avci F. Changes in Dimension of Neurovascular Canals in the Mandible and Maxilla: A Radiographic Finding in Patients Diagnosed with MRONJ Med. Oral Patol. Oral Cirugia Bucal 2018 23 E282 E289 10.4317/medoral.22274 PMC5945243 29680848 29. Guo Y. Wang D. Wang Y. Peng X. Guo C. Imaging Features of Medicine-Related Osteonecrosis of the Jaws: Comparison between Panoramic Radiography and Computed Tomography Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2016 122 e69 e76 10.1016/j.oooo.2016.04.007 27422431 30. Klingelhöffer C. Klingelhöffer M. Müller S. Ettl T. Wahlmann U. Can Dental Panoramic Radiographic Findings Serve as Indicators for the Development of Medication-Related Osteonecrosis of the Jaw? Dentomaxillofac. Radiol. 2016 45 20160065 10.1259/dmfr.20160065 27213837 PMC5084706 31. Kubo R. Ariji Y. Taniguchi T. Nozawa M. Katsumata A. Ariji E. Panoramic Radiographic Features That Predict the Development of Bisphosphonate-Related Osteonecrosis of the Jaw Oral Radiol. 2018 34 151 160 10.1007/s11282-017-0293-9 30484130 32. Rocha G.C.M.A. Jaguar G.C. Moreira C.R. Neves E.G. Fonseca F.P. Pedreira E.N. Radiographic Evaluation of Maxillofacial Region in Oncology Patients Treated with Bisphosphonates Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2012 114 S19 S25 10.1016/j.tripleo.2011.08.016 23083951 33. Şahin O. Odabaşı O. Demiralp K.Ö. Kurşun-Çakmak E.Ş. Aliyev T. Comparison of Findings of Radiographic and Fractal Dimension Analyses on Panoramic Radiographs of Patients with Early-Stage and Advanced-Stage Medication-Related Osteonecrosis of the Jaw Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2019 128 78 86 10.1016/j.oooo.2019.03.002 31005615 34. Soundia A. Hadaya D. Mallya S.M. Aghaloo T.L. Tetradis S. Radiographic Predictors of Bone Exposure in Patients with Stage 0 Medication-Related Osteonecrosis of the Jaws Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2018 126 537 544 10.1016/j.oooo.2018.08.005 30266375 PMC6295235 35. Treister N. Sheehy N. Bae E. Friedland B. Lerman M. Woo S. Dental Panoramic Radiographic Evaluation in Bisphosphonate-associated Osteonecrosis of the Jaws Oral Dis. 2009 15 88 92 10.1111/j.1601-0825.2008.01494.x 18992020 36. Walton K. Grogan T.R. Eshaghzadeh E. Hadaya D. Elashoff D.A. Aghaloo T.L. Tetradis S. Medication Related Osteonecrosis of the Jaw in Osteoporotic vs Dentomaxillofac. Radiol. 2019 48 20180128 10.1259/dmfr.20180128 29952657 PMC6398905 37. Wazzan T. Kashtwari D. Almaden W.F. Gong Y. Chen Y. Moreb J. Katz J. Radiographic Bone Loss and the Risk of Medication-related Osteonecrosis of the Jaw (MRONJ) in Multiple Myeloma Patients—A Retrospective Case Control Study Spec. Care Dentist. 2018 38 356 361 10.1111/scd.12318 30194738 38. Zaman M.U. Nakamoto T. Tanimoto K. A Retrospective Study of Digital Subtraction Technique to Detect Sclerotic Changes in Alveolar Bone on Intraoral Radiographs of Bisphosphonate-Treated Patients Dentomaxillofac. Radiol. 2013 42 20130242 10.1259/dmfr.20130242 24170801 PMC3853510 39. Ristow O. Schnug G. Smielowksi M. Moratin J. Pilz M. Engel M. Freudlsperger C. Hoffmann J. Rückschloß T. Diagnostic Accuracy Comparing OPT and CBCT in the Detection of Non-vital Bone Changes before Tooth Extractions in Patients with Antiresorptive Intake Oral Dis. 2023 29 1039 1049 10.1111/odi.14048 34637576 40. Baba A. Goto T.K. Ojiri H. Takagiwa M. Hiraga C. Okamura M. Hasegawa S. Okuyama Y. Ogino N. Yamauchi H. CT Imaging Features of Antiresorptive Agent-Related Osteonecrosis of the Jaw/Medication-Related Osteonecrosis of the Jaws Dentomaxillofac. Radiol. 2018 47 20170323 10.1259/dmfr.20170323 29365278 PMC5991756 41. Torres S.R. Chen C.S.K. Leroux B.G. Lee P.P. Hollender L.G. Santos E.C.A. Drew S.P. Hung K.-C. Schubert M.M. Mandibular Cortical Bone Evaluation on Cone Beam Computed Tomography Images of Patients with Bisphosphonate-Related Osteonecrosis of the Jaw Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2012 113 695 703 10.1016/j.oooo.2011.11.011 22668629 42. Koo C.-H. Lee J.-H. Evaluation of Mandibular Cortical Bone Ratio on Computed Tomography Images in Patients Taking Bisphosphonates Maxillofac. Plast. Reconstr. Surg. 2018 40 17 10.1186/s40902-018-0153-5 30038904 PMC6031557 43. Moreno Rabie C. Cavalcante Fontenele R. Oliveira Santos N. Nogueira Reis F. Van den Wyngaert T. Jacobs R. Three-Dimensional Clinical Assessment for MRONJ Risk in Oncologic Patients Following Tooth Extractions Dentomaxillofac. Radiol. 2023 52 20230238 10.1259/dmfr.20230238 37874081 PMC10968756 44. Gönen Z.B. Yillmaz Asan C. Zararsiz G. Kiliç E. Alkan A. Osseous Changes in Patients with Medication-Related Osteonecrosis of the Jaws Dentomaxillofac. Radiol. 2018 47 20170172 10.1259/dmfr.20170172 28871814 PMC5965736 45. Ogura I. Minami Y. Ono J. Kanri Y. Okada Y. Igarashi K. Haga-Tsujimura M. Nakahara K. Kobayashi E. CBCT Imaging and Histopathological Characteristics of Osteoradionecrosis and Medication-Related Osteonecrosis of the Jaw Imaging Sci. Dent. 2021 51 73 10.5624/isd.20200230 33828964 PMC8007393 46. Yfanti Z. Tetradis S. Nikitakis N.G. Alexiou K.E. Makris N. Angelopoulos C. Tsiklakis K. Radiologic Findings of Osteonecrosis, Osteoradionecrosis, Osteomyelitis and Jaw Metastatic Disease with Cone Beam CT Eur. J. Radiol. 2023 165 110916 10.1016/j.ejrad.2023.110916 37300936 47. Ito K. Muraoka H. Hirahara N. Sawada E. Hirohata S. Otsuka K. Okada S. Kaneda T. Quantitative Assessment of Mandibular Bone Marrow Using Computed Tomography Texture Analysis for Detect Stage 0 Medication-Related Osteonecrosis of the Jaw Eur. J. Radiol. 2021 145 110030 10.1016/j.ejrad.2021.110030 34798536 48. Sakamoto Y. Sawada S. Kojima Y. Medication-Related Osteonecrosis of the Jaw without Osteolysis on Computed Tomography: A Retrospective and Observational Study Sci. Rep. 2023 13 12890 10.1038/s41598-023-39755-6 37558709 PMC10412630 49. Huber F.A. Schumann P. von Spiczak J. Wurnig M.C. Klarhöfer M. Finkenstaedt T. Bedogni A. Guggenberger R. Medication-Related Osteonecrosis of the Jaw—Comparison of Bone Imaging Using Ultrashort Echo-Time Magnetic Resonance Imaging and Cone-Beam Computed Tomography Investig. Radiol. 2020 55 160 167 10.1097/RLI.0000000000000617 31688157 50. Guggenberger R. Fischer D.R. Metzler P. Andreisek G. Nanz D. Jacobsen C. Schmid D.T. Bisphosphonate-Induced Osteonecrosis of the Jaw: Comparison of Disease Extent on Contrast-Enhanced MR Imaging, [ 18 Am. J. Neuroradiol. 2013 34 1242 1247 10.3174/ajnr.A3355 23221951 PMC7964583 51. Muraoka H. Ito K. Hirahara N. Okada S. Kondo T. Kaneda T. The Value of Diffusion-Weighted Imaging in the Diagnosis of Medication-Related Osteonecrosis of the Jaws Oral Surg. Oral Med. Oral Pathol. Oral Radiol. 2021 132 339 345 10.1016/j.oooo.2021.04.003 34092542 52. Schumann P. Morgenroth S. Huber F.A. Rupp N.J. Del Grande F. Guggenberger R. Correlation of Dynamic Contrast-Enhanced Bone Perfusion with Morphologic Ultra-Short Echo Time MR Imaging in Medication-Related Osteonecrosis of the Jaw Dentomaxillofac. Radiol. 2022 51 20210036 10.1259/dmfr.20210036 34406841 PMC8802699 53. García-Ferrer L. Bagán J.V. Martínez-Sanjuan V. Hernandez-Bazan S. García R. Jiménez-Soriano Y. Hervas V. MRI of Mandibular Osteonecrosis Secondary to Bisphosphonates Am. J. Roentgenol. 2008 190 949 955 10.2214/AJR.07.3045 18356441 54. Khan A.A. Morrison A. Hanley D.A. Felsenberg D. McCauley L.K. O’Ryan F. Reid I.R. Ruggiero S.L. Taguchi A. Tetradis S. Diagnosis and Management of Osteonecrosis of the Jaw: A Systematic Review and International Consensus J. Bone Miner. Res. 2015 30 3 23 10.1002/jbmr.2405 25414052 55. Ruggiero S.L. Diagnosis and Staging of Medication-Related Osteonecrosis of the Jaw Oral Maxillofac. Surg. Clin. N. Am. 2015 27 479 487 10.1016/j.coms.2015.06.008 26293329 56. Krishnan A. Arslanoglu A. Yildirm N. Silbergleit R. Aygun N. Imaging Findings of Bisphosphonate-Related Osteonecrosis of the Jaw with Emphasis on Early Magnetic Resonance Imaging Findings J. Comput. Assist. Tomogr. 2009 33 298 304 10.1097/RCT.0b013e31817e4986 19346864 57. Chiandussi S. Biasotto M. Dore F. Cavalli F. Cova M. Di Lenarda R. Clinical and Diagnostic Imaging of Bisphosphonate-Associated Osteonecrosis of the Jaws Dentomaxillofac. Radiol. 2006 35 236 243 10.1259/dmfr/27458726 16798918 58. De Antoni C.C. Matsumoto M.A. da Silva A.A. Curi M.M. Santiago Júnior J.F. Sassi L.M. Cardoso C.L. Medication-Related Osteonecrosis of the Jaw, Osteoradionecrosis, and Osteomyelitis: A Comparative Histopathological Study Braz. Oral Res. 2018 32 e23 10.1590/1807-3107bor-2018.vol32.0023 29723337 59. Qaisi M. Montague L. Bone Margin Analysis for Osteonecrosis and Osteomyelitis of the Jaws Oral Maxillofac. Surg. Clin. N. Am. 2017 29 301 313 10.1016/j.coms.2017.03.007 28709531 60. Reinert C.P. Pfannenberg C. Gückel B. Dittmann H. la Fougère C. Nikolaou K. Reinert S. Schönhof R. Hoefert S. Preoperative Assessment of Medication-Related Osteonecrosis of the Jaw Using [18F]Fluoride Positron Emission Tomography (PET)/CT and [18F]Fluorodeoxyglucose PET/MRI in Correlation with Histomorphometry and Micro-CT—A Prospective Comparative Study Diagnostics 2024 14 428 10.3390/diagnostics14040428 38396467 PMC10888075 61. Koth V.S. Figueiredo M.A. Salum F.G. Cherubini K. Bisphosphonate-Related Osteonecrosis of the Jaw: From the Sine qua Non Dentomaxillofac. Radiol. 2016 45 20160049 10.1259/dmfr.20160049 27167455 PMC5606254 62. Yanaguizawa W.H. Velasco S.K. Petersen R.L. Alves F.D.A. Cavalcanti M.G.P. Imaging Modalities in Medication-Related Osteonecrosis of the Jaw Clin. Lab. Res. Dent. 2020 1 7 10.11606/issn.2357-8041.clrd.2020.164723 63. Watanabe S. Nakajima K. Mizokami A. Yaegashi H. Noguchi N. Kawashiri S. Inokuchi M. Kinuya S. Bone Scan Index of the Jaw: A New Approach for Evaluating Early-Stage Anti-Resorptive Agents-Related Osteonecrosis Ann. Nucl. Med. 2017 31 201 210 10.1007/s12149-016-1145-0 27995542 64. Watanabe S. Nakajima K. Kinuya S. ☆Symposium: Imaging Modalities for Drug-Related Osteonecrosis of the Jaw (5), Utility of Bone Scintigraphy and 18F-FDG PET/CT in Early Detection and Risk Assessment of Medication-Related Osteonecrosis of the Jaw (Secondary Publication) Jpn. Dent. Sci. Rev. 2019 55 76 79 10.1016/j.jdsr.2018.12.002 30956739 PMC6431786 65. Kitagawa Y. Ohga N. Asaka T. Sato J. Hata H. Helman J. Tsuboi K. Amizuka N. Kuge Y. Shiga T. Imaging Modalities for Drug-Related Osteonecrosis of the Jaw (3), Positron Emission Tomography Imaging for the Diagnosis of Medication-Related Osteonecrosis of the Jaw Jpn. Dent. Sci. Rev. 2019 55 65 70 10.1016/j.jdsr.2018.12.001 30949253 PMC6430078 66. Miyashita H. Kameyama K. Morita M. Nakagawa T. Nakahara T. Three-Dimensional Radiologic–Pathologic Correlation of Medication-Related Osteonecrosis of the Jaw Using 3D Bone SPECT/CT Imaging Dentomaxillofac. Radiol. 2019 48 20190208 10.1259/dmfr.20190208 31287720 PMC6951095 67. Okui T. Kobayashi Y. Isomura M. Tsujimoto M. Satoh K. Toyama H. Histopathological Findings Affect Quantitative Values of Single Photon Emission Computed Tomography in Patients with Antiresorptive Agent-Related Osteonecrosis of the Jaws Fujita Med. J. 2023 9 186 193 10.20407/fmj.2022-025 37554942 PMC10405893 68. Kobayashi E. Tezuka Y. Ono J. Okada Y. Ogura I. Role of Preoperative SPECT/CT Standardized Uptake Values in Medication-Related Osteonecrosis of the Jaw: A Preliminary Study of SPECT/CT in Relation to Cone-Beam CT and Histopathological Findings of the Resected Bone of Mandibulectomy Egypt. J. Radiol. Nucl. Med. 2023 54 106 10.1186/s43055-023-01052-7 69. Ogawa R. Ogura I. Analysis of Medication-Related Osteonecrosis of the Jaw with Bone SPECT/CT: Relationship between Patient Characteristics and Maximum Standardized Uptake Value Dentomaxillofac. Radiol. 2021 50 20200516 10.1259/dmfr.20200516 34019434 PMC8611283 70. Santos G.N.M. da Silva H.E.C. Ossege F.E.L. Figueiredo P.T.d.S. Melo N.d.S. Stefani C.M. Leite A.F. Radiomics in Bone Pathology of the Jaws Dentomaxillofac. Radiol. 2023 52 20220225 10.1259/dmfr.20220225 36416666 PMC9793454 71. Shen X. Luo J. Tang X. Chen B. Qin Y. Zhou Y. Xiao J. Deep Learning Approach for Diagnosing Early Osteonecrosis of the Femoral Head Based on Magnetic Resonance Imaging J. Arthroplasty 2023 38 2044 2050 10.1016/j.arth.2022.10.003 36243276 72. Schoenhof R. Munz A. Yuan A. ElAyouti A. Boesmueller H. Blumenstock G. Reinert S. Hoefert S. Microarchitecture of Medication-Related Osteonecrosis of the Jaw (MRONJ); a Retrospective Micro-CT and Morphometric Analysis J. Cranio-Maxillofac. Surg. 2021 49 508 517 10.1016/j.jcms.2021.02.018 33707134 73. Oxford Centre for Evidence-Based Medicine Levels of Evidence (March 2009) University of Oxford Oxford, UK 2009 Available online: https://www.cebm.ox.ac.uk/resources/levels-of-evidence/levels-of-evidence-march-2009 (accessed on 25 July 2025) 74. Guyatt G.H. Oxman A.D. Vist G.E. Kunz R. Falck-Ytter Y. Alonso-Coello P. Schünemann H.J. GRADE: An Emerging Consensus on Rating Quality of Evidence and Strength of Recommendations BMJ 2008 336 924 926 10.1136/bmj.39489.470347.AD 18436948 PMC2335261 medicina-61-01578-t001_Table 1 Table 1 Summary of study methodologies and patient characteristics. Reference Year Type of the Study No. of Patients Drugs Length of Therapy Main Comorbidities Shin et al. [ 22 2019 Retro. cohort 161/179 BP + DNB 4.5 y avg. HTN, OP, DM Hutchinson et al. [ 23 2010 Case–control 30/975 BP + DNB Median 3.0 y (2.4–4.7) OP, PCa, MM Kammerer et al. [ 24 2016 Cross-sectional 14 BP Not specified OP, SLE, RA, DM Stockmann et al. [ 25 2009 Cross-sectional 28 BP Not specified MM, other malignancies, OP Assaf et al. [ 26 2018 Cross-sectional 32 BP + DNB, Not specified Multiple systemic diseases (hyperthyroidism, arrhythmias, cancers, etc.) Demir et al. [ 27 2017 Cross-sectional 27 BP 1 to 10 y DM Goller-Bulut et al. [ 28 2018 Case–control 56/56 BP Not specified MM, PCa + BC w/metastases Guo et al. [ 29 2016 Cross-sectional 40 BP Mean: 37.92 (10–96 mo). BC w/mets, MM, OP Klingelhoffer et al. [ 30 2016 Case–control 60/60 BP ~4.75 y OP, bone mets, MM Kubo et al. [ 31 2017 Case–control 24/179/200 B– BP 67.9 ± 37.1 mo (ONJ +) vs. 40.4 ± 47.9 (ONJ–) OP, bone mets Rocha et al. [ 32 2012 Case–control 30/30 BP 16 mo Met. cancers, periodontal dz, history of oral surgery Sahin et al. [ 33 2019 Cross-sectional 66 BP + DNB 21 mo (early); 48 mo (adv) OP, cancers (BC, lung, PCa, etc.), MM Soundia et al. [ 34 2018 Cross-sectional 23 BP + DNB 52 mo OP, cancers, sarcoma, GCT Treister et al. [ 35 2009 Cross-sectional 39 (234 sextants) BP Not specified Multiple cancers, Gaucher’s dz, OP Walton et al. [ 36 2019 Cross-sectional 70 BP + DNB Not specified Multiple cancers, OP Wazzan et al. [ 37 2018 Case–control 16/100 BP 2 y vs. 1 y MM, smoking, DM, steroid use Zaman et al. [ 38 2013 Cohort 43 BP 17–74 mo BC, hepatic cancer, MM, OP Ristow et al. [ 39 2021 Retro. cohort 130 BP + DNB 47.9 mo Multiple cancers, OP Baba et al. [ 40 2018 Prosp. cohort 74 BP + DNB 0.2–15 y (avg. 3.44 y) Multiple cancers, OP Torres et al. [ 41 2012 Case–control 12/64 BP Not specified Cancer-related bone metastases Koo et al. [ 42 2018 Case–control 63/32 BP + DNB 6.3 ± 5.3 y vs. 4.8 ± 4.4 y Malignant and benign bone conditions Moreno-Rabie et al. [ 43 2023 Case–control 47/50 BP + DNB MRONJ +: 40.4 mo; MRONJ–: 29.5 mo BC, MM, PCa, renal cancer, other cancers Gönen et al. [ 44 2018 Case–control 25/25 BP 1–120 mo Not reported Ogura et al. [ 45 2021 Cross-sectional 10 BP + DNB Not specified Met. cancers Yfanti et al. [ 46 2023 Retro. cohort 335 BP + DNB Not specified OP, bone mets, oral surgeries Ito et al. [ 47 2021 Case–control 25 BP 4–9 y (avg. ~6.5 y) Steroids, DM Sakamoto et al. [ 48 2023 Retro. cohort 18 BP + DNB 9–24 mo (non-osteolytic); DM, steroids, cancers, OP Huber et al. [ 49 2019 Cross-sectional 19 BP Not specified Cancers, DM Guggenberger et al. [ 50 2013 Cross-sectional 10 BP Median 48 mo (7–60 mo) Cancers, OP Muraoka et al. [ 51 2021 Case–control 38/10 BP + DNB Not specified OP/osteopenia, bone mets Schumann et al. [ 52 2022 Cross-sectional 20 BP + DNB Not specified OP, PCa, other cancers Garcia-Ferrer et al. [ 53 2008 Cross-sectional 14 BP 18–60 mo (~32.4 ± 14.7) OP, cancers Abbreviations: BP—bisphosphonates; DNB—denosumab; OP—osteoporosis; BC—breast cancer; PCa—prostate cancer; MM—multiple myeloma; DM—diabetes mellitus; RA—rheumatoid arthritis; SLE—systemic lupus erythematosus; CS—corticosteroids; mets—metastases; ONJ—osteonecrosis of the jaw; dz—disease; y—years; mo—months. medicina-61-01578-t002_Table 2 Table 2 Imaging techniques used in the evaluation of MRONJ. Modality Early Diagnosis (Stage 0) Late Diagnosis (Stages I–III) Management and Follow-Up X-Ray [ 24 25 28 29 33 35 39 40 [ 23 27 28 29 30 31 32 34 36 37 [ 24 25 26 CBCT [ 24 35 40 44 48 [ 28 29 30 32 37 41 42 43 44 45 46 47 50 51 [ 24 25 26 MRI [ 48 52 [ 49 51 52 53 54 [ 26 Notes: Ranges represent consecutive citations as listed in the References section. medicina-61-01578-t003_Table 3 Table 3 Absolute frequency of major imaging patterns in early- and late-stage MRONJ.  Early Late Osteosclerosis 120 348 Osteolysis 58 360 Periosteal reaction 19 115 Sequestration 29 296 Lamina dura thickening 31 143 Cortical erosion/irregularity 29 7 Persistent socket 19 59 Prominent inferior alveolar canal 7 95 Fragmentation/fracture 0 14 medicina-61-01578-t004_Table 4 Table 4 Overview of diagnostic performance and feasibility of imaging methods in MRONJ. Imaging Method Diagnostic Limitations Accessibility and Daily Use Economic and Organizational Considerations Panoramic radiography Low sensitivity (~54%) for early MRONJ [ 1 2 3 55 Common, low-cost tool in dental practice with minimal radiation [ 5 4 Low-cost, in-office imaging; no referral needed. Common first-line tool with minimal logistical demands. May necessitate follow-up with advanced imaging, adding downstream costs. Conventional CT Detects bone lesions well (~96%) [ 1 6 7 8 Available in hospitals, costly, and high-radiation. Used mainly in advanced cases or surgical planning, not routine screening [ 25 40 50 CT entails higher institutional costs and radiation exposure compared to dental imaging [ 61 Cone-Beam CT High-resolution 3D bone imaging, more accurate than panoramic X-rays (~88% vs. ~56% AUC) [ 9 24 27 33 39 Widely available in dental settings, lower cost/dose than CT. Preferred for jaw evaluation but limited for extensive or soft-tissue disease. CBCT is more cost-effective and accessible than conventional CT, and often available within dental or OMFS practices [ 61 Magnetic Resonance Imaging (MRI) Best for early marrow and soft-tissue changes in MRONJ [ 6 8 Not available in dental offices. Time-consuming and costly, used selectively for early or soft-tissue cases with inconclusive CT [ 25 50 56 MRI demands specialized facilities and higher costs, both for acquisition and scheduling. Access is restricted to imaging centers or hospitals, posing significant logistical barriers. Its use is typically limited to complex cases due to these institutional challenges [ 62 Bone Scintigraphy/SPECT High sensitivity to early changes [ 12 13 14 14 Requires nuclear medicine setup and IV tracer. Time-intensive and moderately radioactive; reserved for complex or unclear cases [ 15 45 63 64 SPECT requires nuclear medicine infrastructure and radiotracer logistics, which limits access to tertiary centers. Multistep procedures increase organizational burden, reducing feasibility for routine assessment despite high sensitivity [ 62 PET/CT Shows metabolic activity in MRONJ [ 16 13 Expensive, high-radiation, limited to tertiary centers. Rarely used in routine care—mostly for oncology or unresolved cases [ 50 63 65 PET/CT involves substantial institutional investment in tracers, scanners, and staff. Its complexity restricts availability to major hospitals or research centers. Used selectively; its cost and workflow demands preclude routine clinical application in MRONJ [ 50 ",
  "metadata": {
    "Title of this paper": "GRADE: An Emerging Consensus on Rating Quality of Evidence and Strength of Recommendations",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472087/"
  }
}