{
  "title": "Paper_276",
  "abstract": "pmc J Dent Sci J Dent Sci 3597 jds Journal of Dental Sciences 1991-7902 2213-8862 Association for Dental Sciences of the Republic of China PMC12485412 PMC12485412.1 12485412 12485412 41040588 10.1016/j.jds.2025.07.016 S1991-7902(25)00255-7 1 Short Communication Evaluating the diagnostic value and prospects of genomic and mutational sequencing in malignant transformation of oral leukoplakia Yuan Jian a † Zhu Yuhan b c † Wang Zirui c Lv Zhongjing zhongjing_lv2012@163.com a d ⁎⁎ Liu Wei liuweb@hotmail.com b c ⁎ a b c d ⁎ liuweb@hotmail.com ⁎⁎ zhongjing_lv2012@163.com † J. Yuan and Y. Zhu contributed equally to this work. 10 2025 31 7 2025 20 4 498055 2472 2478 12 7 2025 17 7 2025 31 07 2025 02 10 2025 03 10 2025 © 2025 Association for Dental Sciences of the Republic of China. Publishing services by Elsevier B.Vé. 2025 Association for Dental Sciences of the Republic of China https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Genomic and mutational sequencing in malignant transformation of oral leukoplakia (OLK) has emergingly gained momentum. In this short communication, we identified 5 retrospective follow-up studies and 5 cross-section comparative studies on this issue using formalin-fixed paraffin-embedded tissues. Copy number alteration (CNA) was demonstrated to increase with the grade of oral dysplasia. CNA-based algorithms showed better prediction performances than histological grade in assessing the risk of OLK malignant transformation. Importantly, we conducted a pooled-analysis on the mutation frequencies of the common oral cancer driver genes extracted from individual studies. The most common mutation gene was found to be TP53 NOTCH1 FAT1 CDKN2A Keywords Copy number alterations Gene mutation Malignant transformation Next generation sequencing Oral leukoplakia Oral squamous cell carcinoma pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Oral leukoplakia (OLK) is the best-known potentially malignant disorder of oral squamous cell carcinomas (OSCC). Although the risk of OLK malignant transformation usually increases along with increasing grade of epithelial dysplasia, it is well-known that oral biopsy with histologic assessment is insufficient and may involve subjectivity. 1 , 2 3 4 Next generation sequencing (NGS) is a massive, high-throughput sequencing technology used to analyze various mutations and genetic changes. Recent years, advances in genomic and mutational analysis using NGS in OLK have the potential for assessing the risk of malignant transformation and may uncover the genetic and molecular profiles of oral carcinogenesis. NGS can enhance the understanding of the complexity of genomic events drive oral carcinogenesis, which is fundamental to advances in new diagnostic and treatment modalities. In 2021, there were 3 reviews focusing on genetic landscape of OLK, encompassing alterations from gross chromosomal alterations to single gene mutation. 5 6 7 8 9 10 11 12 13 14 15 16 17 18 Materials and methods A systematic literature search regarding the original articles on genomic and mutational sequencing in OLK from PubMed and Web of Science databases was conducted on 30 June 2023. In the search strategy, the subject terms “genetic OR genomic OR mutation” and “sequencing” were used along with “oral leukoplakia” OR “oral dysplasia”. There was no restriction to language and year of publication, and an additional query was identified from cross-referencing. Inclusion criteria was the articles which addressed the issue of genomic and mutational analysis using NGS in tissue samples of OLK patients. Important references and information derived from background knowledge have also been analyzed. Exclusion criteria were literature reviews, cell and animal experimental studies, the methods that did not use NGS, and sequencing that did not use the tissue samples of OLK patients. Titles and abstracts or full texts of the articles were screened and re-evaluated to confirm the eligible papers. Data search and extraction were undertaken independently by two investigators (Y.Z. and W.L.), and any disagreement was resolved in a consensus symposium. Bibliographical characteristics of the eligible articles were reviewed and recorded the following information: authorship, publication year, country/region of origin, study design, number of subjects, sequencing method, and main results. The frequency of single gene mutation was extracted from individual studies and calculated as a pooled frequency. Results Table 1 9 10 11 12 13 14 15 16 17 18 9 10 11 12 13 14 15 16 17 18 Table 1 Summary of the studies focusing on genomic and mutational sequencing in patients with oral leukoplakia (OLK). Table 1 Author, year Country Study design No. of patients No. of samples Surrogate sample Normal control Sequencing method Main results Wood et al., 2017 10 UK Comparative 69 256 (38 LGD, 59 HGD and 149 OSCC) FFPE Matched blood DNAs WES CNAs and point mutations do appear to accumulate as the disease moves from normal tissue to LGD, HGD and SCC. Most of the genomic changes driving oral cancer occur in the pre-cancerous state by way of gradual random accumulation rather than a dramatic single event. Farah et al., 2019 9 Australia Retrospective follow-up 13 (5 progressive, 8 non-progressive) 42 (2 hyperplasia, 7 dysplasia and 5 OSCC) FFPE NA WES The frequency of exomic mutation variants, particularly in DNA damage repair pathway genes, can be used to differentiate the progressive and non-progressive OLK. Li et al., 2021 11 China Retrospective follow-up 529 26 hyperplasia, 26 dysplasia; 477 hyperplasia with follow-up: 19 progressive and 253 recurrence FFPE Tissues distant from the lesion regions WGS Dysplasia had a higher CNA rate (86 %) than hyperplasia (46 %). CNA was associated with the histological grade of OLK and may be effective for prognosis prediction in the patients with hyperplasia. Wils et al., 2023 12 Netherlands Retrospective follow-up (12–258 m) 89 89 (25 progressor, 64 non-progressor) FFPE 46 normal colorectal tissue samples A 12-gene panel ( TP53, FAT1, NOTCH1, CASP8, AJUBA, CDKN2A, HRAS, PIK3CA, PTEN, NSD1, FBXW7, KMT2D CNAs were present in 69 % OLK patients, most commonly gains of chromosome regions 8q24 (46 %) and 20p11(20 %) and loss of 13q12 (19 %). Mutations were present in 66 % OLK patients, most commonly in TP53 (28 %), FAT1(20 %), and NOTCH1 (13 %). These genetic data combined with dysplasia generated a model for the prediction of malignant transformation. Cai et al., 2024 13 China Retrospective follow-up (median: 67 m) 324 [training (n = 226) and validation (n = 98)] and 107 (external cohorts) 431 (324cases including 102 hyperplasia, 129 mild, 61 moderate, and 32 severe dysplasia) FFPE Tissues distant from the lesion regions WGS CNA events increased with the severity of histological grade of OLK. A CNA score model was developed to accurately predict the prognosis and showed better prediction performances than histological grade in assessing the transformation risk of OLK. Anne et al., 2022 14 India Comparative 5 5 hyperplasia FFPE Matched blood DNAs WES 16 expressed cancer driver genes including FAT1 associated with functionally damaging variants. Adorno-Farias et al., 2023 15 Chile Comparative 10 10 (6 LGD, 4 HGD) FFPE NA WES 13 genes found in OED samples may be related to basal biological functions in OED. Márquez et al., 2023 16 Chile Comparative 10 10 (6 LGD, 4 HGD) FFPE NA A 57-gene panel HGD cases had significantly more variants, and some LGDs presented a similar mutational landscape to HGD after cluster analysis. Farah et al., 2024 17 Australia Comparative 6 PVL 12 (9 dysplasia, 2 hyperplasia, 1 OSCC) FFPE NA WES Genes previously associated with OSCC were mutated in multiple samples. Several DNA damage repair genes were mutated in PVL samples. NOTCH and Hippo pathways were the most frequently impacted by mutation. Kojima et al., 2025 18 Japan Retrospective follow-up (2–39 m) 14 11 mild, 3 moderate dysplasia FFPE Adjacent normal tissue A 7-gene panel ( TP53, HRAS, PIK3CA, NOTCH1, CDKN2A, FBXW7, BRAF Oral cancer driver gene mutations including TP53, HRAS, PIK3CA, NOTCH1, CDKN2A, FBXW7, and BRAF were detected in 4 OLK cases. FFPE, formalin-fixed paraffin-embedded; HGD, high grade dysplasia; LGD, low grade dysplasia; OSCC, oral squamous cell carcinoma; PVL, proliferative verrucous leukoplakia; NA, not available; WES, whole exome sequencing; WGS, whole genome sequencing. Copy number alteration (CNA) is a type of genetic alteration features and can reflect the evolution of cancer. There were 4 studies on CNA in OLK, demonstrating that CNA events increased with the severity of histological grade. 10 11 12 13 12 , 13 Table 2 TP53 NOTCH1 FAT1 CDKN2A PIK3CA HRAS FBXW7 Table 2 The common oral cancer driver gene mutations in oral leukoplakia. Table 2 Authors, year Number of cases Number of mutated cases TP53 NOTCH1 FAT1 CDKN2A PIK3CA HRAS FBXW7 Izumchenko et al., 2015 8 45 – 27 – – – – – Farah et al., 2019 9 13 5 – – 3 – – – Wood et al., 2017 10 16 9 2 – 2 – – – Wils et al., 2023 12 89 25 12 18 11 10 2 4 Anne et al., 2022 14 5 1 2 3 – – 2 – Márquez et al., 2023 16 10 10 2 10 2 2 – – Farah et al., 2024 17 6 1 – 2 3 – – – Kojima et al., 2025 18 14 1 1 0 0 3 1 0 Pooled frequency (95 % confidence intervals) 198 26.26 % (20.61–32.82 %) 23.23 % (17.87–29.61 %) 16.67 % (12.08–22.52 %) 10.61 % (6.98–15.73 %) 7.58 % (4.56–12.21 %) 2.53 % (0.92–5.94 %) 2.02 % (0.61–5.26 %) Discussion This paper gives us an opportunity to present our discussion, which would help for the consideration of the investigators in further well-designed studies. The etiology of OLK, particularly idiopathic leukoplakia, is not fully understood, and effective biomarkers to predict which lesions will progress to OSCC and by which mechanisms remain unclear. 19 5 6 7 19 , 20 Genomic and mutational sequencing such as WGS and WES can provide a more comprehensive framework for molecular subtyping and risk stratification of malignant transformation in OLK patients. 6 9 10 11 12 TP53 NOTCH1 Table 2 Several limitations in available studies should be acknowledged. First, all the studies were conducted mainly using FFPE samples, which have limitations compared with fresh or frozen samples because of degraded DNA in FFPE samples. Second, the cutoff values and algorithms of CNA were different and the mutation frequency of the driver genes varied dramatically. The variability reflects divergent definitions of driver events, which ultimately limits the comparability of these models. The research on establishing a panel of certain driver gene mutations that intensively predict the OLK malignant transformation is warranted. Third, most studies were lack of a favorable normal control, e.g. matched blood DNAs. Adjacent tissues or other known population germline mutation databases as controls were inferior to matched blood samples. Fourth, all studies were not prospective design but retrospective and cross-section comparative nature. In addition, most were single-center studies with the small sample sizes. Given these limitations, we recommend the well-designed studies with a larger OLK patient population with clinical endpoints using fresh or frozen tissue samples and matched blood samples as controls in further investigations. Taken together, it is promising to provide a comprehensive framework for molecular subtyping and risk stratification of malignant transformation in OLK patients using genomic and mutational sequencing. Large-scale, prospective, multi-center, well-designed studies are essential to validate the available findings and develop robust prognostic models or molecular markers for predicting malignant transformation of OLK. The precise characterization of the genomic and mutational events is of critical importance to translate molecular results into the clinics. Declaration of competing interest The authors have no conflicts of interest relevant to this article. References 1 Tilakaratne W.M. Jayasooriya P.R. Jayasuriya N.S. De Silva R.K. Oral epithelial dysplasia: causes, quantification, prognosis, and management challenges Periodontol 80 2000 2019 126 147 10.1111/prd.12259 31090138 2 Ranganathan K. Kavitha L. Sharada P. Intra-observer and inter-observer variability in two grading systems for oral epithelial dysplasia: a multi-centre study in India J Oral Pathol Med 49 2020 948 955 32516857 10.1111/jop.13056 3 Dumache R. Rogobete A.F. Andreescu N. Puiu M. Genetic and epigenetic biomarkers of molecular alterations in oral carcinogenesis Clin Lab 61 2015 1373 1381 26642697 10.7754/clin.lab.2015.150327 4 Warnakulasuriya S. Reibel J. Bouquot J. Dabelsteen E. Oral epithelial dysplasia classification systems: predictive value, utility, weaknesses and scope for improvement J Oral Pathol Med 37 2008 127 133 18251935 10.1111/j.1600-0714.2007.00584.x 5 Farah C.S. Molecular, genomic and mutational landscape of oral leukoplakia Oral Dis 27 2021 803 812 33448555 10.1111/odi.13608 6 Guimarães L.M. Diniz M.G. Rogatto S.R. Gomez R.S. Gomes C.C. The genetic basis of oral leukoplakia and its key role in understanding oral carcinogenesis J Oral Pathol Med 50 2021 632 638 33217066 10.1111/jop.13140 7 Prime S.S. Cirillo N. Cheong S.C. Prime M.S. Parkinson E.K. Targeting the genetic landscape of oral potentially malignant disorders has the potential as a preventative strategy in oral cancer Cancer Lett 518 2021 102 114 34139286 10.1016/j.canlet.2021.05.025 8 Izumchenko E. Sun K. Jones S. Notch1 mutations are drivers of oral tumorigenesis Cancer Prev Res 8 2015 277 286 10.1158/1940-6207.CAPR-14-0257 PMC4383685 25406187 9 Farah C.S. Jessri M. Bennett N.C. Dalley A.J. Shearston K.D. Fox S.A. Exome sequencing of oral leukoplakia and oral squamous cell carcinoma implicates DNA damage repair gene defects in malignant transformation Oral Oncol 96 2019 42 50 31422212 10.1016/j.oraloncology.2019.07.005 10 Wood H.M. Daly C. Chalkley R. The genomic road to invasion-examining the similarities and differences in the genomes of associated oral pre-cancer and cancer samples Genome Med 9 2017 53 28592326 10.1186/s13073-017-0442-0 PMC5461742 11 Li X. Liu L. Zhang J. Improvement in the risk assessment of oral leukoplakia through morphology-related copy number analysis Sci China Life Sci 64 2021 1379 1391 34351567 10.1007/s11427-021-1965-x 12 Wils L.J. Poell J.B. Brink A. Elucidating the genetic landscape of oral leukoplakia to predict malignant transformation Clin Cancer Res 29 2023 602 613 36449687 10.1158/1078-0432.CCR-22-2210 13 Cai X. Zhang J. Li L. Copy number alterations predict development of OSCC from oral leukoplakia J Dent Res 103 2024 138 146 38217281 10.1177/00220345231217160 14 Anne A. Kumar L. Salavadi R.K. Somatic variants and exon-level copy number changes in five hyperplastic oral leukoplakias Cytogenet Genome Res 162 2022 560 569 36630923 10.1159/000528890 15 Adorno-Farias D. Santos J.N.D. González-Arriagada W. Whole-exome sequencing of oral epithelial dysplasia samples reveals an association with new genes Braz Oral Res 37 2023 e016 10.1590/1807-3107bor-2023.vol37.0016 36790257 16 Márquez A. Mujica I. Jordan N. Genome sequencing reveals molecular subgroups in oral epithelial dysplasia Braz Oral Res 37 2023 e063 10.1590/1807-3107bor-2023.vol37.0063 37341234 17 Farah C.S. Shearston K. Melton P.E. Fox S.A. Genome-wide characterization of the mutational landscape of proliferative verrucous leukoplakia Oral Surg Oral Med Oral Pathol Oral Radiol 138 2024 99 111 38760284 10.1016/j.oooo.2024.04.005 18 Kojima S. Kuribayashi N. Goda H. Nakashiro K.I. Uchida D. Oral cancer driver gene mutations in oral potentially malignant disorders: clinical significance and diagnostic implications Discov Oncol 16 2025 174 39946003 10.1007/s12672-025-01923-7 PMC11825417 19 Celentano A. Glurich I. Borgnakke W.S. Farah C.S. World Workshop on Oral Medicine VII: prognostic biomarkers in oral leukoplakia and proliferative verrucous leukoplakia-A systematic review of retrospective studies Oral Dis 27 2021 848 880 32306449 10.1111/odi.13363 20 Cai X. Zhang J. Zhang H. Li T. Biomarkers of malignant transformation in oral leukoplakia: from bench to bedside J Zhejiang Univ - Sci B 24 2023 868 882 37752089 10.1631/jzus.B2200589 PMC10522567 Acknowledgments This work was supported by 10.13039/501100001809 National Natural Science Foundation of China 82474585 Jiangsu Provincial Key Laboratory of Tumor Biotherapy XZSYSKF2023032 Xuzhou Science and Technology Plan Fund KC22217 ",
  "metadata": {
    "Title of this paper": "Biomarkers of malignant transformation in oral leukoplakia: from bench to bedside",
    "Journal it was published in:": "Journal of Dental Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485412/"
  }
}