{
  "title": "Paper_587",
  "abstract": "pmc Food Sci Nutr Food Sci Nutr 2357 fsn FSN3 Food Science & Nutrition 2048-7177 Wiley PMC12477325 PMC12477325.1 12477325 12477325 41030837 10.1002/fsn3.71035 FSN371035 FSN3-2025-05-1448.R1 1 Original Article Original Article Nanoliposomal Formulation of Gynura procumbens Bhowmik Leon  1 Rahaman Ashikur  1 Karmakar Madhobi  1 Antu S. M. M. Sharif Nowaz  1 Zahid Zahidul Islam  1 Shuma Madhabi Lata  2 Sharker Shazid Md.  1 Reza Hasan Mahmud  1 Halder Shimul https://orcid.org/0000-0002-8445-2965  3 shimulpht@du.ac.bd Shill Manik Chandra  1 manik.shill@northsouth.edu   1 Department of Pharmaceutical Sciences North South University Dhaka Bangladesh   2 Department of Pharmacy, School of Pharmacy and Public Health Independent University Bangladesh Dhaka Bangladesh   3 Department of Pharmaceutical Technology, Faculty of Pharmacy University of Dhaka Dhaka Bangladesh * Correspondence: shimulpht@du.ac.bd manik.shill@northsouth.edu 28 9 2025 10 2025 13 10 497558 10.1002/fsn3.v13.10 e71035 12 8 2025 12 5 2025 12 9 2025 28 09 2025 30 09 2025 01 10 2025 © 2025 The Author(s). Food Science & Nutrition https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT  Gynura procumbens G. procumbens i.p G. procumbens  Gynura procumbens G. procumbens cisplatin Gynura procumbens hepatoprotective liposomal drug delivery system nephroprotective North South University, Dhaka 10.13039/501100019782 CTRG‐21‐SHLS‐02 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Bhowmik L. A. Rahaman M. Karmakar 2025 Nanoliposomal Formulation of Gynura procumbens Food Science & Nutrition 13 10 e71035 10.1002/fsn3.71035 Leon Bhowmik and Ashikur Rahaman contributed equally to this work.  Funding: 1 Introduction Since ancient times, plants have been integral to human life, providing food, clothing, shelter, and medicinal remedies. Many ancient cultures recognized the therapeutic value of herbal medicine, which remains an important alternative treatment option. Plants and herbs have been used to manage various ailments, including urinary disorders, diabetes, asthma, stroke, hypertension, diarrhea, and wounds (Drews 2000 2020 2004 2001 2021 2000 2022  Gynura procumbens 2023 2016 2013 Despite its diverse phytochemical profile and therapeutic potential, the clinical and nutraceutical application of G. procumbens 2025 2016 2023 Nano‐drug delivery systems offer a promising solution to these issues, providing an innovative approach to overcoming the limitations of traditional plant extract formulations (Bonifácio et al. 2014 2020 2011 2013 2011 2022 2 Materials and Methods 2.1 Chemicals and Reagents Phosphatidylcholine, derived from soy lecithin (Cat. No. L0023), and cholesterol (Cat. No. C0318) was procured from Tokyo Chemical Industries (Tokyo, Japan). Meanwhile, silymarin (Cat. No. S0292) and cisplatin (Cat. No. P4394) were acquired from Sigma‐Aldrich (St. Louis, MO, USA). All other chemicals, reagents, and solvents used in the study were of analytical grade and sourced from acceptable commercial suppliers. 2.2 Collection, Identification, and Extraction of Plant Materials After gathering from Natore, Bangladesh, G. procumbens 2024 2025 2.3  GC MS GLE Gas chromatography–mass spectrometry (GC–MS) was used to analyze the phytochemical composition of GLE. The analysis was conducted using a Clarus 690 gas chromatograph (PerkinElmer, CA, USA) fitted with an HP‐5MS capillary column (30 m × 0.25 mm, 0.25 μm film thickness), coupled to a Clarus SQ 8 C mass spectrometer (PerkinElmer, CA, USA). A 1 μL sample of GLE was injected in splitless mode, with high‐purity helium (99.999%) serving as the carrier gas at a constant flow rate of 1 mL/min over a 60 min run. The analysis was performed in electron ionization (EI) mode at 70 eV. The injector temperature was set to 280°C, and the oven temperature was programmed to start at 60°C (no hold), then ramped up at 4°C per min to 240°C, where it was held for 15 min (Zilani et al. 2021 2011 2.4 Preparation of LIP GLE In this study, LIP–GLE was prepared using the thin film hydration method, as described previously (Zhang 2017 2017 2.5 Dynamic Light Scattering ( DLS The particle size distribution of LIP–GLE was evaluated using dynamic light scattering (DLS) with an SZ‐100 nanoparticle analyzer (Horiba, Japan). For the analysis, the LIP–GLE sample was diluted in Milli‐Q water to maintain a GLE concentration of 10 μg/mL. Measurements were carried out at 25°C with a detection angle of 90°. To assess colloidal stability, both the zeta potential and the polydispersity index (PDI) were measured. All tests were conducted in triplicate to ensure accuracy and reproducibility. 2.6 Transmission Electron Microscopy ( TEM The surface morphology of the LIP–GLE was examined using TEM to observe droplet structure and size. The formulation was diluted with Milli‐Q water (0.5%, w/v) and applied to a 300‐mesh copper grid coated with carbon. Negative staining was performed using a 2% (w/v) phosphotungstic acid (PTA) solution and gentle rinsing with Milli‐Q water to remove excess stain. The grid was then oven‐dried under vacuum to eliminate moisture. TEM analysis was conducted using a Talos F200X microscope (Thermo Fisher, Waltham, MA, USA) operated at 200 kV. ImageJ software (NIH, Bethesda, MD, USA) assessed and confirmed droplet size and morphology. 2.7 Interaction of GLE The compatibility and potential interactions among the components of the LIP–GLE were evaluated using Attenuated Total Reflectance‐Fourier Transform Infrared (ATR‐FTIR) spectroscopy to ensure the stability and integrity of the formulation. ATR–FTIR analysis was conducted using a Shimadzu IR‐Prestige‐21 FTIR spectrometer (Tokyo, Japan) equipped with a horizontal Golden Gate MKII single‐reflection ATR system (Specac, Kent, UK). Each individual sample, including GLE, lecithin, cholesterol, and the LIP–GLE, was carefully placed on the sample platform to avoid contamination and interference. Spectra were recorded within the wavenumber range of 600–4000 cm −1 −1 2.8 In Vitro Dissolution/Dispersion Tests To evaluate the dispersibility of GLE, 1 g of the sample was tested using an in vitro dissolution/dispersion setup. The experiment was conducted with a USP Type‐II dissolution apparatus, using two different media: distilled water and a pH 1.2 solution (0.1 N HCl). The test was performed in 900 mL of medium maintained at 37°C ± 0.5°C, with constant stirring at 50 rpm for 60 min. Samples were collected from the center of the vessel at 5, 15, 30, 45, and 60 min intervals using a micropipette. After each sample was taken, the same volume of fresh medium was added to maintain consistency. The collected samples were then centrifuged at 10,000 × g 2019 2.9 Animals Healthy male Wistar albino rats, weighing between 250 and 300 g, were obtained from North South University, Dhaka, Bangladesh, for the experimental study. The animals were housed in pairs in standard laboratory cages under controlled conditions, including a 12‐h light/dark cycle, a temperature of 24°C ± 1°C, and a relative humidity of 55% ± 5%. They had free access to standard laboratory chow and water. Before oral administration of the GLE samples, all rats were fasted for at least 12 h to standardize absorption conditions, during which food and water were withheld. All animal procedures were carried out following ethical guidelines approved by the Institutional Animal Care and Ethical Committee of North South University (Approval No. 2021/OR‐NSU/IACUC/1102), following international standards set by the Council for International Organizations of Medical Sciences (CIOMS/ICLAS), the Nuffield Council on Bioethics (NCB), and the International Council for Laboratory Animal Science (Turner et al. 2015 2.10 Experimental Rat Model of Kidney and Liver Injury The protective effects of GLE samples against cisplatin‐induced liver and kidney damage were assessed using a well‐established rat model of acute hepatorenal toxicity. To induce organ injury, a single intraperitoneal dose of cisplatin (7.5 mg/kg in saline) was administered on the seventh day of the experiment (Aboraya et al. 2022 2023 2017 p.o p.o p.o 2024 2025 i.p g i.p 2.11 Evaluation of Serum Biomarkers Serum biomarkers were evaluated to assess nephrotoxicity and hepatotoxicity in rats. Blood urea nitrogen (BUN; Cat. No. E‐BC‐K183‐S.50) and creatinine (Cat. No. Cay500701‐96) were measured using diagnostic kits from HUMAN GmbH, Wiesbaden, Hesse, Germany, to determine renal function. Measurement of hepatic biomarkers was carried out using commercially available reagent kits from Fortress Diagnostics Limited (Northern Ireland, United Kingdom): alanine aminotransferase (ALT) (GPT, IFCC, liquid‐stable; Cat. No. BXC0213A), aspartate aminotransferase (AST) (GOT, IFCC, liquid‐stable; Cat. No. BXC0203A), and alkaline phosphatase (ALP) (L.S, AMP, IFCC; Cat. No. BXC0184C). All biomarker levels were determined spectrophotometrically at a wavelength of 340 nm, following the respective manufacturers' protocols (Veskoukis et al. 2018 2.12 Oxidative Stress and Antioxidant Activity Measurement The collected samples were homogenized and sonicated to assess oxidative stress and antioxidant activity in liver and kidney tissues, then centrifuged at 10,000 × g 2024 2021 2021 2.13 Histopathological Examination Histopathological analysis of liver and kidney tissues was carried out using a modified version of the protocol described by Quaresma et al. ( 2005 2013 2021 2.14 Data Analysis Data are expressed as mean ± standard deviation (SD) or mean ± standard error of the mean (SEM). Statistical analysis was performed using one‐way ANOVA in GraphPad Prism‐8 software (San Diego, CA, USA). Before performing one‐way ANOVA, the underlying assumptions were tested. Independence of observations was ensured by the experimental design, as each subject was assigned to only one treatment group. The normality of residuals was assessed using the Shapiro–Wilk test, and all data sets showed no significant deviation from normality ( p p p 3 Results and Discussion 3.1  GC MS The GC–MS spectrum presented in Figure 1 1 1 1 2021 2020 FIGURE 1 Gas chromatography–mass spectrometric (GC–MS) chromatogram of GLE. TABLE 1 List of identified compounds in the crude extract of Gynura procumbens Retention time (min) Chemical name % Peak area 7.71 2‐Mercaptopropanoic acid 15.04 22.47 Di‐epi‐1,10‐cubenol 4.65 27.48 Tetradecanoic acid, 10,13‐dimethyl‐, methyl ester 1.79 28.55 N‐hexadecanoic acid 19.39 30.45 Phthalic acid, isobutyl 2‐methylpent‐3‐yl ester 0.15 31.10 Cyclopropaneundecanal, 2‐nonyl— 1.14 31.29 Heptadecanoic acid, 16‐methyl‐, methyl ester 2.23 32.21 Methyl 2‐hydroxy‐heptadecanoate 14.72 35.14 Glycidyl palmitate 0.63 3.2 Physicochemical Characterizations of LIP GLE The LIP–GLE was characterized for size distribution, PDI, zeta potential, and morphology using DLS and TEM techniques. Liposomes with a narrow particle size serve as passive targeting methods to concentrate at sites, primarily attributed to the enhanced permeability and retention effect. The DLS analysis revealed that the GLE did not exhibit a defined nanoparticulate nature, with irregular and larger particle distribution, indicating poor dispersibility and potential limitations in bioavailability (data not shown). In contrast, the LIP–GLE exhibited a consistent particle size distribution, with an average hydrodynamic diameter of around 112 ± 2.6 nm and a low PDI of 0.231 ± 0.04, indicating favorable homogeneity and stability. The zeta potential was measured at −16.1 ± 3.1 mV, suggesting high colloidal stability due to strong electrostatic repulsion, which prevents aggregation and enhances shelf life. TEM imaging confirmed the liposome's spherical morphology and well‐defined nanostructure (Figure 2B FIGURE 2 Particle size distribution of GLE samples dispersed in water. (A) DLS analysis determined the size distribution in distilled water. (B) TEM image of LIP–GLE dispersed in distilled water. Bar represents 500 nm. 3.3 In Vitro Dispersion Study The in vitro dispersion study was conducted to assess and compare the dispersibility of the GLE samples in distilled water and 0.1 N HCl over 60 min (Figure 3 2 FIGURE 3 Dissolution/dispersion tests of GLE samples. (A) Dissolution/dispersion tests in distilled water; (B) dissolution/dispersion tests under acidic conditions (0.1 N HCl, pH 1.2). ●, GLE and △, LIP–GLE. Each bar represents the mean ± SD of 3 independent experiments. 3.4 Drug–Polymer Interactions FTIR analysis was conducted to evaluate the molecular interactions among the components of LIP–GLE, as illustrated in Figure 4 −1 −1 −1 −1 −1 −1 −1 −1 −1 −1 4B FIGURE 4 ATR‐FTIR spectroscopic analysis of GLE samples in the spectral region from (A) 4000–600 cm −1 −1 3.5 General Conditions of the Treated Animals During the experimental period, all animals were monitored daily for clinical signs, symptoms, and mortality. No deaths were observed in any group. Rats exhibited progressive dehydration, weight loss, anemia, reduced activity, and gastrointestinal distress within 2 days of receiving cisplatin (7.5 mg/kg) (Perše and Veceric‐Haler 2018 p 3.6 Effect of GLE The hepatoprotective potential of GLE samples was evaluated by assessing liver function biomarkers: ALT, AST, and ALP presented in Figure 5 p p p p 2023 2018 FIGURE 5 Effect of GLE samples on hepatic markers in the rat liver: (A) alanine aminotransferase (ALT), (B) aspartate aminotransferase (AST), and (C) alkaline phosphatase (ALP) levels. The data were expressed as Mean ± SEM; ( n p p 3.7 Effect of GLE The impact of GLE samples on cisplatin‐induced renal dysfunction was assessed through the quantification of creatinine and BUN and is presented in Figure 6 p p p p FIGURE 6 Nephroprotective potential of GLE and LIP–GLE in a rat nephropathy model induced by cisplatin. (A) Serum creatinine and (B) BUN levels in rats with orally administered GLE and LIP–GLE. ** p p ## p n 3.8 Effect of GLE The effects of GLE on oxidative stress were evaluated by measuring NO and AOPP levels in cisplatin‐induced hepatorenal toxicity, presented in Figure 7 p 7 2023 FIGURE 7 Effect of LIP–GLE on oxidative stress and antioxidant enzymes in experimental rats induced by cisplatin in liver (A) NO, (B) SOD, (C) GSH, and (D) AOPP. Data are expressed as means ± SEM; * p p p n 3.9 Effect of GLE The assessment of antioxidant defense mechanisms in the context of cisplatin‐induced liver and kidney damage involved measuring GSH and SOD levels, as shown in Figure 8 p 2021 FIGURE 8 Effect of LIP–GLE on oxidative stress and antioxidant enzymes in experimental rats induced by cisplatin in Kidney (A) NO (B) SOD (C) GSH and (D) AOPP. Data are expressed as means ± SEM; ** p p n 3.10 Histological Evaluation of GLE Histopathological evaluation of liver tissues stained with H&E and Sirius Red provided critical insight into the hepatoprotective potential of GLE samples, illustrated in Figures 9  10 9A 10A 9B 10B 9C 10C 9D 9E 10E p 2022 FIGURE 9 Histopathological examination of the effect LIP–GLE and GLE on rat liver induced by cisplatin using Hematoxylin and Eosin (H & E) staining. (A) Rats treated with saline, (B) cisplatin‐treated rats, (C) cisplatin‐treated rats with silymarin, (D) cisplatin‐treated rats with GLE, and (E) cisplatin‐treated rats with LIP–GLE; H & E of the liver of the diseased rats (cisplatin) showed obstruction of the central vein suggesting sclerosis (green arrow), cellular degranulation (yellow arrow), and the bile duct is inflamed (red arrow) and obstructed. *** p n FIGURE 10 Histopathological examination of the effect of LIP–GLE and GLE on rat liver induced by cisplatin using Sirius Red staining. (A) Rats treated with saline, (B) cisplatin‐treated rats, (C) cisplatin‐treated rats with silymarin, (D) cisplatin‐treated rats with GLE, and (E) cisplatin‐treated rats with LIP–GLE; cisplatin intoxication showed accumulation of collagen mass in the liver (green arrow). *** p n 3.11 Histological Evaluation of GLE Histopathological analysis of kidney tissues using H&E and Sirius Red staining provided comprehensive insights into the nephroprotective effects of GLE samples in cisplatin‐induced nephrotoxicity, as depicted in Figures 11  12 11A 11B 12B 11C 11D 11E 12E p 2024 FIGURE 11 Histopathological examination of the effect LIP–GLE and GLE on rat kidney induced by cisplatin using hematoxylin and eosin staining. (A) Rats treated with saline, (B) cisplatin‐treated rats, (C) cisplatin‐treated rats with silymarin, (D) cisplatin‐treated rats with GLE, and (E) cisplatin‐treated rats with LIP–GLE; cisplatin‐challenged rats showed the size of the Bowman's capsule (green arrow), and the glomerulus showed hypercellularity (yellow arrow), presenting glomerulonephritis. Tubules showed distortion and hypertrophy (red arrow). *** p n FIGURE 12 Histopathological examination of the effect LIP–GLE and GLE on rat kidney induced by cisplatin using Sirius Red staining. (A) Rats treated with saline, (B) cisplatin‐treated rats, (C) cisplatin‐treated rats with silymarin, (D) cisplatin‐treated rats with GLE, and (E) cisplatin‐treated rats with LIP–GLE; cisplatin intoxication showed accumulation of collagen tissues in the kidney (green arrow). ** p p p n 4 Conclusions LIP–GLE demonstrated strong protective effects against cisplatin‐induced liver and kidney toxicity in rats. The liposomal formulation proved more effective than GLE, as shown by improved biomarkers of liver and kidney function, increased antioxidant enzyme activities, and reduced oxidative stress markers. Histopathological evaluations confirmed liver and kidney structure preservation, with minimal fibrosis and inflammation observed in the LIP–GLE group. These improved therapeutic outcomes are likely due to the enhanced dispersibility, solubility, and bioavailability of the extract and the targeted delivery of its bioactive components through liposomal encapsulation. Thus, the findings suggest that LIP–GLE could be a promising therapeutic strategy for reducing cisplatin‐induced damage to the liver and kidneys, offering a novel and effective way to boost the nutraceutical benefits of GLE. Author Contributions  Leon Bhowmik: Ashikur Rahaman: Madhobi Karmakar: S. M. M. Sharif Nowaz Antu: Zahidul Islam Zahid: Madhabi Lata Shuma: Shazid Md. Sharker: Hasan Mahmud Reza: Shimul Halder: Manik Chandra Shill: Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments The authors sincerely thank the Semiconductor Technology Research Centre, University of Dhaka, for allowing the particle size analysis, and Jashore University of Science and Technology, Bangladesh, for their valuable support in conducting the GC–MS analysis, which significantly contributed to the completion of this research. Data Availability Statement All data supporting the findings of this study are available within the manuscript. References Abd Rashid N. S. A. S. Abd Halim S. L. Teoh 2021 The Role of Natural Antioxidants in Cisplatin‐Induced Hepatotoxicity Biomedicine & Pharmacotherapy 144 112328 10.1016/j.biopha.2021.112328 34653753 Aboraya D. M. A. El Baz E. F. Risha F. M. Abdelhamid 2022 Hesperidin Ameliorates Cisplatin Induced Hepatotoxicity and Attenuates Oxidative Damage, Cell Apoptosis, and Inflammation in Rats Saudi Journal of Biological Sciences 29 5 3157 3166 10.1016/j.sjbs.2022.01.052 35844386 PMC9280168 Allen T. M. P. R. Cullis 2013 Liposomal Drug Delivery Systems: From Concept to Clinical Applications Advanced Drug Delivery Reviews 65 1 36 48 10.1016/j.addr.2012.09.037 23036225 Amrati F. E.‐Z. M. Bourhia M. Slighoua 2021 Traditional Medicinal Knowledge of Plants Used for Cancer Treatment by Communities of Mountainous Areas of Fez‐Meknes‐Morocco Saudi Pharmaceutical Journal 29 10 1185 1204 10.1016/j.jsps.2021.09.005 34703372 PMC8523330 Anwer T. S. Alshahrani A. M. H. Somaili 2023 Nephroprotective Effect of Diosmin Against Cisplatin‐Induced Kidney Damage by Modulating IL‐1β, IL‐6, TNFα and Renal Oxidative Damage Molecules 28 3 1302 10.3390/molecules28031302 36770968 PMC9920922 Arifin W. N. W. M. Zahiruddin 2017 Sample Size Calculation in Animal Studies Using Resource Equation Approach Malaysian Journal of Medical Sciences 24 5 101 105 10.21315/mjms2017.24.5.11 PMC5772820 29386977 Bonifácio B. V. P. B. da Silva M. A. D. S. Ramos K. M. S. Negri T. M. Bauab M. Chorilli 2014 Nanotechnology‐Based Drug Delivery Systems and Herbal Medicines: A Review International Journal of Nanomedicine 9 1 15 10.2147/IJN.S52634 PMC3862741 24363556 Chandra Shill M. A. All Rakib S. Islam Khan 2024 Polyphenol‐Standardized  Aphanamixis polystachya Journal of Food Biochemistry 2024 1 9441968 10.1155/2024/9441968 Chandra Shill M. H. A. S. El‐Nashar P. Prova Mollick 2024 Longevity Spinach ( Gynura procumbens Chemistry & Biodiversity 21 5 e202301719 10.1002/cbdv.202301719 38361048 Coimbra M. B. Isacchi L. van Bloois 2011 Improving Solubility and Chemical Stability of Natural Compounds for Medicinal Use by Incorporation Into Liposomes International Journal of Pharmaceutics 416 2 433 442 10.1016/j.ijpharm.2011.01.056 21291975 Drews J. 2000 Drug Discovery: A Historical Perspective Science 287 5460 1960 1964 10.1126/science.287.5460.1960 10720314 Ernst E. 2000 The Role of Complementary and Alternative Medicine in Cancer Lancet Oncology 1 176 180 10.1016/s1470-2045(00)00031-0 11905656 Ghosh A. S. Banik Y. Suzuki 2023 Lysophosphatidylcholine‐Based Liposome to Improve Oral Absorption and Nephroprotective Effects of Astaxanthin Journal of the Science of Food and Agriculture 103 6 2981 2988 10.1002/jsfa.12329 36350072 Haimoud S. A. R. Allem M. Medjekane 2023 Antispasmodic and Nephroprotective Potentials of Native Algerian Propolis and Bee Pollen: An Experimental Study in Mice International Food Research Journal 30 1 109 118 10.47836/ifrj.30.1.08 Halder S. S. Afrose M. C. Shill 2024 Self‐Micellizing Solid Dispersion of Thymoquinone With Enhanced Biopharmaceutical and Nephroprotective Effects Drug Delivery 31 1 2337423 38590120 10.1080/10717544.2024.2337423 PMC11005877 Hamilton A. C. 2004 Medicinal Plants, Conservation and Livelihoods Biodiversity and Conservation 13 8 1477 1517 10.1023/B:BIOC.0000021333.23413.42 Hew C.‐S. B.‐Y. Khoo L.‐H. Gam 2013 The Anti‐Cancer Property of Proteins Extracted From Gynura procumbens PLoS One 8 7 e68524 10.1371/journal.pone.0068524 23874655 PMC3708952 Ibrahim Y. H. E. Y. G. Regdon E. I. Hamedelniel T. Sovány 2020 Review of Recently Used Techniques and Materials to Improve the Efficiency of Orally Administered Proteins/Peptides DARU Journal of Pharmaceutical Sciences 28 1 403 416 10.1007/s40199-019-00316-w 31811628 PMC7214593 Jensen E. C. 2013 Quantitative Analysis of Histological Staining and Fluorescence Using ImageJ Anatomical Record 296 3 378 381 10.1002/ar.22641 23382140 Jobaer M. A. S. Ashrafi M. Ahsan 2023 Phytochemical and Biological Investigation of an Indigenous Plant of Bangladesh, Gynura procumbens Molecules 28 10 4186 10.3390/molecules28104186 37241926 PMC10221986 Kim H. H. S. E. Ha P. Vetrivel P. B. Bhosale S. M. Kim G. S. Kim 2021 Potential Antioxidant and Anti‐Inflammatory Function of Gynura procumbens International Journal of Molecular Sciences 22 16 8716 10.3390/ijms22168716 34445416 PMC8396044 Lamia S. S. T. Emran J. K. Rikta 2021 Coenzyme Q10 and Silymarin Reduce CCl(4)‐Induced Oxidative Stress and Liver and Kidney Injury in Ovariectomized Rats‐Implications for Protective Therapy in Chronic Liver and Kidney Diseases Pathophysiology 28 1 50 63 10.3390/pathophysiology28010005 35366269 PMC8830449 Mohammed S. J. H. H. H. Amin S. B. Aziz 2019 Structural Characterization, Antimicrobial Activity, and In Vitro Cytotoxicity Effect of Black Seed Oil Evidence‐Based Complementary and Alternative Medicine 2019 6515671 10.1155/2019/6515671 31531117 PMC6721493 Newman D. J. G. M. Cragg 2020 Natural Products as Sources of New Drugs Over the Nearly Four Decades From 01/1981 to 09/2019 Journal of Natural Products 83 3 770 803 10.1021/acs.jnatprod.9b01285 32162523 Nsairat H. D. Khater U. Sayed F. Odeh A. Al Bawab W. Alshaer 2022 Liposomes: Structure, Composition, Types, and Clinical Applications Heliyon 8 5 e09394 10.1016/j.heliyon.2022.e09394 35600452 PMC9118483 Perše M. Z. Veceric‐Haler 2018 Cisplatin‐Induced Rodent Model of Kidney Injury BioMed Research International 2018 1 29 10.1155/2018/1462802 PMC6157122 30276200 Puri V. N. Kanojia A. Sharma K. Huanbutta D. Dheer T. Sangnim 2022 Natural Product‐Based Pharmacological Studies for Neurological Disorders Frontiers in Pharmacology 13 1011740 10.3389/fphar.2022.1011740 36419628 PMC9676372 Quaresma J. A. S. V. L. R. S. Barros E. R. Fernandes 2005 Reconsideration of Histopathology and Ultrastructural Aspects of the Human Liver in Yellow Fever Acta Tropica 94 2 116 127 10.1016/j.actatropica.2005.03.003 15829426 Rates S. M. 2001 Plants as Source of Drugs Toxicon 39 5 603 613 10.1016/s0041-0101(00)00154-9 11072038 Sajid M. S. S. Cameotra M. S. Ahmad Khan I. Ahmad 2018 Nanoparticle‐Based Delivery of Phytomedicines: Challenges and Opportunities New Look to Phytomedicine: Advancements in Herbal Products as Novel Drug Leads Elsevier Inc 10.1016/B978-0-12-814619-4.00024-0 Shill M. C. A. K. Bepari M. Khan 2021 Therapeutic Potentials of Colocasia Affinis Leaf Extract for the Alleviation of Streptozotocin‐Induced Diabetes and Diabetic Complications: In Vivo and In Silico‐Based Studies Journal of Inflammation Research 14 443 459 10.2147/JIR.S297348 33642871 PMC7903966 Shill M. C. M. F. B. Jalal M. L. Shuma P. P. Mollick M. A. Muhit S. Halder 2025  Gynura procumbens PLoS One 20 2 e0304435 10.1371/journal.pone.0304435 39992935 PMC11849907 Stein S. E. A. Mikaia V. E. White 2011 NIST Standard Reference Database 1A. NIST/EPA/NIH Mass Spectral Database (NIST 11) and NIST Mass Spectral Search Program (Version 2.0g) User's Guide Tan H.‐L. K.‐G. Chan P. Pusparajah L.‐H. Lee B.‐H. Goh 2016  Gynura procumbens Frontiers in Pharmacology 7 52 10.3389/fphar.2016.00052 27014066 PMC4791373 Tan J. N. S. Mohd Saffian F. Buang 2020 Antioxidant and Anti‐Inflammatory Effects of Genus Gynura: A Systematic Review Frontiers in Pharmacology 11 504624 10.3389/fphar.2020.504624 33328981 PMC7734347 Turner P. V. C. Pekow J. M. Clark 2015 Roles of the International Council for Laboratory Animal Science (ICLAS) and International Association of Colleges of Laboratory Animal Medicine (IACLAM) in the Global Organization and Support of 3Rs Advances in Laboratory Animal Science Journal of the American Association for Laboratory Animal Science: JAALAS 54 2 174 180 25836964 PMC4382622 Veskoukis A. S. V. M. Nikos K. Antonios P. Vassilis M. G. Nikolaidis 2018 Spectrophotometric Assays for Measuring Redox Biomarkers in Blood and Tissues: The NADPH Network Redox Report 23 1 47 56 10.1080/13510002.2017.1392695 29088980 PMC6748689 Wardana A. P. N. S. Aminah A. N. Kristanti 2023  Gynura procumbens Rasayan Journal of Chemistry 16 2 802 810 10.31788/RJC.2023.1628298 Xiang B. D.‐Y. Cao 2017 Preparation of Drug Liposomes by Thin‐Film Hydration and Homogenization BT ‐ Liposome‐Based Drug Delivery Systems W.‐L. Lu X.‐R. Qi Springer Berlin Heidelberg 10.1007/978-3-662-49231-4_2-1 Zhang H. 2017 Thin‐Film Hydration Followed by Extrusion Method for Liposome Preparation BT—Liposomes: Methods and Protocols G. G. M. D'Souza Springer New York 10.1007/978-1-4939-6591-5_2 Zilani M. N. H. M. A. Islam P. Biswas 2021 Metabolite Profiling, Anti‐Inflammatory, Analgesic Potentials of Edible Herb Colocasia Gigantea and Molecular Docking Study Against COX‐II Enzyme Journal of Ethnopharmacology 281 114577 10.1016/j.jep.2021.114577 34464698 ",
  "metadata": {
    "Title of this paper": "Metabolite Profiling, Anti‐Inflammatory, Analgesic Potentials of Edible Herb Colocasia Gigantea and Molecular Docking Study Against COX‐II Enzyme",
    "Journal it was published in:": "Food Science & Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477325/"
  }
}