{
  "title": "Paper_725",
  "abstract": "pmc Toxins (Basel) Toxins (Basel) 1577 toxins toxins Toxins 2072-6651 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474252 PMC12474252.1 12474252 12474252 41003521 10.3390/toxins17090457 toxins-17-00457 1 Article Integrative Analysis of Metabolome and Transcriptome Identifies the Role of γ-Glutamylcysteine in Mitigating Deoxynivalenol-Induced Toxicity Bao Xiaocheng Validation Formal analysis Writing – original draft 1 Chen Xiaolei Methodology Validation Investigation 2 Chen Shuai Writing – review & editing Funding acquisition 1 https://orcid.org/0000-0002-4661-3027 Sun Ming-An Formal analysis Writing – review & editing 1 https://orcid.org/0000-0003-2472-4647 Fan Hairui Conceptualization Software Writing – original draft Writing – review & editing 2 * 1 mx120240996@stu.yzu.edu.cn chenshuai@yzu.edu.cn mingansun@yzu.edu.cn 2 mx120230917@stu.yzu.edu.cn * hairuifan@yzu.edu.cn 12 9 2025 9 2025 17 9 497674 457 25 7 2025 01 9 2025 06 9 2025 12 09 2025 28 09 2025 28 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Deoxynivalenol (DON), a prevalent environmental toxin produced by Fusarium fungi, frequently contaminates feed and food products. However, the critical metabolites and regulatory factors involved in DON toxicity remain poorly understood. Building upon our established DON-induced porcine intestinal epithelial cells (IPEC-J2) injury model, this study employed liquid chromatography-tandem mass spectrometry (LC-MS/MS) to conduct metabolomic analysis, and integrated analysis with transcriptomic data from DON-exposed IPEC-J2. Results identified 1524 differentially expressed metabolites, and revealed significant enrichment in Glutathione metabolism and Mucin-type O-glycan biosyn-thesis pathways. Notably, γ-glutamylcysteine ( γ γ γ γ γ deoxynivalenol metabolome transcriptome toxicity γ-glutamylcysteine Natural Science Foundation of the Jiangsu Higher Education Institutions of China 24KJD230003 23KJB180028 China Postdoctoral Foundation 2023M732990 This research was funded by the Natural Science Foundation of the Jiangsu Higher Education Institutions of China (24KJD230003, 23KJB180028) and China Postdoctoral Foundation (2023M732990). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Key Contribution This study enhances understandings of DON’s toxicological mechanisms, particularly its effects on oxidative stress and metabolic balance, and provides theoretical and experimental support for using γGC as a potential nutritional intervention to prevent and mitigate DON-related toxicity. 1. Introduction Deoxynivalenol (DON, Vomitoxin) is a secondary metabolite produced by fungi such as Fusarium species, which is widely present in crops and related products, especially in grains and feeds, presenting a significant risk to both human and animal health [ 1 2 3 4 5 6 7 8 9 10 10 11 12 13 14 15 16 17 Metabolomics, as an important technique for studying the overall metabolic state of biological systems, can comprehensively identify and quantify the dynamic changes in endogenous metabolites and has been widely applied in the research of disease mechanisms and toxicology [ 9 18 19 11 12 20 21 Glutathione (GSH) is a key antioxidant within cells, maintaining REDOX homeostasis by scavenging free radicals and peroxides [ 22 23 24 γ 25 γ 26 γ In this study, in an attempt to address the aforementioned issues, we employed non-targeted liquid chromatography-tandem mass spectrometry (LC-MS) together with transcriptome sequencing technology to systematically analyze the metabolic and transcriptional changes in IPEC-J2 intestinal epithelial cells after DON exposure. The results showed that DON significantly reshaped the metabolic characteristics of cells, induced cytotoxicity, and led to significant changes in multiple metabolites and gene expressions. In particular, we identified a group of differential metabolites- γ 2. Results 2.1. Metabolomic Analysis in IPEC-J2 Cells Exposed to DON By constructing the partial least squares discriminant analysis (PLS-DA) model, the relationship between metabolite abundance and sample category was clarified. The results showed that in both ionic modes, the samples in the DON treatment group and the control group could be clearly divided into two independent clusters in the metabolic characteristic space ( Figure 1 Figure 1 Tables S1 and S2 Figure 1 Table S3 2.2. Integrated Analysis of Metabolome and Transcriptome of DON-Exposed Cells To systematically reveal the molecular mechanisms triggered by DON exposure and the involved signaling pathways, this study conducted an integrated analysis of DEMs and differentially expressed genes (DEGs) between the DON treatment group and control group, and simultaneously carried out pathway enrichment analysis. It is notable that in the glutathione metabolic pathway, γ-L-glutamyl-L-cysteine (γ-Glu-Cys, γ p Figure 2 Table S4 γ γ 27 γ Figure 2 28 γ 2.3. γGC Attenuated DON-Induced Cytotoxicity in IPEC-J2 Cells To further clarify the potential protective effect of γ γ γ Figure 3 γ γ Figure 3 γ Figure 3 γ 2.4. γGC Attenuated DON-Induced Oxidative Stress in IPEC-J2 Cells Previous studies have indicated that DON exposure led to severe IPEC-J2 cells oxidative stress [ 28 γ γ Figure 4 γ γ Figure 4 γ 2.5. γGC Attenuated DON-Induced Apoptosis in IPEC-J2 Cells To further understand the effect of γ γ γ γ Figure 5 γ Figure 5 γ 3. Discussion In this study, we carried out a metabolomics analysis of intestinal cells exposed to DON and identified several metabolites that showed significant changes. Emerging evidence indicates that active metabolites can affect various aspects of the omics landscape, and integrating these findings with other omics data can offer valuable insights into the underlying biological mechanisms [ 29 30 Our research first identified the alterations in metabolites of intestinal epithelial cells upon DON exposure. The differential metabolites were enriched in Thiamine metabolism, Taste transduction, Sulfur relay system, Sulfur metabolism, Sphingolipid metabolism and Tyrosine metabolism, Taurine and hypotaurine metabolism, Taste transduction, Pyruvate metabolism and signaling pathways such as Purine metabolism. In other DON metabolomics studies, it has been observed that the differential metabolites and enriched metabolic pathways resulting from DON toxicity exhibit significant variation. For example, the toxic effects of DON on the intestinal tract of zebrafish are primarily mediated through alterations in 2-oxo-carboxylic acid metabolism, amino acid biosynthesis, carbon metabolism, and certain aspects of lipid metabolism [ 9 γ γ 31 22 γ γ 25 γ γ 32 γ 33 34 γ 35 γ 25 γ γ In this study, it was also found that γGC has no significant toxic effect on cell viability, and γGC significantly alleviates the reduction in cell activity induced by DON within a specific concentration range. And it shows a dose-dependent trend. This result preliminarily indicates that γ γ γ 36 γ 28 4. Conclusions In conclusion, this study confirmed that the metabolic characteristics of intestinal epithelial cells were significantly reshaped under DON exposure conditions. These alterations are closely related to the cytotoxicity induced by DON. In particular, the level of γ γ γ 5. Materials and Methods 5.1. Cell Culture and DON Treatment The IPEC-J2 cells line was used to build the model of DON exposure, and the cells was incubated with Dulbecco’s Modified Eagle Medium (DMEM) containing 10% fetal bovine serum (FBS, Gibco, Grand Island, NY, USA), in 5% CO 2 5 11 γ γ 5.2. Metabolites Extraction and LC-MS/MS Analysis To explore the metabolite changes involved in the response of IPEC-J2 cells to DON exposure, this study was based on the previously established DON-induced injury model of IPEC-J2 cells [ 11 20 5.3. Metabolomics Analysis The Compound Discoverer 3.1 (Thermo Fisher Scientific, Waltham, MA, USA) software was used to process the LC-MS/MS data, mainly including peak extraction, peak alignment and compound identification. Data preprocessing, statistical analysis, metabolite classification annotation and functional annotation were carried out using the self-developed metabolomics R software package metaX (version 1.4.2) [ 37 https://www.genome.jp/kegg/pathway.html 5.4. Integrated Analysis of Metabolome and Transcriptome All differentially expressed genes reported in our previous study with an adjusted p 11 https://www.kegg.jp/kegg/pathway.html 5.5. Detection of Cell Viability 5 × 10 3 γ γ 5.6. Flow Cytometry For the analysis of ROS level, the treated cells were incubated with 10 μM of Dihydroethidium (DHE, KeyGEN BioTECH, Nanjing, China) at a temperature of 37 °C for 20 min, and then a flow cytometer (Excitation wavelengths: 488 nm, emission wavelengths: 525 nm, Beckman Coulter, Brea, CA, USA) was used to analysis the ROS level. For the analysis of apoptosis rates, the Annexin VPE/7-AAD (CA1020, Solarbio, Beijing, China) was used to staining the cells, and then a flow cytometer (Excitation wavelengths: 488 nm, emission wavelengths: 520 nm, Beckman Coulter, Brea, CA, USA) was used to analysis apoptosis rates. Each group consists of three replicates, and each sample was analyzed using 10,000 cells. 5.7. Western Blotting The Western blotting procedure was conducted in accordance with the methodology outlined in our pervious study [ 37 Following three washes with TBST solution, the membrane was incubated at room temperature with HRP-conjugated secondary antibody (1:5000) for 2 h. The protein bands were visualized using ECL detection technology and quantitatively analyzed using ImageJ software (version 8.0.1). Anti-Bax (ER0907) and anti-Bcl-2 (SZ10-03) antibodies were obtained from HuaAn (Hangzhou, China). HSP90 (60318-1-lg) served as the loading control and was supplied by Proteintech Ltd. (Wuhan, China). 5.8. Statistical Analysis All data are presented as mean ± standard derivation (SD). Student’s t p p p Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/toxins17090457/s1 Author Contributions Conceptualization, M.-A.S. and H.F.; methodology, X.B. and X.C.; software, X.B.; validation, X.B. and X.C.; formal analysis, X.B.; investigation, X.B.; resources, X.B.; data curation, X.B.; writing—original draft preparation, X.B.; writing—review and editing, X.B., H.F., S.C. and M.-A.S.; visualization, X.B.; supervision, H.F.; project administration, H.F. and S.C.; funding acquisition, H.F. and S.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations DON Deoxynivalenol γ γ-Glutamylcysteine, γ-Glu-Cys ROS Reactive oxygen species References 1. Alshannaq A. Yu J.-H. Occurrence, Toxicity, and Analysis of Major Mycotoxins in Food Int. J. Environ. Res. Public Health 2017 14 632 10.3390/ijerph14060632 28608841 PMC5486318 2. Eriksen G.S. Knutsen H.K. Sandvik M. Brantsæter A.-L. Urinary deoxynivalenol as a biomarker of exposure in different age, life stage and dietary practice population groups Environ. Int. 2021 157 106804 10.1016/j.envint.2021.106804 34352564 3. Broekaert N. Devreese M. Demeyere K. Berthiller F. Michlmayr H. Varga E. Adam G. Meyer E. Croubels S. Comparative in vitro cytotoxicity of modified deoxynivalenol on porcine intestinal epithelial cells Food Chem. Toxicol. 2016 95 103 109 10.1016/j.fct.2016.06.012 27338712 4. Yue J. Guo D. Gao X. Wang J. Nepovimova E. Wu W. Kuca K. Deoxynivalenol (Vomitoxin)-Induced Anorexia Is Induced by the Release of Intestinal Hormones in Mice Toxins 2021 13 512 10.3390/toxins13080512 34437383 PMC8402572 5. Gruber-Dorninger C. Jenkins T. Schatzmayr G. Global Mycotoxin Occurrence in Feed: A Ten-Year Survey Toxins 2019 11 375 10.3390/toxins11070375 31252650 PMC6669473 6. Zhao L. Zhang L. Xu Z. Liu X. Chen L. Dai J. Karrow N.A. Sun L. Occurrence of Aflatoxin B1, deoxynivalenol and zearalenone in feeds in China during 2018-2020 J. Anim. Sci. Biotechnol. 2021 12 74 10.1186/s40104-021-00603-0 34243805 PMC8272344 7. Goossens J. Vandenbroucke V. Pasmans F. De Baere S. Devreese M. Osselaere A. Verbrugghe E. Haesebrouck F. De Saeger S. Eeckhout M. Influence of mycotoxins and a mycotoxin adsorbing agent on the oral bioavailability of commonly used antibiotics in pigs Toxins 2012 4 281 295 10.3390/toxins4040281 22606377 PMC3347004 8. Yang C. Song G. Lim W. Effects of mycotoxin-contaminated feed on farm animals J. Hazard. Mater. 2020 389 122087 10.1016/j.jhazmat.2020.122087 32004836 9. Wang Y. Wang L. Du Y. Yao F. Zhao M. Cai C. Zhu R. Shao S. Metabolomics study reveals DON-induced intestinal toxicity in adult zebrafish through disruption of amino acid metabolism and sphingolipid signaling pathway Aquat. Toxicol. 2025 282 107324 10.1016/j.aquatox.2025.107324 40112585 10. Pestka J.J. Deoxynivalenol: Mechanisms of action, human exposure, and toxicological relevance Arch. Toxicol. 2010 84 663 679 10.1007/s00204-010-0579-8 20798930 11. Wang H. Zong Q. Wang S. Zhao C. Wu S. Bao W. Genome-Wide DNA Methylome and Transcriptome Analysis of Porcine Intestinal Epithelial Cells upon Deoxynivalenol Exposure J. Agric. Food Chem. 2019 67 6423 6431 10.1021/acs.jafc.9b00613 31013075 12. Fan H. Wang S. Wang H. Sun M. Wu S. Bao W. Melatonin Ameliorates the Toxicity Induced by Deoxynivalenol in Murine Ovary Granulosa Cells by Antioxidative and Anti-Inflammatory Effects Antioxidants 2021 10 1045 10.3390/antiox10071045 34209652 PMC8300713 13. Tang M. Yuan D. Liao P. Berberine improves intestinal barrier function and reduces inflammation, immunosuppression, and oxidative stress by regulating the NF-κB/MAPK signaling pathway in deoxynivalenol-challenged piglets Environ. Pollut. 2021 289 117865 10.1016/j.envpol.2021.117865 34358871 14. Zhang H. Deng X. Zhou C. Wu W. Zhang H. Deoxynivalenol Induces Inflammation in IPEC-J2 Cells by Activating P38 Mapk and Erk1/2 Toxins 2020 12 180 10.3390/toxins12030180 32183221 PMC7150952 15. Zhu M. Lu E.-Q. Fang Y.-X. Liu G.-W. Cheng Y.-J. Huang K. Xu E. Zhang Y.-Y. Wang X.-J. Piceatannol Alleviates Deoxynivalenol-Induced Damage in Intestinal Epithelial Cells via Inhibition of the NF-κB Pathway Molecules 2024 29 855 10.3390/molecules29040855 38398607 PMC10891758 16. Zeinvand-Lorestani H. Sabzevari O. Setayesh N. Amini M. Nili-Ahmadabadi A. Faramarzi M.A. Comparative study of in vitro prooxidative properties and genotoxicity induced by aflatoxin B1 and its laccase-mediated detoxification products Chemosphere 2015 135 1 6 10.1016/j.chemosphere.2015.03.036 25876029 17. Wang J. Lu F. Gu S. Cao C. Xiao Y. Bao W. Wang H. Lycopene alleviates Deoxynivalenol-induced toxicity in Porcine intestinal epithelial cells by mediating mitochondrial function Toxicology 2024 506 153880 10.1016/j.tox.2024.153880 38960307 18. Zhang J. Wang N. Chen W. Zhang W. Zhang H. Yu H. Yi Y. Integrated metabolomics and transcriptomics reveal metabolites difference between wild and cultivated Ophiocordyceps sinensis Food Res. Int. 2023 163 112275 10.1016/j.foodres.2022.112275 36596185 19. Tang L. Wang Y. Gong X. Xiang J. Zhang Y. Xiang Q. Li J. Integrated transcriptome and metabolome analysis to investigate the mechanism of intranasal insulin treatment in a rat model of vascular dementia Front. Pharmacol. 2023 14 1182803 10.3389/fphar.2023.1182803 37256231 PMC10225696 20. Wang H. Xiao Y. Xu C. Cao Y. Jing P. Wu S. Liu J. Bao W. Integrated Metabolomics and Transcriptomics Analyses Reveal Metabolic Mechanisms in Porcine Intestinal Epithelial Cells under Zearalenone Stress J. Agric. Food Chem. 2022 70 6561 6572 10.1021/acs.jafc.2c01107 35583463 21. Li M. Yang J. Ye C. Bian P. Yang X. Zhang H. Luo C. Xue Z. Lei Y. Lian J. Integrated Metabolomics and Transcriptomics Analyses Reveal Metabolic Landscape in Neuronal Cells during JEV Infection Virol. Sin. 2021 36 1554 1565 10.1007/s12250-021-00445-0 34558014 PMC8692526 22. Li B. Ming H. Qin S. Nice E.C. Dong J. Du Z. Huang C. Redox regulation: Mechanisms, biology and therapeutic targets in diseases Signal Transduct. Target. Ther. 2025 10 72 10.1038/s41392-024-02095-6 40050273 PMC11885647 23. Wang S. Liu W. Wang J. Bai X. Curculigoside inhibits ferroptosis in ulcerative colitis through the induction of GPX4 Life Sci. 2020 259 118356 10.1016/j.lfs.2020.118356 32861798 24. Moine L. Rivoira M. Díaz de Barboza G. Pérez A. Tolosa de Talamoni N. Glutathione depleting drugs, antioxidants and intestinal calcium absorption World J. Gastroenterol. 2018 24 4979 4988 10.3748/wjg.v24.i44.4979 30510373 PMC6262252 25. Yang Y. Li L. Hang Q. Fang Y. Dong X. Cao P. Yin Z. Luo L. γ-glutamylcysteine exhibits anti-inflammatory effects by increasing cellular glutathione level Redox Biol. 2019 20 157 166 10.1016/j.redox.2018.09.019 30326393 PMC6197438 26. Zarka M.H. Bridge W.J. Oral administration of γ-glutamylcysteine increases intracellular glutathione levels above homeostasis in a randomised human trial pilot study Redox Biol. 2017 11 631 636 10.1016/j.redox.2017.01.014 28131081 PMC5284489 27. Jiang D. Guo Y. Wang T. Wang L. Yan Y. Xia L. Bam R. Yang Z. Lee H. Iwawaki T. IRE1α determines ferroptosis sensitivity through regulation of glutathione synthesis Nat. Commun. 2024 15 4114 10.1038/s41467-024-48330-0 38750057 PMC11096184 28. Xu Y. Xie Y. Wu Z. Wang H. Chen Z. Wang J. Bao W. Protective effects of melatonin on deoxynivalenol-induced oxidative stress and autophagy in IPEC-J2 cells Food Chem. Toxicol. 2023 177 113803 10.1016/j.fct.2023.113803 37120089 29. Rinschen M.M. Ivanisevic J. Giera M. Siuzdak G. Identification of bioactive metabolites using activity metabolomics Nat. Rev. Mol. Cell Biol. 2019 20 353 367 10.1038/s41580-019-0108-4 30814649 PMC6613555 30. Han L. Xu S. Zhou D. Chen R. Ding Y. Zhang M. Bao M. He B. Li S. Unveiling the causal link between metabolic factors and ovarian cancer risk using Mendelian randomization analysis Front. Endocrinol. 2024 15 1401648 10.3389/fendo.2024.1401648 38899007 PMC11185996 31. Forman H.J. Zhang H. Rinna A. Glutathione: Overview of its protective roles, measurement, and biosynthesis Mol. Aspects Med. 2009 30 1 12 10.1016/j.mam.2008.08.006 18796312 PMC2696075 32. Wang R. Zhu J. Zhou J. Li J. Wang M. Wu Y. Zhao D. Chen X. Chen X. Wang Y. Bioinspired Claw-Engaged Adhesive Microparticles Armed with γGC Alleviate Ulcerative Colitis via Targeted Suppression of Macrophage Ferroptosis Adv. Sci. 2025 12 e2503903 10.1002/advs.202503903 40298904 PMC12376637 33. Anderson M.E. Meister A. Transport and direct utilization of gamma-glutamylcyst(e)ine for glutathione synthesis Proc. Natl. Acad. Sci. USA 1983 80 707 711 10.1073/pnas.80.3.707 6572362 PMC393448 34. Salama S.A. Al-Harbi M.S. Abdel-Bakky M.S. Omar H.A. Glutamyl cysteine dipeptide suppresses ferritin expression and alleviates liver injury in iron-overload rat model Biochimie 2015 115 203 211 10.1016/j.biochi.2015.06.006 26093100 35. Le T.M. Jiang H. Cunningham G.R. Magarik J.A. Barge W.S. Cato M.C. Farina M. Rocha J.B. Milatovic D. Lee E. γ-Glutamylcysteine ameliorates oxidative injury in neurons and astrocytes in vitro and increases brain glutathione in vivo Neurotoxicology 2011 32 518 525 10.1016/j.neuro.2010.11.008 21159318 PMC3079792 36. Zhu X. Wu J. Chen X. Shi D. Hui P. Wang H. Wu Z. Wu S. Bao W. Fan H. DNA ligase III mediates deoxynivalenol exposure-induced DNA damage in intestinal epithelial cells by regulating oxidative stress and interaction with PCNA Int. J. Biol. Macromol. 2024 282 137137 10.1016/j.ijbiomac.2024.137137 39505167 37. Wen B. Mei Z. Zeng C. Liu S. metaX: A flexible and comprehensive software for processing metabolomics data BMC Bioinform. 2017 18 183 10.1186/s12859-017-1579-y 28327092 PMC5361702 Figure 1 Metabolic analyses of IPEC-J2 cells upon DON exposure at the concertation of 1 µg/mL for 48 h. ( A left right B left right n C left right Figure 2 Integrated analysis of differential metabolites and differentially expressed genes of IPEC-J2 cells upon DON exposure. ( A B γ Figure 3 The protective effect of γ A γ B γ γ γ γ n C γ γ p p Figure 4 Effects of γ A B γ γ γ γ n p p Figure 5 Effect of γ A B C n D γ γ γ p p ",
  "metadata": {
    "Title of this paper": "metaX: A flexible and comprehensive software for processing metabolomics data",
    "Journal it was published in:": "Toxins",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474252/"
  }
}