{
  "title": "Paper_991",
  "abstract": "pmc Foods Foods 3129 foods foods Foods 2304-8158 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470160 PMC12470160.1 12470160 12470160 41008252 10.3390/foods14183279 foods-14-03279 1 Article Foodborne Titanium Dioxide Nanoparticles Aggravated Secondary Liver Injury in DSS-Induced Colitis: Role of the NLRP3 Inflammasome Feng Xiaoyan Methodology Data curation Writing – original draft Yuan Hongbin Conceptualization Validation You Tao Conceptualization Formal analysis https://orcid.org/0000-0003-0457-9665 Xu Hengyi Writing – review & editing Project administration Funding acquisition * López Sánchez José Ignacio Academic Editor Pérez Santín Efrén Academic Editor State Key Laboratory of Food Science and Resource, Nanchang University, Nanchang 330047, China; 357900210014@email.ncu.edu.cn 18807045301@163.com 407900210112@email.ncu.edu.cn * kidyxu@163.com hengyixu@ncu.edu.cn 22 9 2025 9 2025 14 18 497635 3279 14 8 2025 07 9 2025 19 9 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Secondary liver injury (SLI) is the most common complication in the development of inflammatory bowel disease (IBD), and it is susceptible to environmental factors, including diet patterns. As a food-brightening agent, titanium dioxide nanoparticles (TiO 2 2 2 2 2 2 2 titanium dioxide nanoparticles secondary liver injury inflammatory response NLRP3 inflammasome National Natural Science Foundation of China 82060606 This work was supported by the National Natural Science Foundation of China (Grant number: 82060606). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Inflammatory bowel disease (IBD) is characterized as chronic, recurrent, and non-specific intestinal inflammation, including ulcerative colitis (UC) and Crohn’s disease (CD) [ 1 2 3 4 5 6 7 8 9 10 11 12 Environmental changes, including diet patterns, contamination, smoking, etc., are an important contributor to the development of extraintestinal manifestations in IBD patients [ 13 14 15 16 17 Titanium dioxide (TiO 2 18 2 19 20 2 2 21 22 2 23 2 2 2 24 2 2 25 26 27 2 2 As the primary detoxification organ, the liver is a direct extraintestinal target that is affected by colitis. Therefore, the impact of TiO 2 2 2 2 2 2. Materials and Methods 2.1. Animal Experiment and Design Male wildtype (WT) C57BL/6J mice (6–8 weeks) were purchased from SiPeiFu Biotechnology Co., Ltd. (Certificate No. SCXK (Jing) 2019–0010, Beijing, China). NLRP3-deficient (NLRP3 −/− 2 All mice were randomly assigned to receive different treatments (n = 6/group). For TiO 2 2 2 2 2 2 th 2 2.2. Histopathological Analysis After all the mice were sacrificed, fresh liver tissues were fixed in paraformaldehyde overnight, paraffinized, and sectioned at a thickness of 5 μm. Subsequently, these slices were stained with hematoxylin and eosin (H&E). Images were captured using an optical microscope (Olympus Corporation, Tokyo, Japan), and inflammatory cell infiltration was observed in the liver. 2.3. Liver Function Assessment Fresh blood was collected and placed at 4 °C for 6 h and then centrifuged for 15 min to obtain serum samples. Next, serum AKP and AST activities were used to assess liver function and were measured using commercial biochemical kits according to the operating instructions (Nanjing Jiancheng Bioengineering Institute, Nanjing, China). 2.4. Liver Inflammation and Oxidative Injury Liver tissues were homogenized with normal saline to prepare the samples for subsequent analysis. Inflammatory cytokines, including TNF-α, IL-6, and IL-1β, were measured following the commercial ELISA kit’s instructions (Shanghai Yansheng Industrial Co., Ltd., Shanghai, China), and OD values at 450 nm were determined by a microplate reader (Thermo Fisher Scientific, Waltham, MA, USA). In addition, SOD activity, MDA content, and GSH content were chosen as indicators for the assessment of oxidative injury in the liver, and these were detected using commercial kits (Nanjing Jiancheng Bioengineering Institute, Nanjing, China). 2.5. Real-Time Quantitative Polymerase Chain Reaction (RT-qPCR) Analysis Fresh liver tissues were preserved at −80 °C for subsequent mRNA expression analysis. Total RNA was extracted using Trelief ® ® −ΔΔt Table 1 2.6. Statistical Analysis All graphs were plotted using GraphPad Prism 8 software (GraphPad Software Inc., USA). Statistical analyses were performed by using SPSS 27, and the intergroup differences were determined using one-way analysis of variance (ANOVA) followed by the LSD multiple comparison test. All data were represented as the mean ± standard error of mean (SEM), and a p 3. Results 3.1. TiO 2 Firstly, the effects of exposure to TiO 2 Figure 1 Figure 1 2 2 Figure 1 2 2 2 2 2 2 3.2. TiO 2 From the perspective of histopathological analysis and liver function evaluation, we found that exposure to high-dose TiO 2 Figure 2 Figure 2 2 2 2 p Figure 2 2 2 2 2 3.3. The NLRP3 Inflammasome Was Probably Involved in TiO 2 An inflammatory response that contributed to TiO 2 Figure 3 2 2 Figure 3 2 2 Figure 3 2 3.4. The Absence of NLRP3 Alleviated the Symptoms of DSS-Induced SLI with TiO 2 To provide compelling evidence, NLRP3 −/− 2 Figure 4 Figure 4 2 Figure 4 2 −/− 2 3.5. The Absence of NLRP3 Mitigated Liver Injury in SLI Mice with TiO 2 We gavaged high-dose TiO 2 −/− Figure 5 Figure 5 −/− Figure 5 2 −/− 2 4. Discussion With the acceleration of modern industrialization, IBD has become a global health concern [ 4 2 2 26 27 7 8 2 2 TiO 2 2 2 Figure 1 2 2 28 2 2 29 30 Figure 1 Figure 2 2 2 LPS is an endotoxin produced by Gram-negative bacteria, and this resides in the intestinal lumen if the intestinal barrier is intact. Once the intestinal barrier is damaged, LPS is translocated into the bloodstream, crossing the intestinal barrier. Therefore, elevated LPS levels in serum imply intestinal barrier dysfunction. As our results show, exposure to TiO 2 31 2 32 2 2 2 33 34 2 Figure 3 Figure 3 NLRP3 inflammasome, a protein complex, belongs to the innate immune system and is activated by two pathways, including the noncanonical and canonical NLRP3 signals [ 35 36 37 38 39 40 41 2 2 Figure 3 42 2 Figure 3 2 Figure 4 Figure 5 Our work focused on the adverse effect of pre-exposure to TiO 2 2 5. Conclusions In our study, pre-exposure to high-dose TiO 2 2 Disclaimer/Publisher’s Note: Author Contributions Writing—original draft preparation, X.F.; methodology, X.F.; data curation, X.F.; conceptualization, H.Y. and T.Y.; validation, H.Y.; formal analysis, T.Y.; writing—review and editing, H.X.; project administration, H.X.; funding acquisition, H.X. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All animal experiments strictly adhered to the Guidelines for Care and Use of Laboratory Animals, as well as the ARRIVE guidelines, and were conducted with ethical approval from the Institutional Animal Care Committee (IACUC) of Nanchang Royo Biotech Co., Ltd. (IACUC Number: RYE2024061104). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in the study are included in the article, further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. The Nanchang Royo Biotech Co., Ltd. is not involved in this study and declares no conflicts of interest. References 1. Boccatonda A. Balletta M. Vicari S. Hoxha A. Simioni P. Campello E. The journey through the pathogenesis and treatment of venous thromboembolism in inflammatory bowel diseases: A narrative review Semin. Thromb. Hemost. 2022 49 744 755 10.1055/s-0042-1758869 36455617 2. Liu C. Qi X. Liu X. Sun Y. Mao K. Shen G. Ma Y. Li Q. Anti-inflammatory probiotics HF05 and HF06 synergistically alleviate ulcerative colitis and secondary liver injury Food Funct. 2024 15 3765 3777 10.1039/D3FO04419J 38506656 3. Meng Z. Fu B. Yang Z. Xu Y. Huang H. Bai Y. Fang X. Shen S. Yang J. Yong J. Polydopamine-coated thalidomide nanocrystals promote DSS-induced murine colitis recovery through Macrophage M2 polarization together with the synergistic anti-inflammatory and anti-angiogenic effects Int. J. Pharm. 2023 630 122376 10.1016/j.ijpharm.2022.122376 36400133 4. Ng S. Shi H. Hamidi N. Underwood F. Tang W. Benchimol E. Panaccione R. Ghosh S. Wu J. Chan F. Worldwide incidence and prevalence of inflammatory bowel disease in the 21st century: A systematic review of population-based studies Lancet 2017 390 2769 2778 10.1016/S0140-6736(17)32448-0 29050646 5. Zhu L. Zong X. Xiao X. Cheng Y. Fu J. Lu Z. Jin M. Wang F. Wang Y. Multi-omics analysis of the gut-liver axis reveals the mechanism of liver injury in colitis mice Front. Immunol. 2022 12 773070 10.3389/fimmu.2021.773070 35069545 PMC8770869 6. Silva J. Brito B. Silva I. Nóbrega V. Silva M. Gomes H. Fortes F. Pimentel A. Mota J. Almeida N. Frequency of hepatobiliary manifestations and concomitant liver disease in inflammatory bowel disease patients BioMed. Res. Int. 2019 2019 7604939 10.1155/2019/7604939 30834274 PMC6374878 7. Trivedi P. Jena G. Ulcerative colitis-induced hepatic damage in mice: Studies on inflammation, fibrosis, oxidative DNA damage and GST-P expression Chem-Biol. Interact. 2013 201 19 30 10.1016/j.cbi.2012.12.004 23261717 8. Lama S. Pagano E. Borrelli F. Maisto M. Tenore G. Nanì M. Chacon-Millan P. Novellino E. Stiuso P. Polyphenol-rich extract from ‘Limoncella’ apple variety ameliorates dinitrobenzene sulfonic acid-induced colitis and linked liver damage Int. J. Mol. Sci. 2024 25 3210 10.3390/ijms25063210 38542183 PMC10969867 9. Mendes F. Levy C. Enders F. Loftus E. Jr. Angulo P. Lindor K. Abnormal hepatic biochemistries in patients with inflammatory bowel disease Off. J. Am. Coll. Gastroenterol. 2007 102 344 350 10.1111/j.1572-0241.2006.00947.x 17100965 10. Li E. Wang T. Zhou R. Zhou Z. Zhang C. Wu W. He K. Myricetin and myricetrin alleviate liver and colon damage in a chronic colitis mice model: Effects on tight junction and intestinal microbiota J. Funct. Foods. 2021 87 104790 10.1016/j.jff.2021.104790 11. Chen Y. Zhu S. Chen Z. Liu Y. Pei C. Huang H. Hou S. Ning W. Liang J. Gingerenone A alleviates ferroptosis in secondary liver injury in colitis mice via activating Nrf2–Gpx4 signaling pathway J. Agric. Food Chem. 2022 70 12525 12534 10.1021/acs.jafc.2c05262 36135333 12. Chen Y. Lu Y. Pei C. Liang J. Ding P. Chen S. Hou S. Monotropein alleviates secondary liver injury in chronic colitis by regulating TLR4/NF-κB signaling and NLRP3 inflammasome Eur. J. Pharmacol. 2020 883 173358 10.1016/j.ejphar.2020.173358 32710952 13. Sandys O. te Velde A. Raising the alarm: Environmental factors in the onset and maintenance of chronic (low-grade) inflammation in the gastrointestinal tract Digest. Dis. Sci. 2022 67 4355 4368 10.1007/s10620-021-07327-1 34981314 14. Zheng H. Wang J. Wei X. Chang L. Liu S. Proinflammatory properties and lipid disturbance of polystyrene microplastics in the livers of mice with acute colitis Sci. Total Environ. 2021 750 143085 10.1016/j.scitotenv.2020.143085 33182181 15. Wang C. Pan Z. Jin Y. F-53B induces hepatotoxic effects and slows self-healing in ulcerative colitis in mice Environ. Pollut. 2023 317 120819 10.1016/j.envpol.2022.120819 36481465 16. Luo T. Wang D. Zhao Y. Li X. Yang G. Jin Y. Polystyrene microplastics exacerbate experimental colitis in mice tightly associated with the occurrence of hepatic inflammation Sci. Total. Environ. 2022 844 156884 10.1016/j.scitotenv.2022.156884 35752249 17. Yang H. Sanidad K. Wang W. Xie M. Gu M. Cao X. Xiao H. Zhang G. Triclocarban exposure exaggerates colitis and colon tumorigenesis: Roles of gut microbiota involved Gut Microbes 2019 12 1690364 10.1080/19490976.2019.1690364 31760871 PMC7524142 18. Candás-Zapico S. Kutscher D. Montes-Bayón M. Bettmer J. Single particle analysis of TiO 2 Talanta 2018 180 309 315 10.1016/j.talanta.2017.12.041 29332815 19. Peters R. van Bemmel G. Herrera-Rivera Z. Helsper H. Marvin H. Weigel S. Tromp P. Oomen A. Rietveld A. Bouwmeester H. Characterization of titanium dioxide nanoparticles in food products: Analytical methods to define nanoparticles J. Agric. Food Chem. 2014 62 6285 6293 10.1021/jf5011885 24933406 20. Cui Y. Gong X. Duan Y. Li N. Hu R. Liu H. Hong M. Zhou M. Wang L. Wang H. Hepatocyte apoptosis and its molecular mechanisms in mice caused by titanium dioxide nanoparticles J. Hazard. Mater. 2010 183 874 880 10.1016/j.jhazmat.2010.07.109 20724067 21. Weir A. Westerhoff P. Fabricius L. Hristovski K. von Goetz N. Titanium dioxide nanoparticles in food and personal care products Environ. Sci. Technol. 2012 46 2242 2250 10.1021/es204168d 22260395 PMC3288463 22. Baranowska-Wójcik E. Szwajgier D. Winiarska-Mieczan A. A review of research on the impact of E171/TiO 2 J. Trace Elem. Med. Biol. 2022 72 126988 10.1016/j.jtemb.2022.126988 35561571 23. Zhao Y. Liu S. Tang Y. You T. Xu H. Lactobacillus rhamnosus 2 J. Agric. Food Chem. 2021 69 9788 9799 10.1021/acs.jafc.1c03301 34382390 24. Lomer M. Hutchinson C. Volkert S. Greenfield S. Catterall A. Thompson R. Powell J. Dietary sources of inorganic microparticles and their intake in healthy subjects and patients with Crohn’s disease Br. J. Nutr. 2004 92 947 955 10.1079/BJN20041276 15613257 25. Ruiz P. Moron B. Becker H. Lang S. Atrott K. Spalinger M. Scharl M. Wojtal K. Fischbeck-Terhalle A. Frey-Wagner I. Titanium dioxide nanoparticles exacerbate DSS-induced colitis: Role of the NLRP3 inflammasome Gut 2017 66 1216 1224 10.1136/gutjnl-2015-310297 26848183 PMC5530483 26. Duan S. Wang H. Gao Y. Wang X. Lyu L. Wang Y. Oral intake of titanium dioxide nanoparticles affect the course and prognosis of ulcerative colitis in mice: Involvement of the ROS-TXNIP-NLRP3 inflammasome pathway Part. Fibre Toxicol. 2023 20 24 10.1186/s12989-023-00535-9 37349846 PMC10288682 27. Urrutia-Ortega I. Garduño-Balderas L. Delgado-Buenrostro N. Freyre-Fonseca V. Flores-Flores J. González-Robles A. Pedraza-Chaverri J. Hernández-Pando R. Rodríguez-Sosa M. León-Cabrera S. Food-grade titanium dioxide exposure exacerbates tumor formation in colitis associated cancer model Food Chem. Toxicol. 2016 93 20 31 10.1016/j.fct.2016.04.014 27117919 28. Chen Z. Zhou D. Han S. Zhou S. Jia G. Hepatotoxicity and the role of the gut-liver axis in rats after oral administration of titanium dioxide nanoparticles Part. Fibre Toxicol. 2019 16 48 10.1186/s12989-019-0332-2 31881974 PMC6935065 29. Duan S. Du X. Chen S. Liang J. Huang S. Hou S. Gao J. Ding P. Effect of vitexin on alleviating liver inflammation in a dextran sulfate sodium (DSS)-induced colitis model Biomed. Pharmacother. 2020 121 109683 10.1016/j.biopha.2019.109683 31810123 30. Wang Q. Liu Y. Gao L. Zhang L. Wang J. Study on the protective effect and mechanism of umbilicaria esculenta polysaccharide in DSS-induced mice colitis and secondary liver injury J. Agric. Food Chem. 2024 72 10923 10935 10.1021/acs.jafc.4c00290 38691832 31. Zhu X. Zhao L. Liu Z. Zhou Q. Zhu Y. Zhao Y. Yang X. Long-term exposure to titanium dioxide nanoparticles promotes diet-induced obesity through exacerbating intestinal mucus layer damage and microbiota dysbiosis Nano Res. 2020 14 1512 1522 10.1007/s12274-020-3210-1 32. Yan J. Wang D. Li K. Chen Q. Lai W. Tian L. Lin B. Tan Y. Liu X. Xi Z. Toxic effects of the food additives titanium dioxide and silica on the murine intestinal tract: Mechanisms related to intestinal barrier dysfunction involved by gut microbiota Environ. Toxicol. Phar. 2020 80 103485 10.1016/j.etap.2020.103485 32891757 33. Zhang C. He A. Liu S. He Q. Luo Y. He Z. Chen Y. Tao A. Yan J. Inhibition of HtrA2 alleviated dextran sulfate sodium (DSS)-induced colitis by preventing necroptosis of intestinal epithelial cells Cell Death. Dis. 2019 10 344 10.1038/s41419-019-1580-7 31019191 PMC6482197 34. Jiang N. Wei Y. Cen Y. Shan L. Zhang Z. Yu P. Wang Y. Xu L. Andrographolide derivative AL-1 reduces intestinal permeability in dextran sulfate sodium (DSS)-induced mice colitis model Life Sci. 2020 241 117164 10.1016/j.lfs.2019.117164 31838135 35. Faria S. Costantini S. de Lima V. de Andrade V. Rialland M. Cedric R. Budillon A. Magalhães K. NLRP3 inflammasome-mediated cytokine production and pyroptosis cell death in breast cancer J. Biomed. Sci. 2021 28 26 10.1186/s12929-021-00724-8 33840390 PMC8040227 36. Moretti J. Jia B. Hutchins Z. Roy S. Yip H. Wu J. Shan M. Jaffrey S. Coers J. Blander J. Caspase-11 interaction with NLRP3 potentiates the noncanonical activation of the NLRP3 inflammasome Nat. Immunol. 2022 23 705 717 10.1038/s41590-022-01192-4 35487985 PMC9106893 37. Matikainen S. Nyman T. Cypryk W. Function and regulation of noncanonical caspase-4/5/11 inflammasome J. Immunol. 2020 204 3063 3069 10.4049/jimmunol.2000373 32513874 38. Huang Y. Xu W. Zhou R. NLRP3 inflammasome activation and cell death Cell Mol. Immunol. 2021 18 2114 2127 10.1038/s41423-021-00740-6 34321623 PMC8429580 39. Tschopp J. Schroder K. NLRP3 inflammasome activation: The convergence of multiple signalling pathways on ROS production? Nat. Rev. Immunol. 2010 10 210 215 10.1038/nri2725 20168318 40. Zhou J. Chng W. Roles of thioredoxin binding protein (TXNIP) in oxidative stress, apoptosis and cancer Mitochondrion 2013 13 163 169 10.1016/j.mito.2012.06.004 22750447 41. Li Z. Chi H. Zhu W. Yang G. Song J. Mo L. Zhang Y. Deng Y. Xu F. Yang J. Cadmium induces renal inflammation by activating the NLRP3 inflammasome through ROS/MAPK/NF-κB pathway in vitro and in vivo Arch. Toxicol. 2021 95 3497 3513 10.1007/s00204-021-03157-2 34510229 42. Lupfer C. Anand P. Liu Z. Stokes K. Vogel P. Lamkanfi M. Kanneganti T. Reactive oxygen species regulate caspase-11 expression and activation of the non-canonical NLRP3 inflammasome during enteric pathogen infection PLoS Pathog. 2014 10 e1004410 10.1371/journal.ppat.1004410 25254654 PMC4178001 Figure 1 Titanium dioxide nanoparticles (TiO 2 a b c d p p p Figure 2 Comprehensive evaluation of hepatic inflammation and oxidative injury after TiO 2 a b c d e p p p p p p Figure 3 The NOD-like receptor family pyrin-containing 3 (NLRP3) inflammasome may be involved in TiO 2 a b c d e k p p p p p p Figure 4 NLRP3 deficiency improved liver function in TiO 2 a b c d p p Figure 5 TiO 2 a b c d e f g l p p p foods-14-03279-t001_Table 1 Table 1 The primer sequences of RT-qPCR analysis. Gene Primer Sequence (5′-3′) NLRP3 Forward ATTACCCGCCCGAGAAAGG Reverse CATGAGTGTGGCTAGATCCAAG Caspase 11 Forward GTGGTGAAAGAGGAGCTTACAGC Reverse GCACCAGGAATGTGCTGTCTGA Caspase 1 Forward GGCACATTTCCAGGACTGACTG Reverse GCAAGACGTGTACGAGTGGTTG IL-18 Forward GACAGCCTGTGTTCGAGGATATG Reverse TGTTCTTACAGGAGAGGGTAGAC pro-IL-18 Forward GACTCTTGCGTCAACTTCAAGG Reverse CAGGCTGTCTTTTGTCAACGA GSDMD Forward TGTCAACCTGTCAATCAAGGA Reverse AGCCAAAACACTCCGGTTC pro-IL-1β Forward GCAACTGTTCCTGAACTCAACT Reverse ATCTTTTGGGGTCCGTCAACT β-actin Forward AAGGCCAACCGTGAAAAGAT Reverse GTGGTACGACCAGAGGCATAC ",
  "metadata": {
    "Title of this paper": "Reactive oxygen species regulate caspase-11 expression and activation of the non-canonical NLRP3 inflammasome during enteric pathogen infection",
    "Journal it was published in:": "Foods",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470160/"
  }
}