{
  "title": "Paper_1184",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467217 PMC12467217.1 12467217 12467217 41008623 10.3390/biom15091316 biomolecules-15-01316 1 Review The Role of Reactive Oxygen Species in Lung Cancer Development: Nanomedicine as a Therapeutic Strategy Olazábal-Morán Manuel 1 * Pérez Elena 1 https://orcid.org/0000-0003-4953-8066 Esteban-Arranz Adrián 2 https://orcid.org/0000-0003-3026-3330 Garrido Antonio 1 * Yan Liang-Jun Academic Editor D’Orazi Gabriella Academic Editor 1 elena.perez2@universidadeuropea.es 2 adrian.esteban@universidadeuropea.es * manuel.olazabal@universidadeuropea.es antonio.garrido@universidadeuropea.es 13 9 2025 9 2025 15 9 497615 1316 13 3 2025 23 4 2025 11 9 2025 13 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Lung cancer remains a leading cause of mortality worldwide, driven by increased tobacco use, industrialization, and air pollution. Despite advancements in diagnostics and treatments, effective therapies are still lacking. Reactive oxygen species (ROS) play a dual role in cancer development, regulating key signaling pathways and activating cell death pathways, making them a promising target for new drugs. Research shows that wild-type NRF2/KEAP1 lung tumors, which account for about 60% of lung malignancies, are sensitive to ROS induction, and mutated EGFR1 nano PROTACs ROS lung cancer NRF2 targeted therapy nanomedicine This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer stands as a devastating illness and ranks among the primary causes of mortality globally. Lung cancer, in particular, accounts for the highest number of hospitalized patients and exhibits poor prognosis indicators along with extremely low survival rates, which consistently stem from these figures [ 1 2 3 4 Lung cancer (LC) encompasses a diverse group of diseases, varying in both histological and molecular characteristics [ 5 5 6 6 7 Significant scientific endeavors have focused on creating novel therapeutic approaches for LC, particularly LUAD and SCLC [ 8 9 5 10 11 12 13 14 NFE2L2 NFE2L2 KEAP1 15 16 NFE2L2/KEAP1 NFE2L2/KEAP1 NFE2L2/KEAP1 17 18 19 In recent decades, the development of proteolysis-targeting chimera (PROTAC) has provided a novel and alternative strategy that successfully overcomes the most important health problems of small molecule inhibitors (SMI). These later, although arose as one of the most effective strategies for cancer treatment, present several limitations. Among these, undruggability towards proteins lacking active sites or bearing unexposed active sites, off-target effects due to high drug concentration, target protein feedback accumulation and drug resistance as result of protein mutations [ 20 21 22 23 24 25 26 Considering all aspects mentioned above, we hypothesized that a nano-PROTAC capable of inducing an acute ROS induction specifically in the lung cancer tissue might be a potential strategy for these patients with wild type NRF2/KEAP1 signature. Therefore, the main goal of this review is to summarize the most important findings related to the generation of nano-PROTACs, focusing on those related to the induction of ROS. Considering these findings, we will design a ROS-inductor nano-PROTAC system as a novel targeted therapy for wild type NRF2/KEAP1 lung tumors. Also, the relevance of this signaling pathway and its relationship with others, which are related to the initiation and progression of this tumor type, will be revisited. 2. The Role of ROS in Cancer: Focus on Lung Malignancies Reactive oxygen species (ROS) are highly reactive molecules which are byproducts from the metabolism of molecular oxygen (O 2 27 28 29 30 2.1. The Origin of ROS in the Cell There is a plethora of ROS that are important in cell physiology. They can be classified as the reactivity that they present in (1) non-radical molecules like hydrogen peroxide (H 2 2 2 − − 2 − 31 2 − 2 2 32 2 2 33 Mitochondria is the primary source of cellular ROS, cellular place where electron chain transport (ECT) occurs. ECT, localized in the inner membrane of the mitochondria, consists of a series of proteins complexes that transport electrons from reduced electron donors to the O 2 + 2 2 − 2 2 34 35 36 37 2 2 38 39 40 41 2 2 2 − 42 43 Interestingly, ROS can also be exogenously produced by lifestyle factors, such as alcohol consumption, heavy metals ingestion, radiation, tobacco smoking and air contaminants exposition [ 44 45 2 − − 46 2.2. Pivotal Role of ROS in Lung Cancer ROS are important players in the development of malignancies. Growing evidence suggests that ROS play a pivotal role in cancer, as they can both promote and protect from tumorigenesis. On the one hand, cancer cells are characterized by carrying more ROS than normal cells [ 47 48 Figure 1  Figure 1 The pivotal role of ROS in tumorigenesis. In cancer, ROS regulate diverse signaling pathways like MAPK, PI3K/Akt, and NF-κB, promoting cell proliferation, survival, and metastasis. However, high ROS levels can cause the establishment of oxidative stress, leading to protein, lipid and DNA damage, cell cycle arrest, and apoptosis, potentially suppressing tumorigenesis. Thus, ROS act as both promoters and protectors from cancer, depending on their concentration and cellular context. 2.2.1. Role of NRF2 in Lung Cancer Among the different molecular regulators of redox balance, NRF2 (Nuclear factor-erythroid-derived 2-related factor 2)-KEAP1 (Kelch-like ECH-associated protein 1) pathway is one of the most important cellular signaling mechanisms that governs the antioxidant response and cellular defense against oxidative stress [ 7 49 50 51 52 53 54 55 NRF2-KEAP1 pathway is usually altered in NSCLC tumors due to gain-of-function mutations of NFE2L2 KEAP1 56 NFE2L2 KEAP1 57 58 59 Nrf2 60 Keap1 Keap1 −/− 61 Considering all this evidence supporting the role of NRF2/KEAP1 signaling pathway in lung cancer development, this opens NRF2 as a new therapeutic target to develop antineoplastic treatments for lung malignancies. 2.2.2. Role of ROS in Promoting Lung Cancer ROS are essential chemical cues that regulate cell signaling mainly by oxidation of cysteine and tyrosine residues in several proteins, modifying their conformation and protein–protein interactions [ 62 63 Figure 2  Figure 2 Signaling pathways involved in ROS promoting lung cancer. Reactive oxygen species (ROS) modulate key signaling pathways in lung cancer, including NF-κB, MAPK, PI3K/AKT, p53, and TGF-β. Each pathway shows context-dependent responses to oxidative stress, with ROS acting as both promoters and inhibitors of signal transduction. These interactions highlight the central role of ROS in tumor initiation, progression, and as potential therapeutic targets in lung cancer. The nuclear factor-κB (NF-κB) signaling pathway consists of a panel of transcription factors (NF-κB) that were originally described as the essential modulators of the inflammatory response. However, this pathway is also important in cell proliferation, angiogenesis and metastasis [ 64 65 66 67 68 69 60 70 71 The Mitogen-activated-protein-kinase (MAPK) signaling is one of the essential nodes of regulation of cell division, cell survival, apoptosis, cell differentiation and proliferation [ 72 73 G12C 74 75 76 77 The phosphatidylinositol 3-kinase (PI3K/AKT) pathway is a critical signaling cascade involved in cell growth, survival, metabolism, and migration. It begins with the activation of cell surface receptors, mainly receptor tyrosine kinases (RTKs), which activate the lipid-kinase activity of PI3K to produce PIP3 (Phosphatidylinositol (3,4,5) trisphosphate) in the plasma membrane, an important second messenger that activates downstream proteins like AKT [ 78 79 PIK3CA 80 81 82 83 3 3 84 2 2 85 p53 is a vital tumor suppressor protein that monitors various types of cellular damage, including DNA mutations, oxidative stress, hypoxia, and telomere shortening. Upon sensing such damage, p53 stabilizes and acts as a transcription factor that induces cell cycle arrest to repair the damage or apoptosis if the damage is irreversible [ 86 87 TP53 KRAS 88 89 90 91 92 93 94 95 96 97 Transforming growth factor (TGF)-β is a ligand that induces the activation of the SMAD transcription factors. These transcription factors regulate the expression of genes involved in differentiation, cell proliferation, survival, migration, and invasion [ 98 99 100 101 102 103 2.2.3. Role of ROS in Protecting from Lung Cancer As it has been previously indicated, ROS can directly damage different cellular structures and biomolecules, inducing cell death. The cell death pathways affected by ROS are extremely complex and depend on the cell origin and the microenvironmental context. The next paragraphs briefly summarize the main oxidative stress mediated cell death mechanisms. ROS have the ability to induce apoptosis, a programmed cell death orchestrated by the sequential action of a family of cysteine-dependent aspartate proteases called caspases. After caspase effector activation, cells are destroyed and form apoptotic bodies that are engulfed by adjacent macrophages. There are two main apoptosis programs, the extrinsic and the intrinsic pathway. The extrinsic pathway is initiated by the binding of extracellular ligands (TNFα, FasL…) to the cognate receptors, which activate several caspases that regulate the assembly of death-inducing signaling complex (DISC), necessary to activate the effector caspases [ 104 105 104 106 Ferroptosis is an iron-dependent form of cell death characterized by the accumulation of ROS and lipid peroxidation. It involves mitochondrial shrinkage, membrane rupture, and depletion of glutathione, with disrupted antioxidant systems. The main morphological difference with apoptosis is that the nucleus and the chromatin condensations are not altered in ferroptosis [ 107 108 109 Another type of programmed cell-death related to ROS is autophagy, where cells break down and recycle damaged components. It has been established that ROS induce autophagy in cancer cells, and it can be potentially used as therapy. This induction occurs because ROS inhibit mammalian target of rapamycin 1 (mTORC1), the main negative regulator of autophagy, by inactivating autophagy-related gene-4 (ATG4) and AMP-activated protein kinase (AMPK) [ 110 111 112 Necrosis has been usually defined as the main pathological type of cell death, but several studies suggest that it can be regulated by a diverse panel of proteins forming another programmed cell death knows as necroptosis [ 113 114 Considering all these findings, ROS play a pivotal role in lung cancer, promoting tumor growth by activating oncogenes, inducing genomic instability and promoting metastasis, while also triggering cell death through apoptosis, ferroptosis, necrosis and autophagy. These opposite effects complicate cancer progression but also open up therapeutic opportunities, where targeting ROS-induced cell death could be a promising strategy to treat lung cancer and overcome resistance to conventional therapies. 3. Targeted Therapy for Lung Cancer 3.1. The Origin of Targeted Therapy: Introduction to Small Molecule Inhibitors Cancer therapy has relied on chemotherapy for a very long period, consisting of this approach in the use of a broad-spectrum of non-specific cytotoxic drugs characterized for having toxicity and adverse secondary effects. Thanks to the better comprehension of cancer biology that we have today, a shift has occurred into the development of new targeted cancer therapies [ 115 116 117 118 119 120 Even though targeted therapy has been key in the development of efficient antitumoral therapies, there are two disadvantages that need to be faced. The first one is that after clinical use of SMIs tumoral cells acquire drug resistance by different molecular mechanisms [ 121 122 123 124 125 126 127 There are several approaches to develop new targeted therapies facing these main problems of SMI. Among them, one that is causing great expectation due to its potentiality, the use of Protein Degrader systems which would prevent drug resistance and undrugability. These systems consist of using molecules that target a specific protein to be degraded by the intracellular protein-degradation machinery, being PROTAC the spotlight of this technology. 3.2. The Revolution of Targeted Therapy: PROTAC Technology Targeted protein degradation consists of modulating the ubiquitin-dependent proteolysis that occurs physiologically in the cell. This proteolysis mechanism is mediated by tagging damaged or non-required proteins with ubiquitin to send them to be degraded in the proteasome [ 128 129 130 131 The first PROTAC was designed in 2001 by Deshaies and Crews [ 132 Figure 3 133 Table 1 134  Figure 3 PROTAC structure. PROTAC molecules are bifunctional compounds that induce targeted degradation of specific proteins. They consist of two ligands: one binds to the protein of interest (POI), while the other recruits an E3 ubiquitin ligase. This interaction promotes ubiquitination and proteasomal degradation of the target protein. Once the POI is degraded, PROTAC is recycled and can interact again with the POI.  biomolecules-15-01316-t001_Table 1 Table 1 E3 ligases under research for PROTAC technology. E3 Ligase Protein of Interest (POI) Reference  KEAP1  FAK Tau BRD4 CDK9 [ 135 136 137 138 DCAF1 BRD4 [ 139  DCAF11  FKBP12 AR [ 140 DCAF15 BRD4 [ 141 142  DCAF16  PARP2 FKBP12 [ 143 144 LM3BTL3 BRD2 [ 145 146  KLH20  BRD2 BRD3 [ 147 AhR BRD2 [ 148  FEM1B  BCR-ABL BRD4 [ 149 RNF4 BRD4 [ 149  RNF114  BCR-ABL BRD4 [ 150 Adapted table from Zhong et al., 2024 [ 151 KEAP1 FAK BRD CDK9 DCAF KBP AR PARP2 L3MBTL3 KLHL 20 AhR FEM1B RNF Nowadays, there are many ongoing clinical trials addressing the efficacy of targeted protein degradation to treat different human diseases, including cancer [ 151 152 153 154 155 156 157 158 159 160 161 162 While PROTACs represent a significant step forward in drug development by facilitating targeted protein degradation, they encounter several hurdles in clinical applications. Their distinct molecular structure often results in poor water solubility and limited ability to penetrate tissues [ 163 164 165 3.3. Nanomedicine Avenues: Transforming Cancer Drug Delivery Nanotechnology has become pivotal in the clinical application of PROTACs due to its unique physicochemical properties. The nanomedicine approach for drug delivery such as liposomes, nanoparticles and nanogels offer a diverse plethora of methods to load antineoplastic drugs [ 166 167 168 169 24 170 170 170 170 Nowadays, over 30 nanosystem types have entered clinical trials, highlighting their potential in modern medicine [ 171 Lipid-based NPs have emerged as a promising platform for delivering PROTACs, due to their excellent biocompatibility and flexibility. Lipid-based NPs are spherical vesicles composed of phospholipids monolayers or bilayers that cover an aqueous inner compartment, so it can deliver both hydrophilic and hydrophobic drugs [ 172 173 174 175 Inorganic NPs, such as gold and mesoporous silica NPs, are promising candidates for PROTAC drug delivery. Some of the advantages of this type of NPs are that they are easy to prepare, and they are rigid, which is useful to avoid leakage of the treatment during delivery. On the one hand, gold NPs have shown great potential to deliver PROTACs, increasing their half-life and penetration in the target cells [ 176 177 Polymeric NPs are made from natural or synthetic polymers with great biocompatibility properties. Nanohydrogels are cross-linked polymers with great capacity to hold water, and they are emerging as useful delivery systems due to their unique characteristics that make them biodegradable, biocompatible and stable [ 178 179 180 181 182 Recent advances have demonstrated the therapeutic potential of PROTACs in preclinical lung cancer models. ALK degraders such as dEALK1 and the linker-free Pro-BA achieved potent and selective antitumor activity in NSCLC xenografts, even overcoming resistance to kinase inhibitors [ 183 184 185 186 187 188 189 190 In recent decades, immunotherapy has made significant strides in cancer treatment, offering substantial benefits to certain cancer patients. Specifically, in the realm of lung cancer, immune checkpoint inhibitors have demonstrated considerable efficacy in treating NSCLC by blocking inhibitory pathways that suppress the immune response against cancer, thereby restoring and maintaining anti-tumor immunity. Clinically, PD-L1 and PD-1 blocking agents are widely employed, either alone or in combination with chemotherapy [ 191 192 3.4. ROS Inductor Nano PROTAC as a Potential Therapy for Lung Cancer As tumors progress, the microenvironment becomes pro-oxidative. Therefore, tumoral cells require activating alterations, which promote oxidative response programs activation to survive, seeming to be crucial in the multi-step process of tumorigenesis, specifically in the acquisition of malignant and metastatic phenotypes. The effectiveness of actual targeted therapies against metastatic cancers has been disappointing, so it is essential to design useful treatments against malignant tumors, as they are the principal cause of mortality in patients with cancer. Driver mutations in EGFR EGFR The success of the strategy based on nanosystems for PROTAC delivery mainly depends on its optimal design and the ability to overcome the challenges faced by current lung cancer therapy: reduced therapeutic efficacy, multidrug resistance and secondary effects [ 193 194 There is a wide variety of nanosystems (liposomes, exosomes, dendrimers, lipid and/or metallic nanoparticles, among others) that have demonstrated optimal therapeutic success in various types of lung cancer by delivering drugs of a chemical nature [ 185 Considering the approximate size of PROTACs (10 nm according to [ 195 21 Nanohydrogels based on polymers sensitive to external stimuli (pH, temperature, intra- and extracellular redox levels) such as those synthesized from N-isopropylacrylamide (NIPA), N-Hydroxyethyl acrylamide (HEAA) and N,N’-Cystaminebisacrylamide [ 196 Considering all the previous evidence of the ROS effect in tumors and the last advances in nanotechnology, we would like to propose a potential therapy for drug-EGFR resistant lung tumors with wild-type (WT) NRF2 Figure 4 197 17  Figure 4 ROS inductor nano-PROTAC delivered by freeze-dried nanohydrogels for lung cancer patients. The proposed therapy is useful for EGFR drug-resistant lung tumors with wild-type NRF2 using nano-PROTAC delivered by EGFR-targeting nanohydrogels. This strategy aims to degrade NRF2, sensitizing tumors to ROS-induced cell death and promoting tumor regression. While nano-PROTACs offer numerous benefits, their delivery systems require optimization to address the limitations observed in clinical applications. Key challenges in this research area include the absence of dependable methods for analyzing the structure of nano-PROTAC assemblies, instability in the polymer-to-drug ratio, potential particle aggregation in vivo, issues with long-term storage stability, and high production costs, among others [ 170 198 198 170 As was mentioned before, PROTACs have exhibited low water solubility, poor cellular permeability, off-target toxicity, and hook effects, which together limit their effectiveness and clinical use. Additionally, the main administration routes of PROTACs, parenteral and oral administration, show fast renal clearance, requiring frequent dosing and potentially complicating their pharmacokinetic profiles, leading to reduced bioavailability. To overcome the challenges associated with both parenteral and oral administration of PROTACs, it is crucial to explore alternative routes, such as inhalation therapy. PROTACs need to reach the cytosol of target cells to interact with their POI and trigger proteasomal degradation. Nano-system-based drug delivery systems offer a promising solution to these inherent issues by enhancing the physicochemical properties of PROTACs. These nano-systems can be engineered to release PROTACs in a controlled way, ensuring sustained delivery and continuous degradation of target proteins over time. However, current in vivo preclinical studies of PROTAC-loaded nano-system formulations are still not enough to confirm the efficacy by these formulations and further evaluation in animal models is necessary to fully characterize the drug delivery profile of all types of existing nano-systems [ 198 199 200 To address these challenges, the clinical translation of nano-systems requires specific protocols, stringent criteria for the characterization of materials and biological mechanisms, and the development of new technology platforms. Additionally, better clinical in vitro models that replicate real conditions and standardized statistical analyses are essential to obtain marketing authorization for innovative technologies designed to meet global healthcare and treatment needs. 4. Concluding Remarks Lung cancer remains a leading cause of mortality worldwide, characterized by poor prognosis and low survival rates. This trend is largely driven by increased tobacco use, industrialization, and air pollution. Given these statistics, there is an urgent need for effective therapeutic strategies. Despite advancements in diagnostics and treatments, lung cancer still lacks highly effective treatments. Exploring reactive oxygen species (ROS), which play a dual role in cancer development by both promoting and inhibiting tumorigenesis, offers a promising framework for developing new drugs to target lung cancer cells. ROS regulate key signaling pathways such as MAPK, PI3K/Akt, and NF-κB, which are crucial in cancer initiation, progression, and metastasis. These oxidant species can also activate cell death pathways, presenting a unique opportunity for targeted therapies. Research indicates that wild-type NRF2/KEAP1 lung tumors, which account for approximately 60% of lung malignancies, are sensitive to ROS induction. Additionally, mutated EGFR1 lung tumors tend to exhibit high ROS levels. These findings highlight the critical role of ROS in developing targeted lung cancer therapies. In recent decades, proteolysis-targeting chimeras (PROTACs) have emerged as a promising alternative to small molecule inhibitors (SMIs) for cancer treatment, addressing limitations such as undruggability, off-target effects, and drug resistance. Despite their potential, PROTACs face challenges like limited cell penetration and potential toxic side effects. Nanotechnology has introduced “nano-PROTACs,” which enhance tissue accumulation, membrane permeability, and controlled release. Based on the evidence of ROS effects in tumors and advancements in nanotechnology, here a potential targeted therapy is proposed for drug-EGFR resistant lung tumors with wild-type NRF2 genotype. This therapy involves delivering nano-PROTAC using freeze-dried nanohydrogels, which are optimized with EGFR ligands for targeted delivery to tumors with EGFR overexpression. The PROTAC molecule would include an NRF2-binding element and a CRBN ligand, effective in NRF2 degradation. Inhibiting NRF2 in tumors without pathway alterations has shown success in inducing ROS cell death. Therefore, degrading NRF2 would leave tumor cells vulnerable to oxidative stress, leading to cell death and tumor regression. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.G.; investigation, M.O.-M., E.P. and A.G.; resources, M.O.-M., E.P. and A.E.-A.; writing—original draft preparation, M.O.-M., E.P. and A.G.; writing—review and editing, A.E.-A. and A.G.; supervision, A.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bray F. Ferlay J. Soerjomataram I. Siegel R.L. Torre L.A. Jemal A. Global Cancer Statistics 2018: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2018 68 394 424 10.3322/caac.21492 30207593 2. Cardona A.F. Ricaurte L. Zatarain-Barrón Z.L. Arrieta O. Squamous Cell Lung Cancer: Genomic Evolution and Personalized Therapy Salud Publica Mex. 2019 61 329 338 10.21149/10115 31276347 3. Howlader N. Forjaz G. Mooradian M.J. Meza R. Kong C.Y. Cronin K.A. Mariotto A.B. Lowy D.R. Feuer E.J. The Effect of Advances in Lung-Cancer Treatment on Population Mortality N. Engl. J. Med. 2020 383 640 649 10.1056/NEJMoa1916623 32786189 PMC8577315 4. Barta J.A. Powell C.A. Wisnivesky J.P. Global Epidemiology of Lung Cancer Ann. Glob. Health 2019 85 8 10.5334/aogh.2419 30741509 PMC6724220 5. Inamura K. Lung Cancer: Understanding Its Molecular Pathology and the 2015 WHO Classification Front. Oncol. 2017 7 193 10.3389/fonc.2017.00193 28894699 PMC5581350 6. Oser M.G. Niederst M.J. Sequist L.V. Engelman J.A. Transformation from Non-Small-Cell Lung Cancer to Small-Cell Lung Cancer: Molecular Drivers and Cells of Origin Lancet Oncol. 2015 16 e165 e172 10.1016/S1470-2045(14)71180-5 25846096 PMC4470698 7. Sánchez-Ortega M. Carrera A.C. Garrido A. Role of NRF2 in Lung Cancer Cells 2021 10 1879 10.3390/cells10081879 34440648 PMC8394503 8. Zeng Z. Wang Z.Y. Li Y.K. Ye D.M. Zeng J. Hu J.L. Chen P.F. Xiao J. Zou J. Li Z. Nuclear Factor Erythroid 2 (NF-E2)-Related Factor 2 (Nrf2) in Non-Small Cell Lung Cancer Life Sci. 2020 254 117325 10.1016/j.lfs.2020.117325 31954159 9. Taniguchi H. Sen T. Rudin C.M. Targeted Therapies and Biomarkers in Small Cell Lung Cancer Front. Oncol. 2020 10 741 10.3389/fonc.2020.00741 32509576 PMC7251180 10. Noronha V. Pinninti R. Patil V.M. Joshi A. Prabhash K. Lung Cancer in the Indian Subcontinent South Asian J. Cancer 2016 5 95 10.4103/2278-330X.187571 27606290 PMC4991146 11. Dakal T.C. Dhakar R. Beura A. Moar K. Maurya P.K. Sharma N.K. Ranga V. Kumar A. Emerging Methods and Techniques for Cancer Biomarker Discovery Pathol. Res. Pract. 2024 262 155567 10.1016/j.prp.2024.155567 39232287 12. Zhou Z. Li M. Targeted Therapies for Cancer BMC Med. 2022 20 90 10.1186/s12916-022-02287-3 35272686 PMC8915534 13. Lin P.C. Tsai Y.S. Yeh Y.M. Shen M.R. Cutting-Edge AI Technologies Meet Precision Medicine to Improve Cancer Care Biomolecules 2022 12 1133 10.3390/biom12081133 36009026 PMC9405970 14. Mery B. Vallard A. Rowinski E. Magne N. High-Throughput Sequencing in Clinical Oncology: From Past to Present Swiss Med. Wkly. 2019 149 w20057 10.4414/smw.2019.20057 30946479 15. Hammerman P.S. Voet D. Lawrence M.S. Voet D. Jing R. Cibulskis K. Sivachenko A. Stojanov P. McKenna A. Lander E.S. Comprehensive Genomic Characterization of Squamous Cell Lung Cancers Nature 2012 489 519 525 10.1038/nature11404 22960745 PMC3466113 16. Campbell J.D. Alexandrov A. Kim J. Wala J. Berger A.H. Pedamallu C.S. Shukla S.A. Guo G. Brooks A.N. Murray B.A. Distinct Patterns of Somatic Genome Alterations in Lung Adenocarcinomas and Squamous Cell Carcinomas Nat. Genet. 2016 48 607 616 10.1038/ng.3564 27158780 PMC4884143 17. Sánchez-Ortega M. Garrido A. Cirauqui C. Sanz-Gonzalez L. Hernández M.C. González-García A. Obregon K. Ferrer I. Paz-Ares L. Carrera A.C. A Potential Therapeutic Strategy Based on Acute Oxidative Stress Induction for Wild-Type NRF2/KEAP1 Lung Squamous Cell Carcinoma Redox Biol. 2024 75 103305 10.1016/j.redox.2024.103305 39137583 PMC11372719 18. Ma Q. Role of Nrf2 in Oxidative Stress and Toxicity Annu. Rev. Pharmacol. Toxicol. 2013 53 401 426 10.1146/annurev-pharmtox-011112-140320 23294312 PMC4680839 19. Luchkova A. Mata A. Cadenas S. Nrf2 as a Regulator of Energy Metabolism and Mitochondrial Function FEBS Lett. 2024 598 2092 2105 10.1002/1873-3468.14993 39118293 20. Duan Y. Guan Y. Qin W. Zhai X. Yu B. Liu H. Targeting Brd4 for Cancer Therapy: Inhibitors and Degraders Medchemcomm 2018 9 1779 10.1039/C8MD00198G 30542529 PMC6238758 21. An S. Fu L. Small-Molecule PROTACs: An Emerging and Promising Approach for the Development of Targeted Therapy Drugs EBioMedicine 2018 36 553 562 10.1016/j.ebiom.2018.09.005 30224312 PMC6197674 22. Chen L. Liu Z.P. Li X. Recent Advances in Dual BRD4-Kinase Inhibitors Based on Polypharmacology ChemMedChem 2022 17 e202100731 10.1002/cmdc.202100731 35146935 23. Pu C. Wang S. Liu L. Feng Z. Zhang H. Gong Q. Sun Y. Guo Y. Li R. Current Strategies for Improving Limitations of Proteolysis Targeting Chimeras Chin. Chem. Lett. 2023 34 107927 10.1016/j.cclet.2022.107927 24. Song Y. Dong Q.Q. Ni Y.K. Xu X.L. Chen C.X. Chen W. Nano-Proteolysis Targeting Chimeras (Nano-PROTACs) in Cancer Therapy Int. J. Nanomed. 2024 19 5739 5761 10.2147/IJN.S448684 38882545 PMC11180470 25. Zhang N.Y. Hou D.Y. Hu X.J. Liang J.X. Wang M.D. Song Z.Z. Yi L. Wang Z.J. An H.W. Xu W. Nano Proteolysis Targeting Chimeras (PROTACs) with Anti-Hook Effect for Tumor Therapy Angew. Chem. Int. Ed. 2023 62 e202308049 10.1002/anie.202308049 37486792 26. Wu M. Zhao Y. Zhang C. Pu K. Advancing Proteolysis Targeting Chimera (PROTAC) Nanotechnology in Protein Homeostasis Reprograming for Disease Treatment ACS Nano 2024 18 28502 28530 10.1021/acsnano.4c09800 39377250 27. Winterbourn C.C. Hydrogen Peroxide Reactivity and Specificity in Thiol-Based Cell Signalling Biochem. Soc. Trans. 2020 48 745 754 10.1042/BST20190049 32412042 28. Kong H. Chandel N.S. Regulation of Redox Balance in Cancer and T Cells J. Biol. Chem. 2018 293 7499 7507 10.1074/jbc.TM117.000257 29282291 PMC5961053 29. Hayes J.D. Dinkova-Kostova A.T. Tew K.D. Oxidative Stress in Cancer Cancer Cell 2020 38 167 197 10.1016/j.ccell.2020.06.001 32649885 PMC7439808 30. Forman H.J. Zhang H. Targeting Oxidative Stress in Disease: Promise and Limitations of Antioxidant Therapy Nat. Rev. Drug Discov. 2021 20 689 709 10.1038/s41573-021-00233-1 34194012 PMC8243062 31. Chávez V. Mohri-Shiomi A. Garsin D.A. Ce-Duox1/BLI-3 Generates Reactive Oxygen Species as a Protective Innate Immune Mechanism in Caenorhabditis Elegans Infect. Immun. 2009 77 4983 4989 10.1128/IAI.00627-09 19687201 PMC2772517 32. Wang Y. Branicky R. Noë A. Hekimi S. Superoxide Dismutases: Dual Roles in Controlling ROS Damage and Regulating ROS Signaling J. Cell Biol. 2018 217 1915 10.1083/jcb.201708007 29669742 PMC5987716 33. Nandi A. Yan L.J. Jana C.K. Das N. Role of Catalase in Oxidative Stress—And Age-Associated Degenerative Diseases Oxid. Med. Cell Longev. 2019 2019 9613090 10.1155/2019/9613090 31827713 PMC6885225 34. Li X. Fang P. Mai J. Choi E.T. Wang H. Yang X.F. Targeting Mitochondrial Reactive Oxygen Species as Novel Therapy for Inflammatory Diseases and Cancers J. Hematol. Oncol. 2013 6 19 10.1186/1756-8722-6-19 23442817 PMC3599349 35. Hadrava Vanova K. Kraus M. Neuzil J. Rohlena J. Mitochondrial Complex II and Reactive Oxygen Species in Disease and Therapy Redox Rep. 2020 25 26 10.1080/13510002.2020.1752002 32290794 PMC7178880 36. Zhao R.Z. Jiang S. Zhang L. Yu Z. Bin Mitochondrial Electron Transport Chain, ROS Generation and Uncoupling (Review) Int. J. Mol. Med. 2019 44 3 15 10.3892/IJMM.2019.4188 31115493 PMC6559295 37. Bezawork-Geleta A. Rohlena J. Dong L. Pacak K. Neuzil J. Mitochondrial Complex II: At the Crossroads Trends Biochem. Sci. 2017 42 312 325 10.1016/j.tibs.2017.01.003 28185716 PMC7441821 38. Fransen M. Lismont C. Walton P. The Peroxisome-Mitochondria Connection: How and Why? Int. J. Mol. Sci. 2017 18 1126 10.3390/ijms18061126 28538669 PMC5485950 39. Baumgart E. Vanhorebeek I. Grabenbauer M. Borgers M. Declercq P.E. Fahimi H.D. Baes M. Mitochondrial Alterations Caused by Defective Peroxisomal Biogenesis in a Mouse Model for Zellweger Syndrome (PEX5 Knockout Mouse) Am. J. Pathol. 2001 159 1477 1494 10.1016/S0002-9440(10)62534-5 11583975 PMC1850512 40. Fourcade S. Ferrer I. Pujol A. Oxidative Stress, Mitochondrial and Proteostasis Malfunction in Adrenoleukodystrophy: A Paradigm for Axonal Degeneration Free Radic. Biol. Med. 2015 88 18 29 10.1016/j.freeradbiomed.2015.05.041 26073123 41. Van Veldhoven P.P. Biochemistry and Genetics of Inherited Disorders of Peroxisomal Fatty Acid Metabolism J. Lipid Res. 2010 51 2863 2895 10.1194/jlr.R005959 20558530 PMC2936746 42. Nisimoto Y. Diebold B.A. Constentino-Gomes D. Lambeth J.D. Nox4: A Hydrogen Peroxide-Generating Oxygen Sensor Biochemistry 2014 53 5111 5120 10.1021/bi500331y 25062272 PMC4131900 43. Sies H. Oxidative Stress: A Concept in Redox Biology and Medicine Redox Biol. 2015 4 180 183 10.1016/j.redox.2015.01.002 25588755 PMC4309861 44. Bayo Jimenez M.T. Frenis K. Hahad O. Steven S. Cohen G. Cuadrado A. Münzel T. Daiber A. Protective Actions of Nuclear Factor Erythroid 2-Related Factor 2 (NRF2) and Downstream Pathways against Environmental Stressors Free Radic. Biol. Med. 2022 187 72 91 10.1016/j.freeradbiomed.2022.05.016 35613665 45. Mudway I.S. Kelly F.J. Holgate S.T. Oxidative Stress in Air Pollution Research Free Radic. Biol. Med. 2020 151 2 6 10.1016/j.freeradbiomed.2020.04.031 32360613 PMC7252129 46. ArulJothi K.N. Kumaran K. Senthil S. Nidhu A.B. Munaff N. Janitri V.B. Kirubakaran R. Singh S.K. Gupt G. Dua K. Implications of Reactive Oxygen Species in Lung Cancer and Exploiting It for Therapeutic Interventions Med. Oncol. 2022 40 43 10.1007/s12032-022-01900-y 36472716 PMC9734980 47. Szatrowski T.P. Nathan C.F. Production of Large Amounts of Hydrogen Peroxide by Human Tumor Cells Cancer Res. 1991 51 794 798 1846317 48. Finkel T. Signal Transduction by Reactive Oxygen Species J. Cell Biol. 2011 194 7 15 10.1083/jcb.201102095 21746850 PMC3135394 49. Bauer A.K. Hill T. Alexander C.M. The Involvement of NRF2 in Lung Cancer Oxid. Med. Cell Longev. 2013 2013 746432 10.1155/2013/746432 23577226 PMC3614183 50. Kobayashi A. Kang M.-I. Okawa H. Ohtsuji M. Zenke Y. Chiba T. Igarashi K. Yamamoto M. Oxidative Stress Sensor Keap1 Functions as an Adaptor for Cul3-Based E3 Ligase to Regulate Proteasomal Degradation of Nrf2 Mol. Cell Biol. 2004 24 7130 7139 10.1128/MCB.24.16.7130-7139.2004 15282312 PMC479737 51. McMahon M. Lamont D.J. Beattie K.A. Hayes J.D. Keap1 Perceives Stress via Three Sensors for the Endogenous Signaling Molecules Nitric Oxide, Zinc, and Alkenals Proc. Natl. Acad. Sci. USA 2010 107 18838 18843 10.1073/pnas.1007387107 20956331 PMC2973898 52. Dinkova-Kostova A.T. Holtzclaw W.D. Cole R.N. Itoh K. Wakabayashi N. Katoh Y. Yamamoto M. Talalay P. Direct Evidence That Sulfhydryl Groups of Keap1 Are the Sensors Regulating Induction of Phase 2 Enzymes That Protect against Carcinogens and Oxidants Proc. Natl. Acad. Sci. USA 2002 99 11908 11913 10.1073/pnas.172398899 12193649 PMC129367 53. Luo Y. Eggler A.L. Liu D. Liu G. Mesecar A.D. van Breemen R.B. Sites of Alkylation of Human Keap1 by Natural Chemoprevention Agents J. Am. Soc. Mass Spectrom. 2007 18 2226 2232 10.1016/j.jasms.2007.09.015 17980616 PMC2144741 54. Smolková K. Mikó E. Kovács T. Leguina-Ruzzi A. Sipos A. Bai P. Nuclear Factor Erythroid 2-Related Factor 2 in Regulating Cancer Metabolism Antioxid. Redox Signal. 2020 33 966 10.1089/ars.2020.8024 31989830 PMC7533893 55. Jaramillo M.C. Zhang D.D. The Emerging Role of the Nrf2-Keap1 Signaling Pathway in Cancer Genes Dev. 2013 27 2179 2191 10.1101/gad.225680.113 24142871 PMC3814639 56. Menegon S. Columbano A. Giordano S. The Dual Roles of NRF2 in Cancer Trends Mol. Med. 2016 22 578 593 10.1016/j.molmed.2016.05.002 27263465 57. Kandoth C. McLellan M.D. Vandin F. Ye K. Niu B. Lu C. Xie M. Zhang Q. McMichael J.F. Wyczalkowski M.A. Mutational Landscape and Significance across 12 Major Cancer Types Nature 2013 502 333 339 10.1038/nature12634 24132290 PMC3927368 58. Sporn M.B. Liby K.T. NRF2 and Cancer: The Good, the Bad and the Importance of Context Nat. Rev. Cancer 2012 12 564 571 10.1038/nrc3278 22810811 PMC3836441 59. Tao S. de la Vega M.R. Chapman E. Ooi A. Zhang D.D. The Effects of NRF2 Modulation on the Initiation and Progression of Chemically and Genetically Induced Lung Cancer Mol. Carcinog. 2018 57 182 192 10.1002/mc.22745 28976703 PMC5760364 60. Satoh H. Moriguchi T. Takai J. Ebina M. Yamamoto M. Nrf2 Prevents Initiation but Accelerates Progression through the Kras Signaling Pathway during Lung Carcinogenesis Cancer Res. 2013 73 4158 4168 10.1158/0008-5472.CAN-12-4499 23610445 61. Satoh H. Moriguchi T. Saigusa D. Baird L. Yu L. Rokutan H. Igarashi K. Ebina M. Shibata T. Yamamoto M. NRF2 Intensifies Host Defense Systems to Prevent Lung Carcinogenesis, but after Tumor Initiation Accelerates Malignant Cell Growth Cancer Res. 2016 76 3088 3096 10.1158/0008-5472.CAN-15-1584 27020858 62. Ray P.D. Huang B.W. Tsuji Y. Reactive Oxygen Species (ROS) Homeostasis and Redox Regulation in Cellular Signaling Cell. Signal. 2012 24 981 990 10.1016/j.cellsig.2012.01.008 22286106 PMC3454471 63. Houée-Lévin C. Bobrowski K. Horakova L. Karademir B. Schöneich C. Davies M.J. Spickett C.M. Exploring Oxidative Modifications of Tyrosine: An Update on Mechanisms of Formation, Advances in Analysis and Biological Consequences Free Radic. Res. 2015 49 347 373 10.3109/10715762.2015.1007968 25812585 64. Guo Q. Jin Y. Chen X. Ye X. Shen X. Lin M. Zeng C. Zhou T. Zhang J. NF-ΚB in Biology and Targeted Therapy: New Insights and Translational Implications Signal Transduct. Target. Ther. 2024 9 53 10.1038/s41392-024-01757-9 38433280 PMC10910037 65. Tang X. Liu D. Shishodia S. Ozburn N. Behrens C. Lee J.J. Waun K.H. Aggarwal B.B. Wistuba I.I. Nuclear Factor-KappaB (NF-KappaB) Is Frequently Expressed in Lung Cancer and Preneoplastic Lesions Cancer 2006 107 2637 2646 10.1002/cncr.22315 17078054 66. El-Nikhely N. Karger A. Sarode P. Singh I. Weigert A. Wietelmann A. Stiewe T. Dammann R. Fink L. Grimminger F. Metastasis-Associated Protein 2 Represses NF-ΚB to Reduce Lung Tumor Growth and Inflammation Cancer Res. 2020 80 4199 4211 10.1158/0008-5472.CAN-20-1158 32816854 67. Dimitrakopoulos F.I.D. Kottorou A.E. Kalofonou M. Kalofonos H.P. The Fire Within: NF-ΚB Involvement in Non-Small Cell Lung Cancer Cancer Res. 2020 80 4025 4036 10.1158/0008-5472.CAN-19-3578 32616502 68. Jung Y. Kim H. Sun H.M. Sue G.R. Jeong W. Dynein Light Chain LC8 Negatively Regulates NF-ΚB through the Redox-Dependent Interaction with IκBα J. Biol. Chem. 2008 283 23863 10.1074/jbc.M803072200 18579519 PMC3259766 69. Kretz-Remy C. Mirault M.E. Arrigo A.P. Inhibition of I kappa B-alpha phosphorylation and degradation and subsequent NF-kappa B activation by glutathione peroxidase overexpression J. Cell Biol. 1996 133 1083 1093 10.1083/jcb.133.5.1083 8655581 PMC2120847 70. Wu M. Bian Q. Liu Y. Fernandes A.F. Taylor A. Pereira P. Shang F. Sustained Oxidative Stress Inhibits NF-KappaB Activation Partially via Inactivating the Proteasome Free Radic. Biol. Med. 2009 46 62 69 10.1016/j.freeradbiomed.2008.09.021 18948189 PMC2688728 71. Chen P.M. Wu T.C. Wang Y.C. Cheng Y.W. Sheu G.T. Chen C.Y. Lee H. Activation of NF-ΚB by SOD2 Promotes the Aggressiveness of Lung Adenocarcinoma by Modulating NKX2-1-Mediated IKKβ Expression Carcinogenesis 2013 34 2655 2663 10.1093/carcin/bgt220 23784082 72. Bahar M.E. Kim H.J. Kim D.R. Targeting the RAS/RAF/MAPK Pathway for Cancer Therapy: From Mechanism to Clinical Studies Signal Transduct. Target. Ther. 2023 8 1 38 10.1038/s41392-023-01705-z 38105263 PMC10725898 73. Herbst R.S. Morgensztern D. Boshoff C. The Biology and Management of Non-Small Cell Lung Cancer Nature 2018 553 446 454 10.1038/nature25183 29364287 74. Blair H.A. Sotorasib: First Approval Drugs 2021 81 1573 1579 10.1007/s40265-021-01574-2 34357500 PMC8531079 75. Messina S. De Simone G. Ascenzi P. Cysteine-Based Regulation of Redox-Sensitive Ras Small GTPases Redox Biol. 2019 26 101282 10.1016/j.redox.2019.101282 31386964 PMC6695279 76. Weinberg F. Hamanaka R. Wheaton W.W. Weinberg S. Joseph J. Lopez M. Kalyanaraman B. Mutlu G.M. Budinger G.R.S. Chandel N.S. Mitochondrial Metabolism and ROS Generation Are Essential for Kras-Mediated Tumorigenicity Proc. Natl. Acad. Sci. USA 2010 107 8788 8793 10.1073/pnas.1003428107 20421486 PMC2889315 77. Liou G.Y. Döppler H. DelGiorno K.E. Zhang L. Leitges M. Crawford H.C. Murphy M.P. Storz P. Mutant KRas-Induced Mitochondrial Oxidative Stress in Acinar Cells Upregulates EGFR Signaling to Drive Formation of Pancreatic Precancerous Lesions Cell Rep. 2016 14 2325 2336 10.1016/j.celrep.2016.02.029 26947075 PMC4794374 78. Glaviano A. Foo A.S.C. Lam H.Y. Yap K.C.H. Jacot W. Jones R.H. Eng H. Nair M.G. Makvandi P. Geoerger B. PI3K/AKT/MTOR Signaling Transduction Pathway and Targeted Therapies in Cancer Mol. Cancer 2023 22 138 10.1186/s12943-023-01827-6 37596643 PMC10436543 79. Sanaei M.J. Razi S. Pourbagheri-Sigaroodi A. Bashash D. The PI3K/Akt/MTOR Pathway in Lung Cancer; Oncogenic Alterations, Therapeutic Opportunities, Challenges, and a Glance at the Application of Nanoparticles Transl. Oncol. 2022 18 101364 10.1016/j.tranon.2022.101364 35168143 PMC8850794 80. Le X. Puri S. Negrao M.V. Nilsson M.B. Robichaux J. Boyle T. Kevin Hicks J. Lovinger K.L. Roarty E. Rinsurongkawong W. Landscape of EGFR-Dependent and -Independent Resistance Mechanisms to Osimertinib and Continuation Therapy Beyond Progression in EGFR-Mutant NSCLC Clin. Cancer Res. 2018 24 6195 6203 10.1158/1078-0432.CCR-18-1542 30228210 PMC6295279 81. Wang Y. Wang Y. Li J. Li J. Che G. Clinical Significance of PIK3CA Gene in Non-Small-Cell Lung Cancer: A Systematic Review and Meta-Analysis Biomed. Res. Int. 2020 2020 3608241 10.1155/2020/3608241 32908885 PMC7450343 82. Lastwika K.J. Wilson W. Li Q.K. Norris J. Xu H. Ghazarian S.R. Kitagawa H. Kawabata S. Taube J.M. Yao S. Control of PD-L1 Expression by Oncogenic Activation of the AKT-MTOR Pathway in Non-Small Cell Lung Cancer Cancer Res. 2016 76 227 238 10.1158/0008-5472.CAN-14-3362 26637667 83. Kma L. Baruah T.J. The interplay of ROS and the PI3K/Akt pathway in autophagy regulation Biotechnol. Appl. Biochem. 2022 69 248 264 10.1002/bab.2104 33442914 84. Su Z. Burchfield J.G. Yang P. Humphrey S.J. Yang G. Francis D. Yasmin S. Shin S.Y. Norris D.M. Kearney A.L. Global Redox Proteome and Phosphoproteome Analysis Reveals Redox Switch in Akt Nat. Commun. 2019 10 1 18 10.1038/s41467-019-13114-4 31792197 PMC6889415 85. Leslie N.R. Bennett D. Lindsay Y.E. Stewart H. Gray A. Downes C.P. Redox Regulation of PI 3-Kinase Signalling via Inactivation of PTEN EMBO J. 2003 22 5501 5510 10.1093/emboj/cdg513 14532122 PMC213768 86. Peuget S. Zhou X. Selivanova G. Translating P53-Based Therapies for Cancer into the Clinic Nat. Rev. Cancer 2024 24 192 215 10.1038/s41568-023-00658-3 38287107 87. Vaddavalli P.L. Schumacher B. The P53 Network: Cellular and Systemic DNA Damage Responses in Cancer and Aging Trends Genet. 2022 38 598 612 10.1016/j.tig.2022.02.010 35346511 88. Collisson E.A. Campbell J.D. Brooks A.N. Berger A.H. Lee W. Chmielecki J. Beer D.G. Cope L. Creighton C.J. Danilova L. Comprehensive Molecular Profiling of Lung Adenocarcinoma Nature 2014 511 543 550 10.1038/nature13385 25079552 PMC4231481 89. Tan M. Li S. Swaroop M. Guan K. Oberley L.W. Sun Y. Transcriptional Activation of the Human Glutathione Peroxidase Promoter by P53 J. Biol. Chem. 1999 274 12061 12066 10.1074/jbc.274.17.12061 10207030 90. Cano C.E. Gommeaux J. Pietri S. Culcasi M. Garcia S. Seux M. Barelier S. Vasseur S. Spoto R.P. Pébusque M.J. Tumor Protein 53-Induced Nuclear Protein 1 Is a Major Mediator of P53 Antioxidant Function Cancer Res. 2009 69 219 226 10.1158/0008-5472.CAN-08-2320 19118006 91. Yoon K.A. Nakamura Y. Arakawa H. Identification of ALDH4 as a P53-Inducible Gene and Its Protective Role in Cellular Stresses J. Hum. Genet. 2004 49 134 140 10.1007/s10038-003-0122-3 14986171 92. Faraonio R. Vergara P. Di Marzo D. Pierantoni M.G. Napolitano M. Russo T. Cimino F. P53 Suppresses the Nrf2-Dependent Transcription of Antioxidant Response Genes J. Biol. Chem. 2006 281 39776 39784 10.1074/jbc.M605707200 17077087 93. Zhang Y. Han C.Y. Duan F.G. Fan X.X. Yao X.J. Parks R.J. Tang Y.J. Wang M.F. Liu L. Tsang B.K. P53 Sensitizes Chemoresistant Non-Small Cell Lung Cancer via Elevation of Reactive Oxygen Species and Suppression of EGFR/PI3K/AKT Signaling Cancer Cell Int. 2019 19 188 10.1186/s12935-019-0910-2 31360122 PMC6642601 94. Chougoni K.K. Neely V. Ding B. Oduah E. Lam V.T. Hu B. Koblinski J.E. Windle B.E. Palit Deb S. Deb S. Oncogenic Mutant P53 Sensitizes Non–Small Cell Lung Cancer Cells to Proteasome Inhibition via Oxidative Stress—Dependent Induction of Mitochondrial Apoptosis Cancer Res. Commun. 2024 4 2685 10.1158/2767-9764.CRC-23-0637 39302104 PMC11474859 95. Liu B. Chen Y. St Clair D.K. ROS and P53: A Versatile Partnership Free Radic. Biol. Med. 2008 44 1529 1535 10.1016/j.freeradbiomed.2008.01.011 18275858 PMC2359898 96. Yu H. Gao H. Guo H. Wang G. Yang Y. Hu Q. Liang L. Zhao Q. Xie D. Rao Y. Upregulation of Wild-Type P53 by Small Molecule-Induced Elevation of NQO1 in Non-Small Cell Lung Cancer Cells Acta Pharmacol. Sin. 2021 43 692 10.1038/s41401-021-00691-8 34035487 PMC8888561 97. Asher G. Lotem J. Cohen B. Sachs L. Shaul Y. Regulation of P53 Stability and P53-Dependent Apoptosis by NADH Quinone Oxidoreductase 1 Proc. Natl. Acad. Sci. USA 2001 98 1188 1193 10.1073/pnas.98.3.1188 11158615 PMC14730 98. Deng Z. Fan T. Xiao C. Tian H. Zheng Y. Li C. He J. TGF-β Signaling in Health, Disease, and Therapeutics Signal Transduct. Target. Ther. 2024 9 61 10.1038/s41392-024-01764-w 38514615 PMC10958066 99. Donatelli S.S. Zhou J.M. Gilvary D.L. Eksioglu E.A. Chen X. Cress W.D. Haura E.B. Schabath M.B. Coppola D. Wei S. TGF-β-Inducible MicroRNA-183 Silences Tumor-Associated Natural Killer Cells Proc. Natl. Acad. Sci. USA 2014 111 4203 4208 10.1073/pnas.1319269111 24586048 PMC3964044 100. Wang L. Tong X. Zhou Z. Wang S. Lei Z. Zhang T. Liu Z. Zeng Y. Li C. Zhao J. Circular RNA Hsa_circ_0008305 (CircPTK2) Inhibits TGF-β-Induced Epithelial-Mesenchymal Transition and Metastasis by Controlling TIF1γ in Non-Small Cell Lung Cancer Mol. Cancer 2018 17 140 10.1186/s12943-018-0889-7 30261900 PMC6161470 101. Ma M. Shi F. Zhai R. Wang H. Li K. Xu C. Yao W. Zhou F. TGF-β Promote Epithelial-Mesenchymal Transition via NF-ΚB/NOX4/ROS Signal Pathway in Lung Cancer Cells Mol. Biol. Rep. 2021 48 2365 2375 10.1007/s11033-021-06268-2 33792826 102. Jobling M.F. Mott J.D. Finnegan M.T. Jurukovski V. Erickson A.C. Walian P.J. Taylor S.E. Ledbetter S. Lawrence C.M. Rifkin D.B. Isoform-Specific Activation of Latent Transforming Growth Factor Beta (LTGF-Beta) by Reactive Oxygen Species Radiat. Res. 2006 166 839 848 10.1667/RR0695.1 17149983 103. Gorowiec M.R. Borthwick L.A. Parker S.M. Kirby J.A. Saretzki G.C. Fisher A.J. Free Radical Generation Induces Epithelial-to-Mesenchymal Transition in Lung Epithelium via a TGF-Β1-Dependent Mechanism Free Radic. Biol. Med. 2012 52 1024 1032 10.1016/j.freeradbiomed.2011.12.020 22240154 104. Singh R. Letai A. Sarosiek K. Regulation of Apoptosis in Health and Disease: The Balancing Act of BCL-2 Family Proteins Nat. Rev. Mol. Cell Biol. 2019 20 175 193 10.1038/s41580-018-0089-8 30655609 PMC7325303 105. Wilkie-Grantham R.P. Matsuzawa S.I. Reed J.C. Novel Phosphorylation and Ubiquitination Sites Regulate Reactive Oxygen Species-Dependent Degradation of Anti-Apoptotic c-FLIP Protein J. Biol. Chem. 2013 288 12777 12790 10.1074/jbc.M112.431320 23519470 PMC3642323 106. Villalpando-Rodriguez G.E. Gibson S.B. Reactive Oxygen Species (ROS) Regulates Different Types of Cell Death by Acting as a Rheostat Oxid. Med. Cell Longev. 2021 2021 9912436 10.1155/2021/9912436 34426760 PMC8380163 107. Dixon S.J. Lemberg K.M. Lamprecht M.R. Skouta R. Zaitsev E.M. Gleason C.E. Patel D.N. Bauer A.J. Cantley A.M. Yang W.S. Ferroptosis: An Iron-Dependent Form of Nonapoptotic Cell Death Cell 2012 149 1060 1072 10.1016/j.cell.2012.03.042 22632970 PMC3367386 108. Yang W.S. Stockwell B.R. Ferroptosis: Death by Lipid Peroxidation Trends Cell Biol. 2016 26 165 176 10.1016/j.tcb.2015.10.014 26653790 PMC4764384 109. Hassannia B. Vandenabeele P. Vanden Berghe T. Targeting Ferroptosis to Iron out Cancer Cancer Cell 2019 35 830 849 10.1016/j.ccell.2019.04.002 31105042 110. Scherz-Shouval R. Shvets E. Fass E. Shorer H. Gil L. Elazar Z. Reactive Oxygen Species Are Essential for Autophagy and Specifically Regulate the Activity of Atg4 EMBO J. 2007 26 1749 1760 10.1038/sj.emboj.7601623 17347651 PMC1847657 111. Alexander A. Cai S.L. Kim J. Nanez A. Sahin M. MacLean K.H. Inoki K. Guan K.L. Shen J. Person M.D. ATM Signals to TSC2 in the Cytoplasm to Regulate MTORC1 in Response to ROS Proc. Natl. Acad. Sci. USA 2010 107 4153 4158 10.1073/pnas.0913860107 20160076 PMC2840158 112. De Raedt T. Walton Z. Yecies J.L. Li D. Chen Y. Malone C.F. Maertens O. Jeong S.M. Bronson R.T. Lebleu V. Exploiting Cancer Cell Vulnerabilities to Develop a Combination Therapy for Ras-Driven Tumors Cancer Cell 2011 20 400 413 10.1016/j.ccr.2011.08.014 21907929 PMC3233475 113. Vandenabeele P. Galluzzi L. Vanden Berghe T. Kroemer G. Molecular Mechanisms of Necroptosis: An Ordered Cellular Explosion Nat. Rev. Mol. Cell Biol. 2010 11 700 714 10.1038/nrm2970 20823910 114. Zhang D.W. Shao J. Lin J. Zhang N. Lu B.J. Lin S.C. Dong M.Q. Han J. RIP3, an Energy Metabolism Regulator That Switches TNF-Induced Cell Death from Apoptosis to Necrosis Science 2009 325 332 336 10.1126/science.1172308 19498109 115. Bedard P.L. Hyman D.M. Davids M.S. Siu L.L. Small Molecules, Big Impact: 20 Years of Targeted Therapy in Oncology Lancet 2020 395 1078 1088 10.1016/S0140-6736(20)30164-1 32222192 116. Zhong L. Li Y. Xiong L. Wang W. Wu M. Yuan T. Yang W. Tian C. Miao Z. Wang T. Small Molecules in Targeted Cancer Therapy: Advances, Challenges, and Future Perspectives Signal Transduct. Target. Ther. 2021 6 201 10.1038/s41392-021-00572-w 34054126 PMC8165101 117. Klein E.A. Thompson I.M. Tangen C.M. Crowley J.J. Lucia S. Goodman P.J. Minasian L.M. Ford L.G. Parnes H.L. Gaziano J.M. Vitamin E and the Risk of Prostate Cancer: The Selenium and Vitamin E Cancer Prevention Trial (SELECT) JAMA 2011 306 1549 1556 10.1001/jama.2011.1437 21990298 PMC4169010 118. Omenn G.S. Goodman G.E. Thornquist M.D. Balmes J. Cullen M.R. Glass A. Keogh J.P. Meyskens F.L. Valanis B. Williams J.H. Effects of a Combination of Beta Carotene and Vitamin A on Lung Cancer and Cardiovascular Disease N. Engl. J. Med. 1996 334 1150 1155 10.1056/NEJM199605023341802 8602180 119. Wiel C. Le Gal K. Ibrahim M.X. Jahangir C.A. Kashif M. Yao H. Ziegler D.V. Xu X. Ghosh T. Mondal T. BACH1 Stabilization by Antioxidants Stimulates Lung Cancer Metastasis Cell 2019 178 330 345.e22 10.1016/j.cell.2019.06.005 31257027 120. Panieri E. Santoro M.M. ROS Homeostasis and Metabolism: A Dangerous Liason in Cancer Cells Cell Death Dis. 2016 7 e2253 10.1038/cddis.2016.105 27277675 PMC5143371 121. Pottier C. Fresnais M. Gilon M. Jérusalem G. Longuespée R. Sounni N.E. Tyrosine Kinase Inhibitors in Cancer: Breakthrough and Challenges of Targeted Therapy Cancers 2020 12 731 10.3390/cancers12030731 32244867 PMC7140093 122. Bukowski K. Kciuk M. Kontek R. Mechanisms of Multidrug Resistance in Cancer Chemotherapy Int. J. Mol. Sci. 2020 21 3233 10.3390/ijms21093233 32370233 PMC7247559 123. Turke A.B. Zejnullahu K. Wu Y.L. Song Y. Dias-Santagata D. Lifshits E. Toschi L. Rogers A. Mok T. Sequist L. Preexistence and Clonal Selection of MET Amplification in EGFR Mutant NSCLC Cancer Cell 2010 17 77 88 10.1016/j.ccr.2009.11.022 20129249 PMC2980857 124. Najafi M. Mortezaee K. Majidpoor J. Cancer Stem Cell (CSC) Resistance Drivers Life Sci. 2019 234 116781 10.1016/j.lfs.2019.116781 31430455 125. Mesci S. Marakli S. Yazgan B. Yıldırım T. The Effect of ATP-Binding Cassette (ABC) Transporters in Human Cancers Int. J. Sci. Lett. 2019 1 14 19 10.38058/ijsl.594000 126. Mele L. del Vecchio V. Liccardo D. Prisco C. Schwerdtfeger M. Robinson N. Desiderio V. Tirino V. Papaccio G. La Noce M. The Role of Autophagy in Resistance to Targeted Therapies Cancer Treat. Rev. 2020 88 10.1016/j.ctrv.2020.102043 32505806 127. Cox A.D. Fesik S.W. Kimmelman A.C. Luo J. Der C.J. Drugging the Undruggable RAS: Mission Possible? Nat. Rev. Drug Discov. 2014 13 828 851 10.1038/nrd4389 25323927 PMC4355017 128. Amm I. Sommer T. Wolf D.H. Protein Quality Control and Elimination of Protein Waste: The Role of the Ubiquitin–Proteasome System Biochim. Biophys. Acta (BBA)-Mol. Cell Res. 2014 1843 182 196 10.1016/j.bbamcr.2013.06.031 23850760 129. Komander D. Rape M. The Ubiquitin Code Annu. Rev. Biochem. 2012 81 203 229 10.1146/annurev-biochem-060310-170328 22524316 130. Grice G.L. Nathan J.A. The Recognition of Ubiquitinated Proteins by the Proteasome Cell Mol. Life Sci. 2016 73 3497 3506 10.1007/s00018-016-2255-5 27137187 PMC4980412 131. Harrigan J.A. Jacq X. Martin N.M. Jackson S.P. Deubiquitylating Enzymes and Drug Discovery: Emerging Opportunities Nat. Rev. Drug Discov. 2018 17 57 77 10.1038/nrd.2017.152 28959952 PMC7097658 132. Sakamoto K.M. Kim K.B. Kumagai A. Mercurio F. Crews C.M. Deshaies R.J. Protacs: Chimeric Molecules That Target Proteins to the Skp1-Cullin-F Box Complex for Ubiquitination and Degradation Proc. Natl. Acad. Sci. USA 2001 98 8554 8559 10.1073/pnas.141230798 11438690 PMC37474 133. Mi D. Li Y. Gu H. Li Y. Chen Y. Current Advances of Small Molecule E3 Ligands for Proteolysis-Targeting Chimeras Design Eur. J. Med. Chem. 2023 256 115444 10.1016/j.ejmech.2023.115444 37178483 134. Poongavanam V. Atilaw Y. Siegel S. Giese A. Lehmann L. Meibom D. Erdelyi M. Kihlberg J. Linker-Dependent Folding Rationalizes PROTAC Cell Permeability J. Med. Chem. 2022 65 13029 13040 10.1021/acs.jmedchem.2c00877 36170570 PMC9574858 135. Du G. Jiang J. Henning N.J. Safaee N. Koide E. Nowak R.P. Donovan K.A. Yoon H. You I. Yue H. Exploring the Target Scope of KEAP1 E3 Ligase-Based PROTACs Cell Chem. Biol. 2022 29 1470 1481.e31 10.1016/j.chembiol.2022.08.003 36070758 PMC9588736 136. Lu M. Liu T. Jiao Q. Ji J. Tao M. Liu Y. You Q. Jiang Z. Discovery of a Keap1-Dependent Peptide PROTAC to Knockdown Tau by Ubiquitination-Proteasome Degradation Pathway Eur. J. Med. Chem. 2018 146 251 259 10.1016/j.ejmech.2018.01.063 29407955 137. Tong B. Luo M. Xie Y. Spradlin J.N. Tallarico J.A. McKenna J.M. Schirle M. Maimone T.J. Nomura D.K. Bardoxolone Conjugation Enables Targeted Protein Degradation of BRD4 Sci. Rep. 2020 10 15543 10.1038/s41598-020-72491-9 32968148 PMC7511954 138. Pei J. Xiao Y. Liu X. Hu W. Sobh A. Yuan Y. Zhou S. Hua N. Mackintosh S.G. Zhang X. Piperlongumine Conjugates Induce Targeted Protein Degradation Cell Chem. Biol. 2023 30 203 213.e17 10.1016/j.chembiol.2023.01.004 36750097 PMC10074544 139. Tao Y. Remillard D. Vinogradova E.V. Yokoyama M. Banchenko S. Schwefel D. Melillo B. Schreiber S.L. Zhang X. Cravatt B.F. Targeted Protein Degradation by Electrophilic PROTACs That Stereoselectively and Site-Specifically Engage DCAF1 J. Am. Chem. Soc. 2022 144 18688 18699 10.1021/jacs.2c08964 36170674 PMC10347610 140. Zhang X. Luukkonen L.M. Eissler C.L. Crowley V.M. Yamashita Y. Schafroth M.A. Kikuchi S. Weinstein D.S. Symons K.T. Nordin B.E. DCAF11 Supports Targeted Protein Degradation by Electrophilic Proteolysis-Targeting Chimeras J. Am. Chem. Soc. 2021 143 5141 5149 10.1021/jacs.1c00990 33783207 PMC8309050 141. Zoppi V. Hughes S.J. Maniaci C. Testa A. Gmaschitz T. Wieshofer C. Koegl M. Riching K.M. Daniels D.L. Spallarossa A. Iterative Design and Optimization of Initially Inactive Proteolysis Targeting Chimeras (PROTACs) Identify VZ185 as a Potent, Fast, and Selective von Hippel-Lindau (VHL) Based Dual Degrader Probe of BRD9 and BRD7 J. Med. Chem. 2019 62 699 726 10.1021/acs.jmedchem.8b01413 30540463 PMC6348446 142. Li L. Mi D. Pei H. Duan Q. Wang X. Zhou W. Jin J. Li D. Liu M. Chen Y. In Vivo Target Protein Degradation Induced by PROTACs Based on E3 Ligase DCAF15 Signal Transduct. Target. Ther. 2020 5 129 10.1038/s41392-020-00245-0 32713946 PMC7383041 143. Pu C. Tong Y. Liu Y. Lan S. Wang S. Yan G. Zhang H. Luo D. Ma X. Yu S. Selective Degradation of PARP2 by PROTACs via Recruiting DCAF16 for Triple-Negative Breast Cancer Eur. J. Med. Chem. 2022 236 114321 10.1016/j.ejmech.2022.114321 35430559 144. Zhang X. Crowley V.M. Wucherpfennig T.G. Dix M.M. Cravatt B.F. Electrophilic PROTACs That Degrade Nuclear Proteins by Engaging DCAF16 Nat. Chem. Biol. 2019 15 737 746 10.1038/s41589-019-0279-5 31209349 PMC6592777 145. Nalawansha D.A. Li K. Hines J. Crews C.M. Hijacking Methyl Reader Proteins for Nuclear-Specific Protein Degradation J. Am. Chem. Soc. 2022 144 5594 5605 10.1021/jacs.2c00874 35311258 PMC10331457 146. Leng F. Yu J. Zhang C. Alejo S. Hoang N. Sun H. Lu F. Zhang H. Methylated DNMT1 and E2F1 are targeted for proteolysis by L3MBTL3 and CRL4(DCAF5) ubiquitin ligase Nat. Commun. 2018 9 1641 1657 29691401 10.1038/s41467-018-04019-9 PMC5915600 147. Ohoka N. Tsuji G. Shoda T. Fujisato T. Kurihara M. Demizu Y. Naito M. Development of Small Molecule Chimeras That Recruit AhR E3 Ligase to Target Proteins ACS Chem. Biol. 2019 14 2822 2832 10.1021/acschembio.9b00704 31580635 148. Henning N.J. Manford A.G. Spradlin J.N. Brittain S.M. Zhang E. McKenna J.M. Tallarico J.A. Schirle M. Rape M. Nomura D.K. Discovery of a Covalent FEM1B Recruiter for Targeted Protein Degradation Applications J. Am. Chem. Soc. 2022 144 701 708 10.1021/jacs.1c03980 34994556 PMC8928484 149. Ward C.C. Kleinman J.I. Brittain S.M. Lee P.S. Chung C.Y.S. Kim K. Petri Y. Thomas J.R. Tallarico J.A. McKenna J.M. Covalent Ligand Screening Uncovers a RNF4 E3 Ligase Recruiter for Targeted Protein Degradation Applications ACS Chem. Biol. 2019 14 2430 2440 10.1021/acschembio.8b01083 31059647 PMC7422721 150. Luo M. Spradlin J.N. Boike L. Tong B. Brittain S.M. McKenna J.M. Tallarico J.A. Schirle M. Maimone T.J. Nomura D.K. Chemoproteomics-Enabled Discovery of Covalent RNF114-Based Degraders That Mimic Natural Product Function Cell Chem. Biol. 2021 28 559 566.e15 10.1016/j.chembiol.2021.01.005 33513350 PMC8052289 151. Zhong G. Chang X. Xie W. Zhou X. Targeted Protein Degradation: Advances in Drug Discovery and Clinical Practice Signal Transduct. Target. Ther. 2024 9 308 10.1038/s41392-024-02004-x 39500878 PMC11539257 152. Herbst R.S. Fukuoka M. Baselga J. Gefitinib—A Novel Targeted Approach to Treating Cancer Nat. Rev. Cancer 2004 4 956 965 10.1038/nrc1506 15573117 153. Cappuzzo F. Ciuleanu T. Stelmakh L. Cicenas S. Szczésna A. Juhász E. Esteban E. Molinier O. Brugger W. Melezínek I. Erlotinib as Maintenance Treatment in Advanced Non-Small-Cell Lung Cancer: A Multicentre, Randomised, Placebo-Controlled Phase 3 Study Lancet Oncol. 2010 11 521 529 10.1016/S1470-2045(10)70112-1 20493771 154. Cross D.A.E. Ashton S.E. Ghiorghiu S. Eberlein C. Nebhan C.A. Spitzler P.J. Orme J.P. Finlay M.R.V. Ward R.A. Mellor M.J. AZD9291, an Irreversible EGFR TKI, Overcomes T790M-Mediated Resistance to EGFR Inhibitors in Lung Cancer Cancer Discov. 2014 4 1046 1061 10.1158/2159-8290.CD-14-0337 24893891 PMC4315625 155. Dong R.F. Zhu M.L. Liu M.M. Xu Y.T. Yuan L.L. Bian J. Xia Y.Z. Kong L.Y. EGFR Mutation Mediates Resistance to EGFR Tyrosine Kinase Inhibitors in NSCLC: From Molecular Mechanisms to Clinical Research Pharmacol. Res. 2021 167 105583 10.1016/j.phrs.2021.105583 33775864 156. Zhao H.Y. Wang H.P. Mao Y.Z. Zhang H. Xin M. Xi X.X. Lei H. Mao S. Li D.H. Zhang S.Q. Discovery of Potent PROTACs Targeting EGFR Mutants through the Optimization of Covalent EGFR Ligands J. Med. Chem. 2022 65 4709 4726 10.1021/acs.jmedchem.1c01827 35254067 157. Wang K. Zhou H. Proteolysis Targeting Chimera (PROTAC) for Epidermal Growth Factor Receptor Enhances Anti-Tumor Immunity in Non-Small Cell Lung Cancer Drug Dev. Res. 2021 82 422 429 10.1002/ddr.21765 33231319 158. Jang J. To C. De Clercq D.J.H. Park E. Ponthier C.M. Shin B.H. Mushajiang M. Nowak R.P. Fischer E.S. Eck M.J. Mutant-Selective Allosteric EGFR Degraders Are Effective Against a Broad Range of Drug-Resistant Mutations Angew. Chem. Int. Ed. 2020 59 14481 14489 10.1002/anie.202003500 PMC7686272 32510788 159. Du Y. Chen Y. Wang Y. Chen J. Lu X. Zhang L. Li Y. Wang Z. Ye G. Zhang G. HJM-561, a Potent, Selective, and Orally Bioavailable EGFR PROTAC That Overcomes Osimertinib-Resistant EGFR Triple Mutations Mol. Cancer Ther. 2022 21 1060 1066 10.1158/1535-7163.MCT-21-0835 35499406 160. Haisco Pharmaceutical Group Co., Ltd. Phase I Study of HSK40118 in NSCLC Patients with EGFR Mutation NCT06050980 Haisco Pharmaceutical Group Co., Ltd. Tibet, China 2023 161. Haisco Pharmaceutical Group Co., Ltd. Phase I Study of HSK42360 in Solid Tumors with BRAF V600 Mutation NCT06536400 Haisco Pharmaceutical Group Co., Ltd. Tibet, China 2024 162. Li J.W. Zheng G. Kaye F.J. Wu L. PROTAC Therapy as a New Targeted Therapy for Lung Cancer Mol. Ther. 2023 31 647 656 10.1016/j.ymthe.2022.11.011 36415148 PMC10014230 163. García Jiménez D. Rossi Sebastiano M. Vallaro M. Mileo V. Pizzirani D. Moretti E. Ermondi G. Caron G. Designing Soluble PROTACs: Strategies and Preliminary Guidelines J. Med. Chem. 2022 65 12639 12649 10.1021/acs.jmedchem.2c00201 35469399 PMC9574862 164. Guenette R.G. Yang S.W. Min J. Pei B. Potts P.R. Target and Tissue Selectivity of PROTAC Degraders Chem. Soc. Rev. 2022 51 5740 5756 10.1039/D2CS00200K 35587208 165. Pike A. Williamson B. Harlfinger S. Martin S. McGinnity D.F. Optimising Proteolysis-Targeting Chimeras (PROTACs) for Oral Drug Delivery: A Drug Metabolism and Pharmacokinetics Perspective Drug Discov. Today 2020 25 1793 1800 10.1016/j.drudis.2020.07.013 32693163 166. Wu K. Yu B. Li D. Tian Y. Liu Y. Jiang J. Recent Advances in Nanoplatforms for the Treatment of Osteosarcoma Front. Oncol. 2022 12 805978 10.3389/fonc.2022.805978 35242707 PMC8885548 167. Cao J. Huang D. Peppas N.A. Advanced Engineered Nanoparticulate Platforms to Address Key Biological Barriers for Delivering Chemotherapeutic Agents to Target Sites Adv. Drug Deliv. Rev. 2020 167 170 188 10.1016/j.addr.2020.06.030 32622022 168. Zhao Z. Li D. Wu Z. Wang Q. Ma Z. Zhang C. Research Progress and Prospect of Nanoplatforms for Treatment of Oral Cancer Front. Pharmacol. 2020 11 616101 10.3389/fphar.2020.616101 33391000 PMC7773899 169. Mauro N. Utzeri M.A. Varvarà P. Cavallaro G. Functionalization of Metal and Carbon Nanoparticles with Potential in Cancer Theranostics Molecules 2021 26 3085 10.3390/molecules26113085 34064173 PMC8196792 170. Zhong J. Zhao R. Wang Y. Su Y.X. Lan X. Nano-PROTACs: State of the Art and Perspectives Nanoscale 2024 16 4378 4391 10.1039/D3NR06059D 38305466 171. Andra V.V.S.N.L. Pammi S.V.N. Bhatraju L.V.K.P. Ruddaraju L.K. A Comprehensive Review on Novel Liposomal Methodologies, Commercial Formulations, Clinical Trials and Patents Bionanoscience 2022 12 274 291 10.1007/s12668-022-00941-x 35096502 PMC8790012 172. Ickenstein L.M. Garidel P. Lipid-Based Nanoparticle Formulations for Small Molecules and RNA Drugs Expert Opin. Drug Deliv. 2019 16 1205 1226 10.1080/17425247.2019.1669558 31530041 173. Yao L. Yang N. Zhou W. Akhtar M.H. Zhou W. Liu C. Song S. Li Y. Han W. Yu C. Exploiting Cancer Vulnerabilities by Blocking of the DHODH and GPX4 Pathways: A Multifunctional Bodipy/PROTAC Nanoplatform for the Efficient Synergistic Ferroptosis Therapy Adv. Healthc. Mater. 2023 12 e2300871 10.1002/adhm.202300871 37204046 174. Fu Y. Rathod D. Patel K. Protein Kinase C Inhibitor Anchored BRD4 PROTAC PEGylated Nanoliposomes for the Treatment of Vemurafenib-Resistant Melanoma Exp. Cell Res. 2020 396 112275 10.1016/j.yexcr.2020.112275 32898554 PMC12045034 175. Chen J. Qiu M. Ma F. Yang L. Glass Z. Xu Q. Enhanced Protein Degradation by Intracellular Delivery of Pre-Fused PROTACs Using Lipid-like Nanoparticles J. Control. Release 2021 330 1244 1249 10.1016/j.jconrel.2020.11.032 33234362 PMC7906926 176. Ma B. Fan Y. Zhang D. Wei Y. Jian Y. Liu D. Wang Z. Gao Y. Ma J. Chen Y. De Novo Design of an Androgen Receptor DNA Binding Domain-Targeted Peptide PROTAC for Prostate Cancer Therapy Adv. Sci. 2022 9 e2201859 10.1002/advs.202201859 35971165 PMC9534960 177. He Q. Zhou L. Yu D. Zhu R. Chen Y. Song M. Liu X. Liao Y. Ding T. Fan W. Near-Infrared-Activatable PROTAC Nanocages for Controllable Target Protein Degradation and On-Demand Antitumor Therapy J. Med. Chem. 2023 66 10458 10472 10.1021/acs.jmedchem.3c00587 37279091 178. Lai W.F. He Z.D. Design and Fabrication of Hydrogel-Based Nanoparticulate Systems for in Vivo Drug Delivery J. Control. Release 2016 243 269 282 10.1016/j.jconrel.2016.10.013 27746276 179. Beach M.A. Nayanathara U. Gao Y. Zhang C. Xiong Y. Wang Y. Such G.K. Polymeric Nanoparticles for Drug Delivery Chem. Rev. 2024 124 5505 5616 10.1021/acs.chemrev.3c00705 38626459 PMC11086401 180. Liu H.J. Chen W. Wu G. Zhou J. Liu C. Tang Z. Huang X. Gao J. Xiao Y. Kong N. Glutathione-Scavenging Nanoparticle-Mediated PROTACs Delivery for Targeted Protein Degradation and Amplified Antitumor Effects Adv. Sci. 2023 10 e2207439 10.1002/advs.202207439 37066758 PMC10238184 181. He Y. Zan X. Miao J. Wang B. Wu Y. Shen Y. Chen X. Gou H. Zheng S. Huang N. Enhanced Anti-Glioma Efficacy of Doxorubicin with BRD4 PROTAC Degrader Using Targeted Nanoparticles Mater. Today Bio 2022 16 100423 10.1016/j.mtbio.2022.100423 PMC9489811 36157053 182. Guan X. Xu X. Tao Y. Deng X. He L. Lin Z. Chang J. Huang J. Zhou D. Yu X. Dual Targeting and Bioresponsive Nano-PROTAC Induced Precise and Effective Lung Cancer Therapy J. Nanobiotechnol. 2024 22 692 10.1186/s12951-024-02967-7 39523308 PMC11552110 183. Zhang J. Chen C. Chen X. Liao K. Li F. Song X. Liu C. Su M.Y. Sun H. Hou T. Linker-Free PROTACs Efficiently Induce the Degradation of Oncoproteins Nat. Commun. 2025 16 4794 10.1038/s41467-025-60107-7 40410168 PMC12102262 184. Li X. Wang Z. Chen C. Yang F. Liu P. Fang S. Wang B. Chen S. Li X. A Small-Molecule Degrader Selectively Inhibits the Growth of ALK-Rearranged Lung Cancer with Ceritinib Resistance iScience 2024 27 109015 10.1016/j.isci.2024.109015 38327793 PMC10847737 185. Khan S. Cao L. Wiegand J. Zhang P. Zajac-Kaye M. Kaye F.J. Zheng G. Zhou D. PROTAC-Mediated Dual Degradation of BCL-XL and BCL-2 Is a Highly Effective Therapeutic Strategy in Small-Cell Lung Cancer Cells 2024 13 528 10.3390/cells13060528 38534371 PMC10968744 186. Shi M.X. Ding X. Tang L. Cao W.J. Su B. Zhang J. PROTAC EZH2 Degrader-1 Overcomes the Resistance of Podophyllotoxin Derivatives in Refractory Small Cell Lung Cancer with Leptomeningeal Metastasis BMC Cancer 2024 24 504 10.1186/s12885-024-12244-3 38644473 PMC11034131 187. Zhang D. Ma B. Dragovich P.S. Ma L. Chen S. Chen E.C. Ye X. Liu J. Pizzano J. Bortolon E. Tissue Distribution and Retention Drives Efficacy of Rapidly Clearing VHL-Based PROTACs Commun. Med. 2024 4 87 10.1038/s43856-024-00505-y 38755248 PMC11099041 188. Kotagiri S. Wang Y. Han Y. Liang X. Blazanin N. Nguyen P.K. Jiang Y. Lissanu Y. Discovery of Novel, Potent and Orally Bioavailable SMARCA2 PROTACs with Synergistic Anti-Tumor Activity in Combination with KRAS G12C Inhibitors bioRxiv 2024 10.1021/acs.jmedchem.4c02577 PMC12067438 40280558 189. Wang D. Liu Y. Chen Y. Dai C. Hu W. Han J. Li Z. Yin F. Zhang Y. Shi C. EGFR Targeted Liposomal PROTAC Assisted with Epigenetic Regulation as an Efficient Strategy for Osimertinib-Resistant Lung Cancer Therapy Adv. Sci. 2025 e10197 10.1002/advs.202510197 40842076 190. Vartak R. Patel K. Targeted Nanoliposomes of Oncogenic Protein Degraders: Significant Inhibition of Tumor in Lung-Cancer Bearing Mice J. Control. Release 2024 376 502 517 10.1016/j.jconrel.2024.10.007 39406280 191. Lim S.M. Hong M.H. Kim H.R. Immunotherapy for Non-Small Cell Lung Cancer: Current Landscape and Future Perspectives Immune Netw. 2020 20 e10 10.4110/in.2020.20.e10 32158598 PMC7049584 192. Zhu H.F. Li Y. Small-Molecule Targets in Tumor Immunotherapy Nat. Prod. Bioprospect. 2018 8 297 301 10.1007/s13659-018-0177-7 29974338 PMC6102179 193. Zhang S. Li R. Jiang T. Gao Y. Zhong K. Cheng H. Chen X. Li S. Inhalable Nanomedicine for Lung Cancer Treatment Smart Mater. Med. 2024 5 261 280 10.1016/j.smaim.2024.04.001 194. Kumar M. Jha A. DR M. Mishra B. Targeted Drug Nanocrystals for Pulmonary Delivery: A Potential Strategy for Lung Cancer Therapy Expert Opin. Drug Deliv. 2020 17 1459 1472 10.1080/17425247.2020.1798401 32684002 195. Sakamoto K.M. Protacs for Treatment of Cancer Pediatr. Res. 2010 67 505 508 10.1203/PDR.0b013e3181d35017 20075761 PMC2881331 196. Pérez E. Fernández-Olleros A.M. Olmo R. Teijón J.M. Blanco M.D. PH and Glutathion-Responsive Hydrogel for Localized Delivery of Paclitaxel Colloids Surf. B Biointerfaces 2014 116 247 256 10.1016/j.colsurfb.2014.01.004 24491841 197. Ji J. Ma S. Zhu Y. Zhao J. Tong Y. You Q. Jiang Z. ARE-PROTACs Enable Co-Degradation of an Nrf2-MafG Heterodimer J. Med. Chem. 2023 66 6070 6081 10.1021/acs.jmedchem.2c01909 36892138 198. Barba A.A. Syahputra E.W. Lee H. Cho H. Park H.J. Park K.-S. Hwang D. PROTAC Delivery Strategies for Overcoming Physicochemical Properties and Physiological Barriers in Targeted Protein Degradation Pharmaceutics 2025 17 501 10.3390/pharmaceutics17040501 40284496 PMC12030311 199. Eaton M.A.W. Levy L. Fontaine O.M.A. Delivering Nanomedicines to Patients: A Practical Guide Nanomedicine 2015 11 983 992 10.1016/j.nano.2015.02.004 25724929 200. Đorđević S. Gonzalez M.M. Conejos-Sánchez I. Carreira B. Pozzi S. Acúrcio R.C. Satchi-Fainaro R. Florindo H.F. Vicent M.J. Current Hurdles to the Translation of Nanomedicines from Bench to the Clinic Drug Deliv. Transl. Res. 2022 12 500 525 10.1007/s13346-021-01024-2 34302274 PMC8300981 ",
  "metadata": {
    "Title of this paper": "Current Hurdles to the Translation of Nanomedicines from Bench to the Clinic",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467217/"
  }
}