{
  "title": "Paper_483",
  "abstract": "pmc Yale J Biol Med Yale J Biol Med 504 yjbm YJBM The Yale Journal of Biology and Medicine 0044-0086 1551-4056 Yale Journal of Biology and Medicine PMC12466276 PMC12466276.1 12466276 12466276 41030632 10.59249/XNQB9071 yjbm983379 1 Interview Focus: History of Medicine Healing Histories and Breaking Barriers for Asian Women at the Yale School of\nMedicine An Interview with Qi Yan and Xuezhu (Sunny) Wang Serpa Hayley a * Suh Samuel a * a * hayley.serpa@yale.edu sam.suh@yale.edu 30 9 2025 9 2025 98 3 497599 379 396 30 09 2025 30 09 2025 01 10 2025 Copyright ©2025, Yale Journal of Biology and\nMedicine 2025 Yale Journal of Biology and Medicine https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article distributed under the terms of the\nCreative Commons CC BY-NC license, which permits use, distribution, and\nreproduction in any medium, provided the original work is properly cited.\nYou may not use the material for commercial purposes. history of medicine gender\nequity racial barriers in medicine women in medicine women in STEM representation in\nhealthcare 20th century US medical education 21st century US medical\neducation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes On the second floor of Sterling Hall of Medicine, portraits of women faculty from the\nYale School of Medicine line the walls. For Qi Yan and Sunny Wang, two international\nstudents from China, the images also raised a deeper question: how many stories of Asian\nwomen in medicine remain obscured from this record? As Qi explains, “It is really an\nhonor to write a review about the history of Asian women at Yale School of Medicine\n(YSM)—a piece that can bring attention to those stories and one that resonates with my\nown journey.” Qi Yan is a 5th-year PhD student in physiology who came to Yale in 2018 for a summer\nprogram—her first time abroad. Xuezhu (Sunny) Wang, a recent MD graduate from Peking\nUnion Medical College in Beijing, arrived at Yale in 2024 for a clinical rotation at the\nYale New Haven Hospital. Former classmates in China, the two reconnected at Yale with a\nshared commitment to research the stories of Asian women at YSM. “I had an immersive\nexperience at the Yale Cancer Center, working alongside incredible students, residents,\nfellows, and faculty,” Sunny recalls. “Those connections are what continue to tie me to\nYale today.” Their project began when Qi noticed that YJBM Qi and Sunny’s historical project focuses on the narratives of Asian women medical\npractitioners that have gone underdocumented within the School of Medicine’s history.\nWhile their research illuminates manifold stories of women physicians and scientists,\nthere is one figure that takes center stage: Dr. Chenghui Ge. Following Ge’s graduation from Shanghai Women’s Medical College in 1915, she traveled\noverseas to continue her education at Yale. Dr. Ge obtained a Master of Public Health\n(MPH) and Doctorate of Public Health (DrPH), in 1924 and 1926, respectively, from the\nYSM’s Public Health Department, now known as the Yale School of Public Health. This\nmarked her as the first Chinese woman to be awarded both those degrees from YSM.\nHowever, it is how Sponsored by the Chinese government, Dr. Ge received the Jiangsu Province Government\nScholarship in 1920. Interestingly, she left the gender field on her scholarship\napplication blank. Could this have been a human error and oversight? Qi and Sunny\npostulate that “...this was kind of Dr. Ge’s…survival strategy…to let herself enter the\nmedical system that had been dominated mainly by male figures during that time. To do\nthat, she rendered her female identity invisible in the records on both the Chinese\ngovernment’s side and Yale’s.” Following her graduation from Yale, Dr. Ge eventually\nreturned to China to serve as president of the Zhejiang Provincial Maternity School in\n1936 and founded Jiading’s Puji Hospital (now Jiading District Central Hospital) in\n1947. Through Qi and Sunny’s advocacy, in early 2025, Yale amended Dr. Ge’s pronouns\nfrom he/him to she/her on their School of Public Health website, officially recognizing\nher as the first Chinese woman to graduate from the Yale School of Public Health. Qi and Sunny’s historical project encapsulates more than just women medical professionals\nof the early 20th century. To generate further awareness and conversations surrounding\ngender inequities within the healthcare sphere, they also include narratives from\ncurrent women physicians at the School of Medicine. As Asian women working in the US\nmedical sphere, Qi and Sunny felt empowered to connect their historical research with\nthe present-day stories of Asian women physicians at YSM, highlighting how much more\nwork still lies ahead in the fight against ongoing gender and racial inequities. Dr. Sirikanya Chiraroekmongkon, a psychiatrist at Yale, shared her experiences with Qi\nand Sunny, describing her daily struggles as an Asian physician. Qi recalls Dr.\nChiraroekmongkon’s story, expressing that “other physicians think she is a ‘porcelain\ndoll’ because she is Asian. She is not viewed in a professional way… Or they don’t see\nher at all, because they assume she’s invisible. But no, she is a physician!” Dr.\nChiraroekmongkon’s experiences point to the normalization of gender and racial\ninequities in medicine, a space where, evidently, women are still unfairly treated and\nprovided less respect than their male counterparts. During Sunny’s clinical rotation at the Yale New Haven Hospital Smilow Cancer Center, she\nworked closely with head and neck cancer specialist, Dr. Aarti Bhatia. Sunny sat down\nwith Dr. Bhatia to learn more about her experiences navigating the medical system as an\nAsian physician. According to Dr. Bhatia, it has certainly not been easy. Sunny shares\nthat, “even now as an associate professor at Yale… she, ‘as a small, brown lady’—per\nherself—still sometimes experiences judgments based on her appearance from the people\nshe speaks with. Some patients asked the doctor how long she had been training, saying\nshe looked very young. Some patients also asked her where she went to medical school.”\nDr. Bhatia’s experiences resonate deeply with Dr. Chiraroekmongkon’s, both successful\nwomen physicians who continue to encounter gender stigma and prejudice from patients and\nmale colleagues. As part of their efforts, Qi and Sunny constructed a timeline For Qi and Sunny, working on this project served as a reminder that care is not confined\nto the clinic nor the lab—it can also take the form of recovering and preserving\nhistory. \"Medicine is about providing comfort to patients,” Sunny\nreflects, “...but I have to remember that patients are living in a society, and doctors\nare living in the same society as well.” For Sunny, documenting the experiences of Asian\nwomen physicians underscores the importance of confronting the prejudices and social\ndynamics that mold the physician-patient relationship. Qi agrees, powerfully emphasizing\nthat their historical research itself is an act of care: “Preserving the history is a\nkind of care. Challenging the current biases against ourselves is also a care. We are\ngoing to co-create better spaces for future generations of doctors and scientists—yes,\nthat’s care.” Qi and Sunny’s experiences are also a testament to the value found within the history of\nmedicine. Qi shares how “as scientists and physicians, we are trained for reproducible\ndata and definite answers like “yes” or “no,” or “hypothesis correct” or “not correct.”\n“Working on this project makes us feel like historical research is totally different…We\nhad to accept that for one event there is no single truth.” Medicine is not stagnant,\nbut constantly evolving in tandem with the shifts in societal values, cultures, and\ntechnological advancements. As Qi and Sunny both noted, the history of medicine provides\nus with a tool to grapple with these changes, which aims to trace medicine’s past in\norder to understand its present. In its constant transformations, the history of medicine as a discipline embodies a sense\nof interdisciplinarity. Qi and Sunny have underscored how history can offer tools to\nsupplement their work in the biomedical sciences. Sunny beautifully illustrates this\npoint by attesting that, “...When doing this project, we had to think about the\nindividuals who are living behind the story, who are living behind the digits and\nnumbers. Those are real people…” History of medicine may act as an intervention within\nthe biomedical sciences, enabling its interlocutors to reevaluate the norms that may\nobfuscate human identities, stories, and biases. By engaging with history, they seek to\nusher the human back to the fore of medicine. This notion of interdisciplinarity is tied to a common misconception among biomedical\nscientists and researchers that medical knowledge-making processes are mutually\nexclusive from their humanistic counterparts. Modern science prides itself on its\n“objectivity”—a philosophical ideal grounded in empiricism and quantification. As a\nmedical student, Sunny expresses that, “‘we say that ‘data speaks.’ – we collect big\ndata and do statistics. However, in this project, Qi and I found that historical\nresearch is not the same as scientific research.” The normalization of\nthe biomedical sciences as the primary pillar of medical knowledge production must be\ndismantled. Qi and Sunny, both new to the history of medicine, elegantly articulate\nthat, “historical research… is to alleviate the harm that has been done to those who are\nsilenced, not represented, and/or misrepresented.” By looking towards the humanities,\nbiomedical researchers and scientists may discover novel ways to approach their own work\nand discover new meanings. How does this exchange of perspectives impact the questions\nbiomedical scientists and researchers ask or the kinds of answers they accept? While Qi and Sunny’s project has opened a vital space for recognizing the contributions\nof Asian women at YSM, it also highlights the limitations of what archival research\nalone can reveal. Many stories remain partial, fragmented, or absent altogether due to\nthe historical silences in institutional records. Without deeper investment from Yale\nand other universities in sustaining oral histories, community archiving, and\nmultilingual collections, the histories of women of color in medicine will continue to\ngo underdocumented. Greater institutional support is needed not only to preserve what\nalready exists, but also to make room for new narratives. Another limitation stems from the broader context of racialization, colorism, and\ndiaspora, issues that were not directly addressed in this project, but which are central\nto any future work. The category of “Asian,” “women,” and “Asian women” are not\nmonolithic; they encompass wide-ranging national, ethnic, linguistic, and class\nexperiences, many of which intersect with racism and colorism both in the US and within\nAsian diasporic communities themselves. A critical history of the professionalization of\nAsian women in medicine must contend with these internal hierarchies and exclusions,\nrecognizing how migration, colonialism, and global inequality have shaped opportunities\ndifferently across groups. Finally, Qi and Sunny’s project emphasizes the importance of reflexivity in writing\nhistories of medicine. Who gets to tell these stories, and from what vantage point? As\nQi and Sunny themselves acknowledge, their work is only a beginning—an invitation to\nothers to continue, to complicate, and to correct. Their timeline and archival work lay\na crucial foundation, but much more remains to be done to fully capture the lived\nexperiences of Asian women in medicine and more broadly, of women of color in medicine.\nFor Yale and other institutions, the challenge will be to recognize history not as a\nstatic record but as an ongoing practice of care—one that demands resources,\naccountability, and a willingness to confront uncomfortable truths. The full transcript of the interview is available as supplementary material below. Supplementary Material Transcript of interview Transcript of interview with Qi Yan and Xuezhu (Sunny) Wang The authors would like to express their gratitude and appreciation to\nQi Yan and Sunny Wang for their partnership, care, and dedication to this project on the\nhistory of Asian women at the Yale School of Medicine. Qi Yan and Sunny Wang would like\nto thank Dr. Melissa Grafe for her guidance and mentorship on this passion project,\nhelping them narrow down their topic and providing them with both resources and\ncollections to view. Qi would also like to thank Dr. Sirikanya Chiraroekmongkon and Dr.\nEunice Yuen for their permission to share their personal stories and experiences. Sunny\nwould like to express gratitude to Dr. Mark D. Siegel and Dr. Shaili Gupta of the Yale\nTraditional Internal Medicine Residency Program for their advice, and to Dr. Maryam\nLustberg and Dr. Aarti Bhatia for their generosity in allowing them to share their\njourneys as women physicians of color. YSM Yale School of Medicine For more information on Qi and Sunny’s work, please view their preprint below: Yan\nQ. and Wang X. Asian Women Who Made History at Yale School of Medicine: Overcoming\nBarriers, Leading Initiatives, and Raising Their Voices [preprint]. May 15, 2025.\nAvailable from: https://doi.org/10.20944/preprints202505.1246.v1 Figure 1 Photograph depicting the portraits of women faculty displayed on\nthe second floor of Yale’s Sterling Hall of Medicine Figure 2 Asian Women at the Yale School of Medicine Timeline ",
  "metadata": {
    "Title of this paper": "Healing Histories and Breaking Barriers for Asian Women at the Yale School of\nMedicine",
    "Journal it was published in:": "The Yale Journal of Biology and Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466276/"
  }
}