{
  "title": "Paper_166",
  "abstract": "pmc Virchows Arch Virchows Arch 365 springeropen Virchows Archiv 0945-6317 1432-2307 pmc-is-collection-domain yes pmc-collection-title Springer PMC12488833 PMC12488833.1 12488833 12488833 40847225 10.1007/s00428-025-04213-3 4213 1 Original Article Pulmonary plasma cell disorders: histopathology, diagnosis, and clinical perspectives http://orcid.org/0000-0002-8023-3108 Pezzuto Federica federica.pezzuto@unipd.it Fiorentù Giordano Castelli Gioele Zanella Simone Giraudo Chiara Tinè Marianerica Calabrese Fiorella https://ror.org/00240q980 grid.5608.b 0000 0004 1757 3470 Department of cardiac, thoracic, vascular sciences and public health, University of Padova, 23 8 2025 2025 487 3 498144 573 586 8 4 2025 21 7 2025 29 7 2025 23 08 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Plasma cell disorders in the lungs include a broad range of conditions from benign reactive processes to malignant neoplasms. This article provides a comprehensive analysis of these diseases, focusing on their histopathological, immunohistochemical, and diagnostic characteristics. Four case studies illustrate the diagnostic challenges in distinguishing between reactive plasma cell infiltrates and neoplastic conditions. Key diagnostic tools, such as histological analysis and molecular techniques, are discussed to guide clinical evaluation. A systematic approach to diagnosis and management is mandatory for treatment decisions. Understanding the full spectrum of plasma cell abnormalities in the lung enables clinicians and pathologists to achieve accurate diagnoses and improve patient outcomes. Keywords Plasma cell disorders IgG4-related disease Multiple myeloma Plasmacytoma Light chain deposition disease Lung diseases pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction Plasma cell-associated lung disorders represent a diagnostically challenging spectrum of conditions, ranging from benign reactive infiltrates to malignant neoplasms [ 1 Case description Case 1 A 79-year-old non-smoker with a history of hypertensive heart disease, hyperuricemia, and type II diabetes was referred to our pulmonology unit after experiencing dyspnea and cough following the second dose of ChAdOx1 nCoV-19 SARS-CoV-2 vaccine. Laboratory tests revealed mild eosinophilia and lymphopenia, elevated lactate dehydrogenase, and normal C-reactive protein levels. He underwent a chest X-ray that demonstrated extensive pleural effusion and atelectasis on the left side. After pleural drainage, a computed tomography (CT) scan was performed which showed pleural thickening (Fig. 1 1 1 1 1 2 Fig. 1 Case 1: Radiological and histopathological features of IgG4-related pleural disease. The chest CT scan with contrast medium injection performed after drainage of the pleural effusion showed pleural thickening in the lower lobe (white arrowheads in a b c d e f g h i Case 2 A 67-year-old male, former smoker, with a medical history of bronchial asthma and ischemic heart disease (including prior STEMI), underwent routine imaging in 2016 which revealed a 2.5-cm solitary pulmonary nodule in the left upper lobe that showed high FDG uptake on PET/CT (Fig. 2 2 2 2 2 Fig. 2 Case 2: Radiological progression and histopathological confirmation of IgG4-RD. The [18F]-FDG PET/CT showed a pulmonary consolidation in the left upper lobe with high metabolic activity (white arrow in a b c d e f Case 3 This report discusses a 57-year-old female diagnosed with multiple myeloma (MM), with a focus on her pulmonary involvement that emerged several years after the initial diagnosis. The patient’s disease was first diagnosed in October 2015, when she presented with multiple areas of bone lytic lesions and a bone marrow biopsy revealing 50% plasma cell infiltration characterized by lambda light chain restriction. Following this, she underwent autologous stem cell transplantation in July 2016, which successfully reduced bone marrow plasma cell infiltration to 8%, as confirmed 6 months later. Despite achieving initial remission, the disease progressed in 2019, though remission was again achieved after further treatment. In December 2023, a subpleural nodule was identified at CT, and it also showed high FDG uptake at the subsequent PET/CT (Fig. 3 3 3 3 Fig. 3 Case 3: Histopathological and immunohistochemical findings in lung tissue and pleural effusion. Axial chest CT with lung window demonstrating the presence of a subpleural nodule in the left lower lobe (white arrow in a b c d e f g h h i j k l Case 4 A 34-year-old male, a lifelong non-smoker, presented with a complex clinical history including celiac disease and pigmented retinopathy. He had experienced bilateral pneumothorax on two separate occasions, 5 years apart. The patient also reported renal symptoms, including dysuria and polyuria, alongside a high-titer antinuclear antibody positivity of 1:1280. Following his second pneumothorax (Fig. 4 4 4 4 Fig. 4 Case 4: Histopathological features of pulmonary alterations. Coronal reconstruction with the lung window demonstrating the pneumothorax (white arrows in a a b c d e Diagnostic challenges The presented cases highlight the diverse spectrum of plasma cell-associated lung disorders, underscoring the diagnostic challenges previously discussed. Plasma cell infiltration, as demonstrated in these cases, can vary from benign conditions like IgG4-RD to malignant neoplasms such as MM (Table 1 3 Table 1 Differential diagnosis of plasma cell-related lung lesions Condition Clinical presentation Imaging findings Histopathology IHC/markers Key molecular/ancillary studies Treatment Prognosis IgG4-related disease Subacute onset; mild respiratory symptoms; lung nodules, pleural effusions Nodules, ILD, adenopathy Lymphoplasmacytic infiltrate, storiform fibrosis ↑ IgG4 +/IgG ratio; polyclonal light chains; CD138 +; Congo red − Not typically required Steroids, immunosuppression Good with treatment, relapse possible LCDD Cough, dyspnea, cystic disease Cysts, nodules, emphysema Perivascular eosinophilic deposits Monoclonal (kappa > λ Rare light chain rearrangement Targeted therapy Poor if untreated MM/plasmacytoma Dyspnea, systemic MM signs Masses, lytic bone lesions Monoclonal plasma cells CD138 +; monoclonal light chains; Congo red − FISH, IgH rearrangement Chemotherapy, transplant Variable CTD-ILD Cough, fatigue, extrapulmonary symptoms Basal ILD, reticulation, traction bronchiectasis Lymphoid infiltrates, fibrosis Polyclonal plasma cells; mixed B/T cells; Congo red − Not routinely required Immunosuppressants Variable, depends on subtype Immunodeficiency disorders Recurrent infections, lymphadenopathy Adenopathy, nodules Hyperplastic follicles, plasma cells Polyclonal plasma cells; follicular hyperplasia; Congo red − HIV test, flow cytometry Treat underlying cause Variable MALT lymphoma Cough, incidental finding, B symptoms Nodular consolidations, air bronchograms Centrocyte-like cells, lymphoepithelial lesions CD20 +, Bcl-2 +; light chain restriction; Congo red − IgH rearrangement, BIRC3-MALT1 fusion Radiotherapy, rituximab Indolent, good prognosis LPL Fatigue, IgM monoclonal gammopathy Diffuse infiltrates, nodules Small lymphocytes, plasma cells IgM +; MYD88 mutation; monoclonal light chains; Congo red − MYD88 L265P mutation Chemotherapy ± rituximab Indolent, may transform CD FISH IgH ILD CTD HIV MALT LPL LCDD MM Pulmonary nodular lymphoid hyperplasia (PNLH), lymphoid interstitial pneumonia (LIP), and FB are not considered plasmacytic diseases per se. These conditions are best classified as reactive lymphoid proliferations, often occurring in association with autoimmune diseases or immunodeficiency. However, given their occasional abundance of plasma cells, they may enter the histologic differential diagnosis of plasma cell-rich lung lesions and therefore merit discussion in this context [ 4 5 7 FB is characterized by the formation of lymphoid follicles within the walls of small airways, specifically bronchioles, and may present with mosaic attenuation, air trapping, or small airway thickening on CT [ 7 8 8 On the other hand, LIP is a more diffuse condition, characterized by the widespread infiltration of lymphocytes into the interstitium of the lung, including the bronchovascular bundles and interlobular septa [ 9 7 9 Legionella pneumophila Taken together, the four presented cases highlight the complexity of plasma cell-rich lung disorders. Case 1 and Case 2 emphasize the histological thresholds needed for diagnosing IgG4-RD, while Case 3 represents a clear example of a clonal neoplasm with systemic features. Case 4 illustrates the difficulties in confirming LCDD, especially in the absence of advanced proteomic studies. These examples demonstrate how a diagnostic algorithm (Fig. 5 Fig. 5 Integrated diagnostic approach to pulmonary plasma cell disorders. The flowchart outlines a diagnostic strategy incorporating clinical, radiological, histopathological, and immunohistochemical assessments. Key elements include evaluating plasma cell distribution, clonality, fibrosis, necrosis, and protein deposition, complemented by serological and molecular studies for definitive classification Importantly, not all plasma cell-rich lesions yield a definitive diagnosis despite exhaustive histological evaluation. As demonstrated in Case 4, tissue sampling limitations or the unavailability of specialized tools such as mass spectrometry can leave certain entitiesì presumptive rather than confirmed. Rather than diminish their educational value, these ambiguous cases emphasize the need for a systematic diagnostic approach and reinforce the critical role of multidisciplinary correlation in challenging scenarios. IgG4-RD IgG4-RD is a systemic fibroinflammatory condition that can affect virtually any organ in the body, with common sites including the pancreas, salivary glands, and orbit [ 10 11 12 12 13 12 13 Histopathologically, IgG4-RD is defined by a dense lymphoplasmacytic infiltrate rich in IgG4-positive plasma cells, storiform fibrosis, and often obliterative phlebitis [ 10 14 15 16 2 10 14 17 Differential diagnosis of IgG4-RD The histological and immunohistochemical findings in this case underscore the importance of identifying “hot spots” where lymphoplasmacytic infiltration is most prominent [ 14 18 14 6 1 1 Fig. 6 Histologic features of key differential diagnoses for IgG4-RD. This panel illustrates three key entities that may mimic IgG4-RD both histologically and clinically. Seventy-six-year-old male with persistent dry cough, dysphonia, and weight loss since March 2019. Chest CT with contrast revealed a lesion in the right upper lobe. Fine-needle biopsy showed a dense lymphoid infiltrate composed of small lymphocytes ( a b c d e f g h i j k l In certain plasma cell-rich lesions, particularly those associated with amyloid deposits, a confluent lymphoid infiltrate may raise suspicion for an underlying B-cell lymphoma with plasmacytic differentiation. These cases are diagnostically complex because plasma cells may demonstrate light chain restriction, while the B-cell component may not display overt aberrancy by IHC, especially in MALT lymphomas, which are typically CD5-negative and CD10-negative. In such settings, flow cytometry becomes an essential tool, as it enables the detection of clonal B-cell populations that are otherwise immunophenotypically silent. The utility of flow cytometry is particularly evident when plasmacytic differentiation obscures conventional histologic interpretation. Similarly, molecular analysis, such as IGH rearrangement studies, can provide confirmatory evidence of clonality. However, IGH gene rearrangement analysis identifies the presence of a clonal immunoglobulin-producing population but does not discriminate between clonal B lymphocytes and neoplastic plasma cells, as both cell types arise from the same lineage. Consequently, a monoclonal IGH rearrangement may be observed in either B-cell lymphomas or in plasma cell neoplasms [ 18 Moreover, IgG4-RD shares histopathological overlap with multicentric Castleman disease [ 20 IgG4-RD is most commonly observed in middle-aged to older adults, with a slight male predominance, as in this case [ 10 11 10 21 10 21 A key diagnostic challenge in plasma cell-rich lung lesions lies in distinguishing reactiveness from neoplastic infiltrates (Table 1 22 23 24 3 Recent studies indicate that IgG4-RD may function as a paraneoplastic phenomenon, particularly in malignancies such as pancreatic, pulmonary, and gastric carcinomas [ 25 26 Finally, in regions with endemic parasitic infections, parasitic diseases such as schistosomiasis, filariasis, or toxocariasis should be considered as differential diagnoses, particularly in patients with a relevant travel or exposure history. Both diseases can present with eosinophilia, lymphoplasmacytic infiltration, and chronic tissue damage leading to fibrosis [ 27 28 Plasma cell neoplasms and associated disorders A central consideration in the evaluation of plasma cell-rich lung lesions is the possibility of an underlying plasma cell neoplasm, most notably multiple myeloma (MM) and solitary plasmacytoma [ 19 These conditions represent the neoplastic end of the plasma cell disease spectrum and may manifest as pulmonary masses, nodules, or diffuse infiltrates. While MM is a systemic disease defined by clonal bone marrow plasma cells ≥ 10% and associated end-organ damage (e.g., anemia, hypercalcemia, lytic bone lesions), plasmacytoma refers to a localized clonal proliferation of plasma cells without bone marrow involvement or systemic features. In cases where no prior hematologic diagnosis exists, a pulmonary biopsy showing a monoclonal plasma cell infiltrate should prompt a comprehensive systemic workup. This includes serum protein electrophoresis (SPEP), immunofixation, free light chain assay, and bone marrow biopsy to assess for systemic disease. Imaging studies such as PET/CT or skeletal survey may help identify occult osseous lesions. IHC (e.g., CD138, kappa/lambda light chains) and molecular studies (e.g., FISH for IGH rearrangement, 13q deletion, or 1q gain) further support clonality and aid in classification. Importantly, conditions such as LCDD and AL-type amyloidosis often reflect underlying plasma cell dyscrasias, even in the absence of overt lung involvement, and must be carefully evaluated in this context. Although plasma cell neoplasms rarely involve the lungs directly, when they do, they can manifest as plasmacytomas, masses of neoplastic plasma cells in the lung parenchyma or pleura. In MM, for instance, pulmonary involvement typically arises in the context of disseminated disease, with plasmacytomas being the predominant form of lung infiltration [ 4 5 4 5 MALT lymphoma and LPL are indolent B-cell lymphomas that can present with pulmonary involvement and are often considered in the differential diagnosis of plasma cell-rich infiltrates. MALT lymphoma typically presents as nodular or consolidative lesions in the lung and histologically shows small B cells, marginal zone cells, and plasmacytic differentiation, often with lymphoepithelial lesions. LPL, in contrast, involves the lung less frequently and is usually associated with IgM paraproteinemia and bone marrow involvement. IHC and molecular studies, including detection of monoclonality and MYD88 mutations, help distinguish these entities [ 18 LCDD in the lung: a pulmonary manifestation of plasma cell neoplasms LCDD is a rare systemic disorder characterized by the deposition of monoclonal immunoglobulin light chains, most commonly of the kappa subtype, in various organs. While the kidneys are most frequently affected, the lungs can also be involved, though less commonly [ 29 30 30 30 30 LCDD and AL-type amyloidosis both involve the deposition of monoclonal immunoglobulin light chains but differ histologically and ultrastructurally [ 31 29 32 33 MM can also cause pulmonary involvement, either through plasmacytomas or diffuse parenchymal infiltration, but systemic findings such as bone lesions and hypercalcemia help differentiate it from LCDD [ 34 35 36 37 38 Pulmonary amyloidosis: AL-type and beyond Amyloidosis is a systemic or localized disorder characterized by extracellular deposition of misfolded protein in β-pleated sheet conformation. In the lungs, amyloid can be present in one of three patterns: tracheobronchial, nodular, or diffuse alveolar-septal amyloidosis [ 39 39 6 33 39 Crystal-storing histiocytosis (CSH) Another rare pulmonary manifestation of plasma cell and lymphoproliferative disorders is CSH [ 40 41 40 41 Conclusion Given the broad spectrum of plasma cell-related lung conditions, from benign reactive infiltrates to malignant neoplasms and deposition diseases, a thorough diagnostic approach is essential (Fig. 5 6 6 7 8 9 6 In conclusion, the integration of a structured algorithm, as proposed in Fig. 5 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors thank Dr. Judith Wilson for English revision. Author contribution FP performed study concept and design; FP and FC performed development of methodology and writing, review, and revision of the paper; CG, GCa, GF, and MT provided acquisition, analysis and interpretation of data, and statistical analysis. All authors read and approved the final paper. Data availability Data sharing is not applicable to this article, as no datasets were generated or analyzed during the current study. Declarations Ethics approval and consent to participate The study was performed in accordance with the Declaration of Helsinki. Informed consent was obtained from the patients. Competing interests The authors declare no competing interests. References 1. Campbell SN Rubio E Loschner AL Clinical review of pulmonary manifestations of IgG4-related disease Ann Am Thorac Soc 2014 11 1466 1475 10.1513/AnnalsATS.201403-128FR 25422997 Campbell SN, Rubio E, Loschner AL (2014) Clinical review of pulmonary manifestations of IgG4-related disease. Ann Am Thorac Soc 11:1466–1475. 10.1513/AnnalsATS.201403-128FR 25422997 10.1513/AnnalsATS.201403-128FR 2. Umehara H Okazaki K Kawa S The 2020 revised comprehensive diagnostic (RCD) criteria for IgG4-RD Mod Rheumatol 2021 31 529 533 10.1080/14397595.2020.1859710 33274670 Umehara H, Okazaki K, Kawa S et al (2021) The 2020 revised comprehensive diagnostic (RCD) criteria for IgG4-RD. Mod Rheumatol 31:529–533. 10.1080/14397595.2020.1859710 33274670 10.1080/14397595.2020.1859710 3. Mukhopadhyay S Differential diagnosis of IgG4-positive plasma cells in the lung Semin Diagn Pathol 2024 41 72 78 10.1053/j.semdp.2023.11.006 37993385 Mukhopadhyay S (2024) Differential diagnosis of IgG4-positive plasma cells in the lung. Semin Diagn Pathol 41:72–78 37993385 10.1053/j.semdp.2023.11.006 4. Nie D-L, Shi Y-H, Li X-M et al (2025) Clinical and imaging features of pulmonary nodular lymphoid hyperplasia. J Thorac Imaging 40. 10.1097/RTI.0000000000000799 10.1097/RTI.0000000000000799 39129435 5. Yell M Rosado FG Pulmonary nodular lymphoid hyperplasia Arch Pathol Lab Med 2019 143 1149 1153 10.5858/arpa.2018-0188-RS 30720334 Yell M, Rosado FG (2019) Pulmonary nodular lymphoid hyperplasia. Arch Pathol Lab Med 143:1149–1153. 10.5858/arpa.2018-0188-RS 30720334 10.5858/arpa.2018-0188-RS 6. Fang L Xu J Wang L Pulmonary nodular lymphoid hyperplasia: a rare benign disease with malignant mask Ann Transl Med 2019 7 43 43 10.21037/atm.2018.12.59 30906747 PMC6389570 Fang L, Xu J, Wang L et al (2019) Pulmonary nodular lymphoid hyperplasia: a rare benign disease with malignant mask. Ann Transl Med 7:43–43. 10.21037/atm.2018.12.59 30906747 10.21037/atm.2018.12.59 PMC6389570 7. Fraune C, Churg A, Yi ES et al (2023) Lymphoid interstitial pneumonia (LIP) revisited a critical reappraisal of the histologic spectrum of “radiologic” and “pathologic” LIP in the context of diffuse benign lymphoid proliferations of the lung 10.1097/PAS.0000000000002014 36597787 8. Tashtoush B Follicular bronchiolitis: a literature review J Clin Diagn Res 2015 10.7860/JCDR/2015/13873.6496 26500941 PMC4606270 Tashtoush B (2015) Follicular bronchiolitis: a literature review. J Clin Diagn Res. 10.7860/JCDR/2015/13873.6496 26500941 10.7860/JCDR/2015/13873.6496 PMC4606270 9. Cha S-I Fessler MB Cool CD Lymphoid interstitial pneumonia: clinical features, associations and prognosis Eur Respir J 2006 28 364 369 10.1183/09031936.06.00076705 16571614 Cha S-I, Fessler MB, Cool CD et al (2006) Lymphoid interstitial pneumonia: clinical features, associations and prognosis. Eur Respir J 28:364–369. 10.1183/09031936.06.00076705 16571614 10.1183/09031936.06.00076705 10. https://tumourclassification.iarc.who.int/chaptercontent/63/285 11. Liu J Liu Y Shen X Clinicopathological characteristics of IgG4-related lung disease BMC Pulm Med 2021 10.1186/s12890-021-01781-3 34911521 PMC8672518 Liu J, Liu Y, Shen X et al (2021) Clinicopathological characteristics of IgG4-related lung disease. BMC Pulm Med. 10.1186/s12890-021-01781-3 34911521 10.1186/s12890-021-01781-3 PMC8672518 12. Zen Y Inoue D Kitao A IgG4-related lung and pleural disease: a clinicopathologic study of 21 cases Am J Surg Pathol 2009 33 1886 1893 10.1097/PAS.0b013e3181bd535b 19898222 Zen Y, Inoue D, Kitao A et al (2009) IgG4-related lung and pleural disease: a clinicopathologic study of 21 cases. Am J Surg Pathol 33:1886–1893. 10.1097/PAS.0b013e3181bd535b 19898222 10.1097/PAS.0b013e3181bd535b 13. Dragos C Joseph C Elwell H Pulmonary manifestations, treatments and outcomes of IgG4-related disease–a systematic literature review Rheumatol Int 2024 44 1875 1886 10.1007/s00296-024-05611-7 38769126 PMC11393110 Dragos C, Joseph C, Elwell H et al (2024) Pulmonary manifestations, treatments and outcomes of IgG4-related disease–a systematic literature review. Rheumatol Int 44:1875–1886. 10.1007/s00296-024-05611-7 38769126 10.1007/s00296-024-05611-7 PMC11393110 14. Deshpande V Zen Y Chan JK Consensus statement on the pathology of IgG4-related disease Mod Pathol 2012 25 1181 1192 10.1038/modpathol.2012.72 22596100 Deshpande V, Zen Y, Chan JK et al (2012) Consensus statement on the pathology of IgG4-related disease. Mod Pathol 25:1181–1192. 10.1038/modpathol.2012.72 22596100 10.1038/modpathol.2012.72 15. Cheuk W Chan JKC IgG4-related sclerosing disease Adv Anat Pathol 2010 17 303 332 10.1097/PAP.0b013e3181ee63ce 20733352 Cheuk W, Chan JKC (2010) IgG4-related sclerosing disease. Adv Anat Pathol 17:303–332. 10.1097/PAP.0b013e3181ee63ce 20733352 10.1097/PAP.0b013e3181ee63ce 16. Zen Y, Inoue D, Kitao A et al (2009) IgG4-related lung and pleural disease: a clinicopathologic study of 21 cases 10.1097/PAS.0b013e3181bd535b 19898222 17. Wallace ZS Naden RP Chari S The 2019 American college of rheumatology/European league against rheumatism classification criteria for IgG4-related disease Ann Rheum Dis 2020 79 77 87 10.1136/annrheumdis-2019-216561 31796497 Wallace ZS, Naden RP, Chari S et al (2020) The 2019 American college of rheumatology/European league against rheumatism classification criteria for IgG4-related disease. Ann Rheum Dis 79:77–87. 10.1136/annrheumdis-2019-216561 31796497 10.1136/annrheumdis-2019-216561 18. Fraune C Tazelaar HD Butt YM Usefulness and limitations of current diagnostic strategies for pulmonary mucosa–associated lymphoid tissue lymphoma lessons learned from a large cohort Arch Pathol Lab Med 2024 148 419 429 10.5858/arpa.2022-0521-OA 37594899 Fraune C, Tazelaar HD, Butt YM et al (2024) Usefulness and limitations of current diagnostic strategies for pulmonary mucosa–associated lymphoid tissue lymphoma lessons learned from a large cohort. Arch Pathol Lab Med 148:419–429. 10.5858/arpa.2022-0521-OA 37594899 10.5858/arpa.2022-0521-OA 19. Mochizuki H Kato M Higuchi T Overlap of IgG4-related disease and multicentric Castleman’s disease in a patient with skin lesions Intern Med 2017 56 1095 1099 10.2169/internalmedicine.56.8013 28458319 PMC5478574 Mochizuki H, Kato M, Higuchi T et al (2017) Overlap of IgG4-related disease and multicentric Castleman’s disease in a patient with skin lesions. Intern Med 56:1095–1099. 10.2169/internalmedicine.56.8013 28458319 10.2169/internalmedicine.56.8013 PMC5478574 20. Perugino CA Stone JH IgG4-related disease: an update on pathophysiology and implications for clinical care Nat Rev Rheumatol 2020 16 702 714 10.1038/s41584-020-0500-7 32939060 Perugino CA, Stone JH (2020) IgG4-related disease: an update on pathophysiology and implications for clinical care. Nat Rev Rheumatol 16:702–714 32939060 10.1038/s41584-020-0500-7 21. Craig FE A practical approach to the evaluation of lymphoid and plasma cell infiltrates in the lung Surg Pathol Clin 2010 3 129 154 10.1016/j.path.2010.03.009 26839030 Craig FE (2010) A practical approach to the evaluation of lymphoid and plasma cell infiltrates in the lung. Surg Pathol Clin 3:129–154. 10.1016/j.path.2010.03.009 26839030 10.1016/j.path.2010.03.009 22. Allen HC, Sharma P (2025) Histology, plasma cells 32310542 23. Agrawal S Chaudhary P Rajput A Jain A Pulmonary plasmacytoma with endobronchial extension: a rare presentation of solitary extramedullary plasmacytoma: a case report and brief review of literature J Cancer Res Ther 2015 11 1026 10.4103/0973-1482.150350 26881595 Agrawal S, Chaudhary P, Rajput A, Jain A (2015) Pulmonary plasmacytoma with endobronchial extension: a rare presentation of solitary extramedullary plasmacytoma: a case report and brief review of literature. J Cancer Res Ther 11:1026. 10.4103/0973-1482.150350 26881595 10.4103/0973-1482.150350 24. Li J Zhang W Malignancies and immunoglobulin G4-related disease Rheumatology & Autoimmunity 2025 10.1002/rai2.12157 Li J, Zhang W (2025) Malignancies and immunoglobulin G4-related disease. Rheumatology & Autoimmunity. 10.1002/rai2.12157 25. Fujii Y Doi M Yamane H Occurrence of immunoglobulin G4-related disease during chemotherapy for advanced breast cancer Intern Med 2020 59 1649 1654 10.2169/internalmedicine.3386-19 32269187 PMC7402958 Fujii Y, Doi M, Yamane H et al (2020) Occurrence of immunoglobulin G4-related disease during chemotherapy for advanced breast cancer. Intern Med 59:1649–1654. 10.2169/internalmedicine.3386-19 32269187 10.2169/internalmedicine.3386-19 PMC7402958 26. Nambiar S, Oliver TI (2025) IgG4-related disease 29763000 27. Stone JH Zen Y Deshpande V IgG4-related disease N Engl J Med 2012 366 539 551 10.1056/NEJMra1104650 22316447 Stone JH, Zen Y, Deshpande V (2012) IgG4-related disease. N Engl J Med 366:539–551. 10.1056/NEJMra1104650 22316447 10.1056/NEJMra1104650 28. Bladé J Beksac M Caers J Extramedullary disease in multiple myeloma: a systematic literature review Blood Cancer J 2022 12 45 10.1038/s41408-022-00643-3 35314675 PMC8938478 Bladé J, Beksac M, Caers J et al (2022) Extramedullary disease in multiple myeloma: a systematic literature review. Blood Cancer J 12:45. 10.1038/s41408-022-00643-3 35314675 10.1038/s41408-022-00643-3 PMC8938478 29. Cassano Cassano R Bonadio AG Del Giudice ML Light chain deposition disease: pathogenesis, clinical characteristics and treatment strategies Ann Hematol 2024 10.1007/s00277-024-05911-9 39196376 PMC12052853 Cassano Cassano R, Bonadio AG, Del Giudice ML et al (2024) Light chain deposition disease: pathogenesis, clinical characteristics and treatment strategies. Ann Hematol. 10.1007/s00277-024-05911-9 39196376 10.1007/s00277-024-05911-9 PMC12052853 30. Lestelle F Beigelman C Rotzinger D Phenotypes and outcome of diffuse pulmonary non-amyloid light chain deposition disease Respir Res 2024 25 159 10.1186/s12931-024-02798-y 38600600 PMC11005206 Lestelle F, Beigelman C, Rotzinger D et al (2024) Phenotypes and outcome of diffuse pulmonary non-amyloid light chain deposition disease. Respir Res 25:159. 10.1186/s12931-024-02798-y 38600600 10.1186/s12931-024-02798-y PMC11005206 31. Wei P Tao R Liu Y Pulmonary light chain deposition disease: a case series and literature review Ann Transl Med 2020 8 588 588 10.21037/atm-20-2708 32566615 PMC7290530 Wei P, Tao R, Liu Y et al (2020) Pulmonary light chain deposition disease: a case series and literature review. Ann Transl Med 8:588–588. 10.21037/atm-20-2708 32566615 10.21037/atm-20-2708 PMC7290530 32. Colombat M Gounant V Mal H Light chain deposition disease involving the airways: diagnosis by fibreoptic bronchoscopy Eur Respir J 2007 29 1057 1060 10.1183/09031936.00134406 17470625 Colombat M, Gounant V, Mal H et al (2007) Light chain deposition disease involving the airways: diagnosis by fibreoptic bronchoscopy. Eur Respir J 29:1057–1060. 10.1183/09031936.00134406 17470625 10.1183/09031936.00134406 33. Kunnath-Velayudhan S, Larsen BT, Coley SM et al (2020) Masson trichrome and sulfated alcian blue stains distinguish light chain deposition disease from amyloidosis in the lung 10.1097/PAS.0000000000001593 33002919 34. Kumar S Mazloom A Carter M Extramedullary pulmonary manifestations of relapsed/refractory multiple myeloma: a case series and brief review of the literature J Respir 2024 4 177 187 10.3390/jor4030016 Kumar S, Mazloom A, Carter M et al (2024) Extramedullary pulmonary manifestations of relapsed/refractory multiple myeloma: a case series and brief review of the literature. J Respir 4:177–187. 10.3390/jor4030016 35. Jain A Haynes R Kothari J Pathophysiology and management of monoclonal gammopathy of renal significance Blood Adv 2019 3 2409 2423 10.1182/bloodadvances.2019031914 31409583 PMC6693003 Jain A, Haynes R, Kothari J et al (2019) Pathophysiology and management of monoclonal gammopathy of renal significance. Blood Adv 3:2409–2423. 10.1182/bloodadvances.2019031914 31409583 10.1182/bloodadvances.2019031914 PMC6693003 36. Sanguedolce F Zanelli M Zizzo M Primary pulmonary B-cell lymphoma: a review and update Cancers (Basel) 2021 13 415 10.3390/cancers13030415 33499258 PMC7865219 Sanguedolce F, Zanelli M, Zizzo M et al (2021) Primary pulmonary B-cell lymphoma: a review and update. Cancers (Basel) 13:415. 10.3390/cancers13030415 33499258 10.3390/cancers13030415 PMC7865219 37. Tripathy S The role of serum protein electrophoresis in the detection of multiple myeloma: an experience of a corporate hospital J Clin Diagn Res 2012 10.7860/JCDR/2012/4213.2532 23285429 PMC3527769 Tripathy S (2012) The role of serum protein electrophoresis in the detection of multiple myeloma: an experience of a corporate hospital. J Clin Diagn Res. 10.7860/JCDR/2012/4213.2532 23285429 10.7860/JCDR/2012/4213.2532 PMC3527769 38. Chen LYC Mattman A Seidman MA Carruthers MN IgG4-related disease: what a hematologist needs to know Haematologica 2019 104 444 455 10.3324/haematol.2018.205526 30705099 PMC6395313 Chen LYC, Mattman A, Seidman MA, Carruthers MN (2019) IgG4-related disease: what a hematologist needs to know. Haematologica 104:444–455. 10.3324/haematol.2018.205526 30705099 10.3324/haematol.2018.205526 PMC6395313 39. Riehani A Soubani AO The spectrum of pulmonary amyloidosis Respir Med 2023 10.1016/j.rmed.2023.107407 37696313 Riehani A, Soubani AO (2023) The spectrum of pulmonary amyloidosis. Respir Med. 10.1016/j.rmed.2023.107407 37696313 10.1016/j.rmed.2023.107407 40. Kanagal-Shamanna R Xu-Monette ZY Miranda RN Crystal-storing histiocytosis: a clinicopathological study of 13 cases Histopathology 2016 68 482 491 10.1111/his.12768 26118455 PMC4704983 Kanagal-Shamanna R, Xu-Monette ZY, Miranda RN et al (2016) Crystal-storing histiocytosis: a clinicopathological study of 13 cases. Histopathology 68:482–491. 10.1111/his.12768 26118455 10.1111/his.12768 PMC4704983 41. Mobarki M Papoudou-Bai A Dumollard JM Crystal-storing histiocytosis: the iceberg of more serious conditions Diagnostics 2023 10.3390/diagnostics13020271 36673081 PMC9858286 Mobarki M, Papoudou-Bai A, Dumollard JM et al (2023) Crystal-storing histiocytosis: the iceberg of more serious conditions. Diagnostics. 10.3390/diagnostics13020271 36673081 10.3390/diagnostics13020271 PMC9858286 ",
  "metadata": {
    "Title of this paper": "Crystal-storing histiocytosis: the iceberg of more serious conditions",
    "Journal it was published in:": "Virchows Archiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488833/"
  }
}