{
  "title": "Paper_354",
  "abstract": "pmc Endoscopy Endoscopy 3405 thiemesd Endoscopy Endoscopy 0013-726X 1438-8812 pmc-is-collection-domain yes pmc-collection-title Thieme Open Access PMC12483602 PMC12483602.1 12483602 12483602 41027470 10.1055/a-2695-4427 E-Videos-2025-07-6385-EV 1 E-Videos Clinical utility of long cap-assisted suction: two cases of food bolus and intraprocedural clot removal http://orcid.org/0000-0003-1226-7872 Doba Nobutaka MD Shibayama Kosuke Dr. Abe Shinzo Dr. Sakuma Daiki Dr. Someya Masanobu Dr. Komatsu Kazuto Dr. Maeda Shin 1 36998 Department of Gastroenterology, Yokosuka City Hospital, Yokosuka, Japan 2 Department of Gastroenterology, Yokohama City University Graduate School of Medicine, Yokohama, Japan Correspondence Department of Gastroenterology, Yokosuka City Hospital 1-3-2 Nagasaka Yokosuka, Kanagawa 240-0195 Japan dbftriver11@gmail.com 30 9 2025 12 2025 57 Suppl 1 498026 E1119 E1120 01 09 2025 01 10 2025 02 10 2025 The Author(s). This is an open access article published by Thieme under the terms of the Creative Commons Attribution License, permitting unrestricted use, distribution, and reproduction so long as the original work is properly cited. (https://creativecommons.org/licenses/by/4.0/). 2025 The Author(s). https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is properly cited. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Cap-assisted suction techniques have been described for food bolus extraction and foreign body removal 1 2 3 Fig. 1 Fig. 1 Left: Normal cap (M-201-11804; outer diameter 12.1 mm; tip protrusion length 4 mm;\nOlympus, Tokyo, Japan). Right: Long cap (MH-463; outer diameter 13.5 mm; tip protrusion\nlength 12 mm; Olympus). Case 1: A 93-year-old woman presented with complete esophageal obstruction caused by a large food bolus ( Fig. 2 a Fig. 2 b Fig. 2 c Video 1 Fig. 2 d Fig. 2 Case 1 images. a b c d Case 2: A 52-year-old man undergoing gastric endoscopic submucosal dissection (ESD)\nexperienced spurting hemorrhage ( Fig. 3 a, b Video 1 Fig. 3 c, d Clinical utility of long cap-assisted suction. Video 1 Fig. 3 Case 2 images. a b c d Compared with conventional pull-based retrieval or external suction methods 4 5 This method is particularly advantageous in emergency settings or during therapeutic procedures when time and visibility are critical. It offers a safe, cost-effective solution for difficult bolus or clot removal and may be integrated into routine endoscopy practice. Endoscopy_UCTN_Code_TTT_1AO_2AD\nEndoscopy_UCTN_Code_TTT_1AO_2AL Endoscopy E-Videos https://eref.thieme.de/e-videos E-Videos Endoscopy HINARI https://www.research4life.org/access/eligibility/ https://mc.manuscriptcentral.com/e-videos Acknowledgement We would like to thank Editage (www.editage.com) for providing English language editing services. Conflict of Interest Contributorsʼ Statement References 1 Ooi M Duong T Holman R Comparison of cap-assisted vs conventional endoscopic technique for management of food bolus impaction in the esophagus: results of a multicenter randomized controlled trial Am J Gastroenterol 2021 116 2235 2240 10.14309/ajg.0000000000001484 34543257 2 Mohan BP Bapaye J Hamaad Rahman S Cap-assisted endoscopic treatment of esophageal food bolus impaction and/or foreign body ingestion: a systematic review and meta-analysis Ann Gastroenterol 2022 35 584 591 10.20524/aog.2022.0749 36406971 PMC9648521 3 Wahba M Habib G Mazny AE Cap-assisted technique versus conventional methods for esophageal food bolus extraction: a comparative study Clin Endosc 2019 52 458 463 10.5946/ce.2019.042 31280526 PMC6785424 4 Mahmood S Tazinkeng N Holzwanger EA Enhanced suction for removal of esophageal food impaction VideoGIE 2023 8 298 300 10.1016/j.vgie.2023.05.004 37575135 PMC10422076 5 Sobani ZA Paleti S Malesich T Enhanced suction during esophagogastroduodenoscopy Am J Gastroenterol 2021 116 872 10.14309/ajg.0000000000001025 33177343 ",
  "metadata": {
    "Title of this paper": "Enhanced suction during esophagogastroduodenoscopy",
    "Journal it was published in:": "Endoscopy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483602/"
  }
}