{
  "title": "Paper_523",
  "abstract": "Hosp Pharm Hosp Pharm 2261 hosppharm HPX Hospital Pharmacy 0018-5787 1945-1253 SAGE Publications PMC11418683 PMC11418683.1 11418683 11418683 39318739 10.1177/00185787241237131 10.1177_00185787241237131 1 Original Research Articles Significant Published Articles in 2023 for Pharmacy Nutrition Support Practice https://orcid.org/0000-0002-2086-6317 Dickerson Roland N. 1 Bingham Angela L. 2 https://orcid.org/0000-0002-2704-5749 Canada Todd W. 3 Chan Lingtak Neander 4 Cober M. Petrea 5 Cogle Sarah V. 6 Tucker Anne M. 3 https://orcid.org/0000-0002-3390-3869 Kumpf Vanessa J. 6 1 2 3 4 5 6 Roland N. Dickerson, University of Tennessee Health Science Center College of Pharmacy, 881 Madison Avenue, Suite 345, Memphis, TN 38163, USA. Email: rdickerson@uthsc.edu The author(s) declared the following potential conflicts of interest with respect to the research, authorship, and/or publication of this article: Drs. Dickerson and Bingham have no conflicts of interest. Dr. Canada is on the speaker’s bureau and consultant for Fresenius Kabi. Dr. Chan is a consultant for Baxter healthcare. Dr. Cober is a consultant for BBraun/CAPS, Baxter, Fresenius-Kabi, and Wolters-Kluwer and speaker for Fresenius-Kabi. Dr. Tucker is a consultant for Up to Date, Inc. Dr. Kumpf is a consultant for Fresenius Kabi, Baxter, and VectivBio. 5 3 2024 10 2024 59 5 471294 568 574 01 10 2025 01 10 2025 24 09 2024 01 10 2025 © The Author(s) 2024 2024 SAGE Publications Purpose: Methods: Results: Conclusion: fluid and electrolyte disorders gastrointestinal disorders intravenous therapy nutrition nutritional support pharmacists education pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts1 ",
  "metadata": {
    "Title of this paper": "Significant Published Articles in 2023 for Pharmacy Nutrition Support Practice",
    "Journal it was published in:": "Hospital Pharmacy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11418683/"
  }
}