{
  "title": "Paper_519",
  "abstract": "Am J Pathol Am J Pathol 338 amjpathol The American Journal of Pathology 0002-9440 1525-2191 American Society for Investigative Pathology PMC11423761 PMC11423761.1 11423761 11423761 39032604 10.1016/j.ajpath.2024.06.004 S0002-9440(24)00235-9 1 Review Influenza, SARS-CoV-2, and Their Impact on Chronic Lung Diseases and Fibrosis Exploring Therapeutic Options Soni Sourabh ∗ Antonescu Laura ∗ Ro Kaylin † Horowitz Jeffrey C. ∗ Mebratu Yohannes A. yohannes.mebratu@osumc.edu ∗ ∗ Nho Richard S. richard.nho@osumc.edu ∗ ∗∗ ∗ † ∗ yohannes.mebratu@osumc.edu ∗∗ richard.nho@osumc.edu 10 2024 194 10 471426 1807 1822 26 6 2024 01 10 2025 01 10 2025 01 10 2024 01 10 2025 © 2024 American Society for Investigative Pathology. Published by Elsevier Inc. All rights are reserved, including those for text and data mining, AI training, and similar technologies. 2024 American Society for Investigative Pathology Respiratory tract infections represent a significant global public health concern, disproportionately affecting vulnerable populations such as children, the elderly, and immunocompromised individuals. RNA viruses, particularly influenza viruses and coronaviruses, significantly contribute to respiratory illnesses, especially in immunosuppressed and elderly individuals. Influenza A viruses (IAVs) and severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) continue to pose global health threats due to their capacity to cause annual epidemics, with profound implications for public health. In addition, the increase in global life expectancy is influencing the dynamics and outcomes of respiratory viral infections. Understanding the molecular mechanisms by which IAVs and SARS-CoV-2 contribute to lung disease progression is therefore crucial. The aim of this review is to comprehensively explore the impact of IAVs and SARS-CoV-2 on chronic lung diseases, with a specific focus on pulmonary fibrosis in the elderly. It also outlines potential preventive and therapeutic strategies and suggests directions for future research. Graphical abstract pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Influenza, SARS-CoV-2, and Their Impact on Chronic Lung Diseases and Fibrosis",
    "Journal it was published in:": "The American Journal of Pathology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11423761/"
  }
}