{
  "title": "Paper_585",
  "abstract": "pmc Health Serv Insights Health Serv Insights 2508 hsi HIS Health Services Insights 1178-6329 SAGE Publications PMC12477393 PMC12477393.1 12477393 12477393 41031133 10.1177/11786329251378546 10.1177_11786329251378546 1 Original Research Health-Related Quality of Life and Associated Factors Among Patients with Stroke at Tertiary Care Hospital Nepal https://orcid.org/0000-0003-4353-382X Marasine Nirmal Raj 1 Panthi Saru 1 Sankhi Sabina 2 1 2 Nirmal Raj Marasine, Department of Pharmacy, CiST College, Sangam Chowk, Baneshwor, Kathmandu 44600, Nepal. Email: nirmalmarasine@gmail.com 28 9 2025 2025 18 478144 11786329251378546 9 5 2025 29 8 2025 28 09 2025 30 09 2025 01 10 2025 © The Author(s) 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Background: Stroke is a leading cause of long-term disability, significantly impacting health-related quality of life (HRQoL). However, evidence from Nepal remains limited. Objective: This study aimed to assess HRQoL and identify its associated factors among stroke patients in a tertiary care hospital in Nepal. Design: Cross-sectional study Methods: This study was conducted at the Annapurna Neurological Institute and Allied Sciences (ANIAS) between November 2023 and April 2024 among 120 stroke patients aged ⩾18 years. Baseline data were collected using a semi-structured questionnaire, and HRQoL was assessed using the EuroQol 5-Dimension 5-Level (EQ-5D-5L) scale. Statistical analyses included descriptive statistics, bivariate analyses, and multiple linear regression to identify factors associated with HRQoL. A p Results: The mean HRQoL score was 21.13 ± 6.62, indicating substantial impairment, particularly in usual activities (Mean ± SD: 4.32 ± 1.32), self-care (4.26 ± 1.34), and mobility (4.22 ± 1.32). Lower HRQoL was significantly associated with older age, unemployment, lower educational attainment, and moderate to severe stroke-related disability ( p Conclusion: HRQoL is significantly impacted by stroke, with major impairments in usual activities, self-care, and mobility, influenced by both socio-demographic and clinical factors. Implementing targeted, multidimensional rehabilitation strategies such as structured physiotherapy is essential to enhance recovery and improve the quality of life in this population. Health-related quality of life Nepal Neurology Stroke Tertiary care hospital pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Introduction Stroke is a major global health challenge and remains one of the leading causes of death and long-term disability worldwide. 1 2  3  4  5 Approximately 80% of stroke-related deaths occur in low- and middle-income countries (LMICs), where limited healthcare infrastructure and resources create substantial barriers to effective stroke management and rehabilitation.  6  7 8 9 While the majority of strokes in Nepal are ischemic, caused by blockage of cerebral blood vessels, nearly one-third are hemorrhagic, resulting from intracranial bleeding.  3  10 11 12 Despite the rising burden of stroke in Nepal, there is a dearth of studies on HRQoL among stroke patients. Previous studies have identified a range of factors associated with HRQoL, including demographic variables such as age, gender, education, and income, clinical characteristics like stroke severity, side of lesion, degree of disability, comorbidities such as diabetes, hypertension, dyslipidemia, and psychosocial determinants like social support and depression. 13 15 Therefore, this study aims to assess HRQoL and its associated factors among stroke patients receiving care at a tertiary care hospital in Nepal. By addressing this critical gap in the literature, the study seeks to support the development of policy recommendations and provides actionable insights for clinicians and healthcare policymakers. Ultimately, these efforts are vital for strengthening stroke care and rehabilitation services in resource-limited settings, thereby reducing the national burden of stroke and improving patient outcomes. Methods Study Design and Setting A hospital-based cross-sectional study was conducted among stroke patients at the Annapurna Neurological Institute and Allied Sciences (ANIAS),  16 Selection Criteria All patients of either gender aged ⩾18 years with a confirmed diagnosis of stroke (radiological evidence from a CT scan and/or MRI), and an identified primary caregiver aged above 18 years, were included during their inpatient stay. Patients who were unable to communicate directly (such as those with dementia or aphasia), unwilling to participate, uncooperative, or diagnosed with terminal illnesses such as end-stage cancer or renal failure were excluded from the study. Sample Size and Sampling Procedure According to the hospital administration, an average of 50 stroke patients is admitted monthly. With a data collection period of 3 months, a total of 150 stroke patients were included in the study population. Using Yamane’s formula for sample size calculation with a finite population, the sample size was determined as follows: n = N/(1 + N × e²), where N represents the total population (150), and e  2 Data Collection A semi-structured questionnaire was used for data collection. Patients were identified by reviewing the Kardex, and their inclusion was verified through communication with nurses and doctors. The Kardex is a tool that provides concise access to patient information, including demographic details, diagnosis, medications, health status, treatment schedules, activities, and care plans.  17 Data on sociodemographic characteristics, disability, and health-related quality of life were collected through face-to-face interviews conducted during the hospital stay, lasting 10-15 minutes in a comfortable setting. Clinical information was collected by reviewing the Kardex and consulting with healthcare providers. All collected data were stored securely to maintain patient privacy and confidentiality. The questionnaires used in the interviews were initially translated from English to Nepali and then verified via back-translation to ensure accuracy. All interviews were conducted in the Nepali language. Pretesting of the questionnaire was conducted with 10% of the intended sample (ie, 12 participants) in a similar setting. The internal consistency of the questionnaire, assessed using Cronbach’s alpha, was 0.87. Outcome Measurement The primary measure was HRQoL, assessed using the EuroQol 5-Dimension 5-Level (EQ-5D-5L) scale.  18 Explanatory Variables The degree of disability was assessed using the Modified Rankin Scale (mRS), which was developed and validated by John van Swieten. The mRS scores range from 0 to 6 and are categorized as follows: 0 (no symptoms), 1 (no significant disability), 2 (slight disability), 3 (moderate disability), 4 (moderately severe disability), 5 (severe disability), and 6 (death). Higher scores indicate greater neurological impairment or a higher degree of physical disability.  19 Statistical Analysis Data were entered into EpiData version 3.1 and exported to SAS version 9.4 for analysis. Descriptive statistics, including means with standard deviations for continuous variables and frequencies with percentages for categorical variables, were calculated based on the level of measurement. The normality of the data was assessed using the Kolmogorov-Smirnov test. For bivariate analysis, independent sample t t Multiple linear regression analyses were conducted using both unadjusted and adjusted models to identify factors associated with HRQoL. The assumptions of linearity, normality, and homoscedasticity were evaluated using residual scatterplots. The normal probability plot of standardized residuals indicated an approximately normal distribution, and the scatterplot of residuals versus predicted values showed no evident pattern, supporting the assumptions of linearity and equal variance. Additionally, the Variance Inflation Factor (VIF) values for all predictors were below 10, indicating no significant multicollinearity.  20 p Ethical Approval The study was approved by the Institutional Review Committee of Annapurna Neurological Institute & Allied Sciences (IRC-ANIAS, Ref No.: 115-2023/24). Participant privacy was protected through data coding, and names were not disclosed to third parties. Confidentiality was maintained throughout the study, and the collected data were used solely for research purposes. Participation was voluntary, and participants could withdraw at any time without consequence. They were informed of the study objectives and had access to their information after data collection. Results The characteristics of the participants and the bivariate analyses by HRQoL scores are presented in Table 1 Table 1. Socio-Clinical Characteristics and Bivariate Analyses by HRQoL Score. Characteristics Total HRQoL score p n (%) Mean SD Overall 120 (100) 21.13 6.62  Age (years) <.001  a 20-40 15 (12.5) 15.20 8.98 41-60 45 (37.5) 22.37 5.16 61-80 57 (47.5) 22.26 5.81 >80 3 (2.5) 25.00 .00 Mean ± SD: 59.79 ± 14.05 P  b  Sex .031  c Male 78 (65.0) 21.25 6.34 Female 42 (35) 21.92 6.59  Occupation <.001  a Employed 36 (30.0) 19.25 7.52 Unemployed 31 (25.8) 22.38 5.71 Retired 10 (8.3) 23.60 4.42 Homemaker 26 (21.7) 20.84 7.25 Agriculture 17 (14.2) 24.35 1.61  Ethnicity .389 Brahmin 36 (30.0) 20.44 7.52 Chhetri 18 (15.0) 21.44 7.11 Janajati 54 (45.0) 22.53 5.13 Dalit 12 (10.0) 20.00 6.94  Education <.001  a Illiterate 53 (44.2) 23.18 4.47 Primary 17 (14.2) 21.94 5.51 Secondary 19 (15.8) 22.10 6.22 Higher secondary 14 (11.7) 19.57 7.34 Graduate 13 (10.8) 18.23 8.98 Postgraduate 4 (3.3) 11.50 9.03  Religion .572 Hinduism 100 (83.3) 21.90 5.98 Buddhism 16 (13.3) 22.18 6.28 Christianity 2 (1.7) 10.00 7.07 Muslim 2 (1.7) 7.00 1.41  Marital status .220 Ever married 118 (98.3) 21.74 6.15 Family type .024  c Nuclear 54 (45) 20.56 6.91 Joint 66 (55) 22.18 5.96  Co-morbidities Hypertension 94 (78.3) 22.67 5.10 <.01  c Diabetes 28 (23.3) 22.32 5.69 .162 Dyslipidemia 6 (5.0) 16.00 10.00 .007  c COPD 7 (5.8) 24.5714 1.13 .02  c Thyroid 8(6.7) 17.8750 8.74 .069  Smoking .774 Never smoked 58 (48.3) 20.94 7.10 Occasional smoker 36 (30) 22.11 5.44 Active smoker 18 (15) 21.38 6.67 Former 8 (6.7) 22.87 4.91  Alcohol consumption Never 54 (45.0) 21.03 7.16 .568 Occasional 38 (31.7) 22.39 5.39 Light 5 (4.2) 23.00 3.46 Heavy 15 (12.5) 19.60 7.34 Former 8 (6.7) 22.87 4.91  Type of stroke Ischaemic 82 (68.3) 21.76 6.29 .023  c Haemorrhagic 38 (31.7) 20.89 6.70  Infarcted area Middle cerebral artery 27 (22.5) 22.50 5.72 .02  a Posterior cerebral artery 11 (9.2) 21.00 5.98 Lacunar infracts 10 (8.3) 17.80 9.37 Internal capsule 5 (4.2) 23.0 4.47 Capsuloganglionic 3 (2.5) 25.00 .00 No visible infarct on imaging 58 (48.3) 21.63 6.16  Stroke disability Mild (mRS ⩽ 2) 12(10.0) 7.08 1.78 .041  c Moderate to severe (mRS ⩾ 3) 108(90.0) 23.09 4.42 Abbreviations: COPD, chronic obstructive pulmonary disease; Ever married: married, divorced, separated; mRS, Modified Rankin Scale. a One way ANOVA. b Kolmogorov-Smirnov test. c Independent t P Assessment of co-morbid conditions showed that hypertension was highly prevalent, affecting more than three-fourths of the patients (78.3%), while diabetes mellitus was present in (23.3%). Regarding social history, nearly half of the patients had never smoked (48.3%) or consumed alcohol (45.0%), while a small proportion were former smokers and alcohol users (6.7%). Bivariate analyses revealed several significant associations between various factors and HRQoL among stroke patients. HRQoL scores varied notably across age groups, educational levels, occupational status, family type, and the presence of specific comorbidities such as hypertension, dyslipidemia, and COPD. Additionally, stroke-related disability and infarcted brain areas were significantly associated with HRQoL. Conversely, no statistically significant associations were observed between HRQoL and gender, ethnicity, marital status, smoking history, alcohol consumption, or the type of stroke. Table 2 Table 2. Distribution of EQ-5D-5L Dimension Responses Among Stroke Patients (n = 120). Dimension Categories n (%) Mobility No problems in walking 6 (5) Slight problem in walking 15(12.5) Moderate problem in walking 4(3.3) Severe problem in walking 8 (6.7) Unable to walk 87 (72.5) Mean ± SD 4.22 ± 1.32 Self-care No problems washing or dressing 8 (6.7) Slight problems washing or dressing 12 (10) Moderate problems with washing or dressing 3 (2.5) Severe problems washing or dressing 7 (5.8) Unable to wash or dress 90 (75) Mean ± SD 4.26 ± 1.343 Usual activities No problems doing my usual activities 8 (6.7) Slight problems doing my usual activities 10(8.3) Moderate problems doing my usual activities 4 (3.3) Severe problems doing my usual activities 4 (3.3) Unable to do my usual activities 94 (78.3) Mean ± SD 4.32 ± 1.319 Pain/discomfort No pain or discomfort 14 (11.7) Slight pain or discomfort 10(8.3) Moderate pain or discomfort 1 (0.8) Severe pain or discomfort 2(1.7) Extreme pain or discomfort 93 (77.5) Mean ± SD 4.17 ± 1.508 Anxiety/depression Not anxious or depressed 15 (12.5) Slightly anxious or depressed 9(7.5) Moderately anxious or depressed 1 (0.8) Severely anxious or depressed 2(1.7) Extremely anxious or depressed 93 (77.5) Mean ± SD 4.17 ± 1.525 Total score Mean ± SD 21.13 ± 6.62 Abbreviation: SD, standard deviation. Table 3 P P P P P P P P P Table 3. Socio-Clinical Factors Associated with HRQoL Among Stroke Patients (n = 120). Characteristics Unadjusted Adjusted Coefficient (β) 95% CI p Coefficient (β) 95% CI p  Age (years) 20-40 Ref. Ref 41-60 7.177 3.627 to 10.728 <.001 7.202 3.623 to 10.781 <.001 61-80 7.063 3.607 to 10.519 <.001 6.954 3.470 to 10.439 <.001 >80 9.800 2.267 to 17.332 <.001 10.360 2.714 to 18.006 <.001  Gender Male Ref Female 0.672 −1.765 to 3.109 .586 0.662 −1.780 to 3.106 .592  Occupation Employed Ref Ref Unemployed 3.137 0.103 to 6.171 .042 3.136 0.085 to 6.188 .004 Retired 4.350 −0.076 to 8.776 .054 4.348 −0.131 to 8.27 .005 Homemaker 1.596 −1.590 to 4.781 .323 1.595 −1.610 to 4.801 .326 Agriculture 5.102 1.459 to 8.746 .006 5.100 1.330 to 8.887 .008  Education Illiterate Ref Ref Primary −1.247 −4.577 to 2.080 .459 −1.419 −4.776 to 1.937 .403 Secondary −1.083 4.276 to 2.109 .502 −0.884 4.115 to 2.346 .581 Higher secondary −3.617 −7.205 to 0.029 .004 −3.391 −7.023 to 0.240 .006 Graduate −4.957 −8.653 to −1.262 .008 −4.852 −8.561 to −1.143 .001 Postgraduate −11.688 −17.879 to −5.497 .002 −11.983 −18.221 to −5.744 .001  Family type Joint Ref Ref Nuclear 1.615 −0.725 to 3.956 .174 1.561 −0.780 to 3.919 .188  Type of stroke Ischaemic Ref Ref Haemorrhagic −0.873 −3.371 to 1.624 .489 −0.865 −3.371 to 1.639 .495  Infarcted area None Ref Ref Middle cerebral 0.862 −2.146 to 3.870 .571 0.861 −2.160 to 3.881 .573 Internal capsule 1.362 −4.578 to 7.302 .650 1.371 −4.610 to 7.322 .653 Posterior cerebral −0.637 −4.829 to 3.553 .763 −0.606 −4.825 to 3.611 .776 Lacunar −0.383 −8.201 to 0.526 .084 −3.814 −8.202 to 0.572 .087 Capsuloganglionic 3.362 −4.184 to 10.904 .271 3.375 −4.201 to 10.951 .379  Stroke disability Mild (mRS ⩽ 2) Ref Moderate to severe (mRS ⩾ 3) 16.009 13.451 to 18.5661 .001 15.995 13.431 to 18.555 .001 Abbreviations: CI, confidence interval; mRS, Modified Rankin Scale; Ref, reference. P Furthermore, patients with moderate to severe stroke-related disability (mRS ⩾ 3) had substantially higher HRQoL scores compared to those with mild disability (β = 15.995, 95% CI: 13.431-18.555, P Pearson’s correlation analysis was conducted to assess the relationships between the HRQoL domains, as presented in Table 4 r r r r r P Table 4. Correlation Matrix Between HRQoL and Its Domain. Characteristics Quality of life Mobility Selfcare Usual activities Pain/discomfort Anxiety/depression Quality of life 1 Mobility 0.933 ** 1 Selfcare 0.951 ** 0.935 ** 1 Usual activities 0.940 ** 0.861 ** 0.871 ** 1 Pain/discomfort 0.949 ** 0.817 ** 0.833 ** 0.869 ** 1 Anxiety/depression 0.956 ** 0.819 ** 0.873 ** 0.857 ** 0.951 ** 1 ** Correlation is significant at the .01 level (2-tailed). Similarly, the self-care domain was significantly associated with mobility ( r r r r P Discussion This study assessed HRQoL among stroke patients at a tertiary care hospital in Nepal and identified key sociodemographic and clinical factors associated with it. The findings revealed a substantial impact of stroke on all domains of HRQoL, with the most significant impairments observed in usual activities, self-care, and mobility. Factors such as age, educational level, occupational status, and stroke-related disability emerged as significant determinants influencing overall HRQoL. The mean EQ-5D-5L score of 21.13 ± 6.62 demonstrates a moderate to severe impact of stroke on the HRQoL of Nepali patients. This is consistent with previous studies that consistently reported diminished quality of life among stroke survivors, particularly in resource-limited settings where structured rehabilitation services are often lacking. 3 14 21 22 2 13 14 23 25 26 27 In this study, age was a significant determinant of HRQoL, with older adults reporting lower scores, reflecting poorer perceived health. This finding is consistent with previous research demonstrating that advancing age is associated with lower HRQoL, likely due to age-related functional decline, increased comorbidities, and reduced physiological resilience, all of which hinder recovery and exacerbate disability. 10 11 21 23 Notably, higher educational attainment was associated positively with HRQoL. Participants with postgraduate, graduate, and higher secondary education reported significantly better HRQoL compared to those who were illiterate. Similar associations have been reported in international studies, where lower education levels have consistently predicted lower quality of life among stroke patients. 10 13 28 14 29 Occupational status also influenced HRQoL. Retired individuals, the unemployed, and those engaged in agriculture reported significantly poorer HRQoL, likely due to economic insecurity and reduced social engagement, factors similarly identified in studies conducted in Southeast Asia.  28 13 14 Stroke-related disability, as measured by the Modified Rankin Scale, emerged as the most significant predictor of poor HRQoL. Patients with moderate to severe disability (mRS ⩾ 3) were significantly more likely to report lower HRQoL, reinforcing the well-established link between functional limitations and reduced quality of life.  21 Furthermore, the study revealed strong, statistically significant positive correlations among all HRQoL domains. Overall quality of life was highly associated with mobility, self-care, usual activities, pain/discomfort, and anxiety/depression. Notably, self-care was strongly associated with improved physical and psychological health. Similarly, impairments in usual activities were closely tied to pain and emotional distress, underscoring the broad impact of functional limitations on overall well-being. The strong interrelationships between pain/discomfort and anxiety/depression with other domains further highlight their central role in shaping HRQoL in stroke survivors. This study is among the few in Nepal to use the EQ-5D-5L scale to assess HRQoL in stroke patients and provides a comprehensive analysis of associated socio-clinical factors. The use of a validated tool and face-to-face interviews enhances the data reliability. However, several limitations should be acknowledged. First, the cross-sectional study design limits the ability to establish causal relationships or assess changes in HRQoL over time. Second, the use of convenience sampling and self-reported responses may introduce selection and social desirability biases, potentially limiting the generalizability. Third, the exclusion of patients with aphasia or cognitive impairments might have led to an underestimation of HRQoL impairment. Lastly, despite multivariable analysis, residual confounding from unmeasured variables such as income and access to rehabilitation services may persist. Conclusion The study highlights the profound effect of stroke on patients HRQoL, with significant impairment in usual activities, self-care and mobility. Key factors including age, educational level and occupational status were the crucial determinants of HRQoL, with stroke-related disability, the strongest predictor of diminished HRQoL. These findings emphasized the need for personalized rehabilitation strategies to optimize HRQoL outcomes addressing the physical, psychological, and social aspects of stroke recovery. We sincerely thank the Annapurna Neurological Institute and Allied Sciences Hospital and the patients who participated in this study for generously sharing their time and valuable information. This study would not have been possible without their contributions. ORCID iD: https://orcid.org/0000-0003-4353-382X Ethical Considerations: Consent to Participate: Author Contributions: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Data Availability Statement: References 1 Huang S Liu Y Li M et al Oral health knowledge, attitudes, and practices and oral health-related quality of life among stroke inpatients: a cross-sectional study BMC Oral Health 2022 22 1 410 36123656 10.1186/s12903-022-02446-1 PMC9484166 2 Islam MJ Ahmed S Kamrul Islam KM et al Disability and depression among stroke survivors attending rehabilitation facilities at three designated tertiary care hospitals in Bangladesh: a cross-sectional study PLoS One 2025 20 1 10.1371/journal.pone.0311325 PMC11698461 39752528 3 Feigin VL Stark BA Johnson CO et al Global, regional, and national burden of stroke and its risk factors, 1990-2019: a systematic analysis for the Global Burden of Disease Study 2019 Lancet Neurol 2021 20 10 795 820 34487721 10.1016/S1474-4422(21)00252-0 PMC8443449 4 Go AS Mozaffarian D Roger VL et al Heart disease and stroke statistics—2014 update: a report from the American Heart Association Circulation 2014 129 3 10.1161/01.cir.0000441139.02102.80 PMC5408159 24352519 5 Amalia L Furqani MA Parwati I Rizal A Panigoro R Correlation between Alberta Stroke Programme Early Computed Tomography Score (ASPECTS) and National Institute of Health Stroke Score (NIHSS) in ischemic stroke Sains Malaysiana 2020 49 5 1115 1120 6 Johnson CO Nguyen M Roth GA et al Global, regional, and national burden of stroke, 1990-2016: a systematic analysis for the Global Burden of Disease Study 2016 Lancet Neurol 2019 18 5 439 458 30871944 10.1016/S1474-4422(19)30034-1 PMC6494974 7 Nepal Stroke Project A project to reduce the burden of stroke in Nepal 2025 Accessed March 27, 2025 https://nepalstrokeproject.org/why-we-do-it/ 8 Shah B Bartaula B Adhikari J et al Predictors of in-hospital mortality of acute ischemic stroke in adult population J Neurosci Rural Pract 2017 8 4 591 594 29204020 10.4103/jnrp.jnrp_265_17 PMC5709883 9 Thapa LJ Shrestha AS Pokhrel BB Poudel RP Rana PV Stroke mortality in intensive care unit from tertiary care neurological center J Nepal Med Assoc 2013 52 190 332 336 Accessed March 27, 2025 https://pdfs.semanticscholar.org/5d37/7535d186aff423c0abe453f89ec027b3c574.pdf 24362655 10 Kariyawasam PN Pathirana KD Hewage DC Factors associated with health-related quality of life of patients with stroke in Sri Lankan context Health Qual Life Outcomes 2020 18 129 32384894 10.1186/s12955-020-01388-y PMC7206769 11 Serda EM Bozkurt M Karakoc M et al Determining quality of life and associated factors in patients with stroke Turk Soc Phys Med Rehabil 2015 61 148 154 12 Bach JP Riedel O Pieper L et al Health-related quality of life in patients with a history of myocardial infarction and stroke Cerebrovasc Dis 2010 31 1 68 76 21051886 10.1159/000319027 13 Zemed A Nigussie Chala K Azeze Eriku G Yalew Aschalew A Health-related quality of life and associated factors among patients with stroke at tertiary level hospitals in Ethiopia PLoS One 2021 16 3 10.1371/journal.pone.0248481 PMC7971497 33735246 14 Dianati M Sirousinejad ZS Sooki Z Factors predicting quality of life in stroke patients: a cross-sectional study Int Arch Health Sci 2021 8 4 290 295 15 Zhu W Jiang Y Determinants of quality of life in patients with hemorrhagic stroke: a path analysis Medicine (Baltimore) 2019 98 5 10.1097/MD.0000000000013928 PMC6380761 30702554 16 Annapurna Neurological Institute and Allied Sciences Accessed March 27, 2025 https://annapurnahospital.com.np/ 17 Sepahvand E Daryabor A Hosseini RS Neyseh F Design and development of Kardex and nursing reports in the rehabilitation hospital SAGE Open Nurs 2023 9 1153472 10.1177/23779608231153472 PMC9903012 36761365 18 EuroQol Group EQ-5D-5L Accessed March 27, 2025 https://euroqol.org/information-and-support/euroqol-instruments/eq-5d-5l/ 19 Broderick JP Adeoye O Elm J Evolution of the modified Rankin Scale and its use in future stroke trials Stroke 2017 48 7 2007 2012 28626052 10.1161/STROKEAHA.117.017866 PMC5552200 20 Hair JF Jr Anderson RE Tatham RL Black WC Multivariate Data Analysis 3rd ed Macmillan 1995 Accessed March 27, 2025 https://www.drnishikantjha.com/papersCollection/Multivariate%20Data%20Analysis.pdf 21 Ramos-Lima MJ Brasileiro ID Lima TL Braga-Neto P Quality of life after stroke: impact of clinical and sociodemographic factors Clinics (Sao Paulo) 2018 73 10.6061/clinics/2017/e418 PMC6152181 30304300 22 Labberton AS Augestad LA Thommessen B Barra M The association of stroke severity with health-related quality of life in survivors of acute cerebrovascular disease and their informal caregivers during the first year post stroke: a survey study Qual Life Res 2020 29 2679 2693 32388786 10.1007/s11136-020-02516-3 PMC7561590 23 Adigwe GA Alloh F Smith P Tribe R Regmi P Assessment of health-related quality of life of stroke survivors in southeast communities in Nigeria Int J Environ Res Public Health 2024 21 9 1116 39337999 10.3390/ijerph21091116 PMC11430842 24 Akosile CO Adegoke B Ezeife CA et al Quality of life and sex differences in a south-eastern Nigerian stroke sample Afr J Neurol Sci 2013 32 1 19 25 Accessed March 28, 2025 https://www.ajol.info/index.php/ajns/article/view/97263 25 Alotaibi SM Alotaibi HM Alolyani AM et al Assessment of the stroke-specific quality-of-life scale in KFHU, Khobar: a prospective cross-sectional study Neurosciences (Riyadh) 2021 26 2 171 178 33814370 10.17712/nsj.2021.2.20200126 PMC8024127 26 Harno H Haapaniemi E Putaala J et al Central poststroke pain in young ischemic stroke survivors in the Helsinki Young Stroke Registry Neurology 2014 83 13 1147 1154 25128182 10.1212/WNL.0000000000000818 27 Gurková E Štureková L Mandysová P Šaňák D Factors affecting the quality of life after ischemic stroke in young adults: a scoping review Health Qual Life Outcomes 2023 21 1 4 36653785 10.1186/s12955-023-02090-5 PMC9850784 28 Mahesh PK Gunathunga MW Jayasinghe S Arnold SM Liyanage SN Factors influencing pre-stroke and post-stroke quality of life among stroke survivors in a lower middle-income country Neurol Sci 2018 39 2 287 295 29103178 10.1007/s10072-017-3172-6 29 Martini S Ningrum DA Abdul-Mumin KH Yi-Li C Assessing quality of life and associated factors in post-stroke patients using the World Health Organization abbreviated generic quality of life questionnaire (WHOQOL-BREF) Clin Epidemiol Glob Health 2022 13 100941 ",
  "metadata": {
    "Title of this paper": "Assessing quality of life and associated factors in post-stroke patients using the World Health Organization abbreviated generic quality of life questionnaire (WHOQOL-BREF)",
    "Journal it was published in:": "Health Services Insights",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477393/"
  }
}