{
  "title": "Paper_1012",
  "abstract": "pmc Foods Foods 3129 foods foods Foods 2304-8158 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469872 PMC12469872.1 12469872 12469872 41008192 10.3390/foods14183219 foods-14-03219 1 Review Mechanisms, Functions, Research Methods and Applications of Starch–Polyphenol Complexes in the Synergistic Regulation of Physiological Parameters https://orcid.org/0009-0000-9687-6223 Hu Zhehao Xu Yanyan Xiong Yuanqian Huang Ganhui * Vinson Joe Academic Editor State Key Laboratory of Food Science and Resources, Nanchang University, Nanchang 330047, China; shanyewudengsuozhang@gmail.com beishangguobaorou22@gmail.com * ghhuang@ncu.edu.cn 17 9 2025 9 2025 14 18 497635 3219 25 6 2025 04 9 2025 10 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Metabolic illnesses such as obesity, type 2 diabetes and hyperuricemia are becoming more common, driving intensified research into nutritional interventions through targeted dietary modifications as a primary preventive strategy. The apparent fluctuation in blood glucose value is modulated by the digestive behavior of starch. Moreover, polyphenols—historically considered to be anti-nutrients due to their inhibition of digestive enzymes and sometimes astringent taste—can be used to significantly improve the functional properties of starch. This can be achieved primarily through α-amylase inhibition and the modulation of other enzyme activities, alongside the antioxidant and anti-inflammatory effects of polyphenols. Depending on their fine structure, starches are digested at different rates: rapidly digestible starch (RDS) spikes blood glucose; slowly digestible starch (SDS) smooths postprandial blood glucose peaks; resistant starch (RS) feeds gut microbes. The fine structure of starches, such as straight-chain starches, can form complexes with polyphenols through their ‘empty V-type’ structures under controlled processing conditions. Fourier-transform infrared spectroscopy (FTIR), X-ray diffraction (XRD) and in vitro digestion modeling analyses have revealed that the formation of starch–polyphenol complexes primarily occurs due to certain interactions (hydrophobic interactions and hydrogen bonding) which lead to stabilized structures, including V-type encapsulation; this significantly increases the content of RSs and slows down enzymatic digestion rates. These complexes lower the GI values of foods via molecular barrier effects, while synergistically boosting antioxidant and anti-inflammatory activities; their anti-digestive capabilities were found to be superior even to those of ordinary starch–lipid compounds. However, limitations persist in the research and application of starch–polyphenol complexes: human bioavailability validation; incomplete mechanistic understanding of multicomponent interactions; industrial scalability challenges due to polyphenol instability. starch–polyphenol complexes empty V-type inclusion complexes slowly digestible starch (SDS) resistant starch (RS) low glycemic index (GI) This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Photosynthesis, which converts light energy to chemical energy and is stored primarily as starch by plants, is a key mechanism by which plants adapt to their surroundings and maintain life. Starch is the principal energy storage molecule in plants. The digestibility rate of starch has a direct impact on blood glucose swings and energy supply stability [ 1 2 3 4 Plants synthesize polyphenols as evolved defenses against biological and chemical injuries such as insect and animal feeding and the occurrence of free radicals and oxidation during growth. This process integrates multiple functions such as defense, structural support, signaling and ecological interactions. Polyphenols, as secondary metabolites in plants, are involved in scavenging the reactive oxygen species produced during photosynthesis and the regulation of cellular antioxidant defense; they also lead to enhanced ultraviolet light and biotic stress resistance through the activation of pathogen defense signaling pathways [ 5 6 7 8 Furthermore, polyphenols form compounds with starch molecules by hydrophobic hydrogen bonding or electrostatic interactions, changing the crystalline structure and thermal stability of starch and slowing enzymatic activity, thus dramatically increasing the fraction of RSs [ 9 10 The functional properties of starch–polyphenol synergisms, such as postponing digestion [ 3 11 10 10 Building on these discoveries, this narrative review methodically summarizes the mechanisms of interaction between polyphenols and starch, the physiological effects of their complexes, their physicochemical characteristics, their characterization techniques and their potential uses in food science. With an emphasis on determining how polyphenols alter the physicochemical characteristics of starches, this review analyzes the potential of and difficulties encountered in employing contemporary analytical methods to decipher structure–function links in these complexes, with the aim of supporting the development of new health-conscious foods. The present review aims to show how advanced characterization technologies can be used to reveal structure–property correlations, identify novel applications in low-GI foods and smart packaging and illuminate industrial implementation barriers. This review also aims to clarify the molecular mechanisms by which polyphenols regulate starch digestibility and functionality through intermolecular interactions. Through the integration of scientific knowledge with real-world applications, this review presents new insights into starch–polyphenol complexes and offers a theoretical and technical framework for creating food systems that are both functionally improved and nutritionally balanced. 2. Structures of Starches and Polyphenols and Their Physiological Roles 2.1. Fine Structure of Starch and Its Origin Starch plays different physiological roles due to the diversity of its fine structures, such as the ratio of straight chains to branched chains, molecular weight, chain length distribution, branching degree and crystalline form. Straight-chain starches are distinguished by their longer linear chains (DP > 1000) and double-helix shape; they are characterized by their high resistance to digestive enzymes, resulting in a large concentration of RSs. Branched starches are primarily composed of short–medium, highly branched chains (DP 10–60) which expand the spatial structure after pasting and reveal more enzyme action sites. As a result, postprandial blood glucose levels rise quickly due to fast hydrolysis. In native starch granules, crystallinity predominantly reflects the organized packing of amylopectin, while linear amylose is largely amorphous; however, following gelatinization and subsequent processing (e.g., retrogradation or inclusion-complex formation), amylose can reassociate into V-type or retrograded crystalline domains that substantially contribute to the crystallinity, thermal behaviour and RS content of processed starches. Different crystalline kinds (A, B and C) have varying degrees of accessibility to digestive enzymes: A-type crystals have been shown to be the most vulnerable to enzymatic breakdown, while B-type crystals have been shown to be the most resistant to digestion. To create low-GI or slow-release energy starch products with various digestive qualities, researchers have carefully regulated the proportion of straight-chains to branched-chains, and have regulated the molecular weight distribution and crystalline types of starches from maize, wheat, rice and other grains—as well as potato, cassava and other yams—using physical (heat treatment or shearing), chemical (cross-linking or esterification) and enzymatic (branched enzyme or debranched enzyme) methods [ 1 2 1 2 1 2 3 Moreover, the different botanical origins of starch engender distinct physicochemical signatures that reflect each plant’s unique biosynthetic pathways and storage tissue architectures. For instance, pea starch, recovered as a byproduct of pea protein processing, comprises over 50% of a seed’s dry weight and forms relatively small, spherical granules, owing to the legume-specific expression of branching and debranching enzymes in its amyloplasts [ 12 13 14 2.2. Starch Digestion and Postprandial Blood Glucose Starch enters the body and is eventually digested and turned to blood glucose, providing energy. Starches are digested at different speeds depending on their structural types. RDS causes a sharp rise in blood glucose after meals because it is frequently completely digested in 20 min. Long-term consumption of foods high in RDS is strongly linked to metabolic disorders such as type 2 diabetes and obesity [ 3 7 1 15 1 3 15 The readiness by which starch can be digested is directly influenced by the number of ‘contact sites’ the starch has. Besides its function as an energy source, the main physiological significance of starch is found in its rate of digestion and resistance to enzymatic breakdown in the upper gastrointestinal tract. However, the percentage of branched-chain starches in cereals and other foods is rising due to peoples’ desire for soft texture, easy digestion and easy absorption. As a result, the synergistic effect of starch and polyphenols in food on physiological indicators becomes more significant when the ‘food diversity’ principle and sensible cooking techniques are applied. The way in which starch and polyphenols in food work together to regulate physiological parameters thus becomes clearer. 2.3. Source and Bioavailability of Polyphenols Hydroxyl is a common polar group, and the presence of hydroxyl makes the molecule more polar as a whole, exhibiting its physiological value. Polyphenols—which have multiple phenolic hydroxyl (-OH) structural units—can be classified into several categories based on their chemical structure: flavonoids, polyphenolic acids, ellagic acids, anthocyanins, etc. Notable common polyphenol compounds include catechins (EGCG) in tea, resveratrol in grapes and hesperidin in citrus fruits [ 6 16 6 17 16 18 16 18 16 19 3. Interactions Between Starch and Polyphenols and Their Physiological Value 3.1. Interaction of Flavonoid Polyphenols with Starch Flavonoid polyphenols, including quercetin (Qu) and rutin (RT)—with multiple phenolic hydroxyl groups (-OH) and hydrophobic aromatic ring structures (e.g., benzene and pyran rings) with strong antioxidant effects—often interact with starch molecules through hydrophobicity and hydrogen bonding, affecting the physicochemical properties of starch [ 20 9 9 16 21 Miao’s team concluded that quercetin, through its hydrophobic structure and hydrogen bonding, binds to the helical cavity of straight-chain starch to form a V-shaped inclusion, which enhances the RS content of high-temperature straight-chain maize starch from 8.3% to 32.5% and retards the digestion rate by more than 40%. Additionally, the complex’s thermal stability is greatly improved (the decomposition temperature rises from 300 to 325 °C), making it appropriate for use in high-temperature environments. Finally, the complex’s antioxidant activity (a 1.8-fold increase in DPPH radical scavenging rate) makes it suitable for use in high-temperature environments as well. Chen et al. revealed the formation of a V-type inclusion complex, as shown in Figure 1 20 22 23 Figure 2 9 20 24 25 3.2. Interaction of Astragalus Polyphenols with Starch Astragalus polyphenols such as resveratrol and its natural derivative piceatannol (3,4,3′,5-tetrahydroxystilbene) are all based on a stilbene matrix structure with two benzene rings linked by an ethylene bridge; these compounds are present in plants in very small amounts and are mainly found in the thin-walled cells of the xylem. Mengji Dong et al. [ 28 29 Figure 3 30 3.3. Interaction of Phenolic Acid with Starch Phenolic acid polyphenols are widely found in the plant kingdom, especially in tea, coffee and other common beverages, and their representative substances are caffeic acid, gallic acid (GA), cinnamic acid, etc. They can form hydrogen bonds with hydroxyl groups of starch molecules through phenolic hydroxyl groups and construct inclusion or non-inclusion complexes with the help of hydrophobic interactions or van der Waals’ forces; thus, they significantly enhance thermal stability and RS content while delaying blood glucose release to some extent to regulate blood glucose release. Crucially, the hydroxyl spatial arrangement defines their interaction modes: GA, with three adjacent hydroxyls, forms dense hydrogen-bonded networks within starch helices, elevating RS and thermal stability [ 22 31 32 In a systematic study of the inhibition mechanism of DPP4, Li et al. pointed out that cinnamic acid exhibited optimal inhibitory activity with an IC50 value of 33.56 ± 1.13 mM and its binding process; DPP4 showed a spontaneous static burst mechanism and a mixed inhibition mode driven by hydrogen bonding as the main driving force, which revealed that cinnamic acid, while regulating the blood glucose response by complexing with starch, also has dual hypoglycemic potentials of prolonging the half-life of GLP-1 action and enhancing endogenous insulin secretion by inhibiting DPP4 [ 32 Caffeic acid binds to the helical cavity of straight-chain starch through hydrogen bonding, strengthening the helical structure of the starch and making it difficult for the complex to be destroyed at high temperatures. It greatly increases the thermal stability of straight-chain starch [ 31 24 32 Furthermore, in addition to studying the mechanism of phenolic acid and starch complex formation, Li et al. investigated the inhibitory effect of cinnamic acid on DPP4 activity; they put forward the viewpoint that the adaptive inhibition of cinnamic acid on DPP4 activity occurs through the induction of spatial structural changes in the enzyme. This theory extended studies on the synergistic effect of polyphenol–starch to the maintenance of GLP-1 activity and thus blood glucose regulation through the inhibition of DPP4 activity [ 32 3.4. Interaction of Lignan Polyphenols with Starch Protocatechuic acid (PA) and soy isoflavones (SIs) are lignans, which are polyphenols with strong antioxidant properties that can be attributed to the abundance of phenolic hydroxyl groups and the extension of conjugated systems. PA has a small molecular structure with many hydroxyl groups, allowing it to form strong hydrogen bonding connections with hydroxyl groups in straight-chain starch molecules [ 23 33 In conclusion, polyphenols can be combined with starch through hydrophobic interactions, hydrogen bonding, electrostatic interactions and π–σ interactions to form a V-shaped inclusion and network cross-linking structure; this structure can significantly increase the content of RSs and slow down its digestion rate. Moreover, it has been found to enhance the thermal stability and antioxidant and anti-inflammatory activities of the complexes, effectively lower the glycemic index and improve the functional properties of the food. These characteristics are summarized in Table 1 4. Effect of Starch–Polyphenol Complexes on Physiological Indices The physiological role of starch in the human body can be understood in terms of evolutionary adaptations, digestive rates and metabolic effects. From an evolutionary perspective, the human ‘thrifty gene’ has led us—in times when energy is limited—to prioritize eating foods high in carbohydrates, so that we may quickly satisfy our physiological needs [ 1 2 3 7 Polyphenols, as plant secondary metabolites, confer important protective functions to plants themselves and play multiple roles in human health and modern nutritional management. First, polyphenols in plants help to protect against ultraviolet radiation, pathogens and oxidative damage through their typical astringent and astringent properties; they are also involved in the formation of flower color and flavor [ 5 8 35 During blood glucose metabolism, polyphenols can form complexes with starch through hydrogen bonding, hydrophobic interactions and other noncovalent binding modes, interfering with the pasting and aging process of starch and specifically inhibiting the activities of α-amylase and α-glucosidase; this can significantly reduce the digestion rate of carbohydrates and postprandial blood glucose fluctuations, demonstrating a potential antidiabetic value [ 34 36 10 11 8 35 Thus, we believe that polyphenols have a double significance: on the one hand, they are ‘defense factors’ for the survival and reproduction of plants; on the other hand, for human beings, the moderate use of their ‘anti-digestive’ properties and rich physiological activities can be transformed into a natural barrier for the maintenance of health and the prevention of chronic diseases in modern society, where there is, broadly, enough—or even too much—nutrition. Starch–polyphenol complexes exhibit unique synergistic effects in physiological actions, which are particularly important in blood glucose management. Through intermolecular interactions, the complexes slow down the rate of enzymatic starch degradation, convert high-GI diets into low-GI ones and dramatically increase RS content compared to single components. The complexes have been shown to decrease GI in both in vitro and in vivo experiments; research on animals has shown that they produce smoother postprandial blood glucose profiles [ 11 10 The ‘multi-mechanism synergy’ of starch–polyphenol complexes is in contrast with the ‘targeted efficiency’ of drugs. With an IC 50 m 22 20 50 w w 37 38 In general, starch–polyphenol complexes offer a novel concept for contemporary functional foods and accurate nutritional interventions through ‘dual regulation’, which not only reduces GI and slows down starch digestion but also increases the physiological activity of polyphenols and offers a natural remedy for metabolic disorders brought on by overnutrition. It also provides an effective natural solution to deal with metabolic diseases caused by overnutrition. 5. Characterization Techniques for Starch–Polyphenol Complexes It is challenging to completely understand the multilayer features of starch–polyphenol complexes using a single analytical method when examining their structure–function relationship. Thus, the subsequent section methodically combines the techniques of structural analysis, compositional analysis, surface and morphological analysis, thermal stability analysis and phase transition analysis from various viewpoints, including molecular structure, surface morphology, thermal behavior and chemical composition. The methods are complementary to each other, from the macro- to the microscopic scale, from the static to the dynamic in form and encompass a range of activities from physicochemical to biological; accordingly, they build a technical framework for the characterization of complexes in an all-round way, which provides solid technical support for the optimization of the preparation process, the enhancement of functional properties and the development of functional foods. 5.1. Digestive Characterization Digestive properties are important characteristics of starch as a food resource. Englyst et al. performed in vitro enzymatic digestion of starch samples with pancreatin and amyloglucosidase at 37 °C under physiological conditions. They terminated the reactions at 20 and 120 min, respectively, and then quantified the amount of blood glucose released in the reaction solution using the glucose oxidase–peroxidase (GOPOD) method. After the reactions were terminated at 20 min and 120 min, the amount of blood glucose released from the reaction solutions was quantified using the GOPOD method. Accordingly, the starches were categorized as RDS, SDS or RS according to the enzymatic rate at different time points. This was performed with the aim of supporting the concept that RSs can escape from the small intestinal enzymatic degradation to enter into the colonic fermentation, which was proposed in order to evaluate the physiological function. Singleton et al. further constructed a three-stage in vitro co-digestion model including oral salivary amylase, pepsin and the acidic environment, using small intestinal pancreatic amylase and bile salts; they continuously monitored the sugar release using the 3,5-dinitrosalicylic acid (DNS) method or the GOPOD method, respectively. This was performed at each stage in order to mimic human digestive kinetics and to assess the changes in the performance of the starches. The starches were mechanically ball-milled and polyphenol-coated. The changes in the properties of the starches were modified by the mechanical ball-milling process with polyphenol encapsulation occurring during the enzymatic digestion process. According to the results, the initial ball-milling treatment led to a temporary decrease in digestibility due to the physically disrupted starch crystalline regions. However, the polyphenol molecules created strong hydrogen bonds between the starch chains by overlapping the phenolic hydroxyl groups with the σ–σ* orbitals of the starch hydroxyl groups. This was made possible through the hydrophobic interactions between the aromatic ring π–electrons and the helical cavity C–H orbitals. The interaction between the π–electron of the aromatic ring and the C–H orbital of the helix cavity creates a molecular barrier between the starch chains, which is difficult to recognize using digestive enzymes. This finding significantly slows down the rate of enzymatic degradation and dramatically decreases the release of blood glucose in the three-phase digestive system; thus, direct physiological evidence for the development of low-GI functional foods by fortification was obtained [ 39 5.2. Compositional and Structural Analysis Composition and structure correlate to the properties of the substance itself, which then determine the action of a substance. The researchers used a multi-technique combination of traditional instrumental analyses to study and characterize starch, polyphenols and their complexes. Galani used a strategy combining gel permeation chromatography (GPC) and liquid chromatography–electrospray ionization tandem mass spectrometry (LC-ESI-MS/MS) to accurately quantify the content and molecular weight distribution of the components in the polyphenol–amylopectin complexes; additionally, they assessed the correlation between the complexation efficiency and functional properties. PC relies on different pore size fillers for the hierarchical interception of molecular chain length, which can visually reflect the migration of the molecular weight of starch from the high-polymerization interval to the middle- and low-polymerization intervals after compounding; in contrast, LC-ESI-MS/MS uses chromatographic separation together with a multi-reaction monitoring mode to achieve the sensitive identification and quantification of polyphenol compounds at the microgram level. LC-ESI-MS/MS uses chromatographic separation together with the multi-reaction monitoring mode, which can realize the sensitive identification and quantification of polyphenol compounds on the microgram level. The experimental results showed that, following starch–polyphenol complexation, the molecular weight distribution of starch shifted significantly to the low-molecular-weight direction; moreover, the amount of polyphenol had a significant positive correlation with both its own molecular weight and its antioxidant activity. This finding not only provides a reliable basis for the quantification of polyphenol adsorption and starch chain length distribution, but also lays a solid foundation for the revelation of complex binding efficiency and strength of action [ 40 The structural transformation brought about by noncovalent interactions and the complexation of polyphenols and amylopectin was revealed in five dimensions using the following five different methods: FTIR, XRD, small-angle X-ray scattering (SAXS), nuclear magnetic resonance (NMR) and the Standard Test Method for Tensile Properties of Thin Plastic Sheeting (ASTM D-882 tensile test). These five techniques were used to systematically demonstrate the structural change in polyphenol–starch caused by complexation and noncovalent interactions: molecular vibration, crystal conformation, microstructure, chemical shift and macroscopic mechanical properties [ 5 41 42 43 44 45 5.3. Thermodynamic Behavior and Stability Analysis A thorough investigation of the thermodynamic behavior of starch–polyphenol complexes can reliably define their phase transition temperatures and exothermic (heat absorption) properties. Such an investigation can also show how the materials decompose over time during high-temperature processing and storage, which can serve as a foundation for the optimization of functional food processes. Carter et al. used differential scanning calorimetry (DSC) experiments to accurately record the heat absorption and exothermic peaks of the samples by gradually increasing the temperature. They discovered that the polyphenol molecules’ embedding in the helical cavities of the starches significantly decreased the onset temperature of pasting and promoted the transition of the starches from a crystalline state to an amorphous state. The V-type inclusion displayed a notable heat absorption peak at roughly 130 °C, indicating the complexes’ changed thermal behavior [ 46 31 47 Brodkorb employed the ITC technique to examine the stability of the starch–polyphenol complex system. The findings demonstrated that the binding constants of polyphenol along with starch ranged from 1.25 × 10 4 4 −1 48 5.4. Molecular Docking and Molecular Dynamics Simulations The purpose of molecular docking and molecular dynamics simulations was to use computer modeling to evaluate the binding locations and binding energies of starch and polyphenols. Using programs like AutoDock, GROMACS and Gaussian, the purpose is to construct intricate models of starch (straight and branched chains) and polyphenols (EGCG, quercetin, etc.) and to quantitatively describe their intermolecular interactions by computing parameters like the number of hydrogen bonds and the binding free energy. This innovative technology method is a major component of current research on the openness and ease of visualization. Bannwarth et al. combined the structural models of amylo-oligosaccharides available from the CAZy database (CAZy-Home) with the structural models of polyphenols (such as quercetin, epigallocatechin gallate or EGCG) downloaded from the PubChem database. This was performed using the GFN2-xTB method, which was implemented in the open-source xtb quantum chemistry software and its aISS (Automated Interaction Site Screening) module for automated interaction site screening with the CREST program. The CAZy database (CAZy-Home) provides structural models (straight and branched chains) and the 3D coordinates of polyphenol molecules (e.g., quercetin and epigallocatechin gallate, or EGCG) that can be downloaded from the PubChem database for efficient molecular docking studies of starch and polyphenol molecules. The simulation results indicated that the free energy of binding of short-chain starch to EGCG was −26.73 kcal/mol, while that of long-chain starch was −23.20 kcal/mol, which indicated that the short-chain system was more tightly bound to the polyphenols. Additionally, it was established that the polyphenols’ B-ring serves as the primary binding site. We utilized the ‘3D + 2D’ visualization approach developed by Li et al. in the docking research of DPP4 with phenolic acid derivatives to the starch–polyphenol system to make these static docking results easier to read and understand. Li et al. presented results for a three-dimensional visualization framework of starch–polyphenol complex docking results, which were compared with those of the two-dimensional framework—see Figure 4 32 11 49 Molecular docking software with similar functions include AutoDock Vina [ 50 51 52 53 54 55 56 57 58 59 60 61 62 5.5. Particle Characterization and Rheological Analysis Chen et al. conducted a thorough analysis using Herschel–Bulkley model fitting (HBMF), the Steady-State Shear and Dynamic Oscillatory Rheology (SOSDOR) tests and Dynamic Light Scattering (DLS) to assess the dispersion stability and processing performance of the complexes in the aqueous phase and to provide a physical basis for the optimization of high shear process parameters such as extrusion and 3D printing. The DLS was performed by determining the particle size distribution through the Brownian motion diffusion coefficient (BMDC). DLS reduces the particle size distributions and calculates the Brownian motion diffusion coefficient of the particles to reveal the bimodal structure of macroscopic aggregates (189–340 nm) and nanoscale (8–23 nm) complexes. The rheological test determines the variation in the energy storage modulus, G′, the loss modulus, G″, and the loss factor, tanδ, with the frequency. The results show that G′ ≫ G″ and tanδ < 1; the elastic response is enhanced with the increase in temperature. The Herschel–Bulkley model fitting approach indicates typical pseudoplasticity by showing that the yield stress, σ 0 63 64 65 5.6. Functional Activity Analysis A comprehensive assessment of the physiological functions of starch–polyphenol complexes can be performed using fluorescence/free radical scavenging assays and cellular assays. Fluorescence/radical scavenging assays directly reflect the antioxidant activity of the complexes by determining their scavenging rate or reduction capacity for specific free radicals. This study shows that the antioxidant properties of polyphenol–starch complexes are not only fully preserved but are even enhanced in some systems, which provides strong support for the development of highly functional foods [ 66 67 5.7. Other Detection Methods A number of ‘other assays’—including thin-layer chromatography (TLC), iodine binding assays and the DMSO solubilization () method—have been used in addition to traditional characterization techniques to study starch–polyphenol complexes. These assays are used to supplement the multidimensional analysis of mechanical properties, compositional optimization, macroscopic–microscopic structures and functional activity. Since non-targeted metabolomics and chemometrics are incorporated into big data statistics ideas, they have become more significant. Phenolic components in starch–polyphenol complexes and their bio-accessible binding have been thoroughly identified through chemometrics and non-targeted metabolomics techniques. First, the metabolite data of the complexes were collected using ultra-high-performance liquid chromatography with full spectrum time-of-flight mass spectrometry (UHPLC-QTOF-MS/MS). Chemometrics methods such as principal component analysis (PCA) were then used to extract the primary difference molecules from the huge dataset. The findings revealed distinctive polyphenol molecules like protocatechuic acid and quercetin as biomarkers that can be used to both quantitatively evaluate the complexes’ bioaccessibility and uncover their possible health benefits. These findings indicate that the complexes provide a strong molecular foundation for future precision nutritional interventions and the creation of functional foods [ 68 In conclusion, this work thoroughly examines the multilevel properties of starch–polyphenol complexes, ranging from molecular binding to functional expression; moreover, the researchers have established a comprehensive detection system that reveals the complexes’ binding mechanism, thermal stability, anti-enzymatic properties and bioactivities in a synergistic manner—ranging from molecular vibration and crystalline transformation to microscopic morphology, thermodynamic parameters and physiological functions. This lays a strong basis for the accurate design and optimization of low-GI functional foods. In this review, the technical categories, principles and accessible core information are summarized in Table 2 Table 3 6. Practical Applications of the Developed Starch–Polyphenol Complexes and Products Research on foods with low GI and low GL has increased due to the growing demand for healthier diets. Starch–polyphenol complexes have been used gradually in a variety of food formulations because of their unique advantages, which include glycemic response management, enhanced food functionality, RS as a carbon source for gut microorganisms and polyphenols for intestinal microbiota screening. A detailed discussion on the use of starch–polyphenol complexes in real food products and the creation of their derivatives is presented in the following subsections. 6.1. Development of Low-GI Foods In current food research and development, the production of low-GI meals has been a focus of research in response to the problem of rapid postprandial blood glucose spike linked with high-GI (glycemic index) foods. It is possible to create resistant molecular structures that are more difficult for enzymes to recognize by combining polyphenols with starch to form complexes. This can significantly increase the amount of RSs present and slow down the rate at which starch is digested, thereby lowering the GI. For instance, in an in vivo experiment, complexing green tea polyphenols with rice starch lowered the peak of postprandial blood glucose and significantly increased the amount of RS [ 9 9 6.2. Functional Bakery Products Making useful baked goods is another popular use for starch–polyphenol complexes. Bakery products, such as bread and cookies, are often high in GI refined starch, which can easily contribute to a quick rise in blood glucose levels following meals. Starch–polyphenol complexes can effectively lower a food’s GI rating, making it appropriate for those with diabetes or those who must regulate their blood sugar levels. For instance, research has demonstrated that adding tea polyphenols or baobab fruit extract to bread can considerably lower the postprandial glycemic response [ 11 70 6.3. Functional Drinks Beverages, as part of a daily diet, are sometimes disregarded for their effect on blood glucose levels and weight management. As the demand for healthy beverages grows, the use of starch–polyphenol complexes in the beverage industry is gradually rising, particularly in the production of low-sugar and functional drinks. By combining natural polyphenols, such as those found in tea, with anthocyanins, drinks can not only offer health benefits—including anti-inflammatory and antioxidant properties—but they also successfully reduce the absorption of sugar as well as preserve a steadier blood glucose response. For example, PRRBAE can considerably lower the activity of starch-digesting enzymes, decreasing the rate of starch digestion in the drink and generating a sugar-control effect [ 15 6.4. Functional Starch-Based Films Starch–polyphenol complexes are also widely used in the development of food packaging materials, especially in the field of antioxidant packaging and smart packaging. Starch-based films are an ideal food packaging material due to their natural origins and degradability. The addition of polyphenols enhances the antioxidant capacity of the film and extends the shelf life of the food. For instance, a starch–PVA composite film with butterfly pea flower extract was shown to successfully prevent food from oxidizing, without compromising the film’s mechanical qualities [ 37 71 6.5. Medicinal Diets and Foods for Special Medical Purposes Starch–polyphenol complexes have shown significant advantages in the field of formulas for special medical purposes (FSMPs). First, by postponing the digestion of starches and promoting fullness, its low GI properties and high RS content not only help diabetic patients maintain stable blood glucose levels but also offer a safe and efficient dietary intervention for weight reduction and the requirements of older adults [ 72 69 However, despite their greater efficacy and selectivity and their potential to effectively address diseased processes in the near term, traditional medicines frequently have noticeably adverse physiological effects. Meanwhile, natural product foods—such as dietary supplements containing starch–polyphenol composites—are recognized for their mild and long-lasting modulation properties and are less likely to cause negative side effects. Polyphenols can enhance general health and fend off chronic illnesses by slowing down the rate at which starch is digested, working in concert with their antioxidant and anti-inflammatory properties [ 8 35 The lack of fully developed national norms and regulations has hindered the widespread use of starch–polyphenol composite meals for special medicinal purposes, despite their dual benefits in terms of functionality and safety. However, in the field of scientific research—specifically, medicinal dietary research—interest in the starch–polyphenol interaction mechanism is increasing; combined with the latest advances in molecular biology and genomics, it is expected that development in this area will lead to designs that can meet individualized nutritional needs, with precise intervention effects for functional FSMPs. Accordingly, research in this area will provide a new way of thinking in relation to the prevention and treatment of metabolic diseases, such as diabetes and obesity [ 11 38 6.6. Three-Dimensionally Printed Foods With the development of food science and technology, 3D printing technology has been introduced into food processing. Starch–polyphenol complexes have become an important raw material for low-digestibility 3D-printed foods due to their good rheological properties and printability. For example, a starch complex with 5% GA added shows an increase in RS content from 22.10% to 53.36% while maintaining excellent printability [ 73 6.7. Commercialized Products and Market Prospects Currently, although starch–polyphenol complexes have made significant progress in laboratory studies, most of the products are still in the research and development stage and have not been widely commercialized. Most of the low-GI foods and functional foods mentioned in the article are in the laboratory research stage or the small-scale production stage, and have not yet become mainstream market products. The lack of fully developed national norms and regulations has prevented the widespread use of starch–polyphenol composite meals. Scaling up to commercial production also entails higher costs for sourcing and purifying polyphenols, adapting existing equipment, and implementing process controls; moreover, technological hurdles are faced in attempts to achieve consistent complex formation, maintain stability under high-temperature processing and ensure sufficient shelf-life. Overcoming these regulatory, economic and technological barriers will be critical to unlocking the market potential of starch–polyphenol complexes. Nonetheless, starch–polyphenol complexes are anticipated to play a significant role in the future of the health food market due to the growing demand for functional foods and increasing consumer health consciousness, particularly in the treatment of diabetes and diets for weight loss, along the nutritional requirements of the aging population. 7. Conclusions and Outlook Starch–polyphenol interactions significantly alter the physicochemical properties and digestive behaviors of starch through noncovalent forces such as hydrogen bonding, hydrophobic interactions and electrostatic binding. By inhibiting α-amylase activity, polyphenols are inserted in the spiral cavity or surface of starch to form a V-type inclusion complex, which not only raises RS content but also diminishes the postprandial blood glucose peak and slows the rate of digestion. This ‘dual regulation’ process offers a natural approach for dietary interventions in metabolic illnesses by postponing the release of blood glucose while boosting the antioxidant and anti-inflammatory properties of polyphenols. Although starch–polyphenol complexes show great promise in regulating starch digestibility and developing functional foods, there are still many unanswered questions in current research. Unlike drugs that have precisely targeted objects of action with clear and efficient effects, natural products in food interact weakly and in a reversible manner; in addition, they require enhanced synergies between the various food components to achieve their effects. Among these, the most notable is the dearth of systematic research on evaluating the complexes’ bioavailability during in vivo metabolism and their long-term health impacts, which limits their legitimacy and the promotion of their application in precision nutrition interventions. Meanwhile, the complex three-dimensional binding mode between polyphenols and starch and its structure–function correlation have not been fully elucidated, meaning that the mechanism of the complex system remains unclear. Furthermore, the existing literature focuses primarily on the interaction of single polyphenols with specific starch fractions, lacking systematic comparative studies on the structure of multiple polyphenols with different starch types; this means that it is difficult to provide a comprehensive guide for compounding law and application strategy. To better understand the role of food therapy, future research should combine molecular dynamics simulation and in vivo experimental methods to build a theoretical and technical system. For example, it should systematically explore the dynamic binding mechanism of the starch–polyphenol complex and its metabolic pathway in the digestive process. Future research should also strengthen multidisciplinary integration, track the therapeutic mechanism of drugs and partially follow the evaluation method of drugs, in addition to reflecting the high content and variety of food-borne natural products. For instance, we can systematically explore the dynamic binding mechanism of starch–polyphenol complexes and their metabolic pathways in the digestive process to deepen our understanding of their functionality. Simultaneously, we can precisely demonstrate the relationship between the complexes’ conformational changes and physiological functions with the aid of high-throughput technologies such as SAXS and non-targeted metabolomics. We can also offer data support for the development of an integrated structure–performance–application model. On this basis, by optimizing the compounding conditions and processing techniques, the process adaptability and nutritional stability of the products can be improved, helping to promote their commercialization in the direction of low-GI food and smart packaging materials. With the deepening of theoretical research and application development, starch–polyphenol complexes are expected to be more essential in precise nutritional intervention, chronic disease management and the construction of sustainable food systems. Finally, inspired by the pipeline used in pharmaceutical development, future work should establish a closed-loop process that begins with in vitro screening, moves through detailed structural characterization and in vivo validation, continues with process optimization and ends with comprehensive functional evaluation; thus, a robust structure–performance–application framework can be formed which can accelerate the real-world deployment of low-glycemic-index foods and intelligent packaging solutions. Disclaimer/Publisher’s Note: Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflict of interest. References 1. Loro M.V. Lautenchleger F. Moura N.B. Hutra D.J. Silva J.A.G.D. Carvalho I.R. Bester A.U. Three decades of cassava cultivation in Brazil: Potentialities and perspectives Rev. Colomb. Cienc. Hortícolas 2021 15 e12087 10.17584/rcch.2021v15i2.12087 2. Yu J.K. Moon Y.S. Corn starch: Quality and quantity improvement for industrial uses Plants 2021 11 92 10.3390/plants11010092 35009095 PMC8747220 3. Lee H.-B. Kim H.R. Kang M.-C. Jeong D. Choi H.-D. Hong J.S. Park H.-Y. Structural characteristics of resistant starch-enriched rice during digestion and its effects on gut barrier function in high-fat induced obese mice Food Res. Int. 2023 170 113011 10.1016/j.foodres.2023.113011 37316078 4. Chen Y.-C. Cui W.-W. Huang G.-H. Long term effect on diabetic rats of feeding resistant starch Sci. Technol. Food Ind. 2014 20 374 378 10.13386/j.issn1002-0306.2014.20.074 5. Ye J. Yang R. Liu C. Luo S. Chen J. Hu X. Wu J. Improvement in freeze-thaw stability of rice starch gel by inulin and its mechanism Food Chem. 2018 268 324 333 10.1016/j.foodchem.2018.06.086 30064765 6. Guo H.B. Cultivation of lotus ( Nelumbo nucifera nucifera Genet. Resour. Crop Evol. 2008 56 323 330 10.1007/s10722-008-9366-2 7. Roberts S.B. High-glycemic index foods, hunger, and obesity: Is there a connection? Nutr. Rev. 2000 58 163 169 10.1111/j.1753-4887.2000.tb01855.x 10885323 8. Khan N. Mukhtar H. Tea polyphenols for health promotion Life Sci. 2007 81 519 533 10.1016/j.lfs.2007.06.011 17655876 PMC3220617 9. Miao L. Xu Y. Jia C. Zhang B. Niu M. Zhao S. Structural changes of rice starch and activity inhibition of starch digestive enzymes by anthocyanins retarded starch digestibility Carbohydr. Polym. 2021 261 117841 10.1016/j.carbpol.2021.117841 33766339 10. Zhang Q. Fan S. Xie H. Zhang Y. Fu L. Polyphenols from pigmented quinoa as potential modulators of maize starch digestion: Role of the starch-polyphenol inclusion and non-inclusion complexes Food Hydrocoll. 2023 144 108975 10.1016/j.foodhyd.2023.108975 11. Chai Y. Wang M. Zhang G. Interaction between amylose and tea polyphenols modulates the postprandial glycemic response to high-amylose maize starch J. Agric. Food Chem. 2013 61 8608 8615 10.1021/jf402821r 23964645 12. He X. Zhou L. Gunness P. Solah V.A. Sun Q. Lecithin enhances the complexation between pea starch and fatty acids in aqueous system, and affects the starch’s structure and enzymatic hydrolysis Food Chem. 2024 433 137326 10.1016/j.foodchem.2023.137326 37683491 13. Falcao L.S. Oliveira I.L. Gurgel R.S. de Souza A.T.F. Mendonca L.S. Usuda E.O. do Amaral T.S. Veggi P.C. Campelo P.H. de Vasconcellos M.C. Development of cassava starch-based films incorporated with phenolic compounds produced by an Amazonian fungus Int. J. Biol. Macromol. 2024 258 128882 10.1016/j.ijbiomac.2023.128882 38141712 14. Fan H. Chen Z. Ma R. Wen Y. Li H. Wang J. Sun B. Effect of alkyl chain length and amylose/amylopectin ratio on the structure and digestibility of starch-alkylresorcinols inclusion complexes Food Hydrocoll. 2022 133 107900 10.1016/j.foodhyd.2022.107900 15. Gutiérrez T.J. Tovar J. Update of the concept of type 5 resistant starch (RS5): Self-assembled starch V-type complexes Trends Food Sci. Technol. 2021 109 711 724 10.1016/j.tifs.2021.01.078 16. Pinto V.Z. Pilatti-Riccio D. Costa E.S.d. Micheletto Y.M.S. Quast E. Santos G.H.F.d. Phytochemical composition of extracts from yerba mate chimarrão SN Appl. Sci. 2021 3 353 10.1007/s42452-021-04373-2 17. Deng N. Deng Z. Tang C. Liu C. Luo S. Chen T. Hu X. Formation, structure and properties of the starch-polyphenol inclusion complex: A review Trends Food Sci. Technol. 2021 112 667 675 10.1016/j.tifs.2021.04.032 18. Zeng Z. Shunjing L. Liu C. Hu X. Gong E. Miao J. Phenolic retention of brown rice after extrusion with mesophilic α-amylase Food Biosci. 2018 21 8 13 10.1016/j.fbio.2017.10.008 19. Zhang W. Yang X. Xu Y. Liu B. Meng X. Effect of lactic acid bacteria fermentation on biotransformation of phenolic compounds and bioactivities of hawthorn pulp based on metabolomics Process Biochem. 2025 153 304 314 10.1016/j.procbio.2025.03.021 20. Zhang Y. Chen C. Chen Y. Chen Y. Effect of rice protein on the water mobility, water migration and microstructure of rice starch during retrogradation Food Hydrocoll. 2019 91 136 142 10.1016/j.foodhyd.2019.01.015 21. Wu Y. Liu Y. Jia Y. Zhang H. Ren F. Formation and application of starch-polyphenol complexes: Influencing factors and rapid screening based on chemometrics Foods 2024 13 1557 10.3390/foods13101557 38790857 PMC11121577 22. Chen Y.-S. Lai S.-B. Wen C.-T. The influence of green innovation performance on corporate advantage in Taiwan J. Bus. Ethics 2006 67 331 339 10.1007/s10551-006-9025-5 23. Li Y. Gao S. Ji X. Liu H. Liu N. Yang J. Lu M. Han L. Wang M. Evaluation studies on effects of quercetin with different concentrations on the physicochemical properties and in vitro digestibility of Tartary buckwheat starch Int. J. Biol. Macromol. 2020 163 1729 1737 10.1016/j.ijbiomac.2020.09.116 32979438 24. Guo J. Kong L. Enhancement of enzymatic resistance in V-type starch inclusion complexes by hydrothermal treatments Food Hydrocoll. 2022 127 107533 10.1016/j.foodhyd.2022.107533 25. Kong L. Ziegler G.R. Molecular encapsulation of ascorbyl palmitate in preformed V-type starch and amylose Carbohydr. Polym. 2014 111 256 263 10.1016/j.carbpol.2014.04.033 25037350 26. Tanaka T. Tsutsui A. Tanaka K. Yamamoto K. Kadokawa J.I. Evaluation of stability of amylose inclusion complexes depending on guest polymers and their application to supramolecular polymeric materials Biomolecules 2017 7 28 10.3390/biom7010028 28294979 PMC5372740 27. Chen L. Remondetto G.E. Subirade M. Food protein-based materials as nutraceutical delivery systems Trends Food Sci. Technol. 2006 17 272 283 10.1016/j.tifs.2005.12.011 28. Dong M. Zheng X. Li Q. Liu Y. Di X. Meng J. Li Z. Multi-effect coupling enhanced self-powered heterojunction ultraviolet photodetector with ultra-low detection limit Mater. Today 2024 74 85 93 10.1016/j.mattod.2024.03.004 29. Yang D. Guo Q. Li R. Chen L. Zheng B. Amylose content controls the V-type structural formation and in vitro digestibility of maize starch-resveratrol complexes and their effect on human gut microbiota Carbohydr. Polym. 2024 327 121702 10.1016/j.carbpol.2023.121702 38171666 30. Li H. Zhai F. Li J. Zhu X. Guo Y. Zhao B. Xu B. Physicochemical properties and structure of modified potato starch granules and their complex with tea polyphenols Int. J. Biol. Macromol. 2021 166 521 528 10.1016/j.ijbiomac.2020.10.209 33129907 31. Zhang L. Yang X. Li S. Gao W. Preparation, physicochemical characterization and in vitro digestibility on solid complex of maize starches with quercetin LWT-Food Sci. Technol. 2011 44 787 792 10.1016/j.lwt.2010.09.001 32. Li J. Yang X. Xiong C. Zhang J. Huang G. Cinnamic acid and its derivatives on dipeptidyl peptidase 4: Structure-activity relationship and mechanism of inhibition Food Biosci. 2024 62 105076 10.1016/j.fbio.2024.105076 33. Guo J. Yang L. Wang D. Lian X. Liu C. Research on the influences of two alcohol soluble glutenins on the retrogradation of wheat amylopectin/amylose Int. J. Biol. Macromol. 2021 183 463 472 10.1016/j.ijbiomac.2021.04.174 33932417 34. Zhu F. Interactions between starch and phenolic compound Trends Food Sci. Technol. 2015 43 129 143 10.1016/j.tifs.2015.02.003 35. Khan A. Khan A. Bhargav E. Rajesh K. Sowmya C. Nanosponges: A new approach for drug targetting Int. J. Adv. Pharm. Res. 2016 7 381 396 36. Barik S.K. Russell W.R. Moar K.M. Cruickshank M. Scobbie L. Duncan G. Hoggard N. The anthocyanins in black currants regulate postprandial hyperglycaemia primarily by inhibiting α-glucosidase while other phenolics modulate salivary α-amylase, glucose uptake and sugar transporters J. Nutr. Biochem. 2020 78 108325 10.1016/j.jnutbio.2019.108325 31952012 37. Escher G.B. Wen M. Zhang L. Rosso N.D. Granato D. Phenolic composition by UHPLC-Q-TOF-MS/MS and stability of anthocyanins from Clitoria ternatea Food Chem. 2020 331 127341 10.1016/j.foodchem.2020.127341 32569972 38. Wu J.-R. Cai Z. Wu G. Dai D. Liu Y.-Q. Yang Y.-W. Bottom-up solid-state molecular assembly via guest-induced intermolecular interactions J. Am. Chem. Soc. 2021 143 20395 20402 10.1021/jacs.1c10139 34817987 39. Singleton V.L. Orthofer R. Lamuela-Raventós R.M. [14] Analysis of total phenols and other oxidation substrates and antioxidants by means of folin-ciocalteu reagent Methods in Enzymology Academic Press Amsterdam, The Netherlands 1999 Volume 299 152 178 40. Galani J.H.Y. Mankad P.M. Shah A.K. Patel N.J. Acharya R.R. Talati J.G. Effect of storage temperature on vitamin C, total phenolics, UPLC phenolic acid profile and antioxidant capacity of eleven potato ( Solanum tuberosum Hortic. Plant J. 2017 3 73 89 10.1016/j.hpj.2017.07.004 41. Liu R. Xu C. Cong X. Wu T. Song Y. Zhang M. Effects of oligomeric procyanidins on the retrogradation properties of maize starch with different amylose/amylopectin ratios Food Chem. 2017 221 2010 2017 10.1016/j.foodchem.2016.10.131 27979193 42. Nara S. Komiya T. Studies on the relationship between water-satured state and crystallinity by the diffraction method for moistened potato starch Starch 2006 35 407 410 10.1002/star.19830351202 43. Liu H. Zhang M. Ma Q. Tian B. Nie C. Chen Z. Li J. Health beneficial effects of resistant starch on diabetes and obesity via regulation of gut microbiota: A review Food Funct. 2020 11 5749 5767 10.1039/D0FO00855A 32602874 44. He W. Wei C.A. critical review on structural properties and formation mechanism of heterogeneous starch granules in cereal endosperm lacking starch branching enzyme Food Hydrocoll. 2020 100 105434 10.1016/j.foodhyd.2019.105434 45. Chen N. Gao H.-X. He Q. Zeng W.-C. Potential application of phenolic compounds with different structural complexity in maize starch-based film Food Struct. 2023 36 100318 10.1016/j.foostr.2023.100318 46. Carter P. Trettin J.L. Lee T.-H. Chalgren N.L. Forrester M.J. Shanks B.H. Tessonnier J.-P. Cochran E.W. Bioenabled platform to access polyamides with built-in target properties J. Am. Chem. Soc. 2022 144 9548 9553 10.1021/jacs.2c01397 35522967 47. Deng N. Bian X. Luo S. Liu C. Hu X. The starch-polyphenol inclusion complex: Preparation, characterization and digestion Food Biosci. 2023 53 102655 10.1016/j.fbio.2023.102655 48. Brodkorb A. Egger L. Alminger M. Alvito P. Assunção R. Ballance S. Bohn T. Bourlieu-Lacanal C. Boutrou R. Carrière F. INFOGEST static in vitro simulation of gastrointestinal food digestion Nat. Protoc. 2019 14 991 1014 10.1038/s41596-018-0119-1 30886367 49. Bannwarth C. Ehlert S. Grimme S. GFN2-xTB-An accurate and broadly parametrized self-consistent tight-binding quantum chemical method with multipole electrostatics and density-dependent dispersion contributions J. Chem. Theory. Comput. 2019 15 1652 1671 10.1021/acs.jctc.8b01176 30741547 50. Trott O. Olson A.J. AutoDock Vina: Improving the speed and accuracy of docking with a new scoring function, efficient optimization, and multithreading J. Comput. Chem. 2010 31 455 461 10.1002/jcc.21334 19499576 PMC3041641 51. Jones G. Willett P. Glen R.C. Leach A.R. Taylor R. Development and validation of a genetic algorithm for flexible docking J. Mol. Biol. 1997 267 727 748 10.1006/jmbi.1996.0897 9126849 52. Li H. Leung K.S. Wong M.H. Ballester P.J. Improving AutoDock vina using random forest: The growing accuracy of binding affinity prediction by the effective exploitation of larger data sets Mol. Inform. 2015 34 115 126 10.1002/minf.201400132 27490034 53. Friesner R.A. Banks J.L. Murphy R.B. Halgren T.A. Klicic J.J. Mainz D.T. Repasky M.P. Knoll E.H. Shelley M. Perry J.K. Glide: A new approach for rapid, accurate docking and scoring. 1. Method and assessment of docking accuracy J. Med. Chem. 2004 47 1739 1749 10.1021/jm0306430 15027865 54. Kozakov D. Beglov D. Bohnuud T. Mottarella S.E. Xia B. Hall D.R. Vajda S. How good is automated protein docking? Proteins 2013 81 2159 2166 10.1002/prot.24403 23996272 PMC3934018 55. Ritchie D.W. Kemp G.J. Protein docking using spherical polar Fourier correlations Proteins 2000 39 178 194 10.1002/(SICI)1097-0134(20000501)39:2&#x0003c;178::AID-PROT8&#x0003e;3.0.CO;2-6 10737939 56. Grosdidier A. Zoete V. Michielin O. SwissDock, a protein-small molecule docking web service based on EADock DSS Nucleic Acids Res. 2011 39 W270 W277 10.1093/nar/gkr366 21624888 PMC3125772 57. Abraham M.J. Murtola T. Schulz R. Páll S. Smith J.C. Hess B. Lindahl E. GROMACS: High performance molecular simulations through multi-level parallelism from laptops to supercomputers SoftwareX 2015 1–2 19 25 10.1016/j.softx.2015.06.001 58. Brooks B.R. Brooks C.L. 3rd Mackerell A.D. Jr. Nilsson L. Petrella R.J. Roux B. Won Y. Archontis G. Bartels C. Boresch S. CHARMM: The biomolecular simulation program J. Comput. Chem. 2009 30 1545 1614 10.1002/jcc.21287 19444816 PMC2810661 59. Phillips J.C. Braun R. Wang W. Gumbart J. Tajkhorshid E. Villa E. Chipot C. Skeel R.D. Kalé L. Schulten K. Scalable molecular dynamics with NAMD J. Comput. Chem. 2005 26 1781 1802 10.1002/jcc.20289 16222654 PMC2486339 60. Plimpton S. Fast parallel algorithms for short-range molecular dynamics J. Comput. Phys. 1995 117 1 19 10.1006/jcph.1995.1039 61. Bowers K.J. Chow E. Xu H. Dror R.O. Eastwood M.P. Gregersen B.A. Klepeis J.L. Kolossvary I. Moraes M.A. Sacerdoti F.D. Scalable algorithms for molecular dynamics simulations on commodity clusters Proceedings of the 2006 ACM/IEEE Conference on Supercomputing Tampa, FL, USA 11–17 November 2006 84-es 62. Oostenbrink C. Villa A. Mark A.E. van Gunsteren W.F. A biomolecular force field based on the free enthalpy of hydration and solvation: The GROMOS force-field parameter sets 53A5 and 53A6 J. Comput. Chem. 2004 25 1656 1676 10.1002/jcc.20090 15264259 63. Bridson J.H. Al-Hakkak F. Steward D. Al-Hakkak J. Preparation and morphological, rheological, and structural characterisation of proanthocyanidin coated starch granules Ind. Crops Prod. 2019 130 285 291 10.1016/j.indcrop.2018.12.069 64. Chen N. Chen L. Gao H.X. Zeng W.C. Mechanism of bridging and interfering effects of tea polyphenols on starch molecules J. Food Process. Preserv. 2020 44 e14576 10.1111/jfpp.14576 65. Gao S. Liu H. Sun L. Cao J. Yang J. Lu M. Wang M. Rheological, thermal and in vitro digestibility properties on complex of plasma modified Tartary buckwheat starches with quercetin Food Hydrocoll. 2021 110 106209 10.1016/j.foodhyd.2020.106209 66. Benzie I.F. Strain J.J. The ferric reducing ability of plasma (FRAP) as a measure of “antioxidant power“: The FRAP assay Anal. Biochem. 1996 239 70 76 10.1006/abio.1996.0292 8660627 67. Ahmed S. Ahmad M. Swami B.L. Ikram S. A review on plants extract mediated synthesis of silver nanoparticles for antimicrobial applications: A green expertise J. Adv. Res. 2016 7 17 28 10.1016/j.jare.2015.02.007 26843966 PMC4703479 68. Tiozon R.J.N. Sartagoda K.J.D. Serrano L.M.N. Fernie A.R. Sreenivasulu N. Metabolomics based inferences to unravel phenolic compound diversity in cereals and its implications for human gut health Trends Food Sci. Technol. 2022 127 14 25 10.1016/j.tifs.2022.06.011 36090468 PMC9449372 69. Liu Z. Zhao Y. Zheng J. Wang Z. Yan X. Zhang T. Physicochemical and digestive properties of corn starch nanoparticles incorporated different polyphenols Int. J. Biol. Macromol. 2024 265 130681 10.1016/j.ijbiomac.2024.130681 38458285 70. Shen Y. Qi Y. Li L. Gui H. Gao T. Liu L. Li B. Zhao J. Prinyawiwatkul W. Xu Z. Structural interactions and mechanisms of amylose and amylopectin binding with cyanidin-3-O-glucoside Int. J. Biol. Macromol. 2025 306 141766 10.1016/j.ijbiomac.2025.141766 40049480 71. do Nascimento J.V. Silva K.A. Giuliangeli V.C. Mendes A.L.D. Piai L.P. Michels R.N. Dal Bosco T.C. Stroher G.R. Shirai M.A. Starch-PVA based films with Clitoria ternatea Int. J. Biol. Macromol. 2024 255 128232 10.1016/j.ijbiomac.2023.128232 37981283 72. Yu M. Qu C. Li D. Jiang Z. Liu J. Yang F. Liu C. Yue W. Wu Q. Study on the effects of endogenous polyphenols on the structure, physicochemical properties and in vitro digestive characteristics of Euryales Semen starch based on multi-spectroscopies, enzyme kinetics, molecular docking and molecular dynamics simulation Int. J. Biol. Macromol. 2024 282 137245 10.1016/j.ijbiomac.2024.137245 39505170 73. Li Z. Liu S. Hu X. Lang S. Wang C. Wang L. Zuo F. Structure-activity relationships of polyphenol-rice starch complexes: Impact on 3D printing and resistant starch formation Int. J. Biol. Macromol. 2025 307 141978 10.1016/j.ijbiomac.2025.141978 40081690 Figure 1 Molecular model of amylose V-type inclusion complex formation with hydrophobic guest molecules. Reprinted with permission from the authors of Ref. [ 26 Figure 2 Molecular model of amylose V-type inclusion complex formation with hydrophobic guest molecules. Adapted with permission from the authors of Ref. [ 27 Figure 3 Comparison of linear (amylose-rich) starch forming a V-type inclusion and branched (amylopectin-rich) starch forming multilevel network cross-linking. Adapted with permission from the authors of Ref. [ 21 Figure 4 Molecular docking analysis of cinnamic acid (CIA) and its derivatives with DPP4. ( A F left right A B C D E F F 32 foods-14-03219-t001_Table 1 Table 1 Comparative analysis of interaction differences between various polyphenol classes and starch types. Polyphenol Class Major Representative Binding Mode RS Increase (%) Δ Thermal Stability (°C) Reference Flavonoids Qu Hydrophobic interaction and hydrogen bonding 15–25 +25 [ 9 Phenolic acids CA Hydrogen bonding (amylose helix inclusion) 10–18 N/A [ 31 Anthocyanins Purple rice bran anthocyanin extract (PRRBAE) π–σ interactions and hydrogen bonding 20–30 N/A [ 34 Lignans PA Strong hydrogen bonding 12–22 N/A [ 23 foods-14-03219-t002_Table 2 Table 2 Characterization techniques for starch–polyphenol complexes. Category Technique/Method Principle Analytical Content Key Information Reference Component analysis GPC Separation by chain length Component content Polyphenol adsorption amount [ 3 LC-ESI-MS/MS Quantitative MS Molecular weight Starch chain length Structural analysis FTIR/ATR-FTIR Molecular vibration Chemical bonds OH-stretching peak shifts [ 9 XRD N/A Crystalline forms V-type characteristic peaks [ 5 NMR N/A Binding sites Chemical shift variations [ 10 Surface and morphology SEM Electron imaging Particle surface Surface roughness; starch dispersion [ 11 TEM Transmission imaging Internal nanostructure Nanoscale morphology [ 64 AFM AFM scanning N/A Nanostructural Thermal behavior DSC N/A Phase transition V-type inclusion [ 69  TGA Thermal decomposition Decomposition Particles and rheology DLS Particle size distribution Bimodal size [ 23 Steady shear/dynamic oscillation tests Rheological testing Viscoelastic parameters G′, G″, tan δ, σ₀, K and n [ 9 Digestive properties In vitro digestion Enzymatic hydrolysis Glucose release curves at different stages RDS/SDS/RS content; GI evaluation [ 57 Thermodynamics and modeling ITC Isothermal titration Binding constants ΔH, ΔS and ΔG [ 34 Molecular docking/molecular dynamics Computational modeling Thermodynamic Binding modes and [ 9 SAXS N/A Nanostructure Microstructural order/disorder Functional activity DPPH Radical scavenging Antioxidant capacity Free-radical scavenging rates [ 67 ABTS Hydrophilic and [ 38 FRAP Ferric ion reduction to ferrous ion Reducing power Antioxidant potential Cell assays Cell proliferation assays Biocompatibility Cell viability Other methods ASTM D-882 tensile Mechanical testing Mechanical properties Tensile strength [ 64 Untargeted MS-based metabolomics Metabolite fingerprinting Bioavailability [ 9 TLC Chromatography Separation efficiency Semi-quantitation Iodine binding Colorimetry Helical interference Interference index foods-14-03219-t003_Table 3 Table 3 Comparative analysis of characterization techniques for starch–polyphenol complexes. Technique Advantages Disadvantages References FTIR Rapid, non-destructive; highlights specific bond shifts Limited spatial resolution; overlapping peaks can complicate analysis [ 5 9 XRD Definitive identification of crystalline forms and V-type peaks Requires well-crystallized samples; bulk technique [ 42 NMR Detailed molecular-level binding information; quantitative Low sensitivity; expensive instrumentation; long acquisition times [ 44 SEM/TEM/AFM High-resolution imaging of surface and nano-morphology Sample preparation artifacts; only surface/topography information [ 11 64 DSC/TGA Accurate phase-transition and thermal-stability data No structural detail; can alter sample during heating [ 46 47 ITC Direct measurement of binding thermodynamics Large sample requirement; limited to soluble systems [ 48 Molecular docking and MD Rich visualization of binding sites; predicts binding energies Computationally intensive; may not capture full in vivo environment [ 11 49 DLS and rheology Quantifies particle size distribution and flow properties in solution Sensitive to polydispersity; requires well-dispersed suspensions [ 63 64 65 In vitro digestion Simulates physiological starch breakdown; yields RDS/SDS/RS fractions Simplified model may not reflect in vivo complexity [ 39 ",
  "metadata": {
    "Title of this paper": "Structure-activity relationships of polyphenol-rice starch complexes: Impact on 3D printing and resistant starch formation",
    "Journal it was published in:": "Foods",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469872/"
  }
}