{
  "title": "Paper_401",
  "abstract": "pmc Stem Cell Res Ther Stem Cell Res Ther 1238 stemcellres Stem Cell Research & Therapy 1757-6512 BMC PMC12481855 PMC12481855.1 12481855 12481855 41023749 10.1186/s13287-025-04599-6 4599 1 Review Head and neck cancer organoids: a panoramic perspective from basic construction to clinical translation Meng Ruoyu 1 Yu Lianpin 2 Li Xiaomei 1 Ning Na 3 Hao Haibin 1 Zhang Xiaonan 4 Kong Jiabing 4 Song Wei songwei@sdfmu.edu.cn 1 http://orcid.org/0009-0001-8840-5533 Li Xinyu lixinyu@sdfmu.edu.cn 1 1 https://ror.org/04983z422 grid.410638.8 0000 0000 8910 6733 Department of Oncology, Shandong Provincial Hospital Affiliated to Shandong First Medical University, 2 https://ror.org/04983z422 grid.410638.8 0000 0000 8910 6733 Oral and Maxillofacial Surgery Department, Shandong Provincial Hospital Affiliated to Shandong First Medical University, 3 4 https://ror.org/05jb9pq57 grid.410587.f Shandong First Medical University (Shandong Academy of Medical Sciences), 29 9 2025 2025 16 478640 534 20 2 2025 19 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Head and neck cancer (HNC), which refers to a heterogeneous group of malignancies, is a serious threat to human health. Its pathogenesis is complex, and the treatment faces many challenges. As an emerging in vitro three-dimensional (3D) model in recent years, organoids can highly mimic the structure and function of the source organs, which show unique advantages in the study of HNC. Patient-derived tumor organoids (PDTOs) can not only be used to explore the mechanism of tumor occurrence and development, but also provide a personalized drug sensitivity detection platform for precision medicine. Herein, we review the construction and application of HNC organoids and organoids-on-chips, discuss the advancement and effectiveness of this technology, the shortcomings and development direction of existing technologies in HNC field, hoping to provide reference for its further research and clinical transformation, and looking forward to its broad prospects in overcoming the difficult problems of HNC. Keywords Organoids Organoid-on-a-chip Head and neck cancer Precision medicine Key R&D Plan of Shandong Province (Major Science and Technology Innovation Project) 2022CXGC020501 2024CXGC010611 Li Xiaomei Song Wei Shandong Provincial Natural Science Foundation ZR2023QH405 Li Xinyu pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Organoids are self-organizing, miniature, in vitro organ models derived primarily from pluripotent stem cells, adult stem/progenitor cells, or even dissociated tumor tissues. Normal organoids used in physiological studies can be generated from pluripotent stem cells and adult stem cells; pluripotent stem cells can be embryonic stem cells or induced-pluripotent stem cells, while adult stem cells are generally separated from tissue samples [ 1 4 4 5 6 7 Science Nature Methods 8 10 11 12 10 13 16 17 18 19 20 21 22 23 24 25 Head and neck cancer (HNC) refers to a heterogeneous group of malignancies occurring below the skull base and above the chest, including nasopharyngeal cancer, oral cancer, tongue cancer, throat cancer, and thyroid cancer which are categorised by the anatomical sites [ 26 27 28 29 30 31 32 33 34 35 36 37 This paper provided an overview of the current state of HNC organoids (nasopharyngeal carcinoma/thyroid cancer/and HNSCC organoids) research. Herein, nasopharyngeal carcinoma is listed separately, and squamous cell tumors of other sites are classified as HNSCC. We focused on model construction, clinical applications, and industrialization, and discussed the obstacles and hurdles that need to be overcome to apply the HNC organoids from bench to bedside. Construction of HNC organoids PDTOs are mainly derived from tumor tissues of individuals, including solid surgical resection tissues, punch biopsies, and endoscopy samples. The most widely used generation processes of PDTOs are as follows: ① Removal of non-epithelial components (such as fat, muscle, necrotic debris) if any; ② Mince the tissue into small fragments, and decompose them into cell clusters or single-cell suspensions by physical/enzymatic hydrolysis; ③ Re-suspend the obtained cells (single cells or multiple cell clusters) with biological matrix gel and inoculate them into culture plates; ④ Add media containing various growth factors for organoids cultivation after the matrix gel solidified. PDTOs usually mature in 10–14 days, can be passed through, expanded, and maintained in culture for more than 10 generations [ 38 1 Table 1 Construction of head and neck tumor organoids Tumor type Cell source Culture method Characterization of the organoids Success rate (success number/sample number) References Nasopharyngeal carcinoma Biopsy or surgical samples from primary and recurrent nasopharyngeal carcinoma Matrigel embedding H&E staining; Immunohistochemistry (CK7); Immunofluorescence (CD44, CD131); EBV-encoded small RNA (EBER) in situ hybridization Primary: 47.06% (16/34) Recurrent: 82.15% (23/28) [ 46 Human nasopharyngeal carcinoma tissues Matrigel embedding H&E staining; Immunohistochemistry (AE1/3, Vimentin, CK5/6, p63, MST1R, LMP1, Ki67, and CD3e); Transcriptome sequencing; Whole-exome sequencing 93% (40/43)* [ 45 Recurrent nasopharyngeal cancer PDX models Modified CTOS cultivation method H&E staining; Immunofluorescence (integrin, EpCAM, pan-cytokeratin, CD44, CD131); EBV-encoded small RNA (EBER) in situ hybridization; RNA sequencing / [ 44 Papillary thyroid cancer Papillary thyroid cancer tissues Matrigel embedding H&E staining; Immunofluorescence (CK19, galectin-3, BRAF V600E / [ 36 Primary papillary thyroid cancer tissues Matrigel embedding H&E staining; Immunohistochemistry (CK19, galectin-3, thyroglobulin, Ki-67, CD117, TTF-1, ERα, ERβ and GPER); Whole-exome sequencing 71.4% (10/14) * [ 53 Papillary thyroid cancer tissues Matrigel embedding H&E staining; Immunofluorescence (CK19, galectin-3, galectin-1, Ki-67); qPCR (galectin-3, c-MET, TTF-1, Thyroglobulin) 77.6% (38/49) * [ 54 Papillary and anaplastic thyroid carcinomas Matrigel embedding based on sterile fine needle aspiration H&E staining; Immunohistochemistry (TTF-1, AE1/AE3); Immunofluorescence staining (CK8/18 for tumor cells, SMA for CAF) 98% (44/45) # [ 56 Head and neck squamous cell carcinoma HNSCC surgical specimens CTOS cultivation method H&E staining; Immunohistochemistry (Vimentin, CD68, Pankeratin, ALDH1A1, CD44), STR profiling, Human Papilloma Virus (HPV) genotyping, TP53 gene sequencing 30.2% (13/43) & [ 60 Tumor tissues (surgical resections or biopsies) originating in the oral cavity (floor of mouth, tongue, and gingiva/alveolar process), pharynx, larynx, salivary gland, nasal cavity, and neck BME embedding H&E staining; Immunohistochemistry (TP63, Ki67, KRT13,KRT5); Scanning Electron Microscopy; Targeted sequencing (on a panel of 54 oncogenes or tumor suppressors relevant to HNSCC, in one case an extended oncopanel of 140 genes); Whole-exome sequencing ~ 60% (31/not mentioned) * [ 59 OSCC surgical resections or biopsies (tongue, buccal region, gingiva, mouth, jaw) Matrigel embedding H&E staining; Immunohistochemistry (K5, α-SMA, CD44, Epcam, Vimentin,Ki67); STR analysis 86.2% (25/29) @ [ 89 HNSCC surgical resections or biopsies (oral cavity, oropharynx, hypopharynx, larynx) and para-carcinoma tissue BME embedding It is determined to be a tumor-derived organoid if growth continues in the presence of nutlin-3a and normal-derived organoid if it dies in the presence of nutlin-3a Tumor: 53.2% (133/250) Para-carcinoma tissue: (67.8/208) [ 63 Circulating tumor cells from head and neck cancer patients BCC substrate containing silica and PMMA particles Immunofluorescence (EpCAM +, CD45-) 92.5% (37/40) & [ 88 HNSCC surgical resections or biopsies (oral cavity, oropharynx, larynx, hypopharynx or carcinoma of unknown primary) Matrigel embedding H&E staining; Immunohistochemistry (CK5/6; p40; Ki67); whole exome sequencing D0: 35% (14/40); * D1: 28% (24/87); * D2: 24% (9/37); * [ 64 HNC patient surgical resections or biopsies BME embedding H&E staining; Immunohistochemistry (AE1AE3; CK13; p63; p16); SNP fingerprinting; whole exome sequencing; tumor samples: 28.4% (55/194); & normal (tumor-adjacent) samples: 32.6% (45/138); &metastatic tumor samples: 4.5% (1/22) & [ 66 Resected tongue cancer tissues from previously untreated tongue cancer patients Matrigel embedding H&E staining; Immunohistochemistry (p53; CK17); whole exome sequencing; 82.35% (28/34) [ 65 HNSCC (oral cavity, oropharynx, hypopharynx, and larynx) confirmed by surgical pathology or biopsy BME embedding H&E staining; Immunohistochemistry (p53; p63; cytokeratin); targeted sequencing covering 377 cancer-related genes 70% (27/39) * [ 67 CTOS, cancer tissue-originated spheroid; BCC, binary colloidal crystal; PMMA, polymethyl methacrylate. For the success rate, marked with * means that organoids could expand for 3 or more passages was considered as successful establishment. Marked with & means successfully expanded in vitro. Marked with # means\"Organoid formation in culture (≥ 3 weeks)”. Marked with @ Nasopharyngeal carcinoma organoids Nasopharyngeal carcinoma is a malignant tumor originating from epithelial cells and closely related to EB virus infection. There are significant geographical differences in the incidence of nasopharyngeal cancer, which occurs most frequently in southern China, Southeast Asia, and North Africa [ 39 40 41 43 44 45 46 44 46 Thyroid cancer organoids Thyroid cancer is one of the most common HNCs, and its incidence has been on the rise in recent years. In 2022, there were about 466,000 new cases of thyroid cancer in China, becoming the third most common cancer after lung cancer and colorectal cancer, and showing a younger trend [ 47 35 48 49 49 51 In 2018, Saito et al. successfully established mouse thyroid organoids with physiological functions of thyroglobulin synthesis, iodide uptake, and thyroid hormone production and release. After forced expression of carcinogenic NRAS (NRASQ61R) in thyroid organoids derived from p53 knockout mice and transplantation of the organoids into mice, a poorly differentiated thyroid cancer model was formed [ 52 36 53 56 36 53 57 55 56 HNSCC organoids HNSCC originates from the mucous epithelium of the mouth, pharynx, and larynx, and is the most common malignant tumor of the head and neck [ 58 34 1 59 67 68 64 59 63 69 60 70 59 61 HNC organoids-on-chips Organ-on-a-chip, also known as\"microphysiological system\", simulates the physiological function and environment of human organs in vitro by combining microfluid platforms with tissue engineering, and highly reproduces the microchannels and chambers of the physiological environment of human cells, with various advantages such as high sensitivity, high integration, high throughput and high efficiency [ 71 72 73 75 75 73 The combination of organoid technology and organ-on-a-chip technology is a very promising collaborative strategy, which can effectively solve the respective shortcomings of organoids and organ-on-a-chip, provide a more realistic model for new drug discovery, safety testing, disease diagnosis and treatment, and personalized medicine, and effectively bridge the gap between in vitro experiments and clinical applications [ 76 78 49 79 80 81 82 83 84 Technology of organoids-on-chips is a valuable tool for personalized evaluation of the effectiveness of various anti-tumor drugs (alone or in combination), dynamically monitoring the response of tissue samples to treatment, and improving patient outcomes by selecting the best individualized treatment strategy. However, the reports on HNC organoids-on-chips are rare at present. Integration of HNC organoids with bio-chip will accelerate the progression of HNC organoids and elevate the accuracy in mimicking human physiological and pathological conditions. Applications of HNC organoids The patient-derived HNC organoids have the advantages of being passable in vitro and retaining the original tumor characteristics, making them a promising research model. They can not only simulate the development process of tumors induced by pathogens and driver genes in vitro thereby studying the pathogenesis, but also test drugs for patients and explore individualized treatment plans. In addition, the established HNC organoids resource library provides strong support for drug development [ 59 60 64 67 85 86 1 Fig. 1 The applications of head and neck cancer organoids Disease modeling and basic research In recent years, with the continuous development of organoid technology, an increasing number of researchers have utilized it as an efficient biological model to study the mechanisms of tumor occurrence and development, and subsequently screen potential therapeutic targets. Zhao et al. studied the effect of lactate on oral squamous cell carcinoma (OSCC) cells using the OSCC organoid model. They found that lactate can promote the cancer stem cell phenotype in organoids, and MCT1 may be a potential therapeutic target for OSCC [ 70 87 62 44 Precision medicine and drug development Tumor precision therapy aims to tailor treatment plans to patients. Due to the significant heterogeneity among patients and the inability to accurately predict their responsiveness to different drugs before clinical treatment, selecting a more targeted and individualized treatment plan has become a major challenge in improving curative effects. PDTOs can be used for large-scale evaluation of the treatment response of multiple drugs or treatment plans for patients, thereby helping to formulate personalized intervention strategies. Chemotherapy drug sensitivity experiments based on organoids derived from circulating tumor cells in the blood of patients with HNC revealed that the sensitivity of cisplatin in organoid models is significantly correlated with the clinical treatment effect of patients. The treatment accuracy rate of the predicted chemotherapy response by the multivariate logistic regression model reaches 93.75%, suggesting that the organoid-based drug sensitivity test has the potential for clinical prediction of drug resistance and guidance for the treatment of patients with HNSCC [ 88 89 V600E V600E 36 53 90 91 92 59 64 66 67 59 131 131 85 In addition, PDTOs also have enormous potential in promoting the development of new drugs (including chemotherapy drugs and targeted drugs) and novel therapy strategies. Researchers have established radioiodine-avid organoids and radioiodine-refractory organoids. The radioiodine uptake is significantly higher in the radioiodine-avid organoids than in radioiodine-refractory organoids. When paired with the clinical information, a predictive sensitivity of 95% for distinguishing radioiodine-refractory from RAI-avid thyroid cancer patients was obtained with the threshold value of less than 250 cpm/10 5 93 94 44 86 59 Taken together, these studies illustrated that drug sensitivity tests and radiosensitivity tests conducted using HNC organoids not only help to realize personalized treatment, but also have a certain potential to expand the treatment of HNC. Tumor microenvironment and immunology research Tumor microenvironment (TME), which contains extracellular matrix, stromal cells (such as cancer-associated fibroblasts, CAFs), and immune cells, etc., exerts multiple effects on the phenotypes of tumors, including tumor growth, migration treatment response, and outcome [ 30 95 96 97 Organoid technology provides a new platform for exploring the mechanism of tumor-immune interaction and optimizing immunotherapy strategies. At present, organoid systems modeling the TME include two ways: the reconstituted TME and the holistic native TME. In the reconstituted TME, matrix-embedded PDTOs are co-cultured with exogenously added autologous peripheral or tumor-infiltrating immune cells (i.e., T cells, dendritic cells, myeloid cells, NK cells). For the holistic native TME models, the innate immune microenvironment of the tumor is preserved together with the tumor cells without undergoing reconstruction: mixing the tumor spheroids from enzymatically dissociated tumor tissues with collagen and injecting them into microfluidic culture devices; or embedding minced primary tissue fragments in collagen gels within an inner transwell dish for air–liquid interface (ALI) culture [ 30 98 99 100 100 102 Cancer-associated fibroblasts (CAFs), an important group of cells in the TME, play a vital role in tumorigenesis, metastasis, and treatment resistance via remodeling the extracellular matrix, promoting angiogenesis, and releasing soluble cytokines [ 103 104 105 106 107 108 109 Construction of HNC organoids bank PDTOs can undergo long-term stable passage, cryopreservation, resuscitation, and other operations without causing significant genome mutations or epigenetic changes, and can eventually form a live bank of organoids. As an important resource for tumor research and drug development, the tumor organoid sample live bank has attracted more and more attention. In recent years, organoid biobank has emerged for various tumor types, mainly including colorectal cancer, gastric cancer, pancreatic cancer, kidney cancer, lung cancer, ovarian cancer, breast cancer, bladder cancer, glioblastoma, etc. [ 110 Ding et al. and Wang et al. successfully constructed 40 and 39 nasopharyngeal carcinoma organoids, respectively [ 45 46 63 54 66 111 112 64 Currently, the infrastructure of biobanks is limited by the lack of centralized databases, unified HNC organoid biobanking standards, and quality control measures. Most academic biobanks are independently established and managed, with differences in organoid culture methods, data collection, and quality control indicators. Recently, there have been international efforts to collaborate on establishing centralized organoid biobanks, such as the HIT-CF project, and the Human Cancer Models Initiative involving the National Institutes of Health (USA), the Wellcome Sanger Institute (UK), Cancer Research UK, and HUB Organoids (Netherlands). Industrialization of HNC organoids In 2022, the FDA approved an IND study based on an organoid model in which scientists used organoid-on-a-chip systems to simulate the disease mechanisms of rare autoimmune neuropathy (demyelinating disease) to test the efficacy of drug candidates for rare diseases [ 113 114 115 In recent years, the National Medical Products Administration of China has also included novel in vitro evaluation technologies such as organoids and microfluidic chips into preclinical evaluation guidelines. Universities and pharmaceutical companies have also invested more funds in the research of organoids and organoids-on-a-chip [ 79 In the field of cancer precision medicine, organoid-based Drug Sensitivity Testing (DST) has become a turning point, as it simulates drug responses of patients by constructing\"miniature avatars\"in vitro, providing a scientific basis for individualized therapy. Jensen et al. reported in 2023 that the primary endpoint (progression-free survival (PFS) at two months) was met in half of the patients after received the treatment suggested by organoid-based DST in the precision cohort of 34 metastatic colorectal cancer patients following progression on or after standard therapy, indicating that organoid-based DST was were feasible in a cohort of metastatic colorectal cancer [ 116 117 118 Tumor organoid technology has preliminarily realized the transformation from laboratory to industry in just over ten years, showing broad prospects for industrial development. However, the development of HNC organoids is relatively slow. Establishing standardized technical systems and a quality control system for constructing HNC organoids as well as increasing cross-disciplinary talent cultivation will contribute to the industrialization of HNC organoids. Advantages and disadvantages of HNC organoids Immortalized tumor cell lines are usually homogenous, easy to operate, and the obtained experimental results are usually reproducible. Furthermore, they can grow indefinitely in simple and inexpensive medium, making it easy to conduct large-scale experiments, including high-throughput drug screening [ 119 120 120 121 2 Table 2 Comparison of in vivo and in vitro models of head and neck tumors Models 2D cell line PDTX Organoids Organoid on-a-chip Time needs for construction short long moderate moderate Success rate high Relative low Relative high / Expansion √ √ √ × Frozen storage and resuscitation √ √ √ × Microenvironment × √(Mouse microenvironment) Partially when co-cultured with other cells partially Genetic manipulability easy achievable achievable achievable Cost low high moderate high Ease of cultivation easy difficult relatively easy difficult Throughput high low moderate high 3D growth × √ √ √ Other advantages High reproducibility of results Partly reflects human physiological phenomena Having a partial function of an organ High controllability and standardization; tissue vascularization and perfusion Other drawbacks Inability to simulate human organ function; Can not accurately reflect the human physiological environment Species difference; Ethical problem Lack of angiogenesis; Uniformity, stability is difficult to guarantee; ethical issues System stability to be improved; Ethical problem Although the research on HNC organoids has made some progress, it still faces some challenges. First, organoids lack the complete diversity of cell types, vascular systems, or interactions with the immune system to fully replicate all the functions and complexities of mature organs [ 55 106 122 123 23 55 106 123 124 46 64 19 125 59 In addition to the current technical deficiencies, obtaining tissue samples from patients may involve privacy and information rights issues, especially when these samples may be used for different research purposes. Potential risks of abuse, such as commercial or illegal use without sufficient informed consent exist. Establishing effective ethical and regulatory frameworks will help protect patients'rights, balance interests, and promote the reasonable application of this technology in scientific research and clinical translation [ 79 Conclusions and perspectives A good biological model is of great significance for the research of HNC mechanisms, drug development, diagnosis, and treatment evaluation. HNC organoids have attracted more and more attention since their high imitation and extensibility. However, due to its technical threshold, the relatively low incidence and attention of nasopharyngeal cancer, etc., there are relatively few reports on this part. The establishment of organoid live banks for tumors with low incidence will provide more abundant samples for drug research and development. In the future, it is necessary to further optimize the culture system and form standardization, so that the culture system of organoids is closer to the living tumor microenvironment, thereby providing a better model for the development of precision medicine as well as drug research and development. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Ruoyu Meng, Lianpin Yu and Xiaomei Li are co-first authors and contributed equally to this work. Acknowledgements The authors declare that they have not use AI-generated work in this manuscript. Author contributions RM and LY: methodology, investigation, writing original draft. XL: methodology, investigation, writing original draft and funding acquisition. NN, HH, XZ and JK: methodology, investigation. WS: conceptualization, funding acquisition, project administration, supervision. XL: conceptualization, methodology, investigation, writing-review & editing and funding acquisition. Funding This work was funded by Key R&D Plan of Shandong Province (Major Science and Technology Innovation Project) (2022CXGC020501); Key R&D Plan of Shandong Province (Major Science and Technology Innovation Project) (2024CXGC010611) and Shandong Provincial Natural Science Foundation (ZR2023QH405). Availability of data and materials All data are included in the manuscript. Declarations Ethics approval and consent to participate Not applicable. Consent for publication All the authors approved the publication of this study. Competing interests Not applicable. References 1. Barker N Huch M Kujala P van de Wetering M Snippert HJ van Es JH Lgr5(+ve) stem cells drive self-renewal in the stomach and build long-lived gastric units in vitro Cell Stem Cell 2010 6 25 36 10.1016/j.stem.2009.11.013 20085740 Barker N, Huch M, Kujala P, van de Wetering M, Snippert HJ, van Es JH, et al. Lgr5(+ve) stem cells drive self-renewal in the stomach and build long-lived gastric units in vitro. Cell Stem Cell. 2010;6:25–36. 20085740 10.1016/j.stem.2009.11.013 2. Huch M Gehart H van Boxtel R Hamer K Blokzijl F Verstegen MM Long-term culture of genome-stable bipotent stem cells from adult human liver Cell 2015 160 299 312 10.1016/j.cell.2014.11.050 25533785 PMC4313365 Huch M, Gehart H, van Boxtel R, Hamer K, Blokzijl F, Verstegen MM, et al. Long-term culture of genome-stable bipotent stem cells from adult human liver. Cell. 2015;160:299–312. 25533785 10.1016/j.cell.2014.11.050 PMC4313365 3. Takebe T Zhang RR Koike H Kimura M Yoshizawa E Enomura M Generation of a vascularized and functional human liver from an iPSC-derived organ bud transplant Nat Protoc 2014 9 396 409 10.1038/nprot.2014.020 24457331 Takebe T, Zhang RR, Koike H, Kimura M, Yoshizawa E, Enomura M, et al. Generation of a vascularized and functional human liver from an iPSC-derived organ bud transplant. Nat Protoc. 2014;9:396–409. 24457331 10.1038/nprot.2014.020 4. Qu J Kalyani FS Liu L Cheng T Chen L Tumor organoids: synergistic applications, current challenges, and future prospects in cancer therapy Cancer Commun 2021 10.1002/cac2.12224 PMC8696219 34713636 Qu J, Kalyani FS, Liu L, Cheng T, Chen L. Tumor organoids: synergistic applications, current challenges, and future prospects in cancer therapy. Cancer Commun. 2021. 10.1002/cac2.12224. 10.1002/cac2.12224 PMC8696219 34713636 5. Tuveson D Clevers H Cancer modeling meets human organoid technology Science 2019 364 952 955 10.1126/science.aaw6985 31171691 Tuveson D, Clevers H. Cancer modeling meets human organoid technology. Science. 2019;364:952–5. 31171691 10.1126/science.aaw6985 6. Clevers H Modeling development and disease with organoids Cell 2016 165 1586 1597 10.1016/j.cell.2016.05.082 27315476 Clevers H. Modeling development and disease with organoids. Cell. 2016;165:1586–97. 27315476 10.1016/j.cell.2016.05.082 7. Sato T Vries RG Snippert HJ van de Wetering M Barker N Stange DE Single Lgr5 stem cells build crypt-villus structures in vitro without a mesenchymal niche Nature 2009 459 262 265 10.1038/nature07935 19329995 Sato T, Vries RG, Snippert HJ, van de Wetering M, Barker N, Stange DE, et al. Single Lgr5 stem cells build crypt-villus structures in vitro without a mesenchymal niche. Nature. 2009;459:262–5. 19329995 10.1038/nature07935 8. Fan H Demirci U Chen P Emerging organoid models: leaping forward in cancer research J Hematol Oncol 2019 12 142 10.1186/s13045-019-0832-4 31884964 PMC6936115 Fan H, Demirci U, Chen P. Emerging organoid models: leaping forward in cancer research. J Hematol Oncol. 2019;12: 142. 31884964 10.1186/s13045-019-0832-4 PMC6936115 9. Mazzocchi A Soker S Skardal A 3D bioprinting for high-throughput screening: drug screening, disease modeling, and precision medicine applications Appl Phys Rev 2019 6 011302 10.1063/1.5056188 33738018 PMC7968875 Mazzocchi A, Soker S, Skardal A. 3D bioprinting for high-throughput screening: drug screening, disease modeling, and precision medicine applications. Appl Phys Rev. 2019;6:011302. 33738018 10.1063/1.5056188 PMC7968875 10. Yang Q Li M Yang X Xiao Z Tong X Tuerdi A Flourishing tumor organoids: history, emerging technology, and application Bioeng Transl Med 2023 8 e10559 10.1002/btm2.10559 37693042 PMC10487342 Yang Q, Li M, Yang X, Xiao Z, Tong X, Tuerdi A, et al. Flourishing tumor organoids: history, emerging technology, and application. Bioeng Transl Med. 2023;8:e10559. 37693042 10.1002/btm2.10559 PMC10487342 11. Hidalgo M Amant F Biankin AV Budinská E Byrne AT Caldas C Patient-derived xenograft models: an emerging platform for translational cancer research Cancer Discov 2014 4 998 1013 10.1158/2159-8290.CD-14-0001 25185190 PMC4167608 Hidalgo M, Amant F, Biankin AV, Budinská E, Byrne AT, Caldas C, et al. Patient-derived xenograft models: an emerging platform for translational cancer research. Cancer Discov. 2014;4:998–1013. 25185190 10.1158/2159-8290.CD-14-0001 PMC4167608 12. Yoshida GJ Applications of patient-derived tumor xenograft models and tumor organoids J Hematol Oncol 2020 13 4 10.1186/s13045-019-0829-z 31910904 PMC6947974 Yoshida GJ. Applications of patient-derived tumor xenograft models and tumor organoids. J Hematol Oncol. 2020;13:4. 31910904 10.1186/s13045-019-0829-z PMC6947974 13. Saito R Kobayashi T Kashima S Matsumoto K Ogawa O Faithful preclinical mouse models for better translation to bedside in the field of immuno-oncology Int J Clin Oncol 2020 25 831 841 10.1007/s10147-019-01520-z 31407168 Saito R, Kobayashi T, Kashima S, Matsumoto K, Ogawa O. Faithful preclinical mouse models for better translation to bedside in the field of immuno-oncology. Int J Clin Oncol. 2020;25:831–41. 31407168 10.1007/s10147-019-01520-z 14. Ben-David U Ha G Tseng YY Greenwald NF Patient-derived xenografts undergo mouse-specific tumor evolution Nat Genet 2017 49 1567 1575 10.1038/ng.3967 28991255 PMC5659952 Ben-David U, Ha G, Tseng YY, Greenwald NF. Patient-derived xenografts undergo mouse-specific tumor evolution. Nat Genet. 2017;49:1567–75. 28991255 10.1038/ng.3967 PMC5659952 15. Kim J Koo BK Human organoids: model systems for human biology and medicine Nat Rev Mol Cell Biol 2020 21 571 584 10.1038/s41580-020-0259-3 32636524 PMC7339799 Kim J, Koo BK. Human organoids: model systems for human biology and medicine. Nat Rev Mol Cell Biol. 2020;21:571–84. 32636524 10.1038/s41580-020-0259-3 PMC7339799 16. Lancaster MA Knoblich JA Organogenesis in a dish: modeling development and disease using organoid technologies Science 2014 345 1247125 10.1126/science.1247125 25035496 Lancaster MA, Knoblich JA. Organogenesis in a dish: modeling development and disease using organoid technologies. Science. 2014;345:1247125. 25035496 10.1126/science.1247125 17. van Tienderen GS Rosmark O Lieshout R Willemse J de Weijer F Elowsson Rendin L Extracellular matrix drives tumor organoids toward desmoplastic matrix deposition and mesenchymal transition Acta Biomater 2023 158 115 131 10.1016/j.actbio.2022.11.038 36427688 van Tienderen GS, Rosmark O, Lieshout R, Willemse J, de Weijer F, Elowsson Rendin L, et al. Extracellular matrix drives tumor organoids toward desmoplastic matrix deposition and mesenchymal transition. Acta Biomater. 2023;158:115–31. 36427688 10.1016/j.actbio.2022.11.038 18. Nuciforo S Fofana I Matter MS Blumer T Calabrese D Boldanova T Organoid models of human liver cancers derived from tumor needle biopsies Cell Rep 2018 24 1363 1376 10.1016/j.celrep.2018.07.001 30067989 PMC6088153 Nuciforo S, Fofana I, Matter MS, Blumer T, Calabrese D, Boldanova T, et al. Organoid models of human liver cancers derived from tumor needle biopsies. Cell Rep. 2018;24:1363–76. 30067989 10.1016/j.celrep.2018.07.001 PMC6088153 19. Kim M Mun H Sung CO Cho EJ Patient-derived lung cancer organoids as in vitro cancer models for therapeutic screening Nat Commun 2019 10 3991 10.1038/s41467-019-11867-6 31488816 PMC6728380 Kim M, Mun H, Sung CO, Cho EJ. Patient-derived lung cancer organoids as in vitro cancer models for therapeutic screening. Nat Commun. 2019;10:3991. 31488816 10.1038/s41467-019-11867-6 PMC6728380 20. Seidlitz T Merker SR Rothe A Zakrzewski F von Neubeck C Grützmann K Human gastric cancer modelling using organoids Gut 2019 68 207 217 10.1136/gutjnl-2017-314549 29703791 PMC6352409 Seidlitz T, Merker SR, Rothe A, Zakrzewski F, von Neubeck C, Grützmann K, et al. Human gastric cancer modelling using organoids. Gut. 2019;68:207–17. 29703791 10.1136/gutjnl-2017-314549 PMC6352409 21. Chen P Zhang X Ding R Yang L Lyu X Zeng J Patient-derived organoids can guide personalized-therapies for patients with advanced breast cancer Adv Sci 2021 8 e2101176 10.1002/advs.202101176 PMC8596108 34605222 Chen P, Zhang X, Ding R, Yang L, Lyu X, Zeng J, et al. Patient-derived organoids can guide personalized-therapies for patients with advanced breast cancer. Adv Sci. 2021;8:e2101176. 10.1002/advs.202101176 PMC8596108 34605222 22. Wang H Ning X Zhao F Zhao H Li D Human organoids-on-chips for biomedical research and applications Theranostics 2024 14 788 818 10.7150/thno.90492 38169573 PMC10758054 Wang H, Ning X, Zhao F, Zhao H, Li D. Human organoids-on-chips for biomedical research and applications. Theranostics. 2024;14:788–818. 38169573 10.7150/thno.90492 PMC10758054 23. Zarrintaj P Saeb MR Stadler FJ Yazdi MK Nezhad MN Mohebbi S Human organs-on-chips: a review of the state-of-the-art, current prospects, and future challenges Adv Biol 2022 6 e2000526 10.1002/adbi.202000526 34837667 Zarrintaj P, Saeb MR, Stadler FJ, Yazdi MK, Nezhad MN, Mohebbi S, et al. Human organs-on-chips: a review of the state-of-the-art, current prospects, and future challenges. Adv Biol. 2022;6:e2000526. 10.1002/adbi.202000526 34837667 24. Xu H Jiao D Liu A Wu K Tumor organoids: applications in cancer modeling and potentials in precision medicine J Hematol Oncol 2022 15 58 10.1186/s13045-022-01278-4 35551634 PMC9103066 Xu H, Jiao D, Liu A, Wu K. Tumor organoids: applications in cancer modeling and potentials in precision medicine. J Hematol Oncol. 2022;15:58. 35551634 10.1186/s13045-022-01278-4 PMC9103066 25. Wang H Zhu W Xu C Su W Li Z Engineering organoids-on-chips for drug testing and evaluation Metabolism 2025 162 156065 10.1016/j.metabol.2024.156065 39522593 Wang H, Zhu W, Xu C, Su W, Li Z. Engineering organoids-on-chips for drug testing and evaluation. Metabolism. 2025;162:156065. 39522593 10.1016/j.metabol.2024.156065 26. Huang SH O'Sullivan B Overview of the 8th edition TNM classification for head and neck cancer Curr Treat Options Oncol 2017 18 40 10.1007/s11864-017-0484-y 28555375 Huang SH, O’Sullivan B. Overview of the 8th edition TNM classification for head and neck cancer. Curr Treat Options Oncol. 2017;18:40. 28555375 10.1007/s11864-017-0484-y 27. Basnayake B Leo P Rao S Vasani S Kenny L Haass NK Head and neck cancer patient-derived tumouroid cultures: opportunities and challenges Br J Cancer 2023 128 1807 1818 10.1038/s41416-023-02167-4 36765173 PMC10147637 Basnayake B, Leo P, Rao S, Vasani S, Kenny L, Haass NK. Head and neck cancer patient-derived tumouroid cultures: opportunities and challenges. Br J Cancer. 2023;128:1807–18. 36765173 10.1038/s41416-023-02167-4 PMC10147637 28. Sung H Ferlay J Siegel RL Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209 249 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71:209–49. 33538338 10.3322/caac.21660 29. Starska-Kowarska K Role of mesenchymal stem/stromal cells in head and neck cancer-regulatory mechanisms of tumorigenic and immune activity, chemotherapy resistance, and therapeutic benefits of stromal cell-based pharmacological strategies Cells 2024 10.3390/cells13151270 39120301 PMC11311692 Starska-Kowarska K. Role of mesenchymal stem/stromal cells in head and neck cancer-regulatory mechanisms of tumorigenic and immune activity, chemotherapy resistance, and therapeutic benefits of stromal cell-based pharmacological strategies. Cells. 2024. 10.3390/cells13151270. 39120301 10.3390/cells13151270 PMC11311692 30. Becker AS Oehmcke-Hecht S Dargel E Kaps P Freitag T Kreikemeyer B Preclinical in vitro Expert Opin Drug Discov 2025 20 81 101 10.1080/17460441.2024.2439456 39676285 Becker AS, Oehmcke-Hecht S, Dargel E, Kaps P, Freitag T, Kreikemeyer B, et al. Preclinical in vitro 39676285 10.1080/17460441.2024.2439456 31. Barsouk A Aluru JS Rawla P Epidemiology, risk factors, and prevention of head and neck squamous cell carcinoma Med Sci 2023 11 42 10.3390/medsci11020042 PMC10304137 37367741 Barsouk A, Aluru JS, Rawla P. Epidemiology, risk factors, and prevention of head and neck squamous cell carcinoma. Med Sci. 2023;11:42. 10.3390/medsci11020042 PMC10304137 37367741 32. Menezes FDS Fernandes GA Antunes JLF Villa LL Toporcov TN Global incidence trends in head and neck cancer for HPV-related and -unrelated subsites: a systematic review of population-based studies Oral Oncol 2021 115 105177 10.1016/j.oraloncology.2020.105177 33561611 Menezes FDS, Fernandes GA, Antunes JLF, Villa LL, Toporcov TN. Global incidence trends in head and neck cancer for HPV-related and -unrelated subsites: a systematic review of population-based studies. Oral Oncol. 2021;115:105177. 33561611 10.1016/j.oraloncology.2020.105177 33. Lee AWM Lee VHF Ng WT Strojan P Saba NF Rinaldo A A systematic review and recommendations on the use of plasma EBV DNA for nasopharyngeal carcinoma Eur J Cancer 2021 153 109 122 10.1016/j.ejca.2021.05.022 34153713 Lee AWM, Lee VHF, Ng WT, Strojan P, Saba NF, Rinaldo A, et al. A systematic review and recommendations on the use of plasma EBV DNA for nasopharyngeal carcinoma. Eur J Cancer. 2021;153:109–22. 34153713 10.1016/j.ejca.2021.05.022 34. Argiris A Karamouzis MV Raben D Ferris RL Head and neck cancer Lancet 2008 371 1695 1709 10.1016/S0140-6736(08)60728-X 18486742 PMC7720415 Argiris A, Karamouzis MV, Raben D, Ferris RL. Head and neck cancer. Lancet. 2008;371:1695–709. 18486742 10.1016/S0140-6736(08)60728-X PMC7720415 35. Xing M Molecular pathogenesis and mechanisms of thyroid cancer Nat Rev Cancer 2013 13 184 199 10.1038/nrc3431 23429735 PMC3791171 Xing M. Molecular pathogenesis and mechanisms of thyroid cancer. Nat Rev Cancer. 2013;13:184–99. 23429735 10.1038/nrc3431 PMC3791171 36. Chen D Su X Zhu L Jia H Han B Chen H Papillary thyroid cancer organoids harboring BRAF(V600E) mutation reveal potentially beneficial effects of BRAF inhibitor-based combination therapies J Transl Med 2023 21 9 10.1186/s12967-022-03848-z 36624452 PMC9827684 Chen D, Su X, Zhu L, Jia H, Han B, Chen H, et al. Papillary thyroid cancer organoids harboring BRAF(V600E) mutation reveal potentially beneficial effects of BRAF inhibitor-based combination therapies. J Transl Med. 2023;21: 9. 36624452 10.1186/s12967-022-03848-z PMC9827684 37. Schlumberger M Brose M Elisei R Leboulleux S Luster M Pitoia F Definition and management of radioactive iodine-refractory differentiated thyroid cancer Lancet Diabetes Endocrinol 2014 2 356 358 10.1016/S2213-8587(13)70215-8 24795243 Schlumberger M, Brose M, Elisei R, Leboulleux S, Luster M, Pitoia F, et al. Definition and management of radioactive iodine-refractory differentiated thyroid cancer. Lancet Diabetes Endocrinol. 2014;2:356–8. 24795243 10.1016/S2213-8587(13)70215-8 38. Driehuis E Kretzschmar K Establishment of patient-derived cancer organoids for drug-screening applications Nat Protoc 2020 15 3380 3409 10.1038/s41596-020-0379-4 32929210 Driehuis E, Kretzschmar K. Establishment of patient-derived cancer organoids for drug-screening applications. Nat Protoc. 2020;15:3380–409. 32929210 10.1038/s41596-020-0379-4 39. Cantù G Nasopharyngeal carcinoma. A \"different\" head and neck tumour. Part A: from histology to staging Acta Otorhinolaryngol Ital 2023 43 85 98 10.14639/0392-100X-N2222 37099432 PMC10132485 Cantù G. Nasopharyngeal carcinoma. A “different” head and neck tumour. Part A: from histology to staging. Acta Otorhinolaryngol Ital. 2023;43:85–98. 37099432 10.14639/0392-100X-N2222 PMC10132485 40. Lee AW Ma BB Ng WT Chan AT Management of nasopharyngeal carcinoma: current practice and future perspective J Clin Oncol 2015 33 3356 3364 10.1200/JCO.2015.60.9347 26351355 Lee AW, Ma BB, Ng WT, Chan AT. Management of nasopharyngeal carcinoma: current practice and future perspective. J Clin Oncol. 2015;33:3356–64. 26351355 10.1200/JCO.2015.60.9347 41. Sun X Su S Chen C Han F Zhao C Xiao W Long-term outcomes of intensity-modulated radiotherapy for 868 patients with nasopharyngeal carcinoma: an analysis of survival and treatment toxicities Radiother Oncol 2014 110 398 403 10.1016/j.radonc.2013.10.020 24231245 Sun X, Su S, Chen C, Han F, Zhao C, Xiao W, et al. Long-term outcomes of intensity-modulated radiotherapy for 868 patients with nasopharyngeal carcinoma: an analysis of survival and treatment toxicities. Radiother Oncol. 2014;110:398–403. 24231245 10.1016/j.radonc.2013.10.020 42. Chung AK OuYang CN Liu H Chao M Luo JD Lee CY Targeted sequencing of cancer-related genes in nasopharyngeal carcinoma identifies mutations in the TGF-β pathway Cancer Med 2019 8 5116 5127 10.1002/cam4.2429 31328403 PMC6718742 Chung AK, OuYang CN, Liu H, Chao M, Luo JD, Lee CY, et al. Targeted sequencing of cancer-related genes in nasopharyngeal carcinoma identifies mutations in the TGF-β pathway. Cancer Med. 2019;8:5116–27. 31328403 10.1002/cam4.2429 PMC6718742 43. Zhu H Qu S Deng Y Gong M Xiang Y Teng Y Application of organoids in otolaryngology: head and neck surgery Eur Arch Otorhinolaryngol 2024 281 4 1643 1649 10.1007/s00405-023-08348-4 38091101 PMC10942880 Zhu H, Qu S, Deng Y, Gong M, Xiang Y, Teng Y, et al. Application of organoids in otolaryngology: head and neck surgery. Eur Arch Otorhinolaryngol. 2024;281(4):1643–9. 38091101 10.1007/s00405-023-08348-4 PMC10942880 44. Lucky SS Law M Lui MH Mong J Shi J Yu S Patient-derived nasopharyngeal cancer organoids for disease modeling and radiation dose optimization Front Oncol 2021 11 622244 10.3389/fonc.2021.622244 33732646 PMC7959730 Lucky SS, Law M, Lui MH, Mong J, Shi J, Yu S, et al. Patient-derived nasopharyngeal cancer organoids for disease modeling and radiation dose optimization. Front Oncol. 2021;11:622244. 33732646 10.3389/fonc.2021.622244 PMC7959730 45. Ding RB Chen P Rajendran BK Lyu X Wang H Bao J Molecular landscape and subtype-specific therapeutic response of nasopharyngeal carcinoma revealed by integrative pharmacogenomics Nat Commun 2021 12 3046 10.1038/s41467-021-23379-3 34031426 PMC8144567 Ding RB, Chen P, Rajendran BK, Lyu X, Wang H, Bao J, et al. Molecular landscape and subtype-specific therapeutic response of nasopharyngeal carcinoma revealed by integrative pharmacogenomics. Nat Commun. 2021;12:3046. 34031426 10.1038/s41467-021-23379-3 PMC8144567 46. Wang XW Xia TL Tang HC Liu X Han R Zou X Establishment of a patient-derived organoid model and living biobank for nasopharyngeal carcinoma Ann Transl Med 2022 10 526 10.21037/atm-22-1076 35928731 PMC9347035 Wang XW, Xia TL, Tang HC, Liu X, Han R, Zou X, et al. Establishment of a patient-derived organoid model and living biobank for nasopharyngeal carcinoma. Ann Transl Med. 2022;10:526. 35928731 10.21037/atm-22-1076 PMC9347035 47. Han B Zheng R Zeng H Wang S Sun K Chen R Cancer incidence and mortality in China, 2022 J Natl Cancer Cent 2024 4 47 53 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 Han B, Zheng R, Zeng H, Wang S, Sun K, Chen R, et al. Cancer incidence and mortality in China, 2022. J Natl Cancer Cent. 2024;4:47–53. 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 48. Wang Q Sun S Sun G Han B Zhang S Zheng X Histone modification inhibitors: an emerging frontier in thyroid Cancer therapy Cell Signal 2025 131 111703 10.1016/j.cellsig.2025.111703 40044017 Wang Q, Sun S, Sun G, Han B, Zhang S, Zheng X, et al. Histone modification inhibitors: an emerging frontier in thyroid Cancer therapy. Cell Signal. 2025;131:111703. 40044017 10.1016/j.cellsig.2025.111703 49. Prete A Matrone A State of the art in 3D culture models applied to thyroid cancer Medicina (B Aires) 2024 10.3390/medicina60040520 PMC11051914 38674166 Prete A, Matrone A. State of the art in 3D culture models applied to thyroid cancer. Medicina (B Aires). 2024. 10.3390/medicina60040520. 10.3390/medicina60040520 PMC11051914 38674166 50. Sampson E Brierley JD Le LW Rotstein L Tsang RW Clinical management and outcome of papillary and follicular (differentiated) thyroid cancer presenting with distant metastasis at diagnosis Cancer 2007 110 1451 1456 10.1002/cncr.22956 17705176 Sampson E, Brierley JD, Le LW, Rotstein L, Tsang RW. Clinical management and outcome of papillary and follicular (differentiated) thyroid cancer presenting with distant metastasis at diagnosis. Cancer. 2007;110:1451–6. 17705176 10.1002/cncr.22956 51. Chew D Green V Riley A England RJ Greenman J The changing face of in vitro Front Surg 2020 7 43 10.3389/fsurg.2020.00043 32766274 PMC7378741 Chew D, Green V, Riley A, England RJ, Greenman J. The changing face of in vitro 32766274 10.3389/fsurg.2020.00043 PMC7378741 52. Saito Y Onishi N Takami H Seishima R Inoue H Hirata Y Development of a functional thyroid model based on an organoid culture system Biochem Biophys Res Commun 2018 497 783 789 10.1016/j.bbrc.2018.02.154 29470983 Saito Y, Onishi N, Takami H, Seishima R, Inoue H, Hirata Y, et al. Development of a functional thyroid model based on an organoid culture system. Biochem Biophys Res Commun. 2018;497:783–9. 29470983 10.1016/j.bbrc.2018.02.154 53. Chen D Tan Y Li Z Li W Yu L Chen W Organoid cultures derived from patients with Papillary thyroid cancer J Clin Endocrinol Metab 2021 106 1410 1426 10.1210/clinem/dgab020 33524147 Chen D, Tan Y, Li Z, Li W, Yu L, Chen W, et al. Organoid cultures derived from patients with Papillary thyroid cancer. J Clin Endocrinol Metab. 2021;106:1410–26. 33524147 10.1210/clinem/dgab020 54. Yang H Liang Q Zhang J Liu J Wei H Chen H Establishment of papillary thyroid cancer organoid lines from clinical specimens Front Endocrinol (Lausanne) 2023 14 1140888 10.3389/fendo.2023.1140888 36992805 PMC10040568 Yang H, Liang Q, Zhang J, Liu J, Wei H, Chen H, et al. Establishment of papillary thyroid cancer organoid lines from clinical specimens. Front Endocrinol (Lausanne). 2023;14:1140888. 36992805 10.3389/fendo.2023.1140888 PMC10040568 55. Baregamian N Sekhar KR Krystofiak ES Vinogradova M Thomas G Mannoh E Engineering functional 3-dimensional patient-derived endocrine organoids for broad multiplatform applications Surgery 2023 173 67 75 10.1016/j.surg.2022.09.027 36400581 PMC9939934 Baregamian N, Sekhar KR, Krystofiak ES, Vinogradova M, Thomas G, Mannoh E, et al. Engineering functional 3-dimensional patient-derived endocrine organoids for broad multiplatform applications. Surgery. 2023;173:67–75. 36400581 10.1016/j.surg.2022.09.027 PMC9939934 56. Vilgelm AE Bergdorf K Wolf M Bharti V Shattuck-Brandt R Blevins A Fine-needle aspiration-based patient-derived cancer organoids iScience 2020 23 101408 10.1016/j.isci.2020.101408 32771978 PMC7415927 Vilgelm AE, Bergdorf K, Wolf M, Bharti V, Shattuck-Brandt R, Blevins A, et al. Fine-needle aspiration-based patient-derived cancer organoids. iScience. 2020;23:101408. 32771978 10.1016/j.isci.2020.101408 PMC7415927 57. Pecce V Sponziello M Bini S Grani G Durante C Verrienti A Establishment and maintenance of thyroid organoids from human cancer cells STAR Protoc 2022 3 101393 10.1016/j.xpro.2022.101393 35600922 PMC9115321 Pecce V, Sponziello M, Bini S, Grani G, Durante C, Verrienti A. Establishment and maintenance of thyroid organoids from human cancer cells. STAR Protoc. 2022;3:101393. 35600922 10.1016/j.xpro.2022.101393 PMC9115321 58. Johnson DE Burtness B Leemans CR Lui VWY Bauman JE Grandis JR Head and neck squamous cell carcinoma Nat Rev Dis Primers 2020 6 92 10.1038/s41572-020-00224-3 33243986 PMC7944998 Johnson DE, Burtness B, Leemans CR, Lui VWY, Bauman JE, Grandis JR. Head and neck squamous cell carcinoma. Nat Rev Dis Primers. 2020;6:92. 33243986 10.1038/s41572-020-00224-3 PMC7944998 59. Driehuis E Kolders S Spelier S Lõhmussaar K Willems SM Devriese LA Oral mucosal organoids as a potential platform for personalized cancer therapy Cancer Discov 2019 9 852 871 10.1158/2159-8290.CD-18-1522 31053628 Driehuis E, Kolders S, Spelier S, Lõhmussaar K, Willems SM, Devriese LA, et al. Oral mucosal organoids as a potential platform for personalized cancer therapy. Cancer Discov. 2019;9:852–71. 31053628 10.1158/2159-8290.CD-18-1522 60. Tanaka N Osman AA Takahashi Y Lindemann A Patel AA Zhao M Head and neck cancer organoids established by modification of the CTOS method can be used to predict in vivo drug sensitivity Oral Oncol 2018 87 49 57 10.1016/j.oraloncology.2018.10.018 30527243 PMC6294331 Tanaka N, Osman AA, Takahashi Y, Lindemann A, Patel AA, Zhao M, et al. Head and neck cancer organoids established by modification of the CTOS method can be used to predict in vivo drug sensitivity. Oral Oncol. 2018;87:49–57. 30527243 10.1016/j.oraloncology.2018.10.018 PMC6294331 61. Zhang XY Sui Y Shan XF Construction of oral squamous cell carcinoma organoids in vitro 3D-culture for drug screening Oral Dis 2024 10.1111/odi.15044 38887128 Zhang XY, Sui Y, Shan XF. Construction of oral squamous cell carcinoma organoids in vitro 3D-culture for drug screening. Oral Dis. 2024. 10.1111/odi.15044. 38887128 10.1111/odi.15044 62. Yang J Lewis JS Zi J Andl T Lee E Andl CD Interaction of the tumor suppressor SMAD4 and WNT signaling in progression to oral squamous cell carcinoma J Pathol 2024 264 4 16 10.1002/path.6318 38922866 PMC11300146 Yang J, Lewis JS, Zi J, Andl T, Lee E, Andl CD, et al. Interaction of the tumor suppressor SMAD4 and WNT signaling in progression to oral squamous cell carcinoma. J Pathol. 2024;264:4–16. 38922866 10.1002/path.6318 PMC11300146 63. de Kort WWB Millen R Driehuis E Devriese LA van Es RJJ Willems SM Clinicopathological factors as predictors for establishment of patient derived head and neck squamous cell carcinoma organoids Head Neck Pathol 2024 18 59 10.1007/s12105-024-01658-x 38940869 PMC11213837 de Kort WWB, Millen R, Driehuis E, Devriese LA, van Es RJJ, Willems SM. Clinicopathological factors as predictors for establishment of patient derived head and neck squamous cell carcinoma organoids. Head Neck Pathol. 2024;18:59. 38940869 10.1007/s12105-024-01658-x PMC11213837 64. Fisch AS Pestana A Sachse V Doll C Hofmann E Heiland M Feasibility analysis of using patient-derived tumour organoids for treatment decision guidance in locally advanced head and neck squamous cell carcinoma Eur J Cancer 2024 213 115100 10.1016/j.ejca.2024.115100 39476443 Fisch AS, Pestana A, Sachse V, Doll C, Hofmann E, Heiland M, et al. Feasibility analysis of using patient-derived tumour organoids for treatment decision guidance in locally advanced head and neck squamous cell carcinoma. Eur J Cancer. 2024;213:115100. 39476443 10.1016/j.ejca.2024.115100 65. Sase M Sato T Sato H Miya F Zhang S Haeno H Comparative analysis of tongue cancer organoids among patients identifies the heritable nature of minimal residual disease Dev Cell 2025 60 396 413.e6 10.1016/j.devcel.2024.10.007 39504967 Sase M, Sato T, Sato H, Miya F, Zhang S, Haeno H, et al. Comparative analysis of tongue cancer organoids among patients identifies the heritable nature of minimal residual disease. Dev Cell. 2025;60:396-413.e6. 39504967 10.1016/j.devcel.2024.10.007 66. Millen R De Kort WWB Koomen M van Son GJF Gobits R Penning de Vries B Patient-derived head and neck cancer organoids allow treatment stratification and serve as a tool for biomarker validation and identification Med 2023 4 290 310.e12 10.1016/j.medj.2023.04.003 37178682 Millen R, De Kort WWB, Koomen M, van Son GJF, Gobits R, Penning de Vries B, et al. Patient-derived head and neck cancer organoids allow treatment stratification and serve as a tool for biomarker validation and identification. Med. 2023;4:290-310.e12. 37178682 10.1016/j.medj.2023.04.003 67. Choi SY Shim J Gu DE Kim SY Kim HJ Shin DY Clonal evolution of long-term expanding head and neck cancer organoid: impact on treatment response for personalized therapeutic screening Oral Oncol 2023 146 106571 10.1016/j.oraloncology.2023.106571 37741019 Choi SY, Shim J, Gu DE, Kim SY, Kim HJ, Shin DY, et al. Clonal evolution of long-term expanding head and neck cancer organoid: impact on treatment response for personalized therapeutic screening. Oral Oncol. 2023;146:106571. 37741019 10.1016/j.oraloncology.2023.106571 68. Parikh AS Yu VX Flashner S Okolo OB Lu C Henick BS Patient-derived three-dimensional culture techniques model tumor heterogeneity in head and neck cancer Oral Oncol 2023 138 106330 10.1016/j.oraloncology.2023.106330 36773387 PMC10126876 Parikh AS, Yu VX, Flashner S, Okolo OB, Lu C, Henick BS, et al. Patient-derived three-dimensional culture techniques model tumor heterogeneity in head and neck cancer. Oral Oncol. 2023;138:106330. 36773387 10.1016/j.oraloncology.2023.106330 PMC10126876 69. Karakasheva TA Kijima T Shimonosono M Maekawa H Sahu V Gabre JT Generation and characterization of patient-derived head and neck, oral, and esophageal cancer organoids Curr Protoc Stem Cell Biol 2020 53 e109 10.1002/cpsc.109 32294323 PMC7350550 Karakasheva TA, Kijima T, Shimonosono M, Maekawa H, Sahu V, Gabre JT, et al. Generation and characterization of patient-derived head and neck, oral, and esophageal cancer organoids. Curr Protoc Stem Cell Biol. 2020;53:e109. 32294323 10.1002/cpsc.109 PMC7350550 70. Zhao H Hu CY Chen WM Huang P Lactate promotes cancer stem-like property of oral sequamous cell carcinoma Curr Med Sci 2019 39 403 409 10.1007/s11596-019-2050-2 31209810 Zhao H, Hu CY, Chen WM, Huang P. Lactate promotes cancer stem-like property of oral sequamous cell carcinoma. Curr Med Sci. 2019;39:403–9. 31209810 10.1007/s11596-019-2050-2 71. Cao UMN Zhang Y Chen J Sayson D Pillai S Microfluidic organ-on-a-chip: a guide to biomaterial choice and fabrication Int J Mol Sci 2023 24 3232 10.3390/ijms24043232 36834645 PMC9966054 Cao UMN, Zhang Y, Chen J, Sayson D, Pillai S. Microfluidic organ-on-a-chip: a guide to biomaterial choice and fabrication. Int J Mol Sci. 2023;24:3232. 36834645 10.3390/ijms24043232 PMC9966054 72. Koyilot MC Natarajan P Breakthroughs and applications of organ-on-a-chip technology Cells 2022 10.3390/cells11111828 35681523 PMC9180073 Koyilot MC, Natarajan P. Breakthroughs and applications of organ-on-a-chip technology. Cells. 2022. 10.3390/cells11111828. 35681523 10.3390/cells11111828 PMC9180073 73. Cheah R Srivastava R Stafford ND Beavis AW Green V Greenman J Measuring the response of human head and neck squamous cell carcinoma to irradiation in a microfluidic model allowing customized therapy Int J Oncol 2017 51 1227 1238 10.3892/ijo.2017.4118 28902347 Cheah R, Srivastava R, Stafford ND, Beavis AW, Green V, Greenman J. Measuring the response of human head and neck squamous cell carcinoma to irradiation in a microfluidic model allowing customized therapy. Int J Oncol. 2017;51:1227–38. 28902347 10.3892/ijo.2017.4118 74. Kennedy R Kuvshinov D Sdrolia A Kuvshinova E Hilton K Crank S A patient tumour-on-a-chip system for personalised investigation of radiotherapy based treatment regimens Sci Rep 2019 9 6327 10.1038/s41598-019-42745-2 31004114 PMC6474873 Kennedy R, Kuvshinov D, Sdrolia A, Kuvshinova E, Hilton K, Crank S, et al. A patient tumour-on-a-chip system for personalised investigation of radiotherapy based treatment regimens. Sci Rep. 2019;9:6327. 31004114 10.1038/s41598-019-42745-2 PMC6474873 75. Hattersley SM Sylvester DC Dyer CE Stafford ND Haswell SJ Greenman J A microfluidic system for testing the responses of head and neck squamous cell carcinoma tissue biopsies to treatment with chemotherapy drugs Ann Biomed Eng 2012 40 1277 1288 10.1007/s10439-011-0428-9 21997391 Hattersley SM, Sylvester DC, Dyer CE, Stafford ND, Haswell SJ, Greenman J. A microfluidic system for testing the responses of head and neck squamous cell carcinoma tissue biopsies to treatment with chemotherapy drugs. Ann Biomed Eng. 2012;40:1277–88. 21997391 10.1007/s10439-011-0428-9 76. Takebe T Zhang B Radisic M Synergistic engineering: organoids meet organs-on-a-chip Cell Stem Cell 2017 21 297 300 10.1016/j.stem.2017.08.016 28886364 Takebe T, Zhang B, Radisic M. Synergistic engineering: organoids meet organs-on-a-chip. Cell Stem Cell. 2017;21:297–300. 28886364 10.1016/j.stem.2017.08.016 77. Zommiti M Connil N Organs-on-chips platforms are everywhere: a zoom on biomedical investigation Bioengineering 2022 9 646 10.3390/bioengineering9110646 36354557 PMC9687856 Zommiti M, Connil N. Organs-on-chips platforms are everywhere: a zoom on biomedical investigation. Bioengineering. 2022;9:646. 36354557 10.3390/bioengineering9110646 PMC9687856 78. Au SH Chamberlain MD Mahesh S Sefton MV Wheeler AR Hepatic organoids for microfluidic drug screening Lab Chip 2014 14 3290 3299 10.1039/C4LC00531G 24984750 Au SH, Chamberlain MD, Mahesh S, Sefton MV, Wheeler AR. Hepatic organoids for microfluidic drug screening. Lab Chip. 2014;14:3290–9. 24984750 10.1039/c4lc00531g 79. Geng Q Xu Y Hu Y Wang L Wang Y Fan Z Progress in the application of organoids-on-a-chip in diseases Organogenesis 2024 20 2386727 10.1080/15476278.2024.2386727 39126669 PMC11318694 Geng Q, Xu Y, Hu Y, Wang L, Wang Y, Fan Z, et al. Progress in the application of organoids-on-a-chip in diseases. Organogenesis. 2024;20:2386727. 39126669 10.1080/15476278.2024.2386727 PMC11318694 80. Shirure VS Bi Y Curtis MB Lezia A Tumor-on-a-chip platform to investigate progression and drug sensitivity in cell lines and patient-derived organoids Lab Chip 2018 18 3687 3702 10.1039/C8LC00596F 30393802 PMC10644986 Shirure VS, Bi Y, Curtis MB, Lezia A. Tumor-on-a-chip platform to investigate progression and drug sensitivity in cell lines and patient-derived organoids. Lab Chip. 2018;18:3687–702. 30393802 10.1039/c8lc00596f PMC10644986 81. Du Y Wang YR Bao QY Xu XX Xu C Wang S Personalized vascularized tumor organoid-on-a-chip for tumor metastasis and therapeutic targeting assessment Adv Mater 2025 37 2412815 10.1002/adma.202412815 39726096 Du Y, Wang YR, Bao QY, Xu XX, Xu C, Wang S, et al. Personalized vascularized tumor organoid-on-a-chip for tumor metastasis and therapeutic targeting assessment. Adv Mater. 2025;37:2412815. 10.1002/adma.202412815 39726096 82 Carvalho DJ Kip AM Romitti M Nazzari M Tegel A Stich M Thyroid-on-a-chip: an organoid platform for in vitro assessment of endocrine disruption Adv Healthc Mater 2023 12 e2201555 10.1002/adhm.202201555 36546709 PMC11468662 Carvalho DJ, Kip AM, Romitti M, Nazzari M, Tegel A, Stich M, et al. Thyroid-on-a-chip: an organoid platform for in vitro assessment of endocrine disruption. Adv Healthc Mater. 2023;12:e2201555. 36546709 10.1002/adhm.202201555 PMC11468662 83. Kühnlenz J Karwelat D Steger-Hartmann T Raschke M Bauer S Vural Ö A microfluidic thyroid-liver platform to assess chemical safety in humans Altex 2023 40 61 82 35536601 10.14573/altex.2108261 Kühnlenz J, Karwelat D, Steger-Hartmann T, Raschke M, Bauer S, Vural Ö, et al. A microfluidic thyroid-liver platform to assess chemical safety in humans. Altex. 2023;40:61–82. 35536601 10.14573/altex.2108261 84. Karwelat D Kühnlenz J Steger-Hartmann T Bars R Tinwell H Marx U A rodent thyroid-liver chip to capture thyroid toxicity on organ function level Altex 2023 40 83 102 35791291 10.14573/altex.2108262 Karwelat D, Kühnlenz J, Steger-Hartmann T, Bars R, Tinwell H, Marx U, et al. A rodent thyroid-liver chip to capture thyroid toxicity on organ function level. Altex. 2023;40:83–102. 35791291 10.14573/altex.2108262 85. Sondorp LHJ Ogundipe VML Patient-derived papillary thyroid cancer organoids for radioactive iodine refractory screening Cancers (Basel) 2020 10.3390/cancers12113212 33142750 PMC7692469 Sondorp LHJ, Ogundipe VML. Patient-derived papillary thyroid cancer organoids for radioactive iodine refractory screening. Cancers (Basel). 2020. 10.3390/cancers12113212. 33142750 10.3390/cancers12113212 PMC7692469 86. Driehuis E Spelier S Beltrán Hernández I de Bree R S MW Clevers H Patient-derived head and neck cancer organoids recapitulate EGFR expression levels of respective tissues and are responsive to EGFR-targeted photodynamic therapy J Clin Med 2019 8 1880 10.3390/jcm8111880 31694307 PMC6912517 Driehuis E, Spelier S, Beltrán Hernández I, de Bree R, S MW, Clevers H, et al. Patient-derived head and neck cancer organoids recapitulate EGFR expression levels of respective tissues and are responsive to EGFR-targeted photodynamic therapy. J Clin Med. 2019;8:1880. 31694307 10.3390/jcm8111880 PMC6912517 87. Holkom M Yang X Li R Chen Y Zhao H Shang Z Fibroblast regulates angiogenesis in assembled oral cancer organoid: a possible role of NNMT Oral Dis 2024 10.1111/odi.14945 38566601 Holkom M, Yang X, Li R, Chen Y, Zhao H, Shang Z. Fibroblast regulates angiogenesis in assembled oral cancer organoid: a possible role of NNMT. Oral Dis. 2024. 10.1111/odi.14945. 38566601 10.1111/odi.14945 88. Lin KC Ting LL Chang CL Lu LS Lee HL Hsu FC Ex vivo expanded circulating tumor cells for clinical anti-cancer drug prediction in patients with head and neck cancer Cancers 2021 10.3390/cancers13236076 34885184 PMC8656523 Lin KC, Ting LL, Chang CL, Lu LS, Lee HL, Hsu FC. Ex vivo expanded circulating tumor cells for clinical anti-cancer drug prediction in patients with head and neck cancer. Cancers. 2021. 10.3390/cancers13236076. 34885184 10.3390/cancers13236076 PMC8656523 89. Zhang XY Sui Y Shan XF Construction of oral squamous cell carcinoma organoids in vitro 3D-culture for drug screening Oral Dis 2025 31 99 109 10.1111/odi.15044 38887128 Zhang XY, Sui Y, Shan XF. Construction of oral squamous cell carcinoma organoids in vitro 3D-culture for drug screening. Oral Dis. 2025;31:99–109. 38887128 10.1111/odi.15044 90. Cosper PF Abel L Lee YS Paz C Kaushik S Nickel KP Patient derived models to study head and neck cancer radiation response Cancers 2020 12 419 10.3390/cancers12020419 32059418 PMC7072508 Cosper PF, Abel L, Lee YS, Paz C, Kaushik S, Nickel KP, et al. Patient derived models to study head and neck cancer radiation response. Cancers. 2020;12:419. 32059418 10.3390/cancers12020419 PMC7072508 91. Mao YP Tang LL Chen L Sun Y Qi ZY Zhou GQ Prognostic factors and failure patterns in non-metastatic nasopharyngeal carcinoma after intensity-modulated radiotherapy Chin J Cancer 2016 35 103 10.1186/s40880-016-0167-2 28031050 PMC5192583 Mao YP, Tang LL, Chen L, Sun Y, Qi ZY, Zhou GQ, et al. Prognostic factors and failure patterns in non-metastatic nasopharyngeal carcinoma after intensity-modulated radiotherapy. Chin J Cancer. 2016;35:103. 28031050 10.1186/s40880-016-0167-2 PMC5192583 92. Zhang MX Li J Shen GP Zou X Xu JJ Jiang R Intensity-modulated radiotherapy prolongs the survival of patients with nasopharyngeal carcinoma compared with conventional two-dimensional radiotherapy: a 10-year experience with a large cohort and long follow-up Eur J Cancer 2015 51 2587 2595 10.1016/j.ejca.2015.08.006 26318726 Zhang MX, Li J, Shen GP, Zou X, Xu JJ, Jiang R, et al. Intensity-modulated radiotherapy prolongs the survival of patients with nasopharyngeal carcinoma compared with conventional two-dimensional radiotherapy: a 10-year experience with a large cohort and long follow-up. Eur J Cancer. 2015;51:2587–95. 26318726 10.1016/j.ejca.2015.08.006 93. Zhang X Liu J Ni Y Yang Y Tian T Modeling clinical radioiodine uptake by using organoids derived from differentiated thyroid cancer Endocrinology 2024 166 bqae162 10.1210/endocr/bqae162 39658331 Zhang X, Liu J, Ni Y, Yang Y, Tian T. Modeling clinical radioiodine uptake by using organoids derived from differentiated thyroid cancer. Endocrinology. 2024;166:bqae162. 39658331 10.1210/endocr/bqae162 94. Kong L Lu JJ Reirradiation of locally recurrent nasopharyngeal cancer: history, advances, and promises for the future Chin Clin Oncol 2016 5 26 10.21037/cco.2016.03.19 27121886 Kong L, Lu JJ. Reirradiation of locally recurrent nasopharyngeal cancer: history, advances, and promises for the future. Chin Clin Oncol. 2016;5:26. 27121886 10.21037/cco.2016.03.19 95. Moskal K Khurana N Siegert L Lee YS Clevers H Elinav E Modeling cancer-microbiome interactions in vitro Int J Cancer 2024 10.1002/ijc.35298 39716471 PMC11970552 Moskal K, Khurana N, Siegert L, Lee YS, Clevers H, Elinav E, et al. Modeling cancer-microbiome interactions in vitro 39716471 10.1002/ijc.35298 PMC11970552 96. Fares J Fares MY Khachfe HH Salhab HA Fares Y Molecular principles of metastasis: a hallmark of cancer revisited Signal Transduct Target Ther 2020 5 28 10.1038/s41392-020-0134-x 32296047 PMC7067809 Fares J, Fares MY, Khachfe HH, Salhab HA, Fares Y. Molecular principles of metastasis: a hallmark of cancer revisited. Signal Transduct Target Ther. 2020;5:28. 32296047 10.1038/s41392-020-0134-x PMC7067809 97. Ruffin AT Li H Vujanovic L Improving head and neck cancer therapies by immunomodulation of the tumour microenvironment Nat Rev Cancer 2023 23 173 188 10.1038/s41568-022-00531-9 36456755 PMC9992112 Ruffin AT, Li H, Vujanovic L. Improving head and neck cancer therapies by immunomodulation of the tumour microenvironment. Nat Rev Cancer. 2023;23:173–88. 36456755 10.1038/s41568-022-00531-9 PMC9992112 98. Yuki K Cheng N Nakano M Kuo CJ Organoid models of tumor immunology Trends Immunol 2020 41 652 664 10.1016/j.it.2020.06.010 32654925 PMC7416500 Yuki K, Cheng N, Nakano M, Kuo CJ. Organoid models of tumor immunology. Trends Immunol. 2020;41:652–64. 32654925 10.1016/j.it.2020.06.010 PMC7416500 99. Bessho T Takagi T Igawa K Sato K Gelatin-based cell culture device for construction and X-ray irradiation of a three-dimensional oral cancer model Anal Sci 2023 39 771 778 10.1007/s44211-023-00308-6 36848001 Bessho T, Takagi T, Igawa K, Sato K. Gelatin-based cell culture device for construction and X-ray irradiation of a three-dimensional oral cancer model. Anal Sci. 2023;39:771–8. 36848001 10.1007/s44211-023-00308-6 100. Al-Samadi A Poor B Tuomainen K Liu V Hyytiäinen A Suleymanova I In vitro humanized 3D microfluidic chip for testing personalized immunotherapeutics for head and neck cancer patients Exp Cell Res 2019 383 111508 10.1016/j.yexcr.2019.111508 31356815 Al-Samadi A, Poor B, Tuomainen K, Liu V, Hyytiäinen A, Suleymanova I, et al. In vitro humanized 3D microfluidic chip for testing personalized immunotherapeutics for head and neck cancer patients. Exp Cell Res. 2019;383:111508. 31356815 10.1016/j.yexcr.2019.111508 101. Tuomainen K Al-Samadi A Human tumor-derived matrix improves the predictability of head and neck cancer drug testing Cancers 2019 10.3390/cancers12010092 31905951 PMC7017272 Tuomainen K, Al-Samadi A. Human tumor-derived matrix improves the predictability of head and neck cancer drug testing. Cancers. 2019. 10.3390/cancers12010092. 31905951 10.3390/cancers12010092 PMC7017272 102. Seliger B Al-Samadi A Yang B Salo T Wickenhauser C In vitro models as tools for screening treatment options of head and neck cancer Front Med (Lausanne) 2022 9 971726 10.3389/fmed.2022.971726 36160162 PMC9489836 Seliger B, Al-Samadi A, Yang B, Salo T, Wickenhauser C. In vitro models as tools for screening treatment options of head and neck cancer. Front Med (Lausanne). 2022;9:971726. 36160162 10.3389/fmed.2022.971726 PMC9489836 103. Wu C Gu J Gu H Zhang X Zhang X Ji R The recent advances of cancer associated fibroblasts in cancer progression and therapy Front Oncol 2022 12 1008843 10.3389/fonc.2022.1008843 36185262 PMC9516766 Wu C, Gu J, Gu H, Zhang X, Zhang X, Ji R. The recent advances of cancer associated fibroblasts in cancer progression and therapy. Front Oncol. 2022;12:1008843. 36185262 10.3389/fonc.2022.1008843 PMC9516766 104. Li X González-Maroto C Tavassoli M Crosstalk between CAFs and tumour cells in head and neck cancer Cell Death Discov 2024 10 303 10.1038/s41420-024-02053-9 38926351 PMC11208506 Li X, González-Maroto C, Tavassoli M. Crosstalk between CAFs and tumour cells in head and neck cancer. Cell Death Discov. 2024;10:303. 38926351 10.1038/s41420-024-02053-9 PMC11208506 105. Sung KE Su X Berthier E Pehlke C Friedl A Beebe DJ Understanding the impact of 2D and 3D fibroblast cultures on in vitro breast cancer models PLoS One 2013 8 e76373 10.1371/journal.pone.0076373 24124550 PMC3790689 Sung KE, Su X, Berthier E, Pehlke C, Friedl A, Beebe DJ. Understanding the impact of 2D and 3D fibroblast cultures on in vitro breast cancer models. PLoS One. 2013;8:e76373. 24124550 10.1371/journal.pone.0076373 PMC3790689 106. Zhao H Jiang E Shang Z 3D co-culture of cancer-associated fibroblast with oral cancer organoids J Dent Res 2021 100 201 208 10.1177/0022034520956614 32881601 Zhao H, Jiang E, Shang Z. 3D co-culture of cancer-associated fibroblast with oral cancer organoids. J Dent Res. 2021;100:201–8. 32881601 10.1177/0022034520956614 107. Chen X Li R Zhao H Wang X Shao Z Phenotype transition of fibroblasts incorporated into patient-derived oral carcinoma organoids Oral Dis 2023 29 913 922 10.1111/odi.14071 34741375 Chen X, Li R, Zhao H, Wang X, Shao Z. Phenotype transition of fibroblasts incorporated into patient-derived oral carcinoma organoids. Oral Dis. 2023;29:913–22. 34741375 10.1111/odi.14071 108. Zhao H Li R Chen Y Stromal nicotinamide N-methyltransferase orchestrates the crosstalk between fibroblasts and tumour cells in oral squamous cell carcinoma: evidence from patient-derived assembled organoids Oncogene 2023 42 1166 1180 10.1038/s41388-023-02642-5 36823377 Zhao H, Li R, Chen Y. Stromal nicotinamide N-methyltransferase orchestrates the crosstalk between fibroblasts and tumour cells in oral squamous cell carcinoma: evidence from patient-derived assembled organoids. Oncogene. 2023;42:1166–80. 36823377 10.1038/s41388-023-02642-5 109. Holkom M Yang X Li R Chen Y Zhao H Shang Z Fibroblast regulates angiogenesis in assembled oral cancer organoid: a possible role of NNMT Oral Dis 2024 30 4982 4992 10.1111/odi.14945 38566601 Holkom M, Yang X, Li R, Chen Y, Zhao H, Shang Z. Fibroblast regulates angiogenesis in assembled oral cancer organoid: a possible role of NNMT. Oral Dis. 2024;30:4982–92. 38566601 10.1111/odi.14945 110. Wu W Li X Yu S Patient-derived tumour organoids: a bridge between cancer biology and personalised therapy Acta Biomater 2022 146 23 36 10.1016/j.actbio.2022.04.050 35533925 Wu W, Li X, Yu S. Patient-derived tumour organoids: a bridge between cancer biology and personalised therapy. Acta Biomater. 2022;146:23–36. 35533925 10.1016/j.actbio.2022.04.050 111. Li Y Lin C Characterization of cancer stem cells in laryngeal squamous cell carcinoma by single-cell RNA sequencing Genomics Proteomics Bioinform 2024 10.1093/gpbjnl/qzae056 PMC11522873 39107908 Li Y, Lin C. Characterization of cancer stem cells in laryngeal squamous cell carcinoma by single-cell RNA sequencing. Genomics Proteomics Bioinform. 2024. 10.1093/gpbjnl/qzae056. 10.1093/gpbjnl/qzae056 PMC11522873 39107908 112. Cirillo N Wu C Prime SS Heterogeneity of cancer stem cells in tumorigenesis, metastasis, and resistance to antineoplastic treatment of head and neck tumours Cells 2021 10.3390/cells10113068 34831291 PMC8619944 Cirillo N, Wu C, Prime SS. Heterogeneity of cancer stem cells in tumorigenesis, metastasis, and resistance to antineoplastic treatment of head and neck tumours. Cells. 2021. 10.3390/cells10113068. 34831291 10.3390/cells10113068 PMC8619944 113. Rumsey JW Lorance C Jackson M Sasserath T McAleer CW Long CJ Classical Complement Pathway Inhibition in a \"Human-On-A-Chip\" Model of Autoimmune Demyelinating Neuropathies Adv Ther 2022 10.1002/adtp.202200030 PMC9540753 36211621 Rumsey JW, Lorance C, Jackson M, Sasserath T, McAleer CW, Long CJ, et al. Classical Complement Pathway Inhibition in a “Human-On-A-Chip” Model of Autoimmune Demyelinating Neuropathies. Adv Ther. 2022. 10.1002/adtp.202200030. 10.1002/adtp.202200030 PMC9540753 36211621 114. Wadman M FDA no longer has to require animal testing for new drugs Science 2023 10.1126/science.adg6276 36634170 Wadman M. FDA no longer has to require animal testing for new drugs. Science. 2023. 10.1126/science.adg6276. 36634170 10.1126/science.adg6276 115. FDA Announces Plan to Phase Out Animal Testing Requirement for Monoclonal Antibodies and Other Drugs. 2025; Available from: https://www.fda.gov/news-events/press-announcements/fda-announces-plan-phase-out-animal-testing-requirement-monoclonal-antibodies-and-other-drugs 116. Jensen LH Rogatto SR Lindebjerg J Havelund B Abildgaard C do Canto LM Precision medicine applied to metastatic colorectal cancer using tumor-derived organoids and in-vitro sensitivity testing: a phase 2, single-center, open-label, and non-comparative study J Exp Clin Cancer Res 2023 42 115 10.1186/s13046-023-02683-4 37143108 PMC10161587 Jensen LH, Rogatto SR, Lindebjerg J, Havelund B, Abildgaard C, do Canto LM, et al. Precision medicine applied to metastatic colorectal cancer using tumor-derived organoids and in-vitro sensitivity testing: a phase 2, single-center, open-label, and non-comparative study. J Exp Clin Cancer Res. 2023;42:115. 37143108 10.1186/s13046-023-02683-4 PMC10161587 117. Guo Z Liu J Zhang X Ma Y Wang Y Li P Precision treatment guided by patient-derived organoids-based drug testing for locally advanced thyroid cancer: a single arm, phase 2 study Endocrine 2025 89 186 196 10.1007/s12020-025-04240-9 40304938 Guo Z, Liu J, Zhang X, Ma Y, Wang Y, Li P, et al. Precision treatment guided by patient-derived organoids-based drug testing for locally advanced thyroid cancer: a single arm, phase 2 study. Endocrine. 2025;89:186–96. 40304938 10.1007/s12020-025-04240-9 118. Xiang D He A Zhou R Wang Y Xiao X Gong T Building consensus on the application of organoid-based drug sensitivity testing in cancer precision medicine and drug development Theranostics 2024 14 3300 3316 10.7150/thno.96027 38855182 PMC11155402 Xiang D, He A, Zhou R, Wang Y, Xiao X, Gong T, et al. Building consensus on the application of organoid-based drug sensitivity testing in cancer precision medicine and drug development. Theranostics. 2024;14:3300–16. 38855182 10.7150/thno.96027 PMC11155402 119. Masters JR Human cancer cell lines: fact and fantasy Nat Rev Mol Cell Biol 2000 1 233 236 10.1038/35043102 11252900 Masters JR. Human cancer cell lines: fact and fantasy. Nat Rev Mol Cell Biol. 2000;1:233–6. 11252900 10.1038/35043102 120. Sachs N Clevers H Organoid cultures for the analysis of cancer phenotypes Curr Opin Genet Dev 2014 24 68 73 10.1016/j.gde.2013.11.012 24657539 Sachs N, Clevers H. Organoid cultures for the analysis of cancer phenotypes. Curr Opin Genet Dev. 2014;24:68–73. 24657539 10.1016/j.gde.2013.11.012 121. Gao H Korn JM Ferretti S Monahan JE Wang Y Singh M High-throughput screening using patient-derived tumor xenografts to predict clinical trial drug response Nat Med 2015 21 1318 1325 10.1038/nm.3954 26479923 Gao H, Korn JM, Ferretti S, Monahan JE, Wang Y, Singh M, et al. High-throughput screening using patient-derived tumor xenografts to predict clinical trial drug response. Nat Med. 2015;21:1318–25. 26479923 10.1038/nm.3954 122. Werschler N Quintard C Nguyen S Penninger J Engineering next generation vascularized organoids Atherosclerosis 2024 398 118529 10.1016/j.atherosclerosis.2024.118529 39304390 Werschler N, Quintard C, Nguyen S, Penninger J. Engineering next generation vascularized organoids. Atherosclerosis. 2024;398:118529. 39304390 10.1016/j.atherosclerosis.2024.118529 123. Cattaneo CM Dijkstra KK Fanchi LF Kelderman S Kaing S van Rooij N Tumor organoid-T-cell coculture systems Nat Protoc 2020 15 15 39 10.1038/s41596-019-0232-9 31853056 PMC7610702 Cattaneo CM, Dijkstra KK, Fanchi LF, Kelderman S, Kaing S, van Rooij N, et al. Tumor organoid-T-cell coculture systems. Nat Protoc. 2020;15:15–39. 31853056 10.1038/s41596-019-0232-9 PMC7610702 124. Arutyunyan I Jumaniyazova E Makarov A Fatkhudinov T In vitro models of head and neck cancer: from primitive to most advanced J Pers Med 2023 13 1575 10.3390/jpm13111575 38003890 PMC10672510 Arutyunyan I, Jumaniyazova E, Makarov A, Fatkhudinov T. In vitro models of head and neck cancer: from primitive to most advanced. J Pers Med. 2023;13:1575. 38003890 10.3390/jpm13111575 PMC10672510 125. van de Wetering M Francies HE Francis JM Bounova G Iorio F Pronk A Prospective derivation of a living organoid biobank of colorectal cancer patients Cell 2015 161 933 945 10.1016/j.cell.2015.03.053 25957691 PMC6428276 van de Wetering M, Francies HE, Francis JM, Bounova G, Iorio F, Pronk A, et al. Prospective derivation of a living organoid biobank of colorectal cancer patients. Cell. 2015;161:933–45. 25957691 10.1016/j.cell.2015.03.053 PMC6428276 ",
  "metadata": {
    "Title of this paper": "Prospective derivation of a living organoid biobank of colorectal cancer patients",
    "Journal it was published in:": "Stem Cell Research & Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481855/"
  }
}