{
  "title": "Paper_515",
  "abstract": "Cochrane Database Syst Rev Cochrane Database Syst Rev 3102 cochrev 14651858 The Cochrane Database of Systematic Reviews 1469-493X 1361-6137 John Wiley and Sons, Inc. and the Cochrane Library PMC11443589 PMC11443589.1 11443589 11443589 39351881 10.1002/14651858.CD011800.pub2 CD011800.pub2 CD011800 1 Complementary & alternative medicine Endocrine & metabolic Other Metabolic and Nutritional Disorders Oral vitamin D supplementation for adults with obesity undergoing bariatric surgery Cochrane Metabolic and Endocrine Disorders Group Chakhtoura Marlene T mc39@aub.edu.lb Nakhoul Nancy F Akl Elie A Safadi Bassem Y Mantzoros Christos S Metzendorf Maria-Inti El-Hajj Fuleihan Ghada Calcium Metabolism and Osteoporosis Program, WHO Collaborating Center for Metabolic Bone Disorders American University of Beirut Medical Center Beirut Lebanon Scholars in HeAlth Research Program (SHARP) American University of Beirut Beirut Lebanon Department of Internal Medicine Faculty of Medicine and Medical Sciences, University of Balamand Koura Lebanon Department of Internal Medicine American University of Beirut Medical Center Beirut Lebanon Department of Health Research Methods, Evidence, and Impact (HEI) McMaster University Ontario Canada Department of Surgery American University of Beirut Medical Center Beirut Lebanon Surgical Services Aman Hospital Doha Qatar Department of Medicine Beth Israel Deaconess Medical Center, Harvard Medical School Boston Massachusetts USA Boston VA Healthcare System Harvard Medical School Boston Massachusetts USA Institute of General Practice Medical Faculty of the Heinrich-Heine University Düsseldorf Germany Scholars in Health Research Program (SHARP) American University of Beirut Beirut Lebanon Marlene T Chakhtoura, Department of Internal Medicine, Endocrinology, American University of Beirut, Medical Center, Riad EI Solh, Beirut, Lebanon. mc39@aub.edu.lb 1 10 2024 2024 2024 10 471896 CD011800 01 10 2025 01 10 2025 26 08 2025 01 10 2025 Copyright © 2024 The Cochrane Collaboration. Published by John Wiley & Sons, Ltd. 10.1002/14651858.CD011800 Abstract Background Vitamin D deficiency following bariatric surgery is common and is expected to be associated with a deleterious impact on the skeleton. However, the benefits of vitamin D supplementation and the optimal dose in this population is currently unknown. The available guidelines on the topic are derived from experts' opinions, and are not evidence based. Objectives To compare the effects of different doses of vitamin D supplementation (low dose (less than 600 international units (IU)/day), moderate dose (600 IU/day to 3500 IU/day), high dose (greater than 3500 IU/day)) to each other or to placebo in adults living with obesity undergoing bariatric surgery. Search methods We searched CENTRAL, MEDLINE, Embase, LILACS, two trial registries, and the reference lists of systematic reviews, articles, and health technology assessment reports without language restrictions. The last search of all databases was 27 June 2023, except Embase, which we searched on 14 August 2015. Selection criteria We included randomised controlled trials or controlled clinical trials on vitamin D supplementation comparing different doses or comparing vitamin D to placebo in people undergoing bariatric surgery. Data collection and analysis We used standard Cochrane methods. Primary outcomes were fractures and adverse events. Secondary outcomes were vitamin D status, all‐cause mortality, bone mineral change, secondary hyperparathyroidism, health‐related quality of life, and muscle strength. We used GRADE to assess the certainty of the evidence for each outcome in each comparison. Main results We identified five trials with 314 participants. We included three trials in the quantitative analysis. Moderate‐dose vitamin D compared to placebo One trial compared moderate‐dose vitamin D (3200 IU/day) to placebo. Moderate‐dose vitamin D, compared to placebo, may improve vitamin D status and may result in little to no difference in the achieved parathyroid hormone level (achieved 25‐hydroxyvitamin D level: mean difference (MD) 13.60 ng/mL, 95% confidence interval (CI) 7.94 to 19.26; achieved parathyroid hormone level: −6.60 pg/mL, 95% CI −17.12 to 3.92; 1 study, 79 participants; low‐certainty evidence). The trial reported no adverse events in the moderate‐dose vitamin D arm, but did not provide any information on adverse events in the placebo arm. There were no data on fractures, all‐cause mortality, bone density change, health‐related quality of life, and muscle strength. High‐dose vitamin D compared to moderate‐dose vitamin D Two trials in Roux‐en‐Y gastric bypass compared moderate‐dose (equivalent dose 800 IU/day to 2000 IU/day) to high‐dose (equivalent dose 5000 IU/day to 7943 IU/day) vitamin D. The evidence of high‐dose vitamin D on adverse events is very uncertain (risk ratio (RR) 5.18, 95% CI 0.23 to 116.56; 2 studies, 81 participants; very low‐certainty evidence). High‐dose vitamin D may increase 25‐hydroxyvitamin D levels compared to a moderate dose at 12 months, but the evidence is very uncertain (MD 15.55 ng/mL, 95% CI 3.50 to 27.61; I 2 2 Authors' conclusions No trials reported on fractures and the evidence available on adverse events is scarce. Moderate‐dose vitamin D may improve vitamin D status and may result in little to no improvement in parathyroid hormone levels compared with placebo. High‐dose vitamin D supplementation (greater than 3500 IU/day) may increase 25‐hydroxyvitamin D levels, and may have little to no effect on parathyroid hormone levels, compared to a moderate dose, but the evidence for both is very uncertain. The currently available limited evidence may not have a significant impact on practice. Further studies are needed to explore the impact of vitamin D supplementation on fractures, adverse events, and musculoskeletal parameters in people undergoing bariatric surgery. Plain language summary What are the benefits and risks of vitamin D supplementation for adults with obesity undergoing weight‐loss surgery? Key messages – There is limited evidence on the benefits of vitamin D supplements for adults with obesity after weight‐loss surgery. We are not confident that taking high or moderate doses of vitamin D after weight‐loss surgery improves vitamin D levels or reduces the diseases of the parathyroid glands (four pea‐sized glands in the neck that manage calcium levels in the body). – There are no data on the risk of bone fractures, and little information on changes in bone strength or other unwanted effects. Why is vitamin D needed following bariatric surgery? Weight‐loss surgery (also called bariatric surgery) is used to manage obesity and problems related to obesity. It mainly works by bypassing parts of the intestines or reducing the size of the stomach to reduce the absorption of fat from food. One unwanted effect of weight‐loss surgery is poor absorption of vitamin D, which is important in regulating the amount of calcium in the blood. Low levels of vitamin D in the blood reduce the amount of calcium in the body, partly by making the parathyroid glands in the neck become more active. These glands then produce more parathyroid hormone, which causes calcium to leak out of the bones. This can lead to weak bones and bone fractures, reducing a person's quality of life. Addition of vitamin D using supplements is expected to help improve vitamin D levels, reduce bone loss, and potentially lower the risk of fractures in people who have had weight‐loss surgery. What did we want to find out? We wanted to see if different doses of vitamin D supplements, compared to each other or to placebo (pretend treatment), could reduce fracture risk, improve vitamin D levels, and reduce parathyroid hormone levels. What did we do? We looked for studies of vitamin D supplements in people undergoing weight‐loss surgery. We examined the impact on fracture risk, unwanted effects, vitamin D levels, deaths, bone strength, quality of life, and muscle strength. We summarised and compared the results and assessed the quality and size of the studies. What did we find? We included five studies with 314 participants (mostly women aged about 40 to 50 years) from Western countries undergoing weight‐loss surgery. The studies lasted between three and 12 months. One study compared moderate‐dose vitamin D to placebo for three months. Moderate‐dose vitamin D may improve a person's overall vitamin D level and may result in little to no difference in parathyroid hormone levels compared with placebo (1 study, 79 people). There were no unwanted effects with moderate‐dose vitamin D but the authors did not report results from the placebo group. There was no information on fractures, deaths, bone strength, quality of life, or muscle strength. Two studies compared high‐dose vitamin D to moderate‐dose vitamin D for 12 months. High‐dose vitamin D may result in an increase in vitamin D levels compared to moderate doses, but the evidence is very uncertain. We are very uncertain about the unwanted effects of high‐dose vitamin D (2 studies, 81 people), death (1 study, 60 people), bone strength (1 study, 30 people had measurements at the hip and 40 people had measurements at the fore arm), or parathyroid hormone levels (2 studies, 72 people). There was no information on fractures, quality of life, or muscle strength. What are the limitations of the evidence? Our confidence in the results was low or very low as we found few studies that included few people. Doses of vitamin D varied between studies. Most evidence was reported soon after surgery and focused on vitamin D levels and parathyroid hormone levels and did not provide data about everything that we were interested in. How up to date is this review? This evidence is up to date to June 2023. Humans Administration, Oral Bariatric Surgery Bariatric Surgery/adverse effects Bone Density Bone Density/drug effects Cause of Death Dietary Supplements Fractures, Bone Obesity Obesity/complications Obesity/surgery Postoperative Complications Postoperative Complications/prevention & control Quality of Life Randomized Controlled Trials as Topic Vitamin D Vitamin D/administration & dosage Vitamin D/blood Vitamin D Deficiency Vitamin D Deficiency/blood Vitamin D Deficiency/complications Vitamin D Deficiency/drug therapy Vitamins Vitamins/administration & dosage pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes New ",
  "metadata": {
    "Title of this paper": "Oral vitamin D supplementation for adults with obesity undergoing bariatric surgery",
    "Journal it was published in:": "The Cochrane Database of Systematic Reviews",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11443589/"
  }
}