{
  "title": "Paper_547",
  "abstract": "pmc Bioeng Transl Med Bioeng Transl Med 3332 btm BTM2 Bioengineering & Translational Medicine 2380-6761 Wiley PMC12478447 PMC12478447.1 12478447 12478447 41030276 10.1002/btm2.70020 BTM270020 1 Review Article Review Article Oral tissue spheroid, organoid, and organ‐on chip microphysiological modeling strategies towards enhanced emulation of health and disease Gouveia et al. Gouveia Z. https://orcid.org/0000-0001-9702-3935  1  2 Özkan A. https://orcid.org/0000-0002-3825-5899  3 Giannobile W. V. https://orcid.org/0000-0002-7102-9746  1 Santerre J. P. https://orcid.org/0000-0003-3373-6463  2  4  5 paul.santerre@dentistry.utoronto.ca Wu D. T. https://orcid.org/0000-0002-9752-5377  1  3  6  7 davidt_wu@hsdm.harvard.edu   1 Department of Oral Medicine, Infection, and Immunity Harvard School of Dental Medicine Boston USA   2 Faculty of Dentistry University of Toronto Toronto Canada   3 Wyss Institute for Biologically Inspired Engineering Harvard University Boston USA   4 Institute of Biomedical Engineering University of Toronto Toronto Canada   5 Translational Biology and Engineering Program University of Toronto Toronto Canada   6 Harvard John A. Paulson School of Engineering and Applied Sciences Cambridge USA   7 Faculty of Dental Medicine and Oral Health Sciences McGill University Montreal Canada * Correspondence paul.santerre@dentistry.utoronto.ca davidt_wu@hsdm.harvard.edu 18 4 2025 9 2025 10 5 497785 10.1002/btm2.v10.5 e70020 26 3 2025 18 1 2025 31 3 2025 18 04 2025 30 09 2025 01 10 2025 © 2025 The Author(s). Bioengineering & Translational Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Diseases and disorders of dental, oral, and craniofacial (DOC) tissues represent a significant global health burden and have been found to have the greatest age‐standardized prevalence and incidence of all reported diseases worldwide. While the application of novel therapies has been suggested to address the different types of oral health diseases, only a limited number of interventional regenerative therapies have been reported to improve clinical therapeutic outcomes. The lack of novel therapies in DOC tissue regeneration may be in part attributed to the highly resource‐intensive translational path from preclinical models to clinical trials. Recently, stakeholders and regulatory agencies have begun to encourage the use of alternative preclinical models using human tissues for testing therapeutic interventions in place of animal models. This advocacy may provide an opportunity to reduce or eliminate animal testing, ultimately limiting resource expenditure and providing a more efficient regulatory pathway for the approval of novel DOC therapies. While the complexity of DOC physiology, defects, and diseases is not effectively recapitulated in traditional 2D or 3D in vitro culture models, the emergence of more sophisticated in vitro models (or so‐called microphysiological systems that include spheroid, organoid and organ on‐chip (OoC) systems) has enabled effective modeling of clinically simulated disease states in several DOC tissue and organ systems. Here, we aim to provide an overview and collective comparison of these microphysiological systems, outline their current uses in DOC research, and identify important gaps in both their utilization and abilities to recapitulate essential features of native oral‐craniofacial physiology, towards enabling the therapeutic performance of de novo interventions targeted at regeneration outcomes in vivo. microphysiological culture systems oral health regenerative medicine translation tissue engineering spheroid organoid organ on chip Natural Sciences and Engineering Research Council of Canada 10.13039/501100000038 RGPIN‐2018‐04424 Osteology Foundation 10.13039/501100007619 OF21‐032 National Institutes of Health Training 5T32DK007199‐44 5T32EB016652‐10 Wyss Technology Development Fellowship pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Gouveia Z Özkan A Giannobile WV Santerre JP Wu DT Oral tissue spheroid, organoid, and organ‐on chip microphysiological modeling strategies towards enhanced emulation of health and disease Bioeng Transl Med 2025 10 5 e70020 10.1002/btm2.70020  Translational Impact Statement DOC biomaterials and regenerative strategies are currently underrepresented in bioengineering and tissue engineering literature—despite the incidence of the disease of such tissues having the greatest age‐standardized prevalence worldwide. The aim of this work is to highlight this subject area through the review of contemporary  microphysiological systems in therapeutic developments and how these emerging technologies may be utilized to improve the therapeutic development pipeline in DOC tissue regeneration. 1 INTRODUCTION TO DENTAL ORAL CRANIOFACIAL TISSUES AND DISEASE The dental, oral, and craniofacial (DOC) complex represents a heterogeneous group of interconnected tissue niches consisting of the dentition, with the periodontium acting to support teeth, and the craniofacial complex that includes other supporting bone, cartilage, ligaments, muscle, as well as peripheral nervous tissue, vasculature, lymphatic vessels, and glands. Diseases and disorders of DOC tissues represent a significant global burden and have been shown to have the greatest age‐standardized prevalence and incidence worldwide.  1  2  3  4  5  6  7 Specifically for tissues requiring regenerative interventions to address clinical needs, it has been suggested that novel biological and tissue engineering approaches be further emphasized in the pre‐preclinical model work. Such contemporary therapies are grounded in foundational aspects of tissue engineering and regeneration, including managing the interplay of tissue scaffolds, signaling molecules/growth factors, and/or direct cell delivery for endogenous cell or mediator recruitment. Emerging therapies in DOC include, for example, biomaterial scaffolds that better recapitulate the native architecture of target tissues towards improved healing and integration,  8  9  10  11  12  13  14  15  16  17  18  19  20  21 The low number of novel therapies for DOC tissue regeneration making it to clinical use can be attributed in part to the high resource‐intensive translational path needed to take an intervention from preclinical animal models to clinical trials; driven mainly by the number of animal tests needed to address regulatory hurdles.  22  23  24  25  26 Due to the diverse and interconnected nature of DOC tissues, defects and diseases are not effectively recapitulated in traditional 2D or 3D in vitro culture models. The emergence of more sophisticated in vitro models (including spheroid, organoid and organ on‐chip (OoC) systems) has enabled a more effective modeling of clinically representative disease states in several whole tissue and organ systems.  23 While there are several reviews that provide detailed analyses for each of the technology and design features associated with the above three individual microphysiological systems independently, when considered for use in DOC tissue engineering,  27  28  29 2 BEYOND STATIC 3D Prior to animal and preclinical models, static two‐dimensional (2D or monolayer) cell culture, in which cells are cultured on flat and rigid substrates, has been traditionally used to model a number of targeted biological and disease processes in vitro. While static 2D cell culture presents a standardized and cost‐effective platform for initial high‐throughput therapeutic screening, cells cultured in this manner have been shown to poorly represent their in vivo morphology, organization, and behavior. Evidence to support this discrepancy has been described since the 1980s, following the work of Bissel et al. that highlighted the importance of the extracellular matrix (ECM) and microenvironment on the behavior of mammalian cells.  30  31  32  33 To improve the physiological relevance of cell‐based assays, three‐dimensional (3D) culture methods have been adopted that better model the spatial microenvironment of mammalian cells. Indeed, 3D cultured cells have been shown to maintain more biologically relevant cell–cell and cell–ECM‐like behavior when compared to 2D culture, including more representative cell adhesion and migration, morphogenesis, gene expression, and maintenance of differentiated tissue‐specific phenotypes.  34 1 FIGURE 1 Representative advantages, disadvantages and key utility features of 2D, spheroid, organoid, and organ on chip preclinical model. Green and red are used to represent positive and negative attributes of increasing microphysiological model sophistication. This figure was created with the assistance of www.Biorender.com 2.1 Spheroids Cellular spheroids (or cell aggregates) represent a diverse class of culture systems that have been present since the 1970s.  35  36 Spheroids have become particularly prevalent in tumor modeling, as cell aggregates often contain the same vascular and diffusion limitations of tumors, observed in vivo.  37  38  39  40  41 Spheroids can be formed using several techniques which lead to a predictable and consistent spheroid morphology.  42  43  44  45  46 In general, spheroid systems present an accessible 2.2 Organoids Organoid models represent a more recent class of cell aggregate microphysiological systems. The key differentiating feature between spheroids and organoids is that organoids contain organ specific cells that may undergo differentiation and display aspects of tissue organogenesis. Organoids have also been shown to facilitate improved differentiation into diverse progenitor cell populations when compared to spheroid culture alone.  47  48  49 Organoids may also be engineered using organ‐specific cells or those directly isolated from patient tissues, allowing for replication of a personalized disease pathology and subsequent therapeutic screening. While providing similar superficial structure to that of spheroids, the formation of engineered multicellular organoids often introduces additional complexities to the aggregate methods described above, attributed to the modulation of co‐culture seeding ratios and selective differentiation of tissue niches. Some organoid systems, however, have shown spontaneous organogenesis in co‐culture conditions that more similarly resemble spheroid formation methodologies, thereby identifying a limitation of these models.  50  51  52 In general, organoid systems present an expanded 2.3 Organ on‐chip Advances in high‐resolution microfluidic techniques (such as soft lithography) have given rise to the introduction of cell culture “on‐chip” methods.  53 The purpose of adding dynamic flow and multichannel design is to provide a model more representative of the physiological exchange of nutrients, elimination of biochemical waste, and mechanical stimuli that govern cell function in vivo. The modulation of waste/nutrient gradients and shear forces, using microfluidics, has been shown to further enhance the differentiation efficiency and fidelity of mesenchymal stem cell organoids in other areas of tissue engineering.  54  55  23 The design of on‐chip systems and their manufacture is already the subject of an excellent review by Huang et al.  29 complete 2.4 Towards applications in DOC The application of these microphysiological culture systems can be useful in modeling the complex nature of the DOC physiology in a systematic manner. Such a strategy may be used to validate therapeutic efficacy or disease in increasingly more bio‐representative models, using each model type to answer specific independent research questions. For example, in a systematic manner, a dental pulp cell spheroid model may be initially used to assess the cytotoxicity of a novel dental adhesive resin.  56  57  58 1 TABLE 1 Summary of microphysiological models utilized within DOC. Microphysiological Model utility Application type Current DOC gaps Spheroid Tissue regeneration  Regeneration of Periodontal ligament  61  62  63 Gingiva  64 Dental pulp  65  66  67  68 Maxillofacial bone  62  70  71  72  73 Limited applications in screening therapeutics targeted to both dentinal and craniofacial hard tissues. Tumor modeling  Oral squamous cell carcinoma (OSCC)  74  75  76  77  78  79  80  81 Organoid Disease modeling and organogenesis  Oral mucositis  84 OSCC  85  86  88 Salivary gland organogenesis  87 Tooth organogenesis  89  90  91  92 Limited applied cases of organoid use in both therapeutic screening in general and as direct regeneration strategies. Therapeutic screening  Direct or indirect therapeutic effects on Dentinal pulp  57 Taste bud  93 Salivary gland  94 OSCC  99  100 Tissue regeneration  Regeneration of Whole tooth  101  102  103  104  105  106 Salivary gland  87  91 Organ on chip Disease modeling  Oral mucosa/microbial interactions  113  114  115  116 OSCC  117  119  Few examples recapitulating craniofacial hard tissues and the functional multi‐domain complex tissues within the periodontium Underutilized in the investigation of direct regenerative oral therapies and biomaterials Therapeutic screening   Treatment of Oral biofilms/microbiome  123  124  125  126  127  Direct or indirect effects of Radiation/chemotherapeutics  128  129  130  131 Biomaterial interventions  113  115  132  133  134  135  136  137  138 Multi‐organ and systemic toxicity  139 3 MODELING DOC Spheroids, as discussed above, represent the most accessible class of microphysiological culture systems, given their relatively low resource burden and ease of manufacture. In DOC research, spheroids have found use for modeling aspects of oral soft tissues, including the periodontal ligament and gingival/oral mucosa. Within these applications, spheroids have been utilized as both a tool to improve the efficacy of cell‐based therapies and as a system to provide a more effective therapeutic screening tool. 3.1 Improving cell‐based therapies (tissue regeneration) The delivery of oral progenitor cells has been reported as a useful strategy to aid in tissue remodeling and regeneration.  59  60  61  62  63  64 In addition to oral soft tissues, spheroid systems have been used to improve cell‐based therapies associated with dental and maxillofacial tissues. For dentinal tissues, much attention has been placed on the development of dental pulp stem cell (DPSC) spheroids within the regenerative endodontics field, similar to their utility with multilineage MSCs in other tissue engineering applications.  65  66  67  68  69 In maxillofacial tissues, spheroids have been utilized to enhance the differentiation capacity of PDLSCs, cortical bone‐derived stem cells (CBSCs), and bone marrow‐derived stem cells (BMSCs) for bone regeneration. When compared to monolayer culture, Moritani et al. found that PDLSC spheroid culture exhibited superior de novo bone formation in a murine defect model.  62  70  71  72  73 3.2 Therapeutic screening (tumor modeling) Using DOC spheroid for therapeutic screening has been mainly associated with tumor modeling, given their ability to effectively recapitulate the dense aggregate structure of tumors observed in vivo.  38  39  74  74  75  76 Spheroids have also been used to model oral cancers in xenograft models, which may provide insights into tumor progression and better in vivo screening of chemotherapeutics. Oral squamous cell carcinoma (OCSS), unlike basal cell cancers, is most frequently characterized by the lack of a necrotic tumor core, indicating the maintenance of a pro‐angiogenic niche.  77  78  79  80  81 3.3  DOC Spheroid models have clearly presented significant advantages over monolayer cultures in the analysis of DOC tissues, by introducing more relevant cell–cell and cell–ECM interactions when compared to traditional monolayer cultures. Spheroid methods are currently being used in DOC to improve the regenerative capacity of cell‐based therapies and model oral cancers and chemotherapies. Interestingly, spheroid systems have, to date, seldom been used to screen therapeutics targeted to both dentinal and craniofacial hard tissues. This gap may be representative of the current limitations of spheroids alone, to appropriately represent DOC tissues. For example, while Janjic et al. found that the structure of gingival spheroids was more similar to ex vivo gingival tissues when compared to a monocultured control, they still exhibited significantly different architectural features, including their attachment for collagen and bone‐based substrates and the production of pro‐inflammatory cytokines.  82 4 MODELING DOC Organoids introduce expanded complexity to traditional spheroid aggregate systems through the addition of organ‐specific multicellular niches. Organoids may be engineered in vitro through the combination of organ‐specific cell types or developed from isolated and differentiated whole donor tissue. In addition to their use in cell‐based therapies and therapeutic screening, organoid systems have found utility in modeling organogenesis and disease progression in DOC research.  83 4.1 Disease modeling and organogenesis Oral soft tissues are under constant microbial challenge, where their barrier function and stratified structure are essential in maintaining the health of oral tissues. Utilizing multicellular oral mucosal organoids, Pinnock et al. reported significant differences in the response to P. gingivalis  84 P. gingivalis P. gingivalis In other work, Zhao et al. developed an organoid tongue squamous cell carcinoma (TSCC) model utilizing both CAL27 and cancer‐associated fibroblasts that were immobilized within a decellularized tongue‐derived ECM.  85  86 In addition to engineered organoid strategies, in which organotypic cells are combined ex vivo, organoids may be formed through direct isolation and purification from  donor oral tissues. Using this strategy, Yoshimoto et al. established a human salivary‐gland‐derived organoid culture system, capable of modeling salivary gland inflammation.  87  88 A unique feature of organoid aggregate systems is their potential to model organogenesis, which can yield insights into the complex developmental process of DOC tissues. In dental tissues, tooth germ organoids have been developed and used to study previously unknown aspects of human tooth development.  27  89  90  91  92 4.2 Therapeutic screening In comparison to spheroid aggregate culture, organoid systems may provide improved utility in screening therapeutics through the presentation of important multicellular boundaries and junctions, as well as patient/donor specificity that is not effectively recapitulated in either spheroid and monolayer cultures. 4.2.1 Improved multi‐cellular architecture Exploring this utility of organoids to model dental tissues, Xu et al. investigated the differential effects of an endodontic calcium silicate capping agent on both engineered dental pulp organoids and monolayer culture.  57 In addition to dentinal tissues, oral soft tissue models have been utilized to investigate the peripheral impact of oral cancer treatments. Guo et al. engineered taste bud organoids to explore the impact of radiation treatment on taste dysfunction.  93  94 4.2.2 Patient origin and specificity Patient‐ and donor‐derived organoids have been shown to closely emulate those of the corresponding donor, which has allowed for effective patient‐specific screening of therapeutics outside of DOC.  95  96  97  98  23  99 The patient‐heterogeneity of chemotherapeutic efficacy has been further explored by Driehuis et al. utilizing wildtype human oral mucosa organoids in the study of pediatric acute lymphoblastic leukemia.  100  88 4.3 Improved cell‐based therapies Given the hierarchical and heterogeneous nature of DOC tissues, organoid‐based cell therapies have been suggested. In comparison to spheroid‐based cell therapies that are typically utilized for the delivery of stem cell aggregates to promote tissue regeneration, organoid‐based cell therapies employ a higher degree of tissue mimicry and organization, which has great potential in direct whole tissue and organ regeneration in DOC.  101  102 One such example is the regeneration of de novo dentition utilizing tooth germ organoids. Teeth are complex hierarchical tissues, composed of both hard (enamel, cementum, dentin) and soft (pulp) discrete regions. Tooth germ organoids are formed through tight control of the interactions of dental epithelial and mesenchymal cells achieved through differentiation media and scaffold design. Tsuji et al. were the first to successfully develop ectodermal organs from organoid‐germ culture methods.  103  104  105  106 Within the context of oral soft tissues, the application of salivary gland organoids has been explored for its potential use in regenerative therapies. As with natural dentition, salivary glands are particularly difficult to bioengineer given their secretory function, epithelial–mesenchyme interaction, and response to both endogenous and exogenous signals, making them more amenable to an organoid regenerative approach.  87  91 In addition to improved modeling and screening of disease‐ and patient‐specific therapies, patient‐ and donor‐derived organoids have significant potential in direct tissue regeneration strategies.  101  102 4.4  DOC While oral organoids do indeed present an expanded means of oral tissue modeling when compared to both monolayer and spheroid culture, there are still limited applied cases of their use in both therapeutic screening and direct regeneration strategies in DOC. The limited use case of organoids in these applications may be driven by their added complexity, given the need to optimize the microenvironmental conditions for several cell and tissue types simultaneously. Although, these are challenges that have been overcome by other organs in human physiology, and hence it is anticipated that they should be able to be overcome with future studies. Specific examples of challenges that require attention include the consideration of organoid formation (whether engineered or patient derived), which often requires iterative media and culture design (described at length elsewhere  107 5 MODELING DOC On‐chip methods represent the most recent class of microphysiological systems in DOC that encompass the favorable features of both spheroid and organoid culture while utilizing dynamic fluidics and discrete culture chambers. The addition of dynamic flow and associated mechanical cues for in vitro tissues cultured on‐chip has been shown to promote a higher degree of tissue‐emulating features, including improved representation of organ‐specific function and barrier niches.  23  108  28  109  29  110 5.1 Environmental stimuli and disease modeling of DOC Expanding on the concepts of spheroid and organoid culture, on‐chip systems can be utilized to better simulate DOC disease and tissues in vitro, enabled by the introduction of microfluidics and multi‐channel design. The addition of fluidics and multiple channels has enabled more physiologically relevant oral tissue/microbiological interactions and challenges through the introduction of dynamic flow, oxygenated interfaces, and integrated sensor design. Both dynamic flow and oxygenated interfaces can provide a more physiologically relevant environment for studying microbial behavior such as biofilm formation, which is not appropriately emulated or possible to sustain in long‐term static culture. Additionally, the use of on‐chip systems holds the potential to integrate sensor design that, in the case of host tissue/microbiological interactions, has been utilized to assess the integrity and barrier function of epithelial tissues in vitro.  111  112 In DOC, as an expansion of oral mucosal organoids, oral mucosa on‐chip models have been developed to explore the microbiological impact on oral soft tissues towards a better understanding of mucositis and periodontitis. For example, Rahimi et al. developed a gingival mucosa on‐chip system to investigate the impact of oral bacteria Streptococcus mutans  113 S. mutans  114  115  116 Through the addition of flow, on‐chip models have also allowed for the modulation of physical stimuli that are associated with the mechanical and functional features of oral tissues. Le et al. developed an oral mucosa on‐chip platform to investigate the impact of mechanical stimuli on epithelial barrier function, finding that sub‐epithelial tissue stiffness significantly modulates epithelial barrier function.  117  118  119 5.2 Improved therapeutic screening and systemic toxicity Given their enhanced degree of tissue and organ emulation, many applications of on‐chip culture systems have investigated their use as therapeutic screening platforms.  120  121 5.2.1 Modulating microbes As oral microbiome dysbiosis is particularly pernicious and patient specific, on‐chip models have been extensively used to study their behavior.  122  123  124  125  126  127 5.2.2 Radiation and chemotherapeutic screening The ability of on‐chip culture platforms to provide a specific tissue niche (as described earlier) makes them useful in the screening of radiative and drug‐based cancer therapies in DOC. Both the radiosensitivity of cancerous and peripheral DOC cell types have been explored in on‐chip models. Kennedy et al. developed a unique tumor‐on‐chip platform to explore the specific effect of radiation treatment on patient tumors cultured ex vivo.  128  129  130  131 5.2.3 Biomaterial interventions On‐chip methods allow for an expanded means of modeling biomaterial interactions. While direct surface interactions can be seen as effectively modeled in static culture systems, the effect of degradable or leachable materials is best represented in continuous culture. In DOC, the aformentioned facet has been particularly useful in modeling dental restorative materials, which have been shown to have several cyto‐ and genotoxic leachable elements.  132  133  109  58  134  135  136  58  134 In addition to the effects of restorative materials directly on dentition, the peripheral effects of leachables on DOC tissues have been explored using on‐chip models. For example, using a mucosa on‐chip model, Rahimi et al. investigated the effect of a leachable restorative monomer (HEMA) on mucosal tissues.  113  137  115 Outside of dental restorative assessment, an emerging on‐chip biomaterial strategy has been developed to investigate dental implants. Using their novel dental implant on‐chip model, Dhall et al. investigated the impact of implant architecture multiplexed with bacterial challenge on the integration of periodontal cells.  138 5.2.4 Multi‐organ and systemic toxicity One unique feature of on‐chip models is the potential to connect multiple organ or tissue systems together. DOC soft tissues, such as the oral mucosa, represent a key barrier in preventing the oral exposure to leachables or toxins from circulatory access and accumulation in peripheral organ systems. Additionally, oral exposure to toxins (such as metals) is known to activate the immune system, which can lead to peripheral effects including skin inflammation. To study this effect, Koning et al. developed a novel gingival and skin multi‐organ on‐chip system for evaluating nickel leachables from dental restorative materials.  139 5.3  DOC Currently, OoC systems represent the most effective means of emulating organ and tissue function in vitro, enabled through the integration of microfluidics, multi‐fluid interfaces, multi‐chamber design, and in situ monitoring. Within DOC, OoC systems are emerging, and there are now some examples that have been utilized to better model environmental stimuli, tissue disease states, therapeutic efficacy, and systemic toxicity. Currently, OoC platforms have had limited application in recapitulating craniofacial hard tissues and functional multi‐domain complex tissues within the periodontium. While bone on‐chip platforms are currently under development,  140 6 MICROPHYSIOLOGICAL SYSTEMS AS PRECLINICAL MODELS IN DOC Interest in oral health and disease has expanded in recent years,  141 Within DOC, there are currently few examples of OoC systems that aim to simulate the multifaceted nature of human disease and progression. For example, few studies within DOC have sought to simulate human immune function on‐chip, which is a feature already prevalent in other OoC platforms that presents a significant advantage over preclinical evaluations utilizing immuno‐compromised vertebrates.  67  142  143  144  145  146 While complete elimination of animals, as preclinical models, may not be possible as of yet, sophisticated microphysiological systems may be employed in an alternative development pipeline towards both reducing animal modeling and potentially improving clinical translation of DOC therapies (Figure 2  147  147  148  149 FIGURE 2 Traditional versus alternative preclinical modeling in DOC therapeutic development. This figure was created with the assistance of www.Biorender.com In the alternative development pipeline proposed, traditional monolayer in vitro evaluations are suggested to be followed by increasingly emulative microphysiological models prior to final therapy validation in vivo. This might serve to represent an in vitro analogue of the current phylogenetic approach used in preclinical in vivo models. Employing intermediate evaluations of increasing physiological relevance in vitro, prior to animal modeling, could stand to increase screening efficacy and efficiency, yield better insights into therapeutic mechanisms, and reduce the total number of animal studies. In this scheme, an in vivo model may be used to answer specific questions related to mammalian physiology that cannot be met by current in vitro methods, with significantly reduced sample size and experimental complexity. Costs require significant consideration in the preclinical modeling phase for the development of novel therapies in DOC, which may account for >40% of total translational costs.  150  151  152  153  154  155 7 CONCLUSIONS Diseases and disorders of the dental, oral, and craniofacial (DOC) tissues represent a significant global burden and have been shown to have the greatest age‐standardized prevalence and incidence worldwide. While the application of novel therapies has been suggested to address this global burden, a limited number of such regenerative therapies are available clinically to contribute to improving therapeutic outcomes, with only a handful of therapies translated into the clinic over the past 10 years. The lack of novel therapies in DOC tissue regeneration may be attributed to the highly resource‐intensive translational path from preclinical models to clinical trials, driven mainly by extensive testing in animal models to address regulatory hurdles. Recently, stakeholders and regulatory bodies (including the US Food and Drug Administration) have begun to encourage the use of alternatives to animal models, motivated by both a humanitarian perspective and questions about their relevance in preclinical models. This may provide an opportunity to reduce or eliminate animal testing, ultimately reducing resource expenditure and providing a more efficient regulatory pathway for the approval of novel DOC therapies. As the DOC complex represents a diverse group of interconnected tissue niches, defects and diseases are not effectively recapitulated in traditional 2D or 3D in vitro culture models. However, the emergence of more sophisticated in vitro models (or so‐called microphysiological systems that include spheroid, organoid and organ on‐chip systems) has enabled more effective modeling of DOC disease and regeneration, through enhanced emulation of DOC physiology. While such models are unable to completely replace animal use in preclinical models, an alternative translational pipeline using a pseudo‐phylogenetic approach may improve translational efficiency through enhanced lead candidate screening and by providing a mechanistic understanding of therapeutics on patient‐derived tissues. As OoC platforms within DOC progressively enhance the emulation of human immune and multi‐organ function, they may serve as future animal alternatives for applications towards efficient therapeutic validation and translation into the clinical arena. Together, the use of an in vitro ‘phylogenetic’ approach could reduce the resource burden and potentially improve the success of lead candidate efficacy in clinical trials. AUTHOR CONTRIBUTIONS  Zach Gouveia: Alican Ozcan: William Giannobile: Paul Santerre: David Wu: CONFLICT OF INTEREST STATEMENT The authors have no conflicts of interest to declare. ACKNOWLEDGMENTS NSERC Discovery Grant (RGPIN‐2018‐04424), Osteology Foundation (OF21‐032), NSERC Michael Smith Award, NSERC Canadian Graduate Scholarship Funding, and National Institutes of Health Training Grants (5T32DK007199‐44 and 5T32EB016652‐10) Wyss Technology Development Fellowship. DATA AVAILABILITY STATEMENT The data that support the findings of this study are available from the corresponding author upon reasonable request. REFERENCES 1 GBD 2017 disease and injury incidence and prevalence collaborators Global, regional, and National Incidence, prevalence, and years lived with disability for 354 diseases and injuries for 195 countries and territories, 1990–2017: a systematic analysis for the global burden of disease study 2017 Lancet 2018 392 10159 1789 1858 10.1016/S0140-6736(18)32279-7 30496104 PMC6227754 2 Chapple ILC Time to take Gum disease seriously Br Dent J 2022 232 6 360 361 10.1038/s41415-022-4113-1 3 Latimer JM Maekawa S Yao Y Wu DT Chen M Giannobile WV Regenerative medicine technologies to treat dental, oral, and craniofacial defects Front Bioeng Biotechnol 2021 9 704048 10.3389/fbioe.2021.704048 34422781 PMC8378232 4 Schifter M Yeoh S Coleman H Georgiou A Oral mucosal diseases: the inflammatory dermatoses Aust Dent J 2010 55 s1 23 38 10.1111/j.1834-7819.2010.01196.x 20553242 5 Beck JD Papapanou PN Philips KH Offenbacher S Periodontal medicine: 100 years of Progress J Dent Res 2019 98 10 1053 1062 10.1177/0022034519846113 31429666 6 Byrd KM Gulati AS The “Gum–gut” Axis in inflammatory bowel diseases: a hypothesis‐driven review of associations and advances Front Immunol 2021 12 620124 10.3389/fimmu.2021.620124 33679761 PMC7933581 7 Wu DT Cho YW Spalti MD Bishara M Nguyen TT The link between periodontitis and Alzheimer's disease – emerging clinical evidence Dent Rev 2023 3 1 100062 10.1016/j.dentre.2022.100062 8 Yao Y Raymond JE Kauffmann F Multicompartmental scaffolds for coordinated periodontal tissue engineering J Dent Res 2022 101 12 1457 1466 10.1177/00220345221099823 35689382 PMC9608095 9 Vaquette C Pilipchuk SP Bartold PM Hutmacher DW Giannobile WV Ivanovski S Tissue engineered constructs for periodontal regeneration: current status and future perspectives Adv Healthcare Mater 2018 7 21 1800457 10.1002/adhm.201800457 30146758 10 Howell TH Fiorellini JP Paquette DW Offenbacher S Giannobile WV Lynch SE A phase I/II clinical trial to evaluate a combination of recombinant human platelet‐derived growth factor‐BB and recombinant human insulin‐like growth factor‐I in patients with periodontal disease J Periodontol 1997 68 12 1186 1193 10.1902/jop.1997.68.12.1186 9444594 11 Nevins M Giannobile WV McGuire MK Platelet‐derived growth factor stimulates bone fill and rate of attachment level gain: results of a large multicenter randomized controlled trial J Periodontol 2005 76 12 2205 2215 10.1902/jop.2005.76.12.2205 16332231 12 Jung RE Glauser R Schärer P Hämmerle CHF Sailer HF Weber FE Effect of rhBMP‐2 on guided bone regeneration in humans: a randomized, controlled clinical and histomorphometric study Clin Oral Implants Res 2003 14 5 556 568 10.1034/j.1600-0501.2003.00921.x 12969359 13 Jung RE Windisch SI Eggenschwiler AM Thoma DS Weber FE Hämmerle CHF A randomized‐controlled clinical trial evaluating clinical and radiological outcomes after 3 and 5 years of dental implants placed in bone regenerated by means of GBR techniques with or without the addition of BMP‐2 Clin Oral Implants Res 2009 20 7 660 666 10.1111/j.1600-0501.2008.01648.x 19489935 14 Triplett RG Nevins M Marx RE Pivotal, randomized, parallel evaluation of recombinant human bone morphogenetic protein‐2/absorbable collagen sponge and autogenous bone graft for maxillary sinus floor augmentation J Oral Maxillofac Surg 2009 67 9 1947 1960 10.1016/j.joms.2009.04.085 19686934 15 Kitamura M Nakashima K Kowashi Y Periodontal tissue regeneration using fibroblast growth factor −2: randomized controlled phase II clinical trial PLoS One 2008 3 7 e2611 10.1371/journal.pone.0002611 18596969 PMC2432040 16 Sanz M, Tonetti MS, Zabalegui I, et al. Treatment of intrabony defects with enamel matrix proteins or barrier membranes: results from a multicenter practice‐based clinical trial J. Periodontol. 2004 75(5) 726‐733 10.1902/jop.2004.75.5.726 15212355 17 Galli M Yao Y Giannobile WV Wang H‐L Current and future trends in periodontal tissue engineering and bone regeneration Plast Aesthet Res 2021 8 3 3 10.20517/2347-9264.2020.176 35765666 PMC9236184 18 Tavelli L McGuire MK Zucchelli G Biologics‐based regenerative technologies for periodontal soft tissue engineering J Periodontol 2020 91 2 147 154 10.1002/JPER.19-0352 31479158 19 Lin Z Cho Y‐D Kauffmann F Protein‐ and cell‐based therapies for periodontal regeneration Sahingur SE Emerging Therapies in Periodontics Springer International Publishing 2020 209 230 10.1007/978-3-030-42990-4_14 20 Maekawa S Cho Y Kauffmann F BMP gene‐immobilization to dental implants enhances bone regeneration Adv Mater Inter 2022 9 22 2200531 10.1002/admi.202200531 PMC9645788 36387968 21 Plonka AB Khorsand B Yu N Effect of sustained PDGF nonviral gene delivery on repair of tooth‐supporting bone defects Gene Ther 2017 24 1 31 39 10.1038/gt.2016.73 27824330 PMC5269540 22 Van Norman GA Limitations of animal studies for predicting toxicity in clinical trials JACC Basic Transl Sci 2019 4 7 845 854 10.1016/j.jacbts.2019.10.008 31998852 PMC6978558 23 Ingber DE Human organs‐on‐chips for disease modelling, drug development and personalized medicine Nat Rev Genet 2022 23 8 467 491 10.1038/s41576-022-00466-9 35338360 PMC8951665 24 Fabre K Berridge B Proctor WR Introduction to a manuscript series on the characterization and use of microphysiological systems (MPS) in pharmaceutical safety and ADME applications Lab Chip 2020 20 6 1049 1057 10.1039/C9LC01168D 32073020 25 Bjornson‐Hooper ZB Fragiadakis GK Spitzer MH A comprehensive atlas of immunological differences between humans, mice, and non‐human primates Front Immunol 2022 13 867015 10.3389/fimmu.2022.867015 35359965 PMC8962947 26 Özkan A LoGrande NT Feitor JF Goyal G Ingber DE Intestinal organ chips for disease modelling and personalized medicine Nat Rev Gastroenterol Hepatol 2024 21 751 773 10.1038/s41575-024-00968-3 39192055 27 Gao X Wu Y Liao L Tian W Oral organoids: progress and challenges J Dent Res 2021 100 5 454 463 10.1177/0022034520983808 33478323 28 Ardila CM Jiménez‐Arbeláez GA Vivares‐Builes AM Potential clinical application of organs‐on‐a‐chip in periodontal diseases: a systematic review of in vitro studies Dent J 2023 11 7 158 10.3390/dj11070158 PMC10378380 37504224 29 Huang C Sanaei F Verdurmen WPR Yang F Ji W Walboomers XF The application of organs‐on‐a‐chip in dental, oral, and craniofacial research J Dent Res 2023 102 4 364 375 10.1177/00220345221145555 36726271 PMC10031637 30 Bissell MJ Hall HG Parry G How does the extracellular matrix direct gene expression? J Theor Biol 1982 99 1 31 68 10.1016/0022-5193(82)90388-5 6892044 31 Weaver VM Petersen OW Wang F Reversion of the malignant phenotype of human breast cells in three‐dimensional culture and in vivo by integrin blocking antibodies J Cell Biol 1997 137 1 231 245 10.1083/jcb.137.1.231 9105051 PMC2139858 32 Breslin S O'Driscoll L Three‐dimensional cell culture: the missing link in drug discovery Drug Discov Today 2013 18 5–6 240 249 10.1016/j.drudis.2012.10.003 23073387 33 Birgersdotter A Sandberg R Ernberg I Gene expression perturbation in vitro—a growing case for three‐dimensional (3D) culture systems Semin Cancer Biol 2005 15 5 405 412 10.1016/j.semcancer.2005.06.009 16055341 34 Bissell MJ Radisky DC Rizki A Weaver VM Petersen OW The organizing principle: microenvironmental influences in the normal and malignant breast Differentiation 2002 70 9–10 537 546 10.1046/j.1432-0436.2002.700907.x 12492495 PMC2933198 35 Sutherland RM McCredie JA Inch WR Growth of multicell spheroids in tissue culture as a model of nodular carcinomas J Natl Cancer Inst 1971 46 1 113 120 5101993 36 Lin R‐Z Chou L‐F Chien C‐CM Chang H‐Y Dynamic analysis of hepatoma spheroid formation: roles of E‐cadherin and Β1‐integrin Cell Tissue Res 2006 324 3 411 422 10.1007/s00441-005-0148-2 16489443 37 Fennema E Rivron N Rouwkema J Van Blitterswijk C De Boer J Spheroid culture as a tool for creating 3D complex tissues Trends Biotechnol 2013 31 2 108 115 10.1016/j.tibtech.2012.12.003 23336996 38 Velletri T Villa CE Cilli D Single cell‐derived spheroids capture the self‐renewing subpopulations of metastatic ovarian cancer Cell Death Differ 2022 29 3 614 626 10.1038/s41418-021-00878-w 34845371 PMC8901794 39 Ivascu A Kubbies M Rapid generation of single‐tumor spheroids for high‐throughput cell function and toxicity analysis SLAS Discov 2006 11 8 922 932 10.1177/1087057106292763 16973921 40 Cuevas‐González MV Suaste‐Olmos F Cuevas‐González JC Álvarez‐Pérez MA 3D spheroid cell cultures and their role in bone regeneration: a systematic review Odovtos ‐ Int J Dent Sc 2021 24 1 178 191 10.15517/ijds.2022.49151 41 Griffin KH Fok SW Kent Leach J Strategies to capitalize on cell spheroid therapeutic potential for tissue repair and disease modeling Npj Regen Med 2022 7 1 70 10.1038/s41536-022-00266-z 36494368 PMC9734656 42 Wu DT Diba M Yang S Freedman BR Elosegui‐Artola A Mooney DJ Hydrogel viscoelasticity modulates migration and fusion of mesenchymal stem cell spheroids Bioeng Transl Med 2023 8 3 e10464 10.1002/btm2.10464 37206235 PMC10189430 43 Lee S‐Y Koo I‐S Hwang HJ Lee DW In vitro three‐dimensional (3D) cell culture tools for spheroid and organoid models SLAS Discovery 2023 28 4 119 137 10.1016/j.slasd.2023.03.006 36997090 44 Ahn S Kim D Cho K Koh W‐G Microfabrication methods for 3D spheroids formation and their application in biomedical engineering Korean J Chem Eng 2023 40 2 311 324 10.1007/s11814-022-1327-5 45 Costa EC Moreira AF De Melo‐Diogo D Gaspar VM Carvalho MP Correia IJ 3D tumor spheroids: an overview on the tools and techniques used for their analysis Biotechnol Adv 2016 34 8 1427 1441 10.1016/j.biotechadv.2016.11.002 27845258 46 Liu D Chen S Win Naing M A review of manufacturing capabilities of cell spheroid generation technologies and future development Biotech Bioeng 2021 118 2 542 554 10.1002/bit.27620 33146407 47 Wu Y Li X Liu H Organoids in the oral and maxillofacial region: present and future Int J Oral Sci 2024 16 1 61 10.1038/s41368-024-00324-w 39482304 PMC11528035 48 Nikolaev M Mitrofanova O Broguiere N Homeostatic mini‐intestines through scaffold‐guided organoid morphogenesis Nature 2020 585 7826 574 578 10.1038/s41586-020-2724-8 32939089 49 Sekiya S Kikuchi T Shimizu T Perfusion culture maintained with an air–liquid Interface to stimulate epithelial cell organization in renal organoids in vitro BMC Biomed Eng 2019 1 1 15 10.1186/s42490-019-0017-9 32903332 PMC7422605 50 Candiello J Grandhi TSP Goh SK 3D heterogeneous islet organoid generation from human embryonic stem cells using a novel engineered hydrogel platform Biomaterials 2018 177 27 39 10.1016/j.biomaterials.2018.05.031 29883914 51 Huch M Gehart H van Boxtel R Long‐term culture of genome‐stable bipotent stem cells from adult human liver Cell 2015 160 1–2 299 312 10.1016/j.cell.2014.11.050 25533785 PMC4313365 52 Behjati S Huch M Van Boxtel R Genome sequencing of Normal cells reveals developmental lineages and mutational processes Nature 2014 513 7518 422 425 10.1038/nature13448 25043003 PMC4227286 53 McDonald JC Duffy DC Anderson JR Fabrication of microfluidic systems in poly(dimethylsiloxane) Electrophoresis 2000 21 1 27 40 10.1002/(SICI)1522-2683(20000101)21:1&#x0003c;27::AID-ELPS27&#x0003e;3.0.CO;2-C 10634468 54 Moerkens R Mooiweer J Ramírez‐Sánchez AD An iPSC‐derived small intestine‐on‐chip with self‐organizing epithelial, mesenchymal, and neural cells Cell Rep 2024 43 7 114247 10.1016/j.celrep.2024.114247 38907996 55 Jalili‐Firoozinezhad S Gazzaniga FS Calamari EL A complex human gut microbiome cultured in an anaerobic intestine‐on‐a‐chip Nat Biomed Eng 2019 3 7 520 531 10.1038/s41551-019-0397-0 31086325 PMC6658209 56 Neunzehn J Weber M‐T Wittenburg G Lauer G Hannig C Wiesmann H‐P Dentin‐like tissue formation and biomineralization by multicellular human pulp cell spheres in vitro Head Face Med 2014 10 1 25 10.1186/1746-160X-10-25 24946771 PMC4074584 57 Xu X Li Z Ai X Tang Y Yang D Dou L Human three‐dimensional dental pulp organoid model for toxicity screening of dental materials on dental pulp cells and tissue Int Endod J 2022 55 1 79 88 10.1111/iej.13641 34587308 58 França CM Tahayeri A Rodrigues NS The tooth on‐a‐chip: a microphysiologic model system mimicking the biologic interface of the tooth with biomaterials Lab Chip 2020 20 2 405 413 10.1039/C9LC00915A 31854401 PMC7395925 59 Mao JJ Prockop DJ Stem cells in the face: tooth regeneration and beyond Cell Stem Cell 2012 11 3 291 301 10.1016/j.stem.2012.08.010 22958928 PMC4093804 60 Avgustinova A Benitah SA Epigenetic control of adult stem cell function Nat Rev Mol Cell Biol 2016 17 10 643 658 10.1038/nrm.2016.76 27405257 61 Yasunaga M Ishikawa H Tamaoki S Maeda H Ohno J Embedded human periodontal ligament stem cells spheroids enhance cementogenic differentiation via plasminogen activator inhibitor 1 IJMS 2022 23 4 2340 10.3390/ijms23042340 35216454 PMC8878532 62 Moritani Y Usui M Sano K Spheroid culture enhances osteogenic potential of periodontal ligament mesenchymal stem cells J Periodontal Res 2018 53 5 870 882 10.1111/jre.12577 29900548 63 Yan X Van Den Beucken J Yuan C Jansen J Yang F Spheroid formation and stemness preservation of human periodontal ligament cells on chitosan films Oral Dis 2018 24 6 1083 1092 10.1111/odi.12855 29514415 64 Zhang Q Nguyen AL Shi S Three‐dimensional spheroid culture of human gingiva‐derived mesenchymal stem cells enhances mitigation of chemotherapy‐induced oral mucositis Stem Cells Dev 2012 21 6 937 947 10.1089/scd.2011.0252 21689066 PMC3315752 65 Tsutsui T Dental pulp stem cells: advances to applications SCCAA 2020 13 33 42 10.2147/SCCAA.S166759 PMC7025818 32104005 66 Zhang S Buttler‐Buecher P Denecke B Arana‐Chavez VE Apel C A comprehensive analysis of human dental pulp cell spheroids in a three‐dimensional pellet culture system Arch Oral Biol 2018 91 1 8 10.1016/j.archoralbio.2018.02.008 29621667 67 Bu N‐U Lee H‐S Lee B‐N In vitro characterization of dental pulp stem cells cultured in two microsphere‐forming culture plates JCM 2020 9 1 242 10.3390/jcm9010242 31963371 PMC7020027 68 Xu B Fan D Zhao Y Three‐dimensional culture promotes the differentiation of human dental pulp mesenchymal stem cells into insulin‐producing cells for improving the diabetes therapy Front Pharmacol 2020 10 1576 10.3389/fphar.2019.01576 32038250 PMC6993085 69 Yamamoto M Kawashima N Takashino N Three‐dimensional spheroid culture promotes odonto/osteoblastic differentiation of dental pulp cells Arch Oral Biol 2014 59 3 310 317 10.1016/j.archoralbio.2013.12.006 24581854 70 Chen K Li X Li N Spontaneously formed spheroids from mouse compact bone‐derived cells retain highly potent stem cells with enhanced differentiation capability Stem Cells Int 2019 2019 1 13 10.1155/2019/8469012 PMC6525826 31191686 71 Dong H Li X Chen K Li N Kagami H Cryopreserved spontaneous spheroids from compact bone‐derived mesenchymal stromal cells for bone tissue engineering Tissue Eng Part C Methods 2021 27 4 253 263 10.1089/ten.tec.2021.0001 33798009 PMC8064946 72 Zhu J Zhang S Jin S Endochondral repair of jawbone defects using periosteal cell spheroids J Dent Res 2024 103 1 31 41 10.1177/00220345231205273 37968792 73 Zhou Y‐H Spheroid co‐culture of BMSCs with osteocytes yields ring‐shaped bone‐like tissue that enhances alveolar bone regeneration Sci Rep 2022 12 1 14636 10.1038/s41598-022-18675-x 36030312 PMC9420131 74 Lee C Lee C Atakilit A Siu A Ramos DM Differential spheroid formation by oral cancer cells Anticancer Res 2014 34 6945 6949 25503120 75 Ikeda‐Motonakano R Hirabayashi‐Nishimuta F Yada N Fabrication of a three‐dimensional spheroid culture system for oral squamous cell carcinomas using a microfabricated device Cancer 2023 15 21 5162 10.3390/cancers15215162 PMC10649954 37958336 76 Ono K Sato K Nakamura T Reproduction of the antitumor effect of cisplatin and cetuximab using a three‐dimensional spheroid model in oral cancer Int J Med Sci 2022 19 8 1320 1333 10.7150/ijms.74109 35928727 PMC9346383 77 Pires FR Ramos AB Oliveira JBCD Tavares AS Luz PSRD Santos TCRBD Oral squamous cell carcinoma: clinicopathological features from 346 cases from a single oral pathology service during an 8‐year period J Appl Oral Sci 2013 21 5 460 467 10.1590/1679-775720130317 24212993 PMC3881836 78 Ismerim A Xavier F Cangussu M Ramalho L Agra I Dos S Useful histological findings in incisional biopsies of oral squamous cell carcinoma Srp Arh Celok Lek 2016 144 7–8 384 390 10.2298/SARH1608384I 29652445 79 Choi S‐Y Kang SH Oh SY Differential angiogenic potential of 3‐dimension spheroid of HNSCC cells in mouse xenograft IJMS 2021 22 15 8245 10.3390/ijms22158245 34361027 PMC8348975 80 Colangelo MT Vicedomini ML Belletti S Govoni P Guizzardi S Galli C A biomimetic polynucleotides–hyaluronic acid hydrogel promotes the growth of 3D spheroid cultures of gingival fibroblasts Appl Sci 2023 13 2 743 10.3390/app13020743 81 Colangelo MT Polynucleotide biogel enhances tissue repair, matrix deposition and organization J Biol Regul Homeost Agents 2021 35 1 355 362 10.23812/20-320-L 33480222 82 Janjić K Schädl B Andrukhov O Agis H The response of gingiva monolayer, spheroid, and ex vivo tissue cultures to collagen membranes and bone substitute J Tissue Eng Regen Med 2020 14 1307 1317 10.1002/term.3102 32652865 PMC7539981 83 Schutgens F Clevers H Human organoids: tools for understanding biology and treating diseases Annu Rev Pathol Mech Dis 2020 15 1 211 234 10.1146/annurev-pathmechdis-012419-032611 31550983 84 Pinnock A Murdoch C Moharamzadeh K Whawell S Douglas CWI Characterisation and optimisation of organotypic oral mucosal models to study porphyromonas gingivalis invasion Microbes Infect 2014 16 4 310 319 10.1016/j.micinf.2014.01.004 24491281 85 Zhao L Huang L Yu S Zheng J Wang H Zhang Y Decellularized tongue tissue as an in vitro model for studying tongue cancer and tongue regeneration Acta Biomater 2017 58 122 135 10.1016/j.actbio.2017.05.062 28600128 86 Flashner S Martin C Matsuura N Modeling oral‐esophageal squamous cell carcinoma in 3D organoids J. Vis. Exp 2022 190 64676 10.3791/64676 PMC10037110 36622034 87 Yoshimoto S Yoshizumi J Anzai H Inhibition of Alk signaling promotes the induction of human salivary‐gland‐derived organoids Dis Model Mech 2020 13 9 dmm045054 10.1242/dmm.045054 32801121 PMC7541338 88 Driehuis E Kolders S Spelier S Oral mucosal organoids as a potential platform for personalized cancer therapy Cancer Discov 2019 9 7 852 871 10.1158/2159-8290.CD-18-1522 31053628 89 Smith EE Zhang W Schiele NR Khademhosseini A Kuo CK Yelick PC Developing a biomimetic tooth bud model: developing a biomimetic tooth bud model J Tissue Eng Regen Med 2017 11 12 3326 3336 10.1002/term.2246 28066993 PMC6687074 90 Rosowski J Bräunig J Amler A‐K Strietzel FP Lauster R Rosowski M Emulating the early phases of human tooth development in vitro Sci Rep 2019 9 1 7057 10.1038/s41598-019-43468-0 31065008 PMC6505527 91 Tanaka J Ogawa M Hojo H Generation of orthotopically functional salivary gland from embryonic stem cells Nat Commun 2018 9 1 4216 10.1038/s41467-018-06469-7 30310071 PMC6181987 92 Hosseini ZF Nelson DA Moskwa N Larsen M Generating embryonic salivary gland organoids CP Cell Biol 2019 83 1 e76 10.1002/cpcb.76 PMC6948183 30394683 93 Guo Q Chen S Rao X Inhibition of SIRT1 promotes taste bud stem cell survival and mitigates radiation‐induced oral mucositis in mice Am J Transl Res 2019 11 8 4789 4799 31497199 PMC6731402 94 Serrano Martinez P Cinat D Van Luijk P Mouse parotid salivary gland organoids for the in vitro study of stem cell radiation response Oral Dis 2021 27 1 52 63 10.1111/odi.13475 32531849 PMC7818507 95 Vlachogiannis G Hedayat S Vatsiou A Patient‐derived organoids model treatment response of metastatic gastrointestinal cancers Science 2018 359 6378 920 926 10.1126/science.aao2774 29472484 PMC6112415 96 Yao Y Xu X Yang L Patient‐derived organoids predict chemoradiation responses of locally advanced rectal cancer Cell Stem Cell 2020 26 1 17 26.e6 10.1016/j.stem.2019.10.010 31761724 97 He X Jiang Y Zhang L Patient‐derived organoids as a platform for drug screening in metastatic colorectal cancer Front Bioeng Biotechnol 2023 11 1190637 10.3389/fbioe.2023.1190637 37284236 PMC10239948 98 Su C Olsen KA Bond CE Whitehall VLJ The efficacy of using patient‐derived organoids to predict treatment response in colorectal cancer Cancer 2023 15 3 805 10.3390/cancers15030805 PMC9913532 36765763 99 Tanaka N Osman AA Takahashi Y Head and neck cancer organoids established by modification of the CTOS method can be used to predict in vivo drug sensitivity Oral Oncol 2018 87 49 57 10.1016/j.oraloncology.2018.10.018 30527243 PMC6294331 100 Driehuis E Oosterom N Heil SG Patient‐derived oral mucosa organoids as an in vitro model for methotrexate induced toxicity in pediatric acute lymphoblastic leukemia PLoS One 2020 15 5 e0231588 10.1371/journal.pone.0231588 32421698 PMC7233536 101 Wang Y Sun Y Engineered organoids in oral and maxillofacial regeneration iScience 2023 26 1 105757 10.1016/j.isci.2022.105757 36590157 PMC9800253 102 Farshbaf A Mottaghi M Mohammadi M Regenerative application of oral and maxillofacial 3D organoids based on dental pulp stem cell Tissue Cell 2024 89 102451 10.1016/j.tice.2024.102451 38936200 103 Nakao K Morita R Saji Y The development of a bioengineered organ germ method Nat Methods 2007 4 3 227 230 10.1038/nmeth1012 17322892 104 Ono M Oshima M Ogawa M Practical whole‐tooth restoration utilizing autologous bioengineered tooth germ transplantation in a postnatal canine model Sci Rep 2017 7 1 44522 10.1038/srep44522 28300208 PMC5353657 105 Wang F Wu Z Fan Z The cell re‐association‐based whole‐tooth regeneration strategies in large animal, sus Scrofa Cell Prolif 2018 51 4 e12479 10.1111/cpr.12479 30028040 PMC6528959 106 Kim E Yoon K Arakaki M Effective differentiation of induced pluripotent stem cells into dental cells Dev Dyn 2019 248 1 129 139 10.1002/dvdy.24663 30106495 107 Ou M Li Q Ling X Yao J Mo X Cocktail formula and application prospects for oral and maxillofacial organoids Tissue Eng Regen Med 2022 19 5 913 925 10.1007/s13770-022-00455-3 35612711 PMC9477993 108 Shimshoni E Merry GE Milot ZD Epithelial–stromal interactions in Barrett's esophagus modeled in human organ chips Gastro Hep Adv 2023 2 5 676 680 10.1016/j.gastha.2023.03.009 39129866 PMC11308040 109 Franca CM Balbinot GDS Cunha D Saboia VDPA Ferracane J Bertassoni LE In‐vitro models of biocompatibility testing for restorative dental materials: from 2D cultures to organs on‐a‐Chip Acta Biomater 2022 150 58 66 10.1016/j.actbio.2022.07.060 35933103 PMC9814917 110 Farshidfar N Assar S Amiri MA The feasible application of microfluidic tissue/organ‐on‐a‐chip as an impersonator of oral tissues and organs: a direction for future research Bio‐Des Manuf 2023 6 4 478 506 10.1007/s42242-023-00235-5 111 Odijk M Van Der Meer AD Levner D Measuring direct current trans‐epithelial electrical resistance in organ‐on‐a‐chip microsystems Lab Chip 2015 15 3 745 752 10.1039/C4LC01219D 25427650 112 Van Der Helm MW Henry OYF Bein A Non‐invasive sensing of transepithelial barrier function and tissue differentiation in organs‐on‐chips using impedance spectroscopy Lab Chip 2019 19 3 452 463 10.1039/C8LC00129D 30632575 113 Rahimi C Rahimi B Padova D Oral mucosa‐on‐a‐chip to assess layer‐specific responses to bacteria and dental materials Biomicrofluidics 2018 12 5 054106 10.1063/1.5048938 30310527 PMC6158033 114 Jin L Kou N An F Analyzing human periodontal soft tissue inflammation and drug responses in vitro using epithelium–capillary interface on‐a‐chip Biosensors 2022 12 5 345 10.3390/bios12050345 35624646 PMC9138963 115 Muniraj G Tan RHS Dai Y Wu R Alberti M Sriram G Microphysiological modeling of gingival tissues and host–material interactions using gingiva‐on‐chip Adv Healthc Mater 2023 12 32 2301472 10.1002/adhm.202301472 37758297 PMC11468103 116 Makkar H Zhou Y Tan KS Lim CT Sriram G Modeling crevicular fluid flow and host–oral microbiome interactions in a gingival crevice‐on‐chip Adv Healthc Mater 2023 12 6 2202376 10.1002/adhm.202202376 36398428 117 Lee E‐J Kim Y Salipante P Mechanical regulation of oral epithelial barrier function Bioengineering 2023 10 5 517 10.3390/bioengineering10050517 37237587 PMC10215350 118 Da Costa Sousa MG Vignolo SM Franca CM Engineering models of head and neck and oral cancers on‐a‐chip Biomicrofluidics 2024 18 2 021502 10.1063/5.0186722 38464668 PMC10919958 119 Lugo‐Cintrón KM Ayuso JM Humayun M Primary head and neck tumour‐derived fibroblasts promote lymphangiogenesis in a lymphatic organotypic co‐culture model EBioMedicine 2021 73 103634 10.1016/j.ebiom.2021.103634 34673450 PMC8528684 120 Skardal A Shupe T Atala A Organoid‐on‐a‐chip and body‐on‐a‐chip systems for drug screening and disease modeling Drug Discov Today 2016 21 9 1399 1411 10.1016/j.drudis.2016.07.003 27422270 PMC9039871 121 Ziółkowska K Stelmachowska A Kwapiszewski R Chudy M Dybko A Brzózka Z Long‐term three‐dimensional cell culture and anticancer drug activity evaluation in a microfluidic chip Biosens Bioelectron 2013 40 1 68 74 10.1016/j.bios.2012.06.017 22770829 122 Shin YC Than N Min S Shin W Kim HJ Modelling host–microbiome interactions in organ‐on‐a‐chip platforms Nat Rev Bioeng 2023 2 2 175 191 10.1038/s44222-023-00130-9 123 Nance WC Dowd SE Samarian D A high‐throughput microfluidic dental plaque biofilm system to visualize and quantify the effect of antimicrobials J Antimicrob Chemother 2013 68 11 2550 2560 10.1093/jac/dkt211 23800904 PMC3797639 124 Lam RHW Cui X Guo W Thorsen T High‐throughput dental biofilm growth analysis for multiparametric microenvironmental biochemical conditions using microfluidics Lab Chip 2016 16 9 1652 1662 10.1039/C6LC00072J 27045372 125 Kristensen MF Leonhardt D Neland MLB Schlafer S A 3D printed microfluidic flow‐cell for microscopy analysis of in situ‐grown biofilms J Microbiol Methods 2020 171 105876 10.1016/j.mimet.2020.105876 32087186 126 Luo TL Hayashi M Zsiska M Introducing BAIT (biofilm architecture inference tool): a software program to evaluate the architecture of oral multi‐species biofilms Microbiology 2019 165 5 527 537 10.1099/mic.0.000761 30882296 127 Jalali F Ellett F Balani P No Man's land: species‐specific formation of exclusion zones bordering actinomyces Graevenitzii microcolonies in nanoliter cultures MicrobiologyOpen 2021 10 1 e1137 10.1002/mbo3.1137 33544453 PMC7882712 128 Kennedy R Kuvshinov D Sdrolia A A patient tumour‐on‐a‐Chip system for personalised investigation of radiotherapy based treatment regimens Sci Rep 2019 9 1 6327 10.1038/s41598-019-42745-2 31004114 PMC6474873 129 Song Y Uchida H Sharipol A Development of a functional salivary gland tissue chip with potential for high‐content drug screening Commun Biol 2021 4 1 361 10.1038/s42003-021-01876-x 33742114 PMC7979686 130 Ly KL Luo X Raub CB Oral mucositis on a chip: modeling induction by chemo‐ and radiation treatments and recovery Biofabrication 2023 15 1 015007 10.1088/1758-5090/ac933b PMC9780701 36126642 131 Ly KL Rajtboriraks M Elgerbi A Luo X Raub CB Recombinant human keratinocyte growth factor ameliorates cancer treatment‐induced oral mucositis on a chip Adv Healthc Mater 2024 13 14 2302970 10.1002/adhm.202302970 PMC11144107 38351394 132 Heil J Reifferscheid G Waldmann P Leyhausen G Geurtsen W Genotoxicity of dental materials Mutat Res Genet Toxicol 1996 368 3–4 181 194 10.1016/S0165-1218(96)90060-9 8692224 133 Gupta S Saxena P Pant V Pant A Release and toxicity of dental resin composite Toxicol Int 2012 19 3 225 234 10.4103/0971-6580.103652 23293458 PMC3532765 134 Hadjichristou C Papachristou E Bonovolias I Bakopoulou A Three‐dimensional tissue engineering‐based dentin/pulp tissue analogue as advanced biocompatibility evaluation tool of dental restorative materials Dent Mater 2020 36 2 229 248 10.1016/j.dental.2019.11.013 31791732 135 Hadjichristou C Papachristou E Vereroudakis E Biocompatibility assessment of resin‐based cements on vascularized dentin/pulp tissue‐engineered analogues Dent Mater 2021 37 5 914 927 10.1016/j.dental.2021.02.019 33691992 136 Rodrigues NS França CM Tahayeri A Biomaterial and biofilm interactions with the pulp‐dentin complex‐on‐a‐chip J Dent Res 2021 100 10 1136 1143 10.1177/00220345211016429 34036838 PMC8504857 137 Hu S Muniraj G Mishra A Characterization of silver diamine fluoride cytotoxicity using microfluidic tooth‐on‐a‐chip and gingival equivalents Dent Mater 2022 38 8 1385 1394 10.1016/j.dental.2022.06.025 35778310 138 Dhall A Tan JY Oh MJ A dental implant‐on‐a‐chip for 3D modeling of host–material–pathogen interactions and therapeutic testing platforms Lab Chip 2022 22 24 4905 4916 10.1039/D2LC00774F 36382363 PMC9732915 139 Koning JJ Rodrigues Neves CT Schimek K A multi‐organ‐on‐Chip approach to investigate how oral exposure to metals can cause systemic toxicity leading to Langerhans cell activation in skin Front Toxicol 2022 3 824825 10.3389/ftox.2021.824825 35295125 PMC8915798 140 Mansoorifar A Gordon R Bergan RC Bertassoni LE Bone‐on‐a‐chip: microfluidic technologies and microphysiologic models of bone tissue Adv Funct Mater 2021 31 6 2006796 10.1002/adfm.202006796 35422682 PMC9007546 141 Dye BA The global burden of oral disease: research and public health significance J Dent Res 2017 96 4 361 363 10.1177/0022034517693567 28318392 PMC6728669 142 Golding H Khurana S Zaitseva M What is the predictive value of animal models for vaccine efficacy in humans?: The importance of bridging studies and species‐independent correlates of protection Cold Spring Harb Perspect Biol 2018 10 4 a028902 10.1101/cshperspect.a028902 28348035 PMC5880166 143 Cai L Zhu H Mou Q Integrative analysis reveals associations between oral microbiota dysbiosis and host genetic and epigenetic aberrations in oral cavity squamous cell carcinoma Npj Biofilms Microbiomes 2024 10 1 39 10.1038/s41522-024-00511-x 38589501 PMC11001959 144 Crawford PA Gordon JI Microbial regulation of intestinal radiosensitivity Proc Natl Acad Sci U S A 2005 102 37 13254 13259 10.1073/pnas.0504830102 16129828 PMC1193536 145 Novak R Ingram M Marquez S Nat. Biomed. Eng 2020 4 407 420 10.1038/s41551-019-0497-x 31988458 PMC8057865 146 Ronaldson‐Bouchard K Teles D Yeager K A multi‐organ chip with matured tissue niches linked by vascular flow Nat Biomed Eng 2022 6 4 351 371 10.1038/s41551-022-00882-6 35478225 PMC9250010 147 Lopes CS Fernandes CMS Barbosa ACS Serra MDC Use of animals in dental research: trends and ethical reflections Lab Anim 2022 56 6 576 583 10.1177/00236772221115488 35962538 148 Dannan A Alkattan F Animal models in periodontal research: a mini‐review of the literature IJVM 2008 5 1 10.5580/c8 149 Seok J Warren HS Cuenca AG Genomic responses in mouse models poorly mimic human inflammatory diseases Proc Natl Acad Sci U S A 2013 110 9 3507 3512 10.1073/pnas.1222878110 23401516 PMC3587220 150 Simoens S Huys I R&D costs of new medicines: a landscape analysis Front Med 2021 8 760762 10.3389/fmed.2021.760762 PMC8576181 34765624 151 Hollister SJ Murphy WL Scaffold translation: barriers between concept and clinic Tissue Eng Part B Rev 2011 17 6 459 474 10.1089/ten.teb.2011.0251 21902613 PMC3223015 152 Cousin MA Greenberg AJ Koep TH The value of systematic reviews in estimating the cost and barriers to translation in tissue engineering Tissue Eng Part B Rev 2016 22 6 430 437 10.1089/ten.teb.2016.0060 27470313 PMC5124733 153 Calculated Using the National Institutes of Health (NIH)'s RePORTER Tool ( Https://Reporter.Nih.Gov 154 Using a Conservative Estimate of 10 Beagle Canines, One Surgical Intervention, and the Inclusion of Competitive per Diem Animal Housing, Feed and Care Rates in the United States Not Including Additional Personnel Cost Which May Be Incurred as per the National Institutes of Health (NIH)'s Cost Analysis and Rate Setting Manual for Animal Research Facilities ( https://grants.nih.gov/policy-and-compliance/policy-topics/air 155 Franzen N Van Harten WH Retèl VP Loskill P Van Den Eijnden‐van Raaij J IJzerman M Impact of organ‐on‐a‐chip technology on pharmaceutical R&D costs Drug Discov Today 2019 24 9 1720 1724 10.1016/j.drudis.2019.06.003 31185290 ",
  "metadata": {
    "Title of this paper": "Impact of organ‐on‐a‐chip technology on pharmaceutical R&D costs",
    "Journal it was published in:": "Bioengineering & Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478447/"
  }
}