{
  "title": "Paper_973",
  "abstract": "pmc J Pers Med J Pers Med 2605 jpersmed jpm Journal of Personalized Medicine 2075-4426 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470380 PMC12470380.1 12470380 12470380 41003114 10.3390/jpm15090411 jpm-15-00411 1 Article Ultrasound-Guided Regional Block in Renal Transplantation: Towards Personalized Pain Management https://orcid.org/0000-0002-0568-9260 Mirza Ahmad Resources 1 * https://orcid.org/0000-0002-8268-2599 Khan Munazza Resources 2 Massey Zachary Data curation 1 Baig Usman Formal analysis 3 https://orcid.org/0000-0002-4813-5022 Gani Imran Writing – original draft 3 Beigh Shameem Writing – review & editing 3 Su Diansan Academic Editor 1 zmassey@augusta.edu 2 3 sbeigh@augusta.edu * akmirza2000@yahoo.com 02 9 2025 9 2025 15 9 497650 411 20 6 2025 06 8 2025 15 8 2025 02 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Introduction: Methods: Results: p p p p p p Conclusions: ultrasound anesthesia regional block kidney transplantation perioperative pain postoperative analgesia nerve block pain control This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The post-operative recovery can be enhanced by the management of peri-operative pain [ 1 1 2 2 2 3 4 5 3 4 5 6 7 The use of ultrasound-guided regional nerve blocks has become increasingly common approach for peri-operative pain control. The use of a regional block (transverse abdominis block—TAP) has been described in many abdominal surgeries, including colectomies, cholecystectomies, hysterectomies, and hernia repair. TAP blocks exert their effect on the T6-L1 thoracolumbar nerves, providing anesthesia to the anterolateral abdominal wall [ 8 9 10 11 12 13 This retrospective study aims to review our current clinical practice of the use of regional blocks in kidney transplant recipients. The study also aims to assess the use of intra-operative and up to 24-h post-operative analgesics in kidney transplant patients with and without regional block. The study also aims to explore the possible complications and side effects related to the use of a TAP block in kidney transplant recipients. The study also aims to explore need for future studies to identify the benefits of transplant patients in a larger cohort of patients. The findings will contribute to the growing body of data on perioperative pain management in the patient population requiring renal transplantation and support the development of a more personalized approach for this specific patient group. 2. Methods The study was conducted at Wellstar MCG, Augusta University, Augusta, Georgia, USA. Full research authorization was obtained from the research review board. These retrospective data were collected form a consecutive series of 100 patients who underwent kidney transplant. No findings altered patient’s standard management since all patients have already completed their standard treatment. All patients underwent a deceased donor kidney transplant. All patients were listed on United Network of Organ Sharing (UNOS, 700 N 4th St. Richmond, VA 23219, USA) national list and were offered transplant from the national organ matching scheme. Adult patients with ages of ≥18 were included in the study. Patients with opioid dependence were excluded from the study. Opioid dependence was regarded as a confounding variable; therefore, all patients with a history of opioid dependence and usage were excluded. All demographic data including patient age, gender, race, and body mass index were collected. Pre-transplant co-morbidities were summarized for all patients. All patients charts were extensively reviewed to obtain all information pertinent to the research. Based on the data obtained, patients were divided into two groups, namely, the regional block versus non-block group. For both groups, the intra-operative and post-operative use of analgesia was recorded for up to 24 h post kidney transplant. All peri-operative complications were reviewed for all patients and were included in the analysis. 2.1. Data Analysis All data were collected using a standardized excel sheet with the data stored at the central human resource box drive of Augusta University. The data were verified for accuracy by two separate observers. IBM SPSS Statistics version 29 (IBM, New York, NY, USA) software was used to compare both continuous and discrete data variables. Normality of the data was assessed, and either a parametric ( t p 2.2. Procedure of Regional Block Informed consent for the procedure was completed before the administration of regional blocks. All patients were explained the procedure, complications, and expected outcomes. It was important to make patients aware that they will receive additional analgesia as per the clinical need along with the regional block. All patients were also made aware that the expected outcomes for pain improvement may not be achievable with the regional blocks. All patients were also given an opportunity to opt out of regional block administration. All procedures were either performed or supervised by a consultant anesthetist. A total of 4 medical personnel (consultant, intern, assistant, and nurse practitioner) were present during the procedure. For a standard regional block, the patient was positioned supine on the operating table, and the abdomen was exposed. Sterile preparation of the site was performed in the usual fashion with gowns, gloves, and masks. The chlorhexidine scrub was used to clean the site. The ultrasound probe (Philips SPARQ Ultrasound, L12-4 Probe, Cambridge, MA, USA) was placed in a transverse plane at the midaxillary line on the right side and was used to identify the muscle layers (external oblique, internal oblique, and transversus abdominis). A 20-gauge sterile needle was inserted under ultrasound guidance into the transversus abdominal plane between the internal oblique and transversus abdominis muscles ( Figure 1 A sterile dressing was placed at the site of the insertion of the needle, which was subsequently removed. Immediate attention was paid for any evidence of swelling, bruising, hematoma, or cardiac or neurological symptoms related to LA administration and toxicity. In addition, any evidence of local skin irritability and dermatological reaction at the site of administration of LA was also monitored. All patients were observed in a monitored post-surgery recovery area up to four hours after completion of kidney transplant. Patients still had invasive monitoring in the form of an arterial line and two large intravenous accesses in situ. Patient’s vitals were monitored with both invasive (arterial line) and non-invasive approaches with a blood pressure cuff. 3. Results A total of 100 patients were identified and were equally distributed between the two groups [(Group A = 50 (block), Group B = 50 (no block)]. The mean calculated age range for all patients in the study was 53.4 years (range 26 to 75 years). There was no difference between the mean age ( p Table 1 2 2 p 2 2 2 2 There was a noticeable reduction in the use of intraoperative fentanyl ( p Table 2 p p p p p Table 3 All patients at the 4-week clinic follow-up after deceased donor kidney transplant had no complaint of numbness, motor weakness, or persistent paresthesia. However, seven patients (Group A = 4, Group B = 3) reported numbness at the incision site. However, none of these complaints were related to the use of regional block. The complaint of numbness at the site of incision is a common finding and is related to scar tissue formation and regeneration. The numbness usually resolves after a period of few months with both tissue and nerve regeneration. There were no reported episodes of hematoma, bruising, or tingling at the site of LA administration. There were no anaphylactic episodes related to the administration of LA. There were no episodes of systemic toxicity related to LA usage. All patients tolerated the procedure of administration of LA well. Most patients complained of initial pain at the site of insertion of needle through the skin. However, no further pain episode was noted once the needle is in the facial plane. The mean time of completing the procedure was 16 min (range 12 to 21 min). 4. Discussion Post-operative pain can have a significant impact on post kidney transplant recovery. For management of pain, transplants patients are offered a combination of oral, intravenous, and regional blocks. Regional blocks have been used in conjunction with other analgesics to achieve adequate pain control in recipients of kidney transplants [ 13 13 14 Regional blocks in kidney transplant patients have been associated with reduction in number of inpatient stays and therefore result in considerable cost-savings. The study analyzed a group of 46 kidney transplant recipients who were administered ultrasound-guided TAP blocks. The TAP block patient group had on average of 2 less days of hospital stay compared to a matched control group. There were no reported complications from the use of TAP block in kidney transplant recipients. The study also demonstrated significant cost-savings [ 14 The efficacy of regional blocks in reducing post-operative pain and opioid consumption has also been studied. A systematic review and meta-analysis evaluated 51 randomized control trials (RCTs) of abdominal surgeries that employed TAP block versus control analgesics [ 15 15 Adding epinephrine to local anesthetics in TAP blocks slows systemic absorption, lowering peak plasma concentrations and delaying time to peak, which may reduce the risk of toxicity [ 16 17 18 19 20 It is also documented that opioid use during kidney transplant surgeries has been associated with an increased risk of graft failure and mortality [ 21 22 One of the outcomes measured in our study was the use of intra-operative fentanyl. Our study identified significantly reduced intra-operative fentanyl use in patients who received (Group A) compared to patients who did not receive the block (Group B). This finding is in line with other abdominal surgery studies, where regional blocks have been shown to decrease intra-operative opioid requirements in cholecystectomies, hepatectomies, and pancreaticoduodenectomies [ 23 24 25 p p 18 26 Complications associated with TAP blocks are uncommon. Those that have been reported include bowel perforation, infection, intravascular injection, inadvertent visceral injection, and femoral nerve palsy. With ultrasound guidance now standard of practice, the incidence of these complications has markedly decreased. During the review of our analysis, none of the immediate or short-term (up to 4 weeks) complications were identified to be related to the use of regional blocks. Our results align with existing evidence, supporting the continued use of TAP blocks as a safe and effective technique [ 20 27 The role of regional blocks in reducing first 24-h post-surgery opioid consumption and opioid-related side-effects is lacking. A systematic review and meta-analysis of 17 papers showed that TAP block groups had reduced visual analog scale (VAS) pain scores and opioid consumption 24-h post kidney transplant [ 9 21 13 13 28 Continuous TAP blocks have also been successfully used to provide analgesia post kidney transplant. Inserted intra-operatively or through ultrasound guidance, continuous TAP blocks have reduced pain scores and post-operative opioid consumption up to 48 h after surgery [ 29 30 31 In addition, our study did not find a statistically significant difference in the consumption of post-operative analgesics: hydromorphone, oxycodone, and acetaminophen. Similar results have also been described in a few RCTs. A study reported on 65 post kidney transplant patients who were either randomized to receive either a TAP block or a hoax block of 0.9% saline. Morphine utilization measured at 24 h did not statistically differ between the two groups ( p 32 p 33 9 13 29 Various local anesthetic agents (LAs)are used for TAP blocks. The mechanism of action of LAs include inhibition of the influx of sodium ions through sodium channels in nerve fibers. This inhibition blocks nerve transmission by preventing the nerve from depolarizing and initiating an action potential. The degree and duration of nerve blockade depends on multiple factors, e.g., the type of LA used, concentration, etc. A complete evaluation of the patient’s medical history, most importantly cardiac and anti-coagulation history, is crucial in the assessment, management, and administration of regional blocks. Precise and proper administration of local anesthetic agent under ultrasound guidance helps to guide correct needle placement targeting nerve fibers in the exact fascial layer to achieve maximum blockage. Post administration monitoring is crucial to identify early complications and immediate steps taken to prevent worsening [ 34 This study has several significant limitations, including its single-center design, which limits generalizability to other institutions and patient populations. Its retrospective nature relies on potentially incomplete or inconsistent chart documentation and introduces inherent data collection bias. The lack of randomization in group allocation creates selection bias and fails to control for confounding variables that could influence the outcomes between the regional block and non-block groups. Future prospective, multicenter randomized controlled trials with larger sample sizes are needed to provide more evidence regarding the efficacy of regional blocks in kidney transplant patients. In addition, a future study should be conducted also comparing different types of regional blocks and different anesthetic agents. The comparison can help to identify the usefulness and duration of blocks offered by different anesthetic agents. This future study should also compare the role of continuous block with local anesthetic agent infiltration versus a single-block approach, which has been the practice at our facility. 5. Conclusions Pain management is an important consideration when facilitating post kidney transplant recovery. Regional blocks have been previously described to lower pain scores and opioid requirements in peri-operative kidney transplant patients. Our study found that the addition of a single-injection TAP block to our analgesic regime decreased intra-operative opioid use but did not reduce 24-h post-operative analgesic consumption. The incidence of post-operative nausea, vomiting, and pruritus also remained similar in both the regional blocked and non-blocked group. It is important to note that our current study is also recommending a future randomized control trial comparison of the single-block approach versus continuous infiltration with local anesthetic of the incision via deep facial catheters for a period of up to 72 h after kidney transplant. This approach may help to decrease the post-operative analgesic requirements for a longer duration and form the basis of personalized medicine individually modified to patients’ needs. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.M.; Methodology, A.M.; Software, A.M.; Validation, \nA.M.; Formal analysis, A.M., Z.M.; Investigation, I.G.; Data curation, \nA.M., Z.M., and M.K.; Writing—original draft preparation, M.K., \nA.M., U.B. and I.G.; Writing—review and editing, U.B., S.B.; Visualization, \nI.G.; Supervision, S.B. All authors have read and agreed to the \npublished version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by the Institutional Review Board of Medical College of Georgia, Augusta University (protocol code 2294849-1. Date of approval: 7 April 2025). Informed Consent Statement The requirement for informed consent was waived by the Internal Review Board of Augusta University, Augusta, Georgia, USA, as this was a retrospective study. Data Availability Statement The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations AKI Acute kidney injury ASA American Society of Anesthesiologists M6G Morphine-6-glucuronide PCA Patient-controlled analgesia RCT Randomized controlled trial TAP Transversus abdominis plane UNOS United Network of Organ Sharing VAS Visual analog scale References 1. Golder H.J. Papalois V. Enhanced Recovery after Surgery: History, Key Advancements and Developments in Transplant Surgery J. Clin. Med. 2021 10 1634 10.3390/jcm10081634 33921433 PMC8069722 2. Morkane C.M. Fabes J. Banga N.R. Berry P.D. Kirwan C.J. Perioperative management of adult cadaveric and live donor renal transplantation in the UK: A survey of national practice Clin. Kidney J. 2019 12 880 887 10.1093/ckj/sfz017 31807303 PMC6885684 3. Jeong R. Lentine K.L. Quinn R.R. Ravani P. Wiebe N. Davison S.N. Barr B. Lam N.N. NSAID prescriptions in kidney transplant recipients Clin. Transplant. 2021 35 e14405 10.1111/ctr.14405 34174784 4. Sridharan K. Shah S. Use of non-steroidal anti-inflammatory drugs in renal transplant patients: A retrospective study Int. J. Risk Saf. Med. 2023 34 379 386 10.3233/JRS-220065 37154186 5. Amer A. Scuffell C. Dowen F. Wilson C.H. Manas D.M. A national survey on enhanced recovery for renal transplant recipients: Current practices and trends in the UK Ann. R. Coll. Surg. Engl. 2023 105 166 172 10.1308/rcsann.2021.0365 35446720 PMC9889185 6. Gao S. He Q. Opioids and the kidney: Two sides of the same coin Front. Pharmacol. 2024 15 1421248 10.3389/fphar.2024.1421248 39135801 PMC11317763 7. Lafargue M.C. Caliskan Y. Lentine K.L. Riella L.V. Opioids and Kidney Transplantation Semin. Nephrol. 2021 41 42 53 10.1016/j.semnephrol.2021.02.005 33896473 PMC8104075 8. Tsai H.C. Yoshida T. Chuang T.Y. Yang S.F. Chang C.C. Yao H.Y. Tai Y.-T. Lin J.-A. Chen K.-Y. Transversus Abdominis Plane Block: An Updated Review of Anatomy and Techniques BioMed Res. Int. 2017 2017 8284363 10.1155/2017/8284363 29226150 PMC5684553 9. Zheng C. Yang H. Yang L. Luo J. Xiong B. The Effect of Transversus Abdominis Plane Block in Kidney Transplantation: A Systematic Review and Meta-Analysis Urol. Int. 2023 107 608 616 10.1159/000529804 37231953 10. Temirov T. Ben-David B. Mustafin A. Viderman D. Erector Spinae Plane Block in Management of Pain After Kidney Transplantation Pain Med. 2019 20 1053 1054 10.1093/pm/pny221 30412258 11. Sindwani G. Sahu S. Suri A. Sureka S. Thomas M. Efficacy of ultrasound guided quadratus lumborum block as postoperative analgesia in renal transplantation recipients: A randomised double blind clinical study Indian J. Anaesth. 2020 64 605 610 10.4103/ija.ija_21_20 32792737 PMC7413355 12. Kim Y. Kim J.T. Yang S.M. Kim W.H. Han A. Ha J. Min S. Park S.-K. Anterior quadratus lumborum block for analgesia after living-donor renal transplantation: A double-blinded randomized controlled trial Reg. Anesth. Pain Med. 2024 49 550 557 10.1136/rapm-2023-104788 37704438 13. Yang P. Luo Y. Lin L. Zhang H. Liu Y. Li Y. The efficacy of transversus abdominis plane block with or without dexmedetomidine for postoperative analgesia in renal transplantation. A randomized controlled trial Int. J. Surg. 2020 79 196 201 10.1016/j.ijsu.2020.05.073 32502705 14. Ali A. Pawelec K. Cacciola R. Puliatti C. Sammartino C. Sivaparakasam R. Fernandes S. Effectiveness of Enhanced Recovery Programme in Kidney Transplant Recipient.: Abstract# A451 Transplantation 2014 98 810 15. Brogi E. Kazan R. Cyr S. Giunta F. Hemmerling T.M. Transversus abdominal plane block for postoperative analgesia: A systematic review and meta-analysis of randomized-controlled trials Can. J. Anaesth. 2016 63 1184 1196 10.1007/s12630-016-0679-x 27307177 16. El-Boghdadly K. Pawa A. Chin K.J. Local anesthetic systemic toxicity: Current perspectives Local Reg. Anesth. 2018 11 35 44 10.2147/LRA.S154512 30122981 PMC6087022 17. Shigeta H. Yasumura R. Kotake Y. Comparison of plasma levobupivacaine concentrations with and without epinephrine following erector spinae plane block for breast cancer surgery: A randomized controlled trial BMC Anesthesiol. 2022 22 86 10.1186/s12871-022-01632-6 35350983 PMC8966335 18. Soltani Mohammadi S. Dabir A. Shoeibi G. Efficacy of transversus abdominis plane block for acute postoperative pain relief in kidney recipients: A double-blinded clinical trial Pain Med. 2014 15 460 464 10.1111/pme.12311 24330449 19. Rozier R. Le Guennec Y. Capdevila X. Le Louarn E. Balbo J. Lavrut T. Baque P. Perus O. Destere A. Maurice-Szamburski A. Impact of epinephrine on ropivacaine pharmacokinetics in TAP blocks: A randomized controlled trial Reg Anesth. Pain Med. 2025 ahead of print 10.1136/rapm-2025-106500 40096993 20. Uppal V. Sancheti S. Kalagara H. Transversus Abdominis Plane (TAP) and Rectus Sheath Blocks: ATechnical Description and Evidence Review Curr. Anesthesiol. Rep. 2019 9 479 487 10.1007/s40140-019-00351-y 21. Bova S. Samet R.E. Deering J. Gaines S. Weinrub A. Bhati C. Niederhaus S. Successful Opioid Minimization Following Kidney Transplant: A Quality Improvement Initiative Cureus 2024 16 e52917 10.7759/cureus.52917 38410295 PMC10896457 22. Odoma V.A. Pitliya A. AlEdani E. Bhangu J. Javed K. Manshahia P.K. Nahar S. Kanda S. Chatha U. Mohammed L. Opioid Prescription in Patients With Chronic Kidney Disease: A Systematic Review of Comparing Safety and Efficacy of Opioid Use in Chronic Kidney Disease Patients Cureus 2023 15 e45485 10.7759/cureus.45485 37727840 PMC10506738 23. Zarate Rodriguez J. Edgley C. Lee S. Leigh N. Wolfe R. Sanford D. Hammill C. Preoperative transversus abdominis plane block decreases intraoperative opiate consumption during minimally invasive cholecystectomy Surg. Endosc. 2022 37 2209 2214 10.1007/s00464-022-09445-x 35864354 24. Erdogan M.A. Ozgul U. Uçar M. Yalin M.R. Colak Y.Z. Çolak C. Toprak H.I. Effect of transversus abdominis plane block in combination with general anesthesia on perioperative opioid consumption, hemodynamics, and recovery in living liver donors: The prospective, double-blinded, randomized study Clin. Transplant. 2017 31 e12931 10.1111/ctr.12931 28199752 25. Zárate Rodriguez J.G. Leigh N. Edgley C. Cos H. Wolfe R. Sanford D. Hammill C.W. Preoperative transversus abdominis plane block decreases intraoperative opiate use during pancreatoduodenectomy HPB 2022 24 1162 1167 10.1016/j.hpb.2021.12.008 35012875 26. Mukhtar K. Khattak I. Transversus abdominis plane block for renal transplant recipients Br. J. Anaesth. 2010 104 663 664 10.1093/bja/aeq077 20400617 27. Mavarez A.C. Hendrix J.M. Ahmed A.A. Transabdominal Plane Block StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 Available online: http://www.ncbi.nlm.nih.gov/books/NBK560527/ (accessed on 5 August 2025) 32809362 28. Leão A. Leao C. Silva M. Moraes A. Analgesic efficacy of Transverse Abdomen Plane Block in Kidney Transplantation Braz. J. Transplant. 2023 13 26 10.53855/bjt.v26i1.522_ENG 29. Farag E. Guirguis M.N. Helou M. Dalton J.E. Ngo F. Ghobrial M. O’hAra J. Seif J. Krishnamurthi V. Goldfarb D. Continuous transversus abdominis plane block catheter analgesia for postoperative pain control in renal transplant J. Anesth. 2015 29 4 8 10.1007/s00540-014-1855-1 24898186 PMC4790103 30. Viderman D. Aubakirova M. Nabidollayeva F. Aryngazin A. Romero-Garcia N. Badenes R. Abdildin Y.G. The Effect of Transversus Abdominis Plane Block on Pain-Related Outcomes in Kidney Transplantation: A Systematic Review with Meta-Analysis and Trial Sequential Analysis J. Clin. Med. 2025 14 1879 10.3390/jcm14061879 40142687 PMC11943421 31. Jankovic Z.B. Pollard S.G. Nachiappan M.M. Continuous transversus abdominis plane block for renal transplant recipients Anesth. Analg. 2009 109 1710 1711 10.1213/ANE.0b013e3181ba75d1 19843821 32. Freir N.M. Murphy C. Mugawar M. Linnane A. Cunningham A.J. Transversus abdominis plane block for analgesia in renal transplantation: A randomized controlled trial Anesth. Analg. 2012 115 953 957 10.1213/ANE.0b013e3182642117 22763899 33. Gulyam Kuruba S.M. Mukhtar K. Singh S.K. A randomised controlled trial of ultrasound-guided transversus abdominis plane block for renal transplantation Anaesthesia 2014 69 1222 1226 10.1111/anae.12704 24974901 34. Garmon E.H. Hendrix J.M. Huecker M.R. Topical, Local, and Regional Anesthesia and Anesthetics StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 Available online: https://www.ncbi.nlm.nih.gov/books/NBK430894/ (accessed on 21 February 2025) 28613644 Figure 1 Ultrasound-guided insertion of the needle for transversus abdominis plane block to deliver local anesthesia. jpm-15-00411-t001_Table 1 Table 1 General demographic characteristics of the study population.  Group A Group B Age 53.33 ± 12.53 53.48 ± 12.74 Body mass index 2 29.27 ± 5.73 29.58 ± 5.10  Gender Male 31 (62.0%) 34 (68.0%) Female 19 (38.0%) 16 (32.0%)  Race Black 36 (72.0%) 41 (82.0%) Caucasian 11 (22.0%) 5 (10.0%) Hispanic 2 (4.0%) 3 (6.0%) Asian 1 (2.0%) 1 (2.0%)  Cause of end-stage renal disease Hypertension 18 (36.0%) 21 (42.0%) Diabetes mellitus 17 (34.0%) 14 (28.0%) Focal segmental glomerulosclerosis 1 (2.0%) 1 (2.0%) Previous transplant 4 (8.0%) 3 (6.0%) Autoimmune nephropathies 7 (14.0%) 9 (18.0%) Polycystic kidney disease 3 (6.0%) 2 (4.0%)  ASA score   3 40 (80.0%) 41 (82.0%) 4 10 (20.0%) 9 (18.0%) jpm-15-00411-t002_Table 2 Table 2 The use of analgesia perioperatively and up to 24 h after deceased donor kidney transplant. Total cohort values are presented for descriptive purposes only. Statistical comparison was performed between Group A and Group B. Medication All Subjects Group A Group B p Intraoperative fentanyl (μg) 186.75 ± 105.67 171.0 ± 93.32 202.5 ± 115.53 0.04 Intraoperative hydromorphone (mg) 0.72 ± 0.48 0.72 ± 0.49 0.71 ± 0.48 0.84 Hydromorphone (mg) in 24 h 0.97± 0.74 0.94 ± 0.80 1.007 ± 0.68 0.66 Oxycodone (mg) in 24 h 24.85 ± 16.07 25.6 ± 15.83 24.59 ± 16.22 0.75 Acetaminophen (grams) in 24 h 2.67 ± 0.89 2.71 ± 0.78 2.63 ± 0.99 0.64 jpm-15-00411-t003_Table 3 Table 3 Occurrence of symptoms related to use of analgesia up to 24 h after deceased donor kidney transplant.  Group A Group B p  Nausea Yes 7 (14.0%) 6 (12.0%) 0.766 No 43 (86.0%) 44 (88.0%)  Vomiting Yes 5 (10.0%) 2 (4.0%) 0.436 No 45 (90.0%) 48 (96.0%)  Pruritus Yes 2 (4.0%) 1 (98.0%) 1 No 48 (96.0%) 49 (2.0%) ",
  "metadata": {
    "Title of this paper": "Topical, Local, and Regional Anesthesia and Anesthetics",
    "Journal it was published in:": "Journal of Personalized Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470380/"
  }
}