{
  "title": "Paper_998",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470051 PMC12470051.1 12470051 12470051 41009421 10.3390/ijms26188854 ijms-26-08854 1 Communication Thyroid Hormones Regulate Postprandial Glucose Metabolism by Regulating SGLT1 Expression in the Small Intestine in Rats and Mice https://orcid.org/0000-0002-3726-9105 Matsumoto Shunichi 1 https://orcid.org/0000-0001-9111-0632 Yoshino Satoshi 1 https://orcid.org/0000-0003-1403-6840 Okada Shuichi 1 Horiguchi Kazuhiko 1 Hashimoto Koshi 2 https://orcid.org/0000-0002-0332-8605 Yamada Eijiro 1 * Lucacchini Antonio Academic Editor 1 smatsu@gunma-u.ac.jp syoshino@gunma-u.ac.jp okadash1823@gmail.com k-hori@gunma-u.ac.jp 2 k-hashi@dokkyomed.ac.jp * eijiro.yamada@gunma-u.ac.jp 11 9 2025 9 2025 26 18 497349 8854 17 7 2025 29 8 2025 08 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Hyperthyroidism is known to increase basal metabolism and glucose uptake in the skeletal muscles while promoting gluconeogenesis in the liver. However, the specific mechanism underlying thyroid hormone-induced postprandial hyperglycemia remains unclear. This study explored the influence of thyroid hormones on sodium/glucose cotransporter 1 (SGLT1) expression in the small intestine and their impact on postprandial glucose metabolism. Specifically, we examined the distribution of thyroid hormone receptors in the small intestine and the subsequent effect of thyroid hormones on SGLT1 expression using rat and genetically modified mouse models. Our results demonstrated a significant upregulation of SGLT1 in the distal small intestine following T4 treatment, which corresponded with the enhanced postprandial glucose levels after oral glucose administration but not intraperitoneal administration. Furthermore, in TRβΔ337T knock-in mice that exhibited resistance to thyroid hormones, we observed increased SGLT1 expression and postprandial hyperglycemia, reinforcing our findings in rats. These findings suggest that thyroid hormones enhance glucose absorption in the small intestine via SGLT1, contributing to postprandial hyperglycemia. This study elucidates a previously unexplored aspect of thyroid hormone physiology and highlights the regulatory role of thyroid hormones in SGLT1 expression, offering potential therapeutic avenues for managing postprandial hyperglycemia in patients with diabetes. postprandial hyperglycemia diabetes thyroid hormones This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Reducing the risk of cardiovascular events in patients with diabetes necessitates the correction of postprandial hyperglycemia and normalization of blood glucose levels [ 1 2 3 4 5 6 7 8 9 Thyroid hormones regulate glucose metabolism; however, their mechanisms are not fully understood. In thyrotoxicosis, peripheral basal metabolism is heightened, and skeletal muscles show increased glucose uptake through upregulated glucose transporter protein type-4 (GLUT4) expression [ 10 11 12 13 14 15 16 17 Thyroid hormone receptors (TRs), specifically TRα (Gene ID: 21833) and TRβ (Gene ID: 21834), are encoded by distinct genes, TRA TRB 18 19 20 21 22 23 Based on duodenal biopsies, SGLT1 reportedly increases threefold at the mRNA level and 4.3 times at the protein level in insulin-independent patients with diabetes compared to that in healthy individuals [ 24 25 26 27 2. Results 2.1. Thyroid Receptors in the Small Intestine: Distribution and Impact on SGLT1 Expression Previous studies have demonstrated the distribution of TRs in the liver, heart, and pituitary glands [ 28 29 Figure 1 SGLT1 30 31 SGLT1 Figure 1 SGLT1 Figure 1 2.2. Thyroid Hormones Influence SGLT1 Expression and Postprandial Glucose Metabolism in the Small Intestine We demonstrated the expression of thyroid receptors and SGLT1 SGLT1 Figure 2 Figure 2 p Figure 2 SGLT1 p Figure 2 2.3. Role of Thyroid Hormones in Postprandial Hyperglycemia: Insights from the TRβΔ337T Knock-In Mouse Model To confirm whether thyroid hormones can regulate postprandial hyperglycemia by facilitating glucose absorption in the small intestine through SGLT1 32 Figure 3 Figure 3 Figure 3 Figure 3 Figure 3 SGLT1 Figure 3 SGLT1 Figure 3 Figure 1 3. Discussion This study provides valuable insights into the intricate relationship between thyroid hormones and SGLT1 TRs In this study, we focused on the influence of thyroid hormones on SGLT1 SGLT1 33 34 SGLT1 Previous in vitro research has demonstrated that T3 treatment upregulates SGLT1 expression in intestinal epithelial (Caco-2) cells [ 27 35 13 SGLT1 36 37 38 39 40 Our investigation extends beyond observational studies to elucidate the functional consequences of thyroid hormone-induced SGLT1 upregulation. Through glucose tolerance tests, we demonstrated that oral ingestion of glucose led to a significant elevation in blood glucose levels in hyperthyroid T4-treated mice, accompanied by increased SGLT1 SGLT1 Although we identified novel mechanistic insights into the regulation of postprandial hyperglycemia by thyroid hormones through in vivo studies, factors from organs other than the small intestine may influence glucose absorption and SGLT1 41 A limitation of this study is the lack of assessment of insulin levels during oral glucose tolerance tests. Therefore, we cannot exclude the possible contribution of altered insulin dynamics to the observed postprandial hyperglycemia. Another limitation is that we were unable to confirm SGLT1 protein expression despite attempts with multiple commercially available antibodies. Therefore, our conclusions are currently based on mRNA expression data. Future studies employing immunohistochemistry or targeted proteomics will be required to validate these findings at the protein level. Furthermore, as this study was conducted only in rodents, species differences may limit direct extrapolation to humans. Future studies using human data will be needed to validate the significance. In summary, our findings elucidate a previously unexplored aspect of thyroid hormone physiology, highlighting the regulatory role of thyroid hormones in SGLT1 4. Materials and Methods 4.1. Animals Mice of different genotypes, WT (TRβ+/+) and homozygous (TRbmut/mut) for the TRβΔ337T mutation, were used. Mice were generated as previously described [ 32 42 4.2. Thyroid Hormone Measurement The total serum thyroxine (T4) concentration was measured using an electrochemiluminescence immunoassay (SRL, Tokyo, Japan). Figure 1 4.3. RNA Extraction and Real-Time Quantitative Reverse Transcription PCR For the analysis of TR isoforms ( Figure 1 Figure 1 Figure 2 Figure 3 Figure 1 Figure 2 Figure 3 Gapdh 43 TRA 4.4. Glucose Tolerance Tests OGTTs were performed on conscious, unanesthetized male mice. After overnight fasting, blood was collected from the tails of mice at time 0, and then 2 g glucose/kg body weight was administered by oral gavage. Blood routinely collected at 30, 60, 90, and 120 min post-glucose bolus was assayed for glucose with a OneTouch Verio Vue glucometer (LifeScan, Malvern, PA, USA). Intraperitoneal glucose tolerance tests were performed exactly as the OGTTs, except that the mice received their glucose challenge as an intraperitoneal injection of 2.0 g glucose/kg body wt. The AUC for blood glucose levels was calculated to evaluate glucose tolerance. The trapezoidal rule was employed to compute the AUC from blood glucose concentration–time data. 4.5. Statistical Analyses Statistical analyses were performed using analysis of variance (ANOVA) and Student’s t Acknowledgments We thank R. Miyamoto for their assistance with animal care. Disclaimer/Publisher’s Note: Author Contributions S.M., the corresponding author, conducted the research. S.Y., S.O., K.H. (Kazuhiko Horiguchi), K.H. (Koshi Hashimoto) and E.Y. provided numerous suggestions for the examinations and analyzed the data. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Institutional Review Board of Gunma University, Maebashi, Japan (protocol code 21-043, approved on 6 October 2021). Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in the study are included in the article; further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. The DECODE study group on behalf of the European Diabetes Epidemiology Group Glucose tolerance and mortality: Comparison of WHO and American Diabetes Association diagnostic criteria Lancet 1999 354 617 621 10.1016/S0140-6736(98)12131-1 10466661 2. DECODA Study Group International Diabetes Epidemiology Group Cardiovascular risk profile assessment in glucose-intolerant Asian individuals—An evaluation of the World Health Organization two-step strategy: The DECODA Study (Diabetes Epidemiology: Collaborative Analysis of Diagnostic Criteria in Asia) Diabet. Med. 2002 19 549 557 10.1046/j.1464-5491.2002.00735.x 12099957 3. Tominaga M. Eguchi H. Manaka H. Igarashi K. Kato T. Sekikawa A. Impaired glucose tolerance is a risk factor for cardiovascular disease, but not impaired fasting glucose. The Funagata diabetes study Diabetes Care 1999 22 920 924 10.2337/diacare.22.6.920 10372242 4. Miller M.E. Bonds D.E. Gerstein H.C. Seaquist E.R. Bergenstal R.M. Calles-Escandon J. Childress R.D. Craven T.E. Cuddihy R.M. Dailey G. The effects of baseline characteristics, glycaemia treatment approach, and glycated haemoglobin concentration on the risk of severe hypoglycaemia: Post hoc epidemiological analysis of the Accord study BMJ 2010 340 b5444 10.1136/bmj.b5444 20061360 PMC2803743 5. Dandona P. Mathieu C. Phillip M. Hansen L. Griffen S.C. Tschöpe D. Thorén F. Xu J. Langkilde A.M. DEPICT-1 Investigators Efficacy and safety of dapagliflozin in patients with inadequately controlled type 1 diabetes (DEPICT-1): 24 week results from a multicentre, double-blind, phase 3, randomised controlled trial Lancet Diabetes Endocrinol. 2017 5 864 876 10.1016/S2213-8587(17)30308-X 28919061 6. Rahmoune H. Thompson P.W. Ward J.M. Smith C.D. Hong G. Brown J. Glucose transporters in human renal proximal tubular cells isolated from the urine of patients with non-insulin-dependent diabetes Diabetes 2005 54 3427 3434 10.2337/diabetes.54.12.3427 16306358 7. Wright E.M. SGLT2 inhibitors: Physiology and pharmacology Kidney360 2021 2 2027 2037 10.34067/KID.0002772021 35419546 PMC8986039 8. Wright E.M. Loo D.D.F. Hirayama B.A. Biology of human sodium glucose transporters Physiol. Rev. 2011 91 733 794 10.1152/physrev.00055.2009 21527736 9. Tsimihodimos V. Filippas-Ntekouan S. Elisaf M. SGLT1 inhibition: Pros and cons Eur. J. Pharmacol. 2018 838 153 156 10.1016/j.ejphar.2018.09.019 30240793 10. Zorzano A. Palacín M. Gumà A. Mechanisms regulating GLUT4 glucose transporter expression and glucose transport in skeletal muscle Acta Physiol. Scand. 2005 183 43 58 10.1111/j.1365-201X.2004.01380.x 15654919 11. Crunkhorn S. Patti M.E. Links between thyroid hormone action, oxidative metabolism, and diabetes risk? Thyroid 2008 18 227 237 10.1089/thy.2007.0249 18279023 12. Brent G.A. Mechanisms of thyroid hormone action J. Clin. Investig. 2012 122 3035 3043 10.1172/JCI60047 22945636 PMC3433956 13. Nishi M. Diabetes mellitus and thyroid diseases Diabetol. Int. 2018 9 108 112 10.1007/s13340-018-0352-4 30603357 PMC6224947 14. O’Meara N.M. Blackman J.D. Sturis J. Polonsky K.S. Alterations in the kinetics of C-peptide and insulin secretion in hyperthyroidism J. Clin. Endocrinol. Metab. 1993 76 79 84 10.1210/jcem.76.1.8421108 8421108 15. Kurozumi A. Okada Y. Tanaka Y. Changes in glucose intolerance after treatment with antithyroid drugs in patients with Graves’ disease using continuous glucose monitoring: A pilot study Intern. Med. 2023 62 1259 1263 10.2169/internalmedicine.0364-22 36171124 PMC10208777 16. Shen D.C. Davidson M.B. Kuo S.W. Sheu W.H. Peripheral and hepatic insulin antagonism in hyperthyroidism J. Clin. Endocrinol. Metab. 1988 66 565 569 10.1210/jcem-66-3-565 3280588 17. Dimitriadis G. Baker B. Marsh H. Mandarino L. Rizza R. Bergman R. Haymond M. Gerich J. Effect of thyroid hormone excess on action, secretion, and metabolism of insulin in humans Am. J. Physiol. 1985 248 E593 E601 10.1152/ajpendo.1985.248.5.E593 3887944 18. Yen P.M. Physiological and molecular basis of thyroid hormone action Physiol. Rev. 2001 81 1097 1142 10.1152/physrev.2001.81.3.1097 11427693 19. Flamant F. Samarut J. Thyroid hormone receptors: Lessons from knockout and knock-in mutant mice Trends Endocrinol. Metab. 2003 14 85 90 10.1016/S1043-2760(02)00043-7 12591179 20. Fraichard A. Chassande O. Plateroti M. Roux J.P. Trouillas J. Dehay C. Legrand C. Gauthier K. Kedinger M. Malaval L. The T3R alpha gene encoding a thyroid hormone receptor is essential for post-natal development and thyroid hormone production EMBO J. 1997 16 4412 4420 10.1093/emboj/16.14.4412 9250685 PMC1170067 21. Gauthier K. Plateroti M. Harvey C.B. Williams G.R. Weiss R.E. Refetoff S. Willott J.F. Sundin V. Roux J.P. Malaval L. Genetic analysis reveals different functions for the products of the thyroid hormone receptor alpha locus Mol. Cell. Biol. 2001 21 4748 4760 10.1128/MCB.21.14.4748-4760.2001 11416150 PMC87157 22. Bochukova E. Schoenmakers N. Agostini M. Schoenmakers E. Rajanayagam O. Keogh J.M. Henning E. Reinemund J. Gevers E. Sarri M. A mutation in the thyroid hormone receptor alpha gene N. Engl. J. Med. 2012 366 243 249 10.1056/NEJMoa1110296 22168587 23. Moran C. Chatterjee K. Resistance to thyroid hormone due to defective thyroid receptor alpha Best Pract. Res. Clin. Endocrinol. Metab. 2015 29 647 657 10.1016/j.beem.2015.07.007 26303090 PMC4559105 24. Fiorentino T.V. Suraci E. Arcidiacono G.P. Cimellaro A. Mignogna C. Presta I. Andreozzi F. Hribal M.L. Perticone F. Donato G. Duodenal sodium/glucose cotransporter 1 expression under fasting conditions is associated with postload hyperglycemia J. Clin. Endocrinol. Metab. 2017 102 3979 3989 10.1210/jc.2017-00348 28938485 25. Dyer J. Wood I.S. Palejwala A. Ellis A. Shirazi-Beechey S.P. Expression of monosaccharide transporters in intestine of diabetic humans Am. J. Physiol. Gastrointest. Liver Physiol. 2002 282 G241 G248 10.1152/ajpgi.00310.2001 11804845 26. Lambadiari V. Mitrou P. Maratou E. Raptis A.E. Tountas N. Raptis S.A. Dimitriadis G. Thyroid hormones are positively associated with insulin resistance early in the development of type 2 diabetes Endocrine 2011 39 28 32 10.1007/s12020-010-9408-3 21072691 27. Matosin-Matekalo M. Mesonero J.E. Delezay O. Poiree J.C. Ilundain A.A. Brot-Laroche E. Thyroid hormone regulation of the Na + Biochem. J. 1998 334 633 640 10.1042/bj3340633 9729472 PMC1219733 28. Brent G.A. Tissue-specific actions of thyroid hormone: Insights from animal models Rev. Endocr. Metab. Disord. 2000 1 27 33 10.1023/A:1010056202122 11704989 29. Cheng S.Y. Leonard J.L. Davis P.J. Molecular aspects of thyroid hormone actions Endocr. Rev. 2010 31 139 170 10.1210/er.2009-0007 20051527 PMC2852208 30. Lehmann A. Hornby P.J. Intestinal SGLT1 in metabolic health and disease Am. J. Physiol. Gastrointest. Liver Physiol. 2016 310 G887 G898 10.1152/ajpgi.00068.2016 27012770 31. Yoshikawa T. Inoue R. Matsumoto M. Yajima T. Ushida K. Iwanaga T. Comparative expression of hexose transporters (SGLT1, GLUT1, GLUT2 and GLUT5) throughout the mouse gastrointestinal tract Histochem. Cell Biol. 2011 135 183 194 10.1007/s00418-011-0779-1 21274556 32. Hashimoto K. Curty F.H. Borges P.P. Lee C.E. Abel E.D. Elmquist J.K. Cohen R.N. Wondisford F.E. An unliganded thyroid hormone receptor causes severe neurological dysfunction Proc. Natl Acad. Sci. USA 2001 98 3998 4003 10.1073/pnas.051454698 11274423 PMC31168 33. Sala-Rabanal M. Ghezzi C. Hirayama B.A. Kepe V. Liu J. Barrio J.R. Wright E.M. Intestinal absorption of glucose in mice as determined by positron emission tomography J. Physiol. 2018 596 2473 2489 10.1113/JP275934 29707805 PMC6023830 34. Nakamura C. Ishizuka N. Yokoyama K. Yazaki Y. Tatsumi F. Ikumi N. Hempstock W. Ikari A. Yoshino Y. Hayashi H. Regulatory mechanisms of glucose absorption in the mouse proximal small intestine during fasting and feeding Sci. Rep. 2023 13 10838 10.1038/s41598-023-38024-w 37407613 PMC10322893 35. Lei J. Nowbar S. Mariash C.N. Ingbar D.H. Thyroid hormone stimulates Na-K-ATPase activity and its plasma membrane insertion in rat alveolar epithelial cells Am. J. Physiol. Lung Cell. Mol. Physiol. 2003 285 L762 L772 10.1152/ajplung.00376.2002 12740220 36. Gorboulev V. Schürmann A. Vallon V. Kipp H. Jaschke A. Klessen D. Friedrich A. Scherneck S. Rieg T. Cunard R. Na + Diabetes 2012 61 187 196 10.2337/db11-1029 22124465 PMC3237647 37. Yan Y. Niu Z. Sun C. Li P. Shen S. Liu S. Wu Y. Yun C. Jiao T. Jia S. Hepatic thyroid hormone signalling modulates glucose homeostasis through the regulation of GLP-1 production via bile acid-mediated FXR antagonism Nat. Commun. 2022 13 6408 10.1038/s41467-022-34258-w 36302774 PMC9613917 38. Doong M.L. Wang J.W. Chung S.C. Liu J.Y. Hwang C. Hwang C.Y. Day C.H. Liu Y.F. Young T.K. Ho L.L. Regulation of thyroid hormones in the secretion of insulin and gastric inhibitory polypeptide in male rats Metabolism 1997 46 154 158 10.1016/S0026-0495(97)90294-8 9030821 39. Osei K. Falko J.M. O’Dorisio T.M. Adam D.R. Gastric inhibitory polypeptide (GIP) responses after oral glucose ingestion in hyperthyroidism Diabetes Care 1985 8 436 439 10.2337/diacare.8.5.436 3902421 40. Alemdar S. Yilmaz N. Ozdem S. Sari R. Incretin levels in patients with hypothyroidism and the evaluation of incretin levels alterations with treatment Asian Biomed. 2019 13 3 9 10.1515/abm-2019-0033 41. Chiamolera M.I. Sidhaye A.R. Matsumoto S. He Q. Hashimoto K. Ortiga-Carvalho T.M. Wondisford F.E. Fundamentally distinct roles of thyroid hormone receptor isoforms in a thyrotroph cell line are due to differential DNA binding Mol. Endocrinol. 2012 26 926 939 10.1210/me.2011-1290 22570333 PMC3355539 42. Okamura T. Nakajima Y. Shibusawa N. Horiguchi K. Matsumoto S. Yamada E. Tomaru T. Ishii S. Ozawa A. Ishizuka T. Pituitary NR4A1 is negatively regulated by thyroid hormone without direct binding of thyroid hormone receptors on the gene Mol. Cell. Endocrinol. 2018 461 32 42 10.1016/j.mce.2017.08.007 28823847 43. Dhanasekaran S. Doherty T.M. Kenneth J. TB Trials Study Group Comparison of different standards for real-time PCR-based absolute quantification J. Immunol. Methods 2010 354 34 39 10.1016/j.jim.2010.01.004 20109462 Figure 1 Tissue distribution of TRs SGLT1 A TRA TRB GAPDH B C SGLT1 Figure 2 Hyperthyroid treatment uniquely elevates blood glucose levels during OGTT, attributed to heightened SGLT1 A B C D p E F SGLT1 Figure 3 ( A B C D p E F SGLT1 G SGLT1 ",
  "metadata": {
    "Title of this paper": "Comparison of different standards for real-time PCR-based absolute quantification",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470051/"
  }
}