{
  "title": "Paper_1173",
  "abstract": "pmc Bioengineering (Basel) Bioengineering (Basel) 3241 bioeng bioengineering Bioengineering 2306-5354 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467435 PMC12467435.1 12467435 12467435 41007215 10.3390/bioengineering12090970 bioengineering-12-00970 1 Review The Therapeutic Scope of Orofacial Mesenchymal Stem Cells https://orcid.org/0009-0009-6075-1846 Vaddaram Bharath Chandra 1 https://orcid.org/0000-0002-8907-7009 Shakya Akhilesh Kumar 2 3 https://orcid.org/0000-0001-5573-1191 Zadeh Brandon R. 4 Lopez Diariza M. 4 Wagner Jon 4 Parco Todd 4 https://orcid.org/0009-0008-3785-2908 Kandalam Umadevi 4 5 * Kouroupis Dimitrios Academic Editor 1 bharath.vbcr@asu.edu 2 akhilesh.shakya@ttu.edu 3 4 5 * umadevi.kandalam@ttuhsc.edu 11 9 2025 9 2025 12 9 497612 970 25 7 2025 31 8 2025 08 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Orofacial Mesenchymal Stem Cells (OMSCs) are an attractive and promising tool for tissue regeneration, with their potential for craniofacial bone repair being a primary focus of research. A key advantage driving their clinical interest is their accessibility from tissues that are often discarded, such as exfoliated deciduous teeth, which circumvents the ethical concerns and donor site morbidity associated with other stem cell sources. The high proliferation ability and multi-differentiation capacity of OMSCs make them a unique resource for tissue engineering. Recently, OMSCs have been explored in the restoration of the heart and skin, treatment of oral mucosal lesions, and regeneration of hard connective tissues such as cartilage. Beyond their direct regenerative capabilities, OMSCs possess potent immunomodulatory functions, enabling them to regulate the immune system in various inflammatory disorders through the secretion of cytokines. This review offers an in-depth update regarding the therapeutic possibilities of OMSCs, highlighting their roles in the regeneration of bone and various tissues, outlining their immunomodulatory capabilities, and examining the essential technologies necessary for their clinical application. oral mesenchymal stem cells craniofacial tissue regeneration autoimmune disorders allergies cartilage tissue regeneration myocardium tissue regeneration immunomodulation This Review received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Limitations in current craniofacial restorative methods have spurred interest in developing new approaches, such as stem cell-based regenerative therapies, a key component of regenerative tissue engineering. This field shows great promise as regenerative tissue engineering offers a great promise as it incorporates the use of the patient’s own cells rather than relying on artificial implant materials to replace the craniofacial bone. This engineering technique offers several potential benefits, including eliminating donor site morbidity, readily available cells, the absence of immune reactivity, and no risk of disease transmission [ 1 2 3 Mesenchymal Stem Cells (MSCs), first discovered in bone marrow by Friedenstein during the 1960s and 1970s, are a multipotent cell population capable of self-renewal and differentiation. For years, Bone Marrow Mesenchymal Stem Cells (BMSCs) have been used in research to generate various types of tissues, such as bone, cartilage, and other tissues [ 4 5 6 7 4 8 9 10 11 5 12 13 14 15 1 5 16 17 12 13 18 19 Many OMSCs originate from neural crest cells, which are formed during embryonic development through a process called neurulation [ 5 13 5 5 5 20 5 20 21 11 20 21 22 5 18 12 Figure 1 Several distinct types of OMSCs, each with unique therapeutic potential, have been isolated from orofacial tissue [ 12 Table 1 2. OMSCs in Craniofacial Bone Tissue Regeneration While OMSCs hold therapeutic promise for a wide range of applications, its potential is most extensively studied in the context of skeletal repair [ 12 17 67 68 69 2.1. Conventional Approaches to Bone Repair Autogenous bone grafts, involves transplanting bone from a donor site to a deficient area within the same individual, are a common approach for repairing craniomaxillofacial defects. This method is considered the “gold standard” because it provides all three essential mechanisms for bone repair, osteoconduction, osteoinduction, and osteogenesis, and promotes excellent osteointegration [ 9 70 71 As an alternative, allografts use bone harvested from a different individual of the same species [ 72 73 74 75 72 76 77 72 78 72 78 79 80 81 79 82 2.2. Tissue Engineering Strategies for Bone Regeneration 2.2.1. The Role of Scaffolds To overcome the limitations of conventional methods, tissue engineering strategies utilize biomaterial scaffolds to enhance bone regeneration. These are designed to mimic the natural extracellular matrix (ECM); these scaffolds serve as a delivery vehicle and supportive microenvironment for stem cells at the defect site [ 50 82 83 Different materials have been used for this purpose, including ceramic-based scaffolds like Hydroxyapatite-Tricalcium Phosphate (HA-TCP) as well as biodegradable polymers such as Poly-lactic co-glycolic Acid (PLGA), which is a commonly preferred option [ 6 76 84 85 86 87 71 88 89 90 91 β β β β β The physical design of scaffolds also plays a crucial role in their effectiveness. For instance, wavy polycaprolactone (PCL) scaffolds significantly enhance the osteogenesis of human MSCs compared to linear (orthogonal) designs. This improvement is reflected in higher levels of calcium deposition, increased alkaline phosphatase (ALP) activity, and more pronounced osteocalcin staining, which were confirmed through histological staining and quantitative biochemical assays for calcium deposition [ 92 Although these findings are encouraging, it is essential to conduct thorough preclinical assessments using appropriate animal models to confirm their effectiveness and safety prior to clinical application. Evaluations comparing OMSCs and BMSCs have revealed a critical distinction between in vivo and in vitro outcomes. In vivo, OMSCs have demonstrated a bone regeneration capacity comparable to that of BMSCs [ 93 94 7 95 2.2.2. Role of Growth Factors in Vascularized Bone In addition to cells and scaffolds, growth factors are the third critical component of the tissue engineering triad. However, the function of growth factors goes beyond merely serving as osteoinductive substances that direct the differentiation of progenitor cells. Also, the long-term success of any engineered tissue construct fundamentally depends on its rapid integration with the host’s circulatory system, a process known as neovascularization [ 8 96 97 98 99 μ 8 9 83 100 101 Successful bone regeneration relies on a strong relationship between angiogenesis and osteogenesis, known as “angiogenic–osteogenic coupling.” This process involves the interdependence of new blood vessel formation and new bone development [ 96 98 100 102 103 104 At the heart of this process are essential families of growth factors that regulate this interaction, especially BMPs and VEGF. BMPs are members of the Transforming Growth Factor-Beta (TGF β de novo 18 77 105 106 107 72 76 98 108 109 The formation of this vital vascular network involves two distinct processes. Angiogenesis refers to the process where new blood vessels sprout and grow from pre-existing vessels [ 8 103 110 8 102 de novo 9 110 in situ 9 98 VEGF is arguably the most critical regulator of these processes, particularly angiogenesis in bone [ 83 97 102 103 109 97 100 110 83 98 103 111 The intricate interactions among various signaling molecules that together facilitate the coupling of angiogenesis and osteogenesis are outlined in the Table 2 99 112 In a study where combining pre-differentiated osteogenic Gingival Mesenchymal Stem Cells (GMSCs), a self-assembling hydrogel, and a low dose of BMP2 significantly accelerated alveolar bone regeneration, highlighting the power of combining a responsive cell type with targeted growth factor delivery [ 18 133 134 135 135 133 134 To harness the therapeutic potential of these growth factors, significant research has focused on developing delivery systems that provide spatiotemporal control, aiming to mimic the natural healing cascade. The most common approach involves incorporating growth factors into biomaterial scaffolds, such as hydrogels, ceramics, and synthetic polymers, which provide localized and sustained release as the material biodegrades [ 82 136 6 8 137 138 139 Even with these advancements, there are significant challenges to achieving clinical translatability. Although rhBMP-2 and rhBMP-7 are clinically approved for specific applications, their efficacy can be unpredictable, with human trials showing a lower regenerative response than promising preclinical animal studies [ 77 82 140 141 77 98 99 99 112 2.2.3. Preclinical Evaluation of Bone Reconstruction in Animal Models The effectiveness of therapies utilizing OMSCs is thoroughly evaluated in preclinical animal models, which are crucial for confirming both the safety and regenerative capabilities of novel constructs prior to their clinical translation. Researchers have utilized various defect models to simulate clinical scenarios, most commonly creating critical-size defects in the calvaria, mandible, and alveolar ridge of animals like rats and canines. Direct comparisons of OMSC-seeded scaffolds against the gold standard BMSC-seeded scaffolds under identical experimental conditions have yielded varied but informative results [ 43 93 Recent studies provide compelling, albeit sometimes conflicting, evidence for the potent osteogenic capacity of OMSCs. For example, a comparative study by Yamada et al. [ 87 142 71 Table 3 However, while these preclinical outcomes are promising, they also highlight significant challenges that temper enthusiasm for immediate clinical translation. A critical issue is the frequent observation of incomplete bone regeneration, where the engineered construct fails to fully bridge the defect and, in some cases, provides no evidence of enhanced bone formation in non-critical-sized defects. This can be exacerbated by suboptimal scaffold properties; for instance, a scaffold that does not degrade at a rate commensurate with new tissue formation can physically obstruct healing and entrap the delivered cells, as was observed in a study using a hyaluronic-based hydrogel [ 149 12 20 57 82 Taken together, the evidence from these preclinical models solidifies the role of OMSCs as a premier cell source for craniofacial bone repair. The enhanced performance of OMSCs in these craniofacial models is not attributed to a single characteristic but rather a combination of faster proliferation, potent immunomodulatory functions, and, most critically, cell-intrinsic properties derived from their neural crest origin [ 150 151 13 94 151 152 150 87 71 142 3. OMSC for Other Tissue Regeneration 3.1. Regeneration of Soft Tissues 3.1.1. Cartilage Tissue Similar to bone, repairing cartilage defects caused by trauma or degenerative conditions like Osteoarthritis represents a major clinical challenge [ 6 26 26 112 153 154 95 3.1.2. Cardiac Tissue Ischemic heart diseases, such as myocardial infarction (MI), are a leading cause of mortality. Following an MI, damaged cardiac tissue is replaced by non-functional fibrous scar tissue, impairing heart function [ 101 155 156 157 25 101 The therapeutic potential of DPSCs is largely attributed to their paracrine activity. They secrete a variety of cardioprotective cytokines and growth factors, including VEGF, Insulin-like Growth Factors (IGF-1, IGF-2), Stem Cell Factor (SCF), and Granulocyte-Colony Stimulating Factor (G-CSF), which collectively exert pro-angiogenic and anti-apoptotic effects on damaged heart tissue [ 158 159 158 Further evidence for the efficacy of dental stem cells comes from studies on SHED. In a mouse model of myocardial injury, a CM from SHED (SHED-CM) reduced the myocardial infarct size, decreased apoptosis, and lowered levels of inflammatory cytokines such as T N F - α I L - 1 β 37 37 37 Collectively, these findings underscore the potential of DPSCs and SHED-based therapies for managing ischemic heart disease by promoting neovascularization, reducing inflammation and apoptosis, and limiting adverse cardiac remodeling. However, no studies have yet reported long-term therapeutic effects of DPSCs. Nonetheless, other types of stem cells, such as BMSCs, have shown sustained improvements in left ventricular ejection fraction at 6-, 12-, 24-, and 36-month post-transplantation [ 160 161 162 3.1.3. Muscle Tissue While skeletal muscle can regenerate from minor injuries via satellite cells, this process fails after severe trauma, leading to myofiber atrophy and fibrous scar tissue [ 163 164 165 165 163 166 OMSCs possess a reasonable capacity for myogenic differentiation. For instance, Zhang et al. [ 167 168 3.1.4. Retinal and Neural Regeneration The unique neural crest origin of OMSCs makes them particularly compelling candidates for neural and retinal regeneration, a frontier extending beyond their well-established applications in musculoskeletal repair [ 5 13 25 50 71 13 25 71 83 57 71 83 25 30 41 50 65 169 169 41 57 65 170 171 172 This potential is not limited to dental pulp-derived cells. Other easily accessible sources, including PDLSCs, DFSCs, and GMSCs, also share this inherent capacity for neural repair, demonstrating the ability to differentiate into Schwann-like cells and other neural progenitors [ 43 43 173 174 37 175 176 5 13 41 150 17 177 3.1.5. Dentin-Pulp Complex In addition to bone and cartilage, OMSCs play a crucial role in initiatives aimed at regenerating the dentin-pulp complex [ 25 159 57 159 3.2. Immunomodulatory Functions of OMSCs Beyond their direct regenerative capacity, OMSCs possess potent immunomodulatory properties that are increasingly being harnessed to treat a spectrum of inflammatory and autoimmune disorders [ 41 1 178 Figure 2 3.2.1. Application in Wound Healing, Allergy, and Inflammation The immunomodulatory prowess of OMSCs is clearly demonstrated in their ability to influence wound healing and mitigate inflammatory and allergic responses by acting on key cells of both the innate and adaptive immune systems. A prime example is in cutaneous wound healing, an extremely complex process where an uncharacteristic inflammatory response can lead to scar formation and fibrotic disease [ 44 44 179 α β 179 44 180 13 181 181 This mechanism of macrophage polarization extends to other inflammatory conditions. The clinical need for novel anti-inflammatory therapies is particularly evident in conditions like severe asthma, which remains poorly controlled by conventional treatments [ 182 183 178 α 178 179 In addition to modulating the innate immune system, OMSCs also powerfully regulate the adaptive immune response, which is central to the pathology of allergic diseases. Pathologically, asthma is characterized as a T-helper 2 (TH2) cell-mediated inflammatory disease that results in chronic airway inflammation and tissue remodeling [ 184 185 186 + 185 γ 185 186 The immunomodulatory mechanisms of OMSCs involve both paracrine signaling and direct cell–cell contact. The secretory mechanism of DFSCs involves the release of factors such as TGF- β 51 178 187 185 188 3.2.2. Application in Autoimmune Disorders Autoimmune disorders, which represent a leading cause of mortality and morbidity, arise when the immune system mistakenly attacks the body’s own tissues [ 189 189 γ 152 152 The therapeutic potential of OMSCs has been demonstrated in preclinical models of specific autoimmune diseases, such as Myasthenia Gravis (MG). MG is an antibody-mediated autoimmune condition where pathogenic antibodies attack the neuromuscular junction, leading to profound muscle weakness. In a mouse model of experimental autoimmune myasthenia gravis (EAMG), treatment with DFSCs led to remarkable clinical improvements [ 52 52 Furthermore, OMSCs have shown efficacy in T-cell-driven autoimmune conditions like Rheumatoid arthritis (RA), a systemic disease characterized by chronic joint inflammation. A key defect in RA is the dysfunction of Treg, a specialized immune cell population responsible for maintaining self-tolerance. A study by Zibandeh [ 188 + + + 48 52 188 The demonstrated versatility of OMSCs, from rebuilding musculoskeletal tissues to orchestrating complex immune responses, positions them as a powerful therapeutic modality for a wide range of clinical challenges [ 25 51 39 83 4. Challenges, Limitations, and Reasons for Conflicting Data While OMSCs present a promising avenue for regenerative medicine, their journey toward widespread clinical adoption is constrained by significant hurdles. The “translational gap” between promising preclinical results and consistent clinical application is largely due to a pervasive lack of standardization and the inherent complexity of biological systems. A clear understanding of these constraints is essential for guiding future research and development. 4.1. Intrinsic Biological Constraints A primary constraint is the limited and biased differentiation capacity of OMSCs. Like all MSCs, they are multipotent, not pluripotent, meaning their differentiation is largely confined to mesenchymal lineages such as bone, cartilage, and fat, and they cannot form all cell types of the body [ 11 101 190 11 11 191 192 193 20 194 195 6 18 53 55 196 Beyond lineage bias, the process of preparing cells for therapeutic use presents its own challenges. The progressive subculturing required to expand cell numbers can negatively alter cellular phenotypes, as prolonged two-dimensional (2D) culture and serial passages may lead to a loss of self-renewal capacity and, ultimately, senescence [ 65 94 197 41 93 165 166 198 4.2. Methodological and Translational Challenges The transition from the laboratory to the clinic is further hampered by logistical issues and unpredictable cell behavior in vivo. OMSCs are often available only in limited quantities, with low cell yields from orofacial bone marrow aspirates and dental tissues, making it difficult to regenerate large defects [ 11 17 To address this, strategies like 3D spheroid culture are being explored. By allowing tight cell–cell and cell–matrix interactions that mimic the in vivo microenvironment, spheroid culture has been shown to enhance the stemness, multipotency, and secretome profiles of MSCs, while also improving their resistance to oxidative stress. Another key strategy is the development of improved, serum-free media formulations [ 13 199 200 201 39 76 164 Once transplanted, MSCs frequently exhibit poor engraftment and survival, as their fate is significantly influenced by the harsh, ischemic, or inflammatory microenvironment of the recipient niche [ 26 57 57 82 202 203 2 17 93 149 152 181 NCT03386877 204 NCT04608838 205 Table 4 4.3. Potential Reasons for Conflicting Data Conflicting or inconsistent results across studies are a common challenge, stemming from several key differences in experimental design and execution. 4.3.1. Animal Models Animal models, particularly rodents, often yield unreliable results due to fundamental differences in physiology and immune systems compared to humans [ 190 212 6 102 108 213 4.3.2. Cell Isolation and Culture Techniques MSCs are inherently heterogeneous [ 2 13 2 8 56 77 202 214 22 164 196 13 215 216 217 218 218 218 216 4.3.3. Scaffold Properties and Delivery Systems The wide variety of materials (such as PCL, collagen, and HA) makes direct comparison challenging [ 96 219 6 109 220 11 57 219 221 79 The delivery of growth factors has also been thoroughly studied in the context of stem cell-based regenerative technologies. While microencapsulation in hydrogels for sustained release is a widely used method, gene therapy and the synergistic use of two growth factors are also employed. Although preclinical studies have been successful, a significant challenge remains in clinical use due to their supraphysiological doses and short half-life. More studies have to be evaluated for their clinical use [ 222 223 4.3.4. Exosome Preparation A lack of standardized protocols for the extraction, purification, and storage of exosomes leads to inconsistencies in their reported therapeutic effects [ 41 224 41 224 225 41 4.3.5. Study Design and Reporting Many studies face challenges such as small sample sizes, limited follow-up periods, and potential publication bias, where positive results are more likely to be published, leading to an incomplete understanding of efficacy [ 2 202 26 164 226 227 2 41 93 165 4.4. Limitations of Existing Technologies The success of OMSCs therapy depends on the biomaterial scaffolds used for cell delivery. These scaffolds must have sufficient mechanical properties, enable controlled release of growth factors, replicate the natural bone ECM, and enhance vascularization; however, developing materials that fulfill all these requirements remains challenging [ 82 39 82 228 229 β 6 230 231 149 12 232 While OMSCs present a promising avenue for craniofacial and other tissue regeneration due to their inherent qualities and accessibility, their journey toward widespread clinical adoption is constrained. Overcoming these challenges will require more standardized protocols for cell handling, a deeper understanding of their in vivo behavior in complex defects, and the continued development of advanced scaffold systems that can fully support and orchestrate their regenerative potential. 5. Enabling Future Technologies and Directions 5.1. Emerging Biological Applications The frontiers for OMSC therapy are rapidly expanding into complex fields like neurodegeneration. Given their neural crest origin, OMSCs naturally secrete vital neurotrophic factors, including BDNF and NGF. This intrinsic property has positioned them as promising therapeutic candidates for conditions like Alzheimer’s and Parkinson’s disease, where they may help protect existing neurons and support endogenous nerve regeneration [ 198 233 220 5.2. 3D Bioprinting and Advanced Scaffolds The translation of regenerative therapies is increasingly reliant on advanced fabrication technologies that can construct functional, patient-specific tissues. Among these, three-dimensional (3D) bioprinting has emerged as a revolutionary approach, enabling the precise, layer-by-layer construction of scaffolds with architectures that mimic native tissue—a critical factor for successful integration, particularly for complex structures [ 112 234 92 101 15 112 219 The success of these techniques hinges on the development of advanced scaffold materials that are biocompatible, possess appropriate mechanical properties, and biodegrade at a rate that matches new tissue formation [ 92 101 112 235 β β 86 236 9 12 39 50 70 92 109 112 237 These advanced scaffolds are extensively explored for regenerating orofacial bone defects resulting from trauma, tumor resection, or congenital malformations [ 71 72 82 238 71 239 20 203 77 232 240 241 6 67 232 Beyond bone, 3D printing is being leveraged for orofacial soft tissue regeneration, overcoming the donor site morbidity and limited tissue availability associated with autologous grafts [ 71 82 219 219 39 219 The significant advantages driving the adoption of these fabrication methods are manifold [ 82 92 112 236 92 235 82 219 237 15 8 83 232 5.3. The Role of Artificial Intelligence in Regenerative Medicine Artificial Intelligence (AI) is revolutionizing regenerative medicine by transforming the field from a trial-and-error process to a predictive, data-driven paradigm [ 101 242 243 242 17 20 197 244 245 246 247 248 249 250 At the molecular level, AI accelerates the understanding of disease pathophysiology and streamlines the discovery of bioactive molecules that enhance tissue regeneration [ 197 244 251 6 252 244 242 242 5.4. Microfluidic Systems in Bone Tissue Engineering Complementing the computational power of AI, microfluidics offers a powerful platform for stem cell research by reconstructing complex physiological microenvironments in vitro [ 242 246 253 254 197 246 254 255 256 257 197 253 254 255 258 259 Although many foundational studies use other MSCs sources, the principles are directly applicable to OMSCs [ 65 177 260 111 245 246 249 261 197 213 246 250 111 213 254 259 261 262 5.5. Cell-Free Therapies: The Potential of Exosomes Exosome therapy is increasingly positioned not merely as an adjunct but as a promising cell-free alternative that could circumvent many challenges associated with direct cell-based therapies. Direct application of MSCs in translational medicine is hindered by critical issues such as insufficient tissue penetration, rapid clearance, immunological and mutagenic risks, and post-treatment complications like thromboembolism and fibrosis [ 41 13 165 263 5.6. Strategies for Clinical-Scale OMSCs Production A significant barrier to the clinical translation of OMSCs therapies is the challenge of producing sufficient quantities of high-quality, standardized cells. To address this, several scale-up strategies are being explored. To overcome the limited quantities of primary cells, generating OMSCs mimics from induced Pluripotent Stem Cells (iPSCs) is presented as a highly promising strategy. The controlled induction of iPSCs, for instance, from abundant and accessible human gingival fibroblasts, offers a method to obtain large, potentially patient-specific cell populations, bypassing the sourcing limitations of primary tissues [ 196 212 232 Here, the transition from traditional 2D culture to 3D aggregate or spheroid culture is favored. This method allows for tight cell–cell and cell–matrix interactions that better mimic the native microenvironment, which has been shown to enhance the stemness, multipotency, and secretome profiles of MSCs while improving their resistance to oxidative stress [ 13 181 5.7. Designing Multicenter Studies for Clinical Translation Addressing the challenges of heterogeneity to meet regulatory standards for translation requires a multi-pronged strategy for designing future multicenter studies. A foundational element is the strict adherence to standardized protocols guided by Good Manufacturing Practices (GMP) [ 25 93 7 225 To generate more predictive data and bridge the gap between preclinical models and human outcomes, multicenter studies should leverage advanced platforms like organ-on-a-chip systems [ 190 255 256 242 243 258 57 The conceptual roadmap of OMSCs consists of five key components: cell source, scaffold design, delivery method, molecular cues, and clinical indications. The optimal combination of these elements leads to the successful regeneration of tissue. One of the most transformative contributions in orofacial stem cell biology is the induction of pluripotency through the ectopic expression of pluripotency-associated transcription factors. The immunomodulatory property of these cells would eliminate the use of autologous stem cells. Presumably, reprogramming stem cells is a functional equivalent of Embryonic Stem Cells. The selection of the scaffold and scaffold design is given the highest priority. Scaffolds should mimic the natural extracellular matrix, providing a structural and functional framework, as well as sustained delivery of biological cues. Taken together, the optimal combination of these factors contributes to successful tissue regeneration. 6. Conclusions The field of regenerative medicine is at a pivotal juncture, poised between ground-breaking scientific discovery and the complex realities of clinical translation. Significant advancements have been made in identifying diverse stem cell populations, particularly OMSCs, which offer immense potential due to their neural crest origin and multipotent capabilities. The development of sophisticated biomaterials, notably 3D-printed wavy structures, has demonstrated an ability to directly influence cellular behavior and enhance regeneration. Moreover, the emergence of Organ-on-a-Chip (OOC) technology is revolutionary, providing physiologically relevant microenvironments that bridge the gap between simplified 2D cultures and complex animal models. The integration of AI is a transformative force, enabling researchers to analyze vast datasets, derive mechanistic insights, and design more effective therapeutic strategies. However, the field is simultaneously grappling with persistent, formidable challenges. The “translational gap” remains a chasm between highly promising preclinical results and consistent, safe, and effective clinical applications. This is largely due to a pervasive lack of standardization across virtually all aspects of research—from cell isolation and expansion to scaffold properties and exosome preparation. This inherent variability makes reproducibility a significant hurdle. Furthermore, the precise mechanisms of action of many stem cell therapies are still not fully elucidated. Safety concerns, particularly regarding potential tumorigenicity of highly proliferative cells like iPSCs, continue to necessitate rigorous screening and regulatory oversight, while cost and scalability remain significant barriers. The future of regenerative medicine lies in deepened interdisciplinary collaboration that integrates cell biology, bioengineering, computational science, and clinical practice. We must move beyond simply demonstrating “proof of concept” and focus on developing more predictive preclinical models that better mimic human conditions, including patient age and comorbidities. The industry needs to collectively establish robust, standardized, and globally recognized protocols for manufacturing and quality control of stem cell products to ensure safety and reproducibility. The path forward requires bold investment in translational research, favoring randomized controlled clinical trials with long-term follow-ups to generate high-quality evidence. We must leverage AI not just for data analysis, but for the predictive design of new biomaterials and cell-based strategies, minimizing costly trial-and-error. The ability to personalize treatments, using patient-derived iPSCs in OOC models for drug screening, offers a glimpse into a future of precision medicine. In essence, the field is like a promising sapling with deep roots in scientific discovery and rapidly growing branches of technological innovation. Acknowledgments The authors have reviewed and edited the output and take full responsibility for the content of this publication. Disclaimer/Publisher’s Note: Author Contributions Conceptualization and supervision, U.K.; Writing, editing, and review, B.C.V.; Writing, editing, and organizing the figures, A.K.S.; Writing and preparation of figures, editing, B.R.Z.; Writing, D.M.L.; Review and editing, J.W.; Writing, review, and editing, T.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Wang M. Yuan Q. Xie L. Mesenchymal Stem Cell-Based Immunomodulation: Properties and Clinical Application Stem Cells Int. 2018 2018 3057624 10.1155/2018/3057624 30013600 PMC6022321 2. Kaundal U. Bagai U. Rakha A. Immunomodulatory plasticity of mesenchymal stem cells: A potential key to successful solid organ transplantation J. Transl. Med. 2018 16 31 10.1186/s12967-018-1403-0 29448956 PMC5815241 3. Suma G. Arora M. Lakhanpal M. Stem cell therapy: A novel treatment approach for oral mucosal lesions J. Pharm. Bioallied Sci. 2015 7 2 10.4103/0975-7406.149809 25709329 PMC4333622 4. Bianco P. Robey P.G. Simmons P.J. Mesenchymal Stem Cells: Revisiting History, Concepts, and Assays Cell Stem Cell 2008 2 313 319 10.1016/j.stem.2008.03.002 18397751 PMC2613570 5. Kaltschmidt B. Kaltschmidt C. Widera D. Adult Craniofacial Stem Cells: Sources and Relation to the Neural Crest Stem Cell Rev. Rep. 2012 8 658 671 10.1007/s12015-011-9340-9 22170630 6. Zaky S. Cancedda R. Engineering Craniofacial Structures: Facing the Challenge J. Dent. Res. 2009 88 1077 1091 10.1177/0022034509349926 19897785 7. Zhang Y. Xing Y. Jia L. Ji Y. Zhao B. Wen Y. Xu X. An In Vitro Comparative Study of Multisource Derived Human Mesenchymal Stem Cells for Bone Tissue Engineering Stem Cells Dev. 2018 27 1634 1645 10.1089/scd.2018.0119 30234437 8. Wu V. Helder M.N. Bravenboer N. Ten Bruggenkate C.M. Jin J. Klein-Nulend J. Schulten E.A.J.M. Bone Tissue Regeneration in the Oral and Maxillofacial Region: A Review on the Application of Stem Cells and New Strategies to Improve Vascularization Stem Cells Int. 2019 2019 6279721 10.1155/2019/6279721 32082383 PMC7012224 9. Fishero B. Kohli N. Das A. Christophel J. Cui Q. Current Concepts of Bone Tissue Engineering for Craniofacial Bone Defect Repair Craniomaxillofac. Trauma Reconstr. 2015 8 23 30 10.1055/s-0034-1393724 25709750 PMC4329034 10. Strem B.M. Hicok K.C. Zhu M. Wulur I. Alfonso Z. Schreiber R.E. Fraser J.K. Hedrick M.H. Multipotential differentiation of adipose tissue-derived stem cells Keio J. Med. 2005 54 132 141 10.2302/kjm.54.132 16237275 11. Paz A.G. Maghaireh H. Mangano F.G. Stem Cells in Dentistry: Types of Intra- and Extraoral Tissue-Derived Stem Cells and Clinical Applications Stem Cells Int. 2018 2018 4313610 10.1155/2018/4313610 30057624 PMC6051054 12. Ansari S. Seagroves J.T. Chen C. Shah K. Aghaloo T. Wu B.M. Bencharit S. Moshaverinia A. Dental and orofacial mesenchymal stem cells in craniofacial regeneration: The prosthodontist’s point of view J. Prosthet. Dent. 2017 118 455 461 10.1016/j.prosdent.2016.11.021 28385446 PMC5623090 13. Kim D. Lee A.E. Xu Q. Zhang Q. Le A.D. Gingiva-Derived Mesenchymal Stem Cells: Potential Application in Tissue Engineering and Regenerative Medicine - A Comprehensive Review Front. Immunol. 2021 12 667221 10.3389/fimmu.2021.667221 33936109 PMC8085523 14. Le H. Xu W. Zhuang X. Chang F. Wang Y. Ding J. Mesenchymal stem cells for cartilage regeneration J. Tissue Eng. 2020 11 2041731420943839 10.1177/2041731420943839 32922718 PMC7457700 15. Hosseini V. Maroufi N.F. Saghati S. Asadi N. Darabi M. Ahmad S.N.S. Hosseinkhani H. Rahbarghazi R. Current progress in hepatic tissue regeneration by tissue engineering J. Transl. Med. 2019 17 383 10.1186/s12967-019-02137-6 31752920 PMC6873477 16. Moshaverinia A. Xu X. Chen C. Ansari S. Zadeh H.H. Snead M.L. Shi S. Application of stem cells derived from the periodontal ligament or gingival tissue sources for tendon tissue regeneration Biomaterials 2014 35 2642 2650 10.1016/j.biomaterials.2013.12.053 24397989 PMC3929697 17. Alarcón-Apablaza J. Prieto R. Rojas M. Fuentes R. Potential of Oral Cavity Stem Cells for Bone Regeneration: A Scoping Review Cells 2023 12 1392 10.3390/cells12101392 37408226 PMC10216382 18. Kandalam U. Kawai T. Ravindran G. Brockman R. Romero J. Munro M. Ortiz J. Heidari A. Thomas R. Kuriakose S. Predifferentiated Gingival Stem Cell-Induced Bone Regeneration in Rat Alveolar Bone Defect Model Tissue Eng. Part A 2021 27 424 436 10.1089/ten.tea.2020.0052 32729362 PMC8098763 19. Dominici M. Le Blanc K. Mueller I. Slaper-Cortenbach I. Marini F. Krause D. Deans R. Keating A. Prockop D. Horwitz E. Minimal criteria for defining multipotent mesenchymal stromal cells. The International Society for Cellular Therapy position statement Cytotherapy 2006 8 315 317 10.1080/14653240600855905 16923606 20. Wang X. Xing H. Zhang G. Wu X. Zou X. Feng L. Wang D. Li M. Zhao J. Du J. Restoration of a Critical Mandibular Bone Defect Using Human Alveolar Bone-Derived Stem Cells and Porous Nano-HA/Collagen/PLA Scaffold Stem Cells Int. 2016 2016 8741641 10.1155/2016/8741641 27118977 PMC4826948 21. Rehman A. Nigam A. Laino L. Russo D. Todisco C. Esposito G. Svolacchia F. Giuzio F. Desiderio V. Ferraro G. Mesenchymal Stem Cells in Soft Tissue Regenerative Medicine: A Comprehensive Review Medicina 2023 59 1449 10.3390/medicina59081449 37629738 PMC10456353 22. Iwata T. Yamato M. Zhang Z. Mukobata S. Washio K. Ando T. Feijen J. Okano T. Ishikawa I. Validation of human periodontal ligament-derived cells as a reliable source for cytotherapeutic use J. Clin. Periodontol. 2010 37 1088 1099 10.1111/j.1600-051X.2010.01597.x 20618549 23. Shi S. Robey P. Gronthos S. Comparison of human dental pulp and bone marrow stromal stem cells by cDNA microarray analysis Bone 2001 29 532 539 10.1016/S8756-3282(01)00612-3 11728923 24. Dannan A. Dental-derived Stem Cells and whole Tooth Regeneration: An Overview J. Clin. Med. Res. 2009 1 63 10.4021/jocmr2009.03.1230 22505970 PMC3318856 25. Tatullo M. Marrelli M. Shakesheff K.M. White L.J. Dental pulp stem cells: Function isolation and applications in regenerative medicine: Function isolation and applications of dental pulp stem cells J. Tissue Eng. Regen. Med. 2015 9 1205 1216 10.1002/term.1899 24850632 26. Fernandes T.L. Cortez De SantAnna J.P. Frisene I. Gazarini J.P. Gomes Pinheiro C.C. Gomoll A.H. Lattermann C. Hernandez A.J. Franco Bueno D. Systematic Review of Human Dental Pulp Stem Cells for Cartilage Regeneration Tissue Eng. Part B Rev. 2020 26 1 12 10.1089/ten.teb.2019.0140 31744404 27. Couble M.L. Farges J.C. Bleicher F. Perrat-Mabillon B. Boudeulle M. Magloire H. Odontoblast Differentiation of Human Dental Pulp Cells in Explant Cultures Calcif. Tissue Int. 2000 66 129 138 10.1007/PL00005833 10652961 28. Pierdomenico L. Bonsi L. Calvitti M. Rondelli D. Arpinati M. Chirumbolo G. Becchetti E. Marchionni C. Alviano F. Fossati V. Multipotent Mesenchymal Stem Cells with Immunosuppressive Activity Can Be Easily Isolated from Dental Pulp Transplantation 2005 80 836 842 10.1097/01.tp.0000173794.72151.88 16210973 29. Ji L. Bao L. Gu Z. Zhou Q. Liang Y. Zheng Y. Xu Y. Zhang X. Feng X. Comparison of immunomodulatory properties of exosomes derived from bone marrow mesenchymal stem cells and dental pulp stem cells Immunol. Res. 2019 67 432 442 10.1007/s12026-019-09088-6 31407157 30. Miura M. Gronthos S. Zhao M. Lu B. Fisher L.W. Robey P.G. Shi S. SHED: Stem cells from human exfoliated deciduous teeth Proc. Natl. Acad. Sci. USA 2003 100 5807 5812 10.1073/pnas.0937635100 12716973 PMC156282 31. Nakamura S. Yamada Y. Katagiri W. Sugito T. Ito K. Ueda M. Stem Cell Proliferation Pathways Comparison between Human Exfoliated Deciduous Teeth and Dental Pulp Stem Cells by Gene Expression Profile from Promising Dental Pulp J. Endod. 2009 35 1536 1542 10.1016/j.joen.2009.07.024 19840643 32. Ng T.K. Yung J.S.Y. Choy K.W. Cao D. Leung C.K.S. Cheung H.S. Pang C.P. Transdifferentiation of periodontal ligament-derived stem cells into retinal ganglion-like cells and its microRNA signature Sci. Rep. 2015 5 16429 10.1038/srep16429 26549845 PMC4637909 33. Cen L.P. Ng T.K. Liang J.J. Zhuang X. Yao X. Yam G.H.F. Chen H. Cheung H.S. Zhang M. Pang C.P. Human Periodontal Ligament-Derived Stem Cells Promote Retinal Ganglion Cell Survival and Axon Regeneration After Optic Nerve Injury Stem Cells 2018 36 844 855 10.1002/stem.2812 29476565 34. Kerkis I. Caplan A.I. Stem Cells in Dental Pulp of Deciduous Teeth Tissue Eng. Part B Rev. 2012 18 129 138 10.1089/ten.teb.2011.0327 22032258 PMC3311402 35. Rosa V. Dubey N. Islam I. Min K.S. Nör J.E. Pluripotency of Stem Cells from Human Exfoliated Deciduous Teeth for Tissue Engineering Stem Cells Int. 2016 2016 5957806 10.1155/2016/5957806 27313627 PMC4904107 36. Mohd Nor N.H. Mansor N.I. Mohd Kashim M.I.A. Mokhtar M.H. Mohd Hatta F.A. From Teeth to Therapy: A Review of Therapeutic Potential within the Secretome of Stem Cells from Human Exfoliated Deciduous Teeth Int. J. Mol. Sci. 2023 24 11763 10.3390/ijms241411763 37511524 PMC10380442 37. Yamaguchi S. Shibata R. Yamamoto N. Nishikawa M. Hibi H. Tanigawa T. Ueda M. Murohara T. Yamamoto A. Dental pulp-derived stem cell conditioned medium reduces cardiac injury following ischemia-reperfusion Sci. Rep. 2015 5 16295 10.1038/srep16295 26542315 PMC4635346 38. Seo B.M. Miura M. Gronthos S. Mark Bartold P. Batouli S. Brahim J. Young M. Gehron Robey P. Wang C.Y. Shi S. Investigation of multipotent postnatal stem cells from human periodontal ligament Lancet 2004 364 149 155 10.1016/S0140-6736(04)16627-0 15246727 39. Chen F.M. Sun H.H. Lu H. Yu Q. Stem cell-delivery therapeutics for periodontal tissue regeneration Biomaterials 2012 33 6320 6344 10.1016/j.biomaterials.2012.05.048 22695066 40. Ding G. Liu Y. Wang W. Wei F. Liu D. Fan Z. An Y. Zhang C. Wang S. Allogeneic Periodontal Ligament Stem Cell Therapy for Periodontitis in Swine Stem Cells 2010 28 1829 1838 10.1002/stem.512 20979138 PMC2996858 41. Alamdari G. Majidinia M. Diagnostic and therapeutic potential of oral cavity–derived exosomes in oral and maxillofacial tissue engineering: Current advances and future perspectives Naunyn-Schmiedeberg’s Archives of Pharmacology Springer Berlin/Heidelberg, Germany 2025 10.1007/s00210-025-04316-3 40490525 42. Zhang Q. Shi S. Liu Y. Uyanne J. Shi Y. Shi S. Le A.D. Mesenchymal Stem Cells Derived from Human Gingiva Are Capable of Immunomodulatory Functions and Ameliorate Inflammation-Related Tissue Destruction in Experimental Colitis J. Immunol. 2009 183 7787 7798 10.4049/jimmunol.0902318 19923445 PMC2881945 43. Zhang Q. Nguyen P.D. Shi S. Burrell J.C. Xu Q. Cullen K.D. Le A.D. Neural Crest Stem-Like Cells Non-genetically Induced from Human Gingiva-Derived Mesenchymal Stem Cells Promote Facial Nerve Regeneration in Rats Mol. Neurobiol. 2018 55 6965 6983 10.1007/s12035-018-0913-3 29372546 44. Zhang Q.Z. Su W.R. Shi S.H. Wilder-Smith P. Xiang A.P. Wong A. Nguyen A.L. Kwon C.W. Le A.D. Human Gingiva-Derived Mesenchymal Stem Cells Elicit Polarization of M2 Macrophages and Enhance Cutaneous Wound Healing Stem Cells 2010 28 1856 1868 10.1002/stem.503 20734355 PMC3114043 45. Gan L. Liu Y. Cui D. Pan Y. Zheng L. Wan M. Dental Tissue-Derived Human Mesenchymal Stem Cells and Their Potential in Therapeutic Application Stem Cells Int. 2020 2020 8864572 10.1155/2020/8864572 32952572 PMC7482010 46. Yildirim S. Zibandeh N. Genc D. Ozcan E.M. Goker K. Akkoc T. The Comparison of the Immunologic Properties of Stem Cells Isolated from Human Exfoliated Deciduous Teeth, Dental Pulp, and Dental Follicles Stem Cells Int. 2016 2016 4682875 10.1155/2016/4682875 26770205 PMC4684887 47. Sowmya S. Chennazhi K.P. Arzate H. Jayachandran P. Nair S.V. Jayakumar R. Periodontal Specific Differentiation of Dental Follicle Stem Cells into Osteoblast, Fibroblast, and Cementoblast Tissue Eng. Part C Methods 2015 21 1044 1058 10.1089/ten.tec.2014.0603 25962715 48. Genc D. Zibandeh N. Uluc K. Kahraman Koytak P. Gokalp M. Tanridag T. Akkoc T. Dental Follicle Mesenchymal Stem Cells Enhance CD4+Foxp3+ Regulatory T Cells in the Lymphocytes of Amyotrophic Lateral Sclerosis Patients Clin. Exp. Health Sci. 2017 7 85 90 10.5152/clinexphealthsci.2017.346 49. Kanao S. Ogura N. Takahashi K. Ito K. Suemitsu M. Kuyama K. Kondoh T. Capacity of Human Dental Follicle Cells to Differentiate into Neural Cells In Vitro Stem Cells Int. 2017 2017 8371326 10.1155/2017/8371326 28261273 PMC5316458 50. Chen Y. Huang H. Li G. Yu J. Fang F. Qiu W. Dental-derived mesenchymal stem cell sheets: A prospective tissue engineering for regenerative medicine Stem Cell Res. Ther. 2022 13 38 10.1186/s13287-022-02716-3 35093155 PMC8800229 51. Zibandeh N. Genc D. Duran Y. Banzragch M. Sokwala S. Human dental follicle mesenchymal stem cells alleviate T cell response in inflamed tissue of Crohn’s patients Turk. J. Gastroenterol. 2020 31 400 409 10.5152/tjg.2020.19358 32519960 PMC7289169 52. Ulusoy C. Zibandeh N. Yıldırım S. Trakas N. Zisimopoulou P. Küçükerden M. Tașlı H. Tzartos S. Göker K. Tüzün E. Dental follicle mesenchymal stem cell administration ameliorates muscle weakness in MuSK-immunized mice J. Neuroinflamm. 2015 12 231 10.1186/s12974-015-0451-0 PMC4673854 26646841 53. Matsubara T. Suardita K. Ishii M. Sugiyama M. Igarashi A. Oda R. Nishimura M. Saito M. Nakagawa K. Yamanaka K. Alveolar Bone Marrow as a Cell Source for Regenerative Medicine: Differences Between Alveolar and Iliac Bone Marrow Stromal Cells J. Bone Miner. Res. 2005 20 399 409 10.1359/JBMR.041117 15746984 54. Liu Y. Wang H. Dou H. Tian B. Li L. Jin L. Zhang Z. Hu L. Bone regeneration capacities of alveolar bone mesenchymal stem cells sheet in rabbit calvarial bone defect J. Tissue Eng. 2020 11 2041731420930379 10.1177/2041731420930379 32566118 PMC7288803 55. Ghaderi H. Razmkhah M. Kiany F. Chenari N. Haghshenas M.R. Comparison of Osteogenic and Chondrogenic Differentiation Ability of Buccal Fat Pad Derived Mesenchymal Stem Cells and Gingival Derived Cells J. Dent. 2018 19 124 PMC5960732 29854886 56. Meshram M. Anchlia S. Shah H. Vyas S. Dhuvad J. Sagarka L. Buccal Fat Pad-Derived Stem Cells for Repair of Maxillofacial Bony Defects J. Maxillofac. Oral Surg. 2019 18 112 123 10.1007/s12663-018-1106-3 30728702 PMC6328824 57. Soudi A. Yazdanian M. Ranjbar R. Tebyanian H. Yazdanian A. Tahmasebi E. Keshvad A. Seifalian A. Role and application of stem cells in dental regeneration: A comprehensive overview Excli J. 2021 20 454 10.17179/EXCLI2021-3335 33746673 PMC7975587 58. Gorjup E. Danner S. Rotter N. Habermann J. Brassat U. Brummendorf T.H. Wien S. Meyerhans A. Wollenberg B. Kruse C. Glandular tissue from human pancreas and salivary gland yields similar stem cell populations Eur. J. Cell Biol. 2009 88 409 421 10.1016/j.ejcb.2009.02.187 19410331 59. Rocchi C. Barazzuol L. Coppes R.P. The evolving definition of salivary gland stem cells NPJ Regen. Med. 2021 6 4 10.1038/s41536-020-00115-x 33526786 PMC7851389 60. Ratajczak M.Z. Kucia M. Jadczyk T. Greco N.J. Wojakowski W. Tendera M. Ratajczak J. Pivotal role of paracrine effects in stem cell therapies in regenerative medicine: Can we translate stem cell-secreted paracrine factors and microvesicles into better therapeutic strategies? Leukemia 2012 26 1166 1173 10.1038/leu.2011.389 22182853 61. Sonoyama W. Liu Y. Fang D. Yamaza T. Seo B.M. Zhang C. Liu H. Gronthos S. Wang C.Y. Shi S. Mesenchymal Stem Cell-Mediated Functional Tooth Regeneration in Swine PLoS ONE 2006 1 e79 10.1371/journal.pone.0000079 17183711 PMC1762318 62. Ikeda E. Hirose M. Kotobuki N. Shimaoka H. Tadokoro M. Maeda M. Hayashi Y. Kirita T. Ohgushi H. Osteogenic differentiation of human dental papilla mesenchymal cells Biochem. Biophys. Res. Commun. 2006 342 1257 1262 10.1016/j.bbrc.2006.02.101 16516858 63. Yang H. Cao Y. Zhang J. Liang Y. Su X. Zhang C. Liu H. Han X. Ge L. Fan Z. DLX5 and HOXC8 enhance the chondrogenic differentiation potential of stem cells from apical papilla via LINC01013 Stem Cell Res. Ther. 2020 11 271 10.1186/s13287-020-01791-8 32631410 PMC7336658 64. Yang C. Li X. Sun L. Guo W. Tian W. Potential of human dental stem cells in repairing the complete transection of rat spinal cord J. Neural Eng. 2017 14 026005 10.1088/1741-2552/aa596b 28085005 65. Basabrain M.S. Zaeneldin A. Bijle M.N. Zhang C. Dental stem cell sphere formation and potential for neural regeneration: A scoping review Heliyon 2024 10 e40262 10.1016/j.heliyon.2024.e40262 39619582 PMC11605411 66. Andrukhov O. Behm C. Blufstein A. Rausch-Fan X. Immunomodulatory properties of dental tissue-derived mesenchymal stem cells: Implication in disease and tissue regeneration World J. Stem Cells 2019 11 604 617 10.4252/wjsc.v11.i9.604 31616538 PMC6789188 67. Dunn C.A. Jin Q. Taba M. Franceschi R.T. Bruce Rutherford R. Giannobile W.V. BMP gene delivery for alveolar bone engineering at dental implant defects Mol. Ther. 2005 11 294 299 10.1016/j.ymthe.2004.10.005 15668141 PMC2573463 68. Kim J.H. Kim M.K. Park J.H. Won J.E. Kim T.H. Kim H.W. Performance of Novel Nanofibrous Biopolymer Membrane for Guided Bone Regeneration within Rat Mandibular Defect In Vivo 2011 25 589 21709001 69. Waite P.D. Waite D.E. Bone grafting for the alveolar cleft defect Semin. Orthod. 1996 2 192 196 10.1016/S1073-8746(96)80014-4 9161288 70. Costantino P.D. Hiltzik D. Govindaraj S. Moche J. Bone Healing and Bone Substitutes Facial Plast. Surg. 2002 18 013 026 10.1055/s-2002-19823 11823929 71. Chamieh F. Collignon A.M. Coyac B.R. Lesieur J. Ribes S. Sadoine J. Llorens A. Nicoletti A. Letourneur D. Colombier M.L. Accelerated craniofacial bone regeneration through dense collagen gel scaffolds seeded with dental pulp stem cells Sci. Rep. 2016 6 38814 10.1038/srep38814 27934940 PMC5146967 72. Elsalanty M.E. Genecov D.G. Bone Grafts in Craniofacial Surgery Craniomaxillofac. Trauma Reconstr. 2009 2 125 134 10.1055/s-0029-1215875 22110806 PMC3052656 73. Ansari N. Faraz F. Lamba A.K. Tandon S. Kamal Z. Madni Z.K. Effect of Demineralization Time on the Release of Bone Morphogenetic Protein in Indigenously Prepared Demineralized Freeze-Dried Bone Allografts: A Comparative In Vitro Study Cureus 2025 17 e84037 10.7759/cureus.84037 40519500 PMC12162367 74. Kamadjaja D.B. Satriyo H. Setyawan A. Lesmaya Y.D. Safril J.W. Sumarta N.P.M. Rizqiawan A. Danudiningrat C.P. Tran T.T. Analyses of Bone Regeneration Capacity of Freeze-Dried Bovine Bone and Combined Deproteinized-Demineralized Bovine Bone Particles in Mandibular Defects: The Potential Application of Biological Forms of Bovine-Bone Filler Eur. J. Dent. 2022 16 403 413 10.1055/s-0041-1736291 34814221 PMC9339928 75. Bigham A.S. Dehghani S.N. Shafiei Z. Torabi Nezhad S. Xenogenic demineralized bone matrix and fresh autogenous cortical bone effects on experimental bone healing: Radiological, histopathological and biomechanical evaluation J. Orthop. Traumatol. Off. J. Ital. Soc. Orthop. Traumatol. 2008 9 73 80 10.1007/s10195-008-0006-6 PMC2656957 19384620 76. Cancedda R. Giannoni P. Mastrogiacomo M. A tissue engineering approach to bone repair in large animal models and in clinical practice Biomaterials 2007 28 4240 4250 10.1016/j.biomaterials.2007.06.023 17644173 77. Chenard K.E. Teven C.M. He T.C. Reid R.R. Bone Morphogenetic Proteins in Craniofacial Surgery: Current Techniques, Clinical Experiences, and the Future of Personalized Stem Cell Therapy J. Biomed. Biotechnol. 2012 2012 601549 10.1155/2012/601549 23226941 PMC3511855 78. Laurencin C.T. El-Amin S.F. Xenotransplantation in Orthopaedic Surgery J. Am. Acad. Orthop. Surg. 2008 16 4 8 10.5435/00124635-200801000-00002 18180387 79. Elgali I. Omar O. Dahlin C. Thomsen P. Guided bone regeneration: Materials and biological mechanisms revisited Eur. J. Oral Sci. 2017 125 315 337 10.1111/eos.12364 28833567 PMC5601292 80. Oh T. Rahman M.M. Lim J.H. Park M.S. Kim D.Y. Yoon J.h. Kim W.H. Kikuchi M. Tanaka J. Koyama Y. Guided bone regeneration with beta-tricalcium phosphate and poly L-lactide-co-glycolide-co-epsilon-caprolactone membrane in partial defects of canine humerus J. Vet. Sci. 2006 7 73 10.4142/jvs.2006.7.1.73 16434854 PMC3242090 81. Eickholz P. Kim T. Holle R. Guided tissue regeneration with non-resorbable and biodegradable barriers: 6 months results J. Clin. Periodontol. 1997 24 92 101 10.1111/j.1600-051X.1997.tb00473.x 9062855 82. Kinoshita Y. Maeda H. Recent Developments of Functional Scaffolds for Craniomaxillofacial Bone Tissue Engineering Applications Sci. World J. 2013 2013 863157 10.1155/2013/863157 PMC3791836 24163634 83. Diomede F. Marconi G.D. Fonticoli L. Pizzicanella J. Merciaro I. Bramanti P. Mazzon E. Trubiani O. Functional Relationship between Osteogenesis and Angiogenesis in Tissue Regeneration Int. J. Mol. Sci. 2020 21 3242 10.3390/ijms21093242 32375269 PMC7247346 84. Jin Q.M. Takita H. Kohgo T. Atsumi K. Itoh H. Kuboki Y. Effects of geometry of hydroxyapatite as a cell substratum in BMP-induced ectopic bone formation J. Biomed. Mater. Res. 2000 51 491 499 10.1002/1097-4636(20000905)51:3&#x0003c;491::AID-JBM25&#x0003e;3.0.CO;2-1 10880093 85. Barralet J. Grover L. Gaunt T. Wright A. Gibson I. Preparation of macroporous calcium phosphate cement tissue engineering scaffold Biomaterials 2002 23 3063 3072 10.1016/S0142-9612(01)00401-X 12102177 86. Wang J. Yang M. Zhu Y. Wang L. Tomsia A.P. Mao C. Phage Nanofibers Induce Vascularized Osteogenesis in 3D Printed Bone Scaffolds Adv. Mater. 2014 26 4961 4966 10.1002/adma.201400154 24711251 PMC4122615 87. Yamada Y. Ito K. Nakamura S. Ueda M. Nagasaka T. Promising Cell-Based Therapy for Bone Regeneration Using Stem Cells from Deciduous Teeth, Dental Pulp, and Bone Marrow Cell Transplant. 2011 20 1003 1013 10.3727/096368910X539128 21054950 88. Nakajima K. Kunimatsu R. Ando K. Ando T. Hayashi Y. Kihara T. Hiraki T. Tsuka Y. Abe T. Kaku M. Comparison of the bone regeneration ability between stem cells from human exfoliated deciduous teeth, human dental pulp stem cells and human bone marrow mesenchymal stem cells Biochem. Biophys. Res. Commun. 2018 497 876 882 10.1016/j.bbrc.2018.02.156 29477844 89. Putranti N.A.R. Kunimatsu R. Rikitake K. Hiraki T. Nakajima K. Abe T. Tsuka Y. Sakata S. Nakatani A. Nikawa H. Combination of Carbonate Hydroxyapatite and Stem Cells from Human Deciduous Teeth Promotes Bone Regeneration by Enhancing BMP-2, VEGF and CD31 Expression in Immunodeficient Mice Cells 2022 11 1914 10.3390/cells11121914 35741043 PMC9221865 90. Prahasanti C. Subrata L.H. Saskianti T. Suardita K. Ernawati D.S. Combined Hydroxyapatite Scaffold and Stem Cell from Human Exfoliated Deciduous Teeth Modulating Alveolar Bone Regeneration via Regulating Receptor Activator of Nuclear Factor-Kb and Osteoprotegerin System Iran. J. Med. Sci. 2019 44 415 421 10.30476/IJMS.2019.44962 31582866 PMC6754532 91. Dai P. Qi G. Zhu M. Du Q. Wang K. Gao Y. Li M. Feng X. Zhang X. Periodontal ligament stem cell tissue engineering scaffolds can guide and promote canine periodontal tissue regeneration Front. Vet. Sci. 2024 11 1465879 10.3389/fvets.2024.1465879 39444741 PMC11496256 92. Ji S. Guvendiren M. 3D Printed Wavy Scaffolds Enhance Mesenchymal Stem Cell Osteogenesis Micromachines 2019 11 31 10.3390/mi11010031 31881771 PMC7019315 93. Omerkić S. Omerkić Dautović D. Opportunities and challenges of dental stem cells in transforming healthcare through regenerative medicine Discov. Med. 2025 2 126 10.1007/s44337-025-00339-0 94. Tomar G.B. Srivastava R.K. Gupta N. Barhanpurkar A.P. Pote S.T. Jhaveri H.M. Mishra G.C. Wani M.R. Human gingiva-derived mesenchymal stem cells are superior to bone marrow-derived mesenchymal stem cells for cell therapy in regenerative medicine Biochem. Biophys. Res. Commun. 2010 393 377 383 10.1016/j.bbrc.2010.01.126 20138833 95. Moshaverinia A. Chen C. Akiyama K. Xu X. Chee W.W.L. Schricker S.R. Shi S. Encapsulated dental-derived mesenchymal stem cells in an injectable and biodegradable scaffold for applications in bone tissue engineering J. Biomed. Mater. Res. Part A 2013 101 3285 3294 10.1002/jbm.a.34546 23983201 96. Kanczler J. Oreffo R. Osteogenesis and angiogenesis: The potential for engineering bone Eur. Cells Mater. 2008 15 100 114 10.22203/eCM.v015a08 18454418 97. Hu K. Olsen B.R. The roles of vascular endothelial growth factor in bone repair and regeneration Bone 2016 91 30 38 10.1016/j.bone.2016.06.013 27353702 PMC4996701 98. Saran U. Gemini Piperni S. Chatterjee S. Role of angiogenesis in bone repair Arch. Biochem. Biophys. 2014 561 109 117 10.1016/j.abb.2014.07.006 25034215 99. Almubarak S. Nethercott H. Freeberg M. Beaudon C. Jha A. Jackson W. Marcucio R. Miclau T. Healy K. Bahney C. Tissue engineering strategies for promoting vascularized bone regeneration Bone 2016 83 197 209 10.1016/j.bone.2015.11.011 26608518 PMC4911893 100. Huang J. Han Q. Cai M. Zhu J. Li L. Yu L. Wang Z. Fan G. Zhu Y. Lu J. Effect of Angiogenesis in Bone Tissue Engineering Ann. Biomed. Eng. 2022 50 898 913 10.1007/s10439-022-02970-9 35525871 101. Altyar A.E. El-Sayed A. Abdeen A. Piscopo M. Mousa S.A. Najda A. Abdel-Daim M.M. Future regenerative medicine developments and their therapeutic applications Biomed. Pharmacother. 2023 158 114131 10.1016/j.biopha.2022.114131 36538861 102. Stegen S. Van Gastel N. Carmeliet G. Bringing new life to damaged bone: The importance of angiogenesis in bone repair and regeneration Bone 2015 70 19 27 10.1016/j.bone.2014.09.017 25263520 103. Portal-Núñez S. Role of angiogenesis on bone formation Histol. Histopathol. 2012 27 559 566 10.14670/HH-27.559 22419020 104. Li A. Sasaki J.I. Abe G.L. Katata C. Sakai H. Imazato S. Vascularization of a Bone Organoid Using Dental Pulp Stem Cells Stem Cells Int. 2023 2023 5367887 10.1155/2023/5367887 37200632 PMC10188257 105. Burkus J.K. Transfeldt E.E. Kitchel S.H. Watkins R.G. Balderston R.A. Clinical and Radiographic Outcomes of Anterior Lumbar Interbody Fusion Using Recombinant Human Bone Morphogenetic Protein-2 Spine 2002 27 2396 2408 10.1097/00007632-200211010-00015 12438990 106. Cook S.D. Baffes G.C. Wolfe M.W. Sampath T.K. Rueger D.C. Whitecloud T.S. The effect of recombinant human osteogenic protein-1 on healing of large segmental bone defects J. Bone Jt. Surg. 1994 76 827 838 10.2106/00004623-199406000-00006 8200889 107. Sampath T.K. Maliakal J.C. Hauschka P.V. Jones W.K. Sasak H. Tucker R.F. White K.H. Coughlin J.E. Tucker M.M. Pang R.H. Recombinant human osteogenic protein-1 (hOP-1) induces new bone formation in vivo with a specific activity comparable with natural bovine osteogenic protein and stimulates osteoblast proliferation and differentiation in vitro J. Biol. Chem. 1992 267 20352 20362 10.1016/S0021-9258(19)88709-4 1328198 108. Carano R.A. Filvaroff E.H. Angiogenesis and bone repair Drug Discov. Today 2003 8 980 989 10.1016/S1359-6446(03)02866-6 14643161 109. Liu J. Yang L. Liu K. Gao F. Hydrogel scaffolds in bone regeneration: Their promising roles in angiogenesis Front. Pharmacol. 2023 14 1050954 10.3389/fphar.2023.1050954 36860296 PMC9968752 110. Hankenson K.D. Dishowitz M. Gray C. Schenker M. Angiogenesis in bone regeneration Injury 2011 42 556 561 10.1016/j.injury.2011.03.035 21489534 PMC3105195 111. Wang J. Wang H. Wang Y. Liu Z. Li Z. Li J. Chen Q. Meng Q. Shu W.W. Wu J. Endothelialized microvessels fabricated by microfluidics facilitate osteogenic differentiation and promote bone repair Acta Biomater. 2022 142 85 98 10.1016/j.actbio.2022.01.055 35114373 112. Dzobo K. Thomford N.E. Senthebane D.A. Shipanga H. Rowe A. Dandara C. Pillay M. Motaung K.S.C.M. Advances in Regenerative Medicine and Tissue Engineering: Innovation and Transformation of Medicine Stem Cells Int. 2018 2018 2495848 10.1155/2018/2495848 30154861 PMC6091336 113. Montesano R. Vassalli J.D. Baird A. Guillemin R. Orci L. Basic fibroblast growth factor induces angiogenesis in vitro Proc. Natl. Acad. Sci. USA 1986 83 7297 7301 10.1073/pnas.83.19.7297 2429303 PMC386703 114. Globus R.K. Patterson-Buckendahl P. Gospodarowicz D. Regulation of Bovine Bone Cell Proliferation by Fibroblast Growth Factor and Transforming Growth Factor β Endocrinology 1988 123 98 105 10.1210/endo-123-1-98 2838270 115. Kato T. Kawaguchi H. Hanada K. Aoyama I. Hiyama Y. Nakamura T. Kuzutani K. Tamura M. Kurokawa T. Nakamura K. Single local injection of recombinant fibroblast growth factor-2 stimulates healing of segmental bone defects in rabbits J. Orthop. Res. 1998 16 654 659 10.1002/jor.1100160605 9877388 116. Hollinger J.O. Onikepe A.O. MacKrell J. Einhorn T. Bradica G. Lynch S. Hart C.E. Accelerated fracture healing in the geriatric, osteoporotic rat with recombinant human platelet-derived growth factor-bb and an injectable beta-tricalcium phosphate/collagen matrix J. Orthop. Res. 2008 26 83 90 10.1002/jor.20453 17676626 117. Kaigler D. Avila G. Wisner-Lynch L. Nevins M.L. Nevins M. Rasperini G. Lynch S.E. Giannobile W.V. Platelet-derived growth factor applications in periodontal and peri-implant bone regeneration Expert Opin. Biol. Ther. 2011 11 375 385 10.1517/14712598.2011.554814 21288185 PMC3056074 118. Deuel T.F. Senior R.M. Huang J.S. Griffin G.L. Chemotaxis of monocytes and neutrophils to platelet-derived growth factor J. Clin. Investig. 1982 69 1046 1049 10.1172/JCI110509 7076844 PMC370161 119. Guo P. Hu B. Gu W. Xu L. Wang D. Huang H.J.S. Cavenee W.K. Cheng S.Y. Platelet-Derived Growth Factor-B Enhances Glioma Angiogenesis by Stimulating Vascular Endothelial Growth Factor Expression in Tumor Endothelia and by Promoting Pericyte Recruitment Am. J. Pathol. 2003 162 1083 1093 10.1016/S0002-9440(10)63905-3 12651601 PMC1851242 120. Deckers M.M.L. Van Bezooijen R.L. Van Der Horst G. Hoogendam J. Van Der Bent C. Papapoulos S.E. Löwik C.W.G.M. Bone Morphogenetic Proteins Stimulate Angiogenesis through Osteoblast-Derived Vascular Endothelial Growth Factor A Endocrinology 2002 143 1545 1553 10.1210/endo.143.4.8719 11897714 121. Yeh L.C.C. Lee J.C. Osteogenic protein-1 increases gene expression of vascular endothelial growth factor in primary cultures of fetal rat calvaria cells Mol. Cell. Endocrinol. 1999 153 113 124 10.1016/S0303-7207(99)00076-3 10459859 122. Holmes D.I. Zachary I. The vascular endothelial growth factor (VEGF) family: Angiogenic factors in health and disease Genome Biol. 2005 6 209 10.1186/gb-2005-6-2-209 15693956 PMC551528 123. Maes C. Placental growth factor mediates mesenchymal cell development, cartilage turnover, and bone remodeling during fracture repair J. Clin. Investig. 2006 116 1230 1242 10.1172/JCI26772 16614757 PMC1435721 124. Goldberg M.A. Dunning S.P. Bunn H.F. Regulation of the Erythropoietin Gene: Evidence That the Oxygen Sensor Is a Heme Protein Science 1988 242 1412 1415 10.1126/science.2849206 2849206 125. Steinbrech D.S. Mehrara B.J. Saadeh P.B. Greenwald J.A. Spector J.A. Gittes G.K. Longaker M.T. VEGF expression in an osteoblast-like cell line is regulated by a hypoxia response mechanism Am. J. -Physiol.-Cell Physiol. 2000 278 C853 C860 10.1152/ajpcell.2000.278.4.C853 10751333 126. Sharma M.B. Limaye L.S. Kale V.P. Mimicking the functional hematopoietic stem cell niche in vitro: Recapitulation of marrow physiology by hydrogel-based three-dimensional cultures of mesenchymal stromal cells Haematologica 2012 97 651 660 10.3324/haematol.2011.050500 22058199 PMC3342965 127. Thurston G. Suri C. Smith K. McClain J. Sato T.N. Yancopoulos G.D. McDonald D.M. Leakage-Resistant Blood Vessels in Mice Transgenically Overexpressing Angiopoietin-1 Science 1999 286 2511 2514 10.1126/science.286.5449.2511 10617467 128. Liu J. Zou T. Yao Q. Zhang Y. Zhao Y. Zhang C. Hypoxia-mimicking cobalt-doped multi-walled carbon nanotube nanocomposites enhance the angiogenic capacity of stem cells from apical papilla Mater. Sci. Eng. C 2021 120 111797 10.1016/j.msec.2020.111797 33545919 129. Wu C. Zhou Y. Fan W. Han P. Chang J. Yuen J. Zhang M. Xiao Y. Hypoxia-mimicking mesoporous bioactive glass scaffolds with controllable cobalt ion release for bone tissue engineering Biomaterials 2012 33 2076 2085 10.1016/j.biomaterials.2011.11.042 22177618 130. Zhang X. Huang P. Jiang G. Zhang M. Yu F. Dong X. Wang L. Chen Y. Zhang W. Qi Y. A novel magnesium ion-incorporating dual-crosslinked hydrogel to improve bone scaffold-mediated osteogenesis and angiogenesis Mater. Sci. Eng. C 2021 121 111868 10.1016/j.msec.2021.111868 33579495 131. Zhang Z. Jia B. Yang H. Han Y. Wu Q. Dai K. Zheng Y. Biodegradable ZnLiCa ternary alloys for critical-sized bone defect regeneration at load-bearing sites: In vitro and in vivo studies Bioact. Mater. 2021 6 3999 4013 10.1016/j.bioactmat.2021.03.045 33997489 PMC8085902 132. Zhang L. Jiao G. Ren S. Zhang X. Li C. Wu W. Wang H. Liu H. Zhou H. Chen Y. Exosomes from bone marrow mesenchymal stem cells enhance fracture healing through the promotion of osteogenesis and angiogenesis in a rat model of nonunion Stem Cell Res. Ther. 2020 11 38 10.1186/s13287-020-1562-9 31992369 PMC6986095 133. Yang H. Shin S. Ahn J. Choi Y. Kim K.H. Chung C.J. Local Injection of Pulp Cells Enhances Wound Healing during the Initial Proliferative Phase through the Stimulation of Host Angiogenesis J. Endod. 2013 39 788 794 10.1016/j.joen.2013.01.011 23683280 134. Huang G.T.J. Yamaza T. Shea L.D. Djouad F. Kuhn N.Z. Tuan R.S. Shi S. Stem/Progenitor Cell–Mediated De Novo Tissue Eng. Part A 2010 16 605 615 10.1089/ten.tea.2009.0518 19737072 PMC2813150 135. Bento L. Zhang Z. Imai A. Nör F. Dong Z. Shi S. Araujo F. Nör J. Endothelial Differentiation of SHED Requires MEK1/ERK Signaling J. Dent. Res. 2013 92 51 57 10.1177/0022034512466263 23114032 PMC3521451 136. Moshaverinia A. Chen C. Xu X. Akiyama K. Ansari S. Zadeh H.H. Shi S. Bone Regeneration Potential of Stem Cells Derived from Periodontal Ligament or Gingival Tissue Sources Encapsulated in RGD-Modified Alginate Scaffold Tissue Eng. Part A 2013 20 611 621 10.1089/ten.tea.2013.0229 24070211 PMC3926152 137. Kempen D.H. Lu L. Heijink A. Hefferan T.E. Creemers L.B. Maran A. Yaszemski M.J. Dhert W.J. Effect of local sequential VEGF and BMP-2 delivery on ectopic and orthotopic bone regeneration Biomaterials 2009 30 2816 2825 10.1016/j.biomaterials.2009.01.031 19232714 138. Yao Z. Lafage-Proust M.H. Plouët J. Bloomfield S. Alexandre C. Vico L. Increase of Both Angiogenesis and Bone Mass in Response to Exercise Depends on VEGF J. Bone Miner. Res. 2004 19 1471 1480 10.1359/JBMR.040517 15312247 139. Huang Y.C. Kaigler D. Rice K.G. Krebsbach P.H. Mooney D.J. Combined Angiogenic and Osteogenic Factor Delivery Enhances Bone Marrow Stromal Cell-Driven Bone Regeneration J. Bone Miner. Res. 2005 20 848 857 10.1359/JBMR.041226 15824858 140. Herford A.S. Stoffella E. Tandon R. Reconstruction of Mandibular Defects Using Bone Morphogenic Protein: Can Growth Factors Replace the Need for Autologous Bone Grafts? A Systematic Review of the Literature Plast. Surg. Int. 2011 2011 1 7 10.1155/2011/165824 PMC3335506 22567236 141. Herford A.S. Lu M. Buxton A.N. Kim J. Henkin J. Boyne P.J. Caruso J.M. Rungcharassaeng K. Hong J. Recombinant Human Bone Morphogenetic Protein 2 Combined With an Osteoconductive Bulking Agent for Mandibular Continuity Defects in Nonhuman Primates J. Oral Maxillofac. Surg. 2012 70 703 716 10.1016/j.joms.2011.02.088 21549480 142. Jahanbin A. Rashed R. Alamdari D.H. Koohestanian N. Ezzati A. Kazemian M. Saghafi S. Raisolsadat M.A. Success of Maxillary Alveolar Defect Repair in Rats Using Osteoblast-Differentiated Human Deciduous Dental Pulp Stem Cells J. Oral Maxillofac. Surg. 2016 74 829.e1–829.e9 10.1016/j.joms.2015.11.033 26763080 143. Wang F. Yu M. Yan X. Wen Y. Zeng Q. Yue W. Yang P. Pei X. Gingiva-Derived Mesenchymal Stem Cell-Mediated Therapeutic Approach for Bone Tissue Regeneration Stem Cells Dev. 2011 20 2093 2102 10.1089/scd.2010.0523 21361847 144. Probst F.A. Fliefel R. Burian E. Probst M. Eddicks M. Cornelsen M. Riedl C. Seitz H. Aszódi A. Schieker M. Bone regeneration of minipig mandibular defect by adipose derived mesenchymal stem cells seeded tri-calcium phosphate- poly(D,L-lactide-co-glycolide) scaffolds Sci. Rep. 2020 10 2062 10.1038/s41598-020-59038-8 32029875 PMC7005305 145. Seo B. Sonoyama W. Yamaza T. Coppe C. Kikuiri T. Akiyama K. Lee J. Shi S. SHED repair critical-size calvarial defects in mice Oral Dis. 2008 14 428 434 10.1111/j.1601-0825.2007.01396.x 18938268 PMC2653202 146. Rezai-Rad M. Bova J.F. Orooji M. Pepping J. Qureshi A. Del Piero F. Hayes D. Yao S. Evaluation of bone regeneration potential of dental follicle stem cells for treatment of craniofacial defects Cytotherapy 2015 17 1572 1581 10.1016/j.jcyt.2015.07.013 26342992 PMC4592822 147. Johnson Z.M. Yuan Y. Li X. Jashashvili T. Jamieson M. Urata M. Chen Y. Chai Y. Mesenchymal Stem Cells and Three-Dimensional-Osteoconductive Scaffold Regenerate Calvarial Bone in Critical Size Defects in Swine Stem Cells Transl. Med. 2021 10 1170 1183 10.1002/sctm.20-0534 33794062 PMC8284781 148. Khosronejad A. Arabion H. Iraji A. Mokhtarzadegan M. Daneshi S.S. Asadi-Yousefabad S.L. Zare S. Nowzari F. Abbaspour S. Akbarizadeh F. Mandibular bone defect healing using polylactic acid–nano-hydroxyapatite–gelatin scaffold loaded with hesperidin and dental pulp stem cells in rat Tissue Cell 2025 93 102700 10.1016/j.tice.2024.102700 39724839 149. Petridis X. Diamanti E. Trigas G.C. Kalyvas D. Kitraki E. Bone regeneration in critical-size calvarial defects using human dental pulp cells in an extracellular matrix-based scaffold J. Cranio-Maxillofac. Surg. 2015 43 483 490 10.1016/j.jcms.2015.02.003 25753474 150. Dehghanian F. Soltani Z. Farsinejad A. Khaksari M. Jafari E. Darakhshani A. Sabet N. Bashiri H. The Effect of Oral Mucosal Mesenchymal Stem Cells on Pathological and Long-Term Outcomes in Experimental Traumatic Brain Injury BioMed Res. Int. 2022 2022 4065118 10.1155/2022/4065118 35528162 PMC9071883 151. Alge D.L. Zhou D. Adams L.L. Wyss B.K. Shadday M.D. Woods E.J. Gabriel Chu T.M. Goebel W.S. Donor-matched comparison of dental pulp stem cells and bone marrow-derived mesenchymal stem cells in a rat model J. Tissue Eng. Regen. Med. 2010 4 73 81 10.1002/term.220 19842108 PMC2830796 152. Xiao C. Lu D. Chen J. Chen X. Lin H. Huang M. Cheng S. Wang Y. Liu Q. Zheng H. Human Olfactory Mesenchymal Stem Cells Are a Novel Candidate for Neurological Autoimmune Disease Front. Pharmacol. 2021 12 770884 10.3389/fphar.2021.770884 34955841 PMC8702423 153. Moshaverinia A. Xu X. Chen C. Akiyama K. Snead M.L. Shi S. Dental mesenchymal stem cells encapsulated in an alginate hydrogel co-delivery microencapsulation system for cartilage regeneration Acta Biomater. 2013 9 9343 9350 10.1016/j.actbio.2013.07.023 23891740 PMC3818395 154. Mata M. Milian L. Oliver M. Zurriaga J. Sancho-Tello M. de Llano J.J.M. Carda C. In Vivo Articular Cartilage Regeneration Using Human Dental Pulp Stem Cells Cultured in an Alginate Scaffold: A Preliminary Study Stem Cells Int. 2017 2017 8309256 10.1155/2017/8309256 28951745 PMC5603743 155. Zhu F. Meng Q. Yu Y. Shao L. Shen Z. Adult Cardiomyocyte Proliferation: A New Insight for Myocardial Infarction Therapy J. Cardiovasc. Transl. Res. 2021 14 457 466 10.1007/s12265-020-10067-8 32820393 156. Cochain C. Channon K.M. Silvestre J.S. Angiogenesis in the Infarcted Myocardium Antioxid. Redox Signal. 2013 18 1100 1113 10.1089/ars.2012.4849 22870932 PMC3567783 157. Serbo J.V. Gerecht S. Vascular tissue engineering: Biodegradable scaffold platforms to promote angiogenesis Stem Cell Res. Ther. 2013 4 8 10.1186/scrt156 23347554 PMC3706776 158. Gandia C. Armiñan A. García-Verdugo J.M. Lledó E. Ruiz A. Miñana M.D. Sanchez-Torrijos J. Payá R. Mirabet V. Carbonell-Uberos F. Human Dental Pulp Stem Cells Improve Left Ventricular Function, Induce Angiogenesis, and Reduce Infarct Size in Rats with Acute Myocardial Infarction Stem Cells 2008 26 638 645 10.1634/stemcells.2007-0484 18079433 159. Kim S.G. Zhou J. Solomon C. Zheng Y. Suzuki T. Chen M. Song S. Jiang N. Cho S. Mao J.J. Effects of Growth Factors on Dental Stem/Progenitor Cells Dent. Clin. N. Am. 2012 56 563 575 10.1016/j.cden.2012.05.001 22835538 PMC4112411 160. Lee H. Cho H.J. Han Y. Lee S.H. Mid- to long-term efficacy and safety of stem cell therapy for acute myocardial infarction: A systematic review and meta-analysis Stem Cell Res. Ther. 2024 15 290 10.1186/s13287-024-03891-1 39256845 PMC11389242 161. Colombo A. Castellani M. Piccaluga E. Pusineri E. Palatresi S. Longari V. Canzi C. Sacchi E. Rossi E. Rech R. Myocardial blood flow and infarct size after CD133+ cell injection in large myocardial infarction with good recanalization and poor reperfusion: Results from a randomized controlled trial J. Cardiovasc. Med. 2011 12 239 248 10.2459/JCM.0b013e328343d708 21372740 162. Mansour S. Roy D.C. Bouchard V. Stevens L.M. Gobeil F. Rivard A. Leclerc G. Reeves F. Noiseux N. One-Year Safety Analysis of the COMPARE-AMI Trial: Comparison of Intracoronary Injection of CD133 + Bone Marrow Res. 2011 2011 1 6 10.1155/2011/385124 22046562 PMC3200002 163. Linard C. Brachet M. L’homme B. Strup-Perrot C. Busson E. Bonneau M. Lataillade J.J. Bey E. Benderitter M. Long-term effectiveness of local BM-MSCs for skeletal muscle regeneration: A proof of concept obtained on a pig model of severe radiation burn Stem Cell Res. Ther. 2018 9 299 10.1186/s13287-018-1051-6 30409227 PMC6225585 164. Owston H. Giannoudis P.V. Jones E. Do skeletal muscle MSCs in humans contribute to bone repair? A systematic review Injury 2016 47 S3 S15 10.1016/S0020-1383(16)30834-8 28040084 165. Sandonà M. Di Pietro L. Esposito F. Ventura A. Silini A.R. Parolini O. Saccone V. Mesenchymal Stromal Cells and Their Secretome: New Therapeutic Perspectives for Skeletal Muscle Regeneration Front. Bioeng. Biotechnol. 2021 9 652970 10.3389/fbioe.2021.652970 34095095 PMC8172230 166. Nakamura Y. Miyaki S. Ishitobi H. Matsuyama S. Nakasa T. Kamei N. Akimoto T. Higashi Y. Ochi M. Mesenchymal-stem-cell-derived exosomes accelerate skeletal muscle regeneration FEBS Lett. 2015 589 1257 1265 10.1016/j.febslet.2015.03.031 25862500 167. Zhang M.H. Yu L.M. Zhang W.H. Deng J.J. Sun B.J. Chen M.H. Huang W. Li J. He H. Han X.X. Noggin Combined With Human Dental Pulp Stem Cells to Promote Skeletal Muscle Regeneration Stem Cells Int. 2024 2024 2812390 10.1155/sci/2812390 39758702 PMC11699990 168. Martínez-Sarrà E. Montori S. Gil-Recio C. Núñez-Toldrà R. Costamagna D. Rotini A. Atari M. Luttun A. Sampaolesi M. Human dental pulp pluripotent-like stem cells promote wound healing and muscle regeneration Stem Cell Res. Ther. 2017 8 175 10.1186/s13287-017-0621-3 28750661 PMC5531092 169. Nosrat I.V. Widenfalk J. Olson L. Nosrat C.A. Dental Pulp Cells Produce Neurotrophic Factors, Interact with Trigeminal Neurons in Vitro, and Rescue Motoneurons after Spinal Cord Injury Dev. Biol. 2001 238 120 132 10.1006/dbio.2001.0400 11783998 170. Gonmanee T. Thonabulsombat C. Vongsavan K. Sritanaudomchai H. Differentiation of stem cells from human deciduous and permanent teeth into spiral ganglion neuron-like cells Arch. Oral Biol. 2018 88 34 41 10.1016/j.archoralbio.2018.01.011 29407749 171. Gervois P. Struys T. Hilkens P. Bronckaers A. Ratajczak J. Politis C. Brône B. Lambrichts I. Martens W. Neurogenic Maturation of Human Dental Pulp Stem Cells Following Neurosphere Generation Induces Morphological and Electrophysiological Characteristics of Functional Neurons Stem Cells Dev. 2015 24 296 311 10.1089/scd.2014.0117 25203005 PMC4303022 172. Pisciotta A. Bertoni L. Riccio M. Mapelli J. Bigiani A. La Noce M. Orciani M. De Pol A. Carnevale G. Use of a 3D Floating Sphere Culture System to Maintain the Neural Crest-Related Properties of Human Dental Pulp Stem Cells Front. Physiol. 2018 9 547 10.3389/fphys.2018.00547 29892229 PMC5985438 173. Ansari S. Diniz I.M. Chen C. Sarrion P. Tamayol A. Wu B.M. Moshaverinia A. Human Periodontal Ligament- and Gingiva-derived Mesenchymal Stem Cells Promote Nerve Regeneration When Encapsulated in Alginate/Hyaluronic Acid 3D Scaffold Adv. Healthc. Mater. 2017 6 10.1002/adhm.201700670 PMC5813692 29076281 174. Abe S. Hamada K. Miura M. Yamaguchi S. Neural crest stem cell property of apical pulp cells derived from human developing tooth Cell Biol. Int. 2012 36 927 936 10.1042/CBI20110506 22731688 175. Inoue T. Sugiyama M. Hattori H. Wakita H. Wakabayashi T. Ueda M. Stem cells from human exfoliated deciduous tooth-derived conditioned medium enhance recovery of focal cerebral ischemia in rats Tissue Eng. Part A 2013 19 24 29 10.1089/ten.tea.2011.0385 22839964 PMC3530935 176. Wang J. Wang X. Sun Z. Wang X. Yang H. Shi S. Wang S. Stem Cells from Human-Exfoliated Deciduous Teeth Can Differentiate into Dopaminergic Neuron-Like Cells Stem Cells Dev. 2010 19 1375 1383 10.1089/scd.2009.0258 20131979 PMC3073455 177. Cho Y.D. Kim K.H. Lee Y.M. Ku Y. Seol Y.J. Dental-derived cells for regenerative medicine: Stem cells, cell reprogramming, and transdifferentiation J. Periodontal Implant. Sci. 2022 52 437 10.5051/jpis.2103760188 36468465 PMC9807848 178. Shang L. Shao J. Ge S. Immunomodulatory functions of oral mesenchymal stem cells: Novel force for tissue regeneration and disease therapy J. Leukoc. Biol. 2021 110 539 552 10.1002/JLB.3MR0321-766R 34184321 179. Hong R. Wang Z. Sui A. Liu X. Fan C. Lipkind S. Xu Q. Gingival mesenchymal stem cells attenuate pro-inflammatory macrophages stimulated with oxidized low-density lipoprotein and modulate lipid metabolism Arch. Oral Biol. 2019 98 92 98 10.1016/j.archoralbio.2018.11.007 30468993 180. Tang L. Li N. Xie H. Jin Y. Characterization of mesenchymal stem cells from human normal and hyperplastic gingiva J. Cell. Physiol. 2011 226 832 842 10.1002/jcp.22405 20857425 181. Zhang Q. Nguyen A.L. Shi S. Hill C. Wilder-Smith P. Krasieva T.B. Le A.D. Three-Dimensional Spheroid Culture of Human Gingiva-Derived Mesenchymal Stem Cells Enhances Mitigation of Chemotherapy-Induced Oral Mucositis Stem Cells Dev. 2012 21 937 947 10.1089/scd.2011.0252 21689066 PMC3315752 182. Israel E. Reddel H.K. Severe and Difficult-to-Treat Asthma in Adults N. Engl. J. Med. 2017 377 965 976 10.1056/NEJMra1608969 28877019 183. Wakayama H. Hashimoto N. Matsushita Y. Matsubara K. Yamamoto N. Hasegawa Y. Ueda M. Yamamoto A. Factors secreted from dental pulp stem cells show multifaceted benefits for treating acute lung injury in mice Cytotherapy 2015 17 1119 1129 10.1016/j.jcyt.2015.04.009 26031744 184. Komlósi Z.I. van de Veen W. Kovács N. Szűcs G. Sokolowska M. O’Mahony L. Akdis M. Akdis C.A. Cellular and molecular mechanisms of allergic asthma Mol. Asp. Med. 2022 85 100995 10.1016/j.mam.2021.100995 34364680 185. Genç D. Zibandeh N. Nain E. Gökalp M. Özen A.O. Göker M.K. Akkoç T. Dental follicle mesenchymal stem cells down-regulate Th2-mediated immune response in asthmatic patients mononuclear cells Clin. Exp. Allergy 2018 48 663 678 10.1111/cea.13126 29498435 186. Genç D. Zibandeh N. Nain E. Arığ U. Göker K. Aydıner E.K. Akkoç T. IFN- γ Allergol. Immunopathol. 2019 47 467 476 10.1016/j.aller.2018.12.005 30826066 187. Ehrenstein M.R. Evans J.G. Singh A. Moore S. Warnes G. Isenberg D.A. Mauri C. Compromised Function of Regulatory T Cells in Rheumatoid Arthritis and Reversal by Anti-TNF α J. Exp. Med. 2004 200 277 285 10.1084/jem.20040165 15280421 PMC2211983 188. Zibandeh N. IFN- γ Turk. J. Med. Sci. 2019 49 1779 1788 10.3906/sag-1812-152 31655532 PMC7520073 189. Chandrashekara S. The treatment strategies of autoimmune disease may need a different approach from conventional protocol: A review Indian J. Pharmacol. 2012 44 665 10.4103/0253-7613.103235 23248391 PMC3523489 190. Wnorowski A. Yang H. Wu J.C. Progress, obstacles, and limitations in the use of stem cells in organ-on-a-chip models Adv. Drug Deliv. Rev. 2019 140 3 11 10.1016/j.addr.2018.06.001 29885330 PMC6281815 191. Igarashi A. Segoshi K. Sakai Y. Pan H. Kanawa M. Higashi Y. Sugiyama M. Nakamura K. Kurihara H. Yamaguchi S. Selection of Common Markers for Bone Marrow Stromal Cells from Various Bones Using Real-Time RT-PCR: Effects of Passage Number and Donor Age Tissue Eng. 2007 13 2405 2417 10.1089/ten.2006.0340 17596118 192. Borstlap W.A. Heidbuchel K.L. Freihofer H.P.M. Kuijpers-Jagtman A.M. Early secondary bone grafting of alveolar cleft defects J. Cranio-Maxillofac. Surg. 1990 18 201 205 10.1016/S1010-5182(05)80411-1 2387908 193. Koole R. Bosker H. Van Der Dussen F.N. Late secondary autogenous bone grafting in cleft patients comparing mandibular (ectomesenchymal) and iliac crest (mesenchymal) grafts J. Cranio-Maxillofac. Surg. 1989 17 28 30 10.1016/S1010-5182(89)80036-8 2606985 194. Chai Y. Jiang X. Ito Y. Bringas P. Han J. Rowitch D.H. Soriano P. McMahon A.P. Sucov H.M. Fate of the mammalian cranial neural crest during tooth and mandibular morphogenesis Development 2000 127 1671 1679 10.1242/dev.127.8.1671 10725243 195. Mackie E. Ahmed Y. Tatarczuch L. Chen K.S. Mirams M. Endochondral ossification: How cartilage is converted into bone in the developing skeleton Int. J. Biochem. Cell Biol. 2008 40 46 62 10.1016/j.biocel.2007.06.009 17659995 196. Fawzy El-Sayed K.M. Dörfer C.E. Gingival Mesenchymal Stem/Progenitor Cells: A Unique Tissue Engineering Gem Stem Cells Int. 2016 2016 7154327 10.1155/2016/7154327 27313628 PMC4903147 197. Kim M.K. Paek K. Woo S.M. Kim J.A. Bone-on-a-Chip: Biomimetic Models Based on Microfluidic Technologies for Biomedical Applications Biomater. Sci. Eng. 2023 9 3058 3073 10.1021/acsbiomaterials.3c00066 37183366 198. Gao J. Li L. Enhancement of neural regeneration as a therapeutic strategy for Alzheimer’s disease (Review) Exp. Ther. Med. 2023 26 444 10.3892/etm.2023.12143 37614437 PMC10443056 199. Ryu N.E. Lee S.H. Park H. Spheroid Culture System Methods and Applications for Mesenchymal Stem Cells Cells 2019 8 1620 10.3390/cells8121620 31842346 PMC6953111 200. Hsu S.h. Huang G.S. Feng F. Isolation of the multipotent MSC subpopulation from human gingival fibroblasts by culturing on chitosan membranes Biomaterials 2012 33 2642 2655 10.1016/j.biomaterials.2011.12.032 22217805 201. Hsu S.h. Huang G.S. Lin S.Y.F. Feng F. Ho T.T. Liao Y.C. Enhanced Chondrogenic Differentiation Potential of Human Gingival Fibroblasts by Spheroid Formation on Chitosan Membranes Tissue Eng. Part A 2012 18 67 79 10.1089/ten.tea.2011.0157 21770867 202. Khojasteh A. Hosseinpour S. Rad M.R. Alikhasi M. Buccal Fat Pad–Derived Stem Cells in Three-Dimensional Rehabilitation of Large Alveolar Defects: A Report of Two Cases J. Oral Implantol. 2019 45 45 54 10.1563/aaid-joi-D-17-00215 30280966 203. Camacho-Alonso F. Tudela-Mulero M.R. Navarro J.A. Buendía A.J. Mercado-Díaz A.M. Use of buccal fat pad-derived stem cells cultured on bioceramics for repair of critical-sized mandibular defects in healthy and osteoporotic rats Clin. Oral Investig. 2022 26 5389 5408 10.1007/s00784-022-04506-w PMC9381637 35524820 204. University of Turin, Italy Periodontal Regeneration Using Dental Pulp Stem Cells (DPSCs). ClinicalTrials.gov 2017 Available online: https://clinicaltrials.gov/study/NCT03386877 (accessed on 22 August 2025) 205. JCR Pharmaceuticals Co., Ltd., Japan A Randomized Placebo-controlled Multicenter Trial to Evaluate the Efficacy and Safety of JTR-161, Allogeneic Human Dental Pulp Stem Cell, in Patients With Acute Ischemic stRoke (J-REPAIR) (J-REPAIR). ClinicalTrials.gov 2022 Available online: https://clinicaltrials.gov/study/NCT04608838 (accessed on 30 June 2025) 10.1136/bmjopen-2021-054269 PMC9125710 35613802 206. Central Hospital, Nancy, France Dental Stem Cells and Bone Tissue Engineering (CELSORDINO) (CELSORDINO). ClinicalTrials.gov 2017 Available online: https://clinicaltrials.gov/study/NCT03194451 (accessed on 22 August 2025) 207. Translational Research Center for Medical Innovation, Kobe, Hyogo, Japan Clinical Trials of Regeneration for Periodontal Tissue. ClinicalTrials.gov 2009 Available online: https://clinicaltrials.gov/study/NCT00221130 (accessed on 22 August 2025) 208. Air Force Military Medical University, China Periodontal Tissue Regeneration Using Autologous Periodontal Ligament Stem Cells (PDLSC). ClinicalTrials.gov 2011 Available online: https://clinicaltrials.gov/study/NCT01357785 (accessed on 22 August 2025) 209. Air Force Military Medical University, China Periodontal Ligament Stem Cell Implantation in the Treatment of Periodontitis. ClinicalTrials.gov 2010 Available online: https://clinicaltrials.gov/study/NCT01082822 (accessed on 22 August 2025) 210. Baskent University Effect of Dental Pulp Stem Cells and L-PRF After Impacted Third Molar Extraction. ClinicalTrials.gov 2020 Available online: https://clinicaltrials.gov/study/NCT04641533 (accessed on 22 August 2025) 211. CAR-T (Shanghai) Biotechnology Co., Ltd. Stem Cells From Human Exfoliated Teeth in Treatment of Type 2 Diabetes. ClinicalTrials.gov 2020 Available online: https://clinicaltrials.gov/study/NCT03658655 (accessed on 22 August 2025) 212. Matsumoto R. Yamamoto T. Takahashi Y. Complex Organ Construction from Human Pluripotent Stem Cells for Biological Research and Disease Modeling with New Emerging Techniques Int. J. Mol. Sci. 2021 22 10184 10.3390/ijms221910184 34638524 PMC8508560 213. Mansoorifar A. Gordon R. Bergan R.C. Bertassoni L.E. Bone-on-a-Chip: Microfluidic Technologies and Microphysiologic Models of Bone Tissue Adv. Funct. Mater. 2021 31 2006796 10.1002/adfm.202006796 35422682 PMC9007546 214. Baba S. Yamada Y. Komuro A. Yotsui Y. Umeda M. Shimuzutani K. Nakamura S. Phase I/II Trial of Autologous Bone Marrow Stem Cell Transplantation with a Three-Dimensional Woven-Fabric Scaffold for Periodontitis Stem Cells Int. 2016 2016 6205910 10.1155/2016/6205910 27990164 PMC5136404 215. Sieber S. Wirth L. Cavak N. Koenigsmark M. Marx U. Lauster R. Rosowski M. Bone marrow-on-a-chip: Long-term culture of human haematopoietic stem cells in a three-dimensional microfluidic environment J. Tissue Eng. Regen. Med. 2018 12 479 489 10.1002/term.2507 28658717 216. Fageeh H.N. Preliminary Evaluation of Proliferation, Wound Healing Properties, Osteogenic and Chondrogenic Potential of Dental Pulp Stem Cells Obtained from Healthy and Periodontitis Affected Teeth Cells 2021 10 2118 10.3390/cells10082118 34440887 PMC8393753 217. Qu C. Brohlin M. Kingham P.J. Kelk P. Evaluation of growth, stemness, and angiogenic properties of dental pulp stem cells cultured in cGMP xeno-/serum-free medium Cell Tissue Res. 2020 380 93 105 10.1007/s00441-019-03160-1 31889209 218. Zhang S. Liu Y. Dong J. Jiao M. Gu Y. Chen L. Yuan N. Wang J. Yang D. Meng F. Proteome differences of dental stem cells between permanent and deciduous teeth by data-independent acquisition proteomics Open Life Sci. 2025 20 20220998 10.1515/biol-2022-0998 39886483 PMC11780257 219. Nesic D. Schaefer B.M. Sun Y. Saulacic N. Sailer I. 3D Printing Approach in Dentistry: The Future for Personalized Oral Soft Tissue Regeneration J. Clin. Med. 2020 9 2238 10.3390/jcm9072238 32679657 PMC7408636 220. Abedin Zadeh M. Khoder M. Al-Kinani A.A. Younes H.M. Alany R.G. Retinal cell regeneration using tissue engineered polymeric scaffolds Drug Discov. Today 2019 24 1669 1678 10.1016/j.drudis.2019.04.009 31051266 221. Shindo S. Savitri I.J. Ishii T. Ikeda A. Pierrelus R. Heidari A. Okubo K. Nakamura S. Kandalam U. Rawas-Qalaji M. Dual-Function Semaphorin 4D Released by Platelets: Suppression of Osteoblastogenesis and Promotion of Osteoclastogenesis Int. J. Mol. Sci. 2022 23 2938 10.3390/ijms23062938 35328359 PMC8955605 222. Zhang W. Wang X. Wang S. Zhao J. Xu L. Zhu C. Zeng D. Chen J. Zhang Z. Kaplan D.L. The use of injectable sonication-induced silk hydrogel for VEGF165 and BMP-2 delivery for elevation of the maxillary sinus floor Biomaterials 2011 32 9415 9424 10.1016/j.biomaterials.2011.08.047 21889205 PMC3384686 223. Caballero-Aguilar L.M. Duchi S. Quigley A. Onofrillo C. Di Bella C. Moulton S.E. Microencapsulation of growth factors by microfluidic system MethodsX 2021 8 101324 10.1016/j.mex.2021.101324 34434839 PMC8374335 224. Qin Y. Sun R. Wu C. Wang L. Zhang C. Exosome: A Novel Approach to Stimulate Bone Regeneration through Regulation of Osteogenesis and Angiogenesis Int. J. Mol. Sci. 2016 17 712 10.3390/ijms17050712 27213355 PMC4881534 225. Alvites R.D. Branquinho M.V. Caseiro A.R. Amorim I. Santos Pedrosa S. Rêma A. Faria F. Porto B. Oliveira C. Teixeira P. Rat Olfactory Mucosa Mesenchymal Stem/Stromal Cells (OM-MSCs): A Characterization Study Int. J. Cell Biol. 2020 2020 2938258 10.1155/2020/2938258 32411249 PMC7212324 226. Santos Rosalem G. Gonzáles Torres L.A. De Las Casas E.B. Mathias F.A.S. Ruiz J.C. Carvalho M.G.R. Microfluidics and organ-on-a-chip technologies: A systematic review of the methods used to mimic bone marrow PLoS ONE 2020 15 e0243840 10.1371/journal.pone.0243840 33306749 PMC7732112 227. Lv Z. Cai X. Bian Y. Wei Z. Zhu W. Zhao X. Weng X. Advances in Mesenchymal Stem Cell Therapy for Osteoarthritis: From Preclinical and Clinical Perspectives Bioengineering 2023 10 195 10.3390/bioengineering10020195 36829689 PMC9952673 228. Schliephake H. Weich H.A. Dullin C. Gruber R. Frahse S. Mandibular bone repair by implantation of rhBMP-2 in a slow release carrier of polylactic acid—An experimental study in rats Biomaterials 2008 29 103 110 10.1016/j.biomaterials.2007.09.019 17936352 229. Fujita M. Kinoshita Y. Sato E. Maeda H. Ozono S. Negishi H. Kawase T. Hiraoka Y. Takamoto T. Tabata Y. Proliferation and Differentiation of Rat Bone Marrow Stromal Cells on Poly(glycolic acid)–Collagen Sponge Tissue Eng. 2005 11 1346 1355 10.1089/ten.2005.11.1346 16259590 230. Mastrogiacomo M. Scaglione S. Martinetti R. Dolcini L. Beltrame F. Cancedda R. Quarto R. Role of scaffold internal structure on in vivo bone formation in macroporous calcium phosphate bioceramics Biomaterials 2006 27 3230 3237 10.1016/j.biomaterials.2006.01.031 16488007 231. Komlev V. Peyrin F. Mastrogiacomo M. Cedola A. Papadimitropoulos A. Rustichelli F. Cancedda R. Kinetics of In Vivo Bone Deposition by Bone Marrow Stromal Cells into Porous Calcium Phosphate Scaffolds: An X-Ray Computed Microtomography Study Tissue Eng. 2006 12 3449 3458 10.1089/ten.2006.12.3449 17518681 232. Cao L. Su H. Si M. Xu J. Chang X. Lv J. Zhai Y. Tissue Engineering in Stomatology: A Review of Potential Approaches for Oral Disease Treatments Front. Bioeng. Biotechnol. 2021 9 662418 10.3389/fbioe.2021.662418 34820359 PMC8606749 233. Harris J.P. Burrell J.C. Struzyna L.A. Chen H.I. Serruya M.D. Wolf J.A. Duda J.E. Cullen D.K. Emerging regenerative medicine and tissue engineering strategies for Parkinson’s disease NPJ Park. Dis. 2020 6 4 10.1038/s41531-019-0105-5 PMC6949278 31934611 234. Skardal A. Atala A. Biomaterials for Integration with 3-D Bioprinting Ann. Biomed. Eng. 2015 43 730 746 10.1007/s10439-014-1207-1 25476164 235. Bose S. Tarafder S. Bandyopadhyay A. Effect of Chemistry on Osteogenesis and Angiogenesis Towards Bone Tissue Engineering Using 3D Printed Scaffolds Ann. Biomed. Eng. 2017 45 261 272 10.1007/s10439-016-1646-y 27287311 PMC5149117 236. Ma L. Wang X. Zhao N. Zhu Y. Qiu Z. Li Q. Zhou Y. Lin Z. Li X. Zeng X. Integrating 3D Printing and Biomimetic Mineralization for Personalized Enhanced Osteogenesis, Angiogenesis, and Osteointegration Appl. Mater. Interfaces 2018 10 42146 42154 10.1021/acsami.8b17495 PMC6456406 30507136 237. Wang X. Li G. Guo J. Yang L. Liu Y. Sun Q. Li R. Yu W. Hybrid composites of mesenchymal stem cell sheets, hydroxyapatite, and platelet-rich fibrin granules for bone regeneration in a rabbit calvarial critical-size defect model Exp. Ther. Med. 2017 13 1891 1899 10.3892/etm.2017.4199 28565782 PMC5443196 238. Mankani M.H. Kuznetsov S.A. Wolfe R.M. Marshall G.W. Robey P.G. In Vivo Bone Formation by Human Bone Marrow Stromal Cells: Reconstruction of the Mouse Calvarium and Mandible Stem Cells 2006 24 2140 2149 10.1634/stemcells.2005-0567 16763200 239. Pizzicannella J. Diomede F. Gugliandolo A. Chiricosta L. Bramanti P. Merciaro I. Orsini T. Mazzon E. Trubiani O. 3D Printing PLA/Gingival Stem Cells/ EVs Upregulate miR-2861 and -210 during Osteoangiogenesis Commitment Int. J. Mol. Sci. 2019 20 3256 10.3390/ijms20133256 31269731 PMC6651609 240. Yuanzheng C. Yan G. Ting L. Yanjie F. Peng W. Nan B. Enhancement of the Repair of Dog Alveolar Cleft by an Autologous Iliac Bone, Bone Marrow–Derived Mesenchymal Stem Cell, and Platelet-Rich Fibrin Mixture Plast. Reconstr. Surg. 2015 135 1405 1412 10.1097/PRS.0000000000001166 25835246 241. Caballero M. Morse J.C. Halevi A.E. Emodi O. Pharaon M.R. Wood J.S. Van Aalst J.A. Juvenile Swine Surgical Alveolar Cleft Model to Test Novel Autologous Stem Cell Therapies Tissue Eng. Part Methods 2015 21 898 908 10.1089/ten.tec.2014.0646 PMC4553376 25837453 242. Nosrati H. Nosrati M. Artificial Intelligence in Regenerative Medicine: Applications and Implications Biomimetics 2023 8 442 10.3390/biomimetics8050442 37754193 PMC10526210 243. Capponi S. Wang S. AI in cellular engineering and reprogramming Biophys. J. 2024 123 2658 2670 10.1016/j.bpj.2024.04.001 38576162 PMC11393708 244. Lee S.B. Abdal Dayem A. Kmiecik S. Lim K.M. Seo D.S. Kim H.T. Kumar Biswas P. Do M. Kim D.H. Cho S.G. Efficient improvement of the proliferation, differentiation, and anti-arthritic capacity of mesenchymal stem cells by simply culturing on the immobilized FGF2 derived peptide, 44-ERGVVSIKGV-53 J. Adv. Res. 2024 62 119 141 10.1016/j.jare.2023.09.041 37777063 PMC11331723 245. Ertl P. Sticker D. Charwat V. Kasper C. Lepperdinger G. Lab-on-a-chip technologies for stem cell analysis Trends Biotechnol. 2014 32 245 253 10.1016/j.tibtech.2014.03.004 24726257 246. Zhang J. Wei X. Zeng R. Xu F. Li X. Stem Cell Culture and Differentiation in Microfluidic Devices Toward Organ-on-a-Chip Future Sci. OA 2017 3 FSO187 10.4155/fsoa-2016-0091 28670476 PMC5481871 247. Paek K. Kim S. Tak S. Kim M.K. Park J. Chung S. Park T.H. Kim J.A. A high-throughput biomimetic bone-on-a-chip platform with artificial intelligence-assisted image analysis for osteoporosis drug testing Bioeng. Transl. Med. 2023 8 e10313 10.1002/btm2.10313 36684077 PMC9842054 248. Zhang Q. Austin R.H. Applications of Microfluidics in Stem Cell Biology BioNanoScience 2012 2 277 286 10.1007/s12668-012-0051-8 23336098 PMC3546818 249. Wu H.W. Lin C.C. Lee G.B. Stem cells in microfluidics Biomicrofluidics 2011 5 013401 10.1063/1.3528299 21522491 PMC3082338 250. Park S.H. Sim W.Y. Min B.H. Yang S.S. Khademhosseini A. Kaplan D.L. Chip-Based Comparison of the Osteogenesis of Human Bone Marrow- and Adipose Tissue-Derived Mesenchymal Stem Cells under Mechanical Stimulation PLoS ONE 2012 7 e46689 10.1371/journal.pone.0046689 23029565 PMC3460891 251. Jumper J. Evans R. Pritzel A. Green T. Figurnov M. Ronneberger O. Tunyasuvunakool K. Bates R. Žídek A. Potapenko A. Highly accurate protein structure prediction with AlphaFold Nature 2021 596 583 589 10.1038/s41586-021-03819-2 34265844 PMC8371605 252. Alam B. Chopra K. Applications of Alphafold and Artificial Intelligence in Biology and Medicine. p. 15 Available online: https://www.academia.edu/127996095 (accessed on 9 August 2025) 253. Lee S. Kim Y.G. Jung H.I. Lim J.S. Nam K.C. Choi H.S. Kwak B.S. Bone-on-a-chip simulating bone metastasis in osteoporosis Biofabrication 2024 16 045025 10.1088/1758-5090/ad6cf9 39116896 254. Zaman Z. Exploring Bone Cell Research Using Bone-on-a-Chip Models and Microfluidics: A Literature Review Undergrad. Res. Nat. Clin. Sci. Technol. (Urncst) J. 2023 7 1 7 10.26685/urncst.477 255. Yang J. Duan P. Liu Q. Yu H. Fang F. Liu X. Microfluidic bone chip to study osteogenesis of porous substrate topographies in normal and osteoporotic microenvironments Eur. Cells Mater. 2024 47 238 252 10.22203/eCM.v047a15 256. Galván-Chacón V.P. Zampouka A. Hesse B. Bohner M. Habibovic P. Barata D. Bone-on-a-Chip: A Microscale 3D Biomimetic Model to Study Bone Regeneration Adv. Eng. Mater. 2022 24 2101467 10.1002/adem.202101467 257. Aleman J. George S.K. Herberg S. Devarasetty M. Porada C.D. Skardal A. Almeida-Porada G. Deconstructed Microfluidic Bone Marrow On-A-Chip to Study Normal and Malignant Hemopoietic Cell–Niche Interactions Small 2019 15 1902971 10.1002/smll.201902971 PMC8011350 31464364 258. Kim S. Rajendran A.K. Amirthalingam S. Kim J.H. So K.H. Hwang N.S. Recent technological advances in lab-on-a-chip for bone remodeling Biosens. Bioelectron. X 2023 14 100360 10.1016/j.biosx.2023.100360 259. Hao S. Ha L. Cheng G. Wan Y. Xia Y. Sosnoski D.M. Mastro A.M. Zheng S. A Spontaneous 3D Bone-On-a-Chip for Bone Metastasis Study of Breast Cancer Cells Small 2018 14 1702787 10.1002/smll.201702787 29399951 260. Van Noort D. Ong S.M. Zhang C. Zhang S. Arooz T. Yu H. Stem cells in microfluidics Biotechnol. Prog. 2009 25 52 60 10.1002/btpr.171 19205022 261. Tang Q. Li X. Lai C. Li L. Wu H. Wang Y. Shi X. Fabrication of a hydroxyapatite-PDMS microfluidic chip for bone-related cell culture and drug screening Bioact. Mater. 2021 6 169 178 10.1016/j.bioactmat.2020.07.016 32913926 PMC7453124 262. Wang X. Yu Y. Yang C. Shao C. Shi K. Shang L. Ye F. Zhao Y. Microfluidic 3D Printing Responsive Scaffolds with Biomimetic Enrichment Channels for Bone Regeneration Adv. Funct. Mater. 2021 31 2105190 10.1002/adfm.202105190 263. Costa L.A. Eiro N. Vaca A. Vizoso F.J. Towards a New Concept of Regenerative Endodontics Based on Mesenchymal Stem Cell-Derived Secretomes Products Bioengineering 2022 10 4 10.3390/bioengineering10010004 36671576 PMC9854964 Figure 1 OMSCs’ role in the regeneration of different body tissues. Figure 2 OMSCs mediated immunomodulation. bioengineering-12-00970-t001_Table 1 Table 1 Comparative landscape of dental and craniofacial stem cells. Cell Type Markers and Proliferation * Primary Differentiation Potential Accessibility Immunomodulatory Effects  Dental Pulp Stem Cells (DPSCs) Standard MSC markers. 23  Osteogenic: High potential for producing reparative dentin; sometimes superior to BMSCs [ 24 25 Chondrogenic: Consistent differentiation [ 26 Neurogenic: Differentiates into neuron-like, dopaminergic, and retinal ganglion cells [ 26 Readily accessible from the neurovascular bundle of healthy, inflamed, or wisdom tooth pulp. Can be recovered from cryopreservation [ 12 24 27 Immunologically privileged. Higher capacity than BMSCs; suppresses T-cell alloreactivity. Exosomes enhance secretion of anti-inflammatory IL-10 and TGF- β 28 29  Stem cells from exfoliated deciduous teeth (SHED) Express neural markers (nestin, β 30 31  Osteogenic: Can induce host cells to form bone and dentin [ 24 30 Chondrogenic: Differentiates into chondrocytes [ 26 Neurogenic: Differentiates into neuron-like cells, oligodendrocytes, adipocytes, and odontoblasts [ 16 32 33 Obtained from naturally exfoliated deciduous (“baby”) teeth; considered disposable tissue with limited ethical concerns and no donor site morbidity [ 34 35 Significant potential; adjusts CD4 + 36 37  Periodontal Ligament Stem Cells (PDLSCs) Standard MSC markers. 38  Osteogenic: Differentiates into osteogenic cells [ 39 Chondrogenic: Potential is noted [ 24 Neurogenic: Can transdifferentiate into retinal ganglion-like cells. Useful for tendon tissue regeneration [ 16 39 Easily accessible from periodontal ligament of impacted third molars. Can be isolated from cryopreserved ligaments [ 22 24 Properties similar to BMSCs; can suppress immune/inflammatory reactions [ 40 41  Gingival Mesenchymal Stem Cells (GMSCs) Standard MSC markers. 12  Osteogenic: Forms calcified bone nodule structures. Differentiates into chondrocytes, adipocytes, and osteocytes [ 42 Chondrogenic: Confirmed differentiation capacity [ 42 Neurogenic: Aggregates into neurospheres with enhanced neuronal differentiation [ 43 Easily accessible from gingival tissue (lamina propria) with minimal morbidity, rapid healing, and no scarring [ 12 Potent immunomodulatory and anti-inflammatory functions, maintaining potential even in inflammatory environments [ 42 42 44  Dental Follicle Stem Cells (DFSCs) Express high levels of osteogenic markers (RUNX2, ALP) in addition to standard MSC markers [ 45  Osteogenic: Higher potential than DPSCs and PDLSCs, particularly in inflammatory models [ 46 47 Chondrogenic: Confirmed differentiation [ 48 Neurogenic: Confirmed differentiation [ 49 Easily isolated from the dental follicle of developing teeth (e.g., wisdom teeth). Highly plastic if sourced early [ 48 50 Superior immune-suppressive effect compared to other dental MSCs [ 51 51 52  Alveolar Bone-Derived Mesenchymal Stem Cells (ABMSCs) Implied standard MSC markers (as a BMSCs source).  Osteogenic: Confirmed. Effective for treating craniofacial defects and restoring alveolar bone voids [ 20 Chondrogenic: Confirmed, but poor [ 53 Neurogenic: Not specified, but neural crest origin suggests potential. Sourced from alveolar bone marrow, often via minimally invasive aspirates during dental surgeries [ 53 observed to be similar to those of standard BMSCs [ 54  Buccal Fat Pad-Derived Stem Cells (BFPDs) Implied standard MSC markers (as an adipose-derived source) [ 5 55  Osteogenic: Confirmed [ 53 Chondrogenic: Higher ability for transformation than GMSCs. Neurogenic: Not specified. Available from buccal fat pad; facilitated preparation and lower morbidity than BMSCs harvest [ 17 56 Not detailed, but shares similarities with immunomodulatory Adipose tissue-Derived Stem Cells (ADSCs) [ 56  Salivary Gland Stem Cells (SGSCs) Markers for source cells (e.g., EpCAM + + + 11 57 Can be induced to differentiate into chondrogenic, osteogenic, and adipogenic cells [ 58 Isolated from salivary glands; focus is often on endogenous cellular plasticity rather than routine harvesting [ 57 59 Indirectly contributes through secretion of paracrine factors (cytokines, growth factors, EVs) [ 60  Stem Cells from Apical Papilla (SCAPs) Standard MSC markers. 61  Osteogenic: Differentiates into osteoblasts. Shows high in vitro mineralization potential [ 62 Chondrogenic: Capable of cartilage differentiation [ 63 Neurogenic: Not specified [ 64 65 Isolated from the apical papilla of incompletely developed teeth. Easy to access [ 61 Reported to have immunomodulatory characteristics similar to BMSCs [ 11 66 * All cells mentioned typically show expression of standard MSC markers (CD73, CD90, CD105) and do not express hematopoietic markers (CD34, CD45). bioengineering-12-00970-t002_Table 2 Table 2 Key mediators of angiogenesis and osteogenesis in bone repair. Mediator Role in Angiogenic-Osteogenic Coupling  Fibroblast growth factor (FGF) Particularly FGF-2, these are potent mitogens for mesenchymal cells and osteoblasts and are strongly angiogenic [ 113 114 115  Platelet-derived growth factors (PDGF) Released from platelets during clotting, PDGF is chemotactic for osteoblasts and promotes angiogenesis, partly by upregulating VEGF [ 116 117 118 119  Bone morphogenetic proteins (BMPs) Powerful osteoinductive factors (e.g., BMP-2, BMP-7) that stimulate osteoprogenitor differentiation. Their angiogenic effects are primarily indirect, mediated through the upregulation of VEGF [ 107 120 121  Placental Growth Factor (PlGF) A VEGF homolog that stimulates MSC proliferation and differentiation toward osteoblastic and osteoclastic lineages [ 99 122 123  Other Factors Molecules such as Insulin-like Growth Factor (IGF), Erythropoietin (EPO), and Angiopoietins (Ang-1, Ang-2) contribute to neovascularization and vessel maturation [ 99 110 116 124 125 126 127  Metallic Ions & Exosomes Emerging evidence shows that metallic ions (e.g., Co, Mg, Zn) can promote angiogenesis by upregulating HIF-1 α α 100 128 129 130 131 132 bioengineering-12-00970-t003_Table 3 Table 3 Comparison of OMSC-based preclinical bone regeneration strategies. Parameter Mandiblar Defect Study [ 87 143 144 Maxillary Alveolar Defect Study [ 18 142 145 Calvarial Defect Study [ 71 146 147 Stem cell sources  Yamada et al. [ 87 Wang et al. [ 143 Khosronejad et al. [ 148  Kandalam et al. [ 18 Jahanbin et al. [ 142 Seo et al. [ 145  Chamieh et al. [ 71 Rezai-Rad et al. [ 146 Johnson et al. [ 147 Scafold  [ 87 [ 143 [ 148  [ 18 [ 142 [ 145  [ 71 [ 146 [ 147 Animal  [ 87 [ 143 [ 148  [ 18 [ 142 [ 145  [ 71 [ 146 [ 147 Conclusion  [ 87 [ 143 [ 148  [ 18 [ 142 [ 145  [ 71 [ 146 [ 147 bioengineering-12-00970-t004_Table 4 Table 4 Clinical trial landscape. Registration ID Status (Phase) Condition Investigated Cell Type Used NCT03386877 204 Completed (2017) Periodontal Intrabony Defects Autologous DPSCs NCT03194451 206 Completed (2019) Bone Tissue Engineering Autologous DPSCs NCT00221130 207 Completed (2005) Adult Periodontitis Autologous MSCs/Osteoblasts NCT01357785 208 Completed (2014) Periodontal Intrabony Defects Autologous DPSCs NCT01082822 209 Completed (2012) Chronic Periodontitis Autologous DPSCs NCT04641533 210 Completed (2020) Third Molar Extraction Sockets Autologous DPSCs NCT04608838 205 Completed (2021) Acute Ischemic Stroke Allogeneic DPSCs (JTR-161) NCT03658655 211 Completed (2019) Type 2 Diabetes SHED ",
  "metadata": {
    "Title of this paper": "Towards a New Concept of Regenerative Endodontics Based on Mesenchymal Stem Cell-Derived Secretomes Products",
    "Journal it was published in:": "Bioengineering",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467435/"
  }
}