{
  "title": "Paper_162",
  "abstract": "pmc Clin Med Insights Oncol Clin Med Insights Oncol 1225 cmo ONC Clinical Medicine Insights. Oncology 1179-5549 SAGE Publications PMC12489199 PMC12489199.1 12489199 12489199 10.1177/11795549251381678 10.1177_11795549251381678 1 Original Research Article Development of a Predictive Model for the Risk of Myelosuppression in Patients With Nasopharyngeal Carcinoma Undergoing Chemoradiotherapy https://orcid.org/0009-0000-7098-8892 Wang Ruo-han 1 Jiang De-yue 1 Lu Jin 1 2 Xun Li-xue 1 Wang Fan 1 https://orcid.org/0009-0008-5294-0906 Shao Qian-qian 1 2 https://orcid.org/0000-0001-8012-8861 Zhang Hao-xuan 1 2 1 2 Qian-qian Shao, Department of Human Anatomy, Bengbu Medical University, 2600 Donghai Road, Bengbu 233030, Anhui, China. Email: isabella8527@163.com Hao-xuan Zhang, Department of Human Anatomy, Bengbu Medical University, 2600 Donghai Road, Bengbu 233030, Anhui, China. Email: zhxww@foxmail.com 30 9 2025 2025 19 478625 11795549251381678 31 3 2025 8 9 2025 30 09 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Background: Myelosuppression is a frequent complication in patients with nasopharyngeal carcinoma (NPC) undergoing chemoradiotherapy. Current clinical practice relies predominantly on treatment-phase monitoring for myelosuppression risk assessment, while effective pretreatment prediction tools are lacking. This study developed a predictive model based on pretreatment clinical indicators to facilitate early identification of high-risk patients and support clinical decision-making. Methods: We conducted a retrospective cohort study using electronic medical records of 210 patients with NPC who received chemoradiotherapy at the First Affiliated Hospital of Bengbu Medical University between May 2016 and December 2021. Using R software, patients were randomly allocated into a training set (n = 150) and an internal validation set (n = 60) at a 7:3 ratio. Variable selection was performed using Least Absolute Shrinkage and Selection Operator regression, followed by univariable and multivariable logistic regression analyses to identify potential predictors. Following categorization of these identified potential predictors, Firth penalized-likelihood regression was employed to correct for small-sample bias, while multicollinearity was rigorously assessed using variance inflation factors (VIFs). A predictive nomogram was subsequently constructed. Model performance was evaluated through multiple validation metrics, including the concordance index (C-index), receiver operating characteristic curve analysis, clinical decision curve analysis, and calibration curve. Results: Multivariable logistic regression analysis identified 3 potential predictors of myelosuppression: pretreatment plateletcrit (PCT), direct bilirubin (DBIL), and sodium ions (Na + P Conclusion: Pretreatment PCT, DBIL, and Na + Nasopharyngeal carcinoma chemoradiotherapy Least Absolute Shrinkage and Selection Operator regression myelosuppression nomogram Key research project of natural science in colleges and universities of Anhui Provincial Department of Education 2023AH051976 the Digital Medicine and Smart Health Key Laboratory of Anhui Province (Bengbu Medical University) open project key project AHCM2024Z006 Open Research Project of the Provincial Key Scientific Research Platform of Anhui Province, Bengbu Medical University AHCM2023Z003 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Introduction Nasopharyngeal carcinoma (NPC) is a kind of cancer of squamous cells that emerges in the nasopharynx’s epithelial tissues.  1  2  3 Despite these therapeutic advances through intensity-modulated radiotherapy and optimized chemotherapy,  4  5  6 Currently, although few studies have specifically examined correlative factors for chemoradiotherapy-induced myelosuppression in patients with NPC, evidence from other malignancies receiving similar regimens provides insights. A recent study identified multiple risk factors for chemotherapy-induced myelosuppression in esophageal cancer, including treatment regimen, concomitant medications, demographic characteristics (sex, age), hematological parameters (hemoglobin [Hb], platelet count [PLT], and red blood cell [RBC] counts), renal function markers (Cr, blood urea nitrogen, and urinary protein), and heart function indicators (CK).  7  8 9 10 Risk prediction models, which integrate multiple variables to predict individual outcomes or risks, are valuable tools in clinical practice.  11 12 14 This study developed and validated a comprehensive risk prediction model to identify patients with NPC at high risk of developing chemoradiotherapy-induced myelosuppression. This model may facilitate timely prophylactic interventions and potentially reduce the incidence of treatment-related myelosuppression. Materials and Methods Study design and population This study aimed to develop and validate a nomogram for assessing the risk of myelosuppression in patients with NPC undergoing chemoradiotherapy. This retrospective cohort study collected electronic medical records of 574 patients with NPC diagnosed at the First Affiliated Hospital of Bengbu Medical University between May 2016 and December 2021. Inclusion criteria: (1) individuals who have been pathologically diagnosed with NPC for the first time, (2) patients with no other malignancies in addition to NPC, (3) patients who underwent radiotherapy and chemotherapy, (4) patients with a complete clinical electronic medical record, and (5) completion of hospital database records and follow-up data. Exclusion criteria: (1) presence of other severe underlying diseases, (2) lack of pretreatment data for NPC, (3) significant missing data in the pretreatment clinical records, and (4) presence of severe infectious diseases. Based on these inclusion/exclusion criteria, 210 patients with NPC receiving chemoradiotherapy were ultimately enrolled in the study. The study flowchart is presented in Figure 1  15 Supplementary File Figure 1. Flow chart of this study. The study recruitment and data analysis of 573 newly diagnosed NPC patient Data collation The clinical data were systematically compiled into a standardized Excel database. Samples exceeding a 15% threshold for missing data were excluded from subsequent analyses to ensure data quality. For continuous variables with limited missing values (⩽15%), missing data were imputed using the mean value of the respective variable to maintain dataset integrity. Based on pre-established inclusion and exclusion criteria, we performed a comprehensive retrospective analysis of clinical data from 210 patients with NPC who underwent chemoradiotherapy. The included clinical indicators encompassed gender, age, pretreatment hematological profiles (complete blood count [CBC]), biochemical indicators, and systemic inflammatory markers, such as neutrophil-to-lymphocyte ratio (NLR). Categorical variables were assigned numerical codes according to predefined classification schemes: gender was binary-coded with male = 0 and female = 1. Variable definitions, measurement methods, and diagnostic criteria All clinical indicators were evaluated in accordance with World Health Organization (WHO) standards. Demographic variables included gender (categorized as male or female based on medical records) and age (recorded as a continuous variable in years at diagnosis). Pretreatment hematological profiles were obtained from CBC analysis performed within 7 days prior to treatment initiation using automated hematology analyzers. Biochemical indicators were measured from venous blood samples collected during the same period, with serum separated by centrifugation and analyzed using clinical chemistry analyzers following International Federation of Clinical Chemistry (IFCC) standard methods. All blood samples were processed within 2 hours of collection. Systemic inflammatory markers such as NLR were calculated as the absolute neutrophil count divided by the absolute lymphocyte count from pretreatment CBC results. All laboratory testing was performed in our institutional clinical laboratory following standardized operating procedures. Furthermore, during chemoradiotherapy for patients with NPC, the diagnosis of myelosuppression strictly adhered to the WHO grading criteria, as detailed in Table 1 Table 1. Grading criteria for myelosuppression. GRADING WBC(×10 9 NEUT(×10 9 PLT(×10 9 HGB(g/L) Ⅰ 3.9-3.0 1.9-1.5 99-75 109-95 Ⅱ 2.9-2.0 1.4-1.0 74-50 94-80 Ⅲ 1.9-1.0 0.9-0.5 49-25 79-65 Ⅳ <1.0 <0.5 <25 <65 Abbreviations: HGB, hemoglobin; NEUT, neutrophil count; PLT, platelet count; WBC, white blood cell count. Randomization and feature selection using least absolute shrinkage and selection operator regression Using R statistical software (version 4.3.3; R Foundation for Statistical Computing, Vienna, Austria), the cohort of 210 patients with NPC undergoing chemoradiotherapy was randomly partitioned into a training set (n = 150) and an internal validation set (n = 60) at a 7:3 ratio. A balance test was performed to assess the comparability between the 2 groups. Feature selection was performed on the training set using the Least Absolute Shrinkage and Selection Operator (LASSO), a robust machine learning method that simultaneously performs variable selection and regularization to enhance model generalizability while preventing overfitting. Univariable and multivariable logistic regression for predictive modeling In the training cohort (n = 150), features selected by LASSO regression were analyzed using univariable logistic regression. Statistically significant variables ( P P Model optimization and diagnostics These continuous variables used for modeling were converted into categorical variables and encoded as dummy variables, with the lowest-risk group (eg, PCT ⩽ 0.20) designated as the reference group. All dummy variables for the reference group were coded as 0; if a patient belonged to a nonreference group, the corresponding dummy variable was assigned a value of 1, whereas others were set to 0. All categories were retained in the model to maintain structural integrity. To address small-sample bias and data separation, we implemented Firth penalized-likelihood regression for robust parameter estimation. In addition, multicollinearity was rigorously assessed using variance inflation factors (VIF). Model performance evaluation and internal validation The model’s predictive performance was comprehensively assessed through multiple validation approaches. Discriminative ability was evaluated using the concordance index (C-index), while predictive accuracy was evaluated through receiver operating characteristic (ROC) curve analysis. Clinical effectiveness was estimated using decision curve analysis (DCA), while the calibration of the model was examined using calibration curve (CC). In addition, internal validation was performed using the validation cohort to further evaluate the robustness of the model. Statistical methods Statistical analyses were performed using SPSS software (version 27.0; IBM Corporation, Armonk, New York). All continuous variables were tested for normality and homogeneity of variance. For continuous variables exhibiting normal distribution and homogeneity of variance, between-group comparisons were conducted using independent samples t 25 75 2 P Results Clinical characteristics of the patients We retrospectively collected electronic medical records of 574 patients with NPC, and finally enrolled 210 eligible cases based on the predefined inclusion and exclusion criteria. All 210 enrolled patients with NPC received chemoradiotherapy. During the treatment, 115 cases (54.76%) developed myelosuppression, whereas 95 cases (45.24%) did not. The cohort included 157 males (74.76%) and 53 females (25.24%), with a median age of 52.42 years (range: 47-60.75 years). Table 2 Table 2. Baseline data for NPC chemoradiotherapy patients. Index Total (N = 210) Group  P Nonmyelosuppression Myelosuppression Gender 0 157 77 80 .056 1 53 18 35 Age 52.42 (47.00, 60.75) 52.14 (45.50, 61.50) 52.65 (48.00, 60.00) .560 WBC 6.55 (5.13, 7.22) 7.09 (5.27, 7.51) 6.10 (4.92, 6.81) .017 NEUT 4.16 (2.95, 4.62) 4.60 (3.21, 5.05) 3.79 (2.68, 4.35) .023 LYC 1.78 (1.31, 2.12) 1.84 (1.36, 2.26) 1.72 (1.29, 2.02) .186 NLR 2.56 (1.57, 3.03) 2.72 (1.76, 3.20) 2.42 (1.51, 3.01) .227 PLR 155.32 (106.91, 185.79) 156.53 (107.81, 178.82) 154.33 (107.16, 187.40) .786 PAR 6.02 (4.77, 6.80) 6.21 (4.83, 6.86) 5.87 (4.69, 6.62) .188 CAR 0.24 (0.02, 0.14) 0.26 (0.02, 0.13) 0.23 (0.02, 0.17) .801 EOS 0.14 (0.07, 0.17) 0.16 (0.08, 0.18) 0.13 (0.06, 0.17) .257 BASO 0.02 (0.01, 0.03) 0.02 (0.01, 0.03) 0.02 (0.00, 0.03) .028 MONO 0.44 (0.33, 0.51) 0.45 (0.32, 0.52) 0.44 (0.34, 0.50) .852 LMR 4.34 (3.20, 5.22) 4.41 (3.45, 5.18) 4.27 (3.10, 5.22) .305 NEUT% 61.62 ± 9.49 62.74 ± 9.28 60.70 ± 9.56 .122 LYM% 29.79 (22.60, 35.10) 27.73 (21.20, 32.80) 31.50 (22.70, 36.45) .284 EOS% 2.38 (1.10, 2.90) 2.45 (1.10, 3.05) 2.31 (1.15, 2.90) .968 BASO% 0.31 (0.10, 0.50) 0.34 (0.15, 0.50) 0.29 (0.00, 0.40) .120 MONO% 6.97 (5.73, 8.08) 6.59 (5.55, 7.50) 7.28 (6.00, 8.45) .002 RBC 4.61 ± 0.44 4.67 ± 0.45 4.56 ± 0.42 .066 HGB 139.57 (130.00, 151.00) 141.94 (130.00, 153.50) 137.62 (129.00, 148.50) .123 HCT 0.42 ± 0.04 0.42 ± 0.05 0.41 ± 0.04 .054 MCV 90.45 (87.80, 94.05) 90.33 (87.90, 94.40) 90.54 (87.75, 93.70) .678 MCH 30.44 (29.60, 31.70) 30.40 (29.55, 31.80) 30.46 (29.60, 31.55) .965 MCHC 336.00 (329.00, 343.00) 335.03 (328.50, 341.50) 336.80 (330.00, 345.00) .210 RDW-CV 12.89 (12.20, 13.30) 12.95 (12.40, 13.25) 12.83 (12.20, 13.30) .089 RDW-SD 41.87 (39.90, 43.48) 42.11 (40.00, 44.15) 41.68 (39.85, 43.30) .312 PLT 248.80 (200.25, 280.75) 258.14 (205.50, 288.00) 241.10 (196.00, 268.00) .081 MPV 10.35 ± 1.32 10.37 ± 1.20 10.33 ± 1.42 .835 PCT 0.26 (0.21, 0.29) 0.27 (0.22, 0.29) 0.25 (0.21, 0.28) .055 PDW 14.53 (12.60, 16.20) 15.04 (13.60, 16.30) 14.11 (12.20, 16.05) .002 P-LCR 28.80 ± 9.44 28.91 ± 9.29 28.70 ± 9.56 .870 RET 0.05 (0.04, 0.06) 0.05 (0.04, 0.06) 0.05 (0.04, 0.06) .819 RETP 1.13 (0.82, 1.35) 1.11 (0.83, 1.31) 1.15 (0.82, 1.38) .792 ALT 22.24 (13.00, 25.00) 22.20 (14.00, 24.50) 22.28 (13.00, 27.00) .474 AST 23.63 (17.00, 24.00) 24.91 (17.00, 23.00) 22.58 (17.00, 24.00) .765 ALP 76.12 (55.25, 85.00) 78.08 (53.00, 85.00) 74.50 (57.00, 85.00) .869 γ-GT 33.33 (17.00, 33.75) 33.84 (16.00, 33.50) 32.91 (17.00, 33.50) .860 ChE 8509.65 (7008.00, 9845.00) 8259.24 (6680.00, 9493.50) 8716.50 (7453.00, 10023.00) .074 TBIL 9.22 (6.10, 11.50) 10.06 (6.80, 12.55) 8.53 (5.90, 10.40) .021 DBIL 3.14 (2.10, 4.10) 3.58 (2.30, 4.60) 2.78 (1.85, 3.60) .001 IBIL 6.06 (3.83, 7.60) 6.48 (4.30, 8.00) 5.72 (3.65, 7.30) .110 TBA 4.65 (2.33, 5.88) 4.52 (2.45, 5.85) 4.76 (2.30, 5.85) .804 PA 264.04 (224.25, 299.25) 261.65 (225.50, 290.00) 266.01 (227.50, 300.50) .501 TP 70.70 (66.43, 73.78) 71.01 (66.45, 73.70) 70.45 (66.45, 74.20) .584 ALB 41.73 ± 3.57 41.98 ± 3.43 41.53 ± 3.66 .367 GLOB 28.97 (25.20, 31.88) 29.04 (24.90, 32.30) 28.92 (26.20, 31.50) .649 A/G 1.50 (1.30, 1.70) 1.50 (1.30, 1.70) 1.50 (1.30, 1.60) .401 RBP 43.93 ± 13.66 45.33 ± 15.02 42.77 ± 12.29 .187 GLU 5.15 (4.63, 5.52) 5.16 (4.67, 5.63) 5.13 (4.60, 5.49) .657 UA 289.80 ± 75.43 291.46 ± 75.47 288.43 ± 75.37 .773 Cr 65.63 (59.00, 72.00) 66.31 (60.00, 73.00) 65.07 (58.00, 70.50) .198 BUN 4.93 (4.10, 5.80) 5.04 (4.10, 6.14) 4.84 (4.02, 5.60) .317 K + 3.85 ± 0.39 3.83 ± 0.43 3.86 ± 0.36 .592 Na + 141.53 (140.00, 143.00) 142.51 (140.00, 144.00) 140.72 (139.00, 143.00) <.001 Cl - 102.24 (101.00, 104.00) 102.28 (100.50, 104.00) 102.21 (101.00, 104.50) .893 Ca 2.27 (2.18, 2.34) 2.26 (2.18, 2.33) 2.27 (2.18, 2.35) .297 Ca 2+ 1.21 (1.17, 1.25) 1.20 (1.15, 1.25) 1.21 (1.17, 1.26) .256 P 1.09 ± 0.20 1.07 ± 0.20 1.10 ± 0.21 .286 HCO3 24.82 (22.80, 27.08) 25.06 (23.10, 27.30) 24.62 (22.30, 26.80) .433 AG 15.09 (12.13, 16.58) 15.16 (13.20, 17.05) 15.02 (11.20, 16.30) .023 OP 281.72 (278.53, 285.60) 282.95 (280.00, 286.80) 280.71 (276.60, 284.20) .001 TC 4.35 (3.79, 4.77) 4.36 (3.89, 4.89) 4.35 (3.75, 4.75) .726 TG 1.63 (0.96, 1.98) 1.56 (0.98, 1.96) 1.69 (0.96, 2.01) .495 HDL 1.10 (0.90, 1.27) 1.13 (0.91, 1.26) 1.08 (0.89, 1.27) .438 LDL 2.74 (2.18, 3.14) 2.82 (2.26, 3.32) 2.68 (2.13, 3.08) .300 Apo (a) 1.15 (1.00, 1.28) 1.16 (1.00, 1.29) 1.15 (1.01, 1.28) .956 Apo (b) 0.87 (0.71, 1.02) 0.88 (0.72, 1.04) 0.87 (0.71, 0.97) .615 Lp (a) 244.80 (77.50, 348.00) 210.69 (65.50, 282.00) 272.98 (104.50, 356.00) .009 Cys-C 1.39 (0.80, 1.02) 1.92 (0.80, 1.00) 0.95 (0.80, 1.03) .469 CRP 9.55 (0.80, 5.97) 10.07 (0.72, 5.45) 9.11 (1.00, 6.69) .827 SOD 172.40 (156.00, 186.00) 174.16 (159.50, 187.00) 170.94 (155.00, 183.50) .167 Abbreviations: AG, anion gap; AGR, albumin globulin ratio; ALB, albumin; ALP, alkaline phosphatase; ALT, alanine aminotransferase; Apo(a), apolipoprotein(a); Apo(b), apolipoprotein(b); AST, aspartate transferase; BASO, basophil count; BASO%, basophil percentage; BUN, blood urea nitrogen; Ca, total calcium ions; Ca 2+ − + + Balance test and LASSO regression-based feature screening The 210 patients with NPC receiving chemoradiotherapy were randomly allocated into a training set (n = 150) and an internal validation set (n = 60) at a 7:3 ratio. Balance testing of baseline characteristics (all P Table 3 Table 3. A test of balance in 2 groups of NPC chemoradiotherapy patients. INDEX TOTAL (N = 210) GROUP  P TRAINING SET (N = 150) INTERNAL VALIDATION SET (N = 60) Gender 0 157 108 49 .145 1 53 42 11 Age 52.42 (47.00, 60.75) 52.89 (47.00, 60.75) 51.23 (45.00, 58.75) .260 WBC 6.55 (5.13, 7.22) 6.58 (5.09, 6.99) 6.49 (5.23, 7.40) .645 NEUT 4.16 (2.95, 4.62) 4.18 (2.87, 4.58) 4.11 (3.11, 4.65) .537 LYC 1.78 (1.31, 2.12) 1.77 (1.31, 2.09) 1.79 (1.34, 2.13) .978 NLR 2.56 (1.57, 3.03) 2.55 (1.67, 3.02) 2.58 (1.52, 3.11) .711 PLR 155.32 (106.91, 185.79) 156.24 (107.65, 188.67) 153.03 (106.64, 168.93) .796 PAR 6.02 (4.77, 6.80) 6.04 (4.77, 6.78) 5.98 (4.77, 6.85) .935 CAR 0.24 (0.02, 0.14) 0.26 (0.02, 0.14) 0.20 (0.02, 0.14) .933 EOS 0.14 (0.07, 0.17) 0.15 (0.07, 0.18) 0.12 (0.06, 0.16) .607 BASO 0.02 (0.01, 0.03) 0.02 (0.01, 0.03) 0.02 (0.01, 0.03) .877 MONO 0.44 (0.33, 0.51) 0.44 (0.33, 0.51) 0.44 (0.32, 0.51) .758 LMR 4.34 (3.20, 5.22) 4.31 (3.17, 5.22) 4.39 (3.53, 5.06) .475 NEUT% 61.62 ± 9.49 61.33 ± 9.56 62.35 ± 9.27 .485 LYM% 29.79 (22.60, 35.10) 30.34 (22.60, 34.95) 28.43 (22.60, 35.23) .874 EOS% 2.38 (1.10, 2.90) 2.54 (1.13, 3.08) 1.97 (1.10, 2.70) .262 BASO% 0.31 (0.10, 0.50) 0.30 (0.10, 0.50) 0.32 (0.18, 0.50) .710 MONO% 6.97 (5.73, 8.08) 7.04 (5.80, 8.10) 6.78 (5.68, 7.43) .233 RBC 4.61 ± 0.44 4.60 ± 0.46 4.64 ± 0.38 .537 HGB 139.57 (130.00, 151.00) 138.99 (130.00, 150.00) 141.02 (130.50, 152.00) .590 HCT 0.42 ± 0.04 0.42 ± 0.04 0.42 ± 0.04 .841 MCV 90.45 (87.80, 94.05) 90.76 (87.95, 94.35) 89.66 (87.50, 93.10) .335 MCH 30.44 (29.60, 31.70) 30.45 (29.73, 31.58) 30.41 (29.48, 31.70) .668 MCHC 336.00 (329.00, 343.00) 335.57 (329.00, 342.00) 337.08 (330.50, 345.00) .337 RDW-CV 12.89 (12.20, 13.30) 12.87 (12.20, 13.30) 12.93 (12.28, 13.20) .528 RDW-SD 41.87 (39.90, 43.48) 41.87 (39.83, 43.58) 41.89 (39.98, 43.33) .656 PLT 248.80 (200.25, 280.75) 250.72 (200.25, 286.75) 244.02 (203.75, 273.25) .715 MPV 10.35 ± 1.32 10.42 ± 1.37 10.18 ± 1.18 .233 PCT 0.26 (0.21, 0.29) 0.26 (0.21, 0.29) 0.25 (0.21, 0.28) .377 PDW 14.53 (12.60, 16.20) 14.56 (12.60, 16.20) 14.44 (12.60, 16.20) .817 P-LCR 28.80 ± 9.44 28.92 ± 9.84 28.48 ± 8.35 .762 RET 0.05 (0.04, 0.06) 0.05 (0.04, 0.06) 0.05 (0.04, 0.06) .681 RETP 1.13 (0.82, 1.35) 1.15 (0.83, 1.35) 1.10 (0.76, 1.37) .498 ALT 22.24 (13.00, 25.00) 22.64 (13.00, 24.00) 21.25 (12.00, 26.50) .541 AST 23.63 (17.00, 24.00) 24.61 (17.00, 24.00) 21.20 (18.00, 23.00) .942 ALP 76.12 (55.25, 85.00) 76.77 (56.00, 87.00) 74.50 (54.75, 81.00) .751 γ-GT 33.33 (17.00, 33.75) 33.01 (16.00, 30.00) 34.13 (17.00, 38.50) .145 ChE 8509.65 (7008.00, 9845.00) 8558.33 (7008.75, 9782.00) 8387.93 (6993.00, 10011.00) .744 TBIL 9.22 (6.10, 11.50) 9.00 (6.00, 11.15) 9.79 (6.88, 12.75) .214 DBIL 3.14 (2.10, 4.10) 3.03 (2.10, 3.80) 3.42 (2.10, 4.50) .253 IBIL 6.06 (3.83, 7.60) 5.95 (3.80, 7.48) 6.36 (4.00, 8.18) .285 TBA 4.65 (2.33, 5.88) 4.65 (2.80, 6.00) 4.66 (1.85, 5.70) .050 PA 264.04 (224.25, 299.25) 260.83 (230.00, 290.00) 272.05 (219.75, 312.50) .437 TP 70.70 (66.43, 73.78) 70.92 (66.55, 74.10) 70.18 (66.18, 73.13) .543 ALB 41.73 ± 3.57 41.91 ± 3.49 41.29 ± 3.73 .261 GLOB 28.97 (25.20, 31.88) 29.01 (25.33, 31.68) 28.88 (24.88, 32.18) .936 A/G 1.50 (1.30, 1.70) 1.51 (1.30, 1.70) 1.48 (1.30, 1.70) .615 RBP 43.93 ± 13.66 43.39 ± 13.76 45.27 ± 13.29 .371 GLU 5.15 (4.63, 5.52) 5.15 (4.59, 5.52) 5.13 (4.65, 5.50) .784 UA 289.80 ± 75.43 286.56 ± 74.80 297.90 ± 76.38 .327 Cr 65.63 (59.00, 72.00) 65.06 (58.25, 71.75) 67.05 (60.00, 73.25) .383 BUN 4.93 (4.10, 5.80) 4.96 (4.10, 5.88) 4.86 (3.99, 5.72) .628 K + 3.85 ± 0.39 3.84 ± 0.39 3.87 ± 0.40 .559 Na + 141.53 (140.00, 143.00) 141.25 (139.25, 143.00) 142.23 (141.00, 144.00) .012 Cl - 102.24 (101.00, 104.00) 102.15 (100.00, 104.00) 102.48 (101.00, 104.00) .532 Ca 2.27 (2.18, 2.34) 2.27 (2.18, 2.34) 2.26 (2.18, 2.34) .782 Ca 2+ 1.21 (1.17, 1.25) 1.20 (1.16, 1.25) 1.21 (1.17, 1.26) .730 P 1.09 ± 0.20 1.08 ± 0.20 1.10 ± 0.20 .408 HCO3 24.82 (22.80, 27.08) 24.88 (22.80, 27.18) 24.65 (22.63, 26.85) .459 AG 15.09 (12.13, 16.58) 15.04 (11.75, 16.10) 15.20 (12.68, 17.43) .082 OP 281.72 (278.53, 285.60) 281.07 (277.43, 285.08) 283.35 (280.60, 287.03) .046 TC 4.35 (3.79, 4.77) 4.35 (3.77, 4.75) 4.37 (3.87, 4.81) .544 TG 1.63 (0.96, 1.98) 1.58 (0.94, 1.94) 1.77 (0.98, 2.21) .869 HDL 1.10 (0.90, 1.27) 1.11 (0.90, 1.28) 1.10 (0.87, 1.24) .612 LDL 2.74 (2.18, 3.14) 2.73 (2.17, 3.13) 2.77 (2.29, 3.26) .713 Apo (a) 1.15 (1.00, 1.28) 1.16 (1.01, 1.28) 1.14 (1.00, 1.24) .571 Apo (b) 0.87 (0.71, 1.02) 0.84 (0.70, 0.99) 0.95 (0.75, 1.05) .192 Lp (a) 244.80 (77.50, 348.00) 239.09 (73.50, 348.00) 259.08 (112.50, 348.00) .462 Cys-C 1.39 (0.80, 1.02) 0.94 (0.81, 1.02) 2.51 (0.80, 1.02) .828 CRP 9.55 (0.80, 5.97) 10.17 (0.81, 5.97) 7.99 (0.80, 5.59) .795 SOD 172.40 (156.00, 186.00) 172.05 (154.00, 186.00) 173.27 (160.75, 187.00) .805 To identify the most relevant predictive features, LASSO regression was implemented for initial feature selection across all variables in the training dataset. The analysis demonstrated 2 distinct optimal regularization parameters: Lambda.min and Lambda.lse, each corresponding to different sets of predictive variables. Specifically, Lambda.min identified 8 significant predictive variables, whereas Lambda.lse identified 3 more concise predictor variables ( Figure 2A B + 2+ Figure 2. LASSO regression. (A) LASSO regression model coefficient compression path graph for all predictor variables; (B) LASSO regression cross validation results graph. Eight predictor variables were screened, which were pretreatment RBC, PCT, DBIL, MONO%, BASO, Na + 2+ LASSO regression results on RBC, pH, DBIL, Monocyte %, Baso, Na+, Ca2+, Lp(a) predictors; graph shows variable removal path and cross-validation deviation curves. Univariable logistic regression analysis of clinical predictors Univariable logistic regression was performed on the training set (n = 150) to screen potential myelosuppression predictors. The analysis incorporated myelosuppression occurrence as the dependent variable and the 8 LASSO-selected predictors as independent variables. Our findings revealed that 7 clinical predictors showed statistically significant associations (all P P P P P P + P P Table 4 Table 4. Univariable logistic regression analysis of myelosuppression in patients with NPC with chemoradiotherapy. Predictors β SE Wald χ²  P OR 95% CI RBC −0.748 0.376 3.957 .047 0.473 0.227-0.989 PCT −4.854 2.390 4.127 .042 0.008 0.000-0.843 DBIL −0.433 0.127 11.658 .001 0.648 0.505-0.831 MONO% 0.267 0.100 7.060 .008 1.305 1.072-1.589 BASO −30.306 10.851 7.800 .005 0.000 0.000-0.000 Na + −0.123 0.057 4.610 .032 0.885 0.791-0.989 Ca 2+ 3.075 1.948 2.491 .115 21.646 0.475-985.858 Lp(a) 0.003 0.001 7.379 .007 1.003 1.001-1.005 Abbreviations: CI, confidence interval; OR, odds ratio; SE, standard error. Multivariable logistic regression analysis of clinical predictors Building upon the univariable analysis findings, we performed multivariable logistic regression analysis on the training cohort comprising 150 patients to identify independent predictors for myelosuppression. The dependent variable was defined as myelosuppression occurrence, while the 7 clinically significant predictors (all P P P + P Table 5 Table 5. Multivariable logistic regression analysis of myelosuppression in patients with NPC with chemoradiotherapy. Predictors β SE Wald χ²  P OR 95% CI RBC −0.743 0.441 2.840 .092 0.476 0.201-1.129 PCT −7.341 3.023 5.895 .015 0.001 0.000-0.243 DBIL −0.317 0.133 5.735 .017 0.728 0.562-0.944 MONO% 0.217 0.114 3.626 .057 1.242 0.994-1.552 BASO −11.905 13.067 0.830 .362 0.000 0.895922.281 Na + −0.128 0.065 3.911 .048 0.879 0.774-0.999 Lp(a) 0.002 0.001 3.530 .060 1.002 1.000-1.004 Firth penalized-likelihood regression and collinearity diagnostics Multivariable logistic regression identified 3 potential predictors of myelosuppression in patients with NPC undergoing chemoradiotherapy (all P Table 6 Table 6. Results of Firth penalized-likelihood regression and VIF after conversion to categorical variables. Predictors Categories Firth penalized-likelihood regression VIF β SE OR (95% CI)  P Intercept 2.423 0.658 — <.001 PCT, mL/L 1 ⩽0.20 Ref — 1.00 — 2 0.21-0.24 −0.055 0.559 0.946 (0.30, 2.86) .922 1.929 3 0.25-0.28 −1.294 0.558 0.274 (0.09, 0.81) .018 1.882 4 >0.28 −1.166 0.569 0.312 (0.10, 0.94) .038 2.005 DBIL, μmol/L 1 0-2.0 Ref — 1.00 — 2 2.1-2.6 −0.325 0.563 0.722 (0.23, 2.20) .567 1.561 3 2.7-3.6 −1.425 0.542 0.241 (0.08, 0.68) .007 1.583 4 3.7-4.6 −1.287 0.595 0.276 (0.08, 0.88) .029 1.460 5 >4.6 −2.278 0.652 0.102 (0.03, 0.35) <.001 1.455 Na + 1 ⩽140 Ref — 1.00 — 2 141-142 −0.454 0.480 0.635 (0.24, 1.65) .350 1.275 3 143-144 −1.161 0.487 0.313 (0.12, 0.81) .016 1.316 4 >144 −0.211 0.641 0.810 (0.23, 2.95) .745 1.203 Abbreviation: Ref, reference category. Development of a risk prediction nomogram model Based on multivariable logistic regression analysis of predictors in the training cohort of patients with NPC, we identified pretreatment PCT, DBIL, and Na + Figure 3  L o g i t ( P ) = 2 . 423 + ∑ β i ⋅ X i where P  β i Table 6  X i  X i  X i Figure 3. The nomogram model for predicting the risk of myelosuppression in patients with NPC with chemoradiotherapy. Nomogram predicting myelosuppression risk for NPC undergoing CRT: 0-10 Pct, 0-25 DBil, 0-6 Na, Myelosuppression 0-10 Internal evaluation and validation of the risk prediction nomogram model The model demonstrated robust discriminative ability, with concordance indices (C-indices) of 0.763 and 0.811 for internal evaluation and validation, respectively. ROC curve analysis revealed areas under the curve (AUCs) of 0.7359 and 0.7435 for the training and validation sets, respectively ( Figure 4A B Figure 5A B Figure 6A B Figure 4. Comparing the internal evaluation and internal verification area under the ROC curve. (A) Internal evaluation (AUC = 0.7359); (B) internal verification (AUC = 0.7435). Comparison of AUC values between internal evaluation and internal verification in ROC curves. Figure 5. DCA curve of internal evaluation and internal verification. (A) Internal evaluation clinical net benefits of 40% to 90%; (B) internal verification clinical net benefits of 19% to 74% and 76% to 78%. The image displays two graphs, A and B, showing the clinical net benefits of two studies using the Decentralized Clinical Assistant (DCA) on internal evaluation (A) and internal verification (B), respectively. Figure 6. Calibration curve of internal evaluation and internal verification. (A) The calibration curve from internal evaluation show good agreement with the ideal curve; (B) the calibration curve from internal verification has good agreement with the ideal curve. Comparison of calibration curves from two methods; both show variance from the ideal. Ideal curve represents perfect agreement Discussion In recent years, the incidence of NPC has continued to rise due to factors such as tobacco use, dietary patterns, genetic predisposition, and Epstein-Barr virus infection. 16 19  20 21 23  24 Currently, the management of myelosuppression primarily relies on monitoring hematologic parameters during treatment. If the risk of myelosuppression could be predicted prior to chemoradiotherapy, it would significantly reduce patient suffering. However, few studies have investigated risk prediction of chemoradiotherapy-induced myelosuppression in patients with NPC. Accordingly, we developed a predictive model to assess the risk of myelosuppression in patients with NPC undergoing chemoradiotherapy, which may facilitate early clinical intervention and timely treatment adjustment to reduce patient suffering. Previous studies have suggested that myelosuppression may be associated with thrombocytopenia. 25 26  27  28  29 Pretreatment DBIL was identified as another potential predictor of myelosuppression in patients with NPC undergoing chemoradiotherapy. Our Firth penalized-likelihood regression analysis revealed a striking dose-response relationship: compared with the reference group (group 1), patients with elevated DBIL levels showed progressively greater protection against myelosuppression—group 3 (OR = 0.241, P P P  30  31  32  33 Moreover, this study found that pretreatment Na + P P  34 + 35 37 + + Despite the clinical significance of myelosuppression in patients with NPC receiving chemoradiotherapy, the current literature reveals a paucity of studies investigating risk factors and developing predictive models for this complication. This significantly hinders effective clinical prevention strategies. In this study, using real-world clinical data from the hospital cohort, we identified potential predictors of myelosuppression in patients with NPC undergoing chemoradiotherapy by combining LASSO regression with univariable and multivariable logistic regression analyses. Subsequently, these predictors were transformed into categorical variables to construct a risk prediction nomogram. The model, incorporating pretreatment PCT, DBIL, and Na + However, several limitations should be acknowledged. First, the study may be constrained by the relatively limited sample size and single-institution data source, which precluded the assessment of additional potential predictors and external validation of the model. Second, and perhaps more critically, the retrospective design led to the unavailability of certain important patient information. As evidenced by previous studies in other cancers, treatment regimens (such as drug combinations and cycle intervals)  38  39 P Conclusion In conclusion, we have successfully developed and validated a risk prediction model for chemoradiotherapy-induced myelosuppression in patients with NPC. This clinically applicable model may provide valuable predictive insights that may enable clinicians to implement proactive preventive strategies and optimize treatment regimens, thereby potentially reducing the incidence and severity of treatment-related myelosuppression. To further strengthen the clinical utility and generalizability of our findings, we strongly recommend conducting large-scale, multicenter prospective cohort studies with diverse patient populations. Such validation efforts would not only confirm the robustness of our model but also facilitate its integration into routine clinical practice for improved patient management. Supplemental Material sj-docx-1-onc-10.1177_11795549251381678 – Supplemental material for Development of a Predictive Model for the Risk of Myelosuppression in Patients With Nasopharyngeal Carcinoma Undergoing Chemoradiotherapy Supplemental material, sj-docx-1-onc-10.1177_11795549251381678 for Development of a Predictive Model for the Risk of Myelosuppression in Patients With Nasopharyngeal Carcinoma Undergoing Chemoradiotherapy by Ruo-han Wang, De-yue Jiang, Jin Lu, Li-xue Xun, Fan Wang, Qian-qian Shao and Hao-xuan Zhang in Clinical Medicine Insights: Oncology We thank the Ethics Committee of Bengbu Medical University for supporting this study. ORCID iDs: https://orcid.org/0009-0000-7098-8892 Qian-qian Shao https://orcid.org/0009-0008-5294-0906 Hao-xuan Zhang https://orcid.org/0000-0001-8012-8861 Ethical Considerations: Consent to Participate: Consent for Publication: Author Contributions: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Data Availability Statement: Supplemental Material: References 1 Guo R Mao YP Tang LL Chen L Sun Y Ma J. The evolution of nasopharyngeal carcinoma staging Br J Radiol 2019 92 10.1259/bjr.20190244 PMC6774596 31298937 2 Bray F Ferlay J Soerjomataram I Siegel RL Torre LA Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 394 424 10.3322/caac.21492 30207593 3 Cai M Wang Y Ma H Yang L Xu Z. Advances and challenges in immunotherapy for locally advanced nasopharyngeal carcinoma Cancer Treat Rev 2024 131 102840 10.1016/j.ctrv.2024.102840 39426201 4 Chen YP Chan ATC Le QT Blanchard P Sun Y Ma J. Nasopharyngeal carcinoma Lancet 2019 394 64 80 10.1016/s0140-6736(19)30956-0 31178151 5 Epstein RS Aapro MS Basu Roy UK et al Patient burden and real-world management of chemotherapy-induced myelosuppression: results from an online survey of patients with solid tumors Adv Ther 2020 37 3606 3618 10.1007/s12325-020-01419-6 32642965 PMC7340862 6 Zhang T Zhou M Xiao D et al Myelosuppression alleviation and hematopoietic regeneration by tetrahedral-framework nucleic-acid nanostructures functionalized with osteogenic growth peptide Adv Sci (Weinh) 2022 9 10.1002/advs.202202058 PMC9507378 35882625 7 Zheng Z Zhang Q Han Y Wu T Zhang Y. Predictive model of chemotherapy-induced myelosuppression for patients with esophageal cancer Cancer Control 2022 29 10.1177/10732748221126929 PMC9511327 36134707 8 Marinescu ȘA Toma RV Trifănescu OG et al Predictors of clinical hematological toxicities under radiotherapy in patients with cervical cancer-a risk analysis Cancers (Basel) 2024 16 3032 10.3390/cancers16173032 39272891 PMC11394146 9 Guo Z Wang YJ He BS Zhou J. Linc00312 single nucleotide polymorphism as biomarker for chemoradiotherapy induced hematotoxicity in nasopharyngeal carcinoma patients Dis Markers 2022 2022 6707821 10.1155/2022/6707821 35990252 PMC9381851 10 Jin YN Qiang MY Wang Y et al The efficacy and safety of adding PD-1 blockade to induction chemotherapy and concurrent chemoradiotherapy (IC-CCRT) for locoregionally advanced nasopharyngeal carcinoma: an observational, propensity score-matched analysis Cancer Immunol Immunother 2024 73 125 10.1007/s00262-024-03698-2 38733402 PMC11088572 11 Snell KIE Levis B Damen JAA et al Transparent reporting of multivariable prediction models for individual prognosis or diagnosis: checklist for systematic reviews and meta-analyses (TRIPOD-SRMA) BMJ 2023 381 10.1136/bmj-2022-073538 PMC10155050 37137496 12 Gu B Meng M Xu M et al Multi-task deep learning-based radiomic nomogram for prognostic prediction in locoregionally advanced nasopharyngeal carcinoma Eur J Nucl Med Mol Imaging 2023 50 3996 4009 10.1007/s00259-023-06399-7 37596343 PMC10611876 13 Wu J Luo H Wang K Yi B. Development and validation of a novel diagnostic nomogram model using serum oxidative stress markers and AURKA for prediction of nasopharyngeal carcinoma Cancer Manag Res 2023 15 1053 1062 10.2147/cmar.S402572 37790897 PMC10544130 14 Li Y Hong X Xu W et al Identification and validation of a prognostic risk model based on radiosensitivity-related genes in nasopharyngeal carcinoma Transl Oncol 2025 52 102243 10.1016/j.tranon.2024.102243 39675252 PMC11713735 15 von Elm E Altman DG Egger M Pocock SJ Gøtzsche PC Vandenbroucke JP. The strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies Lancet 2007 370 1453 1457 10.1016/s0140-6736(07)61602-x 18064739 16 Okekpa SI Mydin RB Mangantig E et al Nasopharyngeal carcinoma (NPC) risk factors: a systematic review and meta-analysis of the association with lifestyle, diets, socioeconomic and sociodemographic in Asian region Asian Pac J Cancer Prev 2019 20 3505 3514 10.31557/apjcp.2019.20.11.3505 31759378 PMC7063023 17 Khan G Fitzmaurice C Naghavi M Ahmed LA. Global and regional incidence, mortality and disability-adjusted life-years for Epstein-Barr virus-attributable malignancies, 1990-2017 BMJ Open 2020 10 10.1136/bmjopen-2020-037505 PMC7462312 32868361 18 Lin JH Wen CP Jiang CQ et al Smoking and nasopharyngeal cancer: individual data meta-analysis of six prospective studies on 334 935 men Int J Epidemiol 2021 50 975 986 10.1093/ije/dyab060 33787881 PMC8271191 19 Wang Q Xie H Li Y et al Racial and ethnic disparities in nasopharyngeal cancer with an emphasis among Asian Americans Int J Cancer 2022 151 1291 1303 10.1002/ijc.34154 35666524 20 Carvajal F Luyo G Veloso J et al Advances in nasopharyngeal carcinoma treatment: induction chemotherapy and concomitant radio-chemotherapy Rev Med Chil 2023 151 1221 1232 10.4067/s0034-98872023000901221 39093159 21 Bossola M Antocicco M Pepe G. Tube feeding in patients with head and neck cancer undergoing chemoradiotherapy: a systematic review JPEN J Parenter Enteral Nutr 2022 46 1258 1269 10.1002/jpen.2360 35244947 22 Zhang QL Wu TT Han Y Zheng ZM Zhang Y. Chemotherapy-induced myelosuppression in esophageal cancer patients: risks and suggestions for its management Curr Med Sci 2022 42 530 537 10.1007/s11596-022-2587-3 35648285 23 Ghosh S Huang J Inkman M et al Radiation-induced circulating myeloid-derived suppressor cells induce systemic lymphopenia after chemoradiotherapy in patients with glioblastoma Sci Transl Med 2023 15 10.1126/scitranslmed.abn6758 PMC10501302 36696484 24 Crawford J Herndon D Gmitter K Weiss J. The impact of myelosuppression on quality of life of patients treated with chemotherapy Future Oncol 2024 20 1515 1530 10.2217/fon-2023-0513 38587388 PMC11441072 25 Erdem GU Dogan M Demirci NS Zengin N. Oxaliplatin-induced acute thrombocytopenia J Cancer Res Ther 2016 12 509 514 10.4103/0973-1482.154056 27461601 26 Jesudas R Takemoto CM. Where have all the platelets gone? HIT, DIC, or something else? Hematology Am Soc Hematol Educ Program 2023 2023 43 50 10.1182/hematology.2023000465 38066886 PMC10727081 27 Song AB Al-Samkari H. Emerging data on thrombopoietin receptor agonists for management of chemotherapy-induced thrombocytopenia Expert Rev Hematol 2023 16 365 375 10.1080/17474086.2023.2201428 37039010 PMC10190112 28 Al-Samkari H. Optimal management of chemotherapy-induced thrombocytopenia with thrombopoietin receptor agonists Blood Rev 2024 63 101139 10.1016/j.blre.2023.101139 37914568 PMC10872905 29 Song J Lai X Zhang Y Zheng X Su J. Preoperative platelet morphology parameters as prognostic predictors for endometrial malignant carcinoma stage and progesterone receptor Medicine (Baltimore) 2019 98 10.1097/md.0000000000017818 PMC6882632 31764773 30 Zhang H Li G Zhu Z et al Serum bilirubin level predicts postoperative overall survival in oral squamous cell carcinoma J Oral Pathol Med 2018 47 382 387 10.1111/jop.12693 29430757 31 Song YJ Gao XH Hong YQ Wang LX. Direct bilirubin levels are prognostic in non-small cell lung cancer Oncotarget 2017 9 892 900 10.18632/oncotarget.23184 29416664 PMC5787521 32 Zhu Y Zhao F Jin P. Clinical manifestations and risk factors of tigecycline-associated thrombocytopenia Infect Drug Resist 2023 16 6225 6235 10.2147/idr.S426259 37732172 PMC10508280 33 Brigle K Pierre A Finley-Oliver E Faiman B Tariman JD Miceli T. Myelosuppression, bone disease, and acute renal failure: evidence-based recommendations for oncologic emergencies Clin J Oncol Nurs 2017 21 60 76 10.1188/17.Cjon.S5.60-76 28945730 34 Li MM Shen WC Li YJ Teng J. Linezolid-induced pancytopenia in patients using dapagliflozin: a case series Infect Drug Resist 2022 15 5509 5517 10.2147/idr.S375694 36158232 PMC9505346 35 Leslie TK James AD Zaccagna F et al Sodium homeostasis in the tumour microenvironment Biochim Biophys Acta Rev Cancer 2019 1872 188304 10.1016/j.bbcan.2019.07.001 31348974 PMC7115894 36 Olguner SK Arslan A Açik V et al Sodium fluorescein for spinal intradural tumors Front Oncol 2021 10 9 10.3389/fonc.2020.618579 PMC7877540 33585245 37 James AD Leslie TK Kaggie JD et al Sodium accumulation in breast cancer predicts malignancy and treatment response Br J Cancer 2022 127 337 349 10.1038/s41416-022-01802-w 35462561 PMC9296657 38 Xie H Zhang R Wei C Xu J Chu J Wang X. Construction and validation of a nomogram prediction model for predicting the risk of chemotherapy-induced myelosuppression after chemotherapy in patients with triple-negative breast cancer: a single-center retrospective case-control study Transl Cancer Res 2025 14 2885 2899 10.21037/tcr-24-1513 40530156 PMC12170043 39 Park K Kim Y Son M Chae D Park K. A pharmacometric model to predict chemotherapy-induced myelosuppression and associated risk factors in non-small cell lung cancer Pharmaceutics 2022 14 914 10.3390/pharmaceutics14050914 35631500 PMC9145791 ",
  "metadata": {
    "Title of this paper": "A pharmacometric model to predict chemotherapy-induced myelosuppression and associated risk factors in non-small cell lung cancer",
    "Journal it was published in:": "Clinical Medicine Insights. Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489199/"
  }
}