{
  "title": "Paper_972",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470386 PMC12470386.1 12470386 12470386 41009683 10.3390/ijms26189124 ijms-26-09124 1 Article Shared Genetic Architecture Between Atopic Dermatitis and Autoimmune Diseases Lazanas Panagiotis Methodology Software Formal analysis Data curation Writing – original draft Writing – review & editing Visualization 1 https://orcid.org/0000-0002-5967-9367 Antonatos Charalabos Conceptualization Methodology Data curation Writing – review & editing Visualization 1 Tsoumani Konstantina T. Writing – review & editing 2 https://orcid.org/0000-0002-8299-3100 Sgourou Argyro Writing – review & editing 2 https://orcid.org/0000-0002-3167-7642 Vasilopoulos Yiannis Data curation Writing – review & editing Supervision 1 * Kanda Naoko Academic Editor 1 panagiotislazanas2@gmail.com charisantonatos@gmail.com 2 ktsoumani@gmail.com sgourou@eap.gr * iovasilop@upatras.gr 18 9 2025 9 2025 26 18 497349 9124 18 8 2025 16 9 2025 16 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Atopic dermatitis (AD) and autoimmune diseases exhibit epidemiological comorbidity, yet the shared genetic architecture remains incompletely understood. We investigated the genetic overlap between AD and three autoimmune disorders including inflammatory bowel disease (IBD), rheumatoid arthritis (RA), and vitiligo, leveraging genome-wide association data. Despite modest evidence for global genetic correlations, we found 113 independent pleiotropic loci shared among AD and autoimmune diseases, with 11 displaying a concordant effect across all 3 pairwise comparisons. Gene-set and tissue enrichment analyses evidenced the inflammatory background of pleiotropic associations. Multi-trait colocalization analysis prioritized 22 loci, linking the tissue-specific expression of DOK2 GPR132 RERE RERE-AS1 SUOX TNFRSF11A TRAF1 atopic dermatitis vitiligo inflammatory bowel disease rheumatoid arthritis pleiotropy This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Atopic dermatitis (AD), also known as eczema or atopic eczema, is one of the most prevalent skin disorders, exhibiting a 2.62% worldwide prevalence and affecting up to 204.5 million individuals [ 1 Staphylococcus aureus 2 3 4 FLG 5 6 FLG 7 AD is established as the first occurrence of the atopic march, involving the sequential development of other atopic comorbidities including asthma and allergic rhinitis across the lifespan [ 6 8 9 However, studies have also shown that AD is connected to a wide variety of non-atopic diseases, such as ocular, cardiovascular, musculoskeletal, and metabolic comorbidities [ 10 11 12 13 10 14 15 14 16 17 3 6 18 19 17 To test our hypothesis, we investigated the shared genetic architecture between AD and autoimmune diseases. We deliberately selected autoimmune traits spanning mucosal, systemic, and organ-specific autoimmunity to examine whether pleiotropic architecture in AD reflects broad immune dysregulation or is confined to specific pathogenic contexts. Specifically, we focused on IBD as a model of barrier-associated autoimmunity [ 20 21 22 10 14 Figure 1 2. Results 2.1. Genetic Correlations Between Atopic Dermatitis and Autoimmune Disorders We gathered available publicly available GWAS data [ 23 Table 1 g p g p g p 2.2. Pleiotropic Loci Between Atopic Dermatitis and Autoimmune Disorders Pairwise pleiotropic analyses identified 3250 pleiotropic SNPs between AD and IBD, mapped to 70 pleiotropic loci using the functional mapping and annotation of genome-wide association studies (FUMA) web platform. In the AD–RA comparison, 1533 pleiotropic variants were mapped to 50 independent loci, while AD–vitiligo displayed the lowest amount of genome-wide significant (GWS) variants ( n Figure 2 Table S1 Figure 2 Figure S1 Figure S2 Figure S3 Functional enrichment analysis performed with annotate variation (ANNOVAR) showed that most pleiotropic variants were mapped in intronic regions ( Figure 2 Figure 2 27 A large number of pleiotropic loci were shared among all pairwise comparisons. Specifically, 41/113 (36%) independent pleiotropic loci were shared across any 2 traits, corresponding to 15.7% for IBD (11/70), 38% for RA (19/50), and 35.4% for vitiligo (11/31). Out of all pleiotropic loci identified, 11/113 (9%) were shared across all 3 traits, corresponding to 15.7% for IBD (11/70), 22% for RA (11/50), and 35.4% for vitiligo (11/31). 2.3. Prioritization of Candidate Pleiotropic Genes and Pathways with Tissue Specificity Gene prioritization analyses through the multi-marker analysis of genomic annotation (MAGMA) v1.10 resulted in 243 significant gene-trait associations for all pairwise comparisons, reduced to 188 unique ( Table S2 PTPN22 REL KIF3A PPR5L SUOX 7 Figure 2 MRPS21 TNFSF4 KIAA1109 ADAD1 IL1 IL21 BACH2 IL2RA CLEC16A ZBTB46 ARFRP1 TNFRSF6B CSF2RB Figure S4 Competitive gene-set analysis reported 261 unique enriched terms, including 233 gene sets among AD–IBD, 114 in the AD–RA and 47 in the AD–vitiligo pairwise comparisons ( Table S3 p −7 28 p −8 21 p −6 29 16 Table S3 Tissue enrichment analysis supported the notion of widespread patterns of inflammation across bivariate analyses. More specifically, the top prioritized tissue across all analyses was whole blood, while similar estimates were derived for spleen, lung and Epstein–Barr virus–transformed lymphocytes ( Figure S5 2.4. Multi-Trait Colocalization Analysis Multi-trait colocalization analysis using HyPrColoc identified 22 pleiotropic loci between AD and at least one comorbidity at a posterior probability (PP) ≥ 0.6 ( Table 2 Table 2 Table S4 Table S5 PTPN22 Figure 2 BCL2L11 LINC00824, SH2B3 ATXN2 Table 2 Finally, we examined the causal association of genetically regulated gene expression of all prioritized, protein-coding genes in AD risk using summary-based Mendelian Randomization (SMR) ( Figure 3 p RERE RERE-AS1 p −4 DOK2 p −4 GPR132 p −4 RERE TRAF1 Figure 3 SUOX p −7 p −6 TNFRSF11A p −4 Table S6 2.5. Bidirectional Causal Relationships Detailed statistics for all instrumental variables (IVs) used in the bidirectional Mendelian Randomization (MR) analyses are presented in Table S7 Figure 4 Table S8 p IBD p RA p vitiligo Table S9 Table S10 p Figure 4 In contrast, using AD as the outcome resulted in the identification of causal relationships for IBD and vitiligo, albeit with increased heterogeneity ( Table S8 p Figure 4 p IBD Table S9 Table S10 Figure 4 p , p Figure 4 3. Discussion Despite distinct pathogenic frameworks of autoimmune diseases and AD, accumulating epidemiological evidence suggests overlapping genetic architectures and pleiotropic effects. To elucidate the heritable basis of the observed multimorbidity, we scrutinized genome-wide data to examine shared genetic risk between AD and three autoimmune diseases, namely IBD, RA, and vitiligo. The diversity of the selected disorders enabled us to probe whether shared genetic risk with AD reflects broad immune dysregulation or is confined to specific autoimmune subtypes. We used complementary approaches, spanning from global genetic correlations and bidirectional MR to colocalization analyses to disentangle shared genetic liability from disease-specific effects. Compared to previous cross-trait meta-analyses in allergic diseases [ 9 17 The directionality of these relationships was investigated using bidirectional MR. We found no evidence for a causal effect of genetic liability to AD on any of the autoimmune diseases examined ( Figure 4 Figure 4 31 32 33 Figure 4 16 H H 34 H 7 H H H H 7 H 34 Figure 4 10 16 Figure 4 Although global genetic correlation estimates between AD and 2/3 autoimmune diseases were non-significant, the genome-wide pleiotropy scan revealed 113 shared independent, non-overlapping risk loci across all pairwise comparisons ( Figure 2 Figure 2 Figure 2 TNFSF4 TNFRSF6B TNFSF4 35 TNFRSF6B H 36 TNFRSF6B CLEC16A 37 KIAA1109 IL2 IL21 ADAD1 38 39 40 cis 30 Figure 3 DOK2 GPR132 RERE RERE-AS1 SUOX TNFRSF11A TRAF1 SUOX 41 GPR132 IL6R 42 cis H H H cis Figure 2 Figure 3 cis Table S3 Figure S5 43 There are some constraints to our study. GWAS summary statistics originated from individuals of European ancestry ( Table 1 H 30 44 45 10 cis Table S5 4. Methods 4.1. Data Sources We gathered GWAS summary statistics from publicly available sources including the GWAS Catalog [ 23 Table 1 Cis 46 4.2. Genetic Correlation To compute the global genetic correlation estimates between AD and autoimmune diseases, we used linkage disequilibrium score regression (LDSC) [ 47 (n p 4.3. Pleiotropy Analysis To identify potential pleiotropic associations at the SNP level, we performed PLACO [ 48 7 6 6 2 48 47 −8 4.4. Functional Annotation Summary statistics were then imported to FUMA web platform to define candidate pleiotropic loci [ 49 2 2 50 Gene-level, gene-set, and tissue enrichment analyses were executed using MAGMA v1.10 software to determine pleiotropic genes and biological pathways, a multiple regression-based framework that evaluates joint SNP effects on gene-level associations [ 51 p 4.5. Multi-Trait Colocalization Analysis Multi-trait colocalization analysis was performed using HyPrColoc with the default parameters, a Bayesian clustering algorithm that enables fast and accurate estimations of colocalization probabilities in a genomic region across a large number of binary and continuous traits [ 52 53 cis 54 cis 7 30 p p p HEIDI 4.6. Bidirectional Causal Relationships Finally, we executed two sample bidirectional MR analyses to investigate causality between genetic liability to AD and to autoimmune diseases under study. IVs were selected based on the 3 MR hypotheses, including (i) robust association with the exposure, (ii) independence with any confounders between the exposure and the outcome, and (iii) lack of horizontal pleiotropy. Independent IVs were selected based on a p −8 2 2 2 55 The IVW method was used as the primary model, combining Wald ratio estimates of each IV to perform an inverse-variance weighted analysis [ 56 57 58 59 60 5. Conclusions In conclusion, we identified 113 non-overlapping pleiotropic loci jointly associated with AD and autoimmune diseases with discrete immunopathological mechanisms. Integration of multiple gene prioritization algorithms pinpointed to discrete genes, nevertheless converging on shared immune-related pathways that could serve as novel therapeutic targets. Our findings stress the role of inflammation as a unifying axis linking epithelial and autoimmune disorders, providing evidence for differential pleiotropic mechanisms across disease domains. This pleiotropy-informed framework lays the foundation for identifying shared mechanisms at the gene and pathway level, with potential implications for drug repositioning in AD and immune-mediated comorbidities. Acknowledgments CA was financially supported by the “Andreas Mentzelopoulos Foundation”. Disclaimer/Publisher’s Note: Supplementary Materials The supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189124/s1 Author Contributions Conceptualization, C.A.; methodology, P.L. and C.A.; software, formal analysis, P.L.; data curation, P.L., C.A., and Y.V.; writing—original draft preparation, P.L.; writing—review and editing, P.L., C.A., K.T.T., A.S., and Y.V.; visualization, P.L. and C.A.; supervision, Y.V. All authors have read and agreed to the published version of the manuscript. Data availability statement All GWAS summary statistics are publicly available from the GWAS catalog ( https://www.ebi.ac.uk/gwas/ Conflicts of Interest The authors declare no conflicts of interest. References 1. Tian J. Zhang D. Yang Y. Huang Y. Wang L. Yao X. Lu Q. Global Epidemiology of Atopic Dermatitis: A Comprehensive Systematic Analysis and Modelling Study Br. J. Dermatol. 2023 190 55 61 10.1093/bjd/ljad339 37705227 2. Antonatos C. Pontikas A. Akritidis A. Georgiou S. Stratigos A.J. Kleidona I.A. Gregoriou S. Grafanaki K. Vasilopoulos Y. Neuroticism and Inflammatory Skin Diseases: A Bidirectional Mendelian Randomization Study Arch. Dermatol. Res. 2024 316 213 10.1007/s00403-024-03017-w 38787431 3. Langan S.M. Irvine A.D. Weidinger S. Atopic Dermatitis Lancet 2020 396 345 360 10.1016/S0140-6736(20)31286-1 32738956 4. Løset M. Brown S.J. Saunes M. Hveem K. Genetics of Atopic Dermatitis: From DNA Sequence to Clinical Relevance Dermatology 2019 235 355 364 10.1159/000500402 31203284 5. Pontikas A. Antonatos C. Evangelou E. Vasilopoulos Y. Candidate Gene Association Studies in Atopic Dermatitis in Participants of European and Asian Ancestry: A Systematic Review and Meta-Analysis Genes 2023 14 1456 10.3390/genes14071456 37510360 PMC10379179 6. Weidinger S. Beck L.A. Bieber T. Kabashima K. Irvine A.D. Atopic Dermatitis Nat. Rev. Dis. Primers 2018 4 1 10.1038/s41572-018-0001-z 29930242 7. Budu-Aggrey A. Kilanowski A. Sobczyk M.K. 23andMe Research Team Shringarpure S.S. Mitchell R. Reis K. Reigo A. Estonian Biobank Research Team Mägi R. European and Multi-Ancestry Genome-Wide Association Meta-Analysis of Atopic Dermatitis Highlights Importance of Systemic Immune Regulation Nat. Commun. 2023 14 6172 10.1038/s41467-023-41180-2 37794016 PMC10550990 8. Schuler C.F. Tsoi L.C. Billi A.C. Harms P.W. Weidinger S. Gudjonsson J.E. Genetic and Immunological Pathogenesis of Atopic Dermatitis J. Investig. Dermatol. 2024 144 954 968 10.1016/j.jid.2023.10.019 38085213 PMC11040454 9. Ferreira M.A. Vonk J.M. Baurecht H. Marenholz I. Tian C. Hoffman J.D. Helmer Q. Tillander A. Ullemar V. van Dongen J. Shared Genetic Origin of Asthma, Hay Fever and Eczema Elucidates Allergic Disease Biology Nat. Genet. 2017 49 1752 1757 10.1038/ng.3985 29083406 PMC5989923 10. Thyssen J.P. Halling A.-S. Schmid-Grendelmeier P. Guttman-Yassky E. Silverberg J.I. Comorbidities of Atopic Dermatitis—What Does the Evidence Say? J. Allergy Clin. Immunol. 2023 151 1155 1162 10.1016/j.jaci.2022.12.002 36621338 11. Antonatos C. Pontikas A. Akritidis A. Mitsoudi D. Georgiou S. Stratigos A.J. Zacharopoulou A. Gregoriou S. Grafanaki K. Vasilopoulos Y. A Genome-Wide Pleiotropy Study between Atopic Dermatitis and Neuropsychiatric Disorders Hum. Genom. 2025 19 86 10.1186/s40246-025-00801-1 40713851 PMC12297686 12. Qi C. Li A. Su F. Wang Y. Zhou L. Tang C. Feng R. Mao R. Chen M. Chen L. An Atlas of the Shared Genetic Architecture between Atopic and Gastrointestinal Diseases Commun. Biol. 2024 7 1696 10.1038/s42003-024-07416-7 39719505 PMC11668890 13. Elhage K.G. Kranyak A. Jin J.Q. Haran K. Spencer R.K. Smith P.L. Davis M.S. Hakimi M. Bhutani T. Liao W. Mendelian Randomization Studies in Atopic Dermatitis: A Systematic Review J. Investig. Dermatol. 2024 144 1022 1037 10.1016/j.jid.2023.10.016 37977498 14. Ivert L.U. Wahlgren C.-F. Lindelöf B. Dal H. Bradley M. Johansson E.K. Association between Atopic Dermatitis and Autoimmune Diseases: A Population-Based Case–Control Study Br. J. Dermatol. 2021 185 335 342 10.1111/bjd.19624 33091150 PMC8451742 15. Schmitt J. Schwarz K. Baurecht H. Hotze M. Fölster-Holst R. Rodríguez E. Lee Y.A.E. Franke A. Degenhardt F. Lieb W. Atopic Dermatitis Is Associated with an Increased Risk for Rheumatoid Arthritis and Inflammatory Bowel Disease, and a Decreased Risk for Type 1 Diabetes J. Allergy Clin. Immunol. 2016 137 130 136 10.1016/j.jaci.2015.06.029 26253344 16. Hu Z. Wang T. Beyond Skin White Spots: Vitiligo and Associated Comorbidities Front. Med. 2023 10 1072837 10.3389/fmed.2023.1072837 PMC9995999 36910477 17. Shirai Y. Nakanishi Y. Suzuki A. Konaka H. Nishikawa R. Sonehara K. Namba S. Tanaka H. Masuda T. Yaga M. Multi-Trait and Cross-Population Genome-Wide Association Studies across Autoimmune and Allergic Diseases Identify Shared and Distinct Genetic Component Ann. Rheum. Dis. 2022 81 1301 1312 10.1136/annrheumdis-2022-222460 35753705 PMC9380494 18. Silverberg J.I. Gooderham M.J. Paller A.S. Deleuran M. Bunick C.G. Gold L.F.S. Hijnen D. Calimlim B.M. Lee W.-J. Teixeira H.D. Early and Sustained Improvements in Symptoms and Quality of Life with Upadacitinib in Adults and Adolescents with Moderate-to-Severe Atopic Dermatitis: 52-Week Results from Two Phase III Randomized Clinical Trials (Measure Up 1 and Measure Up 2) Am. J. Clin. Dermatol. 2024 25 485 496 10.1007/s40257-024-00853-4 38528257 PMC11070400 19. Dhar S. De A. Sarda A. Godse K. Lahiri K. Real-World Efficacy and Safety of Oral Tofacitinib in Patients with Refractory Moderate to Severe Atopic Dermatitis: A Multicenter Retrospective Study Indian J. Dermatol. 2024 69 292 295 10.4103/ijd.ijd_843_22 39296687 PMC11407563 20. Lee S.H. Kwon J.E. Cho M.-L. Immunological Pathogenesis of Inflammatory Bowel Disease Intest. Res. 2018 16 26 42 10.5217/ir.2018.16.1.26 29422795 PMC5797268 21. Weyand C.M. Goronzy J.J. Takemura S. Kurtin P.J. Cell-Cell Interactions in Synovitis: Interactions between T Cells and B Cells in Rheumatoid Arthritis Arthritis Res. Ther. 2000 2 457 10.1186/ar128 11094459 PMC128875 22. Marchioro H.Z. Silva de Castro C.C. Fava V.M. Sakiyama P.H. Dellatorre G. Miot H.A. Update on the Pathogenesis of Vitiligo An. Bras. Dermatol. 2022 97 478 490 10.1016/j.abd.2021.09.008 35643735 PMC9263675 23. Cerezo M. Sollis E. Ji Y. Lewis E. Abid A. Bircan K.O. Hall P. Hayhurst J. John S. Mosaku A. The NHGRI-EBI GWAS Catalog: Standards for Reusability, Sustainability and Diversity Nucleic Acids Res. 2025 53 D998 D1005 10.1093/nar/gkae1070 39530240 PMC11701593 24. de Lange K.M. Moutsianas L. Lee J.C. Lamb C.A. Luo Y. Kennedy N.A. Jostins L. Rice D.L. Gutierrez-Achury J. Ji S.-G. Genome-Wide Association Study Implicates Immune Activation of Multiple Integrin Genes in Inflammatory Bowel Disease Nat. Genet. 2017 49 256 261 10.1038/ng.3760 28067908 PMC5289481 25. Ishigaki K. Sakaue S. Terao C. Luo Y. Sonehara K. Yamaguchi K. Amariuta T. Too C.L. Laufer V.A. Scott I.C. Multi-Ancestry Genome-Wide Association Analyses Identify Novel Genetic Mechanisms in Rheumatoid Arthritis Nat. Genet. 2022 54 1640 1651 10.1038/s41588-022-01213-w 36333501 PMC10165422 26. Jin Y. Andersen G. Yorgov D. Ferrara T.M. Ben S. Brownson K.M. Holland P.J. Birlea S.A. Siebert J. Hartmann A. Genome-Wide Association Studies of Autoimmune Vitiligo Identify 23 New Risk Loci and Highlight Key Pathways and Regulatory Variants Nat. Genet. 2016 48 1418 1424 10.1038/ng.3680 27723757 PMC5120758 27. Antonatos C. Grafanaki K. Georgiou S. Evangelou E. Vasilopoulos Y. Disentangling the Complexity of Psoriasis in the Post-Genome-Wide Association Era Genes Immun. 2023 24 236 247 10.1038/s41435-023-00222-x 37717118 28. Feuerstein J.D. Moss A.C. Farraye F.A. Ulcerative Colitis Mayo Clin. Proc. 2019 94 1357 1373 10.1016/j.mayocp.2019.01.018 31272578 29. Xin Y. Yuan T. Wang J. Circulating Immune Cells and Vitiligo: A Bidirectional Two-Sample Mendelian Randomization Study Front. Immunol. 2024 15 1391186 10.3389/fimmu.2024.1391186 38887286 PMC11180719 30. Antonatos C. Budu-Aggrey A. Pontikas A. Akritidis A. Pasmatzi E. Tsiogka A. Gregoriou S. Grafanaki K. Paternoster L. Vasilopoulos Y. Polygenic Transcriptome Risk Scores Enhance Predictive Accuracy in Atopic Dermatitis J. Transl. Med. 2025 23 575 10.1186/s12967-025-06570-8 40410830 PMC12102998 31. Wu L.-C. Hwang C.-Y. Chung P.-I. Hua T.-C. Chen Y.-D. Chu S.-Y. Lee D.-D. Chang Y.-T. Wang W.-J. Liu H.-N. Autoimmune Disease Comorbidities in Patients with Atopic Dermatitis: A Nationwide Case–Control Study in Taiwan Pediatr. Allergy Immunol. 2014 25 586 592 10.1111/pai.12274 25223227 32. Narla S. Silverberg J.I. Association between Atopic Dermatitis and Autoimmune Disorders in US Adults and Children: A Cross-Sectional Study J. Am. Acad. Dermatol. 2019 80 382 389 10.1016/j.jaad.2018.09.025 30287311 33. Meisinger C. Freuer D. Causal Association Between Atopic Dermatitis and Inflammatory Bowel Disease: A 2-Sample Bidirectional Mendelian Randomization Study Inflamm. Bowel Dis. 2022 28 1543 1548 10.1093/ibd/izab329 34964870 34. Campione E. Lanna C. Diluvio L. Cannizzaro M.V. Grelli S. Galluzzo M. Talamonti M. Annicchiarico-Petruzzelli M. Mancini M. Melino G. Skin Immunity and Its Dysregulation in Atopic Dermatitis, Hidradenitis Suppurativa and Vitiligo Cell Cycle 2020 19 257 267 10.1080/15384101.2019.1707455 31905036 PMC7028161 35. Guttman-Yassky E. Croft M. Geng B. Rynkiewicz N. Lucchesi D. Peakman M. van Krinks C. Valdecantos W. Xing H. Weidinger S. The Role of OX40 Ligand/OX40 Axis Signalling in Atopic Dermatitis Br. J. Dermatol. 2024 191 488 496 10.1093/bjd/ljae230 38836560 36. Hsu T.-L. Chang Y.-C. Chen S.-J. Liu Y.-J. Chiu A.W. Chio C.-C. Chen L. Hsieh S.-L. Modulation of Dendritic Cell Differentiation and Maturation by Decoy Receptor 3 J. Immunol. 2002 168 4846 4853 10.4049/jimmunol.168.10.4846 11994433 37. Ellinghaus D. Baurecht H. Esparza-Gordillo J. Rodríguez E. Matanovic A. Marenholz I. Hübner N. Schaarschmidt H. Novak N. Michel S. High-Density Genotyping Study Identifies Four New Susceptibility Loci for Atopic Dermatitis Nat. Genet. 2013 45 808 812 10.1038/ng.2642 23727859 PMC3797441 38. Albers H.M. Kurreeman F.A.S. Stoeken-Rijsbergen G. Brinkman D.M.C. Kamphuis S.S.M. van Rossum M.A.J. Girschick H.J. Wouters C. Saurenmann R.K. Hoppenreijs E. Association of the Autoimmunity Locus 4q27 with Juvenile Idiopathic Arthritis Arthritis Rheum. 2009 60 901 904 10.1002/art.24296 19248117 39. Wang J. Wicker L.S. Santamaria P. IL-2 and Its High-Affinity Receptor: Genetic Control of Immunoregulation and Autoimmunity Semin. Immunol. 2009 21 363 371 10.1016/j.smim.2009.04.004 19447046 40. Kumar V. Gutierrez-Achury J. Kanduri K. Almeida R. Hrdlickova B. Zhernakova D.V. Westra H.-J. Karjalainen J. Ricaño-Ponce I. Li Y. Systematic Annotation of Celiac Disease Loci Refines Pathological Pathways and Suggests a Genetic Explanation for Increased Interferon-Gamma Levels Hum. Mol. Genet. 2015 24 397 409 10.1093/hmg/ddu453 25190711 41. Antonatos C. Mitsoudi D. Pontikas A. Akritidis A. Xiropotamos P. Georgakilas G.K. Georgiou S. Tsiogka A. Gregoriou S. Grafanaki K. Transcriptome-Wide Analyses Delineate the Genetic Architecture of Expression Variation in Atopic Dermatitis Hum. Genet. Genom. Adv. 2025 6 100422 10.1016/j.xhgg.2025.100422 40017037 PMC11937661 42. Zeng Z. Mukherjee A. Varghese A.P. Yang X.-L. Chen S. Zhang H. Roles of G Protein-Coupled Receptors in Inflammatory Bowel Disease World J. Gastroenterol. 2020 26 1242 1261 10.3748/wjg.v26.i12.1242 32256014 PMC7109274 43. Demela P. Pirastu N. Soskic B. Cross-Disorder Genetic Analysis of Immune Diseases Reveals Distinct Gene Associations That Converge on Common Pathways Nat. Commun. 2023 14 2743 10.1038/s41467-023-38389-6 37173304 PMC10182075 44. Mucha S. Baurecht H. Novak N. Rodríguez E. Bej S. Mayr G. Emmert H. Stölzl D. Gerdes S. Jung E.S. Protein-Coding Variants Contribute to the Risk of Atopic Dermatitis and Skin-Specific Gene Expression J. Allergy Clin. Immunol. 2020 145 1208 1218 10.1016/j.jaci.2019.10.030 31707051 45. Watanabe K. Stringer S. Frei O. Umićević Mirkov M. de Leeuw C. Polderman T.J.C. van der Sluis S. Andreassen O.A. Neale B.M. Posthuma D. A Global Overview of Pleiotropy and Genetic Architecture in Complex Traits Nat. Genet. 2019 51 1339 1348 10.1038/s41588-019-0481-0 31427789 46. The GTEx Consortium The GTEx Consortium Atlas of Genetic Regulatory Effects across Human Tissues Science 2020 369 1318 1330 10.1126/science.aaz1776 32913098 PMC7737656 47. Bulik-Sullivan B. Finucane H.K. Anttila V. Gusev A. Day F.R. Loh P.-R. ReproGen Consortium Psychiatric Genomics Consortium Genetic Consortium for Anorexia Nervosa of the Wellcome Trust Case Control Consortium 3 Duncan L. An Atlas of Genetic Correlations across Human Diseases and Traits Nat. Genet. 2015 47 1236 1241 10.1038/ng.3406 26414676 PMC4797329 48. Ray D. Chatterjee N. A Powerful Method for Pleiotropic Analysis under Composite Null Hypothesis Identifies Novel Shared Loci between Type 2 Diabetes and Prostate Cancer PLoS Genet. 2020 16 e1009218 10.1371/journal.pgen.1009218 33290408 PMC7748289 49. Watanabe K. Taskesen E. van Bochoven A. Posthuma D. Functional Mapping and Annotation of Genetic Associations with FUMA Nat. Commun. 2017 8 1826 10.1038/s41467-017-01261-5 29184056 PMC5705698 50. Wang K. Li M. Hakonarson H. ANNOVAR: Functional Annotation of Genetic Variants from High-Throughput Sequencing Data Nucleic Acids Res. 2010 38 e164 10.1093/nar/gkq603 20601685 PMC2938201 51. de Leeuw C.A. Mooij J.M. Heskes T. Posthuma D. MAGMA: Generalized Gene-Set Analysis of GWAS Data PLoS Comput. Biol. 2015 11 e1004219 10.1371/journal.pcbi.1004219 25885710 PMC4401657 52. Foley C.N. Staley J.R. Breen P.G. Sun B.B. Kirk P.D.W. Burgess S. Howson J.M.M. A Fast and Efficient Colocalization Algorithm for Identifying Shared Genetic Risk Factors across Multiple Traits Nat. Commun. 2021 12 764 10.1038/s41467-020-20885-8 33536417 PMC7858636 53. Hunt S.E. Moore B. Amode R.M. Armean I.M. Lemos D. Mushtaq A. Parton A. Schuilenburg H. Szpak M. Thormann A. Annotating and Prioritizing Genomic Variants Using the Ensembl Variant Effect Predictor—A Tutorial Hum. Mutat. 2022 43 986 997 10.1002/humu.24298 34816521 PMC7613081 54. Zhu Z. Zhang F. Hu H. Bakshi A. Robinson M.R. Powell J.E. Montgomery G.W. Goddard M.E. Wray N.R. Visscher P.M. Integration of Summary Data from GWAS and eQTL Studies Predicts Complex Trait Gene Targets Nat. Genet. 2016 48 481 487 10.1038/ng.3538 27019110 55. Burgess S. Thompson S.G. CRP CHD Genetics Collaboration Avoiding Bias from Weak Instruments in Mendelian Randomization Studies Int. J. Epidemiol. 2011 40 755 764 10.1093/ije/dyr036 21414999 56. Burgess S. Butterworth A. Thompson S.G. Mendelian Randomization Analysis with Multiple Genetic Variants Using Summarized Data Genet. Epidemiol. 2013 37 658 665 10.1002/gepi.21758 24114802 PMC4377079 57. Higgins J.P.T. Thompson S.G. Deeks J.J. Altman D.G. Measuring Inconsistency in Meta-Analyses BMJ 2003 327 557 560 10.1136/bmj.327.7414.557 12958120 PMC192859 58. Burgess S. Thompson S.G. Interpreting Findings from Mendelian Randomization Using the MR-Egger Method Eur. J. Epidemiol. 2017 32 377 389 Erratum in Eur. J. Epidemiol. 2017 32 10.1007/s10654-017-0276-5 28527048 PMC5506233 59. Bowden J. Davey Smith G. Haycock P.C. Burgess S. Consistent Estimation in Mendelian Randomization with Some Invalid Instruments Using a Weighted Median Estimator Genet. Epidemiol. 2016 40 304 314 10.1002/gepi.21965 27061298 PMC4849733 60. Verbanck M. Chen C.-Y. Neale B. Do R. Detection of Widespread Horizontal Pleiotropy in Causal Relationships Inferred from Mendelian Randomization between Complex Traits and Diseases Nat. Genet. 2018 50 693 698 10.1038/s41588-018-0099-7 29686387 PMC6083837 Figure 1 The workflow of the current study. Figure 2 Pleiotropic architecture of atopic dermatitis and autoimmune diseases. ( a b 7 Table S2 Figure 3 Summary-based mendelian randomization estimates from VEP-prioritized genes ( Table S5 7 30 p p HEIDI p p HEIDI Table S6 Figure 4 Mendelian randomization estimates when ( a b p ijms-26-09124-t001_Table 1 Table 1 Summary of genome-wide association studies used in the study. Disease Sample Size Cases Controls Ancestry Authors AD [ 7 864,982 60,653 804,329 European Budu Aggrey et al., 2023 IBD [ 24 59,957 25,042 34,915 European de Lange et al., 2017 RA [ 25 97,173 22,350 74,823 European Ishigaki et al., 2022 Vitiligo [ 26 44,266 4680 39,586 European Jin et al., 2016 Abbreviations: AD, atopic dermatitis; IBD, inflammatory bowel disease; RA, rheumatoid arthritis. ijms-26-09124-t002_Table 2 Table 2 Multi-trait colocalization results using HyPrColoc. Genomic Coordinates Colocalized Traits PP SNP SNP.PP Mapped Genes AD GWAS p chr1:7900638-8739302 RA, vitiligo, AD 0.7127 rs301799 0.3816 RERE RERE-AS1 1.43 × 10 −7 chr1:114053808-114573318 IBD, RA, vitiligo, AD 0.8452 rs6679677 0.7535 PTPN22 AP4B1-AS1 RSBN1 PHTF1 7.18 × 10 −6 chr1:154170087-154675456 RA, AD 0.8875 rs12133641 0.5913  IL6R 1.72 × 10 −21 chr2:111658567-112183001 IBD, RA, vitiligo, AD 0.9422 rs72837826 0.9039 BCL2L11 MIR4435-2HG ENSG00000295185 2.82 × 10 −6 chr5:176544191-177044191 IBD, AD 0.7366 rs12654812 0.6639  RGS14 7.66 × 10 −8 chr6:90680513-91226768 IBD, vitiligo, AD 0.7597 rs17513531 0.1207  BACH2 3.85 × 10 −10 chr6:106417535-106917535 RA, AD 0.8917 rs9372120 0.34 ATG5 U4 ENSG00000303838 RN7SL47P 1.08 × 10 −7 chr6:159222295-159739791 RA, AD 0.8782 rs212389 0.8069 ENSG00000285492 TAGAP-AS1 TAGAP 1.82 × 10 −11 chr8:21519432-22019432 IBD, AD 0.9431 rs56094005 0.5426  DOK2 9.35 × 10 −9 chr8:126341392-126858642 RA, AD 0.7486 rs28550378 0.3259  ENSG00000302425 3.91 × 10 −15 chr8:129302491-129802540 IBD, RA, vitiligo, AD 0.7118 rs938650 0.5337 LINC00824 ENSG00000298619 ENSG00000298640 3.75 × 10 −5 chr9:123441237-123941237 RA, AD 0.6172 rs1930785 0.097 TRAF1 C5 PHF19 ENSG00000306516 3.41 × 10 −5 chr11:36187868-36735919 IBD, AD 0.6701 rs28520436 0.316  PRR5L 1.22 × 10 −24 chr11:118492800-118992800 RA, AD 0.9434 rs74541740 0.1599 ENSG00000306274 ENSG00000306318 2.19 × 10 −10 chr12:56134804-56694632 RA, AD 0.984 rs705699 0.6027 CDK2 RAB5B PMEL SUOX 3.31 × 10 −9 chr12:111634608-112257756 IBD, RA, vitiligo, AD 0.9443 rs3184504 0.7639 SH2B3 ATXN2 1.56 × 10 −8 chr14:75731856-76231856 RA, AD 0.9868 rs175714 0.8197  ENSG00000297883 1.44 × 10 −7 chr14:88176297-88676297 IBD, AD 0.9252 rs4462528 0.4761 GALC SHLD2P2 5.99 × 10 −6 chr14:105273663-105773663 IBD, AD 0.7636 rs7147439 0.5047 LINC02298 GPR132 ENSG00000307140 4.71 × 10 −8 chr16:50763434-51263434 IBD, AD 0.6399 rs12324931 1  CYLD 0.000261 chr17:38507789-39007789 IBD, AD 0.8969 rs1358175 0.6417  ENSG00000279775 1.99 × 10 −11 chr18:59759814-60272811 RA, AD 0.9242 rs4574025 0.5308  TNFRSF11A 1.48 × 10 −6 Abbreviations: PP, posterior probability; SNP, single-nucleotide polymorphism; AD, atopic dermatitis; GWAS, genome-wide association study; IBD, inflammatory bowel disease; RA, rheumatoid arthritis. ",
  "metadata": {
    "Title of this paper": "Detection of Widespread Horizontal Pleiotropy in Causal Relationships Inferred from Mendelian Randomization between Complex Traits and Diseases",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470386/"
  }
}