{
  "title": "Paper_287",
  "abstract": "pmc Haematologica Haematologica 820 haematol HAEMA Haematologica 0390-6078 1592-8721 Ferrata Storti Foundation PMC12485312 PMC12485312.1 12485312 12485312 40241543 10.3324/haematol.2024.287231 1 Article - Myeloproliferative Disorders A phase I/IIa trial of PXS-5505, a novel pan-lysyl oxidase inhibitor, in advanced myelofibrosis Vachhani Pankit  1 Tan Peter  2 Watson Anne-Marie  3 Wu Shang-Ju  4 Baker Ross  5 Cheung Stanley  6 Lee Sung-Eun  7 Chen Chih-Cheng  8 Chen Tsai-Yun  9 Hsiao Hui-Hua  10 Lee Jae Hoon  11 Masarova Lucia  12 Tan Shuh Ying  13 Baskar Jana  14 Charlton Brett  14 Findlay Alison  14 Hamprecht Dieter  14 Jarolimek Wolfgang  14 Leadbetter Joanna  14 Miller John  14 Morgan Kristen  14 Zahoor Amna  14 Hobbs Gabriela  15 Contributions PV was responsible for the concept of this paper, contributed to the literature search and data collection, contributed patients, analyzed and interpreted data, and critically revised the manuscript. GH and JB were responsible for the concept of this paper, contributed to the literature search and data collection, analyzed and interpreted data, and critically revised the manuscript. AF, JL and JM were responsible for the concept of the paper, analyzed and interpreted data, and wrote the manuscript. PV, PT, A-MW, S-JW, RB, SC, S-EL, C-CC, T-YC, H-HH, J-HL, LM and SYT contributed patients and critically revised the manuscript. All authors reviewed, revised, and provided final approval of the manuscript. 1 University of Alabama USA 2 3 4 National Taiwan University Hospital and National Taiwan University College of Medicine 5 Perth Blood Institute, Murdoch University 6 7 The Catholic University of Korea 8 9 College of Medicine, National Cheng Kung University 10 11 Gachon University Gil Hospital 12 The University of Texas MD Anderson Cancer Center USA 13 14 15 USA J. Baskar jana.baskar@syntaratx.com.au  Disclosures  PV has received honoraria from Incyte and Blueprint Medicines and has consulted for AbbVie, Amgen, Blueprint Medicines, Cogent Biosciences, DISC medicine, Incyte, CTI BioPharma Corp (now Sobi), Genentech, Geron, GSK, Karyopharm, Merck, MorphoSys, Novartis, Pfizer, Stemline, Servier and Takeda. A-MW has served on a Data Safety Monitoring Board for Syntara Limited. RB has received grants from Bayer, Takeda, Syntara, Pfizer, Daiichi Sankyo, CSL Behring, Roche, Amgen, Celgene, Rigel Pharmaceuticals, Ionis Pharmaceuticals, AbbVie, Sanofi, MorphoSys AG, Acerta Pharma, Janssen-Cilag, Bristol Myers Squibb, Boehringer Ingelheim and Astra Zeneca; has received honoraria from Bayer, Bristol Myers Squibb, Cardinal Health and Astra Zeneca; and has participated in Data Safety Monitoring Boards for Roche, Janssen-Cilag, CSL Behring, Pharmaxis and George Institute. H-HH has received consulting fees from Bristol Myers Squibb, Novartis and GSK and has participated in Data Safety Monitoring Boards for Bristol Myers Squibb, Novartis and GSK. LM has received support for attending meetings from GSK and has participated in Data Safety Monitoring Boards for GSK, MorphoSys, Cogent and Pharma Essentia. SYT has received honoraria from Pfizer and Otsuka. JB is an employee of Syntara Limited; has been a member of Syntara Data Safety Monitoring Boards; and holds stocks and/or stock options in Syntara Limited. BC is a medical consultant to Syntara Limited; has been a member of Syntara Data Safety Monitoring Boards; and holds stocks in Syntara Limited. AF, DH, WJ, JL, JM, KM and AZ are employees of Syntara Limited and hold stock and/or stock options in Syntara Limited. 17 4 2025 01 10 2025 110 10 498052 2376 2387 24 12 2024 11 4 2025 17 04 2025 02 10 2025 02 10 2025 Copyright© 2025 Ferrata Storti Foundation https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution Noncommercial License ( by-nc 4.0 Myelofibrosis is a progressive disease characterized by accumulation of extracellular matrix in the bone marrow (BM), which impairs normal hematopoiesis. While Janus kinase inhibitors reduce spleen volume and provide symptomatic improvement, they do not resolve BM fibrosis and may cause or exacerbate anemia and thrombocytopenia. An antifibrotic therapy capable of normalizing the BM microenvironment and function remains a significant gap in the current treatment landscape. Myelofibrosis is associated with elevated expression of lysyl oxidases, enzymes responsible for maturation of the most abundant extracellular matrix proteins: collagen and elastin. PXS-5505 is a novel pan-lysyl oxidase inhibitor designed to exert an antifibrotic effect by preventing the cross-linking of collagen and elastin. PXS5505-MF-101 is a multicenter phase I/IIa study of PXS-5505 in myelofibrosis patients which included a dose escalation phase (DEP) and a cohort expansion phase (CEP). Primary objectives of the study were to determine the safety and tolerability of PXS-5505 and to define dosing for future studies. The DEP demonstrated that the highest dose tested, 200 mg BID, was safe and achieved robust systemic reduction of lysyl oxidase activity; this dose was, therefore, selected for the CEP. Twenty-four patients (median age 72 years) with relapsed or refractory myelofibrosis were recruited into the CEP and 54% (13/24) completed 24 weeks of treatment. PXS-5505 was well tolerated and reached steady-state concentrations by day 28. Over the 24-week treatment period preliminary indications of clinical efficacy, including a reduction in BM collagen, were evident. Overall, these data support continued investigation of PXS-5505. (ClinicalTrials.gov identifier: NCT04676529 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Myelofibrosis (MF) is a chronic myeloproliferative neoplasm characterized by the replacement of normal, hematopoietic bone marrow (BM) tissue with fibrous scar-like tissue rich in extracellular matrix (ECM) proteins. 1 2 The formation and removal of BM connective tissue fibers are typically in dynamic equilibrium. 3 4 Assessment of lysyl oxidase expression in human myeloproliferative neoplasms revealed elevated levels of four of the five isoforms (LOXL4 was not studied). 5 6 7 8 Figure 1 4 9 10 8 11 In humans, PXS-5505 has been administered to healthy male volunteers as single (up to 300 mg) and repeated (up to 200 mg) daily doses for 14 days. 12 13 We conducted a multicenter, phase I/IIa trial to determine the safety and tolerability of PXS-5505 in patients with primary, post-polycythemia vera (PV) or post-essential thrombocythemia (ET) MF who had relapsed on, were refractory to or were ineligible for JAK inhibitor treatment (Clinicaltrials.gov identifier: NCT04676529 Methods Study design The DEP followed a 3+3 design with a starting dose of 100 mg BID escalating to 150 and 200 mg BID with a treatment duration of 28 days. Intra-patient dose escalation was allowed and patients participating in the DEP phase were able to continue on the CEP. In the CEP, 24 patients were treated at the dose determined appropriate based on safety, pharmacokinetic and pharmacodynamic results from the DEP, for a period of up to 6 months with on study assessments at weeks 0, 1, 4, 12, 18 and 24. Dosing and administration are further described in the Online Supplement (Section 3). Figure 1. Mode of action of PXS-5505 in myelofibrosis. et al. 29 Patients Eligible patients were ≥18 years old with primary MF or post-ET/PV MF per the World Health Organization (WHO) 2016 criteria with at least grade 2 BM fibrosis. 14 15 16 9 Online Supplementary Tables S9, S10. Outcomes The primary objective of the trial was to determine the safety and tolerability of PXS-5505. Other key objectives included characterization of pharmacokinetic and pharmacodynamic parameters to determine the most appropriate therapeutic dose. Efficacy assessments included symptom assessment (MFSAF v4.0 7-day recall), BM biopsy and spleen volume. Plasma samples for pharmacokinetic and pharmacodynamic analysis during the DEP were obtained at weeks 0, 1 and 4 of the dosing cycle. Blood samples were collected at t=0 (pre-dose), 1 hour (±5 mins), and 4 hours (±15 mins) post-dose for assessment of pre-dose=C min 1hr max Statistical methods Data are summarized; no formal statistical testing was performed. All subjects enrolled were included in the assessment of safety; pharmacokinetic and pharmacodynamic assessments were performed on patients who provided samples at each timepoint and with no major compliance or sample analysis issues; efficacy assessments focused on those who completed the assessments after 24 weeks of treatment. Continuous measures are summarized using means and standard deviations or medians and ranges; proportions are summarized with the total number of subjects included in the assessment, frequency counts and percentages. Further details on statistical methods are described in Online Supplementary Table S11. Ethics statement The trial was approved by the relevant Institutional Review Board or Independent Ethics Committee at each site and conducted in accordance with the Declaration of Helsinki. Written informed consent was obtained from all study participants and/or their legal guardians. Results Patients’ characteristics From March 2021 until November 2023, a total of 27 patients were enrolled in the PXS5505-MF-101 (MF-101) study at 14 sites in the USA, Australia, South Korea and Taiwan (DEP N=5; CEP N=24; 2 patients participated in DEP and CEP) ( Figure 2 Table 1 Lysyl oxidases as biomarkers of myelofibrosis Lysyl oxidases are upregulated in the BM of MF patients. 5 17 18 Figure 3A Figure 3B Figure 3C Figure 3D 6 Dose escalation phase Five female patients (median age 71 years) were enrolled ( Table 1 Figure 2 There were no suspected unexpected serious adverse reactions or dose limiting toxicities and the majority (86%, 19/22) of adverse events were grade 1-2. A 77-year-old female with a past medical history of hypertension, hypercholesterolemia, osteoarthritis and subdural hematoma terminated early from the 100 mg BID cohort following transformation of her disease to acute myeloid leukemia (23 days after treatment initiation) which was reported as a serious adverse event considered by the investigator to be definitely not treatment-related. This patient died 17 days later. There were no other adverse events leading to treatment discontinuation and all other patients completed dosing without interruption. There were two hematologic events; a grade 4 platelet count decrease on 100 mg BID, and a grade 3 anemia on 150 mg BID, both considered not related to treatment; no changes were made to treatment as a result of these events. There was one adverse event considered by the investigator to be treatment-related, a grade 1 event of peripheral edema occurring at the 150 mg BID dose level (which did not require dose adjustment or interruption). The patient continued to 200 mg BID in the DEP and into the CEP. A summary of adverse events occurring in more than one patient, split by those occurring in the DEP and CEP, is shown in Table 2 During the DEP, PXS-5505 plasma concentrations were measured at days 0, 7 and 28 (pre-dose, 1 hour and 4 hours post-dose). PXS-5505 plasma concentrations peaked at 1 hour after drug intake at the 150 and 200 mg dose levels, whereas maximum levels were reached at 4 hours after drug intake at the lowest dose level of 100 mg BID ( Figure 4A 8 Figure 2. Patients’ disposition in the dose escalation and cohort expansion phases. The activities of LOX ( Figure 4B Figure 4C The 200 mg BID dose achieved the strongest inhibition of LOX and LOXL2 of all doses tested and, importantly, variability (with regards to the level of target engagement) between patients was low (compared to 100 and 150 mg BID). After a review of all safety and pharmacokinetic data by the Safety Monitoring Committee, 200 mg BID was, therefore, selected as the dose for the CEP. Cohort expansion phase Twenty-four patients were enrolled including two continuing from the DEP ( Figure 2 9 Figure 2 Table 2 There was one fatal adverse event on treatment. A 75-year-old male with history of ischemic heart disease, hypertension, paroxysmal atrial fibrillation, peripheral sensory neuropathy and grade 4 decreased neutrophil count at baseline had two events of grade 3 febrile neutropenia which recovered after two short hospital admissions. The last admission for febrile neutropenia resulted in multi-organ failure and death. All three events of febrile neutropenia were considered by the investigator to be unrelated to treatment. There were two fatal post-treatment discontinuation/completion events (sepsis, acute myocardial infarction), both considered by the investigator to be unrelated to treatment. Eight patients had a total of 22 serious adverse events, with only one (pneumonia) considered to be possibly related to treatment. Figure 3. Elevated LOX and LOXL2 concentrations and activities in myelofibrosis patients compared to those in healthy subjects. t P P Online Supplementary Table S12. Cytopenias were infrequent; anemia occurred in two patients (1 grade 3 considered not related and 1 grade 4 considered possibly related to treatment) and one patient had a grade 3 decrease in platelet count (considered possibly related to treatment). There were five non-hematologic adverse events considered related to treatment, all grade 1 or 2, across four different system organ classes. Details are provided in Online Supplementary Tables S16 S17 19 Table 1. Baseline characteristics and clinical characteristics in the dose escalation and cohort expansion phases. PXS-5505 plasma concentrations were evaluated on days 0, 28, 84 and 168 (pre-dose, 1 hour and 4 hours post-dose) ( Figure 5A Figure 5B Figure 5C Disease response While this study was primarily designed to assess the safety and tolerability of PXS-5505 and measure pharmacokinetics and pharmacodynamics to define therapeutic dosing for future studies, some indications of disease stabilization and clinical improvement were observed. Across the 24-week treatment period, 62% (8/13) of patients had at least a ≥20% reduction in total symptom score at some point (12 or 24 weeks or both), and two (15%) achieved ≥50% reduction at 24 weeks. The median best symptom score percentage change at any time during treatment was -26% (range, -78% to +220%) with a median best absolute change of -5 (range, -20 to +22). Table 2. Summary of adverse events regardless of study drug relationship occurring in more than one patient (across the dose escalation and cohort expansion phases) by preferred term. Overall, hemoglobin concentration, platelet counts and white blood cell counts were stable, not only in patients who had just come off JAK inhibitor therapy but also in patients who had a longer interval between treatments (>28 days) ( Online Supplementary Figures S2-S4 Of the 13 patients who completed the 24 weeks of treatment, the median platelet count was 109x10 9 9 9 Figure 6 The median absolute hemoglobin level change at week 24 was -4 g/L (range, -32 to +17) and eight of the 13 patients had stable or improved hemoglobin levels, including one patient who had an anemia response (hemoglobin increase >20 g/L with no transfusion) at week 18 ( Figure 6 Of the 12 patients who had spleen volume measurements performed at both baseline and week 24, the median change was an increase of 22% (range -10% to +154%). It should be noted that baseline spleen volume assessments could be performed any time in the 6 weeks prior to the first dose of PXS-5505 (7/12 patients had the baseline measurement in the CEP within 28 days of the last dose of JAK inhibitor and 2 of these on the last day of JAK inhibitor dosing). Fibrosis grade (reticulin and collagen) was centrally assessed in the CEP only; 12 patients had baseline, week 12 and week 24 biopsies that could be graded (for 1 patient the baseline biopsy sample could not be analyzed due to minimal assessable hematopoietic tissue). 20 For these patients the reticulin fibrosis grade remained stable over 24 weeks of therapy. Collagen fibrosis improved by one grade in 42% (5/12), worsened in 25% (3/12) and was unchanged in the remainder over the study period ( Table 3 20 Discussion Regulatory approval of the first JAK inhibitor, ruxolitinib, fundamentally improved standard of care for MF patients by providing symptomatic relief and ameliorating splenomegaly. 21 Figure 4. Pharmacokinetics and pharmacodynamics of PXS-5505 in the dose escalation phase. Figure 5. Pharmacokinetics and pharmacodynamics of PXS-5505 in the cohort expansion phase. Online Supplementary Table S13 In recent years a previously under recognized aspect of MF, namely dysregulation of the ECM and BM, has been targeted clinically with a number of antifibrotic agents. Zinpentraxin alfa (previously PRM-151) is a recombinant human form of pentraxin-2, an endogenous regulator of the inflammatory and fibrotic response to tissue injury. 22 23 NCT01981850 24 Agents specifically directed towards reducing collagen cross-linking have also been evaluated clinically, with a LOXL2-specific antibody (simtuzumab) being the first of this class. 25 NCT01369498 17 26 Figure 6. Platelet count and hemoglobin concentration by patient and study week in the cohort expansion phase. Testament to the perceived importance of lysyl oxidases in BM fibrosis, 27 NCT04679870 28 While LOXL2 is undoubtedly an enzyme of importance with respect to the cross-linking of ECM collagens and elastin, and resulting increased stiffness and mechanical stress, it is not the only member of this enzyme family associated with MF. Indeed, primary MF is known to be accompanied by elevated levels of four of the five isoforms (LOXL4 was not studied) 5 6 9 29 9 7 Here we established an optimal dose of 200 mg BID in patients with primary MF or post-PV/ET MF. This dose was very well tolerated and resulted in excellent LOX and LOXL2 inhibition (>90% at trough concentration). Table 3. Collagen grade over time (by patient) in the cohort expansion phase. PXS-5505 was well tolerated with a good safety profile. The CEP also provided an opportunity to monitor theoretical safety issues relating to the mode of action. β-aminopropionitrile, the compound that pioneered exploration of this target class, caused a (reversible) increase in periosteal bone following treatment for 67 days. 19 Online Supplementary Table S15 In the CEP there were preliminary indications of improvements in collagen fibrosis and symptom score along with stable or improved blood counts including in those patients with severe thrombocytopenia. The absence of any significant hematologic adverse events positively differentiates PXS-5505 from JAK inhibitors and other emerging therapies. Taken together the findings from the 24-week CEP are encouraging given the poor prognosis seen after ruxolitinib discontinuation in MF patients. 30 31 The main limitations of this study are the open-label nature of the design and the limited treatment period which, while appropriate for determining the optimal dosing and establishing safety, are insufficient to achieve robust indicators of clinical antifibrotic response. Notably, in studies with the antifibrotic agent zinpentraxin alfa, longer treatment duration (72 weeks) was required to see improvements in hemoglobin, platelets, spleen and symptoms. 32 33 The limited options for treatment of MF offer symptomatic relief but do not adequately address BM fibrosis and their side effect profiles (particularly the development of cytopenias) often lead to treatment discontinuation and suboptimal dosing. 31 PXS-5505 provides an opportunity for a well-tolerated therapy that improves BM health by reducing cross-links and mechanical stress and also inhibits activation of PDGFR, with the overarching aim of restoring functional hematopoiesis. By preventing new fibrosis this novel mode of action allows intrinsic mechanisms to remove existing fibrosis and normalize BM homeostatic functions. PXS-5505 is well tolerated, with a distinct mode of action suitable for patients ineligible for, relapsed after or intolerant to JAK inhibitors. Moreover, the pharmacological action and low propensity for drug-drug interactions make it an ideal candidate for use in combination with JAK inhibitors as well as other novel therapies. The next phase of this study, which is underway at the time of manuscript submission, assesses PXS-5505 treatment in MF patients already receiving a stable dose of ruxolitinib for a period of 12 months to further explore safety and efficacy within the context of longer-term use. It is expected that the use of PXS-5505 in addition to ruxolitinib may provide a complementary approach in which the reduction of ECM fibrosis and mechanical stress, as well as regulation of abnormal cell growth and division, give rise to a more durable treatment response associated with improvements in symptoms and spleen volume and normalization of blood counts over time. Supplementary Material Supplementary Appendix  Data-sharing statement  All data reported within the manuscript and further may be available upon reasonable request to the corresponding author. The data will be provided in compliance with applicable privacy laws, data protection, and requirements for consent and anonymization. References 1. Tefferi A Primary myelofibrosis: 2023 update on diagnosis, risk-stratification, and management Am J Hematol 2023 98 5 801 821 36680511 10.1002/ajh.26857 2. Mascarenhas JO Verstovsek S. The clinical dilemma of JAK inhibitor failure in myelofibrosis: predictive characteristics and outcomes Cancer 2022 128 14 2717 2727 35385124 10.1002/cncr.34222 PMC9324085 3. Ghosh K Shome DK Kulkarni B Ghosh MK Ghosh K. Fibrosis and bone marrow: understanding causation and pathobiology J Transl Med 2023 21 1 703 37814319 10.1186/s12967-023-04393-z PMC10561412 4. Trackman PC Lysyl oxidase isoforms and potential therapeutic opportunities for fibrosis and cancer Expert Opin Ther Targets 2016 20 8 935 945 26848785 10.1517/14728222.2016.1151003 PMC4988797 5. Tadmor T Bejar J Attias D The expression of lysyl-oxidase gene family members in myeloproliferative neoplasms Am J Hematol 2013 88 5 355 358 23494965 10.1002/ajh.23409 6. Piasecki A Leiva O Ravid K. Lysyl oxidase inhibition in primary myelofibrosis: a renewed strategy Arch Stem Cell Ther 2020 1 1 23 27 33738462 10.46439/stemcell.1.005 PMC7968867 7. Leiva O Ng SK Matsuura S Novel lysyl oxidase inhibitors attenuate hallmarks of primary myelofibrosis in mice Int J Hematol 2019 110 6 699 708 31637674 10.1007/s12185-019-02751-6 PMC7503219 8. Chitty JL Yam M Perryman L A first-in-class pan-lysyl oxidase inhibitor impairs stromal remodeling and enhances gemcitabine response and survival in pancreatic cancer Nat Cancer 2023 4 9 1326 1344 37640930 10.1038/s43018-023-00614-y PMC10518255 9. Eliades A Papadantonakis N Bhupatiraju A Control of megakaryocyte expansion and bone marrow fibrosis by lysyl oxidase J Biol Chem 2011 286 31 27630 27638 21665949 10.1074/jbc.M111.243113 PMC3149354 10. Yao Y Findlay A Stolp J Rayner B Ask K Jarolimek W. Pan-lysyl oxidase inhibitor PXS-5505 ameliorates multiple-organ fibrosis by inhibiting collagen crosslinks in rodent models of systemic sclerosis Int J Mol Sci 2022 23 10 5533 35628342 10.3390/ijms23105533 PMC9146019 11. Burchard PR Ruffolo LI Ullman NA Pan-lysyl oxidase inhibition disrupts fibroinflammatory tumor stroma, rendering cholangiocarcinoma susceptible to chemotherapy Hepatol Commun 2024 8 8 e05202 10.1097/HC9.0000000000000502 PMC11299993 39101793 12. Australian New Zealand Clinical Trial Registry A single ascending dose and multiple ascending dose phase 1 study to evaluate safety tolerability, pharmacokinetics (PK), and pharmacodynamics of PXS-5505A administered orally in healthy adult males https://anzctr.org.au/Trial/Registration/TrialReview.aspx?ACTRN=12619000332123 2025 13. How J Liu Y Lombardi Story J Evaluation of a pan-lysyl oxidase inhibitor, PXS-5505, in myelofibrosis: a phase I, randomized, placebo controlled double blind study in healthy adults Blood. 2020 136 Supplement 1 16 14. Barbui T Thiele J Gisslinger H The 2016 WHO classification and diagnostic criteria for myeloproliferative neoplasms: document summary and in-depth discussion Blood Cancer J 2018 8 2 15 29426921 10.1038/s41408-018-0054-y PMC5807384 15. Arber DA Orazi A Hasserjian R The 2016 revision to the World Health Organization classification of myeloid neoplasms and acute leukemia Blood 2016 127 20 2391 2405 27069254 10.1182/blood-2016-03-643544 16. Cardellino A Zhang S Phiri K Gelhorn H Cutts K. Patient (pt) interview-based content validation of the Myelofibrosis Symptom Assessment Form version 4.0 (MFSAF v4.0) J Clin Oncol. 2024 42 e23106 17. Findlay A Turner C Schilter H An activity‐based bioprobe differentiates a novel small molecule inhibitor from a LOXL2 antibody and provides renewed promise for anti‐fibrotic therapeutic strategies Clin Transl Med 2021 11 11 e572 34841699 10.1002/ctm2.572 PMC8571951 18. Yang N Cao DF Yin XX Zhou HH Mao XY Lysyl oxidases: emerging biomarkers and therapeutic targets for various diseases Biomed Pharmacother 2020 131 110791 33152948 10.1016/j.biopha.2020.110791 19. Keiser HR Sjoerdsma A. Studies on beta-aminopropionitrile in patients with scleroderma Clin Pharmacol Ther 1967 8 4 593 602 4951976 10.1002/cpt196784593 20. Kvasnicka HM Beham-Schmid C Bob R Problems and pitfalls in grading of bone marrow fibrosis, collagen deposition and osteosclerosis - a consensus-based study Histopathology 2016 68 6 905 915 26402166 10.1111/his.12871 21. Verstovsek S Mesa RA Livingston RA Hu W Mascarenhas J. Ten years of treatment with ruxolitinib for myelofibrosis: a review of safety J Hematol Oncol 2023 16 1 82 37501130 10.1186/s13045-023-01471-z PMC10373260 22. Verstovsek S Talpaz M Wadleigh M A randomized, double-blind study of zinpentraxin alfa in patients with myelofibrosis who were previously treated with or ineligible for ruxolitinib: stage 2 of a phase II trial Haematologica 2024 109 6 1977 1983 38268448 10.3324/haematol.2023.284410 PMC11141656 23. Verstovsek S Foltz L Gupta V Safety and efficacy of zinpentraxin alfa as monotherapy or in combination with ruxolitinib in myelofibrosis: stage I of a phase II trial Haematologica 2023 108 10 2730 2742 37165840 10.3324/haematol.2022.282411 PMC10543197 24. Ryou H Sirinukunwattana K Wood R Quantitative analysis of bone marrow fibrosis highlights heterogeneity in myelofibrosis and augments histological assessment: an insight from a phase II clinical study of zinpentraxin alfa Hemasphere 2024 8 6 e105 38884042 10.1002/hem3.105 PMC11176199 25. Verstovsek S Savona MR Mesa RA A phase 2 study of simtuzumab in patients with primary, post-polycythaemia vera or post-essential thrombocythaemia myelofibrosis Br J Haematol 2017 176 6 939 949 28220932 10.1111/bjh.14501 26. Bell JA Davies ER Brereton CJ Spatial transcriptomic validation of a biomimetic model of fibrosis enables reevaluation of a therapeutic antibody targeting LOXL2 Cell Rep Med 2024 5 9 101695 39173635 10.1016/j.xcrm.2024.101695 PMC11524965 27. Leiva O Ng SK Chitalia S Balduini A Matsuura S Ravid K. The role of the extracellular matrix in primary myelofibrosis Blood Cancer J 2017 7 2 e525 28157219 10.1038/bcj.2017.6 PMC5386340 28. Harrison C Mascarenhas J Cilloni D P1024: MYLOX-1: a phase II study evaluating the safety, tolerability, pharmacokinetics and pharmacodynamics of oral LOLX2 inhibitor GB2064 (with focus on bone marrow collagen) in patients with myelofibrosis Hemasphere. 2023 7 e87048 29. Lucero HA Ravid K Grimsby JL Lysyl oxidase oxidizes cell membrane proteins and enhances the chemotactic response of vascular smooth muscle cells J Biol Chem 2008 283 35 24103 24117 18586678 10.1074/jbc.M709897200 PMC2527118 30. Palandri F Breccia M Bonifacio M Life after ruxolitinib: reasons for discontinuation, impact of disease phase, and outcomes in 218 patients with myelofibrosis Cancer 2020 126 6 1243 1252 31860137 10.1002/cncr.32664 31. Kuykendall AT Shah S Talati C Between a rux and a hard place: evaluating salvage treatment and outcomes in myelofibrosis after ruxolitinib discontinuation Ann Hematol 2018 97 3 435 441 29189896 10.1007/s00277-017-3194-4 32. Verstovsek S Mesa RA Foltz LM PRM-151 in myelofibrosis: durable efficacy and safety at 72 weeks Blood 2015 126 23 56 33. Palandri F Palumbo GA Elli EM Ruxolitinib discontinuation syndrome: incidence, risk factors, and management in 251 patients with myelofibrosis Blood Cancer J 2021 11 1 4 33414394 10.1038/s41408-020-00392-1 PMC7791065 ",
  "metadata": {
    "Title of this paper": "Ruxolitinib discontinuation syndrome: incidence, risk factors, and management in 251 patients with myelofibrosis",
    "Journal it was published in:": "Haematologica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485312/"
  }
}