{
  "title": "Paper_810",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472842 PMC12472842.1 12472842 12472842 41010445 10.3390/nu17182919 nutrients-17-02919 1 Article Synthetic Mimics of Wound-Induced Carrot MicroRNAs Affect Lipid Metabolism in Cultured Adipocytes Reza-Zaldívar Edwin E. Methodology Formal analysis Investigation Data curation Writing – original draft 1 2 https://orcid.org/0000-0002-9478-2570 Jacobo-Velázquez Daniel A. Conceptualization Software Investigation Resources Writing – review & editing Supervision Funding acquisition 1 * Dávalos Alberto Academic Editor 1 edwin.reza@tec.mx 2 * djacobov@tec.mx 10 9 2025 9 2025 17 18 497660 2919 12 8 2025 06 9 2025 06 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Daucus carota Methods: Results: Conclusions: cross-kingdom gene regulation plant-derived microRNAs adipogenesis lipolysis nutritional epigenetics carrot ( Daucus carota obesity This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Plant-based diets are widely recognized for their health-promoting potential, including a reduced risk of obesity and metabolic disorders. These benefits have traditionally been attributed to the high content of vitamins, fiber, and phytochemicals in fruits and vegetables. Carrots ( Daucus carota 1 MicroRNAs are ~20–24 nucleotide non-coding RNAs that regulate gene expression post-transcriptionally. The miRNAs typically bind to the 3′ untranslated regions of target mRNAs to repress translation or induce mRNA degradation, thereby influencing processes from development to metabolism. Plants likewise utilize miRNAs to regulate their own gene networks, especially under stress conditions [ 2 3 4 5 Initially, miRNAs were believed to only function within their species of origin. However, increasing evidence has triggered a debate about mammalian gene regulation through plant miRNAs acquired from their diet [ 6 7 8 9 10 11 Carrots represent an appealing model to investigate this phenomenon because they are a common dietary vegetable with known health benefits and a well-characterized repertoire of endogenous miRNAs. Like other plants, carrot expresses numerous miRNAs, including ones that respond to environmental stresses [ 12 2 13 Based on this background, we hypothesize that carrot-derived miRNAs, particularly those upregulated by wounding stress, can act as cross-kingdom regulators of gene expression in adipocytes and thereby influence lipid metabolism in a way that combats obesity. To test this hypothesis, the present study integrated bioinformatic and experimental approaches. We first performed high-throughput small RNA sequencing to identify miRNAs that are induced in carrots by wounding stress. Next, using target prediction algorithms and pathway enrichment analysis, we identified putative human gene targets of these carrot miRNAs and examined which biological pathways they might regulate. Finally, we selected several wound-induced carrot miRNAs and conducted in vitro functional assays by transfecting them into 3T3-L1 adipocytes, a well-established mouse cell model of fat cells, to evaluate their effects on lipid accumulation. By combining these approaches, our study aims to determine whether carrot-derived miRNAs can modulate adipocyte fat metabolism, providing new insights into how plant-based diets may exert cross-kingdom molecular interactions. 2. Materials and Methods 2.1. Wounding Stress Application in Carrots Fifteen kilograms of commercial-grade carrots without visible defects were selected for wounding stress experiments as previously described [ 14 2.2. Total RNA Isolation RNA extraction was performed using a TRIzol-based (Cat. T9424 Merck, Burlington, MA, USA) method following the manufacturer’s instructions. Carrot samples were frozen in liquid nitrogen, and approximately 300 mg of each tissue was ground into a fine powder and placed into 1.5 mL tubes. Following that, 1 mL of TRIzol reagent was added, vortexed, incubated for 5 min at RT, and then centrifuged at 12,000× g g 2.3. Small RNA Seq Sequencing libraries were constructed using 1 μg of RNA per sample and SMARTer smRNA-Seq Kit according to the manufacturer’s protocol. Library sequencing was carried out with the Illumina HiSeq platform and single-end sequencing. Once the sequencing data, the Illumina universal adaptors were trimmed from the raw reads with the command-line interface cutadapt v1.1.2.1 according to the SMARTer smRNA-Seq Kit manufacturer’s instructions, discarding reads with lengths of less than 18 nucleotides. Reads with an average base quality/Phred score < Q20 were removed using fqtrim v0.9.7. Sequence alignment against miRBase v22 was performed using Bowtie2 v.1.1.1 and the miRDeep2 software package v 0.1.3, allowing a maximum of one mismatch and up to 200 instances of multi-mapping (m = 200). Finally, a text file containing the miRNAs read counts was generated. The DESeq2 v 2.11 was used to analyze the DEG for samples applying thresholds of Fold Change ≥ 2.00 and padj ≤ 0.5. 2.4. Homo Sapiens Gene Target Prediction Human target genes were predicted using the psRNAtarget ( https://www.zhaolab.org/psRNATarget/ 15 Homo sapiens 16 2.5. Signaling Pathways Analysis The list of predicted targets was submitted to a functional annotation tool provided by the Database for Annotation, Visualization, and Integrated Discovery release v2025_1 (DAVID https://davidbioinformatics.nih.gov/ 17 p p 2.6. Pulsed Stem-Loop RT-qPCR From the identified miRNA, nine were further validated using stem-loop PCR and qPCR. Selected stem-loop RT primers were designed according to Chen et al. [ 18 19 Table 1 20 Table 1 The SYBR green qPCR assay was done by mixing 4 μL SYBR Green master mix (Cat. 100029284, Invitrogen, Waltham, MA, USA),1 μL 10 μM forward miRNA-specific primer ( Table 1 −ΔΔCt 2.7. Cell Culture and Transfection of Cells with miRNAs The 3T3-L1 cell line (ATCC, Manassas, VA, USA) was cultured under standard conditions with DMEM with high glucose (Cat. D7777 Merck, Burlington, MA, USA) supplemented with 10% calf serum (Cat. 35-054CM Corning, Corning, NY, USA). The culture was maintained in an incubator at 37 °C and a 5% CO 2 5 2 2.8. T3-L1 Cell Differentiation Transfected 3T3-L1 cells were differentiated to evaluate the potential anti-obesogenic effect of carrot miRNA mimics. Differentiation process was induced with DMEM-high glucose supplemented with 10% fetal bovine serum, 0.5 mM isobutyl-methyl-xanthine, 1 μM dexamethasone, and 5 μg/mL insulin (Cat. I5879, D4902, and I0516, Merck, Burlington, MA, USA) [ 19 2.9. Oil Red O Staining The oil red O staining procedure allows visual and quantitative identification of the lipids present within the lipid vacuoles of differentiated adipocytes [ 21 2.10. Free Glycerol Measurement Free glycerol levels were assessed following the differentiation of 3T3-L1 cells using a colorimetric kit (Cat. AB133130 2.11. Triglycerides Measurement Triglyceride accumulation was assessed post-differentiation of 3T3-L1 cells with a lipase-based kit (Cat. AB65336, Abcam, Cambridge, UK). In brief, harvested cells were resuspended in 1 mL of a 5% Triton X-100 solution, heated to 90 °C in a water bath for 5 min, and subsequently cooled to room temperature. This procedure was repeated twice. The solution was centrifuged at 10,000× g 2.12. Statistical Analysis The difference between the groups in culture assays was determined by the one-way analysis of variance (ANOVA), applying the Tukey post hoc test to analyze multiple comparisons. Data analysis was performed using the GraphPad Prism v10.4.2 software, and a statistically significant difference was considered when the value of p p 3. Results 3.1. Wounding Stress Alters Carrot miRNA Profiles The small RNA sequencing of wounded carrot tissues revealed a dynamic miRNA expression landscape ( Figure 1 16 Supplementary File S1 12 Arabidopsis thaliana 2 22 23 Differential expression (DE) analysis confirmed that wounding elicits pronounced changes in miRNA levels over time ( Figure 2 24 2+ Figure 2 Supplementary File S2 Daucus carota 12 Notably, key miRNAs identified as most responsive to wounding were validated by stem-loop RT-qPCR. Figure 3 Figure 3 3.2. Cross-Kingdom Target Predictions of Carrot miRNAs Emerging evidence suggests that dietary plant miRNAs can survive digestion and regulate gene expression in animals [ 9 10 15 Supplementary File S3 Figure 4 Such pathways are major regulatory hubs of energy balance and cell fate. Indeed, FoxO transcription factors are pivotal integrators of insulin signaling, stress responses, and aging, orchestrating processes from glucose homeostasis to adipogenesis [ 25 To further explore the health implications, we annotated the predicted gene targets for disease associations. Using DAVID and the Genetic Association Database (GAD), many target genes were linked to metabolic disorders, including obesity, dyslipidemia, and cardiovascular disease ( Figure 4 17 Taken together, these computational findings expand the nutritional significance of carrots beyond vitamins and fiber. They raise the possibility that carrot miRNAs act as bioactive dietary components capable of fine-tuning metabolism at the molecular level, echoing reports of other plant miRNAs influencing mammalian physiology [ 11 26 3.3. Carrot miRNAs Suppress Lipid Accumulation in Adipocytes From the wound-responsive miRNAs, six were prioritized for functional studies based on their persistence across stress conditions, higher read counts relative to T0, and predicted targets. To directly assess cross-kingdom functionality, we transfected several wound-induced carrot miRNAs into mouse 3T3-L1 adipocytes and measured their effects on fat storage. Remarkably, cells treated with carrot miRNA mimics (miR165a-3p, miR232a-5p, miR1799) accumulated significantly less lipid during differentiation compared to control cells. By day 12 post-transfection, Oil Red O staining revealed a 13–23% reduction in lipid droplet accumulation ( Figure 5 Figure 5 Concomitantly, adipocytes exposed to carrot miRNAs exhibited increased lipolysis. Free glycerol released into the culture medium, a byproduct of triglyceride breakdown, was over 40% higher in cells treated with the effective miRNAs than in controls, indicating enhanced fat catabolism ( Figure 5 Figure 5 These preliminary functional assays suggest that certain carrot miRNAs can interfere with adipocyte fat accumulation. Although the precise mechanisms remain under investigation, the observed phenotypes likely involve downregulation of pro-adipogenic genes or signaling pathways. For instance, miR165a-3p and others may target transcripts within the insulin or Wnt signaling cascades that drive adipogenesis [ 13 27 In contrast, the carrot miRNAs studied here produced the opposite outcome, reduced lipid stores, implying they may target genes that promote lipogenesis or differentiation. Supporting this idea, miR6262 from peach was shown to suppress RXRA and other nuclear receptors in fat cells, leading to reduced expression of lipid-storage genes such as PLIN1 11 Although the specific gene targets of carrot miRNAs in adipocytes remain to be experimentally validated, the phenotypic effects observed here strongly suggest functional cross-kingdom regulation of metabolic genes in mammalian adipose tissue. These results provide a promising foundation for future studies aimed at uncovering the molecular interactions between dietary miRNAs and host adipogenic pathways. 4. Discussion Our findings highlight a potential connection between the stress-induced miRNA profile of carrots and lipid accumulation in cultured adipocytes. Wounding carrots by shredding not only triggers a general decline in total miRNA species but also selectively boosts certain miRNAs (e.g., miR165a-3p, miR232a-5p, miR1799) that appear to carry bioactivity across kingdoms. The abundance changes measured in Figure 3 Figure 5 Importantly, our cross-kingdom approach offers a novel and complementary perspective to previous research on the health benefits of wound-stressed carrots. Reza-Zaldívar et al. [ 14 25 Figure 5 9 10 11 26 In contrast to our results, a study by Chen et al. [ 18 These functional differences open the door to precision nutrition strategies. By selectively consuming foods or extracts rich in anti-adipogenic plant miRNAs, one might be able to modulate fat formation in vivo. Although in vitro models like 3T3-L1 cannot fully capture the biological complexities of digestion, absorption, and tissue distribution, our data present a compelling proof of concept that plant miRNA mimics can modulate core metabolic pathways. From a practical standpoint, our results suggest an accessible dietary intervention: shredding carrots and allowing them to incubate for 24 h enhances their miRNA content, especially for miRNAs with anti-lipogenic effects. Interestingly, plant miRNAs are known to be chemically stable, owing to their 2′-O-methylated 3′ ends and packaging into vesicles, making them more resilient than many other dietary bioactives during cooking and gastrointestinal transit [ 9 28 Our study contributes to a growing paradigm shift in nutrition science: food is not just a source of macronutrients and vitamins, but also of regulatory molecules, including miRNAs. Although the concept of cross-kingdom gene regulation via diet remains debated, accumulating evidence supports the idea that specific plant miRNAs can influence mammalian physiology [ 10 11 The broader implications are exciting. One could imagine breeding or engineering vegetables to overexpress health-promoting miRNAs, or developing functional foods and supplements that deliver targeted miRNAs to regulate human metabolic pathways. Future diets might be designed not only for nutrient content but also for regulatory RNA composition. In this context, the humble carrot, viewed through the lens of miRNA biology, offers a striking example of how a common food can be leveraged for cross-kingdom metabolic benefits. 5. Conclusions In conclusion, this study demonstrates that miRNAs from a common dietary plant can exert regulatory control over mammalian cell metabolism. Carrot-derived miRNAs upregulated by post-harvest wounding stress were shown to attenuate adipogenesis and promote lipid catabolism in 3T3-L1 adipocytes. Specifically, transfection of carrot miRNA mimics (such as miR165a-3p, miR232a-5p, and miR1799) led to reduced fat accumulation and increased glycerol release, signifying a shift toward enhanced lipolysis. These findings provide evidence of a cross-kingdom regulatory mechanism, bridging plant stress physiology with mammalian metabolic regulation. The novelty of our work lies in identifying plant miRNAs (focusing on functional bioactive dietary components) that can influence adipocyte biology. By establishing a link between carrot wounding-induced miRNA profiles and anti-adipogenic effects in mammalian cells, we propose a new nutritional paradigm in which plant-derived small RNAs contribute to the health benefits of plant-based diets. This insight has significant practical relevance; it suggests that beyond traditional nutrients and phytochemicals, plant miRNAs could be harnessed as natural, food-based tools to modulate pathways involved in lipid metabolism and adipose tissue development. Further research, particularly in vivo studies, will be essential to determine the bioavailability of these plant miRNAs and to explore their potential in dietary strategies for managing obesity and metabolic disorders. Acknowledgments During the preparation of this work, the authors used ChatGPT, powered by OpenAI’s GPT-4.0 technology, to revise the English in the manuscript to improve readability and language. After using this tool, the authors reviewed and edited the content as needed and take full responsibility for the content of the publication. Disclaimer/Publisher’s Note: Supplementary Materials The supporting information can be downloaded at https://www.mdpi.com/article/10.3390/nu17182919/s1 Author Contributions Conceptualization, D.A.J.-V.; methodology, E.E.R.-Z. and D.A.J.-V.; formal analysis, E.E.R.-Z.; investigation, E.E.R.-Z. and D.A.J.-V.; resources, D.A.J.-V.; data curation, E.E.R.-Z.; writing—original draft preparation, E.E.R.-Z.; writing—review and editing, D.A.J.-V.; supervision, D.A.J.-V.; funding acquisition, D.A.J.-V. All authors have read and agreed to the published version of the manuscript. Data Availability Statement Small RNA-seq data are deposited in GEO under accession GSE307378 Conflicts of Interest The authors declare no conflicts of interest. References 1. Jacobo-Velázquez D.A. Transformation of carrots into novel food ingredients and innovative healthy foods Appl. Food Res. 2023 3 100303 10.1016/j.afres.2023.100303 2. Sunkar R. MicroRNAs with macro-effects on plant stress responses Semin. Cell Dev. Biol. 2010 21 805 811 10.1016/j.semcdb.2010.04.001 20398781 3. Wang X. Ren X. Ning L. Wang P. Xu K. Stability and absorption mechanism of typical plant miRNAs in an in vitro gastrointestinal environment: Basis for their cross-kingdom nutritional effects J. Nutr. Biochem. 2020 81 108376 10.1016/j.jnutbio.2020.108376 32330841 4. Luo Y. Wang P. Wang X. Wang Y. Mu Z. Li Q. Fu Y. Xiao J. Li G. Ma Y. Detection of dietetically absorbed maize-derived microRNAs in pigs Sci. Rep. 2017 7 645 10.1038/s41598-017-00488-y 28381865 PMC5428504 5. Chapado L.A. Martín-Hernández R. Hernández de la Red S. Tomé-Carneiro J. Gil-Zamorano J. Ruiz-Roso M.B. del Saz A. Crespo M.C. del Pozo-Acebo L. Arantes Ferreira Peres W. Connection between miRNA Mediation and the Bioactive Effects of Broccoli ( Brassica oleracea italica J. Agric. Food Chem. 2021 69 9326 9337 10.1021/acs.jafc.1c04087 34358423 6. Diener C. Keller A. Meese E. The miRNA–target interactions: An underestimated intricacy Nucleic Acids Res. 2023 52 1544 1557 10.1093/nar/gkad1142 PMC10899768 38033323 7. Olmi L. Pepe G. Helmer-Citterich M. Canini A. Gismondi A. Looking for Plant microRNAs in Human Blood Samples: Bioinformatics Evidence and Perspectives Plant Foods Hum. Nutr. 2023 78 399 406 10.1007/s11130-023-01063-9 37256506 PMC10363053 8. Liang G. Zhu Y. Sun B. Shao Y. Jing A. Wang J. Xiao Z. Assessing the survival of exogenous plant microRNA in mice Food Sci. Nutr. 2014 2 380 388 10.1002/fsn3.113 25473495 PMC4221836 9. Zhang L. Hou D. Chen X. Li D. Zhu L. Zhang Y. Li J. Bian Z. Liang X. Cai X. Exogenous plant MIR168a specifically targets mammalian LDLRAP1: Evidence of cross-kingdom regulation by microRNA Cell Res. 2012 22 107 126 10.1038/cr.2011.158 21931358 PMC3351925 10. Chin A.R. Fong M.Y. Somlo G. Wu J. Swiderski P. Wu X. Wang S.E. Cross-kingdom inhibition of breast cancer growth by plant miR159 Cell Res. 2016 26 217 228 10.1038/cr.2016.13 26794868 PMC4746606 11. Díez-Sainz E. Milagro F.I. Aranaz P. Riezu-Boj J.I. Lorente-Cebrián S. Plant miR6262 modulates the expression of metabolic and thermogenic genes in human hepatocytes and adipocytes Nutrients 2024 16 3146 10.3390/nu16183146 39339747 PMC11435339 12. Szymonik K. Klimek-Chodacka M. Łukasiewicz A. Macko-Podgórni A. Grzebelus D. Barański R. Comparative analysis of the carrot miRNAome in response to salt stress Sci. Rep. 2023 13 21506 10.1038/s41598-023-48900-0 38057586 PMC10700493 13. Reza-Zaldívar E.E. Jacobo-Velázquez D.A. Targeting metabolic syndrome pathways: Carrot microRNAs as potential modulators ACS Omega 2024 9 21891 21903 10.1021/acsomega.3c09633 38799337 PMC11112692 14. Reza-Zaldívar E.E. Bojorquez-Rodríguez E.M. Jacobo-Velázquez D.A. Wounding stress enhances the anti-obesogenic, anti-inflammatory, and antioxidant properties of carrots ( Daucus carota J. Agric. Food Res. 2024 16 101155 10.1016/j.jafr.2024.101155 15. Dai X. Zhuang Z. Zhao P.X. psRNATarget: A plant small RNA target analysis server (2017 release) Nucleic Acids Res. 2018 46 W49 W54 10.1093/nar/gky316 29718424 PMC6030838 16. Gismondi A. Nanni V. Monteleone V. Colao C. Di Marco G. Canini A. Plant miR171 modulates mTOR pathway in HEK293 cells by targeting GNA12 Mol. Biol. Rep. 2021 48 435 449 10.1007/s11033-020-06070-6 33386590 17. Huang D.W. Sherman B.T. Lempicki R.A. Systematic and integrative analysis of large gene lists using DAVID bioinformatics resources Nat. Protoc. 2009 4 44 57 10.1038/nprot.2008.211 19131956 18. Chen C. Ridzon D.A. Broomer A.J. Zhou Z. Lee D.H. Nguyen J.T. Barbisin M. Xu N.L. Mahuvakar V.R. Andersen M.R. Real-time quantification of microRNAs by stem-loop RT-PCR Nucleic Acids Res. 2005 33 e179 10.1093/nar/gni178 16314309 PMC1292995 19. Kramer M.F. Stem-loop RT-qPCR for miRNAs Curr. Protoc. Mol. Biol. 2011 95 15.10.1 15.10.15 10.1002/0471142727.mb1510s95 PMC3152947 21732315 20. Varkonyi-Gasic E. Hellens R.P. Quantitative stem-loop RT-PCR for detection of microRNAs Methods Mol. Biol. 2011 744 145 157 10.1007/978-1-61779-123-9_10 21533691 21. Zebisch K. Voigt V. Wabitsch M. Brandsch M. Protocol for effective differentiation of 3T3-L1 cells to adipocytes Anal. Biochem. 2012 425 88 90 10.1016/j.ab.2012.03.005 22425542 22. Pegler J.L. Oultram J.M.J. Grof C.P.L. Eamens A.L. Profiling the abiotic stress responsive microRNA landscape of Arabidopsis thaliana Plants 2019 8 58 10.3390/plants8030058 30857364 PMC6473545 23. Liu M. Yu H. Zhao G. Huang Q. Lu Y. Ouyang B. Profiling of drought-responsive microRNA and mRNA in tomato using high-throughput sequencing BMC Genom. 2017 18 481 10.1186/s12864-017-3869-1 PMC5485680 28651543 24. Zhang B. Wang Q. MicroRNA-based biotechnology for plant improvement J. Cell. Physiol. 2015 230 1 15 10.1002/jcp.24685 24909308 25. Lee S. Dong H.H. FoxO integration of insulin signaling with glucose and lipid metabolism J. Endocrinol. 2017 233 R67 R79 10.1530/JOE-17-0002 28213398 PMC5480241 26. López de Las Hazas M.D.C. Tomé-Carneiro J. Balaguer L. de la Peña G. Chapado L.A. Alonso-Bernáldez M. Del Saz-Lara A. Gil-Zamorano J. Burgos-Ramos E. Rodríguez-Pérez M. Dietary plant microRNAs as potential regulators of cellular cholesterol efflux Clin. Investig. Arterioscler. 2024 36 315 324 10.1016/j.arteri.2024.02.004 38584064 27. Chen T. Ma F. Peng Y. Sun R. Xi Q. Sun J. Zhang J. Zhang Y. Li M. Plant miR167e-5p promotes 3T3-L1 adipocyte adipogenesis by targeting β-catenin Vitr. Cell. Dev. Biol. Anim. 2022 58 471 479 10.1007/s11626-022-00702-w PMC9277600 35829897 28. Li D. Yang J. Yang Y. Liu J. Li H. Li R. Cao C. Shi L. Wu W. He K. A timely review of cross-kingdom regulation of plant-derived microRNAs Front. Genet. 2021 12 613197 10.3389/fgene.2021.613197 34012461 PMC8126714 Figure 1 Venn diagram of carrot miRNAs identified in the three libraries. T0 = shredded tissue with no incubation. T24 = shredded tissue with 24 h of incubation at 20 ± 2 °C. T48 = shredded tissue with 48 h of incubation at 20 ± 2 °C. Figure 2 Differential Expression Analysis of carrot miRNAs ( A p B Figure 3 Relative expression level by qPCR of selected carrot miRNAs contrasting the small-RNA seq data. The data shown are the mean ± S.E. Different letter denote a statistically significant difference p Figure 4 Functional annotation of the predicted gene target with DAVID. ( A B p Figure 5 Effect of the carrot miRNAs after 3T3-L1 differentiation. ( A B C D p nutrients-17-02919-t001_Table 1 Table 1 Primer Sequences Used for Pulsed Stem-Loop RT-qPCR Validation of Carrot-Derived miRNAs. miRNA ID Primer Sequence novel-hsa-miR-376a-5p miRNA mature sequence UUAGAUUCGCGCACAAACUCG stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACCGAGTT Forward GTG CCC TTA GAT TCG CGC novel-ptc-miR396f miRNA mature sequence UUCCACGGCUUUCUUGAACUG stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACCAGTTC Forward GCC CCT TCC ACG GCT TTC novel-aca-miR-5406-5p miRNA mature sequence UUUUUAGACCAAAGGCUCGCU stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACAGCGAG Forward GCC GCC GTT TTT AGA CCA AT novel-oan-miR-1421ag-5p miRNA mature sequence CGGUGGACUGCUUGAGCUGC stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACGCAGCT Forward CTC CGG TGG ACT GCT TG novel-hpo-miR-232a-5p miRNA mature sequence UCCGCAGUAGCACUGGCU stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACAGCCAG Forward CCT GCT CCG CAG TAG CA novel-rno-miR-337-3p miRNA mature sequence UUCAGCUCACAUAUCUCUCUGG stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACCCAGAG Forward GGC CCC TTC AGC TCA CAT novel-ath-miR165a-3p miRNA mature sequence UCGGACCAGGCUUCAUUCCCC stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACGGGGAA Forward GAT CTC TCG GAC CAG GCT novel-gga-miR-1799 miRNA mature sequence GGAAGUGAUGAGUAGACU stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACAGTCTA Forward GGT CGC GGA AGT GAT GAG novel-pte-miR-11943-3p miRNA mature sequence UUAUGGUGAUUUAUUUGUGUGG stem-loop primer GTCGTATCCAGTGCAGGGTCCGAGGTATTCGCACTGGATACGACCCACAC Forward GGG GGC GTT ATG GTG ATT T U6 reference Forward ACAGAGAAGATTAGCATGGCC Reverse GACCAATTCTCGATTTGTGCG Universal reverse  GTGCAGGGTCCGAGGT ",
  "metadata": {
    "Title of this paper": "A timely review of cross-kingdom regulation of plant-derived microRNAs",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472842/"
  }
}