{
  "title": "Paper_653",
  "abstract": "pmc Integr Cancer Ther Integr Cancer Ther 3381 ict ICT Integrative Cancer Therapies 1534-7354 1552-695X SAGE Publications PMC12476497 PMC12476497.1 12476497 12476497 41013977 10.1177/15347354251370982 10.1177_15347354251370982 1 Original Research Article “ Facing Death. . . Now, That’s a Serious Thing to Confront https://orcid.org/0009-0007-9981-4299 D.M. Schuman Haley BSc 1 Barkova Sofia PhD 1 Mina Raèf BSc 1 https://orcid.org/0000-0001-8645-0990 Deleemans Julie M. PhD 1 Nguyen Tina BSc 1 Carlson Linda E. PhD 1 1 Linda E. Carlson, Department of Oncology, Cumming School of Medicine, University of Calgary 3330, Hospital Drive NW, Calgary, AB T2N 4N1, Canada. Email: l.carlson@ucalgary.ca 26 9 2025 2025 24 478827 15347354251370982 3 4 2025 8 8 2025 26 09 2025 29 09 2025 29 09 2025 © The Author(s) 2025 2025 SAGE Publications Inc unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage People living with cancer (PLWC) often face profound existential distress that is insufficiently addressed by conventional psychosocial supports. This qualitative study explored PLWC’s attitudes, beliefs, and experiences regarding psychedelic-assisted therapy (PAT) as a novel approach to addressing psychosocial suffering, particularly existential distress. Fifteen participants with varying cancer types and stages were recruited from a national survey. Semi-structured interviews were analyzed using reflexive thematic analysis informed by the Theory of Planned Behavior. Four key themes were identified: (1) Cautious Optimism and Substance-Specific Attitudes Toward Psychedelics reflected varied knowledge, openness, and perceptions of specific agents; (2) Relational and Societal Influences: Stigma, Support, and Cultural Framing; (3) Structural and Systemic Barriers: Cost, Legality, Provider Attitudes, and Unequal Access; and (4) Cancer Context and Psychosocial Needs: Seeking Relief from Existential and Emotional Distress captured the emotional, spiritual, and existential dimensions of living with and beyond cancer. Participants expressed cautious optimism about PAT, driven by unmet needs in conventional care, particularly after active treatment and at advanced stages of cancer, where existential and spiritual concerns often go unaddressed. PAT was seen as a potential adjunct that could meaningfully engage with suffering beyond symptom management. However, concerns about safety, access, and stigma underscore the need for culturally responsive, patient-informed, and equity-focused implementation strategies. Integrating PAT into oncology will require dismantling structural barriers and shifting toward a model of care that embraces the full human experience of serious illness. cancer psychedelic-assisted therapy existential distress psilocybin psychosocial symptoms pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1  “ Healing is not merely the repair of bodily wounds, but the restoration of spiritual wholeness. —Saint Basil the Great Introduction Individuals diagnosed with cancer frequently experience profound psychological and existential distress, including anxiety, depression, fear of death, loss of meaning, and social isolation. A cross-sectional study found 70% of cancer inpatients experienced high levels of distress, with common issues including both fears and worry.  1  2  3  4  5  6  7 8 10  11  12 Clinical trials have demonstrated that classic psychedelics, such as psilocybin and LSD, can significantly reduce anxiety, depression, and existential distress in patients with advanced cancer or other life-threatening illnesses. 7 13 14 2A 15 16  17  18 Other psychedelics with historical and cultural significance, such as ayahuasca and mescaline, show preliminary promise for emotional and existential healing but have limited clinical data supporting their use in cancer care. 19 24 Understanding patient openness to PAT is crucial, as numerous interrelated factors influence patients’ attitudes toward this therapy. These factors include societal stigma, cultural norms, historical anti-substance narratives, and practical barriers such as cost, accessibility, and legal constraints.  25  26 27 29 In this qualitative exploration, we examine how PLWC across all disease stages perceive PAT in the context of therapeutic potential, stigma, and structural realities. By analyzing patient narratives, we aim to identify facilitators and barriers to acceptance, thereby informing the development of interventions that address cancer-related psychological and existential distress throughout the cancer journey. Methods Study Design Ethics approval was granted by the University of Calgary Health Research Ethics Board of Alberta – Cancer Committee (HREBA.CC-23-0004). The study follows the Consolidated Criteria for Reporting Qualitative Research (COREQ) to ensure transparency and rigor.  30 Research Positionality This study was led by a Master’s student with training in psychosocial oncology and PAT, under the supervision of a senior investigator with expertise in integrative oncology. An interdisciplinary team comprising research assistants, patient partners, and integrative oncology researchers contributed diverse perspectives throughout the entire research process, from protocol development and interview guide design to recruitment, analysis, interpretation, and dissemination planning. Patient partners included a woman with Stage IV cancer who had experience with psychedelics, as well as a male cancer survivor and his female caregiver with no prior psychedelic experiences. Reflexivity was central throughout. While several team members recognize the potential value of PAT, we remained attentive to the risks of confirmation bias and over-interpretation, particularly within the charged cultural context surrounding these therapies. Participant Recruitment and Sample Fifteen PLWC with diverse cancer types and disease stages were recruited through a national survey on attitudes toward PAT. All participants were 18 years of age or older, had a current or past cancer diagnosis, and expressed willingness to discuss their beliefs and attitudes toward PAT. Prior experience with psychedelics was not a requirement. This approach allowed for a broad spectrum of perspectives, ranging from those who had never tried psychedelics to those with previous experience using psilocybin or ketamine. The final sample of 15 participants was deemed sufficient to achieve data saturation, consistent with earlier qualitative studies on PAT. 31 32 Table 2 Data Collection Individual semi-structured interviews were conducted virtually (50-90 minutes each). Participants were invited to discuss their experiences living with cancer, current approaches to managing psychosocial symptoms, and attitudes toward PAT, including anticipated benefits, risks, and barriers to access. The interviewer maintained a neutral, non-leading stance, allowing participants to shape the conversation around their personal insights. All interviews were audio-recorded, transcribed verbatim, and de-identified to ensure confidentiality. The interview guide, developed using theoretical constructs (e.g., the Theory of Planned Behavior) and prior survey findings, was piloted with patient partners to ensure clarity, relevance, and comprehensibility. The final interview guide is available in Supplemental materials (S1) Analytical Framework A hybrid inductive-deductive reflexive thematic analysis  33  34 Table 1 Table 1. Overview of Transcript Analysis Method. Steps Description Approach 1. Data familiarization Reading/re-reading transcripts Observational review and note-taking by primary investigator and research assistants 2. Generating initial codes Applying inductive codes & deductive (TPB-based) categories Hybrid approach (inductive + deductive via TPB) 3. Searching for themes Grouping codes into preliminary themes Emergent theme analysis 4. Reviewing themes Iteratively refining themes through discussion Consensus-based refinement & cross-validation 5. Defining & naming themes Finalizing theme names & definitions Consensus-driven, informed by TPB & newly identified patterns 6. Producing the report Synthesizing findings into a coherent narrative Collaborative write-up Following Braun and Clarke’s  33  35 Reflexivity and Rigor The study team engaged in regular reflective exercises to acknowledge personal biases, including a predisposition toward integrative oncology approaches. Patient partners reviewed the themes to ensure that the interpretations resonated with their lived experiences and perspectives. Peer debriefing sessions provided an opportunity for feedback on coding accuracy and thematic clarity, thereby enhancing methodological trustworthiness. Results Our sample comprised 15 PLWC, spanning diverse ages, religious beliefs, cancer types, and treatment stages, as described in Table 2 Table 2. Participants’ Demographics and Health Information. Participants 15 Age (years; N, %) 18-24 — 25-29 1 (6.7) 30-39 4 (26.7) 40-49 2 (13.3) 50-65 4 (26.7) >65 4 (26.7) Gender (N, %) Female 10 (66.7) Male 4 (26.7) Non-binary 1 (6.7) Ethnicity (N, %) European/White 12 (80.0) Asian/Indian Subcontinent 2 (13.3) Middle Eastern 1 (6.7) Other — Income (N, %) <$30 000 — $30-50 000 3 (20.0) $51-80 000 2 (13.3) $81-120 000 2 (13.3) $>120 000 4 (26.7) Prefer not to say 4 (26.7) Education (N, %) High school diploma or equivalent 1 (6.7) Bachelor’s degree 9 (60.0) Master’s degree 1 (6.7) PhD or other doctorate level degree 1 (6.7) Professional degree (e.g. MD, DDS) 1 (6.7) Other 2 (13.3) Location (N, %) Alberta 9 (60.0) British Columbia 3 (20.0) Manitoba 2 (13.3) Ontario 1 (6.7) Other provinces — Religion (N, %) Christian 5 (33.3) Spiritual, not religious 3 (20.0) Muslim 1 (6.7) Buddhist 1 (6.7) No religion 4 (26.7) Other 1 (6.7) Cancer diagnosis (N, %) Prostate 1 (6.7) Breast 3 (20.0) Esophageal 2 (13.3) Colorectal 4 (26.7) Uterine 1 (6.7) Brain 1 (6.7) Bladder 1 (6.7) Dedifferentiated liposarcoma 1 (6.7) Thyroid 1 (6.7) Other — Cancer stage (N, %) I 1 (6.7) II 3 (20.0) III 3 (20.0) IV 5 (33.3) Unsure 3 (20.0) Psychedelic knowledge rating (0-5; N, %) 0 (no knowledge) — 1 (minimal knowledge) 2 (13.3) 2 (basic awareness) 2 (13.3) 3 (moderate knowledge) 8 (53.3) 4 (advanced knowledge) 1 (6.7) 5 (expert knowledge) 2 (13.3) Personal experience with psychedelics (N, %) Yes 9 (60.0) No 6 (40.0) Psychedelics tried (N, %)  a None 6 (40.0) Ketamine 2 (13.3) Psilocybin 8 (53.3) LSD 4 (26.7) MDMA 4 (26.7) DMT 1 (6.7) Mescaline 2 (13.3) Supportive of PAT (N, %) Yes 12 (80.0) No — Unsure 3 (20.0) a Multiple psychedelics were selected by participants. Thematic Analysis and Applied Theory of Planned Behavior Framework Through thematic analysis, participants’ behavioral intentions were mapped onto TPB’s core constructs, while recognizing cancer-specific dimensions beyond the framework. Cautious Optimism and Substance-Specific Attitudes Toward Psychedelics (Theme 1) reveal how PLWC weigh PAT’s perceived therapeutic potential against risks, informed by fragmented knowledge, cultural stigma, and agent-specific biases. Relational and Societal Influences: Stigma, Support, and Cultural Framing (Theme 2) contextualize these attitudes within relational and societal dynamics, where stigma and support networks vie to legitimize or marginalize PAT. Structural and Systemic Barriers: Cost, Legality, Provider Attitudes, and Unequal Access (Theme 3) shifts focus to structural barriers—financial, legal, and systemic—that mediate access, reframing “choice” as a privilege contingent on institutional enablers. Finally, Cancer Context and Psychosocial Needs: Seeking Relief from Existential and Emotional Distress (Theme 4) transcends TPB’s individualistic focus, grounding intentions in the existential realities of cancer: unmet psychological suffering, mortality confrontation, and demands for holistic care. Cautious Optimism and Substance-Specific Attitudes Toward Psychedelics PLWC express a complex mix of hope and caution toward PAT. The tension is structured through three interrelated sub-themes: (1.1) Foundational Knowledge and Influences; (1.2) Balancing Openness with Caution; and (1.3) Attitudes Toward Specific Agents (see Figure 1 Figure 1. Attitudes toward PAT. This figure outlines the thematic structure of attitudes toward PAT, structured into three sub-themes: (1) Balancing openness with caution, reflecting tensions between perceived therapeutic benefits (eg, emotional relief, existential support) and psychological risks (eg, fear of adverse effects), (2) Foundational Knowledge and Influences, capturing media narratives, historical antidrug messaging, and gaps in clinical knowledge, and (3) Attitudes Toward Specific Agents, distinguishing between psilocybin, ketamine, LSD, MDMA, and other psychedelic agents. Figure outlines thematic structure of PAT attitudes, including balancing openness with caution, foundational knowledge influences, and agent-specific perceptions. Foundational Knowledge and Influences Participants’ baseline understanding of psychedelics was primarily informed by media reports, pop-science articles, word-of-mouth, and personal experience. Nine of 15 participants had previously used psychedelics, and their views were clearly informed by these experiences. In contrast to those relying on secondary sources, these participants described psychedelics with familiarity and confidence, often drawing on past personal insights. Older participants, many of whom grew up during the “war on drugs” era, often retained caution influenced by anti-drug messaging. Most participants rated themselves as having moderate or high psychedelic knowledge, yet the content of their interviews frequently revealed only superficial or anecdotal familiarity. “ I guess when I think of psychedelics, I know reading news and pop science that there’s definitely a trend toward using psychedelics in treating trauma and anxiety and depression “ I have some knowledge of how psychedelics have proven to be helpful . . . and that research was kind of squashed, not allowed to continue. Many acknowledged a lack of formal, in-depth information about dosing and safety, with those holding moderate to high psychedelic knowledge offering more detailed reflections. Balancing Openness With Caution Participants expressed complex attitudes toward PAT, balancing openness influenced by potential therapeutic benefits, professional guidance, and controlled settings, with notable caution driven by fears of psychological side effects, loss of control, and anxiety about adverse experiences, as described in Table 3 Table 3. Codes Descriptions, and Representative Quotes Illustrating Participants’ Complex Attitudes Toward PAT. Code Description of code Representative quote Guided Professional Support Increased openness when PAT is administered by trained professionals within a controlled therapeutic setting. “ If it was guided with an expert . . . I’m more than open to trying it. End-of-life Urgency Influencing Openness Heightened willingness to try PAT in contexts of advanced cancer or approaching end-of-life, driven by a desire for relief from suffering. “ If I was having end-of-life kind of stuff, I think I’d want almost anything to get through that. Interest in Controlled, Therapeutic Exploration Younger participants’ cautious interest, emphasizing controlled dosing and therapeutic rather than recreational intentions. “ I would try and see. . .if I could bring some more joy into my life and not. . .looking to get, you know, this crazy stoned,. . .but proper dosing could be a solution for a lot of people like me. Beliefs in Therapeutic Benefits Perceived effectiveness of PAT for emotional openness, breaking psychological barriers, and facilitating introspection and emotional release. “ I’m open to the barriers that it may break in a person . . . psychological barriers . . . to help them find relief. It was probably about a year into my treatment . . . I found it really helpful . . . I was able to connect with the vulnerable side of me . . . and just let myself cry. Concerns of Psychological Risks and Loss of Control Concerns regarding potential negative psychological effects, including fear of losing control and increased anxiety. “ I would be really nervous about . . . losing control and not feeling like myself. I guess I’m just afraid that it’ll take too much and I’ll freak out because I have anxiety. Attitudes Toward Specific Agents In addition to their general perspectives on PAT, participants held distinct attitudes toward individual substances. Factors such as perceived “naturalness,” cultural stigma, therapeutic potential, and personal experience shaped how each agent, ketamine, LSD, psilocybin, MDMA, and other psychedelics (ayahuasca and mescaline) were viewed, as described in Table 4 Table 4. Summary of Participant Attitudes Toward Specific Psychedelic Agents. Psychedelic agent Summary of attitudes Representative quotes Ketamine Participants with moderate psychedelic knowledge associated ketamine with negative stereotypes (e.g., “horse tranquilizer”), raising safety concerns; however, when administered under clinical supervision, it was considered a viable option. “ Ketamine . . . my understanding is it’s a horse tranquilizer. “ LSD, MDMA, and ketamine are probably the ones that seem more intense . . . but if it was guided . . . I would be open. I’ve used ketamine in microdoses many times, but because I was trying to play it safe, didn’t want to get too high on ketamine, because, you know, you never know how strong it’s going to be. LSD LSD was generally viewed with discomfort, largely due to historical stigma and fears of unpredictable experiences. Participants with limited direct experience, particularly influenced by older anti-drug messaging, were notably cautious. “ I think LSD probably makes me feel the least comfortable. “ I’ve heard more about [psilocybin], and the other ones sound a little bit scarier to me, especially LSD . . . Psilocybin Psilocybin was frequently regarded as the most “natural” and acceptable psychedelic, with favorable media portrayal and personal familiarity contributing to its perceived safety. Younger participants and those with higher education tended to favor it. “ Having a regulated, guided psilocybin session . . . I would still do [it] in a heartbeat. “ The ones that have more natural sources do feel like. . . To me they feel safer. “ The ones I’m most familiar with are psilocybin. It’s got a lot of press lately . . . it’s relatively safe, especially used in a supervised setting. “ I would say psilocybin seems to me like it’s less scary than the other ones. You can microdose and not get high. MDMA MDMA was familiar to many participants who associated it with partying and music festivals. Along with a positive feeling that comes with it, participants described negative effects of ecstasy that were represented in mass media in the past. \" Feels like there’s less information about it. In my head it’s like the party drug... . .it’s the party, the party drug and makes people happy and lovey and it is what it is. “ I’ve heard of friends using MDMA at music concerts and stuff, and they were like, oh yeah, it feels really good. It’s received a bad name because of bad press where people have taken ecstasy and maybe overdosed or in concerts and venues, or someone’s been sexually assaulted after taking MDMA. Other Psychedelics (Ayahuasca and Mescaline) Curiosity about these substances was tempered by concerns over intense physical side effects and a lack of personal experience. These agents were generally less favored, especially among participants unfamiliar with their cultural contexts. “ Ayahuasca, I know sometimes people go to Mexico or South America to do it in groups and they throw up . . . the ayahuasca kind of scares me a little bit. “ I tried mescaline twice . . . it was okay, but . . . it causes too much physical distress. The stomach can get very nauseous . . . I didn’t care for it. PLWC’s attitudes toward PAT exist at the nexus of hope-driven pragmatism and risk-averse deliberation. While foundational knowledge gaps and historical stigma often anchored skepticism, therapeutic desperation, particularly in advanced cancer, fostered receptivity. Younger, educated participants engaged in more nuanced discourse, weighing agent-specific profiles (eg, psilocybin’s “natural” appeal vs MDMA’s recreational associations) against their psychosocial needs. Conversely, older participants, shaped by the “war on drugs” era, exhibited caution, though not uniform resistance. Critically, cultural and educational backgrounds functioned as lenses through which stigma or legitimacy was filtered. These dynamics underscore that attitudes are neither static nor monolithic but contextually contingent, forged through the interplay of personal vulnerability, sociocultural legacies, and the evolving medicalization of psychedelics. Ultimately, PLWC’s openness to PAT hinges on reconciling the promise of psychological liberation with the perceived safety of structured, professionalized care; a balance reflective of broader societal shifts in redefining psychedelics from taboo to therapeutic. 2. Relational and Societal Influences: Stigma, Support, and Cultural Framing Subjective norms, as conceptualized by TPB, reflect an individual’s perception of social pressures to engage in or avoid a behavior, shaped by their beliefs about whether significant others (eg, family, peers, society) approve or disapprove of the action, combined with their motivation to comply with these expectations. In this context, participants’ openness or caution toward PAT was shaped by broader social and cultural factors, including historical stigma, generational attitudes, media portrayals, and support from personal networks. Four interrelated sub-themes emerged: (2.1) Historical and Generational Influences, (2.2) Stigma and Judgment, (2.3) Media Influence, and (2.4) Asymmetrical Support Networks (see Figure 2 Figure 2. Subjective norms influencing PAT engagement. This figure outlines four sub-themes in subjective norms: (1) Historical and Generational Influences (war on drugs legacy, cultural taboos), (2) Stigma and Judgment (fear of social repercussions), (3) Media Influence (sensationalized vs science-based narratives), and (4) Asymmetrical Support Networks (peer advocacy, family dynamics) with their respective codes. Subjective norms impacting PAT involvement; include 4 sub-themes: historical & generational influences (war on drugs legacy, cultural taboos), stigma and judgment (fear of social repercussions), media influences (sensationalized vs science-based narratives), and asymmetrical support networks (peer advocacy, family dynamics). Historical and Generational Influences Participants frequently referenced the “war on drugs” era and past anti-drug campaigns as shaping their early perceptions of psychedelics. Older participants recalled stringent anti-drug messaging, while younger ones, diagnosed with cancer at earlier ages, felt more open-minded but still aware of lingering stigma. Cultural context also played a role; for instance, 1 participant, who identified as Asian, described strict prohibitions in her upbringing that framed psychedelics as particularly taboo: “I think there’s always been a lot of, especially culturally from my background, it’s like psychedelics were a big no-no. They were scary.” (PLWC 5) Generational differences also influenced attitudes; some older participants admitted needing to “unlearn” prohibitive views, whereas younger participants, exposed to more recent discussions of medical cannabis and psychedelics, reported fewer entrenched biases. “I grew up during the 60s in the southern interior of BC, so there were lots of substances around when I was a kid. . . . I never, never used any psychedelics.” (PLWC 15) Stigma and Judgment Despite growing interest, many participants feared judgment from family, friends, or professional peers. They noted a reluctance to discuss psychedelics publicly, especially if workplace or extended family environments were perceived as conservative. Some chose not to disclose their curiosity or past psychedelic use, fearing negative perceptions or social repercussions. “ Yeah, it’s the very reason I wouldn’t talk to my family about it. I don’t think they’d be open-minded. “ I would not share this online . . . I’m a [professional in healthcare], so that’s why I’m sharing this here, in a confidential space. The stigma surrounding psychedelics was particularly strong in contexts where they were still viewed as “taboo” or “dangerous,” even if participants found scientific literature suggesting otherwise. This created tension between their growing openness and the potential social risk of being associated with psychedelics. Media Influence Media coverage had a powerful impact on initial impressions. Some participants recalled negative or sensational stories, reinforcing fears of “bad trips.” Others discovered more balanced or positive portrayals (e.g., Michael Pollan’s popular book How to Change your Mind  36 “ There were always these shows before, showing people doing crazy things while on it. That definitely affected how I viewed psychedelics. “ I think it’s getting better, especially with psilocybin and magic mushrooms talked about in pop science by people like Michael Pollan. It makes it seem like this is a good thing. Although participants occasionally expressed caution about “hype” versus reality, most reported predominantly positive accounts from these informal channels. This tendency to rely on media and friends rather than formal research left some feeling uncertain about where to find credible, unbiased information on PAT. Asymmetrical Support Networks Personal networks significantly shaped participants’ attitudes. Friends or peers who shared positive psychedelic experiences helped dispel fears, while supportive family members encouraged exploration. However, conservative values or generational divides could limit open discussion. “ I think I had one friend say he did mushrooms and he was really positive about it . . . it opened my eyes to the possibility that it could be helpful. “ I do have a partner who is open-minded about this stuff, so it helps to have someone to talk to without being judged. “I know that within my family there’s probably a wide variety of views on it, you know, and somewhat you would expect the younger people maybe have a more relaxed attitude towards it.” (PLWC 15) Participants frequently observed heterogeneous perspectives toward PAT across their social networks. While some described asymmetrical support networks, receiving greater endorsement from peers than family members, others identified specific confidants (eg, siblings, close friends) who fostered nonjudgmental dialog about PAT. Notably, several PLWC positioned themselves as advocates within their circles, actively championing integrative therapies to counteract prevailing skepticism. Subjective norms, deeply entwined with sociocultural legacies, profoundly influenced these dynamics. Historical associations of psychedelics with illicit “drug use,” coupled with stigmatizing remarks from relatives or peers and polarized media portrayals, often cultivated reticence or concealment. Conversely, allyship from socially progressive individuals, whether personal connections or public figures, ignited curiosity and mitigated apprehensions. Ultimately, participants’ inclination to pursue PAT hinged on a perceptual equilibrium: the degree to which affirming voices within their immediate milieu offset broader cultural ambivalence or disapproval. This dialectical tension underscores how behavioral intentions are negotiated at the intersection of intimate relational trust and collective societal narratives. 3. Structural and Systemic Barriers: Cost, Legality, Provider Attitudes, and Unequal Access Participants’ willingness or ability to pursue PAT was shaped by practical concerns, from accessing trusted sources to affording treatment, alongside personal motivation and healthcare provider support. Five sub-themes emerged: (3.1) Accessibility, (3.2) Financial Barriers, (3.3) Legal, Regulatory, and Research Gaps, and (3.4) Healthcare Provider Dynamics (see Figure 3 Figure 3. Perceived behavioral control: structural barriers to accessing PAT. Key barriers (sub-themes) include accessibility (opaque referral pathways), variable clinician support, financial exclusion (cost prohibitions), and legal/regulatory inertia (slow policy reform). Arrows denote how these structural inequities intersect with demographic factors (eg, income, cancer stage), disproportionately limiting agency for marginalized groups. Recommendations for systemic reforms (e.g., insurance mandates, provider training) are highlighted as pathways to equitable access. Perceived behavioral control diagram illustrating structural barriers to PAT access, including opaque referral pathways, clinician support variability, cost prohibitions, and legal inertia, with demographic factors exacerbating these. Systemic reforms suggested for equitable access. Accessibility Participants faced informational and logistical opacity regarding PAT, with many uncertain how to identify credible providers or navigate referral pathways. While some referenced underground networks or media-reported clinics, most described a fragmented landscape that discouraged exploration: “ I wouldn’t really even know where to start in order to get, I would assume I would get a doctor’s referral. I don’t know where it’s located and how accessible it would be for me to do it. “ What is stopping me is access. I have no idea how I would get it, so that would be one, but I wouldn’t let the fact, if it’s illegal, stop me right now if there’s a way to get it. This sense of inaccessibility hindered many from exploring PAT, even if they were otherwise open to its therapeutic benefits. Financial Barriers Cost was another concern; participants worried PAT would be prohibitively expensive and unlikely to be covered by insurance. Despite this, many expressed willingness to pay out-of-pocket if they believed treatment would offer meaningful benefits. “ I think yes, it would depend on the amount . . . I do have a willingness to pay a higher amount maybe than I would for other things. “ I’m lucky enough that I could probably afford it. But it’s something that makes you think, right, especially if it’s thousands of dollars. Those with limited financial resources felt particularly disadvantaged, noting that effective mental health supports should be equitable and accessible, not solely a “premium” service for those who can afford it. Legal, Regulatory, and Ethical Considerations Participants identified systemic inertia, a slow regulatory process, stigma, and insufficient data, as a critical barrier. Many emphasized the need for rigorous research to legitimize PAT and inform ethical guidelines: “ I guess it’s the research aspect . . . I’d like to see a little bit more of that, because it’s what gives me faith in anything that’s offered. Others noted that public sentiment is gradually shifting, partly influenced by cannabis legalization in Canada, yet lingering stigma and regulatory inertia remain significant hurdles: “ I was always against drugs of any kind . . . I think my stance has changed over time with the legalization of [cannabis] . . . I am much more interested in exploring complementary or alternative therapies. “ I just think that . . . unfortunately, it’s a really long ways away. These concerns echoed broader calls for clearer guidelines, increased funding, and expanded clinical studies to establish credibility and ensure patient safety. Healthcare Provider Dynamics Finally, participants underscored the essential role of healthcare providers who are informed, open-minded, and willing to discuss PAT. Those who had supportive oncologists or mental health professionals reported feeling more at ease and better equipped to navigate their options. “ If it was guided with an expert and someone who was very trained . . . I would trust in the expertise of the staff that was administering it. Conversely, others felt dismissed or judged when bringing up psychedelics in medical settings, highlighting a critical need for clinician education and training. “ I think it’s just physicians in general—I’ve experienced a resistance to hearing something they don’t already know. It’s frustrating, and it discourages me from bringing this up. Such experiences highlight the critical need for clinician education and communication training, ensuring that PLWC feel safe discussing PAT as a legitimate therapeutic option. Perceived behavioral control was predominantly shaped by structural inequities rather than individual choice. Systemic factors—opaque access pathways, financial exclusion, regulatory delays, and variable clinician support—collectively eroded participants’ sense of agency. While having advanced cancer stages or financial privilege occasionally mitigated barriers, most faced a labyrinth of institutional and socioeconomic constraints. These findings underscore the need for systemic reforms: standardized access protocols, insurance coverage, accelerated research, and clinician education. Without such shifts, PAT risks perpetuating existing disparities, accessible only to those with resources to navigate its fragmented landscape. 4. Cancer Context and Psychosocial Needs: Seeking Relief from Existential and Emotional Distress The final theme explores how participants envision PAT within the broader landscape of cancer care. Many expressed existential distresses tied to their diagnoses, particularly those in advanced stages of illness, who saw PAT as a potential avenue for end-of-life anxiety relief. By contrast, some earlier-stage patients showed less immediate interest, prioritizing conventional treatments. Across all stages, participants voiced a desire for whole-person support that addresses both psychological and spiritual dimensions of cancer through 3 sub-themes: (1) psychosocial suffering, (2) existential distress tied to confronting mortality, and (3) aspirational visions for integrating PAT into future cancer care (see Figure 4 Figure 4. Cancer context and psychosocial needs: PAT as a response to existential and systemic gaps. This diagram visualizes the interplay between cancer’s psychosocial toll and participants’ openness to PAT. Three sub-themes structure the theme: (1) psychosocial suffering (depression, support gaps), (2) existential distress (mortality confrontation), and (3) future care visions (palliative integration). Nodes represent codes (eg, “post-treatment abandonment,” “stage-specific priorities”), with advanced-stage patients emphasizing PAT’s role in existential reconciliation. The hierarchical layout underscores PAT’s potential to address unmet needs in oncology, bridging biomedical and holistic care paradigms. The diagram presents the theme of Cancer context and psychosocial needs, focusing on PAT as a response to existential and systemic gaps. It outlines three sub-themes: psychosocial suffering, existential distress, and future care visions. Nodes signify codes like post-treatment abandonment and stage-specific needs, emphasizing PAT’s role in existential reconciliation for advanced-stage patients. The structure highlights PAT’s potential to meet unmet needs in oncology, bridging biomedical and holistic care paradigms. Psychosocial Suffering Participants universally described cancer as a catalyst for profound psychological and spiritual turmoil. Three codes structure their narratives in Table 5 Table 5. Codes, Descriptions, and Representative Quotes Illustrating Psychosocial Suffering Among Participants Living With Cancer. Code Description of code Representative quotes Burden of Depression and Anxiety Cancer-related depression and anxiety described as pervasive, severe, and often resistant to conventional psychological treatments. “ I never really pulled out of this depression . . . I’m at the highest level of the drugs that I’m on. “ I’ve been really, really struggling . . . I was suicidal last week . . . but I’m doing better this week. Lack of Psychosocial Support Systemic gaps in mental health care resulted in insufficient psychosocial support, leaving participants feeling isolated or abandoned. “ The little bit of psychosocial support we got at that time was too little, too late . . . all in major shock. “ I’ve been in almost half a dozen situations . . . where I wanted to talk to someone from psychosocial oncology . . . and they just straight up, couldn’t . . . there just was no time. Post-Treatment Abandonment Psychosocial struggles frequently intensified post-treatment due to decreased formal support and diminishing personal networks. “ It was really bad . . . I think that’s when everything flooded in essentially for me. “ It’s post-treatment where the support seemed to slide off . . . friends and family . . . were like, oh, well, you’re all better now. Existential Distress and Fear of Dying For advanced-stage participants, the confrontation with mortality transcended clinical anxiety, evolving into a profound existential reckoning. This distress was characterized not merely by fear of death itself, but by the process of dying and psychological weight of uncertainty—grappling with the meaning of suffering, the irreversibility of loss, and the erosion of future-oriented identity. Many described conventional therapies (eg, antidepressants, counseling) as inadequate to address these metaphysical dimensions: “ There’s some potential benefit there, especially for people who are deathly afraid of dying . . . it’s a serious thing to confront. Participants framed PAT as a unique existential tool, offering a means to reframe mortality through altered states of consciousness. Those who had undergone psychedelic experiences reported transformative shifts in their relationship to death: “ I was able to connect with the vulnerable side of me . . . let myself cry . . . it was really helpful. “ It was quite life-changing . . . in how I viewed existential distress and how I look at death down the road. Others who had tried psychedelics echoed similar sentiments, suggesting less fear of dying and an enhanced sense of the present: “ I can see a high value of the psychedelic experience helping people cope with . . . death and dying. “ And that’s what happened. I heard myself laugh, and that depth of depression broke. This sub-theme reveals a critical tension: while biomedical oncology often prioritizes tumor suppression, participants sought interventions that address mortality’s psychological imprint. PAT emerged as a bridge between these paradigms, offering a space to process existential questions that conventional care sidesteps. Notably, participants did not universally seek “answers” about death but rather emotional permission to confront it without paralyzing fear. Future Care Visions Participants across different disease stages expressed interest in incorporating psychedelics into cancer care. Those with advanced disease saw immediate applications for relieving end-of-life distress, while earlier-stage patients viewed psychedelics as potential options if psychological distress intensified. Many hoped for enhanced research, clearer regulations, and trained providers to facilitate safe PAT integration. Some participants envisioned psychedelics becoming a standard offering within cancer centers: “ I would like to see it offered through [the cancer centre] . . . maybe one session could make a big difference. Others highlighted the potential for psychedelics to address anxiety and depression at diagnosis, potentially supporting physical healing: “ I am hoping. . . when you’re first diagnosed. . . it could be used to help the anxiety come down and the depression come down. Because if your body’s not fighting that, then it’s working on healing itself. Young adults with cancer particularly emphasized the need for better post-treatment psychological support: “ There’s a lot more younger patients now being diagnosed like myself, I was diagnosed at 26, so after that point, what am I supposed to do? And I think for so long we haven’t discussed the after of it, and I think psychedelics are an area that could help with that. In sum, inadequate psychosocial support coupled with profound existential concerns drove participants’ interest in psychedelics as potentially transformative. By helping reframe fear, ease psychological burdens, and facilitate emotional release, PAT emerged as a promising approach, particularly for those with advanced disease, for coping with cancer’s deep uncertainties. Discussion Thematic analysis identified four primary themes: (1) Attitudes toward PAT characterized by cautious optimism and substance-specific preferences, particularly for psilocybin, which was perceived as more “natural” and safer than other psychedelics; (2) Subjective Norms and Cultural Influences revealing persistent stigma and generational perspectives influenced by historical drug policies; (3) Perceived Behavioral Control highlighting practical barriers including accessibility, cost, and regulatory challenges; and (4) Cancer Context emphasizing how existential distress and inadequate psychosocial support drive interest in PAT, especially among those with advanced disease. Participants with advanced cancer and those of younger age exhibited greater openness to PAT, highlighting how prognosis and generational influences shape attitudes. Many viewed psychedelics as uniquely beneficial for overcoming emotional barriers and facilitating introspection, aligning with evidence supporting psilocybin’s role in addressing existential distress in palliative contexts.  37 Natural Origins, Clinical Credibility, and Synthetic Hesitancy: Factors Shaping Psychedelic Preferences in Oncology Participants viewed psilocybin as the most favorable psychedelic agent due to 3 key factors: its perceived “natural” origin in mushrooms, positive media representation, and a perception of robust evidence supporting its efficacy for cancer-related existential distress. 37 38  39  29 By contrast, synthetic agents such as LSD and MDMA were met with greater caution due to their association with recreational use, historical stigma, and concerns around long-term safety.  40  41  13 7 42 Similarly, ketamine’s dissociative effects (eg, perceptual disturbances, detachment) are perceived by some patients as disorienting rather than therapeutically meaningful.  43 44 46 Lastly, it was unsurprising that most participants had limited or no knowledge of ayahuasca and mescaline, given their cultural specificity and minimal representation in clinical research and mainstream media. 22 23 Balancing Fear, Loss of Control, and the Reality of Potential Side Effects Fear of adverse effects, such as bad trips or loss of control, was a recurring theme among PLWC. This aligns with findings in previous literature. For example, some participants reported that potential mental health service users often express concerns about the safety and unpredictability of psychedelics.  47 However, considering these concerns, looking at reported side effects provides additional perspective. A recent systematic review and meta-analysis found that serious adverse events (SAEs) were rare in clinical settings, with no reports of deaths by suicide, persistent psychotic disorders, or hallucinogen persisting perception disorders following high-dose classic psychedelic administration.  48  48 The nuanced understanding of risks and benefits among more educated participants in our study suggests that knowledge level influences perceptions of efficacy. This emphasizes the need for continued research to characterize the potential harms of psychedelic treatment, including enduring perceptual disturbances, triggering or enhancing the risk for onset of mania or psychosis, and acute cardiovascular effects.  49 Beyond the Headlines: Understanding Patient Knowledge Participants predominantly acquired psychedelic knowledge through informal channels (eg, media reports, popular science literature, and personal narratives) rather than structured educational resources. This pattern mirrors a study that documented how Australian public perceptions are shaped by cultural narratives and often sensationalized media coverage that amplifies both therapeutic optimism and stigma.  47  38 The absence of formal education for PLWC highlights a critical communication gap in oncology settings, where existential distress may heighten susceptibility to misinformation. This situation raises significant equity concerns, particularly for populations already experiencing barriers to healthcare access. Clinicians occupy a privileged position as trusted knowledge intermediaries, yet their effectiveness is compromised by insufficient training and organizational support for psychedelic-focused discussions. Developing integrated approaches that connect scientific evidence with accessible patient education would enable PLWC to approach PAT as informed participants rather than passive recipients of unevenly distributed information. Subjective Norms Generational context, stigma perceptions, media influence, and social networks shaped attitudes toward PAT. Older participants expressed skepticism tied to anti-drug campaign exposure, while younger ones showed greater openness, aligning with trends observed in another study.  43  38 Notable in our findings was the relative absence of religious affiliation as a determinant of PAT receptivity, despite literature documenting religion’s influence on psychedelic attitudes. 50 51 52 53 Access and Affordability: Perceived Behavioral Control Financial barriers pose a substantial challenge to accessing PAT, as patients frequently anticipate prohibitive out-of-pocket costs due to restricted insurance coverage for novel therapies. The concerns regarding affordability resonate with the findings of Plourde et al,  39 12 54 Regulatory complexities further complicate access to PAT, as patients express confusion regarding clinical trial eligibility criteria, variations in legal statuses across jurisdictions, and unclear standards for provider qualifications. Research emphasizes the urgency for regulatory standardization, advocating for clearer guidelines that can help increase patient confidence and promote informed decision-making in the therapeutic landscape, especially in the face of rapid advancements in treatment options. 38 55 Gaps in Psychosocial Supports and the Limitations of Western Medicine Western medicine’s approach to cancer care reveals significant limitations in addressing existential distress, particularly for patients with advanced disease. Conventional healthcare paradigms often frame death as a biological failure rather than a natural process, creating a “death-denying” culture that emphasizes cure over comprehensive care. 56 57 Research consistently demonstrates that patients with advanced cancer experience severe existential distress, including fear of death, loss of meaning, and profound isolation. 58 59  60  61 This gap becomes particularly pronounced after active treatment concludes, when patients often report feeling abandoned precisely when psychological support becomes most essential.  26  62 63 64 63 64 12 65  3 Psilocybin offers promising alternatives by directly engaging with existential and spiritual dimensions of illness. Clinical trials demonstrate that psilocybin-assisted therapy can induce profound shifts in patients’ relationships with mortality, often through experiences of “ego dissolution” or transcendence that correlate with lasting reductions in anxiety and enhanced acceptance of death. 13 66 67 68 Limitations, Reflexivity, and Future Directions This qualitative study offers rich insights into PLWC perspectives toward PAT but has several limitations. The Canadian sample limits generalizability, not only due to its geography but also composition of mostly educated white women, and recruitment referencing psychedelics may have introduced self-selection bias toward participants already interested in PAT. Despite efforts to capture a diversity of attitudes, this approach likely skewed findings toward more favorable views. Future research should use strategies targeting broader, more diverse patient populations, including individuals from marginalized communities and those skeptical of PAT. Research priorities for integrating PAT into cancer care must focus on three interrelated areas to ensure equitable access and effectiveness: First, longitudinal mixed-methods studies are needed to map PAT receptivity across the cancer trajectory, particularly at critical junctures such as diagnosis and palliative transitions to inform targeted interventions. Second, implementation science approaches should examine how structural determinants such as financial barriers and geographic disparities affect access, combining effectiveness trials using patient-reported outcomes with qualitative inquiry into challenges faced by marginalized patients. Third, policy research must engage multiple stakeholders to develop frameworks that balance accelerated access with appropriate safeguards, potentially through adaptive licensing models that prioritize advanced disease while mandating equity audits. Figure 5 Figure 5. Multistakeholder roadmap for equitable implementation of PAT in oncology. Policy makers are urged to prioritize regulatory reform (eg, psilocybin legalization) and insurance coverage to address financial barriers. Patient advocacy groups can counter misinformation through education and partner with communities to co-design PAT access. Researchers must focus on equity-driven studies and culturally adaptive protocols to ensure inclusivity, as well as head-to-head trials comparing psychedelic agents paired with established therapeutic frameworks. Clinicians should adopt training programs to reduce stigma and integrate PAT into palliative care for advanced-stage patients. Actions align with study themes: leveraging psilocybin’s perceived safety (attitudes), improving affordability (perceived control), addressing existential distress (cancer context), and reducing stigma via education (subjective norms). Color-coded nodes (stakeholders: light blue; actions: peach; themes: green) and directional arrows illustrate collaborative pathways. Designed for clinicians, policymakers, and advocates, this visual emphasizes equity, patient-centered care, and systemic collaboration to transform PAT from a novel intervention into an accessible, holistic component of oncology. This diagram presents a comprehensive roadmap for the equitable implementation of psychedelic-assisted therapy in oncology, involving multiple stakeholders. Policymakers, patient advocacy groups, researchers, and clinicians are all highlighted as key actors, each with distinct roles and responsibilities. Policymakers are called upon to reform regulations and facilitate insurance coverage, addressing financial barriers for patients. Advocacy groups are encouraged to counter misinformation and design accessibility initiatives. Researchers are tasked with conducting equity-focused, culturally sensitive studies and comparative clinical trials. Clinicians should integrate psychedelic therapy into palliative care and receive training to destigmatize its use. The diagram employs a color-coded system to differentiate between stakeholders (light blue), actions (peach), and themes (green), illustrating the alignment of actions with specific themes. The objective is to enhance perceptions of safety, affordability, and legitimacy of psychedelic therapy in cancer care, particularly in the context of existential distress and stigma reduction. The visual serves as a guide for clinicians, policymakers, and advocacy groups, emphasizing the importance of collaboration in shaping therapeutic practices. Conclusion Our findings illustrate a spectrum of attitudes shaped by demographic, social, cultural, and historical influences, highlighting a notable openness among younger individuals and those experiencing advanced illness. Participants emphasized significant unmet psychosocial needs, especially around existential distress, anxiety, and inadequate post-treatment support, that position PAT as a potentially valuable adjunct to conventional cancer care. However, concerns regarding safety, stigma, access, and affordability emerged clearly, underscoring the necessity for careful implementation strategies that address existing disparities and ensure equitable access. Addressing these limitations requires coordinated efforts across clinical education, policy reform, and implementation science to transform cancer care from a system that fights death to one that honors the complete human experience. Supplemental Material sj-docx-1-ict-10.1177_15347354251370982 – Supplemental material for “Facing Death. . . Now, That’s a Serious Thing to Confront” A Qualitative Analysis of Patient Perspectives on Psychedelic-Assisted Therapy for Cancer-Related Psychosocial Symptoms Supplemental material, sj-docx-1-ict-10.1177_15347354251370982 for “Facing Death. . . Now, That’s a Serious Thing to Confront” A Qualitative Analysis of Patient Perspectives on Psychedelic-Assisted Therapy for Cancer-Related Psychosocial Symptoms by Haley D.M. Schuman, Sofia Barkova, Raèf Mina, Julie M. Deleemans, Tina Nguyen and Linda E. Carlson in Integrative Cancer Therapies We sincerely thank the patients who generously shared their experiences and insights for this research. Their willingness to discuss sensitive topics surrounding cancer care and psychedelic-assisted therapies was invaluable to our understanding of these complex issues. Additionally, we are grateful to our patient partners, whose contributions were essential throughout the entire research process. Their lived experience shaped our research questions, informed our interview approach, enhanced our analysis, and strengthened our interpretations. Their thoughtful perspectives ensured this work remained grounded in patient realities and priorities. We also thank Chantal Savard for assistance with reference management and Sheila Schuman for editorial support. ORCID iDs: https://orcid.org/0009-0007-9981-4299 Julie M. Deleemans https://orcid.org/0000-0001-8645-0990 Ethical Considerations: Consent to Participate: Author Contributions: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Supplemental Material: References 1 Peters L Brederecke J Franzke A de Zwaan M Zimmermann T. Psychological distress in a sample of inpatients with mixed cancer—a cross-sectional study of routine clinical data Front Psychol 2020 11 591771 10.3389/fpsyg.2020.591771 33329254 PMC7734182 2 Bauereiß N Obermaier S Özünal SE Baumeister H. Effects of existential interventions on spiritual, psychological, and physical well-being in adult patients with cancer: systematic review and meta-analysis of randomized controlled trials Psychooncology 2018 27 11 2531 2545 10.1002/pon.4829 29958339 3 Breitbart W Pessin H Rosenfeld B et al Individual meaning-centered psychotherapy for the treatment of psychological and existential distress: a randomized controlled trial in patients with advanced cancer Cancer 2018 124 15 3231 3239 10.1002/cncr.31539 29757459 PMC6097940 4 Lui F Zhang Q Bao GC et al Refinement of a meaning-centered counseling program for Chinese patients with advanced cancer: integrating cultural adaptation and implementation science approaches BMC Health Serv Res 2025 25 1 85 10.1186/s12913-024-12124-3 39815347 PMC11736934 5 Grossman CH Brooker J Michael N Kissane D. Death anxiety interventions in patients with advanced cancer: a systematic review Palliat Med 2018 32 1 172 184 10.1177/0269216317722123 28786328 6 Deshields TL Wells-Di Gregorio S Flowers SR et al Addressing distress management challenges: recommendations from the consensus panel of the American Psychosocial Oncology Society and the Association of Oncology Social Work CA Cancer J Clin 2021 71 5 407 436 10.3322/caac.21672 34028809 7 Schipper S Nigam K Schmid Y et al Psychedelic-assisted therapy for treating anxiety, depression, and existential distress in people with life-threatening diseases Cochrane Database Syst Rev 2024 9 9 10.1002/14651858.CD015383.pub2 PMC11390284 39260823 8 Kast EC Collins VJ. Study of lysergic acid diethylamide as an analgesic agent Anesth Anal 1964 43 3 14169837 9 Ross S. Therapeutic use of classic psychedelics to treat cancer-related psychiatric distress Int Rev Psychiatry 2018 30 4 317 330 10.1080/09540261.2018.1482261 30102082 10 Kast E. LSD and the dying patient Chic Med Sch Q 1966 26 2 80 87 4163076 11 Radbruch L De Lima L Knaul F et al Redefining palliative care-a new consensus-based definition J Pain Symptom Manag 2020 60 4 10.1016/j.jpainsymman.2020.04.027 PMC8096724 32387576 12 Carlson LE Ismaila N Addington EL et al Integrative Oncology Care of symptoms of anxiety and depression in adults with cancer: Society for Integrative Oncology-ASCO guideline J Clin Oncol 2023 41 28 4562 4591 10.1200/JCO.23.00857 37582238 13 Ross S Bossis A Guss J et al Rapid and sustained symptom reduction following psilocybin treatment for anxiety and depression in patients with life-threatening cancer: a randomized controlled trial J Psychopharmacol 2016 30 12 1165 1180 10.1177/0269881116675512 27909164 PMC5367551 14 Holze F Gasser P Müller F Dolder PC Liechti ME. Lysergic acid diethylamide–assisted therapy in patients with anxiety with and without a life-threatening illness: a randomized, double-blind, placebo-controlled phase II study Biol Psychiatry 2023 93 3 215 223 10.1016/j.biopsych.2022.08.025 36266118 15 Inserra A De Gregorio D Gobbi G. Psychedelics in psychiatry: neuroplastic, immunomodulatory, and neurotransmitter mechanisms Pharmacol Rev 2021 73 1 202 277 10.1124/pharmrev.120.000056 33328244 16 Johnson MW Hendricks PS Barrett FS Griffiths RR. Classic psychedelics: an integrative review of epidemiology, therapeutics, mystical experience, and brain network function Pharmacol Ther 2019 197 83 102 10.1016/j.pharmthera.2018.11.010 30521880 17 Wolfson PE Andries J Feduccia AA et al MDMA-assisted psychotherapy for treatment of anxiety and other psychological distress related to life-threatening illnesses: a randomized pilot study Sci Rep 2020 10 1 20442 10.1038/s41598-020-75706-1 33235285 PMC7686344 18 Fan W Yang H Sun Y et al Ketamine rapidly relieves acute suicidal ideation in cancer patients: a randomized controlled clinical trial Oncotarget 2017 8 2 2356 2360 10.18632/oncotarget.13743 27926528 PMC5356805 19 Loizaga-Velder A Giovannetti C Campoy Gomez R et al Therapeutic effects of ceremonial ayahuasca use for methamphetamine use disorders and other mental health challenges: case studies in an indigenous community in Sonora, Mexico J Psychoactive Drugs 2023 55 5 549 557 10.1080/02791072.2023.2255182 37675972 20 Perkins D Pagni BA Sarris J Barbosa PCR Chenhall R. Changes in mental health, wellbeing and personality following ayahuasca consumption: results of a naturalistic longitudinal study Front Pharmacol 2022 13 884703 10.3389/fphar.2022.884703 36386199 PMC9643165 21 Hamill J Hallak J Dursun SM Baker G. Ayahuasca: psychological and physiologic effects, pharmacology and potential uses in addiction and mental illness Curr Neuropharmacol 2019 17 2 108 128 10.2174/1570159X16666180125095902 29366418 PMC6343205 22 Loizaga-Velder A Loizaga Pazzi A. Traditional medicine, culture, and psychedelic science: new pathways for recovery from substance use disorders J Stud Alcohol Drugs 2024 85 5 595 606 10.15288/jsad.23-00011 39400118 23 Dos Santos RG Hallak JEC. Ayahuasca, an ancient substance with traditional and contemporary use in neuropsychiatry and neuroscience Epilepsy Behav 2021 121 Pt B 106300 10.1016/j.yebeh.2019.04.053 31182391 24 Brito-da-Costa AM Dias-da-Silva D Gomes NGM Dinis-Oliveira RJ Madureira-Carvalho Á Toxicokinetics and toxicodynamics of ayahuasca alkaloids N,N-dimethyltryptamine (DMT), harmine, harmaline and tetrahydroharmine: clinical and forensic impact Pharmaceuticals 2020 13 11 10.3390/ph13110334 PMC7690791 33114119 25 Ross S Agrawal M Griffiths RR Grob C Berger A Henningfield JE. Psychedelic-assisted psychotherapy to treat psychiatric and existential distress in life-threatening medical illnesses and palliative care Neuropharmacol 2022 216 109174 10.1016/j.neuropharm.2022.109174 35772523 26 Best G Morunga E Wells A Allison J Reynolds L. A cross-sectional survey investigating Māori and Non-Māori Cancer Patients’ views on psychedelic-assisted therapy in Aotearoa New Zealand J Psychoactive Drugs 2024 1 13 10.1080/02791072.2024.2397427 39230415 27 Agin-Liebes GI Malone T Yalch MM et al Long-term follow-up of psilocybin-assisted psychotherapy for psychiatric and existential distress in patients with life-threatening cancer J Psychopharmacol 2020 34 2 155 166 10.1177/0269881119897615 31916890 28 Beaussant Y Tarbi E Nigam K et al Acceptability of psilocybin-assisted group therapy in patients with cancer and major depressive disorder: qualitative analysis Cancer 2024 130 7 1147 1157 10.1002/cncr.35024 38105653 29 Breeksema JJ Niemeijer A Krediet E et al Patient perspectives and experiences with psilocybin treatment for treatment-resistant depression: a qualitative study Sci Rep 2024 14 1 2929 10.1038/s41598-024-53188-9 38316896 PMC10844281 30 Tong A Sainsbury P Craig J. Consolidated criteria for reporting qualitative research (COREQ): a 32-item checklist for interviews and focus groups Int J Qual Health Care 2007 19 6 349 357 10.1093/intqhc/mzm042 17872937 31 Niles H Fogg C Kelmendi B Lazenby M. Palliative care provider attitudes toward existential distress and treatment with psychedelic-assisted therapies BMC Palliat Care 2021 20 1 191 10.1186/s12904-021-00889-x 34930220 PMC8690623 32 Reynolds LM Akroyd A Sundram F Stack A Muthukumaraswamy S Evans WJ. Cancer healthcare workers’ perceptions toward psychedelic-assisted therapy: a preliminary investigation Int J Environ Res Public Health 2021 18 15 10.3390/ijerph18158160 PMC8346095 34360453 33 Braun V Clarke V. Using thematic analysis in psychology Qual Res Psychol 2006 3 2 77 101 10.1191/1478088706qp063oa 34 Ajzen I. The theory of planned behavior Organ Behav Hum Decis Process 1991 50 2 179 211 10.1016/0749-5978(91)90020-T 35  NVivo (Version 12) QSR International; 2018 https://www.qsrinternational.com/nvivo-qualitative-data-analysis-software/home 36 Pollan M. How To Change Your Mind: What the New Science of Psychedelics Teaches Us About Consciousness, Dying, Addiction, Depression, and Transcendence Penguin Publishing Group 2018 10.1080/02791072.2018.1535149 30376643 37 Wang T Tang C Jiang X Guo Y Zhu S Xu Q. Effectiveness of web-based mindfulness-based interventions for patients with cancer: systematic review and meta-analyses J Med Internet Res 2024 26 10.2196/47704 PMC11234071 38917445 38 Plourde L Chang SL Farzin H et al Social acceptability of psilocybin-assisted therapy for existential distress at the end of life: a population-based survey Palliat Med 2024 38 2 272 278 10.1177/02692163231222430 38253521 PMC10865753 39 Patchett-Marble R O’Sullivan S Tadwalkar S Hapke E. Psilocybin mushrooms for psychological and existential distress: treatment for a patient with palliative lung cancer Can Fam Physician 2022 68 11 823 827 10.46747/cfp.6811823 36376043 PMC9833165 40 Beaussant Y Sanders J Sager Z et al Defining the roles and research priorities for psychedelic-assisted therapies in patients with serious illness: expert clinicians’ and Investigators’ Perspectives J Palliat Med 2020 23 10 1323 1334 10.1089/JPM.2019.0603 32233936 41 Davis AK Barrett FS May DG et al Effects of psilocybin-assisted therapy on major depressive disorder: a randomized clinical trial JAMA Psychiatr 2021 78 5 481 489 10.1001/jamapsychiatry.2020.3285 PMC7643046 33146667 42 Marchi M Farina R Rachedi K et al Psychedelics as an intervention for psychological, existential distress in terminally ill patients: a systematic review and network meta-analysis J Psychopharmacol 2024 10.1177/02698811241303594 39655749 43 Bottemanne H Berkovitch L Gauld C et al Storm on predictive brain: a neurocomputational account of ketamine antidepressant effect Neurosci Biobehav Rev 2023 154 105410 10.1016/j.neubiorev.2023.105410 37793581 44 Andrade C. Ketamine for depression, 1: clinical summary of issues related to efficacy, adverse effects, and mechanism of action J Clin Psychiatry 2017 78 4 10.4088/JCP.17f11567 28448702 45 Wan LB Levitch CF Perez AM et al Ketamine safety and tolerability in clinical trials for treatment-resistant depression J Clin Psychiatry 2015 76 3 247 252 10.4088/JCP.13m08852 25271445 46 Kokane SS Armant RJ Bolaños-Guzmán CA Perrotti LI. Overlap in the neural circuitry and molecular mechanisms underlying ketamine abuse and its use as an antidepressant Behav Brain Res 2020 384 112548 10.1016/j.bbr.2020.112548 32061748 PMC7469509 47 Nadeem Z Parker S McGovern H Oestreich LK. Attitudes toward psychedelics and psychedelic-assisted therapy among potential mental health service users and the general population in Australia Aust N Z J Psychiatr 2024 58 10 904 913 10.1177/00048674241261779 PMC11420588 38907608 48 Hinkle JT Graziosi M Nayak SM Yaden DB. Adverse events in studies of classic psychedelics: a systematic review and meta-analysis JAMA Psychiatr 2024 81 12 1225 1235 10.1001/jamapsychiatry.2024.2546 PMC11375525 39230883 49 Ghaznavi S Ruskin JN Haggerty SJ King F 4th Rosenbaum JF. Primum non nocere: the onus to characterize the potential harms of psychedelic treatment Am J Psychiatr 2025 182 1 47 53 10.1176/appi.ajp.20230914 39741443 50 Palitsky R Kaplan DM Peacock C et al Importance of integrating spiritual, existential, religious, and theological components in psychedelic-assisted therapies JAMA Psychiatr 2023 80 7 743 749 10.1001/jamapsychiatry.2023.1554 37256584 51 Peacock C Mascaro JS Brauer E et al Spiritual health practitioners’ contributions to psychedelic assisted therapy: a qualitative analysis PLoS One 2024 19 1 10.1371/journal.pone.0296071 PMC10760908 38166057 52 Center PR. Canada’s Changing Religious Landscape Pew Research Center Accessed April 3, 2025 https://www.pewresearch.org/religion/2013/06/27/canadas-changing-religious-landscape/ 53 Cornelissen L. Religiosity in Canada and its Evolution from 1985 to 2019 Statistics Canada Accessed April 3, 2025 https://www150.statcan.gc.ca/n1/pub/75-006-x/2021001/article/00010-eng.htm 54 Belouin SJ Averill LA Henningfield JE et al Policy considerations that support equitable access to responsible, accountable, safe, and ethical uses of psychedelic medicines Neuropharmacol 2022 219 109214 10.1016/j.neuropharm.2022.109214 PMC9536012 35973601 55 Hatfield SP Thornton NL Greenstien K Glozier N. A taxonomy of regulatory and policy matters relevant to psychedelic-assisted therapy in Australia Aust N Z J Psychiatr 2024 58 7 571 590 10.1177/00048674241240597 PMC11193325 38628079 56 Becker E. The Denial of Death Free Press 1973 57 Gawande A Being Mortal: Medicine and What Matters in the End Metropolitan Books/Henry Holt and Company 2014 283 58 Breitbart W Rosenfeld B Pessin H Applebaum A Kulikowski J Lichtenthal WG. Meaning-centered group psychotherapy: an effective intervention for improving psychological well-being in patients with advanced cancer J Clin Oncol 2015 33 7 749 754 10.1200/JCO.2014.57.2198 25646186 PMC4334778 59 Rodin G Lo C Rydall A et al Managing cancer and living meaningfully (CALM): a randomized controlled trial of a psychological intervention for patients with advanced cancer J Clin Oncol 2018 36 23 2422 2432 10.1200/JCO.2017.77.1097 29958037 PMC6085180 60 Frankl V. Man’s Search for Meaning: An Introduction to Logotherapy. A Newly Revised and Enlarged Edition of From Death-Camp to Existentialism Beacon Press 1962 61 Schimmers N Breeksema JJ Smith-Apeldoorn SY Veraart J van den Brink W Schoevers RA. Psychedelics for the treatment of depression, anxiety, and existential distress in patients with a terminal illness: a systematic review Psychopharmacology (Berl) 2022 239 1 15 33 10.1007/s00213-021-06027-y 34812901 62 Vehling S Philipp R. Existential distress and meaning-focused interventions in cancer survivorship Curr Opin Support Palliat Care 2018 12 1 46 51 10.1097/SPC.0000000000000324 29251694 63 Martínez M Arantzamendi M Belar A et al ’Dignity therapy’, a promising intervention in palliative care: a comprehensive systematic literature review Palliat Med 2017 31 6 492 509 10.1177/0269216316665562 27566756 PMC5405836 64 Chochinov HM Hack T Hassard T Kristjanson LJ McClement S Harlos M. Dignity therapy: a novel psychotherapeutic intervention for patients near the end of life J Clin Oncol 2005 23 24 5520 5525 10.1200/jco.2005.08.391 16110012 65 Park S Sato Y Takita Y et al Mindfulness-based cognitive therapy for psychological distress, fear of cancer recurrence, fatigue, spiritual Well-Being, and quality of life in patients with breast cancer-a randomized controlled trial J Pain Symptom Manag 2020 60 2 381 389 10.1016/j.jpainsymman.2020.02.017 32105790 66 Griffiths RR Johnson MW Carducci MA et al Psilocybin produces substantial and sustained decreases in depression and anxiety in patients with life-threatening cancer: a randomized double-blind trial J Psychopharmacol 2016 30 12 1181 1197 10.1177/0269881116675513 27909165 PMC5367557 67 Sulmasy DP. A biopsychosocial-spiritual model for the care of patients at the end of life Gerontologist 2002 24 33 10.1093/geront/42.suppl_3.24 12415130 68 Puchalski CM Vitillo R Hull SK Reller N. Improving the spiritual dimension of whole person care: reaching national and international consensus J Palliat Med 2014 17 6 642 656 10.1089/jpm.2014.9427 24842136 PMC4038982 ",
  "metadata": {
    "Title of this paper": "Improving the spiritual dimension of whole person care: reaching national and international consensus",
    "Journal it was published in:": "Integrative Cancer Therapies",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476497/"
  }
}