{
  "title": "Paper_514",
  "abstract": "AJNR Am J Neuroradiol AJNR Am J Neuroradiol 3743 ajnr AJNR AJNR: American Journal of Neuroradiology 0195-6108 1936-959X American Society of Neuroradiology PMC11448996 PMC11448996.1 11448996 11448996 38816022 10.3174/ajnr.A8363 24-00157 1 Neurovascular/Stroke Imaging Fellows' Journal Club Absence of the Susceptibility Vessel Sign with Cancer-Associated Hypercoagulability-Related Stroke https://orcid.org/0000-0002-1753-7598 Fukunaga Daiki a Fujinami Jun a https://orcid.org/0000-0003-4862-0543 Kishitani Toru a Tokuda Naoki a https://orcid.org/0000-0003-2888-631X Numa Soichiro a https://orcid.org/0000-0003-2203-7077 Nagakane Yoshinari a a Please address correspondence to Yoshinari Nagakane, MD, PhD, Department of Neurology, Kyoto Second Red Cross Hospital, 355-5 Haruobicho, Kamanza-dori Marutamachi-agaru, Kamigyo-ku, Kyoto-shi, Japan ynagakane@gmail.com 10 2024 45 10 472108 1427 1431 16 2 2024 27 5 2024 01 10 2025 01 10 2025 04 10 2024 01 10 2025 © 2024 by American Journal of Neuroradiology 2024 American Journal of Neuroradiology Cancer-associated hypercoagulability-related stroke is presumably caused by fibrin-predominant thrombi and is associated with the absence of the susceptibility vessel sign (sensitivity of 90%/specificity of 78%/ likelihood ratio of 4.06). This is in contradistinction to cardioembolic erythrocyte-predominant thrombi, which demonstrate hypointense signal on T2-weighted gradient-recalled echo images (susceptibility vessel sign). BACKGROUND AND PURPOSE: The susceptibility vessel sign, a hypointense signal on MR T2-weighted gradient-recalled echo images, is associated with erythrocyte-predominant thrombi, which are often present in cardioembolism. In contrast, cancer-associated hypercoagulability (CAH)-related stroke, which is presumably caused by fibrin-predominant thrombi, is associated with the absence of the susceptibility vessel sign. We hypothesized that the prevalence of the susceptibility vessel sign may be helpful in distinguishing CAH-related stroke from cardioembolism. This study attempted to validate this hypothesis and investigated the usefulness of the susceptibility vessel sign in differentiating CAH-related stroke from cardioembolism. MATERIALS AND METHODS: We retrospectively studied patients with both CAH-related stroke (CAH group) and cardioembolism (cardioembolism group) who had major cerebral artery occlusion on MRA that was performed within 6 hours of stroke onset. All patients visited our department from 2015 to 2021. CAH-related stroke was defined as the following: 1) complication of active cancer, 2) pretreatment D-dimer value of >3 μg/mL, 3) multiple vascular territory infarctions, and 4) lack of any other specifically identified causes of stroke. We compared susceptibility vessel sign positivity rates within each group. Multivariable logistic regression analysis was used to assess the association between the absence of the susceptibility vessel sign and CAH-related stroke. RESULTS: Of 691 patients with CAH-related stroke or cardioembolism, major cerebral artery occlusion was observed in 10 patients in the CAH group and 198 patients in the cardioembolism group. The absence of the susceptibility vessel sign was identified in 55 of 208 patients and was significantly more frequent in the CAH group versus the cardioembolism group (90% versus 24%, P P CONCLUSIONS: The absence of the susceptibility vessel sign was more frequent in CAH-related stroke than in cardioembolism. These findings could potentially be helpful for clinical management and differentiating cardioembolism and CAH-related stroke. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Absence of the Susceptibility Vessel Sign with Cancer-Associated Hypercoagulability-Related Stroke",
    "Journal it was published in:": "AJNR: American Journal of Neuroradiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11448996/"
  }
}