{
  "title": "Paper_378",
  "abstract": "pmc BMC Oral Health BMC Oral Health 53 bmcorhl BMC Oral Health 1472-6831 BMC PMC12482573 PMC12482573.1 12482573 12482573 41023659 10.1186/s12903-025-06908-0 6908 1 Research Evaluation of the effect of melatonin and ascorbic acid on bone healing in a rat model of osteoradionecrosis induced by tooth extraction http://orcid.org/0000-0002-7784-9809 Keldal Göksal drgoksalkeldal@gmail.com 1 http://orcid.org/0000-0002-0807-9089 Çolak Sefa 1 http://orcid.org/0000-0001-6802-2984 Avcı Gülhan Güler 2 http://orcid.org/0000-0002-3722-2542 Gevrek Fikret 3 1 https://ror.org/01rpe9k96 grid.411550.4 0000 0001 0689 906X Department of Oral and Maxillofacial Surgery, Faculty of Dentistry, Tokat Gaziosmanpaşa University, Ali Sevki Erek Yerleskesi,, 2 https://ror.org/01rpe9k96 grid.411550.4 0000 0001 0689 906X Department of Radiation Oncology, Faculty of Medicine, Tokat Gaziosmanpaşa University, 3 https://ror.org/01rpe9k96 grid.411550.4 0000 0001 0689 906X Department of Histology and Embryology, Faculty of Medicine, Tokat Gaziosmanpaşa University, 29 9 2025 2025 25 478159 1488 21 5 2025 3 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Radiotherapy applied in the treatment of head and neck cancers significantly increases the risk of developing osteoradionecrosis (ORN). As there is no universally accepted standard treatment protocol for ORN, evaluating the potential therapeutic effects of antioxidant agents such as melatonin and ascorbic acid is of great importance. This study aimed to investigate the effects of these agents on bone healing in an experimental ORN model through histopathological and immunohistochemical analyses. Methods A total of 41 young-adult male Wistar-Albino rats were included in the study. All rats in the experimental groups received a single 20 Gy dose of radiotherapy, followed by tooth extraction seven days later. Group G3 received 20 mg/kg of melatonin intraperitoneally for 21 days post-RT and tooth extraction. Group G4 received 100 mg/kg of ascorbic acid intraperitoneally for 21 days. Group G5 received a combination of melatonin and ascorbic acid (20 mg/kg + 100 mg/kg) for the same duration. Immunohistochemical analyses were performed to evaluate bone healing, focusing on the expression of Bone Morphogenetic Protein-2 (BMP-2), Alkaline Phosphatase (ALP), Osteonectin (ONC), and Tartrate-Resistant Acid Phosphatase (TRAP). Results ALP expression was significantly lower in the G2 group compared to both G1 and G5 ( p p p Conclusions The findings indicate that melatonin and ascorbic acid may exert protective effects against ORN by enhancing bone healing. Trial registration : Clinical trial number: not applicable. Keywords Ascorbic acid Mandible Melatonin Osteoradionecrosis Rat Tokat Gaziosmanpasa University Scientific Research Project Unit TOGU BAP Project No: 2024-13 TOGU BAP Project No: 2024-13 TOGU BAP Project No: 2024-13 TOGU BAP Project No: 2024-13 Keldal Göksal Çolak Sefa Avcı Gülhan Güler Gevrek Fikret pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Radiotherapy (RT), also referred to as radiation therapy, is a physical modality employed to destroy cancer cells through ionizing radiation. This form of radiation generates ions and deposits energy within tissues, leading to direct cytotoxic effects on cancer cells or inducing genetic alterations that ultimately result in cell death [ 1 2 3 4 RT is widely used alongside surgery and chemotherapy in the treatment of head and neck cancers. However, RT is also associated with several adverse effects, including xerostomia, mucositis, radiation caries, increased susceptibility to infections, and one of the most severe complications—osteoradionecrosis (ORN) [ 5 6 7 8 The pathophysiology of ORN has been extensively studied over the years. The most widely accepted mechanism today is the fibro atrophic process induced by radiotherapy, which progresses through three phases. Initially, radiation-induced endothelial damage increases vascular permeability, leading to edema, localized microvascular ischemia, and endothelial cell death, which in turn triggers chronic nonspecific inflammation. In the second phase, abnormal fibroblast activity and extracellular matrix disorganization are observed. The final phase, termed the fibro atrophic stage, is characterized by apoptosis of myofibroblasts, a reduction in cell numbers, and the accumulation of dense collagen resulting in fibrosis. These changes collectively describe the destructive and often irreversible impact of radiation on bone tissue [ 9 10 Melatonin, primarily synthesized by the pineal gland, is known for regulating circadian rhythms. It also exhibits potent antioxidant and anti-inflammatory properties [ 11 12 13 15 16 17 Ascorbic acid (vitamin C) is a water-soluble vitamin essential for numerous physiological processes [ 18 19 20 21 23 The aim of this study is to evaluate the effects of melatonin and ascorbic acid on bone healing in a rat mandibular osteoradionecrosis (ORN) model induced by radiotherapy (RT) and tooth extraction, and to investigate the potential therapeutic roles these agents may play in the symptomatic treatment or prevention of ORN progression. In this context, the hypothesis of the study is that melatonin and ascorbic acid administration may reduce ORN development by promoting bone healing and improving histopathological and immunohistochemical parameters in a rat mandibular ORN model induced by RT and tooth extraction. Materials and methods Ethical approval This research was approved by the Local Ethics Committee for Animal Experiments of Tokat Gaziosmanpasa University (Approval number: 51879863-16; Date: 07.03.2024) (Clinical trial number: not applicable). All procedures were conducted in accordance with the institutional guidelines of the Tokat Gaziosmanpasa University Experimental Medical Research Center, the university’s animal experimentation regulations Animal preparation In this study, 41 young adult male Wistar-Albino rats weighing between 300 and 400 g were used. The rats were bred at the Experimental Medical Research Unit of Gaziosmanpaşa University and housed under controlled environmental conditions (20–22 °C temperature, 40–60% humidity) during the experimental period. A 12-hour light/dark cycle was maintained to simulate artificial day and night. The animals were fed with standard pellet chow (20 g/day) and had access to water (40 ml/day) ad libitum. Five rats were assigned to the control group, and the remaining 36 were allocated to the experimental groups. All experimental groups received head and neck irradiation. The same anesthesia protocol, surgical procedures, and follow-up durations were applied to all animals. The experimental protocol is schematized in Fig. 1 24 Fig. 1 Schematic illustration of the experimental procedure Experimental Groups:  G1 (Control, n=5): No treatment was applied. G2 (RT+EX, n=9): A single dose of 20 Gy radiotherapy was applied, followed by extraction of the three mandibular molars on day 7; no additional treatment was given. G3 (RT+EX+MEL, n=9): In addition to the procedures in G2, melatonin was administered daily at a dose of 20 mg/kg for 21 days following tooth extraction. G4 (RT+EX+Cvit, n=9): In addition to the procedures in G2, ascorbic acid was administered daily at a dose of 100 mg/kg for 21 days following tooth extraction. G5 (RT+EX+MEL+Cvit, n=9): In addition to the procedures in G2, a combination of melatonin (20 mg/kg) and ascorbic acid (100 mg/kg) was administered daily for 21 days following tooth extraction. Irradiation and surgical procedure Radiotherapy was administered using a Varian Clinac DHX 5776 Linear Accelerator (Varian Medical Systems, Palo Alto, CA, USA) at the Radiation Oncology Department of Tokat Gaziosmanpasa University under the supervision of a radiation oncologist. General anesthesia was achieved with intraperitoneal injections of 100 mg/kg Ketamine HCl (Ketalar ® 24 Administration of melatonin and ascorbic acid Melatonin (Sigma Aldrich, St. Louis, Missouri, USA) was prepared by dissolving 2 g of powder in 1.5 ml of absolute alcohol and 90 ml of physiological saline to yield a 98.3% solution. Rats in Groups 3 and 5 received daily intraperitoneal injections of melatonin at a dose of 20 mg/kg for 21 days [ 25 26 27 Melatonin and ascorbic acid administrations were performed intraperitoneally at approximately 2 h after the onset of the light phase (around 10:00 a.m.), based on the 12-hour light/dark cycle of the rats. The timing of administration was kept consistent across all experimental groups. Sacrifice and tissue sampling On day 28 post-RT, all animals were euthanized via high-dose intraperitoneal injections of 100 mg/kg Ketamine HCl and 10 mg/kg Xylazine. Following euthanasia by decapitation, the left mandibles were surgically removed using a piezoelectric device. Surrounding soft tissues were cleared, and the regions designated for histological analysis were isolated and fixed in 4% buffered formalin for 48 h, followed by decalcification in an EDTA solution for one month. Samples were embedded in paraffin blocks in a standardized vertical orientation. Serial 4 μm-thick sections were cut using a rotary microtome (Leica RM2135, Germany) and mounted on slides for hematoxylin-eosin (H&E) and immunohistochemical staining. Hematoxylin-eosin staining Sections were deparaffinized, rehydrated through graded alcohols, and stained with hematoxylin, followed by washing, acid-alcohol differentiation, and eosin counterstaining. Sections were then dehydrated through graded alcohols, cleared in xylene, and coverslipped. Microscopic evaluation was performed using a Nikon Eclipse 200 light microscope. Qualitative assessment of the structural condition of the mandibular bone surrounding the extraction and irradiation sites was carried out in all groups. Immunohistochemical staining Four-micrometer-thick paraffin sections were used for indirect immunohistochemical staining to detect the expression of ALP, BMP-2, ONC, and TRAP. Following deparaffinization and rehydration, antigen retrieval was performed in 10 mM citric acid using a microwave. Endogenous peroxidase activity was blocked with 3% hydrogen peroxide for 10 min. After rinsing in PBS and hydrophobic demarcation, non-immune blocking serum was applied for 15 min. Primary antibodies (ALP, BMP-2, ONC, TRAP) were applied overnight at 4 °C. After PBS washes, biotinylated secondary antibodies and streptavidin-HRP conjugates were sequentially applied. Immunoreactivity was visualized using aminoethyl carbazole (AEC) chromogen, followed by hematoxylin counterstaining. Negative controls were prepared by omitting the primary antibodies. Immunohistochemical analysis Immunoreactivity for ALP, BMP-2, ONC, and TRAP in the bone tissue adjacent to the irradiated and extraction sites was scored using a four-tier system (0 = no staining, 1+ = weak, 2+ = moderate, 3+ = strong) under 40x magnification with a Nikon Eclipse 200 microscope and the NIS-Elements software (Hasp ID: 6648AA61; Nikon, Japan). H-scores were calculated using the formula [∑Pi(i+1)], where is the staining intensity score and Pi is the percentage of stained cells. The mean and standard error values are collectively presented in Table 1 p Table 1 Group mean h-scores representing immunohistochemical staining intensities of ALP, BMP-2, ONC, and TRAP molecules in a single table format Group ALP (Mean ± SEM) BMP-2 (Mean ± SEM) ONC (Mean ± SEM) TRAP (Mean ± SEM) G1 216.85 ± 3.39ᵃ 243.62 ± 3.99ᵃ 173.05 ± 9.21ᵃ 96.02 ± 4.04ᵃ G2 128.09 ± 11.90ᶜ 180.07 ± 13.57ᶜ 93.78 ± 3.19ᶜ 147.74 ± 17.82ᶜ G3 159.02 ± 9.98ᵇ 198.74 ± 11.71ᵇ 102.98 ± 7.49ᵇ 130.39 ± 4.88ᵇ G4 165.07 ± 13.73ᵇ 182.66 ± 11.01ᶜ 99.25 ± 2.54ᵇ 105.69 ± 11.80ᵃ G5 222.67 ± 9.57ᵃ 224.19 ± 17.76ᵃᵇ 154.93 ± 10.80ᵃ 137.02 ± 17.43ᵇᶜ SEM Statistical analysis was performed using one-way ANOVA followed by Tukey's HSD post hoc test (p < 0.05). Different superscript letters within the same row indicate statistically significant differences between groups Statistical analysis All statistical analyses were performed using SPSS 22.0 software (IBM, USA). Levene’s test was applied to assess variance homogeneity. As the data met the assumptions for parametric testing, one-way ANOVA was used to compare groups. Tukey’s HSD post hoc test was applied for multiple comparisons of H-scores for ALP, BMP-2, ONC, and TRAP. Results were expressed as mean ± standard error of the mean (SEM). Statistical significance was set at p Results Histopathological Findings In the hematoxylin-eosin-stained sections of the control group (G1), normal histological architecture of the mandibular bone was observed, including intact teeth, surrounding periodontal ligaments, and alveolar bone tissue. In the RT and tooth extraction group (G2), microscopic evaluation revealed substantial tissue damage, including intense inflammation, tissue erosion, ulceration, and disrupted normal bone architecture in the socket area and adjacent tissues. In the melatonin-treated group (G3), a slight reduction in inflammation, tissue erosion, and overall damage was observed in the socket region and surrounding bone compared to G2. The ascorbic acid group (G4) showed similar histological features to G3, with mild improvements in tissue architecture and a reduction in inflammatory changes around the extraction site. In the combined melatonin and ascorbic acid group (G5), substantial reduction in tissue damage was observed. The socket area and surrounding tissues exhibited reparative tissue formation with re-epithelialization, indicating marked histological improvement. The histopathological images are collectively presented in Figure 2 Fig. 2 Representative Hematoxylin and Eosin-Stained Microscopic Images of the Study Groups (Scale bars: 250 µm) Immunohistochemical findings The highest H-score for ALP expression was observed in Group 5, followed by Groups 1, 4, 3, and 2. Statistically significant differences were noted between Group 2 and both Group 1 ( p p 3 Fig. 3 Representative immunohistochemically stained microscopic images for the ALP molecule from each experimental group (IHC-AEC, Scale Bars: 25 µm) p 4 Fig. 4 Representative immunohistochemically stained microscopic images for the BMP-2 molecule from each experimental group (IHC-AEC, Scale Bars: 25 µm) p 5 Fig. 5 Representative immunohistochemically stained microscopic images for the ONC molecule from each experimental group (IHC-AEC, Scale Bars: 25 µm) 6 Fig. 6 Representative immunohistochemically stained microscopic images for the TRAP molecule from each experimental group (IHC-AEC, Scale Bars: 25 µm) Discussion In this study, various histological and immunohistochemical analyses were conducted to evaluate the potential therapeutic effects of melatonin and ascorbic acid against the adverse effects of radiotherapy on bone tissue. Accordingly, the severity of osteoradionecrosis and the levels of inflammation were assessed histologically, while the expression levels of osteonectin (ONC), tartrate-resistant acid phosphatase (TRAP), alkaline phosphatase (ALP), and bone morphogenetic protein-2 (BMP-2) were evaluated immunohistochemically. The study findings revealed a decrease in osteoblastic markers (BMP-2, ALP, ONC) and an increase in TRAP levels in the radiotherapy-only group (G2), indicating enhanced osteoclastic activity and suppressed bone formation associated with RT. These results are consistent with previous descriptions in the literature characterizing ORN by increased bone resorption within a hypovascular, hypocellular, and hypoxic environment [ 6 28 The primary approach in the treatment of osteoradionecrosis (ORN) involves the removal of necrotic tissue and the promotion of tissue healing. In addition to surgical debridement, several adjunctive therapies are commonly used, including pentoxifylline, which enhances vasodilation and suppresses inflammation; a combination of tocopherol and vitamin K due to their antioxidant properties; and hyperbaric oxygen (HBO) therapy, which supports angiogenesis and collagen synthesis [ 29 34 6 In the melatonin-treated G3 group, increased expression levels of BMP-2, ONC, and ALP were observed, while TRAP expression was decreased compared to the RT group. This trend supports the notion that melatonin enhances osteoblastic activity while suppressing osteoclastic processes. Previous studies have reported that melatonin increases bone mineral density, reduces oxidative stress, promotes vascularization and osteoblast differentiation, and directly supports osteogenesis by accelerating the expression of bone-related markers [ 13 25 35 41 42 In the G4 group treated with vitamin C, similar to the melatonin group, an increase in osteoblastic markers and a decrease in TRAP levels were observed. This trend supports the osteoblast-promoting and osteoclast-inhibiting effects of vitamin C. Previous studies have also associated the osteoprotective effects of vitamin C on bone tissue with enhanced osteoblastic activity and suppressed osteoclastic processes [ 43 45 46 49 The study findings revealed a decrease in osteoblastic markers (BMP-2, ALP, ONC) and an increase in TRAP levels in the radiotherapy-only group (G2), indicating enhanced osteoclastic activity and suppressed bone formation associated with RT. These results are consistent with previous descriptions in the literature characterizing ORN by increased bone resorption within a hypovascular, hypocellular, and hypoxic environment [ 6 28 The primary approach in the treatment of osteoradionecrosis (ORN) involves the removal of necrotic tissue and the promotion of tissue healing. In addition to surgical debridement, several adjunctive therapies are commonly used, including pentoxifylline, which enhances vasodilation and suppresses inflammation; a combination of tocopherol and vitamin K due to their antioxidant properties; and hyperbaric oxygen (HBO) therapy, which supports angiogenesis and collagen synthesis [ 29 34 6 In the melatonin-treated G3 group, increased expression levels of BMP-2, ONC, and ALP were observed, while TRAP expression was decreased compared to the RT group. This trend supports the notion that melatonin enhances osteoblastic activity while suppressing osteoclastic processes. Previous studies have reported that melatonin increases bone mineral density, reduces oxidative stress, promotes vascularization and osteoblast differentiation, and directly supports osteogenesis by accelerating the expression of bone-related markers [ 13 25 35 41 42 In the G4 group treated with vitamin C, similar to the melatonin group, an increase in osteoblastic markers and a decrease in TRAP levels were observed. This trend supports the osteoblast-promoting and osteoclast-inhibiting effects of vitamin C. Previous studies have also associated the osteoprotective effects of vitamin C on bone tissue with enhanced osteoblastic activity and suppressed osteoclastic processes [ 43 45 46 49 In the G5 group, where melatonin and ascorbic acid were administered in combination, BMP-2, ALP, and ONC expression levels increased, and TRAP expression decreased—similar to the G3 and G4 groups. These findings indicate that the combined use of melatonin and vitamin C promotes osteoblastic activity while suppressing osteoclastic processes, thereby positively influencing bone regeneration. This dual effect is particularly noteworthy in clinically challenging conditions such as osteoradionecrosis (ORN) following radiotherapy, due to its potential to accelerate bone healing. Indeed, a study on human lymphocytes demonstrated that the combination of melatonin and ascorbic acid significantly reduced X-ray–induced genotoxicity when administered prior to irradiation, as evaluated by the micronucleus assay [ 50 51 This study was conducted using an experimental animal model to evaluate the effects of melatonin and ascorbic acid on radiation-induced bone damage. However, there are certain limitations regarding the translational applicability of the findings to clinical settings. First, the rat model used in this study differs physiologically, anatomically, and metabolically from humans. Bone healing in rats occurs more rapidly, and their systemic responses to pharmacological agents may not fully reflect those in humans. This discrepancy limits the direct clinical translatability of the results. Additionally, melatonin and ascorbic acid were administered via the intraperitoneal route. Compared to commonly used human routes (oral or topical), intraperitoneal administration results in higher bioavailability. Therefore, the effects of these agents may vary depending on the dose, duration of administration, and pharmacokinetic characteristics. Another important limitation of the study is the lack of radiographic imaging to evaluate potential root fractures, residual tooth fragments, or osteolytic changes following tooth extraction. The absence of radiographic assessment may have led to the omission of early signs of bone resorption and introduces potential bias in the interpretation of histological findings. To mitigate this limitation, histological sampling was carefully performed from macroscopically verified regions free of root remnants. Future studies incorporating pre- and post-extraction radiographic monitoring would contribute to more comprehensive and objective morphological and quantitative evaluations. Conclusion The findings of this study suggest that melatonin and ascorbic acid exert radioprotective effects against radiation-induced bone damage via two key pathogenetic mechanisms. Immunohistochemical analyses revealed a significant increase in the levels of ALP, BMP-2, and osteonectin (ONC) markers of osteoblastic activity-particularly in the group treated with a combination of melatonin and vitamin C. This upregulation indicates an enhancement of osteogenic activity supporting new bone formation. Conversely, the expression of TRAP, a marker of bone resorption and osteoclastic activity, was suppressed in the same groups. These results demonstrate that melatonin and ascorbic acid not only stimulate osteoblastic processes but also inhibit osteoclastic degradation, thereby exhibiting a dual regulatory effect. The synergistic impact observed in the combination group highlights the potential of melatonin and vitamin C as therapeutic agents in preventing osteoradionecrosis and promoting bone regeneration; however, further clinical studies are necessary to validate these findings. Abbreviations ORN Osteoradionecrosis RT Radiotherapy BMP-2 Bone Morphogenetic Protein-2 ALP Alkaline Phosphatase ONC Osteonectin TRAP Tartrate-Resistant Acid Phosphatase EX Extraction MEL Melatonin CVit Ascorbic Acid (Vitamin C) H&E Hematoxylin-eosin IHC Immunohistochemistry HBO Hyperbaric Oxygen COPD Chronic Obstructive Pulmonary Disease SRP Scaling And Root Planing Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements None. Authors’ contributions Göksal Keldal: investigation, data curation, writing–original draft, methodology, writing–review and editing. Sefa Çolak: conceptualization, supervision, writing–review and editing, funding acquisition. Fikret Gevrek: data curation, methodology, supervision, conceptualization. Gülhan Güler Avcı: investigation, data curation, methodology, conceptualization, supervision. Funding This study was supported by Tokat Gaziosmanpasa University Scientific Research Project Unit (TOGU BAP Project No: 2024-13). Data availability The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This research was approved by the Local Ethics Committee for Animal Experiments of Tokat Gaziosmanpasa University (Approval number: 51879863-16; Date: 07.03.2024) (Clinical trial number: not applicable). All procedures were conducted in accordance with the institutional guidelines of the Tokat Gaziosmanpasa University Experimental Medical Research Center, the university’s animal experimentation regulations. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Human and animal rights and informed consent All procedures were conducted in accordance with the institutional guidelines of the Tokat Gaziosmanpasa University Experimental Medical Research Center, the university’s animal experimentation regulations, and the ethical principles outlined in the Helsinki Declaration for animal research. References 1. Baskar R Lee KA Yeo R Yeoh K-W Cancer and radiation therapy: current advances and future directions Int J Med Sci 2012 9 193 9 10.7150/ijms.3635 22408567 PMC3298009 Baskar R, Lee KA, Yeo R, Yeoh K-W. Cancer and radiation therapy: current advances and future directions. Int J Med Sci. 2012;9:193–9. 22408567 10.7150/ijms.3635 PMC3298009 2. Sakurai T Sawada Y Yoshimoto M Kawai M Miyakoshi J Radiation-induced reduction of osteoblast differentiation in C2C12 cells J Radiat Res 2007 48 515 21 10.1269/jrr.07012 17928745 Sakurai T, Sawada Y, Yoshimoto M, Kawai M, Miyakoshi J. Radiation-induced reduction of osteoblast differentiation in C2C12 cells. J Radiat Res. 2007;48:515–21. 17928745 10.1269/jrr.07012 3. Henriksen K Bollerslev J Everts V Karsdal MA Osteoclast activity and subtypes as a function of physiology and pathology–implications for future treatments of osteoporosis Endocr Rev 2011 32 31 63 10.1210/er.2010-0006 20851921 Henriksen K, Bollerslev J, Everts V, Karsdal MA. Osteoclast activity and subtypes as a function of physiology and pathology–implications for future treatments of osteoporosis. Endocr Rev. 2011;32:31–63. 20851921 10.1210/er.2010-0006 4. zur Nieden NI Kempka G Ahr HJ In vitro differentiation of embryonic stem cells into mineralized osteoblasts Differentiation 2003 71 18 27 10.1046/j.1432-0436.2003.700602.x 12558600 zur Nieden NI, Kempka G, Ahr HJ. In vitro differentiation of embryonic stem cells into mineralized osteoblasts. Differentiation. 2003;71:18–27. 12558600 10.1046/j.1432-0436.2003.700602.x 5. Jin IG Kim JH Wu H-G Kim SK Park Y Hwang SJ Effect of bone marrow-derived stem cells and bone morphogenetic protein-2 on treatment of osteoradionecrosis in a rat model J Cranio-Maxillofacial Surg 2015 43 1478 86 10.1016/j.jcms.2015.06.035 26220883 Jin IG, Kim JH, Wu H-G, Kim SK, Park Y, Hwang SJ. Effect of bone marrow-derived stem cells and bone morphogenetic protein-2 on treatment of osteoradionecrosis in a rat model. J Cranio-Maxillofacial Surg. 2015;43:1478–86. 10.1016/j.jcms.2015.06.035 26220883 6. Nabil S Samman N Incidence and prevention of osteoradionecrosis after dental extraction in irradiated patients: a systematic review Int J Oral Maxillofac Surg 2011 40 229 43 10.1016/j.ijom.2010.10.005 21115324 Nabil S, Samman N. Incidence and prevention of osteoradionecrosis after dental extraction in irradiated patients: a systematic review. Int J Oral Maxillofac Surg. 2011;40:229–43. 21115324 10.1016/j.ijom.2010.10.005 7. Thorn JJ Hansen HS Specht L Bastholt L Osteoradionecrosis of the jaws: clinical characteristics and relation to the field of irradiation J Oral Maxillofac Surg 2000 58 1088 93 10.1053/joms.2000.9562 11021701 Thorn JJ, Hansen HS, Specht L, Bastholt L. Osteoradionecrosis of the jaws: clinical characteristics and relation to the field of irradiation. J Oral Maxillofac Surg. 2000;58:1088–93. 11021701 10.1053/joms.2000.9562 8. Moreno AC Watson EE Humbert-Vidan L Peterson DE van Dijk LV Urbano TG International Expert-Based consensus definition, classification criteria, and minimum data elements for osteoradionecrosis of the jaw: an interdisciplinary modified Delphi study Int J Radiation Oncology*Biology*Physics 2025 10.1016/j.ijrobp.2024.12.017 PMC12303726 39826846 Moreno AC, Watson EE, Humbert-Vidan L, Peterson DE, van Dijk LV, Urbano TG, et al. International Expert-Based consensus definition, classification criteria, and minimum data elements for osteoradionecrosis of the jaw: an interdisciplinary modified Delphi study. Int J Radiation Oncology*Biology*Physics. 2025. 10.1016/j.ijrobp.2024.12.017. 10.1016/j.ijrobp.2024.12.017 PMC12303726 39826846 9. Çolak S Erdıl A Gevrek F Effects of systemic Anatolian propolis administration on a rat-irradiated osteoradionecrosis model J Appl Oral Sci 2023 31 e20230231 10.1590/1678-7757-2023-0231 37909529 PMC10609641 Çolak S, Erdıl A, Gevrek F. Effects of systemic Anatolian propolis administration on a rat-irradiated osteoradionecrosis model. J Appl Oral Sci. 2023;31:e20230231. 37909529 10.1590/1678-7757-2023-0231 PMC10609641 10. Donaubauer A-J Deloch L Becker I Fietkau R Frey B Gaipl US The influence of radiation on bone and bone Cells—Differential effects on osteoclasts and osteoblasts Int J Mol Sci 2020 21 6377 10.3390/ijms21176377 32887421 PMC7504528 Donaubauer A-J, Deloch L, Becker I, Fietkau R, Frey B, Gaipl US. The influence of radiation on bone and bone Cells—Differential effects on osteoclasts and osteoblasts. Int J Mol Sci. 2020;21:6377. 32887421 10.3390/ijms21176377 PMC7504528 11. Volt H García JA Doerrier C Díaz-Casado ME Guerra-Librero A López LC Same molecule but different expression: aging and sepsis trigger NLRP3 inflammasome activation, a target of melatonin J Pineal Res 2016 60 193 205 10.1111/jpi.12303 26681113 Volt H, García JA, Doerrier C, Díaz-Casado ME, Guerra-Librero A, López LC, et al. Same molecule but different expression: aging and sepsis trigger NLRP3 inflammasome activation, a target of melatonin. J Pineal Res. 2016;60:193–205. 26681113 10.1111/jpi.12303 12. Yu G-M Kubota H Okita M Maeda T The anti-inflammatory and antioxidant effects of melatonin on LPS-stimulated bovine mammary epithelial cells PLoS ONE 2017 12 e0178525 10.1371/journal.pone.0178525 28542575 PMC5444821 Yu G-M, Kubota H, Okita M, Maeda T. The anti-inflammatory and antioxidant effects of melatonin on LPS-stimulated bovine mammary epithelial cells. PLoS ONE. 2017;12:e0178525. 28542575 10.1371/journal.pone.0178525 PMC5444821 13. Acikan I Mehmet G Artas G Yaman F Deniz G Bulmus O Systemic melatonin application increases bone formation in mandibular distraction osteogenesis Braz Oral Res 2018 32 e85 10.1590/1807-3107bor-2018.vol32.0085 30281683 Acikan I, Mehmet G, Artas G, Yaman F, Deniz G, Bulmus O, et al. Systemic melatonin application increases bone formation in mandibular distraction osteogenesis. Braz Oral Res. 2018;32:e85. 30281683 10.1590/1807-3107bor-2018.vol32.0085 14. Esposito E Paterniti I Mazzon E Bramanti P Cuzzocrea S Melatonin reduces hyperalgesia associated with inflammation J Pineal Res 2010 49 321 31 10.1111/j.1600-079X.2010.00796.x 20666977 Esposito E, Paterniti I, Mazzon E, Bramanti P, Cuzzocrea S. Melatonin reduces hyperalgesia associated with inflammation. J Pineal Res. 2010;49:321–31. 20666977 10.1111/j.1600-079X.2010.00796.x 15. Reiter RJ Interactions of the pineal hormone melatonin with oxygen-centered free radicals: a brief review Braz J Med Biol Res 1993 26 1141 55 8136717 Reiter RJ. Interactions of the pineal hormone melatonin with oxygen-centered free radicals: a brief review. Braz J Med Biol Res. 1993;26:1141–55. 8136717 16. Farhood B Goradel NH Mortezaee K Khanlarkhani N Salehi E Nashtaei MS Melatonin as an adjuvant in radiotherapy for radioprotection and radiosensitization Clin Transl Oncol 2019 21 268 79 10.1007/s12094-018-1934-0 30136132 Farhood B, Goradel NH, Mortezaee K, Khanlarkhani N, Salehi E, Nashtaei MS, et al. Melatonin as an adjuvant in radiotherapy for radioprotection and radiosensitization. Clin Transl Oncol. 2019;21:268–79. 30136132 10.1007/s12094-018-1934-0 17. Vasin MV Ushakov IB Comparative efficacy and the window of radioprotection for adrenergic and serotoninergic agents and aminothiols in experiments with small and large animals J Radiat Res 2015 56 1 10 10.1093/jrr/rru087 25312329 PMC4572585 Vasin MV, Ushakov IB. Comparative efficacy and the window of radioprotection for adrenergic and serotoninergic agents and aminothiols in experiments with small and large animals. J Radiat Res. 2015;56:1–10. 25312329 10.1093/jrr/rru087 PMC4572585 18. Böttger F Vallés-Martí A Cahn L Jimenez CR High-dose intravenous vitamin C, a promising multi-targeting agent in the treatment of cancer J Exp Clin Cancer Res 2021 40 343 10.1186/s13046-021-02134-y 34717701 PMC8557029 Böttger F, Vallés-Martí A, Cahn L, Jimenez CR. High-dose intravenous vitamin C, a promising multi-targeting agent in the treatment of cancer. J Exp Clin Cancer Res. 2021;40:343. 34717701 10.1186/s13046-021-02134-y PMC8557029 19. van Gorkom GNY Lookermans EL Van Elssen CHMJ Bos GMJ The effect of vitamin C (Ascorbic Acid) in the treatment of patients with cancer: A systematic review Nutrients 2019 11 977 10.3390/nu11050977 31035414 PMC6566697 van Gorkom GNY, Lookermans EL, Van Elssen CHMJ, Bos GMJ. The effect of vitamin C (Ascorbic Acid) in the treatment of patients with cancer: A systematic review. Nutrients. 2019;11:977. 31035414 10.3390/nu11050977 PMC6566697 20. Chen Q Espey MG Sun AY Pooput C Kirk KL Krishna MC From the cover: Pharmacologic doses of ascorbate act as a prooxidant and decrease growth of aggressive tumor xenografts in mice Proc Natl Acad Sci USA 2008 105 11105 10.1073/pnas.0804226105 18678913 PMC2516281 Chen Q, Espey MG, Sun AY, Pooput C, Kirk KL, Krishna MC, et al. From the cover: Pharmacologic doses of ascorbate act as a prooxidant and decrease growth of aggressive tumor xenografts in mice. Proc Natl Acad Sci USA. 2008;105:11105. 18678913 10.1073/pnas.0804226105 PMC2516281 21. Gęgotek A Skrzydlewska E Antioxidative and Anti-Inflammatory activity of ascorbic acid Antioxid (Basel) 2022 11 1993 10.3390/antiox11101993 PMC9598715 36290716 Gęgotek A, Skrzydlewska E. Antioxidative and Anti-Inflammatory activity of ascorbic acid. Antioxid (Basel). 2022;11:1993. 10.3390/antiox11101993 PMC9598715 36290716 22. Njus D Kelley PM Tu Y-J Schlegel HB Ascorbic acid: the chemistry underlying its antioxidant properties Free Radic Biol Med 2020 159 37 43 10.1016/j.freeradbiomed.2020.07.013 32738399 Njus D, Kelley PM, Tu Y-J, Schlegel HB. Ascorbic acid: the chemistry underlying its antioxidant properties. Free Radic Biol Med. 2020;159:37–43. 32738399 10.1016/j.freeradbiomed.2020.07.013 23. Smirnoff N Ascorbic acid: metabolism and functions of a multi-facetted molecule Curr Opin Plant Biol 2000 3 229 35 10.1016/S1369-5266(00)00069-8 10837263 Smirnoff N. Ascorbic acid: metabolism and functions of a multi-facetted molecule. Curr Opin Plant Biol. 2000;3:229–35. 10837263 24. Park HS Lee J Kim J-W Kim HY Jung SY Lee SM Preventive effects of tonsil-derived mesenchymal stem cells on osteoradionecrosis in a rat model Head Neck 2018 40 526 35 10.1002/hed.25004 29140591 Park HS, Lee J, Kim J-W, Kim HY, Jung SY, Lee SM, et al. Preventive effects of tonsil-derived mesenchymal stem cells on osteoradionecrosis in a rat model. Head Neck. 2018;40:526–35. 29140591 10.1002/hed.25004 25. Basaloglu HK Turgut M Şirin C Uyanikgil Y Demirci B Cetin EO The influence of functional pinealectomy and exogenous melatonin application on healing of a burr hole in adult rat calvaria: a histological and immunohistochemical study Folia Morphol (Warsz) 2022 81 271 9 10.5603/FM.a2021.0047 33997947 Basaloglu HK, Turgut M, Şirin C, Uyanikgil Y, Demirci B, Cetin EO. The influence of functional pinealectomy and exogenous melatonin application on healing of a burr hole in adult rat calvaria: a histological and immunohistochemical study. Folia Morphol (Warsz). 2022;81:271–9. 33997947 10.5603/FM.a2021.0047 26. Giordano V, Albuquerque RP e, do, Amaral NP, Chame CC, de Souza F, Apfel MÍR. Supplementary vitamin C does not accelerate bone healing in a rat tibia fracture model. Acta Ortop Bras. 2012;20:10–2. 10.1590/S1413-78522012000100001 PMC3718416 24453572 27. Zheng L-Z Wang J-L Xu J-K Zhang X-T Liu B-Y Huang L Magnesium and vitamin C supplementation attenuates steroid-associated osteonecrosis in a rat model Biomaterials 2020 238 119828 10.1016/j.biomaterials.2020.119828 32045781 PMC7185815 Zheng L-Z, Wang J-L, Xu J-K, Zhang X-T, Liu B-Y, Huang L, et al. Magnesium and vitamin C supplementation attenuates steroid-associated osteonecrosis in a rat model. Biomaterials. 2020;238:119828. 32045781 10.1016/j.biomaterials.2020.119828 PMC7185815 28. Marx RE Osteoradionecrosis: a new concept of its pathophysiology J Oral Maxillofac Surg 1983 41 283 8 10.1016/0278-2391(83)90294-X 6572704 Marx RE. Osteoradionecrosis: a new concept of its pathophysiology. J Oral Maxillofac Surg. 1983;41:283–8. 6572704 10.1016/0278-2391(83)90294-x 29. Bennett MH Feldmeier J Hampson NB Smee R Milross C Hyperbaric oxygen therapy for late radiation tissue injury Cochrane Database Syst Rev 2016 4 CD005005 16034961 10.1002/14651858.CD005005.pub2 Bennett MH, Feldmeier J, Hampson NB, Smee R, Milross C. Hyperbaric oxygen therapy for late radiation tissue injury. Cochrane Database Syst Rev. 2016;4:CD005005. 16034961 10.1002/14651858.CD005005.pub2 30. Camolesi G-C Ortega K-L Medina J-B Campos L Lorenzo Pouso A-I Gándara Vila P Therapeutic alternatives in the management of osteoradionecrosis of the jaws. Systematic review Med Oral Patol Oral Cir Bucal 2021 26 e195 207 10.4317/medoral.24132 33037800 PMC7980297 Camolesi G-C, Ortega K-L, Medina J-B, Campos L, Lorenzo Pouso A-I, Gándara Vila P, et al. Therapeutic alternatives in the management of osteoradionecrosis of the jaws. Systematic review. Med Oral Patol Oral Cir Bucal. 2021;26:e195–207. 33037800 10.4317/medoral.24132 PMC7980297 31. Koga DH Salvajoli JV Kowalski LP Nishimoto IN Alves FA Dental extractions related to head and neck radiotherapy: ten-year experience of a single institution Oral Surg Oral Med Oral Pathol Oral Radiol Endod 2008 105 e1 6 10.1016/j.tripleo.2008.01.007 18329909 Koga DH, Salvajoli JV, Kowalski LP, Nishimoto IN, Alves FA. Dental extractions related to head and neck radiotherapy: ten-year experience of a single institution. Oral Surg Oral Med Oral Pathol Oral Radiol Endod. 2008;105:e1–6. 18329909 10.1016/j.tripleo.2008.01.007 32. Kolokythas A Rasmussen JT Reardon J Feng C Management of osteoradionecrosis of the jaws with pentoxifylline-tocopherol: a systematic review of the literature and meta-analysis Int J Oral Maxillofac Surg 2019 48 173 80 10.1016/j.ijom.2018.08.007 30205911 Kolokythas A, Rasmussen JT, Reardon J, Feng C. Management of osteoradionecrosis of the jaws with pentoxifylline-tocopherol: a systematic review of the literature and meta-analysis. Int J Oral Maxillofac Surg. 2019;48:173–80. 30205911 10.1016/j.ijom.2018.08.007 33. Martos-Fernández M Saez-Barba M López-López J Estrugo-Devesa A Balibrea-Del-Castillo JM Bescós-Atín C Pentoxifylline, tocopherol, and clodronate for the treatment of mandibular osteoradionecrosis: a systematic review Oral Surg Oral Med Oral Pathol Oral Radiol 2018 125 431 9 10.1016/j.oooo.2018.02.004 29550081 Martos-Fernández M, Saez-Barba M, López-López J, Estrugo-Devesa A, Balibrea-Del-Castillo JM, Bescós-Atín C. Pentoxifylline, tocopherol, and clodronate for the treatment of mandibular osteoradionecrosis: a systematic review. Oral Surg Oral Med Oral Pathol Oral Radiol. 2018;125:431–9. 29550081 10.1016/j.oooo.2018.02.004 34. Wang C Schwaitzberg S Berliner E Zarin DA Lau J Hyperbaric oxygen for treating wounds: a systematic review of the literature Arch Surg 2003 138 272 9 10.1001/archsurg.138.3.272 12611573 Wang C, Schwaitzberg S, Berliner E, Zarin DA, Lau J. Hyperbaric oxygen for treating wounds: a systematic review of the literature. Arch Surg. 2003;138:272–9. discussion 280. 12611573 10.1001/archsurg.138.3.272 35. Halıcı M Öner M Güney A Canöz Ö Narin F Halıcı C Melatonin promotes fracture healing in the rat model Eklem Hastalik Cerrahisi 2010 21 172 7 21067500 Halıcı M, Öner M, Güney A, Canöz Ö, Narin F, Halıcı C. Melatonin promotes fracture healing in the rat model. Eklem Hastalik Cerrahisi. 2010;21:172–7. 21067500 36. Koyama H Nakade O Takada Y Kaku T Lau KHW Melatonin at Pharmacologic doses increases bone mass by suppressing resorption through down-regulation of the RANKL-mediated osteoclast formation and activation J Bone Min Res 2002 17 1219 29 10.1359/jbmr.2002.17.7.1219 12096835 Koyama H, Nakade O, Takada Y, Kaku T, Lau KHW. Melatonin at Pharmacologic doses increases bone mass by suppressing resorption through down-regulation of the RANKL-mediated osteoclast formation and activation. J Bone Min Res. 2002;17:1219–29. 10.1359/jbmr.2002.17.7.1219 12096835 37. Nakade O Koyama H Ariji H Yajima A Kaku T Melatonin stimulates proliferation and type I collagen synthesis in human bone cells in vitro J Pineal Res 1999 27 106 10 10.1111/j.1600-079X.1999.tb00603.x 10496146 Nakade O, Koyama H, Ariji H, Yajima A, Kaku T. Melatonin stimulates proliferation and type I collagen synthesis in human bone cells in vitro. J Pineal Res. 1999;27:106–10. 10496146 10.1111/j.1600-079x.1999.tb00603.x 38. Roth JA Kim BG Lin WL Cho MI Melatonin promotes osteoblast differentiation and bone formation J Biol Chem 1999 274 22041 7 10.1074/jbc.274.31.22041 10419530 Roth JA, Kim BG, Lin WL, Cho MI. Melatonin promotes osteoblast differentiation and bone formation. J Biol Chem. 1999;274:22041–7. 10419530 10.1074/jbc.274.31.22041 39. Satomura K Tobiume S Tokuyama R Yamasaki Y Kudoh K Maeda E Melatonin at Pharmacological doses enhances human osteoblastic differentiation in vitro and promotes mouse cortical bone formation in vivo J Pineal Res 2007 42 231 9 10.1111/j.1600-079X.2006.00410.x 17349020 Satomura K, Tobiume S, Tokuyama R, Yamasaki Y, Kudoh K, Maeda E, et al. Melatonin at Pharmacological doses enhances human osteoblastic differentiation in vitro and promotes mouse cortical bone formation in vivo. J Pineal Res. 2007;42:231–9. 17349020 10.1111/j.1600-079X.2006.00410.x 40. Shino H Hasuike A Arai Y Honda M Isokawa K Sato S Melatonin enhances vertical bone augmentation in rat calvaria secluded spaces Med Oral Patol Oral Cir Bucal 2016 21 e122 126 10.4317/medoral.20904 26595835 PMC4765744 Shino H, Hasuike A, Arai Y, Honda M, Isokawa K, Sato S. Melatonin enhances vertical bone augmentation in rat calvaria secluded spaces. Med Oral Patol Oral Cir Bucal. 2016;21:e122–126. 26595835 10.4317/medoral.20904 PMC4765744 41. Son J-H Cho Y-C Sung I-Y Kim I-R Park B-S Kim Y-D Melatonin promotes osteoblast differentiation and mineralization of MC3T3-E1 cells under hypoxic conditions through activation of PKD/p38 pathways J Pineal Res 2014 57 385 92 10.1111/jpi.12177 25250639 Son J-H, Cho Y-C, Sung I-Y, Kim I-R, Park B-S, Kim Y-D. Melatonin promotes osteoblast differentiation and mineralization of MC3T3-E1 cells under hypoxic conditions through activation of PKD/p38 pathways. J Pineal Res. 2014;57:385–92. 25250639 10.1111/jpi.12177 42. Köse O Arabaci T Kizildag A Erdemci B Özkal Eminoğlu D Gedikli S Melatonin prevents radiation-induced oxidative stress and periodontal tissue breakdown in irradiated rats with experimental periodontitis J Periodontal Res 2017 52 438 46 10.1111/jre.12409 27510437 Köse O, Arabaci T, Kizildag A, Erdemci B, Özkal Eminoğlu D, Gedikli S, et al. Melatonin prevents radiation-induced oxidative stress and periodontal tissue breakdown in irradiated rats with experimental periodontitis. J Periodontal Res. 2017;52:438–46. 27510437 10.1111/jre.12409 43. Sanbe T Tomofuji T Ekuni D Azuma T Irie K Tamaki N Vitamin C intake inhibits serum lipid peroxidation and osteoclast differentiation on alveolar bone in rats fed on a high-cholesterol diet Arch Oral Biol 2009 54 235 40 10.1016/j.archoralbio.2008.11.001 19110235 Sanbe T, Tomofuji T, Ekuni D, Azuma T, Irie K, Tamaki N, et al. Vitamin C intake inhibits serum lipid peroxidation and osteoclast differentiation on alveolar bone in rats fed on a high-cholesterol diet. Arch Oral Biol. 2009;54:235–40. 19110235 10.1016/j.archoralbio.2008.11.001 44. Sarisözen B Durak K Dinçer G Bilgen O The effects of vitamins E and C on fracture healing in rats J Int Med Res 2002 30 309 13 10.1177/147323000203000312 12166348 Sarisözen B, Durak K, Dinçer G, Bilgen O. The effects of vitamins E and C on fracture healing in rats. J Int Med Res. 2002;30:309–13. 12166348 10.1177/147323000203000312 45. Urban K Höhling HJ Lüttenberg B Szuwart T Plate U Biomineralisation Research Unit An in vitro study of osteoblast vitality influenced by the vitamins C and E Head Face Med 2012 8 25 10.1186/1746-160X-8-25 23021517 PMC3489720 Urban K, Höhling HJ, Lüttenberg B, Szuwart T, Plate U, Biomineralisation Research Unit. An in vitro study of osteoblast vitality influenced by the vitamins C and E. Head Face Med. 2012;8:25. 23021517 10.1186/1746-160X-8-25 PMC3489720 46. Choi HK Kim G-J Yoo H-S Song DH Chung K-H Lee K-J Vitamin C activates osteoblastogenesis and inhibits osteoclastogenesis via Wnt/β-Catenin/ATF4 signaling pathways Nutrients 2019 11 506 10.3390/nu11030506 30818817 PMC6471534 Choi HK, Kim G-J, Yoo H-S, Song DH, Chung K-H, Lee K-J, et al. Vitamin C activates osteoblastogenesis and inhibits osteoclastogenesis via Wnt/β-Catenin/ATF4 signaling pathways. Nutrients. 2019;11:506. 30818817 10.3390/nu11030506 PMC6471534 47. Franceschi RT Iyer BS Relationship between collagen synthesis and expression of the osteoblast phenotype in MC3T3-E1 cells J Bone Min Res 1992 7 235 46 10.1002/jbmr.5650070216 1373931 Franceschi RT, Iyer BS. Relationship between collagen synthesis and expression of the osteoblast phenotype in MC3T3-E1 cells. J Bone Min Res. 1992;7:235–46. 10.1002/jbmr.5650070216 1373931 48. Hadzir SN Ibrahim SN Abdul Wahab RM Zainol Abidin IZ Senafi S Ariffin ZZ Ascorbic acid induces osteoblast differentiation of human suspension mononuclear cells Cytotherapy 2014 16 674 82 10.1016/j.jcyt.2013.07.013 24176546 Hadzir SN, Ibrahim SN, Abdul Wahab RM, Zainol Abidin IZ, Senafi S, Ariffin ZZ, et al. Ascorbic acid induces osteoblast differentiation of human suspension mononuclear cells. Cytotherapy. 2014;16:674–82. 24176546 10.1016/j.jcyt.2013.07.013 49. Valenti MT Zanatta M Donatelli L Viviano G Cavallini C Scupoli MT Ascorbic acid induces either differentiation or apoptosis in MG-63 osteosarcoma lineage Anticancer Res 2014 34 1617 27 24692690 Valenti MT, Zanatta M, Donatelli L, Viviano G, Cavallini C, Scupoli MT, et al. Ascorbic acid induces either differentiation or apoptosis in MG-63 osteosarcoma lineage. Anticancer Res. 2014;34:1617–27. 24692690 50. Rostami A Moosavi SA Dianat Moghadam H Bolookat ER Micronuclei assessment of the radioprotective effects of melatonin and vitamin C in human lymphocytes Cell J 2016 18 46 51 27054118 10.22074/cellj.2016.3986 PMC4819385 Rostami A, Moosavi SA, Dianat Moghadam H, Bolookat ER. Micronuclei assessment of the radioprotective effects of melatonin and vitamin C in human lymphocytes. Cell J. 2016;18:46–51. 27054118 10.22074/cellj.2016.3986 PMC4819385 51. Chitsazi M Faramarzie M Sadighi M Shirmohammadi A Hashemzadeh A Effects of adjective use of melatonin and vitamin C in the treatment of chronic periodontitis: a randomized clinical trial J Dent Res Dent Clin Dent Prospects 2017 11 236 40 29354250 10.15171/joddd.2017.041 PMC5768956 Chitsazi M, Faramarzie M, Sadighi M, Shirmohammadi A, Hashemzadeh A. Effects of adjective use of melatonin and vitamin C in the treatment of chronic periodontitis: a randomized clinical trial. J Dent Res Dent Clin Dent Prospects. 2017;11:236–40. 29354250 10.15171/joddd.2017.041 PMC5768956 ",
  "metadata": {
    "Title of this paper": "Effects of adjective use of melatonin and vitamin C in the treatment of chronic periodontitis: a randomized clinical trial",
    "Journal it was published in:": "BMC Oral Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482573/"
  }
}