{
  "title": "Paper_826",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472685 PMC12472685.1 12472685 12472685 41011387 10.3390/microorganisms13092056 microorganisms-13-02056 1 Article Acute Toxoplasma gondii https://orcid.org/0009-0007-9212-3508 Wang Yidan 1 2 † Deng Caiqin 2 3 † Sui Minmin 1 2 Wei Penghao 1 2 Duan Bofang 2 4 https://orcid.org/0009-0004-7848-0152 Li Zhao 2 3 * https://orcid.org/0000-0002-9613-3734 Zou Fengcai 2 * Marcili Arlei Academic Editor 1 wangyidan318@163.com 15666251052@163.com weipenghao0414@163.com 2 dengcaiqin1998@163.com duanbofang@126.com 3 4 * lizhao@ynu.edu.cn zfc1207@vip.163.com † These authors contributed equally to this work. 04 9 2025 9 2025 13 9 496716 2056 13 7 2025 10 8 2025 30 8 2025 04 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Toxoplasma gondii T. gondii T gondii Escherichia coli T. gondii Toxoplasma gondii gut microbiome metagenomic sequencing dysbiosis KEEG and CAZy analyses Yunnan Key Laboratory of Veterinary Etiological Biology 202449CE340019 NSFC-Yunnan Joint Fund U2202201 Yunnan Fundamental Research Projects 202401AT070440 Scientific Research Fund of Education Department of Yunnan Province 2024Y339 This work was funded by the Yunnan Key Laboratory of Veterinary Etiological Biology (Grant No. 202449CE340019), the NSFC-Yunnan Joint Fund (Grant No. U2202201), the Yunnan Fundamental Research Projects (Grant No. 202401AT070440), and the Scientific Research Fund of Education Department of Yunnan Province (Grant No. 2024Y339). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction T. gondii 1 2 3 T. gondii 4 T. gondii 5 6 T. gondii 7 T. gondii T. gondii 4 T. gondii The gut microbiota constitutes a highly complex and dynamic ecosystem that plays a critical role in host nutrient metabolism, immune homeostasis, and maintenance of the gut barrier function [ 8 9 T. gondii 10 11 T. gondii To address this gap, the present study employed metagenomic sequencing to comprehensively characterize the ileal microbiota of mice during acute T. gondii T. gondii T. gondii 2. Materials and Methods 2.1. Experimental Design and Sample Collection Eight-week-old female BALB/c mice were purchased from Yunnan University. All mice were housed in individually ventilated cages and had ad libitum access to food and water. The ME49 strain of T. gondii n T. gondii 2.2. DNA Extraction, Metagenomic Library Preparation, and Sequencing DNA was extracted from samples using the MagPure Stool DNA KF Kit B (MAGEN, Guangzhou, China). For metagenomic library preparation, the BGI Optimal DNA Library Prep Kit (BGI, Shenzhen, China) was employed. Briefly, the extracted DNA underwent fragmentation and size selection via magnetic bead purification, followed by end repair and adenylation. Subsequently, sequencing adapters were ligated to the fragments, followed by PCR amplification and quality control of the library. After library quality assessment, the double-stranded DNA libraries were denatured into single strands and circularized. Linear DNA remnants were then removed via enzymatic digestion, and the circular single-stranded DNA templates were amplified using rolling circle amplification (RCA) with phi29 polymerase to produce DNA nanoballs (DNBs). 2.3. Bioinformatics Analysis of Metagenomic Sequencing Data All the raw data were trimmed by SOAPnuke v.1.5.2 [ 12 13 14 15 16 17 18 −5 19 2.4. Differential Abundance Analysis and Statistical Assessment of Diversity Across Groups Species annotations were obtained from the NR database, and species abundance was determined based on the relative expression levels of corresponding genes. The α diversity was quantified using the Chao1 index, as well as the Simpson and Shannon indices, based on species-level relative abundance profiles in R. The β diversity was calculated using Bray-Curtis distance. The Linear Discriminant Analysis (LDA) Effect Size (LEfSe) method [ 20 p 21 2.5. Statistical Analysis Statistical analyses were performed using the IBM SPSS Statistics program (version 21). Based on the abundance profiles, the features with significantly differential abundances across groups were identified using the Wilcoxon rank-sum test and the Kruskal-Wallis H test [ 22 23 p p 3. Results 3.1. Metagenomic Sequencing Quality and Data Overview In this study, metagenomic sequencing was performed on the ileal contents of six BALB/c mice, comprising three T. gondii Table S1 3.2. T. gondii Infection Leads to Changes in Gut Microbial Diversity in Mice The α diversity represents species richness and diversity. To assess the diversity of the gut microbiota in mice, we aligned the clean read sequences with the genomic catalogue, quantified and depicted the relative abundance of bacterial species at the phylum, family, and genus levels. Overall, the gut bacterial diversity of mice was reduced after T. gondii Figure 1 p For β diversity analysis, a Bray-Curtis distance dissimilarity matrix was constructed, and principal coordinates analysis (PCoA) was used to visualize changes in microbial community composition ( Figure 1 T. gondii Figure 1 p T. gondii 3.3. Disturbance of Gut Microbiome Composition in Diseased Mice Based on metagenomic data, we systematically compared the composition of gut microbial communities in mice from the BCN and BCA groups at the phylum, family, and genus levels ( Figure 2 Table S2 Figure 2 When comparing the microbial communities at the family and genus levels, the control group (BCN) was predominantly composed of Micrococcaceae (62.26%), Lactobacillaceae (20.52%), and Muribaculaceae (6.16%), followed by Akkermansiaceae (3.08%) and Enterobacteriaceae (0.83%). In contrast, 10 days after infection with T. gondii Escherichia Curtobacterium Lactobacillus Lactobacillaceae Shigella Escherichia T. gondii To more intuitively illustrate the composition of the gut microbiota, we constructed a Krona plot for representative samples from each experimental group based on metagenomic sequencing data, thereby visualizing the relative abundance of taxonomic units across all taxonomic levels. The microbiota of the control group exhibited highly diverse taxonomic characteristics, including Bacteroidota and Actinomycetota, as well as various commensal bacterial genera ( Figure 3 E. coli Figure 3 The phylogenetic tree based on LEfSe visualized the significantly enriched taxa in the BCN and BCA groups ( Figure 4 Table S3 p Escherichia Shigella 3.4. Functional Changes in the Gut Microbiome of Infected Mice To explore the effects of acute T. gondii Table S4 Table S5 We further screened the 30 most abundant secondary and tertiary KEGG pathways and drew heatmaps ( Figure 5 Table S6 E. coli T. gondii Based on metagenomic sequencing data, reporter score analysis was performed to compare the differences in key functional metabolic pathways between the control group (BCN) and the infected group (BCA; Figure 6 To further verify the effect of acute T. gondii Figure 7 Table S7 K02784 K02078 K02774 To further analyze the effect of acute T. gondii Figure 8 T. gondii Figure 8 Table S8 T. gondii 4. Discussion Oral ingestion of T. gondii 24 25 T. gondii 26 27 T. gondii Our results clearly showed that acute T. gondii Figure 1 T. gondii Figure 1 6 28 29 Figure 2 30 Notably, this study highlights the sensitivity of Actinobacteriota in T. gondii 7 11 Figure 2 31 Escherichia Shigella Citrobacter Proteus Salmonella Pseudomonas Figure 2 32 33 This study found that the structural changes in microbiota caused by T. gondii E. coli T. gondii 34 35 36 37 38 39 40 41 34 42 T. gondii 43 44 T. gondii T. gondii T. gondii 45 Figure 2 Figure 3 Figure 4 E. coli T. gondii 46 In terms of functional analysis, the KEGG annotation results showed the enrichment of a large number of metabolic pathways supporting pathogen growth in the infected group, such as the significant upregulation of metabolic pathways, bacterial secretion system, biofilm formation of E. coli Figure 5 T. gondii E. coli Figure 6 47 48 49 50 39 42 51 T. gondii K02078 K02774 Figure 7 K02078 52 53 54 K02774 55 56 In addition, this study also showed enhanced synthetic pathways of phenylalanine, tyrosine, and tryptophan in the acute T. gondii Figure 6 T. gondii T. gondii 57 58 59 T. gondii 60 T. gondii T. gondii 61 T. gondii Several limitations of this study warrant consideration. Firstly, the findings are derived from a murine model of acute oral infection. While this model is valuable for mechanistic insights, the epidemiology, disease progression, and host immune responses to T. gondii n To sum up, we speculate that the metabolic landscape shaped by T. gondii T. gondii T. gondii. 49 62 Collectively, this study provides a detailed characterization of acute gut microbiota dysbiosis and functional reprogramming in a murine model of T. gondii 5. Conclusions In summary, this study systematically characterizes acute T. gondii T. gondii T. gondii Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/microorganisms13092056/s1 Author Contributions Z.L. and F.Z. conceived and designed the study. Z.L., Y.W. and C.D. performed the experiments, analyzed the data, and wrote the manuscript. M.S., P.W. and B.D. participated in the implementation of the study. Z.L. and F.Z. critically revised and edited the manuscript. F.Z. and Z.L. secured the funds. F.Z. and Z.L. supervised the project. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All mouse experiments were performed strictly following the Guidelines for the Management and Use of Laboratory Animals established by the Animal Research and Resource Center, Yunnan University (CNAS LA0029). The animal protocol and ethics were reviewed and approved by the university’s Institutional Animal Care and Use Committee (Code: No. YNU20241024, 2 February 2024). Informed Consent Statement Not applicable. Data Availability Statement The metagenomic sequencing data reported in this research have been deposited in the China National Center for Bioinformation ( https://www.cncb.ac.cn/ Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: DNBSeq DNA Nanoball Sequencing PE150 Paired-End 150 bp Sequencing KEGG Kyoto Encyclopedia of Genes and Genomes CAZy Carbohydrate-Active enZymes KO KEGG Ortholog LDA Linear Discriminant Analysis LEfSe Linear Discriminant Analysis Effect Size PCoA Principal Coordinates Analysis NMDS Non-metric Multidimensional Scaling PERMANOVA Permutational Multivariate Analysis of Variance LPS Lipopolysaccharide TLR4 Toll-Like Receptor 4 IFN-γ Interferon gamma IDO Indoleamine 2,3-dioxygenase AhR Aryl Hydrocarbon Receptor GHs Glycoside Hydrolases GTs GlycosylTransferases CBMs Carbohydrate-Binding Modules CEs Carboxylesterases PLs Polysaccharide Lyases AAs Auxiliary Activityies References 1. Dubey J.P. Jones J.L. Toxoplasma gondii Int. J. Parasitol. 2008 38 1257 1278 10.1016/j.ijpara.2008.03.007 18508057 2. Montoya J. Liesenfeld O. Toxoplasmosis Lancet 2004 363 1965 1976 10.1016/S0140-6736(04)16412-X 15194258 3. Israelski D.M. Remington J.S. Toxoplasmic encephalitis in patients with AIDS Infect. Dis. Clin. N. Am. 1988 2 429 446 10.1016/S0891-5520(20)30196-3 3060527 4. Couturier-Maillard A. Froux N. Piotet-Morin J. Michaudel C. Brault L. Le Bérichel J. Sénéchal A. Robinet P. Chenuet P. Jejou S. Correction: Interleukin-22-deficiency and microbiota contribute to the exacerbation of Toxoplasma gondii Mucosal Immunol. 2019 12 290 10.1038/s41385-018-0112-6 30504789 5. Gay G. Braun L. Brenier-Pinchart M.-P. Vollaire J. Josserand V. Bertini R.-L. Varesano A. Touquet B. De Bock P.-J. Coute Y. Toxoplasma gondii J. Exp. Med. 2016 213 1779 1798 10.1084/jem.20160340 27503074 PMC4995087 6. Chen J. Zhang C. Yang Z. Wu W. Zou W. Xin Z. Zheng S. Liu R. Yang L. Peng H. Intestinal microbiota imbalance resulted by anti- Toxoplasma gondii Parasit Vectors 2024 17 284 10.1186/s13071-024-06349-8 38956725 PMC11221008 7. Meng J.-X. Wei X.-Y. Guo H. Chen Y. Wang W. Geng H.-L. Yang X. Jiang J. Zhang X.-X. Metagenomic insights into the composition and function of the gut microbiota of mice infected with Toxoplasma gondii Front. Immunol. 2023 14 1156397 10.3389/fimmu.2023.1156397 37090719 PMC10118048 8. Hill D.A. Hoffmann C. Abt M.C. Du Y. Kobuley D. Kirn T.J. Bushman F.D. Artis D. Metagenomic analyses reveal antibiotic-induced temporal and spatial changes in intestinal microbiota with associated alterations in immune cell homeostasis Mucosal Immunol. 2010 3 148 158 10.1038/mi.2009.132 19940845 PMC2824244 9. Cho I. Blaser M.J. The human microbiome: At the interface of health and disease Nat. Rev. Genet. 2012 13 260 270 10.1038/nrg3182 22411464 PMC3418802 10. Yang J. Liu S. Zhao Q. Li X. Jiang K. Gut microbiota-related metabolite alpha-linolenic acid mitigates intestinal inflammation induced by oral infection with Toxoplasma gondii Microbiome 2023 11 273 10.1186/s40168-023-01681-0 38087373 PMC10714487 11. Shao D.Y. Bai X. Tong M.W. Zhang Y.Y. Liu X.L. Zhou Y.H. Li C. Cai W. Gao X. Liu M. Changes to the gut microbiota in mice induced by infection with Toxoplasma gondii Acta Trop. 2020 203 105301 10.1016/j.actatropica.2019.105301 31843385 12. Chen Y. Chen Y. Shi C. Huang Z. Zhang Y. Li S. Li Y. Ye J. Yu C. Li Z. SOAPnuke: A mapReduce acceleration-supported software for integrated quality control and preprocessing of high-throughput sequencing data GigaScience 2018 7 gix120 10.1093/gigascience/gix120 29220494 PMC5788068 13. Li R. Yu C. Li Y. Lam T.-W. Yiu S.-M. Kristiansen K. Wang J. SOAP2: An improved ultrafast tool for short read alignment Bioinformatics 2009 25 1966 1967 10.1093/bioinformatics/btp336 19497933 14. Li D. Liu C.-M. Luo R. Sadakane K. Lam T.-W. MEGAHIT: An ultra-fast single-node solution for large and complex metagenomics assembly via succinct de bruijn graph Bioinformatics 2015 31 1674 1676 10.1093/bioinformatics/btv033 25609793 15. Zhu W. Lomsadze A. Borodovsky M. Ab initio gene identification in metagenomic sequences Nucleic Acids Res. 2010 38 e132 10.1093/nar/gkq275 20403810 PMC2896542 16. Fu L. Niu B. Zhu Z. Wu S. Li W. CD-HIT: Accelerated for clustering the next-generation sequencing data Bioinformatics 2012 28 3150 3152 10.1093/bioinformatics/bts565 23060610 PMC3516142 17. Patro R. Duggal G. Love M.I. Irizarry R.A. Kingsford C. Salmon provides fast and bias-aware quantification of transcript expression Nat. Methods 2017 14 417 419 10.1038/nmeth.4197 28263959 PMC5600148 18. Buchfink B. Xie C. Huson D.H. Fast and sensitive protein alignment using DIAMOND Nat. Methods 2015 12 59 60 10.1038/nmeth.3176 25402007 19. Wood D.E. Lu J. Langmead B. Improved metagenomic analysis with Kraken 2 Genome Biol. 2019 20 257 10.1186/s13059-019-1891-0 31779668 PMC6883579 20. Segata N. Izard J. Waldron L. Gevers D. Miropolsky L. Garrett W.S. Huttenhower C. Metagenomic biomarker discovery and explanation Genome Biol. 2011 12 R60 10.1186/gb-2011-12-6-r60 21702898 PMC3218848 21. Patil K.R. Nielsen J. Uncovering transcriptional regulation of metabolism by using metabolic network topology Proc. Natl. Acad. Sci. USA 2005 102 2685 2689 10.1073/pnas.0406811102 15710883 PMC549453 22. Matsouaka R.A. Singhal A.B. Betensky R.A. An optimal wilcoxon-mann-whitney test of mortality and a continuous outcome Stat. Methods Med. Res. 2018 27 2384 2400 10.1177/0962280216680524 27920364 PMC5393279 23. Green G.H. Diggle P.J. On the operational characteristics of the benjamini and hochberg false discovery rate procedure Stat. Appl. Genet. Mol. Biol. 2007 6 Article27 10.2202/1544-6115.1302 18052910 24. Webster J.P. Dubey J.P. Toxoplasmosis of animals and humans Parasites Vectors 2010 3 112 10.1186/1756-3305-3-112 25. Partida-Rodríguez O. Serrano-Vázquez A. Nieves-Ramírez M.E. Moran P. Rojas L. Portillo T. González E. Hernández E. Finlay B.B. Ximenez C. Human intestinal microbiota: Interaction between parasites and the host immune response Arch. Med. Res. 2017 48 690 700 10.1016/j.arcmed.2017.11.015 29290328 26. Prandovszky E. Severance E.G. Splan V.W. Liu H. Xiao J. Yolken R.H. Toxoplasma Front. Cell Infect. Microbiol. 2024 14 1415079 10.3389/fcimb.2024.1415079 39403206 PMC11471644 27. Al-Rashidi H.S. El-Wakil E.S. Parasites and microbiota: Dual interactions and therapeutic perspectives Microorganisms 2024 12 2076 10.3390/microorganisms12102076 39458384 PMC11510500 28. Wang S. El-Fahmawi A. Christian D.A. Fang Q. Radaelli E. Chen L. Sullivan M.C. Misic A.M. Ellringer J.A. Zhu X.-Q. Infection-induced intestinal dysbiosis is mediated by macrophage activation and nitrate production mBio 2019 10 e00935–e19 10.1128/mBio.00935-19 PMC6538788 31138751 29. Heimesaat M.M. Bereswill S. Fischer A. Fuchs D. Struck D. Niebergall J. Jahn H.-K. Dunay I.R. Moter A. Gescher D.M. Gram-negative bacteria aggravate murine small intestinal Th1-type immunopathology following oral infection with Toxoplasma gondii J. Immunol. 2006 177 8785 8795 10.4049/jimmunol.177.12.8785 17142781 30. Walker A.W. Sanderson J.D. Churcher C. Parkes G.C. Hudspith B.N. Rayment N. Brostoff J. Parkhill J. Dougan G. Petrovska L. High-throughput clone library analysis of the mucosa-associated microbiota reveals dysbiosis and differences between inflamed and non-inflamed regions of the intestine in inflammatory bowel disease BMC Microbiol. 2011 11 7 10.1186/1471-2180-11-7 21219646 PMC3032643 31. Aldars-García L. Marin A.C. Chaparro M. Gisbert J.P. The interplay between immune system and microbiota in inflammatory bowel disease: A narrative review Int. J. Mol. Sci. 2021 22 3076 10.3390/ijms22063076 33802883 PMC8002696 32. Fingas F. Volke D. Hassert R. Fornefett J. Funk S. Baums C.G. Hoffmann R. Sensitive and immunogen-specific serological detection of rodentibacter pneumotropicus infections in mice BMC Microbiol. 2019 19 43 10.1186/s12866-019-1417-7 30777007 PMC6380038 33. Hoogland I.C.M. Houbolt C. van Westerloo D.J. van Gool W.A. van de Beek D. Systemic inflammation and microglial activation: Systematic review of animal experiments J. Neuroinflamm. 2015 12 114 10.1186/s12974-015-0332-6 PMC4470063 26048578 34. Yang J.-Y. Kim M.-S. Kim E. Cheon J.H. Lee Y.-S. Kim Y. Lee S.-H. Seo S.-U. Shin S.-H. Choi S.S. Enteric viruses ameliorate gut inflammation via toll-like receptor 3 and toll-like receptor 7-mediated interferon-β production Immunity 2016 44 889 900 10.1016/j.immuni.2016.03.009 27084119 35. Dicksved J. Halfvarson J. Rosenquist M. Järnerot G. Tysk C. Apajalahti J. Engstrand L. Jansson J.K. Molecular analysis of the gut microbiota of identical twins with Crohn’s disease ISME J. 2008 2 716 727 10.1038/ismej.2008.37 18401439 36. Duranti S. Gaiani F. Mancabelli L. Milani C. Grandi A. Bolchi A. Santoni A. Lugli G.A. Ferrario C. Mangifesta M. Elucidating the gut microbiome of ulcerative colitis: Bifidobacteria as novel microbial biomarkers FEMS Microbiol. Ecol. 2016 92 fiw191 10.1093/femsec/fiw191 27604252 37. Sartor R.B. Wu G.D. Roles for intestinal bacteria, viruses, and fungi in pathogenesis of inflammatory bowel diseases and therapeutic approaches Gastroenterology 2017 152 327 339.e4 10.1053/j.gastro.2016.10.012 27769810 PMC5511756 38. Gophna U. Sommerfeld K. Gophna S. Doolittle W.F. Veldhuyzen van Zanten S.J.O. Differences between tissue-associated intestinal microfloras of patients with Crohn’s disease and ulcerative colitis J. Clin. Microbiol. 2006 44 4136 4141 10.1128/JCM.01004-06 16988016 PMC1698347 39. Candelli M. Franza L. Pignataro G. Ojetti V. Covino M. Piccioni A. Gasbarrini A. Franceschi F. Interaction between lipopolysaccharide and gut microbiota in inflammatory bowel diseases Int. J. Mol. Sci. 2021 22 6242 10.3390/ijms22126242 34200555 PMC8226948 40. Martinez-Medina M. Garcia-Gil L.J. Escherichia coli Escherichia coli World J. Gastrointest. Pathophysiol. 2014 5 213 227 10.4291/wjgp.v5.i3.213 25133024 PMC4133521 41. Chervy M. Barnich N. Denizot J. Adherent-invasive E. coli Int. J. Mol. Sci. 2020 21 3734 10.3390/ijms21103734 32466328 PMC7279240 42. Pasternak B.A. D’Mello S. Jurickova I.I. Han X. Willson T. Flick L. Petiniot L. Uozumi N. Divanovic S. Traurnicht A. Lipopolysaccharide exposure is linked to activation of the acute phase response and growth failure in pediatric Crohn’s disease and murine colitis Inflamm. Bowel Dis. 2010 16 856 869 10.1002/ibd.21132 19924809 PMC3052288 43. Wei S. Bahl M.I. Baunwall S.M.D. Hvas C.L. Licht T.R. Determining gut microbial dysbiosis: A review of applied indexes for assessment of intestinal microbiota imbalances Appl. Environ. Microbiol. 2021 87 e00395–e21 10.1128/AEM.00395-21 33741632 PMC8208139 44. Duan R. Zhu S. Wang B. Duan L. Alterations of gut microbiota in patients with irritable bowel syndrome based on 16S rRNA-targeted sequencing: A systematic review Clin. Transl. Gastroenterol. 2019 10 e00012 10.14309/ctg.0000000000000012 30829919 PMC6407812 45. Su R. Yang Y. Gut commensal bacteria exacerbate toxoplasmosis associated with TgSheepCHn5 (ToxoDB#2) and TgRedpandaCHn1 (ToxoDB#20) through Th1 immune response Parasitol. Res. 2023 122 2795 2806 37782335 10.1007/s00436-023-07962-9 46. Karch H. Tarr P.I. Bielaszewska M. Enterohaemorrhagic Escherichia coli Int. J. Med. Microbiol. 2005 295 405 418 10.1016/j.ijmm.2005.06.009 16238016 47. Ashraf K.U. Nygaard R. Vickery O.N. Erramilli S.K. Herrera C.M. McConville T.H. Petrou V.I. Giacometti S.I. Dufrisne M.B. Nosol K. Structural basis of lipopolysaccharide maturation by the O-antigen ligase Nature 2022 604 371 376 10.1038/s41586-022-04555-x 35388216 PMC9884178 48. Whitfield C. Williams D.M. Kelly S.D. Lipopolysaccharide O-antigens—Bacterial glycans made to measure J. Biol. Chem. 2020 295 10593 10609 10.1074/jbc.REV120.009402 32424042 PMC7397119 49. Greenfield L.K. Whitfield C. Synthesis of lipopolysaccharide O-antigens by ABC transporter-dependent pathways Carbohydr. Res. 2012 356 12 24 10.1016/j.carres.2012.02.027 22475157 50. An L. Wirth U. Koch D. Schirren M. Drefs M. Koliogiannis D. Nieß H. Andrassy J. Guba M. Bazhin A.V. The role of gut-derived lipopolysaccharides and the intestinal barrier in fatty liver diseases J. Gastrointest. Surg. 2022 26 671 683 10.1007/s11605-021-05188-7 34734369 PMC8926958 51. Man S.M. Inflammasomes in the gastrointestinal tract: Infection, cancer and gut microbiota homeostasis Nat. Rev. Gastroenterol. Hepatol. 2018 15 721 737 10.1038/s41575-018-0054-1 30185915 PMC7097092 52. Shu S. Mi W. Regulatory Mechanisms of lipopolysaccharide synthesis in Escherichia coli Nat. Commun. 2022 13 4576 10.1038/s41467-022-32277-1 35931690 PMC9356133 53. Wieczorek A. Sendobra A. Maniyeri A. Sugalska M. Klein G. Raina S. A new factor LapD is required for the regulation of LpxC amounts and lipopolysaccharide trafficking Int. J. Mol. Sci. 2022 23 9706 10.3390/ijms23179706 36077106 PMC9456370 54. Sorensen P.G. Lutkenhaus J. Young K. Eveland S.S. Anderson M.S. Raetz C.R.H. Regulation of UDP-3- O R N Escherichia coli J. Biol. Chem. 1996 271 25898 25905 10.1074/jbc.271.42.25898 8824222 55. Bertani B. Ruiz N. Function and biogenesis of lipopolysaccharides EcoSal Plus. 2018 8 10 1128 10.1128/ecosalplus.esp-0001-2018 30066669 PMC6091223 56. Raetz C.R.H. Whitfield C. Lipopolysaccharide endotoxins Annu. Rev. Biochem. 2002 71 635 700 10.1146/annurev.biochem.71.110601.135414 12045108 PMC2569852 57. Cerávolo I.P. Chaves A.C. Bonjardim C.A. Sibley D. Romanha A.J. Gazzinelli R.T. Replication of Toxoplasma gondii Infect. Immun. 1999 67 2233 2240 10.1128/IAI.67.5.2233-2240.1999 10225879 PMC115962 58. Pfefferkorn E.R. Interferon gamma blocks the growth of Toxoplasma gondii Proc. Natl. Acad. Sci. USA 1984 81 908 912 10.1073/pnas.81.3.908 6422465 PMC344948 59. Schwarcz R. Bruno J.P. Muchowski P.J. Wu H.-Q. Kynurenines in the mammalian brain: When physiology meets pathology Nat. Rev. Neurosci. 2012 13 465 477 10.1038/nrn3257 22678511 PMC3681811 60. Agus A. Planchais J. Sokol H. Gut microbiota regulation of tryptophan metabolism in health and disease Cell Host Microbe 2018 23 716 724 10.1016/j.chom.2018.05.003 29902437 61. Dos Santos L.M. Commodaro A.G. Vasquez A.R.R. Kohlhoff M. de Paula Guerra D.A. Coimbra R.S. Martins-Filho O.A. Teixeira-Carvalho A. Rizzo L.V. Vieira L.Q. Intestinal microbiota regulates tryptophan metabolism following oral infection with Toxoplasma gondii Parasite Immunol. 2020 42 e12720 10.1111/pim.12720 32275066 62. Vijay-Kumar M. Aitken J.D. Carvalho F.A. Cullender T.C. Mwangi S. Srinivasan S. Sitaraman S.V. Knight R. Ley R.E. Gewirtz A.T. Metabolic syndrome and altered gut microbiota in mice lacking toll-like receptor 5 Science 2010 328 228 231 10.1126/science.1179721 20203013 PMC4714868 Figure 1 Diversity and composition of the ileal microbiota in mice. ( A B C p Figure 2 Comparison of the relative abundance of the top 20 ileal microbial taxa between groups before and after T. gondii A B C Figure 3 Krona plots showing the taxonomic composition of ileal microbiota in representative samples from each group after T. gondii A B E. coli Figure 4 LEfSe analysis showing taxonomic differences in gut microbiota between control (BCN) and acute-infected (BCA) mice. ( A B Figure 5 Functional differences in gut microbiota between T. gondii A B Figure 6 Functional differences in key metabolic pathways of mouse gut microbiota before and after T. gondii Figure 7 Heatmap of differentially abundant KEGG Orthologs (KOs) in gut microbiota between control (BCN) and acute-infected (BCA) mice. The heatmap shows normalized abundance levels of selected KO functional genes across samples. Orange indicates higher abundance, while blue represents lower expression levels. Multiple KO entries, such as K02784 K02078 K02774 Figure 8 CAZy classification and abundance comparison of gut microbiota carbohydrate-active enzymes between control (BCN) and acute-infected (BCA) mice. ( A B ",
  "metadata": {
    "Title of this paper": "Metabolic syndrome and altered gut microbiota in mice lacking toll-like receptor 5",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472685/"
  }
}