{
  "title": "Paper_620",
  "abstract": "Toxicol Res (Camb) Toxicol Res (Camb) 3424 toxicolres toxres Toxicology Research 2045-452X 2045-4538 Oxford University Press PMC11442146 PMC11442146.1 11442146 11442146 39359713 10.1093/toxres/tfae157 tfae157 1 Paper AcademicSubjects/MED00305 AcademicSubjects/SCI01040 Assessment of the toxic influence of locally formulated pesticides on hepatic and renal biomarkers in male Wistar rats https://orcid.org/0009-0006-2370-8994 Adeyele Esther Itunuoluwa  Institute of Ecology and Environmental Studies, Obafemi Awolowo University Road 7, P.M.B 13, Ile Ife, Osun State, 220282 Nigeria https://orcid.org/0009-0005-5196-1332 Ayanyemi Esther Olutomilayo  Institute of Ecology and Environmental Studies, Obafemi Awolowo University Road 7, P.M.B 13, Ile Ife, Osun State, 220282 Nigeria https://orcid.org/0000-0001-7812-8563 Akomolafe Rufus Ojo  Department of Physiological Sciences Obafemi Awolowo University Road 7, P.M.B 13, Ile Ife, Osun State, 220282 Nigeria https://orcid.org/0000-0001-5948-7982 Sesan Olaoluwa Olukiran  Department of Physiological Sciences Obafemi Awolowo University Road 7, P.M.B 13, Ile Ife, Osun State, 220282 Nigeria https://orcid.org/0000-0001-7213-3505 Aladesanmi Omolara Titilayo  Institute of Ecology and Environmental Studies, Obafemi Awolowo University Road 7, P.M.B 13, Ile Ife, Osun State, 220282 Nigeria https://orcid.org/0000-0003-2487-4426 Adetutu Aderonke Okoya  Institute of Ecology and Environmental Studies, Obafemi Awolowo University Road 7, P.M.B 13, Ile Ife, Osun State, 220282 Nigeria Corresponding author: Department of Physiological Sciences, Faculty of Basic Medical Sciences, Obafemi Awolowo University, Road 7, P.M.B 13, Ile Ife, Osun State, 220282, Nigeria. Email: osolukiran@oauife.edu.ng oolaoluwasesan@gmail.com 10 2024 30 9 2024 13 5 469875 tfae157 23 1 2024 03 7 2024 18 9 2024 30 09 2025 30 09 2025 02 10 2024 30 09 2025 © The Author(s) 2024. Published by Oxford University Press. All rights reserved. For Permissions, please email: journals.permissions@oup.com 2024 https://academic.oup.com/pages/standard-publication-reuse-rights This article is published and distributed under the terms of the Oxford University Press, Standard Journals Publication Model ( https://academic.oup.com/pages/standard-publication-reuse-rights Abstract Background There is growing concern of the potential damage to vital organs after long term exposure to locally formulated pesticides in rural area of Nigeria. This study was designed to assessed the effects of the individual chemical compound and their combination on the kidney and liver of rats’ model. Methodology Fifty-four rats divided into six groups and three sub-groups were exposed to 25, 50 and 75% dose of each of the pesticide’s LD 50 Conclusion This study established that individual pesticides and their mixture is toxic to the liver and kidney, as evidenced by the elevated markers of renal and liver functions and distortion of the structure of both organs as revealed by their photomicrographs. Therefore, it is a matter of public health significance to regularly monitor pesticide residues in foods and humans in order to assess the food safety risk and population exposure to pesticides. pesticides organophosphates naphthalene liver kidney rats pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Assessment of the toxic influence of locally formulated pesticides on hepatic and renal biomarkers in male Wistar rats",
    "Journal it was published in:": "Toxicology Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11442146/"
  }
}