{
  "title": "Paper_814",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472776 PMC12472776.1 12472776 12472776 41011201 10.3390/ph18091330 pharmaceuticals-18-01330 1 Article Synthesis, Computational Studies, and Structural Analysis of 1-(3,5-Dimethoxyphenyl)azetidin-2-ones with Antiproliferative Activity in Breast Cancer and Chemoresistant Colon Cancer Malebari Azizah M. Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing 1 Kandwal Shubhangi Formal analysis Writing – original draft 2 3 4 Ali Abdirahman Formal analysis Writing – original draft 2 4 https://orcid.org/0000-0003-2417-5406 Fayne Darren Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Supervision 2 4 Twamley Brendan Methodology Formal analysis Investigation Writing – original draft Writing – review & editing 5 https://orcid.org/0000-0001-5005-1023 Zisterer Daniela M. Writing – review & editing Supervision 6 https://orcid.org/0000-0002-8930-5753 Meegan Mary J. Conceptualization Formal analysis Writing – original draft Writing – review & editing Supervision Funding acquisition 7 * Mayence Annie Academic Editor 1 amelibary@kau.edu.sa 2 shubhangi.kandwal@dcu.ie abdirahman.ali8@mail.dcu.ie darren.p.fayne@dcu.ie 3 4 5 twamleyb@tcd.ie 6 dzistrer@tcd.ie 7 * mmeegan@tcd.ie 05 9 2025 9 2025 18 9 497460 1330 07 7 2025 22 8 2025 30 8 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods 12i 12k 12o 12p 12s trans β 12k 12u Results 12l 50 12l Conclusions 12l 1-(3,5-dimethoxyphenyl)-2-azetidinone β antiproliferative activity breast cancer colon cancer tubulin single-crystal X-ray crystallography docking molecular dynamics Irish Research Council GOIPG/2021/954 Research conducted in this publication was funded in part by the Irish Research Council under grant number GOIPG/2021/954. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breast cancer is the most commonly occurring cancer in women and is the leading cause of female cancer deaths [ 1 2 2 3 4 2 5 6 7 8 9 10 11 BRCA 12 13 Colorectal cancer (CRC) is the third most frequently diagnosed cancer worldwide [ 1 14 15 16 17 Small molecule compounds which interact with microtubules are recognised as one of the major clinical options for cancer treatment [ 18 19 20 21 1 22 23 24 Stilbene-based compounds are widely occurring natural products and demonstrate a range of biological activities [ 25 26 cis Combretum caffrum 27 3a 3b 3c e Figure 1 28 29 cis trans 30 31 β 32 33 34 35 36 37 The role of the 3,4,5-trimethoxy-substituted A-Ring of CA-4 in inhibiting tubulin polymerisation is demonstrated in the X-ray crystallographic studies of CA-4, DAMA-colchicine ( 2 22 38 3a 22 35 38 3a 38 39 The 3,5-dihydroxyphenyl substitution pattern is characteristic of stilbenes such as resveratrol ( 4 Figure 1 40 41 42 43 44 45 46 Z 5a 4 42 Z 5b 47 trans 5c 48 6 7 8 9 25 49 50 10 51 52 Figure 1 The three methoxy groups of colchicine ( 1 3a 53 54 55 56 β 36 57 58 59 The specific objectives of the present study were as follows: (i) to investigate the synthesis of a panel of 3,5-dimethoxyaryl Ring A β para β Figure 2 2. Results and Discussion 2.1. Synthesis of β-Lactam Compounds A panel of 3,4-diaryl- β β β Scheme 1 12a n β 12o r The required imines 11a d 60 12a 12c 12a 12c trans β 1 12c J β 13 The 3-phenoxy β 12d 12e 11a 11b Scheme 1 1 β 12e J 3,4 trans 13 12e β 12e cis 1 J 3,4 The 3-Chloro β 12f 12g β 12h 12i Scheme 1 61 β 12j 11j trans 33 β 12l 12n Scheme 1 β β 62 12k 36 1 β 12l J 13 12k trans Figure 3 pharmaceuticals-18-01330-sch001_Scheme 1 Scheme 1 Synthesis of β 12a r 2 12a 12j 6 5 2 6 5 2 2 2 3 3 2 2 12f i 61 12j 33 12k 36 12k 12n 3 2 2 2 2 12o 12r 6 6 Microwave technology was successfully applied for the Reformatsky synthesis of 3-unsubstituted β 12o 12r 63 Scheme 1 1 12q J J J 13 β −1 β 12s 36 64 12t 64 12u 32 Figure 3 trans 12u Figure 3 2.2. Single Crystal X-Ray Crystallography Study of Azetidine-2-ones 12i 12k 12o 12p 12u X-ray crystallography is useful in the development of novel pharmaceutical compounds, as it confirms molecular configuration, and shows hydrogen bonding and other interactions which can influence stability and the biological activity of molecules. The structures of the azetidine-2-ones 12i 12k 12o 12p 12u Figure 3 Table S1 and Figure S1, Supplementary Information trans β 12k 12u; 1 65 66 β 67 12i 12k 12o 12p 12u Figure 4 12i 12k 12o 12p 12u β 12i 12k 12o 12p 12u CA-4 β ortho Figure 3 Table 1 12i 12k 12o 12p 12u 22 65 66 The structural parameters for 12i 12k 12o 12p 12u Table 2 β β 68 69 β 67 70 12i 12k 12o 12p 12u β 70 71 12i 12k 12o 12p Figure 4 12u Hirshfeld surface analysis was used to visualize and quantify the intermolecular interactions in the crystal structure for the β 12i 12o Supplementary Information (Figures S50–S54) 12i 12o 12i Figure S50 12k Figure S51 12o Figure S52 3 3 2 12p Figure S53 12u Figure S54 2.3. Antiproliferative Evaluation of Azetidine-2-ones 12a 12e 12l 12r The antiproliferative effects of the β 12a – 12r 12a – 12e 12l – 12r 12k 36 β Table 3 Table 4 32 34 61 63 As shown in Table 3 β 50 p 12a 12d 12o 12k 50 p 12l 50 12l 50 12b 12e β p 12c 12q 12m 50 12m 50 para 12m para 12n 50 para 12q 12r 50 p β 12b 12l 12p Figure 5 50 β 12f – 12j 33 61 Table 3 Compound 12l 50 β 12m 12l 12a 12b 12o para An evaluation of selected compounds in chemoresistant HT-29 colon cancer cells demonstrated that the 3,5-dimethoxy ring A β 12k 12o 50 Table 4 50 64 72 12l β 50 β 12k 12m 50 12l 50 p 12l 12p 12b 50 β 12m p 50 12c 12q 50 meta β 32 64 12m 12l p β 12b 12l 12p Figure 5 12l meta meta 32 64 In the series of compounds investigated, compound 12l 50 50 Table 4 50 Table 3 β 12t 50 64 12l 12t 50 12s 36 64 12u 32 12u Figure 3 We also investigated a potential relationship between physicochemical properties and cytotoxicity for the series of synthesised compounds. We did not observe a correlation between the molecular volume of the compounds and biological activity (see Supplementary Information, Table S3 12l 50 12k 50 12p 50 12o 50 12l 12m 12n 12o 50 12a 12b 12d 50 pharmaceuticals-18-01330-t003_Table 3 Table 3 Antiproliferative activity of β Compound  MCF-7 50 a LogP e 12a R 1 6 5 2 3 25 ± 3 3.97 12b R 1 6 5 2 2 3 36 ± 10 4.29 12c R 1 6 5 2 3 244 ± 60 4.51 12d R 1 6 5 2 3 54 ± 10 3.69 12e R 1 6 5 2 2 3 273 ± 10 4.02 12k d R 1 2 3 1.5 ± 0.7 2.02 12l R 1 2 2 3 10.5 ± 0.9 2.40 12m R 1 2 3 23 ± 2 2.54 12n R 1 2 2 3 31 ± 6 2.94 12o R 1 2 3 55 ± 10 2.75 12p R 1 2 2 3 75 ± 6 3.11 12q R 1 2 3 150 ± 40 3.27 12r R 1 2 2 3 11,360 ± 800 3.60 12s b R 1 3 2 4 ± 0.4 2.02 12t d R 1 2 3 2 7 ± 0.9 2.28 12u c R 1 3 2 3 5 ± 1 2.31 CA-4 f  4.6 ±0.32 3.27 a 50 −6 50 b 36 c 32 d 64 e 73 f 50 74 75 50 β 12f 12j 33 61 pharmaceuticals-18-01330-t004_Table 4 Table 4 Antiproliferative activity of β Compound  HT-29 50 a Relative Potency b 12b R 1 6 5 2 2 3 114 ± 10 0.316 12c R 1 6 5 2 3 115 ± 20 2.122 12k R 1 2 3 12 ± 3.0 0.167 12l R 1 2 2 3 3 ± 0.9 3.088 12m R 1 2 3 26 ± 4.0 0.885 12o R 1 2 3 89 ± 10 0.618 12p R 1 2 2 3 85± 20 0.873 12q R 1 2 3 747 ± 0.0 c 0.200 12s R 1 3 2 12 ± 2.0 0.333 12t d R 1 2 3 2 15 ± 1 0.466 12u e R 1 3 2 3 7 ± 2 0.714 CA-4 f  3814 ± 100 0.0012 a 50 −6 50 b 50 50 c d 64 e 32 f 50 57 74 75 2.4. Evaluation of In Vitro Cytotoxicity of β-Lactam Compounds In view of the very promising antiproliferative activity results obtained with the MCF-7 and HT-29 cancer cell lines, the in vitro cytotoxicity of the novel β ® 76 77 12a 12b 12c Figure 6 β 12f β 12j 33 12f 12b 12c Figure 6 β 2.5. Predicted Physicochemical Properties, Cheminformatics, and In Vitro ADME Properties for β-Lactams 12a–u The physicochemical and pharmacokinetic properties of active molecules are determined in the early stages of their design to optimise the design of a successful drug candidate for clinical development. The predicted physicochemical characteristics, drug-like features, and pharmacokinetic properties of the selected 3,4-diaryl-2-azetidinone compounds 12a – u 73 Supplementary Information, Figures S1 and S2 and Tables S3–S8 78 79 80 Table S3 Table S4 81 Topological Polar Surface Area (TPSA) is calculated for a drug to provide an indication of the drug’s polarity and thus a prediction of its lipid solubility. The TPSA value is a widely used molecular descriptor in the study of drug transport properties such as intestinal absorption, and blood–brain barrier (BBB) penetration. The TPSA values calculated for all the synthesised molecules were <140 Å 2 2 82 Table S3 83 < 2 12a 12b 12o 12p 2 In preclinical investigations, screening for solubility is a critical challenge encountered in the development of new, poorly soluble drug candidates. Using the SwissADME web tool, the aqueous solubility (log S 73 Table S5 12o a 12l 12m 12a The calculated logP and calculated TPSA of the compounds can be correlated using the Brain Or Intestinal EstimateD permeation method (BOILED-Egg) to display the simultaneous prediction of two key ADME values: gastrointestinal (GI) absorption and brain access (blood–brain barrier, BBB) [ 73 84 Supplementary Information, Figures S1 and S2 12m 12n 12u 12t Supplementary Table S6 and Figures S1 and S2 versus 12b 12c 12t 12u Supplementary Information Table S6 Interestingly, most of the compounds in the series followed the Pfizer and GSK rules for drug-likeness (MW ≤ 400, logP ≤ 4), e.g., for the most potent compound 12l 12l 2 2 Supplementary Information Table S7 http://biosig.unimelb.edu.au/pkcsm/prediction 85 Supplementary Information Table S9 86 Tables S3–S8, Supplementary Information 12l 2.6. Molecular Modelling Study of β-Lactams The computational modelling study was performed on potent compound 12l N 2 87 http://www.gromacs.org 88 β 12l β 12s 36 64 S S trans β 12l 12s S S R R Molecular docking: 89 12l 12s CA-4 2 Figure 7 CA-4 12l 12s 12l 12s 12l 12s 12l Figure 7 12s Figure 7 Molecular Dynamics: CA-4 12l 12s From the MD simulations, we calculated the following: hydrogen bonds between the compounds and the protein, RMSD fluctuations of the complexes from their initial position, the RMSDs obtained by structurally overlaying the most representative frame from MD simulations over the predicted docked poses, and lastly, the structural overlays of the most representative frame from MD simulations of the two compounds to the representative frame of 1Z2B obtained from the MD simulation. The distance between the compounds and the co-crystallised ligand CN2 was calculated by considering the centre of mass. The MD run of the X-ray structure with co-crystallised CN2 (DAMA-colchicine) maintained a stable RMSD, indicating system stability. The CN2 molecule formed hydrogen bonds with Ser178, Val181, and Lys352 ( Figure 8 For CA-4 Figure 9 CA-4 Figure 9 CA-4 CA-4 Figure 9 In the case of the β 12l 12l Figure 10 12l Figure 10 12l 12l Figure 10 12l Figure 10 For β 12s 12s Figure 11 12s 12s Figure 11 12s Figure 11 12s Figure 11 The molecular docking study on the two selected compounds 12s 12l 12l 12l 12l 12l 12l 12l Figure 9 12l 12l Figure 9 12l The MD simulation of 12s 12s 12s 12s Figure 10 12s 12s Figure 10 12s 12s By performing molecular docking and MD simulations, we have indicated that both β 12l 12s Figure 10 12s Figure 10 12s 12l Figure 9 12s 12s 12l 3. Materials and Methods 3.1. Chemistry Infrared (IR) spectra were recorded as potassium bromide discs or films on NaCl plates using a Perkin Elmer FT-IR Spectrum 100 spectrometer (Perkin Elmer, Waltham, MA, USA). 1 13 1 13 3 6 1 3 13 3 f 11a 61 11b) 61 12f 12i [ 61 12j 33 12k 36 12s 36 12t [ 64 12u 32 3.1.1. General Method I: Preparation of Imines 11a 11d 3,5-Dimethoxyaniline (10 mmol) and the appropriately substituted benzaldehyde (10 mmol) were mixed in water (7 mL) over 30 min. The imine product was extracted with DCM, and the organic solution was dried (anhydrous Na 2 4 ( E 11a 61 ( E 11b 61 ( E 11c max −1 1 3 3 3 J J 13 3 + 16 18 2 ( E N 11d max −1 1 3 J 2 3 J 2 3 3 J J 13 3 + 17 20 2 3.1.2. General Method II: Synthesis of Azetidine-2-ones 12a 12j A solution of the appropriate imine (5 mmol) and acid chloride (7 mmol) in dry toluene (50 mL) was stirred at 0 °C under an inert atmosphere. The solution was gradually warmed to 100 °C, and dry triethylamine (TEA) (9 mmol) was slowly added. The reaction solution was heated at 100 °C for 5 h and then stirred at room temperature for 18 h, with monitoring by TLC. The mixture was then washed with water (2 × 100 mL) and dried with anhydrous Na 2 4 n 1-(3,5-Dimethoxyphenyl)-4-(4-methoxyphenyl)-3-phenylazetidin-2-one 12a 11a max −1 1 3 3 3 J J J J J J J J 13 3 2 24 23 4 + 1-(3,5-Dimethoxyphenyl)-4-(4-ethoxyphenyl)-3-phenylazetidin-2-one 12b 11b max −1 1 3 J 2 H 3 3 3 J H 2 3 J 13 3 2 25 25 4 + 1-(3,5-Dimethoxyphenyl)-4-(4-(methylthio)phenyl)-3-phenylazetidin-2-one 12c 11c max −1 1 3 3 3 3 J J J J J 13 3 2 24 24 3 + 1-(3,5-Dimethoxyphenyl)-4-(4-methoxyphenyl)-3-phenoxyazetidin-2-one 12d 11d max −1 1 3 3 3 J J J J 13 3 24 23 5 + 1-(3,5-Dimethoxyphenyl)-4-(4-ethoxyphenyl)-3-phenoxyazetidin-2-one 12e 11b max −1 1 3 12e trans J 2 H 3 3 3 J H 2 3 J J J J J J J 13 3 1 3 12e cis J J J J J J J 13 3 12e cis 25 25 5 + 3-Chloro-1-(3,5-dimethoxyphenyl)-4-(4-methoxyphenyl) azetidin-2-one 12f [ 61 11a 3-Chloro-1-(3,5-dimethoxyphenyl)-4-(4-ethoxyphenyl)azetidin-2-one 12g [ 61 11b 3,3-Dichloro-1-(3,5-dimethoxyphenyl)-4-(4-methoxyphenyl) azetidin-2-one 12h [ 61 11a 3,3-Dichloro-1-(3,5-dimethoxyphenyl)-4-(4-ethoxyphenyl) azetidin-2-one 12i [ 61 11b 1-(3,5-Dimethoxyphenyl)-4-(4-methoxyphenyl)-3-vinylazetidin-2-one 12j [ 33 11a 3.1.3. General Method III: Synthesis of 3-Unsubstituted Azetidine-2-ones 12o 12r A mixture of activated zinc powder (9 mmol) and trimethylchlorosilane (7 mmol) in anhydrous benzene (4 mL) was heated at 40 °C for 15 min. The mixture was then placed in a microwave reactor and heated at 100 °C for 2 min and then cooled to room temperature. The required imine (2 mmol) was then added together with ethyl bromoacetate (5 mmol), and the mixture was then heated in the microwave reactor for 30 min at 100 °C. The reaction mixture was cooled and filtered; the solution was diluted with dichloromethane (30 mL) and washed with an ammonium chloride solution (20 mL, saturated), ammonium hydroxide (20 mL, 25%), HCl (10%, 40 mL), and water (40 mL). The organic solution was dried (anhydrous Na 2 4 1-(3,5-Dimethoxyphenyl)-4-(4-methoxyphenyl)azetidin-2-one 12o 11a max −1 1 3 J J 3 3 J J J J J J J 13 3 2 18 19 4 + 1-(3,5-Dimethoxyphenyl)-4-(4-ethoxyphenyl) azetidin-2-one 12p 11b max −1 1 3 J 2 H 3 J J 3 H 2 3 J J J 13 3 19 21 4 + 1-(3,5-Dimethoxyphenyl)-4-(4-(methylthio)phenyl)azetidin-2-one 12q 11c max −1 1 3 3 J J 3 J J J J 13 3 18 19 3 + 1-(3,5-Dimethoxyphenyl)-4-(4-(ethylthio)phenyl)azetidin-2-one 12r 11d max −1 1 3 2 H 3 H 2 3 J 3 J J 13 3 19 21 3 + 3.1.4. General Method IV: Preparation of 3-Hydroxyazetidin-2-ones ( 12k 12n To a stirred solution of the appropriate imine 11a 11d 2 4 n 4 2 4 n 1-(3,5-Dimethoxyphenyl)-3-hydroxy-4-(4-methoxyphenyl)azetidin-2-one 12k 36 11a max β −1 1 3 3 3 J J J 3 2 6 13 3 3 m z 18 19 5 + 1-(3,5-Dimethoxyphenyl)-4-(4-ethoxyphenyl)-3-hydroxyazetidin-2-one 12l 12b max β 1 3 J 2 H 3 3 J H 2 3 J J J J 13 3 2 C 3 3 C 2 3 19 22 5 + 1-(3,5-Dimethoxyphenyl)-3-hydroxy-4-(4-(methylthio)phenyl)azetidin-2-one 12m 11c max β −1 1 3 3 3 J J J 13 3 3 3 18 19 4 + 4-(4-(Ethylthio)phenyl)-3-hydroxy-1-(3,5-dimethoxyphenyl) azetidin-2-one 12n 11d max β −1 1 3 J 2 H 3 J H 2 3 3 13 3 2 C 3 CH 2 3 3 19 22 5 + 3-Hydroxy-4-(4-methoxyphenyl)-1-(3,4,5-trimethoxyphenyl) azetidin-2-one 12s E N 64 4-(4-Ethoxyphenyl)-3-hydroxy-1-(3,4,5-trimethoxyphenyl) azetidin-2-one 12t 64 E N 3-Hydroxy-4-(4-methoxy-3-methylphenyl)-1-(3,4,5-trimethoxyphenyl)azetidin-2-one 12u 32 E N 3.2. Biochemical Evaluation: Materials and Methods 3.2.1. Cell Culture All biochemical materials, reagents, and growth media for cell cultures were purchased from BD Biosciences (Edmund Halley Road, Oxford, UK). The biochemical assays were performed in triplicate and mean values were reported. The MCF-7 cell line (human breast carcinoma) was obtained from the European Collection of Animal Cell Cultures (ECACC). The cells were cultured in an Eagles minimum essential medium with 10% foetal bovine serum, 2 mM L-glutamine, and 100 mg/mL penicillin/streptomycin and supplemented with 1% non-essential amino acids. HT-29 cells (human colon adenocarcinoma) from the ECACC were grown in DMEM (Dulbecco’s modified Eagle’s medium) GlutaMAX media and supplemented with 10% foetal bovine serum (FBS). Cells were maintained at 37 °C in 5% CO 2 3.2.2. Cell Viability Assay Cells were seeded at a density of 5x10 3 4 v v 64 v v 50 3.2.3. Lactate Dehydrogenase Cytotoxicity Assay The cytotoxicity of the compounds was determined using the CytoTox 96 non-radioactive cytotoxicity assay (Promega, Madison, WI, USA) [ 76 33 3 12a 12b 12c 12f 12j 3.3. Crystallography Crystals for 12i 12s 12i 12p 12u K α K α 90 91 92 F 2 93 Crystals for 12o 94 95 96 2 93 Table S1, Supplementary Information U iso U eq 3 97 www.ccdc.cam.ac.uk/structures 3.4. 3D Protein–Ligand Modelling 3.4.1. Structure Preparation The protein structure was prepared using the MOE 2022.02 (MOE, 2022) Quick Prep option [ 98 3.4.2. Molecular Docking To model the interactions between CA-4 12l, 12s 89 https://www.eyesopen.com/omega 99 100 3.4.3. Molecular Dynamics (MD) Simulations The molecular dynamics (MD) simulations were performed using GROMACS 2020.7 [ 88 101 102 + 103 104 4. Conclusions The four-membered β 32 33 34 58 35 36 37 12i 12k 12o 12p 12u trans β 12k 12u The inclusion of the 3,5-dimethoxyphenyl substituent at N-1 resulted in azetidine-2-one products, with potent antiproliferative activity in MCF-7 human breast cancer cells for 12a 12b 12l 12m 12n 12l 12o 50 12p 50 We explored the effect of the removal of the Ring A para 12s 12l 12s 12s 12l β 12l β Acknowledgments We thank John O’Brien and Manuel Ruether for NMR spectroscopy, Gary Hessman for High Resolution Mass Spectrometry, and Niamh O’Boyle for her helpful comments on the manuscript. We thank Peadar Grant for manuscript preparation. The Trinity Biomedical Sciences Institute (TBSI) is supported by capital infrastructure investment from Cycle 5 of the Irish Higher Education Authority’s Programme for Research in Third Level Institutions (PRTLI). This study was also co-funded under the European Regional Development Fund. S.K., A.A. and D.F. thank the software vendors for their continuing support of academic research efforts, in particular the contributions of the Chemical Computing Group (CCG) and OpenEye, Cadence Molecular Sciences. The support and provisions of Dell Ireland and the Irish Centre for High-End Computing (ICHEC) are also gratefully acknowledged. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ph18091330/s1 12i 12k 12o 12p 12s β 12a 12t 12i 12k 12o 12p 12s 12b 12l 12e 12m 12o 12p 12b 12c 12l 12n 12o 12p 1 13 12i 12k 12o 12p 12u Author Contributions Conceptualisation, A.M.M. and M.J.M.; formal analysis, A.M.M., B.T., D.F., S.K., A.A. and M.J.M.; funding acquisition, M.J.M.; investigation, A.M.M., B.T. and D.F.; methodology, A.M.M., D.F. and B.T.; supervision, M.J.M., D.F. and D.M.Z.; writing—original draft, M.J.M., D.F., S.K., A.A., B.T. and A.M.M.; writing—review and editing, M.J.M., A.M.M., B.T., D.M.Z. and D.F. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. Abbreviations ADC Antibody–drug conjugate ADME Absorption, distribution, metabolism, and excretion BBB Blood–brain barrier CA-4 Combretastatin A-4 CBSI Colchicine binding site inhibitor CCDC Cambridge Crystallographic Data Centre CDK Cyclin-dependent kinase CRC Colorectal cancer CYP2D6 Cytochrome P450 2D6 DAMA-colchicine N-deacetyl-N-(2-mercaptoacetyl)-colchicine DCM Dichloromethane DMEM Dulbecco’s modified Eagle’s medium ECACC European Collection of Animal Cell Cultures ESI Electrospray Ionisation EGF Endothelial growth factor ER Estrogen receptor FBS Foetal bovine serum GI Gastrointestinal HER2 Human epidermal growth factor receptor 2 HPLC High Performance Liquid Chromatography HRMS High Resolution Mass Spectrometry HR Hormone Receptor IC Inhibitory concentration IR Infrared LDH Lactate dehydrogenase mCRC Metastatic colorectal cancer MD Molecular Dynamics NMR Nuclear Magnetic Resonance PAINS Pan-Assay Interference Compounds PARP Poly(adenosine diphosphate–ribose) polymerase PD-1 Programmed cell death protein 1 P-gp P-glycoprotein PR Progesterone receptor RNS Reactive nitrogen species ROS Reactive oxygen species SAR Structure–activity relationship SERD Selective estrogen receptor degrader SERM Selective estrogen receptor modulator SIRT1 Sirtuin 1 TBNC Triple-negative breast cancer TEA Triethylamine TLC Thin layer chromatography TMS Tetramethylsilane TPSA Topological Polar Surface Area UGT UDP-glucuronosyltransferase VEGF Vascular endothelial growth factor References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: Globocan estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Chaurasia M. Singh R. Sur S. Flora S.J.S. A review of FDA approved drugs and their formulations for the treatment of breast cancer Front. Pharmacol. 2023 14 1184472 10.3389/fphar.2023.1184472 37576816 PMC10416257 3. Wang X. Zhao S. Xin Q. Zhang Y. Wang K. Li M. Recent progress of CDK4/6 inhibitors’ current practice in breast cancer Cancer Gene Ther. 2024 31 1283 1291 10.1038/s41417-024-00747-x 38409585 PMC11405274 4. Downton T. Zhou F. Segara D. Jeselsohn R. Lim E. Oral selective estrogen receptor degraders (SERDs) in breast cancer: Advances, challenges, and current status Drug Des. Dev. Ther. 2022 16 2933 2948 10.2147/DDDT.S380925 PMC9447452 36081610 5. Swain S.M. Shastry M. Hamilton E. Targeting HER2-positive breast cancer: Advances and future directions Nat. Rev. Drug Discov. 2023 22 101 126 10.1038/s41573-022-00579-0 36344672 PMC9640784 6. Schlam I. Swain S.M. HER2--positive breast cancer and tyrosine kinase inhibitors: The time is now NPJ Breast Cancer 2021 7 56 10.1038/s41523-021-00265-1 34016991 PMC8137941 7. Liu B. Zhou H. Tan L. Siu K.T.H. Guan X.Y. Exploring treatment options in cancer: Tumor treatment strategies Signal Transduct. Target. Ther. 2024 9 175 10.1038/s41392-024-01856-7 39013849 PMC11252281 8. Zagami P. Carey L.A. Triple negative breast cancer: Pitfalls and progress NPJ Breast Cancer 2022 8 95 10.1038/s41523-022-00468-0 35987766 PMC9392735 9. Xiong N. Wu H. Yu Z. Advancements and challenges in triple-negative breast cancer: A comprehensive review of therapeutic and diagnostic strategies Front. Oncol. 2024 14 1405491 10.3389/fonc.2024.1405491 38863622 PMC11165151 10. Kumar S. Chatterjee M. Ghosh P. Ganguly K.K. Basu M. Ghosh M.K. Targeting PD-1/PD-L1 in cancer immunotherapy: An effective strategy for treatment of triple-negative breast cancer (TBNC) patients Genes Dis. 2023 10 1318 1350 10.1016/j.gendis.2022.07.024 37397537 PMC10311058 11. Liu Y. Hu Y. Xue J. Li J. Yi J. Bu J. Zhang Z. Qiu P. Gu X. Advances in immunotherapy for triple-negative breast cancer Mol. Cancer 2023 22 145 10.1186/s12943-023-01850-7 37660039 PMC10474743 12. Tung N. Garber J.E. PARP inhibition in breast cancer: Progress made and future hopes NPJ Breast Cancer 2022 8 47 10.1038/s41523-022-00411-3 35396508 PMC8993852 13. Pont M. Marques M. Sorolla A. Latest therapeutical approaches for triple-negative breast cancer: From preclinical to clinical research Int. J. Mol. Sci. 2024 25 13518 10.3390/ijms252413518 39769279 PMC11676458 14. Brenner H. Kloor M. Pox C.P. Colorectal cancer Lancet 2014 383 1490 1502 10.1016/S0140-6736(13)61649-9 24225001 15. Wang Q. Shen X. Chen G. Du J. Drug resistance in colorectal cancer: From mechanism to clinic Cancers 2022 14 2928 10.3390/cancers14122928 35740594 PMC9221177 16. Jeffers M. Kappeler C. Kuss I. Beckmann G. Mehnert D.H. Fredebohm J. Teufel M. Broad spectrum of regorafenib activity on mutant KIT and absence of clonal selection in gastrointestinal stromal tumor (GIST): Correlative analysis from the GRID trial Gastric Cancer 2022 25 598 608 10.1007/s10120-021-01274-6 35050442 PMC9013336 17. Kita K. Burdowski A. Recent clinical trials and optical control as a potential strategy to develop microtubule-targeting drugs in colorectal cancer management World J. Gastroenterol. 2024 30 1780 1790 10.3748/wjg.v30.i13.1780 38659489 PMC11036503 18. Steinmetz M.O. Prota A.E. Structure-based discovery and rational design of microtubule-targeting agents Curr. Opin. Struct. Biol. 2024 87 102845 10.1016/j.sbi.2024.102845 38805950 19. Waldman A.D. Fritz J.M. Lenardo M.J. A guide to cancer immunotherapy: From T cell basic science to clinical practice Nat. Rev. Immunol. 2020 20 651 668 10.1038/s41577-020-0306-5 32433532 PMC7238960 20. Wordeman L. Vicente J.J. Microtubule targeting agents in disease: Classic drugs, novel roles Cancers 2021 13 5650 10.3390/cancers13225650 34830812 PMC8616087 21. Muhlethaler T. Gioia D. Prota A.E. Sharpe M.E. Cavalli A. Steinmetz M.O. Comprehensive analysis of binding sites in tubulin Angew. Chem. Int. Ed. Engl. 2021 60 13331 13342 10.1002/anie.202100273 33951246 PMC8251789 22. Ravelli R.B. Gigant B. Curmi P.A. Jourdain I. Lachkar S. Sobel A. Knossow M. Insight into tubulin regulation from a complex with colchicine and a stathmin-like domain Nature 2004 428 198 202 10.1038/nature02393 15014504 23. Nainwal L.M. Alam M.M. Shaquiquzzaman M. Marella A. Kamal A. Combretastatin-based compounds with therapeutic characteristics: A patent review Expert Opin. Ther. Patents 2019 29 703 731 10.1080/13543776.2019.1651841 31369715 24. McNamara D.E. Senese S. Yeates T.O. Torres J.Z. Structures of potent anticancer compounds bound to tubulin Protein Sci. 2015 24 1164 1172 10.1002/pro.2704 25970265 PMC4500315 25. Pecyna P. Wargula J. Murias M. Kucinska M. More than resveratrol: New insights into stilbene-based compounds Biomolecules 2020 10 1111 10.3390/biom10081111 32726968 PMC7465418 26. Csuk R. Albert S. Siewert B. Schwarz S. Synthesis and biological evaluation of novel ( E Eur. J. Med. Chem. 2012 54 669 678 10.1016/j.ejmech.2012.06.015 22749392 27. Pettit G.R. Singh S.B. Hamel E. Lin C.M. Alberts D.S. Garcia-Kendall D. Isolation and structure of the strong cell growth and tubulin inhibitor combretastatin A-4 Experientia 1989 45 209 211 10.1007/BF01954881 2920809 28. Greene L.M. Meegan M.J. Zisterer D.M. Combretastatins: More than just vascular targeting agents? J. Pharmacol. Exp. Ther. 2015 355 212 227 10.1124/jpet.115.226225 26354991 29. Faustino C. Francisco A.P. Isca V.M.S. Duarte N. Cytotoxic stilbenes and derivatives as promising antimitotic leads for cancer therapy Curr. Pharm. Des. 2018 24 4270 4311 10.2174/1381612825666190111123959 30636588 30. McLoughlin E.C. O’Boyle N.M. Colchicine-binding site inhibitors from chemistry to clinic: A review Pharmaceuticals 2020 13 8 10.3390/ph13010008 31947889 PMC7168938 31. Hawash M. Recent advances of tubulin inhibitors targeting the colchicine binding site for cancer therapy Biomolecules 2022 12 1843 10.3390/biom12121843 36551271 PMC9776383 32. Malebari A.M. Fayne D. Nathwani S.M. O’Connell F. Noorani S. Twamley B. O’Boyle N.M. O’Sullivan J. Zisterer D.M. Meegan M.J. Beta-lactams with antiproliferative and antiapoptotic activity in breast and chemoresistant colon cancer cells Eur. J. Med. Chem. 2020 189 112050 10.1016/j.ejmech.2020.112050 31954879 33. Wang S. Malebari A.M. Greene T.F. O’Boyle N.M. Fayne D. Nathwani S.M. Twamley B. McCabe T. Keely N.O. Zisterer D.M. 3-vinylazetidin-2-ones: Synthesis, antiproliferative and tubulin destabilizing activity in MCF-7 and MDA-MB-231 breast cancer cells Pharmaceuticals 2019 12 56 10.3390/ph12020056 30979033 PMC6630832 34. O’Boyle N.M. Carr M. Greene L.M. Bergin O. Nathwani S.M. McCabe T. Lloyd D.G. Zisterer D.M. Meegan M.J. Synthesis and evaluation of azetidinone analogues of combretastatin A-4 as tubulin targeting agents J. Med. Chem. 2010 53 8569 8584 10.1021/jm101115u 21080725 35. Zhou P. Liang Y. Zhang H. Jiang H. Feng K. Xu P. Wang J. Wang X. Ding K. Luo C. Design, synthesis, biological evaluation and cocrystal structures with tubulin of chiral β Eur. J. Med. Chem. 2018 144 817 842 10.1016/j.ejmech.2017.12.004 29306206 36. Tripodi F. Pagliarin R. Fumagalli G. Bigi A. Fusi P. Orsini F. Frattini M. Coccetti P. Synthesis and biological evaluation of 1,4-diaryl-2-azetidinones as specific anticancer agents: Activation of adenosine monophosphate activated protein kinase and induction of apoptosis J. Med. Chem. 2012 55 2112 2124 10.1021/jm201344a 22329561 37. Arya N. Jagdale A.Y. Patil T.A. Yeramwar S.S. Holikatti S.S. Dwivedi J. Shishoo C.J. Jain K.S. The chemistry and biological potential of azetidin-2-ones Eur. J. Med. Chem. 2014 74 619 656 10.1016/j.ejmech.2014.01.002 24531200 38. Gaspari R. Prota A.E. Bargsten K. Cavalli A. Steinmetz M.O. Structural basis of cis- trans- Chem 2017 2 102 113 10.1016/j.chempr.2016.12.005 39. Sargsyan A. Sahakyan H. Nazaryan K. Effect of colchicine binding site inhibitors on the tubulin intersubunit interaction ACS Omega 2023 8 29448 29454 10.1021/acsomega.3c02979 37599936 PMC10433359 40. Ko J.H. Sethi G. Um J.Y. Shanmugam M.K. Arfuso F. Kumar A.P. Bishayee A. Ahn K.S. The role of resveratrol in cancer therapy Int. J. Mol. Sci. 2017 18 2589 10.3390/ijms18122589 29194365 PMC5751192 41. Mikstacka R. Stefanski T. Rozanski J. Tubulin-interactive stilbene derivatives as anticancer agents Cell. Mol. Biol. Lett. 2013 18 368 397 10.2478/s11658-013-0094-z 23818224 PMC6275897 42. Schneider Y. Chabert P. Stutzmann J. Coelho D. Fougerousse A. Gosse F. Launay J.F. Brouillard R. Raul F. Resveratrol analog ( Z Int. J. Cancer 2003 107 189 196 10.1002/ijc.11344 12949793 43. Ahmadi R. Ebrahimzadeh M.A. Resveratrol—A comprehensive review of recent advances in anticancer drug design and development Eur. J. Med. Chem. 2020 200 112356 10.1016/j.ejmech.2020.112356 32485531 44. Elshaer M. Chen Y. Wang X.J. Tang X. Resveratrol: An overview of its anti-cancer mechanisms Life Sci. 2018 207 340 349 10.1016/j.lfs.2018.06.028 29959028 45. Baur J.A. Pearson K.J. Price N.L. Jamieson H.A. Lerin C. Kalra A. Prabhu V.V. Allard J.S. Lopez-Lluch G. Lewis K. Resveratrol improves health and survival of mice on a high-calorie diet Nature 2006 444 337 342 10.1038/nature05354 17086191 PMC4990206 46. Agbadua O.G. Kusz N. Berkecz R. Vass E. Csampai A. Toth G. Balogh G.T. Marcourt L. Wolfender J.L. Queiroz E.F. New insights into the French paradox: Free radical scavenging by resveratrol yields cardiovascular protective metabolites J. Med. Chem. 2025 68 10031 10047 10.1021/acs.jmedchem.4c03061 40331971 PMC12105021 47. Cai Y.C. Zou Y. Ye Y.L. Sun H.Y. Su Q.G. Wang Z.X. Zeng Z.L. Xian L.J. Anti-tumor activity and mechanisms of a novel vascular disrupting agent, (Z)-3,4′,5-trimethoxylstilbene-3′-O-phosphate disodium (M410) Investig. New Drugs 2011 29 300 311 10.1007/s10637-009-9366-x 20012336 48. Fuggetta M.P. Lanzilli G. Tricarico M. Cottarelli A. Falchetti R. Ravagnan G. Bonmassar E. Effect of resveratrol on proliferation and telomerase activity of human colon cancer cells in vitro J. Exp. Clin. Cancer Res. 2006 25 189 193 16918129 49. Chen R.J. Kuo H.C. Cheng L.H. Lee Y.H. Chang W.T. Wang B.J. Wang Y.J. Cheng H.C. Apoptotic and nonapoptotic activities of pterostilbene against cancer Int. J. Mol. Sci. 2018 19 287 10.3390/ijms19010287 29346311 PMC5796233 50. Hu W.H. Dai D.K. Zheng B.Z. Duan R. Dong T.T. Qin Q.W. Tsim K.W. Piceatannol, a natural analog of resveratrol, exerts anti-angiogenic efficiencies by blockage of vascular endothelial growth factor binding to its receptor Molecules 2020 25 3769 10.3390/molecules25173769 32824997 PMC7504081 51. Su D. Cheng Y. Liu M. Liu D. Cui H. Zhang B. Zhou S. Yang T. Mei Q. Comparision of piceid and resveratrol in antioxidation and antiproliferation activities in vitro PLoS ONE 2013 8 e54505 10.1371/journal.pone.0054505 23342161 PMC3546968 52. Robb E.L. Stuart J.A. The stilbenes resveratrol, pterostilbene and piceid affect growth and stress resistance in mammalian cells via a mechanism requiring estrogen receptor beta and the induction of Mn-superoxide dismutase Phytochemistry 2014 98 164 173 10.1016/j.phytochem.2013.11.019 24361291 53. Wang J. Miller D.D. Li W. Molecular interactions at the colchicine binding site in tubulin: An X-ray crystallography perspective Drug Discov. Today 2022 27 759 776 10.1016/j.drudis.2021.12.001 34890803 PMC8901563 54. da Silva W.P.C. Caiana R.R.A. Barros M.E.S.B. Freitas J.C.R. da Silva P.B.N. Militao G.G.C. Oliveira R.A. Menezes P.H. Design, stereoselective synthesis, and antitumoral activity of combretastatin A-4 analogs Results Chem. 2024 7 101539 10.1016/j.rechem.2024.101539 55. Madadi N.R. Zong H. Ketkar A. Zheng C. Penthala N.R. Janganati V. Bommagani S. Eoff R.L. Guzman M.L. Crooks P.A. Synthesis and evaluation of a series of resveratrol analogues as potent anti-cancer agents that target tubulin MedChemComm 2015 6 788 794 10.1039/C4MD00478G 26257861 PMC4527554 56. Pettit G.R. Minardi M.D. Rosenberg H.J. Hamel E. Bibby M.C. Martin S.W. Jung M.K. Pettit R.K. Cuthbertson T.J. Chapuis J.C. Antineoplastic agents. 509: Synthesis of fluorcombstatin phosphate and related 3-halostilbenes(1) J. Nat. Prod. 2005 68 1450 1458 10.1021/np058038i 16252907 57. Valtorta S. Nicolini G. Tripodi F. Meregalli C. Cavaletti G. Avezza F. Crippa L. Bertoli G. Sanvito F. Fusi P. A novel AMPK activator reduces glucose uptake and inhibits tumor progression in a mouse xenograft model of colorectal cancer Investig. New Drugs 2014 32 1123 1133 10.1007/s10637-014-0148-8 25134489 58. McLoughlin E.C. Twamley B. O’Brien J.E. Hannon Barroeta P. Zisterer D.M. Meegan M.J. O’Boyle N.M. Synthesis by diastereomeric resolution, biochemical evaluation and molecular modelling of chiral 3-hydroxyl β Bioorg. Chem. 2023 141 106877 10.1016/j.bioorg.2023.106877 37804699 59. Sun L. Vasilevich N.I. Fuselier J.A. Hocart S.J. Coy D.H. Examination of the 1,4-disubstituted azetidinone ring system as a template for combretastatin A-4 conformationally restricted analogue design Bioorg. Med. Chem. Lett. 2004 14 2041 2046 10.1016/j.bmcl.2004.02.050 15080975 60. Bhagat S. Sharma N. Chundawat T.S. Synthesis of some salicylaldehyde-based Schiff bases in aqueous media J. Chem. 2013 2013 909217 10.1155/2013/909217 61. Malebari A.M. Wang S. Greene T.F. O’Boyle N.M. Fayne D. Khan M.F. Nathwani S.M. Twamley B. McCabe T. Zisterer D.M. Synthesis and antiproliferative evaluation of 3-chloroazetidin-2-ones with antimitotic activity: Heterocyclic bridged analogues of combretastatin A-4 Pharmaceuticals 2021 14 1119 10.3390/ph14111119 34832901 PMC8624998 62. Walsh O.M. Meegan M.J. Prendergast R.M. Al Nakib T. Synthesis of 3-acetoxyazetidin-2-ones and 3-hydroxyazetidin-2-ones with antifungal and antibacterial activity Eur. J. Med. Chem. 1996 31 989 1000 10.1016/S0223-5234(97)86178-8 63. Carr M. Greene L.M. Knox A.J. Lloyd D.G. Zisterer D.M. Meegan M.J. Lead identification of conformationally restricted beta-lactam type combretastatin analogues: Synthesis, antiproliferative activity and tubulin targeting effects Eur. J. Med. Chem. 2010 45 5752 5766 10.1016/j.ejmech.2010.09.033 20933304 64. Malebari A.M. Greene L.M. Nathwani S.M. Fayne D. O’Boyle N.M. Wang S. Twamley B. Zisterer D.M. Meegan M.J. Beta-lactam analogues of combretastatin A-4 prevent metabolic inactivation by glucuronidation in chemoresistant HT-29 colon cancer cells Eur. J. Med. Chem. 2017 130 261 285 10.1016/j.ejmech.2017.02.049 28254699 65. Combes S. Barbier P. Douillard S. McLeer-Florin A. Bourgarel-Rey V. Pierson J.T. Fedorov A.Y. Finet J.P. Boutonnat J. Peyrot V. Synthesis and biological evaluation of 4-arylcoumarin analogues of combretastatins. Part 2 J. Med. Chem. 2011 54 3153 3162 10.1021/jm901826e 21488686 66. Lara-Ochoa F. Espinosa-Perez G. A new synthesis of combretastatins A-4 and A-4 and AVE-8062A Tetrahedron Lett. 2007 48 7007 7010 10.1016/j.tetlet.2007.07.151 67. Twamley B. O’Boyle N.M. Meegan M.J. Azetidin-2-ones: Structures of anti-mitotic compounds based on the 1-(3,4,5-trimethoxyphenyl)azetidin-2-one core Acta Crystallogr. E Crystallogr. Commun. 2020 76 1187 1194 10.1107/S2056989020008555 32843997 PMC7405576 68. Spek A.L. Vandersteen F.H. Jastrzebski J.T.B.H. Vankoten G. Trans-3-amino-1-methyl-4-phenyl-2-azetidinone, C 10 12 2 Acta Crystallogr. Sect. C Cryst. Struct. Commun. 1994 50 1933 1935 10.1107/S0108270194007675 69. Kabak M. Senoz H. Elmali A. Adar V. Svoboda I. Dusek M. Fejfarova K. Synthesis and X-ray crystal structure determination of N- p Crystallogr. Rep. 2010 55 1220 1222 10.1134/S1063774510070229 70. Vaske Y.S. Mahoney M.E. Konopelski J.P. Rogow D.L. McDonald W.J. Enantiomerically pure trans J. Am. Chem. Soc. 2010 132 11379 11385 10.1021/ja1050023 20698705 PMC2924779 71. Page M.I. The Chemistry of β-Lactams Springer Science + Business Media Dordrecht, The Netherlands 1992 72. Aprile S. Del Grosso E. Grosa G. Identification of the human UDP-glucuronosyltransferases involved in the glucuronidation of combretastatin A-4 Drug Metab. Dispos. 2010 38 1141 1146 10.1124/dmd.109.031435 20375181 73. Daina A. Michielin O. Zoete V. SwissADME: A free web tool to evaluate pharmacokinetics, drug-likeness and medicinal chemistry friendliness of small molecules Sci. Rep. 2017 7 42717 10.1038/srep42717 28256516 PMC5335600 74. Cushman M. Nagarathnam D. Gopal D. He H.M. Lin C.M. Hamel E. Synthesis and evaluation of analogues of ( Z J. Med. Chem. 1992 35 2293 2306 10.1021/jm00090a021 1613753 75. Flynn B.L. Flynn G.P. Hamel E. Jung M.K. The synthesis and tubulin binding activity of thiophene-based analogues of combretastatin A-4 Bioorganic Med. Chem. Lett. 2001 11 2341 2343 10.1016/S0960-894X(01)00436-X 11527727 76. Promega Corporation, CytoTox 96® Non-Radioactive Cytotoxicity Assay; Promega CytoTox 96 Nonradioactive Cytotoxicity Assay Protocol 2016 Available online: https://worldwide.promega.com/products/cell-health-assays/cell-viability-and-cytotoxicity-assays/cytotox-96-non_radioactive-cytotoxicity-assay/?Catnum=g1780 (accessed on 6 February 2025) 77. Mallepally R.R. Chintakuntla N. Putta V.R. Nagasuryaprasad K. Vuradi R.K. Madhuri P. Singh S.S. Chitumalla R.K. Jang J. Penumaka N. Synthesis, spectral properties and DFT calculations of new ruthenium (II) polypyridyl complexes; DNA binding affinity and in vitro cytotoxicity activity J. Fluoresc. 2017 27 1513 1530 10.1007/s10895-017-2091-5 28432633 78. Molinspiration Cheminformatics Free Web Services Molinspiration Cheminformatics, SK-900 26 Slovensky Grob, Slovak Republic, Slovakia Available online: https://www.molinspiration.com (accessed on 28 February 2025) 79. DeGoey D.A. Chen H.J. Cox P.B. Wendt M.D. Beyond the rule of 5: Lessons learned from Abbvie’s drugs and compound collection J. Med. Chem. 2018 61 2636 2651 10.1021/acs.jmedchem.7b00717 28926247 80. Lloyd D.G. Golfis G. Knox A.J. Fayne D. Meegan M.J. Oprea T.I. Oncology exploration: Charting cancer medicinal chemistry space Drug Discov. Today 2006 11 149 159 10.1016/S1359-6446(05)03688-3 16533713 81. Daina A. Michielin O. Zoete V. SwissTargetPrediction: Updated data and new features for efficient prediction of protein targets of small molecules Nucleic Acids Res. 2019 47 W357 W364 10.1093/nar/gkz382 31106366 PMC6602486 82. Ertl P. Rohde B. Selzer P. Fast calculation of molecular polar surface area as a sum of fragment-based contributions and its application to the prediction of drug transport properties J. Med. Chem. 2000 43 3714 3717 10.1021/jm000942e 11020286 83. Davis A. Ward S.E. The Handbook of Medicinal Chemistry: Principles and Practice Royal Society of Chemistry London, UK 2014 84. Daina A. Zoete V. A boiled-egg to predict gastrointestinal absorption and brain penetration of small molecules ChemMedChem 2016 11 1117 1121 10.1002/cmdc.201600182 27218427 PMC5089604 85. Pires D.E. Blundell T.L. Ascher D.B. pkCSM: Predicting small-molecule pharmacokinetic and toxicity properties using graph-based signatures J. Med. Chem. 2015 58 4066 4072 10.1021/acs.jmedchem.5b00104 25860834 PMC4434528 86. Baell J.B. Nissink J.W.M. Seven year itch: Pan-assay interference compounds (PAINS) in 2017-utility and limitations ACS Chem. Biol. 2018 13 36 44 10.1021/acschembio.7b00903 29202222 PMC5778390 87. Gigant B. Wang C. Ravelli R.B. Roussi F. Steinmetz M.O. Curmi P.A. Sobel A. Knossow M. Structural basis for the regulation of tubulin by vinblastine Nature 2005 435 519 522 10.1038/nature03566 15917812 88. Pronk S. Pall S. Schulz R. Larsson P. Bjelkmar P. Apostolov R. Shirts M.R. Smith J.C. Kasson P.M. van der Spoel D. GROMACS 4.5: A high-throughput and highly parallel open source molecular simulation toolkit Bioinformatics 2013 29 845 854 10.1093/bioinformatics/btt055 23407358 PMC3605599 89. McGann M. FRED pose prediction and virtual screening accuracy J. Chem. Inf. Model. 2011 51 578 596 10.1021/ci100436p 21323318 90. Bruker SAINT v8.34a Bruker AXS Inc. Madison, WI, USA 2013 91. Bruker SADABS 2014/2 Bruker AXS Inc. Madison, WI, USA 2014 92. Sheldrick G.M. SHELXT—Integrated space-group and crystal-structure determination Acta Crystallogr. Sect. A Found. Adv. 2015 71 3 8 10.1107/S2053273314026370 25537383 PMC4283466 93. Sheldrick G.M. Crystal structure refinement with SHELXL Acta Crystallogr. Sect. C Struct. Chem. 2015 71 3 8 10.1107/S2053229614024218 25567568 PMC4294323 94. Rigaku REQAB Rigaku Corporation Tokyo, Japan 1998 Available online: https://rigaku.com (accessed on 29 August 2025) 95. Rigaku Crystalclear Rigaku Corporation Tokyo, Japan 2011 Available online: https://rigaku.com (accessed on 29 August 2025) 96. Sheldrick G.M. A short history of SHELX Acta Crystallogr. A 2008 64 112 122 10.1107/S0108767307043930 18156677 97. Groom C.R. Bruno I.J. Lightfoot M.P. Ward S.C. The Cambridge structural database Acta Crystallogr. Sect. B Struct. Sci. Cryst. Eng. Mater. 2016 72 171 179 10.1107/S2052520616003954 PMC4822653 27048719 98. Molecular Operating Environment Integrated Computer-Aided Molecular Design Platfom MOE version 2022.02 Chemical Computing Group Inc. Montreal, QC, Canada 2022 Available online: https://www.chemcomp.Com/EN/products.htm (accessed on 12 May 2025) 99. Hawkins P.C. Skillman A.G. Warren G.L. Ellingson B.A. Stahl M.T. Conformer generation with OMEGA: Algorithm and validation using high quality structures from the Protein Databank and Cambridge Structural Database J. Chem. Inf. Model. 2010 50 572 584 10.1021/ci100031x 20235588 PMC2859685 100. OpenEye, Make Receptor OEDOCKING 4.3.2.1. Cadence Molecular Sciences, Inc. Santa Fe, NM, USA 2025 Available online: http://www.eyesopen.com (accessed on 12 May 2025) 101. Best R.B. Zhu X. Shim J. Lopes P.E. Mittal J. Feig M. Mackerell A.D. Jr. Optimization of the additive CHARMM all-atom protein force field targeting improved sampling of the backbone phi, psi and side-chain chi(1) and chi(2) dihedral angles J. Chem. Theory Comput. 2012 8 3257 3273 10.1021/ct300400x 23341755 PMC3549273 102. Vanommeslaeghe K. Hatcher E. Acharya C. Kundu S. Zhong S. Shim J. Darian E. Guvench O. Lopes P. Vorobyov I. CHARMM general force field: A force field for drug-like molecules compatible with the CHARMM all-atom additive biological force fields J. Comput. Chem. 2010 31 671 690 10.1002/jcc.21367 19575467 PMC2888302 103. Turner P.J. XMGRACE Version 5.1. 19. Center for Coastal and Land-Margin Research, Oregon Graduate Institute of Science and Technology Beaverton, OR, USA 2005 104. Pymol Molecular Graphics System Available online: https://www.Schrodinger.Com/life-science/learn/education/courses/pymol/ (accessed on 12 May 2025) Figures, Scheme and Tables Figure 1 Colchicine ( 1 2 3a e 4 5 10 Figure 2 1-(3,5-Dimethoxyphenyl)azetidine-2-ones investigated. Figure 3 View of the molecular structure of the compounds 12i 12k 12o 12p 12u Figure 4 A view of the overlay of the same chirality of 12i 12k 12o 12p 12u ipso Figure 5 Antiproliferative activity of β 12b 12l 12p A β 12b 12l 12p B β 12b 12l 12p β 12b 12l 12p v v Figure 6 LDH assay for 3,5-dimethoxyphenyl ring A β 12a 12b 12c 12f 12j 76 Table S2 12j 33 Figure 7 ( a b 12l c 12s d CA-4 Figure 8 ( a b Figure 9 ( a b c d Figure 10 ( a 12l b 12l 12l c d 12l Figure 11 ( a 12s b 12s 12s c d 12s pharmaceuticals-18-01330-t001_Table 1 Table 1 X-Ray crystallography data, ring angles, and torsions for compounds 12i 12k 12o 12p 12u CA-4   12i 1 2 3 2 3 4 5 12k 1 2 3 3 4 5 12o 1 2 3 3 4 5 12p 1 2 3 2 3 4 5 12u 1 2 3 3 4 3 5 3  CA-4  Compound  Ring Plane Normal AB Angle (°) a  Ring Plane Normal BC Angle (°) a  Ring Plane Normal AC Angle (°) a  Ring A to Central Torsion (°) a,b  Ring B to Central Torsion (°) a,c  Ring AB Torsion (°) a,d  Ring BC Torsion (°) a,e 12i 73.84(3) 72.30(4) 4.50(7) 4.75(10) −159.42(11) 63.36(16) −117.16(10) 12k 80.66(3) 76.92(4) 6.02(8) −3.39(19) −149.88(11) −62.89(16) 120.74(11) 12o 76.14(5) 78.93(6) 7.23(10) −1.9(2) 147.69(11) −57.13(16) 130.58(12) 12p 89.98(3) 89.65(3) 7.700(8) 10.83(16) −123.83(10) 62.53(11) −127.59(10) 12u 77.81(3) 79.45(5) 5.25(11) 2.1(2) −145.76(11) 60.46(16) −116.87(12) CA-4 53.0(1) - -  144.0(4) −9.4(8)  a b d 12i 12k 12o 12p 12u c e 12i 12k 12o 12p 12u CA-4 pharmaceuticals-18-01330-t002_Table 2 Table 2 Structural parameters for 12i 12k 12o 12p 12u  12i 12k 12o 12p 12u  C=O 1.2023(15) 1.2181(14) 1.2104(16) 1.2140(12) 1.2222(16)  C-2/C-3 1.5415(16) 1.5428(16) 1.5260(19) 1.5244(14) 1.5354(17)  N1/C-4 1.4859(15) 1.4860(14) 1.4874(16) 1.4910(12) 1.4951(15)  C-2/N1 1.3689(15) 1.3661(14) 1.3772(16) 1.3754(12) 1.3589(16) ",
  "metadata": {
    "Title of this paper": null,
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472776/"
  }
}