{
  "title": "Paper_1075",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468916 PMC12468916.1 12468916 12468916 41008895 10.3390/cancers17183051 cancers-17-03051 1 Article Long-Term Survival After Thyroidectomy for Thyroid Cancer: A Propensity-Matched TriNetX Study with Specialty-Stratified Analyses Luo Ci-Wen Conceptualization Methodology Validation Investigation Writing – original draft 1 2 † Chang Meng-Hao Conceptualization Methodology Validation Investigation 3 † Lin Lan Software Formal analysis Data curation Writing – review & editing 4 Lin Frank Cheau-Feng 5 6 Chen Shih-Wei Visualization 7 https://orcid.org/0000-0002-8991-6394 Kuan Yu-Hsiang Resources 8 9 Tsai Pei-Chi Validation Resources 8 9 10 Yu Ji-Kuen Conceptualization Validation Supervision 3 * https://orcid.org/0000-0003-2694-1207 Tsai Stella Chin-Shaw 7 11 12 * Spinelli Claudio Academic Editor Ghionzoli Marco Academic Editor 1 kkjj88440@gmail.com 2 3 gaborchang@gmail.com 4 18018@hosp.nycu.edu.tw 5 tpn@csmu.edu.tw 6 7 t7819@ms.sltung.com.tw 8 kuanyh@csmu.edu.tw 14614@ms3.sltung.com.tw 9 10 11 12 * jeromeiou@gmail.com tsaistella111@nchu.edu.tw † These authors contributed equally to this work. 18 9 2025 9 2025 17 18 497140 3051 17 8 2025 06 9 2025 17 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Thyroid cancer is the most common endocrine malignancy, and surgery is a key component of care when appropriate. In this study, we asked two practical questions: Do patients live longer when they undergo surgery, and do outcomes vary by the operating specialty (otolaryngology/ENT vs. general/endocrine surgery)? Using a large US electronic health record network (TriNetX), we created comparable groups of patients who did or did not undergo thyroidectomy and evaluated their long-term survival. Patients who had surgery lived longer than similar patients managed without surgery, with a 31.5% relative reduction in the hazard of death among the surgical patients. When we examined the outcomes by specialty, differences were observed; however, these analyses were exploratory and may reflect differences in tumor features, referral patterns, and surgeon or center experience that were not fully captured. These findings support timely surgery within multidisciplinary pathways and highlight the need for prospective studies to understand why outcomes may vary across specialties. Abstract Background/Objectives: Whether thyroidectomy confers a long-term survival advantage over non-surgical management in real-world practice remains uncertain. We primarily evaluated the association between surgery and all-cause mortality in thyroid cancer; specialty-stratified outcomes were prespecified as secondary, exploratory analyses. Methods: Using the TriNetX US Collaborative Network (2008–2024), we identified adults with thyroid cancer and created 1:1 propensity score-matched cohorts of patients who did or did not undergo thyroidectomy, balancing demographics, comorbidities, medications, and laboratory variables. Overall survival was assessed with Kaplan–Meier curves and Cox proportional hazard models. Among the surgical patients, we performed exploratory analyses stratified by operating specialty (otolaryngology–head and neck surgery (reference) vs. general/endocrine surgery and other/unknown, reported descriptively). Results: After matching, 49,219 patients were included per cohort. Thyroidectomy was associated with lower long-term mortality versus non-surgical care (adjusted HR 0.685, 95% CI 0.652–0.721). Among the surgical patients, secondary, exploratory specialty-stratified analyses suggested differences: compared with otolaryngology–head and neck surgery (ENT–HNS; reference), general/endocrine surgery (GS/ES) had a lower adjusted hazard of death (aHR 0.561, 95% CI 0.481–0.654), whereas other/unknown specialties had a higher adjusted hazard (aHR 1.583, 95% CI 1.302–1.924). These patterns are hypothesis-generating and may reflect residual confounding, including the tumor stage and histology, referral pathways, and surgeon or center experience. Conclusions: In a large, propensity-matched real-world cohort, surgery was linked to improved long-term survival regarding thyroid cancer. Observed specialty-related variation should be interpreted cautiously, and prospective studies incorporating tumor-level variables and provider/center characteristics are needed. Emphasis should remain on timely surgery within multidisciplinary care pathways. thyroidectomy surgical specialty general surgery otolaryngology survival analysis propensity score matching TriNetX endocrine oncology Tungs’ Taichung MetroHarbor Hospital TTMHH-R113006 This research was funded by Tungs’ Taichung MetroHarbor Hospital (grant number TTMHH-R113006). The funders had no role in the study design; data collection, analysis, or interpretation; manuscript writing; or decision to publish the results. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Thyroid cancer is the most prevalent endocrine malignancy, with a steadily increasing global incidence attributed to the widespread use of diagnostic imaging and heightened disease awareness [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Recent findings from nationwide datasets, including the Taiwan National Health Insurance Research Database, suggest that surgeries performed by general surgeons and otolaryngologists are associated with better survival outcomes than those performed by other specialties [ 15 To address this knowledge gap, we conducted a large, real-world, retrospective cohort study using the TriNetX US Collaborative Network, a federated health research database comprising over 100 healthcare organizations. We primarily compared long-term survival between thyroidectomy and non-surgical management; secondarily, we conducted exploratory specialty-stratified analyses (ENT, GS, others). Using robust propensity score matching and multivariate adjustment, this study aims to describe whether outcomes vary across operating specialties in exploratory analyses, recognizing the potential for residual confounding. While clinical emphasis should remain on timely surgery within multidisciplinary pathways, our findings could inform referral practices and institutional credentialing; whether specialty should be prioritized requires prospective validation. 2. Materials and Methods 2.1. Data Source and Study Population This retrospective cohort study utilized the TriNetX US Collaborative Network, a federated real-world data platform containing de-identified electronic health records (EHRs) from 105 healthcare organizations (HCOs) across the United States. Adults aged ≥20 years with a recorded diagnosis of malignant neoplasm of the thyroid gland (ICD-10-CM: C73) were eligible. The index date for both cohorts was defined as the date of the first inpatient encounter with a recorded C73 diagnosis. Surgical cohort: Patients with a qualifying thyroid cancer C73 diagnosis who underwent thyroidectomy for malignancy, identified using CPT codes (60240, 60252, 60254, 60260, 60270, 60271) and corresponding ICD-10-PCS or SNOMED codes (including total, subtotal, completion thyroidectomy, and relevant neck lymphatic dissection procedures). Non-surgical cohort (controls) comprised patients with a C73 diagnosis but without any thyroidectomy, completion thyroidectomy, neck dissection, laryngectomy, or tracheostomy procedure codes at any time. Patients were excluded if they had incomplete demographic data, a prior thyroidectomy before the index date, death recorded before or on the index date, or <12 months of available EHR data prior to the index date. Follow-up began 1 day after the index date and continued until death or the last recorded clinical encounter. 2.2. Exposure and Outcomes The exposure was the receipt of thyroid surgery. The primary outcome was all-cause mortality during follow-up (death recorded in the EHRs or linked mortality sources). Secondary analyses evaluated surgical-specialty-specific outcomes (otolaryngology [ENT], general surgery [GS], and others). Patients were followed from the index date until death or the last recorded clinical encounter. 2.3. Classification of Surgical Specialties The surgical specialty was determined using provider-level metadata in TriNetX at the index thyroidectomy encounter: ENT—providers labeled otolaryngology or otolaryngology–head and neck surgery; GS—providers labeled general surgery or endocrine surgery; others—all remaining specialties (e.g., thoracic, plastic, oncology). If a patient had multiple provider specialty labels in the same encounter, the main surgical specialty documented for the thyroidectomy was used. If conflict persisted, the surgeon’s specialty superseded the departmental labels [ 4 16 2.4. Covariates Baseline covariates included the demographics (age, sex, race/ethnicity), comorbidities (hypertension, diabetes, metabolic syndrome, bone density disorders, hypothyroidism, hyperthyroidism, breast cancer, vocal cord paralysis, hypoparathyroidism, cardiovascular disease), selected procedures (oral radiopharmaceutical therapy), medication use (levothyroxine, platinum agents, monoclonal antibodies, immunotherapies), and laboratory values (TSH, FT4, serum calcium, creatinine, eGFR, albumin, hemoglobin). Comorbidities were identified using ICD-10-CM codes within 12 months prior to the index; the laboratory values were the closest pre-index measurement. 2.5. Propensity Score Matching Propensity scores (PSs) were calculated using a logistic regression model that included all baseline covariates. One-to-one nearest-neighbor matching without replacement was performed with a caliper width of 0.2 × SD of the logit (PS). Covariate balance was assessed using standardized mean differences (SMDs); values < 0.1 indicated adequate balance. Before matching, the propensity score SMD was 0.248, indicating an imbalance. After matching, 49,219 patients were included in each cohort, and the PS SMD decreased to <0.02, where all baseline covariates achieved SMD < 0.1 ( Table 1 To evaluate the common support and matching quality, propensity score density plots were generated using TriNetX ( Figure 1 Figure 1 Figure 1 17 18 The proportion of patients within the caliper increased from 82% before matching to >99% after matching. These metrics and density functions align with recommended PS diagnostic procedures in observational studies [ 19 2.6. Subgroup The histologic subtype was abstracted from the site-contributed oncology registry or pathology-linked structured fields. Where available, International Classification of Diseases for Oncology, Third Edition (ICD-O-3) morphology codes were mapped into four prespecified categories: papillary, follicular, oncocytic (Hürthle cell), and medullary. When the ICD-O-3 morphology was unavailable, subtype assignments were cross-checked using ICD-10-CM thyroid cancer subtype codes and registry text fields via a prospectively defined crosswalk. The TNM components (T, N, M) and AJCC stage were captured from structured staging fields provided by participating sites. To align the staging with the treatment decision point, entries had to occur within −30 to +14 days of the index date. 2.7. Statistical Analysis Continuous variables are expressed as the mean ± SD and categorical variables as the count (%). Between-group comparisons before matching used Student’s t 2 p This study was approved by the Tungs’ Taichung MetroHarbor Hospital Institutional Review Board, where the ethical approval code is #113026. 3. Results 3.1. Baseline Characteristics After Matching After the 1:1 propensity score matching, 49,219 patients were included in both the thyroid surgery and control cohorts. The two groups were well-balanced across all the baseline characteristics, with standardized differences (Std diff.) less than 0.1 for all the variables ( Table 1 The mean age at index was similar between the groups (51.6 ± 15.1 vs. 51.8 ± 15.3 years, Std diff. = 0.01). Female patients accounted for approximately 74% in both groups. The racial and ethnic distributions were comparable, although the proportion of unknown race was slightly higher in the thyroid surgery group (7.7% vs. 6.2%, Std diff. = 0.061), yet still within an acceptable balance. The prevalences of comorbid conditions, including cardiovascular diseases (27.5% vs. 27.7%), osteoporosis (3.9% in both groups), hypothyroidism (11.2% vs. 11.1%), hyperthyroidism (3.3% vs. 3.1%), metabolic syndrome (0.3% in both), diabetes (9.4% vs. 9.5%), hypertension (21.1% vs. 21.4%), breast cancer (2.2% vs. 2.3%), and hypoparathyroidism (0.6% in both), showed no significant difference post-matching. Immune-related disorders and vocal cord paralysis were rare in both groups and remained balanced. Regarding the procedures, oral radiopharmaceutical therapy and intra-articular injections occurred in <1% of patients and showed minimal differences. Use of medications, including levothyroxine (22.4% vs. 22.9%), platinum compounds, monoclonal antibodies, and immunotherapies (e.g., pembrolizumab), was well-matched across the groups. Laboratory values were generally balanced, although small standardized differences were observed for TSH (Std diff. = 0.141), hemoglobin (0.157), serum albumin (0.133), and serum calcium (0.087), all of which were within the range of minor imbalance. Other parameters such as eGFR, free T4, and serum creatinine were well-matched (Std diff. < 0.1). These balances support the primary comparison of thyroidectomy versus non-surgical care in subsequent survival analyses. 3.2. Kaplan–Meier Survival Curves In this large-scale cohort study based on TrinetX with rigorous propensity score matching, patients who underwent thyroid surgery had a significantly improved overall survival compared with the matched controls without surgery. After the 1:1 PSM, 49,219 patients were included per cohort. Thyroidectomy was associated with lower long-term all-cause mortality compared with non-surgical care (adjusted HR 0.685, 95% CI 0.652–0.721), indicating a 31.5% relative reduction in the hazard of death among the surgical patients ( Figure 2 The propensity score matching was performed using multiple key baseline covariates, including age at index date, sex, race/ethnicity (White, Black or African American, Asian, Hispanic or Latino, other race), comorbidities (hypertension, diabetes mellitus, metabolic syndrome, disorders of bone density, hypothyroidism, hyperthyroidism, malignancy of breast, vocal cord paralysis, hypoparathyroidism), selected procedures, medications (e.g., levothyroxine, targeted therapies), and laboratory parameters (e.g., thyrotropin, free thyroxine, calcium, creatinine, albumin, hemoglobin). These findings underscore the potential survival benefit of thyroid surgery in appropriately selected patients and highlight the importance of controlling for multiple confounding factors through robust PSM. 3.3. Forest Plot Analysis Our adjusted hazard ratios (HRs) in Figure 3 Figure 4 3.4. Subgroup Hazard Ratios for All-Cause Mortality In the full cohort ( Figure 5 The findings were directionally consistent in the matched analyses. In the PSM cohort, the HRs were 0.61 (0.54–0.68) for T, 0.57 (0.51–0.65) for N, and 0.63 (0.55–0.72) for M. The stage-specific HRs were 0.69 (0.56–0.85) for stage I, 0.60 (0.45–0.81) for stage II, 0.70 (0.53–0.92) for stage III, and 0.55 (0.45–0.67) for stage IV; stage 0 was not estimable due to very low events. By histology, the HRs were 0.79 (0.67–0.94) for papillary and 0.41 (0.24–0.73) for follicular; oncocytic/Hürthle cell and medullary were not estimable in the matched sample. Overall, the magnitude and direction of effects in the PSM were similar to the full-cohort Cox estimates, supporting the association robustness. 4. Discussion This study presents a comprehensive analysis of thyroid surgery outcomes, leveraging real-world data to compare both surgical versus non-surgical management and the impact of surgical specialty (ENT vs. GS) on long-term survival. Our results suggest a significant survival advantage in the thyroid cancer patients that underwent thyroidectomy, with secondary, exploratory specialty-stratified analyses indicating differences ( Figure 3 These findings align with and expand upon previous studies, which often emphasized short-term complications or disease-specific endpoints but lacked long-term survival data stratified by surgeon specialty. For example, Konuthula et al. observed higher complication rates in ENT-performed total thyroidectomies, possibly reflecting complex case selection patterns rather than surgical skill alone [ 20 21 Although ENTs are anatomically specialized, our exploratory analyses observed lower adjusted hazards with GS; the case mix, surgeon/center volume, and institutional pathways could underlie this observation, as prior studies show that GSs tend to perform more standardized resections with potentially lower intraoperative variability [ 5 22 23 Beyond the specialty, our study adds to growing evidence supporting the survival benefit of thyroid surgery itself. Many earlier studies focused on short-term complications, such as hypocalcemia, recurrent laryngeal nerve injury, and infection [ 24 25 26 27 28 29 30 31 This supports recent discussions advocating for a more balanced approach to thyroid disease management. While guidelines increasingly support conservative management, especially for low-risk nodules or differentiated thyroid cancers [ 32 33 34 35 36 37 Our use of PSM improved the covariate balance and enhanced the internal validity of the associations but could not eliminate unmeasured confounders or establish causality. Unlike many prior retrospective analyses [ 38 39 40 41 42 43 Furthermore, our findings suggest that outcomes may vary by specialty and warrant investigation into underlying drivers, such as the case mix, volume, and institutional pathways. While ENT surgeons may handle more anatomically complex or oncologically challenging cases [ 20 21 22 23 7 44 45 The study may motivate evaluation of referral pathways; institutions may evaluate assignment patterns considering local volume and expertise, pathway adherence, and multidisciplinary coordination [ 5 28 46 47 48 Incomplete capture of the TNM stage and histology across sites may introduce residual confounding despite the use of predefined proxies and subgroup reporting. Misclassification of surgical specialty is possible due to the reliance on provider metadata, although sensitivity checks (e.g., cross-checking with procedure types, excluding low-volume providers) yielded directionally similar estimates. As with all observational studies, unmeasured confounding cannot be fully excluded. Additionally, surgeon-specific experience, volume, and institutional protocols may have influenced the outcomes but were not directly measurable. Nonetheless, the large matched cohort, national representativeness, and robust statistical approach strengthened the generalizability of our findings. 5. Conclusions In this large, propensity-matched, real-world cohort, thyroidectomy was associated with lower long-term all-cause mortality than non-surgical management. In secondary, exploratory specialty-stratified analyses, GS showed a lower adjusted hazard of death than ENT, whereas other specialties showed higher hazards; these observations are hypothesis-generating and may reflect residual confounding (e.g., unmeasured tumor stage and histologic risk), referral patterns, surgeon or center experience, and possible specialty misclassification. Overall, these findings support timely surgery within multidisciplinary pathways and may inform local referral and credentialing discussions, while prospective studies with tumor-level annotation and provider/center characteristics are needed to clarify causality and the extent of specialty-related variation. Acknowledgments The authors thank the Management Office for Health Data, China Medical University Hospital, for their statistical support. During the preparation of this manuscript, the authors used ChatGPT 5.0 to improve the readability and language. The authors have reviewed and edited the content and take full responsibility for the publication. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, C.-W.L., M.-H.C. and J.-K.Y.; methodology, C.-W.L., M.-H.C. and F.C.-F.L.; software, L.L.; validation, C.-W.L., M.-H.C. and J.-K.Y.; formal analysis, L.L.; investigation, C.-W.L. and M.-H.C.; resources, S.-W.C., Y.-H.K. and P.-C.T.; writing—original draft preparation, C.-W.L.; writing—review and editing, S.C.-S.T., F.C.-F.L. and L.L.; visualization, S.-W.C.; supervision, S.C.-S.T. and J.-K.Y.; project administration, S.C.-S.T.; funding acquisition, S.C.-S.T. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical approval was obtained from the Institutional Review Board (protocol code: IRB#113026, the date of approval is 3 May 2024). Informed Consent Statement Patient consent was waived due to the retrospective nature of the study and use of de-identified data from the TriNetX US Collaborative Network. Data Availability Statement The data that support the findings of this study are available from the TriNetX US Collaborative Network ( https://trinetx.com Conflicts of Interest The authors declare no conflicts of interest. References 1. Bilimoria K.Y. Bentrem D.J. Ko C.Y. Stewart A.K. Winchester D.P. Talamonti M.S. Sturgeon C. Extent of surgery affects survival for papillary thyroid cancer Ann. Surg. 2007 246 375 384 10.1097/SLA.0b013e31814697d9 17717441 PMC1959355 2. Fligor S.C. Lopez B. Uppal N. Lubitz C.C. James B.C. Time to Surgery and Thyroid Cancer Survival in the United States Ann. Surg. Oncol. 2021 28 3556 3565 10.1245/s10434-021-09797-z 33768394 3. Al-Qurayshi Z. Khadra H. Chang K. Pagedar N. Randolph G.W. Kandil E. Risk and survival of patients with medullary thyroid cancer: National perspective Oral Oncol. 2018 83 59 63 10.1016/j.oraloncology.2018.06.002 30098780 4. Stopenski S. Grigorian A. Roditi R. Jutric Z. Yamamoto M. Lekawa M. Nahmias J. Discrepancies in Thyroidectomy Outcomes Between General Surgeons and Otolaryngologists Indian J. Otolaryngol. Head Neck Surg. 2022 74 5384 5390 10.1007/s12070-021-02650-5 36742886 PMC9895566 5. Lorenz K. Raffaeli M. Barczynski M. Lorente-Poch L. Sancho J. Volume, outcomes, and quality standards in thyroid surgery: An evidence-based analysis-European Society of Endocrine Surgeons (ESES) positional statement Langenbeck’s Arch. Surg. 2020 405 401 425 10.1007/s00423-020-01907-x 32524467 PMC8275525 6. Ganly I. Nixon I.J. Wang L.Y. Palmer F.L. Migliacci J.C. Aniss A. Sywak M. Eskander A.E. Freeman J.L. Campbell M.J. Survival from Differentiated Thyroid Cancer: What Has Age Got to Do with It? Thyroid 2015 25 1106 1114 10.1089/thy.2015.0104 26148759 PMC4968282 7. Papaleontiou M. Gauger P.G. Haymart M.R. Referral of Older Thyroid Cancer Patients to a High-Volume Surgeon: Results of a Multidisciplinary Physician Survey Endocr. Pract. 2017 23 808 815 10.4158/EP171788.OR 28534681 PMC5649377 8. Limaiem F. Rehman A. Mazzoni T. Papillary Thyroid Carcinoma StatPearls Treasure Island, FL, USA 2025 30725628 9. Kaplan E. Angelos P. Applewhite M. Mercier F. Grogan R.H. Chapter 21 Surgery of the Thyroid Endotext Feingold K.R. Ahmed S.F. Anawalt B. Blackman M.R. Boyce A. Chrousos G. Corpas E. de Herder W.W. Dhatariya K. Dungan K. MDText.com, Inc. South Dartmouth, MA, USA 2000 10. Parham K. Chapurin N. Schulz K. Shin J.J. Pynnonen M.A. Witsell D.L. Langman A. Nguyen-Huynh A. Ryan S.E. Vambutas A. Thyroid Disease and Surgery in CHEER: The Nation’s Otolaryngology-Head and Neck Surgery Practice-Based Network Otolaryngol. Head Neck Surg. 2016 155 22 27 10.1177/0194599815627641 27371622 PMC5310574 11. McDow A.D. Saucke M.C. Marka N.A. Long K.L. Pitt S.C. Thyroid Lobectomy for Low-Risk Papillary Thyroid Cancer: A National Survey of Low- and High-Volume Surgeons Ann. Surg. Oncol. 2021 28 3568 3575 10.1245/s10434-021-09898-9 33939048 PMC11975426 12. Di Filippo L. Giugliano G. Tagliabue M. Gandini S. Sileo F. Allora A. Grosso E. Proh M. Basso V. Scaglione D. Total thyroidectomy versus lobectomy: Surgical approach to T1-T2 papillary thyroid cancer Acta Otorhinolaryngol. Ital. 2020 40 254 261 10.14639/0392-100X-N0608 33100336 PMC7586194 13. Adam M.A. Pura J. Gu L. Dinan M.A. Tyler D.S. Reed S.D. Scheri R. Roman S.A. Sosa J.A. Extent of surgery for papillary thyroid cancer is not associated with survival: An analysis of 61,775 patients Ann. Surg. 2014 260 601 607 601–607, discussion 605–607 10.1097/SLA.0000000000000925 25203876 PMC4532384 14. Jishu J.A. Hussein M.H. Sadakkadulla S. Baah S. Bashumeel Y.Y. Toraih E. Kandil E. Limited Thyroidectomy Achieves Equivalent Survival to Total Thyroidectomy for Early Localized Medullary Thyroid Cancer Cancers 2024 16 4062 10.3390/cancers16234062 39682246 PMC11640154 15. Chang C.M. Huang K.Y. Hsu T.W. Su Y.C. Yang W.Z. Chen T.C. Chou P. Lee C.C. Multivariate analyses to assess the effects of surgeon and hospital volume on cancer survival rates: A nationwide population-based study in Taiwan PLoS ONE 2012 7 e40590 10.1371/journal.pone.0040590 22815771 PMC3398946 16. Chung P.J. Lee M. Chang E.H. Ferzli G.S. Alfonso A.E. Chernichenko N. Sugiyama G. Does Specialty Matter? Analysis of Outcomes in Total Thyroidectomy for Goiters Between General Surgery and Otolaryngology Using American College of Surgeons NSQIP J. Am. Coll. Surg. 2017 225 S68 10.1016/j.jamcollsurg.2017.07.140 17. Stuart E.A. Matching methods for causal inference: A review and a look forward Stat. Sci. 2010 25 1 21 10.1214/09-STS313 20871802 PMC2943670 18. Austin P.C. An Introduction to Propensity Score Methods for Reducing the Effects of Confounding in Observational Studies Multivar. Behav. Res. 2011 46 399 424 10.1080/00273171.2011.568786 PMC3144483 21818162 19. Nassar M. Abosheaishaa H. Elfert K. Beran A. Ismail A. Mohamed M. Misra A. Essibayi M.A. Altschul D.J. Azzam A.Y. TriNetX and Real-World Evidence: A Critical Review of Its Strengths, Limitations, and Bias Considerations in Clinical Research ASIDE Intern. Med. 2025 1 24 33 10.71079/ASIDE.IM.03222516 40697879 PMC12282508 20. Brady J.S. Konuthula N. Lam A. Massa S. Rizvi Z.H. Risks Associated With Extent of Surgical Management for Benign, Non-Toxic Goiter Laryngoscope Investig. Otolaryngol. 2025 10 e70214 10.1002/lio2.70214 21. Ramos-Gonzalez G.J. Canas J.A. Green A. Chandler N.M. Snyder C.W. Predictors, Trends, and Outcomes of Parathyroid Autotransplantation in Pediatric Total Thyroidectomy J. Surg. Res. 2025 306 26 32 10.1016/j.jss.2024.12.023 39742655 22. Pace-Asciak P. Tufano R.P. Editorial: Recent advances in thermal and nonthermal ablative technologies of the thyroid Front. Endocrinol. 2025 16 1601452 10.3389/fendo.2025.1601452 PMC12058472 40343068 23. Al-Qahtani K. Al Shahrani M. Al Zahrani F. Al Ghamdi A. Al Alghamdi F. Al Alshaalan Z. Al-Saif A. Bokhari A. Al-Abdulkarim A.A. Islam T. Comparing Thyroidectomy Techniques, Surgical Loupe and Neuromonitoring Between ENT and Endocrine Surgeons—An Observational Study Indian J. Otolaryngol. Head Neck Surg. 2023 75 1618 1624 10.1007/s12070-023-03627-2 37636681 PMC10447852 24. Rosato L. Avenia N. Bernante P. De Palma M. Gulino G. Nasi P.G. Pelizzo M.R. Pezzullo L. Complications of thyroid surgery: Analysis of a multicentric study on 14,934 patients operated on in Italy over 5 years World J. Surg. 2004 28 271 276 10.1007/s00268-003-6903-1 14961204 25. Bergenfelz A. Jansson S. Kristoffersson A. Martensson H. Reihner E. Wallin G. Lausen I. Complications to thyroid surgery: Results as reported in a database from a multicenter audit comprising 3,660 patients Langenbeck’s Arch. Surg. 2008 393 667 673 10.1007/s00423-008-0366-7 18633639 26. Christou N. Mathonnet M. Complications after total thyroidectomy J. Visc. Surg. 2013 150 249 256 10.1016/j.jviscsurg.2013.04.003 23746996 27. Sosa J.A. Bowman H.M. Tielsch J.M. Powe N.R. Gordon T.A. Udelsman R. The importance of surgeon experience for clinical and economic outcomes from thyroidectomy Ann. Surg. 1998 228 320 330 10.1097/00000658-199809000-00005 9742915 PMC1191485 28. Adam M.A. Thomas S. Youngwirth L. Hyslop T. Reed S.D. Scheri R.P. Roman S.A. Sosa J.A. Is There a Minimum Number of Thyroidectomies a Surgeon Should Perform to Optimize Patient Outcomes? Ann. Surg. 2017 265 402 407 10.1097/SLA.0000000000001688 28059969 29. Haymart M.R. Banerjee M. Stewart A.K. Koenig R.J. Birkmeyer J.D. Griggs J.J. Use of radioactive iodine for thyroid cancer JAMA 2011 306 721 728 10.1001/jama.2011.1139 21846853 PMC3352591 30. Pradhan R. Gupta S. Agarwal A. Focused Parathyroidectomy Using Accurate Preoperative Imaging and Intraoperative PTH: Tertiary Care Experience Indian J. Endocrinol. Metab. 2019 23 347 352 10.4103/ijem.IJEM_20_19 31641637 PMC6683698 31. Mirallie E. Borel F. Tresallet C. Hamy A. Mathonnet M. Lifante J.C. Brunaud L. Menegaux F. Hardouin J.B. Blanchard C. Impact of total thyroidectomy on quality of life at 6 months: The prospective ThyrQoL multicentre trial Eur. J. Endocrinol. 2020 182 195 205 10.1530/EJE-19-0587 31804967 32. Haugen B.R. Alexander E.K. Bible K.C. Doherty G.M. Mandel S.J. Nikiforov Y.E. Pacini F. Randolph G.W. Sawka A.M. Schlumberger M. 2015 American Thyroid Association Management Guidelines for Adult Patients with Thyroid Nodules and Differentiated Thyroid Cancer: The American Thyroid Association Guidelines Task Force on Thyroid Nodules and Differentiated Thyroid Cancer Thyroid 2016 26 1 133 10.1089/thy.2015.0020 26462967 PMC4739132 33. Xue S. Wang P. Hurst Z.A. Chang Y.S. Chen G. Active Surveillance for Papillary Thyroid Microcarcinoma: Challenges and Prospects Front. Endocrinol. 2018 9 736 10.3389/fendo.2018.00736 PMC6302022 30619082 34. Ito Y. Miyauchi A. Kihara M. Higashiyama T. Kobayashi K. Miya A. Patient age is significantly related to the progression of papillary microcarcinoma of the thyroid under observation Thyroid 2014 24 27 34 10.1089/thy.2013.0367 24001104 PMC3887422 35. Shan C.X. Zhang W. Jiang D.Z. Zheng X.M. Liu S. Qiu M. Routine central neck dissection in differentiated thyroid carcinoma: A systematic review and meta-analysis Laryngoscope 2012 122 797 804 10.1002/lary.22162 22294492 36. Nixon I.J. Ganly I. Shah J.P. Thyroid cancer: Surgery for the primary tumor Oral Oncol. 2013 49 654 658 10.1016/j.oraloncology.2013.03.439 23623837 37. Filetti S. Durante C. Hartl D. Leboulleux S. Locati L.D. Newbold K. Papotti M.G. Berruti A. The ESMO Guidelines Committee Thyroid cancer: ESMO Clinical Practice Guidelines for diagnosis, treatment and follow-updagger Ann. Oncol. 2019 30 1856 1883 10.1093/annonc/mdz400 31549998 38. Dionigi G. Boni L. Rovera F. Bacuzzi A. Dionigi R. Neuromonitoring and video-assisted thyroidectomy: A prospective, randomized case-control evaluation Surg. Endosc. 2009 23 996 1003 10.1007/s00464-008-0098-3 18806939 39. Peyser Cardoso R. Agarwal L. Cardoso S.A. Agarwal A. Varshney V. Soni S. Selvakumar B. Varshney P. Impact of intraoperative recurrent laryngeal nerve monitoring on minimally invasive esophagectomy outcomes for esophageal cancer: A meta-analysis of case-control studies Dis. Esophagus 2025 38 doae116 10.1093/dote/doae116 39696964 40. Bedi H.K. Jedrzejko N. Nguyen A. Aspinall S.R. Wiseman S.M. Thyroid and parathyroid surgeon case volume influences patient outcomes: A systematic review Surg. Oncol. 2021 38 101550 10.1016/j.suronc.2021.101550 33915486 41. Gray W.K. Aspinall S. Tolley N. Day J. Lansdown M. The volume and outcome relationship for thyroidectomy in England Langenbeck’s Arch. Surg. 2021 406 1999 2010 10.1007/s00423-021-02223-8 34106320 PMC8188540 42. Hauch A. Al-Qurayshi Z. Randolph G. Kandil E. Total thyroidectomy is associated with increased risk of complications for low- and high-volume surgeons Ann. Surg. Oncol. 2014 21 3844 3852 10.1245/s10434-014-3846-8 24943236 43. Gorbea E. Goldrich D.Y. Agarwal J. Nayak R. Iloreta A.M. The impact of surgeon volume on total thyroidectomy outcomes among otolaryngologists Am. J. Otolaryngol. 2020 41 102726 10.1016/j.amjoto.2020.102726 32979668 44. Patel K.N. Yip L. Lubitz C.C. Grubbs E.G. Miller B.S. Shen W. Angelos P. Chen H. Doherty G.M. Fahey T.J. 3rd The American Association of Endocrine Surgeons Guidelines for the Definitive Surgical Management of Thyroid Disease in Adults Ann. Surg. 2020 271 e21 e93 10.1097/SLA.0000000000003580 32079830 45. Diez J.J. Galofre J.C. Thyroid Cancer Patients’ View of Clinician Professionalism and Multidisciplinary Approach to Their Management J. Multidiscip. Healthc. 2021 14 1053 1061 10.2147/JMDH.S309953 33994791 PMC8114825 46. Kelley S. Beck A.C. Weigel R.J. Howe J.R. Sugg S.L. Lal G. Influence of endocrine multidisciplinary tumor board on patient management and treatment decision making Am. J. Surg. 2022 223 76 80 10.1016/j.amjsurg.2021.07.013 34303521 47. Alansari A.N. Zaazouee M.S. Najar S. Elshanbary A.A. Quality-of-Life Outcomes Following Thyroid Surgery in Pediatric Patients: A Systematic Review of Physical, Emotional, and Social Dimensions Children 2025 12 891 10.3390/children12070891 40723084 PMC12293235 48. Sherman S.I. Thyroid carcinoma Lancet 2003 361 501 511 10.1016/S0140-6736(03)12488-9 12583960 Figure 1 Propensity score density functions before and after matching. Distribution of propensity scores for the thyroid surgery (purple) and control (green) cohorts before matching ( left right Figure 2 Kaplan–Meier survival curves comparing case patients that underwent thyroid surgery and matched controls without thyroid surgery after propensity score matching (PSM). After the PSM, each group included 49,219 patients. The case group demonstrated a significantly higher survival probability during the follow-up period. The log-rank test indicated a significant difference between the two groups (χ 2 p Figure 3 Adjusted hazard ratios (HRs) for overall survival among the patients that underwent thyroid surgery by surgical specialty group. The forest plot depicts HRs derived from a multivariate Cox proportional hazards model that compared general surgery (GS) and other specialties (others) with otolaryngology (ENT) as the reference group. Squares indicate point estimates of HRs, and horizontal lines represent 95% confidence intervals. Figure 4 Pairwise propensity score-matched hazard ratios (HRs) for overall survival among patients that underwent thyroid surgery by surgical specialty group. Forest plot illustrating hazard ratios (HRs) and 95% confidence intervals (CIs) for overall survival derived from pairwise propensity score-matched analyses that compared different surgical specialty groups. Compared with the ENT group, the GS group showed a significantly lower risk (HR = 0.561; 95% CI: 0.481–0.654), whereas the others group exhibited a higher risk (HR = 1.583; 95% CI: 1.302–1.924). Figure 5 Subgroup hazard ratios for all-cause mortality comparing thyroidectomy vs. non-thyroid surgery. Black squares denote adjusted hazard ratios (HRs) from the multivariable Cox model in the full cohort; black circles denote HRs from the 1:1 propensity score-matched (PSM) cohort. Horizontal bars show 95% confidence intervals on a log scale; the vertical dashed line marks HR = 1. Subgroups are ordered as TNM components (T, N, M), AJCC stage (S0–S4), and histology (papillary, follicular, oncocytic [Hürthle cell], medullary). Labels include the number of patients that underwent the surgery and control groups for each row. For matched strata with non-estimable effects due to zero or very few events, NE is shown at the corresponding Cox HR to facilitate a visual comparison. Values < 1 favor thyroidectomy. cancers-17-03051-t001_Table 1 Table 1 Basic characteristics before propensity score matching.  Thyroid Surgery Control p Std Diff.  (N = 49,219) (N = 49,219)  Patients % Patients % Demographics Age at index (Mean ± SD) 51.6 ± 15.1 51.8 ± 15.3 0.125 0.01 Female 36,507 74.20% 36,430 74.00% 0.575 0.004 Male 12,712 25.80% 12,789 26.00% 0.575 0.004 Race White 28,906 58.70% 29,502 59.90% <0.001 0.025 Black or African American 3224 6.60% 3169 6.40% 0.477 0.005 Asian 3591 7.30% 3683 7.50% 0.262 0.007 Unknown race 3791 7.70% 3030 6.20% <0.001 0.061 Ethnicity Hispanic or Latino 3291 6.70% 3317 6.70% 0.741 0.002 Not Hispanic or Latino 27,523 55.90% 27,528 55.90% 0.974 <0.001 Unknown ethnicity 18,405 37.40% 18,374 37.30% 0.838 0.001 Diagnosis Cardiovascular diseases 13,516 27.50% 13,654 27.70% 0.325 0.006 Osteoporosis or bone disorders 1902 3.90% 1911 3.90% 0.882 0.001 Hypothyroidism 5493 11.20% 5463 11.10% 0.761 0.002 Hyperthyroidism 1600 3.30% 1536 3.10% 0.245 0.007 Metabolic syndrome 143 0.30% 142 0.30% 0.953 <0.001 Diabetes 4649 9.40% 4697 9.50% 0.602 0.003 Immune-related disorders 49 0.10% 52 0.10% 0.765 0.002 Hypertension 10,397 21.10% 10,555 21.40% 0.219 0.008 Breast cancer 1102 2.20% 1128 2.30% 0.578 0.004 Vocal cord paralysis 740 1.50% 708 1.40% 0.397 0.005 Hypoparathyroidism 304 0.60% 282 0.60% 0.362 0.006 Procedure Oral radiopharmaceutical therapy 278 0.60% 276 0.60% 0.932 0.001 Intra-articular injection (percutaneous) 20 0.00% 18 0.00% 0.746 0.002 Medication Levothyroxine 11,030 22.40% 11,284 22.90% 0.053 0.012 Sorafenib 10 0.00% 14 0.00% 0.414 0.005 Cabozantinib 10 0.00% 12 0.00% 0.670 0.003 Vandetanib 10 0.00% 10 0.00% 1.000 <0.001 Platinum compounds 279 0.60% 273 0.60% 0.798 0.002 Monoclonal antibodies 332 0.70% 345 0.70% 0.616 0.003 Methylhydrazines 10 0.00% 10 0.00% 1.000 <0.001 Pembrolizumab 67 0.10% 71 0.10% 0.733 0.002 Laboratory (Mean ± SD) TSH (thyroid stimulating hormone) 4.2 ± 24.2 8.3 ± 33.3 <0.001 0.141 Free T4 (free thyroxine) 1.3 ± 0.8 1.3 ± 0.7 <0.001 0.074 Serum calcium 9.3 ± 0.8 9.2 ± 0.9 <0.001 0.087 Serum creatinine 1.0 ± 2.0 1.0 ± 2.2 0.109 0.015 eGFR (estimated GFR, MDRD) 83.2 ± 26.6 82.2 ± 29.2 <0.001 0.036 Serum albumin 4.1 ± 0.5 4.1 ± 0.5 <0.001 0.133 Hemoglobin 13.2 ± 1.8 13.0 ± 1.9 <0.001 0.157 Continuous variables are expressed as mean ± standard deviation (SD), and categorical variables as number and percentage. Comparisons between groups were conducted using Student’s t ",
  "metadata": {
    "Title of this paper": "Thyroid carcinoma",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468916/"
  }
}