{
  "title": "Paper_1193",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467112 PMC12467112.1 12467112 12467112 41007747 10.3390/biomedicines13092184 biomedicines-13-02184 1 Article Association Between the Renin–Angiotensin System and Ibrutinib-Related Cardiovascular Adverse Events: A Translational Cohort Study https://orcid.org/0000-0002-3103-9739 Font Jonaz Methodology Formal analysis Writing – original draft Visualization 1 2 https://orcid.org/0000-0001-8099-0654 Hodzic Amir Investigation Writing – original draft 3 4 Da-Silva Angélique Conceptualization Writing – original draft 1 5 Delapierre Baptiste Resources Writing – original draft 6 Damaj Ghandi Resources Writing – original draft 6 Neusy Anne Investigation 1 2 Plane Anne-Flore Writing – original draft 7 https://orcid.org/0000-0002-2297-4418 Legallois Damien Investigation 1 7 Milliez Paul Writing – original draft 2 8 https://orcid.org/0000-0003-0449-6261 Dolladille Charles Methodology 1 9 https://orcid.org/0000-0002-0953-6819 Vernon Mégane Investigation Resources Data curation 10 11 Burton Sarah Investigation Resources Data curation 10 11 Vigneron Nicolas Resources Data curation 10 12 https://orcid.org/0000-0001-7153-8826 Denoyelle Christophe Investigation Resources Data curation Writing – original draft 10 11 https://orcid.org/0000-0002-9197-8404 Alexandre Joachim Conceptualization Methodology Resources Writing – original draft Supervision Project administration Funding acquisition 1 9 * Dézsi László Academic Editor Szekeres Mária Academic Editor Nádasy György L. Academic Editor 1 jnzfnt@gmail.com dasilva-a@chu-caen.fr anne.neusy@orange.fr damien.legallois@unicaen.fr charles.dolladille@unicaen.fr 2 paul-ursmar.milliez@unicaen.fr 3 amir.hodzic@unicaen.fr 4 5 6 delapierre-ba@chu-caen.fr damaj-gl@chu-caen.fr 7 plane-af@chu-caen.fr 8 9 10 m.vernon-contentin@baclesse.unicancer.fr sarah.burton@unicaen.fr n.vigneron@baclesse.unicancer.fr christophe.denoyelle@unicaen.fr 11 12 * joachim.alexandre@unicaen.fr 06 9 2025 9 2025 13 9 497614 2184 04 6 2025 21 8 2025 28 8 2025 06 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods NCT03678337 p Results: p p Conclusions ibrutinib atrial fibrillation hypertension heart failure B-cell malignancies renin–angiotensin system Caen-Normandy University Hospital INSERM U1086 ANTICIPE This study received two internal grants from both the Caen-Normandy University Hospital and the INSERM U1086 ANTICIPE. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Ibrutinib, a Bruton’s tyrosine kinase inhibitor (BTKi), is approved for the treatment of B-cell malignancies [ 1 2 Nevertheless, it is now well-known that ibrutinib is associated with an increased risk of several cardiovascular adverse events (CVAEs), including atrial fibrillation (AF), new or worsening arterial hypertension (HTN), new or worsening heart failure (HF), and ventricular arrhythmia (VA) [ 3 4 p p 5 Although ibrutinib-related CVAEs are now encountered daily in clinical practice, predictive factors are not known; thus, no predictive score exists to predict CVAEs in the ibrutinib-exposed population. ESC cardio-oncology guidelines recommend the evaluation of every patient with a cardio-oncologic examination before BTKi initiation to stratify the baseline risk of developing cardiovascular toxicity [ 3 6 In the context of ibrutinib-related CVAEs, early identification of patients at risk is essential. The aim of this study was therefore to assess baseline clinical, echocardiographic, and biological characteristics associated with the development of CVAEs in a prospective, single-center cohort of patients treated with ibrutinib for B-cell malignancies. 2. Materials and Methods 2.1. Study Protocol and Population This study was nested within the PICARO cohort ( NCT03678337 7 8 All patients underwent a baseline cardio-oncology evaluation before or within 1 month after the introduction of ibrutinib according to the ESC cardio-oncology guidelines including a careful clinical history and physical examination, a 12-lead ECG, a blood examination including cardiac biomarkers, and a standard transthoracic echocardiography [ 3 g 2.2. Measurement of Levels of Plasma Protein Biomarkers by ELISA Commercially available enzyme-linked immunosorbent assays (ELISAs) were utilized to quantify the levels of C reactive protein (CRP) (R&D Systems, Abingdon, UK), Galectin-3 (R&D Systems), Myeloperoxydase (R&D Systems), renin (R&D Systems), aldosterone (ThermoFisher Scientific, Illkirch-Graffenstaden, France), Tumor Necrosis Factor alpha (TNF-α) (R&D Systems), interleukin (IL-6) (R&D Systems), angiotensin converting enzyme 2 (ACE-2) (ThermoFisher Scientific), and troponin (Abcam, Cambridge, UK) according to the manufacturer’s instruction. For routine analyses (serum electrolytes, creatinine…), commercially available kits were used. 2.3. Measurement of Expression of Serum microRNAs (miRNAs) by RT-qPCR We selected six microRNAs (miR-9, miR-99, miR-199, miR-328, miR-22, and miR-150-5p) that have previously been associated with CVAEs or with cardiovascular disease in populations other than patients treated with ibrutinib [ 9 10 11 12 13 14 15 ® ® 5 4 3 2 1 16 2.4. Follow-Up 2.4.1. Blood Pressure Monitoring Blood pressure was measured every 6 months during the systematic consultation and out-of-the-office measurement was conducted systematically every week by the patient themselves during the follow-up. 2.4.2. ECG Monitoring A 10-s 12-lead ECG was carried out during every semestrial consultation. Out-of-the-office 5-day ECG monitoring was systematically carried out every 6 months during the follow-up. 2.4.3. Echocardiography Echocardiography was systematically performed every year during the follow-up. The echocardiographic assessment of left ventricular (LV) and left atrial (LA) functions was performed in accordance with current guidelines, using a commercially available echocardiographic system (Epiq 7 equipped with an X5-1 xMATRIX-array transducer, Philips, Netherlands, Amsterdam) [ 17 17 2 2 18 19 19 20 2.5. Primary Objective and Analysis The primary objective of this study was to investigate the association between baseline patient characteristics (demographics, clinical, circulating biomarkers expression, echocardiography parameters) and CVAEs occurrence from ibrutinib introduction to 31 May 2023, the end of follow-up. CVAEs outcome was a composite of AF, new or worsening HTN, new or worsening HF, and ventricular arrhythmias [ 3 21 22 23 24 2.6. Secondary Objectives and Analyses Each of the components of the primary outcome was described as well as death from any cause and B-cell malignancy progression during follow-up. Time to CVAE onset and severity by Common Terminology Criteria for Adverse Events (CTCAE) of CVAEs were described. Description of treatment adjustments, involving ACE inhibitors, ARBs, and anticoagulant therapies, were described. 2.7. Statistical Analyses A descriptive analysis of the cohort study was performed on the available data. Quantitative variables were expressed as median and interquartile range. Qualitative variables were expressed in effectives and percentages. Comparative analyses were performed between patients with and without CVAE occurrence during follow-up. The biological variables were dichotomized using the threshold that maximized Youden’s index, identifying the value with the greatest discriminative ability between groups ( Table S1 16 p 3. Results 3.1. The Study Population From 6 December 2018 to 12 March 2021, a total of 25 consecutive patients referred for a baseline cardio-oncological evaluation were included before or within 1 month after the introduction of ibrutinib for B-cell malignancy. The median follow-up was 672 days (588–738) and nine patients stopped ibrutinib for non-cardiovascular causes during this follow-up. Baseline characteristics of the included patients are presented in Table 1 3.2. Primary Objective During the follow-up, nine CVAEs occurred in 7 of the 25 patients. Among the 9 CVAEs observed, there were two cases of new-onset HTN and four cases of worsening HTN, along with two cases of new-onset AF and one recurrence of AF. No new or worsening HF or VA was reported. The characteristics of the patients at baseline according to CVAEs occurrence are presented in Table 1 2 p p p Figure 1 Table 1 The survival analysis with Kaplan–Meier curves and log-rank test confirms the association between baseline HTN, baseline plasmatic renin level, and baseline plasmatic miR-150-5p level and CVAEs occurrence with respective p Figure 2 All VIF values were below 5, specifically 1.262, 1.262, and 1.000, respectively for baseline HTN, baseline plasmatic renin level, and baseline plasmatic miR-150-5p level. 3.3. Secondary Objectives During the follow-up, five patients experienced B-cell malignancy progression and five patients died from non-cardiovascular causes. Among the 9 CVAEs, only one AF event was classified as severe with a CTCAE = 3 ( Figure 3 Among patients who experienced one or more CVAEs, direct oral anticoagulants were initiated in three patients for atrial fibrillation, and an ACE inhibitor was initiated in one patient. In the group without CVAEs, a direct oral anticoagulant was initiated in one patient for an indication other than atrial fibrillation, and the ACE inhibitor dosage was reduced in one patient. 4. Discussion Ibrutinib, a first-in-class irreversible oral inhibitor of BTK, has proven highly effective in B-cell malignancies [ 2 25 6 26 27 In this prospective cohort, although monocentric and including a small number of patients, we systematically assessed a large number of baseline patient characteristics including demographic, clinical, biological, and echocardiographic parameters. Particularly, we designed a large panel of biological variables to study inflammation, fibrosis, and neurohormonal pathways, which represent major signaling pathways in the development of HTN, AF, and HF [ 28 29 30 31 32 33 34 35 p 36 22 23 37 38 38 There are several reasons to believe that aldosterone and the activation of its receptor, MR, might play an important role in the underlying pathophysiology of ibrutinib-related CVAEs occurrence [ 39 40 41 42 Figure 4 43 44 43 45 46 47 Our analysis highlighted that baseline plasmatic miR-150-5p was significantly lower in patients who experienced ibrutinib-related CVAEs. MiRNAs are small non-coding RNAs involved in genetic expression regulation at a post-transcriptional level [ 48 10 p 10 49 In previous published studies, the age and history of CV diseases or the presence of CV risk factors were associated with ibrutinib-related CVAEs [ 6 26 27 2 6 p p 26 5. Study Limitations The main limitation of this study is the small size of the cohort, which implies low statistical power and not enough events to undertake multivariate analysis. Indeed, our results are not adjusted on potential confounding factors. Furthermore, biological parameters were assessed only at baseline prior to ibrutinib initiation, as follow-up samples were not available. Additionally, the absence of cardiac tissue precluded direct measurement of CSK activity, limiting our ability to strengthen the evidence supporting the involvement of the CSK–Src–aldosterone–mineralocorticoid receptor axis in the pathophysiology of ibrutinib-related CVAEs. Moreover, baseline use of angiotensin-receptor blockers (ARBs) and ACE inhibitors can clearly influence plasma concentrations of renin and aldosterone. Therefore, these results should be interpreted with caution. This study has great potential to be prospective but this is a monocentric study, which can bias the external validity. Indeed, every patient included in this study is followed in our cardio-oncology program, which allows for specialized management of the specificities of these patients suffering from hematologic malignancies and at risk of CVAEs. 6. Conclusions In this small prospective and monocentric cohort of 25 patients exposed to ibrutinib for B-cell malignancy, 7 patients experienced 9 CVAEs during a median follow-up of 672 days. The CSK–Src–aldosterone–mineralocorticoid receptor axis may represent a potential pathway involved in the development of ibrutinib-related CVAEs, although this remains to be further explored. Furthermore, history of HTN and miR-150-5p levels at baseline were univariably associated with CVAEs occurrence. These results need to be confirmed in larger multicenter cohort studies. Acknowledgments Authors thank CRB Innova BIO for the packaging and storage of the biologic samples. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/biomedicines13092184/s1 Author Contributions Conceptualization, J.A. and C.D. (Christophe Denoyelle); methodology, J.F., C.D. (Charles Dolladille), J.A. and C.D. (Christophe Denoyelle); software, J.F. and N.V.; validation, J.A., J.F. and C.D. (Christophe Denoyelle); formal analysis, J.F.; investigation, A.H., S.B., M.V. and J.F.; resources, J.A., A.H. and C.D. (Christophe Denoyelle); data curation, J.F.; writing—original draft preparation, J.F. and J.A.; writing—review and editing, C.D. (Christophe Denoyelle), A.H., P.M., A.N., A.-F.P., A.D.-S., B.D., G.D. and D.L.; visualization, J.F.; supervision, J.A.; project administration, J.A.; funding acquisition, J.A. and C.D. (Christophe Denoyelle). All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical approval for this study was granted on 13 June 2018 by the Comité de Protection des Personnes Nord-Ouest IV, Lille, France (No. 2018-A00429-46), in accordance with the principles of the Declaration of Helsinki. Informed Consent Statement Written informed consent was obtained from all participants. Data Availability Statement Data are available for academic purposes upon reasonable request. Conflicts of Interest Prof. Alexandre reports honoraria for presentations and consulting fees from Biotronik, Bioserenity, Amgen, BMS, Pfizer, Boerhinger, Bayer, Astra Zeneca, Janssen, Servier, and Novartis, outside of the submitted work. Dr. Legallois reports honoraria for presentations and consulting fees from Astrazeneca, Boehringer Ingelheim, Lilly, Pfizer, and Takeda, outside of the submitted work. Dr. Dolladille reports honoraria for presentations and consulting fees from Bioserenity and Pfizer, outside of the submitted work. The remaining authors have nothing to disclose. References 1. Hallek M. Cheson B.D. Catovsky D. Caligaris-Cappio F. Dighiero G. Döhner H. Hillmen P. Keating M. Montserrat E. Chiorazzi N. iwCLL Guidelines for Diagnosis, Indications for Treatment, Response Assessment, and Supportive Management of CLL Blood 2018 131 2745 2760 10.1182/blood-2017-09-806398 29540348 2. Burger J.A. Tedeschi A. Barr P.M. Robak T. Owen C. Ghia P. Bairey O. Hillmen P. Bartlett N.L. Li J. Ibrutinib as Initial Therapy for Patients with Chronic Lymphocytic Leukemia N. Engl. J. Med. 2015 373 2425 2437 10.1056/NEJMoa1509388 26639149 PMC4722809 3. Lyon A.R. López-Fernández T. Couch L.S. Asteggiano R. Aznar M.C. Bergler-Klein J. Boriani G. Cardinale D. Cordoba R. Cosyns B. 2022 ESC Guidelines on Cardio-Oncology Developed in Collaboration with the European Hematology Association (EHA), the European Society for Therapeutic Radiology and Oncology (ESTRO) and the International Cardio-Oncology Society (IC-OS): Developed by the Task Force on Cardio-Oncology of the European Society of Cardiology (ESC) Eur. Heart J. 2022 43 ehac244 10.1093/eurheartj/ehac244 36017568 4. Caldeira D. Alves D. Costa J. Ferreira J.J. Pinto F.J. Ibrutinib Increases the Risk of Hypertension and Atrial Fibrillation: Systematic Review and Meta-Analysis PLoS ONE 2019 14 e0211228 10.1371/journal.pone.0211228 30785921 PMC6382095 5. Archibald W.J. Rabe K.G. Kabat B.F. Herrmann J. Ding W. Kay N.E. Kenderian S.S. Muchtar E. Leis J.F. Wang Y. Atrial Fibrillation in Patients with Chronic Lymphocytic Leukemia (CLL) Treated with Ibrutinib: Risk Prediction, Management, and Clinical Outcomes Ann. Hematol. 2021 100 143 155 10.1007/s00277-020-04094-3 32488603 PMC8772341 6. Baptiste F. Cautela J. Ancedy Y. Resseguier N. Aurran T. Farnault L. Escudier M. Ammar C. Gaubert M. Dolladille C. High Incidence of Atrial Fibrillation in Patients Treated with Ibrutinib Open Heart 2019 6 e001049 10.1136/openhrt-2019-001049 31168393 PMC6519413 7. Agnelli G. Becattini C. Meyer G. Muñoz A. Huisman M.V. Connors J.M. Cohen A. Bauersachs R. Brenner B. Torbicki A. Apixaban for the Treatment of Venous Thromboembolism Associated with Cancer N. Engl. J. Med. 2020 382 1599 1607 10.1056/NEJMoa1915103 32223112 8. von Elm E. Altman D.G. Egger M. Pocock S.J. Gøtzsche P.C. Vandenbroucke J.P. STROBE Initiative Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) Statement: Guidelines for Reporting Observational Studies BMJ 2007 335 806 808 10.1136/bmj.39335.541782.AD 17947786 PMC2034723 9. Shen N.-N. Zhang C. Li Z. Kong L.-C. Wang X.-H. Gu Z.-C. Wang J.-L. MicroRNA Expression Signatures of Atrial Fibrillation: The Critical Systematic Review and Bioinformatics Analysis Exp. Biol. Med. 2020 245 42 53 10.1177/1535370219890303 31766887 PMC6987745 10. McManus D.D. Tanriverdi K. Lin H. Esa N. Kinno M. Mandapati D. Tam S. Okike O.N. Ellinor P.T. Keaney J.F. Plasma microRNAs Are Associated with Atrial Fibrillation and Change after Catheter Ablation (the miRhythm Study) Heart Rhythm 2015 12 3 10 10.1016/j.hrthm.2014.09.050 25257092 PMC4277933 11. Ramasamy S. Velmurugan G. Rekha B. Anusha S. Shanmugha Rajan K. Shanmugarajan S. Ramprasath T. Gopal P. Tomar D. Karthik K.V. Egr-1 Mediated Cardiac miR-99 Family Expression Diverges Physiological Hypertrophy from Pathological Hypertrophy Exp. Cell Res. 2018 365 46 56 10.1016/j.yexcr.2018.02.016 29481791 12. Wiedmann F. Kraft M. Kallenberger S. Büscher A. Paasche A. Blochberger P.L. Seeger T. Jávorszky N. Warnecke G. Arif R. MicroRNAs Regulate TASK-1 and Are Linked to Myocardial Dilatation in Atrial Fibrillation J. Am. Heart Assoc. 2022 11 e023472 10.1161/JAHA.121.023472 35301863 PMC9075420 13. Kura B. Szeiffova Bacova B. Kalocayova B. Sykora M. Slezak J. Oxidative Stress-Responsive MicroRNAs in Heart Injury Int. J. Mol. Sci. 2020 21 358 10.3390/ijms21010358 31948131 PMC6981696 14. Huang H. Chen H. Liang X. Chen X. Chen X. Chen C. Upregulated miR-328-3p and Its High Risk in Atrial Fibrillation: A Systematic Review and Meta-Analysis with Meta-Regression Medicine 2022 101 e28980 10.1097/MD.0000000000028980 35244069 PMC8896476 15. Vigneron N. Meryet-Figuière M. Guttin A. Issartel J.-P. Lambert B. Briand M. Louis M.-H. Vernon M. Lebailly P. Lecluse Y. Towards a New Standardized Method for Circulating miRNAs Profiling in Clinical Studies: Interest of the Exogenous Normalization to Improve miRNA Signature Accuracy Mol. Oncol. 2016 10 981 992 10.1016/j.molonc.2016.03.005 27083764 PMC5423189 16. Vigneron N. Vernon M. Meryet-Figuière M. Lambert B. Briand M. Louis M.-H. Krieger S. Joly F. Lheureux S. Blanc-Fournier C. Predictive Relevance of Circulating miR-622 in Patients with Newly Diagnosed and Recurrent High-Grade Serous Ovarian Carcinoma Clin. Chem. 2020 66 352 362 10.1093/clinchem/hvz013 32040573 17. Nagueh S.F. Smiseth O.A. Appleton C.P. Byrd B.F. Dokainish H. Edvardsen T. Flachskampf F.A. Gillebert T.C. Klein A.L. Lancellotti P. Recommendations for the Evaluation of Left Ventricular Diastolic Function by Echocardiography: An Update from the American Society of Echocardiography and the European Association of Cardiovascular Imaging Eur. Heart J. Cardiovasc. Imaging 2016 17 1321 1360 10.1093/ehjci/jew082 27422899 18. Lang R.M. Badano L.P. Mor-Avi V. Afilalo J. Armstrong A. Ernande L. Flachskampf F.A. Foster E. Goldstein S.A. Kuznetsova T. Recommendations for Cardiac Chamber Quantification by Echocardiography in Adults: An Update from the American Society of Echocardiography and the European Association of Cardiovascular Imaging J. Am. Soc. Echocardiogr. 2015 28 1 39.e14 10.1016/j.echo.2014.10.003 25559473 19. Badano L.P. Kolias T.J. Muraru D. Abraham T.P. Aurigemma G. Edvardsen T. D’Hooge J. Donal E. Fraser A.G. Marwick T. Standardization of Left Atrial, Right Ventricular, and Right Atrial Deformation Imaging Using Two-Dimensional Speckle Tracking Echocardiography: A Consensus Document of the EACVI/ASE/Industry Task Force to Standardize Deformation Imaging Eur. Heart J. Cardiovasc. Imaging 2018 19 591 600 10.1093/ehjci/jey042 29596561 20. Reddy Y.N.V. Obokata M. Egbe A. Yang J.H. Pislaru S. Lin G. Carter R. Borlaug B.A. Left Atrial Strain and Compliance in the Diagnostic Evaluation of Heart Failure with Preserved Ejection Fraction Eur. J. Heart Fail. 2019 21 891 900 10.1002/ejhf.1464 30919562 21. Van Gelder I.C. Rienstra M. Bunting K.V. Casado-Arroyo R. Caso V. Crijns H.J.G.M. De Potter T.J.R. Dwight J. Guasti L. Hanke T. 2024 ESC Guidelines for the Management of Atrial Fibrillation Developed in Collaboration with the European Association for Cardio-Thoracic Surgery (EACTS) Eur. Heart J. 2024 45 ehae176 10.1093/eurheartj/ehae176 39210723 22. McEvoy J.W. McCarthy C.P. Bruno R.M. Brouwers S. Canavan M.D. Ceconi C. Christodorescu R.M. Daskalopoulou S.S. Ferro C.J. Gerdts E. 2024 ESC Guidelines for the Management of Elevated Blood Pressure and Hypertension: Developed by the Task Force on the Management of Elevated Blood Pressure and Hypertension of the European Society of Cardiology (ESC) and Endorsed by the European Society of Endocrinology (ESE) and the European Stroke Organisation (ESO) Eur. Heart J. 2024 45 3912 4018 10.1093/eurheartj/ehae178 39210715 23. McDonagh T.A. Metra M. Adamo M. Gardner R.S. Baumbach A. Böhm M. Burri H. Butler J. Čelutkienė J. Chioncel O. 2023 Focused Update of the 2021 ESC Guidelines for the Diagnosis and Treatment of Acute and Chronic Heart Failure: Developed by the Task Force for the Diagnosis and Treatment of Acute and Chronic Heart Failure of the European Society of Cardiology (ESC) With the Special Contribution of the Heart Failure Association (HFA) of the ESC Eur. Heart J. 2023 44 3627 3639 10.1093/eurheartj/ehad195 37622666 24. Zeppenfeld K. Tfelt-Hansen J. de Riva M. Winkel B.G. Behr E.R. Blom N.A. Charron P. Corrado D. Dagres N. de Chillou C. 2022 ESC Guidelines for the Management of Patients with Ventricular Arrhythmias and the Prevention of Sudden Cardiac Death: Developed by the Task Force for the Management of Patients with Ventricular Arrhythmias and the Prevention of Sudden Cardiac Death of the European Society of Cardiology (ESC) Endorsed by the Association for European Paediatric and Congenital Cardiology (AEPC) Eur. Heart J. 2022 43 3997 4126 10.1093/eurheartj/ehac262 36017572 25. Dickerson T. Wiczer T. Waller A. Philippon J. Porter K. Haddad D. Guha A. Rogers K.A. Bhat S. Byrd J.C. Hypertension and Incident Cardiovascular Events Following Ibrutinib Initiation Blood 2019 134 1919 1928 10.1182/blood.2019000840 31582362 PMC6887116 26. Singh A. El Hangouche N. McGee K. Gong F.-F. Lentz R. Feinglass J. Akhter N. Utilizing Left Atrial Strain to Identify Patients at Risk for Atrial Fibrillation on Ibrutinib Echocardiography 2021 38 81 88 10.1111/echo.14946 33594858 PMC7931636 27. Brown J.R. Moslehi J. O’Brien S. Ghia P. Hillmen P. Cymbalista F. Shanafelt T.D. Fraser G. Rule S. Kipps T.J. Characterization of Atrial Fibrillation Adverse Events Reported in Ibrutinib Randomized Controlled Registration Trials Haematologica 2017 102 1796 1805 10.3324/haematol.2017.171041 28751558 PMC5622864 28. Visseren F.L.J. Mach F. Smulders Y.M. Carballo D. Koskinas K.C. Bäck M. Benetos A. Biffi A. Boavida J.-M. Capodanno D. 2021 ESC Guidelines on Cardiovascular Disease Prevention in Clinical Practice: Developed by the Task Force for Cardiovascular Disease Prevention in Clinical Practice with Representatives of the European Society of Cardiology and 12 Medical Societies With the Special Contribution of the European Association of Preventive Cardiology (EAPC) Eur. Heart J. 2021 42 3227 3337 10.1093/eurheartj/ehab484 34458905 29. Buffolo F. Tetti M. Mulatero P. Monticone S. Aldosterone as a Mediator of Cardiovascular Damage Hypertension 2022 79 1899 1911 10.1161/HYPERTENSIONAHA.122.17964 35766038 30. Palmer L.G. Schnermann J. Integrated Control of Na Transport along the Nephron Clin. J. Am. Soc. Nephrol. 2015 10 676 687 10.2215/CJN.12391213 25098598 PMC4386267 31. Milliez P. Girerd X. Plouin P.-F. Blacher J. Safar M.E. Mourad J.-J. Evidence for an Increased Rate of Cardiovascular Events in Patients with Primary Aldosteronism J. Am. Coll. Cardiol. 2005 45 1243 1248 10.1016/j.jacc.2005.01.015 15837256 32. Alexandre J. Saloux E. Chequel M. Allouche S. Ollitrault P. Plane A.-F. Legallois D. Fischer M.-O. Saplacan V. Buklas D. Preoperative Plasma Aldosterone and the Risk of Atrial Fibrillation after Coronary Artery Bypass Surgery: A Prospective Cohort Study J. Hypertens. 2016 34 2449 2457 10.1097/HJH.0000000000001105 27584972 33. Kim S.K. Pak H.-N. Park J.H. Ko K.J. Lee J.S. Choi J.I. Choi D.H. Kim Y.-H. Clinical and Serological Predictors for the Recurrence of Atrial Fibrillation after Electrical Cardioversion Europace 2009 11 1632 1638 10.1093/europace/eup321 19858160 34. Swedberg K. Eneroth P. Kjekshus J. Wilhelmsen L. Hormones Regulating Cardiovascular Function in Patients with Severe Congestive Heart Failure and Their Relation to Mortality. CONSENSUS Trial Study Group Circulation 1990 82 1730 1736 10.1161/01.CIR.82.5.1730 2225374 35. Reil J.-C. Hohl M. Selejan S. Lipp P. Drautz F. Kazakow A. Münz B.M. Müller P. Steendijk P. Reil G.-H. Aldosterone Promotes Atrial Fibrillation Eur. Heart J. 2012 33 2098 2108 10.1093/eurheartj/ehr266 21816854 36. Alexandre J. Dolladille C. Douesnel L. Font J. Dabrowski R. Shavit L. Legallois D. Funck-Brentano C. Champ-Rigot L. Ollitrault P. Effects of Mineralocorticoid Receptor Antagonists on Atrial Fibrillation Occurrence: A Systematic Review, Meta-Analysis, and Meta-Regression to Identify Modifying Factors J. Am. Heart Assoc. 2019 8 e013267 10.1161/JAHA.119.013267 31711383 PMC6915291 37. Solomon S.D. McMurray J.J.V. Vaduganathan M. Claggett B. Jhund P.S. Desai A.S. Henderson A.D. Lam C.S.P. Pitt B. Senni M. Finerenone in Heart Failure with Mildly Reduced or Preserved Ejection Fraction N. Engl. J. Med. 2024 391 1475 1485 10.1056/NEJMoa2407107 39225278 38. Oraii A. Healey J.S. Kowalik K. Pandey A.K. Benz A.P. Wong J.A. Conen D. McIntyre W.F. Mineralocorticoid Receptor Antagonists and Atrial Fibrillation: A Meta-Analysis of Clinical Trials Eur. Heart J. 2024 45 756 774 10.1093/eurheartj/ehad811 38195054 39. Pawlonka J. Buchalska B. Buczma K. Borzuta H. Kamińska K. Cudnoch-Jędrzejewska A. Targeting the Renin–Angiotensin–Aldosterone System (RAAS) for Cardiovascular Protection and Enhanced Oncological Outcomes: Review Curr. Treat. Options Oncol. 2024 25 1406 1427 10.1007/s11864-024-01270-9 39422794 PMC11541340 40. Alexandre J. Moslehi J.J. Bersell K.R. Funck-Brentano C. Roden D.M. Salem J.-E. Anticancer Drug-Induced Cardiac Rhythm Disorders: Current Knowledge and Basic Underlying Mechanisms Pharmacol. Ther. 2018 189 89 103 10.1016/j.pharmthera.2018.04.009 29698683 41. Xiao L. Salem J.-E. Clauss S. Hanley A. Bapat A. Hulsmans M. Iwamoto Y. Wojtkiewicz G. Cetinbas M. Schloss M.J. Ibrutinib-Mediated Atrial Fibrillation Attributable to Inhibition of C-Terminal Src Kinase Circulation 2020 142 2443 2455 10.1161/CIRCULATIONAHA.120.049210 33092403 PMC9661397 42. Buck B. Chum A.P. Patel M. Carter R. Nawaz H. Yildiz V. Ruz P. Wiczer T. Rogers K.A. Awan F.T. Cardiovascular Magnetic Resonance Imaging in Patients With Ibrutinib-Associated Cardiotoxicity JAMA Oncol. 2023 9 552 555 10.1001/jamaoncol.2022.6869 36729480 PMC9896369 43. Kim S.-M. Kang J.-O. Lim J.E. Hwang S.-Y. Oh B. Csk Regulates Blood Pressure by Controlling the Synthetic Pathways of Aldosterone Circ. J. 2017 82 168 175 10.1253/circj.CJ-17-0080 28724838 44. Touyz R.M. Wu X.-H. He G. Salomon S. Schiffrin E.L. Increased Angiotensin II-Mediated Src Signaling via Epidermal Growth Factor Receptor Transactivation Is Associated with Decreased C-Terminal Src Kinase Activity in Vascular Smooth Muscle Cells from Spontaneously Hypertensive Rats Hypertension 2002 39 479 485 10.1161/hy02t2.102909 11882594 45. Yan S. Xu W. Fang N. Li L. Yang N. Zhao X. Hao H. Zhang Y. Liang Q. Wang Z. Ibrutinib-Induced Pulmonary Angiotensin-Converting Enzyme Activation Promotes Atrial Fibrillation in Rats iScience 2024 27 108926 10.1016/j.isci.2024.108926 38357670 PMC10864204 46. Braun S. Lösel R. Wehling M. Boldyreff B. Aldosterone Rapidly Activates Src Kinase in M-1 Cells Involving the Mineralocorticoid Receptor and HSP84 FEBS Lett. 2004 570 69 72 10.1016/j.febslet.2004.06.031 15251441 47. Callera G.E. Yogi A. Briones A.M. Montezano A.C.I. He Y. Tostes R.C.A. Schiffrin E.L. Touyz R.M. Vascular Proinflammatory Responses by Aldosterone Are Mediated via C-Src Trafficking to Cholesterol-Rich Microdomains: Role of PDGFR Cardiovasc. Res. 2011 91 720 731 10.1093/cvr/cvr131 21576132 48. Latronico M.V.G. Condorelli G. MicroRNAs and Cardiac Pathology Nat. Rev. Cardiol. 2009 6 418 429 10.1038/nrcardio.2009.56 19434076 49. Kawaguchi S. Moukette B. Sepúlveda M.N. Hayasaka T. Aonuma T. Haskell A.K. Mah J. Liangpunsakul S. Tang Y. Conway S.J. SPRR1A Is a Key Downstream Effector of MiR-150 during Both Maladaptive Cardiac Remodeling in Mice and Human Cardiac Fibroblast Activation Cell Death Dis. 2023 14 446 10.1038/s41419-023-05982-y 37468478 PMC10356860 Figure 1 Distributions of population with 95% confidence intervals according to hypertension baseline status ( A B C D p Figure 2 ( A B C Figure 3 Number of AF and HTN events in the cohort, the seriousness of AF and HTN events, and the median of time to onset of AF and HTN events. CVAEs: cardiovascular adverse events; TTO: time to onset; AF: atrial fibrillation; HTN: hypertension. Time to onset is expressed with median (quartile 1–quartile 3). Figure 4 Potential role of renin–angiotensin–aldosterone system, activated by CSK inhibition and subsequent Src activation, in promoting development of ibrutinib-related cardiovascular adverse events. CSK: C-Terminal Src Kinase; CVAEs: cardiovascular adverse events; AF: atrial fibrillation; HTN: hypertension; HF: heart failure; VA: ventricular arrythmias. biomedicines-13-02184-t001_Table 1 Table 1 Baseline characteristics of cohort. CVAE: cardiovascular adverse event; BMI: body mass index; HTN: hypertension; AF: atrial fibrillation; LBBB: left bundle branch block; RBBB: right bundle branch block; AV: atrio-ventricular; CCB: calcium-channel blocker, LVEF: left ventricular ejection fraction; LA: left atrium; CRP: C reactive protein; TNF: tumor necrosis factor; IL: interleukin; ACE-2: angiotensin-converting enzyme 2. Characteristics Total (n = 25) No CVAE Group (n = 18) CVAEs Group (n = 7) p Demographic parameters     Homme 16 (64%) 10 (55.6%) 6 (85.7%) 0.355 Age 72 (63–77) 73 (63.2–76.8) 69 (65–77) 1 BMI 23.7 (21.9–27.7) 22.9 (20.9–26.6) 24.6 (23.3–29.6) 0.204 HTN 9 (36%) 4 (22.2%) 5 (71.4%) 0.061 Hypercholesterolemia 3 (12%) 2 (11.1%) 1 (14.3%) 1 Diabetes 1 (4%) 1 (5.6%) 0 (0%) 1 Renal insufficiency 0 (0%) 0 (0%) 0 (0%)  History of AF 1 (4%) 0 (0%) 1 (14.3%) 0.28 History of heart failure 0 (0%) 0 (0%) 0 (0%)  History of stroke 2 (8%) 1 (5.6%) 1 (14.3%) 0.49 History of peripheral vascular disease 1 (4%) 1 (5.6%) 0 (0%) 1 Cardiac artery disease 3 (12%) 3 (16.7%) 0 (0%) 0.539 Veinous thromboembolism 1 (4%) 1 (5.6%) 0 (0%) 0.49 LBBB, RBBB, 1st degree AV block 6 (24%) 4 (22.2%) 2 (28.6%) 1 Type of hemopathy     -Chronic lymphoid leukemia 17 (68%) 13 (72.2%) 4 (57.1%) 0.64 -Lymphoma 3 (12%) 3 (16.7%) 0 (0%) 0.534 -Waldenstrom disease 4 (16%) 2 (11.1%) 2 (28.6%) 0.548 Drugs at baseline     -Aspirin 6 (24%) 4 (22.2%) 2 (28.6%) 1 -Anticoagulant 2 (8%) 1 (5.6%) 1 (14.3%) 0.49 -Statine 5 (20%) 4 (22.2%) 1 (14.3%) 1 -Beta-blocker 4 (16%) 3 (16.7%) 1 (14.3%) 1 -CCB dihydropyridinique 8 (32%) 3 (16.7%) 5 (71.4%) 0.017 -CCB non-dihydropyridinique 1 (4%) 1 (5.6%) 0 (0%) 1 -ACE inhibitors 3 (12%) 2 (11.1%) 1 (14.3%) 1 -Angiotensin-receptor blockers 4 (16%) 3 (16.7%) 1 (14.3%) 1 -Antiarrhythmic drugs 1 (4%) 0 (0%) 1 (14.3%) 0.28 Echographic parameters     LVEF (%) 64.7 (60.9–68.6) 64 (61.6–67.8) 67.4 (61.3–71) 0.274 LA dilatation 10 (40%) 6 (33%) 4 (57%) 0.314 E wave (cm/s) 74.6 (63.4–82.9) 72.6 (62.8–85.2) 76.7 (70.1–79.2) 0.85 E/A ratio 0.9 (0.7–1.2) 0.9 (0.8–1.1) 0.9 (0.8–1.1) 0.85 E/Ea ratio 9 (7.4–9.8) 8.1 (7.1–9.4) 9.9 (8.3–13.3) 0.083 LA reservoir strain 31.8 (26.7–37.1) 31.1 (26.7–37.1) 33.9 (29.8–40.4) 0.574 LA conduit strain 17 (14.6–23.5) 16.9 (13.9–22) 21.2 (16.4–27.2) 0.395 LA contractile strain 14.3 (10.5–17.2) 14.3 (10.7–17.2) 12.7 (10.2–16.5) 0.698 LA compliance 4.6 (3.1–5) 4.6 (3.7–5) 3.2 (3–3.8) 0.571 Biologic parameters     Creatinine (µmol/L) 4 (16%) 1 (6%) 3 (43%) 0.053 CRP (ng/mL) 11 (44%) 9 (50%) 2 (29%) 0.407 Galectin-3 (ng/mL) 11 (44%) 9 (50%) 2 (29%) 0.407 Myeloperoxydase (ng/mL) 4 (16%) 4 (22%) 0 (0%) 0.294 Renin (pg/mL) 6 (24%) 2 (11%) 4 (57%) 0.032 Aldosterone (pg/mL) 9 (36%) 4 (22%) 5 (71%) 0.058 TNF-alpha (pg/mL) 3 (12%) 1 (6%) 2 (29%) 0.18 IL-6 (pg/mL) 8 (32%) 4 (22%) 4 (57%) 0.156 ACE-2 (ng/mL) 2 (8%) 1 (6%) 1 (14%) 0.49 Troponin (pg/mL) 4 (16%) 1 (6%) 3 (43%) 0.053 miR-9 (zmol/µL) 3 (12%) 3 (17%) 0 (0%) 0.534 miR-199 (zmol/µL) 6 (24%) 4 (22%) 2 (29%) 1 miR-22 (zmol/µL) 18 (72%) 15 (83%) 3 (43%) 0.066 miR-99 (zmol/µL) 6 (24%) 5 (28%) 1 (14%) 0.637 miR-150-5p (zmol/µL) 22 (88%) 18 (100%) 4 (57%) 0.015 miR-328 (zmol/µL) 19 (76%) 15 (83%) 4 (57%) 0.298 ",
  "metadata": {
    "Title of this paper": "SPRR1A Is a Key Downstream Effector of MiR-150 during Both Maladaptive Cardiac Remodeling in Mice and Human Cardiac Fibroblast Activation",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467112/"
  }
}