{
  "title": "Paper_706",
  "abstract": "Sci Transl Med Sci Transl Med 319 nihpa Science translational medicine 1946-6234 1946-6242 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12474517 PMC12474517.1 12474517 12474517 NIHMS2107522 40864684 10.1126/scitranslmed.ads9470 NIHMS2107522 NIHPA2107522 1 Article Resolving fibrosis by stimulating HSC-dependent extracellular matrix degradation Sharma Sachin 1 Prathigudupu Vijaya 1 Cable Carson 1 Serrano Lia R. 2 Nerella Srilaxmi 3 Chen Alina 1 Hassan Ghmkin 4 Lakins Johnathon 4 Valenzuela Carlos Lizama 5 Tsukui Tatsuya 3 Ramamoorthi Roopa 6 Kim Jae-Jun 7 8 Willenbring Holger 7 8 9 Mattis Aras N. 8 9 10 Volk Regan F. 11 Zaro Balyn W. 11 Coon Joshua J. 2 12 13 Beresis Richard 11 DeGrado William F. 11 Weaver Valerie M. 4 8 14 15 Christenson Stephanie A. 3 Jo Hyunil 11 Chen Jennifer Y. 1 9 * 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Author contributions: 5A * Jennifer.Chen4@ucsf.edu Competing interests: 27 8 2025 27 8 2025 17 813 497680 eads9470 eads9470 10 09 2025 27 09 2025 28 09 2025 28 09 2025 Tissue fibrosis arises from a critical imbalance between the production and breakdown of extracellular matrix (ECM) components. Whereas current strategies predominantly focus on curbing ECM production, the possibility of promoting ECM degradation to resolve fibrosis remains largely untapped. The role of hepatic stellate cells (HSCs) in ECM degradation is an intriguing area for investigation. We previously demonstrated that inhibiting acid ceramidase (aCDase) increases ceramide in HSCs to ameliorate hepatic fibrosis. Here, we uncover a key signaling pathway that promotes ECM degradation in primary human HSCs, which is dependent upon the activation of protein kinase Cα (PKCα) and the induction of matrix metalloproteinase 1 (MMP-1) through extracellular signal–regulated kinase 1/2 (ERK1/2). Genetic reduction and pharmacological inhibition with a small molecule reduced aCDase activity, leading to increased collagen degradation and hepatic fibrosis resolution in the carbon tetrachloride (CCl 4 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Resolving fibrosis by stimulating HSC-dependent extracellular matrix degradation",
    "Journal it was published in:": "Science translational medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474517/"
  }
}