{
  "title": "Paper_646",
  "abstract": "pmc World J Clin Oncol 1494 wjco WJCO World Journal of Clinical Oncology 2218-4333 Baishideng Publishing Group Inc PMC12476601 PMC12476601.1 12476601 12476601 41024836 10.5306/wjco.v16.i9.109079 jWJCO.v16.i9.eid109079 1 Review Prospects and challenges of novel natural marine-derived compounds in melanoma treatment Zheng K et al Zheng Kai Department of Pediatric Surgery, Tianjin Medical University General Hospital, Tianjin 300052, China Department of Burn Surgery, The Third Affiliated Hospital of Inner Mongolia Medical University (Inner Mongolia Bao Gang Hospital), Baotou 014000, Inner Mongolia Autonomous Region, China Zhou Yuan Faculty of Medicine and Health Sciences, University of Barcelona, Barcelona 08000, Catalonia, Spain Ba Te Department of Burn Surgery, The Third Affiliated Hospital of Inner Mongolia Medical University (Inner Mongolia Bao Gang Hospital), Baotou 014000, Inner Mongolia Autonomous Region, China Yang Zi-Wei Department of Burn Surgery, The Third Affiliated Hospital of Inner Mongolia Medical University (Inner Mongolia Bao Gang Hospital), Baotou 014000, Inner Mongolia Autonomous Region, China. ziweiyang1991@163.com Co-first authors: Kai Zheng and Yuan Zhou. Co-corresponding authors: Te Ba and Zi-Wei Yang. Author contributions: Zheng K and Zhou Y are co-first authors, the two authors made equal contributions to this work, constructed a draft of the manuscript; Ba T and Yang ZW are co-corresponding authors, the two authors made equal contributions to this work, have provided relevant feedback and critical revisions of the manuscript; Zheng K, Zhou Y, Ba T and Yang ZW were involved in the conception and design of the study; all authors read and approved the final manuscript. Corresponding author: Zi-Wei Yang, PhD, Department of Burn Surgery, The Third Affiliated Hospital of Inner Mongolia Medical University (Inner Mongolia Bao Gang Hospital), No. 20 Shaoxian Road, Kundulun District, Baotou 014000, Inner Mongolia Autonomous Region, China. ziweiyang1991@163.com 24 9 2025 24 9 2025 16 9 497728 109079 30 4 2025 28 5 2025 20 8 2025 24 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ The increasing incidence of melanoma poses significant challenges for conventional treatment approaches, plagued by drug resistance and adverse side effects. Natural marine-derived compounds have gained prominence in melanoma research for their unique bioactivities and diversity. This review delves into the therapeutic potential of these compounds in melanoma treatment, emphasizing their distinctive advantages such as multi-target mechanisms and immune modulation, which distinguish them from traditional therapies. Additionally, we discuss the challenges in translating these agents into clinical applications, including formulation stability, bioavailability, and regulatory hurdles. Recent advancements in preclinical models such as organoids and completed clinical trials further support the exploration of marine-derived compounds in melanoma management. By consolidating current research, this review underscores the potential of these agents to enhance treatment efficacy and foster new therapeutic strategies. Melanoma Natural marine-derived compounds Therapeutic applications Traditional therapies Clinical translation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: in vitro INTRODUCTION The global incidence of melanoma, a malignant tumor originating from melanocytes, has greatly increased, largely due to increased ultraviolet exposure[ 1 e.g. 2 3 4 The efficacy of traditional treatments such as surgery, chemotherapy, and radiotherapy face is significantly limited. Surgical options are less viable in metastatic patients, whereas chemotherapeutic agents often result in systemic toxicity and low response rates[ 5 6 7 This review outlines the therapeutic potential of marine-derived compounds in melanoma treatment, highlighting their mechanisms, advantages over traditional agents, and translational challenges. SOURCES, CLASSIFICATION, AND BIOLOGICAL ACTIVITY OF NATURAL MARINE DERIVATIVES Marine organisms—including algae, sponges, corals, mollusks, and microorganisms—represent an unparalleled reservoir of structurally diverse bioactive compounds with therapeutic potential. These compounds are typically classified into alkaloids, terpenoids, polyketides, peptides, and polysaccharides, each contributing unique mechanisms relevant to anticancer activities[ 8 10 The sources and classification Marine macro-organisms, such as sponges, tunicates, corals, and macroalgae ( e.g. 11 14 15 16 17 18 Medicinal potential Marine-derived compounds exhibit structural features distinct from terrestrial natural products, which may confer novel mechanisms of action and therapeutic selectivity.  Antitumor effects: 18 19 20 21 The regulatory roles of noncoding RNAs (ncRNAs) in cancer have gained attention, and some marine-derived agents have been shown to modulate ncRNAs that influence tumor growth and apoptosis, indicating a promising therapeutic pathway[ 22 23 26 Akazamicin Actinofuranone C Nonomuraea sp 50 50 27  Anti-inflammatory and immune regulation: via 28 29 30 31 32 Furthermore, the therapeutic potential of marine-derived substances extends beyond inflammation reduction; these compounds also play a significant role in modulating immune system activity. For example, some marine polysaccharides can enhance the activity of immune cells such as macrophages and natural killer (NK) cells, helping the body defend against infections and disease[ 33 34 Development and application challenges Despite their therapeutic potential, marine-derived products face challenges in extraction, sustainability, and clinical translation. The complex biochemistry of marine organisms requires advanced techniques to isolate active compounds with minimal degradation. Traditional methods like solvent extraction are often inefficient, while newer approaches such as ultrasound-assisted and enzymatic extraction improve yield and compound stability[ 24 35 19 36 Meanwhile, emerging technologies such as genomics, metabolomics, and co-culturing strategies are accelerating the discovery of novel bioactive compounds by activating previously silent biosynthetic pathways[ 37 ANTITUMOR EFFECTS OF NATURAL MARINE-DERIVED COMPOUNDS ON MELANOMA Natural marine-derived compounds possess the ability to target multiple pathways involved in tumor growth, proliferation, and metastasis, rendering them promising candidates for developing novel therapeutic agents against melanoma[ 38 39 40 41 Antiproliferative effects Various marine-derived compounds have significant effects on the proliferation of melanoma cells. For example, fucan A is a fucose-containing sulfated polysaccharide extracted from brown seaweed Spatoglossum schröederi. Notably, fucan A has demonstrated promising efficacy in inhibiting the growth of triple wild-type melanoma cell lines by approximately 57%-a result comparable to cisplatin, but without toxic effects on normal melanocytes[ 38 42 43 39 44 In melanoma cells, the metabolism of marine derivatives often leads to cell cycle arrest, particularly at the G1/S and G2/M phases. For example, certain compounds derived from marine sources have been demonstrated to upregulate the expression of cell cycle inhibitors such as p21 and p53. This mechanism effectively prevents cells from advancing into the S phase, thereby reducing cellular proliferation[ 45 46 Modulation of the cell cycle and apoptosis-related gene expression  Regulatory mechanisms governing the melanoma cell cycle: 46 47 48  Regulation of gene expression in apoptosis: 49 50 Antimetastatic characteristics In addition to their antiproliferative and proapoptotic effects, natural compounds derived from marine sources have demonstrated promising antimetastatic properties in melanoma. Research has demonstrated that specific marine polysaccharides can inhibit the migratory and invasive properties of melanoma cells, thereby effectively preventing metastasis[ 51 38 52 REGULATION OF KEY SIGNALING PATHWAYS BY NATURAL MARINE DERIVATIVES IN MELANOMA Role of natural marine derivatives in the phosphoinositide 3-kinase/protein kinase B signaling pathway in melanoma The phosphoinositide 3-kinase/protein kinase B (PI3K/AKT) signaling pathway is integral to cellular survival, growth, and metabolism, thereby establishing itself as a critical target in the treatment of melanoma. Natural marine derivatives, particularly those obtained from the marine fungus Aspergillus clavatus 49 Aspergillus clavatus IRS1 EIF4B ELK1 53 in vivo 54 Functions of natural marine derivatives in the mitogen-activated protein kinases signaling pathway in melanoma The mitogen-activated protein kinases (MAPK) signaling pathway represents another essential mechanism involved in the progression and metastasis of melanoma. Natural marine compounds are known to exert substantial effects on this pathway, thereby influencing the behavior of melanoma cells. Hot water extract of Endarachne binghamiae extract has been shown to significantly inhibit the activation of MAPK signaling pathways in RAW 264.7 cells stimulated with lipopolysaccharide, which subsequently leads to a reduction in the expression of proinflammatory cytokines[ 55 50 Impact of marine derivatives on signaling pathways The diversity of natural marine derivatives offers distinct advantages in the modulation of cellular signaling pathways. The influence of marine-derived compounds transcends individual pathways, as they frequently demonstrate a multifaceted impact on diverse signaling cascades. These compounds can concurrently regulate multiple signaling pathways, including the PI3K/Akt and MAPK pathways. This interaction generates a synergistic effect that enhances their therapeutic efficacy. For example, marine polyphenols have been shown to modulate the expression of critical proteins involved in both the PI3K/Akt pathway and the MAPK pathway, resulting in comprehensive alterations in melanoma cell behavior. Marine derivatives can directly influence the activation of the PI3K/Akt and MAPK signaling pathways[ 56 56 COMPARISON WITH TRADITIONAL TREATMENTS FOR MELANOMA Conventional melanoma therapies, including chemotherapy ( e.g. 3 57 58 60 61 65 42 61 21 66 Safety profiles and tolerability Comparative studies highlight that marine-derived agents not only provide comparable or superior efficacy to traditional therapies but also exhibit lower toxicity. Agents like irinotecan and trastuzumab show reduced systemic side effects compared to chemotherapies, which are often associated with myelosuppression, alopecia, and gastrointestinal toxicity[ 21 48 66 67 vs 61 Resistance mechanisms and reversal potential Resistance to conventional therapies arises from drug efflux, target mutations, and tumor microenvironment adaptation[ 68 70 71 73 68 Clinical evidence of marine-derived compounds in melanoma In addition to their preclinical efficacy, several marine-derived compounds have advanced into clinical trials for melanoma treatment, as summarized in Table 1 74 90 74 75 76 77 81 NCT00112476 89 82 84 90 Table 1 Completed clinical trials of marine-derived compounds in melanoma treatment  Compound name  Source organism  NCT number and Ref.  Phase  Patient population  Methods  Total/melanoma  Clinical efficacy  Most frequent grade 3+ treatment-related adverse events Eribulin Marine sponge (Halichondria okadai) I Advanced solid tumors (including melanoma) Monotherapy 40/2 - Neutropenia: 9/38 (24%); fatigue: 4/38 (11%); peripheral neuropathy: 3/38 (8%) Plitidepsin (Aplidin ® Marine tunicate II Advanced malignant melanoma Monotherapy 39/39 PR/CR: 2/35 (5.7%); SD: 5/35 (14.3%); median OS: 3.5 months Myalgia: 3/35 (8.6%); injection site reaction: 2/35 (5.7%); hypersensitivity: 1/35 (2.9%); hypotension: 1/35 (2.9%) I-II Advanced malignant melanoma Combination (with dacarbazine) I: 28/28, II: 38/38 I: PR/CR: 3/19 (15.8%); SD: 4/19 (21%); II: PR/CR: 6/28 (21.4%); SD: 9/28 (32.1%) ALT elevation: 10/36 (28%); fatigue; nausea/vomiting; hypersensitivity; creatine phosphokinase elevation Kahalalide F Marine mollusk (Elysia rufescens) II Advanced malignant melanoma Monotherapy 24/24 PR/CR: 0/24 (0%); SD: 5/21 (24%); median OS: 10.8 months Transaminase elevation (AST/ALT): 14/24 (58%); gamma-glutamyl transferase: 2/24 (8%); lymphopenia: 2/24 (8%) I Advanced solid tumors (including melanoma) Monotherapy 38/5 PR/CR: 1/5 (20%) Transaminase elevation (AST/ALT); hypokalemia; hypoglycemia Salinosporamide A (Marizomib) Marine actinomycete (Salinispora tropica) NCT00667082 et al 90 I Advanced solid tumors (including melanoma) Combination (with vorinostat) 22/17 PR/CR: 0/17 (0%); SD: 11/17 (64.7%) Fatigue: 4/22 (18%); nausea: 5/22 (23%); vomiting: 4/22 (18%); diarrhea: 2/22 (9%); deep vein thrombosis: 3/22 (14%); thrombocytopenia (grade 4): 1/22 (5%) Didemnin B Marine tunicate (Trididemnum solidum) II Metastatic melanoma Monotherapy 14/14 PR/CR: 0/14 (0%) Hypersensitivity reactions; nausea, vomiting, diarrhea II Advanced malignant melanoma Monotherapy 19/19 PR: 1/19 (5.3%); SD: 7/19 (36.8%) Anaphylactoid reactions: 7/19 (37%); severe myopathy: 1/19 (5%) Bryostatin 1 Marine bryozoan (Bugula neritina) NCT00006022 Ia/Ib Metastatic melanoma Monotherapy 17/- NCT00112476 et al 89 I Advanced or metastatic solid tumors (including melanoma) Combination (with temsirolimus) 30/- PR: 3/25 (12%); SD: 13/25 (52%); Neutropenia (10%); thrombosis (10%); creatinine elevation II Metastatic melanoma Monotherapy 34/34 SD: 7/34 (21%) Myalgia: 6/34 (18%); lethargy II Metastatic melanoma Monotherapy 16/16 SD: 1/15 (6.7%); median survival: 134 days Myalgia: 6/16 (37.5%); nausea/vomiting: 1/16 (6.25%) I Advanced solid tumors (including melanoma) Monotherapy 19/- Myalgia: 3/3 (100%) at highest dose (65 µg/m²); cellulitis/phlebitis I Advanced malignancies (including melanoma) Monotherapy 35/2 PR/CR: 2/2 (100%) Myalgia: 4/11 (36%); headache: 5/11 (45%); phlebitis: 11/23 (48%); acute infusion reactions (dyspnea, flushing, hypotension, bradycardia): 6/35 (17%) II Metastatic melanoma Monotherapy 49/49 PR/CR: 1/49 (2%) Myalgia: > 90%; nausea/vomiting: 6/49 (12%) II Metastatic melanoma Monotherapy 18/18 SD: 1/18 (5.6%) Myalgia: 1/18 (5.6%) Dolastatin-10 Marine mollusk (Dolabella auricularia) II Metastatic melanoma Monotherapy 12/12 Objective response rate: 0/12 (0%) Neutropenia: 4/12 (33%) Trabectedin (Yondelis ® Marine tunicate a I Advanced solid tumors (including melanoma) Monotherapy 72/2 PR/CR: 1/2 (50%) Neutropenia: 15/72 (20%); elevated transaminases: 40/103 cycles (39%); fatigue: 14/72 (19%) ALT: Alanine aminotransferase; AST: Aspartate aminotransferase; CR: Complete response; OS: Overall survival; PR: Partial response; SD: Stable disease. Collectively, these clinical findings highlight the potential of marine-derived compounds in combination therapies, while also pointing to the urgent need for larger, melanoma-specific phase III trials to confirm these early results. Due to small sample sizes and heterogeneous trial designs, caution should be taken when applying these findings to broader clinical practice. SD rates reported across multiple studies support the potential of these agents to help control disease progression. However, frequent grade ≥ 3 treatment-related adverse events-such as fatigue, elevated liver enzymes, and hematologic toxicity-were also noted. These outcomes reflect both the promise and limitations of current marine-derived therapies, and underscore the importance of further clinical refinement, particularly in dosing strategies and patient selection. FUTURE PERSPECTIVES Marine-derived compounds hold significant promise for melanoma therapy by offering direct antitumor effects and overcoming drug resistance. Certain marine polysaccharides can modulate immune responses and enhance therapeutic outcomes in melanoma patients[ 64 Discovery and optimization of novel marine-derived compounds While marine biodiversity offers a vast reservoir of bioactive molecules, much of it remains underexplored. Recent discoveries highlight marine metabolites targeting apoptosis regulators like Bcl-2 and Survivin[ 91 92 94 95 96 97 Synergistic potential with immunotherapy Although ICIs have revolutionized melanoma treatment, resistance remains a major obstacle[ 49 98 99 59 64 100 101 Integration of advanced technologies in marine drug development The integration of advanced technologies and personalized medicine is critical for translating marine-derived compounds into clinical applications. Tools such as biomarker discovery, functional genomics, and high-resolution imaging enhance the prediction of therapeutic responses and elucidate disease mechanisms, supporting safer and more effective drug development. Safety and efficacy assessments remain fundamental in this process. Marine-derived agents, particularly those from marine microorganisms, exhibit promising anticancer and dermatological activities-such as 2,4,6-triphenyl-1-hexene from Bacillus sp 101 e.g. 102 103 Organoid models: A promising platform for marine-derived compound validation in melanoma Patient-derived melanoma organoid models have demonstrated the ability to recapitulate key tumor features, including cellular heterogeneity, genetic profiles, and the immune microenvironment. These advanced three-dimensional (3D) systems[ 104 108 109 110 111 The application of melanoma organoids has continued to expand, covering areas such as drug screening, immune profiling, and personalized therapy development. These models preserve both tumor-intrinsic features and immune characteristics, making them well-suited for evaluating ICIs, such as PD-1 blockade[ 112 113 114 116 in vitro ex vivo 117 118 119 120 ex vivo Looking forward, the incorporation of molecular profiling into therapeutic decision-making has the potential to facilitate more personalized treatment approaches for melanoma. This integration may help identify patients who are most likely to benefit from compounds derived from marine sources. This precision medicine approach aims to improve treatment efficacy and reduce toxicity through patient-specific drug selection strategies[ 121 CONCLUSION The investigation of natural marine-derived compounds for melanoma treatment represents a significant advancement in oncological therapeutics. However, it is important to acknowledge that the mechanisms of action for many of these compounds remain incompletely understood, and further investigation is required before they can be safely and effectively translated into clinical applications. This review underscores the enhanced efficacy and reduced side effects of marine-derived agents compared to traditional therapies, particularly in patients with treatment-resistance melanoma. As our understanding of the mechanisms of action of these marine drugs deepens; and production technologies advance, there is promising potential for their clinical integration. It is imperative, from an expert standpoint, to stress the importance of a balanced interpretation of the diverse research findings on marine-derived therapies. While initial data is encouraging, conducting comprehensive clinical trials is essential to address patient response variability and the complexities of melanoma biology. The heterogeneous nature of melanoma, influenced by genetic, environmental, and immunological factors, underscores the need for thorough investigation into personalizing these marine compounds to individual patient characteristics. Moreover, the integration of marine-derived therapies into current treatment protocols requires careful consideration. Collaboration among researchers, clinicians, and pharmaceutical developers is crucial to ensure that these novel therapies complement rather than compete with established treatments. This interdisciplinary approach can help identify synergistic effects, enabling the development of more effective combination therapies to improve patient outcomes. In summary, the potential advancements offered by marine-derived agents in melanoma treatment present a promising avenue for future research and clinical practice. By maintaining a balanced perspective that acknowledges both the potential of these compounds and the complexities of melanoma, we can pave the way for enhanced therapeutic strategies. Continued research and cooperation in this field will not only enrich our understanding of melanoma treatment but also have the potential to significantly impact patient care in the coming years.  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Zamani M Melnychuk T Eisenhauer A Gäbler R Schultz C Investigating Past, Present, and Future Trends on Interface Between Marine and Medical Research and Development: A Bibliometric Review Mar Drugs 2025 23 34 39852536 10.3390/md23010034 PMC11766621 2 Sánchez-Magraner L Miles J Baker CL Applebee CJ Lee DJ Elsheikh S Lashin S Withers K Watts AG Parry R Edmead C Lopez JI Mehta R Italiano A Ward SG Parker PJ Larijani B High PD-1/PD-L1 Checkpoint Interaction Infers Tumor Selection and Therapeutic Sensitivity to Anti-PD-1/PD-L1 Treatment Cancer Res 2020 80 4244 4257 32855204 10.1158/0008-5472.CAN-20-1117 3 Fukushima H Iwata Y Saito K Sugiura K Successful rechallenge therapy for BRAF/MEK inhibitor-resistant multiple brain metastases of melanoma J Dermatol 2021 48 1291 1295 34018641 10.1111/1346-8138.15969 4 Kichina JV Maslov A Kandel ES PAK1 and Therapy Resistance in Melanoma Cells 2023 12 2373 37830586 10.3390/cells12192373 PMC10572217 5 Zhang K Ding W Han C Long L Yin H Yin J Investigation on taxonomy, secondary metabolites and antibacterial activity of Streptomyces sediminicola sp. nov., a novel marine sediment-derived Actinobacteria Microb Cell Fact 2024 23 285 39427194 10.1186/s12934-024-02558-z PMC11490992 6 Zhang C Shen H Yang T Li T Liu X Wang J Liao Z Wei J Lu J Liu H Xiang L Yang Y Yang M Wang D Li Y Xing R Teng S Zhao J Yang Y Zhao G Chen K Li X Yang J A single-cell analysis reveals tumor heterogeneity and immune environment of acral melanoma Nat Commun 2022 13 7250 36433984 10.1038/s41467-022-34877-3 PMC9700682 7 Gomes NG Lefranc F Kijjoa A Kiss R Can Some Marine-Derived Fungal Metabolites Become Actual Anticancer Agents? Mar Drugs 2015 13 3950 3991 26090846 10.3390/md13063950 PMC4483665 8 Chen BS Zhang D de Souza FZR Liu L Recent Advances in the Synthesis of Marine-Derived Alkaloids via Enzymatic Reactions Mar Drugs 2022 20 368 35736171 10.3390/md20060368 PMC9229328 9 Parera-Valadez Y Yam-Puc A López-Aguiar LK Borges-Argáez R Figueroa-Saldivar MA Cáceres-Farfán M Márquez-Velázquez NA Prieto-Davó A Ecological Strategies Behind the Selection of Cultivable Actinomycete Strains from the Yucatan Peninsula for the Discovery of Secondary Metabolites with Antibiotic Activity Microb Ecol 2019 77 839 851 30761424 10.1007/s00248-019-01329-3 10 Xu M Bai Z Xie B Peng R Du Z Liu Y Zhang G Yan S Xiao X Qin S Marine-Derived Bisindoles for Potent Selective Cancer Drug Discovery and Development Molecules 2024 29 933 38474445 10.3390/molecules29050933 PMC10935119 11 Wang P Huang X Jiang C Yang R Wu J Liu Y Feng S Wang T Antibacterial properties of natural products from marine fungi reported between 2012 and 2023: a review Arch Pharm Res 2024 47 505 537 38850495 10.1007/s12272-024-01500-6 12 Yang X Liu J Mei J Jiang R Tu S Deng H Liu J Yang S Li J Origins, Structures, and Bioactivities of Secondary Metabolites from Marine-derived Penicillium Fungi Mini Rev Med Chem 2021 21 2000 2019 33596801 10.2174/1389557521666210217093517 13 Deng R Zong GF Wang X Yue BJ Cheng P Tao RZ Li X Wei ZH Lu Y Promises of natural products as clinical applications for cancer Biochim Biophys Acta Rev Cancer 2025 1880 189241 39674416 10.1016/j.bbcan.2024.189241 14 Geng H Chen M Guo C Wang W Chen D Marine polysaccharides: Biological activities and applications in drug delivery systems Carbohydr Res 2024 538 109071 38471432 10.1016/j.carres.2024.109071 15 Barzkar N Sukhikh S Babich O Study of marine microorganism metabolites: new resources for bioactive natural products Front Microbiol 2023 14 1285902 38260902 10.3389/fmicb.2023.1285902 PMC10800913 16 Eze OC Berebon DP Emencheta SC Evurani SA Okorie CN Balcão VM Vila MMDC Therapeutic Potential of Marine Probiotics: A Survey on the Anticancer and Antibacterial Effects of Pseudoalteromonas spp Pharmaceuticals (Basel) 2023 16 1091 37631006 10.3390/ph16081091 PMC10458718 17 Jenssen M Kristoffersen V Motiram-Corral K Isaksson J Rämä T Andersen JH Hansen EH Hansen KØ Chlovalicin B, a Chlorinated Sesquiterpene Isolated from the Marine Mushroom Digitatispora marina Molecules 2021 26 7560 34946641 10.3390/molecules26247560 PMC8703342 18 Rai T Kaushik N Malviya R Sharma PK A review on marine source as anticancer agents J Asian Nat Prod Res 2024 26 415 451 37675579 10.1080/10286020.2023.2249825 19 Meenakshi DU Narde GK Siddiqui S Ahuja A Marine Bioactive Phytoconstituents in Autoimmune Disorders: Role and Mechanism - A Review Antiinflamm Antiallergy Agents Med Chem 2023 22 10 29 37519208 10.2174/1871523022666230731104529 20 Zhu JQ Fan SR Wei X Zhang CX Zhang DM Chen MF He X Synthesis and biological evaluation of marine natural product, Cryptoechinuline D derivatives as novel antiangiogenic agents Bioorg Med Chem Lett 2022 65 128717 35390450 10.1016/j.bmcl.2022.128717 21 Roccuzzo G Gherardi E Maio M Malagoli P Marzano AV Parodi A Pimpinelli N Spagnolo F Di Giacomo AM Quaglino P Immunotherapy in cutaneous melanoma and biologics in psoriatic disease: similarities and differences from a clinical multidisciplinary perspective Expert Opin Biol Ther 2024 24 125 131 38421218 10.1080/14712598.2024.2326168 22 Zhou Z Cao Q Diao Y Wang Y Long L Wang S Li P Non-coding RNA-related antitumor mechanisms of marine-derived agents Front Pharmacol 2022 13 1053556 36532760 10.3389/fphar.2022.1053556 PMC9752855 23 Narayanan M Rajinikanth V Effects of bioactive compounds from marine algae on cancer-related inflammation: a review Med Oncol 2025 42 250 40498177 10.1007/s12032-025-02813-2 24 Diana P Carbone A Barraja P Montalbano A Martorana A Dattolo G Gia O Dalla Via L Cirrincione G Synthesis and antitumor properties of 2,5-bis(3'-indolyl)thiophenes: analogues of marine alkaloid nortopsentin Bioorg Med Chem Lett 2007 17 2342 2346 17306531 10.1016/j.bmcl.2007.01.065 25 Geahchan S Baharlouei P Rahman A Marine Collagen: A Promising Biomaterial for Wound Healing, Skin Anti-Aging, and Bone Regeneration Mar Drugs 2022 20 61 35049916 10.3390/md20010061 PMC8780088 26 Saide A Damiano S Ciarcia R Lauritano C Promising Activities of Marine Natural Products against Hematopoietic Malignancies Biomedicines 2021 9 645 34198841 10.3390/biomedicines9060645 PMC8228764 27 Yang T Yamada K Zhou T Harunari E Igarashi Y Terahara T Kobayashi T Imada C Akazamicin, a cytotoxic aromatic polyketide from marine-derived Nonomuraea sp J Antibiot (Tokyo) 2019 72 202 209 30631113 10.1038/s41429-018-0139-7 28 Anisimova NY Ustyuzhanina NE Donenko FV Bilan MI Ushakova NA Usov AI Nifantiev NE Kiselevskiy MV Influence of fucoidans and their derivatives on antitumor and phagocytic activity of human blood leucocytes Biochemistry (Mosc) 2015 80 925 933 26542005 10.1134/S0006297915070111 29 Flórez-Fernández N Rodríguez-Coello A Latire T Bourgougnon N Torres MD Buján M Muíños A Muiños A Meijide-Faílde R Blanco FJ Vaamonde-García C Domínguez H Anti-inflammatory potential of ulvan Int J Biol Macromol 2023 253 126936 37722645 10.1016/j.ijbiomac.2023.126936 30 Soares JX Loureiro DRP Dias AL Reis S Pinto MMM Afonso CMM Bioactive Marine Xanthones: A Review Mar Drugs 2022 20 58 35049913 10.3390/md20010058 PMC8778107 31 Ge J Liu Z Zhong Z Wang L Zhuo X Li J Jiang X Ye XY Xie T Bai R Natural terpenoids with anti-inflammatory activities: Potential leads for anti-inflammatory drug discovery Bioorg Chem 2022 124 105817 35490583 10.1016/j.bioorg.2022.105817 32 El-Sawy ER Kirsch G An Overview of Aplysinopsins: Synthesis and Biological Activities Mar Drugs 2023 21 268 37233462 10.3390/md21050268 PMC10223755 33 Sansone C Bruno A Piscitelli C Baci D Fontana A Brunet C Noonan DM Albini A Natural Compounds of Marine Origin as Inducers of Immunogenic Cell Death (ICD): Potential Role for Cancer Interception and Therapy Cells 2021 10 231 33504012 10.3390/cells10020231 PMC7912082 34 Saini N Sirohi R A A Saini N Wadhwa P Kaur P Sharma V Singh G Singh I Sahu SK Marine-derived Natural Products as Anticancer Agents Med Chem 2023 19 538 555 36476429 10.2174/1573406419666221202144044 35 Zou R Chen B Sun J Guo YW Xu B Recent advances of activation techniques-based discovery of new compounds from marine fungi Fitoterapia 2023 167 105503 37037384 10.1016/j.fitote.2023.105503 36 Lu WY Li HJ Li QY Wu YC Application of marine natural products in drug research Bioorg Med Chem 2021 35 116058 33588288 10.1016/j.bmc.2021.116058 37 Chen J Zhang P Ye X Wei B Emam M Zhang H Wang H The Structural Diversity of Marine Microbial Secondary Metabolites Based on Co-Culture Strategy: 2009-2019 Mar Drugs 2020 18 449 32867339 10.3390/md18090449 PMC7551240 38 Reis MBE Maximo AI Magno JM de Lima Bellan D Buzzo JLA Simas FF Rocha HAO da Silva Trindade E Camargo de Oliveira C A Fucose-Containing Sulfated Polysaccharide from Spatoglossum schröederi Potentially Targets Tumor Growth Rather Than Cytotoxicity: Distinguishing Action on Human Melanoma Cell Lines Mar Biotechnol (NY) 2024 26 181 198 38273163 10.1007/s10126-024-10287-y 39 Pecoraro C Terrana F Panzeca G Parrino B Cascioferro S Diana P Giovannetti E Carbone D Nortopsentins as Leads from Marine Organisms for Anticancer and Anti-Inflammatory Agent Development Molecules 2023 28 6450 37764226 10.3390/molecules28186450 PMC10537790 40 Izzati F Warsito MF Bayu A Prasetyoputri A Atikana A Sukmarini L Rahmawati SI Putra MY Chemical Diversity and Biological Activity of Secondary Metabolites Isolated from Indonesian Marine Invertebrates Molecules 2021 26 1898 33801617 10.3390/molecules26071898 PMC8037762 41 Mbaoji FN Nweze JA Yang L Huang Y Huang S Onwuka AM Peter IE Mbaoji CC Jiang M Zhang Y Pan L Yang D Novel Marine Secondary Metabolites Worthy of Development as Anticancer Agents: A Review Molecules 2021 26 5769 34641312 10.3390/molecules26195769 PMC8510081 42 Lima AGF Mignone VW Vardiero F Kozlowski EO Fernandes LR Motta JM Pavão MSG Figueiredo CC Mourão PAS Morandi V Direct antitumoral effects of sulfated fucans isolated from echinoderms: a possible role of neuropilin-1/β1 integrin endocytosis and focal adhesion kinase degradation Glycobiology 2023 33 715 731 37289485 10.1093/glycob/cwad044 PMC10627248 43 Hammons JC Trzoss L Jimenez PC Hirata AS Costa-Lotufo LV La Clair JJ Fenical W Advance of Seriniquinone Analogues as Melanoma Agents ACS Med Chem Lett 2019 10 186 190 30783501 10.1021/acsmedchemlett.8b00391 PMC6378664 44 Latyshev NA Ermakova SP Ermolenko EV Imbs AB Kasyanov SP Sultanov RM 1-O-alkylglycerols from the hepatopancreas of the crab Paralithodes camtschaticus, liver of the squid Berryteuthis magister, and liver of the skate Bathyraja parmifera, and their anticancer activity on human melanoma cells J Food Biochem 2019 43 e12828 31353521 10.1111/jfbc.12828 45 Lee JH Choi BK Kim M Shin HJ Park SJ A Lucknolide Derivative Induces Mitochondrial ROS-Mediated G2/M Arrest and Apoptotic Cell Death in B16F10 Mouse Melanoma Cells Mar Drugs 2024 22 533 39728108 10.3390/md22120533 PMC11677583 46 Wang K Chen YF Yang YSH Huang HM Lee SY Shih YJ Li ZL Whang-Peng J Lin HY Davis PJ The power of heteronemin in cancers J Biomed Sci 2022 29 41 35705962 10.1186/s12929-022-00816-z PMC9202199 47 Ferraz CAA Grougnet R Nicolau E Picot L de Oliveira Junior RG Carotenoids from Marine Microalgae as Antimelanoma Agents Mar Drugs 2022 20 618 36286442 10.3390/md20100618 PMC9604797 48 Ahmed S Alam W Alsharif KF Aschner M Alzahrani FM Saso L Khan H Therapeutic potential of marine peptides in malignant melanoma Environ Res 2023 227 115771 36967001 10.1016/j.envres.2023.115771 49 Guo X Fan A Qi X Liu D Huang J Lin W Indoloquinazoline alkaloids suppress angiogenesis and inhibit metastasis of melanoma cells Bioorg Chem 2023 141 106873 37734192 10.1016/j.bioorg.2023.106873 50 Ding Y Jiang Y Im ST Myung S Kim HS Lee SH Diphlorethohydroxycarmalol inhibits melanogenesis via protein kinase A/cAMP response element-binding protein and extracellular signal-regulated kinase-mediated microphthalmia-associated transcription factor downregulation in α-melanocyte stimulating hormone-stimulated B16F10 melanoma cells and zebrafish Cell Biochem Funct 2021 39 546 554 33474761 10.1002/cbf.3620 51 Yang S Li D Liu W Chen X Polysaccharides from marine biological resources and their anticancer activity on breast cancer RSC Med Chem 2023 14 1049 1059 37360387 10.1039/d3md00035d PMC10285744 52 Jing Q Hu X Ma Y Mu J Liu W Xu F Li Z Bai J Hua H Li D Marine-Derived Natural Lead Compound Disulfide-Linked Dimer Psammaplin A: Biological Activity and Structural Modification Mar Drugs 2019 17 384 31252563 10.3390/md17070384 PMC6669562 53 Ahmed SA Mendonca P Messeha SS Oriaku ET Soliman KFA The Anticancer Effects of Marine Carotenoid Fucoxanthin through Phosphatidylinositol 3-Kinase (PI3K)-AKT Signaling on Triple-Negative Breast Cancer Cells Molecules 2023 29 61 38202644 10.3390/molecules29010061 PMC10779870 54 Velatooru LR Baggu CB Janapala VR Spatane diterpinoid from the brown algae, Stoechospermum marginatum induces apoptosis via ROS induced mitochondrial mediated caspase dependent pathway in murine B16F10 melanoma cells Mol Carcinog 2016 55 2222 2235 26785383 10.1002/mc.22463 55 Lee SH Lee SS Lee GY Han SY Kim DS Lee BH Yoo YC Endarachne binghamiae Extract Ameliorates Inflammatory Responses in Macrophages Through Regulation of MAPK, NF-kB and PI3K/AKT Pathways, and Prevents Acute Lung Injury in Mice Life (Basel) 2025 15 88 39860028 10.3390/life15010088 PMC11766595 56 Juárez-Portilla C Olivares-Bañuelos T Molina-Jiménez T Sánchez-Salcedo JA Moral DID Meza-Menchaca T Flores-Muñoz M López-Franco Ó Roldán-Roldán G Ortega A Zepeda RC Seaweeds-derived compounds modulating effects on signal transduction pathways: A systematic review Phytomedicine 2019 63 153016 31325683 10.1016/j.phymed.2019.153016 57 Patel M Eckburg A Gantiwala S Hart Z Dein J Lam K Puri N Resistance to Molecularly Targeted Therapies in Melanoma Cancers (Basel) 2021 13 1115 33807778 10.3390/cancers13051115 PMC7961479 58 Bouchereau S Chaplain L Fort M Beauchet A Sidibé T Chapalain M Gonzalez-Lara L Longvert C Blom A Saiag P Funck-Brentano E Impact of prior treatment with immune checkpoint inhibitors on dacarbazine efficacy in metastatic melanoma Br J Cancer 2021 125 948 954 34262147 10.1038/s41416-021-01486-8 PMC8476529 59 Nova P Gomes AM Costa-Pinto AR It comes from the sea: macroalgae-derived bioactive compounds with anti-cancer potential Crit Rev Biotechnol 2024 44 462 476 36842998 10.1080/07388551.2023.2174068 60 Sun C España S Richarz N Solé-Blanch C Boada A Martinez-Cardús A Chu A Liu Z Manzano JL Targeted therapy or immunotherapy in BRAF-mutated metastatic melanoma: a Spanish center's decade of experience Front Oncol 2024 14 1322116 38450188 10.3389/fonc.2024.1322116 PMC10915752 61 Algarin YA Pulumati A Jaalouk D Tan J Zeitouni NC Nouri K The palliative role of lasers in the treatment of melanoma Arch Dermatol Res 2024 316 244 38795247 10.1007/s00403-024-03107-9 PMC11127800 62 Farasatkia A Maeso L Gharibi H Dolatshahi-Pirouz A Stojanovic GM Edmundo Antezana P Jeong JH Federico Desimone M Orive G Kharaziha M Design of nanosystems for melanoma treatment Int J Pharm 2024 665 124701 39278291 10.1016/j.ijpharm.2024.124701 63 Kowalski S Karska J Tota M Skinderowicz K Kulbacka J Drąg-Zalesińska M Natural Compounds in Non-Melanoma Skin Cancer: Prevention and Treatment Molecules 2024 29 728 38338469 10.3390/molecules29030728 PMC10856721 64 Trung DT Surits VV Zueva AO Cao HTT Shevchenko NM Ermakova SP Thinh PD Anticancer Activity In Vitro of Sulfated Polysaccharides from the Brown Alga Spatoglossum vietnamense Molecules 2024 29 4982 39519624 10.3390/molecules29214982 PMC11548010 65 Yin P Ma X Zhang Y Song Y Wang Y Lu Z Primary vaginal malignant melanoma successfully treated with combination therapy: A case report Oncol Lett 2022 24 430 36311689 10.3892/ol.2022.13550 PMC9606724 66 Rager T Eckburg A Patel M Qiu R Gantiwala S Dovalovsky K Fan K Lam K Roesler C Rastogi A Gautam S Dube N Morgan B Nasifuzzaman SM Ramaswami D Gnanasekar V Smith J Merchant A Puri N Treatment of Metastatic Melanoma with a Combination of Immunotherapies and Molecularly Targeted Therapies Cancers (Basel) 2022 14 3779 35954441 10.3390/cancers14153779 PMC9367420 67 Khan E Khan M Khan S Lohani M Bushara NZA Marouf HAA Punnoose K Ahmad IZ Computational modeling of cyanobacterial phytoconstituents against toll-like receptors of skin cancer J Biomol Struct Dyn 2023 41 12292 12304 36744519 10.1080/07391102.2023.2174600 68 Nikdouz A Orso F Emerging roles of 3D-culture systems in tackling tumor drug resistance Cancer Drug Resist 2023 6 788 804 38263982 10.20517/cdr.2023.93 PMC10804388 69 Pradhan B Ki JS Antioxidant and chemotherapeutic efficacies of seaweed-derived phlorotannins in cancer treatment: A review regarding novel anticancer drugs Phytother Res 2023 37 2067 2091 36971337 10.1002/ptr.7809 70 Hasan N Nadaf A Imran M Jiba U Sheikh A Almalki WH Almujri SS Mohammed YH Kesharwani P Ahmad FJ Skin cancer: understanding the journey of transformation from conventional to advanced treatment approaches Mol Cancer 2023 22 168 37803407 10.1186/s12943-023-01854-3 PMC10559482 71 Peña-Corona SI Hernández-Parra H Bernal-Chávez SA Mendoza-Muñoz N Romero-Montero A Del Prado-Audelo ML Cortés H Ateşşahin DA Habtemariam S Almarhoon ZM Abdull Razis AF Modu B Sharifi-Rad J Leyva-Gómez G Neopeltolide and its synthetic derivatives: a promising new class of anticancer agents Front Pharmacol 2023 14 1206334 37346293 10.3389/fphar.2023.1206334 PMC10280003 72 Park Y Son JY Lee BM Kim HS Yoon S Highly Eribulin-resistant KBV20C Oral Cancer Cells Can Be Sensitized by Co-treatment with the Third-generation P-Glycoprotein Inhibitor, Elacridar, at a Low Dose Anticancer Res 2017 37 4139 4146 28739698 10.21873/anticanres.11801 73 Zuo W Kwok HF Development of Marine-Derived Compounds for Cancer Therapy Mar Drugs 2021 19 342 34203870 10.3390/md19060342 PMC8232666 74 Plummer R Lorigan P Brown E Zaucha R Moiseyenko V Demidov L Soriano V Chmielowska E Andrés R Kudryavtseva G Kahatt C Szyldergemajn S Extremera S de Miguel B Cullell-Young M Calvert H Phase I-II study of plitidepsin and dacarbazine as first-line therapy for advanced melanoma Br J Cancer 2013 109 1451 1459 23989947 10.1038/bjc.2013.477 PMC3776988 75 Eisen T Thomas J Miller WH Jr Gore M Wolter P Kavan P Martín JA Lardelli P Phase II study of biweekly plitidepsin as second-line therapy in patients with advanced malignant melanoma Melanoma Res 2009 19 185 192 19436178 10.1097/CMR.0b013e32832bbde6 76 Prendiville J Crowther D Thatcher N Woll PJ Fox BW McGown A Testa N Stern P McDermott R Potter M A phase I study of intravenous bryostatin 1 in patients with advanced cancer Br J Cancer 1993 68 418 424 8347500 10.1038/bjc.1993.352 PMC1968558 77 Propper DJ Macaulay V O'Byrne KJ Braybrooke JP Wilner SM Ganesan TS Talbot DC Harris AL A phase II study of bryostatin 1 in metastatic malignant melanoma Br J Cancer 1998 78 1337 1341 9823975 10.1038/bjc.1998.680 PMC2063191 78 Tozer RG Burdette-Radoux S Berlanger K Davis ML Lohmann RC Rusthoven JR Wainman N Zee B Seymour L National Cancer Institute of Canada Clinical Trials Group A randomized phase II study of two schedules of bryostatin-1 (NSC339555) in patients with advanced malignant melanoma: A National Cancer Institute of Canada Clinical Trials Group study Invest New Drugs 2002 20 407 412 12448658 10.1023/a:1020694425356 79 Philip PA Rea D Thavasu P Carmichael J Stuart NS Rockett H Talbot DC Ganesan T Pettit GR Balkwill F Phase I study of bryostatin 1: assessment of interleukin 6 and tumor necrosis factor alpha induction in vivo. The Cancer Research Campaign Phase I Committee J Natl Cancer Inst 1993 85 1812 1818 8230261 10.1093/jnci/85.22.1812 80 Bedikian AY Plager C Stewart JR O'Brian CA Herdman SK Ross M Papadopoulos N Eton O Ellerhorst J Smith T Phase II evaluation of bryostatin-1 in metastatic melanoma Melanoma Res 2001 11 183 188 11333129 10.1097/00008390-200104000-00014 81 Gonzalez R Ebbinghaus S Henthorn TK Miller D Kraft AS Treatment of patients with metastatic melanoma with bryostatin-1--a phase II study Melanoma Res 1999 9 599 606 10661772 10.1097/00008390-199912000-00010 82 Pardo B Paz-Ares L Tabernero J Ciruelos E García M Salazar R López A Blanco M Nieto A Jimeno J Izquierdo MA Trigo JM Phase I clinical and pharmacokinetic study of kahalalide F administered weekly as a 1-hour infusion to patients with advanced solid tumors Clin Cancer Res 2008 14 1116 1123 18281545 10.1158/1078-0432.CCR-07-4366 83 Martín-Algarra S Espinosa E Rubió J López López JJ Manzano JL Carrión LA Plazaola A Tanovic A Paz-Ares L Phase II study of weekly Kahalalide F in patients with advanced malignant melanoma Eur J Cancer 2009 45 732 735 19186051 10.1016/j.ejca.2008.12.005 84 Twelves C Hoekman K Bowman A Vermorken JB Anthoney A Smyth J van Kesteren C Beijnen JH Uiters J Wanders J Gomez J Guzmán C Jimeno J Hanauske A Phase I and pharmacokinetic study of Yondelis (Ecteinascidin-743; ET-743) administered as an infusion over 1 h or 3 h every 21 days in patients with solid tumours Eur J Cancer 2003 39 1842 1851 12932661 10.1016/s0959-8049(03)00458-1 85 Morgan RJ Synold TW Longmate JA Quinn DI Gandara D Lenz HJ Ruel C Xi B Lewis MD Colevas AD Doroshow J Newman EM Pharmacodynamics (PD) and pharmacokinetics (PK) of E7389 (eribulin, halichondrin B analog) during a phase I trial in patients with advanced solid tumors: a California Cancer Consortium trial Cancer Chemother Pharmacol 2015 76 897 907 26362045 10.1007/s00280-015-2868-7 PMC4694049 86 Sondak VK Kopecky KJ Liu PY Fletcher WS Harvey WH Laufman LR Didemnin B in metastatic malignant melanoma: a phase II trial of the Southwest Oncology Group Anticancer Drugs 1994 5 147 150 8049497 87 Hochster H Oratz R Ettinger DS Borden E A phase II study of Didemnin B (NSC 325319) in advanced malignant melanoma: an Eastern Cooperative Oncology Group study (PB687) Invest New Drugs 1998 16 259 263 10360606 10.1023/a:1006110431250 88 Margolin K Longmate J Synold TW Gandara DR Weber J Gonzalez R Johansen MJ Newman R Baratta T Doroshow JH Dolastatin-10 in metastatic melanoma: a phase II and pharmokinetic trial of the California Cancer Consortium Invest New Drugs 2001 19 335 340 11561695 10.1023/a:1010626230081 89 Plimack ER Tan T Wong YN von Mehren MM Malizzia L Roethke SK Litwin S Li T Hudes GR Haas NB A phase I study of temsirolimus and bryostatin-1 in patients with metastatic renal cell carcinoma and soft tissue sarcoma Oncologist 2014 19 354 355 24674872 10.1634/theoncologist.2014-0020 PMC3983829 90 Millward M Price T Townsend A Sweeney C Spencer A Sukumaran S Longenecker A Lee L Lay A Sharma G Gemmill RM Drabkin HA Lloyd GK Neuteboom ST McConkey DJ Palladino MA Spear MA Phase 1 clinical trial of the novel proteasome inhibitor marizomib with the histone deacetylase inhibitor vorinostat in patients with melanoma, pancreatic and lung cancer based on in vitro assessments of the combination Invest New Drugs 2012 30 2303 2317 22080430 10.1007/s10637-011-9766-6 91 Shakeel E Kumar R Sharma N Akhtar S Ahmad Khan MK Lohani M Siddiqui MH Computational Outlook of Marine Compounds as Anti-Cancer Representatives Targeting BCL-2 and Survivin Curr Comput Aided Drug Des 2019 15 265 276 30706824 10.2174/1573409915666190130173138 92 Copmans D Kildgaard S Rasmussen SA Ślęzak M Dirkx N Partoens M Esguerra CV Crawford AD Larsen TO de Witte PAM Zebrafish-Based Discovery of Antiseizure Compounds from the North Sea: Isoquinoline Alkaloids TMC-120A and TMC-120B Mar Drugs 2019 17 607 31731399 10.3390/md17110607 PMC6891649 93 Li X Xu H Li Y Liao S Liu Y Exploring Diverse Bioactive Secondary Metabolites from Marine Microorganisms Using Co-Culture Strategy Molecules 2023 28 6371 37687200 10.3390/molecules28176371 PMC10489945 94 Mathekga BSP Nxumalo Z Thimiri Govinda Raj DB Micro and nanofluidics for high throughput drug screening Prog Mol Biol Transl Sci 2022 187 93 120 35094783 10.1016/bs.pmbts.2021.07.020 95 Bharathi D Lee J Recent Advances in Marine-Derived Compounds as Potent Antibacterial and Antifungal Agents: A Comprehensive Review Mar Drugs 2024 22 348 39195465 10.3390/md22080348 PMC11355281 96 Murray AE Lo CC Daligault HE Avalon NE Read RW Davenport KW Higham ML Kunde Y Dichosa AEK Baker BJ Chain PSG Discovery of an Antarctic Ascidian-Associated Uncultivated Verrucomicrobia with Antimelanoma Palmerolide Biosynthetic Potential mSphere 2021 6 e0075921 34851164 10.1128/mSphere.00759-21 PMC8636102 97 Blunt JW Carroll AR Copp BR Davis RA Keyzers RA Prinsep MR Marine natural products Nat Prod Rep 2018 35 8 53 29335692 10.1039/c7np00052a 98 Mbaveng AT Noulala CGT Samba ARM Tankeo SB Abdelfatah S Fotso GW Happi EN Ngadjui BT Beng VP Kuete V Efferth T The alkaloid, soyauxinium chloride, displays remarkable cytotoxic effects towards a panel of cancer cells, inducing apoptosis, ferroptosis and necroptosis Chem Biol Interact 2021 333 109334 33245930 10.1016/j.cbi.2020.109334 99 He Y Wang X Identifying biomarkers associated with immunotherapy response in melanoma by multi-omics analysis Comput Biol Med 2023 167 107591 37875043 10.1016/j.compbiomed.2023.107591 100 Lin M Du T Tang X Liao Y Cao L Zhang Y Zheng W Zhou J An estrogen response-related signature predicts response to immunotherapy in melanoma Front Immunol 2023 14 1109300 37251404 10.3389/fimmu.2023.1109300 PMC10213284 101 Kim HY Do HY Park S Kim KW Min D Lee EY Shim D Cho SY Park JO Lee CS Nam SJ Ko J 2,4,6-Triphenyl-1-hexene, an Anti-Melanogenic Compound from Marine-Derived Bacillus sp. APmarine135 Mar Drugs 2024 22 72 38393043 10.3390/md22020072 PMC10890162 102 Wu X Wu T Liu J Ding B Gene Therapy Based on Nucleic Acid Nanostructure Adv Healthc Mater 2020 9 e2001046 32864890 10.1002/adhm.202001046 103 Prajapati RN Bhushan B Singh K Chopra H Kumar S Agrawal M Pathak D Chanchal DK Laxmikant Recent Advances in Pharmaceutical Design: Unleashing the Potential of Novel Therapeutics Curr Pharm Biotechnol 2024 25 2060 2077 38288793 10.2174/0113892010275850240102105033 104 Gregg RK Model Systems for the Study of Malignant Melanoma Methods Mol Biol 2021 2265 1 21 33704702 10.1007/978-1-0716-1205-7_1 105 Nomdedeu-Sancho G Gorkun A Mahajan N Willson K Schaaf CR Votanopoulos KI Atala A Soker S In Vitro Three-Dimensional (3D) Models for Melanoma Immunotherapy Cancers (Basel) 2023 15 5779 38136325 10.3390/cancers15245779 PMC10741426 106 Viegas J Sarmento B Bridging the gap between testing and clinics exploring alternative pre-clinical models in melanoma research Adv Drug Deliv Rev 2024 208 115295 38527625 10.1016/j.addr.2024.115295 107 Drost J Clevers H Translational applications of adult stem cell-derived organoids Development 2017 144 968 975 28292843 10.1242/dev.140566 108 Goncalves B Liu S Zhang X Fan A Ou L Xu X Unveiling Therapeutic Opportunities with Melanoma Patient-derived Organoid Models J Vis Exp 2024 10.3791/66509 PMC11539850 39311587 109 Rebecca VW Somasundaram R Herlyn M Pre-clinical modeling of cutaneous melanoma Nat Commun 2020 11 2858 32504051 10.1038/s41467-020-15546-9 PMC7275051 110 Sun L Kang X Ju H Wang C Yang G Wang R Sun S A human mucosal melanoma organoid platform for modeling tumor heterogeneity and exploring immunotherapy combination options Sci Adv 2023 9 eadg6686 37889972 10.1126/sciadv.adg6686 PMC10610903 111 Xu H Jiao D Liu A Wu K Tumor organoids: applications in cancer modeling and potentials in precision medicine J Hematol Oncol 2022 15 58 35551634 10.1186/s13045-022-01278-4 PMC9103066 112 Ou L Liu S Wang H Guo Y Guan L Shen L Luo R Elder DE Huang AC Karakousis G Miura J Mitchell T Schuchter L Amaravadi R Flowers A Mou H Yi F Guo W Ko J Chen Q Tian B Herlyn M Xu X Patient-derived melanoma organoid models facilitate the assessment of immunotherapies EBioMedicine 2023 92 104614 37229906 10.1016/j.ebiom.2023.104614 PMC10277922 113 Dalvin LA Andrews-Pfannkoch CM Miley DR Hogenson TL Erickson SA Malpotra S Anderson KJ Omer ME Almada LL Zhang C Li H Salomao DR Shields CL Lally SE Malsch RM Armitage JA Holmes HL Romero MF Fautsch MP Markovic SN Fernandez-Zapico ME Novel Uveal Melanoma Patient-Derived Organoid Models Recapitulate Human Disease to Support Translational Research Invest Ophthalmol Vis Sci 2024 65 60 39601636 10.1167/iovs.65.13.60 PMC11605663 114 Zhou S Lu J Liu S Shao J Liu Z Li J Xiao W Role of the tumor microenvironment in malignant melanoma organoids during the development and metastasis of tumors Front Cell Dev Biol 2023 11 1166916 37152280 10.3389/fcell.2023.1166916 PMC10154581 115 Sun Y Revach OY Anderson S Kessler EA Wolfe CH Jenney A Mills CE Robitschek EJ Davis TGR Kim S Fu A Ma X Gwee J Tiwari P Du PP Sindurakar P Tian J Mehta A Schneider AM Yizhak K Sade-Feldman M LaSalle T Sharova T Xie H Liu S Michaud WA Saad-Beretta R Yates KB Iracheta-Vellve A Spetz JKE Qin X Sarosiek KA Zhang G Kim JW Su MY Cicerchia AM Rasmussen MQ Klempner SJ Juric D Pai SI Miller DM Giobbie-Hurder A Chen JH Pelka K Frederick DT Stinson S Ivanova E Aref AR Paweletz CP Barbie DA Sen DR Fisher DE Corcoran RB Hacohen N Sorger PK Flaherty KT Boland GM Manguso RT Jenkins RW Targeting TBK1 to overcome resistance to cancer immunotherapy Nature 2023 615 158 167 36634707 10.1038/s41586-023-05704-6 PMC10171827 116 Cordts SC Yuki K Henao Echeverri MF Narasimhan B Kuo CJ Tang SKY Microdissection tools to generate organoids for modeling the tumor immune microenvironment Microsyst Nanoeng 2024 10 126 39251611 10.1038/s41378-024-00756-8 PMC11385579 117 Magré L Verstegen MMA Buschow S van der Laan LJW Peppelenbosch M Desai J Emerging organoid-immune co-culture models for cancer research: from oncoimmunology to personalized immunotherapies J Immunother Cancer 2023 11 e006290 37220953 10.1136/jitc-2022-006290 PMC10231025 118 Abedellatif SE Hosni R Waha A Gielen GH Banat M Hamed M Güresir E Fröhlich A Sirokay J Wulf AL Kristiansen G Pietsch T Vatter H Hölzel M Schneider M Toma MI Melanoma Brain Metastases Patient-Derived Organoids: An In Vitro Platform for Drug Screening Pharmaceutics 2024 16 1042 39204387 10.3390/pharmaceutics16081042 PMC11360789 119 Hicks WH Gattie LC Shami ME Traylor JI Davar D Najjar YG Richardson TE McBrayer SK Abdullah KG Matched three-dimensional organoids and two-dimensional cell lines of melanoma brain metastases mirror response to targeted molecular therapy Sci Rep 2024 14 24843 39438602 10.1038/s41598-024-76583-8 PMC11496643 120 Chen M Shan H Tao Q Hu R Sun Q Zheng M Chen Z Lin Q Yin M Zhao S Chen X Chen Z Mimicking Tumor Metastasis Using a Transwell-Integrated Organoids-On-a-Chip Platform Small 2024 20 e2308525 38308351 10.1002/smll.202308525 121 Medori MC Donato K Dhuli K Maltese PE Tanzi B Tezzele S Mareso C Miertus J Generali D Donofrio CA Cominetti M Fioravanti A Riccio L Beccari T Ceccarini MR Gisondi P Bellinato F Stuppia L Gatta V Cecchin S Marceddu G Bertelli M Omics sciences and precision medicine in melanoma Clin Ter 2023 174 29 36 37994746 10.7417/CT.2023.2469 ",
  "metadata": {
    "Title of this paper": "Omics sciences and precision medicine in melanoma",
    "Journal it was published in:": "World Journal of Clinical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476601/"
  }
}