{
  "title": "Paper_1083",
  "abstract": "pmc Children (Basel) Children (Basel) 2993 children children Children 2227-9067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468757 PMC12468757.1 12468757 12468757 41007114 10.3390/children12091249 children-12-01249 1 Review Tumor–Immune Interactions in Pediatric Oral Rhabdomyosarcoma: A Narrative Review on Immuno-Oncology and Emerging Therapies https://orcid.org/0000-0003-1069-6374 El Meligy Omar A. 1 https://orcid.org/0000-0002-3586-6731 Elemam Noha M. 2 3 https://orcid.org/0000-0003-0613-9161 Hassan Wael A. 2 3 4 https://orcid.org/0000-0002-5259-327X Talaat Iman M. 2 3 5 * Limongelli Luisa Academic Editor Hicks Debbie Academic Editor 1 omar.elmeligi@dent.alex.edu.eg 2 nelemam@sharjah.ac.ae wael.hassan@sharjah.ac.ae 3 4 5 * italaat@sharjah.ac.ae 17 9 2025 9 2025 12 9 497629 1249 26 8 2025 15 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Pediatric oral rhabdomyosarcoma (RMS) is a rare and aggressive cancer of the head and neck, characterized by a complex and mostly immunosuppressive tumor–immune microenvironment. Unlike adult cancers, pediatric RMS typically exhibits a “cold” immune profile, characterized by minimal T-cell infiltration, a low mutational burden, and resistance to immune checkpoint blockade. The tumor’s location in the oral cavity adds difficulty to treatment because of anatomical and functional limitations. Additionally, the presence of fusion oncogenes, such as PAX3:FOXO1, hampers immunogenicity and treatment response by disrupting antigen presentation and reducing immune cell infiltration. Advances in immuno-oncology have introduced new strategies, including immune checkpoint inhibitors, chimeric antigen receptor (CAR) therapies, cancer vaccines, and oncolytic viruses. However, these approaches face specific challenges in the pediatric population due to developmental immune factors. This narrative review highlights recent findings on the immunobiology of pediatric oral RMS, focusing on tumor–immune interactions and their impact on disease progression and treatment resistance. We reviewed the cellular components of the TIME, the mechanisms of immune evasion, and the expression of immune checkpoints, including PD-L1 and B7-H3. Emerging immunotherapies, including CAR-T, CAR-NK, and CAR-CIK cell therapies; checkpoint inhibitors; oncolytic viruses; and cancer vaccines, are discussed, with an emphasis on their current limitations and potential to transform the pediatric RMS immune landscape. pediatric rhabdomyosarcoma tumor immune microenvironment immunotherapy CAR therapies immune checkpoints This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Rhabdomyosarcoma (RMS) is the most common soft tissue sarcoma in children, frequently arising in the oral cavity as well as the head and neck regions. Oral RMS, often linked to the embryonal subtype, presents unique therapeutic challenges due to its anatomical location and potential impact on craniofacial development. Immune surveillance is critical for recognizing and eliminating tumor cells, and the tumor–immune microenvironment (TIME) in pediatric oral RMS has become an area of growing research interest. Compared to adult tumors, pediatric tumors exhibit distinct features in immune cell infiltration, antigen presentation, and stromal interactions. Many pediatric RMS tumors exhibit a “cold” immune profile, characterized by low expression of immune checkpoints and limited T-cell infiltration [ 1 2 3 1.1. Overview of Pediatric Rhabdomyosarcoma RMS is the most common soft tissue sarcoma in the pediatric population, accounting for approximately 5% of all childhood malignancies and nearly 50% of pediatric soft tissue sarcomas [ 4 5 6 RMS is histologically categorized into four primary subtypes: embryonal (ERMS), alveolar (ARMS), spindle cell/sclerosing, and pleomorphic. ERMS is the most common form, representing 60–70% of cases, typically affecting younger children and commonly presenting in the head and neck region [ 5 7 8 9 RMS can occur in various anatomical locations, with the head and neck (28%), extremities (24%), and genitourinary tract (18%) being the most commonly affected areas [ 6 10 9 11 1.2. Epidemiology and Clinical Significance of Oral Rhabdomyosarcoma Oral RMS, although relatively rare, represents a clinically important subset of head and neck RMS due to the complex anatomy and vital functional roles of the oral cavity. The head and neck region accounts for approximately 28–35% of pediatric RMS cases, with 10–15% specifically involving the oral cavity and oropharyngeal structures such as the tongue, palate, buccal mucosa, gingiva, and floor of the mouth [ 12 Tumors in this area often present with nonspecific symptoms, such as localized swelling, discomfort, ulceration, or impaired function, that may resemble benign conditions like infections or reactive lesions. This often causes delays in diagnosis and treatment, leading to advanced-stage disease at the time of presentation [ 13 14 Therefore, treatment approaches usually focus on systemic chemotherapy and radiotherapy rather than radical surgery. However, these treatments carry significant short- and long-term side effects. In pediatric patients, radiotherapy and cytotoxic drugs can cause growth issues, craniofacial asymmetry, dental problems, soft tissue fibrosis, and long-term neurocognitive impairments [ 15 Table 1 1.3. Importance of the Tumor Immune Microenvironment in Pediatric Rhabdomyosarcoma TIME plays a crucial role in cancer initiation, progression, metastasis, and treatment response. Although pediatric tumors, including RMS, have traditionally been viewed as less immunologically complex than adult cancers, new insights are challenging this notion. Pediatric RMS, especially the alveolar subtype with PAX3:FOXO1 or PAX7:FOXO1 fusions, often exhibits a notably immune-suppressing environment that impairs effective anti-tumor immune responses [ 16 17 RMS tumors typically exhibit an “immune-cold” phenotype, characterized by a low tumor mutational burden (TMB), decreased neoantigen presentation, and limited infiltration of effector immune cells, such as cytotoxic CD8 + 18 19 Additionally, oncogenic fusion genes such as PAX3:FOXO1 have been implicated in suppressing interferon signaling pathways and reducing the expression of antigen presentation machinery, further impairing immune recognition of tumor cells [ 20 21 These findings highlight the significance of TIME in RMS pathobiology and therapeutic resistance. They also show the potential of immunomodulatory strategies to reprogram the tumor microenvironment (TME), enhance immune infiltration, and make tumors more responsive to immunotherapy, thereby drawing more attention to the role of TIME in pediatric oncology research and drug development. 1.4. Need for Immuno-Oncology Approaches in Rhabdomyosarcoma Despite notable advances in multimodal treatment strategies, survival outcomes for high-risk, metastatic, or recurrent pediatric RMS remain inadequate. Traditional cytotoxic regimens, such as chemotherapy and radiotherapy, have plateaued in effectiveness, emphasizing the urgent need for new therapeutic approaches. Immuno-oncology, which utilizes the body’s immune system to target and destroy tumor cells, presents a promising strategy for addressing these challenges in RMS [ 22 While immune checkpoint inhibitors (ICIs), such as anti-PD-1/PD-L1 and anti-CTLA-4 antibodies, have revolutionized cancer treatment in adults, their application in pediatric sarcomas has shown limited success. This is primarily due to the intrinsic immunogenic properties of pediatric tumors and the immunosuppressive nature of their microenvironment [ 23 24 For instance, preclinical studies have demonstrated that chimeric antigen receptor T (CAR-T) cells targeting receptor molecules such as FGFR4 and HER2 can trigger cytotoxic immune responses in RMS models, suggesting their potential for clinical application [ 1 25 Immunotherapeutic approaches currently under investigation for RMS include: immune checkpoint inhibitors targeting the PD-1/PD-L1 and CTLA-4 pathways, CAR-T cell therapy, particularly against tumor antigens such as HER2 and B7-H3, oncolytic virotherapy, which uses engineered viruses to selectively infect and kill tumor cells while stimulating systemic immune responses, tumor-infiltrating lymphocyte (TIL) therapy, aimed at enhancing local immune surveillance and cytotoxic activity, and cancer vaccines designed to elicit immune responses specific to tumor-associated antigens [ 26 27 28 Although early-phase clinical trials have shown limited effectiveness, especially in fusion-positive RMS, combining immunotherapy with traditional treatments and epigenetic reprogramming shows promise. Gaining a deeper understanding of TIME and its interactions with tumor biology is essential for developing successful immunotherapeutic strategies. Personalized therapies that consider the immune environment could provide new hope for improving outcomes in pediatric RMS, particularly for those with metastatic or recurrent disease [ 29 30 Therefore, by integrating perspectives from immunology, oncology, and pediatric pathology, this review aims to create a framework for advancing immuno-oncology strategies in pediatric RMS. The ultimate goal is to improve clinical outcomes for children affected by this aggressive and often difficult-to-treat cancer. 2. Tumor–Immune Microenvironment in Oral Rhabdomyosarcoma The TME encompasses the complex surroundings surrounding tumor cells, including immune cells, stromal cells, blood vessels, and signaling molecules [ 31 32 33 13 2.1. Tumor-Infiltrating Immune Cells in Oral Rhabdomyosarcoma 2.1.1. Macrophages Tumor-associated macrophages (TAMs) are prominent components of the TIME, and their polarization state (M1 or M2) determines their function: M1 Macrophages are classically activated macrophages that are induced by stimuli such as lipopolysaccharides (LPS) and interferon-gamma (IFN-γ), and are characterized by the production of pro-inflammatory cytokines and promotion of Th1 responses [ 34 34 35 In oral RMS, single-cell transcriptomic analysis revealed that macrophages predominantly exhibited an M2 polarization state [ 36 37 38 2.1.2. Lymphocytes T lymphocytes, including CD4 + + + + 39 + 39 + + + + 40 41 In oral RMS, studies have shown that high infiltration of CD4 + + 42 43 44 + + T Cell Exhaustion and Dysfunction in the Oral Rhabdomyosarcoma Microenvironment Studies have shown that chronic exposure to tumor-associated antigens within the tumor TME leads to a progressive loss of T cell effector functions, such as T cell exhaustion [ 43 41 42 44 + + 45 45 Moreover, recent research has highlighted the role of NECTIN3-TIGIT interactions in the immune evasion mechanisms of fusion-positive RMS (characterized by PAX3-FOXO1 or PAX7-FOXO1 gene fusions). NECTIN3, an immune checkpoint ligand expressed on RMS cells, can engage the TIGIT receptor, which is broadly expressed on both CD4 + + 36 Regulatory T Cell (Treg) Plasticity and Tumor Promotion in Oral Rhabdomyosarcoma Tregs demonstrate plasticity in the RMS microenvironment, where they can be “educated” by the TME, leading to their reprogramming into immune-suppressive roles that support tumor growth and metastasis [ 46 47 48 41 CD4 + CD4 + + 49 + 50 51 + 52 52 2.1.3. Myeloid-Derived Suppressor Cells MDSCs constitute a heterogeneous population of immature myeloid cells characterized by their immunosuppressive capabilities. In cancer patients, the accumulation of MDSCs is observed in the peripheral blood, draining lymphoid tissues, and tumor sites [ 53 53 54 55 Recruitment of MDSCs in the Rhabdomyosarcoma Microenvironment Several cytokines in the TME have been identified as major drivers of MDSC expansion, especially Signal Transducer and Activator of Transcription 3 (STAT3), which enhances MDSC proliferation and survival through STAT3 activation [ 53 17 + 56 57 Activation of MDSCs in Rhabdomyosarcoma The TME in RMS is influenced by metabolic factors such as adenosine, which has been shown to enhance the activity of MDSCs, making them more effective at blunting anti-tumor immunity and contributing to chemoresistance [ 58 59 60 60 Immunosuppressive Mechanisms of MDSCs in Rhabdomyosarcoma The functional role of MDSCs in RMS includes suppressing CTLs and contributing to resistance against immunotherapy. These cells use various methods to inhibit anti-tumor immune responses, such as producing reactive oxygen species (ROS) and nitric oxide (NO), which induce oxidative stress and impair T cell function [ 61 61 61 62 61 + + + + 57 2.2. Immunosuppressive Cytokines and Chemokines in Oral Rhabdomyosarcoma RMS employs multiple sophisticated mechanisms to evade immune surveillance, utilizing immunosuppressive cytokines, such as interleukin-10 (IL-10) and transforming growth factor-beta (TGF-β), as well as chemokines, including CCL2 and CXCL12, which play key roles. 2.2.1. IL-10-Driven Immune Suppression in Rhabdomyosarcoma IL-10, produced by both tumor cells and tumor-infiltrating immune cells, primarily acts by suppressing the activation and function of APCs and promoting the differentiation of Tregs [ 63 64 + 65 66 In RMS, a study by Kather et al. (2019) shows that CD163-positive macrophages, a subset characterized by a propensity for IL-10 production, are preferentially enriched within embryonal RMS and correlate with poorer survival outcomes [ 47 2.2.2. Contextual “Jekyll and Hyde” of TGF-β Signaling in Rhabdomyosarcoma TGF-β signaling in RMS exemplifies the contextual duality of cytokine activity. In early tumor stages, TGF-β acts as a tumor suppressor by inducing apoptosis and cell cycle arrest. However, in advanced RMS, TGF-β shifts to promote immune evasion via SMAD2/3-dependent pathways that drive Treg differentiation and inhibit CTLs [ 67 Mesenchymal-like tumor cells and fibroblasts in the RMS microenvironment are the source of abundant TGF-β in this sarcoma [ 31 64 64 TGF-β exerts profound immunosuppressive effects within TME. One of its primary actions is the inhibition of NK cell cytotoxicity, thereby impairing a critical component of innate anti-tumor immunity [ 61 68 69 70 69 2.2.3. Chemokine-Mediated Immune Suppression in Rhabdomyosarcoma The recruitment of MDSCs and TAMs in the TME of RMS is significantly influenced by chemokines such as CCL2 and CXCL12. CCL2, produced by RMS cells and stromal fibroblasts, binds to CCR2 on MDSCs, facilitating their infiltration and subsequent suppression of T-cell proliferation via ARG1 and ROS [ 65 38 69 2.3. Immune Evasion Mechanisms in Rhabdomyosarcoma Recent advances have significantly deepened our understanding of the immunobiology of pediatric RMS, revealing a complex interplay between tumor cells and the immune microenvironment. Notably, emerging evidence suggests that RMS cells dynamically regulate immune checkpoint molecules, with programmed death-ligand 1 (PD-L1) expression being significantly upregulated in response to pro-inflammatory cytokines, such as IFN-γ. While early studies using the SP142 clone detected negligible PD-L1 expression in RMS cells, newer data using the 22C3 antibody demonstrate PD-L1 positivity in 35% of cases, restricted to tumor-associated immune cells, which correlates with improved relapse-free survival in low-stage disease [ 70 RMS cells exhibit a near absence of major histocompatibility complex class I (MHC-I) expression, a critical determinant for CD8 + 69 71 + 68 Beyond the well-characterized role of cytokines in immune modulation, RMS cells leverage a sophisticated array of surface molecules to escape immune surveillance. Among these, B7-H3 (CD276) has emerged as a particularly intriguing player. Strikingly, B7-H3 is overexpressed in approximately 70–80% of RMS tumors, while its expression is virtually undetectable in healthy skeletal muscle tissue [ 72 72 Given these findings, B7-H3 is not only a promising target for novel immunotherapeutic strategies, such as monoclonal antibodies and CAR-T cell therapies, but also a potential indicator of tumor immune status. Ongoing clinical trials are now exploring B7-H3-targeted agents in pediatric RMS [ 73 Key Remark: Pediatric oral RMS is characterized by a profoundly immunosuppressive microenvironment dominated by M2 macrophages, Tregs, and MDSCs. These immune cells collaborate with tumor-derived factors to inhibit the activity of cytotoxic T cells and promote immune escape. Understanding and targeting these components is critical for enhancing immunotherapy responsiveness. To facilitate understanding of the immunological landscape in pediatric oral RMS, Figure 1 3. Emerging Immunotherapeutic Strategies in Pediatric Rhabdomyosarcoma Recent insights into the TME and antitumor immune mechanisms have significantly advanced the field of immunotherapy [ 74 27 27 Cancer immunotherapy aims to enhance the immune system’s capacity to recognize and eliminate tumor cells, either by directly stimulating immune responses or by increasing tumor immunogenicity to overcome immune evasion mechanisms employed by cancer cells [ 62 75 76 77 78 79 80 81 82 As a pediatric malignancy, RMS exhibits a markedly different response to immune-based therapies compared to adult tumors. While the pediatric immune system is generally more adaptable and vigorous than that of adults [ 83 84 85 17 86 87 88 Immunologically, the RMS microenvironment appears to be relatively “cold.” In a study by Kather JN et al., PD-L1 expressing tumor cells and CD8 + + + 89 58 36 Robust preclinical models for RMS have evaluated various modalities, including CAR-T cells, bispecific T cell engagers (BiTEs), and antibody peptide epitope conjugates (APECs) [ 90 91 91 92 3.1. Antibody-Based Therapies Monoclonal antibodies (mAbs) exert their antitumor effects by targeting tumor-specific antigens and employing several mechanisms of action. These include blocking oncogenic signaling pathways [ 93 94 95 96 3.2. Immune Checkpoint Inhibitors Immune checkpoints such as CTLA-4 and PD-1 act as essential negative regulators of T cell activation and function. Tumor cells, along with other components of the TME, often express ligands for these checkpoints: CD80 for CTLA-4 and PD-L1 for PD-1, which helps tumors evade the immune system by suppressing T cell-mediated antitumor activity [ 97 98 99 Studies have evaluated PD-1/PD-L1 expression in pediatric RMS and explored their clinicopathological relevance using immunohistochemistry and tissue microarrays [ 70 100 100 101 101 102 103 103 On the other hand, a study on Nivolumab, a PD-1 blocking antibody, in children and young adults with recurrent or refractory solid tumors, including 12 cases of RMS, revealed that there was no significant single-agent activity, consistent with the low PD-L1 expression levels in RMS tumors [ 104 105 106 Integrative proteomics and transcriptomic profiling of RMS samples identified several targetable surface proteins that are highly enriched in RMS. Among these is the immune checkpoint molecule B7-H3 (CD276), which has emerged as a particularly compelling candidate [ 72 107 72 72 108 109 3.3. Cancer Vaccines Cancer vaccines aim to eliminate minimal residual disease and induce durable, antigen-specific immune memory by stimulating an adaptive T cell response with minimal toxicity. This is achieved through the exogenous administration of tumor-associated antigens (TAAs), which can be delivered in various forms such as DNA, mRNA, peptides, full-length proteins, tumor cell lysates, or autologous DCs, with or without adjuvants [ 80 For instance, recombinant human milk peptide lactaptin (RL2) showed an anti-tumor effect in the RMS mouse model by providing long-lasting, immune-mediated protection [ 110 110 111 111 Cancer vaccines can also be delivered using oncolytic viruses, which simultaneously promote tumor cell lysis and activate the immune system. Given the central role of RAS signaling in embryonal RMS (eRMS) pathogenesis [ 17 112 Given the pivotal role of DCs in orchestrating antitumor immune responses, several clinical studies have explored DC-based immunotherapy (autologous DCs pulsed with specific tumor-associated antigens, or TAAs) across various malignancies. Several studies have explored the use of standard chemotherapy in combination with DC-based immunotherapy in pediatric sarcomas, including RMS, where only some patients responded to this mode of therapy [ 113 114 3.4. Cellular Immunotherapies Adoptive cellular immunotherapies involve the manipulation, expansion, and activation of immune cells to elicit a targeted antitumor response. Several immune cell types, including NK cells and CAR T/NK cells, have been employed as therapeutic platforms [ 115 3.4.1. CAR-T Cell Therapies CAR therapies involve the genetic modification of T cells to express synthetic receptors that merge the antigen-recognition capability of antibodies with the cytotoxic functions of T cells. This approach enables T cells to recognize and kill tumor cells in a highly specific, MHC-independent manner. CAR-T cell therapy has revolutionized the treatment of hematologic malignancies, now accounting for over half of all cellular therapies in clinical use or under development [ 116 117 118 119 Another possible approach to targeting B7-H3 in RMS is through directed CAR-T cell therapy, which has led to complete tumor eradication in mouse models, confirming the strong therapeutic potential of this target in RMS [ 120 121 One of the earliest RMS-specific CAR-T targets identified was the γ-subunit of the fetal acetylcholine receptor (fAChR), which is minimally expressed in mature muscle after birth but remains in RMS tumors [ 122 123 124 125 126 127 127 Another promising target is Ephrin type-B receptor 4 (EPHB4), a member of the largest subfamily of receptor tyrosine kinases, which is overexpressed in various malignancies, including RMS [ 128 128 129 130 120 131 132 133 45 Other CAR-T cell therapies for RMS include autologous HER2-targeted CAR-T cells, CD56-targeted CAR-T cell therapy, and C7R-GD2 CAR-T cells [ 134 135 136 137 Despite these promising outcomes, CAR-T therapy for solid tumors, including RMS, remains challenging. A significant concern is on-target, off-tumor toxicity, due to shared antigen expression between tumors and healthy tissues. Therefore, advancing CAR-T therapy for RMS requires continued preclinical optimization of CAR design, the identification of truly tumor-specific antigens, and the rational combination of therapies to improve efficacy and safety. 3.4.2. CAR-NK Cells NK cells are innate immune effectors that can recognize and kill infected or malignant cells without prior sensitization. Their cytotoxic function is mediated through the release of perforin and granzymes, the expression of death receptor ligands, and the secretion of immunostimulatory cytokines [ 138 115 138 139 140 141 142 143 144 145 + 146 147 148 149 150 NK cells can also be genetically modified to express CARs, thereby enhancing their specificity and efficacy. Although CAR-NK cells are more challenging to engineer than CAR-T cells, they offer several advantages: they are better tolerated, can be activated without prior sensitization, and are capable of recognizing and responding to low levels of tumor-associated antigens (TAAs) [ 151 152 153 154 155 3.4.3. CAR-Cytokine Induced Killer (CIK) Cells Cytokine-induced killer (CIK) cells represent a heterogeneous population of polyclonal T lymphocytes that acquire phenotypic characteristics and cytotoxic functions resembling those of NK cells through specific culture conditions [ 156 157 158 158 159 159 160 Key Remark: While novel immunotherapies, such as CAR-T, CAR-NK, and checkpoint inhibitors, hold promise, their efficacy in pediatric oral RMS remains limited by poor immune infiltration and immunosuppressive feedback loops. Combination strategies and improved immune engineering may enhance therapeutic outcomes. Figure 2 4. Challenges and Future Directions Although promising advances have been made in immunotherapeutic strategies for pediatric oral RMS, several key challenges still hinder their clinical success and broader adoption. These obstacles are multifaceted, involving biological complexities specific to pediatric tumors, technical issues with therapeutic delivery, ethical concerns in treating children, and the urgent need for reliable biomarkers to support precision medicine approaches [ 161 162 4.1. Integrating Immunotherapy with Standard Treatments The integration of immunotherapies, such as checkpoint inhibitors or CAR-T cell therapy, with existing chemotherapy and radiation therapy regimens presents both opportunities and challenges. Standard treatments often cause immunosuppressive effects, including loss of lymphocytes and cytokine dysregulation, which can potentially diminish the effectiveness of immunotherapies [ 29 163 4.2. Biological and Developmental Barriers in Pediatric Tumors Unlike adult cancers, pediatric RMS frequently shows a low TMB, limited neoantigen expression, and a generally “immune-cold” TME. These elements result in poor immunogenicity and a less effective response to checkpoint blockade therapies. Additionally, fusion-positive RMS subtypes, such as those with PAX3:FOXO1 rearrangements, actively inhibit antigen processing and MHC-I expression, further aiding immune evasion. Since pediatric tumors exhibit developmental differences, further research is needed to understand how immune checkpoint regulation occurs during development and how to target the tumor’s immunoediting abilities without harming normal tissue development [ 164 165 4.3. Technical and Ethical Constraints in Pediatric Immunotherapy Technical limitations, such as cell manufacturing scalability, T cell exhaustion, and cytokine release syndrome (CRS), become more pronounced in pediatric settings where patient weight, immune maturity, and tolerance to systemic toxicity vary greatly [ 166 167 168 4.4. The Biomarker Gap: Stratifying Patients for Response A significant unmet need is the identification of predictive biomarkers to classify patients who are likely to benefit from immunotherapy. For example, expression levels of PD-L1, CD276 (B7-H3), or tumor-infiltrating lymphocyte (TIL) profiles could serve as early indicators of treatment success. However, these biomarkers have not been validated in large pediatric RMS groups, and inter-tumoral heterogeneity remains a confounding factor [ 109 36 4.5. Personalizing Immuno-Oncology for Pediatric Rhabdomyosarcoma The future of RMS immunotherapy relies on precision and personalization. Combining immunotherapy with epigenetic modulators, targeted therapies (e.g., FGFR4 and CXCR4 inhibitors), and agents that reprogram metabolism could significantly transform the immune landscape. Additionally, personalized cancer vaccines based on neoantigen profiling and adoptive T cell therapies targeting patient-specific tumor antigens may redefine treatment standards [ 169 170 4.6. Looking Forward: Translational and Collaborative Imperatives To translate immuno-oncology research into clinical practice for pediatric RMS, interdisciplinary collaboration is essential. Ongoing efforts, such as the INFORM registry and Pediatric MATCH trial, are beginning to connect molecular profiling with immunotherapy eligibility [ 171 172 173 Key Remark: Progress in pediatric RMS immunotherapy requires age-specific approaches, ethical sensitivity, and precision medicine tools. Emphasis should be placed on immune profiling, rational combinations with standard therapy, and development of robust pediatric immuno-oncology clinical trial frameworks. 5. Conclusions Pediatric RMS remains a rare but aggressive malignancy marked by a profoundly immunosuppressive TIME dominated by M2-polarized macrophages, regulatory T cells, and myeloid-derived suppressor cells. These immune cells, combined with mechanisms such as T cell exhaustion, a low neoantigen burden, and downregulation of MHC class I expression, collectively impair anti-tumor immunity, positioning pediatric RMS as an “immune-cold” tumor with limited responsiveness to conventional immunotherapies. Emerging immunotherapeutic strategies, including CAR-T, CAR-NK, and CAR-CIK cell therapies; checkpoint inhibitors; oncolytic viruses; and cancer vaccines, show promise in overcoming these barriers. However, their clinical translation remains constrained by challenges such as poor immune cell infiltration, antigen heterogeneity, developmental and ethical considerations in pediatric patients, and the absence of validated predictive biomarkers. Notably, combinatorial approaches that integrate immunotherapy with conventional treatments, epigenetic modulators, or metabolic reprogramming agents may enhance antigen presentation, reprogram the TIME, and improve immune cell trafficking into tumors. Future research should prioritize biomarker-driven patient selection, age-specific immune profiling, and adaptive clinical trial designs that accommodate the biological and ethical complexities of pediatric oncology. Rational combination therapies that aimed at converting “cold” tumors into “hot” immune phenotypes hold particular promise for improving response rates and long-term outcomes. A multidisciplinary, collaborative approach, incorporating immunology, oncology, pediatrics, and bioengineering, will be essential for translating laboratory findings into safe, effective, and durable immunotherapeutic strategies that improve survival while preserving quality of life in children with RMS. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, O.A.E.M. and I.M.T.; writing—original draft preparation, O.A.E.M., N.M.E., W.A.H. and I.M.T.; writing—review and editing, O.A.E.M., N.M.E., W.A.H. and I.M.T. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Pathania A.S. Immune Microenvironment in Childhood Cancers: Characteristics and Therapeutic Challenges Cancers 2024 16 2201 10.3390/cancers16122201 38927907 PMC11201451 2. Bosse K.R. Majzner R.G. Mackall C.L. Maris J.M. Immune-Based Approaches for the Treatment of Pediatric Malignancies Annu. Rev. Cancer Biol. 2020 4 353 370 10.1146/annurev-cancerbio-030419-033436 34113750 PMC8189419 3. Hutzen B. Paudel S.N. Naeimi Kararoudi M. Cassady K.A. Lee D.A. Cripe T.P. Immunotherapies for pediatric cancer: Current landscape and future perspectives Cancer Metastasis Rev. 2019 38 573 594 10.1007/s10555-019-09819-z 31828566 PMC6994452 4. Malempati S. Hawkins D.S. Rhabdomyosarcoma: Review of the Children’s Oncology Group (COG) Soft-Tissue Sarcoma Committee experience and rationale for current COG studies Pediatr. Blood Cancer 2012 59 5 10 10.1002/pbc.24118 22378628 PMC4008325 5. Agaram N.P. Evolving classification of rhabdomyosarcoma Histopathology 2022 80 98 108 10.1111/his.14449 34958505 PMC9425116 6. Ognjanovic S. Linabery A.M. Charbonneau B. Ross J.A. Trends in childhood rhabdomyosarcoma incidence and survival in the United States, 1975–2005 Cancer 2009 115 4218 4226 10.1002/cncr.24465 19536876 PMC2953716 7. Rudzinski E.R. Anderson J.R. Chi Y.Y. Gastier-Foster J.M. Astbury C. Barr F.G. Skapek S.X. Hawkins D.S. Weigel B.J. Pappo A. Histology, fusion status, and outcome in metastatic rhabdomyosarcoma: A report from the Children’s Oncology Group Pediatr. Blood Cancer 2017 64 e26645 10.1002/pbc.26645 PMC5647228 28521080 8. Chen C. Garcia H.D. Scheer M. Henssen A.G. Current and Future Treatment Strategies for Rhabdomyosarcoma Front. Oncol. 2019 9 1458 10.3389/fonc.2019.01458 31921698 PMC6933601 9. Van Tilburg C.M. Pfaff E. Pajtler K.W. Langenberg K.P.S. Fiesel P. Jones B.C. Balasubramanian G.P. Stark S. Johann P.D. Blattner-Johnson M. The Pediatric Precision Oncology INFORM Registry: Clinical Outcome and Benefit for Patients with Very High-Evidence Targets Cancer Discov. 2021 11 2764 2779 10.1158/2159-8290.CD-21-0094 34373263 PMC9414287 10. Dasgupta R. Fuchs J. Rodeberg D. Rhabdomyosarcoma Semin. Pediatr. Surg. 2016 25 276 283 10.1053/j.sempedsurg.2016.09.011 27955730 11. Crist W.M. Anderson J.R. Meza J.L. Fryer C. Raney R.B. Ruymann F.B. Breneman J. Qualman S.J. Wiener E. Wharam M. Intergroup rhabdomyosarcoma study-IV: Results for patients with nonmetastatic disease J. Clin. Oncol. 2001 19 3091 3102 10.1200/JCO.2001.19.12.3091 11408506 12. Dinakar J. Gowri S. Tryphena E.T.A. Alveolar type of rhabdomyosarcoma of maxilla-A case report J. Oral Maxillofac. Pathol. 2023 27 406 410 10.4103/jomfp.jomfp_534_22 37854913 PMC10581309 13. Skapek S.X. Ferrari A. Gupta A.A. Lupo P.J. Butler E. Shipley J. Barr F.G. Hawkins D.S. Rhabdomyosarcoma Nat. Rev. Dis. Primers 2019 5 1 10.1038/s41572-018-0051-2 30617281 PMC7456566 14. Rogers T.N. Dasgupta R. Management of Rhabdomyosarcoma in Pediatric Patients Surg. Oncol. Clin. N. Am. 2021 30 339 353 10.1016/j.soc.2020.11.003 33706904 15. Raney R.B. Maurer H.M. Anderson J.R. Andrassy R.J. Donaldson S.S. Qualman S.J. Wharam M.D. Wiener E.S. Crist W.M. The Intergroup Rhabdomyosarcoma Study Group (IRSG): Major Lessons From the IRS-I Through IRS-IV Studies as Background for the Current IRS-V Treatment Protocols Sarcoma 2001 5 9 15 10.1080/13577140120048890 18521303 PMC2395450 16. Crompton B.D. Stewart C. Taylor-Weiner A. Alexe G. Kurek K.C. Calicchio M.L. Kiezun A. Carter S.L. Shukla S.A. Mehta S.S. The genomic landscape of pediatric Ewing sarcoma Cancer Discov. 2014 4 1326 1341 10.1158/2159-8290.CD-13-1037 25186949 17. Shern J.F. Chen L. Chmielecki J. Wei J.S. Patidar R. Rosenberg M. Ambrogio L. Auclair D. Wang J. Song Y.K. Comprehensive genomic analysis of rhabdomyosarcoma reveals a landscape of alterations affecting a common genetic axis in fusion-positive and fusion-negative tumors Cancer Discov. 2014 4 216 231 10.1158/2159-8290.CD-13-0639 24436047 PMC4462130 18. Chen D.S. Mellman I. Elements of cancer immunity and the cancer-immune set point Nature 2017 541 321 330 10.1038/nature21349 28102259 19. Wessel K.M. Kaplan R.N. Targeting tumor microenvironment and metastasis in children with solid tumors Curr. Opin. Pediatr. 2022 34 53 60 10.1097/MOP.0000000000001082 34812775 PMC8728685 20. Singh S. Abu-Zaid A. Jin H. Fang J. Wu Q. Wang T. Feng H. Quarni W. Shao Y. Maxham L. Targeting KDM4 for treating PAX3-FOXO1-driven alveolar rhabdomyosarcoma Sci. Transl. Med. 2022 14 eabq2096 10.1126/scitranslmed.abq2096 35857643 PMC9548378 21. Thorsson V. Gibbs D.L. Brown S.D. Wolf D. Bortone D.S. Ou Yang T.H. Porta-Pardo E. Gao G.F. Plaisier C.L. Eddy J.A. The Immune Landscape of Cancer Immunity 2018 48 812 830.e814 10.1016/j.immuni.2018.03.023 29628290 PMC5982584 22. Emens L.A. Romero P.J. Anderson A.C. Bruno T.C. Capitini C.M. Collyar D. Gulley J.L. Hwu P. Posey A.D. Jr. Silk A.W. Challenges and opportunities in cancer immunotherapy: A Society for Immunotherapy of Cancer (SITC) strategic vision J. Immunother. Cancer 2024 12 e009063 10.1136/jitc-2024-009063 38901879 PMC11191773 23. Sherif S. Roelands J. Mifsud W. Ahmed E.I. Raynaud C.M. Rinchai D. Sathappan A. Maaz A. Saleh A. Ozer E. The immune landscape of solid pediatric tumors J. Exp. Clin. Cancer Res. 2022 41 199 10.1186/s13046-022-02397-z 35690832 PMC9188257 24. Terry R.L. Meyran D. Fleuren E.D.G. Mayoh C. Zhu J. Omer N. Ziegler D.S. Haber M. Darcy P.K. Trapani J.A. Chimeric Antigen Receptor T cell Therapy and the Immunosuppressive Tumor Microenvironment in Pediatric Sarcoma Cancers 2021 13 4704 10.3390/cancers13184704 34572932 PMC8465026 25. Gomez S. Tabernacki T. Kobyra J. Roberts P. Chiappinelli K.B. Combining epigenetic and immune therapy to overcome cancer resistance Semin. Cancer Biol. 2020 65 99 113 10.1016/j.semcancer.2019.12.019 31877341 PMC7308208 26. De la Nava D. Selvi K.M. Alonso M.M. Immunovirotherapy for Pediatric Solid Tumors: A Promising Treatment That is Becoming a Reality Front. Immunol. 2022 13 866892 10.3389/fimmu.2022.866892 35493490 PMC9043602 27. Miwa S. Yamamoto N. Hayashi K. Takeuchi A. Igarashi K. Tsuchiya H. Recent Advances and Challenges in the Treatment of Rhabdomyosarcoma Cancers 2020 12 1758 10.3390/cancers12071758 32630642 PMC7409313 28. Olsen H.E. Lynn G.M. Valdes P.A. Cerecedo Lopez C.D. Ishizuka A.S. Arnaout O. Bi W.L. Peruzzi P.P. Chiocca E.A. Friedman G.K. Therapeutic cancer vaccines for pediatric malignancies: Advances, challenges, and emerging technologies Neuro-Oncol. Adv. 2021 3 vdab027 10.1093/noajnl/vdab027 33860227 PMC8034661 29. Morel V.J. Rossler J. Bernasconi M. Targeted immunotherapy and nanomedicine for rhabdomyosarcoma: The way of the future Med. Res. Rev. 2024 44 2730 2773 10.1002/med.22059 38885148 30. Panagi M. Pilavaki P. Constantinidou A. Stylianopoulos T. Immunotherapy in soft tissue and bone sarcoma: Unraveling the barriers to effectiveness Theranostics 2022 12 6106 6129 10.7150/thno.72800 36168619 PMC9475460 31. Arneth B. Tumor Microenvironment Medicina 2019 56 15 10.3390/medicina56010015 31906017 PMC7023392 32. Anderson N.M. Simon M.C. The tumor microenvironment Curr. Biol. 2020 30 R921 R925 10.1016/j.cub.2020.06.081 32810447 PMC8194051 33. Chaudhary B. Elkord E. Regulatory T Cells in the Tumor Microenvironment and Cancer Progression: Role and Therapeutic Targeting Vaccines 2016 4 28 10.3390/vaccines4030028 27509527 PMC5041022 34. Strizova Z. Benesova I. Bartolini R. Novysedlak R. Cecrdlova E. Foley L.K. Striz I. M1/M2 macrophages and their overlaps—Myth or reality? Clin. Sci. 2023 137 1067 1093 10.1042/CS20220531 PMC10407193 37530555 35. Peng Y. Zhou M. Yang H. Qu R. Qiu Y. Hao J. Bi H. Guo D. Regulatory Mechanism of M1/M2 Macrophage Polarization in the Development of Autoimmune Diseases Mediat. Inflamm. 2023 2023 8821610 10.1155/2023/8821610 37332618 PMC10270764 36. DeMartino J. Meister M.T. Visser L.L. Brok M. Groot Koerkamp M.J.A. Wezenaar A.K.L. Hiemcke-Jiwa L.S. de Souza T. Merks J.H.M. Rios A.C. Single-cell transcriptomics reveals immune suppression and cell states predictive of patient outcomes in rhabdomyosarcoma Nat. Commun. 2023 14 3074 10.1038/s41467-023-38886-8 37244912 PMC10224926 37. Rutland C.D. Gedallovich J. Wang A. Zdravkovic S. Varma S. Hornick J.L. Charville G.W. Diagnostic utility of FOXO1 immunohistochemistry for rhabdomyosarcoma classification Histopathology 2023 83 49 56 10.1111/his.14898 36860202 38. Feng G. Guo Y. Chen M. Zhang Y. Liu Z. Sun C. Hu X. Lin C. Liu Y. Wu Y. Schwann Cell-Mediated M2-Like Macrophage Polarization in Rhabdomyosarcoma Oral Dis. 2025 31 1140 1153 10.1111/odi.15214 39639424 39. Munisamy S. Radhakrishnan A.K. Ramdas P. Samuel P.J. Singh V.A. Immune Biomarkers in Blood from Sarcoma Patients: A Pilot Study Curr. Oncol. 2022 29 5585 5603 10.3390/curroncol29080441 36005179 PMC9406743 40. Gutkin D.W. Shurin M.R. Clinical evaluation of systemic and local immune responses in cancer: Time for integration Cancer Immunol. Immunother. 2014 63 45 57 10.1007/s00262-013-1480-0 24100804 PMC4018188 41. Zhang Y. Guo J. Jia R. Treg: A Promising Immunotherapeutic Target in Oral Diseases Front. Immunol. 2021 12 667862 10.3389/fimmu.2021.667862 34177907 PMC8222692 42. Surendran S. Aboelkheir U. Tu A.A. Magner W.J. Sigurdson S.L. Merzianu M. Hicks W.L. Jr. Suresh A. Kirkwood K.L. Kuriakose M.A. T-Cell Infiltration and Immune Checkpoint Expression Increase in Oral Cavity Premalignant and Malignant Disorders Biomedicines 2022 10 1840 10.3390/biomedicines10081840 36009387 PMC9404942 43. Maggi E. Munari E. Landolina N. Mariotti F.R. Azzarone B. Moretta L. T cell landscape in the microenvironment of human solid tumors Immunol. Lett. 2024 270 106942 10.1016/j.imlet.2024.106942 39486594 44. Ozaniak A. Vachtenheim J. Jr. Lischke R. Bartunkova J. Strizova Z. Novel Insights into the Immunotherapy of Soft Tissue Sarcomas: Do We Need a Change of Perspective? Biomedicines 2021 9 935 10.3390/biomedicines9080935 34440139 PMC8393686 45. Tian M. Wei J.S. Cheuk A.T. Milewski D. Zhang Z. Kim Y.Y. Chou H.C. Liu C. Badr S. Pope E.G. CAR T-cells targeting FGFR4 and CD276 simultaneously show potent antitumor effect against childhood rhabdomyosarcoma Nat. Commun. 2024 15 6222 10.1038/s41467-024-50251-x 39043633 PMC11266617 46. Davicioni E. Anderson J.R. Buckley J.D. Meyer W.H. Triche T.J. Gene expression profiling for survival prediction in pediatric rhabdomyosarcomas: A report from the children’s oncology group J. Clin. Oncol. 2010 28 1240 1246 10.1200/JCO.2008.21.1268 20124188 PMC3040045 47. Kather J.N. Horner C. Weis C.A. Aung T. Vokuhl C. Weiss C. Scheer M. Marx A. Simon-Keller K. CD163 + + Sci. Rep. 2019 9 9211 10.1038/s41598-019-45551-y 31239476 PMC6592899 48. Lee K.Y. Wong H.Y. Zeng Q. Le Lin J. Cheng M.S. Kuick C.H. Chang K.T.E. Loh A.H.P. Schwarz H. Ectopic CD137 expression by rhabdomyosarcoma provides selection advantages but allows immunotherapeutic targeting Oncoimmunology 2021 10 1877459 10.1080/2162402X.2021.1877459 33643694 PMC7872024 49. Preglej T. Ellmeier W. CD4(+) Cytotoxic T cells—Phenotype, Function and Transcriptional Networks Controlling Their Differentiation Pathways Immunol. Lett. 2022 247 27 42 10.1016/j.imlet.2022.05.001 35568324 50. Xie N. Shen G. Gao W. Huang Z. Huang C. Fu L. Neoantigens: Promising targets for cancer therapy Signal Transduct. Target. Ther. 2023 8 9 10.1038/s41392-022-01270-x 36604431 PMC9816309 51. Belgiovine C. Mebelli K. Raffaele A. De Cicco M. Rotella J. Pedrazzoli P. Zecca M. Riccipetitoni G. Comoli P. Pediatric Solid Cancers: Dissecting the Tumor Microenvironment to Improve the Results of Clinical Immunotherapy Int. J. Mol. Sci. 2024 25 3225 10.3390/ijms25063225 38542199 PMC10970338 52. Chen H. Sameshima J. Yokomizo S. Sueyoshi T. Nagano H. Miyahara Y. Sakamoto T. Fujii S. Kiyoshima T. Guy T. Expansion of CD4 + Front. Immunol. 2023 14 1305783 10.3389/fimmu.2023.1305783 38077321 PMC10702345 53. Li K. Shi H. Zhang B. Ou X. Ma Q. Chen Y. Shu P. Li D. Wang Y. Myeloid-derived suppressor cells as immunosuppressive regulators and therapeutic targets in cancer Signal Transduct. Target. Ther. 2021 6 362 10.1038/s41392-021-00670-9 34620838 PMC8497485 54. He S. Zheng L. Qi C. Myeloid-derived suppressor cells (MDSCs) in the tumor microenvironment and their targeting in cancer therapy Mol. Cancer 2025 24 5 10.1186/s12943-024-02208-3 39780248 PMC11707952 55. Youn J.I. Nagaraj S. Collazo M. Gabrilovich D.I. Subsets of myeloid-derived suppressor cells in tumor-bearing mice J. Immunol. 2008 181 5791 5802 10.4049/jimmunol.181.8.5791 18832739 PMC2575748 56. Highfill S.L. Cui Y. Giles A.J. Smith J.P. Zhang H. Morse E. Kaplan R.N. Mackall C.L. Disruption of CXCR2-mediated MDSC tumor trafficking enhances anti-PD1 efficacy Sci. Transl. Med. 2014 6 237ra267 10.1126/scitranslmed.3007974 PMC6980372 24848257 57. Nomikos J. Wunker C. Waspe A.C. Babichev Y. Piorkowska K. Wong S. Foltz W. Gerstle J.T. Demicco E.G. Gupta A.A. Abstract A064 Characterizing the immune microenvironment and examining the effect of tumour-targeted MRgHIFU mediated hyperthermia in combination with thermosensitive liposomal doxorubicin in a mouse model of embryonal rhabdomyosarcoma Cancer Res. 2024 84 (Suppl. S17) A064 10.1158/1538-7445.PEDIATRIC24-A064 58. Chen L. Oke T. Siegel N. Cojocaru G. Tam A.J. Blosser R.L. Swailes J. Ligon J.A. Lebid A. Morris C. The Immunosuppressive Niche of Soft-Tissue Sarcomas is Sustained by Tumor-Associated Macrophages and Characterized by Intratumoral Tertiary Lymphoid Structures Clin. Cancer Res. 2020 26 4018 4030 10.1158/1078-0432.CCR-19-3416 32332015 PMC8772618 59. Bien E. Krawczyk M. Izycka-Swieszewska E. Trzonkowski P. Kazanowska B. Adamkiewicz-Drozynska E. Balcerska A. Deregulated systemic IL-10/IL-12 balance in advanced and poor prognosis paediatric soft tissue sarcomas Biomarkers 2013 18 204 215 10.3109/1354750X.2013.764351 23557126 60. Sato T. Terai M. Tamura Y. Alexeev V. Mastrangelo M.J. Selvan S.R. Interleukin 10 in the tumor microenvironment: A target for anticancer immunotherapy Immunol. Res. 2011 51 170 182 10.1007/s12026-011-8262-6 22139852 61. Haque S. Morris J.C. Transforming growth factor-beta: A therapeutic target for cancer Hum. Vaccines Immunother. 2017 13 1741 1750 10.1080/21645515.2017.1327107 PMC5557219 28575585 62. Mellman I. Coukos G. Dranoff G. Cancer immunotherapy comes of age Nature 2011 480 480 489 10.1038/nature10673 22193102 PMC3967235 63. Zhang Z. Zhou X. Guo J. Zhang F. Qian Y. Wang G. Duan M. Wang Y. Zhao H. Yang Z. TA-MSCs, TA-MSCs-EVs, MIF: Their crosstalk in immunosuppressive tumor microenvironment J. Transl. Med. 2022 20 320 10.1186/s12967-022-03528-y 35842634 PMC9287873 64. Zhang Y. Katkhada K. Meng L.Z. Zhao B. Tong S. Chaabane W. Kallai A. Tobin N.P. Ostman A. Mega A. Myogenic IGFBP5 levels in rhabdomyosarcoma are nourished by mesenchymal stromal cells and regulate growth arrest and apoptosis Cell Commun. Signal. 2025 23 184 10.1186/s12964-025-02171-6 40234830 PMC12001570 65. Drouillard D. Craig B.T. Dwinell M.B. Physiology of chemokines in the cancer microenvironment Am. J. Physiol. Cell Physiol. 2023 324 C167 C182 10.1152/ajpcell.00151.2022 36317799 PMC9829481 66. Wu Y. Yi M. Niu M. Mei Q. Wu K. Myeloid-derived suppressor cells: An emerging target for anticancer immunotherapy Mol. Cancer 2022 21 184 10.1186/s12943-022-01657-y 36163047 PMC9513992 67. Dahmani A. Delisle J.S. TGF-β in T Cell Biology: Implications for Cancer Immunotherapy Cancers 2018 10 194 10.3390/cancers10060194 29891791 PMC6025055 68. Quamine A.E. Olsen M.R. Cho M.M. Capitini C.M. Approaches to Enhance Natural Killer Cell-Based Immunotherapy for Pediatric Solid Tumors Cancers 2021 13 2796 10.3390/cancers13112796 34199783 PMC8200074 69. Milewski D. Tian M. Kim Y. Wei J. Khan J. Abstract 6736: Suppression of antigen presentation is a hallmark of pediatric rhabdomyosarcoma Cancer Res. 2023 83 (Suppl. S7) 6736 10.1158/1538-7445.AM2023-6736 70. Gabrych A. Peksa R. Kunc M. Krawczyk M. Izycka-Swieszewska E. Biernat W. Bien E. The PD-L1/PD-1 axis expression on tumor-infiltrating immune cells and tumor cells in pediatric rhabdomyosarcoma Pathol. Res. Pract. 2019 215 152700 10.1016/j.prp.2019.152700 31704149 71. Zhang H. Pang Y. Yi L. Wang X. Wei P. Wang H. Lin S. Epigenetic regulators combined with tumour immunotherapy: Current status and perspectives Clin. Epigenetics 2025 17 51 10.1186/s13148-025-01856-6 40119465 PMC11929245 72. Lavoie R.R. Gargollo P.C. Ahmed M.E. Kim Y. Baer E. Phelps D.A. Charlesworth C.M. Madden B.J. Wang L. Houghton P.J. Surfaceome Profiling of Rhabdomyosarcoma Reveals B7-H3 as a Mediator of Immune Evasion Cancers 2021 13 4528 10.3390/cancers13184528 34572755 PMC8466404 73. Getu A.A. Tigabu A. Zhou M. Lu J. Fodstad O. Tan M. New frontiers in immune checkpoint B7-H3 (CD276) research and drug development Mol. Cancer 2023 22 43 10.1186/s12943-023-01751-9 36859240 PMC9979440 74. Miwa S. Nishida H. Tsuchiya H. Current status of immunotherapy for sarcomas Immunotherapy 2017 9 1331 1338 10.2217/imt-2017-0101 29185391 75. Weiner L.M. Surana R. Wang S. Monoclonal antibodies: Versatile platforms for cancer immunotherapy Nat. Rev. Immunol. 2010 10 317 327 10.1038/nri2744 20414205 PMC3508064 76. Tsuchikama K. Anami Y. Ha S.Y.Y. Yamazaki C.M. Exploring the next generation of antibody–drug conjugates Nat. Rev. Clin. Oncol. 2024 21 203 223 10.1038/s41571-023-00850-2 38191923 77. Propper D.J. Balkwill F.R. Harnessing cytokines and chemokines for cancer therapy Nat. Rev. Clin. Oncol. 2022 19 237 253 10.1038/s41571-021-00588-9 34997230 78. Rosenberg S.A. Restifo N.P. Yang J.C. Morgan R.A. Dudley M.E. Adoptive cell transfer: A clinical path to effective cancer immunotherapy Nat. Rev. Cancer 2008 8 299 308 10.1038/nrc2355 18354418 PMC2553205 79. Kaufman H.L. Kohlhapp F.J. Zloza A. Oncolytic viruses: A new class of immunotherapy drugs Nat. Rev. Drug Discov. 2015 14 642 662 10.1038/nrd4663 26323545 PMC7097180 80. Saxena M. van der Burg S.H. Melief C.J.M. Bhardwaj N. Therapeutic cancer vaccines Nat. Rev. Cancer 2021 21 360 378 10.1038/s41568-021-00346-0 33907315 81. Wang L. Geng H. Liu Y. Liu L. Chen Y. Wu F. Liu Z. Ling S. Wang Y. Zhou L. Hot and cold tumors: Immunological features and the therapeutic strategies MedComm 2023 4 e343 10.1002/mco2.343 37638340 PMC10458686 82. Ren X. Guo S. Guan X. Kang Y. Liu J. Yang X. Immunological Classification of Tumor Types and Advances in Precision Combination Immunotherapy Front. Immunol. 2022 13 790113 10.3389/fimmu.2022.790113 35296094 PMC8918549 83. Simon A.K. Hollander G.A. McMichael A. Evolution of the immune system in humans from infancy to old age Proc. Biol. Sci. 2015 282 20143085 10.1098/rspb.2014.3085 26702035 PMC4707740 84. Gröbner S.N. Worst B.C. Weischenfeldt J. Buchhalter I. Kleinheinz K. Rudneva V.A. Johann P.D. Balasubramanian G.P. Segura-Wang M. Brabetz S. The landscape of genomic alterations across childhood cancers Nature 2018 555 321 327 10.1038/nature25480 29489754 85. Brien G.L. Stegmaier K. Armstrong S.A. Targeting chromatin complexes in fusion protein-driven malignancies Nat. Rev. Cancer 2019 19 255 269 10.1038/s41568-019-0132-x 30962549 86. Dyson K.A. Stover B.D. Grippin A. Mendez-Gomez H.R. Lagmay J. Mitchell D.A. Sayour E.J. Emerging trends in immunotherapy for pediatric sarcomas J. Hematol. Oncol. 2019 12 78 10.1186/s13045-019-0756-z 31311607 PMC6636007 87. Casey D.L. Cheung N.V. Immunotherapy of Pediatric Solid Tumors: Treatments at a Crossroads, with an Emphasis on Antibodies Cancer Immunol. Res. 2020 8 161 166 10.1158/2326-6066.CIR-19-0692 32015013 PMC7058412 88. Long A.H. Morgenstern D.A. Leruste A. Bourdeaut F. Davis K.L. Checkpoint Immunotherapy in Pediatrics: Here, Gone, and Back Again American Society of Clinical Oncology Educational Book American Society of Clinical Oncology (ASCO) Alexandria, VA, USA 2022 781 794 10.1200/EDBK_349799 35580293 89. Chowdhury F. Dunn S. Mitchell S. Mellows T. Ashton-Key M. Gray J.C. PD-L1 and CD8 + + OncoImmunology 2015 4 e1029701 10.1080/2162402X.2015.1029701 90. Wang Y. Shelton S.E. Kastrunes G. Barbie D.A. Freeman G.J. Marasco W.A. Preclinical models for development of immune-oncology therapies Immuno-Oncol. Insights 2022 3 379 398 10.18609/ioi.2022.41 37132013 PMC10150782 91. Yan C. Yang Q. Zhang S. Millar D.G. Alpert E.J. Do D. Veloso A. Brunson D.C. Drapkin B.J. Stanzione M. Single-cell imaging of T cell immunotherapy responses in vivo J. Exp. Med. 2021 218 e20210314 10.1084/jem.20210314 34415995 PMC8383813 92. Rytlewski J. Milhem M.M. Monga V. Turning ‘Cold’ tumors ‘Hot’: Immunotherapies in sarcoma Ann. Transl. Med. 2021 9 1039 10.21037/atm-20-6041 34277839 PMC8267323 93. Jacob W. James I. Hasmann M. Weisser M. Clinical development of HER3-targeting monoclonal antibodies: Perils and progress Cancer Treat. Rev. 2018 68 111 123 10.1016/j.ctrv.2018.06.011 29944978 94. Ferrara N. Hillan K.J. Gerber H.P. Novotny W. Discovery and development of bevacizumab, an anti-VEGF antibody for treating cancer Nat. Rev. Drug Discov. 2004 3 391 400 10.1038/nrd1381 15136787 95. Verma S. Miles D. Gianni L. Krop I.E. Welslau M. Baselga J. Pegram M. Oh D.Y. Diéras V. Guardino E. Trastuzumab emtansine for HER2-positive advanced breast cancer N. Engl. J. Med. 2012 367 1783 1791 10.1056/NEJMoa1209124 23020162 PMC5125250 96. Hubert P. Amigorena S. Antibody-dependent cell cytotoxicity in monoclonal antibody-mediated tumor immunotherapy Oncoimmunology 2012 1 103 105 10.4161/onci.1.1.17963 22720225 PMC3376972 97. Wei S.C. Levine J.H. Cogdill A.P. Zhao Y. Anang N.A.S. Andrews M.C. Sharma P. Wang J. Wargo J.A. Pe’er D. Distinct Cellular Mechanisms Underlie Anti-CTLA-4 and Anti-PD-1 Checkpoint Blockade Cell 2017 170 1120 1133.e1117 10.1016/j.cell.2017.07.024 28803728 PMC5591072 98. Pardoll D.M. The blockade of immune checkpoints in cancer immunotherapy Nat. Rev. Cancer 2012 12 252 264 10.1038/nrc3239 22437870 PMC4856023 99. Saerens M. Brusselaers N. Rottey S. Decruyenaere A. Creytens D. Lapeire L. Immune checkpoint inhibitors in treatment of soft-tissue sarcoma: A systematic review and meta-analysis Eur. J. Cancer 2021 152 165 182 10.1016/j.ejca.2021.04.034 34107450 100. Bertolini G. Bergamaschi L. Ferrari A. Renne S.L. Collini P. Gardelli C. Barisella M. Centonze G. Chiaravalli S. Paolino C. PD-L1 assessment in pediatric rhabdomyosarcoma: A pilot study BMC Cancer 2018 18 652 10.1186/s12885-018-4554-8 29898687 PMC6001160 101. Kim C. Kim E.K. Jung H. Chon H.J. Han J.W. Shin K.H. Hu H. Kim K.S. Choi Y.D. Kim S. Prognostic implications of PD-L1 expression in patients with soft tissue sarcoma BMC Cancer 2016 16 434 10.1186/s12885-016-2451-6 27393385 PMC4938996 102. Petitprez F. de Reyniès A. Keung E.Z. Chen T.W. Sun C.M. Calderaro J. Jeng Y.M. Hsiao L.P. Lacroix L. Bougoüin A. B cells are associated with survival and immunotherapy response in sarcoma Nature 2020 577 556 560 10.1038/s41586-019-1906-8 31942077 103. Italiano A. Bessede A. Pulido M. Bompas E. Piperno-Neumann S. Chevreau C. Penel N. Bertucci F. Toulmonde M. Bellera C. Pembrolizumab in soft-tissue sarcomas with tertiary lymphoid structures: A phase 2 PEMBROSARC trial cohort Nat. Med. 2022 28 1199 1206 10.1038/s41591-022-01821-3 35618839 104. Davis K.L. Fox E. Merchant M.S. Reid J.M. Kudgus R.A. Liu X. Minard C.G. Voss S. Berg S.L. Weigel B.J. Nivolumab in children and young adults with relapsed or refractory solid tumours or lymphoma (ADVL1412): A multicentre, open-label, single-arm, phase 1-2 trial Lancet Oncol. 2020 21 541 550 10.1016/S1470-2045(20)30023-1 32192573 PMC7255545 105. Merchant M.S. Wright M. Baird K. Wexler L.H. Rodriguez-Galindo C. Bernstein D. Delbrook C. Lodish M. Bishop R. Wolchok J.D. Phase I Clinical Trial of Ipilimumab in Pediatric Patients with Advanced Solid Tumors Clin. Cancer Res. 2016 22 1364 1370 10.1158/1078-0432.CCR-15-0491 26534966 PMC5027962 106. Liu J. Liu P. Gong F. Tian Y. Zhao X. Case Report: A PD-L1-Positive Patient With Pleomorphic Rhabdomyosarcoma Achieving an Impressive Response to Immunotherapy Front. Immunol. 2022 13 815598 10.3389/fimmu.2022.815598 35371041 PMC8968025 107. Timpanaro A. Piccand C. Uldry A.C. Bode P.K. Dzhumashev D. Sala R. Heller M. Rössler J. Bernasconi M. Surfaceome Profiling of Cell Lines and Patient-Derived Xenografts Confirm FGFR4, NCAM1, CD276, and Highlight AGRL2, JAM3, and L1CAM as Surface Targets for Rhabdomyosarcoma Int. J. Mol. Sci. 2023 24 2601 10.3390/ijms24032601 36768928 PMC9917031 108. Kendsersky N.M. Lindsay J. Kolb E.A. Smith M.A. Teicher B.A. Erickson S.W. Earley E.J. Mosse Y.P. Martinez D. Pogoriler J. The B7-H3-Targeting Antibody-Drug Conjugate m276-SL-PBD Is Potently Effective Against Pediatric Cancer Preclinical Solid Tumor Models Clin. Cancer Res. 2021 27 2938 2946 10.1158/1078-0432.CCR-20-4221 33619171 PMC8127361 109. Rasic P. Jeremic M. Jeremic R. Dusanovic Pjevic M. Rasic M. Djuricic S.M. Milickovic M. Vukadin M. Mijovic T. Savic D. Targeting B7-H3—A Novel Strategy for the Design of Anticancer Agents for Extracranial Pediatric Solid Tumors Treatment Molecules 2023 28 3356 10.3390/molecules28083356 37110590 PMC10145344 110. Troitskaya O. Varlamov M. Nushtaeva A. Richter V. Koval O. Recombinant Lactaptin Induces Immunogenic Cell Death and Creates an Antitumor Vaccination Effect in Vivo with Enhancement by an IDO Inhibitor Molecules 2020 25 2804 10.3390/molecules25122804 32560527 PMC7355630 111. De Giovanni C. Nanni P. Landuzzi L. Ianzano M.L. Nicoletti G. Croci S. Palladini A. Lollini P.L. Immune targeting of autocrine IGF2 hampers rhabdomyosarcoma growth and metastasis BMC Cancer 2019 19 126 10.1186/s12885-019-5339-4 30732578 PMC6367747 112. Phelps M.P. Yang H. Patel S. Rahman M.M. McFadden G. Chen E. Oncolytic Virus-Mediated RAS Targeting in Rhabdomyosarcoma Mol. Ther. Oncolytics 2018 11 52 61 10.1016/j.omto.2018.09.001 30364635 PMC6197336 113. Merchant M.S. Bernstein D. Amoako M. Baird K. Fleisher T.A. Morre M. Steinberg S.M. Sabatino M. Stroncek D.F. Venkatasan A.M. Adjuvant Immunotherapy to Improve Outcome in High-Risk Pediatric Sarcomas Clin. Cancer Res. 2016 22 3182 3191 10.1158/1078-0432.CCR-15-2550 26823601 PMC7831150 114. Krishnadas D.K. Shusterman S. Bai F. Diller L. Sullivan J.E. Cheerva A.C. George R.E. Lucas K.G. A phase I trial combining decitabine/dendritic cell vaccine targeting MAGE-A1, MAGE-A3 and NY-ESO-1 for children with relapsed or therapy-refractory neuroblastoma and sarcoma Cancer Immunol. Immunother. 2015 64 1251 1260 10.1007/s00262-015-1731-3 26105625 PMC11028635 115. Hayes C. Cellular immunotherapies for cancer Ir. J. Med. Sci. 2021 190 41 57 10.1007/s11845-020-02264-w 32607912 PMC7326625 116. Lin H. Cheng J. Mu W. Zhou J. Zhu L. Advances in Universal CAR-T Cell Therapy Front. Immunol. 2021 12 744823 10.3389/fimmu.2021.744823 34691052 PMC8526896 117. Chung H. Jung H. Noh J.Y. Emerging Approaches for Solid Tumor Treatment Using CAR-T Cell Therapy Int. J. Mol. Sci. 2021 22 12126 10.3390/ijms222212126 34830003 PMC8621681 118. Thanindratarn P. Dean D.C. Nelson S.D. Hornicek F.J. Duan Z. Chimeric antigen receptor T (CAR-T) cell immunotherapy for sarcomas: From mechanisms to potential clinical applications Cancer Treat. Rev. 2020 82 101934 10.1016/j.ctrv.2019.101934 31794912 119. Kulczycka M. Derlatka K. Tasior J. Lejman M. Zawitkowska J. CAR T-Cell Therapy in Children with Solid Tumors J. Clin. Med. 2023 12 2326 10.3390/jcm12062326 36983330 PMC10051963 120. Timpanaro A. Piccand C. Dzhumashev D. Anton-Joseph S. Robbi A. Moser J. Rössler J. Bernasconi M. CD276-CAR T cells and Dual-CAR T cells targeting CD276/FGFR4 promote rhabdomyosarcoma clearance in orthotopic mouse models J. Exp. Clin. Cancer Res. 2023 42 293 10.1186/s13046-023-02838-3 37924157 PMC10625270 121. Lake J.A. Woods E. Hoffmeyer E. Schaller K.L. Cruz-Cruz J. Fernandez J. Tufa D. Kooiman B. Hall S.C. Jones D. Directing B7-H3 chimeric antigen receptor T cell homing through IL-8 induces potent antitumor activity against pediatric sarcoma J. Immunother. Cancer 2024 12 e009221 10.1136/jitc-2024-009221 39043604 PMC11268054 122. Gattenloehner S. Vincent A. Leuschner I. Tzartos S. Müller-Hermelink H.K. Kirchner T. Marx A. The fetal form of the acetylcholine receptor distinguishes rhabdomyosarcomas from other childhood tumors Am. J. Pathol. 1998 152 437 444 9466570 PMC1857958 123. Gattenlöhner S. Marx A. Markfort B. Pscherer S. Landmeier S. Juergens H. Müller-Hermelink H.K. Matthews I. Beeson D. Vincent A. Rhabdomyosarcoma lysis by T cells expressing a human autoantibody-based chimeric receptor targeting the fetal acetylcholine receptor Cancer Res. 2006 66 24 28 10.1158/0008-5472.CAN-05-0542 16397210 124. Simon-Keller K. Paschen A. Eichmüller S. Gattenlöhner S. Barth S. Koscielniak E. Leuschner I. Stöbel P. Hombach A. Abken H. Adoptive T-cell therapy of rhabdomyosarcoma Pathologe 2010 31 (Suppl. S2) 215 220 10.1007/s00292-010-1344-8 20730458 125. Simon-Keller K. Paschen A. Hombach A.A. Ströbel P. Coindre J.M. Eichmüller S.B. Vincent A. Gattenlöhner S. Hoppe F. Leuschner I. Survivin blockade sensitizes rhabdomyosarcoma cells for lysis by fetal acetylcholine receptor-redirected T cells Am. J. Pathol. 2013 182 2121 2131 10.1016/j.ajpath.2013.02.017 23562272 PMC5746952 126. Huang X. Park H. Greene J. Pao J. Mulvey E. Zhou S.X. Albert C.M. Moy F. Sachdev D. Yee D. IGF1R- and ROR1-Specific CAR T Cells as a Potential Therapy for High Risk Sarcomas PLoS ONE 2015 10 e0133152 10.1371/journal.pone.0133152 26173023 PMC4501840 127. Xiao W. Wang J. Wen X. Xu B. Que Y. Yu K. Xu L. Zhao J. Pan Q. Zhou P. Chimeric antigen receptor-modified T-cell therapy for platelet-derived growth factor receptor α-positive rhabdomyosarcoma Cancer 2020 126 (Suppl. S9) 2093 2100 10.1002/cncr.32764 32293729 128. Kubo H. Yagyu S. Nakamura K. Yamashima K. Tomida A. Kikuchi K. Iehara T. Nakazawa Y. Hosoi H. Development of non-viral, ligand-dependent, EPHB4-specific chimeric antigen receptor T cells for treatment of rhabdomyosarcoma Mol. Ther. Oncolytics 2021 20 646 658 10.1016/j.omto.2021.03.001 33816783 PMC7985479 129. Shivaprasad N. Xiong Y. Yohe M. Schneider D. Shern J. Baskar S. Dimitrov D. Sorenson P. Orentas R. Khan J. 649. Developing FGFR4 Chimeric Antigen Receptor CAR T Cell Therapy Against Rhabdomyosarcoma Mol. Ther. 2016 24 (Suppl. S1) S257 S258 10.1016/S1525-0016(16)33457-8 130. Alijaj N. Moutel S. Gouveia Z.L. Gray M. Roveri M. Dzhumashev D. Weber F. Meier G. Luciani P. Rössler J.K. Novel FGFR4-Targeting Single-Domain Antibodies for Multiple Targeted Therapies against Rhabdomyosarcoma Cancers 2020 12 3313 10.3390/cancers12113313 33182650 PMC7696840 131. Sullivan P.M. Kumar R. Li W. Hoglund V. Wang L. Zhang Y. Shi M. Beak D. Cheuk A. Jensen M.C. FGFR4-Targeted Chimeric Antigen Receptors Combined with Anti-Myeloid Polypharmacy Effectively Treat Orthotopic Rhabdomyosarcoma Mol. Cancer Ther. 2022 21 1608 1621 10.1158/1535-7163.MCT-22-0059 35877472 PMC9538595 132. Tian M. Wei J.S. Shivaprasad N. Highfill S.L. Gryder B.E. Milewski D. Brown G.T. Moses L. Song H. Wu J.T. Preclinical development of a chimeric antigen receptor T cell therapy targeting FGFR4 in rhabdomyosarcoma Cell Rep. Med. 2023 4 101212 10.1016/j.xcrm.2023.101212 37774704 PMC10591056 133. Xiao W. Xu L. Wang J. Yu K. Xu B. Que Y. Zhao J. Pan Q. Gao C. Zhou P. FGFR4-specific CAR-T cells with inducible caspase-9 suicide gene as an approach to treat rhabdomyosarcoma Cancer Gene Ther. 2024 31 1571 1584 10.1038/s41417-024-00823-2 39183354 PMC11489081 134. Jiang C. Zhao W. Qin M. Jin M. Chang L. Ma X. CD56-chimeric antigen receptor T-cell therapy for refractory/recurrent rhabdomyosarcoma: A 3.5-year follow-up case report Medicine 2019 98 e17572 10.1097/MD.0000000000017572 31651858 PMC6824760 135. Shum T. Omer B. Tashiro H. Kruse R.L. Wagner D.L. Parikh K. Yi Z. Sauer T. Liu D. Parihar R. Constitutive Signaling from an Engineered IL7 Receptor Promotes Durable Tumor Elimination by Tumor-Redirected T Cells Cancer Discov. 2017 7 1238 1247 10.1158/2159-8290.CD-17-0538 28830878 PMC5669830 136. Del Bufalo F. De Angelis B. Caruana I. Del Baldo G. De Ioris M.A. Serra A. Mastronuzzi A. Cefalo M.G. Pagliara D. Amicucci M. GD2-CART01 for Relapsed or Refractory High-Risk Neuroblastoma N. Engl. J. Med. 2023 388 1284 1295 10.1056/NEJMoa2210859 37018492 137. Pezzella M. Quintarelli C. Quadraccia M.C. Sarcinelli A. Manni S. Iaffaldano L. Ottaviani A. Ciccone R. Camera A. D’Amore M.L. Tumor-derived G-CSF induces an immunosuppressive microenvironment in an osteosarcoma model, reducing response to CAR.GD2 T-cells J. Hematol. Oncol. 2024 17 127 10.1186/s13045-024-01641-7 39695851 PMC11656657 138. Vivier E. Tomasello E. Baratin M. Walzer T. Ugolini S. Functions of natural killer cells Nat. Immunol. 2008 9 503 510 10.1038/ni1582 18425107 139. Mechtersheimer G. Staudter M. Majdic O. Dörken B. Moldenhauer G. Möller P. Expression of HLA-A,B,C, beta 2-microglobulin (beta 2m), HLA-DR, -DP, -DQ and of HLA-D-associated invariant chain (Ii) in soft-tissue tumors Int. J. Cancer 1990 46 813 823 10.1002/ijc.2910460512 2228310 140. Ljunggren H.G. Kärre K. In search of the ‘missing self’: MHC molecules and NK cell recognition Immunol. Today 1990 11 237 244 10.1016/0167-5699(90)90097-S 2201309 141. Cho D. Shook D.R. Shimasaki N. Chang Y.H. Fujisaki H. Campana D. Cytotoxicity of activated natural killer cells against pediatric solid tumors Clin. Cancer Res. 2010 16 3901 3909 10.1158/1078-0432.CCR-10-0735 20542985 PMC3168562 142. Berraondo P. Sanmamed M.F. Ochoa M.C. Etxeberria I. Aznar M.A. Pérez-Gracia J.L. Rodríguez-Ruiz M.E. Ponz-Sarvise M. Castañón E. Melero I. Cytokines in clinical cancer immunotherapy Br. J. Cancer 2019 120 6 15 10.1038/s41416-018-0328-y 30413827 PMC6325155 143. Boerman G.H. van Ostaijen-ten Dam M.M. Kraal K.C. Santos S.J. Ball L.M. Lankester A.C. Schilham M.W. Egeler R.M. van Tol M.J. Role of NKG2D, DNAM-1 and natural cytotoxicity receptors in cytotoxicity toward rhabdomyosarcoma cell lines mediated by resting and IL-15-activated human natural killer cells Cancer Immunol. Immunother. 2015 64 573 583 10.1007/s00262-015-1657-9 25854581 PMC4412555 144. Wagner J. Pfannenstiel V. Waldmann A. Bergs J.W.J. Brill B. Huenecke S. Klingebiel T. Rödel F. Buchholz C.J. Wels W.S. A Two-Phase Expansion Protocol Combining Interleukin (IL)-15 and IL-21 Improves Natural Killer Cell Proliferation and Cytotoxicity against Rhabdomyosarcoma Front. Immunol. 2017 8 676 10.3389/fimmu.2017.00676 28659917 PMC5466991 145. Rademacher M.J. Cruz A. Faber M. Oldham R.A.A. Wang D. Medin J.A. Schloemer N.J. Sarcoma IL-12 overexpression facilitates NK cell immunomodulation Sci. Rep. 2021 11 8321 10.1038/s41598-021-87700-2 33859303 PMC8050085 146. Gassmann H. Thiede M. Weiss J. Biele E. Flohe L. Lachermaier H. Prexler C. Evdokimova V. Radvanyi L. Akhtar I. Cytokine screening identifies TNF to potentially enhance immunogenicity of pediatric sarcomas Front. Immunol. 2024 15 1347404 10.3389/fimmu.2024.1347404 39723214 PMC11668575 147. Vela M. Bueno D. González-Navarro P. Brito A. Fernández L. Escudero A. Valentín J. Mestre-Durán C. Arranz-Álvarez M. Pérez de Diego R. Anti-CXCR4 Antibody Combined With Activated and Expanded Natural Killer Cells for Sarcoma Immunotherapy Front. Immunol. 2019 10 1814 10.3389/fimmu.2019.01814 31428099 PMC6688426 148. Lang P. Pfeiffer M. Müller I. Schumm M. Ebinger M. Koscielniak E. Feuchtinger T. Föll J. Martin D. Handgretinger R. Haploidentical stem cell transplantation in patients with pediatric solid tumors: Preliminary results of a pilot study and analysis of graft versus tumor effects Klin. Padiatr. 2006 218 321 326 10.1055/s-2006-942256 17080334 149. Llosa N.J. Cooke K.R. Chen A.R. Gamper C.J. Klein O.R. Zambidis E.T. Luber B. Rosner G. Siegel N. Holuba M.J. Reduced-Intensity Haploidentical Bone Marrow Transplantation with Post-Transplant Cyclophosphamide for Solid Tumors in Pediatric and Young Adult Patients Biol. Blood Marrow Transplant. 2017 23 2127 2136 10.1016/j.bbmt.2017.08.012 28807769 PMC5986177 150. Pérez-Martínez A. Leung W. Muñoz E. Iyengar R. Ramírez M. Vicario J.L. Lassaletta A. Sevilla J. González-Vicent M. Madero L. KIR-HLA receptor-ligand mismatch associated with a graft-versus-tumor effect in haploidentical stem cell transplantation for pediatric metastatic solid tumors Pediatr. Blood Cancer 2009 53 120 124 10.1002/pbc.21955 19215002 151. Marofi F. Abdul-Rasheed O.F. Rahman H.S. Budi H.S. Jalil A.T. Yumashev A.V. Hassanzadeh A. Yazdanifar M. Motavalli R. Chartrand M.S. CAR-NK cell in cancer immunotherapy; A promising frontier Cancer Sci. 2021 112 3427 3436 10.1111/cas.14993 34050690 PMC8409419 152. Imai C. Iwamoto S. Campana D. Genetic modification of primary natural killer cells overcomes inhibitory signals and induces specific killing of leukemic cells Blood 2005 106 376 383 10.1182/blood-2004-12-4797 15755898 PMC1895123 153. Gossel L.D.H. Heim C. Pfeffermann L.M. Moser L.M. Bönig H.B. Klingebiel T.E. Bader P. Wels W.S. Merker M. Rettinger E. Retargeting of NK-92 Cells against High-Risk Rhabdomyosarcomas by Means of an ERBB2 (HER2/Neu)-Specific Chimeric Antigen Receptor Cancers 2021 13 1443 10.3390/cancers13061443 33809981 PMC8004684 154. Lam P.Y. Omer N. Wong J.K.M. Tu C. Alim L. Rossi G.R. Victorova M. Tompkins H. Lin C.Y. Mehdi A.M. Enhancement of anti-sarcoma immunity by NK cells engineered with mRNA for expression of a EphA2-targeted CAR Clin. Transl. Med. 2025 15 e70140 10.1002/ctm2.70140 39763064 PMC11705447 155. Heim C. Hartig L. Weinelt N. Moser L.M. Salzmann-Manrique E. Merker M. Wels W.S. Tonn T. Bader P. Klusmann J.H. Bortezomib promotes the TRAIL-mediated killing of resistant rhabdomyosarcoma by ErbB2/Her2-targeted CAR-NK-92 cells via DR5 upregulation Mol. Ther. Oncol. 2024 32 200802 10.1016/j.omton.2024.200802 38706988 PMC11067460 156. Schmidt-Wolf I.G. Negrin R.S. Kiem H.P. Blume K.G. Weissman I.L. Use of a SCID mouse/human lymphoma model to evaluate cytokine-induced killer cells with potent antitumor cell activity J. Exp. Med. 1991 174 139 149 10.1084/jem.174.1.139 1711560 PMC2118875 157. Leuci V. Donini C. Grignani G. Rotolo R. Mesiano G. Fiorino E. Gammaitoni L. D’Ambrosio L. Merlini A. Landoni E. CSPG4-Specific CAR.CIK Lymphocytes as a Novel Therapy for the Treatment of Multiple Soft-Tissue Sarcoma Histotypes Clin. Cancer Res. 2020 26 6321 6334 10.1158/1078-0432.CCR-20-0357 32900797 PMC7710537 158. Merker M. Pfirrmann V. Oelsner S. Fulda S. Klingebiel T. Wels W.S. Bader P. Rettinger E. Generation and characterization of ErbB2-CAR-engineered cytokine-induced killer cells for the treatment of high-risk soft tissue sarcoma in children Oncotarget 2017 8 66137 66153 10.18632/oncotarget.19821 29029499 PMC5630399 159. Merker M. Wagner J. Kreyenberg H. Heim C. Moser L.M. Wels W.S. Bonig H. Ivics Z. Ullrich E. Klingebiel T. ERBB2-CAR-Engineered Cytokine-Induced Killer Cells Exhibit Both CAR-Mediated and Innate Immunity Against High-Risk Rhabdomyosarcoma Front. Immunol. 2020 11 581468 10.3389/fimmu.2020.581468 33193388 PMC7641627 160. Moser L.M. Heim C. Koschade S.E. Wendel P. Bozkurt S. Harenkamp S. Kreyenberg H. Merker M. Munch C. Gradhand E. CAR-CIK vs. CAR-T: Benchmarking novel cytokine-induced killer cells as solid tumor immunotherapy in ErbB2 + Front. Immunol. 2025 16 1485817 10.3389/fimmu.2025.1485817 39963129 PMC11831232 161. Gupta A. Cripe T.P. Immunotherapies for Pediatric Solid Tumors: A Targeted Update Paediatr. Drugs 2022 24 1 12 10.1007/s40272-021-00482-y 34822115 PMC8613512 162. Wedekind M.F. Denton N.L. Chen C.Y. Cripe T.P. Pediatric Cancer Immunotherapy: Opportunities and Challenges Paediatr. Drugs 2018 20 395 408 10.1007/s40272-018-0297-x 29948928 PMC6153971 163. Babu S. Krishnan M. Catalysts of change: Immunotherapy’s frontier in oral oncology Oral Oncol. Rep. 2024 11 100601 10.1016/j.oor.2024.100601 164. Wood G.E. Meyer C. Petitprez F. D’Angelo S.P. Immunotherapy in Sarcoma: Current Data and Promising Strategies American Society of Clinical Oncology Educational Book American Society of Clinical Oncology (ASCO) Alexandria, VA, USA 2024 Volume 44 e432234 10.1200/edbk_432234 38781557 165. Pilavaki P. Panagi M. Arifi S. Jones R.L. Stylianopoulos T. Constantinidou A. Exploring the landscape of immunotherapy approaches in sarcomas Front. Oncol. 2022 12 1069963 10.3389/fonc.2022.1069963 36686827 PMC9853527 166. Peng L. Sferruzza G. Yang L. Zhou L. Chen S. CAR-T and CAR-NK as cellular cancer immunotherapy for solid tumors Cell. Mol. Immunol. 2024 21 1089 1108 10.1038/s41423-024-01207-0 39134804 PMC11442786 167. Ortiz M.V. Bender J.L.G. Delays in Pediatric Evaluation of New and Relevant Cancer Therapies J. Pediatr. 2024 265 113826 10.1016/j.jpeds.2023.113826 37977329 168. Food and Drug Administration Cancer Clinical Trial Eligibility Criteria: Minimum Age Considerations for Inclusion of Pediatric Patients. Guidance for Industry and IRBs Available online: https://www.fda.gov/regulatory-information/search-fda-guidance-documents/cancer-clinical-trial-eligibility-criteria-minimum-age-considerations-inclusion-pediatric-patients (accessed on 14 May 2025) 169. Yan A.P. Venkatramani R. Bradley J.A. Lautz T.B. Urla C.I. Merks J.H.M. Oberoi S. Clinical Characteristics, Treatment Considerations, and Outcomes of Infants with Rhabdomyosarcoma Cancers 2023 15 2296 10.3390/cancers15082296 37190224 PMC10137053 170. Makimoto A. Optimizing Rhabdomyosarcoma Treatment in Adolescents and Young Adults Cancers 2022 14 2270 10.3390/cancers14092270 35565399 PMC9105996 171. Vo K.T. Parsons D.W. Seibel N.L. Precision Medicine in Pediatric Oncology Surg. Oncol. Clin. N. Am. 2020 29 63 72 10.1016/j.soc.2019.08.005 31757314 PMC7819485 172. Heipertz A.E. Pajtler K.W. Pfaff E. Schramm K. Blattner-Johnson M. Milde T. Jones B.C. Zuliani C. Hutter C. Lohi O. Outcome of Children and Adolescents With Relapsed/Refractory/Progressive Malignancies Treated With Molecularly Informed Targeted Drugs in the Pediatric Precision Oncology Registry INFORM JCO Precis. Oncol. 2023 7 e2300015 10.1200/PO.23.00015 37364231 173. McCabe M.G. Geoerger B. Chesler L. Hargrave D. Parsons D.W. van Tilburg C.M. Schleiermacher G. Hickman J.A. George S.L. Precision Medicine for Childhood Cancer: Current Limitations and Future Perspectives JCO Precis. Oncol. 2024 8 e2300117 10.1200/PO.23.00117 38207228 Figure 1 Immunosuppressive Features of the Tumor Immune Microenvironment in Pediatric Oral Rhabdomyosarcoma. Figure 2 Emerging Immunotherapeutic Strategies in Pediatric Oral Rhabdomyosarcoma. children-12-01249-t001_Table 1 Table 1 Summarizes the current therapeutic modalities for pediatric Oral RMS [ 1 2 3 4 8 9 10 13 14 15 Modality Role in RMS Treatment Limitations Surgery Local tumor control by complete excision. Often limited by anatomical complexity in the oral cavity; may affect function and appearance. Chemotherapy Systemic disease control; commonly includes vincristine, actinomycin D, and cyclophosphamide (VAC regimen). Systemic toxicity, resistance in high-risk subtypes. Radiotherapy Local control for unresectable or residual disease. Growth inhibition, craniofacial deformities, cognitive effects in children. Targeted Therapy Includes inhibitors of IGF1R, FGFR4, and other molecular targets relevant to RMS biology. Target specificity and resistance; mostly in experimental stages. Immunotherapy Emerging approaches include CAR-T, checkpoint inhibitors, and oncolytic viruses; efficacy in pediatric RMS under investigation. Limited clinical data in children; immune ‘coldness’ of tumors poses challenge. ",
  "metadata": {
    "Title of this paper": "Precision Medicine for Childhood Cancer: Current Limitations and Future Perspectives",
    "Journal it was published in:": "Children",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468757/"
  }
}