{
  "title": "Paper_804",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472897 PMC12472897.1 12472897 12472897 41011233 10.3390/ph18091365 pharmaceuticals-18-01365 1 Article Association of ABCG2 https://orcid.org/0000-0002-7136-566X Sharawi Zeina W. Methodology Formal analysis Funding acquisition Writing – original draft Supervision 1 Alqurashi Lina A. Methodology Formal analysis Investigation Writing – original draft 1 Alharthi Ahlam M. Conceptualization Methodology Validation Investigation Writing – original draft 2 https://orcid.org/0000-0003-3507-781X Jali Ibtisam M. Methodology Supervision Investigation Writing – review & editing 3 Jamal Maha H. Methodology Formal analysis Writing – original draft Supervision 2 Bawazir Yasser Validation Investigation Writing – review & editing 3 https://orcid.org/0000-0003-0170-3747 Mustafa Mohammad Validation Investigation Writing – review & editing 4 Bahlas Sami M. Validation Investigation Writing – review & editing 3 Daghasi Hassan Validation Investigation Writing – review & editing 5 https://orcid.org/0000-0001-9655-2528 Alharthi Talal S. Formal analysis Writing – review & editing 6 Al Shaer Dalal Sameer Investigation Writing – review & editing 7 https://orcid.org/0000-0003-0886-4068 Magadmi Rania Conceptualization Methodology Supervision Formal analysis Validation Writing – original draft 2 * Garg Shivani Academic Editor 1 2 3 4 5 6 7 * rmagadmi@kau.edu.sa 12 9 2025 9 2025 18 9 497460 1365 19 8 2025 05 9 2025 10 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives ABCG2 Methods Results Conclusions rheumatoid arthritis methotrexate ABCG2 pharmacogenetics single-nucleotide polymorphism Institutional Fund Projects IFPIP: 561-247-1443 Ministry of Education and King Abdulaziz University, DSR, Jeddah, Saudi Arabia This research work was funded by Institutional Fund Projects under grant no. (IFPIP: 561-247-1443). The authors gratefully acknowledge technical and financial support provided by the Ministry of Education and King Abdulaziz University, DSR, Jeddah, Saudi Arabia. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Rheumatoid arthritis (RA) is a chronic systemic autoimmune disorder that causes symmetrical polyarthritis, with a global prevalence of up to 1.7% among adults, women in particular. The disease is often progressive; it begins in small joints and progresses to involve major ones, causing pain, stiffness, swelling, and functional loss that leads to disability and early death [ 1 2 There is no cure for RA, so early use of disease-modifying anti-rheumatic drugs (DMARDs) represents the core component of RA management. In clinical practice, methotrexate (MTX) represents the first and best choice for RA treatment despite the availability of several conventional DMARD options [ 3 4 5 6 7 8 9 10 11 12 ABC subfamily G member 2 ( ABCG2 ABCG2 13 11 14 15 ABCG2 BCRP 34G>A 15 BCRP 16 17 Despite numerous studies in pharmacogenomics, few have investigated the relationship between ABCG2 ABCG2 ABCG2 2. Results 2.1. Clinical and Demographic Data of Participants Table 1 2.2. Demographic Data and Clinical Parameters as Predictors of MTX Response in RA Patients The demographic data and clinical parameters as predictors of MTX response in RA patients are shown in Table 2 t Regarding the other factors (Gender, nationality, ADRs, MTX duration, and taking SAIDs/NSAIDs) a chi-square test was performed and found that there was no statistically significant relationship between any of these factors and the two groups. 2.3. Genotype Distributions and Allele Frequencies of ABCG2 Polymorphisms The ABCG2 Table 3 The rs2231142 (C421A) SNP was not included in the subsequent data analysis as it was found in only one patient as a heterozygous genotype. 2.4. Associations Between ABCG2 SNP (rs2231137) and Patient Response to MTX Table 4 Next, Table 5 2.5. Associations Between ABCG2 SNP (rs2231137) and Developing ADRs Among all RA patients included in the genotyping, the most frequent ADR was GI upset (7%). As shown in Table 6 2.6. Associations Between ABCG2 SNP (rs2231137) Genotypes with RF The relationship between G34A SNP genotypes (rs2231137) with Rheumatoid factor (RF) is shown in Table 7 2.7. Association of ABCG2 SNP (rs2231137) Genotypes with ESR Level and MTX Dose in the Patients The results show that the erythrocyte sedimentation rate (ESR) level means for genotypes CC, CT, and TT were equal to 27.52, 22, and 33.5, respectively. Also, the mean MTX dose was equal to 15.16, 13.57, and 15 for CC, CT, and TT, respectively, as shown in Table 8 2.8. Association of ABCG2 SNP (rs2231137) Genotypes with the Disease Activity Table 9 3. Discussion In recent years, the pharmacogenetic studies of DMARDs in treating patients with RA have gained significant attention, particularly MTX, which is a folate anti-metabolite drug that represents the anchor drug for RA treatment. However, despite its demonstrated efficacy and well-known safety profile, MTX treatment still causes significant response diversity among RA patients. According to estimates, up to 50% of RA patients fail to reach their treatment goals, while up to 32% develop ADRs such as stomatitis, gastrointestinal upset, ulcers, liver toxicity, pancytopenia, and pneumonitis, which may lead to interrupting their treatment with MTX [ 10 ABCG2 In this study, it was observed that the mean age of the RA patients was 52.7 years; this finding was consistent with the systematic analysis study of the disease global burden conducted in 2021, where RA was found to affect middle-aged and older individuals mostly [ 18 18 19 The results showed that GI upset is the most common ADR in RA patients, accounting for 7% of cases in comparison to other ADRs. Similarly, it was observed in Al-Malaq et al.’ study, which followed 186 RA patients to document the ADRs of MTX in Saudi RA patients and found that GI upset was the most frequent ADR among the patients [ 20 10 Also, the study delved into the effectiveness of MTX, and it was discovered that the percentage of poor responders was higher than good responders, with 55.55% and 44.44%, respectively. Interestingly, such findings differ from previous studies’ reports, which indicate that good responders are more prevalent than poor responders [ 21 22 23 Regarding the relationship between rs2231137 SNP with MTX efficacy and toxicity in RA patients, the results did not yield any significant relationship between the responses to MTX and the rs2231137 SNP genotypes/allele frequency, where the p This study did not examine the association between the rs2231137 SNP and time to MTX discontinuation. However, using the Least Absolute Shrinkage and Selection Operator (LASSO) penalized regression, a previous study found an association between the rs2231137 SNP and time to discontinuation of MTX due to the appearance of ADRs and reported that this result may be a false negative in univariate [ 24 Overall, this article may provide valuable insights into the potential association between the 34G>A (rs2231137) polymorphism and clinical outcomes in RA patients treated with MTX. However, more research is needed to confirm our findings and to address the limitations of our study. In conclusion, to the best of our knowledge, this study is the first to examine the relationship between the 34G>A (rs2231137) SNP and MTX efficacy and/or toxicity in patients with RA using linear regression. The results indicate no link between the rs2231137 polymorphism in the ABCG2 4. Materials and Methods 4.1. Subjects and Study Design This study, a retrospective, multicentric, case–control study, is a part of a large project designed to evaluate the influence of SNPs on MTX response in RA patients. The study focused on Saudi residents who had been diagnosed with RA based on the 2010 American College of Rheumatology/European League Against Rheumatism (ACR/EULAR 2010) criteria and were treated with methotrexate for at least 3 months. A total of 99 (78 women, 21 men) were collected from King Abdulaziz University Hospital in Jeddah and Armed Forces Hospital in Taif. 4.2. Ethical Approval and Ethical Consideration The research protocol was approved by the Ethics Committee of the Biomedical Ethics Unit at the Faculty of Medicine, King Abdulaziz University, Jeddah (Reference No. 65-23; on 8 March 2023), and by the Research Ethics Committee of Armed Forces Hospitals, Taif (No. 2022-692; on 12 December 2022). All the participants were requested to sign written informed consent before collecting their data or samples and were free to withdraw at any time. 4.3. Data and Sample Collection The study participants’ information was collected by using a predesigned electronic data sheet. The Sheet was structured into two sections; the first section includes demographic data, such as age, nationality, and gender, which were obtained orally. While the second section incorporated clinical data derived from their medical records, including the age of onset, MTX doses, duration of MTX use, use of SAIDs/NSAIDs, the results of RF, DAS-28, and ESR. Also, the common ADRs, if any, include Hair loss, GI, Complete blood count disturbance (CBC disturbance), and liver function disturbance (LFT disturbance). Patients were classified into two groups, good responders and poor responders, based on their response to the MTX and/or appearance of any ADR. A good responder patient, receiving a stable MTX dose for at least 3 months with an ESR < 20 or CRP in the normal range, while a poor responder means the patient’s failure to reduce the ESR/CRP by at least 20% despite a minimum 6-month therapy with a dose of at least 15 mg/week [ 25 4.4. Genotype Analysis 4.4.1. Gene and SNP Selection This study focused on the ABCG2 14 15 16 4.4.2. Target-Specific Primer Design The exon sequence for the ABCG2 https://m.ensembl.org https://primer3.ut.ee 4.4.3. DNA Extraction and Purification The genomic DNA of all participants was extracted from the whole blood samples (5 mL) using QIAamp DNA Blood Kits (Qiagen, Germantown, MD, USA; catalog # 51140) following the manufacturer’s instructions. The concentration of DNA (ng/mL), as well as the quality and quantity of DNA, were evaluated utilizing the NanoDrop™ 2000c Spectrophotometer (Thermo Scientific, Waltham, MA, USA). The procedure steps are described previously in Magadmi et al. [ 26 4.4.4. Polymerase Chain Reaction (PCR) PCR amplification of all DNA samples was conducted prior to sequencing to confirm the presence and size of the product. The PCR protocol, including primer sequences and thermal cycling conditions, as well as the integrity of PCR products, was described previously in Magadmi et al. [ 26 4.4.5. Sanger Sequencing The genetic analyzers 3500 (Applied Biosystems, Carlsbad, CA, USA) and (BigDye ® 27 Electrophoresis workflow, sequencing standards, and performance-optimized polymer to separate the DNA and capillaries instruments were optimized by using the applied biosystem chemistry guide. 4.5. Statistical Analysis The study population was divided into groups: First group: RA patients with poor response to MTX drug. Second group: RA patients with good response to MTX drug. The patients’ demographic, laboratory, and clinical data were presented using descriptive statistics. Categorical variables were displayed as frequencies and percentages, while continuous variables were displayed as mean ± standard deviation (SD). To analyze differences between groups, Pearson’s chi-square test was used for categorical variables, and a t SNPStats [ 28 https://www.snpstats.net/ p Acknowledgments The authors would like to thank all participants. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, R.M. and A.M.A.; methodology, R.M., A.M.A., L.A.A., Z.W.S., M.H.J. and I.M.J.; validation, Y.B., M.M., S.M.B., H.D. and T.S.A.; formal analysis, R.M., A.M.A., L.A.A., Z.W.S., M.H.J. and T.S.A.; investigation, A.M.A., L.A.A., I.M.J., Y.B., M.M., S.M.B., H.D., D.S.A.S. and T.S.A.; writing—original draft preparation, R.M., A.M.A., L.A.A., Z.W.S. and M.H.J.; writing—review and editing, T.S.A., A.M.A., L.A.A., I.M.J., Y.B., M.M., S.M.B., H.D., D.S.A.S. and T.S.A.; supervision R.M., Z.W.S., M.H.J. and I.M.J. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by the Unit of Biomedical Research Ethics Committees in the Faculty of Medicine at King Abdulaziz University (Reference No. 65-23; on 8 March 2023) and Armed Forces Hospital at Al-Hada (Reference No. 2022-692; on 12 December 2022). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Written informed consent has been obtained from the patients to publish this paper. Data Availability Statement All relevant data are contained in the article, the original contributions presented in the study are included in the article, and further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. References 1. Smolen J.S. Aletaha D. Barton A. Burmester G.R. Emery P. Firestein G.S. Kavanaugh A. McInnes I.B. Solomon D.H. Strand V. Rheumatoid Arthritis Nat. Rev. Dis. Primers 2018 4 18001 10.1038/nrdp.2018.1 29417936 2. Lo J. Chan L. Flynn S. A Systematic Review of the Incidence, Prevalence, Costs, and Activity and Work Limitations of Amputation, Osteoarthritis, Rheumatoid Arthritis, Back Pain, Multiple Sclerosis, Spinal Cord Injury, Stroke, and Traumatic Brain Injury in the United States: A 2019 Update Arch. Phys. Med. Rehabil. 2021 102 115 131 10.1016/j.apmr.2020.04.001 32339483 PMC8529643 3. Smolen J.S. Aletaha D. Machold K.P. Therapeutic Strategies in Early Rheumatoid Arthritis Best Pract. Res. Clin. Rheumatol. 2005 19 163 177 10.1016/j.berh.2004.08.009 15588977 4. Al Saleh J. Ragab G. Nash P. Halabi H. Laatar A. El-Sayed Yousef A.M. Ehsouna H. Hammoudeh M. Rheumatoid Arthritis in the Middle East and Africa: Are We Any Closer to Optimising Its Management? Clin. Rheumatol. 2015 34 1 8 10.1007/s10067-014-2818-5 25376467 5. Aletaha D. Smolen J.S. The Rheumatoid Arthritis Patient in the Clinic: Comparing More than 1300 Consecutive DMARD Courses Rheumatology 2002 41 1367 1374 10.1093/rheumatology/41.12.1367 12468815 6. Jones G. Halbert J. Crotty M. Shanahan E.M. Batterham M. Ahern M. The Effect of Treatment on Radiological Progression in Rheumatoid Arthritis: A Systematic Review of Randomized Placebo-Controlled Trials Rheumatology 2003 42 6 13 10.1093/rheumatology/keg036 12509606 7. Pincus T. Ferraccioli G. Sokka T. Larsen A. Rau R. Kushner I. Wolfe F. Evidence from Clinical Trials and Long-Term Observational Studies That Disease-Modifying Anti-Rheumatic Drugs Slow Radiographic Progression in Rheumatoid Arthritis: Updating a 1983 Review Rheumatology 2002 41 1346 1356 10.1093/rheumatology/41.12.1346 12468813 8. Dargham S.R. Zahirovic S. Hammoudeh M. Al Emadi S. Masri B.K. Halabi H. Badsha H. Uthman I. Mahfoud Z.R. Ashour H. Epidemiology and Treatment Patterns of Rheumatoid Arthritis in a Large Cohort of Arab Patients PLoS ONE 2018 13 e0208240 Correction in PLoS ONE 2018 13 10.1371/journal.pone.0208240 30566451 PMC6300286 9. Oulkadi L. Rostom S. Hmamouchi I. El Binoune I. Amine B. Abouqal R. Achemlal L. Allali F. El Bouchti I. El Maghraoui A. Therapeutic Maintenance Level of Methotrexate in Rheumatoid Arthritis: A RBSMR Study Mediterr. J. Rheumatol. 2022 33 224 231 10.31138/mjr.33.2.224 36128204 PMC9450203 10. Mustafa S.H. Ahmad T. Balouch M. Iqbal F. Durrani T. Safety Profile of Methotrexate Therapy in Patients With Rheumatoid Arthritis Cureus 2022 14 e27047 10.7759/cureus.27047 36000142 PMC9389345 11. Mikkelsen T.S. Thorn C.F. Yang J.J. Ulrich C.M. French D. Zaza G. Dunnenberger H.M. Marsh S. McLeod H.L. Giacomini K. PharmGKB Summary: Methotrexate Pathway Pharmacogenet Genom. 2011 21 679 686 10.1097/FPC.0b013e328343dd93 PMC3139712 21317831 12. Ranganathan P. An Update on Methotrexate Pharmacogenetics in Rheumatoid Arthritis Pharmacogenomics 2008 9 439 451 10.2217/14622416.9.4.439 18384257 13. Schinkel A.H. Jonker J.W. Mammalian Drug Efflux Transporters of the ATP Binding Cassette (ABC) Family: An Overview Adv. Drug Deliv. Rev. 2012 64 138 153 10.1016/j.addr.2012.09.027 12535572 14. Morisaki K. Robey R.W. Özvegy-Laczka C. Honjo Y. Polgar O. Steadman K. Sarkadi B. Bates S.E. Single Nucleotide Polymorphisms Modify the Transporter Activity of ABCG2 Cancer Chemother. Pharmacol. 2005 56 161 172 10.1007/s00280-004-0931-x 15838659 15. Mizuarai S. Aozasa N. Kotani H. Single Nucleotide Polymorphisms Result in Impaired Membrane Localization and Reduced Atpase Activity in Multidrug Transporter ABCG2 Int. J. Cancer 2004 109 238 246 10.1002/ijc.11669 14750175 16. Imai Y. Nakane M. Kage K. Tsukahara S. Ishikawa E. Tsuruo T. Miki Y. Sugimoto Y. C421A Polymorphism in the Human Breast Cancer Resistance Protein Gene Is Associated with Low Expression of Q141K Protein and Low-Level Drug Resistance Mol. Cancer Ther. 2002 1 611 616 PMID: 12479221 12479221 17. Tanaka Y. Kitamura Y. Maeda K. Sugiyama Y. Quantitative Analysis of the ABCG2 c.421C>A Polymorphism Effect on in Vivo Transport Activity of Breast Cancer Resistance Protein (BCRP) Using an Intestinal Absorption Model J. Pharm. Sci. 2015 104 3039 3048 10.1002/jps.24366 25639366 18. GBD 2021 Rheumatoid Arthritis Collaborators Global, Regional, and National Burden of Rheumatoid Arthritis, 1990–2020, and Projections to 2050: A Systematic Analysis of the Global Burden of Disease Study 2021 Lancet Rheumatol. 2023 5 e594 e610 10.1016/S2665-9913(23)00211-4 37795020 PMC10546867 19. Raine C. Giles I. What Is the Impact of Sex Hormones on the Pathogenesis of Rheumatoid Arthritis? Front. Med. 2022 9 909879 10.3389/fmed.2022.909879 PMC9354962 35935802 20. Al-Malaq H.M. Al-Arfaj H.F. Al-Arfaj A.S. Adverse Drug Reactions Caused by Methotrexate in Saudi Population Saudi Pharm. J. 2012 20 301 305 10.1016/j.jsps.2012.05.004 23960804 PMC3745090 21. Cen H. Wen Q.W. Zhang H.Q. Yu H. Zeng Z. Jin T. Wang T.H. Qin W. Huang H. Wu X.D. Associations Between Genetic Polymorphisms Within Transporter Genes and Clinical Response to Methotrexate in Chinese Rheumatoid Arthritis Patients: A Pilot Study Pharmgenom. Pers. Med. 2022 15 327 339 10.2147/PGPM.S350417 PMC9013256 35437350 22. Brynedal B. Yoosuf N. Ulfarsdottir T.B. Ziemek D. Maciejewski M. Folkersen L. Westerlind H. Müller M. Sahlström P. Jelinsky S.A. Molecular Signature of Methotrexate Response among Rheumatoid Arthritis Patients Front. Med. 2023 10 1146353 10.3389/fmed.2023.1146353 37051216 PMC10084884 23. Duong S.Q. Crowson C.S. Athreya A. Atkinson E.J. Davis J.M. Warrington K.J. Matteson E.L. Weinshilboum R. Wang L. Myasoedova E. Clinical Predictors of Response to Methotrexate in Patients with Rheumatoid Arthritis: A Machine Learning Approach Using Clinical Trial Data Arthritis Res. Ther. 2022 24 162 10.1186/s13075-022-02851-5 35778714 PMC9248180 24. Jenko B. Lusa L. Tomsic M. Praprotnik S. Dolzan V. Clinical-Pharmacogenetic Predictive Models for MTX Discontinuation Due to Adverse Events in Rheumatoid Arthritis Pharmacogenomics J. 2017 17 412 418 10.1038/tpj.2016.36 27217051 25. Fransen J. Van Riel P.L.C.M. The Disease Activity Score and the EULAR Response Criteria Clin. Exp. Rheumatol. 2005 23 (Suppl. 39) S93 S99 PMID: 16273792 10.1016/j.rdc.2009.10.001 16273792 26. Magadmi R. Alyoubi R. Moshrif T. Bakhshwin D. Suliman B.A. Kamel F. Jamal M. Burzangi A.S. Basit S. Polymorphisms in the Drug Transporter Gene ABCB1 Are Associated with Drug Response in Saudi Epileptic Pediatric Patients Biomedicines 2023 11 2505 10.3390/biomedicines11092505 37760947 PMC10526247 27. Magadmi R. Alharthi A.M. Alqurashi L.A. Jali I.M. Sharawi Z.W. Jamal M.H. Bawazir Y. Mustafa M. Bahlas S.M. Jamal B.T. Association of SLCO1B3 and SLCO1B1 Polymorphisms with Methotrexate Efficacy and Toxicity in Saudi Rheumatoid Arthritis Patients Pharmaceuticals 2025 18 1069 10.3390/ph18071069 40732356 PMC12299335 28. Solé X. Guinó E. Valls J. Iniesta R. Moreno V. SNPStats: A Web Tool for the Analysis of Association Studies Bioinformatics 2006 22 1928 1929 10.1093/bioinformatics/btl268 16720584 pharmaceuticals-18-01365-t001_Table 1 Table 1 Clinical and demographic data of all participants.  Character  Mean  SD Age (years)  52.7 12.9 Age of onset (years)  45 14    Frequency  Percentage Gender Male 21 21.21 Female 78 78.78 Nationality Saudi 93 93.94 Non-Saudi 6 6  Clinical Feature   Frequency  Percentage Disease duration (years) ≥6 months 3 3 6 m to 1 year 9 9 >1 year 87 87.87 Duration of taking MTX 3 m to 1 year 16 16.2 >1 year 83 83.8 Steroid or non-steroid Yes 59 58.58 No 42 41.41 Adverse drug reaction (ADR) CBC disturbance 2 2 LFT disturbance 3 3 GI upset 7 7 Hair loss 2 2 Patient classification based on MTX drug response Good responders 44 44.44 Poor responders 55 55.56  Markers of Disease Activity  Mean  SD DAS-28 (N = 64)  3.1 1.1 ESR  27.5 17.5  Markers of Disease Activity  Frequency  Percentage RF +ve 69 69.70 −ve 27 27.3 Not known 3 3 SD, standard deviation; MTX, methotrexate; GI, gastrointestinal; CBC, Complete blood count; LFT, liver function test; RF, rheumatoid factor; DAS-28, Disease Activity Score-28; EER, erythrocyte sedimentation rate. pharmaceuticals-18-01365-t002_Table 2 Table 2 Demographic data and Clinical parameters as predictors of MTX response in RA patients. Factors Good Responders Poor Responders p 44 (44.44) 55 (55.56) Age # 51.90 (12.80) 53.38 (13.08) 0.576 Gender ^ Male  8 (38.1%) 13 (61.9%) 0.509 Female  36 (46.2%) 42 (53.8%) Nationality ^ Saudi  44 (46.8%) 50 (53.2%) 0.040 Non-Saudi  0 (0%) 5 (100%) Duration of MTX treatment ^ 3 months to 1 years  10 (62.5%) 6 (37.5%) 0. 112 >1 year  34 (41.0%) 49 (59.0%) Take Steroid or non-steroid ^ Yes  16 (27.6%) 42 (72.4%) 0.000 No  28 (68.3%) 13 (31.7%) Adverse drug reaction (ADR) ^ CBC disturbance Yes 1 (50.0%) 1 (50.0%) 0.873 No 43 (44.3%) 54 (55.7%) LFT disturbance Yes 2 (66.7%) 1 (33.3%) 0.432 No 42 (43.8%) 54 (56.3%) GI upset Yes 3 (42.9%) 4 (57.1%) 0.930 No 41 (44.6%) 51 (55.4%) Hair loss Yes 2 (100%) 0 (0%) 0.110 No 42 (43.3%) 55 (56.7%) N, patient numbers; GI, gastrointestinal; CBC, Complete blood count; LFT, liver function test. # t ^ pharmaceuticals-18-01365-t003_Table 3 Table 3 Genotype distributions and allele frequencies of ABCG2 polymorphisms. Genotype/Allele Frequency Percentage  rs2231137 CC 90 91 CT 7 7 TT 2 2 C 187 94 T 11 6  rs2231142 GG 98 99 GT 1 1 G 197 99 T 1 1 pharmaceuticals-18-01365-t004_Table 4 Table 4 Genotype and allele frequencies of rs2231137 SNP among good responders and poor responders to MTX. Genotype/Allele Good Responder Poor Responder Adjusted OR (95% CI) p N = 44 (44.44) N = 55 (55.56) CC 42 (95.5) 48 (87.3) 1 0.21 CT 1 (2.3) 6 (10.9) 5.49 (0.64) TT 1 (2.3) 1 (1.8) 0.91 (0.06) C 85 (97) 102 (93) 2.22(0.57) 0.25 T 3 (3) 8 (7)  N, patient numbers; OR, odds ratio; CI, confidence interval. Data was analyzed using chi-square. OR estimated by logistic regression analysis after adjusting for regimen. pharmaceuticals-18-01365-t005_Table 5 Table 5 Comparison of different rs2231137 SNP genotype models in MTX good responders and poor responders. Model Genotype Good Responder Poor Responder Adjusted OR (95% CI) p rs2231137 Dominant CC 42 (95.5) 48 (87.3) 1 0.15 CT-TT 2 (4.5) 7 (12.7) Recessive CC-CT 43 (97.7) 54 (98.2) 1 0.87 TT 1 (2.3) 1 (1.8) N, patient numbers; OR, odds ratio; CI, confidence interval. Data was analyzed using chi-square. OR estimated by logistic regression analysis after adjusting for regimen. pharmaceuticals-18-01365-t006_Table 6 Table 6 Associations between ABCG2 ADR rs2231137 p CC CT TT Hair loss, N (%) Yes 2 (100) 0 0 0.82 No 88 (90.7) 7 (7.2) 2 (2.1) Adjusted OR (95% CI) 1 NA  GI upset, N (%) Yes 6 (85.7) 1 (14.3) 0 0.69 No 84 (91.3) 6 (6.5) 2 (2.2) Adjusted OR (95% CI) 1 2.33 (0.24) NA  CBC disturbance, N (%) Yes 2 (100) 0 0 0.82 No 88 (90.7) 7 (7.2) 2 (2.1) Adjusted OR (95% CI) 1 NA  LFT disturbance, N (%) Yes 3 (100) 0 0 0.75 No 87 (90.6) 7 (7.3) 2 (2.1) Adjusted OR (95% CI) 1 NA  N, patient numbers; OR, odds ratio; CI, confidence interval; GI, gastrointestinal; CBC, Complete blood count; LFT, liver function test; NA: not applicable. Data was analyzed using chi-square. OR estimated by logistic regression analysis after adjusting for regimen. pharmaceuticals-18-01365-t007_Table 7 Table 7 Associations between ABCG2 Genotype/Allele Positive RF, N (%) Negative RF, N (%) Adjusted OR (95% CI) p N = 69 (71.88) N = 27 (28.12) rs2231137 (N = 96) CC 63 (91.3) 25 (92.6) 1 0.5 CT 4 (5.8) 2 (7.4) 1.26 (0.22) TT 2 (2.9) 0 NA N, patient numbers; OR, odds ratio; CI, confidence interval; RF, rheumatoid factor. Data was analyzed using chi-square. OR estimated by logistic regression analysis after adjusting for regimen. pharmaceuticals-18-01365-t008_Table 8 Table 8 Associations of ABCG2 Characteristic rs2231137 p CC CT TT ESR level 27.52 (17.77) 22 (16.71) 33.5 (14.84) 0.643 MTX dose 15.16 (3.76) 13.57 (3.77) 15 (3.53) 0.559 Data was analyzed using a one-way ANOVA test. Data were presented as mean and standard deviation (SD). EER, erythrocyte sedimentation rate; MTX, methotrexate; SD, standard deviation. pharmaceuticals-18-01365-t009_Table 9 Table 9 Association of ABCG2 Genotype DAS-28 p CC 3.07(1.08) 0.292 CT 3.88(0.952) TT 2.43(0.1) Data was analyzed using a one-way ANOVA test. Data were presented as mean and standard deviation (SD). SD, standard deviation; DAS-28, Disease Activity Score-28. ",
  "metadata": {
    "Title of this paper": "SNPStats: A Web Tool for the Analysis of Association Studies",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472897/"
  }
}