{
  "title": "Paper_1107",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468547 PMC12468547.1 12468547 12468547 41020907 10.3390/cimb47090786 cimb-47-00786 1 Article Geniposide Inhibits Oral Squamous Cell Carcinoma by Regulating PI3K-Akt Signaling-Mediated Apoptosis: A Multi-Method Validation Study Wang Xue Wang Jianbo * Hua Hua Wei Ping Chen Xue Peng Yusheng Liu Li Yu Dongmei You Xiaozhou Yang Siye Iacobas Dumitru A. Academic Editor Sichuan Institute for Translational Chinese Medicine, Sichuan Academy of Chinese Medicine Sciences, Translational Chinese Medicine Key Laboratory of Sichuan Province, Chengdu 610000, China * yyswjb@fmmu.edu.cn 22 9 2025 9 2025 47 9 497442 786 11 8 2025 10 9 2025 17 9 2025 22 09 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Gardenia jasminoides Gardenia jasminoides geniposide OSCC network pharmacology molecular docking molecular dynamics simulation apoptosis PI3K-Akt signaling pathway Sichuan Provincial Research Institutes Basal Research Fund 2023JDKY0038 (A-2023N-Z-6) 2024JDKY0037 2025JDKY0038 Two-year foundation ramming program for young talents of Sichuan Academy of Chinese Medicine Sciences QNCJ-WX-202410 This study was supported by the Sichuan Provincial Research Institutes Basal Research Fund (2023JDKY0038 (A-2023N-Z-6), 2024JDKY0037, 2025JDKY0038), the Two-year foundation ramming program for young talents of Sichuan Academy of Chinese Medicine Sciences (QNCJ-WX-202410). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Oral cancer (OCC) is a type of head and neck cancer (HNC), and more than 90% of OCC originates from squamous tissues, called oral squamous cell carcinoma (OSCC) [ 1 2 3 4 2 5 Homology of medicine and food from natural sources, in which active ingredients are derived from plants or traditional Chinese herbs and have multiple targets, multiple mechanisms, and a variety of biological activities, including anti-inflammatory, anti-tumor, and antioxidant properties, and exhibit therapeutic efficacy and reduced toxicity and side effects in clinical studies, may offer special benefits when used to improve OSCC. The fruit of Gardenia jasminoides 6 7 8 9 10 11 12 13 Figure 1 2. Materials and Methods 2.1. Materials 2.1.1. Cell Strain Oral squamous cell carcinoma cell line (HSC-3) (Shanghai Fuheng Biotechnology Co., Ltd., Shanghai, China, No. FH1315) was used. 2.1.2. Drugs and Reagents The following drugs and reagents were used: geniposide (Chengdu Aiboke Biotechnology Co., Ltd., Chengdu, China, (mass fraction ≥ 98%), No. AB1226), MEM basic (1X), fetal bovine serum (Wuhan Pricella Biotechnology Co., Ltd., Wuhan, China, No. PM150410, 164210-50), Penicillin–Streptomycin, Trypsin 0.25% (1X) solution (Thermo Fisher Scientific HyClone, Waltham, MA, USA, No. SV30010, SH30042.01), cytotoxicity detection and MTT cell proliferation kit, SDS-PAGE (Beyotime Biotechnology Co., Ltd., Shanghai, China, No. C0009S, P0012AC), phosphate-buffered saline (PBS) (Wuhan Servicebio Technology Co., Ltd., Wuhan, China, No. G4202), AO/EB double fluorescence staining kit (Beijing Bioss Biotechnology Co., Ltd., Beijing, China, No. S0012), RIPA, PMSF, BCA protein concentration kit (Ranjeck Technology Co., Ltd., Beijing, China, No. BL504A, BL507A, BL521A), phosphatase inhibitor (Wuhan Servicebio Technology Co., Ltd., Wuhan, China, No. G2007-1ML), PVDF (Bio-Rad Laboratories, Inc., Hercules, CA, USA, No. 1620177), EGFR, AKT, p-EGFR, p-AKT, PTEN, Caspase-3 (Proteintech Group, Inc., Wuhan, China, No. 66455-1-Ig, 30277-1-AP, 10176-2-AP, 66444-1-Ig, 60300-1-Ig, 25128-1-AP), Bcl-2, β-actin, Bax (Affinity BioReagents, Inc., Golden, CO, USA, No. AF6139, AF7018, AF0120), and HRP-labeled Goat Anti-Rabbit IgG (Beijing Zhongshan Golden Bridge Biotechnology Co. Ltd., Beijing, China, No. ZB-2301). 2.1.3. Instruments The following instruments were used: incubator (PHC Holdings Corporation, Tokyo, Japan, MCO-18AC), Inverted Microscope (Guangzhou Mshot Photoelectric Technology Co., Ltd., Guangzhou, China, M152-N), Analytical Balance (Shimadzu, Kyoto, Japan, AUY120), Benchtop Microcentrifuge (Scilogex, Rocky Hill, CT, USA, D3024), Multimode Reader (Tecan, Männedorf, Switzerland, Spark CN), and E-Gel Imager (Clinx, Shanghai, China, ChemiScope6100). 2.2. Methods 2.2.1. Network Pharmacology, Molecular Docking, and Molecular Dynamics Simulation Geniposide’s Molecular Structure and Target Gene Screening The PubChem database was searched with the keyword “geniposide” to acquire the chemical structure of geniposide. The potential targets of geniposide were identified using the Pharmmapper and SwissTargetPrediction databases ( https://www.lilab-ecust.cn/pharmmapper/ http://swisstargetprediction.ch/ https://www.uniprot.org/ OSCC Target Gene Acquisition The keyword “Oral Squamous Cell Carcinoma” was used to gather OSCC-related targets from the OMIM and GeneCards databases ( https://www.omim.org/ https://www.genecards.org/ Drug–Disease Cross-Target Screening and Drug–Target–Disease Network Construction The common target genes of geniposide and OSCC were identified by intersecting the screened geniposide targets with genes linked to OSCC disease using the Venny2.1.0 platform. The mutual correspondence of “geniposide–target” and “OSCC–target” was imported into Cytoscape 3.8.2 software to create a “geniposide–targets–oral squamous cell carcinoma” network diagram. Protein–Protein Interaction (PPI) Network Construction The common target genes were imported into the String11.5 ( www.string-db.org/ GO and KEGG Analyses The 145 intersecting targets were imported into the David database ( https://davidbioinformatics.nih.gov/ Molecular Docking Geniposide and the five targets in the PPI network with the highest degree values were molecularly docked. The RCSB PDB database ( http://www.rcsb.org/ 14 15 Molecular Dynamics Simulation GROMACS2022.5 software [ 16 17 18 19 20 21 22 23 24 (1) ∆ G b i n d = G c o m p l e x − ( G p r o t e i n + G l i g a n d ) (2) ∆ G b i n d = ∆ E M M + ∆ G s o l − T ∆ S    ∆ E M M = ∆ E v d w + ∆ E e l e ∆G bind complex protein ligand MM ele vdw sol 2.2.2. Cell Experiments Cell Culture and Drug Preparation Oral squamous cell carcinoma cells (HSC-3) were expanded under complete medium at 37 °C, 5% CO 2 MTT Assay HSC-3 cells in the logarithmic growth phase were seeded at 3 × 10 3 2 Acridine Orange/Ethidium Bromide (AO/EB) Staining HSC-3 cells in the logarithmic growth phase were seeded at 1 × 10 6 2 (3) Apoptosis  index  ( % ) = VA + NVA VN + VA + NVA + NVN  ×  100 %  Western Blot HSC-3 cells in the logarithmic growth phase were seeded at 1 × 10 6 Statistical Analysis SPSS 22.0 and GraphPad Prism 8.0 software packages were used for statistical analysis. The data results are expressed as the mean ± SD. One-way analysis of variance (ANOVA) was used to analyze the data between multiple groups, the independent samples t-test was used to evaluate the data between two groups, and the statistics were statistically significant when p 3. Results 3.1. Prediction of Potential Targets of Geniposide and OSCC The potential target genes of geniposide were predicted by the SwissTargetPrediction (probability > 0) and Pharmmapper databases (probability > 0); duplicate targets were removed, and 316 targets were obtained. The GeneCards and OMIM databases were used to predict potential targets of OSCC; duplicate targets were removed, and 2239 targets were obtained. Mapping geniposide and OSCC targets to obtain intersection targets, a total of 145 targets were obtained ( Figure 2 3.2. “Drug–Target–Disease” Network Analysis The “geniposide–target–OSCC” network was constructed by Cytoscape3.8.2 software, using Network Analyzer to analyze the network; the results show that there are 145 nodes and 290 edges ( Figure 3 3.3. PPI Network Construction and Core Target Screening The potential targets of geniposide for OSCC were inputted into the String database to construct a PPI network. The result showed that there were 132 nodes and 541 edges ( Figure 4 Table 1 3.4. GO Analysis and KEGG Signaling Pathway Analysis The 145 potential targets of geniposide for OSCC were functionally enriched and visualized. The molecular functions (MFs) in GO analysis included ATP binding, identical protein binding, etc.; the biological processes (BPs) included the regulation of the apoptotic process, phosphorylation, etc.; and the cellular component (CC) included the plasma membrane, cytosol, and extracellular exosome, etc. KEGG pathway analysis showed 145 potential targets involved in pathways in cancer, the PI3K-Akt signaling pathway, etc. ( Figure 5 3.5. Molecular Docking In molecular docking of geniposide with the top five key targets, the smaller the binding energy, the higher the binding activity and the better the binding stability. A binding energy of less than −5.0 kcal/mol indicates potential binding, and a binding energy of less than −7.0 kcal/mol indicates strong binding stability [ 25 Figure 6 3.6. Molecular Dynamics Simulation The root mean square deviation (RMSD) values of the complexes and the free-state ligand were used to determine whether or not the simulated system reached a steady state. RMSD values within 1 nm indicated that the complex structure was relatively stable. As shown in Figure 7 Figure 7 Figure 7 Figure 7 Figure 7 24 26 27 28 24 3.7. Geniposide’s Impact on OSCC Cell Activity After applying geniposide to HSC-3 cells at concentrations of 0.1, 0.2, 0.4, 0.8, 1.0, 2.0, 2.4, and 2.8 mmol/L for 48 h, the effects of the drug on OSCC (HSC-3) cell activity were measured using the MTT method. The results showed that geniposide could significantly inhibit HSC-3 cell activity ( p Figure 8 3.8. Geniposide’s Impact on Apoptosis The results of the AO/EB staining of HSC-3 cells showed that the IC50 concentration of geniposide triggered apoptosis in HSC-3 cells, while the control cells did not show signs of apoptosis. The apoptosis index values were 43.0 ± 0.072% and 1.0 ± 0.014%, respectively ( p Figure 8 3.9. Western Blot Combining the results of the core targets, molecular docking, and signaling pathways, it was predicted that geniposide might interfere with OSCC through the PI3K-Akt signaling pathway and apoptosis-related pathway. Western blotting was used to determine how geniposide affected the expression of proteins. The results showed that after 24 h of geniposide action, the expression of PTEN, Bax, and Caspase-3 proteins was significantly increased ( p p p Figure 8 4. Discussion OSCC is a serious threat to human health. It has a complex etiology, and its occurrence and development involve multiple targets and signaling pathways. The search for drugs and main therapeutic targets is of great significance for OSCC. Nowadays, traditional Chinese medicine monomers have obvious advantages in inhibiting tumor cell activity [ 29 30 7 Lactobacillus rhamnosus Lactobacillus casei 8 31 In this study, based on network pharmacology, we screened the potential targets of geniposide against OSCC, obtained 145 intersecting targets, and constructed a “drug–target–disease” network, obtaining 145 nodes and 290 edges, which indicated that the effect of geniposide on OSCC is a complex and synergistic regulation of multiple targets. The PPI network analysis indicated that EGFR, AKT1, SRC, HSP90AA1, and PIK3R1 might be the key targets of geniposide for OSCC. In order to further verify the reliability of the results, the key targets were molecularly docked with geniposide, and the results showed that geniposide had strong binding stability with EGFR and AKT1, and residues on the receptors of EGFR and AKT1 were able to form hydrogen bonding forces, hydrophobic forces, van der Waals forces, and Carbon hydrogen bonds. The molecular dynamics simulation further confirmed the stability of the binding between geniposide and EGFR and AKT1 targets, indicating that EGFR and AKT1 may be crucial in the geniposide treatment of OSCC. Through GO function and KEGG signaling pathway analysis, the PI3K-Akt signaling pathway and apoptosis-related pathway were identified as the possible mechanism pathways of geniposide in the treatment of OSCC. The PI3K-Akt signaling pathway, as a core regulatory hub of cellular function, plays a central role in physiological processes such as cell survival, proliferation, metabolism, and migration. Its abnormal activation has been directly linked to a number of serious illnesses, including cancer, diabetes, and neurodegenerative diseases [ 32 33 34 35 36 37 38 39 40 41 42 43 Figure 9 The results of this study showed that geniposide could reduce the proliferation of HSC-3 cells and cause apoptosis. Compared with the control group, after 24h of geniposide action, the expression of the PTEN, Bax, and Caspase-3 proteins in HSC-3 cells increased significantly, and the expression of the p-EGFR, p-AKT, and Bcl-2 proteins decreased significantly, indicating that geniposide may inhibit oral squamous cell carcinoma through multi-target regulation of the PI3K-Akt signaling pathway. However, it is worth noting that compared to conventional chemotherapeutic agents, the relatively high IC50 value of geniposide (2.766 mmol/L) may limit its clinical application. We are considering using nanotechnology [ 44 45 46 47 5. Conclusions This experiment offers a novel concept and theoretical foundation for understanding how geniposide controls the occurrence and progression of OSCC. The efficacy component of Gardenia jasminoides Acknowledgments Thanks to all participants and staff for their contributions. Disclaimer/Publisher’s Note: Author Contributions The design of this study was conducted by J.W., X.W., and H.H., the experiments were conducted by X.W. and X.C., the data analysis was conducted by Y.P., L.L., and S.Y., and the manuscript was written by X.W., P.W., X.Y., and D.Y. All authors have read and agreed to the published version of the manuscript. Data Availability Statement The data supporting this study can be obtained from the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Chamoli A. Gosavi A.S. Shirwadkar U.P. Wangdale K.V. Behera S.K. Kurrey N.K. Kalia K. Mandoli A. Overview of oral cavity squamous cell carcinoma: Risk factors, mechanisms, and diagnostics Oral Oncol. 2021 121 105451 10.1016/j.oraloncology.2021.105451 34329869 2. Tan Y. Wang Z. Xu M. Li B. Huang Z. Qin S. Nice E.C. Tang J. Huang C. Oral squamous cell carcinomas: State of the field and emerging directions Int. J. Oral. Sci. 2023 15 4 10.1038/s41368-023-00249-w 37736748 PMC10517027 3. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 4. Han B. Zheng R. Zeng H. Wang S. Sun K. Chen R. Li L. Wei W. He J. Cancer incidence and mortality in China, 2022 J. Natl. Cancer Cent. 2024 4 47 53 10.1016/j.jncc.2024.01.006 39036382 PMC11256708 5. Rezazadeh F. Andisheh-Tadbir A. Mansouri Z.M. Khademi B. Bayat P. Sedarat H. Tabesh A. Khorami E.T. Evaluation of recurrence, mortality and treatment complications of oral squamous cell carcinoma in public health centers in Shiraz during 2010 to 2020 BMC Oral. Health 2023 23 341 10.1186/s12903-023-03071-2 37254138 PMC10227788 6. Zhou Y.X. Zhang R.Q. Rahman K. Cao Z.X. Zhang H. Peng C. Diverse pharmacological activities and potential medicinal benefits of geniposide Evid.-Based Complement. Altern. Med. 2019 2019 4925682 10.1155/2019/4925682 PMC6500620 31118959 7. Bai G. Chen B. Xiao X. Li Y. Liu X. Zhao D. Zhang L. Zhao D. Geniposide inhibits cell proliferation and migration in human oral squamous carcinoma cells via AMPK and JNK signaling pathways Exp. Ther. Med. 2022 24 706 10.3892/etm.2022.11642 36382092 PMC9634504 8. Cheng Z. Xu H. Wang X. Liu Z. Lactobacillus raises in vitro anticancer effect of geniposide in HSC-3 human oral squamous cell carcinoma cells Exp. Ther. Med. 2017 14 4586 4594 10.3892/etm.2017.5105 29104666 PMC5658719 9. Luo M. Wang Y. Liu X. Liu L. Zhu L. Chen G. Ye Q. He C. Xiao X. Li J. Geniposide Suppresses Tumor Progression Through DUOX1-Mediated Ferroptosis in Hepatocellular Carcinoma Am. J. Chin. Med. 2025 53 1573 1589 10.1142/S0192415X25500600 40621626 10. Hu L. Zhao J. Liu Y. Liu X. Lu Q. Zeng Z. Zhu L. Tong X. Xu Q. Geniposide inhibits proliferation and induces apoptosis of diffuse large B-cell lymphoma cells by inactivating the HCP5/miR-27b-3p/MET axis Int. J. Med. Sci. 2020 17 2735 2743 10.7150/ijms.51329 33162801 PMC7645330 11. Habtemariam S. Lentini G. Plant-Derived Anticancer Agents: Lessons from the Pharmacology of Geniposide and Its Aglycone, Genipin Biomedicines 2018 6 39 10.3390/biomedicines6020039 29587429 PMC6027249 12. Lichota A. Gwozdzinski K. Anticancer Activity of Natural Compounds from Plant and Marine Environment Int. J. Mol. Sci. 2018 19 3533 10.3390/ijms19113533 30423952 PMC6275022 13. Wei M. Wu Y. Liu H. Xie C. Genipin Induces Autophagy and Suppresses Cell Growth of Oral Squamous Cell Carcinoma via PI3K/AKT/MTOR Pathway Drug Des. Dev. Ther. 2020 14 395 405 10.2147/DDDT.S222694 PMC6996293 32099325 14. Trott O. Olson A.J. AutoDock Vina: Improving the speed and accuracy of docking with a new scoring function, efficient optimization, and multithreading J. Comput. Chem. 2010 31 455 461 10.1002/jcc.21334 19499576 PMC3041641 15. Agu P.C. Afiukwa C.A. Orji O.U. Ezeh E.M. Ofoke I.H. Ogbu C.O. Ugwuja E.I. Aja P.M. Molecular docking as a tool for the discovery of molecular targets of nutraceuticals in diseases management Sci. Rep. 2023 13 13398 10.1038/s41598-023-40160-2 37592012 PMC10435576 16. Bauer P. Hess B. Lindahl E. GROMACS 2022.5 Manual version 2022.5 Zenodo Geneva, Switzerland 2023 10.5281/zenodo.7586765 17. Buglak A.A. Samokhvalov A.V. Zherdev A.V. Dzantiev B.B. Methods and Applications of In Silico Aptamer Design and Modeling Int. J. Mol. Sci. 2020 21 8420 10.3390/ijms21228420 33182550 PMC7698023 18. Lindorff-Larsen K. Piana S. Palmo K. Maragakis P. Klepeis J.L. Dror R.O. Shaw D.E. Improved side-chain torsion potentials for the Amber ff99SB protein force field Proteins Struct. Funct. Bioinform. 2010 78 1950 1958 10.1002/prot.22711 PMC2970904 20408171 19. Pérez A. Marchán I. Svozil D. Sponer J. Cheatham T.E. 3rd Laughton C.A. Orozco M. Refinement of the AMBER Force Field for Nucleic Acids: Improving the Description of α/γ Conformers Biophys. J. 2007 92 3817 3829 10.1529/biophysj.106.097782 17351000 PMC1868997 20. Salomon-Ferrer R. Götz A.W. Poole D. Le Grand S. Walker R.C. Routine Microsecond Molecular Dynamics Simulations with AMBER on GPUs. 2. Explicit Solvent Particle Mesh Ewald J. Chem. Theory Comput. 2013 9 3878 3888 10.1021/ct400314y 26592383 21. Li Y. Hu X. Sang J. Zhang Y. Zhang H. Lu F. Liu F. An acid-stable β-glucosidase from Aspergillus aculeatus: Gene expression, biochemical characterization and molecular dynamics simulation Int. J. Biol. Macromol. 2018 119 462 469 10.1016/j.ijbiomac.2018.07.165 30063929 22. Ahmed B. Ashfaq U.A. Mirza M.U. Medicinal plant phytochemicals and their inhibitory activities against pancreatic lipase: Molecular docking combined with molecular dynamics simulation approach Nat. Prod. Res. 2018 32 1123 1129 10.1080/14786419.2017.1320786 28446025 23. Wang E. Sun H. Wang J. Wang Z. Liu H. Zhang J.Z.H. Hou T. End-Point Binding Free Energy Calculation with MM/PBSA and MM/GBSA: Strategies and Applications in Drug Design Chem. Rev. 2019 119 9478 9508 10.1021/acs.chemrev.9b00055 31244000 24. Gao L. Jiang X. Duan H. Shen Y. Gu K. Huang K. Wang Y. Shu M. Zhang R. Lin Z. Molecular dynamics simulation-driven focused virtual screening and experimental validation of Fisetin as an inhibitor of Helicobacter pylori Mol. Divers. 2025 1 16 10.1007/s11030-025-11137-2 39988708 25. Li C. Wen R. Liu D. Yan L. Gong Q. Yu H. Assessment of the Potential of Sarcandra glabra Thunb. Front. Pharmacol. 2022 13 810344 10.3389/fphar.2022.810344 35903344 PMC9315220 26. Sarker P. Mitro A. Hoque H. Hasan N. Jewel G.N.A. Identification of potential novel therapeutic drug target against Elizabethkingia anophelis Comput. Biol. Med. 2023 165 107436 10.1016/j.compbiomed.2023.107436 37690289 27. Sakano T. Mahamood I. Yamashita T. Fujitani H. Molecular dynamics analysis to evaluate docking pose prediction Biophys. Physicobiology 2016 13 181 194 10.2142/biophysico.13.0_181 PMC5042163 27924273 28. Hu X. Zeng Z. Zhang J. Wu D. Li H. Geng F. Molecular dynamics simulation of the interaction of food proteins with small molecules Food Chem. 2023 405 Pt A 134824 10.1016/j.foodchem.2022.134824 36370554 29. Zhu J. Yin S. Luo S. Yu F. Sun K. Traditional Chinese Medicine Monomers and Their Derivatives as a Promising Therapeutic Tool for Hepatocellular Carcinoma by Activation of Mitophagy Drug Des. Dev. Ther. 2025 19 7069 7087 10.2147/DDDT.S535244 PMC12374703 40859967 30. Zhang C. Wang N. Tan H. Guo W. Chen F. Zhong Z. Man K. Tsao S.W. Lao L. Feng Y. Direct inhibition of the TLR4/MyD88 pathway by geniposide suppresses HIF-1α-independent VEGF expression and angiogenesis in hepatocellular carcinoma Br. J. Pharmacol. 2020 177 3240 3257 10.1111/bph.15046 32144747 PMC7312435 31. Qian Y. Song J.-L. Sun P. Yi R. Liu H. Feng X. Park K.-Y. Zhao X. Lactobacillus casei Molecules 2018 23 1069 10.3390/molecules23051069 29751513 PMC6099796 32. Camaya I. Donnelly S. O’BRien B. Targeting the PI3K/Akt signaling pathway in pancreatic β-cells to enhance their survival and function: An emerging therapeutic strategy for type 1 diabetes J. Diabetes 2022 14 247 260 10.1111/1753-0407.13252 35191175 PMC9060113 33. Liu H. Zhang B. Sun Z. Spectrum of EGFR aberrations and potential clinical implications: Insights from integrative pan-cancer analysis Cancer Commun. 2020 40 43 59 10.1002/cac2.12005 PMC7163653 32067422 34. Sigismund S. Avanzato D. Lanzetti L. Emerging functions of the EGFR in cancer Mol. Oncol. 2018 12 3 20 10.1002/1878-0261.12155 29124875 PMC5748484 35. Wangzhou K. Lu Z. Lai Z. Fu W. Liu C. Tan Y. Hao C. Upregulated circ_0002141 facilitates oral squamous cell carcinoma progression via the miR-1231/EGFR axis Oral. Dis. 2023 29 902 912 10.1111/odi.14070 34739167 36. Sinto M.S. Thomas S. Kannan S. Combinatorial treatment with Gefitinib and Bay11-7085 sensitizes primary Gefitinib-resistant OSCC cells by influencing the EGFR- NFκB signaling axis Med. Oncol. 2021 38 110 10.1007/s12032-021-01557-z 34357463 37. Brandmaier A. Hou S.-Q. Shen W.H. Cell Cycle Control by PTEN J. Mol. Biol. 2017 429 2265 2277 10.1016/j.jmb.2017.06.004 28602818 PMC5659283 38. Mukherjee R. Vanaja K.G. Boyer J.A. Gadal S. Solomon H. Chandarlapaty S. Levchenko A. Rosen N. Regulation of PTEN translation by PI3K signaling maintains pathway homeostasis Mol. Cell 2021 81 708 723.e5 10.1016/j.molcel.2021.01.033 33606974 PMC8384339 39. Yehia L. Keel E. Eng C. The Clinical Spectrum of PTEN Mutations Annu. Rev. Med. 2020 71 103 116 10.1146/annurev-med-052218-125823 31433956 40. Kerdjoudj M. De La Torre R.A. Arnouk H. Characterization of DJ-1, PTEN, and p-Akt as Prognostic Biomarkers in the Progression of Oral Squamous Cell Carcinoma Cureus 2023 15 e34436 10.7759/cureus.34436 36874678 PMC9979586 41. Hsu A.H. Lum M.A. Shim K.-S. Frederick P.J. Morrison C.D. Chen B. Lele S.M. Sheinin Y.M. Daikoku T. Dey S.K. Crosstalk between PKCα and PI3K/AKT Signaling Is Tumor Suppressive in the Endometrium Cell Rep. 2018 24 655 669 10.1016/j.celrep.2018.06.067 30021163 PMC6118133 42. Roy N.K. Monisha J. Padmavathi G. Lalhruaitluanga H. Kumar N.S. Singh A.K. Bordoloi D. Baruah M.N. Ahmed G.N. Longkumar I. Isoform-Specific Role of Akt in Oral Squamous Cell Carcinoma Biomolecules 2019 9 253 10.3390/biom9070253 31252679 PMC6681224 43. Zhou Z. Han S. Liao J. Wang R. Yu X. Li M. Isoliquiritigenin Inhibits Oral Squamous Cell Carcinoma and Overcomes Chemoresistance by Destruction of Survivin Am. J. Chin. Med. 2023 51 2221 2241 10.1142/S0192415X23500957 37930332 44. Thalij K.M. You H.W. Aher K.B. Bhavar G.B. Kumbhar S.T. Habeeb M. Advances in Lipid-Based Nanomedicine: Pathway Specific siRNA Therapy and Optimizing Delivery for Hepatocellular Carcinoma Int. J. Nanomed. 2025 20 10541 10566 10.2147/IJN.S532246 40918946 PMC12413497 45. Tang Y. Huang J. Cui C. Yang F. Li K. Gao B. Fu S. Yang X. Folate-Modified Smart Responsive Nanosystems for Enhancing Anti-Tumor Therapy Through Calcium Overload and Chemotherapy Int. J. Nanomed. 2025 20 10233 10249 10.2147/IJN.S523621 40896795 PMC12397506 46. Saadh M.J. Mustafa M.A. Kumar A. Alamir H.T.A. Kumar A. Khudair S.A. Faisal A. Alubiady M.H.S. Jalal S.S. Shafik S.S. Stealth Nanocarriers in Cancer Therapy: A Comprehensive Review of Design, Functionality, and Clinical Applications AAPS PharmSciTech 2024 25 140 10.1208/s12249-024-02843-5 38890191 47. Basu B. Garala K.K. Patel R. Dutta A. Ash D. Prajapati B. Singh S. Jha S.K. Advanced Targeted Drug Delivery of Bioactive Nanomaterials in the Management of Cancer Curr. Med. Chem. 2025 32 2711 2730 10.2174/0109298673283362231220115050 38375849 Figure 1 Source of geniposide. Figure 2 Venn diagram of intersection targets of geniposide and oral squamous cell carcinoma. Figure 3 “Geniposide–targets–oral squamous cell carcinoma” network diagram. Figure 4 Construction of PPI network. Figure 5 GO function and KEGG signaling pathway analysis. ( A B Figure 6 Molecular docking model of geniposide and EGFR and AKT-1 target proteins. ( A B Figure 7 Molecular dynamics simulation of geniposide with core targets. ( A B C D E F Figure 8 Results of cell experiments: ( A B C p D p p E Figure 9 Mechanism diagram. cimb-47-00786-t001_Table 1 Table 1 Top 10 targets of PPI network. Rank Name Degree 1 EGFR 44 2 AKT1 40 3 SRC 38 4 HSP90AA1 36 5 PIK3R1 31 6 MMP9 28 7 ESR1 27 8 STAT1 23 8 HSP90AB1 23 9 CASP3 22 9 IGF1 22 10 ALB 20 ",
  "metadata": {
    "Title of this paper": "Advanced Targeted Drug Delivery of Bioactive Nanomaterials in the Management of Cancer",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468547/"
  }
}