{
  "title": "Paper_818",
  "abstract": "pmc Pathogens Pathogens 2622 pathogens pathogens Pathogens 2076-0817 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472737 PMC12472737.1 12472737 12472737 41011771 10.3390/pathogens14090871 pathogens-14-00871 1 Article LMP7 as a Target for Coronavirus Therapy: Inhibition by Ixazomib and Interaction with SARS-CoV-2 Proteins Nsp13 and Nsp16 Ru Yi Conceptualization Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 2 † https://orcid.org/0000-0002-5448-3509 Ma-Lauer Yue Conceptualization Methodology Formal analysis Investigation Writing – review & editing 1 2 † Xiang Chengyu Formal analysis Investigation Data curation Writing – review & editing 1 2 Li Pengyuan Formal analysis Investigation Data curation Writing – review & editing 1 2 von Brunn Brigitte Formal analysis Investigation Resources Writing – review & editing 1 2 Richter Anja Methodology Formal analysis Investigation Data curation Writing – review & editing 3 Drosten Christian Resources Writing – review & editing Supervision 3 https://orcid.org/0000-0002-0166-1367 Pichlmair Andreas Resources Writing – review & editing Supervision 4 https://orcid.org/0000-0001-7489-6557 Pfefferle Susanne Formal analysis Investigation Writing – review & editing 5 Klein Markus Resources Writing – review & editing 6 https://orcid.org/0000-0002-7611-7534 Damoiseaux Robert D. Investigation Resources Writing – review & editing 7 https://orcid.org/0000-0002-2355-7974 Betz Ulrich A. K. 6 von Brunn Albrecht Conceptualization Methodology Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 1 2 * Chang Theresa Academic Editor 1 ru@mvp.lmu.de ma_lauer@mvp.lmu.de xiang@mvp.lmu.de leepy1022@outlook.com vonbrunn_b@mvp.lmu.de 2 3 anja.richter@charite.de christian.drosten@charite.de 4 andreas.pichlmair@tum.de 5 s.pfefferle@uke.de 6 markus.b.klein@merckgroup.com ulrich.betz@merckgroup.com 7 rdamoiseaux@mednet.ucla.edu * vonbrunn@mvp.lmu.de † These authors contributed equally to this work. 02 9 2025 9 2025 14 9 497659 871 14 7 2025 11 8 2025 14 8 2025 02 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The emergence of human coronaviruses has led to three epidemics or pandemics in the last two decades, collectively causing millions of deaths and thus highlighting a long-term need to identify new antiviral drug targets and develop antiviral therapeutics. In this study, a compound library was screened to uncover novel potential inhibitors of coronavirus replication. Three lead compounds, designated #16-14, #16-23, and #16-24, which were Ixazomib and its analogs, were identified based on their potent antiviral activity and minimal cytotoxicity. These compounds were found to inhibit the immunoproteasome subunit LMP7, a target whose subcellular localization and expression are altered in Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2)-infected Huh7 cells. Yeast two-hybrid assays and co-immunoprecipitation further revealed that LMP7 interacts with the viral proteins Nsp13 and Nsp16. In addition, Nsp13 and Nsp16 disrupted the expression of LMP7 in response to pathogen attacks. Functional studies showed that LMP7 knockout in BEAS-2B-ACE2 cells resulted in enhanced replication of attenuated SARS-CoV-2, highlighting the role of this subunit in restricting viral replication. Taken together, these findings position LMP7 as a novel therapeutic target and highlight Ixazomib and its analogs as potential antiviral agents against current and future coronavirus threats. LMP7 SARS-CoV-2 Nsp13 Nsp16 immunoproteasome Ixazomib German Government RAPID 01Kl1723C/01KI2006C German Center for Infection Research TTU EI 01.806 Merck KGaA, Darmstadt, Germany This research was supported by grants from the “Bundesministerium fuer Bildung und Forschung” of the German Government (RAPID 01Kl1723C/01KI2006C), the German Center for Infection Research (DZIF, partner site: Munich, project TTU EI 01.806) and Merck KGaA, Darmstadt, Germany to A.B. (Ludwig-Maximilians-University Munich). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The COVID-19 pandemic has lasted five years and resulted in more than seven million deaths worldwide [ 1 2 3 4 Low-molecular-mass protein-7 (LMP7) is a catalytic subunit specifically present in the immunoproteasome induced under inflammatory conditions. The immunoproteasome is a special type of proteasome with a cylindrical structure composed of a 19S regulatory unit and a 20S proteolytic core complex [ 5 6 The main function of the immunoproteasome is to process major histocompatibility complex (MHC) class I peptides for antigen presentation [ 7 8 9 10 11 In this study, we identify Ixazomib and its analogs as novel LMP7 inhibitors that can significantly suppress coronavirus replication. LMP7 is targeted by SARS-CoV-2 viral proteins, and SARS-CoV-2 infection alters the subcellular distribution and protein levels of LMP7. Knockout of LMP7 significantly enhances the replication of the attenuated SARS-CoV-2 virus sCPD9. Our work suggests LMP7 as a potential drug target for treatments preventing human coronavirus replication. 2. Materials and Methods 2.1. Cell Culture and Transfection HEK293, Huh7, and Human Angiotensin-converting enzyme 2 (ACE2)-RFP-transduced A549 cells (A549_ACE2_RFP) [ 12 13 2.2. Plasmid and Constructions GFP- and HA-fused LMP7 and RFP-fused HLA-A were generated by gateway cloning as described previously [ 14 14 For LMP7-knockout constructs, LMP7 sgRNAs were designed using the Synthego design tool: https://design.synthego.com/#/ http://n2t.net/addgene:52961 15 http://n2t.net/addgene:12260 http://n2t.net/addgene:8454 16 2.3. Generation of LMP7-Knockout Cells The successfully cloned pLentiCrispr v2 LMP7 was co-transfected with psPAX2 and pCMV-VSV-G plasmids into HEK293T cells. Three days after transfection, the lentivirus supernatant was harvested and BEAS-2B-ACE2 cells cultured in a 12-well plate were infected with this supernatant. Three days after infection, cells were selected using a growth medium containing 2 µg/mL puromycin for a period of between five and seven days. Surviving cells were harvested for Western blot analysis to determine the expression levels of LMP7. 2.4. Virus Infection For a recombinant HCoV-229E virus expressing Renilla luciferase (HCoV-229E RLuc) infection, Huh7 or HEK293 cells transfected with aminopeptidase N (APN) receptors were infected with HCoV-229E RLuc (MOI = 1) [ 17 SARS-CoV-2 virus inhibition assays were performed using the IncuCyte S3 Live-Cell Analysis System (Essen Bioscience), as described in detail in [ 18 For infection with the attenuated SARS-CoV-2 virus sCPD9 [ 19 20 For vaccinia virus vTF-7 infection, HEK293 cells were infected with a recombinant vaccinia virus, vTF-7, expressing the T7 RNA polymerase as described previously [ 21 2.5. Cell Viability Assay The viability of the cells was determined using a CellTiter-Glo ® 2.6. Immunofluorescence Staining and Fluorescence Microscopy Immunofluorescence staining and fluorescence microscopy were performed as previously described [ 14 2.7. Co-Immunoprecipitation and Western Blot Analysis HEK293 cells were transfected with plasmids in a 6-well plate using Lipofectamine 3000 (Thermofisher). Twenty-four or forty-eight hours after transfection, cells were lysed and their protein was purified with GFP-Trap_A bead-based co-immunoprecipitation (Co-IP) (ChromoTek, Planegg-Martinsried, Germany) according to the manufacturer’s protocol. The Western blot protocol has been described elsewhere [ 22 Table S2 2.8. Statistics Statistical analysis was performed using one-way analysis of variance (one-way ANOVA) with Dunnett’s test for multiple comparisons or Student’s t p p p p p 3. Results 3.1. Coronavirus Replication Inhibitors Selected from Screening Are LMP7 Inhibitors To identify new drug candidates that suppress coronavirus replication, the recombinant human coronavirus HCoV-229E RLuc, carrying the Renilla luciferase reporter [ 23 Figure 1 Figure 1 24 Table 1 Figure 1 3.2. Candidate Compounds Inhibit Replication of SARS-CoV and SARS-CoV-2 The selected compounds were then tested for their ability to inhibit the replication of highly virulent human coronaviruses. A SARS-CoV replicon carrying the Renilla luciferase reporter pBAC-REP-RLuc [ 25 26 Figure 2 The compounds were also tested for their ability to suppress SARS-CoV-2 replication. A549_ACE2_RFP cells were challenged with a recombinant SARS-CoV-2 virus carrying a GFP reporter (SARS-CoV-2-GFP) [ 18 Figure 2 Figure 2 Figure 1 3.3. SARS-CoV-2 Infection Reduces LMP7 Protein Levels, and SARS-CoV-2 Viral Proteins Target LMP7 We then investigated whether SARS-CoV-2 infection alters the subcellular localization or protein level of LMP7. Huh7 cells infected with SARS-CoV-2 at an MOI of 0.1 for 24 h were fixed and examined by immunofluorescence microscopy. As shown in Figure 2 Figure S1 Figure 2 To further investigate how LMP7 is regulated by SARS-CoV-2, we used LMP7 as a bait to screen SARS-CoV-2 viral proteins in yeast two-hybrid (Y2H) assays [ 14 Figure S2 Figure 2 Figure 2 3.4. SARS-CoV-2 Nsp13 and Nsp16 Inhibit LMP7 Expression, and Nsp16 Disrupts LMP7-Mediated Antigen Presentation The vaccinia virus has been shown to infect HEK293 cells and induce an antiviral host response [ 27 Figure 3 LMP7 is a catalytic subunit of the immunoproteasome, whose primary function is to process peptides for antigen presentation via MHC class I. During the process of antigen presentation, MHC class I migrates from the endoplasmic reticulum (ER) to the cell membrane to expose the bound peptide to T-cell receptors [ 28 Figure 3 Figure S3 3.5. LMP7 Is an Antiviral Factor That Acts Against SARS-CoV-2 To further understand the role of LMP7 in human coronavirus replication, LMP7 was knocked out in human ACE2-transgenic bronchial epithelial cells (BEAS-2B-ACE2), as this cell line shows abundant endogenous LMP7 expression. In addition, this cell line is susceptible to infection with SARS-CoV-2 and mild coronaviruses. The endogenous protein level of LMP7 was greatly reduced in the LMP7-knockout (BEAS-2B-ACE2 LMP7-KO) cells ( Figure 4 Figure 4 4. Discussion LMP7 is a catalytic subunit of an immunoproteasome that degrades viral protein into peptides during infection for downstream antigen presentation at the cell surface. In this way, infected cells can be recognized by CD8+ T cells. In our study, we demonstrated that LMP7 negatively regulates SARS-CoV-2 replication, as LMP7 knockout promoted viral growth ( Figure 4 Figure 2 Figure 3 Figure 3 Figure S3A,B LMP7 has been shown to be an antiviral factor in several research studies. During rhinovirus infection, airway epithelial immunoproteasome subunit LMP7 was observed to exert anti-inflammatory and antiviral effects, thereby facilitating the resolution of inflammation and a reduction in the viral load [ 29 30 Our study demonstrated that LMP7 deficiency promotes SARS-CoV-2 replication ( Figure 4 Table 1 Figure 1 Figure 2 24 31 32 33 24 34 Antigen presentation mediated by MHC class I molecules is downstream of immunoproteasomes and is a key process in the immune response to SARS-CoV-2 infection, influencing both viral replication and disease progression. The SARS-CoV-2 virus shows a high capacity to suppress the induction of MHC-I in infected cells in vivo [ 35 36 37 Limitations of This Study One of the limitations of this study is the unresolved paradox between the antiviral effects of pharmacological inhibition of LMP7 and the proviral phenotype observed upon LMP7 knockout. Our data suggest that Ixazomib and its analogs likely inhibit coronavirus replication through a mechanism independent of LMP7. However, direct experimental evidence supporting this proposed off-target, immunoproteasome-independent mechanism is currently limited. Future studies are needed to precisely define the molecular basis of this early-stage antiviral activity and to further distinguish between LMP7-specific and LMP7-independent pathways. Additionally, while we used multiple human cell lines to evaluate the consistency of the observed phenotypes, we acknowledge that the use of different cell types with varying levels of susceptibility introduces some degree of variability. Future studies using more physiologically relevant models, such as primary cells or organoids, will be valuable to further validate these findings. Another limitation of this study is the lack of in vivo validation of the antiviral efficacy of Ixazomib and its analogs. While our in vitro results demonstrate potent inhibition of multiple human coronaviruses, including SARS-CoV-2, further studies in appropriate animal models, such as SARS-CoV-2-infected hamsters or transgenic mice, are necessary to confirm the therapeutic potential and safety profile of these compounds in vivo. 5. Conclusions In summary, our study uncovered the role of LMP7 during SARS-CoV-2 infection. LMP7 deficiency promotes viral replication, indicating that LMP7 is a restriction factor for SARS-CoV-2. To counteract this restriction factor, SARS-CoV-2 Nsp13 and Nsp16 interact with LMP7, and expression of Nsp13 or Nsp16 reduces LMP7 at the protein level upon infection. Additionally, Nsp16 alters the subcellular localization of MHC class I molecules responsible for antigen presentation during infection. In parallel, three compounds, #16-14 (Ixazomib), #16-23, and #16-24, are LMP7 inhibitors and can effectively suppress coronavirus replication. But their pharmaceutical mechanism should be LMP7-independent. Acknowledgments We thank J. Trimpert, D. Kunec, and Rocketvax Inc. for making the sCPD9 construct available to us. Y.R. was supported by the LMU–China Scholarship Council Program. The technical help of Susanne Maidl is greatly appreciated. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/pathogens14090871/s1 Author Contributions Conceptualization, A.v.B. and U.A.K.B.; formal analysis, Y.R. and Y.M.-L.; methodology, Y.R., Y.M.-L., C.X., P.L., M.K. and B.v.B.; resources, A.R., C.D., A.P., S.P., M.K., R.D.D. and U.A.K.B.; writing—original draft preparation, Y.R. and Y.M.-L.; funding acquisition, A.v.B.; supervision, A.v.B.; writing—review and editing, Y.R., Y.M.-L., C.X., P.L., B.v.B., A.R., C.D., A.P., S.P., M.K., R.D.D., U.A.K.B. and A.v.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The data is contained within this article or the Supplementary Materials Conflicts of Interest Ulrich A. K. Betz and Markus Klein are employees of Merck KGaA, Darmstadt, Germany. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. References 1. Number of COVID-19 Deaths Reported to WHO (Cumulative Total) Available online: https://data.who.int/dashboards/covid19/deaths?n=c (accessed on 28 March 2025) 2. World Health Organization (WHO) Middle East Respiratory Syndrome: Global Summary and Assessment of Risk WHO Health Emergencies Programme (WHE) Geneva, Switzerland 2022 3. Li W. Shi Z. Yu M. Ren W. Smith C. Epstein J.H. Wang H. Crameri G. Hu Z. Zhang H. Bats are natural reservoirs of SARS-like coronaviruses Science 2005 310 676 679 10.1126/science.1118391 16195424 4. Temmam S. Vongphayloth K. Baquero E. Munier S. Bonomi M. Regnault B. Douangboubpha B. Karami Y. Chretien D. Sanamxay D. Bat coronaviruses related to SARS-CoV-2 and infectious for human cells Nature 2022 604 330 336 10.1038/s41586-022-04532-4 35172323 5. Basler M. Groettrup M. On the Role of the Immunoproteasome in Protein Homeostasis Cells 2021 10 3216 10.3390/cells10113216 34831438 PMC8621243 6. Murata S. Takahama Y. Kasahara M. Tanaka K. The imm unoproteasome and thymoproteasome: Functions, evolution and human disease Nat. Immunol. 2018 19 923 931 10.1038/s41590-018-0186-z 30104634 7. Groettrup M. Kirk C.J. Basler M. Proteasomes in immune cells: More than peptide producers? Nat. Rev. Immunol. 2010 10 73 78 10.1038/nri2687 20010787 8. Niewerth D. van Meerloo J. Jansen G. Assaraf Y.G. Hendrickx T.C. Kirk C.J. Anderl J.L. Zweegman S. Kaspers G.J. Cloos J. Anti-leukemic activity and mechanisms underlying resistance to the novel immunoproteasome inhibitor PR-924 Biochem. Pharmacol. 2014 89 43 51 10.1016/j.bcp.2014.02.005 24552657 9. Wehenkel M. Ban J.O. Ho Y.K. Carmony K.C. Hong J.T. Kim K.B. A selective inhibitor of the immunoproteasome subunit LMP2 induces apoptosis in PC-3 cells and suppresses tumour growth in nude mice Br. J. Cancer 2012 107 53 62 10.1038/bjc.2012.243 22677907 PMC3389428 10. Raedler L.A. Ninlaro (Ixazomib): First Oral Proteasome Inhibitor Approved for the Treatment of Patients with Relapsed or Refractory Multiple Myeloma Am. Health Drug Benefits 2016 9 102 105 27668055 PMC5013850 11. Moreau P. Masszi T. Grzasko N. Bahlis N.J. Hansson M. Pour L. Sandhu I. Ganly P. Baker B.W. Jackson S.R. Oral Ixazomib, Lenalidomide, and Dexamethasone for Multiple Myeloma N. Engl. J. Med. 2016 374 1621 1634 10.1056/NEJMoa1516282 27119237 12. Bergant V. Yamada S. Grass V. Tsukamoto Y. Lavacca T. Krey K. Mühlhofer M.T. Wittmann S. Ensser A. Herrmann A. Attenuation of SARS-CoV-2 replication and associated inflammation by concomitant targeting of viral and host cap 2′-O-ribose methyltransferases EMBO J. 2022 41 e111608 10.15252/embj.2022111608 35833542 PMC9350232 13. Mathieu C. Touret F. Jacquemin C. Janin Y.L. Nougairède A. Brailly M. Mazelier M. Décimo D. Vasseur V. Hans A. A Bioluminescent 3CL(Pro) Activity Assay to Monitor SARS-CoV-2 Replication and Identify Inhibitors Viruses 2021 13 1814 10.3390/v13091814 34578395 PMC8473059 14. Ma-Lauer Y. Li P. Niemeyer D. Richter A. Pusl K. von Brunn B. Ru Y. Xiang C. Schwinghammer S. Liu J. Oxysterole-binding protein targeted by SARS-CoV-2 viral proteins regulates coronavirus replication Front. Cell Infect. Microbiol. 2024 14 1383917 10.3389/fcimb.2024.1383917 39119292 PMC11306179 15. Sanjana N.E. Shalem O. Zhang F. Improved vectors and genome-wide libraries for CRISPR screening Nat. Methods 2014 11 783 784 10.1038/nmeth.3047 25075903 PMC4486245 16. Stewart S.A. Dykxhoorn D.M. Palliser D. Mizuno H. Yu E.Y. An D.S. Sabatini D.M. Chen I.S. Hahn W.C. Sharp P.A. Lentivirus-delivered stable gene silencing by RNAi in primary cells Rna 2003 9 493 501 10.1261/rna.2192803 12649500 PMC1370415 17. van den Worm S.H. Eriksson K.K. Zevenhoven J.C. Weber F. Züst R. Kuri T. Dijkman R. Chang G. Siddell S.G. Snijder E.J. Reverse genetics of SARS-related coronavirus using vaccinia virus-based recombination PLoS ONE 2012 7 e32857 10.1371/journal.pone.0032857 22412934 PMC3296753 18. Stukalov A. Girault V. Grass V. Karayel O. Bergant V. Urban C. Haas D.A. Huang Y. Oubraham L. Wang A. Multilevel proteomics reveals host perturbations by SARS-CoV-2 and SARS-CoV Nature 2021 594 246 252 10.1038/s41586-021-03493-4 33845483 19. Kunec D. Osterrieder N. Trimpert J. Synthetically recoded virus sCPD9—A tool to accelerate SARS-CoV-2 research under biosafety level 2 conditions Comput. Struct. Biotechnol. J. 2022 20 4376 4380 10.1016/j.csbj.2022.08.027 35992535 PMC9375251 20. Nouailles G. Adler J.M. Pennitz P. Peidli S. Teixeira Alves L.G. Baumgardt M. Bushe J. Voss A. Langenhagen A. Langner C. Live-attenuated vaccine sCPD9 elicits superior mucosal and systemic immunity to SARS-CoV-2 variants in hamsters Nat. Microbiol. 2023 8 860 874 10.1038/s41564-023-01352-8 37012419 PMC10159847 21. von Brunn A. Teepe C. Simpson J.C. Pepperkok R. Friedel C.C. Zimmer R. Roberts R. Baric R. Haas J. Analysis of intraviral protein-protein interactions of the SARS coronavirus ORFeome PLoS ONE 2007 2 e459 10.1371/journal.pone.0000459 17520018 PMC1868897 22. Carbajo-Lozoya J. Ma-Lauer Y. Malešević M. Theuerkorn M. Kahlert V. Prell E. von Brunn B. Muth D. Baumert T.F. Drosten C. Human coronavirus NL63 replication is cyclophilin A-dependent and inhibited by non-immunosuppressive cyclosporine A-derivatives including Alisporivir Virus Res. 2014 184 44 53 10.1016/j.virusres.2014.02.010 24566223 PMC7114444 23. Ma-Lauer Y. Zheng Y. Malesevic M. von Brunn B. Fischer G. von Brunn A. Influences of cyclosporin A and non-immunosuppressive derivatives on cellular cyclophilins and viral nucleocapsid protein during human coronavirus 229E replication Antivir. Res. 2020 173 104620 10.1016/j.antiviral.2019.104620 31634494 PMC7114175 24. Sanderson M.P. Friese-Hamim M. Walter-Bausch G. Busch M. Gaus S. Musil D. Rohdich F. Zanelli U. Downey-Kopyscinski S.L. Mitsiades C.S. M3258 Is a Selective Inhibitor of the Immunoproteasome Subunit LMP7 (β5i) Delivering Efficacy in Multiple Myeloma Models Mol. Cancer Ther. 2021 20 1378 1387 10.1158/1535-7163.MCT-21-0005 34045234 PMC9398180 25. Kusov Y. Tan J. Alvarez E. Enjuanes L. Hilgenfeld R. A G-quadruplex-binding macrodomain within the “SARS-unique domain” is essential for the activity of the SARS-coronavirus replication-transcription complex Virology 2015 484 313 322 10.1016/j.virol.2015.06.016 26149721 PMC4567502 26. Lei J. Ma-Lauer Y. Han Y. Thoms M. Buschauer R. Jores J. Thiel V. Beckmann R. Deng W. Leonhardt H. The SARS-unique domain (SUD) of SARS-CoV and SARS-CoV-2 interacts with human Paip1 to enhance viral RNA translation EMBO J. 2021 40 e102277 10.15252/embj.2019102277 33876849 PMC8167360 27. Bartel S. Doellinger J. Darsow K. Bourquain D. Buchholz R. Nitsche A. Lange H.A. Proteome analysis of vaccinia virus IHD-W-infected HEK 293 cells with 2-dimensional gel electrophoresis and MALDI-PSD-TOF MS of on solid phase support N-terminally sulfonated peptides Virol. J. 2011 8 380 10.1186/1743-422X-8-380 21806805 PMC3169512 28. Leone P. Shin E.C. Perosa F. Vacca A. Dammacco F. Racanelli V. MHC class I antigen processing and presenting machinery: Organization, function, and defects in tumor cells J. Natl. Cancer Inst. 2013 105 1172 1187 10.1093/jnci/djt184 23852952 29. Dimasuay K.G. Schaunaman N. Berg B. Cervantes D. Kruger E. Heppner F.L. Ferrington D.A. Chu H.W. Airway epithelial immunoproteasome subunit LMP7 protects against rhinovirus infection Sci. Rep. 2022 12 14507 10.1038/s41598-022-18807-3 36008456 PMC9403975 30. Maelfait J. Roose K. Vereecke L. Mc Guire C. Sze M. Schuijs M.J. Willart M. Ibañez L.I. Hammad H. Lambrecht B.N. A20 Deficiency in Lung Epithelial Cells Protects against Influenza A Virus Infection PLoS Pathog. 2016 12 e1005410 10.1371/journal.ppat.1005410 26815999 PMC4731390 31. Raaben M. Posthuma C.C. Verheije M.H. te Lintelo E.G. Kikkert M. Drijfhout J.W. Snijder E.J. Rottier P.J. de Haan C.A. The ubiquitin-proteasome system plays an important role during various stages of the coronavirus infection cycle J. Virol. 2010 84 7869 7879 10.1128/JVI.00485-10 20484504 PMC2897594 32. Longhitano L. Tibullo D. Giallongo C. Lazzarino G. Tartaglia N. Galimberti S. Li Volti G. Palumbo G.A. Liso A. Proteasome Inhibitors as a Possible Therapy for SARS-CoV-2 Int. J. Mol. Sci. 2020 21 3622 10.3390/ijms21103622 32443911 PMC7279248 33. Yu G.Y. Lai M.M. The ubiquitin-proteasome system facilitates the transfer of murine coronavirus from endosome to cytoplasm during virus entry J. Virol. 2005 79 644 648 10.1128/JVI.79.1.644-648.2005 15596861 PMC538694 34. Jackson C.B. Farzan M. Chen B. Choe H. Mechanisms of SARS-CoV-2 entry into cells Nat. Rev. Mol. Cell Biol. 2022 23 3 20 10.1038/s41580-021-00418-x 34611326 PMC8491763 35. Moriyama M. Lucas C. Monteiro V.S. Iwasaki A. Enhanced inhibition of MHC-I expression by SARS-CoV-2 Omicron subvariants Proc. Natl. Acad. Sci. USA 2023 120 e2221652120 10.1073/pnas.2221652120 37036977 PMC10120007 36. Arshad N. Laurent-Rolle M. Ahmed W.S. Hsu J.C. Mitchell S.M. Pawlak J. Sengupta D. Biswas K.H. Cresswell P. SARS-CoV-2 accessory proteins ORF7a and ORF3a use distinct mechanisms to down-regulate MHC-I surface expression Proc. Natl. Acad. Sci. USA 2023 120 e2208525120 10.1073/pnas.2208525120 36574644 PMC9910621 37. Blum J.S. Wearsch P.A. Cresswell P. Pathways of antigen processing Annu. Rev. Immunol. 2013 31 443 473 10.1146/annurev-immunol-032712-095910 23298205 PMC4026165 Figure 1 The drugs selected from the screening to inhibit coronavirus replication are LMP7 inhibitors. ( A ® n B n n p p p C Figure 2 The effects of the candidate compounds on coronavirus replication and LMP7 expression during SARS-CoV-2 infection. ( A n p p B 18 C D E F Figure 3 The influence of SARS-CoV-2-Nsp13 and -Nsp16 on LMP7 expression and perturbation of HLA-A expression by Nsp16. ( A B Figure 4 LMP7 is an antiviral factor that acts against SARS-CoV-2. ( A B n t p pathogens-14-00871-t001_Table 1 Table 1 IC50 values of immunoproteasome subunit LMP7 inhibitors #16-14 (Ixazomib), #16-23, and #16-24 in a cell-free biochemical assay [ 24 Inhibitor ID IC50 (nM) of LMP7 in Cell-Free Biochemical Assay IC50 (nM) of 229E-Rluc Inhibition in Huh7 Cells #16-14 2.88 26.88 #16-23 1.1 28.40 #16-24 0.3 5.73 ",
  "metadata": {
    "Title of this paper": "Pathways of antigen processing",
    "Journal it was published in:": "Pathogens",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472737/"
  }
}