{
  "title": "Paper_1202",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12466961 PMC12466961.1 12466961 12466961 41008611 10.3390/biom15091304 biomolecules-15-01304 1 Review A Comprehensive Oncological Biomarker Framework Guiding Precision Medicine Mokhtari Reza Bayat 1 2 3 Sambi Manpreet 3 † https://orcid.org/0000-0001-6026-5412 Shekari Faezeh 3 † Satari Kosar 3 https://orcid.org/0000-0002-1825-1284 Ghafoury Roya 3 Ashayeri Neda 3 Eversole Paige 1 Baluch Narges 4 Harless William W. 5 https://orcid.org/0000-0002-1866-8151 Muscarella Lucia Anna 6 Yeger Herman 7 Das Bikul 8 9 https://orcid.org/0000-0001-8471-5481 Szewczuk Myron R. 3 * https://orcid.org/0000-0002-5591-8164 Chakraborty Sayan 1 2 * Cioni Dania Academic Editor Fanni Salvatore Claudio Academic Editor 1 reza.bayatmokhtari@roswellpark.org paige.eversole@roswellpark.org 2 3 m.sambi@queensu.ca faezehshekari@gmail.com sattarikosar99@gmail.com royaghafoury@gmail.com neda.ashayer@gmail.com 4 nbaluch@ucsd.edu 5 wharless@encyt.net 6 l.muscarella@operapadrepio.it 7 hermie@sickkids.ca 8 bikul.das@gmail.com 9 * szewczuk@queensu.ca sayan.chakraborty@roswellpark.org † These authors contributed equally to this work. 10 9 2025 9 2025 15 9 497615 1304 25 7 2025 04 9 2025 08 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Cancer remains a major cause of mortality worldwide, driving ongoing innovation in therapeutic strategies. Immunotherapy has transformed cancer care by leveraging the immune system to target tumors, but its effectiveness is limited by tumor heterogeneity, immune resistance, and unpredictable toxicities. Moreover, the absence of robust biomarkers to predict therapeutic response and manage adverse effects remains a significant challenge. Recent advances in biomarker discovery, including liquid biopsy technologies and gut microbiota profiling, are enhancing the precision of immunotherapy and enabling more personalized cancer management. Here, we present a Comprehensive Oncological Biomarker Framework that integrates genetic and molecular testing, imaging, histopathology, multi-omics, and liquid biopsy to generate a molecular fingerprint for each patient. This holistic approach supports individualized diagnosis, prognosis, treatment selection, and response monitoring. Incorporating emerging biomarkers, such as microbiome signatures, further refines patient stratification, guiding the optimization of therapy. By uniting molecular insights with clinical and social factors, this framework aims to address tumor heterogeneity and immune evasion, ultimately improving patient outcomes through precision oncology. comprehensive oncological biomarker framework cancer immunotherapy biomarkers tumor microenvironment precision medicine gut microbiome Department of Pharmacology and Therapeutics at Roswell Park Comprehensive Cancer Center This work was funded in part by the Department of Pharmacology and Therapeutics at Roswell Park Comprehensive Cancer Center, as well as start-up funds to S.C. and the Developmental Therapeutics (DT) award to S.C. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer remains a leading global health concern. Immunotherapy has transformed treatment paradigms, significantly improving survival rates [ 1 2 3 2 4 Figure 1 Over the last decade, immunotherapy has revolutionized cancer care, resulting in improved survival rates and enhanced quality of life for many patients [ 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 Currently, biomarkers such as programmed death-ligand 1 (PD-L1) expression, microsatellite instability (MSI), and tumor mutational burden (TMB) are used to guide immunotherapy, but their predictive accuracy is limited. Ongoing research is focused on developing and validating new biomarkers, including gene expression profiles, immune cell composition, blood-based signatures, and gut microbiome profiles, to improve patient stratification and treatment precision [ 23 While immunotherapy can activate the immune system against cancer, it may also cause immune-related adverse events (irAEs) (summarized in Table 1 6 24 25 26 6 24 27 28 29 30 31 32 33 Recent advances in oncology have catalyzed the development of integrative strategies for incorporating biomarkers into clinical decision-making [ 34 35 36 37 38 Figure 1 2. Biomarkers Detection A variety of techniques are used to detect biomarkers, including proteins, nucleic acids, and metabolites from both liquid and tissue samples. These technologies advance the continuum from biomarker discovery to clinical validation, addressing key challenges and enabling innovation. Improvements in specificity, sensitivity, and reproducibility are expanding the clinical impact of biomarker research. 2.1. Immunohistochemistry (IHC) and In Situ Hybridization (ISH) IHC and ISH are foundational methods for visualizing molecular targets within tissues and are widely used in both research and clinical settings. While these techniques provide precise localization of biomarkers, discrepancies between them remain, driving ongoing efforts to improve their reliability and accuracy [ 39 40 2.2. Biosensors Biosensors, particularly immunosensors, provide high sensitivity, rapid detection, and non-invasive biomarker analysis. Using biorecognition elements and signal transducers, these sensors convert biological events into measurable electrical signals [ 41 42 43 44 45 46 47 48 2.3. Enzyme-Linked Immunosorbent Assay Enzyme-linked immunosorbent assay (ELISA) is a cornerstone of biomarker detection, relying on the immobilization of antibodies or antigens on solid surfaces for the quantification of antigens or antibodies [ 49 50 51 52 53 54 55 2 56 57 56 57 58 59 2.4. Surface-Enhanced Raman Spectroscopy (SERS) SERS leverages both electromagnetic and chemical enhancements at metal surfaces for ultra-sensitive biomarker detection in complex biological samples [ 60 61 62 63 64 65 66 67 68 69 70 2.5. ATLAS-seq Technology ATLAS-seq (Aptamer-based T Lymphocyte Activity Screening and SEQuencing) represents a novel approach that combines single-cell technology with aptamer-based fluorescent molecular sensors to identify antigen-reactive T cells. The technology enables more effective identification of TCRs with high functional activity for cancer immunotherapy [ 71 3. Types of Biomarkers in Cancer Immunotherapy Biomarkers are defined as measurable characteristics that indicate normal biological processes, disease states, or responses to therapeutic interventions [ 72 73 74 75 76 In cancer immunotherapy, biomarkers are essential for tailoring treatments and predicting patient outcomes. As summarized in Figure 1 77 Figure 1 Our proposed comprehensive oncological framework emphasizes the integration of diverse biomarkers into a holistic approach, equipping clinicians with tools to address each patient’s unique needs. The integration of multi-omics approaches and computational models further refines biomarker-based predictions, supporting more accurate patient stratification and treatment strategies. This strategy enhances the precision of treatment selection, optimizes response assessment, and helps mitigate the risks of severe adverse events, ultimately enabling truly personalized care. 3.1. Diagnostic Biomarkers Diagnostic biomarkers are molecules that indicate the presence of cancer or disease, guiding diagnosis, monitoring, and treatment selection. These markers include tumor-specific and circulating biomarkers, as well as monitoring and treatment selection. These markers include tumor-specific and circulating biomarkers. For instance, Programmed Death-Ligand 1 (PD-L1) expression is the only FDA-approved biomarker for predicting treatments targeting the Programmed Death-1 (PD-1)/PD-L1 pathways, aiding in therapeutic decision-making [ 78 79 80 81 82 83 84 85 86 87 88 Applying diagnostic biomarkers in clinical decision-making requires careful consideration to strike a balance between accuracy and patient outcomes. For rare cancers, such as ovarian or pancreatic cancer, diagnostic biomarkers must exhibit low false-positive rates to minimize unnecessary psychological distress and invasive procedures. In contrast, for more prevalent cancers like breast or prostate cancer, biomarkers should prioritize low false-negative rates to ensure early detection and timely intervention, enhancing the chances of successful treatment [ 73 Although single markers are well-established and widely used as diagnostic tools, combined biomarker panels have demonstrated superior performance [ 89 90 91 92 Table 2 3.2. Screening/Susceptibility Risk Markers Susceptibility or risk biomarkers indicate an individual’s likelihood of developing cancer, even in the absence of a current diagnosis. These markers enable both personalized risk assessment and population-level stratification, supporting early detection and timely intervention [ 93 94 Traditional risk factors have long been used to identify individuals at higher cancer risk. However, advances in genomics, proteomics, lipidomics and microbiomics have led to the development of emerging biomarkers that can significantly improve the sensitivity and specificity of screening panels. For instance, human leukocyte antigen (HLA) class I genotypes influence immunotherapy responses, highlighting the importance of genetic background in cancer risk and treatment outcomes [ 95 96 In immunotherapy, genetic variations have been linked to both treatment efficacy and immune-related adverse events (irAEs). For example, duplications and deletions in genes such as SMAD3, JAK2, PRDM1, CTLA4, and PDCD1 have been associated with immune-related adverse events (irAEs) in melanoma, underscoring the importance of genetic background in predicting outcomes and managing risks. These findings support the development of more personalized immunotherapy strategies based on an individual’s genetic and immunological profile [ 97 Liquid biopsy technologies, such as circulating tumor DNA (ctDNA), provide a minimally invasive approach for detecting and monitoring malignancies. By providing real-time insights into tumor dynamics and the molecular landscape, ctDNA and other circulating biomarkers can refine screening paradigms, enable earlier detection, and allow for better risk stratification of patients [ 98 99 3.3. Predictive Markers Predictive biomarkers in oncology provide information about a patient’s likelihood of responding to specific therapy, guiding treatment decisions and helping to anticipate potential adverse reactions. These markers play a central role in optimizing clinical outcomes by enabling more precise patient selection [ 100 101 102 103 104 105 106 107 107 Combining multiple biomarkers—such as TMB, PD-L1 expression, and microbiome signatures—improves prediction accuracy [ 79 108 109 110 111 112 113 114 16 115 116 Combination therapies, such as nivolumab and ipilimumab, emphasize the need for biomarkers to mitigate severe adverse events [ 103 117 Akkermansia Escherichia coli 118 119 120 Despite advances, predictive biomarkers face challenges due to population variability, TME dynamics, and tumor heterogeneity. Understanding resistance mechanisms, including mutations in the interferon gamma (IFN-γ) signaling pathway and the PI3K-AKT-mTOR pathway, is essential for improving outcomes [ 121 122 123 124 125 126 127 128 129 Serum tumor markers and liquid biopsies have shown promise in monitoring the treatment of advanced lung cancer [ 130 A holistic approach that integrates genetic, molecular, epigenetic, and immune-related biomarkers—potentially analyzed with artificial intelligence and machine learning—will likely provide the most accurate predictions of immunotherapy response. Future research should focus on validating multidimensional biomarker panels across diverse patient populations to fully realize the potential of precision oncology ( Figure 2 3.4. Pharmacodynamic Biomarkers Pharmacodynamic biomarkers are molecular indicators that provide real-time information on how a drug interacts with its target and elicits a biological response. Unlike predictive biomarkers, which help identify suitable candidates for immunotherapy, pharmacodynamic biomarkers offer insights into the biological activity and efficacy of therapeutic agents during treatment (see Table 3 Pharmacodynamic biomarkers provide valuable insights into the mechanisms of action and target effects of drugs. For example, Liao et al. demonstrated that 18F-fluoroestradiol levels measured by positron emission tomography (PET) can serve as pharmacodynamic biomarkers to assess the response to hormonal therapy in metastatic or recurrent estrogen-positive breast cancer [ 131 132 133 134 3.5. Preventive Biomarkers The identification of cancer preventive biomarkers is an emerging focus in oncology, supporting strategies to reduce cancer incidence. Short-chain fatty acids (SCFAs), mainly acetate, propionate, and butyrate produced by gut microbiota, are promising candidates [ 135 136 137 138 139 140 141 142 143 144 Despite their promise, preventive biomarkers are still underdeveloped in oncology. Incorporating them into a comprehensive oncological framework will be crucial for advancing early intervention strategies and improving long-term cancer prevention efforts. 4. Advancing Cancer Immunotherapy Through Companion Diagnostics Companion diagnostics are essential for identifying patients most likely to benefit from specific immunotherapies, thereby improving treatment precision and outcomes. The FDA has approved eleven immune checkpoint inhibitors (ICIs) for cancer therapy, including pembrolizumab, nivolumab, cemiplimab, dostarlimab, and retifanlimab (targeting PD-1); atezolizumab, durvalumab, and avelumab (targeting PD-L1); ipilimumab and tremelimumab (targeting CTLA-4); and relatlimab (targeting LAG-3) [ 145 146 147 148 149 150 151 152 153 154 155 156 Ongoing research continues to identify novel biomarkers that enhance the precision of immunotherapy. Recent studies show that circulating CD4+ T-cell subsets correlate with progression-free and overall survival in NSCLC patients receiving anti-PD-1 therapy, underscoring the value of immune cell profiling as a predictive tool [ 157 5. Gut Microbiota: A Paradigm Shift in Oncology Gut microbiota research has broadened the focus of oncology from tumor cells and the host alone to the complex ecosystem of microorganisms within the human body. This expanded perspective deepens our understanding of cancer biology and opens new avenues for developing innovative therapies, preventive strategies, and diagnostic techniques. Conventional oncology biomarkers often emphasize tumor-specific features or host immune responses, overlooking the crucial influence of gut microbiota on these interactions. Gut microbiota contributes to immune system development from birth, shaping immune responses through early microbial exposure and maturation. They can regulate the proliferation and expression of immune cells, particularly the balance between T helper 17 (Th17) and regulatory T (Treg) cells [ 158 159 160 161 Figure 3 162 163 5.1. The Microbiome: Beyond Bacteria Microbiome research now recognizes that viruses, fungi, and protozoa—beyond bacteria—play important roles in cancer biology and therapy [ 164 165 166 167 168 167 169 170 171 172 173 5.2. Microbiota-Driven Immune Modulation The gut microbiota plays a crucial role in regulating the immune system, influencing both diagnostic and therapeutic outcomes in cancer. It influences immune responses by regulating T-regulatory cells, suppressing myeloid-derived suppressor cells (MDSCs), and activating adaptive immunity through toll-like receptor signaling. By modulating systemic inflammation and cytokine production, the gut microbiota has a significant impact on cancer progression and treatment effectiveness [ 174 175 176 177 177 A diverse gut microbiome enriched with beneficial bacteria, such as Ruminococcaceae and Faecalibacterium, is associated with improved responses to immune checkpoint inhibitors (ICIs). In contrast, reduced microbial diversity and an overabundance of harmful bacteria, such as Bacteroidales, are associated with the diminished efficacy of immunotherapies. Antibiotic-induced dysbiosis further disrupts microbial balance and reduces the effectiveness of ICI, highlighting the importance of maintaining a healthy microbiome during cancer treatment [ 5 178 179 180 181 182 183 184 185 5.3. Microbiome Modulation as a Therapeutic Strategy Manipulating microbiomes is an emerging strategy for improving cancer treatment outcomes and reducing side effects. Approaches include dietary modifications, prebiotics, probiotics, and fecal microbiota transplantation (FMT). Probiotic strains such as Lactobacillus and Bifidobacterium have shown potential to boost immune activation and enhance ICI effectiveness in preclinical models. However, excessive or inappropriate use of probiotics may disrupt microbial balance and compromise treatment efficacy [ 186 187 188 189 190 FMT has gained attention for its ability to restore microbial diversity and improve ICI efficacy in patients resistant to standard treatments. However, FMT poses challenges, including risks of pathogen transmission and variability in donor microbiota, necessitating stringent screening and standardized protocols [ 191 192 193 194 195 196 197 198 199 200 201 Beyond traditional microbiome-targeting strategies, advances in multi-strain bacterial therapies, developed through comparative genomics and systems biology, provide a more refined and personalized approach. These therapies leverage the functional roles of microbial ecosystems across individuals to create targeted therapeutic candidates [ 171 193 202 203 204 205 206 207 A growing understanding of how microbial species and their metabolites influence immune responses is opening new avenues for innovative cancer therapies. The interplay between the gut microbiome and the immune system is now recognized as a key driver of systemic immune regulation, offering opportunities to refine cancer immunotherapy strategies [ 208 209 210 To fully harness the therapeutic potential of microbiome modulation, a comprehensive oncological framework is essential—one that systematically incorporates microbiome profiling, host–microbe interactions, and metabolomic signatures into clinical decision-making. Such a framework would provide critical insights into how individual microbial compositions influence treatment outcomes, allowing for more personalized and predictive cancer therapies. 5.4. Biomarker Bank: Unveiling the Interplay of Cancer Immunotherapy and Gut Microbiome Biobanks are critical for advancing research on gut microbiome and cancer immunotherapy by providing well-organized clinical and microbiome data that link microbial compositions to treatment outcomes. Modern biobanks have evolved from project-specific repositories into comprehensive infrastructures that integrate biological samples with detailed clinical data, enabling large-scale validation studies to identify reliable biomarkers across diverse populations [ 211 212 213 214 5.5. Integrating Gut Microbiota into Comprehensive Oncological Frameworks Integrating insights into gut microbiota into oncology requires a holistic approach that views the human body as a complex ecosystem where microorganisms interact with host processes. To realize the therapeutic potential of the microbiome, challenges such as individual variability in microbiome composition, temporal fluctuations, and methodological inconsistencies must be addressed. Collaborative efforts are needed to standardize assessments and conduct large-scale studies that reveal clinically relevant microbiome signatures. This paradigm shift has the potential to revolutionize cancer care by improving treatment accuracy, enabling early preventive interventions, and advancing diagnostic techniques. Microbiome-driven strategies in oncology can transform patient outcomes by tailoring treatments based on microbial profiles, moving the field toward truly personalized cancer care. A comprehensive oncological framework should emphasize the gut microbiome’s role in regulating immune responses, enhancing antitumor immunity, and improving the efficacy of cancer immunotherapy. Continued research and innovation, including multi-omics integration and computational modeling, will be essential to unlock the full therapeutic potential of the gut microbiota, ultimately leading to improved survival rates and enhanced treatment efficacy for cancer patients. 6. Liquid Biopsy: Promises and Hurdles A liquid biopsy is a minimally invasive technique that utilizes a simple blood sample, thereby reducing patient discomfort and the risks associated with surgical tissue extraction. Its non-invasive nature allows for frequent sampling, enabling clinicians to monitor disease progression and treatment response in real time. By capturing genetic information from multiple tumor sites, liquid biopsy provides a more accurate representation of tumor heterogeneity than single-site tissue biopsies. Additionally, liquid biopsies offer faster turnaround times, supporting timely clinical decision-making and potentially improving patient outcomes [ 215 Circulating tumor DNA (ctDNA) analysis represents a significant technological advancement in liquid biopsy, offering valuable insights into cancer type, grade, and progression [ 216 217 218 219 Extracellular vesicles (EVs), nano-sized particles released by cells, have emerged as novel tools in cancer diagnostics due to their ability to transfer biomolecules, including proteins, lipids, and nucleic acids, between cells. EVs are nano-sized particles released by cells that play a crucial role in intercellular communication by transferring biomolecules such as proteins, lipids, and nucleic acids. Previously regarded as cellular waste, EVs are now recognized as key mediators of intercellular communication, playing critical roles in cancer progression by transferring molecular signals between cells [ 220 221 222 223 224 221 225 226 Figure 4 226 227 228 Implementation in Precision Medicine Liquid biopsy has emerged as a valuable tool in precision medicine, demonstrating significant potential across various cancers, including lung, colorectal, breast, and prostate cancer [ 229 230 231 232 233 Liquid biopsy holds transformative potential by enabling earlier cancer detection and providing real-time insights into disease progression and treatment response ( Figure 4 232 234 7. Biomarker Integration in Combination Therapy Strategies Combination therapy employs multiple treatment modalities, such as immunotherapy, chemotherapy, radiotherapy, and targeted agents, to enhance effectiveness by addressing diverse mechanisms of cancer progression [ 235 236 235 236 237 238 Checkpoint-blocking antibodies, including anti-CTLA-4 and anti-PD-1 therapies, have demonstrated promise in overcoming resistance mechanisms in cancer immunotherapy [ 236 193 239 240 241 The gut microbiome also plays a pivotal role in enhancing the efficacy of anti-PD-1 therapies. Dietary interventions, prebiotics, probiotics, and FMT are under investigation for their potential to boost treatment efficacy. Certain bacterial species, such as Enterococcus hirae and Barnesiella intestinihominis, have been shown to enhance the efficacy of cyclophosphamide by modulating immune responses [ 242 243 244 Combining chemoradiotherapy with anti-PD-1 immunotherapy has shown encouraging results in cancers such as NSCLC, gastric cancer, breast cancer, and hematological malignancies. This synergy enhances tumor immunogenicity, facilitates antigen presentation, and promotes the recognition of tumor cells by T cells. Chemoradiation also increases the tumor mutation burden and reshapes the tumor microenvironment to favor antitumor immunity by modulating cellular and molecular components [ 245 246 247 248 249 Radiotherapy further modifies gene expression within the tumor microenvironment, increasing mutation burden and promoting antigen presentation to enhance T-cell recognition. In NSCLC, radiotherapy has been shown to upregulate PD-L1 expression, thereby influencing immune responses [ 250 251 252 253 254 7.1. Pan-Cancer Approach: Overcoming Challenges of Cancer Heterogeneity and the Tumor Microenvironment Recent advances in cancer immunotherapy have demonstrated significant potential, yet challenges such as cancer heterogeneity and the complexity of the tumor microenvironment (TME) continue to limit treatment effectiveness. Variations within and between tumors—known as inter- and intra-tumoral heterogeneity—impact genetic, epigenetic, and phenotypic characteristics, leading to diverse immune responses and resistance to therapies ( Figure 5 255 255 255 256 The pan-cancer approach addresses these challenges by targeting shared molecular and genetic traits across different cancers, aiming to develop therapies with broader applicability ( Figure 4 Figure 5 91 257 258 259 260 261 262 263 264 265 These shared traits facilitate the development of pan-immunotherapy strategies, expanding treatment options across diverse tumor types. Innovations such as aptamers or antisense oligonucleotides targeting TME components—for example, atezolizumab combined with VEGF inhibitors in pancreatic ductal adenocarcinoma—are being explored to improve efficacy [ 256 266 267 268 269 Microsatellite instability-high (MSI-H): This is an FDA-approved biomarker associated with a high tumor mutational burden and increased neoantigen production. Pembrolizumab has shown efficacy in MSI-H tumors across various cancers [ 255 NTRK gene fusions: There are genetic alterations found across diverse cancers. Larotrectinib targets NTRK fusion-positive tumors with demonstrated clinical success in both adult and pediatric patients [ 256 RET Mutations and Fusions: RET mutations occur in cancers like NSCLC and colorectal cancer. Targeted therapies for RET fusion-positive tumors represent emerging pan-cancer treatment options [ 269 Tumor Mutational Burden (TMB): It predicts enhanced responses to ICIs like pembrolizumab. Its FDA approval for TMB-high solid tumors underscores its importance as a predictive biomarker [ 256 PD-L1 Expression: It is a key biomarker for ICI response in melanoma and NSCLC. However, variability in PD-L1 thresholds highlights the need for standardized testing protocols to improve treatment efficacy [ 255 269 Refining pan-immunotherapy strategies relies on cutting-edge technologies such as CRISPR-based genome editing, synthetic biology, and artificial intelligence (AI)-driven multi-omics analysis to enhance precision and efficacy. These approaches facilitate the discovery of novel biomarkers and the development of advanced therapeutic strategies, including “living drugs” like CAR-T cells engineered to target shared tumor vulnerabilities. CRISPR technologies enable precise genome alterations, allowing researchers to identify immune evasion mechanisms and design targeted interventions to overcome resistance. Artificial chromosome construction presents a promising avenue for developing personalized therapies by integrating multiple genetic modifications to address shared tumor vulnerabilities [ 270 271 Advances in spatial transcriptomics and multiplex immunohistochemistry further complement these technologies by providing insights into spatial interactions within the tumor microenvironment. Leveraging these tools, pan-immunotherapy strategies could lead to the development of more affordable, less toxic treatments that are universally applicable across diverse cancer types. 7.2. Challenges and Opportunities in Combination Therapies Combining immunotherapy with chemotherapy, radiotherapy, or targeted therapy can improve patient outcomes, but these strategies also introduce important challenges that require careful management [ 272 273 Managing the increased risk of side effects, such as immune-related adverse events (irAEs), is another major challenge. Effective monitoring and management protocols are crucial to ensure patient safety. Despite these risks, combination therapies can enhance cancer immunotherapy by targeting multiple pathways, overcoming resistance, activating different components of the immune system, and making tumors more susceptible to immune attack [ 272 274 275 8. Advancing Biomarker Integration in Precision Oncology: Pathways, Challenges, and Innovations Biomarkers are crucial to advancing personalized and precision medicine by enhancing diagnosis, predicting disease outcomes, and informing treatment decisions. Biomarker development is a stepwise process, beginning with the discovery of significant molecular changes using advanced analytical methods. Promising candidates are then validated across diverse patient groups to ensure clinical relevance and cost-effectiveness. This process enables the creation of diagnostic tools that capture the complex relationship between cancer and the immune system, ultimately supporting better patient selection and treatment planning ( Figure 5 Pathologists play a key role in ordering and interpreting biomarker tests. However, translating biomarkers from research to clinical use is a complex process that requires rigorous scientific, clinical, and regulatory evaluation. Because requirements differ by region, pathologists must possess broad expertise to ensure accurate results and minimize errors [ 276 8.1. Technological Innovations in Biomarker Research Recent advances have transformed biomarker research by incorporating technologies such as liquid biopsies, microbiome analysis, and artificial intelligence (AI). For example, in colorectal cancer (CRC), mass spectrometry reanalysis of public proteomics datasets has detailed the proteomic landscape, supporting tumor protein expression assessments and liquid biopsy applications that correlate molecular profiles with patient outcomes [ 277 278 Integrating gut microbiota data with AI frameworks further enhances CRC classification, highlighting the microbiome’s influence on human health and paving the way for advanced diagnostics and therapeutics [ 279 276 8.2. Addressing Regulatory and Technical Challenges Inconsistent testing methods and standards present significant regulatory challenges for implementing biomarkers in clinical care. Collaboration with regulatory agencies such as the FDA and EMA is essential to establish unified validation guidelines and standardized protocols [ 280 281 282 283 8.3. Forward Paths and Upcoming Innovations Cancer immunotherapy research is expanding beyond established biomarkers, such as PD-L1 expression and TMB, to explore neoantigen profiles, circulating tumor DNA, and immune cell infiltration patterns within the tumor microenvironment ( Figure 6 106 284 106 284 Pharmaceutical companies are advancing precision medicine by analyzing patient samples with next-generation sequencing to integrate multi-omics data and develop microbial modulators. These initiatives, supported by standardized methodologies, are creating pathways to novel therapeutic approaches [ 285 286 287 71 Future research must address standardization challenges and establish universal cutoff values for biomarkers to ensure consistent clinical applications [ 115 288 289 290 8.4. The Potential of Comprehensive Biomarker Panels Combining different types of biomarker data—such as tumor characteristics, immune cell counts, signaling proteins, and patient health status—provides a more comprehensive basis for selecting and tailoring cancer treatments. While biomarkers like PD-L1 expression and tumor mutational burden (TMB) can help predict treatment response, their accuracy is limited by tumor heterogeneity, temporal changes, and inconsistencies in testing methods. Continuous monitoring and advanced standardization are needed to refine their clinical utility [ 291 292 293 294 Developing panels that combine tumor features, immune cell counts, and signaling proteins can help predict both the effectiveness of a treatment and the likelihood of side effects, ultimately making cancer therapy safer and more effective [ 295 Figure 7 9. Conclusions The Comprehensive Oncological Framework integrates molecular, genetic, and immune system information to enhance diagnosis, guide therapy selection, and monitor treatment response. By accounting for patient variability and tumor diversity, this approach supports the development of new, individualized strategies in clinical practice. Immunotherapy now plays a central role in cancer treatment alongside surgery, chemotherapy, and radiotherapy. Ongoing research into predictive biomarkers and the gut microbiome underscores the complexity of the immune system’s involvement in cancer progression and therapy response. Factors such as the patient’s immune profile, tumor biology, and disease stage all impact treatment outcomes. Advances in immune checkpoint inhibitors and CAR-T cell therapies have inspired new immunotherapies and strategies to enhance the function of immune cells, including dendritic cells, natural killer cells, and macrophages, thereby improving the targeting of tumors. Researchers are also expanding biomarker discovery to include blood-based and systemic markers, offering a more comprehensive view of treatment effectiveness. The gut microbiome is an emerging focus in immunotherapy research, though challenges remain in identifying which microbes enhance immune responses and in translating findings from animal models to human patients. Future clinical trials are needed to clarify how microbiome-based interventions can be effectively applied in practice. Laboratory and clinical studies are actively testing new biomarker-driven approaches across various cancers. By deepening our understanding of immune-tumor interactions, researchers aim to develop more targeted and personalized therapies with fewer side effects. The next phase of cancer immunotherapy will leverage multiple biomarker types, including gut microbiome profiles, to better match patients with optimal treatments. As research advances, microbiome analysis may become a standard component of cancer care, aiding in treatment prediction and reducing side effects. Continued progress in biomarker-driven precision oncology holds the promise of transforming cancer treatment and improving survival for patients. 10. Outstanding Questions Despite significant advances in understanding the interplay between the gut microbiota and immune checkpoint inhibitor (ICI) therapy, several critical questions remain unanswered. Addressing these gaps is essential for translating current findings into more effective and personalized cancer immunotherapies. The following outstanding questions highlight key areas for future investigation: Mechanistic specificity: What molecular pathways enable Akkermansia and microbial metabolites (e.g., inosine, SCFAs) to selectively enhance antitumor CD8+ T cell activity while suppressing Treg-mediated immunosuppression? Biomarker validation: Can standardized microbial signatures (e.g., Akkermansia abundance, metabolite profiles) reliably predict ICI response across diverse cancer types and patient demographics? Therapeutic optimization: How can microbiome-modulating interventions (e.g., probiotics, fecal transplants) be temporally synchronized with ICI administration to maximize efficacy without exacerbating immune-related adverse events? Ecological dynamics: Does sustained ICI efficacy require persistent colonization of therapeutic microbial strains, or can transient microbiome remodeling induce durable immune reprogramming? Acknowledgments Due to space constraints, the authors would like to thank those researchers in the field whose work could not be cited here. Disclaimer/Publisher’s Note: Author Contributions The idea was conceived by R.B.M., M.R.S. and S.C., R.B.M. wrote the manuscript draft with assistance from M.S., F.S., K.S., R.G., N.A., P.E. and N.B., W.W.H., L.A.M., H.Y., B.D. and M.S. added conceptual thoughts and edited and reviewed the paper. R.B.M. prepared figures with input from S.C. and M.S., S.C. acquired funding and guided the overall concept, providing input on writing and reviewing the entire paper, as well as figure preparation. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not Applicable. Informed Consent Statement Not Applicable. Data Availability Statement All materials are present in the manuscript text. Conflicts of Interest The authors declare that they have no competing interests. Abbreviations The following abbreviations are used in this manuscript: AEs Adverse Events ASCO American Society of Clinical Oncology AgNPs Silver Nanoparticles AuNPs Gold Nanoparticles BRCA1 Breast Cancer Gene 1 BRCA2 Breast Cancer Gene 2 CAR-T Chimeric Antigen Receptor T-cell CAFs Cancer-Associated Fibroblasts cfDNA Cell-Free DNA CIMAC-CIDC Cancer Immune Monitoring and Analysis Centers and Cancer Immunologic Data Commons CPS Combined Positive Score CRC Colorectal Cancer CTCs Circulating Tumor Cells CTLA-4 Cytotoxic T Lymphocyte Associated Antigen 4 ctDNA Circulating Tumor DNA dMMR Defective DNA Mismatch Repair ELISA Enzyme-Linked Immunosorbent Assay FITs Fecal Immunochemical Tests FMT Fecal Microbiota Transplantation FDA Food and Drug Administration gFOBTs Guaiac-Based Fecal Occult Blood Tests GPCRs G-Protein-Coupled Receptors HLA Human Leukocyte Antigen HNSCC Neck Squamous Cell Carcinoma ICB Immune Checkpoint Blockade ICIs Immune Checkpoint Inhibitors IFN-γ Interferon Gamma IHC Immunohistochemistry IL-8 Interleukin-8 IrAEs Immune-Related Events LAG-3 Lymphocyte-Activation Gene 3 MDSCs Myeloid-Derived Suppressor Cells ML Machine Learning MMRd Mismatch Repair Deficiency MSI Microsatellite Instability MSI-H High Microsatellite Instability NCI National Cancer Institute NK Natural killer NSCLC Non-Small Cell Lung Cancer NTRK Neurotrophic Tyrosine Receptor Kinase ORR Overall Response Rates PD-1 Programmed Death-1 PD-L1 Programmed Death-Ligand 1 PEG Polyethylene Glycol PET Positron Emission Tomography PFS Progression-Free Survival PI3k Phosphatidylinositol 3-kinase PKB Phosphorylated Protein Kinase B SCFAs Short-Chain Fatty Acids SERS Surface-Enhanced Raman Spectroscopy TCGA The Cancer Genome Atlas TILs Tumor-Infiltrating Lymphocytes TMB Tumor Mutational Burden TME Tumor Microenvironment References 1. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 2. Emens L.A. Romero P.J. Anderson A.C. Bruno T.C. Capitini C.M. Collyar D. Gulley J.L. Hwu P. Posey A.D. Jr. Silk A.W. Challenges and opportunities in cancer immunotherapy: A Society for Immunotherapy of Cancer (SITC) strategic vision J. Immunother. Cancer 2024 12 e009063 10.1136/jitc-2024-009063 38901879 PMC11191773 3. Oiseth S.J. Aziz M.S. Cancer immunotherapy: A brief review of the history, possibilities, and challenges ahead J. Cancer Metastasis Treat. 2017 3 250 261 10.20517/2394-4722.2017.41 4. Tan S. Li D. Zhu X. Cancer immunotherapy: Pros, cons and beyond Biomed. Pharmacother. 2020 124 109821 10.1016/j.biopha.2020.109821 31962285 5. Gopalakrishnan V. Spencer C.N. Nezi L. Reuben A. Andrews M. Karpinets T. Prieto P. Vicente D. Hoffman K. Wei S.C. Gut microbiome modulates response to anti–PD-1 immunotherapy in melanoma patients Science 2018 359 97 103 10.1126/science.aan4236 29097493 PMC5827966 6. Mokhtari R.B. Sambi M. Qorri B. Baluch N. Ashayeri N. Kumar S. Cheng H.M. Yeger H. Das B. Szewczuk M.R. The Next-Generation of Combination Cancer Immunotherapy: Epigenetic Immunomodulators Transmogrify Immune Training to Enhance Immunotherapy Cancers 2021 13 3596 10.3390/cancers13143596 34298809 PMC8305317 7. Schwabe R.F. Greten T.F. Gut microbiome in HCC—Mechanisms, diagnosis and therapy J. Hepatol. 2020 72 230 238 10.1016/j.jhep.2019.08.016 31954488 8. Routy B. Le Chatelier E. Derosa L. Duong C.P.M. Alou M.T. Daillère R. Fluckiger A. Messaoudene M. Rauber C. Roberti M.P. Gut microbiome influences efficacy of PD-1–based immunotherapy against epithelial tumors Science 2018 359 91 97 10.1126/science.aan3706 29097494 9. Haslam A. Gill J. Prasad V. Estimation of the Percentage of US Patients With Cancer Who Are Eligible for Immune Checkpoint Inhibitor Drugs JAMA Netw. Open 2020 3 e200423 10.1001/jamanetworkopen.2020.0423 32150268 PMC7063495 10. Subbiah V. Solit D.B. Chan T.A. Kurzrock R. The FDA approval of pembrolizumab for adult and pediatric patients with tumor mutational burden (TMB) ≥10: A decision centered on empowering patients and their physicians Ann. Oncol. 2020 31 1115 1118 10.1016/j.annonc.2020.07.002 32771306 11. Emens L.A. Ascierto P.A. Darcy P.K. Demaria S. Eggermont A.M.M. Redmond W.L. Seliger B. Marincola F.M. Cancer immunotherapy: Opportunities and challenges in the rapidly evolving clinical landscape Eur. J. Cancer 2017 81 116 129 10.1016/j.ejca.2017.01.035 28623775 12. Jardim D.L. Goodman A. de Melo Gagliato D. Kurzrock R. The Challenges of Tumor Mutational Burden as an Immunotherapy Biomarker Cancer Cell 2021 39 154 173 10.1016/j.ccell.2020.10.001 33125859 PMC7878292 13. Herbst R.S. Baas P. Kim D.-W. Felip E. Pérez-Gracia J.L. Han J.-Y. Molina J. Kim J.-H. Arvis C.D. Ahn M.-J. Pembrolizumab versus docetaxel for previously treated, PD-L1-positive, advanced non-small-cell lung cancer (KEYNOTE-010): A randomised controlled trial Lancet 2016 387 1540 1550 10.1016/S0140-6736(15)01281-7 26712084 14. Tsimberidou A.M. Levit L.A. Schilsky R.L. Averbuch S.D. Chen D. Kirkwood J.M. McShane L.M. Sharon E. Mileham K.F. Postow M.A. Trial Reporting in Immuno-Oncology (TRIO): An American Society of Clinical Oncology-Society for Immunotherapy of Cancer Statement J. Clin. Oncol. 2019 37 72 80 10.1200/JCO.18.00145 30339040 PMC6354771 15. Kelly R.J. Ajani J.A. Kuzdzal J. Zander T. Van Cutsem E. Piessen G. Mendez G. Feliciano J. Motoyama S. Lièvre A. Adjuvant Nivolumab in Resected Esophageal or Gastroesophageal Junction Cancer N. Engl. J. Med. 2021 384 1191 1203 10.1056/NEJMoa2032125 33789008 16. Marabelle A. Le D.T. Ascierto P.A. Di Giacomo A.M. De Jesus-Acosta A. Delord J.P. Geva R. Gottfried M. Penel N. Hansen A.R. Efficacy of Pembrolizumab in Patients With Noncolorectal High Microsatellite Instability/Mismatch Repair-Deficient Cancer: Results From the Phase II KEYNOTE-158 Study J. Clin. Oncol. 2020 38 1 10 10.1200/JCO.19.02105 31682550 PMC8184060 17. Colombo N. Dubot C. Lorusso D. Caceres M.V. Hasegawa K. Shapira-Frommer R. Tewari K.S. Salman P. Hoyos Usta E. Yañez E. Pembrolizumab for Persistent, Recurrent, or Metastatic Cervical Cancer N. Engl. J. Med. 2021 385 1856 1867 10.1056/NEJMoa2112435 34534429 18. Powles T. Park S.H. Voog E. Caserta C. Valderrama B.P. Gurney H. Kalofonos H. Radulović S. Demey W. Ullén A. Avelumab Maintenance Therapy for Advanced or Metastatic Urothelial Carcinoma N. Engl. J. Med. 2020 383 1218 1230 10.1056/NEJMoa2002788 32945632 19. André T. Shiu K.K. Kim T.W. Jensen B.V. Jensen L.H. Punt C. Smith D. Garcia-Carbonero R. Benavides M. Gibbs P. Pembrolizumab in Microsatellite-Instability-High Advanced Colorectal Cancer N. Engl. J. Med. 2020 383 2207 2218 10.1056/NEJMoa2017699 33264544 20. Lefler D.S. Manobianco S.A. Bashir B. Immunotherapy resistance in solid tumors: Mechanisms and potential solutions Cancer Biol. Ther. 2024 25 2315655 10.1080/15384047.2024.2315655 38389121 PMC10896138 21. Yuan Z. Li Y. Zhang S. Wang X. Dou H. Yu X. Zhang Z. Yang S. Xiao M. Extracellular matrix remodeling in tumor progression and immune escape: From mechanisms to treatments Mol. Cancer 2023 22 48 10.1186/s12943-023-01744-8 36906534 PMC10007858 22. Koustas E. Sarantis P. Papavassiliou A.G. Karamouzis M.V. The resistance mechanisms of checkpoint inhibitors in solid tumors Biomolecules 2020 10 666 10.3390/biom10050666 32344837 PMC7277892 23. Wang Y. Tong Z. Zhang W. Zhang W. Buzdin A. Mu X. Yan Q. Zhao X. Chang H.H. Duhon M. FDA-Approved and Emerging Next Generation Predictive Biomarkers for Immune Checkpoint Inhibitors in Cancer Patients Front. Oncol. 2021 11 683419 10.3389/fonc.2021.683419 34164344 PMC8216110 24. Ling S.P. Ming L.C. Dhaliwal J.S. Gupta M. Ardianto C. Goh K.W. Hussain Z. Shafqat N. Role of Immunotherapy in the Treatment of Cancer: A Systematic Review Cancers 2022 14 5205 10.3390/cancers14215205 36358624 PMC9655090 25. Barber F.D. Adverse events of oncologic immunotherapy and their management Asia-Pac. J. Oncol. Nurs. 2019 6 212 226 10.4103/apjon.apjon_6_19 31259216 PMC6518984 26. Brown T.J. Mamtani R. Bange E.M. Immunotherapy adverse effects JAMA Oncol. 2021 7 1908 10.1001/jamaoncol.2021.5009 34709372 27. Olsen T.A. Zhuang T.Z. Caulfield S. Martini D.J. Brown J.T. Carthon B.C. Kucuk O. Harris W. Bilen M.A. Nazha B. Advances in Knowledge and Management of Immune-Related Adverse Events in Cancer Immunotherapy Front. Endocrinol. 2022 13 779915 10.3389/fendo.2022.779915 PMC8982145 35392134 28. Zhou C. Peng S. Lin A. Jiang A. Peng Y. Gu T. Liu Z. Cheng Q. Zhang J. Luo P. Psychiatric disorders associated with immune checkpoint inhibitors: A pharmacovigilance analysis of the FDA Adverse Event Reporting System (FAERS) database EClinicalMedicine 2023 59 101967 10.1016/j.eclinm.2023.101967 37131541 PMC10149185 29. Cappelli L.C. Shah A.A. Bingham C.O. 3rd Cancer immunotherapy-induced rheumatic diseases emerge as new clinical entities RMD Open 2016 2 e000321 10.1136/rmdopen-2016-000321 27752360 PMC5051426 30. Kumar V. Chaudhary N. Garg M. Floudas C.S. Soni P. Chandra A.B. Current Diagnosis and Management of Immune Related Adverse Events (irAEs) Induced by Immune Checkpoint Inhibitor Therapy Front. Pharmacol. 2017 8 49 10.3389/fphar.2017.00049 28228726 PMC5296331 31. Yan T. Yu L. Zhang J. Chen Y. Fu Y. Tang J. Liao D. Achilles’ Heel of currently approved immune checkpoint inhibitors: Immune related adverse events Front. Immunol. 2024 15 1292122 10.3389/fimmu.2024.1292122 38410506 PMC10895024 32. Lau S.C.M. Leighl N.B. Hyperprogressive disease with immunotherapy: New directions J. Thorac. Dis. 2019 11 S1877 S1880 10.21037/jtd.2019.08.88 31632773 PMC6783768 33. Smithy J.W. Faleck D.M. Postow M.A. Facts and Hopes in Prediction, Diagnosis, and Treatment of Immune-Related Adverse Events Clin. Cancer Res. 2022 28 1250 1257 10.1158/1078-0432.CCR-21-1240 34921018 PMC8976709 34. Yuan M. Zhang C. Von Feilitzen K. Zwahlen M. Shi M. Li X. Yang H. Song X. Turkez H. Uhlén M. The Human Pathology Atlas for deciphering the prognostic features of human cancers EBioMedicine 2025 111 105495 10.1016/j.ebiom.2024.105495 39662180 PMC11683280 35. Chakraborty S. Sharma G. Karmakar S. Banerjee S. Multi-OMICS approaches in cancer biology: New era in cancer therapy Biochim. Biophys. Acta Mol. Basis Dis. 2024 1870 167120 10.1016/j.bbadis.2024.167120 38484941 36. Liang A. Kong Y. Chen Z. Qiu Y. Wu Y. Zhu X. Li Z. Advancements and applications of single-cell multi-omics techniques in cancer research: Unveiling heterogeneity and paving the way for precision therapeutics Biochem. Biophys. Reports 2024 37 101589 10.1016/j.bbrep.2023.101589 PMC10698529 38074997 37. Acharya D. Mukhopadhyay A. A comprehensive review of machine learning techniques for multi-omics data integration: Challenges and applications in precision oncology Brief. Funct. Genom. 2024 23 549 560 10.1093/bfgp/elae013 38600757 38. Shi H.-h. Mugaanyi J. Lu C. Li Y. Huang J. Dai L. A paradigm shift in cancer research based on integrative multi-omics approaches: Glutaminase serves as a pioneering cuproptosis-related gene in pan-cancer BMC Women’s Health 2024 24 213 10.1186/s12905-024-03061-8 38566121 PMC10988933 39. Rehman Z.U. Ahmad Fauzi M.F. Wan Ahmad W.S.H.M. Abas F.S. Cheah P.L. Chiew S.F. Looi L.-M. Review of in situ hybridization (ISH) stain images using computational techniques Diagnostics 2024 14 2089 10.3390/diagnostics14182089 39335767 PMC11430898 40. Eskuri M. Birkman E.M. Kauppila J.H. Gastric cancer molecular classification based on immunohistochemistry and in-situ hybridisation and mortality Histopathology 2024 85 327 337 10.1111/his.15207 38715404 41. Khanmohammadi A. Aghaie A. Vahedi E. Qazvini A. Ghanei M. Afkhami A. Hajian A. Bagheri H. Electrochemical biosensors for the detection of lung cancer biomarkers: A review Talanta 2020 206 120251 10.1016/j.talanta.2019.120251 31514848 42. El Aamri M. Yammouri G. Mohammadi H. Amine A. Korri-Youssoufi H. Electrochemical Biosensors for Detection of MicroRNA as a Cancer Biomarker: Pros and Cons Biosensors 2020 10 186 10.3390/bios10110186 33233700 PMC7699780 43. Yuan X. Lin B. Liu T. Zhang W. Chu Z. Gu X. Ma Z. Jin W. Recent Progress on Nanomaterial-Facilitated Electrochemical Strategies for Cancer Diagnosis Adv. Healthc Mater. 2023 12 e2203029 10.1002/adhm.202203029 36738113 44. Kivrak E. Kara P. Simultaneous detection of ovarian cancer related miRNA biomarkers with carboxylated graphene oxide modified electrochemical biosensor platform Bioelectrochemistry 2025 161 108806 10.1016/j.bioelechem.2024.108806 39244915 45. Mahalakshmi D. Nandhini J. Meenaloshini G. Karthikeyan E. Karthik K. Sujaritha J. Vandhana V. Ragavendran C. Graphene Nanomaterial-Based Electrochemical Biosensors for Salivary Biomarker Detection: A Translational Approach to Oral Cancer Diagnostics Nano TransMed 2025 4 100073 10.1016/j.ntm.2025.100073 46. Zouleh R.S. Rahimnejad M. Najafpour-Darzi G. Sabour D. Design of a microneedle-based enzyme biosensor using a simple and cost-effective electrochemical strategy to monitor superoxide anion released from cancer cells Anal. Biochem. 2025 697 115710 10.1016/j.ab.2024.115710 39500217 47. Kanagavalli P. Elkaffas R.A. Mohideen M.I.H. Eissa S. Electrochemical immunosensor for the predictive cancer biomarker SLFN11 using reduced graphene oxide/MIL-101 (Cr)-NH2 composite Int. J. Biol. Macromol. 2025 285 138174 10.1016/j.ijbiomac.2024.138174 39626816 48. Öndeş B. Kilimci U. Uygun M. Uygun D.A. Determination of carcinoembryonic antigen (CEA) by label-free electrochemical immunosensor using functionalized boron nitride nanosheets Bioelectrochemistry 2024 157 108676 10.1016/j.bioelechem.2024.108676 38431993 49. Aydin S. A short history, principles, and types of ELISA, and our laboratory experience with peptide/protein analyses using ELISA Peptides 2015 72 4 15 10.1016/j.peptides.2015.04.012 25908411 50. Shah K. Maghsoudlou P. Enzyme-linked immunosorbent assay (ELISA): The basics Br. J. Hosp. Med. 2016 77 C98 C101 10.12968/hmed.2016.77.7.C98 27388394 51. Kim D. Herr A.E. Protein immobilization techniques for microfluidic assays Biomicrofluidics 2013 7 41501 10.1063/1.4816934 24003344 PMC3747845 52. Lee J.E. Seo J.H. Kim C.S. Kwon Y. Ha J.H. Choi S.S. Cha H.J. A comparative study on antibody immobilization strategies onto solid surface Korean J. Chem. Eng. 2013 30 1934 1938 10.1007/s11814-013-0117-5 53. Hirsch J.D. Eslamizar L. Filanoski B.J. Malekzadeh N. Haugland R.P. Beechem J.M. Haugland R.P. Easily reversible desthiobiotin binding to streptavidin, avidin, and other biotin-binding proteins: Uses for protein labeling, detection, and isolation Anal. Biochem. 2002 308 343 357 10.1016/S0003-2697(02)00201-4 12419349 54. Dobaño C. Santano R. Jiménez A. Vidal M. Chi J. Melero N.R. Popovic M. López-Aladid R. Fernández-Barat L. Tortajada M. Immunogenicity and crossreactivity of antibodies to the nucleocapsid protein of SARS-CoV-2: Utility and limitations in seroprevalence and immunity studies Transl. Res. 2021 232 60 74 10.1016/j.trsl.2021.02.006 33582244 PMC7879156 55. Nadeem R. Barakat A.B. Bahgat M.M. Cross-reaction between mouse and rat immunoglobulin G: Does it matter in sandwich ELISA? J. Genet. Eng. Biotechnol. 2021 19 1 7 10.1186/s43141-021-00222-2 34403025 PMC8369443 56. Wang X. Zhao M. Nolte D.D. Prostate-specific antigen immunoassays on the BioCD Anal. Bioanal. Chem. 2009 393 1151 1156 10.1007/s00216-008-2370-8 18791869 57. Wang X. Zhao M. Nolte D.D. Ratliff T.L. Prostate specific antigen detection in patient sera by fluorescence-free BioCD protein array Biosens. Bioelectron. 2011 26 1871 1875 10.1016/j.bios.2010.02.009 20236816 PMC4030240 58. Simpson K.L. Whetton A.D. Dive C. Quantitative mass spectrometry-based techniques for clinical use: Biomarker identification and quantification J. Chromatogr. B Analyt. Technol. Biomed. Life Sci. 2009 877 1240 1249 10.1016/j.jchromb.2008.11.023 PMC7185464 19058768 59. Hawkridge A.M. Muddiman D.C. Mass spectrometry-based biomarker discovery: Toward a global proteome index of individuality Annu. Rev. Anal. Chem. 2009 2 265 277 10.1146/annurev.anchem.1.031207.112942 20636062 PMC3140421 60. Plou J. Valera P.S. García I. de Albuquerque C.D.L. Carracedo A. Liz-Marzán L.M. Prospects of Surface-Enhanced Raman Spectroscopy for Biomarker Monitoring toward Precision Medicine ACS Photonics 2022 9 333 350 10.1021/acsphotonics.1c01934 35211644 PMC8855429 61. Zong C. Xu M. Xu L.-J. Wei T. Ma X. Zheng X.-S. Hu R. Ren B. Surface-enhanced Raman spectroscopy for bioanalysis: Reliability and challenges Chem. Rev. 2018 118 4946 4980 10.1021/acs.chemrev.7b00668 29638112 62. Rodal-Cedeira S. Vazquez-Arias A. Bodelon G. Skorikov A. Nunez-Sanchez S. Laporta A. Polavarapu L. Bals S. Liz-Marzan L.M. Perez-Juste J. An expanded surface-enhanced Raman scattering tags library by combinatorial encapsulation of reporter molecules in metal nanoshells ACS Nano 2020 14 14655 14664 10.1021/acsnano.0c04368 32869970 PMC7690041 63. Xi W. Shrestha B.K. Haes A.J. Promoting intra-and intermolecular interactions in surface-enhanced Raman scattering Anal. Chem. 2017 90 128 143 10.1021/acs.analchem.7b04225 29056042 64. Shen W. Lin X. Jiang C. Li C. Lin H. Huang J. Wang S. Liu G. Yan X. Zhong Q. Reliable quantitative SERS analysis facilitated by core—Shell nanoparticles with embedded internal standards Angew. Chem. Int. Ed. 2015 54 7308 7312 10.1002/anie.201502171 25939998 65. Zheng Y. Thai T. Reineck P. Qiu L. Guo Y. Bach U. DNA-directed self-assembly of core-satellite plasmonic nanostructures: A highly sensitive and reproducible near-IR SERS sensor Adv. Funct. Mater. 2013 23 1519 1526 10.1002/adfm.201202073 66. Choi N. Dang H. Das A. Sim M.S. Chung I.Y. Choo J. SERS biosensors for ultrasensitive detection of multiple biomarkers expressed in cancer cells Biosens. Bioelectron. 2020 164 112326 10.1016/j.bios.2020.112326 32553352 67. Liu X. Jia Y. Zheng C. Recent progress in Surface-Enhanced Raman Spectroscopy detection of biomarkers in liquid biopsy for breast cancer Front. Oncol. 2024 14 1400498 10.3389/fonc.2024.1400498 39040452 PMC11260621 68. Wu Y. Wang Y. Mo T. Liu Q. Surface-Enhanced Raman Scattering-based strategies for tumor markers detection: A review Talanta 2024 280 126717 10.1016/j.talanta.2024.126717 39167940 69. Li X. Yang G. Zhang S. Ren H. Advancing clinical cancer care: Unveiling the power of surface-enhanced Raman spectroscopy J. Raman Spectrosc. 2024 55 429 444 10.1002/jrs.6637 70. Huang Y. Wang X. Lai K. Fan Y. Rasco B.A. Trace analysis of organic compounds in foods with surface-enhanced Raman spectroscopy: Methodology, progress, and challenges Compr. Rev. Food Sci. Food Saf. 2020 19 622 642 10.1111/1541-4337.12531 33325168 71. Luo S. Notaro A. Lin L. ATLAS-seq: A microfluidic single-cell TCR screen for antigen-reactive TCRs Nat. Commun. 2025 16 216 10.1038/s41467-024-54675-3 39746936 PMC11696065 72. Group F.-N.B.W. BEST (Biomarkers, EndpointS, and other Tools) Resource Available online: https://www.ncbi.nlm.nih.gov/books/NBK326791/ (accessed on 25 August 2025) 73. Califf R.M. Biomarker definitions and their applications Exp. Biol. Med. 2018 243 213 221 10.1177/1535370217750088 PMC5813875 29405771 74. Gu X. Wei S. Lv X. Circulating tumor cells: From new biological insights to clinical practice Signal Transduct. Target. Ther. 2024 9 226 10.1038/s41392-024-01938-6 39218931 PMC11366768 75. García-Silva S. Peinado H. Mechanisms of lymph node metastasis: An extracellular vesicle perspective Eur. J. Cell Biol. 2024 103 151447 10.1016/j.ejcb.2024.151447 39116620 76. Jerabkova-Roda K. Dupas A. Osmani N. Hyenne V. Goetz J.G. Circulating extracellular vesicles and tumor cells: Sticky partners in metastasis Trends Cancer 2022 8 799 805 10.1016/j.trecan.2022.05.002 35644773 77. Muinao T. Boruah H.P.D. Pal M. Multi-biomarker panel signature as the key to diagnosis of ovarian cancer Heliyon 2019 5 e02826 10.1016/j.heliyon.2019.e02826 31867451 PMC6906658 78. Rossi G. Russo A. Tagliamento M. Tuzi A. Nigro O. Vallome G. Sini C. Grassi M. Dal Bello M.G. Coco S. Precision Medicine for NSCLC in the Era of Immunotherapy: New Biomarkers to Select the Most Suitable Treatment or the Most Suitable Patient Cancers 2020 12 1125 10.3390/cancers12051125 32365882 PMC7281184 79. Garon E.B. Hellmann M.D. Rizvi N.A. Carcereny E. Leighl N.B. Ahn M.J. Eder J.P. Balmanoukian A.S. Aggarwal C. Horn L. Five-Year Overall Survival for Patients With Advanced Non-Small-Cell Lung Cancer Treated With Pembrolizumab: Results From the Phase I KEYNOTE-001 Study J. Clin. Oncol. 2019 37 2518 2527 10.1200/JCO.19.00934 31154919 PMC6768611 80. Shitara K. Van Cutsem E. Bang Y.J. Fuchs C. Wyrwicz L. Lee K.W. Kudaba I. Garrido M. Chung H.C. Lee J. Efficacy and Safety of Pembrolizumab or Pembrolizumab Plus Chemotherapy vs Chemotherapy Alone for Patients With First-line, Advanced Gastric Cancer: The KEYNOTE-062 Phase 3 Randomized Clinical Trial JAMA Oncol. 2020 6 1571 1580 10.1001/jamaoncol.2020.3370 32880601 PMC7489405 81. Emens L.A. Molinero L. Loi S. Rugo H.S. Schneeweiss A. Dieras V. Iwata H. Barrios C.H. Nechaeva M. Nguyen-Duc A. Atezolizumab and nab-Paclitaxel in Advanced Triple-Negative Breast Cancer: Biomarker Evaluation of the IMpassion130 Study J. Natl. Cancer Inst. 2021 113 1005 1016 10.1093/jnci/djab004 33523233 PMC8328980 82. Song R. Liu F. Ping Y. Zhang Y. Wang L. Potential non-invasive biomarkers in tumor immune checkpoint inhibitor therapy: Response and prognosis prediction Biomark. Res. 2023 11 57 10.1186/s40364-023-00498-1 37268978 PMC10236604 83. Kong J. Ha D. Lee J. Kim I. Park M. Im S.H. Shin K. Kim S. Network-based machine learning approach to predict immunotherapy response in cancer patients Nat. Commun. 2022 13 3703 10.1038/s41467-022-31535-6 35764641 PMC9240063 84. Boicean A. Boeras I. Birsan S. Ichim C. Todor S.B. Onisor D.M. Brusnic O. Bacila C. Dura H. Roman-Filip C. In Pursuit of Novel Markers: Unraveling the Potential of miR-106, CEA and CA 19-9 in Gastric Adenocarcinoma Diagnosis and Staging Int. J. Mol. Sci. 2024 25 7898 10.3390/ijms25147898 39063140 PMC11277351 85. Kildusiene I. Dulskas A. Smailyte G. Value of combined serum CEA, CA72-4, and CA19-9 marker detection in diagnosis of colorectal cancer Tech. Coloproctol 2024 28 33 10.1007/s10151-023-02873-4 38358422 86. Kamada T. Ohdaira H. Takahashi J. Aida T. Nakashima K. Ito E. Hata T. Yoshida M. Eto K. Suzuki Y. Novel tumor marker index using carcinoembryonic antigen and carbohydrate antigen 19-9 is a significant prognostic factor for resectable colorectal cancer Sci. Rep. 2024 14 4192 10.1038/s41598-024-54917-w 38378762 PMC10879146 87. Xu C. Jun E. Okugawa Y. Toiyama Y. Borazanci E. Bolton J. Taketomi A. Kim S.C. Shang D. Von Hoff D. A circulating panel of circRNA biomarkers for the noninvasive and early detection of pancreatic ductal adenocarcinoma Gastroenterology 2024 166 178 190.e116 10.1053/j.gastro.2023.09.050 37839499 PMC10843014 88. Heydari R. Abdollahpour-Alitappeh M. Shekari F. Meyfour A. Emerging Role of Extracellular Vesicles in Biomarking the Gastrointestinal Diseases Expert Rev. Mol. Diagn. 2021 21 939 962 10.1080/14737159.2021.1954909 34308738 89. Zhou Y. Tao L. Qiu J. Xu J. Yang X. Zhang Y. Tian X. Guan X. Cen X. Zhao Y. Tumor biomarkers for diagnosis, prognosis and targeted therapy Signal Transduct. Target. Ther. 2024 9 132 10.1038/s41392-024-01823-2 38763973 PMC11102923 90. Ye Q. Ling S. Zheng S. Xu X. Liquid biopsy in hepatocellular carcinoma: Circulating tumor cells and circulating tumor DNA Mol. Cancer 2019 18 114 10.1186/s12943-019-1043-x 31269959 PMC6607541 91. Kapoor A. Bayat Mokhtari R. Sonti S.S. Patel R. George A. Attwood K. Iyer R. Chakraborty S. Circulatory Agrin Serves as a Prognostic Indicator for Hepatocellular Carcinoma Cancers 2024 16 2719 10.3390/cancers16152719 39123447 PMC11312157 92. Jia L. Li G. Ma N. Zhang A. Zhou Y. Ren L. Dong D. Soluble POSTN is a novel biomarker complementing CA153 and CEA for breast cancer diagnosis and metastasis prediction BMC Cancer 2022 22 760 10.1186/s12885-022-09864-y 35831854 PMC9281047 93. Burton H. Chowdhury S. Dent T. Hall A. Pashayan N. Pharoah P. Public health implications from COGS and potential for risk stratification and screening Nat. Genet. 2013 45 349 351 10.1038/ng.2582 23535723 94. Przybytkowski E. Davis T. Hosny A. Eismann J. Matulonis U.A. Wulf G.M. Nabavi S. An immune-centric exploration of BRCA1 and BRCA2 germline mutation related breast and ovarian cancers BMC Cancer 2020 20 197 10.1186/s12885-020-6605-1 32164626 PMC7068944 95. Chowell D. Morris L.G.T. Grigg C.M. Weber J.K. Samstein R.M. Makarov V. Kuo F. Kendall S.M. Requena D. Riaz N. Patient HLA class I genotype influences cancer response to checkpoint blockade immunotherapy Science 2018 359 582 587 10.1126/science.aao4572 29217585 PMC6057471 96. Zwezerijnen-Jiwa F.H. Sivov H. Paizs P. Zafeiropoulou K. Kinross J. A systematic review of microbiome-derived biomarkers for early colorectal cancer detection Neoplasia 2023 36 100868 10.1016/j.neo.2022.100868 36566591 PMC9804137 97. Wölffer M. Battke F. Schulze M. Feldhahn M. Flatz L. Martus P. Forschner A. Biomarkers associated with immune-related adverse events under checkpoint inhibitors in metastatic melanoma Cancers 2022 14 302 10.3390/cancers14020302 35053465 PMC8773840 98. Duffy M.J. Diamandis E.P. Crown J. Circulating tumor DNA (ctDNA) as a pan-cancer screening test: Is it finally on the horizon? Clin. Chem. Lab. Med. 2021 59 1353 1361 10.1515/cclm-2021-0171 33856748 99. Kohaar I. Hodges N.A. Srivastava S. Biomarkers in Cancer Screening: Promises and Challenges in Cancer Early Detection Hematol. Oncol. Clin. North. Am. 2024 38 869 888 10.1016/j.hoc.2024.04.004 38782647 PMC11222039 100. Tarighati E. Keivan H. Mahani H. A review of prognostic and predictive biomarkers in breast cancer Clin. Exp. Med. 2023 23 1 16 10.1007/s10238-021-00781-1 35031885 101. Satgunaseelan L. Sy J. Shivalingam B. Sim H.-W. Alexander K.L. Buckland M.E. Prognostic and predictive biomarkers in central nervous system tumours: The molecular state of play Pathology 2024 56 158 169 10.1016/j.pathol.2023.11.003 38233331 102. Glembocki A.I. Somers G.R. Prognostic and predictive biomarkers in paediatric solid tumours Pathology 2024 56 283 296 10.1016/j.pathol.2023.11.007 38216399 103. Larkin J. Chiarion-Sileni V. Gonzalez R. Grob J.J. Rutkowski P. Lao C.D. Cowey C.L. Schadendorf D. Wagstaff J. Dummer R. Five-Year Survival with Combined Nivolumab and Ipilimumab in Advanced Melanoma N. Engl. J. Med. 2019 381 1535 1546 10.1056/NEJMoa1910836 31562797 104. Hellmann M.D. Paz-Ares L. Bernabe Caro R. Zurawski B. Kim S.-W. Carcereny Costa E. Park K. Alexandru A. Lupinacci L. de la Mora Jimenez E. Nivolumab plus Ipilimumab in Advanced Non–Small-Cell Lung Cancer N. Engl. J. Med. 2019 381 2020 2031 10.1056/NEJMoa1910231 31562796 105. Motzer R.J. Penkov K. Haanen J. Rini B. Albiges L. Campbell M.T. Venugopal B. Kollmannsberger C. Negrier S. Uemura M. Avelumab plus Axitinib versus Sunitinib for Advanced Renal-Cell Carcinoma N. Engl. J. Med. 2019 380 1103 1115 10.1056/NEJMoa1816047 30779531 PMC6716603 106. Reck M. Rodríguez-Abreu D. Robinson A.G. Hui R. Csőszi T. Fülöp A. Gottfried M. Peled N. Tafreshi A. Cuffe S. Pembrolizumab versus Chemotherapy for PD-L1-Positive Non-Small-Cell Lung Cancer N. Engl. J. Med. 2016 375 1823 1833 10.1056/NEJMoa1606774 27718847 107. Maiorano B.A. Di Maio M. Cerbone L. Maiello E. Procopio G. Roviello G. Group M. Significance of PD-L1 in Metastatic Urothelial Carcinoma Treated With Immune Checkpoint Inhibitors: A Systematic Review and Meta-Analysis JAMA Netw. Open 2024 7 e241215 10.1001/jamanetworkopen.2024.1215 38446479 PMC10918499 108. Yamaguchi H. Hsu J.M. Sun L. Wang S.C. Hung M.C. Advances and prospects of biomarkers for immune checkpoint inhibitors Cell Rep. Med. 2024 5 101621 10.1016/j.xcrm.2024.101621 38906149 PMC11293349 109. Herbst R.S. Giaccone G. de Marinis F. Reinmuth N. Vergnenegre A. Barrios C.H. Morise M. Felip E. Andric Z. Geater S. Atezolizumab for First-Line Treatment of PD-L1-Selected Patients with NSCLC N. Engl. J. Med. 2020 383 1328 1339 10.1056/NEJMoa1917346 32997907 110. Anagnostou V. Landon B.V. Medina J.E. Forde P. Velculescu V.E. Translating the evolving molecular landscape of tumors to biomarkers of response for cancer immunotherapy Sci. Transl. Med. 2022 14 eabo3958 10.1126/scitranslmed.abo3958 36350985 PMC9844537 111. Batis N. Brooks J.M. Payne K. Sharma N. Nankivell P. Mehanna H. Lack of predictive tools for conventional and targeted cancer therapy: Barriers to biomarker development and clinical translation Adv. Drug Deliv. Rev. 2021 176 113854 10.1016/j.addr.2021.113854 34192550 PMC8448142 112. Wang T. Denman D. Bacot S.M. Feldman G.M. Challenges and the evolving landscape of assessing blood-based PD-L1 expression as a biomarker for anti-PD-(L) 1 immunotherapy Biomedicines 2022 10 1181 10.3390/biomedicines10051181 35625917 PMC9138337 113. Liu Z. Li Z. Qu J. Zhang R. Zhou X. Li L. Sun K. Tang Z. Jiang H. Li H. Radiomics of Multiparametric MRI for Pretreatment Prediction of Pathologic Complete Response to Neoadjuvant Chemotherapy in Breast Cancer: A Multicenter Study Clin. Cancer Res. 2019 25 3538 3547 10.1158/1078-0432.CCR-18-3190 30842125 114. Addeo A. Friedlaender A. Banna G.L. Weiss G.J. TMB or not TMB as a biomarker: That is the question Crit. Rev. Oncol. Hematol. 2021 163 103374 10.1016/j.critrevonc.2021.103374 34087341 115. Merino D.M. McShane L.M. Fabrizio D. Funari V. Chen S.J. White J.R. Wenz P. Baden J. Barrett J.C. Chaudhary R. Establishing guidelines to harmonize tumor mutational burden (TMB): In silico assessment of variation in TMB quantification across diagnostic platforms: Phase I of the Friends of Cancer Research TMB Harmonization Project J. Immunother. Cancer 2020 8 e000147 10.1136/jitc-2019-000147 32217756 PMC7174078 116. Shi S. Wang Y. Liu Y. Yang Y. Kong J. Gao S. Cui H. Huangfu L. Sun X. Li Z. Predictive value of PD-L1 and TMB for short-term efficacy prognosis in non-small cell lung cancer and construction of prediction models Front. Oncol. 2024 14 1342262 10.3389/fonc.2024.1342262 38756661 PMC11096522 117. Hellmann M.D. Ciuleanu T.E. Pluzanski A. Lee J.S. Otterson G.A. Audigier-Valette C. Minenza E. Linardou H. Burgers S. Salman P. Nivolumab plus Ipilimumab in Lung Cancer with a High Tumor Mutational Burden N. Engl. J. Med. 2018 378 2093 2104 10.1056/NEJMoa1801946 29658845 PMC7193684 118. Dora D. Bokhari S.M.Z. Aloss K. Takacs P. Desnoix J.Z. Szklenárik G. Hurley P.D. Lohinai Z. Implication of the Gut Microbiome and Microbial-Derived Metabolites in Immune-Related Adverse Events: Emergence of Novel Biomarkers for Cancer Immunotherapy Int. J. Mol. Sci. 2023 24 2769 10.3390/ijms24032769 36769093 PMC9916922 119. Chung M.W. Kim M.J. Won E.J. Lee Y.J. Yun Y.W. Cho S.B. Joo Y.E. Hwang J.E. Bae W.K. Chung I.J. Gut microbiome composition can predict the response to nivolumab in advanced hepatocellular carcinoma patients World J. Gastroenterol. 2021 27 7340 7349 10.3748/wjg.v27.i42.7340 34876793 PMC8611200 120. Nomura M. Nagatomo R. Doi K. Shimizu J. Baba K. Saito T. Matsumoto S. Inoue K. Muto M. Association of short-chain fatty acids in the gut microbiome with clinical response to treatment with nivolumab or pembrolizumab in patients with solid cancer tumors JAMA Netw. Open 2020 3 e202895 10.1001/jamanetworkopen.2020.2895 32297948 PMC7163404 121. Sun J.-Y. Zhang D. Wu S. Xu M. Zhou X. Lu X.-J. Ji J. Resistance to PD-1/PD-L1 blockade cancer immunotherapy: Mechanisms, predictive factors, and future perspectives Biomark. Res. 2020 8 35 10.1186/s40364-020-00212-5 32864132 PMC7450549 122. Ren D. Hua Y. Yu B. Ye X. He Z. Li C. Wang J. Mo Y. Wei X. Chen Y. Predictive biomarkers and mechanisms underlying resistance to PD1/PD-L1 blockade cancer immunotherapy Mol. Cancer 2020 19 19 10.1186/s12943-020-1144-6 32000802 PMC6993488 123. Diskin B. Adam S. Cassini M.F. Sanchez G. Liria M. Aykut B. Buttar C. Li E. Sundberg B. Salas R.D. PD-L1 engagement on T cells promotes self-tolerance and suppression of neighboring macrophages and effector T cells in cancer Nat. Immunol. 2020 21 442 454 10.1038/s41590-020-0620-x 32152508 124. Wang Z. Wu X. Study and analysis of antitumor resistance mechanism of PD1/PD-L1 immune checkpoint blocker Cancer Med. 2020 9 8086 8121 10.1002/cam4.3410 32875727 PMC7643687 125. John P. Pulanco M.C. Galbo Jr P.M. Wei Y. Ohaegbulam K.C. Zheng D. Zang X. The immune checkpoint B7x expands tumor-infiltrating Tregs and promotes resistance to anti-CTLA-4 therapy Nat. Commun. 2022 13 2506 10.1038/s41467-022-30143-8 35523809 PMC9076640 126. Zhang H. Dai Z. Wu W. Wang Z. Zhang N. Zhang L. Zeng W.-J. Liu Z. Cheng Q. Regulatory mechanisms of immune checkpoints PD-L1 and CTLA-4 in cancer J. Exp. Clin. Cancer Res. 2021 40 184 10.1186/s13046-021-01987-7 34088360 PMC8178863 127. He Y. Sun M.M. Zhang G.G. Yang J. Chen K.S. Xu W.W. Li B. Targeting PI3K/Akt signal transduction for cancer therapy Signal Transduct. Target. Ther. 2021 6 425 10.1038/s41392-021-00828-5 34916492 PMC8677728 128. Conciatori F. Bazzichetto C. Falcone I. Ciuffreda L. Ferretti G. Vari S. Ferraresi V. Cognetti F. Milella M. PTEN function at the interface between cancer and tumor microenvironment: Implications for response to immunotherapy Int. J. Mol. Sci. 2020 21 5337 10.3390/ijms21155337 32727102 PMC7432882 129. O’Donnell J.S. Massi D. Teng M.W. Mandala M. PI3K-AKT-mTOR inhibition in cancer immunotherapy, redux Semin. Cancer Biol. 2018 48 91 103 10.1016/j.semcancer.2017.04.015 28467889 130. van den Heuvel M. Holdenrieder S. Schuurbiers M. Cigoianu D. Trulson I. van Rossum H. Lang D. Serum tumor markers for response prediction and monitoring of advanced lung cancer: A review focusing on immunotherapy and targeted therapies Tumor Biol. 2024 46 S233 S268 10.3233/TUB-220039 37248927 131. Liao G.J. Clark A.S. Schubert E.K. Mankoff D.A. 18F-Fluoroestradiol PET: Current Status and Potential Future Clinical Applications J. Nucl. Med. 2016 57 1269 1275 10.2967/jnumed.116.175596 27307345 132. Morschhauser F. Machiels J.P. Salles G. Rottey S. Rule S.A.J. Cunningham D. Peyrade F. Fruchart C. Arkenau H.T. Genvresse I. On-Target Pharmacodynamic Activity of the PI3K Inhibitor Copanlisib in Paired Biopsies from Patients with Malignant Lymphoma and Advanced Solid Tumors Mol. Cancer Ther. 2020 19 468 478 10.1158/1535-7163.MCT-19-0466 31619463 133. Lambert S.L. Zhang C. Guo C. Turan T. Masica D.L. Englert S. Fang Y. Sheridan J. McLaughlin R.T. Tribouley C. Association of Baseline and Pharmacodynamic Biomarkers With Outcomes in Patients Treated With the PD-1 Inhibitor Budigalimab J. Immunother. 2022 45 167 179 10.1097/CJI.0000000000000408 35034046 PMC8906246 134. Salawu A. Hernando-Calvo A. Chen R.Y. Araujo D.V. Oliva M. Liu Z.A. Siu L.L. Impact of pharmacodynamic biomarkers in immuno-oncology phase 1 clinical trials Eur. J. Cancer 2022 173 167 177 10.1016/j.ejca.2022.06.045 35872510 135. Hou M. Yu Q.Q. Yang L. Zhao H. Jiang P. Qin L. Zhang Q. The role of short-chain fatty acid metabolism in the pathogenesis, diagnosis and treatment of cancer Front. Oncol. 2024 14 1451045 10.3389/fonc.2024.1451045 39435279 PMC11491288 136. Li S. Duan Y. Luo S. Zhou F. Wu Q. Lu Z. Short-chain fatty acids and cancer Trends Cancer 2025 11 154 168 10.1016/j.trecan.2024.11.003 39638744 137. Ediriweera M.K. Fatty acids as histone deacetylase inhibitors: Old biochemistry tales in a new life sciences town Drug Discov. Today 2023 28 103569 10.1016/j.drudis.2023.103569 36990144 138. Thulasinathan B. Suvilesh K.N. Maram S. Grossmann E. Ghouri Y. Teixeiro E.P. Chan J. Kaifi J.T. Rachagani S. The impact of gut microbial short-chain fatty acids on colorectal cancer development and prevention Gut Microbes 2025 17 2483780 10.1080/19490976.2025.2483780 40189834 PMC11980463 139. Moniri N.H. Farah Q. Short-chain free-fatty acid G protein-coupled receptors in colon cancer Biochem. Pharmacol. 2021 186 114483 10.1016/j.bcp.2021.114483 33631190 140. Li Y. Huang Y. Liang H. Wang W. Li B. Liu T. Huang Y. Zhang Z. Qin Y. Zhou X. The roles and applications of short-chain fatty acids derived from microbial fermentation of dietary fibers in human cancer Front. Nutr. 2023 10 1243390 10.3389/fnut.2023.1243390 37614742 PMC10442828 141. Kalyanaraman B. Cheng G. Hardy M. The role of short-chain fatty acids in cancer prevention and cancer treatment Arch. Biochem. Biophys. 2024 761 110172 10.1016/j.abb.2024.110172 39369836 PMC11784870 142. Son M.Y. Cho H.S. Anticancer Effects of Gut Microbiota-Derived Short-Chain Fatty Acids in Cancers J. Microbiol. Biotechnol. 2023 33 849 856 10.4014/jmb.2301.01031 37100764 PMC10394342 143. Donohoe D.R. Collins L.B. Wali A. Bigler R. Sun W. Bultman S.J. The Warburg effect dictates the mechanism of butyrate-mediated histone acetylation and cell proliferation Mol. Cell 2012 48 612 626 10.1016/j.molcel.2012.08.033 23063526 PMC3513569 144. Oncel S. Safratowich B.D. Zeng H. The Protective Potential of Butyrate against Colon Cancer Cell Migration and Invasion Is Critically Dependent on Cell Type Mol. Nutr. Food Res. 2024 68 2400421 10.1002/mnfr.202400421 39328085 145. Kaufman H.L. Russell J. Hamid O. Bhatia S. Terheyden P. D’Angelo S.P. Shih K.C. Lebbé C. Linette G.P. Milella M. Avelumab in patients with chemotherapy-refractory metastatic Merkel cell carcinoma: A multicentre, single-group, open-label, phase 2 trial Lancet Oncol. 2016 17 1374 1385 10.1016/S1470-2045(16)30364-3 27592805 PMC5587154 146. Su J. Fu Y. Cui Z. Abidin Z. Yuan J. Zhang X. Li R. Zhao C. Relatlimab: A novel drug targeting immune checkpoint LAG-3 in melanoma therapy Front. Pharmacol. 2023 14 1349081 10.3389/fphar.2023.1349081 38269271 PMC10806167 147. Patel T.H. Brewer J.R. Fan J. Cheng J. Shen Y.L. Xiang Y. Zhao H. Lemery S.J. Pazdur R. Kluetz P.G. FDA Approval Summary: Tremelimumab in Combination with Durvalumab for the Treatment of Patients with Unresectable Hepatocellular Carcinoma Clin. Cancer Res. 2024 30 269 273 10.1158/1078-0432.Ccr-23-2124 37676259 PMC10841291 148. Shaukat A. Khan A. Riaz R. Batool U.E.A. Malikzai A. Retifanlimab: A breakthrough for the management of Merkel cell carcinoma IJS Oncol. 2023 8 18 20 10.1097/ij9.0000000000000116 149. Incorvaia L. Fanale D. Badalamenti G. Barraco N. Bono M. Corsini L.R. Galvano A. Gristina V. Listì A. Vieni S. Programmed death ligand 1 (PD-L1) as a predictive biomarker for pembrolizumab therapy in patients with advanced non-small-cell lung cancer (NSCLC) Adv. Ther. 2019 36 2600 2617 10.1007/s12325-019-01057-7 31432460 PMC6822831 150. Ding J. Yeong C. Advances in DLL3-targeted therapies for small cell lung cancer: Challenges, opportunities, and future directions Front. Oncol. 2024 14 1504139 10.3389/fonc.2024.1504139 39703856 PMC11655346 151. Paz-Ares L. Champiat S. Lai W.V. Izumi H. Govindan R. Boyer M. Hummel H.-D. Borghaei H. Johnson M.L. Steeghs N. Tarlatamab, a First-in-Class DLL3-Targeted Bispecific T-Cell Engager, in Recurrent Small-Cell Lung Cancer: An Open-Label, Phase I Study J. Clin. Oncol. 2023 41 2893 2903 10.1200/jco.22.02823 36689692 PMC10414718 152. Shanehbandi D. Majidi J. Kazemi T. Baradaran B. Aghebati-Maleki L. CD20-based immunotherapy of B-cell derived hematologic malignancies Curr. Cancer Drug Targets 2017 17 423 444 10.2174/1568009617666170109151128 28067179 153. Lica J.J. Pradhan B. Safi K. Jakóbkiewicz-Banecka J. Hellmann A. Promising therapeutic strategies for hematologic malignancies: Innovations and potential Molecules 2024 29 4280 10.3390/molecules29174280 39275127 PMC11397263 154. Freitas M.B. Gullo I. Leitão D. Águas L. Oliveira C. Polónia A. Gomes J. Carneiro F. Reis C.A. Duarte H.O. HER2 and PD-L1 Expression in Gastric and Gastroesophageal Junction Cancer: Insights for Combinatorial Targeting Approaches Cancers 2024 16 1227 10.3390/cancers16061227 38539559 PMC10969487 155. Skórzewska M. Gęca K. Polkowski W.P. A Clinical Viewpoint on the Use of Targeted Therapy in Advanced Gastric Cancer Cancers 2023 15 5490 10.3390/cancers15225490 38001751 PMC10670421 156. Carlino F. Diana A. Piccolo A. Ventriglia A. Bruno V. De Santo I. Letizia O. De Vita F. Daniele B. Ciardiello F. Immune-Based Therapy in Triple-Negative Breast Cancer: From Molecular Biology to Clinical Practice Cancers 2022 14 2102 10.3390/cancers14092102 35565233 PMC9103968 157. Hou J. Yang X. Xie S. Zhu B. Zha H. Circulating T cells: A promising biomarker of anti-PD-(L)1 therapy Front. Immunol. 2024 15 1371559 10.3389/fimmu.2024.1371559 38576625 PMC10991692 158. Wang J. Hou Y. Mu L. Yang M. Ai X. Gut microbiota contributes to the intestinal and extraintestinal immune homeostasis by balancing Th17/Treg cells Int. Immunopharmacol. 2024 143 113570 10.1016/j.intimp.2024.113570 39547012 159. Wu X.Q. Ying F. Chung K.P.S. Leung C.O.N. Leung R.W.H. So K.K.H. Lei M.M.L. Chau W.K. Tong M. Yu J. Intestinal Akkermansia muciniphila complements the efficacy of PD1 therapy in MAFLD-related hepatocellular carcinoma Cell Rep. Med. 2025 6 101900 10.1016/j.xcrm.2024.101900 39798567 PMC11866522 160. Cao M. Deng Y. Hao Q. Yan H. Wang Q.L. Dong C. Wu J. He Y. Huang L.B. Xia X. Single-cell transcriptomic analysis reveals gut microbiota-immunotherapy synergy through modulating tumor microenvironment Signal Transduct. Target. Ther. 2025 10 140 10.1038/s41392-025-02226-7 40312419 PMC12045981 161. Sun J. Song S. Liu J. Chen F. Li X. Wu G. Gut microbiota as a new target for anticancer therapy: From mechanism to means of regulation NPJ Biofilms Microbiomes 2025 11 43 10.1038/s41522-025-00678-x 40069181 PMC11897378 162. Koulouris A. Tsagkaris C. Messaritakis I. Gouvas N. Sfakianaki M. Trypaki M. Spyrou V. Christodoulakis M. Athanasakis E. Xynos E. Resectable colorectal cancer: Current perceptions on the correlation of recurrence risk, microbiota and detection of genetic mutations in liquid biopsies Cancers 2021 13 3522 10.3390/cancers13143522 34298740 PMC8304269 163. Herrera-Quintana L. Vázquez-Lorente H. Lopez-Garzon M. Cortés-Martín A. Plaza-Diaz J. Cancer and the Microbiome of the Human Body Nutrients 2024 16 2790 10.3390/nu16162790 39203926 PMC11357655 164. Haque H. Zehra S.W. Shahzaib M. Abbas S. Jaffar N. Beyond bacteria: Role of non-bacterial gut microbiota species in inflammatory bowel disease and colorectal cancer progression World J. Gastroenterol. 2024 30 4078 4082 10.3748/wjg.v30.i36.4078 39351246 PMC11439122 165. Jaswal K. Todd O.A. Behnsen J. Neglected gut microbiome: Interactions of the non-bacterial gut microbiota with enteric pathogens Gut Microbes 2023 15 2226916 10.1080/19490976.2023.2226916 37365731 PMC10305517 166. Zong Z. Zhou F. Zhang L. The fungal mycobiome: A new hallmark of cancer revealed by pan-cancer analyses Signal Transduct. Target. Ther. 2023 8 50 10.1038/s41392-023-01334-6 36725834 PMC9892023 167. Gamal A. Elshaer M. Alabdely M. Kadry A. McCormick T.S. Ghannoum M. The Mycobiome: Cancer Pathogenesis, Diagnosis, and Therapy Cancers 2022 14 2875 10.3390/cancers14122875 35740541 PMC9221014 168. Tamayo-Trujillo R. Guevara-Ramírez P. Cadena-Ullauri S. Paz-Cruz E. Ruiz-Pozo V.A. Zambrano A.K. Human virome: Implications in cancer Heliyon 2023 9 e14086 10.1016/j.heliyon.2023.e14086 36873548 PMC9957661 169. Stern J. Miller G. Li X. Saxena D. Virome and bacteriome: Two sides of the same coin Curr. Opin. Virol. 2019 37 37 43 10.1016/j.coviro.2019.05.007 31177014 PMC6768692 170. Konatala A. Parackel F. Sudhakar P. Recent Advancements in Microbiome–Immune Homeostasis and their Involvement in Cancer Immunotherapy Microbiome in Human Health and Disease Springer Singapore 2021 239 258 10.1007/978-981-16-3156-6_12 171. Matson V. Chervin C.S. Gajewski T.F. Cancer and the microbiome—Influence of the commensal microbiota on cancer, immune responses, and immunotherapy Gastroenterology 2021 160 600 613 10.1053/j.gastro.2020.11.041 33253684 PMC8409239 172. Zitvogel L. Ma Y. Raoult D. Kroemer G. Gajewski T.F. The microbiome in cancer immunotherapy: Diagnostic tools and therapeutic strategies Science 2018 359 1366 1370 10.1126/science.aar6918 29567708 173. Chung I.-Y. Kim J. Koh A. The microbiome matters: Its impact on cancer development and therapeutic responses J. Microbiol. 2024 62 137 152 10.1007/s12275-024-00110-7 38587593 174. Yoo J.Y. Groer M. Dutra S.V.O. Sarkar A. McSkimming D.I. Gut microbiota and immune system interactions Microorganisms 2020 8 1587 10.3390/microorganisms8101587 33076307 PMC7602490 175. Ge Y. Wang X. Guo Y. Yan J. Abuduwaili A. Aximujiang K. Yan J. Wu M. Gut microbiota influence tumor development and Alter interactions with the human immune system J. Exp. Clin. Cancer Res. 2021 40 42 10.1186/s13046-021-01845-6 33494784 PMC7829621 176. Zhou C.-B. Zhou Y.-L. Fang J.-Y. Gut microbiota in cancer immune response and immunotherapy Trends Cancer 2021 7 647 660 10.1016/j.trecan.2021.01.010 33674230 177. Abidin Z.Z. Kamaruddin N.S. Hein Z.M. Nassir C.M.N.C.M. Ramli M.D.C. The Gut-Brain Axis and Depression: Understanding Microbiota-Driven Mechanisms and Novel Therapeutic Strategies Preprints 2025 10.20944/preprints202501.2104.v1 178. Aron-Wisnewsky J. Vigliotti C. Witjes J. Le P. Holleboom A.G. Verheij J. Nieuwdorp M. Clément K. Gut microbiota and human NAFLD: Disentangling microbial signatures from metabolic disorders Nat. Rev. Gastroenterol. Hepatol. 2020 17 279 297 10.1038/s41575-020-0269-9 32152478 179. Tao J. Li S. Gan R.-Y. Zhao C.-N. Meng X. Li H.-B. Targeting gut microbiota with dietary components on cancer: Effects and potential mechanisms of action Crit. Rev. Food Sci. Nutr. 2020 60 1025 1037 10.1080/10408398.2018.1555789 30632784 180. Oey O. Liu Y.Y. Sunjaya A.F. Simadibrata D.M. Khattak M.A. Gray E. Gut microbiota diversity and composition in predicting immunotherapy response and immunotherapy-related colitis in melanoma patients: A systematic review World J. Clin. Oncol. 2022 13 929 942 10.5306/wjco.v13.i11.929 36483977 PMC9724183 181. Lalani A.-K.A. Xie W. Braun D.A. Kaymakcalan M. Bossé D. Steinharter J.A. Martini D.J. Simantov R. Lin X. Wei X.X. Effect of antibiotic use on outcomes with systemic therapies in metastatic renal cell carcinoma Eur. Urol. Oncol. 2020 3 372 381 10.1016/j.euo.2019.09.001 31562048 PMC9163676 182. Pinato D.J. Howlett S. Ottaviani D. Urus H. Patel A. Mineo T. Brock C. Power D. Hatcher O. Falconer A. Association of prior antibiotic treatment with survival and response to immune checkpoint inhibitor therapy in patients with cancer JAMA Oncol. 2019 5 1774 1778 10.1001/jamaoncol.2019.2785 31513236 PMC6743060 183. Tinsley N. Zhou C. Tan G. Rack S. Lorigan P. Blackhall F. Krebs M. Carter L. Thistlethwaite F. Graham D. Cumulative antibiotic use significantly decreases efficacy of checkpoint inhibitors in patients with advanced cancer Oncologist 2020 25 55 63 10.1634/theoncologist.2019-0160 31292268 PMC6964118 184. Wilson B.E. Routy B. Nagrial A. Chin V.T. The effect of antibiotics on clinical outcomes in immune-checkpoint blockade: A systematic review and meta-analysis of observational studies Cancer Immunol. Immunother. 2020 69 343 354 10.1007/s00262-019-02453-2 31865400 PMC11027824 185. Said S.S. Ibrahim W.N. Gut Microbiota–Tumor Microenvironment Interactions: Mechanisms and Clinical Implications for Immune Checkpoint Inhibitor Efficacy in Cancer Cancer Manag. Res. 2025 17 171 192 10.2147/CMAR.S405590 39881948 PMC11776928 186. Wang S. Xu B. Zhang Y. Chen G. Zhao P. Gao Q. Yuan L. The role of intestinal flora on tumorigenesis, progression, and the efficacy of PD-1/PD-L1 antibodies in colorectal cancer Cancer Biol. Med. 2024 21 65 82 10.20892/j.issn.2095-3941.2023.0376 38148328 PMC10875280 187. Lee S.-H. Cho S.-Y. Yoon Y. Park C. Sohn J. Jeong J.-J. Jeon B.-N. Jang M. An C. Lee S. Bifidobacterium bifidum strains synergize with immune checkpoint inhibitors to reduce tumour burden in mice Nat. Microbiol. 2021 6 277 288 10.1038/s41564-020-00831-6 33432149 188. Kaźmierczak-Siedlecka K. Roviello G. Catalano M. Polom K. Gut microbiota modulation in the context of immune-related aspects of Lactobacillus spp. and Bifidobacterium spp. in gastrointestinal cancers Nutrients 2021 13 2674 10.3390/nu13082674 34444834 PMC8401094 189. Lee K.A. Shaw H.M. Bataille V. Nathan P. Spector T.D. Role of the gut microbiome for cancer patients receiving immunotherapy: Dietary and treatment implications Eur. J. Cancer 2020 138 149 155 10.1016/j.ejca.2020.07.026 32889369 190. Boucher E. Plazy C. Richard M.L. Suau A. Mangin I. Cornet M. Aldebert D. Toussaint B. Hannani D. Inulin prebiotic reinforces host cancer immunosurveillance via ɣδ T cell activation Front. Immunol. 2023 14 1104224 10.3389/fimmu.2023.1104224 36875124 PMC9981629 191. Gharaibeh R.Z. Jobin C. Microbiota and cancer immunotherapy: In search of microbial signals Gut 2019 68 385 388 10.1136/gutjnl-2018-317220 30530851 PMC6580757 192. Kang Y.-B. Cai Y. Faecal microbiota transplantation enhances efficacy of immune checkpoint inhibitors therapy against cancer World J. Gastroenterol. 2021 27 5362 5375 10.3748/wjg.v27.i32.5362 34539138 PMC8409158 193. Lu Y. Yuan X. Wang M. He Z. Li H. Wang J. Li Q. Gut microbiota influence immunotherapy responses: Mechanisms and therapeutic strategies J. Hematol. Oncol. 2022 15 47 10.1186/s13045-022-01273-9 35488243 PMC9052532 194. McQuade J.L. Ologun G.O. Arora R. Wargo J.A. Gut microbiome modulation via fecal microbiota transplant to augment immunotherapy in patients with melanoma or other cancers Curr. Oncol. Rep. 2020 22 74 10.1007/s11912-020-00913-y 32577835 PMC7685568 195. Ali H. Khurana S. Ma W. Peng Y. Jiang Z.-D. DuPont H. Zhang H.C. Thomas A.S. Okhuysen P. Wang Y. Safety and efficacy of fecal microbiota transplantation to treat and prevent recurrent Clostridioides difficile in cancer patients J. Cancer 2021 12 6498 6506 10.7150/jca.59251 34659541 PMC8489149 196. Subramanian C.R. Talluri S. Khan S.U. Katz J.A. Georgetson M. Sinh P. Fecal Microbiota Transplantation for Recurrent Clostridium difficile Infection in Patients With Multiple Comorbidities: Long-Term Safety and Efficacy Results From a Tertiary Care Community Hospital Gastroenterol. Res. 2020 13 138 145 10.14740/gr1275 32864024 PMC7433372 197. Hu W.-T. Zhang Q. Zhang Z. He X. Zhou M. Guo Y. Wang X. Eosinophil and IFN-γ associated with immune-related adverse events as prognostic markers in patients with non-small cell lung cancer treated with immunotherapy Front. Immunol. 2023 14 1112409 10.3389/fimmu.2023.1112409 36949952 PMC10025375 198. Xu X. Ying J. Gut microbiota and immunotherapy Front. Microbiol. 2022 13 945887 10.3389/fmicb.2022.945887 35847121 PMC9283110 199. Woelk C.H. Snyder A. Modulating gut microbiota to treat cancer Science 2021 371 573 574 10.1126/science.abg2904 33542126 200. Sun J.Y. Yin T.L. Zhou J. Xu J. Lu X.J. Gut microbiome and cancer immunotherapy J. Cell. Physiol. 2020 235 4082 4088 10.1002/jcp.29359 31663125 201. Khan M.A.W. Ologun G. Arora R. McQuade J.L. Wargo J.A. Gut microbiome modulates response to cancer immunotherapy Dig. Dis. Sci. 2020 65 885 896 10.1007/s10620-020-06111-x 32067144 PMC7678709 202. Bae J. Park K. Kim Y.-M. Commensal microbiota and cancer immunotherapy: Harnessing commensal bacteria for cancer therapy Immune Netw. 2022 22 e3 10.4110/in.2022.22.e3 35291651 PMC8901697 203. Derosa L. Routy B. Fidelle M. Iebba V. Alla L. Pasolli E. Segata N. Desnoyer A. Pietrantonio F. Ferrere G. Gut bacteria composition drives primary resistance to cancer immunotherapy in renal cell carcinoma patients Eur. Urol. 2020 78 195 206 10.1016/j.eururo.2020.04.044 32376136 204. Luke J.J. Piha-Paul S.A. Medina T. Verschraegen C.F. Varterasian M. Brennan A.M. Riese R.J. Sokolovska A. Strauss J. Hava D.L. Phase I Study of SYNB1891, an Engineered E. coli Nissle Strain Expressing STING Agonist, with and without Atezolizumab in Advanced Malignancies Clin. Cancer Res. 2023 29 2435 2444 10.1158/1078-0432.CCR-23-0118 37227176 PMC11225568 205. Riese R. Luke J. Lewis K. Janku F. Piha-Paul S. Verschraegen C. Brennan A. Armstrong M. Varterasian M. Sokolovska A. 500 SYNB1891, a bacterium engineered to produce a STING agonist, demonstrates target engagement in humans following intratumoral injection J. Immunother. Cancer 2021 9 A1 A1054 10.1136/jitc-2021-sitc2021.500 206. Luo K. Li N. Ye W. Gao H. Luo X. Cheng B. Activation of stimulation of interferon genes (STING) signal and cancer immunotherapy Molecules 2022 27 4638 10.3390/molecules27144638 35889509 PMC9325158 207. Canale F.P. Basso C. Antonini G. Perotti M. Li N. Sokolovska A. Neumann J. James M.J. Geiger S. Jin W. Metabolic modulation of tumours with engineered bacteria for immunotherapy Nature 2021 598 662 666 10.1038/s41586-021-04003-2 34616044 208. Spencer K.R. Wang J. Silk A.W. Ganesan S. Kaufman H.L. Mehnert J.M. Biomarkers for immunotherapy: Current developments and challenges Am. Soc. Clin. Oncol. Educ. Book 2016 36 e493 e503 10.1200/EDBK_160766 27249758 209. Wang D.-R. Wu X.-L. Sun Y.-L. Therapeutic targets and biomarkers of tumor immunotherapy: Response versus non-response Signal Transduct. Target. Ther. 2022 7 331 10.1038/s41392-022-01136-2 36123348 PMC9485144 210. Bai R. Lv Z. Xu D. Cui J. Predictive biomarkers for cancer immunotherapy with immune checkpoint inhibitors Biomark. Res. 2020 8 34 10.1186/s40364-020-00209-0 32864131 PMC7450548 211. Lommen K. Odeh S. de Theije C.C. Smits K.M. Biobanking in molecular biomarker research for the early detection of cancer Cancers 2020 12 776 10.3390/cancers12040776 32218259 PMC7226426 212. Elinav E. Garrett W.S. Trinchieri G. Wargo J. The cancer microbiome Nat. Rev. Cancer 2019 19 371 376 10.1038/s41568-019-0155-3 31186547 PMC6700740 213. Kit O.I. Timofeeva S.V. Sitkovskaya A.O. Novikova I.A. Kolesnikov E.N. The biobank of the National Medical Research Centre for Oncology as a resource for research in the field of personalized medicine: A review J. Mod. Oncol. 2022 24 6 11 10.26442/18151434.2022.1.201384 214. Liu C. Du M.-X. Abuduaini R. Yu H.-Y. Li D.-H. Wang Y.-J. Zhou N. Jiang M.-Z. Niu P.-X. Han S.-S. Enlightening the taxonomy darkness of human gut microbiomes with a cultured biobank Microbiome 2021 9 119 10.1186/s40168-021-01064-3 34020714 PMC8140505 215. Ma L. Guo H. Zhao Y. Liu Z. Wang C. Bu J. Sun T. Wei J. Liquid biopsy in cancer: Current status, challenges and future prospects Signal Transduct. Target. Ther. 2024 9 336 10.1038/s41392-024-02021-w 39617822 PMC11609310 216. Jee J. Brannon A.R. Singh R. Derkach A. Fong C. Lee A. Gray L. Pichotta K. Luthra A. Diosdado M. DNA liquid biopsy-based prediction of cancer-associated venous thromboembolism Nat. Med. 2024 30 2499 2507 10.1038/s41591-024-03195-0 39147831 PMC11405286 217. Mahuron K.M. Fong Y. Applications of liquid biopsy for surgical patients with cancer: A review JAMA Surg. 2024 159 96 103 10.1001/jamasurg.2023.5394 37910091 218. Poore G.D. Kopylova E. Zhu Q. Carpenter C. Fraraccio S. Wandro S. Kosciolek T. Janssen S. Metcalf J. Song S.J. Microbiome analyses of blood and tissues suggest cancer diagnostic approach Nature 2020 579 567 574 10.1038/s41586-020-2095-1 32214244 PMC7500457 219. Im Y. Tsui D. Diaz L. Wan J. Next-generation liquid biopsies: Embracing data science in oncology Trends Cancer 2021 7 283 292 10.1016/j.trecan.2020.11.001 33317961 PMC8408348 220. Piombino C. Mastrolia I. Omarini C. Candini O. Dominici M. Piacentini F. Toss A. The role of exosomes in breast cancer diagnosis Biomedicines 2021 9 312 10.3390/biomedicines9030312 33803776 PMC8003248 221. Welsh J.A. Goberdhan D.C.I. O’Driscoll L. Buzas E.I. Blenkiron C. Bussolati B. Cai H. Di Vizio D. Driedonks T.A.P. Erdbrügger U. Minimal information for studies of extracellular vesicles (MISEV2023): From basic to advanced approaches J. Extracell. Vesicles 2024 13 e12404 10.1002/jev2.12404 38326288 PMC10850029 222. Raposo G. Stahl P.D. Extracellular vesicles: A new communication paradigm? Nat. Rev. Mol. Cell Biol. 2019 20 509 510 10.1038/s41580-019-0158-7 31324871 223. Ellis G.I. Riley J.L. How to kill T(reg) cells for immunotherapy Nat. Cancer 2020 1 1134 1135 10.1038/s43018-020-00155-8 35121936 224. Zhang K.K. Reddy N. Janis J.E. Office-based Plastic Surgery-Evidence-based Clinical and Administrative Guidelines Plast. Reconstr. Surg. Glob. Open 2022 10 e4634 10.1097/GOX.0000000000004634 36381487 PMC9645793 225. Salehi M. Sharifi M. Exosomal miRNAs as novel cancer biomarkers: Challenges and opportunities J. Cell. Physiol. 2018 233 6370 6380 10.1002/jcp.26481 29323722 226. Li L. Zhang L. Montgomery K.C. Jiang L. Lyon C.J. Hu T.Y. Advanced technologies for molecular diagnosis of cancer: State of pre-clinical tumor-derived exosome liquid biopsies Mater. Today Bio 2023 18 100538 10.1016/j.mtbio.2022.100538 PMC9812720 36619206 227. Lee Y. Ni J. Beretov J. Wasinger V.C. Graham P. Li Y. Recent advances of small extracellular vesicle biomarkers in breast cancer diagnosis and prognosis Mol. Cancer 2023 22 33 10.1186/s12943-023-01741-x 36797736 PMC9933347 228. Tamura T. Yoshioka Y. Sakamoto S. Ichikawa T. Ochiya T. Extracellular vesicles as a promising biomarker resource in liquid biopsy for cancer Extracell. Vesicles Circ. Nucleic Acids 2021 2 148 174 10.20517/evcna.2021.06 PMC11656527 39703905 229. Ho H.-Y. Chung K.-S. Kan C.-M. Wong S.-C. Liquid biopsy in the clinical management of cancers Int. J. Mol. Sci. 2024 25 8594 10.3390/ijms25168594 39201281 PMC11354853 230. Febbo P.G. Allo M. Alme E.B. Cuyun Carter G. Dumanois R. Essig A. Kiernan E. Kubler C.B. Martin N. Popescu M.C. Recommendations for the equitable and widespread implementation of liquid biopsy for cancer care JCO Precis. Oncol. 2024 8 e2300382 10.1200/PO.23.00382 38166232 PMC10803048 231. Xiao L. Zhang F. Zhao F. Large-scale microbiome data integration enables robust biomarker identification Nat. Comput. Sci. 2022 2 307 316 10.1038/s43588-022-00247-8 38177817 PMC10766547 232. Heinken A. Basile A. Hertel J. Thinnes C. Thiele I. Genome-scale metabolic modeling of the human microbiome in the era of personalized medicine Annu. Rev. Microbiol. 2021 75 199 222 10.1146/annurev-micro-060221-012134 34314593 233. Wang W. He Y. Yang F. Chen K. Current and emerging applications of liquid biopsy in pan-cancer Transl. Oncol. 2023 34 101720 10.1016/j.tranon.2023.101720 37315508 PMC10302532 234. Tang Q. Jin G. Wang G. Liu T. Liu X. Wang B. Cao H. Current sampling methods for gut microbiota: A call for more precise devices Front. Cell. Infect. Microbiol. 2020 10 151 10.3389/fcimb.2020.00151 32328469 PMC7161087 235. Butterfield L.H. Najjar Y.G. Immunotherapy combination approaches: Mechanisms, biomarkers and clinical observations Nat. Rev. Immunol. 2024 24 399 416 10.1038/s41577-023-00973-8 38057451 PMC11460566 236. Yang M. Cui M. Sun Y. Liu S. Jiang W. Mechanisms, combination therapy, and biomarkers in cancer immunotherapy resistance Cell Commun. Signal. 2024 22 338 10.1186/s12964-024-01711-w 38898505 PMC11186190 237. Wisdom A.J. Barker C.A. Chang J.Y. Demaria S. Formenti S. Grassberger C. Gregucci F. Hoppe B.S. Kirsch D.G. Marciscano A.E. The next chapter in immunotherapy and radiation combination therapy–cancer-specific perspectives Int. J. Radiat. Oncol. Biol. Phys. 2024 118 1404 1421 10.1016/j.ijrobp.2023.12.046 38184173 238. Tang F. Ding A. Xu Y. Ye Y. Li L. Xie R. Huang W. Gene and photothermal combination therapy: Principle, materials, and amplified anticancer intervention Small 2024 20 2307078 10.1002/smll.202307078 37775950 239. Willsmore Z.N. Coumbe B.G. Crescioli S. Reci S. Gupta A. Harris R.J. Chenoweth A. Chauhan J. Bax H.J. McCraw A. Combined anti-PD-1 and anti-CTLA-4 checkpoint blockade: Treatment of melanoma and immune mechanisms of action Eur. J. Immunol. 2021 51 544 556 10.1002/eji.202048747 33450785 240. Váraljai R. Zimmer L. Al-Matary Y. Kaptein P. Albrecht L.J. Shannan B. Brase J.C. Gusenleitner D. Amaral T. Wyss N. Interleukin 17 signaling supports clinical benefit of dual CTLA-4 and PD-1 checkpoint inhibition in melanoma Nat. Cancer 2023 4 1292 1308 10.1038/s43018-023-00610-2 37525015 PMC10518254 241. Seidel J.A. Otsuka A. Kabashima K. Anti-PD-1 and anti-CTLA-4 therapies in cancer: Mechanisms of action, efficacy, and limitations Front. Oncol. 2018 8 86 10.3389/fonc.2018.00086 29644214 PMC5883082 242. Ciernikova S. Sevcikova A. Drgona L. Mego M. Modulating the gut microbiota by probiotics, prebiotics, postbiotics, and fecal microbiota transplantation: An emerging trend in cancer patient care Biochim. Biophys. Acta Rev. Cancer 2023 1878 188990 10.1016/j.bbcan.2023.188990 37742728 243. Kaźmierczak-Siedlecka K. Daca A. Fic M. van de Wetering T. Folwarski M. Makarewicz W. Therapeutic methods of gut microbiota modification in colorectal cancer management–fecal microbiota transplantation, prebiotics, probiotics, and synbiotics Gut Microbes 2020 11 1518 1530 10.1080/19490976.2020.1764309 32453670 PMC7524363 244. Daillère R. Vétizou M. Waldschmitt N. Yamazaki T. Isnard C. Poirier-Colame V. Duong C.P. Flament C. Lepage P. Roberti M.P. Enterococcus hirae and Barnesiella intestinihominis facilitate cyclophosphamide-induced therapeutic immunomodulatory effects Immunity 2016 45 931 943 10.1016/j.immuni.2016.09.009 27717798 245. Zhang X. Cai X. Zheng H. Anti-PD1 or anti-PD-L1 antibodies alone or in combination with chemotherapy first-line treatment of advanced non-small cell lung cancer Thorac. Cancer 2022 13 1104 1105 10.1111/1759-7714.14358 35199960 PMC8977173 246. Li L. Chen L. Yan L. Guo Y. Li F. Fan M. Lan M. Lai X. Zhou J. Huang Y. Initial analysis of the synergy of programmed cell death-1 (PD-1) inhibitor and concurrent chemoradiotherapy treatment for recurrent/metastatic head and neck squamous cell carcinoma patients Radiat. Oncol. 2023 18 109 10.1186/s13014-023-02310-8 37403098 PMC10318764 247. Wang D. Lin J. Yang X. Long J. Bai Y. Yang X. Mao Y. Sang X. Seery S. Zhao H. Combination regimens with PD-1/PD-L1 immune checkpoint inhibitors for gastrointestinal malignancies J. Hematol. Oncol. 2019 12 42 10.1186/s13045-019-0730-9 31014381 PMC6480748 248. Page D.B. Bear H. Prabhakaran S. Gatti-Mays M.E. Thomas A. Cobain E. McArthur H. Balko J.M. Gameiro S.R. Nanda R. Two may be better than one: PD-1/PD-L1 blockade combination approaches in metastatic breast cancer NPJ Breast Cancer 2019 5 34 10.1038/s41523-019-0130-x 31602395 PMC6783471 249. Shi M. Chen Y. Ji D. The implications from the interplay of neoadjuvant chemoradiotherapy and the immune microenvironment in rectal cancer Future Oncol. 2022 18 3229 3244 10.2217/fon-2022-0061 36017694 250. Takamori S. Toyokawa G. Takada K. Shoji F. Okamoto T. Maehara Y. Combination Therapy of Radiotherapy and Anti-PD-1/PD-L1 Treatment in Non-Small-cell Lung Cancer: A Mini-review Clin. Lung Cancer 2018 19 12 16 10.1016/j.cllc.2017.06.015 28739315 251. Wang Y. Deng W. Li N. Neri S. Sharma A. Jiang W. Lin S.H. Combining immunotherapy and radiotherapy for cancer treatment: Current challenges and future directions Front. Pharmacol. 2018 9 185 10.3389/fphar.2018.00185 29556198 PMC5844965 252. Yu S. Wang Y. He P. Shao B. Liu F. Xiang Z. Yang T. Zeng Y. He T. Ma J. Effective combinations of immunotherapy and radiotherapy for cancer treatment Front. Oncol. 2022 12 809304 10.3389/fonc.2022.809304 35198442 PMC8858950 253. Spaas M. Lievens Y. Is the combination of immunotherapy and radiotherapy in non-small cell lung cancer a feasible and effective approach? Front. Med. 2019 6 244 10.3389/fmed.2019.00244 PMC6853895 31788476 254. Sardaro A. Ferrari C. Carbonara R. Altini C. Lavelli V. Rubini G. Synergism between immunotherapy and radiotherapy in esophageal cancer: An overview of current knowledge and future perspectives Cancer Biother. Radiopharm. 2021 36 123 132 10.1089/cbr.2020.3643 32551915 255. Thorsson V. Gibbs D.L. Brown S.D. Wolf D. Bortone D.S. Ou Yang T.H. Porta-Pardo E. Gao G.F. Plaisier C.L. Eddy J.A. The Immune Landscape of Cancer Immunity 2018 48 812 830.e814 10.1016/j.immuni.2018.03.023 29628290 PMC5982584 256. Sharma P. Siddiqui B.A. Anandhan S. Yadav S.S. Subudhi S.K. Gao J. Goswami S. Allison J.P. The Next Decade of Immune Checkpoint Therapy Cancer Discov. 2021 11 838 857 10.1158/2159-8290.CD-20-1680 33811120 257. Mokhtari R.B. Sampath D. Eversole P. Yu Lin M.O. Bosykh D.A. Boopathy G.T.K. Sivakumar A. Wang C.C. Kumar R. Sheng J.Y.P. An Agrin-YAP/TAZ Rigidity Sensing Module Drives EGFR-Addicted Lung Tumorigenesis Adv. Sci. 2025 12 e2413443 10.1002/advs.202413443 PMC12120797 40165020 258. Mokhtari R.B. Ashayeri N. Baghaie L. Sambi M. Satari K. Baluch N. Bosykh D.A. Szewczuk M.R. Chakraborty S. The Hippo Pathway Effectors YAP/TAZ-TEAD Oncoproteins as Emerging Therapeutic Targets in the Tumor Microenvironment Cancers 2023 15 3468 10.3390/cancers15133468 37444578 PMC10340833 259. Chakraborty S. Sampath D. Yu Lin M.O. Bilton M. Huang C.K. Nai M.H. Njah K. Goy P.A. Wang C.C. Guccione E. Agrin-Matrix Metalloproteinase-12 axis confers a mechanically competent microenvironment in skin wound healing Nat. Commun. 2021 12 6349 10.1038/s41467-021-26717-7 34732729 PMC8566503 260. Chakraborty S. Njah K. Hong W. Agrin Mediates Angiogenesis in the Tumor Microenvironment Trends Cancer 2020 6 81 85 10.1016/j.trecan.2019.12.002 32061308 261. Chakraborty S. Hong W. Oncogenetic engagement with mechanosensing Nat. Mater. 2020 19 707 709 10.1038/s41563-020-0700-1 32581349 262. Njah K. Chakraborty S. Qiu B. Arumugam S. Raju A. Pobbati A.V. Lakshmanan M. Tergaonkar V. Thibault G. Wang X. A Role of Agrin in Maintaining the Stability of Vascular Endothelial Growth Factor Receptor-2 during Tumor Angiogenesis Cell Rep. 2019 28 949 965.E7 10.1016/j.celrep.2019.06.036 31340156 263. Chakraborty S. Hong W. Linking Extracellular Matrix Agrin to the Hippo Pathway in Liver Cancer and Beyond Cancers 2018 10 45 10.3390/cancers10020045 29415512 PMC5836077 264. Chakraborty S. Njah K. Pobbati A.V. Lim Y.B. Raju A. Lakshmanan M. Tergaonkar V. Lim C.T. Hong W. Agrin as a Mechanotransduction Signal Regulating YAP through the Hippo Pathway Cell Rep. 2017 18 2464 2479 10.1016/j.celrep.2017.02.041 28273460 265. Chakraborty S. Lakshmanan M. Swa H.L. Chen J. Zhang X. Ong Y.S. Loo L.S. Akincilar S.C. Gunaratne J. Tergaonkar V. An oncogenic role of Agrin in regulating focal adhesion integrity in hepatocellular carcinoma Nat. Commun. 2015 6 6184 10.1038/ncomms7184 25630468 PMC4317502 266. Yang Y. Chen X. Pan J. Ning H. Zhang Y. Bo Y. Ren X. Li J. Qin S. Wang D. Pan-cancer single-cell dissection reveals phenotypically distinct B cell subtypes Cell 2024 187 4790 4811.e22 10.1016/j.cell.2024.06.038 39047727 267. Savage S.R. Yi X. Lei J.T. Wen B. Zhao H. Liao Y. Jaehnig E.J. Somes L.K. Shafer P.W. Lee T.D. Pan-cancer proteogenomics expands the landscape of therapeutic targets Cell 2024 187 4389 4407.e15 10.1016/j.cell.2024.05.039 38917788 PMC12010439 268. Aaltonen L.A. Abascal F. Abeshouse A. Aburatani H. Adams D.J. Agrawal N. Ahn K.S. Ahn S.-M. Aikata H. Akbani R. Pan-cancer analysis of whole genomes Nature 2020 578 82 93 10.1038/s41586-020-1969-6 32025007 PMC7025898 269. Hegde P.S. Chen D.S. Top 10 Challenges in Cancer Immunotherapy Immunity 2020 52 17 35 10.1016/j.immuni.2019.12.011 31940268 270. Stadtmauer E.A. Fraietta J.A. Davis M.M. Cohen A.D. Weber K.L. Lancaster E. Mangan P.A. Kulikovskaya I. Gupta M. Chen F. CRISPR-engineered T cells in patients with refractory cancer Science 2020 367 eaba7365 10.1126/science.aba7365 32029687 PMC11249135 271. Wahida A. Buschhorn L. Frohling S. Jost P.J. Schneeweiss A. Lichter P. Kurzrock R. The coming decade in precision oncology: Six riddles Nat. Rev. Cancer 2023 23 43 54 10.1038/s41568-022-00529-3 36434139 272. Zhou Z. Edil B.H. Li M. Combination therapies for cancer: Challenges and opportunities BMC Med. 2023 21 171 10.1186/s12916-023-02852-4 37143031 PMC10161484 273. Schupack D.A. Mars R.A. Voelker D.H. Abeykoon J.P. Kashyap P.C. The promise of the gut microbiome as part of individualized treatment strategies Nat. Rev. Gastroenterol. Hepatol. 2022 19 7 25 10.1038/s41575-021-00499-1 34453142 PMC8712374 274. Zhang X. Cai X. Yan C. Opportunities and challenges in combining immunotherapy and radiotherapy in esophageal cancer J. Cancer Res. Clin. Oncol. 2023 149 18253 18270 10.1007/s00432-023-05499-z 37985502 PMC10725359 275. Whiteside T.L. Demaria S. Rodriguez-Ruiz M.E. Zarour H.M. Melero I. Emerging opportunities and challenges in cancer immunotherapy Clin. Cancer Res. 2016 22 1845 1855 10.1158/1078-0432.CCR-16-0049 27084738 PMC4943317 276. Paver E.C. Morey A.L. Biomarkers and biomarker validation: A pathologist’s guide to getting it right Pathology 2024 56 147 157 10.1016/j.pathol.2023.11.002 38195376 277. Robles J. Prakash A. Vizcaíno J.A. Casal J.I. Integrated meta-analysis of colorectal cancer public proteomic datasets for biomarker discovery and validation PLoS Comput. Biol. 2024 20 e1011828 10.1371/journal.pcbi.1011828 38252632 PMC10833860 278. Huang Z. Deng C. Ma C. He G. Tao J. Zhang L. Hu X. Mo Y. Qiu L. Zhang N. Identification and validation of the surface proteins FIBG, PDGF-β, and TGF-β on serum extracellular vesicles for non-invasive detection of colorectal cancer: Experimental study Int. J. Surg. 2024 110 4672 4687 10.1097/JS9.0000000000001533 38704642 PMC11326011 279. Novielli P. Romano D. Magarelli M. Bitonto P.D. Diacono D. Chiatante A. Lopalco G. Sabella D. Venerito V. Filannino P. Explainable artificial intelligence for microbiome data analysis in colorectal cancer biomarker identification Front. Microbiol. 2024 15 1348974 10.3389/fmicb.2024.1348974 38426064 PMC10901987 280. Tabib N.S.S. Madgwick M. Sudhakar P. Verstockt B. Korcsmaros T. Vermeire S. Big data in IBD: Big progress for clinical practice Gut 2020 69 1520 1532 10.1136/gutjnl-2019-320065 32111636 PMC7398484 281. Cammarota G. Ianiro G. Ahern A. Carbone C. Temko A. Claesson M.J. Gasbarrini A. Tortora G. Gut microbiome, big data and machine learning to promote precision medicine for cancer Nat. Rev. Gastroenterol. Hepatol. 2020 17 635 648 10.1038/s41575-020-0327-3 32647386 282. Chen L. Wang D. Garmaeva S. Kurilshikov A. Vila A.V. Gacesa R. Sinha T. Segal E. Weersma R.K. Wijmenga C. The long-term genetic stability and individual specificity of the human gut microbiome Cell 2021 184 2302 2315.e12 10.1016/j.cell.2021.03.024 33838112 283. Vandeputte D. De Commer L. Tito R.Y. Kathagen G. Sabino J. Vermeire S. Faust K. Raes J. Temporal variability in quantitative human gut microbiome profiles and implications for clinical research Nat. Commun. 2021 12 6740 10.1038/s41467-021-27098-7 34795283 PMC8602282 284. McKean W.B. Moser J.C. Rimm D. Hu-Lieskovan S. Biomarkers in Precision Cancer Immunotherapy: Promise and Challenges Am. Soc. Clin. Oncol. Book 2020 40 e275 e291 10.1200/EDBK_280571 32453632 285. Bernicker E. Next-generation sequencing and immunotherapy biomarkers: A medical oncology perspective Arch. Pathol. Lab. Med. 2016 140 245 248 10.5858/arpa.2015-0287-SA 26927719 286. Zhang W. Shi J. Wang Y. Zhou H. Zhang Z. Han Z. Li G. Yang B. Cao G. Ke Y. Next-generation sequencing-guided molecular-targeted therapy and immunotherapy for biliary tract cancers Cancer Immunol. Immunother. 2021 70 1001 1014 10.1007/s00262-020-02745-y 33095329 PMC10992508 287. Zhang J. Späth S.S. Marjani S.L. Zhang W. Pan X. Characterization of cancer genomic heterogeneity by next-generation sequencing advances precision medicine in cancer treatment Precis. Clin. Med. 2018 1 29 48 10.1093/pcmedi/pby007 30687561 PMC6333046 288. Waldman A.D. Fritz J.M. Lenardo M.J. A guide to cancer immunotherapy: From T cell basic science to clinical practice Nat. Rev. Immunol. 2020 20 651 668 10.1038/s41577-020-0306-5 32433532 PMC7238960 289. Said S.S. Ibrahim W.N. Cancer resistance to immunotherapy: Comprehensive insights with future perspectives Pharmaceutics 2023 15 1143 10.3390/pharmaceutics15041143 37111629 PMC10141036 290. Attili I. Tarantino P. Passaro A. Stati V. Curigliano G. de Marinis F. Strategies to overcome resistance to immune checkpoint blockade in lung cancer Lung Cancer 2021 154 151 160 10.1016/j.lungcan.2021.02.035 33684660 291. Hirsch F.R. McElhinny A. Stanforth D. Ranger-Moore J. Jansson M. Kulangara K. Richardson W. Towne P. Hanks D. Vennapusa B. PD-L1 immunohistochemistry assays for lung cancer: Results from phase 1 of the blueprint PD-L1 IHC assay comparison project J. Thorac. Oncol. 2017 12 208 222 10.1016/j.jtho.2016.11.2228 27913228 292. McLaughlin J. Han G. Schalper K.A. Carvajal-Hausdorf D. Pelekanou V. Rehman J. Velcheti V. Herbst R. LoRusso P. Rimm D.L. Quantitative assessment of the heterogeneity of PD-L1 expression in non–small-cell lung cancer JAMA Oncol. 2016 2 46 54 10.1001/jamaoncol.2015.3638 26562159 PMC4941982 293. Yang Q. Chen M. Gu J. Niu K. Zhao X. Zheng L. Xu Z. Yu Y. Li F. Meng L. Novel biomarkers of dynamic blood PD-L1 expression for immune checkpoint inhibitors in advanced non-small-cell lung cancer patients Front. Immunol. 2021 12 665133 10.3389/fimmu.2021.665133 33936103 PMC8085403 294. Hinterleitner C. Strähle J. Malenke E. Hinterleitner M. Henning M. Seehawer M. Bilich T. Heitmann J. Lutz M. Mattern S. Platelet PD-L1 reflects collective intratumoral PD-L1 expression and predicts immunotherapy response in non-small cell lung cancer Nat. Commun. 2021 12 7005 10.1038/s41467-021-27303-7 34853305 PMC8636618 295. Kao C.J. Charmsaz S. Alden S.L. Brancati M. Li H.L. Balaji A. Munjal K. Howe K. Mitchell S. Leatherman J. Immune-related events in individuals with solid tumors on immunotherapy associate with Th17 and Th2 signatures J. Clin. Investig. 2024 134 e176567 10.1172/JCI176567 39403935 PMC11473156 Figure 1 Overview of the five major types of immunotherapies in cancer treatment. This schematic illustrates the principal immunotherapeutic strategies currently applied in oncology. (1) Immune checkpoint inhibitors (ICIs): monoclonal antibodies that block inhibitory receptors to restore T-cell activity against tumor cells. (2) Cancer vaccines: agents designed to elicit or enhance tumor-specific immune responses by presenting tumor-associated antigens. (3) Immunomodulators: cytokines, adjuvants, or agents that broadly stimulate or regulate immune responses within the tumor microenvironment. (4) Monoclonal antibodies (mAbs): laboratory-engineered antibodies that can directly target tumor antigens, induce antibody-dependent cellular cytotoxicity, or deliver cytotoxic payloads. (5) Cell-based therapies: adoptive cell transfer strategies, including natural killer (NK) cell therapy and chimeric antigen receptor T-cell (CAR-T) therapy, which harness and engineer immune cells for enhanced tumor recognition and eradication. Figure 2 Categories of biomarkers in cancer immunotherapy and representative examples. The main categories of biomarkers related to cancer immunotherapy are compiled in this table, along with their definitions and specific examples. While screening or susceptibility biomarkers, such as MSI-H/dMMR, are used to evaluate the risk of acquiring cancer, diagnostic biomarkers, like PD-L1 expression, are utilized to detect the presence of illness. Therapeutic selection is aided by predictive biomarkers, such as tumor mutational load, which suggest potential therapeutic responses. Preventive biomarkers, such as tumor-specific neoantigens, detect risk factors to guide preventative measures, such as cancer vaccinations, whereas pharmacodynamic biomarkers, such as alterations in circulating T-cell populations, track biological responses to therapy. Together, these indicators allow for a customized approach to cancer immunotherapy. Figure 3 Integrated approach to predictive biomarkers and cancer outcomes. This figure highlights the role of predictive biomarkers, particularly short-chain fatty acids (SCFAs), such as butyrate, in advancing cancer prevention and treatment. SCFAs modulate cancer-related pathways, including gene expression, metabolism, and cellular processes such as autophagy and apoptosis, while also enhancing the efficacy of anti-cancer drugs and reducing treatment resistance. Figure 4 Stages of Biomarker Development: From Discovery to Clinical Application. The process begins with Discovery, where high-confidence biomarker candidates are identified using advanced detection technologies, followed by Verification, which screens and prioritizes potential biomarkers for further investigation. In the Validation phase, biomarkers are rigorously tested using diverse and representative patient cohorts to ensure reliability and predictive power. Finally, biomarkers transition to Clinical Application, where they guide patient selection, inform treatment strategies, and improve clinical outcomes. Each stage highlights specific technologies, such as ELISA, SERS, and electrochemical biosensors, alongside key challenges, including specificity, sensitivity, and reproducibility, emphasizing the iterative and multidisciplinary nature of biomarker development. Figure 5 Gut Microbiota Influence on Immunotherapy. The diagram illustrates the dynamic relationship between the gut microbiome and the immune system in the context of cancer immunotherapy. Key microbial taxa, including Akkermansia muciniphila Bacteroides fragilis Figure 6 Schematic Overview of Pan-Immunotherapy Strategies Targeting Common Molecular Features of Cancer Cells to Address Tumor Heterogeneity and Overcome Resistance Mechanisms. The tumor microenvironment (TME) comprises several key components, including cancer cells, immune cells, stromal cells, and the extracellular matrix. Common molecular targets across various cancer types are depicted, such as overexpressed receptors (e.g., PD-L1, CTLA-4), altered metabolic pathways, and cancer-specific antigens. The comparison of normal versus cancer cell membrane composition illustrates differences in receptor density, lipid composition, and membrane fluidity. This schematic emphasizes the potential of pan-immunotherapy agents to target multiple molecular features, enhancing the efficacy of immunotherapy across diverse cancer types by exploiting shared vulnerabilities while minimizing toxicity to normal cells. These approaches aim to enhance therapeutic outcomes and expand the applicability of immunotherapy. Figure 7 Roadmap for Biomarker Research and Application in Cancer Immunotherapy. The diagram illustrates a phased approach to advancing biomarker discovery, standardization, integration, and understanding in cancer immunotherapy. Phase 1: Exploration and Development focuses on expanding biomarker categories (e.g., neoantigen profiles, circulating tumor DNA) and leveraging emerging technologies (e.g., CRISPR, high-throughput sequencing). Phase 2: Standardization and Validation emphasizes the uniformity of assays and methodologies across research centers, as well as the establishment of centralized data repositories. Phase 3: Integration into Trials highlights the incorporation of biomarker evaluation into clinical trial design, including biospecimen collection and patient stratification. Phase 4: Advanced Understanding delves into the mechanisms through which biomarkers influence immunotherapy responses and the identification of novel resistance regulators. Each phase builds upon the previous one to facilitate precision medicine approaches in cancer immunotherapy. biomolecules-15-01304-t001_Table 1 Table 1 Classification of possible irAEs and their associated organs. Organ System Possible irAEs Dermatologic Rash, pruritus, vitiligo, dermatitis Endocrine Hypothyroidism, hyperthyroidism, adrenal insufficiency, diabetes Pulmonary Pneumonitis, dyspnea, cough Cardiovascular Myocarditis, pericarditis, arrhythmias Hepatic Hepatitis, elevated liver enzymes Musculoskeletal Arthritis, myositis, joint pain Renal Nephritis, acute kidney injury Neurological Peripheral neuropathy, encephalitis, myasthenia gravis Hematologic Anemia, thrombocytopenia, neutropenia biomolecules-15-01304-t002_Table 2 Table 2 Classification of diagnostic biomarkers for select cancer types. Cancer Type Diagnostic Biomarker Description/Role Non-Small-Cell Lung Cancer Gut microbiota profiles (e.g., Bacillus, Bifidobacterium, Faecalibacterium) Specific gut microbiota compositions can distinguish between NSCLC patients and healthy controls. Diagnostic models using bacterial abundance data have shown high accuracy. Ovarian, Breast Cancer CD39 expression High CD39 expression on tumor-infiltrating lymphocytes (TILs) correlates with an immunosuppressive tumor environment and serves as a diagnostic marker. Esophageal Squamous Cell Carcinoma CD39-expressing T cells (combined with a clinical nomogram) High levels of CD39+ T cells serve as a diagnostic and prognostic biomarker. A panel combining these cells with clinical indicators improves survival and prognosis predictions. biomolecules-15-01304-t003_Table 3 Table 3 Pharmacodynamic Biomarkers and Their Applications in Cancer Therapy. Pharmacodynamic Cancer Type Application 18F-fluoroestradiol Metastatic or recurrent breast cancer (ER-positive tumors)  Detects treatment response to hormonal therapy. Enables real-time monitoring of estrogen receptor activity, guiding therapy adjustments in breast cancer. Phosphorylated AKT Solid tumors and lymphoma  Measures PI3K signaling inhibition in response to PI3K inhibitor drugs. Reflects the pharmacodynamic effect of targeted therapies, helping in dose optimization for PI3K inhibitors. IFN-γ and CXCL9 Head and neck squamous cell carcinoma, non-small cell lung cancer  Indicates early immune activation, correlates with increased progression-free survival in Budigalimab therapy. Serve as positive predictive markers in immunotherapy, particularly in PD-1 inhibitors. IL-8 Head and neck squamous cell carcinoma, non-small cell lung cancer  Negative biomarker for progression-free survival; elevated levels within 24 h correlate with poorer outcomes in Budigalimab therapy. A cautionary biomarker indicating potential treatment resistance or suboptimal response. ",
  "metadata": {
    "Title of this paper": "Immune-related events in individuals with solid tumors on immunotherapy associate with Th17 and Th2 signatures",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466961/"
  }
}