{
  "title": "Paper_843",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472539 PMC12472539.1 12472539 12472539 41011481 10.3390/microorganisms13092150 microorganisms-13-02150 1 Article Phytochemicals from Euclea natalensis https://orcid.org/0000-0002-7325-6635 Oduro-Kwateng Ernest 1 Abo-Dya Nader E. Resources Writing – review & editing 2 Soliman Mahmoud E. Validation Resources Supervision 3 * https://orcid.org/0000-0002-0808-9201 Mkhwanazi Nompumelelo P. Conceptualization Validation Resources Writing – review & editing Supervision 1 * Hassan Sherif T.S. Academic Editor 1 223149553@stu.ukzn.ac.za 2 nabodya@ut.edu.sa 3 * soliman@ukzn.ac.za mkhwanazi@ukzn.ac.za 15 9 2025 9 2025 13 9 496716 2150 20 8 2025 08 9 2025 12 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ HIV/AIDS remains a major global health challenge, with immune dysfunction, chronic inflammation, and comorbidities sustained by latent viral reservoirs that evade antiretroviral therapy. Euclea natalensis E. natalensis NFκβ1 STAT3 MTOR HSP90AA1 HSP90AB1 E. natalensis Euclea natalensis HIV/AIDS network pharmacology molecular modeling Th17 differentiation KEGG enrichment MM/GBSA This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Human immunodeficiency virus (HIV) remains a significant global health challenge, with an estimated 39.9 million people living with HIV (PLWH) infection as of 2023, with 630,000 mortalities [ 1 2 3 4 5 6 One of the critical unmet needs in HIV research is the development of novel therapeutic strategies that not only suppress viral replication but also restore immune function and eliminate latent reservoirs. Several therapeutic approaches are being explored, including latency-reversing agents (LRAs) (“shock-and-kill”), “block-and-lock” technique, broadly neutralizing antibodies, therapeutic vaccines, and immune checkpoint modulation [ 7 8 9 10 11 Natural products, particularly phytochemicals derived from medicinal plants, are gaining renewed interest in HIV cure research because of their structural diversity and multitarget activities. They offer a promising alternative or complementary strategy to existing therapies [ 5 Euclea natalensis 12 13 14 15 16 E. natalensis 17 E. natalensis 18 19 Network pharmacology, a modern systems biology framework, enables the mapping of complex interactions between phytochemicals and disease networks, moving beyond the traditional “one drug-one target” model. This approach is especially relevant in HIV cure research, where multifactorial host–pathogen interactions complicate therapeutic design. Although similar studies have applied network pharmacology to cancer [ 20 21 22 23 E. natalensis E. natalensis Our enrichment analysis showed that hub genes targeted by E. natalensis E. natalensis 2. Materials and Methods 2.1. Collection of Bioactive Phytochemicals from Euclea natalensis The phytochemicals present in the root bark of E. natalensis https://pubmed.ncbi.nlm.nih.gov/ https://scholar.google.com/ E. natalensis 14 15 16 12 13 https://pubchem.ncbi.nlm.nih.gov/ 24 25 Figure 1 2.2. In Silico ADME Phytochemical Profiling The pharmacokinetic profiles and drug-likeness of the phytochemicals were evaluated using SwissADME ( http://www.swissadme.ch/ 2 26 2.3. Prediction of Phytochemical Associated Human Targets The canonical SMILES and SDF files of the identified compounds were queried across three databases: TargetNet ( http://targetnet.scbdd.com/ 27 https://prediction.charite.de/ 28 http://www.lilab-ecust.cn/pharmmapper/ 29 Homo sapiens https://www.uniprot.org/ 30 2.4. Collection of HIV/AIDS-Associated Protein Targets HIV/AIDS-related protein targets were identified by querying the comprehensive database of human genes, GeneCards ( https://www.genecards.org/ HIV human immunodeficiency virus HIV Infection acquired immunodeficiency syndrome AIDS HIV/AIDS 2.5. Identification of HIV/AIDS-Related Host Targets A comparative analysis was performed between the predicted targets of Euclea natalensis https://bioinfogp.cnb.csic.es/tools/venny/ 2.6. Bioactive–Target (BA-TAR) Network Construction A BA-TAR interaction network was constructed to visualize and explore the multi-component relationships between Euclea natalensis https://cytoscape.org 31 2.7. PPI Network Construction and Hub Gene Identification To explore the potential interactions among HIV/AIDS-related host targets modulated by Euclea natalensis https://string-db.org/ Homo sapiens 32 33 2.8. GO and KEGG Pathway Enrichment Analysis To elucidate the biological functions and signaling pathways associated with Euclea natalensis https://bioinformatics.sdstate.edu/go/ 34 Homo sapiens p p 2.9. BAR-TAR-PATH Network Construction To further illustrate the potential therapeutic mechanisms of Euclea natalensis https://cytoscape.org/ 31 2.10. Molecular Docking Calculations Molecular docking was performed to assess the binding affinity and interaction of selected Euclea natalensis https://www.rcsb.org/ Homo sapiens The 3D structures of the selected E. natalensis Table S8 http://sts.bioe.uic.edu/castp/ https://proteins.plus/ 35 Table S9 Molecular docking simulations were performed using AutoDock Vina v1.1.2, incorporating a Genetic Algorithm (GA) for efficient conformational sampling and binding pose optimization. As a control step, the co-crystallized ligands were redocked to validate the docking protocol by evaluating the root mean square deviation (RMSD) between the experimental and predicted binding poses ( Figure S1 E. natalensis NFκβ1 HIF1A 2.11. MD Simulations To evaluate the conformational stability and dynamic behavior of the top five high-scoring protein–ligand complexes, MD simulations were performed [ 36 37 38 + − 39 2 2 40 2.12. BFE Computations To quantitatively evaluate the binding affinities of Euclea natalensis 41 42 The MM/GBSA method computes the BFE (∆ G bind (1) ∆ G b i n d = G c o m p l e x − G r e c e p t o r − G l i g a n d This is expanded as (2) ∆ G b i n d = E g a s + G s o l − T ∆ S E g a s = E i n t + E v d w + E e l e G s o l = G G B + G S A G S A = γ S A S A 2 The entropic contribution, T∆S, was computed using normal mode analysis. 3. Results 3.1. In Silico ADME Evaluation of Phytochemical Ligands ADME profiling of the screened phytochemicals revealed considerable diversity in their drug-likeness and pharmacokinetic properties ( Table S1 Table 1 3.2. Identification of Potential Targets of Euclea natalensis Phytochemicals in HIV Pathogenesis The phytochemicals of E. natalensis Figure 2 Figure 2 E. natalensis Figure 3 HIV human immunodeficiency virus AIDS HIV/AIDS Figure 3 A comparative intersection analysis using Venny 2.1 revealed 313 overlapping genes between the 360 phytochemical targets and the 12,648 HIV-related genes ( Figure 3 E. natalensis Table S2 3.3. BA-TAR Network Construction and Phytochemical Topological Analysis To investigate the multi-target interactions between Euclea natalensis Figure 4 Table 2 3.4. PPI Network and Hub Gene Analysis To elucidate the molecular mechanisms underlying the therapeutic action of Euclea natalensis Homo sapiens p −16 Figure S2 Figure 5 CASP3 STAT3 ESR1 HIF1A HSP90AA1 ALB MTOR NFκβ1 ANXA5 HSP90AB1 Figure 5 19 19 Figure 5 3.5. GO and KEGG Pathway Enrichment Analyses of Euclea natalensis-HIV/AIDS Hub Targets 3.5.1. GO BP GO BP enrichment identified 1000 significant terms, with the top 20 primarily linked to cell death regulation, response to metabolic stress, and immune activation ( Figure 6 HIF1A MTOR STAT3 Table S3 3.5.2. GO CC Among the 109 enriched CC terms, the most significantly enriched were associated with protein-folding chaperone complexes, secretory pathways, and nuclear compartments ( Figure 6 HSP90AB1 HSP90AA1 HSP90AB1 NFκβ1 ALB HSP90 ESR1 HIF1A Table S4 3.5.3. GO MF Of the 173 enriched MF terms, the top entries indicated involvement in nucleotide binding, transcriptional regulation, and kinase activity ( Figure 6 HSP90AA1 HSP90AB1 STAT3 HIF1A NFκβ1 ESR1 HSP90AA1 HSP90AB1 MTOR STAT3 ESR1 Table S5 3.5.4. KEGG Pathway Enrichment Analysis A total of 123 KEGG pathways were significantly enriched. Many of the enriched pathways were immunological or oncogenic, reflecting host–pathogen interplay during HIV infection and its associated immune dysregulation ( Figure 6 MTOR HIF1A HSP90AA1 HSP90AB1 NFκβ1 STAT3 Figure 7 MTOR STAT3 CASP3 HIF1A NFκβ1 MTOR NFκβ1 STAT3 CASP3 Table S6 PAK4 CHEK1 CHUK MAPK14 PTK2B MTOR TBK1 NFκβ1 MAPK1 MAPK8 MAPK10 RAC1 RELA APOBEC3G CALM1 CALM3 CASP3 CASP9 CDK1 CDC25C Figure S3 3.6. BA-TAR-PATH Network Construction To investigate the integrative relationships among key phytochemicals from Euclea natalensis Figure 8 NFκβ1 STAT3 ESR1 HSP90AA1 MTOR CASP3 HIF1A HSP90AB1 3.7. Inter-Pathway KEGG Network Connectivity To explore the crosstalk between the enriched biological pathways, a KEGG pathway–pathway interaction network was generated based on the shared genes among the top 20 enriched KEGG terms ( Figure 9 STAT3 MTOR HIF1A NFκβ1 3.8. Molecular Docking Analysis 3.8.1. Binding Affinity Calculations To validate the interaction potential of prioritized ligand–target pairs, molecular docking simulations were performed between the top-ranking phytochemicals and HIV-associated hub proteins identified through the BA–TAR–PATH network and PPI analyses. Eight ligands with the highest DC (natalenone, mamegakinone, octahydroeuclein, neodiospyrin, β-sitosterol, diospyrin, isodiospyrin, and galpinone) were docked against eight functionally significant and topologically central protein targets: NFκβ1 STAT3 ESR1 HSP90AA1 MTOR CASP3 HIF1A HSP90AB1 NFκβ1 HIF1A Table 3 NFκβ1 HIF1A HSP90AA1 HSP90AB1 STAT3 HSP90AA1 MTOR HSP90AB1 HSP90AA1 HSP90AB1 ESR1 MTOR CASP3 NFκβ1 MTOR STAT3 HSP90AA1 HSP90AAB1 3.8.2. Protein–Ligand Interaction Analysis Detailed binding interaction profiling was conducted for the top five prioritized complexes: HSP90AA1 HSP90AB1 MTOR STAT3 NFκβ1 Figure 10 HSP90AA1 Figure 10 HSP90AB1 Figure 10 NFκβ1 Figure 10 MTOR Figure 10 STAT3 Figure 10 E. natalensis 3.9. Thermodynamic Analyses of Top-Ranking Complexes 3.9.1. Conformational Profiling of Hub Targets The conformational changes of the hub targets ( HSP90AA1 HSP90AB1 NFκB1 MTOR STAT3 Table S10 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 HSP90AA1 2 2 2 Figure 11 The mean RMSD value of HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 HSP90AB1 2 2 2 HSP90AB1 Figure 11 The mean RMSD of NFκβ1 NFκβ1 NFκβ1 NFκB1 NFκβ1 NFκβ1 NFκβ1 NFκβ1 NFκβ1 NFκβ1 NFκβ1 NFκβ1 NFκβ1 2 2 2 Figure 11 The mean RMSD of MTOR MTOR MTOR MTOR MTOR MTOR MTOR MTOR MTOR MTOR MTOR MTOR MTOR MTOR 2 2 2 Figure 11 The mean RMSD of STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 STAT3 2 2 2 Figure 11 3.9.2. BFE Profiling BFE calculations of the top-ranked phytochemicals (diospyrin and galpinone) with hub targets ( HSP90AA1 HSP90AB1 NFκβ1 MTOR STAT3 Table 4 HSP90AA1 G bind HSP90AB1 G bind HSP90AB1 NFκβ1 G bind MTOR G bind STAT3 G bind 4. Discussion HIV pathogenesis is a complex and multifaceted process, involving the interplay between the virus and host immune responses. This study employed an integrative network pharmacology and molecular modeling pipeline to uncover the multi-target, pathway-level therapeutic relevance of Euclea natalensis 26 6 43 E. natalensis CASP3 STAT3 ESR1 HIF1A HSP90AA1 ALB MTOR NFκβ1 ANXA5 HSP90AB1 E. natalensis 33 E. natalensis GO enrichment analysis provided insights into the possible mechanistic roles of Euclea natalensis 44 E. natalensis 45 Among the KEGG pathways enriched in this study, Th17 cell differentiation (hsa04659) emerged as the most significantly enriched and highly connected, intersecting with multiple hub proteins targeted by Euclea natalensis + 46 47 48 49 E. natalensis Our findings reveal that Euclea natalensis MTOR STAT3 HIF1A NFκβ1 HSP90AA1 HSP90AB1 STAT3 50 MTOR + 51 HIF1A STAT3 MTOR 51 52 NFκβ1 NFκβ 53 HSP90AA1 HSP90AB1 STAT3 HIF1A AKT 54 55 Euclea natalensis 19 Mycobacterium tuberculosis E. natalensis STAT3 NFκβ1 HSP90 MTOR Vitis vinifera Curcuma longa NFκβ STAT3 56 Withania somnifera HSP90 NFκβ 57 Furthermore, the enrichment of several KEGG pathway clusters underscores the multifaceted role of Euclea natalensis 58 E. natalensis 59 E. natalensis 60 52 61 62 E. natalensis Euclea natalensis 18 E. natalensis E. natalensis Subsequently, a BA–TAR–PATH network was constructed, integrating PPI network and KEGG-based pathway enrichment. Topological analysis revealed that key gene targets such as NFκβ1 STAT3 ESR1 HSP90AA1 MTOR CASP3 HIF1A HSP90AB1 43 NFκβ1 MTOR STAT3 HSP90AA1 HSP90AB1 Finally, the protein–ligand interaction profiles of diospyrin and galpinone reveal strong molecular interactions, including hydrogen bonding, hydrophobic interactions, and van der Waals contacts within functional regions of HSP90 MTOR STAT3 NFκβ1 HSP90 HSP90AB1 NFκB1 MTOR STAT3 HSP90 63 NFκβ1 64 MTOR STAT3 65 Experimental studies support the antiviral potential of related natural compounds. Notably, diospyrin, neodiospyrin, and isodiospyrin isolated from Euclea natalensis 17 E. natalensis 66 67 E. natalensis Ventilago harmandiana 50 68 50 69 50 70 NFκβ NFκβ 71 72 MTOR 73 STAT3 74 HSP90 HSP90AA1 HSP90AB1 NFκβ AKT 75 Limitation of Study Despite the strengths of this integrative systems pharmacology approach, our study is limited by its reliance on predicted target datasets and in silico simulations, which may not fully capture the complexity of host–pathogen interactions in HIV infection. The assumption of competitive inhibition for E. natalensis E. natalensis 5. Conclusions This study provides the first integrative systems pharmacology and molecular modeling evaluation of Euclea natalensis NFκβ1 STAT3 MTOR HSP90 E. natalensis Although these computational insights are encouraging, experimental validation is essential. Future studies should employ biochemical assays, real-time quantitative PCR (RT-qPCR), cytokine profiling of CD4 + E. natalensis Acknowledgments The authors would like to thank God Almighty and members of HIV Pathogenesis Programme and Molecular Bio-computation and Drug Design Research Group, University of KwaZulu-Natal, South Africa. We would also like to thank the Center for High-Performance Computing (CHPC), South Africa ( https://www.chpc.ac.za/ Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/microorganisms13092150/s1 Euclea natalensis Euclea natalensis Euclea natalensis Euclea natalensis Euclea natalensis Euclea natalensis Euclea natalensis Euclea natalensis Euclea natalensis E. natalensis Author Contributions Conceptualization, N.P.M. and E.O.-K.; Methodology, E.O.-K.; Software, E.O.-K.; Validation, N.P.M. and M.E.S.; Formal Analysis, E.O.-K.; Investigation, E.O.-K.; Resources, N.P.M., N.E.A.-D., and M.E.S.; Data Curation, E.O.-K.; Writing—Original Draft Preparation, E.O.-K.; Writing—Review and Editing, N.P.M. and N.E.A.-D.; Supervision, N.P.M. and M.E.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations ADME Absorption, distribution, metabolism, and excretion AIDS Acquired immunodeficiency syndrome ART Antiretroviral therapy BA-TAR Bioactive-target BA-TAR-PATH Bioactive-target-pathway BFE Binding free energy BP Biological process CC Cellular component GO Gene ontology GALT Gut-associated lymphoid tissue HIF-1 Hypoxia-inducible factor 1 HIV Human immunodeficiency virus KEGG Kyoto encyclopedia of genes and genomes IL Interleukin MCC Maximal clique centrality MD Molecular dynamics MM/GBSA Molecular mechanics/generalized Born surface area MF Molecular function PPI Protein–protein interaction PD-1 Programmed cell death protein 1 PD-L1 Programmed death ligand 1 RMSD Root mean square deviation RMSF Root mean square fluctuation RoG Radius of gyration SASA Solvent accessible surface area Th17 T helper 17 (CD4+ T-cell subtype) References 1. Chen Y. Li A.D. Yang Y. Lu J. Xu Y. Ji X. Wu L. Han L. Zhu B. Xu M. Global, Regional and National Burden of HIV/AIDS among Individuals Aged 15–79 from 1990 to 2021 AIDS Res. Ther. 2025 22 51 10.1186/s12981-025-00745-5 40329367 PMC12057008 2. Pasternak A.O. Berkhout B. HIV Persistence: Silence or Resistance? Curr. Opin. Virol. 2023 59 101301 10.1016/j.coviro.2023.101301 36805974 3. Vaillant A.A.J. Naik R. HIV-1–Associated Opportunistic Infections StatPearls Petersburg, FA, USA 2023 4. Chawla A. Wang C. Patton C. Murray M. Punekar Y. de Ruiter A. Steinhart C. A Review of Long-Term Toxicity of Antiretroviral Treatment Regimens and Implications for an Aging Population Infect. Dis. Ther. 2018 7 183 195 10.1007/s40121-018-0201-6 29761330 PMC5986685 5. Mandal A. Biswas D. Hazra B. Natural Products from Plants with Prospective Anti-HIV Activity and Relevant Mechanisms of Action Stud. Nat. Prod. Chem. 2020 66 225 271 6. Wang J. Guo N. Hou W. Antiviral Drug Carriers for Human Immunodeficiency Virus Nano Trends 2023 4 100027 10.1016/j.nwnano.2023.100027 7. Pellaers E. Denis A. Debyser Z. New Latency-Promoting Agents for a Block-and-Lock Functional Cure Strategy Curr. Opin. HIV AIDS 2024 19 95 101 10.1097/COH.0000000000000844 38457209 PMC10990034 8. Kim Y. Anderson J.L. Lewin S.R. Getting the “Kill” into “Shock and Kill”: Strategies to Eliminate Latent HIV Cell Host Microbe 2018 23 14 26 10.1016/j.chom.2017.12.004 29324227 PMC5990418 9. Maina E.K. Adan A.A. Mureithi H. Muriuki J. Lwembe R.M. A Review of Current Strategies Towards the Elimination of Latent HIV-1 and Subsequent HIV-1 Cure Curr. HIV Res. 2020 19 14 26 10.2174/1570162x18999200819172009 PMC8573729 32819259 10. Sadowski I. Hashemi F.B. Strategies to Eradicate HIV from Infected Patients: Elimination of Latent Provirus Reservoirs Cell. Mol. Life Sci. 2019 76 3583 3600 10.1007/s00018-019-03156-8 31129856 PMC6697715 11. Ward A.R. Mota T.M. Jones R.B. Immunological Approaches to HIV Cure Semin. Immunol. 2021 51 101412 10.1016/j.smim.2020.101412 32981836 12. Maroyi A. Review of Ethnomedicinal Uses, Phytochemistry and Pharmacological Properties of E. natalensis Molecules 2017 22 2128 10.3390/molecules22122128 29207467 PMC6149716 13. Taye A.D. Bizuneh G.K. Kasahun A.E. Ethnobotanical Uses, Phytochemistry and Biological Activity of the Genus Euclea: A Review Front. Pharmacol. 2023 14 1170145 10.3389/fphar.2023.1170145 37153774 PMC10154578 14. Lall N. Weiganand O. Hussein A.A. Meyer J.J.M. Antifungal Activity of Naphthoquinones and Triterpenes Isolated from the Root Bark of E. natalensis S. Afr. J. Bot. 2006 72 579 583 10.1016/j.sajb.2006.03.005 15. van der Kooy F. Meyer J.J.M. Lall N. Antimycobacterial Activity and Possible Mode of Action of Newly Isolated Neodiospyrin and Other Naphthoquinones from E. natalensis S. Afr. J. Bot. 2006 72 349 352 10.1016/j.sajb.2005.09.009 16. Weigenand O. Hussein A.A. Lall N. Meyer J.J.M. Antibacterial Activity of Naphthoquinones and Triterpenoids from E. natalensis J. Nat. Prod. 2004 67 1936 1938 10.1021/np030465d 15568795 17. Tshikalange T.E. Lall N. Meyer J.J.M. Mahapatra A. In Vitro HIV-1 Reverse Transcriptase Inhibitory Activity of Naphthoquinones and Derivatives from E. natalensis S. Afr. J. Bot. 2007 73 339 10.1016/j.sajb.2007.02.200 18. Bati K. Baeti P.B. Gaobotse G. Kwape T.E. Leaf Extracts of E. natalensis Egypt. J. Basic Appl. Sci. 2024 11 232 252 10.1080/2314808X.2024.2326748 19. Lall N. Kumar V. Meyer D. Gasa N. Hamilton C. Matsabisa M. Oosthuizen C. In Vitro and In Vivo Antimycobacterial, Hepatoprotective and Immunomodulatory Activity of E. natalensis J. Ethnopharmacol. 2016 194 740 748 10.1016/j.jep.2016.10.060 27773800 20. Jain N.K. Chandrasekaran B. Khazaleh N. Jain H.K. Lal M. Joshi G. Jha V. Computational Network Pharmacology, Molecular Docking, and Molecular Dynamics to Decipher Natural Compounds of Alchornea laxiflora Pharmaceuticals 2025 18 508 10.3390/ph18040508 40283942 PMC12030508 21. Gois Leandro C. Senesi P. Singh Grewal A. Yan Z. Wei C. Integrated Bioinformatics and in Silico Approaches Reveal the Biological Targets and Molecular Mechanisms of 1,25-Dihydroxyvitamin D against COVID-19 and Diabetes Mellitus Front. Nutr. 2019 9 1060095 10.3389/fnut.2022.1060095 PMC9755336 36532549 22. Akoonjee A. Lukman H.Y. Ajao A.A. Uthman T.O. Sabiu S. A Network Pharmacology- and Molecular Dynamics Simulation-Based Bioprospection of Khaya grandifoliola J. Biomol. Struct. Dyn. 2024 1 20 10.1080/07391102.2024.2446672 23. Shao C. Wang H. Sang F. Xu L. Study on the Mechanism of Improving HIV/AIDS Immune Function with Jian Aikang Concentrated Pill Based on Network Pharmacology Combined with Experimental Validation Drug Des. Dev. Ther. 2022 16 2731 2753 10.2147/DDDT.S369832 36003311 PMC9394786 24. Kim S. Thiessen P.A. Bolton E.E. Chen J. Fu G. Gindulyte A. Han L. He J. He S. Shoemaker B.A. PubChem Substance and Compound Databases Nucleic Acids Res. 2016 44 D1202 D1213 10.1093/nar/gkv951 26400175 PMC4702940 25. Oduro-Kwateng E. Soliman M.E. DON/DRP-104 as Potent Serine Protease Inhibitors Implicated in SARS-CoV-2 Infection: Comparative Binding Modes with Human TMPRSS2 and Novel Therapeutic Approach J. Cell. Biochem. 2024 125 e30528 10.1002/jcb.30528 38284235 26. Daina A. Michielin O. Zoete V. SwissADME: A Free Web Tool to Evaluate Pharmacokinetics, Drug-Likeness and Medicinal Chemistry Friendliness of Small Molecules Sci. Rep. 2017 7 42717 10.1038/srep42717 28256516 PMC5335600 27. Yao Z.J. Dong J. Che Y.J. Zhu M.F. Wen M. Wang N.N. Wang S. Lu A.P. Cao D.S. TargetNet: A Web Service for Predicting Potential Drug–Target Interaction Profiling via Multi-Target SAR Models J. Comput. Aided Mol. Des. 2016 30 413 424 10.1007/s10822-016-9915-2 27167132 28. Gallo K. Goede A. Preissner R. Gohlke B.O. SuperPred 3.0: Drug Classification and Target Prediction—A Machine Learning Approach Nucleic Acids Res. 2022 50 W726 W731 10.1093/nar/gkac297 35524552 PMC9252837 29. Wang X. Shen Y. Wang S. Li S. Zhang W. Liu X. Lai L. Pei J. Li H. PharmMapper Nucleic Acids Res. 2017 45 W356 W360 10.1093/nar/gkx374 28472422 PMC5793840 30. Breuza L. Poux S. Estreicher A. Famiglietti M.L. Magrane M. Tognolli M. Bridge A. Baratin D. Redaschi N. Xenarios I. The UniProtKB Guide to the Human Proteome Database 2016 2016 bav120 10.1093/database/bav120 26896845 PMC4761109 31. Tang Y. Li M. Wang J. Pan Y. Wu F.X. CytoNCA: A Cytoscape Plugin for Centrality Analysis and Evaluation of Protein Interaction Networks BioSystems 2015 127 67 72 10.1016/j.biosystems.2014.11.005 25451770 32. Szklarczyk D. Kirsch R. Koutrouli M. Nastou K. Mehryary F. Hachilif R. Gable A.L. Fang T. Doncheva N.T. Pyysalo S. The STRING Database in 2023: Protein-Protein Association Networks and Functional Enrichment Analyses for Any Sequenced Genome of Interest Nucleic Acids Res 2023 51 D638 D646 10.1093/nar/gkac1000 36370105 PMC9825434 33. Chin C.H. Chen S.H. Wu H.H. Ho C.W. Ko M.T. Lin C.Y. CytoHubba: Identifying Hub Objects and Sub-Networks from Complex Interactome BMC Syst. Biol. 2014 8 S11 10.1186/1752-0509-8-S4-S11 25521941 PMC4290687 34. Ge S.X. Jung D. Jung D. Yao R. ShinyGO: A Graphical Gene-Set Enrichment Tool for Animals and Plants Bioinformatics 2020 36 2628 2629 10.1093/bioinformatics/btz931 31882993 PMC7178415 35. Johnston R.C. Yao K. Kaplan Z. Chelliah M. Leswing K. Seekins S. Watts S. Calkins D. Chief Elk J. Jerome S.V. Epik: PKa and Protonation State Prediction through Machine Learning J. Chem. Theory Comput. 2023 19 2380 2388 10.1021/acs.jctc.3c00044 37023332 36. Oduro-Kwateng E. Ali M. Kehinde I.O. Zhang Z. Soliman M.E.S. De Novo Rational Design of Peptide-Based Protein–Protein Inhibitors (Pep-PPIs) Approach by Mapping the Interaction Motifs of the PP Interface and Physicochemical Filtration: A Case on P25-Cdk5-Mediated Neurodegenerative Diseases J. Cell. Biochem. 2024 125 e30633 10.1002/jcb.30633 39148280 37. Oduro-Kwateng E. Kehinde I.O. Ali M. Kasumbwe K. Mzozoyana V. Parinandi N.L. Soliman M.E.S. Computational Analysis of Plasmodium Falciparum DNA Damage Inducible Protein 1 (PfDdi1): Insights into Binding of Artemisinin and Its Derivatives and Implications for Antimalarial Drug Design Cell Biochem. Biophys. 2025 83 3277 3297 10.1007/s12013-025-01709-2 40113723 PMC12414056 38. Salmon-Ferrer R. Goetz A.W. Poole D. Le Grand S. Walker R.C. Routine Microsecond Molecular Dynamics Simulations with AMBER—Part II: Particle Mesh Ewald J. Chem. Theory Comput. 2013 9 3878 3888 10.1021/ct400314y 26592383 39. Mark P. Nilsson L. Structure and Dynamics of the TIP3P, SPC, and SPC/E Water Models at 298 K J. Phys. Chem. A 2001 105 9954 9960 10.1021/jp003020w 40. Roe D.R. Cheatham T.E. III PTRAJ and CPPTRAJ: Software for Processing and Analysis of Molecular Dynamics Trajectory Data J. Chem. Theory Comput. 2013 9 3084 3095 10.1021/ct400341p 26583988 41. Wang E. Sun H. Wang J. Wang Z. Liu H. Zhang J.Z.H. Hou T. End-Point Binding Free Energy Calculation with MM/PBSA and MM/GBSA: Strategies and Applications in Drug Design Chem. Rev. 2019 119 9478 9508 10.1021/acs.chemrev.9b00055 31244000 42. Miller B.R. McGee T.D. Swails J.M. Homeyer N. Gohlke H. Roitberg A.E. MMPBSA.Py: An Efficient Program for End-State Free Energy Calculations J. Chem. Theory Comput. 2012 8 3314 3321 10.1021/ct300418h 26605738 43. Safran M. Rosen N. Twik M. BarShir R. Stein T.I. Dahary D. Fishilevich S. Lancet D. The GeneCards Suite Practical Guide to Life Science Databases Springer Nature Singapore 2022 44. Mu W. Patankar V. Kitchen S. Zhen A. Examining Chronic Inflammation, Immune Metabolism, and T Cell Dysfunction in HIV Infection Viruses 2024 16 219 10.3390/v16020219 38399994 PMC10893210 45. Moezpoor M.R. Stevenson M. Help or Hinder: Protein Host Factors That Impact HIV-1 Replication Viruses 2024 16 1281 10.3390/v16081281 39205255 PMC11360189 46. Hunt P.W. Th17, Gut, and HIV: Therapeutic Implications Curr. Opin. HIV AIDS 2010 5 189 193 10.1097/COH.0b013e32833647d9 20543599 PMC2917631 47. Khader S.A. Gaffen S.L. Kolls J.K. Th17 Cells at the Crossroads of Innate and Adaptive Immunity against Infectious Diseases at the Mucosa Mucosal Immunol. 2009 2 403 411 10.1038/mi.2009.100 19587639 PMC2811522 48. Renault C. Veyrenche N. Mennechet F. Bedin A.S. Routy J.P. Van de Perre P. Reynes J. Tuaillon E. Th17 CD4+ T-Cell as a Preferential Target for HIV Reservoirs Front. Immunol. 2022 13 822576 10.3389/fimmu.2022.822576 35197986 PMC8858966 49. Elhed A. Unutmaz D. Th17 Cells and HIV Infection Curr. Opin. HIV AIDS 2010 5 146 150 10.1097/COH.0b013e32833647a8 20543592 PMC3115760 50. O’Shea J.J. Steward-Tharp S.M. Laurence A. Watford W.T. Wei L. Adamson A.S. Fan S. Signal Transduction and Th17 Cell Differentiation Microbes Infect. 2009 11 599 611 10.1016/j.micinf.2009.04.007 19379825 PMC2754144 51. Waickman A.T. Powell J.D. MTOR, Metabolism, and the Regulation of T-Cell Differentiation and Function Immunol. Rev. 2012 249 43 58 10.1111/j.1600-065X.2012.01152.x 22889214 PMC3419491 52. Dang E.V. Barbi J. Yang H.Y. Jinasena D. Yu H. Zheng Y. Bordman Z. Fu J. Kim Y. Yen H.R. Control of TH17/Treg Balance by Hypoxia-Inducible Factor 1 Cell 2011 146 772 784 10.1016/j.cell.2011.07.033 21871655 PMC3387678 53. Daniels M.A. Teixeiro E. The NF-ΚB Signaling Network in the Life of T Cells Front. Immunol. 2025 16 1559494 10.3389/fimmu.2025.1559494 40370445 PMC12075310 54. Haase M. Fitze G. HSP90AB1: Helping the Good and the Bad Gene 2016 575 171 186 10.1016/j.gene.2015.08.063 26358502 PMC5675009 55. Tukaj S. Zillikens D. Kasperkiewicz M. Inhibitory Effects of Heat Shock Protein 90 Blockade on Proinflammatory Human Th1 and Th17 Cell Subpopulations J. Inflamm. 2014 11 10 10.1186/1476-9255-11-10 24694060 PMC3976086 56. Alanazi H.H. Elfaki E. The Immunomodulatory Role of Withania somnifera Front. Pharmacol. 2023 14 1084757 10.3389/fphar.2023.1084757 36909188 PMC9992553 57. Moudgil K.D. Venkatesha S.H. The Anti-Inflammatory and Immunomodulatory Activities of Natural Products to Control Autoimmune Inflammation Int. J. Mol. Sci. 2023 24 95 10.3390/ijms24010095 PMC9820125 36613560 58. Butterfield T.R. Landay A.L. Anzinger J.J. Dysfunctional Immunometabolism in HIV Infection: Contributing Factors and Implications for Age-Related Comorbid Diseases Curr. HIV/AIDS Rep. 2020 17 125 137 10.1007/s11904-020-00484-4 32140979 PMC8760627 59. Lisco A. Vanpouille C. Margolis L. Coinfecting Viruses as Determinants of HIV Disease Curr. HIV/AIDS Rep. 2009 6 5 12 10.1007/s11904-009-0002-3 19149991 PMC3427855 60. Anampa J. Barta S.K. Haigentz M. Sparano J.A. Human Immunodeficiency Virus (HIV) Infection and Cancer Abeloff’s Clinical Oncology IntechOpen London, UK 2019 61. Lin X. Song B. Cao L. Zhang L. Liu S. Wang X. Chen X. Li S. PD-1 Suppression Enhances HIV Reactivation and T-Cell Immunity via MAPK/NF-ΚB Signaling Eur. J. Med. Res. 2025 30 237 10.1186/s40001-025-02427-4 40186291 PMC11969704 62. Wang F. Cui Y. Shen X. Wang S. Yang G.B. IL-17A and IL-17F Repair HIV-1 Gp140 Damaged Caco-2 Cell Barriers by Upregulating Tight Junction Genes Microbes Infect. 2019 21 393 400 10.1016/j.micinf.2019.03.003 30951887 63. Noorsaeed S. AlBurtamani N. Rokan A. Fassati A. Heat Shock Protein 90 Is a Chaperone Regulator of HIV-1 Latency PLoS Pathog. 2025 21 e1012524 10.1371/journal.ppat.1012524 40168429 PMC11981193 64. Mbonye U. Karn J. The Cell Biology of HIV-1 Latency and Rebound Retrovirology 2024 21 6 10.1186/s12977-024-00639-w 38580979 PMC10996279 65. Wang P. Zhang Q. Tan L. Xu Y. Xie X. Zhao Y. The Regulatory Effects of MTOR Complexes in the Differentiation and Function of CD4+ T Cell Subsets J. Immunol. Res. 2020 2020 3406032 10.1155/2020/3406032 32377533 PMC7195637 66. Aiken C. Chen C.H. Betulinic Acid Derivatives as HIV-1 Antivirals Trends Mol. Med. 2005 11 31 36 10.1016/j.molmed.2004.11.001 15649820 67. Waki K. Durell S.R. Soheilian F. Nagashima K. Butler S.L. Freed E.O. Structural and Functional Insights into the HIV-1 Maturation Inhibitor Binding Pocket PLoS Pathog. 2012 8 e1002997 10.1371/journal.ppat.1002997 23144615 PMC3493477 68. Saisin S. Panthong K. Hongthong S. Kuhakarn C. Thanasansurapong S. Chairoungdua A. Suksen K. Akkarawongsapat R. Napaswad C. Prabpai S. Pyranonaphthoquinones and Naphthoquinones from the Stem Bark of Ventilago Harmandiana and Their Anti-HIV-1 Activity J. Nat. Prod. 2023 86 498 507 10.1021/acs.jnatprod.2c00980 36787536 PMC10043937 69. Tu N.Q. Richetta C. Putzu F. Delelis O. Ahmed K. Masand V.H. Schobert R. Tramontano E. Corona A. Biersack B. Identification of HIV-1 Reverse Transcriptase-Associated Ribonuclease H Inhibitors Based on 2-Hydroxy-1,4-Naphthoquinone Mannich Bases Molecules 2025 30 495 10.3390/molecules30030495 39942599 PMC11820915 70. Crosby I.T. Bourke D.G. Jones E.D. De Bruyn P.J. Rhodes D. Vandegraaff N. Cox S. Coates J.A.V. Robertson A.D. Antiviral Agents 2. Synthesis of Trimeric Naphthoquinone Analogues of Conocurvone and Their Antiviral Evaluation against HIV Bioorg. Med. Chem. 2010 18 6442 6450 10.1016/j.bmc.2010.06.105 20685126 71. Sandur S.K. Ichikawa H. Sethi G. Kwang S.A. Aggarwal B.B. Plumbagin (5-Hydroxy-2-Methyl-1,4-Naphthoquinone) Suppresses NF-ΚB Activation and NF-ΚB-Regulated Gene Products through Modulation of P65 and IκBα Kinase Activation, Leading to Potentiation of Apoptosis Induced by Cytokine and Chemotherapeutic Agents J. Biol. Chem. 2006 281 17023 17033 10.1074/jbc.M601595200 16624823 72. Andújar I. Recio M.C. Bacelli T. Giner R.M. Ríos J.L. Shikonin Reduces Oedema Induced by Phorbol Ester by Interfering with IκBα Degradation Thus Inhibiting Translocation of NF-ΚB to the Nucleus Br. J. Pharmacol. 2010 160 376 388 10.1111/j.1476-5381.2010.00696.x 20423347 PMC2874859 73. Wu H. Dai X. Wang E. Plumbagin Inhibits Cell Proliferation and Promotes Apoptosis in Multiple Myeloma Cells through Inhibition of the PI3K/Akt-MTOR Pathway Oncol. Lett. 2016 12 3614 3618 10.3892/ol.2016.5048 27900044 PMC5104058 74. Hafeez B.B. Jamal M.S. Fischer J.W. Mustafa A. Verma A.K. Plumbagin, a Plant Derived Natural Agent Inhibits the Growth of Pancreatic Cancer Cells in in Vitro and in Vivo via Targeting EGFR, Stat3 and NF-ΚB Signaling Pathways Int. J. Cancer 2012 131 2175 2186 10.1002/ijc.27478 22322442 PMC3522120 75. Kitson R.R.A. Kitsonová D. Siegel D. Ross D. Moody C.J. Geldanamycin, a Naturally Occurring Inhibitor of Hsp90 and a Lead Compound for Medicinal Chemistry J. Med. Chem. 2024 67 17946 17963 10.1021/acs.jmedchem.4c01048 39361055 PMC11513894 Figure 1 Schematic overview of the integrated computational workflow for investigating the anti-HIV/AIDS potential of Euclea natalensis Figure 2 Chemical structures and target prediction profiles of the Euclea natalensis A E. natalensis B Figure 3 Target prediction and intersection of phytochemicals and HIV/AIDS-associated genes. ( A Euclea natalensis B HIV Human Immunodeficiency Virus AIDS HIV/AIDS C Figure 4 BAR-TAR interaction network of Euclea natalensis E. natalensis Figure 5 PPI network and hub gene analysis of overlapping HIV/AIDS-related targets. ( A Euclea natalensis B C Figure 6 GO and KEGG pathway enrichment analysis of Euclea natalensis A B C D 10 Figure 7 Integrated KEGG map of Th17 cell differentiation (hsa04659) highlighting hub genes targeted by Euclea natalensis + STAT3 TGF-β MTOR HIF-1 E. natalensis MTOR STAT3 HIF1A NFκβ1 HSP90AA1 HSP90AB1 β E. natalensis Figure 8 BA–TAR–PATH network of Euclea natalensis NFκβ1 MTOR HSP90AA1 HSP90AB1 STAT3 Figure 9 KEGG pathway–pathway enrichment network plot. Nodes represent the top 20 significantly enriched KEGG pathways. The node size corresponds to the size of each gene set, and the color (green) intensity reflects the statistical significance (FDR-adjusted p Figure 10 Comparative molecular docking analysis illustrating the binding interactions of the two top-ranked Euclea natalensis A HSP90AA1 B HSP90AB1 C NFκβ1 D MTOR E STAT3 Figure 11 Superimposed line graphs illustrating comparative thermodynamic behaviors of ( A HSP90AA1 B HSP90AB1 C NFκβ1 D MTOR E STAT3 Euclea natalensis microorganisms-13-02150-t001_Table 1 Table 1 Physicochemical properties of selected phytochemicals from Euclea natalensis Phytochemical Canonical SMILES PubChem CID MF BS RO5 5-hydroxy-4-methoxy-2-nathaldehyde COC1=CC(CO)=CC2=C1C(O)=CC=C2 — C 12 12 3 0.55 0 7-Methyljuglone CC1=CC2=C(C(=O)C=CC2=O)C(=C1)O 26905 C 11 8 3 0.55 0 8′-hydroxydiospyrin CC1=CC2=C(C(O)=C1)C(=O)C=C(C2=O)C1=C(C)C(=O)C2=C(C(O)=CC=C2O)C1=O — C 22 14 7 0.55 0 Betulin CC(=C)[C@@H]1CC[C@]2([C@H]1[C@H]3CC[C@@H]4[C@]5(CC[C@@H](C([C@@H]5CC[C@]4([C@@]3(CC2)C)C)(C)C)O)C)CO 72326 C 30 50 2 0.55 1 Diospyrin CC1=CC2=C(C(=C1)O)C(=O)C=C(C2=O)C3=C(C4=C(C=C3C)C(=O)C=CC4=O)O 308140 C 22 14 6 0.55 0 Euclanone CC1=CC2=C(C(=CC(=C2C(=C1)O)O)C3=CC(=O)C4=C(C3=O)C(=O)C(=CC4=O)C)O 633717 C 22 14 7 0.55 0 Galpinone CC1=CC2=C(C(=C1)O)C(=O)C(=CC2=O)C3=CC(=O)C4=C(C3=O)C(=C(C(=C4)C)C5=C6C(=O)C=CC(=O)C6=C(C=C5C)O)O 635975 C 33 20 9 0.55 1 Isodiospyrin CC1=CC2=C(C(=O)C=CC2=O)C(=C1C3=C4C(=O)C=CC(=O)C4=C(C=C3C)O)O 99298 C 22 14 6 0.55 0 Lupeol CC(=C)[C@@H]1CC[C@]2([C@H]1[C@H]3CC[C@@H]4[C@]5(CC[C@@H](C([C@@H]5CC[C@]4([C@@]3(CC2)C)C)(C)C)O)C)C 259846 C 30 50 0.55 1 Mamegakinone CC1=CC2=C(C(=C1)O)C(=O)C(=CC2=O)C3=CC(=O)C4=C(C3=O)C(=CC(=C4)C)O 167673 C 22 14 6 0.55 0 Methylnaphthazarin CC1=CC(=O)C2=C(C=CC(=C2C1=O)O)O 271296 C 11 8 4 0.55 0 Natalenone [H]C1([H])C2C3=C(C(=O)C4=C(O)C=C(C)C=C4C3=O)C1(O)C1=C(C(O)=CC(C)=C1)C2=O — C 22 16 6 0.55 0 Neodiospyrin CC1=CC2=C(C(=C1)O)C(=O)C(=CC2=O)C3=C4C(=O)C=CC(=O)C4=C(C=C3C)O 16072922 C 22 14 6 0.55 0 Octahydroeuclein CC1=CC2=C([C@H]([C@H](CC2=O)C3=C(C4=C(C=C3C)C(CCC4=O)O)O)O)C(=C1)O 5273355 C 22 22 6 0.55 0 Shinanolone CC1=CC2=C(C(=O)CC[C@H]2O)C(=C1)O 5273357 C 11 12 3 0.55 0 β-sitosterol CC[C@H](CC[C@@H](C)[C@H]1CC[C@@H]2[C@@]1(CC[C@H]3[C@H]2CC=C4[C@@]3(CC[C@@H](C4)O)C)C)C(C)C 222284 C 29 50 0.55 1 PubChem Chemical identity (CID), molecular formula (MF), SMILES notation, bioactivity score (BS), and Lipinski’s Rule of Five (RO5) violations for selected phytochemicals isolated from the root bark of E. natalensis microorganisms-13-02150-t002_Table 2 Table 2 Topological parameters of Euclea natalensis  Phytochemical DC BC CC 1 Galpinone 150 12,264.043 0.490 2 Neodiospyrin 139 7917.464 0.475 3 Natalenone 139 17,033.264 0.475 4 Mamegakinone 136 8877.140 0.471 5 Diospyrin 135 7291.925 0.469 6 Isodiospyrin 132 6207.231 0.465 7 Betulin 112 16,674.690 0.440 8 Euclanone 108 7403.342 0.436 9 7-Methyljuglone 107 4261.511 0.434 10 Octahydroeuclein 105 7981.093 0.432 11 8’-hydroxydiospyrin 99 6062.130 0.425 12 β-sitosterol 97 10,330.302 0.423 13 Lupeol 96 9744.878 0.422 14 Methylnaphthazarin 88 5105.912 0.414 15 Shinanolone 84 3258.515 0.409 16 5-hydroxy-4-methoxy-2-nathaldehyde 73 8500.559 0.399 microorganisms-13-02150-t003_Table 3 Table 3 Docking scores (kcal/mol) of top-ranked phytochemicals with HIV/AIDS-associated hub proteins compared with co-crystallized ligands and reference inhibitors. Ligand Docking Score (kcal/mol)  NFκβ1  STAT3  ESR1  HSP90AA1  MTOR  CASP3  HIF1A  HSP90AB1 Natalenone −7.4 −6.8 −5.7 −10.8 −8.0 −8.5 −8.8 −10.5 Mamegakinone −7.2 −7.4 −6.0 −9.0 −9.5 −8.7 −8.7 −8.8 Octahydroeuclein −6.6 −6.8 −5.9 −9.8 −8.7 −7.6 −7.9 −9.5 Neodiospyrin −7.1 −7.3 −7.3 −10.8 −8.6 −8.5 −8.6 −10.4 β-sitosterol −6.1 −5.9 −6.7 −9.7 −8.1 −7.5 −8.3 −9.5 Diospyrin −7.6 −6.8 −5.4 −11.6 −9.4 −8.3 −9.1 −11.3 Isodiospyrin −7.4 −6.9 −9.5 −10.5 −8.5 −8.0 −8.4 −9.9 Galpinone −7.7 −8.3 −5.9 −11.3 −10.3 −9.2 −10.3 −10.8 Co-crystallized - SI-109 Estradiol PU-11 Torin 2 MSI - PU-11   −9.8 −10.6 −8.1 −11.6 −8.5  −8.0 Reference IMD 0354 - - - - - 2-ME2 -  −6.5      −7.7  microorganisms-13-02150-t004_Table 4 Table 4 BFE components (kcal/mol) of diospyrin and galpinone with hub targets ( HSP90AA1 HSP90AB1 NFκB1 MTOR STAT3 Protein–Ligand System Energy Components (kcal/mol) ∆ E vdW ∆ E elec ∆ G gas ∆ G GB ∆ G SA ∆ G solv ∆ G bind HSP90AA1 −42.38 −10.48 −52.85 28.12 −5.03 23.09 −29.76 HSP90AA1 −46.52 −20.06 −66.59 33.58 −5.90 27.67 −38.91 HSP90AB1 −44.52 −10.66 −55.17 29.89 −5.37 24.52 −30.66 HSP90AB1 −45.99 −25.18 −71.17 36.63 −5.92 30.71 −40.46 NFκβ1 −47.89 −30.53 −78.41 56.97 −5.41 51.56 −26.85 NFκβ1 −22.16 −42.15 −64.31 50.62 −3.67 46.95 −17.36 MTOR −44.77 −24.96 −69.73 45.39 −4.54 40.85 −28.88 MTOR −47.36 −34.48 −81.84 45.52 −4.58 40.94 −40.90 STAT3 −32.43 −10.08 −42.51 24.63 −4.03 20.60 −21.91 STAT3 −46.35 −306.50 −352.85 289.84 −7.00 282.84 −70.01 Electrostatic energy (∆ E elec E vdW G gas G GB G SA G solv G bind ",
  "metadata": {
    "Title of this paper": "Geldanamycin, a Naturally Occurring Inhibitor of Hsp90 and a Lead Compound for Medicinal Chemistry",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472539/"
  }
}