{
  "title": "Paper_361",
  "abstract": "pmc Open Vet J Open Vet J 2846 openvetj Open Veterinary Journal 2226-4485 2218-6050 Faculty of Veterinary Medicine, University of Tripoli PMC12483373 PMC12483373.1 12483373 12483373 41035989 10.5455/OVJ.2025.v15.i8.3 OpenVetJ-15-8-3388 1 Review Article Antiviral effects of herbal extracts against avian influenza and Newcastle disease viruses Elsherbini Mohamed Mohsen Ahmed  * Ali Ahmed Abd El-Samie Hassan Ahmed Fatma Mohamed Abdalla Kotb Gamilat Department of Virology, Faculty of Veterinary Medicine, Zagazig University, Zagazig, Egypt * mohamedmohsen3918@gmail.com 2025 31 8 2025 15 8 498022 3388 3398 26 5 2025 15 7 2025 22 7 2025 01 01 2025 01 10 2025 02 10 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Medicinal herbs have long been used for their ability to manage viral infections and other diseases. Plants are beneficial for treating several bacterial and viral infections in humans and animals. Plants play a crucial role in providing pharmacological and medicinal products due to their capacity to produce chemicals with antiviral properties via secondary metabolism. This could reduce the need for chemotherapy treatments in poultry. Recent research indicates that natural products have a significant promise as a source of novel antiviral agents. Additional ethnobotanical research and laboratory experiments are being conducted to identify plants with the potential to enhance avian influenza virus and Newcastle Disease management. This review sheds light on plants exhibiting antiviral effects against avian influenza virus and 21 Newcastle disease viruses. Avian influenza virus Newcastle disease virus Management Herbal plants pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Viruses have a substantial mutation rate, resulting in the constant appearance of novel strains that are resistant to antiviral treatments. Thus, it is crucial to consistently investigate and create novel antiviral substances. In recent decades, there has been a growing interest in the quest for plant-derived pharmaceutical compounds that might effectively combat animal viruses with high fatality rates or that result in significant economic losses. The poultry business is a crucial agricultural sector that supplies food to approximately 7 billion people globally. The demand for chicken meat has been consistently rising and is projected to reach 131,607 thousand tons by 2026. The chicken business is affected by a range of pathogenic microorganisms, including viruses, bacteria, and protozoa. The most formidable diseases among them are viral infections that persist via genetic modifications, such as mutations, recombinations, or co-evolution with vaccinations ( Yasmin et al Although vaccinations have proven effective in managing several viral infections, some diseases may only be managed with the use of antiviral chemotherapy. The acceptance of antiviral medications has been gradual, mostly due to the toxicity associated with the previous generations of these agents. Unlike the progress made in the creation of antibiotics, efforts to create antiviral medications have encountered several challenges. Viruses rely only on cellular metabolic processes, which means that they have a restricted number of enzyme systems and building components that may be targeted by drugs. In addition, unlike a substance that inhibits the growth of bacteria, a potent antiviral medication must not only exhibit significant selectivity in its ability to combat viruses but also permanently hinder viral replication to prevent cell death caused by the viral infection and promote the resumption of normal cellular processes. A significant number of infectious viral illnesses continue to result in substantial fatality rates. Despite significant advancements in antiviral chemotherapy, there is a continuing need for antiviral medicines. The emergence of drug-resistant viruses during treatment is a possible obstacle to successful therapy. In addition, novel viral pathogens may be identified. Over a considerable period of time, phytochemicals have been recognized for their ability to suppress viruses. These antiviral chemicals may be obtained from sources, such as higher plants, which have been far less investigated than conventional sources for different reasons. The first antiviral medication with clinical efficacy was methylisatin-thiosemicarbazone (Methisazone), which showed effectiveness in treating dermatitis vaccinatum and preventing smallpox, particularly the smallpox virus. Methisazone, administered at a dosage of 25 mg/kg, exerted inhibitory effects against the variola virus. Subsequently, it was effectively used for treating dermatitis vaccinatum and as a preventive and therapeutic measure against smallpox. The proliferation of drug-resistant viruses in medical therapy is a significant challenge for achieving successful therapeutic outcomes. In addition, novel viral pathogens may also be discovered. Consequently, there is a significant need for readily available antiviral drugs that are affordable and have low adverse effects. Therefore, exploring traditional medicines as potential new antiviral agents is essential, given that several ancient remedies, which consist of various plant metabolites, have strong antiviral properties ( Mukherjee, 2019 This review will discuss the antiviral effect of herbal plants against the most severe avian infections affecting the poultry industry caused by viruses, including the avian influenza virus (AIV) and Newcastle disease virus (NDV). The AIV The Orthomyxoviridae family includes the AIV. The virus encodes at least 11 proteins through its negative, single-stranded, eight-segmented RNAs. Virus subtypes are defined by the surface hemagglutinin (HA) and neuraminidase (NA) proteins, which are in charge of virus attachment and release, respectively ( Abdelwhab and Hafez, 2012 Based on its disease-causing potential in chickens, the virus is classified as either highly pathogenic AIV (HPAIV) or low pathogenic AIV. Numerous subtypes of AIV, such as H5, H7, and H9, co-circulate, rendering the vaccine useless. Hence, vaccination against several HA subtypes is essential. Immunological pressure, which accelerates the virus’s evolution rate, is another factor that reduces vaccination effectiveness ( Yasmin et al Table 1 Eugenia jambolana Eugenia jambolana Sood et al Camellia sinensis (green tea) Green tea’s main phenolic ingredient, catechins, is antiviral and antibacterial. Song et al Kim et al Kuzuhara et al Pure Echinacea Echinacea Kuzuhara et al NAS prep NAS contains herbs Folium isatidis Shang et al Sumac nigra Sambucus nigra in vitro in vivo Krawitz et al Roschek et al Karimi et al Echinacea Cranberry Luganini et al H. perforatum Zhai et al Rumex acetosa Proanthocyanidin-rich Rumex acetosa Derksen et al Table 1. Antiviral activity of some medicinal plants against avian influenza. No. Plant species Plant part or compound Antiviral effect Reference 1  Eugenia jambolana Bark and leaves The extracts exhibited complete suppression of the virus's CPE in MDCK cells. Sood et al 2 Camellia sinensis Catechins Hinder several phases of avian influenza virus (AIV) replication  Song et al 3  Echinacea purpurea Caffeic acid derivatives, alkylamines, and polysaccharides Inhibiting AIV growth in embryonated chicken eggs  Kim et al 4 NAS preparation Variety of purine and pyrimidine derivatives Controlling the H9N2 subtype of Avian Influenza Virus (AIV) in chickens  Shang et al 5 Sambucus nigra An 80% EtOH extract compound Attachment to the HA proteins of influenza H1N1, inhibiting the entrance and identification of host cells.  Roschek et al 6 Cranberry Oximacro Inhibits viral entrance and attachment  Wang et al 7  Rumex acetosa Proanthocyanidins, Procyanidin B2-di-gallate The attachment was blocked, and viral penetration was disrupted. Procyandin B2-di-gallate interacts with the receptor binding site of the IAV (H1N1)  Derksen et al 8  Phyllanthus emblica pGGs HA-inhibition activity by interacting with the conserved structural components of the RBD  Ge et al 9 Melaleucaalternifolia concentration (MAC) Terpinen-4-ol Terpinen-4-ol can attach to a specific location on the HA protein where membrane fusion occurs.  Li et al 10  Gossypium hirstum Gossypol, a polyphenolic Inhibiting the entrance of the virus by specifically targeting the HA2 protein.  Yang et al 11 Scutellaria baicalensis Baicalein Suppression of in vitro replication of H1N1 during the 2009 pandemic and seasonal Hour et al 12 Fructus Gardeniae Iridoid glycoside Suppress acidification inside cells and calcium ion inflow during the replication cycle of the influenza virus  Guo et al 13 Lycoris radiata pGG PGG effectively prevents hemagglutination and viral entry by binding to two HA trimers at the RBD.  Ge et al 14 Boswellia Essential oil Inhibiting the translation of viral proteins, namely the NP and NS1 proteins, rather than affecting mRNA expression  Wu et al 15  Rheum palmatum Aloe-emodin A decrease in cytotoxicity and a concentration-dependent decrease in the viral-induced CPE.  Li et al 16  Alpinia galanga ACA Inhibition of the nuclear export of vRNP.  Watanabe et al 17  Chaenomeles sinensis High-molecular-weight polyphenols found in C. sinensis fruits It counteracts the influenza virus by blocking its ability to cause red blood cell clumping and by reducing NS2 protein production.  Sawai et al 18  Litchi chinensis Oligonol Obstructing the virus's adhesion to MDCK cells and reducing the nuclear export of influenza vRNP.  Gangehei et al 19  Calotropis gigantean A lignan glycoside Suppresses the NF-kB pathway activation generated by the influenza virus  Parhira et al 20  Vitis amurensis Resveratrol Prevent the replication of H5N1 in MDCK cells.  Palamara et al Phyllanthus emblica Gooseberry ( Phyllanthus emblica Ge et al In silico Potency of Melaleuca alternifolia Melaleuca alternifolia Li et al Gossypium hirsutum Gossypium hirsutum Yang et al. (2013) Baikal skullcap Scutellaria baicalensis Scutellaria baicalensis Hour et al Fruit of gardening Despite M2 inhibitor resistance, acidification pathway modification can be used to develop antiviral drugs. Iridoid glycoside from Fructus Gardeniae reduces cell acidification and calcium ion influx during influenza virus replication ( Guo et al Red spider lily (Lycoris radiata) The antiviral activities of Amaryllidaceae alkaloids from Lycoris radiata He et al Boswellia Wu et al Boswellia carteri Boswellia serrata Rheum palmatum Aloe-emodin is found in the Chinese rhubarb, Rheum palmatum Li et al Alpine galanga Valerianae radix (valerians) valtrate and Alpinia galanga Watanabe et al Chaenomeles sinensis Sawai et al Chaenomeles sinensis Litchi chinensis Oligonol from Litchi chinensis Trifolium pretense Gangehei et al Giant calotropis A lignan glycoside from Calotropis gigantea Parhira et al Vitis amurensis Vitis amurensis Vitis amurensis Palamara et al NDV NDV is a member of the Avulavirus Yusoff and Tan, 2001 The spread of Newcastle Disease (ND) is prevented by using vaccines on a global scale. Birds may experience less severe symptoms after receiving a vaccine; however, the virus can still infect birds through shedding and reproduction ( Chukwudi et al Shabbir et al Xiao et al Because of geographical constraints in African and Asian nations, the World Health Organization (WHO) estimates that 80% of the world’s population uses traditional healthcare techniques ( WHO, 2008 Table 2 Ocimum sanctum In India and tropical and subtropical countries, Sanctum is grown, often known as Holy basil or Tulsi, a sacred plant. Several ancient civilizations depicted therapy. Antiviral power of O. sanctum O. sacred Jayati et al Glycyrrhiza glabra Licorice, Mulethi, and sweetwood are native to Asia and Europe. It flavors tobacco, beverages, and confections. The soft, fibrous primary taproot has the plant’s medicinal properties. Embryonated chicken egg (ECE) hemagglutination inhibition results showed that an aqueous extract of G. glabra Omer et al Wang et al Omer et al Commiphora swynnertonii Commiphora swynnertonii Commiphora swynnertonii Commiphora swynnertonii Moshi et al Table 2. Antiviral activity of some medicinal plants against NDV. No Plant species Plant part or compound Antiviral effect References 1  Ocimum sanctum Leaves Inhibits the CPE of NDV  Jayati et al 2  Glycyrrhiza glabra Glycyrrhizin and 18-β-glycyrrhetinic acid Inhibition of virus gene expression, replication, attachment  Omer et al 3  Commiphora swynnertonii Bark, leaves, resin, stem, and root Causes decrease in the viral titer.  Bakari et al 4  Nauclea latifolia Leaves Effectively reduced viral loads in toxicity tests. Onu et al 5 Afsanteen Bioactive components Effectively inhibits NDV proliferation in embryos. Liu et al 6  Curcuma longa Aerial parts Enhancement of the immunological response to the infection  Madbouly et al 7  Withania somnifera Leaves, roots promoting the synthesis of both white and red blood cells  Senthilnathan et al 8  Aloe secundiflora Gel Decrease death rates in birds infected with NDV.  Waihenya et al 9 Capsicum spp. Capsaicin Enhances the ability to withstand viral diseases.  Lans et al 10  Momordica balsamina Fruit pulp and leaves Prevent the attachment of the virus to the host cell surface. Chollom et al 11  Euphorbia ingens Branches A 38% decrease in the mortality rate.  Lans et al 12  Cucumis metuliferus Ripe fruit Exhibits strong antiviral characteristics and efficiently reduces sickness symptoms.  Chen et al 13  Thymus vulgaris Oil Disrupted viral envelopes and impeded virion attachment to the host cell.  Rezatofighi et al 14  Adansonia digitata Bark Prevent deaths in ECE when NDV is inoculated.  Sulaiman et al 15  Echinacea purpurea Aerial parts Enhanced viral resistance and significantly enhanced food intake rates while reducing mortality in chickens affected by disease.  Fard et al 16  Cassia tora Anthraquinones Exhibits anti-NDV action Lans (2003) 17  Acacia nilotica Stem, leaves Inhibits NDV replication  Saeed (2007) 18  Moringa oleifera Seeds Reduction in antibody production and viral clearance Chollom et al 19  Cladosiphon okamuranus Cell wall Exhibit a reduction in the expression of HA and NP proteins in 48% of viral infections.  Elizondo-Gonzalez et al 20  Psidium guajava Leaves Suppresses viral replication in ECEs at doses of 250 and 200 mg/ml. Chollom et al 21  Azadirachta indica Leaves, stem Neem extract demonstrated antiviral properties in SPF ECE. Waafa et al Allantoic fluid from eggs and blood from hatched chicks were used in hemagglutination and inhibition experiments. Eggs treated with the extract had a higher average weight and survival rate than the infected control group. Extract reduced viral titer. Eggs treated with resin extract had no viruses in their allantoic fluid. Since no antibodies were found in the bloodstream of the chicks, bark and root extracts were thought to kill the virus ( Bakari et al Nauclea latifolia Deciduous shrub or small tree Nauclea latifolia N. latifolia Nauclea latifolia Onu et al Afsanteen The Asteraceae family includes Afsanteen ( Artemisia annua A. annua’s et al Curcuma longa Curcuma longa Dairaku et al Madbouly et al Withania somnifera Worldwide, Withania somnifera Senthilnathan et al Aloe secundiflora Aloe secundiflora A. secundiflora Waihenya et al Capsicum Capsicum Capsicum Lans et al Momordica balsamina This plant is Cucurbitaceae. It comes from Northern Nigeria. According to phytochemical analysis, the fruit, leaves, and seeds contained lectins, steroids, saponins, glycosides, and tannins. Alkaloids, flavonoids, saponins, and tannins are new antivirals ( Jassim and Naji, 2003 M. balsamina fruit Chollom et al Euphorbia ingens Euphorbia ingens E. ingens Lans et al Cucumis metuliferus The Cucurbitaceae family includes the horned melon or kiwano. Ripe fruit has a yellow to orange exterior and lime green, gelatinous, and acidic flesh like a cucumber. This plant has unique medicinal qualities due to its phytochemicals. The fruit pulp of C. metuiferus Chen et al Thymus vulgaris Thymus vulgaris is commonly called thyme. This species is found in the Mediterranean, North Africa, and Asia. It grows to 50 cm tall with woody, spreading branches. Flower colors range from purple to pink. This product contains antioxidant and antibacterial essential oils and bioactive compounds. These chemicals inhibit fungi, yeasts, viruses, and bacteria. Thymus vulgaris fights HSV-1/HSV-2 and NDV. The plant’s essential oils ruptured viral envelopes and prevented virion attachment to host cells ( Rezatofighi et al Adansonia digitata The species Adansonia digitata A. digitata A. digitata Sulaiman et al Echinacea purpurea The purple coneflower is Echinacea purpurea E. purpurea Fard et al Cassia tora Cassia tora Lans et al Acacia nilotica Acacia nilotica A. nilotica A. nilotica Saeed, 2007 Moringa oleifera Moringa oleifera M. oleifera M. Ashraf et al Chollom et al Cladosiphon okamuranus Cladosiphon okamuranus Elizondo-Gonzalez et al Guajava Common guava, also known as Psidium guajava Psidium guajava Chollom et al Azadirachta indica The Meliaceae plant Azadirachta indica Durrani et al Azadirachta indica Makeri et al Bonsu et al A. indica Wafaa et al Conclusion The data reported in this research emphasize the use of medicinal plants as a means to fight ND and AIV. This document examines 41 plants and their respective components, as well as the diverse extracts used to combat NDV and AIV. In order to discover more effective and less harmful treatments for NDV and AIV, it is crucial to use innovative antiviral medications derived from the bioactive compounds found in plants. Significant focus was given to the potential abilities of plants containing active compounds that have antiviral properties against NDV and AIV. Regarding the in vitro Acknowledgement Not applicable. Conflict of interests: The authors have not declared any conflict of interest. Funding Not applicable. Ethical approval Not applicable. Authors’ contributions All authors contributed equally. Data availability All data were presented in the study. References Abdelwhab E.M. Hafez H.M. Insight into alternative approaches for control of avian influenza in poultry, with emphasis on highly pathogenic H5N1 Viruses 2012 4 11 3179 3208 23202521 10.3390/v4113179 PMC3509689 Ashraf A. Mahboob S. Andleeb R. Ijaz M.U. Shah M.S. Status updates of Newcastle disease and amelioration effects of medicinal plants against Newcastle disease virus: a review Acta Virol 2018 62 1 3 15 29521098 10.4149/av_2018_101 Bakari G.G. Max R.A. Mdegela R.H. Phiri E.C. Mtambo M.M. Antiviral activity of crude extracts from Commiphora swynnertonii Trop. Anim. Health Prod 2012 44 1389 1393 22302704 10.1007/s11250-012-0076-6 Bonsu F.R.K. Kagya-Agyemang J.K. Kwenin W.K.J. Zanu H.K. Medicinal response of broiler chickens to diets containing neem ( Azadirachta indica World Appl. Sci. J 2012 19 6 800 805 Chen Y. Wang D. Hu Y. Guo Z. Wang J. Zhao X. Fan Y. Guo L. Yang S. Sai F. Xing Y. Astragalus polysaccharide and oxymatrine can synergistically improve the immune efficacy of Newcastle disease vaccine in chicken Inter. J. Biol. Macromol 2010 46 4 425 428 10.1016/j.ijbiomac.2010.02.004 20149818 Chollom S.C. Agada G.O.A. Gotep J.G. Mwankon S.E. Dus P.C. Bot Y.S. Nyango D.Y. Singnap C.L. Fyaktu E.J. Okwori A.E.J. Investigation of aqueous extract of Moringa oleifera lam seed for antiviral activity against Newcastle disease virus in ovo J. Med. Plants Res 2012a 6 22 3870 3875 Chollom S.C. Olawuyi A.K. Danjuma L.D. Nanbol L.D. Makinde I.O. Hashimu G.A. Alesa M.U. Esilonu J.T. Ogundeji E.B. Kwatjel J.S. Antiviral potential of aqueous extracts of some parts of Momordica balsamina J. Adv. Pharm. Edu. Res 2012b 2 3 82 92 Chukwudi O.E. Chukwuemeka E.D. Mary U. Newcastle disease virus shedding among healthy commercial chickens and its epidemiological importance Pak. Vet. J 2012 32 3 354 356 Dairaku I. Han Y. Yanaka N. Kato N. Inhibitory effect of curcumin on IMP dehydrogenase, the target for anticancer and antiviral chemotherapy agents Biosci. Biotechnol. Biochem 2010 74 1 185 187 20057137 10.1271/bbb.90568 Derksen A. Hensel A. Hafezi W. Herrmann F. Schmidt T.J. Ehrhardt C. Ludwig S. Kühn J. 3-O-galloylated procyanidins from Rumex acetosa PLoS One 2014 9 10 e110089 25303676 10.1371/journal.pone.0110089 PMC4193892 Durrani F.R. Sultan A. Jan M. Chand N. Durrani Z. Immunomodulatory and growth promoting effects of neem ( Azadirachta indica Sarhad J. Agricult 2008 24 4 655 659 Elizondo-Gonzalez R. Cruz-Suarez L.E. Ricque-Marie D. Mendoza-Gamboa E. Rodriguez-Padilla C. Trejo-Avila L.M. In vitro characterization of the antiviral activity of fucoidan from Cladosiphon okamuranus Virol. J 2012 9 1 9 23234372 10.1186/1743-422X-9-307 PMC3546940 Fard M.H.B. Feizi A. Bijanzad P. Effect of Echinacea purpurea J. Vet. Res., 2010 65 119 122 Gangehei L. Ali M. Zhang W. Chen Z. Wakame K. Haidari M. Oligonol a low molecular weight polyphenol of lychee fruit extract inhibits proliferation of influenza virus by blocking reactive oxygen species-dependent ERK phosphorylation Phytomedicine 2010 17 13 1047 1056 20554190 10.1016/j.phymed.2010.03.016 Ge H. Liu G. Xiang Y.F. Wang Y. Guo C.W. Chen N.H. Zhang Y.J. Wang Y.F. Kitazato K. Xu J. The mechanism of poly-galloyl-glucoses preventing Influenza A virus entry into host cells PLoS One 2014 9 4 e94392 24718639 10.1371/journal.pone.0094392 PMC3981784 Guo S. Gao Y. Jin Y. Tian X. Cui X. The inhibitory effect of iridoid glycoside extracted from Fructus Gardeniae on intracellular acidification and extracellular Ca2+ influx induced by influenza A virus Exper. Biol. Med 2014 239 8 986 997 10.1177/1535370214530361 24764245 He J. Qi W.B. Wang L. Tian J. Jiao P.R. Liu G.Q. Ye W.C. Liao M. Amaryllidaceae alkaloids inhibit nuclear-to-cytoplasmic export of ribonucleoprotein (RNP) complex of highly pathogenic avian influenza virus H5N1 Influenza Other Respir Viruses 2013 7 6 922 931 23136954 10.1111/irv.12035 PMC4634243 Hour M.J. Huang S.H. Chang C.Y. Lin Y.K. Wang C.Y. Chang Y.S. Lin C.W. Baicalein, ethyl acetate, and chloroform extracts of Scutellaria baicalensis Evid. Based Complem. Altern. Med 2013 2013 1 750803 10.1155/2013/750803 PMC3705751 23864896 Jassim S.A. Naji M.A. Novel antiviral agents: a medicinal plant perspective J. Appl. Microbiol 2003 95 412 427 12911688 10.1046/j.1365-2672.2003.02026.x Jayati B.A. Kumar A. Goel A. Gupta S. Rahal A. In vitro antiviral potential of Ocimum sanctum Inter. J. Microbiol. Immunol. Res 2013 2 7 51 55 Karimi S. Mohammadi A. Dadras H. The effect of Echinacea purpurea Sambucus nigra Veter. Arhiv 2014 84 2 153 165 Kim M. Kim S.Y. Lee H.W. Shin J.S. Kim P. Jung Y.S. Jeong H.S. Hyun J.K. Lee C.K. Inhibition of influenza virus internalization by (−)-epigallocatechin-3-gallate Antiviral Res 2013 100 2 460 472 23954192 10.1016/j.antiviral.2013.08.002 Krawitz C. Mraheil M.A. Stein M. Imirzalioglu C. Domann E. Pleschka S. Hain T. Inhibitory activity of a standardized elderberry liquid extract against clinically-relevant human respiratory bacterial pathogens and influenza A and B viruses BMC Complem. Altern. Med 2011 11 1 6 10.1186/1472-6882-11-16 PMC3056848 21352539 Kuzuhara T. Iwai Y. Takahashi H. Hatakeyama D. Echigo N. Green tea catechins inhibit the endonuclease activity of influenza A virus RNA polymerase PLoS Curr 2009 1 1052 10.1371/currents.RRN1052 PMC2762814 20025206 Lans C. Khan T.E. Curran M.M. McCorkle C.M. Wynn S.G. Fougere B.J. Ethnoveterinary medicine: potential solutions for large-scale problems? In Veterinary herbal medicine 2007 St. Louis, MO Mosby 17 32 Li S.W. Yang T.C. Lai C.C. Huang S.H. Liao J.M. Wan L. Lin Y.J. Lin C.W. Antiviral activity of aloe-emodin against influenza A virus via galectin-3 up-regulation Europ. J. Pharmacol 2014 738 125 132 10.1016/j.ejphar.2014.05.028 24877694 Li X. Duan S. Chu C. Xu J. Zeng G. Lam A.K.Y. Zhou J. Yin Y. Fang D. Reynolds M.J. Gu H. Melaleuca alternifolia concentrate inhibits in vitro entry of influenza virus into host cells Molecules 2013 18 8 9550 9566 23966077 10.3390/molecules18089550 PMC6270578 Liu Yali L.Y. Yan GenQiang Y.G. Chen GuoHui C.G. Zhang Jing Z.J. Efficacy trials of crude extraction from Artemisia annul App. Sci 2009 3 176 178 Luganini A. Terlizzi M.E. Catucci G. Gilardi G. Maffei M.E. Gribaudo G. The cranberry extract oximacro® exerts in vitro virucidal activity against influenza virus by interfering with hemagglutinin Front. Microbiol 2018 9 1826 30131793 10.3389/fmicb.2018.01826 PMC6090095 Madbouly H.M. Saif M.A. Hussein A.S. Curcuma longa for protecting chicks against Newcastle disease virus infection and immunosuppressive effect of Marek’s disease viral vaccine Int. J. Virol 2011 7 176 183 Makeri H.K. Maikai V.A. Nok J.A. Effect of topical application of neem seed (Azadiracta indica) extract on sheep infested with Amblyomma variegatum Afri. J. Biotechnol 2007 6 20 Moshi M.J. Innocent E. Magadula J.J. Otieno D.F. Weisheit A. Mbabazi P.K. Nondo R.S.O. Brine shrimp toxicity of some plants used as traditional medicines in Kagera Region, north western Tanzania Tanz. J. Health Res 2010 12 1 63 67 10.4314/thrb.v12i1.56287 20737830 Mukherjee P.K. Antiviral evaluation of herbal drugs In Quality control and evaluation of herbal drugs 2019 599 Omer M.O. AlMalki W.H. Shahid I. Khuram S. Altaf I. Imran S. Comparative study to evaluate the anti-viral efficacy of Glycyrrhiza glabra Pharmacog. Res 2014 6 1 6 10.4103/0974-8490.122911 PMC3897011 24497736 Onu U. Nwiyi P. Erumaka I. Antiviral effects of Nauclea latifolia Sky J. Microbiol. Res 2015 3 1 1 5 Palamara A.T. Nencioni L. Aquilano K. De Chiara G. Hernandez L. Cozzolino F. Ciriolo M.R. Garaci E. Inhibition of influenza A virus replication by resveratrol J. Infect. Dis 2005 191 10 1719 1729 15838800 10.1086/429694 Parhira S. Yang Z.F. Zhu G.Y. Chen Q.L. Zhou B.X. Wang Y.T. Liu L. Bai L.P. Jiang Z.H. In vitro anti-influenza virus activities of a new lignan glycoside from the latex of Calotropis gigantea PLoS One 2014 9 8 e104544 25102000 10.1371/journal.pone.0104544 PMC4125211 Rezatofighi S.E. Seydabadi A. Nejad S.M.S. Evaluating the efficacy of Achillea millefolium Thymus vulgaris Jund. J. Microbiol 2014 7 2 e9016 10.5812/jjm.9016 PMC4138681 25147678 Roschek Jr B. Fink R.C. McMichael M.D. Li D. Alberte R.S. Elderberry flavonoids bind to and prevent H1N1 infection in vitro Phytochemistry 2009 70 10 1255 1261 19682714 10.1016/j.phytochem.2009.06.003 Saeed A.M.M. The antiviral effect of acacia nilotica extracts against the mesogenic strain of Newcastle disease virus 2007 Khartoum, Sudan Department of Medicine Pharmacology and Toxicology, Faculty of Veterinary Medicine, University of Khartoum Doctoral Dissertation Sawai R. Kuroda K. Shibata T. Gomyou R. Osawa K. Shimizu K. Anti-influenza virus activity of Chaenomeles sinensis J. Ethnopharmacol 2008 118 1 108 112 18456441 10.1016/j.jep.2008.03.013 Senthilnathan P. Padmavathi R. Banu S.M. Sakthisekaran D. Enhancement of antitumor effect of paclitaxel in combination with immunomodulatory Withania somnifera Chem. Biol. Inter 2006 159 3 180 185 10.1016/j.cbi.2005.11.003 16375880 Shabbir M.Z. Mahmood S. Ul-Rahman A. Banyard A.C. Ross C.S. Genomic diversity and evolutionary insights of avian paramyxovirus-1 in avian populations in Pakistan Viruses 2024 16 9 1414 39339893 10.3390/v16091414 PMC11437410 Shang R.F. Liang J.P. Na Z.Y. Yang H.J. Lu Y. Hua L.Y. Guo W.Z. Cui Y. Wang L. In vivo inhibition of NAS preparation on H9N2 subtype AIV Virolog. Sin 2010 25 145 150 10.1007/s12250-010-3082-8 PMC8227913 20960312 Song J.M. Lee K.H. Seong B.L. Antiviral effect of catechins in green tea on influenza virus Antivir. Res 2005 68 2 66 74 16137775 10.1016/j.antiviral.2005.06.010 Sood R. Swarup D. Bhatia S. Kulkarni D.D. Dey S. Saini M. Dubey S.C. Antiviral activity of crude extracts of Eugenia jambolana Ind. J. Exper. Biol 2012 50 3 179 186 22439432 Sulaiman L.K. Oladele O.A. Shittu I.A. Emikpe B.O. Oladokun A.T. Meseko C.A. In-ovo evaluation of the antiviral activity of methanolic root-bark extract of the African Baobab ( Adansonia digitata Afr. J. Biotechnol 2011 10 20 4256 4258 Wafaa A.H. Howaida I.A. Hassan A. El-Safty M.M. Chemical composition and ‘in vitro’ antiviral activity of Azadirachta indica Juss (Neem) leaves and fruits against Newcastle disease virus and infectious bursal disease virus. Aust. J. Basic Appl. Sci 2007 1 801 812 Waihenya R.K. Mtambo M.M.A. Nkwengulila G. Evaluation of the efficacy of the crude extract of Aloe secundiflora J. Ethnopharmacol 2002 79 3 299 304 11849832 10.1016/s0378-8741(01)00370-1 Wang L. Yang R. Yuan B. Liu Y. Liu C. The antiviral and antimicrobial activities of licorice, a widely-used Chinese herb Acta Pharm. Sin. B 2015 5 4 310 315 26579460 10.1016/j.apsb.2015.05.005 PMC4629407 Watanabe K. Takatsuki H. Sonoda M. Tamura S. Murakami N. Kobayashi N. Anti-influenza viral effects of novel nuclear export inhibitors from Valerianae Radix and Alpinia galanga Drug Discov. Therap 2011 5 1 26 31 22466093 10.5582/ddt.v5.1.26 WHO, World Health Organization Chapter 4 Public policies for the public›s health 2008 63 76 Wu S. Patel K.B. Booth L.J. Metcalf J.P. Lin H.K. Wu W. Protective essential oil attenuates influenza virus infection: an in vitro study in MDCK cells BMC Compl. Alter. Med 2010 10 1 13 10.1186/1472-6882-10-69 PMC2994788 21078173 Xiao S. Paldurai A. Nayak B. Mirande A. Collins P.L. Samal S.K. Complete genome sequence of a highly virulent Newcastle disease virus currently circulating in Mexico Gen. Announc 2013 1 1 10 1128 10.1128/genomeA.00177-12 PMC3569268 23409252 Yang J. Chen G. Li L.L. Pan W. Zhang F. Yang J. Wu S. Tien P. Synthesis and anti-H5N1 activity of chiral gossypol derivatives and its analogs implicated by a viral entry blocking mechanism Bioorgan. Med. Chem. Lett 2013 23 9 2619 2623 10.1016/j.bmcl.2013.02.101 23538114 Yasmin A.R. Chia S.L. Looi Q.H. Omar A.R. Noordin M.M. Ideris A. Florou-Paneri P. Christaki E. Giannenas I. Herbal extracts as antiviral agents In Feed additives 2020 Cambridge, MA Academic Press, Elsevier 115 132 https://doi:10.1016/B978-0-12-814700-9.00007-8 Yusoff K. Tan W.S. Newcastle disease virus: macromolecules and opportunities Avian Pathol 2001 30 5 439e455 19184932 10.1080/03079450120078626 Zhai L. Li Y. Wang W. Hu S. Enhancement of humoral immune responses to inactivated Newcastle disease and avian influenza vaccines by oral administration of ginseng stem-and-leaf saponins in chickens Poultry Sci 2011 90 9 1955 1959 21844260 10.3382/ps.2011-01433 ",
  "metadata": {
    "Title of this paper": "Enhancement of humoral immune responses to inactivated Newcastle disease and avian influenza vaccines by oral administration of ginseng stem-and-leaf saponins in chickens",
    "Journal it was published in:": "Open Veterinary Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483373/"
  }
}