{
  "title": "Paper_691",
  "abstract": "pmc Commun Biol Commun Biol 3495 commbiol Communications Biology 2399-3642 Nature Publishing Group PMC12475018 PMC12475018.1 12475018 12475018 41006773 10.1038/s42003-025-08769-3 8769 1 Article Mechanistic insights into alcohol-induced DNA crosslink repair by Slx4-Xpf-Ercc1 nuclease complex in the Fanconi anaemia pathway Havlikova Jana 1 2 http://orcid.org/0000-0002-8195-971X Dejmek Milan 1 Huskova Andrea 1 Allan Anthony 3 http://orcid.org/0000-0002-9652-4065 Boura Evzen 1 http://orcid.org/0000-0001-6167-0380 Nencka Radim 1 http://orcid.org/0000-0003-3868-5714 Silhan Jan silhan@uochb.cas.cz 1 1 https://ror.org/04nfjn472 grid.418892.e 0000 0001 2188 4245 Institute of Organic Chemistry and Biochemistry of the Czech Academy of Sciences, 2 https://ror.org/024d6js02 grid.4491.8 0000 0004 1937 116X Charles University, First Faculty of Medicine, 3 https://ror.org/024d6js02 grid.4491.8 0000 0004 1937 116X Charles University, Faculty of Science, 26 9 2025 2025 8 478257 1374 5 5 2025 21 8 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Alcohol is broken down in the body into acetaldehyde, a toxic chemical that can damage DNA by creating interstrand crosslinks (AA-ICL). These crosslinks block DNA replication and threaten the stability of the genome. A rare genetic disease, Fanconi anaemia (FA), is marked by extreme sensitivity to DNA crosslinking agents, including acetaldehyde. Although the Fanconi anaemia DNA repair pathway is known to fix this type of damage, exactly how it repairs acetaldehyde crosslinks is not yet understood. Here we show that the FA nuclease Slx4-Xpf-Ercc1 (SXE) plays a key role in the repair of AA-ICL. Using a DNA replication fork with site-specific AA-ICL, we show that SXE specifically excises this crosslink, highlighting its role in the repair of alcohol-induced DNA interstrand crosslinks. Moreover, SXE performs two precise incisions flanking the AA-ICL and can similarly repair a basic-site DNA interstrand crosslink. These results expand our understanding of how the FA pathway resolves alcohol-induced DNA damage. In addition, they suggest that SXE is a versatile nuclease complex and may be involved in repairing other types of crosslinks that may activate the FA pathway. The FA nuclease SXE (Slx4-Xpf-Ercc1) excises acetaldehyde-induced DNA interstrand crosslinks, making precise incisions to restore replication. Findings reveal SXE’s key role in FA pathway repair of alcohol- and abasic-site–linked DNA damage. Subject terms Enzyme mechanisms Cancer of unknown primary https://doi.org/10.13039/501100001824 Grantová Agentura České Republiky (Grant Agency of the Czech Republic) 24-12306S Silhan Jan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Ethanol, commonly referred to as alcohol, has been a widely consumed recreational substance for centuries. However, over the years, its use has been associated with adverse health effects. Extensive research has linked alcohol consumption to over 60 diseases, including liver damage, heart disease, neurodegenerative conditions and mental illnesses 1 2 3 Alcohol metabolism involves multiple enzymes, with the χ isoform of alcohol dehydrogenase primarily responsible for converting alcohol to acetaldehyde. The liver contains the highest concentration of enzymes involved in alcohol metabolism, including acetaldehyde dehydrogenase (ALDH1 & ALDH2), which plays a crucial role in detoxifying acetaldehyde into acetate (Fig. 1A 4 5 5 6 Fig. 1 Model of alcohol metabolism leading to acetaldehyde interstrand crosslink (AA-ICL). A B R N 2 C R Importantly, acetaldehyde can react with the C-2 amino group of deoxyguanosine (dG) in DNA, forming an N 2 7 N 2 8 9 1B 8 10 11 FA is a rare, predominantly autosomal recessive disease that results in bone marrow failure, developmental anomalies, and an increased risk of both haematologic and non-haematologic malignancies 10 12 13 16 When the replication machinery encounters a DNA crosslink during replication, it stalls. Due to the bidirectional nature of DNA replication, another replication machinery arrives and stalls on the opposite site. The DNA then adopts an X-shaped structure. Subsequently, ATR kinase is activated, recruiting various factors to facilitate the ICL repair 17 18 19 20 17 For ICLs induced by nitrogen mustard, the FA nuclease complex SLX4-XPF-ERCC1 (SXE) is responsible for their excision 21 Xenopus 21 The involvement of the FA pathway in the repair of alcohol-derived crosslink suggests an explanation for acetaldehyde toxicity in the FA-deficient cell lines 11 22 22 22 22 In subsequent work, we synthesised a site-specific alcohol-induced acetaldehyde ICL (AA-ICL). DNA repair experiments conducted in Xenopus 23 24 Here, we focus on unravelling the intricate molecular details surrounding AA-ICL and its subsequent repair by the SXE complex. Specifically, we synthesised a site-specific acetaldehyde crosslink (Fig. 1C Results Preparation of site-specific alcohol-induced interstrand crosslink The synthetic crosslink in this study is chemically identical to the alcohol-induced interstrand crosslink (AA-ICL) that forms in DNA following alcohol consumption. A synthetic single-stranded DNA oligonucleotide, modified at a specific site with the 2-InoF residue, was coupled with (4 R 4 2A Fig. 2 AA-ICL formation and stability rate. A B C D E Four different substrates generated from the original sequence were prepared to fully address the enzymatic cleavage of AA-ICL by SXE. These substrates contained an identical single-stranded DNA strand with the PdG residue prepared for crosslinking. The opposing strand was designed so the annealed oligonucleotide resembled a DNA replication fork in the shape of the letter Y. In each case, a fluorescent dye was placed at one end of the replication fork to monitor the reaction. Therefore, two 3′ and two 5′ labelled oligonucleotides were synthesised (Supplementary Fig. S1 Formation and stability of AA-ICL: the rate of formation of AA-ICL is relatively slow, but so is its degradation The formation of DNA crosslinks was observed in different oligonucleotides containing the naturally identical lesion PdG (Fig. 2A 2B, C 23 S2 After the crosslinking reaction, the AA-ICL was purified from the gel. To address the stability of AA-ICL, the purified crosslinked DNA was allowed to degrade over time at 37 °C. The reactions were analysed on a denaturing gel, similar to the method used for formation analysis. The half-time of two AA-ICLs was t 1/2 AA-ICL1 1/2 AA-ICL3 Nuclease complex SXE unhooks alcohol-derived DNA interstrand crosslink To elucidate the molecular mechanism by which the FA nuclease complex SXE repairs AA-ICL in enzymatic reactions, we utilised non-crosslinked and crosslinked DNA forks that only differ by the presence of site-specific AA-ICL and fluorescent probes in different locations of the fork. These substrates were fluorescently labelled on either the top (lagging) or bottom (leading) strand at the 5′ or 3′ end of the left-handed fork to track cleavage events (Supplementary Fig. S1 3A 4A Fig. 3 Dual cleavage by SXE suggests unhooking of AA-ICL. A AA-ICL1 AA-ICL2 B D Y1 AA-ICL1 1 2 1 2 AA-ICL1 C Y2 AA-ICL2 E D Fig. 4 Cleavage mechanism of AA-ICL (fluorescently labelled on the top strand) by SXE nuclease. A AA-ICL3 AA-ICL4 B 1 2 3 2 C 1 2 D 1 2 E 1 2 1 F n n 1 2 k AA-ICL3 k AA-ICL4 Fluorescent labelling of the bottom strand enabled us to visualise cleavage corresponding to this DNA strand. Qualitative reaction comparative products of cleavage of non-crosslinked and crosslinked substrates are displayed (Fig. 3B, C 3D 2D 3B, D 1 2 1 2 3B, D In contrast, the cleavage of AA-ICL2 (labelled at the 3′ end) was less efficient, with incomplete digestion of the crosslinked substrate, suggesting potential steric hindrance by the 3′ fluorophore (Fig. 3C S3 1 2 S3 3C 4E S4 S4C 21 SXE assays with AA-ICL on DNA substrate labelled on the top strand confirm dual incisions flanking the crosslink In parallel, we tested the cleavage pattern on the fluorescently labelled top strand of the fork with labels at both ends. Reactions using a non-crosslinked DNA fork with the 5′-end probe did not show any detectable activity of the SXE complex on the labelled strand of the substrate (Fig. 4B In contrast, cleavage of AA-ICL3 generated two distinct products, P 1 2 4B, C 1 2 Further investigation of the substrate labelled at the 3′ end (AA-ICL4) confirmed dual incisions by SXE. An identical pattern of bands corresponding to P 1 2 4D 1 2 4E 1 2 1 2 The kinetics of SXE cleavage of alcohol-derived acetaldehyde DNA interstrand crosslinks The gels with the time-course reaction for AA-ICL were quantified and the data of cleavage were plotted against time and fitted (Figs. 3E 4F k 0.10 0.02 min⁻¹ k 0.25 0.04 min⁻¹ 3E k 0.12 0.03 min⁻¹ k 0.05 0.08 min⁻¹ 3E SXE excises the abasic site interstrand crosslinks (Ap-ICLs), a substrate of Neil3 glycosylase SXE has been shown to cleave both AA-ICLs (this study) and nitrogen mustard ICLs 21 25 5A S1B Fig. 5 Comparison of cleavage mechanism of AA-ICL and Ap-ICL. A B 1 2 C D E 1 In SXE nuclease assays, we evaluated the cleavage of Y1, AA-ICL1, and Ap-ICL1 using our left-handed DNA fork substrates with the fluorescent probe at the 5′ end of the bottom strand (Fig. 5B 1 2 3 1 2 1 2 Mouse Neil3 enzyme responsible for Ap-ICL repair does not cleave AA-ICL Since the Ap-ICL is repaired by Neil3 glycosylase in an upstream step before employment of the FA pathway, and SXE can process Ap-ICL consistently with other ICL, we investigated how Neil3 processes AA-ICL. We employed the catalytic NEI domain from mouse Neil3, which is responsible for the enzymatic removal of Ap-ICL during replication-coupled repair 26 27 27 28 Unlike SXE, the NEI domain did not excise or revert the AA-ICL DNA fork substrate. However, the Ap-ICL-containing fork was cleaved as expected by the glycosylase activity, serving as an internal control to validate Neil3 activity under these assay conditions (summarised in Table 1 Table 1 Relative incision efficiencies of SXE versus NEIL3 Substrate/Enzyme SXE NEIL3 AA-ICL Ap-ICL Relative qualitative incision efficiency, based on gel band intensities and known enzymatic activity. Neil3 only cleaves Ap-ICLs when the abasic (Ap) site is adjacent to a single-stranded DNA region on its 3′-side. Overall, we have demonstrated that SXE can unhook DNA crosslinks, including those arising from alcohol consumption and acetaldehyde metabolism, a lesion known as AA-ICLs. These crosslinks are relatively stable and are efficiently excised by SXE through two distinct incisions within the DNA strand of replication fork mimetics, leaving the opposite strand intact. Importantly, we also show that SXE cleaves Ap-ICLs in a manner virtually identical to that of AA-ICLs, highlighting its ability to process a broad range of DNA crosslinks. Furthermore, our findings reinforce that SXE can also cleave other types of ICLs, such as those induced by nitrogen mustard, as previously shown 21 Discussion Alcohol consumption is a major risk factor for various cancers, yet the underlying molecular mechanisms linking alcohol to genomic instability remain poorly understood. Acetaldehyde, a toxic metabolite of alcohol, reacts with DNA and can ultimately lead to the formation of interstrand crosslinks (AA-ICLs), which covalently tether the two strands of the DNA double helix. These lesions are particularly problematic because of their persistence in the genome. Their slow hydrolytic degradation leaves them intact for prolonged periods. If not repaired, AA-ICLs can block essential cellular processes like transcription and replication. This disruption leads to DNA double-strand breaks, chromosomal instability, and, ultimately, oncogenesis. Understanding how cells deal with these lesions at the molecular level is important for elucidating possible mechanisms that link alcohol consumption to genomic instability 15 22 29 30 The number of AA-ICLs generated during alcohol consumption varies depending on factors such as alcohol intake, acetaldehyde detoxification efficiency, and genetic predispositions. Accurately quantifying these lesions remains challenging and strongly depends on the persistence of PdG (propano-deoxyguanosine), a mutagenic adduct 31 33 Although the in vitro formation of the PdG precursor is relatively inefficient, constituting less than 10% of the primary acetaldehyde adduct N2-ethylidene-dG, excessive acetaldehyde exposure increases the PdG formation rate to approximately 1 PdG per 1.3 × 10 8 34 9 35 Acetaldehyde typically binds to intracellular macromolecules by forming imines, or Schiff bases, these adducts are in dynamic equilibrium with their unreacted components and are prone to hydrolysis under physiological conditions 36 37 As previously demonstrated for nitrogen mustard ICLs, the SXE complex cleaves ICLs through a dual incision, making two precise cuts on one strand of the replication fork around the crosslink, not dissimilar to activity observed for XE alone 21 38 21 While the FA pathway and an unknown mechanism have been implicated in AA-ICL repair in Xenopus 23 Interestingly, the reaction rates of SXE-mediated incisions remain consistent regardless of the presence of a crosslink, suggesting that SXE primarily recognises forked DNA structures rather than the ICL itself. We speculate, that under in vivo conditions, additional factors, such as FA proteins and the X-structure of the replication fork, may influence SXE’s specificity and efficiency. The incisions observed in our study, in the context of the X-structure, would lead to the unhooking of the AA-ICL and the separation of DNA strands. This separation would allow the damaged strands to undergo subsequent repair steps via the FA pathway, a process critical for restoring replication, maintaining genomic stability, and ensuring proper cellular function. In our previous work, we have shown that AA-ICL repair occurs via two distinct mechanisms: the FA pathway and an as-yet-unknown mechanism 23 Xenopus Here, we also show that SXE cleaves the Ap-ICL and, therefore, is not specific to crosslinks but rather it cleaves around the damaged site, regardless of the nature or presence of the ICL 21 39 40 Neil3 is the primary enzyme responsible for repairing Ap-ICLs and similar lesions 26 27 41 43 38 26 27 Our in vitro findings demonstrate that SXE is capable of cleaving alcohol-derived AA-ICLs and Ap-ICLs in a comparable manner, suggesting a potential role as a versatile FA nuclease. However, further studies are needed to confirm its involvement in AA-ICL repair in cells. SXE can cleave a broad range of ICLs, including those induced by acetaldehyde, abasic sites, nitrogen mustard, and possibly others, establishing it as a powerful tool for ICL unhooking. Consequently, these findings raise the possibility that the FA repair pathway emerges as a universal mechanism capable of addressing various types of ICLs. Methods DNA oligonucleotides preparation All DNA oligonucleotides were synthesised commercially (Eurofins Genomics). The sequences of all DNA oligonucleotides and structures of annealed substrates are provided in the supplementary file (Supplementary Fig. S2 Synthesis of aminopentadiol The synthesis of (4 R 23 S R 3 3 S2 Preparation of AA-ICL on fluorescently labelled substrate The following procedure was performed according to our previous work 23 R 1C × S2 The modified DNA oligonucleotide (5’-ATGCCTGCACGAATTAACG*GATTCGTAATCATGGT3’), containing the ( R N 2 2A S2 Abasic interstrand crosslink formation and isolation Abasic interstrand crosslink (Ap-ICL) within the DNA duplex was prepared and isolated as described previously 44 45 Cloning, expression and purification of recombinant Slx4-Xpf-Ercc1 The mouse cDNA for Slx4 Ercc1 Xpf E. coli 6 co 6 v v S4 Cloning, expression, and purification of Neil3 Cloning, expression, and purification processes were described previously 27 4 600 Harvested cells were disrupted via sonication in a lysis buffer comprising 20 mM Tris-HCl (pH 8.0), 300 mM NaCl, 30 mM imidazole pH 8.0, 10% ( v v Protein was desalted using a HiPrep 26/10 desalting column, followed by fractionation via cation exchange chromatography on a HiTrap SP HP column. The buffer A mobile phase consisted of 20 mM Tris-Hcl pH 8.0, 70 mM NaCl, 10% ( v v Protein purity was verified by SDS-PAGE on a 15% polyacrylamide gel. The purified NEI domain was concentrated, flash-frozen in liquid nitrogen and stored at −80 °C. Kinetics of AA-ICL formation and stability The reaction mixture was incubated at 37 °C under near-physiological conditions (20 mM HEPES, pH 7.0; 150 mM NaCl) for several days. Periodic aliquots were taken for stability assays. Afterwards, DNA duplexes containing ICLs were purified by isolation from 15% denaturing PAGE gel. The isolated ICLs were diluted in substrate buffer and subjected to a stability assay at 37 °C the aliquots were taken at given timepoints. Subsequently, the aliquots were analysed using a 15% denaturing gel. Nuclease assay All reactions were carried out in a nuclease buffer (25 mM Tris pH 8.0, 50 mM NaCl, 2 mM MgCl 2 Glycosylase assay Enzymatic assays with the NEI domain and DNA substrates containing Ap-ICL or AA-ICL were performed in parallel with nuclease assays in Neil3 reaction buffer (20 mM Tris-HCl, pH 7.4, 75 mM NaCl, 5% glycerol, 0.1 mM TCEP). Enzyme and substrate were used at final concentrations of 20 nM and 40 nM, respectively. Reactions were initiated by mixing equal volumes of enzyme and substrate at 25 °C. At designated time points, aliquots were withdrawn and quenched with an equal volume of quenching buffer (80% formamide, 40 mM EDTA). Samples were resolved by 20% denaturing PAGE (20% acrylamide:bisacrylamide 19:1, 7 M urea, 1× TBE). The gels were evaluated identically to those with nuclease assay. Statistics and reproducibility All quantitative data were analysed using standard statistical methods as indicated in figure legends. Where applicable, means ± standard deviation (SD) are shown, while individual datapoints are provided in Supplementary Fig. S5 S6 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Description of Additional Supplementary Materials Supplementary Data Reporting Summary Transparent Peer Review file Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s42003-025-08769-3. Acknowledgements The work was supported by the Czech Science Foundation [24-12306S]; Institute of Organic Chemistry and Biochemistry; Academy of Sciences Czech Republic [RVO: 61388963]. Funding for open access charge: Academy of Sciences Czech Republic [24-12306S]. Author contributions J.H. and A.H. conducted experiments, analysed the data, and designed the figures. M.D. performed chemical synthesis with the aid from J.H. and A.A. E.B. and R.N. supervised their work. J.S., J.H. and A.H. wrote the manuscript. J.S. conceptualised and supervised the study and secured funding. Peer review Peer review information Communications Biology Data availability All data analyses are presented in the main text or supplementary materials and supplementary data. All source data underlying the graphs and charts presented in the main figures are presented as Supplementary Data (either as standalone graphs, excel tables or in text format). Competing interests The authors declare no competing interests. References 1. Hoes L Dok R Verstrepen KJ Nuyts S Ethanol-induced cell damage can result in the development of oral tumors Cancers 2021 13 3846 10.3390/cancers13153846 34359747 PMC8345464 Hoes, L., Dok, R., Verstrepen, K. J. & Nuyts, S. Ethanol-induced cell damage can result in the development of oral tumors. Cancers 13 34359747 10.3390/cancers13153846 PMC8345464 2. Shrestha AD Vedsted P Kallestrup P Neupane D Prevalence and incidence of oral cancer in low- and middle-income countries: a scoping review Eur. J. Cancer Care 2020 29 e13207 10.1111/ecc.13207 31820851 Shrestha, A. D., Vedsted, P., Kallestrup, P. & Neupane, D. Prevalence and incidence of oral cancer in low- and middle-income countries: a scoping review. Eur. J. Cancer Care 29 10.1111/ecc.13207 31820851 3. Rumgay H Global burden of cancer in 2020 attributable to alcohol consumption: a population-based study Lancet Oncol. 2021 22 1071 1080 10.1016/S1470-2045(21)00279-5 34270924 PMC8324483 Rumgay, H. et al. Global burden of cancer in 2020 attributable to alcohol consumption: a population-based study. Lancet Oncol. 22 34270924 10.1016/S1470-2045(21)00279-5 PMC8324483 4. Crabb DW Matsumoto M Chang D You M Overview of the role of alcohol dehydrogenase and aldehyde dehydrogenase and their variants in the genesis of alcohol-related pathology Proc. Nutr. Soc. 2004 63 49 63 10.1079/PNS2003327 15099407 Crabb, D. W., Matsumoto, M., Chang, D. & You, M. Overview of the role of alcohol dehydrogenase and aldehyde dehydrogenase and their variants in the genesis of alcohol-related pathology. Proc. Nutr. Soc. 63 15099407 10.1079/pns2003327 5. Matsuda T Yabushita H Kanaly RA Shibutani S Yokoyama A Increased DNA damage in ALDH2-deficient alcoholics Chem. Res. Toxicol. 2006 19 1374 1378 10.1021/tx060113h 17040107 Matsuda, T., Yabushita, H., Kanaly, R. A., Shibutani, S. & Yokoyama, A. Increased DNA damage in ALDH2-deficient alcoholics. Chem. Res. Toxicol. 19 17040107 10.1021/tx060113h 6. Zakhari S Overview: how is alcohol metabolized by the body? Alcohol Res. Health 2006 29 245 254 17718403 PMC6527027 Zakhari, S. Overview: how is alcohol metabolized by the body? Alcohol Res. Health 29 17718403 PMC6527027 7. Sonohara, Y. et al. Acetaldehyde forms covalent GG intrastrand crosslinks in DNA. Sci. Rep. 9 10.1038/s41598-018-37239-6 PMC6345987 30679737 8. Lopez-Martinez D Liang CC Cohn MA Cellular response to DNA interstrand crosslinks: the Fanconi anemia pathway Cell Mol. Life Sci. 2016 73 3097 3114 10.1007/s00018-016-2218-x 27094386 PMC4951507 Lopez-Martinez, D., Liang, C. C. & Cohn, M. A. Cellular response to DNA interstrand crosslinks: the Fanconi anemia pathway. Cell Mol. Life Sci. 73 27094386 10.1007/s00018-016-2218-x PMC4951507 9. Kuykendall JR Bogdanffy MS Formation and stability of acetaldehyde-induced crosslinks between poly-lysine and poly-deoxyguanosine Mutat. Res. 1994 311 49 56 10.1016/0027-5107(94)90072-8 7526174 Kuykendall, J. R. & Bogdanffy, M. S. Formation and stability of acetaldehyde-induced crosslinks between poly-lysine and poly-deoxyguanosine. Mutat. Res. 311 7526174 10.1016/0027-5107(94)90072-8 10. Alter BP Fanconi’s anemia and malignancies Am. J. Hematol. 1996 53 99 110 10.1002/(SICI)1096-8652(199610)53:2&#x0003c;99::AID-AJH7&#x0003e;3.0.CO;2-Z 8892734 Alter, B. P. Fanconi’s anemia and malignancies. Am. J. Hematol. 53 8892734 10.1002/(SICI)1096-8652(199610)53:2<99::AID-AJH7>3.0.CO;2-Z 11. Langevin F Crossan GP Rosado IV Arends MJ Patel KJ Fancd2 counteracts the toxic effects of naturally produced aldehydes in mice Nature 2011 475 53 58 10.1038/nature10192 21734703 Langevin, F., Crossan, G. P., Rosado, I. V., Arends, M. J. & Patel, K. J. Fancd2 counteracts the toxic effects of naturally produced aldehydes in mice. Nature 475 21734703 10.1038/nature10192 12. Rosenberg PS Greene MH Alter BP Cancer incidence in persons with Fanconi anemia Blood 2003 101 822 826 10.1182/blood-2002-05-1498 12393424 Rosenberg, P. S., Greene, M. H. & Alter, B. P. Cancer incidence in persons with Fanconi anemia. Blood 101 12393424 10.1182/blood-2002-05-1498 13. Knipscheer P The Fanconi anemia pathway promotes replication-dependent DNA interstrand cross-link repair Science 2009 326 1698 1701 10.1126/science.1182372 19965384 PMC2909596 Knipscheer, P. et al. The Fanconi anemia pathway promotes replication-dependent DNA interstrand cross-link repair. Science 326 19965384 10.1126/science.1182372 PMC2909596 14. Andreassen PR Ren K Fanconi anemia proteins, DNA interstrand crosslink repair pathways, and cancer therapy Curr. Cancer Drug Targets 2009 9 101 117 10.2174/156800909787314011 19200054 PMC4934657 Andreassen, P. R. & Ren, K. Fanconi anemia proteins, DNA interstrand crosslink repair pathways, and cancer therapy. Curr. Cancer Drug Targets 9 19200054 10.2174/156800909787314011 PMC4934657 15. Kim H D’Andrea AD Regulation of DNA cross-link repair by the Fanconi anemia/BRCA pathway Genes Dev. 2012 26 1393 1408 10.1101/gad.195248.112 22751496 PMC3403008 Kim, H. & D’Andrea, A. D. Regulation of DNA cross-link repair by the Fanconi anemia/BRCA pathway. Genes Dev. 26 22751496 10.1101/gad.195248.112 PMC3403008 16. Kottemann MC Smogorzewska A Fanconi anaemia and the repair of Watson and Crick DNA crosslinks Nature 2013 493 356 363 10.1038/nature11863 23325218 PMC3700363 Kottemann, M. C. & Smogorzewska, A. Fanconi anaemia and the repair of Watson and Crick DNA crosslinks. Nature 493 23325218 10.1038/nature11863 PMC3700363 17. Zhang J DNA interstrand cross-link repair requires replication-fork convergence Nat. Struct. Mol. Biol. 2015 22 242 247 10.1038/nsmb.2956 25643322 PMC4351167 Zhang, J. et al. DNA interstrand cross-link repair requires replication-fork convergence. Nat. Struct. Mol. Biol. 22 25643322 10.1038/nsmb.2956 PMC4351167 18. Mutreja K ATR-mediated global fork slowing and reversal assist fork traverse and prevent chromosomal breakage at DNA interstrand cross-links Cell Rep. 2018 24 2629 2642.e2625 10.1016/j.celrep.2018.08.019 30184498 PMC6137818 Mutreja, K. et al. ATR-mediated global fork slowing and reversal assist fork traverse and prevent chromosomal breakage at DNA interstrand cross-links. Cell Rep. 24 30184498 10.1016/j.celrep.2018.08.019 PMC6137818 19. Wang W Emergence of a DNA-damage response network consisting of Fanconi anaemia and BRCA proteins Nat. Rev. Genet. 2007 8 735 748 10.1038/nrg2159 17768402 Wang, W. Emergence of a DNA-damage response network consisting of Fanconi anaemia and BRCA proteins. Nat. Rev. Genet. 8 17768402 10.1038/nrg2159 20. Vandenberg CJ BRCA1-independent ubiquitination of FANCD2 Mol. Cell 2003 12 247 254 10.1016/S1097-2765(03)00281-8 12887909 Vandenberg, C. J. et al. BRCA1-independent ubiquitination of FANCD2. Mol. Cell 12 12887909 10.1016/s1097-2765(03)00281-8 21. Hodskinson MR Mouse SLX4 is a tumor suppressor that stimulates the activity of the nuclease XPF-ERCC1 in DNA crosslink repair Mol. Cell 2014 54 472 484 10.1016/j.molcel.2014.03.014 24726326 PMC4017094 Hodskinson, M. R. et al. Mouse SLX4 is a tumor suppressor that stimulates the activity of the nuclease XPF-ERCC1 in DNA crosslink repair. Mol. Cell 54 24726326 10.1016/j.molcel.2014.03.014 PMC4017094 22. Garaycoechea JI Genotoxic consequences of endogenous aldehydes on mouse haematopoietic stem cell function Nature 2012 489 571 575 10.1038/nature11368 22922648 Garaycoechea, J. I. et al. Genotoxic consequences of endogenous aldehydes on mouse haematopoietic stem cell function. Nature 489 22922648 10.1038/nature11368 23. Hodskinson MR Alcohol-derived DNA crosslinks are repaired by two distinct mechanisms Nature 2020 579 603 608 10.1038/s41586-020-2059-5 32132710 PMC7116288 Hodskinson, M. R. et al. Alcohol-derived DNA crosslinks are repaired by two distinct mechanisms. Nature 579 32132710 10.1038/s41586-020-2059-5 PMC7116288 24. Morton SB Efficient synthesis of DNA duplexes containing reduced acetaldehyde interstrand cross-links J. Am. Chem. Soc. 2023 145 953 959 10.1021/jacs.2c10070 36584283 PMC9853853 Morton, S. B. et al. Efficient synthesis of DNA duplexes containing reduced acetaldehyde interstrand cross-links. J. Am. Chem. Soc. 145 36584283 10.1021/jacs.2c10070 PMC9853853 25. Johnson KM On the formation and properties of interstrand DNA–DNA cross-links forged by reaction of an abasic site with the opposing guanine residue of 5′-CAp sequences in duplex DNA J. Am. Chem. Soc. 2013 135 1015 1025 10.1021/ja308119q 23215239 PMC4012394 Johnson, K. M. et al. On the formation and properties of interstrand DNA–DNA cross-links forged by reaction of an abasic site with the opposing guanine residue of 5′-CAp sequences in duplex DNA. J. Am. Chem. Soc. 135 23215239 10.1021/ja308119q PMC4012394 26. Semlow DR Zhang J Budzowska M Drohat AC Walter JC Replication-dependent unhooking of DNA interstrand cross-links by the NEIL3 glycosylase Cell 2016 167 498 511.e414 10.1016/j.cell.2016.09.008 27693351 PMC5237264 Semlow, D. R., Zhang, J., Budzowska, M., Drohat, A. C. & Walter, J. C. Replication-dependent unhooking of DNA interstrand cross-links by the NEIL3 glycosylase. Cell 167 27693351 10.1016/j.cell.2016.09.008 PMC5237264 27. Huskova A Model of abasic site DNA cross-link repair; from the architecture of NEIL3 DNA binding domains to the X-structure model Nucleic Acids Res. 2022 50 10436 10448 10.1093/nar/gkac793 36155818 PMC9561275 Huskova, A. et al. Model of abasic site DNA cross-link repair; from the architecture of NEIL3 DNA binding domains to the X-structure model. Nucleic Acids Res. 50 36155818 10.1093/nar/gkac793 PMC9561275 28. Imani Nejad M Unhooking of an interstrand cross-link at DNA fork structures by the DNA glycosylase NEIL3 DNA Repair 2020 86 102752 10.1016/j.dnarep.2019.102752 31923807 PMC7027961 Imani Nejad, M. et al. Unhooking of an interstrand cross-link at DNA fork structures by the DNA glycosylase NEIL3. DNA Repair 86 31923807 10.1016/j.dnarep.2019.102752 PMC7027961 29. Mizumoto, A. et al. Molecular mechanisms of acetaldehyde-mediated carcinogenesis in squamous epithelium. Int. J. Mol. Sci. 18 10.3390/ijms18091943 PMC5618592 28891965 30. Garaycoechea JI Alcohol and endogenous aldehydes damage chromosomes and mutate stem cells Nature 2018 553 171 177 10.1038/nature25154 29323295 PMC6047743 Garaycoechea, J. I. et al. Alcohol and endogenous aldehydes damage chromosomes and mutate stem cells. Nature 553 29323295 10.1038/nature25154 PMC6047743 31. Brooks PJ Theruvathu JA DNA adducts from acetaldehyde: implications for alcohol-related carcinogenesis Alcohol 2005 35 187 193 10.1016/j.alcohol.2005.03.009 16054980 Brooks, P. J. & Theruvathu, J. A. DNA adducts from acetaldehyde: implications for alcohol-related carcinogenesis. Alcohol 35 16054980 10.1016/j.alcohol.2005.03.009 32. Fernandes PH Kanuri M Nechev LV Harris TM Lloyd RS Mammalian cell mutagenesis of the DNA adducts of vinyl chloride and crotonaldehyde Environ. Mol. Mutagen 2005 45 455 459 10.1002/em.20117 15690339 Fernandes, P. H., Kanuri, M., Nechev, L. V., Harris, T. M. & Lloyd, R. S. Mammalian cell mutagenesis of the DNA adducts of vinyl chloride and crotonaldehyde. Environ. Mol. Mutagen 45 15690339 10.1002/em.20117 33. Hashim MF Schnetz-Boutaud N Marnett LJ Replication of template-primers containing propanodeoxyguanosine by DNA polymerase beta. Induction of base pair substitution and frameshift mutations by template slippage and deoxynucleoside triphosphate stabilization J. Biol. Chem. 1997 272 20205 20212 10.1074/jbc.272.32.20205 9242698 Hashim, M. F., Schnetz-Boutaud, N. & Marnett, L. J. Replication of template-primers containing propanodeoxyguanosine by DNA polymerase beta. Induction of base pair substitution and frameshift mutations by template slippage and deoxynucleoside triphosphate stabilization. J. Biol. Chem. 272 9242698 10.1074/jbc.272.32.20205 34. Wang M Identification of DNA adducts of acetaldehyde Chem. Res. Toxicol. 2000 13 1149 1157 10.1021/tx000118t 11087437 Wang, M. et al. Identification of DNA adducts of acetaldehyde. Chem. Res. Toxicol. 13 11087437 10.1021/tx000118t 35. Theruvathu JA Jaruga P Nath RG Dizdaroglu M Brooks PJ Polyamines stimulate the formation of mutagenic 1,N2-propanodeoxyguanosine adducts from acetaldehyde Nucleic Acids Res. 2005 33 3513 3520 10.1093/nar/gki661 15972793 PMC1156964 Theruvathu, J. A., Jaruga, P., Nath, R. G., Dizdaroglu, M. & Brooks, P. J. Polyamines stimulate the formation of mutagenic 1,N2-propanodeoxyguanosine adducts from acetaldehyde. Nucleic Acids Res. 33 15972793 10.1093/nar/gki661 PMC1156964 36. Vaca CE Fang JL Schweda EK Studies of the reaction of acetaldehyde with deoxynucleosides Chem. Biol. Interact. 1995 98 51 67 10.1016/0009-2797(95)03632-V 7586051 Vaca, C. E., Fang, J. L. & Schweda, E. K. Studies of the reaction of acetaldehyde with deoxynucleosides. Chem. Biol. Interact. 98 7586051 10.1016/0009-2797(95)03632-v 37. Kozekov ID DNA interchain cross-links formed by acrolein and crotonaldehyde J. Am. Chem. Soc. 2003 125 50 61 10.1021/ja020778f 12515506 Kozekov, I. D. et al. DNA interchain cross-links formed by acrolein and crotonaldehyde. J. Am. Chem. Soc. 125 12515506 10.1021/ja020778f 38. Kuraoka I Repair of an interstrand DNA cross-link initiated by ERCC1-XPF repair/recombination nuclease J. Biol. Chem. 2000 275 26632 26636 10.1074/jbc.C000337200 10882712 Kuraoka, I. et al. Repair of an interstrand DNA cross-link initiated by ERCC1-XPF repair/recombination nuclease. J. Biol. Chem. 275 10882712 10.1074/jbc.C000337200 39. Umansky C Endogenous formaldehyde scavenges cellular glutathione resulting in redox disruption and cytotoxicity Nat. Commun. 2022 13 745 10.1038/s41467-022-28242-7 35136057 PMC8827065 Umansky, C. et al. Endogenous formaldehyde scavenges cellular glutathione resulting in redox disruption and cytotoxicity. Nat. Commun. 13 35136057 10.1038/s41467-022-28242-7 PMC8827065 40. Zhang K Chew M Yang EB Wong KP Mack P Modulation of cisplatin cytotoxicity and cisplatin-induced DNA cross-links in HepG2 cells by regulation of glutathione-related mechanisms Mol. Pharm. 2001 59 837 843 10.1124/mol.59.4.837 11259628 Zhang, K., Chew, M., Yang, E. B., Wong, K. P. & Mack, P. Modulation of cisplatin cytotoxicity and cisplatin-induced DNA cross-links in HepG2 cells by regulation of glutathione-related mechanisms. Mol. Pharm. 59 10.1124/mol.59.4.837 11259628 41. Long DavidT Joukov V Budzowska M Walter JohannesC BRCA1 promotes unloading of the CMG helicase from a stalled DNA replication fork Mol. Cell 2014 56 174 185 10.1016/j.molcel.2014.08.012 25219499 PMC4185004 Long, D. avidT., Joukov, V., Budzowska, M. & Walter, J. ohannesC. BRCA1 promotes unloading of the CMG helicase from a stalled DNA replication fork. Mol. Cell 56 25219499 10.1016/j.molcel.2014.08.012 PMC4185004 42. Semlow DR Walter JC Mechanisms of vertebrate DNA interstrand cross-link repair Annu. Rev. Biochem. 2021 90 107 135 10.1146/annurev-biochem-080320-112510 33882259 Semlow, D. R. & Walter, J. C. Mechanisms of vertebrate DNA interstrand cross-link repair. Annu. Rev. Biochem. 90 33882259 10.1146/annurev-biochem-080320-112510 43. Wu RA TRAIP is a master regulator of DNA interstrand crosslink repair Nature 2019 567 267 272 10.1038/s41586-019-1002-0 30842657 PMC6417926 Wu, R. A. et al. TRAIP is a master regulator of DNA interstrand crosslink repair. Nature 567 30842657 10.1038/s41586-019-1002-0 PMC6417926 44. Huskova A Landova B Boura E Silhan J The rate of formation and stability of abasic site interstrand crosslinks in the DNA duplex DNA Repair 2022 113 103300 10.1016/j.dnarep.2022.103300 35255312 Huskova, A., Landova, B., Boura, E. & Silhan, J. The rate of formation and stability of abasic site interstrand crosslinks in the DNA duplex. DNA Repair 113 35255312 10.1016/j.dnarep.2022.103300 45. Chen Z Ruffner DE Modified crush-and-soak method for recovering oligodeoxynucleotides from polyacrylamide gel Biotechniques 1996 21 820 822 10.2144/96215bm14 8922620 Chen, Z. & Ruffner, D. E. Modified crush-and-soak method for recovering oligodeoxynucleotides from polyacrylamide gel. Biotechniques 21 8922620 10.2144/96215bm14 ",
  "metadata": {
    "Title of this paper": "Modified crush-and-soak method for recovering oligodeoxynucleotides from polyacrylamide gel",
    "Journal it was published in:": "Communications Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475018/"
  }
}