{
  "title": "Paper_756",
  "abstract": "pmc Plants (Basel) Plants (Basel) 2909 plants plants Plants 2223-7747 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473711 PMC12473711.1 12473711 12473711 41012076 10.3390/plants14182924 plants-14-02924 1 Article Anti-Inflammatory and Antifungal Activities of Wood Essential Oil from Juniperus morrisonicola https://orcid.org/0000-0002-2777-3877 Tsao Nai-Wen Writing – original draft Investigation Formal analysis 1 Chien Shih-Chang Conceptualization Validation 2 Tseng Yen-Hsueh Investigation 3 https://orcid.org/0000-0002-8579-3569 Wang Sheng-Yang Writing – review & editing Resources Methodology Supervision 1 4 5 * Brophy Joe Academic Editor 1 qmotkd@smail.nchu.edu.tw 2 3 4 5 * taiwanfir@dragon.nchu.edu.tw 20 9 2025 9 2025 14 18 497669 2924 22 8 2025 15 9 2025 18 9 2025 20 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ This study presents the first comprehensive analysis of the wood essential oil from Juniperus morrisonicola 50 50 50 Laetiporus sulphureus Juniperus morrisonicola essential oil sesquiterpenoids cedrol widdrol thujopsene anti-inflammatory cytotoxicity antifungal activity This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Juniperus morrisonicola Wood essential oils from Juniperus Juniperus oxycedrus δ cis α 1 2 Juniperus virginiana Juniperus occidentalis Juniperus ashei 3 Juniperus E. coli S. aureus 4 5 Juniperus deppeana 6 These findings highlight the pharmaceutical, cosmetic, and industrial relevance of Juniperus Despite extensive research on essential oils from various Juniperus J. morrisonicola J. morrisonicola 2. Results and Discussion 2.1. Chemical Composition of the Essential Oil The chemical composition of the essential oil extracted from J. morrisonicola Figure 1 Table 1 α α β α β Compared to wood essential oils from other Juniperus Juniperus communis Juniperus chinensis α 7 8 Juniperus thurifera 9 Juniperus foetidissima 10 Juniperus The major constituents—cedrol, a tricyclic sesquiterpenoid, and widdrol, a bicyclic sesquiterpenoid with a distinct 6-7 ring system—are known for their diverse biological activities. Cedrol has been reported to exhibit a broad spectrum of pharmacological effects, including anti-inflammatory [ 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 29 2.2. Anti-Inflammatory Activity of Jm-EO The anti-inflammatory activity of Jm-EO was assessed by measuring its inhibition of NO production in LPS-stimulated RAW 264.7 macrophage cells ( Figure 2 Jm-EO maintained high cell viability (>90%) at concentrations up to 20 μg/mL ( Figure 2 Jm-EO demonstrated a dose-dependent NO inhibition in activated macrophages ( Figure 2 50 This observed activity is likely attributable to major constituents of cedrol (22.87%), widdrol (20.82%), and thujopsene (12.26%), which together account for over 55% of the oil ( Table 1 32 J. morrisonicola 2.3. Anti-Inflammatory Activity of Major Components After evaluating the whole essential oil, the anti-inflammatory potential of its three major components—cedrol, widdrol, and thujopsene—was further investigated. Their cytotoxicity and inhibitory effects on NO production were assessed in RAW 264.7 cells across a concentration range of 5–100 μM ( Figure 3 The cytotoxicity profiles of the three compounds varied distinctly ( Figure 3 As shown in Figure 3 50 50 50 50 The differences in anti-inflammatory potency among these compounds may be attributed to their structural characteristics. Notably, widdrol—characterized by a bicyclic sesquiterpenoid framework with a distinct 6-7 fused ring system—exhibited the strongest activity (lowest IC 50 These results indicate that the anti-inflammatory activity of Jm-EO likely arises from the combined or synergistic effects of its major components, with widdrol appearing to be a particularly significant contributor. Based on both its high abundance in the essential oil (20.82%, Table 1 50 These findings suggest that the anti-inflammatory activity of Jm-EO likely results from the combined or synergistic effects of its major constituents, with widdrol emerging as a particularly significant contributor. Given its high abundance in the essential oil (20.82%, Table 1 50 2.4. Cytotoxic Effects of Jm-EO on HepG2 Cells The cytotoxic effects of Jm-EO on HepG2 human hepatocellular carcinoma cells are shown in Figure 4 As anticipated, plumbagin showed strong cytotoxicity: 1 μM decreased cell viability to 84% (24 h) and 66% (48 h), while 2 μM reduced viability to 10% and 5%, respectively. Based on these results, the IC 50 The observed cytotoxicity of Jm-EO may be largely attributed to its major sesquiterpenoid constituents, including cedrol, widdrol, and thujopsene. These compounds have been previously reported to exert anticancer effects through mechanisms such as induction of apoptosis, cell cycle arrest, and modulation of critical cellular signaling pathways [ 13 14 15 16 28 2.5. Antifungal Activity of Jm-EO Table 2 Fomitopsis pinicola Trametes versicolor Lenzites betulina Laetiporus sulphureus F. pinicola L. sulphureus T. versicolor L. betulina Remarkably, Jm-EO completely inhibited the growth of L. sulphureus F. pinicola L. betulina T. versicolor The observed differences in fungal susceptibility suggest potential species-specific modes of action. The strong inhibitory effect against L. sulphureus 18 These findings highlight Jm-EO as a promising natural antifungal agent, particularly for wood preservation against L. sulphureus This study focused on evaluating the whole essential oil to establish its overall antifungal potential, given that synergistic interactions among components often contribute to bioactivity in natural products. While this approach provides practical insights for direct application, examination of individual compounds based on literature evidence offers important mechanistic insights. Among the major constituents identified, cedrol (22.87%) has well-documented antifungal properties, with previous studies demonstrating its ability to induce apoptosis in fungal cells through ROS generation [ 15 33 34 35 3. Materials and Methods 3.1. Plant Material In 2017, wood of J. morrisonicola 3.2. Essential Oil Extraction and GC-MS Analysis The essential oil from J. morrisonicola J. morrisonicola n 3.3. Cell Culture RAW 264.7 murine macrophage cells and HepG2 human hepatocellular carcinoma cells were obtained from the Bioresource Collection and Research Center (BCRC, Hsinchu, Taiwan). RAW 264.7 cells were cultured in Dulbecco’s Modified Eagle’s Medium (DMEM) supplemented with 10% fetal bovine serum (FBS), 1 mM sodium pyruvate, 1% glutamax, and 1% penicillin–streptomycin. HepG2 cells were maintained in DMEM supplemented with 10% FBS and 1% penicillin–streptomycin. Cells were incubated at 37 °C in a humidified 5% CO 2 3.4. Anti-Inflammatory Activity Assay The anti-inflammatory activity was assessed by measuring inhibition of nitric oxide (NO) production in lipopolysaccharide (LPS)-stimulated RAW 264.7 cells following the established protocols for essential oil bioactivity evaluation [ 36 2 5 NO inhibition (%) = (1 − (sample induced OD 540 540 540 540 3.5. Cytotoxicity Assay Cytotoxicity was evaluated using the MTT assay on RAW 264.7 macrophages and HepG2 hepatocellular carcinoma cells according to previously described methods for natural compound testing, with minor modifications for Jm-EO [ 36 37 5 4 3.6. Antifungal Activity Assay The antifungal activity of Jm-EO was evaluated against four wood-decay fungi: Fomitopsis pinicola Trametes versicolor Lenzites betulina Laetiporus sulphureus 38 Antifungal index (%) = (1 − Da/Db) × 100 3.7. Statistical Analysis All experiments were performed in triplicate, and results are expressed as mean ± standard deviation (SD). Statistical analyses were conducted using GraphPad Prism 10.0 (GraphPad Software, San Diego, CA, USA). 4. Conclusions This study investigated the chemical composition and biological activities of Jm-EO. GC-MS analysis revealed a unique chemical profile characterized by a high abundance of specific sesquiterpenoids, including cedrol (22.87%), widdrol (20.82%), and thujopsene (12.26%), which together constituted over 55% of the total essential oil composition, in contrast to other Juniperus 50 50 50 50 50 L. sulphureus These findings highlight the potential of Jm-EO as a source of bioactive compounds with practical applications. The diverse biological activities of Jm-EO, including its anti-inflammatory, cytotoxic, and antifungal properties, can be attributed to its major sesquiterpenoid components. Future research should focus on elucidating these compounds’ precise mechanisms of action, particularly widdrol, and exploring their potential development as pharmaceutical agents or natural preservatives. This study contributes valuable information to understanding Jm-EO and opens new avenues for its use in medicinal and wood preservation industry applications. Further research should investigate the specific molecular mechanisms of widdrol’s anti-inflammatory action and explore in vivo models to validate these findings. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, N.-W.T. and S.-Y.W.; methodology, N.-W.T. and S.-C.C.; formal analysis, N.-W.T.; investigation, N.-W.T.; resources, Y.-H.T.; writing—original draft preparation, N.-W.T.; writing—review and editing, S.-Y.W.; visualization, N.-W.T.; supervision, S.-C.C.; funding acquisition, S.-Y.W. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: Jm-EO J. morrisonicola GC-MS Gas chromatography–mass spectrometry KI Kovats index DMEM Dulbecco’s Modified Eagle’s Medium FBS Fetal bovine serum NO Nitric oxide LPS Lipopolysaccharide PDA Potato dextrose agar IC 50 The half-maximal inhibitory concentration References 1. Loizzo M.R. Tundis R. Conforti F. Saab A.M. Statti G.A. Menichini F. Comparative chemical composition, antioxidant and hypoglycaemic activities of Juniperus oxycedrus oxycedrus Food Chem. 2007 105 572 578 10.1016/j.foodchem.2007.04.015 2. Saab A.M. Gali-Muhtasib H. Maietti S. Grandini A. Rossi D. Lampronti I. Gallerani E. Fabbri E. Gambari R. Comparative antiproliferative activities of wood and seeds essential oils of Juniperus oxycedrus J. Essent. Oil Res. 2014 26 301 307 10.1080/10412905.2013.829006 3. Tumen I. Süntar I. Eller F.J. Keleş H. Akkol E.K. Topical wound-healing effects and phytochemical composition of heartwood essential oils of Juniperus virginiana Juniperus occidentalis Juniperus ashei J. Med. Food 2013 16 48 55 10.1089/jmf.2012.2472 23297713 4. Darwish R.S. Hammoda H.M. Ghareeb D.A. Abdelhamid A.S.A. Bellah El Naggar E.M. Harraz F.M. Shawky E. Efficacy-directed discrimination of the essential oils of three Juniperus species J. Ethnopharmacol. 2020 259 112971 10.1016/j.jep.2020.112971 32439404 5. Fotiadou E. Panou E. Graikou K. Sakellarakis F.N. Chinou I. Volatiles of all native Juniperus Foods 2023 12 3506 10.3390/foods12183506 37761215 PMC10530231 6. Bampidis V. Azimonti G. Bastos M.D. Christensen H. Durjava M. Kouba M. López-Alonso M. Puente S.L. Marcon F. Mayo B. Safety and efficacy of a feed additive consisting of an essential oil obtained from the wood of Juniperus deppeana EFSA J. 2024 22 e8799 10.2903/j.efsa.2024.8799 38756350 PMC11096998 7. Gonny M. Cavaleiro C. Salgueiro L. Casanova J. Analysis of Juniperus communis alpina 13 Flavour Fragr. J. 2006 21 99 106 10.1002/ffj.1527 8. Raina V.K. Srivastava S.K. Syamsundar K.V. Essential oil composition of Juniperus chinensis Flavour Frag. J. 2005 20 57 59 10.1002/ffj.1366 9. Barrero A.F. del Moral L.F.Q. Lara A. Herrador M.M. Antimicrobial activity of sesquiterpenes from the essential oil of Juniperus thurifera Planta Med. 2005 71 67 71 10.1055/s-2005-837753 15678376 10. Tunalier Z. Kirimer N. Başer K.H.C. Wood essential oils of Juniperus foeticissima Holzforschung 2003 57 140 144 10.1515/HF.2003.022 11. Bi Y. Xie Z. Cao X. Ni H. Xia S. Bao X. Huang Q. Xu Y. Zhang Q. Cedrol attenuates acute ischemic injury through inhibition of microglia-associated neuroinflammation via ERβ-NF-κB signaling pathways Brain Res. Bull. 2024 218 111102 10.1016/j.brainresbull.2024.111102 39414157 12. Zhang Y.M. Shen J. Zhao J.M. Guan J. Wei X.R. Miao D.Y. Li W. Xie Y.C. Zhao Y.Q. Cedrol from ginger ameliorates rheumatoid arthritis via reducing inflammation and selectively inhibiting JAK3 phosphorylation J. Agric. Food Chem. 2021 69 5332 5343 10.1021/acs.jafc.1c00284 33908779 13. Yu D. Yan J.J. Cedrol induces apoptosis of oral squamous cell carcinoma cell Curr. Top. Nutraceutical Res. 2022 20 328 333 10.37290/ctnr2641-452X.20:328-333 14. Chien J.H. Chang K.F. Lee S.C. Lee C.J. Chen Y.T. Lai H.C. Lu Y.C. Tsai N.M. Cedrol restricts the growth of colorectal cancer in vitro and in vivo by inducing cell cycle arrest and caspase-dependent apoptotic cell death Int. J. Med. Sci. 2022 19 1953 1964 10.7150/ijms.77719 36438926 PMC9682504 15. Yun H.J. Jeoung D.J. Jin S. Park J.H. Lee E.W. Lee H.T. Choi Y.H. Kim B.W. Kwon H.J. Induction of cell cycle arrest, apoptosis, and reducing the expression of MCM proteins in human lung carcinoma A549 cells by cedrol, isolated from Juniperus chinensis J. Microbiol. Biotechnol. 2022 32 918 926 10.4014/jmb.2205.05012 35880481 PMC9628924 16. Mishra S.K. Bae Y.S. Lee Y.M. Kim J.S. Oh S.H. Kim H.M. Sesquiterpene alcohol cedrol chemosensitizes human cancer cells and suppresses cell proliferation by destabilizing plasma membrane lipid rafts Front. Cell Dev. Biol. 2021 8 571676 10.3389/fcell.2020.571676 33585438 PMC7874189 17. Zhao Y.H. Li M.J. Guo J.Y. Fang J.J. Geng R.X. Wang Y.A. Liu T.T. Kang S.G. Huang K.L. Tong T. Cedrol, a major component of cedarwood oil, ameliorates high-fat diet-induced obesity in mice Mol. Nutr. Food Res. 2023 67 2200665 10.1002/mnfr.202200665 37143286 18. Hsiao W.W. Lau K.M. Chien S.C. Chu F.H. Chung W.H. Wang S.Y. Antifungal activity of cedrol from Cunninghamia lanceolate konishii Phellinus noxius Plants 2024 13 321 10.3390/plants13020321 38276778 PMC10821468 19. Jin K.S. Lee J.Y. Hyun S.K. Kim B.W. Kwon H.J. Juniperus chinensis Food Sci/Biotechnol/ 2015 24 611 618 10.1007/s10068-015-0080-5 20. Hu X.H. Han M. Liu J. Li F. Cui Y.C. Ameliorative effect of natural sesquiterpene alcohol cedrol against cerebral ischemia infarction-in vitro and in vivo studies Appl. Biochem. Biotechnol. 2024 196 8026 8042 10.1007/s12010-024-04965-9 38668841 21. Asgharzade S. Ahmadzadeh A.M. Pourbagher-Shahri A.M. Forouzanfar F. Protective effects of cedrol against transient global cerebral ischemia/reperfusion injury in rat BMC Complement. Med. Ther. 2025 25 83 10.1186/s12906-025-04827-9 40012040 PMC11863418 22. Sakhaee M.H. Sayyadi S.A.H. Sakhaee N. Sadeghnia H.R. Hosseinzadeh H. Nourbakhsh F. Forouzanfar F. Cedrol protects against chronic constriction injury-induced neuropathic pain through inhibiting oxidative stress and inflammation Metab. Brain Dis. 2020 35 1119 1126 10.1007/s11011-020-00581-8 32472224 23. Farimani F.D. Hosseini M. Amirahmadi S. Akbarian M. Shirazinia M. Barabady M. Rajabian A. Cedrol supplementation ameliorates memory deficits by regulating neuro-inflammation and cholinergic function in lipopolysaccharide—Induced cognitive impairment in rats Heliyon 2024 10 e30356 10.1016/j.heliyon.2024.e30356 38707398 PMC11068808 24. Li T. Zhang G.M. Zhou X.Y. Guan J. Zhao W.J. Zheng Y.F. Lee J.J. Wang P. Zhao Y.Q. Cedrol in ginger ( Zingiber officinale Bioorg. Chem. 2024 151 107709 10.1016/j.bioorg.2024.107709 39137599 25. Zhou Y.J. Jia L. Zhang G.S. Chen G. Zhou D. Shi X.B. Fu Q. Li N. Cedrol-loaded dissolvable microneedles based on flexible backing for promoting hair growth Expert Opin. Drug Deliv. 2023 20 1267 1276 10.1080/17425247.2023.2244413 37553988 26. Deng Y.L. Huang F.X. Wang J.W. Zhang Y.M. Zhang Y. Su G.Y. Zhao Y.Q. Hair growth promoting activity of cedrol nanoemulsion in C57BL/6 mice and its bioavailability Molecules 2021 26 1795 10.3390/molecules26061795 33806773 PMC8004917 27. Xu M.R. Lin C.H. Wang C.H. Wang S.Y. Investigate the metabolic changes in intestinal diseases by employing a 1 Biofactors 2025 51 e2132 10.1002/biof.2132 39415440 28. Kang M.R. Park S.K. Lee C.W. Choi I.J. Jo Y.N. Yang J.W. Kim J.A. Yun J. Lee K.H. Kwon H.J. Widdrol induces apoptosis via activation of AMP-activated protein kinase in colon cancer cells Oncol. Rep. 2012 27 1407 1412 10.3892/or.2012.1644 22266984 29. Jeong H.Y. Yun H.J. Kim B.W. Lee E.W. Kwon H.J. Widdrol-induced lipolysis is mediated by PKC and MEK/ERK in 3T3-L1 adipocytes Mol. Cell Biochem. 2015 410 247 254 10.1007/s11010-015-2558-0 26359088 30. Jin S. Yun H.J. Jeong H.Y. Oh Y.N. Park H.J. Yun S.G. Kim B.W. Kwon H.J. Widdrol, a sesquiterpene isolated from Juniperus chinensis Oncol. Rep. 2015 34 1178 1184 10.3892/or.2015.4075 26133679 31. Nuñez Y.O. Salabarria I.S. Collado I.G. Hernández-Galán R. The antifungal activity of widdrol and its biotransformation by Colletotrichum gloeosporioides Botrytis cinerea J. Agric. Food Chem. 2006 54 7517 7521 10.1021/jf061436m 17002416 32. Chen X. Shen J. Zhao J.M. Guan J. Li W. Xie Q.M. Zhao Y.Q. Cedrol attenuates collagen-induced arthritis in mice and modulates the inflammatory response in LPS-mediated fibroblast-like synoviocytes Food Funct. 2020 11 4752 4764 10.1039/D0FO00549E 32420568 33. Cheng S.S. Lin C.Y. Gu H.J. Chang S.T. Antifungal activities and chemical composition of wood and leaf essential oils from Cunninghamia konishii J. Wood Chem. Technol. 2011 31 204 217 10.1080/02773813.2010.515049 34. Cheng S.S. Chung M.J. Lin C.Y. Wang Y.N. Chang S.T. Phytochemicals from Cunninghamia konishii J. Agric. Food Chem. 2012 60 124 128 10.1021/jf2042196 22129092 35. Mukai A. Takahashi K. Kofujita H. Ashitani T. Antitermite and antifungal activities of thujopsene natural autoxidation products Eur. J. Wood Wood Prod. 2019 77 311 317 10.1007/s00107-018-1370-4 36. Lin C.H. Chiang Y.T. Lin L.Y. Tsao N.W. Wang C.H. Chien S.C. Sun Y.H. Wang S.Y. Composition characterization of Crossostephium chinense Plants 2024 13 2506 10.3390/plants13172506 39273990 PMC11397578 37. Gheena S. Ezhilarasan D. Syringic acid triggers reactive oxygen species-mediated cytotoxicity in HepG2 cells Hum. Exp. Toxicol. 2019 38 694 702 10.1177/0960327119839173 30924378 38. Tsao N.W. Lin Y.C. Tseng Y.H. Chien S.C. Wang S.Y. Composition analysis of exudates produced by conifers grown in Taiwan and their antifungal activity J. Wood Sci. 2022 68 46 10.1186/s10086-022-02056-z Figure 1 Chromatogram of Jm-EO by GC-MS. 1, α β β β α Figure 2 Effects of Jm-EO on RAW 264.7 macrophage cell viability and nitric oxide (NO) production. ( a b Figure 3 Anti-inflammatory activities of the major components of Jm-EO. ( a b 50 Figure 4 Cytotoxic effects of Jm-EO on HepG2 human hepatocellular carcinoma cells. HepG2 cells were treated with various concentrations of Jm-EO (5–80 μg/mL) or plumbagin (1 and 2 μM) as a positive control for 24 and 48 h. Cell viability was determined using the MTT assay. Jm-EO exhibited dose- and time-dependent cytotoxicity with an IC 50 plants-14-02924-t001_Table 1 Table 1 Chemical composition of Jm-EO. RT (min) Constituent KI a Concentration (%) Reference b 27.39 α 1415 8.16 MS, KI 27.64 β 1423 1.51 MS, KI 27.98 thujopsene 1434 12.26 MS, KI, ST 29.43 β 1480 0.64 MS, KI 29.51 zingiberene 1482 3.09 MS, KI 30.02 β 1498 4.12 MS, KI 30.14 α 1502 4.31 MS, KI 30.27 cuparene 1506 1.7 MS, KI 31.48 8,14-cedranoxide 1549 9.5 MS, KI 33.13 widdrol 1605 20.82 MS, KI, ST 33.17 cedrol 1607 22.87 MS, KI, ST 33.55 8-cedren-15-ol 1625 0.87 MS, KI 34.84 8-cedren-13-ol 1686 0.75 MS, KI 35.04 valerenol 1695 0.78 MS, KI 35.38 valerenal 1715 1.18 MS, KI a n b α β β β α plants-14-02924-t002_Table 2 Table 2 Antifungal activity of Jm-EO. Jm-EO (ppm) Antifungal Index (%)  Fomitopsis pinicola  Trametes versicolor  Lenzites betulina  Laettiporus sulphureus 25 27.68 ± 0.36 13.42 ± 4.81 10.70 ± 0.72 17.73 ± 3.75 50 38.41 ± 1.75 24.01 ± 3.95 12.36 ± 1.90 33.33 ± 6.45 100 48.10 ± 0.43 23.16 ± 5.66 24.40 ± 4.72 100 ± 0 200 63.93 ± 1.13 35.88 ± 1.89 44.34 ± 0.72 100 ± 0 DDAC a 100 ± 0 100 ± 0 100 ± 0 100 ± 0 a ",
  "metadata": {
    "Title of this paper": "Composition analysis of exudates produced by conifers grown in Taiwan and their antifungal activity",
    "Journal it was published in:": "Plants",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473711/"
  }
}