{
  "title": "Paper_718",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474284 PMC12474284.1 12474284 12474284 41012356 10.3390/toxics13090735 toxics-13-00735 1 Article Cytotoxic Effects and Micronuclei Frequency as a Biomarker of Genotoxicity in Farmers from the Municipality of Tehuacán, Puebla, Mexico https://orcid.org/0000-0002-7525-9522 Mauricio-Gutiérrez Amparo Conceptualization Methodology Validation Formal analysis Resources Writing – original draft Writing – review & editing Funding acquisition 1 Ramírez-Gutiérrez Didier D. 2 https://orcid.org/0000-0003-0076-3609 Romero-Arenas Omar Conceptualization Methodology Software Validation Formal analysis Resources Writing – original draft Writing – review & editing Visualization Project administration 3 * Contreras-Paredes Carlos A. Software Writing – review & editing 4 Mora-Ravelo Sandra Conceptualization Writing – original draft 5 Cedillo-Ramírez Lilia Validation Visualization 6 7 https://orcid.org/0000-0001-8724-0012 Yáñez-Santos José A. 7 8 * Valencia de Ita María A. Methodology Writing – review & editing 3 Zuo Zhenghong Academic Editor 1 amg2510@hotmail.com 2 dayron.ramirez@alumno.buap.mx 3 mavi1179@outlook.es 4 carlos.contreraspar@correo.buap.mx 5 sgmora@docentes.uat.edu.mx 6 lilia.cedillo@correo.buap.mx 7 8 * biol.ora@hotmail.com jorge.yanez@correo.buap.mx 30 8 2025 9 2025 13 9 497672 735 28 7 2025 27 8 2025 29 8 2025 30 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ In Tehuacán, Puebla, Mexico, the agricultural sector is primarily dedicated to corn cultivation, which is reflected in the region’s economy, culture, and diet. This sector follows an agro-industrial production model dependent on pesticides and chemical fertilizers, which impacts both soil health and the population’s well-being. The objective of this study was to assess cytotoxic damage using the Buccal Micronucleus Cytome Assay (BMCA) in a population engaged in agricultural activities in San Diego Chalma, Tehuacán, Puebla, Mexico. Sociodemographic parameters were analyzed, along with the buccal micronucleus cytome assay, in a sample of 35 individuals composed of an agricultural group (18) and a control group (17). The agricultural group showed a significantly higher number of total micronucleated cells (Median = 714), which was 19.8 times greater than the non-agricultural group. Age, sex, basic education level, time of residence, and involvement in agricultural activities were key factors contributing to the development of buccal cell micronuclei, in addition to the use of pesticides as lambda-cyhalothrin, spinetoram, ethoprophos, carbofuran, methomyl, and chlorpyrifos ethyl without safety measures. There was an increased risk of developing micronucleated cells in males from the control group (OR = 2.386, 95% CI = 2.123–2.681) and in individuals aged 30–59 years (OR = 16.464, 95% CI = 14.315–18.935). The agricultural population for the 0–29 years presented a risk probability developing micronucleated cells of 99.8% in men and 99.9% in women, with a higher risk observed in women and in individuals who had lived their entire lives in San Diego Chalma, where they are continuously exposed to pesticides. Therefore, it is crucial to provide guidance, training, and improved public policies in the region of Puebla, Mexico. micronuclei cells pesticides rural population Secretaría de Ciencia, Humanidades, Tecnología e Innovación (Secihti) CVU 48911 Benemérita Universidad Autónoma of Puebla ID 100420500 The authors are grateful to Secretaría de Ciencia, Humanidades, Tecnología e Innovación (Secihti) (No. CVU 48911) and Benemérita Universidad Autónoma of Puebla (No. ID 100420500). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In Mexico, 7.76% of the population is engaged in agricultural activities [ 1 2 3 The primary sector’s participation in corn cultivation in Tehuacán, Puebla, Mexico follows an agro-industrial production model that relies heavily on external inputs such as pesticides and chemical fertilizers, which has significant implications for the sustainability of agroecosystems [ 4 In Mexico, over the last two decades, total pesticide consumption has increased by 57–65% [ 5 6 The handling and application of pesticides pose a risk to humans, whether as users or consumers of treated vegetables, fruits, and other products [ 7 8 Some pesticides have been shown to have cytotoxic effects in vivo in animals, i.e., category 2 and 3 mutagens, for example, benomyl, carbendazim, DNOC (4,6-dinitro-o-cresol), methyl bromide, monocrotophos, phosphamidon) and others considered devoid of cytotoxic activity [ 7 9 Monitoring the different pesticides mentioned by farmers will allow for the creation of human health risk models. This will allow for the implementation of better management practices and safety policies for the most used pesticides, and for the implementation of good agricultural practices in their use, handling, and containment. Exposure to pesticides in agricultural practices represents a significant public health problem, coupled with a lack of knowledge and adequate training on the safe use of pesticides. Therefore, it is crucial to develop and use accurate indicators to assess these toxicological risks and reduce vulnerability to cytotoxic damage. Moreover, their cytotoxic potential is a primary risk factor and has been evaluated using the Buccal Micronucleus Cytome Assay (BMCA), a method that utilizes peripheral lymphocytes or exfoliated buccal mucosa cells to assess long-term toxicological effects related to carcinogenesis, reproductive health, and degenerative conditions [ 10 One of the biological indicators of this assay is the presence of micronuclei, which are chromosomal fragments or whole chromosomes formed during anaphase. These fragments fail to integrate into the nuclei of daughter cells and instead form one or more micronuclei in the cytoplasm [ 11 12 13 2. Materials and Methods 2.1. Study Area The study site is in San Diego Chalma, Tehuacán, Puebla, Mexico, at geographic coordinates 18°26′13.9992″ N and 97°21′41.0004″ W ( Figure 1 14 2.2. Sample Size Selection The study population consisted of residents of San Diego Chalma and the city of Tehuacán, Puebla, Mexico. The sample included a group of 18 farmers and a control group of 17 individuals with no connection to agricultural activities. The total sample size was 35 participants, which exceeded the minimum sample size calculated using Santoyo’s formula [ 15 n 2 2 d 2 2 2 (1) N = Represents the total number of producers; Z = Normal distribution; CV = Coefficient of variability; d n 2.3. Buccal Micronucleus Cytome Assay (BMCA) The Buccal Micronucleus Cytome Assay was used as a biomarker of cytotoxicity, including the assessment of nuclear anomalies in randomly selected farmers from the region. A gentle buccal smear of the oral mucosa on both cheeks was collected using sterile swabs, in accordance with the Declaration of Helsinki [ 12 Each sample was centrifuged at 1500 rpm for 10 min, and the cellular sediment was spread across 10 microscope slides. The slides were air-dried at room temperature for 10 min and stained using the Feulgen method. This involved fixing the cells with Farmer’s fixative solution (75% absolute ethanol and 25% glacial acetic acid) for 15 min, followed by washes with 70% ethanol and distilled water. After drying for 5 min, 1N HCl was applied for 45 min at room temperature for hydrolysis. The slides were rinsed with distilled water and stained using a carmine-based dye (carmine-propionic or acetocarmine solution: 1 g carmine in 100 mL of 45% glacial acetic acid) for 30 min or until the tissue appeared purple. After another rinse with distilled water and drying, the samples were examined under a compound microscope (Carl Zeiss, Jena, Germany) at 10× and 40× magnification. The frequency of micronucleated cells (MN), nuclear buds (BUD), and binucleated cells (BN) was determined as indicators of potential aneuploidy and genomic instability. Additional indicators such as condensed chromatin cells (CC), karyorrhectic cells (KR), karyolytic cells (KL), pyknosis (PY), and basal cells (BC) were analyzed to assess epithelial proliferation activity in the buccal mucosa [ 16 2.4. Statistical Analysis Sociodemographic variables including age, sex, place of birth, duration of residence, education level, occupation, alcohol and tobacco use, and infectious diseases were analyzed. Pearson’s Chi-square (χ 2 Associations between sociodemographic factors and the presence of micronucleated cells (MN) in the study population were also examined using Pearson’s Chi-square test ( p p Finally, a multinomial analysis was conducted using a generalized linear model to predict the development of micronucleated cells (MN) with predictive variables including age, place of birth, and sex of the non-agricultural population. Odds ratios (Exp B) were calculated to express the association between the outcome and the explanatory variables as multivariate risk coefficients for the formation of micronucleated cells. Statistical significance was determined at a 95% confidence interval (CI) and p 3. Results 3.1. Sociodemographic Parameters The study area included a group of farmers (18 individuals) engaged in agricultural activities (100%) and a group of non-farmers (17 individuals), mainly involved in commerce (58%; p Table 1 p p p p However, 39% of farmers reported tobacco use (1–5 cigarettes per week), and 61% consumed alcohol once a week. In contrast, only 12% and 29% of the control group reported tobacco and alcohol use, respectively. No significant differences were found between the two groups ( p Six insecticide-type pesticides were identified: lambda-cyhalothrin, spinetoram, ethoprophos, carbofuran, methomyl, and chlorpyrifos ethyl [ 7 8 Table 2 3.2. Chromosomal Aberration Counts Descriptive analysis of the cellular aberration counts revealed that micronucleated cells (MN) were the most frequent in both groups, with a significantly higher frequency (34,545) in the farmer group compared to the control group (4189) ( p p p Table 3 Residents living more than 30 years in San Diego Chalma had more micronuclei aberrations, indicating that prolonged exposure to contaminants such as pesticides caused adverse effects ( Figure 2 Figure 3 Tobacco and alcohol use and infectious diseases were not associated with MN presence according to the chi-square test conducted on the studied population ( Table 3 The Buccal Micronucleus Cytome Assay revealed a significantly different ( p Table 4 Figure 2 Figure 3 d p Figure 3 d d d d p A multinomial analysis of sociodemographic factors such as age, place of birth, and sex with MNs in both groups ( Table 5 p 2 2 In the control group (non-agricultural), the development of abnormal epithelial cells was significantly related to age ( p p p p p p p p Table 5 According to the model generated in Table 5 Table 6 On the other hand, in the reference group of both men and women from San Diego Chalma, the risk probability of developing micronucleated cells was very low (0.2–0.1%) in the 0–29 age range. Cytotoxic damage is age-related, as the number of MN tends to increase for people aged 30–59 years, mainly in men (2.9% probability) compared to women (1.2% probability). Furthermore, the population born in Tehuacán and not engaged in agricultural activities showed the same cytotoxic damage behavior positively correlated with age (30–59 years) with a risk probability of 36.0% in men and 19.1% in women. Agricultural activities in San Diego Chalma expose the population to pesticides due to lack of protective equipment—mostly due to discomfort and lack of awareness about health hazards during preparation, application, and storage—which poses a significant risk for developing micronucleated cells. 4. Discussion Corn is susceptible to phytopathological problems caused mainly by diseases from the Fusarium and Aspergillus genera, which lead to root, stalk, and ear rot. These diseases result in economic losses due to low yields, compromising food security and affecting the health of both producers and consumers in the region due to the heavy reliance on pesticide use [ 17 According to the present study, the pesticides Lambda-Cyhalothrin, Methomyl, and Chlorpyrifos ethyl were the most frequently used by agricultural producers in San Diego Chalma, Tehuacán, Puebla, primarily for corn cultivation ( Table 2 7 10 Pesticide exposure represents a major public health issue [ 18 19 20 21 Cytotoxicity testing has been widely reported as a means of assessing DNA damage, including single- and double-strand breaks, point mutations, chromosomal aberrations, and micronucleus formation, among others [ 22 23 24 25 For this reason, the Buccal Micronucleus Cytome Assay was crucial in assessing risk in the exposed population at the study site, enabling the implementation of better pesticide handling practices and safety policies in Mexico. The agricultural population of San Diego Chalma showed evidence of cytotoxic damage, primarily reflected in the number of micronucleated cells (Median = 2581), as well as other types of cellular anomalies such as karyolytic (KL) cells (Median = 2096) and pyknosis (PY) (Median = 1129) ( Table 4 Table 3 These findings are consistent with Rivera et al. [ 10 10 The risk level for developing micronucleated cells in the reference group (non-farmers) was associated with the 30–59 age range (OR = 16.464, 95% CI = 14.315–18.935) and male sex (OR = 2.386, 95% CI = 2.123–2.681) ( Table 5 Table 6 Micronuclei are not only indicators of chromosomal damage, but can also significantly affect cell functionality, cause genomic instability and chromosomal rearrangements (e.g., aneuploidy, reintegration of damaged DNA fragments, chromothripsis), and activate DNA damage response mechanisms (ATM/ATR: Ataxia Telangiectasia Mutated and Rad3-Related Kinases), senescence, apoptosis, and immune and inflammatory responses via the cGAS-STING pathway [ 26 Therefore, the agricultural population of San Diego Chalma, Tehuacán, Puebla, experiences greater cytotoxic damage than the population studied in Españita, Tlaxcala, Mexico [ 10 27 The issue of pesticides presents a multifaceted challenge, with intertwined environmental and health impacts that demand urgent attention and innovative solutions. The findings highlight the urgent need for a transition toward green agriculture approaches that reduce dependence on chemical pesticides and promote safer, more sustainable practices. Green agriculture integrates agroecological strategies such as crop rotation, biological control, biofertilizers, and organic amendments, which minimize environmental and health risks for producers while maintaining agroecosystem productivity. Recent studies emphasize that adopting integrated pest management (IPM) and agroecological practices can significantly mitigate cytotoxic risks and improve soil–plant–human health interactions. Public awareness and education are essential components for fostering collective commitment to green agriculture. Governments, researchers, and stakeholders must collaborate to enact and enforce strict regulations that prioritize the development and adoption of ecological solutions for food production [ 28 In this context, it is necessary to implement community-level interventions to prevent pesticide poisoning and cellular damage among agricultural producers. Therefore, the following measures are proposed: Training programs for farmers on the safe handling, preparation, and application of pesticides, with emphasis on the risks of chronic exposure and DNA damage. Mandatory use of personal protective equipment (PPE), including gloves, boots, protective masks, coveralls, and safety goggles, to reduce dermal and inhalation exposure. Promotion of integrated pest management (IPM) practices, replacing highly hazardous pesticides with biological control agents, resistant crop varieties, and essential oils with fungicidal and insecticidal properties. Establishment of safe storage and disposal systems for pesticides and their residues to prevent contamination of soil, water, and household environments. Community monitoring and biomarker surveillance programs, including periodic cytotoxicity testing (e.g., BMCA), to detect early genetic damage and support evidence-based health policies. By incorporating these strategies within a green agriculture framework, it is possible to reduce cytotoxic risk, improve public health outcomes, and promote the long-term sustainability of rural communities in San Diego Chalma and similar agricultural regions [ 10 5. Conclusions Oral cytome samples collected in the community of San Diego Chalma, Tehuacán, Puebla, showed chromosomal aberrations (micronucleated cells, condensed chromatin, karyorrhexis, binucleated cells, karyolysis, and pyknosis) with increased cytotoxic risk in the agricultural population due to exposure to pesticides without adequate protection and safety measures. Therefore, it is necessary to provide advice and training and improve public policies on the use of pesticides in agricultural communities in the Puebla region, Mexico. Acknowledgments We are grateful for the assistance of Roberto Llanos Hernández and Jose Luis Cruz, representatives of the communal ejido of San Diego Chalma, Tehuacán Puebla, Mexico; for their availability and access to information for the design of the sampling site for the population of the municipality of Tehuacán Puebla, Mexico. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, D.D.R.-G., A.M.-G., S.M.-R. and O.R.-A.; methodology, D.D.R.-G., A.M.-G., M.A.V.d.I. and O.R.-A.; software, C.A.C.-P. and O.R.-A.; validation, D.D.R.-G., A.M.-G., L.C.-R. and O.R.-A.; formal analysis, A.M.-G., J.A.Y.-S. and O.R.-A.; resources, A.M.-G. and O.R.-A.; original—draft preparation, A.M.-G., S.M.-R. and O.R.-A.; writing—review and editing, C.A.C.-P., A.M.-G., M.A.V.d.I. and O.R.-A.; visualization, O.R.-A. and L.C.-R.; supervision, J.A.Y.-S., project administration, O.R.-A.; funding acquisition, A.M.-G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and was approved by the ethics committee of the Benemerita Autonomous University of Puebla, Mexico, and the Faculty of Biological Sciences (FACCB/311867-0189115-2025) For Studies with Human Beings. Informed Consent Statement Informed consent was obtained from all subjects involved in the study for the application of interviews and handling of personal data. Data Availability Statement The data presented in this study are available on request from the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. INEGI Instituto Nacional de Estadística y Geografía 2024 Available online: https://www.inegi.org.mx/ (accessed on 13 January 2025) 2. SIAP. Servicio de Información Agroalimentaria y Pesquera Avance de Siembras y Cosechas 2024 Available online: https://www.gob.mx/agricultura%7Cdgsiap/es/articulos/avances-de-siembras-y-cosechas-y-de-la-produccion-pecuaria2 (accessed on 1 August 2024) 3. Mardero S. Schmook B. López-Martínez J.O. Cicero L. Radel C. Christman Z. The Uneven Influence of Climate Trends and Agricultural Policies on Maize Production in the Yucatan Peninsula, Mexico Land 2018 7 80 10.3390/land7030080 4. Toledo V.M. Barrera-Bassols N. Political Agroecology in Mexico: A Path toward Sustainability Sustainability 2017 9 268 10.3390/su9020268 5. Moo-Muñoz A.J. Azorín-Vega E.P. Ramírez-Durán N. Moreno-Pérez M.P. Estado de la producción y consumo de plaguicidas en México Trop. Subtrop. Agroecosyst. 2020 23 43 10.56369/tsaes.3225 6. Mauricio-Gutiérrez A. Romero-Arenas O. Tamariz-Flores J.V. Ravelo S.G.M. Ramírez L.C. Santos J.A.Y. Simón A.B. Infectious Diseases Associated with Exposure to Pollutants in a Local Population from Mexico Appl. Sci. 2023 13 12754 10.3390/app132312754 7. PAN. Pesticide Action Network PAN International Consolidated List of Banned Pesticides 4th Available online: https://pan-international.org/pan-international-consolidated-list-of-banned-pesticides/ (accessed on 29 April 2025) 8. DOF. Diario Oficial de la Nación Norma Oficial Mexicana NOM-232-ssa1-2009. Plaguicidas que Establece los Requisitos del Envase, Embalaje y Etiquetado de Productos Grado Técnico y Para uso Agrícola, Forestal, Pecuario, Urbano, Industrial y Doméstico 2010 Available online: https://www.gob.mx/cofepris/documentos/nom-232-ssa1-2009-plaguicidas (accessed on 23 April 2025) 9. Pérez M.A. Navarro H. Miranda E. Residuos de plaguicidas en hortalizas: Problemática y riesgo en México Rev. Int. De Contam. Ambient. 2013 29 45 64 Available online: https://www.redalyc.org/pdf/370/37028958003.pdf (accessed on 22 August 2025) 10. Rivera A. Ramírez L.C. Lezama C.P. Simon A.B. Garcia B.L. Romero-Arenas O. Evaluation of Cytotoxic and Genotoxic Risk Derived from Exposure to Pesticides in Corn Producers in Tlaxcala, Mexico Appl. Sci. 2022 12 9050 10.3390/app12189050 11. Costa S. Costa C. Madureira J. Valdiglesias V. Teixeira-Gomes A. de Pinho P.G. Laffon B. Teixeira J.P. Occupational exposure to formaldehyde and early biomarkers of cancer risk, immunotoxicity and susceptibility Environ. Res. 2019 179 108740 10.1016/j.envres.2019.108740 31563789 12. Podrimaj-Bytyqi A. Borovečki A. Selimi Q. Manxhuka-Kerliu S. Gashi G. Elezaj I.R. The frequencies of micronuclei, nucleoplasmic bridges and nuclear buds as biomarkers of genomic instability in patients with urothelial cell carcinoma Sci. Rep. 2018 8 17873 10.1038/s41598-018-35903-5 30552338 PMC6294807 13. Yazici I. Caglar O. Guclu O. Cobanoglu H. Coskun M. Coskun M. Kilic A. Dereköy F.S. Micronucleus, nucleoplasmic bridge and nuclear bud frequencies in patients with laryngeal carcinoma Acta Otorhinolaryngol. Ital. 2020 40 410 414 10.14639/0392-100X-N0490 33558768 PMC7889252 14. CONABIO Comisión Nacional para el Conocimiento y uso de la Biodiversidad 2019 Available online: https://www.gob.mx/conabio (accessed on 13 January 2025) 15. Santoyo H. Ramírez P. Suvedi M. Manual para la Evaluación de Programas de Desarrollo Rural 2002 Available online: http://ciestaam.edu.mx/libro/manual-la-evaluacion-programas-desarrollo-rural-2/ (accessed on 21 January 2024) 16. Chieco P. Derenzini M. The Feulgen reaction 75 years on Histochemistry 1999 111 345 358 10.1007/s004180050367 10403113 17. Nyandi M.S. Pepó P. Aspergillus and Fusarium Mycotoxin Contamination in Maize ( Zea mays Toxins 2024 16 318 10.3390/toxins16070318 39057958 PMC11281323 18. Zhang B. Liu X. Wei W. Li X. Zhu H. Chen L. Environmental carrying capacity and ecological risk assessment of pesticides under different soil use types in the Central Plains Urban Agglomeration (CPUA), China Environ. Pollut. 2024 341 122852 10.1016/j.envpol.2023.122852 37944884 19. Molina-Zapata J.E. La revolución verde como revolución tecnocientífica: Artificialización de las prácticas agrícolas y sus implicaciones Rev. Colomb. De Filos. De La Cienc. 2021 21 175 204 10.18270/rcfc.v21i42.3477 20. Hu Y. Wu S. Lyu W. Ning J. She D. Risk assessment of human exposure to airborne pesticides in rural greenhouses Sci. Rep. 2023 13 5138 10.1038/s41598-023-32458-y 36991103 PMC10060557 21. Rico A. de Oliveira R. Silva-de-Souza-Nunes G. Rizzi C. Villa S. De Caroli-Vizioli B. Montagner C.C. Waichman A.V. Ecological risk assessment of pesticides in urban streams of the Brazilian Amazon Chemosphere 2022 291 Pt 1 132821 10.1016/j.chemosphere.2021.132821 34758362 22. Reddy M.V. Storer R.D. Laws G.M. Armstrong M.J. Barnum J.E. Gara J.P. McKnight C.G. Skopek T.R. Sina J.F. DeLuca J.G. Genotoxicity of naturally occurring indole compounds: Correlation between covalent DNA binding and other genotoxicity tests Environ. Mol. Mutagen. 2002 40 1 17 10.1002/em.10088 12211071 23. Laborde M.R. Larramendy M.L. Soloneski S. Cytotoxic and genotoxic profiles of the pyrethroid insecticide lambda-cyhalothrin and its microformulation Karate ® Mutat. Res. Toxicol. Environ. Mutagen. 2023 891 503682 10.1016/j.mrgentox.2023.503682 37770139 24. Lu M. Liu Y. Toxicity of methomyl insecticides to testicular cells and protective effect of folic acid Toxicol. Ind. Health 2023 39 481 490 10.1177/07482337221140221 37409447 25. Petitjean K. Verres Y. Bristeau S. Ribault C. Aninat C. Olivier C. Leroyer P. Ropert M. Loréal O. Herault O. Low concentrations of ethylene bisdithiocarbamate pesticides maneb and mancozeb impair manganese and zinc homeostasis to induce oxidative stress and caspase-dependent apoptosis in human hepatocytes Chemosphere 2024 346 140535 10.1016/j.chemosphere.2023.140535 37923018 26. Sommer S. Buraczewska I. Kruszewski M. Micronucleus Assay: The State of Art, and Future Directions Int. J. Mol. Sci. 2020 21 1534 10.3390/ijms21041534 32102335 PMC7073234 27. Ferré D.M. Quero M. Hynes V. Saldeña E. Lentini V. Tornello M. Carracedo R. Gorla N.B. Ensayo de mi-cronúcleos de citoma bucal en trabajadores de fincas frutícolas que han aplicado plaguicidas alrededor de quince años Rev. Int. De Contam. Ambient. 2018 34 23 33 10.20937/RICA.2018.34.01.02 28. Singh M. Pesticide predicament: Exploring environmental and health impacts, and possible eco-friendly solutions Int. J. Environ. Health Sci. 2024 6 38 47 Figure 1 Location of study zone in the municipality from San Diego Chalma, Tehuacán, Puebla, Mexico. Figure 2 Cells with nuclear aberrations due to cytotoxic damage in the farming group. ( a b c d e f g h Figure 3 Total number of micronuclei cells (MNi) in the farming group (( A B C D toxics-13-00735-t001_Table 1 Table 1 Social and health indicators in study zone. Variables Category Farmers Group Non-Farmer Group p F = 18 NF = 17 Frequency % Frequency % Age 0–29 years 5 27.8 6 35.3 0.632 30–59 years 13 72.2 11 64.7 Sex Women 4 22.2 5 29.4 0.621 Men 14 77.8 12 70.6 Birthplace Tehuacán 7 38.9 12 70.6 0.060 San Diego Chalma 11 61.1 5 29.4 Time of residence in the town 0–5 years 2 11.1 3 17.6 0.092 6–10 years 1 5.6 1 6.0 10–20 years 4 22.2 3 17.6 21–30 years 1 5.6 5 29.4 >30 years 10 55.5 5 29.4 Education level Elementary education 13 72.2 6 35.3 0.179 Secondary education 2 11.1 3 17.6 Higher Secondary education 2 11.1 3 17.6 Technical education 0 0 3 17.6 No education 1 5.6 2 11.8 Occupation Farmer 18 100 0 0 0.001 ** Businessman 0 0 10 58.8 Housewife 0 0 2 11.8 Student 0 0 3 17.6 Minors 0 0 2 11.8 Smoker 1–5 cigarettes/week 7 38.9 2 11.8 0.067 No smoking 11 61.1 15 88.2 Alcohol consumer 2 to 3 times a week 1 5.6 1 5.9 0.158 Once a week 11 61.1 5 29.4 No alcohol 6 33.3 11 64.7 Diseases Infections Once a year 5 27.8 4 23.5 0.774 None 13 72.2 13 76.5 F: People of farmers; NF: People of non-farmers. **: highly significant. toxics-13-00735-t002_Table 2 Table 2 Pesticides used by producers in San Diego Chalma Tehuacán, Puebla. Ingredient Active Chemical Family Commercial Name Type 1 Mechanism of action TC 2 List HHP 3 Pesticide Lambda-Cyhalothrin Pyrethroids Lambda Cihalotrina 50 EC, Lambda KOOR 5.6%, LambdaTel 70CE, Lambdazo I Affects sodium channels in nerve cells III 1, 3 33.33% (6/18) Spinetoram Spinosines Palgus, Exalt 60SC, Spirotrid I Activates nicotinic acetylcholine receptors causing paralysis IV 1, 2, 3 16.66% (3/18) Ethoprophos Organophosphate Mocap CE, Ethopro 10%, Mocap 15 G I, N Inhibits acetylcholinesterase Ib 1, 2, 3 5.55% (1/18) Carbofuran Carbamate Furadan 350, Furadan 3F, Furadam 48SC I, N Inhibits acetylcholinesterase Ib 1, 3, 4 11.11% (2/18) Methomyl Carbamate Lannate, Lannate 90, Lannate 21,6 SL, Lannate 40 SP, Lannate Blue I Inhibits acetylcholinesterase Ib 1, 3 22.22% (4/18) Chlorpyrifos ethyl Organophosphate Foley 50 CE MAX, Foley MAX 1.5% I Inhibits acetylcholinesterase II 1, 3 27.77% (5/18) 1 2 3 7 8 toxics-13-00735-t003_Table 3 Table 3 Micronuclei (MN) evaluated in farmers according to the sociodemographic characteristics of the locality of San Diego Chalma in the municipality of Tehuacán, Puebla, Mexico. Variables Category N % F NF p  n MN %  n MN %  Total MN MN  35  100  18  34,545  89.2  17  4189  10.8 0.001 Age 0–29 years 11 31.4 5 9718 28.1 6 223 5.3 0.001 * 30–59 years 24 68.6 13 24,827 71.9 11 3966 94.7  Sex Women 9 25.7 4 7095 20.5 5 383 9.1 0.001 * Men 26 74.3 14 27,450 79.5 12 3806 90.9  Birthplace Tehuacán 19 54.3 7 13,491 39.1 12 3732 89.1 0.001 * San Diego Chalma 16 45.7 11 21,054 60.9 5 457 10.9  Time of residence in the town 0–5 years 5 14.3 2 2266 6.6 3 992 23.7 0.001 * 6–10 years 2 5.7 1 1747 5.1 1 6 0.1  10–20 years 7 20.0 4 5891 17.1 3 443 10.6  21–30 years 6 17.1 1 2956 8.4 5 846 20.2  >30 years 15 42.9 10 21,685 62.8 5 1902 45.4  Education level Elementary education 19 54.2 13 25,762 74.6 6 1403 33.5 0.001 * Secondary education 5 14.3 2 2976 8.6 3 1403 33.5  Higher Secondary education 5 14.3 2 4372 12.7 3 206 4.9  Technical education 3 8.6 0 0 0 3 992 23.7  No education 3 8.6 1 1435 4.1 2 185 4.4  Occupation Farmer 18 51.4 18 34,545 100 0 0 0 0.001 * Businessman 10 28.6 0 0 0 10 2049 48.9  Housewife 2 5.7 0 0 0 2 1377 32.9  Student 3 8.6 0 0 0 3 727 17.4  Minors 2 5.7 0 0 0 2 36 0.8  Smoker 1–5 cigarettes/week 9 25.7 7 14,694 42.5 2 793 18.9 0.001 * No smoking 26 74.3 11 19,851 57.5 15 3396 81.1  Alcohol consumer 2 to 3 times a week 2 5.7 1 2702 7.9 1 625 14.9 0.001 * Once a week 16 45.7 11 22,195 64.2 5 1080 25.8  No alcohol 17 48.6 6 9648 27.9 11 2484 59.3  Diseases Infections Once a year 9 25.7 5 5824 16.9 4 734 17.5 0.280 None 26 74.3 13 28,721 83.1 13 3455 82.5  F: People of farmers; NF: People of non-farmer; N = total population of farmer; n p toxics-13-00735-t004_Table 4 Table 4 Comparison of BMCA results between exposed (F) and control (NF) groups. Variables Median IQR Mann–Whitney U Test  Z 1– β  d Significance p MNi (F)= 714 164 2,600,576 −102.24 0.89 6.17 0.001 (NF)= 36 23      CC (F)= 502 245 0 −106.07 0.68 4.27 0.001 (NF)= 0 29      KR (F)= 206 270 8,692,340 −93.37 0.96 1.76 0.001 (NF)= 0 34      BN (F)= 223 165 2,405,619 −102.53 0.91 2.66 0.001 (NF)= 2 56      KL (F)= 2096 1351 0 −106.07 0.94 2.88 0.001 (NF)= 0 99      PY (F)= 1129 766 1,834,096 −103.38 0.83 2.65 0.001 (NF)= 0 78      MN (F)= 2581 671 0 −106.05 0.68 3.39 0.001 (NF)= 499 955      BC (F)= 2792 1904 757,872 −104.94 0.99 13.86 0.001 (NF)= 9501 339      F: People of farmers; NF: People of non-farmer; BMCA = buccal micronucleus cytome assay. Note: Total number of micronuclei (MNi), condensed chromatin (CC), karyolysis (KL), binucleate cells (BN), micronuclei (MN), karyorrhexis (KR), pyknosis (PY), basal cells (BC). IQR = interquartile range; 1– β d p toxics-13-00735-t005_Table 5 Table 5 Socio-demographic characteristics in the development of Micronuclei (MN) evaluated in no farmers of the locality of San Diego Chalma in the municipality of Tehuacán, Puebla, Mexico. Predictor Variable 1 2 95% CI p Lower Lower Groups      NF −5.570    0.001 F 0 1    Age     0.001 30–59 years 2.801 16.464 14.315 18.935 0.001 0–29 years 0 1    Birth place     0.001 Tehuacán −1.476 0.229 0.217 0.240 0.001 San Diego Chalma 0 1    Sex     0.001 Men 0.870 2.386 2.123 2.681 0.001 Women 0 1    F: People of farmers; NF: People of non-farmer; −2 Log-likelihood = 1122.528. Hosmer and Lomeshow googness-of-fit test ( p 1 2 toxics-13-00735-t006_Table 6 Table 6 Probability forecasting in the development of Micronuclei (MN) cells with respect to sociodemographic characteristics. Variables N PFMN Birthplace Age Sex People  n % Tehuacán 0–29 years Men NF 96 217.4 3.3   F 6475 6353.6 96.7  Women NF 91 1.3 1.4   F 0 89.7 98.6 30–59 years Men NF 3253 3183.4 36.0   F 5581 5650.6 64.0  Women NF 292 329.8 19.1   F 1435 1397.1 80.9 San Diego Chalma 0–29 years Men NF 36 3.2 0.2   F 1747 1779.8 99.8  Women NF 0 1.1 0.1   F 1496 1494.9 99.9 30–59 years Men NF 421 402.1 2.9   F 13,647 13,666.1 97.1  Women NF 0 50.7 1.2   F 4164 4113.3 98.8 N = Micronuclei (MN) cells per predictor variable. TMN = Total Micronuclei (MN) cells. PFMN: Micronuclei (MN) cells forecast probability. ",
  "metadata": {
    "Title of this paper": "Pesticide predicament: Exploring environmental and health impacts, and possible eco-friendly solutions",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474284/"
  }
}