{
  "title": "Paper_467",
  "abstract": "pmc Global Spine J Global Spine J 2276 gsj GSJ Global Spine Journal 2192-5682 2192-5690 SAGE Publications PMC12479454 PMC12479454.1 12479454 12479454 41024402 10.1177/21925682251384614 10.1177_21925682251384614 1 Systematic Review Infection Following Vertebroplasty or Kyphoplasty: A Systematic Review of Risk Factors, Treatment Options and Outcomes https://orcid.org/0009-0000-5818-0604 Zampetakis Konstantinos MD, MSc 1 Stavrakakis Ioannis M. MD, MSc 1 Samartzidis Kosmas MD, MSc 1 https://orcid.org/0000-0002-8935-5566 Chaniotakis Constantinos MD, MSc 1 Tsiridis Christothea-Alexandra MD 2 Koutserimpas Christos MD, PhD 3 Alpantaki Kalliopi MD, PhD 1 1 General Hospital of Heraklion “Venizeleio-Pananeio” 2 University of London School of Health and Medical Sciences 3 37795 University of Patras Konstantinos Zampetakis, MD, MSc, Orthopaedic Surgery Resident-Department of Orthopaedics and Trauma Surgery, General Hospital of Heraklion “Venizeleio-Pananeio”, Crete 71409, Greece. Email: k_zampetakis@yahoo.com Kalliopi Alpantaki, MD, PhD, Orthopaedic Surgeon-Spine Surgeon Department of Orthopaedics and Trauma Surgery, General Hospital of Heraklion “Venizeleio-Pananeio”, Crete 71409, Greece. Email: apopaki@yahoo.gr 29 9 2025 474959 21925682251384614 11 6 2025 2 9 2025 18 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 AO Spine, unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc-nd/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs 4.0 License ( https://creativecommons.org/licenses/by-nc-nd/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Study Design Systematic Review. Objectives Infection following vertebral augmentation using Percutaneous vertebroplasty (PV) and percutaneous balloon kyphoplasty (PBK) is an exceedingly rare, but potentially life-threatening complication. This systematic review evaluates the microbiological characteristics, risk factors, treatment strategies and outcomes of these infections. Methods PubMed, Scopus, and Mendeley databases (2000-2025) were systematically reviewed. Inclusion criteria involved case cohorts of more than 5 adult patients with infections following PV or PBK. Data on the initial procedure, demographics, infection biomarkers, neurologic status, comorbidities, causative pathogens, treatment protocols, and outcomes were evaluated. Results A total of 102 patients from 8 studies were included (mean follow-up: 22.9 months). Most were female (64.7%) with a mean age of 71.0 years (range: 50-95). The mean time interval from the initial procedure to infection diagnosis was 5.2 months (range: 0.03-85.2). The most common pathogen was Mycobacterium tuberculosis 3 P Conclusions Post-augmentation spinal infections are rare but serious. Outcomes are strongly influenced by preoperative neurological status, while pathogen type and patient comorbidities have limited prognostic impact. vertebroplasty kyphoplasty vertebral augmentation cement augmentation spinal infection infectious spondylitis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf yes pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes edited-state corrected-proof typesetter ts10 Introduction Osteoporotic vertebral compression fractures (OVCFs) are the most common fragility fractures and have a significant impact on quality of life in older individuals.  1  2  3 3 4 While both PV and PBK are considered cost-effective, safe procedures in terms of pain reduction and functional improvement, they have been linked to potential complications, such as adjacent vertebral fractures, bleeding, cement leakage, neurologic deficit, allergic reaction to bone cement, cardiovascular collapse, pulmonary embolism and infections. 5 9 10 11 12 14  13 10 11 15 16 The primary objective of this systematic review was to evaluate the clinical outcomes of spinal infection treatment following percutaneous PBK or PV, with specific attention to mortality, mobility, and pain. The secondary objective was to correlate clinical outcomes with patient characteristics such as past medical history (PMH), neurological and functional status, isolated pathogens, and management-related factors, including the type of treatment. Materials and Methods Search Strategy PubMed, Scopus and Mendeley databases were systematically searched from January 2000 to January 2025. The used key terms were “vertebral augmentation procedures”, “cement augmentation”, “vertebroplasty”, “kyphoplasty”, “cementoplasty” and “infection.” This systematic review was registered in PROSPERO and was prepared in accordance with Preferred Reporting Items for Systematic Review and Meta-Analyses (PRISMA) 2020 guidelines.  17  18  19 Inclusion Criteria 1. Adult population. 2. English language. 3. Full text available. 4. Prospective or retrospective cohort studies reporting patients who developed infection after PV or PBK at any time after the initial procedure. 5. Low risk of bias according to JBI Critical Appraisal Checklist for case series (score of at least 7/10 YES responses) 6. Case series of more than 5 patients. Exclusion Criteria l. Clinical studies including high energy trauma treated with PV or PBK. 2. Review articles, case reports, technical notes, author opinions and short communication. 3. Experimental in vitro or in vivo studies. The patients’ demographics, the (American Society of Anesthesiologists) ASA score, the initial operative procedure (PV or PBK), the microorganism identified, regardless of the isolation method, infection biomarkers (White blood cells- WBC, Erythrocyte Sedimentation Rate- ESR, C-reactive protein- CRP), and the neurological status before and after infection management were recorded. Neurological status was described as normal or abnormal. No grading of the neurologic deficit was performed. The risk factors related to patient PMH (diabetes mellitus, heart disease, cancer, bacteremia, obesity, chronic kidney disease (CKD), chronic respiratory disease, smoking, pulmonary tuberculosis (TB), urinary tract infection (UTI), bacteremia and autoimmune disease), which can potentially affect the clinical outcome, were also recorded. Statistical Analysis The overall visual analogue scale for pain (VAS) score and the overall mortality risk were calculated using the random effects model. The heterogeneity between studies was measured by means of the Higgins I 2  20 The Pearson’s chi-square test was used to investigate the correlation of post-treatment mobility to the preoperative neurologic deficit and to the type of operative treatment. Abnormal mobility was defined as the use of a walker or wheelchair, with the latter category also encompassing patients who were completely non-ambulatory (eg, bedridden). The binary regression model was conducted to evaluate the correlation of post-treatment mobility to the infection markers, patients’ demographics, ASA score and PMH risk factors. The Nagelkerke R square was used to measure the goodness of fit in the logistic regression process. The statistical analysis was performed using the SPSS 28.0 program. Results The search initially attributed 1.338 studies. All duplicate records (n = 295) were identified and removed using the Mendeley Reference Manager Program. The “English” filter was applied to the Scopus search engine, and as a result, 95 papers were excluded automatically. Nine hundred fifty articles were excluded by title and abstract leaving 56 articles. Of those, 8 studies were compatible with the eligibility criteria including 102 patients in total and they were used for the quantitative synthesis ( Figure 1 10 11 13 16 21 22 Table 1 Figure 1. Prisma 2020 Flow Diagram for the Search Strategy Used to Review Infections Following Vertebral Augmentation Procedures Table 1. Joanna Briggs Institute (JBI) Critical Appraisal Checklist for Case Series Applied for Our Included Studies JBI critical appraisal checklist questions Abdelrahman et al. (2013) Ha et al. (2013) Park et al. (2018) Liao et al. (2018) Lai et al. (2019) Hu et al. (2021) Yuan et al. (2024) Zhang et al. (2024) Q1: Were there clear criteria for inclusion in the case series? Yes Yes Yes Yes Yes Yes Yes Yes Q2: Was the condition measured in a standard, reliable way for all participants included in the case series? Yes Yes Yes Yes Yes Yes Yes Yes Q3: Were valid methods used for identification of the condition for all participants included in the case series? Yes Yes Yes Yes Yes Yes Yes Yes Q4: Did the case series have consecutive inclusion of participants? Yes Yes Yes Yes Yes Yes Yes Yes Q5: Did the case series have complete inclusion of participants? Yes Yes Yes Yes Yes Yes Yes Yes Q6: Was there clear reporting of the demographics of the participants in the study? Yes Yes Yes Yes Yes Yes Yes Yes Q7: Was there clear reporting of clinical information of the participants? Yes Yes Yes Yes Yes Yes Yes Yes Q8: Were the outcomes or follow up results of cases clearly reported? Yes No Yes Yes Yes No Yes No Q9: Was there clear reporting of the presenting site(s)/clinic(s) demographic information? Yes Yes Yes Yes Yes Yes Yes Yes Q10: Was statistical analysis appropriate? Not applicable Not applicable Not applicable Not applicable Not applicable Yes Yes Not applicable Total YES answers 9/10 8/10 9/10 9/10 9/10 9/10 10/10 8/10 Overall risk of bias Low Low Low Low Low Low Low Low Characteristics of the studies included are summarized in Table 2 16 21  10 Table 2. Characteristics of the Included Studies Study Number of patients Kyphoplasty (PBK)/Vertebroplasty (PV)- levels Microorganisms (most common- %) Treatment of infection (most common- %) Abdelrahman et al. (2013) 9 5 patients/PBK – 11 levels S. aureus Operative- 88.9% 4 patients/PV – 94 levels No organism or undefined- 33.3% Ha et al. (2013) 6 1 patients/PBK – 2 levels S. aureus Operative- 100% 5 patients/PV – 5 levels Park et al. (2018) 11 2 patients/PBK – 4 levels S. aureus Operative- 100% 9 patients/PV – 11 levels No organism or undefined- 27.3% Liao et al. (2018) 18 Only PV – 24 levels M. tuberculosis Operative- 100% Lai et al. (2019) 9 Only PV – 12 levels M. tuberculosis Operative- 100% Hu et al. (2021) 7 6 patients/PBK – 6 levels M. tuberculosis Operative- 100% 1 patients/PV – 1 level No organism or undefined- 71.4% Yuan et al. (2024) 33 12 patients/PBK – 25 levels M. tuberculosis Operative- 81.8% 21 patients/PV – 45 levels No organism or undefined- 18.2% Zhang et al. (2024) 9 2 patients/PBK – 4 levels S. aureus Operative- 100% 7 patients/PV – 8 levels Staphylococcus epidermitis No organism or undefined- 77.8% All studies except one, precisely documented patient demographics. 10 11 13 14 16 21 22 11 13 M. tuberculosis S. aureus 14 15 22 Table 3 Table 3. Data Collected From the Included Studies Number of patients (n) n = 102 Mean age (range) 71.01 (50-95) ASA ASA 1: 1 patient ASA 2: 16 patients ASA 3: 33 patients ASA 4: 5 patients ASA 5: 0 patients ASA 6: 1 patient Initial procedure Kyphoplasty (28 patients) Vertebroplasty (67 patients) Time to infection diagnosis (months) - (range) 5.2 months (0.03-85.2) Microorganism (most frequent) M. tuberculosis Staph aureus No organism: 26 patients/25.5%) Neurologic deficit before treatment No deficit: 53 patients (52%) Deficit: 36 patients (35.3%) Fever Fever: 22 patients (21.6%) No fever: 53 patients (52%) Infection biomarkers (mean)-(range) CRP: 36.77 mg/dl (0.05-343) ESR: 56.98 mm/h (6-126) WBC: 8.53 cells/mm 3 Treatment Conservative: 7 patients Anterior + posterior: 47 patients Anterior: 10 patients Posterior: 38 patients Time to reoparation (months)-(range) 5.7 months (0.17 – 85.3) Mean follow up (months)-(range) 22.9 months (0.5 – 96) Outcome Death: 11 patients (12.3%) Wheelchair: 11 patients (12.3%) Walker: 22 patients (24.7%) Normal: 34 patients (38.2%) Mortality Died: 11 patients (12.3%) Lived: 78 patients (87.69%) Reporting on antibiotic treatment was inconsistent. Zhang et al. reported culture-guided intravenous antibiotics for 2 weeks followed by oral antibiotics for 8 weeks, with empirical therapy if cultures were negative.  14  16  22  11 10 13 15 21 The pooled mean VAS score was 2.43, 95% Confidence Interval (C.I.: 1.85 – 3.00), I 2 Figure 2 Figure 2. Forest Plot of Pooled Mean Postoperative VAS Scores. Squares Represent Mean Scores From Individual Studies With 95% Confidence Intervals, and the Diamond Shows the Overall Pooled Estimate Calculated Using a Random-Effects Model No statistically significant impact of the identified bacteria to mortality was found ( P P The logistic regression model found no significant correlation between PMH risk factors and infection biomarkers to post treatment mobility. The addition of the aforementioned independent variables to the model explained the 76.2% (R square: 0.762) of the mobility variability as the dependent variable. The post treatment mobility was strongly correlated to neurologic status prior to treatment ( P Figure 3 P Figure 3. Bar Chart Showing the Association of Post Treatment Mobility to the Neurological Status Before Treatment. Blue Bars Represent Patients Without Neurological Deficit, and Red Bars Represent Patients With a Neurological Deficit; Mobility Outcomes are Categorized as Normal or Abnormal Discussion This systematic review represents the most comprehensive synthesis to date of infections following PV and PBK, encompassing 102 patients from 8 studies. The primary findings indicate that although such infections are exceedingly rare, they carry a notable risk of morbidity and mortality. 10 11 Mycobacterium tuberculosis P P The etiology of surgical site infection (SSI) after cement augmentation can be classified as: (1) preexistent spondylitis mistakenly diagnosed as a fracture, (2) infection acquired by direct inoculation during surgical procedure, and (3) infection caused by hematogenous spread.  11  16  11 11 15 16 23 24 According to the presented data, the most common pathogen was M. tuberculosis S. aureus P  25 S. aureus 25 28 Staphylococcus 29 30 S. aureus  10 S. aureus M. tuberculosis  11 M. tuberculosis  13 M. tuberculosis  22 22 31 32 M. tuberculosis Laboratory infection biomarkers, including CRP, ESR and WBC were reported for the majority of patients. ESR and CRP were elevated in 84% and 92% of patients respectively, and serve as supportive tools in the diagnosis of infection. On the other hand, WBC was abnormal in just 22% of the patients, so it is not a reliable biomarker to be used on its own. Despite their use in diagnosis or monitoring, this study demonstrates that infection biomarkers have poor correlation to mortality or mobility. Individuals with risk factors related to PMH, such as immunosuppression, diabetes mellitus, heart disease, CKD, malignancy or pulmonary TB, have increased susceptibility to spinal infections. 10 13 16 21 26 33 In contrast to SSI following other spinal procedures, the optimum treatment protocol for infections following PV or PBK has not been standardized. 29 30 P  34 There was a considerable degree of consistency among studies in the outcome measures, with the majority using mortality, mobility and pain. The mean follow-up was almost 2 years, which is generally adequate, although the broad range varied from 15 days to 8 years. The findings of this systematic review suggest that infections after PV or PBK have a mortality rate of 10.1% which is higher than the overall mortality rate of SSI following spinal surgery which ranges between 1.1% and 7.7%.  35 Pooled mean VAS score was effectively reduced to 2.43 following infection treatment, reflecting a notable improvement in patient-reported pain levels, and suggesting that regardless of the therapeutic approach, successful infection control can lead to notable pain relief. Most of the patients achieved a normal mobility status, followed by patients who used a walker and a wheelchair. Prior neurologic deficit is a strong predictor for post-treatment mobility restriction, as patients with preoperative neurological impairment have a 6-time higher risk of abnormal mobility status, emphasizing the value of early diagnosis and prompt management of these infections. This study is subject to some limitations. Most case series included were retrospective and had a small sample size. In addition, despite the low risk of bias according to JBI tool, selection and information bias are still considerable in case series studies. Another limitation is the inconsistent reporting of microorganism isolation methods, which restricts detailed analysis of diagnostic pathways and may introduce further reporting bias. Preoperative neurologic status was reported inconsistently and heterogeneously across studies. Some of them noted only presence or absence, others provided descriptive terms (eg, paraparesis, radiculopathy) and only 2 studies documented formal graded scales (ASIA and Frankel). For this reason, we did not attempt to apply a uniform grading system in our analysis. While our results confirm that presence of preoperative neurological deficit is the strongest predictor of postoperative mobility, the variability in reporting and the absence of grading in our statistical analysis should be acknowledged as a limitation. Mobility status before vertebral augmentation and at infection diagnosis was not reported and could only be indirectly inferred from the inconsistently described neurological deficits. Therefore, direct comparison across these time points was not possible. In addition, the included studies provided limited and inconsistent data regarding the type or duration of antibiotic regimens, with several failing to specify whether antibiotics were administered at all. Finally, the interpretation of outcomes should ideally be based on quantitative data such as quality of life and neurological status scores, and in the selected cases, data is incomplete. Nevertheless, this review provides the first structured synthesis of clinical characteristics, treatment strategies, and outcomes for post-augmentation spinal infections, offering valuable guidance for clinical decision-making in this rare but serious complication. Conclusion Infections following vertebroplasty or kyphoplasty are rare but serious complications, most commonly caused by Mycobacterium tuberculosis Staphylococcus aureus Supplemental Material Supplemental Material - Infection Following Vertebroplasty or Kyphoplasty: A Systematic Review of Risk Factors, Treatment Options and Outcomes Supplemental Material for Infection Following Vertebroplasty or Kyphoplasty: A Systematic Review of Risk Factors, Treatment Options and Outcomes by Konstantinos Zampetakis, Ioannis M. Stavrakakis, Kosmas Samartzidis, Constantinos Chaniotakis, Christothea-Alexandra Tsiridis, Christos Koutserimpas, Kalliopi Alpantaki, MD, PhD in Global Spine Journal Authors’ Contribution: Funding: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Supplemental Material: ORCID iDs Konstantinos Zampetakis https://orcid.org/0009-0000-5818-0604 Constantinos Chaniotakis https://orcid.org/0000-0002-8935-5566 Data Availability Statement The authors declare that the data supporting the findings of this study are available within the paper and its supplementary information files. This systematic review was registered in Prospero (registration number: CRD42025642112). Available from https://www.crd.york.ac.uk/PROSPERO/view/CRD42025642112 References 1 Patel D Liu J Ebraheim NA Managements of osteoporotic vertebral compression fractures: a narrative review World J Orthop 2022 13 564 573 10.5312/wjo.v13.i6.564 35949707 PMC9244957 2 Long Y Yi W Yang D Advances in vertebral augmentation systems for osteoporotic vertebral compression fractures Pain Res Manag 2020 2020 3947368 10.1155/2020/3947368 33376566 PMC7738798 3 McCall T Cole C Dailey A Vertebroplasty and kyphoplasty: a comparative review of efficacy and adverse events Curr Rev Musculoskelet Med 2008 1 17 23 10.1007/s12178-007-9013-0 19468894 PMC2684146 4 Daher M Kreichati G Kharrat K Sebaaly A Vertebroplasty versus kyphoplasty in the treatment of osteoporotic vertebral compression fractures: a meta-analysis World Neurosurg 2023 171 65 71 10.1016/j.wneu.2022.11.123 36455843 5 Hulme PA Krebs J Ferguson SJ Berlemann U Vertebroplasty and kyphoplasty: a systematic review of 69 clinical studies Spine 2006 31 1983 2001 10.1097/01.brs.0000229254.89952.6b 16924218 6 Röllinghoff M Zarghooni K Schlüter-Brust K et al. Indications and contraindications for vertebroplasty and kyphoplasty Arch Orthop Trauma Surg 2010 130 765 774 10.1007/s00402-010-1083-6 20221618 7 Burton AW Rhines LD Mendel E Vertebroplasty and kyphoplasty: a comprehensive review Neurosurg Focus 2005 18 e1 10.3171/foc.2005.18.3.2 15771389 8 Kim H-J Zuckerman SL Cerpa M Yeom JS Lehman RA Lenke LG Incidence and risk factors for complications and mortality after vertebroplasty or kyphoplasty in the osteoporotic vertebral compression fracture-analysis of 1,932 cases from the American college of surgeons national surgical quality improvement Glob Spine J 2022 12 1125 1134 10.1177/2192568220976355 PMC9210253 33380221 9 Alpantaki K Koutserimpas C Arkoudis NA Hadjiapavlou A Retrograde flow cement leakage during kyphoplasty Maedica (Bucur) 2022 17 74 79 10.26574/maedica.2022.17.1.74 35733760 PMC9168588 10 Abdelrahman H Siam AE Shawky A Ezzati A Boehm H Infection after vertebroplasty or kyphoplasty. A series of nine cases and review of literature Spine J 2013 13 1809 1817 10.1016/j.spinee.2013.05.053 23880354 11 Park JW Park SM Lee HJ Lee CK Chang BS Kim H Infection following percutaneous vertebral augmentation with polymethylmethacrylate Arch Osteoporosis 2018 13 47 10.1007/s11657-018-0468-y 29704173 12 Shin JH Ha KY Kim KW Lee JS Joo MW Surgical treatment for delayed pyogenic spondylitis after percutaneous vertebroplasty and kyphoplasty. Report of 4 cases J Neurosurg Spine 2008 9 265 272 10.3171/SPI/2008/9/9/265 18928223 13 Yuan H Li Y Wang J et al. Spinal infection after vertebral augmentation: a covert complication with serious havoc Arch Orthop Trauma Surg 2024 144 1461 1471 10.1007/s00402-024-05205-9 38273125 14 Zhang H Wang Q Wang G Li G Application of piezosurgery in revision surgery through posterior approach for infection after percutaneous vertebral augmentation: technique note with case series Orthop Surg 2024 16 1239 1245 10.1111/os.14030 38485460 PMC11062852 15 Liao JC Lai PL Chen LH Niu CC Surgical outcomes of infectious spondylitis after vertebroplasty, and comparisons between pyogenic and tuberculosis BMC Infect Dis 2018 18 555 10.1186/s12879-018-3486-x 30419832 PMC6233540 16 Hu X Jiang W Chen Y Wang Y Ma W Revision surgery after cement augmentation for osteoporotic vertebral fracture Orthop Traumatol Surg Res 2021 107 102796 10.1016/j.otsr.2020.102796 33338678 17 Page MJ McKenzie JE Bossuyt PM et al. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 18 Eriksen MB Frandsen TF The impact of patient, intervention, comparison, outcome (PICO) as a search strategy tool on literature search quality: a systematic review J Med Libr Assoc 2018 106 420 431 10.5195/jmla.2018.345 30271283 PMC6148624 19 Munn Z Barker TH Moola S et al. Methodological quality of case series studies: an introduction to the JBI critical appraisal tool JBI Evid Synth 2020 18 2127 2133 10.11124/JBISRIR-D-19-00099 33038125 20 Higgins JPT Thompson SG Deeks JJ Altman DG Measuring inconsistency in meta-analyses BMJ 2003 327 557 560 10.1136/bmj.327.7414.557 12958120 PMC192859 21 Ha KY Kim YH Chang DG Son IN Kim KW Kim SE Causes of late revision surgery after bone cement augmentation in osteoporotic vertebral compression fractures Asian Spine J 2013 7 294 300 10.4184/asj.2013.7.4.294 24353846 PMC3863655 22 Lai PJ Liao JC Chen LH Lai PL Tuberculous spondylitis after percutaneous vertebroplasty: a case series of 9 cases Biomed J 2019 42 285 292 10.1016/j.bj.2019.04.002 31627871 PMC6818148 23 Osterhoff G Scheyerer MJ Spiegl UJA Schnake KJ The role of routine transpedicular biopsies during kyphoplasty or vertebroplasty for vertebral compression fractures in the detection of malignant diseases: a systematic review Arch Orthop Trauma Surg 2023 143 1887 1893 10.1007/s00402-022-04392-7 35233719 PMC10030449 24 Pneumaticos SG Chatziioannou SN Savvidou C Pilichou A Rontogianni D Korres DS Routine needle biopsy during vertebral augmentation procedures. Is it necessary? Eur Spine J 2010 19 1894 1898 10.1007/s00586-010-1388-8 20372942 PMC2989251 25 Cheung WY Luk KDK Pyogenic spondylitis Int Orthop 2012 36 397 404 10.1007/s00264-011-1384-6 22033610 PMC3282872 26 Lener S Hartmann S Barbagallo GMV Certo F Thomé C Tschugg A Management of spinal infection: a review of the literature Acta Neurochir 2018 160 487 496 10.1007/s00701-018-3467-2 29356895 PMC5807463 27 Yee DKH Samartzis D Wong Y-W Luk KDK Cheung KMC Infective spondylitis in Southern Chinese: a descriptive and comparative study of ninety-one cases Spine 2010 35 635 641 10.1097/BRS.0b013e3181cff4f6 20195195 28 Sato K Yamada K Yokosuka K et al. Pyogenic spondylitis: clinical features, diagnosis and treatment Kurume Med J 2019 65 83 89 10.2739/kurumemedj.MS653001 31406038 29 Chaniotakis C Koutserimpas C Tsantes AG et al. Post-discectomy infection: a critical review and suggestion of a management algorithm J Clin Med 2024 13 1478 10.3390/jcm13051478 38592315 PMC10935210 30 Alpantaki K Tsioupros A Koutserimpas C Chaniotakis C Hadjipavlou A Surgical site infections following spinal instrumentation: a review of risk factors and treatment options J Long Term Eff Med Implants 2024 35 47 60 10.1615/JLongTermEffMedImplants.2024051157 40300141 31 Kim HW Min J Choi JY et al. Prevalence of latent tuberculosis infection among participants of the national LTBI screening program in South Korea - a problem of low coverage rate with current LTBI strategy Front Public Health 2022 10 1066269 10.3389/fpubh.2022.1066269 36743163 PMC9892646 32 Tang S Zhang Q Yu J et al. Extensively drug-resistant tuberculosis, China Emerg Infect Dis 2011 17 558 560 10.3201/eid1703.100919 21392462 PMC3166004 33 Tsantes AG Papadopoulos DV Vrioni G et al. Spinal infections: an update Microorganisms 2020 8 4 476 10.3390/microorganisms8040476 Published 2020 Mar 27 32230730 PMC7232330 34 Wu H Cui Y Gong L et al. Comparison between single anterior and single posterior approaches of debridement interbody fusion and fixation for the treatment of mono-segment lumbar spine tuberculosis Arch Orthop Trauma Surg 2022 142 3643 3649 10.1007/s00402-021-03955-4 34021793 PMC9596554 35 Patel H Khoury H Girgenti D Welner S Yu H Burden of surgical site infections associated with select spine operations and involvement of Staphylococcus aureus Surg Infect 2017 18 461 473 10.1089/sur.2016.186 PMC5466015 27901415 ",
  "metadata": {
    "Title of this paper": "Burden of surgical site infections associated with select spine operations and involvement of Staphylococcus aureus",
    "Journal it was published in:": "Global Spine Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479454/"
  }
}