{
  "title": "Paper_50",
  "abstract": "pmc J Orthop Translat J Orthop Translat 3351 jot Journal of Orthopaedic Translation 2214-031X 2214-0328 Chinese Speaking Orthopaedic Society PMC12489922 PMC12489922.1 12489922 12489922 10.1016/j.jot.2025.08.013 S2214-031X(25)00143-3 1 Review Article Histone modifications: Unveiling the epigenetic enigma of degenerative skeletal diseases Zhang Yao a 1 Wang Jiale a b 1 Hua Di c 1 Fan Chunyang a He Wei a d Deng Yongkang a Tang Maoting a e Geng Dechun szgengdc@suda.edu.cn a ⁎ Wu Xiexing wuxiexing@163.com a ⁎⁎ Mao Haiqing maohq@suda.edu.cn a ⁎⁎⁎ a b c d e ⁎ szgengdc@suda.edu.cn ⁎⁎ wuxiexing@163.com ⁎⁎⁎ maohq@suda.edu.cn 1 These authors contributed equally to this work. 11 2025 20 9 2025 55 496134 245 266 1 4 2025 7 8 2025 27 8 2025 20 09 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Degenerative skeletal diseases, including osteoporosis, osteoarthritis, and intervertebral disc degeneration, are prevalent age-related conditions characterized by progressive tissue degeneration and functional decline. Histone modifications are covalent modifications of histone residues, catalyzed by specific enzymes, that modulate chromatin architecture and transcriptional activity. Accumulating evidence highlights the critical involvement of histone modifications in orchestrating disease-associated transcriptional programs. In osteoporosis, histone modifications regulate osteoblast and osteoclast differentiation, thereby disrupting bone homeostasis. In osteoarthritis, they drive the expression of matrix-degrading enzymes in chondrocytes, contributing to cartilage degradation. In intervertebral disc degeneration, they are implicated in nucleus pulposus cell senescence, apoptosis, and extracellular matrix degradation. This review summarizes the distinct mechanistic roles of histone modifications across these conditions and explores the therapeutic potential of targeting histone-modifying enzymes, underscoring epigenetic regulation as a promising strategy for precision intervention in degenerative skeletal diseases. The translational potential of this article: This review comprehensively explores the role of histone modifications in degenerative skeletal diseases and evaluates the potential of histone-modifying enzyme inhibitors as therapeutic targets. These insights provide new strategies and directions for the treatment of degenerative skeletal diseases. Graphical abstract Image 1 Keywords Epigenetics Histone modifications Degenerative skeletal diseases Small molecule inhibitors Epigenetic therapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction A class of age-related disorders known as degenerative skeletal diseases, including osteoporosis (OP), osteoarthritis (OA), and intervertebral disc degeneration (IDD), cause pain and motor difficulties as a result of persistent, long-term deterioration of bone and cartilage [ [1] [2] [3] 4 5 6 7 [8] [9] [10] 2 [11] [12] [13] Epigenetic modifications refer to reversible and heritable covalent modifications of nucleic acids and histones that modulate gene expression without altering the DNA sequence [ 14 15 16 17 Histones are abundant in positively charged basic amino acids and serve as the fundamental structural proteins of eukaryotic chromatin [ 18 19 19 20 21 [22] [23] [24] [25] [26] [27] [28] [29] This review attempts to broadly summarize the recent progress of histone modifications in degenerative skeletal diseases, mainly OP, OA, and IDD, and discuss its potential application value in clinical treatment. To ensure comprehensive and relevant coverage, we conducted a literature search in PubMed, Web of Science, and Scopus databases using keywords such as “histone modification,” “epigenetics,” “osteoporosis,” “osteoarthritis,” and “degenerative skeletal diseases.” The search covered publications from 2000 to 2025, and only peer-reviewed English-language studies were included. 2 Classification of histone modifications Since the initial discovery of histone modifications, their diversity has expanded significantly. According to current literature, more than 20 distinct types of histone post-translational modifications (PTMs) have been identified to date [ 19 30 Table 1 31 32 32 Fig. 1 33 34 Table 1 The overview of histone modifications. Table 1 Histone PTMs Discovery Year Writers Erasers Readers References Acylations Acetylation 1964 HATs(GNATs, MYSTs, P300/CBP) HDACs(HDAC1–11, SIRT1–7) Bromodomain protein(BRD4, PCAF) [ 44 [47] [48] [49] Propionylation 2007 P300/CBP; GNATs; MYSTs SIRT1-3 Bromodomain; YEATS domain [ [67] [68] [69] [70] Butyrylation 2007 P300/CBP; MYSTs SIRT1-3 Bromodomain (BRD4,BPTF); CECR 2; AF1 [ 67 69 70 Formylation 2008 NA NA NA [ 71 Crotonylation 2011 P300/CBP; GNATs; MYSTs HDAC3; SIRT1-3 YEATS domain (AF9; ENL) [ [72] [73] [74] [75] Succinylation 2012 KAT2A; HAT1; P300/CBP SIRT5; SIRT7 NA [ [76] [77] [78] Malonylation 2012 KAT2A SIRT5 NA [ [78] [79] [80] β-hydroxyisobutyrylation 2014 P300/CBP; MYSTs HDAC1-3; SIRT1-3 NA [ [81] [82] [83] β-hydroxybutyrylation 2016 P300/CBP SIRT3; HDAC1-2 NA [ 84 85 Benzoylation 2018 NA SIRT2 YEATS domain (YEATS2; AF9) [ 86 87 Glutarylation 2019 KAT2A SIRT7 NA [ 88 Lactylation 2019 P300/CBP HDAC1-3 Brg1 [ 57 60 89 Ubiquitin-like Ubiquitination 1980 RNF20/40; PRC1(Ring1B); BRCA1/BARD1 USP16, 22; PR-DUB(BAP1) PRC2(Jarid2, AEBP2); RYBP; 53BP1; DNMT1 [ [90] [91] [92] [93] SUMOylation 2003 SAE1/SAE2, UBC9, PIAS SENP1-3, 5–7; DeSI-1,2; USPL1 NA [ [94] [95] [96] Ufmylation 2019 UFL1 UFSP2 STK38 [ 97 98 Others Methylation 1964 SET domain (SUV39H1/2, SETDB1/2, EZH1/2, etc.); Non-SET (Dot1L) FAD-dependent (LSD1/2); JmjC domain (KDM2-8) Chromodomain; MBT and Tudor domain; PHD finger [ 33 40 44 99 Phosphorylation 1966 Kinases (MSK, AMPK, WSTF, CK2, etc.) Phosphatase (PP1, PP2A, PP4, etc.) MDC1, Survivin, 14-3-3 [ 50 [100] [101] [102] [103] ADP-ribosylation 1977 ARTDs (ARTD1-17); ARTCs (ARTC1-5); ADPRT1a; ADPRT2; Sirtuins PARG; TARG1; ARH1; ARH3; MacroD1; MacroD2 PBM; Macrodomain; WWE domain; PBZ domain [ [104] [105] [106] O-GlcNAcylation 1984 OGT OGA NA [ [107] [108] [109] Biotinylation 2001 HCS NA NA [ 110 111 Citrullination 2002 PAD2; PAD4 NA NA [ 75 112 113 Serotonylation 2019 TGM2 TGM2 WDR5 [ [114] [115] [116] Dopaminylation 2020 TGM2 NA NA [ 117 Fig. 1 The classification of histone modifications. Histone modifications are highly diverse, including a wide range of types such as methylation, acetylation, phosphorylation, ubiquitination, and lactylation. Fig. 1 2.1 Histone methylation The discovery of histone methylation dates back to the 1960s [ 35 36 37 Lysine (K) and arginine (R) residues are the primary sites of histone methylation, with the former undergoing mono-(me1), di-(me2), and trimethylation(me3), and the latter undergoing mono-(me1), symmetric-dimethylation(me2s), and asymmetric-dimethylation(me2a) [ 38 39 40 HMTs catalyze the methylation of amino acid residues via S-adenosylmethionine (SAM) [ 41 42 43 HDMs are catalytic enzymes that mediate histone demethylation reactions. There are two kinds of lysine demethylases (KDMs): the lysine-specific demethylases (LSD) family, which mediate mono- and di-demethylation of lysine residues; and the Jumonji C (JmjC) domain-containing protein family, which mediate mono-, di-, or tri-demethylation of lysine residues [ 41 2.2 Histone acetylation The first evidence of the function of histone acetylation in the control of gene expression was shown in 1964 [ 44 45 Histone acetylation occurs mainly at the lysine residues in the N-terminal of histones. Histone acetylation often results in transcriptional activation because it neutralizes the positive charge of histones, which reduces the contact between DNA and histones and facilitates DNA binding to transcription factors [ 46 HATs catalyze the transfer of acetyl groups from acetyl-CoA to histone lysine residues [ 47 48 2+ 49 2.3 Other types of histone modifications Histone phosphorylation is regulated by protein kinases and phosphatases through phosphorylation and dephosphorylation of histone tails [ 50 51 51 52 Histone ubiquitination modification adds a small-molecule protein called ubiquitin (Ub), which comprises 76 amino acids and depends on E1 activating, E2 conjugating, and E3 ligase enzymes, to the lysine residues in histone H2A and H2B tails [ 53 53 54 55 Histone lactylation has rapidly become a key focus in epigenetic research since its discovery in 2019 [ 56 57 58 57 59 60 [61] [62] [63] [64] 65 66 3 The roles of histone modifications in degenerative skeletal diseases Degenerative skeletal diseases are a prevalent and serious group of conditions that impose a substantial burden on individual health and socioeconomic systems. Among these, OP, OA, and IDD are three representative diseases. Histone modifications are vital epigenetic mechanisms that influence gene expression, resulting in alterations to cellular functions. Detailed exploration of histone modifications in the context of each disease is presented in the following sections ( Table 2 Table 3 Table 2 The roles of histone modifications in degenerative skeletal diseases. Table 2 Proteins Histone modification Target genes Cells Biological functions References Osteoporosis LSD1↑ H3K4me2↓ Wnt7b, BMP2↓ BMSCs Inhibits osteogenic differentiation [ 137 GCN5↓ H3K9ac↓ Wnt1, 6, 10a, 10b↓ [ 138 SETDB1↓ H3K9me3↓ OTX2↑ [ 139 KDM3a↓ H3K9me2↑ Erk2↓ [ 140 HDAC8↑ H3K9ac↓ Runx2↓ [ 129 HDAC6↑ H3K9/K14ac, H4K12ac↓ Runx2↓ [ 131 NAP1L2↑ H3K14ac↓ osteogenic gene↓ [ 132 KDM6b↓ H3K27me3↑ Runx2↓ [ 133 PKM2↓ H3K18la↓ osteogenic genes↓ [ 66 CS↓ H3K9ac↓ Runx2↓ [ 144 EZH2↓ H3K27me3↓ P16↑ [ 147 148 SETD2↓ H3K36me3↓ Lbp↓ BMSCs Promotes adipogenic differentiation [ 151 Ash1l↓ H3K4me3↓ Creb↓, PPARγ↑ [ 152 KDM7a↑ H3K9me2, H3K27me2↓ C/EBPα, Sfrp1↑ [ 153 KDM4a↑ H3K9me3↓ C/EBPα, Sfrp4↑ [ 154 BRD4↑ H3K9ac↑ Foxp1↑ [ 155 DOT1L↓, KAT2b↑ H3K79me2↓, H3K27ac↑ miR-181↓, SRSF1↑ BMMs Enhances osteoclast differentiation [ 157 PCAF↑ H3K27ac↑ CXCL12↑ [ 159 RNF40↑ H2BK120ub1↑ TNFSF11/RANKL↑ [ 160 Osteoarthritis HPIP↑ H3K56ac↑ Wnt target genes↑ Human chondrocytes Enhances catabolism [ 173 HOTAIR↑ H3K27me3↑ WIF-1↓ SW1353 [ 174 DOT1L↓ H3K79me2↓ Wnt target genes↑ Human chondrocytes [ 175 Brd3, Brd4↑ H4K5/8/12ac↑ Matrix-degrading enzyme genes↑ SW1353 [ 179 JMJD3↑ H3K27me3↓ ZEB1↑ Human chondrocytes [ 180 KAT6a↑ H3K9ac↑ IHH↑ Human chondrocytes, SW1353, C28/I2 cells [ 182 ACLY↑ H3K9/27ac↑ iNOS, MMP3, MMP13↑ Human and mouse chondrocytes [ 183 LDHA↑ H3K18la↑ TPI1↑ Mouse chondrocytes [ 65 EZH2↑ H3K27me3↑ miR-138↓ Human chondrocytes [ 184 / H3K9me3↓ SOX9,Col2a1↓ ATDC5 cells Inhibits anabolism [ 187 UTX, PRC2↑ H3K27me3↑ Igf2↓ Mouse chondrocytes [ 188 NSD1↓ H3K36me2↓ Osr2↓ Mouse chondrocytes [ 189 JMJD3↑ H3K27me3↓ NR4A1↑ Mouse chondrocytes [ 190 HDAC4↓ H3K9ac↑ ATF4↑ Human chondrocytes Promotes apoptosis [ 196 EZH2↑ H3K27me3↑ miR-142-3p↓ Human chondrocytes Promotes pyroptosis [ 201 NSD1↓ H3K36me2↓ SOX9↓ Mouse chondrocytes Promotes ferroptosis [ 205 LDHB↑ H3K18la↑ ACSL4↑ Mouse chondrocytes [ 206 Intervertebral disc degeneration RREB1↓ H3K4me2/3↑, H3K9/27me3↓ ADAMTS-5↑ Human NP cells Mediates ECM degradation [ 228 SIRT6↓ H3K9ac↑ NF-κB target genes↑ Human NP cells [ 231 KMT2D↑ H3K4me1↑ Mmp3/9/13↑ Human NP cells [ 234 EZH2↑ H3K27me3↑ Sox-9↓ Primary rat endplate chondrocytes [ 265 EZH2↑ H3K27me3↑ miR-129-5p↓ Human NP cells Mediates NPC senescence [ 240 SIRT6↓ H3K9ac↑ p-NF-κB p65↑ Human NP cells [ 241 EZH2↓ H3K27me3↓ NOX4↑ Primary rat NP cells [ 245 KDM4a↑ H3K9me3↓ ALKBH5↑ Human NP cells [ 248 KDM5a↓ H3K4me3↑ WTAP↑ Human NP cells [ 246 KMT2D↑ H3K4me2↑ miR-133a-5p↑ Primary mouse NP cells Promotes apoptosis [ 254 EZH2↑ H3K27me3↑ DKK1↓ Primary rat NP cells Promotes pyroptosis [ 256 GLS1↓ H3K9/K27ac↓ NFS1↓ Human NP cells Promotes ferroptosis [ 259 LDHA↑ H3K18la↑ ACSL4↑ Human NP cells [ 260 Table 3 Classification of histone modification-related proteins and metabolites in degenerative skeletal diseases. Table 3 Category Enzymes Histone Modification Target Genes Diseases References Writers Histone acetyltransferases GCN5 H3K9ac Wnt1, 6, 10a, 10b Osteoporosis [ 138 KAT2b/PCAF H3K27ac SRSF1, CXCL12 Osteoporosis [ 157 159 KAT6a H3K9ac IHH Osteoarthritis [ 182 Histone methyltransferases SETDB1 H3K9me3 OTX2 Osteoporosis [ 139 EZH2 H3K27me3 P16, miR-138, miR-142-3p, Sox-9, miR-129-5p, NOX4, DKK1 Osteoarthritis/Intervertebral Disc Degeneration [ 148 184 187 201 240 245 256 265 SETD2 H3K36me3 Lbp Osteoporosis [ 151 Ash1l H3K4me3 Creb, PPARγ Osteoporosis [ 152 DOT1L H3K79me2 miR-181, Wnt target genes Osteoporosis/Osteoarthritis [ 157 175 PRC2 H3K27me3 Igf2 Osteoarthritis [ 188 NSD1 H3K36me2 Osr2, SOX9 Osteoarthritis [ 189 205 KMT2D H3K4me1/2 Mmp3/9/13, miR-133a-5p Intervertebral Disc Degeneration [ 234 254 Erasers Histone demethylases LSD1 H3K4me2 Wnt7b, BMP2 Osteoporosis [ 137 JMJD3 H3K27me3 ZEB1, NR4A1 Osteoarthritis [ 180 190 UTX H3K27me3 Igf2 Osteoarthritis [ 188 KDM3a H3K9me2 Erk2 Osteoporosis [ 140 KDM4a H3K9me3 C/EBPα, Sfrp4, ALKBH5 Osteoporosis/Intervertebral Disc Degeneration [ 154 248 KDM5a H3K4me3 WTAP Intervertebral Disc Degeneration [ 246 KDM6b H3K27me3 Runx2 Osteoporosis [ 133 KDM7a H3K9me2, H3K27me2 C/EBPα, Sfrp1 Osteoporosis [ 153 Histone deacetylases HDAC4 H3K9ac ATF4 Osteoarthritis [ 196 HDAC6 H3K9/K14ac, H4K12ac Runx2 Osteoporosis [ 131 HDAC8 H3K9ac Runx2 Osteoporosis [ 129 SIRT6 H3K9ac NF-κB targets genes Intervertebral Disc Degeneration [ 231 241 Readers Histone acetylation reader BRD3 H4K5/8/12ac Matrix-degrading enzymes Osteoarthritis [ 155 179 BRD4 H3K9ac Foxp1 Osteoporosis [ 179 Metabolic precursors Acetyl-CoA CS H3K9ac Runx2 Osteoporosis [ 144 ACLY H3K9/27ac iNOS, MMP3, MMP13 Osteoarthritis [ 183 GLS1 H3K9/K27ac NFS1 Intervertebral Disc Degeneration [ 259 Lactate PKM2 H3K18la Osteogenic genes Osteoporosis [ 66 LDHA H3K18la TPI1 Osteoarthritis [ 65 260 LDHB H3K18la ACSL4 Osteoarthritis/Intervertebral Disc Degeneration [ 206 Others E3 ubiquitin ligase RNF40 H2BK120ub1 TNFSF11/RANKL Osteoporosis [ 160 Histone chaperone NAP1L2 H3K14ac Osteogenic genes Osteoporosis [ 132 3.1 Histone modifications and osteoporosis Osteoporosis, a degenerative metabolic bone disease, is characterized by low bone mass, increased bone fragility, and microstructural destruction of bone tissue, which greatly increases the incidence of fragility fracture and brings tremendous pressure on the healthcare system and economy [ [118] [119] [120] 121 122 Bone is in a continuous process of renewal and metabolism called bone remodeling [ 123 124 125 126 118 126 127 Fig. 2 Fig. 2 Histone modifications-induced bone homeostasis dysregulation in OP pathogenesis. Histone modifications disrupt bone homeostasis and contribute to the occurrence and development of OP by inhibiting osteogenic differentiation, promoting adipogenic differentiation, and enhancing osteoclast differentiation. Fig. 2 3.1.1 Histone modifications inhibit osteogenic differentiation 3.1.1.1 Histone modifications mediate disruption of osteogenic regulatory networks Runx2 is a major transcription factor during osteogenic differentiation and binds to cis-acting elements to transactivate major osteogenic matrix protein genes, which promote osteogenic differentiation and bone formation [ 128 [129] [130] [131] Hu et al. found that elevated levels of the histone chaperone NAP1L2 suppressed osteogenic gene expression, including Runx2, by recruiting SIRT1 to decrease H3K14ac levels at their promoters, thereby inhibiting osteogenic differentiation [ 132 133 133 The Wnt/β-catenin signaling pathway is a pivotal regulator across multiple degenerative skeletal diseases, governing the fate and phenotype of bone-related cells, including bone marrow mesenchymal stem cells (BMSCs), osteoblasts, chondrocytes, and osteoclasts [ [134] [135] [136] 136 Sun et al. demonstrated that the histone demethylase LSD1 repressed BMSC osteogenic differentiation by reducing H3K4me2 levels at the promoters of Wnt7b and Bmp2, thereby downregulating their expression and bone formation [ 137 138 139 139 140 3.1.1.2 Histone modifications mediate metabolism-associated osteogenic dysfunction Recent research focuses on the crucial role of cellular metabolism in osteogenic differentiation of BMSCs and osteoblasts [ 141 142 143 144 In addition to acetylation, histone lactylation, a novel modification derived from lactate produced during glycolysis, has emerged as an important epigenetic regulator. Increasing evidence indicates that lactate-induced histone lactylation enhances chromatin accessibility and activates the gene transcription [ 57 145 146 66 66 In addition, by triggering the senescence signaling pathway, histone modification accelerates the cellular senescence of BMSCs, which decreases their osteogenic differentiation and proliferation abilities, promotes apoptosis, and disrupts bone homeostasis [ 147 148 3.1.2 Histone modifications mediate osteogenic-adipogenic differentiation imbalance Although BMSCs are multipotent stem cells with three-lineage differentiation potential of osteogenesis, adipogenesis, and chondrogenesis, many investigations have revealed that the differentiation of BMSCs into osteogenic and adipogenic lineages is negatively correlated [ 149 149 150 Histone methyltransferases regulate osteogenic-adipogenic differentiation. Wang et al. found that lipopolysaccharide-binding protein (Lbp) regulated by SETD2-mediated H3K36me3, controlled the equilibrium between BMSCs' osteogenic and adipogenic differentiation [ 151 152 152 Histone demethylases regulate osteogenic-adipogenic differentiation. Wang et al. observed that by decreasing H3K9me2 and H3K27me2 levels at the promoters of C/EBPα and Sfrp1, KDM7a upregulated their expression. This, in turn, enhanced adipogenic differentiation and suppressed osteogenic differentiation by interacting with PPARγ and blocking Wnt signaling [ 153 154 Lian et al. also reported a mechanism by which histone acetylation Readers regulate osteogenic-adipogenic differentiation. This study revealed that BMSCs from the glucocorticoid-induced OP model had an elevated expression of BRD4, a histone acetylation reader that promoted Foxp1 expression by binding to H3K9ac at the Foxp1 promoter. As a transcription factor, Foxp1 promotes the transcription of PPARγ2 and enhances adipogenic differentiation [ 155 3.1.3 Histone modifications enhance osteoclast differentiation The mechanism by which histone methylation regulates osteoclast differentiation has been reported in several studies [ [156] [157] [158] 157 157 159 160 160 In conclusion, histone modifications lead to the imbalance of bone homeostasis by suppressing osteogenic differentiation, mediating the disproportion between osteogenic and adipogenic differentiation, enhancing osteoclast differentiation, and ultimately promoting the progression of OP. 3.2 Histone modifications and osteoarthritis Osteoarthritis is a degenerative joint disease characterized by the gradual breakdown of articular cartilage, secondary synovitis, and bone remodeling [ 161 162 9 163 24 164 165 Fig. 3 Fig. 3 Histone modifications disrupt chondrocyte function and contribute to OA development. They promote OA progression by enhancing catabolic processes, inhibiting anabolic activities, and inducing chondrocyte death. Fig. 3 3.2.1 Histone modifications regulate extracellular matrix Articular cartilage mainly refers to hyaline cartilage, which consists of chondrocytes, extracellular matrix (ECM), and water, and is a non-vascularized tissue that enables joint movement by providing a smooth surface with minimal friction [ 166 167 168 169 3.2.1.1 Histone modifications enhance catabolism Wnt signaling, which is epigenetically suppressed in OP to inhibit osteogenesis, is abnormally hyperactivated in OA, driving the expression of matrix-degrading enzymes and disrupting cartilage homeostasis [ [170] [171] [172] 173 173 174 174 175 175 176 It has been demonstrated that the development of OA is linked to persistent, low-grade inflammation. Inflammatory factors cause the production of catabolic factors MMPs and ADAMTS to be upregulated, which disturbs cartilage homeostasis and accelerates the progression of OA [ 177 178 179 179 180 180 Senescent chondrocytes secrete senescence-associated secretory phenotype (SASP), including matrix-degrading protease MMPs, ADAMTSs, and inflammatory cytokines IL-1, TNF-α, which induce OA inflammation and ECM degradation, disrupt cartilage homeostasis, and ultimately result in the development of OA [ 181 182 182 Emerging evidence suggests that metabolic reprogramming in OA not only affects energy supply but also shapes the epigenetic landscape of chondrocytes, thereby influencing gene expression and cartilage homeostasis. Chen et al. reported a mechanism by which altered glucose metabolism in OA affects histone modifications and thus regulates matrix metabolism [ 183 183 65 184 184 3.2.1.2 Histone modifications inhibit anabolism Major components of ECM include type II collagen and aggrecan, whose gene expression is controlled by transcription factor SOX9, a major cartilage regulatory factor [ 185 186 187 188 188 188 The dual regulatory impacts of histone methylation on anabolism and catabolism were described by Shao et al. and Jin et al. [ 189 189 189 190 190 3.2.2 Histone modifications in other OA pathological processes Beyond disrupted cartilage metabolism, OA involves chondrocyte death, synovial inflammation and subchondral bone formation [ 191 3.2.2.1 Chondrocyte death Chondrocyte death, including apoptosis, pyroptosis, and ferroptosis, is a hallmark of OA and accelerates cartilage degradation [ 192 193 Apoptosis, the earliest recognized form of programmed cell death (PCD), is a tightly regulated, non-inflammatory process that eliminates damaged or dysfunctional cells [ 194 193 195 196 ERT2 fl/fl 197 190 198 Pyroptosis is an inflammation-related PCD, triggered by the assembly of inflammasomes and activation of specific caspases, including caspase-1 and caspase-4/5/11 [ 199 200 201 Ferroptosis, a newly identified PCD characterized by iron-dependent lipid peroxidation, is driven by elevated intracellular free iron, glutathione depletion, and GPX4 inactivation, resulting in the membrane lipid peroxide accumulation and loss of cellular integrity [ 202 203 204 205 206 3.2.2.2 Synovial inflammation and subchondral bone remodeling Synovial inflammation is a key pathological feature in the development of OA. Although OA has traditionally been regarded as a cartilage degenerative disease, increasing evidence indicates that synovial inflammation contributes to OA onset and progression [ 207 208 209 210 211 Subchondral bone remodeling imbalance is a key pathological feature of OA. During disease progression, the subchondral bone undergoes increased bone density, trabecular thickening, and osteophyte formation [ 212 213 214 188 215 216 In summary, histone modifications play a central role in OA progression by enhancing catabolic activity, suppressing anabolic pathways, and disturbing cartilage homeostasis. Beyond these well-established mechanisms, emerging evidence suggests their involvement in chondrocyte death, synovial inflammation, and subchondral bone remodeling. However, research in these areas remains scarce, leaving their precise roles largely undefined. Future studies should aim to elucidate these mechanisms and explore the therapeutic potential of targeting histone modifications to develop epigenetic-based strategies for OA management. 3.3 Histone modifications and intervertebral disc degeneration Intervertebral disc degeneration, a spinal degenerative disease characterized by progressive deterioration of the structure and function of the nucleus pulposus (NP), annulus fibrosus (AF), and cartilage endplate (CEP), is the leading cause of lower back pain (LBP), which leads to a serious disease burden worldwide [ 9 [217] [218] [219] 220 221 Fig. 4 Fig. 4 Histone modifications contribute to nucleus pulposus and cartilage endplate degeneration in intervertebral disc disease. They accelerate ECM degradation, induce nucleus pulposus cell senescence and death, and promote cartilage endplate degeneration. Fig. 4 3.3.1 Histone modifications in extracellular matrix homeostasis The extracellular matrix (ECM) refers to the non-cellular components within tissues, which offer structural support to cells and establish a microenvironment favorable for cell survival while regulating a range of cellular physiological functions [ 222 223 224 225 225 ADAMTS is one of the major ECM-degrading enzymes that recognize ECM components through its thrombospondin motifs [ 226 227 228 By increasing the synthesis of associated matrix-degrading enzymes, the NF-κB signaling pathway facilitates ECM degradation [ 229 230 231 231 Oxidative stress refers to cellular oxidative damage caused by the excessive production and insufficient clearance of reactive oxygen species (ROS) [ 232 233 2 2 234 234 3.3.2 Histone modifications in nucleus pulposus cell senescence Intervertebral disc degeneration, an age-related affliction, is intricately intertwined with cellular senescence. Senescent nucleus pulposus cells unleash SASPs, unleashing a cascade of inflammatory cytokines and degradation factors such as MMPs and ADAMTS, thereby fueling extracellular matrix (ECM) degradation and accelerating IDD progression [ 235 During IDD, inflammation and NPC senescence of are highly intertwined. Chronic inflammatory cytokines, such as TNF-α and IL-1β, activate inflammatory signaling pathways like NF-κB, inducing cell cycle arrest and the expression of SASPs, thereby promoting inflammatory senescence [ 236 [237] [238] [239] 240 230 241 242 243 NADPH oxidase 4 (NOX4)-associated oxidative stress emerges as one of the driving factors of NPC senescence [ 244 245 245 Emerging evidence underscores the role of a synergistic interplay between histone modifications and m6A methylation in driving NPC senescence and accelerating IDD. Li et al. and Wu et al. reported the synergistic interaction between m6A methyltransferases WTAP and METTL3 and histone methylation. Li et al. discovered that in TNF-α-induced senescent NP cells, the expression of lysine demethylase KDM5a markedly decreases, leading to heightened histone H3K4me3 epigenetic modification in the promoter region of m6A methyltransferase WTAP, thereby promoting its transcription [ 246 246 247 248 248 3.3.3 Histone modifications in nucleus pulposus cell death NPC death, including apoptosis, pyroptosis, and ferroptosis, plays a pivotal role in the initiation and progression of IDD [ 199 249 Apoptosis, a classic form of cell death, contributes to progressive cell loss, cytokine release, and ECM degradation in IDD, thereby accelerating structural deterioration and functional impairment of the intervertebral disc [ 249 250 251 252 252 253 254 Pyroptosis, an inflammatory mode of cell death, is increasingly recognized as a key driver of IDD progression [ 255 255 256 Ferroptosis, an iron-dependent form of cell death driven by lipid peroxidation, has recently attracted attention for its potential role in IDD. Iron overload and ferroptosis upregulate MMP3 and MMP13 while downregulating type II collagen, thereby accelerating ECM degradation and structural deterioration of the intervertebral disc [ 257 258 2+ 259 260 3.3.4 Histone modifications in cartilage endplate and annulus fibrosus degeneration The cartilage endplate (CEP) is essential for intervertebral disc health, facilitating nutrient exchange and providing biomechanical support [ 261 [262] [263] [264] 265 265 The annulus fibrosus (AF) is a critical component of the intervertebral disc, composed of concentric lamellae of collagen fibers that provide tensile strength and maintain disc integrity [ 217 266 267 268 269 In summary, histone modifications are emerging as key regulators in IDD, influencing ECM degradation, NPC senescence, multiple forms of regulated cell death, and potentially cartilage endplate and annulus fibrosus degeneration. Nevertheless, current research on histone modifications remains largely focused on nucleus pulposus, with limited understanding of their roles in other disc components. Future studies should aim to comprehensively elucidate these mechanisms and explore histone-modifying enzymes as promising therapeutic targets for IDD. 4 Histone-modifying enzymes provide the potential therapeutic targets for degenerative skeletal diseases In light of the crucial roles of histone modifications and their modifying enzymes in degenerative skeletal diseases, the exploration of small-molecule modulators including inhibitors and activators targeting these histone-modifying enzymes holds promise for treatment. Currently, small-molecule inhibitors targeting histone-modifying enzymes have made significant advances, especially in oncology, where they have shown promising therapeutic effects. However, their clinical application in degenerative skeletal diseases remains largely unexplored, with no clinical trials reported so far. Numerous preclinical studies have demonstrated their potential to slow disease progression, highlighting the urgent need for further translational research and early-phase clinical trials ( Table 4 Table 4 Small-molecule modulators of histone modification and their effects on degenerative skeletal diseases. Table 4 Classification Small molecules Targets Diseases Experimental model/subjects Pharmacological functions References HMT inhibitors Tazemetostat EZH2 osteoarthritis IL-1β-induced chondrocytes; meniscectomy mice reduces inflammation and catabolism; reduces cartilage degradation and joint pain [ 274 DZNep EZH2 osteoarthritis IL-1β-induced chondrocytes reduces MMPs expression [ 275 HDM inhibitors GSK2879552 LSD1 osteoporosis RANKL-treated BMMs; OVX mice inhibits RANKL-induced osteoclast differentiation; prevents cortical bone loss [ 278 KDM5A-IN-1 KDM5C osteoporosis RANKL-treated BMMs inhibits RANKL-induced osteoclast differentiation [ 279 GSK-J4 KDM6A osteoarthritis DMM mice reduces articular cartilage loss and synovial hyperplasia [ 215 GSK-J4 JMJD3 osteoarthritis IL-1β-induced chondrocytes; DMM mice inhibits inflammation and catabolism; prevents cartilage degradation [ 280 Daminozide KDM2/7 osteoarthritis C28/I2 cells; DMM mice increases anabolism; reduces cartilage degradation and osteophyte [ 281 HAT inhibitors A-485 p300/CBP osteoporosis RANKL-treated BMMs; OVX mice inhibits RANKL-induced [ 285 Salidroside PCAF osteoarthritis TNF-α-induced chondrocytes; DMM mice inhibits ECM degradation, inflammation, and apoptosis; alleviates cartilage destruction and synovitis [ 286 HDAC inhibitors Vorinostat class I and II HDAC osteoarthritis IL-1β-induced chondrocytes inhibits the expression of catabolic markers [ [290] [291] [292] Vorinostat class I and II HDAC osteoporosis RANKL-treated BMMs; OVX mice inhibits RANKL-induced [ 293 Panobinostat HDAC osteoarthritis ACLT rats attenuates subchondral bone remodeling, cartilage degradation, and articular cartilage hypertrophy; alleviates pain [ 295 Panobinostat HDAC osteoarthritis IL-1β-induced chondrocytes; DMM mice inhibits catabolism; attenuates cartilage degradation, subchondral bone remodeling, and synovitis [ 296 Chidamide benzamide-type HDAC osteoporosis adipogenic medium-induced BM-MSCs suppresses adipogenic differentiation of BM-MSCs [ 298 Chidamide benzamide-type HDAC osteoarthritis ACLT rats reduces cartilage degradation, osteophyte formation, and pain [ 314 Tubastatin A HDAC6 osteoarthritis DMM mice inhibits cartilage degradation and synovial tissue thickening; alleviates hyperalgesia [ 299 Tubastatin A HDAC6 osteoarthritis TBHP-induced chondrocytes; DMM mice reduces apoptosis, oxidative stress, and ECM degradation, and enhances autophagy in chondrocytes; inhibits cartilage degradation and aberrance [ 300 ACY-1215 HDAC6 osteoarthritis IL-1β-induced chondrocytes decreases the expression of catabolic markers and promotes the expression of COL2A1 [ 301 SIRT1 activator Resveratrol SIRT1 osteoporosis H 2 2 enhances proliferation, differentiation, and suppresses apoptosis 2 2 [ 327 Resveratrol SIRT1 osteoporosis postmenopausal women slows bone loss in the lumbar spine and femoral neck [ 328 Resveratrol SIRT1 osteoarthritis DMM mice inhibits cartilage degradation, subchondral bone remodeling [ 330 Resveratrol SIRT1 osteoarthritis postmenopausal women reduce chronic pain in age-related osteoarthritis and improve menopause-related quality of life in postmenopausal women [ 331 Resveratrol SIRT1 intervertebral disc degeneration NPCs inhibited NPCs apoptosis and promoted ECM synthesis [ 333 Note: BMMs: bone marrow-derived macrophages; OVX: ovariectomy; DMM: destabilized medial meniscus; ACLT: anterior cruciate ligament transection. 4.1 HMT inhibitors Numerous inhibitors targeting histone methyltransferases (HMTs) have been identified and developed, with EZH2 inhibitors demonstrating significant advancements in drug development. In particular, in January 2020, the FDA approved Tazemetostat, the first EZH2 inhibitor in the world that was co-developed by Epizyme and Eisai, for marketing to treat epithelioid sarcoma [ 270 271 Multiple investigations have revealed elevated EZH2 expression levels in degenerative skeletal diseases (OP, OA, IDD), strongly associated with disease progression [ 265 272 273 265 272 273 274 274 275 4.2 HDM inhibitors Histone demethylase (HDM) inhibitors can be categorized into two main groups: those aimed at LSD1/KDM1A and those targeting the JMJC subfamily. The former group of inhibitors has advanced more rapidly than the latter group, with numerous drugs currently progressing through clinical phases II and III, primarily for the treatment of hematological, lymphatic disorders, and neoplasms [ 276 277 GSK2879552, an LSD1 inhibitor, has demonstrated the efficacy of reducing RANKL-induced osteoclast differentiation, while also exhibiting the capacity to partially ameliorate cortical bone loss induced by OVX in murine models of OP [ 278 279 215 280 281 4.3 HAT inhibitors HAT inhibitors function by targeting the bromodomain and HAT domains of histone acetyltransferases (HATs) [ 282 283 284 284 CBP/p300 inhibitor A-485 has shown promise in protecting against OP. According to Huo et al., A-485 reduced OVX-induced bone loss in the mouse model in vivo and suppressed osteoclast-specific gene expression and osteoclast differentiation in vitro [ 285 286 4.4 HDAC inhibitors Since the first HDAC inhibitor, trichostatin A, was discovered more than three decades ago, a great deal of progress has been achieved in the drug development of HDAC inhibitors [ 287 288 The effectiveness of vorinostat, panobinostat, and chidamide in treating degenerative skeletal diseases has been substantiated by extensive preclinical research. Vorinostat, FDA-approved in 2006 for cutaneous T-cell lymphoma treatment [ 289 [290] [291] [292] 293 294 295 296 297 298 299 [299] [300] [301] These studies indicate that HDAC inhibitors exhibit tissue-protective effects, making them promising candidates for the treatment of degenerative skeletal diseases. Nevertheless, further clinical trials are necessary to confirm their efficacy and safety. 4.5 Translational potential and challenges of histone-targeted therapeutics Epigenetic modulation through histone modification has emerged as a promising therapeutic approach for degenerative skeletal diseases. As outlined above, small-molecule inhibitors targeting histone-modifying enzymes have demonstrated compelling preclinical efficacy. These small-molecule inhibitors have been demonstrated to regulate critical pathological processes underlying disease progression, including inflammation, extracellular matrix degradation, and apoptosis. Importantly, they have not only reversed disease phenotypes in vitro but also improved tissue integrity and function in relevant animal models, highlighting their therapeutic value. In addition, their extensive exploration and application in the oncology field have provided valuable insights for their potential translation to orthopedic disorders. Despite these encouraging preclinical findings, substantial challenges still hinder the clinical translation of histone-modifying enzyme inhibitors for degenerative skeletal diseases. 4.5.1 Challenges in clinical translation Suboptimal pharmacokinetic characteristics remain a major obstacle to the clinical development of histone-modifying enzyme inhibitors. A substantial proportion of histone-modifying agents exhibit poor aqueous solubility, limited drug permeability, low oral bioavailability, rapid systemic clearance, and short plasma half-lives [ 302 303 302 −6 304 304 305 306 305 306 Moreover, side effects, toxicity, and resistance also limit the clinical application of histone-modifying enzyme inhibitors. Notably, HDAC inhibitors have been shown to induce a variety of adverse effects, including gastrointestinal reactions, myelosuppression, and cardiac toxicity [ 307 308 307 309 To tackle the challenges outlined above, substantial efforts have been directed towards several critical areas. 4.5.2 Innovations in drug delivery systems The development of innovative delivery approaches, including prodrugs, nanoparticle-based delivery systems, and proteolysis targeting chimeras (PROTACs), has garnered significant attention [ 302 310 311 311 312 313 Epigenetic drug delivery systems utilizing nanoparticles have emerged as a prominent area of research. A diverse array of nanocarriers, including lipid-based, polymeric-based, protein-based, and inorganic-based nanocarriers, have been explored for their potential in drug development [ 303 314 314 315 PROTACs are emerging as an innovative and promising strategy in drug development, particularly in regulating epigenetic processes. These bifunctional molecules induce selective degradation of target proteins by recruiting an E3 ubiquitin ligase and initiating ubiquitin proteasome system [ 316 317 318 4.5.3 Development of isoform-selective small-molecule inhibitors Given the toxic side effects associated with non-selective histone modification inhibitors, the development of isoform-selective inhibitors is critical for enhancing drug safety and facilitating their broader clinical application. Among these, the development of isoform-selective HDAC inhibitors has seen the most significant advancements. HDAC inhibitors are generally classified according to their selectivity for specific HDAC isoforms, such as HDAC1, HDAC2, and HDAC3 [ 319 320 321 322 323 4.5.4 Advancements in dual-/multi-target small-molecule inhibitors Due to the complexity of diseases, single-target therapies often exhibit limited efficacy, along with challenges such as drug resistance and toxicity [ 320 309 Currently, a diverse array of multi-target HDAC inhibitors has been designed. Dual or multi-target drugs that simultaneously target HDAC and transcription factors have shown enhanced therapeutic effects. Tilekar et al. designed and synthesized a series of novel TZD-based naphthylidene derivatives aimed at simultaneously targeting HDAC and PPARγ for cancer therapy [ 324 325 4.5.5 Identification and development of natural epigenetic modulators Natural compounds, particularly those derived from traditional Chinese medicine, have attracted increasing interest as potential epigenetic modulators for the treatment of skeletal disorders. Among them, resveratrol, a natural activator of SIRT1, has been identified to exert an osteoprotective role in various studies [ 326 327 328 329 330 331 332 333 Although preclinical studies have demonstrated the therapeutic potential of histone-modifying modulators in alleviating degenerative skeletal diseases, their clinical translation remains hindered by challenges such as suboptimal pharmacokinetics, systemic toxicity, adverse effects, and drug resistance. Future research should focus on improving drug delivery strategies, advancing the design of isoform-specific inhibitors, developing dual- or multi-target agents, and initiating early-phase clinical trials. Moreover, a deeper understanding of their molecular mechanisms and epigenetic context is essential for bridging the gap between experimental findings and clinical application. 5 Conclusion and prospects In summary, histone modification contributes significantly to the pathogenesis of degenerative skeletal diseases. Abnormalities in histone modification induced by various pathogenic factors affect the normal physiological functions of cells by influencing crucial genes expression, promoting tissue degeneration, and leading to the onset and progression of diseases. In this paper, we reviewed the role of histone modification on major degenerative bone diseases (OP, OA, IDD), discussed the research progress of their related regulatory mechanisms, and provided some elaboration and prospects for the therapeutic role and application of histone modifying enzyme modulators in degenerative skeletal diseases. Compared to existing reviews, such as Sun P et al. (2022) on OP and Ma Z et al. (2023) on EZH2 in musculoskeletal diseases, this review takes a more comprehensive approach. While Sun et al. focus on OP, our review also includes other degenerative skeletal diseases. Additionally, while Ma et al. focus on EZH2, we cover a variety of histone-modifying enzymes and their diverse roles in disease pathogenesis, offering new insights and therapeutic avenues. Another strength of our review is the in-depth discussion of histone-modifying enzyme inhibitors, highlighting their therapeutic potential and clinical translation challenges, such as pharmacokinetic issues, toxicity, and side effects. We also emphasize the gaps in clinical trial data for degenerative skeletal diseases, underscoring the need for further research to move from preclinical findings to clinical applications. However, current research on histone modifications in degenerative skeletal diseases still faces several limitations. First, there is insufficient exploration of the cell-specific effects of histone modifications. While many studies focus on histone modifications in BMSCs, osteoblasts, and chondrocytes, research on other cell types, such as synovial cells, subchondral bone cells, cartilage endplate cells, and annulus fibrosus cells, remains relatively underexplored. This results in an incomplete understanding of histone modifications in different cell types, thereby hindering a comprehensive elucidation of their multifaceted regulatory roles in degenerative skeletal diseases. Second, there is an imbalance in the types of histone modifications studied, with a predominant emphasis on methylation and acetylation, while other modifications, such as phosphorylation, ubiquitination, and lactylation, have been less extensively investigated in the context of degenerative skeletal diseases. Third, research on the interactions between histone modifications and other disease pathways is limited. Most studies are confined to isolated signaling pathways or specific epigenetic modifications, neglecting the intricate interplay within broader disease networks. Fourth, there is a gap in the translation of basic research into clinical applications. Current studies on histone modifications in skeletal diseases are predominantly confined to cell and animal models, with limited clinical validation. Fifth, the development of pertinent therapeutic agents and their clinical applications remain fraught with challenges. Although numerous therapeutic agents have been developed, issues related to pharmacokinetics, toxicity, adverse effects, and drug resistance continue to curtail their clinical efficacy. Consequently, future research should focus on several key areas. One important direction is comprehensive mechanistic exploration, which involves further investigation into the role of histone modifications across a broader spectrum of cell types and modification types. Emphasis should be placed on elucidating the intricate interactions within complex mechanisms to gain a more holistic understanding of their pathogenic role in degenerative skeletal diseases. Another critical area is translational research, including the initiation of further clinical trials to substantiate the clinical relevance of histone modifications and their potential therapeutic applications. Finally, innovative drug development should be prioritized, advancing the development of cutting-edge drug delivery systems, enhancing the selectivity of histone-modifying agents, and designing multi-target therapeutic strategies to address the complexity and heterogeneity of degenerative skeletal diseases. In addition, the integration of emerging technologies such as single-cell sequencing and gene editing offers powerful tools to dissect histone modification patterns at single-cell resolution and functionally validate their roles in specific cellular subpopulations. These approaches are expected to provide deeper insights into the epigenetic landscape within the pathological microenvironment and facilitate the identification of novel, more precise therapeutic targets. Currently, single-cell RNA-seq studies have revealed distinct subpopulations of chondrocytes with unique transcriptional profiles in osteoarthritic cartilage, highlighting cell-specific pathogenic mechanisms [ 334 335 336 In conclusion, histone modification plays an important role in the regulation of degenerative skeletal diseases, and further exploration of the related pathogenesis and the development of related targeted drugs are of great significance for the treatment of diseases. Data availability Data sharing not applicable to this article as no datasets were generated or analysed during the current study. Author contributions Yao Zhang, Jiale Wang and Di Hua drafted the manuscript, designed, and developed the figures and tables; Dechun Geng, Xiexing Wu, and Haiqing Mao conceptualized and structured the article, polished the language of this manuscript, and supervised and revised the work critically for important intellectual content; Chunyang Fan selected the title, conducted a literature review, and proofread the first draft; Wei He, Yongkang Deng, Maoting Tang collected related papers and supervised this work. All authors have read and approved the final manuscript and agree to its publication in the journal. Funding This work was supported by the 10.13039/501100001809 National Natural Science Foundation of China 81972104 82272547 82572793 Postdoctoral Science Foundation Project of China 2024M752336 10.13039/501100004608 Natural Science Foundation of Jiangsu Province BK20220252 BK20241795 Suzhou Key Clinical Disease Diagnosis and Treatment Technology Special Project LCZX202203 10.13039/501100007824 Soochow University BXLC017 Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Ikegawa S. The genetics of common degenerative skeletal disorders: osteoarthritis and degenerative disc disease Chakravarti A. Green E. Annual review of genomics and human genetics vol. 14 2013 Annual Reviews Palo Alto 245 256 14 10.1146/annurev-genom-091212-153427 24003854 2 Yin PB Jiang YH Fang X Wang DF Li Y Chen M Cell-Based therapies for degenerative musculoskeletal diseases Adv Sci 10 21 2023 10.1002/advs.202207050 PMC10375105 37199688 3 Chen YW Huang JY Tang CQ Chen X Yin Z Heng BC Small molecule therapeutics for inflammation-associated chronic musculoskeletal degenerative diseases: past, present and future Exp Cell Res 359 1 2017 1 9 28739444 10.1016/j.yexcr.2017.07.027 4 Li HZ Liang XZ Sun YQ Jia HF Li JC Li G Global, regional, and national burdens of osteoarthritis from 1990 to 2021: findings from the 2021 global burden of disease study Front Med 11 2024 1476853 10.3389/fmed.2024.1476853 PMC11602326 39610688 5 Chen S Chen MJ Chen C Xie C Yu YH Shao ZW Epidemiological trends and characteristics of osteoarthritis in China during 1990-2021 J Orthop Translat 51 2025 218 226 40177637 10.1016/j.jot.2025.02.006 PMC11964752 6 Cheng M Xue YK Cui M Zeng XL Yang C Ding F Global, regional, and national burden of low back pain: findings from the global burden of disease study 2021 and projections to 2050 Spine 50 7 2025 E128-e39 10.1097/BRS.0000000000005265 PMC11888834 39838749 7 Zheng XD Han WJ Liu M Liu LJ Ma MT Ye ZL Incidence, prevalence, and disease burden of low back pain in China: data from the global burden of disease database Front Public Health 13 2025 1563823 10.3389/fpubh.2025.1563823 PMC12206742 40589815 8 Briggs AM Woolf AD Dreinhofer K Homb N Hoy DG Kopansky-Giles D Reducing the global burden of musculoskeletal conditions Bull World Health Organ 96 5 2018 366 368 29875522 10.2471/BLT.17.204891 PMC5985424 9 Diseases GBD Injuries C Global burden of 369 diseases and injuries in 204 countries and territories, 1990-2019: a systematic analysis for the Global Burden of Disease Study 2019 Lancet 396 10258 2020 1204 1222 33069326 10.1016/S0140-6736(20)30925-9 PMC7567026 10 Nguyen AT Aris IM Snyder BD Harris MB Kang JD Murray M Musculoskeletal health: an ecological study assessing disease burden and research funding Lancet Reg Health Am 29 2024 100661 10.1016/j.lana.2023.100661 PMC10788788 38225979 11 Jiang H Xing X Zhu H Dong T Adverse effects of opioid analgesics in osteoarthritis treatment: a global meta-analysis, 2000-2022 China CDC Wkly 6 25 2024 589 596 38933042 10.46234/ccdcw2024.115 PMC11196880 12 Zhang Z Hu Z Zhao D Huang H Liang Y Mao B Arthroscopic surgery is not superior to conservative treatment in knee osteoarthritis: a systematic review and meta-analysis of randomized controlled trails BMC Muscoskelet Disord 25 1 2024 712 10.1186/s12891-024-07813-3 PMC11375851 39237972 13 Zhou Z Jin MC Jensen MR Guinle MIB Ren A Agarwal AA Opioid usage in lumbar disc herniation patients with nonsurgical, early surgical, and late surgical treatments World Neurosurg 173 2023 e180 e188 36775237 10.1016/j.wneu.2023.02.029 14 Hogg SJ Beavis PA Dawson MA Johnstone RW Targeting the epigenetic regulation of antitumour immunity Nat Rev Drug Discov 19 11 2020 776 800 32929243 10.1038/s41573-020-0077-5 15 Wu YL Lin ZJ Li CC Lin X Shan SK Guo B Epigenetic regulation in metabolic diseases: mechanisms and advances in clinical study Signal Transduct Targeted Ther 8 1 2023 98 10.1038/s41392-023-01333-7 PMC9981733 36864020 16 Qiu YR Xu Q Xie PC He CS Li QC Yao X Epigenetic modifications and emerging therapeutic targets in cardiovascular aging and diseases Pharmacol Res 211 2025 107546 10.1016/j.phrs.2024.107546 39674563 17 Sharma G Sultana A Abdullah KM Pothuraju R Nasser MW Batra SK Epigenetic regulation of bone remodeling and bone metastasis Semin Cell Dev Biol 154 Pt C 2024 275 285 36379849 10.1016/j.semcdb.2022.11.002 PMC10175516 18 Biterge B Schneider R Histone variants: key players of chromatin Cell Tissue Res 356 3 2014 457 466 24781148 10.1007/s00441-014-1862-4 19 Millan-Zambrano G Burton A Bannister AJ Schneider R Histone post-translational modifications - cause and consequence of genome function Nat Rev Genet 23 9 2022 563 580 35338361 10.1038/s41576-022-00468-7 20 Zhang Y Sun Z Jia J Du T Zhang N Tang Y Overview of histone modification Adv Exp Med Biol 1283 2021 1 16 33155134 10.1007/978-981-15-8104-5_1 21 Venkatesh S Workman JL Histone exchange, chromatin structure and the regulation of transcription Nat Rev Mol Cell Biol 16 3 2015 178 189 25650798 10.1038/nrm3941 22 Faulkner B Astleford K Mansky KC Regulation of osteoclast differentiation and skeletal maintenance by histone deacetylases Molecules 24 7 2019 10.3390/molecules24071355 PMC6479495 30959867 23 Gordon JAR Stein JL Westendorf JJ van Wijnen AJ Chromatin modifiers and histone modifications in bone formation, regeneration, and therapeutic intervention for bone-related disease Bone 81 2015 739 745 25836763 10.1016/j.bone.2015.03.011 PMC4591092 24 Wan C Zhang F Yao H Li H Tuan RS Histone modifications and chondrocyte fate: regulation and therapeutic implications Front Cell Dev Biol 9 2021 626708 10.3389/fcell.2021.626708 PMC8085601 33937229 25 Sun P Huang T Huang C Wang Y Tang D Role of histone modification in the occurrence and development of osteoporosis Front Endocrinol 13 2022 964103 10.3389/fendo.2022.964103 PMC9458911 36093077 26 Saul D Kosinsky RL Epigenetics of aging and aging-associated diseases Int J Mol Sci 22 1 2021 10.3390/ijms22010401 PMC7794926 33401659 27 Li Y Hu M Xie J Li S Dai L Dysregulation of histone modifications in bone marrow mesenchymal stem cells during skeletal ageing: roles and therapeutic prospects Stem Cell Res Ther 14 1 2023 166 37357311 10.1186/s13287-023-03393-6 PMC10291799 28 He J Cao W Azeem I Shao Z Epigenetics of osteoarthritis: histones and TGF-beta1 Clin Chim Acta 510 2020 593 598 32795546 10.1016/j.cca.2020.08.011 29 Kang L Zhang H Jia C Zhang R Shen C Epigenetic modifications of inflammation in intervertebral disc degeneration Ageing Res Rev 87 2023 101902 10.1016/j.arr.2023.101902 36871778 30 Wu X Xu M Geng M Chen S Little PJ Xu S Targeting protein modifications in metabolic diseases: molecular mechanisms and targeted therapies Signal Transduct Targeted Ther 8 1 2023 220 10.1038/s41392-023-01439-y PMC10224996 37244925 31 Shang S Liu J Hua F Protein acylation: mechanisms, biological functions and therapeutic targets Signal Transduct Targeted Ther 7 1 2022 396 10.1038/s41392-022-01245-y PMC9797573 36577755 32 Yao W Hu X Wang X Crossing epigenetic frontiers: the intersection of novel histone modifications and diseases Signal Transduct Targeted Ther 9 1 2024 232 10.1038/s41392-024-01918-w PMC11403012 39278916 33 Hyun K Jeon J Park K Kim J Writing, erasing and reading histone lysine methylations Exp Mol Med 49 4 2017 e324 10.1038/emm.2017.11 PMC6130214 28450737 34 Wang Y Han Y Fan E Zhang K Analytical strategies used to identify the readers of histone modifications: a review Anal Chim Acta 891 2015 32 42 26388362 10.1016/j.aca.2015.06.049 35 Allfrey VG Mirsky AE Structural modifications of histones and their possible role in the regulation of RNA synthesis Science 144 3618 1964 559 10.1126/science.144.3618.559 17836360 36 Rea S Eisenhaber F O'Carroll D Strahl BD Sun ZW Schmid M Regulation of chromatin structure by site-specific histone H3 methyltransferases Nature 406 6796 2000 593 599 10949293 10.1038/35020506 37 Shi Y Lan F Matson C Mulligan P Whetstine JR Cole PA Histone demethylation mediated by the nuclear amine oxidase homolog LSD1 Cell 119 7 2004 941 953 15620353 10.1016/j.cell.2004.12.012 38 Greer EL Shi Y Histone methylation: a dynamic mark in health, disease and inheritance Nat Rev Genet 13 5 2012 343 357 22473383 10.1038/nrg3173 PMC4073795 39 Liu C Lu F Cui X Cao X Histone methylation in higher plants Annu Rev Plant Biol 61 2010 395 420 20192747 10.1146/annurev.arplant.043008.091939 40 Black JC Van Rechem C Whetstine JR Histone lysine methylation dynamics: establishment, regulation, and biological impact Mol Cell 48 4 2012 491 507 23200123 10.1016/j.molcel.2012.11.006 PMC3861058 41 Gong F Miller KM Histone methylation and the DNA damage response Mutat Res Rev Mutat Res 780 2019 37 47 31395347 10.1016/j.mrrev.2017.09.003 PMC6690396 42 Baumbusch LO Thorstensen T Krauss V Fischer A Naumann K Assalkhou R The Arabidopsis thaliana genome contains at least 29 active genes encoding SET domain proteins that can be assigned to four evolutionarily conserved classes Nucleic Acids Res 29 21 2001 4319 4333 11691919 10.1093/nar/29.21.4319 PMC60187 43 Kaniskan H Martini ML Jin J Inhibitors of protein methyltransferases and demethylases Chem Rev 118 3 2018 989 1068 28338320 10.1021/acs.chemrev.6b00801 PMC5610952 44 Allfrey VG Faulkner R Mirsky AE Acetylation and methylation of histones and their possible role in the regulation of rna synthesis Proc Natl Acad Sci U S A 51 5 1964 786 794 14172992 10.1073/pnas.51.5.786 PMC300163 45 Verdin E Ott M 50 years of protein acetylation: from gene regulation to epigenetics, metabolism and beyond Nat Rev Mol Cell Biol 16 4 2015 258 264 25549891 10.1038/nrm3931 46 Onufriev AV Schiessel H The nucleosome: from structure to function through physics Curr Opin Struct Biol 56 2019 119 130 30710748 10.1016/j.sbi.2018.11.003 47 Guo P Chen W Li H Li M Li L The histone acetylation modifications of breast cancer and their therapeutic implications Pathol Oncol Res 24 4 2018 807 813 29948617 10.1007/s12253-018-0433-5 48 Marmorstein R Zhou MM Writers and readers of histone acetylation: structure, mechanism, and inhibition Cold Spring Harbor Perspect Biol 6 7 2014 a018762 10.1101/cshperspect.a018762 PMC4067988 24984779 49 Seto E Yoshida M Erasers of histone acetylation: the histone deacetylase enzymes Cold Spring Harbor Perspect Biol 6 4 2014 a018713 10.1101/cshperspect.a018713 PMC3970420 24691964 50 Rossetto D Avvakumov N Côté J Histone phosphorylation: a chromatin modification involved in diverse nuclear events Epigenetics 7 10 2012 1098 1108 22948226 10.4161/epi.21975 PMC3469451 51 Bannister AJ Kouzarides T Regulation of chromatin by histone modifications Cell Res 21 3 2011 381 395 21321607 10.1038/cr.2011.22 PMC3193420 52 Komar D Juszczynski P Rebelled epigenome: histone H3S10 phosphorylation and H3S10 kinases in cancer biology and therapy Clin Epigenet 12 1 2020 147 10.1186/s13148-020-00941-2 PMC7556946 33054831 53 Mattiroli F Penengo L Histone ubiquitination: an integrative signaling platform in genome stability Trends Genet 37 6 2021 566 581 33485674 10.1016/j.tig.2020.12.005 54 Vaughan RM Kupai A Rothbart SB Chromatin regulation through ubiquitin and ubiquitin-like histone modifications Trends Biochem Sci 46 4 2021 258 269 33308996 10.1016/j.tibs.2020.11.005 PMC7954875 55 Lawrence M Daujat S Schneider R Lateral thinking: how histone modifications regulate gene expression Trends Genet 32 1 2016 42 56 26704082 10.1016/j.tig.2015.10.007 56 Yu X Yang J Xu J Pan H Wang W Yu X Histone lactylation: from tumor lactate metabolism to epigenetic regulation Int J Biol Sci 20 5 2024 1833 1854 38481814 10.7150/ijbs.91492 PMC10929197 57 Zhang D Tang Z Huang H Zhou G Cui C Weng Y Metabolic regulation of gene expression by histone lactylation Nature 574 7779 2019 575 580 31645732 10.1038/s41586-019-1678-1 PMC6818755 58 Xu K Zhang K Wang Y Gu Y Comprehensive review of histone lactylation: structure, function, and therapeutic targets Biochem Pharmacol 225 2024 116331 10.1016/j.bcp.2024.116331 38821374 59 Fan Z Liu Z Zhang N Wei W Cheng K Sun H Identification of SIRT3 as an eraser of H4K16la iScience 26 10 2023 107757 10.1016/j.isci.2023.107757 PMC10504495 37720100 60 Moreno-Yruela C Zhang D Wei W Bæk M Liu W Gao J Class I histone deacetylases (HDAC1-3) are histone lysine delactylases Sci Adv 8 3 2022 eabi6696 10.1126/sciadv.abi6696 PMC8769552 35044827 61 Yang D Yin J Shan L Yi X Zhang W Ding Y Identification of lysine-lactylated substrates in gastric cancer cells iScience 25 7 2022 104630 10.1016/j.isci.2022.104630 PMC9253728 35800753 62 Yu J Chai P Xie M Ge S Ruan J Fan X Histone lactylation drives oncogenesis by facilitating m(6)A reader protein YTHDF2 expression in ocular melanoma Genome Biol 22 1 2021 85 33726814 10.1186/s13059-021-02308-z PMC7962360 63 Yang J Luo L Zhao C Li X Wang Z Zeng Z A positive feedback loop between inactive VHL-triggered histone lactylation and PDGFRβ signaling drives clear cell renal cell carcinoma progression Int J Biol Sci 18 8 2022 3470 3483 35637958 10.7150/ijbs.73398 PMC9134910 64 Zhang Y Song H Li M Lu P Histone lactylation bridges metabolic reprogramming and epigenetic rewiring in driving carcinogenesis: Oncometabolite fuels oncogenic transcription Clin Transl Med 14 3 2024 e1614 10.1002/ctm2.1614 PMC10921234 38456209 65 Xia J Qiao Z Hao X Zhang Y LDHA-induced histone lactylation mediates the development of osteoarthritis through regulating the transcription activity of TPI1 gene Autoimmunity 57 1 2024 2384889 10.1080/08916934.2024.2384889 39086231 66 Wu J Hu M Jiang H Ma J Xie C Zhang Z Endothelial cell-derived lactate Triggers bone mesenchymal stem cell histone lactylation to attenuate osteoporosis Adv Sci (Weinh) 10 31 2023 e2301300 10.1002/advs.202301300 PMC10625121 37752768 67 Chen Y Sprung R Tang Y Ball H Sangras B Kim SC Lysine propionylation and butyrylation are novel post-translational modifications in histones Mol Cell Proteomics 6 5 2007 812 819 17267393 10.1074/mcp.M700021-MCP200 PMC2911958 68 Kebede AF Nieborak A Shahidian LZ Le Gras S Richter F Gómez DA Histone propionylation is a mark of active chromatin Nat Struct Mol Biol 24 12 2017 1048 1056 29058708 10.1038/nsmb.3490 69 Vollmuth F Geyer M Interaction of propionylated and butyrylated histone H3 lysine marks with Brd4 bromodomains Angew Chem Int Ed Engl 49 38 2010 6768 6772 20715035 10.1002/anie.201002724 70 Xu Y Shi Z Bao L An expanding Repertoire of protein acylations Mol Cell Proteomics 21 3 2022 100193 10.1016/j.mcpro.2022.100193 PMC8933697 34999219 71 Wisniewski JR Zougman A Mann M Nepsilon-formylation of lysine is a widespread post-translational modification of nuclear proteins occurring at residues involved in regulation of chromatin function Nucleic Acids Res 36 2 2008 570 577 18056081 10.1093/nar/gkm1057 PMC2241850 72 Tan M Luo H Lee S Jin F Yang JS Montellier E Identification of 67 histone marks and histone lysine crotonylation as a new type of histone modification Cell 146 6 2011 1016 1028 21925322 10.1016/j.cell.2011.08.008 PMC3176443 73 Sabari BR Tang Z Huang H Yong-Gonzalez V Molina H Kong HE Intracellular crotonyl-CoA stimulates transcription through p300-catalyzed histone crotonylation Mol Cell 58 2 2015 203 215 25818647 10.1016/j.molcel.2015.02.029 PMC4501262 74 Zhang Q Zeng L Zhao C Ju Y Konuma T Zhou MM Structural insights into histone crotonyl-lysine recognition by the AF9 YEATS domain Structure 24 9 2016 1606 1612 27545619 10.1016/j.str.2016.05.023 PMC5014688 75 Wang ZH Liu ZW Lv MX Luan Z Li T Hu JH Novel histone modifications and liver cancer: emerging frontiers in epigenetic regulation Clin Epigenet 17 1 2025 30 10.1186/s13148-025-01838-8 PMC11841274 39980025 76 Zhang Z Tan M Xie Z Dai L Chen Y Zhao Y Identification of lysine succinylation as a new post-translational modification Nat Chem Biol 7 1 2011 58 63 21151122 10.1038/nchembio.495 PMC3065206 77 Du J Zhou Y Su X Yu JJ Khan S Jiang H Sirt5 is a NAD-dependent protein lysine demalonylase and desuccinylase Science 334 6057 2011 806 809 22076378 10.1126/science.1207861 PMC3217313 78 Zhang R Bons J Scheidemantle G Liu X Bielska O Carrico C Histone malonylation is regulated by SIRT5 and KAT2A iScience 26 3 2023 106193 10.1016/j.isci.2023.106193 PMC9985052 36879797 79 Xie Z Dai J Dai L Tan M Cheng Z Wu Y Lysine succinylation and lysine malonylation in histones Mol Cell Proteomics 11 5 2012 100 107 22389435 10.1074/mcp.M111.015875 PMC3418837 80 Peng C Lu Z Xie Z Cheng Z Chen Y Tan M The first identification of lysine malonylation substrates and its regulatory enzyme Mol Cell Proteomics 10 12 2011 M111.012658 10.1074/mcp.M111.012658 PMC3237090 21908771 81 Dai L Peng C Montellier E Lu Z Chen Y Ishii H Lysine 2-hydroxyisobutyrylation is a widely distributed active histone mark Nat Chem Biol 10 5 2014 365 370 24681537 10.1038/nchembio.1497 82 Huang H Tang S Ji M Tang Z Shimada M Liu X p300-Mediated lysine 2-hydroxyisobutyrylation regulates Glycolysis Mol Cell 70 5 2018 984 29883613 10.1016/j.molcel.2018.05.035 PMC6037533 83 Huang H Luo Z Qi S Huang J Xu P Wang X Landscape of the regulatory elements for lysine 2-hydroxyisobutyrylation pathway Cell Res 28 1 2018 111 125 29192674 10.1038/cr.2017.149 PMC5752845 84 Xie Z Zhang D Chung D Tang Z Huang H Dai L Metabolic regulation of gene expression by histone lysine β-hydroxybutyrylation Mol Cell 62 2 2016 194 206 27105115 10.1016/j.molcel.2016.03.036 PMC5540445 85 Huang H Zhang D Weng Y Delaney K Tang Z Yan C The regulatory enzymes and protein substrates for the lysine β-hydroxybutyrylation pathway Sci Adv 7 9 2021 10.1126/sciadv.abe2771 PMC7904266 33627428 86 Huang H Zhang D Wang Y Perez-Neut M Han Z Zheng YG Lysine benzoylation is a histone mark regulated by SIRT2 Nat Commun 9 1 2018 3374 30154464 10.1038/s41467-018-05567-w PMC6113264 87 Ren X Zhou Y Xue Z Hao N Li Y Guo X Histone benzoylation serves as an epigenetic mark for DPF and YEATS family proteins Nucleic Acids Res 49 1 2021 114 126 33290558 10.1093/nar/gkaa1130 PMC7797077 88 Bao X Liu Z Zhang W Gladysz K Fung YME Tian G Glutarylation of histone H4 lysine 91 regulates chromatin dynamics Mol Cell 76 4 2019 660-75.e9 10.1016/j.molcel.2019.08.018 31542297 89 Hu X Huang X Yang Y Sun Y Zhao Y Zhang Z Dux activates metabolism-lactylation-MET network during early iPSC reprogramming with Brg1 as the histone lactylation reader Nucleic Acids Res 52 10 2024 5529 5548 38512058 10.1093/nar/gkae183 PMC11162783 90 West MH Bonner WM Histone 2B can be modified by the attachment of ubiquitin Nucleic Acids Res 8 20 1980 4671 4680 6255427 10.1093/nar/8.20.4671 PMC324378 91 Chen JJ Stermer D Tanny JC Decoding histone ubiquitylation Front Cell Dev Biol 10 2022 968398 10.3389/fcell.2022.968398 PMC9464978 36105353 92 Uckelmann M Densham RM Baas R Winterwerp HHK Fish A Sixma TK USP48 restrains resection by site-specific cleavage of the BRCA1 ubiquitin mark from H2A Nat Commun 9 1 2018 229 29335415 10.1038/s41467-017-02653-3 PMC5768779 93 Ge W Yu C Li J Yu Z Li X Zhang Y Basis of the H2AK119 specificity of the Polycomb repressive deubiquitinase Nature 616 7955 2023 176 182 36991118 10.1038/s41586-023-05841-y 94 Shiio Y Eisenman RN Histone sumoylation is associated with transcriptional repression Proc Natl Acad Sci U S A 100 23 2003 13225 13230 14578449 10.1073/pnas.1735528100 PMC263760 95 Hickey CM Wilson NR Hochstrasser M Function and regulation of SUMO proteases Nat Rev Mol Cell Biol 13 12 2012 755 766 23175280 10.1038/nrm3478 PMC3668692 96 Ryu HY Hochstrasser M Histone sumoylation and chromatin dynamics Nucleic Acids Res 49 11 2021 6043 6052 33885816 10.1093/nar/gkab280 PMC8216275 97 Qin B Yu J Nowsheen S Wang M Tu X Liu T UFL1 promotes histone H4 ufmylation and ATM activation Nat Commun 10 1 2019 1242 30886146 10.1038/s41467-019-09175-0 PMC6423285 98 Qin B Yu J Nowsheen S Zhao F Wang L Lou Z STK38 promotes ATM activation by acting as a reader of histone H4 ufmylation Sci Adv 6 23 2020 eaax8214 10.1126/sciadv.aax8214 PMC7269669 32537488 99 Park IG Jeon M Kim H Lee JM Coordinated methyl readers: functional communications in cancer Semin Cancer Biol 83 2022 88 99 33753223 10.1016/j.semcancer.2021.03.015 100 Stevely WS Stocken LA Phosphorylation of rat-thymus histone Biochem J 100 2 1966 20c-1c 10.1042/bj1000020c PMC1265177 16742404 101 Gong P Guo ZH Wang SP Gao SF Cao QH Histone phosphorylation in DNA damage response Int J Mol Sci 26 6 2025 10.3390/ijms26062405 PMC11941871 40141048 102 Stucki M Clapperton JA Mohammad D Yaffe MB Smerdon SJ Jackson SP MDC1 directly binds phosphorylated histone H2AX to regulate cellular responses to DNA double-strand breaks Cell 123 7 2005 1213 1226 16377563 10.1016/j.cell.2005.09.038 103 Kelly AE Ghenoiu C Xue JZ Zierhut C Kimura H Funabiki H Survivin reads phosphorylated histone H3 threonine 3 to activate the mitotic kinase Aurora B Science 330 6001 2010 235 239 20705815 10.1126/science.1189505 PMC3177562 104 Stone PR Lorimer WS 3rd Ranchalis J Danley M Kidwell WR Effect of DNA on poly (ADP-ribose) glycohydrolase and the degradation of histone H1-poly (ADP-ribose) complex from HeLa cell nuclei Nucleic Acids Res 5 1 1978 173 184 643606 10.1093/nar/5.1.173 PMC341969 105 Zha JJ Tang Y Wang YL Role of mono-ADP-ribosylation histone modification (Review) Exp Ther Med 21 6 2021 577 33850549 10.3892/etm.2021.10009 PMC8027728 106 Li P Lei Y Qi J Liu W Yao K Functional roles of ADP-ribosylation writers, readers and erasers Front Cell Dev Biol 10 2022 941356 10.3389/fcell.2022.941356 PMC9404506 36035988 107 Torres CR Hart GW Topography and polypeptide distribution of terminal N-acetylglucosamine residues on the surfaces of intact lymphocytes. Evidence for O-linkEvidence for O-linked GlcNAced GlcNAc J Biol Chem 259 5 1984 3308 3317 6421821 108 Lewis BA Hanover JA O-GlcNAc and the epigenetic regulation of gene expression J Biol Chem 289 50 2014 34440 34448 25336654 10.1074/jbc.R114.595439 PMC4263851 109 Ye L Ding W Xiao D Jia Y Zhao Z Ao X O-GlcNAcylation: cellular physiology and therapeutic target for human diseases MedComm 4 6 2020 e456 2023 10.1002/mco2.456 PMC10728774 38116061 110 Stanley JS Griffin JB Zempleni J Biotinylation of histones in human cells. Effects of cell proliferation Eur J Biochem 268 20 2001 5424 5429 11606205 10.1046/j.0014-2956.2001.02481.x 111 Kuroishi T Rios-Avila L Pestinger V Wijeratne SS Zempleni J Biotinylation is a natural, albeit rare, modification of human histones Mol Genet Metabol 104 4 2011 537 545 10.1016/j.ymgme.2011.08.030 PMC3224183 21930408 112 Hagiwara T Nakashima K Hirano H Senshu T Yamada M Deimination of arginine residues in nucleophosmin/B23 and histones in HL-60 granulocytes Biochem Biophys Res Commun 290 3 2002 979 983 11798170 10.1006/bbrc.2001.6303 113 Wang B Li Z Shi Y Zhu Z Fields L Shelef MA Mass spectrometry-based precise identification of citrullinated histones via limited digestion and biotin derivative tag enrichment Anal Chem 96 6 2024 2309 2317 38285917 10.1021/acs.analchem.3c02646 PMC11526168 114 Farrelly LA Thompson RE Zhao S Lepack AE Lyu Y Bhanu NV Histone serotonylation is a permissive modification that enhances TFIID binding to H3K4me3 Nature 567 7749 2019 535 539 30867594 10.1038/s41586-019-1024-7 PMC6557285 115 Zheng Q Weekley BH Vinson DA Zhao S Bastle RM Thompson RE Bidirectional histone monoaminylation dynamics regulate neural rhythmicity Nature 637 8047 2025 974 982 39779849 10.1038/s41586-024-08371-3 PMC11754111 116 Zhao J Chen W Pan Y Zhang Y Sun H Wang H Structural insights into the recognition of histone H3Q5 serotonylation by WDR5 Sci Adv 7 25 2021 10.1126/sciadv.abf4291 PMC8213231 34144982 117 Lepack AE Werner CT Stewart AF Fulton SL Zhong P Farrelly LA Dopaminylation of histone H3 in ventral tegmental area regulates cocaine seeking Science 368 6487 2020 197 201 32273471 10.1126/science.aaw8806 PMC7228137 118 Zhang L Zheng YL Wang R Wang XQ Zhang H Exercise for osteoporosis: a literature review of pathology and mechanism Front Immunol 13 2022 1005665 10.3389/fimmu.2022.1005665 PMC9509020 36164342 119 Song S Guo Y Yang Y Fu D Advances in pathogenesis and therapeutic strategies for osteoporosis Pharmacol Ther 237 2022 108168 10.1016/j.pharmthera.2022.108168 35283172 120 Li H Xiao W He Y Wen Z Cheng S Zhang Y Novel insights into the multifaceted functions of RNA n(6)-methyladenosine modification in degenerative musculoskeletal diseases Front Cell Dev Biol 9 2021 766020 10.3389/fcell.2021.766020 PMC8743268 35024366 121 Zeng Q Li N Wang Q Feng J Sun D Zhang Q The prevalence of osteoporosis in China, a nationwide, multicenter DXA survey J Bone Miner Res 34 10 2019 1789 1797 31067339 10.1002/jbmr.3757 122 Si L Winzenberg TM Jiang Q Chen M Palmer AJ Projection of osteoporosis-related fractures and costs in China: 2010-2050 Osteoporos Int 26 7 2015 1929 1937 25761729 10.1007/s00198-015-3093-2 123 Hadjidakis DJ Androulakis II Bone remodeling Ann N Y Acad Sci 1092 2006 385 396 17308163 10.1196/annals.1365.035 124 Manolagas SC Jilka RL Bone marrow, cytokines, and bone remodeling. Emerging insights into the pathophysiology of osteoporosis N Engl J Med 332 5 1995 305 311 7816067 10.1056/NEJM199502023320506 125 Da W Tao L Zhu Y The role of osteoclast energy metabolism in the occurrence and development of osteoporosis Front Endocrinol 12 2021 675385 10.3389/fendo.2021.675385 PMC8150001 34054735 126 Yang TL Shen H Liu A Dong SS Zhang L Deng FY A road map for understanding molecular and genetic determinants of osteoporosis Nat Rev Endocrinol 16 2 2020 91 103 31792439 10.1038/s41574-019-0282-7 PMC6980376 127 Föger-Samwald U Dovjak P Azizi-Semrad U Kerschan-Schindl K Pietschmann P Osteoporosis: pathophysiology and therapeutic options Excli J 19 2020 1017 1037 32788914 10.17179/excli2020-2591 PMC7415937 128 Chan WCW Tan Z To MKT Chan D Regulation and role of transcription factors in osteogenesis Int J Mol Sci 22 11 2021 10.3390/ijms22115445 PMC8196788 34064134 129 Fu Y Zhang P Ge J Cheng J Dong W Yuan H Histone deacetylase 8 suppresses osteogenic differentiation of bone marrow stromal cells by inhibiting histone H3K9 acetylation and RUNX2 activity Int J Biochem Cell Biol 54 2014 68 77 25019367 10.1016/j.biocel.2014.07.003 130 Abuna RPF Almeida LO Souza ATP Fernandes RR Sverzut TFV Rosa AL Osteoporosis and osteoblasts cocultured with adipocytes inhibit osteoblast differentiation by downregulating histone acetylation J Cell Physiol 236 5 2021 3906 3917 33124698 10.1002/jcp.30131 131 Ma C Gao J Liang J Dai W Wang Z Xia M HDAC6 inactivates Runx2 promoter to block osteogenesis of bone marrow stromal cells in age-related bone loss of mice Stem Cell Res Ther 12 1 2021 484 34454588 10.1186/s13287-021-02545-w PMC8403388 132 Hu M Xing L Zhang L Liu F Wang S Xie Y NAP1L2 drives mesenchymal stem cell senescence and suppresses osteogenic differentiation Aging Cell 21 2 2022 e13551 10.1111/acel.13551 PMC8844120 35032339 133 Behera J Ison J Rai H Tyagi N Allyl sulfide promotes osteoblast differentiation and bone density via reducing mitochondrial DNA release mediated Kdm6b/H3K27me3 epigenetic mechanism Biochem Biophys Res Commun 543 2021 87 94 33556823 10.1016/j.bbrc.2021.01.016 PMC8457530 134 Gao Y Chen N Fu Z Zhang Q Progress of Wnt signaling pathway in osteoporosis Biomolecules 13 3 2023 10.3390/biom13030483 PMC10046187 36979418 135 Li X Han Y Li G Zhang Y Wang J Feng C Role of Wnt signaling pathway in joint development and cartilage degeneration Front Cell Dev Biol 11 2023 1181619 10.3389/fcell.2023.1181619 PMC10285172 37363728 136 Hu L Chen W Qian A Li YP Wnt/β-catenin signaling components and mechanisms in bone formation, homeostasis, and disease Bone Res 12 1 2024 39 38987555 10.1038/s41413-024-00342-8 PMC11237130 137 Sun J Ermann J Niu N Yan G Yang Y Shi Y Histone demethylase LSD1 regulates bone mass by controlling WNT7B and BMP2 signaling in osteoblasts Bone Res 6 2018 14 29707403 10.1038/s41413-018-0015-x PMC5916912 138 Jing H Su X Gao B Shuai Y Chen J Deng Z Epigenetic inhibition of Wnt pathway suppresses osteogenic differentiation of BMSCs during osteoporosis Cell Death Dis 9 2 2018 176 29416009 10.1038/s41419-017-0231-0 PMC5833865 139 Hu L Cheng Z Wu L Luo L Pan P Li S Histone methyltransferase SETDB1 promotes osteogenic differentiation in osteoporosis by activating OTX2-mediated BMP-Smad and Wnt/beta-catenin pathways Hum Cell 36 4 2023 1373 1388 37074626 10.1007/s13577-023-00902-w 140 Wu JC Sun J Xu JC Zhou ZY Zhang YF Down-regulated microRNA-199a-3p enhances osteogenic differentiation of bone marrow mesenchymal stem cells by targeting Kdm3a in ovariectomized rats Biochem J 478 4 2021 721 734 33410908 10.1042/BCJ20200314 141 Lee WC Guntur AR Long F Rosen CJ Energy metabolism of the osteoblast: implications for osteoporosis Endocr Rev 38 3 2017 255 266 28472361 10.1210/er.2017-00064 PMC5460680 142 Cipriani C Colangelo L Santori R Renella M Mastrantonio M Minisola S The interplay between bone and glucose metabolism Front Endocrinol 11 2020 122 10.3389/fendo.2020.00122 PMC7105593 32265831 143 Ye J Xiao J Wang J Ma Y Zhang Y Zhang Q The interaction between intracellular energy metabolism and signaling pathways during osteogenesis Front Mol Biosci 8 2021 807487 10.3389/fmolb.2021.807487 PMC8832142 35155568 144 Da W Jiang W Tao L ROS/MMP-9 mediated CS degradation in BMSC inhibits citric acid metabolism participating in the dual regulation of bone remodelling Cell Death Discov 10 1 2024 77 38355572 10.1038/s41420-024-01835-5 PMC10866869 145 Nian F Qian Y Xu F Yang M Wang H Zhang Z LDHA promotes osteoblast differentiation through histone lactylation Biochem Biophys Res Commun 615 2022 31 35 35605402 10.1016/j.bbrc.2022.05.028 146 Minami E Sasa K Yamada A Kawai R Yoshida H Nakano H Lactate-induced histone lactylation by p300 promotes osteoblast differentiation PLoS One 18 12 2023 e0293676 10.1371/journal.pone.0293676 PMC10697613 38051708 147 Li C Chai Y Wang L Gao B Chen H Gao P Programmed cell senescence in skeleton during late puberty Nat Commun 8 1 2017 1312 29101351 10.1038/s41467-017-01509-0 PMC5670205 148 Yang R Chen J Zhang J Qin R Wang R Qiu Y 1,25-Dihydroxyvitamin D protects against age-related osteoporosis by a novel VDR-Ezh2-p16 signal axis Aging Cell 19 2 2020 e13095 10.1111/acel.13095 PMC6996957 31880094 149 James AW Review of signaling pathways governing MSC osteogenic and adipogenic differentiation Sci Tech Rep 2013 2013 684736 10.1155/2013/684736 PMC3874981 24416618 150 Bateman ME Strong AL McLachlan JA Burow ME Bunnell BA The effects of endocrine disruptors on adipogenesis and osteogenesis in mesenchymal stem cells: a review Front Endocrinol 7 2016 171 10.3389/fendo.2016.00171 PMC5220052 28119665 151 Wang L Niu N Li L Shao R Ouyang H Zou W H3K36 trimethylation mediated by SETD2 regulates the fate of bone marrow mesenchymal stem cells PLoS Biol 16 11 2018 e2006522 10.1371/journal.pbio.2006522 PMC6233919 30422989 152 Yin B Yu F Wang C Li B Liu M Ye L Epigenetic control of mesenchymal stem cell fate decision via histone methyltransferase Ash1l Stem Cell 37 1 2019 115 127 10.1002/stem.2918 30270478 153 Yang X Wang G Wang Y Zhou J Yuan H Li X Histone demethylase KDM7A reciprocally regulates adipogenic and osteogenic differentiation via regulation of C/EBPalpha and canonical Wnt signalling J Cell Mol Med 23 3 2019 2149 2162 30614617 10.1111/jcmm.14126 PMC6378189 154 Qi Q Wang Y Wang X Yang J Xie Y Zhou J Histone demethylase KDM4A regulates adipogenic and osteogenic differentiation via epigenetic regulation of C/EBPalpha and canonical Wnt signaling Cell Mol Life Sci 77 12 2020 2407 2421 31515577 10.1007/s00018-019-03289-w PMC11105029 155 Wang FS Chen YS Ko JY Kuo CW Ke HJ Hsieh CK Bromodomain protein BRD4 accelerates glucocorticoid dysregulation of bone mass and marrow adiposis by modulating H3K9 and Foxp1 Cells 9 6 2020 10.3390/cells9061500 PMC7349708 32575577 156 Gao Y Ge W The histone methyltransferase DOT1L inhibits osteoclastogenesis and protects against osteoporosis Cell Death Dis 9 2 2018 33 29348610 10.1038/s41419-017-0040-5 PMC5833786 157 Wang C Chen R Zhu X Zhang X Lian N DOT1L decelerates the development of osteoporosis by inhibiting SRSF1 transcriptional activity via microRNA-181-mediated KAT2B inhibition Genomics 116 1 2024 110759 10.1016/j.ygeno.2023.110759 38072145 158 Caviness PC Gai D Lazarenko OP Blackburn ML Zhan F Chen JR Decreased bone resorption in Ezh2 myeloid cell conditional knockout mouse model FASEB J 37 7 2023 e23019 10.1096/fj.202201673RR 37272906 159 Lian WS Ko JY Chen YS Ke HJ Hsieh CK Kuo CW MicroRNA-29a represses osteoclast formation and protects against osteoporosis by regulating PCAF-mediated RANKL and CXCL12 Cell Death Dis 10 10 2019 705 31543513 10.1038/s41419-019-1942-1 PMC6755134 160 Najafova Z Liu P Wegwitz F Ahmad M Tamon L Kosinsky RL RNF40 exerts stage-dependent functions in differentiating osteoblasts and is essential for bone cell crosstalk Cell Death Differ 28 2 2021 700 714 32901120 10.1038/s41418-020-00614-w PMC7862367 161 Sacitharan PK Ageing and osteoarthritis Subcell Biochem 91 2019 123 159 30888652 10.1007/978-981-13-3681-2_6 162 Glyn-Jones S Palmer AJ Agricola R Price AJ Vincent TL Weinans H Osteoarthritis. Lancet 386 9991 2015 376 387 25748615 10.1016/S0140-6736(14)60802-3 163 Long H Zeng X Liu Q Wang H Vos T Hou Y Burden of osteoarthritis in China, 1990-2017: findings from the global burden of disease study 2017 Lancet Rheumatol 2 3 2020 e164 e172 38263654 10.1016/S2665-9913(19)30145-6 164 Du X Ouyang H [Correlation between histone methylation level and pathological development of osteoarthritis] Zhejiang Da Xue Xue Bao Yi Xue Ban 48 6 2019 682 687 31955544 10.3785/j.issn.1008-9292.2019.12.14 PMC8800784 165 Kiełbowski K Herian M Bakinowska E Banach B Sroczyński T Pawlik A The role of genetics and epigenetic regulation in the pathogenesis of osteoarthritis Int J Mol Sci 24 14 2023 10.3390/ijms241411655 PMC10381003 37511413 166 Krishnan Y Grodzinsky AJ Cartilage diseases Matrix Biol 71-72 2018 51 69 29803938 10.1016/j.matbio.2018.05.005 PMC6146013 167 Fujii Y Liu L Yagasaki L Inotsume M Chiba T Asahara H Cartilage homeostasis and osteoarthritis Int J Mol Sci 23 11 2022 10.3390/ijms23116316 PMC9181530 35682994 168 Han S Osteoarthritis year in review 2022: biology Osteoarthr Cartil 30 12 2022 1575 1582 10.1016/j.joca.2022.09.003 36150676 169 Chawla S Mainardi A Majumder N Dönges L Kumar B Occhetta P Chondrocyte hypertrophy in osteoarthritis: mechanistic studies and models for the identification of new therapeutic strategies Cells 11 24 2022 10.3390/cells11244034 PMC9777397 36552796 170 Yao Q Wu X Tao C Gong W Chen M Qu M Osteoarthritis: pathogenic signaling pathways and therapeutic targets Signal Transduct Targeted Ther 8 1 2023 56 10.1038/s41392-023-01330-w PMC9898571 36737426 171 van den Bosch MH Blom AB van de Loo FA Koenders MI Lafeber FP van den Berg WB Brief report: induction of matrix metalloproteinase expression by synovial Wnt signaling and association with disease progression in early symptomatic osteoarthritis Arthritis Rheumatol 69 10 2017 1978 1983 28678406 10.1002/art.40206 172 Li W Xiong Y Chen W Wu L Wnt/β-catenin signaling may induce senescence of chondrocytes in osteoarthritis Exp Ther Med 20 3 2020 2631 2638 32765756 10.3892/etm.2020.9022 PMC7401843 173 Ji Q Xu X Kang L Xu Y Xiao J Goodman SB Hematopoietic PBX-interacting protein mediates cartilage degeneration during the pathogenesis of osteoarthritis Nat Commun 10 1 2019 313 30659184 10.1038/s41467-018-08277-5 PMC6338798 174 Yang Y Xing D Wang Y Jia H Li B Li JJ A long non-coding RNA, HOTAIR, promotes cartilage degradation in osteoarthritis by inhibiting WIF-1 expression and activating Wnt pathway BMC Mol Cell Biol 21 1 2020 53 32650720 10.1186/s12860-020-00299-6 PMC7350747 175 Monteagudo S Cornelis FMF Aznar-Lopez C Yibmantasiri P Guns LA Carmeliet P DOT1L safeguards cartilage homeostasis and protects against osteoarthritis Nat Commun 8 2017 15889 10.1038/ncomms15889 PMC5481839 28627522 176 Cornelis FMF de Roover A Storms L Hens A Lories RJ Monteagudo S Increased susceptibility to develop spontaneous and post-traumatic osteoarthritis in Dot1l-deficient mice Osteoarthr Cartil 27 3 2019 513 525 10.1016/j.joca.2018.11.008 30513362 177 Shen J Abu-Amer Y O'Keefe RJ McAlinden A Inflammation and epigenetic regulation in osteoarthritis Connect Tissue Res 58 1 2017 49 63 27389927 10.1080/03008207.2016.1208655 PMC5266560 178 Nedunchezhiyan U Varughese I Sun AR Wu X Crawford R Prasadam I Obesity, inflammation, and immune system in osteoarthritis Front Immunol 13 2022 907750 10.3389/fimmu.2022.907750 PMC9289681 35860250 179 Dai J Zhou S Ge Q Qin J Li J Ju H Recruitment of Brd3 and Brd4 to acetylated chromatin is essential for proinflammatory cytokine-induced matrix-degrading enzyme expression J Orthop Surg Res 14 1 2019 59 30786900 10.1186/s13018-019-1091-3 PMC6381721 180 Ai J Zhao F Zhou X HMGA1 aggravates oxidative stress injury and inflammatory responses in IL-1β-induced primary chondrocytes through the JMJD3/ZEB1 Axis Int Arch Allergy Immunol 184 3 2023 279 290 36470235 10.1159/000526680 181 Coryell PR Diekman BO Loeser RF Mechanisms and therapeutic implications of cellular senescence in osteoarthritis Nat Rev Rheumatol 17 1 2021 47 57 33208917 10.1038/s41584-020-00533-7 PMC8035495 182 Ji ML Li Z Hu XY Zhang WT Zhang HX Lu J Dynamic chromatin accessibility tuning by the long noncoding RNA ELDR accelerates chondrocyte senescence and osteoarthritis Am J Hum Genet 110 4 2023 606 624 36868238 10.1016/j.ajhg.2023.02.011 PMC10119164 183 Chen LY Lotz M Terkeltaub R Liu-Bryan R Modulation of matrix metabolism by ATP-citrate lyase in articular chondrocytes J Biol Chem 293 31 2018 12259 12270 29929979 10.1074/jbc.RA118.002261 PMC6078460 184 Wang J Wang X Ding X Huang T Song D Tao H EZH2 is associated with cartilage degeneration in osteoarthritis by promoting SDC1 expression via histone methylation of the microRNA-138 promoter Lab Invest 101 5 2021 600 611 33692439 10.1038/s41374-021-00532-6 185 Akiyama H Lefebvre V Unraveling the transcriptional regulatory machinery in chondrogenesis J Bone Miner Metabol 29 4 2011 390 395 10.1007/s00774-011-0273-9 PMC3354916 21594584 186 Nham GTH Zhang X Asou Y Shinomura T Expression of type II collagen and aggrecan genes is regulated through distinct epigenetic modifications of their multiple enhancer elements Gene 704 2019 134 141 30981839 10.1016/j.gene.2019.04.034 187 Ukita M Matsushita K Tamura M Yamaguchi T Histone H3K9 methylation is involved in temporomandibular joint osteoarthritis Int J Mol Med 45 2 2020 607 614 31894302 10.3892/ijmm.2019.4446 188 Lian WS Wu RW Ko JY Chen YS Wang SY Yu CP Histone H3K27 demethylase UTX compromises articular chondrocyte anabolism and aggravates osteoarthritic degeneration Cell Death Dis 13 6 2022 538 35676242 10.1038/s41419-022-04985-5 PMC9178009 189 Shao R Suo J Zhang Z Kong M Ma Y Wen Y H3K36 methyltransferase NSD1 protects against osteoarthritis through regulating chondrocyte differentiation and cartilage homeostasis Cell Death Differ 31 1 2024 106 118 38012390 10.1038/s41418-023-01244-8 PMC10781997 190 Jin Y Liu Z Li Z Li H Zhu C Li R Histone demethylase JMJD3 downregulation protects against aberrant force-induced osteoarthritis through epigenetic control of NR4A1 Int J Oral Sci 14 1 2022 34 35831280 10.1038/s41368-022-00190-4 PMC9279410 191 Szponder T Latalski M Danielewicz A Krać K Kozera A Drzewiecka B Osteoarthritis: pathogenesis, animal models, and new regenerative therapies J Clin Med 12 1 2022 10.3390/jcm12010005 PMC9821671 36614806 192 Chen B Wang L Xie D Wang Y Exploration and breakthrough in the mode of chondrocyte death - a potential new mechanism for osteoarthritis Biomed Pharmacother 170 2024 115990 10.1016/j.biopha.2023.115990 38061136 193 Zhu R Wang Y Ouyang Z Hao W Zhou F Lin Y Targeting regulated chondrocyte death in osteoarthritis therapy Biochem Pharmacol 215 2023 115707 10.1016/j.bcp.2023.115707 37506921 194 Ai Y Meng Y Yan B Zhou Q Wang X The biochemical pathways of apoptotic, necroptotic, pyroptotic, and ferroptotic cell death Mol Cell 84 1 2024 170 179 38181758 10.1016/j.molcel.2023.11.040 195 Wang Z Zhou N Wang W Yu Y Xia L Li N HDAC2 interacts with microRNA-503-5p to regulate SGK1 in osteoarthritis Arthritis Res Ther 23 1 2021 78 33750441 10.1186/s13075-020-02373-y PMC7941997 196 Gu X Li F Che X Wei X Li P HDAC4 represses ER stress induced chondrocyte apoptosis by inhibiting ATF4 and attenuates cartilage degeneration in an osteoarthritis rat model BMC Muscoskelet Disord 25 1 2024 467 10.1186/s12891-024-07578-9 PMC11179397 38879481 197 Huang JR Xu YK Li YJ Pang YM Ding XT Zhou RR HDAC4 regulates apoptosis in Acan-Cre(ERT2);HDAC4(d) (/d) mice with osteoarthritis by downregulating ATF4 FEBS Open Bio 15 5 2025 726 737 10.1002/2211-5463.13965 PMC12051021 39895575 198 Huang Y Pan W Ma J SKP2-mediated ubiquitination and degradation of KLF11 promotes osteoarthritis via modulation of JMJD3/NOTCH1 pathway FASEB J 38 9 2024 e23640 10.1096/fj.202300664RR 38690715 199 Zhang F Zhao X Shen H Zhang C Molecular mechanisms of cell death in intervertebral disc degeneration (Review) Int J Mol Med 37 6 2016 1439 1448 27121482 10.3892/ijmm.2016.2573 PMC4866972 200 Lin MH Zhang CX Li HM Li K Gou SA He X Pyroptosis for osteoarthritis treatment: insights into cellular and molecular interactions inflammatory Front Immunol 16 2025 1556990 10.3389/fimmu.2025.1556990 PMC11996656 40236711 201 Chen Y Dong SS Zeng X Xu Q Liang MW Liao GN EZH2/miR-142-3p/HMGB1 axis mediates chondrocyte pyroptosis by regulating endoplasmic reticulum stress in knee osteoarthritis Chin Med J (Engl) 138 1 2025 79 92 39704001 10.1097/CM9.0000000000003186 PMC11717515 202 Chen J Yang X Feng Y Li Q Ma J Wang L Targeting ferroptosis holds potential for intervertebral disc degeneration therapy Cells 11 21 2022 10.3390/cells11213508 PMC9653619 36359904 203 Miao Y Chen Y Xue F Liu K Zhu B Gao J Contribution of ferroptosis and GPX4's dual functions to osteoarthritis progression EBioMedicine 76 2022 103847 10.1016/j.ebiom.2022.103847 PMC8822178 35101656 204 Yao X Sun K Yu S Luo J Guo J Lin J Chondrocyte ferroptosis contribute to the progression of osteoarthritis J Orthop Translat 27 2021 33 43 33376672 10.1016/j.jot.2020.09.006 PMC7750492 205 Wang R Shi D Pan XN Ren AQ Jiang K Epigenetic mechanisms of Nsd1-mediated histone methylation modifications in chondrocyte ferroptosis in knee osteoarthritis Biomol Biomed 25 4 2025 894 904 39217430 10.17305/bb.2024.10879 PMC11959401 206 Zhang Y Zhao CY Zhou Z Li CC Wang Q The effect of lactate dehydrogenase B and its mediated histone lactylation on chondrocyte ferroptosis during osteoarthritis J Orthop Surg Res 20 1 2025 493 40394653 10.1186/s13018-025-05894-x PMC12093889 207 Mathiessen A Conaghan PG Synovitis in osteoarthritis: current understanding with therapeutic implications Arthritis Res Ther 19 1 2017 18 28148295 10.1186/s13075-017-1229-9 PMC5289060 208 Zhao K Ruan J Nie L Ye X Li J Effects of synovial macrophages in osteoarthritis Front Immunol 14 2023 1164137 10.3389/fimmu.2023.1164137 PMC10364050 37492583 209 Zhang H Cai D Bai X Macrophages regulate the progression of osteoarthritis Osteoarthr Cartil 28 5 2020 555 561 10.1016/j.joca.2020.01.007 31982565 210 Nasu Y Nishida K Miyazawa S Komiyama T Kadota Y Abe N Trichostatin A, a histone deacetylase inhibitor, suppresses synovial inflammation and subsequent cartilage destruction in a collagen antibody-induced arthritis mouse model Osteoarthr Cartil 16 6 2008 723 732 10.1016/j.joca.2007.10.014 18226559 211 Lin R Yin J Huang J Zou L Liu L Tang W Macrophage-derived ectosomal miR-350-3p promotes osteoarthritis progression through downregulating chondrocyte H3K36 methyltransferase NSD1 Cell Death Discov 10 1 2024 223 38719811 10.1038/s41420-024-01986-5 PMC11078928 212 Hügle T Geurts J What drives osteoarthritis?-synovial versus subchondral bone pathology Rheumatology 56 9 2017 1461 1471 28003493 10.1093/rheumatology/kew389 213 Li X Chen W Liu D Chen P Wang S Li F Pathological progression of osteoarthritis: a perspective on subchondral bone Front Med 18 2 2024 237 257 38619691 10.1007/s11684-024-1061-y 214 Donell S Subchondral bone remodelling in osteoarthritis EFORT Open Rev 4 6 2019 221 229 31210964 10.1302/2058-5241.4.180102 PMC6549114 215 Lian WS Wu RW Ko JY Chen YS Wang SY Jahr H Inhibition of histone lysine demethylase 6A promotes chondrocytic activity and attenuates osteoarthritis development through repressing H3K27me3 enhancement of Wnt10a Int J Biochem Cell Biol 158 2023 106394 10.1016/j.biocel.2023.106394 36871937 216 Chen W Xiao J Zhou Y Liu W Jian J Yang J Curcumenol regulates Histone H3K27me3 demethylases KDM6B affecting Succinic acid metabolism to alleviate cartilage degeneration in knee osteoarthritis Phytomedicine 133 2024 155922 10.1016/j.phymed.2024.155922 39126921 217 Mohd Isa IL Teoh SL Mohd Nor NH Mokhtar SA Discogenic low back pain: anatomy, pathophysiology and treatments of intervertebral disc degeneration Int J Mol Sci 24 1 2022 10.3390/ijms24010208 PMC9820240 36613651 218 Benzakour T Igoumenou V Mavrogenis AF Benzakour A Current concepts for lumbar disc herniation Int Orthop 43 4 2019 841 851 30506088 10.1007/s00264-018-4247-6 219 Bowles RD Setton LA Biomaterials for intervertebral disc regeneration and repair Biomaterials 129 2017 54 67 28324865 10.1016/j.biomaterials.2017.03.013 PMC5627607 220 Zhang GZ Deng YJ Xie QQ Ren EH Ma ZJ He XG Sirtuins and intervertebral disc degeneration: roles in inflammation, oxidative stress, and mitochondrial function Clin Chim Acta 508 2020 33 42 32348785 10.1016/j.cca.2020.04.016 221 Li G Zhang W Liang H Yang C Epigenetic regulation in intervertebral disc degeneration Trends Mol Med 28 10 2022 803 805 36030154 10.1016/j.molmed.2022.07.007 222 Hynes RO Naba A Overview of the matrisome--an inventory of extracellular matrix constituents and functions Cold Spring Harbor Perspect Biol 4 1 2012 a004903 10.1101/cshperspect.a004903 PMC3249625 21937732 223 Zhang S Liu W Chen S Wang B Wang P Hu B Extracellular matrix in intervertebral disc: basic and translational implications Cell Tissue Res 390 1 2022 1 22 35792910 10.1007/s00441-022-03662-5 224 Wang WJ Yu XH Wang C Yang W He WS Zhang SJ MMPs and ADAMTSs in intervertebral disc degeneration Clin Chim Acta 448 2015 238 246 26162271 10.1016/j.cca.2015.06.023 225 Liang H Luo R Li G Zhang W Song Y Yang C The proteolysis of ECM in intervertebral disc degeneration Int J Mol Sci 23 3 2022 10.3390/ijms23031715 PMC8835917 35163637 226 Porter S Clark IM Kevorkian L Edwards DR The ADAMTS metalloproteinases Biochem J 386 Pt 1 2005 15 27 15554875 10.1042/BJ20040424 PMC1134762 227 Vo NV Hartman RA Yurube T Jacobs LJ Sowa GA Kang JD Expression and regulation of metalloproteinases and their inhibitors in intervertebral disc aging and degeneration Spine J 13 3 2013 331 341 23369495 10.1016/j.spinee.2012.02.027 PMC3637842 228 Wang K Song Y Liu W Wu X Zhang Y Li S The noncoding RNA linc-ADAMTS5 cooperates with RREB1 to protect from intervertebral disc degeneration through inhibiting ADAMTS5 expression Clin Sci (Lond) 131 10 2017 965 979 28341660 10.1042/CS20160918 229 Zhongyi S Sai Z Chao L Jiwei T Effects of nuclear factor kappa B signaling pathway in human intervertebral disc degeneration Spine 40 4 2015 224 232 25494317 10.1097/BRS.0000000000000733 230 Kawahara TL Michishita E Adler AS Damian M Berber E Lin M SIRT6 links histone H3 lysine 9 deacetylation to NF-kappaB-dependent gene expression and organismal life span Cell 136 1 2009 62 74 19135889 10.1016/j.cell.2008.10.052 PMC2757125 231 Kang L Hu J Weng Y Jia J Zhang Y Sirtuin 6 prevents matrix degradation through inhibition of the NF-κB pathway in intervertebral disc degeneration Exp Cell Res 352 2 2017 322 332 28215636 10.1016/j.yexcr.2017.02.023 232 Rahal A Kumar A Singh V Yadav B Tiwari R Chakraborty S Oxidative stress, prooxidants, and antioxidants: the interplay BioMed Res Int 2014 2014 761264 10.1155/2014/761264 PMC3920909 24587990 233 Li Y Chen L Gao Y Zou X Wei F Oxidative stress and intervertebral disc degeneration: pathophysiology, signaling pathway, and therapy Oxid Med Cell Longev 2022 2022 1984742 10.1155/2022/1984742 PMC9576411 36262281 234 Xu W Zhang X Liu G Zhu M Wu Y Jie Z Oxidative stress abrogates the degradation of KMT2D to promote degeneration in nucleus pulposus Biochim Biophys Acta Mol Basis Dis 1866 10 2020 165888 10.1016/j.bbadis.2020.165888 32599142 235 Silwal P Nguyen-Thai AM Mohammad HA Wang Y Robbins PD Lee JY Cellular senescence in intervertebral disc aging and degeneration: molecular mechanisms and potential therapeutic opportunities Biomolecules 13 4 2023 10.3390/biom13040686 PMC10135543 37189433 236 Liu Y Dou Y Sun X Yang Q Mechanisms and therapeutic strategies for senescence-associated secretory phenotype in the intervertebral disc degeneration microenvironment J Orthop Translat 45 2024 56 65 38495743 10.1016/j.jot.2024.02.003 PMC10943956 237 Ge J Zhou Q Cheng X Qian J Yan Q Wu C The protein tyrosine kinase inhibitor, Genistein, delays intervertebral disc degeneration in rats by inhibiting the p38 pathway-mediated inflammatory response Aging (Albany NY) 12 3 2020 2246 2260 32023553 10.18632/aging.102743 PMC7041767 238 Zhang HJ Liao HY Bai DY Wang ZQ Xie XW MAPK/ERK signaling pathway: a potential target for the treatment of intervertebral disc degeneration Biomed Pharmacother 143 2021 112170 10.1016/j.biopha.2021.112170 34536759 239 Zhang GZ Liu MQ Chen HW Wu ZL Gao YC Ma ZJ NF-κB signalling pathways in nucleus pulposus cell function and intervertebral disc degeneration Cell Prolif 54 7 2021 e13057 10.1111/cpr.13057 PMC8249791 34028920 240 Zhou M He SJ Liu W Yang MJ Hou ZY Meng Q EZH2 upregulates the expression of MAPK1 to promote intervertebral disc degeneration via suppression of miR-129-5p J Gene Med 24 3 2022 e3395 10.1002/jgm.3395 34668273 241 Xie T Yuan J Mei L Li P Pan R Luteolin suppresses TNF-alpha-induced inflammatory injury and senescence of nucleus pulposus cells via the Sirt6/NF-kappaB pathway Exp Ther Med 24 1 2022 469 35747154 10.3892/etm.2022.11396 PMC9204575 242 Hopfner KP Hornung V Molecular mechanisms and cellular functions of cGAS-STING signalling Nat Rev Mol Cell Biol 21 9 2020 501 521 32424334 10.1038/s41580-020-0244-x 243 Zheng JR Ma ZT Liu P Wei JW Min SX Shan Y EZH2 inhibits senescence-associated inflammation and attenuates intervertebral disc degeneration by regulating the cGAS/STING pathway via H3K27me3 Osteoarthr Cartil 33 5 2025 548 559 10.1016/j.joca.2025.02.771 39938633 244 Feng C Zhang Y Yang M Lan M Liu H Huang B Oxygen-sensing Nox4 generates genotoxic ROS to induce premature senescence of nucleus pulposus cells through MAPK and NF-κB pathways Oxid Med Cell Longev 2017 2017 7426458 10.1155/2017/7426458 PMC5632907 29147462 245 Liu C Liu L Yang M Li B Yi J Ai X A positive feedback loop between EZH2 and NOX4 regulates nucleus pulposus cell senescence in age-related intervertebral disc degeneration Cell Div 15 2020 2 32025238 10.1186/s13008-020-0060-x PMC6995653 246 Li G Ma L He S Luo R Wang B Zhang W WTAP-mediated m(6)A modification of lncRNA NORAD promotes intervertebral disc degeneration Nat Commun 13 1 2022 1469 35304463 10.1038/s41467-022-28990-6 PMC8933458 247 Wu O Jin Y Zhang Z Zhou H Xu W Chen L KMT2A regulates the autophagy-GATA4 axis through METTL3-mediated m(6)A modification of ATG4a to promote NPCs senescence and IVDD progression Bone Res 12 1 2024 67 39572532 10.1038/s41413-024-00373-1 PMC11582572 248 Li G Luo R Zhang W He S Wang B Liang H m6A hypomethylation of DNMT3B regulated by ALKBH5 promotes intervertebral disc degeneration via E4F1 deficiency Clin Transl Med 12 3 2022 e765 10.1002/ctm2.765 PMC8957938 35340126 249 Yang F Liu W Huang Y Yang S Shao Z Cai X Regulated cell death: implications for intervertebral disc degeneration and therapy J Orthop Translat 37 2022 163 172 36380883 10.1016/j.jot.2022.10.009 PMC9643304 250 Wang B Ma Y Zhang Y Yin X Therapeutic potential of ASK1 activators in cancer treatment: current insights and future directions Biomed Pharmacother 178 2024 117214 10.1016/j.biopha.2024.117214 39079264 251 Zou M Chen W Li J Qi X Wang X Liu F Apoptosis signal-regulated kinase-1 promotes nucleus pulposus cell senescence and apoptosis to regulate intervertebral disc degeneration Am J Pathol 194 9 2024 1737 1751 38879082 10.1016/j.ajpath.2024.05.004 252 Xiao L Gong D Liang L Liang A Liang H Xu X Inhibition of HDAC4 by GSK3β leads to downregulation of KLF5 and ASK1 and prevents the progression of intravertebral disc degeneration Clin Epigenet 13 1 2021 53 10.1186/s13148-021-01005-9 PMC7948391 33691773 253 Zheng C Guo D Zhang T Hu W Zhang B Feng H HDAC/H3K27ac-mediated transcription of NDUFA3 exerts protective effects on high glucose-treated human nucleus pulposus cells through improving mitochondrial function Sci Rep 14 1 2024 21165 10.1038/s41598-024-71810-8 PMC11387752 39256449 254 Liu HJ Liu HQ Meng ZY Zhang WS Mechanism of KMT2D-mediated epigenetic modification in IL-1β-induced nucleus pulposus cell degeneration Histol Histopathol 40 5 2025 733 743 39380528 10.14670/HH-18-813 255 Luo J Yang Y Wang X Chang X Fu S Role of pyroptosis in intervertebral disc degeneration and its therapeutic implications Biomolecules 12 12 2022 10.3390/biom12121804 PMC9775394 36551232 256 Yao QJ Lei Y Zhang YX Chen HR Dong XW Ye ZQ EZH2-H3K27me3-Mediated epigenetic silencing of DKK1 induces nucleus pulposus cell pyroptosis in intervertebral disc degeneration by activating NLRP3 and NAIP/NLRC4 Inflammation 48 2 2025 902 918 39052181 10.1007/s10753-024-02096-1 257 Zhou LP Zhang RJ Jia CY Kang L Zhang ZG Zhang HQ Ferroptosis: a potential target for the intervention of intervertebral disc degeneration Front Endocrinol 13 2022 1042060 10.3389/fendo.2022.1042060 PMC9630850 36339421 258 Fan C Chu G Yu Z Ji Z Kong F Yao L The role of ferroptosis in intervertebral disc degeneration Front Cell Dev Biol 11 2023 1219840 10.3389/fcell.2023.1219840 PMC10413580 37576601 259 Wu JJ Qin TY Han WT Zhang C Zhang XH Huang ZQ GLS1-mediated glutamine metabolism mitigates oxidative stress-induced matrix degradation, ferroptosis, and senescence in nucleus pulposus cells by modulating Fe(2+) homeostasis Free Radic Biol Med 228 2025 93 107 39710108 10.1016/j.freeradbiomed.2024.12.043 260 Sun KQ Shi YY Yan C Wang SM Han LH Li FD Glycolysis-Derived lactate induces ACSL4 expression and lactylation to activate ferroptosis during intervertebral disc degeneration Adv Sci (Weinh) 12 21 2025 e2416149 10.1002/advs.202416149 PMC12140309 40171826 261 Raj PP Intervertebral disc: anatomy-physiology-pathophysiology-treatment Pain Pract 8 1 2008 18 44 18211591 10.1111/j.1533-2500.2007.00171.x 262 Zhu Q Gao X Levene HB Brown MD Gu W Influences of nutrition supply and pathways on the degenerative patterns in human intervertebral disc Spine 41 7 2016 568 576 26650874 10.1097/BRS.0000000000001292 PMC4808448 263 Grunhagen T Shirazi-Adl A Fairbank JC Urban JP Intervertebral disk nutrition: a review of factors influencing concentrations of nutrients and metabolites Orthop Clin N Am 42 4 2011 465 477 [vii] 10.1016/j.ocl.2011.07.010 21944584 264 Newell N Little JP Christou A Adams MA Adam CJ Masouros SD Biomechanics of the human intervertebral disc: a review of testing techniques and results J Mech Behav Biomed Mater 69 2017 420 434 28262607 10.1016/j.jmbbm.2017.01.037 265 Jiang C Guo Q Jin Y Xu JJ Sun ZM Zhu DC Inhibition of EZH2 ameliorates cartilage endplate degeneration and attenuates the progression of intervertebral disc degeneration via demethylation of Sox-9 EBioMedicine 48 2019 619 629 31631036 10.1016/j.ebiom.2019.10.006 PMC6838408 266 Torre OM Mroz V Bartelstein MK Huang AH Iatridis JC Annulus fibrosus cell phenotypes in homeostasis and injury: implications for regenerative strategies Ann N Y Acad Sci 1442 1 2019 61 78 30604562 10.1111/nyas.13964 PMC6417974 267 Hong JY Kim H Jeon WJ Lee J Yeo C Lee YJ Epigenetic changes within the annulus fibrosus by DNA methylation in rat intervertebral disc degeneration model Cells 11 22 2022 10.3390/cells11223547 PMC9688069 36428977 268 Liu Q Luo J Wang H Zhang L Guo J Jin G GAS5, a long noncoding RNA, contributes to annulus fibroblast osteogenic differentiation and apoptosis in intervertebral disk degeneration via the miR-221-3p/SOX11 axis Aging (Albany NY) 16 4 2024 3896 3914 38407972 10.18632/aging.205567 PMC10929823 269 Ramteke P Watson B Toci M Tran VA Johnston S Tsingas M Sirt6 deficiency promotes senescence and age-associated intervertebral disc degeneration in mice Bone Res 13 1 2025 50 40335469 10.1038/s41413-025-00422-3 PMC12059161 270 Hoy SM Tazemetostat: first approval Drugs 80 5 2020 513 521 32166598 10.1007/s40265-020-01288-x 271 Keam SJ Valemetostat tosilate: first approval Drugs 82 16 2022 1621 1627 36380144 10.1007/s40265-022-01800-5 PMC9705507 272 Chen L Wu Y Wu Y Wang Y Sun L Li F The inhibition of EZH2 ameliorates osteoarthritis development through the Wnt/β-catenin pathway Sci Rep 6 2016 29176 10.1038/srep29176 PMC4990905 27539752 273 Jing H Liao L An Y Su X Liu S Shuai Y Suppression of EZH2 prevents the shift of osteoporotic MSC fate to adipocyte and enhances bone formation during osteoporosis Mol Ther 24 2 2016 217 229 26307668 10.1038/mt.2015.152 PMC4817806 274 Allas L Brochard S Rochoux Q Ribet J Dujarrier C Veyssiere A EZH2 inhibition reduces cartilage loss and functional impairment related to osteoarthritis Sci Rep 10 1 2020 19577 10.1038/s41598-020-76724-9 PMC7658239 33177650 275 Aury-Landas J Bazille C Allas L Bouhout S Chesneau C Leclercq S Anti-inflammatory and chondroprotective effects of the S-adenosylhomocysteine hydrolase inhibitor 3-Deazaneplanocin A, in human articular chondrocytes Sci Rep 7 1 2017 6483 28744016 10.1038/s41598-017-06913-6 PMC5526903 276 Song YQ Yang GJ Ma DL Wang W Leung CH The role and prospect of lysine-specific demethylases in cancer chemoresistance Med Res Rev 43 5 2023 1438 1469 37012609 10.1002/med.21955 277 Cao J Yan Q Lysine demethylation in pathogenesis Adv Exp Med Biol 1433 2023 1 14 37751133 10.1007/978-3-031-38176-8_1 278 Ding M Chen Z Cho E Park SW Lee TH Crucial role of lysine-specific histone demethylase 1 in RANKL-mediated osteoclast differentiation Int J Mol Sci 24 4 2023 10.3390/ijms24043605 PMC9967819 36835016 279 Liu H Zhai L Liu Y Lu D Vander Ark A Yang T The histone demethylase KDM5C controls female bone mass by promoting energy metabolism in osteoclasts Sci Adv 9 14 2023 eadg0731 10.1126/sciadv.adg0731 PMC10075994 37018401 280 Jun Z Xinmeng J Yue L Zhi W Yan Z Tieyi Y Jumonji domain containing-3 (JMJD3) inhibition attenuates IL-1β-induced chondrocytes damage in vitro and protects osteoarthritis cartilage in vivo Inflamm Res 69 7 2020 657 666 32394143 10.1007/s00011-020-01356-8 281 Assi R Cherifi C Cornelis FMF Zhou Q Storms L Pazmino S Inhibition of KDM7A/B histone demethylases restores H3K79 methylation and protects against osteoarthritis Ann Rheum Dis 82 7 2023 963 973 36927643 10.1136/ard-2022-223789 282 He ZX Wei BF Zhang X Gong YP Ma LY Zhao W Current development of CBP/p300 inhibitors in the last decade Eur J Med Chem 209 2021 112861 10.1016/j.ejmech.2020.112861 33045661 283 Chen Q Yang B Liu X Zhang XD Zhang L Liu T Histone acetyltransferases CBP/p300 in tumorigenesis and CBP/p300 inhibitors as promising novel anticancer agents Theranostics 12 11 2022 4935 4948 35836809 10.7150/thno.73223 PMC9274749 284 White J Derheimer FA Jensen-Pergakes K O'Connell S Sharma S Spiegel N Histone lysine acetyltransferase inhibitors: an emerging class of drugs for cancer therapy Trends Pharmacol Sci 45 3 2024 243 254 38383216 10.1016/j.tips.2024.01.010 285 Huo S Liu X Zhang S Lyu Z Zhang J Wang Y p300/CBP inhibitor A-485 inhibits the differentiation of osteoclasts and protects against osteoporotic bone loss Int Immunopharmacol 94 2021 107458 10.1016/j.intimp.2021.107458 33626422 286 Chen D Lu D Liu H Xue E Zhang Y Shang P Pharmacological blockade of PCAF ameliorates osteoarthritis development via dual inhibition of TNF-α-driven inflammation and ER stress EBioMedicine 50 2019 395 407 31735552 10.1016/j.ebiom.2019.10.054 PMC6921217 287 Yoshida M Kijima M Akita M Beppu T Potent and specific inhibition of mammalian histone deacetylase both in vivo and in vitro by trichostatin A J Biol Chem 265 28 1990 17174 17179 2211619 288 Ho TCS Chan AHY Ganesan A Thirty years of HDAC inhibitors: 2020 insight and hindsight J Med Chem 63 21 2020 12460 12484 32608981 10.1021/acs.jmedchem.0c00830 289 Vorinostat LiverTox: clinical and research information on drug-induced liver injury Bethesda (MD): Nat Inst Diabetics Digestive Kidney Diseases 2012 31643176 290 Makki MS Haqqi TM Histone deacetylase inhibitor vorinostat (SAHA) suppresses IL-1β-induced matrix metallopeptidase-13 expression by inhibiting IL-6 in osteoarthritis chondrocyte Am J Pathol 186 10 2016 2701 2708 27555113 10.1016/j.ajpath.2016.06.010 PMC5222971 291 Miao X Wu Y Wang P Zhang Q Zhou C Yu X Vorinostat ameliorates IL-1α-induced reduction of type II collagen by inhibiting the expression of ELF3 in chondrocytes J Biochem Mol Toxicol 35 9 2021 e22844 10.1002/jbt.22844 PMC8519056 34250664 292 Makki MS Haqqi TM Histone deacetylase inhibitor vorinostat (SAHA, MK0683) perturb miR-9-MCPIP1 axis to block IL-1β-induced IL-6 expression in human OA chondrocytes Connect Tissue Res 58 1 2017 64 75 27404795 10.1080/03008207.2016.1211113 PMC5233650 293 Peng X Wang T Wang Q Zhao Y Xu H Yang H Pan-histone deacetylase inhibitor vorinostat suppresses osteoclastic bone resorption through modulation of RANKL-evoked signaling and ameliorates ovariectomy-induced bone loss Cell Commun Signal 22 1 2024 160 38439009 10.1186/s12964-024-01525-w PMC10913587 294 Garnock-Jones KP Panobinostat: first global approval Drugs 75 6 2015 695 704 25837990 10.1007/s40265-015-0388-8 295 Wen ZH Huang JS Lin YY Yao ZK Lai YC Chen WF Chondroprotective effects of a histone deacetylase inhibitor, panobinostat, on pain behavior and cartilage degradation in anterior cruciate ligament transection-induced experimental osteoarthritic rats Int J Mol Sci 22 14 2021 10.3390/ijms22147290 PMC8306086 34298911 296 Ohzono H Hu Y Nagira K Kanaya H Okubo N Olmer M Targeting FoxO transcription factors with HDAC inhibitors for the treatment of osteoarthritis Ann Rheum Dis 82 2 2023 262 271 36109140 10.1136/ard-2021-221269 PMC11005918 297 Shi Y Jia B Xu W Li W Liu T Liu P Chidamide in relapsed or refractory peripheral T cell lymphoma: a multicenter real-world study in China J Hematol Oncol 10 1 2017 69 28298231 10.1186/s13045-017-0439-6 PMC5351273 298 Zhang X Liu L Liu X Huang Q Liu L Liu H Chidamide suppresses adipogenic differentiation of bone marrow derived mesenchymal stem cells via increasing REEP2 expression iScience 26 3 2023 106221 10.1016/j.isci.2023.106221 PMC9985040 36879811 299 Zheng Y Chen Y Lu X Weng Q Dai G Yu Y Inhibition of histone deacetylase 6 by tubastatin A attenuates the progress of osteoarthritis via improving mitochondrial function Am J Pathol 190 12 2020 2376 2386 32926854 10.1016/j.ajpath.2020.08.013 300 Shen Z Ji K Cai Z Huang C He X Xu H Inhibition of HDAC6 by Tubastatin A reduces chondrocyte oxidative stress in chondrocytes and ameliorates mouse osteoarthritis by activating autophagy Aging (Albany NY) 13 7 2021 9820 9837 33744850 10.18632/aging.202736 PMC8064156 301 Cheng C Shan W Huang W Ding Z Cui G Liu F ACY-1215 exhibits anti-inflammatory and chondroprotective effects in human osteoarthritis chondrocytes via inhibition of STAT3 and NF-κB signaling pathways Biomed Pharmacother 109 2019 2464 2471 30551507 10.1016/j.biopha.2018.11.017 302 Suraweera A O'Byrne KJ Richard DJ Epigenetic drugs in cancer therapy Cancer Metastasis Rev 44 1 2025 37 40011240 10.1007/s10555-025-10253-7 PMC11865116 303 Hafez DA Hassanin IA Teleb M Khattab SN Elkhodairy KA Elzoghby AO Recent advances in nanomedicine-based delivery of histone deacetylase inhibitors for cancer therapy Nanomedicine 16 25 2021 2305 2325 34551585 10.2217/nnm-2021-0196 304 Fraczek J Vanhaecke T Rogiers V Toxicological and metabolic considerations for histone deacetylase inhibitors Expert Opin Drug Metab Toxicol 9 4 2013 441 457 23286281 10.1517/17425255.2013.754011 305 Srinivas NR Clinical pharmacokinetics of panobinostat, a novel histone deacetylase (HDAC) inhibitor: review and perspectives Xenobiotica 47 4 2017 354 368 27226420 10.1080/00498254.2016.1184356 306 Van Veggel M Westerman E Hamberg P Clinical pharmacokinetics and pharmacodynamics of panobinostat Clin Pharmacokinet 57 1 2018 21 29 28667459 10.1007/s40262-017-0565-x 307 Li W Fu Y Wang W A real-world pharmacovigilance study investigating the toxicities of histone deacetylase inhibitors Ann Hematol 103 8 2024 3207 3217 38453702 10.1007/s00277-024-05691-2 308 Bondarev AD Attwood MM Jonsson J Chubarev VN Tarasov VV Schiöth HB Recent developments of HDAC inhibitors: emerging indications and novel molecules Br J Clin Pharmacol 87 12 2021 4577 4597 33971031 10.1111/bcp.14889 309 Patel VK Shirbhate E Tiwari P Kore R Veerasamy R Mishra A Multi-targeted HDAC inhibitors as anticancer agents: current status and future prospective Curr Med Chem 30 24 2023 2762 2795 36154583 10.2174/0929867329666220922105615 310 Fan W Zhang L Jiang Q Song W Yan F Zhang L Histone deacetylase inhibitor based prodrugs Eur J Med Chem 203 2020 112628 10.1016/j.ejmech.2020.112628 32679451 311 Rautio J Meanwell NA Di L Hageman MJ The expanding role of prodrugs in contemporary drug design and development Nat Rev Drug Discov 17 8 2018 559 587 29700501 10.1038/nrd.2018.46 312 Li J Zhu Y Xie M Zhang Q Du W Design, synthesis, and biological evaluation of target water-soluble hydroxamic acid-based HDACi derivatives as prodrugs Chem Biol Drug Des 94 4 2019 1760 1767 31155843 10.1111/cbdd.13577 313 Entin-Meer M Rephaeli A Yang X Nudelman A Nudelman A Haas-Kogan DA AN-113, a novel prodrug of 4-phenylbutyrate with increased anti-neoplastic activity in glioma cell lines Cancer Lett 253 2 2007 205 214 17346876 10.1016/j.canlet.2007.01.022 314 Ye J Deng R Wang X Song S Xu X Zhang JY Intra-articular histone deacetylase inhibitor microcarrier delivery to reduce osteoarthritis Nano Lett 23 23 2023 10832 10840 38009465 10.1021/acs.nanolett.3c03037 PMC10722529 315 Liu Y Xin L Wang S Tan J Zhu X Chen X Nanoparticles with reprogramming of mitochondrial respiratory chain complex and epigenetic modifications functions for osteoporosis treatment Biomaterials 324 2026 123468 10.1016/j.biomaterials.2025.123468 40472410 316 Zhu YM Dai Y Tian YC The peptide PROTAC modality: a new strategy for drug discovery MedComm 6 4 2020 e70133 2025 10.1002/mco2.70133 PMC11933449 40135198 317 Chen S Zheng Y Liang B Yin Y Yao J Wang Q The application of PROTAC in HDAC Eur J Med Chem 260 2023 115746 10.1016/j.ejmech.2023.115746 37607440 318 Chotitumnavee J Yamashita Y Takahashi Y Takada Y Iida T Oba M Selective degradation of histone deacetylase 8 mediated by a proteolysis targeting chimera (PROTAC) Chem Commun 58 29 2022 4635 4638 10.1039/d2cc00272h 35311871 319 Huang Z Zeng L Cheng B Li D Overview of class I HDAC modulators: inhibitors and degraders Eur J Med Chem 276 2024 116696 10.1016/j.ejmech.2024.116696 39094429 320 Su M Gong X Liu F An update on the emerging approaches for histone deacetylase (HDAC) inhibitor drug discovery and future perspectives Expet Opin Drug Discov 16 7 2021 745 761 10.1080/17460441.2021.1877656 33530771 321 Liang T Wang F Elhassan RM Cheng Y Tang X Chen W Targeting histone deacetylases for cancer therapy: trends and challenges Acta Pharm Sin B 13 6 2023 2425 2463 37425042 10.1016/j.apsb.2023.02.007 PMC10326266 322 Bresciani A Ontoria JM Biancofiore I Cellucci A Ciammaichella A Di Marco A Improved selective class I HDAC and novel selective HDAC3 inhibitors: beyond hydroxamic acids and benzamides ACS Med Chem Lett 10 4 2019 481 486 30996783 10.1021/acsmedchemlett.8b00517 PMC6466521 323 Sellmer A Stangl H Beyer M Grünstein E Leonhardt M Pongratz H Marbostat-100 defines a new class of potent and selective antiinflammatory and antirheumatic histone deacetylase 6 inhibitors J Med Chem 61 8 2018 3454 3477 29589441 10.1021/acs.jmedchem.7b01593 324 Tilekar K Hess JD Upadhyay N Bianco AL Schweipert M Laghezza A Thiazolidinedione \"Magic Bullets\" simultaneously targeting PPARγ and HDACs: design, synthesis, and investigations of their in vitro and in vivo antitumor effects J Med Chem 64 10 2021 6949 6971 34006099 10.1021/acs.jmedchem.1c00491 PMC10926851 325 Cheng C Yun F Ullah S Yuan Q Discovery of novel cyclin-dependent kinase (CDK) and histone deacetylase (HDAC) dual inhibitors with potent in vitro and in vivo anticancer activity Eur J Med Chem 189 2020 112073 10.1016/j.ejmech.2020.112073 31991336 326 Ahmad Hairi H Jayusman PA Shuid AN Revisiting resveratrol as an osteoprotective agent: molecular evidence from in vivo and in vitro studies Biomedicines 11 5 2023 10.3390/biomedicines11051453 PMC10216404 37239124 327 Jiang Y Luo W Wang B Wang X Gong P Xiong Y Resveratrol promotes osteogenesis via activating SIRT1/FoxO1 pathway in osteoporosis mice Life Sci 246 2020 117422 10.1016/j.lfs.2020.117422 32057903 328 Wong RH Thaung Zaw JJ Xian CJ Howe PR Regular supplementation with resveratrol improves bone mineral density in postmenopausal women: a randomized, placebo-controlled trial J Bone Miner Res 35 11 2020 2121 2131 32564438 10.1002/jbmr.4115 PMC7689937 329 Yang S Sun M Zhang X Protective effect of resveratrol on knee osteoarthritis and its molecular mechanisms: a recent review in preclinical and clinical trials Front Pharmacol 13 2022 921003 10.3389/fphar.2022.921003 PMC9357872 35959426 330 Zhou Z Deng Z Liu Y Zheng Y Yang S Lu W Protective effect of SIRT1 activator on the knee with osteoarthritis Front Physiol 12 2021 661852 10.3389/fphys.2021.661852 PMC8076744 33927645 331 Thaung Zaw JJ Howe PRC Wong RHX Long-term resveratrol supplementation improves pain perception, menopausal symptoms, and overall well-being in postmenopausal women: findings from a 24-month randomized, controlled, crossover trial Menopause 28 1 2020 40 49 32881835 10.1097/GME.0000000000001643 332 Liu MY Zhang L Zang WD Zhang KG Li HJ Gao YZ Pharmacological effects of resveratrol in intervertebral disc degeneration: a literature review Orthop Surg 14 12 2022 3141 3149 36303427 10.1111/os.13560 PMC9732612 333 Wu C Ge J Yang M Yan Q Wang Y Yu H Resveratrol protects human nucleus pulposus cells from degeneration by blocking IL-6/JAK/STAT3 pathway Eur J Med Res 26 1 2021 81 34321087 10.1186/s40001-021-00555-1 PMC8320225 334 Ji Q Zheng Y Zhang G Hu Y Fan X Hou Y Single-cell RNA-seq analysis reveals the progression of human osteoarthritis Ann Rheum Dis 78 1 2019 100 110 30026257 10.1136/annrheumdis-2017-212863 PMC6317448 335 Hu X Li Z Ji M Lin Y Chen Y Lu J Identification of cellular heterogeneity and immunogenicity of chondrocytes via single-cell RNA sequencing technique in human osteoarthritis Front Pharmacol 13 2022 1004766 10.3389/fphar.2022.1004766 PMC9562112 36249797 336 Bittner N Shi C Zhao D Ding J Southam L Swift D Primary osteoarthritis chondrocyte map of chromatin conformation reveals novel candidate effector genes Ann Rheum Dis 83 8 2024 1048 1059 38479789 10.1136/ard-2023-224945 PMC11287644 ",
  "metadata": {
    "Title of this paper": "Primary osteoarthritis chondrocyte map of chromatin conformation reveals novel candidate effector genes",
    "Journal it was published in:": "Journal of Orthopaedic Translation",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489922/"
  }
}