{
  "title": "Paper_1098",
  "abstract": "pmc Diagnostics (Basel) Diagnostics (Basel) 2841 diagno diagnostics Diagnostics 2075-4418 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468634 PMC12468634.1 12468634 12468634 41008715 10.3390/diagnostics15182344 diagnostics-15-02344 1 Review Stents and Emerging Alternatives in Upper Gastrointestinal Endoscopy: A Comprehensive Review Bernardi Francesca 1 https://orcid.org/0000-0002-9395-5468 Dell’Anna Giuseppe 1 Biamonte Paolo 1 https://orcid.org/0000-0002-0179-8929 Barchi Alberto 1 Fanti Lorella 1 Malesci Alberto 1 2 Fuccio Lorenzo 3 Sinagra Emanuele 4 https://orcid.org/0000-0002-0802-3173 Calabrese Giulio 5 6 https://orcid.org/0000-0002-2107-2156 Facciorusso Antonio 7 https://orcid.org/0009-0002-0895-1225 Bruni Angelo 3 https://orcid.org/0000-0003-0645-1710 Donatelli Gianfranco 6 8 Danese Silvio 1 2 https://orcid.org/0000-0002-9931-7221 Mandarino Francesco Vito 1 2 * Ichikawa Tatsuki Academic Editor 1 bernardi.francesca@hsr.it dellanna.giuseppe@hsr.it biamonte.paolo@hsr.it barchi.alberto@hsr.it 2 3 4 5 6 donatelligianfranco@gmail.com 7 8 * mandarino.francesco@hsr.it 16 9 2025 9 2025 15 18 497628 2344 21 7 2025 11 9 2025 12 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Endoscopy has revolutionized the management of gastrointestinal (GI) conditions, enabling less invasive treatments for cases that once required surgery. Among these innovations, endoscopically placed stents have played a crucial role in the treatment of upper GI tract diseases for many years. Today, stents remain a valid first-line treatment for specific indications; however, advancements in endoscopic technologies have led to a reassessment of their role in some conditions. While stents are still the primary choice for palliation of malignant esophageal strictures, endoscopic vacuum therapy (EVT) has demonstrated superior outcomes for esophageal leaks, and Endoscopic UltraSonography-guided placement of lumen-apposing metal stents (LAMS) has outperformed traditional stents in gastric obstructions. This review evaluates current stent indications, highlighting upper GI conditions where they remain the best option, while also exploring emerging technologies and updated clinical guidelines to optimize patient care. SEMS stent endoscopy EVT LAMS leak strictures This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Endoscopic stenting has become a cornerstone in the management of a broad spectrum of gastrointestinal (GI) conditions [ 1 2 1 Over the decades, stent use has evolved, driven by ongoing innovation and growing evidence supporting their efficacy. However, the advent of advanced endoscopic techniques has prompted a re-evaluation of stents as first-line therapy in selected scenarios. Approaches such as endoscopic ultrasound (EUS)-guided procedures and vacuum-assisted therapies have gained traction for addressing the limitations of stents in cases with higher complication risks or suboptimal outcomes [ 3 3 4 5 As therapeutic endoscopy continues to advance, it becomes increasingly important to define the respective roles of traditional stenting and emerging techniques. This review offers a comprehensive overview of the current landscape in 2025, analyzing stent types, indications, and clinical outcomes, while also exploring the expanding role of innovative endoscopic approaches. 2. Type of Stents Endoscopic stents are primarily categorized into three types: metallic stents, plastic stents, and biodegradable stents. Each type offers specific advantages tailored to distinct clinical scenarios. Currently, metallic stents are the most widely used, while plastic stents have largely fallen out of favor. 2.1. Metallic Stent Metallic stents, also known as self-expanding metal stents (SEMSs), are primarily composed of alloys such as nitinol (nickel–titanium), stainless steel, or cobalt–chromium [ 6 6 SEMS feature a flexible, open-mesh structure that provides luminal support while minimizing the risk of tissue embedding or overgrowth. The radial force they exert helps maintain lumen patency, even in the presence of significant obstruction [ 6 SEMSs are generally classified into three types: Fully covered (FC-SEMS): Encapsulated in a plastic or silicone membrane to prevent tissue ingrowth, facilitating easier removal or repositioning. However, they are associated with a higher risk of migration. Partially covered (PC-SEMS): Designed with uncovered ends to reduce migration risk, though this increases the potential for tissue overgrowth and embedding. Uncovered (UC-SEMS): These integrate more firmly with the surrounding tissue, providing long-term support but carrying a significant risk of complications such as tissue ingrowth [ 7 FC-SEMS and PC-SEMS are commonly used for the treatment of esophageal leaks, wall defects, and benign strictures due to their removability [ 8 2 In all indications, SEMSs help relieve symptoms and improve quality of life, particularly in patients who are not candidates for surgery or where surgery is not preferred [ 1 2 9 2.2. Plastic Stent Plastic stents, typically made from polymers such as polyethylene, polyurethane, or silicone, were historically used in GI endoscopy but are now infrequently employed due to their limitations. Unlike SEMS, plastic stents are non-expanding and rely on their preformed shape to maintain luminal patency [ 7 Today, their role—particularly in esophageal applications—has diminished, as metallic and biodegradable stents have proven to be more effective and reliable alternatives. 2.3. Biodegradable Stents Biodegradable stents (BDSs) represent a newer class of endoscopic devices designed to degrade naturally within the body through hydrolysis, breaking down into non-toxic byproducts such as carbon dioxide and water. This characteristic eliminates the need for removal procedures, reducing patient risk and procedural burden. They are primarily composed of the following materials: Polylactic acid (PLA): Offers a controlled degradation rate, maintaining structural integrity for weeks to months, depending on clinical needs. Polyglycolic acid (PGA): Degrades more rapidly but is less mechanically stable than PLA; it is often combined with PLA to optimize performance. Polycaprolactone (PCL): Used in specific cases where extended durability is required [ 10 BDS are available in both self-expanding and pre-shaped designs. They are particularly suitable for the management of benign strictures where prolonged luminal patency is not necessary, and where conventional stents pose risks of migration or complications upon removal. Emerging clinical evidence supports their safety and effectiveness, particularly in minimizing complications such as tissue ingrowth [ 10 11 2.4. Lumen-Apposing Metal Stent (LAMS) Lumen-apposing metal stents (LAMSs) are specialized self-expanding metal stents designed for endoscopic drainage and the creation of anastomoses between adjacent luminal structures [ 12 12 12 LAMSs are characterized by a fully covered, self-expanding structure with bilateral flared flanges, which ensure secure apposition between adjacent structures and minimize the risk of migration [ 12 13 Two main types of LAMSs are available, based on flange design [ 12 13 Saddle-shaped LAMS: Featuring wide flanges that provide strong tissue apposition, these are commonly used for drainage of pancreatic fluid collections. Dumbbell-shaped LAMS: With a more symmetrical design, these are optimized for gastrointestinal bypass procedures. Variations in stent length, diameter, and radial force allow for customization according to the target anatomy. LAMSs are typically deployed under endoscopic ultrasound (EUS) guidance, or under direct endoscopic visualization, using a preloaded catheter-based delivery system (usually via an 8F or 10F applicator) [ 12 13 Due to their unique design, LAMSs enable efficient drainage of pancreatic pseudocysts and walled-off necrosis, facilitate direct endoscopic necrosectomy, and allow biliary or gallbladder drainage in patients unfit for surgery or with failed endoscopic retrograde cholangiopancreatography (ERCP). Furthermore, they are increasingly used in gastrointestinal bypass procedures. Emerging evidence also supports their off-label use in the treatment of benign GI strictures. 3. Esophagus 3.1. Esophageal Leak Esophageal anastomotic leaks (ALs) are defined as “a full-thickness wall defect involving the esophagus, anastomosis, suture line, or conduit”. They are classified into severity grades: Type I: Localized leaks manageable with medical therapy; Type II: Requiring radiological or endoscopic intervention; Type III: Necessitating surgical intervention [ 14 Post-esophagectomy leaks occur in approximately 10% of patients [ 15 1 3.1.1. Role of Stent Indications and Mechanism of Action According to ESGE guidelines, temporary SEMS placement may be considered for esophageal leaks, fistulas, or perforations larger than 20 mm, though no specific type is universally recommended, and stent duration should be tailored to the clinical scenario [ 1 1 Over the past two decades, SEMSs have become the most widely used endoscopic therapy for esophageal wall defects [ 16 17 18 8 Figure 1 Efficacy and Adverse Events FC-SEMS and PC-SEMS demonstrate clinical success (CS) rates exceeding 60% in achieving closure of esophageal fistulas and leaks [ 16 In a study by Anderloni et al., involving 49 patients with ALs following esophageal surgery treated with SEMS, the CS rate was 60.5%, with no significant differences between FC-SEMS and PC-SEMS (57.1% vs. 64.7%, respectively). The overall adverse events (AEs) rate was 38.8% [ 19 Similarly, Plum et al. reported a 70% CS rate in 70 patients with ALs following Ivor Lewis esophagectomy treated with FC-SEMS. The median stent indwelling time was 28 days (range 7–87), and AEs occurred in 28.6% of cases [ 20 In another study by Segura et al., involving 23 patients treated for ALs or esophageal perforations, the CS rate reached 75% [ 21 Despite these favorable outcomes, SEMS placement is associated with several complications. Stent migration remains the most frequent, occurring in 10% to 40% of cases, with significantly higher rates—up to 62%—in cervical anastomoses due to anatomical and functional challenges [ 21 22 23 24 To mitigate this, larger-caliber or innovatively designed FC-SEMSs have been developed. For instance, the Niti-S Beta Esophageal Stent (Taewoong Medical, Gimpo, Republic of Korea), with its dual-layer coating and increased diameter, aims to reduce migration. At our institution, a study involving 37 patients with post-esophagectomy ALs treated with 75 double-layer FC-SEMSs (mean 2.0 ± 1.3 per patient) showed a CS rate of 62.2%, with stent migration in 22.7% of cases [ 17 Other strategies to minimize stent migration include endoscopic fixation techniques, such as suturing or the use of Through-The-Scope Clips (TTSC) and Over-The-Scope Clips (OTSC). Endoscopic suturing offers a durable and secure fixation by anchoring the stent directly to the esophageal wall. This is typically achieved using dedicated systems such as the OverStitch™ Endoscopic Suturing System (BostonScientific, Marlborough, MA, USA), which is mounted on the distal tip of a standard endoscope and allows precise suture placement under direct visualization [ 25 26 25 TTSCs provide a simpler alternative, functioning by securing the edges of the stent directly to the surrounding mucosa [ 27 27 OTSCs offer a more robust anchoring solution. These clips are mounted externally on the distal end of the endoscope and are deployed after retraction of the stent or target tissue into a preloaded applicator cap. Due to their spring-loaded mechanism, OTSCs provide strong tissue capture and firm stent fixation, significantly reducing the risk of migration [ 28 A meta-analysis by Papaefthymiou et al., which included 10 studies and 1014 patients, confirmed the superiority of fixation techniques over non-fixation approaches. The pooled analysis showed that fixation significantly reduced migration rates (OR 0.20, 95% CI 0.11–0.37; I 2 p 29 Another relevant complication of SEMS placement is tissue overgrowth, which occurs in approximately 15% to 20% of cases, particularly when the stent remains in place for more than one month [ 30 31 32 Stent-related leakage represents another significant concern. The reported incidence varies across studies, ranging from approximately 10% to 40% of patients treated with SEMS for anastomotic defects [ 22 33 34 35 36 Type 1: Proximal leaks due to an inadequate seal, often resolved by upsizing the stent or adding an additional one. Type 2: Distal retrograde leaks, commonly managed with decompression PEG, additional stenting, or a larger stent. Type 3: Leaks through breaches within the stent lining, typically caused by technical difficulties or suction-related trauma during placement, requiring stent replacement. Type 4: Leaks between adjacent stents, addressed by using a larger proximal stent. Type 5: Migration-related leaks, usually seen in cervical or mid-esophageal stenting without fixation, necessitating a larger stent or anchoring for stability. This classification provides a practical framework for identifying and managing stent-related leaks [ 36 Recently, the use of SEMS for the treatment of esophageal leaks and fistulas has been increasingly complemented by novel endoscopic techniques, some of which have demonstrated even greater efficacy in promoting esophageal wall healing. Among these, EVT and the VAC-stent have emerged as particularly promising options. 3.1.2. Endoscopic Vacuum Therapy (EVT) EVT was first introduced approximately 15 years ago for the treatment of colonic wall defects and is now widely applied in managing upper GI tract leaks and perforations [ 5 4 37 4 37 ® The total duration of EVT is guided by periodic endoscopic reassessments, typically performed every 3–5 days during sponge replacement, and varies according to clinical response. One of EVT’s key strengths is its versatility: the sponge can be placed intraluminally in cases of small defects without collections, or intracavitary in larger defects, allowing progressive adaptation to the shrinking cavity volume [ Figure 2 4 37 EVT has demonstrated high efficacy in the treatment of ALs and upper GI wall defects, with CS rates ranging from 90% to 100% [ 38 39 40 In the study by Richter et al., including 69 patients with esophageal AL and 33 with perforations, closure rates of 91% and 76% were achieved, respectively. Mediastinitis ( p p 41 Similarly, in a multicenter retrospective study by Jung et al. involving 119 patients—92.4% of whom had ALs post-esophagectomy—EVT achieved a CS rate of 70.6%. The mean number of sponge replacements was 3.93 in the success group and 4.20 in the failure group. Neoadjuvant therapy and the use of intraluminal placement emerged as independent predictors of failure [ 38 Multicenter series by Momblan et al. and Luttikhold et al., including 102 and 27 patients, respectively, also reported high success rates of 82% and 89% [ 39 40 EVT has proven effective even as rescue therapy after failed surgical revision or endoscopic attempts. At our center, in a cohort of 12 patients with AL following unsuccessful redo surgery or prior endoscopic treatments, EVT achieved complete defect closure in 75% of cases [ 42 The rate of AEs associated with EVT is generally low [ 43 40 The most commonly reported AEs include device dislocation, mild bleeding during sponge removal, and aspiration pneumonia [ 38 44 45 46 47 45 46 47 The most frequent long-term AE is the development of strictures at the treatment site, with an incidence ranging from 8% to 20%. These are generally manageable with endoscopic dilation [ 45 46 47 Figure 2 SEMS vs. EVT Recent evidence suggests that EVT may offer superior efficacy and safety compared to SEMS in the management of post-esophagectomy ALs. A meta-analysis by Mandarino et al., including eight comparative studies, found that EVT was associated with a significantly higher CS rate (OR 2.58, 95% CI 1.43–4.66), fewer device exchanges (pooled mean difference −4.90, 95% CI −6.71 to −3.08), shorter treatment duration (−9.18 days, 95% CI −17.05 to −1.32), and lower rates of complications (OR 0.35, 95% CI 0.18–0.71) and mortality (OR 0.47, 95% CI 0.24–0.92). However, in the subgroup analysis restricted to patients with AL after oncologic surgery, the difference in CS rates was not statistically significant (OR 1.59, 95% CI 0.74–3.40; I 2 44 A separate matched analysis by the same authors compared EVT and SEMS in the treatment of ALs < 30 mm after Ivor Lewis esophagectomy in 44 patients (22 in each group). Both techniques showed comparable CS (90.9% for EVT vs. 72.7% for SEMS), with no significant difference in the number of procedures or treatment duration. The most common complication in the SEMS group was stent migration [ 48 Despite its clinical advantages, EVT has been associated with significantly higher costs compared to stent placement. In a study by Baltin et al. involving 60 patients, the mean cost per case for EVT was nearly double that of stenting (EUR 9282 vs. EUR 5156), highlighting important financial implications that warrant consideration when evaluating its broader adoption [ 49 More recently, a prophylactic application of EVT—referred to as pre-emptive endoscopic negative pressure therapy (pENP)—has emerged as a promising strategy to prevent ALs in high-risk patients undergoing esophageal surgery [ 50 51 To conclude, although EVT appears more effective than SEMS for treating ALs and is associated with fewer complications, its higher costs remain a concern. Randomized controlled trials on larger populations are needed to determine whether its clinical benefits outweigh the economic burden and support its broader implementation. 3.1.3. VAC Stent An innovative device for the treatment of esophageal AL is the VAC stent, which combines the properties of SEMS and EVT. It consists of a FC-SEMS made of nitinol, coated with a silicone membrane, and externally wrapped with a polyurethane sponge connected to a vacuum pump [ 16 16 Figure 3 No standardized guidelines exist for setting the suction pressure for the VAC stent. However, the manufacturer recommends an initial pump setting of −125 mmHg for the first 12–24 h, followed by an adjustment to a range of −85 to −100 mmHg. Most existing studies have used continuous suction with negative pressure levels ranging from −65 to −125 mmHg [ 52 53 54 The VAC stent has proven effective in the treatment of post-esophagectomy leaks. Its first documented use dates back to 2020 and involved a patient with an esophago-jejunal AL who achieved complete healing after two VAC stents [ 55 In a study by Chon et al. involving 10 patients, VAC stents were effective in 70% of cases, with higher success when used as a first-line treatment (80%) compared to rescue therapy (60%) [ 56 Similarly, a prospective trial enrolling 20 patients reported an overall success rate of 60%, increasing to 71% when VAC stents were used as the initial treatment [ 57 54 In a multicenter study by Lange J. et al. involving 15 patients, an 80% success rate was reported, with an average of 2.7 VAC stents used per patient [ 52 58 The VAC stent has also been tested as a preemptive therapy in patients with high-risk anastomoses after neoadjuvant therapy undergoing esophagectomy. In this context, Lange et al. reported complete prevention of ALs in all 10 patients included in their study [ 53 Esophageal perforations, including iatrogenic and spontaneous cases (Boerhaave’s Syndrome), represent another established indication [ 59 60 VAC stent placement is generally well-tolerated, with a low incidence of AEs. Reported issues include minor mucosal bleeding, stent migration (7%), and esophageal tissue ingrowth [ 52 54 SEMS vs. VAC Stent Despite the lack of direct comparative studies, the VAC stent appears to be a potentially superior alternative to SEMS. Its main advantages lie in its integration with vacuum therapy, which enhances the drainage and aspiration of fluid collections associated with ALs, and in its significantly lower migration rate compared to conventional SEMSs. This is attributable to three key features: adhesion to the esophageal wall via negative pressure, the stabilizing effect of the anchored drainage tube, and the dumbbell-shaped flare ends that improve anchorage [ 16 The VAC stent is also less prone to stent leaks and related AEs due to its design and suction mechanism [ 57 However, it requires constant monitoring and connection to an external vacuum pump, which complicates discharge planning and increases hospital resource use. It must also be replaced more frequently, leading to greater procedural burden, patient discomfort, and costs compared to SEMS. A further limitation is its availability in a single size, whereas SEMSs come in various lengths—a critical factor for tailoring treatment to the location and size of the leak [ 59 Future comparative studies are needed to confirm whether the clinical benefits of VAC stent therapy—such as improved outcomes, shorter hospital stays, and fewer interventions—can translate into overall costs that are comparable to, or even lower than, those of current standard treatments [ Table 1 3.2. Malignant Dysphagia (Esophageal Cancer) Esophageal cancer is the eighth most common malignancy worldwide, with over 50% of patients presenting at an advanced stage [ 65 3.2.1. Role of Stent Indications and Mechanism of Action Esophageal stents have been used since 1959, initially inserted via laparotomy to palliate dysphagia caused by esophageal carcinoma [ 66 67 68 According to ESGE guidelines, PC-SEMS or FC-SEMS are the preferred options for the palliative management of malignant dysphagia, offering advantages over laser therapy, photodynamic therapy, and esophageal bypass. Additionally, SEMS placement is indicated for sealing malignant tracheoesophageal or bronchoesophageal fistulas [ 1 SEMSs are generally reserved for inoperable patients with a life expectancy of less than three months and poor performance status [ 1 69 1 Esophageal stent placement typically allows oral intake within 1 to 2 days and reduces dysphagia severity, thereby significantly improving quality of life [ Figure 4 70 Efficacy and Adverse Events Studies suggest that FC- and PC-SEMS are more effective than UC-SEMS for dysphagia palliation, primarily due to a reduced risk of tumor ingrowth—a major cause of recurrent dysphagia [ 71 72 In a multicenter study by Vakil et al., 62 patients with inoperable malignant esophageal obstruction were randomized to receive either FC-SEMS ( n n 71 p 71 A larger study comparing FC-SEMS (esophageal Nitinol Ultraflex stent, Boston Scientific) and UC-SEMS (Nitinol esophageal Strecker stent, Boston Scientific) in 152 patients with malignant esophageal or cardia stenosis confirmed these findings [ 72 p p 72 The most frequent AE of SEMS placement for malignant dysphagia is stent migration, which occurs in 4–36% of cases with FC-SEMS [ 73 74 Other complications include chest pain and stent obstruction due to tumor ingrowth or overgrowth, both of which can result in recurrent dysphagia [ 75 Tumor ingrowth is primarily associated with UC-SEMS, due to their uncovered mesh structure, but may also occur with FC-SEMS in cases of incomplete coverage or prolonged dwell time. Management options include mechanical removal or thermal ablation techniques to restore luminal patency, and in selected cases, the insertion of a second stent may be required. Tumor overgrowth at the proximal or distal ends of the stent occurs in 4–18% of cases, regardless of stent type [ 76 76 3.3. Benign Strictures Benign esophageal strictures are a significant clinical concern, with dysphagia being the most common symptom [ 77 77 78 79 3.3.1. Role of Stent Indication and Mechanism of Action Endoscopic dilation is the first-line treatment for benign strictures. However, in refractory strictures—defined as failure to reach 14 mm after biweekly dilations for more than 5 weeks, or inability to maintain the target diameter within 4 weeks post-dilation—or in complex strictures (length > 2 cm, diameter > 11 mm, irregular or angulated edges), stents are considered a second-line approach [ 1 Among available options, FC-SEMSs are the most commonly used [ 1 80 Figure 5 Efficacy and Adverse Events Despite promising short-term symptom relief, CS rates for FC-SEMS in benign esophageal strictures remain modest. In the study by Kim et al., 55 patients with refractory stenosis treated with FC-SEMS showed a significant reduction in mean dysphagia score from 2.8 to 1.3 ( p 81 Liu et al. evaluated the safety and efficacy of FC-SEMS in 24 patients with refractory benign esophagogastric anastomotic strictures, all of whom had previously undergone ≥5 sessions of Savary–Gilliard bougie dilation without meaningful clinical improvement. All patients experienced significant dysphagia relief during and shortly after stent placement, with dysphagia scores decreasing from 3–4 to 0–1. However, at 12-month follow-up, 18 patients (75%) remained symptom-free, while 6 (25%) continued to experience dysphagia [ 82 Stent migration is the most frequently reported complication, occurring in 25–35% of cases [ 81 82 82 3.3.2. Biodegradable Stents BDSs have emerged in recent years as a promising alternative for the treatment of benign esophageal strictures [ 83 Among the available evidence, Tomonori et al. evaluated the performance of BDS in a cohort of 30 patients with benign strictures, all of whom had a dysphagia score ≤2 and a history of at least five dilation sessions. Fourteen patients (46.7%; 95% CI: 28.3–65.7) experienced sustained symptom improvement up to three months post-placement, with a median dysphagia-free survival of 98 days (95% CI: 68–123). Most AEs—including esophageal/oropharyngeal pain, gastroesophageal reflux, and mucosal hyperplasia—were managed conservatively. However, one patient with a post-chemoradiotherapy (CRT) stricture developed a fatal left atrio-esophageal fistula approximately four months after stent placement [ 84 A notable recent advancement is the development of a biodegradable PTX-PLGA-coated magnesium stent. This device incorporates a paclitaxel-loaded polymer and provides a radial force of 83 Newtons, aimed at promoting fibroblast apoptosis and minimizing fibrotic response. In preclinical animal models, the stent maintained esophageal patency for at least three weeks and significantly reduced inflammatory infiltration and fibrous tissue formation [ 85 These findings support the potential of BDS as an alternative to removable stents, particularly in patients at higher risk for re-intervention. However, clinical data remains limited, and larger prospective studies are needed to better define their long-term safety and effectiveness. SEMS vs. BDS Compared to SEMS, BDSs demonstrate comparable efficacy and safety in the management of refractory benign esophageal strictures [ 86 87 88 A systematic review and meta-analysis by Fuccio et al., including 18 studies and 444 patients, reported a pooled CS rate of 40.5% for stent placement in refractory benign esophageal strictures, with no significant difference between SEMS (40.1%) and BDS (32.9%). AE rates were also similar, although stent migration was more frequent with SEMS (31.5%) than with BDS (15.3%) [ 87 These findings suggest that although BDSs eliminate the need for retrieval and offer a favorable degradation profile, their efficacy and safety are broadly comparable to SEMS. Given their higher upfront cost, careful patient selection based on factors like prior radiotherapy and stricture characteristics remains essential. 3.3.3. LAMS LAMSs have recently gained attention as a potential option for the treatment of benign esophageal strictures, particularly in refractory cases. Unlike traditional approaches that rely on EUS guidance, LAMSs can be deployed endoscopically under direct visualization, enabling precise positioning across the stricture. Ideally, the catheter is preloaded onto a guidewire previously passed through the stenotic segment. Available in multiple diameters (10 mm, 15 mm, and 20 mm), LAMSs offer flexibility in tailoring the treatment to individual anatomical and clinical needs [ 12 A meta-analysis by Giri et al. evaluated the outcomes of LAMS in patients with benign gastrointestinal strictures, including 18 studies and 527 patients [ 89 2 2 2 89 89 These results support the use of LAMS as a feasible and effective alternative in selected patients with benign, treatment-refractory esophageal strictures [ Figure 6 SEMS vs. LAMS Current evidence suggests that LAMS may offer improved outcomes compared to SEMS and BDS in the management of benign esophageal strictures. In the systematic review by Mohan et al. comparing LAMS, FCSEMS, and BDS for the treatment of benign GI strictures (74% of patients had refractory benign esophageal strictures), the pooled CS rate for LAMS was 78.8% (95% CI: 65.8–87.8%; I 2 p p 90 p p 90 Taken together, these findings suggest that LAMS may represent a more effective and better-tolerated alternative to conventional stents for patients with refractory benign strictures, particularly those that are short in length. Nonetheless, further prospective studies are needed to confirm their long-term safety and to better define their optimal indications. 3.3.4. Incisional Therapy Indication and Mechanism of Action Incisional therapy is an endoscopic technique primarily used for managing short (<2 cm), fibrotic, benign esophageal strictures—particularly anastomotic strictures and Schatzki rings [ 91 92 93 The procedure involves longitudinal incisions made along the stricture using various endoscopic knives (needle knife, hook knife, or IT-knife), typically parallel to the esophageal axis [ 94 Radial Incision (RI): 4–8 radial cuts without removal of scar tissue. Radial Incision and Cutting (RIC): combines incisions with excision of fibrotic tissue. Radial Incision and Selective Cutting (RISC): targets only selected fibrotic segments to minimize the risk of restenosis [ 95 A transparent cap may be added to the endoscope tip to improve visualization [ Figure 7 94 Efficacy and Adverse Events Data increasingly supports the use of incision therapy for the treatment of benign esophageal strictures. Lee et al. performed endoscopic incision therapy in 24 patients with benign anastomotic strictures following esophagojejunostomy, none of whom had previously undergone dilation. After a two-year follow-up, over 85% of patients remained free from dysphagia after a single treatment session [ 93 Excellent outcomes have also been reported for treatment-naïve strictures. A randomized controlled trial by Hordijk et al. compared incision therapy with Savary dilation (Savary–Gilliard bougies, Wilson-Cook Medical Inc., Winston-Salem, NC, USA) in 62 patients with untreated esophageal anastomotic strictures. The study found no significant differences in the mean number of dilations required (2.9; 95% CI, 2.7–4.1 vs. 3.3; 95% CI, 2.3–3.6; p p p 96 A recent systematic review and meta-analysis by Jimoh et al., including five studies comparing incision therapy with balloon dilation, showed that incision therapy was associated with a significantly lower likelihood of stricture recurrence (OR 0.35, 95% CI 0.13–0.92, p 2 p 2 97 AEs associated with incision therapy are generally mild and include bleeding, perforation, and post-procedural pain. The procedure is considered safe when performed by experienced endoscopists. However, caution is advised in cases of long, fibrotic, or highly tortuous strictures, as these may not only be less responsive to treatment but also carry a higher risk of complications [ 94 97 Some authors have described the use of incision therapy as an adjunctive treatment preceding balloon dilation. The rationale lies in the ability of radial incision therapy to weaken the fibrotic tissue and facilitate the subsequent effect of balloon dilation, thereby enhancing disruption of the stricture [ 98 98 Compared to traditional stenting, incision therapy offers several advantages. It avoids the placement of foreign bodies, thereby reducing complications such as stent migration, mucosal injury, and the need for repeat procedures for stent removal [ 94 Table 2 3.4. Esophageal Acute Variceal Bleeding Acute bleeding from esophageal varices accounts for up to 70% of upper gastrointestinal hemorrhage cases in patients with cirrhosis [ 99 100 3.4.1. Role of Stent Indication and Mechanism of Action In refractory cases—where pharmacological, endoscopic, and radiologic interventions fail—the placement of fully covered self-expandable metal stents (FC-SEMS) is recommended, as outlined in ESGE guidelines [ 1 The most studied device is the SX-ELLA DANIS stent, a removable nitinol stent with atraumatic ends, specifically designed for endoscopic deployment and intended for up to 30 days of in situ use. It serves as a temporary measure and a bridge to definitive therapies such as transjugular intrahepatic portosystemic shunt (TIPS) or liver transplantation [ 101 Efficacy and Adverse Events FC-SEMSs have shown high efficacy in controlling variceal bleeding, particularly in refractory cases. A systematic review and meta-analysis by Shao et al., including five studies, reported a TS rate of 96.7% and an initial hemostasis rate of 93.9%, with rebleeding occurring in 13.2% of cases [ 102 103 The most recent meta-analysis reported an immediate bleeding control rate of 91% (95% CI: 82–95%; I 2 2 104 No severe AEs have been reported. The most common complication, as seen in other contexts, is stent migration. Songtanin et al. reported a migration rate of 18% (95% CI: 9–32%; I 2 2 104 Compared to balloon tamponade (BT) with the Sengstaken–Blakemore tube, esophageal stents are better tolerated, allow oral intake, and are associated with lower complication rates in the management of refractory acute variceal bleeding [ 105 106 4. Gastroduodenal Tract—Gastric Outlet Obstruction Gastric outlet obstruction (GOO) is defined as a mechanical or functional blockage of the distal stomach, pyloric canal, or proximal duodenum, resulting in impaired gastric emptying and disruption of the normal passage of gastric contents into the small intestine. It may arise from intrinsic luminal narrowing, extrinsic compression, or motility disorders such as gastroparesis [ 107 108 109 110 111 112 4.1. Malignant GOO The two most frequent malignancies associated with GOO are distal gastric carcinoma and pancreatic adenocarcinoma [ 113 114 To guide therapeutic decisions, malignant GOO can be anatomically classified into three types [ 115 Type I: Stenosis at the duodenal bulb without papillary involvement. Type II: Obstruction in the second part of the duodenum involving the papilla—requiring combined palliation of both gastric obstruction and biliary drainage. Type III: Obstruction in the third portion of the duodenum, sparing the papilla [ 115 4.1.1. Role of Stent Indications and Mechanism of Action For years, enteral SEMSs were considered the main minimally invasive option for the management of malignant GOO. They served as an alternative to surgical gastrojejunostomy (S-GE), offering reduced perioperative risk and faster recovery compared to surgery [ 116 117 116 117 Stent selection between FC and UC-SEMS was traditionally made on a case-by-case basis. In patients with GOO due to biliopancreatic malignancies, biliary drainage was typically performed first, as early placement of a duodenal SEMS could hinder subsequent ERCP and biliary access [ 118 119 Figure 8 118 119 Efficacy and Adverse Events SEMS placement has traditionally been effective in rapidly relieving symptoms of malignant GOO; however, its long-term durability remains a key limitation [ 120 121 A comprehensive meta-analysis by Mintziras et al. (2019), which included 1306 patients treated with SEMS, reported high TS rates (83.3–100%) and CS rates ranging from 75% to 100% [ 122 122 In terms of stent selection, FC-SEMSs were often favored for their enhanced patency, despite a higher migration risk (16–25%), while UC-SEMS provided better anchorage but were more susceptible to tissue ingrowth (4–26%) [ 123 124 Although SEMSs offered a minimally invasive approach for malignant GOO palliation, their long-term effectiveness was limited by device-related dysfunctions. As a result, SEMSs have increasingly been replaced by EUS-GE with LAMS, a technique that provides more durable symptom relief and, in selected patients, has shown superior clinical outcomes even when compared to S-GE. 4.1.2. LAMS Indication and Mechanism of Action EUS-guided gastroenterostomy (EUS-GE) is an advanced endoscopic technique that creates a gastrojejunal anastomosis using a LAMS under EUS guidance [ 125 The technique was developed to combine the minimally invasive nature and rapid recovery associated with enteral SEMS with the long-term efficacy of surgical gastrojejunostomy (S-GE). Unlike SEMSs, which are placed across the malignant stricture and often suffer from tumor ingrowth or migration, EUS-GE creates a bypass distant from the obstruction, potentially reducing the risk of stent dysfunction and improving durability. The procedure involves deploying a LAMS between the stomach and a jejunal loop distal to the obstruction. Loop identification can be achieved through the following: Direct technique: puncture of the jejunal loop with a 19G needle and contrast injection to confirm position [ 126 Device-assisted EUS-GE: balloon or enteroscope passed across the stenosis to aid EUS visualization and targeting [ 127 Wireless Endoscopic Simplified Technique (WEST): described by Bronswijk et al. in 2020 and currently the most widely used technique [ 128 128 According to ESGE guidelines, the primary indication for EUS-GE is malignant GOO, as an alternative to SEMS or S-GE [ 3 3 Figure 9 129 Efficacy and Adverse Events Building on its technical rationale and increasing adoption in expert centers, EUS-GE has demonstrated high efficacy and a favorable safety profile in clinical practice. In the prospective cohort study by Vanella et al., which included 70 patients with malignant GOO (75.7% with pancreatic cancer, 60% with metastatic disease), both TS and clinical success CS rates were 97.1% [ 130 130 Similarly, a study by Trieu et al. evaluating 207 patients undergoing EUS-GE reported sustained long-term efficacy (CS 97.2%; TS 95.7%) with LAMS remaining in place in 63.6% of patients for over 3 months, and in 21% for more than one year. The overall rate of late AEs was 3.4%, confirming the favorable safety profile of the procedure [ 131 Early AEs, primarily EUS-GE-related, include misdeployment, perforation, non-perforative peritonitis, and bleeding [ 132 132 132 132 A retrospective multicenter study by Ghandour et al. further classified LAMS misdeployment into four types [ 133 Type 1 (63.1%): distal flange in the peritoneum, proximal in the stomach, without enterotomy—managed with LAMS removal and OTSC placement. Type 2 (30.4%): distal flange in the peritoneum, proximal in the stomach, with confirmed enterotomy—managed with repeat LAMS or LAMS-in-LAMS bridging. Type 3 (2.2%): distal flange in the small bowel, proximal in the peritoneum—managed surgically. Type 4 (4.3%): distal flange in the colon, proximal in the stomach—managed conservatively or surgically after tract maturation. Sems vs. LAMS Comparative studies evaluating EUS-GE versus duodenal stent placement have shown that EUS-GE offers a higher initial CS rate, a lower risk of stent dysfunction requiring secondary endoscopic intervention, and better long-term symptom control, ultimately improving patients’ quality of life [ 134 135 A meta-analysis by Miller et al. (2023), including 16 studies and 1541 patients, confirmed superior CS rates for EUS-GE compared to both SEMS and surgical gastrojejunostomy (S-GE) (OR vs. SEMS or surgery: 2.60, 95% CI 1.58–4.28; OR vs. SEMS alone: 5.08, 95% CI 3.42–7.55) [ 136 137 In a matched subgroup analysis within the prospective study by Vanella et al., EUS-GE achieved a CS rate of 100% versus 75.0% with duodenal stenting ( p p 130 The first RCT to directly compare EUS-GE and SEMS as palliative treatments for malignant GOO was conducted across seven high-volume centers by Teoh et al. The study enrolled 97 patients with GOO due to unresectable gastro-duodenal or pancreatobiliary malignancies, who were randomized to receive either EUS-GE (48 patients) or SEMS placement (49 patients) [ 138 p 138 Regarding safety, a network meta-analysis showed that EUS-GE was associated with a lower risk of AEs compared to SEMS (RR 0.58) and a comparable risk to surgical gastrojejunostomy (RR 1.43) [ 137 137 136 Although LAMS are more expensive than duodenal SEMS, recent evidence shows that EUS-GE is cost-effective compared with SEMS [ 139 139 139 139 This innovative approach represents an excellent option for selected patients. However, it is currently limited to highly specialized centers. Further studies and broader dissemination are essential to establish EUS-GE as a widely accessible and potentially first-line therapeutic strategy for malignant GOO [ Table 3 4.2. Benignant GOO Benignant GOO refers to a non-malignant narrowing of the distal stomach, pylorus, or duodenum, which impedes the normal passage of gastric contents into the small intestine. Before the advent of effective Helicobacter pylori eradication therapy, peptic ulcer disease was the most common cause of benign GOO, accounting for approximately 90% of cases [ 140 112 For benign strictures, endoscopic balloon dilation remains the first-line treatment, especially in partial obstruction [ 141 4.2.1. Role of Stent FC-SEMSs have been explored as a treatment option in patients refractory to dilation or unfit for surgery. However, their use in benign settings remains controversial. In selected cases—such as peptic ulcer-related strictures unresponsive to dilation—temporary SEMS placement has shown favorable outcomes, with stent removal typically performed after approximately 12 weeks of treatment [ 142 Despite these isolated reports, stent migration, tissue ingrowth, and difficulties in removal represent significant limitations of SEMS in the benign setting. Moreover, in cases of extrinsic compression, available evidence suggests that neither dilation nor stenting provides effective long-term relief [ 143 4.2.2. LAMS Emerging data supports the use of EUS-GE in selected patients with benign GOO, particularly those who are ineligible for surgery. The technique has been proposed both as a definitive treatment—such as in chronic pancreatitis or peptic ulcer-related obstruction—and as a bridge to elective surgery [ 144 A systematic review and meta-analysis by Canakis et al. included 10 studies and 181 patients with benign GOO unfit for surgery. Reported etiologies included chronic pancreatitis ( n n n n 145 2 2 145 2 2 145 2 2 145 Despite these promising results, current ESGE guidelines restrict the use of EUS-GE to malignant GOO, primarily due to concerns regarding stent misdeployment [ 3 p 146 5. Conclusions and Future Perspectives The landscape of endoluminal stenting in 2025 underscores both its benefits and emerging limitations in managing GI diseases. Stents remain effective, cost-efficient, and minimally invasive for certain conditions. However, their role is increasingly challenged in other scenarios where alternative devices and procedures have surpassed stents in terms of efficacy, cost-effectiveness, and lower rates of AEs. Equally relevant is the consideration of training requirements and learning curves, especially for technically demanding procedures such as EUS-guided stent placement. These techniques demand not only advanced endoscopic skills but also prolonged mentoring, simulation-based practice, and high procedural volumes to achieve proficiency. At present, access to such interventions is largely restricted to tertiary referral centers, which raises concerns about equity of care and the scalability of these innovations. In the coming years, stents and these alternative therapies will likely coexist—either complementing each other or competing for dominance, depending on the clinical context. Future randomized controlled trials are essential to compare these approaches directly and establish their relative efficacy, safety, and long-term outcomes. Such research will be critical to fostering a more personalized approach to treatment, where the choice between stent and alternative therapy is tailored to patient characteristics, pathology, and procedural complexity. In parallel, innovation in stent technology—such as enhanced anti-migration designs, bioresorbable materials with tunable degradation rates, and anti-biofilm coatings—will further expand their utility. Altogether, these advancements point toward an increasingly sophisticated and patient-centered framework for endoscopic management of upper gastrointestinal diseases. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, F.V.M., F.B., P.B., G.D. (Giuseppe Dell’Anna), A.B. (Alberto Barchi), L.F. (Lorenzo Fuccio), E.S., G.C., A.F. and A.B. (Angelo Bruni); resources, L.F. (Lorella Fanti) and G.D. (Gianfranco Donatelli); writing—original draft preparation, F.B., P.B. and F.V.M.; writing—review and editing, F.V.M., F.B., G.D. (Giuseppe Dell’Anna) and P.B.; supervision, F.V.M., S.D. and A.M.; project administration, F.V.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not appliable. Informed Consent Statement Not appliable. Data Availability Statement No new data were created. Conflicts of Interest S.D. has served as a speaker, consultant, and advisory board member for Schering-Plough, AbbVie, Actelion, Alphawasserman, AstraZeneca, Cellerix, Cosmo Pharmaceuticals, Ferring, Genentech, Grunenthal, Johnson and Johnson, Millenium Takeda, MSD, Nikkiso Europe GmbH, NovoNordisk, Nycomed, Pfizer, Pharmacosmos, UCB Pharma, and Vifor. The other authors declare no conflicts of interest. Abbreviations GI, gastrointestinal; EUS-GE, EUS-guided gastroenterostomy; GOO, gastric outlet obstruction; EVT, endoscopic vacuum therapy; SEMS, self-expanding metal stents; FC-SEMS, fully covered SEMS; PC-SEMS, partially covered SEMS; UC-SEMS, uncovered SEMS; BDS, biodegradable stent; LAMS, lumen-apposing metal stent; AL, anastomotic leaks; CS, clinical success; AE, adverse events; TTSC, Through-The-Scope Clips; OTSC, Over-The-Scope Clips; S-GE, surgical gastrojejunostomy. References 1. Spaander M.C.W. Van Der Bogt R.D. Baron T.H. Albers D. Blero D. De Ceglie A. Conio M. Czakó L. Everett S. Garcia-Pagán J.-C. Esophageal Stenting for Benign and Malignant Disease: European Society of Gastrointestinal Endoscopy (ESGE) Guideline—Update 2021 Endoscopy 2021 53 751 762 10.1055/a-1475-0063 33930932 2. van Hooft J.E. Veld J.V. Arnold D. Beets-Tan R.G.H. Everett S. Götz M. van Halsema E.E. Hill J. Manes G. Meisner S. Self-Expandable Metal Stents for Obstructing Colonic and Extracolonic Cancer: European Society of Gastrointestinal Endoscopy (ESGE) Guideline—Update 2020 Endoscopy 2020 52 389 407 10.1055/a-1140-3017 32259849 3. van der Merwe S.W. van Wanrooij R.L.J. Bronswijk M. Everett S. Lakhtakia S. Rimbas M. Huc T. Kunda R. Badaoui A. Law R. Therapeutic Endoscopic Ultrasound: European Society of Gastrointestinal Endoscopy (ESGE) Guideline|ESGE Available online: https://www.esge.com/therapeutic-endoscopic-ultrasound-european-society-of-gastrointestinal-endoscopy-guideline (accessed on 18 September 2024) 10.1055/a-1717-1391 34937098 4. Mandarino F.V. Barchi A. Fanti L. Azzolini F. Rosati R. Danese S. Endoscopic Vacuum Therapy in the Treatment of Postesophagectomy Leaks: Is Intracavitary the Way? Gastrointest. Endosc. 2022 96 873 10.1016/j.gie.2022.05.014 36270706 5. Bemelman W.A. Baron T.H. Endoscopic Management of Transmural Defects, Including Leaks, Perforations, and Fistulae Gastroenterology 2018 154 1938 1946.e1 10.1053/j.gastro.2018.01.067 29454791 6. Jackson C.E. Johnson L.S.J. Williams D.A. Laasch H.-U. Edwards D.W. Harvey A.G. A Viewpoint on Material and Design Considerations for Oesophageal Stents with Extended Lifetime J. Mater. Sci. 2022 57 3 26 10.1007/s10853-021-06700-9 7. Kozarek R. Baron T.H. Self-Expanding Stents: Present and Future Gastrointestinal and Pancreatico-Biliary Diseases: Advanced Diagnostic and Therapeutic Endoscopy Testoni P.A. Inoue H. Wallace M.B. Springer International Publishing Cham, Switzerland 2022 829 834 978-3-030-56993-8 8. Seven G. Irani S. Ross A.S. Gan S.I. Gluck M. Low D. Kozarek R.A. Partially versus Fully Covered Self-Expanding Metal Stents for Benign and Malignant Esophageal Conditions: A Single Center Experience Surg. Endosc. 2013 27 2185 2192 10.1007/s00464-012-2738-x 23370964 9. Ahmed O. Lee J.H. Thompson C.C. Faulx A. AGA Clinical Practice Update on the Optimal Management of the Malignant Alimentary Tract Obstruction: Expert Review Clin. Gastroenterol. Hepatol. 2021 19 1780 1788 10.1016/j.cgh.2021.03.046 33813072 10. Lorenzo-Zúñiga V. Moreno-de-Vega V. Marín I. Boix J. Biodegradable Stents in Gastrointestinal Endoscopy World J. Gastroenterol. 2014 20 2212 2217 10.3748/wjg.v20.i9.2212 24605020 PMC3942826 11. Köneş O. Oran E. Self-Expanding Biodegradable Stents for Postoperative Upper Gastrointestinal Issues J. Soc. Laparosc. Robot. Surg. 2018 22 e2018.00011 10.4293/JSLS.2018.00011 PMC6016862 29950802 12. Mussetto A. Fugazza A. Fuccio L. Triossi O. Repici A. Anderloni A. Current Uses and Outcomes of Lumen-Apposing Metal Stents Ann. Gastroenterol. 2018 31 535 540 10.20524/aog.2018.0287 30174389 PMC6102456 13. Teoh A.Y.B. Binmoeller K.F. Lau J.Y.W. Single-Step EUS-Guided Puncture and Delivery of a Lumen-Apposing Stent for Gallbladder Drainage Using a Novel Cautery-Tipped Stent Delivery System Gastrointest. Endosc. 2014 80 1171 10.1016/j.gie.2014.03.038 24830582 14. Low D.E. Alderson D. Cecconello I. Chang A.C. Darling G.E. D’Journo X.B. Griffin S.M. Hölscher A.H. Hofstetter W.L. Jobe B.A. International Consensus on Standardization of Data Collection for Complications Associated with Esophagectomy: Esophagectomy Complications Consensus Group (ECCG) Ann. Surg. 2015 262 286 294 10.1097/SLA.0000000000001098 25607756 15. Kuppusamy M.K. Low D.E. International Esodata Study Group (IESG) Evaluation of International Contemporary Operative Outcomes and Management Trends Associated with Esophagectomy: A 4-Year Study of >6000 Patients Using ECCG Definitions and the Online Esodata Database Ann. Surg. 2022 275 515 525 10.1097/SLA.0000000000004309 33074888 16. Rosianu C.G. Hoara P. Achim F. Birla R. Bolocan A. Mohssen A. Copca N. Constantinoiu S. The Use of Esophageal Stents in the Management of Postoperative Fistulas-Current Status, Clinical Outcomes and Perspectives-Review Life 2023 13 966 10.3390/life13040966 37109495 PMC10144597 17. Mandarino F.V. Esposito D. Spelta G.N.E. Cavestro G.M. Rosati R. Parise P. Gemma M.F. Fanti L. Double Layer Stent for the Treatment of Leaks and Fistula after Upper Gastrointestinal Oncologic Surgery: A Retrospective Study Updates Surg. 2022 74 1055 1062 10.1007/s13304-021-01155-8 34510378 18. Dasari B.V.M. Neely D. Kennedy A. Spence G. Rice P. Mackle E. Epanomeritakis E. The Role of Esophageal Stents in the Management of Esophageal Anastomotic Leaks and Benign Esophageal Perforations Ann. Surg. 2014 259 852 860 10.1097/SLA.0000000000000564 24509201 19. Anderloni A. Genco C. Massidda M. Di Leo M. Fumagalli U.R. Rosati R. Correale L. Maselli R. Ferrara E.C. Jovani M. Self-Expanding Metal Stents for the Treatment of Post-Surgical Esophageal Leaks: A Tertiary Referral Center Experience Dig. Surg. 2019 36 309 316 10.1159/000489817 29870974 20. Plum P.S. Herbold T. Berlth F. Christ H. Alakus H. Bludau M. Chang D.-H. Bruns C.J. Hölscher A.H. Chon S.-H. Outcome of Self-Expanding Metal Stents in the Treatment of Anastomotic Leaks After Ivor Lewis Esophagectomy World J. Surg. 2019 43 862 869 10.1007/s00268-018-4832-2 30377723 21. Sanz Segura P. Gotor Delso J. García Cámara P. Sierra Moros E. Val Pérez J. Soria Santeodoro M.T. Uribarrena Amezaga R. Use of Double-Layered Covered Esophageal Stents in Post-Surgical Esophageal Leaks and Esophageal Perforation: Our Experience Gastroenterol. Hepatol. Engl. Ed. 2022 45 198 203 10.1016/j.gastrohep.2021.04.005 34052404 22. Freeman R.K. Ascioti A.J. Giannini T. Mahidhara R.J. Analysis of Unsuccessful Esophageal Stent Placements for Esophageal Perforation, Fistula, or Anastomotic Leak Ann. Thorac. Surg. 2012 94 959 965 10.1016/j.athoracsur.2012.05.047 22795060 23. Iglesias Jorquera E. Egea Valenzuela J. Serrano Jiménez A. Carrilero Zaragoza G. Ortega Sabater A. Sánchez Velasco E. Ruiz de Angulo D. Munitiz V. Parrilla P. Alberca de Las Parras F. Endoscopic Treatment of Postoperative Esophagogastric Leaks with Fully Covered Self-Expanding Metal Stents Rev. Esp. Enferm. Dig. 2021 113 14 22 10.17235/reed.2020.6821/2019 33118355 24. Smith E.A. Daly S.C. Smith B. Hinojosa M. Nguyen N.T. The Role of Endoscopic Stent in Management of Postesophagectomy Leaks Am. Surg. 2020 86 1411 1417 10.1177/0003134820964495 33074734 25. Ge P.S. Thompson C.C. The Use of the Overstitch to Close Perforations and Fistulas Gastrointest. Endosc. Clin. N. Am. 2020 30 147 161 10.1016/j.giec.2019.08.010 31739961 PMC6885379 26. Fujii L.L. Bonin E.A. Baron T.H. Gostout C.J. Wong Kee Song L.M. Utility of an Endoscopic Suturing System for Prevention of Covered Luminal Stent Migration in the Upper GI Tract Gastrointest. Endosc. 2013 78 787 793 10.1016/j.gie.2013.06.014 23871095 27. Wang T.J. Aihara H. Thompson A.C. Schulman A.R. Thompson C.C. Ryou M. Choosing the Right Through-the-Scope Clip: A Rigorous Comparison of Rotatability, Whip, Open/Close Precision, and Closure Strength (with Videos) Gastrointest. Endosc. 2019 89 77 86.e1 10.1016/j.gie.2018.07.025 30056253 28. Manta R. Del Nero L. Todd B. Parodi A. De Ceglie A. Zito F. Pasquale L. Zullo A. Conio M. Newly Designed OTS Clip for Preventing Fully-Covered Self-Expandable Metal Stent Migration in the Gastrointestinal Tract Endosc. Int. Open 2023 11 E284 E287 10.1055/a-2032-4147 36968979 PMC10038747 29. Papaefthymiou A. Gkolfakis P. Basiliya K. Ramai D. Tziatzios G. Sehgal V. Telese A. Norton B. Aslam N. Johnson G. Success Rates of Fixation Techniques on Prevention of Esophageal Stent Migration: A Systematic Review and Meta-Analysis Endoscopy 2024 56 22 30 10.1055/a-2147-8294 37536365 30. van Boeckel P.G.A. Dua K.S. Weusten B.L.A.M. Schmits R.J.H. Surapaneni N. Timmer R. Vleggaar F.P. Siersema P.D. Fully Covered Self-Expandable Metal Stents (SEMS), Partially Covered SEMS and Self-Expandable Plastic Stents for the Treatment of Benign Esophageal Ruptures and Anastomotic Leaks BMC Gastroenterol. 2012 12 19 10.1186/1471-230X-12-19 22375711 PMC3313862 31. Speer E. Dunst C.M. Shada A. Reavis K.M. Swanström L.L. Covered Stents in Cervical Anastomoses Following Esophagectomy Surg. Endosc. 2016 30 3297 3303 10.1007/s00464-015-4661-4 26558909 32. Bohle W. Louris I. Schaudt A. Koeninger J. Zoller W.G. Predictors for Treatment Failure of Self-Expandable Metal Stents for Anastomotic Leak after Gastro-Esophageal Resection J. Gastrointest. Liver Dis. 2020 29 145 149 10.15403/jgld-463 32530980 33. Eisendrath P. Cremer M. Himpens J. Cadière G.-B. Le Moine O. Devière J. Endotherapy Including Temporary Stenting of Fistulas of the Upper Gastrointestinal Tract after Laparoscopic Bariatric Surgery Endoscopy 2007 39 625 630 10.1055/s-2007-966533 17611917 34. Salminen P. Gullichsen R. Laine S. Use of Self-Expandable Metal Stents for the Treatment of Esophageal Perforations and Anastomotic Leaks Surg. Endosc. 2009 23 1526 1530 10.1007/s00464-009-0432-4 19301070 35. Schoppmann S.F. Langer F.B. Prager G. Zacherl J. Outcome and Complications of Long-Term Self-Expanding Esophageal Stenting Dis. Esophagus 2013 26 154 158 10.1111/j.1442-2050.2012.01337.x 22409454 36. Stephens E.H. Correa A.M. Kim M.P. Gaur P. Blackmon S.H. Classification of Esophageal Stent Leaks: Leak Presentation, Complications, and Management Ann. Thorac. Surg. 2014 98 297 304 10.1016/j.athoracsur.2014.01.063 24835152 37. Mandarino F.V. Fanti L. Barchi A. Vespa E. Danese S. Endoscopic Vacuum Therapy for Esophageal Perforations: Is It Risk Effective for Every Size of Defect? Endoscopy 2023 55 971 10.1055/a-2070-5524 37757794 38. Jung D.H. Huh C.W. Min Y.W. Park J.C. Endoscopic Vacuum Therapy for the Management of Upper GI Leaks and Perforations: A Multicenter Retrospective Study of Factors Associated with Treatment Failure (with Video) Gastrointest. Endosc. 2022 95 281 290 10.1016/j.gie.2021.09.018 34555386 39. Momblan D. Gimeno Garcia A.Z. Busquets D. Juzgado D. García Lledó J. Ferrero E. Tejedor-Tejada J. Junquera F. Díaz-Tasende J. Moris M. Endoscopic Vacuum Therapy for Upper Gastrointestinal Leaks and Perforations: Analysis from a Multicenter Spanish Registry Am. J. Gastroenterol. 2023 118 1797 1806 10.14309/ajg.0000000000002475 37606066 40. Luttikhold J. Pattynama L.M.D. Seewald S. Groth S. Morell B.K. Gutschow C.A. Ida S. Nilsson M. Eshuis W.J. Pouw R.E. Endoscopic Vacuum Therapy for Esophageal Perforation: A Multicenter Retrospective Cohort Study Endoscopy 2023 55 859 864 10.1055/a-2042-6707 36828030 PMC10465237 41. Richter F. Hendricks A. Schniewind B. Hampe J. Heits N. von Schönfels W. Reichert B. Eberle K. Ellrichmann M. Baumann P. Eso-Sponge ® BJS Open 2022 6 zrac030 10.1093/bjsopen/zrac030 35451010 PMC9023777 42. Mandarino F.V. Barchi A. Fanti L. D’Amico F. Azzolini F. Esposito D. Biamonte P. Lauri G. Danese S. Endoscopic Vacuum Therapy for Post-Esophagectomy Anastomotic Dehiscence as Rescue Treatment: A Single Center Case Series Esophagus 2022 19 417 425 10.1007/s10388-022-00912-x 35347509 43. Jung D.H. Yun H.-R. Lee S.J. Kim N.W. Huh C.W. Endoscopic Vacuum Therapy in Patients with Transmural Defects of the Upper Gastrointestinal Tract: A Systematic Review with Meta-Analysis J. Clin. Med. 2021 10 2346 10.3390/jcm10112346 34071877 PMC8197794 44. Mandarino F.V. Barchi A. D’Amico F. Fanti L. Azzolini F. Viale E. Esposito D. Rosati R. Fiorino G. Bemelman W.A. Endoscopic Vacuum Therapy (EVT) versus Self-Expandable Metal Stent (SEMS) for Anastomotic Leaks after Upper Gastrointestinal Surgery: Systematic Review and Meta-Analysis Life 2023 13 287 10.3390/life13020287 36836644 PMC9968149 45. Laukoetter M.G. Mennigen R. Neumann P.A. Dhayat S. Horst G. Palmes D. Senninger N. Vowinkel T. Successful Closure of Defects in the Upper Gastrointestinal Tract by Endoscopic Vacuum Therapy (EVT): A Prospective Cohort Study Surg. Endosc. 2017 31 2687 2696 10.1007/s00464-016-5265-3 27709328 46. Ahrens M. Schulte T. Egberts J. Schafmayer C. Hampe J. Fritscher-Ravens A. Broering D.C. Schniewind B. Drainage of Esophageal Leakage Using Endoscopic Vacuum Therapy: A Prospective Pilot Study Endoscopy 2010 42 693 698 10.1055/s-0030-1255688 20806153 47. Pournaras D.J. Hardwick R.H. Safranek P.M. Sujendran V. Bennett J. Macaulay G.D. Hindmarsh A. Endoluminal Vacuum Therapy (E-Vac): A Treatment Option in Oesophagogastric Surgery World J. Surg. 2018 42 2507 2511 10.1007/s00268-018-4463-7 29372375 PMC6060786 48. Mandarino F.V. Barchi A. Leone L. Fanti L. Azzolini F. Viale E. Esposito D. Salmeri N. Puccetti F. Barbieri L. Endoscopic Vacuum Therapy versus Self-Expandable Metal Stent for Treatment of Anastomotic Leaks < 30 Mm Following Oncologic Ivor-Lewis Esophagectomy: A Matched Case-Control Study Surg. Endosc. 2023 37 7039 7050 10.1007/s00464-023-10213-8 37353654 49. Baltin C. Kron F. Urbanski A. Zander T. Kron A. Berlth F. Kleinert R. Hallek M. Hoelscher A.H. Chon S.-H. The Economic Burden of Endoscopic Treatment for Anastomotic Leaks Following Oncological Ivor Lewis Esophagectomy PLoS ONE 2019 14 e0221406 10.1371/journal.pone.0221406 31461487 PMC6713440 50. Mandarino F.V. Barchi A. Biamonte P. Esposito D. Azzolini F. Fanti L. Danese S. The Prophylactic Use of Endoscopic Vacuum Therapy for Anastomotic Dehiscence after Rectal Anterior Resection: Is It Feasible for Redo Surgery? Tech. Coloproctol. 2022 26 319 320 10.1007/s10151-021-02566-w 34981274 51. Müller P.C. Morell B. Vetter D. Raptis D.A. Kapp J.R. Gubler C. Gutschow C.A. Preemptive Endoluminal Vacuum Therapy to Reduce Morbidity After Minimally Invasive Ivor Lewis Esophagectomy: Including a Novel Grading System for Postoperative Endoscopic Assessment of GI-Anastomoses Ann. Surg. 2021 274 751 757 10.1097/SLA.0000000000005125 34334639 52. Lange J. Kähler G. Bernhardt J. Knievel J. Dormann A. Hügle U. Eisenberger C.F. Heiss M.M. The VACStent Trial: Combined Treatment of Esophageal Leaks by Covered Stent and Endoscopic Vacuum Therapy Surg. Endosc. 2023 37 3657 3668 10.1007/s00464-023-09861-7 36639580 PMC10156910 53. Lange J. Eisenberger C.F. Knievel J. Linderer A. Heiss M.M. Preemptive Endoluminal Vacuum Therapy with the VACStent-A Pilot Study to Reduce Anastomotic Leakage after Ivor Lewis Hybrid Esophagectomy Front. Surg. 2023 10 1133083 10.3389/fsurg.2023.1133083 37066006 PMC10097441 54. Pattynama L.M.D. Eshuis W.J. Van Berge Henegouwen M.I. Bergman J.J.G.H.M. Pouw R.E. Vacuum-Stent: A Combination of Endoscopic Vacuum Therapy and an Intraluminal Stent for Treatment of Esophageal Transmural Defects Front. Surg. 2023 10 1145984 10.3389/fsurg.2023.1145984 36923375 PMC10010284 55. Chon S.-H. Bartella I. Bürger M. Rieck I. Goeser T. Schröder W. Bruns C.J. VACStent: A New Option for Endoscopic Vacuum Therapy in Patients with Esophageal Anastomotic Leaks after Upper Gastrointestinal Surgery Endoscopy 2020 52 E166 E167 10.1055/a-1047-0244 31791095 56. Chon S.-H. Töx U. Lorenz F. Rieck I. Wagner B.J. Kleinert R. Fuchs H.F. Goeser T. Quaas A. Bruns C.J. A Novel Hybrid Stent with Endoscopic Vacuum Therapy for Treating Leaks of the Upper Gastrointestinal Tract Visc. Med. 2021 37 403 409 10.1159/000512320 34722723 PMC8543322 57. Chon S.-H. Scherdel J. Rieck I. Lorenz F. Dratsch T. Kleinert R. Gebauer F. Fuchs H.F. Goeser T. Bruns C.J. A New Hybrid Stent Using Endoscopic Vacuum Therapy in Treating Esophageal Leaks: A Prospective Single-Center Experience of Its Safety and Feasibility with Mid-Term Follow-Up Dis. Esophagus 2022 35 doab067 10.1093/dote/doab067 34561712 58. Bludau M. Fuchs H.F. Herbold T. Maus M.K.H. Alakus H. Popp F. Leers J.M. Bruns C.J. Hölscher A.H. Schröder W. Results of Endoscopic Vacuum-Assisted Closure Device for Treatment of Upper GI Leaks Surg. Endosc. 2018 32 1906 1914 10.1007/s00464-017-5883-4 29218673 59. Lange J. Knievel J. Wichmann D. Kähler G. Wiedbrauck F. Hellmich T. Kandler M. Bernhardt J. Scholz D. Beyna T. Clinical Implantation of 92 VACStents in the Upper Gastrointestinal Tract of 50 Patients—Applicability and Safety Analysis of an Innovative Endoscopic Concept Front. Surg. 2023 10 1182094 10.3389/fsurg.2023.1182094 37215348 PMC10198570 60. Shah J. Carpentier D. Lemmers A. Refractory Eso-pleural Fistula Following Roux-en-Y Gastric Bypass: VacStent to the Rescue!! Dig. Endosc. 2024 36 221 10.1111/den.14736 38037507 61. Fischer A. Bausch D. Richter-Schrag H.-J. Use of a Specially Designed Partially Covered Self-Expandable Metal Stent (PSEMS) with a 40-Mm Diameter for the Treatment of Upper Gastrointestinal Suture or Staple Line Leaks in 11 Cases Surg. Endosc. 2013 27 642 647 10.1007/s00464-012-2507-x 22955898 62. Mennigen R. Harting C. Lindner K. Vowinkel T. Rijcken E. Palmes D. Senninger N. Laukoetter M.G. Comparison of Endoscopic Vacuum Therapy Versus Stent for Anastomotic Leak After Esophagectomy J. Gastrointest. Surg. 2015 19 1229 1235 10.1007/s11605-015-2847-7 25967140 63. Licht E. Markowitz A.J. Bains M.S. Gerdes H. Ludwig E. Mendelsohn R.B. Rizk N.P. Shah P. Strong V.E. Schattner M.A. Endoscopic Management of Esophageal Anastomotic Leaks After Surgery for Malignant Disease Ann. Thorac. Surg. 2016 101 301 304 10.1016/j.athoracsur.2015.06.072 26428689 PMC4910386 64. Schweigert M. Dubecz A. Stadlhuber R.J. Muschweck H. Stein H.J. Risk of Stent-Related Aortic Erosion after Endoscopic Stent Insertion for Intrathoracic Anastomotic Leaks after Esophagectomy Ann. Thorac. Surg. 2011 92 513 518 10.1016/j.athoracsur.2011.02.083 21592460 65. Liu C.-Q. Ma Y.-L. Qin Q. Wang P.-H. Luo Y. Xu P.-F. Cui Y. Epidemiology of Esophageal Cancer in 2020 and Projections to 2030 and 2040 Thorac. Cancer 2023 14 3 11 10.1111/1759-7714.14745 36482832 PMC9807450 66. Celestin L.R. Permanent Intubation in Inoperable Cancer of the Oesophagus and Cardia: A New Tube Ann. R. Coll. Surg. Engl. 1959 25 165 170 13808746 PMC2413789 67. Atkinson M. Ferguson R. Fibreoptic Endoscopic Palliative Intubation of Inoperable Oesophagogastric Neoplasms Br. Med. J. 1977 1 266 267 10.1136/bmj.1.6056.266 65197 PMC1604121 68. Frimberger E. Expanding Spiral—A New Type of Prosthesis for the Palliative Treatment of Malignant Esophageal Stenoses Endoscopy 1983 15 (Suppl. 1) 213 214 10.1055/s-2007-1021511 6191973 69. Dai Y. Li C. Xie Y. Liu X. Zhang J. Zhou J. Pan X. Yang S. Interventions for Dysphagia in Oesophageal Cancer Cochrane Database Syst. Rev. 2014 2014 CD005048 10.1002/14651858.cd005048.pub4 25354795 PMC8106614 70. Wang C. Wei H. Li Y. Comparison of Fully-Covered vs Partially Covered Self-Expanding Metallic Stents for Palliative Treatment of Inoperable Esophageal Malignancy: A Systematic Review and Meta-Analysis BMC Cancer 2020 20 73 10.1186/s12885-020-6564-6 32000719 PMC6990518 71. Vakil N. Morris A.I. Marcon N. Segalin A. Peracchia A. Bethge N. Zuccaro G. Bosco J.J. Jones W.F. A Prospective, Randomized, Controlled Trial of Covered Expandable Metal Stents in the Palliation of Malignant Esophageal Obstruction at the Gastroesophageal Junction Am. J. Gastroenterol. 2001 96 1791 1796 10.1111/j.1572-0241.2001.03923.x 11419831 72. Saranovic D. Djuric-Stefanovic A. Ivanovic A. Masulovic D. Pesko P. Fluoroscopically Guided Insertion of Self-Expandable Metal Esophageal Stents for Palliative Treatment of Patients with Malignant Stenosis of Esophagus and Cardia: Comparison of Uncovered and Covered Stent Types Dis. Esophagus 2005 18 230 238 10.1111/j.1442-2050.2005.00484.x 16128779 73. Chou I.-T. Yu F.-J. Shih H.-Y. Liu Y.-W. Lee J.-Y. Chou S.-H. Hsu J.-S. Chen W.-C. Wu I.-C. Risk factors of stent migration in esophageal cancer patients who underwent fully-covered self-expanding metal stents for malignant dysphagia or tracheoesophageal fistula J. Formos. Med. Assoc. 2024 124 432 438 10.1016/j.jfma.2024.05.014 38824057 74. Bick B.L. Imperiale T.F. Johnson C.S. DeWitt J.M. Endoscopic Suturing of Esophageal Fully Covered Self-Expanding Metal Stents Reduces Rates of Stent Migration Gastrointest. Endosc. 2017 86 1015 1021 10.1016/j.gie.2017.03.1545 28396273 75. Kang Y. A Review of Self-Expanding Esophageal Stents for the Palliation Therapy of Inoperable Esophageal Malignancies BioMed Res. Int. 2019 2019 9265017 10.1155/2019/9265017 31080835 PMC6475558 76. Lowe A.S. Sheridan M.B. Esophageal Stenting Semin. Interv. Radiol. 2004 21 157 166 10.1055/s-2004-860874 PMC3036223 21331125 77. Adler D.G. Siddiqui A.A. Endoscopic Management of Esophageal Strictures Gastrointest. Endosc. 2017 86 35 43 10.1016/j.gie.2017.03.004 28288841 78. Repici A. Small A.J. Mendelson A. Jovani M. Correale L. Hassan C. Ridola L. Anderloni A. Ferrara E.C. Kochman M.L. Natural History and Management of Refractory Benign Esophageal Strictures Gastrointest. Endosc. 2016 84 222 228 10.1016/j.gie.2016.01.053 26828759 79. Ravich W.J. Endoscopic Management of Benign Esophageal Strictures Curr. Gastroenterol. Rep. 2017 19 50 10.1007/s11894-017-0591-8 28840483 80. Siersema P.D. Stenting for Benign Esophageal Strictures Endoscopy 2009 41 363 373 10.1055/s-0029-1214532 19340743 81. Kim J.H. Song H.-Y. Choi E.K. Kim K.R. Shin J.H. Lim J.-O. Temporary Metallic Stent Placement in the Treatment of Refractory Benign Esophageal Strictures: Results and Factors Associated with Outcome in 55 Patients Eur. Radiol. 2009 19 384 390 10.1007/s00330-008-1151-2 18726598 82. Liu J. Hu Y. Cui C. Li Y. Lin X. Fu J. Removable, Fully Covered, Self-Expandable Metal Stents for the Treatment of Refractory Benign Esophagogastric Anastomotic Strictures Dysphagia 2012 27 260 264 10.1007/s00455-011-9361-1 21826422 83. Walter D. van den Berg M.W. Hirdes M.M. Vleggaar F.P. Repici A. Deprez P.H. Viedma B.L. Lovat L.B. Weusten B.L. Bisschops R. Dilation or Biodegradable Stent Placement for Recurrent Benign Esophageal Strictures: A Randomized Controlled Trial Endoscopy 2018 50 1146 1155 10.1055/a-0602-4169 29883979 84. Yano T. Yoda Y. Nonaka S. Abe S. Kawata N. Yoshio T. Sasaki T. Tanaka S. Sasaki F. Maekita T. Pivotal Trial of a Biodegradable Stent for Patients with Refractory Benign Esophageal Stricture Esophagus 2022 19 516 524 10.1007/s10388-022-00909-6 35106667 85. Liu L.-L. Qin J. Zeng C.-H. Du R.-J. Pan T. Ji J.-J. Lu L.-G. Chen L. Liu D.-F. Yang J. Biodegradable PTX-PLGA-Coated Magnesium Stent for Benign Esophageal Stricture: An Experimental Study Acta Biomater. 2022 146 495 505 10.1016/j.actbio.2022.04.038 35487426 86. Canena J.M.T. Liberato M.J.A. Rio-Tinto R.A.N. Pinto-Marques P.M. Romão C.M.M. Coutinho A.V.M.P. Neves B.A.H.C. Santos-Silva M.F.C.N. A Comparison of the Temporary Placement of 3 Different Self-Expanding Stents for the Treatment of Refractory Benign Esophageal Strictures: A Prospective Multicentre Study BMC Gastroenterol. 2012 12 70 10.1186/1471-230X-12-70 22691296 PMC3447662 87. Fuccio L. Hassan C. Frazzoni L. Miglio R. Repici A. Clinical Outcomes Following Stent Placement in Refractory Benign Esophageal Stricture: A Systematic Review and Meta-Analysis Endoscopy 2016 48 141 148 10.1055/s-0034-1393331 26528754 88. Imaz-Iglesia I. García-Pérez S. Nachtnebel A. Martín-Águeda B. Sánchez-Piedra C. Karadayi B. Demirbaş A.R. Biodegradable Stents for the Treatment of Refractory or Recurrent Benign Esophageal Stenosis Expert Rev. Med. Devices 2016 13 583 599 10.1080/17434440.2016.1184967 27152556 89. Giri S. Vaidya A. Kale A. Jearth V. Sundaram S. Efficacy of Lumen-Apposing Metal Stents for the Management of Benign Gastrointestinal Stricture: A Systematic Review and Meta-Analysis Ann. Gastroenterol. 2023 36 524 532 10.20524/aog.2023.0819 37664226 PMC10433256 90. Mohan B.P. Chandan S. Garg R. Mohamed S. Shakhatreh M. Dugyala S. Mashiana H.S. Ponnada S. Asokkumar R. Adler D.G. Lumen-Apposing Metal Stents, Fully Covered Self-Expanding Metal Stents, and Biodegradable Stents in the Management of Benign of GI Strictures: A Systematic Review and Meta-Analysis J. Clin. Gastroenterol. 2019 53 560 573 10.1097/MCG.0000000000001228 31149932 91. Siersema P.D. How to Approach a Patient with Refractory or Recurrent Benign Esophageal Stricture Gastroenterology 2019 156 7 10 10.1053/j.gastro.2018.11.040 30472230 92. Raskin J.B. Manten H. Harary A. Redlhammer D.E. Rogers A.I. Transendoscopic Electrosurgical Incision of Lower Esophageal (Schatzki) Rings: A New Treatment Modality Gastrointest. Endosc. 1985 31 391 393 10.1016/S0016-5107(85)72257-2 4076738 93. Lee T.H. Lee S.-H. Park J.-Y. Lee C.K. Chung I.-K. Kim H.S. Park S.-H. Kim S.-J. Hong S.J. Lee M.S. Primary Incisional Therapy with a Modified Method for Patients with Benign Anastomotic Esophageal Stricture Gastrointest. Endosc. 2009 69 1029 1033 10.1016/j.gie.2008.07.018 19215919 94. Liang C. Tan Y. Lu J. Le M. Liu D. Endoscopic Incision for Treatment of Benign Gastrointestinal Strictures Expert Rev. Gastroenterol. Hepatol. 2020 14 445 452 10.1080/17474124.2020.1766966 32380885 95. Muto M. Ezoe Y. Yano T. Aoyama I. Yoda Y. Minashi K. Morita S. Horimatsu T. Miyamoto S.-I. Ohtsu A. Usefulness of Endoscopic Radial Incision and Cutting Method for Refractory Esophagogastric Anastomotic Stricture (with Video) Gastrointest. Endosc. 2012 75 965 972 10.1016/j.gie.2012.01.012 22520877 96. Hordijk M.L. van Hooft J.E. Hansen B.E. Fockens P. Kuipers E.J. A Randomized Comparison of Electrocautery Incision with Savary Bougienage for Relief of Anastomotic Gastroesophageal Strictures Gastrointest. Endosc. 2009 70 849 855 10.1016/j.gie.2009.02.023 19573869 97. Jimoh Z. Jogiat U. Hajjar A. Verhoeff K. Turner S. Wong C. Kung J.Y. Bédard E.L.R. Endoscopic Incisional Therapy for Benign Anastomotic Strictures after Esophagectomy or Gastrectomy: A Systematic Review and Meta-Analysis Surg. Endosc. 2024 38 2995 3003 10.1007/s00464-024-10817-8 38649492 98. Hagiwara A. Togawa T. Yamasaki J. Shirasu M. Sakakura C. Yamagishi H. Endoscopic Incision and Balloon Dilatation for Cicatricial Anastomotic Strictures Hepatogastroenterology 1999 46 997 999 10370654 99. Augustin S. González A. Genescà J. Acute Esophageal Variceal Bleeding: Current Strategies and New Perspectives World J. Hepatol. 2010 2 261 274 10.4254/wjh.v2.i7.261 21161008 PMC2998973 100. Gralnek I.M. Camus Duboc M. Garcia-Pagan J.C. Fuccio L. Karstensen J.G. Hucl T. Jovanovic I. Awadie H. Hernandez-Gea V. Tantau M. Endoscopic Diagnosis and Management of Esophagogastric Variceal Hemorrhage: European Society of Gastrointestinal Endoscopy (ESGE) Guideline Endoscopy 2022 54 1094 1120 10.1055/a-1939-4887 36174643 101. Mohan B.P. Chandan S. Khan S.R. Kotagiri R. Kassab L.L. Olaiya B. Ponnada S. Ofosu A. Adler D.G. Self-Expanding Metal Stents versus TIPS in Treatment of Refractory Bleeding Esophageal Varices: A Systematic Review and Meta-Analysis Endosc. Int. Open 2020 8 E291 E300 10.1055/a-1067-4563 32118103 PMC7035032 102. Shao X.-D. Qi X.-S. Guo X.-Z. Esophageal Stent for Refractory Variceal Bleeding: A Systemic Review and Meta-Analysis BioMed. Res. Int. 2016 2016 4054513 10.1155/2016/4054513 27517043 PMC4969514 103. McCarty T.R. Njei B. Self-Expanding Metal Stents for Acute Refractory Esophageal Variceal Bleeding: A Systematic Review and Meta-Analysis Dig. Endosc. 2016 28 539 547 10.1111/den.12626 26845490 PMC4940258 104. Songtanin B. Kahathuduwa C. Nugent K. Esophageal Stent in Acute Refractory Variceal Bleeding: A Systematic Review and a Meta-Analysis J. Clin. Med. 2024 13 357 10.3390/jcm13020357 38256491 PMC10816372 105. Escorsell À. Pavel O. Cárdenas A. Morillas R. Llop E. Villanueva C. Garcia-Pagán J.C. Bosch J. Variceal Bleeding Study Group Esophageal Balloon Tamponade versus Esophageal Stent in Controlling Acute Refractory Variceal Bleeding: A Multicenter Randomized, Controlled Trial Hepatology 2016 63 1957 1967 10.1002/hep.28360 26600191 106. Rodrigues S.G. Cárdenas A. Escorsell À. Bosch J. Balloon Tamponade and Esophageal Stenting for Esophageal Variceal Bleeding in Cirrhosis: A Systematic Review and Meta-Analysis Semin. Liver Dis. 2019 39 178 194 10.1055/s-0039-1678726 30912098 107. Mandarino F.V. Testoni S.G.G. Barchi A. Azzolini F. Sinagra E. Pepe G. Chiti A. Danese S. Imaging in Gastroparesis: Exploring Innovative Diagnostic Approaches, Symptoms, and Treatment Life 2023 13 1743 10.3390/life13081743 37629600 PMC10455809 108. Rossi R.E. Elvevi A. Sciola V. Mandarino F.V. Danese S. Invernizzi P. Massironi S. Paradoxical Association between Dyspepsia and Autoimmune Chronic Atrophic Gastritis: Insights into Mechanisms, Pathophysiology, and Treatment Options World J. Gastroenterol. 2023 29 3733 3747 10.3748/wjg.v29.i23.3733 37398891 PMC10311608 109. Mandarino F.V. Testoni S.G.G. Barchi A. Pepe G. Esposito D. Fanti L. Viale E. Biamonte P. Azzolini F. Danese S. Gastric Emptying Study before Gastric Peroral Endoscopic Myotomy (G-POEM): Can Intragastric Meal Distribution Be a Predictor of Success? Gut 2023 72 1019 1020 10.1136/gutjnl-2022-327701 35697421 110. Mandarino F.V. Vespa E. Barchi A. Fasulo E. Sinagra E. Azzolini F. Danese S. Precision Endoscopy in Peroral Myotomies for Motility Disorders of the Upper Gastrointestinal Tract: Current Insights and Prospective Avenues-A Comprehensive Review Life 2023 13 2143 10.3390/life13112143 38004283 PMC10672509 111. Johnson C.D. Gastric Outlet Obstruction Malignant until Proved Otherwise Am. J. Gastroenterol. 1995 90 1740 7572886 112. Chowdhury A. Dhali G.K. Banerjee P.K. Etiology of Gastric Outlet Obstruction Am. J. Gastroenterol. 1996 91 1679 8759707 113. Samad A. Khanzada T.W. Shoukat I. Gastric Outlet Obstruction: Change in Etiology Pak. J. Surg. 2007 23 29 32 114. Tendler D.A. Malignant Gastric Outlet Obstruction: Bridging Another Divide Am. J. Gastroenterol. 2002 97 4 6 10.1111/j.1572-0241.2002.05391.x 11808968 115. Mutignani M. Tringali A. Shah S.G. Perri V. Familiari P. Iacopini F. Spada C. Costamagna G. Combined Endoscopic Stent Insertion in Malignant Biliary and Duodenal Obstruction Endoscopy 2007 39 440 447 10.1055/s-2007-966327 17516351 116. Jeurnink S.M. Steyerberg E.W. van Hooft J.E. van Eijck C.H.J. Schwartz M.P. Vleggaar F.P. Kuipers E.J. Siersema P.D. Dutch SUSTENT Study Group Surgical Gastrojejunostomy or Endoscopic Stent Placement for the Palliation of Malignant Gastric Outlet Obstruction (SUSTENT Study): A Multicenter Randomized Trial Gastrointest. Endosc. 2010 71 490 499 10.1016/j.gie.2009.09.042 20003966 117. Jeurnink S.M. Polinder S. Steyerberg E.W. Kuipers E.J. Siersema P.D. Cost Comparison of Gastrojejunostomy versus Duodenal Stent Placement for Malignant Gastric Outlet Obstruction J. Gastroenterol. 2010 45 537 543 10.1007/s00535-009-0181-0 20033227 118. Lokich J.J. Kane R.A. Harrison D.A. McDermott W.V. Biliary Tract Obstruction Secondary to Cancer: Management Guidelines and Selected Literature Review J. Clin. Oncol. 1987 5 969 981 10.1200/JCO.1987.5.6.969 3295131 119. Staub J. Siddiqui A. Taylor L.J. Loren D. Kowalski T. Adler D.G. ERCP Performed through Previously Placed Duodenal Stents: A Multicenter Retrospective Study of Outcomes and Adverse Events Gastrointest. Endosc. 2018 87 1499 1504 10.1016/j.gie.2018.01.040 29425886 120. Mosler P. Mergener K.D. Brandabur J.J. Schembre D.B. Kozarek R.A. Palliation of Gastric Outlet Obstruction and Proximal Small Bowel Obstruction with Self-Expandable Metal Stents: A Single Center Series J. Clin. Gastroenterol. 2005 39 124 128 15681907 121. Masci E. Viale E. Mangiavillano B. Contin G. Lomazzi A. Buffoli F. Gatti M. Repaci G. Teruzzi V. Fasoli R. Enteral Self-Expandable Metal Stent for Malignant Luminal Obstruction of the Upper and Lower Gastrointestinal Tract: A Prospective Multicentric Study J. Clin. Gastroenterol. 2008 42 389 394 10.1097/MCG.0b013e318033d30a 18277900 122. Mintziras I. Miligkos M. Wächter S. Manoharan J. Bartsch D.K. Palliative Surgical Bypass Is Superior to Palliative Endoscopic Stenting in Patients with Malignant Gastric Outlet Obstruction: Systematic Review and Meta-Analysis Surg. Endosc. 2019 33 3153 3164 10.1007/s00464-019-06955-z 31332564 123. Tringali A. Costa D. Anderloni A. Carrara S. Repici A. Adler D.G. Covered versus Uncovered Metal Stents for Malignant Gastric Outlet Obstruction: A Systematic Review and Meta-Analysis Gastrointest. Endosc. 2020 92 1153 1163.e9 10.1016/j.gie.2020.06.033 32565187 124. Hori Y. Naitoh I. Hayashi K. Ban T. Natsume M. Okumura F. Nakazawa T. Takada H. Hirano A. Jinno N. Predictors of Stent Dysfunction after Self-Expandable Metal Stent Placement for Malignant Gastric Outlet Obstruction: Tumor Ingrowth in Uncovered Stents and Migration of Covered Stents Surg. Endosc. 2017 31 4165 4173 10.1007/s00464-017-5471-7 28281116 125. Carbajo A.Y. Kahaleh M. Tyberg A. Clinical Review of EUS-Guided Gastroenterostomy (EUS-GE) J. Clin. Gastroenterol. 2020 54 1 7 10.1097/MCG.0000000000001262 31567785 126. Itoi T. Baron T.H. Khashab M.A. Tsuchiya T. Irani S. Dhir V. Bun Teoh A.Y. Technical Review of Endoscopic Ultrasonography-Guided Gastroenterostomy in 2017 Dig. Endosc. 2017 29 495 502 10.1111/den.12794 28032663 127. Itoi T. Itokawa F. Uraoka T. Gotoda T. Horii J. Goto O. Moriyasu F. Moon J.H. Kitagawa Y. Yahagi N. Novel EUS-Guided Gastrojejunostomy Technique Using a New Double-Balloon Enteric Tube and Lumen-Apposing Metal Stent (with Videos) Gastrointest. Endosc. 2013 78 934 939 10.1016/j.gie.2013.09.025 24237949 128. Bronswijk M. van Malenstein H. Laleman W. Van der Merwe S. Vanella G. Petrone M.C. Arcidiacono P.G. EUS-Guided Gastroenterostomy: Less Is More! The Wireless EUS-Guided Gastroenterostomy Simplified Technique VideoGIE 2020 5 442 10.1016/j.vgie.2020.06.012 PMC7482414 32954112 129. Vanella G. Tamburrino D. Capurso G. Bronswijk M. Reni M. Dell’Anna G. Crippa S. Van Der Merwe S. Falconi M. Arcidiacono P.G. Feasibility of Therapeutic Endoscopic Ultrasound in the Bridge-to-Surgery Scenario: The Example of Pancreatic Adenocarcinoma World J. Gastroenterol. 2022 28 976 984 10.3748/wjg.v28.i10.976 35431499 PMC8968520 130. Vanella G. Dell’Anna G. Capurso G. Maisonneuve P. Bronswijk M. Crippa S. Tamburrino D. Macchini M. Orsi G. Casadei-Gardini A. EUS-Guided Gastroenterostomy for Management of Malignant Gastric Outlet Obstruction: A Prospective Cohort Study with Matched Comparison with Enteral Stenting Gastrointest. Endosc. 2023 98 337 347.e5 10.1016/j.gie.2023.04.2072 37094692 131. Trieu J.A. Kahlenberg S. Gilman A.J. Hathorn K. Baron T.H. Long-Term Outcomes of EUS-Guided Gastroenterostomy: A Large, Single-Center Experience Clin. Transl. Gastroenterol. 2025 16 e00648 10.14309/ctg.0000000000000648 39620984 PMC11756879 132. Giri S. Harindranath S. Mohan B.P. Jearth V. Varghese J. Kozyk M. Kale A. Sundaram S. Adverse Events with Endoscopic Ultrasound-guided Gastroenterostomy for Gastric Outlet Obstruction—A Systematic Review and Meta-analysis United Eur. Gastroenterol. J. 2024 12 879 890 10.1002/ueg2.12576 PMC11497769 38747173 133. Ghandour B. Bejjani M. Irani S.S. Sharaiha R.Z. Kowalski T.E. Pleskow D.K. Do-Cong Pham K. Anderloni A.A. Martinez-Moreno B. Khara H.S. Classification, Outcomes, and Management of Misdeployed Stents during EUS-Guided Gastroenterostomy Gastrointest. Endosc. 2022 95 80 89 10.1016/j.gie.2021.07.023 34352256 134. Chen Y.-I. Itoi T. Baron T.H. Nieto J. Haito-Chavez Y. Grimm I.S. Ismail A. Ngamruengphong S. Bukhari M. Hajiyeva G. EUS-Guided Gastroenterostomy Is Comparable to Enteral Stenting with Fewer Re-Interventions in Malignant Gastric Outlet Obstruction Surg. Endosc. 2017 31 2946 2952 10.1007/s00464-016-5311-1 27834024 135. Ge P.S. Young J.Y. Dong W. Thompson C.C. EUS-Guided Gastroenterostomy versus Enteral Stent Placement for Palliation of Malignant Gastric Outlet Obstruction Surg. Endosc. 2019 33 3404 3411 10.1007/s00464-018-06636-3 30725254 PMC6684873 136. Miller C. Benchaya J.A. Martel M. Barkun A. Wyse J.M. Ferri L. Chen Y.-I. EUS-Guided Gastroenterostomy vs. Surgical Gastrojejunostomy and Enteral Stenting for Malignant Gastric Outlet Obstruction: A Meta-Analysis Endosc. Int. Open 2023 11 E660 E672 10.1055/a-2098-2570 37593104 PMC10431974 137. Tran K.V. Vo N.-P. Nguyen H.S. Vo N.T. Thai T.B.T. Pham V.A. Loh E.-W. Tam K.-W. Palliative Procedures for Malignant Gastric Outlet Obstruction: A Network Meta-Analysis Endoscopy 2024 56 780 789 10.1055/a-2309-7683 38641337 138. Teoh A.Y.B. Lakhtakia S. Tarantino I. Perez-Miranda M. Kunda R. Maluf-Filho F. Dhir V. Basha J. Chan S.M. Ligresti D. Endoscopic Ultrasonography-Guided Gastroenterostomy versus Uncovered Duodenal Metal Stenting for Unresectable Malignant Gastric Outlet Obstruction (DRA-GOO): A Multicentre Randomised Controlled Trial Lancet Gastroenterol. Hepatol. 2025 10 e8 e16 10.1016/S2468-1253(25)00136-0 40347959 139. Ramai D. Nelson R. Chaiyakunapruk N. Ofosu A. Fang J.C. Endoscopic Ultrasound Gastroenterostomy vs Duodenal Stenting for Malignant Gastric Outlet Obstruction: Cost-Effectiveness Study Endosc. Int. Open 2025 13 a25097671 10.1055/a-2509-7671 40109319 PMC11922303 140. Cherian P.T. Cherian S. Singh P. Long-Term Follow-up of Patients with Gastric Outlet Obstruction Related to Peptic Ulcer Disease Treated with Endoscopic Balloon Dilatation and Drug Therapy Gastrointest. Endosc. 2007 66 491 497 10.1016/j.gie.2006.11.016 17640640 141. Kochhar R. Kochhar S. Endoscopic Balloon Dilation for Benign Gastric Outlet Obstruction in Adults World J. Gastrointest. Endosc. 2010 2 29 35 10.4253/wjge.v2.i1.29 21160676 PMC2998862 142. Dormann A.J. Deppe H. Wigginghaus B. Self-Expanding Metallic Stents for Continuous Dilatation of Benign Stenoses in Gastrointestinal Tract—First Results of Long-Term Follow-up in Interim Stent Application in Pyloric and Colonic Obstructions Z. Gastroenterol. 2001 39 957 960 10.1055/s-2001-18531 11778154 143. Fujitani K. Ando M. Sakamaki K. Terashima M. Kawabata R. Ito Y. Yoshikawa T. Kondo M. Kodera Y. Yoshida K. Multicentre Observational Study of Quality of Life after Surgical Palliation of Malignant Gastric Outlet Obstruction for Gastric Cancer BJS Open 2017 1 165 174 10.1002/bjs5.26 29951619 PMC5989952 144. Perez-Miranda M. Tyberg A. Poletto D. Toscano E. Gaidhane M. Desai A.P. Kumta N.A. Fayad L. Nieto J. Barthet M. EUS-Guided Gastrojejunostomy Versus Laparoscopic Gastrojejunostomy: An International Collaborative Study J. Clin. Gastroenterol. 2017 51 896 899 10.1097/MCG.0000000000000887 28697151 145. Canakis A. Tugarinov N. Bapaye J. Gilman A.J. Hathorn K.E. Twery B. Sharaiha R.Z. Baron T.H. Irani S.S. EUS-Guided Gastroenterostomy for Benign Gastric Outlet Obstruction: A Systematic Review and Meta-Analysis J. Clin. Gastroenterol. 2025 10.1097/MCG.0000000000002130 39761155 146. Gonzalez J.-M. Ouazzani S. Vanbiervliet G. Gasmi M. Barthet M. Endoscopic Ultrasound-Guided Gastrojejunostomy with Wire Endoscopic Simplified Technique: Move towards Benign Indications (with Video) Dig. Endosc. 2024 37 167 175 10.1111/den.14895 39253824 PMC11808632 Figure 1 Placement of an FC-SEMS in a patient with esophagojejunal anastomotic fistula following gastrectomy. Figure 2 Intraluminal EsoSponge for the treatment of an anastomotic leak following Ivor Lewis esophagectomy. Figure 3 VAC stent for the treatment of an esophagogastric anastomotic fistula following Ivor-Lewis esophagectomy. Figure 4 Partially covered esophageal stent (Evolution ® Figure 5 Fully covered SEMS to treat a circumferential stenosis following endoscopic submucosal dissection of an early esophageal squamocellular carcinoma. Figure 6 Radiologic view of a LAMS (Nagi ® Figure 7 Anastomotic stricture following McKeown esophagectomy ( A B Figure 8 Patient with pancreatic carcinoma causing duodenal stenosis distal to the papillary region, with a biliary stent in place. A 9 cm TTS evolution metal stent was initially deployed but subsequently migrated distally. A second 9 cm TTS WallFlex metal stent was then placed within the first and deployed into the duodenal bulb. Figure 9 Radiologic view of a LAMS (Axios™, Boston Scientific, Marlborough, MA, USA) placed using EUS-guided technique to palliate a GOO in a patient with pancreatic adenocarcinoma. diagnostics-15-02344-t001_Table 1 Table 1 Endoscopic treatment of esophageal leaks: CS and AEs. Authors Study Design N° Patients Indications Clinical Success Adverse Events SEMS Anderloni et al. [ 19 Retrospective 49 AL post esophageal surgery 60.5 38 Plum et al. [ 20 Retrospective 70 AL post esophageal surgery 70 28.6 Segura et al. [ 21 Retrospective 20 AL post esophageal surgery 75 21.7 Fischer et al. [ 61 Retrospective 11 AL post esophageal surgery 100 0 Iglesias Jorquera et al. [ 23 Retrospective 25 AL post esophageal surgery 84 28 Mennigen et al. [ 62 Retrospective 45 AL post esophageal surgery 63.3 36.7 Mandarino et al. [ 17 Retrospective 37 AL post esophageal surgery 62.2 22.7 Licht et al. [ 63 Retrospective 49 AL post esophageal surgery 88 3.2 Schweigert et al. [ 64 Retrospective 25 AL post esophageal surgery 76.5 23.5 EVT Richter et al. [ 41 Prospective 69 AL post esophageal surgery 91 NA Jung et al. [ 38 Retrospective 119 AL post esophageal surgery 70.6 10.9 Momblan et al. [ 39 Prospective 89 AL post esophageal surgery 82 5.9 Luttikhold et al. [ 40 Retrospective 27 AL post esophageal surgery 89 7 VAC STENT Chon et al. [ 56 Prospective 5 AL post esophageal surgery 70 0 Chon et al. [ 57 Prospective 18 AL post esophageal surgery 60–71 0 Pattynama et al. [ 54 Case series 8 AL post esophageal surgery 100 0 Lange et al. [ 52 Prospective 11 AL post esophageal surgery 80 7 Blundau et al. [ 58 Retrospective 59 AL post esophageal surgery 78 NA AL: anastomotic leak; NA: not applicable; SEMS: self-expanding metal stent; EVT: endoscopic vacuum therapy. diagnostics-15-02344-t002_Table 2 Table 2 Endoscopic treatment of benign esophageal strictures: CS and AEs. Authors Study Design N° Patients Indications Clinical Success Adverse Events SEMS Kim et al. [ 81 Retrospective 55 Benign esophageal strictures 58—1 month 31—tissue hyperproliferation Liu et al. [ 82 Prospective 24 Benign anastomotic esophageal strictures 75—1 year 72.4—moderate chest pain Fuccio et al. [ 87 Metanalysis 227 Benign esophageal strictures 40.1 21.9 Mohan et al. [ 90 Metanalysis 342 Benign GI strictures 48 31.5 BDS Tomonori et al. [ 84 Non-randomized prospective trial 30 Benign esophageal strictures 46.7 NA Fuccio et al. [ 87 Metanalysis 77 Benign esophageal strictures 32.9 21.9 Mohan et al. [ 90 Metanalysis 226 Benign GI strictures 34.9 11.5 LAMS Giri et al. [ 89 Metanalysis 527 Benign GI strictures 93.9 13.5 Mohan et al. [ 90 Metanalysis 192 Benign GI strictures 78.8 29.9 Incisional therapy Lee et al. [ 93 Prospective 24 Benign anastomotic esophageal strictures 80.6 0 Hordijk et al. [ 96 Prospective 31 Benign esophageal anastomotic strictures 78 NA SEMS: self-expanding metal stent; NA: not applicable; BDS: biodegradable stent; LAMS: lumen apposing metal stent; GI: gastrointestinal. diagnostics-15-02344-t003_Table 3 Table 3 Endoscopic treatment of gastric outlet obstruction: CS and AEs. Authors Study Design N° Patients Indications Clinical Success Adverse Events SEMS Mintziras et al. [ 122 Metanalysis 1306 Malignant gastric outlet obstruction 75–100 34.2—stent migration Teoh et al. [ 138 RCT 49 Malignant gastric outlet obstruction 92 24 LAMS Vanella et al. [ 130 Prospective 70 Malignant gastric outlet obstruction 97.1 12.9 Trieu et al. [ 131 Retrospective 207 Gastric outlet obstruction 97.2 4.8—Early AEs Teoh et al. [ 138 RCT 48 Malignant gastric outlet obstruction 100 23 SEMS: self-expanding metal stent; LAMS: lumen-apposing metal stent; AEs: adverse events. ",
  "metadata": {
    "Title of this paper": "Endoscopic Ultrasound-Guided Gastrojejunostomy with Wire Endoscopic Simplified Technique: Move towards Benign Indications (with Video)",
    "Journal it was published in:": "Diagnostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468634/"
  }
}