{
  "title": "Paper_710",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474396 PMC12474396.1 12474396 12474396 41012116 10.3390/vaccines13090909 vaccines-13-00909 1 Review Possible Anti-Pain Vaccines: A Narrative Review of Emerging Strategies and Clinical Prospects https://orcid.org/0000-0003-4220-4979 Martins Yuri Chaves 1 * De-Sousa Luciana Pereira 2 https://orcid.org/0009-0008-0727-9565 Murin Peyton J. 3 https://orcid.org/0009-0007-5137-1994 Sadeghipour Hamed 1 Daniel-Ribeiro Cláudio Tadeu 2 Plans-Rubió Pedro Academic Editor 1 hamed.sadeghipour@health.slu.edu 2 Laboratório de Pesquisa em Malária, Instituto Oswaldo Cruz, Fundação Oswaldo Cruz (Fiocruz) and Centro de Pesquisa, Diagnóstico e Treinamento em Malária Secretaria de Vigilância em Saúde e Ambiente malaria@fiocruz.br 3 peyton.murin@slucare.ssmhealth.com * ychavesmartins@slu.edu 27 8 2025 9 2025 13 9 497676 909 16 7 2025 15 8 2025 26 8 2025 27 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Chronic pain affects millions of individuals globally and continues to pose a major burden on patients and healthcare systems. Traditional analgesics, such as opioids and nonsteroidal anti-inflammatory drugs, often provide only partial relief and are frequently associated with significant side effects and risks of misuse. In recent years, vaccines that target molecules involved in pain signaling have emerged as an innovative therapeutic strategy. These vaccines aim to induce long-lasting immune responses against key mediators of nociception, including nerve growth factor (NGF), calcitonin gene-related peptide (CGRP), substance P, and voltage-gated sodium channels such as Nav1.7. By promoting the production of specific antibodies, anti-pain vaccines have the potential to achieve analgesic effects with longer duration, reduced need for frequent administration, and improved accessibility. Multiple vaccine platforms are under investigation, including virus-like particles, peptide-protein conjugates, and nucleic acid technologies. Although preclinical studies have shown promising efficacy and safety profiles, clinical evidence is still limited to early-stage trials, particularly for migraine. This narrative review summarizes current knowledge on therapeutic vaccines for pain, discusses the immunological and technological advances in the field, and outlines future directions. analgesia calcitonin gene-related peptide chronic pain immunotherapy neuroimmunology nerve growth factor anti-pain vaccines transient receptor potential vanilloid 1 American Academy of Neurology Fundação Carlos Chagas Filho de Amparo à Pesquisa do Estado do Rio de Janeiro E-26/205.722/2022 Conselho Nacional de Desenvolvimento Científico e Tecnológico 314699/2021-0 Cientista do Nosso Estado E-26/202.921/2018 Laboratório de Pesquisa em Malária Instituto Nacional de Ciência e Tecnologia em Neuroimunomodulação 465489/2014-1 Rede de Neuroinflamação da Faperj 26010.002418/2019 Faperj SEI-260003/001169/2020 P.J.M. receives grant support from the American Academy of Neurology. L.P.d.-S. receives a Fundação Carlos Chagas Filho de Amparo à Pesquisa do Estado do Rio de Janeiro Conselho Nacional de Desenvolvimento Científico e Tecnológico Cientista do Nosso Estado Laboratório de Pesquisa em Malária Instituto Nacional de Ciência e Tecnologia em Neuroimunomodulação Rede de Neuroinflamação da Faperj pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction According to the International Association for the Study of Pain (IASP), chronic pain is “pain that lasts or recurs for longer than three months and is associated with significant emotional distress and/or functional disability” [ 1 2 3 3 Chronic pain encompasses a diverse set of pathophysiological mechanisms that influence both the selection and expected efficacy of therapeutic targets. At the peripheral level, nociceptor sensitization occurs when primary sensory neurons in the dorsal root or trigeminal ganglia develop reduced activation thresholds and heightened responsiveness to stimuli due to injury, inflammation, or disease [ 4 5 6 Central sensitization refers to increased excitability of neurons within the spinal dorsal horn and supraspinal centers, resulting in amplification of pain signals and expansion of receptive fields [ 7 8 9 10 Neuro-immune interactions further shape the chronic pain landscape. Inflammatory pain is characterized by the release of pro-inflammatory cytokines (e.g., TNF-α, IL-6) from immune and glial cells, which modulate nociceptive transmission at both peripheral and central levels [ 11 12 13 Biological therapies like monoclonal antibodies (mAbs) against nerve growth factor (NGF) (e.g., tanezumab) and calcitonin gene-related peptide (CGRP) (e.g., erenumab) have shown promise in the treatment of chronic pain conditions such as osteoarthritis and migraines [ 14 15 16 17 18 19 Anti-pain vaccines leverage the principle that generating endogenous antibodies against key mediators can modulate nociceptive signaling. The rationale builds on two key observations: (1) specific molecular targets play pivotal roles in pain pathways, and (2) passive immunization (monoclonal antibodies) against these targets can produce analgesia. By inducing a patient’s immune system to produce antibodies, it is theoretically possible to mimic the effect of therapeutic antibodies but with a longer duration. Once a robust antibody titer is achieved, protection/analgesia may persist for months to years with only periodic boosters, improving adherence. Therefore, such vaccines could potentially offer sustained pain relief at a lower cost than chronically delivered drugs [ 17 20 10 21 Figure 1 In summary, anti-pain vaccines offer potential for long-lasting and effective pain relief. However, there are challenges that must be overcome. Here, we review the preclinical and clinical evidence for therapeutic vaccination in pain management. In doing so, we provide a summary of the status of the field and areas for future research. 2. Anti-Pain Vaccine Targets Therapeutic anti-pain vaccines under investigation focus on a range of molecular targets known to mediate nociception, analgesia, and pain sensitization. Evidence supporting the viability of these vaccines comes primarily from preclinical studies in animal models, with a few early-stage clinical investigations underway. Below we summarize the most studied targets, their scientific rationale, and the seminal and most recent clinical studies. 2.1. Nerve Growth Factor (NGF) NGF is a neurotrophin essential for nociceptor sensitization and survival of certain sensory neurons. It binds TrkA receptors on pain fibers, leading to heightened pain signaling and inflammatory hyperalgesia [ 16 22 17 A vaccine strategy against NGF has been pioneered in animal models. A landmark study by von Loga et al. provided the first direct evidence that active immunization can attenuate chronic pain [ 23 23 23 23 23 23 24 23 2.2. Substance P (SP) SP is an 11-amino-acid neuropeptide of the tachykinin family that transmits pain signals and promotes neurogenic inflammation. It binds neurokinin-1 (NK1) receptors on neurons, immune cells, and vasculature, causing plasma extravasation and pain sensitization. SP is widely distributed in the dorsal horn and peripheral nerves and has been implicated in the pathogenesis of various chronic pain conditions (e.g., inflammatory arthritis and neuropathic pain) [ 25 26 27 28 29 30 31 28 25 32 33 2.3. Calcitonin Gene-Related Peptide (CGRP) CGRP is a 37–amino acid neuropeptide that plays a central role in migraine and other pain disorders. It is released from trigeminal sensory fibers during migraine attacks, producing potent vasodilation and neuroinflammation in the meninges and contributing to headache pain [ 34 35 36 19 37 38 39 39 39 NCT05477095 Although short-term studies with anti-CGRP mAbs have not revealed major safety issues, since CGRP also has important physiological roles (e.g., vasodilatory protection of cardiac and cerebral vessels), the long-term safety of chronically neutralizing CGRP via vaccination will require close monitoring [ 40 2.4. Transient Receptor Potential Vanilloid-1 (TRPV1) TRPV1 is a non-selective cation channel expressed by nociceptive neurons, best known as the receptor for capsaicin (the heat in chili peppers). It is a polymodal detector of noxious stimuli—activated by heat > 43 °C, acidity, and certain lipid mediators—and is a critical mediator of peripheral pain sensation [ 41 42 43 44 44 45 44 46 47 41 48 49 50 51 2.5. Voltage-Gated Sodium Channel Nav1.7 (Nav1.7) Voltage-Gated sodium channels (Nav) are involved in the generation and propagation of electrochemical impulses along nociceptors [ 52 53 54 55 50 56 57 53 2.6. Adjunct and Co-Therapy Strategies The opioid and cannabinoid systems are not pain mediators per se, but rather modulatory systems that can be targeted via vaccines for indirect pain management benefits. One strategy focuses on vaccines against opioid drugs (such as heroin, fentanyl, oxycodone) to prevent these substances from entering the brain. While primarily aimed at treating opioid use disorder, such vaccines could impact pain management by reducing abuse potential and overdose risk in patients with chronic pain [ 58 59 58 59 60 61 61 60 62 59 59 In terms of clinical evidence, a Phase 1 trial of an oxycodone vaccine in people with opioid use disorder reported that the vaccine was immunogenic, with higher doses yielding anti-oxycodone antibody titers that lasted several months [ 61 63 Cannabinoid vaccines are similarly being explored to treat cannabis misuse by inducing antibodies against delta-9-tetrahydrocannabinol (THC) or synthetic cannabinoids. In one study, a broad-spectrum vaccine was formulated to raise antibodies cross-reactive with multiple synthetic cannabinoid analogues [ 64 3. Vaccine Platforms and Adjuvants As highlighted above, developing effective pain vaccines requires innovative platforms to create a robust response against self-molecules or small drug haptens without compromising the physiologic role of the molecules or haptens. To this end, several vaccine platform technologies have been employed or proposed. A unique challenge in pain vaccine development is that many leading targets—such as ion channels (e.g., Nav1.7, TRPV1) and other multi-pass membrane proteins—are difficult to present to the immune system in their native conformation. These proteins are embedded in lipid bilayers and often have small extracellular domains, making them challenging to express, purify, and stabilize in immunogenic form [ 65 66 67 3.1. Peptide/Protein Conjugate Vaccines Many pain-related targets (neuropeptides, small drug molecules) are poorly immunogenic on their own [ 68 69 70 71 3.2. Virus-like Particle (VLPs) Vaccines VLPs are highly immunogenic nanoparticles (often ~25–100 nm) that present repetitive antigen arrays, effectively stimulating B cells [ 72 23 59 73 74 3.3. DNA and mRNA Vaccines Nucleic-acid vaccine technology offers a flexible way to induce immunity by having the host’s cells produce the antigen. Most recently, this technology was applied to the creation of the COVID-19 vaccine [ 75 64 76 3.4. Viral Vector Vaccines Another platform uses replication-deficient viral vectors (e.g., modified adenovirus, adeno-associated virus) to deliver genes encoding the antigen [ 77 78 3.5. Adjuvants While there are many choices for platforms, as highlighted above, the choice of adjuvant is also critical for the development of efficacious anti-pain vaccines. Since many targets are self-antigens, strong adjuvants (tools like receptor agonists, emulsions, etc.) are often required to provoke a sufficient immune response. However, overly reactogenic adjuvants could cause excessive inflammation or autoimmune reactions [ 79 80 81 In summary, vaccine platform selection is pivotal in anti-pain vaccine development. Conjugate and VLP-based vaccines have shown the most progress so far, enabling high antibody yields against difficult targets like NGF and opioids. Emerging nucleic acid technologies may further broaden what antigens can be effectively targeted. The optimal platform may also differ by target. For example, a small chemical like morphine requires a conjugate carrier, whereas a large protein like TRPV1 might be best delivered via DNA or VLP. Future research comparing these approaches head-to-head in animal models to identify which yields the strongest analgesic efficacy with acceptable safety is necessary. A summary of the anti-pain vaccine targets and platforms can be seen in Figure 2 4. Safety Considerations Safety is a paramount concern in the development of vaccines for pain, given that many target endogenous molecules and are intended for use in non-life-threatening conditions, unlike traditional vaccines for infectious diseases. Several specific safety issues have been recognized within the literature. 4.1. Preclinical Observations Generally, animal studies of pain vaccines have reported few acute safety concerns. In the NGF vaccine tested in mice, there were no signs of immune complex disease or neurological alterations [ 13 82 83 60 61 Overall, preclinical evidence strongly supports that vaccines can be generated to target pain pathways and that these immunizations can produce meaningful analgesic outcomes in animals without major side effects. Clinical evidence is still limited to migraine and addiction vaccine trials, and it also shows a good side effect profile [ 19 25 37 4.2. Autoimmune Responses By design, vaccines against self-molecules break immune tolerance. This raises the risk of autoimmunity. Developers must ensure the induced antibodies (or T-cells) target the intended antigen specifically and do not cross-react with other proteins. For instance, NGF shares some functional overlap with other neurotrophins (brain-derived neurotrophic factor, neurotrophin-3), but sequence homology is low; so far, anti-NGF vaccines have not shown cross-reactivity to other neurotrophins in assays [ 84 85 85 4.3. Reversibility Another safety aspect is that, unlike a drug, a vaccine’s effects cannot be quickly turned off. Antibodies may circulate for months or years, and if a patient experiences an adverse effect or if the target turns out to be essential for some physiological function, we cannot simply “unvaccinate”. For example, high titers of anti-NGF antibodies might theoretically interfere with nerve repair or development of fetal nervous tissue (hence, NGF vaccines would likely be contraindicated in pregnancy). Tanezumab trials revealed that excessive NGF blockade in adults can lead to accelerated arthropathy in damaged joints [ 86 4.4. Off-Target Effects and Cross-Reactivity Pain-related targets often have roles beyond pain. CGRP, for instance, helps regulate blood pressure and acts as a cardioprotective factor. Neutralizing it chronically could, in theory, increase hypertension or ischemic risk, although migraine mAb trials have so far not shown a major safety concern [ 37 87 4.5. Immune Complex Deposition If a vaccine induces very high antibody titers against a circulating antigen, there is a theoretical risk of forming antigen–antibody immune complexes that could deposit in tissues (like kidneys, blood vessels) and cause inflammation. Most pain targets are not present at high concentrations in the blood (NGF and CGRP circulate at low pg/mL levels), which minimizes this risk. In the NGF vaccine mouse study, even at peak antibody titers, there were no signs of immune complex disease [ 13 4.6. Local and Systemic Reactogenicity Therapeutic vaccines often use potent adjuvants and may be given repeatedly, so the cumulative reactogenicity (injection site reactions, flu-like symptoms after each dose) is important. Patients with chronic pain might be particularly sensitive to additional flu-like side effects, which could transiently worsen pain or fatigue. Formulations must be optimized to minimize unnecessary inflammation while still inducing a strong, specific immune response. Emerging adjuvants like TLR7/8 agonists in nanoparticle form have shown an ability to enhance antibody responses to opioid haptens without dramatically increasing systemic cytokines [ 58 4.7. Safety in Special Populations If anti-pain vaccines are intended for chronic use, they may be given to populations including older adults (e.g., osteoarthritis patients) or those with comorbidities. In older patients, immunosenescence may impact vaccine effectiveness, potentially necessitating higher doses or the use of alternative adjuvants [ 88 89 90 In summary, developing and deploying vaccines for pain raises unique regulatory and ethical considerations. Unlike prophylactic vaccines for infectious diseases, therapeutic vaccines intended to treat a chronic pain condition have a different risk-benefit calculation since the recipients are patients, not healthy individuals, and the “benefit” (pain relief) is subjective. Although preclinical and early clinical data are encouragingly free of major red flags, safety oversight for anti-pain vaccines needs to be stringent. Risk mitigation strategies such as titrating dosage, comprehensive monitoring, and ensuring reversibility (to the extent possible) should be built into development programs. In addition, regulatory authorities will likely treat these therapeutic vaccines with heightened scrutiny on autoimmune potential. The goal should be to ensure that anti-pain vaccines are safe, especially given that alternative chronic pain treatments do exist. Table 1 5. Regulatory and Ethical Issues The development and implementation of anti-pain vaccines raise distinct regulatory and ethical challenges. Unlike prophylactic vaccines designed to prevent infectious diseases, these therapeutic interventions are intended to treat ongoing conditions. Consequently, risk-benefit assessments must account for the fact that recipients are patients actively seeking relief rather than healthy individuals. The inherently subjective nature of pain further complicates these evaluations [ 91 Regulatory authorities such as the U.S. Food and Drug Administration and the European Medicines Agency are expected to evaluate anti-pain vaccines as rigorously as they do new analgesic medications and anti-cancer vaccines [ 92 93 94 91 23 93 95 Ethical considerations are equally significant. Informed consent must be robust, given that anti-pain vaccines induce long-lasting immunological changes. Patients must be made fully aware that these vaccines may result in persistent antibody production and understand the implications. For instance, individuals vaccinated against opioid targets should be counseled that future opioid-based pain treatments might be less effective, potentially complicating care after surgery or injury [ 96 96 97 In clinical practice, physicians must balance the ethical principles of beneficence and non-maleficence. The obligation to alleviate suffering must be weighed against the uncertainties surrounding novel anti-pain vaccines, including the potential for delayed or unforeseen adverse effects. Patients should be closely monitored, and clinicians must be prepared to respond to long-term complications such as autoimmune reactions [ 98 91 Justice and equity concerns arise with respect to access and affordability. These vaccines may be expensive or require administration at specialized centers, raising questions about insurance coverage and availability. The typical justification for public funding of vaccines lies in their ability to prevent illness and reduce overall healthcare costs. In the context of chronic pain, the economic argument depends on reducing healthcare utilization and improving patient functionality. For instance, a migraine-targeted anti-pain vaccine that replaces the need for costly monthly monoclonal antibody infusions may offer long-term cost savings [ 23 96 Designing ethical clinical trials for anti-pain vaccines introduces further challenges. Traditional Phase I trials often involve healthy volunteers, but exposing individuals without pain to vaccines that elicit auto-antibodies presents ethical concerns. As such, early-phase studies may recruit patients with the target condition, resulting in hybrid Phase I/IIa trial designs [ 91 94 94 After regulatory approval, post-market surveillance will be critical. Authorities are likely to mandate long-term studies or registries to detect delayed or rare adverse events. For example, if an anti-nerve growth factor vaccine is approved, a multi-year registry could monitor recipients for neurological effects or other unintended consequences [ 95 95 Product labeling for anti-pain vaccines will also need to address special populations and clinical scenarios. Labels may advise caution during pregnancy or suggest contraception for women of reproductive age around the time of administration, especially if the targeted molecule plays a role in fetal development [ 91 In summary, the regulatory and ethical landscape for anti-pain vaccines is intricate but navigable. A patient-centered approach, combined with early engagement with regulatory bodies, can clarify key requirements such as immunological endpoints and acceptable risk profiles [ 92 6. Future Directions The field of anti-pain vaccines is in its infancy, and numerous avenues remain for research and innovation. As our understanding of pain mechanisms grows, additional molecular targets may be identified for vaccine development. Candidates could include inflammatory cytokines (e.g., TNF-α, IL-6) that contribute to pain. Indeed, a TNF-α vaccine has been tested in rheumatoid arthritis patients (a “TNF kinoid” showing reduced disease activity) [ 99 The heterogeneous nature of chronic pain suggests that a one-size-fits-all vaccine may not be ideal. In the future, we might personalize vaccine choice based on an individual’s pain biology. For example, patients with high NGF levels or specific polymorphisms in the NGF/TrkA pathway might respond especially well to an anti-NGF vaccine, whereas another subgroup with predominantly inflammatory pain could benefit more from a cytokine-targeted vaccine [ 100 101 Future vaccines could also benefit from advances in protein engineering and immunology. Stabilized epitope scaffolds, epitope-focused design, and novel carriers are areas of active development [ 102 103 64 Another emerging strategy is to use immunomodulators alongside vaccines to shape the immune response. For example, co-delivering an immune checkpoint inhibitor locally with a vaccine could amplify antibody production by transiently relieving B-cell inhibition. Previously, low-dose cyclophosphamide, which suppresses regulatory T-cells, was given with a peptide vaccine to increase its antibody titer response in a cancer setting [ 104 105 106 While the focus thus far has been on antibody-mediated mechanisms, interesting evidence is emerging that T-cells also influence chronic pain [ 107 108 109 Overall, the translational path for anti-pain vaccines is at an early and exploratory phase. Continued rigorous research, including well-designed clinical trials and biomarker studies, will be critical to establishing the safety, efficacy, and clinical applicability of these innovative approaches. 7. Public Perception and Education Another consideration is how patients and the public will perceive pain vaccines. The term “vaccine” might cause confusion or undue concerns given its association with infectious disease prevention. Public education will be needed to clarify that these are optional therapeutic interventions for those suffering chronic pain, not something that will be mandated or given to everyone. Emphasizing the potential quality-of-life improvements and safety monitoring in place will be key to acceptance. Conversely, some patients may have overly high expectations (“a one-time vaccine to cure pain forever”); managing expectations realistically (it is not magic—boosters may be needed, etc.) will be part of physician counseling. Pain is a subjective and multifaceted experience, so any new treatment—especially one involving the immune system—should be introduced with empathy and clear communication. 8. Conclusions In conclusion, the next decade is likely to bring significant developments in the anti-pain vaccine arena. We will see refinement of targets, smarter vaccine designs, and initial real-world data from pioneering trials like the migraine CGRP vaccine. If those are successful, it could open the floodgates for anti-pain vaccines targeting other conditions (arthritis, back pain, neuropathies). In the future, pain treatment may shift toward a more biologically targeted approach. Rather than relying on broadly acting analgesics, therapies could focus on the specific molecules responsible for an individual’s pain. This is aligned with the broader trend in medicine toward precision and personalization. It is a hopeful prospect for millions of patients who live with chronic pain—a field historically marked by trial-and-error treatments could finally have therapies that are not only effective and long-acting but also fundamentally alter the course of pain pathology for the better. Continued interdisciplinary collaboration between pain researchers, immunologists, and vaccine technologists will be essential to realize this promise in a responsible and impactful way. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Y.C.M. and C.T.D.-R.; resources, Y.C.M. and C.T.D.-R.; data curation, Y.C.M., L.P.d.-S., P.J.M. and H.S.; writing—original draft preparation, Y.C.M., L.P.d.-S., P.J.M., H.S. and C.T.D.-R.; writing—review and editing, Y.C.M., L.P.d.-S., P.J.M., H.S. and C.T.D.-R.; visualization, Y.C.M. and L.P.d.-S.; supervision, Y.C.M. and C.T.D.-R.; project administration, Y.C.M.; funding acquisition, C.T.D.-R. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: BSA Bovine Serum Albumin CGRP Calcitonin Gene-Related Peptide CNS Central Nervous System COVID-19 Coronavirus Disease 2019 CRPS Complex Regional Pain Syndrome CRM197 Cross-Reactive Material 197 DNA Deoxyribonucleic Acid HIV Human Immunodeficiency Virus IASP International Association for the Study of Pain IgG Immunoglobulin G IL-6 Interleukin-6 KLH Keyhole Limpet Hemocyanin mAbs Monoclonal Antibodies mRNA Messenger Ribonucleic Acid Nav1.7 Voltage-Gated Sodium Channel Subtype 1.7 NGF Nerve Growth Factor NK1 Neurokinin-1 (Receptor) NSAIDs Nonsteroidal Anti-Inflammatory Drugs PRRs Pattern Recognition Receptors Qβ Qubevirus durum (a bacteriophage used as a VLP platform) SCN9A Sodium Voltage-Gated Channel Alpha Subunit 9 SP Substance P THC Delta-9-Tetrahydrocannabinol TLR Toll-Like Receptor TNF-α Tumor Necrosis Factor-alpha TRPV1 Transient Receptor Potential Vanilloid 1 Tregs Regulatory T Cells TrkA Tropomyosin Receptor Kinase A TTX Tetrodotoxin VLP Virus-Like Particle References 1. Nicholas M. Vlaeyen J.W.S. Rief W. Barke A. Aziz Q. Benoliel R. Cohen M. Evers S. Giamberardino M.A. Goebel A. The IASP classification of chronic pain for ICD-11: Chronic primary pain Pain 2019 160 28 37 10.1097/j.pain.0000000000001390 30586068 2. Cohen S.P. Vase L. Hooten W.M. Chronic pain: An update on burden, best practices, and new advances Lancet 2021 397 2082 2097 10.1016/S0140-6736(21)00393-7 34062143 3. Yong R.J. Mullins P.M. Bhattacharyya N. Prevalence of chronic pain among adults in the United States Pain 2022 163 e328 e332 10.1097/j.pain.0000000000002291 33990113 4. Basbaum A.I. Bautista D.M. Scherrer G. Julius D. Cellular and molecular mechanisms of pain Cell 2009 139 267 284 10.1016/j.cell.2009.09.028 19837031 PMC2852643 5. Denk F. Bennett D.L. McMahon S.B. Nerve growth factor and pain mechanisms Annu. Rev. Neurosci. 2017 40 307 325 10.1146/annurev-neuro-072116-031121 28441116 6. Julius D. TRP channels and pain Annu. Rev. Cell Dev. Biol. 2013 29 355 384 10.1146/annurev-cellbio-101011-155833 24099085 7. Woolf C.J. Central sensitization: Implications for the diagnosis and treatment of pain Pain 2011 152 S2 S15 10.1016/j.pain.2010.09.030 20961685 PMC3268359 8. Latremoliere A. Woolf C.J. Central sensitization: A generator of pain hypersensitivity by central neural plasticity J. Pain 2009 10 895 926 10.1016/j.jpain.2009.06.012 19712899 PMC2750819 9. Edvinsson L. Haanes K.A. Warfvinge K. Krause D.N. CGRP as the target of new migraine therapies—Successful translation from bench to clinic Nat. Rev. Neurol. 2018 14 338 350 10.1038/s41582-018-0003-1 29691490 10. Harrison S. Geppetti P. Substance P Int. J. Biochem. Cell Biol. 2001 33 555 576 10.1016/S1357-2725(01)00031-0 11378438 11. Sommer C. Kress M. Recent findings on how proinflammatory cytokines cause pain: Peripheral mechanisms in inflammatory and neuropathic hyperalgesia Neurosci. Lett. 2004 361 184 187 10.1016/j.neulet.2003.12.007 15135924 12. Grace P.M. Hutchinson M.R. Maier S.F. Watkins L.R. Pathological pain and the neuroimmune interface Nat. Rev. Immunol. 2014 14 217 231 10.1038/nri3621 24577438 PMC5525062 13. Kosek E. Cohen M. Baron R. Gebhart G.F. Mico J.-A. Rice A.S.C. Rief W. Sluka K.A. Do we need a third mechanistic descriptor for chronic pain states? Pain 2016 157 1382 1386 10.1097/j.pain.0000000000000507 26835783 14. Raffaelli B. Neeb L. Reuter U. Monoclonal antibodies for the prevention of migraine Expert Opin. Biol. Ther. 2019 19 1307 1317 10.1080/14712598.2019.1671350 31550937 15. Zheng S. Hunter D.J. Xu J. Ding C. Monoclonal antibodies for the treatment of osteoarthritis Expert Opin. Biol. Ther. 2016 16 1529 1540 10.1080/14712598.2016.1229774 27562879 16. Pecchi E. Priam S. Gosset M. Pigenet A. Sudre L. Laiguillon M.C. Berenbaum F. Houard X. Induction of nerve growth factor expression and release by mechanical and inflammatory stimuli in chondrocytes: Possible involvement in osteoarthritis pain Arthritis Res. Ther. 2014 16 R16 10.1186/ar4443 24438745 PMC3978639 17. Berenbaum F. Blanco F.J. Guermazi A. Miki K. Yamabe T. Viktrup L. Junor R. Carey W. Brown M.T. West C.R. Subcutaneous tanezumab for osteoarthritis of the hip or knee: Efficacy and safety results from a 24-week randomised phase III study with a 24-week follow-up period Ann. Rheum. Dis. 2020 79 800 810 10.1136/annrheumdis-2019-216296 32234715 PMC7286052 18. Lane N.E. Schnitzer T.J. Birbara C.A. Mokhtarani M. Shelton D.L. Smith M.D. Brown M.T. Tanezumab for the treatment of pain from osteoarthritis of the knee N. Engl. J. Med. 2010 363 1521 1531 10.1056/NEJMoa0901510 20942668 PMC6896791 19. Goadsby P.J. Holland P.R. Martins-Oliveira M. Hoffmann J. Schankin C. Akerman S. Pathophysiology of Migraine: A Disorder of Sensory Processing Physiol. Rev. 2017 97 553 622 10.1152/physrev.00034.2015 28179394 PMC5539409 20. Jaffal S. Khalil R. Targeting nerve growth factor for pain relief: Pros and cons Korean J. Pain 2024 37 288 298 10.3344/kjp.24235 39322310 PMC11450303 21. Balke I. Zeltins A. Recent Advances in the Use of Plant Virus-Like Particles as Vaccines Viruses 2020 12 270 10.3390/v12030270 32121192 PMC7150928 22. Bimonte S. Cascella M. Forte C.A. Esposito G. Cuomo A. The Role of Anti-Nerve Growth Factor Monoclonal Antibodies in the Control of Chronic Cancer and Non-Cancer Pain J. Pain Res. 2021 14 1959 1967 10.2147/JPR.S302004 34234542 PMC8253925 23. von Loga I.S. El-Turabi A. Jostins L. Miotla-Zarebska J. Mackay-Alderson J. Zeltins A. Parisi I. Bachmann M.F. Vincent T.L. Active immunisation targeting nerve growth factor attenuates chronic pain behaviour in murine osteoarthritis Ann. Rheum. Dis. 2019 78 672 675 10.1136/annrheumdis-2018-214489 30862648 PMC6517802 24. Bernard N.J. NGF vaccine reduces pain Nat. Rev. Rheumatol. 2019 15 251 10.1038/s41584-019-0213-y 30923347 25. Zhang J. Fan Y.X. Huang Y. Guan R. Li R. Long S. Yang M. Yu B. Wang G.Q. Chen P. The Safety, Tolerability, Pharmacokinetics and Pharmacodynamics of Single Subcutaneous Administration of a Novel Anti-NGF Monoclonal Antibody (AK115) in Healthy Participants: A Randomized, Double-Blind, Placebo-Controlled, Dose-Escalation Phase I Clinical Trial Drug Des. Devel. Ther. 2025 19 3225 3235 10.2147/DDDT.S500902 PMC12037183 40297315 26. Humes C. Sic A. Knezevic N.N. Substance P’s Impact on Chronic Pain and Psychiatric Conditions—A Narrative Review Int. J. Mol. Sci. 2024 25 5905 10.3390/ijms25115905 38892091 PMC11172719 27. Gonzalez M.I. Field M.J. Hughes J. Singh L. Evaluation of selective NK 1 J. Pharmacol. Exp. Ther. 2000 294 444 450 10.1016/S0022-3565(24)39091-3 10900217 28. Dionne R.A. Max M.B. Gordon S.M. Parada S. Sang C. Gracely R.H. Sethna N.F. MacLean D.B. The substance P receptor antagonist CP-99,994 reduces acute postoperative pain Clin. Pharmacol. Ther. 1998 64 562 568 10.1016/S0009-9236(98)90140-0 9834049 29. Hill R. NK 1 Trends Pharmacol. Sci. 2000 21 244 246 10.1016/S0165-6147(00)01502-9 10871891 30. Chizh B.A. Gohring M. Troster A. Quartey G.K. Schmelz M. Koppert W. Effects of oral pregabalin and aprepitant on pain and central sensitization in the electrical hyperalgesia model in human volunteers Br. J. Anaesth. 2007 98 246 254 10.1093/bja/ael344 17251214 31. Sindrup S.H. Graf A. Sfikas N. The NK 1 Eur. J. Pain 2006 10 567 571 10.1016/j.ejpain.2005.08.001 16199188 32. Goldstein D.J. Wang O. Saper J.R. Stoltz R. Silberstein S.D. Mathew N.T. Ineffectiveness of neurokinin-1 antagonist in acute migraine: A crossover study Cephalalgia 1997 17 785 790 10.1046/j.1468-2982.1997.1707785.x 9399010 33. Barbeito Erba L.H. Trias Tejería E. Varela Piedra Buena V. Semiglia Repetto G.G. Filomeno Andriolo A.E. Semiglia Alvarez C. Active Immunization for Reducing Osteoarthritic, Neuropathic, and Cancer Pain Patent WO2023139542A1 27 July 2023 34. Mehboob R. Oehme P. Pfaff G. The role of Substance P in the defense line of the respiratory tract and neurological manifestations post COVID-19 infection Front. Neurol. 2023 14 1052811 10.3389/fneur.2023.1052811 36949854 PMC10025330 35. Wattiez A.S. Sowers L.P. Russo A.F. Calcitonin gene-related peptide (CGRP): Role in migraine pathophysiology and therapeutic targeting Expert Opin. Ther. Targets 2020 24 91 100 10.1080/14728222.2020.1724285 32003253 PMC7050542 36. Iyengar S. Ossipov M.H. Johnson K.W. The role of calcitonin gene-related peptide in peripheral and central pain mechanisms including migraine Pain 2017 158 543 559 10.1097/j.pain.0000000000000831 28301400 PMC5359791 37. Tso A.R. Goadsby P.J. Anti-CGRP Monoclonal Antibodies: The Next Era of Migraine Prevention? Curr. Treat. Options Neurol. 2017 19 27 10.1007/s11940-017-0463-4 28653227 PMC5486583 38. Dodick D.W. Ashina M. Brandes J.L. Kudrow D. Lanteri-Minet M. Osipova V. Palmer K. Picard H. Mikol D.D. Lenz R.A. ARISE: A Phase 3 randomized trial of erenumab for episodic migraine Cephalalgia 2018 38 1026 1037 10.1177/0333102418759786 29471679 39. Dodart J.-C. Migraine Vaccine Shows Comparable Efficacy to Monoclonal Antibodies for Migraine Relief: Jean-Cosme Dodart, PhD. Neurology Live, 2023, May 10. Gale OneFile: Health and Medicine Available online: https://www.neurologylive.com/view/migraine-vaccine-shows-comparable-efficacy-monoclonal-antibodies-migraine-relief-jean-cosme-dodart (accessed on 25 August 2025) 40. Boyd J.D. Wang S. Lin H.W. Hsieh Y.T. Sun Y.S. Thibodeaux B.A. Lu H. Sahni J. Wiggins J. Longo M.S. Preclinical characterization of an active immunotherapy targeting calcitonin gene-related peptide Commun. Med. 2025 5 145 10.1038/s43856-025-00870-2 40301574 PMC12041250 41. Messina R. Huessler E.M. Puledda F. Haghdoost F. Lebedeva E.R. Diener H.C. Safety and tolerability of monoclonal antibodies targeting the CGRP pathway and gepants in migraine prevention: A systematic review and network meta-analysis Cephalalgia 2023 43 3331024231152169 10.1177/03331024231152169 36786548 42. Zhang H. Lin J.J. Xie Y.K. Song X.Z. Sun J.Y. Zhang B.L. Qi Y.K. Xu Z.Z. Yang F. Structure-guided peptide engineering of a positive allosteric modulator targeting the outer pore of TRPV1 for long-lasting analgesia Nat. Commun. 2023 14 4 10.1038/s41467-022-34817-1 36596769 PMC9810691 43. Brito R. Sheth S. Mukherjea D. Rybak L.P. Ramkumar V. TRPV1: A Potential Drug Target for Treating Various Diseases Cells 2014 3 517 545 10.3390/cells3020517 24861977 PMC4092862 44. Mitchell K. Lebovitz E.E. Keller J.M. Mannes A.J. Nemenov M.I. Iadarola M.J. Nociception and inflammatory hyperalgesia evaluated in rodents using infrared laser stimulation after Trpv1 gene knockout or resiniferatoxin lesion Pain 2014 155 733 745 10.1016/j.pain.2014.01.007 24434730 PMC4567256 45. Iftinca M. Defaye M. Altier C. TRPV1-targeted drugs in development for human pain conditions Drugs 2021 81 7 27 10.1007/s40265-020-01429-2 33165872 46. Awad-Igbaria Y. Ben-Menashe A. Sakas R. Edelman D. Fishboom T. Shamir A. Francois-Soustiel J. Palzur E. Novel insight into TRPV1-induced mitochondrial dysfunction in neuropathic pain Brain 2025 148 2563 2578 10.1093/brain/awaf044 39901826 47. Li T. Chung M.K. Striving toward hyperthermia-free analgesia: Lessons from loss-of-function mutations of human TRPV1 J. Clin. Investig. 2023 133 e167338 10.1172/JCI167338 36719371 PMC9888373 48. Do N. Zuo D. Kim M. Kim M. Ha H.J. Blumberg P.M. Ann J. Hwang S.W. Lee J. Discovery of Dual TRPA1 and TRPV1 Antagonists as Novel Therapeutic Agents for Pain Pharmaceuticals 2024 17 1209 10.3390/ph17091209 39338371 PMC11435370 49. Andrade A.C.M. Molina Esquivel N. Goldschmied Rossel F. Benso B. TRPV1-target drugs for the treatment of orofacial pain Front. Pharmacol. 2025 16 1568109 10.3389/fphar.2025.1568109 40343000 PMC12058838 50. Moiseenkova-Bell V.Y. Stanciu L.A. Serysheva I.I. Tobe B.J. Wensel T.G. Structure of TRPV1 channel revealed by electron cryomicroscopy Proc. Natl. Acad. Sci. USA 2008 105 7451 7455 10.1073/pnas.0711835105 18490661 PMC2396679 51. Ghilardi J.R. Freeman K.T. Jimenez-Andrade J.M. Mantyh W.G. Bloom A.P. Kuskowski M.A. Mantyh P.W. Administration of a tropomyosin receptor kinase inhibitor attenuates sarcoma-induced nerve sprouting, neuroma formation and bone cancer pain Mol. Pain 2010 6 87 10.1186/1744-8069-6-87 21138586 PMC3004846 52. Plevkova J. Poliacek I. Antosiewicz J. Adamkov M. Jakus J. Svirlochova K. Tatar M. Intranasal TRPV1 agonist capsaicin challenge and its effect on c-fos expression in the guinea pig brainstem Respir. Physiol. Neurobiol. 2010 173 11 15 10.1016/j.resp.2010.05.015 20580681 53. McDougall J.J. O’Brien M.S. Analgesic potential of voltage gated sodium channel modulators for the management of pain Curr. Opin. Pharmacol. 2024 75 102433 10.1016/j.coph.2024.102433 38277942 54. Martina M. Banderali U. Yogi A. Arbabi Ghahroudi M. Liu H. Sulea T. Durocher Y. Hussack G. van Faassen H. Chakravarty B. A Novel Antigen Design Strategy to Isolate Single-Domain Antibodies that Target Human Nav1.7 and Reduce Pain in Animal Models Adv. Sci. 2024 11 e2405432 10.1002/advs.202405432 39206821 PMC11516162 55. Eagles D.A. Chow C.Y. King G.F. Fifteen years of Na V Br. J. Pharmacol. 2022 179 3592 3611 10.1111/bph.15327 33206998 56. Zhang M.M. McArthur J.R. Azam L. Bulaj G. Olivera B.M. French R.J. Yoshikami D. Synergistic and antagonistic interactions between tetrodotoxin and mu-conotoxin in blocking voltage-gated sodium channels Channels 2009 3 32 38 10.4161/chan.3.1.7500 19221510 PMC2878737 57. Wu Q. Huang J. Fan X. Wang K. Jin X. Huang G. Li J. Pan X. Yan N. Structural mapping of Na V Nat. Commun. 2023 14 3224 10.1038/s41467-023-38942-3 37270609 PMC10239435 58. Bang S. Yoo J. Gong X. Liu D. Han Q. Luo X. Chang W. Chen G. Im S.T. Kim Y.H. Differential Inhibition of Na V V Neurosci. Bull. 2018 34 22 41 10.1007/s12264-018-0203-0 29333591 PMC5799132 59. Angelidou A. Koster J.A. Sherman A.C. McLoughlin C. Lalwani P. Kelly A. Saeed A. McEnaney K. Baden L.R. Brogna M. Product and trial design considerations on the path towards a vaccine to combat opioid overdose npj Vaccines 2025 10 35 10.1038/s41541-025-01083-3 39971929 PMC11840009 60. Romano I.G. Johnson-Weaver B. Core S.B. Jamus A.N. Brackeen M. Blough B. Dey S. Huang Y. Staats H. Wetsel W.C. Two doses of Qbeta virus like particle vaccines elicit protective antibodies against heroin and fentanyl npj Vaccines 2025 10 57 10.1038/s41541-025-01105-0 40148356 PMC11950649 61. Raleigh M.D. Baruffaldi F. Peterson S.J. Le Naour M. Harmon T.M. Vigliaturo J.R. Pentel P.R. Pravetoni M. A Fentanyl Vaccine Alters Fentanyl Distribution and Protects against Fentanyl-Induced Effects in Mice and Rats J. Pharmacol. Exp. Ther. 2019 368 282 291 10.1124/jpet.118.253674 30409833 PMC6346379 62. Pravetoni M. Pentel P.R. Potter D.N. Chartoff E.H. Tally L. LeSage M.G. Effects of an oxycodone conjugate vaccine on oxycodone self-administration and oxycodone-induced brain gene expression in rats PLoS ONE 2014 9 e101807 10.1371/journal.pone.0101807 25025380 PMC4099132 63. Barrientos R.C. Bow E.W. Whalen C. Torres O.B. Sulima A. Beck Z. Jacobson A.E. Rice K.C. Matyas G.R. Novel Vaccine That Blunts Fentanyl Effects and Sequesters Ultrapotent Fentanyl Analogues Mol. Pharm. 2020 17 3447 3460 10.1021/acs.molpharmaceut.0c00497 32787282 PMC7482402 64. Kosten T.R. Vaccines as Immunotherapies for Substance Use Disorders Am. J. Psychiatry 2024 181 362 371 10.1176/appi.ajp.20230828 38706331 65. Hutchings C.J. Colussi P. Clark T.G. Ion channels as therapeutic antibody targets MAbs 2019 11 265 296 10.1080/19420862.2018.1548232 30526315 PMC6380435 66. Stephens A.D. Wilkinson T. Discovery of therapeutic antibodies targeting complex multi-spanning membrane proteins BioDrugs 2024 38 769 794 10.1007/s40259-024-00682-1 39453540 PMC11530565 67. Russell F.A. King R. Smillie S.J. Kodji X. Brain S.D. Calcitonin gene-related peptide: Physiology and pathophysiology Physiol. Rev. 2014 94 1099 1142 10.1152/physrev.00034.2013 25287861 PMC4187032 68. Lin M. Lee J.C. Blake S. Ellis B. Eubanks L.M. Janda K.D. Broadly Neutralizing Synthetic Cannabinoid Vaccines JACS Au 2021 1 31 40 10.1021/jacsau.0c00057 34467269 PMC8395583 69. Eiden L.E. Hernandez V.S. Jiang S.Z. Zhang L. Neuropeptides and small-molecule amine transmitters: Cooperative signaling in the nervous system Cell. Mol. Life Sci. 2022 79 492 10.1007/s00018-022-04451-7 35997826 PMC11072502 70. Micoli F. Adamo R. Costantino P. Protein carriers for glycoconjugate vaccines: History, selection criteria, characterization and new trends Molecules 2018 23 1451 10.3390/molecules23061451 29914046 PMC6100388 71. Hosztafi S. Galambos A.R. Koteles I. Karadi D.A. Furst S. Al-Khrasani M. Opioid-Based Haptens: Development of Immunotherapy Int. J. Mol. Sci. 2024 25 7781 10.3390/ijms25147781 39063024 PMC11277321 72. Facciola A. Visalli G. Lagana A. Di Pietro A. An Overview of Vaccine Adjuvants: Current Evidence and Future Perspectives Vaccines 2022 10 819 10.3390/vaccines10050819 35632575 PMC9147349 73. Nooraei S. Bahrulolum H. Hoseini Z.S. Katalani C. Hajizade A. Easton A.J. Ahmadian G. Virus-like particles: Preparation, immunogenicity and their roles as nanovaccines and drug nanocarriers J. Nanobiotechnol. 2021 19 59 10.1186/s12951-021-00806-7 PMC7905985 33632278 74. Zepeda-Cervantes J. Ramírez-Jarquín J.O. Vaca L. Interaction between virus-like particles (VLPs) and pattern recognition receptors (PRRs) from dendritic cells (DCs): Toward better engineering of VLPs Front. Immunol. 2020 11 1100 10.3389/fimmu.2020.01100 32582186 PMC7297083 75. Mohsen M.O. Bachmann M.F. Virus-like particle vaccinology, from bench to bedside Cell Mol. Immunol. 2022 19 993 1011 10.1038/s41423-022-00897-8 35962190 PMC9371956 76. Baghban R. Ghasemian A. Mahmoodi S. Nucleic acid-based vaccine platforms against the coronavirus disease 19 (COVID-19) Arch. Microbiol. 2023 205 150 10.1007/s00203-023-03480-5 36995507 PMC10062302 77. Pardi N. Hogan M.J. Porter F.W. Weissman D. mRNA vaccines—A new era in vaccinology Nat. Rev. Drug Discov. 2018 17 261 279 10.1038/nrd.2017.243 29326426 PMC5906799 78. Xu J. Wang B. Zhao Z. Wu S. Zhang Z. Liu S. Huo N. Zheng W. Chen Y. Gao Z. Development of a novel adenovirus type 4 vector as a promising respiratory vaccine vehicle Front. Immunol. 2025 16 1572081 10.3389/fimmu.2025.1572081 40276512 PMC12018414 79. Li Y.Z. Ji R.R. Gene therapy for chronic pain management Cell Rep. Med. 2024 5 101756 10.1016/j.xcrm.2024.101756 39366385 PMC11513853 80. Guimaraes L.E. Baker B. Perricone C. Shoenfeld Y. Vaccines, adjuvants and autoimmunity Pharmacol. Res. 2015 100 190 209 10.1016/j.phrs.2015.08.003 26275795 PMC7129276 81. Ou B.S. Baillet J. Filsinger Interrante M.V. Adamska J.Z. Zhou X. Saouaf O.M. Yan J. Klich J.H. Jons C.K. Meany E.L. Saponin nanoparticle adjuvants incorporating Toll-like receptor agonists drive distinct immune signatures and potent vaccine responses Sci. Adv. 2024 10 eadn7187 10.1126/sciadv.adn7187 39110802 PMC11305391 82. Stone A.E. Scheuermann S.E. Haile C.N. Cuny G.D. Velasquez M.L. Linhuber J.P. Duddupudi A.L. Vigliaturo J.R. Pravetoni M. Kosten T.A. Fentanyl conjugate vaccine by injected or mucosal delivery with dmLT or LTA1 adjuvants implicates IgA in protection from drug challenge NPJ Vaccines 2021 6 69 10.1038/s41541-021-00329-0 33986280 PMC8119695 83. Hamid F.A. Marker C.L. Raleigh M.D. Khaimraj A. Winston S. Pentel P.R. Pravetoni M. Pre-clinical safety and toxicology profile of a candidate vaccine to treat oxycodone use disorder Vaccine 2022 40 3244 3252 10.1016/j.vaccine.2022.03.053 35469698 PMC9186020 84. Raleigh M.D. Laudenbach M. Baruffaldi F. Peterson S.J. Roslawski M.J. Birnbaum A.K. Carroll F.I. Runyon S.P. Winston S. Pentel P.R. Opioid dose-and route-dependent efficacy of oxycodone and heroin vaccines in rats J. Pharmacol. Exp. Ther. 2018 365 346 353 10.1124/jpet.117.247049 29535156 PMC5884377 85. Malerba F. Paoletti F. Cattaneo A. NGF and proNGF Reciprocal Interference in Immunoassays: Open Questions, Criticalities, and Ways Forward Front. Mol. Neurosci. 2016 9 63 10.3389/fnmol.2016.00063 27536217 PMC4971159 86. Yang B. Ma D. Zhu X. Wu Z. An Q. Zhao J. Gao X. Zhang L. Roles of TRP and PIEZO receptors in autoimmune diseases Expert Rev. Mol. Med. 2024 26 e10 10.1017/erm.2023.23 38659380 PMC11140548 87. Obeidat A.M. Donner A. Miller R.E. An update on targets for treating osteoarthritis pain: NGF and TRPV1 Curr. Treat. Options Rheumatol. 2020 6 129 145 10.1007/s40674-020-00146-x PMC8223492 34178580 88. Weiss J. Pyrski M. Jacobi E. Bufe B. Willnecker V. Schick B. Zizzari P. Gossage S.J. Greer C.A. Leinders-Zufall T. Loss-of-function mutations in sodium channel Na V Nature 2011 472 186 190 10.1038/nature09975 21441906 PMC3674497 89. Chen L. Shao C. Li J. Zhu F. Impact of Immunosenescence on vaccine immune responses and countermeasures Vaccines 2024 12 1289 10.3390/vaccines12111289 39591191 PMC11598585 90. Janković S. Vaccination and autoimmune phenomena Central Eur. J. Paed. 2017 13 12 23 10.5457/p2005-114.165 91. Finn O.J. Khleif S.N. Herberman R.B. The FDA guidance on therapeutic cancer vaccines: The need for revision to include preventive cancer vaccines or for a new guidance dedicated to them Cancer Prev. Res. 2015 8 1011 1016 10.1158/1940-6207.CAPR-15-0234 PMC4633304 26353948 92. USA Food and Drug Administration Clinical Considerations for Therapeutic Cancer Vaccines 2011 Available online: https://www.fda.gov/files/vaccines%2C%20blood%20%26%20biologics/published/Guidance-for-Industry--Clinical-Considerations-for-Therapeutic-Cancer-Vaccines.pdf (accessed on 13 August 2025) 93. Raval R.R. Sharabi A.B. Walker A.J. Drake C.G. Sharma P. Tumor immunology and cancer immunotherapy: Summary of the 2013 SITC primer J. Immunother. Cancer 2014 2 14 10.1186/2051-1426-2-14 24883190 PMC4039332 94. Rowbotham M.C. McDermott M.P. Ethical considerations in the design, execution, and analysis of clinical trials of chronic pain treatments Pain Rep. 2018 4 e646 10.1097/PR9.0000000000000646 31583332 PMC6749924 95. Hodel K.V.S. Fiuza B.S.D. Conceição R.S. Aleluia A.C.M. Pitanga T.N. Fonseca L.M.D.S. Valente C.O. Minafra-Rezende C.S. Machado B.A.S. Pharmacovigilance in vaccines: Importance, main aspects, perspectives, and challenges—A narrative review Pharmaceuticals 2024 17 807 10.3390/ph17060807 38931474 PMC11206969 96. Wartenweiler V. Chung G. Stewart A. Wenthur C. Pharmacy stakeholder reports on ethical and logistical considerations in anti-opioid vaccine development BMC Med. Ethics 2021 22 30 10.1186/s12910-021-00599-2 33766021 PMC7992836 97. Ladd J.M. Ungar L.D. An Ethical Take on the “Stress Vaccine” AMA J. Ethics 2012 14 60 67 10.1001/virtualmentor.2012.14.1.oped2-1201 23116919 98. Phelps C.E. Navratilova E. Porreca F. Cognition in the chronic pain experience: Preclinical insights Trends Cogn. Sci. 2021 25 365 376 10.1016/j.tics.2021.01.001 33509733 PMC8035230 99. Jia T. Pan Y. Li J. Wang L. Strategies for active TNF-alpha vaccination in rheumatoid arthritis treatment Vaccine 2013 31 4063 4068 10.1016/j.vaccine.2013.06.101 23845805 100. Reis C. Chambel S. Ferreira A. Cruz C.D. Involvement of nerve growth factor (NGF) in chronic neuropathic pain—A systematic review Rev. Neurosci. 2023 34 75 84 10.1515/revneuro-2022-0037 35792932 101. Bouhassira D. Branders S. Attal N. Fernandes A.M. Demolle D. Barbour J. Ciampi de Andrade D. Pereira A. Stratification of patients based on the Neuropathic Pain Symptom Inventory: Development and validation of a new algorithm Pain 2021 162 1038 1046 10.1097/j.pain.0000000000002130 33136982 102. Schijns V. Majhen D. Van Der Ley P. Thakur A. Summerfield A. Berisio R. Nativi C. Fernández-Tejada A. Alvarez-Dominguez C. Gizurarson S. Rational vaccine design in times of emerging diseases: The critical choices of immunological correlates of protection, vaccine antigen and immunomodulation Pharmaceutics 2021 13 501 10.3390/pharmaceutics13040501 33917629 PMC8067490 103. Lamontagne F. Khatri V. St-Louis P. Bourgault S. Archambault D. Vaccination strategies based on bacterial self-assembling proteins as antigen delivery nanoscaffolds Vaccines 2022 10 1920 10.3390/vaccines10111920 36423016 PMC9696568 104. Shirahama T. Muroya D. Matsueda S. Yamada A. Shichijo S. Naito M. Yamashita T. Sakamoto S. Okuda K. Itoh K. A randomized phase II trial of personalized peptide vaccine with low dose cyclophosphamide in biliary tract cancer Cancer Sci. 2017 108 838 845 10.1111/cas.13193 28188670 PMC5448649 105. Brown S.A. Surman S.L. Sealy R. Jones B.G. Slobod K.S. Branum K. Lockey T.D. Howlett N. Freiden P. Flynn P. Heterologous Prime-Boost HIV-1 Vaccination Regimens in Pre-Clinical and Clinical Trials Viruses 2010 2 435 467 10.3390/v2020435 20407589 PMC2855973 106. Dalmia N. Ramsay A.J. Prime-boost approaches to tuberculosis vaccine development Expert Rev. Vaccines 2012 11 1221 1233 10.1586/erv.12.94 23176655 PMC3572762 107. Zhao J. Huh Y. Bortsov A. Diatchenko L. Ji R.R. Immunotherapies in chronic pain through modulation of neuroimmune interactions Pharmacol. Ther. 2023 248 108476 10.1016/j.pharmthera.2023.108476 37307899 PMC10527194 108. Furlan R. A tolerizing mRNA vaccine against autoimmunity? Mol. Ther. 2021 29 896 897 10.1016/j.ymthe.2021.02.003 33571462 PMC7875549 109. Urbonaviciute V. Romero-Castillo L. Xu B. Luo H. Schneider N. Weisse S. Do N.-N. Oliveira-Coelho A. Fernandez Lahore G. Li T. Therapy targeting antigen-specific T cells by a peptide-based tolerizing vaccine against autoimmune arthritis Proc. Natl. Acad. Sci. USA 2023 120 e2218668120 10.1073/pnas.2218668120 37307481 PMC10288627 Figure 1 Comparative overview of therapeutic strategies for chronic pain. Different strategies for managing chronic pain include medication-based treatments, passive immunization (such as monoclonal antibody therapies), and active immunization (such as anti-pain vaccines). These approaches differ across several clinical parameters. Medications are typically associated with a higher incidence of side effects, a greater need for repeated dosing, increased risk of dependence or addiction, and shorter duration of effect. In comparison, passive and active immunization strategies may provide longer-lasting relief, reduced dosing frequency, and a lower risk of dependence. However, the side effect profiles and analgesic potential of immunotherapies are still not fully established. (+) minor; (++) moderate; (+++) major; (—) absent; (?) unknown. Figure 2 Immunological strategies for the treatment of chronic pain. Active immunization using anti-pain vaccines can stimulate the immune system to produce antibodies that target molecules involved in chronic pain, such as nerve growth factor (NGF) and calcitonin gene-related peptide (CGRP). These molecules play key roles in nociceptive signaling observed in conditions like osteoarthritis and migraine. By neutralizing these targets, vaccine-based therapies may provide longer-lasting analgesic effects compared to conventional medications. In addition to antibody-based approaches, a future therapeutic strategy may involve the induction of immune tolerance rather than a classical immune response. This could be achieved using tolerizing vaccines that modulate T cell activity. Such an approach may help control autoimmune-mediated pain conditions, including complex regional pain syndrome (CRPS), by dampening pathological immune responses. vaccines-13-00909-t001_Table 1 Table 1 Comparison of preclinical data, clinical data, safety issues, platforms used, and indications across different anti-pain vaccine targets. Target Preclinical Data Clinical Data Safety Issues Platforms Used Indications NGF VLP-NGF vaccine in mice showed high anti-NGF antibody titers, reversed pain behaviors in osteoarthritis model, no overt toxicity [ 23 Phase I trial completed; good safety and tolerability; long-term efficacy still unknown [ 25 Potential joint degeneration risk; long-term NGF blockade may affect repair mechanisms [ 17 86 Virus-like particles (VLP) using cucumber mosaic virus [ 23 Osteoarthritis, chronic low-back pain [ 17 23 Substance P Patent-based canine study with dual NGF+SP vaccine; strong antibody response and improved mobility; no peer-reviewed rodent data [ 32 No human data; dual NGF+SP vaccine only tested in dogs (OA) [ 32 Dual-targeting may increase complexity; off-target modulation of SPâ€™s anti-nociceptive roles is a concern [ 33 Recombinant fusion protein vaccine combining SP and NGF for dogs [ 32 Inflammatory/neuropathic pain (e.g., CRPS, fibromyalgia) [ 26 32 CGRP UB-313 vaccine generated high-affinity antibodies in rodents and primates; reduced pain behavior in trigeminal pain models [ 39 UB-313 Phase 1 trial started 2023; interim data shows tolerability and antibody generation; efficacy pending [ 38 Possible cardiovascular effects with long-term CGRP suppression; needs monitoring [ 40 VLP platform UB-313, derived from bacteriophage VLPs [ 39 Migraine (primary); potential for cluster headaches [ 38 TRPV1 No direct TRPV1 vaccine tested; nanobody approaches modulate TRPV1; capsaicin-BSA vaccine raised antibodies in guinea pigs [ 51 No clinical vaccine studies; hyperthermia remains a major safety barrier with TRPV1 targeting [ 46 47 Hyperthermia and sensory disruption due to TRPV1â€™s thermoregulation role [ 46 47 No vaccine yet; early-stage nanobody/immunogen work; capsaicin-BSA model [ 51 Neuropathic and inflammatory pain syndromes [ 44 Nav1.7 Nanobodies and mAbs reduced pain in rodent models; no vaccine yet; theoretical models propose peptide/domain-specific immunization [ 53 56 No human data; theoretical risks include cross-reactivity and autoimmunity; no vaccine candidates yet [ 53 77 Autoimmunity and anosmia due to Nav1.7’s expression in sensory/olfactory neurons [ 77 Monoclonal/nanobody proof-of-concept; theoretical peptide/domain vaccines [ 53 56 Congenital or acquired pain disorders; chronic inflammatory pain [ 53 Opioids Heroin/fentanyl/oxycodone vaccines showed protection in rodents; high antibody titers blocked analgesic and respiratory effects [ 59 62 Phase 1 oxycodone vaccine showed immunogenicity in OUD patients; reduced drug liking in high responders [ 63 Risk of impeding emergency analgesia; off-target immune complex disease not observed in short term [ 60 61 Hapten-protein conjugates with KLH or VLPs (e.g., QÎ 2 59 Opioid use disorder; reducing abuse and overdose [ 58 59 Cannabinoids Synthetic cannabinoid vaccines in mice raised antibodies against various analogues; reduced behavioral effects; no pain data [ 64 No clinical studies; potential for public health use in cannabis misuse rather than direct analgesia [ 64 May interfere with therapeutic use of cannabinoids in legitimate medical contexts [ 64 Synthetic cannabinoids conjugated to protein carriers; adjuvanted conjugate vaccines [ 64 Cannabis misuse; public health and addiction contexts [ 64 ",
  "metadata": {
    "Title of this paper": "Therapy targeting antigen-specific T cells by a peptide-based tolerizing vaccine against autoimmune arthritis",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474396/"
  }
}