{
  "title": "Paper_280",
  "abstract": "pmc J Dent Sci J Dent Sci 3597 jds Journal of Dental Sciences 1991-7902 2213-8862 Association for Dental Sciences of the Republic of China PMC12485402 PMC12485402.1 12485402 12485402 41040543 10.1016/j.jds.2025.03.032 S1991-7902(25)00105-9 1 Original Article Lunar life drives jawbone formation Sato Kotaro sato.kotaro.n1@f.mail.nagoya-u.ac.jp a b ⁎ † Kouyama Naoka a † Akatsuka Shinya b Motooka Yashiro b Wang Qinhong a Hibi Hideharu a c Toyokuni Shinya b c d a b c d ⁎ sato.kotaro.n1@f.mail.nagoya-u.ac.jp † These two authors had equal contribution to this study. 10 2025 09 4 2025 20 4 498055 2399 2406 7 3 2025 24 3 2025 09 04 2025 02 10 2025 03 10 2025 © 2025 Association for Dental Sciences of the Republic of China. Publishing services by Elsevier B.Vé. 2025 Association for Dental Sciences of the Republic of China https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Background/purpose The Japan Aerospace Exploration Agency bred mice in the “Kibo” module on the International Space Station to clarify the effects of gravity changes on the body. We determined the effects of lunar gravity (partial gravity, 1/6G) on the jawbone and elucidated its relationship with the oral cavity. Materials and methods Mandibular bones of C57BL/6J male mice from the Kibo group (1/6G) and the Earth group (1G) were obtained. Ribonucleic acid was extracted from the samples; microarray and gene set enrichment analysis (GSEA) were performed; bone structure and histology were evaluated via micro-computed tomography, immunohistochemistry, and specific staining. Results Microarray analysis revealed a significant increase in dentin matrix protein 1 (DMP1) expression in the 1/6G group. GSEA revealed enhanced Hedgehog signaling in this group. The weight and density of the cancellous bone were significantly greater in the 1/6G group than in the 1G group, as confirmed by histological analysis. Furthermore, the expression of insulin-like growth factor 1 (IGF-1), which is associated with mastication-induced bone formation, was increased in the 1/6G group. Although secreted phosphoprotein 1 (SPP1), which is associated with bone resorption under low mechanical stress, increased in the 1/6G group, receptor activator of nuclear factor kappa-B ligand (RANKL)-RANK signaling did not increase. No significant differences in the number or activity of osteoclasts were observed between the 1G and 1/6G groups. Conclusion Bone formation, but not bone resorption, is promoted by lunar gravity and is associated with mastication. Proper oral management is necessary for extended lunar habitation. Keywords DMP1 Hedgehog signaling Jawbone Lunar gravity Mastication SPP1 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Gravity on Earth results from terrestrial gravitation and the Coriolis force and is inseparably linked to our lives; this force is often taken for granted. Understanding the role of gravity in life will help elucidate the basic physiological mechanisms involved in the differentiation, development, and evolution of animals, plants, and humans. However, extraterrestrial colonization may eventually become necessary for the survival of the human species. The Artemis mission, a 2024 human lunar exploration plan by the National Aeronautics and Space Administration (NASA), aims to send humans to the Moon after 2025, transport supplies through the Gateway (a manned lunar orbit base) project and construct a lunar base to sustain human activities. The space environment is believed to accelerate biological changes such as bone loss, muscle atrophy, inner ear dysfunction, and immune dysfunction, similar to those observed in older individuals who are bedridden on Earth. 1 2 , 3 We aimed to investigate the effects of low gravity in the space environment on the jawbone and clarify the relationship between space and the oral cavity, particularly the jawbone. Materials and methods Animals C57BL/6J male mice (stock #000664) were purchased from Jackson Laboratories (Bar Harbour, ME, USA) and Charles River Laboratories (Yokohama, Japan). This experiment was approved by the Institutional Animal Care and Use Committee of the Japan Aerospace Exploration Agency (JAXA) (protocol number: No. 018-011D), Explora Biolabs (study number: No. EB19-003), and NASA (protocol number: No. FLT-18-118). All experiments were conducted in accordance with the guidelines and applicable laws in Japan and the USA. Six mice in the transportation cage unit were launched aboard SpX-17 on May 7, 2019, from NASA's Kennedy Space Center and transported to the ISS. To determine the effects of different gravitational forces on mice during spaceflight, they were maintained on the ISS for approximately 1 month ( Fig. 1 2 , 3 Figure 1 Schematic representation of flight conditions and the experiment Figure 1 Ribonucleic acid (RNA) extraction The harvested tissues were fixed in 4 % phosphate-buffered formalin for 24–48 h at 4 °C. After fixation, the tissues were placed in phosphate-buffered saline (PBS) for approximately 40 days, and PBS was sequentially replaced with 25, 50, 75, or 100 % methanol. RNA was extracted from the samples using a miRNeasy® FFPE Kit (QIAGEN, #217504, Hilden, Germany), RNase-Free DNase Set (QIAGEN, #79254), NanoDrop™ One (Thermo Fisher Scientific, Waltham, MA, USA), and Agilent RNA 6000 Nano Kit (Agilent Technologies, Inc., #5067-1511, Santa Clara, CA, USA). The quality was assessed using an Agilent 2100 Bioanalyzer (Agilent Technologies, Inc.). Microarray and gene set enrichment analysis (GSEA) We used a Clariom™ S Assay Mouse (Thermo Fisher Scientific, # 902,930) for this assay. First, we produced fragmented and labeled complementary deoxyribonucleic acid (cDNA) from 50 ng of total RNA with a GeneChip™ 3′ IVT Pico Kit (Thermo Fisher Scientific, # 902,789) and prepared 100 μL of hybridization mixture (73 μL of hybridization master mix + 5.0 μg of fragmented and labeled cDNA). The arrays were incubated for 16 h (60 rpm) at 45 °C in a GeneChip™ Hybridization Oven 645 (Thermo Fisher Scientific) and washed with a GeneChip™ Fluidics Station 450 (Thermo Fisher Scientific) according to the manufacturer's protocol. The samples were scanned using a GeneChip Scanner 3000 7G (Thermo Fisher Scientific). We analyzed the results using the Transcriptome Analysis Console (Thermo Fisher Scientific). Hierarchical clustering analysis was also performed on the expression profiles of the 63 differentially expressed genes. We normalized the profile data of each gene via z-score transformation and used Ward's clustering method for analysis. Based on the microarray data, we performed GSEA ( http://software.broadinstitute.org/gsea/ GSE286071 Evaluation of mandibular bone quality via computed tomography (CT) Mandibular bones were imaged with a Cosmo Scan GXII (Rigaku, Tokyo, Japan) using the following camera settings: exposure time, 4 min; field of view, 18 mm. We measured the average tissue volume, bone volume, bone surface area, and bone volume fraction (bone volume/tissue volume) from the distal terminal molar to the mandibular ramus, excluding the teeth. Data were analyzed via the bone analysis software TRI/3D-BON (RATOC, Tokyo, Japan). Histological analysis Fixed tissues were decalcified with 10% ethylenediaminetetraacetic acid disodium salt, embedded in paraffin, sectioned at 5 μm, mounted on glass slides, and deparaffinized before hematoxylin and eosin and picrosirius red staining. To analyze the distribution of osteoblasts and osteoclasts, we used a tartrate-resistant acid phosphatase/alkaline phosphatase staining kit (Wako, # 294–67001, Osaka, Japan) according to the manufacturer's protocol. Immunohistochemistry (IHC) was performed on a BOND-MAX system (Leica Microsystems GmbH, Wetzlar, Germany) using the manufacturer's reagents following the manufacturer's protocol. Anti-dentin matrix protein 1 (DMP1) (Invitrogen, PA5-103323, Carlsbad, CA, USA), secreted phosphoprotein 1 (SPP1) (Invitrogen, PA5-141,129), runt-related transcription factor 2 (RUNX2) (Abcam, ab192256, Cambridge, UK), bone morphogenetic protein 2 (BMP2) (Bioss, bs-1012R, Boston, MA, USA), Sp7 (Abcam, ab209484), cathepsin K (Abcam, ab300569), and insulin-like growth factor 1 (IGF-1) (Proteintech, 28530-1-AP, Rosemont, IL, USA) antibodies were used after dilution with primary antibody diluent (Leica). For the IGF-1 intensity score, we set four scores (0–3) for the osteocytes and randomly selected fields. All osteocytes were scored, and the average intensity was calculated. Statistical analysis Statistical analyses were performed using Student's t-test with GraphPad Prism 9 (GraphPad Software, San Diego, CA, USA). P Results Life in lunar gravity (1/6G) upregulates DMP1 and SPP1 and promotes the bone maturation pathway We performed a microarray analysis to determine the effects of lunar gravity on the jawbone in the space environment. DMP1 expression significantly increased in the 1/6G group ( Fig. 2 Supplementary Fig. 1A Fig. 2 Supplementary Fig. 1B Figure 2 Analysis of gene expression profiles under partial gravity (PG: 1/6G) and ground control (GC: 1G) conditions P P Figure 2 IGF-1 expression is increased, as is type I collagen expression, leading to an increase in bone density during lunar gravity We investigated the role of mastication in bone formation. IHC revealed a significant increase in IGF-1 expression in osteocytes at 1/6G ( P Fig. 3 Fig. 3 Fig. 3 Figure 3 Effect of partial gravity on the mandibular bone P P Figure 3 Lunar gravity did not change the number or activity of osteoclasts or promote receptor activator of nuclear factor kappa-B ligand (RANKL)-RANK signaling Tartrate-resistant acid phosphatase staining showed no increase in the number of osteoclasts in the 1/6G group. Furthermore, no significant difference was observed in cathepsin K expression at either the RNA or IHC levels ( Fig. 4 Fig. 4 Figure 4 Bone resorption factors in the mandibular bone Figure 4 Discussion Under lunar gravity (1/6G), bone formation markers in the mandible are upregulated, and bone density increases, which might be related to mastication. Surprisingly, no bone resorption was observed. These results suggest that when people live and eat the same food as they do on Earth under lunar gravity, bone formation, rather than resorption, is promoted in the jawbone ( Fig. 5 2 , 3 Figure 5 Overview of the effect of lunar gravity on the jawbone Figure 5 First, a comprehensive analysis was conducted to clarify the changes that occurred in the samples. We found that some factors related to bone metabolism changed and focused on these factors to advance this research. DMP1 is a non-collagenous protein expressed in bones and teeth and is specifically expressed in osteocytes in bone tissue. 4 , 5 6 P In general, there are two types of ossification patterns: intramembranous and endochondral. In intramembranous ossification, aggregated mesenchymal cells differentiate into osteoblasts, and bone formation progresses, whereas, in endochondral ossification, mesenchymal cells differentiate into chondrocytes and osteoblasts, with bone formation occurring after cartilage formation. This pathway involves quiescent chondrocytes, proliferating chondrocytes, hypertrophic chondrocytes, and osteoblasts. Chondrocytes grow from quiescent to proliferating state while secreting cartilage matrix proteins, such as glycosaminoglycans and collagen types 2, 9, and 10. Eventually, these cells stop proliferating and differentiate into hypertrophic chondrocytes, which secrete type 10 collagen, matrix metalloproteinase-13, and vascular endothelial growth factor. During this process, SRY-box9 acts as the master regulator, whereas RUNX2 and myocyte-specific enhancer factor 2c promote hypertrophic differentiation. Hypertrophic chondrocytes promote surrounding mineralization and angiogenesis. As cartilage is resorbed, a primary ossification center forms and is replaced by bone. Mesenchymal cells in the perichondrium surrounding the cartilage contain osteoblast precursor cells. Some of these cells enter the cartilage interior during angiogenesis and become osteoblasts, thus contributing to the formation of primary ossification centers. Moreover, cells that differentiate into osteoblasts in the periphery form a bone shell, which becomes the source of cortical bone. During osteoblast differentiation, mesenchymal cells first become RUNX2-positive osteoblast precursor cells and then differentiate into osteoblasts expressing Sp7. These cells are the master regulators of osteoblast differentiation. Subsequently, osteoblasts secrete bone matrix proteins such as SPP1, Ibsp, and Bglap, along with type I collagen, to induce matrix mineralization. BMP2 belongs to the TGF-β superfamily and is known as a bone formation factor that induces bone formation. 7 Consequently, we examined other factors related to bone formation, including collagen and signaling pathways involved in bone metabolism. Collagen is secreted by the osteoblasts and contributes to osteoid formation and bone calcification. 8 9 SPP1, which is related to bone resorption under low mechanical stress, increased in response to 1/6G. SPP1 is thought to react to mechanical stress, such as tail suspension, and to inhibit bone formation and promote bone resorption. 10 11 12 13 10 11 12 To clarify these mechanisms, we focused on mastication as a factor promoting bone formation under 1/6G. The relationship between mastication and jaw development has long been known, as jaw development changes depending on the hardness of the food. 14 15 16 , 17 When living in space with lunar gravity, unlike on Earth, jawbone resorption is not promoted; instead, bone formation is enhanced, suggesting that mastication may play a role in this process. We believe this research will lead to rapid developments in space stomatology and serve as an important step toward space exploration and future space colonization. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Nicogossian A.E. Parker J.F. Space physiology and medicine 1982 National Aeronautics and Space Administration Scientific and Technical Information Branch Washington, District of Columbia 2 Shiba D. Mizuno H. Yumoto A. Development of new experimental platform ‘MARS’-multiple artificial-gravity research system-to elucidate the impacts of micro/partial gravity on mice Sci Rep 7 2017 10837 10.1038/s41598-017-10998-4 PMC5589811 28883615 3 Hayashi T. Fujita R. Okada R. Lunar gravity prevents skeletal muscle atrophy but not myofiber type shift in mice Commun Biol 6 2023 424 37085700 10.1038/s42003-023-04769-3 PMC10121599 4 George A. Sabsay B. Simonian P.A. Veis A. Characterization of a novel dentin matrix acidic phosphoprotein. Implications for induction of biomineralization J Biol Chem 268 1993 12624 12630 8509401 5 Toyosawa S. Shintani S. Fujiwara T. Dentin matrix protein 1 is predominantly expressed in chicken and rat osteocytes but not in osteoblasts J Bone Miner Res Dent 16 2001 2017 2026 10.1359/jbmr.2001.16.11.2017 11697797 6 Feng J.Q. Ward L.M. Liu S. White, Loss of DMP1 causes rickets and osteomalacia and identifies a role for osteocytes in mineral metabolism Nat Genet 38 2006 1310 1315 17033621 10.1038/ng1905 PMC1839871 7 Miyazono K. Kamiya Y. Morikawa M. Bone morphogenetic protein receptors and signal transduction J Biochem 147 2010 35 51 19762341 10.1093/jb/mvp148 8 Saito M. Marumo K. Collagen cross-links as a determinant of bone quality: a possible explanation for bone fragility in aging, osteoporosis, and diabetes mellitus Osteoporos Int 21 2010 195 214 19760059 10.1007/s00198-009-1066-z 9 Yang J. Andre P. Ye L. Yang Y.Z. The Hedgehog signalling pathway in bone formation Int J Oral Sci 7 2015 73 79 26023726 10.1038/ijos.2015.14 PMC4817553 10 Kodama Y. Nakayama K. Fuse H. Inhibition of bone resorption by pamidronate cannot restore normal gain in cortical bone mass and strength in tail-suspended rapidly growing rats J Bone Miner Res 12 1997 1058 1067 9200005 10.1359/jbmr.1997.12.7.1058 11 Apseloff G. Girten B. Weisbrode S.E. Effects of aminohydroxybutane bisphosphonate on bone growth when administered after hind-limb bone loss in tail-suspended rats J Pharmacol Exp Therapeut 267 1993 515 521 8229783 12 Apseloff G. Girten B. Walker M. Aminohydroxybutane bisphosphonate and clenbuterol prevent bone changes and retard muscle atrophy respectively in tail-suspended rats J Pharmacol Exp Therapeut 264 1993 1071 1078 8450451 13 Si J. Wang C. Zhang D. Wang B. Zhou Y. Osteopontin in bone metabolism and bone diseases Med Sci Monit 26 2020 e919159 10.12659/MSM.919159 PMC7003659 31996665 14 Tonni I. Riccardi G. Piancino M.G. Stretti C. Costantinides F. Paganelli C. The influence of food hardness on the physiological parameters of mastication: a systematic review Arch Oral Biol 120 2020 104903 10.1016/j.archoralbio.2020.104903 33142153 15 Inoue M. Ono T. Kameo Y. Forceful mastication activates osteocytes and builds a stout jawbone Sci Rep 9 2010 4404 10.1038/s41598-019-40463-3 PMC6424982 30890758 16 Ogata N. Chikazu D. Kubota N. Insulin receptor substrate-1 in osteoblast is indispensable for maintaining bone turnover J Clin Investig 105 2000 935 943 10749573 10.1172/JCI9017 PMC377487 17 Akune T. Ogata N. Hoshi K. Insulin receptor substrate-2 maintains predominance of anabolic function over catabolic function of osteoblasts J Cell Biol 159 2002 147 156 12379806 10.1083/jcb.200204046 PMC2173484 Appendix A Supplementary data The following is the Supplementary data to this article. Multimedia component 1 Multimedia component 1 Acknowledgments We thank Nobuaki Misawa, Yuki Maeda, and Jyunna Watanabe (Nagoya University) for their technical assistance. The biospecimens used in this study were provided by a tissue-sharing solicitation for the JAXA mouse missions in space. This work was supported in part by JST CREST JPMJCR19H4 JSPS Kakenhi JP19H05462 JSPS Kakenhi 22K17200 Japanese Association of Medical Sciences TOYOAKI SCHOLARSHIP FOUNDATION Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.jds.2025.03.032 ",
  "metadata": {
    "Title of this paper": "Insulin receptor substrate-2 maintains predominance of anabolic function over catabolic function of osteoblasts",
    "Journal it was published in:": "Journal of Dental Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485402/"
  }
}