{
  "title": "Paper_209",
  "abstract": "pmc F1000Res F1000Res 2005 f1000res F1000Research 2046-1402 Faculty of 1000 Ltd PMC12487785 PMC12487785.3 12487785 12490330 10.12688/f1000research.161505.3 3 Study Protocol Articles A Quasi-Experimental Study Protocol on the Impact of a Mobile Health\nProgram for HIV Counseling and Testing in the Deaf Community [version 3; peer review: 1 approved Rosyad Yafi Sabila Conceptualization Data Curation Formal Analysis Funding Acquisition Investigation Methodology Project Administration Resources Validation Visualization Writing – Original Draft\nPreparation Writing – Review &\nEditing https://orcid.org/0000-0002-2025-6826 a 1 2 Aljaberi Musheer Abdulwahid Investigation Project Administration Supervision Validation Writing – Original Draft\nPreparation Writing – Review &\nEditing 3 Natarajan Satheesh Babu Data Curation Investigation Methodology Supervision Validation Writing – Original Draft\nPreparation Writing – Review &\nEditing 4 Maria Dely Conceptualization Formal Analysis Methodology Visualization Writing – Original Draft\nPreparation 5  1  2  3  4  5 a rosyad2yafi@gmail.com No competing interests were disclosed. 4 6 2025 2025 14 479697 239 2 6 2025 04 06 2025 03 10 2025 03 10 2025 12487785 10.12688/f1000research.161505.1 1 26 02 2025 12487785 10.12688/f1000research.161505.1 1 26 02 2025 12487788 10.12688/f1000research.161505.2 2 03 04 2025 12490330 10.12688/f1000research.161505.3 3 04 06 2025 Copyright: © 2025 Rosyad YS et al. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the\nCreative Commons Attribution Licence, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is\nproperly cited. The author(s) is/are employees of the US Government and therefore\ndomestic copyright protection in USA does not apply to this work. The work\nmay be protected under the copyright laws of other jurisdictions when used\nin those jurisdictions. Background Deaf persons are considered a high-risk population for health disparities.\nDuring the covid-19 epidemic, deaf persons also suffer from psychological\nissues, post-traumatic stress disorder, and seropositive HIV. Objective This study aims to examine the effectiveness of an mobile health educational\nprogram to increase mental health and HIV prevention among deaf\ncommunity Methods This study employs a quasi-experimental design with a non-randomized\ncontrolled trial, involving single-blinded participants and a parallel group\nassignment, purpose for health service research, study phase 2-3. pronounced\nto escalate the sample size to 40 deaf per group, which is 80 total\nparticipants. Results The analysis of the data will be conducted utilizing the generalized\nestimation equation, with a confidence interval set at 95%. Significant\ndifferences, both between and within groups, will be identified at a\nthreshold of P<.05. The findings of this study highlight the efficacy of\na mobile educational program in enhancing mental health and preventing HIV\nwithin the deaf community. Furthermore, the outcomes of this research will\naugment existing knowledge regarding psychological distress, HIV prevention\npractices, and coping self-efficacy among individuals who are deaf. Conclusion The intervention group is expected to demonstrate significantly lower scores\nin psychological distress during both the immediate evaluation and the\nassessment conducted three months post-intervention, compared to the\nwait-list group. Additionally, the intervention group is anticipated to\nexhibit enhanced levels of HIV prevention practices and coping\nself-efficacy, resulting in a greater degree of adjustment. Clinical trial SLCTR/2024/039, 25 November 2024, https://slctr.lk/trials/slctr-2024-039 MHealth HIV/AIDS Deaf VCT The author(s) declared that no grants were involved in supporting\nthis work. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version yes pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Revised Amendments from Version 2 The rationale and objectives of the study have been clarified with a concise\nstatement linking the identified public health challenge to the specific need\nfor a mobile-based HIV prevention program tailored for the deaf community. The\nstudy design has been clearly described as a quasi-experimental, non-randomized\ncontrolled trial with a single-blinded structure. Details regarding participant\nblinding and group assignment have been expanded, including mitigation\nstrategies for potential biases due to the lack of randomization. The\nsample size calculation now includes the specific effect size, statistical\nassumptions (α = 0.05, power = 0.95), and adjustments for expected\ndropout. The statistical analysis section has been streamlined and revised for\nconsistency, including the proper application of Generalized Estimating\nEquations (GEE), specification of primary and secondary outcomes, interaction\nterms, and missing data strategies. Recruitment and retention strategies have\nbeen enhanced, with details about collaboration with Gerkatin leadership,\nmultichannel participant engagement, and retention support such as WhatsApp\ngroup monitoring. The informed consent process is now more thoroughly described,\nincluding the use of sign language videos for study information, signed written\nconsent, participant autonomy, and data privacy protections. We have also added\na discussion on potential technological barriers, such as device access and\ndigital literacy, along with proposed solutions. Furthermore, a dissemination\nplan has been included, outlining how findings will be communicated back to the\ndeaf community through sign language videos and community briefings. Finally,\nthe manuscript has undergone careful language editing to improve clarity,\ngrammar, and terminology consistency. We have standardized the use of\n“deaf persons” across the text in accordance with community\npreferences and ensured linguistic accuracy throughout. Introduction HIV prevention in the deaf-disabled population is one of the HIV-related health\nprogram’s concerns ( United Nations,\n2016 World Health Organization (WHO),\n2021b Schenk et al., 2020 Schenk et\nal., 2020 Persons with disabilities are 1.1 to 2.05 times more likely to engage in HIV-risk\nbehaviors, such as substance misuse, alcoholism, sexual activity without the use of\na condom, and partner switching. Awareness of HIV testing is also 1.1 times lower\namong people with disabilities compared to the general population ( Doyle et al., 2021 Olakunde & Pharr, 2020 In addition to the absence of HIV-related information for the deaf, psychological\nissues are also a common obstacle. Hearing loss at any age is also associated with\nanxiety, low self-esteem and worth, cognitive decline, and diminished health-related\nquality of life as well as psychological distress ( Mehboob Khan et al., 2019 Alika et al., 2016 Fergusson & Woodward, 2002 Deaf persons was linked to distress in a major sample of persons under 70 years of\nage ( Bosdriesz et al., 2017 National Insitute on Aging (NIA), 2018 Ariapooran\net al., 2021 Their failure to establish good verbal communication may result in social rejection,\na lack of education, and a poor work position, all of which have a significant\nnegative influence on their self-esteem ( Gotowiec\net al., 2022 Munoz-Baell & Ruiz,\n2000 Strong & Shaver,\n1991 Jambor and Elliott\n(2005) Indiana\net al., 2021 Jambor & Elliott,\n2005 Theunissen et al.,\n2014 According to WHO estimates, Over 5% of the world’s population, or 430 million\nindividuals, have ‘disabling’ hearing loss and need rehabilitation\n(432 million adults and 34 million children). It is anticipated that by 2050,\napproximately 700 million individuals, or one in ten, would suffer from hearing\nimpairment. Less than one percent of deaf, hard of hearing, and deaf and blind\nchildren in underdeveloped nations have access to school ( World Health Organization (WHO), 2021a El-Soud & Hassan, 2009 Bahareh & Heidary, 2015 Harmer, 1999 National Health Service, 2005 Joseph AM, 2009 There are challenges for the deaf person to get health information ( Folkins et al., 2005 Kelly & McKenzie, 2018 Drigas et al., 2009 Boisvert et al., 2024 Increasingly prevalent digital health technologies are employed for the prevention,\ndiagnosis, and treatment of mental health issues. There is minimal research on\nmental health and HIV prevention in online initiatives for the deaf community.\nEngagement involves individual users’ ideas and emotions, level of activity,\nand opinions about technical features of the software, including characteristics of\nusability and attractiveness ( O’Brien\n& Toms, 2013 O’Brien &\nToms (2013) The National Standards Authority of Ireland\n(NSAI), 2018 Recent studies have begun to explore innovative approve to address these gaps. For\ninstance, a 2023 study highlighted the effectiveness of digital health interventions\nin improving health literacy and self-efficacy among deaf individuals, demonstrating\na positive impact on their overall well-being ( Arias López et al., 2023 Ulutorti, 2024 Despite the proliferation of mobile health interventions in other populations, deaf\npersons remain underserved due to linguistic and cultural barriers. This study seeks\nto address that gap by evaluating a sign language-based mobile health program\ntailored to this community.  Clinical trial: SLCTR/2024/039, 25 November 2024 https://slctr.lk/trials/slctr-2024-039 Methods This quasi-experimental study follows a non-randomized controlled trial design, in\nwhich participants are assigned to either the intervention group, receiving the\nmobile health KaPi program, and the control group, receiving standard educational\nmaterials in the form of e-books. To minimize potential bias, participants will be\nblinded to their group allocation; they will not be informed whether they are\nreceiving the intervention or serving as part of the control group. Efforts will be\nmade to ensure that the delivery of content appears comparable across groups to\nprevent participants from discerning their allocation. Data collection took three\nmonths from the first intervention given. To ensure that the intervention carried\nout is in accordance with the standards, the researcher using the Standard Protocol\nItems as a guide. The study will adhere to the Standard Protocol Items:\nRecommendations for Interventional Trials (SPIRIT) guidelines ( Chan et al., 2016 Schulz et\nal., 2010 Eysenbach et\nal., 2011 Study area Yogyakarta district is a city in Indonesia that experiences a significant\nprevalence of HIV cases among the deaf population. The participants targeted for\nthis study will be individuals associated with the Gerkatin NGO in Yogyakarta,\nIndonesia. Study design This study will employ a quasi-experimental, non-randomized controlled trial\ndesign with single blinding applied to participants. The control group will\nreceive standard therapy, while the intervention group will receive the mobile\nhealth program. A parallel assignment approach will be used, reflecting the\nstructure of health services research. This study corresponds to a Phase\n2–3 trial, aiming to evaluate both the feasibility and preliminary\neffectiveness of the intervention. One or two (experimental group) receives the\nMobile health KaPi Program intervention under test and the other (comparison\ngroup or control) receives the standard e book/leaflet. Then follow up on the\ntwo or more groups to see if there are any differences in the results. The\nresults of the study and subsequent analysis are used to assess the\neffectiveness of the intervention mobile health application. Quasi-experimental\nare the most rigorous way to determine if there is a causal link between\ninterventions and outcomes ( Polit and Beck,\n2017 Figure 1 Creswell,\n2016 Figure 1. Summarized the study design. Inclusion and exclusion criteria participants Inclusion and exclusion criteria are clearly defined to ensure that the study\npopulation is representative of the target demographic. The study consisted of\ndeaf Indonesian nationals 1. Age 18 to 65 years. 2. All gender (Male, Female,\nand other) 3. Sexually active 4. Has access to a smart phone. This study will\nexclude those who are deaf and 1. pregnant, 2. already diagnosed with HIV/AIDS,\n3. illiterate 4. can’t speak Indonesian sign language. This careful\nselection process helps to control for confounding variables that could affect\nthe outcomes, such as pre-existing health conditions or communication barriers ( Creswell, 2016 Hart et al., 2023 Bodicoat et al., 2021 Patino & Ferreira, 2018 Recruitment To assess eligibility, the researcher will initiate contact with all regional\nleaders of Gerkatin NGOs within the target district, facilitated through\ncoordination with the head of Gerkatin in the Yogyakarta area. This process will\nbe accompanied by a formal data collection permit issued by the\nresearcher’s affiliated university. The letter will be forwarded to the\nregional Gerkatin head, who will then distribute it to local branch leaders to\nsupport coordinated recruitment. The recruitment strategy will apply multiple approaches commonly used to enhance\nparticipation in research, such as early notification to Gerkatin leadership,\noffering involvement opportunities, on-site visits to Gerkatin representatives,\noutreach via phone and digital communication, and allowing potential\nparticipants to consult with research staff regarding study participation.\nDedicated research personnel will supervise and document the recruitment\nprocess. Once permission is obtained, the Gerkatin head or a designated representative\nwill contact eligible individuals via telephone to assess inclusion criteria and\nconfirm their willingness to participate. Eligible participants will be provided\nwith detailed information and consent forms, including explanations in\nIndonesian Sign Language, and asked to sign written consent forms. To support participant retention throughout the three-month study period, a\ndedicated WhatsApp group (WAG) will be created for enrolled participants. This\ngroup will serve as a monitored communication platform for sending reminders,\nproviding support, and addressing questions related to the intervention and\nfollow-up activities. Periodic check-ins and app-based notifications will also\nbe used to promote sustained engagement. Participants will be reminded of their\nright to withdraw from the study at any time without penalty. All study\nprocedures and timelines will be clearly explained in the Respondent Information\nand Consent Forms. To address potential technological barriers, the study will ensure that all\nparticipants have access to a smartphone compatible with the KaPi mobile\napplication. For participants without a suitable device, the research team will\ncollaborate with local Gerkatin branches to provide access to shared devices or\ntemporary loaner phones during the study period. In addition, brief orientation\nsessions will be conducted in Indonesian Sign Language to improve digital\nliteracy and familiarize users with app features. If participants experience\nlimited or unstable internet connectivity, the mobile app is designed to support\noffline functionality, allowing them to access core content without continuous\ninternet access. These measures aim to minimize dropout due to technical\nchallenges and ensure inclusive participation. Sample size The sample size was determined using the software Based on an a priori power\nanalysis (G*Power 3.1) ( Faul et al.,\n2007 F Chow et al., 2002 To account for potential attrition, a 20% dropout rate was anticipated, as\nsupported by previous studies ( In et al.,\n2020 Suresh & Chandrashekara,\n2012 Outcome MHealth KaPi Program Increase in physical and psychological capability of HIV voluntary counseling and\ntesting. Tools for collecting information in research  Ebook Mental Health and HIV/AIDS The mental health and HIV/AIDS ebook contains general material related to mental\nhealth, psychological disorders, coping efficacy, and HIV/AIDS. The material in\npdf can be accessed at https://doi.org/10.5281/zenodo.14784036 Rosyad, 2025a , Creative\nCommons Zero “No rights reserved” data waiver  Mobile Health KaPi Program The KaPi mobile health program consists of 11 structured sessions, each lasting\napproximately 12 minutes. These sessions cover topics such as HIV prevention\nstrategies, coping mechanisms for psychological distress, and self-efficacy\nimprovement, all delivered through Indonesian sign language videos within the\napp. The program application can download at playstore with link https://play.google.com/store/apps/details?id=com.project.kapi https://doi.org/10.5281/zenodo.14784226 Rosyad, 2025b Creative\nCommons Zero “No rights reserved” data waiver Questionnaire to be utilized in this study Researchers use Kessler Psychological Distress Scale (K10) from Kessler et al., (2002) Andrew & Slade, 2001 Kessler et al., 2002 Chesney et al. (2006) Addis et al., (2013) Questionnaire will be adapting from Addis et al.\n(2013) Statistical analysis Demographic characteristics and predictor variables were summarized as\nfrequencies (n) and percentages (%) for categorical data, and means with\nstandard deviations for continuous data. Descriptive statistics, including\npercentage and frequency distributions, are presented using tables and charts.\nChi-square tests and independent t-tests (or ANOVA where appropriate) were used\nto compare socioeconomic and baseline characteristics between the two study\ngroups. For inferential analysis, the association between each independent variable and\nthe outcome variable was initially examined using binary logistic regression.\nThe primary outcomes—psychological distress (K10), HIV prevention\nknowledge and practices (KAP VCT), and communication self-efficacy\n(CSE)—were analyzed using Generalized Estimating Equations (GEE) to\naccount for repeated measures and within-subject correlations over time. The GEE\nmodel included main effects of group and time, as well as their interaction term\n(group × time), to evaluate differential changes between intervention and\ncontrol groups across three measurement points (baseline, post-intervention, and\n4-week follow-up). Adjusted odds ratios with 95% confidence intervals are\nreported. Missing data will be handled under the missing at random (MAR) assumption\ninherent in GEE, and sensitivity analyses will be conducted to assess the\nrobustness of findings. Results The trial protocol of this study was approved by the Health Research Ethics Committee\nof STIKes Bethesda Yakkum, Indonesia, with ethical approval No.\n036/KEPK.02.01/V/2023. Trial registration was obtained through the Sri Lanka\nClinical Trials Registry (SLCTR) under number SLCTR/2024/039. Approval for\nparticipation in the study was also secured from the governing bodies of the\nselected NGOs, including Gerkatin. The findings of the study will be disseminated at both the cluster and individual\nlevels. These will include results related to Psychological Distress, Coping\nSelf-Efficacy, Knowledge, Attitudes, and Practices regarding HIV Voluntary\nCounseling and Testing (VCT), participant retention, intervention effectiveness,\nestimated effect sizes and their confidence intervals, and all designated primary\noutcomes. To ensure accessibility and community impact, results will be communicated to the\ndeaf community through culturally appropriate channels, including the production of\nsummary videos in Indonesian Sign Language. These videos will explain key findings\nin accessible formats and will be distributed via social media platforms, Gerkatin\ncommunity groups, and through the KaPi mobile application. In addition, in-person or\nvirtual community feedback sessions will be organized in collaboration with local\nGerkatin chapters to promote dialogue, reflection, and community engagement around\nthe findings. Preliminary results are anticipated to be submitted for publication by the conclusion\nof the 2024/2025 academic semester, and the research will also be presented at both\nnational and international conferences or published in a Scopus-indexed journal. Conclusion This study aims to provide evidence on the feasibility and effectiveness of a mobile\nhealth intervention tailored for deaf individuals, potentially informing future\npublic health interventions and digital health strategies. Deaf person is risk population for health ethics and consent The trial protocol of this study was approved by head of ethics review committe\nDwi Nugroho Heri Saputro, S.Kep., Ns., M.Kep., Sp.Kep.MB., PhD.NS on 05 November\n2023, by Health Research Ethics Committee STIKES Bethesda Yakkum, Indonesia have\ngranted ethical approval No.036/KEPK.02.01/V/2023 and Trial registration: Sri\nLanka Clinical Trials Registry (SLCTR) with number SLCTR/2024/039 on 25 November\n2024, https://slctr.lk/trials/slctr-2024-039 All participants will be provided with detailed study information delivered in\nIndonesian Sign Language to ensure accessibility for deaf individuals. To\nconfirm their understanding, comprehension questions and interactive elements\nwill be used before obtaining informed consent. Informed consent will be\nobtained through a combination of video-recorded agreements using sign language\nand a signed written consent form as formal documentation. Participation is completely voluntary with no coercion. Participants have the\nright to withdraw at any time without penalty, and this will be clearly\ncommunicated during the consent process. Data collected via the mobile application will be securely stored on encrypted\nservers accessible only to authorized research staff. Participant anonymity will\nbe maintained by using unique codes, and no identifiable information will be\npublished. Procedures for protecting data privacy and for\nwithdrawal—including deletion of data upon participant request—are\nclearly detailed in the Respondent Information and Consent Forms. Acknowledgements None. Data availability statement No data associated with this article. Reporting guidelines Articles that report protocols for clinical trials adhere to the SPIRIT reporting\nguidelines https://doi.org/10.5281/zenodo.14762634 Rosyad et al., 2025 Creative\nCommons Zero “No rights reserved” data waiver References Addis Z Yalew A Shiferaw Y Knowledge, attitude and practice towards\nvoluntary counseling and testing among university students in North West\nEthiopia a cross sectional study. BMC Public Health. 2013 13 714 1 8 Reference\nSource 23914738 10.1186/1471-2458-13-714 PMC3750598 Alika HI Akanni DO Akanni OO Parenting styles and family characteristics as\ncorrelates of psychological distress among Nigerian\nadolescents. International Journal of Psychology and\nCounselling. 2016 8 9 102 108 10.5897/ijpc2016.0451 Andrew G Slade T Interpratating scores on the Kessler\npsychological distress scale (K10). Autralian and New Zealand Journal of Public\nHealth. 2001 25 06 449 497 10.1134/S1063785008100131 11824981 Ariapooran S Khezeli M Batool A Post-Traumatic Stress Disorder (PTSD) and\nDepression in Iranian Adolescents with and Without Hearing Loss (HL) in\nPrevious and During the Outbreak of the COVID-19. Research Square. 2021 1 10 10.21203/rs.3.rs-252257/v1 Arias López M d P Ong BA Borrat Frigola X Digital literacy as a new determinant of health:\nA scoping review. PLOS Digital Health. 2023 2 10 e0000279 10.1371/journal.pdig.0000279 37824584 PMC10569540 Bahareh T Heidary A Assessment of Oral Hygiene and Oral Health\nStatus of 4-12 Year Old Children with. Journal of Mashhad Dental School. 2015 40 1 59 72 Bodicoat DH Routen AC Willis A Promoting inclusion in clinical trials—a\nrapid review of the literature and recommendations for\naction. Trials. 2021 22 1 880 10.1186/s13063-021-05849-7 34863265 PMC8643184 Boisvert I Rivera S. C. Smith-Merry J. A qualitative reflexive thematic analysis of innovation and\nregulation in hearing health care. BMC Medicine 2021 22 1 10.1186/s12916-024-03627-1 PMC11438185 39334196 Bosdriesz JR Stam M Smits C Psychosocial health of cochlear implant users\ncompared to that of adults with and without hearing aids: Results of a\nnationwide cohort study. Clinical Otolaryngology. 2017 43 3 828 834 10.1111/coa.13055 29281765 Chan A Tetzlaff JM Altman DG 2013 Statement: Defining Standard Protocol Items\nfor Clinical Trials. Annals of Internal Medicine. 2016 158 3 200 207 10.7326/0003-4819-158-3-201302050-00583.Requests 23295957 PMC5114123 Chesney MA Neilands TB Chambers DB A validity and reliability study of the coping\nself-efficacy scale Margaret. British Journal of Health Psychology. 2006 11 3 421 437 10.1348/135910705X53155 16870053 PMC1602207 Chow S Shao J Wang H Sample size calculations in clinical research\nsecond edition. The Journal of the American Society of\nAnesthesiologist. 2002 97 1028 1029 10.1097/00000542-200210000-00050 Creswell J Research design Pendekatan metode kuantatif,\nkualitatif, dan campuran. 1st ed. Pustaka\nPelajar 2016 Doyle KE Sionean C Paz-Bailey G High prevalence of disability and HIV risk among\nlow socioeconomic status urban adults, 17 U.S. cities. Physiology & Behavior. 2021 13 1 1 11 10.1016/j.dhjo.2019.100834.High PMC8103769 31427202 Drigas A Kouremenos D Vrettaros J The diagnosis of the educational needs of the\nhearing impaired. International Journal of Social and Humanistic\nComputing. 2009 1 2 138 10.1504/ijshc.2009.031003 El-Soud M Hassan A A proposed web based framework e-learning and\ndictionary system for deaf Arab students. International Journal of Electrical and Comptuer\nSciences. 2009 10 01 56 68 Reference\nSource Eysenbach G Stoner S Drozd F ConSORT-eHealth: Improving and standardizing\nevaluation reports of web-based and mobile health\ninterventions. Journal of Medical Internet Research. 2011 13 4 e126 10.2196/jmir.1923 22209829 PMC3278112 Faul F Erdfelder E Lang A-G G*Power 3: A flexible statistical power analysis\nprogram for the social, behavioral, and biomedical sciences. Behavior Research Methods. 2007 39 2 175 191 10.3758/BF03193146 17695343 Fergusson DM Woodward LJ Mental health, educational, and social role\noutcomes of adolescents with depression. Archives of General Psychiatry. 2002 59 3 225 231 10.1001/archpsyc.59.3.225 11879160 Folkins A Sadler GR Ko C Improving the Deaf community’s access to\nprostate and testicular cancer information: A survey study. BMC Public Health. 2005 5 1 9 10.1186/1471-2458-5-63 15938751 PMC1180455 Gotowiec S Larsson J Incerti P Understanding patient empowerment along the\nhearing health journey. International Journal of Audiology. 2022 61 2 148 158 10.1080/14992027.2021.1915509 34032531 Harmer L Health care delivery and deaf people: practice,\nproblems, and recommendations for change. The Journal of Deaf Studies and Deaf\nEducation. 1999 4 2 73 110 10.1093/deafed/4.2.73 15579880 Hart CM Shepherd KR Royal W The Atlanta VA Health Care System: Morehouse\nSchool of Medicine Core Recruiting Site—A Strategy to Increase\nDiversity in the VA Scientific Workforce. Health Equity. 2023 7 1 333 337 10.1089/heq.2023.0001 37284533 PMC10240318 In J Kang H Kim JH Tips for troublesome sample-size calculation. K\norean. Journal of Anesthesiology. 2020 73 2 114 120 10.4097/kja.19497 32229812 PMC7113158 Indiana ML Sagone E Fichera SLO Are coping strategies with well-being in deaf\nand blind parents related? European Journal of Investigation in Health, Psychology\nand Education. 2021 11 4 1422 1439 10.3390/ejihpe11040102 34842673 PMC8628753 Jambor E Elliott M Self-esteem and coping strategies among deaf\nstudents. The Journal of Deaf Studies and Deaf\nEducation. 2005 10 1 63 81 10.1093/deafed/eni004 15585749 Joseph AM Signs of Health and Mercy Towards Deaf People\nWho are Sick and Suffering. XXIV International Conference, Ephphata! The Deaf\nPerson in the Life of Church. 2009 Reference Source Kelly J McKenzie J Teacher Education: An analysis of the availability of\ntaecher education addressing the educational needs of leaners with\nsevere to profound sensory or intellectual impairents. Disability Studies Division, Department of Health and\nRehabilitation Sciences, University of Cape\nTown 2018 Kessler G Andrews G Colpe LJ Short screening scales to monitor population\nprevalences and trends in non-specific psychological\ndistress. Psychological Medicine. 2002 32 959 976 10.1017/s0033291702006074 12214795 Mehboob Khan S Rafi SMT Ahmed N Association of hearing loss with depression,\nanxiety and stress in patients suffering from chronic suppurative otitis\nmedia. Pakistan Journal of Medical Sciences. 2019 35 2 510 514 10.12669/pjms.35.2.152 31086542 PMC6500829 Munoz-Baell IM Ruiz MT Empowering the deaf. Let the deaf be\ndeaf. Journal of Epidemiology & Community\nHealth. 2000 54 1 40 44 10.1136/jech.54.1.40 10692961 PMC1731537 National Health Service Mental health and\ndeafness towards equity and acces. Department of Health, National Institute for Mental\nHealth in England. National Institute for Mental Health in\nEngland 2005 Reference Source National Insitute on Aging (NIA) Hearing Loss: A Common Problem for Older\nAdults. National Institutes of Health\n(NIH) 2018 O’Brien HL Toms EG Examining the generalizability of the User\nEngagement Scale (UES) in exploratory search. Information Processing & Management. 2013 49 5 1092 1107 10.1016/j.ipm.2012.08.005 Olakunde BO Pharr JR HIV-related risk behaviors and HIV testing among\npeople with sensory disabilities in the United States. International Journal of STD AIDS. 2020 31 14 1398 1406 10.1177/0956462419896705 32469624 Patino CM Ferreira JC Inclusion and exclusion criteria in research\nstudies: definitions and why they matter. Jornal brasileiro de pneumologia: publicacao oficial da\nSociedade Brasileira de Pneumologia e Tisilogia. 2018 44 2 84 10.1590/s1806-37562018000000088 29791550 PMC6044655 Polit DF Beck CT Nursing Research: Generating and Assessing Evidence for\nNursing Practice (Edisi ke-10). Philadelphia Wolters Kluwer\nHealth 2017 Rosyad YS Ebook-Mental Health and HIV/AIDS (Kesehatan Jiwa\ndan HIV/AIDS). Zenodo. 2025a 10.5281/zenodo.14784036 Rosyad YS Table Mobile Health Application KaPi\nProgram. Zenodo. 2025b 10.5281/zenodo.14784226 Rosyad YS Aljaberi MA Natarajan SB SPIRIT 2013 Checklist: The study protocol for a\nquasi-experimental study on the effectiveness of a mobile health program in\nenhancing the physical and psychological capabilities of HIV voluntary\ncounseling and testing among the deaf community. Zenodo. 2025 10.5281/zenodo.14762634 Schenk KD Tun W Sheehy M “Even the fowl has feelings”:\naccess to HIV information and services among persons with disabilities in\nGhana, Uganda, and Zambia. Disability and Rehabilitation. 2020 42 3 335 348 10.1080/09638288.2018.1498138 30282493 Schulz KF Altman DG Moher D CONSORT 2010 statement: Updated guidelines for\nreporting parallel group randomised trials. PLoS Med. 2010 7 3 e1000251 e1000257 10.1371/journal.pmed.1000251 20352064 PMC2844794 Strong CJ Shaver JP Modifying attitudes toward persons with hearing\nimpairments. A comprehensive review of the research. American Annals of the Deaf. 1991 136 3 252 260 10.1353/aad.2012.0431 1950947 Suresh K Chandrashekara S Sample size estimation and power analysis for\nclinical research studies. Journal of Human Reproductive Sciences. 2012 5 1 7 13 10.4103/0974-1208.97779 22870008 PMC3409926 The National Standards Authority of Ireland (NSAI) Ergonomics of human-system interaction - Part 11: Usability:\nDefinitions and Concepts, Pub. L. No. ISO 9241-11:2018. 2018 Reference Source Theunissen SCPM Rieffe C Netten AP Self-esteem in hearing-impaired children: The\ninfluence of communication, education, and audiological\ncharacteristics. PLoS One. 2014 9 4 e94521 10.1371/journal.pone.0094521 24722329 PMC3983202 Ulutorti AG Cultural Sensitivity in Psychotherapy for Deaf\nIndividuals in Nigeria. International Journal for Psychotherapy in\nAfrica. 2024 9 1 143 153 United Nations Disability and HIV/AIDS. Department of Economic and Social Affairs\nDisability 2016 Reference Source World Health Organization (WHO) Deafness and\nhearing loss. 2021a Reference Source World Health Organization (WHO) WHO Director-General’s closing remarks at 148th\nsession of the Executive Board. World Health Organization 2021b Reference Source 10.5256/f1000research.183248.r417677 Reviewer response for version 3 Queiroz Artur Acelino Francisco Luz Nunes 1 Referee https://orcid.org/0000-0002-6350-1908  1  Competing interests: 27 9 2025 Copyright: © 2025 Queiroz AAFLN 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access peer review report distributed under the terms\nof the Creative Commons Attribution Licence, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is\nproperly cited. Version 3 recommendation approve-with-reservations A Quasi-Experimental Study Protocol on the Impact of a Mobile Health Program for HIV\nCounseling and Testing in the Deaf Community Background The background section of the paper is robust and well supported by the network of\nliterature that is relevant. However I believe it could benefit from a more\nstreamlined and focus approach. The authors use many of the space talking about\ncauses and consequences of hearing loss, and the implications of the COVID pandemic,\nwithout a clear connection to the actual intervention they are testing. Methods Some sections of the methods are written in future tense and others in past tense\nwhat makes it confusing to follow. Whatsapp group could cause a contamination effect? The outcome is unclear: Increase in physical and psychological capability of HIV\nvoluntary counseling and testing. I believe that a theoretical and operational explanation of it would make the study\nclearer and stronger. The questionnaires described do not reflect the outcomes, specially the physical\naspects. What is the relationship between mental health, physical capacity and HIV\nprevention? Is the study design appropriate for the research question? Partly Is the rationale for, and objectives of, the study clearly described? Partly Are sufficient details of the methods provided to allow replication by others? Partly Are the datasets clearly presented in a useable and accessible format? Not applicable Reviewer Expertise: HIV prevention and digital health. I confirm that I have read this submission and believe that I have an appropriate\nlevel of expertise to confirm that it is of an acceptable scientific standard,\nhowever I have significant reservations, as outlined above. 10.5256/f1000research.183248.r389795 Reviewer response for version 3 Akkakanjanasupar Pakorn 1 Referee https://orcid.org/0000-0003-0484-9012  1  Competing interests: 16 6 2025 Copyright: © 2025 Akkakanjanasupar\nP 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access peer review report distributed under the terms\nof the Creative Commons Attribution Licence, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is\nproperly cited. Version 3 recommendation approve  Assessment of the Revisions It's clear the author has truly taken to the feedback and put significant effort\ninto refining this manuscript. The proposed revisions effectively enhance both the clarity and scientific rigor of\nthe protocol. From sharpening the title and abstract to providing crucial details in\nthe methodology and ethical considerations, every change seems well-considered.\nTheir commitment to a thorough language review is also a vital step that will ensure\nthe document is polished and professional. Overall, these are excellent adjustments. They promise to transform this\nprotocol into a much stronger and more impactful contribution to the field. Is the study design appropriate for the research question? Yes Is the rationale for, and objectives of, the study clearly described? Partly Are sufficient details of the methods provided to allow replication by others? Partly Are the datasets clearly presented in a useable and accessible format? Not applicable Reviewer Expertise: My review, based on my public health and digital health research background, focused\non the manuscript's rationale, design, ethics (for marginalized groups), and\nintervention accessibility/cultural sensitivity. The authors' revisions have\nsuccessfully improved the study's methodological clarity, cultural competence, and\npractical implementation for digital health equity. I confirm that I have read this submission and believe that I have an appropriate\nlevel of expertise to confirm that it is of an acceptable scientific standard. 10.5256/f1000research.179725.r380081 Reviewer response for version 2 Akkakanjanasupar Pakorn 1 Referee https://orcid.org/0000-0003-0484-9012  1  Competing interests: 27 5 2025 Copyright: © 2025 Akkakanjanasupar\nP 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access peer review report distributed under the terms\nof the Creative Commons Attribution Licence, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is\nproperly cited. Version 2 recommendation approve-with-reservations  Summary: Thank you for the opportunity to review this important and much-needed study. The\nproposed research addresses a significant gap in health equity by focusing on the\ndeaf community—an underserved population often excluded from conventional\nhealth interventions. The integration of a mobile health (mHealth) platform using\nsign language-based video education is both innovative and contextually appropriate.\nHowever, to strengthen the scientific rigor, clarity, and ethical robustness of this\nstudy protocol, several areas require refinement. The comments provided below are intended to support the authors in improving the\ntransparency, replicability, and overall quality of the manuscript in line with\nacademic standards and research ethics.   General Assessment​​​​​​ &\nSuggestions  1. Rationale and Objectives (Partly) The manuscript presents a well-intentioned public health intervention. The\nintroduction offers useful background, including relevant epidemiological data and\nchallenges faced by the deaf population. However, the rationale is not explicitly or\nsuccinctly stated. The research problem and the gap in existing literature,\nparticularly regarding the limited evidence on mobile-based HIV prevention in the\ndeaf community, needed clearer articulation. I recommend adding a concise statement in the introduction that directly links the\nidentified public health challenge to the need for this specific study. A sentence\nsuch as, “Despite the proliferation of mobile health interventions in\nother populations, deaf individuals remain underserved due to linguistic and\ncultural barriers. This study seeks to address that gap by evaluating a sign\nlanguage-based mobile health program tailored to this\ncommunity,”  2. Study Design and Intervention (Yes) A quasi-experimental design is appropriate given the practical constraints in\nrandomizing this specific population. The use of a single-blinded structure also\naligns with the implementation model. However, the explanation of blinding, control\nconditions, and assignment procedures is underdeveloped. It would strengthen the protocol to include a detailed explanation of the blinding\nprocess. For example, if outcome assessors are blinded to group allocation, this\nshould be explicitly stated, along with procedures to maintain that blinding.\nAdditionally, since allocation is not randomized, the authors should explain how\npotential biases will be mitigated—for instance, by using matched groups or\nadjusting for baseline differences in the analysis.  3. Methodology and Replicability (Partly) The manuscript includes appropriate tools (K10, CSE, KAP VCT) and a valid analytical\napproach (GEE). However, the intervention description and sampling calculations are\nvague. I recommend that the authors include a session-by-session overview of the KaPi\nprogram, either in the main text or as an appendix. Each session’s\nobjectives, thematic content, and format (e.g., video, quiz) should be described.\nRegarding sample size, while G*Power is correctly cited, the effect size and\nstatistical assumptions used in the calculation (e.g., α = 0.05, power =\n0.95) should be stated clearly. This transparency is essential for methodological\nintegrity.  4. Statistical Analysis (Partly) The use of Generalized Estimation Equations (GEE) is methodologically sound for\nanalyzing repeated measures. Nonetheless, the statistical section is overly verbose,\nwith some inconsistencies (e.g., reference to “four groups” instead of\ntwo). It should specify the primary and secondary outcomes, the time points of\nmeasurement, and the interaction terms to be tested. Also, clarify how missing data\nwill be handled and ensure that references to group structure are consistent with\nthe described design. I encourage the authors to revise this section for\nclarity and conciseness.  5. Ethical Considerations and Accessibility (Needs Strengthening) The manuscript notes that consent will be obtained via sign language video\nagreements, which is commendable. However, further detail is needed on how informed\nconsent will be verified and how data privacy is protected, especially given the use\nof a mobile application. It is better if the authors could describe how participant understanding of the\nstudy will be verified (e.g., through comprehension questions or interactive\nelements). It is also important to discuss how data from the mobile app will be\nstored and protected, particularly regarding participant anonymity and consent\nwithdrawal. This section should also affirm that no coercion will be used and that\nparticipants may exit the study at any point without penalty.  6. Language and Presentation (Requires Revision) The manuscript is significantly hindered by grammatical errors, awkward syntax, and\ninconsistent terminology (e.g., “deaf person,” “hearing loss\nindividuals”). This affects the clarity and professionalism of the\nprotocol. A comprehensive language review is strongly advised. This should address syntax,\ngrammar, and word choice. Terms referring to the study population should be\nstandardized throughout the manuscript; for example, consistently using “deaf\nindividuals” instead of alternating with “deaf persons” or\n“hearing loss individuals.” This will enhance the manuscript’s\ncoherence and respect for community-preferred terminology.  7. Additional Comments  7.1 Theoretical Framework: Identify a theoretical model guiding\nthe intervention (e.g., Social Cognitive Theory), to support the focus on\nbehavior change and self-efficacy. I encourage the authors to specify a behavioral or educational theory (e.g., Health\nBelief Model, Social Cognitive Theory) that informs the intervention’s focus\non self-efficacy and behavioral change. This theoretical anchoring would enhance the\nscientific robustness of the intervention design.  7.2 Recruitment and Retention: Expand on how participants will be\nretained over three months. Describe follow-up strategies or engagement features\nwithin the app. The authors should expand on how they will ensure sustained participation over the\nthree-month study period. This might include periodic check-ins, app-based\nreminders, or participant incentives.  7.3Technological Barriers: Address potential challenges in device access,\ndigital literacy, and internet connectivity. Propose solutions or\nalternatives. A brief discussion of how the study will address potential technological\nbarriers—such as smartphone access, digital literacy, and internet\nconnectivity—would strengthen the feasibility of the protocol.  7.4 Dissemination Plan: Indicate how results will be communicated to the\ndeaf community (e.g., videos in sign language, community briefings). The manuscript should include a clear plan for sharing study findings with the deaf\ncommunity, such as through sign language videos or community feedback sessions.  Conclusion This is a socially impactful and methodologically promising study addressing a\npopulation often excluded from digital health innovations. The intervention is both\nculturally sensitive and contextually relevant. However, to meet indexing standards,\nthe manuscript requires revisions in methodological clarity, ethical detail, and\nlanguage quality.  Final Recommendation With these improvements, the protocol will make a meaningful contribution to health\nequity, HIV prevention, and inclusive digital health research. I commend the authors\nfor their commitment to addressing disparities in deaf health care and look forward\nto seeing this work developed further. Is the study design appropriate for the research question? Yes Is the rationale for, and objectives of, the study clearly described? Partly Are sufficient details of the methods provided to allow replication by others? Partly Are the datasets clearly presented in a useable and accessible format? Not applicable Reviewer Expertise: As a reviewer with a background in public health research, digital health\nintervention design, and applied research methodology, my evaluation of this\nmanuscript focuses on several key domains: the clarity and relevance of the study\nrationale, the appropriateness and transparency of the study design, the ethical\nconsiderations in working with a marginalized population, and the accessibility and\ncultural sensitivity of the proposed mobile health intervention.In particular, I\nhave assessed:The study’s rationale and objectives, with attention to the\npublic health implications and population-specific context;The quasi-experimental\ndesign, including its alignment with the research aims and appropriateness for the\nstudy population;The description of the intervention and its accessibility through\nsign language and mobile platforms;The ethical framework, particularly related to\ninformed consent procedures for deaf participants and data privacy concerns;The\ncommunity engagement and dissemination plans, given the importance of participatory\napproaches in underserved populations.While I have reviewed the statistical methods\nand instruments used for data collection, I defer detailed evaluation of advanced\nstatistical modeling and HIV-specific clinical outcomes to reviewers with\nspecialized expertise in those areas. My feedback is intended to support the authors\nin enhancing the study’s methodological clarity, cultural competence, and\npractical implementation for digital health equity. I confirm that I have read this submission and believe that I have an appropriate\nlevel of expertise to confirm that it is of an acceptable scientific standard,\nhowever I have significant reservations, as outlined above. 10.5256/f1000research.177544.r369983 Reviewer response for version 1 Isaac Isiko 1 2 Referee https://orcid.org/0000-0002-3612-5054  1  2  Competing interests: 14 3 2025 Copyright: © 2025 Isaac I 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access peer review report distributed under the terms\nof the Creative Commons Attribution Licence, which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is\nproperly cited. Version 1 recommendation approve-with-reservations  Dear Editor, Thank you for the opportunity to review this manuscript on the effectiveness of a\nmobile health program for HIV counseling and testing among the deaf community. Your\nstudy addresses a crucial public health issue with significant potential impact. While the manuscript is well-structured, certain areas need refinement, including\nclarity in methodology, statistical analysis, and language consistency. I have\nprovided detailed feedback and suggestions to enhance the rigour and readability of\nyour work. I commend your efforts and look forward to your revised submission.  General Comments The manuscript presents an important study on the effectiveness of a mobile\nhealth program aimed at improving the physical and psychological capabilities of HIV\nvoluntary counselling and testing (VCT) among the deaf community. While the topic is\nhighly relevant, the manuscript requires several refinements to enhance clarity,\nmethodology, statistical rigour, and language coherence. The following detailed\ncomments guide areas that need improvement and offer examples of how revisions can\nbe implemented.  Title and Abstract: The title of the manuscript should be refined to be more precise and\ninformative. For instance, instead of 'The study protocol for a\nquasi-experimental study on the effectiveness of a mobile health program in\nenhancing the physical and psychological capabilities of HIV voluntary\ncounseling and testing among the deaf community,' 'A Quasi-Experimental Study Protocol on the Impact of a\nMobile Health Program for HIV Counseling and Testing in the Deaf\nCommunity.' The abstract lacks specificity in the methodology section. Instead of stating, 'Quasi-experimental non-randomized controlled trial with single blinded\nparticipants,' 'This study\nemploys a quasi-experimental design with a non-randomized controlled trial,\ninvolving single-blinded participants and a parallel group assignment.'  Introduction: The introduction provides a strong background on the health challenges faced by the\ndeaf community. However, it does not explicitly state the significance of the study.\nIt would be beneficial to clearly articulate the research gap by including a\nstatement like: 'Despite the increasing use of mobile health interventions\nin marginalized communities, there is limited evidence on their effectiveness in\nimproving HIV-related health outcomes among deaf individuals. This study aims to\nbridge this gap by assessing a mobile health educational program specifically\ndesigned for this population.' Additionally, some references cited in the introduction are outdated. Replacing them\nwith more recent studies on digital health interventions will enhance the\ncredibility of the literature review.  Methods: The study design should be described with greater detail. Instead of simply\nstating, 'Quasi-experimental non-randomized controlled trial with single\nblinded participants,' 'This quasi-experimental study follows a non-randomized controlled trial\ndesign, in which participants are assigned to either the intervention group,\nreceiving the mobile health KaPi program, or the control group, receiving\nstandard educational materials in the form of e-books. Participants will be\nblinded to the intervention allocation to minimize bias.' The sample size calculation lacks clarity and should be expanded. The authors\nmention the use of G Power software, but they do not provide the effect size\nused in the calculation. A more detailed explanation could be: 'Using GPower\n3.1, the sample size was determined based on an expected medium effect size of\n0.30, a power of 0.95, and an alpha level of 0.05. These parameters resulted in\na required sample size of 80 participants, with 40 in each group.' The intervention details are somewhat vague. Instead of stating, 'The KaPi\nmobile health program consists of 11 sessions,' 'The KaPi mobile health program consists of 11\nstructured sessions, each lasting approximately 12 minutes. These sessions cover\ntopics such as HIV prevention strategies, coping mechanisms for psychological\ndistress, and self-efficacy improvement, all delivered through Indonesian sign\nlanguage videos within the app.'  Ethical Considerations: While ethical approval is mentioned, the manuscript should elaborate on the\ninformed consent process. Instead of stating, 'Participants provided\nconsent,' 'All participants\nwill be provided with a detailed study information sheet in Indonesian sign\nlanguage, and informed consent will be obtained through video-recorded\nagreements to ensure accessibility for deaf individuals.'  Results Section (Planned Analysis): The statistical analysis section should provide more depth on how changes\nover time will be measured. Instead of simply stating, 'The data will be\nanalyzed using generalized estimation equations (GEE) with a confidence interval\nof 95%,' 'The primary\noutcomes will be analyzed using generalized estimation equations (GEE) to\naccount for within-group correlations over time. The model will include an\ninteraction term between time and intervention to assess changes in\npsychological distress, HIV prevention practices, and self-efficacy levels.\nAdjusted odds ratios with 95% confidence intervals will be reported.'  Discussion (Expected Implications): The discussion should emphasize the study’s contributions to HIV prevention\nstrategies for the deaf community. Instead of a general statement like, 'This study will help improve health outcomes among the deaf\npopulation,' 'By\ndemonstrating the effectiveness of a culturally tailored mobile health\nintervention, this study has the potential to inform future digital health\npolicies aimed at increasing HIV awareness and mental health support among deaf\nindividuals.' Potential limitations should also be discussed more explicitly. Instead of stating, 'This study may face some limitations,' 'One limitation of this study is the reliance on self-reported\nmeasures, which may introduce reporting bias. Future studies should consider\nincorporating objective measures, such as biomarker data, to validate\nself-reported behavioral changes.'  Language and Formatting: The manuscript contains numerous grammatical errors and unclear sentences, which\naffect readability. For example, the sentence 'Deaf person is risk\npopulation for health' 'Deaf individuals\nare considered a high-risk population for health disparities.' Additionally, consistency in terminology is essential. Terms like 'deaf\npersons' 'hearing loss individuals' 'deaf individuals'  Conclusion: The conclusion should emphasize the expected contributions of the study rather than\npresenting definitive results. Instead of 'The intervention group is\nexpected to show significant improvements in psychological distress and HIV\nprevention,' 'This study\naims to provide evidence on the feasibility and effectiveness of a mobile health\nintervention tailored for deaf individuals, potentially informing future public\nhealth interventions and digital health strategies.'  Final Recommendation The manuscript presents a valuable study but requires significant revisions for\nclarity, methodological rigor, and readability. Addressing the points outlined above\nwill enhance the quality and impact of the research, ensuring that it effectively\ncommunicates its contributions to the field. Is the study design appropriate for the research question? Yes Is the rationale for, and objectives of, the study clearly described? Partly Are sufficient details of the methods provided to allow replication by others? Yes Are the datasets clearly presented in a useable and accessible format? Not applicable Reviewer Expertise: Public health, disease modelling, maternal and child health, HIV, Malaria, Neglected\ntropical diseases, Machine learning, communicable diseases, Global Health, mental\nhealth I confirm that I have read this submission and believe that I have an appropriate\nlevel of expertise to confirm that it is of an acceptable scientific standard,\nhowever I have significant reservations, as outlined above. Rosyad Yafi Sabila Nursing, Lincoln University College, Petaling Jaya, Selangor,\nMalaysia  Competing interests: 20 3 2025 1 I have revised the title of the article according to the reviewer's suggestion,\nwhich was originally titled The study protocol for a quasi-experimental study on\nthe effectiveness of a mobile health program in enhancing the physical and\npsychological capabilities of HIV voluntary counseling and testing among the\ndeaf community to A Quasi-Experimental Study Protocol on the Impact of a Mobile\nHealth Program for HIV Counseling and Testing in the Deaf Community. 2 abstract has little revision in methodology 3 statement at introduce \"Despite the increasing use of mobile health\ninterventions in marginalized communities, there is limited evidence on their\neffectiveness in improving HIV-related health outcomes among deaf individuals.\nThis study aims to bridge this gap by assessing a mobile health educational\nprogram specifically designed for this population. By focusing on this\nunderserved population, the research seeks to contribute valuable insights into\nthe psychological distress, HIV prevention practice, and coping self-efficacy of\ndeaf individuals, ultimately fostering a more inclusive approach to health\ncare. 4 correction Grammarly. ",
  "metadata": {
    "Title of this paper": "Reviewer response for version 1",
    "Journal it was published in:": "F1000Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487785/"
  }
}