{
  "title": "Paper_62",
  "abstract": "pmc Ann Geriatr Med Res Ann Geriatr Med Res 3894 agmr AGMR Annals of Geriatric Medicine and Research 2508-4798 2508-4909 The Korean Geriatrics Society PMC12489603 PMC12489603.1 12489603 12489603 41025275 10.4235/agmr.25.0028 agmr-25-0028 1 Original Article Optimal Cutoff Values of Site-Specific Phase Angle for Predicting Independence in Activities of Daily Living in Post-stroke Patients Optimal PhA Cutoffs in Post-stroke http://orcid.org/0000-0001-7545-4179 Yoshimura Yoshihiro  1 Wakabayashi Hidetaka  2 Nagano Fumihiko  1 Matsumoto Ayaka  1 Shimazu Sayuri  1 Shiraishi Ai  1 Kido Yoshifumi  1 Bise Takahiro  1 Hamada Takenori  1 Yoneda Kouki  1  1 Japan  2 Japan Corresponding Author: Yoshihiro Yoshimura, MD, PhD Center for Sarcopenia and Malnutrition Research, Kumamoto Rehabilitation Hospital, 760 Magate, Kikuyo-Town, Kikuchi-County, Kumamoto 869-1106, Japan E-mail: hanley.belfus@gmail.com 9 2025 29 7 2025 29 3 498175 403 413 8 2 2025 20 5 2025 26 7 2025 01 09 2025 03 10 2025 03 10 2025 © 2025 Korean Geriatrics Society 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0/ Background Phase angle (PhA) is a potential indicator of nutritional status and functional outcomes. However, optimal regional PhA cutoff values for predicting activities of daily living (ADL) post-stroke are unclear. We aimed to determine these cutoffs and assess whether PhA adds prognostic value to established clinical models. Methods In this retrospective cohort study, stroke patients undergoing inpatient rehabilitation had body composition and PhA measured via multi-frequency bioelectrical impedance analysis. The primary outcome was ADL independence at discharge (motor Functional Independence Measure >78). Receiver operating characteristic (ROC) curves identified optimal PhA cutoffs; logistic regression assessed their predictive value, adjusting for confounders. Incremental discriminative ability was evaluated using area under the ROC curve (AUC) comparisons with DeLong’s test. Results Among 1,080 patients (median age, 75.6 years; 54.1% men), optimal PhA cutoffs were: whole-body (women 3.90°, men 4.60°), non-paretic upper limb (4.45°, 4.90°), and non-paretic lower limb (4.00°, 4.80°). Higher PhA values above these cutoffs were independently associated with ADL independence (all p<0.05). Adding whole-body PhA to the baseline model improved AUC from 0.937 to 0.970 (ΔAUC=0.033; p=0.011); significant gains were observed for limb PhA. Conclusions Optimal site-specific PhA cutoffs predict ADL independence at discharge in post-stroke patients. PhA provides significant incremental prognostic value beyond established clinical models, supporting its use in tailoring rehabilitation strategies. Activities of daily living Convalescent rehabilitation Hemiplegia Phase angle Stroke pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Phase angle (PhA), a parameter obtained from bioelectrical impedance analysis (BIA), has attracted growing interest as a prognostic indicator of clinical outcomes across diverse patient populations. 1 5 3 4 5 6 7 9 6 10 However, evidence regarding the optimal cutoff values for segmental PhA in predicting functional outcomes in stroke patients with hemiparesis remains limited. 2 11 13 2 2 13 2 13 2 While paretic side PhA reflects localized muscle changes post-stroke, non-paretic side and whole-body PhA provide valuable insights into overall nutritional status and compensatory mechanisms. Non-paretic limb PhA may indicate increased reliance on the unaffected side for functional activities, potentially predicting rehabilitation outcomes. 2 14 1 13 Therefore, identifying optimal cutoff values for site-specific phase angle for whole-body and non-paralytic sides for predicting favorable outcomes in post-stroke patients would be essential for predicting recovery and facilitating treatment in this patient group. The aim of this study was to determine the optimal cutoff values for ADL independence for whole-body and site-specific phase angles, including the non-paralytic limb, in a cohort of post-stroke patients. MATERIALS AND METHODS Participants and Setting A retrospective cohort study was performed at a single institution with a 135-bed dedicated stroke rehabilitation unit. The study cohort comprised all stroke patients sequentially admitted and discharged over an 8-year period from 2016 to 2023. Exclusion criteria were impaired consciousness on admission, missing data, or lack of informed consent. For each study participant, monitoring and data acquisition were continued until hospital discharge. A comprehensive, multidisciplinary post-acute rehabilitation program was delivered by an interprofessional healthcare team for up to 3 hours per day throughout the patient's inpatient stay. The convalescent rehabilitation was personalized based on each individual's unique functional abilities and deficits, integrating a broad spectrum of therapeutic modalities. These encompassed physical therapy, occupational therapy, speech-language pathology, and audiology services, in conjunction with nutritional support, 15 16 17 18 Data Collection Upon admission to the convalescent rehabilitation wards, the following demographic and clinical characteristics were documented for each patient: age (in years), biological sex, type of stroke, time from stroke onset to admission (in days), and history of prior stroke. Baseline pre-stroke functional independence was assessed using the modified Rankin Scale (mRS), 19 20 21 22 17 23 24 25 Phase Angle Assessment PhA was assessed using the InBody S10, a multi-frequency BIA device designed for use in supine or seated positions. This portable analyzer enables accurate, non-invasive body composition and body water analysis in patients who are immobile or have amputated limbs. The InBody S10 utilizes direct segmental multi-frequency BIA technology, measuring impedance at six frequencies (1, 5, 50, 250, 500, and 1,000 kHz) across five body segments (right arm, left arm, trunk, right leg, and left leg). It calculates whole-body and segmental phase angles at 50 kHz, which serve as indicators of cellular health and membrane integrity. 26 27 27 φ = arctangent (Xc/R) × (180/π), where R represents the resistance and Xc represents the reactance of the right half of the body at 50 kHz. 28 For patients with bilateral motor impairment, the extremity with the lower BRS (i.e., greater weakness) was classified as the paretic side, and the contralateral extremity as the non-paretic side; if BRS scores were identical, the limb judged clinically more dysfunctional by the attending physiatrist in consensus with the responsible physical and occupational therapists—based on manual-muscle testing, dexterity tasks, and standing-and-gait assessment—was designated paretic. Outcomes The primary outcome measure was ADL independence at discharge, defined as the motor domain of the FIM (FIM-motor) score greater than 78. The FIM-motor is a widely used, validated tool for assessing an individual's functional status in terms of motor ADL. 22 29 32 To ensure objectivity and minimize potential bias, the FIM was administered by rehabilitation professionals, including physical therapists, occupational therapists, and nurses, who were not involved in the study's data collection, evaluation, analysis, or interpretation of results. 33 Sample Size Calculation To determine the required sample size for comparing the proportion of patients achieving ADL independence (defined as FIM-motor >78) at discharge between two groups based on the median PhA-whole body score at admission, we performed a power analysis for a two-proportion test. Previous studies have reported that approximately 40% of patients achieve ADL independence at discharge, while 60% remain ADL dependent. 34 Statistical Analysis For parametric data, means±standard deviations were presented, whereas medians with interquartile ranges (IQR) were used for non-parametric data. Categorical variables were expressed as counts and percentages (%). Comparisons between the two groups were conducted using the appropriate statistical tests based on the nature of the variables. The t-test was employed for parametric data, while the Mann–Whitney U test was used for non-parametric data. Categorical variables were compared using the chi-square test. Logistic regression analysis was performed to investigate whether site-specific PhA were independently associated with the ADL independence at discharge after adjusting for confounding factors. 34 27 35 39 Receiver operating characteristic (ROC) curves were constructed to determine the optimal cutoff values of each site-specific PhA for predicting ADL independence at discharge, defined as a FIM-motor score of >78. The area under the ROC curve (AUC) was calculated to assess the discriminative ability of each PhA parameter. Youden's index, which maximizes the sum of sensitivity and specificity, was used to identify the optimal cutoff values for each PhA parameter in men and women separately. To validate the optimal cutoff values for site-specific PhA derived from the ROC curves, patients were categorized into high and low PhA groups using these cutoffs. Logistic regression analysis was then performed to investigate whether high site-specific PhA were independently associated with ADL independence at discharge. All covariates included in the multivariable models were selected a priori based on clinical relevance and prior studies, without the use of automated selection procedures. The models were adjusted for the same set of confounding factors as in the previous logistic regression analyses, including age, sex, days from onset to admission, stroke type, FIM-motor, FIM-cognition, pre-stroke mRS, CCI, BRS of the lower limb, and number of medications. This approach allowed for a robust assessment of the predictive value of site-specific PhA, including whole body, non-paretic upper and lower limbs, in determining discharge ADL independence, while controlling for potential confounders. Multicollinearity was assessed by calculating the VIF for each covariate. A VIF value of <10 was considered acceptable, and the VIF range for each model was reported in the Results section. In addition, Spearman correlation coefficients were calculated among the five site-specific PhA variables to evaluate potential redundancy. The overall goodness-of-fit of the logistic regression models was evaluated using the Hosmer–Lemeshow test. To quantify the incremental value of PhA we compared a clinical-baseline model (covariates only) with two sets of PhA-extended models: (1) five models that added each continuous site-specific PhA (whole-body, paretic and non-paretic upper limb, paretic and non-paretic lower limb) and (2) three models that added the ROC-derived high-PhA indicators (whole-body, non-paretic upper limb, non-paretic lower limb). For every model the AUC was computed and the change versus baseline (ΔAUC) was tested with DeLong’s method Statistical significance was set at a p-value threshold of less than 0.05. The entirety of the statistical analyses were conducted using SPSS Statistics software version 21 (IBM, Armonk, NY, USA). Ethics The study protocol was reviewed and approved by the Institutional Review Board of the Kumamoto Rehabilitation Hospital (Approval ID: 191-220315). Due to the retrospective nature of the study, obtaining written informed consent from each participant was not feasible. As an alternative, an opt-out procedure was implemented, enabling participants to withdraw from the study at any time. The study was carried out in compliance with the ethical principles outlined in the 1964 Declaration of Helsinki and its subsequent amendments, as well as the Ethical Guidelines for Medical and Health Research Involving Human Subjects (Provisional Translation as of March 2015). RESULTS During the study period, 1,137 stroke patients were admitted to the rehabilitation wards. Of these, 46 patients were excluded due to incomplete data, and an additional 11 patients were excluded because of altered consciousness. The remaining 1,080 patients were included in the final analysis ( Fig. 1 Table 1 Table 2 Supplementary Table S1 To further assess the interrelatedness of PhA variables, Spearman correlation coefficients were computed among the five site-specific PhA measurements. As presented in Supplementary Table S2 ROC curves are shown in Figs. 2 3 Table 3 Table 3 To further evaluate the incremental prognostic value of PhA beyond established clinical predictors, we compared the AUC of a baseline logistic regression model with that of models incorporating each high-PhA variable. All models were adjusted using the same set of covariates as in Table 3 Table 4 DISCUSSION This study aimed to determine the optimal cutoff values of site-specific PhA for discharge ADL independence in post-stroke patients using a retrospective cohort study design. The key findings were as follows: (1) the optimal cutoff values of PhA for discharge ADL independence were 3.90 for women and 4.60 for men in whole-body PhA, 4.45° for women and 4.90° for men in non-paretic upper limb PhA, and 4.00° for women and 4.80° for men in non-paretic lower limb PhA; (2) the diagnostic accuracy of non-paralyzed side PhA for discharge ADL independence was higher for upper limb in women and lower limb in men; and (3) the addition of site-specific PhA to a clinically adjusted multivariable logistic regression model significantly improved the model’s discriminative performance, with whole-body PhA yielding the greatest increase in AUC. The optimal cutoff values of site-specific PhA for discharge ADL independence were reported. This novel finding highlights the significance and utility of regional PhA measurements in predicting functional outcomes in post-stroke patients who exhibited hemiplegia. The whole-body PhA reflects overall cell membrane integrity and nutritional status, while non-paretic limb PhA provides insights into localized muscle quality and strength, which are crucial determinants of ADL performance. 2 12 40 The diagnostic accuracy of non-paralyzed side PhA for discharge ADL independence differed between upper and lower limbs in women and men. This finding suggests that regional PhA measurements may provide additional insights into functional status beyond whole-body PhA. The higher accuracy of upper limb PhA in women likely reflects the greater contribution of upper extremity function to ADL tasks like dressing, grooming, and feeding. 41 42 43 Site-specific PhA provided significant incremental prognostic value when added to clinical models. When PhA variables were added to a multivariable logistic regression model that included commonly used clinical predictors, the overall discriminative ability of the model improved significantly. These results suggest that PhA (particularly whole-body measurements) may provide complementary prognostic information that is not fully captured by conventional variables such as age, stroke type, or functional status at admission. Rather than functioning as a standalone biomarker, PhA appears to refine risk stratification by capturing subtle aspects of cellular health and muscle quality that contribute meaningfully to the likelihood of functional independence at discharge. PhA-assisted collaboration among rehabilitation, nutritional support, and oral management may further improve outcomes. The assessment of site-specific PhA, especially those of the non-paretic limbs, could offer valuable insights into the potential for functional recovery in post-stroke rehabilitation patients. Moreover, considering the high prevalence of sarcopenia and malnutrition in this population, 44 45 46 47 48 50 This study has some limitations. Firstly, the retrospective design and single-center setting may restrict the generalizability of the findings to other healthcare settings. Secondly, although we adjusted for several potential confounding factors, the influence of unmeasured variables, such as dietary intake, physical activity levels, and rehabilitation intensity, cannot be excluded. Thirdly, the use of BIA for assessing phase angles and body composition may be susceptible to measurement errors, particularly in patients with fluid imbalances or altered hydration status. Future prospective, multicenter studies incorporating comprehensive assessments of nutritional status, physical function, and rehabilitation regimens are warranted to validate and expand upon our findings. In conclusion, this study identified optimal cutoff values of regional PhA for predicting ADL independence at discharge in post-stroke patients. The diagnostic accuracy of non-paretic limb PhA differed between sexes. Moreover, site-specific PhA provided significant incremental prognostic value when added to clinical models. These findings highlight the potential utility of segmental PhA assessment in tailoring the triad of rehabilitation, nutrition support and oral management strategies to enhance functional recovery after stroke.  CONFLICT OF INTEREST The researchers claim no conflicts of interest.  FUNDING None.  AUTHOR CONTRIBUTIONS Conceptualization, YY, HW, FN, AM, SS, AS, YK, TB, TH, KY; Data curation, YY, HW, FN, AM, SS, AS, YK, TB, TH, KY; Investigation, YY, FN, AM, SS, AS, YK, TB, TH, KY; Methodology, YY, FN, AM, SS, AS, YK, TB, TH, KY; Formal analysis, YY, FN, AM, SS, AS, YK, TB, TH, KY; Writing_original draft, YY, HW, FN, AM, SS, AS, YK, TB, TH, KY; Writing_review & editing, YY, HW, FN, AM, SS, AS, YK, TB, TH, KY. SUPPLEMENTARY MATERIALS Supplementary materials can be found via https://doi.org/10.4235/agmr.25.0028 Supplementary Table S1 Incremental discrimination of a clinical-baseline model after adding each continuous site-specific phase angle Supplementary Table S2 Spearman correlation matrix among five site-specific phase angle measurements REFERENCES 1 Visser M van Venrooij LM Wanders DC de Vos R Wisselink W van Leeuwen PA The bioelectrical impedance phase angle as an indicator of undernutrition and adverse clinical outcome in cardiac surgical patients Clin Nutr 2012 31 981 6 10.1016/j.clnu.2012.05.002 22640476 2 Guerrini A Siotto M Germanotta M Cipollini V Cortellini L Pavan A Muscle quality improvement in subacute post-stroke patients after rehabilitation: usefulness of segmental phase angle from bioelectrical impedance analysis Clin Nutr 2024 43 224 31 10.1016/j.clnu.2023.12.001 38096627 3 Scicchitano P Massari F The role of bioelectrical phase angle in patients with heart failure Rev Endocr Metab Disord 2023 24 465 77 10.1007/s11154-022-09757-2 36282462 PMC9592881 4 Di Vincenzo O Marra M Di Gregorio A Pasanisi F Scalfi L Bioelectrical impedance analysis (BIA) -derived phase angle in sarcopenia: a systematic review Clin Nutr 2021 40 3052 61 10.1016/j.clnu.2020.10.048 33183880 5 Papaemmanouil A Bakaloudi DR Gkantali K Kalopitas G Metallidis S Germanidis G Phase angle and handgrip strength as predictors of clinical outcomes in hospitalized COVID-19 patients Nutrients 2023 15 1409 10.3390/nu15061409 36986138 PMC10057973 6 Bernal-Ceballos F Castillo-Martinez L Reyes-Paz Y Villanueva-Juarez JL Hernandez-Gilsoul T Clinical application of phase angle and BIVA Z-score analyses in patients admitted to an emergency department with acute heart failure J Vis Exp 2023 (196) e65660 10.3791/65660 37458449 7 Ikeue K Kato H Tanaka M Yamakage H Kato S Iwasa M Phase angle is a potential novel early marker for sarcopenia and cognitive impairment in the general population J Cachexia Sarcopenia Muscle 2025 16 e13820 10.1002/jcsm.13820 40341877 PMC12059471 8 Ito Y Yoshimura Y Nagano F Matsumoto A Nomura S Phase angle as a prognostic predictor for physical function in fragile osteoporotic fracture patients Prog Rehabil Med 2023 8 20230044 10.2490/prm.20230044 38084364 PMC10703543 9 Ito Y Yoshimura Y Nagano F Matsumoto A Wakabayashi H Association of phase angle dynamics with sarcopenia and activities of daily living in osteoporotic fracture patients Ann Geriatr Med Res 2024 28 192 200 10.4235/agmr.23.0212 38486468 PMC11217650 10 Malecka-Massalska T Popiolek J Teter M Homa-Mlak I Dec M Makarewicz A Application of phase angle for evaluation of the nutrition status of patients with anorexia nervosa Psychiatr Pol 2017 51 1121 31 10.12740/pp/67500 29432507 11 Abe T Yoshimura Y Imai R Yoneoka Y Tsubaki A Sato Y Impact of phase angle on physical function in patients with acute stroke J Stroke Cerebrovasc Dis 2021 30 105941 10.1016/j.jstrokecerebrovasdis.2021.105941 34217068 12 Akamatsu Y Kusakabe T Arai H Yamamoto Y Nakao K Ikeue K Phase angle from bioelectrical impedance analysis is a useful indicator of muscle quality J Cachexia Sarcopenia Muscle 2022 13 180 9 10.1002/jcsm.12860 34845859 PMC8818694 13 Ostachowska-Gasior A Piwowar M Zajac J Segmental phase angle and body composition fluctuation of elite ski jumpers between summer and winter FIS competitions Int J Environ Res Public Health 2021 18 4741 10.3390/ijerph18094741 33946810 PMC8124535 14 Yoshimura Y Wakabayashi H Nagano F Matsumoto A Shimazu S Shiraishi A Association between segmental phase angles and functional independence measure scores in hospitalized adults following stroke: a retrospective cohort study JPEN J Parenter Enteral Nutr 2025 49 239 48 10.1002/jpen.2703 39521732 15 Shimazu S Yoshimura Y Kudo M Nagano F Bise T Shiraishi A Frequent and personalized nutritional support leads to improved nutritional status, activities of daily living, and dysphagia after stroke Nutrition 2021 83 111091 10.1016/j.nut.2020.111091 33388653 16 Shiraishi A Wakabayashi H Yoshimura Y Oral management in rehabilitation medicine: oral frailty, oral sarcopenia, and hospital-associated oral problems J Nutr Health Aging 2020 24 1094 9 10.1007/s12603-020-1439-8 33244566 PMC7349468 17 Matsumoto A Yoshimura Y Shimazu S Nagano F Bise T Kido Y Association of polypharmacy at hospital discharge with nutritional intake, muscle strength, and activities of daily living among older patients undergoing convalescent rehabilitation after stroke Jpn J Compr Rehabil Sci 2022 13 41 8 10.11336/jjcrs.13.41 37859847 PMC10545045 18 Yoshimura Y Wakabayashi H Nagano F Matsumoto A Shimazu S Shiraishi A Hyponatremia as a predictor of cognitive deterioration in hospitalized post-stroke patients J Clin Neurosci 2024 124 115 21 10.1016/j.jocn.2024.04.027 38703471 19 Banks JL Marotta CA Outcomes validity and reliability of the modified Rankin scale: implications for stroke clinical trials: a literature review and synthesis Stroke 2007 38 1091 6 10.1161/01.str.0000258355.23810.c6 17272767 20 Charlson ME Pompei P Ales KL MacKenzie CR A new method of classifying prognostic comorbidity in longitudinal studies: development and validation J Chronic Dis 1987 40 373 83 10.1016/0021-9681(87)90171-8 3558716 21 Safaz I Yilmaz B Yasar E Alaca R Brunnstrom recovery stage and motricity index for the evaluation of upper extremity in stroke: analysis for correlation and responsiveness Int J Rehabil Res 2009 32 228 31 10.1097/mrr.0b013e32832a62ad 19339892 22 Ottenbacher KJ Hsu Y Granger CV Fiedler RC The reliability of the functional independence measure: a quantitative review Arch Phys Med Rehabil 1996 77 1226 32 10.1016/s0003-9993(96)90184-7 8976303 23 Nagaoka S Yoshimura Y Eto T Kumagi M Low handgrip strength is associated with reduced functional recovery and longer hospital stay in patients with osteoporotic vertebral compression fractures: a prospective cohort study Eur Geriatr Med 2021 12 767 75 10.1007/s41999-020-00446-4 33469814 24 Oyanagi K Kitai T Yoshimura Y Yokoi Y Ohara N Kohara N Effect of early intensive rehabilitation on the clinical outcomes of patients with acute stroke Geriatr Gerontol Int 2021 21 623 8 10.1111/ggi.14202 34101957 25 Matsumoto A Yoshimura Y Nagano F Bise T Kido Y Shimazu S Polypharmacy and potentially inappropriate medications in stroke rehabilitation: prevalence and association with outcomes Int J Clin Pharm 2022 44 749 61 10.1007/s11096-022-01416-5 35578145 26 Campa F Coratella G Cerullo G Noriega Z Francisco R Charrier D High-standard predictive equations for estimating body composition using bioelectrical impedance analysis: a systematic review J Transl Med 2024 22 515 10.1186/s12967-024-05272-x 38812005 PMC11137940 27 Yoshimura Y Wakabayashi H Nagano F Matsumoto A Shimazu S Shiraishi A Phase angle is associated with sarcopenic obesity in post-stroke patients Clin Nutr 2023 42 2051 7 10.1016/j.clnu.2023.08.018 37677910 28 Tsilingiris D Schimpfle L Kender Z Sulaj A von Rauchhaupt E Herzig S Utility of bioelectrical phase angle for cardiovascular risk assessment among individuals with and without diabetes mellitus Diab Vasc Dis Res 2024 21 14791641231223701 10.1177/14791641231223701 38305220 PMC10838040 29 Furuta H Mizuno K Unai K Ebata H Yamauchi K Watanabe M Functional independence measure subtypes among inpatients with subacute stroke: classification via latent class analysis Prog Rehabil Med 2022 7 20220021 10.2490/prm.20220021 35528116 PMC9024111 30 Fletcher B Bradburn E Baker C Collier B Hamill M Shaver K Pretrauma functional independence measure score predicts survival in geriatric trauma Am Surg 2017 83 559 63 10.1177/000313481708300619 28637556 31 Yamada S Liu M Hase K Tanaka N Fujiwara T Tsuji T Development of a short version of the motor FIM for use in long-term care settings J Rehabil Med 2006 38 50 6 10.1080/16501970510044034 16548088 32 Kidd D Stewart G Baldry J Johnson J Rossiter D Petruckevitch A The functional independence measure: a comparative validity and reliability study Disabil Rehabil 1995 17 10 4 10.3109/09638289509166622 7858276 33 Iwata K Kitai T Yoshimura Y Honda A Shimogai T Otsuka S Clinical impact of functional independent measure (FIM) on 180-day readmission and mortality in elderly patients hospitalized with acute decompensated heart failure Heart Vessels 2021 36 1536 41 10.1007/s00380-021-01841-y 33834270 34 Hori K Yoshimura Y Wakabayashi H Nagano F Matsumoto A Shimazu S Improved systemic inflammation is associated with functional prognosis in post-stroke patients Ann Geriatr Med Res 2024 28 388 94 10.4235/agmr.24.0020 38724451 PMC11695764 35 Nishioka S Aragane H Suzuki N Yoshimura Y Fujiwara D Mori T Clinical practice guidelines for rehabilitation nutrition in cerebrovascular disease, hip fracture, cancer, and acute illness: 2020 update Clin Nutr ESPEN 2021 43 90 103 10.1016/j.clnesp.2021.02.018 34024570 36 Yoshimura Y Bise T Nagano F Shimazu S Shiraishi A Yamaga M Systemic inflammation in the recovery stage of stroke: its association with sarcopenia and poor functional rehabilitation outcomes Prog Rehabil Med 2018 3 20180011 10.2490/prm.20180011 32789236 PMC7365223 37 Yoshimura Y Wakabayashi H Momosaki R Nagano F Shimazu S Shiraishi A Shorter interval between onset and admission to convalescent rehabilitation wards is associated with improved outcomes in ischemic stroke patients Tohoku J Exp Med 2020 252 15 22 10.1620/tjem.252.15 32848123 38 Matsumoto A Yoshimura Y Nagano F Bise T Kido Y Shimazu S Polypharmacy and its association with dysphagia and malnutrition among stroke patients with sarcopenia Nutrients 2022 14 4251 10.3390/nu14204251 36296943 PMC9609259 39 Wakabayashi H Yoshimura Y Maeda K Fujiwara D Nishioka S Nagano A Goal setting for nutrition and body weight in rehabilitation nutrition: position paper by the Japanese Association of Rehabilitation Nutrition (secondary publication) J Gen Fam Med 2022 23 77 86 10.1002/jgf2.509 35261854 PMC8888801 40 da Silva BR Orsso CE Gonzalez MC Sicchieri JM Mialich MS Jordao AA Phase angle and cellular health: inflammation and oxidative damage Rev Endocr Metab Disord 2023 24 543 62 10.1007/s11154-022-09775-0 36474107 PMC9735064 41 Sato A Fujita T Yamamoto Y Activities of daily living independence level for home discharge in stroke patients based on number of caregivers: an analysis of the Japan Rehabilitation Database Phys Ther Res 2017 20 23 7 10.1298/ptr.e9914 29333359 PMC5743428 42 Amakasu K Inoue T Watanabe Y Low phase angle: a predictor of functional status and discharge disposition in acute stroke older patients Clin Nutr ESPEN 2024 61 197 202 10.1016/j.clnesp.2024.03.028 38777433 43 Bellido D Garcia-Garcia C Talluri A Lukaski HC Garcia-Almeida JM Future lines of research on phase angle: strengths and limitations Rev Endocr Metab Disord 2023 24 563 83 10.1007/s11154-023-09803-7 37043140 PMC10090740 44 Kido Y Yoshimura Y Wakabayashi H Momosaki R Nagano F Bise T Sarcopenia is associated with incontinence and recovery of independence in urination and defecation in post-acute rehabilitation patients Nutrition 2021 91-92 111397 10.1016/j.nut.2021.111397 34364264 45 Sato Y Yoshimura Y Abe T Nagano F Matsumoto A Hospital-associated sarcopenia and the preventive effect of high energy intake along with intensive rehabilitation in patients with acute stroke Nutrition 2023 116 112181 10.1016/j.nut.2023.112181 37678013 46 Wakabayashi H Triad of rehabilitation, nutrition, and oral management for sarcopenic dysphagia in older people Geriatr Gerontol Int 2024 24 Suppl 1 397 9 10.1111/ggi.14651 37577770 47 Wakabayashi H Kakehi S Kishima M Itoda M Nishioka S Momosaki R Impact of registered dietitian and dental hygienist involvement on functional outcomes in patients with dysphagia: triad of rehabilitation, nutrition, and oral management Eur Geriatr Med 2023 14 1301 6 10.1007/s41999-023-00833-7 37442874 48 Mizuno S Wakabayashi H Wada F Rehabilitation nutrition for individuals with frailty, disability, sarcopenic dysphagia, or sarcopenic respiratory disability Curr Opin Clin Nutr Metab Care 2022 25 29 36 10.1097/mco.0000000000000787 34456248 PMC8694258 49 Inoue T Iida Y Takahashi K Shirado K Nagano F Miyazaki S Nutrition and physical therapy: a position paper by the physical therapist section of the Japanese Association of Rehabilitation Nutrition (secondary publication) JMA J 2022 5 243 51 10.31662/jmaj.2021-0201 35611222 PMC9090552 50 Wakabayashi H Maeda K Momosaki R Kokura Y Yoshimura Y Fujiwara D Diagnostic reasoning in rehabilitation nutrition: position paper by the Japanese Association of Rehabilitation Nutrition (secondary publication) J Gen Fam Med 2022 23 205 16 10.1002/jgf2.549 35800646 PMC9249927 Fig. 1. Flowchart of participant screening, inclusion criteria, and follow-up. Fig. 2. Receiver operating characteristic curves to identify the optimal phase angle cutoff for detecting ADL independence at discharge in woman (A) and man (B) using phase angle–whole body. (A) The optimal cutoff value is 3.90° in woman (sensitivity=0.676, specificity=0.818). (B) The optimal cutoff value is 4.60° in man (sensitivity=0.653, specificity=0.823). ADL, activities of daily living; AUC, area under the curve. Fig. 3. Receiver operating characteristic curves to identify the optimal phase angle cutoff for detecting ADL independence at discharge in woman (A) and man (B) using phase angle–non-paretic upper limb, and in woman (C) and man (D) using phase angle-non paretic lower limb. (A) The optimal cutoff value is 4.45° in woman (sensitivity=0.676, specificity=0.818). (B) The optimal cutoff value is 4.90° in man (sensitivity=0.653, specificity=0.823). (C) The optimal cutoff value is 4.00° in woman (sensitivity=0.659, specificity=0.734). (D) The optimal cutoff value is 4.85° in man (sensitivity=0.694, specificity=0.759). ADL, activities of daily living; AUC, area under the curve. Table 1. Baseline comparison of patient characteristics between women and men Variable Total (n=1,080) Women (n=496) Men (n=584) p-value Age (y) 75.6±9.3 76.0±10.4 75.1±8.8 0.160 Stroke type Cerebral infarction 687 (63.6) 306 (61.7) 381 (65.2) 0.229 Cerebral hemorrhage 321 (29.7) 138 (27.8) 183 (31.3) 0.221 SAH 72 (6.7) 52 (10.5) 20 (3.6) <0.001 Onset-admission days 14 (11–22) 14 (10–21) 13.00 (10–20) 0.385 Paralysis side 0.808 Right 443 (41.0) 200 (40.3) 243 (41.6) Left 422 (39.1) 198 (39.9) 224 (38.4) Both 43 (4.2) 18 (3.6) 27 (4.6) BRS-upper limb 5 (3–6) 5 (3–6) 5 (3–6) 0.344 BRS-hand and fingers 5 (2–6) 5 (2–6) 5 (3–6) 0.397 BRS-lower limb 5 (3–6) 5 (3–6) 5 (3–6) 0.160 Stroke history 263 (24.4) 111 (22.4) 152 (26.0) 0.177 Pre-stroke mRS 0 (0–2) 1 (0–1) 1 (0–1) 0.251 CCI score 3 (2–4) 3 (2–4) 3 (2–4) 0.202 HGS (kg) 18.8 (10.0–27.5) 13.1 (6.1–18.3) 25.9 (17.5–33.6) <0.001 BMI (kg/m 2 22.3 (19.8–24.7) 21.2 (18.9–24.0) 22.9 (20.7–25.2) <0.001 SMI (kg/m 2 6.3 (5.3–7.3) 5.3 (4.7–6.1) 7.1 (6.3–7.7) <0.001 Phase angle Whole body 4.5 (3.7–5.4) 4.1 (3.5–4.8) 5.0 (4.2–5.8) <0.001 Upper limb (healthy side) 4.7 (4.1–5.5) 4.3 (3.8–4.8) 5.2 (4.5–5.9) <0.001 Upper limb (paretic side) 4.3 (3.6–5.0) 3.9 (3.3–4.6) 4.7 (4.0–5.4) <0.001 Lower limb (healthy side) 4.6 (3.7–5.5) 4.1 (3.3–4.8) 5.1 (4.2–6.1) <0.001 Lower limb (paretic side) 4.1 (3.3–5.0) 3.6 (2.8–4.4) 4.5 (3.7–5.5) <0.001 Rehabilitation therapy a) 8.2 (7.5–8.6) 8.2 (7.4–8.5) 8.2 (7.5–8.7) 0.759 Length of hospital stay (day) 86 (53–128) 88 (55–126) 85 (51–123) 0.136 Number of medications 5 (3–7) 5 (3–7) 5 (3–7) 0.452 FIM (on admission) Total 66 (34–92) 64 (34–92) 66 (34–92) 0.106 Motor 46 (20–67) 44 (19–62) 47 (22–68) 0.086 Cognition 21 (12–27) 20 (11–27) 21 (13–27) 0.129 ADL independence b) 129 (11.9) 60 (12.1) 69 (11.8) 0.098 FIM–motor at discharge 80 (50–89) 79 (48–89) 80 (51–89) 0.112 ADL independence at discharge 454 (42.0) 214 (43.1) 240 (41.1) 0.089 Values are presented as mean±standard deviation or number (%) or median (interquartile range). SAH, subarachnoid hemorrhage; BRS, Brunnstrom Recovery Stage; mRS, modified Rankin scale; CCI, Charlson Comorbidity Index; HGS, handgrip strength; BMI, body mass index; SMI, skeletal muscle mass index; FIM, Functional Independence Measure; ADL, activities of daily living. a) Rehabilitation therapy (including physical, occupational, and speech and swallowing therapy) performed during hospitalization (1 unit=20 minutes). b) ADL independence was defined as FIM-motor score of >78. Table 2. Logistic regression analysis of ADL independence at discharge by site-specific phase angles Phase angle OR (95% CI) VIF range for adjusted covariates a) Hosmer–Lemeshow p-value b) p-value Whole body 1.452 (1.112–1.186) 1.14–3.38 0.429 0.006 Paretic upper limb 1.597 (1.097–2.333) 1.14–4.23 0.533 0.0106 Non-paretic upper limb 1.609 (1.118–2.316) 1.14–4.33 0.517 0.010 Paretic lower limb 1.389 (1.072–1.800) 1.15–4.26 0.885 0.013 Non-paretic lower limb 1.586 (1.186–2.122) 1.15–4.28 0.283 0.002 ADL, activities of daily living; OR, odds ratio; CI, confidence interval; VIF, variance inflation factor. Adjusted: age, sex, days from onset to admission, stroke type, Functional Independence Measure (FIM)-motor, FIM-cognition, pre-stroke modified Rankin scale, Charlson Comorbidity Index, Brunnstrom Recovery Stage-lower limb, drug number. a) VIF range represents the minimum and maximum values across all adjusted covariates. b) The Hosmer–Lemeshow goodness-of-fit test for each model. Table 3. Logistic regression analysis of ADL independence at discharge by higher site-specific phase angles Higher phase angle OR (95% CI) VIF range for adjusted covariates a) Hosmer–Lemeshow p-value b) p-value Whole body 2.106 (1.286–3.449) 1.10–3.83 0.771 0.002 Non-paretic upper limb 2.164 (1.283–3.649) 1.38–4.25 0.613 0.004 Non-paretic lower limb 1.641 (1.055–2.720) 1.13–4.25 0.817 0.045 ADL, activities of daily living; OR, odds ratio; CI, confidence interval; VIF, variance inflation factor. Adjusted: age, sex, days from onset to admission, stroke type, Functional Independence Measure (FIM)-motor, FIM-cognition, pre-stroke modified Rankin scale, Charlson Comorbidity Index, Brunnstrom Recovery Stage-lower limb, drug number. a) VIF range represents the minimum and maximum values across all adjusted covariates. b) The Hosmer–Lemeshow goodness-of-fit test for each model. Table 4. Incremental discrimination of the baseline clinical model after adding higher phase-angle indicators for predicting ADL independence at discharge Model AUC (95% CI) ΔAUC vs. Baseline p-value (DeLong) Baseline model a) 0.937 (0.915–0.969) - - Higher PhA–whole body 0.970 (0.958–0.980) +0.033 0.011 Higher PhA–non-paretic upper limb 0.965 (0.953–0.976) +0.028 0.019 Higher PhA–non-paretic lower limb 0.962 (0.949–0.973) +0.025 0.027 ADL, activities of daily living; PhA, phase angle; AUC, area under the curve; CI, confidence interval. ΔAUC = AUC extended baseline a) Baseline covariates: age, sex, days from onset to admission, stroke type, admission Functional Independence Measure (FIM)-motor, admission FIM-cognition, pre-stroke modified Rankin scale, Charlson Comorbidity Index, Brunnstrom Recovery Stage-lower limb, and number of medications. ",
  "metadata": {
    "Title of this paper": "Diagnostic reasoning in rehabilitation nutrition: position paper by the Japanese Association of Rehabilitation Nutrition (secondary publication)",
    "Journal it was published in:": "Annals of Geriatric Medicine and Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489603/"
  }
}