{
  "title": "Paper_16",
  "abstract": "pmc Drug Deliv Drug Deliv 3498 drugd Drug Delivery 1071-7544 1521-0464 Taylor & Francis PMC12490374 PMC12490374.1 12490374 12490374 41030067 10.1080/10717544.2025.2566782 2566782 1 Version of Record Review Article Review Article Nucleic acid-encoded antibody gene transfer-next generation of antibody therapies K. Yu et al. Yu Kaikai Conceptualization Data curation Resources Writing – original draft  a # * Xiao Geng Conceptualization Data curation Visualization Writing – original draft  a # Chen Baichuan Conceptualization Data curation Resources Writing – review & editing  a Xu Na Conceptualization Writing – review & editing  b Liu Wensen Conceptualization Funding acquisition  a a Changchun Veterinary Research Institute, Chinese Academy of Agricultural Science Changchun China b Jilin Medical University Jilin China # These authors have contributed equally to this work.  * Kaikai Yu is also affiliated to Beijing Key Laboratory for Radiobiology, Department of Experimental Hematology and Biochemistry, Beijing Institute of Radiation Medicine, Beijing 100850, China. CONTACT liuws85952@163.com Changchun Veterinary Research Institute, Chinese Academy of Agricultural Science Changchun 130122 China Na Xu xunajlu@sina.com Jilin Medical University Jilin 132013 China 1 10 2025 2025 32 1 477018 2566782 01 10 2025 03 10 2025 03 10 2025 25 2 2025 5 8 2025 22 9 2025 KnowledgeWorks Global Ltd. 30 9 2025 published online in a building issue 30 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Abstract Antibody therapeutics have emerged as a cornerstone in modern biopharmaceutical development, revolutionizing treatments across diverse diseases. Recent breakthroughs in antibody discovery technologies, particularly single B-cell sorting and high-throughput sequencing, have significantly enhanced the ability to identify and isolate potent therapeutic antibodies. Despite these advances, widespread adoption of monoclonal antibody (mAb) therapies faces substantial challenges, including complex manufacturing processes, high production costs, and stringent cold-chain storage requirements. A promising solution to these limitations is nucleic acid-encoded antibody delivery, which enables in vivo production of functional antibodies. This technology delivers nucleotide sequences encoding mAbs instead of the antibody proteins themselves, effectively turning the body into a bioreactor for antibody production. By bypassing the complex purification and quality control processes associated with traditional recombinant protein production, this approach offers a more streamlined and potentially cost-effective alternative. Herein, we review current nucleic acid-based antibody delivery platforms, highlighting the unique advantages and technical challenges. We provide an in-depth analysis of the latest advancements in this field, including both viral and non-viral delivery methods, and discuss their implications for next-generation antibody therapeutics. We also examine the potential applications in infectious diseases and cancer immunotherapy, alongside regulatory and safety considerations for clinical translation. We aim to provide valuable insights and guidance for researchers and clinicians in advancing novel antibody-based therapies. Graphical abstract Graphical abstract was created with Figdraw.com. Keywords Passive immunity nucleic acid antibody adeno-associated virus antibiotic therapy gene delivery No funding was received pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Monoclonal antibody (mAb) therapy has advanced significantly since the hybridoma technology was established. In 1975, Köhler and Milstein pioneered the B lymphocyte hybridoma technique by fuzing antigen-specific mouse spleen cells (containing B lymphocytes) with myeloma cells (Köhler and Milstein 1975 2016 Recombinant monoclonal antibody therapy, a passive immune approach that can provide near-immediate protection, is widely used in disease prevention and treatment. For example, during the Coronavirus Disease 2019 (COVID-19) pandemic, several mAb cocktails against SARS-CoV-2 were granted emergency use authorization to treat symptomatic patients (Copin et al. 2021 2015 2011 2022 The significant potential and existing challenges of monoclonal antibody therapies underscore the critical need for innovations in their production and delivery. The emergence of in vivo antibody delivery can avoid these hurdles by administering nucleotide sequences encoding mAbs (Choi et al. 2020 2021 In this comprehensive review, we aim to provide an in-depth analysis of the current advancements in nucleic acid-encoded antibody technology, focusing on molecular mechanisms, delivery platforms, and potential applications in diverse disease areas. We further examine current challenges and future directions to offer critical insights for both researchers and clinicians. In vivo antibody gene delivery Gene therapy has evolved significantly since its conceptual origins in the 1970s (Friedmann 1992 2000 Table 1 1982 2017 2019 2022 2017 2023 2023 2022 2018 2013 Table 1. Comparison of different in vivo antibody gene delivery platforms.  Synthetic DNA (Patel et al. 2020 mRNA (Muripiti et al. 2024 2025 Viral vector (Bian et al. 2025 nucleic acid material Plasmid DNA mRNA AAV, Adv Transfection mode Electroporation Lipid nanoparticle Direct injection Delivery route ID, IM IV, IM/ID IM, IN, IV, IC, IO, IT Integration None observed in human Low probability Low probability Anti-vector immunity No No Serotype-specific Initiation time of antibody expression <1day <2h <3days Duration of a single administration Weeks/months Days/weeks Months/years Antibody expression level Microgram scale Microgram scale Microgram scale Antibody expression form mAb, BsMAb mAb, BsMAb mAb, BsMAb Tissue specificity/tropism Local site of administration Non-specificity Specificity Industrialization difficulty Easy Moderate Moderate Cold-chain free Yes No No Disease indication Cancer, Auto-immune disease, Infectious diseases, Inflammatory diseases, Genetic diseases Cancer, Infectious diseases Cancer, Central nervous system disease, Infectious diseases ID: Intradermal; IM: Intramuscular; IV: Intravenous; IN: Intranasal; IC: Intracardiac; IO: Intraosseous; IT: Intrathecal. Viral vector-mediated antibody gene transfer The use of viral vectors to express therapeutic proteins, including antibodies, has a long history. Although other viruses and bacterial systems have been reported the expression of therapeutic proteins, the viral vectors most commonly used for gene therapy are adenovirus (Adv) and adeno-associated virus (AAV) vectors, which realize the in vivo transfer of antibody genes by deleting part of their genomes and inserting therapeutic antibody genes ( Table 2 2021 Table 2. Properties of adenoviruses and adeno-associated viruses. Project Adenovirus Adeno-associated virus Viral genome dsDNA ssDNA Replication Autonomous replication Helper virus-dependent Genome size About 36 kb About 4.7 kb Range of infection Non-dividing cells and dividing cells Non-dividing cells and dividing cells Integrated host genome Nonintegrated Nonintegrated Expression level High High Expression time Fast (A day or two) Usually Slow (A week or two, can be much faster using self-complementary AAV) Expression duration Brief Persistent Packaging capability <7.5 kb <4.6 kb Immunogenicity High Low Storage −80 °C −80 °C Adenoviral vectors The adenovirus genome is a linear, non-segmented double-stranded DNA (dsDNA) molecule, typically 26–45 kb in size. It mainly includes E1a, E1b, E2a, E2b, E3, E4 (encoding viral regulatory proteins) in the early stage of viral DNA replication, L1-L5 (encoding viral structural proteins) in the late stage of DNA replication, and inverted terminal repeats (ITRs) at both ends. Adenovirus vectors can infect both mitotic cells and non-mitotic cells via receptor-mediated endocytosis, delivering their genome to the nucleus while remaining episomal. After decades of development, adenovirus-based genetic engineering drugs have relatively matured. Adv-encoded therapeutic monoclonal antibodies have been widely used in anti-tumor therapy (Ho et al. 2009 2021 2011 2010 2023 2022 Adeno-associated viral vectors Adeno-associated viral vectors is a small, non-enveloped, linear single-stranded DNA (ssDNA) virus, belonging to the genus Dependoparvovirus Parvoviridae 2017 2022 2002 2018 2024 Despite these advances, clinical challenges remain. Preexisting immunity to natural AAV serotypes is a major limitation, with 30-70% of populations showing neutralizing antibodies against common variants like AAV2 (Hareendran et al. 2013 2024 2019 RNA-mediated antibody gene transfer RNA-based therapeutics have achieved remarkable advancements over the past decade, emerging as a highly efficient platform for in vivo encoding and production of therapeutic proteins. mRNA has been used to develop vaccines and nucleic acid drugs (Pardi et al. 2018 2023 mRNA-mediated antibody gene transfer mRNA is synthesized by in vitro transcription (IVT) using a linear DNA template that contains a promoter, 5′ and 3′ untranslated regions (UTRs), and an open reading frame (Petkovic and Müller 2015 2023 2022 2022 Research on mRNA-encoded antibodies Lipid-based drug delivery systems have emerged as a versatile platform to target cells and tissues, delivering cargo from from small-molecule inhibitors to vaccine components. Compared with traditional drug delivery methods, it increases drug stability, bioavailability, and tissue distribution. In the past decade, mRNA-based studies have demonstrated significant potential for both treatment and vaccine applications (Sanz and Álvarez-Vallina 2021 2021 2017 2017 2021 2021 2022 2021 Self-amplifying RNA As a new generation of mRNA, self-amplifying RNA (saRNA) vaccine has attracted wide attention (Blakney et al. 2021 One disadvantage of saRNA vaccines is the large and complex saRNA sequences. The total length of the saRNA vaccine is usually more than 9,000 bases. The larger structure leads to instability of the genome and easy fragmentation (Zhou et al. 2023 2018 2023 2018 2021 2022 2020 2020 2021 Circular RNA Circular RNAs (circRNAs) are a class of non-coding RNAs that do not have a 5′ terminal cap and a 3′ terminal poly (A) tail, and form a circular structure with covalent bonds. They are generated by atypical RNA splicing events called back-splicing in eukaryotic cells (Whitley et al. 2022 2021 2021 2013 2013 2013 2023 2018 2018 6 2022 Due to the low production efficiency, difficult purification, and weak protein expression of circRNA, it is necessary to further optimize its translation and enhance its expression capacity. R. Alexander Wesselhoeft et al. designed a self-splicing intron that enables RNA cyclization up to 5 kb in vitro by rationally designing ubiquitous auxiliary sequences that facilitate splicing (Wesselhoeft et al. 2018 2023 DNA-encoded monoclonal antibody gene delivery The earliest DNA therapy can be traced back to 1990. Wolf et al. injected naked plasmid DNA (pDNA) into mouse skeletal muscle and observed the expression of coding protein, which opened the curtain of the field of DNA therapy (Wolff et al. 1990 2015 2017 [64] 1982 Optimization of expression quantity Sequence optimization The optimization and analysis of therapeutic antibody sequences during early-stage research can make the expression process twice as efficient. Almost every research will optimize the codon according to the species information of the antibody to be expressed, thereby increasing the expression of the antibody. Sequence optimization usually has two directions. The first approach involves identifying key amino acid residues in the variable region through sequence analysis and site-directed mutagenesis to enhance expression yield. Some bioinformatics methods are also used to predict key amino acid residues in antibody sequences. For example, the IMGT DomainGapAlign tool can be used to analyze sequences to determine potential expression optimization sites (Ehrenmann and Lefranc 2012 2022 2022 Alternatively, the mutation in the Fc region of antibodies have been engineered to modulate interaction with both Fc receptor (FcRn) and Fc gamma receptor (FcγR). The binding of FcRn, in turn, affects the duration of antibody expression in vivo. Researchers have found that modifying the Fc region of antibodies can eliminate FcRn binding, thereby protecting mice from lethal infections with increased antibody dependence. Seleeke Flingai et al. (Flingai et al. 2015 2015 2019 2019 Electroporation The low transfection efficiency of naked DNA is the biggest obstacle to DNA-mediated gene transfer, which also fails to elicit a strong immune response in large mammals such as monkeys and humans. So the researchers developed electroporation (EP), a physical method to temporarily increase the cell membrane permeability. EP involves the use of transient electrical pulses, which lead to the generation of transient nanoscale pores in the lipid bilayer membranes of mammalian cells. This allows DNA and other macromolecules to be transported through cell membranes that are normally impermeable to these molecules. Therefore, EP has the ability to increase the uptake and extent of drugs and DNA delivered to target tissues. Electroporation is widely used in the field of gene therapy, such as nucleic acid vaccines and antibody gene transfer. The CELLECTRA ® 2015 ® 1986 ® 2023 [72] ® Adjuvants for injection An important factor for successful electroporation in vivo is the ability of plasmid DNA to enter muscle fibers through the fiber surface. Each muscle fiber is wrapped by the plasma membrane called sarcolemma and surrounded by collagen and hyaluronic acid, which collectively constitute a significant barrier to effective plasmid DNA delivery. Therefore, hyaluronidase or collagenase can reduce the activity of hyaluronic acid in vivo by decomposing extracellular matrix components, thereby improving the liquid permeability of tissues, thus increasing the distribution of plasmids in the whole muscle. Kevin Hollevoet et al. evaluated the role of hyaluronidase in the research related to clinical transformation of large animals. They transferred the pDNA encoding ovine anti-CEA monoclonal antibody (OVAC) to sheep through electroporation in vivo. After pretreatment with hyaluronidase at the injection site, the plasma OVAC concentration in sheep 4520 increased 6 to 10 times in the initial 14 days, with a peak of 1.6 µg/mL (Hollevoet et al. 2019 ® 2019 2020 Double plasmid system and multiple injection sites In murine models of antibody gene transfer, the most prevalent preclinical system, the tibialis anterior (TA) and quadriceps femoris (QF) muscles are preferentially selected as intramuscular injection sites. Due to the volume limitation of the injection site, large dose injection per unit point may affect the effective absorption of drugs. Therefore, when the injection dose is large, low-dose injection at multiple sites is usually used to improve the efficiency of gene transfer. In addition, when delivering pDNA-encoded antibody cocktails in vivo, different injection sites need to be selected for different muscles. Megan C. Wise et al. injected 25 μg of heavy chain and 25 μg of light chain plasmids, each prepared with hyaluronidase, into the tibialis anterior muscle and quadriceps femoris muscle, and then electroporated at the injection site. The experimental results showed that the expression level of single antibody in mice injected with antibody cocktail was not lower than that of single antibody delivered separately (Wise et al. 2020 2022 Minicircle DNA Microcircular DNA is the product of site-specific recombination of parental plasmid (PP) in vivo. Different from traditional plasmid vectors, because of the lack of prokaryotic DNA skeleton sequences, such as antibiotic genes, prokaryotic replication starting point. Microloop vectors can improve the level of therapeutic gene expression, the safety of gene therapy and reduce inflammation. In 1997, Darquet et al. The study of antibody gene transfer based on minicircle DNA (mcDNA) is relatively short (Darquet et al. 1997 2014 2012 Safety and integration The safety of the gene delivery platform is a necessary prerequisite for the clinical application of in vivo antibody gene delivery. Although the clinical safety data remain limited for both viral and non-viral vectors specifically engineered for antibody expression, the research on vaccine and gene therapy using this technology has been carried out for decades, which can provide some reference. Emerging clinical trials ( Table 3 Table 3. Clinical trials of three antibody expression platforms in vivo. Platform Status Study title Conditions Interventions/ treatment Phase NCT number First posted Last update posted rAAV Unknown † A Phase 1, Randomized, Blinded, Dose-escalation Study of rAAV1-PG9DP Recombinant AAV Vector Coding for PG9 Antibody in Healthy Male Adults. HIV Infection Biological: rAAV1-PG9DP Phase 1 NCT01937455 September 9, 2013 January 11, 2018  Recruiting Pivotal 2 Study of RGX-314 Gene Therapy in Participants With nAMD (ASCENT) AMD, Genetic: ABBV-RGX-314 Dose 1/2; Biological: Aflibercept (EYLEA ® Phase 3 NCT05407636 June 7, 2022 October 16, 2024 DNA Completed A Study of INO-A002 in Healthy Zika Virus-naive Adults Healthy Volunteers Biological: INO-A002; Device: CELLECTRA ® Phase 1 NCT03831503 February 5, 2019 December 14, 2023  Active, not recruiting dMAbs for Prevention of COVID-19 Healthy Volunteers Combination Product: dMAb AZD5396; dMAb AZD8076; Electroporation device; Drug: Hylenex (recombinant hyaluronidase) Phase 1 NCT05293249 March 24, 2022 July 3, 2024 mRNA Completed Safety, Tolerability, Pharmacokinetics, and Pharmaco­dynamics of mRNA-1944 in Healthy Adults Healthy Volunteers Biological: mRNA-1944; Placebo Phase 1 NCT03829384 February 4, 2019 July 7, 2021  Recruiting Safety and Preliminary Efficacy Trial of BNT142 in Patients with CLDN6-positive Solid Tumors Solid Tumors Biological: BNT142 Phase 1/2 NCT05262530 March 2, 2022 January 31, 2025  Not yet recruiting A Study of mRNA Encoding CD19/CD3 T Cell Engager (ABO2203) in Patients With Refractory Autoimmune Diseases Autoimmune Diseases Drug: Early Phase 1 NCT06747156 December 24, 2024 December 24, 2024 All data was obtained from the National Library of Medicine.  † Status unknown: Trial may be terminated but not updated in ClinicalTrials.gov. Safety of virus vector Safety of adenovirus vector As preexisting immunity against viral vectors will limit the effectiveness and persistence of the corresponding vector, the researchers focus on the adenovirus serotype with low prevalence in the study population. Ronald Vogels et al. conducted extensive screening and found that among the 47 types of human adenoviruses detected, subgroup B members Ad35 and Ad11 were least neutralized by human serum (Vogels et al. 2003 2022 2022 2017 2006 2022 2020 2023 Safety of adeno-associated virus vector AAV may also cause adverse reactions in animal and human clinical trials. The first is the immune response. When rAAV infects antigen-presenting cells, the activation of Toll-like receptor 9 (TLR9) can cause a mild innate immune response. TLR9 recognizes the unmethylated Cytosine-phosphate-Guanine (CpG) in nucleic acid, thus activating classical and non-classical NF-κB pathways, and promoting the expression of inflammatory cytokines and interferon response genes. The expression of these genes will in turn produce a cytotoxic T lymphocyte (CTL) reaction and stable neutralizing antibody titer (Horn and Fehse 2024 2014 2021 2018 2015 Safety of mRNA delivery Although the structure of exogenous IVT mRNA is similar to that of naturally synthesized mRNA, as a “non-self component,” it will still be recognized by the body’s immune monitoring mechanism and trigger a series of innate immune responses. IVT mRNA can be recognized by TLR-3, TLR-7, TLR-8 (Han et al. 2022 2011 2002 2011 2022 2017 2017 To reduce systemic toxicity and anti-drug antibody responses, targeted organ delivery of mRNA therapeutics has become a research hotspot in many fields. The specificity of targeted organ drugs also reduces the drug dose reaching the effective therapeutic concentration, further reducing side effects, especially for the prevention or treatment of mucosal pathogens. Among them, the lungs and female reproductive tract (FRT) are potential targets of some infectious diseases, including influenza A, respiratory syncytial virus, and HIV. Van Hoecke et al (Van Hoecke et al. 2021 Safety of DNA delivery To date, plasmid DNA has been extensively studied for more than 30 years, with no serious adverse events reported (Athanasopoulos et al. 2017 2021 2021 2022 2017 Expression of human antibody in animals Species differences pose inherent obstacles for pharmacokinetic characterization of antibody-encoding gene expression in animal models. The human antibody sequence, as a foreign substance, can elicit anti-drug antibody reactions in immunocompetent animals, significantly impacting both expression levels and persistence. To enable more accurate characterization of human antibody expression in animals, researchers usually employ the strategy of “immune shielding.” A common method is to use immunocompromised animal models for evaluation, such as RAG1 knockout mice or nude mice. David B. Weiner and colleagues (Patel and Weiner 2019 2017 The other method is T cell depletion, a well-established immunological technique. Transient immune suppression in mice can be achieved through administration of anti-CD4 and anti-CD8 monoclonal antibodies. Ami Patel et al. used the mouse infection model to carry out the in vivo transfer test of anti-Ebola virus DNA-encoded monoclonal antibodies, and used the method of T cell depletion to transiently suppress host immune responses at the early stage of DMAb injection, thus avoiding the murine anti-human antibody reaction. Within 14–21 days, the mouse immune cell function returned to baseline levels, and the antibody gene was expressed for a long time. In the control group without T cell depletion eveloped robust anti-drug antibody responses within 14 days post-DMAb administration, resulting in rapid decline of therapeutic antibody titers (Patel et al. 1982 Methods to enhance the protection effect Antibody gene transfer strategy, particularly DMAb technology, is emerging as a pivotal strategy in the treatment and prevention of infectious diseases. Researchers have adopted corresponding strategies to improve and enhance the protection effect of DMAb. For anti-virus infection, DMAb technology can be used to deliver antibody cocktails targeting either multiple viral variants or distinct conserved epitopes. To address the antigenic variability resulting from HIV-1’s error-prone reverse transcription, Megan C. Wise et al. co-delivered multiple monoclonal antibodies in a single mouse through DMAb technology to target different HIV-1 envelope epitopes (Wise et al. 2020 NCT03205917 2022 DMAb technology, supported by electroporation technology in vivo, can realize rapid expression without requiring antigen-mediated immune stimulation, functioning as an “emergency vaccine” and when combined with conventional DNA vaccines, it achieves both rapid and durable immune responses against specific pathogens. Hyeree Choi et al. demonstrated that combining anti-Zika DMAb and DNA vaccine in A129 mice achieved 90% protection within 2 days and 100% protection by 2 weeks, confirming rapid and durable immunity against viral challenge (Choi et al. 2020 2020 Controllable expression of antibody genes Beyond bypassing complex manufacturing, nucleic acid-delivered antibodies offer a fundamental advantage over conventional formats: programmable in vivo expression control. This capability is inherently enabled by the nucleic acid delivery platform itself, as engineered regulatory elements (e.g. tissue-specific promoters, degrons) can be co-encoded within the same vector. Precision temporal and spatial control of antibody expression mitigates risks of overdosing/underdosing and reduces immunogenicity from ectopic expression-issues inherent to recombinant protein therapy. Critically, this programmability allows dynamic adjustment to patient-specific factors (e.g. disease progression, metabolic clearance), optimizing efficacy while broadening therapeutic applicability. Thus, advancing controllable expression and targeted degradation is essential to realizing the clinical potential of nucleic acid-encoded antibodies, addressing key translational barriers including expression durability, safety thresholds, and personalized dosing regimens. Inducible promoter subsystem The inducible promoter subsystem represent a well-established approach for controlled protein expression, enabling transcriptional activation or repression via specific molecular inducers. Common inducible promoter subsystems include the gene regulation system based on exon skipping. Cripe et al. developed an inducible gene therapy system (TransSkip) by engineering a defective KRAS exon flanked by spliceable introns into the αCD19-αCD3 bispecific antibody transgene. This exon, containing stop codons, silences the transgene until a complementary morpholino induces exon skipping, restoring functional antibody expression. In murine models, repeated morpholino administration achieved cyclical, on-demand antibody production for over 36 weeks, enabling tumor suppression in CD19 + Figure 1 2022 Figure 1. Schematic diagram of controllable antibody expression using exon skipping. Morpholino induces abnormal cleavage of the exon of the KRAS gene containing a terminator. The antibody gene is normally transcribed and translated to form a functional protein. When there is no inducer, the normal cleavage of the exon of the KRAS gene is retained. The presence of the stop codon leads to abnormal translation of the antibody gene, and the misfolding of the protein is degraded. Figure 1 Targeted protein degradation system The control of antibody molecules expressed in vivo can be achieved through targeted protein degradation (TPD) technology. This technology uses two naturally existing protein degradation systems in cells: the ubiquitin proteasome system (UPS) and lysosomal degradation pathway to achieve specific and efficient degradation of disease related proteins and therapeutic antibodies when required ( Table 4 Table 4. Comparison of the performance of two protein degradation systems.  UPS-Based system (PROTACs) Lysosome-Based system (LYTACs) Targeting Intracellular soluble proteins (kinases, nuclear receptors). Membrane proteins, extracellular proteins, and some intracellular proteins (via endocytosis). Specificity High, but limited by E3 ligase expression. High, especially with tissue-specific lysosomal receptors. Efficiency Fast (hours), but varies with target protein structure. Slower (hours to days), but effective for large complexes. Clinical risks Potential off-target ubiquitination; chemical toxicity risks. Potential bystander degradation; immunogenicity risks with antibody conjugates. Targeted protein degradation system based on UPS Ubiquitin-mediated degradation pathways provide critical tools for controlling the half-life of nucleic acid-encoded antibodies. Among these, proteolysis-targeting chimeras (PROTACs) represent clinically advanced bifunctional molecules that bridge target proteins to E3 ubiquitin ligases, triggering proteasomal degradation (Li and Crews 2022 Figure 2 2022 2022 Figure 2. Protein degradation mechanism of PROTAC E1-activating enzyme activates ubiquitin and transfers it to E2-binding enzyme; ①the enzyme E1 adhered to the cys residue in the tail of ubiquitin molecule to activate ubiquitin in the presence of ATP energy; ②E1 transfers the activated ubiquitin molecule to the E2 enzyme; ③the other ligand combines with the E3 ligase, a POI-PROTAC-E3 ligase ternary complex is formed; ④E3 ligase then mediates the ubiquitination of POI through E2-binding enzymes; ⑤the ubiquitin-labeled POI is specifically identified and selectively degraded through the proteasome and the ternary complex disintegrates. Figure 2 Targeted protein degradation technology based on lysosomal pathway Lysosomes degrade proteins mainly through three ways (Zhao et al. 2022 Figure 3 2023 Figure 3. Protein degradation via three distinct lysosome pathways; ①cell surface proteins reach endosome through endocytosis, and then are degraded by lysosomes, or transported to plasma membrane or other organelles for recycling; ②the misfolded or aggregated proteins, damaged organelles and intracellular pathogens form autophagosomes and then are transported to lysosomes for degradation; ③the cells engulf the invading pathogens, dead cells and other large extracellular particles to form phagophare and transport them to lysosomes for degradation. Figure 3 TPD technology offers novel avenues for drug discovery and therapeutic intervention across various diseases, including cancer, immune disorders, and neurodegenerative conditions (Békés et al. 2022 2021 2024 CRISPR/Cas9-mediated gene expression regulation The CRISPR/Cas9 system is a versatile tool used not only for gene editing but also for regulating gene expression. Its mechanism relies on specifically designed single-guide RNA (sgRNA) to direct Cas9 protein to bind to the promoter region of a target gene, thereby activating or inhibiting gene expression. For CRISPR activation (CRISPRa), dead Cas9 (dCas9) is fused to a transcriptional activator-like VP64 to induce expression (Liu et al. 2023 2024 2024 Nucleic acid-encoded antibody relevant clinical experiments At present, most studies on antibody expression in vivo are still in the experimental and preclinical stages, and only a few have entered clinical trials. At present, Phase I clinical trials have been reported for the three antibody encoding platforms (Schnepp and Johnson 2014 ® Expectation The monoclonal antibody therapy is one of the most rapidly expanding domains in biopharmaceuticals. While extensive knowledge has been accumulated regarding recombinant mAb production and protein-based applications. However, only a few of the more than 70 licensed mAbs are targeted at infectious diseases, such as oblitoxaximab and raxibacumab for anthrax infection, and pallivizumab for respiratory syncytial virus. This is obviously not in direct proportion to its huge therapeutic potential, because in the case of antibiotic failure or absence of antiviral drugs, monoclonal antibodies are a powerful alternative to fighting infectious diseases (Schnepp and Johnson 2014 2020 Conclusion The clinical potential of nucleic acid-encoded antibodies is substantial. The ongoing clinical trials and the continuous refinements of delivery platforms and antibody technologies are expected to further enhance the safety and efficacy of these therapies. Beyond the immediate goal of phase-II/III validation, three under-explored avenues are poised to define the next decade of nucleic-acid antibody therapy. (i) Personalized, “made-for-patient” formats: coupling single-B-cell repertoire mining with rapid DNA microarray synthesis now enables the design of patient-specific antibody sequences within 7–10 days; integrating these sequences into lipid nanoparticles or AAV vectors tailored to individual HLA haplotypes could create on-demand therapies for ultra-rare infections or refractory cancers. (ii) Combination regimens that exploit spatial and temporal control: layering inducible promoters, miRNA sensor cassettes and protein degradation tags onto the same construct will allow simultaneous or sequential expression of multi-specific antibodies (e.g. anti-PD-1 + anti-CTLA-4) in response to tumor-specific cues, while keeping systemic exposure below toxicity thresholds. (iii) Pan-pathogen rapid response platforms: establishing a plug-and-play library of validated vectors carrying neutralizing antibody cassettes against viral surface “consensus epitopes” would permit real-time swapping of payloads during pandemic outbreaks, analogous to annual influenza vaccine strain updates but achievable in weeks rather than months. Addressing these directions will require tighter integration of machine-learning-guided epitope prediction, scalable GMP-grade vector production, and adaptive regulatory pathways-yet the modular nature of nucleic-acid antibodies uniquely positions the field to meet these challenges. In conclusion, the nucleic acid-encoded antibody gene transfer represents a significant advancement in the field of biopharmaceuticals. While challenges persist, the continuous innovation and versatility of this technology are set to expand its clinical horizons, offering new hope for patients and new avenues for therapeutic intervention. Acknowledgments Conceptualization, Kaikai Yu, Xiao Geng, Baichuan Chen, Na Xu, and Wensen Liu; Resources, Kaikai Yu and Baichuan Chen; Data curation, Kaikai Yu, Xiao Geng and Baichuan Chen; Visualization, Xiao Geng; Writing–original draft, Kaikai Yu and Xiao Geng; Writing–review & editing, Na Xu and Baichuan Chen. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement Data is provided within the manuscript or supplementary information files. References Alberer M et al. 2017 Safety and immunogenicity of a mRNA rabies vaccine in healthy adults: an open-label, non-randomised, prospective, first-in-human phase 1 clinical trial Lancet 390 10101 1511 1520 10.1016/S0140-6736(17)31665-3 28754494 Amante DH et al. 2015 Skin transfection patterns and expression kinetics of electroporation-enhanced plasmid delivery using the CELLECTRA-3P, a portable next-generation dermal electroporation device Hum Gene Ther Methods 26 4 134 146 10.1089/hgtb.2015.020 26222896 PMC5206769 Amirian R et al. 2023 Targeted protein modification as a paradigm shift in drug discovery Eur J Med Chem 260 115765 10.1016/j.ejmech.2023.115765 37659194 Ashkar AA Rosenthal KL. 2002 Toll-like receptor 9, CpG DNA and innate immunity Curr Mol Med 2 6 545 556 10.2174/1566524023362159 12243247 Athanasopoulos T Munye MM Yáñez-Muñoz RJ. 2017 Nonintegrating Gene Therapy Vectors Hematol Oncol Clin North Am 31 5 753 770 10.1016/j.hoc.2017.06.007 28895845 Baldo BA. 2016 Approved biologics used for therapy and their adverse effects Springer International Publishing Banerjee D et al. 2024 Lineage specific transcription factor waves reprogram neuroblastoma from self-renewal to differentiation Nat Commun 15 1 3432 10.1038/s41467-024-47166-y 38653778 PMC11039666 Beissert T et al. 2020 A trans-amplifying RNA vaccine strategy for induction of potent protective immunity Mol Ther 28 1 119 128 10.1016/j.ymthe.2019.09.009 31624015 PMC6953774 Békés M Langley DR Crews CM. 2022 PROTAC targeted protein degraders: the past is prologue Nat Rev Drug Discov 21 3 181 200 10.1038/s41573-021-00371-6 35042991 PMC8765495 Bian X et al. 2025 Emerging delivery systems for enabling precision nucleic acid therapeutics ACS Nano 19 4 4039 4083 10.1021/acsnano.4c11858 39834294 Blakney AK Ip S Geall AJ. 2021 An Update on Self-Amplifying mRNA Vaccine Development Vaccines 9 2 10.3390/vaccines9020097 PMC7911542 33525396 Bogdanenko EV Sviridov Iu V Moskovtsev AA Zhdanov RI. 2000 [Nonviral gene transfer in vivo in gene therapy] Vopr Med Khim 46 3 226 245 11033883 Brinkmann U Kontermann RE. 2017 The making of bispecific antibodies MAbs 9 2 182 212 10.1080/19420862.2016.1268307 28071970 PMC5297537 Casini A Storch M Baldwin GS Ellis T. 2015 Bricks and blueprints: methods and standards for DNA assembly Nat Rev Mol Cell Biol 16 9 568 576 10.1038/nrm4014 26081612 Chandler RJ et al. 2015 Vector design influences hepatic genotoxicity after adeno-associated virus gene therapy J Clin Invest 125 2 870 880 10.1172/JCI79213 25607839 PMC4319425 Chen Y et al. 2022 Proteolysis-targeting chimera (PROTAC) delivery system: advancing protein degraders towards clinical translation Chem Soc Rev 51 13 5330 5350 10.1039/d1cs00762a 35713468 PMC9382890 Chen Y et al. 2023 [Single chain antibody fragment display systems: a review] Sheng Wu Gong Cheng Xue Bao 39 9 3681 3694 10.13345/j.cjb.220911 37805846 Choi H et al. 2020 Synthetic nucleic acid antibody prophylaxis confers rapid and durable protective immunity against Zika virus challenge Hum Vaccin Immunother 16 4 907 918 10.1080/21645515.2019.1688038 31799896 PMC7227701 Clift D et al. 2017 A method for the acute and rapid degradation of endogenous proteins Cell 171 7 1692 1706.e18 10.1016/j.cell.2017.10.033 29153837 PMC5733393 Copin R Jr. et al. 2021 The monoclonal antibody combination REGEN-COV protects against SARS-CoV-2 mutational escape in preclinical and human studies Cell 184 15 3949 3961.e11 10.1016/j.cell.2021.06.002 34161776 PMC8179113 Cripe TP et al. 2022 Leveraging gene therapy to achieve long-term continuous or controllable expression of biotherapeutics Sci Adv 8 28 eabm1890 10.1126/sciadv.abm1890 35857488 PMC9278853 Darquet AM Cameron B Wils P Scherman D Crouzet J. 1997 A new DNA vehicle for nonviral gene delivery: supercoiled minicircle Gene Ther 4 12 1341 1349 10.1038/sj.gt.3300540 9472558 Deal CE Carfi A Plante OJ. 2021 Advancements in mRNA Encoded Antibodies for Passive Immunotherapy Vaccines (Basel) 9 2 10.3390/vaccines9020108 PMC7910832 33572679 Domostegui A Nieto-Barrado L Perez-Lopez C Mayor-Ruiz C. 2022 Chasing molecular glue degraders: screening approaches Chem Soc Rev 51 13 5498 5517 10.1039/d2cs00197g 35723413 Duan D. 2023 Lethal immunotoxicity in high-dose systemic AAV therapy Mol Ther 31 11 3123 3126 10.1016/j.ymthe.2023.10.015 37822079 PMC10638066 Ehrenmann F Lefranc MP. 2012 IMGT/DomainGapAlign: the IMGT ® Methods Mol Biol 882 605 633 10.1007/978-1-61779-842-9_33 22665257 Ertl HCJ. 2022 Immunogenicity and toxicity of AAV gene therapy Front Immunol 13 975803 10.3389/fimmu.2022.975803 36032092 PMC9411526 Eygeris Y Gupta M Kim J Sahay G. 2022 Chemistry of Lipid Nanoparticles for RNA Delivery Acc Chem Res 55 1 2 12 10.1021/acs.accounts.1c00544 34850635 Flingai S et al. 2015 Protection against dengue disease by synthetic nucleic acid antibody prophylaxis/immunotherapy Sci Rep 5 1 12616 10.1038/srep12616 26220099 PMC4518257 Fraiman J et al. 2022 Serious adverse events of special interest following mRNA COVID-19 vaccination in randomized trials in adults Vaccine 40 40 5798 5805 10.1016/j.vaccine.2022.08.036 36055877 PMC9428332 Friedmann T. 1992 A brief history of gene therapy Nat Genet 2 2 93 98 10.1038/ng1092-93 1303270 Germain RN Malissen B. 1986 Analysis of the expression and function of class-II major histocompatibility complex-encoded molecules by DNA-mediated gene transfer Annu Rev Immunol 4 1 281 315 10.1146/annurev.iy.04.040186.001433 3518745 Guilleman MM et al. 2023 AAV-mediated delivery of actoxumab and bezlotoxumab results in serum and mucosal antibody concentrations that provide protection from C. difficile toxin challenge Gene Ther 30 5 455 462 10.1038/s41434-021-00236-y 33608675 Guimarães LE Baker B Perricone C Shoenfeld Y. 2015 Vaccines, adjuvants and autoimmunity Pharmacol Res 100 190 209 10.1016/j.phrs.2015.08.003 26275795 PMC7129276 Hadj Hassine I. 2022 Covid-19 vaccines and variants of concern: a review Rev Med Virol 32 4 e2313 10.1002/rmv.2313 34755408 PMC8646685 Han VX et al. 2022 Emerging evidence of Toll-like receptors as a putative pathway linking maternal inflammation and neurodevelopmental disorders in human offspring: a systematic review Brain Behav Immun 99 91 105 10.1016/j.bbi.2021.09.009 34562595 Hareendran S et al. 2013 Adeno-associated virus (AAV) vectors in gene therapy: immune challenges and strategies to circumvent them Rev Med Virol 23 6 399 413 10.1002/rmv.1762 24023004 Hinderer C et al. 2018 Severe toxicity in nonhuman primates and piglets following high-dose intravenous administration of an adeno-associated virus vector expressing human SMN Hum Gene Ther 29 3 285 298 10.1089/hum.2018.015 29378426 PMC5865262 Ho DT et al. 2009 Growth inhibition of an established A431 xenograft tumor by a full-length anti-EGFR antibody following gene delivery by AAV Cancer Gene Ther 16 2 184 194 10.1038/cgt.2008.68 18758433 Hollevoet K et al. 2019 Bridging the clinical gap for DNA-based antibody therapy through translational studies in sheep Hum Gene Ther 30 11 1431 1443 10.1089/hum.2019.128 31382777 Hollevoet K Declerck PJ. 2017 State of play and clinical prospects of antibody gene transfer J Transl Med 15 1 131 10.1186/s12967-017-1234-4 28592330 PMC5463339 Horn S Fehse B. 2024 How safe is gene therapy?: second death after Duchenne therapy] Inn Med (Heidelb) 65 6 617 623 10.1007/s00108-024-01711-5 38748280 Huang X Liu S Wu L Jiang M Hou Y. 2018 High throughput single cell RNA sequencing, Bioinformatics Analysis and Applications Adv Exp Med Biol 1068 33 43 10.1007/978-981-13-0502-3_4 29943294 Jeck WR et al. 2013 Circular RNAs are abundant, conserved, and associated with ALU repeats RNA 19 2 141 157 10.1261/rna.035667.112 23249747 PMC3543092 Jimenez DG Sebastiano MR Caron G Ermondi G. 2021 Are we ready to design oral PROTACs ® Admet Dmpk 9 4 243 254 10.5599/admet.1037 35300370 PMC8920102 Kim J Eygeris Y Gupta M Sahay G. 2021 Self-assembled mRNA vaccines Adv Drug Deliv Rev 170 83 112 10.1016/j.addr.2020.12.014 33400957 PMC7837307 Köhler G Milstein C. 1975 Continuous cultures of fused cells secreting antibody of predefined specificity Nature 256 5517 495 497 10.1038/256495a0 1172191 Kulasekararaj AG et al. 2019 Ravulizumab (ALXN1210) vs eculizumab in C5-inhibitor-experienced adult patients with PNH: the 302 study Blood 133 6 540 549 10.1182/blood-2018-09-876805 30510079 PMC6368201 Kulkarni JA et al. 2021 The current landscape of nucleic acid therapeutics Nat Nanotechnol 16 6 630 643 10.1038/s41565-021-00898-0 34059811 Lewis AD Chen R Montefiori DC Johnson PR Clark KR. 2002 Generation of neutralizing activity against human immunodeficiency virus type 1 in serum by antibody gene transfer J Virol 76 17 8769 8775 10.1128/jvi.76.17.8769-8775.2002 12163597 PMC136414 Li K Crews CM. 2022 PROTACs: past, present and future Chem Soc Rev 51 12 5214 5236 10.1039/d2cs00193d 35671157 PMC10237031 Li X Song Y. 2020 Proteolysis-targeting chimera (PROTAC) for targeted protein degradation and cancer therapy J Hematol Oncol 13 1 50 10.1186/s13045-020-00885-3 32404196 PMC7218526 Liu B et al. 2021 AAV-containing exosomes as a novel vector for improved gene delivery to lung cancer cells Front Cell Dev Biol 9 707607 10.3389/fcell.2021.707607 34485293 PMC8414974 Liu C Zhang N. 2012 Emerging biotechnological strategies for non-viral antiangiogenic gene therapy Angiogenesis 15 4 521 542 10.1007/s10456-012-9295-8 22890617 Liu J et al. 2023 CRISPR-assisted transcription activation by phase-separation proteins Protein Cell 14 12 874 887 10.1093/procel/pwad013 36905356 PMC10691850 Liu Y Huang H. 2018 Expression of single-domain antibody in different systems Appl Microbiol Biotechnol 102 2 539 551 10.1007/s00253-017-8644-3 29177623 Lou H Cao X. 2022 Antibody variable region engineering for improving cancer immunotherapy Cancer Commun 42 9 804 827 10.1002/cac2.12330 PMC9456695 35822503 Lv F et al. 2011 Adeno-associated virus-mediated anti-DR5 chimeric antibody expression suppresses human tumor growth in nude mice Cancer Lett 302 2 119 127 10.1016/j.canlet.2011.01.001 21306822 Mahboob T et al. 2023 Development of SARS-CoV-2 Vaccine: challenges and Prospects Diseases 11 2 64 10.3390/diseases11020064 37092446 PMC10123684 Mandizvo T et al. 2022 Subtle longitudinal alterations in Env sequence potentiate differences in sensitivity to broadly neutralizing antibodies following acute HIV-1 subtype C infection J Virol 96 24 e0127022 10.1128/jvi.01270-22 36453881 PMC9769376 Maruggi G Ulmer JB Rappuoli R Yu D. 2022 Self-amplifying mRNA-Based Vaccine Technology and Its Mode of Action Curr Top Microbiol Immunol 440 31 70 10.1007/82_2021_233 33861374 McKeage K. 2019 Ravulizumab: first global approval Drugs 79 3 347 352 10.1007/s40265-019-01068-2 30767127 Memczak S et al. 2013 Circular RNAs are a large class of animal RNAs with regulatory potency Nature 495 7441 333 338 10.1038/nature11928 23446348 Moufarrej MN Bianchi DW Shaw GM Stevenson DK Quake SR. 2023 Noninvasive prenatal testing using circulating DNA and RNA: advances, challenges, and possibilities Annu Rev Biomed Data Sci 6 1 397 418 10.1146/annurev-biodatasci-020722-094144 37196360 PMC10528197 Muripiti V et al. 2024 Targeted gene delivery through receptors with lipid nanoparticles J Drug Delivery Sci Technol 93 105457 10.1016/j.jddst.2024.105457 Muyldermans S. 2013 Nanobodies: natural single-domain antibodies Annu Rev Biochem 82 1 775 797 10.1146/annurev-biochem-063011-092449 23495938 Naso MF Tomkowicz B Perry WL 3rd Strohl WR. 2017 Adeno-Associated Virus (AAV) as a Vector for Gene Therapy BioDrugs 31 4 317 334 10.1007/s40259-017-0234-5 28669112 PMC5548848 Nguyen GN et al. 2021 A long-term study of AAV gene therapy in dogs with hemophilia A identifies clonal expansions of transduced liver cells Nat Biotechnol 39 1 47 55 10.1038/s41587-020-0741-7 33199875 PMC7855056 Nieto K Salvetti A. 2014 AAV vectors vaccines against infectious diseases Front Immunol 5 5 10.3389/fimmu.2014.00005 24478774 PMC3896988 Niu D Wu Y Lian J. 2023 Circular RNA vaccine in disease prevention and treatment Signal Transduct Target Ther 8 1 341 10.1038/s41392-023-01561-x 37691066 PMC10493228 O’Neill LA Sheedy FJ McCoy CE. 2011 MicroRNAs: the fine-tuners of Toll-like receptor signalling Nat Rev Immunol 11 3 163 175 10.1038/nri2957 21331081 Pagant S Liberatore RA. 2021 In vivo electroporation of plasmid DNA: a promising strategy for rapid, inexpensive, and flexible delivery of anti-viral monoclonal antibodies Pharmaceutics 13 11 1882 10.3390/pharmaceutics13111882 34834297 PMC8618954 Palmer CD et al. 2022 Individualized, heterologous chimpanzee adenovirus and self-amplifying mRNA neoantigen vaccine for advanced metastatic solid tumors: phase 1 trial interim results Nat Med 28 8 1619 1629 10.1038/s41591-022-01937-6 35970920 Pardi N Hogan MJ Porter FW Weissman D. 2018 mRNA vaccines - a new era in vaccinology Nat Rev Drug Discov 17 4 261 279 10.1038/nrd.2017.243 29326426 PMC5906799 Parzych EM et al. 2022 DNA-delivered antibody cocktail exhibits improved pharmacokinetics and confers prophylactic protection against SARS-CoV-2 Nat Commun 13 1 5886 10.1038/s41467-022-33309-6 36202799 PMC9537531 Patel A et al. 1982 In vivo delivery of synthetic human DNA-encoded monoclonal antibodies protect against ebolavirus infection in a mouse model Cell Rep 25 2018 1993 19e4 10.1016/j.celrep.2018.10.062 PMC6319964 30428362 Patel A et al. 2017 An engineered bispecific DNA-encoded IgG antibody protects against Pseudomonas aeruginosa in a pneumonia challenge model Nat Commun 8 1 637 10.1038/s41467-017-00576-7 28935938 PMC5608701 Patel A Bah MA Weiner DB. 2020 In vivo delivery of nucleic acid-encoded monoclonal antibodies BioDrugs 34 3 273 293 10.1007/s40259-020-00412-3 32157600 PMC7211204 Patel A Weiner DB. 2019 It takes a matured mAb to treat ebolavirus infection Cell Host Microbe 25 1 10 12 10.1016/j.chom.2018.12.013 30629912 Perdomo J et al. 2019 Neutrophil activation and NETosis are the major drivers of thrombosis in heparin-induced thrombocytopenia Nat Commun 10 1 1322 10.1038/s41467-019-09160-7 30899022 PMC6428879 Petkovic S Müller S. 2015 RNA circularization strategies in vivo and in vitro Nucleic Acids Res 43 4 2454 2465 10.1093/nar/gkv045 25662225 PMC4344496 Qu L et al. 2022 Circular RNA vaccines against SARS-CoV-2 and emerging variants Cell 185 10 1728 1744.e16 10.1016/j.cell.2022.03.044 35460644 PMC8971115 Rej RK Roy J Allu SR. 2024 Therapies for the treatment of advanced/metastatic estrogen receptor-positive breast cancer: current situation and future directions Cancers (Basel) 16 3 552 10.3390/cancers16030552 38339303 PMC10854569 Robert MA et al. 2018 Gene transfer of ZMapp antibodies mediated by recombinant adeno-associated virus protects against ebola infections Hum Gene Ther 29 4 452 466 10.1089/hum.2017.101 29179602 Rossotti MA Bélanger K Henry KA Tanha J. 2022 Immunogenicity and humanization of single-domain antibodies Febs J 289 14 4304 4327 10.1111/febs.15809 33751827 Salzman J Chen RE Olsen MN Wang PL Brown PO. 2013 Cell-type specific features of circular RNA expression PLoS Genet 9 9 e1003777 10.1371/journal.pgen.1003777 24039610 PMC3764148 Sanz L Álvarez-Vallina L. 2021 Engineered mRNA and the Rise of Next-Generation Antibodies Antibodies (Basel) 10 4 10.3390/antib10040037 PMC8544192 34698057 Schmidt C Schnierle BS. 2023 Self-amplifying RNA vaccine candidates: alternative platforms for mRNA vaccine development Pathogens 12 1 138 10.3390/pathogens12010138 36678486 PMC9863218 Schnepp BC Johnson PR. 2014 Vector-mediated in vivo antibody expression Microbiol Spectr 2 4 AID 10.1128/microbiolspec.AID-0016-2014 26104192 Schommer NN et al. 2019 Active Immunoprophylaxis and Vaccine Augmentations Mediated by a Novel Plasmid DNA Formulation Hum Gene Ther 30 4 523 533 10.1089/hum.2018.241 30860399 PMC6479233 Stadler CR et al. 2017 Erratum: elimination of large tumors in mice by mRNA-encoded bispecific antibodies Nat Med 23 10 1241 1241 10.1038/nm1017-1241d 28985209 Tang H Gao Y Han J. 2023 Application progress of the single domain antibody in medicine Int J Mol Sci 24 10.3390/ijms24044176 PMC9967291 36835588 Teran RA et al. 2020 632 638 10.15585/mmwr.mm7017e1 PMC8084122 33914721 Thorner AR et al. 2006 Age dependence of adenovirus-specific neutralizing antibody titers in individuals from sub-Saharan Africa J Clin Microbiol 44 10 3781 3783 10.1128/JCM.01249-06 17021110 PMC1594810 Tursi NJ et al. 2022 Engineered DNA-encoded monoclonal antibodies targeting Plasmodium falciparum circumsporozoite protein confer single dose protection in a murine malaria challenge model Sci Rep 12 1 14313 10.1038/s41598-022-18375-6 35995959 PMC9395511 Van Hoecke L et al. 2021 mRNA in cancer immunotherapy: beyond a source of antigen Mol Cancer 20 1 48 10.1186/s12943-021-01329-3 33658037 PMC7926200 van Lieshout LP et al. 2022 AAV-monoclonal antibody expression protects mice from Ebola virus without impeding the endogenous antibody response to heterologous challenge Mol Ther Methods Clin Dev 26 505 518 10.1016/j.omtm.2022.08.003 36092367 PMC9436706 Vázquez-Rey M Lang DA. 2011 Aggregates in monoclonal antibody manufacturing processes Biotechnol Bioeng 108 7 1494 1508 10.1002/bit.23155 21480193 Venkatraman N et al. 2017 Safety and immunogenicity of heterologous prime-boost immunization with viral-vectored malaria vaccines adjuvanted with Matrix-M ™ Vaccine 35 45 6208 6217 10.1016/j.vaccine.2017.09.028 28941620 Verbeke R Hogan MJ Loré K Pardi N. 2022 Innate immune mechanisms of mRNA vaccines Immunity 55 11 1993 2005 10.1016/j.immuni.2022.10.014 36351374 PMC9641982 Vogels R et al. 2003 Replication-deficient human adenovirus type 35 vectors for gene transfer and vaccination: efficient human cell infection and bypass of preexisting adenovirus immunity J Virol 77 15 8263 8271 10.1128/jvi.77.15.8263-8271.2003 12857895 PMC165227 Wagner JT et al. 2024 Influence of AAV vector tropism on long-term expression and Fc-γ receptor binding of an antibody targeting SARS-CoV-2 Commun Biol 7 1 865 10.1038/s42003-024-06529-3 39009807 PMC11250830 Wang G et al. 2010 Persistent expression of biologically active anti-HER2 antibody by AAVrh.10-mediated gene transfer Cancer Gene Ther 17 8 559 570 10.1038/cgt.2010.11 20448672 PMC2906671 Wang Y et al. 2021 mRNA Delivery of a Bispecific Single-Domain Antibody to Polarize Tumor-Associated Macrophages and Synergize Immunotherapy against Liver Malignancies Adv Mater 33 23 e2007603 10.1002/adma.202007603 33945178 PMC8240965 Wei J Yang Y Wang G Liu M. 2022 Current landscape and future directions of bispecific antibodies in cancer immunotherapy Front Immunol 13 1035276 10.3389/fimmu.2022.1035276 36389699 PMC9650279 Wesselhoeft RA Kowalski PS Anderson DG. 2018 Engineering circular RNA for potent and stable translation in eukaryotic cells Nat Commun 9 1 2629 10.1038/s41467-018-05096-6 29980667 PMC6035260 Whitley J et al. 2022 Development of mRNA manufacturing for vaccines and therapeutics: mRNA platform requirements and development of a scalable production process to support early phase clinical trials Transl Res 242 38 55 10.1016/j.trsl.2021.11.009 34871810 PMC8641981 Wise MC et al. 2020 In vivo delivery of synthetic DNA-encoded antibodies induces broad HIV-1-neutralizing activity J Clin Invest 130 2 827 837 10.1172/JCI132779 31697648 PMC6994112 Wolff JA et al. 1990 Direct gene transfer into mouse muscle in vivo Science 247 4949 Pt 1 1465 1468 10.1126/science.1690918 1690918 Wu X Demarest SJ. 2019 Building blocks for bispecific and trispecific antibodies Methods 154 3 9 10.1016/j.ymeth.2018.08.010 30172007 Yi H et al. 2014 A new strategy to deliver synthetic protein drugs: self-reproducible biologics using minicircles Sci Rep 4 1 5961 10.1038/srep05961 25091294 PMC4121613 Yu X Zhang B Zhang LQ Wu X. 2022 The regulatory network involving PcoR, RsaL, and MvaT coordinates the quorum-sensing system in pseudomonas fluorescens 2P24 Appl Environ Microbiol 88 13 e0062522 10.1128/aem.00625-22 35695573 PMC9275216 Zhan W Muhuri M Tai PWL Gao G. 2021 Vectored immunotherapeutics for infectious diseases: can raavs be the game changers for fighting transmissible pathogens? Front Immunol 12 673699 10.3389/fimmu.2021.673699 34046041 PMC8144494 Zhao L Zhao J Zhong K Tong A Jia D. 2022 Targeted protein degradation: mechanisms, strategies and application Signal Transduct Target Ther 7 1 113 10.1038/s41392-022-00966-4 35379777 PMC8977435 Zhou Q et al. 2024 Exosome-mediated delivery of artificial circular RNAs for gene therapy of bladder cancer J Cancer 15 6 1770 1778 10.7150/jca.90620 38370378 PMC10869980 Zhou W et al. 2023 Vaccines’ new era-RNA vaccine Viruses 15 8 1760 10.3390/v15081760 37632102 PMC10458896 ",
  "metadata": {
    "Title of this paper": "Vaccines’ new era-RNA vaccine",
    "Journal it was published in:": "Drug Delivery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490374/"
  }
}