{
  "title": "Paper_1192",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467119 PMC12467119.1 12467119 12467119 41007734 10.3390/biomedicines13092169 biomedicines-13-02169 1 Review Dexamethasone Suppression Testing in Patients with Adrenal Incidentalomas with/Without Mild Autonomous Cortisol Secretion: Spectrum of Cortisol Cutoffs and Additional Assays (An Updated Analysis) Trandafir Alexandra-Ioana 1 * https://orcid.org/0000-0001-8585-3835 Carsote Mara 2 3 * Kita Toshihiro Academic Editor 1 2 3 * alexandra-ioana.trandafir@drd.umfcd.ro carsote_m@hotmail.com 05 9 2025 9 2025 13 9 497614 2169 08 8 2025 01 9 2025 03 9 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objective Methods n n n n Results n n n n n n n n p p p n 2 p n n n n n n n Conclusions endocrine neoplasia hormone endocrine testing cortisol ACTH hypertension diabetes endocrine tumor adrenal cutoff This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Dexamethasone, a potent synthetic glucocorticoid, is routinely used to assess the hypothalamic-pituitary-adrenal (HPA) axis in daily endocrine practice [ 1 1 2 3 2 4 5 6 Over time, several diagnosis criteria for MACS have been proposed, being centered on the lack of serum cortisol suppression amid DST with various cutoffs (currently, being agreed for a value higher than 1.8 and lower than 5 µg/dL, in the absence of the clinical phenotype highly suggestive for Cushing’s syndrome). 1-mg DST is the mostly used dosage for the primary screening, alternatively, 2 days of 2 mg dexamethasone testing may be applied in selected cases (0.5 mg of dexamethasone 6-hourly for 48 h, with blood cortisol assays at baseline and after 48 h), being named low-dose dexamethasone suppression test (LDDST) [ 7 8 9 In addition, the diagnosis of MACS might be suggested by a decreased or low-normal basal morning plasma adrenocorticotropic hormone (ACTH), an elevated midnight serum cortisol or late-night salivary cortisol (LNSC), and/or an increased urinary free cortisol (UFC), which otherwise are not currently regarded as standard diagnosis criteria, as opposite to DST [ 9 10 11 Advancements in imaging tools, increased utilization of different imaging procedures, and prolonged life span in certain populations had generally contributed to a rise in the detection of incidentalomas, including at the level of adrenal glands (AIs) [ 12 13 14 15 16 MACS-positive profile represents the most common hormonal abnormality in AIs, affecting from 1% to 29–35% of all these tumors (the ranges depend on the diagnosis criteria and the characteristics of the study population) [ 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 Furthermore, an adequate lab and imaging diagnosis should be followed by an adequate management. However, the most effective treatment for MACS-positive neoplasia embraces a large spectrum, varying from long term conservative approach (while managing MACS-related comorbidities, e.g., diabetes, hypertension, osteoporosis, etc.); “wait-and-see” approach (meaning to indicate surgery in case of a novel complication or worsening of the baseline clinical features e.g., new fractures, lack of response to usual anti-hypertensive or anti-diabetic drugs); adrenalectomy decision solely based on the tumor size (e.g., larger than 4 cm) or adrenal removal in each MACS-positive patient [ 31 32 33 Objective This analysis aimed to evaluate the diagnosis relevance of 1-mg DST in patients with NFAs/MACS exploring different cutoffs of the second-day morning plasma cortisol after dexamethasone administration with respect to the cardio-metabolic outcomes, the importance of adding supplementary biomarkers to DST such as plasma morning ACTH, 24-h UFC, LNSC, DHEAS, as well as DST variability over time (e.g., switch between the three categories: NFA, MACS, or overt Cushing syndrome). 2. Methods This narrative review was conducted based on a targeted literature search of full-text, English-language articles available in PubMed via using the following terms: “dexamethasone suppression test” ( n n n n The final sample-focused analysis ( n n n n n Figure 1 3. Sample-Focused Analysis 3.1. Post-DST Cortisol Cutoffs in Relationship with the Spectrum of Comorbidities Post-DST cortisol cutoffs varied among the studies, being reflected in different risk ratios for cardio-metabolic and renal complications. Overall, we identified six studies to address this specific issue, noting the following cutoffs (in addition to the standard value of 1.8 µg/dL) 0.87, 0.9, 1.2 and 1.4 µg/dL [ 34 35 36 37 38 39 Table 1 In patients diagnosed with MACS-positive tumors, higher post-DST cortisol levels have been correlated with an increased prevalence of cardiovascular risk factors, and drug-resistant hypertension [ 40 41 42 43 38 38 Another cutoff was investigated by Favero et al. [ 37 p p p p p p p p p 37 Güneş et al. [ 39 p p p p p p 39 Notably, MACS-positive tumors might affect kidney function in various ways since comorbidities such as hypertension, diabetes, and dyslipidemia may lead to glomerular damage, albuminuria, and proteinuria [ 44 45 36 2 2 p 2 p 2 p 2 p 36 Olsen et al. [ 35 2 2 2 2 35 Higher pre-operatory values of post-DST cortisol were correlated with lower post-adrenalectomy cortisol in addition to the co-presence of the mentioned comorbidities that potentially improve after tumor removal [ 44 45 46 47 48 49 p p p 34 On short note, post-DST cortisol remains a valuable tool in predicting the panel of MACS-related comorbidities, particularly, of cardio-metabolic type, and other cutoffs than the traditional value of 1.8 µg/dL are under evaluation for their predictive power, while the vast domain of these hormonal assays remains an open issue which we expect to change in the future, probably as multimodal algorithms of diagnosis and further on as a tailored decision-making (conservative vs. surgical). 3.2. DST and Additional Assays The spectrum of additional tests for the diagnosis of endogenous hypercortisolism (other than DST) is heterogeneous and still controversial, noting the importance of their cost-effectiveness, and their availability in daily practice. We identified five studies that analyzed the usefulness of assessing baseline morning ACTH, UFC, LNSC, and DHEAS) [ 50 51 52 53 54 Table 2 3.2.1. Baseline Morning Blood ACTH ACTH assays are commonly used to differentiate between adrenal Cushing’s syndrome Cushing’s disease, but previous studies have not established a definitive cutoff. Efthymiadis et al. [ 51 51 3.2.2. Urinary Steroid Profile Recently, analyzing the steroids spectrum in plasma and urine through liquid chromatography-tandem mass spectrometry (steroid metabolomics) has emerged as a valuable method for supporting the diagnosis of MACS, as used in other adrenal and pituitary ailments and glucocorticoids exposure [ 55 56 57 58 59 60 61 62 63 64 53 p r p r p r p 53 3.2.3. Salivary Cortisone Salivary cortisone has been found as a better diagnosis test than salivary cortisol in adrenal insufficiency [ 65 66 67 68 54 r p 54 3.2.4. DHEAS DHEAS assay might help in MACS identification, DHEAS being an androgen precursor secreted by the adrenal zona reticularis under the dominant regulation of ACTH, thus a relative DHEAS suppression has been described in this type of adrenal neoplasia when accompanied by low or low-normal baseline ACTH levels [ 69 70 50 p 50 Moreover, Al-Waeli et al. [ 52 p p p 52 3.3. DST Results: Variations During Long-Term Surveillance When evaluating newly identified patients with an adrenal mass, the primary goals are to determine whether the lesion is benign or malignant and to evaluate the functionality/hormonal panel [ 71 72 73 74 75 76 38 77 78 38 Table 3 In one study, a subgroup of 73 subjects (representing 22.1% out of 331 patients with NFAs) switched to a MACS-positive profile (defined as post-DST cortisol > 1.8 µg/dL) over a median follow-up of 35.7 months. MACS incidence rates were correlated to post-DST cortisol levels at first evaluation, occurring at 19.2, 32.3, and 68.1 cases per 10,000 person-years for cortisol values of <0.9 µg/dL, 0.9–1.3 µg/dL, and >1.3 µg/dL, respectively. These findings suggested that individuals with a cortisol value below 0.9 µg/dL are at very low risk of switching to MACS and follow-up is probably unnecessary. Subjects with intermediate levels (0.9–1.3 µg/dL) represent a moderate-risk group and may benefit from individualized follow-up strategies, consider repeating DST every two-three years for five years after original diagnosis. Moreover, patients exceeding the level of 1.3 µg/dL require annual re-evaluation for at least five years [ 78 The most effective predictive model for MACS incorporated various parameters such as age, post-DST cortisol, and the presence of bilateral adrenal tumors, showing good diagnosis accuracy (AUC = 0.70, 95% CI: 0.65–0.75). The lowest risk of switching into MACS (2.42%) category was observed in patients under 50 years with unilateral adrenal neoplasia and post-DST cortisol below 0.45 µg/dL. Baseline post-DST cortisol was the strongest predictor of progression to MACS-positive status, with a hazard ratio of 3.56 per µg/dL increase ( p p p p p 78 Another study in 132 patients with AIs (56 men and 76 women; the mean age was of 61.7 ± 10.8 years) assessed clinical abnormalities at baseline and during a mean follow-up of 48.6 ± 12.5 months. Patients underwent evaluation of demographic, anthropometric, biochemical, metabolic, and hormonal data, as well as the 24-h ambulatory blood pressure monitoring. At baseline, subjects with MACS (post-DST cortisol of >1.8 µg/dL) showed a higher diastolic blood pressure, glycaemia, and uric acid levels compared to those with a negative DST. During follow-up, 29% of patients initially classified with NFA developed MACS, although cardiovascular and metabolic changes were less pronounced than in individuals diagnosed with MACS from the start [ 77 p 38 To conclude, post-DST cortisol levels, the panel of comorbidities, patient’s life expectancy, and health resources should all be taken into account in a customized follow-up of AIs, particularly in non-surgery candidates, since potentially a switch of category (from NFA to MACS) might be found. Awareness is required to check once again the cardio-metabolic spectrum during longitudinal observations and decide adrenalectomy in selected cases. Most probably, the model de prediction should be multifactorial, while post-DST cortisol level represents, on one hand, the core of the clinical decision at a certain point in time, and, on the other hand, the acknowledgment of further developing cardio-metabolic consequences, noting that other cutoffs than the traditional one of 1.8 µg/dL might help for a multimodal decision. Overall, the cross-sectional cortisol assay of less than 1.8 µg/dL amidst DST in a newly identified individual with AI might imply a completely distinct meaning if the value is very low (e.g., <0.9 µg/dL) or very close to the 1.8 µg/dL cutoff in terms of associated cardiovascular and metabolic ailments in time and the risk of switching to an active hormonal activity (e.g., MACS-positive profile) [ 38 77 78 4. Discussion Based on our methods, we provided a narrative analysis starting from the results of thirteen studies that addressed DST from various points of view (applying new cortisol cutoffs, the panel of associated cardio-metabolic outcomes, multifactorial models of behavior prediction, and long-term surveillance). DST seems to associate a heterogeneous spectrum of gaps, while the test represents the current (guideline-based) standard [ 34 35 36 37 38 39 50 51 52 53 54 77 78 Figure 2 4.1. The Spectrum of DST: Challenges and Pitfalls Generally, DST accuracy is influenced by numerous factors causing false positive or negative results [ 79 80 81 82 83 84 85 86 87 88 89 90 91 Globally, the aging population is associated with an increased prevalence of AIs that requires DST at diagnosis and during monitoring. Despite physiological changes that occur with age such as altered drugs metabolism, small alterations of HPA axis sensitivity, and cortisol rhythm, DST relies on a standard dose for all adults, which actually might require refining the dose in selected subgroups, for instance, in elderly with obesity, etc. [ 92 93 94 95 96 97 98 99 Of note, the role of imaging tools should be remarked, as well, in MACS characterization among AIs [ 100 101 102 4.2. From DST to MACS: A Modern Pathway, a Traditional Road The importance of correct AIs description/characterization with respect to the hormonal profile includes: a prompt identification of MACS-positive subgroup, understanding the relationship with cardio-metabolic complications (amid transversal and longitudinal DST analysis), an adequate selection of surgery candidates, and the decision of re-assessment in terms of timing and protocol of assays in individuals who are not referred to adrenalectomy. DST represents the most useful tool in assisting the hormonal description since post-DST cortisol values are connected to all these mentioned aspects [ 34 35 36 37 38 39 50 51 52 53 54 77 78 39 p 39 37 37 55 103 104 105 Recently, patients with MACS-positive adrenal tumors were found to exhibit increased choroidal thickness and a higher frequency of pachychoroid pigment epitheliopathy compared to healthy individuals, suggesting that choroidal thickening could serve as a novel biomarker for assessing the panel of related comorbidities [ 106 107 108 109 110 111 46 112 Figure 3 4.3. Current Limits and Further Research The limitations of the current work are represented by the narrative design. We intended to analyze non-restricted (non-systematic) variables/parameters as they are provided by the current studies which greatly vary in terms of design, resources, and protocol. We considered that a broader perspective might cover the mentioned DST spectrum outside the guideline-based approach. The sample size was limited by the single database and timing of search, which was meant to offer an update to the most recent findings in an otherwise traditional topic. Novel approaches such as applying new post-DST cortisol cutoffs, multimodal models of prediction and positioning additional novel biomarkers in daily practice are currently under development and we expect a multilayered expansion of this area due to the increasing number of AIs detection and prolonged lifespan. Notably, the (potential) cortisol excess in AIs might also associate an elevated osteoporotic fracture risk and other osseous complications [ 113 114 115 116 117 118 119 120 121 122 123 103 104 105 124 125 5. Conclusions The importance of exploring the domain of AIs/NFAs/MACS relates to an increasing detection in aging population, hence, the importance of their optimum hormonal characterization and identifying/forestalling cardio-metabolic consequences. DST remains the key tool for identifying MACS amid AIs. Post-DST cortisol serves as an independent predictor of cardio-metabolic outcomes, kidney dysfunction, while adrenalectomy may correct them in both MACS and NFAs, especially in younger population. Moreover, it serves as a predictor of switching the NFA into MACS category during surveillance. Additional biochemical tests, such as ACTH, and DHEAS (and to a lesser extend 24-h UFC, and LNSC) provide valuable supplementary insights, though they are not standardized. These tests can enhance diagnosis accuracy, help the evaluation of the cardio-metabolic risk, and refine the follow-up strategy. Given the variability in their use and the potential for progression of the hormonal category, further research is needed to better define the role of these diagnosis tools and improve patients’ management. Changing the hormonal behavior over time implies awareness, since it increases the overall disease burden. Acknowledgments This is part of PhD research entitled “Evaluation of mineral metabolism and osteoporosis fractural risk in patients with non-functioning adrenal tumors with or without mild autonomous cortisol secretion” at PhD Doctoral School of “Carol Davila” University of Medicine and Pharmacy, Bucharest, Romania (number 28970 from 3 October 2022, research approval 7634 from 4 April 2025). Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.-I.T. and M.C.; methodology, A.-I.T. and M.C.; software, A.-I.T. and M.C.; validation, A.-I.T. and M.C.; formal analysis, A.-I.T. and M.C.; investigation, A.-I.T.; resources, A.-I.T. and M.C.; data curation, A.-I.T. and M.C.; writing—original draft preparation, A.-I.T.; writing—review and editing, M.C.; visualization, A.-I.T. and M.C.; supervision, A.-I.T. and M.C.; project administration, M.C.; funding acquisition, M.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ACTH adrenocorticotropic hormone ACS autonomous cortisol secretion AI adrenal incidentaloma AUC area under the curve BMI body mass index CI confidence interval DHEAS dehydroepiandrosterone sulfate DST 1-mg dexamethasone suppression test eGFR estimated glomerular filtration rate F female FGF Fibroblast Growth Factor HPA hypothalamic-pituitaryadrenal HR hazard ratio IQR interquartile range LNSC late-night salivary cortisol LNSE late-night salivary cortisone LDDST low-dose dexamethasone suppression test MACS mild autonomous cortisol secretion M male NFA non-functioning adrenal adenomas n number of studies N number of patients OR odds ratio ROC Receiver Operating Characteristic SD standard deviation THF tetrahydrocortisol THS tetrahydro-11-deoxycortisol THE tetrahydrocortisone UFC urinary free cortisol vs. versus y years References 1. Asirvatham A.R. Balachandran K. Mahadevan S. Balasubramaniam S.K. Hypothalamic-Pituitary-Adrenal Axis Recovery Following the 1-mg Overnight Dexamethasone Suppression Test in Healthy Volunteers Int. J. Endocrinol. Metab. 2020 18 e94908 10.5812/ijem.94908 32636884 PMC7322672 2. Ferrante E. Simeoli C. Mantovani G. Pivonello R. Who and how to screen for endogenous hypercortisolism in patients with mood disorders J. Endocrinol. Investig. 2025 48 (Suppl. S1) 75 82 10.1007/s40618-024-02457-5 39531206 PMC12031932 3. Carsote M. Valea A. Dumitru N. Terzea D. Petrova E. Albu S. Buruiana A. Ghemigian A. Metastases in daily endocrine practice Arch. Balk. Med. Union 2016 51 476 480 4. Petersenn S. Overnight 1 mg dexamethasone suppression test and 24 h urine free cortisol-accuracy and pitfalls when screening for Cushing’s syndrome Pituitary 2022 25 693 697 10.1007/s11102-022-01249-5 35821308 5. Galm B.P. Qiao N. Klibanski A. Biller B.M.K. Tritos N.A. Accuracy of Laboratory Tests for the Diagnosis of Cushing Syndrome J. Clin. Endocrinol. Metab. 2020 105 dgaa105 10.1210/clinem/dgaa105 32133504 6. Fleseriu M. Auchus R. Bancos I. Ben-Shlomo A. Bertherat J. Biermasz N.R. Boguszewski C.L. Bronstein M.D. Buchfelder M. Carmichael J.D. Consensus on diagnosis and management of Cushing’s disease: A guideline update Lancet Diabetes Endocrinol. 2021 9 847 875 10.1016/S2213-8587(21)00235-7 34687601 PMC8743006 7. Ueland G.Å. Grinde T. Methlie P. Kelp O. Løvås K. Husebye E.S. Diagnostic testing of autonomous cortisol secretion in adrenal incidentalomas Endocr. Connect. 2020 9 963 970 10.1530/EC-20-0419 33032259 PMC7576642 8. Park S.S. Kim J.H. Recent Updates on the Management of Adrenal Incidentalomas Endocrinol. Metab. 2023 38 373 380 10.3803/EnM.2023.1779 PMC10475962 37583083 9. Janiak K. Józwik-Plebanek K. Kamiński G. Recent guidelines for diagnostic and therapeutic management of accidentally detected adrenal tumours (incidentaloma) in adults Endokrynol. Pol. 2024 75 385 394 10.5603/ep.100278 39279307 10. Berndt V. Dahlqvist P. de Verdier J. Ryberg H. Ragnarsson O. The diagnostic value of salivary cortisol and salivary cortisone in patients with suspected hypercortisolism Front. Endocrinol. 2022 13 1028804 10.3389/fendo.2022.1028804 PMC9728582 36506050 11. Carafone L.E. Zhang C.D. Li D. Lazik N. Hamidi O. Hurtado M.D. Young W.F. Jr. Thomas M.A. Dy B.M. Lyden M.L. Diagnostic Accuracy of Dehydroepiandrosterone Sulfate and Corticotropin in Autonomous Cortisol Secretion Biomedicines 2021 9 741 10.3390/biomedicines9070741 34203283 PMC8301396 12. Cuthbertson D.J. Alam U. Davison A.S. Belfield J. Shore S.L. Vinjamuri S. Investigation and assessment of adrenal incidentalomas Clin. Med. 2023 23 135 140 10.7861/clinmed.2023-0042 PMC11046519 36958837 13. Kebebew E. Adrenal incidentaloma N. Engl. J. Med. 2021 384 1542 1551 10.1056/NEJMcp2031112 33882207 14. Bancos I. Prete A. Approach to the Patient With Adrenal Incidentaloma J. Clin. Endocrinol. Metab. 2021 106 3331 3353 10.1210/clinem/dgab512 34260734 PMC8530736 15. Reimondo G. Castellano E. Grosso M. Priotto R. Puglisi S. Pia A. Pellegrino M. Borretta G. Terzolo M. Adrenal Incidentalomas are Tied to Increased Risk of Diabetes: Findings from a Prospective Study J. Clin. Endocrinol. Metab. 2020 105 dgz284 10.1210/clinem/dgz284 31900474 16. Podbregar A. Janez A. Goricar K. Jensterle M. The prevalence and characteristics of non-functioning and autonomous cortisol secreting adrenal incidentaloma after patients’ stratification by body mass index and age BMC Endocr. Disord. 2020 20 118 10.1186/s12902-020-00599-0 32736549 PMC7395413 17. Ebbehoj A. Li D. Kaur R.J. Zhang C. Singh S. Li T. Atkinson E. Achenbach S. Khosla S. Arlt W. Epidemiology of adrenal tumours in Olmsted County, Minnesota, USA: A population-based cohort study Lancet Diabetes Endocrinol. 2020 8 894 902 10.1016/S2213-8587(20)30314-4 33065059 PMC7601441 18. Jing Y. Hu J. Luo R. Mao Y. Luo Z. Zhang M. Yang J. Song Y. Feng Z. Wang Z. Prevalence and Characteristics of Adrenal Tumors in an Unselected Screening Population: A Cross-Sectional Study Ann. Intern. Med. 2022 175 1383 1391 10.7326/M22-1619 36095315 19. Sconfienza E. Tetti M. Forestiero V. Veglio F. Mulatero P. Monticone S. Prevalence of Functioning Adrenal Incidentalomas: A Systematic Review and Meta-analysis J. Clin. Endocrinol. Metab. 2023 108 1813 1823 10.1210/clinem/dgad044 36718682 20. Ichijo T. Ueshiba H. Nawata H. Yanase T. A nationwide survey of adrenal incidentalomas in Japan: The first report of clinical and epidemiological features Endocr. J. 2020 67 141 152 10.1507/endocrj.EJ18-0486 31694993 21. Prete A. Subramanian A. Bancos I. Chortis V. Tsagarakis S. Lang K. Macech M. Delivanis D.A. Pupovac I.D. Reimondo G. Cardiometabolic Disease Burden and Steroid Excretion in Benign Adrenal Tumors: A Cross-Sectional Multicenter Study Ann. Intern. Med. 2022 175 325 334 10.7326/M21-1737 34978855 22. Manea M.M. Dragos D. Ghenu M.I. Enache I.I. Stoican I.C. Ciulavu C. Vasiliu O. Sirbu C.A. Tuta S. The Neurocardiogenic Impact of Ischemic Stroke: Intricacies of Cardiac Enzymes and the Vegetative System Rom. J. Mil. Med. 2025 CXXVIII 36 42 10.55453/rjmm.2025.128.1.5 23. Cassinello J.M.J. Vega-Beyhart A. Iriarte M.B. Donato S. Herrera-Martínez A.D. Marazuela M. Araujo-Castro M. Mild autonomous cortisol secretion: Impact on bone health and quality of life Rev. Endocr. 2025 88 693 700 10.1007/s12020-025-04203-0 39985598 24. Popa F.L. Boicean L.C. Iliescu M.G. Stanciu M. The importance of association between sex steroids deficiency, reduction of bone mineral density and falling risk in men with implications in medical rehabilitation Balneo PRM Res. J. 2021 12 318 322 10.12680/balneo.2021.457 25. Zavatta G. Vicennati V. Altieri P. Tucci L. Colombin G. Coscia K. Mosconi C. Balacchi C. Fanelli F. Malagrinò M. Mild autonomous cortisol secretion in adrenal incidentalomas and risk of fragility fractures: A large cross-sectional study Eur. J. Endocrinol. 2023 188 343 352 10.1093/ejendo/lvad038 36952249 26. Pipernea R. Popa F.L. Ciortea V.M. Irsay L. Ungur R.A. Pintea A.L. Iliescu M.G. Cipăian R.C. Stanciu M. The role of rehabilitation and anabolic treatment in severe osteoporosis associated with significant vitamin D deficiency—Case report Balneo PRM Res. J. 2023 14 539 10.12680/balneo.2023.539 27. Dumitru N. Carsote M. Cocolos A. Petrova E. Olaru M. Dumitrache C. Ghemigian A. The Link Between Bone Osteocalcin and Energy Metabolism in a Group of Postmenopausal Women Curr. Health Sci. J. 2019 45 47 51 10.12865/CHSJ.45.01.06 31297262 PMC6592666 28. Rebelo J.F.D. Costa J.M. Junqueira F.D. Fonseca A.O. de Almeida A.B.A.B.S. Moraes A.B. Vieira Neto L. Adrenal incidentaloma: Do patients with apparently nonfunctioning mass or autonomous cortisol secretion have similar or different clinical and metabolic features? Clin. Endocrinol. 2023 98 662 669 10.1111/cen.14861 36514987 29. Dogra P. Šambula L. Saini J. Thangamuthu K. Athimulam S. Delivanis D.A. Baikousi D.A. Nathani R. Zhang C.D. Genere N. High prevalence of frailty in patients with adrenal adenomas and adrenocortical hormone excess: A cross-sectional multi-centre study with prospective enrolment Eur. J. Endocrinol. 2023 189 318 326 10.1093/ejendo/lvad113 37590964 PMC10479159 30. Favero V. Parazzoli C. Bernasconi D.P. Chiodini I. Cardiometabolic comorbidities and cardiovascular events in “non-functioning” adrenal incidentalomas: A systematic review and meta-analysis J. Endocrinol. Investig. 2024 47 2929 2942 10.1007/s40618-024-02440-0 39347906 PMC11549128 31. Deutschbein T. Reimondo G. Di Dalmazi G. Bancos I. Patrova J. Vassiliadi D.A. Nekić A.B. Debono M. Lardo P. Ceccato F. Age-dependent and sex-dependent disparity in mortality in patients with adrenal incidentalomas and autonomous cortisol secretion: An international, retrospective, cohort study Lancet Diabetes Endocrinol. 2022 10 499 508 10.1016/S2213-8587(22)00100-0 35533704 PMC9679334 32. Patrova J. Mannheimer B. Lindh J.D. Falhammar H. Mortality in Patients With Nonfunctional Adrenal Tumors JAMA Intern. Med. 2023 183 832 838 10.1001/jamainternmed.2023.2442 37358871 PMC10294015 33. Morelli V. Frigerio S. Aresta C. Passeri E. Pugliese F. Copetti M. Barbieri A.M. Fustinoni S. Polledri E. Corbetta S. Adrenalectomy Improves Blood Pressure and Metabolic Control in Patients With Possible Autonomous Cortisol Secretion: Results of a RCT Front. Endocrinol. 2022 13 898084 10.3389/fendo.2022.898084 35721734 PMC9202594 34. Bonaventura I. Tomaselli A. Angelini F. Ferrari D. De Alcubierre D. Hasenmajer V. Sbardella E. Cozzolino A. Paganini A.M. Isidori A.M. Predicting postoperative hypocortisolism in patients with non-aldosterone-producing adrenocortical adenoma: A retrospective single-centre study J. Endocrinol. Investig. 2024 47 1751 1762 10.1007/s40618-023-02283-1 38386266 PMC11196308 35. Olsen H. Olsen M. Associations of age, BMI, and renal function to cortisol after dexamethasone suppression in patients with adrenal incidentalomas Front. Endocrinol. 2023 13 1055298 10.3389/fendo.2022.1055298 PMC9904234 36760812 36. Rahimi L. Kittithaworn A. Gregg Garcia R. Saini J. Dogra P. Atkinson E.J. Achenbach S.J. Kattah A. Bancos I. Kidney Function in Patients With Adrenal Adenomas: A Single-Center Retrospective Cohort Study J. Clin. Endocrinol. Metab. 2024 109 e1750 e1758 10.1210/clinem/dgad765 38157409 PMC11318994 37. Favero V. Aresta C. Parazzoli C. Cairoli E. Eller-Vainicher C. Palmieri S. Salcuni A.S. Arosio M. Persani L. Scillitani A. The degree of cortisol secretion is associated with diabetes mellitus and hypertension in patients with nonfunctioning adrenal tumors Cardiovasc. Diabetol. 2023 22 102 10.1186/s12933-023-01836-1 37131218 PMC10155432 38. Araujo-Castro M. Ramírez P.P. Rojas-Marcos P.M. Centeno R.G. Gimeno P.G. Fernández-Ladreda M.T. Núñez M.A.S. Higueruela C. Lázaro C.R. Nonfunctioning adrenal incidentalomas with cortisol post-dexamethasone suppression test > 0.9 µg/dL have a higher prevalence of cardiovascular disease than those with values ≤ 0.9 µg/dL Endocrine 2023 79 384 391 10.1007/s12020-022-03228-z 36261701 39. Güneş E. Güneş M. Are nonfunctioning adrenal incidentalomas really nonfunctioning? A retrospective single-center study Eur. Rev. Med. Pharmacol. Sci. 2023 27 9895 9901 10.26355/eurrev_202310_34167 37916357 40. Pelsma I.C.M. Fassnacht M. Tsagarakis S. Terzolo M. Tabarin A. Sahdev A. Newell-Price J. Marina L. Lorenz K. Bancos I. Comorbidities in mild autonomous cortisol secretion and the effect of treatment: Systematic review and meta-analysis Eur. J. Endocrinol. 2023 189 S88 S101 10.1093/ejendo/lvad134 37801655 41. Chen A.X. Radhakutty A. Drake S.M. Kiu A. Thompson C.H. Burt M.G. Cardiovascular Risk Markers in Adults With Adrenal Incidentaloma and Mild Autonomous Cortisol Secretion J. Clin. Endocrinol. Metab. 2024 109 e1020 e1028 10.1210/clinem/dgad665 37967229 42. Kjellbom A. Lindgren O. Puvaneswaralingam S. Löndahl M. Olsen H. Association Between Mortality and Levels of Autonomous Cortisol Secretion by Adrenal Incidentalomas: A Cohort Study Ann. Intern. Med. 2021 174 1041 1049 10.7326/M20-7946 34029490 43. Morelli V. Aresta C. Gaudio A. Eller-Vainicher C. Zhukouskaya V.V. Merlotti D. Orsi E. Maria Barbieri A. Fustinoni S. Polledri E. Prediction of hypertension, diabetes and fractures in eucortisolemic women by measuring parameters of cortisol milieu Endocrine 2020 68 411 419 10.1007/s12020-020-02212-9 31989409 44. Kufukihara R. Takeda T. Hakozaki K. Yasumizu Y. Tanaka N. Matsumoto K. Morita S. Kosaka T. Mizuno R. Asanuma H. Predictors of renal function after adrenalectomy in patients with Cushing or subclinical Cushing syndrome Int. J. Urol. 2022 29 1447 1454 10.1111/iju.15007 36000951 45. Nakamura T. Girerd S. Jaisser F. Barrera-Chimal J. Nonepithelial mineralocorticoid receptor activation as a determinant of kidney disease Kidney Int. Suppl. 2022 12 12 18 10.1016/j.kisu.2021.11.004 PMC9073223 35529084 46. Eller-Vainicher C. Morelli V. Aresta C. Salcuni A.S. Falchetti A. Carnevale V. Persani L. Scillitani A. Chiodini I. Defining Nonfunctioning Adrenal Adenomas on the Basis of the Occurrence of Hypocortisolism after Adrenalectomy J. Endocr. Soc. 2020 4 bvaa079 10.1210/jendso/bvaa079 32699828 PMC7365697 47. Puvaneswaralingam S. Kjellbom A. Lindgren O. Löndahl M. Olsen H. ACTH following overnight dexamethasone suppression can be used in the verification of autonomous cortisol secretion in patients with adrenal incidentalomas Clin. Endocrinol. 2021 94 168 175 10.1111/cen.14357 33108675 48. Nica S. Sionel R. Maciuca R. Csutak O. Ciobica M.L. Nica M.I. Chelu I. Radu I. Toma M. Gender-Dependent Associations Between Digit Ratio and Genetic Polymorphisms, BMI, and Reproductive Factors Rom. J. Mil. Med. 2025 128 78 86 10.55453/rjmm.2025.128.1.10 49. Vasiliu O. Therapeutic management of atypical antipsychotic-related metabolic dysfunctions using GLP-1 receptor agonists: A systematic review Exper. Ther. Med. 2023 26 355 10.3892/etm.2023.12054 37324512 PMC10265718 50. Turan Erdogan B. Evranos Ogmen B. Sacikara M. Aydin C. Topaloglu O. Ersoy R. Cakir B. The relationship between mild autonomous cortisol secretion and metabolic diseases in cases with adrenal incidentaloma Endokrynol. Pol. 2025 76 172 181 10.5603/ep.102786 40110608 51. Efthymiadis A. Loo H. Shine B. James T. Keevil B. Tomlinson J.W. Pal A. Pofi R. Development of diagnostic algorithm for Cushing’s syndrome: A tertiary centre experience J. Endocrinol. Investig. 2024 47 2449 2459 10.1007/s40618-024-02354-x 38536658 PMC11393038 52. Al-Waeli D. Alidrisi H. Mansour A. Utilizing dehydroepiandrosterone sulfate and its ratio for detecting mild autonomous cortisol excess in patients with adrenal incidentaloma J. Med. Life 2023 16 1456 1461 10.25122/jml-2023-0092 38313163 PMC10835554 53. Araujo-Castro M. Hanzu F.A. Pascual-Corrales E. García Cano A.M. Marchan M. Escobar-Morreale H.F. Valderrabano P. Casals G. Is the 1 mg-dexamethasone suppression test a precise marker of glucocorticoid excess and cardiometabolic risk in patients with adrenal incidentalomas? Endocrine 2023 82 161 170 10.1007/s12020-023-03429-0 37351760 54. Issa B.G. Hanna F.W.F. Fryer A.A. Ensah G. Ebere I. Marshall D. Keevil B. The Utility of Salivary Cortisone in the Overnight Dexamethasone Suppression Test in Adrenal Incidentalomas J. Clin. Endocrinol. Metab. 2023 108 e937 e943 10.1210/clinem/dgad242 37155577 55. Wu V.C. Chan C.K. Wu W.C. Peng K.Y. Chang Y.S. Yeh F.Y. Chiang J.Y. Lee Y.J. Liu K.L. Wang S.M. New-onset diabetes mellitus risk associated with concurrent autonomous cortisol secretion in patients with primary aldosteronism Hypertens. Res. 2023 46 445 455 10.1038/s41440-022-01086-w 36481967 56. Bancos I. Taylor A.E. Chortis V. Sitch A.J. Jenkinson C. Davidge-Pitts C.J. Lang K. Tsagarakis S. Macech M. Riester A. Urine steroid metabolomics for the differential diagnosis of adrenal incidentalomas in the EURINE-ACT study: A prospective test validation study Lancet Diabetes Endocrinol. 2020 8 773 781 10.1016/S2213-8587(20)30218-7 32711725 PMC7447976 57. Berke K. Constantinescu G. Masjkur J. Kimpel O. Dischinger U. Peitzsch M. Kwapiszewska A. Dobrowolski P. Nölting S. Reincke M. Plasma Steroid Profiling in Patients With Adrenal Incidentaloma J. Clin. Endocrinol. Metab. 2022 107 e1181 e1192 10.1210/clinem/dgab751 34665854 58. Ku E.J. Lee C. Shim J. Lee S. Kim K.A. Kim S.W. Rhee Y. Kim H.J. Lim J.S. Chung C.H. Metabolic Subtyping of Adrenal Tumors: Prospective Multi-Center Cohort Study in Korea Endocrinol. Metab. 2021 36 1131 1141 10.3803/EnM.2021.1149 PMC8566125 34674508 59. Mitrica M. Vasiliu O. Plesa A. Sirbu O.M. Multinodular and vacuolating neuronal tumor Rom. J. Mil. Med. 2025 128 10 16 10.55453/rjmm.2025.128.1.2 60. Huayllas M.K.P. Smith L.M. Gallagher J.C. Netzel B.C. Singh R.J. Kater C.E. Steroidogenesis in patients with adrenal incidentalomas: Extended steroid profile measured by liquid chromatography-mass spectrometry after ACTH stimulation and dexamethasone suppression Clin. Endocrinol. 2021 95 29 40 10.1111/cen.14445 33598999 61. Zenoaga-Barbăroșie C. Berca L. Vassu-Dimov T. Toma M. Nica M. Alexiu-Toma O. Ciornei C. Albu A. Nica S. Nistor C. The Predisposition for Type 2 Diabetes Mellitus and Metabolic Syndrome Balk. J. Med. Genet. 2023 26 21 26 10.2478/bjmg-2023-0003 PMC10413885 37576792 62. Nistor C.-E. Găvan C.S. Ciritel A.-A. Nemes A.F. Ciuche A. The Association of Minimally Invasive Surgical Approaches and Mortality in Patients with Malignant Pleuropericarditis—A 10 Year Retrospective Observational Study Medicina 2022 58 718 10.3390/medicina58060718 35743981 PMC9229806 63. Chortis V. Bancos I. Nijman T. Gilligan L.C. Taylor A.E. Ronchi C.L. O’Reilly M.W. Schreiner J. Asia M. Riester A. Urine Steroid Metabolomics as a Novel Tool for Detection of Recurrent Adrenocortical Carcinoma J. Clin. Endocrinol. Metab. 2020 105 e307 e318 10.1210/clinem/dgz141 31665449 PMC7112967 64. Teuber J.P. Nanba K. Turcu A.F. Chen X. Zhao L. Else T. Auchus R.J. Rainey W.E. Rege J. Intratumoral steroid profiling of adrenal cortisol-producing adenomas by liquid chromatography- mass spectrometry J. Steroid Biochem. Mol. Biol. 2021 212 105924 10.1016/j.jsbmb.2021.105924 34089832 PMC8734951 65. Debono M. Elder C.J. Lewis J. Fearnside J. Caunt S. Dixon S. Jacques R.M. Newell-Price J. Whitaker P.M.J. Keevil B. Home waking salivary cortisone to screen for adrenal insufficiency NEJM Evid. 2023 2 2 10.1056/EVIDoa2200182 38320034 66. Kvam Hellan K. Lyngstad M. Methlie P. Løvås K. Husebye E.S. Ueland G.Å. Utility of Salivary Cortisol and Cortisone in the Diagnostics of Adrenal Insufficiency J. Clin. Endocrinol. Metab. 2025 110 1218 1223 10.1210/clinem/dgae486 38994578 PMC12012792 67. Savas M. Mehta S. Agrawal N. van Rossum E.F.C. Feelders R.A. Approach to the Patient: Diagnosis of Cushing Syndrome J. Clin. Endocrinol. Metab. 2022 107 3162 3174 10.1210/clinem/dgac492 36036941 PMC9681610 68. Anderson T. Wideman L. The association between the cortisol and cortisone awakening responses Psychoneuroendocrinology 2023 152 106075 10.1016/j.psyneuen.2023.106075 36933271 69. Olsen H. Kjellbom A. Löndahl M. Lindgren O. Suppressed ACTH Is Frequently Unrelated to Autonomous Cortisol Secretion in Patients With Adrenal Incidentalomas J. Clin. Endocrinol. Metab. 2019 104 506 512 10.1210/jc.2018-01029 30265354 70. Ciftci S. Soyluk O. Selek A. Erol S. Hekimsoy Z. Esen A. Dursun H. Sahin S. Oruk G. Mert M. The Importance of DHEA-S Levels in Cushing’s Syndrome; Is There a Cut-off Value in the Differential Diagnosis? Horm. Metab. Res. 2022 54 232 237 10.1055/a-1783-7901 35413744 71. Elhassan Y.S. Alahdab F. Prete A. Delivanis D.A. Khanna A. Prokop L. Murad M.H. O’Reilly M.W. Arlt W. Bancos I. Natural History of Adrenal Incidentalomas With and Without Mild Autonomous Cortisol Excess: A Systematic Review and Meta-analysis Ann. Intern. Med. 2019 171 107 116 10.7326/M18-3630 31234202 72. Araujo-Castro M. Robles Lázaro C. Parra Ramírez P. García Centeno R. Gracia Gimeno P. Fernández-Ladreda M.T. Sampedro Núñez M.A. Marazuela M. Escobar-Morreale H.F. Valderrabano P. Maximum adenoma diameter, regardless of uni- or bilaterality, is a risk factor for autonomous cortisol secretion in adrenal incidentalomas J. Endocrinol. Investig. 2021 44 2349 2357 10.1007/s40618-021-01539-y 33683661 73. Muangnoo N. Manosroi W. Leelathanapipat N. Meejun T. Chowchaiyaporn P. Teetipsatit P. Predictive Factors of Functioning Adrenal Incidentaloma: A 15-Year Retrospective Study Medicina 2022 58 597 10.3390/medicina58050597 35630017 PMC9144654 74. Podbregar A. Kocjan T. Rakuša M. Popović P. Garbajs M. Goricar K. Janez A. Jensterle M. Natural history of nonfunctioning adrenal incidentalomas: A 10-year longitudinal follow-up study Endocr. Connect. 2021 10 637 645 10.1530/EC-21-0196 34010150 PMC8240720 75. Falcetta P. Orsolini F. Benelli E. Agretti P. Vitti P. Di Cosmo C. Tonacchera M. Clinical features, risk of mass enlargement, and development of endocrine hyperfunction in patients with adrenal incidentalomas: A long-term follow-up study Endocrine 2021 71 178 188 10.1007/s12020-020-02476-1 32915435 PMC7835305 76. Araujo-Castro M. Parra Ramírez P. Robles Lázaro C. García Centeno R. Gracia Gimeno P. Fernández-Ladreda M.T. Sampedro Núñez M.A. Marazuela M. Escobar-Morreale H.F. Valderrabano P. Predictors of Tumour Growth and Autonomous Cortisol Secretion Development during Follow-Up in Non-Functioning Adrenal Incidentalomas J. Clin. Med. 2021 10 5509 10.3390/jcm10235509 34884211 PMC8658279 77. Petramala L. Circosta F. Marino L. Palombi E. Costanzo M.L. Servello A. Galardo G. Letizia C. Clinical Evaluation of Adrenal Incidentaloma: The Experience of a Referral Center Biomedicines 2024 12 1910 10.3390/biomedicines12081910 39200374 PMC11351527 78. Araujo-Castro M. García Cano A.M. Escobar-Morreale H.F. Valderrabano P. Predictive model for autonomous cortisol secretion development in non-functioning adrenal incidentalomas Hormones 2023 22 51 59 10.1007/s42000-022-00406-6 36279032 79. Maas M. Nassiri N. Bhanvadia S. Carmichael J.D. Duddalwar V. Daneshmand S. Discrepancies in the Recommended Management of Adrenal Incidentalomas by Various Guidelines J. Urol. 2021 205 52 59 10.1097/JU.0000000000001342 32856984 80. Remde H. Kranz S. Morell S.M. Altieri B. Kroiss M. Detomas M. Fassnacht M. Deutschbein T. Clinical course of patients with adrenal incidentalomas and cortisol autonomy: A German retrospective single center cohort study Front. Endocrinol. 2023 14 1123132 10.3389/fendo.2023.1123132 PMC10200872 37223045 81. Lovato C.M. Thévenot T. Borot S. Di Martino V. Qualls C.R. Urban F.K. Dorin R.I. Decreased maximal cortisol secretion rate in patients with cirrhosis: Relation to disease severity JHEP Rep. 2021 3 100277 10.1016/j.jhepr.2021.100277 34027338 PMC8121968 82. Vanek C. Loriaux L. The 1 mg overnight dexamethasone suppression test: A danger to the adrenal gland? Curr. Opin. Endocrinol. Diabetes Obes. 2022 29 403 405 10.1097/MED.0000000000000752 35799460 83. Vogg N. Kurlbaum M. Deutschbein T. Gräsl B. Fassnacht M. Kroiss M. Method-Specific Cortisol and Dexamethasone Thresholds Increase Clinical Specificity of the Dexamethasone Suppression Test for Cushing Syndrome Clin. Chem. 2021 67 998 1007 10.1093/clinchem/hvab056 33997885 84. Roper S.M. Yield of Serum Dexamethasone Measurement for Reducing False-Positive Results of Low-Dose Dexamethasone Suppression Testing J. Appl. Lab. Med. 2021 6 480 485 10.1093/jalm/jfaa193 33484119 85. Genere N. Kaur R.J. Athimulam S. Thomas M.A. Nippoldt T. Van Norman M. Singh R. Grebe S. Bancos I. Interpretation of Abnormal Dexamethasone Suppression Test is Enhanced With Use of Synchronous Free Cortisol Assessment J. Clin. Endocrinol. Metab. 2022 107 e1221 e1230 10.1210/clinem/dgab724 34648626 PMC9006975 86. Berlińska A. Świątkowska-Stodulska R. Sworczak K. Factors Affecting Dexamethasone Suppression Test Results Exp. Clin. Endocrinol. Diabetes 2020 128 667 671 10.1055/a-1017-3217 31652475 87. Ceccato F. Artusi C. Barbot M. Lizzul L. Pinelli S. Costantini G. Niero S. Antonelli G. Plebani M. Scaroni C. Dexamethasone measurement during low-dose suppression test for suspected hypercortisolism: Threshold development with and validation J. Endocrinol. Investig. 2020 43 1105 1113 10.1007/s40618-020-01197-6 32060745 88. Valea A. Ghervan C. Morar A. Pop D.D. Carsote M. Albu S.E. Georgescu C.E. Chiorean A. Hashimoto’s thyroiditis and breast cancer: Coincidence or correlation? Arch. Balk. Med. Union 2016 51 129 132 89. Ceccato F. Tizianel I. Voltan G. Maggetto G. Merante Boschin I. Quaia E. Crimì F. Scaroni C. Attenuation Value in Adrenal Incidentalomas: A Longitudinal Study Front. Endocrinol. 2021 12 794197 10.3389/fendo.2021.794197 PMC8678594 34925247 90. Farinelli D.G. Oliveira K.C. Hayashi L.F. Kater C.E. Overnight 1-mg Dexamethasone Suppression Test for Screening Cushing Syndrome and Mild Autonomous Cortisol Secretion (MACS): What Happens when Serum Dexamethasone Is Below Cutoff? How Frequent Is it? Endocr. Pract. 2023 29 986 993 10.1016/j.eprac.2023.09.007 37734596 91. Atkins J.S. Hawley J.M. Owen L.J. Clayton J. Scargill J. Keevil B.G. Serum cortisol assay performance following the 1 mg overnight dexamethasone suppression test Ann. Clin. Biochem. 2023 60 386 395 10.1177/00045632231179560 37208338 92. Cappola A.R. Auchus R.J. El-Hajj Fuleihan G. Handelsman D.J. Kalyani R.R. McClung M. Stuenkel C.A. Thorner M.O. Verbalis J.G. Hormones and Aging: An Endocrine Society Scientific Statement J. Clin. Endocrinol. Metab. 2023 108 1835 1874 10.1210/clinem/dgad225 37326526 PMC11491666 93. Hepsen S. Sencar E. Sakiz D. Akhanli P. Ucan B. Unsal I. Ozbek M. Cakal E. Serum cortisol level after low dose dexamethasone suppression test may be predictive for diabetes mellitus and hypertension presence in obese patients: A retrospective study Diabetes Res. Clin. Pract. 2020 161 108081 10.1016/j.diabres.2020.108081 32068098 94. Popa F.L. Diaconu C. Canciu A. Ciortea V.M. Iliescu M.G. Stanciu M. Medical management and rehabilitation in posttraumatic common peroneal nerve palsy Balneo PRM Res. J. 2022 13 496 10.12680/balneo.2022.496 95. Favero V. Cremaschi A. Falchetti A. Gaudio A. Gennari L. Scillitani A. Vescini F. Morelli V. Aresta C. Chiodini I. Management and Medical Therapy of Mild Hypercortisolism Int. J. Mol. Sci. 2021 22 11521 10.3390/ijms222111521 34768949 PMC8584167 96. Araujo-Castro M. Valderrábano P. Escobar-Morreale H.F. Hanzu F.A. Casals G. Urine steroid profile as a new promising tool for the evaluation of adrenal tumors Lit. Rev. Endocr. 2021 72 40 48 10.1007/s12020-020-02544-6 33219921 97. Araujo-Castro M. Cardiometabolic profile and urinary metabolomic alterations in non-functioning adrenal incidentalomas: A review Clin. Endocrinol. 2022 97 693 701 10.1111/cen.14745 35451056 98. Liu M.S. Lou Y. Chen H. Wang Y.J. Zhang Z.W. Li P. Zhu D.L. Performance of DHEAS as a Screening Test for Autonomous Cortisol Secretion in Adrenal Incidentalomas: A Prospective Study J. Clin. Endocrinol. Metab. 2022 107 e1789 e1796 10.1210/clinem/dgac072 35137142 99. Yozamp N. Vaidya A. Assessment of mild autonomous cortisol secretion among incidentally discovered adrenal masses Best Pract. Res. Clin. Endocrinol. Metab. 2021 35 101491 10.1016/j.beem.2021.101491 33593680 100. Wilson M.P. Randhawa S. Bao B. Croutze R. Murad M.H. McInnes M.D.F. Low G. Impact of Size Thresholds on the Diagnosis of Incidental Adrenal Lesions: A Systematic Review and Meta-Analysis J. Am. Coll. Radiol. 2024 21 107 117 10.1016/j.jacr.2023.04.027 37634790 101. Qi S. Zuo Y. Chang R. Huang K. Liu J. Zhang Z. Using CT radiomic features based on machine learning models to subtype adrenal adenoma BMC Cancer 2023 23 111 10.1186/s12885-023-10562-6 36721273 PMC9890822 102. Toniolo A. Agostini E. Ceccato F. Tizianel I. Cabrelle G. Lupi A. Pepe A. Campi C. Quaia E. Crimì F. Could CT Radiomic Analysis of Benign Adrenal Incidentalomas Suggest the Need for Further Endocrinological Evaluation? Curr. Oncol. 2024 31 4917 4926 10.3390/curroncol31090364 39329992 PMC11431504 103. Araujo-Castro M. Paja Fano M. Pla Peris B. González Boillos M. Pascual-Corrales E. García-Cano A.M. Parra Ramírez P. Rojas-Marcos P.M. Ruiz-Sanchez J.G. Vicente A. Autonomous cortisol secretion in patients with primary aldosteronism: Prevalence and implications on cardiometabolic profile and on surgical outcomes Endocr. Connect. 2023 12 e230043 10.1530/EC-23-0043 37410097 PMC10448600 104. Peng K.Y. Liao H.W. Chan C.K. Lin W.C. Yang S.Y. Tsai Y.C. Huang K.H. Lin Y.H. Chueh J.S. Wu V.C. Presence of Subclinical Hypercortisolism in Clinical Aldosterone-Producing Adenomas Predicts Lower Clinical Success Hypertension 2020 76 1537 1544 10.1161/HYPERTENSIONAHA.120.15328 32921192 105. Katabami T. Matsuba R. Kobayashi H. Nakagawa T. Kurihara I. Ichijo T. Tsuiki M. Wada N. Ogawa Y. Sone M. Primary aldosteronism with mild autonomous cortisol secretion increases renal complication risk Eur. J. Endocrinol. 2022 186 645 655 10.1530/EJE-21-1131 35380982 106. Cakir S.D. Cakir A. Ozturk F.Y. Basmaz S.E. Batman A. Saygili E.S. Erol R.S. Sen E.C. Canat M.M. Altuntas Y. Choroidal Thickness in Mild Autonomous Cortisol Secretion Sisli Etfal Hast. Tip Bul. 2024 58 204 209 10.14744/SEMB.2024.12258 PMC11250000 39021683 107. Siemińska L. Siemińska K. Dittfeld A. Kotecka-Blicharz A. Fibroblast growth factor 21 in patients with mild autonomic cortisol secretion and non-functioning adrenal incidentalomas Endokrynol. Pol. 2024 75 672 683 10.5603/ep.102598 40091329 108. Zhao X. Zhou J. Lyu X. Li Y. Ma L. Liu Y. Fan H. Zhang Y. A novel model using leukocytes to differentiating mild autonomous cortisol secretion and non-functioning adrenal adenoma Sci. Rep. 2024 14 23557 10.1038/s41598-024-74452-y 39384846 PMC11464552 109. Athanasouli F. Georgiopoulos G. Asonitis N. Petychaki F. Savelli A. Panou E. Angelousi A. Nonfunctional adrenal adenomas and impaired glucose metabolism: A systematic review and meta-analysis Endocrine 2021 74 50 60 10.1007/s12020-021-02741-x 33963515 110. Valea A. Carsote M. Moldovan C. Georgescu C. Chronic autoimmune thyroiditis and obesity Arch. Balk. Med. Union 2018 53 64 69 111. Liu L. Li X. Ma W. Fan F. Yang Y. Zhang L. Yi T. Zhang J. Guo J. Gao Y. Comparative analysis of cardiac dysfunction in non-functioning adrenal adenomas, primary aldosteronism, and essential hypertension J. Endocrinol. Investig. 2025 48 1811 1817 10.1007/s40618-025-02594-5 40488985 PMC12313751 112. Zhang X. Hou A. Cao J. Liu Y. Lou J. Li H. Ma Y. Song Y. Mi W. Liu J. Association of Diabetes Mellitus With Postoperative Complications and Mortality After Non-Cardiac Surgery: A Meta-Analysis and Systematic Review Front. Endocrinol. 2022 13 841256 10.3389/fendo.2022.841256 35721703 PMC9204286 113. Uygur M.M. di Filippo L. Frara S. Menotti S. Giustina A. Pathophysiology and evaluation of bone health in adrenal diseases Endocrine 2025 89 325 337 10.1007/s12020-025-04260-5 40434548 114. Nistor C.E. Bugala N.M. Daguci C. Daguci L. Diaconu O.A. Rica A.M. Multiple endocrine neoplasia type 2 syndrome and osteoporosis Aging Clin. Exp. Res. 2023 35 S387 115. Zavatta G. Di Dalmazi G. Mild Autonomous Cortisol Secretion (MACS)—Related Osteoporosis Exp. Clin. Endocrinol. Diabetes 2024 132 712 722 10.1055/a-2329-5787 38760001 116. Nistor C.E. Gavan C.S. Pantile D. Tanase N.V. Ciuche A. Cervico-Thoracic Air Collections in COVID-19 Pneumonia Patients—Our Experience and Brief Review Chirurgia 2022 117 317 327 10.21614/chirurgia.2719 36049090 117. Minnetti M. Hasenmajer V. Sbardella E. Angelini F. Simeoli C. Di Paola N. Cozzolino A. Pivonello C. De Alcubierre D. Chiloiro S. Susceptibility and characteristics of infections in patients with glucocorticoid excess or insufficiency: The ICARO tool Eur. J. Endocrinol. 2022 187 719 731 10.1530/EJE-22-0454 36102827 PMC9641788 118. Nistor C. Ciuche A. Constantinescu I. Emergency surgical tracheal decompression in a huge retrosternal goiter Acta Endocrinol. 2017 13 370 374 10.4183/aeb.2017.370 PMC6516576 31149202 119. Kastelan D. Dusek T. Do adrenal incidentalomas have an impact on mental health? A comprehensive review Eur. J. Endocrinol. 2025 192 R1 R6 10.1093/ejendo/lvaf011 39891589 120. Nistor C. Ranetti A.E. Ciuche A. Pantile D. Constantin L.M. Brincoveanu R. Betadine in chemical pleurodesis Farmacia 2014 62 897 906 121. Farah S. Nasr L. Eid Fares J. An Overlooked Disease: Minimal Autonomous Cortisol Secretion (MACS). A Narrative Review Metab. Immune Disord. Drug Targets 2024 24 1518 1524 10.2174/0118715303266569231129101847 38686896 122. Czapla-Iskrzycka A. Świątkowska-Stodulska R. Sworczak K. Comorbidities in Mild Autonomous Cortisol Secretion—A Clinical Review of Literature Exp. Clin. Endocrinol. Diabetes 2022 130 567 576 10.1055/a-1827-4113 35817047 123. Candemir B. Kisip K. Akın Ş. Sanal H.T. Taşar M. Candemir M. Gülçelik N.E. Prevalence and Predictive Features of CT-Derived Nonalcoholic Fatty Liver Disease in Metabolically Healthy MACS Clin. Endocrinol. 2025 102 380 388 10.1111/cen.15194 39748255 124. Lamas C. Araujo-Castro M. Ostermair L. Petersenn E. Parra Ramírez P. Rebollo-Román Á. Stuefchen I. Bruedgam D. Ruiz-Sanchez J.G. Michalopoulou T. Impact of Cortisol-Cosecretion on Adrenal Venous Sampling Results in Primary Aldosteronism: Study of 225 Cases Biomedicines 2024 12 2430 10.3390/biomedicines12112430 39594996 PMC11591640 125. Umakoshi H. Mild autonomous cortisol secretion in primary aldosteronism: The origin of cortisol Hypertens. Res. 2025 48 2272 2273 10.1038/s41440-025-02245-5 40461796 Figure 1 Flowchart diagram of search ( n Figure 2 Sneak peek of post-DST cortisol cutoffs and their significance amid the sample-based analysis (Abbreviations: CI = confidence interval, DST = dexamethasone suppression test, MACS = mild autonomous cortisol secretion, OR = odd ratio). Figure 3 Longitudinal analysis: main findings (Abbreviations: DST = dexamethasone suppression test, HR = hazard ratio, MACS = mild autonomous cortisol secretion, NFA = non-functional adrenal adenoma). biomedicines-13-02169-t001_Table 1 Table 1 Included studies that provided and analysis of post-DST cortisol cutoffs and their association with cardio-metabolic and renal outcomes [ 34 35 36 37 38 39 First Author Study Design Number of Patients Sex Ratio (F/M) Outcomes Bonaventura 2024 34 Retrospective N = 32 AI 1 mg DST > 1.8 µg/dL Preoperative cortisol after 1 mg-DST (4.75 µg/dL) as the only significant predictor of 6-week adrenal recovery following adrenalectomy p p Olsen 35 Cross-sectional N = 631 with AI (1 mg DST <1.8 µg/dL) 1 mg DST ≥ 1.8 µg/dL Negative correlation between 1 mg DST and eGFR, with 1 mg DST increasing by 9% (95% CI: 6–11%) for each 10 mL/min/1.73 m 2 Rahimi 36 Cohort N = 972 with AI 1 mg DST ≥ 1.8 µg/dL eGFR 2 p 2 p p p Favero 37 Retrospective cross-sectional N = 615 1 mg DST < 1.2 µg/dL 1 mg DST 1.2 µg/dL was the cutoff with the highest accuracy in identifying patients with either hypertension or diabetes mellitus: p p p p p p p p p Araujo-Castro 38 Retrospective N = 593 NFA 1 mg DST ≤ 1.4 µg/dL 1 mg DST ≤ 0.9 µg/dL 1 mg DST 0.9 µg/dL threshold proves to be useful in identifying patients with NFA at higher cardiovascular risk Güneş 39 Retrospective N = 123 with AI ROC analysis identified the optimal 1 mg DST level for HT, which was 0.87 μg/dL. <0.87 μg/dL p p p Abbreviation: ACS = autonomous cortisol secretion, ACTH = adrenocorticotropic hormone, AI = adrenal incidentalomas, AUC = area under the curve, CI confidence interval, eGFR = estimated glomerular filtration rate, F = female, HPA = hypothalamic-pituitary-adrenal axis, HR = hazard ratio, IQR = interquartile range, M = male, MACS = mild autonomous cortisol secretion, N = number of patients, NFA = non-functioning adrenal adenoma, OR = odds ratio, ROC= Receiver Operating Characteristic, SD = standard deviation, vs. = versus, y = years (red font = the blood cortisol cutoff following dexamethasone administration during dexamethasone suppression test). biomedicines-13-02169-t002_Table 2 Table 2 Included studies that evaluated the potential improvements of DST through the addition of other hormonal markers (ACTH, UFC, LNSC, DHEAS) in order to pinpoint MACS [ 50 51 52 53 54 First Author Year of Publication Reference Number Study Number of Patients Outcomes Turan Erdogan 50 Retrospective study N = 461 with AI Predicted MACS: p Efthymiadis 51 Retrospective study N = 53 with CS of these 24 with MACS (1 mg DST > 1.8 µg/dL) and 27 with Cushing disease MACS p p p p p p Al-Waeli 52 Cross-sectional study N = 38 with AI of these 5 were diagnosed with MACS (1 mg DST > 1.8 µg/dL) DHEAS ≤ 75 µg/dL Araujo-Castro, 53 Cross-sectional study N = 49 AI ACS-related comorbidities were moderately accurately predicted by post-DST cortisol alone: Issa 54 Retrospective study N = 173 with AI Correlation between 1 mg DST salivary cortisone and serum cortisol with an r p Abbreviation: ACS = autonomous cortisol secretion, ACTH = adrenocorticotropic hormone, AI = adrenal incidentalomas, AUC = area under the curve, CI = confidence interval, DHEAS = dehydroepiandrosterone sulfate, eGFR = estimated glomerular filtration rate, F = female, HPA = hypothalamic-pituitary-adrenal axis, HR = hazard ratio, IQR = interquartile range, LDDST = low-dose dexamethasone suppression test, LNSC = late-night salivary cortisol, LNSE = late-night salivary cortisone, M = male, MACS = mild autonomous cortisol secretion, N = number of patients, NFA = non-functioning adrenal adenoma, OR = odds ratio, ROC= Receiver Operating Characteristic, SD = standard deviation, vs. = versus, Y = years. biomedicines-13-02169-t003_Table 3 Table 3 Studies assessing longitudinal variations in DST results and changing of the NFA/MACS category [ 38 77 78 First Author Study Number of Patients Outcomes Petramala 77 Retrospective study N = 132 with AI Follow-up (annually for at least 5 years): 29.2% of subjects developed MACS (1 mg DST > 1.8 µg/dL) p Araujo-Castro 78 Retrospective study N = 331 with NFA The greatest predictor of ACS development during follow-up was a combination of age, post-DST serum cortisol, and bilaterality at presentation, which demonstrated good diagnosis accuracy p Araujo-Castro 38 Retrospective study N = 593 NFA Follow-up of 40.4 ± 51.17 months, 11.8% of the patients developed ACS p Abbreviation: ACS = autonomous cortisol secretion, AI = adrenal incidentalomas, AUC = area under the curve, CI = confidence interval, F = female, HPA = hypothalamic-pituitary-adrenal axis, HR = hazard ratio, IQR = interquartile range, M = male, MACS = mild autonomous cortisol secretion, N = number of patients, NFA = non-functioning adrenal adenoma, OR = odds ratio, SD = standard deviation, vs. = versus, y = years. ",
  "metadata": {
    "Title of this paper": "Mild autonomous cortisol secretion in primary aldosteronism: The origin of cortisol",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467119/"
  }
}