{
  "title": "Paper_734",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474110 PMC12474110.1 12474110 12474110 41012109 10.3390/vaccines13090903 vaccines-13-00903 1 Article Safety and Immunogenicity of Vaccines in Children with Kaposiform Hemangioendothelioma Receiving Sirolimus: A Prospective Study Yuan Junhong Data curation Writing – original draft Writing – review & editing 1 https://orcid.org/0009-0008-9073-6762 Yuan Zhenxiang Data curation Writing – original draft Writing – review & editing 1 Ding Yingjing Data curation 1 Wang Zuopeng Supervision 1 Yao Wei Supervision 1 Li Jingjing Data curation Supervision 2 Zeng Mei Conceptualization Writing – review & editing Supervision Project administration 2 * Li Kai Conceptualization Writing – review & editing Supervision Project administration Funding acquisition 1 * Plans-Rubió Pedro Academic Editor 1 2 * zengmei@fudan.edu.cn li_kaiek@fudan.edu.cn 26 8 2025 9 2025 13 9 497676 903 19 6 2025 13 8 2025 19 8 2025 26 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Sirolimus is an effective treatment for kaposiform hemangioendothelioma (KHE), a rare vascular tumor in children. However, its immunosuppressive properties raise concerns regarding the safety and efficacy of vaccinations during treatment. This study aims to evaluate the safety and immunogenicity of inactivated and live-attenuated vaccines administered to pediatric KHE patients undergoing sirolimus therapy. Methods: We conducted a prospective study involving 56 KHE children receiving sirolimus who were vaccinated during treatment. Data on vaccine-related adverse events were collected to assess safety. Immunogenicity was evaluated by measuring seroconversion or protective antibody titers against vaccines, including Hepatitis B, DTaP, and MMR. Results: Among 56 catch-up vaccinated children, no serious adverse events related to vaccination were observed. Mild local or systemic reactions occurred in a minority of patients. Serological analysis demonstrated that children with kaposiform hemangioendothelioma (KHE) receiving sirolimus therapy were able to generate and sustain robust protective antibody responses following vaccination. High seroconversion rates and antibody titers were observed for both inactivated vaccines (e.g., hepatitis B and DTaP) and live-attenuated vaccines (e.g., MMR). Protective antibody levels were maintained both within 3 months and beyond 6 months post-vaccination, indicating durable immunogenicity under sirolimus treatment. Conclusions: Vaccination during sirolimus therapy appears to be safe and immunogenic in children with KHE. These findings support the administration of both inactivated and live-attenuated vaccines under appropriate clinical monitoring in this rare patient population. kaposiform hemangioendothelioma sirolimus vaccination immunogenicity safety pediatric vascular tumor Cyrus Tang Foundation ZSBK0070 National Clinical Key Specialty Construction Project 10000015Z155080000004 This research was supported by the Cyrus Tang Foundation (ZSBK0070) and the National Clinical Key Specialty Construction Project (10000015Z155080000004). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Sirolimus (rapamycin), an mTORC1 inhibitor targeting the PI3K-AKT-mTOR signaling pathway, was approved by the U.S. Food and Drug Administration in 1999 as an immunosuppressive agent. Since 2010, accumulating clinical evidence has demonstrated its superior therapeutic efficacy in the management of kaposiform hemangioendothelioma (KHE), a rare pediatric vascular tumor. Sirolimus has been shown to significantly improve clinical symptoms, elevate platelet counts, and restore coagulation function in affected patients [ 1 2 3 4 Given the immunosuppressive properties of sirolimus, vaccination is also generally not recommended during sirolimus treatment in pediatric patients. But as research on sirolimus continues to deepen, its impact on T cells, particularly memory CD8 + cells, has shown bidirectional effects, which are dependent on both the dosage and duration of use [ 5 6 However, both domestic and international studies evaluating the safety and immunogenicity of vaccines administered during sirolimus therapy in children remain limited. The absence of vaccine-induced immune protection may increase the risk of vaccine-preventable infections (VPIs) in children with kaposiform hemangioendothelioma (KHE) receiving sirolimus [ 7 Building upon previous exploratory work conducted in a small cohort, this study aims to systematically assess the efficacy and safety of pediatric vaccinations in children with kaposiform hemangioendothelioma (KHE) receiving sirolimus treatment. The objective is to generate clinical evidence to inform vaccination strategies for this specific patient population. With support from our center’s Vaccination Evaluation Clinic, a more comprehensive investigation has been undertaken to expand upon earlier findings and provide practical guidance for immunization in the context of sirolimus therapy. 2. Methods 2.1. General Information From January 2017 to December 2024, children diagnosed with kaposiform hemangioendothelioma (KHE) were retrospectively screened from both inpatient and outpatient records at our hospital. The inclusion criteria were: (1) diagnosis of KHE according to the 2013 consensus guidelines on the diagnosis and treatment of KHE and Kasabach–Merritt phenomenon (KMP) [ 8 Exclusion criteria included: (1) diagnosis of other vascular tumors such as infantile hemangiomas or tufted angiomas; (2) receipt of surgical excision, laser therapy, topical agents, or other systemic therapies (e.g., etoposide, corticosteroids) in addition to sirolimus; (3) disease progression or coexistence of serious comorbid conditions; (4) inability to provide reliable clinical and vaccination history; (5) disease deterioration during follow-up (e.g., tumor enlargement, bleeding tendency); and (6) occurrence of serious adverse events following vaccination (e.g., anaphylactic shock or sustained organ dysfunction). A total of 56 children met the inclusion criteria and were enrolled in the study. Ethical approval was obtained from the Ethics Committee of the Children’s Hospital of Fudan University. The study was conducted in accordance with the Declaration of Helsinki, and written informed consent was obtained from the parents or legal guardians of all participants. 2.2. Subject Grouping The enrolled children were categorized into a routine vaccination group and a catch-up vaccination group based on the timing of immunization relative to the recommended age-specific vaccination schedule outlined in the Chinese National Immunisation Programme Vaccine Immunisation Procedure Table for Children (2021 edition), as well as the timing of sirolimus initiation. The routine vaccination group included children who had completed the corresponding vaccine doses within one month of the recommended age as stipulated in the 2021 national immunization schedule, prior to the initiation of sirolimus therapy. The catch-up vaccination group comprised children who did not receive the corresponding vaccine doses within one month of the recommended schedule and instead received catch-up immunization during sirolimus treatment to complete the vaccination series. 2.3. Vaccination and Catch-Up The vaccination status of children with kaposiform hemangioendothelioma (KHE) was evaluated based on the age-specific immunization schedule outlined in the National Immunisation Programme Vaccine Schedule for Children (2021 edition), and catch-up vaccination was administered accordingly. 2.4. Observation Indicators Clinical and laboratory data from 56 children were collected before and after vaccination within 3 months and beyond 6 months. Clinical and laboratory features include routine hematological parameters, coagulation profiles, and immunological indicators. Specifically, these included complete blood count, key coagulation markers (e.g., APTT, PT, fibrinogen, D-dimer), and serologic levels of hepatitis B surface antibody (HBsAb) and IgG antibodies against common childhood infections (e.g., pertussis, diphtheria, tetanus, measles, rubella, and mumps). Prior to vaccination, assessments also included CD lymphocyte subsets, immunoglobulin levels, and complement concentrations. Adverse reactions were recorded for each vaccine dose, including mild events (e.g., fever, injection-site pain, erythema, and swelling) and serious events (e.g., severe anaphylaxis, shock, lesion enlargement, and lesion-site pain). 2.5. Statistical Analysis Quantitative data are presented as mean ± standard deviation (SD). For comparisons of continuous variables between two independent groups with homogeneity of variance, independent samples t t 3. Results 3.1. Demographic and Clinical Characteristics From January 2017 to December 2024, a total of 56 children diagnosed with kaposiform hemangioendothelioma (KHE) and treated with sirolimus were enrolled in this study through outpatient and inpatient screening at the Children’s Hospital of Fudan University, based on the predefined inclusion criteria ( Figure 1 9 2 Table 1 Supplementary Table S1 10 3.2. Safety Evaluation of Vaccination During sirolimus treatment, the mean percentages of T and B lymphocytes, as well as immunoglobulin and complement levels in children with KHE, remained within the normal reference ranges, as determined by CD lymphocyte subset analysis and immunological profiling. These values were comparable to those observed in age-matched healthy children ( Supplementary Table S2 Following vaccination, a subset of patients experienced mild adverse reactions, including local pain, erythema, and swelling at the injection site. Importantly, no serious adverse events such as severe allergic reactions, anaphylaxis, lesion enlargement, or lesion-associated pain were reported in any participant ( Table 2 Whether the lesion has enlarged is determined by comparing the MRI scan taken before the vaccine was administered with one taken within one year afterwards. Pain at the site of the lesion is determined by the child’s main complaint, as assessed by the doctor. In addition, post-vaccination assessments revealed no significant changes in platelet count, hemoglobin concentration, or coagulation parameters compared with pre-vaccination values ( p Figure 2 Supplementary Table S3 3.3. Effectiveness Evaluation of Vaccination Among the 56 children included in the study, 15 had completed age-appropriate hepatitis B vaccination prior to sirolimus therapy and were classified as the normal vaccination group. The remaining 41 children, who had not received hepatitis B vaccination within the recommended age window, underwent catch-up vaccination after initiation of sirolimus treatment. Among them, three failed to complete the third dose of the hepatitis B vaccine. No statistically significant differences were observed in age or sex distribution between the normal and catch-up groups ( p Following catch-up vaccination, the hepatitis B surface antibody (HBs-Ab) concentrations in the catch-up group increased significantly and reached levels comparable to those observed in the routine vaccination group. Notably, the post-vaccination HBs-Ab concentrations in the catch-up group were significantly higher than their pre-vaccination levels in the catch-up group ( p Figure 3 Supplementary Table S4 For diphtheria-tetanus-pertussis (DTP) vaccination, 16 children had completed the age-appropriate immunization schedule prior to sirolimus administration and were classified into the normal vaccination group. A total of 37 children received DTaP catch-up vaccination after initiation of sirolimus therapy due to delayed immunization, while 3 children had not received the DTaP vaccine during the study period. No statistically significant differences in age or sex were observed between the normal and catch-up groups ( p Within 0–3 months following catch-up vaccination, antibody concentrations in the DTaP catch-up group showed a significant increase compared to pre-vaccination levels ( p Figure 4 Table 3 Supplementary Table S5 Moreover, the impact of age and sirolimus duration on antibody titers are investigated after catch-up vaccination. Multivariate linear regression ( Supplementary Table S6 Supplementary Table S7 Given that the recommended ages for the first and second doses of the measles–mumps–rubella (MMR) vaccine are 8 months and 18 months, respectively, and that the mean age at disease onset in children with KHE in this cohort was 5.2 ± 11.0 months, the MMR vaccine deficiency rate at the time of diagnosis was 94.6%. Among the 56 children included, 53 who had not completed MMR vaccination underwent catch-up immunization, and 47 of these received the vaccine while on sirolimus treatment. However, the sample sizes between the two-dose (n = 30) and one-dose (n = 6) MMR vaccine groups was imbalance because the majority of children in this study had already received two doses of the MMR vaccine at the time of assessment, while only six children had received a single dose for various reasons. Given this imbalance, the statistical comparisons between these groups should be interpreted with caution, as the small sample size in the one-dose group may affect the robustness of the analysis. Within 0–3 months after MMR catch-up vaccination, serum IgG antibody levels against measles, mumps, and rubella significantly increased compared to pre-vaccination levels ( p Figure 5 Supplementary Table S8 4. Discussion As an mTOR inhibitor, sirolimus effectively inhibits protein synthesis in the PI3K–AKT–mTOR signaling cascade, thereby suppressing cellular proliferation and angiogenesis [ 11 12 4.1. Safety Evaluation of Vaccination The immunosuppressive treatment regimen and dosage can exert a significant impact on the baseline immune function of pediatric patients. It is generally accepted that for children with hematological malignancies, at least six months after the completion of chemotherapy are required for the immune system to recover sufficiently to elicit an adequate immune response to vaccination [ 13 According to the 2013 guidelines of the Infectious Diseases Society of America (IDSA), administration of live attenuated vaccines is contraindicated in hematopoietic stem cell transplant recipients undergoing immunosuppressive therapy. Similarly, for patients with chronic inflammatory diseases, live attenuated vaccines such as measles-mumps-rubella (MMR) and varicella are not recommended during the maintenance phase of immunosuppressive treatment. However, for patients receiving long-term low-dose immunosuppressive therapy who have no prior immunity to varicella, vaccination may be considered [ 14 In this study, assessment of CD lymphocyte subsets, immunoglobulin levels, and complement concentrations prior to catch-up vaccination in 56 children with KHE revealed that the majority of patients receiving low-dose sirolimus maintained normal baseline immune function. These findings suggest that during sirolimus treatment, the T and B cell function, as well as immunoglobulin and complement levels in children with KHE, are comparable to those in healthy children. This serves as an important rationale for proposing that children with KHE undergoing sirolimus therapy may be eligible for routine vaccination. Our results further demonstrated that both inactivated and live attenuated vaccines were well tolerated in this cohort. Most adverse reactions were mild and transient, with no serious adverse events such as anaphylaxis, shock, lesion enlargement, or lesion-site pain observed. Importantly, no vaccine-related infections occurred following immunization, indicating that vaccination during sirolimus treatment is not associated with increased infectious risk in this population. Follow-up assessments of platelet count, hemoglobin concentration, activated partial thromboplastin time (APTT), prothrombin time (PT), fibrinogen (FIB) level, and D-dimer concentration before and after vaccination in children with KHE undergoing sirolimus treatment demonstrated that all values remained within normal reference ranges, with no significant changes observed post-vaccination (all p 4.2. Effectiveness Evaluation of Vaccination The findings of this study indicate that children with KHE receiving sirolimus treatment were capable of mounting effective and protective immune responses following vaccination with both inactivated and live attenuated vaccines. Within three months and beyond six months after administration of inactivated vaccines such as hepatitis B and DTaP, the concentrations of HBsAb, pertussis IgG, diphtheria IgG, and tetanus IgG antibodies remained at high and protective levels. Similarly, live attenuated vaccines, including the MMR vaccine, also elicited robust immune responses, with seroconversion rates of measles IgG, rubella IgG, and mumps IgG antibodies approaching 100% within three months post-vaccination. Protective antibody titers were largely maintained beyond six months after vaccination. Notably, the magnitude and persistence of antibody responses observed in this cohort were superior to those reported in previous studies involving immunocompromised children undergoing chemotherapy, hematopoietic stem cell transplantation, or treatment with other immunosuppressants [ 15 16 Although antibody levels in KHE patients receiving sirolimus therapy tend to decline over time, most vaccine-specific antibodies—including HBs-Ab, pertussis IgG, diphtheria IgG, measles IgG, rubella IgG, and mumps IgG—remained above protective thresholds for effective immunity at least six months after vaccination. Notably, only tetanus IgG exhibited a marked seroreversion, while no significant loss of serological protection was observed for the other antibodies. Notably, the survival analysis revealed hazard ratios (HR) of 1.28 for pertussis IgG, 1.21 for diphtheria IgG, and a notable 1.40 for tetanus IgG, indicating an accelerated loss of protective immunity, particularly for tetanus. These findings suggest the need for closer monitoring and potentially more frequent booster doses to maintain adequate protection in patients on long-term sirolimus therapy. Emerging evidence suggests that different mTOR inhibitors may have distinct immunomodulatory effects relevant to vaccine responsiveness. In kidney transplant recipients, sirolimus-based immunosuppression was associated with significantly enhanced SARS-CoV-2–specific T-cell responses and higher frequencies of functional memory T cells, particularly within CD4 + + 17 + 18 19 According to the 2017 World Health Organization position paper on tetanus vaccination [ 20 A previously published multicenter study reported that 93% of children with inflammatory bowel disease, regardless of immunosuppressive treatment status, developed protective immunity following Tdap booster immunization [ 21 This study has some limitations in this study. One is the imbalanced sample sizes between the normal vaccination group and the supplemental vaccination group for both Hepatitis B (n = 12 vs. n = 24) and DTaP (n = 10 vs. n = 24). This imbalance was a result of the grouping being based on the actual vaccination status of the enrolled patients, leading to unequal sample sizes. Our post hoc statistical power analysis confirmed that the comparison between these two groups had limited statistical power (0.32–0.57), which may impact the reliability of the observed results. We recognize this limitation and emphasize the need for a larger study to validate our findings and further evaluate the immunogenicity and safety of vaccination in this patient population. Moreover, as this study did not measure sirolimus levels during each vaccination in patients, further research and optimization of the study design are needed to clarify the correlation between sirolimus levels and antibody titers. Currently, there is limited research on the safety and efficacy of vaccinations in children with kaposiform hemangioendothelioma (KHE) undergoing sirolimus therapy, and the existing literature tends to adopt a conservative stance regarding immunization in this population. However, the high rate of missed vaccinations and the consequent increased risk of vaccine-preventable infections in these patients highlight the urgent need to investigate the immunogenicity and safety of routine vaccines in this group. Our findings suggest that both inactivated and live attenuated vaccines can elicit effective and sustained immune responses in KHE patients receiving sirolimus treatment. Nonetheless, due to the limited duration of follow-up in this study, we were unable to fully assess the long-term persistence of immune memory. Future studies with extended follow-up periods are warranted to better evaluate the durability of vaccine-induced immunity during sirolimus therapy. 5. Conclusions This study provides important insights into the safety and immunogenicity of vaccinations in children with kaposiform hemangioendothelioma (KHE) receiving sirolimus therapy. Our findings demonstrate that both inactivated and live-attenuated vaccines can elicit effective and sustained immune responses in this pediatric population under immunosuppressive treatment. Importantly, no serious adverse events were observed following vaccination, indicating that immunization during sirolimus therapy is safe. This study further highlights that despite the immunosuppressive effects of sirolimus, children with KHE can still maintain a robust immune response to vaccines, with seroprotective antibody levels sustained over a significant period. However, some vaccine responses, particularly to tetanus, showed signs of waning over time, underlining the importance of monitoring and adjusting vaccination schedules for children on immunosuppressive therapies. Our results support the continuation of routine vaccinations during sirolimus treatment in children with KHE, with careful clinical monitoring. Further research with longer follow-up periods and larger sample sizes is necessary to fully assess the long-term durability of immune responses and optimize vaccination strategies for this vulnerable population. Additionally, personalized vaccination strategies, particularly regarding tetanus boosters, should be considered for children receiving immunosuppressive therapy. Acknowledgments We would like to extend our deepest gratitude to the patients and their parents and guardians who participated in this study. Their unwavering courage in confronting rare diseases, combined with the selfless dedication of their families, has been the cornerstone of our research. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/vaccines13090903/s1 Author Contributions Conceptualization, M.Z. and K.L.; Data curation, J.Y., Z.Y., Y.D., J.L., Z.W., and W.Y.; Funding acquisition, K.L.; Project administration, M.Z. and K.L.; Supervision, Z.W., W.Y., J.L., M.Z., and K.L.; Writing—original draft, J.Y. and Z.Y.; Writing—review and editing, J.Y., Z.Y., M.Z., and K.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was approved by the Ethical Review Committee of the Children’s Hospital of Fudan University. All procedures were performed in accordance with the Declaration of Helsinki. Informed Consent Statement Every patient was fully informed of the study and the risks of participation and gave written informed consent. Data Availability Statement The original contributions presented in the study are included in the article/ Supplementary Material Conflicts of Interest The authors declare no conflicts of interest in this work. Abbreviations The following abbreviations are used in this manuscript: Abbreviation Full terms APTT Activated Partial Thromboplastin Time bOPV bivalent Oral Polio Vaccine DTaP Diphtheria and Tetanus Toxoid with Acellular Pertussis Vaccine DTP Diphtheria Tetanus Pertussis Vaccine FIB Fibrinogen HBs-Ab Hepatitis B Surface Antibody IgG Immunoglobulin G JE Japanese Encephalitis KHE Kaposiform Hemangioendothelioma KMP Kasabach–Merritt Phenomenon MMR Measles, Mumps, and Rubella Vaccine MRI Nuclear Magnetic Resonance Imaging mTOR Mammalian target of Rapamycin PT Prothrombin Time VPI Vaccine-Preventable Infections References 1. Ji Y. Chen S. Yang K. Xia C. Li L. Kaposiform hemangioendothelioma: Current knowledge and future perspectives Orphanet J. Rare Dis. 2020 15 39 10.1186/s13023-020-1320-1 32014025 PMC6998257 2. Li K. Current status and recent advances in drug therapies of Kaposiform hemangioendothelioma J. Clin. Pediatr. Surg. 2019 18 626 628 10.3969/j.issn.1671-6353.2019.08.002 3. Glanz J.M. McClure D.L. Magid D.J. Daley M.F. France E.K. Salmon D.A. Hambidge S.J. Parental refusal of pertussis vaccination is associated with an increased risk of pertussis infection in children Pediatrics 2009 123 1446 1451 10.1542/peds.2008-2150 19482753 4. Glanz J.M. McClure D.L. O’Leary S.T. Narwaney K.J. Magid D.J. Daley M.F. Hambidge S.J. Parental decline of pneumococcal vaccination and risk of pneumococcal related disease in children Vaccine 2011 29 994 999 10.1016/j.vaccine.2010.11.085 21145372 PMC3026079 5. Feldman A.G. Curtis D.J. Moore S.L. Kempe A. Under-immunization of pediatric transplant recipients: A call to action for the pediatric community Pediatr. Res. 2020 87 277 281 10.1038/s41390-019-0507-4 31330527 PMC6962534 6. Hill H.A. Elam-Evans L.D. Yankey D. Singleton J.A. Kang Y. Vaccination Coverage Among Children Aged 19-35 Months—United States, 2016 MMWR Morb. Mortal. Wkly. Rep. 2017 66 1171 1177 10.15585/mmwr.mm6643a3 29095807 PMC5689213 7. Feldman A.G. Beaty B.L. Curtis D. Juarez-Colunga E. Kempe A. Incidence of Hospitalization for Vaccine-Preventable Infections in Children Following Solid Organ Transplant and Associated Morbidity, Mortality, and Costs JAMA Pediatr. 2019 173 260 268 10.1001/jamapediatrics.2018.4954 30640369 PMC6439884 8. Vascular Tumor and Vascular Malformation Group Plastic Surgery Branch Chinese Medical Association Guidelines for the Diagnosis and Treatment of Hemangiomas and Vascular Malformations (2019 Edition) Zu Zhi Gong Cheng Yu Chong Jian Wai Ke Za Zhi (In Chinese) 2019 15 277 317 10.3969/j.issn.1673-0364.2019.05.001 9. Zhou J. Qiu T. Zhang Z. Lan Y. Huo R. Xiang B. Chen S. Qiu L. Xia C. Xu X. Consensus statement for the diagnosis, treatment, and prognosis of kaposiform hemangioendothelioma Int. J. Cancer 2025 156 1986 1994 10.1002/ijc.35344 39831682 10. Gao M.X. Wang N. Tian J. Ma Z.H. Wu Y. Wang X.Y. Zhang S.Y. Yang M.Y. Wang W.B. Huang Z.Y. Factors associated with timely vaccination of pertussis-containing vaccines in children born from 2019 to 2023, Shanghai Zhonghua Liu Xing Bing Xue Za Zhi 2024 45 1216 1223 10.3760/cma.j.cn112338-20240506-00238 39307694 11. Mao B. Zhang Q. Ma L. Zhao D.S. Zhao P. Yan P. Overview of Research into mTOR Inhibitors Molecules 2022 27 5295 10.3390/molecules27165295 36014530 PMC9413691 12. Shan Y. Tian R. Gao H. Zhang L. Li J. Xie C. Liang Y. Chen Y. Wang J. Xu M. Sirolimus for the treatment of kaposiform hemangioendothelioma: In a trough level-dependent way J. Dermatol. 2021 48 1201 1209 10.1111/1346-8138.15905 33932303 13. Alanko S. Pelliniemi T.T. Salmi T.T. Recovery of blood B-lymphocytes and serum immunoglobulins after chemotherapy for childhood acute lymphoblastic leukemia Cancer 1992 69 1481 1486 10.1002/1097-0142(19920315)69:6&#x0003c;1481::AID-CNCR2820690628&#x0003e;3.0.CO;2-L 1540885 14. Rubin L.G. Levin M.J. Ljungman P. Davies E.G. Avery R. Tomblyn M. Bousvaros A. Dhanireddy S. Sung L. Keyserling H. 2013 IDSA clinical practice guideline for vaccination of the immunocompromised host Clin. Infect. Dis. 2014 58 309 318 10.1093/cid/cit816 24421306 15. Bochennek K. Allwinn R. Langer R. Becker M. Keppler O.T. Klingebiel T. Lehrnbecher T. Differential loss of humoral immunity against measles, mumps, rubella and varicella-zoster virus in children treated for cancer Vaccine 2014 32 3357 3361 10.1016/j.vaccine.2014.04.042 24793952 16. Shams Shahemabadi A. Salehi F. Hashemi A. Vakili M. Zare F. Esphandyari N. Kashanian S. Assessment of antibody titers and immunity to Hepatitis B in children receiving chemotherapy Iran. J. Ped Hematol. Oncol. 2012 2 133 139 24575253 PMC3915435 17. Perkins G.B. Tunbridge M.J. Chai C.S. Hope C.M. Yeow A.E.L. Salehi T. Singer J. Shi B. Masavuli M.G. Mekonnen Z.A. Mechanistic Target of Rapamycin Inhibitors and Vaccine Response in Kidney Transplant Recipients J. Am. Soc. Nephrol. 2025 10.1681/ASN.0000000716 40403135 18. Wang Y. Wang X.Y. Subjeck J.R. Shrikant P.A. Kim H.L. Temsirolimus, an mTOR inhibitor, enhances anti-tumour effects of heat shock protein cancer vaccines Br. J. Cancer 2011 104 643 652 10.1038/bjc.2011.15 21285988 PMC3049595 19. Niu H. Bai C. Zhu B. Zhang Y. Rapamycin improves the long-term T-cell memory and protective efficacy of tuberculosis subunit vaccine Microb. Pathog. 2024 190 106631 10.1016/j.micpath.2024.106631 38537761 20. World Health Organization Tetanus vaccines: WHO position paper, February 2017—Recommendations Vaccine 2018 36 3573 3575 10.1016/j.vaccine.2017.02.034 28427847 21. Dembiński Ł. Krzesiek E. Klincewicz B. Grzybowska-Chlebowczyk U. Demkow U. Banaszkiewicz A. Radzikowski A. Immunogenicity of Diphtheria Booster Vaccination in Adolescents with Inflammatory Bowel Disease Pediatr. Infect. Dis. J. 2020 39 244 246 10.1097/INF.0000000000002547 32032309 Figure 1 Inclusion and exclusion criteria for enrollment. Figure 2 Changes in complete blood count (CBC) and coagulation function before and after vaccination. ns, not significant. Figure 3 HBs-Ab concentration level before and after Hepatitis B vaccination. ns, not significant, ****, p Figure 4 Levels of antibody concentration before and after DTaP vaccination. ns, not significant, ****, p Figure 5 Levels of antibody concentration before and after MMR vaccination. ns, not significant, *, p p vaccines-13-00903-t001_Table 1 Table 1 Basic characteristics of children with KHE prior to vaccine catch-up. Features Numerical Value Sex (number, n)  male 32 female 24 Age (mean ± SD 1 4.7 ± 1.6 0–1 year (number, n) 13 1–3 year 20 >3 year 23 Age of onset (mean ± SD, year) 0.59 ± 1.22 >1 month (number, n) 16 1 month–1 year 20 >1 year 20 Age of initiation of sirolimus treatment (mean ± SD, year) 1.18 ± 1.44 Duration of sirolimus administration (mean ± SD, month) 18.2 ± 13.8 Previous occurrence of KMP (number, n)  Yes 28 No 28 Platelets, hemoglobin and coagulation before catcj-up vaccination PLT 2 9 334.7 ± 88.2 Hb 3 121.1 ± 8.5 APTT 4 38.9 ± 4.2 PT 5 12.6 ± 0.5 fibrinogen (mean ± SD, g/L) 2.54 ± 0.71 D-dimer (mean ± SD, mg/L) 0.45 ± 0.31 1 2 3 4 5 vaccines-13-00903-t002_Table 2 Table 2 Clinically observed adverse reaction following vaccination.  Occurrences (n, %) Mild Adverse Reaction  Pain at the injection site 15 (1.9%) Redness at the injection site 75 (9.6%) Swelling at the injection site 39 (5%) fever 8 (1%) Severe Adverse Reaction  Severe allergy 0 (0%) Shock 0 (0%) Lesion enlargement 0 (0%) Pain at the site of the lesion 0 (0%) Note: Pain at the injection site, crying or spontaneous pain when the limb is moved, redness at the injection site, redness and swelling measuring > 20 mm in diameter, fever, temperature > 38 °C. vaccines-13-00903-t003_Table 3 Table 3 The number of children immunoprotected by antibody levels at various times following DTaP vaccination. Type of Vaccine DTaP Routine Vaccination Group (n, %) DTaP Catch-Up Vaccination Group (n, %) Post-Vaccination Post-Vaccination Above 6 Months (n = 8) Post-Vaccination Post-Vaccination Above 6 Months (n = 18) Pertussis 10 (100%) 8 (100%) 24 (100%) 18 (100%) Diphtheria 9 (90%) 7 (87.5%) 23 (95.8%) 16 (88.9%) Tetanus 9 (90%) 1 (12.5%) 24 (100%) 2 (11.1%) Note: A pertussis IgG antibody concentration of >1 IU/mL is considered to provide long-term protection. Diphtheria IgG antibody: A concentration of >0.1 IU/mL is immunoprotective. Tetanus IgG antibody: A concentration of >1.0 IU/mL is immunoprotective. ",
  "metadata": {
    "Title of this paper": "Immunogenicity of Diphtheria Booster Vaccination in Adolescents with Inflammatory Bowel Disease",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474110/"
  }
}