{
  "title": "Paper_358",
  "abstract": "pmc Open Vet J Open Vet J 2846 openvetj Open Veterinary Journal 2226-4485 2218-6050 Faculty of Veterinary Medicine, University of Tripoli PMC12483463 PMC12483463.1 12483463 12483463 41035965 10.5455/OVJ.2025.v15.i8.40 OpenVetJ-15-8-3759 1 Research Article In silico Shobahah Jauharotus  1  2 Wahyuningsih Sri Puji Astuti  3  * Winarni Dwi  3 Herdiansyah Mochammad Aqilah  3 Aly M Ainun Najib  4 1 2 3 4 * sri-p-a-w@fst.unair.ac.id 2025 31 8 2025 15 8 498022 3759 3769 19 6 2025 22 7 2025 27 7 2025 01 01 2025 01 10 2025 02 10 2025 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Background: The potential anticancer properties of vitamin D3 (cholecalciferol) have garnered growing interest. Epidemiological and preclinical studies suggest an inverse correlation between vitamin D3 levels and CRC incidence. However, the precise molecular mechanisms and direct targets through which vitamin D3 exerts anticancer effects remain inadequately characterized. Aim: This study aimed to investigate the dual-targeting potential of vitamin D3 against two key oncogenic proteins involved in the pathogenesis of CRC: cyclin-dependent kinase 2 (CDK2), a critical regulator of cell cycle progression, and B-cell lymphoma 2 (Bcl-2), an anti-apoptotic protein implicated in tumor survival. Method: Molecular docking was performed to assess the binding affinity of vitamin D3 to CDK2 and Bcl-2. Molecular dynamics simulations were used to evaluate the stability of the docked complexes over time. Absorption, distribution, metabolism, excretion, and toxicity (ADMET) analysis was performed to predict the pharmacokinetics and safety profile of vitamin D3. Results: Docking analysis revealed strong binding affinities of vitamin D3 to both CDK2 (−9.5 kcal/mol) and Bcl-2 (−8.2 kcal/mol), suggesting stable interactions at the ATP-binding site of CDK2 and the BH3-binding groove of Bcl-2. Molecular dynamics simulations confirmed the conformational stability and sustained interactions of vitamin D3 with both targets throughout the simulation period. ADMET predictions indicated favorable oral bioavailability, low toxicity, and acceptable absorption and distribution characteristics, although solubility and plasma protein binding were limited. Conclusion: This study provides the first computational evidence that vitamin D3 may exert anticancer effects in CRC via dual mechanisms—cell cycle arrest through CDK2 inhibition and apoptosis induction through Bcl-2 modulation. These findings offer a novel perspective on the therapeutic repositioning of vitamin D3 as a multi-target agent in CRC management and warrant further validation through in vitro and in vivo studies. Bcl-2 CDK2 Colorectal cancer Molecular docking vitamin D3 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction As one of the leading causes of cancer-related deaths worldwide, colorectal cancer (CRC) continues to pose a serious public health risk ( Roshandel et al Yasmeen et al Weiswald et al Tadesse et al Tukaram Patil et al Alam et al Vitamin D3 was originally identified as a calcium metabolism regulator and is now known to exert pleiotropic effects on cell division, proliferation, and apoptosis ( Samuel and Sitrin, 2008 Wang et al Zhou et al Varghese et al Blasiak et al Wang et al To date, no published studies have explicitly examined the effect of vitamin D3 on CDK2 expression or activity in CRC, indicating a gap in the literature that this study aims to address through computational modeling. Despite the established roles of CDK2 and Bcl-2 in the progression of CRC, the possibility that vitamin D3 could directly bind and inhibit both proteins has not been adequately explored. Furthermore, no experimental or computational study has investigated the dual-targeting potential of vitamin D3 against these two oncogenic drivers. Considering that CDK2 and Bcl-2 regulate distinct yet complementary cancer hallmarks—cell cycle dysregulation and apoptosis evasion—their simultaneous inhibition could yield synergistic therapeutic effects. Vitamin D3 is an attractive candidate for such dual-target therapy given its multifaceted biological activity, favorable safety profile, and potential for drug repositioning. Therefore, this study employs an integrated in silico Materials and Methods Molecular docking and ligand preparation The two-dimensional (2D) chemical structure of vitamin D was illustrated using ChemDraw version 18 (PerkinElmer Informatics Inc., Shelton, WA, USA) and subsequently converted into a three-dimensional (3D) conformation using Chem3D version 18. The canonical SMILES notation for further analysis was retrieved from the PubChem database (https://pubchem.ncbi.nlm.nih.gov/). Crystal structures of CDK2 in complex with AZD5438 (PDB ID: 6GUE) and Bcl-2 bound to Navitoclax (PDB ID: 4LXD) were acquired from the RCSB Protein Data Bank (https://www.rcsb.org/). All co-crystallized ligands and water molecules were detached utilizing BIOVIA Discovery Studio 2019 (Dassault Systèmes BIOVIA, San Diego, CA, USA). The receptor structures were prepared for docking, and their binding sites were identified based on the original ligand positions. Three known inhibitors were used as reference ligands to benchmark the docking performance: AZD5438 (for CDK2) , Alifiansyah et al Herdiansyah et al Molecular dynamics simulation To assess the structural dynamics of the ligand–protein complexes, molecular dynamics simulations were performed using the CABS-flex 3.0 web server (https://lcbio.pl/cabsflex3/). This coarse-grained simulation platform generates an ensemble of protein conformations that reflect flexibility and conformational changes over time. The resulting models were analyzed to extract the root mean square fluctuation (RMSF) and radius of gyration (Rg) values directly from the simulation output. In addition, root mean square deviation (RMSD) values were calculated manually by aligning the ensemble of PDB models to the initial structure using PyMOL, with each model superimposed onto the first frame to identify backbone deviations throughout the trajectory. These parameters collectively provided insight into the conformational flexibility, compactness, and structural stability of each complex during simulation. ADMET parameter analysis ADMETlab 2.0, an in silico Ethical approval Not needed for this study. Results This new study examined the binding affinity of vitamin D3 with various proteins associated with CRC onset. The attributes of vitamin D3, derived from PubChem, along with its chemical structure illustration ( Fig. 1 Table 1 The molecular docking of vitamin D3 ( Table 2 Fig. 1. Chemical structure of vitamin D. Table 1. The characteristics of vitamin D3. Property Details PubChem CID 5280795 Synonyms Cholecalciferol Molecular formula C27H44O Molecular weight 384.6 XLogP3-AA 7.9 Topological polar surface area 20.2 Å² Complexity 610 Covalently bonded unit count 1 CAS 67-97-0 Heavy atom count 28 Rotatable bond count 6 Hydrogen bond donor count 1 Hydrogen bond acceptor count 1 Moreover, molecular docking revealed that vitamin D3 interacted with residues located in the functional regions of both target proteins ( Table 3 Fig. 2A Fig. 2B Table 3 Table 2. Molecular docking-based binding affinity (kcal/mol) of vitamin D3 and known inhibitors against CDK2 and Bcl-2 for benchmarking purposes. Compound Protein receptors Complex binding affinity (kcal/mol) Vitamin D3 CDK2 −9.5 Bcl-2 −8.2 Quercetin (control) CDK2 −9.0 Bcl-2 −7.5 AZD5438 (CDK2-specific control) CDK2 −9.0 Navitoclax (Bcl-2-specific control) Bcl-2 −10.7 Table 3. Amino acid residues and interaction types involved in CDK2 and Bcl-2 as predicted by molecular docking. Compound Protein receptors Type of interaction Amino acids involved in interactions Vitamin D3 CDK2 vdw His84(C), Leu83(C), Gln85(C), Asp86(C), Gly11(C), Gln131(C), Leu134(C), Glu12(C), Ala144(C), Ala31(C), Lys33(C), Gly13(C), Asp145(C) HI Phe82(C), Ile10(C), Val18(C), Val64(C), Phe80(C) PHI Lys89(C) Bcl-2 vdw Gly142(A), Arg143(A), Ala146(A), Asp108(A), Val130(A), Phe150(A), Glu149(A), Val153(A), Phe109(A) HI Met112(A), Tyr105(A), Phe101(A), Leu134(A) Figure 3A Figure 3B The molecular dynamics (MD) models of CDK2 and Bcl-2 proteins obtained from CABS-flex 3.0 are presented in Figure 4A and B Figure 4A Figure 4B Fig. 2. Two-dimensional visualization of the interaction of the receptor–compound complex. (A) CDK2. (B) Bcl-2. Yellow-outlined residues (e.g., Val64, Ile10, Lys89 in Fig. a; Met112, Phe101, Tyr105 in Fig. b): These are critical residues within the binding pocket that play essential roles in ligand recognition, binding affinity, and selectivity. Fig. 3. Three-dimensional molecular interaction binding of protein interacted with vitamin D3. (A) CDK2. (B) Bcl-2. Furthermore, MD simulations demonstrated that both CDK2–vitamin D3 and Bcl-2–vitamin D3 complexes exhibited limited backbone fluctuations ( Fig. 5 Table 4 Fig. 5A Fig. 6 Table 4 According to the ADMET study, vitamin D3 exhibited favorable pharmacokinetic and safety characteristics. Its favorable intestinal absorption (93.784%) and low Caco-2 cell permeability (1.219 log Papp in 10⁻⁶ cm/s) suggest good oral absorption potential. Vitamin D3 also demonstrated moderate blood–brain barrier permeability (0.774 log BB) and low CNS permeability (−1.412 log PS), indicating minimal central nervous system penetration. However, two limitations were identified: its water solubility was notably low (−6.738 log mol/l), and its plasma protein binding was predicted to be complete (fraction unbound = 0), potentially reducing the bioavailable free drug in circulation. Despite these challenges, the compound exhibited no significant interaction with P-glycoprotein or major cytochrome P450 enzymes. The metabolism profile identified it as a CYP3A4 substrate but not as an inhibitor of other key CYP enzymes, indicating low potential for metabolic drug–drug interactions. Excretion data showed a total clearance of 0.83 log ml/min/kg with no involvement of the renal OCT2 transporter. Vitamin D3 was predicted to be non-mutagenic, with no hERG I inhibition and only mild hERG II interaction. Vitamin D3 is pharmacologically well-tolerated, as evidenced by values within the acceptable range when the maximum tolerated dose and lowest observed adverse effect level were evaluated. Discussion In silico Fig. 4. Molecular dynamics model of protein interacted with vitamin D3. (A) CDK2. (B) Bcl-2. The function of vitamin D3 in regulating the expression and activity of carcinogenic proteins, such as Bcl-2 and CDK2, has been previously investigated. Although there is currently no concrete proof that vitamin D3 affects CDK2 in CRC, studies on gastric cancer cells have revealed that it can suppress CDK2 expression via a mechanism that is dependent on the vitamin D receptor (VDR), leading to cell cycle arrest and decreased cell proliferation ( Li et al Almaimani et al Varghese et al Blasiak et al Wang et al in silico Fig. 5. RMSF plot of protein interacted with vitamin D3 and highlighted key residue. (A) CDK2. (B) Bcl-2, highlighting key ligand-binding residues—CDK2: Ile10 (red), Lys33 (orange), Val64 (green); Bcl-2: Phe101 (red), Tyr105 (orange), Met112 (green). RMSF values are shown by residue number; colored markers indicate key interaction sites. The dual-target in silico Table 2 Table 4. Molecular dynamics simulation parameters of vitamin D3 interaction with CDK-2 and Bcl-2 proteins. Complexes ∑ Radius of gyration value ∑ RMSF value RMSD value Vitamin D3 and CDK-2 complexes 1.000 1.545 3.638 Vitamin D3 and Bcl-2 complexes 1.000 1.943 3.249 In addition, quercetin was included as a phytochemical control because of its broad-spectrum anticancer properties and its reported interactions with both CDKs and Bcl-2 family proteins. Its moderate docking scores (−9.0 kcal/mol for CDK2, −7.5 kcal/mol for Bcl-2) reflect its polypharmacological nature. Interestingly, vitamin D3 exhibited superior binding interactions with both CDK2 and Bcl-2 compared with quercetin, thereby reinforcing its potential as a dual-targeted anticancer compound with enhanced safety characteristics. CDK2 is crucial for cell cycle regulation, especially during the G1 to S phase transition, and its aberrant activation is significantly linked to the advancement of multiple malignancies, including CRC. Consequently, CDK2 has become a desirable molecular target in the search for innovative anticancer treatments ( Shi et al Zhang et al Tadesse et al Bogoyevitch et al Harrison et al Duncan et al Olivieri et al Fig. 6. Radius of gyration of protein interacted with vitamin D3 and highlighted key residue. (A) CDK2. (B) Bcl-2. To provide a deeper understanding, this study revealed that vitamin D3 binds to CDK2 with high affinity by interacting with key residues located within the ATP-binding pocket, notably Lys89, Val64, and Ile10 ( Table 3 Talapati et al Rout et al Gaby and Singh, 2024 Nekoukar et al Furthermore, it was discovered that the residues Phe101, Tyr105, and Met112 of the Bcl-2 protein structure interact with vitamin D3 ( Table 3 Reddy et al In particular, Met112 stabilizes the interaction by being a component of the hydrophobic core, while Phe101 and Tyr105 help to create the hydrophobic environment necessary for effective BH3 domain recognition ( Joseph et al Unlike Navitoclax, which is known has the ability to inhibit Bcl-XL and causes thrombocytopenia, vitamin D3 interacts with the BH3-binding groove without producing similar hematological adverse effects. This difference shows its promise as a safer substitute for modifying anti-apoptotic pathways ( Wang et al Mhaibes and Abdul- Wahab2, 2023 The residue-level RMSF analysis ( Table 4 Fig. 5A Fig. 5B Fig. 6 Table 4 According to our in silico Despite these favorable properties, two notable pharmacokinetic limitations were identified. The water solubility of vitamin D3 is extremely low (−6.738 log mol/l), which may hinder its dissolution and absorption in the gastrointestinal tract. Second, its plasma protein binding is predicted to be very high (fraction unbound = 0), indicating that the compound is entirely bound in circulation, potentially reducing the concentration of free, bioactive drug. These characteristics may impair its effective systemic delivery, necessitating formulation strategies—such as nanoparticle encapsulation or lipid-based carriers—to improve bioavailability. Furthermore, vitamin D3 exhibits a favorable safety profile, with no AMES toxicity, no CYP inhibition, and acceptable acute and chronic toxicity levels. Although one hERG II inhibition was predicted, no inhibition was observed for hERG I, suggesting limited cardiotoxicity. All of these results offer compelling evidence for the advancement of vitamin D3 as a treatment option for CRC, especially when combined with delivery methods that are optimized to get around the vitamin’s high protein binding and solubility issues. Building on these discoveries, these results offer a strong case for more research into vitamin D3 as a multi-target therapeutic agent that may have fewer adverse effects than traditional inhibitors. To close the gap between computational predictions and biological relevance, experimental validation remains crucial. Dissociation constants (Kd) and real-time binding kinetics can be measured using methods such as surface plasmon resonance, which provide concrete proof of molecular interaction. The thermodynamic parameters controlling the binding process are revealed by isothermal titration calorimetry, and thermal shift assays make it possible to evaluate the ligand-induced stabilization of target proteins. These biophysical techniques are frequently used in early-stage drug discovery and are especially useful for confirming theories derived from docking ( Bernacchi and Ennifar, 2020 Saridakis and Coste, 2021 et al Conclusion This work highlights the potential of vitamin D3 to act as a dual inhibitor of CDK2 and Bcl-2, two important molecular drivers in the pathophysiology of CRC. Its potential for dual-pathway therapeutic approaches in CRC is highlighted by its stable binding interactions, desirable ADMET properties, and capacity to influence cell proliferation and apoptosis simultaneously. Previous studies have reported that vitamin D3 reduces CDK2 and Bcl-2 expression levels or modulates their signaling cascades. Although these studies confirm its biological impact, they predominantly represent indirect regulatory effects. Further validation using biophysical techniques should be conducted to confirm the direct binding interactions predicted in this computational analysis, followed by more in-depth investigations through in vitro in vivo Acknowledgements This work was supported by the Indonesia Endowment Fund for Education (LPDP). Conflict of interest The authors declare that they have no competing interests. Funding This work was supported by the Indonesia Endowment Fund for Education (LPDP), Ministry of Finance of the Republic of Indonesia, Grant Number 202312211582593. Authors’ contributions The experiments were conceived and designed by Jauharotus Shobahah and Sri Puji Astuti Wahyuningsih. Jauharotus Shobahah and Mochammad Aqilah Herdiansyah performed the experiments. Jauharotus Shobahah, Mochammad Aqilah Herdiansyah, M. Ainun Najib Aly, and Dwi Winarni participated in the data analysis. Jauharotus Shobahah and Sri Puji Astuti Wahyuningsih drafted the manuscript. All authors have read and approved the final version of the manuscript. Data availability All data supporting the findings of this study are available within the manuscript. Abbreviations ADMET, absorption, distribution, metabolism, excretion, toxicity; Bcl-2, B-cell lymphoma 2; CDK2, cyclin-dependent kinase 2; CRC, colorectal cancer; Rg, radius of gyration; RMSD, root mean square deviation; RMSF, root mean square fluctuation. References Alam M. Ali S. Mohammad T. Hasan G.M. Yadav D.K. Hassan M.I. B cell lymphoma 2: a potential therapeutic target for cancer therapy Int. J. Mol. Sci 2021 22 19 10442 https://doi:10.3390/ijms221910442 34638779 10.3390/ijms221910442 PMC8509036 Alifiansyah M.R. Herdiansyah M.A. Pratiwi R.C. Pramesti R.P. Hafsyah N.W. Rania A.P. Putra J.E. Cahyono P.A. Muhammad S.K. Murtadlo A.A. Kharisma V.D. QSAR of acyl alizarin red biocompound derivatives of rubia tinctorumu roots and Its ADMET properties as anti-breast cancer candidates against MMP-9 protein receptor: in silico Food Syst 2024 7 2 312 320 https://doi:10.21323/2618-9771-2024-7-2-312-320 Almaimani R.A. Aslam A. Ahmad J. El-Readi M.Z. El-Boshy M.E. Abdelghany A.H. Idris S. Alhadrami M. Althubiti M. Almasmoum H.A. Ghaith M.M. Elzubeir M.E. Eid S.Y. Refaat B. In vivo and in vitro enhanced tumoricidal effects of metformin, active vitamin D3, and 5-fluorouracil triple therapy against colon cancer by modulating the PI3K/Akt/PTEN/mTOR network Cancers 2022 14 6 1538 https://doi:10.3390/cancers14061538 35326689 10.3390/cancers14061538 PMC8946120 Banjare P. Sarthi A.S. Singh J. Roy P.P. In-silico approaches in drug discovery and design of anti-allergic agents Front. Clin. Drug Res. - Anti Allergy Agents 2020 4 94 https://doi:10.2174/9789811428395120040006 Bernacchi S. Ennifar E. Analysis of the HIV-1 genomic RNA dimerization initiation site binding to aminoglycoside antibiotics using isothermal titration calorimetry Methods Mol. Biol 2020 2113 237 250 https://doi.org/10.1007/978-1-0716-0278-2_16 32006318 10.1007/978-1-0716-0278-2_16 Bhati A.P. Wan S. Alfè D. Clyde A.R. Bode M. Tan L. Titov M. Merzky A. Turilli M. Jha S. Highfield R.R. Pandemic drugs at pandemic speed: infrastructure for accelerating COVID-19 drug discovery with hybrid machine learning- and physics-based simulations on high-performance computers Interface Focus 2021 11 6 20210018 https://doi:10.1098/rsfs.2021.0018 34956592 10.1098/rsfs.2021.0018 PMC8504892 Bisht N. Sah A.N. Bisht S. Joshi H. Emerging need of today: significant utilization of various databases and softwares in drug design and development Mini. Rev. Med. Chem 2021 21 8 1025 1032 https://doi:10.2174/1389557520666201214101329 33319657 10.2174/1389557520666201214101329 Blasiak J. Chojnacki J. Pawlowska E. Jablkowska A. Chojnacki C. Vitamin D may protect against breast cancer through the regulation of long noncoding RNAs by VDR signaling Int. J. Mol. Sci 2022 23 6 3189 https://doi:10.3390/ijms23063189 35328609 10.3390/ijms23063189 PMC8950893 Bogoyevitch M.A. Barr R.K. Ketterman A.J. Peptide inhibitors of protein kinases—discovery, characterisation and use Biochim. Biophys. Acta 2005 1754 1–2 79 99 https://doi:10.1016/j.bbapap.2005.07.025 16182621 10.1016/j.bbapap.2005.07.025 Duncan James S. Haystead Timothy AJ Litchfield David W Chemoproteomic characterization of protein kinase inhibitors using immobilized ATP Methods. Mol. Biol 2012 795 119 134 https://doi:10.1007/978-1-61779-337-0_8 21960219 10.1007/978-1-61779-337-0_8 Gaby S.K. Singh V.N. Vitamin D In Vitamin intake and health 2024 Boca Raton CRC Press 59 70 https://doi:10.1201/9781003573777-4. Harrison S. Das K. Karim F. Maclean D. Mendel D. Non-ATP-competitive kinase inhibitors - enhancing selectivity through new inhibition strategies Expert Opin. Drug Discov 2008 3 7 761 774 https://doi:10.1517/17460441.3.7.761 23496219 10.1517/17460441.3.7.761 Herdiansyah M.A. Rizaldy R. Alifiansyah M.R. Fetty A.J. Anggraini D. Agustina N. Alfian F.R. Setianingsih P.N. Elfianah V. Aulia H.S. Putra J.E. Ansori A.N. Kharisma V.D. Jakhmola V. Purnobasuki H. Pratiwi I.A. Rebezov M. Shmeleva S. Bonkalo T. Kovalchuk D.F. Zainul R. Molecular interaction analysis of ferulic acid (4-hydroxy-3-methoxycinnamic acid) as main bioactive compound from palm oil waste against MCF-7 receptors: an in silico study Narra. J 2024 4 2 e775 https://doi:10.52225/narra.v4i2.775 39280296 10.52225/narra.v4i2.775 PMC11391962 Joseph M.K. Solomon L.R. Petros A.M. Cai J. Simmer R.L. Zhang H. Rosenberg S. Ng S.C. Divergence of Genbank and human tumor Bcl-2 sequences and implications for binding affinity to key apoptotic proteins Oncogene 2004 23 3 835 838 https://doi:10.1038/sj.onc.1207141 14737118 10.1038/sj.onc.1207141 Li M. Li L. Zhang L. Hu W. Shen J. Xiao Z. Wu X. Chan F.L. Cho C.H. 1,25-Dihydroxyvitamin D3 suppresses gastric cancer cell growth through VDR- and mutant p53-mediated induction of p21 Life Sci 2017 179 88 97 https://doi:10.1016/j.lfs.2017.04.021 28465245 10.1016/j.lfs.2017.04.021 Mhaibes A.M. Abdul-Wahab2 F.K. Possible effects of vitamin D3 and levofloxacin on selected hematology parameter of rats Iraqi J. Pharm. Sci 2023 32 74 84 https://doi:10.31351/vol32issSuppl.pp74-84 Nekoukar Z. Manouchehri A. Zakariaei Z. Accidental vitamin D3 overdose in a young man Int. J. Vitamin Nutr. Res 2024 94 2 82 85 https://doi:10.1024/0300-9831/a000798 10.1024/0300-9831/a000798 37975856 Olivieri C. Li G.C. Wang Y. VS M. Walker C. Kim J. Camilloni C. De Simone A. Vendruscolo M. Bernlohr D.A. Taylor S.S. ATP-competitive inhibitors modulate the substrate binding cooperativity of a kinase by altering its conformational entropy Sci. Adv 2022 8 30 eabo0696 https://doi:10.1126/sciadv.abo0696. 35905186 10.1126/sciadv.abo0696 PMC9337769 Reddy C.N. Manzar N. Ateeq B. Sankararamakrishnan R. Computational design of BH3-mimetic peptide inhibitors that can bind specifically to Mcl-1 or Bcl-XL: role of non-hot spot residues Biochemistry 2020 59 45 4379 4394 https://doi:10.1021/acs.biochem.0c00661 33146015 10.1021/acs.biochem.0c00661 Roshandel G. Ghasemi-Kebria F. Malekzadeh R. Colorectal Cancer: epidemiology, risk factors, and prevention Cancers 2024 16 8 1530 https://doi:10.3390/cancers16081530 38672612 10.3390/cancers16081530 PMC11049480 Rout A.K. Mishra J. Dehury B. Maharana J. Acharya V. Karna S.K. Parida P.K. Behera B.K. Das B.K. Structural bioinformatics insights into ATP binding mechanism in zebrafish ( Danio rerio J. Cell. Biochem 2019 120 6 9437 9447 https://doi:10.1002/jcb.28219 30569538 10.1002/jcb.28219 Samuel S. Sitrin M.D. Vitamin D’s role in cell proliferation and differentiation Nutr. Rev 2008 66 S116 S124 https://doi:10.1111/j.1753-4887.2008.00094.x 18844838 10.1111/j.1753-4887.2008.00094.x Saridakis E. Coste F. Thermal shift assay for characterizing the stability of RNA helicases and their interaction with ligands Mol. Med. Rep 2021 2209 73 85 https://doi:10.1007/978-1-0716-0935-4_5. 10.1007/978-1-0716-0935-4_5 33201463 Shi X.N. Li H. Yao H. Liu X. Li L. Leung K.S. Kung H.F. Lin M.C.M. Adapalene inhibits the activity of cyclin-dependent kinase 2 in colorectal carcinoma Mol. Med. Rep 2015 12 5 6501 6508 https://doi:10.3892/mmr.2015.4310 26398439 10.3892/mmr.2015.4310 PMC4626183 Binmei Sun Xu Jianmei Liu Shaoqun Li Qing X. Characterization of small molecule–protein interactions using SPR method Methods Mol. Biol 2023 2690 149 159 https://doi:10.1007/978-1-0716-3327-4_15 37450146 10.1007/978-1-0716-3327-4_15 Tadesse S. Anshabo A.T. Portman N. Lim E. Tilley W. Caldon C.E. Wang S. Targeting CDK2 in cancer: challenges and opportunities for therapy Drug Discov. Today 2020 25 2 406 413 https://doi:10.1016/j.drudis.2019.12.001 31839441 10.1016/j.drudis.2019.12.001 Talapati S.R. Goyal M. Nataraj V. Pothuganti M. Sreevidya M.R. Gore S. Ramachandra M. Antony T. More S.S. Rao N.K. Structural and binding studies of cyclin‐dependent Kinase 2 with NU6140 inhibitor Chem. Biol. Drug Design 2021 98 5 857 868 https://doi:10.1111/cbdd.13941 10.1111/cbdd.13941 34423559 Tukaram Patil S. Wilfred Devadass C. Shetty Badila P. Histopathological evaluation and analysis of immunohistochemical expression of Bcl-2 oncoprotein in colorectal carcinoma Iranian J. Pathol 2019 14 4 317 321 https://doi:10.30699/IJP.2019.102982.2028 10.30699/ijp.2019.102982.2028 PMC6824766 31754362 Varghese J.E. Shanmugam V. Rengarajan R.L. Meyyazhagan A. Arumugam V.A. Al-Misned F.A. El-Serehy H.A. Role of vitamin D3 on apoptosis and inflammatory-associated gene in colorectal cancer: an in vitro approach J. King Saud Univ. - Sci 2020 32 6 2786 2789 https://doi:10.1016/j.jksus.2020.06.015 Wang J. Lian H. Zhao Y. Kauss M.A. Spindel S. Vitamin D3 induces autophagy of human myeloid leukemia cells J. Biol. Chem 2008 283 37 25596 25605 18628207 10.1074/jbc.M801716200 Wang Y. He Q. Rong K. Zhu M. Zhao X. Zheng P. Mi Y. Vitamin D3 promotes gastric cancer cell autophagy by mediating p53/AMPK/mTOR signaling Front. Pharmacol 2024 14 1338260 https://doi:10.3389/fphar.2023.1338260 38259281 10.3389/fphar.2023.1338260 PMC10800859 Weiswald L.B. Hasan M.R. Wong J.C.T. Pasiliao C.C. Rahman M. Ren J. Yin Y. Gusscott S. Vacher S. Weng A.P. Kennecke H.F. Bièche I. Schaeffer D.F. Yapp D.T. Tai I.T. Inactivation of the kinase domain of CDK10 prevents tumor growth in a preclinical model of colorectal cancer, and is accompanied by downregulation of Bcl-2 Mol. Cancer Ther 2017 16 10 2292 2303 https://doi:10.1158/1535-7163.MCT-16-0666 28663269 10.1158/1535-7163.MCT-16-0666 Yasmeen A. Berdel W.E. Serve H. Müller-Tidow C. E- and A-type cyclins as markers for cancer diagnosis and prognosis Expert Rev. Mol. Diagn 2003 3 5 617 633 https://doi:10.1586/14737159.3.5.617 14510182 10.1586/14737159.3.5.617 Zhang X. Zhao Y. Wang C. Ju H. Liu W. Zhang X. Miao S. Wang L. Sun Q. Song W. Rhomboid domain-containing protein 1 promotes breast cancer progression by regulating the p-Akt and CDK2 levels Cell Commun. Signal 2018 16 1 65 https://doi:10.1186/s12964-018-0267-5 30286765 10.1186/s12964-018-0267-5 PMC6172813 Zhou J. Ge X. Fan X. Wang J. Miao L. Hang D. Associations of vitamin D status with colorectal cancer risk and survival Int. J. Cancer 2021 149 3 606 614 https://doi:10.1002/ijc.33580 33783821 10.1002/ijc.33580 ",
  "metadata": {
    "Title of this paper": "Associations of vitamin D status with colorectal cancer risk and survival",
    "Journal it was published in:": "Open Veterinary Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483463/"
  }
}