{
  "title": "Paper_758",
  "abstract": "pmc Toxics Toxics 3287 toxics toxics Toxics 2305-6304 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473661 PMC12473661.1 12473661 12473661 41012376 10.3390/toxics13090756 toxics-13-00756 1 Review Polyethylene Microplastics and Human Cells: A Critical Review Valdivia Sharin 1 2 Riquelme Camila 3 Carrasco María Constanza 3 Weisser Paulina 3 https://orcid.org/0000-0003-1311-9492 Añazco Carolina 4 Alarcón Andrés 1 https://orcid.org/0000-0002-8413-8028 Alarcón Sebastián 1 3 * Meccariello Rosaria Academic Editor 1 sharin.valdivia@uss.cl alarcon.andres1707@gmail.com 2 3 camila.riquelme@uss.cl constanza.carrasco@uss.cl paulina.weisser@uss.cl 4 carolina.anazco@uss.cl * sebastian.alarcon@uss.cl 05 9 2025 9 2025 13 9 497672 756 30 6 2025 31 8 2025 04 9 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The widespread production and poor management of plastic waste have led to the pervasive presence of microplastics (MPs) in environmental and biological systems. Among various polymers, polyethylene (PE) is the most widely produced plastic globally, primarily due to its use in single-use packaging. Its persistence in ecosystems and resistance to degradation processes result in the continuous formation of PE-derived MPs. These particles have been detected in human biological matrices, including blood, lungs, placenta, and even the brain, raising increasing concerns about their bioavailability and potential health effects. Once internalized, PE MPs can interact with cellular membranes, induce oxidative stress, inflammation, and apoptosis, and interfere with epigenetic regulatory pathways. In vitro studies on epithelial, immune, and neuronal cells reveal concentration-dependent cytotoxicity, mitochondrial dysfunction, membrane disruption, and activation of pro-inflammatory cytokines. Moreover, recent findings suggest that PE MPs can induce epithelial-to-mesenchymal transition (EMT), senescence, and epigenetic dysregulation, including altered expression of miRNAs and DNA methyltransferases. These cellular changes highlight the potential role of MPs in disease development, especially in cardiovascular, metabolic, and possibly cancer-related conditions. Despite growing evidence, no standardized method currently exists for quantifying MPs in human samples, complicating comparisons across studies. Further, MPs can carry harmful additives and environmental contaminants such as bisphenols, phthalates, dioxins, and heavy metals, which enhance their toxicity. Global estimates indicate that humans ingest and inhale tens of thousands of MPs particles each year, yet long-term human research remains limited. Given these findings, it is crucial to expand research on PE MP toxicodynamics and to establish regulatory policies to reduce their release. Promoting alternative biodegradable materials and improved waste management practices will be vital in decreasing human exposure to MPs and minimizing potential health risks. microplastics polyethylene cellular effects Vicerrectoría de Investigación y Doctorados de la Universidad San Sebastián—Fondo USS-FIN-25-APCS-41 This work was supported by Vicerrectoría de Investigación y Doctorados de la Universidad San Sebastián—Fondo USS-FIN-25-APCS-41. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Since the plastic industry began in the 1950s, global plastic production has grown rapidly, becoming essential to modern society. So far, over 8.3 billion tons of plastic have been produced, with estimates suggesting that annual production could reach 3.4 billion metric tons by 2050 [ 1 2 3 4 There are various types of plastics: polyethylene (PE), polypropylene (PP), polyvinyl Chloride (PVC), polyethylene terephthalate (PET), and polystyrene (PS) stand out [ 2 5 2 5 6 7 MPs are defined as synthetic polymer particles that have a maximum dimension between 1 micrometer (µm) and 5 mm (mm). The size range is divided into larger fractions (1–5 mm) and smaller fractions (1 µm to 1 mm). Nanoplastics (NPs), the smallest recognized fraction of plastic debris, are specifically defined as particles ranging in size from 1 nanometer (nm) to 1 micrometer (µm), thereby existing within the nano-scale [ 8 9 10 8 9 10 Figure 1 11 12 Recent research suggests that MPs can interact with human cells in multiple ways, including disrupting membrane integrity, inducing oxidative stress, inflammation, apoptosis, and interfering with cellular transport mechanisms [ 13 2. Degradation of Polyethylene All plastic polymers, including PE, can degrade through physical, chemical, and biological processes, resulting in the production of persistent environmental particles [ 14 15 Figure 2 16 Photodegradation is a primary factor causing polymer degradation in the environment. PE consists of backbone chains formed by C-C bonds, which do not hydrolyze and resist photodegradation due to the absence of UV-visible chromophores. However, impurities and structural defects acquired during manufacturing can act as chromophores [ 17 18 17 19 20 Biodegradation is another method through which polymers can be broken down. However, because of its chemical characteristics, the biodegradation of PE is a slow and often incomplete process [ 21 Thus, the average lifespan of an HDPE bottle in an aquatic environment can reach 58 years [ 17 22 2 22 23 The degradation of PE not only results in the formation of MPs, but also leads to the release of a wide array of chemical substances into the environment. These chemicals can be broadly categorized into two groups: (1) additives and residual monomers incorporated during the manufacturing process, and (2) environmental pollutants adsorbed onto the plastic surface post-production. Additives are intentionally introduced during polymer synthesis to enhance specific material properties such as durability, flexibility, coloration, and flame retardancy [ 12 24 25 24 While it is true that additives are widely used throughout much of the production line, they are not chemically bonded to the plastic. Additives do confer many properties to plastics; however, many of these products are toxic [ 26 12 24 27 28 12 29 30 31 32 27 33 29 34 35 36 37 38 39 40 40 11 12 41 42 43 44 45 46 47 Therefore, exposure to MPs represents a significant health concern, as epithelial tissues may come into direct contact with toxic substances adsorbed onto their surfaces [ 48 49 50 In summary, the PE degradation process involves complex mechanical, chemical, and biological transformations that ultimately generate MPs and NPs of this polymer. Additionally, these particles, along with the chemical compounds they may transport and deliver to the environment, pose a risk to both the ecosystem and human health. In this context, it is crucial to develop research aimed at understanding PE degradation processes in various environments and their effects on human health, while also designing effective mitigation strategies such as developing biodegradable alternatives and new recycling technologies. 3. Polyethylene and Byproducts: Cellular Interactions PE MPs, once internalized, may elicit a wide range of systemic effects through their persistence, bioaccumulation, and ability to carry toxic chemicals. These MPs have been recovered from human blood [ 9 10 51 52 53 54 55 56 57 58 59 13 60 In this context, a study evaluated the cytotoxicity of MPs on the human cell lines Caco-2, HepG2, and HepaRG to detect any possible impact on the first organs that come into contact with ingested particles: the intestine and the liver. The results of the study demonstrate that particularly 1–4 μm PE MPs were transported to a small but significant extent through the intestinal epithelium in vitro, to a substantially greater degree than PS particles of the same size [ 61 Table 1 62 A study found PE MPs in human brain, kidney, and liver samples ( Figure 3 63 64 toxics-13-00756-t001_Table 1 Table 1 Oxidative Stress and Inflammatory Mechanisms Induced by Polyethylene Microplastics/Nanoplastics in Human Cell Models. Mechanism Evidence Model Key findings Reference Oxidative Stress Increase Mitochondrial Superoxide Caco-2, HT-29 Decrease Viability [ 65 Increase NO Caco-2, A549 Decrease Viability [ 66 Increase ROS HaCaT Down-regulation of cell growth and proliferation inhibition [ 67 Increase ROS T98G, Hela Cell-type specific response [ 68 Increase NO and ROS THP-1, Jurkat, U937 Increase Viability [ 66 Increase ROS, Activation TLR4/NOX2 axis NP cells Alteration cell morphology, [ 69 Increase ROS HCASMCs Decreased Viability [ 70 Inflammation Induce secretion of inflammatory cytokines IL-1β and IL-6 THP-1 Alteration of morphology and [ 71 Increased transcripts for p53 and BMF, Increase LDH, Galectin-3 and RUNX-2, decreased α-SMA HCASMCs Induced apoptosis and altered [ 72 Increased TNF-α, IL-6, Caspase-1 and VOCs HCASMCs Decreased Viability [ 70 Lysosomal Dysfunction (induced autophagosome formation and increased p62 expression THP-1 Decreased Viability [ 73 Phagocytosis of PE MDM Increased Survival [ 74 To date, no longitudinal epidemiological studies have been conducted in humans to assess the potential health effects of MP exposure. Nevertheless, multiple studies using animal models and human cell lines have demonstrated that chronic exposure to MPs is associated with metabolic dysregulation, immune system modulation, and an increased susceptibility to inflammatory and fibrotic pathologies. Emerging in vitro data suggest that even MPs cross the blood–brain barrier and alter neuronal homeostasis. Interestingly, an article shows increased accumulation of MPs in a cohort of human deceased brains diagnosed with dementia, with notable deposition in cerebrovascular walls and immune cells [ 63 75 76 Figure 3 Evidence of PE in human tissues. The figure illustrates the detection of polyethylene (PE) microplastics within various human biological matrices. Particles have been identified in brain [ 63 56 10 63 9 53 52 56 76 57 63 56 59 59 54 58 51 55 Alarmingly, the authors of this study suggest that higher MP particle concentrations in blood were linked to altered coagulability proteins [ 77 10 78 Emerging evidence indicates that MPs, particularly those derived from PE, can disrupt multiple biological systems by interfering with cellular processes. Critical determinants such as particle size, shape, surface charge, and the ability to adsorb and transport environmental contaminants enhance their interaction with human cells and contribute to a wide range of pathophysiological effects [ 79 80 80 81 76 Studies in human cell lines show that exposure to PE MPs induces the epithelial–mesenchymal transition (EMT). Traversa et al. show that acute treatment with PE MPs alter cell morphology but does not impact cell proliferation and viability in human bronchial (BEAS-2B) and alveolar (A549) epithelial cells. They demonstrate that exposure to PE MPs induces modulation of EMT markers, such as Snail 1, Snail 2, Zeb1, Vimentin, N-cadherin, and E-cadherin, in the BEAS-2B and A549 cell lines. Interestingly, the effects of PE MP exposure on cell morphology and EMT induction can be reversed after the removal of PE MPs [ 82 83 83 84 85 86 86 All this data indicates that chronic exposure to PE MPs can affect various cellular processes and may ultimately lead to different clinical manifestations that impact an individual’s health. Recently, a study found MPs in the tissues of patients diagnosed with colorectal cancer (CRC). These studies show that, compared to adjacent non-cancerous tissues, tumor tissues exhibited a greater variety and distribution of MPs, mainly PE and PVC [ 87 Similarly, a study found MPs in 14 of 18 human follicular fluid samples [ 88 4. Limitations of Current Evidence Although there is growing evidence that PE MPs are present in human tissues and may be toxic, there are still major limitations in detecting, measuring, and regulating them. These challenges hinder the development of comprehensive public health policies and impede the creation of guidelines based on robust evidence for exposure. Identifying and characterizing MPs in biological samples like blood, lung tissue, placenta, or brain tissue poses distinct analytical challenges. Right now, there is no one-size-fits-all standard method for isolating and analyzing MPs ( Table 2 89 90 89 91 92 Despite all the available evidence, it is important to understand the higher in vitro doses are often chosen to observe mechanistic effects within short experimental periods and to simulate potential effects of long-term cumulative exposure or localized tissue deposition [ 12 93 94 13 13 79 95 96 Although detecting PE MPs in human samples is a significant advance, the current evidence is limited by several methodological problems. Most studies have small sample sizes and use different analytical methods, often with varying size-detection thresholds and sensitivity to nanoplastics [ 97 89 97 89 91 98 13 79 89 95 96 toxics-13-00756-t002_Table 2 Table 2 Comparative Performance of Analytical Techniques for Detecting and Characterizing Microplastics/Nanoplastics in Biological Matrices. Technique Minimun Detectable Size Strengths Limitations References µFT-IR (1) ≥20 μm Fast, extensive polymer Matrix interference (biofilms or organic matter) can affect spectral quality. [ 89 99 µ-Raman (2) ≈1 μm Typifies sub 10 μm particles. Difficult analysis of embedded or coated particles. Heat-sensitive polymers can be damaged by powerful lasers [ 89 99 Py-GC/MS (3) Determine mass Highly sensitive Requires polymer standards for quantification. It analyzes the total mass of polymers, without discriminating between individual particles [ 98 99 TED-GC/MS (4) Determine mass Rapid polymer screening It does not provide morphological information. It does not discriminate between individual particles [ 99 AF4-MALS (5) ~10–20 nm Separate by size, quantify mass Does not identify polymer type. Not applicable to solid samples. Sensitive to aggregation. [ 91 AF4-MALS-ICP-MS (6) ~10–20 nm Characterizes nano-metal/plastic complexes It does not identify the polymer type. It does not provide morphological information. [ 91 µFT-IR (1) (2) (3) (4) (5) (6) 5. Regulatory Landscape and Policy Challenges Currently, there is no universally accepted standard for MP levels in food, water, or living tissues. Unlike chemical pollutants, MPs are not yet part of the routine monitoring programs at most environmental and public health agencies. Recently, the European Union has taken regulatory action by adding MPs to the REACH Regulation ((EC) No 1907/2006). This move bans the intentional use of MPs in cosmetics, detergents, and some industrial applications [ 100 101 102 National policies also differ greatly. Some countries have enacted partial bans on plastic bags or single-use items, but few have addressed MPs in food or biological exposure. Chile, for example, passed Law No. 21.368 (2021) banning single-use plastics in commercial establishments, yet it does not include regulations on PE MPs or monitoring of human exposure [ 103 104 95 6. Future Prospects As described during the development of this article, the presence of PE MPs and other types of plastics has been noted in various human tissues, indicating that contamination from these particles has transcended the environmental sphere to become a global health concern problem [ 96 105 106 107 108 109 Studies have found MPs in different environments such as beaches, seawater, and seafloor sediments [ 110 111 112 113 114 115 116 117 −4 −4 118 119 92 120 Given the growing number of routes involved in MPs’ human exposure, this is a concern for the potential impact related to the development of diseases. Despite being exposed to MPs through various sources, the implications for human health still remain in a nebulous area of knowledge. Multiple studies have detected the presence of PP, PET, PS and PE in samples or biological fluids ( Figure 3 96 105 52 121 120 122 Nevertheless, there exists literature that contradicts the aforementioned descriptions. Numerous studies found that MPs made from different polymers had no significant effects on cell lines of various origins and mouse models [ 60 −2 123 −2 123 −1 124 Overall, tackling the challenge of MP pollution will require a multidisciplinary approach that combines molecular biology, environmental medicine, public health, nanotechnology, and regulatory policies. The focus should extend beyond merely understanding the potential toxicity of these compounds; it must also include preventing exposure and reducing their entry into the food chain. Given the global scope of plastic pollution and growing evidence of human exposure, we need urgent and coordinated action worldwide. This should involve: (1) developing reliable and standardized methods to detect MPs in human samples; (2) establishing biomonitoring programs for at-risk populations; (3) creating interdisciplinary frameworks that combine environmental science, molecular biology, and public health; and (4) setting toxicological reference doses and exposure limits for high-risk plastics like PE. Until such regulations are in place, precautionary measures—such as cutting single-use plastic consumption, improving waste management, and investing in biodegradable alternatives—remain the most effective public health strategies. 7. Conclusions PE MPs have emerged as more than an environmental concern—they represent a growing threat to human health. Their presence in multiple human biological matrices, including blood, lungs, placenta, and even brain tissue, underscores their capacity to penetrate physiological barriers and accumulate systemically. However, the concentrations reported are consistently lower than those used in experimental models, and their clinical consequences remain largely undefined. Experimental evidence demonstrates that PE MPs can disrupt cellular homeostasis by damaging membranes, increasing oxidative stress, triggering inflammation, and altering epigenetic regulation. These effects vary depending on particle size, surface properties, and their ability to carry toxic environmental contaminants. Although definitive causal links in humans remain unconfirmed due to the absence of longitudinal clinical studies, the convergence of in vitro and in vivo findings supports the need for precautionary measures. Regulatory actions targeting plastic production, usage, and waste management are urgently needed to mitigate exposure risks. Overall, PE MPs should be recognized as emerging pollutants of high concern. Addressing their impact requires not only scientific investigation but also systemic changes in how plastics are produced, consumed, and regulated in modern society. Finally, there is a limited understanding of the bioaccumulation potential, biodistribution, and elimination mechanisms of MPs in the human body. Existing reports of MP detection in blood, placenta, and organs are based on small sample sizes and often lack rigorous contamination control. Taken together, these limitations underscore the urgent need for standardized methodologies, longitudinal human studies, and interdisciplinary research to better characterize the toxicodynamics and health risks associated with environmental exposure to PE MPs. Acknowledgments To San Sebastián and the Escuela de Medicine, Tres Pascualas Campus, Concepcion, USS. To improve the English of this work, the Grammarly tool was used. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.V., C.A. and S.A.; methodology, C.R., P.W. and M.C.C.; software, A.A., C.R. and P.W.; validation, S.V., C.A. and S.A.; formal analysis, S.V., C.A. and S.A.; investigation, S.V., C.R., M.C.C., P.W. and A.A.; resources, S.V. and S.A.; data curation, S.V., C.A. and C.R.; writing—original draft preparation, C.R., P.W. and M.C.C.; writing—review and editing, S.V., C.A. and S.A.; visualization, S.V. and A.A.; supervision, S.V. and S.A.; project administration, S.A.; funding acquisition, S.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: PE Polyethylene PP Polypropylene PVC Polyvinyl Chloride PET Polyethylene Terephthalate PS Polystyrene MPs Microplastics SSDR Specific Surface Degradation Rate HDPE High Density Polyethylene EDC Endocrine Disrupting Chemicals PAHs Polycyclic Aromatics Hydrocarbons ROS Reactive Oxygen Species EMT Epithelial–Mesenchymal Transition References 1. Tran K.B. Lang J.J. Compton K. Xu R. Acheson A.R. Henrikson H.J. Kocarnik J.M. Penberthy L. Aali A. Abbas Q. The global burden of cancer attributable to risk factors, 2010–19: A systematic analysis for the Global Burden of Disease Study 2019 Lancet 2022 400 563 591 10.1016/S0140-6736(22)01438-6 35988567 PMC9395583 2. Napper I. Thompson R. Plastics and the Environment Annu. Rev. Environ. Resour. 2023 48 55 79 10.1146/annurev-environ-112522-072642 3. Pilapitiya P.N.T. Ratnayake A.S. The world of plastic waste: A review Clean. Mater. 2024 11 100220 10.1016/j.clema.2024.100220 4. Jambeck J.R. Walker-Franklin I. The impacts of plastics’ life cycle One Earth 2023 6 600 606 10.1016/j.oneear.2023.05.015 5. Plastics Europe AISBL Plastics—The Fast Facts 2024 Available online: https://plasticseurope.org/knowledge-hub/plastics-the-fast-facts-2024/ (accessed on 16 February 2025) 6. eClinicalMedicine Plastic pollution and health eClinicalMedicine 2023 60 102074 10.1016/j.eclinm.2023.102074 37396798 PMC10314155 7. Zeb A. Liu W. Ali N. Shi R. Wang Q. Wang J. Li J. Yin C. Liu J. Yu M. Microplastic pollution in terrestrial ecosystems: Global implications and sustainable solutions J. Hazard. Mater. 2024 461 132636 10.1016/j.jhazmat.2023.132636 37778309 8. Ragusa A. Svelato A. Santacroce C. Catalano P. Notarstefano V. Carnevali O. Papa F. Rongioletti M.C.A. Baiocco F. Draghi S. Plasticenta: First evidence of microplastics in human placenta Environ. Int. 2021 146 106274 10.1016/j.envint.2020.106274 33395930 9. Leslie H.A. van Velzen M.J. Brandsma S.H. Vethaak A.D. Garcia-Vallejo J.J. Lamoree M.H. Discovery and quantification of plastic particle pollution in human blood Environ. Int. 2022 163 107199 10.1016/j.envint.2022.107199 35367073 10. Jenner L.C. Rotchell J.M. Bennett R.T. Cowen M. Tentzeris V. Sadofsky L.R. Detection of microplastics in human lung tissue using μFTIR spectroscopy Sci. Total Environ. 2022 831 154907 10.1016/j.scitotenv.2022.154907 35364151 11. Sree C.G. Buddolla V. Lakshmi B.A. Kim Y.-J. Phthalate toxicity mechanisms: An update Comp. Biochem. Physiol. Part C Toxicol. Pharmacol. 2023 263 109498 10.1016/j.cbpc.2022.109498 36374650 12. Campanale C. Massarelli C. Savino I. Locaputo V. Uricchio V.F. A Detailed Review Study on Potential Effects of Microplastics and Additives of Concern on Human Health Int. J. Environ. Res. Public Health 2020 17 1212 10.3390/ijerph17041212 32069998 PMC7068600 13. Winiarska E. Jutel M. Zemelka-Wiacek M. The potential impact of nano- and microplastics on human health: Understanding human health risks Environ. Res. 2024 251 118535 10.1016/j.envres.2024.118535 38460665 14. Zhang X. Yin Z. Xiang S. Yan H. Tian H. Degradation of Polymer Materials in the Environment and Its Impact on the Health of Experimental Animals: A Review Polymers 2024 16 2807 10.3390/polym16192807 39408516 PMC11478708 15. Chen J.-Q. Rong Z. Zheng D.-Q. Wu Y.-H. Xu X.-W. Degradation of polyethylene by three bacteria isolated from coastal beach Environ. Res. 2025 278 121603 10.1016/j.envres.2025.121603 40250591 16. Yao Z. Seong H.J. Jang Y.-S. Environmental toxicity and decomposition of polyethylene Ecotoxicol. Environ. Saf. 2022 242 113933 10.1016/j.ecoenv.2022.113933 35930840 17. Chamas A. Moon H. Zheng J. Qiu Y. Tabassum T. Jang J.H. Abu-Omar M. Scott S.L. Suh S. Degradation Rates of Plastics in the Environment ACS Sustain. Chem. Eng. 2020 8 3494 3511 10.1021/acssuschemeng.9b06635 18. Fairbrother A. Hsueh H.-C. Kim J.H. Jacobs D. Perry L. Goodwin D. White C. Watson S. Sung L.-P. Temperature and light intensity effects on photodegradation of high-density polyethylene Polym. Degrad. Stab. 2019 165 153 160 10.1016/j.polymdegradstab.2019.05.002 39440157 PMC11494731 19. Koriem A. Ollick A. Elhadary M. The effect of artificial weathering and hardening on mechanical properties of HDPE with and without UV stabilizers Alex. Eng. J. 2021 60 4167 4175 10.1016/j.aej.2021.03.024 20. Tiago G.A. Mariquito A. Martins-Dias S. Marques A.C. The problem of polyethylene waste—Recent attempts for its mitigation Sci. Total Environ. 2023 892 164629 10.1016/j.scitotenv.2023.164629 37285989 21. Barclay A. Acharya K.R. Engineering Plastic Eating Enzymes Using Structural Biology Biomolecules 2023 13 1407 10.3390/biom13091407 37759807 PMC10526444 22. Purohit A. Cochereau B. Sarkar O. Rova U. Christakopoulos P. Antonopoulou I. Villas-Boas S. Matsakas L. Polyethylene biodegradation: A multifaceted approach Biotechnol. Adv. 2025 82 108577 10.1016/j.biotechadv.2025.108577 40185175 23. Silva R.R.A. Marques C.S. Arruda T.R. Teixeira S.C. de Oliveira T.V. Biodegradation of Polymers: Stages, Measurement, Standards and Prospects Macromol 2023 3 371 399 10.3390/macromol3020023 24. Maddela N.R. Kakarla D. Venkateswarlu K. Megharaj M. Additives of plastics: Entry into the environment and potential risks to human and ecological health J. Environ. Manag. 2023 348 119364 10.1016/j.jenvman.2023.119364 37866190 25. Marturano V. Cerruti P. Ambrogi V. Polymer additives Phys. Sci. Rev. 2017 2 20160130 10.1515/psr-2016-0130 26. Xie Z. Ebinghaus R. Temme C. Lohmann R. Caba A. Ruck W. Occurrence and Air-Sea Exchange of Phthalates in the Arctic Environ. Sci. Technol. 2007 41 4555 4560 10.1021/es0630240 17695896 27. Kannan K. Vimalkumar K. A Review of Human Exposure to Microplastics and Insights Into Microplastics as Obesogens Front. Endocrinol. 2021 12 724989 10.3389/fendo.2021.724989 PMC8416353 34484127 28. Parlamento Europeo Regulation (EC) No 1272/2008 of the European Parliament and of the Council of 16 December 2008 on Classification, Labelling and Packaging of Substances and Mixtures, Amending and Repealing Directives 67/548/EEC and 1999/45/EC, and Amending Regulation (EC) No 1907/2006 (Text with EEA Relevance) 2008 Available online: https://eur-lex.europa.eu/eli/reg/2008/1272/oj/eng (accessed on 27 April 2025) 29. Kester M.H.A. Bulduk S. Tibboel D. Meinl W. Glatt H. Falany C.N. Coughtrie M.W.H. Bergman A. Safe S.H. Kuiper G.G.J.M. Potent Inhibition of Estrogen Sulfotransferase by Hydroxylated PCB Metabolites: A Novel Pathway Explaining the Estrogenic Activity of PCBs Endocrinology 2000 141 1897 1900 10.1210/endo.141.5.7530 10803601 30. Torres-García J. Ahuactzin-Pérez M. Fernández F. Cortés-Espinosa D.V. Bisphenol A in the environment and recent advances in biodegradation by fungi Chemosphere 2022 303 134940 10.1016/j.chemosphere.2022.134940 35588877 31. Groh K.J. Backhaus T. Carney-Almroth B. Geueke B. Inostroza P.A. Lennquist A. Leslie H.A. Maffini M. Slunge D. Trasande L. Overview of known plastic packaging-associated chemicals and their hazards Sci. Total Environ. 2019 651 3253 3268 10.1016/j.scitotenv.2018.10.015 30463173 32. Chen Q. Allgeier A. Yin D. Hollert H. Leaching of endocrine disrupting chemicals from marine microplastics and mesoplastics under common life stress conditions Environ. Int. 2019 130 104938 10.1016/j.envint.2019.104938 31234003 33. Zoeller T.R. Environmental chemicals targeting thyroid Hormones 2010 9 28 40 10.14310/horm.2002.1250 20363719 34. Moriyama K. Tagami T. Akamizu T. Usui T. Saijo M. Kanamoto N. Hataya Y. Shimatsu A. Kuzuya H. Nakao K. Thyroid Hormone Action Is Disrupted by Bisphenol A as an Antagonist J. Clin. Endocrinol. Metab. 2002 87 5185 5190 10.1210/jc.2002-020209 12414890 35. Evans N.P. North T. Dye S. Sweeney T. Differential effects of the endocrine-disrupting compounds Bisphenol-A and Octylphenol on gonadotropin secretion, in prepubertal ewe lambs Domest. Anim. Endocrinol. 2004 26 61 73 10.1016/j.domaniend.2003.09.005 14732453 36. Ye H. Ha M. Yang M. Yue P. Xie Z. Liu C. Di2-ethylhexyl phthalate disrupts thyroid hormone homeostasis through activating the Ras/Akt/TRHr pathway and inducing hepatic enzymes Sci. Rep. 2017 7 40153 10.1038/srep40153 28065941 PMC5220292 37. Derakhshan A. Shu H. Broeren M.A. Lindh C.H. Peeters R.P. Kortenkamp A. Demeneix B. Bornehag C.-G. Korevaar T.I. Association of phthalate exposure with thyroid function during pregnancy Environ. Int. 2021 157 106795 10.1016/j.envint.2021.106795 34358912 38. Huang P.-C. Tsai C.-H. Liang W.-Y. Li S.-S. Huang H.-B. Kuo P.-L. Gonzalez-Bulnes A. Early Phthalates Exposure in Pregnant Women Is Associated with Alteration of Thyroid Hormones PLoS ONE 2016 11 e0159398 10.1371/journal.pone.0159398 27455052 PMC4959782 39. Boas M. Frederiksen H. Feldt-Rasmussen U. Skakkebæk N.E. Hegedüs L. Hilsted L. Juul A. Main K.M. Childhood Exposure to Phthalates: Associations with Thyroid Function, Insulin-like Growth Factor I, and Growth Environ. Health Perspect. 2010 118 1458 1464 10.1289/ehp.0901331 20621847 PMC2957929 40. Ullah S. Ahmad S. Guo X. Ullah S. Nabi G. Wanghe K. A review of the endocrine disrupting effects of micro and nano plastic and their associated chemicals in mammals Front. Endocrinol. 2023 13 1084236 10.3389/fendo.2022.1084236 PMC9885170 36726457 41. Ahmed M.B. Rahman S. Alom J. Hasan S. Johir M. Mondal M.I.H. Lee D.-Y. Park J. Zhou J.L. Yoon M.-H. Microplastic particles in the aquatic environment: A systematic review Sci. Total Environ. 2021 775 145793 10.1016/j.scitotenv.2021.145793 33631597 42. Yee M.S.-L. Hii L.-W. Looi C.K. Lim W.-M. Wong S.-F. Kok Y.-Y. Tan B.-K. Wong C.-Y. Leong C.-O. Impact of Microplastics and Nanoplastics on Human Health Nanomaterials 2021 11 496 10.3390/nano11020496 33669327 PMC7920297 43. Nor N.H.M. Koelmans A.A. Transfer of PCBs from Microplastics under Simulated Gut Fluid Conditions Is Biphasic and Reversible Environ. Sci. Technol. 2019 53 1874 1883 10.1021/acs.est.8b05143 30638363 44. Bradney L. Wijesekara H. Palansooriya K.N. Obadamudalige N. Bolan N.S. Ok Y.S. Rinklebe J. Kim K.-H. Kirkham M. Particulate plastics as a vector for toxic trace-element uptake by aquatic and terrestrial organisms and human health risk Environ. Int. 2019 131 104937 10.1016/j.envint.2019.104937 31284110 45. Wu X. Pan J. Li M. Li Y. Bartlam M. Wang Y. Selective enrichment of bacterial pathogens by microplastic biofilm Water Res. 2019 165 114979 10.1016/j.watres.2019.114979 31445309 46. Hou G. Zhao X. Zhao T. Wu X. Pu S. Tang Z. Wu F. The adsorption of PAHs on microplastics and desorption in the simulated human digestive system Chem. Eng. J. 2023 473 145157 10.1016/j.cej.2023.145157 47. Rai P.K. Sonne C. Brown R.J. Younis S.A. Kim K.-H. Adsorption of environmental contaminants on micro- and nano-scale plastic polymers and the influence of weathering processes on their adsorptive attributes J. Hazard. Mater. 2022 427 127903 10.1016/j.jhazmat.2021.127903 34895806 PMC9758927 48. Li S. Keenan J.I. Shaw I.C. Frizelle F.A. Could Microplastics Be a Driver for Early Onset Colorectal Cancer? Cancers 2023 15 3323 10.3390/cancers15133323 37444433 PMC10340669 49. Zambrano-Pinto M.V. Tinizaray-Castillo R. Riera M.A. Maddela N.R. Luque R. Díaz J.M.R. Microplastics as vectors of other contaminants: Analytical determination techniques and remediation methods Sci. Total Environ. 2024 908 168244 10.1016/j.scitotenv.2023.168244 37923271 50. Gouin T. Whelan M.J. Evaluating microplastic particles as vectors of exposure for plastic additive chemicals using a food web model Microplast. Nanoplast. 2024 4 21 10.1186/s43591-024-00099-1 51. Hartmann C. Lomako I. Schachner C. El Said E. Abert J. Satrapa V. Kaiser A.-M. Walch H. Köppel S. Assessment of microplastics in human stool: A pilot study investigating the potential impact of diet-associated scenarios on oral microplastics exposure Sci. Total Environ. 2024 951 175825 10.1016/j.scitotenv.2024.175825 39197786 52. Montano L. Giorgini E. Notarstefano V. Notari T. Ricciardi M. Piscopo M. Motta O. Raman Microspectroscopy evidence of microplastics in human semen Sci. Total Environ. 2023 901 165922 10.1016/j.scitotenv.2023.165922 37532047 53. Hu C.J. A Garcia M. Nihart A. Liu R. Yin L. Adolphi N. Gallego D.F. Kang H. Campen M.J. Yu X. Microplastic presence in dog and human testis and its potential association with sperm count and weights of testis and epididymis Toxicol. Sci. 2024 200 235 240 10.1093/toxsci/kfae060 38745431 PMC11285152 54. Zurub R.E. Bainbridge S. Rahman L. Halappanavar S. El-Chaâr D. Wade M.G. Particulate contamination of human placenta: Plastic and non-plastic Environ. Adv. 2024 17 100555 10.1016/j.envadv.2024.100555 55. Pironti C. Notarstefano V. Ricciardi M. Motta O. Giorgini E. Montano L. First Evidence of Microplastics in Human Urine, a Preliminary Study of Intake in the Human Body Toxics 2022 11 40 10.3390/toxics11010040 36668766 PMC9867291 56. Abbasi S. Turner A. Human exposure to microplastics: A study in Iran J. Hazard. Mater. 2021 403 123799 10.1016/j.jhazmat.2020.123799 33264903 57. Saraluck A. Techarang T. Bunyapipat P. Boonchuwong K. Pullaput Y. Mordmuang A. Detection of Microplastics in Human Breast Milk and Its Association with Changes in Human Milk Bacterial Microbiota J. Clin. Med. 2024 13 4029 10.3390/jcm13144029 39064070 PMC11277308 58. Huang S. Huang X. Bi R. Guo Q. Yu X. Zeng Q. Huang Z. Liu T. Wu H. Chen Y. Detection and Analysis of Microplastics in Human Sputum Environ. Sci. Technol. 2022 56 2476 2486 10.1021/acs.est.1c03859 35073488 59. Liu S. Guo J. Liu X. Yang R. Wang H. Sun Y. Chen B. Dong R. Detection of various microplastics in placentas, meconium, infant feces, breastmilk and infant formula: A pilot prospective study Sci. Total Environ. 2023 854 158699 10.1016/j.scitotenv.2022.158699 36108868 60. Tang K.H.D. A review of the toxic effects of microplastics based on studies on mammals and mammalian cell lines Environ. Sci. Adv. 2024 3 1669 1678 10.1039/D4VA00227J 61. Stock V. Laurisch C. Franke J. Dönmez M.H. Voss L. Böhmert L. Braeuning A. Sieg H. Uptake and cellular effects of PE, PP, PET and PVC microplastic particles Toxicol. Vitr. 2021 70 105021 10.1016/j.tiv.2020.105021 33049312 62. de Almeida A.J.P.O. de Oliveira J.C.P.L. Pontes L.V.d.S. Júnior J.F.d.S. Gonçalves T.A.F. Dantas S.H. Feitosa M.S.d.A. Silva A.O. de Medeiros I.A. Giustarini D. ROS: Basic Concepts, Sources, Cellular Signaling, and its Implications in Aging Pathways Oxidative Med. Cell Longev. 2022 2022 1225578 10.1155/2022/1225578 PMC9605829 36312897 63. Nihart A.J. Garcia M.A. El Hayek E. Liu R. Olewine M. Kingston J.D. Castillo E.F. Gullapalli R.R. Howard T. Bleske B. Bioaccumulation of microplastics in decedent human brains Nat. Med. 2025 31 1114 1119 10.1038/s41591-024-03453-1 39901044 PMC12003191 64. Campen M. Nihart A. Garcia M. Liu R. Olewine M. Castillo E. Bleske B. Scott J. Howard T. Gonzalez-Estrella J. Bioaccumulation of Microplastics in Decedent Human Brains Assessed by Pyrolysis Gas Chromatography-Mass Spectrometry Res. Sq. 2024 31 1114 1119 10.21203/rs.3.rs-4345687/v1 65. Herrala M. Huovinen M. Järvelä E. Hellman J. Tolonen P. Lahtela-Kakkonen M. Rysä J. Micro-sized polyethylene particles affect cell viability and oxidative stress responses in human colorectal adenocarcinoma Caco-2 and HT-29 cells Sci. Total Environ. 2023 867 161512 10.1016/j.scitotenv.2023.161512 36626990 66. Gautam R. Jo J. Acharya M. Maharjan A. Lee D. Kc P.B. Kim C. Kim K. Kim H. Heo Y. Evaluation of potential toxicity of polyethylene microplastics on human derived cell lines Sci. Total Environ. 2022 838 156089 10.1016/j.scitotenv.2022.156089 35605862 67. Gopinath P.M. Twayana K.S. Ravanan P. Thomas J. Mukherjee A. Jenkins D.F. Chandrasekaran N. Prospects on the nano-plastic particles internalization and induction of cellular response in human keratinocytes Part. Fibre Toxicol. 2021 18 35 10.1186/s12989-021-00428-9 34496914 PMC8424902 68. Schirinzi G.F. Pérez-Pomeda I. Sanchís J. Rossini C. Farré M. Barceló D. Cytotoxic effects of commonly used nanomaterials and microplastics on cerebral and epithelial human cells Environ. Res. 2017 159 579 587 10.1016/j.envres.2017.08.043 28898803 69. Zhang W. Li Z. Wang Z. Liu K. Huang S. Liang J. Dai Z. Guo W. Mao C. Chen S. Polyethylene microplastics promote nucleus pulposus cell senescence by inducing oxidative stress via TLR4/NOX2 axis Ecotoxicol. Environ. Saf. 2025 292 117950 10.1016/j.ecoenv.2025.117950 40020381 70. Lomonaco T. Persiani E. Biagini D. Gisone I. Ceccherini E. Cecchettini A. Corti A. Ghimenti S. Di Francesco F. Castelvetro V. Type-specific inflammatory responses of vascular cells activated by interaction with virgin and aged microplastics Ecotoxicol. Environ. Saf. 2024 282 116695 10.1016/j.ecoenv.2024.116695 38981390 71. Bishop B. Webber W.S. Atif S.M. Ley A. Pankratz K.A. Kostelecky R. Colgan S.P. Dinarello C.A. Zhang W. Li S. Micro- and nano-plastics induce inflammation and cell death in human cells Front. Immunol. 2025 16 1528502 10.3389/fimmu.2025.1528502 40230834 PMC11995046 72. Persiani E. Cecchettini A. Amato S. Ceccherini E. Gisone I. Sgalippa A. Ippolito C. Castelvetro V. Lomonaco T. Vozzi F. Virgin and photo-degraded microplastics induce the activation of human vascular smooth muscle cells Sci. Rep. 2025 15 4263 10.1038/s41598-025-89006-z 39905115 PMC11794685 73. Manabe S. Haga Y. Tsujino H. Ikuno Y. Asahara H. Higashisaka K. Tsutsumi Y. Treatment of polyethylene microplastics degraded by ultraviolet light irradiation causes lysosome-deregulated cell death Sci. Rep. 2024 14 24008 10.1038/s41598-024-74800-y 39402130 PMC11473831 74. Xing S. Santerre J.P. Labow R.S. Boynton E.L. The effect of polyethylene particle phagocytosis on the viability of mature human macrophages J. Biomed. Mater. Res. 2002 61 619 627 10.1002/jbm.10078 12115452 75. Yang Q. Peng Y. Wu X. Cao X. Zhang P. Liang Z. Zhang J. Zhang Y. Gao P. Fu Y. Microplastics in human skeletal tissues: Presence, distribution and health implications Environ. Int. 2025 196 109316 10.1016/j.envint.2025.109316 39946929 76. Marfella R. Prattichizzo F. Sardu C. Fulgenzi G. Graciotti L. Spadoni T. D’oNofrio N. Scisciola L. La Grotta R. Frigé C. Microplastics and Nanoplastics in Atheromas and Cardiovascular Events N. Engl. J. Med. 2024 390 900 910 10.1056/NEJMoa2309822 38446676 PMC11009876 77. Lee D.-W. Jung J. Park S.-A. Lee Y. Kim J. Han C. Kim H.-C. Lee J.H. Hong Y.-C. Microplastic particles in human blood and their association with coagulation markers Sci. Rep. 2024 14 30419 10.1038/s41598-024-81931-9 39638849 PMC11621780 78. Amato-Lourenço L.F. Carvalho-Oliveira R. Júnior G.R. Galvão L.d.S. Ando R.A. Mauad T. Presence of airborne microplastics in human lung tissue J. Hazard. Mater. 2021 416 126124 10.1016/j.jhazmat.2021.126124 34492918 79. Thompson R.C. Courtene-Jones W. Boucher J. Pahl S. Raubenheimer K. Koelmans A.A. Twenty years of microplastic pollution research—What have we learned? Science 2024 386 eadl2746 10.1126/science.adl2746 39298564 80. Wang W. Zhang J. Qiu Z. Cui Z. Li N. Li X. Wang Y. Zhang H. Zhao C. Effects of polyethylene microplastics on cell membranes: A combined study of experiments and molecular dynamics simulations J. Hazard. Mater. 2022 429 128323 10.1016/j.jhazmat.2022.128323 35086040 81. Fleury J.-B. Baulin V.A. Microplastics destabilize lipid membranes by mechanical stretching Proc. Natl. Acad. Sci. USA 2021 118 e2104610118 10.1073/pnas.2104610118 34326264 PMC8346836 82. Traversa A. Mari E. Pontecorvi P. Gerini G. Romano E. Megiorni F. Amedei A. Marchese C. Ranieri D. Ceccarelli S. Polyethylene Micro/Nanoplastics Exposure Induces Epithelial–Mesenchymal Transition in Human Bronchial and Alveolar Epithelial Cells Int. J. Mol. Sci. 2024 25 10168 10.3390/ijms251810168 39337653 PMC11432389 83. Pontecorvi P. Ceccarelli S. Cece F. Camero S. Lotti L.V. Niccolai E. Nannini G. Gerini G. Anastasiadou E. Scialis E.S. Assessing the Impact of Polyethylene Nano/Microplastic Exposure on Human Vaginal Keratinocytes Int. J. Mol. Sci. 2023 24 11379 10.3390/ijms241411379 37511139 PMC10380279 84. Poma A.M.G. Morciano P. Aloisi M. Beyond genetics: Can micro and nanoplastics induce epigenetic and gene-expression modifications? Front. Epigenet. Epigenom. 2023 1 1241583 10.3389/freae.2023.1241583 85. Im H. Lee J. Oh J.-E. Song J. Jeong S. Epigenetic and Gene Expression Responses of Daphnia magna Molecules 2025 30 1608 10.3390/molecules30071608 40286217 PMC11990502 86. Farag A.A. Youssef H.S. Sliem R.E. El Gazzar W.B. Nabil N. Mokhtar M.M. Marei Y.M. Ismail N.S. Radwaan S.E. Badr A.M. Hematological consequences of polyethylene microplastics toxicity in male rats: Oxidative stress, genetic, and epigenetic links Toxicology 2023 492 153545 10.1016/j.tox.2023.153545 37169321 87. Pan W. Hao J. Zhang M. Liu H. Tian F. Zhang X. Jiang Z. Chen C. Gao M. Zhang H. Identification and analysis of microplastics in peritumoral and tumor tissues of colorectal cancer Sci. Rep. 2025 15 16130 10.1038/s41598-025-98268-6 40341187 PMC12062370 88. Montano L. Raimondo S. Piscopo M. Ricciardi M. Guglielmino A. Chamayou S. Gentile R. Gentile M. Rapisarda P. Conti G.O. First evidence of microplastics in human ovarian follicular fluid: An emerging threat to female fertility Ecotoxicol. Environ. Saf. 2025 291 117868 10.1016/j.ecoenv.2025.117868 39947063 89. Huang Z. Hu B. Wang H. Analytical methods for microplastics in the environment: A review Environ. Chem. Lett. 2023 21 383 401 10.1007/s10311-022-01525-7 36196263 PMC9521859 90. Xu J.-L. Thomas K.V. Luo Z. Gowen A.A. FTIR and Raman imaging for microplastics analysis: State of the art, challenges and prospects TrAC Trends Anal. Chem. 2019 119 115629 10.1016/j.trac.2019.115629 91. Worms I.A.M. Slaveykova V.I. Asymmetrical Flow Field-Flow Fractionation Coupled to ICP-MS for Characterization of Trace Metal Species in the Environment from Macromolecular to Nano-Assemblage Forms: Current Challenges for Quantification Chimia 2022 76 34 10.2533/chimia.2022.34 38069747 92. Gálvez-Blanca V. Edo C. González-Pleiter M. Albentosa M. Bayo J. Beiras R. Fernández-Piñas F. Gago J. Gómez M. Gonzalez-Cascon R. Occurrence and size distribution study of microplastics in household water from different cities in continental Spain and the Canary Islands Water Res. 2023 238 120044 10.1016/j.watres.2023.120044 37156103 93. Thapliyal C. Negi S. Nagarkoti S. Daverey A. Mechanistic insight into potential toxic effects of microplastics and nanoplastics on human health Discov. Appl. Sci. 2025 7 645 10.1007/s42452-025-07214-8 94. Liu Z. You X.-Y. Recent progress of microplastic toxicity on human exposure base on in vitro and in vivo studies Sci. Total Environ. 2023 903 166766 10.1016/j.scitotenv.2023.166766 37666331 95. WHO Microplastics in Drinking-Water Available online: https://cdn.who.int/media/docs/default-source/wash-documents/microplastics-in-dw-information-sheet190822.pdf (accessed on 1 June 2025) 96. Tang K.H.D. Li R. Li Z. Wang D. Health risk of human exposure to microplastics: A review Environ. Chem. Lett. 2024 22 1155 1183 10.1007/s10311-024-01727-1 97. Roslan N.S. Lee Y.Y. Ibrahim Y.S. Anuar S.T. Yusof K.M.K.K. Lai L.A. Brentnall T. Detection of microplastics in human tissues and organs: A scoping review J. Glob. Health 2024 14 04179 10.7189/jogh.14.04179 39175335 PMC11342020 98. Kwon J. Kim H. Siddiqui M.Z. Kang H.-S. Choi J.-H. Kumagai S. Watanabe A. Teramae N. Kwon E.E. Kim Y.-M. A comprehensive pyrolysis-gas chromatography/mass spectrometry analysis for the assessment of microplastics in various salts Food Chem. 2025 467 142193 10.1016/j.foodchem.2024.142193 39626558 99. Casella C. Cornelli U. Ballaz S. Zanoni G. Merlo G. Ramos-Guerrero L. Plastic Smell: A Review of the Hidden Threat of Airborne Micro and Nanoplastics to Human Health and the Environment Toxics 2025 13 387 10.3390/toxics13050387 40423466 PMC12115425 100. European Chemicals Agency (EC) No 1907/2006 (ECHA) 2023 European Union Available online: https://echa.europa.eu/documents/10162/b56c6c7e-02fb-68a4-da69-0bcbd504212b (accessed on 1 June 2025) 101. FDA The Microbead-Free Waters, Federal Food, Drug and Cosmetic Act (FD&C Act) 2015 Available online: https://www.fda.gov/cosmetics/cosmetics-laws-regulations/microbead-free-waters-act-faqs (accessed on 4 June 2025) 102. Mišľanová C. Valachovičová M. Slezáková Z. An Overview of the Possible Exposure of Infants to Microplastics Life 2024 14 371 10.3390/life14030371 38541696 PMC10971803 103. Ministerio del Medio Ambiente Ley 21368; Regula la Entrega de Plásticos de un solo Uso y las Botellas Plásticas, y Modifica los Cuerpos Legales Que Indica Available online: https://www.bcn.cl/leychile/navegar?idNorma=1163603 (accessed on 4 June 2025) 104. Nawab A. Ahmad M. Khan M.T. Nafees M. Khan I. Ihsanullah I. Human exposure to microplastics: A review on exposure routes and public health impacts J. Hazard. Mater. Adv. 2024 16 100487 10.1016/j.hazadv.2024.100487 105. Sudaryanti L. Joewono H.T. Systematic Literature Review: The Presence of Microplastics in the Body and Their Impact on Human Health J. Ecohumanism 2025 4 1456 1470 10.62754/joe.v4i2.6522 106. Karbalaei S. Hanachi P. Walker T.R. Cole M. Occurrence, sources, human health impacts and mitigation of microplastic pollution Environ. Sci. Pollut. Res. 2018 25 36046 36063 10.1007/s11356-018-3508-7 30382517 107. Lu Y. Zhang Y. Deng Y. Jiang W. Zhao Y. Geng J. Ding L. Ren H.-Q. Uptake and Accumulation of Polystyrene Microplastics in Zebrafish ( Danio rerio Environ. Sci. Technol. 2016 50 4054 4060 10.1021/acs.est.6b00183 26950772 108. Von Moos N. Burkhardt-Holm P. Köhler A. Uptake and Effects of Microplastics on Cells and Tissue of the Blue Mussel Mytilus edulis Environ. Sci. Technol. 2012 46 11327 11335 10.1021/es302332w 22963286 109. Wieland S. Balmes A. Bender J. Kitzinger J. Meyer F. Ramsperger A.F. Roeder F. Tengelmann C. Wimmer B.H. Laforsch C. From properties to toxicity: Comparing microplastics to other airborne microparticles J. Hazard. Mater. 2022 428 128151 10.1016/j.jhazmat.2021.128151 35042167 110. Rahman A. Sarkar A. Yadav O.P. Achari G. Slobodnik J. Potential human health risks due to environmental exposure to nano- and microplastics and knowledge gaps: A scoping review Sci. Total Environ. 2021 757 143872 10.1016/j.scitotenv.2020.143872 33310568 111. Alberghini L. Truant A. Santonicola S. Colavita G. Giaccone V. Microplastics in Fish and Fishery Products and Risks for Human Health: A Review Int. J. Environ. Res. Public Health 2022 20 789 10.3390/ijerph20010789 36613111 PMC9819327 112. Karami A. Golieskardi A. Choo C.K. Larat V. Galloway T.S. Salamatinia B. Bin Ho Y. The presence of microplastics in commercial salts from different countries Sci. Rep. 2017 7 46173 10.1038/srep46173 28383020 PMC5382780 113. Liebezeit G. Liebezeit E. Non-pollen particulates in honey and sugar Food Addit. Contam. Part A 2013 30 2136 2140 10.1080/19440049.2013.843025 24160778 114. Visentin E. Manuelian C. Niero G. Benetti F. Perini A. Zanella M. Pozza M. De Marchi M. Characterization of microplastics in skim-milk powders J. Dairy Sci. 2024 107 5393 5401 10.3168/jds.2023-24373 38608944 115. Kwon J.-H. Kim J.-W. Pham T.D. Tarafdar A. Hong S. Chun S.-H. Lee S.-H. Kang D.-Y. Kim J.-Y. Kim S.-B. Microplastics in Food: A Review on Analytical Methods and Challenges Int. J. Environ. Res. Public Health 2020 17 6710 10.3390/ijerph17186710 32942613 PMC7559051 116. Mir M.A. Khan M.A.A. Banik B.K. Hasnain S.M. Alzayer L. Andrews K. Abba S.I. Microplastics in food products: Prevalence, artificial intelligence based detection, and potential health impacts on humans Emerg. Contam. 2025 11 100477 10.1016/j.emcon.2025.100477 117. Cox K.D. Covernton G.A. Davies H.L. Dower J.F. Juanes F. Dudas S.E. Human Consumption of Microplastics Environ. Sci. Technol. 2019 53 7068 7074 10.1021/acs.est.9b01517 31184127 118. Pham D.T. Kim J. Lee S.-H. Kim J. Kim D. Hong S. Jung J. Kwon J.-H. Analysis of microplastics in various foods and assessment of aggregate human exposure via food consumption in Korea Environ. Pollut. 2023 322 121153 10.1016/j.envpol.2023.121153 36709032 119. Sun T. Teng Y. Ji C. Li F. Shan X. Wu H. Global prevalence of microplastics in tap water systems: Abundance, characteristics, drivers and knowledge gaps Sci. Total Environ. 2024 929 172662 10.1016/j.scitotenv.2024.172662 38649043 120. Refosco A. Dierkes J. Kögel T. Dankel S.N. Laupsa-Borge J. Gomiero A. Daniel D.B. Microplastics in human feces: A pilot study exploring links with dietary habits Microplast. Nanoplast. 2025 5 22 10.1186/s43591-025-00129-6 121. Horvatits T. Tamminga M. Liu B. Sebode M. Carambia A. Fischer L. Püschel K. Huber S. Fischer E.K. Microplastics detected in cirrhotic liver tissue EBioMedicine 2022 82 104147 10.1016/j.ebiom.2022.104147 35835713 PMC9386716 122. Hong Y. Feng Y. Yan T. Zhang L. Zhao Q. Zhao Q. Huang J. Huang S. Zhang Y. Take-out food enhances the risk of MPs ingestion and obesity, altering the gut microbiome in young adults J. Hazard. Mater. 2024 476 135125 10.1016/j.jhazmat.2024.135125 39003809 123. Busch M. Kämpfer A.A. Schins R.P. An inverted in vitro triple culture model of the healthy and inflamed intestine: Adverse effects of polyethylene particles Chemosphere 2021 284 131345 10.1016/j.chemosphere.2021.131345 34216924 124. Huang W. Yin H. Yang Y. Jin L. Lu G. Dang Z. Influence of the co-exposure of microplastics and tetrabromobisphenol A on human gut: Simulation in vitro with human cell Caco-2 and gut microbiota Sci. Total Environ. 2021 778 146264 10.1016/j.scitotenv.2021.146264 33725607 Figure 1 Life cycle of polyethylene and routes of human exposure to microplastics: ( A B C D Figure 2 PE Degradation Pathways and Microplastic Formation. The diagram delineates the primary mechanisms through which PE degrades within the environment: (1) physical degradation via abrasion and mechanical fragmentation; (2) photodegradation and thermooxidation, wherein the formation of free radicals and polymer chain scission lead to the generation of microplastics and byproducts such as ketones, aldehydes, and carboxylic acids; (3) leaching of additives (including phthalates, flame retardants, bisphenols) and adsorption of environmental pollutants onto the aged polymer surface; and (4) microbial biodegradation, which proceeds through five stages: colonization and biofilm formation, biodeterioration, biofragmentation into monomers, assimilation, and mineralization to CO 2 4 ",
  "metadata": {
    "Title of this paper": "Influence of the co-exposure of microplastics and tetrabromobisphenol A on human gut: Simulation in vitro with human cell Caco-2 and gut microbiota",
    "Journal it was published in:": "Toxics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473661/"
  }
}