{
  "title": "Paper_740",
  "abstract": "pmc Viruses Viruses 1559 viruses viruses Viruses 1999-4915 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474030 PMC12474030.1 12474030 12474030 41012605 10.3390/v17091178 viruses-17-01178 1 Review Antiviral Strategies Targeting Enteroviruses: Current Advances and Future Directions https://orcid.org/0009-0002-9602-3671 Lee Michelle Felicia 1 Tham Seng Kong 2 https://orcid.org/0000-0001-8475-6291 Poh Chit Laa 2 3 * Wang Leyi Academic Editor 1 michlee2311@gmail.com 2 drtham@alpsmedical.com 3 * profpoh@alpsmedical.com 28 8 2025 9 2025 17 9 497677 1178 25 7 2025 26 8 2025 27 8 2025 28 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Enteroviruses, a diverse genus within the Picornaviridae enteroviruses antivirals host-targeted antivirals RNA interference CRISPR-Cas systems drug discovery and development This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The Enterovirus Picornaviridae 1 The EV genome is a positive-sense single-stranded RNA with a single open reading frame (ORF), flanked by 5′ and 3′ untranslated regions (UTRs) [ 2 3 Although most EV infections are self-limiting, certain serotypes can cause severe disease, particularly in infants, the elderly, and immunocompromised individuals. Over the past decade, EV-A71 and CV-A16 have caused major HFMD outbreaks across Asia, while EV-D68 has emerged as a respiratory pathogen associated with severe respiratory illness and acute flaccid myelitis, notably during the 2014 outbreak in North America [ 4 5 6 In this review, we provide a comprehensive overview of the current strategies under investigation for the development of anti-EV therapeutics. We discuss direct-acting antivirals (DAAs), particularly capsid binders, protease inhibitors, and polymerase inhibitors, alongside host-targeting antivirals that disrupt virus–host interactions essential for replication. Additionally, we highlight immunotherapeutic approaches such as neutralizing monoclonal antibodies, intravenous immunoglobulin (IVIG), and type I interferons (IFNs). The emergence of novel technologies including RNA interference, CRISPR-based antivirals, and broad-spectrum antivirals will also be explored. Finally, we address challenges such as viral diversity, resistance, limitations of current preclinical models, and offer perspectives on the development of future therapeutic strategies. 2. Biology and Pathogenesis of Enteroviruses 2.1. Structure and Genome Organization of Enteroviruses EVs are small, non-enveloped viruses with a positive-sense single-stranded RNA genome [ 7 8 1 3 The surface topology of the EV capsid is characterized by distinctive morphological features. Star-shaped protrusions are formed by five copies of VP1 around the fivefold axes, while a canyon encircles these axes, formed by the junction of the “north rim” (VP1) and the “south rim” (VP2 and VP3). Additional surface structures include a prominent protrusion or “puff” generated by a loop in VP2 and a “knob” formed by a VP3 loop. The capsid also contains large depressions at the twofold axes. A conserved hydrophobic pocket lies beneath the canyon floor in VP1, typically occupied by a lipid-like molecule known as the “pocket factor”, which stabilizes the virion and plays a role in uncoating during cell entry [ 1 8 9 10 11 12 The EV genome spans approximately 7.4 kilobases and carries UTRs at both the 5′ and 3′ ends. The 5′ UTR contains a highly structured internal ribosome entry site (IRES), enabling cap-independent translation, and is covalently linked to a small viral protein, VPg, which is critical for initiating RNA replication. The 3′ UTR ends in a polyadenylated tail that is essential for genome stability and viral infectivity [ 1 13 14 These NS proteins are essential for viral replication and pathogenesis. They participate in the assembly of membranous replication organelles, facilitate the hijacking of host cell resources, and suppress host immune responses. Some of these proteins, such as 2A and 3C, also modulate cellular signaling pathways and have been implicated in inducing apoptosis [ 15 2.2. Life Cycle of Enteroviruses EVs follow a conserved replication cycle that includes attachment, entry, uncoating, translation, replication, assembly, and release. The infection begins when EVs attach to host cell surface receptors, many of which are members of the immunoglobulin (Ig) superfamily or integrin receptors [ 16 9 17 18 19 In general, receptor binding is also facilitated by cell surface attachment factors such as heparan sulfate or sialic acid, which enhance virus attachment without necessarily mediating entry or uncoating. Once bound, EVs are typically internalized via clathrin-mediated endocytosis, though alternative endocytic pathways such as caveolin-mediated uptake or macropinocytosis may also be employed, depending on the virus and cell type. After endocytosis, acidification of the endosome promotes conformational changes in the capsid that facilitate genome release into the cytoplasm, usually via pore formation or capsid destabilization. There is also evidence suggesting that some EVs may bypass the endosome and release their genome directly at the plasma membrane [ 20 The released positive-sense single-stranded RNA genome is directly translated by host ribosomes to produce a large polyprotein, which is then proteolytically cleaved into structural and NS proteins. The structural proteins, VP1 through VP4, assemble into an icosahedral capsid in which VP1, VP2, and VP3 form the external shell, while VP4 lines the internal surface and associates with the viral RNA [ 21 22 1 23 24 15 pol 25 Replication occurs within virus-induced membranous compartments derived from host organelles, which concentrate viral components and shield RNA from host defenses. Encapsidation of progeny genomes occurs concurrently with capsid assembly, and virion maturation is facilitated by proteolytic cleavage events and environmental factors such as low pH. Virus release typically occurs via cell lysis, though some EVs can exit through non-lytic, vesicle-associated secretion pathways that may aid in immune evasion and viral spread [ 13 26 2.3. Clinical Manifestations Most nonpolio enterovirus infections tend to resolve on their own and are typically asymptomatic, mild, and short-lived. However, in individuals with weakened immune systems—such as infants, young children, or immunocompromised persons—the infection can escalate into serious neurological conditions. EV-A71, CV-A16, and, more recently, CV-A6 are recognized as the primary causes of HFMD, a condition commonly affecting neonates and infants. HFMD is marked by fever, maculopapular or erythematous rashes on the limbs, and painful ulcers in the mouth. Due to their pronounced neurotropism, especially in the case of EV-A71, complications like brainstem encephalitis, acute flaccid paralysis, and aseptic meningitis can arise during seasonal outbreaks. In more severe cases, the viruses may spread to other organs, potentially leading to life-threatening outcomes such as pulmonary edema, septic shock in newborns, or heart dysfunction [ 27 Unlike other enteroviruses, EV-D68 infections present differently. These viruses are sensitive to acidic environments and thrive in cooler temperatures, making them more suited to infecting the nasal passages of the upper respiratory tract rather than the acidic gastrointestinal tract. EV-D68 is primarily linked to moderate to severe respiratory syndromes, including severe bronchitis and interstitial pneumonia. Nevertheless, similar to other human enteroviruses, EV-D68 can replicate in neurological tissues and has been classified as a high-risk pathogen, especially following a series of outbreaks in 2014 [ 28 29 3. Direct-Acting Antivirals (DAAs) Over the past three decades, various antivirals have been developed to target EVs, including capsid binders, protease inhibitors, replication complex-targeting agents, and host-targeted or repurposed drugs. Figure 1 3.1. Capsid Binders EVs possess a conserved icosahedral capsid, which is made up of 60 identical protomers, each consisting of four structural proteins: VP1, VP2, VP3, and VP4. The capsid surface is formed by VP1–VP3, while VP4 resides internally [ 1 17 30 Capsid binders represent a broad class of antiviral agents that act by targeting viral surface proteins, thereby preventing viral entry into host cells. Although these compounds are associated with an increased risk of inducing antiviral resistance, they remain a major focus of antiviral research [ 7 31 32 33 34 35 As an alternative approach, receptor-blocking antibodies—such as those targeting human scavenger receptor Class B member 2 (SCARB2)—offer another promising strategy by preventing the interaction between viral capsid proteins and host cell receptors [ 36 37 13 38 3.1.1. Antivirals Targeting the VP1 Hydrophobic Pocket The VP1 hydrophobic pocket is a key target for anti-enteroviral compounds and plays a role in generating variant strains and new EVs. Sequence analyses of over 1600 VP1 variants have revealed conserved residues in the canyon and hydrophobic pocket regions, underscoring the potential of this site as a broad-spectrum antiviral target [ 39 40 41 50 Figure 2 42 43 50 Figure 2 10 44 50 45 50 46 50 47 48 50 31 49 50 50 51 50 18 52 53 While single-agent capsid inhibitors have shown promising activity against EV-A71 and other EVs, their efficacy can be limited by strain-specific resistance and incomplete coverage across different EV species. To overcome these limitations, combination antiviral strategies targeting multiple stages of the viral life cycle have been investigated ( Figure 3 Figure 3 Similar efforts have been directed toward EV-B species, particularly coxsackieviruses and echoviruses, which are associated with severe diseases such as myocarditis and meningitis. Although compounds such as pleconaril and vapendavir have demonstrated promising in vitro inhibition of EV-B infectivity, with IC 50 50 54 55 50 55 36 25 36 56 10g 50 55 6 7 50 57 6 7 58 EV-D68, a re-emerging pathogen causing acute respiratory illness, which can progress to acute flaccid myelitis, has also been the focus of capsid inhibitor development, although with more limited success. The VP1 hydrophobic pocket of EV-D68 is essential for viral attachment, entry, and uncoating, making it an attractive target for antiviral development. Like other enteroviruses, EV-D68 uses a pocket factor within this conserved site to stabilize the capsid. Capsid-binding antivirals displace this factor, locking the capsid in a rigid state that prevents the conformational changes necessary for host interaction and genome release [ 59 50 60 61 62 50 34 19 19 63 3.1.2. Antivirals Targeting the VP1-VP3 Interprotomer Binding Pocket In addition to the classical VP1 hydrophobic pocket, recent research has uncovered an alternative druggable site at the VP1–VP3 interprotomer interface, offering a new avenue for capsid-targeting antivirals, particularly in the EV-B group. Ma et al. (2017) discovered a novel, conserved site on the VP1 protein of CV-B, located near the canyon, but distinct from the hydrophobic pocket targeted by classical capsid inhibitors like pleconaril. This site was identified through a screen of substituted benzoic acids that were highly selective for CV-B viruses and inactive against other EVs, such as echovirus. Among the tested compounds, 4-dimethylamino benzoic acid (4EDMAB) selectively inhibited CV-B3 replication (EC 50 1 50 2 50 7 64 17 50 9 50 65 17 3.1.3. Antivirals Targeting the Five-Fold Axis of the Capsid In addition to the VP1 hydrophobic pocket and the VP1–VP3 interprotomer site, the five-fold axis of the viral capsid has emerged as another promising target for small-molecule antivirals, particularly in the context of EV-A71. Several compounds have been developed to exploit this conserved and accessible region on the viral surface. MADL385, a dendrimer composed of 12 tryptophan residues, showed antiviral activity against the EV-A71 BrCr strain in vitro with an EC 50 66 50 67 50 32 37 68 69 70 10 12 Table 1 3.2. Non-Structural Protein Inhibitors NS proteins of EVs play essential roles in viral replication and are attractive targets for antiviral drug development. While extensive research has focused on well-characterized targets such as 2C, 3C protease, and 3D RNA-dependent RNA polymerase (3D pol pro 7 3.2.1. 2A Protease Inhibitors The enterovirus 2A protease (2A pro pro 13 pro 71 72 pro Early studies have identified weak inhibitors such as Z-LVLQTM-FMK and CW33, which reduce EV-A71 replication only at high concentrations, limiting their therapeutic potential [ 73 74 75 76 Schizonepeta tenuifolia Melissa officinalis pro 77 78 pro 79 80 Notably, the catalytic triad (His-Asp-Cys) and residues like Ser/Thr125 are highly conserved among enteroviruses, making 2A pro 81 pro 82 pro 3.2.2. 2B Protein Inhibitors When expressed in Xenopus 83 84 12 85 3.2.3. 2C Protein Inhibitors The 2C protein of EVs is a multifunctional NS protein involved in critical stages of the viral life cycle, including uncoating, RNA replication, membrane remodeling, and encapsidation [ 86 12 87 88 Several structurally diverse small molecules have been developed to target the 2C protein. Fluoxetine, originally developed as an antidepressant, was explored as a potential antiviral and progressed to clinical trials for EV-D68-associated acute flaccid myelitis, but failed to demonstrate clinical efficacy [ 89 90 91 12b 50 12b 12b 92 Dibucaine, a local anesthetic, was identified as a CV-B3 inhibitor through drug repurposing efforts, and it also showed activity against EV-A71 and EV-D68 [ 93 12a 94 6aw 95 6i 96 Another compound, R523062, was identified from a high-throughput screen as an EV-D68 inhibitor and also demonstrated modest activity against EV-A71. Resistance studies pinpointed mutations in the 2C protein, particularly I227L, as a potential driver of resistance. Although attempts to generate a recombinant virus carrying only the I227L mutation failed, likely due to loss of viral fitness, binding assays confirmed that this single mutation was sufficient to confer resistance. Despite its moderate potency, R523062’s simple structure makes it an attractive candidate for further optimization [ 97 A series of pyrazolopyridine derivatives were also found to inhibit CV-B3 and displayed broad-spectrum antiviral activity against EV-A71, other coxsackieviruses, echoviruses, and poliovirus [ 98 50 99 7d 100 12 30 101 The broad-spectrum antiviral activity of 2C inhibitors highlighted their therapeutic potential. Nevertheless, further studies are required to fully elucidate their mechanisms of action. It is particularly intriguing that structurally unrelated compounds all appear to target the same protein, suggesting the presence of a versatile binding interface or multiple functional hotspots within 2C. To date, only the 2C structures from EV-A71, CV-B3, and poliovirus have been elucidated [ 87 102 103 103 In addition to direct 2C inhibition, targeting host factors that interact with 2C represents another promising strategy. Proteins such as TRIM4, exportin2, and ARFGAP1 are host cofactors that facilitate viral replication by interacting with 2C; disruption of these interactions could impair viral replication and may yield therapeutics with a higher barrier to resistance [ 104 105 3.2.4. 3A Protein Inhibitors The replication of EVs occurs within specialized membranous compartments known as replication organelles, which are formed through the subversion of host lipid regulatory pathways. Central to this process is the viral 3A protein, which orchestrates the recruitment and organization of host factors, particularly phosphatidylinositol 4-kinase IIIβ (PI4KB), acyl-CoA-binding domain-containing protein 3 (ACBD3), and oxysterol-binding protein (OSBP) [ 106 107 108 105 Several small-molecule inhibitors have been identified that disrupt 3A-related functions. Enviroxime, a broad-spectrum inhibitor targeting the 3A pathway, was discontinued in clinical development due to limited efficacy and gastrointestinal side effects [ 109 110 111 112 113 113 114 115 12 116 117 Despite the identification of numerous structurally diverse 3A-targeting agents, definitive evidence of direct interaction with the 3A protein was lacking. These inhibitors might exert their effects by disrupting 3A-mediated host protein recruitment rather than by binding to 3A itself. Furthermore, none of the known 3A-targeting compounds have advanced to in vivo evaluation, underscoring the need for further mechanistic studies and the development of biochemical assays to validate 3A as a direct antiviral target. Nonetheless, the multifunctional role of 3A in EV replication continued to make it an attractive candidate for therapeutic intervention. Taken together, these findings highlighted the 3A protein as a multifunctional regulator of viral replication and a compelling, yet underexplored, target for the development of broad-spectrum EV antivirals. 3.2.5. 3C Protease Inhibitors The 3C protease (3C pro 118 pro 119 pro 120 121 The 3C or 3C-like protease exhibited a strong substrate preference for glutamine at the P1 position, which has provided information for the design of peptide-based inhibitors. These inhibitors typically consisted of di-, tri-, or tetra-peptides containing a pyrrolidone moiety at P1, and were conjugated to reactive warheads such as aldehydes, ketoamides, or α,β-unsaturated esters. Novel warheads like 4-iminooxazolidin-2-one and dually activated Michael acceptors have been developed to enhance metabolic stability and selectivity. Compounds such as 4e 4g 30 122 123 Non-covalent inhibitors have also been reported. DC07090, identified through virtual screening, exhibited moderate enzymatic inhibition and displayed antiviral activity, but introduced a new chemotype for future optimization [ 124 Figure 4 125 126 126 127 128 118 129 130 pro 118 131 118 12 50 132 Fragment-based screening has identified additional irreversible inhibitors, such as compound 7a pro 133 129 pro 134 130 135 pro 50 136 Efforts to develop broad-spectrum antivirals led to the discovery of α-ketoamide-based inhibitors such as compounds 11r and 18p. The latter displayed potent antiviral activity against EV-A71 and other EVs such as EV-D68, CV-A21, CV-B3, RV-B14, and RV-A02-WT, as well as SARS-CoV-2, despite modest enzymatic inhibition. X-ray structures confirmed the formation of a covalent bond with the catalytic cysteine. Compound 18p 137 13 137 16 138 Macrocyclic inhibitors such as compound 4 pro 139 50 140 122 141 142 18 133 50 143 Additionally, host proteins like ATG4B have been implicated in viral polyprotein processing. Identified using a rupintrivir-derived probe, ATG4B exhibited protease activity similar to 3C pro 144 pro 130 145 146 pro 3.2.6. Three-Dimensional Polymerase Inhibitors The RNA-dependent RNA polymerase (RdRp), also known as 3D pol pol 13 pol pol High-throughput screening of FDA-approved drugs identified gemcitabine, LY2334737, and sofosbuvir as effective nucleoside analogs with anti-EV-A71 activity. Notably, LY2334737 and sofosbuvir not only reduced viral titers in vitro, but also protected mice from lethal EV-A71 challenge, attenuating viral replication, and tissue damage. Gemcitabine exhibited synergistic effects when used in combination with IFN-β, suggesting its potential use in combination therapies [ 147 Gemcitabine also demonstrated synergistic antiviral activity when combined with ribavirin, reducing CV-B3 replication by up to 80%. This combination yielded a combination index (CI) of less than 1, confirming synergism [ 148 149 pol 150 Another broad-spectrum antiviral, favipiravir, inhibited EV-A71 replication by targeting the 3D pol Figure 5 pol 151 50 152 153 154 50 155 50 156 Several non-nucleoside inhibitors of 3D pol pol pol 157 pol 158 pol 50 pol 159 159 50 160 Despite the clear promise of polymerase inhibitors, challenges remained in their development. Nucleoside analogs often carry the risk of host polymerase inhibition, leading to toxicity, and might possess immunomodulatory properties. While non-nucleoside compounds offered alternative mechanisms and potentially improved selectivity, few have progressed to in vivo evaluation or clinical testing. Nevertheless, the high conservation of 3D pol Table 2 4. Host-Targeting Antivirals EVs are obligate intracellular pathogens that depend on host cellular machinery and signaling pathways for successful replication. Targeting these host factors could offer an alternative antiviral strategy, with potential advantages including broad-spectrum activity and a high barrier to resistance. However, concerns about cytotoxicity remained a key limitation of host-targeted therapies. Various high-throughput approaches, such as siRNA screening, proteomics, and insertional mutagenesis, have been used to identify essential host factors involved in EV-A71 replication [ 12 163 164 165 50 166 167 168 ITZ also targets OSBP and its homolog ORP4. While some reports indicated ITZ might act on the viral 3A protein, functional studies showed that OSBP knockdown impaired viral replication, and overexpression of OSBP or ORP4 reversed the antiviral effects of ITZ and OSW-1. ITZ was proposed to inhibit the lipid-shuttling activity of OSBP, which is necessary for replication organelle formation [ 169 30 170 171 30 10 172 173 RYL-634 is a broad-spectrum antiviral compound identified through phenotypic screening and SAR studies. It was able to inhibit multiple viruses, including EV-A71, with an EC 50 174 175 176 177 13 178 179 180 181 182 182 183 184 Heparan sulfate proteoglycans (HSPGs) function as attachment factors for EV-A71. A library of sulfated heparan sulfate disaccharides was developed as decoy receptors to inhibit virus attachment. Among them, HTA-22, a per-sulfated GlcN-α(1,4)-Glc synthetic HS mimetic, showed the strongest inhibitory activity, with an IC 50 185 186 187 188 4O 22 189 Torin2, an ATP-competitive mTOR kinase inhibitor, showed potent anti-EV-A71 activity with an IC 50 50 190 191 192 Cyclophilin A (CypA), a peptidyl-prolyl isomerase, plays a role in the replication of multiple viruses, including EV-A71 [ 12 193 50 50 194 193 194 161 Table 3 Figure 6 5. Emerging and Experimental Strategies 5.1. Immunotherapeutic Approaches Human intravenous immunoglobulin (hIVIG), consisting of pooled IgG antibodies from healthy donors, has demonstrated broad neutralizing activity against several EVs, including EV-D68. Studies showed that commercial IVIG preparations contained high titers of neutralizing antibodies, suggesting both shared and unique antigenic determinants when compared to historical EV strains. In animal models, IVIG treatment significantly reduced paralysis incidence and motor deficits, and clinical use in neonates with severe EV infections has led to rapid viral clearance via pathogen-specific antibody responses [ 59 195 Monoclonal antibodies (mAbs) could offer a targeted strategy against EVs by binding and neutralizing free viral particles. For EV-D68, multiple mAbs showed protective effects in mice when administered either before or after infection. For instance, antibody EV-D68-228 was able to bind the viral capsid’s five-fold axis, while mAb A61 targeted the VP1 DE loop and prevented interaction with α2,6-linked sialic acid receptors [ 196 197 198 The innate immune system, particularly type I IFNs, plays a critical role in early antiviral defense. Virus recognition by pattern recognition receptors (PRRs) such as TLR3, TLR7, TLR8, and RIG-I triggers a cascade leading to IFN-β production through IRF3 activation. This initiates a positive feedback loop involving IRF7, resulting in the amplification of IFN-α/β and the expression of ISGs [ 199 180 pro 200 180 pro 201 Taken together, immunotherapeutic strategies represented a vital and evolving front in the fight against EV infections. Passive immunization using hIVIG and monoclonal antibodies has demonstrated protective efficacy, particularly in severe cases and in vulnerable populations, while offering insights into viral antigenicity and neutralization mechanisms. Concurrently, bolstering the innate immune response through type I IFN signaling provided a promising avenue to counteract EV-mediated immune evasion. However, the heterogeneity among EV species and their diverse strategies to subvert host immunity underscore the need for targeted, virus-specific interventions. Continued investigation into host–pathogen interactions, coupled with advances in antibody engineering and immune modulation, would be crucial for translating these immunotherapeutic approaches into effective clinical treatments for EV-associated diseases. 5.2. RNA Interference (RNAi) RNAi is a gene-silencing process that occurs after transcription and was first observed in pigmented petunias in 1990 [ 202 Caenorhabditis elegans 203 204 RNAi is increasingly recognized as a conserved antiviral mechanism in eukaryotes, though its role in mammals has been a subject of debate. This skepticism largely stems from the dominant presence of IFN-mediated responses and adaptive immunity in mammals, which are absent in invertebrates and plants. Some studies suggested a competitive or inhibitory interaction between the RNAi and IFN pathways, with IFN-associated proteins such as LGP2 shown to suppress Dicer, a key enzyme in RNAi [ 205 206 207 208 204 , 209 210 CV-B3 has been the most extensively studied EV in the context of RNAi-based antiviral strategies. Early investigations demonstrated that siRNAs targeting conserved regions of the viral 3D polymerase (3D pol 211 212 213 pol 214 215 216 217 218 pol 219 220 221 222 pol 223 For CV-B4, Tan et al. (2010) tested siRNAs targeting conserved non-structural genes (2A, 3C, 3D). siRNA 3C showed the strongest effect, reducing replication significantly, followed by siRNA 3D. No cytotoxicity or IFN activation was observed, and antiviral effects lasted up to 48 h. Combining siRNAs yielded no additive benefit, but the study confirmed the therapeutic potential of siRNA 3C [ 224 pol 50 pol 225 226 For EV-A71, Tan et al. (2007) demonstrated that 19-mer siRNAs and plasmid-expressed shRNAs targeting 3D pol 227 pol pro pol 228 229 pro 230 231 232 For EV-70, two siRNAs targeting 3D pol 233 pol 234 235 Collectively, these studies underscore the versatility and promise of RNAi-based strategies against a wide spectrum of EVs. The success of these approaches hinged on selecting conserved, functionally essential target sites, optimizing delivery systems (e.g., AAV, lentivirus), and in some cases, combining viral and host-targeted strategies to improve durability and suppress viral escape. Despite progress, challenges remained in mammalian antiviral RNAi research. These include inconsistent detection of vsiRNAs, limited cleavage efficiency of full-length Dicer, and the lack of a clear phenotype in Dicer-deficient cells, in terms of increased viral replication. Addressing these limitations is essential for advancing RNAi-based antiviral strategies against EVs and other RNA viruses. 5.3. CRISPR-Based Antivirals The CRISPR-Cas system, originally discovered as a bacterial adaptive immune mechanism, uses RNA-guided nucleases to recognize and cleave specific DNA or RNA sequences. The precision and efficiency of CRISPR-Cas have made it a leading tool for genome editing in mammalian cells [ 236 237 238 239 237 240 Building on these fundamental capabilities, CRISPR-Cas technology has recently been explored as a promising antiviral strategy against EVs. Given the high mutation rates and genetic plasticity of EVs, conventional antivirals often struggle with the rapid emergence of resistance. CRISPR systems, particularly Cas13, provide a unique advantage by directly targeting and degrading viral RNA with high specificity. The RNA-guided RNase activity of Cas13 enables it to cleave single-stranded viral genomes in a sequence-specific manner, without requiring a protospacer adjacent motif (PAM), making it especially suitable for targeting RNA viruses like EV-A71, CV-A16, and CV-B3 [ 237 Figure 7 241 Recent studies have demonstrated the utility of CRISPR-based screening platforms to identify host dependency factors required for EV infection and replication. These genome-wide knockout or CRISPRi screens have uncovered several host proteins that facilitate viral entry and propagation. For instance, Diep et al. (2019) identified SET domain-containing 3 (SETD3), an actin histidine methyltransferase, as a key host factor for rhinovirus, EV-D68, and EV-A71. SETD3 was shown to interact with the viral 2A protease independent of its enzymatic activity—a previously unrecognized proviral role essential for EV replication [ 242 243 244 Beyond initial screens, CRISPR-Cas has proven instrumental in clarifying conflicting findings from earlier RNAi studies. The host protein, Acyl-Coenzyme A Binding Domain Containing 3 (ACBD3), previously proposed to interact with the EV 3A protein and mediate PI4KB recruitment to viral replication organelles, yielded inconsistent results when knocked down by siRNA. Some studies reported inhibition of poliovirus replication, while others observed no impact on viral replication or PI4KB localization [ 245 246 247 248 108 In addition to host gene perturbation, direct targeting of the viral genome using multiplexed guide RNAs has been proposed to enhance therapeutic durability. By simultaneously attacking multiple conserved regions of the viral genome, CRISPR-Cas strategies might prevent the emergence of escape mutants—a critical concern in RNA virus therapeutics [ 249 250 251 252 253 A recent study demonstrated the potent antiviral potential of CRISPR-Cas13d delivered via AAV against EV-A71, a major cause of HFMD for which no specific antiviral treatment currently exists. Using a custom bioinformatics pipeline called Cas13gRNAtor, researchers designed guide RNAs (gRNAs) that targeted conserved regions across the EV-A71 genome. These gRNAs were packaged with Cas13d into AAV vectors for both prophylactic and therapeutic applications. In in vitro assays, AAV-CRISPR-Cas13d constructs reduced EV-A71 viral titers by more than 99.99%. When administered to lethally infected mice, the treatment significantly inhibited viral replication, prevented clinical symptoms, and dramatically improved survival rates. Notably, the CRISPR-Cas13d system effectively cleared the virus from critical tissues such as the spinal cord and skeletal muscle, areas where siRNA-based approaches previously failed to access. The gRNA pool strategy—targeting multiple conserved sites within the viral 3D polymerase gene—was shown to enhance antiviral efficacy and maintain broad activity across various EV-A71 strains. Importantly, whole transcriptome analysis confirmed that this approach was highly specific, with no detectable off-target effects. Compared to RNAi, the AAV-CRISPR-Cas13d platform offered superior tissue penetration, durability, and viral clearance. This study highlighted the feasibility of using AAV-delivered CRISPR-Cas13 as a DAA modality for RNA viruses like EV-A71, with strong potential for further development into clinically applicable treatments for EV infections [ 254 Altogether, CRISPR-Cas technology offers a transformative framework for antiviral intervention against EVs. Its dual capacity to manipulate host factors and directly cleave viral RNA positions it as a next-generation antiviral platform, capable of overcoming limitations associated with traditional RNAi or small-molecule drugs. Continued refinement of delivery systems, guided RNA design, and an understanding of viral escape mechanisms will be essential to translate this potential into clinical application. 5.4. Peptide-Based Antivirals Peptides are increasingly recognized as viable therapeutic agents, with a growing number under investigation as antimicrobial and antiviral compounds in clinical trials [ 255 256 257 Compared to small molecules, peptides offer advantages such as high specificity, reduced off-target effects, better tolerability, and minimal toxic byproducts, as their degradation products are amino acids. Moreover, peptides are generally less susceptible to resistance since they can target multiple functional regions of the virus across different stages of the life cycle. Combining AVPs that act on different mechanisms may further reduce the likelihood of viral escape [ 258 259 260 A major challenge in peptide-based antiviral development is the high cost of production and formulation. Issues such as low oral bioavailability, rapid enzymatic degradation, short plasma half-life, and poor systemic delivery limit the therapeutic utility of natural peptides. For instance, enfuvirtide requires twice-daily injections, costing around USD 90/day, which impacts patient adherence. Strategies such as truncating peptides to identify minimal active motifs, recombinant peptide expression, and the use of gold nanoparticles or delivery technologies (e.g., PharmaFilm™) have been explored to overcome these barriers [ 258 Peptides also hold promise in combating drug resistance. Small-molecule antivirals often induce resistant mutants, as seen with influenza and RSV. For example, RSV developed escape mutations (P488I/V, D486N, D498Y, L141W) against GS-5806, RV-521, and JNJ-53718678 [ 261 262 263 264 pol 265 266 To bypass such resistance, targeting viral entry via host receptors with short peptides offers a compelling approach. SP40, derived from EV-A71 VP1, was shown to block viral attachment by interacting with the nucleolin receptor [ 267 268 269 270 50 271 6. Challenges in Antiviral Development for the Treatment of EV Infections Despite increasing recognition of EVs as significant human pathogens, particularly EV-D68, which has been associated with outbreaks of acute flaccid myelitis (AFM), there are still no approved antiviral therapies. While several compounds such as Rupintrivir, Enviroxime, and Pleconaril have shown efficacy against EV-D68 in vitro, they have not progressed to clinical application [ 272 59 A key limitation in the past was the absence of reliable animal models for studying EV-D68 pathogenesis and therapeutic responses. This has been addressed in part through the development of a cotton rat model using non-adapted virus, and more notably, neonatal mouse models that displayed EV-D68-induced paralysis—an important advance for evaluating candidate treatments for AFM [ 195 273 272 274 These challenges are not limited to EV-D68. Other clinically relevant EVs, such as EV-A71 and CV-B3, also face comparable hurdles in the development of effective therapeutics. One major obstacle is the inconsistent manifestation of disease in animal models. For example, EV-A71 infection in neonatal mice often fails to replicate hallmark features of severe human disease, such as brainstem encephalitis, neurogenic pulmonary edema, or limb paralysis [ 275 276 In parallel, structure-based drug design (SBDD) approaches are gaining traction. One study focused on a compound that was structurally similar to fluoxetine, but lacked serotonin reuptake inhibitor activity, which showed broad-spectrum inhibition of EV-D68, EV-A71, and CV-A24v by targeting the conserved 2C protein. Another study employed virtual screening to identify quinoline analogs, with compound 19 63 92 277 In conclusion, while important advances have been made in modeling EV infections and identifying candidate antivirals, numerous challenges persist. These include the infrequent occurrence of severe disease outcomes across various EV serotypes, the need for validated and standardized animal models that could reflect diverse disease manifestations, and the difficulty of translating promising in vitro results into clinical success. Continued efforts in refining experimental systems, applying computational drug design, and leveraging innovative molecular technologies would be essential to accelerate the discovery and development of effective antiviral therapies against EVs. 7. Conclusions EVs represent a significant public health burden due to their wide range of clinical manifestations, from mild febrile illness to severe neurological and cardiac complications. Despite substantial research efforts, there are still no approved antiviral therapies targeting EV infections. This therapeutic gap is largely driven by challenges such as high viral mutation rates, limited broad-spectrum efficacy, and poor translation from in vitro studies to effective in vivo outcomes. Numerous small-molecule antivirals have been explored, targeting viral capsid proteins, proteases, and replication complexes. While several compounds have shown potent in vitro activity, many failed to progress due to resistance, toxicity, or narrow strain specificity. Recent advances in structure-based drug design and high-throughput screening have yielded promising leads, but these require further optimization and clinical validation. Targeting host factors presents an alternative strategy with the potential to overcome viral resistance and broaden therapeutic coverage. However, this approach carries the risk of off-target effects and toxicity due to the essential role of host proteins in normal cellular functions. A detailed understanding of virus–host interactions remained critical for identifying viable targets with minimal adverse consequences. Immunotherapeutic interventions, including monoclonal antibodies, IVIG, and modulation of innate immune pathways, have also shown encouraging preclinical efficacy. These approaches highlighted the value of leveraging host immunity as a means to control EV infections. At the same time, emerging technologies such as RNAi and CRISPR-Cas systems offered new modalities that directly target viral RNA with high specificity, demonstrating robust antiviral activity both in vitro and in vivo. Nonetheless, several overarching challenges continued to impede progress. Animal models often exhibit inconsistent disease phenotypes and limited relevance to human pathology, complicating the evaluation of candidate antivirals. The lack of standardized experimental methodologies further hampered cross-study comparisons and reproducibility. Moreover, the sporadic and geographically dispersed nature of severe EV outbreaks posed logistical difficulties for conducting designed clinical trials. Moving forward, a combination of strategies would be essential. Rational drug design, host-targeted approaches, and gene-editing technologies should be integrated with improved disease models and harmonized evaluation criteria. Combination therapies, designed to enhance efficacy and limit resistance, also hold promise for future development. Ultimately, bridging the gap between bench and bedside would require interdisciplinary collaboration, sustained investment in antiviral research, and the continued refinement of translational tools. As some EVs remain better studied than others, extending these advances to lesser-known serotypes would be key to achieving comprehensive and durable antiviral solutions across the EV spectrum. Disclaimer/Publisher’s Note: Author Contributions M.F.L.: Conceptualization, writing—original draft preparation, visualization; S.K.T.: Writing—review and editing. C.L.P.: Conceptualization, writing—review and editing. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest Author Seng Kong Tham and Chit Laa Poh were employed by the company ALPS Global Holding Berhad. The remaining author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. References 1. Baggen J. Thibaut H.J. Strating J.R.P.M. van Kuppeveld F.J.M. The life cycle of non-polio enteroviruses and how to target it Nat. Rev. Microbiol. 2018 16 368 381 10.1038/s41579-018-0005-4 29626210 2. Anasir M.I. Poh C.L. Advances in Antigenic Peptide-Based Vaccine and Neutralizing Antibodies against Viruses Causing Hand, Foot, and Mouth Disease Int. J. Mol. Sci. 2019 20 1256 10.3390/ijms20061256 30871133 PMC6471744 3. Yuan J. Shen L. Wu J. Zou X. Gu J. Chen J. Mao L. Enterovirus A71 Proteins: Structure and Function Front. Microbiol. 2018 9 286 10.3389/fmicb.2018.00286 29515559 PMC5826392 4. Yang B. Liu F. Liao Q. Wu P. Chang Z. Huang J. Long L. Luo L. Li Y. Leung G.M. Epidemiology of hand, foot and mouth disease in China, 2008 to 2015 prior to the introduction of EV-A71 vaccine Euro Surveill. 2017 22 16-00824 10.2807/1560-7917.ES.2017.22.50.16-00824 29258646 PMC5743100 5. Puenpa J. Wanlapakorn N. Vongpunsawad S. Poovorawan Y. The History of Enterovirus A71 Outbreaks and Molecular Epidemiology in the Asia-Pacific Region J. Biomed. Sci. 2019 26 75 10.1186/s12929-019-0573-2 31627753 PMC6798416 6. Messacar K. Abzug M.J. Dominguez S.R. 2014 outbreak of enterovirus D68 in North America J. Med. Virol. 2016 88 739 745 10.1002/jmv.24410 26489019 7. Suresh A.J. Dass R.S. Chapter 15—Current therapeutic strategies and novel antiviral compounds for the treatment of nonpolio enteroviruses Viral Infections and Antiviral Therapies Dhara A.K. Nayak A.K. Academic Press Cambridge, MA, USA 2023 8. Lyu K. Wang G.C. He Y.L. Han J.F. Ye Q. Qin C.F. Chen R. Crystal structures of enterovirus 71 (EV71) recombinant virus particles provide insights into vaccine design J. Biol. Chem. 2015 290 3198 3208 10.1074/jbc.M114.624536 25492868 PMC4318995 9. Abdelnabi R. Geraets J.A. Ma Y. Mirabelli C. Flatt J.W. Domanska A. Delang L. Jochmans D. Kumar T.A. Jayaprakash V. A novel druggable interprotomer pocket in the capsid of rhino- and enteroviruses PLoS Biol. 2019 17 e3000281 10.1371/journal.pbio.3000281 31185007 PMC6559632 10. Egorova A. Ekins S. Schmidtke M. Makarov V. Back to the future: Advances in development of broad-spectrum capsid-binding inhibitors of enteroviruses Eur. J. Med. Chem. 2019 178 606 622 10.1016/j.ejmech.2019.06.008 31226653 PMC8194503 11. Dang M. Wang X. Wang Q. Wang Y. Lin J. Sun Y. Li X. Zhang L. Lou Z. Wang J. Molecular mechanism of SCARB2-mediated attachment and uncoating of EV71 Protein Cell 2014 5 692 703 10.1007/s13238-014-0087-3 24986489 PMC4145081 12. Wang J. Hu Y. Zheng M. Enterovirus A71 antivirals: Past, present, and future Acta Pharm. Sin. B 2022 12 1542 1566 10.1016/j.apsb.2021.08.017 35847514 PMC9279511 13. Wang S. Pang Z. Fan H. Tong Y. Advances in anti-EV-A71 drug development research J. Adv. Res. 2024 56 137 156 10.1016/j.jare.2023.03.007 37001813 PMC10834817 14. Palmenberg A.C. Proteolytic processing of picornaviral polyprotein Annu. Rev. Microbiol. 1990 44 603 623 10.1146/annurev.mi.44.100190.003131 2252396 15. Laitinen O.H. Svedin E. Kapell S. Nurminen A. Hytönen V.P. Flodström-Tullberg M. Enteroviral proteases: Structure, host interactions and pathogenicity Rev. Med. Virol. 2016 26 251 267 10.1002/rmv.1883 27145174 PMC7169145 16. Bergelson J.M. Coyne C.B. Picornavirus entry Adv. Exp. Med. Biol. 2013 790 24 41 23884584 10.1007/978-1-4614-7651-1_2 17. Anasir M.I. Zarif F. Poh C.L. Antivirals blocking entry of enteroviruses and therapeutic potential J. Biomed. Sci. 2021 28 10 10.1186/s12929-021-00708-8 33451326 PMC7811253 18. Chen J. Ye X. Zhang X.Y. Zhu Z. Zhang X. Xu Z. Ding Z. Zou G. Liu Q. Kong L. Coxsackievirus A10 atomic structure facilitating the discovery of a broad-spectrum inhibitor against human enteroviruses Cell Discov. 2019 5 4 10.1038/s41421-018-0073-7 30652025 PMC6331555 19. Zhou D. Zhao Y. Kotecha A. Fry E.E. Kelly J.T. Wang X. Rao Z. Rowlands D.J. Ren J. Stuart D.I. Unexpected mode of engagement between enterovirus 71 and its receptor SCARB2 Nat. Microbiol. 2019 4 414 419 10.1038/s41564-018-0319-z 30531980 20. Shingler K.L. Yoder J.L. Carnegie M.S. Ashley R.E. Makhov A.M. Conway J.F. Hafenstein S. The enterovirus 71 A-particle forms a gateway to allow genome release: A cryoEM study of picornavirus uncoating PLoS Pathog. 2013 9 e1003240 10.1371/annotation/e92d19e0-996a-4bfa-afdd-20dce770ed75 23555253 PMC3605244 21. Jiang P. Liu Y. Ma H.C. Paul A.V. Wimmer E. Picornavirus morphogenesis Microbiol. Mol. Biol. Rev. 2014 78 418 437 10.1128/MMBR.00012-14 25184560 PMC4187686 22. Tan Y.W. Hong W.J. Chu J.J. Inhibition of enterovirus VP4 myristoylation is a potential antiviral strategy for hand, foot and mouth disease Antivir. Res. 2016 133 191 195 10.1016/j.antiviral.2016.08.009 27520386 23. Ao D. Sun S.Q. Guo H.C. Topology and biological function of enterovirus non-structural protein 2B as a member of the viroporin family Vet. Res. 2014 45 87 10.1186/s13567-014-0087-6 25163654 PMC4155101 24. Yeager C. Carter G. Gohara D.W. Yennawar N.H. Enemark E.J. Arnold J.J. Cameron C.E. Enteroviral 2C protein is an RNA-stimulated ATPase and uses a two-step mechanism for binding to RNA and ATP Nucleic Acids Res. 2022 50 11775 11798 10.1093/nar/gkac1054 36399514 PMC9723501 25. Wang C. Li Q. Wang Z. Xie W. Crystal Structure and Thermostability Characterization of Enterovirus D68 3D J. Virol. 2017 91 e00876-17 10.1128/JVI.00876-17 28659472 PMC5571268 26. Wang Z.Y. Zhong T. Wang Y. Song F.M. Yu X.F. Xing L.P. Zhang W.Y. Yu J.H. Hua S.C. Human Enterovirus 68 Interferes with the Host Cell Cycle to Facilitate Viral Production Front. Cell. Infect. Microbiol. 2017 7 29 10.3389/fcimb.2017.00029 28229049 PMC5296350 27. Jan S.L. Fu Y.C. Chi C.S. Lee H.F. Huang F.L. Wang C.C. Wei H.J. Lin M.C. Chen P.Y. Hwang B. Catecholamine-Induced Secondary Takotsubo Syndrome in Children With Severe Enterovirus 71 Infection and Acute Heart Failure: A 20-year Experience of a Single Institute Front. Cardiovasc. Med. 2021 8 752232 10.3389/fcvm.2021.752232 34631843 PMC8495023 28. Oermann C.M. Schuster J.E. Conners G.P. Newland J.G. Selvarangan R. Jackson M.A. Enterovirus d68. A focused review and clinical highlights from the 2014 U.S. Outbreak Ann. Am. Thorac. Soc. 2015 12 775 781 10.1513/AnnalsATS.201412-592FR 25714788 29. Sun J. Hu X.Y. Yu X.F. Current Understanding of Human Enterovirus D68 Viruses 2019 11 490 10.3390/v11060490 31146373 PMC6631698 30. Tammaro C. Guida M. Appetecchia F. Biava M. Consalvi S. Poce G. Direct-Acting Antivirals and Host-Targeting Approaches against Enterovirus B Infections: Recent Advances Pharmaceuticals 2023 16 203 10.3390/ph16020203 37259352 PMC9966857 31. Chen T.C. Liu S.C. Huang P.N. Chang H.Y. Chern J.H. Shih S.R. Antiviral activity of pyridyl imidazolidinones against enterovirus 71 variants J. Biomed. Sci. 2008 15 291 300 10.1007/s11373-007-9228-5 18196474 32. Hsieh C.F. Jheng J.R. Lin G.H. Chen Y.L. Ho J.Y. Liu C.J. Hsu K.Y. Chen Y.S. Chan Y.F. Yu H.M. Rosmarinic acid exhibits broad anti-enterovirus A71 activity by inhibiting the interaction between the five-fold axis of capsid VP1 and cognate sulfated receptors Emerg. Microbes Infect. 2020 9 1194 1205 10.1080/22221751.2020.1767512 32397909 PMC7448925 33. Lin W.Y. Yu Y.J. Jinn T.R. Evaluation of the virucidal effects of rosmarinic acid against enterovirus 71 infection via in vitro and in vivo study Virol. J. 2019 16 94 10.1186/s12985-019-1203-z 31366366 PMC6670152 34. Ma C. Hu Y. Zhang J. Musharrafieh R. Wang J. A Novel Capsid Binding Inhibitor Displays Potent Antiviral Activity against Enterovirus D68 ACS Infect. Dis. 2019 5 1952 1962 10.1021/acsinfecdis.9b00284 31532189 PMC7167248 35. Lacroix C. Laconi S. Angius F. Coluccia A. Silvestri R. Pompei R. Neyts J. Leyssen P. In vitro characterisation of a pleconaril/pirodavir-like compound with potent activity against rhinoviruses Virol. J. 2015 12 106 10.1186/s12985-015-0330-4 26169596 PMC4501209 36. Zhang X. Yang P. Wang N. Zhang J. Li J. Guo H. Yin X. Rao Z. Wang X. Zhang L. The binding of a monoclonal antibody to the apical region of SCARB2 blocks EV71 infection Protein Cell 2017 8 590 600 10.1007/s13238-017-0405-7 28447294 PMC5546930 37. Ren P. Zheng Y. Wang W. Hong L. Delpeyroux F. Arenzana-Seisdedos F. Altmeyer R. Suramin interacts with the positively charged region surrounding the 5-fold axis of the EV-A71 capsid and inhibits multiple enterovirus A Sci. Rep. 2017 7 42902 10.1038/srep42902 28218309 PMC5317167 38. Reshamwala D. Shroff S. Sheik Amamuddy O. Laquintana V. Denora N. Zacheo A. Lampinen V. Hytonen V.P. Tastan Bishop Ö. Krol S. Polyphenols Epigallocatechin Gallate and Resveratrol, and Polyphenol-Functionalized Nanoparticles Prevent Enterovirus Infection through Clustering and Stabilization of the Viruses Pharmaceutics 2021 13 1182 10.3390/pharmaceutics13081182 34452144 PMC8398301 39. Huang Y.L. Lin T.M. Wang S.Y. Wang J.R. The role of conserved arginine and proline residues in enterovirus VP1 protein J. Microbiol. Immunol. Infect. 2022 55 590 597 10.1016/j.jmii.2022.01.004 35232679 40. Huang Y.L. Huang S.W. Shen C.Y. Cheng D. Wang J.R. Conserved Residues Adjacent to ß-Barrel and Loop Intersection among Enterovirus VP1 Affect Viral Replication: Potential Target for Anti-Enteroviral Development Viruses 2022 14 364 10.3390/v14020364 35215957 PMC8877150 41. Plevka P. Perera R. Yap M.L. Cardosa J. Kuhn R.J. Rossmann M.G. Structure of human enterovirus 71 in complex with a capsid-binding inhibitor Proc. Natl. Acad. Sci. USA 2013 110 5463 5467 10.1073/pnas.1222379110 23509286 PMC3619292 42. Zhang G. Zhou F. Gu B. Ding C. Feng D. Xie F. Wang J. Zhang C. Cao Q. Deng Y. In vitro and in vivo evaluation of ribavirin and pleconaril antiviral activity against enterovirus 71 infection Arch. Virol. 2012 157 669 679 10.1007/s00705-011-1222-6 22245989 43. Smee D.F. Evans W.J. Nicolaou K.C. Tarbet E.B. Day C.W. Susceptibilities of enterovirus D68, enterovirus 71, and rhinovirus 87 strains to various antiviral compounds Antivir. Res. 2016 131 61 65 10.1016/j.antiviral.2016.04.003 27063860 PMC5100981 44. Tijsma A. Franco D. Tucker S. Hilgenfeld R. Froeyen M. Leyssen P. Neyts J. The capsid binder Vapendavir and the novel protease inhibitor SG85 inhibit enterovirus 71 replication Antimicrob. Agents Chemother. 2014 58 6990 6992 10.1128/AAC.03328-14 25199773 PMC4249361 45. Kim J. Jung Y.K. Kim C. Shin J.S. Scheers E. Lee J.Y. Han S.B. Lee C.K. Neyts J. Ha J.D. A Novel Series of Highly Potent Small Molecule Inhibitors of Rhinovirus Replication J. Med. Chem. 2017 60 5472 5492 10.1021/acs.jmedchem.7b00175 28581749 46. Ho J.Y. Chern J.H. Hsieh C.F. Liu S.T. Liu C.J. Wang Y.S. Kuo T.W. Hsu S.J. Yeh T.K. Shih S.R. In vitro and in vivo studies of a potent capsid-binding inhibitor of enterovirus 71 J. Antimicrob. Chemother. 2016 71 1922 1932 10.1093/jac/dkw101 27098012 47. De Colibus L. Wang X. Spyrou J.A.B. Kelly J. Ren J. Grimes J. Puerstinger G. Stonehouse N. Walter T.S. Hu Z. More-powerful virus inhibitors from structure-based analysis of HEV71 capsid-binding molecules Nat. Struct. Mol. Biol. 2014 21 282 288 10.1038/nsmb.2769 24509833 PMC4530014 48. Zhang M. Wang Y. He W. Sun Y. Guo Y. Zhong W. Gao Q. Liao M. Wang X. Cai Y. Design, Synthesis, and Evaluation of Novel Enterovirus 71 Inhibitors as Therapeutic Drug Leads for the Treatment of Human Hand, Foot, and Mouth Disease J. Med. Chem. 2020 63 1233 1244 10.1021/acs.jmedchem.9b01414 31939669 49. Chern J.H. Lee C.C. Chang C.S. Lee Y.C. Tai C.L. Lin Y.T. Shia K.S. Lee C.Y. Shih S.R. Synthesis and antienteroviral activity of a series of novel, oxime ether-containing pyridyl imidazolidinones Bioorg Med. Chem. Lett. 2004 14 5051 5056 10.1016/j.bmcl.2004.07.084 15380197 50. Li P. Yu J. Hao F. He H. Shi X. Hu J. Wang L. Du C. Zhang X. Sun Y. Discovery of Potent EV71 Capsid Inhibitors for Treatment of HFMD ACS Med. Chem. Lett. 2017 8 841 846 10.1021/acsmedchemlett.7b00188 28835799 PMC5554915 51. Han X. Sun N. Wu H. Guo D. Tien P. Dong C. Wu S. Zhou H.B. Identification and Structure-Activity Relationships of Diarylhydrazides as Novel Potent and Selective Human Enterovirus Inhibitors J. Med. Chem. 2016 59 2139 2150 10.1021/acs.jmedchem.5b01803 26885567 52. Arita M. Fuchino H. Kawakami H. Ezaki M. Kawahara N. Characterization of a New Antienterovirus D68 Compound Purified from Avocado ACS Infect. Dis. 2020 6 2291 2300 10.1021/acsinfecdis.0c00404 32567833 53. Li G. Gao Q. Yuan S. Wang L. Altmeyer R. Lan K. Yin F. Zou G. Characterization of three small molecule inhibitors of enterovirus 71 identified from screening of a library of natural products Antivir. Res. 2017 143 85 96 10.1016/j.antiviral.2017.04.006 28412182 54. Bernard A. Lacroix C. Cabiddu M.G. Neyts J. Leyssen P. Pompei R. Exploration of the anti-enterovirus activity of a series of pleconaril/pirodavir-like compounds Antivir. Chem. Chemother. 2015 24 56 61 10.1177/2040206615589035 26071135 PMC5890516 55. Egorova A. Kazakova E. Jahn B. Ekins S. Makarov V. Schmidtke M. Novel pleconaril derivatives: Influence of substituents in the isoxazole and phenyl rings on the antiviral activity against enteroviruses Eur. J. Med. Chem. 2020 188 112007 10.1016/j.ejmech.2019.112007 31881489 PMC7002245 56. Makarov V.A. Braun H. Richter M. Riabova O.B. Kirchmair J. Kazakova E.S. Seidel N. Wutzler P. Schmidtke M. Pyrazolopyrimidines: Potent Inhibitors Targeting the Capsid of Rhino- and Enteroviruses ChemMedChem 2015 10 1629 1634 10.1002/cmdc.201500304 26260222 PMC4600222 57. Carta A. Sanna G. Briguglio I. Madeddu S. Vitale G. Piras S. Corona P. Peana A.T. Laurini E. Fermeglia M. Quinoxaline derivatives as new inhibitors of coxsackievirus B5 Eur. J. Med. Chem. 2018 145 559 569 10.1016/j.ejmech.2017.12.083 29339251 58. Madeddu S. Ibba R. Sanna G. Piras S. Riu F. Marongiu A. Ambrosino A. Caria P. Onnis V. Franci G. Human Enterovirus B: Selective Inhibition by Quinoxaline Derivatives and Bioinformatic RNA-Motif Identification as New Targets Pharmaceuticals 2022 15 181 10.3390/ph15020181 35215294 PMC8878107 59. Kalam N. Balasubramaniam V.R.M.T. Emerging Therapeutics in the Fight Against EV-D68: A Review of Current Strategies Influenza Other Respir. Viruses 2024 18 e70064 10.1111/irv.70064 39702696 PMC11659119 60. Liu Y. Sheng J. Fokine A. Meng G. Shin W.H. Long F. Kuhn R.J. Kihara D. Rossmann M.G. Structure and inhibition of EV-D68, a virus that causes respiratory illness in children Science 2015 347 71 74 10.1126/science.1261962 25554786 PMC4307789 61. Senior K. FDA panel rejects common cold treatment Lancet Infect. Dis. 2002 2 264 10.1016/S1473-3099(02)00277-3 12062983 62. Rhoden E. Zhang M. Nix W.A. Oberste M.S. In Vitro Efficacy of Antiviral Compounds against Enterovirus D68 Antimicrob. Agents Chemother. 2015 59 7779 7781 10.1128/AAC.00766-15 26149998 PMC4649146 63. Li X. Li Y. Fan S. Cao R. He X. Li W. Xu L. Cheng T. Li H. Zhong W. Discovery and Optimization of Quinoline Analogues as Novel Potent Antivirals against Enterovirus D68 J. Med. Chem. 2022 65 14792 14808 10.1021/acs.jmedchem.2c01311 36254462 PMC9661475 64. Ma Y. Abdelnabi R. Delang L. Froeyen M. Luyten W. Neyts J. Mirabelli C. New class of early-stage enterovirus inhibitors with a novel mechanism of action Antivir. Res. 2017 147 67 74 10.1016/j.antiviral.2017.10.004 28993161 65. Shetnev A.A. Volobueva A.S. Panova V.A. Zarubaev V.V. Baykov S.V. Design of 4-Substituted Sulfonamidobenzoic Acid Derivatives Targeting Coxsackievirus B3 Life 2022 12 1832 10.3390/life12111832 36362987 PMC9694965 66. Sun L. Lee H. Thibaut H.J. Lanko K. Rivero-Buceta E. Bator C. Martinez-Gualda B. Dallmeier K. Delang L. Leyssen P. Viral engagement with host receptors blocked by a novel class of tryptophan dendrimers that targets the 5-fold-axis of the enterovirus-A71 capsid PLoS Pathog. 2019 15 e1007760 10.1371/journal.ppat.1007760 31071193 PMC6590834 67. Martínez-Gualda B. Sun L. Martí-Marí O. Noppen S. Abdelnabi R. Bator C.M. Quesada E. Delang L. Mirabelli C. Lee H. Scaffold Simplification Strategy Leads to a Novel Generation of Dual Human Immunodeficiency Virus and Enterovirus-A71 Entry Inhibitors J. Med. Chem. 2020 63 349 368 10.1021/acs.jmedchem.9b01737 31809045 68. Ren P. Zou G. Bailly B. Xu S. Zeng M. Chen X. Shen L. Zhang Y. Guillon P. Arenzana-Seisdedos F. The approved pediatric drug suramin identified as a clinical candidate for the treatment of EV71 infection-suramin inhibits EV71 infection in vitro and in vivo Emerg. Microbes Infect. 2014 3 e62 10.1038/emi.2014.60 26038755 PMC4185360 69. Nishimura Y. McLaughlin N.P. Pan J. Goldstein S. Hafenstein S. Shimizu H. Winkler J.D. Bergelson J.M. The Suramin Derivative NF449 Interacts with the 5-fold Vertex of the Enterovirus A71 Capsid to Prevent Virus Attachment to PSGL-1 and Heparan Sulfate PLoS Pathog. 2015 11 e1005184 10.1371/journal.ppat.1005184 26430888 PMC4592248 70. Meng T. Jia Q. Wong S.M. Chua K.B. In Vitro and In Vivo Inhibition of the Infectivity of Human Enterovirus 71 by a Sulfonated Food Azo Dye, Brilliant Black BN J. Virol. 2019 93 10-1128 10.1128/JVI.00061-19 PMC6694806 31167919 71. Wang H. Lei X. Xiao X. Yang C. Lu W. Huang Z. Leng Q. Jin Q. He B. Meng G. Reciprocal Regulation between Enterovirus 71 and the NLRP3 Inflammasome Cell Rep. 2015 12 42 48 10.1016/j.celrep.2015.05.047 26119741 72. Wang B. Xi X. Lei X. Zhang X. Cui S. Wang J. Jin Q. Zhao Z. Enterovirus 71 protease 2Apro targets MAVS to inhibit anti-viral type I interferon responses PLoS Pathog. 2013 9 e1003231 10.1371/journal.ppat.1003231 23555247 PMC3605153 73. Falah N. Montserret R. Lelogeais V. Schuffenecker I. Lina B. Cortay J.C. Violot S. Blocking human enterovirus 71 replication by targeting viral 2A protease J. Antimicrob. Chemother. 2012 67 2865 2869 10.1093/jac/dks304 22865380 74. Wang C.Y. Huang A.C. Hour M.J. Huang S.H. Kung S.H. Chen C.H. Chen I.C. Chang Y.S. Lien J.C. Lin C.W. Antiviral Potential of a Novel Compound CW-33 against Enterovirus A71 via Inhibition of Viral 2A Protease Viruses 2015 7 3155 3171 10.3390/v7062764 26090728 PMC4488731 75. Guo Y. Wang Y. Cao L. Wang P. Qing J. Zheng Q. Shang L. Yin Z. Sun Y. A Conserved Inhibitory Mechanism of a Lycorine Derivative against Enterovirus and Hepatitis C Virus Antimicrob. Agents Chemother. 2016 60 913 924 10.1128/AAC.02274-15 26596952 PMC4750679 76. Li X. Liu Y. Hou X. Peng H. Zhang L. Jiang Q. Shi M. Ji Y. Wang Y. Shi W. Chlorogenic acid inhibits the replication and viability of enterovirus 71 in vitro PLoS ONE 2013 8 e76007 10.1371/journal.pone.0076007 24098754 PMC3786884 77. Chen S.G. Cheng M.L. Chen K.H. Horng J.T. Liu C.C. Wang S.M. Sakurai H. Leu Y.L. Wang S.D. Ho H.Y. Antiviral activities of Schizonepeta tenuifolia Briq. against enterovirus 71 in vitro and in vivo Sci. Rep. 2017 7 935 10.1038/s41598-017-01110-x 28428548 PMC5430552 78. Chen S.G. Leu Y.L. Cheng M.L. Ting S.C. Liu C.C. Wang S.D. Yang C.H. Hung C.Y. Sakurai H. Chen K.H. Anti-enterovirus 71 activities of Melissa officinalis extract and its biologically active constituent rosmarinic acid Sci. Rep. 2017 7 12264 10.1038/s41598-017-12388-2 28947773 PMC5613005 79. Zhang H. Wang X. Wang Y. Pei X. Wang C. Niu Y. Xu P. Peng Y. Substituted 3-benzylcoumarins 13 and 14 suppress enterovirus A71 replication by impairing viral 2A Antivir. Res. 2018 160 10 16 10.1016/j.antiviral.2018.10.012 30315876 80. Musharrafieh R. Ma C. Zhang J. Hu Y. Diesing J.M. Marty M.T. Wang J. Validating Enterovirus D68-2A(pro) as an Antiviral Drug Target and the Discovery of Telaprevir as a Potent D68-2A(pro) Inhibitor J. Virol. 2019 93 10-1128 10.1128/JVI.02221-18 PMC6430540 30674624 81. Wang Y. Zou W. Niu Y. Wang S. Chen B. Xiong R. Zhang P. Luo Z. Wu Y. Fan C. Phosphorylation of enteroviral 2A(pro) at Ser/Thr125 benefits its proteolytic activity and viral pathogenesis J. Med. Virol. 2023 95 e28400 10.1002/jmv.28400 36511115 PMC10107306 82. Cai Q. Yameen M. Liu W. Gao Z. Li Y. Peng X. Cai Y. Wu C. Zheng Q. Li J. Conformational plasticity of the 2A proteinase from enterovirus 71 J. Virol. 2013 87 7348 7356 10.1128/JVI.03541-12 23616646 PMC3700279 83. Xie S. Wang K. Yu W. Lu W. Xu K. Wang J. Ye B. Schwarz W. Jin Q. Sun B. DIDS blocks a chloride-dependent current that is mediated by the 2B protein of enterovirus 71 Cell Res. 2011 21 1271 1275 10.1038/cr.2011.112 21747413 PMC3193483 84. Nieva J.L. Madan V. Carrasco L. Viroporins: Structure and biological functions Nat. Rev. Microbiol. 2012 10 563 574 10.1038/nrmicro2820 22751485 PMC7097105 85. Cong H. Du N. Yang Y. Song L. Zhang W. Tien P. Enterovirus 71 2B Induces Cell Apoptosis by Directly Inducing the Conformational Activation of the Proapoptotic Protein Bax J. Virol. 2016 90 9862 9877 10.1128/JVI.01499-16 27558414 PMC5068536 86. Wang S.H. Wang K. Zhao K. Hua S.C. Du J. The Structure, Function, and Mechanisms of Action of Enterovirus Non-structural Protein 2C Front. Microbiol. 2020 11 615965 10.3389/fmicb.2020.615965 33381104 PMC7767853 87. Guan H. Tian J. Qin B. Wojdyla J.A. Wang B. Zhao Z. Wang M. Cui S. Crystal structure of 2C helicase from enterovirus 71 Sci. Adv. 2017 3 e1602573 10.1126/sciadv.1602573 28508043 PMC5409451 88. Fang Y. Wang C. Yang R. Bai P. Zhang X.Y. Kong J. Yin L. Qiu Y. Zhou X. Antiviral Peptides Targeting the Helicase Activity of Enterovirus Nonstructural Protein 2C J. Virol. 2021 95 e02324-20 10.1128/JVI.02324-20 33789997 PMC8315976 89. Messacar K. Sillau S. Hopkins S.E. Otten C. Wilson-Murphy M. Wong B. Santoro J.D. Treister A. Bains H.K. Torres A. Safety, tolerability, and efficacy of fluoxetine as an antiviral for acute flaccid myelitis Neurology 2019 92 e2118 e2126 10.1212/WNL.0000000000006670 30413631 PMC6512883 90. Tyler K.L. Rationale for the evaluation of fluoxetine in the treatment of enterovirus D68-associated acute flaccid myelitis JAMA Neurol. 2015 72 493 494 10.1001/jamaneurol.2014.4625 25775436 PMC5086417 91. Manganaro R. Zonsics B. Bauer L. Lorenzo Lopez M. Donselaar T. Zwaagstra M. Saporito F. Ferla S. Strating J.R.P.M. Coutard B. Synthesis and antiviral effect of novel fluoxetine analogues as enterovirus 2C inhibitors Antivir. Res. 2020 178 104781 10.1016/j.antiviral.2020.104781 32234539 92. Bauer L. Manganaro R. Zonsics B. Hurdiss D.L. Zwaagstra M. Donselaar T. Welter N.G.E. van Kleef R.G.D.M. Lopez M.L. Bevilacqua F. Rational design of highly potent broad-spectrum enterovirus inhibitors targeting the nonstructural protein 2C PLoS Biol. 2020 18 e3000904 10.1371/journal.pbio.3000904 33156822 PMC7673538 93. Ulferts R. de Boer S.M. van der Linden L. Bauer L. Lyoo H.R. Maté M.J. Lichière J. Canard B. Lelieveld D. Omta W. Screening of a Library of FDA-Approved Drugs Identifies Several Enterovirus Replication Inhibitors That Target Viral Protein 2C Antimicrob. Agents Chemother. 2016 60 2627 2638 10.1128/AAC.02182-15 26856848 PMC4862474 94. Musharrafieh R. Zhang J. Tuohy P. Kitamura N. Bellampalli S.S. Hu Y. Khanna R. Wang J. Discovery of Quinoline Analogues as Potent Antivirals against Enterovirus D68 (EV-D68) J. Med. Chem. 2019 62 4074 4090 10.1021/acs.jmedchem.9b00115 30912944 PMC8055447 95. Musharrafieh R. Kitamura N. Hu Y. Wang J. Development of broad-spectrum enterovirus antivirals based on quinoline scaffold Bioorg Chem. 2020 101 103981 10.1016/j.bioorg.2020.103981 32559580 PMC7390679 96. Tang Q. Xu Z. Jin M. Shu T. Chen Y. Feng L. Zhang Q. Lan K. Wu S. Zhou H.B. Identification of dibucaine derivatives as novel potent enterovirus 2C helicase inhibitors: In vitro, in vivo, and combination therapy study Eur. J. Med. Chem. 2020 202 112310 10.1016/j.ejmech.2020.112310 32619885 97. Ma C. Hu Y. Zhang J. Wang J. Pharmacological Characterization of the Mechanism of Action of R523062, a Promising Antiviral for Enterovirus D68 ACS Infect. Dis. 2020 6 2260 2270 10.1021/acsinfecdis.0c00383 32692536 PMC8057299 98. Zuo J. Kye S. Quinn K.K. Cooper P. Damoiseaux R. Krogstad P. Discovery of Structurally Diverse Small-Molecule Compounds with Broad Antiviral Activity against Enteroviruses Antimicrob. Agents Chemother. 2015 60 1615 1626 10.1128/AAC.02646-15 26711750 PMC4775951 99. Xing Y. Zuo J. Krogstad P. Jung M.E. Synthesis and Structure-Activity Relationship (SAR) Studies of Novel Pyrazolopyridine Derivatives as Inhibitors of Enterovirus Replication J. Med. Chem. 2018 61 1688 1703 10.1021/acs.jmedchem.7b01863 29346733 100. Hu Y. Kitamura N. Musharrafieh R. Wang J. Discovery of Potent and Broad-Spectrum Pyrazolopyridine-Containing Antivirals against Enteroviruses D68, A71, and Coxsackievirus B3 by Targeting the Viral 2C Protein J. Med. Chem. 2021 64 8755 8774 10.1021/acs.jmedchem.1c00758 34085827 PMC9179928 101. De Palma A.M. Heggermont W. Lanke K. Coutard B. Bergmann M. Monforte A.M. Canard B. De Clercq E. Chimirri A. Pürstinger G. The thiazolobenzimidazole TBZE-029 inhibits enterovirus replication by targeting a short region immediately downstream from motif C in the nonstructural protein 2C J. Virol. 2008 82 4720 4730 10.1128/JVI.01338-07 18337578 PMC2346740 102. Guan H. Tian J. Zhang C. Qin B. Cui S. Crystal structure of a soluble fragment of poliovirus 2CATPase PLoS Pathog. 2018 14 e1007304 10.1371/journal.ppat.1007304 30231078 PMC6166989 103. Hurdiss D.L. El Kazzi P. Bauer L. Papageorgiou N. Ferron F.P. Donselaar T. van Vliet A.L.W. Canard B. Decroly E. Brancale A. Fluoxetine targets an allosteric site in the enterovirus 2C AAA+ ATPase and stabilizes the hexameric complex Sci. Adv. 2022 8 eabj7615 10.1126/sciadv.abj7615 34985963 PMC8730599 104. Li Y. Jian X. Yin P. Zhu G. Zhang L. Elucidating the Host Interactome of EV-A71 2C Reveals Viral Dependency Factors Front. Microbiol. 2019 10 636 10.3389/fmicb.2019.00636 31001221 PMC6454016 105. Horova V. Lyoo H. Różycki B. Chalupska D. Smola M. Humpolickova J. Strating J.R.P.M. van Kuppeveld F.J.M. Boura E. Klima M. Convergent evolution in the mechanisms of ACBD3 recruitment to picornavirus replication sites PLoS Pathog. 2019 15 e1007962 10.1371/journal.ppat.1007962 31381608 PMC6695192 106. Li X. Wang M. Cheng A. Wen X. Ou X. Mao S. Gao Q. Sun D. Jia R. Yang Q. Enterovirus Replication Organelles and Inhibitors of Their Formation Front. Microbiol. 2020 11 1817 10.3389/fmicb.2020.01817 32973693 PMC7468505 107. Nagy P.D. Strating J.R. van Kuppeveld F.J. Building Viral Replication Organelles: Close Encounters of the Membrane Types PLoS Pathog. 2016 12 e1005912 10.1371/journal.ppat.1005912 27788266 PMC5082816 108. Lyoo H. van der Schaar H.M. Dorobantu C.M. Rabouw H.H. Strating J.R.P.M. van Kuppeveld F.J.M. ACBD3 Is an Essential Pan-enterovirus Host Factor That Mediates the Interaction between Viral 3A Protein and Cellular Protein PI4KB mBio 2019 10 e02742-18 10.1128/mBio.02742-18 30755512 PMC6372799 109. Miller F.D. Monto A.S. DeLong D.C. Exelby A. Bryan E.R. Srivastava S. Controlled trial of enviroxime against natural rhinovirus infections in a community Antimicrob. Agents Chemother. 1985 27 102 106 10.1128/AAC.27.1.102 2984980 PMC176213 110. Heinz B.A. Vance L.M. The antiviral compound enviroxime targets the 3A coding region of rhinovirus and poliovirus J. Virol. 1995 69 4189 4197 10.1128/jvi.69.7.4189-4197.1995 7769678 PMC189156 111. Arita M. Wakita T. Shimizu H. Characterization of pharmacologically active compounds that inhibit poliovirus and enterovirus 71 infectivity J. Gen. Virol. 2008 89 2518 2530 10.1099/vir.0.2008/002915-0 18796721 112. Arita M. Wakita T. Shimizu H. Cellular kinase inhibitors that suppress enterovirus replication have a conserved target in viral protein 3A similar to that of enviroxime J. Gen. Virol. 2009 90 Pt 8 1869 1879 10.1099/vir.0.012096-0 19439558 113. Arita M. Takebe Y. Wakita T. Shimizu H. A bifunctional anti-enterovirus compound that inhibits replication and the early stage of enterovirus 71 infection J. Gen. Virol. 2010 91 2734 2744 10.1099/vir.0.023374-0 20660150 114. De Palma A.M. Thibaut H.J. van der Linden L. Lanke K. Heggermont W. Ireland S. Andrews R. Arimilli M. Al-Tel T.H. De Clercq E. Mutations in the nonstructural protein 3A confer resistance to the novel enterovirus replication inhibitor TTP-8307 Antimicrob. Agents Chemother. 2009 53 1850 1857 10.1128/AAC.00934-08 19237651 PMC2681499 115. Albulescu L. Bigay J. Biswas B. Weber-Boyvat M. Dorobantu C.M. Delang L. van der Schaar H.M. Jung Y.S. Neyts J. Olkkonen V.M. Uncovering oxysterol-binding protein (OSBP) as a target of the anti-enteroviral compound TTP-8307 Antivir. Res. 2017 140 37 44 10.1016/j.antiviral.2017.01.008 28088354 116. Gao Q. Yuan S. Zhang C. Wang Y. He G. Zhang S. Altmeyer R. Zou G. Discovery of itraconazole with broad-spectrum in vitro antienterovirus activity that targets nonstructural protein 3A Antimicrob. Agents Chemother. 2015 59 2654 2665 10.1128/AAC.05108-14 25691649 PMC4394834 117. Rhoden E. Ng T.F.F. Campagnoli R. Nix W.A. Konopka-Anstadt J. Selvarangan R. Briesach L. Oberste M.S. Weldon W.C. Antifungal Triazole Posaconazole Targets an Early Stage of the Parechovirus A3 Life Cycle Antimicrob. Agents Chemother. 2020 64 e02372-19 10.1128/AAC.02372-19 31818821 PMC7038243 118. Lu G. Qi J. Chen Z. Xu X. Gao F. Lin D. Qian W. Liu H. Jiang H. Yan J. Enterovirus 71 and coxsackievirus A16 3C proteases: Binding to rupintrivir and their substrates and anti-hand, foot, and mouth disease virus drug design J. Virol. 2011 85 10319 10331 10.1128/JVI.00787-11 21795339 PMC3196414 119. de Breyne S. Bonderoff J.M. Chumakov K.M. Lloyd R.E. Hellen C.U. Cleavage of eukaryotic initiation factor eIF5B by enterovirus 3C proteases Virology 2008 378 118 122 10.1016/j.virol.2008.05.019 18572216 PMC2580754 120. Wen W. Qi Z. Wang J. The Function and Mechanism of Enterovirus 71 (EV71) 3C Protease Curr. Microbiol. 2020 77 1968 1975 10.1007/s00284-020-02082-4 32556480 121. Li B. Yue Y. Zhang Y. Yuan Z. Li P. Song N. Lin W. Liu Y. Gu L. Meng H. A Novel Enterovirus 71 (EV71) Virulence Determinant: The 69th Residue of 3C Protease Modulates Pathogenicity Front. Cell. Infect. Microbiol. 2017 7 26 10.3389/fcimb.2017.00026 28217559 PMC5290453 122. Ma Y. Shang C. Yang P. Li L. Zhai Y. Yin Z. Wang B. Shang L. 4-Iminooxazolidin-2-one as a Bioisostere of the Cyanohydrin Moiety: Inhibitors of Enterovirus 71 3C Protease J. Med. Chem. 2018 61 10333 10339 10.1021/acs.jmedchem.8b01335 30365311 123. Ma Y. Li L. He S. Shang C. Sun Y. Liu N. Meek T.D. Wang Y. Shang L. Application of Dually Activated Michael Acceptor to the Rational Design of Reversible Covalent Inhibitor for Enterovirus 71 3C Protease J. Med. Chem. 2019 62 6146 6162 10.1021/acs.jmedchem.9b00387 31184893 124. Ma G.H. Ye Y. Zhang D. Xu X. Si P. Peng J.L. Xiao Y.L. Cao R.Y. Yin Y.L. Chen J. Identification and biochemical characterization of DC07090 as a novel potent small molecule inhibitor against human enterovirus 71 3C protease by structure-based virtual screening Eur. J. Med. Chem. 2016 124 981 991 10.1016/j.ejmech.2016.10.019 27776325 125. Hayden F.G. Turner R.B. Gwaltney J.M. Chi-Burris K. Gersten M. Hsyu P. Patick A.K. Smith G.J. Zalman L.S. Phase II, randomized, double-blind, placebo-controlled studies of ruprintrivir nasal spray 2-percent suspension for prevention and treatment of experimentally induced rhinovirus colds in healthy volunteers Antimicrob. Agents Chemother. 2003 47 3907 3916 10.1128/AAC.47.12.3907-3916.2003 14638501 PMC296196 126. Patick A.K. Brothers M.A. Maldonado F. Binford S. Maldonado O. Fuhrman S. Petersen A. Smith G.J. Zalman L.S. Burns-Naas L.A. In vitro antiviral activity and single-dose pharmacokinetics in humans of a novel, orally bioavailable inhibitor of human rhinovirus 3C protease Antimicrob. Agents Chemother. 2005 49 2267 2275 10.1128/AAC.49.6.2267-2275.2005 15917520 PMC1140523 127. Kankam M.K. Burns J.M. Collett M.S. Corrado M.L. Hincks J.R. A Phase 1 Study of the Safety, Tolerability, and Pharmacokinetics of Single and Multiple Oral Doses of V-7404 in Healthy Adult Volunteers Antimicrob. Agents Chemother. 2021 65 e0102921 10.1128/AAC.01029-21 34370575 PMC8448163 128. Ianevski A. Zusinaite E. Tenson T. Oksenych V. Wang W. Afset J.E. Bjørås M. Kainov D.E. Novel Synergistic Anti-Enteroviral Drug Combinations Viruses 2022 14 1866 10.3390/v14091866 36146673 PMC9505890 129. Kim Y. Lovell S. Tiew K.C. Mandadapu S.R. Alliston K.R. Battaile K.P. Groutas W.C. Chang K.O. Broad-spectrum antivirals against 3C or 3C-like proteases of picornaviruses, noroviruses, and coronaviruses J. Virol. 2012 86 11754 11762 10.1128/JVI.01348-12 22915796 PMC3486288 130. Hu Y. Ma C. Szeto T. Hurst B. Tarbet B. Wang J. Boceprevir, Calpain Inhibitors II and XII, and GC-376 Have Broad-Spectrum Antiviral Activity against Coronaviruses ACS Infect. Dis. 2021 7 586 597 10.1021/acsinfecdis.0c00761 33645977 PMC7944397 131. Wang J. Fan T. Yao X. Wu Z. Guo L. Lei X. Wang M. Jin Q. Cui S. Crystal structures of enterovirus 71 3C protease complexed with rupintrivir reveal the roles of catalytically important residues J. Virol. 2011 85 10021 10030 10.1128/JVI.05107-11 21813612 PMC3196404 132. Tan Y.W. Ang M.J. Lau Q.Y. Poulsen A. Ng F.M. Then S.W. Peng J. Hill J. Hong W.J. Chia C.S. Antiviral activities of peptide-based covalent inhibitors of the Enterovirus 71 3C protease Sci. Rep. 2016 6 33663 10.1038/srep33663 27645381 PMC5028882 133. Schulz R. Atef A. Becker D. Gottschalk F. Tauber C. Wagner S. Arkona C. Abdel-Hafez A.A. Farag H.H. Rademann J. Phenylthiomethyl Ketone-Based Fragments Show Selective and Irreversible Inhibition of Enteroviral 3C Proteases J. Med. Chem. 2018 61 1218 1230 10.1021/acs.jmedchem.7b01440 29328649 134. Wang Y. Yang B. Zhai Y. Yin Z. Sun Y. Rao Z. Peptidyl aldehyde NK-1.8k suppresses enterovirus 71 and enterovirus 68 infection by targeting protease 3C Antimicrob. Agents Chemother. 2015 59 2636 2646 10.1128/AAC.00049-15 25691647 PMC4394787 135. Boras B. Jones R.M. Anson B.J. Arenson D. Aschenbrenner L. Bakowski M.A. Beutler N. Binder J. Chen E. Eng H. Discovery of a Novel Inhibitor of Coronavirus 3CL Protease for the Potential Treatment of COVID-19 bioRxiv 2021 10.1101/2020.09.12.293498 PMC8523698 34663813 136. Wang Y. Cao L. Zhai Y. Yin Z. Sun Y. Shang L. Structure of the Enterovirus 71 3C Protease in Complex with NK-1.8k and Indications for the Development of Antienterovirus Protease Inhibitor Antimicrob. Agents Chemother. 2017 61 e00298-17 10.1128/AAC.00298-17 28461310 PMC5487676 137. Zhang L. Lin D. Kusov Y. Nian Y. Ma Q. Wang J. von Brunn A. Leyssen P. Lanko K. Neyts J. α-Ketoamides as Broad-Spectrum Inhibitors of Coronavirus and Enterovirus Replication: Structure-Based Design, Synthesis, and Activity Assessment J. Med. Chem. 2020 63 4562 4578 10.1021/acs.jmedchem.9b01828 32045235 138. Dai W. Jochmans D. Xie H. Yang H. Li J. Su H. Chang D. Wang J. Peng J. Zhu L. Design, Synthesis, and Biological Evaluation of Peptidomimetic Aldehydes as Broad-Spectrum Inhibitors against Enterovirus and SARS-CoV-2 J. Med. Chem. 2022 65 2794 2808 10.1021/acs.jmedchem.0c02258 33872498 139. Li P. Wu S. Xiao T. Li Y. Su Z. Wei W. Hao F. Hu G. Lin F. Chen X. Design, synthesis, and evaluation of a novel macrocyclic anti-EV71 agent Bioorganic Med. Chem. 2020 28 115551 10.1016/j.bmc.2020.115551 32503695 140. Zhai Y. Zhao X. Cui Z. Wang M. Wang Y. Li L. Sun Q. Yang X. Zeng D. Liu Y. Cyanohydrin as an Anchoring Group for Potent and Selective Inhibitors of Enterovirus 71 3C Protease J. Med. Chem. 2015 58 9414 9420 10.1021/acs.jmedchem.5b01013 26571192 141. Xu B. Liu M. Ma S. Ma Y. Liu S. Shang L. Zhu C. Ye S. Wang Y. 4-Iminooxazolidin-2-One as a Bioisostere of Cyanohydrin Suppresses EV71 Proliferation by Targeting 3C Microbiol. Spectr. 2021 9 e0102521 10.1128/Spectrum.01025-21 34787443 PMC8597634 142. Cao Z. Ding Y. Ke Z. Cao L. Li N. Ding G. Wang Z. Xiao W. Luteoloside Acts as 3C Protease Inhibitor of Enterovirus 71 In Vitro PLoS ONE 2016 11 e0148693 10.1371/journal.pone.0148693 26870944 PMC4752227 143. Kim B.K. Ko H. Jeon E.S. Ju E.S. Jeong L.S. Kim Y.C. 2,3,4-Trihydroxybenzyl-hydrazide analogues as novel potent coxsackievirus B3 3C protease inhibitors Eur. J. Med. Chem. 2016 120 202 216 10.1016/j.ejmech.2016.03.085 27191615 144. Sun Y. Zheng Q. Wang Y. Pang Z. Liu J. Yin Z. Lou Z. Activity-Based Protein Profiling Identifies ATG4B as a Key Host Factor for Enterovirus 71 Proliferation J. Virol. 2019 93 e01092-19 10.1128/JVI.01092-19 31554687 PMC6880168 145. Steuten K. Kim H. Widen J.C. Babin B.M. Onguka O. Lovell S. Bolgi O. Cerikan B. Neufeldt C.J. Cortese M. Challenges for Targeting SARS-CoV-2 Proteases as a Therapeutic Strategy for COVID-19 ACS Infect. Dis. 2021 7 1457 1468 10.1021/acsinfecdis.0c00815 33570381 PMC7901237 146. Kitamura N. Sacco M.D. Ma C. Hu Y. Townsend J.A. Meng X. Zhang F. Zhang X. Ba M. Szeto T. Expedited Approach toward the Rational Design of Noncovalent SARS-CoV-2 Main Protease Inhibitors J. Med. Chem. 2022 65 2848 2865 10.1021/acs.jmedchem.1c00509 33891389 PMC8536799 147. Sun J. Yogarajah T. Lee R.C.H. Kaur P. Inoue M. Tan Y.W. Chu J.J.H. Drug repurposing of pyrimidine analogs as potent antiviral compounds against human enterovirus A71 infection with potential clinical applications Sci. Rep. 2020 10 8159 10.1038/s41598-020-65152-4 32424333 PMC7235037 148. Kang H. Kim C. Kim D.E. Song J.H. Choi M. Choi K. Kang M. Lee K. Kim H.S. Shin J.S. Synergistic antiviral activity of gemcitabine and ribavirin against enteroviruses Antivir. Res. 2015 124 1 10 10.1016/j.antiviral.2015.10.011 26526589 149. Lee K. Kim D.E. Jang K.S. Kim S.J. Cho S. Kim C. Gemcitabine, a broad-spectrum antiviral drug, suppresses enterovirus infections through innate immunity induced by the inhibition of pyrimidine biosynthesis and nucleotide depletion Oncotarget 2017 8 115315 115325 10.18632/oncotarget.23258 29383162 PMC5777774 150. Xu N. Yang J. Zheng B. Zhang Y. Cao Y. Huan C. Wang S. Chang J. Zhang W. The Pyrimidine Analog FNC Potently Inhibits the Replication of Multiple Enteroviruses J. Virol. 2020 94 e00204-20 10.1128/JVI.00204-20 32075935 PMC7163137 151. Wang Y. Li G. Yuan S. Gao Q. Lan K. Altmeyer R. Zou G. In Vitro Assessment of Combinations of Enterovirus Inhibitors against Enterovirus 71 Antimicrob. Agents Chemother. 2016 60 5357 5367 10.1128/AAC.01073-16 27353263 PMC4997834 152. Shang L. Wang Y. Qing J. Shu B. Cao L. Lou Z. Gong P. Sun Y. Yin Z. An adenosine nucleoside analogue NITD008 inhibits EV71 proliferation Antivir. Res. 2014 112 47 58 10.1016/j.antiviral.2014.10.009 25446894 153. Yin Z. Chen Y.L. Schul W. Wang Q.Y. Gu F. Duraiswamy J. Kondreddi R.R. Niyomrattanakit P. Lakshminarayana S.B. Goh A. An adenosine nucleoside inhibitor of dengue virus Proc. Natl. Acad. Sci. USA 2009 106 20435 20439 10.1073/pnas.0907010106 19918064 PMC2787148 154. Deng C.L. Yeo H. Ye H.Q. Liu S.Q. Shang B.D. Gong P. Alonso S. Shi P.Y. Zhang B. Inhibition of enterovirus 71 by adenosine analog NITD008 J. Virol. 2014 88 11915 11923 10.1128/JVI.01207-14 25100827 PMC4178731 155. Yin W. Mao C. Luan X. Shen D.D. Shen Q. Su H. Wang X. Zhou F. Zhao W. Gao M. Structural basis for inhibition of the RNA-dependent RNA polymerase from SARS-CoV-2 by remdesivir Science 2020 368 1499 1504 10.1126/science.abc1560 32358203 PMC7199908 156. Tosh D.K. Toti K.S. Hurst B.L. Julander J.G. Jacobson K.A. Structure activity relationship of novel antiviral nucleosides against Enterovirus A71 Bioorg Med. Chem. Lett. 2020 30 127599 10.1016/j.bmcl.2020.127599 33031923 PMC7534897 157. Chen T.C. Chang H.Y. Lin P.F. Chern J.H. Hsu J.T. Chang C.Y. Shih S.R. Novel antiviral agent DTriP-22 targets RNA-dependent RNA polymerase of enterovirus 71 Antimicrob. Agents Chemother. 2009 53 2740 2747 10.1128/AAC.00101-09 19414569 PMC2704669 158. Hung H.C. Chen T.C. Fang M.Y. Yen K.J. Shih S.R. Hsu J.T. Tseng C.P. Inhibition of enterovirus 71 replication and the viral 3D polymerase by aurintricarboxylic acid J. Antimicrob. Chemother. 2010 65 676 683 10.1093/jac/dkp502 20089540 PMC7110181 159. van der Linden L. Vives-Adrián L. Selisko B. Ferrer-Orta C. Liu X. Lanke K. Ulferts R. De Palma A.M. Tanchis F. Goris N. The RNA template channel of the RNA-dependent RNA polymerase as a target for development of antiviral therapy of multiple genera within a virus family PLoS Pathog. 2015 11 e1004733 10.1371/journal.ppat.1004733 25799064 PMC4370873 160. Velu A.B. Chen G.W. Hsieh P.T. Horng J.T. Hsu J.T. Hsieh H.P. Chen T.C. Weng K.F. Shih S.R. BPR-3P0128 inhibits RNA-dependent RNA polymerase elongation and VPg uridylylation activities of Enterovirus 71 Antivir. Res. 2014 112 18 25 10.1016/j.antiviral.2014.10.003 25448086 161. Wu K.X. Chu J.J. Antiviral screen identifies EV71 inhibitors and reveals camptothecin-target, DNA topoisomerase 1 as a novel EV71 host factor Antivir. Res. 2017 143 122 133 10.1016/j.antiviral.2017.04.008 28427827 162. Li W. Ross-Smith N. Proud C.G. Belsham G.J. Cleavage of translation initiation factor 4AI (eIF4AI) but not eIF4AII by foot-and-mouth disease virus 3C protease: Identification of the eIF4AI cleavage site FEBS Lett. 2001 507 1 5 10.1016/S0014-5793(01)02885-X 11682048 163. Shih S.R. Stollar V. Li M.L. Host factors in enterovirus 71 replication J. Virol. 2011 85 9658 9666 10.1128/JVI.05063-11 21715481 PMC3196451 164. Arita M. Phosphatidylinositol-4 kinase III beta and oxysterol-binding protein accumulate unesterified cholesterol on poliovirus-induced membrane structure Microbiol. Immunol. 2014 58 239 256 10.1111/1348-0421.12144 24527995 165. Roulin P.S. Lötzerich M. Torta F. Tanner L.B. van Kuppeveld F.J. Wenk M.R. Greber U.F. Rhinovirus uses a phosphatidylinositol 4-phosphate/cholesterol counter-current for the formation of replication compartments at the ER-Golgi interface Cell Host Microbe 2014 16 677 690 10.1016/j.chom.2014.10.003 25525797 166. Albulescu L. Strating J.R. Thibaut H.J. van der Linden L. Shair M.D. Neyts J. van Kuppeveld F.J. Broad-range inhibition of enterovirus replication by OSW-1, a natural compound targeting OSBP Antivir. Res. 2015 117 110 114 10.1016/j.antiviral.2015.02.013 25752737 167. Burgett A.W. Poulsen T.B. Wangkanont K. Anderson D.R. Kikuchi C. Shimada K. Okubo S. Fortner K.C. Mimaki Y. Kuroda M. Natural products reveal cancer cell dependence on oxysterol-binding proteins Nat. Chem. Biol. 2011 7 639 647 10.1038/nchembio.625 21822274 PMC3158287 168. Roberts B.L. Severance Z.C. Bensen R.C. Le A.T. Kothapalli N.R. Nuñez J.I. Ma H. Wu S. Standke S.J. Yang Z. Transient Compound Treatment Induces a Multigenerational Reduction of Oxysterol-Binding Protein (OSBP) Levels and Prophylactic Antiviral Activity ACS Chem. Biol. 2019 14 276 287 10.1021/acschembio.8b00984 30576108 PMC6379863 169. Strating J.R. van der Linden L. Albulescu L. Bigay J. Arita M. Delang L. Leyssen P. van der Schaar H.M. Lanke K.H. Thibaut H.J. Itraconazole inhibits enterovirus replication by targeting the oxysterol-binding protein Cell Rep. 2015 10 600 615 10.1016/j.celrep.2014.12.054 25640182 PMC4383725 170. Roberts B.L. Severance Z.C. Bensen R.C. Le-McClain A.T. Malinky C.A. Mettenbrink E.M. Nuñez J.I. Reddig W.J. Blewett E.L. Burgett A.W.G. Differing activities of oxysterol-binding protein (OSBP) targeting anti-viral compounds Antivir. Res. 2019 170 104548 10.1016/j.antiviral.2019.104548 31271764 PMC10786240 171. Arita M. Dobrikov G. Pürstinger G. Galabov A.S. Allosteric Regulation of Phosphatidylinositol 4-Kinase III Beta by an Antipicornavirus Compound MDL-860 ACS Infect. Dis. 2017 3 585 594 10.1021/acsinfecdis.7b00053 28605587 172. Mejdrová I. Chalupská D. Plačková P. Müller C. Šála M. Klíma M. Baumlová A. Hřebabecký H. Procházková E. Dejmek M. Rational Design of Novel Highly Potent and Selective Phosphatidylinositol 4-Kinase IIIβ (PI4KB) Inhibitors as Broad-Spectrum Antiviral Agents and Tools for Chemical Biology J. Med. Chem. 2017 60 100 118 10.1021/acs.jmedchem.6b01465 28004945 173. Nikolova I. Slavchev I. Ravutsov M. Dangalov M. Nikolova Y. Zagranyarska I. Stoyanova A. Nikolova N. Mukova L. Grozdanov P. Anti-enteroviral activity of new MDL-860 analogues: Synthesis, in vitro/in vivo studies and QSAR analysis Bioorganic Chem. 2019 85 487 497 10.1016/j.bioorg.2019.02.020 30782563 174. Yang Y. Cao L. Gao H. Wu Y. Wang Y. Fang F. Lan T. Lou Z. Rao Y. Discovery, Optimization, and Target Identification of Novel Potent Broad-Spectrum Antiviral Inhibitors J. Med. Chem. 2019 62 4056 4073 10.1021/acs.jmedchem.9b00091 30938999 175. Zhang L. Das P. Schmolke M. Manicassamy B. Wang Y. Deng X. Cai L. Tu B.P. Forst C.V. Roth M.G. Inhibition of pyrimidine synthesis reverses viral virulence factor-mediated block of mRNA nuclear export J. Cell Biol. 2012 196 315 326 10.1083/jcb.201107058 22312003 PMC3275370 176. Hoffmann H.H. Kunz A. Simon V.A. Palese P. Shaw M.L. Broad-spectrum antiviral that interferes with de novo pyrimidine biosynthesis Proc. Natl. Acad. Sci. USA 2011 108 5777 5782 10.1073/pnas.1101143108 21436031 PMC3078400 177. Cheung N.N. Lai K.K. Dai J. Kok K.H. Chen H. Chan K.H. Yuen K.Y. Kao R.Y.T. Broad-spectrum inhibition of common respiratory RNA viruses by a pyrimidine synthesis inhibitor with involvement of the host antiviral response J. Gen. Virol. 2017 98 946 954 10.1099/jgv.0.000758 28555543 178. Liou A.T. Liao C.C. Chou S.F. Chang Y.S. Chang C.S. Shih C. Hypoxia and therapeutic treatment of EV-A71 with an immune modulator TLR7 agonist in a new immunocompetent mouse model J. Biomed. Sci. 2019 26 93 10.1186/s12929-019-0585-y 31711481 PMC6849267 179. Zhang Q. Zhao B. Chen X. Song N. Wu J. Li G. Yu P. Han Y. Liu J. Qin C. GS-9620 inhibits enterovirus 71 replication mainly through the NF-κB and PI3K-AKT signaling pathways Antivir. Res. 2018 153 39 48 10.1016/j.antiviral.2018.02.002 29425831 180. Hung H.C. Wang H.C. Shih S.R. Teng I.F. Tseng C.P. Hsu J.T. Synergistic inhibition of enterovirus 71 replication by interferon and rupintrivir J. Infect. Dis. 2011 203 1784 1790 10.1093/infdis/jir174 21536800 181. Mohamed A. Bakir T. Al-Hawel H. Al-Sharif I. Bakheet R. Kouser L. Murugaiah V. Al-Mozaini M. HIV-2 Vpx neutralizes host restriction factor SAMHD1 to promote viral pathogenesis Sci. Rep. 2021 11 20984 10.1038/s41598-021-00415-2 34697376 PMC8545964 182. Li Z. Huan C. Wang H. Liu Y. Liu X. Su X. Yu J. Zhao Z. Yu X.F. Zheng B. TRIM21-mediated proteasomal degradation of SAMHD1 regulates its antiviral activity EMBO Rep. 2020 21 e47528 10.15252/embr.201847528 31797533 PMC6944907 183. Li Z. Yang X. Zhao Z. Liu X. Zhang W. Host Restriction Factor A3G Inhibits the Replication of Enterovirus D68 by Competitively Binding the 5’ Untranslated Region with PCBP1 J. Virol. 2022 96 e0170821 10.1128/JVI.01708-21 34730395 PMC8791300 184. Li Y.L. Langley C.A. Azumaya C.M. Echeverria I. Chesarino N.M. Emerman M. Cheng Y. Gross J.D. The structural basis for HIV-1 Vif antagonism of human APOBEC3G Nature 2023 615 728 733 10.1038/s41586-023-05779-1 36754086 PMC10033410 185. Tan C.W. Poh C.L. Sam I.C. Chan Y.F. Enterovirus 71 uses cell surface heparan sulfate glycosaminoglycan as an attachment receptor J. Virol. 2013 87 611 620 10.1128/JVI.02226-12 23097443 PMC3536405 186. Earley D.F. Bailly B. Maggioni A. Kundur A.R. Thomson R.J. Chang C.W. von Itzstein M. Efficient Blocking of Enterovirus 71 Infection by Heparan Sulfate Analogues Acting as Decoy Receptors ACS Infect. Dis. 2019 5 1708 1717 10.1021/acsinfecdis.9b00070 31307190 187. Pourianfar H.R. Poh C.L. Fecondo J. Grollo L. In vitro evaluation of the antiviral activity of heparan sulfate mimetic compounds against Enterovirus 71 Virus Res. 2012 169 22 29 10.1016/j.virusres.2012.06.025 22771616 188. Weng T.Y. Chen L.C. Shyu H.W. Chen S.H. Wang J.R. Yu C.K. Lei H.Y. Yeh T.M. Lactoferrin inhibits enterovirus 71 infection by binding to VP1 protein and host cells Antivir. Res. 2005 67 31 37 10.1016/j.antiviral.2005.03.005 15916817 189. Yuan S. Chu H. Huang J. Zhao X. Ye Z.W. Lai P.M. Wen L. Cai J.P. Mo Y. Cao J. Viruses harness YxxØ motif to interact with host AP2M1 for replication: A vulnerable broad-spectrum antiviral target Sci. Adv. 2020 6 eaba7910 10.1126/sciadv.aba7910 32923629 PMC7455044 190. Hao T. Li Y. Fan S. Li W. Wang S. Li S. Cao R. Zhong W. Design, synthesis and pharmacological evaluation of a novel mTOR-targeted anti-EV71 agent Eur. J. Med. Chem. 2019 175 172 186 10.1016/j.ejmech.2019.04.048 31082764 191. Wang H. Guo T. Yang Y. Yu L. Pan X. Li Y. Lycorine Derivative LY-55 Inhibits EV71 and CVA16 Replication Through Downregulating Autophagy Front. Cell. Infect. Microbiol. 2019 9 277 10.3389/fcimb.2019.00277 31448243 PMC6692562 192. Li J. Yang S. Liu S. Chen Y. Liu H. Su Y. Liu R. Cui Y. Song Y. Teng Y. Transcriptomic Profiling Reveals a Role for TREM-1 Activation in Enterovirus D68 Infection-Induced Proinflammatory Responses Front. Immunol. 2021 12 749618 10.3389/fimmu.2021.749618 34887856 PMC8650217 193. Qing J. Wang Y. Sun Y. Huang J. Yan W. Wang J. Su D. Ni C. Li J. Rao Z. Cyclophilin A associates with enterovirus-71 virus capsid and plays an essential role in viral infection as an uncoating regulator PLoS Pathog. 2014 10 e1004422 10.1371/journal.ppat.1004422 25275585 PMC4183573 194. Yan W. Qing J. Mei H. Nong J. Huang J. Zhu J. Jiang H. Liu L. Zhang L. Li J. Identification, synthesis and pharmacological evaluation of novel anti-EV71 agents via cyclophilin A inhibition Bioorg Med. Chem. Lett. 2015 25 5682 5686 10.1016/j.bmcl.2015.11.002 26564266 195. Hixon A.M. Clarke P. Tyler K.L. Evaluating Treatment Efficacy in a Mouse Model of Enterovirus D68-Associated Paralytic Myelitis J. Infect. Dis. 2017 216 1245 1253 10.1093/infdis/jix468 28968718 PMC5853295 196. Vogt M.R. Fu J. Kose N. Williamson L.E. Bombardi R. Setliff I. Georgiev I.S. Klose T. Rossmann M.G. Bochkov Y.A. Human antibodies neutralize enterovirus D68 and protect against infection and paralytic disease Sci. Immunol. 2020 5 eaba4902 10.1126/sciimmunol.aba4902 32620559 PMC7418079 197. Zheng H. Wang J. Li B. Guo L. Li H. Song J. Yang Z. Fan H. Huang X. Long H. A Novel Neutralizing Antibody Specific to the DE Loop of VP1 Can Inhibit EV-D68 Infection in Mice J. Immunol. 2018 201 2557 2569 10.4049/jimmunol.1800655 30282753 198. Zheng Q. Zhu R. Xu L. He M. Yan X. Liu D. Yin Z. Wu Y. Li Y. Yang L. Atomic structures of enterovirus D68 in complex with two monoclonal antibodies define distinct mechanisms of viral neutralization Nat. Microbiol. 2019 4 124 133 10.1038/s41564-018-0275-7 30397341 PMC6727974 199. Yang J. Yang C. Guo N. Zhu K. Luo K. Zhang N. Zhao H. Cui Y. Chen L. Wang H. Type I Interferons Triggered through the Toll-Like Receptor 3-TRIF Pathway Control Coxsackievirus A16 Infection in Young Mice J. Virol. 2015 89 10860 10867 10.1128/JVI.01627-15 26292317 PMC4621134 200. Dong Y. Liu J. Lu N. Zhang C. Enterovirus 71 Antagonizes Antiviral Effects of Type III Interferon and Evades the Clearance of Intestinal Intraepithelial Lymphocytes Front. Microbiol. 2021 12 806084 10.3389/fmicb.2021.806084 35185830 PMC8848745 201. Xiang Z. Liu L. Lei X. Zhou Z. He B. Wang J. 3C Protease of Enterovirus D68 Inhibits Cellular Defense Mediated by Interferon Regulatory Factor 7 J. Virol. 2016 90 1613 1621 10.1128/JVI.02395-15 26608321 PMC4719596 202. Napoli C. Lemieux C. Jorgensen R. Introduction of a Chimeric Chalcone Synthase Gene into Petunia Results in Reversible Co-Suppression of Homologous Genes in trans Plant Cell 1990 2 279 289 10.2307/3869076 12354959 PMC159885 203. Fire A. Xu S. Montgomery M.K. Kostas S.A. Driver S.E. Mello C.C. Potent and specific genetic interference by double-stranded RNA in Caenorhabditis elegans Nature 1998 391 806 811 10.1038/35888 9486653 204. Wang J. Li Y. Current advances in antiviral RNA interference in mammals FEBS J. 2024 291 208 216 10.1111/febs.16728 36652199 205. Takahashi T. Ui-Tei K. Mutual Regulation of RNA Silencing and the IFN Response as an Antiviral Defense System in Mammalian Cells Int. J. Mol. Sci. 2020 21 1348 10.3390/ijms21041348 32079277 PMC7072894 206. Zhang Y. Xu Y. Dai Y. Li Z. Wang J. Ye Z. Ren Y. Wang H. Li W.X. Lu J. Efficient Dicer processing of virus-derived double-stranded RNAs and its modulation by RIG-I-like receptor LGP2 PLoS Pathog. 2021 17 e1009790 10.1371/journal.ppat.1009790 34343211 PMC8362961 207. Han Q. Chen G. Wang J. Jee D. Li W.X. Lai E.C. Ding S.W. Mechanism and Function of Antiviral RNA Interference in Mice mBio 2020 11 e03278-19 10.1128/mBio.03278-19 32753500 PMC7407090 208. Zhang Y. Li Z. Ye Z. Xu Y. Wang B. Wang C. Dai Y. Lu J. Lu B. Zhang W. The activation of antiviral RNA interference not only exists in neural progenitor cells but also in somatic cells in mammals Emerg. Microbes Infect. 2020 9 1580 1589 10.1080/22221751.2020.1787798 32576094 PMC7473182 209. Poirier E.Z. Buck M.D. Chakravarty P. Carvalho J. Frederico B. Cardoso A. Healy L. Ulferts R. Beale R. Reis e Sousa C. An isoform of Dicer protects mammalian stem cells against multiple RNA viruses Science 2021 373 231 236 10.1126/science.abg2264 34244417 PMC7611482 210. Li W.X. Ding S.W. Mammalian viral suppressors of RNA interference Trends Biochem. Sci. 2022 47 978 988 10.1016/j.tibs.2022.05.001 35618579 PMC10281742 211. Werk D. Schubert S. Lindig V. Grunert H.P. Zeichhardt H. Erdmann V.A. Kurreck J. Developing an effective RNA interference strategy against a plus-strand RNA virus: Silencing of coxsackievirus B3 and its cognate coxsackievirus-adenovirus receptor Biol. Chem. 2005 386 857 863 10.1515/BC.2005.100 16164410 212. Merl S. Michaelis C. Jaschke B. Vorpahl M. Seidl S. Wessely R. Targeting 2A protease by RNA interference attenuates coxsackieviral cytopathogenicity and promotes survival in highly susceptible mice Circulation 2005 111 1583 1592 10.1161/01.CIR.0000160360.02040.AB 15795330 213. Yuan J. Cheung P.K. Zhang H.M. Chau D. Yang D. Inhibition of coxsackievirus B3 replication by small interfering RNAs requires perfect sequence match in the central region of the viral positive strand J. Virol. 2005 79 2151 2159 10.1128/JVI.79.4.2151-2159.2005 15681418 PMC546545 214. Kim J.Y. Chung S.K. Hwang H.Y. Kim H. Kim J.H. Nam J.H. Park S.I. Expression of short hairpin RNAs against the coxsackievirus B3 exerts potential antiviral effects in Cos-7 cells and in mice Virus Res. 2007 125 9 13 10.1016/j.virusres.2006.11.009 17222937 215. Fechner H. Pinkert S. Wang X. Sipo I. Suckau L. Kurreck J. Dörner A. Sollerbrant K. Zeichhardt H. Grunert H.P. Coxsackievirus B3 and adenovirus infections of cardiac cells are efficiently inhibited by vector-mediated RNA interference targeting their common receptor Gene Ther. 2007 14 960 971 10.1038/sj.gt.3302948 17377597 PMC7091640 216. Yao H. Zhang Y. He F. Wang C. Xiao Z. Zou J. Wang F. Liu Z. Short hairpin RNA targeting 2B gene of coxsackievirus B3 exhibits potential antiviral effects both in vitro and in vivo BMC Infect. Dis. 2012 12 177 10.1186/1471-2334-12-177 22863145 PMC3482581 217. Dutkiewicz M. Grunert H.P. Zeichhardt H. Lena S.W. Wengel J. Kurreck J. Design of LNA-modified siRNAs against the highly structured 5’ UTR of coxsackievirus B3 FEBS Lett. 2008 582 3061 3066 10.1016/j.febslet.2008.07.051 18691577 218. Rothe D. Werk D. Dutkiewicz M. Schubert S. Grunert H.P. Zeichhardt H. Erdmann V.A. Fechner H. Kurreck J. Inhibition of picornaviruses by means of RNA interference Nucleic Acids Symp. Ser. 2008 52 63 64 10.1093/nass/nrn032 18776254 219. Fechner H. Sipo I. Westermann D. Pinkert S. Wang X. Suckau L. Kurreck J. Zeichhardt H. Müller O. Vetter R. Cardiac-targeted RNA interference mediated by an AAV9 vector improves cardiac function in coxsackievirus B3 cardiomyopathy J. Mol. Med. 2008 86 987 997 10.1007/s00109-008-0363-x 18548221 220. Stein E.A. Pinkert S. Becher P.M. Geisler A. Zeichhardt H. Klopfleisch R. Poller W. Tschöpe C. Lassner D. Fechner H. Combination of RNA interference and virus receptor trap exerts additive antiviral activity in coxsackievirus B3-induced myocarditis in mice J. Infect. Dis. 2015 211 613 622 10.1093/infdis/jiu504 25193982 221. Luan Y. Dai H.L. Yang D. Zhu L. Gao T.L. Shao H.J. Peng X. Jin Z.F. Small interfering RNA against the 2C genomic region of coxsackievirus B3 exerts potential antiviral effects in permissive HeLa cells Virus Res. 2012 163 183 189 10.1016/j.virusres.2011.09.016 21945637 222. Nygårdas M. Vuorinen T. Aalto A.P. Bamford D.H. Hukkanen V. Inhibition of coxsackievirus B3 and related enteroviruses by antiviral short interfering RNA pools produced using phi6 RNA-dependent RNA polymerase J. Gen. Virol. 2009 90 2468 2473 10.1099/vir.0.011338-0 19553393 223. Werk D. Pinkert S. Heim A. Zeichhardt H. Grunert H.P. Poller W. Erdmann V.A. Fechner H. Kurreck J. Combination of soluble coxsackievirus-adenovirus receptor and anti-coxsackievirus siRNAs exerts synergistic antiviral activity against coxsackievirus B3 Antivir. Res. 2009 83 298 306 10.1016/j.antiviral.2009.07.002 19591879 224. Tan E.L. Wong A.P. Poh C.L. Development of potential antiviral strategy against coxsackievirus B4 Virus Res. 2010 150 85 92 10.1016/j.virusres.2010.02.017 20214933 225. Rothe D. Werk D. Niedrig S. Horbelt D. Grunert H.P. Zeichhardt H. Erdmann V.A. Kurreck J. Antiviral activity of highly potent siRNAs against echovirus 30 and its receptor J. Virol. Methods 2009 157 211 218 10.1016/j.jviromet.2009.01.012 19187792 226. Rothe D. Wajant G. Grunert H.P. Zeichhardt H. Fechner H. Kurreck J. Rapid construction of adeno-associated virus vectors expressing multiple short hairpin RNAs with high antiviral activity against echovirus 30 Oligonucleotides 2010 20 191 198 10.1089/oli.2010.0236 20649454 227. Tan E.L. Tan T.M. Tak Kwong Chow V. Poh C.L. Inhibition of enterovirus 71 in virus-infected mice by RNA interference Mol. Ther. 2007 15 1931 1938 10.1038/sj.mt.6300287 17712333 228. Tan E.L. Tan T.M. Chow V.T. Poh C.L. Enhanced potency and efficacy of 29-mer shRNAs in inhibition of Enterovirus 71 Antivir. Res. 2007 74 9 15 10.1016/j.antiviral.2007.01.004 17316836 229. Deng J.X. Nie X.J. Lei Y.F. Ma C.F. Xu D.L. Li B. Xu Z.K. Zhang G.C. The highly conserved 5′ untranslated region as an effective target towards the inhibition of Enterovirus 71 replication by unmodified and appropriate 2′-modified siRNAs J. Biomed. Sci. 2012 19 73 10.1186/1423-0127-19-73 22889374 PMC3438048 230. Liu H. Qin Y. Kong Z. Shao Q. Su Z. Wang S. Chen J. siRNA Targeting the 2Apro Genomic Region Prevents Enterovirus 71 Replication In Vitro PLoS ONE 2016 11 e0149470 10.1371/journal.pone.0149470 26886455 PMC4757562 231. Li Y. Xie J. Xu X. Wang J. Ao F. Wan Y. Zhu Y. MicroRNA-548 down-regulates host antiviral response via direct targeting of IFN-λ1 Protein Cell 2013 4 130 141 10.1007/s13238-012-2081-y 23150165 PMC4875363 232. Fang Y. Liu Z. Qiu Y. Kong J. Fu Y. Liu Y. Wang C. Quan J. Wang Q. Xu W. Inhibition of viral suppressor of RNAi proteins by designer peptides protects from enteroviral infection in vivo Immunity 2021 54 2231 2244.e2236 10.1016/j.immuni.2021.08.027 34555337 233. Tan E.L. Marcus K.F. Poh C.L. Development of RNA interference (RNAi) as potential antiviral strategy against enterovirus 70 J. Med. Virol. 2008 80 1025 1032 10.1002/jmv.21210 18428147 234. Jun E.J. Won M.A. Ahn J. Ko A. Moon H. Tchah H. Kim Y.K. Lee H. An antiviral small-interfering RNA simultaneously effective against the most prevalent enteroviruses causing acute hemorrhagic conjunctivitis Investig. Ophthalmol. Vis. Sci. 2011 52 58 63 10.1167/iovs.09-5051 20739472 235. Wu Z. Gao Y. Sun L. Tien P. Jin Q. Quick identification of effective small interfering RNAs that inhibit the replication of coxsackievirus A16 Antivir. Res. 2008 80 295 301 10.1016/j.antiviral.2008.06.017 18662724 236. Wang J.Y. Doudna J.A. CRISPR technology: A decade of genome editing is only the beginning Science 2023 379 eadd8643 10.1126/science.add8643 36656942 237. Pacesa M. Pelea O. Jinek M. Past, present, and future of CRISPR genome editing technologies Cell 2024 187 1076 1100 10.1016/j.cell.2024.01.042 38428389 238. Kaminski M.M. Abudayyeh O.O. Gootenberg J.S. Zhang F. Collins J.J. CRISPR-based diagnostics Nat. Biomed. Eng. 2021 5 643 656 10.1038/s41551-021-00760-7 34272525 239. Chavez M. Chen X. Finn P.B. Qi L.S. Advances in CRISPR therapeutics Nat. Rev. Nephrol. 2023 19 9 22 10.1038/s41581-022-00636-2 36280707 PMC9589773 240. Yang F. Aliyari S. Zhu Z. Zheng H. Cheng G. Zhang S. CRISPR-Cas: A game-changer in vaccine development and the fight against viral infections Trends Microbiol. 2025 33 650 664 10.1016/j.tim.2025.02.006 40069074 241. Wallis R.S. O’Garra A. Sher A. Wack A. Host-directed immunotherapy of viral and bacterial infections: Past, present and future Nat. Rev. Immunol. 2023 23 121 133 10.1038/s41577-022-00734-z 35672482 PMC9171745 242. Diep J. Ooi Y.S. Wilkinson A.W. Peters C.E. Foy E. Johnson J.R. Zengel J. Ding S. Weng K.F. Laufman O. Enterovirus pathogenesis requires the host methyltransferase SETD3 Nat. Microbiol. 2019 4 2523 2537 10.1038/s41564-019-0551-1 31527793 PMC6879830 243. Kim H.S. Lee K. Bae S. Park J. Lee C.K. Kim M. Kim E. Kim S. Kim C. Kim J.S. CRISPR/Cas9-mediated gene knockout screens and target identification via whole-genome sequencing uncover host genes required for picornavirus infection J. Biol. Chem. 2017 292 10664 10671 10.1074/jbc.M117.782425 28446605 PMC5481571 244. Mei H. Zha Z. Wang W. Xie Y. Huang Y. Li W. Wei D. Zhang X. Qu J. Liu J. Surfaceome CRISPR screen identifies OLFML3 as a rhinovirus-inducible IFN antagonist Genome Biol. 2021 22 297 34686207 10.1186/s13059-021-02513-w PMC8532573 245. Greninger A.L. Knudsen G.M. Betegon M. Burlingame A.L. Derisi J.L. The 3A protein from multiple picornaviruses utilizes the golgi adaptor protein ACBD3 to recruit PI4KIIIβ J. Virol. 2012 86 3605 3616 10.1128/JVI.06778-11 22258260 PMC3302542 246. Téoulé F. Brisac C. Pelletier I. Vidalain P.O. Jégouic S. Mirabelli C. Bessaud M. Combelas N. Autret A. Tangy F. The Golgi protein ACBD3, an interactor for poliovirus protein 3A, modulates poliovirus replication J. Virol. 2013 87 11031 11046 10.1128/JVI.00304-13 23926333 PMC3807280 247. Dorobantu C.M. van der Schaar H.M. Ford L.A. Strating J.R. Ulferts R. Fang Y. Belov G. van Kuppeveld F.J. Recruitment of PI4KIIIβ to coxsackievirus B3 replication organelles is independent of ACBD3, GBF1, and Arf1 J. Virol. 2014 88 2725 2736 10.1128/JVI.03650-13 24352456 PMC3958084 248. Dorobantu C.M. Ford-Siltz L.A. Sittig S.P. Lanke K.H. Belov G.A. van Kuppeveld F.J. van der Schaar H.M. GBF1- and ACBD3-independent recruitment of PI4KIIIβ to replication sites by rhinovirus 3A proteins J. Virol. 2015 89 1913 1918 10.1128/JVI.02830-14 25410869 PMC4300732 249. Najafi S. Tan S.C. Aghamiri S. Raee P. Ebrahimi Z. Jahromi Z.K. Rahmati Y. Sadri Nahand J. Piroozmand A. Jajarmi V. Therapeutic potentials of CRISPR-Cas genome editing technology in human viral infections Biomed. Pharmacother. 2022 148 112743 10.1016/j.biopha.2022.112743 35228065 PMC8872819 250. Bagchi R. Tinker-Kulberg R. Salehin M. Supakar T. Chamberlain S. Ligaba-Osena A. Josephs E.A. Polyvalent guide RNAs for CRISPR antivirals iScience 2022 25 105333 10.1016/j.isci.2022.105333 36325075 PMC9618770 251. Raguram A. Banskota S. Liu D.R. Therapeutic in vivo delivery of gene editing agents Cell 2022 185 2806 2827 10.1016/j.cell.2022.03.045 35798006 PMC9454337 252. Saito M. Xu P. Faure G. Maguire S. Kannan S. Altae-Tran H. Vo S. Desimone A. Macrae R.K. Zhang F. Fanzor is a eukaryotic programmable RNA-guided endonuclease Nature 2023 620 660 668 10.1038/s41586-023-06356-2 37380027 PMC10432273 253. Raghavan R. Friedrich M.J. King I. Chau-Duy-Tam Vo S. Strebinger D. Lash B. Kilian M. Platten M. Macrae R.K. Song Y. Rational engineering of minimally immunogenic nucleases for gene therapy Nat. Commun. 2025 16 105 10.1038/s41467-024-55522-1 39747875 PMC11696374 254. Keng C.T. Yogarajah T. Lee R.C.H. Muhammad I.B.H. Chia B.S. Vasandani S.R. Lim D.S. Guo K. Wong Y.H. Mok C.K. AAV-CRISPR-Cas13 eliminates human enterovirus and prevents death of infected mice EBioMedicine 2023 93 104682 10.1016/j.ebiom.2023.104682 37390772 PMC10363442 255. Albericio F. Kruger H.G. Therapeutic peptides Future Med. Chem. 2012 4 1527 1531 10.4155/fmc.12.94 22917241 256. Vilas Boas L.C.P. Campos M.L. Berlanda R.L.A. de Carvalho Neves N. Franco O.L. Antiviral peptides as promising therapeutic drugs Cell. Mol. Life Sci. 2019 76 3525 3542 10.1007/s00018-019-03138-w 31101936 PMC7079787 257. Xia S. Yan L. Xu W. Agrawal A.S. Algaissi A. Tseng C.K. Wang Q. Du L. Tan W. Wilson I.A. A pan-coronavirus fusion inhibitor targeting the HR1 domain of human coronavirus spike Sci. Adv. 2019 5 eaav4580 10.1126/sciadv.aav4580 30989115 PMC6457931 258. Lalani S. Gew L.T. Poh C.L. Antiviral peptides against Enterovirus A71 causing hand, foot and mouth disease Peptides 2021 136 170443 10.1016/j.peptides.2020.170443 33171280 PMC7648656 259. Clotet B. Raffi F. Cooper D. Delfraissy J.F. Lazzarin A. Moyle G. Rockstroh J. Soriano V. Schapiro J. Clinical management of treatment-experienced, HIV-infected patients with the fusion inhibitor enfuvirtide: Consensus recommendations AIDS 2004 18 1137 1146 10.1097/00002030-200405210-00007 15166529 260. Hancock R.E. Cationic antimicrobial peptides: Towards clinical applications Expert. Opin. Investig. Drugs 2000 9 1723 1729 10.1517/13543784.9.8.1723 11060771 261. Battles M.B. Langedijk J.P. Furmanova-Hollenstein P. Chaiwatpongsakorn S. Costello H.M. Kwanten L. Vranckx L. Vink P. Jaensch S. Jonckers T.H. Molecular mechanism of respiratory syncytial virus fusion inhibitors Nat. Chem. Biol. 2016 12 87 93 10.1038/nchembio.1982 26641933 PMC4731865 262. Roymans D. Alnajjar S.S. Battles M.B. Sitthicharoenchai P. Furmanova-Hollenstein P. Rigaux P. Berg J.V.D. Kwanten L. Ginderen M.V. Verheyen N. Therapeutic efficacy of a respiratory syncytial virus fusion inhibitor Nat. Commun. 2017 8 167 10.1038/s41467-017-00170-x 28761099 PMC5537225 263. Jordan R. Stray K. Anderson F. Perron M. Mackman R. Miller M. Mo H. Svarovskaia E. Martin R. Xin Y. Analysis of GS-5806 Resistance Emergence in Human Healthy Adult Subjects Experimentally Infected With Respiratory Syncytial Virus (RSV) Open Forum Infect. Dis. 2015 2 (Suppl. S1) 1189 10.1093/ofid/ofv133.901 264. Gaillard V. Galloux M. Garcin D. Eléouët J.F. Le Goffic R. Larcher T. Rameix-Welti M.A. Boukadiri A. Héritier J. Segura J.M. A Short Double-Stapled Peptide Inhibits Respiratory Syncytial Virus Entry and Spreading Antimicrob. Agents Chemother. 2017 61 e02241-16 10.1128/AAC.02241-16 28137809 PMC5365662 265. Sadeghipour S. Bek E.J. McMinn P.C. Ribavirin-resistant mutants of human enterovirus 71 express a high replication fidelity phenotype during growth in cell culture J. Virol. 2013 87 1759 1769 10.1128/JVI.02139-12 23175376 PMC3554166 266. Kelly J.T. De Colibus L. Elliott L. Fry E.E. Stuart D.I. Rowlands D.J. Stonehouse N.J. Potent antiviral agents fail to elicit genetically-stable resistance mutations in either enterovirus 71 or Coxsackievirus A16 Antivir. Res. 2015 124 77 82 10.1016/j.antiviral.2015.10.006 26522770 PMC4678291 267. Tan C.W. Chan Y.F. Sim K.M. Tan E.L. Poh C.L. Inhibition of enterovirus 71 (EV-71) infections by a novel antiviral peptide derived from EV-71 capsid protein VP1 PLoS ONE 2012 7 e34589 10.1371/journal.pone.0034589 22563456 PMC3341398 268. Lalani S. Masomian M. Poh C.L. Functional Insights into Silymarin as an Antiviral Agent against Enterovirus A71 (EV-A71) Int. J. Mol. Sci. 2021 22 8757 10.3390/ijms22168757 34445463 PMC8395941 269. Lalani S. Tan S.H. Tan K.O. Lim H.X. Ong K.C. Wong K.T. Poh C.L. Molecular mechanism of L-SP40 peptide and in vivo efficacy against EV-A71 in neonatal mice Life Sci. 2021 287 120097 10.1016/j.lfs.2021.120097 34715144 270. He Q.Q. Ren S. Xia Z.C. Cheng Z.K. Peng N.F. Zhu Y. Fibronectin Facilitates Enterovirus 71 Infection by Mediating Viral Entry J. Virol. 2018 92 e02251-17 10.1128/JVI.02251-17 29467312 PMC5899198 271. Abd-Aziz N. Lee M.F. Ong S.K. Poh C.L. Antiviral activity of SP81 peptide against Enterovirus A71 (EV-A71) Virology 2024 589 109941 10.1016/j.virol.2023.109941 37984152 272. Evans W.J. Hurst B.L. Peterson C.J. Van Wettere A.J. Day C.W. Smee D.F. Tarbet E.B. Development of a respiratory disease model for enterovirus D68 in 4-week-old mice for evaluation of antiviral therapies Antivir. Res. 2019 162 61 70 10.1016/j.antiviral.2018.11.012 30521834 PMC6997929 273. Patel M.C. Wang W. Pletneva L.M. Rajagopala S.V. Tan Y. Hartert T.V. Boukhvalova M.S. Vogel S.N. Das S.R. Blanco J.C. Enterovirus D-68 Infection, Prophylaxis, and Vaccination in a Novel Permissive Animal Model, the Cotton Rat (Sigmodon hispidus) PLoS ONE 2016 11 e0166336 10.1371/journal.pone.0166336 27814404 PMC5096705 274. Vermillion M.S. Dearing J. Zhang Y. Adney D.R. Scheuermann R.H. Pekosz A. Tarbet E.B. Animal Models of Enterovirus D68 Infection and Disease J. Virol. 2022 96 e0083322 10.1128/jvi.00833-22 35852353 PMC9364802 275. Zou Z. Liu J. Fu L. He Y. Cui G. Huang B. Animal models for enterovirus 71: Mechanisms, immunity, and applications Hum. Vaccin. Immunother. 2025 21 2523109 10.1080/21645515.2025.2523109 40554802 276. Weng S. Zhu R. Wu Y. Xia N. Xu L. Cheng T. Research progress and application prospects of animal models of group B Coxsackievirus infections Emerg. Microbes Infect. 2025 14 2441391 10.1080/22221751.2024.2441391 39665300 PMC11703136 277. Du S. Hu X. Menéndez-Arias L. Zhan P. Liu X. Target-based drug design strategies to overcome resistance to antiviral agents: Opportunities and challenges Drug Resist. Updates 2024 73 101053 10.1016/j.drup.2024.101053 38301487 Figure 1 Timeline of key anti-enteroviral compounds and their development (1990s–2020s). Compounds are categorized by target class, including capsid binders (VP1), protease inhibitors (3C), replication complex-targeting agents (3A, 2C, RdRp), and host-targeted or repurposed drugs. This timeline highlights the evolution of direct-acting and host-targeted antiviral strategies against EVs over the past three decades. The figure was created using Biorender.com. Figure 2 Chemical structures of capsid-binding inhibitors targeting the VP1 hydrophobic pocket of EVs. ( A B C Figure 3 Key investigated anti-enteroviral drug combinations. Major antiviral compounds are grouped in colored circles according to their target class: capsid inhibitors (pleconaril, vapendavir, pirodavir), protease inhibitors (rupintrivir), polymerase inhibitors (favipiravir), and host-targeted antivirals (gemcitabine, itraconazole). Lines indicate experimentally tested combinations that demonstrated additive or synergistic antiviral effects in vitro. This network highlights multi-target strategies aimed at enhancing efficacy, preventing resistance, and providing broad-spectrum coverage across enterovirus species. The figure was created using Biorender.com. Figure 4 Chemical structure of the 3C protease inhibitor Rupintrivir (AG7088). Rupintrivir is a peptidomimetic inhibitor that targets the viral 3C pro Figure 5 Chemical structure of the RdRp inhibitor Favipiravir (T-705). Favipiravir, an approved anti-influenza drug in Japan, has demonstrated in vitro activity against EVs (PubChem CID: 492405). Figure 6 Schematic representation of the EV life cycle highlighting viral and host targets of current antiviral strategies. Key stages of the EV life cycle are illustrated, including viral attachment (e.g., HSPGs), endocytosis and uncoating (e.g., cyclophilin A), viral replication and translation (e.g., PI4KB, OSBP, hNMT1, DHODH), and virion assembly and egress. The roles of structural proteins (e.g., VP1) and non-structural proteins (e.g., 2A, 2B, 2C, 3A, 3B, 3C, 3D) are shown alongside representative inhibitors targeting each component. This figure integrates both host-targeted and direct-acting antiviral approaches across the EV life cycle. The figure was created using Biorender.com. Figure 7 Antiviral mechanism of CRISPR-Cas13 against EVs. CRISPR-Cas13 targeted and cleaved viral RNA in the cytoplasm, disrupting replication and translation. This blocked the production of viral proteins and interfered with virion assembly and release. This approach offers a sequence-specific strategy to inhibit positive-sense RNA viruses such as EV-A71, CV-B3, and EV-D68 [ 237 viruses-17-01178-t001_Table 1 Table 1 Direct-acting antivirals against EVs. Target Site Representative Compounds EV Species Mechanism of Action Efficacy (In Vitro) Notable Insights References VP1 hydrophobic pocket Pleconaril, Vapendavir, PR66, BPROZ-101, NLD-22, VP1-6g EV-A71, CV-B3, Echoviruses, EV-D68 Capsid stabilization; blocked uncoating EC 50 50 High resistance risk (Taiwan EV-A71 strains), good breadth for EV-A71, poor for EV-D68 [ 10 31 42 43 44 46 47 48 49  Compound 36, 10 g CV-B3, CV-B4 Effective against pleconaril-resistant strains; orally bioavailable IC 50 Stable; protective in mice [ 55 56  Compound 19 (quinoline analog) EV-D68 Inhibited uncoating EC 50 Broad strain coverage; good pharmacokinetics profile [ 34 63 VP1-VP3 interprotomer binding pocket 4EDMAB, Compound 1, 17, 7a CV-B3, CV-B1/B4/B5/B6, CV-A9 Stabilized virion; blocked uncoating EC 50 Effective across EV-B and some EV-C/D; resistance mapping ongoing [ 9 64 65 Five-fold axis of the capsid MADL385, CB-30 EV-A71 Blocked receptor attachment EC 50 Resistance mutations (e.g., VP1-S184T); dendrimeric design [ 66 67  Rosmarinic acid, Suramin, E151 EV-A71, CV-A16, CV-A6 Entry inhibition; blocked receptor interaction EC 50 Suramin effective in animal models, but limited by non-specificity [ 32 37 68 69 70  NF110, NM16 (Suramin analogs) EV-A71 Blocked binding to sulfated receptors (e.g., PSGL-1) EC 50 50 Site-specific resistance (e.g., K244R) [ 69 viruses-17-01178-t002_Table 2 Table 2 Non-structural protein inhibitors against EVs. Target Protein Representative Compounds EV Species Mechanism of Action Notable Insights References 2A protease Z-LVLQTM-FMK, CW33, Telaprevir, Chlorogenic acid EV-A71, EV-D68 Inhibited viral polyprotein processing; blocked host translation/immune responses Limited potency; structure-based studies emerging [ 71 72 73 74 75 76 77 78 79 80 81 82 2B protein DIDS EV-A71 Blocked chloride ion channel; viroporin inhibition Unclear specificity; selective inhibitors needed [ 83 84 85 2C protein Fluoxetine, compound 12b, dibucaine, 6aw, JX040, R523062 EV-A71, EV-D68, CV-B3, Poliovirus Inhibited ATPase/oligomerization; disrupted replication/encapsidation Broad-spectrum potential; structural studies advancing [ 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 3A protein Enviroxime, AN-12-H5, itraconazole, TTP-8307 EV-A71, EV-D68, CV-B3 Disrupted replication organelle formation No confirmed direct binders; promising polypharmacology [ 105 106 107 108 109 110 111 112 113 114 115 116 117 161 3C protease Rupintrivir, AG7404, compound 18p, NK-1.9k EV-A71, EV-D68, CV-B3, Echoviruses Inhibited viral proteolytic processing; immune evasion Potent in vitro activity; resistance and delivery issues remained [ 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 162 3D polymerase Gemcitabine, LY2334737, FNC, GPC-N114, BPR-3P0128, DTriP-22 EV-A71, CV-B3, EV-D68, Poliovirus Chain termination; RdRp inhibition; blocked RNA elongation Broad-spectrum potential; nucleoside analogs in clinical use [ 147 148 149 150 151 152 154 156 157 158 159 160 viruses-17-01178-t003_Table 3 Table 3 Host-targeting antivirals against EVs. Host Target Representative Compounds/Strategies Mechanism of Action Antiviral Effects References OSBP (Oxysterol-binding protein) OSW-1, Itraconazole, TTP-8307, T-00127-HEV2 Disrupted cholesterol transport; impaired viral replication complex formation Potent EV-A71 inhibition; nanomolar EC 50 [ 166 167 168 169 170 PI4KB (Phosphatidylinositol 4-kinase IIIβ) MDL-860, Compound 10, PIK93, T-00127-HEV1 Inhibited PI4KB function and lipid kinase activity; blocked replication organelle formation Nanomolar activity against CV-B3 and EV-A71; MDL-860 analog showed 50% protection in neonatal mice [ 171 172 173 DHODH (Dihydroorotate dehydrogenase) RYL-634, FA-613 Inhibited pyrimidine biosynthesis; disrupted viral RNA synthesis RYL-634: EC 50 [ 174 175 176 177 Innate Immune Modulators (e.g., TLR7, IFN pathways) R837 (TLR7 agonist), IFN-α, GS-9620 Activated antiviral IFN responses; reduced viral replication/inflammation Improved survival in EV-A71 mouse models; synergistic with rupintrivir [ 178 179 180 Restriction Factors (e.g., SAMHD1, APOBEC3G) Endogenous upregulation or stabilization SAMHD1 blocked VP1–VP2 interaction; A3G disrupted 5′ UTR translation initiation. Inhibited EV-A71, CV-A16, and EV-D68 [ 181 182 183 184 Attachment Factors (e.g., HSPGs) HTA-22, heparin, lactoferrin Blocked viral attachment Inhibited EV-A71, CV-A16, and PV1 [ 185 186 187 188 hNMT1 (N-myristoyltransferase 1) siRNA knockdown, Compound 4O Prevented VP4 myristoylation; impaired capsid precursor processing. Inhibited EV-A71 replication [ 22 AP2M1 (Adaptor protein complex 2 subunit mu) ACA (N-(p-amylcinnamoyl)anthranilic acid) Disrupted 2C localization; inhibited YxxØ motif Inhibited EV-A71, influenza, Zika, and MERS-CoV. [ 189 mTOR signaling and autophagy Torin2, LY-55 Inhibited mTOR-mediated autophagy Inhibited EV-A71 replication with low IC 50 [ 190 191 TREM-1–NF-κB–MAPK axis LP17 peptide Suppressed virus-induced inflammatory cytokine signaling. Reduced IL-6, IL-8, TNF-α release in EV-D68-infected cells. [ 192 Cyclophilin A (CypA) Cyclosporine A, HL051001P2, CypA-11 Blocked VP1–CypA interaction, impaired uncoating. Exhibited submicromolar activity against EV-A71; synergistic with 3C pro [ 193 194 ",
  "metadata": {
    "Title of this paper": "Target-based drug design strategies to overcome resistance to antiviral agents: Opportunities and challenges",
    "Journal it was published in:": "Viruses",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474030/"
  }
}