{
  "title": "Paper_1106",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468553 PMC12468553.1 12468553 12468553 41008919 10.3390/cancers17183077 cancers-17-03077 1 Article Clinical and Molecular Characteristics of 100 Atypical Teratoid Rhabdoid Tumor Patients from Low- and Middle-Income Countries https://orcid.org/0009-0001-0529-0479 Ismail Noha A. 1 † Aboubakr Shaimaa 1 † Mosaab Amal 2 https://orcid.org/0000-0001-5428-1555 Maher Eslam Conceptualization Software Formal analysis Writing – original draft Writing – review & editing 3 4 https://orcid.org/0000-0003-1093-933X Hafez Hanafy 1 5 Taha Hala Validation Investigation Resources Data curation 6 7 Yassin Dina Investigation Resources Data curation 8 Refaat Amal Validation Investigation Resources Data curation 9 10 Zaghloul Mohamed S. Investigation Resources Data curation 11 12 El-Beltagy Mohamed 13 14 Enayat Abdelrahman Investigation Resources Data curation 13 14 Hovestadt Volker Validation Investigation Data curation Visualization 15 16 Ahmed Olfat Validation Investigation Data curation Writing – review & editing 17 18 https://orcid.org/0000-0003-2184-7692 Kieran Mark W. 1 El-Hemaly Ahmed 1 5 * https://orcid.org/0000-0001-6465-9881 EI-Naggar Shahenda 2 * El-Haddad Alaa Conceptualization Methodology Writing – review & editing Supervision 1 5 Ginard Miguel Segura Academic Editor 1 noha.ismail@57357.org shimaa.abobakr@57357.org hhafez75@cu.edu.eg mark.kieran@dayonebio.com alaa.hadad@57357.org 2 amal.abdelaziz@57357.org 3 e.maher@imperial.ac.uk 4 5 6 hala.taha@57357.org 7 8 dina.yassin@57357.org 9 amal.mohamed@57357.org 10 11 mohamed.zaghloul@57357.org 12 13 mohamed.elbeltagy@kasralainy.edu.eg abdelrahman.enayat@57357.org 14 15 volker_hovestadt@dfci.harvard.edu 16 17 olfat.ahmed@kitz-heidelberg.de 18 * ahmed.ibrahiem@57357.org shahenda.elnaggar@57357.org † These authors contributed equally to this work. 20 9 2025 9 2025 17 18 497140 3077 09 8 2025 15 9 2025 16 9 2025 20 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary This retrospective cohort study analyzed 100 pediatric patients with atypical teratoid rhabdoid tumors (ATRTs) treated at Children’s Cancer Hospital, Egypt, between 2008 and 2022. Patients were managed with the Dana-Farber Cancer Institute modified IRS-III protocol, and molecular subgrouping was performed retrospectively. Event-free survival and overall survival at 5 years were 12% and 13%, with infants (<1 year) and patients with metastatic disease experiencing the poorest outcomes. The extent of resection correlated with survival, while molecular subgroups (MYC, SHH, TYR) showed no significant prognostic impact. Treatment-related mortality was notably high (28%), predominantly from Gram-negative septicemia. These findings suggest that while ATRT remains a highly aggressive malignancy with poor outcomes in low- and middle-income countries, modifying intensive and prolonged chemotherapy regimens toward shorter, more intensified approaches may improve both survival and treatment tolerability in this vulnerable population. Abstract Background: Atypical teratoid rhabdoid tumor (ATRT) is a highly aggressive, rare pediatric central nervous system malignancy. Prognostic factors for optimizing risk stratification and management in a large uniformly treated cohort are lacking. Methods: We conducted a single-center retrospective cohort study analyzing clinical and outcome data for 100 newly diagnosed ATRT patients aged <18 years treated at the Children’s Cancer Hospital, Egypt, from 2008 to 2022. They were treated uniformly as per the Dana-Farber Cancer Institute modified IRS-III protocol. Molecular subgroups (MYC, SHH, and TYR) were determined via a DNA methylation array for patients who had sufficient DNA material available for the methylation analysis. Treatment toxicities were graded per the Common Terminology Criteria for Adverse Events (CTCAE) v5.0. Results: The median age at diagnosis was 1.88 years (IQR 0.99, 3.01); 28% were under 1 year of age, 45% were between 1 and 3 years old, and 26% were above 3 years of age. At diagnosis, 39% of patients had metastatic disease. A total of 60% of patients had gross residual disease following surgical excision. In multivariable analysis, age < 1 year and metastatic disease had a significant impact on event-free survival (EFS) ( p p p p ATRT molecular prognostic low-middle income outcome This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Background Atypical teratoid/rhabdoid tumors (ATRTs) are aggressive malignancies of the central nervous system (CNS), predominantly affecting children aged three years or younger [ 1 2 3 4 The hallmark genetic alteration in ATRT is the bi-allelic inactivation of the SMARCB1 SMARCA4 3 5 4 6 SMARCB1 SMARCA4 7 Molecular heterogeneity has been well-characterized in ATRT. Based on DNA methylation profiling, three distinct molecular subgroups have been identified: ATRT-SHH, ATRT-TYR, and ATRT-MYC [ 8 8 Despite advances in aggressive multimodal therapy, including surgery, chemotherapy, and radiotherapy, survival outcomes for ATRT remain variable, with reported 5-year overall survival (OS) rates ranging from 15% to 70% across different cohorts [ 1 9 Several prognostic factors have been proposed, including young age at diagnosis, metastatic disease, incomplete surgical resection, high-dose chemo/radiotherapy, and germline SMARCB1 SMARCA4 1 10 The Dana-Farber modified IRS-III protocol, which incorporates surgery, systemic and intrathecal chemotherapy, and radiotherapy, has shown promising survival improvements in patients with ATRT [ 10 A prior study by El-Hemaly et al. [ 11 10 This study aimed to evaluate the prognostic impact of various clinical and molecular factors, including age, tumor location, metastatic status, extent of resection, early treatment response, germline mutation status, and molecular subgroup, on ATRT outcomes. 2. Patients and Methods A single-center retrospective cohort study was conducted analyzing 100 ATRT patients diagnosed by histopathology (morphology and immunohistochemistry loss of SMARCB1 gene product integrase interactor 1 (INI1) protein) and aged <18 years treated at the Children’s Cancer Hospital, Egypt, 57357, from 2007 to 2022. Maximal safe resection was attempted at presentation, and second-look surgery was supposed to be performed after induction chemotherapy for patients with residual disease. According to the neurosurgeon’s assessment, none of those patients underwent second-look surgery, as it is a risky procedure. The extent of surgical resection was defined as gross total resection (GTR), near-total resection (NTR) (>90% of tumor excised), subtotal resection (STR) (<90% of tumor excised), or biopsy based on postoperative magnetic resonance imaging (MRI) and the surgeon’s intraoperative assessment [ 12 The Dana-Farber Cancer Institute modified IRS-III chemotherapy protocol was implemented for the whole cohort. The induction phase consisted of 6 weeks of chemotherapy. The consolidation phase consisted of chemo-radiotherapy from week 7 to 18 and the maintenance phase from week 19 to the end of the protocol, with an interval of 3 weeks between each cycle of chemotherapy. See Figure S1 Response to chemotherapy was assessed after 6 weeks of treatment. It was classified as complete response (CR), partial response (PR), stable disease (SD), or progressive disease (PD) [ 10 Radiotherapy was given at week 7 of induction chemotherapy as conformal radiation for patients with non-metastatic disease (M0). Those with metastatic disease (M+) and aged <3 years old received a tumor-directed dose of 54 Gy. Patients with M+ disease who were older than 3 years of age received craniospinal irradiation (CSI) at a dose of 36 Gy with a 54 Gy boost to the tumor bed. Grade 3 and higher therapy-related toxicities were collected according to the common terminology criteria for adverse events (CTCAE) Version 5.0 [ 13 2.1. Multiplex Ligation-Dependent Probe Amplification (MLPA) Twenty-eight blood samples were obtained for the germline testing of the SMARCB1 gene either from the blood biorepository bank or directly from patients after consenting. DNA was isolated using the Gentra Pure Gene kit ( Sigma-Aldrich, St. Louis, MO, USA) and tested for the deletion or duplication of the SMARCB1 gene using SALSA MLPA probemix P25B SMARCB1 (Marc Holland, Amestrdam, Netherland). 2.2. Genome-Wide DNA Methylation Profiling Genomic DNA extraction from the FFPE samples was performed as previously described [ 14 2.3. Methylation Analysis Methylation analysis was performed using the minfi Bioconductor package v. 1.29.3. Raw signal intensities were obtained from Illumina intensity data (IDAT) files. Samples were normalized using Noob. Beta values were obtained using single-sample Noob normalization (preprocessNoob). Probe filtration included probes located on sex chromosomes and probes containing SNPs (n = 24,747) in their bodies or at a CpG, with a minor allele frequency (maf) > 0.05. Unsupervised hierarchical clustering was performed using the cor function and hclust for clustering analysis, with the average distance as the clustering metric. Methylation-based tumor classification was performed using the Heidelberg classifier (v12.8), based on the recently published random forest classification algorithm [ 15 16 2.4. Statistical Methods Overall survival (OS) was defined as the time from presentation to death from any cause or the last contact. In contrast, event-free survival (EFS) was defined from presentation to the date of relapse, progression, or death from any cause (i.e., any event). Survival probabilities were computed with the Kaplan–Meier estimator alongside a 95% confidence interval (CI) using the log method. OS and EFS were modeled using Cox regression. Acknowledging that a considerable number of deaths were not disease-related (toxic deaths), we accounted for this competing risk to delineate the hazards of relapse and related mortality from non-relapse mortality (NRM). For this, an analysis of the cumulative incidence function (CIF) and fitted sub-distribution hazards with a Fine–Gray regression for the event of interest (Relapse) was used. No missing data imputation was performed, and missing baseline M-stage values were included as parameters in our models (Mx). A sensitivity analysis was conducted through complete case analysis in multivariable models by omitting Mx cases. Another sensitivity analysis regarding the handling of competing risks used the cause-specific Cox model approach by censoring NRM, defined as progression-free survival (PFS). Neither sensitivity analysis changed the results. R version 4.4.2 was used, with packages ‘survival’ v3.7-0, ‘cmprsk’ v.2.2-12, and ‘tidycmprsk’ v1.1.0. 3. Results 3.1. Patient Characteristics This study involved 100 ATRT patients with a median age of 1.88 years (IQR 0.99–3.01). Among them, 28 patients were under 1 year of age, 46 patients were between 1 and 3 years, and 26 patients were older than 3 years, with a male-to-female ratio of 1.4:1. A total of 41 patients had supra-tentorial tumors, 55 had infra-tentorial primary tumors, and 4 patients had spinal ATRT. Thirty-nine patients presented with metastatic disease. A total of 40 patients underwent GTR/NTR, 29 patients had STR, and 31 patients underwent biopsy. None of the 24 patients with residual disease at week 6 of chemotherapy underwent second-look surgery. See Table 1 For the germline mutation of the SMARCB1 gene, blood samples were available for 28 patients; 9 samples were excluded due to poor DNA quality. A total of three patients were positive for mutation (one with a deletion at exon 4, one with a duplication at exon 9, and one with a duplication at exon 1). In comparison, 16 patients did not have any germline mutation. Tumor DNA methylation profiling was performed for 69 patients with a histologically confirmed diagnosis of ATRT (based on SMARCB1 loss by immunohistochemistry). Using the MNP classifier (version 12.5), 64 cases were classified as ATRT, distributed into the known molecular subtypes: 34 as ATRT-SHH, 17 as ATRT-MYC, and 13 as ATRT-TYR. See Table S2 Figure 1 Figure 2 3.2. Chemotherapy The median time to start chemotherapy post-surgical excision was 26 days (range 4–120 days). Twelve patients did not receive chemotherapy; one patient died secondary to a shunt infection with a Gram-negative multidrug-resistant organism, and eleven patients died secondary to advanced disease or progression within 30 days from surgery before chemotherapy commencement. Only 21 patients completed the full protocol treatment. In total, 20 patients died secondary to sepsis, while 37 patients died secondary to disease progression, as shown in Figure 3 3.3. Response to Induction Treatment A total of 61 patients were evaluable after 6 weeks of induction chemotherapy, 30 patients were in CR, 16 patients had PR, 8 patients showed SD, and 7 patients had PD. 3.4. Radiotherapy The median time to radiotherapy initiation was 116 days (range 79–233 days) from the start of chemotherapy. Radiotherapy was delivered to 43 patients. A total of 7 patients received CSI with a boost to the tumor bed, and 36 patients received focal radiation therapy (32 M0, 4 M+). Fifty-seven patients were unable to receive RTH. A total of 20 patients died of sepsis, and 37 patients died of progressive disease before RTH was to be delivered. See Figure 3 3.5. Toxicity and Treatment Complications Grade 3 hematological toxicities were more evident during the induction phase; 76 patients had grade 3 anemia, and 57 patients developed grade 3 fever and neutropenia. Grade 5 fever and neutropenia were reported in 13 patients during induction, 1 patient during consolidation, and 2 patients during the maintenance phase. Grade 3 and 4 metabolic toxicities (hypokalemia, hyponatremia, hypomagnesemia, and hypocalcemia) were common. They included grade 4 hypokalemia in 61 patients during the induction phase, 12 patients during the consolidation phase, and 8 patients during the maintenance phase. Regarding the gastrointestinal side effects, 12 patients developed grade 3 oral mucositis, and 7 patients had grade 3 diarrhea. Grade 5 diarrhea was reported in one patient who died from shock during the induction phase. Grade 3 third nerve palsy due to vincristine toxicity was reported in four patients during the induction phase and in one patient during maintenance. No other cranial nerve palsies were reported. See Table S1 3.6. Methylation Groups Patients with a TYR signature were significantly younger than those with ATRT-MYC and ATRT-SHH, with median ages of 0.97 years (IQR 0.58–1.36), 2.44 years (IQR 1.53–3.00), and 1.91 years (IQR 1.05–2.96), respectively. ATRT-TYR was exclusively presented in the infra-tentorial region, whereas ATRT-SHH was exhibited in both supra-tentorial and infra-tentorial locations in 44% and 56% of the cohort, respectively. MYC-ATRT had a supra-tentorial location (53%) and an infra-tentorial location (24%). All patients with spinal involvement had the ATRT-MYC epigenetic group. Metastatic disease was documented in 6, 13, and 3 patients within the MYC, SHH, and TYR groups, respectively. Gross total resection was achieved in 5, 20, and 6 patients within the MYC-ATRT, SHH-ATRT, and TYR-ATRT groups, respectively. Regarding the response at week 6 of induction chemotherapy, CR, PR, and PD were reported in six, five, and one patient within the MYC group, respectively. The SHH ATRT group had 15 patients with CR, 3 with PR, and 3 with PD. Finally, within the TYR group, four patients had complete remission, and two showed partial remission with no documented progressive disease. See Table S2 3.7. Survival Analysis Age had a significant impact on survival, as patients < 1 year of age had the worst 5-year EFS and OS of 0%; patients aged 1–3 years had a 5-year EFS and OS of 13% and 15%, respectively ( p p p p p p The primary tumor site had a borderline impact on survival, with 5-year EFS and OS rates of 20% and 6.8% for supra-tentorial and infra-tentorial locations, respectively ( p p p Patients with metastatic disease had a 5-year EFS and OS of 0% compared to the non-metastatic disease group with an EFS and OS of 23% and 25% ( p p Figure S2 Patients with residual disease had a worse 5-year EFS and OS of 6% for both compared to patients with GTR with a 5-year EFS and OS of 20% and 22%, respectively ( p p p Figure S2 There was no significant survival difference between the three molecular groups. The 5-year EFS was 18%, 12%, and 7% for MYC, SHH, and TYR, respectively, with p p p In multivariable analysis, age and metastatic disease had a significant impact on EFS ( p p p p Table 2 Table 3 Table 4 3.8. Pattern of Relapse/Progression Out of 61 patients who showed progression or relapse, local failure was documented in 13, distant failure in 18, and combined distant and local failure in 30. Of the 32 patients with M0 disease who received focal radiation therapy, 16 relapsed. Among these, 12 patients (75%) experienced distant relapse, 2 patients (12.5%) had local failure, and 2 patients (12.5%) had both local and distant relapse. Nine of the sixteen relapsed patients were ATRT-SHH-type: six had distant relapse, two had local relapse, and one had both local and distant relapse. Two patients were ATRT-TYR-type, and two were ATRT-MYC-type; all of them had distant relapse. Four patients who had metastatic disease and were younger than 3 years received focal radiation therapy; all of them experienced relapse. Two patients had distant and local relapse, one patient had distant relapse, and one patient had local relapse. The median follow-up duration was 5.2 years (IQR: 4.5 to 8) for the entire cohort. 3.9. The Outcome of the Whole Cohort The 5-year EFS and OS were 12% and 13%, respectively ( Figure 4 Figure 5 3.10. Causes of Death A total of 89 patients died; of these, 61 deaths were due to progressive diseases or relapse, and 28 were from non-disease-related causes. Twenty-five patients died of septic shock. Thirteen of them had bloodstream infection: seven had Klebsiella pneumoniae (two patients had extremely drug-resistant infection, and one patient had multidrug-resistant infection), two patients had Escherichia coli, two patients had Stenotrophomonas maltophilia, and two patients had Candida albicans. See Table S3 Other non-disease-related mortality causes of death included secondary acute myeloid leukemia (AML), as seen in one patient; one case of extensive CNS thrombosis; and one case of chemotherapy-induced hyponatremia. 4. Discussion In this study, we analyzed 100 ATRT patients using different prognostic factors, including age, primary site, metastatic status, extent of surgical resection, and molecular subgroups, and correlated these factors with survival. Sixty-nine patients were tested for molecular subtype using DNA methylation analysis. Age had a significant impact on the outcome, as patients with an age <1 year had worse EFS and OS compared to older patients (1 to <3 years and >3 years), as none of the patients <1 year were alive at 5 years. These findings are consistent with data from the European Rhabdoid Registry (EU-RHAB), which reported a 5-year OS of 16.7 ± 5.7% for patients <1 year of age and 45.3 ± 6% for patients > 1 year of age [ 17 18 In this study, metastatic disease had a negative impact on the EFS, OS, and risk of relapse, matching with the results of Frühwald et al., who reported that metastatic disease was a negative prognostic factor with a 5-year OS of 16.9% for M+ patients vs. 43% for M0 patients ( p 17 Upadhyaya et al. showed that infants and children with M0 disease had a 5-year progression-free survival (PFS) and OS of 31.4% and 43.9% for infants and 72.7% and 81.8% for children, respectively. In contrast, the 5-year OS for infants and children with M+ disease was 0% and 25%, respectively ( p 3 On the contrary, the ACNS0333 study reported that metastatic disease did not show a significant impact on OS ( p 18 In our cohort treated according to the Dana-Farber Cancer Institute modified IRS-III protocol, four patients with metastatic disease who were younger than 3 years received focal radiation therapy. All of them experienced relapse; two had both distant and local relapse, one had distant relapse, and one had local relapse. However, based on small numbers, the current approach for infants with metastatic disease (focal radiation therapy) appears insufficient for this high-risk group, and additional treatment modalities are needed. Interesting data from the COG ACNS0333 trial, which replaced full-dose craniospinal radiation therapy with intensified induction followed by tandem transplant and lower-dose CSI (23.4 Gy), may improve the outcome for this subset of patients [ 18 3 Our data showed that patients with postoperative residual disease had inferior EFS and OS with an increased risk of relapse, which is consistent with the original report from Chi et al., who reported that the extent of resection had a significant impact on both PFS and OS ( p p 10 19 Desai et al. reported on a retrospective analysis of 60 patients with ATRT from different centers, including Dana Farber data. They found that neither patient age, extent of resection, nor metastatic status had a significant impact on survival [ 19 Our experience with the molecular classification of the ATRT tissue samples highlights a critical issue associated with the evolving nature of classifier versions and their impact on diagnostic consistency. However, changes are primarily seen in samples reporting low scores, which by definition are not reliable. We observed a shift from ATRT to PB despite a confident score in the 12.5 version. Such discrepancies can present a challenge for longitudinal studies, where maintaining a consistent cohort definition is essential for unbiased clinical correlation. Hence, our findings support a diagnostic approach that does not rely solely on a single classifier score. Instead, integrating methylation profiling with supporting molecular and pathological data is essential, particularly for samples with low calibrated scores or ambiguous classification. In our cohort, patients with a TYR signature were significantly younger than those with ATRT-MYC and ATRT-SHH, with a median age of 0.97 years, 2.44 years, and 1.91 years, respectively. ATRT-TYR is exclusively presented in the infra-tentorial region, whereas ATRT-SHH and MYC were exhibited in both supra-tentorial and infra-tentorial locations. All patients with spinal involvement were classified as ATRT-MYC. These findings were consistent with Ho et al., where the ATRT-TYR subgroup predominantly occurred in younger patients, with a median age of diagnosis of 12 months. In contrast, ATRT-MYC tumors were more commonly found in older children, with a median age of 27 months. Most ATRT-TYR tumors were infra-tentorial, while ATRT-SHH and ATRT-MYC predominantly arose in the supra-tentorial region. Notably, all spinal ATRTs were within the ATRT-MYC subgroup [ 8 We attempted to correlate molecular subgroups with outcome, as there is no clear consensus in the literature regarding the prognostic impact of epigenetic subgroups. The three molecular subgroups had no impact on survival or the cumulative incidence of relapse. For the MYC, SHH, and TYR subgroups, the 5-year EFS was 18%, 12%, and 7.7%, respectively; the 5-year OS was 18%, 15%, and 0%; and the 5-year cumulative incidence for relapse was 53%, 68%, and 46%, respectively. Similarly to these findings, the ACNS 0333 trial did not report a significant impact of molecular subgroup on survival, where the 4-year OS for the SHH, TYR, and MYC subgroups was 56%, 41%, and 27%, respectively, and the trial attributed the lack of difference to the small sample sizes of each group [ 18 In the EU-RHAB registry, high-risk patients (non-TYR subgroup and age under 1 year) had a 5-year OS of 0% compared to 71% for patients with standard risk (ATRT-TYR disease and age >1 years) and 32% for intermediate-risk patients (<1 y + TYR or ≥ one y + non-TYR) ( p 17 Based on these different data sets, including ours, there is still no clear consensus on the prognostic impact of epigenetic subgrouping, which needs more collaborative work with a larger number of patients. The tyrosine kinase inhibitors (TKIs) dasatinib and nilotinib displayed selective toxicity to ATRT-MYC cell lines, and dasatinib significantly improved survival in an intracranial orthotopic xenograft model. The EZH2 inhibitor tazemetostat has been tested in relapsed or refractory SMARCB1-deficient tumors, and a preliminary report suggested that a direct toxic effect on the SHH cell line may be helpful in this particular subtype [ 20 The 5-year EFS and OS for our entire cohort were 12% and 13%, respectively. Desai et al. reported on the updated survival of the ATRT cohort using the Dana Farber protocol, where the 5-year PFS and OS were 30% and 38%, respectively [ 19 Our cohort had a high rate of non-relapse mortality (n = 28) with a high rate of infection-related mortality (n = 25). At the same time, Chi et al. reported one death due to sepsis with pneumococcal infection [ 10 5. Conclusions Molecular subgrouping by DNA methylation did not confer survival differences, underscoring the need for larger collaborative studies to clarify its prognostic role. The high rate of treatment-related mortality, predominantly infection-related, highlights the challenges of applying lengthy, dose-intensive regimens in resource-limited settings. These findings support the need for treatment adaptation in such contexts, favoring shorter, risk-adapted, and intensified strategies such as the COG 0333 approach with short intensified induction followed by consolidation with high-dose chemotherapy (HDCT), and risk-adapted radiation therapy may be more suitable in our setup, combined with robust supportive care to balance efficacy with safety. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/cancers17183077/s1 Author Contributions Conceptualization: N.A.I., S.A., A.M., E.M., H.H., M.W.K., A.E.-H. (Ahmed El-Hemaly), S.E.-N., and A.E.-H. (Alaa El-Haddad); methodology, N.A.I., S.A., E.M., H.H., M.W.K., A.E.-H. (Ahmed El-Hemaly), S.E.-N., and A.E.-H. (Alaa El-Haddad); validation, N.A.I. and S.A.; formal analysis, E.M., V.H., O.A., and S.E.-N.; investigation, N.A.I., S.A., A.M., H.T., D.Y., A.R., M.S.Z., M.E.-B., and A.E.; writing—original draft preparation, N.A.I. and S.A.; writing—review and editing, N.A.I., S.A., A.M., E.M., H.H., H.T., D.Y., A.R., M.S.Z., M.E.-B., A.E., M.W.K., A.E.-H. (Ahmed El-Hemaly), S.E.-N., and A.E.-H. (Alaa El-Haddad); visualization, N.A.I. and S.A.; supervision, H.H., M.W.K., A.E.-H. (Ahmed El-Hemaly), S.E.-N., and A.E.-H. (Alaa El-Haddad); project administration, N.A.I. and S.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Institutional Review Board of Children’s Cancer Hospital, Egypt 57357, Date of approval 11 November 2019, Study code 63/2019. Informed Consent Statement Written informed consent was obtained from the patients. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors on request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Price M. Ballard C. Benedetti J. Neff C. Cioffi G. Waite K.A. Kruchko C. Barnholtz-Sloan J.S. Ostrom Q.T. CBTRUS Statistical Report: Primary brain and other central nervous system tumors diagnosed in the United States in 2017–2021 Neuro Oncol. 2024 26 (Suppl. S1) vi1 vi85 10.1093/neuonc/noae145 39371035 PMC11456825 2. Wang Z. Yang J. Liu X. Liu W. Clinical characteristics of patients with atypical teratoid/rhabdoid tumors: A monocentric retrospective analysis Front. Pediatr. 2025 13 1463510 10.3389/fped.2025.1463510 40115317 PMC11922728 3. Upadhyaya S.A. Robinson G.W. Onar-Thomas A. Orr B.A. Johann P. Wu G. Billups C.A. Tatevossian R.G. Dhanda S.K. Srinivasan A. Relevance of molecular groups in children with newly diagnosed atypical teratoid rhabdoid tumor: Results from prospective St. Jude multi-institutional trials Clin. Cancer Res. 2021 27 2879 2889 10.1158/1078-0432.CCR-20-4731 33737307 PMC8127412 4. Rechberger J.S. Nesvick C.L. Daniels D.J. Atypical teratoid rhabdoid tumor (ATRT): Disease mechanisms and potential drug targets Expert Opin. Ther. Targets 2022 26 187 192 10.1080/14728222.2022.2040017 35142587 PMC11641519 5. Hasselblatt M. Gesk S. Oyen F. Rossi S. Viscardi E. Giangaspero F. Giannini C. Judkins A.R. Frühwald M.C. Obser T. Nonsense mutation and inactivation of SMARCA4 (BRG1) in an atypical teratoid/rhabdoid tumor showing retained SMARCB1 (INI1) expression Am. J. Surg. Pathol. 2011 35 933 935 10.1097/PAS.0b013e3182196a39 21566516 6. Kieran M.W. Roberts C.W. Chi S.N. Ligon K.L. Rich B.E. Macconaill L.E. Garraway L.A. Biegel J.A. Absence of oncogenic canonical pathway mutations in aggressive pediatric rhabdoid tumors Pediatr. Blood Cancer 2012 59 1155 1157 10.1002/pbc.24315 22997201 PMC3538080 7. Bourdeaut F. Lequin D. Brugières L. Reynaud S. Dufour C. Doz F. André N. Stephan J.L. Pérel Y. Oberlin O. Frequent hSNF5/INI1 germline mutations in patients with rhabdoid tumor Clin. Cancer Res. 2011 17 31 38 10.1158/1078-0432.CCR-10-1795 21208904 8. Ho B. Johann P.D. Grabovska Y. De Dieu Andrianteranagna M.J. Yao F. Frühwald M. Hasselblatt M. Bourdeaut F. Williamson D. Huang A. Molecular subgrouping of atypical teratoid/rhabdoid tumors—A reinvestigation and current consensus Neuro Oncol. 2020 22 613 624 10.1093/neuonc/noz235 31889194 PMC7229260 9. Torchia J. Golbourn B. Feng S. Ho K.C. Sin-Chan P. Vasiljevic A. Norman J.D. Guilhamon P. Garzia L. Agamez N.R. Integrated (epi)-genomic analyses identify subgroup-specific therapeutic targets in CNS rhabdoid tumors Cancer Cell 2016 30 891 908 10.1016/j.ccell.2016.11.003 27960086 PMC5500911 10. Chi S.N. Zimmerman M.A. Yao X. Cohen K.J. Burger P. Biegel J.A. Rorke-Adams L.B. Fisher M.J. Janss A. Mazewski C. Intensive multimodality treatment for children with newly diagnosed CNS atypical teratoid rhabdoid tumor J. Clin. Oncol. 2009 27 385 389 10.1200/JCO.2008.18.7724 19064966 PMC2645855 11. El-Hemaly A. Samir M. Taha H. Refaat A. Maher E. El-Beltagy M. Zaghloul M.S. El-Haddad A. Atypical teratoid rhabdoid tumor in a lower-middle-income country: Challenges to cure Oncol. Lett. 2024 27 129 10.3892/ol.2024.14263 38348388 PMC10859823 12. Caro-Osorio E. Perez-Ruano L. Figueroa Sanchez J. Concordance of extent of resection between intraoperative ultrasound and postoperative MRI in brain and spine tumor resection Cureus 2024 16 e74101 10.7759/cureus.74101 39712672 PMC11661696 13. National Cancer Institute Standard Terminology Criteria for Adverse Events (CTCAE) Version 5.0 U.S. Department of Health and Human Services Washington, DC, USA 2017 14. Amer N. Taha H. Hesham D. Al-Shehaby N. Mosaab A. Soudy M. Osama A. Mahmoud N. Elayadi M. Youssef A. Aggresomes predict poor outcomes and implicate proteostasis in the pathogenesis of pediatric choroid plexus tumors J. Neurooncol. 2021 152 67 78 10.1007/s11060-020-03694-3 33501605 PMC7910251 15. Capper D. Jones D.T.W. Sill M. Hovestadt V. Schrimpf D. Sturm D. Koelsche C. Sahm F. Chavez L. Reuss D.E. DNA methylation-based classification of central nervous system tumours Nature 2018 555 469 474 10.1038/nature26000 29539639 PMC6093218 16. Cheng S. Cacciotti C. Yan C.L.S. Lafay-Cousin L. What Have We Learnt from the Recent Multimodal Managements of Young Patients with ATRT? Cancers 2025 17 1116 10.3390/cancers17071116 40227618 PMC11987908 17. Frühwald M.C. Hasselblatt M. Nemes K. Bens S. Steinbügl M. Johann P.D. Kerl K. Hauser P. Quiroga E. Solano-Paez P. Age and DNA methylation subgroup as potential independent risk factors for treatment stratification in children with atypical teratoid/rhabdoid tumors Neuro Oncol. 2020 22 1006 1017 10.1093/neuonc/noz244 31883020 PMC7339901 18. Reddy A.T. Strother D.R. Judkins A.R. Burger P.C. Pollack I.F. Krailo M.D. Buxton A.B. Williams-Hughes C. Fouladi M. Mahajan A. Efficacy of high-dose chemotherapy and three-dimensional conformal radiation for atypical teratoid/rhabdoid tumor: A report from the Children’s Oncology Group trial ACNS0333 J. Clin. Oncol. 2020 38 1175 1185 10.1200/JCO.19.01776 32105509 PMC7145589 19. Desai K. Rosenberg T. Power P. Manoharan N. Nagabushan S. Green-Murphy A. Ziegler D.S. Li Y. Fisher M.J. Chi S. ATRT-11. IRS-III: Long-Term Follow-Up Shows Favorable Outcomes and Durable Responses for Localized Atypical Teratoid Rhabdoid Tumor (ATRT) Neuro-Oncology 2024 26 (Suppl. S1) vi64 10.1093/neuonc/noae064.011 20. Nesvick C.L. Lafay-Cousin L. Raghunathan A. Bouffet E. Huang A.A. Daniels D.J. Atypical teratoid rhabdoid tumor: Molecular insights and translation to novel therapeutics J. Neurooncol. 2020 150 47 56 10.1007/s11060-020-03639-w 33021733 PMC8230985 Figure 1 A heatmap showing the unsupervised hierarchical clustering of ATRT samples from CCHE (Cairo) using beta values for the most variable CpGs. ATRT-TYR = red; ATRT-SHH = blue; ATRT-MYC = dark green. Only every second sample is annotated on the X Figure 2 t-SNE plot illustrating DNA methylation-based classification (v12.8) of ATRT cohort from CCHE, Cairo, in comparison with MNP reference set from Heidelberg. Figure 3 A flow chart of the whole patient cohort. Abbreviations: PD: progressive disease; CTH: chemotherapy; RTH: radiation therapy. Figure 4 Kaplan–Meier curves for overall and event-free survival (OS and EFS) for whole cohort (N = 100). Ticks represent censoring of non-events. Figure 5 Cumulative incidence of relapse and related deaths and non-relapse mortality (NRM) for all cases (N = 100). Relapse and associated deaths occurred in 61 patients and represent primary event of interest, while NRM (toxic death) occurred in 28 and represents a competing event. cancers-17-03077-t001_Table 1 Table 1 The baseline clinical and molecular characteristics of patients for the whole cohort. Variable N (%) Total 100 (100%) Sex  Female 41 (41%) Male 59 (59%) Age group  <1 year 28 (28%) 1 to <3 years 46 (46%) ≥3 years 26 (26%) Primary site  Supra-tentorial 41 (41%) Infra-tentorial 55 (55%) Spine 4 (4%) M stage  M0 53 (53%) M+ 39 (39%) Mx 8 (8%) Extent of resection  GTR/NTR 40 (40%) STR/bx 60 (60%) Molecular subgroup  MYC 17 (17%) SHH 34 (34%) TYR 13 (13%) Not available 36 (36%) Abbreviations: GTR: gross total resection; NTR: near-total resection; STR: subtotal resection; bx: biopsy. cancers-17-03077-t002_Table 2 Table 2 Prognostic variables for overall survival (OS) using uni- and multivariable Cox regression.  Univariable Multivariable  HR 95% CI p aHR 95% CI p Age group       <1 year — —  — —  1 to <3 years 0.6 0.4, 0.97 0.04 0.65 0.4, 1.1 0.1 ≥3 years 0.51 0.3, 0.90 0.02 0.6 0.3, 1.1 0.1 Sex       Female — —     Male 1.1 0.7, 1.7 0.7    Primary site       Supra — —  — —  Infra/Spine 1.5 0.99, 2.35 0.05 1.2 0.7, 1.9 0.5 M stage       M0 — —  — —  M+ 2.7 1.7, 4.3 <0.001 2.3 1.4, 3.95 0.002 Mx 2.35 1.1, 5.1 0.03 1.8 0.8, 4.15 0.14 Extent of resection       GTR/NTR — —  — —  STR/bx 1.7 1.1, 2.6 0.02 1.2 0.7, 2.02 0.5 Molecular subgroup       MYC — —     SHH 0.9 0.4, 1.6 0.6    TYR 1.4 0.65, 2.98 0.4    Abbreviations: HR: hazard ratio; aHR: adjusted hazard ratio; CI: confidence interval; GTR: gross total resection; NTR: near-total resection; STR: subtotal resection; bx: biopsy. cancers-17-03077-t003_Table 3 Table 3 Prognostic variables for event-free survival (EFS) using uni- and multivariable Cox regression.  Event-Free Survival (EFS)  Univariable Multivariable  HR 95% CI  p aHR 95% CI  p Age group       <1 year — —  — —  1 to <3 years 0.6 0.4, 0.9 0.024 0.6 0.4, 1.0 0.056 ≥3 years 0.5 0.3, 0.8 0.011 0.5 0.3, 1.0 0.047 Sex       Female — —     Male 1.1 0.7, 1.6 0.8    Primary site       Supra — —  — —  Infra/Spine 1.6 1.0, 2.4 0.05 1.2 0.7, 1.8 0.6 M stage       M0 — —  — —  M+ 2.8 1.8, 4.3 <0.001 2.3 1.4, 3.9 0.002 Mx 2.4 1.1, 5.1 0.027 2.0 0.9, 4.5 0.1 Extent of resection       GTR/NTR — —  — —  STR/bx 1.7 1.1, 2.6 0.018 1.3 0.8, 2.2 0.3 Molecular subgroup       MYC — —     SHH 0.95 0.5, 1.8 0.9    TYR 1.5 0.7, 3.2 0.3    Abbreviations: HR: hazard ratio; aHR: adjusted hazard ratio; CI: confidence interval; GTR: gross total resection; NTR: near-total resection; STR: subtotal resection; bx: biopsy. cancers-17-03077-t004_Table 4 Table 4 Prognostic variables for the incidence of relapse, accounting for competing risks (non-relapse mortality) in a Fine–Gray sub-distribution hazards model.  Univariable Multivariable  HR 95% CI p aHR 95% CI p Age group       <1 year — —     1 to <3 years 0.8 0.4, 1.4 0.4    ≥3 years 0.9 0.5, 1.8 0.7    Sex       F — —     M 1.2 0.7, 1.9 0.5    Primary site       Supra — —     Infra/Spine 1.0 0.6, 1.6 >0.9    M-stage       M0 — —  — —  M+ 4.1 2.5, 7.0 <0.001 3.3 1.9, 5.7 <0.001 Mx 1.4 0.5, 4.2 0.6 1.5 0.5, 4.8 0.48 Extent of resection       GTR/NTR — —  — —  STR/bx 2.8 1.6, 4.9 <0.001 1.8 0.9, 3.5 0.08 Molecular subgroup       MYC — —     SHH 1.3 0.6, 2.9 0.5    TYR 0.8 0.3, 2.2 0.6    Abbreviations: HR: hazard ratio; aHR: adjusted hazard ratio; CI: confidence interval; GTR: gross total resection; NTR: near-total resection; STR: subtotal resection; bx: biopsy; CI: cumulative incidence. ",
  "metadata": {
    "Title of this paper": "Atypical teratoid rhabdoid tumor: Molecular insights and translation to novel therapeutics",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468553/"
  }
}