{
  "title": "Paper_548",
  "abstract": "pmc Bioeng Transl Med Bioeng Transl Med 3332 btm BTM2 Bioengineering & Translational Medicine 2380-6761 Wiley PMC12478445 PMC12478445.1 12478445 12478445 41030279 10.1002/btm2.70027 BTM270027 1 Review Article Review Article Mitochondrial and photosynthetic therapy: A crucial strategy for remodeling cellular metabolic function Mubarik et al. Mubarik Muhammad Samee https://orcid.org/0000-0002-6277-5763  1 Zhao Zizhen  1 Khoshnamvand Mehdi  2 Pei De‐Sheng https://orcid.org/0000-0001-6408-9575  3 peids@cqmu.edu.cn Fu Ailing  1 fal@swu.edu.cn   1 College of Pharmaceutical Science Southwest University |Chongqing China   2 Caspian Sea Ecology Research Center (CSERC), Iranian Fisheries Science Research Institute (IFSRI) Agricultural Research, Education and Extension Organization (AREEO) Sari Iran   3 School of Public Health Chongqing Medical University Chongqing China * Correspondence fal@swu.edu.cn peids@cqmu.edu.cn 19 5 2025 9 2025 10 5 497785 10.1002/btm2.v10.5 e70027 17 4 2025 17 12 2024 25 4 2025 19 05 2025 30 09 2025 01 10 2025 © 2025 The Author(s). Bioengineering & Translational Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Extranuclear organelle transplantation, an emerging field in cell biology and bioengineering, presents innovative therapeutic possibilities by transferring organelles such as mitochondria between cells or across species. In living organisms, mitochondria and chloroplasts are closely related to converting substances and energy within cells. Transplantation therapy of mitochondria seeks to rebuild cell metabolic function in diseased or damaged cells and has broad application potential in treating metabolic diseases. The therapies provide a distinctive technology for cellular restoration by targeting energy generation at the organelle level, which will offer new energy resources for animal cells. At present, mitochondrial transplantation therapy has been applied as a novel approach to rescue patients in clinical settings, and chloroplast‐based transplantation endows animal cells to utilize light energy (photosynthetic animal cells). In this review, we discuss the exciting development and application prospects of mitochondrial and photosynthetic therapy in biomedicine. The technology of extranuclear transplantation would exert innovative and profound impacts on biological therapy. cellular new energy resources chloroplasts clinical applications mitochondria Chongqing Postdoctoral Innovation Mentor Studio X7928 Chongqing Technology Innovation and Application Development Sichuan‐Chongqing Special Key Project CSTB2024TIAD‐CYKJCXX0017 High‐level Talents Project of Chongqing Medical University R4014 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Mubarik MS Zhao Z Khoshnamvand M Pei D‐S Fu A Mitochondrial and photosynthetic therapy: A crucial strategy for remodeling cellular metabolic function Bioeng Transl Med 2025 10 5 e70027 10.1002/btm2.70027  Translational Impact Statement Mitochondrial and photosynthetic therapy represent groundbreaking approaches to treating metabolic and hypoxic diseases by restoring cellular energy production and enhancing oxygen supply. These innovative therapies hold immense clinical promise for conditions lacking effective treatments, offering new hope for patients through the remodeling of cellular metabolism and synthetic biological advancements. 1 INTRODUCTION Extranuclear organelle transplantation concerns the transfer of organelles from one cell to another or across species. Mitochondria and chloroplasts are essential organelles responsible for cellular metabolism and energy production.  1  2  3  4  5 Up to now, mitochondrial transplantation has been a new biotechnology in clinical  6  7  8  9  10  11  12 1.1 Mitochondrial transplantation therapy Mitochondria are the primary cellular organelles responsible for producing substantial ATP.  1  13  14  15  16  17  18  19  20  21  22 1.2 Intracellular mitochondrial transplantation The capacity to take up modern mitochondria is still present in cells. Isolated mitochondria could directly enter mammalian cells after simple coincubation, first observed in 1982 and subsequently identified after two decades.  23  24  25  26  27 Mitochondria undergo a differential fate upon entering cells based on the specific cell type. In most cells, external mitochondria can engage with other organelles within the cell, therefore substituting the cellular mitochondria to function.  28  29 1.3 Mitochondrial transplantation for disease treatment This is one of the most vibrant areas of research in mitochondrial function. Given that various diseases are associated with metabolic abnormalities and mitochondria play a crucial role in cellular metabolism, the administration of healthy mitochondria to remedy metabolic disorders would be reasonable.  30  31  32 Currently, there has been significant growth in global research on mitochondrial transplantation therapy.  33  34  35  36  37  38  39  40  41 Moreover, the intracellular molecular mechanism underlying mitochondrial transplantation therapy is elucidated. After mitochondria arrive in cells, they can transform intracellular metabolites like pyruvate and amino acids to produce ATP in the cell, which is consistent with the function of mitochondria themselves.  42 + +  43  44 Nevertheless, mitochondria can trigger apoptosis in malignant tumor cells,  40  44  45  46  47 1.4 Extracellular mitochondrial transplantation Given that isolated mitochondria possess intact structure, they should have the complete function of metabolic conversion and ATP production outside cells. The uptake rate of mitochondria by diseased cells with energy deficiency is slow and inefficient, but mitochondria can still rapidly improve the survival rate and vitality of such cells.  48  49  50  51  52 1.5 Clinical applications of mitochondrial transplantation Mitochondrial transplantation therapy has not only achieved encouraging outcomes in animal models of diseases but has also shown success in several human trials. This review, based on the information from ClinicalTrials.gov 1 TABLE 1 Clinical applications of mitochondrial transplantation therapy. Clinical disease Mitochondrial origin Transplantation method Executive agency Reference sources Congenital heart disease Autologous skeletal muscle Intracoronary injection Boston Children's Hospital, USA Emani  53 Complications of extracorporeal membrane oxygenation (ECMO) Autologous skeletal muscle Intramyocardial injection/proximal aortic injection Boston Children's Hospital, USA NCT02851758  54 Myocardial infarction/myocardial ischemia Intracoronary and intramyocardial injection Tehran University of Medical Sciences, Iran NCT05669144  55 Severe coronary atherosclerotic heart disease Autologous platelets Ischemic intramyocardial injection The First Affiliated Hospital of Xi'an Jiaotong University, China Willerson  56 Cerebral ischemia Autologous muscle tissue Cerebral vascular perfusion University of Washington, USA NCT04998357  57 Mitochondrial DNA deletion syndromes (Pearson syndrome, Kearns‐Sayre syndrome) Heterologous placenta‐derived mitochondria Autologous CD34+ hematopoietic stem cells and progenitor cells mitochondrial transplantation and reinfusion Minovia Therapeutics, Israel NCT06017869 NCT03384420  58 Refractory polymyositis or dermatomyositis Allogeneic umbilical cord mesenchymal stem cells Intravenous injection South Korea Paean Biotechnology Inc. NCT04976140  59 Chronic wound healing Skeletal muscle Intramuscular injection Gulhane Training and Research Hospital, University of Health Sciences, Ankara, Turkey Taner  60  Note The earliest and most widely used clinical application of mitochondrial transplantation therapy is to rescue critical patients with heart disease, including congenital cardiac disease, myocardial ischemia, and myocardial infarction.  61  62  63  64  65  66 Mitochondrial transplantation therapy is also used to treat rare diseases that lack effective medical means. Pearson syndrome is a sporadic disease caused by mtDNA deficiency.  67  58  68  69 The results obtained from animal studies and clinical applications demonstrate that animals do not exhibit any obvious adverse reactions or immune responses after mitochondrial transplantation. The body's tolerance to exogenous mitochondria is beyond what was expected. At present, clinical applications of mitochondrial transplantation are still emerging, with potential applications in treating chronic and common diseases such as anti‐aging https://longevity.technology/news/cellvie-closes-5-5m  38 2 PHOTOSYNTHETIC THERAPY Chloroplasts are widely distributed in green plants. Chloroplasts have a unique ability to utilize light energy to convert CO 2 2 2 2 2 2 2 2  70  71 2.1 Chloroplasts in animal cells Early studies indicated that animal cells could adapt to the photosynthesis of plant chloroplasts. Some lower animals can directly take up chloroplasts and utilize the photosynthesis to survive, such as marine gastropods Elysia chlorotica Tridachiella Diomedea Placobranchus ianthobapsus Sacoglossa Opisthobranchia  72  73  74  75 2.2 Photosynthetic vertebrates  Synechococcus elongatus S. elongatus S. elongatus  76 S. elongatus S. elongatus  77 E. coli E. coli S. elongatus A similar result is also observed from the microinjection of the microalgae Chlamydomonas reinhardtii  78 2.3 Photosynthetic mammalian cells Mammalian cells possess diverse ways to inhibit the proliferation and dissemination of exogenous bacteria.  79  80  70 S. elongatus  81 S. elongatus S. elongatus S. elongatus  9 S. elongatus S. elongatus Based on the symbiotic relationship between the photosynthesis of S. elongatus  9  11  12 2.4 Photosynthesis enhances oxygen supply to animal brain and heart Mammals themselves cannot produce oxygen but are highly dependent on oxygen. In particular, the activity of animal neurons requires energy provided by mitochondrial aerobic respiration, which hinges on a constant supply of external oxygen. The high dependence on oxygen has led to various neurological and psychiatric disorders that are associated with low oxygen levels in brain tissue. To enable animals to produce sufficient endogenous oxygen, single‐cell green algae and cyanobacteria containing chloroplasts were individually injected into Xenopus laevis  10  10 Moreover, the heart is another organ that consumes a large amount of oxygen. The oxygen production capacity of chloroplasts may help alleviate myocardial hypoxia. After S. elongatus 2  82 Nevertheless, the production of oxygen using photosynthetic bacteria in mammalian organisms is limited by the need for sufficient and sustained light sources.  83  84 3+ S. elongatus 2 2 S. elongatus Regarding biosafety, S. elongatus  85 S. aureus S. elongatus S. elongatus 2.5 Application of thylakoid photosynthesis in vivo Thylakoids are membrane structures that make up the chloroplasts and play an essential role in photosynthesis. The light reaction of photosynthesis, which captures light to produce ATP, NADPH, and oxygen, occurs at thylakoids. To ensure their stable presence within cells, the isolated thylakoids are wrapped using mammalian cell membranes to form nano‐thylakoids.  86  87  88 3 CONCLUSION AND PROSPECT Historically, organelle transplantation mainly indicated nucleus transfer, which will alter the genetic phenotype of organisms. However, there has been a specific emphasis on extranuclear organelle transplantation in recent years since the transplantation presents exciting opportunities for therapeutic intervention. Mitochondria and chloroplasts are the critical organelles that are responsible for cellular metabolism and energy production. According to the endosymbiosis theory, mitochondria and chloroplasts originate from ancient primitive bacteria. Now the translation of this symbiotic biological event into biomedical applications will provide new energy and resources for cells and then reshape cellular metabolic functions. Their medical values have exceeded their roles as organelles. At present, mitochondrial transplantation therapy has been employed in clinical settings, starting from critical and rare diseases to other common diseases. Regarding the clinical application of mitochondrial therapy, a standard protocol should be established, including the source of mitochondria, mitochondrial quality control, and evaluation of therapeutic efficacy. The preferred mitochondria are autologous mitochondria of patients, followed by human stem cell‐derived mitochondria such as patient‐specific iPSC, in order to reduce the immunogenicity of mitochondria from allogeneic sources. Mitochondrial quality control is involved in the evaluation of mitochondrial membrane integrity and metabolic function, which could be achieved through biochemical assays. Consensus is needed on isolation methods (e.g., differential filtration), dosing (e.g., 2 × 106 mitochondria/gram tissue), and delivery routes (e.g., intracoronary injection). Regulatory agencies should establish guidelines for Good Manufacturing Practice (GMP)‐compliant production. Photosynthetic therapy requires tailored protocols for light delivery, such as upconversion nanoparticles for deep‐tissue penetration, and containment strategies to prevent ecological risks. Modular biomaterial platforms (e.g., hydrogels for sustained release) could bridge gaps between lab and clinic. Global collaborations, like the MITO2i working group, are vital to harmonize research and accelerate approvals. Emerging technologies, such as 3D bioprinting and organ‐on‐a‐chip models, can refine therapeutic efficacy and safety.  41 Mitochondrial and photosynthetic therapies hold transformative potential but face significant translational challenges. Ensuring safety requires rigorous quality control and understanding of mitochondrial and chloroplast behavior post‐transplantation. Immune compatibility demands innovative engineering to evade host defenses, while standardized protocols and regulatory guidelines are essential for clinical adoption. Collaborative efforts among researchers, clinicians, and regulators will be critical to advancing these therapies from bench to bedside. The exploration of chloroplast‐based transplantation will fundamentally create artificial animal chloroplasts. The development and exploitation of biotechnology that inputs new energy sources for mammalian cells holds great potential to revolutionize regenerative medicine and synthetic biology, offering a new paradigm for treating a wide range of medical conditions. AUTHOR CONTRIBUTIONS Muhammad Samee Mubarik and Zizhen Zhao wrote the draft. Mehdi Khoshnamvand revised the draft. De‐Sheng Pei and Ailing Fu proposed the conception. FUNDING INFORMATION This work was supported by Chongqing Technology Innovation and Application Development Sichuan‐Chongqing Special Key Project (CSTB2024TIAD‐CYKJCXX0017), High‐level Talents Project of Chongqing Medical University (No. R4014) and the Chongqing Postdoctoral Innovation Mentor Studio (X7928 D.S.P.). CONFLICT OF INTEREST STATEMENT The authors declare no conflicts of interests. DATA AVAILABILITY STATEMENT The data that support the findings of this study are available from the corresponding author upon reasonable request. REFERENCES 1 Rossmann MP Dubois SM Agarwal S Zon LI Mitochondrial function in development and disease Dis Model Mech 2021 14 6 dmm048912 34114603 10.1242/dmm.048912 PMC8214736 2 Miller TE Beneyton T Schwander T Light‐powered CO 2 Science 2020 368 6491 649 654 32381722 10.1126/science.aaz6802 PMC7610767 3 Martijn J Vosseberg J Guy L Offre P Ettema TJG Deep mitochondrial origin outside the sampled alphaproteobacteria Nature 2018 557 7703 101 105 29695865 10.1038/s41586-018-0059-5 4 Maréchal E How did thylakoids emerge in cyanobacteria, and how were the primary chloroplast and chromatophore acquired? Methods Mol Biol 2024 2776 3 20 38502495 10.1007/978-1-0716-3726-5_1 5 Li Y Zhang H Yu C New insights into mitochondria in health and diseases Int J Mol Sci 2024 25 18 9975 39337461 10.3390/ijms25189975 PMC11432609 6 Gäbelein CG Feng Q Sarajlic E Mitochondria transplantation between living cells PLoS Biol 2022 20 3 e3001576 35320264 10.1371/journal.pbio.3001576 PMC8942278 7 Jain R Begum N Tryphena KP Inter and intracellular mitochondrial transfer: future of mitochondrial transplant therapy in Parkinson's disease Biomed Pharmacother 2023 159 114268 36682243 10.1016/j.biopha.2023.114268 8 Neikirk K Stephens DC Beasley HK Considerations for developing mitochondrial transplantation techniques for individualized medicine Biotechniques 2024 76 4 125 134 38420889 10.2144/btn-2023-0072 9 Hu G Huang J Fussenegger M Toward photosynthetic mammalian cells through artificial endosymbiosis Small 2024 20 31 e2310310 38506612 10.1002/smll.202310310 10 Özugur S Chávez MN Sanchez‐Gonzalez R Kunz L Nickelsen J Straka H Green oxygen power plants in the brain rescue neuronal activity iScience 2021 24 10 103158 34755084 10.1016/j.isci.2021.103158 PMC8560625 11 Satta A Esquirol L Ebert BE Current metabolic engineering strategies for photosynthetic bioproduction in cyanobacteria Microorganisms 2023 11 2 455 36838420 10.3390/microorganisms11020455 PMC9964548 12 Zhang T Liu D Zhang Y Chen L Zhang W Sun T Biomedical engineering utilizing living photosynthetic cyanobacteria and microalgae: current status and future prospects Mater Today Biol 2024 27 101154 10.1016/j.mtbio.2024.101154 PMC11304071 39113912 13 Clemente‐Suárez VJ Redondo‐Flórez L Beltrán‐Velasco AI Mitochondria and brain disease: a comprehensive review of pathological mechanisms and therapeutic opportunities Biomedicine 2023 11 9 2488 10.3390/biomedicines11092488 PMC10526226 37760929 14 Macherel D Haraux F Guillou H Bourgeois O The conundrum of hot mitochondria BBA‐Bioenergetics 2021 1862 2 148348 33248118 10.1016/j.bbabio.2020.148348 15 Suomalainen A Nunnari J Mitochondria at the crossroads of health and disease Cell 2024 187 11 2601 2627 38788685 10.1016/j.cell.2024.04.037 16 Anderson AJ Jackson TD Stroud DA Mitochondria‐hubs for regulating cellular biochemistry: emerging concepts and networks Open Biol 2019 9 8 190126 31387448 10.1098/rsob.190126 PMC6731593 17 Picard M Shirihai OS Mitochondrial signal transduction Cell Metab 2022 34 11 1620 1653 36323233 10.1016/j.cmet.2022.10.008 PMC9692202 18 Glancy B Kim Y Katti P Willingham TB The functional impact of mitochondrial structure across subcellular scales Front Physiol 2020 11 541040 33262702 10.3389/fphys.2020.541040 PMC7686514 19 Reddam A McLarnan S Kupsco A Environmental chemical exposures and mitochondrial dysfunction: a review of recent literature Curr Environ Health Rep 2022 9 4 631 649 35902457 10.1007/s40572-022-00371-7 PMC9729331 20 Chistiakov DA Sobenin IA Revin VV Orekhov AN Bobryshev YV Mitochondrial aging and age‐related dysfunction of mitochondria Biomed Res Int 2014 2014 1 7 10.1155/2014/238463 PMC4003832 24818134 21 Li W Cheng H Li G Zhang L Mitochondrial damage and the road to exhaustion Cell Metab 2020 32 6 905 907 33264601 10.1016/j.cmet.2020.11.004 22 Ikeda H Kawase K Nishi T Immune evasion through mitochondrial transfer in the tumour microenvironment Nature 2025 638 8049 225 236 39843734 10.1038/s41586-024-08439-0 PMC11798832 23 Clark MA Shay JW Mitochondrial transformation of mammalian cells Nature 1982 295 5850 605 607 7057918 10.1038/295605a0 24 Caicedo A Aponte PM Cabrera F Hidalgo C Khoury M Artificial mitochondria transfer: current challenges, advances, and future applications Stem Cells Int 2017 2017 7610414 7610423 28751917 10.1155/2017/7610414 PMC5511681 25 Fu A Shi X Zhang H Fu B Mitotherapy for fatty liver by intravenous administration of exogenous mitochondria in male mice Front Pharmacol 2017 8 241 28536524 10.3389/fphar.2017.00241 PMC5422541 26 Kami D Gojo S From cell entry to engraftment of exogenous mitochondria Int J Mol Sci 2020 21 14 10.3390/ijms21144995 PMC7404190 32679802 27 Zhao Z Hou YX Zhou Z Keerthiga R Fu A Mitochondrial transplantation therapy inhibit carbon tetrachloride‐induced liver injury through scavenging free radicals and protecting hepatocytes Bioeng Transl Med 2021 6 2 e10209 34027095 10.1002/btm2.10209 PMC8126821 28 Huang T Lin R Su Y Efficient intervention for pulmonary fibrosis via mitochondrial transfer promoted by mitochondrial biogenesis Nat Commun 2023 14 1 5781 37723135 10.1038/s41467-023-41529-7 PMC10507082 29 Xie Q Zeng J Zheng Y Mitochondrial transplantation attenuates cerebral ischemia–reperfusion injury: possible involvement of mitochondrial component separation Oxid Med Cell Longev 2021 2021 1006636 34849186 10.1155/2021/1006636 PMC8627565 30 Borcherding N Brestoff JR The power and potential of mitochondria transfer Nature 2023 623 7986 283 291 37938702 10.1038/s41586-023-06537-z PMC11590279 31 Norat P Soldozy S Sokolowski JD Mitochondrial dysfunction in neurological disorders: exploring mitochondrial transplantation NPJ Regen Med 2020 5 1 22 33298971 10.1038/s41536-020-00107-x PMC7683736 32 Xu M Zhu J Wang Z Yan J Zhou X Neuroprotective effect of autologous mitochondrial transplantation against global ischemia/reperfusion injury in a rat model of cardiac arrest Mitochondrion 2024 78 101924 38944369 10.1016/j.mito.2024.101924 33 Alemany VS Nomoto R Saeed MY Mitochondrial transplantation preserves myocardial function and viability in pediatric and neonatal pig hearts donated after circulatory death J Thorac Cardiovasc Surg 2024 167 1 6 21 10.1016/j.jtcvs.2023.05.010 37211245 34 Hosseinian S Pour PA Kheradvar A Prospects of mitochondrial transplantation in clinical medicine: aspirations and challenges Mitochondrion 2022 65 33 44 35504560 10.1016/j.mito.2022.04.006 PMC9677933 35 Kim JS Lee S Kim WK Han BS Mitochondrial transplantation: an overview of a promising therapeutic approach BMB Rep 2023 56 9 488 495 37679296 10.5483/BMBRep.2023-0098 PMC10547968 36 Liu Z Sun Y Qi Z Cao L Ding S Mitochondrial transfer/transplantation: an emerging therapeutic approach for multiple diseases Cell Biosci 2022 12 1 66 35590379 10.1186/s13578-022-00805-7 PMC9121600 37 Saeb‐Parsy K Martin JL Summers DM Watson CJE Krieg T Murphy MP Mitochondria as therapeutic targets in transplantation Trends Mol Med 2021 27 2 185 198 32952044 10.1016/j.molmed.2020.08.001 38 Phua QH Ng SY Soh BS Mitochondria: a potential rejuvenation tool against aging Aging Dis 2024 15 2 503 516 37815912 10.14336/AD.2023.0712 PMC10917551 39 Wang Y Li W Guo Y Mitochondria transplantation to bone marrow stromal cells promotes angiogenesis during bone repair Adv Sci 2024 11 39 e2403201 10.1002/advs.202403201 PMC11497025 39137351 40 Zeng J Liu J Ni H Mitochondrial transplantation reduces lower limb ischemia–reperfusion injury by increasing skeletal muscle energy and adipocyte browning Mol Ther Methods Clin Dev 2023 31 101152 38027061 10.1016/j.omtm.2023.101152 PMC10667789 41 Bodenstein DF Siebiger G Zhao Y Bridging the gap between in vitro and in vivo models: a way forward to clinical translation of mitochondrial transplantation in acute disease states Stem Cell Res Ther 2024 15 1 157 38816774 10.1186/s13287-024-03771-8 PMC11140916 42 Yang X Zhou P Zhao Z Improvement effect of mitotherapy on the cognitive ability of Alzheimer's disease through NAD(+)/SIRT1‐mediated autophagy Antioxidants (Basel) 2023 12 11 2006 38001859 10.3390/antiox12112006 PMC10669341 43 Campagna R Mazzanti L Pompei V Alia S Vignini A Emanuelli M The multifaceted role of endothelial sSirt1 n vascular aging: an update Cells 2024 13 17 1469 39273039 10.3390/cells13171469 PMC11394039 44 Zhou W Zhao Z Yu Z Hou Y Keerthiga R Fu A Mitochondrial transplantation therapy inhibits the proliferation of malignant hepatocellular carcinoma and its mechanism Mitochondrion 2022 65 11 22 35504558 10.1016/j.mito.2022.04.004 45 Bezwada D Perelli L Lesner NP Mitochondrial complex I promotes kidney cancer metastasis Nature 2024 633 923 931 39143213 10.1038/s41586-024-07812-3 PMC11424252 46 Kuo FC Chen PC You SY Transplanting mitochondria from gastric epithelial cells reduces the malignancy of gastric cancer Mitochondrion 2024 78 101939 39067839 10.1016/j.mito.2024.101939 47 Frisbie L Pressimone C Dyer E Carcinoma‐associated mesenchymal stem cells promote ovarian cancer heterogeneity and metastasis through mitochondrial transfer Cell Rep 2024 43 8 114551 39067022 10.1016/j.celrep.2024.114551 PMC11420855 48 Miliotis S Nicolalde B Ortega M Yepez J Caicedo A Forms of extracellular mitochondria and their impact in health Mitochondrion 2019 48 16 30 30771504 10.1016/j.mito.2019.02.002 49 Al Amir Dache Z Otandault A Tanos R Blood contains circulating cell‐free respiratory competent mitochondria FASEB J 2020 34 3 3616 3630 31957088 10.1096/fj.201901917RR 50 Gowda S Rana K Kumar A Extracellular mitochondrial components as new biomarkers for lupus nephritis Lupus 2024 33 8 779 786 38621786 10.1177/09612033241247622 51 Suh J Lee YS Mitochondria as secretory organelles and therapeutic cargos Exp Mol Med 2024 56 1 66 85 38172601 10.1038/s12276-023-01141-7 PMC10834547 52 Wu Z Chen L Guo W Oral mitochondrial transplantation using nanomotors to treat ischaemic heart disease Nat Nanotechnol 2024 19 9 1375 1385 38802669 10.1038/s41565-024-01681-7 53 Emani SM Piekarski BL Harrild D Del Nido PJ McCully JD Autologous mitochondrial transplantation for dysfunction after ischemia–reperfusion injury J Thorac Cardiovasc Surg 2017 154 1 286 289 28283239 10.1016/j.jtcvs.2017.02.018 54 Kubat GB The importance of platelet‐derived mitochondrial transplantation in ischemic heart disease: a clinical study Int J Cardiol 2024 412 132312 38950785 10.1016/j.ijcard.2024.132312 55 Gougheri KA Ahmadi A Ahmadabadi MG Exosomal cargo: pro‐angiogeneic, anti‐inflammatory, and regenerative effects in ischemic and non‐ischemic heart diseases—a comprehensive review Biomed Pharmacother 2023 168 115801 37918257 10.1016/j.biopha.2023.115801 56 Willerson JT Perin EC Ellis SG Intramyocardial injection of autologous bone marrow mononuclear cells for patients with chronic ischemic heart disease and left ventricular dysfunction (first mononuclear cells injected in the US [FOCUS]): rationale and design Am Heart J 2010 160 2 215 223 20691824 10.1016/j.ahj.2010.03.029 PMC2921924 57 Walker M. 2024 https://clinicaltrials.gov/study/NCT04998357 58 Jacoby E Bar‐Yosef O Gruber N Mitochondrial augmentation of hematopoietic stem cells in children with single large‐scale mitochondrial DNA deletion syndromes Sci Transl Med 2022 14 676 eabo3724 36542693 10.1126/scitranslmed.abo3724 59 Yoo D Lee E Kim H 2021 https://clinicaltrials.gov/ct2/show/NCT04976140 60 Taner OF Ulger O Ersahin S Baser NT Genc O Kubat GB Effects of mitochondrial transplantation on chronic pressure wound healing in a human patient Cytotherapy 2024 26 6 579 585 38506772 10.1016/j.jcyt.2024.02.027 61 Emani SM McCully JD Mitochondrial transplantation: applications for pediatric patients with congenital heart disease Transl Pediatr 2018 7 2 169 175 29770298 10.21037/tp.2018.02.02 PMC5938257 62 Sun M Jiang W Mu N Zhang Z Yu L Ma H Mitochondrial transplantation as a novel therapeutic strategy for cardiovascular diseases J Transl Med 2023 21 1 347 37231493 10.1186/s12967-023-04203-6 PMC10210445 63 Guariento A Piekarski BL Doulamis IP Autologous mitochondrial transplantation for cardiogenic shock in pediatric patients following ischemia–reperfusion injury J Thorac Cardiovasc Surg 2021 162 3 992 1001 33349443 10.1016/j.jtcvs.2020.10.151 64 Liang X Zhang Y Lin F Direct administration of mesenchymal stem cell‐derived mitochondria improves cardiac function after infarction via ameliorating endothelial senescence Bioeng Transl Med 2023 8 1 e10365 36684073 10.1002/btm2.10365 PMC9842017 65 Jin N Zhang M Zhou L Mitochondria transplantation alleviates cardiomyocytes apoptosis through inhibiting AMPKα‐mTOR mediated excessive autophagy FASEB J 2024 38 10 e23655 38767449 10.1096/fj.202400375R 66 Zhao L Ling L Lu J Reactive oxygen species‐responsive mitochondria‐targeted liposomal quercetin attenuates retinal ischemia–reperfusion injury via regulating SIRT1/FOXO3A and p38 MAPK signaling pathways Bioeng Transl Med 2023 8 3 e10460 37206232 10.1002/btm2.10460 PMC10189480 67 Yoshimi A Ishikawa K Niemeyer C Grünert SC Pearson syndrome: a multisystem mitochondrial disease with bone marrow failure Orphanet J Rare Dis 2022 17 1 379 36253820 10.1186/s13023-022-02538-9 PMC9575259 68 Zhong G Liu W Venkatesan JK Wang D Madry H Cucchiarini M Autologous transplantation of mitochondria/rAAV IGF‐I platforms in human osteoarthritic articular chondrocytes to treat osteoarthritis Mol Ther 2024 24 847 10.1016/j.ymthe.2024.12.047 PMC12172189 39741406 69 Nakai R Varnum S Field RL Mitochondria transfer‐based therapies reduce the morbidity and mortality of Leigh syndrome Nat Metab 2024 6 10 1886 1896 39223312 10.1038/s42255-024-01125-5 PMC12188917 70 Agapakis CM Niederholtmeyer H Noche RR Towards a synthetic chloroplast PLoS One 2011 6 4 e18877 21533097 10.1371/journal.pone.0018877 PMC3080389 71 Rumpho ME Pelletreau KN Moustafa A Bhattacharya D The making of a photosynthetic animal J Exp Biol 2011 214 Pt 2 303 311 21177950 10.1242/jeb.046540 PMC3008634 72 Cartaxana P Rey F LeKieffre C Photosynthesis from stolen chloroplasts can support sea slug reproductive fitness Proc Biol Sci 2021 288 20211779 34583582 10.1098/rspb.2021.1779 PMC8479339 73 Maeda T Takahashi S Yoshida T Chloroplast acquisition without the gene transfer in kleptoplastic sea slugs, Plakobranchus ocellatus Elife 2021 10 e60176 33902812 10.7554/eLife.60176 PMC8079154 74 Nass MMK Uptake of isolated chloroplasts by mammalian cells Science 1969 165 3898 1128 1131 5801593 10.1126/science.165.3898.1128 75 Zhao Z Fu A Mitochondrial therapy: a new strategy for treating mitochondrion‐associated diseases Chin J Biotechnol 2021 37 4 1168 1177 10.13345/j.cjb.200383 33973433 76 Burns JA Zhang H Hill E Kim E Kerney R Transcriptome analysis illuminates the nature of the intracellular interaction in a vertebrate–algal symbiosis eLife 2017 6 e22054 28462779 10.7554/eLife.22054 PMC5413350 77 Cournoyer JE Altman SD Gao YL Engineering artificial photosynthetic life‐forms through endosymbiosis Nat Commun 2022 13 1 2254 35474066 10.1038/s41467-022-29961-7 PMC9042829 78 Alvarez M Reynaert N Chávez MN Generation of viable plant–vertebrate chimeras PLoS One 2015 10 6 e0130295 26126202 10.1371/journal.pone.0130295 PMC4488345 79 Bichet MC Adderley J Avellaneda‐Franco L Mammalian cells internalize bacteriophages and use them as a resource to enhance cellular growth and survival PLoS Biol 2023 21 10 e3002341 37883333 10.1371/journal.pbio.3002341 PMC10602308 80 Stones DH Krachler AM Against the tide: the role of bacterial adhesion in host colonization Biochem Soc Trans 2016 44 6 1571 1580 27913666 10.1042/BST20160186 PMC5134996 81 Cheng C Sun J Yu H Listeriolysin O pore‐forming activity is required for ERK1/2 phosphorylation during Listeria monocytogenes Front Immunol 2020 11 48 32582211 10.3389/fimmu.2020.01146 PMC7283531 82 Cohen JE Goldstone AB Paulsen MJ An innovative biologic system for photon‐powered myocardium in the ischemic heart Sci Adv 2017 3 6 e1603078 28630913 10.1126/sciadv.1603078 PMC5470824 83 Nath S Interpretation of the mechanism of action of antituberculosis drug bedaquiline based on a novel two‐ion theory of energy coupling in ATP synthesis Bioeng Transl Med 2019 4 164 170 30680327 10.1002/btm2.10106 PMC6336660 84 Wang J Su Q Lv Q Oxygen‐generating cyanobacteria powered by upconversion‐nanoparticles‐converted near‐infrared light for ischemic stroke treatment Nano Lett 2021 21 11 4654 4665 34008994 10.1021/acs.nanolett.1c00719 85 Williams KM Wang H Paulsen MJ Safety of photosynthetic Synechococcus elongatus for in vivo cyanobacteria–mammalian symbiotic therapeutics J Microbial Biotechnol 2020 13 6 1780 1792 10.1111/1751-7915.13596 PMC7533327 32476224 86 Chen P Liu X Gu C A plant‐derived natural photosynthetic system for improving cell anabolism Nature 2022 612 7940 546 554 36477541 10.1038/s41586-022-05499-y PMC9750875 87 Kim H Ahn Y‐H Moon CM Kang JL Woo M Kim M Lethal effects of mitochondria via microfluidics Bioeng Transl Med 2023 8 3 e10461 37206227 10.1002/btm2.10461 PMC10189453 88 Schieweck R Götz M Pan‐cellular organelles and suborganelles‐from common functions to cellular diversity? Genes Dev 2024 38 3–4 98 114 38485267 10.1101/gad.351337.123 PMC10982711 ",
  "metadata": {
    "Title of this paper": "Pan‐cellular organelles and suborganelles‐from common functions to cellular diversity?",
    "Journal it was published in:": "Bioengineering & Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478445/"
  }
}