{
  "title": "Paper_974",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470376 PMC12470376.1 12470376 12470376 41009804 10.3390/ijms26189238 ijms-26-09238 1 Editorial Special Issue “Biopolymers in Drug and Gene Delivery Systems 3.0” https://orcid.org/0000-0002-9731-6399 Skorik Yury A. Branch of Petersburg Nuclear Physics Institute named by B.P. Konstantinov of National Research Centre “Kurchatov Institute”—Institute of Macromolecular Compounds, Bolshoi VO 31, St. Petersburg 199004, Russia; yury_skorik@mail.ru 22 9 2025 9 2025 26 18 497349 9238 15 9 2025 19 9 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes The evolution of biopolymer-based drug and gene delivery systems is a compelling narrative marked by a continuous transition from fundamental concepts to transformative applications. Initially, the focus was on using the natural biocompatibility of polymers for basic encapsulation. However, this field has matured into the sophisticated engineering of intelligent, multifunctional platforms. Convergence with nanotechnology, advanced materials science, and molecular biology has enabled the design of modern biopolymer systems that can navigate complex biological environments, overcome significant physiological barriers, and deliver therapeutic payloads with unparalleled precision. This evolution has shifted the paradigm from improving drug solubility and stability to enabling targeted, personalized, and combination therapies. We are pleased to present this three-volume series, Biopolymers in Drug and Gene Delivery Systems, which takes readers on an exciting journey from foundational principles to current cutting-edge applications. The first volume of the Special Issue provided an overview of biopolymer applications in drug delivery (Available online: https://www.mdpi.com/journal/ijms/special_issues/Biopolymers_Drug_Gene_Delivery_Systems The second volume of the Special Issue examined cutting-edge trends in biopolymer-based delivery systems (Available online: https://www.mdpi.com/journal/ijms/special_issues/Biopolymers_Delivery_Systems2 This third volume, Biopolymers in Drug and Gene Delivery Systems 3.0 (Available online: https://www.mdpi.com/journal/ijms/special_issues/BIFSHDN056 Advanced Theranostic Platforms: Integrating therapy and diagnostics into a single platform is a paradigm shift in treatment that moves us toward real-time monitoring and personalization. As reviewed in [ 1 2 3 Conquering Biological Barriers: One of the most significant challenges for gene and oligonucleotide therapies is maintaining stability in the harsh in vivo environment, especially against nucleases and serum proteins. Refs. [ 4 5 6 Expanding the Nucleic Acid Toolkit: The scope of nucleic acid therapeutics is expanding beyond DNA, and siRNA therapy has emerged as a powerful alternative for silencing disease-causing genes [ 6 Sophisticated Targeting and Localized Release: Maximizing efficacy and minimizing systemic side effects through localized delivery remains a core objective. Advances in materials science are yielding increasingly precise systems [ 7 8 Dual-Targeting Strategies for Enhanced Bioavailability: One important application is improving the delivery of difficult-to-deliver drugs, such as potent antibiotics with significant toxicity [ 9 10 11 In conclusion, this third volume showcases a field that has successfully transitioned from advanced design to overcoming the practical challenges of clinical translation. The focus is on creating intelligent, multifunctional systems that can navigate the complexities of the human body [ 12 13 Disclaimer/Publisher’s Note: Institutional Review Board Statement Not applicable. Data Availability Statement No new data were generated in this article. Conflicts of Interest The author declare no conflict of interest. List of Contributions Liu: Z.; Zong, Z.; Li, X.; Sun, S. Smart Polymeric Micelles with Aggregation-Induced Emission and pH-Responsive Fluorescence Color Change Behavior for Bioimaging and Cancer Therapy. Int. J. Mol. Sci. 2025 26 https://doi.org/10.3390/ijms26146654 Egorova, A.; Shtykalova, S.; Maretina, M.; Freund, S.; Selutin, A.; Shved, N.; Selkov, S.; Kiselev, A. Serum-Resistant Ternary DNA Polyplexes for Suicide Gene Therapy of Uterine Leiomyoma. Int. J. Mol. Sci. 2024 25 https://doi.org/10.3390/ijms25010034 Egorova, A.; Maretina, M.; Krylova, I.; Kiselev, A. Polycondensed Peptide-Based Polymers for Targeted Delivery of Anti-Angiogenic siRNA to Treat Endometriosis. Int. J. Mol. Sci. 2024 25 https://doi.org/10.3390/ijms25010013 Nasibullin, S.F.; Dunaeva, J.V.; Akramova, L.A.; Timergalieva, V.R.; Moustafine, R.I. Characteristics of Interpolyelectrolyte Complexes Based on Different Types of Pectin with Eudragit ® Int. J. Mol. Sci. 2023 24 https://doi.org/10.3390/ijms242417622 Dubashynskaya, N.V.; Bokatyi, A.N.; Sall, T.S.; Egorova, T.S.; Nashchekina, Y.A.; Dubrovskii, Y.A.; Murashko, E.A.; Vlasova, E.N.; Demyanova, E.V.; Skorik, Y.A. Cyanocobalamin-Modified Colistin–Hyaluronan Conjugates: Synthesis and Bioactivity. Int. J. Mol. Sci. 2023 24 https://doi.org/10.3390/ijms241411550 References 1. Burkett B.J. Bartlett D.J. McGarrah P.W. Lewis A.R. Johnson D.R. Berberoglu K. Pandey M.K. Packard A.T. Halfdanarson T.R. Hruska C.B. A review of theranostics: Perspectives on emerging approaches and clinical advancements Radiol. Imaging Cancer 2023 5 e220157 10.1148/rycan.220157 37477566 PMC10413300 2. Wei D. Sun Y. Zhu H. Fu Q. Stimuli-responsive polymer-based nanosystems for cancer theranostics ACS Nano 2023 17 23223 23261 10.1021/acsnano.3c06019 38041800 3. Giri P.M. Banerjee A. Layek B. A recent review on cancer nanomedicine Cancers 2023 15 2256 10.3390/cancers15082256 37190185 PMC10136552 4. Blanco E. Shen H. Ferrari M. Principles of nanoparticle design for overcoming biological barriers to drug delivery Nat. Biotechnol. 2015 33 941 951 10.1038/nbt.3330 26348965 PMC4978509 5. Azizi M. Jahanban-Esfahlan R. Samadian H. Hamidi M. Seidi K. Dolatshahi-Pirouz A. Yazdi A.A. Shavandi A. Laurent S. Be Omide Hagh M. Multifunctional nanostructures: Intelligent design to overcome biological barriers Mater. Today Bio 2023 20 100672 10.1016/j.mtbio.2023.100672 37273793 PMC10232915 6. Zhang J. Chen B. Gan C. Sun H. Zhang J. Feng L. A comprehensive review of small interfering rnas (sirnas): Mechanism, therapeutic targets, and delivery strategies for cancer therapy Int. J. Nanomed. 2023 18 7605 7635 10.2147/IJN.S436038 38106451 PMC10725753 7. Torres J. Dhas N. Longhi M. Garcia M.C. Overcoming biological barriers with block copolymers-based self-assembled nanocarriers. Recent advances in delivery of anticancer therapeutics Front. Pharmacol. 2020 11 593197 10.3389/fphar.2020.593197 33329001 PMC7734332 8. Raheem M.A. Rahim M.A. Gul I. Zhong X. Xiao C. Zhang H. Wei J. He Q. Hassan M. Zhang C.Y. Advances in nanoparticles-based approaches in cancer theranostics OpenNano 2023 12 100152 10.1016/j.onano.2023.100152 9. Dubashynskaya N.V. Skorik Y.A. Polymyxin delivery systems: Recent advances and challenges Pharmaceuticals 2020 13 83 10.3390/ph13050083 32365637 PMC7281078 10. Bokatyi A.N. Dubashynskaya N.V. Skorik Y.A. Chemical modification of hyaluronic acid as a strategy for the development of advanced drug delivery systems Carbohydr. Polym. 2024 337 122145 10.1016/j.carbpol.2024.122145 38710553 11. Wang S. Li J. Zhang Z. Cao S. Zhang Z. Bian Y. Xu Y. Ma C. Advances in nanomedicine and delivery systems for gastric cancer research Front. Bioeng. Biotechnol. 2025 13 1565999 10.3389/fbioe.2025.1565999 40190709 PMC11968739 12. Sindhwani S. Syed A.M. Ngai J. Kingston B.R. Maiorino L. Rothschild J. MacMillan P. Zhang Y. Rajesh N.U. Hoang T. The entry of nanoparticles into solid tumours Nat. Mater. 2020 19 566 575 10.1038/s41563-019-0566-2 31932672 13. Luobin L. Wanxin H. Yingxin G. Qinzhou Z. Zefeng L. Danyang W. Huaqin L. Nanomedicine-induced programmed cell death in cancer therapy: Mechanisms and perspectives Cell Death Discov. 2024 10 386 10.1038/s41420-024-02121-0 39209834 PMC11362291 ",
  "metadata": {
    "Title of this paper": "Nanomedicine-induced programmed cell death in cancer therapy: Mechanisms and perspectives",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470376/"
  }
}