{
  "title": "Paper_1133",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468110 PMC12468110.1 12468110 12468110 41008874 10.3390/cancers17183031 cancers-17-03031 1 Review Protein and Peptide in Cancer Research: From Biomarker to Biotherapeutics https://orcid.org/0009-0008-1591-571X Seo Joo Hyeong 1 † https://orcid.org/0009-0003-2463-3726 Shin Seung Hoon 1 † Woo Hye Rin 1 An Yu Rim 1 Youn A Hyun 1 https://orcid.org/0000-0002-4335-025X Kim Song Yeon 1 https://orcid.org/0000-0003-1501-7166 Ki Mi-Ran 2 Pack Seung Pil 1 * Maggi Maristella Academic Editor 1 sjh0413@korea.ac.kr bimilbunho@korea.ac.kr gpfls99017@korea.ac.kr ayr7777@korea.ac.kr ahyunannie@korea.ac.kr sorenklin@korea.ac.kr 2 allheart@korea.ac.kr * spack@korea.ac.kr † These authors contributed equally to this work. 17 9 2025 9 2025 17 18 497140 3031 31 7 2025 31 8 2025 06 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Cancer arises from a complex set of molecular changes that disrupt the normal cell function. Among these, proteins and peptides play central roles in driving tumor development and progression. This research emphasizes the significance of proteins and peptides not only as markers for early cancer detection but also as promising candidates for targeted therapies. Their ability to reflect real-time changes in cellular processes makes them valuable tools for improving diagnostic accuracy and treatment outcomes. Recent technological advancements have enabled more precise identification, characterization, and delivery of protein- and peptide-based agents. By integrating insights from molecular biology, bioengineering, and data science, this field aims to support the development of personalized and more effective cancer treatments. This review discusses the growing effort to enhance cancer care through precision medicine and highlights the expanding impact of protein and peptide research in oncology. Abstract Proteins and peptides play a pivotal role in key pathological processes, including cancer growth, immune evasion, angiogenesis, and metastasis. Consequently, they are gaining attention as significant biomolecules in the diagnosis and treatment of various diseases. This review provides a comprehensive overview of the latest research trends and technological advancements in protein- and peptide-based cancer diagnostic and therapeutic strategies. It covers the clinical application of major diagnostic markers such as PSA, CA125, HER2, and AFP, as well as therapeutic strategies including monoclonal antibodies, immune checkpoint inhibitors, and anticancer peptides. Additionally, it introduces quantitative analysis techniques such as ELISA, mass spectrometry, and CyTOF, as well as advancements in delivery systems based on nanoparticle–peptide complexes. Peptides offer advantages for precision therapy due to their high target specificity and structural modifiability. However, they also have limitations such as stability, enzymatic degradation, and delivery efficiency. Emerging technologies such as synthetic biology, computational design, and omics-integrated analysis are being developed to address these challenges, and rapid advancements in this field are enhancing the potential for clinical application. This review underscores the potential of protein- and peptide-based strategies for precision cancer diagnosis and personalized therapy and proposes future research directions in this field. protein peptide cancer biomarker biotherapeutics Korean government RS-2021-NR060107 RS-2021-NR059450 Korea University This research was supported by the National Research Foundation of Korea (NRF) funded by the Korean government (MSIT) (RS-2021-NR060107, RS-2021-NR059450). This research was also supported by Korea University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer remains one of the most critical global health challenges, responsible for nearly ten million deaths annually [ 1 2 3 4 5 6 7 Molecular regulation of these processes depends on proteins and peptides. Genomic information is converted into structural elements, enzymatic functions, signal transduction, and intercellular communication by proteins. Hormonal regulation, immune modulation, and intercellular signaling involve peptides from larger precursors or signaling molecules. Dysregulated protein expression, mutations, or subcellular mislocalization can drive tumorigenesis, exemplified by the overactivation of receptor tyrosine kinases such as EGFR and HER2, or the loss of tumor suppressors like p53 and PTEN [ 8 9 10 11 Proteins and peptides are widely used in cancer diagnosis and treatment due to their versatility. Multiple protein-based biomarkers are used for early detection, prognosis, and therapeutic monitoring [ 12 13 14 15 16 17 Beyond diagnosis, proteins and peptides have become pivotal in treatment strategies. Monoclonal antibodies (mAbs) are one of the most successful classes of biologics, functioning either as receptor blockers (e.g., cetuximab) or as carriers in antibody–drug conjugates (ADCs) that deliver cytotoxic agents specifically to tumor cells [ 18 19 20 21 22 23 24 25 26 27 Recent advances in drug design and delivery have significantly expanded the clinical potential of protein- and peptide-based therapeutics. Unlike traditional small-molecule drugs, these biologics offer improved target specificity, reduced adverse effects, and enhanced pharmacodynamic profiles, making them increasingly attractive in clinical settings where precision and safety are paramount [ 28 A major driving force behind this progress is the integration of artificial intelligence and machine learning into the drug development process. These computational tools have revolutionized how researchers predict molecular interactions, assess structural stability, and model in vivo performance [ 29 30 In parallel, large-scale molecular profiling of cancer tissues using advanced proteomic and peptidomic technologies has deepened our understanding of disease biology. These approaches have highlighted the importance of post-translational modifications, protein–protein interactions, and short regulatory peptides in cancer progression and therapeutic resistance [ 31 32 Nanomedicine has introduced sophisticated platforms—such as liposomes, polymeric carriers, and inorganic nanoparticles—that protect therapeutic proteins and peptides from degradation, extend their circulation time, and enhance their accumulation in tumor tissues [ 33 34 35 36 37 38 Advances in synthetic biology, systems medicine, and multi-omics integration will accelerate the application of proteins and peptides in cancer therapy. Rational design and modular engineering are improving the stability, immunocompatibility, and multifunctionality of new protein scaffolds and synthetic peptides [ 39 40 de novo Peptide- or antibody-based biosensor-based point-of-care diagnostic technologies are being optimized for use in various medical settings, including those with limited infrastructure [ 41 42 Spatial proteomics and single-cell proteogenomics are revealing the microstructural organization of tumor cells and their interactions with the stroma and immune cells [ 43 Technological and conceptual advancements are revolutionizing the function of proteins and peptides in cancer research. These biomolecules represent the spirit of precision cancer care as diagnostic, monitoring, and therapeutic platforms, and they are expected to lead the way in cancer research in the future. Distinct from previous reviews, which have often addressed diagnostic biomarkers or therapeutic peptides and proteins in isolation, this article provides an integrative framework that captures the full translational continuum—from molecular mechanisms to clinical applications. By incorporating recent innovations such as artificial intelligence, nanomedicine, multi-omics integration, spatial proteomics, and synthetic biology, we highlight how proteins and peptides are being repositioned as central pillars of precision oncology. This holistic approach not only synthesizes current knowledge but also identifies emerging directions, thereby offering a unique and forward-looking perspective that fills an important gap in the literature. Given these rapidly advancing clinical and technological developments, there is a clear need for an updated, integrative review that comprehensively summarizes the evolving role of proteins and peptides in oncology. While previous reviews have focused separately on either diagnostic or therapeutic applications, or specific protein types, few have captured the full translational continuum from molecular mechanisms to clinical implementation within the framework of modern precision medicine. This review aims to bridge that gap by providing a cohesive overview of recent progress in the understanding, application, and technological enhancement of proteins and peptides in cancer. We examine their roles in tumor biology, their utility as biomarkers and therapeutic agents, and the impact of emerging innovations such as omics integration, machine learning, and nanotechnology. Through this synthesis, we highlight how proteins and peptides are no longer peripheral components but are increasingly becoming central to the diagnosis, treatment, and long-term management of cancer. Finally, we propose future directions for this field. 2. Proteins and Peptides as Biomarkers in Cancer Cancer remains a leading cause of death globally, largely due to the lack of reliable early diagnostic tools and the difficulty in predicting treatment outcomes. These challenges are compounded by the histological and molecular heterogeneity of cancer—variations in cellular structure, tissue architecture, and molecular profiles that differ not only between cancer types but also within individual tumors. This complexity undermines the accuracy of conventional diagnostic methods and complicates therapeutic decision-making [ 44 45 To address these limitations, researchers are increasingly focused on identifying biomarkers—biological indicators that reflect specific disease states. Among the various biomolecule classes, proteins and peptides stand out as promising candidates due to their functional diversity, detectability in non-invasive biofluids like blood and urine, and relative ease of analysis. Proteins such as enzymes, receptors, and cytokines are often overexpressed or secreted by tumor cells or the surrounding microenvironment. Peptides, typically short amino acid sequences resulting from degradation or abnormal translation, are sensitive to acute physiological changes and useful for real-time monitoring [ 46 47 The ways proteins are released include packaging into extracellular vesicles (EVs), active secretion through secretory vesicles, or leakage during cell death processes such as necrosis or apoptosis. EVs are tiny bubbles made of fat that come from cells and carry proteins, RNA, and lipids, helping cells communicate with each other; researchers are now looking into using them to transport biomarkers [ 48 Once they are released, proteins usually remain stable because of disulfide bonds and their correct shape, and they can also resist being broken down by enzymes, which helps them stay in the bloodstream for a longer time [ 49 50 In contrast, peptides are generally composed of short amino acid sequences derived from proteolytic degradation or aberrant translation. Due to their structural instability, they exhibit a short half-life in circulation [ 51 52 53 54 54 2.1. Protein Biomarkers: Concepts and Clinical Applications Clinically validated protein-based biomarkers such as human epidermal growth factor receptor 2 (HER2), prostate-specific antigen (PSA), cancer antigen 125 (CA125), carcinoembryonic antigen (CEA), and alpha-fetoprotein (AFP) are already widely used for early detection, prognosis, and monitoring of therapeutic efficacy across various cancer types ( Table 1 50 55 47 56 PSA is a protein produced by normal prostate cells, and a sharp rise in PSA levels in the blood may indicate prostate cancer [ 55 57 55 58 CEA is a serum marker primarily used for monitoring colorectal cancer, assessing prognosis, post-surgical follow-up, and tracking disease progression. It is also tested in other cancers, including breast cancer, liver cancer, ovarian cancer, pancreatic cancer, and prostate cancer [ 55 50 46 55 55 55 p53 plays a crucial role in cell cycle regulation and DNA damage response. Cancer cells can bypass normal cell division and grow endlessly due to p53 gene mutations, one of the most prevalent genetic changes in human cancer [ 59 55 60 60 Other protein biomarkers include Ki-67, anaplastic lymphoma kinase (ALK), ROS proto-oncogene 1 (ROS1), DNA mismatch repair (MMR) proteins, neurotrophic receptor tyrosine kinases (NTRK), and programmed death-ligand 1 (PD-L1), all of which are found in various solid tumors [ 50 2.2. Peptide Biomarkers: Concepts and Clinical Applications Peptide biomarkers constitute a distinct class of cancer indicators with unique diagnostic and therapeutic potential. Unlike proteins, they are often short-lived in circulation due to structural instability, yet their favorable properties—including minimal immunogenicity, high tissue penetration, and ease of chemical modification—enable selective tumor targeting and real-time physiological monitoring [ 53 54 Representative peptide biomarkers include pro-brain natriuretic peptide (pro-BNP), which has been applied in cardio-oncology to monitor chemotherapy-related cardiac dysfunction, although it lacks cancer specificity [ 54 55 56 57 In addition to these clinically investigated peptides, research has identified non-coding RNA-derived micropeptides, gastrin-releasing peptide (GRP) and its precursor pro-GRP, and tumor-homing peptides such as iRGD, angiopep2, and PL3, which target tumor-specific receptors and microenvironment components. The therapeutic and diagnostic potential of peptides in oncology is summarized in Table 2 The identification of novel serum peptide biomarkers for early and late recurrence in cholangiocarcinoma (CCA) underscores the significant potential of peptidome approaches to enhance accuracy in classifying cancer recurrence [ 53 53 53 Non-coding RNA-derived micropeptides (MPs) represent a complex class of biomarkers and potential therapeutics, derived from non-coding RNAs. Research is actively exploring their expression patterns in breast cancer subtypes, identifying micropeptides that are differentially expressed in tumor versus non-tumor samples and those exhibiting tumor or subtype specificity [ 61 61 Gastrin-releasing peptide (GRP) is a gastrointestinal hormone present in normal bronchial epithelial cells, pulmonary fibroblasts, central nervous system cells, and neuroendocrine cells. Due to GRP’s short half-life and instability, it is more suitable to detect its precursor, pro-GRP. The concurrent use of pro-GRP and NSE enhances the sensitivity of SCLC detection [ 60 Phage display technology is a powerful and versatile platform for the discovery of novel peptide biomarkers, particularly for early cancer detection [ 54 62 62 62 53 53 Reliance on a single biomarker often leads to limited sensitivity and specificity, resulting in false positives or negatives that undermine diagnostic accuracy and clinical reliability [ 60 53 63 When paired with machine learning algorithms, these data sets enable the construction of cancer-specific diagnostic tools, prognostic models, and predictors of treatment response ( Table 3 64 65 66 67 Advancements in multi-omics integration platforms have further propelled the discovery of innovative biomarkers [ 72 72 73 To be considered clinically useful, protein and peptide biomarkers must fulfill a set of rigorous standards that ensure both their diagnostic and prognostic value [ 74 75 76 12 77 59 78 2.3. Methodologies and Quantitative Analytical Technologies for Protein and Peptide Biomarker Discovery To provide a deeper understanding of how protein and peptide biomarkers are identified, validated, and applied in oncology, it is essential to outline both the methodologies that underpin their discovery and the technologies that enable their precise quantification. Together, these approaches provide a comprehensive framework for translating candidate biomarkers into clinically useful diagnostic and prognostic tools. The discovery of protein and peptide biomarkers relies on a wide range of experimental and computational approaches that enable the identification, validation, and clinical translation of candidates. These methodologies have significantly advanced our ability to improve diagnostic accuracy, therapeutic monitoring, and prognostic assessment in cancer. Mass spectrometry-based approaches such as Matrix-Assisted Laser Desorption/Ionization with Time-of-Flight Mass Spectrometry (MALDI-TOF MS) have proven effective in distinguishing cancer recurrence types based on specific mass signatures. For example, distinct peptide mass fingerprints (PMFs) were identified for early versus late recurrence in cholangiocarcinoma (CCA), where peptides such as KNTC1, DCLK1, ALG10, ATR, and BLM were associated with early recurrence, while SERPINA1, TGFB2, and SERPING1 were implicated in late recurrence [ 53 Non-coding RNA-derived micropeptides (MPs) represent another complex class of biomarkers with potential therapeutic relevance. These micropeptides, derived from non-coding RNAs, exhibit tumor- or subtype-specific expression patterns and influence key cellular processes such as immune regulation, metabolism, and cell signaling [ 61 60 Phage display technology provides a versatile platform for the discovery of tumor-homing and tumor-targeted peptides. These oligopeptides (5–30 amino acids) are identified through affinity binding to overexpressed receptors or tumor microenvironment proteins. Examples include PL3 (Tenascin-C), angiopep2 (LRP1), and iRGD (αvβ3 integrin and Neuropilin-1), all of which exhibit tumor-selective uptake via endocytosis [ 62 53 Multiplex and multi-omics biomarker panels have been developed to overcome the limitations of single biomarkers, which often lack sufficient sensitivity and specificity. Multi-analyte signatures derived from proteomics, transcriptomics, and metabolomics have shown improved accuracy, such as in differentiating low-risk versus high-risk pancreatic cancer patients. In PDAC, panels combining multiple biomarkers outperformed single markers like CA19-9 and CEA in diagnostic performance [ 63 Machine learning approaches are increasingly integrated with multi-omics datasets to construct cancer-specific diagnostic tools, prognostic models, and predictors of therapeutic response. For example, a random forest model trained on The Cancer Genome Atlas (TCGA) data accurately predicted overall survival in breast cancer [ 64 65 66 67 Principles of machine learning for biomarker discovery involve supervised and unsupervised algorithms that can process high-dimensional omics data. Supervised methods, such as random forest or support vector machines, are trained on labeled datasets to classify patients or predict outcomes. Unsupervised methods, such as clustering, identify hidden patterns within biomarker data without prior labels. These algorithms facilitate feature selection, identify clinically relevant signatures, and construct predictive models with high sensitivity and specificity [ 73 To be clinically useful, biomarkers identified through these methodologies must meet rigorous criteria. They should demonstrate cancer type-specific expression patterns, reproducibility across biofluids such as blood or urine, and statistically significant correlations with disease progression, therapeutic response, or prognosis [ 74 75 76 77 78 2.4. Quantitative Analytical Technologies: ELISA, Mass Spectrometry, and Emerging High-Sensitivity Platforms The clinical implementation of protein and peptide biomarkers depends heavily on quantitative analytical technologies that ensure precise and reproducible measurements. Unlike qualitative or semi-quantitative approaches, these methods allow accurate numerical quantification of target molecules, thereby significantly enhancing the reliability of biological interpretations. In oncology, quantitative precision is essential, as biomarker concentrations are closely linked to decisions regarding treatment timing, drug response prediction, and disease staging. Quantitative analytical methods refer to experimental techniques that detect specific proteins or peptides in biological samples and express their abundance in measurable units. These approaches serve as critical tools to improve diagnostic sensitivity and specificity, providing objective data for assessing disease progression, therapeutic response, and patient prognosis. The most widely adopted technologies in both clinical and research settings are as follows ( Table 4 First, enzyme-linked immunosorbent assay (ELISA) quantifies target proteins by employing the binding between antigens and antibodies, coupled with enzyme-mediated signal detection. Known for its high sensitivity and specificity, ELISA is widely used in hospitals and diagnostic laboratories. It has been applied to the clinical quantification of tumor markers such as HER2 and CEA. However, its single-analyte design limits its scalability for multiplexed analysis [ 79 80 Second, multiple reaction monitoring (MRM) is a targeted mass spectrometry approach that uses a triple quadrupole instrument to selectively monitor specific mass-to-charge ( m z 82 83 Third, the proximity extension assay (PEA) involves DNA-tagged antibody pairs that bind to the same protein target. When in proximity, a DNA polymerase-mediated extension generates amplicons that are subsequently quantified by qPCR or next-generation sequencing. PEA is highly sensitive and allows for multiplexed analysis from minimal sample volumes, making it well suited for clinical diagnostics. For example, PEA has been used to simultaneously quantify 92 proteins from the plasma of ovarian cancer patients, aiding early diagnosis and staging efforts [ 84 85 Fourth, cytometry by time of flight (CyTOF) uses metal isotope-labeled antibodies and time-of-flight mass spectrometry to quantify dozens of proteins at single-cell resolution. Unlike fluorescence-based flow cytometry, CyTOF avoids spectral overlaps and enables high-dimensional phenotyping. This technology has been employed to characterize immune cell subsets, infer cell-to-cell interactions within the tumor microenvironment, and predict responses to immunotherapy. Studies have shown that CyTOF can effectively identify immune cell subsets associated with responsiveness to immune checkpoint inhibitors [ 86 These technologies vary in terms of sensitivity, multiplexing capacity, and ease of standardization. For instance, ELISA offers strong clinical utility but is limited in multiplexing. MRM supports simultaneous multi-analyte detection but is costly [ 87 86 88 Emerging technologies are expected to further enhance the sensitivity and applicability of biomarker quantification. Digital ELISA, based on microfluidic platforms and nanoparticle-enhanced detection systems, is being developed to achieve femtogram-level detection in clinical settings. For example, single-molecule array (Simoa) technology offers more than a thousand-fold increase in sensitivity compared to traditional ELISA, making it ideal for early biomarker detection [ 89 90 91 92 93 2.5. Case Studies of Biomarker Discovery Using Omics-Based Approaches The advancement of precision-oriented quantitative analytical technologies has significantly expanded the clinical applicability of omics-based biomarker discovery. An integrative analysis of breast cancer patient chores using data from The Cancer Genome Atlas (TCGA) and the Clinical Proteomic Tumor Analysis Consortium (CPTAC) identified several genes, including GRB7, INPP4B, and MLPH, that are specifically overexpressed in the HER2-positive subtype [ 68 69 In another example, a multi-omics analysis of ovarian cancer tissue and plasma samples identified novel candidate proteins that may overcome the limitations of the conventional biomarker CA125. Specifically, WFDC2 (also known as HE4) and SLPI were found to be differentially expressed at both transcriptomic and proteomic levels and have demonstrated significant predictive power in early diagnosis and disease staging [ 70 71 Taken together, omics-based quantitative diagnostic strategies facilitate an integrative approach that transcends the limitations of single biomarkers. This paradigm is advancing the realization of precision medicine and is expected to provide a robust foundation for prognosis prediction and personalized therapeutic planning across a range of cancer types. 3. Roles of Proteins and Peptides in Tumor Biology Tumorigenesis is driven by the dysregulation of a complex network of intracellular and extracellular signaling pathways, including selective growth and proliferative advantage, control of stress response, vascularization, and immune modulation [ 94 95 96 Well-known signaling pathways involved in cell growth, differentiation, and survival include the mitogen-activated protein kinase (MAPK)/extracellular signal-regulated kinase (ERK) pathway. Mutations in upstream regulators such as RAS and BRAF, associated with this signaling, result in the indefinite proliferation of cancer cells [ 97 98 99 100 101 Figure 1 Deregulation of apoptotic signaling pathways enables tumor cells to evade programmed cell death despite oncogenic stress and genotoxic insults [ 102 103 2+ 104 105 Resistance to apoptosis is further compounded by mutations in tumor suppressor genes such as TP53 [ 106 107 108 In addition to regulating the apoptosis signaling pathway, abnormalities in proteins involved in DNA damage recognition and repair are also important determinants of tumorigenesis. When DNA damage occurs, p53 is phosphorylated by ATR, ATM, and CHK1/2, which leads to cell cycle arrest, activation of DNA damage response (DDR) genes, or apoptosis. During this process, key regulators of the DDR, such as ATR, ATM, CHK1/2, and BRCA1/2, are frequently mutated or inactivated in cancer, resulting in genomic instability and an increased mutational burden [ 108 109 110 111 During tumor growth and progression, specific proteins are secreted into the tumor microenvironment (TME), where they modulate intercellular communication, extracellular matrix (ECM) remodeling, and angiogenesis. Epidermal growth factor (EGF) and vascular endothelial growth factor (VEGF) are canonical examples that orchestrate autocrine and paracrine signaling to support proliferation and neovascularization [ 112 113 EGFR also modulates the PI3K-AKT-mTOR pathway. Activation of PI3K results in the conversion of phosphatidylinositol (4,5)-bisphosphate (PIP2) into phosphatidylinositol (3,4,5)-trisphosphate (PIP3), which serves as a docking site for AKT. Recruitment of AKT to the membrane facilitates its phosphorylation by phosphoinositide-dependent kinase-1 (PDK1) and the mTOR complex 2 (mTORC2), leading to downstream effects on cell proliferation and survival. Moreover, activated AKT phosphorylates tuberous sclerosis complex 2 (TSC2), thereby activating mTOR complex 1 (mTORC1), which regulates cell growth, inhibits autophagy, and promotes the expression of growth factors [ 114 VEGF-A becomes phosphorylated upon binding to vascular endothelial growth factor receptor-2 (VEGFR-2) and specifically binds to PLCγ. This subsequently activates the PKCβ pathway within the PKC family, contributing to vascular endothelial cell proliferation and angiogenesis through MAPK activation [ 115 116 117 Even after tumor growth, various factors are involved in tumor survival. Transforming growth factor-β (TGF-β) represents a context-dependent cytokine with tumor-suppressive functions in early carcinogenesis and pro-tumorigenic effects in later stages. In advanced tumors, TGF-β promotes epithelial–mesenchymal transition (EMT), immunosuppression, and ECM remodeling. In T cells, TGF-β transcriptionally represses genes encoding several key proteins, such as perforin, granzyme, and IFN-γ, thereby negatively regulating the activity of cytotoxic T lymphocytes (CTLs), which destroy tumor cells. In addition, TGF-β inhibits the expression of NKp30 and NKG2D receptors, which not only suppresses the activity of cytolytic natural killer (NK) cells but also reduces IFN-γ secretion due to NK cell accumulation [ 108 Beyond immune modulation, TGF-β also supports the maintenance of cancer stem cell (CSC) phenotypes [ 118 119 120 121 122 As well as in the intracellular pathway, proteins within the tumor microenvironment (TME), including cytokines, chemokines, matrix metalloproteinases (MMPs), and integrins, contribute to metastasis and therapeutic resistance. MMPs such as MMP-2 and MMP-9 degrade the ECM components, facilitating tumor invasion into surrounding stroma and distant organs [ 123 124 Immune evasion is another hallmark of cancer that is mediated by protein-level changes. Tumor cells frequently overexpress immune checkpoint ligands such as PD-L1, which bind PD-1 on T cells and suppress their activity [ 125 126 127 Proteins also serve as clinically relevant biomarkers for cancer detection, prognosis, and therapeutic stratification. HER2, a member of the EGFR family, is frequently overexpressed in breast and gastric cancers, where it drives tumorigenesis through MAPK and PI3K signaling by forming heterodimers with other family members such as HER1/3/4. HER2 amplification correlates with aggressive disease and serves as a target for monoclonal antibodies (trastuzumab), antibody–drug conjugates, and more recently, HER2-specific peptides [ 128 129 59 130 Table 5 Taken together, these findings underscore the multifaceted roles that proteins and peptides play in cancer biology, not only as drivers of cell-intrinsic signaling but also as modulators of intercellular communication, immune surveillance, genomic stability, and the extracellular microenvironment. A deeper understanding of these molecular interactions provides critical insight into tumor pathophysiology and supports the development of more effective, mechanism-based therapeutic strategies. 4. Peptide-Based Therapeutics in Cancer Peptide-based therapeutics have emerged as a promising and rapidly evolving modality in oncology, offering a compelling alternative to conventional small-molecule drugs and large biologics. Their distinct biochemical and structural characteristics, including high target specificity, low immunogenicity, favorable pharmacokinetic profiles, and synthetic accessibility, render them particularly well-suited for modulating intracellular signaling pathways, protein–protein interactions, and tumor-specific receptors. These properties enhance therapeutic efficacy and allow for precise molecular customization in alignment with the biological and clinical characteristics of specific cancer types [ 131 132 The functional classification of anticancer peptides is typically based on their mechanisms of action [ 133 134 135 136 A second category includes pro-apoptotic peptides, which promote programmed cell death by targeting anti-apoptotic proteins such as Bcl-2 or by mimicking endogenous death-inducing signals [ 102 137 2 138 A third group of therapeutic peptides exerts anticancer effects by inhibiting oncogenic signaling cascades [ 139 140 141 142 Table 6 The therapeutic potential of peptides is further underscored by their favorable safety and pharmacokinetic profiles [ 143 139 144 145 Nonetheless, clinical application of peptides is often limited by poor metabolic stability, rapid renal clearance, and low oral bioavailability. Linear peptides are especially vulnerable to degradation by serum proteases, posing challenges in achieving sustained therapeutic concentrations in vivo [ 146 147 148 Another clinically relevant example is TH1902, a sortilin-targeting peptide–docetaxel conjugate currently undergoing evaluation in advanced solid tumors [ 149 To address these limitations, several advanced delivery strategies have been developed. It is well established that linear peptides are readily cleaved by various endogenous proteases, and peptide–drug conjugate (PDC) strategies have shown promise in mitigating this limitation through multiple mechanisms [ 147 148 149 150 139 In addition to conventional conjugation, stimuli-responsive peptide systems have emerged to improve intracellular targeting [ 151 152 153 Nanoparticle-based platforms have also played a critical role in expanding the applicability of therapeutic peptides. Encapsulation within liposomes, polymeric micelles, dendrimers, or inorganic nanoparticles can protect peptides from enzymatic degradation and prolong systemic circulation [ 154 155 Recent advances in synthetic biology and computational design have further accelerated peptide discovery and optimization [ 156 157 158 159 160 Peptides are not only being explored as monotherapies but are also under active investigation in combination with other therapeutic modalities [ 161 162 163 164 165 Table 7 Collectively, peptide-based therapeutics represent a highly adaptable and increasingly integral component of modern cancer therapy [ 166 5. Protein-Based Therapeutics: Monoclonal Antibodies, Fusion Proteins, and Beyond Protein-based therapeutics have emerged as critical tools in the treatment of cancer, autoimmune, and infectious diseases, offering high specificity, biocompatibility, and the ability to modulate complex biological pathways. The field has evolved beyond classical monoclonal antibodies (mAbs) to encompass immune checkpoint inhibitors, engineered fusion proteins, antibody–drug conjugates (ADCs), biobetters, and novel protein scaffolds. The mechanisms underlying these diverse therapeutic modalities are illustrated in Figure 2 Monoclonal antibodies selectively bind to specific antigens expressed on tumor or immune cells, exerting their effects through receptor blockade, ligand neutralization, antibody-dependent cellular cytotoxicity (ADCC), and complement-dependent cytotoxicity (CDC). In addition to direct cytotoxic activity, some mAbs modulate immune signaling or serve as delivery vehicles for therapeutic payloads. Trastuzumab targets the HER2 receptor and has significantly improved outcomes in HER2-positive breast and gastric cancers [ 167 168 167 169 170 171 172 173 174 Immune checkpoint inhibitors restore antitumor immunity by disrupting inhibitory pathways that cancers exploit to evade T cell responses. Clinically validated targets include PD-1, PD-L1, and CTLA-4 [ 175 176 177 178 179 177 178 179 179 180 181 182 Fusion proteins extend the functionality of biologics by combining receptor-binding domains with immunoglobulin Fc fragments, which enhances half-life, solubility, and immune effector engagement. Etanercept, a fusion of the TNF receptor with an IgG1 Fc domain, neutralizes TNF-α and is indicated for rheumatoid arthritis and other inflammatory disorders [ 183 184 185 186 187 ADCs combine the specificity of monoclonal antibodies with the potent cytotoxicity of chemotherapeutic agents via cleavable or non-cleavable linkers. T-DM1 (trastuzumab emtansine) delivers a microtubule inhibitor to HER2-positive cells [ 188 188 189 190 191 192 193 194 195 196 197 Biobetters are modified biologics engineered to outperform their reference products in pharmacokinetics, dosing frequency, or therapeutic efficacy. Common strategies include Fc engineering, PEGylation, and glycoengineering [ 198 199 200 201 202 203 204 205 Oncolytic viruses represent a distinct class of protein-based therapeutics that selectively infect and lyse tumor cells while eliciting systemic antitumor immunity [ 206 207 208 209 210 211 209 212 209 213 Table 8 6. Computational Tools for Anticancer Peptide Prediction The emergence of computational biology has significantly accelerated the discovery and optimization of anticancer peptides (ACPs) [ 214 215 Databases such as Cancer PPD and APD (Antimicrobial Peptide Database) provide curated collections of experimentally validated ACPs, serving as essential resources for model training and benchmarking [ 216 217 Beyond prediction, computational approaches are increasingly being integrated into de novo peptide design pipelines, where generative models and evolutionary algorithms propose novel peptide sequences with desired anticancer activity, stability, and reduced toxicity [ 218 7. Emerging Trends in Protein and Peptide Drug Development Despite the growing interest in protein- and peptide-based therapeutics for cancer treatment, several persistent challenges continue to limit their clinical translation and long-term efficacy. These challenges span biological, technological, and regulatory domains. In this section, we discuss key barriers and explore emerging strategies that may guide future research and application. 7.1. Targeting Specificity and Resistance Achieving tumor-specific delivery remains one of the central obstacles in peptide and protein therapeutics [ 219 220 24 221 222 223 7.2. Stability and Bioavailability The physicochemical instability of peptide- and protein-based drugs remains a major barrier to clinical success [ 224 225 226 227 228 229 230 7.3. Immunogenicity and Manufacturing Challenges Immunogenicity represents a significant concern in protein-based therapeutics. The development of anti-drug antibodies (ADAs), often triggered by protein aggregates or impurities, can compromise efficacy and safety [ 231 232 225 229 233 234 235 230 7.4. Biomarker Reliability and Clinical Translation The identification and application of reliable biomarkers remain a bottleneck in personalized cancer therapy. While biomarkers such as circulating tumor DNA (ctDNA) hold great potential for non-invasive diagnostics, their sensitivity is limited by tumor heterogeneity and low abundance in early-stage cancers [ 236 237 77 238 239 240 7.5. Toward Adaptive and Personalized Therapeutics Advancements in molecular profiling have paved the way for personalized oncology. By stratifying patients based on genetic and molecular markers, treatment efficacy can be optimized while minimizing off-target effects [ 241 242 243 244 245 246 247 7.6. Artificial Intelligence in Drug Design and Clinical Practice Artificial intelligence (AI) transforms both the design and application of protein-based therapeutics. Structure prediction tools such as AlphaFold2 have dramatically accelerated the modeling of protein conformations, facilitating rapid drug design [ 248 249 250 250 251 252 253 254 8. Conclusions Proteins and peptides have firmly positioned themselves at the forefront of cancer research and clinical practice. Their involvement in key molecular pathways that drive tumor initiation, progression, and resistance to therapy underscores their value as both biomarkers and therapeutic agents. Recent technological advancements have facilitated the precise identification and quantification of these biomolecules, while also enabling their use in increasingly sophisticated therapeutic formulations. The convergence of proteomics with other omics platforms, as well as the integration of artificial intelligence and synthetic biology, is redefining the landscape of precision medicine. These innovations are not only improving diagnostic accuracy and therapeutic efficacy but also paving the way for personalized treatment strategies tailored to individual patients. As challenges related to delivery, stability, and immunogenicity continue to be addressed, proteins and peptides are expected to remain central to future efforts in understanding and combating cancer. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.P.P.; investigation, J.H.S., S.H.S., H.R.W., Y.R.A., A.H.Y. and S.Y.K.; writing—original draft preparation, J.H.S., S.H.S., H.R.W., Y.R.A., A.H.Y. and S.Y.K.; writing—review and editing, M.-R.K. and S.P.P.; supervision, S.P.P.; funding acquisition, S.P.P. All authors have read and agreed to the published version of the manuscript. Data Availability Statement Data sharing is not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Lunt N. The global challenge of cancer governance World Med. Health Policy 2023 15 672 681 10.1002/wmh3.577 2. Fan J. Li X. Yu X. Liu Z. Jiang Y. Fang Y. Zong M. Suo C. Man Q. Xiong L. Global burden, risk factor analysis, and prediction study of ischemic stroke, 1990–2030 Neurology 2023 101 e137 e150 10.1212/WNL.0000000000207387 37197995 PMC10351546 3. Sever R. Brugge J.S. Signal transduction in cancer Cold Spring Harb. Perspect. Med. 2015 5 a006098 10.1101/cshperspect.a006098 25833940 PMC4382731 4. Gu M. Ren B. Fang Y. Ren J. Liu X. Wang X. Zhou F. Xiao R. Luo X. You L. Epigenetic regulation in cancer MedComm 2024 5 e495 10.1002/mco2.495 38374872 PMC10876210 5. Sabit H. Cancer Epigenetics: Shifting to More Deep Action Nov. Approaches Cancer Study 2019 2 1 7 10.31031/NACS.2019.02.000548 6. Ciardiello D. Roda D. Gambardella V. Cervantes A. In the literature: April 2022 ESMO Open 2022 7 100479 10.1016/j.esmoop.2022.100479 35472677 PMC9051610 7. Tennant D.A. Durán R.V. Boulahbel H. Gottlieb E. Metabolic transformation in cancer Carcinogenesis 2009 30 1269 1280 10.1093/carcin/bgp070 19321800 8. Liu T. Wang Y. Wang Y. Chan A.M. Multifaceted regulation of PTEN subcellular distributions and biological functions Cancers 2019 11 1247 10.3390/cancers11091247 31454965 PMC6770588 9. Pappas K. Xu J. Zairis S. Resnick-Silverman L. Abate F. Steinbach N. Ozturk S. Saal L.H. Su T. Cheung P. p53 maintains baseline expression of multiple tumor suppressor genes Mol. Cancer Res. 2017 15 1051 1062 10.1158/1541-7786.MCR-17-0089 28483946 PMC5587155 10. Hudler P. Gorsic M. Komel R. Proteomic strategies and challenges in tumor metastasis research Clin. Exp. Metastasis 2010 27 441 451 10.1007/s10585-010-9339-7 20607365 11. Urbiola-Salvador V. Miroszewska D. Jabłońska A. Qureshi T. Chen Z. Proteomics approaches to characterize the immune responses in cancer Biochim. Biophys. Acta-Mol. Cell Res. 2022 1869 119266 10.1016/j.bbamcr.2022.119266 35390423 12. Das S. Dey M.K. Devireddy R. Gartia M.R. Biomarkers in cancer detection, diagnosis, and prognosis Sensors 2023 24 37 10.3390/s24010037 38202898 PMC10780704 13. More A. Kaur S. Bhatele S. Vasdev N. Gupta T. Pawar B. Tekade R.K. Biomarkers: Revolutionizing disease monitoring and therapeutic strategies Public Health and Toxicology Issues Drug Research Academic Press Cambridge, MA, USA 2024 Volume 2 1 25 14. Desai S. Guddati A.K. Carcinoembryonic antigen, carbohydrate antigen 19-9, cancer antigen 125, prostate-specific antigen and other cancer markers: A primer on commonly used cancer markers World J. Oncol. 2023 14 4 14 10.14740/wjon1425 36895994 PMC9990734 15. Diouf O.B. Soumboundou M. Sall C. Proteomics analysis techniques and Bioinformatics approaches for biomarkers discovery Int. J. Biol. Chem. Sci. 2023 17 2943 2957 10.4314/ijbcs.v17i7.26 16. Babaei M. Kashanian S. Lee H.T. Harding F. Proteomics techniques in protein biomarker discovery Quant. Biol. 2024 12 53 69 10.1002/qub2.35 17. Nice E.C. The discovery and validation of novel protein and peptide biomarkers Amino Acids, Peptides and Proteins Ryadnov M. Hudecz F. The Royal Society of Chemistry London, UK 2016 Volume 41 30 52 18. Karagiannis S.N. Hoffmann R.M. Nakamura M. Crescioli S. Bax H.J. Chenoweth A. Cheung A. Tsoka S. Spicer J.F. Lacy K.E. Translational aspects of biologicals: Monoclonal antibodies and antibody-drug conjugates as examples Principles of Translational Science in Medicine Elsevier Amsterdam, The Netherlands 2021 329 350 19. Trail P.A. Antibody drug conjugates as cancer therapeutics Antibodies 2013 2 113 129 10.3390/antib2010113 20. Gogia P. Ashraf H. Bhasin S. Xu Y. Antibody–drug conjugates: A review of approved drugs and their clinical level of evidence Cancers 2023 15 3886 10.3390/cancers15153886 37568702 PMC10417123 21. Vadevoo S.M.P. Gurung S. Khan F. Haque M.E. Gunassekaran G.R. Chi L. Permpoon U. Lee B. Peptide-based targeted therapeutics and apoptosis imaging probes for cancer therapy Arch. Pharmacal Res. 2019 42 150 158 10.1007/s12272-019-01125-0 30756310 22. Rahman M. Alam K. Beg S. Chauhan D. Kumar V. Hafeez A. Sahoo A. Almalki W.H. Ansari M.J. Peptide-based anticancer targeted therapeutics Nanotherapeutics in Cancer Vaccination and Challenges Academic Press Inc. Cambridge, MA, USA 2022 149 166 23. Li C.M. Haratipour P. Lingeman R.G. Perry J.J.P. Gu L. Hickey R.J. Malkas L.H. Novel peptide therapeutic approaches for cancer treatment Cells 2021 10 2908 10.3390/cells10112908 34831131 PMC8616177 24. Vadevoo S.M.P. Gurung S. Lee H.-S. Gunassekaran G.R. Lee S.-M. Yoon J.-W. Lee Y.-K. Lee B. Peptides as multifunctional players in cancer therapy Exp. Mol. Med. 2023 55 1099 1109 10.1038/s12276-023-01016-x 37258584 PMC10318096 25. K Ko J. K Auyeung K. Identification of functional peptides from natural and synthetic products on their anticancer activities by tumor targeting Curr. Med. Chem. 2014 21 2346 2356 10.2174/0929867321666140205132124 24524767 26. Das A. Nyahatkar S. Sonar S. Kalele K. Subramaniyan V. Unlocking the potential of exosomes: A new frontier in liver cancer liquid biopsy J. Liq. Biopsy 2024 6 100166 10.1016/j.jlb.2024.100166 40027309 PMC11863868 27. Xu G. Huang R. Wumaier R. Lyu J. Huang M. Zhang Y. Chen Q. Liu W. Tao M. Li J. Proteomic profiling of serum extracellular vesicles identifies diagnostic signatures and therapeutic targets in breast cancer Cancer Res. 2024 84 3267 3285 10.1158/0008-5472.CAN-23-3998 38900939 PMC11443238 28. Mukherjee A.G. Wanjari U.R. Gopalakrishnan A.V. Bradu P. Biswas A. Ganesan R. Renu K. Dey A. Vellingiri B. El Allali A. Evolving strategies and application of proteins and peptide therapeutics in cancer treatment Biomed. Pharmacother. 2023 163 114832 10.1016/j.biopha.2023.114832 37150032 29. Shah P. Thakkar D. Panchal N. Jha R. Artificial intelligence and machine learning in drug discovery Converging Pharmacy Science and Engineering in Computational Drug Discovery IGI Global Scientific Publishing Hershey, PA, USA 2024 54 75 30. Afrose N. Chakraborty R. Hazra A. Bhowmick P. Bhowmick M. AI-Driven drug discovery and Development Future of AI in Biomedicine and Biotechnology IGI Global Scientific Publishing Hershey, PA, USA 2024 259 277 31. Haga Y. Minegishi Y. Ueda K. Frontiers in mass spectrometry–based clinical proteomics for cancer diagnosis and treatment Cancer Sci. 2023 114 1783 1791 10.1111/cas.15731 36661476 PMC10154896 32. Lin Y.-Y. Gawronski A. Hach F. Li S. Numanagić I. Sarrafi I. Mishra S. McPherson A. Collins C.C. Radovich M. Computational identification of micro-structural variations and their proteogenomic consequences in cancer Bioinformatics 2018 34 1672 1681 10.1093/bioinformatics/btx807 29267878 PMC5946953 33. Peiris P.M. Karathanasis E. Is nanomedicine still promising? Oncotarget 2011 2 430 432 10.18632/oncotarget.295 21677362 PMC3248201 34. Alajmi A.A. Al Otaibi S.G. Alzubidi A.H.A. Alanazi A.A.A. Almorshed A.S.A. Alrbian A.A.M. Advancements in Nanomedicine: Targeted Drug Delivery Systems for Cancer Treatment Int. J. Health Sci. 2023 7 3655 3682 10.53730/ijhs.v7nS1.15291 35. Haider N. Fatima S. Taha M. Rizwanullah M. Firdous J. Ahmad R. Mazhar F. Khan M.A. Nanomedicines in diagnosis and treatment of cancer: An update Curr. Pharm. Des. 2020 26 1216 1231 10.2174/1381612826666200318170716 32188379 36. Esim O. Hascicek C. Lipid-coated nanosized drug delivery systems for an effective cancer therapy Curr. Drug Deliv. 2021 18 147 161 10.2174/1567201817666200512104441 32394833 37. Xiao X. Teng F. Shi C. Chen J. Wu S. Wang B. Meng X. Essiet Imeh A. Li W. Polymeric nanoparticles-Promising carriers for cancer therapy Front. Bioeng. Biotechnol. 2022 10 1024143 10.3389/fbioe.2022.1024143 36277396 PMC9585261 38. Tang T. Huang B. Liu F. Cui R. Zhang M. Sun T. Enhanced delivery of theranostic liposomes through NO-mediated tumor microenvironment remodeling Nanoscale 2022 14 7473 7479 10.1039/D2NR01175A 35503233 39. Höcker B. Zielonka S. Protein engineering & design: Hitting new heights Biol. Chem. 2022 403 453 10.1515/hsz-2022-0139 35355499 40. Zhu C. Zhang C. Zhang T. Zhang X. Shen Q. Tang B. Liang H. Lai L. Rational design of TNFalpha binding proteins based on the de novo designed protein DS119 Protein Sci. 2016 25 2066 2075 10.1002/pro.3029 27571536 PMC5079244 41. Manoto S.L. Lugongolo M. Govender U. Mthunzi-Kufa P. Point of Care Diagnostics for HIV in Resource Limited Settings: An Overview Medicina 2018 54 3 10.3390/medicina54010003 30344234 PMC6037236 42. Chandra P. Personalized biosensors for point-of-care diagnostics: From bench to bedside applications Nanotheranostics 2023 7 210 215 10.7150/ntno.81485 36793349 PMC9925350 43. Smith E.A. Hodges H.C. The Spatial and Genomic Hierarchy of Tumor Ecosystems Revealed by Single-Cell Technologies Trends Cancer 2019 5 411 425 10.1016/j.trecan.2019.05.009 31311656 PMC6689240 44. Djavan B. Eckersberger E. Finkelstein J. Sadri H. Taneja S.S. Lepor H. Prostate-specific antigen testing and prostate cancer screening Prim. Care Clin. Off. Pract. 2010 37 441 459 10.1016/j.pop.2010.05.001 20705192 45. Bast R. Jr. Xu F.-J. Yu Y.-H. Barnhill S. Zhang Z. Mills G. CA 125: The past and the future Int. J. Biol. Markers 1998 13 179 187 10.1177/172460089801300402 10228898 46. Johnson P.J. The role of serum alpha-fetoprotein estimation in the diagnosis and management of hepatocellular carcinoma Clin. Liver Dis. 2001 5 145 159 10.1016/S1089-3261(05)70158-6 11218912 47. Tanwisa T. Raj A. Puttiga A. Gopinathan A. Alex A.T. Role of MYC inhibition in overcoming resistance to HER2-targeted therapies for breast cancer Life Sci. 2025 379 123902 10.1016/j.lfs.2025.123902 40812669 48. Liu Y.-J. Wang C. A review of the regulatory mechanisms of extracellular vesicles-mediated intercellular communication Cell Commun. Signal. 2023 21 77 10.1186/s12964-023-01103-6 37055761 PMC10100201 49. Bechtel T.J. Weerapana E. From structure to redox: The diverse functional roles of disulfides and implications in disease Proteomics 2017 17 1600391 10.1002/pmic.201600391 PMC5367942 28044432 50. Passaro A. Al Bakir M. Hamilton E.G. Diehn M. André F. Roy-Chowdhuri S. Mountzios G. Wistuba I.I. Swanton C. Peters S. Cancer biomarkers: Emerging trends and clinical implications for personalized treatment Cell 2024 187 1617 1635 10.1016/j.cell.2024.02.041 38552610 PMC7616034 51. Al Musaimi O. Lombardi L. Williams D.R. Albericio F. Strategies for improving peptide stability and delivery Pharmaceuticals 2022 15 1283 10.3390/ph15101283 36297395 PMC9610364 52. Hamadou M. Bioactive peptides and metabolic health: A mechanistic review of the impact on insulin sensitivity, lipid profiles, and inflammation Appl. Food Res. 2025 5 101056 10.1016/j.afres.2025.101056 53. Thanasukarn V. Prajumwongs P. Muangritdech N. Loilome W. Namwat N. Klanrit P. Wangwiwatsin A. Charoenlappanit S. Jaresitthikunchai J. Roytrakul S. Discovery of novel serum peptide biomarkers for cholangiocarcinoma recurrence through MALDI-TOF MS and LC-MS/MS peptidome analysis Sci. Rep. 2025 15 2582 10.1038/s41598-025-87124-2 39833435 PMC11746940 54. Rehman H.M. Ahmad S. Sarwar A. Bashir H. Unlocking the potential of tumor-targeting peptides in precision oncology Oncol. Res. 2025 33 1547 1570 10.32604/or.2025.062197 40612874 PMC12215588 55. Tenchov R. Sapra A.K. Sasso J. Ralhan K. Tummala A. Azoulay N. Zhou Q.A. Biomarkers for Early Cancer Detection: A Landscape View of Recent Advancements, Spotlighting Pancreatic and Liver Cancers ACS Pharmacol. Transl. Sci. 2024 7 586 613 10.1021/acsptsci.3c00346 38481702 PMC10928905 56. Lu Z. Wang T. Wang L. Ming J. Research progress on estrogen receptor-positive/progesterone receptor-negative breast cancer Transl. Oncol. 2025 56 102387 10.1016/j.tranon.2025.102387 40222338 PMC12018574 57. Esen B. Seymen H. Tarim K. Koseoglu E. Bolukbasi Y. Falay O. Selcukbiricik F. Molinas Mandel N. Kordan Y. Demirkol M.O. Diagnostic Performance of (68)Ga-PSMA-11 Positron Emission Tomography/Computed Tomography to Monitor Treatment Response in Patients with Metastatic Prostate Cancer: The Concordance Between Biochemical Response and Prostate-specific Membrane Antigen Results Eur. Urol. Focus. 2023 9 832 837 10.1016/j.euf.2023.03.023 37032281 58. Li X. Li Z. Ma H. Li X. Zhai H. Li X. Cheng X. Zhao X. Zhao Z. Hao Z. Ovarian cancer: Diagnosis and treatment strategies Oncol. Lett. 2024 28 441 10.3892/ol.2024.14574 39099583 PMC11294909 59. Kędzierska M. Bańkosz M. Role of Proteins in Oncology: Advances in Cancer Diagnosis, Prognosis, and Targeted Therapy—A Narrative Review J. Clin. Med. 2024 13 7131 10.3390/jcm13237131 39685591 PMC11642550 60. Zhou Y. Tao L. Qiu J. Xu J. Yang X. Zhang Y. Tian X. Guan X. Cen X. Zhao Y. Tumor biomarkers for diagnosis, prognosis and targeted therapy Signal Transduct. Target. Ther. 2024 9 132 10.1038/s41392-024-01823-2 38763973 PMC11102923 61. de Azevedo A.L.K. Gomig T.H.B. Batista M. de Oliveira J.C. Cavalli I.J. Gradia D.F. Ribeiro E.M.d.S.F. Peptidomics and Machine Learning–based Evaluation of Noncoding RNA–Derived Micropeptides in Breast Cancer: Expression Patterns and Functional/Therapeutic Insights Lab. Investig. 2024 104 102150 10.1016/j.labinv.2024.102150 39393531 62. Kondo E. Iioka H. Saito K. Tumor-homing peptide and its utility for advanced cancer medicine Cancer Sci. 2021 112 2118 2125 10.1111/cas.14909 33793015 PMC8177760 63. Kane L.E. Mellotte G.S. Mylod E. O’Brien R.M. O’Connell F. Buckley C.E. Arlow J. Nguyen K. Mockler D. Meade A.D. Diagnostic accuracy of blood-based biomarkers for pancreatic cancer: A systematic review and meta-analysis Cancer Res. Commun. 2022 2 1229 1243 10.1158/2767-9764.CRC-22-0190 36969742 PMC10035398 64. Kallah-Dagadu G. Mohammed M. Nasejje J.B. Mchunu N.N. Twabi H.S. Batidzirai J.M. Singini G.C. Nevhungoni P. Maposa I. Breast cancer prediction based on gene expression data using interpretable machine learning techniques Sci. Rep. 2025 15 7594 10.1038/s41598-025-85323-5 40038307 PMC11880515 65. Kim J.Y. Kim J. Lim Y.-S. Gwak G.-Y. Yeo I. Kim Y. Lee J. Shin D. Lee J.-H. Kim Y. Proteome multimarker panel for the early detection of hepatocellular carcinoma: Multicenter derivation, validation, and comparison ACS Omega 2022 7 29934 29943 10.1021/acsomega.2c02926 36061641 PMC9434733 66. Rifai N. Gillette M.A. Carr S.A. Protein biomarker discovery and validation: The long and uncertain path to clinical utility Nat. Biotechnol. 2006 24 971 983 10.1038/nbt1235 16900146 67. Taylor M.S. Wu C. Fridy P.C. Zhang S.J. Senussi Y. Wolters J.C. Cajuso T. Cheng W.-C. Heaps J.D. Miller B.D. Ultrasensitive detection of circulating LINE-1 ORF1p as a specific multicancer biomarker Cancer Discov. 2023 13 2532 2547 10.1158/2159-8290.CD-23-0313 37698949 PMC10773488 68. Li J. Lu Y. Akbani R. Ju Z. Roebuck P.L. Liu W. Yang J.Y. Broom B.M. Verhaak R.G. Kane D.W. TCPA: A resource for cancer functional proteomics data Nat. Methods 2013 10 1046 1047 10.1038/nmeth.2650 PMC4076789 24037243 69. Wang G. Wu Y. Su Y. Qu N. Chen B. Zhou D. Yuan L. Yin M. Liu M. Zhou W. TCF12-regulated GRB7 facilitates the HER2+ breast cancer progression by activating Notch1 signaling pathway J. Transl. Med. 2024 22 745 10.1186/s12967-024-05536-6 39113057 PMC11304905 70. Hellstrom I. Raycraft J. Hayden-Ledbetter M. Ledbetter J.A. Schummer M. McIntosh M. Drescher C. Urban N. Hellström K.E. The HE4 (WFDC2) protein is a biomarker for ovarian carcinoma Cancer Res. 2003 63 3695 3700 12839961 71. James N.E. Gura M. Woodman M. Freiman R.N. Ribeiro J.R. A bioinformatic analysis of WFDC2 (HE4) expression in high grade serous ovarian cancer reveals tumor-specific changes in metabolic and extracellular matrix gene expression Med. Oncol. 2022 39 71 10.1007/s12032-022-01665-4 35568777 PMC9107348 72. Dar M.A. Arafah A. Bhat K.A. Khan A. Khan M.S. Ali A. Ahmad S.M. Rashid S.M. Rehman M.U. Multiomics technologies: Role in disease biomarker discoveries and therapeutics Brief. Funct. Genom. 2023 22 76 96 10.1093/bfgp/elac017 35809340 73. Al-Tashi Q. Saad M.B. Muneer A. Qureshi R. Mirjalili S. Sheshadri A. Le X. Vokes N.I. Zhang J. Wu J. Machine learning models for the identification of prognostic and predictive cancer biomarkers: A systematic review Int. J. Mol. Sci. 2023 24 7781 10.3390/ijms24097781 37175487 PMC10178491 74. Mahadevarao Premnath S. Zubair M. Laboratory Evaluation of Tumor Biomarkers StatPearls Publishing Treasure Island, FL, USA 2023 37983320 75. Chen J. Zheng N. Accelerating protein biomarker discovery and translation from proteomics research for clinical utility Bioanalysis 2020 12 1469 1481 10.4155/bio-2020-0198 33006485 76. Dobbin K.K. Cesano A. Alvarez J. Hawtin R. Janetzki S. Kirsch I. Masucci G.V. Robbins P.B. Selvan S.R. Streicher H.Z. Validation of biomarkers to predict response to immunotherapy in cancer: Volume II—Clinical validation and regulatory considerations J. Immunother. Cancer 2016 4 77 10.1186/s40425-016-0179-0 27891226 PMC5109653 77. Safari F. Kehelpannala C. Safarchi A. Batarseh A.M. Vafaee F. Biomarker reproducibility challenge: A review of non-nucleotide biomarker discovery protocols from body fluids in breast cancer diagnosis Cancers 2023 15 2780 10.3390/cancers15102780 37345117 PMC10216598 78. Kim J.W. You J. Protein target quantification decision tree Int. J. Proteom. 2013 2013 701247 10.1155/2013/701247 PMC3562589 23401774 79. Hu R. Sou K. Takeoka S. A rapid and highly sensitive biomarker detection platform based on a temperature-responsive liposome-linked immunosorbent assay Sci. Rep. 2020 10 18086 10.1038/s41598-020-75011-x 33093468 PMC7582967 80. Chen Y.-J. Chen M. Hsieh Y.-C. Su Y.-C. Wang C.-H. Cheng C.-M. Kao A.-P. Wang K.-H. Cheng J.-J. Chuang K.-H. Development of a highly sensitive enzyme-linked immunosorbent assay (ELISA) through use of poly-protein G-expressing cell-based microplates Sci. Rep. 2018 8 17868 10.1038/s41598-018-36192-8 30552393 PMC6294806 81. Zhang Q. Ye M. Lin C. Hu M. Wang Y. Lou Y. Kong Q. Zhang J. Li J. Zhang Y. Mass cytometry-based peripheral blood analysis as a novel tool for early detection of solid tumours: A multicentre study Gut 2023 72 996 1006 10.1136/gutjnl-2022-327496 36113977 PMC10086490 82. Picotti P. Aebersold R. Selected reaction monitoring–based proteomics: Workflows, potential, pitfalls and future directions Nat. Methods 2012 9 555 566 10.1038/nmeth.2015 22669653 83. Bantscheff M. Schirle M. Sweetman G. Rick J. Kuster B. Quantitative mass spectrometry in proteomics: A critical review Anal. Bioanal. Chem. 2007 389 1017 1031 10.1007/s00216-007-1486-6 17668192 84. Martínez-Moreno J.M. Llamas-Urbano A. Barbarroja N. Pérez-Sánchez C. Proteomics by qPCR Using the Proximity Extension Assay (PEA) Methods Mol. Biol. 2025 2929 129 142 40601148 10.1007/978-1-0716-4595-6_10 85. Wik L. Nordberg N. Broberg J. Björkesten J. Assarsson E. Henriksson S. Grundberg I. Pettersson E. Westerberg C. Liljeroth E. Proximity extension assay in combination with next-generation sequencing for high-throughput proteome-wide analysis Mol. Cell. Proteom. 2021 20 100168 10.1016/j.mcpro.2021.100168 34715355 PMC8633680 86. Zhang T. Warden A.R. Li Y. Ding X. Progress and applications of mass cytometry in sketching immune landscapes Clin. Transl. Med. 2020 10 e206 10.1002/ctm2.206 33135337 PMC7556381 87. Asleh K. Negri G.L. Spencer Miko S.E. Colborne S. Hughes C.S. Wang X.Q. Gao D. Gilks C.B. Chia S.K. Nielsen T.O. Proteomic analysis of archival breast cancer clinical specimens identifies biological subtypes with distinct survival outcomes Nat. Commun. 2022 13 896 10.1038/s41467-022-28524-0 35173148 PMC8850446 88. Seliger B. Massa C. CyTOF as a suitable tool for stratification and monitoring of cancer patients J. Transl. Med. 2025 23 734 10.1186/s12967-025-06764-0 40598271 PMC12220477 89. Rissin D.M. Kan C.W. Campbell T.G. Howes S.C. Fournier D.R. Song L. Piech T. Patel P.P. Chang L. Rivnak A.J. Single-molecule enzyme-linked immunosorbent assay detects serum proteins at subfemtomolar concentrations Nat. Biotechnol. 2010 28 595 599 10.1038/nbt.1641 20495550 PMC2919230 90. Kan C.W. Tobos C.I. Rissin D.M. Wiener A.D. Meyer R.E. Svancara D.M. Comperchio A. Warwick C. Millington R. Collier N. Digital enzyme-linked immunosorbent assays with sub-attomolar detection limits based on low numbers of capture beads combined with high efficiency bead analysis Lab. Chip 2020 20 2122 2135 10.1039/D0LC00267D 32391827 91. Mani V. Chikkaveeraiah B.V. Patel V. Gutkind J.S. Rusling J.F. Ultrasensitive immunosensor for cancer biomarker proteins using gold nanoparticle film electrodes and multienzyme-particle amplification ACS Nano 2009 3 585 594 10.1021/nn800863w 19216571 PMC2666939 92. Spitzer M.H. Gherardini P.F. Fragiadakis G.K. Bhattacharya N. Yuan R.T. Hotson A.N. Finck R. Carmi Y. Zunder E.R. Fantl W.J. IMMUNOLOGY. An interactive reference framework for modeling a dynamic immune system Science 2015 349 1259425 10.1126/science.1259425 26160952 PMC4537647 93. Liu J. Lichtenberg T. Hoadley K.A. Poisson L.M. Lazar A.J. Cherniack A.D. Kovatich A.J. Benz C.C. Levine D.A. Lee A.V. An Integrated TCGA Pan-Cancer Clinical Data Resource to Drive High-Quality Survival Outcome Analytics Cell 2018 173 400 416.E11 10.1016/j.cell.2018.02.052 29625055 PMC6066282 94. Fouad Y.A. Aanei C. Revisiting the hallmarks of cancer Am. J. Cancer Res. 2017 7 1016 28560055 PMC5446472 95. de Visser K.E. Joyce J.A. The evolving tumor microenvironment: From cancer initiation to metastatic outgrowth Cancer Cell 2023 41 374 403 10.1016/j.ccell.2023.02.016 36917948 96. Cargnello M. Roux P.P. Activation and function of the MAPKs and their substrates, the MAPK-activated protein kinases Microbiol. Mol. Biol. Rev. 2011 75 50 83 10.1128/MMBR.00031-10 21372320 PMC3063353 97. Benmokhtar S. Laraqui A. Hilali F. Bajjou T. El Zaitouni S. Jafari M. Baba W. Elannaz H. Lahlou I.A. Hafsa C. RAS/RAF/MAPK Pathway Mutations as Predictive Biomarkers in Middle Eastern Colorectal Cancer: A Systematic Review Clin. Med. Insights Oncol. 2024 18 11795549241255651 10.1177/11795549241255651 38798959 PMC11128178 98. Xia P. Xu X.-Y. PI3K/Akt/mTOR signaling pathway in cancer stem cells: From basic research to clinical application Am. J. Cancer Res. 2015 5 1602 26175931 PMC4497429 99. Shang S. Hua F. Hu Z.-W. The regulation of β-catenin activity and function in cancer: Therapeutic opportunities Oncotarget 2017 8 33972 10.18632/oncotarget.15687 28430641 PMC5464927 100. Leong K.G. Karsan A. Recent insights into the role of Notch signaling in tumorigenesis Blood 2006 107 2223 2233 10.1182/blood-2005-08-3329 16291593 101. Shi Y. Norberg E. Vakifahmetoglu-Norberg H. Mutant p53 as a Regulator and Target of Autophagy Front. Oncol. 2021 10 607149 10.3389/fonc.2020.607149 33614491 PMC7886977 102. Kirkin V. Joos S. Zornig M. The role of Bcl-2 family members in tumorigenesis Biochim. Biophys. Acta 2004 1644 229 249 10.1016/j.bbamcr.2003.08.009 14996506 103. Qian S. Wei Z. Yang W. Huang J. Yang Y. Wang J. The role of BCL-2 family proteins in regulating apoptosis and cancer therapy Front. Oncol. 2022 12 985363 10.3389/fonc.2022.985363 36313628 PMC9597512 104. Kania E. Roest G. Vervliet T. Parys J.B. Bultynck G. IP(3) Receptor-Mediated Calcium Signaling and Its Role in Autophagy in Cancer Front. Oncol. 2017 7 140 10.3389/fonc.2017.00140 28725634 PMC5497685 105. Hernandez Borrero L.J. El-Deiry W.S. Tumor suppressor p53: Biology, signaling pathways, and therapeutic targeting Biochim. Biophys. Acta Rev. Cancer 2021 1876 188556 10.1016/j.bbcan.2021.188556 33932560 PMC8730328 106. Abuetabh Y. Wu H.H. Chai C. Al Yousef H. Persad S. Sergi C.M. Leng R. DNA damage response revisited: The p53 family and its regulators provide endless cancer therapy opportunities Exp. Mol. Med. 2022 54 1658 1669 10.1038/s12276-022-00863-4 36207426 PMC9636249 107. Shen L. Sun X. Fu Z. Yang G. Li J. Yao L. The Fundamental Role of the p53 Pathway in Tumor Metabolism and Its Implication in Tumor Therapy Clin. Cancer Res. 2012 18 1561 1567 10.1158/1078-0432.CCR-11-3040 22307140 108. Li Q. Qian W. Zhang Y. Hu L. Chen S. Xia Y. A new wave of innovations within the DNA damage response Signal Transduct. Target. Ther. 2023 8 338 10.1038/s41392-023-01548-8 37679326 PMC10485079 109. Hopkins J.L. Lan L. Zou L. DNA repair defects in cancer and therapeutic opportunities Genes. Dev. 2022 36 278 293 10.1101/gad.349431.122 35318271 PMC8973847 110. Man X. Zhang Y. He J. Wang P. Qu W. From bench to bedside: Synthetic strategies and clinical application of PARP inhibitors Bioorg Chem. 2025 163 108761 10.1016/j.bioorg.2025.108761 40706537 111. Nickoloff J.A. Taylor L. Sharma N. Kato T.A. Exploiting DNA repair pathways for tumor sensitization, mitigation of resistance, and normal tissue protection in radiotherapy Cancer Drug Resist. 2021 4 244 263 10.20517/cdr.2020.89 34337349 PMC8323830 112. Stacker S.A. Achen M.G. The VEGF signaling pathway in cancer: The road ahead Chin. J. Cancer 2013 32 297 23419196 10.5732/cjc.012.10319 PMC3845619 113. Wee P. Wang Z. Epidermal Growth Factor Receptor Cell Proliferation Signaling Pathways Cancers 2017 9 52 10.3390/cancers9050052 28513565 PMC5447962 114. He Y. Sun M.M. Zhang G.G. Yang J. Chen K.S. Xu W.W. Li B. Targeting PI3K/Akt signal transduction for cancer therapy Signal Transduct. Target. Ther. 2021 6 425 10.1038/s41392-021-00828-5 34916492 PMC8677728 115. Shibuya M. Vascular Endothelial Growth Factor (VEGF) and Its Receptor (VEGFR) Signaling in Angiogenesis:A Crucial Target for Anti- and Pro-Angiogenic Therapies Genes Cancer 2011 2 1097 1105 10.1177/1947601911423031 22866201 PMC3411125 116. Coso S. Zeng Y. Opeskin K. Williams E.D. Vascular endothelial growth factor receptor-3 directly interacts with phosphatidylinositol 3-kinase to regulate lymphangiogenesis PLoS ONE 2012 7 e39558 10.1371/journal.pone.0039558 22745786 PMC3382126 117. Ono M. Kuwano M. Molecular Mechanisms of Epidermal Growth Factor Receptor (EGFR) Activation and Response to Gefitinib and Other EGFR-Targeting Drugs Clin. Cancer Res. 2006 12 7242 7251 10.1158/1078-0432.CCR-06-0646 17189395 118. French R. Feng Y. Pauklin S. Targeting TGFbeta Signalling in Cancer: Toward Context-Specific Strategies Trends Cancer 2020 6 538 540 10.1016/j.trecan.2020.03.010 32278685 119. Chu X. Tian W. Ning J. Xiao G. Zhou Y. Wang Z. Zhai Z. Tanzhu G. Yang J. Zhou R. Cancer stem cells: Advances in knowledge and implications for cancer therapy Signal Transduct. Target. Ther. 2024 9 170 10.1038/s41392-024-01851-y 38965243 PMC11224386 120. Yang F. Zhang J. Yang H. OCT4, SOX2, and NANOG positive expression correlates with poor differentiation, advanced disease stages, and worse overall survival in HER2(+) breast cancer patients Onco Targets Ther. 2018 11 7873 7881 10.2147/OTT.S173522 30464534 PMC6228048 121. Xue C. Chu Q. Shi Q. Zeng Y. Lu J. Li L. Wnt signaling pathways in biology and disease: Mechanisms and therapeutic advances Signal Transduct. Target. Ther. 2025 10 106 10.1038/s41392-025-02142-w 40180907 PMC11968978 122. Haddadin L. Sun X. Stem Cells in Cancer: From Mechanisms to Therapeutic Strategies Cells 2025 14 538 10.3390/cells14070538 40214491 PMC11988674 123. Kessenbrock K. Plaks V. Werb Z. Matrix metalloproteinases: Regulators of the tumor microenvironment Cell 2010 141 52 67 10.1016/j.cell.2010.03.015 20371345 PMC2862057 124. Desgrosellier J.S. Cheresh D.A. Integrins in cancer: Biological implications and therapeutic opportunities Nat. Rev. Cancer 2010 10 9 22 10.1038/nrc2748 20029421 PMC4383089 125. Chen D.S. Mellman I. Oncology meets immunology: The cancer-immunity cycle Immunity 2013 39 1 10 10.1016/j.immuni.2013.07.012 23890059 126. Munn D.H. Mellor A.L. Indoleamine 2,3 dioxygenase and metabolic control of immune responses Trends Immunol. 2013 34 137 143 10.1016/j.it.2012.10.001 23103127 PMC3594632 127. Ott P.A. Hodi F.S. Robert C. CTLA-4 and PD-1/PD-L1 Blockade: New Immunotherapeutic Modalities with Durable Clinical Benefit in Melanoma Patients Clin. Cancer Res. 2013 19 5300 5309 10.1158/1078-0432.CCR-13-0143 24089443 128. Iqbal N. Iqbal N. Human Epidermal Growth Factor Receptor 2 (HER2) in Cancers: Overexpression and Therapeutic Implications Mol. Biol. Int. 2014 2014 852748 10.1155/2014/852748 25276427 PMC4170925 129. Neve R.M. Lane H.A. Hynes N.E. The role of overexpressed HER2 in transformation Ann. Oncol. 2001 12 (Suppl. 1) S9 S13 10.1093/annonc/12.suppl_1.S9 11521729 130. Saxena P. Trerotola M. Wang T. Li J. Sayeed A. Vanoudenhove J. Adams D.S. Fitzgerald T.J. Altieri D.C. Languino L.R. PSA regulates androgen receptor expression in prostate cancer cells Prostate 2012 72 769 776 10.1002/pros.21482 21956655 PMC3404455 131. Fosgerau K. Hoffmann T. Peptide therapeutics: Current status and future directions Drug Discov. Today 2015 20 122 128 10.1016/j.drudis.2014.10.003 25450771 132. Craik D.J. Fairlie D.P. Liras S. Price D. The Future of Peptide-based Drugs Chem. Biol. Drug Des. 2012 81 136 147 10.1111/cbdd.12055 23253135 133. Chinnadurai R.K. Khan N. Meghwanshi G.K. Ponne S. Althobiti M. Kumar R. Current research status of anti-cancer peptides: Mechanism of action, production, and clinical applications Biomed. Pharmacother. 2023 164 114996 10.1016/j.biopha.2023.114996 37311281 134. Khairkhah N. Namvar A. Bolhassani A. Application of Cell Penetrating Peptides as a Promising Drug Carrier to Combat Viral Infections Mol. Biotechnol. 2023 65 1387 1402 10.1007/s12033-023-00679-1 36719639 PMC9888354 135. Ghorai S.M. Deep A. Magoo D. Gupta C. Gupta N. Cell-Penetrating and Targeted Peptides Delivery Systems as Potential Pharmaceutical Carriers for Enhanced Delivery across the Blood–Brain Barrier (BBB) Pharmaceutics 2023 15 1999 10.3390/pharmaceutics15071999 37514185 PMC10384895 136. Shen X. Pan D. Gong Q. Gu Z. Luo K. Enhancing drug penetration in solid tumors via nanomedicine: Evaluation models, strategies and perspectives Bioact. Mater. 2024 32 445 472 10.1016/j.bioactmat.2023.10.017 37965242 PMC10641097 137. Townsend P.A. Kozhevnikova M.V. Cexus O.N.F. Zamyatnin A.A. Jr. Soond S.M. BH3-mimetics: Recent developments in cancer therapy J. Exp. Clin. Cancer Res. 2021 40 355 10.1186/s13046-021-02157-5 34753495 PMC8576916 138. Burns K.E. McCleerey T.P. Thevenin D. pH-Selective Cytotoxicity of pHLIP-Antimicrobial Peptide Conjugates Sci. Rep. 2016 6 28465 10.1038/srep28465 27334357 PMC4917822 139. Wang L. Wang N. Zhang W. Cheng X. Yan Z. Shao G. Wang X. Wang R. Fu C. Therapeutic peptides: Current applications and future directions Signal Transduct. Target. Ther. 2022 7 48 10.1038/s41392-022-00904-4 35165272 PMC8844085 140. Pearce M.C. Gamble J.T. Kopparapu P.R. O’Donnell E.F. Mueller M.J. Jang H.S. Greenwood J.A. Satterthwait A.C. Tanguay R.L. Zhang X.-K. Induction of apoptosis and suppression of tumor growth by Nur77-derived Bcl-2 converting peptide in chemoresistant lung cancer cells Oncotarget 2018 9 26072 10.18632/oncotarget.25437 29899843 PMC5995251 141. Kawamoto M. Horibe T. Kohno M. Kawakami K. HER2-targeted hybrid peptide that blocks HER2 tyrosine kinase disintegrates cancer cell membrane and inhibits tumor growth in vivo Mol. Cancer Ther. 2013 12 384 393 10.1158/1535-7163.MCT-12-0357 23358664 142. Yi M. Li T. Niu M. Zhang H. Wu Y. Wu K. Dai Z. Targeting cytokine and chemokine signaling pathways for cancer therapy Signal Transduct. Target. Ther. 2024 9 176 10.1038/s41392-024-01868-3 39034318 PMC11275440 143. Xiao W. Jiang W. Chen Z. Huang Y. Mao J. Zheng W. Hu Y. Shi J. Advance in peptide-based drug development: Delivery platforms, therapeutics and vaccines Signal Transduct. Target. Ther. 2025 10 74 10.1038/s41392-024-02107-5 40038239 PMC11880366 144. Chehelgerdi M. Chehelgerdi M. Allela O.Q.B. Pecho R.D.C. Jayasankar N. Rao D.P. Thamaraikani T. Vasanthan M. Viktor P. Lakshmaiya N. Progressing nanotechnology to improve targeted cancer treatment: Overcoming hurdles in its clinical implementation Mol. Cancer 2023 22 169 10.1186/s12943-023-01865-0 37814270 PMC10561438 145. Henninot A. Collins J.C. Nuss J.M. The Current State of Peptide Drug Discovery: Back to the Future? J. Med. Chem. 2018 61 1382 1414 10.1021/acs.jmedchem.7b00318 28737935 146. Tasdemiroglu Y. Gourdie R.G. He J.Q. In vivo degradation forms, anti-degradation strategies, and clinical applications of therapeutic peptides in non-infectious chronic diseases Eur. J. Pharmacol. 2022 932 175192 10.1016/j.ejphar.2022.175192 35981605 PMC9687107 147. Fu C. Yu L. Miao Y. Liu X. Yu Z. Wei M. Peptide-drug conjugates (PDCs): A novel trend of research and development on targeted therapy, hype or hope? Acta Pharm. Sin. B 2023 13 498 516 10.1016/j.apsb.2022.07.020 36873165 PMC9978859 148. Dal Pozzo A. Ni M.H. Esposito E. Dallavalle S. Musso L. Bargiotti A. Pisano C. Vesci L. Bucci F. Castorina M. Novel tumor-targeted RGD peptide-camptothecin conjugates: Synthesis and biological evaluation Bioorg Med. Chem. 2010 18 64 72 10.1016/j.bmc.2009.11.019 19942441 149. Lucana M.C. Arruga Y. Petrachi E. Roig A. Lucchi R. Oller-Salvia B. Protease-Resistant Peptides for Targeting and Intracellular Delivery of Therapeutics Pharmaceutics 2021 13 2065 10.3390/pharmaceutics13122065 34959346 PMC8708026 150. Demeule M. Charfi C. Currie J.C. Larocque A. Zgheib A. Kozelko S. Beliveau R. Marsolais C. Annabi B. TH1902, a new docetaxel-peptide conjugate for the treatment of sortilin-positive triple-negative breast cancer Cancer Sci. 2021 112 4317 4334 10.1111/cas.15086 34314556 PMC8486219 151. Jia R. Teng L. Gao L. Su T. Fu L. Qiu Z. Bi Y. Advances in Multiple Stimuli-Responsive Drug-Delivery Systems for Cancer Therapy Int. J. Nanomed. 2021 16 1525 1551 10.2147/IJN.S293427 PMC7920594 33658782 152. Du J. Lane L.A. Nie S. Stimuli-responsive nanoparticles for targeting the tumor microenvironment J. Control Release 2015 219 205 214 10.1016/j.jconrel.2015.08.050 26341694 PMC4656063 153. Zhang W. Hu X. Shen Q. Xing D. Mitochondria-specific drug release and reactive oxygen species burst induced by polyprodrug nanoreactors can enhance chemotherapy Nat. Commun. 2019 10 1704 10.1038/s41467-019-09566-3 30979885 PMC6461692 154. Chenthamara D. Subramaniam S. Ramakrishnan S.G. Krishnaswamy S. Essa M.M. Lin F.-H. Qoronfleh M.W. Therapeutic efficacy of nanoparticles and routes of administration Biomater. Res. 2019 23 20 10.1186/s40824-019-0166-x 31832232 PMC6869321 155. Cavallaro P.A. De Santo M. Belsito E.L. Longobucco C. Curcio M. Morelli C. Pasqua L. Leggio A. Peptides Targeting HER2-Positive Breast Cancer Cells and Applications in Tumor Imaging and Delivery of Chemotherapeutics Nanomaterials 2023 13 2476 10.3390/nano13172476 37686984 PMC10490457 156. Son A. Park J. Kim W. Lee W. Yoon Y. Ji J. Kim H. Integrating computational design and experimental approaches for next-generation biologics Biomolecules 2024 14 1073 10.3390/biom14091073 39334841 PMC11430650 157. Wang G. Vaisman I.I. Van Hoek M.L. Machine learning prediction of antimicrobial peptides Computational Peptide Science: Methods and Protocols Humana New York, NY, USA 2022 1 37 10.1007/978-1-0716-1855-4_1 PMC9126312 35298806 158. Wu Z. Johnston K.E. Arnold F.H. Yang K.K. Protein sequence design with deep generative models Curr. Opin. Chem. Biol. 2021 65 18 27 10.1016/j.cbpa.2021.04.004 34051682 159. Rouet R. Jackson K.J.L. Langley D.B. Christ D. Next-Generation Sequencing of Antibody Display Repertoires Front. Immunol. 2018 9 118 10.3389/fimmu.2018.00118 29472918 PMC5810246 160. Caschera F. Cell-free protein synthesis platforms for accelerating drug discovery Biotechnol. Notes 2025 6 126 132 10.1016/j.biotno.2025.02.001 40123759 PMC11929937 161. Samec T. Boulos J. Gilmore S. Hazelton A. Alexander-Bryant A. Peptide-based delivery of therapeutics in cancer treatment Mater. Today Bio 2022 14 100248 10.1016/j.mtbio.2022.100248 35434595 PMC9010702 162. Hemmati S. Saeidikia Z. Seradj H. Mohagheghzadeh A. Immunomodulatory Peptides as Vaccine Adjuvants and Antimicrobial Agents Pharmaceuticals 2024 17 201 10.3390/ph17020201 38399416 PMC10892805 163. Peng X. Fang J. Lou C. Yang L. Shan S. Wang Z. Chen Y. Li H. Li X. Engineered nanoparticles for precise targeted drug delivery and enhanced therapeutic efficacy in cancer immunotherapy Acta Pharm. Sin. B 2024 14 3432 3456 10.1016/j.apsb.2024.05.010 39220871 PMC11365410 164. Kang S. Lee S. Park S. iRGD Peptide as a Tumor-Penetrating Enhancer for Tumor-Targeted Drug Delivery Polymers 2020 12 1906 10.3390/polym12091906 32847045 PMC7563641 165. Xie N. Shen G. Gao W. Huang Z. Huang C. Fu L. Neoantigens: Promising targets for cancer therapy Signal Transduct. Target. Ther. 2023 8 9 10.1038/s41392-022-01270-x 36604431 PMC9816309 166. Chen X. Zhao Z. Laster K.V. Liu K. Dong Z. Advancements in therapeutic peptides: Shaping the future of cancer treatment Biochim. Biophys. Acta Rev. Cancer 2024 1879 189197 10.1016/j.bbcan.2024.189197 39413854 167. Espelin C.W. Leonard S.C. Geretti E. Wickham T.J. Hendriks B.S. Dual HER2 Targeting with Trastuzumab and Liposomal-Encapsulated Doxorubicin (MM-302) Demonstrates Synergistic Antitumor Activity in Breast and Gastric Cancer Cancer Res. 2016 76 1517 1527 10.1158/0008-5472.CAN-15-1518 26759238 168. Boku N. HER2-positive gastric cancer Gastric Cancer 2014 17 1 12 10.1007/s10120-013-0252-z 23563986 PMC3889288 169. Specenier P. Vermorken J.B. Cetuximab: Its unique place in head and neck cancer treatment Biologics 2013 7 77 90 23723688 10.2147/BTT.S43628 PMC3665438 170. Salles G. Barrett M. Foa R. Maurer J. O’Brien S. Valente N. Wenger M. Maloney D.G. Rituximab in B-Cell Hematologic Malignancies: A Review of 20 Years of Clinical Experience Adv. Ther. 2017 34 2232 2273 10.1007/s12325-017-0612-x 28983798 PMC5656728 171. Ly S. Nedosekin D. Wong H.K. Review of an Anti-CD20 Monoclonal Antibody for the Treatment of Autoimmune Diseases of the Skin Am. J. Clin. Dermatol. 2023 24 247 273 10.1007/s40257-022-00751-7 36630066 PMC9838371 172. van der Horst H.J. Nijhof I.S. Mutis T. Chamuleau M.E.D. Fc-Engineered Antibodies with Enhanced Fc-Effector Function for the Treatment of B-Cell Malignancies Cancers 2020 12 3041 10.3390/cancers12103041 33086644 PMC7603375 173. Goulet D.R. Chatterjee S. Lee W.-P. Waight A.B. Zhu Y. Mak A.N.-S. Engineering an Enhanced EGFR Engager: Humanization of Cetuximab for Improved Developability Antibodies 2022 11 6 10.3390/antib11010006 35076451 PMC8788544 174. Jurczak W. Cohen S. Illidge T.M. Silva A.D. Amersdorffer J. Scientific rationale underpinning the development of biosimilar rituximab in hematological cancers and inflammatory diseases Future Oncol. 2019 15 4223 4234 10.2217/fon-2019-0430 31718287 175. Yang W. Lei C. Song S. Jing W. Jin C. Gong S. Tian H. Guo T. Immune checkpoint blockade in the treatment of malignant tumor: Current statue and future strategies Cancer Cell Int. 2021 21 589 10.1186/s12935-021-02299-8 34727927 PMC8565029 176. Shih K. Arkenau H.T. Infante J.R. Clinical impact of checkpoint inhibitors as novel cancer therapies Drugs 2014 74 1993 2013 10.1007/s40265-014-0305-6 25344022 PMC4224737 177. Wolchok J.D. Chiarion-Sileni V. Gonzalez R. Grob J.-J. Rutkowski P. Lao C.D. Cowey C.L. Schadendorf D. Wagstaff J. Dummer R. Long-Term Outcomes With Nivolumab Plus Ipilimumab or Nivolumab Alone Versus Ipilimumab in Patients With Advanced Melanoma J. Clin. Oncol. 2022 40 127 137 10.1200/JCO.21.02229 34818112 PMC8718224 178. Lu Y. Zhang X. Ning J. Zhang M. Immune checkpoint inhibitors as first-line therapy for non-small cell lung cancer: A systematic evaluation and meta-analysis Hum. Vaccin. Immunother. 2023 19 2169531 10.1080/21645515.2023.2169531 36715018 PMC10038046 179. Clarke J.M. George D.J. Lisi S. Salama A.K.S. Immune Checkpoint Blockade: The New Frontier in Cancer Treatment Target. Oncol. 2018 13 1 20 10.1007/s11523-017-0549-7 29441437 180. Shi Y. Lei Y. Liu L. Zhang S. Wang W. Zhao J. Zhao S. Dong X. Yao M. Wang K. Integration of comprehensive genomic profiling, tumor mutational burden, and PD-L1 expression to identify novel biomarkers of immunotherapy in non-small cell lung cancer Cancer Med. 2021 10 2216 2231 10.1002/cam4.3649 33655698 PMC7982619 181. Liu D. Cancer biomarkers for targeted therapy Biomark. Res. 2019 7 25 10.1186/s40364-019-0178-7 31807308 PMC6857213 182. Gibney G.T. Weiner L.M. Atkins M.B. Predictive biomarkers for checkpoint inhibitor-based immunotherapy Lancet Oncol. 2016 17 e542 e551 10.1016/S1470-2045(16)30406-5 27924752 PMC5702534 183. Combe B. Update on the use of etanercept across a spectrum of rheumatoid disorders Biologics 2008 2 165 173 10.2147/BTT.S1379 19707351 PMC2721350 184. Trichonas G. Kaiser P.K. Aflibercept for the treatment of age-related macular degeneration Ophthalmol. Ther. 2013 2 89 98 10.1007/s40123-013-0015-2 25135809 PMC4108145 185. Ciombor K.K. Berlin J. Aflibercept—A decoy VEGF receptor Curr. Oncol. Rep. 2014 16 368 10.1007/s11912-013-0368-7 24445500 PMC5145308 186. Hughes-Parry H.E. Cross R.S. Jenkins M.R. The Evolving Protein Engineering in the Design of Chimeric Antigen Receptor T Cells Int. J. Mol. Sci. 2020 21 204 10.3390/ijms21010204 PMC6981602 31892219 187. Voltà-Durán E. Cano-Garrido O. Serna N. López-Laguna H. Sánchez-García L. Pesarrodona M. Sánchez-Chardi A. Mangues R. Villaverde A. Vázquez E. Controlling self-assembling and tumor cell-targeting of protein-only nanoparticles through modular protein engineering Sci. China Mater. 2019 63 147 156 10.1007/s40843-019-9582-9 188. Krop I. Winer E.P. Trastuzumab emtansine: A novel antibody-drug conjugate for HER2-positive breast cancer Clin. Cancer Res. 2014 20 15 20 10.1158/1078-0432.CCR-13-0541 24135146 189. Schwarting R. Behling E. Allen A. Arguello-Guerra V. Budak-Alpdogan T. CD30+ Lymphoproliferative Disorders as Potential Candidates for CD30-Targeted Therapies Arch. Pathol. Lab. Med. 2022 146 415 432 10.5858/arpa.2021-0338-RA 35299246 190. Pettinato M.C. Introduction to Antibody-Drug Conjugates Antibodies 2021 10 42 10.3390/antib10040042 34842621 PMC8628511 191. Maass K.F. Kulkarni C. Betts A.M. Wittrup K.D. Determination of Cellular Processing Rates for a Trastuzumab-Maytansinoid Antibody-Drug Conjugate (ADC) Highlights Key Parameters for ADC Design AAPS J. 2016 18 635 646 10.1208/s12248-016-9892-3 26912181 PMC5256610 192. Su D. Zhang D. Linker Design Impacts Antibody-Drug Conjugate Pharmacokinetics and Efficacy via Modulating the Stability and Payload Release Efficiency Front. Pharmacol. 2021 12 687926 10.3389/fphar.2021.687926 34248637 PMC8262647 193. Dan N. Setua S. Kashyap V.K. Khan S. Jaggi M. Yallapu M.M. Chauhan S.C. Antibody-Drug Conjugates for Cancer Therapy: Chemistry to Clinical Implications Pharmaceuticals 2018 11 32 10.3390/ph11020032 29642542 PMC6027311 194. Zhou Q. Site-Specific Antibody Conjugation for ADC and Beyond Biomedicines 2017 5 64 10.3390/biomedicines5040064 29120405 PMC5744088 195. Tsuchikama K. An Z. Antibody-drug conjugates: Recent advances in conjugation and linker chemistries Protein Cell 2016 9 33 46 10.1007/s13238-016-0323-0 27743348 PMC5777969 196. Shivatare V.S. Huang H.W. Tseng T.H. Chuang P.K. Zeng Y.F. Wong C.H. Probing the Internalization and Efficacy of Antibody-Drug Conjugate via Site-Specific Fc-Glycan Labelling of a Homogeneous Antibody Targeting SSEA-4 Bearing Tumors Isr. J. Chem. 2023 63 10 11 10.1002/ijch.202300042 PMC10861153 38348405 197. Dean A.Q. Luo S. Twomey J.D. Zhang B. Targeting cancer with antibody-drug conjugates: Promises and challenges MAbs 2021 13 1951427 10.1080/19420862.2021.1951427 34291723 PMC8300931 198. Delidakis G. Kim J.E. George K. Georgiou G. Improving Antibody Therapeutics by Manipulating the Fc Domain: Immunological and Structural Considerations Annu. Rev. Biomed. Eng. 2022 24 249 274 10.1146/annurev-bioeng-082721-024500 35363537 PMC9648538 199. Kim H. Alten R. Cummings F. Danese S. D’Haens G. Emery P. Ghosh S. Gilletta de Saint Joseph C. Lee J. Lindsay J.O. Innovative approaches to biologic development on the trail of CT-P13: Biosimilars, value-added medicines, and biobetters MAbs 2021 13 1868078 10.1080/19420862.2020.1868078 33557682 PMC7889098 200. Jo M. Kwon H.S. Lee K.H. Lee J.C. Jung S.T. Engineered aglycosylated full-length IgG Fc variants exhibiting improved FcgammaRIIIa binding and tumor cell clearance MAbs 2018 10 278 289 10.1080/19420862.2017.1402995 29173039 PMC5825196 201. Tobinai K. Klein C. Oya N. Fingerle-Rowson G. A Review of Obinutuzumab (GA101), a Novel Type II Anti-CD20 Monoclonal Antibody, for the Treatment of Patients with B-Cell Malignancies Adv. Ther. 2017 34 324 356 10.1007/s12325-016-0451-1 28004361 PMC5331088 202. Bolli G.B. DeVries J.H. New long-acting insulin analogs: From clamp studies to clinical practice Diabetes Care 2015 38 541 543 10.2337/dc14-2314 25805863 203. Carrera F. Disney A. Molina M. Extended dosing intervals with erythropoiesis-stimulating agents in chronic kidney disease: A review of clinical data Nephrol. Dial. Transplant. 2007 22 iv19 iv30 10.1093/ndt/gfm162 17526546 204. Luo R. Liu H. Cheng Z. Protein scaffolds: Antibody alternatives for cancer diagnosis and therapy RSC Chem. Biol. 2022 3 830 847 10.1039/D2CB00094F 35866165 PMC9257619 205. Jovcevska I. Muyldermans S. The Therapeutic Potential of Nanobodies BioDrugs 2020 34 11 26 10.1007/s40259-019-00392-z 31686399 PMC6985073 206. Peter M. Kühnel F. Oncolytic Adenovirus in Cancer Immunotherapy Cancers 2020 12 3354 10.3390/cancers12113354 33202717 PMC7697649 207. Hemminki O. Dos Santos J.M. Hemminki A. Oncolytic viruses for cancer immunotherapy J. Hematol. Oncol. 2020 13 84 10.1186/s13045-020-00922-1 32600470 PMC7325106 208. Zhang B. Cheng P. Improving antitumor efficacy via combinatorial regimens of oncolytic virotherapy Mol. Cancer 2020 19 158 10.1186/s12943-020-01275-6 33172438 PMC7656670 209. Tian Y. Xie D. Yang L. Engineering strategies to enhance oncolytic viruses in cancer immunotherapy Signal Transduct. Target. Ther. 2022 7 117 10.1038/s41392-022-00951-x 35387984 PMC8987060 210. Conry R.M. Westbrook B. McKee S. Norwood T.G. Talimogene laherparepvec: First in class oncolytic virotherapy Hum. Vaccin. Immunother. 2018 14 839 846 10.1080/21645515.2017.1412896 29420123 PMC5893211 211. Kaufman H.L. Shalhout S.Z. Iodice G. Talimogene Laherparepvec: Moving from First-In-Class to Best-In-Class Front. Mol. Biosci. 2022 9 834841 10.3389/fmolb.2022.834841 35274007 PMC8901478 212. Heidbuechel J.P.W. Engeland C.E. Oncolytic viruses encoding bispecific T cell engagers: A blueprint for emerging immunovirotherapies J. Hematol. Oncol. 2021 14 63 10.1186/s13045-021-01075-5 33863363 PMC8052795 213. Kuryk L. Bertinato L. Staniszewska M. Pancer K. Wieczorek M. Salmaso S. Caliceti P. Garofalo M. From Conventional Therapies to Immunotherapy: Melanoma Treatment in Review Cancers 2020 12 3057 10.3390/cancers12103057 33092131 PMC7589099 214. Bethany M.C. Iegre J. Daniel H.O.D. Maria Ölwegård H. David R.S. Peptides as a platform for targeted therapeutics for cancer: Peptide–drug conjugates (PDCs) Chem. Soc. Rev. 2021 50 1480 1494 33346298 10.1039/d0cs00556h 215. Jun S.-Y. Kim D.-S. Kim Y.-S. Expanding the Therapeutic Window of EGFR-Targeted PE24 Immunotoxin for EGFR-Overexpressing Cancers by Tailoring the EGFR Binding Affinity Int. J. Mol. Sci. 2022 23 15820 10.3390/ijms232415820 36555466 PMC9779439 216. Yue J. Li T. Xu J. Chen Z. Li Y. Liang S. Liu Z. Wang Y. Discovery of anticancer peptides from natural and generated sequences using deep learning Int. J. Biol. Macromol. 2025 290 138880 10.1016/j.ijbiomac.2024.138880 39706427 217. Liu Y. Zhao T. Ju W. Shi S. Materials discovery and design using machine learning J. Mater. 2017 3 159 177 10.1016/j.jmat.2017.08.002 218. Ramazi S. Mohammadi N. Allahverdi A. Khalili E. Abdolmaleki P. A review on antimicrobial peptides databases and the computational tools Database 2022 2022 baac011 10.1093/database/baac011 35305010 PMC9216472 219. Manavalan B. Basith S. Shin T.H. Choi S. Kim M.O. Lee G. MLACP: Machine-learning-based prediction of anticancer peptides Oncotarget 2017 8 77121 10.18632/oncotarget.20365 29100375 PMC5652333 220. Chen Z. Wang R. Guo J. Wang X. The role and future prospects of artificial intelligence algorithms in peptide drug development Biomed. Pharmacother. 2024 175 116709 10.1016/j.biopha.2024.116709 38713945 221. Abdellatif M.K. Hassanin I. Mahmoud Y.S. Teleb M. Bekhit A.A. Khattab S.N. Protein and Peptide-based Nanoparticles as an emerging strategy to tackle cancer drug resistance Alex. J. Sci. Technol. 2023 1 1 21 10.21608/ajst.2023.206740.1008 222. Rodríguez-Nava C. Ortuño-Pineda C. Illades-Aguiar B. Flores-Alfaro E. Leyva-Vázquez M.A. Parra-Rojas I. del Moral-Hernández O. Vences-Velázquez A. Cortés-Sarabia K. Alarcón-Romero L.d.C. Mechanisms of Action and Limitations of Monoclonal Antibodies and Single Chain Fragment Variable (scFv) in the Treatment of Cancer Biomedicines 2023 11 1610 10.3390/biomedicines11061610 37371712 PMC10295864 223. McKertish C.M. Kayser V. Current Protein Conjugation Strategies and Pioneering Anti-Cancer Applications Discov. Med. 2023 35 697 714 10.24976/Discov.Med.202335178.67 37811610 224. Brown T.D. Whitehead K.A. Mitragotri S. Materials for oral delivery of proteins and peptides Nat. Rev. Mater. 2020 5 127 148 10.1038/s41578-019-0156-6 225. Jerath G. Darvin P. Christian Y. Trivedi V. Kumar T.S. Ramakrishnan V. Delivery of small molecules by syndiotactic peptides for breast cancer therapy Mol. Pharm. 2022 19 2877 2887 10.1021/acs.molpharmaceut.2c00238 35839086 226. Lamers C. Overcoming the shortcomings of peptide-based therapeutics Future Drug Discov. 2022 4 FDD75 10.4155/fdd-2022-0005 227. Sonju J.J. Dahal A. Jois S.D. Liposome nanocarriers for peptide drug delivery Peptide Therapeutics: Fundamentals of Design, Development, and Delivery Springer Cham, Switzerland 2022 203 235 228. Sun W. Lu Y. Gu Z. Advances in anticancer protein delivery using micro-/nanoparticles Part. Part. Syst. Charact. 2014 31 1204 1222 10.1002/ppsc.201400140 27642232 PMC5026193 229. Zhu C. Mu J. Liang L. Nanocarriers for intracellular delivery of proteins in biomedical applications: Strategies and recent advances J. Nanobiotechnol. 2024 22 688 10.1186/s12951-024-02969-5 39523313 PMC11552240 230. Sun Q. Yang Z. Qi X. Design and application of hybrid polymer-protein systems in cancer therapy Polymers 2023 15 2219 10.3390/polym15092219 37177365 PMC10181109 231. Han H. Santos H.A. Nano-and Micro-Platforms in Therapeutic Proteins Delivery for Cancer Therapy: Materials and Strategies Adv. Mater. 2024 36 2409522 10.1002/adma.202409522 39263818 232. Sikder S. Gote V. Alshamrani M. Sicotte J. Pal D. Long-term delivery of protein and peptide therapeutics for cancer therapies Expert. Opin Drug Deliv. 2019 16 1113 1131 31498012 10.1080/17425247.2019.1662785 233. Moncalvo F. Martinez Espinoza M.I. Cellesi F. Nanosized delivery systems for therapeutic proteins: Clinically validated technologies and advanced development strategies Front. Bioeng. Biotechnol. 2020 8 89 10.3389/fbioe.2020.00089 32117952 PMC7033645 234. Kuhlmann M. Covic A. The protein science of biosimilars Nephrol Dial Transplant 2006 21 v4 v8 10.1093/ndt/gfl474 16959791 235. Khakpour S. Hosano N. Moosavi-Nejad Z. Farajian A.A. Hosano H. Advancing tumor therapy: Development and utilization of protein-based nanoparticles Pharmaceutics 2024 16 887 10.3390/pharmaceutics16070887 39065584 PMC11279530 236. Ren A.H. Fiala C.A. Diamandis E.P. Kulasingam V. Pitfalls in cancer biomarker discovery and validation with emphasis on circulating tumor DNA Cancer Epidemiol. Biomark. Prev. 2020 29 2568 2574 10.1158/1055-9965.EPI-20-0074 32277003 237. Arisi M.F. Dotan E. Fernandez S.V. Circulating Tumor DNA in Precision Oncology and Its Applications in Colorectal Cancer Int. J. Mol. Sci. 2022 23 4441 10.3390/ijms23084441 35457259 PMC9024503 238. Gasparri R. Sabalic A. Spaggiari L. The early diagnosis of lung cancer: Critical gaps in the discovery of biomarkers J. Clin. Med. 2023 12 7244 10.3390/jcm12237244 38068296 PMC10707119 239. Yin X. Song Y. Deng W. Blake N. Luo X. Meng J. Potential predictive biomarkers in antitumor immunotherapy: Navigating the future of antitumor treatment and immune checkpoint inhibitor efficacy Front. Oncol. 2024 14 1483454 10.3389/fonc.2024.1483454 39655071 PMC11625675 240. Zakari S. Niels N.K. Olagunju G.V. Nnaji P.C. Ogunniyi O. Tebamifor M. Israel E.N. Atawodi S.E. Ogunlana O.O. Emerging biomarkers for non-invasive diagnosis and treatment of cancer: A systematic review Front. Oncol. 2024 14 1405267 10.3389/fonc.2024.1405267 39132504 PMC11313249 241. Jürgensmeier J.M. Eder J.P. Herbst R.S. New Strategies in Personalized Medicine for Solid Tumors: Molecular Markers and Clinical Trial Designs Clin. Cancer Res. 2014 20 4425 4435 10.1158/1078-0432.CCR-13-0753 25183480 PMC5369358 242. Bowes A.L. Tarabichi M. Pillay N. Van Loo P. Leveraging single-cell sequencing to unravel intratumour heterogeneity and tumour evolution in human cancers J. Pathol. 2022 257 466 478 10.1002/path.5914 35438189 PMC9322001 243. Gilson P. Merlin J.-L. Harlé A. Deciphering Tumour Heterogeneity: From Tissue to Liquid Biopsy Cancers 2022 14 1384 10.3390/cancers14061384 35326534 PMC8946040 244. Raufaste-Cazavieille V. Santiago R. Droit A. Multi-omics analysis: Paving the path toward achieving precision medicine in cancer treatment and immuno-oncology Front. Mol. Biosci. 2022 9 962743 10.3389/fmolb.2022.962743 36304921 PMC9595279 245. Abil Z. Xiong X. Zhao H. Synthetic Biology for Therapeutic Applications Mol. Pharm. 2015 12 322 331 10.1021/mp500392q 25098838 PMC4319687 246. Cubillos-Ruiz A. Guo T. Sokolovska A. Miller P.F. Collins J.J. Lu T.K. Lora J.M. Engineering living therapeutics with synthetic biology Nat. Rev. Drug Discov. 2021 20 941 960 10.1038/s41573-021-00285-3 34616030 247. Du W. Elemento O. Cancer systems biology: Embracing complexity to develop better anticancer therapeutic strategies Oncogene 2015 34 3215 3225 10.1038/onc.2014.291 25220419 248. Singh K. Prabhu A. Kaur N. Advancements in AI for Protein Structure Prediction: Impact on Cancer Drug Discovery and Development: A Systematic Review Curr. Top. Chem. 2025 5 E29504023345000 10.2174/0129504023345000250113104248 249. Bhattarai S. Tayara H. Chong K.T. Advancing peptide-based cancer therapy with AI: In-depth analysis of state-of-the-art AI models J. Chem. Inf. Model. 2024 64 4941 4957 10.1021/acs.jcim.4c00295 38874445 250. Garg P. Singhal G. Kulkarni P. Horne D. Salgia R. Singhal S.S. Artificial intelligence–driven computational approaches in the development of anticancer drugs Cancers 2024 16 3884 10.3390/cancers16223884 39594838 PMC11593155 251. Rakha E.A. Toss M. Shiino S. Gamble P. Jaroensri R. Mermel C.H. Chen P.-H.C. Current and future applications of artificial intelligence in pathology: A clinical perspective J. Clin. Pathol. 2021 74 409 414 10.1136/jclinpath-2020-206908 32763920 252. Pham T.D. Teh M.-T. Chatzopoulou D. Holmes S. Coulthard P. Artificial Intelligence in Head and Neck Cancer: Innovations, Applications, and Future Directions Curr. Oncol. 2024 31 5255 5290 10.3390/curroncol31090389 39330017 PMC11430806 253. Lotter W. Hassett M.J. Schultz N. Kehl K.L. Van Allen E.M. Cerami E. Artificial Intelligence in Oncology: Current Landscape, Challenges, and Future Directions Cancer Discov. 2024 14 711 726 10.1158/2159-8290.CD-23-1199 38597966 PMC11131133 254. Damane B.P. Mkhize-Kwitshana Z.L. Kgokolo M.C. Luvhengo T. Dlamini Z. Applying artificial intelligence prediction tools for advancing precision oncology in immunotherapy: Future perspectives in personalized care Artificial Intelligence and Precision Oncology: Bridging Cancer Research and Clinical Decision Support Springer Cham, Switzerland 2023 239 258 Figure 1 Key signaling pathway mutations driving tumor development. Figure 2 Representative mechanisms of action of major protein-based cancer therapeutics. ( A B C D E cancers-17-03031-t001_Table 1 Table 1 Representative protein-based cancer biomarkers. Biomarker Cancer Type Clinical Application Limitations HER2 47 55 Breast, gastric Prognostic/predictive marker; guides trastuzumab therapy Resistance in some patients ER/PR 56 Breast Prognostic; endocrine therapy guidance PR loss linked to resistance PSA 55 57 Prostate Early detection and monitoring Elevated in benign conditions CA125/HE4 55 58 Ovarian Monitor response and recurrence Low early sensitivity, elevated in benign states CEA 50 55 Colorectal, GI, breast, liver, pancreatic Prognosis, recurrence monitoring Low specificity, expressed in non-tumor tissues AFP 46 55 Hepatocellular carcinoma, germ cell tumors Diagnosis and prognosis Elevated in hepatitis, cirrhosis CA19-9/CA72-4 55 Pancreatic, gastric, colorectal Diagnosis and monitoring Low sensitivity, false positives in cholestasis p53 55 59 Lung, colorectal, pancreatic Predictive marker; chemotherapy resistance Mutations reduce therapy response LDH 60 Solid tumors Prognostic marker; reflects tumor burden Non-cancer elevations NSE 60 Small cell lung cancer Staging, relapse prediction Low specificity cancers-17-03031-t002_Table 2 Table 2 Representative peptide-based cancer biomarkers. Peptide Biomarker Cancer Type Clinical Application Limitations Pro-BNP [ 54 Cardio-oncology Monitor chemotherapy-related cardiac dysfunction Not cancer-specific Hepcidin [ 55 Hepatocellular carcinoma Iron metabolism regulation Confounded by inflammation Chromogranin A [ 56 Neuroendocrine tumors Diagnosis and monitoring False positives in renal failure Thymosin β4 [ 57 Breast, colon Linked to invasion and metastasis Limited clinical validation GRP/Pro-GRP [ 60 Small cell lung cancer Detection in combination with NSE Short half-life; requires precursor stability Micropeptides [ 61 Breast cancer subtypes Subtype-specific diagnostic/therapeutic potential Still experimental, limited clinical translation Tumor-homing peptides (e.g., iRGD, Angiopep2, PL3) [ 62 Gastric, PDAC, prostate (depending on target) Tumor-targeted imaging and drug delivery Preclinical stage; limited validation in patients cancers-17-03031-t003_Table 3 Table 3 Representative case studies of omics-based approaches for biomarker discovery. Cancer Type Biomarker(s) Omics Approach Detection/Quantification Method Breast cancer (HER2-positive subtype) GRB7, INPP4B, MLPH Integrative analysis of TCGA (transcriptomics) and CPTAC (proteomics) RNA sequencing for transcriptomic profiling and LC–MS/MS-based quantitative proteomics for protein validation [ 68 69 Ovarian cancer WFDC2 (HE4), SLPI Multi-omics analysis of tumor tissue and plasma (transcriptomics + proteomics) RNA-seq for transcriptomic profiling, LC–MS/MS for proteomic validation, and ELISA for plasma protein quantification [ 70 71 cancers-17-03031-t004_Table 4 Table 4 Major quantitative techniques for protein and peptide biomarker analysis. Technique Detection Principle Key Advantages Typical Technical Limitations Representative Examples Potential Clinical Limitations ELISA Enzyme-linked antigen–antibody interaction Clinically validated; high sensitivity [ 79 Limited to single-analyte; dependent on antibody quality Quantification of HER2 and CEA in clinical diagnostics [ 79 80 Cross-reactivity; low scalability for multiplexing MS (MRM/SRM) Targeted mass spectrometry of specific peptides [ 81 Multiplex capability; high specificity [ 82 Requires advanced instrumentation and technical expertise GP73, AFP, and DKK1 panels for hepatocellular carcinoma plasma [ 82 83 Limited availability in routine clinical laboratories; need for standardization PEA DNA-tagged antibody proximity extension and qPCR Ultra-sensitive; minimal sample volume; multiplexing [ 84 Proprietary reagents; restricted accessibility 92-protein plasma panel for ovarian cancer diagnosis [ 84 85 High cost and dependence on proprietary kits may limit adoption CyTOF Metal isotope-labeled antibodies with mass cytometry Single-cell resolution; high-dimensional profiling [ 86 High cost; lower throughput than flow cytometry Immune cell subset profiling in tumor microenvironment; prediction of response to checkpoint inhibitors [ 86 Complex data analysis; limited feasibility for routine clinical use cancers-17-03031-t005_Table 5 Table 5 Tumor-related proteins and their roles in cancer progression. Protein/Peptide Role Associated Pathways and Functions Protein Bcl-2 Inhibitor of apoptosis Suppresses mitochondrial apoptosis and enhances cell survival by interacting with proteins like Beclin-1. p53 Genomic gatekeeper Senses DNA damage and activates genes for cell cycle arrest, DNA repair, and apoptosis. Mutations lead to a loss of these protective functions. ATR, ATM, CHK1/2, BRCA1/2 Regulators of the DNA damage response (DDR) Control DNA repair processes. Their mutation or inactivation can lead to genomic instability. EGF, VEGF, TGF-β Cell signaling molecules EGF and VEGF promote cell growth and angiogenesis. TGF-β acts as a tumor suppressor in early stages but promotes tumor progression in later stages. EGFR, VEGFR-2, HER2 Receptor tyrosine kinases EGFR and HER2 activate the MAPK and PI3K pathways. VEGFR-2 promotes the proliferation of vascular endothelial cells. Nanog, Sox2, Oct4 Cancer stem cell (CSC) maintainers Sustain the self-renewal and tumor-initiating capacity of CSCs, contributing to tumor recurrence. MMP-2, MMP-9, Integrins Promoters of metastasis MMPs degrade the extracellular matrix (ECM) to facilitate invasion, while Integrins mediate cell adhesion and migration to promote metastasis. PD-L1, IDO Mediators of immune evasion PD-L1 suppresses T-cell activity to help cancer cells evade immune attacks. IDO impairs the function of immune cells. PSA Prostate cancer biomarker A serum biomarker for prostate cancer that also modulates the androgen receptor and AKT pathways. Peptide Emerging peptide-based approaches Therapeutic modulators Mimic or inhibit DDR proteins to make cancer cells more sensitive to DNA-damaging agents. HER2-specific peptides Targeted therapeutics Used as a therapeutic strategy to target HER2-positive tumors. Immune-inhibitory peptides Immunotherapeutics Used to block immune-inhibitory interactions to modulate anti-tumor immunity. cancers-17-03031-t006_Table 6 Table 6 Therapeutic peptide classes and their mechanisms of action. Peptide Type Primary Function Representative Mechanism Examples Cell-penetrating peptides (CPPs) Intracellular delivery of therapeutic payloads Cross plasma membranes and transport small molecules, proteins, or nucleic acids TAT [ 135 134 Pro-apoptotic peptides Induction of programmed cell death Target anti-apoptotic proteins (e.g., Bcl-2), promote mitochondrial membrane permeabilization BH3-mimetic peptides [ 137 Inhibitory peptides Interruption of oncogenic signaling Disrupt ligand-receptor interactions or downstream signaling pathways HER2-blocking peptides [ 140 141 cancers-17-03031-t007_Table 7 Table 7 Challenges and strategies in peptide therapeutics. Limitation Solution Example/Technology Proteolytic degradation Structural modification Cyclization, D-amino acid substitution, N-terminal capping [ 146 147 Poor bioavailability Alternative delivery systems Nanoparticles (liposomes, dendrimers), PEGylation [ 152 Short plasma half-life Enhanced pharmacokinetics Backbone stabilization, conjugation with long-circulating carriers [ 148 Lack of tumor specificity Targeted delivery platforms Peptide–drug conjugates (PDCs), tumor-penetrating peptides [ 164 165 cancers-17-03031-t008_Table 8 Table 8 Comparison of major classes of protein-based therapeutics. Monoclonal antibodies are presented with subcategories, including conventional anti-cancer antibodies and immune checkpoint inhibitors. Therapeutic Class Representative Drugs Mechanism of Action Indications Advantages Limitations Refs. Monoclonal antibodies (anti-cancer targets) -Trastuzumab Antigen-specific binding, ADCC/CDC activation Breast cancer, CRC High specificity, stability Drug resistance, limited tissue penetration [ 167 168 169 Monoclonal antibodies (immune checkpoint inhibitors) -Nivolumab Blocking T cell inhibitory pathways (PD-1/PD-L1, CTLA-4) Melanoma, NSCLC Long-term survival, broad tumor scope Limited responders, immune-related AEs [ 175 176 177 178 179 Fusion proteins -Etanercept Ligand trapping, Fc fusion to extend half-life Autoimmune diseases, anti-angiogenesis Improved in vivo stability Potential immunogenicity [ 183 184 185 Antibody–drug conjugates (ADCs) -T-DM1 Antibody-targeted cytotoxic drug delivery HER2+ breast cancer, etc. High precision therapy Linker stability, toxicity concerns [ 188 189 190 191 192 193 Biobetters -Obinutuzumab Enhanced pharmacokinetics via structural modifications Lymphoma, anemia Reduced dosing frequency, improved efficacy High development cost, patent issues [ 198 199 200 201 202 203 ",
  "metadata": {
    "Title of this paper": "Applying artificial intelligence prediction tools for advancing precision oncology in immunotherapy: Future perspectives in personalized care",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468110/"
  }
}