{
  "title": "Paper_381",
  "abstract": "pmc BMC Med Genomics BMC Med Genomics 573 bmcmedgeno BMC Medical Genomics 1755-8794 BMC PMC12482394 PMC12482394.1 12482394 12482394 41029455 10.1186/s12920-025-02215-3 2215 1 Research Advanced glycation end-product receptor gene (RAGE) polymorphisms in patients with acute coronary syndrome – a case-control study in the Polish population Gutowska Klaudia 1 2 Ambroziak Michał 3 Podraza Jakub 4 5 Puzianowska-Kuźnicka Monika 4 6 Czajkowski Krzysztof 1 Budaj Andrzej 3 http://orcid.org/0000-0001-8632-4927 Kuryłowicz Alina akurylowicz@imdik.pan.pl 4 7 1 https://ror.org/04p2y4s44 grid.13339.3b 0000 0001 1328 7408 II Department of Obstetrics and Gynecology, Warsaw Medical University, 2 https://ror.org/04p2y4s44 grid.13339.3b 0000 0001 1328 7408 Doctoral School, Medical University of Warsaw, 3 https://ror.org/05ef11p71 grid.413373.1 0000 0004 4652 9540 Department of Cardiology, Medical Centre of Postgraduate Education, Grochowski Hospital, 4 https://ror.org/01dr6c206 grid.413454.3 0000 0001 1958 0162 Department of Human Epigenetics, Mossakowski Medical Research Centre, Polish Academy of Sciences, 5 https://ror.org/052g8jq94 grid.7080.f 0000 0001 2296 0625 Deparment of Veterinary Medicine, Autonomous University of Barcelona, 6 https://ror.org/01cx2sj34 grid.414852.e 0000 0001 2205 7719 Department of Geriatrics and Gerontology, Medical Centre of Postgraduate Education, 7 https://ror.org/01cx2sj34 grid.414852.e 0000 0001 2205 7719 Department of General Medicine and Geriatric Cardiology, Medical Centre of Postgraduate Education, 30 9 2025 2025 18 478351 143 24 4 2025 18 8 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background The development of coronary artery disease (CAD) is the result of complex interactions between environmental and genetic factors. While the former is well known, the genetic factors that predispose individuals to the development of CAD are still under investigation. The aim of our study was to investigate whether single nucleotide polymorphisms (SNPs) in the gene encoding the receptor for advanced glycation end products ( RAGE Methods Two RAGE 2 U Results For the rs184003 G/T polymorphism, the frequency of genotypes containing the T allele (GT + TT) was significantly greater in patients with a history of ACS than in healthy age- and sex-matched controls (28.87% vs. 11.25%, p p p p Conclusions Our findings suggest that the rs184003 SNP in the RAGE Supplementary Information The online version contains supplementary material available at 10.1186/s12920-025-02215-3. Keywords Acute coronary syndrome (ACS) Coronary artery disease (CAD) Genetic predisposition Receptor for advanced glycation end products (RAGE) Single nucleotide polymorphisms (SNP) https://doi.org/10.13039/501100004281 Narodowe Centrum Nauki 2018/31/B/NZ5/01556 2018/31/B/NZ5/01556 2018/31/B/NZ5/01556 Gutowska Klaudia Puzianowska-Kuźnicka Monika Kuryłowicz Alina pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Persistent accumulation of vessel-occluding plaques in the intimal layer of medium- and large-sized arteries initiates damage to the endothelial cells responsible for the regulation of vascular integrity and barrier function [ 1 2 3 4 5 6 An increasing number of studies have suggested that advanced glycation end products (AGEs) contribute to diabetes-related complications [ 7 8 9 10 11 12 13 14 15 16 17 18 19 Coronary artery disease (CAD) is a manifestation of atherosclerosis in the heart. Its genetic background is suggested by a familial and ethnic predisposition to the disease as well as a sex-related incidence. Both genome-wide association studies (GWASs) and candidate gene studies have identified a number of loci and single genes that may determine genetic predisposition to coronary atherosclerosis in a population-specific manner [ 20 RAGE RAGE Materials and methods Study design A case-control study was conducted, involving Polish patients with ACS and age- and sex-matched healthy control subjects. Study participants The study population included individuals whose basic clinical characteristics were described previously [ 21 22 23 Data on comorbidities, including current treatment, were collected via patient questionnaires (Supplementary File 1) and physical examinations on admission. Hypertension was assessed on the basis of history and treatment but also on the basis of the mean value of two measurements of systolic (SBP) and diastolic (DBP) blood pressure performed at 5-minute intervals. Hypertension was defined as values ≥ 140 mmHg SBP and/or ≥ 90 mmHg DBP according to the European Society of Hypertension, and European Society of Cardiology guidelines [ 24 25 2 The study adhered to the tenets of the Declaration of Helsinki, the research program was approved by the local ethical committees, and written informed consent was obtained from all the participants. DNA extraction and genotyping Genomic DNA was isolated from peripheral blood mononuclear cells via the salting-out method [ 26 RAGE NC_000006.12 RAGE 2 1  Table 1 Genotyping conditions SNP primers annealing product restriction enzyme alleles  rs184003 G/T  (1704G/T) F: 5’GCCCTCTCCTCAAATCCACT3’ 62 ◦ 275 bp BfaI T 156, 119 bp G 156, 77, 42 bp R: 5’TGGTCCTGAGGCCCTATCT3’  rs2070600 G/A F: 5’GAAGGTCCTGTCTCCCCAG3’ 62 ◦ 272 bp AluI G 272 bp A 213, 59 bp R: 5’AATGAGGCCAGTGGAAGTCA3’ SNP F R BP Statistical analysis Allele frequencies were compared between groups via the chi 2 2 http://www.ekstroem.com/assotest/assotest.html U Results As the distributions of the genotypes and alleles of the studied polymorphisms did not differ between the female and male study participants, all the analyses were performed together without stratification by sex. For both the polymorphisms studied and for all the groups and subgroups tested, the distributions of genotypes and alleles were consistent with Hardy-Weinberg equilibrium ( p The genotype and allele distributions of RAGE polymorphisms differ between ACS patients and age- and sex-matched controls We started our analysis by comparing the frequencies of the different genotypes and alleles of the investigated polymorphisms between the study groups (Table 2 For the rs184003 G/T polymorphism, the frequency of genotypes containing the T allele (GT + TT) was significantly greater in patients with a history of ACS than in healthy age- and sex-matched controls (28.87% vs. 11.25%, p p The situation was different for the rs2070600 G/A polymorphism: genotype and allele frequencies were not significantly different between the study groups (after Bonferroni correction).  Table 2 Distribution of genotypes and alleles of RAGE ACS < 50 Healthy p ACS ≥ 50 p All ACS p rs184003 % %  N % %  N  N % %  N % Genotypes 175 160 161 336 GG 140 80.0 142 88.75 99 61.50 239 71.13 GT 33 18.85 17 10.65 58 36.02 91 27.08 TT 2 1.15 1 0.60 4 2.48 6 1.79 GT + TT vs. GG p 1.97 [1.3–3.65] p 0.4 [0.25–0.65] p 3.2 [1.86–5.52] GG vs. TT p p p GT + GG vs. TT p p p Alleles G 313 89.43 301 94.06 p 256 79.50 p 0.24 [0.09–0.75] 569 84.67 p T 37 10.57 19 5.94 1.87 [1.08–3.32] 66 20.50 103 15.33 2.86 [1.72–4.71] rs2070600 N % N % N % N % Genotypes 175 160 161 336 GG 150 85.71 123 76.87 121 75.15 271 80.65 GA 24 13.71 32 20.0 35 21.74 59 17.56 AA 1 0.58 5 3.13 5 3.11 6 1.79 GA + AA vs. GG p p p GG vs. AA p p p GA + GG vs. AA p p p Alleles G 324 92.57 278 86.87 p 277 86.02 p 601 89.43 p A 26 7.43 42 13.13 0.53 [0.31–0.89] 45 13.98 0.49 [0.29–0.82] 71 10.56 ACS CI C N OR SNP ^ p- *calculations performed for ACS < 50 vs. Healthy controls **calculations performed for ACS < 50 vs. ACS ≥ 50 ***calculations performed for All ACS vs. Healthy controls Genotype and allele distributions of RAGE polymorphisms differ between patients with ACS before and after age 50 In subsequent analyses, we wanted to test whether the presence of any of the polymorphic variants studied could predispose the participants in our study to ACS at a younger age. To do this, we compared the frequencies of individual genotypes and alleles in patients diagnosed with ACS before and after the age of 50 and related them to the frequencies observed in the healthy age- and sex-matched group. For the rs184003 G/T polymorphism, the frequency of genotypes differed between patients diagnosed with ACS before and after the age of 50. Genotypes containing the polymorphic T allele (GT and TT) were significantly less common in patients with ACS before the age of 50 than in those diagnosed later (20.0% vs. 38.5%, p p p In the case of the rs2070600 G/A polymorphism, we observed that although the frequency of genotypes did not differ between all ACS patients and controls, genotypes containing the A allele (GA + AA) were less common in patients who had ACS before the age of 50 (14.29% vs. 24.85%), but this difference was not statistically significant after correction. Distribution of RAGE genotypes and severity of coronary artery disease In this study, we explored whether RAGE Among younger patients, the median degree of stenosis (defined as average across vessels) was 25.75%. In older patients, the median degree of stenosis was 49.27%. These observations may suggest a potential trend in which certain genotypes may be associated with a more advanced form of CAD. However, we observed no significant correlation between the degree of coronary artery stenosis and the genotypes of the RAGE polymorphisms studied in the examined groups of CAD patients. In patients diagnosed with ACS under the age of 50, the median degree of coronary artery stenosis was 22.83% in carriers of the rs184003 T polymorphism (GT and TT), compared to 26.35% in those with the GG genotype. For participants who experienced ACS at 50 years of age or older, the median degree of coronary artery stenosis was 47.15% for GT and TT genotype carriers, versus 50.25% for GG genotype carriers. For the rs2070600 SNP, the median degree of coronary artery stenosis was 27.30% in younger patients with genotypes containing the A allele (GA + AA), compared to 25.25% in GG genotype carriers. In older participants, these values were 48.15% and 52.55%, respectively. Patients with the polymorphic rs184003 T allele have different clinical characteristics from GG homozygotes To test whether the polymorphisms studied can modulate the clinical course of ACS, we examined the distribution of biochemical and clinical parameters between study participants, stratified by the presence of polymorphic alleles of the genetic variants studied. We observed that patients carrying the T allele of the rs184003 polymorphism (GT + TT genotypes) had slightly lower HDL cholesterol levels (mean 1.02 mmol/l vs. 1.14 mmol/l, p p For the rs2070600 G/A polymorphism, we found no statistically significant differences in biochemical parameters between patient groups stratified according to the presence of the polymorphic A allele (AA + GA vs. GG). We also tested whether the genotype frequencies of the polymorphisms studied differed among patients with diabetes, a family history of cardiovascular disease, and those who had suffered an ST-elevation myocardial infarction, but we detected no statistically significant differences, probably due to the limited number of study participants that negatively impacted the power of the performed analysis. Discussion The development of CAD is the result of complex interactions between environmental and genetic factors. While the former is well known and includes, among others, older age, smoking, and comorbidities such as diabetes, hypercholesterolemia, or poorly controlled blood pressure, the genetic factors that predispose individuals to the development of CAD are still under investigation [ 20 RAGE The choice of candidate gene and polymorphisms studied was not accidental. As mentioned above, RAGE has a well-established role in the pathogenesis of CAD [ 11 27 RAGE 28 29 RAGE 30 31 32 33 34 34 The second SNP studied in the RAGE 35 29 36 37 38 In our study, the observed frequency of this allele in the healthy age- and sex-matched group reflected that reported in other European Caucasian populations (4.9–6.8%) [ 29 39 40 From a pathophysiological point of view, the higher prevalence of a genetic variant potentially associated with increased inflammation and oxidative stress in a group of patients with symptomatic CAD seems reasonable. Moreover, we observed that carriers of the polymorphic rs184003 T allele had significantly higher mean troponin I levels at the time of ACS than did those homozygous for the wild-type G allele and tended toward lower HDL-C concentrations. However, in the studied population, the distribution of the investigated genotypes in the subgroups stratified by the myocardial infarction type or severity of coronary artery stenosis did not differ significantly. This research highlights a potential link between CAD severity and genetics. Our initial findings suggest that certain genotypes may affect the degree of artery stenosis, whereas previous studies have focused mostly on genetic contributions to the early onset of myocardial infarction [ 41 42 43 To identify factors predisposing patients to the development of CAD and the incidence of ACS at a young age, we compared the frequencies of the genotypes studied in patients stratified by age. However, in our study, the frequency of polymorphic genotypes was greater in individuals diagnosed with ACS in their 50 s than in those in younger age groups. This finding was surprising since one would expect the pathogenic allele to be more common in younger patients with ACS, i.e., those younger than 50 years of age. These results therefore suggest a potential impact of rs184003 on the prevalence of CAD and ACS in the Polish population; however, this polymorphism does not appear to increase the risk of ACS at a young age. We are aware of the potential limitations of this study. The most important limitation is the relatively small size of the study groups, which obviously affects, especially in the subgroup analysis, the power of the results obtained. On the other hand, the careful selection of patients ensures that they are well characterized and that we have complete clinical data that can be used for future meta-analyses. In addition, by analyzing only two of the more than fifty SNPs in the RAGE RAGE When discussing the potential limitations of our study, we must also acknowledge that when referring to the control group as ‘healthy, age- and gender-matched controls’, we cannot guarantee that these individuals did not have hidden coronary artery disease (CAD). According to applicable Polish legislation, only individuals who are healthy and show no signs or symptoms of disease (including chronic conditions that increase the risk of atherosclerosis) are permitted to donate blood. Additionally, only non-smokers were eligible to participate in this study. However, these criteria could not guarantee that the control group did not have latent coronary artery disease. Moreover, we did not collect information on donors’ family history of coronary artery disease. Among the factors that may have influenced the results of this study, it should be noted that the ‘healthy control group’ was selected as a reference point for patients who had experienced ACS before the age of 50. Consequently, the entire study group of patients with a history of ACS (including individuals both under and over 50 years of age) was significantly older than the ‘healthy control group’. Finally, the definition of ACS in young patients has not been precisely determined. In the literature, this term is used in studies describing individuals who experienced ACS at ages below 45, 30, and even 20 years. To ensure a similar number of participants in the groups being compared in our study, we set this threshold at under 50 years. Setting a different threshold (e.g. at age 45 or 55) would undoubtedly affect the results. All these above-mentioned factors could have influenced the results of our study. Conclusions In conclusion, we found a higher frequency of the T allele of the RAGE Supplementary Information  Supplementary material 1.  Supplementary material 2. Abbreviations ACS Acute coronary syndrome AGEs Advanced glycation end products BMI Body mass index CAD Coronary artery disease DBP Diastolic blood pressure esRAGE Endogenous secretory receptor for advanced glycation end products GWAS Genome-wide association studies HDL High-density lipoprotein cholesterol IMT Intima-media thickness LDL Low-density lipoprotein cholesterol OR Odds ratio PCR Polymerase chain reaction RAGE Receptor for advanced glycation end products RAGE The gene for the receptor for advanced glycation end products RFLP Restriction fragment length polymorphism SBP Systolic blood pressure SNP Single nucleotide polymorphism sRAGE Soluble isoform of the receptor for advanced glycation end products TG Triglycerides Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements None. Authors’ contributions All the authors contributed to the study conception and design. Material preparation, data collection and analysis were performed by KG, MA, JP and AK. The first draft of the manuscript was written by KG and AK, and all the authors commented on previous versions of the manuscript. All the authors read and approved the final manuscript. Funding This work was supported by the National Science Centre Poland, grant 2018/31/B/NZ5/01556. Data availability The datasets generated and/or analyzed during the current study are available in the repository available at: https://figshare.com/articles/dataset/RAGE_rs184003_rs2070600_genotyping_xlsx/28887671?file=54028739. Declarations Ethics approval and consent to participate This study was performed in accordance with the principles of the Declaration of Helsinki. Approval was granted by the Ethics Committee of the Center of Postgraduate Medical Education Warsaw, Poland (decision 161/2015). Informed consent was obtained from all individual participants included in the study. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Yang Q Xu J Ma Q Liu Z Sudhahar V Cao Y PRKAA1/AMPKα1-driven glycolysis in endothelial cells exposed to disturbed flow protects against atherosclerosis Nat Commun 2018 9 4667 10.1038/s41467-018-07132-x 30405100 PMC6220207 Yang Q, Xu J, Ma Q, Liu Z, Sudhahar V, Cao Y, et al. PRKAA1/AMPKα1-driven glycolysis in endothelial cells exposed to disturbed flow protects against atherosclerosis. Nat Commun. 2018;9: 4667. 10.1038/s41467-018-07132-x. 30405100 10.1038/s41467-018-07132-x PMC6220207 2. Mundi S Massaro M Scoditti E Carluccio MA van Hinsbergh VWM Iruela-Arispe ML Endothelial permeability, LDL deposition, and cardiovascular risk factors—a review Cardiovasc Res 2018 114 35 52 10.1093/cvr/cvx226 29228169 PMC7729208 Mundi S, Massaro M, Scoditti E, Carluccio MA, van Hinsbergh VWM, Iruela-Arispe ML. Endothelial permeability, LDL deposition, and cardiovascular risk factors—a review. Cardiovasc Res. 2018;114:35–52. 10.1093/cvr/cvx226. 29228169 10.1093/cvr/cvx226 PMC7729208 3. Lam SM Zhang C Wang Z Ni Z Zhang S Yang S A multiomics investigation of the composition and function of extracellular vesicles along the temporal trajectory of COVID-19 Nat Metab 2021 3 909 22 10.1038/s42255-021-00425-4 34158670 Lam SM, Zhang C, Wang Z, Ni Z, Zhang S, Yang S, et al. A multiomics investigation of the composition and function of extracellular vesicles along the temporal trajectory of COVID-19. Nat Metab. 2021;3:909–22. 10.1038/s42255-021-00425-4. 34158670 10.1038/s42255-021-00425-4 4. Libby P Buring JE Badimon L Hansson GK Deanfield J Bittencourt MS Atherosclerosis Nat Rev Dis Primers 2019 5 56 10.1038/s41572-019-0106-z 31420554 Libby P, Buring JE, Badimon L, Hansson GK, Deanfield J, Bittencourt MS, et al. Atherosclerosis. Nat Rev Dis Primers. 2019;5: 56. 10.1038/s41572-019-0106-z. 31420554 10.1038/s41572-019-0106-z 5. Go AS Mozaffarian D Roger VL Benjamin EJ Berry JD Blaha MJ Heart disease and stroke statistics—2014 update: a report from the American Heart Association Circulation 2014 129 e28 292 10.1161/01.cir.0000441139.02102.80 24352519 PMC5408159 Go AS, Mozaffarian D, Roger VL, Benjamin EJ, Berry JD, Blaha MJ, et al. Heart disease and stroke statistics—2014 update: a report from the American Heart Association. Circulation. 2014;129:e28-292. 10.1161/01.cir.0000441139.02102.80. 24352519 10.1161/01.cir.0000441139.02102.80 PMC5408159 6. GBD 2019 Cancer Risk Factors Collaborators The global burden of cancer attributable to risk factors, 2010-19: a systematic analysis for the global burden of disease study 2019 Lancet 2019 400 563 91 10.1016/S0140-6736(22)01438-6 PMC9395583 35988567 GBD 2019 Cancer Risk Factors Collaborators. The global burden of cancer attributable to risk factors, 2010-19: a systematic analysis for the global burden of disease study 2019. Lancet. 2019;400:563–91. 10.1016/S0140-6736(22)01438-6. 10.1016/S0140-6736(22)01438-6 PMC9395583 35988567 7. Forbes JM Yee LT Thallas V Lassila M Candido R Jandeleit-Dahm KA Advanced glycation end product interventions reduce diabetes-accelerated atherosclerosis Diabetes 2004 53 1813 23 10.2337/diabetes.53.7.1813 15220206 Forbes JM, Yee LT, Thallas V, Lassila M, Candido R, Jandeleit-Dahm KA, et al. Advanced glycation end product interventions reduce diabetes-accelerated atherosclerosis. Diabetes. 2004;53:1813–23. 10.2337/diabetes.53.7.1813. 15220206 10.2337/diabetes.53.7.1813 8. Singh R Barden A Mori T Beilin L Advanced glycation end-products: a review Diabetologia 2001 44 129 46 10.1007/s001250051591 11270668 Singh R, Barden A, Mori T, Beilin L. Advanced glycation end-products: a review. Diabetologia. 2001;44:129–46. 10.1007/s001250051591. 11270668 10.1007/s001250051591 9. Luevano-Contreras C Chapman-Novakofski K Dietary advanced glycation end products and aging Nutrients 2010 2 1247 65 10.3390/nu2121247 22254007 PMC3257625 Luevano-Contreras C, Chapman-Novakofski K. Dietary advanced glycation end products and aging. Nutrients. 2010;2:1247–65. 10.3390/nu2121247. 22254007 10.3390/nu2121247 PMC3257625 10. Carr KD Weiner SP Vasquez C Schmidt AM Involvement of the receptor for advanced glycation end products (RAGE) in high fat-high sugar diet-induced anhedonia in rats Physiol Behav 2023 271 114337 10.1016/j.physbeh.2023.114337 37625475 PMC10592025 Carr KD, Weiner SP, Vasquez C, Schmidt AM. Involvement of the receptor for advanced glycation end products (RAGE) in high fat-high sugar diet-induced anhedonia in rats. Physiol Behav. 2023;271: 114337. 10.1016/j.physbeh.2023.114337. 37625475 10.1016/j.physbeh.2023.114337 PMC10592025 11. Prasad K Tiwari ST Interventions for advanced Glycation-End products and its Receptor-Mediated cardiovascular disease Curr Pharm Des 2017 23 937 43 10.2174/1381612822666161006143032 27719648 Prasad K, Tiwari ST. Interventions for advanced Glycation-End products and its Receptor-Mediated cardiovascular disease. Curr Pharm Des. 2017;23:937–43. 10.2174/1381612822666161006143032. 27719648 10.2174/1381612822666161006143032 12. Uribarri J Cai W Peppa M Goodman S Ferrucci L Striker G Circulating glycotoxins and dietary advanced glycation endproducts: two links to inflammatory response, oxidative stress, and aging J Gerontol A Biol Sci Med Sci 2007 62 4 427 33 10.1093/gerona/62.4.427 17452738 PMC2645629 Uribarri J, Cai W, Peppa M, Goodman S, Ferrucci L, Striker G. Circulating glycotoxins and dietary advanced glycation endproducts: two links to inflammatory response, oxidative stress, and aging. J Gerontol A Biol Sci Med Sci. 2007;62(4):427–33. 10.1093/gerona/62.4.427. 17452738 10.1093/gerona/62.4.427 PMC2645629 13. Burke AP Kolodgie FD Zieske A Fowler DR Weber DK Varghese PJ Morphologic findings of coronary atherosclerotic plaques in diabetics: a postmortem study Arterioscler Thromb Vasc Biol 2004 24 1266 71 10.1161/01.ATV.0000131783.74034.97 15142859 Burke AP, Kolodgie FD, Zieske A, Fowler DR, Weber DK, Varghese PJ, et al. Morphologic findings of coronary atherosclerotic plaques in diabetics: a postmortem study. Arterioscler Thromb Vasc Biol. 2004;24:1266–71. 10.1161/01.ATV.0000131783.74034.97. 15142859 10.1161/01.ATV.0000131783.74034.97 14. Uekita H Ishibashi T Shiomi M Koyama H Ohtsuka S Yamamoto H Integral role of receptor for advanced glycation end products (RAGE) in nondiabetic atherosclerosis Fukushima J Med Sci 2016 65 109 21 10.5387/fms.2019-12 PMC7012590 31915324 Uekita H, Ishibashi T, Shiomi M, Koyama H, Ohtsuka S, Yamamoto H, et al. Integral role of receptor for advanced glycation end products (RAGE) in nondiabetic atherosclerosis. Fukushima J Med Sci. 2016;65:109–21. 10.5387/fms.2019-12. 10.5387/fms.2019-12 PMC7012590 31915324 15. Oesterle A Bowman MA S100A12 and the S100/calgranulins: emerging biomarkers for atherosclerosis and possibly therapeutic targets Arterioscler Thromb Vasc Biol 2015 35 2496 507 10.1161/ATVBAHA.115.305608 26515415 PMC4771489 Oesterle A, Bowman MA. S100A12 and the S100/calgranulins: emerging biomarkers for atherosclerosis and possibly therapeutic targets. Arterioscler Thromb Vasc Biol. 2015;35:2496–507. 10.1161/ATVBAHA.115.305608. 26515415 10.1161/ATVBAHA.115.302072 PMC4771489 16. Grauen Larsen H Marinkovic G Nilsson PM Nilsson J Engström G Melander O High plasma sRAGE (soluble receptor for advanced glycation end products) is associated with slower carotid intima-media thickness progression and lower risk for first-time coronary events and mortality Arterioscler Thromb Vasc Biol 2019 39 5 925 33 10.1161/ATVBAHA.118.312319 30917679 Grauen Larsen H, Marinkovic G, Nilsson PM, Nilsson J, Engström G, Melander O, et al. High plasma sRAGE (soluble receptor for advanced glycation end products) is associated with slower carotid intima-media thickness progression and lower risk for first-time coronary events and mortality. Arterioscler Thromb Vasc Biol. 2019;39(5):925–33. 10.1161/ATVBAHA.118.312319. 30917679 10.1161/ATVBAHA.118.312319 17. Colhoun HM Betteridge DJ Durrington P Hitman G Neil A Livingstone S Total soluble and endogenous secretory receptor for advanced glycation end products as predictive biomarkers of coronary heart disease risk in patients with type 2 diabetes: an analysis from the CARDS trial Diabetes 2011 60 2379 85 10.2337/db11-0291 21771973 PMC3161327 Colhoun HM, Betteridge DJ, Durrington P, Hitman G, Neil A, Livingstone S, et al. Total soluble and endogenous secretory receptor for advanced glycation end products as predictive biomarkers of coronary heart disease risk in patients with type 2 diabetes: an analysis from the CARDS trial. Diabetes. 2011;60:2379–85. 10.2337/db11-0291. 21771973 10.2337/db11-0291 PMC3161327 18. Nin JW Jorsal A Ferreira I Schalkwijk CG Prins MH Parving HH Higher plasma soluble receptor for advanced glycation end products (sRAGE) levels are associated with incident cardiovascular disease and all-cause mortality in type 1 diabetes: a 12-year follow-up study Diabetes 2010 59 2027 32 10.2337/db09-1509 20522598 PMC2911054 Nin JW, Jorsal A, Ferreira I, Schalkwijk CG, Prins MH, Parving HH, et al. Higher plasma soluble receptor for advanced glycation end products (sRAGE) levels are associated with incident cardiovascular disease and all-cause mortality in type 1 diabetes: a 12-year follow-up study. Diabetes. 2010;59:2027–32. 10.2337/db09-1509. 20522598 10.2337/db09-1509 PMC2911054 19. Hudson BI Gardener H Liu-Mares W Dong C Cheung K Elkind MS Serum soluble RAGE levels and carotid atherosclerosis: the Northern Manhattan study (NOMAS) Atherosclerosis 2015 240 17 20 10.1016/j.atherosclerosis.2015.02.015 25744702 PMC4880353 Hudson BI, Gardener H, Liu-Mares W, Dong C, Cheung K, Elkind MS, et al. Serum soluble RAGE levels and carotid atherosclerosis: the Northern Manhattan study (NOMAS). Atherosclerosis. 2015;240:17–20. 10.1016/j.atherosclerosis.2015.02.015. 25744702 10.1016/j.atherosclerosis.2015.02.015 PMC4880353 20. Khan SU Saeed S Alsuhaibani AM Fatima S Ur Rehman K Zaman U Advances and challenges for GWAS analysis in cardiac diseases: a focus on coronary artery disease (CAD) Curr Probl Cardiol 2023 48 101821 10.1016/j.cpcardiol.2023.101821 37211304 Khan SU, Saeed S, Alsuhaibani AM, Fatima S, Ur Rehman K, Zaman U, et al. Advances and challenges for GWAS analysis in cardiac diseases: a focus on coronary artery disease (CAD). Curr Probl Cardiol. 2023;48: 101821. 10.1016/j.cpcardiol.2023.101821. 37211304 10.1016/j.cpcardiol.2023.101821 21. Ambroziak M Kuryłowicz A Roszkowska-Gancarz M Budaj A ESR2 gene G1730A variant is associated with triglycerides level and myocardial infarction in young men but not in women Gene 2018 677 83 8 10.1016/j.gene.2018.07.048 30036658 Ambroziak M, Kuryłowicz A, Roszkowska-Gancarz M, Budaj A. ESR2 gene G1730A variant is associated with triglycerides level and myocardial infarction in young men but not in women. Gene. 2018;677:83–8. 10.1016/j.gene.2018.07.048. 30036658 10.1016/j.gene.2018.07.048 22. Sianos G Morel MA Kappetein AP Morice MC Colombo A Dawkins K The SYNTAX score: an angiographic tool grading the complexity of coronary artery disease EuroIntervention 2005 1 219 27 19758907 Sianos G, Morel MA, Kappetein AP, Morice MC, Colombo A, Dawkins K, et al. The SYNTAX score: an angiographic tool grading the complexity of coronary artery disease. EuroIntervention. 2005;1:219–27. 19758907 23. Sullivan DR Marwick TH Freedman SB A new method of scoring coronary angiograms to reflect extent of coronary atherosclerosis and improve correlation with major risk factors Am Heart J 1990 119 1262 7 10.1016/s0002-8703(05)80173-5 1972310 Sullivan DR, Marwick TH, Freedman SB. A new method of scoring coronary angiograms to reflect extent of coronary atherosclerosis and improve correlation with major risk factors. Am Heart J. 1990;119:1262–7. 10.1016/s0002-8703(05)80173-5. 1972310 10.1016/s0002-8703(05)80173-5 24. Williams B, Mancia G, Spiering W, Agabiti Rosei E, Azizi M, Burnier M, ESC scientific document group, et al. 2018 ESC/ESH guidelines for the management of arterial hypertension. Eur Heart J. 2018;39:3021–104. 10.1093/eurheartj/ehy339. 10.1093/eurheartj/ehy339 30165516 25. Davies MJ Aroda VR Collins BS Gabbay RA Green J Maruthur NM Management of hyperglycemia in type 2 diabetes, 2022. A consensus report by the American Diabetes Association (ADA) and the European Association for the Study of Diabetes (EASD) Diabetes Care 2022 45 2753 86 10.2337/dci22-0034 36148880 PMC10008140 Davies MJ, Aroda VR, Collins BS, Gabbay RA, Green J, Maruthur NM, et al. Management of hyperglycemia in type 2 diabetes, 2022. A consensus report by the American Diabetes Association (ADA) and the European Association for the Study of Diabetes (EASD). Diabetes Care. 2022;45:2753–86. 10.2337/dci22-0034. 36148880 10.2337/dci22-0034 PMC10008140 26. Miller SA Dykes DD Polesky HF A simple salting out procedure for extracting DNA from human nucleated cells Nucleic Acids Res 1988 16 1215 10.1093/nar/16.3.1215 3344216 PMC334765 Miller SA, Dykes DD, Polesky HF. A simple salting out procedure for extracting DNA from human nucleated cells. Nucleic Acids Res. 1988;16:1215. 10.1093/nar/16.3.1215. 3344216 10.1093/nar/16.3.1215 PMC334765 27. Shen CY Lu CH Wu CH Li KJ Kuo YM Hsieh SC The development of Maillard reaction, and advanced glycation end product (AGE)-Receptor for AGE (RAGE) signaling inhibitors as novel therapeutic strategies for patients with AGE-Related diseases Molecules 2020 25 5591 10.3390/molecules25235591 33261212 PMC7729569 Shen CY, Lu CH, Wu CH, Li KJ, Kuo YM, Hsieh SC, et al. The development of Maillard reaction, and advanced glycation end product (AGE)-Receptor for AGE (RAGE) signaling inhibitors as novel therapeutic strategies for patients with AGE-Related diseases. Molecules. 2020;25:5591. 10.3390/molecules25235591. 33261212 10.3390/molecules25235591 PMC7729569 28. Johnson LL Tekabe Y Kollaros M Eng G Bhatia K Li C Imaging RAGE expression in atherosclerotic plaques in hyperlipidemic pigs EJNMMI Res 2014 4 26 10.1186/s13550-014-0026-6 25006545 PMC4078320 Johnson LL, Tekabe Y, Kollaros M, Eng G, Bhatia K, Li C, et al. Imaging RAGE expression in atherosclerotic plaques in hyperlipidemic pigs. EJNMMI Res. 2014;4: 26. 10.1186/s13550-014-0026-6. 25006545 10.1186/s13550-014-0026-6 PMC4078320 29. Serveaux-Dancer M Jabaudon M Creveaux I Belville C Blondonnet R Gross C Pathological implications of receptor for advanced glycation End-Product (AGER) gene polymorphism Dis Markers 2019 2019 2067353 10.1155/2019/2067353 30863465 PMC6378764 Serveaux-Dancer M, Jabaudon M, Creveaux I, Belville C, Blondonnet R, Gross C, et al. Pathological implications of receptor for advanced glycation End-Product (AGER) gene polymorphism. Dis Markers. 2019;2019:2067353. 10.1155/2019/2067353. 30863465 10.1155/2019/2067353 PMC6378764 30. Torres MC Beltrame MH Santos IC Picheth G Petzl-Erler ML Pedrosa FO Polymorphisms of the promoter and exon 3 of the receptor for advanced glycation end products (RAGE) in Euro- and Afro-Brazilians Int J Immunogenet 2012 39 155 60 10.1111/j.1744-313X.2011.01073.x 22133449 Torres MC, Beltrame MH, Santos IC, Picheth G, Petzl-Erler ML, Pedrosa FO, et al. Polymorphisms of the promoter and exon 3 of the receptor for advanced glycation end products (RAGE) in Euro- and Afro-Brazilians. Int J Immunogenet. 2012;39:155–60. 10.1111/j.1744-313X.2011.01073.x. 22133449 10.1111/j.1744-313X.2011.01073.x 31. Osawa M Yamamoto Y Munesue S Murakami N Sakurai S Watanabe T De-N-glycosylation or G82S mutation of RAGE sensitizes its interaction with advanced glycation endproducts Biochim Biophys Acta 2007 1770 1468 74 10.1016/j.bbagen.2007.07.003 17714874 Osawa M, Yamamoto Y, Munesue S, Murakami N, Sakurai S, Watanabe T, et al. De-N-glycosylation or G82S mutation of RAGE sensitizes its interaction with advanced glycation endproducts. Biochim Biophys Acta. 2007;1770:1468–74. 10.1016/j.bbagen.2007.07.003. 17714874 10.1016/j.bbagen.2007.07.003 32. Soro-Paavonen A Watson AM Li J Paavonen K Koitka A Calkin AC Receptor for advanced glycation end products (RAGE) deficiency attenuates the development of atherosclerosis in diabetes Diabetes 2008 57 2461 9 10.2337/db07-1808 18511846 PMC2518498 Soro-Paavonen A, Watson AM, Li J, Paavonen K, Koitka A, Calkin AC, et al. Receptor for advanced glycation end products (RAGE) deficiency attenuates the development of atherosclerosis in diabetes. Diabetes. 2008;57:2461–9. 10.2337/db07-1808. 18511846 10.2337/db07-1808 PMC2518498 33. Hofmann MA Drury S Hudson BI Gleason MR Qu W Lu Y RAGE and arthritis: the G82S polymorphism amplifies the inflammatory response Genes Immun 2002 3 123 35 10.1038/sj.gene.6363861 12070776 Hofmann MA, Drury S, Hudson BI, Gleason MR, Qu W, Lu Y, et al. RAGE and arthritis: the G82S polymorphism amplifies the inflammatory response. Genes Immun. 2002;3:123–35. 10.1038/sj.gene.6363861. 12070776 10.1038/sj.gene.6363861 34. Ma WQ Qu QR Zhao Y Liu NF Association of RAGE gene Gly82Ser polymorphism with coronary artery disease and ischemic stroke: a systematic review and meta-analysis Medicine (Baltimore) 2016 95 e5593 10.1097/MD.0000000000005593 27930580 PMC5266052 Ma WQ, Qu QR, Zhao Y, Liu NF. Association of RAGE gene Gly82Ser polymorphism with coronary artery disease and ischemic stroke: a systematic review and meta-analysis. Medicine (Baltimore). 2016;95: e5593. 10.1097/MD.0000000000005593. 27930580 10.1097/MD.0000000000005593 PMC5266052 35. Cooper DN Functional intronic polymorphisms: buried treasure awaiting discovery within our genes Hum Genomics 2010 4 284 8 10.1186/1479-7364-4-5-284 20650817 PMC3500160 Cooper DN. Functional intronic polymorphisms: buried treasure awaiting discovery within our genes. Hum Genomics. 2010;4:284–8. 10.1186/1479-7364-4-5-284. 20650817 10.1186/1479-7364-4-5-284 PMC3500160 36. Li T Qin W Liu Y Li S Qin X Liu Z Effect of RAGE Cancer Cell Int 2017 17 19 10.1186/s12935-017-0391-0 28184178 PMC5294806 Li T, Qin W, Liu Y, Li S, Qin X, Liu Z. Effect of RAGE 28184178 10.1186/s12935-017-0391-0 PMC5294806 37. Miyashita M Watanabe T Ichikawa T Toriumi K Horiuchi Y Kobori A The regulation of soluble receptor for ages contributes to carbonyl stress in schizophrenia Biochem Biophys Res Commun 2016 479 447 52 10.1016/j.bbrc.2016.09.074 27641663 Miyashita M, Watanabe T, Ichikawa T, Toriumi K, Horiuchi Y, Kobori A, et al. The regulation of soluble receptor for ages contributes to carbonyl stress in schizophrenia. Biochem Biophys Res Commun. 2016;479:447–52. 10.1016/j.bbrc.2016.09.074. 27641663 10.1016/j.bbrc.2016.09.074 38. Kanková K Márová I Záhejský J Muzík J Stejskalová A Znojil V Vácha J Polymorphisms 1704G/T and 2184A/G in the RAGE gene are associated with antioxidant status Metabolism 2001 50 1152 60 10.1053/meta.2001.26757 11586486 Kanková K, Márová I, Záhejský J, Muzík J, Stejskalová A, Znojil V, Vácha J. Polymorphisms 1704G/T and 2184A/G in the RAGE gene are associated with antioxidant status. Metabolism. 2001;50:1152–60. 10.1053/meta.2001.26757. 11586486 10.1053/meta.2001.26757 39. 6-32182519-. C-A | gnomAD v4.1.0 | gnomAD. 40. Yu X Liu J Zhu H Xia Y Gao L Li Z An interactive association of advanced glycation end-product receptor gene four common polymorphisms with coronary artery disease in Northeastern Han Chinese PLoS One 2013 8 e76966 10.1371/journal.pone.0076966 24155913 PMC3796558 Yu X, Liu J, Zhu H, Xia Y, Gao L, Li Z, et al. An interactive association of advanced glycation end-product receptor gene four common polymorphisms with coronary artery disease in Northeastern Han Chinese. PLoS One. 2013;8: e76966. 10.1371/journal.pone.0076966. 24155913 10.1371/journal.pone.0076966 PMC3796558 41. Deloukas P Kanoni S Willenborg C Farrall M Assimes T Thompson J Large-scale association analysis identifies new risk loci for coronary artery disease Nat Genet 2013 45 25 33 10.1038/ng.2480 23202125 PMC3679547 Deloukas P, Kanoni S, Willenborg C, Farrall M, Assimes T, Thompson J, et al. Large-scale association analysis identifies new risk loci for coronary artery disease. Nat Genet. 2013;45:25–33. 10.1038/ng.2480. 23202125 10.1038/ng.2480 PMC3679547 42. Nikpay M Goel A Won HH Hall LM Willenborg C Kanoni S A comprehensive 1,000 Genomes-based genome-wide association meta-analysis of coronary artery disease Nat Genet 2015 47 1121 30 10.1038/ng.3396 26343387 PMC4589895 Nikpay M, Goel A, Won HH, Hall LM, Willenborg C, Kanoni S, et al. A comprehensive 1,000 Genomes-based genome-wide association meta-analysis of coronary artery disease. Nat Genet. 2015;47:1121–30. 10.1038/ng.3396. 26343387 10.1038/ng.3396 PMC4589895 43. McPherson R Tybjaerg-Hansen A Genetics of coronary artery disease Circ Res 2016 118 564 78 10.1161/CIRCRESAHA.115.306566 26892958 McPherson R, Tybjaerg-Hansen A. Genetics of coronary artery disease. Circ Res. 2016;118:564–78. 10.1161/CIRCRESAHA.115.306566. 26892958 10.1161/CIRCRESAHA.115.306566 ",
  "metadata": {
    "Title of this paper": "Genetics of coronary artery disease",
    "Journal it was published in:": "BMC Medical Genomics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482394/"
  }
}