{
  "title": "Paper_954",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470711 PMC12470711.1 12470711 12470711 41010887 10.3390/jcm14186683 jcm-14-06683 1 Review Interventional Management of Acute Pancreatitis and Its Complications https://orcid.org/0000-0001-5219-6277 Masood Muaaz 1 Vedamurthy Amar 1 Krishnamoorthi Rajesh 1 Irani Shayan 1 https://orcid.org/0009-0005-4943-4816 Fotoohi Mehran 2 https://orcid.org/0000-0002-9745-7538 Kozarek Richard 1 3 * Desai Chirag Academic Editor 1 2 3 * richard.kozarek@commonspirit.org 22 9 2025 9 2025 14 18 497642 6683 06 8 2025 09 9 2025 15 9 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Acute pancreatitis (AP) is the most common cause of gastrointestinal-related hospitalizations in the United States, with gallstone disease and alcohol as the leading etiologies. Management is determined by disease severity, classified as interstitial edematous pancreatitis or necrotizing pancreatitis, with severity further stratified based on local complications and systemic organ dysfunction. Regardless of etiology, initial treatment involves aggressive intravenous fluid resuscitation with Lactated Ringer’s solution, pain and nausea control, early oral feeding in 24 to 48 h, and etiology-directed interventions when indicated. In gallstone pancreatitis, early endoscopic retrograde cholangiopancreatography (ERCP) with sphincterotomy is indicated in the presence of concomitant cholangitis or persistent biliary obstruction, with subsequent laparoscopic cholecystectomy as standard of care for stone clearance. The role of interventional therapy in uncomplicated AP is limited in the acute phase, except for biliary decompression or enteral feeding support with nasojejunal tube placement. However, in severe AP with complications, interventional radiology (IR) and endoscopic approaches play a pivotal role. IR facilitates early percutaneous drainage of symptomatic, acute fluid collections and infected necrosis, particularly in non-endoscopically accessible retroperitoneal or dependent collections, improving outcomes with a step-up approach. IR-guided angiographic embolization is the preferred modality for hemorrhagic complications, including pseudoaneurysms. In the delayed phase, walled-off necrosis (WON) and pancreatic pseudocysts are managed with endoscopic ultrasound (EUS)-guided drainage, with direct endoscopic necrosectomy (DEN) reserved for infected necrosis. Dual-modality drainage (DMD), combining percutaneous and endoscopic drainage, is increasingly utilized in extensive or complex collections, reflecting a collaborative effort between gastroenterology and interventional radiology comparable to that which exists between IR and surgery in institutions that perform video assisted retroperitoneal debridement (VARD). Peripancreatic fluid collections may fistulize into adjacent structures, including the stomach, small intestine, or colon, requiring transpapillary stenting with or without additional closure of the gut leak with over-the-scope clips (OTSC) or suturing devices. Additionally, endoscopic management of pancreatic duct disruptions with transpapillary or transmural stenting plays a key role in cases of disconnected pancreatic duct syndrome (DPDS). Comparative outcomes across interventional techniques—including retroperitoneal, laparoscopic, open surgery, and endoscopic drainage—highlight a shift toward minimally invasive approaches, with decreased morbidity and reduced hospital stay. The integration of endoscopic and interventional radiology-guided techniques has transformed the management of AP complications and multidisciplinary collaboration is essential for optimal patient outcomes. endoscopy interventional radiology acute pancreatitis pancreatic necrosis pseudocyst percutaneous drainage endoscopic ultrasound pancreatic duct leak pseudoaneurysm embolization This narrative review received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The incidence of acute pancreatitis is rising in North America and Europe. There are several factors which may contribute to the increased incidence of AP including obesity rates, alcohol consumption, improved diagnostic modalities, and regional variations. AP is more common in older adults. The diagnosis of acute pancreatitis (AP) requires 2 of 3 following criteria: (1) abdominal pain, (2) serum amylase or lipase >3 times the upper limit of normal, or (3) characteristic findings on abdominal imaging [ 1 2 3 4 Up to one-third of patients with AP have moderate-to-severe disease. Moderate severity is defined as transient organ failure, which resolves within 48 h and/or development of complications such as peripancreatic fluid collections. Severe acute pancreatitis is defined as the presence of organ failure lasting over 48 h. Risk factors for severe AP include baseline elevated BUN and hematocrit as well as comorbidities, obesity, and the presence of systemic inflammatory response syndrome (SIRS). Anatomically, AP can be classified as interstitial, usually mild, or necrotizing pancreatitis with moderate to severe disease. Interstitial pancreatitis presents as focal or diffuse enlargement of the pancreas with enhancement on contrast CT scans. Inflammatory fat stranding can be noted in peripancreatic tissue. Necrotizing pancreatitis involves diffuse or focal areas of non-viable pancreatic parenchyma with or without involvement of peripancreatic fat necrosis. The necrosis is initially sterile and can eventually become infected, often within one to two weeks [ 5 6 2. Materials and Methods 2.1. Endoscopic Retrograde Cholangiopancreatigraphy in Acute Pancreatitis The majority of patients with biliary pancreatitis have passed their stones by the time they seek medical care. In patients with gallstone pancreatitis and an elevation in bilirubin, ERCP is potentially indicated if there is documentation of a persistent CBD stone, contingent on institutional expertise. An imaging study to include MRCP or EUS is necessary to confirm retained intraductal stones, and ERCP alone should not be used as a diagnostic procedure [ Table 1 7 Figure 1 Scheme 1 8 9 Finally, it is common practice in the community setting to perform ERCP in patients with retained common bile duct stones prior to laparoscopic cholecystectomy, even in patients with mild pancreatitis. This is usually performed during the index hospitalization in conjunction with laparoscopic cholecystectomy and may allow for stabilization of an acutely or chronically ill patient and surgery when the patient has been stabilized. In institutions with expertise in laparoscopic transcystic common bile duct exploration (LCBDE), the trend has been to approach retained stones laparoscopically in medically fit patients at the time of gallbladder removal. Studies demonstrate the efficacy of transcystic LCBDE with success rates for duct clearance comparable to ERCP, decreased rates of post-procedural pancreatitis, and shorter duration of hospitalization [ 10 11 12 13 2.2. Interventional Radiology-Guided Percutaneous Drainage of Early Pancreatic Fluid Collections Although many patients with acute pancreatitis develop peripancreatic fluid collections (PFC), most cases spontaneously resolve and do not require interventional therapy. In patients with persistent fever, multiorgan dysfunction, increased WBC or CRP levels, and a contrast CT that fails to demonstrate other possible sources of infection, early percutaneous drainage (PCD) of a PFC should be considered [ Table 2 14 15 16 Although some necrotic collections tend to encapsulate earlier than 4 weeks and are amenable to endoscopic drainage, PCD can be performed earlier with the assistance of CT using the Seldinger technique. Access is confirmed by contrast injection, and a hydrophilic guidewire is placed in each of the necrotic collections through the most direct transperitoneal route, avoiding bowel and solid organs. A dilating catheter is advanced over the wire, and the tract is dilated. Subsequently, a double sump 12–16 Fr catheter is placed into the cavity, and fluid is aspirated ( Scheme 1 After successful placement, the catheter is flushed with saline to irrigate the cavity. In some instances, continuous irrigation using a liter of normal saline is performed. Depending on the clinical course, the percutaneous catheter can be subsequently upsized after 24 to 72 h to a maximum of 28 to 30 Fr double-sump large-bore catheters with distal holes over time [ 17 18 2.3. Infected Pancreatic Necrosis The management of IPN has been a long-standing topic of debate. Historically, IPN was treated with open surgical debridement, which was associated with significant patient mortality ranging from as low as 14% in individuals in whom treatment was delayed 4–6 weeks after presentation to 69% for those operated on acutely [ 19 20 Table 2 Table 3 Figure 2 Scheme 2 21 22 23 9 In the PANTER trial, the step-up approach was used as a bridge to surgery. The trial involved percutaneous drainage (PCD) followed by video-assisted retroperitoneal debridement (VARD). More than a third of patients with IPN did not require surgery and were managed with PCD alone. A step-up approach with the intention to avoid surgery led to a success rate of 69% [ 24 p p p 25 In an additional retrospective study of 47 patients comparing percutaneous drainage, endoscopic drainage, internal derivation, and necrosectomy in the late phase of moderate to severe AP, all of these modalities were demonstrated to be effective options based on the patient’s clinical status and the location of the necrosis. However, an up-front invasive approach was associated with a worse quality of life [ 26 27 28 p p 29 In a randomized controlled trial of 183 patients, upfront necrosectomy at the index intervention instead of as a step-up intervention was associated with a significantly reduced number of reinterventions in patients with infected necrotizing pancreatitis and fully encapsulated collections [ 30 31 Finally, Avudiappan et al. compared minimal incision retroperitoneal necrosectomy (MIRN), conventional open necrosectomy, and VARD. MIRN was associated with low postoperative mortality and low postoperative stay, and there was no significant difference in re-intervention rate, postoperative bleeding, and enterocutaneous fistula between the 3 groups [ 32 2.4. Endoscopic Ultrasound-Guided Techniques for Walled-Off Pancreatic Necrosis (WON) The first step in the management of infected necrosis is antibiotic therapy. It is recommended to delay invasive interventions for at least 4 weeks after the initial presentation to allow for liquefaction and encapsulation of the necrotic collection. A well-encapsulated cavity allows for safe drainage with reduced risk of pneumoperitoneum or pneumoretroperitoneum. However, in some patients, the necrotic collections can wall off completely in less than 4 weeks of the initial episode. Endoscopic drainage of collections in early stages is reserved for patients with significant clinical deterioration. Although endoscopic drainage is technically feasible, it is challenging due to the presence of solid necrotic content as opposed to liquified content in a walled-off cavity which often occurs in the delayed phase [ 33 34 2.5. Direct Endoscopic Necrosectomy Necrosectomy is currently performed endoscopically using a combination of mechanical debridement using snares, forceps, baskets, or nets. It is a labor-intensive process, and a lack of specialized equipment adds to the challenge of whether performed per os or by VARD. DEN usually requires multiple sessions requiring passage through a metal stent or a fistulous tract that may be at a challenging angle and increase the risk of stent dislodgement ( Scheme 3 EndoRotor is a three-in-one tool that allows simultaneous dissection, resection, and extraction of necrotic material. It consists of a console unit that delivers cutting, suction, and irrigation with a footswitch control through a 3.1 mm diameter flexible catheter. The catheter has an open window at the distal tip and an inner cannula that can rotate at 1000 or 1750 revolutions per minute. The system uses a high-performance vacuum pump to help with aspiration. The inner cannula of the EndoRotor catheter has teeth that rotate and debride necrotic tissue, which is then aspirated and collected in a vacuum canister. The case series by Rizzatti et al. demonstrated the use of EndoRotor for DEN in four patients who previously had incomplete attempts at DEN [ 35 Extra-large graspers such as the Ovesco excavator (OTSG Xcavator TM 36 2.6. Dual Modality Drainage Alternatively, necrotic cavities with debris can be treated with both endoscopic stent placement and a simultaneous JP drain placed percutaneously to allow irrigation and facilitate internal drainage. Percutaneous drains can also be placed into non-contiguous or distant anatomic sites, such as the pelvic gutters, or into sites that are not accessible endoscopically (refer to Scheme 2 In our institution, we have frequently used a hybrid technique that includes both an endoscopic and percutaneous drainage, particularly in patients with multiple areas of WON or in patients who have a component of necrosis not accessible endoscopically. In a study of 278 patients comparing early and late dual modality drainage (DMD) for necrotic fluid collections (NFCs), the technical success, clinical success, procedural, and early post-procedural adverse events were similar [ 37 p 38 2.7. Interventional Radiology-Guided Embolization of Pseudoaneurysms LAMS are preferred in the management of peripancreatic fluid collections as the wider diameter allows for rapid drainage and collapse of the necrotic cavity. However, LAMS may lead to formation of pseudoaneurysm due to the abrasion of the distal flange associated with acute inflammation [ Figure 3 39 40 p 41 Pseudoaneurysms are contained in the adventitia of the artery and are associated with a high risk of mortality. Patients may present with a history of pancreatitis and abdominal pain, drop in hemoglobin, or gastrointestinal bleeding. Although diagnostic work-up includes endoscopy to rule out mucosal bleeding in the gastrointestinal tract amenable to endoscopic therapy, the absence of a potential bleeding site should raise concern for hemorrhagic pancreatitis or a pseudoaneurysm and prompt an urgent computed tomography angiography. Interventional radiology-guided embolization of pseudoaneurysms is the mainstay of treatment in hemodynamically stable patients. Early angiography with localization and embolization of pseudoaneurysms with embolic coils and gel foam is associated with improvement in survival, and a decrease in mortality from 90% to 15–50% [ Figure 3 42 43 2.8. Pancreatic Fistula Treatment Disruption of the pancreatic duct can range in severity from involvement of a ductal side branch to partial or complete disruption of the main pancreatic duct [ Scheme 4 44 45 Extravasated pancreatic secretions can also leak to the skin surface, such as at the site of surgical incision following debridement or the PCD site which forms a pancreaticocutaneous fistula. Pancreaticocutaneous fistulas occur more commonly when only a single modality of external drainage is performed. The anatomy of the pancreatic duct may impact the approach to management. Ductal disruptions can be aggravated and perpetuated by downstream obstruction of the PD [ 46 Scheme 4 2.9. Approach to Disconnected Pancreatic Duct Syndrome (DPDS) After Severe Pancreatitis DPDS is defined as complete disruption of the PD with an upstream viable pancreas. The excluded tail portion of the pancreas continues to cause leakage of pancreatic secretions which results in recurrent fluid collections or pancreatitis in the orphaned portion of the gland. A delay in diagnosis of DPDS has been associated with increased morbidity, duration of hospitalization, and costs [ 47 48 49 50 2.10. Acute on Chronic Pancreatitis—Fibrotic PD Strictures or Calculi While inflammatory PD strictures and duct disruptions are associated with acute pancreatitis, fibrotic PD strictures or calculi typically occur in chronic pancreatitis [ 51 52 53 2.11. Outcomes in Quality of Life and Cost Effectiveness Acute necrotizing pancreatitis is associated with a substantial disease burden. In a study of 373 patients with necrotizing pancreatitis, the quality of life scores did not differ between conservative, endoscopic or percutaneous drainage alone, and the necrosectomy groups [ 29 54 55 56 3. Conclusions While various interventional techniques have been outlined, it is important to note that institutional expertise and availability of resources may impact the choice of intervention. Some endoscopists may not have expertise with EUS, and some surgeons may not have experience with LCBDE. Moreover, there may be challenges with reimbursement for EUS-guided procedures or combined cholecystectomy and LCBDE. Patients with complications of acute pancreatitis should be referred to high-volume centers in which IR, advanced therapeutic endoscopy, and surgery teams are experienced in the multidisciplinary approach and have the required resources to address severe acute pancreatitis and its complications [ 57 The majority of patients with acute pancreatitis require support as opposed to interventional therapy. Patients with uncomplicated gallstone pancreatitis should undergo laparoscopic cholecystectomy, ideally during their index hospitalization. In those with retained CBD stones, stone removal should be contingent upon the expertise and skillset of both the surgeon and the therapeutic endoscopy team. Patients with severe disease should be assessed by a team that includes gastroenterologists/therapeutic endoscopists, surgeons, interventional radiologists, and hospitalists or intensivists. Those with acute cholangitis should undergo early biliary decompression, most commonly with ERCP. In those who develop necrosis, current studies demonstrate that they should be managed conservatively for 4–6 weeks before undergoing drainage. However, in the setting of infected necrosis unresponsive to antibiotics or clinical deterioration, percutaneous drainage, at times in conjunction with VARD, is indicated. Moreover, additional interventions to include embolization of a bleeding pseudoaneurysm or decompressive laparotomy for abdominal compartment syndrome may be required. Although it may be dependent on the institution, the treatment of pancreatic pseudocysts and WON has evolved from open or laparoscopic surgery to EUS-guided drainage with LAMS. Direct endoscopic necrosectomy through the LAMS tract as well as dual modality drainage for irrigation are performed for the resolution of the collections. DMD also plays a key role in draining anatomic areas not amenable to endoscopic access. ERCP, in turn, is performed to treat biliary obstruction from distal CBD compression as well as for the placement of bridging PD stents in patients with a PD leak. Regardless of the treatment modality, patients who develop necrosis or have severe disease are at increased risk for recurrent pancreatitis as well as pancreatic exocrine and endocrine insufficiency. Acknowledgments The authors would like to thank Terri Davis Smith from the Center for Digestive Health at Virginia Mason Franciscan Health in Seattle, WA, USA, for her assistance in the submission of the manuscript. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.M., A.V., R.K. (Rajesh Krishnamoorthi), S.I., M.F. and R.K. (Richard Kozarek); methodology, M.M., A.V. and R.K. (Richard Kozarek); software, not applicable; validation, M.M., A.V., R.K. (Rajesh Krishnamoorthi), S.I., M.F. and R.K. (Richard Kozarek); formal analysis, M.M.; investigation, M.M., A.V. and R.K. (Richard Kozarek); resources, R.K. (Richard Kozarek), S.I. and M.F.; data curation, M.M. and A.V.; writing—original draft preparation, M.M. and A.V.; writing—review and editing, M.M., R.K. (Rajesh Krishnamoorthi), S.I., M.F. and R.K. (Richard Kozarek); supervision, M.M. and R.K. (Richard Kozarek); project administration, M.M. and R.K. (Richard Kozarek). All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data has been included in the article. Conflicts of Interest The authors declare no conflict of interest. References 1. Tenner S. Baillie J. DeWitt J. Vege S.S. American College of Gastroenterology American College of Gastroenterology Guideline: Management of Acute Pancreatitis Am. J. Gastroenterol. 2013 108 1400 1415 10.1038/ajg.2013.218 23896955 2. Ammann R.W. The natural history of alcoholic chronic pancreatitis Intern. Med. 2001 40 368 375 10.2169/internalmedicine.40.368 11393404 3. Aghdassi A.A. Weiss F.U. Mayerle J. Lerch M.M. Simon P. Genetic susceptibility factors for alcohol-induced chronic pancreatitis Pancreatology 2015 15 S23 S31 10.1016/j.pan.2015.05.476 26149858 4. Coté G.A. Xu H. Easler J.J. Imler T.D. Teal E. Sherman S. Korc M. Informative Patterns of Health-Care Utilization Prior to the Diagnosis of Pancreatic Ductal Adenocarcinoma Am. J. Epidemiol. 2017 186 944 951 10.1093/aje/kwx168 28541521 PMC5860250 5. Petrov M.S. Shanbhag S. Chakraborty M. Phillips A.R. Windsor J.A. Organ failure and infection of pancreatic necrosis as determinants of mortality in patients with acute pancreatitis Gastroenterology 2010 139 813 820 10.1053/j.gastro.2010.06.010 20540942 6. Moran R.A. Halloran C. Guo Q. Umapathy C. Jalaly N.Y. Jain S. Cowzer D. Robles E.P.C. Quesada-Vázquez N. Szentesi A. Early infection is an independent risk factor for increased mortality in patients with culture-confirmed infected pancreatic necrosis Pancreatology 2022 22 67 73 10.1016/j.pan.2021.11.003 34774414 7. Neoptolemos J.P. Carr-Locke D.L. London N.J. Bailey I.A. James D. Fossard D.P. Controlled trial of urgent endoscopic retrograde cholangiopancreatography and endoscopic sphincterotomy versus conservative treatment for acute pancreatitis due to gallstones Lancet 1988 2 979 983 10.1016/S0140-6736(88)90740-4 2902491 8. Weissman S. Sharma S. Ehrlich D. Aziz M. Bangolo A. Gade A. Thompson-Edwards A. Singla K. Venkatesh H.K. Kim M.H. The role and timing of endoscopic retrograde cholangiopancreatography in acute biliary pancreatitis without cholangitis: A nationwide analysis J. Hepato-Biliary-Pancreatic Sci. 2023 30 767 776 10.1002/jhbp.1285 36448275 9. Tenner S. Vege S.S. Sheth S.G. Sauer B. Yang A. Conwell D.L. Yadlapati R.H. Gardner T.B. American College of Gastroenterology Guidelines: Management of Acute Pancreatitis Am. J. Gastroenterol. 2024 119 419 437 10.14309/ajg.0000000000002645 38857482 10. Di Menno Stavron J. Ardiles V. Fratantoni M.E. Uad P. Sanchez Clariá R. de Santibañes M. Pekolj J. Mazza O. Laparoscopic one-step approach for the management of acute biliary pancreatitis: 10 years experience in a high volume center Laparosc. Surg. 2021 5 42 10.21037/ls-21-12 11. O’Rourke C. Lewin J. Waters P. Weber L. Cavallucci D. Bryant R. O’Rourke N. Long Term Outcomes of Trans-Cystic Bile Duct Exploration HPB 2021 23 S89 S90 10.1016/j.hpb.2020.11.214 12. Lai C.K.N. DeCicco J. Semanate R.C. Kara A.M. Tran A.H. Kim H.K. Abraham A. Lee M. Haurin S. Prasad R. Lessons learned from implementing laparoscopic common bile duct exploration at a safety net hospital Surgery 2025 179 108887 10.1016/j.surg.2024.07.088 39532652 13. Berg L.S. Friis-Andersen H. Zinther N.B. Öztoprak M. Gotschalck K.A. Feasibility and outcome of transcystic laparoscopic common bile duct exploration as first-line treatment for common bile duct stones: A retrospective cross-sectional study Surg. Endosc. 2025 39 2256 2266 10.1007/s00464-025-11587-7 39934279 14. Balthazar E.J. Freeny P.C. van Sonnenberg E. Imaging and intervention in acute pancreatitis Radiology 1994 193 297 306 10.1148/radiology.193.2.7972730 7972730 15. Mortele K.J. Wiesner W. Intriere L. Shankar S. Zou K.H. Kalantari B.N. Perez A. Vansonnenberg E. Ros P.R. Banks P.A. A Modified CT Severity Index for Evaluating Acute Pancreatitis: Improved Correlation with Patient Outcome Am. J. Roentgenol. 2004 183 1261 1265 10.2214/ajr.183.5.1831261 15505289 16. Jain S. Gupta S. Chawla A. Agarwal Y. Thukral B. Comparative study of Balthazar Computed Tomography Severity Index and Modified Computed Tomography Severity Index in predicting the outcome of acute pancreatitis Apollo Med. 2014 11 74 83 10.1016/j.apme.2014.03.002 17. Gupta R. Kulkarni A. Babu R. Shenvi S. Gupta R. Sharma G. Kang M. Gorsi U. Rana S.S. Complications of Percutaneous Drainage in Step-Up Approach for Management of Pancreatic Necrosis: Experience of 10 Years from a Tertiary Care Center J. Gastrointest. Surg. 2020 24 598 609 10.1007/s11605-019-04470-z 31845144 18. Baudin G. Chassang M. Gelsi E. Novellas S. Bernardin G. Hébuterne X. Chevallier P. CT-Guided Percutaneous Catheter Drainage of Acute Infectious Necrotizing Pancreatitis: Assessment of Effectiveness and Safety Am. J. Roentgenol. 2012 199 192 199 10.2214/AJR.11.6984 22733912 19. Banks P.A. Freeman M.L. Practice Parameters Committee of the American College of Gastroenterology Practice Guidelines in Acute Pancreatitis Am. J. Gastroenterol. 2006 101 2379 2400 10.1111/j.1572-0241.2006.00856.x 17032204 20. Baron T.H. DiMaio C.J. Wang A.Y. Morgan K.A. American Gastroenterological Association Clinical Practice Update: Management of Pancreatic Necrosis Gastroenterology 2020 158 67 75.e1 10.1053/j.gastro.2019.07.064 31479658 21. Maatman T.K. Zyromski N.J. Surgical Step-Up Approach in Management of Necrotizing Pancreatitis Gastroenterol. Clin. N. Am. 2025 54 53 74 10.1016/j.gtc.2024.10.001 39880533 22. Hartwig W. Werner J. Müller C.A. Uhl W. Büchler M.W. Surgical management of severe pancreatitis including sterile necrosis J. Hepato-Biliary-Pancreatic Surg. 2002 9 429 435 10.1007/s005340200053 12483264 23. Shenvi S. Gupta R. Kang M. Khullar M. Rana S.S. Singh R. Bhasin D.K. Timing of surgical intervention in patients of infected necrotizing pancreatitis not responding to percutaneous catheter drainage Pancreatology 2016 16 778 787 10.1016/j.pan.2016.08.006 27592206 24. van Santvoort H.C. Besselink M.G. Bakker O.J. Hofker H.S. Boermeester M.A. Dejong C.H. van Goor H. Schaapherder A.F. van Eijck C.H. Bollen T.L. A step-up approach or open necrosectomy for necrotizing pancreatitis N. Engl. J. Med. 2010 362 1491 1502 10.1056/NEJMoa0908821 20410514 25. Samanta J. Dhar J. Muktesh G. Gupta P. Kumar M.P. Das A. Agarwala R. Bellam B.L. Chauhan R. Kumar K.H. Endoscopic drainage versus percutaneous drainage for the management of infected walled-off necrosis: A comparative analysis Expert Rev. Gastroenterol. Hepatol. 2022 16 297 305 10.1080/17474124.2022.2047649 35227141 26. Di Candio G. Guadagni S. Furbetta N. Gianardi D. Palmeri M. Di Franco G. Bianchini M. Gambaccini D. Marciano E. Cervelli R. A “tailored” interventional and surgical management for moderate to critical acute pancreatitis in late phase: A cohort study Langenbeck’s Arch. Surg. 2022 407 2833 2841 10.1007/s00423-022-02557-x 35639137 27. Ebrahim M. Werge M.P. Hadi A. Lahchich M. Nagras Z.G. Lauritsen M.L. Schmidt P.N. Hansen E.F. Novovic S. Karstensen J.G. Clinical outcomes following endoscopic or video-assisted retroperitoneal management of acute pancreatitis with large (>15 cm) walled-off pancreatic necrosis: Retrospective, single tertiary center cohort study Dig. Endosc. 2022 34 1245 1252 10.1111/den.14295 35258123 28. Baroud S. Chandrasekhara V. Storm A.C. Law R.J. Vargas E.J. Levy M.J. Mahmoud T. Bazerbachi F. Bofill-Garcia A. Ghazi R. A Protocolized Management of Walled-Off Necrosis (WON) Reduces Time to WON Resolution and Improves Outcomes Clin. Gastroenterol. Hepatol. 2023 21 2543 2550.e1 10.1016/j.cgh.2023.04.029 37164115 29. Hollemans R.A. Timmerhuis H.C. Besselink M.G. Bouwense S.A.W. Bruno M. van Duijvendijk P. van Geenen E.-J. Hadithi M. Hofker S. E Van-Hooft J. Long-term follow-up study of necrotising pancreatitis: Interventions, complications and quality of life Gut 2024 73 787 796 10.1136/gutjnl-2023-329735 38267201 30. Bang J.Y. Lakhtakia S. Thakkar S. Buxbaum J.L. Waxman I. Sutton B. Memon S.F. Singh S. Basha J. Singh A. Upfront endoscopic necrosectomy or step-up endoscopic approach for infected necrotising pancreatitis (DESTIN): A single-blinded, multicentre, randomised trial Lancet Gastroenterol. Hepatol. 2024 9 22 33 10.1016/S2468-1253(23)00331-X 37980922 31. Cahyadi O. Dhir V. Leeds J. de-Madaria E. Tehami N. The DESTIN trial: To step up or not? Lancet Gastroenterol. Hepatol. 2024 9 289 10.1016/S2468-1253(24)00008-6 38460533 32. Avudiappan M. Bhargava V. Kulkarni A. Kang M. Rana S.S. Gupta R. Evaluating the role of the Minimal Incision Retroperitoneal Necrosectomy (MIRN) in the management of infected pancreatic necrosis: Experience from a tertiary care center Surg. Open Sci. 2023 15 38 42 10.1016/j.sopen.2023.07.004 37609368 PMC10440548 33. Rana S.S. Sharma R. Kishore K. Dhalaria L. Gupta R. Safety and Efficacy of Early (<4 Weeks of Illness) Endoscopic Transmural Drainage of Post-acute Pancreatic Necrosis Predominantly Located in the Body of the Pancreas J. Gastrointest. Surg. 2021 25 2328 2335 10.1007/s11605-021-04945-y 33547585 34. Kahaleh M. Sundaram V. Condron S.L. De La Rue S.A. Hall J.D. Tokar J. Friel C.M. Foley E.F. Adams R.B. Yeaton P. Temporary placement of covered self-expandable metallic stents in patients with biliary leak: Midterm evaluation of a pilot study Gastrointest. Endosc. 2007 66 52 59 10.1016/j.gie.2006.07.036 17324415 35. Rizzatti G. Rimbas M. Impagnatiello M. Gasbarrini A. Costamagna G. Larghi A. Endorotor-Based Endoscopic Necrosectomy as a Rescue or Primary Treatment of Complicated Walled-off Pancreatic Necrosis A Case Series. J. Gastrointest. Liver Dis. 2020 29 681 684 10.15403/jgld-2534 33118541 36. Brand M. Bachmann J. Schlag C. Huegle U. Rahman I. Wedi E. Walter B. Möschler O. Sturm L. Meining A. Over-the-scope-grasper: A new tool for pancreatic necrosectomy and beyond—First multicenter experience World J. Gastrointest. Surg. 2022 14 799 808 10.4240/wjgs.v14.i8.799 36157364 PMC9453329 37. Bomman S. Sanders D. Coy D. La Selva D. Pham Q. Zehr T. Law J. Larsen M. Irani S. Kozarek R.A. Safety and clinical outcomes of early dual modality drainage (< 28 days) compared to later drainage of pancreatic necrotic fluid collections: A propensity score-matched study Surg. Endosc. 2023 37 902 911 10.1007/s00464-022-09561-8 36038648 38. Bomman S. Canakis A. Masood M. Klair J.S. Alvarez R. Muthusamy A. Chandra S. Aggarwal A. Gavini H. Krishnamoorthi R. Early versus late drainage of pancreatic necrotic fluid collections: A systematic review and meta-analysis Ann Gastroenterol. 2025 38 221 229 10.20524/aog.2025.0955 40124432 PMC11928901 39. Abdallah M. Vantanasiri K. Young S. Azeem N. Amateau S.K. Mallery S. Freeman M.L. Trikudanathan G. Visceral artery pseudoaneurysms in necrotizing pancreatitis: Risk of early bleeding with lumen-apposing metal stents Gastrointest. Endosc. 2022 95 1150 1157 10.1016/j.gie.2021.11.030 34871553 40. Guo X. Tong H. Chen L.X. Wu M.J. Liu T.Q. Mao X.X. Xie J. Yang F. Zhou D. Quan X. Prevalence, treatment efficacy, and risk factors of vascular complications in acute pancreatitis: A case-control study J. Dig. Dis. 2024 25 318 327 10.1111/1751-2980.13275 38850211 41. Madhusudhan K.S. Gopi S. Singh A.N. Agarwal L. Gunjan D. Srivastava D.N. Garg P.K. Immediate and Long-Term Outcomes of Percutaneous Radiological Interventions for Hemorrhagic Complications in Acute and Chronic Pancreatitis J. Vasc. Interv. Radiol. 2021 32 1591 1600.e1 10.1016/j.jvir.2021.08.004 34416367 42. Gabrielli D. Taglialatela F. Mantini C. Giammarino A. Modestino F. Cotroneo A.R. Endovascular Treatment of Visceral Artery Pseudoaneurysms in Patients with Chronic Pancreatitis: Our Single-Center Experience Ann. Vasc. Surg. 2017 45 112 116 10.1016/j.avsg.2017.05.035 28602898 43. Talwar A. Knight G. Al Asadi A. Entezari P. Chen R. Resnick S. Komanduri S. Gabr A. Thornburg B. Salem R. Post-embolization outcomes of splenic artery pseudoaneurysms: A single-center experience Clin. Imaging 2021 80 160 166 10.1016/j.clinimag.2021.07.007 34332465 44. Jagielski M. Piątkowski J. Jackowski M. Endoscopic treatment of pancreaticopleural fistulas Front. Cell. Infect. Microbiol. 2022 12 939137 10.3389/fcimb.2022.939137 36262187 PMC9574034 45. Kayyal L. Al-Khafaji M.Q.M. Al-Khafaji M.Q. Mehta A. Kayyal R. Al-Khafaji Y.Q. Akilimali A. Al Hasani A. Management of pancreaticopleural fistulas secondary to pancreatitis: A systematic review Int. J. Surg. 2025 111 5572 5581 10.1097/JS9.0000000000002610 40471750 46. Kozarek R.A. Traverso L.W. Pancreatic fistulas: Etiology, consequences, and treatment Gastroenterologist 1996 4 238 244 8957097 47. Verma S. Rana S.S. Disconnected pancreatic duct syndrome: Updated review on clinical implications and management Pancreatology 2020 20 1035 1044 10.1016/j.pan.2020.07.402 32800651 48. Takenaka M. Saito T. Hamada T. Omoto S. Shiomi H. Iwashita T. Masuda A. Matsubara S. Maruta A. Iwata K. Disconnected pancreatic duct syndrome: Diagnostic and therapeutic challenges and future directions Expert Rev. Gastroenterol. Hepatol. 2024 18 631 645 10.1080/17474124.2024.2419056 39420546 49. Koutlas N. Bentley B. Dorrell R. Ferris T. Pawa R. Clinical outcomes of long-term transmural drainage with double pigtail stents in disconnected pancreatic duct syndrome Transl. Gastroenterol. Hepatol. 2024 9 4 10.21037/tgh-23-94 38317752 PMC10838617 50. Chong E. Ratnayake C.B. Saikia S. Nayar M. Oppong K. French J.J. Windsor J.A. Pandanaboyana S. Endoscopic transmural drainage is associated with improved outcomes in disconnected pancreatic duct syndrome: A systematic review and meta-analysis BMC Gastroenterol. 2021 21 87 10.1186/s12876-021-01663-2 33632128 PMC7905849 51. ASGE Standards of Practice Committee Sheth S.G. Machicado J.D. Chalhoub J.M. Forsmark C. Zyromski N. Thosani N.C. Thiruvengadam N.R. Ruan W. Pawa S. American Society for Gastrointestinal Endoscopy guideline on the role of endoscopy in the management of chronic pancreatitis: Summary and recommendations Gastrointest. Endosc. 2024 100 584 594 10.1016/j.gie.2024.05.016 39115496 52. Jearth V. Giri S. Sundaram S. Approach to management of pancreatic strictures: The gastroenterologist’s perspective Clin. J. Gastroenterol. 2021 14 1587 1597 10.1007/s12328-021-01503-6 34405382 53. Strand D.S. Law R.J. Yang D. Elmunzer B.J. AGA Clinical Practice Update on the Endoscopic Approach to Recurrent Acute and Chronic Pancreatitis: Expert Review Gastroenterology 2022 163 1107 1114 10.1053/j.gastro.2022.07.079 36008176 54. Bang J.Y. Arnoletti J.P. Holt B.A. Sutton B. Hasan M.K. Navaneethan U. Feranec N. Wilcox C.M. Tharian B. Hawes R.H. An Endoscopic Transluminal Approach, Compared with Minimally Invasive Surgery, Reduces Complications and Costs for Patients with Necrotizing Pancreatitis Gastroenterology 2019 156 1027 1040.e3 10.1053/j.gastro.2018.11.031 30452918 55. Tran Z. Xu J. Verma A. Ebrahimian S. Cho N.Y. Benharash P. Burruss S. National trends and clinical outcomes of interventional approaches following admission for infected necrotizing pancreatitis in the United States J. Trauma Acute Care Surg. 2023 94 665 671 10.1097/TA.0000000000003934 36805574 56. Farooq U. Abbasi A.F. Tarar Z.I. Chaudhary A.J. Kamal F. Understanding the role of frailty in local and systemic complications and healthcare resource utilization in acute pancreatitis: Findings from a national cohort Pancreatology 2024 24 6 13 10.1016/j.pan.2023.12.001 38072685 57. Greenberg J.A. Hsu J. Bawazeer M. Marshall J. Friedrich J.O. Nathens A. Coburn N. May G.R. Pearsall E. McLeod R.S. Clinical practice guideline: Management of acute pancreatitis Can. J. Surg. 2016 59 128 140 10.1503/cjs.015015 27007094 PMC4814287 Figures, Schemes and Tables Figure 1 Small arrows demonstrate retained common bile duct stones in this patient with a Roux-en-Y gastric bypass, intact gallbladder, and gallstone pancreatitis. Larger arrows outline gastric staple line and roux limb, respectively. Post-operative anatomy makes endoscopic retrograde cholangiopancreatography access difficult requiring balloon-assisted enteroscopy or an endoscopic ultrasound-directed transgastric endoscopic retrograde cholangiopancreatography (EDGE) procedure demonstrated in Scheme 1 jcm-14-06683-sch001_Scheme 1 Scheme 1 Endoscopic ultrasound-directed transgastric endoscopic retrograde cholangiopancreatography (EDGE) procedure in the patient depicted in Figure 1 A B C D E F G jcm-14-06683-sch002_Scheme 2 Scheme 2 ( Left Right Figure 2 Current Guidelines for Infected Pancreatic Necrosis. jcm-14-06683-sch003_Scheme 3 Scheme 3 ( A B C D E F G H Figure 3 Fluoroscopic image with arrow which demonstrates embolization of a splenic artery aneurysm and its feeding vessels. The standard of care involves embolization of the parent artery with coil or gel foam. Note pigtail stents at a previous lumen apposing metal stent (LAMS) drainage site. Prolonged LAMS retention has been associated with an increased risk of erosion into contiguous blood vessels. jcm-14-06683-sch004_Scheme 4 Scheme 4 ( A A B C C jcm-14-06683-t001_Table 1 Table 1 The Role of Endoscopic Retrograde Cholangiopancreatography in Acute Pancreatitis. Biliary pancreatitis  Concomitant cholangitis Persistent choledocholithiasis Post-cholecystectomy Pre-laparoscopic cholecystectomy Severe acute pancreatitis  Biliary stent for common bile obstruction Pancreatic duct stent for pancreatic leak Biliary pancreatitis with cholecystitis and a poor surgical candidate  Transpapillary gallbladder stent placement jcm-14-06683-t002_Table 2 Table 2 The role of interventional radiology in acute pancreatitis. Acute pancreatic fluid collections  Drain placement Enteral nutrition  Placement of a feeding tube Acute symptomatic pancreatic fluid collections  Percutaneous drainage Necrotic fluid collections  Dual modality drainage Percutaneous access for video-assisted retroperitoneal debridement Pseudoaneurysm  Embolization using coils and gel foam Obstructive jaundice and a failed endoscopic retrograde cholangiopancreatography  Percutaneous transhepatic biliary drainage versus endoscopic ultrasound access Pancreatitis with acute cholecystitis and a poor surgical candidate  Percutaneous cholecystostomy Percutaneous transhepatic biliary drainage versus endoscopic ultrasound access jcm-14-06683-t003_Table 3 Table 3 The role of endoscopic ultrasound in acute pancreatitis. Diagnosis  Neoplasm Retained stone Infected fluid collections Walled-off necrosis  EUS-guided drainage Dual modality drainage Pancreatic pseudocyst  EUS-guided drainage Disconnected pancreatic duct syndrome  Endoscopic ultrasound +/− endoscopic retrograde cholangiopancreatography and interventional radiology Pancreatitis with acute cholecystitis and a poor surgical candidate  EUS-guided cholecystoduodenostomy Gastric outlet obstruction  EUS-guided gastroenterostomy Altered anatomy  EDGE (EUS-directed transgastric endoscopic retrograde cholangiopancreatography) ",
  "metadata": {
    "Title of this paper": "Clinical practice guideline: Management of acute pancreatitis",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470711/"
  }
}