{
  "title": "Paper_374",
  "abstract": "pmc Eur J Heart Fail Eur J Heart Fail 379 blackwellopen EJHF European Journal of Heart Failure 1388-9842 1879-0844 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12482844 PMC12482844.1 12482844 12482844 40600695 10.1002/ejhf.3714 EJHF3714 1 Research Article MEDICAL THERAPY Research Article Exploring safety of down‐titrating diuretics in heart failure management Down‐titrating diuretics in HF management C.B.G. Geraeds et al. Geraeds Chrit B.G. https://orcid.org/0009-0000-8804-8700  1  † chrit.geraeds@mumc.nl Bruninx Anke https://orcid.org/0000-0002-5916-8735  2  † Dekker Andre L.A.J. https://orcid.org/0000-0002-0422-7996  2 Barandiarán Aizpurua Arantxa https://orcid.org/0000-0002-3448-5531  1  3 Bermejo Inigo https://orcid.org/0000-0001-9105-8088  2  ‡ Brunner‐La Rocca Hans‐Peter https://orcid.org/0000-0002-4356-8566  1  3  ‡   1 Department of Cardiology CARIM, Maastricht University Medical Centre Maastricht The Netherlands   2 Department of Radiation Oncology (MAASTRO) GROW Research Institute for Oncology and Reproduction, Maastricht University Medical Centre Maastricht The Netherlands   3 Cardiology, Maastricht University Medical Centre Maastricht The Netherlands * chrit.geraeds@mumc.nl † Shared first authorship. ‡ Shared last authorship. 02 7 2025 8 2025 27 8 497821 10.1002/ejhf.v27.8 1393 1399 30 4 2025 10 1 2025 08 5 2025 30 09 2025 01 10 2025 01 10 2025 © 2025 The Author(s). European Journal of Heart Failure https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Aims Loop diuretics are widely used in heart failure (HF) for symptom relief. Guidelines advise treating patients with the lowest possible dose of loop diuretics to maintain euvolaemia, based on expert opinion only. However, data on the safety of this practice are scarce. This analysis aims to investigate the clinical course after changing loop diuretics in stable HF patients. Methods and results A post‐hoc analysis from the TIME‐CHF study was conducted in 622 patients. Daily loop diuretic doses were meticulously recorded, resulting in 11 035 dose evaluations assessed. The frequency of relevant events within 30 days (hospitalization, death, dose change) following an up‐titration, down‐titration, or no change in diuretic therapy was calculated. Risk of hospitalization and deaths 30 days after down‐titration was estimated after adjusting for congestion level. At baseline the cohort consisted mostly of males (59%), with a mean age of 77 years. Patients were highly symptomatic with 76% classified as New York Heart Association class III or IV. Within 30 days after a down‐titration, diuretic dose necessitated an increase in 30.4% of cases, compared with 20.7% following up‐titration and 8.0% on a stable dose. Hospitalization and death were significantly more frequent following down‐titration (3.4% and 2% within 30 days, respectively) than with a stable dose (1% and 0.6%, p Conclusions There is a significant risk that reduction in diuretic dose requires restart or increase of diuretics within a short period. Additionally, there may be a significant risk associated with diuretic dose reduction. Therefore, HF patients need to be closely monitored after down‐titration of loop diuretic therapy. Heart failure Diuretics Therapy Safety ZonMW 10.13039/501100001826 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date August 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025 Introduction Heart failure (HF) is a chronic disease that is characterized by an array of debilitating signs and symptoms.  1  2  3  4  5  6  7  8 In the management of HF, the core objectives are to stabilize the disease, relieve patients of their symptoms, and prevent or minimize episodes of decompensation.  9  1  1  10  11 To gain further insight into the effects of changes in diuretic therapy, we conducted a retrospective post‐hoc analysis using data from the Trial of Intensified versus standard Medical therapy in Elderly patients with Congestive Heart Failure (TIME‐CHF), which provides daily information on all drugs used including doses during 18 months. Our primary aim was to provide a more data‐driven perspective on the effects and implications of changes in loop diuretic therapy in HF patients. Methods Data and subjects The TIME‐CHF database was established between 2003 and 2008 in Switzerland and Germany. The design and main results of the study have previously been published.  12  13  14  12  15 The TIME‐CHF study was approved by the Ethics Committee of Basel, Switzerland, and of all local centres and by the Swiss and German regulatory bodies. No additional ethical approval was acquired for this project. Pre‐processing All patients retrospectively suspected of palliative care were excluded from the analysis, since this might lead to an overestimation of mortality following down‐titration. These patients were characterized as follows: the last dose change was a down‐titration to 0 mg (in other words, cancellation of the loop diuretic therapy) and death occurred within 7 days after cancellation of the loop diuretic therapy. Statistical analyses Using this dataset, we undertook two different analyses. Firstly, we segmented each patient's follow‐up time into intervals lasting until the next event (dose change, hospitalization, or death) or 30 days of dose maintenance, whichever occurred first. We then calculated 30 day frequencies of hospitalization for worsening of HF, death or dose changes subsequent to down‐titration, up‐titration, dose maintenance or hospital discharge. To quantify the uncertainty around these estimates, we calculated bootstrapped 95% confidence intervals (CI). We excluded from this analysis the time patients spent in the hospital due to worsening HF. Consequently, intravenous diuretics administered during hospitalization were not considered, and only diuretic dose adjustments made in the outpatient setting were included. Secondly, we aimed to assess whether the difference in outcomes in patients whose dose was down‐titrated remained after adjusting for confounding factors (i.e. patients whose dose was down‐titrated being more severely ill than those who did not). In this analysis, we looked at the 30 days after each evaluation, excluding the final assessment at 18 months, after which dose information was not collected. We fitted models to predict the probability of congestive HF‐related hospitalization and mortality utilizing the congestion score and whether the patient's dose had been down‐titrated after the visit or had remained unchanged as predictive factors. Patients whose dose was up‐titrated were excluded from this analysis to prevent the effect of up‐titrations in the comparator group obfuscating the assessment of the effect of down‐titration. Our objective in adjusting for the congestion score was to minimize potential confounding effects. We then used the parametric g‐formula to estimate the causal effect of down‐titration versus no dose change on congestive HF‐related hospitalization and mortality.  16  17 Results At baseline, our study population consisted of slightly more men, accounting for 59% ( n n Table  1 Table 1 Demographics, baseline characteristics, and comorbidities Demographics Patients, n 622 Age, years, mean ± SD 77 ± 8 Male sex, n 369 (59) BMI, kg/m 2 26 ± 4 Preserved LVEF >45%, n 123 (20) Baseline characteristics Systolic blood pressure, mmHg, median [IQR] 120 [110–135] Diastolic blood pressure, mmHg, median [IQR] 70 [65–84] Heart rate, bpm, median [IQR] 74 [65–84] NYHA class, n II 149 (24) III 388 (62) IV 85 (14) Fatigue, n 534 (86) Angina, n 125 (20) Orthopnoea, n 422 (68) Nocturia, n 530 (85) Oedema, n 260 (42) Orthostasis, n 292 (47) Dizziness, n 195 (31) Syncope, n 47 (8) Rales, n 280 (45) Jugular vein distension, n 372 (60) NT‐proBNP, pg/ml, median [IQR] 3836 [1916–6905] Creatinine, μmol/L, median [IQR] 108 [87–140] LVEF, %, median [IQR] 23 [25–42] Comorbidities, n Coronary artery disease 400 (64) Hypertension 462 (74) Hypercholesterolaemia 303 (49) Kidney disease 355 (57) COPD 124 (20) Diabetes mellitus 222 (36) Stroke/TIA 98 (16) Cancer 86 (14) BMI, body mass index; COPD, chronic obstructive pulmonary disease; IQR, interquartile range; LVEF, left ventricular ejection fraction; NT‐proBNP, N‐terminal pro‐B‐type natriuretic peptide; NYHA, New York Heart Association; SD, standard deviation; TIA, transient ischaemic attack.  Table  2 p Graphical Abstract  Tables Table 2 Frequency of events (in percentages) in 30 day intervals after dose changes, hospital discharge, or dose maintenance After  n Deceased Hospital admission Up‐titration Down‐titration No event Dose maintenance 8177 0.6 (0.5–0.8) 1.0 (0.8–1.3) 8.0 (7.4–8.6) 7.6 (7.1–8.2) 82.7 (81.9–83.6) Down‐titration 1327 2.0 (1.3–2.8) 3.4 (2.4–4.4) 30.4 (27.7–32.7) 16.3 (14.2–18.4) 48.0 (45.3–50.7) Up‐titration 1368 1.2 (0.7–1.8) 3.6 (2.6–4.7) 20.7 (18.6–23) 34.1 (31.5–36.6) 40.5 (37.9–43.2) Hospital discharge 163 6.1 (3.1–10.4) 6.7 (3.1–11) 19.6 (13.5–25.8) 17.2 (11.7–22.7) 50.3 (42.9–58.3) Bootstrapped 95% confidence intervals in parenthesis. The reason for change in diuretic therapy was coded in all cases. Up‐titration was related to signs and symptoms of decompensation in 95% of cases. In 2% of cases, up‐titration was solely related to the study protocol in the NT‐proBNP‐guided group,  12 For the second analysis, we fitted regression models to estimate the probability of HF‐related hospitalization and death within 30 days after a follow‐up visit using two predictors: the patient's congestion score at the evaluation and a binary variable determining whether a patient's dose had been down titrated or had remained the same. The number of samples to fit the model was 1786 with 34 hospitalizations for HF and 16 deaths. The models (summarized in Table  3 p p Table  4 Table 3 Summary of models to estimate the risk of hospitalization for congestive heart failure and death Estimate Standard error  p Hospitalization due to worsening of CHF Intercept 0.001 0.004 0.8516 Down‐titration 0.023 0.011 0.0342 Congestion score 0.010 0.002 <0.001 Death Intercept −0.001 0.002 0.740 Down‐titration 0.013 0.007 0.0625 Congestion score 0.005 0.001 <0.001 CHF, congestive heart failure. Table 4 Risk of hospitalization and death 30 days after down‐titration or dose change as estimated with the parametric g‐formula No dose change Down‐ titration Difference Hospitalization due to worsening of CHF 0.015 0.038 0.023 Death 0.006 0.019 0.013 CHF, congestive heart failure. Discussion Our findings show that approximately one‐third of patients require swift reinitiation or an increase of the dose after down‐titration and both hospitalization and mortality were increased. Thus, caution is advisable if down‐titration is intended. Current recommendations by guidelines are mostly based on expert opinion with little scientific evidence. Our data emphasize the need to further investigate this practice and prospectively investigate the true risks and benefits of reducing loop diuretic therapy in HF patients who seem to be clinically stable based on signs and symptoms only. A recent article by Felker et al  18 et al  19 et al  20 et al  20  15 Typically, up‐titration is needed to treat symptoms of congestion due to a destabilization of the disease. Our findings highlight that in approximately one‐third of down‐titration or cessation of diuretic therapy, an escalation in diuretic dosage was required within 30 days, indicating disease destabilization subsequent to down‐titration in a significant number of patients. In some cases, a renewed up‐titration of oral diuretics even seemed to be insufficient to re‐stabilize a patient and further clinical intervention was needed, as indicated in the increased need for (re)hospitalizations. Some patients even died. Thus, while well‐intentioned, down‐titration can potentially precipitate a state of decompensation, which is accompanied with a worse outcome.  21  22 Indeed, the need for up‐titration was also related to worse outcomes in our study. This may be expected as the intervention may be (too) late and not all hospitalizations can be prevented. Interestingly, poor outcomes—that is, death or hospitalization—occurred in only about 5% within 7 days, suggesting that up‐titration of diuretic therapy was effective in preventing hospitalization in the majority of cases. Little evidence can be found on the effects of up‐titration of (oral) diuretics on the prevention of hospitalizations. A systematic review by Wierda et al  23 A long‐term registry investigating the association between loop diuretic dose changes at baseline and outcomes in chronic HF after 12 months concluded that diuretic dose increase was associated with HF death.  24 While diuretic dose escalation is widely recognized as a response to worsening congestion and disease progression, often correlating with increased mortality risk,  25  24 Clinical assessment of fluid status is challenging, and signs and symptoms often occur late.  10  11  10  11  26  27  28 This study has several limitations that need to be mentioned. Firstly and most importantly, this was a post‐hoc analysis and patients were not randomized to down‐titration versus stable diuretic therapy. Therefore, our results are hypothesis‐generating only. Secondly, a major limitation of our work is the lack of other HF medication usage and dosage of patients during the trial. These can strongly affect the stability of HF patients and influence the decision‐making of clinicians with regard to diuretics. Thirdly, the exact volume status was not known at the time of dose change if done outside of study visits, nor is the application of fluid or salt restriction known for patients. This is of particular importance in the case of renal dysfunction, which may be related to different reasons including both dehydration and volume overload. Also, hypotension may be caused by dehydration or worsening of HF. Thus, it cannot be excluded that down‐titration was done despite volume overload in some cases. Nevertheless, the availability of information on why diuretic doses were changed is a major strength of our study. It is essential to recognize that the data on which these results are founded dates back several years.  12  29  30  1  31 We should use caution in drawing concrete conclusions about patient outcomes as our dataset does not provide evidence on the effects of diuretic therapy on outcomes. While our study revealed higher mortality rates after dose reduction, it is imperative to underscore the necessity for prospective research to explore the relationship between dose reduction and patient outcomes. Conclusion Re‐evaluation of the current belief in the need for dose reduction of loop diuretics is required. Our study highlights that caution is required if diuretic dosages are reduced in the management of HF patients as currently advised. We have observed a notable risk of needing to reinitiate or increase diuretics within a short timeframe following such reductions. In addition, there may be an increased risk involved. Prospective interventional studies are needed to define the exact role of diuretics in HF and understand the long‐term risks and benefits of adjusting diuretic therapy. Supporting information  Supplementary table 1:  Supplementary table 2: Acknowledgements Graphical abstract created in BioRender. Geraeds, C. (2024) BioRender.com/s73v912 Funding This work was supported by ZonMW under the Innovative Medical Devices Initiative (IMDI) project number 1040022004.  Conflict of interest References 1 McDonagh TA Metra M Adamo M Gardner RS Baumbach A Böhm M et al 2021 ESC Guidelines for the diagnosis and treatment of acute and chronic heart failure Eur Heart J 2021 42 3599 3726 10.1093/eurheartj/ehab368 34447992 2 Mueller TM Vuckovic KM Knox DA Williams RE Telemanagement of heart failure: A diuretic treatment algorithm for advanced practice nurses Heart Lung 2002 31 340 347 10.1067/mhl.2002.126048 12487012 3 Allen LA O'Connor CM Management of acute decompensated heart failure CMAJ 2007 176 797 805 10.1503/cmaj.051620 17353535 PMC1808524 4 Felker GM Mentz RJ Diuretics and ultrafiltration in acute decompensated heart failure J Am Coll Cardiol 2012 59 2145 2153 10.1016/j.jacc.2011.10.910 22676934 5 Pham D Grodin JL Dilemmas in the dosing of heart failure drugs: Titrating diuretics in chronic heart failure Card Fail Rev 2017 3 108 112 10.15420/cfr.2017:10:1 29387462 PMC5789220 6 Lippi G Sanchis‐Gomar F Global epidemiology and future trends of heart failure AME Med J 2020 5 15 10.21037/amj.2020.03.03 7 Patel J Heart failure population health considerations Am J Manag Care 2021 27 S191 S195 10.37765/ajmc.2021.88673 34042417 8 Urbich M Globe G Pantiri K Heisen M Bennison C Wirtz HS et al A systematic review of medical costs associated with heart failure in the USA (2014–2020) Pharmacoeconomics 2020 38 1219 1236 10.1007/s40273-020-00952-0 32812149 PMC7546989 9 Cohn JN Overview of the treatment of heart failure Am J Cardiol 1997 80 2L 6L 10.1016/s0002-9149(97)00843-6 9412537 10 Abraham WT Adamson PB Bourge RC Aaron MF Costanzo MR Stevenson LW et al CHAMPION Trial Study Group Wireless pulmonary artery haemodynamic monitoring in chronic heart failure: A randomised controlled trial Lancet 2011 377 658 666 10.1016/S0140-6736(11)60101-3 21315441 11 Brugts JJ Radhoe SP Clephas PRD Aydin D van Gent MWF Szymanski MK et al Remote haemodynamic monitoring of pulmonary artery pressures in patients with chronic heart failure (MONITOR‐HF): A randomised clinical trial Lancet 2023 401 2113 2123 10.1016/S0140-6736(23)00923-6 37220768 12 Brunner‐La Rocca HP Buser PT Schindler R Bernheim A Rickenbacher P Pfisterer M Management of elderly patients with congestive heart failure – design of the Trial of Intensified versus standard Medical therapy in Elderly patients with Congestive Heart Failure (TIME‐CHF) Am Heart J 2006 151 949 955 10.1016/j.ahj.2005.10.022 16644310 13 Pfisterer M Buser P Rickli H Gutmann M Erne P Rickenbacher P et al TIME‐CHF Investigators BNP‐guided vs symptom‐guided heart failure therapy: The Trial of Intensified vs standard Medical therapy in Elderly patients with Congestive Heart Failure (TIME‐CHF) randomized trial JAMA 2009 301 383 392 10.1001/jama.2009.2 19176440 14 Maeder MT Rickenbacher P Rickli H Abbühl H Gutmann M Erne P et al TIME‐CHF Investigators N‐terminal pro brain natriuretic peptide‐guided management in patients with heart failure and preserved ejection fraction: Findings from the Trial of Intensified versus standard Medical therapy in Elderly patients with Congestive Heart Failure (TIME‐CHF) Eur J Heart Fail 2013 15 1148 1156 10.1093/eurjhf/hft076 23657728 15 Simonavičius J Sanders van‐Wijk S Rickenbacher P Maeder MT Pfister O Kaufmann BA et al Prognostic significance of longitudinal clinical congestion pattern in chronic heart failure: Insights from TIME‐CHF trial Am J Med 2019 132 e679 e692 10.1016/j.amjmed.2019.04.010 31051151 16 Hernan MA Robins JM Causal Inference: What if 1st ed. Boca Raton, FL Taylor & Francis Group 2024 17 R Development Core Team R: A Language and Environment for Statistical Computing. 4.2.1 Vienna, Austria R Foundation for Statistical Computing 2010 18 Felker GM Ellison DH Mullens W Cox ZL Testani JM Diuretic therapy for patients with heart failure: JACC state‐of‐the‐art review J Am Coll Cardiol 2020 75 1178 1195 10.1016/j.jacc.2019.12.059 32164892 19 Magdy JS McVeigh J Indraratna P Diuretics in the management of chronic heart failure: When and how Aust Prescr 2022 45 200 204 10.18773/austprescr.2022.069 36479331 PMC9722345 20 Rohde LE Rover MM Figueiredo Neto JA Danzmann LC Bertoldi EG Simões MV et al Short‐term diuretic withdrawal in stable outpatients with mild heart failure and no fluid retention receiving optimal therapy: A double‐blind, multicentre, randomized trial Eur Heart J 2019 40 3605 3612 10.1093/eurheartj/ehz554 31424503 21 Solomon SD Dobson J Pocock S Skali H McMurray JJ Granger CB et al Candesartan in Heart failure: Assessment of Reduction in Mortality and morbidity (CHARM) Investigators Influence of nonfatal hospitalization for heart failure on subsequent mortality in patients with chronic heart failure Circulation 2007 116 1482 1487 10.1161/CIRCULATIONAHA.107.696906 17724259 22 Setoguchi S Stevenson LW Schneeweiss S Repeated hospitalizations predict mortality in the community population with heart failure Am Heart J 2007 154 260 266 10.1016/j.ahj.2007.01.041 17643574 23 Wierda E Dickhoff C Handoko ML Oosterom L Kok WE de Rover Y et al Outpatient treatment of worsening heart failure with intravenous and subcutaneous diuretics: A systematic review of the literature ESC Heart Fail 2020 7 892 902 10.1002/ehf2.12677 32159279 PMC7261522 24 Kapelios CJ Laroche C Crespo‐Leiro MG Anker SD Coats AJS Díaz‐Molina B et al Heart Failure Long‐Term Registry Investigators Group Association between loop diuretic dose changes and outcomes in chronic heart failure: Observations from the ESC‐EORP Heart Failure Long‐Term Registry Eur J Heart Fail 2020 22 1424 1437 10.1002/ejhf.1796 32237110 25 Felker GM O'Connor CM Braunwald E Loop diuretics in acute decompensated heart failure: Necessary? Evil? A necessary evil? Circ Heart Fail 2009 2 56 62 10.1161/CIRCHEARTFAILURE.108.821785 19750134 PMC2742422 26 Núñez J de la Espriella R Rossignol P Voors AA Mullens W Metra M et al Congestion in heart failure: A circulating biomarker‐based perspective. A review from the Biomarkers Working Group of the Heart Failure Association, European Society of Cardiology Eur J Heart Fail 2022 24 1751 1766 10.1002/ejhf.2664 36039656 27 Suarez J Niyyar VD Lung ultrasound: A “biomarker” for fluid overload? Adv Chronic Kidney Dis 2021 28 200 207 10.1053/j.ackd.2021.03.003 34906304 28 Raghu A Schlesinger D Pomerantsev E Devireddy S Shah P Garasic J et al ECG‐guided non‐invasive estimation of pulmonary congestion in patients with heart failure Sci Rep 2023 13 3923 10.1038/s41598-023-30900-9 36894601 PMC9998622 29 Remme WJ Swedberg K Task Force for the Diagnosis and Treatment of Chronic Heart Failure, European Society of Cardiology Guidelines for the diagnosis and treatment of chronic heart failure Eur Heart J 2001 22 1527 1560 10.1053/euhj.2001.2783 11492984 30 Swedberg K Cleland J Dargie H Drexler H Follath F Komajda M et al Task Force for the Diagnosis and Treatment of Chronic Heart Failure of the European Society of Cardiology Guidelines for the diagnosis and treatment of chronic heart failure: Executive summary (update 2005): The Task Force for the Diagnosis and Treatment of Chronic Heart Failure of the European Society of Cardiology Eur Heart J 2005 26 1115 1140 10.1093/eurheartj/ehi204 15901669 31 Delanaye P Scheen AJ The diuretic effects of SGLT2 inhibitors: A comprehensive review of their specificities and their role in renal protection Diabetes Metab 2021 47 101285 10.1016/j.diabet.2021.101285 34597788 ",
  "metadata": {
    "Title of this paper": "The diuretic effects of SGLT2 inhibitors: A comprehensive review of their specificities and their role in renal protection",
    "Journal it was published in:": "European Journal of Heart Failure",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482844/"
  }
}