{
  "title": "Paper_1142",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467961 PMC12467961.1 12467961 12467961 41008559 10.3390/biom15091252 biomolecules-15-01252 1 Review Mitochondrial Aging in the CNS: Unravelling Implications for Neurological Health and Disease https://orcid.org/0009-0004-0301-0228 Steffan Davide 1 2 † https://orcid.org/0009-0007-3567-3925 Pezzini Camilla 1 2 † Esposito Martina 1 2 † https://orcid.org/0000-0002-2792-1200 Franco-Romero Anais 1 2 * Zaninello Marta Academic Editor Bean Camilla Academic Editor 1 davide.steffan@unipd.it camilla.pezzini@unipd.it martina.esposito.2@phd.unipd.it 2 * anais.franco@unipd.it † These authors contribute equally to this work. 29 8 2025 9 2025 15 9 497615 1252 21 7 2025 13 8 2025 22 8 2025 29 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Mitochondrial aging plays a central role in the functional decline of the central nervous system (CNS), with profound consequences for neurological health. As the brain is one of the most energy-demanding organs, neurons are particularly susceptible to mitochondrial dysfunction that arises with aging. Key features of mitochondrial aging include impaired mitochondrial dynamics, reduced mitophagy, increased production of reactive oxygen species (ROS), and accumulation of mitochondrial DNA (mtDNA) mutations. These alterations dramatically compromise neuronal bioenergetics, disrupt synaptic integrity, and promote oxidative stress and neuroinflammation, paving the path for the development of neurodegenerative diseases. This review also examines the complex mechanisms driving mitochondrial aging in the central nervous system (CNS), including the disruption of mitochondrial-organelle communication, and explores how mitochondrial dysfunction contributes to neurodegenerative diseases, such as Alzheimer’s, Parkinson’s, Huntington’s, and amyotrophic lateral sclerosis. By synthesizing current evidence and identifying key knowledge gaps, we emphasize the urgent need for targeted strategies to restore mitochondrial function, maintain cognitive health, and delay or prevent age-related neurodegeneration. aging mitophagy CNS neurodegenerative diseases This APC received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Aging involves a gradual decline of an organism’s functional status, leading to an increasing susceptibility to develop pathologies, as well as a higher risk of death with chronological age. This deteriorating process affects all tissues, including the central nervous system (CNS) and the brain, which is particularly vulnerable to the cumulative effects of cellular stress and metabolic dysfunction. Understanding the cellular and molecular mechanisms that drive age-associated decline has become a central focus of biomedical research. Among these mechanisms, mitochondrial dysfunction has emerged as a key contributor to aging and neurodegeneration. Mitochondria, often referred to as the “powerhouses” of the cell, are essential for ATP production through oxidative phosphorylation, regulation of calcium homeostasis, and control of apoptotic pathways. However, during aging, mitochondrial function progressively deteriorates. This decline is characterized by increased production of reactive oxygen species (ROS), accumulation of mitochondrial DNA (mtDNA) mutations, impaired dynamics (fission and fusion), and reduced mitophagy, the selective removal of damaged mitochondria. In the CNS, where neurons are highly energy-dependent and possess limited regenerative capacity, mitochondrial health is critical for maintaining synaptic function, neurotransmission, and overall cellular homeostasis. As a result, age-related mitochondrial dysfunction exacerbates neuronal vulnerability, and it is strongly implicated in the pathogenesis of several age-related neurodegenerative diseases, including Alzheimer’s disease, Parkinson’s disease, and amyotrophic lateral sclerosis. Emerging evidence also highlights a complex interplay between mitochondrial signaling and inflammation in the aging brain. Damaged mitochondria can release mtDNA and other danger-associated molecular patterns (DAMPs) into the cytosol or extracellular space, triggering innate immune responses and contributing to chronic neuroinflammation another hallmark of neurodegenerative conditions. Thus, mitochondria are not only central to cellular metabolism but also play a pivotal role in determining the fate and function of neural cells during aging. Our goal is to provide a comprehensive and up-to-date overview of mitochondrial defects during ageing that might trigger neurodegenerative diseases pathogenesis. For this we conducted a literature search using the PubMed database, focusing on recent publications from 2020 to 2025, supplemented by key earlier studies. Search terms included “mitochondria and aging” “CNS and aging,” “mitophagy,” “neurodegeneration,” and specific disease-related terms (such as “ALS and mitochondria”). Searches were refined for each topic to explore mechanisms in depth. We prioritized peer-reviewed studies based on scientific rigor and relevance for this review. This review will elucidate not only the different mechanisms linking mitochondrial dysfunction and CNS diseases but also highlight mitochondrial molecular targets that could potentially be modulated as therapeutic intervention to preserve cognition and delay neurodegeneration. 2. Mitochondrial Quality Control During Aging in CNS The maintenance of a healthy mitochondria pool through finely tuned mitochondria turn-over processes, namely, mitochondria degradation and biogenesis, is crucial to maintain optimal mitochondrial function and, consequently, neuronal health and viability. Indeed, in physiological conditions, mitochondria are constantly kept under strict quality-control. However, a decrease in a cell’s catabolic capacity and thus ineffective removal of non-functional and damaged subcellular components, contributes to the onset and progression of brain aging and the development of several pathological conditions. Consistently, mitochondrial quality progressively declines with aging and is extremely exacerbated in age-related neurological diseases [ 1 2 2.1. Decline in Mitophagy During Aging In mammals, the clearance of damaged mitochondria, both under physiological conditions and in response to cellular stressors, is primarily achieved through selective autophagy, known as mitophagy. Mitophagy, first identified in 2005 by Lemasters et al. [ 3 4 5 Mitophagy can be elicited through two different pathways: the PINK1/Parkin-dependent pathway, and the receptor-mediated, PINK1/Parkin-independent mechanism [ 6 6 7 8 9 10 The involvement of PINK1/Parkin signaling is particularly noted in the context of neurodegenerative diseases. Their levels are downregulated in Alzheimer’s, Parkinson’s, and amyotrophic lateral sclerosis (ALS), and are accompanied by aberrant mitophagy and/or impaired mitophagy flux in human brains [ 11 12 13 14 15 Notably, despite their cooperation in stress responses, PINK1 and Parkin have distinct subcellular localizations, and may perform independent functions under basal conditions [ 16 17 Beyond the ubiquitin-dependent mechanism, PINK1/Parkin-independent mitophagy plays a crucial role in maintaining mitochondrial health under normal conditions. Studies in PINK1-deficient mice [ 14 Drosophila 18 18 19 20 6 Drosophila 21 Drosophila As previously mentioned, an established consequence of altered mitophagy is cellular senescence. Cellular senescence is a critical feature of aging and has been recognized as the primary component of age-associated neurodegenerative disorders [ 22 23 12 13 17 Figure 1 24 25 26 27 28 29 30 31 32 33 The complexity of mitophagy regulation is further underscored by the prominent differences that have been characterized in basal mitophagy activity in neurons of different brain regions in vivo [ 34 7 35 36 37 38 39 40 41 42 42 43 Collectively, these studies strongly suggest that mitophagy must be tightly regulated to preserve neuronal function along with aging, since its dysregulation, whether increased or decreased, can affect brain homeostasis promoting neuropathology and neurodegeneration. 2.2. Dysregulation of Mitochondrial Dynamics During Aging in CNS Mitochondria form an interconnected network within the cell, and homeostasis of this network greatly affects cellular function and survival. Moreover, finely tuned mitochondrial dynamics allow effective adaptation of these organelles in response to various cellular needs and environmental cues [ 44 45 46 1 47 48 49 44 50 51 52 53 54 55 Figure 1 56 57 58 46 59 60 On the other hand, activated mitochondrial fission can be beneficial for the elimination of defective mitochondria fragments accumulated during aging. However, it has been suggested that increased expression of mitochondrial fission proteins may disrupt the mitochondrial membrane potential and inhibit the respiratory chain, leading to slower cell growth and exacerbated neuronal aging [ 46 61 62 63 C. elegans daf-2 64 65 66 67 46 68 Figure 1 Importantly, dysregulated mitochondrial fission was observed in inflamed microglia [ 69 70 71 72 Finally, it has recently been shown that the simultaneous overexpression of proteins regulating both mitochondrial fission and fusion despite (or perhaps due to) an increased level of mitochondrial fragmentation in C. elegans 73 All these evidences, together emphasize the relevance of developing therapeutic approaches that would maintain mitochondrial dynamics balance in order to actively improve health and lifespan, as well as to counteract CNS aging and neurodegenerative diseases development. 3. Energy Demands of the CNS During Aging The brain is one of the most highly energy-demanding organs, consuming almost 20% of the organism’s total oxygen and glucose [ 74 75 OXPHOS is also the main energy source for both microglia and oligodendrocytes under normal conditions. However, under specific neurological or pathological conditions, both cell types can shift toward aerobic or anaerobic glycolysis to meet their energy needs [ 76 77 78 On the other hand, astrocytes display a highly glycolytic metabolism, which results in the conversion of glucose into lactate, with low oxygen consumption; lactate is then transported to neurons where it is fully oxidized to produce ATP [ 79 80 Overall, glucose is the main source of energy in the brain, while ketone body metabolism is an optional source of energy in case of lack of glucose [ 81 Mitochondria located in neurons axons provide the ATP necessary for impulse conduction; therefore, their trafficking must be tightly regulated in synaptic terminals to meet the demands of multiple synaptic activities [ 82 Physiological cell activity is the result of a combination of established and maintained bioenergetic homeostasis. In the brain, this equilibrium is perturbed during aging, when there is an evident decline in energy metabolism [ 83 The ability of aging neurons to sustain axon sprouting and growth can be influenced by any alteration in OXPHOS and the electron transport chain (ETC) [ 84 85 86 A single-cell transcriptome atlas of the aged brain of Drosophila melanogaster 87 52 88 89 A recent study showed a molecular model of the neuro-glia-vascular system, capturing the complex interactions between brain metabolism, blood flow, and neuronal activity during aging using RNA sequencing data [ 90 Another recent study highlights that levels of succinylation, a novel post-translational modification (PTM) involved in regulating mitochondrial energy metabolism pathways, increase with aging [ 91 91 In conclusion, therapeutic strategies aimed at rebalancing OXPHOS and glycolysis, along with antioxidant treatment, may help delay neurodegeneration [ 92 4. Mitochondrial ROS Production and Oxidative Stress in the CNS Mitochondria are a major source of oxidative stress in neurons. Indeed, OXPHOS is not only essential for ATP production, but it also generates ROS such as superoxide anions and hydrogen peroxide, particularly at Complexes I, II, and III [ 93 94 95 The aging theory suggests that mtDNA damage accumulates over time, depleting NAD+ and increasing oxygen consumption and ATP production. This leads to mitochondrial hypercoupling, elevated membrane potential, increased production of free radicals, and decreased mitophagy. The cycle continues as free radicals cause further DNA damage [ 96 97 98 A recent study also demonstrated that ROS are involved in dysregulating the SMO-SHH-GLI signaling pathway [ 99 100 To counteract the ROS-induced oxidative damage, cells activate several antioxidant defences, including superoxide dismutase (SOD), catalase (CAT), and glutathione peroxidase (GSx), to maintain redox balance [ 101 102 103 In parallel, recent research suggests that caloric restriction might enhance the resilience of the central nervous system to neurodegenerative pathologies, most of which occur during aging, possibly by reducing ROS production and boosting neurotrophic factors and chaperones [ 104 105 106 5. Mitochondrial DNA Mutations During Aging Unlike nuclear DNA (nDNA), mitochondrial DNA (mtDNA) is polyploid, with each mitochondrion containing multiple copies of mtDNA. Consequently, mutations may be present in some, but not all, copies, a phenomenon known as heteroplasmy. mtDNA replication occurs both in coordination with cell division (strict replication) and independently of the cell cycle (relaxed replication). Furthermore, mtDNA is organized into nucleoprotein complexes called nucleoids, which are typically positioned near the inner mitochondrial membrane [ 107 mtDNA is significantly more susceptible to damage and mutation than nDNA [ 108 109 The accumulation of mtDNA damage has been implicated in a wide spectrum of pathological conditions, including neurodegenerative diseases, cancer, and metabolic disorders [ 110 111 112 113 114 115 Contrary to earlier beliefs that damaged mtDNA is simply degraded, current evidence supports the presence of active DNA repair mechanisms within mitochondria. Among these, base excision repair (BER) is the most extensively characterized and is responsible for correcting small base lesions, such as oxidized or deaminated nucleotides. This pathway is initiated by DNA glycosylases, including both mono-functional (e.g., AAG, MUTYH, UNG) and bi-functional enzymes (e.g., OGG1, NEIL1/2, NTHL1), which excise damaged bases to generate abasic sites. These are then processed by APE1 and PNKP, while DNA polymerase γ and ligase III complete the repair process [ 116 117 Moreover, mitochondrial fusion and fission help manage mtDNA damage: fusion dilutes harmful mutations by mixing contents, while fission isolates damaged components for removal via mitophagy. This clearance supports mitochondrial quality control and influences cellular signaling, including activation of the cGAS-STING pathway, thereby linking mtDNA damage to inflammation and innate immunity [ 118 119 Nonetheless, the mechanisms by which individual mtDNA deletions clonally expand to dominate within a cell remain poorly understood. Although stochastic models, such as that proposed by Elson et al. [ 120 121 122 123 124 125 A more recent and intriguing hypothesis is the “perinuclear niche” model in skeletal muscle [ 126 127 128 129 As with point mutations, inherited mtDNA deletions are often purged from mitotically active tissues such as blood [ 130 131 132 6. Mitochondrial-Nuclear Communication and How This Affects Health and Neuronal Function During Aging 6.1. Mitochondria–Nuclear Communication Mitochondria–nuclear communication represents a fundamental inter-organellar process essential for maintaining cellular homeostasis and balancing survival–death signaling under cellular stress [ 133 To date, studies on mitochondria–nucleus communication have primarily focused on signals sent from stressed mitochondria to the nucleus and the subsequent cellular responses, as well as on nuclear-to-mitochondrial communication in the context of DNA damage and repair. However, particularly during aging, this interaction can be seen as a dynamic, bidirectional dialogue with feedback mechanisms extending beyond these two organelles and influenced by various physiological cues [ 134 In neuronal cells, the relationship between mitochondria and the nucleus is especially intricate. Neurons rely heavily on oxidative phosphorylation (OXPHOS), making them particularly susceptible to oxidative stress caused by ROS production. Given that OXPHOS components are encoded by both mitochondrial and nuclear genomes, while the “ROS defense system” is exclusively nuclear-encoded, a well-coordinated supply of these factors is essential for sustaining ATP production and maintaining neuronal integrity. Additionally, the unique and highly specialized structure of neurons necessitates a continuous supply of nuclear-encoded mitochondrial proteins to support their extensive mitochondrial network [ 135 Given the central role of mitochondria in cellular metabolism, it is unsurprising that metabolites function as mitochondrial messengers capable of communicating with the nucleus, thereby rewiring key bioenergetic and stress-response signaling pathways [ 136 137 138 139 140 141 142 As previously mentioned, mitochondria become dysfunctional during aging. This dysfunction can trigger increased ROS production, mtDNA mutations, and impaired energy production, all of which might disrupt communication with the nucleus and further contribute to the aging process. Mitochondria-nucleus contact sites, also referred to as nucleus-associated mitochondria (NAMs), represent a recently described form of inter-organellar communication, in which mitochondria are physically tethered to the nuclear envelope. These structures facilitate the local exchange of signals, proteins, and possibly metabolites, supporting the maintenance of cellular homeostasis, particularly under stress conditions. These contacts are not randomly distributed but are mediated by conserved protein complexes that orchestrate their formation. In mammalian cells, components such as the translocator protein (TSPO) located on the mitochondrial outer membrane, and ACBD3 and PKA on the nuclear side are essential for establishing these tethers, suggesting a regulated and structured architecture. Additionally, ancient membrane pores like the voltage-dependent anion channel (VDAC) and nuclear pore complex-associated proteins have been implicated in bridging these organelles [ 143 144 Functionally, mitochondria–nucleus contact sites play a crucial role in coordinating the mitochondrial retrograde response (MRR), a signaling cascade activated upon mitochondrial dysfunction. MRR promotes the transcription of nuclear genes involved in stress adaptation, mitochondrial biogenesis, and metabolic reprogramming, ultimately helping to restore cellular homeostasis [ 144 In the CNS, where mitochondrial function is vital due to high energy demands and limited regenerative capacity, the role of NAMs may be particularly significant. These contacts could be essential in coordinating stress responses, regulating gene expression, and promoting neuronal survival and plasticity. Conversely, their disruption may compromise stress adaptation and contribute to the development or progression of neurodegenerative diseases. Although direct studies on NAMs within the CNS remain limited, altered mitochondrial dynamics and defective retrograde signaling, both potentially linked to NAM dysfunction, are well-established features of conditions such as Alzheimer’s disease, Parkinson’s disease, and amyotrophic lateral sclerosis. In summary, in the CNS, mitochondrial–nuclear communication is emerging as a key player in maintaining neuronal homeostasis by coordinating energy metabolism, redox balance, and stress responses. This bidirectional dialogue ensures the proper expression, transport, and function of mitochondrial proteins, thereby preserving neuronal integrity. 6.2. Mitochondrial–ER, Mitochondrial–Peroxisome, and Mitochondrial–Lysosomes Communication in Aging Recent research has highlighted the importance of specialized contact sites between mitochondria and other organelles, including the endoplasmic reticulum (ER) [ 145 146 147 148 Mitochondria-Associated Membranes (MAMs), the contact points between mitochondria and the ER, are essential for calcium homeostasis, lipid transfer, and mitochondrial dynamics [ 145 149 149 149 Mitochondria–lysosome contacts (MLCs) have also emerged as critical regulators of mitochondrial quality control and cellular metabolism [ 147 150 147 The interaction between mitochondria and peroxisomes is also affected by the aging process. These organelles cooperate in fatty acid oxidation and reactive oxygen species (ROS) metabolism [ 148 151 151 Mitochondria–organelle contact sites not only facilitate the exchange of lipids, calcium, and signaling molecules but also provide structural and spatial cues that influence mitochondria-derived vesicles (MDVs) biogenesis [ 152 153 154 153 154 The disruption of these inter-organelle contacts during aging contributes to a cascade of cellular dysfunctions, including impaired calcium homeostasis, increased oxidative stress, accumulation of misfolded proteins, and compromised energy metabolism [ 145 147 148 149 Understanding the intricate relationships between mitochondria and other cellular organelles presents promising avenues for therapeutic interventions. Potential strategies include enhancing MAM formation, improving MLC efficiency, stimulating MDV production, and restoring proper mitochondria–peroxisome interactions [ 145 147 154 In conclusion, mitochondrial inter-organelle contacts play a pivotal role in neuronal aging. Further research into these complex interactions will not only deepen our understanding of age-related neurodegeneration but also pave the way for novel therapeutic strategies to promote healthy brain aging. 7. Neurodegenerative Diseases and Mitochondrial Molecular Targets 7.1. Alzheimer’s Disease (AD) Alzheimer’s disease (AD) is the most common progressive neurodegenerative disorder worldwide, mainly affecting individuals over 65 years old [ 155 The neuropathological hallmarks of AD include the abnormal accumulation and aggregation of amyloid-β (Aβ) peptides in the extracellular compartment of the CNS forming so-called senile plaques (SPs), alongside the intracellular deposition of neurofibrillary tangles (NFTs), containing hyperphosphorylated tau (p-tau) protein [ 156 157 Key contributors to the neurodegenerative process in AD include neuroinflammation, mitochondrial dysfunction, excitotoxicity, and oxidative stress. Among these, mitochondrial impairment has been proposed as an early metabolic alteration and a major feature of the disease, playing a pivotal role as both a driver and predisposing factor in the onset and/or progression of AD ( Figure 2 158 More specifically, the aberrant accumulation of neuroinflammatory signals and p-tau NFTs in close proximity to mitochondria disrupts the mitochondrial membrane potential, triggering excessive production of reactive oxygen species (ROS). The resulting oxidative stress further compromises mitochondrial function [ 159 160 Figure 2 To date, numerous studies have demonstrated significant alterations affecting the content of various proteins involved in mitophagy, mitochondrial dynamics, and mitochondrial biogenesis in AD [ 157 Figure 2 7.1.1. Enhancing Mitophagy As discussed previously, impaired mitophagy is responsible for the excessive accumulation of damaged mitochondria observed in the brain tissue of both transgenic mouse models of AD and human AD patients. Specifically, in AD there is a reduction in PINK1, ULK1, BNIP3L, which reduces mitophagy and triggers the accumulation of damaged mitochondria [ 161 162 A. Activation of the PINK1/PARKIN pathway: Upregulation of PINK1 or PARKIN content has shown neuroprotective effects and therapeutic potential in the treatment of AD [ 163 24 25 164 165 B. Enhancing mitochondrial transport proteins: A recent study found that in AD, the presence of Aβ oligomers (Aβo) and amyloid precursor protein-C terminal fragments (APP-CTFs) alters the expression of several mitochondrial transport proteins, including SNPH and Miro1; adapter proteins such as TRANK1 and TRAK2; and components of the dynein and kinesin motor complexes, including Kif5A, Kif5B, and Kif5C. These proteins are crucial for axonal mitochondrial transport supporting mitophagy. Disruptions in their function contribute to impaired mitophagy and disease progression and restoring those genes showed improvement in AD pathogenesis [ 166 167 7.1.2. Decreasing Mitochondria Fragmentation Dysregulated mitochondrial dynamics compromise neuronal function via neuroinflammatory pathways [ 157 168 169 A. Inhibition of Fis1 and Drp1: Biochemical assessments of peripheral blood from AD patients showed significantly high levels of the mitochondrial fission factor Fis1, with post-mortem brain specimens further revealing upregulated Drp1 expression in AD cases [ 170 171 172 B. Promotion of mitochondria fusion via OPA1 and Mfn2: Han et al. recently revealed a marked downregulation of mitochondrial fusion regulators OPA1 and Mfn2 in AD groups compared to non-AD controls [ 173 C. Reducing neuroinflammation: The higher expression of Drp1 and TXNIP during AD are also involved in early inflammatory responses in oligodendrocytes and microglia of AD animal models, triggering NLRP3 inflammasome activation and caspase-3 cleavage, which, in turn, amplify neuroinflammatory cascades [ 174 175 176 7.1.3. Enhancing Biogenesis Mitochondrial biogenesis is essential for maintaining neuronal energy homeostasis and function. In Alzheimer’s disease (AD), accumulating evidence suggests that this process is markedly impaired, contributing to mitochondrial dysfunction and subsequent neurodegeneration. Evidence shows that brains from AD patients have a decreased expression of genes associated with mitochondrial biogenesis, including peroxisome-proliferator activated receptor coactivator-1 (PGC-1α), nuclear respiratory factor 1/2 (NRF1/2), and mitochondrial transcription factor A (TFAM) [ 177 A. Activation of PGC-1α: PGC-1α protein levels are inversely proportional to the concentration of Aβ in the CNS in AD making it a promising therapeutic target for AD [ 178 179 180 B. Enhancing TFAM: Human mitochondrial transcription factor A (hTFAM) activation was shown to protect mtDNA, reduce oxidative damage and intracellular Aβ, and improve cognitive function in both mouse and human AD models, making it a promising therapeutic target [ 181 7.2. Parkinson’s Disease (PD) Parkinson’s disease (PD) is the most common neurodegenerative disorder of aging and the second most common brain aging disorder [ 182 183 184 In four sporadic cases of Parkinsonism, exposure to MPTP (1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine) led to approximately 60% and 65% deficiency in Complex I and Complex II, respectively, in dopaminergic neurons of the substantia nigra [ 185 186 On the other hand, several genes have been identified as being involved in causing familial PD, that are linked with mitochondrial dysfunction. Among them, the PRKN (Parkin) gene and PINK1 genes are the most common cause of autosomal recessive PD [ 187 188 Figure 2 189 190 In this section, we summarize the principal mitochondrial-targeted therapeutic strategies for treatment, depending on the specific gene mutation of PD ( Figure 2 7.2.1. Boosting Mitophagy The association of mutations in the PRKN and PINK1 genes with PD strongly suggests that impaired mitophagy and the resulting accumulation of damaged mitochondria are key factors in the disease’s pathogenesis [ 191 A. Activation of PINK/Parkin signaling pathway for preventing α-syn accumulation: The pathological accumulation of phosphorylated α-syn is a key contributor to age-dependent neurodegeneration in PD [ 183 16 B. Promoting mitophagy in microglia and reducing neuroinflammation through Urolithin A (UA): Microglial-mediated neuroinflammation and mitophagy are closely interconnected. In PD murine models, neuroinflammasome pathways, particularly NLRP3, are highly activated, a response amplified by ROS generated from dysfunctional mitochondria. Urolithin A (UA), a naturally occurring compound, has been shown to promote mitophagy, restore mitochondrial function, and suppress NLRP3 inflammasome activation in PD mouse models [ 192 193 194 7.2.2. Boosting Bioenergetics Recent evidence highlights disruptions in astrocyte and glial cell energy metabolism, marked by altered glycolysis and oxidative phosphorylation (OXPHOS) patterns, in both aging and PD models. PD-linked gene mutations may alter the metabolic profile of astrocytes, with mutant α-synuclein contributing to bioenergetic decline by disrupting lipid catabolism, impairing cellular energy homeostasis, and reducing glutamate uptake efficiency [ 195 A. Rescue microglial energy metabolism: Considering the major role of microglial glucose metabolism in neuroinflammation, manipulating microglial glucose metabolism has been proposed as a potential therapeutic approach. Compounds such as capsaicin preserve dopamine neurons degeneration, blocking the activity of glial cells in inducing oxidative stress and neuroinflammation [ 196 B. Increasing NAD+ levels: A significant decline in the NAD+/NADH ratio supports the reduction in ETC enzyme activity in mitochondria during aging and in pathologies such as PD. A Phase I trial ( NCT03816020 197 C. Increasing ATP levels: Impaired glycolytic flux in PD triggers a reduction in ATP levels. Terazosin enhanced ATP via phosphoglycerate kinase 1 (PGK1) which stimulates glycolysis and increases brain ATP production, slowing neurodegeneration in preclinical and clinical studies [ 198 7.2.3. Reducing Oxidative Stress As mentioned previously, mutations in PINK-1/PRKN lead to accumulation of damaged mitochondria, which induces excessive reactive oxygen species (ROS) production. This, together with impaired antioxidant defenses, triggers oxidative stress in PD, contributing to dopaminergic neuron degeneration. To reduce oxidative stress, several strategies are being considered: A. Increasing DJ-1 levels: Among the endogenous cytoprotective pathways, the DJ-1 protein (encoded by the PARK7 199 200 201 B. Nrf2 Pathway Activation: Nrf2 is an important regulator of antioxidant expression, such as HO-1, NQO1, SOD. A novel multitarget compound that exhibits NRF2 induction activity and MAO-B selective inhibition, combined with anti-inflammatory, antioxidant, and blood–brain barrier permeation properties, has been recently developed and has benefits in PD [ 202 203 7.3. Huntington’s Disease (HD) HD is a progressive, autosomal dominant, hereditary neurodegenerative disorder, globally affecting 5–10 individuals per 100,000 people, and is therefore the most common hereditary neurodegenerative disease [ 204 205 206 207 In HD, mutation in the HTT gene involves the amplification of a cytosine-adenine-guanine (CAG) trinucleotide repeat encoding the amino acid glutamine (Gln), in the first exon of the gene, with 36 or more repetitions. This expansion leads to the production of a mutant protein (mHTT9) with a long poly-glutamine (polyQ) stretch, resulting in protein misfolding and progressive accumulation and aggregation in the cytoplasm and nucleus of cells [ 208 209 210 Given that HD affects different regions of the brain, its typical clinical manifestations include motor and cognitive disorders, as well as psychiatric disturbances. Additionally, motor abnormalities resulting from striatal dysfunction, which is characterized by progressive, involuntary dance-like movements, are also observed [ 211 In recent years, an increasing body of evidence has highlighted the critical role of mitochondrial dysfunction in the etiology of HD, making it a significant study area for possible therapeutic approaches. However, the precise pathogenic pathways involved have not yet been thoroughly elucidated, even though the neurotoxic effects of mHTT are mainly mediated by the induction of aberrant mitochondrial energy metabolism and HD-related neuronal dysfunction. In this section, we describe the principal mitochondrial-targeted therapeutic strategies for the treatment of Huntington’s disease ( Figure 2 A. Enhancing mitochondrial biogenesis by increasing PGC-1α: Research evidence indicates that mutant huntingtin (mHTT) directly interacts with the promoter region of PGC-1α and interferes with the CREB/TAF-dependent transcriptional pathway, leading to reduced transcriptional activity. This downregulation impairs the expression of key downstream targets, including mitochondrial transcription factor A (TFAM) , 212 213 209 214 B. Enhancing mitophagy through PINK activation: Research studies have demonstrated that mHTT is also involved in the process of mitophagy. mHTT inhibits the commitment of mitophagy receptors, such as p62 and OPTN, to damaged mitochondria and impairs their interaction with LC3, thereby blocking autophagosome formation and disrupting mitophagy initiation [ 207 207 215 216 Drosophila 215 157 C. Decreasing mitochondria fragmentation through Drp1 inhibition: The accumulation of mHTT in neuronal cells in the brains of HD patients has been shown to induce mitochondrial hyper-fragmentation and to affect the mitochondrial respiratory chain complex by disrupting the balance of mitochondrial dynamics, which, in turn, induces impairment of mitochondrial function [ 217 218 219 157 220 7.4. Amyotrophic Lateral Sclerosis (ALS) Amyotrophic lateral sclerosis (ALS) represents the most prevalent subtype of motor neuron diseases (MNDs), a group of neurodegenerative disorders characterized by the involvement of both upper and lower motor neurons. ALS is a relentlessly progressive condition marked by the degeneration and eventual loss of motor neurons, leading to increasing muscle weakness and, ultimately, respiratory compromise [ 221 Among the key pathological features of ALS, mitochondrial dysfunction plays a central role in disease onset and progression. Mitochondrial impairments in ALS trigger altered dynamics, defective mitophagy, impaired bioenergetics, increased oxidative stress, and defective biogenesis ( Figure 2 222 223 Figure 2 A. Promoting mitophagy: In ALS, ninety distinct mutations in TBK1 are linked to ALS and frontotemporal dementia, including missense mutations that disrupt TBK1’s ability to dimerize and associate with the mitophagy receptor optineurin (OPTN), thereby impairing autophagy/mitophagy initiation and mitochondrial clearance. Additionally, mutations in C9ORF72 disrupt endosomal and autophagic trafficking, leading to defective clearance of damaged mitochondria and accumulation of dysfunctional mitochondria [ 224 225 226 227 228 229 B. Reducing fragmentation though downregulation of Drp-1: Mutant SOD1, TDP-43, and FUS mislocalize to mitochondria and promote excessive fission via Drp1 upregulation and OPA1/Mfn2 downregulation [ 230 231 232 233 C. Reducing oxidative stress and ROS production: Mitochondria in ALS show increased ROS production, partly due to SOD1 mutations, which impair detoxification of superoxide radicals, and TDP-43, which inhibits mitochondrial antioxidant responses. Increased mitochondrial ROS also trigger activation of the mitochondrial permeability transition pore (mPTP), promoting mitochondrial swelling and release of pro-apoptotic factors [ 234 235 236 D. PGC-1α activation: ALS models show reduced PGC-1α levels and downstream regulators such as NRF1 and TFAM, limiting mitochondrial renewal and repair [ 213 237 238 Nevertheless, the majority of sporadic ALS cases do not involve mutations in these known ALS-associated genes. Emerging evidence suggests that genetic predispositions, environmental exposures, for example, heavy metals or organic chemicals such as pesticides and solvents, traumatic brain injury, as well as lifestyle and age-related factors, may all contribute to the etiology of ALS [ 223 8. Challenges and Future Directions Emerging therapeutic strategies aimed at restoring mitochondrial health offer promising avenues for intervention. Lifestyle factors, including diet and exercise, also influence mitochondrial aging. Many of the neurodegenerative and age-related diseases described in this review exhibit abnormalities in mitochondrial biogenesis, mitophagy, OXPHOS reduction, and mitochondrial dynamics, which ultimately influence neuronal function and lead to cognitive deficits. Other central nervous system (CNS) pathologies involve mitochondrial disorders, yet these conditions are not primarily associated with the aging process. This is the case for multiple sclerosis (MS), spinocerebellar ataxia (SCA), epilepsy, traumatic brain injury (TBI), stroke, and HIV-associated neurocognitive disorder (HAND). For example, MS in an autoimmune disease that typically affects young adults between the ages of 20 and 40, in which the immune system mistakenly attacks the myelin sheath covering neurons, leading to inflammation and progressive neuronal degeneration [ 239 240 For neurodegenerative diseases such as Alzheimer’s disease, Parkinson’s disease, Huntington’s disease, and ALS, an increasing number of studies exploring novel therapeutic and lifestyle-modifying interventions have demonstrated the potential benefits of mitigating mitochondria-dependent oxidative stress, enhancing mitochondrial biogenesis, CNS metabolism and restoring mitophagy through strategies like fasting and physical exercise as well as pharmacologically, with the so-called mitophagy enhancers, such as urolithin A and rapamycin [ 24 241 236 Unfortunately, many drugs that improved mitochondrial function in preclinical trials have failed to show efficacy or have raised safety concerns in clinics. One example is Mdivi-1, a Drp-1 inhibitor that showed protective effects by mitigating mitochondrial dysfunction and synaptic impairment in HD [ 242 243 244 Other treatments targeting oxidative stress, such as Coenzyme Q10 or N-acetylcysteine (NAC) demonstrated promising effects in preclinical studies of HD and ALS, where they improved survival and slowed functional decline. However, clinical trials have not provided consistent evidence of their efficacy [ 245 246 164 247 The convergence of multiple pathogenic pathways, ranging from mitochondrial dysfunction and oxidative stress to impaired axonal transport, suggests a complex and multifactorial disease process in neurodegeneration. This complexity likely underlies the limited success of therapeutic strategies that target single molecular pathways. Accordingly, a combination therapy addressing multiple aspects of the disease pathology may be necessary to effectively slow or halt neurodegeneration in disease progression. Future directions also involve utilizing advanced genetic techniques, such as antisense oligonucleotides (ASOs) for the treatment of many neurodegenerative diseases such as HD, ALS, and AD [ 248 249 This highlights the importance of deeply dissecting the mechanisms of mitochondrial dysfunction in neurodegenerative pathogenesis to further identify novel molecular targets and guide the development of effective new therapeutics. 9. Conclusions Mitochondrial dysfunction plays a pivotal role in the pathogenesis of a wide range of neurodegenerative CNS disorders. Disruptions in mitochondrial bioenergetics, dynamics, biogenesis, and quality control contribute to neuronal vulnerability, cognitive decline, and disease progression. While considerable progress has been made in elucidating the molecular underpinnings of mitochondrial dysfunction, effective translation into clinical therapies remains limited. In this review we described how mitochondrial impairments are influenced by aging and contribute to the pathogenesis of four major neurodegenerative diseases, such as ALS, Alzheimer’s, Parkinson’s, and Huntington’s disease, in which protein aggregation is a hallmark and central pathogenic feature. We also discussed emerging therapeutic strategies targeting mitochondrial pathways, including mitophagy activation, reduction in mitochondrial fragmentation, oxidative stress mitigation, and enhancement of mitochondrial biogenesis. We highlighted that other non-aggregation CNS disorders, such as multiple sclerosis (MS), traumatic brain injury, and HIV-associated neurocognitive disorder, may require a tailored, disease-specific approach, as the mitochondrial dysfunction observed in these conditions is not the primary driver of the disease pathology. Continued research into the interplay between mitochondrial health, neuroinflammation, and systemic metabolic status will be crucial for advancing targeted therapies. The integration of gene editing technologies, lifestyle-based interventions, and combination treatments offers promising avenues. A deeper mechanistic understanding will not only inform novel treatment strategies but also improve disease prevention and patient outcomes across a spectrum of neurological conditions. Disclaimer/Publisher’s Note: Author Contributions Writing—original draft preparation, D.S., C.P., M.E. and A.F.-R.; writing—review and editing, A.F.-R.; project administration, A.F.-R. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Liu X. Ye M. Ma L. The Emerging Role of Autophagy and Mitophagy in Tauopathies: From Pathogenesis to Translational Implications in Alzheimer’s Disease Front. Aging Neurosci. 2022 14 1022821 10.3389/fnagi.2022.1022821 36325189 PMC9618726 2. Nabi S.U. Khan A. Siddiqui E.M. Rehman M.U. Alshahrani S. Arafah A. Mehan S. Alsaffar R.M. Alexiou A. Shen B. Mechanisms of Mitochondrial Malfunction in Alzheimer’s Disease: New Therapeutic Hope Oxidative Med. Cell. Longev. 2022 2022 4759963 10.1155/2022/4759963 PMC9124149 35607703 3. Lemasters J.J. Selective Mitochondrial Autophagy, or Mitophagy, as a Targeted Defense Against Oxidative Stress, Mitochondrial Dysfunction, and Aging Rejuvenation Res. 2005 8 3 5 10.1089/rej.2005.8.3 15798367 4. Palikaras K. Lionaki E. Tavernarakis N. Mechanisms of Mitophagy in Cellular Homeostasis, Physiology and Pathology Nat. Cell Biol. 2018 20 1013 1022 10.1038/s41556-018-0176-2 30154567 5. Killackey S.A. Philpott D.J. Girardin S.E. Mitophagy Pathways in Health and Disease J. Cell Biol. 2020 219 e202004029 10.1083/jcb.202004029 32926082 PMC7594502 6. Siwach A. Patel H. Khairnar A. Parekh P. Molecular Symphony of Mitophagy: Ubiquitin-Specific Protease-30 as a Maestro for Precision Management of Neurodegenerative Diseases CNS Neurosci. Ther. 2025 31 e70192 10.1111/cns.70192 39840724 PMC11751875 7. Liu Y. Wang M. Hou X.O. Hu L.F. Roles of Microglial Mitophagy in Neurological Disorders Front. Aging Neurosci. 2022 14 979869 10.3389/fnagi.2022.979869 36034136 PMC9399802 8. Sarraf S.A. Raman M. Guarani-Pereira V. Sowa M.E. Huttlin E.L. Gygi S.P. Harper J.W. Landscape of the PARKIN-Dependent Ubiquitylome in Response to Mitochondrial Depolarization Nature 2013 496 372 376 10.1038/nature12043 23503661 PMC3641819 9. Geisler S. Holmström K.M. Skujat D. Fiesel F.C. Rothfuss O.C. Kahle P.J. Springer W. PINK1/Parkin-Mediated Mitophagy Is Dependent on VDAC1 and P62/SQSTM1 Nat. Cell Biol. 2010 12 119 131 10.1038/ncb2012 20098416 10. Heo J.M. Ordureau A. Paulo J.A. Rinehart J. Harper J.W. The PINK1-PARKIN Mitochondrial Ubiquitylation Pathway Drives a Program of OPTN/NDP52 Recruitment and TBK1 Activation to Promote Mitophagy Mol. Cell 2015 60 7 20 10.1016/j.molcel.2015.08.016 26365381 PMC4592482 11. Caponio D. Veverová K. Zhang S.Q. Shi L. Wong G. Vyhnalek M. Fang E.F. Compromised Autophagy and Mitophagy in Brain Ageing and Alzheimer’s Diseases Aging Brain 2022 2 100056 10.1016/j.nbas.2022.100056 36908880 PMC9997167 12. Swerdlow N.S. Wilkins H.M. Mitophagy and the Brain Int. J. Mol. Sci. 2020 21 9661 10.3390/ijms21249661 33352896 PMC7765816 13. Castellazzi M. Patergnani S. Donadio M. Giorgi C. Bonora M. Bosi C. Brombo G. Pugliatti M. Seripa D. Zuliani G. Autophagy and Mitophagy Biomarkers Are Reduced in Sera of Patients with Alzheimer’s Disease and Mild Cognitive Impairment Sci. Rep. 2019 9 20009 10.1038/s41598-019-56614-5 31882960 PMC6934625 14. McWilliams T.G. Prescott A.R. Montava-Garriga L. Ball G. Singh F. Barini E. Muqit M.M.K. Brooks S.P. Ganley I.G. Basal Mitophagy Occurs Independently of PINK1 in Mouse Tissues of High Metabolic Demand Cell Metab. 2018 27 439 449.e5 10.1016/j.cmet.2017.12.008 29337137 PMC5807059 15. Perez F.A. Palmiter R.D. Parkin-Deficient Mice Are Not a Robust Model of Parkinsonism Proc. Natl. Acad. Sci. USA 2005 102 2174 2179 10.1073/pnas.0409598102 15684050 PMC548311 16. Han R. Wang Q. Xiong X. Chen X. Tu Z. Li B. Zhang F. Chen C. Pan M. Xu T. Deficiency of Parkin Causes Neurodegeneration and Accumulation of Pathological α-Synuclein in Monkey Models J. Clin. Investig. 2024 134 e179633 10.1172/JCI179633 39403921 PMC11473153 17. Qian S. He H. Xiong X. Ai R. Wang W. Zhu H. Ye Q. Zhou S. Nilsen H. Xie C. Identification of Mitophagy-Associated Proteins Profile as Potential Plasma Biomarkers of Idiopathic Parkinson’s Disease CNS Neurosci. Ther. 2024 30 e14532 10.1111/cns.14532 37990436 PMC11056850 18. Lee J.J. Sanchez-Martinez A. Martinez Zarate A. Benincá C. Mayor U. Clague M.J. Whitworth A.J. Basal Mitophagy Is Widespread in Drosophila but Minimally Affected by Loss of Pink1 or Parkin J. Cell Biol. 2018 217 1613 1622 10.1083/jcb.201801044 29500189 PMC5940313 19. Wrighton P.J. Shwartz A. Heo J.-M. Quenzer E.D. LaBella K.A. Harper J.W. Goessling W. Quantitative Intravital Imaging in Zebrafish Reveals in Vivo Dynamics of Physiological-Stress-Induced Mitophagy J. Cell Sci. 2021 134 jcs256255 10.1242/jcs.256255 33536245 PMC7929928 20. Rappe A. Vihinen H.A. Suomi F. Hassinen A.J. Ehsan H. Jokitalo E.S. McWilliams T.G. Longitudinal Autophagy Profiling of the Mammalian Brain Reveals Sustained Mitophagy throughout Healthy Aging EMBO J. 2024 43 6199 6231 10.1038/s44318-024-00241-y 39367235 PMC11612485 21. Schmid E.T. Pyo J.H. Walker D.W. Neuronal Induction of BNIP3-Mediated Mitophagy Slows Systemic Aging in Drosophila Nat. Aging 2022 2 494 507 10.1038/s43587-022-00214-y 36213625 PMC9540997 22. Baker D.J. Petersen R.C. Cellular Senescence in Brain Aging and Neurodegenerative Diseases: Evidence and Perspectives J. Clin. Investig. 2018 128 1208 1216 10.1172/JCI95145 29457783 PMC5873891 23. Di Micco R. Krizhanovsky V. Baker D. d’Adda di Fagagna F. Cellular Senescence in Ageing: From Mechanisms to Therapeutic Opportunities Nat. Rev. Mol. Cell Biol. 2021 22 75 95 10.1038/s41580-020-00314-w 33328614 PMC8344376 24. Fang E.F. Hou Y. Palikaras K. Adriaanse B.A. Kerr J.S. Yang B. Lautrup S. Hasan-Olive M.M. Caponio D. Dan X. Mitophagy Inhibits Amyloid-β and Tau Pathology and Reverses Cognitive Deficits in Models of Alzheimer’s Disease Nat. Neurosci. 2019 22 401 412 10.1038/s41593-018-0332-9 30742114 PMC6693625 25. Xie C. Zhuang X.-X. Niu Z. Ai R. Lautrup S. Zheng S. Jiang Y. Han R. Gupta T.S. Cao S. Amelioration of Alzheimer’s Disease Pathology by Mitophagy Inducers Identified via Machine Learning and a Cross-Species Workflow Nat. Biomed. Eng. 2022 6 76 93 10.1038/s41551-021-00819-5 34992270 PMC8782726 26. Sadovnikova I.S. Gureev A.P. Ignatyeva D.A. Gryaznova M.V. Chernyshova E.V. Krutskikh E.P. Novikova A.G. Popov V.N. Nrf2/ARE Activators Improve Memory in Aged Mice via Maintaining of Mitochondrial Quality Control of Brain and the Modulation of Gut Microbiome Pharmaceuticals 2021 14 607 10.3390/ph14070607 34201885 PMC8308546 27. Singh P. Gollapalli K. Mangiola S. Schranner D. Yusuf M.A. Chamoli M. Shi S.L. Lopes Bastos B. Nair T. Riermeier A. Taurine Deficiency as a Driver of Aging Science 2023 380 eabn9257 10.1126/science.abn9257 37289866 PMC10630957 28. Gruendler R. Hippe B. Sendula Jengic V. Peterlin B. Haslberger A.G. Nutraceutical Approaches of Autophagy and Neuroinflammation in Alzheimer’s Disease: A Systematic Review Molecules 2020 25 6018 10.3390/molecules25246018 33353228 PMC7765980 29. Makarov M. Korkotian E. Differential Role of Active Compounds in Mitophagy and Related Neurodegenerative Diseases Toxins 2023 15 202 10.3390/toxins15030202 36977093 PMC10058020 30. Park H. Chung K.M. An H.K. Gim J.-E. Hong J. Woo H. Cho B. Moon C. Yu S.W. Parkin Promotes Mitophagic Cell Death in Adult Hippocampal Neural Stem Cells Following Insulin Withdrawal Front. Mol. Neurosci. 2019 12 46 10.3389/fnmol.2019.00046 30853892 PMC6395409 31. Zaninello M. Palikaras K. Naon D. Iwata K. Herkenne S. Quintana-Cabrera R. Semenzato M. Grespi F. Ross-Cisneros F.N. Carelli V. Inhibition of Autophagy Curtails Visual Loss in a Model of Autosomal Dominant Optic Atrophy Nat. Commun. 2020 11 4029 10.1038/s41467-020-17821-1 32788597 PMC7423926 32. Zaninello M. Palikaras K. Sotiriou A. Tavernarakis N. Scorrano L. Sustained Intracellular Calcium Rise Mediates Neuronal Mitophagy in Models of Autosomal Dominant Optic Atrophy Cell Death Differ. 2022 29 167 177 10.1038/s41418-021-00847-3 34389813 PMC8738763 33. Patergnani S. Bonora M. Ingusci S. Previati M. Marchi S. Zucchini S. Perrone M. Wieckowski M.R. Castellazzi M. Pugliatti M. Antipsychotic Drugs Counteract Autophagy and Mitophagy in Multiple Sclerosis Proc. Natl. Acad. Sci. USA 2021 118 e2020078118 10.1073/pnas.2020078118 34099564 PMC8214668 34. Sun N. Yun J. Liu J. Malide D. Liu C. Rovira I.I. Holmström K.M. Fergusson M.M. Yoo Y.H. Combs C.A. Measuring In Vivo Mitophagy Mol. Cell 2015 60 685 696 10.1016/j.molcel.2015.10.009 26549682 PMC4656081 35. Blüml S. Moreno-Torres A. Shic F. Nguy C.H. Ross B.D. Tricarboxylic Acid Cycle of Glia in the in Vivo Human Brain NMR Biomed. 2002 15 1 5 10.1002/nbm.725 11840547 36. Mulica P. Grünewald A. Pereira S.L. Astrocyte-Neuron Metabolic Crosstalk in Neurodegeneration: A Mitochondrial Perspective Front. Endocrinol. 2021 12 668517 10.3389/fendo.2021.668517 34025580 PMC8138625 37. Boisvert M.M. Erikson G.A. Shokhirev M.N. Allen N.J. The Aging Astrocyte Transcriptome from Multiple Regions of the Mouse Brain Cell Rep. 2018 22 269 285 10.1016/j.celrep.2017.12.039 29298427 PMC5783200 38. Matias I. Diniz L.P. Damico I.V. Araujo A.P.B. Neves L.d.S. Vargas G. Leite R.E.P. Suemoto C.K. Nitrini R. Jacob-Filho W. Loss of Lamin-B1 and Defective Nuclear Morphology Are Hallmarks of Astrocyte Senescence in Vitro and in the Aging Human Hippocampus Aging Cell 2022 21 e13521 10.1111/acel.13521 34894056 PMC8761005 39. Chinta S.J. Woods G. Demaria M. Rane A. Zou Y. McQuade A. Rajagopalan S. Limbad C. Madden D.T. Campisi J. Cellular Senescence Is Induced by the Environmental Neurotoxin Paraquat and Contributes to Neuropathology Linked to Parkinson’s Disease Cell Rep. 2018 22 930 940 10.1016/j.celrep.2017.12.092 29386135 PMC5806534 40. Scott K.M. Williams-Gray C.H. Targeting Aged Astrocytes May Be a New Therapeutic Strategy in Parkinson’s Disease Mov. Disord. 2018 33 758 759 10.1002/mds.27387 29633419 41. Diniz L.P. Araujo A.P.B. Carvalho C.F. Matias I. de Sá Hayashide L. Marques M. Pessoa B. Andrade C.B.V. Vargas G. Queiroz D.D. Accumulation of Damaged Mitochondria in Aging Astrocytes Due to Mitophagy Dysfunction: Implications for Susceptibility to Mitochondrial Stress Biochim. Et Biophys. Acta (BBA) Mol. Basis Dis. 2024 1870 167470 10.1016/j.bbadis.2024.167470 39153665 42. Chen Y. Zhu Z. Yan Y. Sun H. Wang G. Du X. Li F. Yuan S. Wang W. Wang M. P7C3 Suppresses Astrocytic Senescence to Protect Dopaminergic Neurons: Implication in the Mouse Model of Parkinson’s Disease CNS Neurosci. Ther. 2024 30 e14819 10.1111/cns.14819 39056208 PMC11273101 43. Cohen J. Torres C. Astrocyte Senescence: Evidence and Significance Aging Cell 2019 18 e12937 10.1111/acel.12937 30815970 PMC6516680 44. Traa A. Tamez González A.A. Van Raamsdonk J.M. Developmental Disruption of the Mitochondrial Fission Gene Drp-1 Extends the Longevity of Daf-2 Insulin/IGF-1 Receptor Mutant Geroscience 2025 47 877 902 10.1007/s11357-024-01276-z 39028454 PMC11872967 45. Friedman J.R. Nunnari J. Mitochondrial Form and Function Nature 2014 505 335 343 10.1038/nature12985 24429632 PMC4075653 46. Sukhorukov V.S. Baranich T.I. Egorova A.V. Akateva A.V. Okulova K.M. Ryabova M.S. Skvortsova K.A. Dmitriev O.V. Mudzhiri N.M. Voronkov D.N. Mitochondrial Dynamics in Brain Cells During Normal and Pathological Aging Int. J. Mol. Sci. 2024 25 12855 10.3390/ijms252312855 39684566 PMC11641149 47. Bondy S.C. Wu M. The Critical Role of Autophagy and Phagocytosis in the Aging Brain Int. J. Mol. Sci. 2024 26 57 10.3390/ijms26010057 39795916 PMC11720579 48. Yao C.H. Wang R. Wang Y. Kung C.P. Weber J.D. Patti G.J. Mitochondrial Fusion Supports Increased Oxidative Phosphorylation during Cell Proliferation eLife 2019 8 e41351 10.7554/eLife.41351 30694178 PMC6351101 49. Ng M.Y.W. Wai T. Simonsen A. Quality Control of the Mitochondrion Dev. Cell 2021 56 881 905 10.1016/j.devcel.2021.02.009 33662258 50. Machiela E. Liontis T. Dues D.J. Rudich P.D. Traa A. Wyman L. Kaufman C. Cooper J.F. Lew L. Nadarajan S. Disruption of Mitochondrial Dynamics Increases Stress Resistance through Activation of Multiple Stress Response Pathways FASEB J. 2020 34 8475 8492 10.1096/fj.201903235R 32385951 PMC7313680 51. Wilson P.D. Franks L.M. The Effect of Age on Mitochondrial Ultrastructure Gerontologia 1975 21 81 94 10.1159/000212035 1158107 52. Yasuda K. Ishii T. Suda H. Akatsuka A. Hartman P.S. Goto S. Miyazawa M. Ishii N. Age-Related Changes of Mitochondrial Structure and Function in Caenorhabditis Elegans Mech. Ageing Dev. 2006 127 763 770 10.1016/j.mad.2006.07.002 16893561 53. Sharma A. Smith H.J. Yao P. Mair W.B. Causal Roles of Mitochondrial Dynamics in Longevity and Healthy Aging EMBO Rep. 2019 20 e48395 10.15252/embr.201948395 31667999 PMC6893295 54. Knott A.B. Perkins G. Schwarzenbacher R. Bossy-Wetzel E. Mitochondrial Fragmentation in Neurodegeneration Nat. Rev. Neurosci. 2008 9 505 518 10.1038/nrn2417 18568013 PMC2711514 55. Liu Y.J. McIntyre R.L. Janssens G.E. Houtkooper R.H. Mitochondrial Fission and Fusion: A Dynamic Role in Aging and Potential Target for Age-Related Disease Mech. Ageing Dev. 2020 186 111212 10.1016/j.mad.2020.111212 32017944 56. Son J.M. Sarsour E.H. Kakkerla Balaraju A. Fussell J. Kalen A.L. Wagner B.A. Buettner G.R. Goswami P.C. Mitofusin 1 and Optic Atrophy 1 Shift Metabolism to Mitochondrial Respiration during Aging Aging Cell 2017 16 1136 1145 10.1111/acel.12649 28758339 PMC5595680 57. Sgarbi G. Matarrese P. Pinti M. Lanzarini C. Ascione B. Gibellini L. Dika E. Patrizi A. Tommasino C. Capri M. Mitochondria Hyperfusion and Elevated Autophagic Activity Are Key Mechanisms for Cellular Bioenergetic Preservation in Centenarians Aging (Albany NY) 2014 6 296 310 10.18632/aging.100654 24799450 PMC4032796 58. Chen H. Chomyn A. Chan D.C. Disruption of Fusion Results in Mitochondrial Heterogeneity and Dysfunction* J. Biol. Chem. 2005 280 26185 26192 10.1074/jbc.M503062200 15899901 59. Oh J. Lee Y.D. Wagers A.J. Stem Cell Aging: Mechanisms, Regulators and Therapeutic Opportunities Nat. Med. 2014 20 870 880 10.1038/nm.3651 25100532 PMC4160113 60. Signer R.A.J. Morrison S.J. Mechanisms That Regulate Stem Cell Aging and Life Span Cell Stem Cell 2013 12 152 165 10.1016/j.stem.2013.01.001 23395443 PMC3641677 61. Scheckhuber C.Q. Erjavec N. Tinazli A. Hamann A. Nyström T. Osiewacz H.D. Reducing Mitochondrial Fission Results in Increased Life Span and Fitness of Two Fungal Ageing Models Nat. Cell Biol. 2007 9 99 105 10.1038/ncb1524 17173038 62. Braun R.J. Westermann B. Mitochondrial Dynamics in Yeast Cell Death and Aging Biochem. Soc. Trans. 2011 39 1520 1526 10.1042/BST0391520 21936845 63. Traa A. Machiela E. Rudich P.D. Soo S.K. Senchuk M.M. Van Raamsdonk J.M. Identification of Novel Therapeutic Targets for Polyglutamine Diseases That Target Mitochondrial Fragmentation Int. J. Mol. Sci. 2021 22 13447 10.3390/ijms222413447 34948242 PMC8703635 64. Yang C.C. Chen D. Lee S.S. Walter L. The Dynamin-Related Protein DRP-1 and the Insulin Signaling Pathway Cooperate to Modulate Caenorhabditis Elegans Longevity Aging Cell 2011 10 724 728 10.1111/j.1474-9726.2011.00711.x 21463460 PMC3135752 65. Weir H.J. Yao P. Huynh F.K. Escoubas C.C. Goncalves R.L. Burkewitz K. Laboy R. Hirschey M.D. Mair W.B. Dietary Restriction and AMPK Increase Lifespan via Mitochondrial Network and Peroxisome Remodeling Cell Metab. 2017 26 884 896.e5 10.1016/j.cmet.2017.09.024 29107506 PMC5718936 66. Espino de la Fuente-Muñoz C. Rosas-Lemus M. Moreno-Castilla P. Bermúdez-Rattoni F. Uribe-Carvajal S. Arias C. Age-Dependent Decline in Synaptic Mitochondrial Function Is Exacerbated in Vulnerable Brain Regions of Female 3xTg-AD Mice Int. J. Mol. Sci. 2020 21 8727 10.3390/ijms21228727 33227902 PMC7699171 67. Zhou L. Zhang Q. Zhang P. Sun L. Peng C. Yuan Z. Cheng J. C-Abl-Mediated Drp1 Phosphorylation Promotes Oxidative Stress-Induced Mitochondrial Fragmentation and Neuronal Cell Death Cell Death Dis. 2017 8 e3117 10.1038/cddis.2017.524 29022905 PMC5682686 68. Li Y. Yu H. Chen C. Li S. Zhang Z. Xu H. Zhu F. Liu J. Spencer P.S. Dai Z. Proteomic Profile of Mouse Brain Aging Contributions to Mitochondrial Dysfunction, DNA Oxidative Damage, Loss of Neurotrophic Factor, and Synaptic and Ribosomal Proteins Oxid. Med. Cell Longev. 2020 2020 5408452 10.1155/2020/5408452 32587661 PMC7301248 69. Park J. Choi H. Kim B. Chae U. Lee D.G. Lee S.R. Lee S. Lee H.S. Lee D.S. Peroxiredoxin 5 (Prx5) Decreases LPS-Induced Microglial Activation through Regulation of Ca2+/Calcineurin-Drp1-Dependent Mitochondrial Fission Free Radic. Biol. Med. 2016 99 392 404 10.1016/j.freeradbiomed.2016.08.030 27585948 70. Katoh M. Wu B. Nguyen H.B. Thai T.Q. Yamasaki R. Lu H. Rietsch A.M. Zorlu M.M. Shinozaki Y. Saitoh Y. Polymorphic Regulation of Mitochondrial Fission and Fusion Modifies Phenotypes of Microglia in Neuroinflammation Sci. Rep. 2017 7 4942 10.1038/s41598-017-05232-0 28694451 PMC5503944 71. Park J. Choi H. Min J.S. Park S.J. Kim J.H. Park H.J. Kim B. Chae J.I. Yim M. Lee D.S. Mitochondrial Dynamics Modulate the Expression of Pro-Inflammatory Mediators in Microglial Cells J. Neurochem. 2013 127 221 232 10.1111/jnc.12361 23815397 72. Zhou K. Chen J. Wu J. Wu Q. Jia C. Xu Y.X.Z. Chen L. Tu W. Yang G. Kong J. Atractylenolide III Ameliorates Cerebral Ischemic Injury and Neuroinflammation Associated with Inhibiting JAK2/STAT3/Drp1-Dependent Mitochondrial Fission in Microglia Phytomedicine 2019 59 152922 10.1016/j.phymed.2019.152922 30981186 73. Traa A. Keil A. AlOkda A. Jacob-Tomas S. Tamez González A.A. Zhu S. Rudich Z. Van Raamsdonk J.M. Overexpression of Mitochondrial Fission or Mitochondrial Fusion Genes Enhances Resilience and Extends Longevity Aging Cell 2024 23 e14262 10.1111/acel.14262 38953684 PMC11464124 74. Pulido C. Ryan T.A. Synaptic Vesicle Pools Are a Major Hidden Resting Metabolic Burden of Nerve Terminals Sci. Adv. 2021 7 eabi9027 10.1126/sciadv.abi9027 34860552 PMC8641928 75. Du F. Zhu X.H. Zhang Y. Friedman M. Zhang N. Ugurbil K. Chen W. Tightly Coupled Brain Activity and Cerebral ATP Metabolic Rate Proc. Natl. Acad. Sci. USA 2008 105 6409 6414 10.1073/pnas.0710766105 18443293 PMC2359810 76. Pan R.Y. He L. Zhang J. Liu X. Liao Y. Gao J. Liao Y. Yan Y. Li Q. Zhou X. Positive Feedback Regulation of Microglial Glucose Metabolism by Histone H4 Lysine 12 Lactylation in Alzheimer’s Disease Cell Metab. 2022 34 634 648.e6 10.1016/j.cmet.2022.02.013 35303422 77. Hu Y. Cao K. Wang F. Wu W. Mai W. Qiu L. Luo Y. Ge W.P. Sun B. Shi L. Dual Roles of Hexokinase 2 in Shaping Microglial Function by Gating Glycolytic Flux and Mitochondrial Activity Nat. Metab. 2022 4 1756 1774 10.1038/s42255-022-00707-5 36536134 78. Saab A.S. Tzvetavona I.D. Trevisiol A. Baltan S. Dibaj P. Kusch K. Möbius W. Goetze B. Jahn H.M. Huang W. Oligodendroglial NMDA Receptors Regulate Glucose Import and Axonal Energy Metabolism Neuron 2016 91 119 132 10.1016/j.neuron.2016.05.016 27292539 PMC9084537 79. Pellerin L. Magistretti P.J. Glutamate Uptake into Astrocytes Stimulates Aerobic Glycolysis: A Mechanism Coupling Neuronal Activity to Glucose Utilization Proc. Natl. Acad. Sci. USA 1994 91 10625 10629 10.1073/pnas.91.22.10625 7938003 PMC45074 80. Kasischke K.A. Vishwasrao H.D. Fisher P.J. Zipfel W.R. Webb W.W. Neural Activity Triggers Neuronal Oxidative Metabolism Followed by Astrocytic Glycolysis Science 2004 305 99 103 10.1126/science.1096485 15232110 81. Grinblat L. Pacheco Bolaños L.F. Stoppani A.O. Decreased Rate of Ketone-Body Oxidation and Decreased Activity of D-3-Hydroxybutyrate Dehydrogenase and Succinyl-CoA:3-Oxo-Acid CoA-Transferase in Heart Mitochondria of Diabetic Rats Biochem. J. 1986 240 49 56 10.1042/bj2400049 3548709 PMC1147374 82. Cai Q. Davis M.L. Sheng Z.H. Regulation of Axonal Mitochondrial Transport and Its Impact on Synaptic Transmission Neurosci. Res. 2011 70 9 15 10.1016/j.neures.2011.02.005 21352858 PMC3086944 83. Bartman S. Coppotelli G. Ross J.M. Mitochondrial Dysfunction: A Key Player in Brain Aging and Diseases Curr. Issues Mol. Biol. 2024 46 1987 2026 10.3390/cimb46030130 38534746 PMC10969191 84. Sutherland T.C. Sefiani A. Horvat D. Huntington T.E. Lei Y. West A.P. Geoffroy C.G. Age-Dependent Decline in Neuron Growth Potential and Mitochondria Functions in Cortical Neurons Cells 2021 10 1625 10.3390/cells10071625 34209640 PMC8306398 85. Bowling A.C. Mutisya E.M. Walker L.C. Price D.L. Cork L.C. Beal M.F. Age-Dependent Impairment of Mitochondrial Function in Primate Brain J. Neurochem. 1993 60 1964 1967 10.1111/j.1471-4159.1993.tb13430.x 8473911 86. Sandhu S.K. Kaur G. Mitochondrial Electron Transport Chain Complexes in Aging Rat Brain and Lymphocytes Biogerontology 2003 4 19 29 10.1023/A:1022473219044 12652186 87. Davie K. Janssens J. Koldere D. De Waegeneer M. Pech U. Kreft Ł. Aibar S. Makhzami S. Christiaens V. Bravo González-Blas C. A Single-Cell Transcriptome Atlas of the Aging Drosophila Brain Cell 2018 174 982 998.e20 10.1016/j.cell.2018.05.057 29909982 PMC6086935 88. Zhu X.H. Lu M. Lee B.Y. Ugurbil K. Chen W. In Vivo NAD Assay Reveals the Intracellular NAD Contents and Redox State in Healthy Human Brain and Their Age Dependences Proc. Natl. Acad. Sci. USA 2015 112 2876 2881 10.1073/pnas.1417921112 25730862 PMC4352772 89. Yoshino J. Baur J.A. Imai S.I. NAD+ Intermediates: The Biology and Therapeutic Potential of NMN and NR Cell Metab. 2018 27 513 528 10.1016/j.cmet.2017.11.002 29249689 PMC5842119 90. Shichkova P. Coggan J.S. Kanari L. Boci E. Favreau C. Antonel S.M. Keller D. Markram H. Breakdown and Repair of Metabolism in the Aging Brain Front. Sci. 2025 3 1441297 10.3389/fsci.2025.1441297 91. Zhao X. Yang X. Du C. Hao H. Liu S. Liu G. Zhang G. Fan K. Ma J. Up-Regulated Succinylation Modifications Induce a Senescence Phenotype in Microglia by Altering Mitochondrial Energy Metabolism J. Neuroinflammation 2024 21 296 10.1186/s12974-024-03284-4 39543710 PMC11566524 92. Na D. Zhang Z. Meng M. Li M. Gao J. Kong J. Zhang G. Guo Y. Energy Metabolism and Brain Aging: Strategies to Delay Neuronal Degeneration Cell Mol. Neurobiol. 2025 45 38 10.1007/s10571-025-01555-z 40259102 PMC12011708 93. Fakouri N.B. Hansen T.L. Desler C. Anugula S. Rasmussen L.J. From Powerhouse to Perpetrator-Mitochondria in Health and Disease Biology 2019 8 35 10.3390/biology8020035 31083572 PMC6627154 94. Ionescu-Tucker A. Cotman C.W. Emerging Roles of Oxidative Stress in Brain Aging and Alzheimer’s Disease Neurobiol. Aging 2021 107 86 95 10.1016/j.neurobiolaging.2021.07.014 34416493 95. Gómez J. Mota-Martorell N. Jové M. Pamplona R. Barja G. Mitochondrial ROS Production, Oxidative Stress and Aging within and between Species: Evidences and Recent Advances on This Aging Effector Exp. Gerontol. 2023 174 112134 10.1016/j.exger.2023.112134 36849000 96. Maynard S. Fang E.F. Scheibye-Knudsen M. Croteau D.L. Bohr V.A. DNA Damage, DNA Repair, Aging, and Neurodegeneration Cold Spring Harb. Perspect. Med. 2015 5 a025130 10.1101/cshperspect.a025130 26385091 PMC4588127 97. Chung K.K.K. Thomas B. Li X. Pletnikova O. Troncoso J.C. Marsh L. Dawson V.L. Dawson T.M. S-Nitrosylation of Parkin Regulates Ubiquitination and Compromises Parkin’s Protective Function Science 2004 304 1328 1331 10.1126/science.1093891 15105460 98. Xiao B. Kuruvilla J. Tan E.K. Mitophagy and Reactive Oxygen Species Interplay in Parkinson’s Disease npj Parkinsons Dis. 2022 8 135 10.1038/s41531-022-00402-y 36257956 PMC9579202 99. Xiao Q. Yang Y. Zhao X.Y. He L.S. Qin Y. He Y.H. Zhang G.P. Luo J.D. Oxidative Stress Contributes to the Impaired Sonic Hedgehog Pathway in Type 1 Diabetic Mice with Myocardial Infarction Exp. Ther. Med. 2015 10 1750 1758 10.3892/etm.2015.2766 26640546 PMC4665878 100. Yang C. Qi Y. Sun Z. The Role of Sonic Hedgehog Pathway in the Development of the Central Nervous System and Aging-Related Neurodegenerative Diseases Front. Mol. Biosci. 2021 8 711710 10.3389/fmolb.2021.711710 34307464 PMC8295685 101. Snezhkina A.V. Kudryavtseva A.V. Kardymon O.L. Savvateeva M.V. Melnikova N.V. Krasnov G.S. Dmitriev A.A. ROS Generation and Antioxidant Defense Systems in Normal and Malignant Cells Oxid. Med. Cell Longev. 2019 2019 6175804 10.1155/2019/6175804 31467634 PMC6701375 102. Venkateshappa C. Harish G. Mythri R.B. Mahadevan A. Bharath M.M.S. Shankar S.K. Increased Oxidative Damage and Decreased Antioxidant Function in Aging Human Substantia Nigra Compared to Striatum: Implications for Parkinson’s Disease Neurochem. Res. 2012 37 358 369 10.1007/s11064-011-0619-7 21971758 103. Lana J.V. Rios A. Takeyama R. Santos N. Pires L. Santos G.S. Rodrigues I.J. Jeyaraman M. Purita J. Lana J.F. Nebulized Glutathione as a Key Antioxidant for the Treatment of Oxidative Stress in Neurodegenerative Conditions Nutrients 2024 16 2476 10.3390/nu16152476 39125356 PMC11314501 104. Luchsinger J.A. Tang M.X. Shea S. Mayeux R. Caloric Intake and the Risk of Alzheimer Disease Arch. Neurol. 2002 59 1258 1263 10.1001/archneur.59.8.1258 12164721 105. Spina Purrello V. Cormaci G. Denaro L. Reale S. Costa A. Lalicata C. Sabbatini M. Marchetti B. Avola R. Effect of Growth Factors on Nuclear and Mitochondrial ADP-Ribosylation Processes during Astroglial Cell Development and Aging in Culture Mech. Ageing Dev. 2002 123 511 520 10.1016/S0047-6374(01)00354-2 11796136 106. Muftuoglu M. Mori M.P. de Souza-Pinto N.C. Formation and Repair of Oxidative Damage in the Mitochondrial DNA Mitochondrion 2014 17 164 181 10.1016/j.mito.2014.03.007 24704805 107. Lawless C. Greaves L. Reeve A.K. Turnbull D.M. Vincent A.E. The Rise and Rise of Mitochondrial DNA Mutations Open Biol. 2020 10 200061 10.1098/rsob.200061 32428418 PMC7276526 108. Yakes F.M. Van Houten B. Mitochondrial DNA Damage Is More Extensive and Persists Longer than Nuclear DNA Damage in Human Cells Following Oxidative Stress Proc. Natl. Acad. Sci. USA 1997 94 514 519 10.1073/pnas.94.2.514 9012815 PMC19544 109. Rong Z. Tu P. Xu P. Sun Y. Yu F. Tu N. Guo L. Yang Y. The Mitochondrial Response to DNA Damage Front. Cell Dev. Biol. 2021 9 669379 10.3389/fcell.2021.669379 34055802 PMC8149749 110. Wallace D.C. A Mitochondrial Paradigm of Metabolic and Degenerative Diseases, Aging, and Cancer: A Dawn for Evolutionary Medicine Annu. Rev. Genet. 2005 39 359 407 10.1146/annurev.genet.39.110304.095751 16285865 PMC2821041 111. Oldfors A. Moslemi A.R. Fyhr I.M. Holme E. Larsson N.G. Lindberg C. Mitochondrial DNA Deletions in Muscle Fibers in Inclusion Body Myositis J. Neuropathol. Exp. Neurol. 1995 54 581 587 10.1097/00005072-199507000-00012 7602331 112. Nido G.S. Dölle C. Flønes I. Tuppen H.A. Alves G. Tysnes O.B. Haugarvoll K. Tzoulis C. Ultradeep Mapping of Neuronal Mitochondrial Deletions in Parkinson’s Disease Neurobiol. Aging 2018 63 120 127 10.1016/j.neurobiolaging.2017.10.024 29257976 113. Bender A. Krishnan K.J. Morris C.M. Taylor G.A. Reeve A.K. Perry R.H. Jaros E. Hersheson J.S. Betts J. Klopstock T. High Levels of Mitochondrial DNA Deletions in Substantia Nigra Neurons in Aging and Parkinson Disease Nat. Genet. 2006 38 515 517 10.1038/ng1769 16604074 114. Bender A. Schwarzkopf R.M. McMillan A. Krishnan K.J. Rieder G. Neumann M. Elstner M. Turnbull D.M. Klopstock T. Dopaminergic Midbrain Neurons Are the Prime Target for Mitochondrial DNA Deletions J. Neurol. 2008 255 1231 1235 10.1007/s00415-008-0892-9 18604467 115. Wei Soong N. Hinton D.R. Cortopassi G. Arnheim N. Mosaicism for a Specific Somatic Mitochondrial DNA Mutation in Adult Human Brain Nat. Genet. 1992 2 318 323 10.1038/ng1292-318 1303287 116. Krokan H.E. Bjørås M. Base Excision Repair Cold Spring Harb. Perspect. Biol. 2013 5 a012583 10.1101/cshperspect.a012583 23545420 PMC3683898 117. Kazak L. Reyes A. Holt I.J. Minimizing the Damage: Repair Pathways Keep Mitochondrial DNA Intact Nat. Rev. Mol. Cell Biol. 2012 13 659 671 10.1038/nrm3439 22992591 118. Youle R.J. van der Bliek A.M. Mitochondrial Fission, Fusion, and Stress Science 2012 337 1062 1065 10.1126/science.1219855 22936770 PMC4762028 119. Yamazaki T. Kirchmair A. Sato A. Buqué A. Rybstein M. Petroni G. Bloy N. Finotello F. Stafford L. Navarro Manzano E. Mitochondrial DNA Drives Abscopal Responses to Radiation That Are Inhibited by Autophagy Nat. Immunol. 2020 21 1160 1171 10.1038/s41590-020-0751-0 32747819 120. Elson J.L. Samuels D.C. Turnbull D.M. Chinnery P.F. Random Intracellular Drift Explains the Clonal Expansion of Mitochondrial DNA Mutations with Age Am. J. Hum. Genet. 2001 68 802 806 10.1086/318801 11179029 PMC1274494 121. Kraytsberg Y. Kudryavtseva E. McKee A.C. Geula C. Kowall N.W. Khrapko K. Mitochondrial DNA Deletions Are Abundant and Cause Functional Impairment in Aged Human Substantia Nigra Neurons Nat. Genet. 2006 38 518 520 10.1038/ng1778 16604072 122. Itoh K. Weis S. Mehraein P. Müller-Höcker J. Defects of Cytochrome c Oxidase in the Substantia Nigra of Parkinson’s Disease: An Immunohistochemical and Morphometric Study Mov. Disord. 1997 12 9 16 10.1002/mds.870120104 8990048 123. Diaz F. Bayona-Bafaluy M.P. Rana M. Mora M. Hao H. Moraes C.T. Human Mitochondrial DNA with Large Deletions Repopulates Organelles Faster than Full-length Genomes under Relaxed Copy Number Control Nucleic Acids Res. 2002 30 4626 4633 10.1093/nar/gkf602 12409452 PMC135822 124. Moraes C.T. Kenyon L. Hao H. Mechanisms of Human Mitochondrial DNA Maintenance: The Determining Role of Primary Sequence and Length over Function MBoC 1999 10 3345 3356 10.1091/mbc.10.10.3345 10512871 PMC25601 125. Kowald A. Kirkwood T.B.L. Resolving the Enigma of the Clonal Expansion of mtDNA Deletions Genes. 2018 9 126 10.3390/genes9030126 29495484 PMC5867847 126. Vincent A.E. Rosa H.S. Pabis K. Lawless C. Chen C. Grünewald A. Rygiel K.A. Rocha M.C. Reeve A.K. Falkous G. Subcellular Origin of Mitochondrial DNA Deletions in Human Skeletal Muscle Ann. Neurol. 2018 84 289 301 10.1002/ana.25288 30014514 PMC6141001 127. Kang J.S. Tian J.H. Pan P.Y. Zald P. Li C. Deng C. Sheng Z.H. Docking of Axonal Mitochondria by Syntaphilin Controls Their Mobility and Affects Short-Term Facilitation Cell 2008 132 137 148 10.1016/j.cell.2007.11.024 18191227 PMC2259239 128. Miller K.E. Sheetz M.P. Axonal Mitochondrial Transport and Potential Are Correlated J. Cell Sci. 2004 117 2791 2804 10.1242/jcs.01130 15150321 129. McWilliams T.G. Prescott A.R. Allen G.F.G. Tamjar J. Munson M.J. Thomson C. Muqit M.M.K. Ganley I.G. Mito-QC Illuminates Mitophagy and Mitochondrial Architecture in Vivo J. Cell Biol. 2016 214 333 345 10.1083/jcb.201603039 27458135 PMC4970326 130. Lee H.F. Lee H.J. Chi C.S. Tsai C.R. Chang T.K. Wang C.J. The Neurological Evolution of Pearson Syndrome: Case Report and Literature Review Eur. J. Paediatr. Neurol. 2007 11 208 214 10.1016/j.ejpn.2006.12.008 17434771 131. Rocha M.C. Rosa H.S. Grady J.P. Blakely E.L. He L. Romain N. Haller R.G. Newman J. McFarland R. Ng Y.S. Pathological Mechanisms Underlying Single Large-Scale Mitochondrial DNA Deletions Ann. Neurol. 2018 83 115 130 10.1002/ana.25127 29283441 PMC5893934 132. Pistilli D. di Gioia C.R.T. D’Amati G. Sciacchitano S. Quaglione R. Quitadamo R. Casali C. Gallo P. Santorelli F.M. Detection of Deleted Mitochondrial DNA in Kearns-Sayre Syndrome Using Laser Capture Microdissection Human. Pathol. 2003 34 1058 1061 10.1053/S0046-8177(03)00344-7 14608542 133. Savu D.I. Moisoi N. Mitochondria—Nucleus Communication in Neurodegenerative Disease. Who Talks First, Who Talks Louder? Biochim. Et Biophys. Acta (BBA) Bioenerg. 2022 1863 148588 10.1016/j.bbabio.2022.148588 35780856 134. Morgenstern M. Peikert C.D. Lübbert P. Suppanz I. Klemm C. Alka O. Steiert C. Naumenko N. Schendzielorz A. Melchionda L. Quantitative High-Confidence Human Mitochondrial Proteome and Its Dynamics in Cellular Context Cell Metab. 2021 33 2464 2483.e18 10.1016/j.cmet.2021.11.001 34800366 PMC8664129 135. Fairbrother-Browne A. Ali A.T. Reynolds R.H. Garcia-Ruiz S. Zhang D. Chen Z. Ryten M. Hodgkinson A. Mitochondrial-Nuclear Cross-Talk in the Human Brain Is Modulated by Cell Type and Perturbed in Neurodegenerative Disease Commun. Biol. 2021 4 1262 10.1038/s42003-021-02792-w 34737414 PMC8569145 136. Mottis A. Herzig S. Auwerx J. Mitocellular Communication: Shaping Health and Disease Science 2019 366 827 832 10.1126/science.aax3768 31727828 137. Herzig S. Shaw R.J. AMPK: Guardian of Metabolism and Mitochondrial Homeostasis Nat. Rev. Mol. Cell Biol. 2018 19 121 135 10.1038/nrm.2017.95 28974774 PMC5780224 138. Verdin E. NAD+ in Aging, Metabolism, and Neurodegeneration Science 2015 350 1208 1213 10.1126/science.aac4854 26785480 139. Jain I.H. Zazzeron L. Goli R. Alexa K. Schatzman-Bone S. Dhillon H. Goldberger O. Peng J. Shalem O. Sanjana N.E. Hypoxia as a Therapy for Mitochondrial Disease Science 2016 352 54 61 10.1126/science.aad9642 26917594 PMC4860742 140. Chandel N.S. Maltepe E. Goldwasser E. Mathieu C.E. Simon M.C. Schumacker P.T. Mitochondrial Reactive Oxygen Species Trigger Hypoxia-Induced Transcription Proc. Natl. Acad. Sci. USA 1998 95 11715 11720 10.1073/pnas.95.20.11715 9751731 PMC21706 141. Diebold L. Chandel N.S. Mitochondrial ROS Regulation of Proliferating Cells Free Radic. Biol. Med. 2016 100 86 93 10.1016/j.freeradbiomed.2016.04.198 27154978 142. Campbell S.L. Wellen K.E. Metabolic Signaling to the Nucleus in Cancer Mol. Cell 2018 71 398 408 10.1016/j.molcel.2018.07.015 30075141 143. Ovciarikova J. Shikha S. Lacombe A. Courjol F. McCrone R. Hussain W. Maclean A. Lemgruber L. Martins-Duarte E.S. Gissot M. Two Ancient Membrane Pores Mediate Mitochondrial-Nucleus Membrane Contact Sites J. Cell Biol. 2024 223 e202304075 10.1083/jcb.202304075 38456969 PMC10923651 144. Desai R. East D.A. Hardy L. Faccenda D. Rigon M. Crosby J. Alvarez M.S. Singh A. Mainenti M. Hussey L.K. Mitochondria Form Contact Sites with the Nucleus to Couple Prosurvival Retrograde Response Sci. Adv. 2020 6 eabc9955 10.1126/sciadv.abc9955 33355129 PMC11206220 145. Yang M. Li C. Yang S. Xiao Y. Xiong X. Chen W. Zhao H. Zhang Q. Han Y. Sun L. Mitochondria-Associated ER Membranes—The Origin Site of Autophagy Front. Cell Dev. Biol. 2020 8 595 10.3389/fcell.2020.00595 32766245 PMC7378804 146. Cieri D. Vicario M. Giacomello M. Vallese F. Filadi R. Wagner T. Pozzan T. Pizzo P. Scorrano L. Brini M. SPLICS: A Split Green Fluorescent Protein-Based Contact Site Sensor for Narrow and Wide Heterotypic Organelle Juxtaposition Cell Death Differ. 2018 25 1131 1145 10.1038/s41418-017-0033-z 29229997 PMC5988678 147. Cisneros J. Belton T.B. Shum G.C. Molakal C.G. Wong Y.C. Mitochondria-Lysosome Contact Site Dynamics and Misregulation in Neurodegenerative Diseases Trends Neurosci. 2022 45 312 322 10.1016/j.tins.2022.01.005 35249745 PMC8930467 148. Fransen M. Lismont C. Walton P. The Peroxisome-Mitochondria Connection: How and Why? Int. J. Mol. Sci. 2017 18 1126 10.3390/ijms18061126 28538669 PMC5485950 149. Paillusson S. Stoica R. Gomez-Suaga P. Lau D.H.W. Mueller S. Miller T. Miller C.C.J. There’s Something Wrong with My MAM; the ER–Mitochondria Axis and Neurodegenerative Diseases Trends Neurosci. 2016 39 146 157 10.1016/j.tins.2016.01.008 26899735 PMC4780428 150. Wong Y.C. Ysselstein D. Krainc D. Mitochondria–Lysosome Contacts Regulate Mitochondrial Fission via RAB7 GTP Hydrolysis Nature 2018 554 382 386 10.1038/nature25486 29364868 PMC6209448 151. Shai N. Yifrach E. van Roermund C.W.T. Cohen N. Bibi C. IJlst L. Cavellini L. Meurisse J. Schuster R. Zada L. Systematic Mapping of Contact Sites Reveals Tethers and a Function for the Peroxisome-Mitochondria Contact Nat. Commun. 2018 9 1761 10.1038/s41467-018-03957-8 29720625 PMC5932058 152. English A.M. Schuler M.H. Xiao T. Kornmann B. Shaw J.M. Hughes A.L. ER-Mitochondria Contacts Promote Mitochondrial-Derived Compartment Biogenesis J. Cell Biol. 2020 219 e202002144 10.1083/jcb.202002144 33090183 PMC7588143 153. Sugiura A. McLelland G. Fon E.A. McBride H.M. A New Pathway for Mitochondrial Quality Control: Mitochondrial-derived Vesicles EMBO J. 2014 33 2142 2156 10.15252/embj.201488104 25107473 PMC4282503 154. König T. McBride H.M. Mitochondrial-Derived Vesicles in Metabolism, Disease, and Aging Cell Metab. 2024 36 21 35 10.1016/j.cmet.2023.11.014 38171335 155. Wang S. Liao Z. Zhang Q. Han X. Liu C. Wang J. Mitochondrial Dysfunction in Alzheimer’s Disease: A Key Frontier for Future Targeted Therapies Front. Immunol. 2025 15 1484373 10.3389/fimmu.2024.1484373 39877373 PMC11772192 156. Zvěřová M. Clinical Aspects of Alzheimer’s Disease Clin. Biochem. 2019 72 3 6 10.1016/j.clinbiochem.2019.04.015 31034802 157. Liu T. Sun W. Guo S. Yuan Z. Zhu M. Lu J. Chen T. Qu Y. Feng C. Yang T. Role of Mitochondrial Quality Control in Neurodegenerative Disease Progression Front. Cell Neurosci. 2025 19 1588645 10.3389/fncel.2025.1588645 40463912 PMC12129988 158. Swerdlow R.H. Mitochondria and Mitochondrial Cascades in Alzheimer’s Disease J. Alzheimer’s Dis. 2018 62 1403 1416 10.3233/JAD-170585 29036828 PMC5869994 159. Guha S. Johnson G.V.W. Nehrke K. The Crosstalk Between Pathological Tau Phosphorylation and Mitochondrial Dysfunction as a Key to Understanding and Treating Alzheimer’s Disease Mol. Neurobiol. 2020 57 5103 5120 10.1007/s12035-020-02084-0 32851560 PMC7544674 160. Perluigi M. Di Domenico F. Butterfield D.A. Oxidative Damage in Neurodegeneration: Roles in the Pathogenesis and Progression of Alzheimer Disease Physiol. Rev. 2024 104 103 197 10.1152/physrev.00030.2022 37843394 PMC11281823 161. Mary A. Eysert F. Checler F. Chami M. Mitophagy in Alzheimer’s Disease: Molecular Defects and Therapeutic Approaches Mol. Psychiatry 2023 28 202 216 10.1038/s41380-022-01631-6 35665766 PMC9812780 162. Colacurcio D.J. Nixon R.A. Disorders of Lysosomal Acidification-The Emerging Role of v-ATPase in Aging and Neurodegenerative Disease Ageing Res. Rev. 2016 32 75 88 10.1016/j.arr.2016.05.004 27197071 PMC5112157 163. Jiang X.J. Wu Y.Q. Ma R. Chang Y.M. Li L.L. Zhu J.H. Liu G.P. Li G. PINK1 Alleviates Cognitive Impairments via Attenuating Pathological Tau Aggregation in a Mouse Model of Tauopathy Front. Cell Dev. Biol. 2022 9 736267 10.3389/fcell.2021.736267 35059394 PMC8763800 164. Hou S.J. Zhang S.X. Li Y. Xu S.Y. Rapamycin Responds to Alzheimer’s Disease: A Potential Translational Therapy Clin. Interv. Aging 2023 18 1629 1639 10.2147/CIA.S429440 37810956 PMC10557994 165. Hou Y. Chu X. Park J.H. Zhu Q. Hussain M. Li Z. Madsen H.B. Yang B. Wei Y. Wang Y. Urolithin A Improves Alzheimer’s Disease Cognition and Restores Mitophagy and Lysosomal Functions Alzheimer’s Dement. 2024 20 4212 4233 10.1002/alz.13847 38753870 PMC11180933 166. Vaillant-Beuchot L. Eysert F. Duval B. Kinoshita P.F. Pardossi-Piquard R. Bauer C. Eddarkaoui S. Buée L. Checler F. Chami M. The Amyloid Precursor Protein and Its Derived Fragments Concomitantly Contribute to the Alterations of Mitochondrial Transport Machinery in Alzheimer’s Disease Cell Death Dis. 2024 15 367 10.1038/s41419-024-06742-2 38806484 PMC11133367 167. Wang Q. Tian J. Chen H. Du H. Guo L. Amyloid Beta-Mediated KIF5A Deficiency Disrupts Anterograde Axonal Mitochondrial Movement Neurobiol. Dis. 2019 127 410 418 10.1016/j.nbd.2019.03.021 30923004 168. Wang W. Yin J. Ma X. Zhao F. Siedlak S.L. Wang Z. Torres S. Fujioka H. Xu Y. Perry G. Inhibition of Mitochondrial Fragmentation Protects against Alzheimer’s Disease in Rodent Model Human. Mol. Genet. 2017 26 4118 4131 10.1093/hmg/ddx299 28973308 PMC5886251 169. Bhatti J.S. Kaur S. Mishra J. Dibbanti H. Singh A. Reddy A.P. Bhatti G.K. Reddy P.H. Targeting Dynamin-Related Protein-1 as a Potential Therapeutic Approach for Mitochondrial Dysfunction in Alzheimer’s Disease Biochim. Biophys. Acta Mol. Basis Dis. 2023 1869 166798 10.1016/j.bbadis.2023.166798 37392948 170. Bera A. Lavanya G. Reshmi R. Dev K. Kumar R. Mechanistic and Therapeutic Role of Drp1 in the Pathogenesis of Alzheimer’s Disease Eur. J. Neurosci. 2022 56 5516 5531 10.1111/ejn.15611 35078269 171. Pakpian N. Phopin K. Kitidee K. Govitrapong P. Wongchitrat P. Alterations in Mitochondrial Dynamic-Related Genes in the Peripheral Blood of Alzheimer’s Disease Patients Curr. Alzheimer Res. 2020 17 616 625 10.2174/1567205017666201006162538 33023448 172. Joshi A.U. Saw N.L. Shamloo M. Mochly-Rosen D. Drp1/Fis1 Interaction Mediates Mitochondrial Dysfunction, Bioenergetic Failure and Cognitive Decline in Alzheimer’s Disease Oncotarget 2017 9 6128 6143 10.18632/oncotarget.23640 29464060 PMC5814200 173. Han A.R. Moon T.K. Kang I.K. Yu D.B. Kim Y. Byon C. Park S. Kim H.L. Kim H.L. Lee K.J. Integrative Analysis of microRNA-Mediated Mitochondrial Dysfunction in Hippocampal Neural Progenitor Cell Death in Relation with Alzheimer’s Disease BMB Rep. 2024 57 281 286 10.5483/BMBRep.2023-0167 38053296 PMC11214893 174. Elsherbini A. Kirov A.S. Dinkins M.B. Wang G. Qin H. Zhu Z. Tripathi P. Crivelli S.M. Bieberich E. Association of Aβ with Ceramide-Enriched Astrosomes Mediates Aβ Neurotoxicity Acta Neuropathol. Commun. 2020 8 60 10.1186/s40478-020-00931-8 32345374 PMC7189561 175. Sbai O. Bazzani V. Tapaswi S. McHale J. Vascotto C. Perrone L. Is Drp1 a Link between Mitochondrial Dysfunction and Inflammation in Alzheimer’s Disease? Front. Mol. Neurosci. 2023 16 1166879 10.3389/fnmol.2023.1166879 37251647 PMC10213291 176. Zhang M. Hu G. Shao N. Qin Y. Chen Q. Wang Y. Zhou P. Cai B. Thioredoxin-Interacting Protein (TXNIP) as a Target for Alzheimer’s Disease: Flavonoids and Phenols Inflammopharmacology 2021 29 1317 1329 10.1007/s10787-021-00861-4 34350508 177. Kerr J.S. Adriaanse B.A. Greig N.H. Mattson M.P. Cader M.Z. Bohr V.A. Fang E.F. Mitophagy and Alzheimer’s Disease: Cellular and Molecular Mechanisms Trends Neurosci. 2017 40 151 166 10.1016/j.tins.2017.01.002 28190529 PMC5341618 178. Yang Y.N. Zhang M.Q. Yu F.L. Han B. Bao M.Y. Li X. Zhang Y. Peroxisom Proliferator-Activated Receptor-γ Coactivator-1α in Neurodegenerative Disorders: A Promising Therapeutic Target Biochem. Pharmacol. 2023 215 115717 10.1016/j.bcp.2023.115717 37516277 179. Katsouri L. Lim Y.M. Blondrath K. Eleftheriadou I. Lombardero L. Birch A.M. Mirzaei N. Irvine E.E. Mazarakis N.D. Sastre M. PPARγ-Coactivator-1α Gene Transfer Reduces Neuronal Loss and Amyloid-β Generation by Reducing β-Secretase in an Alzheimer’s Disease Model Proc. Natl. Acad. Sci. USA 2016 113 12292 12297 10.1073/pnas.1606171113 27791018 PMC5087021 180. Zhang Y. Chen C. Jiang Y. Wang S. Wu X. Wang K. PPARγ Coactivator-1α (PGC-1α) Protects Neuroblastoma Cells against Amyloid-Beta (Aβ) Induced Cell Death and Neuroinflammation via NF-κB Pathway BMC Neurosci. 2017 18 69 10.1186/s12868-017-0387-7 28946859 PMC5612334 181. Oka S. Leon J. Sakumi K. Ide T. Kang D. LaFerla F.M. Nakabeppu Y. Human Mitochondrial Transcriptional Factor A Breaks the Mitochondria-Mediated Vicious Cycle in Alzheimer’s Disease Sci. Rep. 2016 6 37889 10.1038/srep37889 27897204 PMC5126576 182. Mhyre T.R. Boyd J.T. Hamill R.W. Maguire-Zeiss K.A. Parkinson’s Disease Subcell. Biochem. 2012 65 389 455 10.1007/978-94-007-5416-4_16 23225012 PMC4372387 183. Fujiwara H. Hasegawa M. Dohmae N. Kawashima A. Masliah E. Goldberg M.S. Shen J. Takio K. Iwatsubo T. α-Synuclein Is Phosphorylated in Synucleinopathy Lesions Nat. Cell Biol. 2002 4 160 164 10.1038/ncb748 11813001 184. Dimant H. Ebrahimi-Fakhari D. McLean P.J. Molecular Chaperones and Co-Chaperones in Parkinson Disease Neuroscientist 2012 18 589 601 10.1177/1073858412441372 22829394 PMC3904222 185. Langston J.W. Ballard P. Tetrud J.W. Irwin I. Chronic Parkinsonism in Humans Due to a Product of Meperidine-Analog Synthesis Science 1983 219 979 980 10.1126/science.6823561 6823561 186. Labbé C. Ross O.A. Association Studies of Sporadic Parkinson’s Disease in the Genomic Era Curr. Genom. 2014 15 2 10 10.2174/1389202914666131210212745 PMC3958956 24653658 187. Valente E.M. Abou-Sleiman P.M. Caputo V. Muqit M.M.K. Harvey K. Gispert S. Ali Z. Del Turco D. Bentivoglio A.R. Healy D.G. Hereditary Early-Onset Parkinson’s Disease Caused by Mutations in PINK1 Science 2004 304 1158 1160 10.1126/science.1096284 15087508 188. Darios F. Corti O. Lücking C.B. Hampe C. Muriel M.-P. Abbas N. Gu W.J. Hirsch E.C. Rooney T. Ruberg M. Parkin Prevents Mitochondrial Swelling and Cytochrome c Release in Mitochondria-Dependent Cell Death Hum. Mol. Genet. 2003 12 517 526 10.1093/hmg/ddg044 12588799 189. Morais V.A. Verstreken P. Roethig A. Smet J. Snellinx A. Vanbrabant M. Haddad D. Frezza C. Mandemakers W. Vogt-Weisenhorn D. Parkinson’s Disease Mutations in PINK1 Result in Decreased Complex I Activity and Deficient Synaptic Function EMBO Mol. Med. 2009 1 99 111 10.1002/emmm.200900006 20049710 PMC3378121 190. Kim K.H. Song K. Yoon S.H. Shehzad O. Kim Y.S. Son J.H. Rescue of PINK1 Protein Null-Specific Mitochondrial Complex IV Deficits by Ginsenoside Re Activation of Nitric Oxide Signaling J. Biol. Chem. 2012 287 44109 44120 10.1074/jbc.M112.408146 23144451 PMC3531727 191. Clark E.H. Vázquez de la Torre A. Hoshikawa T. Briston T. Targeting Mitophagy in Parkinson’s Disease J. Biol. Chem. 2021 296 100209 10.1074/jbc.REV120.014294 33372898 PMC7948953 192. Qiu J. Chen Y. Zhuo J. Zhang L. Liu J. Wang B. Sun D. Yu S. Lou H. Urolithin A Promotes Mitophagy and Suppresses NLRP3 Inflammasome Activation in Lipopolysaccharide-Induced BV2 Microglial Cells and MPTP-Induced Parkinson’s Disease Model Neuropharmacology 2022 207 108963 10.1016/j.neuropharm.2022.108963 35065082 193. Kuerec A.H. Lim X.K. Khoo A.L.Y. Sandalova E. Guan L. Feng L. Maier A.B. Targeting Aging with Urolithin A in Humans: A Systematic Review Ageing Res. Rev. 2024 100 102406 10.1016/j.arr.2024.102406 39002645 194. Singh A. D’Amico D. Andreux P.A. Fouassier A.M. Blanco-Bose W. Evans M. Aebischer P. Auwerx J. Rinsch C. Urolithin A Improves Muscle Strength, Exercise Performance, and Biomarkers of Mitochondrial Health in a Randomized Trial in Middle-Aged Adults Cell Rep. Med. 2022 3 100633 10.1016/j.xcrm.2022.100633 35584623 PMC9133463 195. Castagnet P.I. Golovko M.Y. Barceló-Coblijn G.C. Nussbaum R.L. Murphy E.J. Fatty Acid Incorporation Is Decreased in Astrocytes Cultured from Alpha-Synuclein Gene-Ablated Mice J. Neurochem. 2005 94 839 849 10.1111/j.1471-4159.2005.03247.x 16033426 196. Chung Y.C. Baek J.Y. Kim S.R. Ko H.W. Bok E. Shin W.H. Won S.Y. Jin B.K. Capsaicin Prevents Degeneration of Dopamine Neurons by Inhibiting Glial Activation and Oxidative Stress in the MPTP Model of Parkinson’s Disease Exp. Mol. Med. 2017 49 e298 10.1038/emm.2016.159 28255166 PMC5382554 197. Brakedal B. Dölle C. Riemer F. Ma Y. Nido G.S. Skeie G.O. Craven A.R. Schwarzlmüller T. Brekke N. Diab J. The NADPARK Study: A Randomized Phase I Trial of Nicotinamide Riboside Supplementation in Parkinson’s Disease Cell Metab. 2022 34 396 407.e6 10.1016/j.cmet.2022.02.001 35235774 198. Cai R. Zhang Y. Simmering J.E. Schultz J.L. Li Y. Fernandez-Carasa I. Consiglio A. Raya A. Polgreen P.M. Narayanan N.S. Enhancing Glycolysis Attenuates Parkinson’s Disease Progression in Models and Clinical Databases J. Clin. Investig. 2019 129 4539 4549 10.1172/JCI129987 31524631 PMC6763248 199. Junn E. Jang W.H. Zhao X. Jeong B.S. Mouradian M.M. Mitochondrial Localization of DJ-1 Leads to Enhanced Neuroprotection J. Neurosci. Res. 2009 87 123 129 10.1002/jnr.21831 18711745 PMC2752655 200. Skou L.D. Johansen S.K. Okarmus J. Meyer M. Pathogenesis of DJ-1/PARK7-Mediated Parkinson’s Disease Cells 2024 13 296 10.3390/cells13040296 38391909 PMC10887164 201. Zhou W. Bercury K. Cummiskey J. Luong N. Lebin J. Freed C.R. Phenylbutyrate Up-Regulates the DJ-1 Protein and Protects Neurons in Cell Culture and in Animal Models of Parkinson Disease J. Biol. Chem. 2011 286 14941 14951 10.1074/jbc.M110.211029 21372141 PMC3083206 202. Duarte P. Michalska P. Crisman E. Cuadrado A. León R. Novel Series of Dual NRF2 Inducers and Selective MAO-B Inhibitors for the Treatment of Parkinson’s Disease Antioxidants 2022 11 247 10.3390/antiox11020247 35204129 PMC8868346 203. Wu N. Luo Z. Deng R. Zhang Z. Zhang J. Liu S. Luo Z. Qi Q. Sulforaphane: An Emerging Star in Neuroprotection and Neurological Disease Prevention Biochem. Pharmacol. 2025 233 116797 10.1016/j.bcp.2025.116797 39929442 204. Rawlins M.D. Wexler N.S. Wexler A.R. Tabrizi S.J. Douglas I. Evans S.J.W. Smeeth L. The Prevalence of Huntington’s Disease Neuroepidemiology 2016 46 144 153 10.1159/000443738 26824438 205. MacDonald M.E. Ambrose C.M. Duyao M.P. Myers R.H. Lin C. Srinidhi L. Barnes G. Taylor S.A. James M. Groot N. A Novel Gene Containing a Trinucleotide Repeat That Is Expanded and Unstable on Huntington’s Disease Chromosomes Cell 1993 72 971 983 10.1016/0092-8674(93)90585-E 8458085 206. Jodeiri Farshbaf M. Ghaedi K. Huntington’s Disease and Mitochondria Neurotox. Res. 2017 32 518 529 10.1007/s12640-017-9766-1 28639241 207. Franco-Iborra S. Plaza-Zabala A. Montpeyo M. Sebastian D. Vila M. Martinez-Vicente M. Mutant HTT (Huntingtin) Impairs Mitophagy in a Cellular Model of Huntington Disease Autophagy 2021 17 672 689 10.1080/15548627.2020.1728096 32093570 PMC8032238 208. Funayama M. Nishioka K. Li Y. Hattori N. Molecular Genetics of Parkinson’s Disease: Contributions and Global Trends J. Hum. Genet. 2023 68 125 130 10.1038/s10038-022-01058-5 35821405 PMC9968657 209. Joshi D.C. Chavan M.B. Gurow K. Gupta M. Dhaliwal J.S. Ming L.C. The Role of Mitochondrial Dysfunction in Huntington’s Disease: Implications for Therapeutic Targeting Biomed. Pharmacother. 2025 183 117827 10.1016/j.biopha.2025.117827 39854819 210. Guedes-Dias P. Pinho B.R. Soares T.R. de Proença J. Duchen M.R. Oliveira J.M.A. Mitochondrial Dynamics and Quality Control in Huntington’s Disease Neurobiol. Dis. 2016 90 51 57 10.1016/j.nbd.2015.09.008 26388396 211. McColgan P. Tabrizi S.J. Huntington’s Disease: A Clinical Review Eur. J. Neurol. 2018 25 24 34 10.1111/ene.13413 28817209 212. Cui L. Jeong H. Borovecki F. Parkhurst C.N. Tanese N. Krainc D. Transcriptional Repression of PGC-1α by Mutant Huntingtin Leads to Mitochondrial Dysfunction and Neurodegeneration Cell 2006 127 59 69 10.1016/j.cell.2006.09.015 17018277 213. Thau N. Knippenberg S. Körner S. Rath K.J. Dengler R. Petri S. Decreased mRNA Expression of PGC-1α and PGC-1α-Regulated Factors in the SOD1G93A ALS Mouse Model and in Human Sporadic ALS J. Neuropathol. Exp. Neurol. 2012 71 1064 1074 10.1097/NEN.0b013e318275df4b 23147503 214. Johri A. Calingasan N.Y. Hennessey T.M. Sharma A. Yang L. Wille E. Chandra A. Beal M.F. Pharmacologic Activation of Mitochondrial Biogenesis Exerts Widespread Beneficial Effects in a Transgenic Mouse Model of Huntington’s Disease Hum. Mol. Genet. 2012 21 1124 1137 10.1093/hmg/ddr541 22095692 PMC3277311 215. Khalil B. El Fissi N. Aouane A. Cabirol-Pol M.J. Rival T. Liévens J.C. PINK1-Induced Mitophagy Promotes Neuroprotection in Huntington’s Disease Cell Death Dis. 2015 6 e1617 10.1038/cddis.2014.581 25611391 PMC4669776 216. Wong Y.C. Holzbaur E.L.F. The Regulation of Autophagosome Dynamics by Huntingtin and HAP1 Is Disrupted by Expression of Mutant Huntingtin, Leading to Defective Cargo Degradation J. Neurosci. 2014 34 1293 1305 10.1523/JNEUROSCI.1870-13.2014 24453320 PMC3898289 217. Cherubini M. Lopez-Molina L. Gines S. Mitochondrial Fission in Huntington’s Disease Mouse Striatum Disrupts ER-Mitochondria Contacts Leading to Disturbances in Ca2+ Efflux and Reactive Oxygen Species (ROS) Homeostasis Neurobiol. Dis. 2020 136 104741 10.1016/j.nbd.2020.104741 31931142 218. Davies S.W. Turmaine M. Cozens B.A. DiFiglia M. Sharp A.H. Ross C.A. Scherzinger E. Wanker E.E. Mangiarini L. Bates G.P. Formation of Neuronal Intranuclear Inclusions Underlies the Neurological Dysfunction in Mice Transgenic for the HD Mutation Cell 1997 90 537 548 10.1016/S0092-8674(00)80513-9 9267033 219. Sawant N. Morton H. Kshirsagar S. Reddy A.P. Reddy P.H. Mitochondrial Abnormalities and Synaptic Damage in Huntington’s Disease: A Focus on Defective Mitophagy and Mitochondria-Targeted Therapeutics Mol. Neurobiol. 2021 58 6350 6377 10.1007/s12035-021-02556-x 34519969 220. Hu D. Sun X. Magpusao A. Fedorov Y. Thompson M. Wang B. Lundberg K. Adams D.J. Qi X. Small-Molecule Suppression of Calpastatin Degradation Reduces Neuropathology in Models of Huntington’s Disease Nat. Commun. 2021 12 5305 10.1038/s41467-021-25651-y 34489447 PMC8421361 221. Brotman R.G. Moreno-Escobar M.C. Joseph J. Munakomi S. Pawar G. Amyotrophic Lateral Sclerosis StatPearls StatPearls Publishing Treasure Island, FL, USA 2025 32310611 222. Cozzolino M. Rossi S. Mirra A. Carrì M.T. Mitochondrial Dynamism and the Pathogenesis of Amyotrophic Lateral Sclerosis Front. Cell. Neurosci. 2015 9 31 10.3389/fncel.2015.00031 25713513 PMC4322717 223. Genin E.C. Abou-Ali M. Paquis-Flucklinger V. Mitochondria, a Key Target in Amyotrophic Lateral Sclerosis Pathogenesis Genes. 2023 14 1981 10.3390/genes14111981 38002924 PMC10671245 224. Shi Y. Lin S. Staats K.A. Li Y. Chang W.-H. Hung S.T. Hendricks E. Linares G.R. Wang Y. Son E.Y. Haploinsufficiency Leads to Neurodegeneration in C9ORF72 ALS/FTD Human Induced Motor Neurons Nat. Med. 2018 24 313 325 10.1038/nm.4490 29400714 PMC6112156 225. Wang W. Wang L. Lu J. Siedlak S.L. Fujioka H. Liang J. Jiang S. Ma X. Jiang Z. da Rocha E.L. The Inhibition of TDP-43 Mitochondrial Localization Blocks Its Neuronal Toxicity Nat. Med. 2016 22 869 878 10.1038/nm.4130 27348499 PMC4974139 226. Deng J. Yang M. Chen Y. Chen X. Liu J. Sun S. Cheng H. Li Y. Bigio E.H. Mesulam M. FUS Interacts with HSP60 to Promote Mitochondrial Damage PLOS Genet. 2015 11 e1005357 10.1371/journal.pgen.1005357 26335776 PMC4559378 227. Luan P. D’Amico D. Andreux P.A. Laurila P.P. Wohlwend M. Li H. Lima T.I.d. Place N. Rinsch C. Zanou N. Urolithin A Improves Muscle Function by Inducing Mitophagy in Muscular Dystrophy Sci. Transl. Med. 2021 13 eabb0319 10.1126/scitranslmed.abb0319 33827972 228. Osaki T. Uzel S.G.M. Kamm R.D. Microphysiological 3D Model of Amyotrophic Lateral Sclerosis (ALS) from Human iPS-Derived Muscle Cells and Optogenetic Motor Neurons Sci. Adv. 2018 4 eaat5847 10.1126/sciadv.aat5847 30324134 PMC6179377 229. Safety and Efficacy of Trehalose in Amyotrophic Lateral Sclerosis (HEALEY ALS Platform Trial): An Adaptive, Phase 2/3, Double-Blind, Randomised, Placebo-Controlled Trial Lancet Neurol. 2025 24 500 511 10.1016/S1474-4422(25)00173-5 40409314 230. Pham J. Keon M. Brennan S. Saksena N. Connecting RNA-Modifying Similarities of TDP-43, FUS, and SOD1 with MicroRNA Dysregulation Amidst A Renewed Network Perspective of Amyotrophic Lateral Sclerosis Proteinopathy Int. J. Mol. Sci. 2020 21 3464 10.3390/ijms21103464 32422969 PMC7278980 231. Xu Y.F. Gendron T.F. Zhang Y.J. Lin W.L. D’Alton S. Sheng H. Casey M.C. Tong J. Knight J. Yu X. Wild-Type Human TDP-43 Expression Causes TDP-43 Phosphorylation, Mitochondrial Aggregation, Motor Deficits, and Early Mortality in Transgenic Mice J. Neurosci. 2010 30 10851 10859 10.1523/JNEUROSCI.1630-10.2010 20702714 PMC3056148 232. Akkum F.I. Ozbas C.E. Damar M. Uversky V.N. Fayetorbay R. Kang D.E. Woo J.A. Coskuner-Weber O. Impacts of Pathogenic Mutations on the Structures of the CHCHD10 Monomer: An AlphaFold3 Study Linked to the Generation of Conformational Ensembles Int. J. Biol. Macromol. 2025 318 144970 10.1016/j.ijbiomac.2025.144970 40490178 233. Choi S.Y. Lee J.H. Chung A.-Y. Jo Y. Shin J.H. Park H.C. Kim H. Lopez-Gonzalez R. Ryu J.R. Sun W. Prevention of Mitochondrial Impairment by Inhibition of Protein Phosphatase 1 Activity in Amyotrophic Lateral Sclerosis Cell Death Dis. 2020 11 888 10.1038/s41419-020-03102-8 33087694 PMC7578657 234. Yu C.H. Davidson S. Harapas C.R. Hilton J.B. Mlodzianoski M.J. Laohamonthonkul P. Louis C. Low R.R.J. Moecking J. De Nardo D. TDP-43 Triggers Mitochondrial DNA Release via mPTP to Activate cGAS/STING in ALS Cell 2020 183 636 649.e18 10.1016/j.cell.2020.09.020 33031745 PMC7599077 235. Martin L.J. The Mitochondrial Permeability Transition Pore: A Molecular Target for Amyotrophic Lateral Sclerosis Therapy Biochim. Biophys. Acta 2010 1802 186 197 10.1016/j.bbadis.2009.07.009 19651206 PMC2790555 236. Witzel S. Maier A. Steinbach R. Grosskreutz J. Koch J.C. Sarikidi A. Petri S. Günther R. Wolf J. Hermann A. Safety and Effectiveness of Long-Term Intravenous Administration of Edaravone for Treatment of Patients with Amyotrophic Lateral Sclerosis JAMA Neurol. 2022 79 121 130 10.1001/jamaneurol.2021.4893 35006266 PMC8749709 237. Varghese M. Zhao W. Trageser K.J. Pasinetti G.M. Peroxisome Proliferator Activator Receptor Gamma Coactivator-1α Overexpression in Amyotrophic Lateral Sclerosis: A Tale of Two Transgenics Biomolecules 2020 10 760 10.3390/biom10050760 32414179 PMC7277592 238. Mancuso R. del Valle J. Modol L. Martinez A. Granado-Serrano A.B. Ramirez-Núñez O. Pallás M. Portero-Otin M. Osta R. Navarro X. Resveratrol Improves Motoneuron Function and Extends Survival in SOD1G93A ALS Mice Neurotherapeutics 2014 11 419 432 10.1007/s13311-013-0253-y 24414863 PMC3996124 239. Ashwani Sharma A. Choudhary M.K. Gugulothu D. Pandita D. Verma S. Vora L.K. Khatri D.K. Garabadu D. Epigenetic and Mitochondrial Metabolic Dysfunction in Multiple Sclerosis: A Review of Herbal Drug Approaches and Current Clinical Trials Mol. Neurobiol. 2025 62 10045 10090 10.1007/s12035-025-04868-8 40180689 PMC12289784 240. Pegoretti V. Swanson K.A. Bethea J.R. Probert L. Eisel U.L.M. Fischer R. Inflammation and Oxidative Stress in Multiple Sclerosis: Consequences for Therapy Development Oxid. Med. Cell Longev. 2020 2020 7191080 10.1155/2020/7191080 32454942 PMC7240663 241. Karuppagounder S.S. Brahmachari S. Lee Y. Dawson V.L. Dawson T.M. Ko H.S. The C-Abl Inhibitor, Nilotinib, Protects Dopaminergic Neurons in a Preclinical Animal Model of Parkinson’s Disease Sci. Rep. 2014 4 4874 10.1038/srep04874 24786396 PMC4007078 242. Manczak M. Reddy P.H. Mitochondrial Division Inhibitor 1 Protects against Mutant Huntingtin-Induced Abnormal Mitochondrial Dynamics and Neuronal Damage in Huntington’s Disease Hum. Mol. Genet. 2015 24 7308 7325 10.1093/hmg/ddv429 26464486 PMC4664169 243. Ciuro M. Sangiorgio M. Cacciato V. Cantone G. Fichera C. Salvatorelli L. Magro G. Leanza G. Vecchio M. Valle M.S. Mitigating the Functional Deficit after Neurotoxic Motoneuronal Loss by an Inhibitor of Mitochondrial Fission Int. J. Mol. Sci. 2024 25 7059 10.3390/ijms25137059 39000168 PMC11241433 244. Marx N. Ritter N. Disse P. Seebohm G. Busch K.B. Detailed Analysis of Mdivi-1 Effects on Complex I and Respiratory Supercomplex Assembly Sci. Rep. 2024 14 19673 10.1038/s41598-024-69748-y 39187541 PMC11347648 245. Kaufmann P. Thompson J.L.P. Levy G. Buchsbaum R. Shefner J. Krivickas L.S. Katz J. Rollins Y. Barohn R.J. Jackson C.E. Phase II Trial of CoQ10 for ALS Finds Insufficient Evidence to Justify Phase III Ann. Neurol. 2009 66 235 244 10.1002/ana.21743 19743457 PMC2854625 246. McGarry A. McDermott M. Kieburtz K. de Blieck E.A. Beal F. Marder K. Ross C. Shoulson I. Gilbert P. Mallonee W.M. A Randomized, Double-Blind, Placebo-Controlled Trial of Coenzyme Q10 in Huntington Disease Neurology 2017 88 152 159 10.1212/WNL.0000000000003478 27913695 PMC5224719 247. Gonzales M.M. Garbarino V.R. Kautz T.F. Song X. Lopez-Cruzan M. Linehan L. Van Skike C.E. De Erausquin G.A. Galvan V. Orr M.E. Rapamycin Treatment for Alzheimer’s Disease and Related Dementias: A Pilot Phase 1 Clinical Trial Commun. Med. 2025 5 189 10.1038/s43856-025-00904-9 40394335 PMC12092812 248. Bennett C.F. Krainer A.R. Cleveland D.W. Antisense Oligonucleotide Therapies for Neurodegenerative Diseases Annu. Rev. Neurosci. 2019 42 385 406 10.1146/annurev-neuro-070918-050501 31283897 PMC7427431 249. Ansori A.N.M. Antonius Y. Susilo R.J.K. Hayaza S. Kharisma V.D. Parikesit A.A. Zainul R. Jakhmola V. Saklani T. Rebezov M. Application of CRISPR-Cas9 Genome Editing Technology in Various Fields: A Review Narra J. 2023 3 e184 10.52225/narra.v3i2.184 38450259 PMC10916045 Figure 1 Alterations in mitochondrial dynamics and mitophagy impairment in neuronal senescence and neurodegeneration. Scheme representing alterations in mitochondrial dynamics and mitophagy in senescent neurons compared with younger neurons. In young neurons mitophagy and mitochondrial dynamics are balanced. In senescence cells, decreased fusion proteins (OPA1, Mtfn2) and increased fission proteins (Drp1 and Fis1) triggers mitochondria fragmentation. Moreover, mitophagy is also impaired due to decreased PINK1 and PGAM5 expression, lower activation of Parkin and less mitophagy-associated proteins (MAPs) expression. Those alterations during aging might trigger neurodegenerative diseases, such as Alzheimer’s, Parkinson’s, Huntington’s, and amyotrophic lateral sclerosis. Image created with Biorender ( https://www.biorender.com/ Figure 2 Mitochondrial targets in neurodegenerative diseases. Schematic representation of mitochondria-related pathologies and key mitochondrial therapeutic targets in Alzheimer’s, Parkinson’s, Huntington’s disease, and amyotrophic lateral sclerosis. Figure created with Biorender. ",
  "metadata": {
    "Title of this paper": "Application of CRISPR-Cas9 Genome Editing Technology in Various Fields: A Review",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467961/"
  }
}