{
  "title": "Paper_1146",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467876 PMC12467876.1 12467876 12467876 41008628 10.3390/biom15091321 biomolecules-15-01321 1 Review Approach to a Child with Hypophosphatemia Antonowicz Agnieszka 1 https://orcid.org/0000-0002-1849-8375 Lipiński Patryk 2 Popow Michał 3 https://orcid.org/0000-0002-1959-8255 Skrzypczyk Piotr 1 * Bitan Gal Academic Editor Rao Gundu Academic Editor 1 agnieszka.antonowicz-zawislak@wum.edu.pl 2 patryk.lipinski.92@gmail.com 3 michal.popow@uckwum.pl * pskrzypczyk@wum.edu.pl 15 9 2025 9 2025 15 9 497615 1321 26 6 2025 09 9 2025 13 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Hypophosphatemia is a rare ion disorder in children, but it carries the risk of serious clinical sequelae in tissues and organs with high energy requirements, such as bone tissue. This article discusses the metabolism of phosphate in the body, the clinical manifestations of hypophosphatemia, and the diagnostic tests necessary in patients with this disorder. Extra-renal causes are analyzed, and renal forms of hypophosphatemia are discussed in detail. Renal hypophosphatemia, depending on the mechanism, is divided into PTH-dependent (e.g., primary hyperparathyroidism), FGF23-dependent (e.g., X-linked hypophosphatemia), and intrinsic renal hypophosphatemia (e.g., Fanconi syndrome). The treatment of hypophosphatemia involves compensating for phosphate deficiency, often simultaneously with the supply of an active form of vitamin D. Always seek causal treatment, such as parathyroidectomy in primary hyperparathyroidism. In the FGF-23-dependent forms of X-linked hypophosphatemia and tumor-induced osteomalacia, burosumab has proven to be an effective and safe drug. Conclusions: hypophosphatemia children phosphate rickets tubulopathy X-linked hypophosphatemia This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Phosphates and Their Role in the Body’s Homeostasis 1.1. Phosphate Demand and Turnover in the Human Body Phosphates constitute approximately 0.5% of the body weight of newborns and approximately 1% of the body weight of older children. About 85% of phosphates in the human body are found in bones and teeth, mainly in the form of hydroxyapatite, 14% is intracellular fluid, and only about 1% of phosphates are found in extracellular fluid (including serum) [ 1 2 The daily dietary intake of phosphates is approximately 1200 mg. Intestinal absorption is approximately 800 mg/day, and intestinal secretion of phosphates is 150 mg/day. Bone resorption and bone formation in the phosphate range are the same and amount to 300 mg/day. The glomerular filtration of phosphates is 6000 mg/day. The tubular reabsorption of phosphates is 5350 mg/day, while only 650 mg/day is excreted in urine; 550 mg of phosphates are removed daily with feces [ 3 Figure 1 2 4 In people with efficient kidneys, excess dietary phosphate is excreted through the mechanisms described below. Table 1 3 5 6 7 1.2. Role of Phosphate in the Human Body Phosphates, although as mentioned, make up only 1% of the human body’s content, are essential for virtually all life processes. In the first place, energy processes—phosphates are a source of readily available energy accumulated in adenosine triphosphate (ATP) and participate in the construction of nucleic acids. The roles of phosphates in the body are the construction of cell membranes (phospholipids) and nucleic acids (DNA, RNA) and hydroxyapatite—the mineral component of bones and teeth, activation of many enzymes and, together with calcium, the coagulation system, participation in intracellular energy metabolism (adenosine triphosphate, ATP), participation in intracellular signaling—“second transmitter” (cAMP, phosphatidylinositol), buffering of intracellular fluids (maintenance of proper pH–isohydria), participation in oxygen transport to tissues—release of oxygen from hemoglobin (2,3-diphosphoglycerate, 2,3-DPG) and involvement in immune processes [ 3 5 6 7 Phosphates and calcium are the main mineral components of bone tissue. The mineralization process involves the formation of hydroxyapatite from phosphates and calcium around collagen fibers. The process of mineralization is strictly regulated by many cells (osteoblasts, osteoclasts) and proteins (e.g., osteoprotegerin, RANKL, bone morphogenetic proteins, osteopontin) [ 8 9 The growth plate of long bones is composed of successive layers of chondrocytes, which proliferate, undergo hypertrophy, and then undergo apoptosis. Mineralization and bone tissue formation occur in the layer of hypertrophic chondrocytes. Phosphates are essential for the process of chondrocyte apoptosis; therefore, their deficiency leads to the inhibition of chondrocyte apoptosis, growth plate widening, impaired bone matrix mineralization, and the development of rickets [ 10 11 2. Mechanisms of Phosphate Homeostasis PTH, 1,25(OH) 2 2.1. Parathyroid Hormone Parathyroid hormone (PTH) is the primary hormone regulating calcium and phosphate metabolism. It is produced in the parathyroid glands. It maintains homeostasis by releasing calcium and phosphate from bones, reducing calcium excretion and phosphate reabsorption in the kidneys, and indirectly increasing calcium and phosphate absorption in the intestines. PTH inhibits phosphate reabsorption in the proximal tubule by decreasing the expression of sodium-phosphate cotransporters NaPi2a and NaPi2c. PTH, by increasing the production of calcitriol, stimulates indirectly the expression of the NaPi2b in the intestine and thus enhances the absorption of phosphate from food [ 4 2 12 The stimulation of bone resorption is indirect since osteoclasts do not have a receptor for PTH. The hormone binds to osteoblasts, increasing their expression of RANKL and inhibiting their secretion of osteoprotegerin (OPG). Free OPG competitively binds to RANKL as a decoy receptor, preventing RANKL from interacting with RANK, a receptor for RANKL. The binding of RANKL to RANK stimulates osteoclast precursors and bone resorption. PTH, through a cAMP-dependent mechanism, inhibits the activity of NHE3 (sodium hydrogen exchanger 3) in the proximal tubule, reducing the loss of hydrogen ions, which play a crucial role in the RANKL metabolic pathway [ 13 2.2. Calcitriol–1,25(OH) 2 Sources of cholecalciferol are animal foods (rich sources are, for example, fish like eels) and dermal synthesis under UV radiation, and sources of ergocalciferol are plant foods. Once synthesized or absorbed in the intestine, vitamin D2 and D3 undergo the same metabolic processes. The first step involves hydroxylation at position 25 in the liver during the so-called first pass. The resulting 25(OH)D is the main store of vitamin D in the body, and commonly available tests determine its concentration, which indicates the body’s vitamin D reserves. The hydroxylation step at position 25 is not regulated and depends primarily on substrate supply. The 25(OH)D then undergoes a second hydroxylation at the 1-alpha position, resulting in the most metabolically active form of vitamin D–1,25(OH) 2 CYP27B1 14 The main action of calcitriol is to increase blood calcium and phosphate levels by promoting the absorption of dietary calcium and phosphate from the gastrointestinal tract. Calcitriol increases NaPi2b protein expression and sodium-dependent phosphate intestinal uptake. It also stimulates the release of calcium and phosphate from bone, acting on osteoblasts and increasing their production of RANKL, which in turn activates osteoclasts. Finally, calcitriol increases renal tubular calcium reabsorption, not significantly affecting phosphate reabsorption [ 4 The fact that calcitriol increases bone resorption seems unintuitive and counterintuitive to the observed clinical effects. However, it appears that in a situation of adequate calcium supply (intestinal absorption), the production of new bone tissue outweighs bone resorption. Hence, the in vivo effect of calcitriol under the condition of dietary calcium supply is to increase bone mass. 2.3. Fibroblast Growth Factor 23 Fibroblast growth factor 23 (FGF23) is a 251-amino-acid protein, discovered in 2000 by a team of Japanese researchers, which is most similar to FGF19 and FGF21 [ 15 15 FGF23 16 Table 2 FGF23 is responsible for regulating calcium and phosphate metabolism by binding to the FGF23 receptors (FGF23Rs)—FGFR1c, FGFR3c, and FGFR4. To activate FGFR1c, a cofactor (Klotho protein) is necessary. FGF23 reduces intestinal phosphate absorption by inhibiting 1,25(OH) 2 2 19 20 The kl 21 22 23 A summary of the direct actions of key players on phosphate metabolism is presented in Table 3 3. Symptoms of Hypophosphatemia Moderate hypophosphatemia is usually asymptomatic. Symptoms are typically observed when serum phosphate levels fall below 1 mg/dL (i.e., <0.32 mmol/L). The tissues and organs most sensitive to hypophosphatemia are those that are energetically active, such as muscles, the liver, the central nervous system, the peripheral nervous system, and blood cells. Chronic hypophosphatemia may manifest itself as muscle weakness, bone and joint pain, paresthesia, muscle tremors, convulsions, proximal myopathy, myalgia, vitamin D-resistant rickets, short stature, osteomalacia, liver dysfunction, heart rhythm disorders, and hemolysis [ 3 5 7 24 Table 4 4. Diagnostic Tests in the Diagnosis of Hypophosphatemia 4.1. Overview of Laboratory Tests Table 5 2 3 7 25 26 4.2. Assessment of Serum Phosphate Concentration Phosphate concentration is highest in newborns, then gradually decreases, with a further significant decrease occurring during puberty—faster in girls, which corresponds to their earlier onset of puberty. It is essential to refer phosphate concentrations to the appropriate standards. Many standards for serum phosphate concentrations have been published, including two large-scale studies in recent years: the HARP [ 26 27 Table 6 4.3. Assessment of Urinary Phosphate Excretion Regarding the evaluation of the urine test, the recommendations emphasize the usefulness of indicators calculated from urine portions rather than daily urine collections, as daily urinary phosphate excretion is more a derivative of diet than of the mechanisms controlling its homeostasis. As for the urine portion, traditionally it was considered that the authoritative portion is the second portion after the night. Although the current view is that any portion can be assessed, it is worth noting that the authors used the second portion to establish standards [ 26 To assess phosphate excretion in urine, we calculate the fractional excretion of phosphate (FePO 4 To calculate the fractional excretion of phosphate in urine, we use the following formula: FePO 4 P Crea P Crea To calculate phosphate reabsorption, we use the following formula: TRP = 1 − FePO 4 TmP/GFR is the tubular maximum reabsorption of phosphate related to glomerular filtration rate. To calculate all of the above indicators, you can use the calculator available on the website of the European Society for Pediatric Nephrology ( https://www.espn-online.org/tmp-gfr-calculator/#calculator 26 4.4. Assessment of FG23 Concentration Many commercially available tests measure FGF23 concentration (immunoassays). C-terminal assays measure both the concentration of the entire molecule and the inactive C-terminal fragment (cFGF23); intact assays measure only the concentration of the whole, active molecule [ 29 29 26 Table 2 17 18 4.5. Molecular Studies Genetic (molecular) testing is recommended in most cases of renal hypophosphatemia and plays a vital role in the diagnosis of calcium-phosphate metabolism disorders, including hypophosphatemia. This is particularly important because clinical analysis, pedigree analysis, biochemical parameters, and imaging tests may not always determine the cause of the disease, especially in cases of a mild phenotype (e.g., heterozygotes of pathogenic variants in SCL34A1 and SCL34A3) and negative family history. As disease phenotypes may overlap, for example, in the cases of autosomal dominant hypophosphatemic rickets (ADHR) and X-linked hypophosphatemia (XLH), genetic panels using next-generation sequencing to evaluate multiple genes are recommended [ 30 25 4.6. Imaging Studies In terms of diagnostic imaging, a standard ultrasound is an essential test. The examination allows assessment of the size and structure of the kidneys. It is necessary to evaluate the kidneys for the presence of calcifications in both the parenchyma and the urinary tract. Calcifications indicate that hyperphosphaturia is also accompanied by hypercalciuria [ 25 X-rays of the wrist and knee joints are necessary for features indicative of rickets on physical examination or elevated alkaline phosphatase activity. The images taken should be evaluated using the Rickets Severity Score scale [ 31 5. Causes of Hypophosphatemia The causes of hypophosphatemia are shown in Table 7 Supplementary Table S1 25 6. Non-Renal Causes of Hypophosphatemia 6.1. Hypophosphatemia Secondary to Insufficient Supply or Impaired Absorption of Phosphates This phenomenon is relatively rare, as already mentioned; diets are usually abundant in phosphate. Hypophosphatemia in this mechanism may occur: in newborns with low birth weight who are exclusively breastfed, children fed with elemental or hypoallergenic formulas, during inadequate parenteral nutrition, when using high doses of phosphate binders (calcium carbonate, calcium acetate, sevelamer), after gastrointestinal surgery (blind loops, short bowel syndrome, bariatric surgery), due to infective agents (intestinal tuberculosis, giardiasis, Whipple’s disease), mucosal abnormalities (celiac disease), inflammatory bowel disease (Crohn’s syndrome) or infiltrative conditions (amyloidosis, lymphoma) [ 3 7 24 25 32 Table 8 6.2. Loss of Phosphates During Renal Replacement Therapy Hyperphosphatemia is one of the primary symptoms of chronic kidney disease. It may also occur in patients with acute kidney injury. Dialysis modalities vary depending on their potential for phosphate removal, and the elimination of phosphate by dialysis is a cornerstone of managing hyperphosphatemia. In peritoneal dialysis, phosphate mass removal appears to be correlated with peritoneal creatinine but not urea clearance. Several factors, including blood and dialysate flow rates, dialyzer membrane surface area, and ultrafiltration volume, influence phosphate clearance during hemodialysis. Phosphate removal can be substantially improved by hemodiafiltration, increased dialysis frequencies, and extended treatment times [ 35 Continuous renal replacement therapies (CRRT), especially those using convectional transport (hemofiltration, hemodiafiltration), are very effective in phosphate removal. Hypophosphatemia during CRRT usually occurs after 48 h; therefore, it is necessary to supplement it in the diet or parenteral nutrition. The appropriate selection of fluids during continuous renal replacement therapy (CRRT) is also essential. Traditional fluid used in the Baxter/Gambro system (Hemosol) contains no phosphate. In contrast, the replacement fluid used in the citrate anticoagulation system (Phoxilium) is enriched in phosphate (1.2 mmol/L), which leads to lower serum phosphate levels [ 36 37 38 6.3. Hypophosphatemia Due to Intracellular Shift The shift of phosphate from the blood (into cells, bone) rarely leads to clinically significant hypophosphatemia. Various mechanisms lead to this condition. After insulin infusion, intracellular transport of glucose, potassium, and phosphate occurs. Phosphates are consumed very rapidly in the refeeding syndrome [ 3 7 Hungry bone syndrome is a condition characterized by profound hypocalcemia and hypophosphatemia that may persist for a long time. This condition most commonly occurs following parathyroidectomy (due to primary or secondary hyperparathyroidism). Hungry bone syndrome occurs due to a sudden shift in bone metabolism after the removal of excess parathyroid hormone, resulting in increased osteoblastic activity and rapid consumption of calcium and phosphorus by the bones. Several factors, including patient age and the duration and severity of preexisting hyperparathyroidism, can affect its presentation [ 39 40 7. Renal Causes of Hypophosphatemia 7.1. PTH-Dependent Renal Causes 7.1.1. Primary Hyperparathyroidism Primary hyperparathyroidism is rare in pediatrics. It is not infrequently associated with a genetic background. In patients, uncontrolled parathyroid hormone production leads to increased bone resorption and hypercalcemia. Parathormone is a potent phosphaturic factor; therefore, patients exhibit hypophosphatemia, hyperphosphaturia, and decreased tubular maximum for phosphate per glomerular filtration rate (TmP/GFR). Hypercalciuria is secondary to hypercalcemia and bone resorption ( Table 9 2 41 42 7.1.2. Calcipenic Rickets The typical calcipenic rickets is vitamin D deficiency rickets. It is extremely rare in Europe today. It can be, for example, a consequence of a misdiagnosed hypersensitivity to vitamin D (based on a rapidly overgrowing fontanel) and withdrawal of vitamin D supplementation. Children with vitamin D deficiency may develop rickets. It manifests as a syndrome of changes characterized by reduced bone mineralization, abnormal bone development, and progressive skeletal deformities, including bowlegs, knock knees, rib widening (also known as a “rose chest”), chest deformity, skull bulging, and kyphoscoliosis. Vitamin D deficiency leads to impaired intestinal calcium absorption, resulting in secondary hyperparathyroidism and, consequently, urinary phosphate wasting ( Table 9 3 12 18 25 In vitamin-D-dependent rickets, a defect in vitamin D metabolism leads to an impaired vitamin D function despite a normal vitamin supply, resulting in clinical symptoms resembling those of deficiency rickets ( Table 10 Table 11 25 32 43 44 7.2. PTH- and FGF23-Independent Renal Causes In this group of diseases characterized by renal phosphate loss, there is a primary disruption of proximal tubule function in phosphate reabsorption. This is either an isolated genetic defect or a generalized defect involving differentially expressed functions of all proximal tubules. The concentration of PTH, especially FGF23, is usually decreased secondary to hypophosphatemia ( Table 12 3 7 24 25 44 7.2.1. Hypophosphatemia Due to SLC34A1 and SLC34A3 Pathogenic Variants SLC34A1 SLC34A3 Table 13 2 3 7 24 25 Not in all patients with biallelic pathogenic variants in SLC34A1 SLC34A3 Biallelic pathogenic SLC34A1 45 46 Hereditary hypophosphatemic rickets with hypercalciuria (HHRH; #241530) is an autosomal recessive disorder caused by biallelic pathogenic variants of the SLC34A3 2 2 47 48 49 A multi-center European analysis of the clinical course in patients with pathogenic variants in these genes was published this year. The authors analyzed 113 patients with pathogenic or likely pathogenic variants in SLC34A1 SLC34A3 SLC34A3 SLC34A3 SLC34A1 SLC34A3 2 30 The following case from our clinical practice illustrates the complexity of the phenotype of patients with SLC34A1 SLC34A3 2 SLC34A3 7.2.2. Fanconi Syndrome Fanconi syndrome is a congenital or acquired complex dysfunction of the proximal tubule of the nephron, characterized by impaired reabsorption of amino acids, glucose, phosphate, bicarbonate, uric acid, and other substances, resulting in their massive loss in the urine and associated clinical sequelae. Fanconi syndrome is a polyetiological disorder. Inborn, genetically determined metabolic diseases, as well as acquired conditions, drugs, or toxins, can lead to its occurrence. Fanconi syndrome extremely rarely develops as an idiopathic form [ 50 51 52 53 54 Table 14 Patients present with variously expressed growth retardation, polyuria, polydipsia, a tendency to dehydration, vomiting, anorexia, constipation, muscle weakness, and bone disorders: hypophosphatemic rickets in children and osteomalacia in adults. In addition, there are symptoms typical of the underlying condition. Laboratory tests reveal glucosuria, mild proteinuria in urinalysis, hypophosphatemia, hyperchloremia, hypokalemia, hyponatremia, metabolic acidosis, and a tendency to hypouricemia ( Table 15 2 50 51 52 53 54 7.3. FGF23-Dependent Renal Causes In this group of disorders, there is impaired physiological regulation and overproduction of FGF23 and, as a result, decreased hydroxylation of vitamin D at the 1-alpha position and decreased phosphate absorption in the gastrointestinal tract, as well as decreased expression of NaPi2a and NaPi2c cotransporters in the proximal tubule, resulting in loss of phosphate in the urine. FGF23 levels are in “inadequate”, normal, or elevated levels. The conditions can be acquired or congenital. The most common of these diseases is X-linked hypophosphatemia (XLH) ( Table 16 Elevated intact FGF23 concentrations in children with hypophosphatemia might seem to indicate FGF23-dependent renal phosphate wasting, e.g., autosomal dominant hypophosphatemic rickets, X-linked hypophosphatemia, or tumor-induced osteomalacia [ 15 55 56 29 7.3.1. Tumor-Induced Osteomalacia Tumor-induced osteomalacia (TIO) is a paraneoplastic syndrome secondary to a mesenchymal tumor, occurring mainly in adults. Tumors are usually benign, small, and mesenchymal in origin and are primarily located in soft tissues or bones. Tumors can be located anywhere in the body, from the head to the toes, making localization challenging. In 60% of cases, the presence of the FN1/FGFR1 FN1/FGF1 57 58 59 Biochemical analysis reveals a pattern of disturbances similar to XLH with dominating hypophosphatemia, hyperphosphaturia, low concentration of 1,25(OH) 2 57 58 59 As an example, we present an adult patient from our clinical practice whose diagnosis began with frequent fractures. A 48-year-old woman with a history of a single wrist fracture in childhood following a fall while skating and multiple low-energy fractures of both cortical and trabecular bone over the past six years was referred due to severe symptomatic hypophosphatemia (muscle weakness), severe pain in her long bones that reduced her quality of life, and multiple low-energy fractures. The bone fragility developed seven years ago without any apparent cause. The most serious fractures concerned: C6 and C7 spinous processes during a sneeze seven years ago, femoral neck fracture in 2 years, linear fracture of both iliac plates (without obvious trauma), bilateral rib fractures (6, 9 and 10) during a cough three years ago, spontaneous fracture of the manubrium of the sternum in two years ago and of the body of the sternum before a year. Laboratory tests revealed hypophosphatemia up to 0.46 mmol/L with a significantly reduced TmP/GFR (0.320 mmol/L, normal range: 0.88–1.42), and a reduced mean phosphate reabsorption capacity of 69.6% (normal range: 85–95%). Despite hypophosphatemia, a high FGF23 level of 133 kRU/l persisted (normal value: 26–110). The overall clinical picture was consistent with acquired TIO. The source of FGF23 secretion was identified using PET scanning with Gallium-labeled somatostatin analogs. It was a mesenchymal tumor of the right mandibular ramus. After its resection, phosphatemia returned to normal, and bone pain significantly decreased. Due to the high risk of incomplete tumor removal, the patient remains under constant endocrinological supervision. 7.3.2. Cutaneous Skeletal Hypophosphatemia Syndrome Cutaneous skeletal hypophosphatemia syndrome (CSHS) is an ultra-rare somatic mosaic RASopathy in which somatic RAS-activating variants in regions of skeletal dysplasia produce excessive FGF23 [ 58 60 61 58 60 61 7.3.3. Iron-Induced Hypophosphatemia The interaction between iron supply, gene expression, FGF23 secretion, and calcium-phosphate metabolism is complex. Iron deficiency causes an increase in FGF23 gene expression. On the other hand, iron carboxymaltose (FCM) has been shown to impair FGF23 removal and increase phosphaturia. This effect was not observed with the supply of other preparations; moreover, with long-term supply, it is offset by the inhibition of FGF23 gene expression [ 62 63 In vivo, the effect of iron inhibition of gene expression seems to prevail. A 2021 meta-analysis showed that iron supply reduced FGF23 levels, and this effect was more pronounced with oral supply [ 64 7.3.4. X-Linked Hypophosphatemia X-linked hypophosphatemia (XLH; OMIM #307800) is a rare genetic disease occurring in 1 in 20,000 to 25,000 births. It is a genetically determined condition, caused by pathogenic variants in the PHEX 43 PHEX 10 33 The symptoms of XLH are heterogeneous and change over time due to the progressive nature of the disease. In children, delayed and disproportionate growth, craniosynostosis, rickets, delayed motor development, and gait disorders are observed. Both children and adults may experience bone and joint pain, short stature, and limb deformities (especially varus deformity of the lower limbs). Periapical abscesses, excessive tooth decay, osteomalacia, joint stiffness, muscle pain and weakness, Chiari malformations, and gait disorders. Patients experience a severely reduced quality of life. Unlike adults, hearing loss is not commonly observed in children. In adults, we also see more fractures (including stress fractures and pseudofractures), osteoarthritis, extraosseous calcifications (including enthesopathies, spinal stenosis), and progressive disability affecting the ability to work [ 65 33 66 The disease is suspected based on typical biochemical abnormalities ( Table 17 47 33 We present the case of a girl with XLH who underwent two corrective orthopedic procedures before her calcium and phosphate metabolism was examined, and she was referred to our center for diagnosis. A 3-year-old girl was found to have lower limb varus deformity since the age of one and a half. The patient has been under orthopedic care, initially receiving conservative treatment with increased doses of vitamin D (up to 2000 IU/day). Due to severe deformation of the lower limbs, at the age of 2 years and 8 months, the Eight-Plates Guided Growth Systems (Orthofix, Lewisville, TX, USA) were placed on the proximal ends of both tibial epiphyses. At the age of 3 years, the Eight-Plate on the left side was revised. It was only after the second orthopedic surgery that the girl’s calcium and phosphate levels were tested, revealing normocalcemia (calcium—2.32 mmol/L), hypophosphatemia (phosphorus—0.85 mmol/L), high vitamin D concentration (25OHD—85.4 pg/mL), high alkaline phosphatase activity (460 IU/L) and decreased TmP/GFR—0.99 mmol/L (normal values: 1.32–1.85). Genetic testing using next-generation sequencing revealed a pathogenic variant in one allele of the PHEX CLCN5 DMP1 ENPP1 FAH FGF23 KL SLC34A1 SLC34A3 VDR 7.3.5. Autoantibodies Against PHEX In January 2025, a fascinating study was published, analyzing 13 adults with FGF23-dependent hypophosphatemia. Other causes of renal phosphate loss (including genetic causes and TIO) were ruled out in these patients. Five of the 13 patients were found to have autoantibodies against the PHEX protein. The molecular effect resembles XLH—the lack of active PHEX protein leads to the overexpression of the FGF23 gene, resulting in hyperphosphaturia and hypophosphatemia. One of the patients was also found to have other autoimmune diseases, including autoimmune thyroiditis, idiopathic thrombocytopenic purpura, systemic lupus erythematosus, and antiphospholipid syndrome [ 67 8. Treatment of Hypophosphatemia 8.1. Causative Treatment In all cases of hypophosphatemia, causal treatment—aimed at addressing the cause of phosphate deficiency—should be pursued. Hence, making a diagnosis is crucial. Complete elimination of the cause is possible in only a few situations (e.g., removal of a tumor in TIO or removal of the cause of malabsorption syndrome). In other cases, symptomatic treatment remains the preferred approach. Examples of causal treatment of hypophosphatemia are shown in Table 18 8.2. Symptomatic Treatment Most patients with hypophosphatemia can only be treated symptomatically. The mainstay is the supplementation of lost phosphate. The drug of choice is a phosphate mixture. The typical composition of the mix is the following (in Latin):  Natrium phosphoricum monobasicum 4.5 g;  Natrium phosphoricum dibasicum 36.25 g;  Aqua dest. ad 250 g  m.f. solutio. The mixture is dosed per kg of body weight (20–60 (80) mg/kg/24 h or 0.7–2.0 mmol/kg/24 h or 0.4–1.25 mL/kg/24 h). The drug requires multiple doses a day. In many situations of massive phosphate loss (e.g., XLH), it is not possible to normalize the serum phosphate concentration, so other indicators, such as a decrease in alkaline phosphatase activity, should be used to assess the effectiveness of treatment [ 30 To reduce the risk of PTH increase, patients require an active form of vitamin D (alfacalcidol—1-alpha-OH-vitamin D or calcitriol—1,25(OH)2-vitamin D). Alfacalcidol is usually administered at a dose of 30–50 ng/kg/24 h [ 30 Patients with hypophosphatemic rickets require a multidisciplinary approach to treatment. Often, orthopedic treatment is necessary, although surgical treatment is recommended once a reduction in the severity of rickets lesions has been achieved. Patients with XLH may require neurosurgical (Chiari malformation), ENT (osteosclerosis), and dental (caries, periapical abscesses) treatment. Multispecialty surveillance is necessary [ 30 Patients with Fanconi syndrome require a supply of water, sodium, potassium, and sometimes calcium, in addition to phosphate supplementation and an active form of vitamin D. 8.3. Burosumab Burosumab is a human recombinant monoclonal antibody directed against FGF23. It is produced using a cell line derived from Chinese hamster ovary cells. By inhibiting FGF23, burosumab increases tubular reabsorption of phosphate in the kidneys and serum 1,25(OH) 2 Greater safety and security of the drug with conventional therapy specified in adult patients with XLH (with additional drug once every 4 weeks) [ 68 69 70 Adverse events were mild (mainly related to the injection site) and did not require treatment discontinuation in any patient. Antibodies to burosumab developed in some patients, but their presence did not affect the effectiveness of the treatment [ 70 Burosumab has also been successfully used in adults with TIO, where the drug normalized phosphatemia, reduced bone symptoms, and significantly improved quality of life [ 58 71 In 2018, burosumab was approved by the European Medicines Agency in Europe and the U.S. Food and Drug Administration for the treatment of children and adults with XLH and TIO. In the following years, additional studies on burosumab in XLH were published, indicating the long-term effects of treatment [ 52 72 53 Given the common underlying role of FGF23-mediated hypophosphatemia in XLH, TIO, and CSHS, burosumab also became a promising therapeutic option for patients with CSHS. To date, several reports have been published regarding both adults and children with CHCS treated with burosumab [ 39 54 55 In the authors’ country, the drug has been available under the so-called drug program for children with XLH since 2024. Individual consent for reimbursement of treatment in other registered indications can be applied for. 8.4. Limitations of Available Treatment Methods and New Therapies on the Horizon Unfortunately, all available treatments for hypophosphatemia have their limitations and can cause various complications, some of which are serious. Treatment with a phosphate mixture is associated with several complications. First, the drug is poorly tolerated—many patients experience troublesome gastrointestinal symptoms (abdominal pain, nausea, diarrhea). In addition, the supply of phosphate is a potent stimulus of PTH, which can cause secondary hyperparathyroidism [ 30 73 74 75 The administration of active forms of vitamin D increases calcium absorption, and thus, secondarily, calcemia and calciuria. Hypercalciuria, together with pre-existing hyperphosphaturia, increases the risk of nephrocalcinosis and urolithiasis [ 73 74 75 Burosumab has undoubtedly become a breakthrough in the treatment of FGF23-dependent hypophosphatemia. Like any therapy, it is not without side effects. In recent years, three systematic reviews with meta-analyses have been published discussing the efficacy and safety of burosumab in both children and adults. The conclusions from these analyses are as follows: the incidence of adverse effects in patients receiving burosumab is higher compared to those receiving placebo; however, the effects are mild (most commonly injection site reaction events, arthralgia, and headaches) and self-limiting, and do not lead to discontinuation of therapy. The studies did not observe a clinically significant increase in calcemia, calciuria, PTH concentration, or the severity of nephrocalcinosis [ 73 74 75 However, the authors emphasize the short observation period. Considering the mechanism of action of burosumab, it is necessary to conduct studies that closely monitor calcium and phosphate metabolism in treated patients and the occurrence of extraosseous calcifications, including those in the kidneys, arteries, and heart. In addition, it is not clear whether burosumab can normalize patients’ height and how it affects already-present extraosseous calcifications, enthesopathies, dental abscesses, and hearing impairment. It is worth noting that there is also a lack of data on efficacy and safety in the youngest children—those under 1 year of age. Furthermore, it should be remembered that burosumab will likely need to be administered for life, which raises questions about cost-benefit analysis [ 73 74 75 Many children with XLH continue to have growth deficiency despite treatment with burosumab. Recombinant human growth hormone may be considered for these patients [ 30 76 77 78 79 Gene therapy is another promising therapeutic approach to monogenic forms of hypophosphatemia. A liver-targeting adeno-associated virus (AAV) inhibiting FGF23 signaling has recently been developed. An AAV vector carrying a gene for the C-terminal fragment of FGF23 was injected into mice with XLH. The hepatic expression of the C-terminal fragment of FGF23 corrected skeletal manifestations and osteomalacia in these animals [ 80 81 In a study by Imel et al., iron supplementation in three adult patients with ADHR and iron deficiency resulted in normalization of serum phosphorus levels, alleviation of symptoms, and allowed patients to discontinue calcitriol and phosphate supplementation [ 82 64 9. Conclusions Hypophosphatemia is a decrease in phosphate concentration below the normal values. The symptoms of hypophosphatemia affect mainly tissues and organs with high energy demand (muscles and nervous system) and bone tissue. In children, chronic hypophosphatemia leads to growth retardation and hypophosphatemic, vitamin-D-resistant rickets. In older children and adults, chronic hypophosphatemia causes osteomalacia, fractures, and pseudofractures. Laboratory diagnostics must include a complete assessment of calcium-phosphorus metabolism with calculation of the following indices: FePO 4 Treatment involves both symptomatic measures (primarily phosphate supplementation) and causative measures (i.e., treatment of the underlying disease, such as cysteamine in patients with cystinosis). Burosumab is a monoclonal antibody targeting FGF-23 approved for the treatment of X-linked hypophosphatemia and tumor-induced osteomalacia. Clinical experience gathered in recent years indicates the extraordinary effectiveness and safety of the drug compared to conventional therapy. Acknowledgments The authors express their invaluable gratitude to Małgorzata Pańczyk-Tomaszewska, head of the Department of Pediatrics and Nephrology, Medical University of Warsaw, for her ongoing support. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/biom15091321/s1 25 30 33 34 Author Contributions Conceptualization, A.A. and P.S.; formal analysis, P.S.; resources, P.L. and P.S.; writing—original draft preparation, A.A., P.L., M.P. and P.S.; writing—reviewing and editing, P.S.; visualization, P.S.; supervision, P.S.; project administration, P.L. and P.S.; funding acquisition, P.L. and P.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created. Conflicts of Interest The authors declare no conflicts of interest. References 1. Wilson R. Mukherjee-Roy N. Gattineni J. The role of fibroblast growth factor 23 in regulation of phosphate balance Pediatr. Nephrol. 2024 39 3439 3451 10.1007/s00467-024-06395-5 38874635 2. Wagner C.A. The basics of phosphate metabolism Nephrol. Dial. Transplant. 2024 39 190 201 10.1093/ndt/gfad188 37660247 PMC10828206 3. Ito N. Hidaka N. Kato H. The pathophysiology of hypophosphatemia Best Pract. Res. Clin. Endocrinol. Metab. 2024 38 101851 10.1016/j.beem.2023.101851 38087658 4. Saurette M. Alexander R.T. Intestinal phosphate absorption: The paracellular pathway predominates? Exp. Biol. Med. 2019 244 646 654 10.1177/1535370219831220 PMC6552399 30764666 5. Perumal N.L. Padidela R. Phosphate Homeostasis and Disorders of Phosphate Metabolism Curr. Pediatr. Rev. 2024 20 412 425 10.2174/1573396319666221221121350 36545737 6. Murray S.L. Wolf M. Calcium and Phosphate Disorders: Core Curriculum 2024 Am. J. Kidney Dis. 2024 83 241 256 10.1053/j.ajkd.2023.04.017 38099870 7. Christov M. Jüppner H. Phosphate homeostasis disorders Best Pract. Res. Clin. Endocrinol. Metab. 2018 32 685 706 10.1016/j.beem.2018.06.004 30449549 8. Lafage-Proust M.H. Magne D. Biology of bone mineralization and ectopic calcifications: The same actors for different plays Arch. Pediatr. 2024 31 4s3 4s12 10.1016/S0929-693X(24)00151-9 39343471 9. Peacock M. Phosphate Metabolism in Health and Disease Calcif. Tissue Int. 2021 108 3 15 10.1007/s00223-020-00686-3 32266417 10. Robinson M.E. AlQuorain H. Murshed M. Rauch F. Mineralized tissues in hypophosphatemic rickets Pediatr. Nephrol. 2020 35 1843 1854 10.1007/s00467-019-04290-y 31392510 11. Kamenický P. Briot K. Munns C.F. Linglart A. X-linked hypophosphataemia Lancet 2024 404 887 901 10.1016/S0140-6736(24)01305-9 39181153 12. Khundmiri S.J. Murray R.D. Lederer E. PTH and Vitamin D Compr. Physiol. 2016 6 561 601 10.1002/j.2040-4603.2016.tb00690.x 27065162 PMC11163478 13. Bezerra C.N. Girardi A.C. Carraro-Lacroix L.R. Rebouças N.A. Mechanisms underlying the long-term regulation of NHE3 by parathyroid hormone Am. J. Physiol. Ren. Physiol. 2008 294 F1232 F1237 10.1152/ajprenal.00025.2007 18322024 14. Balcells M.E. Yokobori N. Hong B.Y. Corbett J. Cervantes J. The lung microbiome, vitamin D, and the tuberculous granuloma: A balance triangle Microb. Pathog. 2019 131 158 163 10.1016/j.micpath.2019.03.041 30953746 15. Yamashita T. Yoshioka M. Itoh N. Identification of a novel fibroblast growth factor, FGF-23, preferentially expressed in the ventrolateral thalamic nucleus of the brain Biochem. Biophys. Res. Commun. 2000 277 494 498 10.1006/bbrc.2000.3696 11032749 16. Autosomal dominant hypophosphataemic rickets is associated with mutations in FGF23 Nat. Genet. 2000 26 345 348 10.1038/81664 11062477 17. Bär L. Stournaras C. Lang F. Föller M. Regulation of fibroblast growth factor 23 (FGF23) in health and disease FEBS Lett. 2019 593 1879 1900 10.1002/1873-3468.13494 31199502 18. Gohil A. Imel E.A. FGF23 and Associated Disorders of Phosphate Wasting Pediatr. Endocrinol. Rev. 2019 17 17 34 31599133 10.17458/per.vol17.2019.gi.fgf23anddisordersphosphate PMC7040960 19. Ho B.B. Bergwitz C. FGF23 signalling and physiology J. Mol. Endocrinol. 2021 66 R23 R32 10.1530/JME-20-0178 33338030 PMC8782161 20. Bacchetta J. Bardet C. Prié D. Physiology of FGF23 and overview of genetic diseases associated with renal phosphate wasting Metabolism 2020 103s 153865 10.1016/j.metabol.2019.01.006 30664852 21. Matsumura Y. Aizawa H. Shiraki-Iida T. Nagai R. Kuro-o M. Nabeshima Y. Identification of the human klotho gene and its two transcripts encoding membrane and secreted klotho protein Biochem. Biophys. Res. Commun. 1998 242 626 630 10.1006/bbrc.1997.8019 9464267 22. Hu M.C. Shi M. Zhang J. Quiñones H. Griffith C. Kuro-o M. Moe O.W. Klotho deficiency causes vascular calcification in chronic kidney disease J. Am. Soc. Nephrol. 2011 22 124 136 10.1681/ASN.2009121311 21115613 PMC3014041 23. Shroff R. Phosphate is a vascular toxin Pediatr. Nephrol. 2013 28 583 593 10.1007/s00467-012-2347-x 23161206 24. Imel E.A. Congenital Conditions of Hypophosphatemia in Children Calcif. Tissue Int. 2021 108 74 90 10.1007/s00223-020-00692-5 32328695 PMC7581541 25. Haffner D. Leifheit-Nestler M. Grund A. Schnabel D. Rickets guidance: Part I-diagnostic workup Pediatr. Nephrol. 2022 37 2013 2036 10.1007/s00467-021-05328-w 34910242 PMC9307538 26. Pott V. Tietze H. Kanzelmeyer N. von der Born J. Baumann U. Mindermann C. Suhlrie A. Drube J. Melk A. Das A.M. LMS-Based Pediatric Reference Values for Parameters of Phosphate Homeostasis in the HARP Cohort J. Clin. Endocrinol. Metab. 2024 109 668 679 10.1210/clinem/dgad597 37850343 27. Adeli K. Higgins V. Trajcevski K. White-Al Habeeb N. The Canadian laboratory initiative on pediatric reference intervals: A CALIPER white paper Crit. Rev. Clin. Lab. Sci. 2017 54 358 413 10.1080/10408363.2017.1379945 29017389 28. Kliegman R.M. Geme J.W.S. III Nelson Textbook of Pediatrics 22nd ed. Elsevier Amsterdam, The Netherlands 2024 4896 29. Hartley I.R. Gafni R.I. Roszko K.L. Brown S.M. de Castro L.F. Saikali A. Ferreira C.R. Gahl W.A. Pacak K. Blau J.E. Determination of FGF23 Levels for the Diagnosis of FGF23-Mediated Hypophosphatemia J. Bone Miner. Res. 2022 37 2174 2185 10.1002/jbmr.4702 36093861 PMC9712269 30. Haffner D. Emma F. Seefried L. Högler W. Javaid K.M. Bockenhauer D. Bacchetta J. Eastwood D. Biosse Duplan M. Schnabel D. Clinical practice recommendations for the diagnosis and management of X-linked hypophosphataemia Nat. Rev. Nephrol. 2025 21 330 354 10.1038/s41581-024-00926-x 39814982 31. Thacher T.D. Fischer P.R. Pettifor J.M. Lawson J.O. Manaster B.J. Reading J.C. Radiographic scoring method for the assessment of the severity of nutritional rickets J. Trop. Pediatr. 2000 46 132 139 10.1093/tropej/46.3.132 10893912 32. Laurent M.R. De Schepper J. Trouet D. Godefroid N. Boros E. Heinrichs C. Bravenboer B. Velkeniers B. Lammens J. Harvengt P. Consensus Recommendations for the Diagnosis and Management of X-Linked Hypophosphatemia in Belgium Front. Endocrinol. 2021 12 641543 10.3389/fendo.2021.641543 PMC8018577 33815294 33. Beck-Nielsen S.S. Mughal Z. Haffner D. Nilsson O. Levtchenko E. Ariceta G. de Lucas Collantes C. Schnabel D. Jandhyala R. Mäkitie O. FGF23 and its role in X-linked hypophosphatemia-related morbidity Orphanet J. Rare Dis. 2019 14 58 10.1186/s13023-019-1014-8 30808384 PMC6390548 34. Haffner D. Emma F. Eastwood D.M. Biosse Duplan M. Bacchetta J. Schnabel D. Wicart P. Bockenhauer D. Santos F. Levtchenko E. Clinical practice recommendations for the diagnosis and management of X-linked hypophosphataemia Nat. Rev. Nephrol. 2019 15 435 455 10.1038/s41581-019-0152-5 31068690 PMC7136170 35. Kuhlmann M.K. Phosphate elimination in modalities of hemodialysis and peritoneal dialysis Blood Purif 2010 29 137 144 10.1159/000245640 20093819 36. Zhou X. He J. Zhu D. Yao Z. Peng D. Zhang X. Relationship between serum phosphate and mortality in critically ill children receiving continuous renal replacement therapy Front. Pediatr. 2023 11 1129156 10.3389/fped.2023.1129156 37124175 PMC10130528 37. Baeg S.I. Lee K. Jeon J. Jang H.R. Management for Electrolytes Disturbances during Continuous Renal Replacement Therapy Electrolytes Blood Press. 2022 20 64 75 10.5049/EBP.2022.20.2.64 36688209 PMC9827043 38. Heung M. Mueller B.A. Prevention of hypophosphatemia during continuous renal replacement therapy-An overlooked problem Semin. Dial. 2018 31 213 218 10.1111/sdi.12677 29405468 39. Cartwright C. Anastasopoulou C. Hungry Bone Syndrome StatPearls StatPearls Publishing LLC. Treasure Island, FL, USA 2025 31751070 40. Jain N. Reilly R.F. Hungry bone syndrome Curr. Opin. Nephrol. Hypertens. 2017 26 250 255 10.1097/MNH.0000000000000327 28375869 41. Khalatbari H. Cheeney S.H.E. Manning S.C. Parisi M.T. Pediatric hyperparathyroidism: Review and imaging update Pediatr. Radiol. 2021 51 1106 1120 10.1007/s00247-021-05050-7 33904951 42. Stokes V.J. Nielsen M.F. Hannan F.M. Thakker R.V. Hypercalcemic Disorders in Children J. Bone Miner. Res. 2017 32 2157 2170 10.1002/jbmr.3296 28914984 PMC5703166 43. Levine M.A. Diagnosis and Management of Vitamin D Dependent Rickets Front. Pediatr. 2020 8 315 10.3389/fped.2020.00315 32596195 PMC7303887 44. Carpenter T.O. Shaw N.J. Portale A.A. Ward L.M. Abrams S.A. Pettifor J.M. Rickets Nat. Rev. Dis. Primers 2017 3 17101 10.1038/nrdp.2017.101 29265106 45. Schlingmann K.P. Ruminska J. Kaufmann M. Dursun I. Patti M. Kranz B. Pronicka E. Ciara E. Akcay T. Bulus D. Autosomal-Recessive Mutations in SLC34A1 Encoding Sodium-Phosphate Cotransporter 2A Cause Idiopathic Infantile Hypercalcemia J. Am. Soc. Nephrol. 2016 27 604 614 10.1681/ASN.2014101025 26047794 PMC4731111 46. Janiec A. Halat-Wolska P. Obrycki Ł. Ciara E. Wójcik M. Płudowski P. Wierzbicka A. Kowalska E. Książyk J.B. Kułaga Z. Long-term outcome of the survivors of infantile hypercalcaemia with CYP24A1 and SLC34A1 mutations Nephrol. Dial. Transplant. 2021 36 1484 1492 10.1093/ndt/gfaa178 33099630 PMC8311581 47. Schinke T. Oheim R. Hereditary hypophosphatemic rickets with hypercalciuria (HHRH), a complex disorder in need of precision medicine Kidney Int. 2024 105 927 929 10.1016/j.kint.2024.02.006 38642991 48. Stürznickel J. Heider F. Delsmann A. Gödel M. Grünhagen J. Huber T.B. Kornak U. Amling M. Oheim R. Clinical Spectrum of Hereditary Hypophosphatemic Rickets With Hypercalciuria (HHRH) J. Bone Miner. Res. 2022 37 1580 1591 10.1002/jbmr.4630 35689455 49. Bergwitz C. Miyamoto K.I. Hereditary hypophosphatemic rickets with hypercalciuria: Pathophysiology, clinical presentation, diagnosis and therapy Pflug. Arch. 2019 471 149 163 10.1007/s00424-018-2184-2 30109410 50. Williams A.A. Pir Muhammad A.I. Ruchi R. Ali R. Managing Ifosfamide-Induced Arginine Vasopressin Resistance: Diagnostic and Treatment Strategies Cureus 2025 17 e81236 10.7759/cureus.81236 40291173 PMC12025348 51. Wu Y. Ma T. Yu X. Su T. Severe Hypophosphatemia as the Initial Presentation of Renal Fanconi’s Syndrome and Distal Renal Tubular Acidosis Related to Zoledronic Acid: A Case Report and Literature Review Kidney Blood Press. Res. 2023 48 18 27 10.1159/000527931 36412607 52. Portales-Castillo I. Mount D.B. Nigwekar S.U. Yu E.W. Rennke H.G. Gupta S. Zoledronic Acid-Associated Fanconi Syndrome in Patients With Cancer Am. J. Kidney Dis. 2022 80 555 559 10.1053/j.ajkd.2021.12.015 35219759 PMC9399306 53. Gutierrez J.O. Zurita M.F. Zurita L.A. Sjögren’s Syndrome Associated with Fanconi’s Syndrome and Osteomalacia Am. J. Case Rep. 2018 19 392 396 10.12659/AJCR.907503 29610453 PMC5900466 54. François H. Mariette X. Renal involvement in primary Sjögren syndrome Nat. Rev. Nephrol. 2016 12 82 93 10.1038/nrneph.2015.174 26568188 55. Shimada T. Mizutani S. Muto T. Yoneya T. Hino R. Takeda S. Takeuchi Y. Fujita T. Fukumoto S. Yamashita T. Cloning and characterization of FGF23 as a causative factor of tumor-induced osteomalacia Proc. Natl. Acad. Sci. USA 2001 98 6500 6505 10.1073/pnas.101545198 11344269 PMC33497 56. Bowe A.E. Finnegan R. Jan de Beur S.M. Cho J. Levine M.A. Kumar R. Schiavi S.C. FGF-23 inhibits renal tubular phosphate transport and is a PHEX substrate Biochem. Biophys. Res. Commun. 2001 284 977 981 10.1006/bbrc.2001.5084 11409890 57. Jadhav S.S. Shah R. Patil V. Tumor-induced osteomalacia: An overview Best Pract. Res. Clin. Endocrinol. Metab. 2024 38 101834 10.1016/j.beem.2023.101834 37935612 58. Minisola S. Fukumoto S. Xia W. Corsi A. Colangelo L. Scillitani A. Pepe J. Cipriani C. Thakker R.V. Tumor-induced Osteomalacia: A Comprehensive Review Endocr. Rev. 2023 44 323 353 10.1210/endrev/bnac026 36327295 59. Florenzano P. Hartley I.R. Jimenez M. Roszko K. Gafni R.I. Collins M.T. Tumor-Induced Osteomalacia Calcif. Tissue Int. 2021 108 128 142 10.1007/s00223-020-00691-6 32504138 60. Lim Y.H. Ovejero D. Derrick K.M. Collins M.T. Choate K.A. Cutaneous skeletal hypophosphatemia syndrome (CSHS) is a multilineage somatic mosaic RASopathy J. Am. Acad. Dermatol. 2016 75 420 427 10.1016/j.jaad.2015.11.012 27444071 PMC5004488 61. Ovejero D. Lim Y.H. Boyce A.M. Gafni R.I. McCarthy E. Nguyen T.A. Eichenfield L.F. DeKlotz C.M. Guthrie L.C. Tosi L.L. Cutaneous skeletal hypophosphatemia syndrome: Clinical spectrum, natural history, and treatment Osteoporos. Int. 2016 27 3615 3626 10.1007/s00198-016-3702-8 27497815 PMC6908308 62. Ferre-Sanfrancisco M. Del Bosque Granero I. Expósito M.V. Díaz M.V. Osteomalacia: A Challenging Diagnosis Adverse Event Associated with Intravenous Ferric Carboxymaltose-A Case Report Calcif. Tissue Int. 2024 116 1 10.1007/s00223-024-01328-8 39673627 63. Boots J.M.M. Quax R.A.M. High-Dose Intravenous Iron with Either Ferric Carboxymaltose or Ferric Derisomaltose: A Benefit-Risk Assessment Drug Saf. 2022 45 1019 1036 10.1007/s40264-022-01216-w 36068430 PMC9492608 64. Abu-Zaid A. Magzoub D. Aldehami M.A. Behiry A.A. Bhagavathula A.S. Hajji R. The Effect of Iron Supplementation on FGF23 in Chronic Kidney Disease Patients: A Systematic Review and Time-Response Meta-Analysis Biol. Trace Elem. Res. 2021 199 4516 4524 10.1007/s12011-021-02598-1 33462793 65. Ariceta G. Beck-Nielsen S.S. Boot A.M. Brandi M.L. Briot K. de Lucas Collantes C. Emma F. Giannini S. Haffner D. Keen R. The International X-Linked Hypophosphatemia (XLH) Registry: First interim analysis of baseline demographic, genetic and clinical data Orphanet J. Rare Dis. 2023 18 304 10.1186/s13023-023-02882-4 37752558 PMC10523658 66. Padidela R. Nilsson O. Makitie O. Beck-Nielsen S. Ariceta G. Schnabel D. Brandi M.L. Boot A. Levtchenko E. Smyth M. The international X-linked hypophosphataemia (XLH) registry ( NCT03193476 Orphanet J. Rare Dis. 2020 15 172 10.1186/s13023-020-01434-4 32605590 PMC7329472 67. Hoshino Y. Okamoto K. Ogawa T. Kato H. Irie K. Watanabe S. Kimura S. Hidaka N. Kinoshita Y. Kobayashi H. Acquired Osteomalacia Associated with Autoantibodies against PHEX New Engl. J. Med. 2025 392 513 515 10.1056/NEJMc2405746 39879599 PMC11781776 68. Insogna K.L. Briot K. Imel E.A. Kamenický P. Ruppe M.D. Portale A.A. Weber T. Pitukcheewanont P. Cheong H.I. Jan de Beur S. A Randomized, Double-Blind, Placebo-Controlled, Phase 3 Trial Evaluating the Efficacy of Burosumab, an Anti-FGF23 Antibody, in Adults With X-Linked Hypophosphatemia: Week 24 Primary Analysis J. Bone Miner. Res. 2018 33 1383 1393 10.1002/jbmr.3475 29947083 69. Carpenter T.O. Whyte M.P. Imel E.A. Boot A.M. Högler W. Linglart A. Padidela R. Van’t Hoff W. Mao M. Chen C.Y. Burosumab Therapy in Children with X-Linked Hypophosphatemia New Engl. J. Med. 2018 378 1987 1998 10.1056/NEJMoa1714641 29791829 70. Imel E.A. Glorieux F.H. Whyte M.P. Munns C.F. Ward L.M. Nilsson O. Simmons J.H. Padidela R. Namba N. Cheong H.I. Burosumab versus conventional therapy in children with X-linked hypophosphataemia: A randomised, active-controlled, open-label, phase 3 trial Lancet 2019 393 2416 2427 10.1016/S0140-6736(19)30654-3 31104833 PMC7179969 71. Crotti C. Zucchi F. Alfieri C. Caporali R. Varenna M. Long-term use of burosumab for the treatment of tumor-induced osteomalacia Osteoporos. Int. 2023 34 201 206 10.1007/s00198-022-06516-6 35925260 PMC9361946 72. Brener R. Zeitlin L. Lebenthal Y. Brener A. Dental health of pediatric patients with X-linked hypophosphatemia (XLH) after three years of burosumab therapy Front. Endocrinol. 2022 13 947814 10.3389/fendo.2022.947814 PMC9425915 36051396 73. Dodamani M.H. Kumar S.C. Bhattacharjee S. Barnabas R. Kumar S. Lila A.R. Memon S.S. Karlekar M. Patil V.A. Bandgar T.R. Efficacy and safety of burosumab compared with conventional therapy in patients with X-linked hypophosphatemia: A systematic review Arch. Endocrinol. Metab. 2024 68 e230242 10.20945/2359-4292-2023-0242 38788147 PMC11156178 74. Kiafzezi D. Stamati A. Karagiannis T. Goulis D.G. Christoforidis A. Burosumab Efficacy and Safety in Patients with X-Linked Hypophosphatemia: Systematic Review and Meta-analysis of Real-World Data Calcif. Tissue Int. 2024 115 229 241 10.1007/s00223-024-01250-z 39008126 75. Wang S. Wang X. He M. Li Y. Xiao M. Ma H. Efficacy and Safety of Burosumab in X-linked Hypophosphatemia J. Clin. Endocrinol. Metab. 2023 109 293 302 10.1210/clinem/dgad440 37497620 76. André J. Zhukouskaya V.V. Lambert A.S. Salles J.P. Mignot B. Bardet C. Chaussain C. Rothenbuhler A. Linglart A. Growth hormone treatment improves final height in children with X-linked hypophosphatemia Orphanet J. Rare Dis. 2022 17 444 10.1186/s13023-022-02590-5 36544157 PMC9768884 77. Meyerhoff N. Haffner D. Staude H. Wühl E. Marx M. Beetz R. Querfeld U. Holder M. Billing H. Rabl W. Effects of growth hormone treatment on adult height in severely short children with X-linked hypophosphatemic rickets Pediatr. Nephrol. 2018 33 447 456 10.1007/s00467-017-3820-3 29058153 78. Fuente R. Gil-Peña H. Claramunt-Taberner D. Hernández-Frías O. Fernández-Iglesias Á. Alonso-Durán L. Rodríguez-Rubio E. Hermida-Prado F. Anes-González G. Rubio-Aliaga I. MAPK inhibition and growth hormone: A promising therapy in XLH FASEB J. 2019 33 8349 8362 10.1096/fj.201802007R 30974062 79. Shin M.H. Kim J. Lim S.A. Kim J. Lee K.M. Current Insights into Combination Therapies with MAPK Inhibitors and Immune Checkpoint Blockade Int. J. Mol. Sci. 2020 21 2531 10.3390/ijms21072531 32260561 PMC7177307 80. Zhukouskaya V.V. Jauze L. Charles S. Leborgne C. Hilliquin S. Sadoine J. Slimani L. Baroukh B. van Wittenberghe L. Danièle N. A novel therapeutic strategy for skeletal disorders: Proof of concept of gene therapy for X-linked hypophosphatemia Sci. Adv. 2021 7 eabj5018 10.1126/sciadv.abj5018 34705504 PMC8550245 81. Bittmann S. Moschuring-Alieva E. Luchter E. Villalon G. Current and Future Therapeutical Aspects of X-Linked Hypophosphatemia in Children With Special Attention to Klotho/Fibroblast Growth Factor 23 System J. Clin. Med. Res. 2022 14 436 439 10.14740/jocmr4820 36406946 PMC9635803 82. Imel E.A. Liu Z. Coffman M. Acton D. Mehta R. Econs M.J. Oral Iron Replacement Normalizes Fibroblast Growth Factor 23 in Iron-Deficient Patients With Autosomal Dominant Hypophosphatemic Rickets J. Bone Miner. Res. 2020 35 231 238 10.1002/jbmr.3878 31652009 PMC7333537 Figure 1 Intestinal transport of phosphate; ( a b biomolecules-15-01321-t001_Table 1 Table 1 Phosphate-rich food. Product Phosphorus Content Per 100 g Wheat bran 950 mg Sesame 720 mg Parmesan 694 mg Gouda cheese 546 mg Cheddar cheese 545 mg Egg yolk of a hen 542 mg Soybeans (grain) 603 mg Turkey 200 mg Red caviar 490 mg Black caviar 465 mg Shrimp 225 mg Horseradish (root) 130 mg Garlic 100 mg Oxalis (green) 90 mg biomolecules-15-01321-t002_Table 2 Table 2 Factors influencing fibroblast growth factor-23 production according to [ 17 18 Positive Regulator Negative Regulator Increased serum phosphate Low serum phosphate Increased 1,25(OH) 2 Low serum calcium Parathyroid hormone (PTH) increases FGF23 secretion; however, it activates the cleavage of the intact molecule into C-terminal and N-terminal FGF23 peptides. Low 1,25(OH) 2 Deficiency of PHEX Loss-of-function variants in GALNT3 Deficiency of DMP1  Deficiency of FAM20C  O-glycosylation by GALNT3  Iron deficiency  biomolecules-15-01321-t003_Table 3 Table 3 The summary of the direct action of parathyroid hormone, calcitriol, and fibroblast growth factor-23 on phosphate metabolism. Site of Action Parathyroid Hormone Calcitriol Fibroblast Growth Factor 23 Intestine - Increases intestinal phosphate absorption by increasing expression of sodium-phosphate cotransporter (NaPi2b) - Kidney Increases urinary phosphate wasting by decreasing expression of sodium-phosphate cotransporters (NaPi2a and NaPi2c) - Increases urinary phosphate wasting by decreasing expression of sodium-phosphate cotransporters (NaPi2a and NaPi2c) Bone Increases bone resorption by stimulating osteoblasts to produce RANKL, which, in turn, binds to RANK and stimulates osteoclasts Increases bone resorption - biomolecules-15-01321-t004_Table 4 Table 4 Symptoms of hypophosphatemia. Muscles Nervous System Skeletal System Other Systems  Proximal myopathy Muscle weakness Myalgia Impaired respiratory muscle function Rhabdomyolysis  Paresthesia Muscle tremors Mental disorders Convulsions Coma  Youngest children: vitamin D-resistant rickets and short stature Older children and adults: pain and bone complications—osteomalacia and pathological fractures  Liver dysfunction Cardiac contractility and rhythm disorders Hemolysis Leukocyte dysfunction Thrombocyte dysfunction biomolecules-15-01321-t005_Table 5 Table 5 Diagnostic tests performed in hypophosphatemia according to [ 25 Blood  Total calcium, magnesium, phosphates Ionized calcium urea, creatinine, uric acid Acid-base balance Albumin alkaline phosphatase alanine and aspartate transaminases (ALT, AST) Bone fraction of alkaline phosphatase (when elevated ALT and AST) intact parathyroid hormone metabolites of vitamin D: 1,25(OH)2D, 25OHD intact fibroblast growth factor 23 Urine  Urine analysis potassium, sodium, calcium, phosphorus, magnesium, uric acid, creatinine amino acids Beta2-microglobulin, alpha1-microglobulin, or other low molecular weight proteins Indicators calculated  glomerular filtration rate (GFR) Calcium-creatinine ratio in urine Phosphate-creatinine ratio in urine Fractional phosphate excretion in urine Tubular reabsorption of phosphate (TRP) Tubular maximal phosphate reabsorption related to glomerular filtration rate (TmP/GFR) biomolecules-15-01321-t006_Table 6 Table 6 Age and sex-dependent normal values for serum phosphate according to various sources (modified) [ 26 27 Age (Years) Boys Girls Nelson Textbook of Pediatrics, 22nd Edition [ 28 Neonates 1.55–2.65 1.55–2.65 Infants and toddlers < 3 years 1.25–2.10 1.25–2.10 Children 4–11 years 1.20–1.80 1.20–1.80 Adolescents >12 years 0.90–1.80 0.90–1.80 The HARP cohort [ 26 0 years 1.58–2.24 1.65–2.25 1 year 1.46–2.08 1.52–2.10 3 years 1.29–1.87 1.34–1.88 7 years 1.25–1.89 1.24–1.81 10 years 1.22–1.90 1.17–1.78 12 years 1.19–1.90 1.10–1.72 15 years 1.04–1.75 0.92–1.51 18 years 0.73–1.39 0.79–1.36 The CALIPER cohort [ 27 0–14 days 1.80–3.40 1.80–3.40 15 days–<1 year 1.54–2.72 1.54–2.72 1 year–<5 years 1.38–2.19 1.38–2.19 5 years–<13 years 1.33–1.92 1.33–1.92 13 years–<16 years 1.14–1.99 1.02–1.79 16 years–<19 years 0.95–1.62 0.95–1.62 biomolecules-15-01321-t007_Table 7 Table 7 Causes of hypophosphatemia according to [ 25 30 32 Extrarenal Causes Renal Causes Intestinal Losses or Other Losses Intracellular Shift Intrinsic Renal Loss PTH-Dependent Renal Loss FGF23-Dependent Renal Loss Vitamin D deficiency Insulin Congenital Fanconi syndrome Primary hyperparathyroidism X-linked hypophosphatemia Diarrhea Refeeding syndrome Acquired Fanconi syndrome Vitamin-D-deficient rickets Autosomal dominant hypophosphatemic rickets Malnutrition Alkalosis Pathogenic variants in SCL34A1 SCL34A3 CLCN5 Vitamin-D-dependent rickets Autosomal recessive hypophosphatemic rickets 1–3 Phosphate binders, antacids Hungry bone syndrome  Jansen metaphyseal chondrodysplasia Tumor-induced osteomalacia     Ferric carboxymaltose infusion     Autoantibodies against PHEX protein biomolecules-15-01321-t008_Table 8 Table 8 Calcium-phosphorus metabolism in the case of non-renal (e.g., gastrointestinal) phosphate losses according to [ 30 33 34 Ca P ALP PTH 25OHD 1,25(OH) 2 iFGF23 U Ca U P TmP/GFR N/↑ ↓ ↑↑↑ N N N/↑ N Variable ↓ N Ca—serum calcium, P—serum phosphate, ALP—alkaline phosphatase, PTH—parathyroid hormone, 25OHD—25-hydroxyvitamin D, 1,25(OH) 2 Ca P biomolecules-15-01321-t009_Table 9 Table 9 Calcium-phosphorus metabolism in primary hyperparathyroidism according to [ 30 33 34 Ca P ALP PTH 25OHD 1,25(OH) 2 iFGF23 U Ca U P TmP/GFR  ↑  ↓  ↑  ↑  N  N/ ↑  N  ↑  ↑  ↓ Ca—serum calcium, P—serum phosphate, ALP—alkaline phosphatase, PTH—parathyroid hormone, 25OHD—25-hydroxyvitamin D, 1,25(OH) 2 Ca P ↓ ↑ biomolecules-15-01321-t010_Table 10 Table 10 Calcium-phosphorus metabolism in calcipenic rickets according to [ 30 33 34 Disease Ca P ALP PTH 25OHD iFGF23 1,25(OH) 2 U Ca U P TmP/GFR Vit. D deficiency N/↓ N/↓ ↑↑↑ ↑↑↑ ↓↓↓ N Variable ↓ Variable ↓ VDDR1A ↓ N/↓ ↑↑↑ ↑↑↑ N N/↓ ↓ ↓ Variable ↓ VDDR1B ↓ N/↓ ↑↑↑ ↑↑↑ ↓↓ N Variable ↓ Variable ↓ VDDR2A ↓ N/↓ ↑↑↑ ↑↑↑ N N/↓ ↑↑ ↓ Variable ↓ VDDR2B ↓ N/↓ ↑↑↑ ↑↑↑ N N ↑↑ ↓ Variable ↓ VDDR3 ↓ ↓ ↑↑↑ ↑↑↑ ↓ N ↓ ↓ Variable ↓ Ca—serum calcium, P—serum phosphate, ALP—alkaline phosphatase, PTH—parathyroid hormone, 25OHD—25-hydroxyvitamin D, 1,25(OH) 2 Ca P biomolecules-15-01321-t011_Table 11 Table 11 Vitamin D-dependent rickets according to [ 25 30 33 34 Disease and OMIM Number Gene Inheritance Estimated Prevalence According to OMIM and ORPHANET Mechanism VDDR1A, #264700  CYP27B1 AR 1–5/10,000 Disturbed 1,25(OH) 2 VDDR1B, #600081  CYP2R1 AR 1–5/10,000 Disturbed 25(OH)D synthesis VDDR2A, #277440  VDR AR Unknown Disturbed signal transduction from VDR VDDR2B, #600785  HNRNPC AR Unknown Disturbed signal transduction from VDR VDDR3, #619073  CYP3A4 AD Unknown Excessive breakdown of 1,25(OH) 2 biomolecules-15-01321-t012_Table 12 Table 12 Primary renal hypophosphatemia—PTH-independent and FGF23-independent causes according to [ 25 30 33 34 Disease and OMIM Number The Gene Responsible Estimated Prevalence According to OMIM and ORPHANET Characteristic Features Infantile hypercalcemia-2 (HCINF2; #616963) Fanconi renal-tubular syndrome 2 (FRTS; #613388)  SLC34A1 <1/1,000,000 Loss of sodium-phosphate cotransporter NaPi2a function in the proximal tubule, decreased FGF23 concentration, high 1,25(OH) 2 Hereditary hypophosphatemic rickets with hypercalciuria (HHHR); #241530  SLC34A3 1/250,000 Loss of sodium-phosphate cotransporter NaPi2c function in the proximal tubule, decreased FGF23 concentration, high 1,25(OH) 2 Proteinuria, low molecular weight, with hypercalciuric nephrocalcinosis (#308990)  CLCN5 1/400,000–1,000,000 Loss of CLCN5 Genetically determined Fanconi syndrome (e.g., cystinosis—#219800, #219900) CTNS 1–9/100,000 Extrarenal symptoms may occur, such as the accumulation of cystine in the eye. Acquired Fanconi syndrome - Unknown Heavy metal poisoning, a condition after treatment with, among others, ifosfamide, cisplatin, and aminoglycoside antibiotics biomolecules-15-01321-t013_Table 13 Table 13 Metabolic disturbances in patients with pathogenic variants in SLC34A1 SLC34A3 30 33 34 Ca P ALP PTH 25OHD 1,25(OH) 2 iFGF23 U Ca U P TmP/GFR  N  ↓/N  ↑  N/↑  N  ↑/N  N/ ↓  ↑/N  ↑  ↓ Ca—serum calcium, P—serum phosphate, ALP—alkaline phosphatase, PTH—parathyroid hormone, 25OHD—25-hydroxyvitamin D, 1,25(OH) 2 Ca P ↓ ↑ biomolecules-15-01321-t014_Table 14 Table 14 Causes of Fanconi syndrome according to [ 50 51 52 53 54 Inherited causes Cystinosis Acquired causes Acute tubular necrosis biomolecules-15-01321-t015_Table 15 Table 15 Metabolic disturbances in Fanconi syndrome according to [ 30 33 34 Ca P ALP PTH 25OHD 1,25(OH) 2 iFGF23 U Ca U P TmP/GFR  N/ ↓  ↓  ↑  N/↑  N  N/ ↓  N/ ↓  ↑  ↑  ↓ Ca—serum calcium, P—serum phosphate, ALP—alkaline phosphatase, PTH—parathyroid hormone, 25OHD—25-hydroxyvitamin D, 1,25(OH) 2 Ca P ↓ ↑ biomolecules-15-01321-t016_Table 16 Table 16 Hypophosphatemia secondary to excess FGF23 according to [ 25 30 33 34 The Disease The Gene Responsible Estimated Prevalence According to OMIM and ORPHANET Characteristic Features X-linked hypophosphatemic rickets (XLH)  PHEX 1–9/100,000 Beginning in childhood, periapical lesions, rickets, enthesopathies, hearing loss, and often hypocalciuria Autosomal dominant hypophosphatemic rickets (ADHR)  FGF23 <1/1,000,000 Onset at various ages may be accompanied by periods of exacerbation and remission. Autosomal recessive hypophosphatemic rickets, autosomal recessive hypophosphatemia  DMP1, ENPP1 1/64,000–1/250,000 ARHR1—phenotype similar to HXL, ENPP1—may manifest as generalized arterial calcification in infancy Raine syndrome  FAM20C <1/1,000,000 Often lethal in the perinatal period, osteosclerosis Tumor-induced osteomalacia (TIO) In 60% of cases, the FN1-FGFR1 FN1-FGF1 0.1–0.7/100,000 Different ages of onset, bone pain, pseudo-fractures, weakness, and tumors may be small and difficult to locate McCune-Albright syndrome  GNAS1 1/100,000–1/1,000,000 Aminoaciduria, proteinuria, fibrous dysplasia, café au lait spots, premature puberty Cutaneous skeletal hypophosphatemia syndrome (CSHS) RAS Unknown, less than 100 cases reported Skin marks, neurological defects intravenous iron supply n/a n/a Intravenous iron induces an increase in FGF23, pseudofractures Autoantibodies against PHEX protein n/a 5 cases reported Described in Japanese adults, phenotype similar to TIO, other autoimmune diseases may be present biomolecules-15-01321-t017_Table 17 Table 17 Calcium-phosphorus metabolism in X-linked hypophosphatemia according to [ 30 33 34 Ca P ALP PTH 25OHD 1,25(OH) 2 iFGF23 U Ca U P TmP/GFR  N  ↓  ↑  N/↑  N  N/ ↓  ↑/ N  ↓  ↑  ↓ Ca—serum calcium, P—serum phosphate, ALP—alkaline phosphatase, PTH—parathyroid hormone, 25OHD—25-hydroxyvitamin D, 1,25(OH) 2 Ca P ↓ ↑ biomolecules-15-01321-t018_Table 18 Table 18 Examples of causal treatment of hypophosphatemia in children. Disease Treatment Modality Malabsorption due to celiac disease Gluten-free diet Malabsorption due to Giardiasis Tinidazol, metronidazole Malabsorption due to Whipple’s disease Long-term antibiotic therapy—penicillin/ceftriaxone followed by trimethoprim/sulphamethoxazole Hypophosphatemia due to removal in renal replacement therapy Modification of dialysis protocol Fanconi syndrome due to cystinosis Cysteamine Fanconi syndrome due to Sjögren disease Immunosuppressive treatment Parathyroid hormone-producing adenoma Parathyroidectomy Tumor-induced osteomalacia Surgical treatment/burosumab X-linked hypophosphatemia Burosumab ",
  "metadata": {
    "Title of this paper": "Oral Iron Replacement Normalizes Fibroblast Growth Factor 23 in Iron-Deficient Patients With Autosomal Dominant Hypophosphatemic Rickets",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467876/"
  }
}