{
  "title": "Paper_206",
  "abstract": "pmc ACG Case Rep J ACG Case Rep J 2725 acgcasereps AC9 ACG Case Reports Journal 2326-3253 American College of Gastroenterology PMC12487910 PMC12487910.1 12487910 12487910 41041158 10.14309/crj.0000000000001841 ACGCR-25-0602 1 3 Case Report Stomach Gastric Mixed Adenoma Well-Differentiated Neuroendocrine Tumor or Mixed Neuroendocrine–Non-neuroendocrine Neoplasm: A Case of Classification Dilemma https://orcid.org/0009-0006-4576-1745 Rao Sameer MBBS 1 Medina-Morales Esli MD 1 jm2831@njms.rutgers.edu Sutariya Riya BS 2 rs1682@njms.rutgers.edu Shah Vraj MD 1 vs528@njms.rutgers.edu Goyal Ritik Mahaveer MD 1 rg1229@njms.rutgers.edu Purizaga Vivian MD vivipuri1@gmail.com 3 Medina-Morales Bryan MD sr2193@njms.rutgers.edu 3 Kapsoli Maria MD mkapsoli@gmail.com 4 Benites-Goñi Harold MD 3 5 hbenites@usil.edu.pe 1 2 3 Peru 4 Peru 5 Peru Correspondence: sameer07rao@gmail.com 10 2025 01 10 2025 12 10 497816 e01841 15 6 2025 19 8 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). Published by Wolters Kluwer Health, Inc. on behalf of The American College of Gastroenterology. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the Creative Commons Attribution License 4.0 (CCBY) ABSTRACT Mixed neuroendocrine–non-neuroendocrine neoplasms (MiNENs) and mixed adenoma with well-differentiated neuroendocrine tumors (MANETs) are rare neoplasms composed of neuroendocrine (NE) and non-NE components. Accurate classification is essential, as MiNENs are typically aggressive, whereas MANETs typically follow an indolent course. We present a case of a gastric mixed tumor in a 69-year-old woman, comprising tubular adenoma, adenocarcinoma in situ, and a low-grade NE tumor. Although the tumor did not meet the current WHO criteria for MiNEN, it demonstrated unusually aggressive behavior including rapid progression and lymph node metastasis, atypical for a MANET. This highlights the need to refine current diagnostic classifications to better treat such mixed tumors, as MANETs are typically managed with polypectomy, whereas MiNENs may require extensive endoscopic or surgical intervention. KEYWORDS: mixed neuroendocrine–non-neuroendocrine neoplasms mixed adenoma with well-differentiated neuroendocrine tumors gastric mixed tumor pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE INTRODUCTION Mixed neuroendocrine–non-neuroendocrine neoplasms (MiNENs) are tumors composed of both neuroendocrine (NE) and non-NE components, each constituting more than 30% of the tumor volume. The NE component can be a neuroendocrine tumor (NET) or a neuroendocrine carcinoma. The non-NE component may include adenocarcinomas or other carcinomas (eg, squamous cell, acinar cell, hepatocellular), as well as benign tumors (eg, adenoma, papilloma) (Figure 1 1 2 3 4 6 Figure 1. Different possible neuroendocrine (NE) and non-NE components of MiNEN based on the latest guidelines. GI, gastrointestinal; MiNENs, mixed neuroendocrine–non-neuroendocrine neoplasms. MiNENs and MANETs are rare tumors, particularly gastric MANETs, which have thus far been reported only in case reports or small case series. 4 CASE REPORT A 69-year-old woman presented to Rebagliati Hospital in Lima, Peru, approximately 5 months after undergoing an endoscopy at an outside facility, which revealed 2 gastric lesions, with a biopsy of the larger lesion showing tubular adenoma with low-grade dysplasia. The patient reported a year-long history of bloating and diarrhea at the time of evaluation at our facility. An esophagogastroduodenoscopy performed at our center identified an 11-mm pale lesion with an elevated center and a subepithelial appearance on the anterior wall of the upper body of the stomach (Figure 2 3 Figure 2. Endoscopic images of the lesion on the anterior wall of the upper body of the stomach: (A) Subepithelial lesion with an elevated center and aberrant thin vessels on the surface, (B) virtual chromoendoscopy with magnification showing no identifiable surface pattern, and (C) elevated area of the lesion highlighted using conventional chromoendoscopy with 0.3% indigo carmine. Figure 3. Histological images of perigastric lymph node showing involvement by a well-differentiated neuroendocrine tumor at 10× magnification. After a multidisciplinary meeting, a decision was made to perform a laparoscopic gastrectomy with D2 lymphadenectomy. Gross examination of the resected specimen revealed a 15 × 15-mm polypoid lesion on the lesser curvature. Histological analysis confirmed a mixed tumor comprising both NE and non-NE components, with 40% tubular adenoma exhibiting high-grade dysplasia, 10% gastric adenocarcinoma in situ, and 50% NET (Figure 4 4 Figure 4. Histological examination of the polypoid lesion postgastrectomy: (A) low-magnification view (4×) showing gastric mucosa infiltrated by mixed tumor, comprising moderately differentiated tubular adenocarcinoma (upper section) and well-differentiated grade 1 neuroendocrine tumor (lower section), (B) high-magnification view (10×) displaying adenocarcinoma glands with a cribriform-like infiltration pattern (left) alongside a well-differentiated grade 1 neuroendocrine tumor (right), and (C) chromogranin immunostaining demonstrating positivity in the neuroendocrine tumor at 10× magnification. The patient experienced no postoperative complications, tolerated oral nutrition well, and was discharged 7 days after surgery. The patient did not receive chemotherapy or radiotherapy after resection and has remained in remission during 1 year of follow-up. DISCUSSION MiNENs are aggressive tumors with poor prognosis and a high recurrence rate, whereas MANENs are generally considered indolent with a more favorable outcome. 4 5 7 3 6 Diagnostic challenges are inherent in both MiNENs and MANETs, primarily because of the need to identify both NE and non-NE components, which are often missed in endoscopic biopsies. This was also observed in our case, where the endoscopic biopsies only identified the non-NE component. A study demonstrated that presurgical biopsies detect MiNEN in only one-third of the cases, with the remaining often suggesting a pure counterpart. 7 2 8 9 6 Recent studies have questioned the credibility of arbitrarily using 30% tumor volume for NE component as a threshold to establish the diagnosis of MiNEN. 10 11 12 13 MANENs are typically managed like pure adenomas, with polypectomy as the standard therapeutic approach. 4 5 14 15 In our case, lymph node metastasis and rapid progression occurred despite a low Ki-67 index (<3%), highlighting a potential mismatch between histologic grade and biological aggressiveness. When such divergence is observed, clinicians may consider closer surveillance protocols, including serial endoscopy and imaging, as well as more aggressive surgical interventions, rather than limited local excision, for MANETs. In summary, our case report highlights the heterogeneous nature of mixed neoplasms containing both NE and non-NE components. There is a critical need for multicenter prospective studies including molecular profiling to consider refining the nomenclature, address gaps in the literature on these mixed tumors, and establish standardized management strategies to improve patient outcomes. DISCLOSURES Author contributions: S. Rao, E. Medina-Morales, R. Sutariya, V. Shah, B. Medina-Morales, and H. Benites-Goñi reviewed the literature and wrote the manuscript. RM Goyal, M. Kapsoli, and V. Purizaga reviewed the literature, evaluated, and provided the pathology slides and endoscopic imaging. B. Medina-Morales, M. Kapsoli, and H. Benites-Goñi participated in patient care. Rao, E. Medina-Morales, and H Benites-Goñi reviewed and edited the manuscript. H. Benitez-Goñi is the article guarantor. All authors approved the manuscript. Financial disclosure: None to report. Informed consent was obtained for this case report. ABBREVIATIONS: CD cluster of differentiation CDX caudal-type homeobox CK cytokeratin MANET mixed adenoma with well-differentiated neuroendocrine tumor MiNEN mixed neuroendocrine-non-neuroendocrine neoplasm NE neuroendocrine NEC neuroendocrine carcinoma NET neuroendocrine tumor WHO world health organization REFERENCES 1. de Mestier L Cros J Neuzillet C Digestive system mixed neuroendocrine-non-neuroendocrine neoplasms Neuroendocrinology. 2017 105 4 412 25 28803232 10.1159/000475527 2. La Rosa S Sessa F Uccella S Mixed neuroendocrine-nonneuroendocrine neoplasms (MiNENs): Unifying the concept of a heterogeneous group of neoplasms Endocr Pathol. 2016 27 4 284 311 27169712 10.1007/s12022-016-9432-9 3. Nagtegaal ID Odze RD Klimstra D The 2019 WHO classification of tumours of the digestive system Histopathology. 2020 76 2 182 8 31433515 10.1111/his.13975 PMC7003895 4. La Rosa S Uccella S Molinari F Mixed adenoma well-differentiated neuroendocrine tumor (MANET) of the digestive system: An indolent subtype of mixed neuroendocrine-nonneuroendocrine neoplasm (MiNEN) Am J Surg Pathol. 2018 42 11 1503 12 30001239 10.1097/PAS.0000000000001123 5. Rokutan H Fukasawa-Hokazono M Hokazono Y Ushiku T Mixed adenoma-neuroendocrine tumor of the stomach: Analysis of nine cases with literature review Virchows Arch. 2025 486 3 521 30 38922356 10.1007/s00428-024-03851-3 PMC11950016 6. Toor D Loree JM Gao ZH Wang G Zhou C Mixed neuroendocrine-non-neuroendocrine neoplasms of the digestive system: A mini-review World J Gastroenterol. 2022 28 19 2076 87 35664032 10.3748/wjg.v28.i19.2076 PMC9134131 7. Frizziero M Chakrabarty B Nagy B Mixed neuroendocrine non-neuroendocrine neoplasms: A systematic review of a controversial and underestimated diagnosis J Clin Med. 2020 9 1 273 31963850 10.3390/jcm9010273 PMC7019410 8. Uccella S La Rosa S Volante M Papotti M Immunohistochemical biomarkers of gastrointestinal, pancreatic, pulmonary, and thymic neuroendocrine neoplasms Endocr Pathol. 2018 29 2 150 68 29520563 10.1007/s12022-018-9522-y 9. Ramos MFKP Pereira MA Arabi AYM Gastric mixed neuroendocrine non-neuroendocrine neoplasms: A Western Center Case Series Med Sci (Basel). 2021 9 3 47 34201925 10.3390/medsci9030047 PMC8293352 10. Park JY Ryu MH Park YS Prognostic significance of neuroendocrine components in gastric carcinomas Eur J Cancer. 2014 50 16 2802 9 25201164 10.1016/j.ejca.2014.08.004 11. La Rosa S Challenges in high-grade neuroendocrine neoplasms and mixed neuroendocrine/non-neuroendocrine neoplasms Endocr Pathol. 2021 32 2 245 57 33786701 10.1007/s12022-021-09676-z PMC8116295 12. Lin J Zhao Y Zhou Y Comparison of survival and patterns of recurrence in gastric neuroendocrine carcinoma, mixed adenoneuroendocrine carcinoma, and adenocarcinoma JAMA Netw Open. 2021 4 7 e2114180 34313744 10.1001/jamanetworkopen.2021.14180 PMC8317013 13. Classification of neuroendocrine neoplasms: Lights and shadows–PubMed https://pubmed.ncbi.nlm.nih.gov/33169199/ 10.1007/s11154-020-09612-2 PMC8346451 33169199 14. Jacob A Raj R Allison DB Soares HP Chauhan A An update on the management of mixed neuroendocrine-non-neuroendocrine neoplasms (MiNEN) Curr Treat Options Oncol. 2022 23 5 721 35 35347561 10.1007/s11864-022-00968-y 15. Japanese Gastric Cancer Association Japanese gastric cancer treatment guidelines 2018 (5th edition) Gastric Cancer. 2021 24 1 1 21 32060757 10.1007/s10120-020-01042-y PMC7790804 ",
  "metadata": {
    "Title of this paper": "Japanese gastric cancer treatment guidelines 2018 (5th edition)",
    "Journal it was published in:": "ACG Case Reports Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487910/"
  }
}