{
  "title": "Paper_877",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471994 PMC12471994.1 12471994 12471994 41010933 10.3390/medicina61091542 medicina-61-01542 1 Review The Journey of Sentinel Lymph Node Biopsy in Cutaneous Melanoma: A Brief Narrative Review from Scalpel to Smart Tech Andrei Rǎzvan Ioan 1 2 Voinea Silviu Cristian 1 2 * https://orcid.org/0000-0003-1325-2031 Bordea Cristian Ioan 1 2 Nodiți Aniela Roxana 1 2 Peleașă Teodora Mihaela 3 Blidaru Alexandru 1 2 Slominski Andrzej Academic Editor 1 ioan-razvan.andrei@umfcd.ro 2 3 * dr.voinea_silviu@yahoo.com 27 8 2025 9 2025 61 9 497654 1542 23 7 2025 25 8 2025 26 8 2025 27 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Sentinel lymph node biopsy (SLNB) has transformed the management of cutaneous melanoma, emerging as a cornerstone in evaluating regional lymphatic spread while minimizing surgical morbidity. From its theoretical foundation laid by Cabanas to its refinement and clinical validation through landmark trials, SLNB has evolved into a standard of care with significant prognostic value. This review traces the historical trajectory of SLNB, analyzes current guidelines and controversies and explores future directions. Novel imaging technologies, such as indocyanine green fluorescence and augmented reality-assisted mapping, promise to enhance accuracy and reduce invasiveness. Furthermore, the advent of effective systemic therapies and neoadjuvant protocols is reshaping the therapeutic landscape, potentially redefining the role of SLNB in melanoma management. As precision medicine advances, SLNB remains an essential procedure, with its utility continually redefined by technological innovation and evolving oncologic strategies. cutaneous melanoma sentinel lymph node biopsy augmented reality This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The development of sentinel lymph node biopsy (SLNB) marked a significant shift by allowing surgeons to detect microscopic metastatic disease with minimal invasiveness, greatly reducing patient morbidity compared to traditional elective lymph node dissections (ELND) [ 1 Since its initial conceptualization and subsequent refinement, SLNB has evolved into the standard procedure for assessing regional nodal status in melanoma patients [ 2 3 Beyond its prognostic significance, SLNB is continually evolving in response to technological advances and emerging clinical needs. Innovations such as fluorescence-guided mapping with indocyanine green (ICG), dual-tracer techniques and the exploration of augmented reality (AR) for surgical navigation are refining accuracy and reducing invasiveness [ 4 5 6 7 8 This paper aims to provide a short overview of the historical development of SLNB, the current evidence-based standards and exciting future perspectives. As we enter an age of precision medicine, where artificial intelligence (AI) continues to expand the diagnostic landscape, SLNB remains a cornerstone of melanoma management—yet its application, value, and methodology are being actively redefined. Understanding this dynamic evolution is essential for optimizing outcomes and ensuring that patient care remains at the forefront of oncologic innovation. 2. Materials and Methods To compile a comprehensive and representative overview of the evolution of SLNB from its inception to emerging smart technologies, we performed a structured literature search in major biomedical databases, namely PubMed, Scopus, Web of Science, and Medline. The search strategy combined the keywords “sentinel lymph node biopsy”, “SLNB”, “melanoma”, “cutaneous melanoma”, “indocyanine green”, “ICG”, “blue dye”, “radioactive tracer”, “Tc99m”, “augmented reality”, “artificial intelligence”, and “liquid biopsy” in various combinations, using Boolean operators to ensure inclusion of the widest possible range of relevant studies. Inclusion criteria comprised articles in English published between April 1992 and June 2025, reflecting both the historical milestones of SLNB and advances in diagnostic and intraoperative technologies. Articles were considered eligible if the search terms appeared in the title or abstract and if they focused primarily on SLNB in the context of cutaneous melanoma, with secondary inclusion of studies describing technical adaptations in other malignancies. We excluded conference abstracts without full-text availability, publications in languages other than English, and studies unrelated to surgical or technological aspects of SLNB. Older landmark studies predating 1992 were included selectively if they represented pivotal steps in the conceptual development of SLNB (e.g., Snow 1892, Cabanas 1977, [ 9 10 The synthesis followed a narrative review format, structured chronologically and thematically to reflect the “scalpel to smart tech” journey. References were managed using EndNote X9, and duplicate entries were removed prior to final analysis. 3. Content 3.1. A Historical Overview of Sentinel Lymph Node Biopsy The importance of regional lymph node status and their surgical treatment in melanoma dates back to more than a century. Herbert Snow, a surgeon practicing in London in the late 19th century, meticulously documented several melanoma cases [ 9 9 11 9 12 13 12 14 The major trials addressing this issue, before the 2000s, revealed no substantial survival differences among immediate and delayed lymphadenectomy, just a slight survival advantage in the ELND group for early-stage with good prognostic factors like non-ulcerated, thinner tumors and extremity melanomas [ 15 16 17 18 Figure 1 10 10 The concept was extended and refined in 1992 by Donald L. Morton and his team from the University of California [ 19 19 19 19 19 20 The Multicenter Selective Lymphadenectomy Trial (MSLT-I) was a major international prospective randomized study involving multiple centers. Participants were randomized into two groups: one receiving SLNB and completion lymph node dissection (CLND) if metastases were found in the sentinel node and the other with nodal observation and delayed CLND. MSLT-I demonstrated that sentinel lymph node status significantly predicted patient outcomes [ 21 22 Initially, SLNB guided decisions primarily around performing CLND. However, accumulating experience revealed that most of these patients had no additional nodal disease, raising doubts about the necessity of routine CLND due to its considerable morbidity—particularly in groin dissections, where complications reached 51%, and lymphedema rates were around 32% compared to significantly lower rates with SLNB alone [ 14 23 24 25 26 23 Table 1 SLNB has evolved significantly since its introduction, establishing itself as a standard procedure. Traditionally, SLNB was recommended for patients with intermediate-thickness melanomas, specifically those with a Breslow index between 1.0 mm and 4.0 mm. This recommendation was based on studies indicating an unacceptable higher likelihood of regional lymph node metastasis at a Breslow index higher than 4.0 mm [ 27 28 28 3.2. Current Standards According to current clinical guidelines, SLNB is recommended in patients with cutaneous melanoma and a Breslow index greater than 0.8 mm, in the context of clinically and radiologically negative regional lymph nodes (N0) and no evidence of distant metastasis (M0) [ 29 29 30 31 Broad consensus supports the recommendation of SLNB for patients whose estimated risk of nodal metastasis exceeds 10%, whereas those with less than a 5% risk typically do not require the procedure. Patients with an intermediate risk (5–10%) are best managed through shared decision-making processes [ 32 33 34 35 Patients with previous local excisions pose unique challenges due to disrupted lymphatic drainage, which can lower the accuracy of SLNB, so current recommendations are that diagnosis should be based on a full thickness complete excision with a minimal margin of clinically uninvolved skin, to permit accurate subsequent lymphatic mapping [ 36 37 29 3.3. Standardization Challenges: Variability in SLNB Protocols Blue dye is not universally used for sentinel lymph node biopsy due to several limitations and regional considerations. One major factor is the risk of allergic reactions, including rare cases of severe anaphylaxis, which has led some health systems to restrict or avoid its use altogether [ 38 Dual-tracer techniques combining radioactive tracer with blue dyes enhance accuracy and reduce false-negative rates [ 39 The use of ICG fluorescent dye as an alternative to traditional radiotracer methods for SLNB in cutaneous melanoma patients was evaluated and the findings suggest that ICG fluorescence imaging is a reliable and potentially more cost-effective alternative [ 40 However, even if ICG-guided SLNB is comparable to blue dye in terms of detection rate and SLN positivity, it can not be used alone to identify all positive SLNBs [ 41 Unfortunately standardization is hampered by difference in regulatory approval, substance availability and surgeons preferences in regarding to dose, injection site and timing. 3.4. Future Horizons The recent approval of systemic adjuvant therapies for Stage IIB and IIC melanoma has put into question the continuing role of SLNB in these high-risk, node-negative patients. Despite systemic treatment availability, SLNB provides crucial prognostic information, significantly affecting melanoma-specific survival predictions and subsequently guiding adjuvant treatment decisions. For now, SLNB continues to hold significant clinical value even in the evolving landscape of systemic therapies [ 25 42 43 The future of SLNB may follow two potential trajectories: the evolution and transformation of the technique or even its omission. However, these paths are not mutually exclusive. Instead, they appear to converge in specific clinical contexts. Looking ahead, the incorporation of neoadjuvant therapies such as checkpoint inhibitors may significantly alter the surgical approach to melanoma management. Early results from trials like PRADO suggest the potential for a more personalized, less invasive surgical strategy following neoadjuvant treatment [ 42 43 44 45 Melanin pigmentation, beyond being a marker of melanocytic origin, directly influences melanoma biology by shaping tumor metabolism, oxidative balance, immune interactions and can attenuate the effects of radio-, chemo-, and immunotherapy, making melanogenesis not only a diagnostic feature but also a therapeutic challenge in melanoma management [ 46 47 In 2023, Peter A. von Niederhäusern from the Department of Biomedical Engineering, the University of Basel, demonstrated a proof of concept for an AR approach for SLNB for oral and oropharyngeal squamous cell carcinoma which showed promising results [ 48 49 Recent advances in AI have shown great promise in transforming pathology by enhancing diagnostic accuracy, reproducibility, and prognostic predictions. Despite current challenges in clinical integration—such as interpretability, validation, and standardization—the synergy between AI and human expertise, particularly through multimodal approaches, is expected to play a pivotal role in achieving truly personalized cancer care. As these technologies mature and gain broader validation by multicenter trials, they will become the cornerstone of precision oncology [ 50 51 The omission of SLNB in the future could be due to advances in high-resolution imaging that could become sensitive enough to reliably detect micrometastases and most probably liquid biopsies for detecting molecular markers, which holds significant promise for the management of metastatic melanoma by enabling real-time, minimally invasive monitoring of treatment response, relapse, and disease progression [ 52 52 53 4. Conclusions Sentinel lymph node biopsy has unquestionably modified the clinical landscape of melanoma care, providing a minimally invasive yet highly precise method for nodal staging. Its journey, from a theoretical framework to an indispensable clinical tool, underscores the importance of innovation, evidence-based validation, and multidisciplinary collaboration in advancing surgical oncology. Yet, despite its current indispensability, SLNB is at a crossroads. On one hand, technological advancements such as ICG fluorescence imaging, augmented reality, and AI-powered navigation systems promise to further enhance its accuracy and safety. On the other, the rapid evolution of systemic therapies and molecular diagnostics may ultimately reduce the reliance on surgical nodal evaluation. High-resolution imaging and tumor-specific biomarkers offer the possibility of real-time disease monitoring and individualized therapeutic strategies that could eventually replace surgical staging. The future of SLNB lies not only in its refinement but also in its potential reinvention. As we stand at the threshold of a new era in oncology, the trajectory of SLNB exemplifies the broader shift toward data-driven, minimally invasive and patient-centered cancer care. Ultimately, the future of SLNB in melanoma lies in further refining patient selection criteria, integrating advanced prediction tools, expanding understanding of its therapeutic potential and exploring innovative treatment options that balance optimal oncologic outcomes with minimal patient morbidity. Acknowledgments Publication of this paper was supported by the University of Medicine and Pharmacy Carol Davila, through the institutional program Publish not Perish. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, R.I.A. and A.B.; methodology, S.C.V.; software, R.I.A.; validation, R.I.A., S.C.V. and A.B.; formal analysis, T.M.P.; investigation, A.R.N.; resources, A.R.N.; data curation, T.M.P.; writing—original draft preparation, R.I.A.; writing—review and editing, R.I.A.; visualization, C.I.B.; supervision, C.I.B.; project administration, A.B.; funding, S.C.V. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: SLNB Sentinel lymph node biopsy ELND Elective lymph node dissection ICG Indocyanine green AR Augmented reality AI Artificial intelligence MSLT-I Multicenter Selective Lymphadenectomy Trial I CLND Completion lymph node dissection MSLT-II Multicenter Selective Lymphadenectomy Trial II DeCOG-SLT German Dermatologic Cooperative Oncology Group’s Sentinel Lymph Node Trial WLE Wide local excision References 1. Masoud S.J. Perone J.A. Farrow N.E. Mosca P.J. Tyler D.S. Beasley G.M. Sentinel Lymph Node Biopsy and Completion Lymph Node Dissection for Melanoma Curr. Treat. Options Oncol. 2018 19 55 10.1007/s11864-018-0575-4 30232648 PMC6684152 2. Cheng T.W. Hartsough E. Giubellino A. Sentinel lymph node assessment in melanoma: Current state and future directions Histopathology 2023 83 669 684 10.1111/his.15011 37526026 3. Cochran A.J. Wen D.-R. Huang R.-R. Abrishami P. Smart C. Binder S. Scolyer R.A. Thompson J.F. Stern S. Van Kreuningen L. Sentinel lymph node melanoma metastases: Assessment of tumor burden for clinical prediction of outcome in the first Multicenter Selective Lymphadenectomy Trial (MSLT-I) Eur. J. Surg. Oncol. 2022 48 1280 1287 10.1016/j.ejso.2022.01.021 35246348 4. Wölffer M. Liechti R. Constantinescu M. Lese I. Zubler C. Sentinel Lymph Node Detection in Cutaneous Melanoma Using Indocyanine Green-Based Near-Infrared Fluorescence Imaging: A Systematic Review and Meta-Analysis Cancers 2024 16 2523 10.3390/cancers16142523 39061163 PMC11274776 5. Szymaniak M. Janecka J.A. Grabek W. Radomski J. Flisiewicz-Wysocka K. Mizera K. Wichtowski M. The actual approach of sentinel node biopsy in cutaneous melanoma Nowotw. J. Oncol. 2025 75 173 180 6. KleinJan G.H. Karakullukçu B. Klop W.M.C. Engelen T. Berg N.S.v.D. van Leeuwen F.W.B. Introducing navigation during melanoma-related sentinel lymph node procedures in the head-and-neck region EJNMMI Res. 2017 7 65 10.1186/s13550-017-0312-1 28819936 PMC5560283 7. Lao C.D. Khushalani N.I. Angeles C. Petrella T.M. Current State of Adjuvant Therapy for Melanoma: Less Is More, or More Is Better? Am. Soc. Clin. Oncol. Educ. Book 2022 42 738 744 10.1200/EDBK_351153 35658502 8. Zhang X. Ferris L. Faries M.B. Luke J.J. Debating Sentinel Lymph Node Biopsy for Melanoma in the Modern Adjuvant Era J. Clin. Oncol. 2023 41 4204 4207 10.1200/JCO.23.00255 37410978 PMC10852382 9. Snow H. Melanotic cancerous disease Lancet 1892 2 1892 2874 10. Cabanas R.M. An approach for the treatment of penile carcinoma Cancer 1977 39 456 466 10.1002/1097-0142(197702)39:2&#x0003c;456::AID-CNCR2820390214&#x0003e;3.0.CO;2-I 837331 11. Neuhaus S.J. Clark M.A. Thomas J.M. Dr. Herbert Lumley Snow, MD, MRCS (1847–1930): The original champion of elective lymph node dissection in melanoma Ann. Surg. Oncol. Off. J. Soc. Surg. Oncol. 2004 11 875 878 10.1245/ASO.2004.02.031 15342349 12. Neuwirth M.G. Bartlett E.K. Karakousis G.C. Lymph node dissection for melanoma: Where do we stand? Melanoma Manag. 2017 4 49 59 10.2217/mmt-2016-0023 30190904 PMC6094624 13. Bartlett E.K. Current management of regional lymph nodes in patients with melanoma J. Surg. Oncol. 2019 119 200 207 10.1002/jso.25316 30481384 PMC7485600 14. Faries M.B. Thompson J.F. Cochran A. Elashoff R. Glass E.C. Mozzillo N. Nieweg O.E. Roses D.F. Hoekstra H.J. Karakousis C.P. The impact on morbidity and length of stay of early versus delayed complete lymphadenectomy in melanoma: Results of the Multicenter Selective Lymphadenectomy Trial (I) Ann. Surg. Oncol. 2010 17 3324 3329 10.1245/s10434-010-1203-0 20614193 PMC2970739 15. Sim F.H. Taylor W.F. Ivins J.C. Pritchard D.J. Soule E.H. A prospective randomized study of the efficacy of routine elective lymphadenectomy in management of malignant melanoma.Preliminary results Cancer 1978 41 948 956 10.1002/1097-0142(197803)41:3&#x0003c;948::AID-CNCR2820410324&#x0003e;3.0.CO;2-Z 638981 16. Sim F.H. Taylor W.F. Pritchard D.J. Soule E.H. Lymphadenectomy in the Management of Stage I Malignant Melanoma: A Prospective Randomized Study Mayo Clin. Proc. 1986 61 697 705 10.1016/S0025-6196(12)62768-2 3747613 17. Veronesi U. Adamus J. Bandiera D.C. Brennhovd I.O. Caceres E. Cascinelli N. Claudio F. Ikonopisov R.L. Javorski V.V. Kirov S. Delayed regional lymph node dissection in stage I melanoma of the skin of the lower extremities Cancer 1982 49 2420 2430 10.1002/1097-0142(19820601)49:11&#x0003c;2420::AID-CNCR2820491133&#x0003e;3.0.CO;2-2 7074555 18. Cascinelli N. Morabito A. Santinami M. MacKie R. Belli F. Immediate or delayed dissection of regional nodes in patients with melanoma of the trunk: A randomised trial Lancet 1998 351 793 796 10.1016/S0140-6736(97)08260-3 9519951 19. Morton D.L. Wen D.-R. Wong J.H. Economou J.S. Cagle L.A. Storm F.K. Foshag L.J. Cochran A.J. Technical details of intraoperative lymphatic mapping for early stage melanoma Arch. Surg. 1992 127 392 399 10.1001/archsurg.1992.01420040034005 1558490 20. Holmes E.C. Moseley H.S. Morton D.L. Clark W. Robinson D. Urist M.M. A Rational Approach to the Surgical Management of Melanoma Ann. Surg. 1977 186 481 490 10.1097/00000658-197710000-00010 907393 PMC1396278 21. Morton D.L. Thompson J.F. Cochran A.J. Mozzillo N. Elashoff R. Essner R. Nieweg O.E. Roses D.F. Hoekstra H.J. Karakousis C.P. Sentinel-node biopsy or nodal observation in melanoma N. Engl. J. Med. 2006 355 1307 1317 10.1056/NEJMoa060992 17005948 22. Morton D.L. Thompson J.F. Cochran A.J. Mozzillo N. Nieweg O.E. Roses D.F. Hoekstra H.J. Karakousis C.P. Puleo C.A. Coventry B.J. Final Trial Report of Sentinel-Node Biopsy versus Nodal Observation in Melanoma N. Engl. J. Med. 2014 370 599 609 10.1056/NEJMoa1310460 24521106 PMC4058881 23. Faries M.B. Thompson J.F. Cochran A.J. Andtbacka R.H. Mozzillo N. Zager J.S. Jahkola T. Bowles T.L. Testori A. Beitsch P.D. Completion Dissection or Observation for Sentinel-Node Metastasis in Melanoma N. Engl. J. Med. 2017 376 2211 2222 10.1056/NEJMoa1613210 28591523 PMC5548388 24. Leiter U. Stadler R. Mauch C. Hohenberger W. Brockmeyer N. Berking C. Sunderkötter C. Kaatz M. Schulte K.-W. Lehmann P. Complete lymph node dissection versus no dissection in patients with sentinel lymph node biopsy positive melanoma (DeCOG-SLT): A multicentre, randomised, phase 3 trial Lancet Oncol. 2016 17 757 767 10.1016/S1470-2045(16)00141-8 27161539 25. Roumen R.M.H. Schuurman M.S. Aarts M.J. Maaskant-Braat A.J.G. Vreugdenhil G. Louwman W.J. Sapino A. Survival of sentinel node biopsy versus observation in intermediate-thickness melanoma: A Dutch population-based study PLoS ONE 2021 16 e0252021 10.1371/journal.pone.0252021 34033662 PMC8148374 26. Wong S.L. Faries M.B. Kennedy E.B. Agarwala S.S. Akhurst T.J. Ariyan C. Balch C.M. Berman B.S. Cochran A. Delman K.A. Sentinel Lymph Node Biopsy and Management of Regional Lymph Nodes in Melanoma: American Society of Clinical Oncology and Society of Surgical Oncology Clinical Practice Guideline Update Ann. Surg. Oncol. 2018 25 356 377 10.1245/s10434-017-6267-7 29236202 27. Lens M.B. Dawes M. Newton-Bishop J.A. Goodacre T. Tumour thickness as a predictor of occult lymph node metastases in patients with stage I and II melanoma undergoing sentinel lymph node biopsy Br. J. Surg. 2002 89 1223 1227 10.1046/j.1365-2168.2002.02236.x 12296887 28. Morton D.L. Hoon D.S. Cochran A.J. Turner R.R. Essner R. Takeuchi H. Wanek L.A. Glass E. Foshag L.J. Hsueh E.C. Lymphatic mapping and sentinel lymphadenectomy for early-stage melanoma: Therapeutic utility and implications of nodal microanatomy and molecular staging for improving the accuracy of detection of nodal micrometastases Ann. Surg. 2003 238 538 549 discussion 549–550 10.1097/01.sla.0000086543.45557.cb 14530725 PMC1360112 29. Network, N.C.C. Melanoma: Cutaneous. NCCN Clinical Practice Guidelines in Oncology (NCCN Guidelines®) 2024 23/09/2024; Version 3.2024 Available online: https://www.nccn.org/professionals/physician_gls/pdf/cutaneous_melanoma.pdf (accessed on 25 September 2024) 30. Ribero S. Osella-Abate S. Sanlorenzo M. Balagna E. Senetta R. Fierro M.T. Macripò G. Macrì L. Sapino A. Quaglino P. Sentinel Lymph Node Biopsy in Thick-Melanoma Patients (N=350): What is Its Prognostic Role? Ann. Surg. Oncol. 2015 22 1967 1973 10.1245/s10434-014-4211-7 25388059 31. Huang H. Fu Z. Ji J. Huang J. Long X. Predictive Values of Pathological and Clinical Risk Factors for Positivity of Sentinel Lymph Node Biopsy in Thin Melanoma: A Systematic Review and Meta-Analysis Front. Oncol. 2022 12 817510 10.3389/fonc.2022.817510 35155254 PMC8829564 32. Leiter U. Buettner P.G. Eigentler T.K. Bröcker E.B. Voit C. Gollnick H. Marsch W. Wollina U. Meier F. Garbe C. Hazard rates for recurrent and secondary cutaneous melanoma: An analysis of 33,384 patients in the German Central Malignant Melanoma Registry J. Am. Acad. Dermatol. 2012 66 37 45 10.1016/j.jaad.2010.09.772 21700361 33. Helvind N.M. Weitemeyer M.B.M. Chakera A.H. Hendel H.W. Ellebæk E. Svane I.M. Kjærskov M.W. Bojesen S. Skyum H. Petersen S.K. Stage-Specific Risk of Recurrence and Death From Melanoma in Denmark, 2008-2021: A National Observational Cohort Study of 25,720 Patients With Stage IA to IV Melanoma JAMA Dermatol. 2023 159 1213 1222 10.1001/jamadermatol.2023.3256 37650576 PMC10472263 34. Wong S.L. Kattan M.W. McMasters K.M. Coit D.G. A nomogram that predicts the presence of sentinel node metastasis in melanoma with better discrimination than the American joint committee on cancer staging system Ann. Surg. Oncol. 2005 12 282 288 10.1245/ASO.2005.05.016 15827679 35. Lo S.N. Ma J. Scolyer R.A. Haydu L.E. Stretch J.R. Saw R.P.M. Nieweg O.E. Shannon K.F. Spillane A.J. Ch’nG S. Improved Risk Prediction Calculator for Sentinel Node Positivity in Patients With Melanoma: The Melanoma Institute Australia Nomogram J. Clin. Oncol. 2020 38 2719 2727 10.1200/JCO.19.02362 32530761 PMC7430218 36. Ariyan S. Ali-Salaam P. Cheng D.W. Truini C. Reliability of Lymphatic Mapping After Wide Local Excision of Cutaneous Melanoma Ann. Surg. Oncol. 2007 14 2377 2383 10.1245/s10434-007-9468-7 17541771 37. Amaral T. Ottaviano M. Arance A. Blank C. Chiarion-Sileni V. Donia M. Dummer R. Garbe C. Gershenwald J. Gogas H. Cutaneous melanoma: ESMO Clinical Practice Guideline for diagnosis, treatment and follow-up Ann. Oncol. 2024 36 10 30 10.1016/j.annonc.2024.11.006 39550033 38. Barthelmes L. Goyal A. Newcombe R.G. McNeill F. Mansel R.E. NEW START ALMANAC Study Groups Adverse reactions to patent blue V dye—The NEW START and ALMANAC experience Eur. J. Surg. Oncol. 2010 36 399 403 10.1016/j.ejso.2009.10.007 19939618 39. Dang N.P. Cassier S. Mulliez A. Mansard S. D’INcan M. Barthélémy I. Eight Years’ Experience of Sentinel Lymph Node Biopsy in Melanoma Using Lymphoscintigraphy and Gamma Probe Detection After Radiocolloid Mapping Dermatol. Surg. 2017 43 287 292 10.1097/DSS.0000000000000961 27893540 40. Kwizera A. Obaid A. Tran D. Rubarth C. Preskitt J.T. Use of indocyanine green for sentinel lymph node biopsy in melanoma Bayl. Univ. Med. Cent. Proc. 2023 36 201 204 10.1080/08998280.2022.2147385 PMC9980704 36876243 41. Lavy D. Shimonovitz M. Keidar D. Warshavsky A. Lessing Y. Abu-Abeid A. Schneebaum S. Miodovnik M. Nizri E. ICG-guided sentinel lymph node biopsy in melanoma is as effective as blue dye: A retrospective analysis Surg. Oncol. 2024 57 102167 10.1016/j.suronc.2024.102167 39581000 42. Kirkwood J.M. Del Vecchio M. Weber J. Hoeller C. Grob J.-J. Mohr P. Loquai C. Dutriaux C. Chiarion-Sileni V. Mackiewicz J. Adjuvant nivolumab in resected stage IIB/C melanoma: Primary results from the randomized, phase 3 CheckMate 76K trial Nat. Med. 2023 29 2835 2843 10.1038/s41591-023-02583-2 37845511 PMC10667090 43. Luke J.J. Rutkowski P. Queirolo P. Del Vecchio M. Mackiewicz J. Chiarion-Sileni V. Merino L.d.l.C. Khattak M.A. Schadendorf D. Long G.V. Pembrolizumab versus placebo as adjuvant therapy in completely resected stage IIB or IIC melanoma (KEYNOTE-716): A randomised, double-blind, phase 3 trial Lancet 2022 399 1718 1729 10.1016/S0140-6736(22)00562-1 35367007 44. Patel S.P. Othus M. Chen Y. Wright G.P. Yost K.J. Hyngstrom J.R. Hu-Lieskovan S. Lao C.D. Fecher L.A. Truong T.-G. Neoadjuvant–Adjuvant or Adjuvant-Only Pembrolizumab in Advanced Melanoma N. Engl. J. Med. 2023 388 813 823 10.1056/NEJMoa2211437 36856617 PMC10410527 45. Reijers I.L.M. Menzies A.M. van Akkooi A.C.J. Versluis J.M. Heuvel N.M.J.v.D. Saw R.P.M. Pennington T.E. Kapiteijn E. van der Veldt A.A.M. Suijkerbuijk K.P.M. Personalized response-directed surgery and adjuvant therapy after neoadjuvant ipilimumab and nivolumab in high-risk stage III melanoma: The PRADO trial Nat. Med. 2022 28 1178 1188 10.1038/s41591-022-01851-x 35661157 46. Slominski R.M. Sarna T. Płonka P.M. Raman C. Brożyna A.A. Slominski A.T. Melanoma, Melanin, and Melanogenesis: The Yin and Yang Relationship Front. Oncol. 2022 12 842496 10.3389/fonc.2022.842496 35359389 PMC8963986 47. Brożyna A.A. Jóźwicki W. Carlson J.A. Slominski A.T. Melanogenesis affects overall and disease-free survival in patients with stage III and IV melanoma Hum. Pathol. 2013 44 2071 2074 10.1016/j.humpath.2013.02.022 23791398 PMC3783651 48. von Niederhäusern P.A. Seppi C. Sandkühler R. Nicolas G. Haerle S.K. Cattin P.C. Augmented reality for sentinel lymph node biopsy Int. J. Comput. Assist. Radiol. Surg. 2024 19 171 180 10.1007/s11548-023-03014-w 37747574 PMC10770201 49. Brockmeyer P. Wiechens B. Schliephake H. The Role of Augmented Reality in the Advancement of Minimally Invasive Surgery Procedures: A Scoping Review Bioengineering 2023 10 501 10.3390/bioengineering10040501 37106688 PMC10136262 50. Shafi S. Parwani A.V. Artificial intelligence in diagnostic pathology Diagn. Pathol. 2023 18 109 10.1186/s13000-023-01375-z 37784122 PMC10546747 51. Jiang Y. Yang M. Wang S. Li X. Sun Y. Emerging role of deep learning-based artificial intelligence in tumor pathology Cancer Commun. 2020 40 154 166 10.1002/cac2.12012 PMC7170661 32277744 52. Ricciardi E. Giordani E. Ziccheddu G. Falcone I. Giacomini P. Fanciulli M. Russillo M. Cerro M. Ciliberto G. Morrone A. Metastatic Melanoma: Liquid Biopsy as a New Precision Medicine Approach Int. J. Mol. Sci. 2023 24 4014 10.3390/ijms24044014 36835424 PMC9962821 53. Sheriff S. Saba M. Patel R. Fisher G. Schroeder T. Arnolda G. Luo D. Warburton L. Gray E. Long G. A scoping review of factors influencing the implementation of liquid biopsy for cancer care J. Exp. Clin. Cancer Res. 2025 44 50 10.1186/s13046-025-03322-w 39934875 PMC11817833 Figure 1 SLNB Milestones. medicina-61-01542-t001_Table 1 Table 1 Comparison of SLNB in cutaneous melanoma milestone trials. Trial Study Population Main Survival Outcome Disease-Free Survival (DFS)/Distant Metastasis-Free Survival (DMFS) MSLT-I intermediate (1.20–3.50 mm) and thick (>3.50 mm) cutaneous melanoma No significant difference in 10-year melanoma-specific survival in overall population; benefit in SLN-positive intermediate-thickness group (HR 0.56; p Intermediate thickness: DFS 71.3% vs. 64.7% (HR 0.76; p p MSLT-II SLN-positive; median follow-up 43 months No improvement in 3-year melanoma-specific survival (86% vs. 86%; p DFS slightly higher with CLND at 3 years: 68% vs. 63% ( p p DeCOG-SLT SLN-positive; median follow-up 72 months No difference in 5-year overall survival (HR 0.99; p 5-year DMFS: 67.6% vs. 64.9% (HR 1.08; p ",
  "metadata": {
    "Title of this paper": "A scoping review of factors influencing the implementation of liquid biopsy for cancer care",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471994/"
  }
}