{
  "title": "Paper_205",
  "abstract": "Orthop Rev (Pavia) Orthop Rev (Pavia) 1555 orthorevs 2408 Orthopedic Reviews 2035-8237 2035-8164 Open Medical Publishing Website: Orthopedic Reviews PMC12488074 PMC12488074.1 12488074 12488074 41041437 10.52965/001c.144733 144733 1 General Deubiquitinating Enzymes in Osteoarthritis: From Mechanisms to Therapeutic Yuan Zhikun  1 Chen Guanhao  2 Li Yanhui  3 Zhao Zihui  4 Zhang Haiyan  5  1 Department of Orthopedics, Shijie Hospital of Dongguan City, Dongguan, China  2 Health Management Center, Shijie Hospital of Dongguan City, Dongguan, China  3 Department of Pathology, Shijie Hospital of Dongguan City, Dongguan, China  4 Department of stomatology,Shijie Hospital of Dongguan City, Dongguan, China  5 Department of Orthopedics, Orthopedic Hospital of Guangdong Province,Guangzhou, China Zhikun Yuan，Guanhao Chen and Zihui Zhao are the co-first authors of this article. Corresponding authors:\nYanhui Li, Department of Pathology, Shijie Hospital of Dongguan City, Dongguan, China.\nEmail:hellen801224@163. com 29 9 2025 2025 17 479021 144733 19 7 2025 31 8 2025 29 09 2025 02 10 2025 03 10 2025 Osteoarthritis (OA) is a degenerative joint disease characterized by cartilage erosion, synovial inflammation and pain. Accumulating evidence demonstrates that deubiquitinating enzymes (DUBs) are critical regulators of OA pathogenesis through their ability to rescue key proteins from proteasomal degradation. Among them, USP7 stabilizes NOX4 to amplify ROS–NLRP3-dependent pyroptosis and cartilage catabolism; USP15 deubiquitinates ERK2 and SMAD2 to enhance TGF-β signaling and chondrocyte anabolism; USP13 sustains PTEN and IL-1R8/Sigirr to restrain PI3K/AKT/NF-κB–mediated inflammation and oxidative stress; USP3 and USP49 block TRAF6 ubiquitination and Wnt/β-catenin signaling to attenuate chondrocyte senescence and apoptosis; USP5 and USP14 promote NF-κB activation by stabilizing TRAF6 or deubiquitinating IκBα, driving chondrocyte dedifferentiation and matrix metalloproteinase expression. Pre-clinically, small-molecule USP7 inhibitors ( P22077 osteoarthritis deubiquitinating enzymes mechanisms Cellular Signal Transduction modulating cellular signaling extracellular matrix degradation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Deubiquitinating Enzymes in Osteoarthritis: From Mechanisms to Therapeutic",
    "Journal it was published in:": "Orthopedic Reviews",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488074/"
  }
}