{
  "title": "Paper_424",
  "abstract": "pmc Pain Med Pain Med 2894 painmed painmedicine Pain Medicine: The Official Journal of the American Academy of Pain Medicine 1526-2375 1526-4637 Oxford University Press PMC12481195 PMC12481195.1 12481195 12481195 31553457 10.1093/pm/pnz232 pnz232 1 Electronic Articles Opioids & Substance Use Disorders Section Original Research Articles Human Abuse Potential of Oral NKTR-181 in Recreational Opioid Users: A Randomized, Double-Blind, Crossover Study Ge Xue PhD  Nektar Therapeutics Henningfield Jack E PhD  The Johns Hopkins University School of Medicine, Department of Psychiatry and Behavioral Sciences  Pinney Associates Siddhanti Suresh PhD  Nektar Therapeutics Jobes Janet BS  Nektar Therapeutics Lu Lin PhD  Nektar Therapeutics Xie Sunny PhD  Nektar Therapeutics Ziola Margaret MD  Nektar Therapeutics Kelsh Debra MD  Altasciences Clinical Research USA Vince Bradley DO  Altasciences Clinical Research USA Di Fonzo Carlo J PhD  Nektar Therapeutics Tagliaferri Mary MD  Nektar Therapeutics Zalevsky Jonathan PhD  Nektar Therapeutics Doberstein Stephen K PhD  Nektar Therapeutics Hoch Ute PhD  Nektar Therapeutics Eldon Michael A PhD  Nektar Therapeutics Correspondence to: MEldon@nektar.com 2 2020 25 9 2019 21 2 352007 e114 e126 25 09 2019 01 10 2025 01 10 2025 © 2019 American Academy of Pain Medicine. 2019 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License( http://creativecommons.org/licenses/by-nc/4.0/ Abstract Objective To evaluate the human abuse potential, pharmacokinetics, pharmacodynamics, and safety of oral NKTR-181 (oxycodegol), a novel full mu-opioid receptor agonist, relative to oral oxycodone. Design This double-blind, randomized, single-dose, crossover human abuse potential study was conducted in healthy, adult, non–physically dependent recreational opioid users. Setting Inpatient clinical research site. Subjects Seventy-one subjects randomized (95.7% male, 65.2% African American, mean age = 31.7 years). Methods The primary objective was to compare two therapeutic doses of NKTR-181 (400 and 600 mg) with 40 and 60 mg of oxycodone and a supratherapeutic dose (1200 mg) of NKTR-181 with 60 mg of oxycodone using visual analog scale (VAS) ratings for Drug Liking “at this moment” (Drug Liking). Secondary objectives included VAS ratings for other subjective measures, and central nervous system (CNS) mu-opioid effects were assessed using pupillometry. Each subject received single oral doses of five treatments and matching placebo. Results Compared with 40 and 60 mg of oxycodone, the maximum mean Drug Liking score at 400 and 600 mg NKTR-181 was significantly lower, and the rate of onset and extent of Drug Liking for all NKTR-181 doses in the first two hours postdose were also significantly lower. Delayed attenuated Drug Liking and pupillary miosis response following administration of NKTR-181 vs oxycodone were consistent with slower NKTR-181 CNS entry kinetics and mu-opioid receptor binding. No adverse events were rated as severe, and somnolence and dizziness occurred more frequently when subjects received oxycodone. Conclusions NKTR-181 at oral doses of 400 and 600 mg showed significantly fewer and less severe subjective effects accepted as representative of opioid abuse potential, such as lower peak Drug Liking in recreational opioid users, than 40 and 60 mg of oxycodone. NKTR-181 Chronic Pain Opioid Abuse Potential Drug Liking Nektar Therapeutics pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Opioid analgesics are commonly used and effective for the treatment of patients with chronic pain [ 1 2 3–7 8–12 13 14 15 16 16–18 Across a variety of CNS active drugs, including not only opioids [ 19 20 21 22 23 24 25–28 29 In a previously published human abuse potential (HAP) study, non–physically dependent recreational opioid users reported Drug Liking, Drug High, and secondary abuse potential measure scores for 100-, 200-, and 400-mg doses of NKTR-181 that were statistically significantly lower than those for 40 mg of oxycodone [ 30 31 32 33 Here, we present the results of a second HAP study comparing two therapeutic doses (400 and 600 mg) and a supratherapeutic dose of NKTR-181 (1,200 mg) with two therapeutic doses of oxycodone (40 and 60 mg) in non–physically dependent recreational opioid users. Methods Study Participants Adult recreational opioid users who used oral opioids for nontherapeutic purposes at least 10 times in the past year and at least once in the past eight weeks were screened for study participation. A naloxone challenge was performed in the qualification phase to determine if subjects were physically dependent on opioids. Per the protocol inclusion and exclusion criteria, subjects who were physically dependent on opioids or had a history of drug or alcohol dependence, including subjects who had ever been in a drug rehabilitation program (other than treatment for smoking cessation), were not enrolled in the study. Subjects were further qualified for participation based on their Drug Liking scores after blinded, randomized administration of 40 mg of oral oxycodone and placebo to ensure that they could discriminate and tolerate oxycodone. Ability to discriminate oxycodone was defined as a peak Drug Liking score (E max Study Design Eligible subjects were confined to the clinical research facility for a six-period treatment phase planned to last 30 days, during which each subject received a single oral dose of each of six treatments, according to a double-blind, double-dummy, crossover, 6×6 William’s-square design. Three dose levels of NKTR-181 (400 mg, 600 mg, and a supratherapeutic dose of 1,200 mg) were administered as two, three, or six oral 200-mg NKTR-181 tablets, respectively, with matching placebo tablets. Subjects received six tablets in each phase. Oxycodone (40 and 60 mg) was administered as two or three 20-mg, overencapsulated oxycodone commercial immediate-release oral tablets, respectively, with matching oral capsule placebo. All treatments were administered under fasting conditions. Individual treatments were separated by periods of at least five days. Pharmacodynamic Assessments Abuse potential was evaluated with validated subjective VAS ratings for Drug Liking “at this moment” (Drug Liking), Overall Drug Liking, Take Drug Again, Drug High, Any Drug Effects, Good Drug Effects, Bad Drug Effects, Nausea, and Alertness/Drowsiness at scheduled times throughout the 24 hours postdose ( Table 1 17 Table 1 Bipolar and unipolar visual analog scales 0–100 VAS, mm VAS Type 0 50 100 Drug Liking * Bipolar “At this moment, my liking for this drug is” Strong disliking Neutral Strong liking Overall Drug Liking † “Overall, my liking for this drug is” Strong disliking Neutral Strong liking Take Drug Again † “Overall, I would take this drug again” Definitely not Do not care Definitely would Drug Similarity ‡ Unipolar “How similar is the drug you most recently received to [drug name]?” Not at all similar Very similar Drug Effects * High Any Drug Effect Good Drug Effect Bad Drug Effect Nausea Unipolar None Extremely Alertness/Drowsiness Bipolar Very drowsy Neutral Very alert VAS = visual analog scale. * Administered at predose and at 0.25, 0.5, 0.75, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 8.0, 12, and 24 hours postdose. † Administered at 12 and 24 hours postdose. ‡ Administered at 12 hours postdose. Pharmacokinetic Assessments Blood samples for pharmacokinetic analysis were collected at predose and at 0.25, 0.5, 0.75, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 5.0, 6.0, 8.0, 12, 24, 48, and 72 hours postdose. Concentrations of NKTR-181 were assayed using validated methods (data on file). Pupillometry Measurements of single-pupil diameters were obtained predose and before each blood sample for 24 hours postdose using a NeurOptics VIP-200 Pupillometer (Irvine, CA, USA), per the manufacturer’s specification. Pupil diameter was measured in a room specifically designed to control ambient light, using the right eye for all subjects unless otherwise determined by the investigator. Statistical Analyses For all subjective outcome measures and change from predose pupil diameter, peak effect was obtained (E max min Emax Emin max max max 0-inf ½ Randomization of approximately 60 subjects was expected to result in a total of 48 subjects (eight per treatment sequence) who completed all six treatment periods. This would provide 90% power to detect a Drug Liking E max For randomized subjects who completed all six treatment periods (completer population), mean differences of E max Safety/Tolerability Assessments Study drug safety and tolerability were assessed descriptively by the incidence and type of treatment-emergent adverse events (TEAEs); serious AEs and TEAEs leading to premature discontinuation of study medication were tabulated by treatment. Ethical Conduct The study was conducted in accordance with Good Clinical Practice, as described by the International Council for Harmonisation (ICH) Guidance for Industry, the Declaration of Helsinki, and US federal regulations for clinical studies. Before any subjects were enrolled, the Midlands Independent Review Board (Overland Park, KS, USA) reviewed the protocol, the informed consent form, and other study-related materials provided to subjects, and written informed consent was obtained from each subject. Results Disposition and Demographic Data Of the 111 subjects who entered the qualification phase, 71 were randomized to the six-period treatment phase, and 69 received treatment (safety population) ( Figure 1 2 Figure 1 Disposition of subjects. Pharmacodynamics Mean Drug Liking for 40 mg and 60 mg of oxycodone increased rapidly as seen in the first postdrug assessment at 15 minutes ( Figure 1 Figure 1 Table 2 max P Table 2 max P P Figure 2 P P P P Table 2 Figure 2 Mean of Drug Liking over time. Table 2 Pharmacodynamic results Pharmacodynamic Parameters Placebo (N = 54) NKTR-181 Oxycodone 400 mg (N = 54) 600 mg (N = 54) 1,200 mg (N = 54) 40 mg (N = 54) 60 mg (N = 54) Drug Liking VAS (SE) E max 53.2 (1.7) 62.0 (1.6) †, *** 67.9 (1.6) † , *** 76.7 (1.7) ‡ , * 76.6 (1.7) 81.5 (1.6) AUE 0-1 h 0.1 0.8 † , *** 1.7 † , *** 2.4 † , ** 5.8 9.5 AUE 0-2 h 1.0 3.7 † , *** 8.5 † , *** 14.2 † , ** 24.5 32.3 AUE 0-3 h 2.1 7.0 † , *** 17.6 † , *** 32.4 † , * 41.8 52.6 0–1 h, mm/h LS mean rates of increase, — 1.6 † , *** 4.5 † , *** 6.1 † , *** 14.2 20.5 0–2 h, mm/h — 1.8 † , *** 4.3 † , *** 7.6 † , * 11.9 15.1 Drug High VAS E max 3.1 (3.2) 21.3 (3.2) † , *** 33.7 (3.2) † , *** 57.8 (3.2) ‡ , * 53.8 (3.2) 67.2 (3.2) AUE 0-3 h 5.5 15.7 † , *** 35.7 † , *** 76.1 † , * 90.6 115.8 Any Effect VAS E max 3.0 (3.2) 20.4 (3.2) † *** 32.7 (3.2) † , *** 56.2 (3.2) ‡ , * 53.0 (3.2) 65.5 (3.2) AUE 0-3 h 4.9 15.7 † , *** 34.4 † , *** 72.7 † , * 88.0 112.8 Good Effect VAS E max 3.3 (3.2) 20.4 (3.2) † , *** 32.6 (3.2) † , *** 55.5 (3.2) ‡ , * 52.3 (3.2) 64.8 (3.2) AUE 0-3 h 5.1 14.6 † , *** 34.5 † , *** 71.6 † , * 87.6 110.7 Overall Drug Liking VAS LS mean (SE) 51.2 (2.1) 64.9 (2.1) † , *** 65.8 (2.1) † , *** 77.1 (2.1) ‡ , * 79.1 (2.1) 81.3 (2.1) Take Drug Again VAS LS mean (SE) 50.3 (2.2) 65.5 (2.2) † , *** 66.9 (2.2) † , ** 77.7 (2.2) ‡ , * 79.8 (2.2) 83.6 (2.2)  Placebo (N = 50)   400 mg (N = 53) 600 mg (N = 52) 1,200 mg (N = 52) 40 mg (N = 53) 60 mg (N = 54)  Pupil Diameter Change from Baseline E min –0.76 (0.12) –1.95 (0.12) † *** –2.38 (0.12) † , *** –3.15 (0.12) –3.00 (0.12) –3.29 (0.11) TE min 8.7 (0.6) 5.4 (0.5) † *** 4.5 (0.5) † , *** 3.4 (0.5) † , * 2.5 (0.5) 2.2 (0.5) AUE 0-3 h +0.37 –1.25 † , *** –2.17 † , *** –4.89 † , *** –6.32 –7.13 Statistical comparisons were made between 400 mg or 600 mg NKTR-181 and both 40 mg and 60 mg of oxycodone and separately between 1,200 mg NKTR-181 and 60 mg of oxycodone. AUE = area under the effective curve; E max Emin min *  P **  P ***  P P † Significantly different from both oxycodone doses. ‡ Significantly different from oxycodone 60 mg. Secondary pharmacodynamic end points are summarized in Table 2 Figure 3 Figure 3 max P P Figure 3 max P Figure 3 max P P Figure 3 Mean responses to drug effect visual analog scale at each observation time by treatment. Pupillometry Pupillary constriction rapidly increased with both oxycodone dose levels, as seen in the first postdrug assessment at 15 minutes ( Figure 4 Figure 4 Table 2 min P min Emin 0-3h P Table 2 Figure 4 Time course of mean change in pupil diameter from baseline. Pharmacokinetics Oxycodone and NKTR-181 were readily absorbed in all subjects, and disposition of both followed a bi-exponential decline. C max 0-inf Table 3 Table 3 Pharmacokinetic parameter values by dose level after administration of single oral doses of 400 mg, 600 mg, and 1,200 mg of NKTR-181 and 40 mg and 60 mg of oxycodone Pharmacokinetic Parameters Mean ± SD (CV%) NKTR-181 NKTR-181 NKTR-181 Oxycodone Oxycodone 400 mg 600 mg 1,200 mg 40 mg 60 mg (N = 58) (N = 62) (N = 62) (N = 60) (N = 61) T max 2.75 ± 1.05 (38) 2.23 ± 0.95 (43) 1.77 ± 0.75 (43) 1.94 ± 1.29 (67) 1.70 ± 1.44 (85) C max 3,390 ± 1,820 (54) 5,390 ± 2,390 (44) 9,220 ± 3,190 (35) 60.4 ± 22.0 (36) 89.1 ± 39.5 (44) AUC 0-inf 17,500 ± 5,380 (31) 25,100 ± 8,210 (33) 44,600 ± 14,100 (32) 392 ± 91.2 (23) 578 ± 143 (25) t 1/2 10.54 ± 2.77 (27) 11.30 ± 2.79 (25) 12.23 ± 3.12 (26) 6.13 ± 3.44 (56) 6.54 ± 3.05 (47) C max 8.48 ± 4.54 (54) 8.98 ± 3.99 (44) 7.69 ± 2.66 (35) 1.51 ± 0.55 (36) 1.49 ± 0.66 (44) AUC 0-inf 43.8 ± 13.5 (31) 41.9 ± 13.7 (33) 37.2 ± 11.8 (32) 9.79 ± 2.28 (23) 9.64 ± 2.39 (25) AUC 0-inf max 1/2 max Safety TEAEs reported during the study are summarized descriptively by treatment in Table 4 2 Table 4 Incidence of treatment-emergent adverse events by study drug and preferred term (safety analysis population) Placebo NKTR-181 Oxycodone 400 mg 600 mg 1,200 mg 40 mg 60 mg (N = 61), No. (%) (N = 59), No. (%) (N = 62), No. (%) (N = 62), No. (%) (N = 60), No. (%) (N = 62), No. (%) Summary Any TEAE 13 (21.3) 26 (44.1) 35 (56.5) 50 (80.6) 43 (71.7) 49 (79.0) Any severe TEAE 0 0 0 0 0 0 Any serious TEAE 0 0 0 0 0 0 Discontinuation due to TEAEs 0 0 1 (1.6) 1 (1.6) 0 2 (3.2) By preferred term * Euphoric mood 2 (3.3) 10 (16.9) 17 (27.4) 31 (50.0) 33 (55.0) 29 (46.8) Pruritus 0 1 (1.7) 8 (12.9) 19 (30.6) 13 (21.7) 24 (38.7) Nausea 2 (3.3) 5 (8.5) 3 (4.8) 12 (19.4) 8 (13.3) 9 (14.5) Headache 4 (6.6) 5 (8.5) 3 (4.8) 6 (9.7) 3 (5.0) 7 (11.3) Somnolence 1 (1.6) 3 (5.1) 3 (4.8) 6 (9.7) 7 (11.7) 10 (16.1) Vomiting 0 3 (5.1) 0 9 (14.5) 4 (6.7) 6 (9.7) Feeling abnormal 0 2 (3.4) 4 (6.5) 0 0 0 Dry mouth 0 0 1 (1.6) 4 (6.5) 1 (1.7) 1 (1.6) Pruritus generalized 0 1 (1.7) 0 3 (4.8) 4 (6.7) 3 (4.8) Dizziness 0 1 (1.7) 0 1 (1.6) 3 (5.0) 2 (3.2) TEAE = treatment-emergent adverse event. * The listing, sorted by total incidence after NKTR-181 administration, includes all preferred terms experienced by ≥5.0% of subjects in any treatment group, as coded by the Medical Dictionary for Regulatory Activities, version 19.1. Discussion NKTR-181 at oral doses of 400 mg and 600 mg showed significantly fewer and less severe subjective effects (i.e., slower onset and lower peak Drug Liking, effects that are accepted as representative of opioid abuse potential) than 40 and 60 mg of oxycodone in recreational nonmedical opioid users. The findings from this HAP study extend those of the first HAP study [ 30 29 31–33 The two dose levels of oxycodone were selected as the positive control for this study to comply with FDA guidance documents [ 16 16 30 34 35 In contrast to oxycodone at either dose level, NKTR-181 showed slower onset of effects in key measures of abuse potential. The similarity between the pharmacodynamic and pupillometry results supports the conclusion that NKTR-181’s slower entry into and effects in the brain are intrinsic differences between NKTR-181 and oxycodone. The importance of avoiding a rapid spike in brain concentrations of neuroactive drugs cannot be overemphasized when attempting to reduce human abuse potential. Literature reports show that the neuroactive drugs favored by abusers, whether opioids, anxiolytic benzodiazepines, or stimulants such as nicotine, cocaine, and amphetamine, cause rapid rises in extracellular dopamine in the nucleus accumbens in proportion to the drug dose and the rate of drug concentration rise in the brain [ 20 23 36–42 43 44 45 46 The inherent physicochemical and pharmacokinetic properties of conventional schedule II opioids make them especially valued by opioid abusers [ 12 47 48 49–51 52 53 In contrast, NKTR-181 was designed to have a slow rate of CNS entry and slow rate of mu-opioid receptor binding when compared with conventional opioids in order to reduce abuse potential while still achieving adequate brain exposure to permit treatment of chronic moderate to severe pain. In nonclinical models, the rate of NKTR-181 brain uptake in rats was 71 times lower than that of oxycodone [ 29 Therapeutic doses of NKTR-181 produced significantly lower scores in measures of abuse potential, including Drug Liking, Drug High, Any Drug Effects, Good Drug Effects, Overall Drug Liking, and Take Drug Again. Although there was no significant difference in the mean Drug Liking E max P Figure 2 P Pharmacodynamic and pharmacokinetic data support the primary and secondary analyses. Pupil constriction is not a direct measure of abuse potential, but it is a robust measure of the pharmacodynamics of CNS mu-opioid receptor agonist effects and has long been considered an important physiologic measure relevant to opioid abuse potential assessment [ 54 min max 33 55–57 Measurement of pupil diameter has been used extensively as a noninvasive biomarker of the rate and extent of CNS mu-opioid receptor agonist effect throughout the clinical development of NKTR-181, including in this study [ 30 54 54 Figure 5 Figure 5 Pharmacokinetic and pharmacodynamic results showing median model-predicted concentration or pupil diameter vs time. To allow direct visual comparison, predicted pupil diameter results are displayed as change from predose baseline normalized to E min 27 Pharmacokinetic/pharmacodynamic modeling permits estimation of the half-life of drug equilibration between plasma and the site of drug action [ 55 The safety analysis reveals that the 400- and 600-mg therapeutic oral doses of NKTR-181 are generally well tolerated, particularly when compared with 40 and 60 mg of oxycodone. Pruritis, nausea, dizziness, and somnolence were more frequently reported with both doses of oxycodone than with NKTR-181 at the 400-mg and 600-mg oral dose levels. Euphoric mood was consistent with the trend in Drug Liking and Drug High, with incidence in 400-mg and 600-mg NKTR-181 (17% and 27%, respectively) being significantly lower than the 40-mg and 60-mg doses of oxycodone (55% and 47%, respectively). Characterization of NKTR-181 as an opioid that may have lower abuse potential at therapeutic oral doses is also supported by efficacy and safety studies. Specifically, in the SUMMIT-07 phase 3 clinical trial, NKTR-181 administered at the therapeutic oral doses of 100 to 400 mg every 12 hours showed significant analgesia efficacy throughout 12 weeks of double-blind treatment in patients with moderate to severe CLBP. The number of subjects with a ≥30% (71.2% vs 57.1%) or a ≥50% (51.1% vs 37.9%) decline in mean weekly pain score from baseline to week 12 was significantly greater ( P 31 31 32 The results of the current study extend those of an earlier HAP study conducted with NKTR-181, which used a similar design to evaluate a lower oral dose range of NKTR-181 (100, 200, and 400 mg) compared with placebo and 40 mg of oxycodone in a population of non–physically dependent recreational opioid users [ 30 max max max Conclusions The overall results of this study, combined with clinical assessments of abuse potential from the SUMMIT-07 study and nonclinical findings, characterize NKTR-181, at therapeutic oral doses, as an opioid with significantly less severe subjective effects that are accepted as representative of opioid abuse potential than 40 and 60 mg of oxycodone. The findings of significant analgesic effect in patients with CLBP seen in the SUMMIT-07 trial, together with the findings reported here, support the use of NKTR-181 as an option for opioid analgesia that may have lower abuse potential in patients with chronic pain. Acknowledgments The authors thank Naama Cooperman, PhD, Kerri Schoedel, PhD, and Megan Shram, PhD, from Altreos Research Partners for their technical discussion. This study was funded by Nektar Therapeutics. Editorial assistance for formatting and proofreading was provided by Phillips Gilmore Oncology Communications. Nektar Therapeutics provided funding for editorial support. Funding sources: This study was funded by Nektar Therapeutics, San Francisco, CA, USA. Conflicts of interest: XG, SS, JJ, LL, SX, MZ, CDF, MT, JZ, SKD, UH, and MAE are employed by Nektar Therapeutics. JEH provided consulting services with financial support from Nektar Therapeutics. References 1 Cheung CW Qiu Q Choi SW Moore B Goucke R Irwin M. Chronic opioid therapy for chronic non-cancer pain: A review and comparison of treatment guidelines Pain Physician 2014 17 5 401 14 25247898 2 Deyo RA Von Korff M Duhrkoop D. Opioids for low back pain BMJ 2015 350 g6380. 25561513 10.1136/bmj.g6380 PMC6882374 3 Ballantyne JC. Assessing the prevalence of opioid misuse, abuse, and addiction in chronic pain Pain 2015 156 4 567 8 25630030 10.1097/j.pain.0000000000000105 4 Chou R Turner JA Devine EB et al The effectiveness and risks of long-term opioid therapy for chronic pain: A systematic review for a National Institutes of Health Pathways to Prevention Workshop Ann Intern Med 2015 162 4 276 86 25581257 10.7326/M14-2559 5 Dart RC Surratt HL Cicero TJ et al Trends in opioid analgesic abuse and mortality in the United States N Engl J Med 2015 372 3 241 8 25587948 10.1056/NEJMsa1406143 6 Hansen RN Oster G Edelsberg J Woody GE Sullivan SD. Economic costs of nonmedical use of prescription opioids Clin J Pain 2011 27 3 194 202 21178601 10.1097/AJP.0b013e3181ff04ca 7 Rudd RA Aleshire N Zibbell JE Gladden RM. Increases in drug and opioid overdose deaths–United States, 2000-2014 MMWR Morb Mortal Wkly Rep 2016 64 50–51 1378 82 26720857 10.15585/mmwr.mm6450a3 8 Darwish M Bond M Ma Y Tracewell W Robertson P Jr Webster LR. Abuse potential with oral route of administration of a hydrocodone extended-release tablet formulated with abuse-deterrence technology in nondependent, recreational opioid users Pain Med 2017 18 1 61 77 27330154 10.1093/pm/pnw122 PMC5283701 9 Harris SC Cipriano A Colucci SV et al Oral abuse potential, pharmacokinetics, and safety of once-daily, single-entity, extended-release hydrocodone (HYD) in recreational opioid users Pain Med 2017 18 7 1278 91 27651514 10.1093/pm/pnw208 PMC5914330 10 Kopecky EA Fleming AB Levy-Cooperman N O’Connor M Sellers E. Oral human abuse potential of oxycodone DETERx ® ® J Clin Pharmacol 2017 57 4 500 12 27669664 10.1002/jcph.833 PMC5363337 11 Smith MD Webster LR Lawler J Lindhardt K Dayno JM. Human abuse potential of an abuse-deterrent (AD), extended-release (ER) morphine product candidate (morphine-ADER injection-molded tablets) versus extended-release morphine administered orally in nondependent recreational opioid users Pain Med 2017 18 5 898 907 27633773 10.1093/pm/pnw174 PMC5431384 12 Stoops WW Hatton KW Lofwall MR Nuzzo PA Walsh SL. Intravenous oxycodone, hydrocodone, and morphine in recreational opioid users: Abuse potential and relative potencies Psychopharmacology (Berl) 2010 212 2 193 203 20665209 10.1007/s00213-010-1942-4 PMC2939200 13 Setnik B Sommerville K Goli V Han L Webster L. Assessment of pharmacodynamic effects following oral administration of crushed morphine sulfate and naltrexone hydrochloride extended-release capsules compared with crushed morphine sulfate controlled-release tablets and placebo in nondependent recreational opioid users Pain Med 2013 14 1173 86 23745947 10.1111/pme.12148 14 Setnik B Bass A Bramson C et al Abuse potential study of ALO-02 (extended-release oxycodone surrounding sequestered naltrexone) compared with immediate-release oxycodone administered orally to nondependent recreational opioid users Pain Med 2017 18 6 1077 88 27550954 10.1093/pm/pnw178 PMC5914361 15 Levy-Cooperman N McIntyre G Bonifacio L et al Abuse potential and pharmacodynamic characteristics of oral and intranasal eluxadoline, a mixed μ- and κ-opioid receptor agonist and δ-opioid receptor antagonist J Pharmacol Exp Ther 2016 359 3 471 81 27647873 10.1124/jpet.116.236547 PMC5118645 16 US Department of Health and Human Services, Food and Drug Administration. Center for Drug Evaluation and Research (CDER) guidance for industry. Assessment of abuse potential of drugs. Available at: https://www.fda.gov/downloads/Drugs/GuidanceComplianceRegulatoryInformation/Guidances/UCM334743.pdf 17 US Department of Health and Human Services, Food and Drug Administration. Center for Drug Evaluation and Research (CDER) guidance for industry. Assessment of abuse potential of drugs. Available at: https://www.fda.gov/downloads/drugs/guidancecomplianceregulatoryinformation/guidances/ucm198650.pdf 18 US Department of Health and Human Services, Food and Drug Administration. Abuse-deterrent opioid analgesics. Available at: https://www.fda.gov/Drugs/DrugSafety/PostmarketDrugSafetyInformationforPatientsandProviders/ucm600788.htm 19 Comer SD Ashworth JB Sullivan MA Vosburg SK Saccone PA Foltin RW. Relationship between rate of infusion and reinforcing strength of oxycodone in humans J Opioid Manag 2009 5 4 203 12 19736900 10.5055/jom.2009.0022 20 Marsch LA Bickel WK Badger GJ et al Effects of infusion rate of intravenously administered morphine on physiological, psychomotor, and self-reported measures in humans J Pharmacol Exp Ther 2001 299 3 1056 65 11714895 21 Samaha AN Yau WY Yang P Robinson TE. Rapid delivery of nicotine promotes behavioral sensitization and alters its neurobiological impact Biol Psychiatry 2005 57 4 351 60 15705350 10.1016/j.biopsych.2004.11.040 22 Auty RM Branch RA. Pharmacokinetics and pharmacodynamics of ethanol, whiskey, and ethanol with n-propyl, n-butyl, and iso-amyl alcohols Clin Pharmacol Ther 1977 22 2 242 9 884925 10.1002/cpt1977222242 23 Abreu ME Bigelow GE Fleisher L Walsh SL. Effect of intravenous injection speed on responses to cocaine and hydromorphone in humans Psychopharmacology (Berl) 2001 154 1 76 84 11292009 10.1007/s002130000624 24 Samaha AN Li Y Robinson TE. The rate of intravenous cocaine administration determines susceptibility to sensitization J Neurosci 2002 22 8 3244 50 11943825 10.1523/JNEUROSCI.22-08-03244.2002 PMC6757529 25 Kimmel HL O'Connor JA Carroll FI Howell LL. Faster onset and dopamine transporter selectivity predict stimulant and reinforcing effects of cocaine analogs in squirrel monkeys Pharmacol Biochem Behav 2007 86 1 45 54 17258302 10.1016/j.pbb.2006.12.006 PMC1850383 26 Spencer TJ Biederman J Ciccone PE et al PET study examining pharmacokinetics, detection and likeability, and dopamine transporter receptor occupancy of short- and long-acting oral methylphenidate Am J Psychiatry 2006 163 3 387 95 16513858 10.1176/appi.ajp.163.3.387 27 Volkow ND Fowler JS Wang GJ Swanson JM. Dopamine in drug abuse and addiction: Results from imaging studies and treatment implications Mol Psychiatry 2004 9 6 557 69 15098002 10.1038/sj.mp.4001507 28 Volkow ND Fowler JS Wang GJ Baler R Telang F. Imaging dopamine’s role in drug abuse and addiction Neuropharmacology 2009 56(Suppl 1) 3 8 18617195 10.1016/j.neuropharm.2008.05.022 PMC2696819 29 Miyazaki T Choi IY Rubas W et al NKTR-181: A novel mu-opioid analgesic with inherently low abuse potential J Pharmacol Exp Ther 2017 363 1 104 13 28778859 10.1124/jpet.117.243030 30 Webster L Henningfield J Buchhalter AR et al Human abuse potential of the new opioid analgesic molecule NKTR-181 compared with oxycodone Pain Med 2018 19 2 307 18 28340145 10.1093/pm/pnw344 PMC5914314 31 Markman J Gudin J Rauck R. SUMMIT-07: A randomized trial of NKTR-181, a new molecular entity, for chronic low-back pain Pain 2019 160 6 1374 82 30747908 10.1097/j.pain.0000000000001517 PMC6553961 32 Lanier RK Henningfield JE Gudin J et al Assessment of potentially abuse-related events in two phase 3 studies of NKTR-181, a novel opioid analgesic, using the Misuse, Abuse, and Diversion Drug Event Reporting System (MADDERS ® Curr Med Res Opin 10.1080/03007995.2019.1594744 30932719 33 Gudin J Rauck R Argoff C et al Long-term safety and tolerability of NKTR-181 in patients with moderate to severe chronic low back pain or chronic noncancer pain: A phase 3 multicenter, open-label, 52-week study (SUMMIT-08 LTS) Pain Med 2019 10.1093/pm/pnz169 PMC7372935 31361019 34 Lalovic B Kharasch E Hoffer C et al Pharmacokinetics and pharmacodynamics of oral oxycodone in healthy human subjects: Role of circulating active metabolites Clin Pharmacol Ther 2006 79 5 461 79 16678548 10.1016/j.clpt.2006.01.009 35 Webster LR Bath B Medve RA Marmon T Stoddard GJ. Randomized, double-blind, placebo controlled study of the abuse potential of different formulations of oral oxycodone Pain Med 2012 13 6 790 801 22568663 10.1111/j.1526-4637.2012.01380.x 36 Allain F Minogianis EA Roberts DC Samaha AN. How fast and how often: The pharmacokinetics of drug use are decisive in addiction Neurosci Biobehav Rev 2015 56 166 79 26116543 10.1016/j.neubiorev.2015.06.012 37 Compton WM Volkow ND. Abuse of prescription drugs and the risk of addiction Drug Alcohol Depend 2006 83(Suppl 1) S4 7 16563663 10.1016/j.drugalcdep.2005.10.020 38 Everitt BJ Dickinson A Robbins TW. The neuropsychological basis of addictive behaviour Brain Res Brain Res Rev 2001 36 2–3 129 38 11690609 10.1016/s0165-0173(01)00088-1 39 Grella SL Levy A Campbell A et al Oxycodone dose-dependently imparts conditioned reinforcing properties to discrete sensory stimuli in rats Pharmacol Res 2011 64 4 364 70 21745571 10.1016/j.phrs.2011.06.022 40 Samaha AN Robinson TE. Why does the rapid delivery of drugs to the brain promote addiction? Trends Pharmacol Sci 2005 26 2 82 7 15681025 10.1016/j.tips.2004.12.007 41 Samaha AN Mallet N Ferguson SM Gonon F Robinson TE. The rate of cocaine administration alters gene regulation and behavioral plasticity: Implications for addiction J Neurosci 2004 24 28 6362 70 15254092 10.1523/JNEUROSCI.1205-04.2004 PMC6729536 42 Volkow ND Wang GJ Fowler JS Tomasi D Telang F Baler R. Addiction: Decreased reward sensitivity and increased expectation sensitivity conspire to overwhelm the brain's control circuit Bioessays 2010 32 9 748 55 20730946 10.1002/bies.201000042 PMC2948245 43 Butler SF Black RA Cassidy TA Dailey TM Budman SH. Abuse risks and routes of administration of different prescription opioid compounds and formulations Harm Reduct J 2011 8 1 29. 22011626 10.1186/1477-7517-8-29 PMC3213066 44 Kirsh K Peppin J Coleman J. Characterization of prescription opioid abuse in the United States: Focus on route of administration J Pain Palliat Care Pharmacother 2012 26 4 348 61 23675595 10.3109/15360288.2012.734905 45 Butler SF Cassidy TA Chilcoat H et al Abuse rates and routes of administration of reformulated extended-release oxycodone: Initial findings from a sentinel surveillance sample of individuals assessed for substance abuse treatment J Pain 2013 14 4 351 8 23127293 10.1016/j.jpain.2012.08.008 46 Sellers EM Perrino PJ Colucci SV Harris SC. Attractiveness of reformulated OxyContin(R) tablets: Assessing comparative preferences and tampering potential J Psychopharmacol 2013 27 9 808 16 23784739 10.1177/0269881113493364 47 Bostrom E Hammarlund-Udenaes M Simonsson US. Blood-brain barrier transport helps to explain discrepancies in in vivo potency between oxycodone and morphine Anesthesiology 2008 108 3 495 505 18292687 10.1097/ALN.0b013e318164cf9e 48 Lemberg KK Heiskanen TE Kontinen VK Kalso EA. Pharmacology of oxycodone: Does it explain why oxycodone has become a bestselling strong opioid? Scand J Pain 2009 1 S1 S18 S23 49 Bostrom E Simonsson US Hammarlund-Udenaes M. Oxycodone pharmacokinetics and pharmacodynamics in the rat in the presence of the P-glycoprotein inhibitor PSC833 J Pharm Sci 2005 94 5 1060 6 15799017 10.1002/jps.20327 50 Butler SF Fernandez KC Chang A et al Measuring attractiveness for abuse of prescription opioids Pain Med 2010 11 1 67 80 20002325 10.1111/j.1526-4637.2009.00736.x 51 Villesen HH Foster DJ Upton RN Somogyi AA Martinez A Grant C. Cerebral kinetics of oxycodone in conscious sheep J Pharm Sci 2006 95 8 1666 76 16729270 10.1002/jps.20632 52 Cicero TJ Ellis MS Surratt HL Kurtz SP. Factors influencing the selection of hydrocodone and oxycodone as primary opioids in substance abusers seeking treatment in the United States Pain 2013 154 12 2639 48 24287106 10.1016/j.pain.2013.07.025 53 Farre M Cami J. Pharmacokinetic considerations in abuse liability evaluation Br J Addict 1991 86 12 1601 6 1786493 10.1111/j.1360-0443.1991.tb01754.x 54 Jasinski DR Johnson RE Henningfield JE. Abuse liability assessment in human subjects Trends Pharmacol Sci 1984 5 5 196 200 55 Eldon MA Odinecs A Herzog S Medve R Webster L. 2012 56 Mandema JW Kaiko RF Oshlack B Reder RF Stanski DR. Characterization and validation of a pharmacokinetic model for controlled-release oxycodone Br J Clin Pharmacol 1996 42 6 747 56 8971431 10.1046/j.1365-2125.1996.00481.x PMC2042713 57 Webster L Iverson M Medve R Odinecs A Eldon MA. 2011 ",
  "metadata": {
    "Title of this paper": "Characterization and validation of a pharmacokinetic model for controlled-release oxycodone",
    "Journal it was published in:": "Pain Medicine: The Official Journal of the American Academy of Pain Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481195/"
  }
}