{
  "title": "Paper_1052",
  "abstract": "pmc Dent J (Basel) Dent J (Basel) 3384 dentj dentistry Dentistry Journal 2304-6767 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469206 PMC12469206.1 12469206 12469206 41002695 10.3390/dj13090422 dentistry-13-00422 1 Review Breaking Barriers: Evaluating Challenges in Advancing Periodontal Ligament Cell-Derived Organoids https://orcid.org/0000-0002-4521-0007 Matos Luiza de Oliveira 1 2 https://orcid.org/0000-0001-7873-0765 Sordi Mariane Beatriz 1 2 https://orcid.org/0000-0002-9010-633X Birjandi Anahid Ahmadi 1 Sharpe Paul Thomas 1 https://orcid.org/0000-0001-7306-4708 Cruz Ariadne Cristiane Cabral 2 3 * Gillam David Academic Editor 1 matosluizaa@gmail.com marianesordi@hotmail.com anahid.ahmadi_birjandi@kcl.ac.uk paul.sharpe@kcl.ac.uk 2 3 * ariadne.cruz@ufsc.br 13 9 2025 9 2025 13 9 497630 422 14 7 2025 26 8 2025 09 9 2025 13 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The objective of this review was to critically evaluate the available literature on the development of periodontal ligament organoids. Articles concerning periodontal ligament organoids were considered eligible. References were selected in a two-phased process. Electronic databases PubMed and Scopus were screened up to June 2024, yielding 1101 studies. After removing duplicates, titles, and abstracts were screened, resulting in 44 articles being included in this review. A detailed analysis of the included articles was organized into four categories: (1) the cell lineages used, including the simultaneous use of two or more cell types, (2) the extracellular matrix composition, (3) the organoid preparation methods, and (4) the characterization techniques employed. The main findings show that collagen combined with biodegradable polymers—such as poly(caprolactone), poly(glycolic acid), and poly(lactic acid)—is the most used material. Periodontal ligament cells and periodontal fibroblasts were the most used cell types, due to their role in extracellular matrix remodeling. The most frequent analyses performed included alkaline phosphatase, extracellular matrix mineralization, and gene expression, providing insights into differentiation and periodontal regeneration. Cementogenic differentiation was the most studied, followed by osteogenic, chondrogenic, adipogenic, and epithelial differentiation. However, challenges remain, including methodological inconsistencies and the need for scaffold optimization. Future research should focus on standardizing protocols, improving biomaterials, and integrating bioprinting techniques to improve clinical translation. periodontal ligament cells organoids three-dimensional cell culture periodontal regeneration International Team of Implantology (ITI) 1717-2022 Conselho Nacional de Desenvolvimento Científico e Tecnológico (CNpQ—National Council for Scientific and Technological Development), Brazil Coordenação de Aperfeiçoamento Pessoal de Nível Superior (CAPES—Coordination for the Improvement of Higher Education Personnel), Brazil This research received International Team of Implantology (ITI) Research Grant number 1717-2022. Luiza de Oliveira Matos was supported with scholarships from Conselho Nacional de Desenvolvimento Científico e Tecnológico (CNpQ—National Council for Scientific and Technological Development), Brazil, and Coordenação de Aperfeiçoamento Pessoal de Nível Superior (CAPES—Coordination for the Improvement of Higher Education Personnel), Brazil. Mariane Beatriz Sordi was supported with a grant from ITI. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cell culture is a fundamental technique that allows for the controlled study of cell behavior, function, and responses to different stimuli under well-defined conditions [ 1 2 3 4 5 1 In contrast, cells in the human body exist within a three-dimensional (3D) environment, supported by the surrounding extracellular matrix (ECM). In this environment, cells receive nutrients, oxygen, and growth factors through diffusion gradients and the permeation properties of the ECM [ 6 7 1 8 Spheroids are simple 3D aggregates of cells, while organoids are more complex structures capable of self-renewal, differentiation, and organization into spatial arrangements that closely mimic human organs [ 9 10 11 Despite the advantages of 3D organoid technology over traditional 2D cultures and animal models, this field is still in its early stages, with several challenges yet to be addressed. Organoid systems for tissues such as the intestine [ 12 13 14 15 16 17 18 In this review, we propose to critically evaluate the available in vitro and in vivo literature concerning periodontal ligament organoids and identify the challenges that must be addressed to advance this 3D cell culture model. Our goal is to provide valuable insights into the potential application of periodontal ligament organoids in regenerative tissue engineering and personalized periodontal treatments, while highlighting the barrier to their clinical translation. 2. Methods An electronic search of the PubMed and Scopus databases was conducted up to June 2024. The following search terms were employed: (periodontal ligament cells OR PDL OR periodontal ligament stem cells OR dental pulp mesenchymal stem cells OR dental follicle progenitor cells OR stem cells from apical papilla OR oral fibroblasts OR gingival fibroblasts OR oral epithelial cells OR gingival epithelial cells) AND (organoid OR three-dimensional culture). The search was limited to publications in the English language and included in vitro, in vivo, and clinical studies, without restricting the year of publication. The following exclusion criteria were considered: studies on cell culture that did not evaluate organoids, case reports, protocols, short communications, personal opinions, letters, posters, book chapters, conference abstracts, full-text not available, duplicate data (e.g., dissertations or theses with corresponding published articles), literature reviews, and systematic reviews. A two-phase selection process was performed. In phase 1, the title and abstract were screened to identify potentially eligible studies. Phase 2 involved a full-text reading of eligible articles. Subsequently, a narrative review was conducted to discuss the results, focusing on cell lineages and origin, the extracellular matrix components employed, and the main findings. 3. Results 3.1. Study Selection As depicted in Figure 1 3.2. Cells As illustrated in Figure 2 n 5 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 n 48 49 50 51 52 53 n 23 48 54 55 56 n 57 58 n 58 59 n 42 59 n 9 n 35 n 53 n 53 n 60 Most studies evaluated a single cell type ( n 5 9 16 17 18 19 21 22 23 24 25 26 27 28 29 30 31 34 35 36 37 38 40 41 42 43 44 47 48 49 51 52 53 60 61 n 23 35 42 48 54 58 60 62 n 53 59 n 5 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 33 34 35 37 38 39 40 41 42 43 44 46 47 48 49 50 51 52 53 55 56 59 60 61 n 9 39 59 n 35 Table 1 Table 2 Table 3 3.3. Extracellular Matrix Component Organoid fabrication involved various extracellular matrix (ECM) types, classified as solid scaffolds, hydrogels, or protein-based extracellular matrix, with both synthetic and natural origins. As presented in Figure 3 Table 1 n 22 24 26 30 32 33 37 40 41 42 43 44 45 47 48 52 53 56 57 59 61 n 5 19 20 25 27 28 29 31 36 39 50 51 55 n 9 21 23 34 35 47 54 60 62 Materials included poly(caprolactone) ( n 22 26 n 33 52 n 32 37 n 41 47 n 53 n 48 n 49 n 24 n 57 n 30 n 40 n 59 n 56 n 61 30 41 47 53 57 30 33 41 47 52 53 33 41 47 52 53 32 37 41 47 59 Hydrogel were used in 15 studies ( n 5 9 19 20 25 27 28 29 31 36 39 49 50 51 55 Figure 3 Table 2 n 19 n 19 n 51 n 20 36 39 50 n 25 n 5 n 28 n 27 n 29 n 31 n 9 n 49 n 55 As depictable in Figure 3 Table 3 21 23 34 35 46 54 60 62 n 9 62 n 21 34 35 46 54 60 n 23 3.4. Organoids Preparation Two primary methods of organoid preparation were found in this literature review. In most articles ( n 5 9 21 22 24 26 27 29 30 32 33 34 35 37 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 59 61 Figure 4 n 19 20 23 25 28 31 36 39 62 Figure 4 n 60 3.5. Characterization Methods As depicted in Figure 5 3.5.1. Viability Cellular viability determination ( n 19 20 27 28 29 30 31 34 36 41 42 43 44 45 51 55 57 n 31 34 42 43 44 45 n 19 20 30 36 51 57 n 19 41 n 55 n 28 n 27 n 29 3.5.2. Proliferation Cellular proliferation ( n 5 9 19 28 33 36 37 39 40 48 49 51 n 5 19 n 19 36 n 19 n 48 49 n 33 51 n 28 37 n 40 n 9 3.5.3. Adhesion Cell adhesion ( n 31 49 51 n 31 51 n 49 3.5.4. Migration To assess cell migration, studies employed methods such as SEM imaging ( n 21 36 41 45 n 49 50 n 60 n 19 n 20 n 9 n 25 n 52 n 57 n 28 n 49 n 27 n 32 37 n 24 n 5 21 41 49 57 3.5.5. Orientation Cell orientation was evaluated through directionality analysis with ImageJ (National Institute of Health, version 1.53 t) ( n 20 n 39 n 26 n 28 30 45 n 57 3.5.6. Differentiation Concerning the differentiation, cementogenic ( n 5 24 27 28 32 33 34 37 39 41 43 45 49 50 53 56 59 n 5 24 28 32 33 34 37 39 41 43 45 49 53 56 59 n 9 28 30 32 37 n 27 28 n 9 28 30 57 Table 4 n 5 9 24 25 27 28 30 33 34 37 39 43 45 49 53 57 58 59 62 n 9 32 49 n 44 n 9 21 23 24 35 41 43 47 52 53 54 59 62 n 23 24 25 26 34 49 52 n 23 28 44 46 56 n 25 50 n 21 Also, differentiation process was evaluated through alkaline phosphatase (ALP) ( n 5 20 22 29 30 31 33 34 37 42 43 45 46 50 51 56 n 5 24 33 34 42 49 50 58 59 61 n 33 34 49 50 58 61 n 42 n 5 50 n 52 Additionally, Hoechst-33358 staining ( n 44 n 30 62 n 24 36 37 49 n 24 52 n 24 43 44 45 56 59 n 56 n 62 n 22 3.5.7. Surface Characteristics The surface characterization analysis included scanning electron microscopy (SEM) ( n 21 31 32 33 37 40 41 43 44 45 47 56 61 n 9 21 56 n 22 23 34 43 45 56 60 62 n 48 3.5.8. Mechanical Analysis The mechanical analyses were performed to evaluate stiffness ( n 22 n 39 n 36 n 55 n 32 48 n 5 n 36 60 n 58 4. Discussion The use of organoids in periodontal research surpasses 2D cultures and spheroids, primarily due to their ability to better replicate the native tissue complexity, including cellular interactions, extracellular matrix composition, and three-dimensional architecture [ 63 Characterization of periodontal organoids typically assesses cell viability, adhesion, proliferation, migration, differentiation, surface properties, and mechanical behavior. Common assays for viability included MTT [ 31 34 42 43 44 45 19 20 30 36 51 57 19 41 5 19 48 49 33 51 31 51 39 49 5 24 28 32 33 34 37 39 41 45 49 53 56 59 5 9 24 25 27 28 30 33 34 37 39 43 45 49 53 57 58 59 62 9 32 49 9 21 23 24 35 41 43 47 52 53 54 59 62 23 28 44 46 56 23 24 25 26 34 49 52 25 50 31 51 9 21 56 22 23 34 43 45 56 60 62 22 55 32 48 Organoids are defined as 3D structures derived from pluripotent stem cells, progenitor cells, and/or differentiated cells, which mimic key structural and functional aspects of their corresponding tissue [ 58 63 18 64 65 66 49 64 67 5 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 54 59 60 61 n 48 49 50 51 52 53 n 23 48 54 55 56 n 57 58 n 58 59 n 42 59 n 9 n 35 n 53 n 53 n 60 48 49 50 51 52 53 Periodontal ligament cells, periodontal ligament fibroblasts, periodontal ligament stem cells, and immortalized periodontal ligament cells may seem similar. To distinguish among these, we categorize them: ref. [ 1 65 66 2 21 34 3 48 49 52 4 57 While periodontal ligament cells and fibroblasts were the most used, periodontal ligament stem cells are the most efficient for generating organoids due to their multipotency and regenerative potential. Their ability to differentiate into osteogenic, adipogenic, and cementogenic lineages makes them highly versatile for tissue engineering. Additionally, their self-renewal capacity and interaction with other periodontal cell types enhance their ability to replicate the complex microenvironment of the periodontal ligament in organoid models. Nevertheless, they lack the potential to differentiate into epithelial cell lines with the potential for keratinization. Most studies focused on human cells for periodontal regeneration, with only four utilizing animal cells [ 9 35 39 59 There is currently no standardized protocol for periodontal organoid development, with studies varying in cell types, extracellular matrix composition, and culture methods. Two predominant methods were identified: combining cells with the extracellular matrix components [ 19 20 23 25 28 31 36 39 62 5 9 21 22 24 26 27 29 30 32 33 34 35 37 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 61 60 Various biomaterials were used to construct periodontal organoids, including biodegradable polymers such as polycaprolactone (PCL) [ 22 26 53 48 5 27 29 32 37 47 59 61 56 22 26 53 Several studies using other biodegradable polymers such as poly(hydroxybutyrate-co-hydroxyvalerate), poly(aspartamide) (PASP), PGA, and PEC demonstrated that cells seeded on these scaffolds presented adhesion and proliferation, making them potential candidates for periodontal tissue engineering [ 29 47 48 56 61 27 27 56 59 32 37 29 35 Collagen, one of the main components of periodontal ligament fibers, was widely used due to its biocompatibility and ability to support cell adhesion, migration, proliferation, and differentiation [ 20 21 25 34 35 36 39 41 46 47 50 54 57 60 34 36 44 60 34 5 24 28 32 34 37 39 41 45 49 53 56 59 5 20 22 29 30 31 33 34 37 42 43 45 46 50 51 56 35 35 25 41 41 39 41 44 46 Additional biomaterials, including gelatin [ 19 27 28 49 51 30 42 43 44 45 24 33 40 45 51 52 53 19 25 51 33 43 52 23 ® 9 43 45 Among the materials studied for ligament periodontal organoid formation, collagen and biodegradable polymers stand out as the most promising. Collagen closely mimics the native extracellular matrix, supporting cell adhesion, migration, proliferation, and differentiation, while enhancing mineralized matrix formation [ 34 36 41 50 22 26 32 37 53 Despite the significant research on organoids for tissue regeneration, few studies have used organoids to analyze the interaction between microorganisms and periodontal cells. Two studies in this review examined these interactions [ 23 62 62 ® 23 Streptococcus mitis Streptococcus oralis The construction of ligament periodontal tissue organoids presents challenges due to the complex cellular architecture and cell–matrix interactions. Most ( n 5 19 23 26 27 28 29 30 33 34 35 36 39 41 44 50 51 54 55 56 57 59 60 61 23 56 60 5 19 26 36 55 61 36 57 27 29 19 19 51 19 28 33 35 41 54 61 56 61 30 39 56 33 34 56 50 59 44 30 31 52 50 59 44 27 Although 3D cell culture systems have advanced significantly, they remain more complex and costly than traditional 2D cultures, especially when multiple cell lines are involved. This underscores the need for improved methodologies to enhance accessibility and efficiency. Despite these challenges, periodontal organoids hold immense potential to revolutionize tissue regeneration, personalized therapies, drug testing, and disease modeling by accurately mimicking the native periodontal environment. Furthermore, bioprinting has emerged as a promising tool to enhance organoid fabrication, allowing precise control over cell distribution, extracellular matrix composition, and scaffold architecture, ultimately improving tissue organization and functional integration [ 68 69 5. Conclusions In conclusion, this review highlights the predominant use of periodontal ligament cells and fibroblasts, with periodontal ligament stem cells being the most effective for organoid formation due to their multipotency, despite their limited differentiation potential into epithelial cells poses a challenge for fully replicating the heterogeneous periodontal tissue. Scaffolds, primarily biodegradable polymers like polycaprolactone and poly(L-lactide acid), and natural biomaterials such as collagen and chitosan, were essential for mimicking the extracellular matrix and supporting cellular functions. However, inconsistencies in methodologies, scaffold properties, and cellular responses underscore the need for standardized protocols. Future research should focus on optimizing biomaterials, integrating vascularization and immune components, and leveraging bioprinting technology to enhance organoid development. Despite current challenges, periodontal organoids hold significant potential for advancing tissue engineering, disease modeling, and personalized regenerative therapies. Acknowledgments The authors are grateful to Alan Alves Machado for graphical support and to the Centre for Craniofacial & Regenerative Biology, Faculty of Dentistry, Oral & Craniofacial Sciences, King’s College London, for insights. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, L.d.O.M., M.B.S., A.A.B., P.T.S. and A.C.C.C.; methodology, L.d.O.M., M.B.S., A.A.B. and A.C.C.C.; formal analysis, L.d.O.M., M.B.S., A.A.B. and A.C.C.C.; writing—original draft preparation, L.d.O.M., M.B.S. and A.C.C.C.; writing—review and editing, L.d.O.M., M.B.S., A.A.B., P.T.S. and A.C.C.C.; All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Jensen C. Teng Y. Is It Time to Start Transitioning From 2D to 3D Cell Culture? Front Mol. Biosci. 2020 7 33 10.3389/fmolb.2020.00033 PMC7067892 32211418 2. Kapałczyńska M. Kolenda T. Przybyła W. Zajączkowska M. Teresiak A. Filas V. Ibbs M. Bliźniak R. Łuczewski Ł. Lamperska K. 2D and 3D cell cultures—A comparison of different types of cancer cell cultures Arch. Med. Sci. 2016 14 910 919 10.5114/aoms.2016.63743 30002710 PMC6040128 3. Lampe K.J. Mooney R.G. Bjugstad K.B. Mahoney M.J. Effect of macromer weight percent on neural cell growth in 2D and 3D nondegradable PEG hydrogel culture J. Biomed. Mater. Res. A 2010 94 1162 1171 10.1002/jbm.a.32787 20694983 4. Roman V. Mihaila M. Radu N. Marineata S. Diaconu C.C. Bostan M. Cell Culture Model Evolution and Its Impact on Improving Therapy Efficiency in Lung Cancer Cancers 2023 15 4996 10.3390/cancers15204996 37894363 PMC10605536 5. Fraser D. Nguyen T. Benoit D.S.W. Matrix Control of Periodontal Ligament Cell Activity via Synthetic Hydrogel Scaffolds Tissue Eng. Part A 2021 27 733 747 10.1089/ten.tea.2020.0278 33107404 PMC8219191 6. McMurtrey R.J. Analytic Models of Oxygen and Nutrient Diffusion, Metabolism Dynamics, and Architecture Optimization in Three-Dimensional Tissue Constructs with Applications and Insights in Cerebral Organoids Tissue Eng. Part C Methods 2016 22 221 249 10.1089/ten.tec.2015.0375 26650970 PMC5029285 7. Rademakers T. Horvath J.M. Blitterswijk C.A. LaPointe V.L.S. Oxygen and nutrient delivery in tissue engineering: Approaches to graft vascularization J. Tissue Eng. Regen. Med. 2019 13 1815 1829 10.1002/term.2932 31310055 PMC6852121 8. Poornima K. Francis A.P. Hoda M. Eladl M.A. Subramanian S. Veeraraghavan V.P. El-Sherbiny M. Asseri S.M. Hussamuldin A.B.A. Surapaneni K.M. Implications of Three-Dimensional Cell Culture in Cancer Therapeutic Research Front. Oncol. 2022 12 891673 10.3389/fonc.2022.891673 35646714 PMC9133474 9. Hermans F. Hemeryck L. Bueds C. Torres Pereiro M. Hasevoets S. Kobayashi H. Lambrechts D. Lambrichts I. Bronckaers A. Vankelecom H. Organoids from mouse molar and incisor as new tools to study tooth-specific biology and development Stem Cell Rep. 2023 18 1166 1181 10.1016/j.stemcr.2023.03.011 PMC10202652 37084723 10. Cardoso B.D. Castanheira E.M.S. Lanceros-Méndez S. Cardoso V.F. Recent Advances on Cell Culture Platforms for In Vitro Drug Screening and Cell Therapies: From Conventional to Microfluidic Strategies Adv. Healthc. Mater. 2023 12 2202936 10.1002/adhm.202202936 36898671 PMC11468737 11. Biju T.S. Priya V.V. Francis A.P. Role of three-dimensional cell culture in therapeutics and diagnostics: An updated review Drug Deliv. Transl. Res. 2023 13 2239 2253 10.1007/s13346-023-01327-6 36971997 PMC10042111 12. Zheng L. Zhan Y. Wang C. Fan Q. Sun D. Li Y. Xiong Y. Technological advances and challenges in constructing complex gut organoid systems Front. Cell Dev. Biol. 2024 12 1432744 10.3389/fcell.2024.1432744 39206092 PMC11349554 13. Özkan A. LoGrande N.T. Feitor J.F. Goyal G. Ingber D.E. Intestinal organ chips for disease modelling and personalized medicine Nat. Rev. Gastroenterol. Hepatol. 2024 21 751 773 10.1038/s41575-024-00968-3 39192055 14. Liu S. Cheng C. Zhu L. Zhao T. Wang Z. Yi X. Yan F. Wang X. Li C. Cui T. Liver organoids: Updates on generation strategies and biomedical applications Stem Cell Res. Ther. 2024 15 244 10.1186/s13287-024-03865-3 39113154 PMC11304926 15. Mikawa R. Gotoh S. Past and future of alveolar organoids for lung regenerative medicine Stem Cells 2024 42 491 498 10.1093/stmcls/sxae024 38526067 16. Zhang X. Contessi Negrini N. Correia R. Sharpe P.T. Celiz A.D. Angelova Volponi A. Generating Tooth Organoids Using Defined Bioorthogonally Cross-Linked Hydrogels ACS Macro Lett. 2024 13 1620 1626 10.1021/acsmacrolett.4c00520 39532305 PMC11656705 17. Hemeryck L. Lambrichts I. Bronckaers A. Vankelecom H. Establishing Organoids from Human Tooth as a Powerful Tool Toward Mechanistic Research and Regenerative Therapy J. Vis. Exp. 2022 182 e63671 10.3791/63671 35499334 18. Sano T. Renn T.Y. Kanematsu T. Hsieh M.S. Hsu C.C. Chang W.J. Organoid in dentistry: Models for oral biology and disease J. Dent. Sci. 2025 20 1816 1823 10.1016/j.jds.2025.05.002 40654442 PMC12254863 19. Schweinitzer S. Kadousaraei M.J. Aydin M.S. Mustafa K. Rashad A. Measuring cell proliferation in bioprinting research Biomed. Mater. 2024 19 031001 10.1088/1748-605x/ad3700 38518363 20. Chang Y.T. Lai C.C. Lin D.J. Collagen Scaffolds Laden with Human Periodontal Ligament Fibroblasts Promote Periodontal Regeneration in SD Rat Model Polymers 2023 15 2649 10.3390/polym15122649 37376295 PMC10305005 21. Mahdi Souzani A. Rajeshwari H.R.S. Selvaganapathy P.R. Kishen A. Impact of 3D collagen-based model and hydrostatic pressure on periodontal ligament fibroblast: A morpho-biochemical analysis J. Mech. Behav. Biomed. Mater. 2023 147 106092 10.1016/j.jmbbm.2023.106092 37689009 22. Gauthier R. Attik N. Chevalier C. Salles V. Grosgogeat B. Gritsch K. Trunfio-Sfarghiu A.M. 3D Electrospun Polycaprolactone Scaffolds to Assess Human Periodontal Ligament Cells Mechanobiological Behaviour Biomimetics 2023 8 108 10.3390/biomimetics8010108 36975338 PMC10046578 23. Makkar H. Atkuru S. Tang Y.L. Sethi T. Lim C.T. Tan K.S. Sriram G. Differential immune responses of 3D gingival and periodontal connective tissue equivalents to microbial colonization J. Tissue Eng. 2022 13 204173142211116 10.1177/20417314221111650 PMC9340411 35923175 24. Ono T. Tomokiyo A. Ipposhi K. Yamashita K. Alhasan M.A. Miyazaki Y. Kunitomi Y. Tsuchiya A. Ishikawa K. Maeda H. Generation of biohybrid implants using a multipotent human periodontal ligament cell line and bioactive core materials J. Cell. Physiol. 2021 236 6742 6753 10.1002/jcp.30336 33604904 25. Zou R. Wu S. Wang Y. Kang X. Zhao S. Shi H. Zheng D. Gao B. Ma S. Niu L. Role of integrinlinked kinase in static compressive stressinduced autophagy via phosphatidylinositol 3 kinase in human periodontal ligament cells Int. J. Mol. Med. 2021 48 167 10.3892/ijmm.2021.5000 34278436 PMC8285053 26. Kim M.G. Park C.H. The Topographical Optimization of 3D Microgroove Pattern Intervals for Ligamentous Cell Orientations: In Vitro Int. J. Mol. Sci. 2020 21 9358 10.3390/ijms21249358 33302558 PMC7763543 27. Firth F.A. Milne T.J. Seo B. Farella M. An in-vitro mechanical strain three-dimensional culture model: Periodontal ligament cell viability, apoptosis, and endoplasmic reticulum stress response Eur. J. Oral Sci. 2020 128 120 127 10.1111/eos.12681 32141124 28. Saminathan A. Vinoth K.J. Low H.H. Cao T. Meikle M.C. Engineering three-dimensional constructs of the periodontal ligament in hyaluronan–gelatin hydrogel films and a mechanically active environment J. Periodontal Res. 2013 48 790 801 10.1111/jre.12072 23581542 29. Hegedűs O. Juriga D. Sipos E. Voniatis C. Juhász Á. Idrissi A. Zrínyi M. Varga G. Jedlovszky-Hajdú A. Nagy K.S. Free thiol groups on poly(aspartamide) based hydrogels facilitate tooth-derived progenitor cell proliferation and differentiation PLoS ONE 2019 14 e0226363 10.1371/journal.pone.0226363 31856233 PMC6922333 30. Yan X. van den Beucken J. Yuan C. Jansen J. Yang F. Spheroid formation and stemness preservation of human periodontal ligament cells on chitosan films Oral Dis. 2018 24 1083 1092 10.1111/odi.12855 29514415 31. Mino C. Iwata T. Kawata T. Adhesion of human periodontal ligament cells by three-dimensional culture to the sterilized root surface of extracted human teeth J. Oral Sci. 2017 59 365 371 10.2334/josnusd.16-0501 28904312 32. Liao W. Okada M. Inami K. Hashimoto Y. Matsumoto N. Cell survival and gene expression under compressive stress in a three-dimensional in vitro human periodontal ligament-like tissue model Cytotechnology 2016 68 249 260 10.1007/s10616-014-9775-3 25087076 PMC4754250 33. An S. Gao Y. Ling J. Characterization of human periodontal ligament cells cultured on three-dimensional biphasic calcium phosphate scaffolds in the presence and absence of L-ascorbic acid, dexamethasone and β-glycerophosphate in vitro Exp. Ther. Med. 2015 10 1387 1393 10.3892/etm.2015.2706 26622495 PMC4578067 34. Alves L.B. Mariguela V.C. Grisi M.F.d.M. Souza S.L.S.d. Novaes Junior A.B. Taba Junior M. de Oliveira P.T. Palioto D.B. Expression of osteoblastic phenotype in periodontal ligament fibroblasts cultured in three-dimensional collagen gel J. Appl. Oral Sci. 2015 23 206 214 10.1590/1678-775720140462 26018313 PMC4428466 35. Yamada R. Kitajima K. Arai K. Igarashi M. Cytokeratin expression of engrafted three-dimensional culture tissues using epithelial cells derived from porcine periodontal ligaments J. Oral Pathol. Med. 2014 43 637 645 10.1111/jop.12183 24762372 36. Heckler A.F. Mirzaei Z. Pereira I. Simmons C.A. Gong S.G. Development of a three-dimensional in vitro model system to study orthodontic tooth movement Arch. Oral Biol. 2013 58 1498 1510 10.1016/j.archoralbio.2013.06.011 23845751 37. Liao W. Okada M. Sakamoto F. Okita N. Inami K. Nishiura A. Hashimoto Y. Matsumoto N. In vitro human periodontal ligament-like tissue formation with porous poly-l-lactide matrix Mater. Sci. Eng. C 2013 33 3273 3280 10.1016/j.msec.2013.04.008 23706210 38. Hoz L. Romo E. Zeichner-David M. Sanz M. Nuñez J. Gaitán L. Mercado G. Arzate H. Cementum protein 1 (CEMP1) induces differentiation by human periodontal ligament cells under three-dimensional culture conditions Cell Biol. Int. 2012 36 129 136 10.1042/CBI20110168 21929512 39. Oortgiesen D.A.W. Yu N. Bronckers A.L.J.J. Yang F. Walboomers X.F. Jansen J.A. A Three-Dimensional Cell Culture Model to Study the Mechano-Biological Behavior in Periodontal Ligament Regeneration Tissue Eng. Part C Methods 2012 18 81 89 10.1089/ten.tec.2011.0367 21913838 PMC3262976 40. Jang Y.J. Jung I.H. Park J.C. Jung U.W. Kim C.S. Lee Y.K. Kim C.-K. Choi S.-H. Effect of seeding using an avidin-biotin binding system on the attachment of periodontal ligament fibroblasts to nanohydroxyapatite scaffolds: Three-dimensional culture J. Periodontal Implant Sci. 2011 41 73 78 10.5051/jpis.2011.41.2.73 21556257 PMC3087078 41. Berahim Z. Moharamzadeh K. Rawlinson A. Jowett A.K. Biologic Interaction of Three-Dimensional Periodontal Fibroblast Spheroids With Collagen-Based and Synthetic Membranes J. Periodontol. 2011 82 790 797 10.1902/jop.2010.100533 21080786 42. Akman A.C. Tığlı R.S. Gümüşderelioğlu M. Nohutcu R.M. bFGF-loaded HA-chitosan: A promising scaffold for periodontal tissue engineering J. Biomed. Mater. Res. A 2010 92 953 962 10.1002/jbm.a.32428 19291690 43. Liao F. Chen Y. Li Z. Wang Y. Shi B. Gong Z. Cheng X. A novel bioactive three-dimensional β-tricalcium phosphate/chitosan scaffold for periodontal tissue engineering J. Mater. Sci. Mater. Med. 2010 21 489 496 10.1007/s10856-009-3931-x 19908128 44. Peng L. Cheng X. Zhuo R. Lan J. Wang Y. Shi B. Li S. Novel gene-activated matrix with embedded chitosan/plasmid DNA nanoparticles encoding PDGF for periodontal tissue engineering J. Biomed. Mater. Res. A 2009 90 564 576 10.1002/jbm.a.32117 18563823 45. Zhang Y.F. Cheng X.R. Chen Y. Shi B. Chen X.H. Xu D.X. Ke J. Three-dimensional Nanohydroxyapatite/Chitosan Scaffolds as Potential Tissue Engineered Periodontal Tissue J. Biomater. Appl. 2007 21 333 349 10.1177/0885328206063853 16543282 46. Lee Y. Nahm D. Jung Y. Choi J. Kim S.G. Cho M. Kim M.-H. Chae C.-H. Kim S.-G. Differential Gene Expression of Periodontal Ligament Cells After Loading of Static Compressive Force J. Periodontol. 2007 78 446 452 10.1902/jop.2007.060240 17335367 47. Wang Y. Xia H. Zhao Y. Jiang T. Three-Dimensional Culture of Human Periodontal Ligament Cells on Highly Porous Polyglycolic Acid Scaffolds in vitro Proceedings of the 2005 IEEE Engineering in Medicine and Biology 27th Annual Conference Shanghai, China 1–4 September 2005 IEEE Piscataway, NJ, USA 2005 4908 4911 10.1109/IEMBS.2005.1615573 17281343 48. Phuegyod S. Pramual S. Wattanavichean N. Assawajaruwan S. Amornsakchai T. Sukho P. Svasti J. Surarit R. Niamsiri N. Microbial Poly(hydroxybutyrate-co-hydroxyvalerate) Scaffold for Periodontal Tissue Engineering Polymers 2023 15 855 10.3390/polym15040855 36850140 PMC9962980 49. Liang Y. Shakya A. Liu X. Biomimetic Tubular Matrix Induces Periodontal Ligament Principal Fiber Formation and Inhibits Osteogenic Differentiation of Periodontal Ligament Stem Cells ACS Appl. Mater. Interfaces 2022 14 36451 36461 10.1021/acsami.2c09420 35938610 PMC10041666 50. Yasunaga M. Ishikawa H. Tamaoki S. Maeda H. Ohno J. Embedded Human Periodontal Ligament Stem Cells Spheroids Enhance Cementogenic Differentiation via Plasminogen Activator Inhibitor 1 Int. J. Mol. Sci. 2022 23 2340 10.3390/ijms23042340 35216454 PMC8878532 51. Tian Y. Liu M. Liu Y. Shi C. Wang Y. Liu T. Huang Y. Zhong P. Dai J. Liu X. The performance of 3D bioscaffolding based on a human periodontal ligament stem cell printing technique J. Biomed. Mater. Res. A 2021 109 1209 1219 10.1002/jbm.a.37114 33021062 52. Shi H. Zong W. Xu X. Chen J. Improved biphasic calcium phosphate combined with periodontal ligament stem cells may serve as a promising method for periodontal regeneration Am. J. Transl. Res. 2018 10 4030 4041 30662648 PMC6325501 53. Lee C.H. Hajibandeh J. Suzuki T. Fan A. Shang P. Mao J.J. Three-Dimensional Printed Multiphase Scaffolds for Regeneration of Periodontium Complex Tissue Eng. Part A 2014 20 1342 1351 10.1089/ten.tea.2013.0386 24295512 PMC3993023 54. Dabija-Wolter G. Bakken V. Cimpan M.R. Johannessen A.C. Costea D.E. In vitro reconstruction of human junctional and sulcular epithelium J. Oral Pathol. Med. 2013 42 396 404 10.1111/jop.12005 22947066 PMC3664418 55. Zanna N. Focaroli S. Merlettini A. Gentilucci L. Teti G. Falconi M. Tomasini C. Thixotropic Peptide-Based Physical Hydrogels Applied to Three-Dimensional Cell Culture ACS Omega 2017 2 2374 2381 10.1021/acsomega.7b00322 30023662 PMC6044849 56. Hillmann G. Gebert A. Geurtsen W. Matrix expression and proliferation of primary gingival fibroblasts in a three-dimensional cell culture model J. Cell Sci. 1999 112 2823 2832 10.1242/jcs.112.17.2823 10444377 57. Lin H.H. Chao P.H.G. Tai W.C. Chang P.C. 3D-Printed Collagen-Based Waveform Microfibrous Scaffold for Periodontal Ligament Reconstruction Int. J. Mol. Sci. 2021 22 7725 10.3390/ijms22147725 34299345 PMC8307958 58. Chu J. Pieles O. Pfeifer C. Alt V. Morsczeck C. Docheva D. Dental follicle cell differentiation towards periodontal ligament-like tissue in a self-assembly three-dimensional organoid model Eur. Cells Mater. 2021 42 20 33 10.22203/eCM.v042a02 34251657 59. Jin Q.-M. Zhao M. Webb S.A. Berry J.E. Somerman M.J. Giannobile W.V. Cementum engineering with three-dimensional polymer scaffolds J. Biomed. Mater. Res. A 2003 67 54 60 10.1002/jbm.a.10058 14517861 PMC2581746 60. Reuther T. Kohl A. Komposch G. Tomakidi P. Morphogenesis and proliferation in mono- and organotypic co-cultures of primary human periodontal ligament fibroblasts and alveolar bone cells Cell Tissue Res. 2003 312 189 196 10.1007/s00441-003-0717-1 12690441 61. Hamano T. Teramoto A. Iizuka E. Abe K. Effects of polyelectrolyte complex (PEC) on human periodontal ligament fibroblast (HPLF) function. I. Three-dimensional structure of HPLF cultured on PEC J. Biomed. Mater. Res. 1998 41 257 269 10.1002/(SICI)1097-4636(199808)41:2&#x0003c;257::AID-JBM11&#x0003e;3.0.CO;2-I 9638531 62. Golda A. Gasiorek A. Dobosz E. Oruba Z. Lamont R.J. Potempa J. Koziel J. Organotypic model of the gingiva for studying bacterial and viral pathogens implicated in periodontitis J. Oral Microbiol. 2024 16 2292382 10.1080/20002297.2023.2292382 38456121 PMC10919308 63. Jeong Y.Y. Kim M.S. Lee K.E. Nam O.H. Jang J.H. Choi S.C. Lee H.S. Comparison of 2- and 3-Dimensional Cultured Periodontal Ligament Stem Cells; a Pilot Study Appl. Sci. 2021 11 1083 10.3390/app11031083 64. Marsee A. Roos F.J.M. Verstegen M.M.A. Gehart H. de Koning E. Lemaigre F. Forbes S.J. Peng W.C. Huch M. Takebe T. Building consensus on definition and nomenclature of hepatic, pancreatic, and biliary organoids Cell Stem Cell 2021 28 816 832 10.1016/j.stem.2021.04.005 33961769 PMC11699540 65. Wu Y. Li X. Liu H. Yang X. Li R. Zhao H. Shang Z. Organoids in the oral and maxillofacial region: Present and future Int. J. Oral Sci. 2024 16 61 10.1038/s41368-024-00324-w 39482304 PMC11528035 66. Huang X. Wang H. Wang C. Cao Z. The Applications and Potentials of Extracellular Vesicles from Different Cell Sources in Periodontal Regeneration Int. J. Mol. Sci. 2023 24 5790 10.3390/ijms24065790 36982864 PMC10058679 67. Lancaster M.A. Knoblich J.A. Generation of cerebral organoids from human pluripotent stem cells Nat. Protoc. 2014 9 2329 2340 10.1038/nprot.2014.158 25188634 PMC4160653 68. Nuñez J. Vignoletti F. Caffesse R.G. Sanz M. Cellular therapy in periodontal regeneration Periodontology 2000 79 107 116 10.1111/prd.12250 30892768 69. Schroeder H.E. Listgarten M.A. The gingival tissues: The architecture of periodontal protection Periodontology 2000 13 91 120 10.1111/j.1600-0757.1997.tb00097.x 9567925 Figure 1 Flowchart of the literature search and selection of the included studies. References were selected in a two-phase process. Electronic databases (PubMed and SCOPUS) were searched up to June 2024. Figure 2 Venn diagram concerning the cell types, origin, and groups employed for organoid construction. Cell lineages employed for organoid construction included alveolar bone cells ( n n n n n n n n n n n n n n n n n Figure 3 Venn diagram demonstrating the extracellular matrix component used for organoid fabrication. Figure 4 Methods used for organoid preparation. ( A B Figure 5 Venn diagram demonstrating findings concerning ( A B C A B dentistry-13-00422-t001_Table 1 Table 1 Summary of descriptive characteristics of included studies on the solid scaffolds category ( n Author Cell Lineage Extracellular Matrix Composition Organoid Preparation Characterization Results Main Findings Gauthier, et al. (2023) 22 Periodontal ligament cells Fibrous polycaprolactone scaffold Cells were seeded into the scaffolds after their synthetize through electrospinning.  - Mechanical characterization - Confocal microscopy - ALP - Inflammatory biomarkers  - In static culture, surface cell networks were observed with increased ALP and IL6 expression. - In dynamic culture, fewer surface cells were present with decreased ALP and IL6 expression. - Stiffness decreased in both conditions. Polycaprolactone was a suitable material to mimic the periodontal ligament collagen bundles. Phuegyod, et al. (2023) 48 Gingival fibroblasts Poly(hydroxybutyrate-co-hydroxyvalerate) scaffold The scaffolds were prepared as a cylindrical shape, and cells were seeded later.  - Compressive mechanical analysis - Protein absorption - Cell proliferation  - P(HB50HV) scaffolds were different in compressive modulus and had the lowest stiffness among all scaffolds. - HGF and PDLSC adhered to the scaffold and exhibited the highest proliferation. Microbial-derived P(HB-50HV) scaffold can be used as a biomaterial for periodontal tissue engineering and stem cell applications. Ono, et al. (2021) 24 Periodontal ligament cells Tubular scaffold with titanium and hydroxyapatite core Single-cell spheroids were picked and inserted into the 3D positions of the needle array to form a pre-designed 3D tubular model.  - RTPCR - H&E - Immunohistochemical staining - Masson’s staining - Picrosirius red - Immunofluorescence - Cell distribution  - Angiogenesis, cementum, and - bonerelated genes increased in the three complexes compared with - monolayercultured cells. - Abundant collagen fibers for the above markers were confirmed in the three complexes. Exhibited high cell viability, included abundant collagen fibers, and expressed factors strongly associated with PDL tissue. Lin, et al. (2021) 57 Immortalized periodontal ligament cells 3D-printed collagen-based scaffold Cells were seeded onto the collagen microfibrous scaffolds.  - Live/Dead assay - DAPI cell counting - RTPCR  - Collagenbased microfibers were successfully fabricated. - Cytoskeleton expansion, adhesion, and viability were greater. - Cyclin D, Ecadherin, and periostin were upregulated on the waveform microfibers. Preserved cell viability and promoted healing and regeneration under shear stress. Kim, et al. (2020) 26 Periodontal ligament cells 3D-printed poly-ε-caprolactone scaffold Poly-ε-caprolactone solution was cast into the support material mold. Cells were seeded into all scaffolds.  - Surface characterizations - Immunofluorescence  - Four microgroove intervals fabricated. - Highest alignment at 25 µm grooves; alignment decreased with smaller intervals. - Greater elongation and lower circularity at 25 and 19 µm compared to 12 and 6 µm. - Lowresolution grooves guided cells better than smooth highresolution surfaces. Controllable microgroove intervals can specifically organize human PDL cells by 3D printing. Shi, et al. (2018) 52 Periodontal ligament stem cells Porous β-tricalcium phosphate and hydroxyapatite scaffold Cell suspension was dropped onto the BCP by means of the pipetting technique.  - Immunohistochemical staining - Osteogenic differentiation - Cell seeding - Immunofluorescence - MicroCT - Masson staining  - PDLSC were positive for STRO1 and vimention, while negative for cytokeratin. - PDLSC had the capacity to undergo osteogenic differentiation in vitro. - When seeded on the BCP, PDLSC exhibited great viability. The incorporation of PDLSC and the improved BCP significantly restored the lost periodontium. BCP is one of promising bioactive materials for periodontal tissue regeneration. Yan, et al. (2018) 30 Periodontal ligament cells Chitosan film scaffold Chitosan scaffold was prepared, and the cells were seeded.  - Live/Dead - RTPCR - Colonyforming efficiency - ALP - Calcium content  - Decreased proliferation upon spheroid formation. - Expression of genes was significantly higher comparison with cells cultured in a monolayer. Compared to cells cultured in monolayer, periodontal ligament cells did not proliferate, but exhibited higher self-renewal gene expression, colony-forming unit, and osteogenic capacity. Liao, et al.(2016) 32 Periodontal ligament fibroblasts Porous poly(L-lactide) scaffold Cells were seeded and centrifuged into a round-shaped PLLA matrix.  - Compressive mechanical analysis - SEM - Caspase3/7 activity - RTPCR  - High viability up to 14 days. - RANKL/BMP2 load and timedependent peaks. - ALP/PLAP1 increased at low load (5 g/cm 2 - FGF2 and OPG show a timedependent increase. - COL1 progressive rise over time. The in vitro hPdLLT model system effectively mimicked the reaction and gene expression of the human periodontal ligament in response to orthodontic force. An, et al. (2015) 33 Periodontal ligament cells β-tricalcium phosphate and hydroxyapatite scaffold Cells were seeded on the scaffolds.  - Alizarin red - Cell proliferation - SEM - ALP - RTPCR  - Good proliferation and survival on collagen scaffold. - Fibroblastlike alignment within scaffold. - Increased COL1, ALP, and CEMP1. - Positive Alizarin red staining. Three-dimensional porous BCP scaffolds can stimulate the osteoblastic differentiation of hPDLC in the presence and absence of osteogenic inducer. Lee, et al. (2014) 53 Dental pulp stem cells 3D-printed poly(caprolactone)-hydroxyapatite scaffold PCL/HA scaffolds were fabricated, and the cells were seeded.  - RTPCR - Histomorphometric analysis - Immunohistochemical staining  - Cells maintained fibroblastlike shape and spread well. They demonstrated high survival and proliferation within dECM. - Upregulation of COL1, ALP, and periostin. - Positive calcium deposition. Method for the regeneration of multiphase periodontal tissues by spatiotemporal delivery of multiple proteins. Liao, et al. (2013) 37 Periodontal ligament fibroblasts Porous poly(L-lactide) scaffold PLLA matrix was prepared, and the cells were seeded.  - SEM - Cell proliferation - Picrosirius red - RTPCR - ALP  - High survival and compact spheroid formation. - Expression of NANOG, OCT4, and SOX2. - Upregulation of osteogenic and cementogenic markers. - Positive calcium deposition. The results indicated in vitro human periodontal ligament-like tissue, and it could be used in future periodontal ligament tissue engineering. Jang, et al. (2011) 40 Periodontal ligament fibroblasts Nanohydroxyapatite scaffold with avidin biotin binding system Cells were loaded onto the scaffolds.  - SEM  - ABBS method showed significantly higher fibroblast attachment to nHA scaffolds than static or agitation methods. - SEM showed no significant differences among groups. - Adhesion strength improved with ABBS. The high-affinity ABBS enhances the ability of periodontal ligament fibroblasts to attach to three-dimensionally constructed n-HA scaffolds. Berahim, et al. (2011) 41 Periodontal ligament fibroblasts Collagen and poly(glycolic acid)-based membrane Membrane squares were placed, and periodontal spheroids were pipetted into each ring.  - Alamar Blue - Immunohistochemical staining - SEM  - Adhesion and proliferation were higher on collagen than PGA. - The activity of cells increased on both, but collagen was superior until day 15. - The protein expression of collagen I, periostin, and Runx2 on both, but it was stronger on collagen. Were able to Akman, et al. (2010) 42 Periodontal ligament cells Chitosan and hydroxyapatite scaffold loaded with basic fibroblast growth factor Porous chitosan scaffolds were prepared, and the cells were added drop-by-drop with a micropipette.  - MTT - Von Kossa - ALP  - Growth factor release was sustained up to 7 days and lasted longer in HAchitosan. - Cell proliferation was enhanced in both PDL cells and cementoblasts, with the highest levels observed in HAchitosan with bFGF. - Mineralization and ALP activity were stronger in bFGFloaded HAchitosan than in chitosan. bFGF-loaded HA-chitosan scaffolds supported the cellular structure, proliferation, and mineralization. Liao, et al. (2010) 43 Periodontal ligament cells β-tricalcium phosphate and chitosan scaffold Cell suspensions were seeded into each scaffold.  - SEM - Confocal microscopy - MTT - RTPCR - H&E - Immunohistochemical staining - Modified Gomori’s ALP  - βTCP/chitosan scaffold showed higher cell adhesion, proliferation, and migration than pure chitosan. - Upregulated BSP and CAP expression in vitro and increased ALP and OPN expression in vivo. - Vascular ingrowth and ECM formation indicated enhanced differentiation. The scaffold could promote the differentiation of hPDLC towards osteoblast and cementoblast phenotypes. Peng, et al. (2009) 44 Periodontal ligament cells Chitosan and collagen scaffold Chitosan/collagen composite scaffold was prepared, and the cell suspension was added.  - SEM - Hoechst 33258 - MTT - Luciferase reporter gene assay - Histomorphometrical analysis  - Chitosan/collagen GAM with PDGF nanoparticles sustained DNA release for over six weeks. - Enhanced PDL cell adhesion, proliferation, and tissuelike structure formation. - PDGF expression and cell density were significantly higher than with naked plasmid scaffolds. -PDLC achieved high proliferation and maintained a fibroblast figure, and the periodontal connective tissue-like structure formed in the scaffolds. Zhang, et al. (2007) 45 Periodontal ligament cells Porous nanohydroxyapatite and chitosan scaffold HA/chitosan composites were mixed, and cells were suspended and poured onto each scaffold.  - MTT - SEM - ALP - RTPCR - Confocal microscopy - H&E  - 1% HA/chitosan scaffold showed better cytocompatibility than pure chitosan. - Enhanced PDL cell adhesion, proliferation, and expression of type I collagen and ALP. - Scaffold supported vascular ingrowth, ECM formation, and slower degradation in vivo. 1% HA/chitosan scaffold had potential applications as biomaterials in periodontal tissue Wang, et al. (2005) 47 Periodontal ligament cells Poly(glycolic acid) scaffold PGA scaffolds were prepared and PDL cells were seeded.  - SEM - Immunohistochemical staining  - PGA scaffolds supported strong adhesion and proliferation. - PDL cells secreted abundant extracellular matrix and expressed type I collagen. May serve as a viable approach for promoting periodontal tissue regeneration and provides a possibility of PDL regeneration on dental implants. Jin, et al. (2003) 59 Cementoblasts Poly(lactic- co Scaffolds were prepared, and cells were added.  - RTPCR - Immunohistochemical staining - Histomorphometric analysis  - PLGA scaffolds supported adhesion of cementoblasts, PDL cells, and follicle cells. - Only cementoblastseeded scaffolds promoted mineral formation. - OCCM/PLGA scaffolds expressed collagen I, collagen XII, BSP, and osteocalcin and showed progressive mineralization in vivo. Delivery of selected cells via PLGA scaffolds may serve as a viable approach for promoting periodontal tissue regeneration. Hillmann, et al. (1999) 56 Gingival fibroblasts Polyester with polypropylene scaffold coated with fibronectin Polyester with polypropylene scaffold was pretreated and coated with fibronectin. Cells were seeded onto the polyester mesh.  - H&E - ELISA - ALP - Immunoelectron microscopy - Scanning electron microscopy (SEM) - Confocal microscopy - TEM - Hemalum staining  - Scaffold showed uniform porosity, good biocompatibility, and supported PDL cell adhesion and proliferation. - Cells expressed type I collagen and fibronectin. - Scaffold promoted new bone, cementum, and PDL formation in vivo. A dynamic model for performing studies on the interactions of cultured cells with extracellular matrix molecules, the pathogenesis of inflammatory processes, and the interactions with biomaterials. Hamano, et al. (1998) 61 Periodontal ligament fibroblast Polyelectrolyte complex Both the polyanions and the synthetic polycations were dissolved and mixed. Cells were seeded later.  - SEM - Alizarin red - Phase contrast microscopy  - Polyelectrolyte complexes (PECs) modulated PDL fibroblast morphology, proliferation, and differentiation. - PECs with carboxymethyl groups induced cell aggregation, 3D structures, and mineralization. - PECs with sulfate groups promoted spreading and proliferation without mineralization. PECs affected the cell cycle and promoted proliferation and differentiation of hPLF. dentistry-13-00422-t002_Table 2 Table 2 Summary of descriptive characteristics of included studies on the hydrogel category ( n Author Cell Lineage Extracellular Matrix Composition Organoid Preparation Characterization Results Main Findings Schweinitzer, et al. (2024) 19 Periodontal ligament fibroblasts Gelatin methacryloyl (GelMA ® Cells were mixed into the hydrogels.  - Live/Dead - Alamar Blue - Cell proliferation - DAPI cell counting  - Fibroblasts spread and proliferated in GelMA but remained rounded with reduced growth in alginate. - Alamar Blue overestimated proliferation compared to PicoGreen. - Image analysis confirmed viability but was less accurate. Discrepancies between these assays, attributable to their mechanisms of action and their different protocols. Chang. (2023) 20 Periodontal ligament fibroblasts Collagen hydrogels Cells were mixed into the hydrogels.  - Strain test - Live/Dead assay - AlphaSMA - ALP - Histomorphometric analysis  - Good strength and supported cell differentiation into myofibroblasts and preosteoblasts. - Reduced epithelial downgrowth, residual bone defects, and promoted welloriented PDL and alveolar bone regeneration in vivo. Periodontal tissue regeneration was achieved. Hydrogels incorporating cells were superior compared to hydrogels. Hermans, et al. (2023) 9 Dental epithelium stem cells Hydrogels (Matrigel ® Cells seeded into the hydrogel droplets  - Immunohistochemical staining - EdU incorporation - TEM - RTPCR - RNAseq - Organoid survival - Differentiation potential  - Organoids showed longterm expandability and expression of dental stem cell markers. - Differentiated into ameloblastlike cells and, when combined with pulp stem cells, also into odontoblastand cementoblastlike cells. - Capacity to survive and maintain differentiation in vivo. A valuable tool to study mouse tooth DE/DESC, dental epithelial–mesenchymal interactions, and AB/JE differentiation while allowing further elucidation of tooth-type-specific features. Liang, et al. (2022) 49 Periodontal ligament stem cells Nanofibrous gelatin Scaffold synthetized through electrospinning, and cells were seeded onto gelatin scaffolds.  - Cell proliferation - Cell adhesion - Cell migration - Immunofluorescence - Picrosirius red - Alizarin red - Yap1 and Twist1 inhibition - RTPCR - RNAseq  - PDLSC migration and alignment, leading to wellorganized PDLlike fiber bundles with expression of collagen I, collagen III, and periostin. - Inhibited osteogenic differentiation by downregulating OCN, Runx2, and Sp7 through the Yap1/Twist1 pathway. Tubular matrix mimicked the physical architecture and chemical compositions of the ECM of PDL, controlled and aligned PDLSC migration inside the tubules, and inhibited the osteogenesis. Yasunaga, et al. (2022) 50 Periodontal ligament stem cells Collagen hydrogel The prepared collagen gel mixtures were applied, and the spheroids transferred to the mixtures in the plates.  - Western blot - Immunohistochemical staining - ALP - Alizarin red  - Showed enhanced cementogenic differentiation with strong upregulation of CEMP1 and CAP. - Interacted with collagen ECM, disaggregated, and promoted cell migration, leading to higher cementoblastic differentiation than 2D or untreated 3D cultures. RhPAI-1 treatment of embedded hPLSC spheroids enhanced the cementogenic. Tian, et al. (2021) 51 Periodontal ligament stem cells Sodium alginate, gelatin, and nano-hydroxyapatite mixed into a hydrogel The hydrogels were prepared, and cell was added.  - Live/Dead assay - Cell adhesion - Cell proliferation - ALP  - Improved mechanical strength, lower swelling, and good porosity compared to SA alone. - PDLSC demonstrated high viability, stronger adhesion, and enhanced proliferation. - ALP activity and osteogenic differentiation were significantly higher in the composite scaffold. Hydrogels showed effective stimulation for cell survival, proliferation, and osteoblast differentiation. Fraser, et al. (2021) 5 Periodontal ligament cells Poly(ethylene glycol) One-milliliter syringe was used as a hydrogel mold. Cells were pipetted into cylindrical syringe molds and formed under UV light for 3 min.  - Cell viability - Cell proliferation - RTPCR - ALP - Immunocytochemical staining - Volume and sphericity - ECM mineralization  - Showed interconnected porous structures and good biocompatibility. - Enhanced cell adhesion, spreading, and proliferation, and significantly upregulated osteogenic markers ALP, Runx2, and OCN. - Promoted new bone formation in vivo. Hydrogels expressed key PDL matrix genes but did not the mineralization. Zou, et al. (2021) 25 Periodontal ligament cells Collagen–alginate hydrogel Type I collagen solution, DMEM, sodium alginate solution, CaSO 4,  - DAPI - Transduction of ILK short hairpin (shRNA) lentiviral vectors - PI3K - Immunofluorescence - RTPCR - Western blot  - High viability, spreading, and proliferation. - ALP activity increased. - Mineralization occurred mainly in stiffer degradable hydrogels with inductive media. The static compressive stress can induce autophagy in hPDLC regulated by ILK and PI3K and upregulate ILK expression in a PI3K-dependent manner. Firth, et al. 27 Periodontal ligament cells Thiol-modified hyaluronan–gelatin, poly(ethylene glycol) diacrylate cross-linked hydrogel The cells were seeded on thiol-modified hyaluronan–gelatin, polyethylene glycol diacrylate (PEGDA) cross-linked hydrogel.  - Cell viability - Caspase 3/7 activity - RTPCR  - Reduced viability without increasing caspase3/7 activity. - CREB3L3 and ERN2 were upregulated. Three-dimensional mechanical strain PDL cell culture models offer a method to study the role of endoplasmic reticulum stress and unfolded protein response (UPR). Saminathan, et al. (2013) 28 Periodontal ligament cells Hyaluronan–gelatin hydrogel film Glycosil and Gelin-S were mixed and PDL cells added.  - Cell viability - Cell proliferation - RTPCR - ELISA  - PDL cells organized into bilayers and maintained high viability. - CTGF and FGF2 enhanced proliferation. - Multiple genes, including RUNX2, COL1A1, COL3A1, MMPs, TIMP1, TGFB1, and OPG, were upregulated, while RANKL remained stable. Cells organized into a bilayer and stimulated cell proliferation. Hegedűs, et al. (2019) 29 Periodontal ligament cells Poly(aspartamide)-based hydrogel The poly(aspartamide) gel discs were prepared, and the cells were seeded.  - Cell viability - Phase contrast microscopic - ALP  - PDLC attached, proliferated with higher viability. - Free thiol groups promoted adhesion, longterm proliferation, and migration into the matrix. - High thiol density enhanced spontaneous and induced osteogenic differentiation, with increased ALP activity. PDLC attaches and grows on hydrogels. Zanna, et al. (2017) 55 Gingival fibroblasts Pseudopeptides gelators containing the d-Oxd or the d-pGlu [Oxd = (4R,5S)-4-methyl-5-carboxyl-oxazolidin-2-one, pGlu = pyroglutamic acid] moiety and selected amino acids hydrogel The mixture was stirred until gel formation, and the cells were seeded.  - Rheological analyses - Lactate dehydrogenase (LDH) assay - NAD(P)Hdependent cellular oxidoreductase mitochondrial enzyme activity  - Strong mechanical properties, injectability, and rapid recovery after shear stress. - High viability and proliferation over 7 days, with gelator toxicity eliminated upon selfassembly. Hydrogels allow the growth of encapsulated cells with very good viability. Mino, et al. (2017) 31 Periodontal ligament cells Mebiol Gel (hydrogel) hPDLC cells were mixed with Mebiol Gel.  - ALP - Surface characterization - SEM - Cell adhesion - MTT  - Cells adhered to sterilized root surfaces in 3D culture, forming projections and starshaped morphology. - ALP activity increased in calcification medium, and mineralized nodules appeared from day 4. - MTT assay confirmed a tenfold increase in cell activity by day 21 PDL cells can adhere to sterile root surfaces and can serve as scaffolds for PDL regeneration Heckler, et al. (2013) 36 Periodontal ligament fibroblasts Type I bovine collagen hydrogel hPDLF cells were mixed with sterile PureCol (type I bovine collagen\n) and\npolymerized.  - Finite element analysis - Live/Dead assay - PicoGreen - Gel contraction - Picrosirius red  - High viability, proliferation, and contractility up to 14 days. - Collagen fibers became reorganized and aligned, mimicking in vivo PDL. - Application of tensile forces maintained cell viability and increased DNA content, while compressive forces led to decreased proliferation. 3D model of orthodontic tooth movement offers promise for use as a model system in future studies. Oortgiesen, et al. (2012) 39 Periodontal ligament fibroblasts Type I rat collagen hydrogel Cells were mixed with collagen hydrogel.  - Mechanical stimulation - Cell distribution - Cell orientation - Cell number analysis - RTPCR  - Cells remained randomly oriented, while mechanical loading increased cell numbers and induced perpendicular alignment to strain. - EMD enhanced proliferation and upregulated BSP and collagen I but downregulated Runx2. 3D model to mimic an authentic PDL space, and it also provided a useful and well-controlled approach to study cell response to mechanical loading and other stimuli. dentistry-13-00422-t003_Table 3 Table 3 Summary of descriptive characteristics of included studies on protein-based category ( n Author Cell Lineage Extracellular Matrix Composition Organoid Preparation Characterization Results Main Findings Golda, 62 Telomerase-immortalized gingival keratinocytes Hydrogel Gingival fibroblasts were mixed with hydrogel. Then, keratinocytes were added to the top.  - Immunohistochemical staining - Confocal microscopy - RTPCR - Titration techniques - Colonyforming  - P. gingivalis - HSV1 showed efficient replication with a peak at 72 h. - Metronidazole reduced bacteria and acyclovir reduced virus, most effective when applied early. - P. gingivalis The OTG model resembled the morphology of the human gingiva; the pathogens penetrated deep into the tissue, forming a biofilm on the cell surface. Mahdi Souzani, et al. (2023) 21 P\neriodontal ligament\nfibroblasts Bovine type I collagen Cells were mixed into bovine type I collagen  - Immunohistochemical staining - TEM - SEM - Protein expression  - Homogeneous hPDLF distribution, spindlelike morphology, and higher Factin and periostin expression. - Thicker bundled fibers and stronger cell–matrix interaction. - High pressure reduced cell distribution, induced multinucleated cells, and increased RANKL/OPG expression. This is the first to investigate the effect of hydrostatic pressure on a 3D model of hPDLF, showing that low pressure promotes even distribution of cells and greater expression of F-actin and periostin, while high or no pressure reduces these effects. Makkar, et al. (2022) 23 Gingival fibroblasts Human fibrin-based matrix PEG–fibrinogen solution was mixed with fibroblast cell suspension.  - Confocal microscopy - Immunohistochemical staining - Immunofluorescence - Hybridization - ELISA  - Streptococcus mitis S. oralis - Fusobacterium nucleatum - Gingival constructs secreted more IL6, whereas periodontal constructs secreted more IL8. The gingival and periodontal CTEs exhibited differential responses to various bacterial challenges. Alves, et al. (2015) 34 Periodontal ligament fibroblast Collagen solution Scaffolds were prepared by mixing the collagen solution and polymerizing. The cells were seeded.  - Cell viability - ALP - Immunofluorescence - Confocal microscopy - RTPCR - Alizarin red  - Enhanced proliferation and osteoblastic differentiation. - Higher early expression of ALP, COL I, OPN, and RUNX2 compared with 2D. - Formed mineralized nodules with calcium deposition by day 14. 3D collagen scaffolds demonstrated strong potential for promoting mineralized matrix formation in periodontal regeneration. Yamada, et al. (2014) 35 Dental epithelial cells Hydrated collagen gel Collagen was mixed with DMEM and FBS. Cells were added.  - Immunohistochemical staining  - Formed stratified epithelium in vitro and in vivo. - In vitro, cytokeratin 8/18/19 and involucrin were expressed. - Only laminin and cytokeratin were detected in vivo. 3D cultures formed a stratified epithelial structure, suggesting that differentiation of three-dimensional culture tissues differs in vivo and in vitro. Dabija-Wolter, et al. (2013) 54 Gingival fibroblasts Collagen matrix Cell was seeded on top of a reconstituted collagen I biomatrix supplemented or not with fibroblasts.  - Immunohistochemical staining  - Reproduced JE and SE phenotypes depending on culture time and fibroblast type. - Day 5 cultures with PDLF resembled JE, day 7 cultures with GF or hPDLF resembled SE, and day 9 with GF resembled gingival epithelium. - Marker expression included ODAM, FDCSP, and CK19. These models as reliable tools for studying periodontal bacteria–host interactions. Lee, et al. 46 Periodontal ligament cells Calf skin collagen gel Cells were cultured in a three-dimensional collagen gel hydrogel.  - cDNA synthesis - RTPCR - ELISA - ALP  - Increased IL6 expression and decreased ALP activity, while IL8 showed no significant change. The changed expression of IL-6 and ALP in response to the static compressive force in PDL cells suggests promotion of bone resorption and reduction in mineralization, supporting the role of PDL cells in orthodontic tooth movement. Reuther, et al. 60 Periodontal ligament fibroblasts Type I collagen matrix Osteoblasts were incorporated into a collagen type I solution and polymerized. Pdl cells were seeded onto the osteoblast-containing collagen.  - Confocal microscopy - Gel contraction - Ki67 antigen detection  - Promoted sustained stratification of hPDLF cells, which was lost in monocultures. - Bone cells showed progressive stratification and strong gel contraction, likely driven by proliferation and migration. - Cocultures maintained proliferation, compartmentalization, and morphogenesis only in the 3D system. A novel experimental tool to further elucidate the underlying mechanisms of the growth and differentiation of hPDLF and bone tissue. dentistry-13-00422-t004_Table 4 Table 4 Summary of genes and proteins evaluated to determine cell differentiation. Genes and Proteins Number of Studies ( n Differentiation References Activating Transcription Factor 4 (ATF4) 1 Cementogenic [ 27 Activating Transcription Factor 6 (ATF6) 1 Cementogenic [ 27  Activating Transcription Factor 6 beta (ATF6β) 1 Cementogenic [ 27 Alkaline Phosphatase 16 Osteogenic [ 5 20 22 29 30 31 33 34 38 43 44 46 47 54 55 59  Alpha-Smooth Muscle Actin (α-SMA) 1 Osteogenic [ 20 Ameloblastin (AMBN) 1 Chondrogenic/Epithelial [ 9 Amelotin (AMTN) 1 Chondrogenic/Epithelial [ 9 Amphiregulin (AREG) 1 Chondrogenic/Epithelial [ 9 Asporin (ASPN) 1 Cementogenic/Osteogenic [ 5 Autophagy-Related Gene 5 (ATG5) 1 Osteogenic/Adipogenic [ 25  Bcl-2-Associated X Protein (BAX) 1 Cementogenic [ 27 Beclin 1 (BECN1) 1 Osteogenic [ 25 Betacellulin (BTC) 1 Chondrogenic/Epithelial [ 9 Bone Gamma-Carboxyglutamate Protein (BGLAP) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 Bone Morphogenetic Protein 2 (BMP2) 2 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 32 Bone Sialoprotein (BSP) 4 Cementogenic/Osteogenic [ 40 44 49 57 Calnexin (CANX) 1 Cementogenic/Adipogenic [ 27 Calreticulin (CALR) 1 Cementogenic/Adipogenic [ 27 Caspase 3 Apoptotic Cysteine Protease (CASP3) 1 Cementogenic/Adipogenic [ 27 Caspase 7 Apoptotic Cysteine Protease (CASP7) 1 Cementogenic/Adipogenic [ 27 Catabolite Activator Protein (CAP) 2 Cementogenic/Osteogenic [ 44 54 Cementum Protein 1 (CEMP1) 3 Cementogenic/Osteogenic [ 24 54 57  Collagen Type I Alpha 1 Chain (COL1A1) 13 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 5 24 28 32 34 38 40 42 46 49 53 57 59  Collagen Type II Alpha 1 Chain (COL2A1) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28  Collagen Type III Alpha 1 Chain (COL3A1) 5 Cementogenic/Osteogenic/Chondrogenic/Adipogenic [ 24 27 28 53 59  Collagen Type XII Alpha 1 Chain (COL12A1) 2 Cementogenic/Osteogenic [ 24 49  Cyclic AMP-Responsive Element-Binding Protein 3 (CREB3) 1 Cementogenic/Adipogenic [ 27 Cyclin D (CCND) 1 Epithelial [ 60 Cyclooxygenase-2 (COX2) 1 Cementogenic/Osteogenic [ 40 Cytokeratin (KRT) 1 Cementogenic/Osteogenic [ 55 Dentin Sialophosphoprotein (DSPP) 1 Cementogenic/Osteogenic [ 57 E-cadherin (CDH1) 1 Epithelial [ 60 Epidermal Growth Factor (EGF) 1 Chondrogenic/Epithelial [ 9 Epigen (EPGN) 1 Chondrogenic/Epithelial [ 9 Epiregulin (EREG) 1 Chondrogenic/Epithelial [ 9 Fibroblast Growth Factor 2 (FGF2) 2 Cementogenic/Osteogenic/Chondrogenic [ 32 38 GLI Family Zinc Finger 1 (GLI1) 1 Chondrogenic/Epithelial [ 9  Heparin-Binding EGF-Like Growth Factor (HBEGF) 1 Chondrogenic/Epithelial [ 9 Hepatocyte Growth Factor (HGF) 1 Cementogenic/Osteogenic [ 24 Integrin Subunit Alpha 6 (ITGA6) 1 Chondrogenic/Epithelial [ 9 Integrin-Linked Kinase (ILK) 1 Osteogenic [ 25  Leucine-Rich Repeats and Immunoglobulin-Like Domains 1 (LRIG1) 1 Chondrogenic/Ephitelial [ 9 Lysyl Oxidase (LOX) 1 Cementogenic/Adipogenic [ 27  Matrix Metalloproteinase 1 and 3 (MMP1 and MMPIII) 2 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 Meis Homeobox 1 (MEIS1) 1 Chondrogenic/Epithelial [ 9 Myogenic Differentiation 1 (MYOD1) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 Nanog Homeobox (NANOG) 1 Chondrogenic/Epithelial [ 30 Neuregulin 1 (NRG1) 1 Chondrogenic/Epithelial [ 9 Neuregulin 2 (NRG2) 1 Chondrogenic/Epithelial [ 9 Neuregulin 3 (NRG3) 1 Chondrogenic/Epithelial [ 9 Neuregulin 4 (NRG4) 1 Chondrogenic/Epithelial [ 9 Octamer-binding Transcription 4 (Oct4) 1 Chondrogenic/Epithelial [ 30  Odontogenic Ameloblast-Associated Protein (ODAM) 2 Chondrogenic/Epithelial [ 9 36 Osteocalcin (OCN) 5 Cementogenic/Osteogenic [ 24 33 34 49 53 Osteopontin (OPN) 2 Cementogenic/Osteogenic [ 33 34 Osteoprotegerin (OPG) 1 Cementogenic/Osteogenic/Chondrogenic [ 32 Paired-Like Homeodomain 2 (PITX2) 1 Chondrogenic/Epithelial [ 9  Periodontal Ligament-Associated Protein-1 (PLAP1) 3 Cementogenic/Osteogenic/Chondrogenic [ 24 32 38 Periostin (POSTN) 5 Cementogenic/Osteogenic/Epithelial [ 5 21 42 53 60 Peroxisome Proliferator-Activated Receptor Gamma (PPARG) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 Phosphoinositide 3-Kinase (PI3K) 1 Osteogenic [ 25 Receptor Activator of Nuclear Factor Kappa- Ligand (RANKL) 1 Cementogenic/Osteogenic/Chondrogenic [ 32  Runt-Related Transcription Factor 2 (Runx2) 6 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 33 34 40 42 53  SRY-Box Transcription Factor 2 (Sox2) 2 Chondrogenic/Epithelial [ 9 30  SRY-Box Transcription Factor 21 (SOX21) 1 Chondrogenic/Epithelial [ 9  SRY-Box Transcription Factor 9 (SOX9) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 Stem Cell Marker (STRO-1) 1 Cementogenic/Osteogenic [ 56  T-Box Transcription Factor 1 (TBX1) 1 Chondrogenic/Epithelial [ 9  Tissue Inhibitor of Metalloproteinases 1 (TIMP1) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 Transcription Factor Osterix (Sp7) 2 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28 53  Transforming Growth Factor Beta 1 (TGFB1) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28  Tumor Necrosis Factor Receptor Superfamily Member 11B (TNFRSF11B) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28  Tumor Necrosis Factor Superfamily Member 11 (TNFSF11) 1 Cementogenic/Osteogenic/Chondrogenic/Adipogenic/Epithelial [ 28  Twist Family BHLH Transcription Factor 1 (TWIST1) 1 Cementogenic/Osteogenic [ 53  Vascular Endothelial Growth Factor A (VEGFA) 1 Cementogenic/Osteogenic [ 24 Vimentin (VIM) 1 Cementogenic/Osteogenic [ 56 Yes-Associated Protein 1 (YaP1) 1 Cementogenic/Osteogenic [ 53 ",
  "metadata": {
    "Title of this paper": "The gingival tissues: The architecture of periodontal protection",
    "Journal it was published in:": "Dentistry Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469206/"
  }
}