{
  "title": "Paper_392",
  "abstract": "pmc BMC Med BMC Med 216 bmcmedicine BMC Medicine 1741-7015 BMC PMC12482002 PMC12482002.1 12482002 12482002 41024059 10.1186/s12916-025-04291-9 4291 1 Research Multidisciplinary team for antithrombotics management and clinical outcomes in older adults with atrial fibrillation: a target trial emulation Prunel Maïwenn 1 Cochard Alexis 1 2 Abbas Leila 1 Baudry Elodie 3 Pautas Eric 4 5 6 Legris Nicolas 7 Assayag Patrick 8 9 Frere Corinne 10 11 Verny Marc 12 13 Simon-Tillaux Noémie 2 Zerah Lorene lorene.zerah@aphp.fr 1 12 1 https://ror.org/02vjkv261 grid.7429.8 0000000121866389 Institut Pierre Louis d’Épidémiologie Et de Santé Publique (IPLESP), Sorbonne Université, INSERM, 2 https://ror.org/0321g0743 grid.14925.3b 0000 0001 2284 9388 Biostatistics and Epidemiology Office, Gustave Roussy, INSERM, University Paris-Saclay, Labeled Ligue Contre Le Cancer, 3 https://ror.org/03xjwb503 grid.460789.4 0000 0004 4910 6535 Department of Geriatrics, Assistance Publique - Hôpitaux de Paris, Bicêtre Hospital, Paris-Saclay University, 4 https://ror.org/02en5vm52 grid.462844.8 0000 0001 2308 1657 Sorbonne Université, 5 https://ror.org/04v3xcy66 grid.413865.d 0000 0001 2298 7932 Department of Geriatrics, Assistance Publique - Hôpitaux de Paris, Sorbonne Université, Charles Foix Hospital, 6 https://ror.org/05f82e368 grid.508487.6 0000 0004 7885 7602 Therapeutic Innovations in Hemostasis, Paris-Cité University, 7 https://ror.org/03xjwb503 grid.460789.4 0000 0004 4910 6535 Stroke Unit and Department of Neurology, Assistance Publique - Hôpitaux de Paris, Bicêtre Hospital, Paris-Saclay University, 8 https://ror.org/03xjwb503 grid.460789.4 0000 0004 4910 6535 Department of Cardiology, Assistance Publique - Hôpitaux de Paris, Bicêtre Hospital, Paris-Saclay University, 9 https://ror.org/03xjwb503 grid.460789.4 0000 0004 4910 6535 Université Paris-Saclay, 10 https://ror.org/02vjkv261 grid.7429.8 0000000121866389 UMRS-1166, Institute of Cardiometabolism and Nutrition, Sorbonne Université, INSERM, 11 https://ror.org/02mh9a093 grid.411439.a 0000 0001 2150 9058 Department of Hematology, Assistance Publique - Hôpitaux de Paris, Sorbonne Université, Pitié-Salpêtrière Hospital, 12 https://ror.org/02mh9a093 grid.411439.a 0000 0001 2150 9058 Department of Geriatrics, Assistance Publique - Hôpitaux de Paris, Sorbonne Université, Pitié-Salpêtrière Hospital, 13 https://ror.org/02en5vm52 grid.462844.8 0000 0001 2308 1657 UMR8256 (CNRS), Team Neuronal Cell Biology & Pathology, Sorbonne Université, 29 9 2025 2025 23 478654 521 26 3 2025 22 7 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Recent international guidelines emphasize a multidisciplinary, patient-centered approach to managing atrial fibrillation (AF), particularly regarding antithrombotic (antiplatelet and anticoagulant) management. These guidelines advocate establishing multidisciplinary AF teams, but the clinical benefits of this approach for high-risk, clinically complex subgroups—particularly among very old and frail patients—remain uncertain. Our objective was to evaluate the impact of a hospital multidisciplinary team meeting dedicated to antithrombotics management on a composite measure of all-cause death, major thromboembolic events, or major or clinically relevant bleeding within 6 months in older adults with AF. Methods A prospective multicenter cohort study was conducted in five acute geriatric departments in the Paris area between May 2021 and January 2024. Using a target trial emulation approach (cloning, censoring, weighting strategies), outcomes were analyzed in patients aged ≥ 75 years with AF or atrial flutter, followed in the geriatric departments (via outpatient consultation or hospitalization; > 98% were hospitalized). Participants were followed for 6 months or until death. The primary exposure was a hospital multidisciplinary team meeting within 45 days of inclusion, involving geriatricians, cardiologists, neurovascular specialists, and hemostasis experts. Cumulative incidences were estimated using the reverse Kaplan–Meier method. Results The study included 818 patients, 138 (16.9%) in the hospital multidisciplinary-team meeting arm (median age 89 (Q1Q3 84–93), 57% female). The 6-month cumulative incidence of the primary composite outcome was 35.3% (95% CI, 29.6 to 41.8) in the multidisciplinary-team meeting arm and 36.2% (95% CI, 32.2 to 40.1) in the control arm (risk difference − 0.9 (95% CI, − 7.5 to 6.0); p Conclusions A hospital multidisciplinary team meeting dedicated to antithrombotics management in older adults with AF was not associated with a reduction in all-cause death, major thromboembolic events, or major or clinically relevant bleeding within 6 months. These findings should be interpreted with caution due to the observational design and potential for residual confounding. Trial registration ClinicalTrials.gov registration: NCT04932603 Supplementary Information The online version contains supplementary material available at 10.1186/s12916-025-04291-9. Keywords Atrial fibrillation Antithrombotics Patient-centered approach Multidisciplinary team https://doi.org/10.13039/501100017007 Agence Régionale de Santé Île-de-France pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Atrial fibrillation (AF) is the most common sustained arrhythmia worldwide, with a rising prevalence that affects approximately 10% of individuals over the age of 80 [ 1 2 1 2 To address the multifaceted healthcare needs of patients with AF, international guidelines have endorsed a holistic, integrated care approach. Initially conceptualized through the Atrial Fibrillation Better Care (ABC) pathway, this strategy has evolved into the AF-CARE model, which is now recommended in the most recent guidelines as the updated framework for comprehensive AF management [ 3 5 2 4 6 7 8 Despite these encouraging results, there remains a critical evidence gap regarding the effectiveness of the “ABC pathway” in high-risk, clinically complex subgroups—particularly among very old and frail patients. Patients described as “complex” in clinical trials or meta-analyses often differ substantially from those encountered in geriatric practice. For instance, in the meta-analysis by Romiti et al., which included over 285,000 patients, the median age ranged from 56.7 to 75.2 years, suggesting limited representation of the oldest and most vulnerable populations. While managing comorbidities is a core competency in geriatric care, decision-making around anticoagulation in older adults is often substantially more nuanced. In frail older patients, overlapping risk factors for thromboembolic and bleeding events—such as advanced age, hypertension, chronic kidney disease, polypharmacy, and poor treatment adherence—make therapeutic decisions particularly challenging and highlight the need for truly individualized prescribing strategies [ 9 10 To address these complexities, five geriatric departments in the Paris area, in collaboration with cardiology and neurovascular teams, established a hospital-based multidisciplinary team meeting dedicated to antithrombotics management for older adults with AF in 2016. This meeting was specifically designed to guide the management of antithrombotic therapy in older, clinically complex adults with AF. This study aimed to evaluate the impact of this hospital multidisciplinary team meeting on a composite outcome including all-cause mortality, major thromboembolic events, or major or clinically relevant bleeding in patients aged 75 years and older with AF. Methods General considerations and ethics This study used the target trial emulation framework, a method to estimate associations as close as possible to causal effects of interventions by using observational data [ 11 1 12 13 14 Table 1 Baseline characteristics of the study population with and without antithrombotics multidisciplinary team (AMT) discussion Characteristics Total cohort N AMT within 45 days from admission N No AMT within 45 days from admission N Absolute standardized mean difference Age, years, n (%) 75–84 225 (27) 37 (27) 188 (28) .06 85–89 295 (36) 53 (38) 242 (36) ≥ 90 298 (36) 48 (35) 250 (37) Age, years Median (Q1Q3) 89.0 (84.0–92.8) 88.0 (84.0–92.0) 89.0 (84.0–93.0) .001 Female, n (%) 463 (57) 78 (56) 385 (57) .002 Hypertension, n (%) 583 (71) 104 (75) 479 (70) .11 Diabetes, n (%) 199 (24) 34 (25) 165 (24) .009 BMI, kg/m 2 Median (Q1Q3) 24.0 (21.2–27.3) 23.7 (20.6–26.7) 24.1 (21.3–27.5) .21 NA 210 (26) 20 (14) 190 (28) Coronary artery disease, n (%) 233 (28) 34 (25) 199 (29) .10 AF already known, n (%) b 708 (87) 120 (87) 588 (86) .01 Valvular AF, n (%) c 15 (2) 2 (1) 13 (2) .04 Heart failure, n (%) 163 (19) 36 (26) 127 (19) .18 Peripheral arterial pathology, n (%) 294 (36) 59 (43) 235 (35) .17 Thromboembolic venous disease, n (%) 138 (17) 24 (17) 114 (17) .02 Stroke or TIA, n (%) 333 (41) 77 (56) 256 (38) .37 Renal insufficiency, n (%) d No 585 (71) 100 (72) 485 (71) .11 Yes 192 (23) 35 (25) 157 (23) Dialysis 9 (1) 3 (2) 6 (1) NA 32 (4) 0 (0) 32 (5) Dementia, n (%) e 412 (50) 66 (48) 346 (51) .06 Solid cancer, n (%) 188 (23) 37 (27) 151 (22) .11 CCI Median (Q1Q3) 7 (6–8) 7 (6–8) 7 (6–7) .04 HASBLED score Median (Q1Q3) 2 (2–3) 3 (2–4) 2 (2–3) .52 CHA2DS2-VASC score Median (Q1Q3) 5 (4–6) 5 (4–6) 5 (4–6) .35 Previous bleeding, n (%) f 328 (40) 104 (75) 224 (33) .94 Anticoagulant accident g 280 (34) 86 (62) 194 (28) .72 Anticoagulant use, n (%) 573 (70) 81 (59) 573 (70) .29 DOAC 478 (58) 63 (47) 415 (61) .31 VKA 76 (9) 11 (8) 65 (10) .06 LMWH 19 (2) 7 (5) 12 (2) .18 Antiplatelet use, n (%) 137 (17) 30 (22) 107 (16) .15 Combination of antithrombotics, n (%) h 44 (5) 7 (5) 37 (5) .02 Total number of long-term medications taken per day Median (Q1Q3) 9 (6–11) 9 (6–11) 9 (6–11) .06 ADL score Median (Q1Q3) 5.0 (3.5–6.0) 5.0 (3.5–6.0) 5.0 (3.5–5.5) .08 NA, n 8 (1) 2 (1) 6 (1) Lifestyle, n (%) Lives alone 393 (48) 59 (43) 334 (49) .15 Married/cohabitating 328 (40) 64 (46) 264 (39) Institution 97 (12) 15 (11) 82 (12) Walking, n (%) Autonomous 307 (37) 64 (46) 243 (36) .27 Cane 225 (27) 29 (21) 196 (29) Walker 177 (22) 32 (23) 145 (21) Does not walk 109 (13) 13 (9) 96 (14) Repeated falls, n i 247 (30) 43 (31) 204 (30) .02 In the absence of the “NA” (not available) field, the variable contains no missing data Abbreviations: Q1Q3 BMI AF PE DVT TIA CCI HASBLED CHA2DS2-VASc DOAC VKA LMWH ADL TIA a b c d e f g h i For more details, see Supplemental eTable 3 This study was approved by the Institutional Ethics Committee on May 25, 2021 (no. CER-2021–026). All enrolled patients or their legal representative gave their non-opposition for the use of their medical data. Setting and participants The study was conducted in 5 acute geriatric wards in the Paris area (see Additional file 3: Table 3). From May 2021 to January 2024, consecutive patients ≥ 75 years old with confirmed AF or atrial flutter [ 5 15 The hospital multidisciplinary team meeting dedicated to antithrombotics management The hospital multidisciplinary team meeting dedicated to antithrombotics management was designed to address complex therapeutic decisions in older patients with AF, either in-person or remotely. It was implemented as part of routine clinical practice before the study was conceived. These meetings involved geriatricians, cardiologists, neurovascular specialists, and hemostasis experts, with at least one member affiliated with a professional society. Attendance was voluntary and unpaid. The decision to present a patient’s antithrombotics treatment at these meetings was at the discretion of the referring geriatrician. Before each meeting, the geriatrician completed a standardized form that was developed in agreement with all experts and highlighted key factors influencing antithrombotics treatment decisions. From a literature review (primarily European and American guidelines) [ 5 15 16 17 18 16 At the hospital multidisciplinary team meeting, joint decisions were made about the antithrombotics regimen based on current guidelines and expert opinion, specifying drug type(s), dosage(s), duration(s), monitoring, and follow-up plans. The referring geriatrician was responsible for implementing the team’s decision and informing the general practitioner via a discharge letter. All recommendations were documented in the patient’s electronic medical record. In our analysis, patients that were discussed during the meeting were classified in the intervention group (see below for the statistical analysis). No patients in the control group received any component of the antithrombotics multidisciplinary team intervention. Objectives and outcomes The objective was to evaluate whether a hospital multidisciplinary team meeting dedicated to antithrombotics management in older adults with AF was associated with the occurrence of all-cause death, major thromboembolic events, or major or clinically relevant bleeding (whichever occurred first). Major thromboembolic events included acute coronary syndromes, ischemic stroke, transient ischemic attacks, arterial embolism, and venous thromboembolic disease such as deep vein thrombosis and pulmonary embolism. Major or clinically relevant bleeding events were defined according to the International Society on Thrombosis and Haemostasis criteria [ 19 The primary outcome was the composite major thromboembolic event, major or clinically relevant bleeding events, or all-cause death measured at 6 months. Secondary outcomes included the same composite outcome measured at 3 months and each individual event within the composite at 3 and 6 months. Subgroup analyses for the primary outcome were conducted according to age at hospitalization and history of AF. Adherence to the hospital multidisciplinary team’s recommendations (e.g., treatments, dosage) at 3 and 6 months was also assessed in the intervention arm. Data collection and management All data were collected prospectively by using an electronic case report form that was tested and validated by all investigators (see Additional file 4: Table 4). Follow-up was conducted by medical consultation, with a detailed, dated report available in the patient’s chart, or by a phone call to the patient’s general practitioner or referring physician at 3 and 6 months. Particular attention was paid to ongoing treatments and adherence to the hospital multidisciplinary team’s recommendations, if applicable. Participants were followed from inclusion until death, lost to follow-up, or 6 months (administrative censoring), whichever occurred first. For patients lost to follow-up, vital status was obtained from the French National Institute of Statistics and Economic Studies registry. Statistical analysis Cloning, censoring, and weighting were used to emulate the target trial, with a grace period of 45 days to receive the hospital multidisciplinary-team meeting recommendations after hospital admission, as proposed elsewhere [ 20 21 1 22 Fig. 1 Detailed study diagram. Abbreviations: AT, antithrombotics; AF, atrial fibrillation Finally, cumulative incidences for each arm were estimated by using the inverse-weighted Kaplan–Meier estimator, based on the previously computed weights. Absolute risk differences between the arms at 3 and 6 months were estimated from these curves. To account for correlation between patient observations, we computed robust variances with 1000 bootstrap replicates. The same analytical strategy was used with the time-to-event secondary outcomes. Compliance with hospital multidisciplinary team recommendations was defined as the proportion of participants who adhered to the recommended treatment regimen after the hospital multidisciplinary team meeting in the intervention arm. Subgroup analyses of the primary outcome were performed according to age (75–84, 85–90, ≥ 90 years) and history of AF (recent-onset vs pre-existing before hospitalization). Missing data We used multiple imputations with chained Eqs. (30 imputed datasets) in all analyses to impute missing covariables (confounders and prognostic factors). Regarding time-to-event outcomes, the full procedure of cloning, censoring, and weighting was applied to each imputed dataset, and the estimators of intervention effects were averaged across all datasets following Rubin’s rule [ 23 Sensitivity analyses Sensitivity analyses included a modification of the grace period to 30 and 60 days, a complete-cases analysis, and use of a propensity score to account for confounding at baseline with a landmark time of 45 days [ 24 All tests were two-tailed with a 0.05 type 1 error rate. We did not correct for multiple comparisons regarding secondary outcomes, which remain exploratory. Analyses involved using R v4.3.3 with, in particular, the mice (3.16.0), survival (3.7–0, Hmisc (5.1–1), tidyverse (2.0.0) and dplyr (1.1.4) packages. The other packages used were readr, gtsummary, survival, labelled, rlang, lubridate, simstudy, Table 1, smd, flextable, officer, ggmice, finalfit, cobalt, MatchThem, ggplot2, survminer, boot, doFuture, survey, and GenBinomApps. Results Characteristics of the study population We included 818 patients (Fig. 1 1 Patient characteristics before cloning are described in Table 1. As compared with the control arm, the intervention arm had a higher median HAS-BLED score (3 (2–4) vs 2 (2–3), standardized mean difference (SMD) = 0.519), a more frequent bleeding history (75.4% vs 22.9%, SMD = 0.941), and more anticoagulant-related complications (62.3% vs 28.5%, SMD = 0.721). In addition, they had a higher prevalence of prior ischemic stroke or transient ischemic attack (55.8% vs. 37.6%, SMD = 0.370). Primary outcome A total of 285 primary outcome events occurred (see Additional file 7: Table 5 and Additional file 8: Table 6). The 30-day mortality rate was 10.5%, and the 6-month rate was 30.3% in the overall population. In the same population at 6 months, the incidence of thromboembolic events was 2.8%, ischemic stroke or transient ischemic attack 1.5%, and major or clinically relevant bleeding 8.4%. The 2 arms did not significantly differ in the primary outcome: the cumulative incidence of death, major thromboembolic, major or clinically relevant bleeding events within 6 months was 35.3% (95% CI, 29.6 to 41.8) in the intervention arm versus 36.2% (95% CI, 32.3 to 40.1) in the control arm (risk difference − 0.9 (95% CI, − 7.5 to 6.0; p 2 2 Fig. 2 Weighted cumulative incidence curves for the primary outcome by study arm. The light color area represents the 95% confidence intervals of the curves. All results are presented after multiple imputation of missing variables  Table 2 Cumulative incidences and risk differences for primary and secondary outcomes 3-month cumulative incidence, % (95% CI) p -value 6-month cumulative incidence, % (95% CI) p -value Major or clinically relevant bleeding events, major thromboembolic event or death AMT arm 24.6 (20.3–29.5) .73 35.3 (29.6–41.8) .79 Control arm 25.4 (22.1–28.9) 36.2 (32.3–40.1) Difference − 0.8 (− 5.1–4.4) − 0.9 (− 7.5–6.0) Death AMT arm 22.2 (17.7–27.1) .62 30.2 (24.2–36.9) .66 Control arm 23.4 (20.1–26.7) 31.7 (28.2–35.4) Difference − 1.2 (− 5.6–4.0) − 1.5 (− 7.5–5.8) Major or clinically relevant bleeding events AMT arm 5.0 (2.6–8.0) .24 12.7 (7.5–18.4) .06 Control arm 3.4 (2.2–7.4) 7.3 (5.3–9.6) Difference 1.6 (− 1.0–4.4) 5.4 (0.4–11.6) Major thromboembolic event AMT arm 2.2 (0.9–4.0) 3.2(1.2–5.6) .47 Control arm 1.3 (0.6–2.4) 2.4 (1.3–3.7) Difference 0.9 (− 0.2–2.3) .16 0.8 (− 1.3–3.4) This table shows cumulative incidences and risk differences for primary and secondary outcomes according to intervention arms and risk differences between arms at 3 and 6 months All results are presented after multiple imputation of missing variables Abbreviations: CI AMT Secondary outcomes At 3 months, the 2 arms did not significantly differ in the composite outcome: 24.6% (95% CI, 20.3 to 29.5) in the intervention arm versus 25.4% (95% CI, 22.1 to 28.9) in the control arm (risk difference − 0.8 (95% CI, − 5.1 to 4.4); p 2 3 p 2 Fig. 3 Weighted cumulative incidences and absolute risk differences of the primary outcome across various subgroups. In the “history of AF” subgroup, “recent” means that AF was discovered during the hospital stay, and “known” means that it was already known before hospitalization, based on objective evidence. All results are presented after multiple imputation of missing variables. Abbreviations: AMT, antithrombotics multidisciplinary team; Cum. Incidence, cumulative incidence; CI, confidence interval Adherence to the hospital multidisciplinary team’s recommendations regarding anticoagulant type and dose was 83.1% at 3 months and 87.3% at 6 months (Additional file 12: Table 7). Subgroup analyses did not reveal any significant differences by age group or history of AF diagnosis (Fig. 3 Discussion This study, which aimed to assess the impact of a hospital multidisciplinary team meeting dedicated to antithrombotics management on clinical outcomes in older adults with AF compared to usual care, found no significant differences between the arms in the occurrence of all-cause death, major thromboembolic events, or major or clinically relevant bleeding at 6 months, whether assessed as a composite outcome or as separate events. These findings were observed despite high adherence to multidisciplinary team recommendations. To our knowledge, no prior study has evaluated multidisciplinary assessments of complex cases to determine the optimal therapeutic strategy regarding antithrombotics for frail, older adults with AF. Romiti et al. recently investigated the impact of adherence to the ABC pathway in a contemporary cohort of clinically complex AF patients [ 25 Our cohort had a particularly high mortality rate. The 1- and 6-month mortality rates were 10.5% and 30.3%, respectively, which is consistent with previous studies. For example, in a cohort of 1808 patients with AF who were ≥ 75 years old and hospitalized in the acute geriatric unit of the University Hospital of Pisa, the 10-month mortality rate was 45.2% [ 26 27 28 In such patients, outcomes may be predominantly driven by underlying irreversible decline, leaving limited room for the measurable impact of any single intervention, including structured multidisciplinary consultations. Recent observational studies provide valuable perspectives on this dilemma. For instance, in a multicenter cohort of hospitalized geriatric patients with AF [ 29 30 31 Our study has several strengths. Despite describing a very old, comorbid population that is particularly vulnerable to iatrogenic issues and typically excluded from RCTs, we emulated a target trial to conduct the observational analysis. This approach helps identify and mitigate biases. Our use of cloning, censoring, and weighting strategies avoided introducing immortal time bias into the analysis by aligning the time of eligibility assessment, intervention assignment during the grace period, and the start of follow-up, as explained elsewhere [ 24 We must acknowledge several limitations. Firstly, our intervention was deliberately focused on the decision-making process regarding anticoagulant therapy and does not constitute a comprehensive integrated care model as proposed by the ABC or AF-CARE approaches [ 3 5 32 33 5 5 15 30 2 30 31 10 20 1 Outcomes could be further improved by building on this initial experience, expanding these meetings to include community-based physicians, rethinking the format (e.g., videoconferencing), and incorporating structured patient and caregiver education to enhance treatment adherence through collaborations with advanced practice nurses. Conclusions In this multicenter target emulation trial of 818 patients with confirmed AF who were ≥ 75 years old from May 2021 to January 2024, we found no significant differences in the occurrence of major thromboembolic events, major or clinically relevant bleeding, or all-cause death between patients whose cases were reviewed and not reviewed by a hospital multidisciplinary team. However, as this study remains observational, residual biases may explain the observed results, and these results need to be confirmed in a randomized trial. Supplementary Information  Addition file 1: Table 1 – Specification of the target trial and its observational emulation. Additional file 2: Table 2 – STROBEGuidelines Statement—checklist of items that should be included in reports of observational studies. Additional file 3: Table 3 – List of participating sites in Paris area. Additional file 4: Table 4 – Supplemental information on data collection. Additional file 5: Figure 1 – Representation of the cloning, censoring and weighting procedure. Additional file 6: Methods–Additional information. Additional file 7: Table 5 – Occurrence of primary and secondary outcomes by time, with detailed breakdown. Additional file 8: Table 6 – Type and number of events. Additional File 9: Figure 2 – Weighted cumulative incidence curves for all-cause deaths by study arm. Additional file 10: Figure 3 – Weighted cumulative incidence curves for major thromboembolic events by study arm. Additional file 11: Figure 4 – Weighted cumulative incidence curves for major or clinically relevant bleeding events by study arm. Additional file 12: Table 7 – Adherence to hospital multidisciplinary team recommendations at 3 and 6 months. Additional file 13: Figure 5 – Weighted cumulative incidence curves for major or clinically relevant bleeding events, thromboembolic events, or death by age. Additional file 14: Figure 6 – Weighted cumulative incidence curves for major haemorrhagic events, thromboembolic events, or death by atrial fibrillation diagnosis: recentvs known. Additional file 15: Table 8 – Sensitivity analysis: weighted cumulative incidence and risk differences for composite outcome at 6 months, modified by grace period. Additional file 16: Table 9 – Sensitivity analysis: complete-cases analysis. Weighted cumulative incidence and risk differences for composite outcome at 3 and 6 months a Additional file 17: Table 10 – Sensitivity analysis: Cox proportional-hazards analysis of composite outcome using propensity score and 45-day landmark time a Additional file 18: Figure 7– Sensitivity analysis: weighted cumulative incidence curves for primary outcome by arm, grace period of 30 daysand 60 days. Additional file 19: Figure 8 – Sensitivity analysis: weighted cumulative incidence curves for primary outcome by arm in complete-cases analysis. Additional file 20: Figure 9 – Sensitivity analysis: distribution of propensity scores by study arm in unweighted population. Additional file 21: Figure 10 – Sensitivity analysis: mean baseline balance with standardized mean differences in unweighted vs weighted populations using propensity score across all imputed datasets. Abbreviations ABC Anticoagulation, better control, comorbidity AF Atrial fibrillation AF CARE Comorbidity, avoid stroke and thromboembolism, reduce symptoms by rate and rhythm control, evaluation and dynamic reassessment MACE Major adverse cardiovascular events RCT Randomized controlled trials Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Lorene Zerah and Noémie Simon-Tillaux contributed equally as co-last authors. Acknowledgements o Acknowledgment of Patient and Family Participation: We extend our deepest gratitude to the patients and their families who generously contributed their data to this study. o Acknowledgment of Physician Contributions: We are especially grateful to the physicians from the participating centers for their vital contributions to the successful completion of this research. We offer particular thanks to Dr. C. Verny, the late Prof. J.P. Collet, Prof. S. Deltour, and Prof. V. Siguret for their invaluable assistance in establishing the multidisciplinary team meeting. Authors’ contributions LZ and NST contributed equally as co-last authors. They were involved in the conception and design of the study, the development of the research protocol, and the manuscript writing. NST also played a significant role in the statistical analysis. o Concept and design: MP, NST, LZ o Acquisition, analysis, or interpretation of data: MP, NST, LZ, AC, LA o Drafting of the manuscript: MP, NST, LZ o Critical review of the manuscript for important intellectual content: MP, EB, EP, NL, PA, CF, MV, NST, LZ o Statistical analysis: MP, NST, AC o Obtained funding: MP o Supervision: NST, LZ o All authors read and approved the final manuscript Funding This work was supported by a Master grant (MP was awarded a research grant “Année Recherche” by the Regional Health Agency (“Agence Régionale de Santé, Ile-de-France”), November 2023–October 2024. The funders did not play a role in the design and conduct of the study; collection, management, analysis, and interpretation of the data; preparation, review, or approval of the manuscript; or decision to submit the manuscript for publication. Data availability The datasets used during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This study was approved by the Institutional Ethics Committee on May 25, 2021 (no. CER-2021–026). All enrolled patients or their legal representative gave their non-opposition for the use of their medical data. Consent for publication Not applicable. Competing interests o EP received honoraria for participation in expert meetings on low-molecular-weight Heparin (Léo Pharma), vitamin K antagonist (Merck) and direct oral anticoagulant (Boehringer Ingelheim, Bayer Healthcare AG, and Bristol Myers Squibb-Pfizer) o MV received honoraria for a lecture at a scientific meeting in 2021 (Bayer) o NST received support for attending meeting in 2025 (Sanofi) o LZ received honoraria for a lecture at a scientific meeting in 2023 and for participation in 2 expert meetings in 2024 (Bristol Myers Squibb) o The remaining authors declare no competing interests. References 1. Wu J Nadarajah R Nakao YM Nakao K Wilkinson C Mamas MA Temporal trends and patterns in atrial fibrillation incidence: A population-based study of 3·4 million individuals Lancet Reg Health Eur 2022 17 100386 10.1016/j.lanepe.2022.100386 35721699 PMC9198843 Wu J, Nadarajah R, Nakao YM, Nakao K, Wilkinson C, Mamas MA, et al. Temporal trends and patterns in atrial fibrillation incidence: A population-based study of 3·4 million individuals. Lancet Reg Health Eur. 2022;17:100386. 35721699 10.1016/j.lanepe.2022.100386 PMC9198843 2. Romiti GF Corica B Mei DA Vitolo M Bucci T Bisson A Association of comorbidity patterns with outcomes and relation with the ABC pathway effectiveness in European patients with atrial fibrillation Heart Rhythm 2025 S1547–5271 25 00220 226 10.1016/j.hrthm.2025.02.049 40054712 Romiti GF, Corica B, Mei DA, Vitolo M, Bucci T, Bisson A, et al. Association of comorbidity patterns with outcomes and relation with the ABC pathway effectiveness in European patients with atrial fibrillation. Heart Rhythm. 2025;S1547–5271(25):00220–6. 10.1016/j.hrthm.2025.02.049 40054712 3. Proietti M Romiti GF Olshansky B Lane DA Lip GYH Improved Outcomes by Integrated Care of Anticoagulated Patients with Atrial Fibrillation Using the Simple ABC (Atrial Fibrillation Better Care) Pathway Am J Med 2018 131 1359 1366.e6 10.1016/j.amjmed.2018.06.012 30153428 Proietti M, Romiti GF, Olshansky B, Lane DA, Lip GYH. Improved Outcomes by Integrated Care of Anticoagulated Patients with Atrial Fibrillation Using the Simple ABC (Atrial Fibrillation Better Care) Pathway. Am J Med. 2018;131:1359-1366.e6. 30153428 10.1016/j.amjmed.2018.06.012 4. Proietti M Lip GYH Laroche C Fauchier L Marin F Nabauer M Relation of outcomes to ABC (atrial fibrillation better care) pathway adherent care in European patients with atrial fibrillation: an analysis from the ESC-EHRA EORP atrial fibrillation general long-term (AFGen LT) registry Europace 2021 23 174 83 10.1093/europace/euaa274 33006613 Proietti M, Lip GYH, Laroche C, Fauchier L, Marin F, Nabauer M, et al. Relation of outcomes to ABC (atrial fibrillation better care) pathway adherent care in European patients with atrial fibrillation: an analysis from the ESC-EHRA EORP atrial fibrillation general long-term (AFGen LT) registry. Europace. 2021;23:174–83. 33006613 10.1093/europace/euaa274 5. Van Gelder IC Rienstra M Bunting KV Casado-Arroyo R Caso V Crijns HJGM 2024 ESC guidelines for the management of atrial fibrillation developed in collaboration with the European Association for Cardio-Thoracic Surgery (EACTS) Eur Heart J 2024 45 3314 414 10.1093/eurheartj/ehae176 39210723 Van Gelder IC, Rienstra M, Bunting KV, Casado-Arroyo R, Caso V, Crijns HJGM, et al. 2024 ESC guidelines for the management of atrial fibrillation developed in collaboration with the European Association for Cardio-Thoracic Surgery (EACTS). Eur Heart J. 2024;45:3314–414. 39210723 10.1093/eurheartj/ehae176 6. Guo Y Lane DA Wang L Zhang H Wang H Zhang W Mobile health technology to improve care for patients with atrial fibrillation J Am Coll Cardiol 2020 75 1523 34 10.1016/j.jacc.2020.01.052 32241367 Guo Y, Lane DA, Wang L, Zhang H, Wang H, Zhang W, et al. Mobile health technology to improve care for patients with atrial fibrillation. J Am Coll Cardiol. 2020;75:1523–34. 32241367 10.1016/j.jacc.2020.01.052 7. Chu M Zhang S Gong J Yang S Yang G Sun X Telemedicine-based integrated management of atrial fibrillation in village clinics: a cluster randomized trial Nat Med 2025 31 1276 1285 10.1038/s41591-025-03511-2 39984634 Chu M, Zhang S, Gong J, Yang S, Yang G, Sun X, et al. Telemedicine-based integrated management of atrial fibrillation in village clinics: a cluster randomized trial. Nat Med. 2025;31:1276–85. 39984634 10.1038/s41591-025-03511-2 8. Romiti GF Pastori D Rivera-Caravaca JM Ding WY Gue YX Menichelli D Adherence to the “Atrial Fibrillation Better Care” Pathway in Patients with Atrial Fibrillation: Impact on Clinical Outcomes-A Systematic Review and Meta-Analysis of 285,000 Patients Thromb Haemost 2022 122 406 14 10.1055/a-1515-9630 34020488 Romiti GF, Pastori D, Rivera-Caravaca JM, Ding WY, Gue YX, Menichelli D, et al. Adherence to the “Atrial Fibrillation Better Care” Pathway in Patients with Atrial Fibrillation: Impact on Clinical Outcomes-A Systematic Review and Meta-Analysis of 285,000 Patients. Thromb Haemost. 2022;122:406–14. 34020488 10.1055/a-1515-9630 9. Andreotti F Geisler T Collet J-P Gigante B Gorog DA Halvorsen S Acute, periprocedural and longterm antithrombotic therapy in older adults: 2022 update by the ESC working group on thrombosis Eur Heart J 2023 44 262 79 10.1093/eurheartj/ehac515 36477865 Andreotti F, Geisler T, Collet J-P, Gigante B, Gorog DA, Halvorsen S, et al. Acute, periprocedural and longterm antithrombotic therapy in older adults: 2022 update by the ESC working group on thrombosis. Eur Heart J. 2023;44:262–79. 36477865 10.1093/eurheartj/ehac515 10. Piccini JP Allred J Bunch TJ Deering TF Di Biase L Hussein AA Rationale, considerations, and goals for atrial fibrillation centers of excellence: a heart rhythm society perspective Heart Rhythm 2020 17 1804 1832 10.1016/j.hrthm.2020.04.033 32387248 Piccini JP, Allred J, Bunch TJ, Deering TF, Di Biase L, Hussein AA, et al. Rationale, considerations, and goals for atrial fibrillation centers of excellence: a heart rhythm society perspective. Heart Rhythm. 2020;17:1804–32. 32387248 10.1016/j.hrthm.2020.04.033 11. Hernán MA Wang W Leaf DE Target trial emulation: a framework for causal inference from observational data JAMA 2022 328 2446 2447 10.1001/jama.2022.21383 36508210 Hernán MA, Wang W, Leaf DE. Target trial emulation: a framework for causal inference from observational data. JAMA. 2022;328:2446–7. 36508210 10.1001/jama.2022.21383 12. Desai RJ, Wang SV, Sreedhara SK, Zabotka L, Khosrow-Khavar F, Nelson JC, et al. Process guide for inferential studies using healthcare data from routine clinical practice to evaluate causal effects of drugs (PRINCIPLED): considerations from the FDA Sentinel Innovation Center. BMJ. 2024;e076460. 10.1136/bmj-2023-076460 38346815 13. Open Science Framework (OSF). DATACC. https://www.datacc.org/vos-besoins/valoriser-ses-donnees/deposer-ses-donnees-en-ligne-ou-et-comment/open-science-framework-osf/ 14. von Elm E Altman DG Egger M Pocock SJ Gøtzsche PC Vandenbroucke JP Strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies BMJ 2007 335 806 808 10.1136/bmj.39335.541782.AD 17947786 PMC2034723 von Elm E, Altman DG, Egger M, Pocock SJ, Gøtzsche PC, Vandenbroucke JP, et al. Strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies. BMJ. 2007;335:806–8. 17947786 10.1136/bmj.39335.541782.AD PMC2034723 15. Joglar JA Chung MK Armbruster AL Benjamin EJ Chyou JY Cronin EM 2023 ACC/AHA/ACCP/HRS Guideline for the Diagnosis and Management of Atrial Fibrillation: A Report of the American College of Cardiology/American Heart Association Joint Committee on Clinical Practice Guidelines Circulation 2024 149 e1 156 10.1161/CIR.0000000000001193 38033089 PMC11095842 Joglar JA, Chung MK, Armbruster AL, Benjamin EJ, Chyou JY, Cronin EM, et al. 2023 ACC/AHA/ACCP/HRS Guideline for the Diagnosis and Management of Atrial Fibrillation: A Report of the American College of Cardiology/American Heart Association Joint Committee on Clinical Practice Guidelines. Circulation. 2024;149:e1-156. 38033089 10.1161/CIR.0000000000001193 PMC11095842 16. Hindricks G Potpara T Dagres N Arbelo E Bax JJ Blomström-Lundqvist C 2020 ESC Guidelines for the diagnosis and management of atrial fibrillation developed in collaboration with the European Association for Cardio-Thoracic Surgery (EACTS): The Task Force for the diagnosis and management of atrial fibrillation of the European Society of Cardiology (ESC) Developed with the special contribution of the European Heart Rhythm Association (EHRA) of the ESC Eur Heart J 2021 42 373 498 10.1093/eurheartj/ehaa612 32860505 Hindricks G, Potpara T, Dagres N, Arbelo E, Bax JJ, Blomström-Lundqvist C, et al. 2020 ESC Guidelines for the diagnosis and management of atrial fibrillation developed in collaboration with the European Association for Cardio-Thoracic Surgery (EACTS): The Task Force for the diagnosis and management of atrial fibrillation of the European Society of Cardiology (ESC) Developed with the special contribution of the European Heart Rhythm Association (EHRA) of the ESC. Eur Heart J. 2021;42:373–498. 32860505 10.1093/eurheartj/ehaa612 17. Folstein MF, Folstein SE, McHugh PR. “Mini-mental state”. A practical method for grading the cognitive state of patients for the clinician. J Psychiatr Res. 1975;12:189–98. 10.1016/0022-3956(75)90026-6 1202204 18. Katz S, Akpom CA. 12. Index of ADL. Med Care. 1976;14 5 Suppl:116–8. 10.1097/00005650-197605001-00018 132585 19. Kaatz S Ahmad D Spyropoulos AC Schulman S Subcommittee on Control of Anticoagulation Definition of clinically relevant non-major bleeding in studies of anticoagulants in atrial fibrillation and venous thromboembolic disease in non-surgical patients: communication from the SSC of the ISTH J Thromb Haemost 2015 13 2119 26 10.1111/jth.13140 26764429 Kaatz S, Ahmad D, Spyropoulos AC, Schulman S, Subcommittee on Control of Anticoagulation. Definition of clinically relevant non-major bleeding in studies of anticoagulants in atrial fibrillation and venous thromboembolic disease in non-surgical patients: communication from the SSC of the ISTH. J Thromb Haemost. 2015;13:2119–26. 26764429 10.1111/jth.13140 20. Maringe C Benitez Majano S Exarchakou A Smith M Rachet B Belot A Reflection on modern methods: trial emulation in the presence of immortal-time bias. Assessing the benefit of major surgery for elderly lung cancer patients using observational data Int J Epidemiol 2020 49 1719 29 10.1093/ije/dyaa057 32386426 PMC7823243 Maringe C, Benitez Majano S, Exarchakou A, Smith M, Rachet B, Belot A, et al. Reflection on modern methods: trial emulation in the presence of immortal-time bias. Assessing the benefit of major surgery for elderly lung cancer patients using observational data. Int J Epidemiol. 2020;49:1719–29. 32386426 10.1093/ije/dyaa057 PMC7823243 21. Hernán MA How to estimate the effect of treatment duration on survival outcomes using observational data BMJ 2018 360 k182 10.1136/bmj.k182 29419381 PMC6889975 Hernán MA. How to estimate the effect of treatment duration on survival outcomes using observational data. BMJ. 2018;360: k182. 29419381 10.1136/bmj.k182 PMC6889975 22. Robins JM Hernán MÁ Brumback B Marginal structural models and causal inference in epidemiology Epidemiology 2000 11 550 10.1097/00001648-200009000-00011 10955408 Robins JM, Hernán MÁ, Brumback B. Marginal structural models and causal inference in epidemiology. Epidemiology. 2000;11:550. 10955408 10.1097/00001648-200009000-00011 23. Rubin DB Multiple Imputation for Nonresponse in Surveys 1987 Ltd John Wiley & Sons Rubin DB. Multiple Imputation for Nonresponse in Surveys. Ltd: John Wiley & Sons; 1987. 24. Hernán MA Sauer BC Hernández-Díaz S Platt R Shrier I Specifying a target trial prevents immortal time bias and other self-inflicted injuries in observational analyses J Clin Epidemiol 2016 79 70 5 10.1016/j.jclinepi.2016.04.014 27237061 PMC5124536 Hernán MA, Sauer BC, Hernández-Díaz S, Platt R, Shrier I. Specifying a target trial prevents immortal time bias and other self-inflicted injuries in observational analyses. J Clin Epidemiol. 2016;79:70–5. 27237061 10.1016/j.jclinepi.2016.04.014 PMC5124536 25. Romiti GF Proietti M Vitolo M Bonini N Fawzy AM Ding WY Clinical complexity and impact of the ABC (atrial fibrillation better care) pathway in patients with atrial fibrillation: a report from the ESC-EHRA EURObservational research programme in AF general long-term registry BMC Med 2022 20 326 10.1186/s12916-022-02526-7 36056426 PMC9440492 Romiti GF, Proietti M, Vitolo M, Bonini N, Fawzy AM, Ding WY, et al. Clinical complexity and impact of the ABC (atrial fibrillation better care) pathway in patients with atrial fibrillation: a report from the ESC-EHRA EURObservational research programme in AF general long-term registry. BMC Med. 2022;20:326. 36056426 10.1186/s12916-022-02526-7 PMC9440492 26. Calsolaro V Okoye C Antognoli R Dell’Agnello U Calabrese AM Monzani F Long-term effectiveness and safety of anticoagulation therapy in oldest old, frail people with atrial fibrillation Eur J Intern Med 2021 86 91 97 10.1016/j.ejim.2021.01.020 33551290 Calsolaro V, Okoye C, Antognoli R, Dell’Agnello U, Calabrese AM, Monzani F. Long-term effectiveness and safety of anticoagulation therapy in oldest old, frail people with atrial fibrillation. Eur J Intern Med. 2021;86:91–7. 33551290 10.1016/j.ejim.2021.01.020 27. Yamashita T Suzuki S Inoue H Akao M Atarashi H Ikeda T Two-year outcomes of more than 30 000 elderly patients with atrial fibrillation: results from the All Nippon AF In the Elderly (ANAFIE) Registry Eur Heart J Qual Care Clin Outcomes 2022 8 202 213 10.1093/ehjqcco/qcab025 33822030 PMC8888123 Yamashita T, Suzuki S, Inoue H, Akao M, Atarashi H, Ikeda T, et al. Two-year outcomes of more than 30 000 elderly patients with atrial fibrillation: results from the All Nippon AF In the Elderly (ANAFIE) Registry. Eur Heart J Qual Care Clin Outcomes. 2022;8:202–13. 33822030 10.1093/ehjqcco/qcab025 PMC8888123 28. Patti G Lucerna M Pecen L Siller-Matula JM Cavallari I Kirchhof P Thromboembolic Risk, Bleeding Outcomes and Effect of Different Antithrombotic Strategies in Very Elderly Patients With Atrial Fibrillation: A Sub-Analysis From the PREFER in AF (PREvention oF Thromboembolic Events-European Registry in Atrial Fibrillation) J Am Heart Assoc 2017 6 e005657 10.1161/JAHA.117.005657 28736385 PMC5586290 Patti G, Lucerna M, Pecen L, Siller-Matula JM, Cavallari I, Kirchhof P, et al. Thromboembolic Risk, Bleeding Outcomes and Effect of Different Antithrombotic Strategies in Very Elderly Patients With Atrial Fibrillation: A Sub-Analysis From the PREFER in AF (PREvention oF Thromboembolic Events-European Registry in Atrial Fibrillation). J Am Heart Assoc. 2017;6:e005657. 28736385 10.1161/JAHA.117.005657 PMC5586290 29. Brunetti E Presta R Okoye C Filippini C Raspo S Bruno G Predictors and Outcomes of Oral Anticoagulant Deprescribing in Geriatric Inpatients With Atrial Fibrillation: A Retrospective Multicenter Cohort Study J Am Med Dir Assoc 2024 25 545 551.e4 10.1016/j.jamda.2024.01.011 38359897 Brunetti E, Presta R, Okoye C, Filippini C, Raspo S, Bruno G, et al. Predictors and Outcomes of Oral Anticoagulant Deprescribing in Geriatric Inpatients With Atrial Fibrillation: A Retrospective Multicenter Cohort Study. J Am Med Dir Assoc. 2024;25:545-551.e4. 38359897 10.1016/j.jamda.2024.01.011 30. Bucci T Romiti GF Ishiguchi H Gerra L Mantovani M Huang B Adverse events in clinically complex elderly patients with atrial fibrillation according to oral anticoagulation status EClinicalMedicine 2024 78 102974 10.1016/j.eclinm.2024.102974 39687426 PMC11648801 Bucci T, Romiti GF, Ishiguchi H, Gerra L, Mantovani M, Huang B, et al. Adverse events in clinically complex elderly patients with atrial fibrillation according to oral anticoagulation status. EClinicalMedicine. 2024;78: 102974. 39687426 10.1016/j.eclinm.2024.102974 PMC11648801 31. Guo Y Romiti GF Sagris D Proietti M Bonini N Zhang H Mobile health-technology integrated care in secondary prevention atrial fibrillation patients: a post-hoc analysis from the mAFA-II randomized clinical trial Intern Emerg Med 2023 18 1041 1048 10.1007/s11739-023-03249-0 36929347 PMC10326104 Guo Y, Romiti GF, Sagris D, Proietti M, Bonini N, Zhang H, et al. Mobile health-technology integrated care in secondary prevention atrial fibrillation patients: a post-hoc analysis from the mAFA-II randomized clinical trial. Intern Emerg Med. 2023;18:1041–8. 36929347 10.1007/s11739-023-03249-0 PMC10326104 32. Guiding principles for the care of older adults with multimorbidity: an approach for clinicians. Guiding principles for the care of older adults with multimorbidity: an approach for clinicians: American Geriatrics Society Expert Panel on the Care of Older Adults with Multimorbidity. J Am Geriatr Soc. 2012;60:E1–25. 10.1111/j.1532-5415.2012.04188.x PMC4450364 22994865 33. Wallace E Salisbury C Guthrie B Lewis C Fahey T Smith SM Managing patients with multimorbidity in primary care BMJ 2015 350 h176 10.1136/bmj.h176 25646760 Wallace E, Salisbury C, Guthrie B, Lewis C, Fahey T, Smith SM. Managing patients with multimorbidity in primary care. BMJ. 2015;350: h176. 25646760 10.1136/bmj.h176 ",
  "metadata": {
    "Title of this paper": "Managing patients with multimorbidity in primary care",
    "Journal it was published in:": "BMC Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482002/"
  }
}