{
  "title": "Paper_289",
  "abstract": "pmc J Med Internet Res J Med Internet Res 224 jmir JMIR Journal of Medical Internet Research 1439-4456 1438-8871 JMIR Publications Inc. PMC12485256 PMC12485256.1 12485256 12485256 40957008 10.2196/70836 v27i1e70836 1 Original Paper Original Paper Public Perspectives on Palliative and Hospice Care: Social Media Content Analysis Using Topic Modeling and Multiclass Sentiment Analysis Mavragani Amaryllis Matthys Marjolein Ray Chaudhuri Esha Kim Aeri PhD 1 https://orcid.org/0000-0001-6993-060X Woo Kyungmi PhD https://orcid.org/0000-0002-8710-2696 2 3 College of Nursing Seoul National University 103 Daehak-ro Jongno-gu Seoul, 03080 Republic of Korea 82 2 740 8828 82 2 766 1852 woo2020@snu.ac.kr  1 The Research Institute of Nursing Science Seoul National University Seoul Republic of Korea  2 College of Nursing Seoul National University Seoul Republic of Korea  3 Center for World-leading Human-care Nurse Leaders for the Future by Brain Korea 21 (BK 21) four project College of Nursing Seoul National University Seoul Republic of Korea Corresponding Author: Kyungmi Woo woo2020@snu.ac.kr 2025 16 9 2025 27 479700 e70836 3 1 2025 2 4 2025 20 7 2025 21 8 2025 16 09 2025 02 10 2025 02 10 2025 ©Aeri Kim, Kyungmi Woo. Originally published in the Journal of Medical Internet Research (https://www.jmir.org), 16.09.2025. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://www.jmir.org/ Background Palliative care enhances dignity and quality of life for patients with serious illnesses by managing distressing symptoms and supporting families. However, inadequate awareness and misconceptions often hinder patients and their families from accessing these services. Understanding of public perspectives on palliative and hospice care can facilitate the development of targeted educational resources and awareness campaigns. As social media becomes an important source of health information, analyzing such publicly available web-based sources can yield valuable insights into perceptions of palliative and hospice care. Objective This study analyzed public perspectives posted on a popular social media platform in South Korea to understand perceptions, challenges, needs, and sentiments related to palliative and hospice care. Methods Data were collected from Naver Knowledge iN, a popular web-based public forum in South Korea, encompassing 34,501 texts posted between 2002 and 2024. After applying inclusion and exclusion criteria, 9072 relevant perspectives were analyzed. Contextualized topic modeling was used to identify themes, and the optimal model was selected based on coherence, diversity scores, and expert feedback. In addition, multiclass sentiment analysis using a fine-tuned Korean bidirectional encoder representations from transformers (KoBERT) model classified sentiments into 6 categories. The multiclass sentiment model’s performance was evaluated using accuracy, precision, recall, and F 1 Results Social media discussions on palliative and hospice care have increased steadily over time. Topic modeling identified 9 themes, with “ethical and legal concerns” and “medical care in hospitals” peaking in recent years, suggesting growing public interest in these areas. “Emotional and psychological support” emerged as the predominant theme, reflecting a significant need for psychosocial assistance among patients and their families. Sentiment analysis revealed that “sadness,” “anxiety,” and “neutral” were common emotions across many topics. Notably, themes such as “emotional and psychological support,” “disease treatment outcomes and prognosis,” “medical care in hospitals,” “financial issues,” and “symptom management” were predominantly associated with “sadness,” while “administrative and volunteer services,” “ethical and legal concerns,” and “nutrition management” were more closely linked with “anxiety.” Conclusions This study highlights public concerns about palliative and hospice care in South Korea, including ethical dilemmas, caregiving burden, and emotional distress. Findings underscore the need for communication strategies that address informational, emotional, and psychological needs. Culturally sensitive, interactive communication tools, such as artificial intelligence–powered chatbots and public education campaigns, may help dispel misconceptions and promote timely, informed decisions about palliative and hospice care. palliative care hospice social media Naver natural language processing topic modeling sentiment analysis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Palliative care manages pain and other distressing symptoms in patients with serious diseases, ensuring dignity and quality of life throughout the treatment process while providing support to patients’ families [ 1 2 3 In South Korea, palliative care was formalized in 2011 with hospice services primarily for patients with terminal cancer, followed by the 2016 Act on Decisions on Life-Sustaining Treatment, which expanded services to include other serious illnesses. Services are provided through Regional Hospice Centers and institutions specialized in hospice care, offering inpatient, home-based, consultative care, and pediatric palliative care. In 2024, South Korea’s Ministry of Health and Welfare announced the “Second Comprehensive Plan for Hospice and Life-Sustaining Treatment (2024-2028)” to ensure a dignified end-of-life experience for everyone. This comprehensive plan aims to enhance policy accessibility, expand end-of-life care infrastructure, strengthen the competencies of service providers and staff, raise public awareness and policy recognition, and reinforce community-based linkages and governance [ 4 Despite the well-documented benefits of palliative and hospice care, several barriers continue to hinder their widespread access, limiting the ability of individuals to fully benefit from these services. One prominent barrier identified in the literature is inadequate knowledge and awareness among the general public [ 5 7 8 9 10 Modern health care information consumption has shifted significantly toward web-based platforms. The popularity of health-related podcasts, YouTube channels, blogs, and web-based communities dedicated to wellness is clear evidence of growing public interest. Moreover, many individuals actively use these web-based resources to gather health-related information, supplementing the advice they receive from health care professionals, and even seek information from other web-based platform users. For instance, in the United States, one in 3 people has attempted self-diagnosis through web searches [ 11 12 13 15 Recent literature underscores the importance of understanding public perceptions, including misconceptions and stigma, to effectively promote the acceptance and use of palliative care services [ 5 7 16 17 While qualitative methods such as interviews or focus groups yield in-depth insights, they are often resource-intensive and limited in scope. Analyzing text from web-based platforms offers a scalable alternative, enabling researchers to capture broader patterns in public experiences, informational needs, and sentiment. Despite this potential, a recent systematic review of palliative care research using natural language processing techniques revealed that only 3.6% (3/82) of studies analyzed social media data [ 18 19 Naver, a major search engine in South Korea, offers various services that are easily accessible to the public. The data generated on this platform have been used in various forms of research [ 20 21 Therefore, this study analyzed posts from the general public on Naver Knowledge iN to provide deeper insights into the public perceptions, information needs, and sentiments regarding palliative and hospice care. Using natural language processing techniques, this study aimed to (1) identify the key topics, needs, and inquiries raised by the public; (2) examine the emotional expressions embedded in those texts; and (3) explore temporal trends in public discourse on palliative and hospice care over the past 2 decades. The findings of this study can inform targeted public awareness campaigns, the development of educational resources, and policy initiatives that better address the public’s needs and perceptions of palliative and hospice care. Methods Data Collection and Screening The dataset for this study was collected from Naver Knowledge iN, where users post questions and receive answers from the public. Each entry on this platform consists of a user-generated question and one or more community-generated answers. As the primary aim of this study was to examine public perceptions, concerns, and information-seeking behaviors regarding palliative and hospice care, we included only the original question posts, which reflect users’ initial intentions and perspectives. Answers were excluded because they predominantly contained brief institutional referrals or promotional content (eg, advertising health care services or insurance), which were not aligned with the analytical focus of the study. To retrieve relevant data, we used keywords such as “hospice,” “palliative care,” “palliative medicine,” “advance care planning,” and “end-of-life care.” Posts from the platform’s launch in 2002 up to June 30, 2024, were collected using Python’s BeautifulSoup library for web crawling. The extracted data were stored in a structured format that included the title, body text, and date of creation. In cases where the body text was missing, the title was used as a substitute, as it typically conveyed the user’s central inquiry. Social media texts, such as those found on Naver Knowledge iN differ from formal medical documentation or academic articles. They often include informal language, emotive expression, and inconsistent grammar [ 22 23 22 24 25 In topic modeling studies, ensuring that datasets contain relevant content is critical for accurately identifying latent themes. During preprocessing, duplicate and null entries were removed from the collected dataset. Notably, some Naver Knowledge iN search results included posts where relevant keywords appeared only in the answer, rather than in the main body of the question. For example, a text such as “What certification should I pursue?” could be included if the answer mentioned “hospice nurse,” even if the main body of the question had no relevance to palliative care. To address this, we applied explicit inclusion and exclusion criteria to ensure the thematic relevance and analytical integrity of the corpus. Inclusion criteria required the presence of keywords directly related to (1) palliative or hospice care concepts, (2) specific diseases or conditions often requiring such care, or (3) life-sustaining treatment procedures. To capture diverse linguistic expressions, we used n-gram extension and ChatGPT-based term augmentation, subsequently reviewed and validated by subject-matter experts. In contrast, exclusion criteria were derived through keyword frequency analysis and manual screening. Posts were excluded if they contained relevant keywords in non-health-related contexts, such as student assignments, pet care, dermatological concerns, academic or career guidance, insurance advertisements, or fictional writing. A complete list of these criteria is available in the Multimedia Appendix 1 Temporal Trend Analysis To analyze temporal patterns, we extracted the year from each post’s creation date and calculated annual frequencies for each identified topic and sentiment. Because the data for 2024 were incomplete, we estimated full-year values using proportional scaling based on available months. Temporal trends were visualized with line plots, enabling examination of how public discussions evolved in response to major societal and policy events related to palliative and hospice care. Contextualized Topic Modeling Overview We used contextualized topic modeling (CTM) to uncover the latent topics within the corpus. CTM combines traditional word-count methods with advanced language models that understand word meaning based on context. This allows the analysis to not only identify frequently discussed words, but also to group together related ideas even when different words are used, helping uncover more accurate and meaningful topics within the text [ 26 Preprocessing To prepare the text data for analysis, tokenization and Part-of-Speech tagging were performed using the MeCab-ko tokenizer [ 27 TF-IDF Embedding Term frequency-inverse document frequency is a method that assigns higher weights to words that appear frequently in individual documents but are less common across the entire documents. This technique was used to generate a numerical representation for each document, helping to capture the important terms across the corpus [ 28 Contextual Embedding To capture sentence-level meaning, we used a pretrained sentence bidirectional encoder representations from transformers (BERT) model (xlm-r-100langs-bert-base-nli-stsb-mean-tokens) that supports 100 languages, including Korean [ 29 Selecting Optimal Topic Model To identify latent topics in the text, we combined both the term frequency-inverse document frequency vectors and contextual embeddings. We trained multiple models with varying numbers of topics (ranging from 4 to 15) and training durations (epochs, ranging from 10 to 50) to find the best-performing model. Model quality was assessed using coherence scores, which evaluate how semantically related the top words in each topic are. To ensure topic diversity and reduce redundancy, we also examined inverted Rank-Biased Overlap values [ 30 Multiclass Sentiment Analysis To examine the emotional distribution in web-based posts related to palliative and hospice care and to explore the relationship between topics and emotions, we conducted a multiclass sentiment analysis using the Korean bidirectional encoder representations from transformers (KoBERT) model [ 31 32 33 The dataset used for developing the model was constructed by merging 3 publicly available Korean sentiment corpora from AIHub. The final dataset included 146,567 texts labeled across 7 emotion categories: “neutral” (n=48,616), “sadness” (n=27,517), “anger” (n=19,710), “anxiety” (n=15,999), “happiness” (n=14,406), “disgust” (n=5649), and “embarrassment” (n=14,670). During model development, the “anger” and “disgust” categories were merged into a single category called “hostility” to reduce confusion due to overlapping expressions. The final model, therefore, predicted 6 emotion classes. We randomly partitioned the dataset into training (75%) and testing (25%) sets. For model architecture, we adopted a BERTClassifier, which consists of the BERT model followed by a linear classification layer. Each sentence was first converted into tokens using a BERT tokenizer, which splits text into smaller linguistic units suitable for input into the model. To ensure uniform input length, all sequences were truncated or padded to a maximum of 64 tokens. To address class imbalance, we applied Focal Loss, which adjusts the contribution of each class by introducing 2 hyperparameters: alpha, which is calculated dynamically based on class frequencies to assign higher weights to underrepresented classes, and gamma, which focuses learning on incorrectly predicted samples [ 34 F 1 All preprocessing and analyses were conducted using Python. A summary of the overall data processing and analysis workflow is provided in Figure 1 Figure 1 Overview of the data collection, processing, and analysis workflow. BERT: bidirectional encoder representations from transformers. Ethical Considerations This study received exemption from review by the institutional review board at Seoul National University (institutional review board number E2407/001-003). All data used in this study were publicly available posts collected from Naver Knowledge iN. In accordance with Naver’s policy, users are explicitly advised not to include personally identifiable information in their posts. Additionally, during preprocessing, we applied term frequency thresholds to remove rare terms and conducted manual screening to exclude any entries that could potentially reveal personal identity. As a result, all analyzed data were deidentified and did not contain information that could be used to identify individual users. Results Data Characteristics A total of 34,501 posts related to palliative and hospice care were collected from Naver Knowledge iN. After removing the null and duplicate entries, 29,489 posts were screened for relevance. Ultimately, 9072 posts were included in the final analysis after excluding irrelevant content ( Figure 2 Figure 2 Flow diagram of data identification, screening, and inclusion process for palliative care and hospice-related posts collected from Naver Knowledge iN. Temporal Trends in Web-Based Perspectives on Palliative and Hospice Care Figure 3 Figure 3 Temporal dynamics of dataset growth and important events. (A) May 2009, Kim Grandmother’s Case: the Supreme Court ruled that if a patient is medically deemed to have no chance of recovery, artificial life support can be withdrawn to respect the patient’s wishes. (B) July 31, 2013, the National Bioethics Committee recommended institutionalizing a system for life-sustaining treatment decisions. (C) February 2015, designation of a supporting agency for the National Bioethics Committee. (D) February 2016, the “Act on Decisions on Life-Sustaining Treatment for Patients in Hospice and Palliative Care or at the End of Life” (hereafter referred to as the “Life-Sustaining Treatment Decisions Act”) was enacted. (E) February 2018, implementation of the life-sustaining treatment decisions system. (F) January 7, 2019, beginning of the issuance of advance directive registration certificates for life-sustaining treatment decisions. (G) June 25, 2019, the Ministry of Health and Welfare established the “1st Comprehensive Plan for Hospice and Life-Sustaining Treatment (2019-2023).” (H) April 21, 2022, announcement of the application of regular reimbursement rates for decisions to discontinue life-sustaining treatment. The first notable event, Kim Grandmother’s Case in May 2009 ( Figure 3 In July 2013 ( Figure 3 Figure 3 Figure 3 Figure 3 Contextualized Topic Model To identify the key topics of interest from 9072 web-based posts related to palliative and hospice care, we performed a CTM while varying the number of epochs and topics. The diversity scores for the topics consistently remained above 0.9, indicating high topic diversity across the models. For the coherence scores, the researchers closely examined models with a coherence score greater than 0.6. Based on this expert review, a model with 9 topics trained over 50 epochs was selected as the final CTM because it balanced diversity, coherence, and interpretability ( Figure 4 Figure 4 Coherence and diversity scores across several topics and epochs for contextualized topic modeling. Yellow highlights indicate the final selected model. Table 1 Table 1 Themes identified in social media perspectives on palliative and hospice care. Themes Keywords Proportions  English (translation) Korean (original)  Emotional and Psychological Support Love, Tears, Memories, Sound, Last, God, Life, Story, Appearance, Death, Emotion, Happiness, Prayer, Regret, Pain, Marriage, Face, Pronouncement, Religion, Church 사랑, 눈물, 기억, 소리, 마지막, 하나님, 인생, 이야기, 모습, 죽음, 감정, 행복, 기도, 후회, 고통, 결혼, 얼굴, 선고, 종교, 교회 0.159502 Ethical and Legal Concerns Life-sustaining treatment, Brain death, Euthanasia, DNR a 연명 치료, 뇌사, 안락사, dnr, 연명 치료 거부, 연명 치료 중단, 윤리, 연명 의료, 존엄사, 식물 인간, 반박, die, 해석, 찬성, 반대, 적극, 근거, 장치, 동의서, 금지 0.128968 Medical Care in Hospitals Hospital, Long-term care hospital, Treatment, Doctor, Situation, Pain, Seoul b 병원, 요양 병원, 치료, 의사, 상황, 통증, 서울, 입원, 식사, 검사, 항암, 수술, 항암 치료, 고통, 퇴원, 가능, 이상, 진통제, 요양원, 환자 0.121803 Nutrition Management Mushroom, Efficacy, Food, Dietary products, Effect, Consumption, Vegetables, Stomach cancer, AIDS, Fruits, Diabetes mellitus, Purchase, Leukemia, Alzheimer disease, Prevention, Tobacco, Habit, Product, Oral cancer, Diabetes 버섯, 효능, 음식, 식품, 효과, 복용, 야채, 위암, 에이즈, 과일, 당뇨병, 구입, 백혈병, 알츠하이머, 예방, 담배, 습관, 제품, 구강암, 당뇨 0.120811 Disease Treatment Outcomes and Prognosis Surgery, Metastasis, Anticancer treatment, Cure, Survival, Breast cancer, Early stage, Recurrence, Cancer cells, Examination, Probability, Treatment, Lung cancer, Discovery, Lymph nodes, Anticancer, Radiation therapy, Result, Possibility, CT c 수술, 전이, 항암 치료, 완치, 생존, 유방암, 초기, 재발, 암세포, 검사, 확률, 치료, 폐암, 발견, 임파선, 항암, 방사선 치료, 결과, 가능, ct 0.118827 Financial Issues Property, Divorce, Ownership, Contact, Application, Inheritance, Loan, Apartment, Report, Donation, Hospital bills, Renunciation of inheritance, Phone call, Caregiving, Real estate, Debt, Lawsuit, Rent, Document, Tax 재산, 이혼, 명의, 연락, 신청, 상속, 대출, 아파트, 신고, 증여, 병원비, 상속 포기, 전화, 간병, 부동산, 채무, 소송, 월세, 서류, 세금 0.100088 Symptom Management Hospital, Treatment, Anticancer treatment, Surgery, Doctor, Examination, Pain, Symptoms, Teacher (doctor), Metastasis, Anticancer, Meal, Terminal liver cancer, Painkiller, Seoul, Long-term care hospital, Pain, Discharge, Abnormality, Hospitalization 병원, 치료, 항암 치료, 수술, 의사, 검사, 통증, 증상, 선생, 전이, 항암, 식사, 간암 말기, 진통제, 서울, 요양 병원, 고통, 퇴원, 이상, 입원 0.099647 Administrative and Volunteer Services Hospice, Hospice nurse, Hospice ward, Nurse, Specialist nurse, Volunteering, Advance directive for life-sustaining treatment, Hospice hospital, Social welfare, Activity, Nursing, Resource, Registration, Role, Medical care, Yongin b 호스피스, 호스피스 간호사, 호스피스 병동, 간호사, 전문 간호사, 봉사, 사전 연명 의료 의향서, 호스피스 병원, 사회 복지, 활동, 간호, 자원, 등록, 역할, 의료, 용인, 작성, 대학원, 기관, 실습 0.091711 Health Insurance Insurance, Disease, Coverage, Recommendation, Death, Diagnosis, Renewal, Premium, Insurance payment, Illness, Health insurance, Dementia, Product, Whole life insurance, Life, Contract, Hospitalization per diem, Medical expenses, Fire (insurance), Planning 보험, 질병, 보장, 추천, 사망, 진단, 갱신, 보험료, 보험금, 질환, 건강 보험, 치매, 상품, 종신 보험, 생명, 계약, 입원 일당, 의료비, 화재, 설계 0.058642 a b c Figure 5 Figure 5 Annual topic distribution and data volume in social media perspectives on palliative and hospice care (2002-2024). Also, 2024 values are extrapolated. Throughout the study period, “emotional and psychological support” consistently remained among the most frequently discussed topics. Perspectives on “disease treatment outcomes and prognosis,” “financial issues,” and “administrative and volunteer services,” topics related to patients’ circumstances, financial matters, and administrative processes rather than direct care, were moderately represented. Multiclass Sentiment Analysis Figure 6 F 1 F 1 F 1 Figure 6 Performance metrics of the multiclass sentiment analysis model: Accuracy, Precision, Recall, F1-score (harmonic mean of precision and recall), and Confusion Matrix (label: 0 = anxiety, 1 = embarrassment, 2 = hostility, 3 = sadness, 4 = happiness, and 5 = neutral). Figure 7 Figure 7 Annual sentiment distribution and data volume in social media perspectives on palliative and hospice care (2002-2024). Also, 2024 values are extrapolated. Relationships Between the Topics and the Predicted Sentiments Figure 8 Figure 8 Topic-to-sentiment flow in social media perspectives on palliative and hospice care. Discussion Principal Findings This study demonstrates that public interest in palliative and hospice care, as captured through web-based discourse, tends to rise sharply in response to major policy changes and high-profile legal cases. These spikes suggest that regulatory and institutional developments, such as the establishment of national advance directive systems or legislation governing life-sustaining treatment, function as societal turning points that prompt individuals to seek information and engage with end-of-life care issues. This pattern is consistent with prior findings by Huemer et al [ 35 The role of media in catalyzing these shifts cannot be overstated. In South Korea, the “Kim Grandmother’s Case” served as a defining moment that not only raised public awareness but also led to institutional and legal reforms. Media coverage, particularly investigative reports and emotionally resonant narratives, can demystify palliative care, correct misconceptions, and stimulate public discourse [ 36 9 Given these dynamics, social media platforms offer a critical, real-time lens through which evolving public concerns can be monitored and addressed. The clear temporal spikes observed in our analysis illustrate that social discourse is sensitive to policy events and ethical debates. This highlights the need for responsive communication strategies that can align with these moments of heightened attention. By leveraging timely messaging, expanding public education, and integrating awareness campaigns with broader policy initiatives, stakeholders can foster more informed, stigma-free conversations about palliative care. Doing so may ultimately improve uptake of services and better support patients and families navigating end-of-life decisions. Building on these observations, it is important to consider the specific topics that have gained prominence in public discourse. In particular, topics such as “ethical and legal concerns,” “administrative and volunteer services,” “disease treatment outcomes and prognosis,” and “medical care in hospitals” have demonstrated considerable increases in recent years, suggesting growing public interest and need for information. Numerous studies have emphasized the importance of providing palliative and hospice care information early in the course of illness [ 37 38 39 39 Topics related to “nutrition management” were prominent, indicating heightened interest in dietary considerations within palliative care, which aligns with East Asian caregiving traditions that emphasize high-quality, condition-specific food as a key component of care [ 40 41 Meanwhile, the “ethical and legal concerns” theme, encompassing keywords such as “euthanasia,” “life-sustaining treatment,” “DNR (Do-Not-Resuscitate),” “refusal of life-sustaining treatment,” and “withdrawal of life-sustaining treatment,” reflects ongoing social discussions in Korea regarding the discontinuation of futile life-sustaining treatments. This topic can be viewed with particular consideration to this study’s findings on temporal trends in web-based palliative and hospice care perspectives. In particular, the 1997 “Boramae Hospital Case” (which preceded our data analysis period) and the 2008 “Kim Grandmother’s Case” drew substantial public attention to the issue of withdrawal of life-sustaining treatment in Korea, ultimately prompting the creation of related legislation. The “Boramae Hospital Case” involved an intensive care unit patient dependent on mechanical ventilation whose family requested discharge against medical advice due to the treatment costs; the patient subsequently died at home. Another family member sued both the requesting family and the medical staff, and the court found the medical team guilty of aiding homicide through inaction [ 42 43 Despite these legal milestones, withdrawal of treatment remains infrequent in Korea (550/54,699, about 1%) compared with countries like Sweden (7865/12,072, 65.2%) and the global average (42.3%) [ 44 46 9 47 48 Financial concerns are prominently reflected in public discourse on palliative and hospice care, with approximately 16% (1440/9072) of analyzed posts referencing financial burdens or health insurance, comparable in frequency to expressions of emotional distress. Previous research highlights high treatment costs, limited reimbursement, and income loss from prolonged caregiving as critical barriers to care access [ 49 51 52 53 54 In South Korea, the National Health Insurance Service reduces copayments to 0%-10% for patients with terminal cancer, cardiovascular, cerebrovascular, rare, and intractable diseases, significantly lower than the standard 20% for inpatient and 30%-60% for outpatient care. Home-based palliative care, which costs only 9% of equivalent inpatient services (225,688 KRW [US $192.24] vs 2,481,479 KRW [US $2113.70] per week; conversion based on KRW 1174 per US $1 in September 2020), offers significant savings [ 55 Educational materials should not only emphasize the cost-saving benefits of palliative and hospice care but also provide detailed information on available financial support. Policy efforts must expand to include paid family care leave and promote equitable access to home-based services. In particular, coordination with existing public health initiatives, such as home-visiting nursing services via community health centers or long-term care insurance programs, could enhance outreach, education, and timely identification of eligible patients in need of palliative care. A notable finding of the sentiment analysis was the high prevalence of neutral sentiments, which were relatively evenly distributed across all identified topics. This pattern reflects the informational nature of the social media platform, Naver Knowledge iN, where users often seek factual guidance rather than emotional support. Representative questions include: “Where can I draft an advance directive for life-sustaining treatment?” and “Which mushrooms are beneficial to terminal cancer patients?”. These examples point to a strong public demand for practical, reliable, and easily accessible information related to end-of-life care. In response to this need, the development of AI-driven tools, such as large language model–based domain-specific chatbots, could offer a scalable solution. By delivering timely, accurate, and empathetic answers, such tools can help reduce informational barriers, address misconceptions, and better support both individuals directly affected by serious illness and members of the general public seeking guidance. In contrast, “sadness” emerged as the most frequent emotion, followed by “neutral” and “anxiety.” The prominence of “sadness” reflects the emotional burden commonly associated with serious illness and end-of-life decision-making. Although the identities of individual posters remain unknown due to the platform’s anonymity, it is plausible that many posts were authored by patients, family caregivers, or individuals with personal experience of palliative care. Notably, “anxiety,” “hostility,” and “embarrassment” were closely linked to topics such as “emotional and psychological support,” “nutrition management,” and “symptom management,” suggesting frequent emotional struggles in navigating disease progression. These findings align with prior research reporting high levels of psychological distress among people facing terminal illness [ 56 57 39 58 Despite the growing public interest in palliative care, communication between health care providers and individuals facing serious illness remains a persistent challenge [ 18 5 59 Beyond clinical tools such as the supportive and palliative care indicators tool that support provider-initiated conversations, broader cultural change is also necessary to normalize discussions about death and dying across society. In South Korea, while the concept of dignified dying (also known as well-dying) has gained limited attention in the context of an aging society, public discourse around death remains marginal. Cultural taboos rooted in Confucian and Buddhist traditions often associate such discussions with misfortune, inhibiting timely communication among health care providers, patients, and families [ 60 61 62 Limitations This study has several limitations, particularly in the context of broader frameworks of serious illness and care. First, the analysis of Naver Knowledge iN posts lacked contextual details regarding the author’s background as well as clinical information such as diagnosis, disease stage, or palliative care status. These limitations stem from the anonymous and unstructured nature of the platform. As a result, the dataset may not fully reflect the diversity of serious illness experiences, including non-cancer conditions such as chronic obstructive pulmonary disease or congestive heart failure [ 63 F 1 64 Conclusions This study offers novel insights into public discourse on palliative and hospice care in South Korea by analyzing large-scale social media data. Our findings reveal that emotionally negative sentiments, particularly sadness and anxiety, are prevalent and closely tied to key concerns such as symptom management, ethical dilemmas, and financial burdens. Notably, approximately 16% (1440/9072) of posts addressed concerns related to caregiving stress or economic hardship, reflecting the multifaceted challenges of palliative care as expressed by individuals participating in web-based discussions. The prevalence of neutral, fact-seeking queries underscores a strong public demand for accessible and reliable information. At the same time, widely documented misconceptions, such as viewing palliative care as giving up on treatment, continue to hinder effective communication, reinforcing the need for clearer communication. However, the anonymous and unstructured nature of platforms like Naver Knowledge iN limits their potential for sustained, interactive dialogue. To address this gap, user-centered tools, such as culturally tailored educational materials, AI-powered chatbots, or moderated web-based forums, could provide timely and emotionally responsive support. These tools may also bridge public needs and clinical systems by identifying emerging concerns and facilitating early intervention. In parallel, policy and education initiatives, including the integration of death education into school and community curricula, are essential to normalize conversations about dying and promote informed, compassionate decision-making. By demonstrating the utility of social media analysis for capturing real-time public concerns, this study contributes to global efforts in end-of-life care advocacy, underscoring the importance of culturally responsive communication strategies and emotional support infrastructures. This research used datasets from “The Open AI Dataset Project (AI-Hub, S. Korea).” All data information can be accessed through “AI-Hub.” This work was supported by the National Research Foundation of Korea (NRF) grant funded by the Korean government (MIST) (number RS-2024-00334672). Authors' Contributions: AK contributed to the research conception, design, data acquisition, data analysis, and data interpretation. KW contributed to the research conception, data interpretation, funding acquisition, supervision, and mentorship. All authors contributed substantially to the drafting and revision of the manuscript’s intellectual content and approve the final manuscript and this submission. Conflicts of Interest: None declared. Multimedia Appendix 1 Criteria for data inclusion and exclusion in screening. Abbreviations AI artificial intelligence BERT bidirectional encoder representations from transformers CTM contextualized topic modeling KoBERT Korean bidirectional encoder representations from transformers Data Availability The datasets analyzed during this study are not publicly available due to personal information protection regulations and platform policies but are available from the corresponding author on reasonable request. 1 What are palliative care and hospice care? NIH National Institute of Aging 2021 2024-09-11 https://www.nia.nih.gov/health/hospice-and-palliative-care/what-are-palliative-care-and-hospice-care 2 Cohen J Gott M Dying in place in old age: public health challenges Palliative Care for Older People: Public Health Perspective 2015 Oxford Oxford University Press 107 119 3 Meghani SH A concept analysis of palliative care in the United States J Adv Nurs 2004 04 46 2 152 61 10.1111/j.1365-2648.2003.02975.x 15056328 JAN2975 15056328 4 Kim K Kim W Jeong NE Yeon KS Young CJ The national hospice policy of the 2nd comprehensive hospice and life- sustaining treatment plan (2024-2028) in the Republic of Korea Health Policy Manag 2025 35 1 16 25 10.4332/KJHPA.2025.35.1.16 5 Cai Y Lalani N Examining barriers and facilitators to palliative care access in rural areas: a scoping review Am J Hosp Palliat Care 2022 01 39 1 123 130 10.1177/10499091211011145 33906486 33906486 6 Li W Chhabra J Singh S Palliative care education and its effectiveness: a systematic review Public Health 2021 194 96 108 10.1016/j.puhe.2021.02.033 33873061 S0033-3506(21)00104-9 33873061 7 McIlfatrick S Slater P Beck E Bamidele O McCloskey S Carr K Muldrew D Hanna-Trainor L Hasson F Examining public knowledge, attitudes and perceptions towards palliative care: a mixed method sequential study BMC Palliat Care 2021 20 1 44 10.1186/s12904-021-00730-5 33731087 10.1186/s12904-021-00730-5 33731087 PMC7971949 8 Zimmermann C Wong JL Swami N Pope A Cheng Y Mathews J Howell D Sullivan R Rodin G Hannon B Moineddin R Le LW Public knowledge and attitudes concerning palliative care BMJ Support Palliat Care 2021 14 e1 e1085 e1095 10.1136/bmjspcare-2021-003340 34620693 bmjspcare-2021-003340 34620693 9 Kim B Lee J Choi YS Public awareness of advance care planning and hospice palliative care: a nationwide cross-sectional study in Korea BMC Palliat Care 2023 22 1 205 10.1186/s12904-023-01333-y 38151721 10.1186/s12904-023-01333-y 38151721 PMC10752019 10 Schofield G Dittborn M Huxtable R Brangan E Selman LE Real-world ethics in palliative care: a systematic review of the ethical challenges reported by specialist palliative care practitioners in their clinical practice Palliat Med 2021 35 2 315 334 10.1177/0269216320974277 33302783 33302783 PMC7897798 11 Kuehn BM More than one-third of US individuals use the internet to self-diagnose JAMA 2013 309 8 756 757 10.1001/jama.2013.629 23443421 1656251 23443421 12 Song TM Park EJ Lim EJ The survey of the demand for health information on the internet J Korean Soc Med Inform 2002 8 2 17 10.4258/jksmi.2002.8.2.17 13 Valdez D Mena-Meléndez L Crawford BL Jozkowski KN Analyzing reddit forums specific to abortion that yield diverse dialogues pertaining to medical information seeking and personal worldviews: data mining and natural language processing comparative study J Med Internet Res 2024 26 e47408 10.2196/47408 38354044 v26i1e47408 38354044 PMC10902765 14 Chi Y Chen H Investigating substance use via reddit: systematic scoping review J Med Internet Res 2023 25 e48905 10.2196/48905 37878361 v25i1e48905 37878361 PMC10637357 15 Loosier PS Renfro K Carry M Williams SP Hogben M Aral S Reddit on PrEP: posts about pre-exposure prophylaxis for HIV from Reddit users, 2014-2019 AIDS Behav 2022 26 4 1084 1094 10.1007/s10461-021-03463-x 34536176 10.1007/s10461-021-03463-x 34536176 16 Peters J Heckel M Breindl E Ostgathe C What does \"Palliative\" mean? sentiment, knowledge, and public perception concerning palliative care on the internet since the COVID-19 pandemic Palliat Med Rep 2024 5 1 512 520 10.1089/pmr.2024.0057 39758850 10.1089/pmr.2024.0057 39758850 PMC11693953 17 Fliedner MC Zambrano SC Eychmueller S Public perception of palliative care: a survey of the general population Palliat Care Soc Pract 2021 15 26323524211017546 10.1177/26323524211017546 34164622 10.1177_26323524211017546 34164622 PMC8191057 18 Sarmet M Kabani A Coelho L Dos Reis SS Zeredo JL Mehta AK The use of natural language processing in palliative care research: a scoping review Palliat Med 2023 37 2 275 290 10.1177/02692163221141969 36495082 36495082 19 Park E Kim Y Park CS [A comparison of hospice care research topics between Korea and other countries using text network analysis] J Korean Acad Nurs 2017 47 5 600 612 10.4040/jkan.2017.47.5.600 29151558 47.600 29151558 20 Husnayain A Shim E Fuad A Su EC Predicting new daily COVID-19 cases and deaths using search engine query data in South Korea from 2020 to 2021: infodemiology study J Med Internet Res 2021 23 12 e34178 10.2196/34178 34762064 v23i12e34178 34762064 PMC8698803 21 Park TH Kim WI Park S Ahn J Cho MK Kim S Public interest in acne on the internet: comparison of search information from google trends and naver J Med Internet Res 2020 22 10 e19427 10.2196/19427 33104003 v22i10e19427 33104003 PMC7652686 22 Ali Mustofa B Laksito Yuly Saptomo W Use of natural language processing in social media text analysis J Artif Intell Eng Appl 2025 4 2 1235 1238 10.59934/jaiea.v4i2.875 23 Baldwin T Social media: friend or foe of natural language processing? 2012 Proceedings of the 26th Pacific Asia Conference on Language, Information, and Computation 2025 August 27 Bali, Indonesia 58 59 24 Foufi V Timakum T Gaudet-Blavignac C Lovis C Song M Mining of textual health information from reddit: analysis of chronic diseases with extracted entities and their relations J Med Internet Res 2019 21 6 e12876 10.2196/12876 31199327 v21i6e12876 31199327 PMC6595941 25 Orr W Crawford K Building better datasets: seven recommendations for responsible design from dataset creators arXiv:2409.00252 2024 10.48550/arxiv.2409.00252 26 Bianchi F Terragni S Hovy D Pre-training is a hot topic: contextualized document embeddings improve topic coherence 2021 Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (Volume 2: Short Papers) 2025 August 27 Online USA Association for Computational Linguistics 759 766 10.18653/v1/2021.acl-short.96 27 SOMJANG Mecab-ko-for-Google-Colab GitHub repository 2023 2025-08-27 https://github.com/SOMJANG/Mecab-ko-for-Google-Colab 28 Manning CD Manning CD Raghavan P Schütze H Introduction to Information Retrieval 2008 New York Cambridge University Press 29 Reimers N Gurevych I Making monolingual sentence embeddings multilingual using knowledge distillation 2020 Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP) 2025 August 27 Stroudsburg, PA, USA Association for Computational Linguistics 4512 4525 10.18653/v1/2020.emnlp-main.365 30 Zankadi H Idrissi A Daoudi N Hilal I Identifying learners' topical interests from social media content to enrich their course preferences in MOOCs using topic modeling and NLP techniques Educ Inf Technol (Dordr) 2023 28 5 5567 5584 10.1007/s10639-022-11373-1 36373041 11373 36373041 PMC9638446 31 SKTBrain Korean BERT pre-trained cased (KoBERT) GitHub Repository 2004 2025-08-27 https://github.com/SKTBrain/KoBERT 32 Liu M Yuan S Li B Zhang Y Liu J Guan C Chen Q Ruan J Xie L Chinese public attitudes and opinions on health policies during public health emergencies: sentiment and topic analysis J Med Internet Res 2024 26 e58518 10.2196/58518 39466313 v26i1e58518 39466313 PMC11555446 33 Alexander G Bahja M Butt GF Automating large-scale health care service feedback analysis: sentiment analysis and topic modeling study JMIR Med Inform 2022 10 4 e29385 10.2196/29385 35404254 v10i4e29385 35404254 PMC9039814 34 Lin TY Goyal P Girshick R He K Dollar P Focal loss for dense object detection 2017 IEEE International Conference on Computer Vision (ICCV) 2017 October 22-29 Venice, Italy 2999 3007 10.1109/iccv.2017.324 35 Huemer M Jahn-Kuch D Hofmann G Andritsch E Farkas C Schaupp W Masel EK Jost PJ Pichler M Trends and patterns in the public awareness of palliative care, Euthanasia, and end-of-life decisions in 3 central European countries using big data analysis from Google: retrospective analysis J Med Internet Res 2021 23 9 e28635 10.2196/28635 34542419 v23i9e28635 34542419 PMC8491122 36 Carrasco JM Gómez-Baceiredo B Navas A Krawczyk M García M Centeno C Social representation of palliative care in the Spanish printed media: a qualitative analysis PLoS One 2019 14 1 e0211106 10.1371/journal.pone.0211106 30682109 PONE-D-18-01193 30682109 PMC6347435 37 Austin L Luker K Caress A Hallett C Palliative care: community nurses' perceptions of quality Qual Health Care 2000 9 3 151 158 10.1136/qhc.9.3.151 10980075 10980075 PMC1743533 38 Welch LC Miller SC Martin EW Nanda A Referral and timing of referral to hospice care in nursing homes: the significant role of staff members Gerontologist 2008 48 4 477 484 10.1093/geront/48.4.477 18728297 48/4/477 18728297 39 Lorenz KA Lynn J Dy SM Shugarman LR Wilkinson A Mularski RA Morton SC Hughes RG Hilton LK Maglione M Rhodes SL Rolon C Sun VC Shekelle PG Evidence for improving palliative care at the end of life: a systematic review Ann Intern Med 2008 148 2 147 159 10.7326/0003-4819-148-2-200801150-00010 18195339 148/2/147 18195339 40 Martinson IM Leavitt M Liu C Armstrong V Hornberger L Zhang J Han X Comparison of Chinese and caucasian families caregiving to children with cancer at home: part I J Pediatr Nurs 1999 14 2 99 109 10.1016/S0882-5963(99)80044-X 10337121 S0882-5963(99)80044-X 10337121 41 Yao R He C Xiao P 'Food and medicine continuum' in the East and West: old tradition and current regulation Chin Herb Med 2023 15 1 6 14 10.1016/j.chmed.2022.12.002 36875443 S1674-6384(22)00132-0 36875443 PMC9975626 42 Supreme Court of Korea Murder (acknowledged crime: aiding and abetting murder), murder Case Law Information 2004 2024-11-17 https://www.law.go.kr/%ED%8C%90%EB%A1%80/(2002%EB%8F%84995) 43 Supreme Court of Korea Removal of meaningless life-sustaining treatment devices, etc Case Law Information 2009 2024-11-17 https://www.law.go.kr/%ED%8C%90%EB%A1%80/(2009%EB%8B%A417417) 44 Nolin T Walther S The relationship between life-sustaining treatment limitation and organ donation in Swedish intensive care: a nationwide register study Acta Anaesthesiol Scand 2021 65 8 1095 1101 10.1111/aas.13832 33866543 33866543 45 Mark NM Rayner SG Lee NJ Curtis JR Global variability in withholding and withdrawal of life-sustaining treatment in the intensive care unit: a systematic review Intensive Care Med 2015 41 9 1572 1585 10.1007/s00134-015-3810-5 25904183 25904183 46 Kim CJ Hong KS Cho S Park J Comparison of factors influencing the decision to withdraw life-sustaining treatment in intensive care unit patients after implementation of the life-sustaining treatment act in Korea Acute Crit Care 2024 39 2 294 303 10.4266/acc.2023.01130 38863360 acc.2023.01130 38863360 PMC11167413 47 Kim YJ Kim SH Advance care planning in South Korea Z Evid Fortbild Qual Gesundhwes 2023 180 68 73 10.1016/j.zefq.2023.04.014 37353427 S1865-9217(23)00082-X 37353427 48 Lee YJ Kim S Yoo SH Kim A Lin C Fhea Sup Sup Martina D Mori M Suh SY Advance care planning in palliative care in Asia: barriers and implications J Hosp Palliat Care 2024 27 4 107 119 10.14475/jhpc.2024.27.4.107 39691175 jhpc-27-4-107 39691175 PMC11646817 49 Salazar MM Khera N Chino F Johnston E Financial hardship for patients with cancer and caregivers at end of life in the USA: narrative review BMJ Support Palliat Care 2024 14 1 25 35 10.1136/spcare-2023-004556 38123962 spcare-2023-004556 38123962 50 Collado L Brownell I The crippling financial toxicity of cancer in the United States Cancer Biol Ther 2019 20 10 1301 1303 10.1080/15384047.2019.1632132 31291813 31291813 PMC6783117 51 Klaiman T Steckel J Hearn C Diana A Ferrell WJ Emanuel EJ Navathe AS Parikh RB Hospice administrators' and providers' perspectives on providing upstream palliative care: facilitators, barriers, and policy prescriptions J Palliat Med 2024 27 10 1359 1367 10.1089/jpm.2024.0138 39069886 39069886 52 Tang ST Mccorkle R Determinants of congruence between the preferred and actual place of death for terminally ill cancer patients J Palliat Care 2003 19 4 230 237 14959592 14959592 53 Sheridan PE LeBrett WG Triplett DP Roeland EJ Bruggeman AR Yeung HN Murphy JD Cost savings associated with palliative care among older adults with advanced cancer Am J Hosp Palliat Care 2021 38 10 1250 1257 10.1177/1049909120986800 33423523 33423523 PMC9019862 54 Luta X Ottino B Hall P Bowden J Wee B Droney J Riley J Marti J Evidence on the economic value of end-of-life and palliative care interventions: a narrative review of reviews BMC Palliat Care 2021 20 1 89 10.1186/s12904-021-00782-7 34162377 10.1186/s12904-021-00782-7 34162377 PMC8223342 55 Kim Y Han E Lee J Kang H Cost-effectiveness analysis of home-based hospice-palliative care for terminal cancer patients J Hosp Palliat Care 2022 25 2 76 84 10.14475/jhpc.2022.25.2.76 37675194 jhpc-25-2-76 37675194 PMC10180035 56 Kozlov E Phongtankuel V Prigerson H Adelman R Shalev A Czaja S Dignam R Baughn R Reid MC Prevalence, severity, and correlates of symptoms of anxiety and depression at the very end of life J Pain Symptom Manage 2019 58 1 80 85 10.1016/j.jpainsymman.2019.04.012 31004771 S0885-3924(19)30180-0 31004771 PMC6726373 57 Götze H Brähler E Gansera L Schnabel A Gottschalk-Fleischer A Köhler N Anxiety, depression and quality of life in family caregivers of palliative cancer patients during home care and after the patient's death Eur J Cancer Care (Engl) 2018 27 2 e12606 10.1111/ecc.12606 27859889 27859889 58 Vernon E Hughes MC Kowalczyk M Measuring effectiveness in community-based palliative care programs: a systematic review Soc Sci Med 2022 296 114731 10.1016/j.socscimed.2022.114731 35131612 S0277-9536(22)00034-X 35131612 59 Highet G Crawford D Murray SA Boyd K Development and evaluation of the supportive and palliative care indicators Tool (SPICT): a mixed-methods study BMJ Support Palliat Care 2014 4 3 285 290 10.1136/bmjspcare-2013-000488 24644193 bmjspcare-2013-000488 24644193 60 Im H Lee I Kim S Lee JS Kim J Moon JY Park BK Lee KH Lee MA Han S Hong Y Kim H Cheon J Koh S Experience and perspectives of end-of-life care discussion and physician orders for life-sustaining treatment of Korea (POLST-K): a cross-sectional study BMC Med Ethics 2023 24 1 18 10.1186/s12910-023-00897-x 36882795 10.1186/s12910-023-00897-x 36882795 PMC9993746 61 Han SK Eo Y Patients' dying process from the point of view of family and hospice team: a qualitative exploration of family member and hospice team experiences with hospice in Korea Omega (Westport) 2022 86 2 533 552 10.1177/0030222820976428 33287647 33287647 62 Lee J Kim J Kim T Kim C Communication about death and confidence levels concerning death-related issues among Koreans Korean J Fam Pract 2019 9 3 303 310 10.21215/kjfp.2019.9.3.303 63 Ernecoff NC Hanson LC Fox AL Daaleman TP Kistler CE Palliative care in a community-based serious-illness care program J Palliat Med 2020 23 5 692 697 10.1089/jpm.2019.0174 31644370 31644370 64 Bouazizi M Ohtsuki T Multi-class sentiment analysis on twitter: classification performance and challenges Big Data Min. Anal 2019 2 3 181 194 10.26599/bdma.2019.9020002 ",
  "metadata": {
    "Title of this paper": "Multi-class sentiment analysis on twitter: classification performance and challenges",
    "Journal it was published in:": "Journal of Medical Internet Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485256/"
  }
}