{
  "title": "Paper_1005",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469951 PMC12469951.1 12469951 12469951 41009502 10.3390/ijms26188933 ijms-26-08933 1 Article Mitotic Disruption and Cytoskeletal Alterations Induced by Acorus calamus https://orcid.org/0000-0001-9656-4967 Wróblewski Mateusz Conceptualization Methodology Formal analysis Investigation Resources Data curation Writing – original draft Visualization Project administration Funding acquisition 1 2 https://orcid.org/0000-0001-5484-2340 Gocek Natalia Visualization 1 2 https://orcid.org/0000-0001-6401-2068 Żabka Aneta Methodology Resources 1 https://orcid.org/0000-0002-9655-001X Polit Justyna T. Conceptualization Methodology Validation Writing – review & editing Supervision 1 * Janda Tibor Academic Editor 1 mateusz.wroblewski@biol.uni.lodz.pl natalia.gocek@biol.uni.lodz.pl aneta.zabka@biol.uni.lodz.pl 2 * justyna.polit@biol.uni.lodz.pl 13 9 2025 9 2025 26 18 497349 8933 11 8 2025 08 9 2025 11 9 2025 13 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Essential oils are increasingly recognized as promising agents for sustainable weed control due to their selectivity and complex modes of action. This study evaluated the effects of Acorus calamus Vicia faba Lupinus luteus Brassica napus Arabidopsis thaliana 50 phytotoxicity mitotic index chromosomal aberrations CDKA epigenetics cytoskeleton IDUB Doctoral Research Grants at the University of Lodz 9/DGB/IDUB/2022 The research was supported by IDUB Doctoral Research Grants at the University of Lodz (Grant no. 9/DGB/IDUB/2022). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The extensive use of chemical pesticides, driven by global demand for high crop yields and aesthetic products, has significant detrimental effects on the environment and human health. Due to their poor biodegradability, crops and soil are abundant in their toxic remains. Nowadays, increasing efforts are being undertaken to reduce the use of chemical pesticides, which induce resistance in target organisms and hamper the well-being of non-targeted ones [ 1 2 3 4 5 6 7 Some crop plants can control the weed competitors by excreting chemical substances that affect the growth of the neighboring plants. The phenomenon called allelopathy is based on a chemical interaction between two plant species where one excretes allelochemicals represented by plant secondary metabolites, which are detrimental to the second one. Allelopathy has been observed for many plant species [ 8 9 10 11 12 13 14 Essential oils (EOs) are other allelochemicals originating from plant secondary metabolism. These volatile substances exhibiting allelopathic activities are complex mixtures of 20–60 active ingredients classified as terpenes, phenylpropanoids, alcohols, aldehydes, and esters [ 15 16 8 17 18 19 20 21 22 10 11 21 23 24 25 26 27 Citrus aurantiifolia 28 Mentha longifolia 29 16 Origanum vulgare 23 24 Artemisia argyi 30 10 16 17 20 23 25 31 32 Schinus terebinthifolius Schinus molle 33 An essential oil possessing intriguing properties is produced in rhizomes of sweet flag ( Acorus calamus 34 35 36 35 36 37 38 39 40 12 22 50 22 41 42 43 16 Plant cell proliferation is highly sensitive to environmental factors and relies on conserved eukaryotic mechanisms with plant-specific features, regulated mainly at the G1/S and G2/M transitions [ 44 45 46 47 48 49 50 51 52 53 54 55 53 56 57 58 59 60 61 62 63 64 65 66 67 68 69 In early G1, CDKA/CycD complexes, once activated by CAK and released from CKI or WEE1 inhibition, phosphorylate RBR proteins, thereby releasing E2F/DP to induce transcription required for DNA replication. Replication origin licensing and checkpoints mediated by ATM/ATR kinases and CHK-like proteins then secure accurate initiation and fidelity of S phase [ 52 67 70 71 72 73 During G2, increasing levels of CycA, B, and D form complexes with CDKA (the plant homolog of yeast and animal Cdc2/CDK1) or with the plant-specific CDKB to promote mitotic entry [ 45 66 67 68 69 74 75 76 69 77 Active CDK/Cyc complexes further phosphorylate CKIs, preventing secondary repression, and act on substrates that drive mitosis. These include transcription factors such as MYB3R, which activate genes encoding mitotic proteins (e.g., CDC20, CycA, CycB, NACK1) [ 54 78 79 80 81 82 83 In plant cells, early mitotic events are coordinated by the preprophase band (PPB), a transient microtubule–actin structure that marks the future division plane [ 83 83 84 85 86 83 83 83 86 Alongside cytoskeletal reorganization, chromatin undergoes major structural changes during mitosis. In the G2/M transition, previously decondensed and transcriptionally active chromatin compacts into mitotic chromosomes through the action of structural maintenance of chromosome (SMC) complexes: condensins drive condensation, while cohesins hold sister chromatids together until anaphase. Together, they provide the scaffold required for chromosome architecture and accurate segregation [ 87 84 88 89 89 90 88 89 As in other eukaryotes, plant mitosis is safeguarded by the spindle assembly checkpoint (SAC), which delays anaphase until all kinetochores are properly attached to spindle microtubules, thereby ensuring accurate chromosome segregation and genome stability [ 83 88 This study aimed to elucidate the bioherbicidal potential of SEO by examining its effects on mitosis, the final stage of the plant cell cycle. Despite documented bioactivity in animal models and in vitro 39 42 91 Vicia faba minor Lupinus luteus 92 93 Brassica napus Arabidopsis thaliana B. napus A. thaliana 94 50 22 41 We hypothesized that SEO disrupts mitosis by altering the abundance of key cell cycle regulator Cdc2 (the conserved homolog of plant CDKA), spindle organization, and mitotic chromatin structure, and that these effects may vary among species, revealing taxon-specific responses or family-level patterns. To test this, we assessed the abundance of Cdc2, mitotic indices, aberrations in mitotic figures, spindle microtubule and actin filament organization, and histone phosphorylation at H3T3 and H3S10. This framework provides both a mechanistic understanding of SEO action in plant cells and insights into its potential as a selective, eco-friendly bioherbicide. 2. Results 2.1. Effects of SEO on Mitotic Activity and Chromosomal Integrity in Root Meristematic Cells Mitosis represents the shortest phase of the cell cycle, and cell divisions in the root meristem occur asynchronously and with varying intensity among plant species. Consequently, in control root meristems, the mitotic index (MI) was relatively low and species-specific, averaging approximately 17% in V. faba L. luteus B. napus A. thaliana Figure 1 V. faba L. luteus B. napus A. thaliana Figure 1 V. faba L. luteus B. napus A. thaliana Figure 1 The emulsifier, used to prepare a uniformly distributed SEO emulsion in the culture medium where the seedlings were grown, had no statistically significant effect on the mitotic index ( Figure 1 Figure 1 Despite interspecific differences in chromosome number, size, and morphology (compare Figure 2 Figure 3 Figure 4 Figure 5 41 Following exposure to SEO, notable alterations were observed in the mitotic parameters of the root meristems. The mitotic index significantly declined to an average of 6.5% in V. faba L. luteus B. napus A. thaliana Figure 1 Figure 1 Moreover, in SEO-treated root meristems of all four species, alongside mitotic figures displaying a normal appearance, cells were also observed to exhibit similar chromosomal structural abnormalities at consecutive stages of mitosis. In prophase, chromatin displayed an uneven degree of condensation, with clearly demarcated, intensely Feulgen-positive regions, likely corresponding to heterochromatic domains (compare figures: Figure 2 Figure 3 Figure 4 Figure 5 Figure 2 Figure 3 Figure 4 Figure 5 V. faba Figure 2 B. napus Figure 4 Figure 2 Figure 3 Figure 4 Figure 5 Figure 2 Figure 3 Figure 4 Figure 5 In anaphase, chromatid separation appeared impaired, most notably in V. faba Figure 2 Figure 3 Figure 4 Figure 5 Figure 2 Figure 3 Figure 4 Figure 5 Figure 4 Figure 5 The percentage of mitotic figures exhibiting abnormalities or chromosomal aberrations was similar across all studied species, averaging around 20–25% of dividing cells ( Figure 1 Figure 1 2.2. Assessment of the SEO Effects on Cell Cycle Regulator The observed decrease in mitotic activity prompted an analysis of the level of a key mitotic regulatory protein, Cdc2, whose presence is maintained throughout the cell cycle, in contrast to cyclins that undergo periodic synthesis and degradation. This choice allowed the detection of the protein regardless of the cell cycle phase. Western blot analysis focused on representatives of the Fabaceae and Brassicaceae families revealed that Cdc2 protein levels in root meristem cells of V. faba B. napus V. faba B. napus 50 V. faba B. napus Figure 6 2.3. Assessment of the SEO Effects on Plant Cytoskeleton The observed disturbances in mitotic figures, particularly during metaphase and anaphase, suggested that defects in spindle organization might be responsible, as the dynamic reorganization of the mitotic spindle is essential for proper chromosome movement. Since the spindle is composed of polymerized heterodimers of α- and β-tubulin, which can be identified immunocytochemically, an analysis was undertaken to visualize β-tubulin using fluorescence microscopy. In meristematic cells of control and emulsifier-treated roots of V. faba Figure 7 L. luteus Figure 8 B. napus Figure 9 A. thaliana Figure 10 Figure 7 Figure 8 Figure 9 Figure 10 Figure 7 Figure 8 Figure 9 Figure 10 Figure 7 Figure 8 Figure 9 Figure 10 Figure 7 Figure 8 Figure 9 Figure 10 Figure 7 Figure 8 Figure 9 Figure 10 Figure 7 Figure 8 Figure 9 Figure 10 Figure 7 Figure 8 Figure 9 Figure 10 After 24 h of SEO treatment, the tubulin architecture in V. faba Figure 11 L. luteus Figure 12 B. napus Figure 13 A. thaliana Figure 14 Figure 11 Figure 12 Figure 13 Figure 14 Figure 11 Figure 12 Figure 13 Figure 14 Figure 11 Figure 12 Figure 13 Figure 14 Figure 11 Figure 12 Figure 13 Figure 14 V. faba Figure 11 Figure 12 Figure 13 Figure 14 Figure 11 Figure 12 Figure 13 Figure 14 Another equally important component of the plant cell cytoskeleton is the actin network, which is highly responsive to various microlocal signals. In meristematic cells, the actin architecture undergoes dynamic reorganization, ranging from delicate, extended filaments forming a dispersed cortical network to more compact, locally concentrated bundles. In control cells and those treated with the emulsifier, both types of actin organization were observed in all four analyzed species ( Figure 15 V. faba Figure 15 L. luteus Figure 15 B. napus Figure 15 A. thaliana Figure 15 50 2.4. Assessment of the Alterations in Chromatin Structure by Modifying H3 Phosphorylation Patterns Followed by SEO Treatment The condensation of chromatin into mitotic chromosomes and the recruitment of specific mitotic regulatory proteins are fundamental events ensuring the accurate segregation of genetic material during mitosis. This process is tightly regulated by specific histone epigenetic modifications. Among the most common epigenetic marks associated with mitosis are the phosphorylation of histone H3 at threonine 3 and serine 10. In all examined species, similar defects in chromatin condensation and mitotic figure morphology were observed. Therefore, the epigenetic analyses focused on V. faba B. napus In mitotic root cells of control plants ( V. faba B. napus Figure 16 Figure 17 Figure 16 Figure 17 V. faba B. napus Figure 16 Figure 17 V. faba Figure 16 B. napus Figure 17 Figure 16 Figure 17 Following treatment with SEO at the IC 50 V. faba B. napus Figure 16 Figure 17 V. faba B. napus Figure 16 Figure 16 Figure 16 Figure 16 Figure 16 Under physiological conditions, the phosphorylated form of histone H3 at serine 10 (H3S10Ph) is predominantly localized to the pericentromeric regions of mitotic chromosomes ( Figure 18 Figure 19 Vicia faba Figure 18 Brassica napus Figure 19 Figure 18 Figure 19 Figure 18 Figure 19 Figure 18 Figure 19 V. faba B. napus Following treatment with SEO at the IC 50 Figure 18 Figure 19 V. faba B. napus Figure 18 Figure 19 Figure 18 Figure 19 Figure 18 Figure 19 3. Discussion Plant growth, from the earliest stages of development through to the end of the life cycle, is sustained by the continuous activity of meristematic tissues. Consequently, cell cycle is at the core of current research efforts aimed at identifying effective strategies to suppress the growth of undesirable plants, thereby enhancing the protection and productivity of crop species in monoculture systems [ 41 25 28 32 95 96 A. calamus 3.1. Bioherbicidal Potential of SEO: Root Growth Inhibition via Cell Cycle Disruption Our previous research demonstrated that SEO exerts a species-specific, concentration-dependent phytotoxic effect, limiting Brassicaceae growth while sparing Fabaceae. This effect was associated with oxidative stress: Fabaceae accumulated higher ROS levels but activated more efficient antioxidant defenses, whereas Brassicaceae, despite lower ROS accumulation, experienced stronger metabolic disruptions [ 22 Figure 20 41 42 Allium cepa A. calamus 81 91 40 3.2. Underlying Mechanisms of Mitotic Index Reduction Our previous studies revealed that SEO, aside from asarones, consists of a number of phenylpropanoid compounds, including methyl-eugenol, safrol, isoacoramone, and asaronaldehyde [ 97 V. faba B. napus It is well established that phenylpropanoid compounds strongly affect plant cell cycle regulation. For instance, in A. thaliana 98 99 99 100 101 35 102 These findings provide a rationale to suggest that, given the universal nature of the core regulatory mechanisms governing the cell cycle across plant, animal, and even cancer cells, the components of SEO may contribute to broad changes in gene expression in meristematic cells, beyond the observed reduction in Cdc2 (CDKA) abundance ( Figure 20 Figure 20 103 3.3. Disruption of Mitotic Progression via Cytoskeletal Disorganization Induced by SEO A second clear target of SEO activity was the disruption of cells that had already passed the G2 checkpoint and entered division. The marked increase in the metaphase index indicates interference with spindle microtubule function, similar to the effects of classical microtubule-disrupting agents such as colchicine, oryzalin, and propyzamide [ 104 This hypothesis was further supported by immunofluorescence analysis with anti-tubulin antibodies, which revealed major alterations in microtubule organization. Microtubules appeared thickened, densely bundled, and formed distinct bands, suggesting excessive lateral association and stabilization within the spindle structure. Additionally, difficulties in microtubule reorganization were observed, including the prolonged persistence of the preprophase band, even though nuclear morphology indicated that cells had already entered prometaphase—a stage that, under control conditions, typically coincides with the rearrangement of the microtubule network around the disassembling nuclear envelope [ 83 Similarly, immunolabeling of actin microfilaments revealed enhanced fluorescence, indicating thickening, excessive stabilization, or aggregation that could impair proper reorganization during mitosis under SEO treatment. Despite these alterations, the general architecture of the actin cytoskeleton remained preserved. Short, bundled microfilaments and long strands stabilizing the nucleus in interphase were still present, along with the preprophase ring, the cage-like structure around the metaphase spindle, and short filaments in the phragmoplast. One potential target of SEO action may be the plant actin-binding protein AtFormin14 (AtFH14), which in A. thaliana 105 85 A. thaliana Agastache rugosa Mentha longifolia 20 A. rugosa However, disruptions in microtubule organization involving tubulin aggregation were also observed by Hermes et al. [ 106 101 99 Since the mitotic spindle still formed, it is unlikely that SEO interfered with proteins responsible for microtubule nucleation, such as the γ-tubulin ring complex (γ-TuRC), kinesin-14 motor proteins transporting γ-TuRC to the spindle poles, or α-Aurora kinase, which phosphorylates γ-TuRC in a complex with TPXL3 to promote its spindle association [ 107 108 A likely target of SEO is the MAP65 family of microtubule-associated proteins, which mediate lateral bundling of microtubules into parallel arrays and stabilize the mitotic spindle ( Figure 20 109 A. thaliana 83 109 109 Figure 20 86 110 Improperly formed, laterally bundled microtubule arrays may have hindered correct kinetochore attachment, potentially activating the spindle assembly checkpoint (SAC) at the metaphase/anaphase transition and sustaining activity of the mitotic checkpoint complex (MCC), which binds and inhibits CDC20, thereby preventing the activation of the anaphase-promoting complex/cyclosome (APC/C) [ 83 99 Figure 20 88 3.4. Disruption of Mitotic Progression via Epigenetic Modifications Induced by SEO In a subpopulation of mitotic cells, the elevated metaphase index was accompanied by characteristic chromosomal aberrations. Highly condensed prophase foci localized to telomeric regions of sister chromatids persisted into metaphase and acted as ‘sticky ends’ in anaphase, preventing full separation during telophase. This resulted in chromatin bridges that subsequently formed micronuclei. Such stickiness may arise from volatile compounds denaturing nuclear proteins and impairing segregation, or from disrupted chromatin folding and organization [ 28 Alternatively, the SEO-induced increase in the metaphase index, and associated mitotic abnormalities may stem from impaired activity of PP1 and PP2A phosphatases ( Figure 20 111 112 V. faba 112 Phosphorylation of H3T3 by Haspin kinase is essential for proper chromosome condensation and spindle assembly checkpoint function, as it recruits the chromosomal passenger complex (CPC) containing Aurora B. The CPC corrects kinetochore–microtubule attachment errors, ensures accurate chromosome segregation, and later contributes to spindle disassembly [ 83 84 88 113 114 115 116 117 Figure 20 118 In this study, SEO markedly altered the phosphorylation patterns of H3T3 and H3S10, indicating disruption of epigenetic regulation of mitosis. H3T3Ph showed stronger and more widely distributed signals, persisting abnormally into anaphase and telophase. This likely reflects impaired PP1/PP2A activity, leading to sustained Haspin activation and insufficient H3T3 dephosphorylation [ 116 Figure 20 3.5. Toxicological Risks Associated with β-Asarone Essential oils are inherently prone to degradation through oxidation, iso- or polymerization, and dehydrogenation. Due to these properties, they are not considered highly toxic, with acute effects observed only at doses above 2 g/kg (oral or dermal), and their residues on plants remain minimal [ 15 50 35 119 50 4. Materials and Methods 4.1. Plant Material Seeds of faba bean ( Vicia faba minor Lupinus luteus Brassica napus Arabidopsis thaliana A. thaliana V. faba L. luteus B. napus A. thaliana 4.2. Essential Oil Treatment Sweet flag ( A. calamus 97 v v B. napus 50 50 V. faba L. luteus B. napus A. thaliana 4.3. DNA Staining for Mitotic and Mitotic Phase Indices 1 cm long apical root fragments were fixed in Carnoy’s solution (99.8% ethanol: glacial acetic acid, 3:1 v v V. faba L. luteus B. napus A. thaliana 120 4.4. Western Blot Proteins were extracted from the root meristematic parts using Pierce Plant Total Protein Extraction Kit (Thermo Fisher Scientific, Waltham, MA, USA) supplemented with Protease Inhibitor Cocktail (Sigma-Aldrich). Their concentration was spectrophotometrically measured using Pierce BCA Protein Assay Kit (Thermo Fisher Scientific). 45 µg of proteins from each extract were separated on NuPAGE Novex 4–12% Bis–Tris gel (Thermo Fisher Scientific) and immediately transferred onto polyvinylidene fluoride (PVDF) membrane, 0.2 µm pore size (Thermo Fisher Scientific). Membrane blocking, antibody incubation, and chromogenic detection were performed using WesternBreeze Chromogenic Kit, anti-rabbit (Thermo Fisher Scientific) according to the manufacturer’s protocol. Cdc2 proteins were detected using polyclonal Anti-CDC2 antibodies (Agrisera, Vännäs, Sweden) diluted 1:3000, which cross-react with the conserved plant homolog CDKA; therefore, the term ‘Cdc2’ is used throughout this study. Actin was detected using monoclonal actin antibodies (Sigma-Aldrich) diluted 1:4000. The chromogenic reaction was run for 60 and 30 min, respectively. PVDF membranes were visualized using ProXima 2750 imaging platform (Isogen Life Sciences, De Meern, The Netherlands). Microdensitometric analysis of the PVDF membrane was performed using GelAnalyzer 23.1.1 (available at www.gelanalyzer.com 4.5. Immunocytochemical Staining of β-Tubulin and Actin Excised, apical parts of roots were fixed in 4% (m/V) paraformaldehyde dissolved in MTSB buffer (50 mM PIPES, 5 mM EGTA, 5 mM MgSO4, pH 7.0) for 45 min (4 °C) and washed three times with PBS (Sigma-Aldrich). Then root tips were macerated with a citrate-buffered mixture of 2.5% pectinase, 2.5% pectolyase, and 2.5% cellulase (Sigma-Aldrich), at pH 5.0 and 37 °C for 30 min ( V. faba L. luteus B. napus A. thaliana v v 4.6. Immunocytochemical Detection of Phosphorylated H3S10 and H3T3 Histones Apical fragments of V. faba B. napus To detect H3T3Ph, slides were incubated in permeabilizing solution (0.5% Triton X-100 in PBS) for 15 min at 23 °C, then briefly rinsed and incubated in blocking buffer containing 5% BSA and 0.3% Triton X-100 dissolved in PBS for 50 min at 23 °C. Slides were briefly rinsed and incubated overnight with anti-H3T3Ph antibodies (Cell Signaling Technology, Danvers, MA, USA) dissolved at 1:400 in PBS containing 1% BSA and 0.3% Triton-X100 at 4 °C in darkness in a humidified atmosphere. After the incubation with primary antibodies stopped, rinsing, incubation in secondary antibodies solution, DAPI staining, and slide mounting procedures were described above. 4.7. Microscopic Observations, Measurements, and Analyses Mitotic indexes and mitotic phase indexes were calculated with the use of Nikon Eclipse E100 microscope (Nikon, Tokyo, Japan) by analyzing 5000 cells from 5 preparations stained with Schiff’s reagent. Calculations were made according to the formula: Mitotic index, MI = (number of dividing cells total number of cells −1 −1 Observations of fluorescence preparations were made using Nikon Eclipse E600W fluorescence microscope (Nikon, Tokyo, Japan) equipped with U2 filter (UVB light; λ = 340–380 nm) for DAPI, B2 filter (blue light; λ = 465–496 nm) for Alexa Fluor ® 121 4.8. Statistical Analyses Statistical analyses and outcomes visualization were performed in GraphPad Prism 10 software. Differences between groups were evaluated using Student’s t p 5. Conclusions The results indicate that SEO reduces the proportion of mitotically active cells and disrupts mitotic progression in representatives of both Fabaceae ( V. faba L. luteus B. napus A. thaliana 50 The action of SEO proved to be multifaceted, encompassing molecular mechanisms of cell cycle regulation, dynamic remodeling of cytoskeletal elements (microtubules and actin filaments), and mitosis-specific histone modifications such as H3T3 and H3S10 phosphorylation. These epigenetic alterations exhibited interspecific differences in both intensity and spatial distribution. The reduction in the number of mitotic cells results from both replication stress and S-phase prolongation, caused by oxidative DNA damage, as confirmed in earlier studies, and from a decrease in the level of the key cell cycle regulatory kinase Cdc2 (a protein that normally remains relatively stable throughout the cell cycle), as demonstrated in V. faba B. napus Mitotic disturbances were also associated with excessive stabilization of microtubules and actin filaments, and with restricted dynamic reorganization of the spindle and phragmoplast, observed in all studied species by immunofluorescence as stronger lateral interactions and persistent stabilization at each mitotic stage. It is likely that microtubule-associated proteins (MAPs) mediate these lateral interactions; under reduced Cdc2 levels, they may fail to undergo phosphorylation required for weakening their microtubule binding and enabling proper separation. Mitotic defects were further linked to altered timing and intensity of H3T3 phosphorylation, which is essential for correcting erroneous kinetochore–microtubule attachments and for proper spindle organization, as shown in V. faba B. napus Disturbances in H3T3 phosphorylation timing may also have hindered CPC/Aurora B recruitment to chromatin, thereby weakening H3S10 phosphorylation, as demonstrated in V. faba B. napus From the perspective of the potential use of SEO as a bioherbicide, it is particularly important to emphasize its capacity to target multiple components of the cell cycle. This multi-targeted mode of action may reduce the risk of plants rapidly developing resistance mechanisms, which is a key advantage of such compounds in agricultural practice. Acknowledgments We thank the Laboratory of Microscopic Imaging and Specialized Biological Techniques of the Faculty of Biology and Environmental Protection of the University of Lodz for providing access to the research facilities. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.W. and J.T.P.; methodology, M.W., A.Ż. and J.T.P.; validation, M.W. and J.T.P.; formal analysis, M.W.; investigation, M.W.; resources, M.W. and A.Ż.; data curation, M.W.; writing—original draft preparation, M.W.; writing—review and editing, J.T.P.; visualization, M.W. and N.G.; supervision, J.T.P.; project administration, M.W.; funding acquisition, M.W. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data will be made available upon request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: APC/C Anaphase-promoting complex/cyclosome ATM Ataxia-telangiectasia mutated kinase ATR Ataxia-telangiectasia and Rad3-related protein BMF3 BUB1/MAD3 family protein 3 CAK Cdk-activating kinase Cdc2 Cell division control 2 CDC20 Cell division cycle 20 protein CDC25 Cell division cycle 25 phosphatase CDKs Cyclin-dependent kinases CKIs Cyclin-dependent kinase inhibitors CPC Chromosomal passenger complex Cyc Cyclin DP Dimerization partner MAD2 Mitotic arrest deficient 2 MAPs Microtubule-associated proteins MAPK Mitogen-activated protein kinase MCC Mitotic checkpoint complex MPF Mitosis-promoting factor NACK1 NPK1-activating kinesin-like protein 1 PP1-2A, B, C Protein Phosphatase 1-2A, B, C PPB Preprophase band Rb Retinoblastoma protein RBR Retinoblastoma-related proteins ROS Reactive oxygen species SAC Spindle assembly checkpoint SMC Structural maintenance of chromosome protein TPX2 Targeting Protein of XKLP2 γ-TuRC γ-tubulin ring complex References 1. Dehnert G.K. Karasov W.H. Wolman M.A. 2,4-Dichlorophenoxyacetic Acid Containing Herbicide Impairs Essential Visually Guided Behaviors of Larval Fish Aquat. Toxicol. 2019 209 1 12 10.1016/j.aquatox.2019.01.015 30684730 2. Nakka S. Jugulam M. Peterson D. Asif M. Herbicide Resistance: Development of Wheat Production Systems and Current Status of Resistant Weeds in Wheat Cropping Systems Crop J. 2019 7 750 760 10.1016/j.cj.2019.09.004 3. Perrin L. Spinosi J. Chaperon L. Kab S. Moisan F. Ebaz A. Pesticides Expenditures by Farming Type and Incidence of Parkinson Disease in Farmers: A French Nationwide Study Environ. Res. 2021 197 111161 10.1016/j.envres.2021.111161 33887276 4. Schebesta H. Candel J.J.L. Game-Changing Potential of the EU’s Farm to Fork Strategy Nat. Food 2020 1 586 588 10.1038/s43016-020-00166-9 37128112 5. Kocira A. Staniak M. Tomaszewska M. Kornas R. Cymerman J. Panasiewicz K. Lipińska H. Legume Cover Crops as One of the Elements of Strategic Weed Management and Soil Quality Improvement. A Review Agriculture 2020 10 394 10.3390/agriculture10090394 6. Sosnoskie L.M. Duke S.O. Implications of Weakening of the United States Geological Survey Pesticide National Synthesis Project for Weed Scientists Weed Sci. 2023 71 517 519 10.1017/wsc.2023.59 7. Miller Z.J. Hubbel K. Integrating Mechanical and Cultural Methods for Weed Control in Organic Chickpea Weed Sci. 2024 72 774 781 10.1017/wsc.2024.23 8. Abd-ElGawad A.M. Elshamy A.I. Al-Rowaily S.L. El-Amier Y.A. Habitat Affects the Chemical Profile, Allelopathy, and Antioxidant Properties of Essential Oils and Phenolic Enriched Extracts of the Invasive Plant Heliotropium Curassavicum Plants 2019 8 482 10.3390/plants8110482 31703432 PMC6918439 9. Araniti F. Lupini A. Sorgonà A. Conforti F. Marrelli M. Statti G.A. Menichini F. Abenavoli M.R. Allelopathic Potential of Artemisia arborescens Nat. Prod. Res. 2013 27 880 887 10.1080/14786419.2012.691491 22687059 10. Han C. Shao H. Zhou S. Mei Y. Cheng Z. Huang L. Lv G. Chemical Composition and Phytotoxicity of Essential Oil from Invasive Plant, Ambrosia artemisiifolia Ecotoxicol. Environ. Saf. 2021 211 111879 10.1016/j.ecoenv.2020.111879 33465625 11. Li J. Chen H. Guo C. Chen Q. Zhao T. Chen X. Du Y. Du H. Miao Y. Liu D. Artemisia argyi Ind. Crops Prod. 2023 194 116258 10.1016/j.indcrop.2023.116258 12. Satyal P. Paudel P. Poudel A. Dosoky N.S. Moriarity D.M. Vogler B. Setzer W.N. Chemical Compositions, Phytotoxicity, and Biological Activities of Acorus calamus Nat. Prod. Commun. 2013 8 1179 1181 10.1177/1934578x1300800839 24079199 13. Zhou S. Han C. Zhang C. Kuchkarova N. Wei C. Zhang C. Shao H. Allelopathic, Phytotoxic, and Insecticidal Effects of Thymus proximus Front. Plant Sci. 2021 12 689875 10.3389/fpls.2021.689875 34211492 PMC8239391 14. Schandry N. Becker C. Allelopathic Plants: Models for Studying Plant–Interkingdom Interactions Trends Plant Sci. 2020 25 176 185 10.1016/j.tplants.2019.11.004 31837955 15. Raveau R. Fontaine J. Lounès-Hadj Sahraoui A. Essential Oils as Potential Alternative Biocontrol Products against Plant Pathogens and Weeds: A Review Foods 2020 9 365 10.3390/foods9030365 32245234 PMC7143296 16. Verdeguer M. Sánchez-Moreiras A.M. Araniti F. Phytotoxic Effects and Mechanism of Action of Essential Oils and Terpenoids Plants 2020 9 1571 10.3390/plants9111571 33202993 PMC7697004 17. Pouresmaeil M. Movafeghi A. Sabzi-Nojadeh M. Kosari-Nasab M. Maggi F. Exposure of Avena fatua Artemisia austriaca Ind. Crops Prod. 2024 222 119636 10.1016/j.indcrop.2024.119636 18. Rienth M. Crovadore J. Ghaffari S. Lefort F. Oregano Essential Oil Vapour Prevents Plasmopara viticola Vitis vinifera PLoS ONE 2019 14 e0222854 10.1371/journal.pone.0222854 31560730 PMC6764689 19. Rys M. Miastkowska M. Łętocha A. Wajs-Bonikowska A. Lorenzo P. Synowiec A. The Effect of Caraway Oil-Loaded Bio-Nanoemulsions on the Growth and Performance of Barnyard Grass and Maize Sci. Rep. 2024 14 4313 10.1038/s41598-024-54721-6 38383733 PMC10881981 20. Sarheed M.M. Rajabi F. Kunert M. Boland W. Wetters S. Miadowitz K. Kaźmierczak A. Sahi V.P. Nick P. Cellular Base of Mint Allelopathy: Menthone Affects Plant Microtubules Front. Plant Sci. 2020 11 546345 10.3389/fpls.2020.546345 33042176 PMC7524878 21. Synowiec A. Możdżeń K. Krajewska A. Landi M. Araniti F. Carum carvi Echinochloa crus-galli Ind. Crops Prod. 2019 140 111652 10.1016/j.indcrop.2019.111652 22. Wróblewski M. Piotrowska-Niczyporuk A. Ciereszko I. Gocek N. Żabka A. Szczeblewski P. Sobiech Ł. Saja-Garbarz D. Polit J.T. Phytotoxicity and Bioherbicidal Potential of Sweet Flag ( Acorus calamus Sci. Hortic. 2025 347 114180 10.1016/j.scienta.2025.114180 23. Araniti F. Landi M. Lupini A. Sunseri F. Guidi L. Abenavoli M.R. Origanum Vulgare Essential Oils Inhibit Glutamate and Aspartate Metabolism Altering the Photorespiratory Pathway in Arabidopsis thaliana J. Plant Physiol. 2018 231 297 309 10.1016/j.jplph.2018.10.006 30343221 24. Ben Kaab S. Fernández Pierna J.A. Foncoux B. Compère P. Baeten V. Jijakli M.H. Biochemical and Physiological Responses of Weeds to the Application of a Botanical Herbicide Based on Cinnamon Essential Oil Plants 2024 13 3432 10.3390/plants13233432 39683225 PMC11644082 25. De Andrade Santiago J. Das Graças Cardoso M. Aparecida Da Cruz F. Palmieri M.J. Vieira De Souza R. Soares L.I. De Campos J.M.S. Andrade-Vieira L.F. Cytogenotoxic Effect of Essential Oil from Backhousia citriodora Myrtaceae Lactuca sativa S. Afr. J. Bot. 2017 112 515 520 10.1016/j.sajb.2017.05.011 26. Ghimire B.K. Hwang M.H. Sacks E.J. Yu C.Y. Kim S.H. Chung I.M. Screening of Allelochemicals in Miscanthus Sacchariflorus Extracts and Assessment of Their Effects on Germination and Seedling Growth of Common Weeds Plants 2020 9 1313 10.3390/plants9101313 33028036 PMC7600465 27. López-González D. Graña E. Teijeira M. Verdeguer M. Reigosa M.J. Sánchez-Moreiras A.M. Araniti F. Similarities on the Mode of Action of the Terpenoids Citral and Farnesene in Arabidopsis Plant Physiol. Biochem. 2023 196 507 519 10.1016/j.plaphy.2023.02.004 36764266 28. Fagodia S.K. Singh H.P. Batish D.R. Kohli R.K. Phytotoxicity and Cytotoxicity of Citrus aurantiifolia Ind. Crops Prod. 2017 108 708 715 10.1016/j.indcrop.2017.07.005 29. Singh N. Singh H.P. Batish D.R. Kohli R.K. Yadav S.S. Chemical Characterization, Phytotoxic, and Cytotoxic Activities of Essential Oil of Mentha longifolia Environ. Sci. Pollut. Res. 2020 27 13512 13523 10.1007/s11356-020-07823-3 32303127 30. Li J. Zhao T. Chen L. Chen H. Luo D. Chen C. Miao Y. Liu D. Artemisia Argyi BMC Plant Biol. 2022 22 368 10.1186/s12870-022-03757-9 35879664 PMC9317128 31. Araniti F. Graña E. Krasuska U. Bogatek R. Reigosa M.J. Abenavoli M.R. Sánchez-Moreiras A.M. Loss of Gravitropism in Farnesene-Treated Arabidopsis PLoS ONE 2016 11 e0160202 10.1371/journal.pone.0160202 27490179 PMC4974009 32. Chaimovitsh D. Rogovoy (Stelmakh) O. Altshuler O. Belausov E. Abu-Abied M. Rubin B. Sadot E. Dudai N. The Relative Effect of Citral on Mitotic Microtubules in Wheat Roots and BY2 Cells Plant Biol. 2012 14 354 364 10.1111/j.1438-8677.2011.00511.x 22039835 33. Pawlowski Â. Kaltchuk-Santos E. Zini C.A. Caramão E.B. Soares G.L.G. Essential Oils of Schinus Terebinthifolius and S. Molle ( Anacardiaceae S. Afr. J. Bot. 2012 80 96 103 10.1016/j.sajb.2012.03.003 34. Bai D. Li X. Wang S. Zhang T. Wei Y. Wang Q. Dong W. Song J. Gao P. Li Y. Advances in Extraction Methods, Chemical Constituents, Pharmacological Activities, Molecular Targets and Toxicology of Volatile Oil from Acorus calamus angustatus Front. Pharmacol. 2022 13 1004529 10.3389/fphar.2022.1004529 36545308 PMC9761896 35. Das B.K. Swamy A.V. Koti B.C. Gadad P.C. Experimental Evidence for Use of Acorus calamus Heliyon 2019 5 e01585 10.1016/j.heliyon.2019.e01585 31193009 PMC6513775 36. Rajput S.B. Tonge M.B. Karuppayil S.M. An Overview on Traditional Uses and Pharmacological Profile of Acorus calamus Acorus Phytomedicine 2014 21 268 276 10.1016/j.phymed.2013.09.020 24200497 37. Mukherjee P.K. Rai S. Kumar V. Mukherjee K. Hylands P. Hider R. Plants of Indian Origin in Drug Discovery Expert Opin. Drug Discov. 2007 2 633 657 10.1517/17460441.2.5.633 23488955 38. O’Neill A.R. Badola H.K. Dhyani P.P. Rana S.K. Integrating Ethnobiological Knowledge into Biodiversity Conservation in the Eastern Himalayas J. Ethnobiol. Ethnomedicine 2017 13 21 10.1186/s13002-017-0148-9 PMC5372287 28356115 39. Lam K.Y.C. Yao P. Wang H. Duan R. Dong T.T.X. Tsim K.W.K. Asarone from Acori tatarinowii PLoS ONE 2017 12 e0179077 10.1371/journal.pone.0179077 28598994 PMC5466315 40. Uebel T. Hermes L. Haupenthal S. Müller L. Esselen M. α-Asarone, Β-asarone, and Γ-asarone: Current Status of Toxicological Evaluation J. Appl. Toxicol. 2021 41 1166 1179 10.1002/jat.4112 33236787 41. Wróblewski M. Krajewski K. Gocek N. Żabka A. Polit J.T. Acorus Calamus Int. J. Mol. Sci. 2025 26 4715 10.3390/ijms26104715 40429859 PMC12111713 42. Rajamanikkam K. Elaiya Raja S. Balaji S.K. Nadana Rajavadivu G. Sivasubramaniam S. Palanichelvam K. Earthworm, a Novel In Vivo System to Validate Antimitotic Compounds Turk. J. Zool. 2019 43 153 163 10.3906/zoo-1806-36 43. Rajesh C. Palanimuthu V.R. Palanichelvam K. Fatty Acids and Its Derivatives of Acorus calamus Biocatal. Agric. Biotechnol. 2021 36 102153 10.1016/j.bcab.2021.102153 44. Polit J.T. Protein Phosphorylation in Vicia faba Plant Cell Rep. 2009 28 165 173 10.1007/s00299-008-0642-6 19023574 45. Polit J.T. Ciereszko I. Sucrose Synthase Activity and Carbohydrates Content in Relation to Phosphorylation Status of Vicia faba J. Plant Physiol. 2012 169 1597 1606 10.1016/j.jplph.2012.04.017 22770419 46. Polit J.T. Ciereszko I. In Situ Activities of Hexokinase and Fructokinase in Relation to Phosphorylation Status of Root Meristem Cells of Vicia faba Physiol. Plant. 2009 135 342 350 10.1111/j.1399-3054.2008.01201.x 19335447 47. Polit J. Maszewski J. Protein Phosphorylation during the Transitions from G1 Arrest Point to S and G2 Arrest Point to M in Vicia faba Biol. Plant. 2004 48 351 359 10.1023/b:biop.0000041086.68286.b1 48. Shimotohno A. Aki S.S. Takahashi N. Umeda M. Regulation of the Plant Cell Cycle in Response to Hormones and the Environment Annu. Rev. Plant Biol. 2021 72 273 296 10.1146/annurev-arplant-080720-103739 33689401 49. Carneiro A.K. Montessoro P.D.F. Fusaro A.F. Araújo B.G. Hemerly A.S. Plant CDKs—Driving the Cell Cycle Through Climate Change Plants 2021 10 1804 10.3390/plants10091804 34579337 PMC8468384 50. Joubès J. Chevalier C. Endoreduplication in Higher Plants Plant Mol. Biol. 2000 43 735 745 10.1023/a:1006446417196 11089873 51. Mironov V. De Veylder L. Van Montagu M. Inzé D. Cyclin-Dependent Kinases and Cell Division in Plants—The Nexus Plant Cell 1999 11 509 521 10.1105/tpc.11.4.509 10213774 PMC144199 52. Vandepoele K. Raes J. De Veylder L. Rouzé P. Rombauts S. Inzé D. Genome-Wide Analysis of Core Cell Cycle Genes in Arabidopsis Plant Cell 2002 14 903 916 10.1105/tpc.010445 11971144 PMC150691 53. Gutierrez C. The Arabidopsis Arab. Book 2009 7 e0120 10.1199/tab.0120 PMC3243301 22303246 54. Pereira C. Lemischka I.R. Moore K. Reprogramming Cell Fates: Insights from Combinatorial Approaches Ann. N. Y. Acad. Sci. 2012 1266 7 17 10.1111/j.1749-6632.2012.06508.x 22901251 55. Sablowski R. Carnier Dornelas M. Interplay Between Cell Growth and Cell Cycle in Plants J. Exp. Bot. 2014 65 2703 2714 10.1093/jxb/ert354 24218325 56. Boruc J. Van Den Daele H. Hollunder J. Rombauts S. Mylle E. Hilson P. Inzé D. De Veylder L. Russinova E. Functional Modules in the Arabidopsis Plant Cell 2010 22 1264 1280 10.1105/tpc.109.073635 20407024 PMC2879739 57. Churchman M.L. Brown M.L. Kato N. Kirik V. Hülskamp M. Inzé D. De Veylder L. Walker J.D. Zheng Z. Oppenheimer D.G. SIAMESE, a Plant-Specific Cell Cycle Regulator, Controls Endoreplication Onset in Arabidopsis thaliana Plant Cell 2006 18 3145 3157 10.1105/tpc.106.044834 17098811 PMC1693949 58. Lipavská H. Mašková P. Vojvodová P. Regulatory Dephosphorylation of CDK at G2/M in Plants: Yeast Mitotic Phosphatase Cdc25 Induces Cytokinin-like Effects in Transgenic Tobacco Morphogenesis Ann. Bot. 2011 107 1071 1086 10.1093/aob/mcr016 21339187 PMC3091802 59. Nakai T. Kato K. Shinmyo A. Sekine M. Arabidopsis FEBS Lett. 2006 580 336 340 10.1016/j.febslet.2005.12.018 16376885 60. Peres A. Churchman M.L. Hariharan S. Himanen K. Verkest A. Vandepoele K. Magyar Z. Hatzfeld Y. Van Der Schueren E. Beemster G.T.S. Novel Plant-Specific Cyclin-Dependent Kinase Inhibitors Induced by Biotic and Abiotic Stresses J. Biol. Chem. 2007 282 25588 25596 10.1074/jbc.M703326200 17599908 61. Verkest A. Weinl C. Inzé D. De Veylder L. Schnittger A. Switching the Cell Cycle. Kip-Related Proteins in Plant Cell Cycle Control Plant Physiol. 2005 139 1099 1106 10.1104/pp.105.069906 16286449 PMC1283750 62. Wang L. Ruan Y.-L. Regulation of Cell Division and Expansion by Sugar and Auxin Signaling Front. Plant Sci. 2013 4 163 10.3389/fpls.2013.00163 23755057 PMC3667240 63. Yi D. Alvim Kamei C.L. Cools T. Vanderauwera S. Takahashi N. Okushima Y. Eekhout T. Yoshiyama K.O. Larkin J. Van Den Daele H. The Arabidopsis Plant Cell 2014 26 296 309 10.1105/tpc.113.118943 24399300 PMC3963576 64. Cook G.S. Grønlund A.L. Siciliano I. Spadafora N. Amini M. Herbert R.J. Bitonti M.B. Graumann K. Francis D. Rogers H.J. Plant WEE1 Kinase Is Cell Cycle Regulated and Removed at Mitosis via the 26S Proteasome Machinery J. Exp. Bot. 2013 64 2093 2106 10.1093/jxb/ert066 23536609 PMC3638832 65. Cools T. De Veylder L. DNA Stress Checkpoint Control and Plant Development Curr. Opin. Plant Biol. 2009 12 23 28 10.1016/j.pbi.2008.09.012 19010080 66. Perry J.A. Kornbluth S. Cdc25 and Wee1: Analogous Opposites? Cell Div. 2007 2 12 10.1186/1747-1028-2-12 17480229 PMC1868713 67. Abraham E. Miskolczi P. Ayaydin F. Yu P. Kotogany E. Bako L. Otvos K. Horvath G.V. Dudits D. Immunodetection of Retinoblastoma-Related Protein and Its Phosphorylated Form in Interphase and Mitotic Alfalfa Cells J. Exp. Bot. 2011 62 2155 2168 10.1093/jxb/erq413 21196474 PMC3060694 68. Ramirez-Parra E. Gutierrez C. The Many Faces of Chromatin Assembly Factor 1 Trends Plant Sci. 2007 12 570 576 10.1016/j.tplants.2007.10.002 17997123 69. Spadafora N.D. Doonan J.H. Herbert R.J. Bitonti M.B. Wallace E. Rogers H.J. Francis D. Arabidopsis Ann. Bot. 2011 107 1183 1192 10.1093/aob/mcq142 20647223 PMC3091795 70. Naouar N. Vandepoele K. Lammens T. Casneuf T. Zeller G. Van Hummelen P. Weigel D. Rätsch G. Inzé D. Kuiper M. Quantitative RNA Expression Analysis with Affymetrix Tiling 1.0R Arrays Identifies New E2F Target Genes Plant J. 2009 57 184 194 Erratum in Plant J. 2017 91 10.1111/j.1365-313X.2008.03662.x 18764924 71. Rybaczek D. Maszewski J. Induction of Foci of Phosphorylated H2AX Histones and Premature Chromosome Condensation after DNA Damage in Vicia faba Biol. Plant. 2007 51 443 450 10.1007/s10535-007-0094-9 72. Rybaczek D. Maszewski J. Phosphorylation of H2AX Histones in Response to Double-Strand Breaks and Induction of Premature Chromatin Condensation in Hydroxyurea-Treated Root Meristem Cells of Raphanus sativus Vicia faba Allium porrum Protoplasma 2007 230 31 39 10.1007/s00709-006-0192-0 17111099 73. Żabka A. Polit J.T. Maszewski J. DNA Replication Stress Induces Deregulation of the Cell Cycle Events in Root Meristems of Allium cepa Ann. Bot. 2012 110 1581 1591 10.1093/aob/mcs215 23087128 PMC3503497 74. Dahan J. Wendehenne D. Ranjeva R. Pugin A. Bourque S. Nuclear Protein Kinases: Still Enigmatic Components in Plant Cell Signalling New Phytol. 2010 185 355 368 10.1111/j.1469-8137.2009.03085.x 19925553 75. Francis D. A Commentary on the G2/M Transition of the Plant Cell Cycle Ann. Bot. 2011 107 1065 1070 10.1093/aob/mcr055 21558458 PMC3091806 76. Shimotohno A. Umeda-Hara C. Bisova K. Uchimiya H. Umeda M. The Plant-Specific Kinase CDKF;1 Is Involved in Activating Phosphorylation of Cyclin-Dependent Kinase-Activating Kinases in Arabidopsis Plant Cell 2004 16 2954 2966 10.1105/tpc.104.025601 15486101 PMC527191 77. Dissmeyer N. Weimer A.K. De Veylder L. Novak B. Schnittger A. The Regulatory Network of Cell-Cycle Progression Is Fundamentally Different in Plants versus Yeast or Metazoans Plant Signal. Behav. 2010 5 1613 1618 10.4161/psb.5.12.13969 21139435 PMC3115114 78. Berckmans B. De Veylder L. Transcriptional Control of the Cell Cycle Curr. Opin. Plant Biol. 2009 12 599 605 10.1016/j.pbi.2009.07.005 19700366 79. Kiyokawa H. Ray D. In Vivo Roles of CDC25 Phosphatases: Biological Insight into the Anti-Cancer Therapeutic Targets Anti-Cancer Agents Med. Chem. 2008 8 832 836 10.2174/187152008786847693 PMC2753225 19075565 80. Nurse P. Cyclin Dependent Kinases and Cell Cycle Control (Nobel Lecture) Copyright © the Nobel Foundation, 2002. We Thank the Nobel Foundation, Stockholm, for Permission to Print This Lecture ChemBioChem 2002 3 596 10.1002/1439-7633(20020703)3:7&#x0003c;596::aid-cbic596&#x0003e;3.0.co;2-u 12324993 81. Tyson J.J. Novak B. Temporal Organization of the Cell Cycle Curr. Biol. 2008 18 R759 R768 10.1016/j.cub.2008.07.001 18786381 PMC2856080 82. Gutierrez C. Sequeira-Mendes J. Aragüez I. Replication of the Plant Genome Molecular Biology Howell S.H. Springer New York, NY, USA 2014 1 23 978-1-4614-7569-9 83. Liu B. Lee Y.-R.J. Spindle Assembly and Mitosis in Plants Annu. Rev. Plant Biol. 2022 73 227 254 10.1146/annurev-arplant-070721-084258 35595291 84. Kozgunova E. Suzuki T. Ito M. Higashiyama T. Kurihara D. Haspin Has Multiple Functions in the Plant Cell Division Regulatory Network Plant Cell Physiol. 2016 57 848 861 10.1093/pcp/pcw030 26872832 85. Sarheed M. Schärer H.-J. Wang-Müller Q. Flury P. Maes C. Genva M. Fauconnier M.-L. Nick P. Signal, Not Poison—Screening Mint Essential Oils for Weed Control Leads to Horsemint Agriculture 2023 13 712 10.3390/agriculture13030712 86. Li S. Sun T. Ren H. The Functions of the Cytoskeleton and Associated Proteins During Mitosis and Cytokinesis in Plant Cells Front. Plant Sci. 2015 6 282 10.3389/fpls.2015.00282 25964792 PMC4410512 87. Kaduchová K. Marchetti C. Ovečka M. Galuszka P. Bergougnoux V. Šamaj J. Pecinka A. Spatial Organization and Dynamics of Chromosomes and Microtubules During Barley Mitosis Plant J. 2023 115 602 613 10.1111/tpj.16355 37326283 88. Komaki S. Takeuchi H. Hamamura Y. Heese M. Hashimoto T. Schnittger A. Functional Analysis of the Plant Chromosomal Passenger Complex Plant Physiol. 2020 183 1586 1599 10.1104/pp.20.00344 32461300 PMC7401102 89. Weimer A.K. Demidov D. Lermontova I. Beeckman T. Van Damme D. Aurora Kinases Throughout Plant Development Trends Plant Sci. 2016 21 69 79 10.1016/j.tplants.2015.10.001 26616196 90. Houben A. Demidov D. Caperta A.D. Karimi R. Agueci F. Vlasenko L. Phosphorylation of Histone H3 in Plants—A Dynamic Affair Biochim. Et Biophys. Acta (BBA) Gene Struct. Expr. 2007 1769 308 315 10.1016/j.bbaexp.2007.01.002 17320987 91. Saki G. Eidi A. Mortazavi P. Panahi N. Vahdati A. Effect of β-Asarone in Normal and β-Amyloid-Induced Alzheimeric Rats Arch. Med. Sci. 2020 16 699 706 10.5114/aoms.2020.94659 32399120 PMC7212238 92. Pawłowski K.P. Regulation of Weeds as a Factor Affecting the Profitability of Narrow-Leafed Lupine Production Ann. PAAAE 2018 20 205 211 10.5604/01.3001.0012.7762 93. Report from the Commission to the Council and the European Parliament on the Development of Plant Proteins in the European Union European Commision Brussels, Belgium 2018 1 15 94. Weber E.A. Gruber S. Claupein W. Emergence and Performance of Volunteer Oilseed Rape ( Brassica napus Eur. J. Agron. 2014 60 33 40 10.1016/j.eja.2014.07.004 95. Aragão F. Palmieri M. Ferreira A. Costa A. Queiroz V. Pinheiro P. Andrade-Vieira L. Phytotoxic and Cytotoxic Effects of Eucalyptus Essential Oil on Lettuce ( Lactuca sativa Allelopath. J. 2015 35 259 272 96. Sunohara Y. Nakano K. Matsuyama S. Oka T. Matsumoto H. Cuminaldehyde, a Cumin Seed Volatile Component, Induces Growth Inhibition, Overproduction of Reactive Oxygen Species and Cell Cycle Arrest in Onion Roots Sci. Hortic. 2021 289 110493 10.1016/j.scienta.2021.110493 97. Szczeblewski P. Wróblewski M. Borzyszkowska-Bukowska J. Bairamova T. Górska J. Laskowski T. Samulewicz A. Kosno M. Sobiech Ł. Polit J.T. The Role of Centrifugal Partition Chromatography in the Removal of β-Asarone from Acorus Calamus Sci. Rep. 2022 12 22217 10.1038/s41598-022-26726-6 36564541 PMC9789137 98. Dvořák Tomaštíková E. Rutten T. Dvořák P. Tugai A. Ptošková K. Petrovská B. Van Damme D. Houben A. Doležel J. Demidov D. Functional Divergence of Microtubule-Associated TPX2 Family Members in Arabidopsis thaliana Int. J. Mol. Sci. 2020 21 2183 10.3390/ijms21062183 32235723 PMC7139753 99. Guo Y. Liu C. Zhang Y. Zheng S. Cao P. Wang X. Tian Z. Characterization Key Genes of Arabidopsis Front. Plant Sci. 2024 14 1295779 10.3389/fpls.2023.1295779 38239209 PMC10794411 100. Zhang Y. Gu M. Xia X. Shi K. Zhou Y. Yu J. Effects of Phenylcarboxylic Acids on Mitosis, Endoreduplication and Expression of Cell Cycle-Related Genes in Roots of Cucumber ( Cucumis sativus J. Chem. Ecol. 2009 35 679 688 10.1007/s10886-009-9642-4 19459009 101. Nagle A.A. Gan F.-F. Jones G. So C.-L. Wells G. Chew E.-H. Induction of Tumor Cell Death through Targeting Tubulin and Evoking Dysregulation of Cell Cycle Regulatory Proteins by Multifunctional Cinnamaldehydes PLoS ONE 2012 7 e50125 10.1371/journal.pone.0050125 23185555 PMC3503761 102. Li L. Wu M. Wang C. Yu Z. Wang H. Qi H. Xu X. β-Asarone Inhibits Invasion and EMT in Human Glioma U251 Cells by Suppressing Splicing Factor HnRNP A2/B1 Molecules 2018 23 671 10.3390/molecules23030671 29547514 PMC6017590 103. Polit J. Maszewski J. Effect of OA-Inhibitor of Protein Phosphatases PP1 and PP2A—on Initiation of DNA Replication and Mitosis in Vicia faba Acta Physiol. Plant. 2005 27 303 311 10.1007/s11738-005-0007-5 104. Planchais S. Glab N. Inzé D. Bergounioux C. Chemical Inhibitors: A Tool for Plant Cell Cycle Studies FEBS Lett. 2000 476 78 83 10.1016/s0014-5793(00)01675-6 10878255 105. Liu P. Qi M. Xue X. Ren H. Dynamics and Functions of the Actin Cytoskeleton during the Plant Cell Cycle Chin. Sci. Bull. 2011 56 3504 3510 10.1007/s11434-011-4801-8 106. Hermes L. Haupenthal S. Uebel T. Esselen M. DNA Double Strand Break Repair as Cellular Response to Genotoxic Asarone Isomers Considering Phase I Metabolism Food Chem. Toxicol. 2020 142 111484 10.1016/j.fct.2020.111484 32526244 107. Deng X. Higaki T. Lin H. Lee Y.-R.J. Liu B. Acentrosomal Spindle Morphogenesis Is Dependent on the Unconventional TPX2 Family Protein TPXL3 and a Aurora Kinase in Arabidopsis thaliana Res. Sq. 2021 10 10.21203/rs.3.rs-519922/v1 PMC12012799 40139933 108. Krupnova T. Sasabe M. Ghebreghiorghis L. Gruber C.W. Hamada T. Dehmel V. Strompen G. Stierhof Y.-D. Lukowitz W. Kemmerling B. Microtubule-Associated Kinase-like Protein RUNKEL Needed for Cell Plate Expansion in Arabidopsis Curr. Biol. 2009 19 518 523 10.1016/j.cub.2009.02.021 19268593 109. Smertenko A.P. Chang H.-Y. Sonobe S. Fenyk S.I. Weingartner M. Bögre L. Hussey P.J. Control of the AtMAP65-1 Interaction with Microtubules Through the Cell Cycle J. Cell Sci. 2006 119 3227 3237 10.1242/jcs.03051 16847052 110. Romeiro Motta M. Nédélec F. Saville H. Woelken E. Jacquerie C. Pastuglia M. Stolze S.C. Van De Slijke E. Böttger L. Belcram K. The Cell Cycle Controls Spindle Architecture in Arabidopsis Dev. Cell 2024 59 2947 2961.e9 10.1016/j.devcel.2024.08.001 39191252 111. Ayaydin F. Vissi E. Mészáros T. Miskolczi P. Kovács I. Fehér A. Dombrádi V. Erdödi F. Gergely P. Dudits D. Inhibition of Serine/Threonine-specific Protein Phosphatases Causes Premature Activation of cdc2MsF Kinase at G2/M Transition and Early Mitotic Microtubule Organisation in Alfalfa Plant J. 2000 23 85 96 10.1046/j.1365-313x.2000.00798.x 10929104 112. Polit J.T. Kaźmierczak A. Okadaic Acid (1 μM) Accelerates S Phase and Mitosis but Inhibits Heterochromatin Replication and Metaphase–Anaphase Transition in Vicia faba J. Exp. Bot. 2007 58 2785 2797 10.1093/jxb/erm148 17609530 113. Wang Z. Casas-Mollano J.A. Xu J. Riethoven J.-J.M. Zhang C. Cerutti H. Osmotic Stress Induces Phosphorylation of Histone H3 at Threonine 3 in Pericentromeric Regions of Arabidopsis thaliana Proc. Natl. Acad. Sci. USA 2015 112 8487 8492 10.1073/pnas.1423325112 26100864 PMC4500206 114. de Cárcer G. Manning G. Malumbres M. From Plk1 to Plk5: Functional Evolution of Polo-like Kinases Cell Cycle (Georget. Tex.) 2011 10 2255 2262 10.4161/cc.10.14.16494 PMC3230524 21654194 115. Wang F. Ulyanova N.P. van der Waal M.S. Patnaik D. Lens S.M.A. Higgins J.M.G. A Positive Feedback Loop Involving Haspin and Aurora B Promotes CPC Accumulation at Centromeres in Mitosis Curr. Biol. 2011 21 1061 1069 10.1016/j.cub.2011.05.016 21658950 PMC3118923 116. Choy M.S. Nguyen H.T. Kumar G.S. Peti W. Kettenbach A.N. Page R. A Protein Phosphatase 1 Specific Phos Ta p Proc. Natl. Acad. Sci. USA 2024 121 e2415383121 10.1073/pnas.2415383121 39446389 PMC11536154 117. Saurin A.T. Kinase and Phosphatase Cross-Talk at the Kinetochore Front. Cell Dev. Biol. 2018 6 62 10.3389/fcell.2018.00062 29971233 PMC6018199 118. Broad A.J. DeLuca J.G. The Right Place at the Right Time: Aurora B Kinase Localization to Centromeres and Kinetochores Essays Biochem. 2020 64 299 311 10.1042/ebc20190081 32406506 PMC7805488 119. Park C. Kim S.-I. Ahn Y.-J. Insecticidal Activity of Asarones Identified in Acorus gramineus J. Stored Prod. Res. 2003 39 333 342 10.1016/S0022-474X(02)00027-9 120. Maszewski J. Kaźmierczak A. Polit J. Cell Cycle Arrest in Antheridial Extract-Treated Root Meristems of Allium cepa Melandrium noctiflorum Folia Histochem. Cytobiol. 1998 36 35 43 9527023 121. Schneider C.A. Rasband W.S. Eliceiri K.W. NIH Image to ImageJ: 25 years of Image analysis Nat. Methods 2012 9 671 675 10.1038/nmeth.2089 22930834 PMC5554542 Figure 1 Mitotic indices in root meristem cells of ( A V. faba B L. luteus C B. napus D A. thaliana A′ D′ 50 t p Figure 2 Mitotic figures in root meristem cells of V. faba A B C D 50 E F G H I J K L M N O P Figure 3 Mitotic figures in root meristem cells of L. luteus A B C D 50 E F G H I J K L Figure 4 Mitotic figures in root meristem cells of B. napus A B C D 50 E F G H I J K L Figure 5 Mitotic figures in root meristem cells of A. thaliana A B C D 50 E F G H I J K L Figure 6 Western blot analysis of Cdc2 in protein extracts from the apical region of V. faba B. napus 50 A B Figure 7 Immunocytochemical detection of β-tubulin ( A G V. faba A′ G′ A″ G″ Figure 8 Immunocytochemical detection of β-tubulin ( A G L. luteus A′ G′ A″ G″ Figure 9 Immunocytochemical detection of β-tubulin ( A G B. napus A′ G′ A″ G″ Figure 10 Immunocytochemical detection of β-tubulin ( A G A. thaliana A′ G′ A″ G″ Figure 11 Immunocytochemical detection of β-tubulin ( A G V. faba 50 A′ G′ A″ G″ Figure 12 Immunocytochemical detection of β-tubulin ( A G L. luteus 50 A′ G′ A″ G″ Figure 13 Immunocytochemical detection of β-tubulin ( A G B. napus 50 A′ G′ A″ G″ Figure 14 Immunocytochemical detection of β-tubulin ( A G A. thaliana 50 A′ G′ A″ G″ Figure 15 Immunocytochemical detection of actin ( A P V. faba A B I J L. luteus C D K L B. napus E F M N A. thaliana G H O P A H 50 I P Panel descriptions are provided in the main text. A′ P′ A″ P″ Figure 16 Immunofluorescence detection of H3T3Ph in root meristem cells of V. faba A F 50 G Q A′ Q′ A″ Q″ V. faba 50 R p Figure 17 Immunofluorescence detection of H3T3Ph in root meristem cells of B. napus A E 50 F J A′ J′ A″ J″ B. napus 50 K p Figure 18 Immunofluorescence detection of H3S10Ph in root meristem cells of V. faba A D 50 E J A′ J′ A″ J″ V. faba 50 K p Figure 19 Immunofluorescence detection of H3S10Ph in root meristem cells of B. napus A D 50 E J A′ J′ A″ J″ B. napus 50 K p Figure 20 Effect of SEO on meristematic cell proliferation: ROS generation and DNA break formation lead to a slowdown of S-phase progression (pathways I–VI), mitotic entry arrest, and mitotic defects through decreased levels of cyclin-dependent kinase Cdc2 (the conserved plant CDKA homolog) and alterations in microtubule dynamics (pathways 1–11), as well as H3 histone epigenetic disturbances, likely associated with reduced PP1/2A phosphatase activity (pathways A–J). The pathway numbering used in the flowchart is maintained in the illustrative panel depicting the processes discussed. A detailed description of the events is provided in the Introduction and Discussion, and abbreviations are explained in the “Abbreviations” section. Orange arrows indicate changes resulting from cyclin-dependent kinase deficiency, with orange X marks representing the processes affected. Red arrows and X marks similarly denote effects of PP1/2A activity inhibition. Created with biorender.com. ",
  "metadata": {
    "Title of this paper": "NIH Image to ImageJ: 25 years of Image analysis",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469951/"
  }
}