{
  "title": "Paper_770",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473384 PMC12473384.1 12473384 12473384 41012549 10.3390/pharmaceutics17091214 pharmaceutics-17-01214 1 Article Industrial Sustainable Decrystallizing Formulation to Enhance Dissolution of Candesartan Cilexetil: Overcoming Limitations of Traditional Solid Dispersion Approaches https://orcid.org/0000-0001-7535-5453 Ibrahim Mohamed A. Resources Writing – review & editing Supervision Project administration Funding acquisition * https://orcid.org/0000-0003-1842-6010 Sherif Abdelrahman Y. Conceptualization Methodology Software Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing * Alshora Doaa Hasan Validation Formal analysis Writing – review & editing Craig Duncan Academic Editor Department of Pharmaceutics, College of Pharmacy, King Saud University, Riyadh 11451, Saudi Arabia; dalahora@ksu.edu.sa * mhamoudah@ksu.edu.sa ashreef@ksu.edu.sa 17 9 2025 9 2025 17 9 497664 1214 11 8 2025 14 9 2025 15 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results Conclusions decrystallizing formulation solid dispersion candesartan cilexetil industrial manufacturing score Ongoing Research Funding Program King Saud University, Riyadh, Saudi Arabia ORF-2025-171 The authors extend their appreciation to the Ongoing Research Funding Program, (ORF-2025-171), King Saud University, Riyadh, Saudi Arabia. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The reported diminished bioavailability of hydrophobic drug molecules is usually ascribed to their low solubility within the hydrophilic microenvironment of the gastrointestinal tract [ 1 2 3 4 5 Solid dispersion is usually composed of drug molecules that are molecularly dispersed within the matrix of hydrophilic polymers [ 6 7 8 9 10 11 Various methods are used to prepare solid dispersion, such as microwave, lyophilization, spray drying, and hot-melt extrusion [ 12 13 14 15 16 These limitations underscore the need for alternative approaches to address the aforementioned challenges of the traditional preparation method. In this context, a novel decrystallizing formulation composed of a thermoresponsive polymer (poloxamer) and a cross-linking agent (propylene glycol) has been proposed to overcome the limitations of conventional approaches. This formulation exists in a solid state at room temperature and can be converted to a liquid state upon exposure to body temperature. The proposed approach offers additional benefits, including a simple preparation method that avoids the use of energy-consuming instruments and the use of organic solvents, which have a harmful impact on the environment. Candesartan cilexetil, an antihypertensive therapeutic agent, decreases blood pressure through an antagonistic influence on the angiotensin II receptor [ 17 18 19 20 21 However, the low aqueous solubility of candesartan cilexetil (0.0595 mg/mL) necessitates the demand for amorphization technology to overcome this issue [ 22 23 24 25 26 The current study aims to develop a proposed novel formulation containing candesartan cilexetil to investigate its ability to enhance the dissolution of poorly water-soluble drug molecules. To achieve this, various types of poloxamer were used at various concentrations to prepare formulations. Moreover, the prepared formulation was subjected to pharmaceutical characterization in terms of decrystallizing temperature, decrystallizing time, and solubility to select the optimum formulation. Finally, the in vitro liquification and dissolution performance of the optimized formulation were tested to study the drug dissolution behavior from the proposed formulation. 2. Materials and Methods 2.1. Materials Riyadh Pharma (Riyadh, Saudi Arabia) generously supplied candesartan cilexetil. Propylene glycol was obtained from Winlab Laboratory (Leicestershire, UK). Sigma-Aldrich (St. Louis, MO, USA) provided both ammonium formate and formic acid, which were used for the preparation of the aqueous component of the mobile phase. AppliChem Panreac (Darmstadt, Germany) provided acetonitrile, which was used as an organic component of the mobile phase. 2.2. UPLC Method for Drug Quantification The developed ultra-performance liquid chromatography (UPLC) was implemented using a Dionex UltiMate 3000 system (Thermo Scientific, Bedford, MA, USA) to determine the candesartan cilexetil concentration within the analyzed samples during solubility and dissolution studies. The mobile phase (10 mM ammonium formate buffer: 0.1% formic acid: acetonitrile; 36: 4: 60% v/v) was eluted using a Dionex UltiMate 3000 system (Thermo Scientific, Bedford, MA, USA) at a 0.4 mL/min flow rate through a connected HSS T3 1.8 µm (2.1 × 50 mm) column. The temperature of the utilized column was preheated to 25 °C during analysis of the injected samples. A connected Dionex Photodiode Array (PDA) detector (Thermo Scientific, Bedford, MA, USA) was set at 254 nm to measure the absorbance of candesartan cilexetil within samples. The UPLC method and data analysis were performed using Chromeleon software version 5. 2.3. Selection of Cross-Linking Agent This study aimed to select an appropriate cross-linking agent and identify the agent that facilitates the solidification of the prepared formulation. Herein, three potential cross-linking agents (isopropanol, propylene glycol, and glycerol) were screened based on their expected hydrogen bonding formation capability with poloxamer. A 10% w/w poloxamer 407 was dissolved in the cross-linking agent individually to select the optimum one. The solubility of poloxamer 407 was tested at two temperatures (40 °C and 8 °C) using an incubator and a refrigerator, respectively. These two temperatures assess the solubilization power of the cross-linking agent and the crystallization behavior of the prepared mixture. These steps were repeated three times to ensure the final appearance of the mixtures when exposed to multiple cycles. 2.4. Preparation of Decrystallization Formulation Decrystallization formulations were prepared to assess the impact of polymer concentration on their pharmaceutical behavior. For each polymer (Poloxamer 407 and 188), five decrystallization formulations were prepared at concentrations of 5, 10, 15, 20, and 25% w/w following poloxamer dissolution in propylene glycol, as detailed in Table 1 2.5. Decrystallization Temperature The decrystallization temperature for the prepared formulations was measured to determine the temperature at which the decrystallizing formulation liquefies in vivo. Within a glass test tube, approximately one gram of the decrystallizing formulation was placed and stored in the refrigerator to solidify. The temperature of the decrystallizing formulation was controlled by placing a rack containing test tubes in a water bath set at 28 ± 0.1 °C. After a 5-min equilibration period, a visual assessment of the formulations’ appearance was performed to determine if they had decrystallized. Afterward, the temperature of the water was increased by 0.5 ± 0.1 °C after each assessment until the decrystallization temperature for all formulations was determined. 2.6. Decrystallization Time For the assessment of decrystallization time under in vivo conditions, water temperature was maintained at 37 ± 0.1 °C. The time required for the prepared formulation to decrystallize was evaluated separately. Test tubes were immersed in the water bath to a depth ensuring complete submersion of the formulation sample within a controlled temperature. Continuous visual monitoring for the immersed formulation was performed. The endpoint was determined once the formulation’s physical appearance changed to a liquefied state. 2.7. Solubility The solubility of candesartan cilexetil within the decrystallizing formulation was assessed using a simple mixing method. An excess amount of candesartan cilexetil was mixed with the decrystallizing formulation at a stirring rate of 1000 rpm for 24 h. To precipitate the undissolved drug, the mixture was centrifuged the next day for 10 min at 10,000 rpm. Drug solubility was assessed by determining drug concentration in the supernatant using the UPLC method after proper dilution. 2.8. FTIR A PerkinElmer Spectrum-100 Spectrometer (Waltham, MA, USA) was used to study the chemical interaction between poloxamer and propylene glycol. Fourier transform infrared (FTIR) spectra of poloxamer, propylene glycol, their physical mixture, solid decrystallizing formulation, and liquid decrystallizing formulation were scanned in the wavenumber range of 800–4000 cm −1 2.9. In Vitro Liquefication Performance This experiment was conducted on the decrystallizing formulation to guarantee a complete liquification behavior that occurs following oral administration under physiological conditions. The temperature of the dissolution vessel containing 200 mL of phosphate buffer was preheated to 37 ± 0.5 °C. A hard gelatin capsule filled with the decrystallizing formulation surrounded by a cylindrical sinker was immersed in the dissolution vessel. Throughout the liquification process, images were captured for photographic documentation of physical appearance changes in the formulation. 2.10. Dissolution Study The current study investigates the impact of decrystallizing formulation on the dissolution performance of candesartan cilexetil. The dissolution study was carried out using a Type II apparatus assembled paddle (LOGAN Inst. Corp., Franklin, NJ, USA). The dissolution medium consisted of 900 mL of phosphate-buffer solution (pH 6.8), which was prewarmed to 37.0 ± 0.5 °C prior to the experiment. Hard gelatin capsules containing either 8 mg of pure candesartan cilexetil or an equivalent amount of the drug in a decrystallized formulation were used. The dissolution test was performed under paddle rotation at 50 rpm. Sample collections were taken at specified time points (5, 15, 30, 45, and 60 min), and drug concentration was determined using the developed UPLC analytical method. The tolerance level for successful formulation was considered to be not less than 80% of the drug dissolved within 45 min. Various dissolution parameters were calculated to investigate the impact of formulation type on the dissolution of candesartan cilexetil. The initial dissolution rate was calculated using equation (1) over the first 5 min to provide a clear impression of the formulation’s efficiency in enhancing drug dissolution. However, the relative dissolution rate was calculated using equation (2) over the entire 60 min. This is attributed to the negligible drug dissolution from raw candesartan cilexetil occurring within the initial 15 min, which prevents the calculation of dissolution rate. Initial dissolution rate (IDR): (1) I D R = Q t t Here, IDR = Initial dissolution rate (%/min); Q t t = Time period (min). Relative dissolution rate (RDR): RDR = DR test/DR reference (2) Here, DR test = Dissolution rate of test formulation (%); DR reference = Dissolution rate of raw drug (%). 2.11. Industrial Manufacturing Score Assessment The industrial sustainability of the decrystallizing formulation was evaluated based on comparing five critical parameters across conventional solid dispersion techniques: organic solvent usage, energy consumption, equipment complexity, processing time, and waste generation. Each parameter was scored on a scale of 1–5 (1 = least sustainable, 5 = most sustainable) based on established criteria as shown in Table 2 3. Results and Discussion 3.1. UPLC Method for Drug Quantification The developed UPLC method produced a well-defined peak of candesartan cilexetil with a retention time of 2.2 min ( Figure 1 Figure 1 2 Figure 1 Table 3 3.2. Selection of Cross-Linking Agent The present test was performed to select the appropriate cross-linking agent for the thermoresponsive polymer used. Three cross-linking agents (isopropanol, propylene glycol, and glycerol) were used to study their impact on the thermoresponsive behaviors of poloxamer polymers. For screening purposes, poloxamer 407 was dissolved in the selected cross-linking agents at a concentration of 10% w/w. The current study revealed a significant difference in the solubilization behavior of poloxamer 407 in selected solvents, as demonstrated in Figure 2 The scientific explanation for these observations can be understood from the structural analysis presented in Figure 3 3 Upon heating, both isopropanol and propylene glycol dissolve poloxamer 407 through favorable molecular interactions. At elevated temperatures, poloxamer chains adopt micellar structures with hydrophobic polypropylene oxide cores surrounded by hydrophilic polyethylene oxide shells [ 27 28 However, the cooling process drives the conversion of polymer assembly from micellar to monomeric units [ 29 30 Figure 4 Figure 2 Figure 4 3.3. Decrystallization Temperature The decrystallization temperature was performed to determine the temperature at which the decrystallizing formulation switches its physical state from solid to liquid. Figure 5 2 2 The present finding reflects the enhanced hydrogen bonding interaction between the used components and increased cross-linking degree at higher concentrations. This could be ascribed to the reported positive influence of increased polymer concentration on the developed intermolecular cross-linking interactions [ 31 32 33 3.4. Decrystallization Time The decrystallization time was conducted to determine the duration required for the complete phase transition of the decrystallizing formulation from a solid to a liquid state at physiological conditions. Figure 6 2 2 The observed concentration-dependent increase in decrystallization time reflects the formation of strong intermolecular bonds at higher polymer concentrations. Therefore, it requires a longer duration of period to entirely disrupt the formed intermolecular bonds and convert to a liquid phase. Poloxamer 407-based formulations dependably require longer decrystallization times compared to poloxamer 188-based formulations at equivalent concentrations. This difference can be attributed to the ability of the higher molecular weight polymer (Poloxamer 407) to form stronger intermolecular bonds compared with its counterpart, the polymer with a lower molecular weight (Poloxamer 188). 3.5. Solubility Figure 7 34 3.6. Selection of Optimized Formulation The selection criteria were performed based on a systematic evaluation of all measured responses (decrystallization temperature, decrystallization time, and solubility). Using a formulation with a high decrystallization temperature could prevent premature conversion to the liquid state before administration. Moreover, the formulation exhibits a decrystallization temperature at body temperature, ensuring conversion to the liquid state in vivo. Furthermore, formulation with low decrystallization time guarantees rapid conversion to the liquid state in vivo after administration. However, all formulations decrystallize within less than 5 min. Hence, this parameter was excluded from the selection criteria. Finally, formulations with high drug solubilization capacity reduce the total dosage volume and enhance pharmaceutical applicability. Consequently, the formulation containing 20% w/w of poloxamer 407 was selected as the optimized one because it achieved the highest drug solubilization capacity, with a value of 5.51 ± 0.08 mg/g, and exhibited a decrystallization temperature of 37 °C. Moreover, the selected decrystallizing formulation exhibited complete liquification within 5 min. 3.7. FTIR FTIR spectroscopy was used to elucidate the expected molecular interactions and structural organization of poloxamer 407 within propylene glycol that triggered the thermal behavior of the prepared decrystallizing formulation. Figure 8 −1 −1 3 2 −1 −1 35 36 −1 −1 2 −1 −1 2 −1 −1 30 37 FTIR spectrum of liquid decrystallizing formulation containing poloxamer 407 dissolved within propylene glycol showed characteristic changes compared to the physical mixture. Blue shift of the O-H stretching peak from 3309 to 3338 cm −1 2 −1 2 −1 −1 The FTIR spectrum of the solid decrystallizing formulation was consistent with the previously proposed mechanism of transition from a micellar to a monomeric state upon cooling. The results showed a blue shift of the O-H stretching peak, similar to that of the liquid decrystallizing formulation, from 3309 to 3343 cm −1 Figure 4 2 3.8. In Vitro Liquefication Performance Figure 9 Figure 9 3.9. Dissolution Study Figure 10 Table 4 The outstanding dissolution efficiency achieved by the decrystallizing formulation can be attributed to several mechanisms. Firstly, the prepared decrystallizing formulation exhibited an initial dissolution of candesartan cilexetil with a value of 67.9% within 5 min. This is clearly supported by the initial dissolution rate data, which showed an increase from 0.00%/min to 13.58%/min for the raw drug and the decrystallizing formulation, respectively. This indicates rapid liquefaction and immediate drug solubilization upon exposure to physiological temperature (37 °C), which agrees with the in vitro liquification performance study. Furthermore, complete formulation liquification overcomes the diffusional barriers present in the conventional matrix of conventional solid dispersion. The instant conversion from a solid to a liquid at body temperature provides immediate access to drug molecules dispersed in an amorphous state within the polymer matrix. In addition, the reported formation of a micellar structure by poloxamer chains creates a solubilization environment that significantly enhances drug dissolution. Moreover, a 23-fold increase in relative dissolution rate for the decrystallizing formulation compared with a 4.1-fold increase for the physical mixture suggests that candesartan cilexetil is solubilized within the matrix of the decrystallizing formulation. This provides indirect evidence regarding the molecular-level dispersion of the drug within the poloxamer matrix and its existence in an amorphous state. The results obtained showed that the prepared decrystallizing formulation is expected to improve the bioavailability of candesartan cilexetil significantly. This is consistent with a positive correlation between the enhanced bioavailability of drugs loaded within polymeric-containing delivery systems [ 38 39 3.10. Comparative Assessment Against a Marketed Tablet A comparative dissolution study for the prepared decrystallizing formulation against a commercial tablet is presented in Figure 11 40 41 42 3.11. Industrial Manufacturing Score Assessment The current decrystallization formation was compared with the previously proposed methods in the literature. Figure 12 Figure 12 Lyophilization technology demonstrated poor manufacturing feasibility with the lowest industrial manufacturing score of 5 points. This is attributed to the use of organic solvents, which necessitate an energy-consuming sublimation process using an expensive instrument with a vacuum-controlled system [ 43 44 45 46 Spray drying technology achieved a marginally improved performance with a score of 7 points, indicating a slight enhancement over lyophilization. This is ascribed to the continuous production capability and short processing time, which reduces the energy consumption during production [ 47 24 48 Hot melt extrusion achieved a score of 15 owing to the lack of demand for organic solvents during the preparation of the solid dispersion, which reduces the generation of waste products during production [ 49 50 7 51 Decrystallizing formulation was invented to overcome the aforementioned limitation of conventional solid dispersion approaches. Eliminating the use of organic solvents during the preparation of solid dispersion reduces the generation of waste products during production. Moreover, rapid dissolution of poloxamer in propylene glycol with the production of a solution dosage form that is suitable for direct filling in a hand gelatin capsule. This avoids the powder processing requirements associated with other technologies, which reduces energy consumption through the use of complex equipment and minimizes processing time. Decrystallizing formulation offers substantial economic advantages through a noteworthy reduction in capital investment compared to conventional methods. 4. Conclusions In the present study, a novel decrystallizing formulation was successfully prepared to address the limitations of conventional solid dispersion. The optimized formulation, which consisted of 20% w/w poloxamer 407 dissolved in propylene glycol, exhibited a maximum drug solubility of 5.51 ± 0.08 mg/g. Moreover, the formulation exhibited decrystallization at physiological temperature (37 °C) within 5 min. FTIR analysis confirmed the presence of hydrogen bonding networks between poloxamer and propylene glycol, which are responsible for the temperature-dependent phase transitions. Furthermore, an in vitro dissolution study showed that the decrystallizing formulation had a dissolution efficiency (80.6 ± 3.9%) with a 45-fold improvement over raw candesartan cilexetil. The current decrystallizing formulation presents a promising approach for enhancing the bioavailability of poorly water-soluble drugs and addressing the limitations of conventional methods. It eliminates the use of organic solvents and avoids the need for high-energy processing or complex equipment. This represents a paradigm shift toward sustainable industrial pharmaceutical manufacturing processes which address the critical limitations of existing approaches. Acknowledgments The authors extend their appreciation to the Ongoing Research Funding Program, (ORF-2025-171), King Saud University, Riyadh, Saudi Arabia. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.Y.S.; methodology, A.Y.S.; software, A.Y.S.; validation, A.Y.S. and D.H.A.; formal analysis, A.Y.S. and D.H.A.; investigation, A.Y.S.; resources, A.Y.S. and M.A.I.; data curation, A.Y.S.; writing—original draft preparation, A.Y.S.; writing—review and editing, A.Y.S., M.A.I. and D.H.A.; visualization, A.Y.S.; supervision, M.A.I.; project administration, M.A.I.; funding acquisition, M.A.I. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. References 1. Zhang X. Xing H. Zhao Y. Ma Z. Pharmaceutical dispersion techniques for dissolution and bioavailability enhancement of poorly water-soluble drugs Pharmaceutics 2018 10 74 10.3390/pharmaceutics10030074 29937483 PMC6161168 2. Xie B. Liu Y. Li X. Yang P. He W. Solubilization techniques used for poorly water-soluble drugs Acta Pharm. Sin. B 2024 14 4683 4716 10.1016/j.apsb.2024.08.027 39664427 PMC11628819 3. Singh A. Worku Z.A. Van den Mooter G. Oral formulation strategies to improve solubility of poorly water-soluble drugs Expert Opin. Drug Deliv. 2011 8 1361 1378 10.1517/17425247.2011.606808 21810062 4. Nyamba I. Sombie C.B. Yabre M. Zime-Diawara H. Yameogo J. Ouedraogo S. Lechanteur A. Semde R. Evrard B. Pharmaceutical approaches for enhancing solubility and oral bioavailability of poorly soluble drugs Eur. J. Pharm. Biopharm. 2024 204 114513 10.1016/j.ejpb.2024.114513 39313163 5. Vasconcelos T. Sarmento B. Costa P. Solid dispersions as strategy to improve oral bioavailability of poor water soluble drugs Drug Discov. Today 2007 12 1068 1075 10.1016/j.drudis.2007.09.005 18061887 6. Chawla G. K BANSAL A. Improved dissolution of a poorly water soluble drug in solid dispersions with polymeric and non-polymeric hydrophilic additives Acta Pharm. 2008 58 257 274 10.2478/v10007-008-0016-1 19103563 7. Sherif A.Y. Abbas Ibrahim M. Self-Nanoemulsifying Drug Delivery System Combined with a Polymeric Amorphous System of Glibenclamide for Enhanced Drug Dissolution and Stability ACS Omega 2024 9 43165 43174 10.1021/acsomega.4c07285 39464452 PMC11500158 8. Bikiaris D.N. Solid dispersions, part I: Recent evolutions and future opportunities in manufacturing methods for dissolution rate enhancement of poorly water-soluble drugs Expert Opin. Drug Deliv. 2011 8 1501 1519 10.1517/17425247.2011.618181 21919807 9. He Y. Ho C. Amorphous solid dispersions: Utilization and challenges in drug discovery and development J. Pharm. Sci. 2015 104 3237 3258 10.1002/jps.24541 26175316 10. Yang B. Wei C. Qian F. Li S. Surface wettability modulated by surfactant and its effects on the drug release and absorption of fenofibrate solid dispersions AAPS PharmSciTech 2019 20 234 10.1208/s12249-019-1446-4 31236817 11. Gupta A. Paudwal G. Dolkar R. Lewis S. Gupta P.N. Recent advances in the surfactant and controlled release polymer-based solid dispersion Curr. Pharm. Des. 2022 28 1643 1659 10.2174/1381612828666220223095417 35209818 12. Jadav N. Paradkar A. Solid dispersions: Technologies used and future outlook Nanopharmaceuticals Elsevier Amsterdam, The Netherlands 2020 91 120 13. Qiang W. Löbmann K. McCoy C.P. Andrews G.P. Zhao M. Microwave-induced in situ amorphization: A new strategy for tackling the stability issue of amorphous solid dispersions Pharmaceutics 2020 12 655 10.3390/pharmaceutics12070655 32664477 PMC7408542 14. Mehanna M.M. Abla K.K. Recent advances in freeze-drying: Variables, cycle optimization, and innovative techniques Pharm. Dev. Technol. 2022 27 904 923 10.1080/10837450.2022.2129385 36174214 15. Srinarong P. de Waard H. Frijlink H.W. Hinrichs W.L. Improved dissolution behavior of lipophilic drugs by solid dispersions: The production process as starting point for formulation considerations Expert Opin. Drug Deliv. 2011 8 1121 1140 10.1517/17425247.2011.598147 21722000 16. Lu M. Guo Z. Li Y. Pang H. Lin L. Liu X. Pan X. Wu C. Application of hot melt extrusion for poorly water-soluble drugs: Limitations, advances and future prospects Curr. Pharm. Des. 2014 20 369 387 10.2174/13816128113199990402 23651401 17. Sherif A.Y. Alshora D.H. Ibrahim M.A. Jreebi A. Development and Evaluation of Solidified Supersaturated SNEDDS Loaded with Triple Combination Therapy for Metabolic Syndrome AAPS PharmSciTech 2024 25 209 10.1208/s12249-024-02928-1 39237698 18. Meredith P.A. Candesartan cilexetil–a review of effects on cardiovascular complications in hypertension and chronic heart failure Curr. Med. Res. Opin. 2007 23 1693 1705 10.1185/030079907X210723 17588300 19. Soh M.-S. Won K.-H. Kim J.-J. Lee S.Y. Hyon M.S. Youn H.-J. Rha S.-W. Kim D.-I. Ahn Y. Kim B.J. Phase III randomized clinical trial of efficacy and safety of amlodipine and candesartan cilexetil combination for hypertension treatment Sci. Rep. 2024 14 22940 10.1038/s41598-024-74003-5 39358448 PMC11447083 20. Badila E. Frunza S.A. Tirziu C.M. Bartos D. Dorobantu M. The effect of candesartan on blood pressure, metabolic profile and renal function in hypertensive patients Int. J. Cardiol. 2009 137 S134 S135 10.1016/j.ijcard.2009.09.457 21. Henley B. Okafor M. Kulshreshtha A. Trammell A. Hajjar I. Effects of candesartan on cerebral microvascular function in mild cognitive impairment: Results of two clinical trials Int. J. Stroke 2023 18 736 744 10.1177/17474930231153313 36645213 PMC10311938 22. Figueroa-Campos A. Sánchez-Dengra B. Merino V. Dahan A. González-Álvarez I. García-Arieta A. González-Álvarez M. Bermejo M. Candesartan Cilexetil In Vitro–In Vivo Correlation: Predictive Dissolution as a Development Tool Pharmaceutics 2020 12 633 10.3390/pharmaceutics12070633 32640620 PMC7408357 23. Gleiter C.H. Mörike K.E. Clinical pharmacokinetics of candesartan Clin. Pharmacokinet. 2002 41 7 17 10.2165/00003088-200241010-00002 11825094 24. Ali I.S.M. Sajad U.A. Abdul Rasool B.K. Solid dispersion systems for enhanced dissolution of poorly water-soluble candesartan cilexetil: In vitro evaluation and simulated pharmacokinetics studies PLoS ONE 2024 19 e0303900 10.1371/journal.pone.0303900 38843120 PMC11156308 25. Shaikh S.M. Avachat A.M. Enhancement of solubility and permeability of candesartan cilexetil by using different pharmaceutical interventions Curr. Drug Deliv. 2011 8 346 353 10.2174/156720111795767997 21453263 26. Dudhipala N. Veerabrahma K. Candesartan cilexetil loaded solid lipid nanoparticles for oral delivery: Characterization, pharmacokinetic and pharmacodynamic evaluation Drug Deliv. 2016 23 395 404 10.3109/10717544.2014.914986 24865287 27. Brambilla E. Locarno S. Gallo S. Orsini F. Pini C. Farronato M. Thomaz D.V. Lenardi C. Piazzoni M. Tartaglia G. Poloxamer-based hydrogel as drug delivery system: How polymeric excipients influence the chemical-physical properties Polymers 2022 14 3624 10.3390/polym14173624 36080699 PMC9460339 28. Bajwa M. Tabassam N. Hameed H. Irfan A. Zaman M. Khan M.A. Shazly G.A. Mehboob T. Riaz T. Jardan Y.A.B. Thermo-responsive sol-gel-based nano-carriers containing terbinafine HCl: Formulation, in vitro and ex vivo characterization, and antifungal activity Gels 2023 9 830 10.3390/gels9100830 37888403 PMC10606830 29. Marques A.C. Costa P.C. Velho S. Amaral M.H. Injectable poloxamer hydrogels for local cancer therapy Gels 2023 9 593 10.3390/gels9070593 37504472 PMC10379388 30. Pontremoli C. Boffito M. Fiorilli S. Laurano R. Torchio A. Bari A. Tonda-Turo C. Ciardelli G. Vitale-Brovarone C. Hybrid injectable platforms for the in situ delivery of therapeutic ions from mesoporous glasses Chem. Eng. J. 2018 340 103 113 10.1016/j.cej.2018.01.073 31. Khutoryanskiy V.V. Hydrogen-bonded interpolymer complexes as materials for pharmaceutical applications Int. J. Pharm. 2007 334 15 26 10.1016/j.ijpharm.2007.01.037 17320317 32. Jones D.S. Brown A.F. David Woolfson A. Solute and solvent effects on the thermorheological properties of poly(oxyethylene)–poly(oxypropylene) block copolymers: Implications for pharmaceutical dosage form design J. Appl. Polym. Sci. 2003 87 1016 1026 10.1002/app.11534 33. Wang J. Yu S. Zhou J. Liang C. Huang W. Hu Z. Chen Z. Xiang H. Zhu M. Discrete molecular weight strategy modulates hydrogen bonding-induced crystallization and chain orientation for melt-spun high-strength polyamide fibers Polym. Eng. Sci. 2024 64 4053 4063 10.1002/pen.26832 34. Chen W. Ross A. Steinhuber B. Hoffmann G. Oltra N.S. Ravuri S.K.K. Bond S. Bell C. Kopf R. The development and qualification of liquid adsorption chromatography for poloxamer 188 characterization J. Chromatogr. A 2021 1652 462353 10.1016/j.chroma.2021.462353 34237484 35. Dardir M. Ahmed H.E. Abd El Fattah M. Hassan M.E.E.D.R. Seda H.A. Elsonbatty M.G. Propylene glycol mono and di stearates as water in oil emulsifiers for oil-well drilling fluids Egypt. J. Pet. 2018 27 1035 1041 10.1016/j.ejpe.2018.03.002 36. Ledniowska K. Nosal-Kovalenko H. Janik W. Krasuska A. Stańczyk D. Sabura E. Bartoszewicz M. Rybak A. Effective, environmentally friendly PVC plasticizers based on succinic acid Polymers 2022 14 1295 10.3390/polym14071295 35406169 PMC9002721 37. Laurano R. Abrami M. Grassi M. Ciardelli G. Boffito M. Chiono V. Using poloxamer® 407 as building block of amphiphilic poly (Ether urethane) S: Effect of its molecular weight distribution on thermo-sensitive hydrogel performances in the perspective of their biomedical application Front. Mater. 2020 7 594515 10.3389/fmats.2020.594515 38. Xu W. Ling P. Zhang T. Polymeric micelles, a promising drug delivery system to enhance bioavailability of poorly water-soluble drugs J. Drug Deliv. 2013 2013 340315 10.1155/2013/340315 23936656 PMC3712247 39. Fernandes A.I. Polymers enhancing bioavailability in drug delivery Pharmaceutics 2023 15 2604 10.3390/pharmaceutics15112604 38004582 PMC10674154 40. Gurunath S. Nanjwade B.K. Patil P. Oral bioavailability and intestinal absorption of candesartan cilexetil: Role of naringin as P-glycoprotein inhibitor Drug Dev. Ind. Pharm. 2015 41 170 176 10.3109/03639045.2013.850716 24168234 41. Surampalli G. Nanjwade B.K. Patil P. Chilla R. Novel tablet formulation of amorphous candesartan cilexetil solid dispersions involving P-gp inhibition for optimal drug delivery: In vitro and in vivo evaluation Drug Deliv. 2016 23 2124 2138 10.3109/10717544.2014.945017 25080228 42. Nguyen T.-T.-L. Duong V.-A. Maeng H.-J. Pharmaceutical formulations with P-glycoprotein inhibitory effect as promising approaches for enhancing oral drug absorption and bioavailability Pharmaceutics 2021 13 1103 10.3390/pharmaceutics13071103 34371794 PMC8309061 43. Pasha M.K. Muzeeb S. Basha S.J.S. Shashikumar D. Mullangi R. Srinivas N.R. Analysis of five HMG-CoA reductase inhibitors—Atorvastatin, lovastatin, pravastatin, rosuvastatin and simvastatin: Pharmacological, pharmacokinetic and analytical overview and development of a new method for use in pharmaceutical formulations analysis and in vitro metabolism studies Biomed. Chromatogr. 2006 20 282 293 16143964 10.1002/bmc.561 44. Grant N. Zhang H. Poorly water-soluble drug nanoparticles via an emulsion-freeze-drying approach J. Colloid Interface Sci. 2011 356 573 578 10.1016/j.jcis.2011.01.056 21315369 45. Teagarden D.L. Baker D.S. Practical aspects of lyophilization using non-aqueous co-solvent systems Eur. J. Pharm. Sci. 2002 15 115 133 10.1016/S0928-0987(01)00221-4 11849908 46. Ohori R. Akita T. Yamashita C. Scale-up/tech transfer issues of the lyophilization cycle for biopharmaceuticals and recently emerging technologies and approaches Dry. Technol. 2023 41 233 250 47. Preston K.B. Randolph T.W. Stability of lyophilized and spray dried vaccine formulations Adv. Drug Deliv. Rev. 2021 171 50 61 10.1016/j.addr.2021.01.016 33484735 48. Patel M. Tekade A. Gattani S. Surana S. Solubility enhancement of lovastatin by modified locust bean gum using solid dispersion techniques Aaps Pharmscitech 2008 9 1262 1269 10.1208/s12249-008-9171-4 19115112 PMC2628263 49. Patil H. Tiwari R.V. Repka M.A. Hot-melt extrusion: From theory to application in pharmaceutical formulation Aaps Pharmscitech 2016 17 20 42 10.1208/s12249-015-0360-7 26159653 PMC4766118 50. Maniruzzaman M. Boateng J.S. Snowden M.J. Douroumis D. A review of hot-melt extrusion: Process technology to pharmaceutical products Int. Sch. Res. Not. 2012 2012 436763 10.5402/2012/436763 PMC3543799 23326686 51. Sherif A.Y. Shahba A.A.-W. Development of a multifunctional oral dosage form via integration of solid dispersion technology with a black seed oil-based self-nanoemulsifying drug delivery system Biomedicines 2023 11 2733 37893108 10.3390/biomedicines11102733 PMC10604588 Figure 1 ( a b c Figure 2 Physical appearance of 10% w/w poloxamer 407 in glycerol, propylene glycol, and isopropanol after mixing (top), at 40 °C (middle), and at 4 °C (bottom). Figure 3 Chemical structure of ( a b c d Figure 4 Molecular interactions of poloxamer with ( a b Figure 5 The relationship between polymer concentration and decrystallization temperature for poloxamer 407 (blue) and poloxamer 188 (green). Figure 6 The relationship between polymer concentration and decrystallization time for poloxamer 407 (blue) and poloxamer 188 (green). Figure 7 Solubility of candesartan cilexetil in propylene glycol containing ( a b Figure 8 FTIR spectrum of propylene glycol, Poloxamer 407, their physical mixture, liquid decrystallizing formulation, and solid decrystallizing formulation. Figure 9 ( a b Figure 10 In vitro dissolution profile of raw candesartan cilexetil, physical mixture, and decrystallizing formulation. Figure 11 ( a b Figure 12 ( a b pharmaceutics-17-01214-t001_Table 1 Table 1 Composition of decrystallization formulations. Poloxamer Type Poloxamer Concentration (% w/w) Propylene Glycol (% w/w) Poloxamer 407 5 95 10 90 15 85 20 80 25 75 Poloxamer 188 5 95 10 90 15 85 20 80 25 75 pharmaceutics-17-01214-t002_Table 2 Table 2 Scoring criteria for industrial sustainability assessment parameters. Parameter Score 5 (Most Sustainable) Score 1 (Least Sustainable) Organic Solvent Usage Not required Mandatory Energy Consumption Ambient temperature processing Extreme heating/cooling systems Equipment Complexity Basic equipment Highly specialized machinery Processing Time ≤2 h >12 h Waste Generation Minimal waste Substantial hazardous waste pharmaceutics-17-01214-t003_Table 3 Table 3 Analytical parameters for the UPLC method for the quantification of candesartan cilexetil. Parameter Value Linearity range (μg/mL) 0.5–20 regression coefficient 0.9999 Regression equation y = 0.144x + 0.0004 Slope ± SD 0.144 ± 0.0004 Confidence interval of slope * 0.1429–0.1450 Standard error of the slope 0.00039 Intercept ± SD −0.001 ± 0.0033 Confidence interval of intercept * −0.0089–0.0098 Standard error of the intercept 0.0036 LLOD (μg/mL) 0.19 ± 0.03 LLOQ (μg/mL) 0.58 ± 0.08 * confidence interval 95%. pharmaceutics-17-01214-t004_Table 4 Table 4 Initial dissolution rate and relative dissolution rate of raw candesartan cilexetil, physical mixture, and decrystallizing formulation. Tested Agent Dissolution Efficiency (%) Initial Dissolution Rate (%/min) Relative Dissolution Rate Raw candesartan cilexetil 1.8 ± 0.8 0.00 ± 0.0 1.00 ± 0.0 Physical mixture 11.1 ± 6.0 0.49 ± 0.2 4.13 ± 1.4 Decrystallizing formulation 80.6 ± 3.9 13.58 ± 3.0 23.01 ± 6.4 The initial dissolution rate was calculated within the first 5 min. The relative dissolution rate was determined over a 60-min period. ",
  "metadata": {
    "Title of this paper": "Development of a multifunctional oral dosage form via integration of solid dispersion technology with a black seed oil-based self-nanoemulsifying drug delivery system",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473384/"
  }
}