{
  "title": "Paper_1080",
  "abstract": "pmc Natl J Maxillofac Surg Natl J Maxillofac Surg 1762 njmaxsurg NJMS Natl J Maxillofac Surg National Journal of Maxillofacial Surgery 0975-5950 2229-3418 Wolters Kluwer -- Medknow Publications PMC12468789 PMC12468789.1 12468789 12468789 41019694 10.4103/njms.njms_16_25 NJMS-16-242 1 Original Article Can Integra outperform local flaps in the reconstruction of face and scalp skin cancer defects? Stavropoulou-Tatla Stavroula Ferro Ashley 1 Awal Danyal Rae Alexander Fardanesh Armin 2 Ryba Francine Oral and Maxillofacial Surgery, King’s College Hospital NHS Foundation Trust, England 1 2 Address for correspondence: stavroula.stt@gmail.com May-Aug 2025 30 8 2025 16 2 497637 242 248 22 2 2025 25 4 2025 28 4 2025 01 05 2025 27 09 2025 29 09 2025 Copyright: © 2025 National Journal of Maxillofacial Surgery 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open access journal, and articles are distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License, which allows others to remix, tweak, and build upon the work non-commercially, as long as appropriate credit is given and the new creations are licensed under the identical terms. Introduction: Skin cancer of the head is the commonest cancer worldwide, frequently affecting older, medically complex patients, rendering postresection reconstruction challenging. Methods: This is a retrospective cohort study comparing the clinical outcomes of oncologic soft tissue defect reconstruction of the head with the Integra dermal regeneration template versus local flaps. Defects reconstructed at a single center between January 1, 2022, and December 31, 2022, were included. Multivariable logistic regression determined the independent effect of demographics and surgical factors on the odds of complications. Results: A total of 125 defects were included, 59 reconstructed with Integra and 66 with a local flap. Baseline characteristics were similar, but patients were significantly older within the Integra group (84 vs. 78 years, P 2 2 P P Conclusion: Reconstruction of oncologic soft tissue defects with Integra is related to high graft failure rates, limiting its clinical effectiveness compared to local flaps. Surgical factors like subsequent epidermal grafting, fenestration, or antibiotic prophylaxis are likely to improve outcomes. The development of a standardized surgical approach based on randomized, prospective research is warranted, as Integra can enable the closure of large defects in medically complex patients, unsuitable for reconstruction by other methods. Head and neck Integra reconstruction skin cancer defect Nil. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Skin cancer is the most prevalent cancer, accounting for one in three cancers worldwide.[ 1 2 Pedicled or free flaps are recognized as the most successful approach with flap survival rates ranging between 95% and 99%.[ 3 The use of skin substitutes, such as the Integra Regeneration Template (Integra), as an alternative to local tissue rearrangement, has gained popularity in recent years. Integra is an artificial dermal bi-layered matrix, consisting of a deep bovine collagen layer, designed to promote cellular growth and neovascularization and a superficial silicone layer acting as a bacterial barrier. The superficial silicone layer can be replaced with an epidermal autograft usually within 2–3 weeks.[ 4 Integra has been licensed by the Food and Drug Administration for use in burns and scar contractures. The benefits of dermal regeneration templates like Integra include the ease of use, provision of immediate coverage, sparing of a donor site, and graft success with acceptable cosmetic results in large defects lacking vascularized beds.[ 5 There is a rapidly evolving body of literature supporting the two-stage reconstruction of postoncologic soft tissue scalp defects using Integra, with graft take rate widely reported as >90%. The most common complication is graft infection, reported in 18–32% of cases.[ 6 7 8 9 10 11 12 This is a retrospective cohort study investigating the use of Integra in the reconstruction of soft tissue oncologic defects of the head and comparing its clinical outcomes to local tissue rearrangement. To our knowledge, it is the first study of its kind. METHODS All patients undergoing reconstruction of an iatrogenic oncologic defect (irrespective of indication) of the head between January 1, 2022, and December 31, 2022, at the maxillofacial surgery department of a single institution were eligible for inclusion in the current study. The patient population was derived by performing a free search of all operation notes and clinic letters on the electronic patient records using the term “Integra” or “flap.” Exclusion criteria were as follows: patients with defects outside the head and neck region, patients in whom defects were not reconstructed with either Integra or local skin flaps or were reconstructed outside the study period or those with duplicate records. All types of local flap and methods of securing Integra were eligible for inclusion. The patient inclusion process is summarized in Figure 1 Figure 1 Flow-diagram of the patient inclusion process. EPR = electronic patient records The following baseline characteristics were extracted from the electronic patient records system: gender, age, indication for excision/resection, anatomical site, wound area (mm 2 The primary outcome was the complication rate. Complications were defined as any documented deviation from the normal postoperative recovery course. Graft failure was defined as the complete separation of the bi-layered Integra matrix from the wound bed. Delayed healing was defined as lack of complete epithelialization at six months. Continuous variables are presented as mean (±standard deviation) and categorical variables as number and percentages. Baseline characteristics between groups were assessed using independent samples t a priori The choice of reconstructive method relied on patient and defect characteristics, with Integra preferentially selected in cases of large defects in areas associated with higher risk of distortion and facial nerve injury. The surgical technique involved the simultaneous application of the Integra graft at the time of excision of the cutaneous lesion. The graft was fitted to the defect size and secured with sutures and a pressure dressing. Single-stage reconstruction without subsequent grafting was undertaken, letting the epidermis form by secondary intention. This study was carried out in accordance with the ethical standards of the institutional Research and Ethics Committee and the Helsinki Declaration of 1975, as revised in 2000. Formal consent was not required as all data used was retrospective and fully anonymized. RESULTS A total of 125 patients were eligible for inclusion the study, 66 of which underwent defect reconstruction using a local flap and 59 using Integra. A total of 40 scalp defects were reconstructed with no cases of pericranium breach. Baseline characteristics between patients in the two groups were broadly similar [ Table 1 P 2 2 P P Table 1 Baseline characteristics and key outcomes of included patients, according to method of defect closure Variable Levels Group Total  P Flap Integra Age Median (IQR) 78.0 (73.0–85.0) 84.0 (78.0–87.0) 80.0 (73.0–86.0) 0.022 Gender F 21 (31.8) 18 (30.5) 39 (31.2) 1 M 45 (68.2) 41 (69.5) 86 (68.8) Indication Cancer 60 (90.9) 50 (84.7) 110 (88.0) 0.434 Noncancer 6 (9.1) 9 (15.3) 15 (12.0) Site Cheek 4 (6.1) 3 (5.1) 7 (5.6) Chin 0 (0.0) 1 (1.7) 1 (0.8) Ear/Pre-auricular 7 (10.6) 1 (1.7) 8 (6.4) Eyebrow 3 (4.5) 0 (0.0) 3 (2.4) Eyelid 2 (3.0) 1 (1.7) 3 (2.4) Forehead 12 (18.2) 10 (16.9) 22 (17.6) Lip 2 (3.0) 0 (0.0) 2 (1.6) Nose/Nasolabial 13 (19.7) 3 (5.1) 16 (12.8) Scalp 8 (12.1) 32 (54.2) 40 (32.0) Temple 15 (22.7) 8 (13.6) 23 (18.4) Wound area Median (IQR) 399.5 (249.0–528.2) 699.0 (430.2–1,092.2) 453.0 (307.5–813.8) <0.001 Wound depth Median (IQR) 5.0 (4.0 to 7.0) 5.0 (4.0 to 7.0) 5.0 (4.0 to 7.0) 0.235 ASA 1 5 (7.6) 8 (13.6) 13 (10.4) 0.162 2 23 (34.8) 12 (20.3) 35 (28.0) 3 37 (56.1) 37 (62.7) 74 (59.2) Missing 1 (1.5) 2 (3.4) 3 (2.4) Dressing 0 9 (13.6) 0 (0.0) 9 (7.2) 0.009 1 57 (86.4) 59 (100.0) 116 (92.8) Abx prophylaxis 0 51 (77.3) 45 (76.3) 96 (76.8) 1 1 15 (22.7) 13 (22.0) 28 (22.4) Missing 0 (0.0) 1 (1.7) 1 (0.8) Suture type Nonresorbable 20 (30.3) 9 (15.3) 29 (23.2) 0.075 Resorbable 46 (69.7) 50 (84.7) 96 (76.8) Follow-up (months) Median (IQR) 3.5 (1.0–8.0) 5.0 (3.0–6.0) 5.0 (2.0–7.0) 0.191 Overall, 54 of 125 patients (43.2%) experienced a complication [ Figure 2 P Figure 2 Overview of complications by the closure method (flap vs. Integra) A total of eight reoperations (6.4%) was recorded. This included three patients within the Integra group (5.1%), who underwent ptosis correction, resuturing of dehiscence or closure with local flap. The last case represents a scalp wound that had not fully healed at three months in an individual requiring urgent postoperative radiotherapy. A total of five patients required reoperation in the flap group (7.6%), which included two brow lifts, one scar revision, one alar reconstruction, and one hematoma evacuation. Loss of the Integra graft occurred on average at week 4 (3.76), with 82% (23/28) already granulating at the time of loss. At the 6 month time point, 53 out of 59 (90%) of the wounds reconstructed with Integra and 66 out of 66 (100%) of the wounds reconstructed with a local flap were fully healed. Cosmetic outcomes of defects reconstructed with Integra were excellent, permitting the use of Integra not only for the reconstruction of large wounds lacking vascularised beds, but also for defects in cosmetically sensitive areas, reducing the risk of facial distortion or nerve injury, as shown in Figure 3 Figure 4 Figure 3 (a–d) Scalp vertex defect reconstructed with Integra at postoperative week 1 (a), 2 (b), 4 (c), and 8 (d); (e–g) Right supra-orbital defect preoperatively (e), at week 4 (f), and week 8 (g) postreconstruction with Integra Figure 4 (a–c) Right temporal defect at resection (a), week 1 (b), and 4 (c) postreconstruction with a local advancement flap; (d–e) scalp vertex defect at resection (d) and week 1 (e) post reconstruction with a local rotation flap The 11 of 59 defects (18.6%) reconstructed with Integra that demonstrated signs of infection were managed with a seven-day course of a penicillin-based antibiotic in line with the British National Formulary. Gram-positive organisms were isolated in most cases. Only one patient did not respond to the empirical treatment. Pseudomonas was grown in their MC and S, which responded to a seven-day course of ciprofloxacin. All infections resolved with conservative treatment with antibiotics. Multivariable logistic regression was used to determine the independent contribution of the closure method (flap vs. Integra) on the odds of postoperative complications, while accounting for potential confounders [ Table 2 P Table 2 P Table 2 Multivariable logistic regression for factors related to postprocedure complications. Likelihood ratio χ 2 P P Variable Level Complication OR (univariable) OR (multivariable) 0 1 Age Mean (SD) 79.6 (10.4) 76.0 (16.8) 0.98 (0.95–1.01, P 0.97 (0.93–1.01, P Gender F 19 (48.7) 20 (51.3) – – M 52 (60.5) 34 (39.5) 0.62 (0.29–1.33, P 0.49 (0.20–1.15, P Indication Cancer 61 (55.5) 49 (44.5) – – Noncancer 10 (66.7) 5 (33.3) 0.62 (0.18–1.87, P 0.29 (0.06–1.09, P Site Nonscalp 52 (61.2) 33 (38.8) – – Scalp 19 (47.5) 21 (52.5) 1.74 (0.82–3.75, P – Wound area Mean (SD) 566.0 (526.4) 735.0 (518.0) 1.00 (1.00–1.00, P – Wound depth Mean (SD) 5.7 (3.0) 6.2 (3.3) 1.06 (0.94–1.20, P – ASA 1 4 (30.8) 9 (69.2) – – 2 24 (68.6) 11 (31.4) 0.20 (0.05–0.77, P 0.20 (0.04–1.04, P 3 41 (55.4) 33 (44.6) 0.36 (0.09–1.20, P 0.44 (0.08–2.22, P Antibiotic prophylaxis 0 55 (57.3) 41 (42.7) – – 1 16 (57.1) 12 (42.9) 1.01 (0.42–2.35, P – Suture type Nonresorbable 19 (65.5) 10 (34.5) – – Resorbable 52 (54.2) 44 (45.8) 1.61 (0.69–3.94, P – Category Flap 46 (69.7) 20 (30.3) – – Integra 25 (42.4) 34 (57.6) 3.13 (1.51–6.63, P 3.54 (1.59–8.25, P Within the Integra group, antibiotic prophylaxis was significantly associated with lower rates of infection, graft failure and overall complications ( P P DISCUSSION The present study found reconstruction with Integra to be significantly associated with increased odds of complications compared to local flap reconstruction. The study population was broadly similar in terms of baseline characteristics between the two groups, but it is important to note that the patient age and defect size were significantly higher in the Integra group. To overcome this limitation of the retrospective study design and account for possible confounding variables in the data analysis, multivariable logistic regression was employed. The odds of complications remained significantly increased in the Integra group on multivariable analysis. Additionally, defect size was not independently associated with the rate of complications, a finding also reflected in literature.[ 5 7 The overall complication rate in the Integra group was 57.6%. Existing literature reviews on the outcomes of Integra for the reconstruction of full-thickness scalp defects have showed complication rates ranging between 11% and 40%.[ 6 7 8 13 8 13 The commonest complication was graft failure, reported exclusively in the Integra group at a rate of 47.4%. The graft failure rates in the present study exceed those previously documented. Literature reviews on scalp defect reconstruction widely report Integra graft take rates >90% with only two studies showing take rates <70%.[ 6 7 8 13 14 15 The present study employed single-stage reconstruction, as it avoids a second procedure and spares a donor site, which is particularly desirable in medically complex patients. It has been previously successfully described for the coverage of small oncologic defects of the scalp in a case series; however, in combination with a pericranial flap and fenestration of the Integra graft.[ 16 17 11 A finding frequently reported in the context of Integra graft failure in this study was fluid underlying a free-floating graft. Lifting of the Integra graft secondary to wound exudation is a complication well described in literature. Fenestration of the graft to allow the egress of fluid and facilitate the graft attachment on an irregular wound bed has been extensively studied and found to be associated with >97% graft take rates.[ 6 7 18 4 Finally, a recognized culprit for Integra graft failure is infection. This study noted an infection rate of 19% in the Integra group, with infection present in 32% of cases of graft failure. Most literature reviews on reconstruction of oncologic scalp defects with Integra, report infection as the commonest complication with rates up to 32%, while the Integra product guideline cites infection as the commonest cause of graft failure.[ 4 6 7 8 14 19 It is important to note that the high rates of Integra graft failure did not directly translate to clinical failure, as 90% of the defects reconstructed with Integra were fully healed at six months. This may stem from the beneficial effect of the initial phase of Integra graft retention, with the underlying collagen layer promoting the granulation of the wound. Studies comparing the outcomes of wound healing by secondary intention versus Integra would be insightful in order to determine the benefit of graft retention in the initial phase. This study is not without its limitations. Importantly, the retrospective study design makes the study prone to selection bias. Indeed, patients with defects more likely to result in facial distortion were preferentially reconstructed with Integra, leading to the patients in the Integra group having on average larger defects and being older with likely poorer skin quality. To control for this and produce meaningful results, multivariable logistic regression was employed, which enables the comparison of different groups while accounting for confounding variables.[ 20 21 CONCLUSION Reconstruction of oncologic soft-tissue defects of the head with local tissue rearrangement is associated with fewer complications compared to the Integra regeneration template. The remit for the use of Integra lies in the coverage of extensive defects lacking vascularized beds in medically compromised patients or defects in cosmetically sensitive areas at high risk of distortion or nerve injury. This population would not be suitable for free tissue transfer, while the cosmetic considerations would also preclude the use of local flaps. Surgical factors, like the use of a two-stage technique with epidermal grafting, fenestration, or the use of the premeshed template and the routine administration of antibiotic prophylaxis, are likely to improve Integra graft take rates and reduce the overall rate of complications. Prospective, randomized control trials investigating the clinical outcomes of the different surgical approaches to reconstruction with Integra are needed to aid the development of a standardized approach. Conflicts of interest There are no conflicts of interest. REFERENCES 1. World Health Organisation WHO Newsroom 2017 Radiation: Ultraviolet (UV) Radiation and skin cancer 2. Fijałkowska M Koziej M Antoszewski B Detailed head localization and incidence of skin cancers Sci Rep 2021 11 12391 34117314 10.1038/s41598-021-91942-5 PMC8196200 3. Komorowska-Timek E Gabriel A Bennett DC Miles D Garberoglio C Cheng C Artificial dermis as an alternative for coverage of complex scalp defects following excision of malignant tumors Plast Reconstr Surg 2005 115 1010 7 15793438 10.1097/01.prs.0000154210.60284.c6 4. Integra® Dermal Regeneration Template and Integra ® Meshed Dermal Regeneration Template Treatment Guidelines Available From: chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://products.integralife.com/file/general/1453796564.pdf 5. Magnoni C De Santis G Fraccalvieri M Bellini P Portincasa A Giacomelli L Integra in scalp reconstruction after tumor excision: Recommendations from a multidisciplinary advisory board J Craniofac Surg 2019 30 2416 20 31274819 10.1097/SCS.0000000000005717 6. Watts V Attie MD McClure S Reconstruction of complex full-thickness scalp defects after dog-bite injuries using dermal regeneration template (Integra): Case report and literature review J Oral and Maxillofac Surg 2019 77 338 51 30267703 10.1016/j.joms.2018.08.022 7. Johnson MB Wong AK Integra-based reconstruction of large scalp wounds: A case report and systematic review of the literature Plast Reconstr Surg Glob Open 2016 4 e1074 27826471 10.1097/GOX.0000000000001074 PMC5096526 8. Agochukwu NB Wong L Liau JY Dermal regenerative template as a cost-effective alternative for complex scalp reconstruction J Craniofac Surg 2018 29 e73 7 29068966 10.1097/SCS.0000000000004068 9. Koenen W Felcht M Vockenroth K Sassmann G Goerdt S Faulhaber J One-stage reconstruction of deep facial defects with a single layer dermal regeneration template J Eur Acad Dermatol Venereol 2011 25 788 93 21039916 10.1111/j.1468-3083.2010.03863.x 10. Burd A Wong PSY One-Stage Integra reconstruction in head and neck defects J Plast Reconstr Aesthet Surg 2010 63 404 9 19254877 10.1016/j.bjps.2008.11.105 11. Seth AK Ratanshi I Dayan JH Disa JJ Mehrara BJ Nasal reconstruction using the integra dermal regeneration template Plast Reconstr Surg 2019 144 966 70 31568313 10.1097/PRS.0000000000006072 PMC7402598 12. Moratin K Koch PS Benecke J Orouji A Bauer C Faulhaber J Reconstruction of nasal defects with dermal skin substitutes—A retrospective study of 36 defects J Cutan Med Surg 2019 23 413 20 31179746 10.1177/1203475419852060 13. Romano G Bouaoud J Moya-Plana A Benmoussa N Honart JF Leymarie N Integra® dermal regeneration template for full thickness carcinologic scalp defects: Our 6 years’ experience retrospective cohort and literature review J Stomatol Oral Maxillofac Surg 2021 122 256 62 32629168 10.1016/j.jormas.2020.06.016 14. Chalmers RL Smock E Geh JLC Experience of Integra® in cancer reconstructive surgery J Plast Reconstr Aesthet Surg 2010 63 2081 90 20335086 10.1016/j.bjps.2010.02.025 15. Elledge R Lloyd-Rogers J Barnard NA Integra® dermal regeneration template in the reconstruction of complex scalp defects: Initial experiences at Worcestershire Royal Hospital Br J Oral Maxillofac Surg 2014 52 e105 16. De Angelis B Gentile P Tati E Bottini DJ Bocchini I Orlandi F One-stage reconstruction of scalp after full-thickness oncologic defects using a dermal regeneration template (Integra) Biomed Res Int 2015 2015 698385 26649312 10.1155/2015/698385 PMC4663323 17. Locurcio LL Breen M Haq J Can a single-stage approach using a dermal regeneration template lead to satisfactory scalp defect reconstruction after skin cancer excision? J Oral Maxillofac Surg 2023 83 341 6 10.1016/j.joms.2023.11.016 38072011 18. Klein MB Engrav LH Holmes JH Friedrich JB Costa BA Honari S Management of facial burns with a collagen/glycosaminoglycan skin substitute-Prospective experience with 12 consecutive patients with large, deep facial burns Burns 2005 31 257 61 15774278 10.1016/j.burns.2004.11.013 19. Lembo F Parisi D Annacontini L Maiorella A Campanale A Portincasa A Head reconstruction: 5 years experience with the Integra® dermal regeneration template Eur J Surg Oncol (EJSO) 2012 38 1006 7 20. Grant SW Hickey GL Head SJ Statistical primer: Multivariable regression considerations and pitfalls Eur J Cardiothorac Surg 2019 55 179 85 30596979 10.1093/ejcts/ezy403 21. Mantelakis A McKean AR Biju NE Shet AS Geh JLC Evolutions in the use of Integra® and MatriDerm® in excision and reconstruction of cutaneous malignancies J Plast Reconstr Aesthet Surg 2024 93 24 7 38608534 10.1016/j.bjps.2024.03.011 ",
  "metadata": {
    "Title of this paper": "Evolutions in the use of Integra® and MatriDerm® in excision and reconstruction of cutaneous malignancies",
    "Journal it was published in:": "National Journal of Maxillofacial Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468789/"
  }
}