{
  "title": "Paper_439",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12480749 PMC12480749.1 12480749 12480749 41023272 10.1038/s41598-025-18806-0 18806 1 Article Association of diabetic ketoacidosis and retinopathy in patients with type 2 diabetes: a nationwide cohort study Chen Yung-Kang 1 2 Lai Chien-Hsiung 1 2 Wang Nan-Kai 3 4 Wu Wei-Chi 5 Lin Chia-Hung 6 Lee Chuan-Pin 7 Chou Yu-Hsiang chouyuhsiang@yahoo.com.tw 8 Yang Yao-Hsu r95841012@ntu.edu.tw 6 9 1 https://ror.org/04gy6pv35 grid.454212.4 0000 0004 1756 1410 Department of Ophthalmology, Chiayi Chang Gung Memorial Hospital, 2 https://ror.org/00d80zx46 grid.145695.a 0000 0004 1798 0922 Department of Ophthalmology, College of Medicine, Chang Gung University, 3 https://ror.org/01esghr10 grid.239585.0 0000 0001 2285 2675 Department of Ophthalmology, Edward S. Harkness Eye Institute, Columbia University Irving Medical Center, 4 https://ror.org/00hj8s172 grid.21729.3f 0000 0004 1936 8729 Vagelos College of Physicians and Surgeons, Columbia University, 5 https://ror.org/02dnn6q67 grid.454211.7 0000 0004 1756 999X Department of Ophthalmology, Linkou Chang Gung Memorial Hospital, 6 https://ror.org/02dnn6q67 grid.454211.7 0000 0004 1756 999X Division of Endocrinology and Metabolism, Department of Internal Medicine, Linkou Chang Gung Memorial Hospital, 7 https://ror.org/04gy6pv35 grid.454212.4 0000 0004 1756 1410 Health Information and Epidemiology Laboratory, Chiayi Chang Gung Memorial Hospital, 8 https://ror.org/03nteze27 grid.412094.a 0000 0004 0572 7815 Renal Division, Department of Internal Medicine, College of Medicine, National Taiwan University Hospital, National Taiwan University, 9 https://ror.org/04gy6pv35 grid.454212.4 0000 0004 1756 1410 Department of Traditional Chinese Medicine, Chiayi Chang Gung Memorial Hospital, 29 9 2025 2025 15 478255 33594 18 1 2025 3 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Diabetic ketoacidosis (DKA) is the most common acute complication in people with diabetes. We aimed to assess the association of DKA with the risk of diabetic retinopathy (DR) and related ophthalmic interventions in individuals with type 2 diabetes (T2D). To ensure similar T2D management and severity at baseline between groups, we enrolled 1,007 T2D patients with and without DKA matched by anti-diabetic combination within the initial 3 months of diabetes diagnosis, gender, birth and diabetes diagnosis year in Taiwan National Health Insurance Research Database from 2000 to 2019. We employed Fine and Gray competing risk model to assess the risk of non-proliferative DR (NPDR), proliferative DR (PDR) and panretinal photocoagulation (PRP). Our results showed that patients with DKA had an increased risk of DR (adjusted subdistribution hazard ratio [SHR] 1.64 [95% CI, 1.34–2.01]) and PRP (SHR 1.43 [1.11–1.86]). The risk of NPDR is elevated when diabetes-to-DKA duration exceeded 24 months (SHR 2.15 [1.52–3.05]), while 1–24 months duration increased PDR risk (SHR 3.72 [1.76–7.88]). Patients with DKA onset at ages 46–55 and 56–65 showed specific PDR (SHR 1.82 [0.99–3.33]) and NPDR susceptibilities (SHR 6.52 [2.30–18.49]), respectively. Our study showed that DKA was associated with a higher risk of developing DR and requiring related ophthalmic interventions compared to a matched cohort with similar T2D baseline characteristics. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-18806-0. Keywords Diabetic retinopathy Diabetic ketoacidosis Panretinal photocoagulation Intravitreal injection Subject terms Epidemiology Diabetes Eye diseases pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Diabetic retinopathy (DR) is the leading cause of preventable visual loss in adults aged 20–74 years and the seventh most common cause of blindness globally 1 2 1 3 4 Unlike pure hyperglycemia, metabolic derangements in diabetic ketoacidosis (DKA) results from combined effects of elevated counterregulatory hormones (glucagon, epinephrine) and insulin deficiency 5 6 7 8 9 10 11 12 To our knowledge, this is the first study to investigate the influence of DKA on the development of DR in individuals with T2D, which accounts for over 99% of the diabetic population and 30–32% of DKA 13 15 . Methods Data source We conducted a retrospective cohort study using data from the National Health Insurance Research Database (NHIRD), a comprehensive longitudinal dataset that covers over 99% of the Taiwanese population through mandatory enrollment 16 International Classification of Diseases Ninth Revision and Tenth Revision Clinical Modification 17 Study design We identified newly-diagnosed T2D patients who had ≥ 1 hospitalization or ≥ 3 outpatient visits for T2D within a year (ICD-9-CM codes: 250 excluding 250.x1 or 250.x3; ICD-10-CM codes: E11) (Fig. 1 18 19 20 21  Fig. 1 The selection flow chart. LGTD: Longitudinal Generation Tracking Database. T2D: type 2 diabetes. T1D: type 1 diabetes. DKA: diabetic ketoacidosis. DME: diabetic macular edema. VH: vitreous hemorrhage. RD: retinal detachment. PDR: proliferative diabetic retinopathy. NPDR: nonproliferative diabetic retinopathy. IVI: intravitreal injection. PRP: panretinal photocoagulation. PPV: pars plana vitrectomy. Outcomes Our study aimed to evaluate DR and diabetes-related ocular complications (diabetic macular edema [DME] and retinal detachment [RD]) between DKA and non-DKA groups, which were recorded on ≥ 3 outpatient visits or ≥ 1 inpatient diagnosis (see Supplementary Table 1 for coding numbers). To better recognize the effect of DKA on different stages of DR, we classified DR into non-proliferative diabetic retinopathy (NPDR) and proliferative diabetic retinopathy (PDR), as the progression of NPDR to PDR was the main cause of visual decline and ophthalmologic complications (see Supplementary Table 1 for coding numbers). In cases where an individual received both PDR and NPDR diagnoses, we defined DR based on the first incidence to occur. Ophthalmologic procedures and surgical intervention that are performed to prevent advanced DR or at visual-threatening stage were also analyzed, including panretinal photocoagulation (PRP), pars plana vitrectomy (PPV) and intravitreal injection (IVI) (see Supplementary Table 3 for payment codes for surgery). Statistical analysis The study individuals were followed from T2D diagnosis until study outcomes, death or the end of 2019. Comorbidities that could affect DR progression were identified, including hypertension, coronary artery disease, chronic kidney disease (CKD), dialysis, chronic obstructive pulmonary disease (COPD), smoking, obesity, liver cirrhosis, autoimmune diseases (e.g. polymyositis, dermatomyositis, systemic lupus erythematosus, Sjogren’s disease, rheumatoid arthritis) (see Supplementary Table 1 for coding numbers) 22 23 17 24 25 26 P Results Demographics A total of 288,542 patients with the diagnosis of T2D were enrolled for this study. Among those eligible patients, 1,815 were in the DKA group and 133,382 were in the non-DKA group. After one-to-one ratio matching, 1,007 patients enrollees in each group were analyzed (Table 1 27  Table 1 Baseline characteristics of individuals enrolled in the study. Characteristics DM without DKA (Non-DKA) n DM with DKA n P T2D-to-DKA duration (month) n 0 0 (0.0) 302 (30.0) 1–24 0 (0.0) 184 (18.3) > 24 0 (0.0) 521 (51.7) Age at the diagnosis of DM 52 (13.4) 52 (13.4) 1.000 Age at index date (year) 56 (14.4) 56 (14.4) 0.996 18–45, n 259 (25.7) 255 (25.3) 46–55, n 278 (27.6) 282 (28.0) 56–65, n 204 (20.3) 205 (20.4) > 65, n 266 (26.4) 265 (26.3) Duration from the diagnosis of DM to index date (month) 47.7 (52.3) 47.7 (52.7) 0.228 Gender n 1.000 Female 421 (41.8) 421 (41.8) Male 586 (58.2) 586 (58.2) Urbanization n 0.135 Very high 247 (24.5) 242 (24.0) High 493 (49.0) 466 (46.3) Moderate 160 (15.9) 200 (19.9) Low 107 (10.6) 99 (9.8) Income level (NTD) n < 0.001 < 15,840 219 (21.7) 330 (32.8) 15,841–25,000 467 (46.4) 438 (43.5) > 25,000 321 (31.9) 239 (23.7) Comorbidities at baseline (before index date) n HTN 537 (53.3) 514 (51.0) 0.305 CAD 271 (26.9) 270 (26.8) 0.960 CKD 159 (15.8) 206 (20.5) 0.007 Dialysis 34 (3.4) 41 (4.1) 0.410 COPD and/or smoking 158 (15.7) 225 (22.3) < 0.001 Obesity 20 (2.0) 9 (0.9) 0.040 Liver cirrhosis 236 (23.4) 243 (24.1) 0.714 Autoimmune diseases: SLE, RA, SS, Dmtis, PM 38 (3.8) 23 (2.3) 0.051 Glucose-lowering drugs within 3 months after DM diagnosis n Metformin 634 (63.0) 634 (63.0) 1.000 Sulfonylureas 703 (69.8) 703 (69.8) 1.000 Insulin 90 (8.9) 90 (8.9) 1.000 DPP4-inhibitors 36 (3.6) 36 (3.6) 1.000 Glinides 16 (1.6) 16 (1.6) 1.000 α-glucosidase inhibitors 16 (1.6) 16 (1.6) 1.000 Thiazolidinediones (Glitazone) 9 (0.9) 9 (0.9) 1.000 Multiple oral antidiabetic therapies 589 (58.5) 629 (62.5) 0.068 Metformin monotherapy use 85 (8.4) 72 (7.1) 0.319 Other medication (≥ 90 days within 1 year before index date) n Antiplatelets, anticoagulation 216 (21.4) 142 (14.1) < 0.001 Statin 199 (19.8) 91 (9.0) < 0.001 DM: diabetes mellitus. DKA: diabetic ketoacidosis. T2D-to-DKA duration: duration from the diagnosis of type 2 diabetes to DKA. DME: diabetic macular edema. VH: vitreous hemorrhage. RD: retinal detachment. PDR: proliferative diabetic retinopathy. NPDR: nonproliferative diabetic retinopathy. HTN: hypertension. CAD: coronary artery disease. CKD: chronic kidney disease. COPD: chronic obstructive pulmonary disease. SLE: systemic lupus erythematosus. RA: rheumatoid arthritis. SS: Sjögren syndrome. Dmtis: dermatomyositis. PM: polymyositis. NTD: New Taiwan Dollar. Association between DKA and risks of DR and PRP The 2,014 patients had a total of 130 (12.9%) and 182 (18.1%) encounters of DR in non-DKA group and DKA group respectively (Table 2 P 2 P P P P P P P P P P  Table 2 Hazard of DR and associated complication and procedures in comparison to patients without DKA. Outcomes DM without DKA (Non-DKA) n DM with DKA n Crude model Adjusted model * n (%) n (%) SHR (95% CI)  P SHR (95% CI)  P DR 130 (12.9) 182 (18.1) 1.71 (1.43–2.05) < 0.001 1.64(1.34–2.01) <0.001 PDR 73 (7.2) 94 (9.3) 1.35 (1.07–1.69) 0.010 1.33 (1.04–1.71) 0.026 NPDR 86 (8.5) 122 (12.1) 1.62 (1.31–2.01) < 0.001 1.51 (1.20–1.91) <0.001 DME 36 (3.6) 42 (4.2) 1.18 (0.85–1.63) 0.326 1.27 (0.87–1.87) 0.214 RD 17 (1.7) 20 (2.0) 1.25 (0.78–2.00) 0.350 0.67 (0.26–1.74) 0.414 PRP 80 (7.9) 112 (11.1) 1.52 (1.22–1.89) < 0.001 1.43 (1.11–1.86) 0.007 PPV 36 (3.6) 30 (3.0) 0.80 (0.56–1.14) 0.216 0.64 (0.42–0.97) 0.037 IVI 24 (2.4) 37 (3.7) 1.64 (1.11–2.41) 0.012 1.74 (1.08–2.81) 0.024 *  Fig. 2 Cumulative incidence of ( A B C D P < Association between T2D-to-DKA duration and risks of PDR and NPDR The median T2D-to-DKA duration was 28.3 months (IQR 0–79.2). Thus, we classified patients into three groups: 0 months, 1–24 months, and > 24 months (Table 3 P P P P P P P  Table 3 Hazard ratios of outcomes with stratified analysis based on T2D-to-DKA duration and onset (or pseudo-onset) age of DKA. Outcomes Crude model Adjusted model * SHR (95% CI) P SHR (95% CI) P  DR  Stratified by DKA age (year) 18–45 1.96 (1.37–2.80) < 0.001 1.72 (1.15–2.57) 0.009 46–55 1.69 (1.25–2.29) < 0.001 1.55 (1.06–2.26) 0.023 56–65 1.64 (1.14–2.36) 0.007 1.56 (0.97–2.51) 0.067 > 65 1.43 (0.87–2.33) 0.154 2.37 (1.02–5.47) 0.044  Stratified by T2D-to-DKA duration (month) 0 1.37 (0.96–1.95) 0.082 1.12 (0.76–1.67) 0.564 1–24 2.05 (1.37–3.06) < 0.001 1.84 (1.00–3.37) 0.049 > 24 1.75 (1.37–2.25) < 0.001 1.70 (1.26–2.29) 0.001  PDR  Stratified by DKA age (year) 18–45 1.16 (0.79–1.70) 0.443 0.93 (0.59–1.47) 0.758 46–55 1.58 (1.04–2.39) 0.032 1.82 (0.99–3.33) 0.054 56–65 1.37 (0.87–2.18) 0.176 1.01 (0.56–1.81) 0.984 > 65 1.33 (0.63–2.84) 0.456 3.83 (0.81–18.06) 0.090  Stratified by T2D-to-DKA duration (month) 0 1.41 (0.90–2.20) 0.129 1.26 (0.74–2.15) 0.401 1–24 2.50 (1.42–4.39) 0.001 3.72 (1.76–7.88) 0.001 > 24 1.03 (0.75–1.40) 0.874 0.86 (0.57–1.31) 0.479  NPDR  Stratified by DKA age (year) 18–45 1.82 (1.18–2.82) 0.007 1.50 (0.90–2.51) 0.123 46–55 1.43 (1.03–2.00) 0.035 1.20 (0.81–1.78) 0.366 56–65 1.87 (1.17–2.97) 0.008 6.52 (2.30–18.49) < 0.001 > 65 1.50 (0.84–2.67) 0.168 3.16 (0.79–12.60) 0.103  Stratified by T2D-to-DKA duration (month) 0 1.00 (0.65–1.55) 1.000 0.74 (0.44–1.22) 0.236 1–24 1.28 (0.82–1.98) 0.274 0.56 (0.25–1.25) 0.158 > 24 2.18 (1.60–2.96) < 0.001 2.15 (1.52–3.05) < 0.001  PRP  Stratified by DKA age (year) 18–45 1.11 (0.77–1.61) 0.575 0.87 (0.54–1.39) 0.552 46–55 1.46 (1.02–2.09) 0.038 1.15 (0.74–1.81) 0.534 56–65 2.33 (1.39–3.91) 0.001 2.52 (1.11–5.75) 0.028 > 65 2.25 (0.92–5.49) 0.075 1.74 (0.35–8.80) 0.501  Stratified by T2D-to-DKA duration (month) 0 1.36 (0.92–2.02) 0.122 1.20 (0.74–1.93) 0.468 1–24 1.77 (1.07–2.91) 0.025 1.61 (0.95–2.73) 0.077 > 24 1.53 (1.12–2.09) 0.008 1.35 (0.89–2.03) 0.153 * Association between DKA onset age and risks of PDR and NPDR Furthermore, we grouped the patients by age at DKA diagnosis: 18–45, 46–55, 56–65, and > 65 years, based on their median age of 54 years (IQR 45–66) (Table 3 P P P Subgroup analysis of DKA patients In our subgroup analyses focused on DKA patients only, we used 0 months of T2D-to-DKA duration and an age range of 18–45 years at DKA diagnosis as reference groups (Table 4 P P P P P P  Table 4 The within group analysis of patients with DKA stratified by onset (or pseudo-onset) age of DKA and T2D-to-DKA duration. Outcomes Crude model Adjusted model * SHR (95% CI) P SHR (95% CI) P  DR  Stratified by DKA age (year) 18–45 1.00 (REF) 1.00 (REF) 46–55 1.44 (1.01–2.04) 0.044 1.43 (1.00–2.04) 0.049 56–65 1.29 (0.86–1.93) 0.217 1.27 (0.84–1.92) 0.258 > 65 0.39 (0.23–0.66) < 0.001 0.38 (0.21–0.67) 0.001  Stratified by T2D-to-DKA duration (month) 0 1.00 (REF) 1.00 (REF) 1–24 1.90 (1.24–2.92) 0.003 1.91 (1.25–2.94) 0.003 > 24 1.71 (1.19–2.45) 0.004 1.89 (1.30–2.74) 0.001  PDR  Stratified by DKA age (year) 18–45 1.00 (REF) 1.00 (REF) 46–55 1.23 (0.75–1.99) 0.409 1.23 (0.75–2.00) 0.407 56–65 1.17 (0.68–2.02) 0.571 1.14 (0.65–1.98) 0.651 > 65 0.28 (0.13–0.61) 0.001 0.31 (0.13–0.71) 0.006  Stratified by T2D-to-DKA duration (month) 0 1.00 (REF) 1.00 (REF) 1–24 1.88 (1.09–3.26) 0.023 1.99 (1.15–3.44) 0.013 > 24 1.17 (0.72–1.93) 0.525 1.32 (0.79–2.20) 0.286  NPDR  Stratified by DKA age (year) 18–45 1.00 (REF) 1.00 (REF) 46–55 1.43 (0.92–2.22) 0.112 1.44 (0.93–2.25) 0.105 56–65 1.31 (0.80–2.16) 0.281 1.32 (0.79–2.21) 0.291 > 65 0.46 (0.25–0.85) 0.013 0.46 (0.23–0.91) 0.027  Stratified by T2D-to-DKA duration (month) 0 1.00 (REF) 1.00 (REF) 1–24 1.77 (1.00–3.13) 0.050 1.77 (1.00–3.15) 0.050 > 24 2.27 (1.43–3.59) < 0.001 2.59 (1.62–4.14) < 0.001  PRP  Stratified by DKA age (year) 18–45 1.00 (REF) 1.00 (REF) 46–55 1.30 (0.83–2.02) 0.256 1.28 (0.81–2.01) 0.292 56–65 1.32 (0.80–2.16) 0.279 1.29 (0.77–2.16) 0.326 > 65 0.27 (0.13–0.57) 0.001 0.28 (0.13–0.62) 0.002  Stratified by T2D-to-DKA duration (month) 0 1.00 (REF) 1.00 (REF) 1–24 1.33 (0.79–2.24) 0.285 1.39 (0.82–2.35) 0.215 > 24 1.19 (0.77–1.84) 0.432 1.35 (0.86–2.12) 0.190 * Adjusted for income level, CKD, COPD, smoking, obesity, use of antiplatelets/anticoagulation and use of statin. T2D: type 2 diabetes. DKA: diabetic ketoacidosis. DR: diabetic retinopathy. PDR: proliferative diabetic retinopathy. NPDR: nonproliferative diabetic retinopathy. PRP: panretional photocoagulation. SHR: subdistribution hazard ratio. CI: confidence interval. Discussion We showed that DKA patients acquired higher risk of DR and related surgeries than controls matched with similar anti-diabetic medication, gender and birth and diabetes onset year. We also found that the risks of PDR and NPDR varied by the duration from T2D to DKA and by age at DKA diagnosis. Our study demonstrated that DKA as an important predictor of DR risk and identifies specific risk profiles is associated with DKA among similar T2D baseline characteristics. Halting the progression from NPDR to PDR is crucial, as nearly half can result in severe vision loss without intervention. Both CLARITY and DRCR Retina Network studies have demonstrated efficacy of IVI with anti-vascular endothelial growth factor (VEGF) drugs in treating PDR, but their demanding schedules and adherence requirements pose substantial challenges to patients and make PRP indispensable 28 29 30 31 32 33 P 34 35 36 The increased risk of DR associated with DKA may be attributed to several mechanisms related to hyperglycemic crisis, ketonemia and acidosis. First, the high osmotic pressure during a DKA episode can disrupt the BBB, potentially damaging the integrity of the BRB 37 38 39 12 40 41 42 Current ADA guidelines call for a dilated retinal exam at T2D diagnosis and at least annual follow‑up, with interval adjustments based on DR severity and glycemic control 43 44 2 This study has some limitations. First, biochemical lab data (e.g., HbA1C, C-peptide, islet autoantibodies) were unavailable in the NHIRD, limiting our ability to assess glycemic control and accurately classify diabetes type. For example, cases of latent autoimmune diabetes in adults or monogenic diabetes may be misclassified as T2D in the absence of autoantibody or C-peptide testing 45 46 47 48 49 50 51 52 Conclusions Our study revealed that DKA is associated with an increased risk of DR and a higher likelihood of receiving intervention in T2D patients with similar diabetic medication, year of birth, year of diabetes diagnosis, and gender, rather than the general T2D population. We also observed a shorter duration for DKA patients to develop DR and undergo surgical intervention following the onset of T2D. Furthermore, we elucidated that younger age at DKA onset or a shorter T2D-to-DKA duration is associated with a higher risk of developing PDR, a more severe form of the disease. Building on ADA guidelines, we propose incorporating DKA history into DR screening protocols by performing an initial retinal exam at the time of DKA diagnosis, with follow‑up thereafter more frequent than standard ADA recommendations to address the accelerated retinopathy risk in this population. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors thank the participating physicians, Health Information and Epidemiology Laboratory, and the patients involved in this study. Author contributions Research idea, study design, data interpretation, first draft of the manuscript: YKC; data acquisition and statistical analysis: CPL; discussion of the work; CHL, NKW, WCW and CHL; review and revision of the manuscript: YHC and YHY. Funding This study has been supported by grants from Chang Gung Memorial Hospital (CFRPG6M0021), Chiayi, Taiwan. Data availability Data are available from the corresponding author upon formal request. Declarations Conflict of interest The authors have declared that no potential conflict of interest relevant to this article exists. References 1. Cheung N Mitchell P Wong TY Diabetic retinopathy Lancet 2010 376 124 136 10.1016/S0140-6736(09)62124-3 20580421 Cheung, N., Mitchell, P. & Wong, T. Y. Diabetic retinopathy. Lancet 376 20580421 10.1016/S0140-6736(09)62124-3 2. Flaxman SR Global causes of blindness and distance vision impairment 1990–2020: a systematic review and meta-analysis Lancet Glob Health 2017 5 e1221 e1234 10.1016/S2214-109X(17)30393-5 29032195 Flaxman, S. R. et al. Global causes of blindness and distance vision impairment 1990–2020: a systematic review and meta-analysis. Lancet Glob Health 5 29032195 10.1016/S2214-109X(17)30393-5 3. Saeedi P Global and regional diabetes prevalence estimates for 2019 and projections for 2030 and 2045: results from the international diabetes federation diabetes atlas, 9(th) edition Diabetes Res. Clin. Pract. 2019 157 107843 10.1016/j.diabres.2019.107843 31518657 Saeedi, P. et al. Global and regional diabetes prevalence estimates for 2019 and projections for 2030 and 2045: results from the international diabetes federation diabetes atlas, 9(th) edition. Diabetes Res. Clin. Pract. 157 31518657 10.1016/j.diabres.2019.107843 4. Yau JW Global prevalence and major risk factors of diabetic retinopathy Diabetes Care 2012 35 556 564 10.2337/dc11-1909 22301125 PMC3322721 Yau, J. W. et al. Global prevalence and major risk factors of diabetic retinopathy. Diabetes Care 35 22301125 10.2337/dc11-1909 PMC3322721 5. Umpierrez GE Hyperglycemic crises in adults with diabetes: A consensus report Diabetes Care 2024 47 1257 1275 10.2337/dci24-0032 39052901 PMC11272983 Umpierrez, G. E. et al. Hyperglycemic crises in adults with diabetes: A consensus report. Diabetes Care 47 39052901 10.2337/dci24-0032 PMC11272983 6. Elendu C Comprehensive review of diabetic ketoacidosis: an update Ann. Med. Surg. (Lond) 2023 85 2802 2807 10.1097/MS9.0000000000000894 37363479 PMC10289692 Elendu, C. et al. Comprehensive review of diabetic ketoacidosis: an update. Ann. Med. Surg. (Lond) 85 37363479 10.1097/MS9.0000000000000894 PMC10289692 7. Chen YL Diabetic ketoacidosis further increases risk of alzheimer’s disease in patients with type 2 diabetes Diabetes Res. Clin. Pract. 2019 147 55 61 10.1016/j.diabres.2018.11.013 30481578 Chen, Y. L. et al. Diabetic ketoacidosis further increases risk of alzheimer’s disease in patients with type 2 diabetes. Diabetes Res. Clin. Pract. 147 30481578 10.1016/j.diabres.2018.11.013 8. Chen YL Long-term risk of stroke in type 2 diabetes patients with diabetic ketoacidosis: A population-based, propensity score-matched, longitudinal follow-up study Diabetes Metab. 2017 43 223 228 10.1016/j.diabet.2016.11.003 28129999 Chen, Y. L. et al. Long-term risk of stroke in type 2 diabetes patients with diabetic ketoacidosis: A population-based, propensity score-matched, longitudinal follow-up study. Diabetes Metab. 43 28129999 10.1016/j.diabet.2016.11.003 9. Mays JA An evaluation of recurrent diabetic ketoacidosis, fragmentation of care, and mortality across chicago, Illinois Diabetes Care 2016 39 1671 1676 10.2337/dc16-0668 27422579 Mays, J. A. et al. An evaluation of recurrent diabetic ketoacidosis, fragmentation of care, and mortality across chicago, Illinois. Diabetes Care 39 27422579 10.2337/dc16-0668 10. Gange WS Incidence of proliferative diabetic retinopathy and other neovascular sequelae at 5 years following diagnosis of type 2 diabetes Diabetes Care 2021 44 2518 2526 10.2337/dc21-0228 34475031 PMC8546279 Gange, W. S. et al. Incidence of proliferative diabetic retinopathy and other neovascular sequelae at 5 years following diagnosis of type 2 diabetes. Diabetes Care 44 34475031 10.2337/dc21-0228 PMC8546279 11. Ohman JL Jr The cerebrospinal fluid in diabetic ketoacidosis N Engl. J. Med. 1971 284 283 290 10.1056/NEJM197102112840601 4992715 Ohman, J. L. Jr. et al. The cerebrospinal fluid in diabetic ketoacidosis. N Engl. J. Med. 284 4992715 10.1056/NEJM197102112840601 12. Hoffman WH Stamatovic SM Andjelkovic AV Inflammatory mediators and blood brain barrier disruption in fatal brain edema of diabetic ketoacidosis Brain Res. 2009 1254 138 148 10.1016/j.brainres.2008.11.100 19103180 Hoffman, W. H., Stamatovic, S. M. & Andjelkovic, A. V. Inflammatory mediators and blood brain barrier disruption in fatal brain edema of diabetic ketoacidosis. Brain Res. 1254 19103180 10.1016/j.brainres.2008.11.100 13. Sheen YJ Trends in prevalence and incidence of diabetes mellitus from 2005 to 2014 in Taiwan J. Formos. Med. Assoc. 2019 118 Suppl 2 S66 S73 10.1016/j.jfma.2019.06.016 31300322 Sheen, Y. J. et al. Trends in prevalence and incidence of diabetes mellitus from 2005 to 2014 in Taiwan. J. Formos. Med. Assoc. 118 31300322 10.1016/j.jfma.2019.06.016 14. Ebrahimi F Kutz A Christ ER Szinnai G Lifetime risk and health-care burden of diabetic ketoacidosis: A population-based study Front. Endocrinol. (Lausanne) 2022 13 940990 10.3389/fendo.2022.940990 36093075 PMC9449722 Ebrahimi, F., Kutz, A., Christ, E. R. & Szinnai, G. Lifetime risk and health-care burden of diabetic ketoacidosis: A population-based study. Front. Endocrinol. (Lausanne) 13 36093075 10.3389/fendo.2022.940990 PMC9449722 15. Wang ZH Kihl-Selstam E Eriksson JW Ketoacidosis occurs in both type 1 and type 2 diabetes–a population-based study from Northern Sweden Diabet. Med. 2008 25 867 870 10.1111/j.1464-5491.2008.02461.x 18644074 Wang, Z. H., Kihl-Selstam, E. & Eriksson, J. W. Ketoacidosis occurs in both type 1 and type 2 diabetes–a population-based study from Northern Sweden. Diabet. Med. 25 18644074 10.1111/j.1464-5491.2008.02461.x 16. Hsieh CY Taiwan’s National health insurance research database: past and future Clin. Epidemiol. 2019 11 349 358 10.2147/CLEP.S196293 31118821 PMC6509937 Hsieh, C. Y. et al. Taiwan’s National health insurance research database: past and future. Clin. Epidemiol. 11 31118821 10.2147/CLEP.S196293 PMC6509937 17. Kang EY Association of Statin therapy with prevention of Vision-Threatening diabetic retinopathy JAMA Ophthalmol. 2019 137 363 371 10.1001/jamaophthalmol.2018.6399 30629109 PMC6459113 Kang, E. Y. et al. Association of Statin therapy with prevention of Vision-Threatening diabetic retinopathy. JAMA Ophthalmol. 137 30629109 10.1001/jamaophthalmol.2018.6399 PMC6459113 18. Chao CT The risk trajectory of different cardiovascular morbidities associated with chronic kidney disease among patients with newly diagnosed diabetes mellitus: a propensity score-matched cohort analysis Cardiovasc. Diabetol. 2021 20 86 10.1186/s12933-021-01279-6 33894776 PMC8070330 Chao, C. T. et al. The risk trajectory of different cardiovascular morbidities associated with chronic kidney disease among patients with newly diagnosed diabetes mellitus: a propensity score-matched cohort analysis. Cardiovasc. Diabetol. 20 33894776 10.1186/s12933-021-01279-6 PMC8070330 19. Chung YC Cost-effectiveness of diabetic retinopathy screening for newly diagnosed type 2 diabetic patients: A nationwide population-based propensity score-matched cohort study Asia Pac. J. Ophthalmol. (Phila) 2024 13 100071 10.1016/j.apjo.2024.100071 38768659 Chung, Y. C. et al. Cost-effectiveness of diabetic retinopathy screening for newly diagnosed type 2 diabetic patients: A nationwide population-based propensity score-matched cohort study. Asia Pac. J. Ophthalmol. (Phila) 13 38768659 10.1016/j.apjo.2024.100071 20. Sherwani SI Significance of HbA1c test in diagnosis and prognosis of diabetic patients Biomark. Insights 2016 11 95 104 10.4137/BMI.S38440 27398023 PMC4933534 Sherwani, S. I. et al. Significance of HbA1c test in diagnosis and prognosis of diabetic patients. Biomark. Insights 11 27398023 10.4137/BMI.S38440 PMC4933534 21. Hsu CN Continuity and completeness of electronic health record data for patients treated with oral hypoglycemic agents: findings from healthcare delivery systems in Taiwan Front. Pharmacol. 2022 13 845949 10.3389/fphar.2022.845949 35444533 PMC9015706 Hsu, C. N. et al. Continuity and completeness of electronic health record data for patients treated with oral hypoglycemic agents: findings from healthcare delivery systems in Taiwan. Front. Pharmacol. 13 35444533 10.3389/fphar.2022.845949 PMC9015706 22. Kim BY Prevalences of diabetic retinopathy and nephropathy are lower in Korean type 2 diabetic patients with non-alcoholic fatty liver disease J. Diabetes Investig 2014 5 170 175 10.1111/jdi.12139 24843757 PMC4023580 Kim, B. Y. et al. Prevalences of diabetic retinopathy and nephropathy are lower in Korean type 2 diabetic patients with non-alcoholic fatty liver disease. J. Diabetes Investig 5 24843757 10.1111/jdi.12139 PMC4023580 23. Wat N Wong RL Wong IY Associations between diabetic retinopathy and systemic risk factors Hong Kong Med. J. 2016 22 589 599 27779095 10.12809/hkmj164869 Wat, N., Wong, R. L. & Wong, I. Y. Associations between diabetic retinopathy and systemic risk factors. Hong Kong Med. J. 22 27779095 10.12809/hkmj164869 24. Kim KE Antithrombotic medication and the risk of vitreous hemorrhage in atrial fibrillation: Korean National health insurance service National cohort Yonsei Med. J. 2019 60 65 72 10.3349/ymj.2019.60.1.65 30554492 PMC6298896 Kim, K. E. et al. Antithrombotic medication and the risk of vitreous hemorrhage in atrial fibrillation: Korean National health insurance service National cohort. Yonsei Med. J. 60 30554492 10.3349/ymj.2019.60.1.65 PMC6298896 25. Huang JY Prediabetes is associated with increased risk of heart failure among patients with atrial fibrillation Diabetes Care 2023 46 190 196 10.2337/dc22-1188 36251385 Huang, J. Y. et al. Prediabetes is associated with increased risk of heart failure among patients with atrial fibrillation. Diabetes Care 46 36251385 10.2337/dc22-1188 26. Vatcheva, K. P., Lee, M., McCormick, J. B. & Rahbar, M. H. Multicollinearity in regression analyses conducted in epidemiologic studies. Epidemiol. (Sunnyvale) 6 10.4172/2161-1165.1000227 PMC4888898 27274911 27. Cheng YC Clinical outcomes of septic patients with diabetic ketoacidosis between 2004 and 2013 in a tertiary hospital in Taiwan J. Microbiol. Immunol. Infect. 2016 49 663 671 10.1016/j.jmii.2014.08.018 25442866 Cheng, Y. C. et al. Clinical outcomes of septic patients with diabetic ketoacidosis between 2004 and 2013 in a tertiary hospital in Taiwan. J. Microbiol. Immunol. Infect. 49 25442866 10.1016/j.jmii.2014.08.018 28. Jampol LM Glassman AR Sun J Evaluation and care of patients with diabetic retinopathy N Engl. J. Med. 2020 382 1629 1637 10.1056/NEJMra1909637 32320570 Jampol, L. M., Glassman, A. R. & Sun, J. Evaluation and care of patients with diabetic retinopathy. N Engl. J. Med. 382 32320570 10.1056/NEJMra1909637 29. Smiley D Chandra P Umpierrez GE Update on diagnosis, pathogenesis and management of ketosis-prone type 2 diabetes mellitus Diabetes Manag (Lond) 2011 1 589 600 10.2217/dmt.11.57 22611441 PMC3351851 Smiley, D., Chandra, P. & Umpierrez, G. E. Update on diagnosis, pathogenesis and management of ketosis-prone type 2 diabetes mellitus. Diabetes Manag (Lond) 1 22611441 10.2217/DMT.11.57 PMC3351851 30. Michaelis M Shochat T Shimon I Akirov A Features and long-term outcomes of patients hospitalized for diabetic ketoacidosis Diabetes Metab. Res. Rev. 2021 37 e3408 10.1002/dmrr.3408 32942337 Michaelis, M., Shochat, T., Shimon, I. & Akirov, A. Features and long-term outcomes of patients hospitalized for diabetic ketoacidosis. Diabetes Metab. Res. Rev. 37 32942337 10.1002/dmrr.3408 31. Sabanayagam C Incidence and progression of diabetic retinopathy: a systematic review Lancet Diabetes Endocrinol. 2019 7 140 149 10.1016/S2213-8587(18)30128-1 30005958 Sabanayagam, C. et al. Incidence and progression of diabetic retinopathy: a systematic review. Lancet Diabetes Endocrinol. 7 30005958 10.1016/S2213-8587(18)30128-1 32. Harris Nwanyanwu K Predicting development of proliferative diabetic retinopathy Diabetes Care 2013 36 1562 1568 10.2337/dc12-0790 23275374 PMC3661803 Harris Nwanyanwu, K. et al. Predicting development of proliferative diabetic retinopathy. Diabetes Care 36 23275374 10.2337/dc12-0790 PMC3661803 33. Wu XY Clinical profiles, outcomes and risk factors among type 2 diabetic inpatients with diabetic ketoacidosis and hyperglycemic hyperosmolar state: a hospital-based analysis over a 6-year period BMC Endocr. Disord 2020 20 182 10.1186/s12902-020-00659-5 33317485 PMC7734851 Wu, X. Y. et al. Clinical profiles, outcomes and risk factors among type 2 diabetic inpatients with diabetic ketoacidosis and hyperglycemic hyperosmolar state: a hospital-based analysis over a 6-year period. BMC Endocr. Disord 20 33317485 10.1186/s12902-020-00659-5 PMC7734851 34. Lachin JM Effect of glycemic exposure on the risk of microvascular complications in the diabetes control and complications trial–revisited Diabetes 2008 57 995 1001 10.2337/db07-1618 18223010 Lachin, J. M. et al. Effect of glycemic exposure on the risk of microvascular complications in the diabetes control and complications trial–revisited. Diabetes 57 18223010 10.2337/db07-1618 35. Vujosevic S Screening for diabetic retinopathy: new perspectives and challenges Lancet Diabetes Endocrinol. 2020 8 337 347 10.1016/S2213-8587(19)30411-5 32113513 Vujosevic, S. et al. Screening for diabetic retinopathy: new perspectives and challenges. Lancet Diabetes Endocrinol. 8 32113513 10.1016/S2213-8587(19)30411-5 36. Liu J Sodium-glucose co-transporter-2 inhibitors and the risk of diabetic ketoacidosis in patients with type 2 diabetes: A systematic review and meta-analysis of randomized controlled trials Diabetes Obes. Metab. 2020 22 1619 1627 10.1111/dom.14075 32364674 Liu, J. et al. Sodium-glucose co-transporter-2 inhibitors and the risk of diabetic ketoacidosis in patients with type 2 diabetes: A systematic review and meta-analysis of randomized controlled trials. Diabetes Obes. Metab. 22 32364674 10.1111/dom.14075 37. Burks, S. R. et al. Blood-brain barrier opening by intracarotid artery hyperosmolar mannitol induces sterile inflammatory and innate immune responses. Proc. Natl. Acad. Sci. U S A 118 10.1073/pnas.2021915118 PMC8106347 33906946 38. Hoorn EJ Preventing a drop in effective plasma osmolality to minimize the likelihood of cerebral edema during treatment of children with diabetic ketoacidosis J. Pediatr. 2007 150 467 473 10.1016/j.jpeds.2006.11.062 17452217 Hoorn, E. J. et al. Preventing a drop in effective plasma osmolality to minimize the likelihood of cerebral edema during treatment of children with diabetic ketoacidosis. J. Pediatr. 150 17452217 10.1016/j.jpeds.2006.11.062 39. Duraisamy AJ Mishra M Kowluru A Kowluru RA Epigenetics and regulation of oxidative stress in diabetic retinopathy Invest. Ophthalmol. Vis. Sci. 2018 59 4831 4840 10.1167/iovs.18-24548 30347077 PMC6181189 Duraisamy, A. J., Mishra, M., Kowluru, A. & Kowluru, R. A. Epigenetics and regulation of oxidative stress in diabetic retinopathy. Invest. Ophthalmol. Vis. Sci. 59 30347077 10.1167/iovs.18-24548 PMC6181189 40. Aveleira CA TNF-alpha signals through PKCzeta/NF-kappaB to alter the tight junction complex and increase retinal endothelial cell permeability Diabetes 2010 59 2872 2882 10.2337/db09-1606 20693346 PMC2963546 Aveleira, C. A. et al. TNF-alpha signals through PKCzeta/NF-kappaB to alter the tight junction complex and increase retinal endothelial cell permeability. Diabetes 59 20693346 10.2337/db09-1606 PMC2963546 41. Nawaz MI Autocrine CCL2, CXCL4, CXCL9 and CXCL10 signal in retinal endothelial cells and are enhanced in diabetic retinopathy Exp. Eye Res. 2013 109 67 76 10.1016/j.exer.2013.01.008 23352833 Nawaz, M. I. et al. Autocrine CCL2, CXCL4, CXCL9 and CXCL10 signal in retinal endothelial cells and are enhanced in diabetic retinopathy. Exp. Eye Res. 109 23352833 10.1016/j.exer.2013.01.008 42. Zhao R Differential expression of Mir-1 26 and vascular endothelial growth factor in retinal cells of metabolic Acidosis-Induced neonatal rats J. Nanosci. Nanotechnol 2015 15 2088 2093 10.1166/jnn.2015.9230 26413624 Zhao, R. et al. Differential expression of Mir-1 26 and vascular endothelial growth factor in retinal cells of metabolic Acidosis-Induced neonatal rats. J. Nanosci. Nanotechnol 15 26413624 10.1166/jnn.2015.9230 43. American Diabetes Association Professional Practice C 12. Retinopathy, neuropathy, and foot care: standards of care in Diabetes-2025 Diabetes Care 2025 48 S252 S265 10.2337/dc25-S012 39651973 PMC11635040 American Diabetes Association Professional Practice C. 12. Retinopathy, neuropathy, and foot care: standards of care in Diabetes-2025. Diabetes Care 48 39651973 10.2337/dc25-S012 PMC11635040 44. American Diabetes Association Professional Practice C. ; 48:S128-S145.6. Glycemic Goals and Hypoglycemia: Standards of Care in Diabetes-2025. Diabetes Care (2025). 10.2337/dc25-S006 PMC11635034 39651981 45. American Diabetes Association Professional Practice C. 2 Diagnosis and classification of diabetes: standards of care in Diabetes-2025 Diabetes Care 2025 48 S27 S49 10.2337/dc25-S002 39651986 PMC11635041 American Diabetes Association Professional Practice C. 2. Diagnosis and classification of diabetes: standards of care in Diabetes-2025. Diabetes Care 48 39651986 10.2337/dc25-S002 PMC11635041 46. Chung JO Cho DH Chung DJ Chung MY Relationship between serum C-peptide level and diabetic retinopathy according to estimated glomerular filtration rate in patients with type 2 diabetes J. Diabetes Complications 2015 29 350 355 10.1016/j.jdiacomp.2014.12.013 25623633 Chung, J. O., Cho, D. H., Chung, D. J. & Chung, M. Y. Relationship between serum C-peptide level and diabetic retinopathy according to estimated glomerular filtration rate in patients with type 2 diabetes. J. Diabetes Complications 29 25623633 10.1016/j.jdiacomp.2014.12.013 47. Hodzic-Santor B Validation of the diagnostic accuracy levels of international classification of diseases, 10th revision codes for diabetic ketoacidosis: A multicentre, Cross-sectional study of adults Can. J. Diabetes 2024 48 227 232 10.1016/j.jcjd.2024.01.006 38262528 Hodzic-Santor, B. et al. Validation of the diagnostic accuracy levels of international classification of diseases, 10th revision codes for diabetic ketoacidosis: A multicentre, Cross-sectional study of adults. Can. J. Diabetes 48 38262528 10.1016/j.jcjd.2024.01.006 48. Chung TL The association of socioeconomic status on kidney transplant access and outcomes: a nationwide cohort study in Taiwan J. Nephrol. 2024 37 1563 1575 10.1007/s40620-024-01928-5 38635122 PMC11473664 Chung, T. L. et al. The association of socioeconomic status on kidney transplant access and outcomes: a nationwide cohort study in Taiwan. J. Nephrol. 37 38635122 10.1007/s40620-024-01928-5 PMC11473664 49. Chen IC Association of antidiabetic medications with depression risk and All-Cause mortality in type 2 diabetes: A TriNetX-Based cohort study Diabetes Res. Clin. Pract. 2025 223 112167 10.1016/j.diabres.2025.112167 40204122 Chen, I. C. et al. Association of antidiabetic medications with depression risk and All-Cause mortality in type 2 diabetes: A TriNetX-Based cohort study. Diabetes Res. Clin. Pract. 223 40204122 10.1016/j.diabres.2025.112167 50. McCoy RG Sociodemographic, clinical, and Treatment-Related factors associated with hyperglycemic crises among adults with type 1 or type 2 diabetes in the US from 2014 to 2020 JAMA Netw. Open. 2021 4 e2123471 10.1001/jamanetworkopen.2021.23471 34468753 PMC8411297 McCoy, R. G. et al. Sociodemographic, clinical, and Treatment-Related factors associated with hyperglycemic crises among adults with type 1 or type 2 diabetes in the US from 2014 to 2020. JAMA Netw. Open. 4 34468753 10.1001/jamanetworkopen.2021.23471 PMC8411297 51. Dafni U Landmark analysis at the 25-year landmark point Circ. Cardiovasc. Qual. Outcomes 2011 4 363 371 10.1161/CIRCOUTCOMES.110.957951 21586725 Dafni, U. Landmark analysis at the 25-year landmark point. Circ. Cardiovasc. Qual. Outcomes 4 21586725 10.1161/CIRCOUTCOMES.110.957951 52. Morgan CJ Landmark analysis: A primer J. Nucl. Cardiol. 2019 26 391 393 10.1007/s12350-019-01624-z 30719655 Morgan, C. J. Landmark analysis: A primer. J. Nucl. Cardiol. 26 30719655 10.1007/s12350-019-01624-z ",
  "metadata": {
    "Title of this paper": "Landmark analysis: A primer",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480749/"
  }
}