{
  "title": "Paper_52",
  "abstract": "pmc Int J Cosmet Sci Int J Cosmet Sci 379 blackwellopen ICS International Journal of Cosmetic Science 0142-5463 1468-2494 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12489883 PMC12489883.1 12489883 12489883 40274542 10.1111/ics.13068 ICS13068 ICS-2025-5210.R1 1 Review Article Review Article n‐3 PUFAs DHA and EPA are effective natural pro‐resolution ingredients for promoting skin health Nip et al. Nip John https://orcid.org/0009-0005-7781-4736  1 john.nip@unilever.com Hermanson Kevin  1 Lee Jian‐ming  1   1 Unilever Research and Development Trumbull Connecticut USA * Correspondence john.nip@unilever.com 24 4 2025 10 2025 47 5 498134 10.1111/ics.v47.5 820 826 11 3 2025 27 1 2025 24 3 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 Unilever. International Journal of Cosmetic Science https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Skin encounters many challenges that lead to an inflammatory response. Resolution of this inflammation is needed to return the skin to a healthy state. A review of the role of topical n‐3 PUFAs, particularly DHA and EPA, in resolving skin inflammation and promoting skin health is presented. A review of the literature and Unilever data on DHA/EPA pro‐resolution skin benefits. PubMed MEDLINE DHA EPA DHA EPA Skin encounters many challenges that lead to an inflammatory response. Resolution of this inflammation is needed to return the skin to a healthy state. A review of the role of topical n‐3 PUFAs, particularly DHA and EPA, in resolving skin inflammation and promoting skin health is presented. Résumé La peau est confrontée à de nombreuses agressions, qui entraînent une réponse inflammatoire. La disparition de cette inflammation est nécessaire pour que la peau redevienne saine. Un examen du rôle des acides gras polyinsaturés n‐3 topiques, en particulier le DHA et l'EPA, pour faire disparaitre l'inflammation cutanée et rendre la peau saine est présenté. Un examen de la littérature et des données d'Unilever sur les avantages du DHA/de l'EPA dans le processus de disparition de l'inflammation cutanée. Recherche PubMed/MEDLINE, recherche Google dans la littérature externe ainsi que données d'Unilever relatives à l'inflammation cutanée, au processus de disparition de cette inflammation et au rôle du DHA et de l'EPA. Les preuves de l'efficacité du DHA et de l'EPA dans le processus de disparition de l'inflammation cutanée sont résumées. Le DHA et l'EPA, ainsi que les médiateurs du processus de disparition de l'inflammation cutanée spécialisés qui en sont dérivés, peuvent atténuer la réponse inflammatoire de la peau induite par divers facteurs de stress et maintenir la peau saine. Unilever 10.13039/100007190 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:02.10.2025  Nip J Hermanson K Lee J‐m n‐3 PUFAs Int J Cosmet Sci 2025 47 820 826 10.1111/ics.13068 PMC12489883 40274542 INTRODUCTION Injury to tissues like the skin by severe trauma or pathogens, as well as everyday challenges such as UV and shaving, can lead to the release of proinflammatory chemical mediators resulting in acute inflammation. The initial signs of inflammation include redness, heat, swelling and pain, and loss of function—the five cardinal signs of inflammation [ 1 2 3 4 5 Polyunsaturated fatty acids (PUFAs), especially the n‐3 PUFAs, like DHA and EPA, naturally found in the cell membrane in the form of phospholipids, ensure the skin is able to properly resolve inflammation and repair damage that has occurred in the process. In this review, we discuss inflammation and its resolution, with emphasis on skin and the importance of pro‐resolution mediated by n‐3 polyunsaturated fatty acids, namely DHA and EPA. We used PubMed/Medline searches as well as online Google searches with relevant keywords and phrases to identify relevant articles. Searches of PubMed included key words (and combinations) such as pro‐resolution, n‐3 PUFA, inflammation, skin, lipid mediators, DHA and EPA. For example, a search using terms ‘inflammation and skin’ yielded over 55 242 articles. The articles were dated from ~1857 to 2025. All the articles were in the English language. Further, using the word ‘pro‐resolution’ in the search narrowed the number of articles to 16, ranging from 2011 to 2025. Along with combinations of the other keywords yielded lists of relevant articles that we reviewed, which are listed in the references. We also provided supporting Unilever studies to highlight the importance of DHA/EPA in pro‐resolution from topical skin applications. Inflammation and pro‐resolution Inflammation is a natural reaction of the body when tissues are damaged by infections, injuries or other factors. Its main goal is to repair tissue balance and defend the host. When inflammation is regulated and resolved properly, it helps the body recover and return to normal function. However, when inflammation is unregulated or unresolved, it can damage tissues and cause chronic inflammatory diseases. These conditions can involve metabolic disorders, autoimmunity, cardiovascular diseases and even cancer. Chronic inflammation can cause ongoing harm, affecting organs and overall health. We now understand that resolution is not a passive and linear stage of inflammation (from initiation to resolution), but an active and dynamic one. Pro‐resolution processes start soon after the inflammatory response begins [ 6 7 Resolvins are derived from both DHA and EPA [ 8 Protectins, including neuroprotectin D1 (when synthesized in neural tissues), are derived from DHA [ 9 10 Maresins are synthesized from DHA by macrophages [ 11 12 In summary, n‐3 PUFAs like DHA and EPA are essential for the resolution of inflammation due to their conversion into SPMs, which actively facilitate the return to tissue homeostasis and health. Efforts to develop strategies based on inflammation resolution are characteristics of the field of resolution pharmacology [ 13 Inflammation and pro‐resolution in the skin Skin inflammation is a common condition that affects millions of people worldwide. It can be caused by various factors, such as infections, allergies, injuries, autoimmune disorders or environmental stressors. Skin inflammation can manifest as redness, swelling, itching, pain or heat in the affected area [ 1 2 Similar to other body sites, inflammation of the skin is usually resolved by the innate immune system, which initiates a cascade of events to eliminate the inflammatory stimuli and restore tissue homeostasis [ 3 14 Importance of DHA EPA One of the potential strategies to promote the resolution of skin inflammation is to modulate the production and action of the SPMs that are generated from the metabolism of omega‐3 fatty acids, such as docosahexaenoic acid (DHA) and eicosapentaenoic acid (EPA) [ 4 5 15 16 17 18 19 Several studies have demonstrated the beneficial effects of DHA and EPA, and their derived SPMs, on the resolution of skin inflammation. For example, DHA and EPA have been shown to reduce the severity and duration of ultraviolet (UV)‐induced skin inflammation in humans [ 18 4 UV induces skin inflammation, damage and photoaging by modulating the production of eicosanoids and cytokines such as proinflammatory COX‐2. Topical application of DHA in a hairless mouse model resulted in the attenuation of COX‐2 expression [ 20 21 DHA and EPA have also been shown to improve the resolution of atopic dermatitis (AD) in mice and humans [ 16 16 Evidence of skin benefits of topical or oral DHA EPA UV induces skin inflammation, damage and photoaging. In a human study where subjects were irradiated with UV (285–350 nM), topical application of EPA decreased UV‐induced epidermal thickening and inhibited procollagen decrease. UV‐induced increase in MMP‐1 and MMP‐9 expression was also inhibited by topical EPA application [ 22 A psoriasis study demonstrated the benefits of oral DHA/EPA supplements [ 23 23 In a Unilever collaborative study, Lin et al. [ 24 Evidence of skin benefits of DHA EPA Further work at Unilever has focused on in vitro models of inflammation as well as clinical models. For the in vitro work, a THP‐1 cell model for inflammation was used. In this model, THP‐1 macrophages are treated with LPS to induce inflammation, which is shown as an increase in the pro‐inflammatory cytokine, IL‐6. DHA/EPA treatment of the cells resulted in a significant decrease in IL‐6 production. Similarly, the anti‐inflammatory corticosteroid, dexamethasone, also caused a large inhibition of LPS‐induced IL‐6 (Figure 1 FIGURE 1 Inhibition of LPS‐induced pro‐inflammatory IL‐6 production in THP‐1 macrophages. Cells were dosed with the indicated individual treatments or combinations of LPS (1 μg/mL), DHA (26 μM)/EPA (39 μM) and dexamethasone (50 nM). Data shown as percentage of LPS‐stimulated control (mean ± SEM, N Δ To further investigate the role of DHA/EPA in this THP‐1 cell model on pro‐resolution mediators, resolvin E1 was measured following LPS challenge. Figure 2 FIGURE 2 Production of Resolvin E1 by LPS‐stimulated THP‐1 macrophages at 24 h and 48 h. Data shown as mean ± SEM, N Δ In addition to in vitro models of inflammation, Unilever has developed a proprietary clinical methodology for assessing technologies for skin irritation/redness and skin tone. Post‐inflammatory hyperpigmentation (PIH) is a common concern in consumers with darker skin types. PIH is induced by shaving over the course of several weeks (Figure 3 p p FIGURE 3 DHA/EPA improves uneven skin tone. A proprietary clinical methodology developed for assessing technologies for skin irritation/redness and skin tone. Internal data contributed by Brian Potterf. * indicate significant difference from vehicle control of the DHA/EPA treatment ( p A recent study [ 25 25 4 25 FIGURE 4 Expert‐graded luminosity mean change from baseline at immediate and long‐term time points following microneedling treatment with a novel multiple‐active ingredient formulation and a hyaluronic acid control serum. * p p DISCUSSION AND CONCLUSION In this review, we have discussed the role of n‐3 PUFA, particularly DHA and EPA, in resolving skin inflammation and promoting skin health. Evidence from the literature and Unilever studies demonstrate that DHA and EPA, and their derived specialized pro‐resolving mediators (SPMs), can attenuate the skin inflammatory response induced by various factors, such as UV, shaving or pollution, and enhance the skin barrier function, skin tone and wound healing when applied topically. DHA/EPA can be effective natural pro‐resolution ingredients for various skin conditions, such as eczema, psoriasis, acne and photoageing. This may also help or promote benefits for post‐treatment skin recovery. Skin inflammation and its resolution are complex, involving many biological processes that are essential for the skin's ability to return to homeostasis and health after inflammation. Strategies that target different aspects of inflammation, including pro‐resolution, can be beneficial for cosmetic dermatology. FUNDING INFORMATION This work was funded by Unilever Research and Development. Unilever provided support in the form of salaries for authors (JN, KH and JML). CONFLICT OF INTEREST STATEMENT The authors declare that no competing interest exists. ACKNOWLEDGEMENTS This work was funded by Unilever Research and Development. Unilever provided support in the form of salaries for authors (JN, KH and JML), but did not have any additional role in the study design, data collection and analysis, decision to publish or preparation of the manuscript. The authors gratefully acknowledge Frank Huang, Sheila Rocha and Brian Potterf for their contributions to the data, while Unilever employees and Jeremy Shen for data analysis. REFERENCES 1 Rather LJ Disturbance of function (functio laesa): the legendary fifth cardinal sign of inflammation, added by Galen to the four cardinal signs of Celsus Bull NY Acad Med 1971 47 3 303 322 PMC1749862 5276838 2 Tracy RP The five cardinal signs of inflammation: Calor, dolor, Rubor, tumor … And Penuria (Apologies to Aulus Cornelius Celsus, De medicina, c. a.D. 25) J Gerontol A Biol Sci Med Sci 2006 61 10 1051 1052 10.1093/gerona/61.10.1051 17077197 3 Headland SE Norling LV The resolution of inflammation: principles and challenges Semin Immunol 2015 27 3 149 160 25911383 10.1016/j.smim.2015.03.014 4 Serhan CN Chiang N Van Dyke TE Resolving inflammation: dual anti‐inflammatory and pro‐resolution lipid mediators Nat Rev Immunol 2008 8 5 349 361 18437155 10.1038/nri2294 PMC2744593 5 Serhan CN Chiang N Dalli J Levy BD Lipid mediators in the resolution of inflammation Cold Spring Harb Perspect Biol 2014 7 2 a016311 25359497 10.1101/cshperspect.a016311 PMC4315926 6 Basil MC Levy BD Specialized pro‐resolving mediators: endogenous regulators of infection and inflammation Nat Rev Immunol 2016 16 1 51 67 26688348 10.1038/nri.2015.4 PMC5242505 7 Calder PC n‐3 PUFA and inflammation: from membrane to nucleus and from bench to bedside Proc Nutr Soc 2020 79 1 13 32624016 10.1017/S0029665120007077 8 Liu WC Yang YH Wang YC Chang WM Wang CW Maresin: macrophage mediator for resolving inflammation and bridging tissue regeneration‐a system‐based preclinical systematic review Int J Mol Sci 2023 24 13 11012 37446190 10.3390/ijms241311012 PMC10341548 9 Ishihara T Yoshida M Arita M Omega‐3 fatty acid‐derived mediators that control inflammation and tissue homeostasis Int Immunol 2019 31 9 559 567 30772915 10.1093/intimm/dxz001 10 Beyer MP Videla LA Farias C Valenzuela R Potential clinical applications of pro‐resolving lipids mediators from docosahexaenoic acid Nutrients 2023 15 15 3317 37571256 10.3390/nu15153317 PMC10421104 11 Blaauw R Calder PC Martindale RG Berger MM Combining proteins with n‐3 PUFAs (EPA + DHA) and their inflammation pro‐resolution mediators for preservation of skeletal muscle mass Crit Care 2024 28 1 38 38302945 10.1186/s13054-024-04803-8 PMC10835849 12 Joffre C Rey C Laye S N‐3 polyunsaturated fatty acids and the resolution of neuroinflammation Front Pharmacol 2019 10 1022 10.3389/fphar.2019.01022 31607902 PMC6755339 13 Costa VV Resende F Melo EM Teixeira MM Resolution pharmacology and the treatment of infectious diseases Br J Pharmacol 2024 181 7 917 937 38355144 10.1111/bph.16323 14 Chaowattanapanit S Silpa‐Archa N Kohli I Lim HW Hamzavi I Postinflammatory hyperpigmentation: a comprehensive overview: treatment options and prevention J Am Acad Dermatol 2017 77 4 607 621 28917452 10.1016/j.jaad.2017.01.036 15 Serhan CN Levy BD Resolvins in inflammation: emergence of the pro‐resolving superfamily of mediators J Clin Invest 2018 128 7 2657 2669 29757195 10.1172/JCI97943 PMC6025982 16 Sawada Y Saito‐Sasaki N Nakamura M Omega 3 fatty acid and skin diseases Front Immunol 2020 11 623052 33613558 10.3389/fimmu.2020.623052 PMC7892455 17 Sorokin AV Arnardottir H Svirydava M Ng Q Baumer Y Berg A Comparison of the dietary omega‐3 fatty acids impact on murine psoriasis‐like skin inflammation and associated lipid dysfunction J Nutr Biochem 2023 117 109348 37044136 10.1016/j.jnutbio.2023.109348 18 Huang TH Wang PW Yang SC Chou WL Fang JY Cosmetic and therapeutic applications of fish Oil's fatty acids on the skin Mar Drugs 2018 16 8 256 30061538 10.3390/md16080256 PMC6117694 19 Arantes EL Dragano N Ramalho A Vitorino D de‐Souza GF Lima MH Topical docosahexaenoic acid (DHA) accelerates skin wound healing in rats and activates GPR120 Biol Res Nurs 2016 18 4 411 419 10.1177/1099800415621617 26747719 20 Rahman M Kundu JK Shin JW Na HK Surh YJ Docosahexaenoic acid inhibits UVB‐induced activation of NF‐kappaB and expression of COX‐2 and NOX‐4 in HR‐1 hairless mouse skin by blocking MSK1 signaling PLoS One 2011 6 11 e28065 22140508 10.1371/journal.pone.0028065 PMC3225387 21 Jin XJ Kim EJ Oh IK Kim YK Park CH Chung JH Prevention of UV‐induced skin damages by 11,14,17‐eicosatrienoic acid in hairless mice in vivo J Korean Med Sci 2010 25 6 930 937 20514317 10.3346/jkms.2010.25.6.930 PMC2877234 22 Kim HH Shin CM Park CH Kim KH Cho KH Eun HC Eicosapentaenoic acid inhibits UV‐induced MMP‐1 expression in human dermal fibroblasts J Lipid Res 2005 46 8 1712 1720 15930517 10.1194/jlr.M500105-JLR200 23 Maurice PD Allen BR Barkley AS Cockbill SR Stammers J Bather PC The effects of dietary supplementation with fish oil in patients with psoriasis Br J Dermatol 1987 117 5 599 606 3689678 10.1111/j.1365-2133.1987.tb07492.x 24 Lin Z Niu Y Jiang Y Chen B Peng L Mi T Protective effects of dietary fish‐oil supplementation on skin inflammatory and oxidative stress biomarkers induced by fine particulate air pollution: a pilot randomized, double‐blind, placebo‐controlled trial Br J Dermatol 2021 184 2 261 269 32333793 10.1111/bjd.19156 25 Wong R Murphy A Lira M Sichmann MGO Kim AR Saechee VD Microneedling with a novel, n‐3‐PUFA‐rich formulation accelerates inflammation resolution to improve skin recovery outcomes in adults with healthy skin Dermatol Ther (Heidelb) 2023 13 12 3057 3069 37833618 10.1007/s13555-023-01049-0 PMC10689607 ",
  "metadata": {
    "Title of this paper": "Microneedling with a novel, n‐3‐PUFA‐rich formulation accelerates inflammation resolution to improve skin recovery outcomes in adults with healthy skin",
    "Journal it was published in:": "International Journal of Cosmetic Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489883/"
  }
}