{
  "title": "Paper_1128",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468196 PMC12468196.1 12468196 12468196 41008904 10.3390/cancers17183062 cancers-17-03062 1 Review Targeting the Mitochondria in High-Grade Gliomas Sathe Shaunak https://orcid.org/0009-0000-5823-799X Li Qi https://orcid.org/0000-0002-8359-6246 Jung Jinkyu https://orcid.org/0000-0002-1686-9646 Wu Jing * Weis Serge Academic Editor Neuro-Oncology Branch, Center for Cancer Research, National Cancer Institute, Bethesda, MD 20892, USA; sathesm@nih.gov qi.li2@nih.gov jinkyu.jung@nih.gov * jing.wu3@nih.gov 19 9 2025 9 2025 17 18 497140 3062 25 7 2025 04 9 2025 16 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary High-grade gliomas are aggressive brain tumors associated with poor outcomes. Mitochondria play an essential role in glioma growth and resistance to therapy, making them a promising target for novel therapeutic strategies. This review summarizes the mitochondrial dysfunctions that drive glioma progression, highlights clinical trials and therapies aimed at mitochondrial targeting, and discusses emerging approaches such as caseinolytic protease P (ClpP) and disruption of mitochondrial–epigenetic interactions that may improve outcomes for patients with high-grade glioma. Abstract High-grade gliomas are aggressive primary brain tumors and often fatal. They are characterized by rapid growth, treatment resistance, and significant heterogeneity both within and between tumors. A growing body of evidence highlights the mitochondria, dynamic organelles essential for energy production, apoptosis regulation, and metabolic rewiring, as a critical driver in glioma progression and treatment resistance. As a result, these insights have sparked growing interest in mitochondrial-directed therapies. This review highlights the distinct metabolic features and mitochondrial processes of glioma, outlining the rationale for targeting mitochondrial function. We discuss recent advances in mitochondrial-targeted therapies, with a focus on caseinolytic protease P (ClpP) agonism as a breakthrough in the treatment of diffuse midline glioma (DMG). Moreover, we discuss the pathogenic link between mitochondrial metabolism and epigenetic regulation, and the potential therapeutic benefit of disrupting this interaction. high-grade glioma glioblastoma DMG mitochondria clinical trial Intramural Research Program of the NIH, National Cancer Institute ZIA BC011840 This research was funded by the Intramural Research Program of the NIH, National Cancer Institute (ZIA BC011840). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction High-grade gliomas are malignant and incurable brain tumors, leading to significant morbidity and mortality in both adults and children [ 1 2 Glioblastoma accounts for the majority of malignant gliomas and is diagnosed in approximately 3.27 per 100,000 people/year [ 1 3 4 Diffuse midline glioma (DMG) is a type of high-grade brain tumor that primarily affects children and young adults. It is the most lethal childhood cancer, with a median overall survival of 9–11 months and a 2-year survival of less than 10%, despite six decades of intense conventional and experimental therapies that have been unable to significantly improve patient outcomes [ 5 6 2 2 7 Although extensive research efforts have provided exciting insight into the biochemical mechanisms that drive high-grade gliomas, clinical outcomes have improved only modestly, and both glioblastoma and DMG remain universally fatal. Poor prognosis of these tumors can be attributed to rapid progression and resistance to chemotherapy and radiation. Growing evidence implicates the mitochondria as a key driver of these therapeutic challenges. In glioma, as well as breast, colorectal, lung, pancreatic and several other tumors, mitochondrial dysfunction has been identified as a contributor to tumor growth and therapy resistance, establishing the mitochondria as a common cancer driver [ 8 9 10 11 12 13 Here, we begin by highlighting the distinct metabolic properties of glioma and focus on the mitochondria as a critical driver of metabolic rewiring. We discuss how aberrant mitochondrial quality control contributes to treatment resistance and glioma progression and highlight the mitochondria as an attractive therapeutic target. Finally, we provide a summary of mitochondrial targeting efforts, including a therapeutic breakthrough through ClpP agonism, and touch on crosstalk between mitochondrial metabolism and epigenetics that may be exploitable for glioma treatment. 2. Distinct Metabolic Properties of Glioma Gliomas undergo extensive metabolic reprogramming to support their aggressive growth, acquiring distinct metabolic properties. Mitochondria are as central regulators of this reprogramming, with their functional state influencing both energy production and nutrient uptake. Critical metabolic processes, including fatty acid β-oxidation and the tricarboxylic acid (TCA) cycle take place within the mitochondrial matrix, highlighting the organelle’s essential role in glioma metabolic adaption [ 14 15 2.1. The Warburg Effect The first observation of reprogramming of cancer metabolism came from a landmark study in cancer biology by Warburg et al., which was later termed the Warburg effect— that cancer cells upregulate “aerobic glycolysis” by taking up high amounts of glucose to produce lactate regardless of the presence of oxygen [ 16 17 So, why would cancer cells prefer this energetically inefficient process? Discussion has centered on four main arguments. First, the Warburg effect reprograms cancer cells to improve access to a limited resource (glucose) for energy production to meet their needs for rapid proliferation. Secondly, it promotes energy flux into several biosynthetic pathways to produce vital cell building blocks, such as nucleotides, amino acids, and lipids. Thirdly, it acidifies the tumor microenvironment (TME) to disrupt tissue architecture and cause immune suppression. Lastly, it allows for cell signaling alterations due to changes in reactive oxygen species (ROS) and chromatin modulation [ 18 19 The origin of extensive metabolic reprograming is driven, at least in part, by the intrinsic hypoxic properties of many primary brain tumors. Malignant gliomas cells are known to accumulate hypoxia-inducible factors (HIFs), acting as hypoxia sensors that orchestrate a coordinated response to increase their pro-survival and pro-invasive phenotype [ 20 21 Metabolic rewiring in glioma is also evidenced by the upregulation in glucose uptake, addiction to glutamine, increased fatty acid synthesis and beta-oxidation, and the alterations of the TCA cycle [ 17 22 23 24 25 2.2. Increased Reliance on Glucose and Glutamine To support the need for glycolytic activity, glioma cells highly upregulate the expression of glucose-transporters, GLUT1 and GLUT3, enhancing glycolytic flux into the cell [ 22 26 22 27 28 28 17 In addition to glucose, glioma cells strongly rely on glutamine for fuel for several reasons. Glutamine serves as a critical anaplerotic substrate, replenishing TCA cycle intermediates in the mitochondria through its conversion to glutamate and subsequently to α-ketoglutarate. Glutamine metabolism also contributes to redox homeostasis by supporting the production of glutathione, a key antioxidant that helps glioma cells resist oxidative stress [ 23 29 30 2.3. Upregulated Beta-Oxidation and Fatty Acid Synthesis Fatty acid synthesis is generally upregulated in glioma, with fatty acid synthase expression correlating with higher tumor grades. Various studies have attributed this upregulation of fatty acid synthesis to the activity of sterol response element binding protein (SREBP), a transcription factor [ 24 30 31 32 25 Fatty acid oxidation (FAO) is also upregulated in glioma, particularly in glioblastoma, providing a critical alternative energy source. Several studies have linked increased FAO to therapy resistance and survival in glioblastoma [ 25 33 34 34 33 2.4. Altered TCA Cycle Function Glioma cells display highly altered TCA cycle function and maintain the TCA cycle under hypoxic conditions through replenishing α-ketoglutarate, by taking up glutamine and aspartate from their environment [ 35 35 36 Isocitrate dehydrogenase (IDH) enzymes are key players in the TCA cycle, facilitating the conversion of isocitrate into α-ketoglutarate while using NADP + + 37 38 37 38 Although IDH mutations are uncommon in gliomas diagnosed de novo as high-grade, they are present in approximately 70–80% of low-grade gliomas. Importantly, most IDH-mutant, low-grade gliomas eventually undergo malignant transformation into high-grade tumors. As a result, IDH mutation remains a defining metabolic alteration in a biologically distinct subset of high-grade gliomas [ 39 40 41 Glioma cells exhibit extensive metabolic rewiring to support tumor growth, as exemplified by the Warburg effect and other altered metabolic pathways. Dysfunctional mitochondria play a central role in regulating these processes and have emerged as a promising focus of research [ 14 42 3. Aberrant Mitochondrial Quality Control in Glioma Glioma cells exhibit aberrant mitochondrial processes that contribute to tumor progression and therapy resistance. As summarized in Figure 1 3.1. Mitochondrial Transfer One alteration of mitochondrial processes in glioma progression is through a process known as mitochondrial transfer, to import mitochondria from and to adjacent cells via tunneling actin nanotubes. Mesenchymal stem cells were shown to transfer mitochondria to recipient glioblastoma cells, inducing metabolic and functional changes [ 43 43 44 45 3.2. Upregulation of Mitophagy The cellular process of mitophagy, the cellular breakdown and recycling of damaged mitochondria, is generally upregulated in glioma cells as a protective mechanism to deal with cellular stressors. Prognostic models using a mitophagy-related gene signature have shown remarkable accuracy in predicting overall survival, demonstrating the clinical relevance of mitophagy in glioma patients [ 46 47 48 49 50 51 3.3. Mitochondrial Dynamics Glioma mitochondria also have altered mitochondrial dynamics—including fission and fusion—which are reported to be critical in glioma progression [ 52 14 53 54 Aberrant mitochondrial quality control and extensive metabolic reprogramming in glioma highlight the mitochondria as critical in tumor progression and treatment resistance. Notably, emerging literature suggests that targeting the mitochondria in glioma may help overcome longstanding therapeutic challenges [ 14 15 55 56 4. Therapeutic Challenges in Glioma and the Promise of Mitochondrial Targeting The challenges to treating glioma are multifold, resulting in difficulties in improving the standard of care. As previously discussed, glioma cells are dynamic and can be fueled through multiple metabolic pathways. The disease is also rapidly evolving, supported by self-renewing GSCs, protected by the blood–brain barrier (BBB) and the blood–tumor barrier (BTB), which are difficult to penetrate, and located within an immunosuppressive tumor microenvironment. Complicating therapy further, high-grade gliomas are characterized by incredibly high level of heterogeneity [ 57 4.1. High Inter- and Intratumor Heterogeneity A major challenge to treatment of high-grade gliomas, particularly glioblastoma, is the high intra- and intertumoral heterogeneity [ 58 59 Intertumor heterogeneity also presents as a major challenge to treating glioma. Various glioblastoma subtypes between different tumors can be mapped along neurodevelopmental and metabolic axes, creating 4 general classifications: proliferative/progenitor, neuronal, glycolytic/plurimetabolic and mitochondrial [ 60 4.2. Targeting the Mitochondria in Subtypes of High-Grade Gliomas In the past, clinical trials for mitochondrial inhibitors have generally lacked distinction between different metabolic subtypes in high-grade gliomas. Future clinical trials may benefit from a more precise approach by targeting tumors with a higher mitochondrial dependency. Emerging literature has corroborated the efficacy of a precision medicine approach, utilizing mitochondrial-targeting therapies directed at high-grade gliomas that exhibit higher OXPHOS dependence. It was reported that mitochondrial, but not glycolytic/plurimetabolic glioblastoma, exhibited remarkable vulnerability to inhibitors of OXPHOS. Interestingly, the mitochondrial subtype showed higher frequency of CDK4/MDM2 amplification, and all NRAS-mutated glioblastomas mapped exclusively to this subtype, suggesting potential clinical markers. With over 20% of glioblastomas fueled by mitochondrial hyperactivity, this targeted strategy seems promising [ 60 61 Notably, while this strategy may be most effective in high-grade gliomas that are especially reliant on the mitochondria, there is evidence that mitochondrial targeting still has a broader effect across diverse glioma niches and subtypes. Given the high metabolic heterogeneity within a tumor, there is evidence that even glycolytic glioma cells can respond to mitochondrial targeting. Though these cells rely on glycolysis for energy production during early stages, lactic acid buildup progressively reduces glycolysis levels and significantly increases OXPHOS processes (approximately 2–4 times) throughout disease progression to generate adequate energy, rendering them vulnerable to OXPHOS inhibitors [ 62 63 64 65 66 With this strong rationale for mitochondrial targeting, several compounds have been developed to impair mitochondrial functioning in glioma, attempting to exploit vulnerabilities into clinically meaningful outcomes. 5. Efforts in Targeting the Mitochondria in Glioma Mitochondrial targeting encompasses a large umbrella of drugs that inhibit various mitochondrial processes. 5.1. Targeting the Mitochondria Through OXPHOS Inhibitors Targeting of the Electron Transport Chain (ETC) through OXPHOS inhibitors has emerged as an effective therapeutic strategy. The ETC, located in the inner mitochondrial membrane is made up of five complexes. Complexes I–IV are involved in the transfer of electrons from electron carriers (NADH and FADH2) to oxygen via oxidation, coupled with the pumping of protons into the intermembrane space. Complex V, known as ATP synthase, then utilizes this electrochemical gradient to phosphorylate ADP into ATP—known as oxidative phosphorylation [ 67 68 69 70 5.1.1. Inhibitors of Complex I Complex I (NADH ubiquinone–oxidoreductase) inhibitors have shown promise in preclinical and clinical trials for glioma. Metformin, a biguanide used as an anti-diabetic drug, is known to inhibit Complex I and impair OXPHOS [ 71 72 73 74 75 76 77 IACS-010759 is an incredibly selective and potent small-molecule complex I inhibitor, which was advanced into two dose-escalation phase I trials in patients with relapsed/refractory acute myeloid leukemia ( NCT02882321 n NCT03291938 n 78 78 IM156, another biguanide and Complex I inhibitor, showed more promise [ 79 79 5.1.2. Inhibitors of Complex II While complex II inhibition has not been investigated in clinical trials for glioma, several complex II inhibitors have demonstrated preclinical efficacy. The atypical adamantyl retinoid, ST1926, alleviated mitochondria-regulated bioenergetics in glioma cells via reducing ATP production and promoting ROS production [ 80 81 82 82 5.1.3. Inhibitors of Complex III Targeting Complex III has also demonstrated preclinical efficacy in gliomas, including drugs such as Mahanine, Atovaquone, Antimycin A, and Licochalcone A. Mahanine, a plant-derived Complex III inhibitor, leads to cell cycle arrest and DNA damage response in glioblastoma cell lines. The accumulation of ROS resulted in Chk1/Chk2 upregulation and activation, which are essential factors for G0/G1 arrest [ 83 84 85 86 87 5.1.4. Inhibitors of Complex IV Complex IV inhibitors, such as arsenic trioxide (ATO), have shown promising anti-glioma effects through induction of autophagy and apoptosis in GSCs. In both in vitro and in vivo glioblastoma models, arsenic trioxide induced cell death through downregulation of survivin [ 88 89 NCT00045565 90 91 5.1.5. Inhibitors of Complex V Targeting ATP Synthase (Complex V) has emerged as an exciting therapeutic vulnerability, corroborated by strong preclinical evidence. Gboxin, a small-molecule OXPHOS inhibitor, specifically targeted mouse and human glioblastoma cells but not that of mouse embryonic fibroblasts or neonatal astrocytes [ 92 93 NCT06806228 94 95 A summary of clinical trials in glioma that employ OXPHOS inhibitors is provided in Table 1 5.2. Additional Mitochondrial Targeted Strategies in Glioma While several OXPHOS inhibitors targeting the mitochondrial respiratory complexes have advanced to clinical trials for glioma, other mitochondrial-targeting strategies including inhibition of β-oxidation and disruption of mitochondrial matrix functions have demonstrated preclinical efficacy. Few of these approaches have advanced to the clinical trial stage. 5.2.1. Inhibitors of Beta-Oxidation Targeting fatty acid oxidation has emerged as a promising therapeutic vulnerability. Etomoxir is a carnitine palmitoyltransferase I inhibitor that prevents ß-oxidation of fatty acids to reduce energy levels. Etoximir was shown to reduce energy production and cellular proliferation in glioma cells [ 34 98 98 99 5.2.2. Compounds Targeting Mitochondrial Matrix Devimistat or CPI-613 selectively targets the TCA cycle enzymes, pyruvate dehydrogenase and α-ketoglutarate dehydrogenase, in order to compromise mitochondrial processes. This interference initiates apoptosis in glioblastoma cell lines and animal models, especially when combined with a BH3-mimetic [ 55 100 101 102 Gamitrinib, also known as geldanamycin, is a mitochondrial matrix inhibitor that was reported to inhibit of proliferation and induce apoptosis in several glioma cell lines, patient-derived organoids, and xenograft models [ 103 NCT04827810 104 5.3. Effects of Mitochondrial Targeting on Cancer Signaling Networks Mitochondrial targeting also activates several relevant signaling cascades. Many mitochondrial inhibitors lead to accumulation of ROS, which can overwhelm antioxidant defenses and disrupt key survival pathways, ultimately inducing cytotoxicity in glioma cells [ 86 105 106 107 108 Interestingly, it has also been shown that targeting mitochondrial function and OXPHOS can destabilize hypoxia-inducible factor 1-alpha (HIF-1α), a critical regulator of glioma progression under hypoxic conditions [ 109 109 Mitochondrial-targeting drugs can also disrupt mitochondrial membrane potential and cause structural damage. One key effect is outer membrane permeabilization (MOMP), often mediated by BH3-only BCL-2 proteins. This permeabilization facilitates the release of cytochrome c into the cytosol, leading to activation of caspases and initiation of the intrinsic apoptotic pathway in glioma cells [ 110 111 6. Breakthrough in Targeting Mitochondrial Function: Imipridones Induce Mitochondrial Dysfunction in DMG via Hyperactivation of Caseinolytic Protease P A new generation of mitochondrial-targeting compounds called imipridones has recently offered a glimmer of hope, particularly in the treatment of diffuse midline glioma (DMG). Imipridones are highlighted here, as they have demonstrated strong clinical potential in a disease that has seen limited therapeutic progress over the past several decades. 6.1. Imipridones, a New Drug Class with Potent Antitumor Effects The first generation of imipridones, ONC201, was originally discovered as TNF-Related Apoptosis Inducing Ligand (TRAIL)-inducing compound 10, in a small-molecule screen of colorectal cancer cell lines [ 112 113 Using a Bayesian machine learning approach, ONC201 was originally identified as a dopamine receptor D2 (DRD2) antagonist, with in silico modeling confirming ONC201 binds to the active site of DRD2 [ 114 115 116 117 118 119 120 121 6.2. ClpP Identified as a Target of Imipridones Recent studies have attributed the antitumor effect of imipridones to agonism of the caseinolytic protease P (ClpP), a serine protease located specifically in the mitochondrial matrix that regulates protein integrity and several key mitochondrial functions. ClpP forms a heterodimer with its ClpX chaperone, creating a complex termed ClpXP. When functioning normally, ClpXP performs protein quality control in the mitochondria by degrading denatured or misfolded protein to maintain the integrity of the respiratory chain and sustain OXPHOS. Mechanistically, ClpP agonists displace ClpX, opening the pore of the ClpP protease and strongly increasing its protease activity leading to mitochondrial degradation [ 122 ClpP was confirmed as a target of imipridones through crystallography and biochemical studies, and ClpP agonism was shown to induce selective lethality in cancer cells [ 119 120 115 123 124 125 126 Moreover, investigators have recently developed a new class of more potent and selective imipridones, known as TR compounds [ 120 127 128 129 115 119 122 129 6.3. Clinical Efficacy of Imipridones for Diffuse Midline Glioma Several clinical trials have evaluated the safety and efficacy of imipridones, including ONC201 and its more potent analog ONC206, in diffuse gliomas. A first-in-human clinical trial of ONC201 ( NCT02525692 130 131 NCT03416530 NCT03134131 n 132 132 6.4. Evaluating the Response to Imipridone Therapy To monitor treatment response, recent studies have searched for prognostic indicators and biomarkers that can evaluate H3K27M DMG’s response to imipridones. The H3K27M variant allele fraction (VAF) was measured in cell-free tumor DNA samples in DMG patients treated with ONC201. Decreased VAF levels correlated with increased progression-free survival, nearly doubling time to progression [ 133 133 Moreover, demonstrating the biochemical effects of imipridone therapy, it was reported that mice bearing orthotopic DMG xenografts treated with ONC206 accumulate gamma-aminobutyric acid (GABA) levels within a week of treatment [ 134 134 A summary of clinical trials that employ imipridones in high-grade glioma is provided in Table 2 7. Mitochondrial Targeting Can Alter the Epigenetic Landscape in Gliomas Glioma exhibits strong pathogenic crosstalk between mitochondrial function and epigenetic regulation, which can be exploited through mitochondrial-targeting strategies. This interplay is mediated by key mitochondrial metabolites that serve as substrates or cofactors for epigenetic enzymes, as illustrated in Figure 2 7.1. Mitochondrial-Epigenetic Crosstalk in Glioma Mitochondria play a critical role in regulating epigenetic modifications by supplying key metabolites required for chromatin remodeling. For instance, histone acetylation through histone acetyltransferases (HATs) depends on acetyl-CoA, a metabolite primarily generated in the mitochondria, to promote gene activation. In glioblastoma, fluctuations in acetyl-CoA levels have been shown to regulate H3K27 acetylation at specific genomic loci, with ATP citrate lyase (ACLY)-dependent acetyl-CoA production driving oncogenic gene expression programs involved in cell adhesion and migration [ 136 + 137 + Furthermore, DNA, RNA, and histone methylation is regulated by DNA methyltransferases (DNMTs), RNA methyltransferases (RNA MTs), and histone methyltransferases, including enhancer of zeste homolog 1 and 2 (EZH1 and EZH2). All of these methyltransferases require S-adenosylmethionine (SAM) as the methyl group donor [ 138 139 137 140 DNA demethylation is mediated by ten-eleven translocation (TET) dioxygenases. RNA demethylation is performed by the fat mass and obesity-associated protein (FTO) and the AlkB homolog 5 protein (ALKBH5) [ 141 142 137 138 142 143 Notably, oncometabolites such as 2-hydroxyglutarate (2-HG), succinate, and fumarate can competitively inhibit α-KG-dependent demethylases. In high-grade gliomas with the mitochondrial IDH2 mutation, mutant IDH2 aberrantly produce 2-HG, which inhibits TETs, FTO, ALKBH5, and JMJDs. This inhibition promotes widespread DNA hypermethylation and transcriptional silencing [ 144 Together, these metabolite–enzyme interactions underscore the critical role of mitochondrial metabolism in shaping the epigenetic landscape of glioma. By influencing the availability of key cofactors and substrates, mitochondria help regulate DNA, RNA, and histone modifications that control gene expression. These insights suggest that targeting mitochondrial function could potentially reverse pathogenic epigenetic alterations and suppress tumor growth. However, the epigenetic consequences of mitochondrial-targeted therapies in glioma remain largely unexplored, with limited direct evidence available to date. 7.2. Evidence for Epigenetic Modulation via Mitochondrial Targeting The drug class of mitochondrial-targeting imipridones have demonstrated a remarkable ability to reverse the pathogenic phenotype of H3K27-altered DMG, which is characterized by global histone hypomethylation and a widespread reduction in H3K27me3, driving aggressive tumor growth. ONC201 can reverse the epigenetic state of DMG by increasing genomic H3K27me3 in H3K27M-DMG patient tumors. The early reversal of low H3K27me3 with ONC201 treatment was incredibly promising [ 135 135 This connection has also demonstrated potential in other high-grade gliomas. A mitochondrial-targeting nanotherapy has been reported to exert potent antitumor effects in high-grade IDH2-mutated glioma by disrupting the mitochondrial–epigenetic axis. The hypericin-conjugated gold nanoparticles accumulate in glioma mitochondria and, upon red-light activation, induce oxidative stress and mitochondrial dysfunction, leading to a reduction in mutant IDH2 levels. In addition, degradation of the histone methyltransferases EZH1 and EZH2 led to decreased histone trimethylation, potentially reactivating tumor suppressor genes. Efficacy of this dual-targeting effect was demonstrated in xenograft mice models [ 145 8. Conclusions It is evident that the mitochondria are central orchestrators of glioma development, performing a wide array of dynamic functions that support rapid tumor growth. Through extensive metabolic reprogramming, glioma mitochondria supply the energy and biosynthetic intermediates required for glioma progression and resistance, establishing them as an attractive therapeutic target. Several preclinical and clinical efforts have aimed to exploit this vulnerability, though success has been mixed. A major clinical barrier has been toxicity, as demonstrated in the phase I trial of IACS-010759, which failed to reach the recommended phase II dosing due to neurotoxicity [ 78 A precision medicine approach may represent the next logical step, leveraging mitochondrial-targeted therapies in gliomas that exhibit heightened mitochondrial dependence. Deeper understanding of glioma-specific mitochondrial biology will be essential to identify predictive biomarkers and design more selective targeting strategies [ 146 For example, since mitochondrial transfer has been implicated in glioma immune evasion, its inhibition may enhance responses to immunotherapy [ 45 43 49 12 Recently, the discovery of imipridones and induction of mitochondrial degeneration through ClpP agonism has sparked hope in the mitochondrial-targeting strategy, resulting in promising clinical trials for the treatment of DMG. The ability of imipridones to initiate mitochondrial collapse, trigger integrated stress response, and reverse epigenetic aberrations positions them as powerful, multifaceted agents, particularly in the context of DMG. Interestingly, combining ClpP agonists with epigenetic therapies, such as HDAC or EZH1/2 inhibitors, has also been shown to enhance antitumor efficacy in high-grade gliomas [ 147 148 Realizing the full therapeutic potential of mitochondrial targeting hinges on overcoming drug delivery challenges particularly across the blood–brain barrier (BBB) and into the mitochondrial compartment. Promising approaches include lipid-based nanocarriers, such as liposomes and solid lipid nanoparticles, engineered to cross the BBB and functionalized with mitochondrial-targeting moieties like triphenylphosphonium. Inorganic nanoparticles, including gold and mesoporous silica particles, can enhance intracellular delivery and be conjugated with mitochondrial-targeting ligands. Peptide-based systems, such as mitochondrial-penetrating peptides or mitochondrial targeting sequences, offer high specificity for mitochondrial membranes but often require integration with nanocarriers for effective blood–brain penetration. Collectively, advances in these platforms may help address the critical challenges of systemic toxicity while improving therapeutic specificity [ 149 We acknowledge several limitations of this review. Firstly, our discussion of mitochondrial processes such as mitophagy and dynamics has been simplified to provide an overview of the current understanding. These processes are likely far more complex and context-dependent than represented here. Secondly, our discussion of drugs targeting mitochondrial respiratory complexes, including agents like metformin and arsenic trioxide, has been simplified. While these compounds exhibit mitochondrial activity, they often exert some antitumor effects through additional, non-mitochondrial mechanisms. Lastly, therapeutic strategies aimed at modulating epigenetics through mitochondrial targeting remain largely experimental. The current evidence base is limited, and further research is needed to validate the efficacy and mechanistic underpinnings of these approaches in glioma. Looking ahead, the future of mitochondrial-targeted therapies in glioma will hinge on advancing our molecular understanding of glioma-specific mitochondrial vulnerabilities and on continued innovation in targeted drug delivery systems. As our insight into mitochondrial function in glioma deepens, so too does the potential to translate these insights into more precise, less toxic, and ultimately transformative therapies for patients with this devastating disease. Acknowledgments This work was supported by the National Cancer Institute’s Intramural Research Program. The authors would also like to thank all the patients and families for their participation in the glioma clinical trials reviewed in this article and for their support of our clinical research. Disclaimer/Publisher’s Note: Author Contributions Conceptualization and writing—original draft preparation, S.S. and J.W.; review and editing, S.S., Q.L., J.J. and J.W. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. The contributions of the NIH author(s) were made as part of their official duties as NIH federal employees, are in compliance with agency policy requirements, and are considered works of the United States Government. However, the findings and conclusions presented in this paper are those of the author(s) and do not necessarily reflect the views of the NIH or the U.S. Department of Health and Human Services. References 1. Ostrom Q.T. Price M. Neff C. Cioffi G. Waite K.A. Kruchko C. Barnholtz-Sloan J.S. CBTRUS Statistical Report: Primary Brain and Other Central Nervous System Tumors Diagnosed in the United States in 2016–2020 Neuro Oncol. 2023 25 iv1 iv99 10.1093/neuonc/noad149 37793125 PMC10550277 2. Louis D.N. Perry A. Wesseling P. Brat D.J. Cree I.A. Figarella-Branger D. Hawkins C. Ng H.K. Pfister S.M. Reifenberger G. The 2021 WHO Classification of Tumors of the Central Nervous System: A summary Neuro Oncol. 2021 23 1231 1251 10.1093/neuonc/noab106 34185076 PMC8328013 3. Stupp R. Mason W.P. van den Bent M.J. Weller M. Fisher B. Taphoorn M.J. Belanger K. Brandes A.A. Marosi C. Bogdahn U. Radiotherapy plus concomitant and adjuvant temozolomide for glioblastoma N. Engl. J. Med. 2005 352 987 996 10.1056/NEJMoa043330 15758009 4. Wong E.T. Hess K.R. Gleason M.J. Jaeckle K.A. Kyritsis A.P. Prados M.D. Levin V.A. Yung W.K. Outcomes and prognostic factors in recurrent glioma patients enrolled onto phase II clinical trials J. Clin. Oncol. 1999 17 2572 2578 10.1200/JCO.1999.17.8.2572 10561324 5. Jackson S. Patay Z. Howarth R. Pai Panandiker A.S. Onar-Thomas A. Gajjar A. Broniscer A. Clinico-radiologic characteristics of long-term survivors of diffuse intrinsic pontine glioma J. Neurooncol. 2013 114 339 344 10.1007/s11060-013-1189-0 23813229 PMC3755743 6. Hoffman L.M. Veldhuijzen van Zanten S.E.M. Colditz N. Baugh J. Chaney B. Hoffmann M. Lane A. Fuller C. Miles L. Hawkins C. Clinical, Radiologic, Pathologic, and Molecular Characteristics of Long-Term Survivors of Diffuse Intrinsic Pontine Glioma (DIPG): A Collaborative Report From the International and European Society for Pediatric Oncology DIPG Registries J. Clin. Oncol. 2018 36 1963 1972 10.1200/JCO.2017.75.9308 29746225 PMC6075859 7. Chan K.M. Fang D. Gan H. Hashizume R. Yu C. Schroeder M. Gupta N. Mueller S. James C.D. Jenkins R. The histone H3.3K27M mutation in pediatric glioma reprograms H3K27 methylation and gene expression Genes Dev. 2013 27 985 990 10.1101/gad.217778.113 23603901 PMC3656328 8. Kannan A. Wells R.B. Sivakumar S. Komatsu S. Singh K.P. Samten B. Philley J.V. Sauter E.R. Ikebe M. Idell S. Mitochondrial Reprogramming Regulates Breast Cancer Progression Clin. Cancer Res. 2016 22 3348 3360 10.1158/1078-0432.CCR-15-2456 26888829 9. Qiu X. Wang A. Wang J. Zhang Z. Tao L. Mitochondrial metabolic reprogramming in colorectal cancer: Mechanisms of resistance and future clinical interventions Cell Death Discov. 2025 11 375 10.1038/s41420-025-02670-y 40783392 PMC12335542 10. Chuang C.H. Dorsch M. Dujardin P. Silas S. Ueffing K. Holken J.M. Yang D. Winslow M.M. Gruner B.M. Altered Mitochondria Functionality Defines a Metastatic Cell State in Lung Cancer and Creates an Exploitable Vulnerability Cancer Res. 2021 81 567 579 10.1158/0008-5472.CAN-20-1865 33239425 PMC8137518 11. Sarwar A. Zhu M. Su Q. Zhu Z. Yang T. Chen Y. Peng X. Zhang Y. Targeting mitochondrial dysfunctions in pancreatic cancer evokes new therapeutic opportunities Crit. Rev. Oncol. Hematol. 2022 180 103858 10.1016/j.critrevonc.2022.103858 36257540 12. Zhang H. Chen Y. Liu X. Deng H. Multi-Omics Analyses Reveal Mitochondrial Dysfunction Contributing to Temozolomide Resistance in Glioblastoma Cells Biomolecules 2023 13 1408 10.3390/biom13091408 37759808 PMC10526285 13. Fulda S. Galluzzi L. Kroemer G. Targeting mitochondria for cancer therapy Nat. Rev. Drug Discov. 2010 9 447 464 10.1038/nrd3137 20467424 14. Chen L. Zhang H. Shang C. Hong Y. The Role and Applied Value of Mitochondria in Glioma-Related Research CNS Neurosci. Ther. 2024 30 e70121 10.1111/cns.70121 39639571 PMC11621238 15. Liang Z. Zhao S. Liu Y. Cheng C. The promise of mitochondria in the treatment of glioblastoma: A brief review Discov. Oncol. 2025 16 142 10.1007/s12672-025-01891-y 39924629 PMC11807951 16. Warburg O. Posener K. Negelein E. On the metabolism of carcinoma cells Biochem. Z. 1924 152 309 344 10.1158/jcr.1925.148 17. Strickland M. Stoll E.A. Metabolic Reprogramming in Glioma Front. Cell Dev. Biol. 2017 5 43 10.3389/fcell.2017.00043 28491867 PMC5405080 18. Liberti M.V. Locasale J.W. The Warburg Effect: How Does it Benefit Cancer Cells? Trends Biochem. Sci. 2016 41 211 218 10.1016/j.tibs.2015.12.001 26778478 PMC4783224 19. Vander Heiden M.G. Cantley L.C. Thompson C.B. Understanding the Warburg effect: The metabolic requirements of cell proliferation Science 2009 324 1029 1033 10.1126/science.1160809 19460998 PMC2849637 20. Cortes Ballen A.I. Amosu M. Ravinder S. Chan J. Derin E. Slika H. Tyler B. Metabolic Reprogramming in Glioblastoma Multiforme: A Review of Pathways and Therapeutic Targets Cells 2024 13 1574 10.3390/cells13181574 39329757 PMC11430559 21. Belisario D.C. Kopecka J. Pasino M. Akman M. De Smaele E. Donadelli M. Riganti C. Hypoxia Dictates Metabolic Rewiring of Tumors: Implications for Chemoresistance Cells 2020 9 2598 10.3390/cells9122598 33291643 PMC7761956 22. Komaki S. Sugita Y. Furuta T. Yamada K. Moritsubo M. Abe H. Akiba J. Miyagi N. Nakamura H. Miyoshi H. Expression of GLUT1 in Pseudopalisaded and Perivascular Tumor Cells Is an Independent Prognostic Factor for Patients With Glioblastomas J. Neuropathol. Exp. Neurol. 2019 78 389 397 10.1093/jnen/nly124 30990881 PMC6467190 23. Wise D.R. Thompson C.B. Glutamine addiction: A new therapeutic target in cancer Trends Biochem. Sci. 2010 35 427 433 10.1016/j.tibs.2010.05.003 20570523 PMC2917518 24. Lewis C.A. Brault C. Peck B. Bensaad K. Griffiths B. Mitter R. Chakravarty P. East P. Dankworth B. Alibhai D. SREBP maintains lipid biosynthesis and viability of cancer cells under lipid- and oxygen-deprived conditions and defines a gene signature associated with poor survival in glioblastoma multiforme Oncogene 2015 34 5128 5140 10.1038/onc.2014.439 25619842 25. Lu L. Zhang Y. Yang Y. Jin M. Ma A. Wang X. Zhao Q. Zhang X. Zheng J. Zheng X. Lipid metabolism: The potential therapeutic targets in glioblastoma Cell Death Discov. 2025 11 107 10.1038/s41420-025-02390-3 40097417 PMC11914282 26. Kacem K. Lacombe P. Seylaz J. Bonvento G. Structural organization of the perivascular astrocyte endfeet and their relationship with the endothelial glucose transporter: A confocal microscopy study Glia 1998 23 1 10 10.1002/(SICI)1098-1136(199805)23:1&#x0003c;1::AID-GLIA1&#x0003e;3.0.CO;2-B 9562180 27. Boado R.J. Black K.L. Pardridge W.M. Gene expression of GLUT3 and GLUT1 glucose transporters in human brain tumors Brain Res. Mol. Brain Res. 1994 27 51 57 10.1016/0169-328X(94)90183-X 7877454 28. Libby C.J. Gc S. Benavides G.A. Fisher J.L. Williford S.E. Zhang S. Tran A.N. Gordon E.R. Jones A.B. Tuy K. A role for GLUT3 in glioblastoma cell invasion that is not recapitulated by GLUT1 Cell Adh Migr. 2021 15 101 115 10.1080/19336918.2021.1903684 33843470 PMC8043167 29. Obara-Michlewska M. Szeliga M. Targeting Glutamine Addiction in Gliomas Cancers 2020 12 310 10.3390/cancers12020310 32013066 PMC7072559 30. El Khayari A. Bouchmaa N. Taib B. Wei Z. Zeng A. El Fatimy R. Metabolic Rewiring in Glioblastoma Cancer: EGFR, IDH and Beyond Front. Oncol. 2022 12 901951 10.3389/fonc.2022.901951 35912242 PMC9329787 31. Ferrarese R. Izzo A. Andrieux G. Lagies S. Bartmuss J.P. Masilamani A.P. Wasilenko A. Osti D. Faletti S. Schulzki R. ZBTB18 inhibits SREBP-dependent lipid synthesis by halting CTBPs and LSD1 activity in glioblastoma Life Sci. Alliance 2023 6 e202201400 10.26508/lsa.202201400 36414381 PMC9684030 32. Geng F. Cheng X. Wu X. Yoo J.Y. Cheng C. Guo J.Y. Mo X. Ru P. Hurwitz B. Kim S.H. Inhibition of SOAT1 Suppresses Glioblastoma Growth via Blocking SREBP-1-Mediated Lipogenesis Clin. Cancer Res. 2016 22 5337 5348 10.1158/1078-0432.CCR-15-2973 27281560 PMC5093025 33. Kant S. Kesarwani P. Prabhu A. Graham S.F. Buelow K.L. Nakano I. Chinnaiyan P. Enhanced fatty acid oxidation provides glioblastoma cells metabolic plasticity to accommodate to its dynamic nutrient microenvironment Cell Death Dis. 2020 11 253 10.1038/s41419-020-2449-5 32312953 PMC7170895 34. Lin H. Patel S. Affleck V.S. Wilson I. Turnbull D.M. Joshi A.R. Maxwell R. Stoll E.A. Fatty acid oxidation is required for the respiration and proliferation of malignant glioma cells Neuro Oncol. 2017 19 43 54 10.1093/neuonc/now128 27365097 PMC5193020 35. Zhao J. Ma X. Gao P. Han X. Zhao P. Xie F. Liu M. Advancing glioblastoma treatment by targeting metabolism Neoplasia 2024 51 100985 10.1016/j.neo.2024.100985 38479191 PMC10950892 36. Miska J. Chandel N.S. Targeting fatty acid metabolism in glioblastoma J. Clin. Investig. 2023 133 e163448 10.1172/JCI163448 PMC9797338 36594473 37. Alzial G. Renoult O. Paris F. Gratas C. Clavreul A. Pecqueur C. Wild-type isocitrate dehydrogenase under the spotlight in glioblastoma Oncogene 2022 41 613 621 10.1038/s41388-021-02056-1 34764443 PMC8799461 38. Wahl D.R. Dresser J. Wilder-Romans K. Parsels J.D. Zhao S.G. Davis M. Zhao L. Kachman M. Wernisch S. Burant C.F. Glioblastoma Therapy Can Be Augmented by Targeting IDH1-Mediated NADPH Biosynthesis Cancer Res. 2017 77 960 970 10.1158/0008-5472.can-16-2008 27923831 PMC5726266 39. Yan H. Parsons D.W. Jin G. McLendon R. Rasheed B.A. Yuan W. Kos I. Batinic-Haberle I. Jones S. Riggins G.J. IDH1 and IDH2 mutations in gliomas N. Engl. J. Med. 2009 360 765 773 10.1056/NEJMoa0808710 19228619 PMC2820383 40. Ichimura K. Pearson D.M. Kocialkowski S. Backlund L.M. Chan R. Jones D.T. Collins V.P. IDH1 mutations are present in the majority of common adult gliomas but rare in primary glioblastomas Neuro Oncol. 2009 11 341 347 10.1215/15228517-2009-025 19435942 PMC2743214 41. Park C.K. Park I. Lee S. Sun C.H. Koh Y. Park S.H. Kim J.E. Yun H. Lee S.H. Genomic dynamics associated with malignant transformation in IDH1 mutated gliomas Oncotarget 2015 6 43653 43666 10.18632/oncotarget.6189 26524630 PMC4791257 42. Miki K. Yagi M. Hatae R. Otsuji R. Miyazaki T. Goto K. Setoyama D. Fujioka Y. Sangatsuda Y. Kuga D. Glutaminolysis is associated with mitochondrial pathway activation and can be therapeutically targeted in glioblastoma Cancer Metab. 2024 12 35 10.1186/s40170-024-00364-0 39563470 PMC11577891 43. Nakhle J. Khattar K. Ozkan T. Boughlita A. Abba Moussa D. Darlix A. Lorcy F. Rigau V. Bauchet L. Gerbal-Chaloin S. Mitochondria Transfer from Mesenchymal Stem Cells Confers Chemoresistance to Glioblastoma Stem Cells through Metabolic Rewiring Cancer Res. Commun. 2023 3 1041 1056 10.1158/2767-9764.CRC-23-0144 37377608 PMC10266428 44. Watson D.C. Bayik D. Storevik S. Moreino S.S. Sprowls S.A. Han J. Augustsson M.T. Lauko A. Sravya P. Rosland G.V. GAP43-dependent mitochondria transfer from astrocytes enhances glioblastoma tumorigenicity Nat. Cancer 2023 4 648 664 10.1038/s43018-023-00556-5 37169842 PMC10212766 45. Ikeda H. Kawase K. Nishi T. Watanabe T. Takenaga K. Inozume T. Ishino T. Aki S. Lin J. Kawashima S. Immune evasion through mitochondrial transfer in the tumour microenvironment Nature 2025 638 225 236 10.1038/s41586-024-08439-0 39843734 PMC11798832 46. Zhao Q. Li G. Identification of mitophagy-related genes impacting patient survival in glioma Discov. Oncol. 2025 16 140 10.1007/s12672-025-01916-6 39923213 PMC11807950 47. Wang J. Qiu X. Huang J. Zhuo Z. Chen H. Zeng R. Wu H. Guo K. Yang Q. Ye H. Development and validation of a novel mitophagy-related gene prognostic signature for glioblastoma multiforme BMC Cancer 2022 22 644 10.1186/s12885-022-09707-w 35692054 PMC9190154 48. Wang J. Chen A. Xue Z. Liu J. He Y. Liu G. Zhao Z. Li W. Zhang Q. Chen A. BCL2L13 promotes mitophagy through DNM1L-mediated mitochondrial fission in glioblastoma Cell Death Dis. 2023 14 585 10.1038/s41419-023-06112-4 37660127 PMC10475114 49. He C. Lu S. Wang X.Z. Wang C.C. Wang L. Liang S.P. Luo T.F. Wang Z.C. Piao M.H. Chi G.F. FOXO3a protects glioma cells against temozolomide-induced DNA double strand breaks via promotion of BNIP3-mediated mitophagy Acta Pharmacol. Sin. 2021 42 1324 1337 10.1038/s41401-021-00663-y 33879840 PMC8285492 50. Li X. Tie J. Sun Y. Gong C. Deng S. Chen X. Li S. Wang Y. Wang Z. Wu F. Targeting DNM1L/DRP1-FIS1 axis inhibits high-grade glioma progression by impeding mitochondrial respiratory cristae remodeling J. Exp. Clin. Cancer Res. 2024 43 273 10.1186/s13046-024-03194-6 39350223 PMC11440692 51. Huang T. Xu T. Wang Y. Zhou Y. Yu D. Wang Z. He L. Chen Z. Zhang Y. Davidson D. Cannabidiol inhibits human glioma by induction of lethal mitophagy through activating TRPV4 Autophagy 2021 17 3592 3606 10.1080/15548627.2021.1885203 33629929 PMC8632311 52. Adebayo M. Singh S. Singh A.P. Dasgupta S. Mitochondrial fusion and fission: The fine-tune balance for cellular homeostasis FASEB J. 2021 35 e21620 10.1096/fj.202100067R 34048084 PMC8415099 53. Eugenio-Perez D. Briones-Herrera A. Martinez-Klimova E. Pedraza-Chaverri J. Divide et Impera: Drp1-mediated Mitochondrial Fission in Glioma Malignancy Yale J. Biol. Med. 2019 92 423 433 31543706 PMC6747948 54. Wan Y.Y. Zhang J.F. Yang Z.J. Jiang L.P. Wei Y.F. Lai Q.N. Wang J.B. Xin H.B. Han X.J. Involvement of Drp1 in hypoxia-induced migration of human glioblastoma U251 cells Oncol. Rep. 2014 32 619 626 10.3892/or.2014.3235 24899388 55. Vasan K. Werner M. Chandel N.S. Mitochondrial Metabolism as a Target for Cancer Therapy Cell Metab. 2020 32 341 352 10.1016/j.cmet.2020.06.019 32668195 PMC7483781 56. Gatto L. Di Nunno V. Ghelardini A. Tosoni A. Bartolini S. Asioli S. Ratti S. Di Stefano A.L. Franceschi E. Targeting Mitochondria in Glioma: New Hopes for a Cure Biomedicines 2024 12 2730 10.3390/biomedicines12122730 39767637 PMC11727304 57. Aldape K. Brindle K.M. Chesler L. Chopra R. Gajjar A. Gilbert M.R. Gottardo N. Gutmann D.H. Hargrave D. Holland E.C. Challenges to curing primary brain tumours Nat. Rev. Clin. Oncol. 2019 16 509 520 10.1038/s41571-019-0177-5 30733593 PMC6650350 58. Duraj T. Garcia-Romero N. Carrion-Navarro J. Madurga R. Mendivil A.O. Prat-Acin R. Garcia-Canamaque L. Ayuso-Sacido A. Beyond the Warburg Effect: Oxidative and Glycolytic Phenotypes Coexist within the Metabolic Heterogeneity of Glioblastoma Cells 2021 10 202 10.3390/cells10020202 33498369 PMC7922554 59. Puchalski R.B. Shah N. Miller J. Dalley R. Nomura S.R. Yoon J.G. Smith K.A. Lankerovich M. Bertagnolli D. Bickley K. An anatomic transcriptional atlas of human glioblastoma Science 2018 360 660 663 10.1126/science.aaf2666 29748285 PMC6414061 60. Garofano L. Migliozzi S. Oh Y.T. D’Angelo F. Najac R.D. Ko A. Frangaj B. Caruso F.P. Yu K. Yuan J. Pathway-based classification of glioblastoma uncovers a mitochondrial subtype with therapeutic vulnerabilities Nat. Cancer 2021 2 141 156 10.1038/s43018-020-00159-4 33681822 PMC7935068 61. Shen H. Mudassar F. Ma S. Wang X. Nguyen S. Bal N. Huynh Q.-S. Wang D. Chang C. Ing P. Inhibition of mitochondrial bioenergetics and hypoxia to radiosensitize diffuse intrinsic pontine glioma Neuro-Oncology 2024 27 1061 1075 10.1093/neuonc/noae255 PMC12083227 39575457 62. Duan K. Liu Z.J. Hu S.Q. Huo H.Y. Xu Z.R. Ruan J.F. Sun Y. Dai L.P. Yan C.B. Xiong W. Lactic acid induces lactate transport and glycolysis/OXPHOS interconversion in glioblastoma Biochem. Biophys. Res. Commun. 2018 503 888 894 10.1016/j.bbrc.2018.06.092 29928884 63. Zeng S. Hu X. Lactic acidosis switches cancer cells from dependence on glycolysis to OXPHOS and renders them highly sensitive to OXPHOS inhibitors Biochem. Biophys. Res. Commun. 2023 671 46 57 10.1016/j.bbrc.2023.05.097 37295355 64. Vlashi E. Lagadec C. Vergnes L. Matsutani T. Masui K. Poulou M. Popescu R. Della Donna L. Evers P. Dekmezian C. Metabolic state of glioma stem cells and nontumorigenic cells Proc. Natl. Acad. Sci. USA 2011 108 16062 16067 10.1073/pnas.1106704108 21900605 PMC3179043 65. Chen X. Qian Y. Wu S. The Warburg effect: Evolving interpretations of an established concept Free Radic. Biol. Med. 2015 79 253 263 10.1016/j.freeradbiomed.2014.08.027 25277420 PMC4356994 66. Brisudova P. Stojanovic D. Novak J. Nahacka Z. Oliveira G.L. Vanatko O. Dvorakova S. Endaya B. Truksa J. Kubiskova M. Functional mitochondrial respiration is essential for glioblastoma tumour growth Oncogene 2025 44 2588 2603 10.1038/s41388-025-03429-6 40325182 PMC12277175 67. Vercellino I. Sazanov L.A. The assembly, regulation and function of the mitochondrial respiratory chain Nat. Rev. Mol. Cell Biol. 2022 23 141 161 10.1038/s41580-021-00415-0 34621061 68. Moura J.P. Oliveira P.J. Urbano A.M. Mitochondria: An overview of their origin, genome, architecture, and dynamics Biochim. Biophys. Acta Mol. Basis Dis. 2025 1871 167803 10.1016/j.bbadis.2025.167803 40118291 69. Perillo B. Di Donato M. Pezone A. Di Zazzo E. Giovannelli P. Galasso G. Castoria G. Migliaccio A. ROS in cancer therapy: The bright side of the moon Exp. Mol. Med. 2020 52 192 203 10.1038/s12276-020-0384-2 32060354 PMC7062874 70. Rinaldi M. Caffo M. Minutoli L. Marini H. Abbritti R.V. Squadrito F. Trichilo V. Valenti A. Barresi V. Altavilla D. ROS and Brain Gliomas: An Overview of Potential and Innovative Therapeutic Strategies Int. J. Mol. Sci. 2016 17 984 10.3390/ijms17060984 27338365 PMC4926513 71. Fuentes-Fayos A.C. ME G.G. Perez-Gomez J.M. Montero-Hidalgo A.J. Martin-Colom J. Doval-Rosa C. Blanco-Acevedo C. Torres E. Toledano-Delgado A. Sanchez-Sanchez R. Metformin and simvastatin exert additive antitumour effects in glioblastoma via senescence-state: Clinical and translational evidence EBioMedicine 2023 90 104484 10.1016/j.ebiom.2023.104484 36907105 PMC10024193 72. Shah S. Mansour H.M. Aguilar T.M. Lucke-Wold B. Advances in Anti-Cancer Drug Development: Metformin as Anti-Angiogenic Supplemental Treatment for Glioblastoma Int. J. Mol. Sci. 2024 25 5694 10.3390/ijms25115694 38891882 PMC11171521 73. Maraka S. Groves M.D. Mammoser A.G. Melguizo-Gavilanes I. Conrad C.A. Tremont-Lukats I.W. Loghin M.E. O’Brien B.J. Puduvalli V.K. Sulman E.P. Phase 1 lead-in to a phase 2 factorial study of temozolomide plus memantine, mefloquine, and metformin as postradiation adjuvant therapy for newly diagnosed glioblastoma Cancer 2019 125 424 433 10.1002/cncr.31811 30359477 PMC7180384 74. Yoon W.S. Chang J.H. Kim J.H. Kim Y.J. Jung T.Y. Yoo H. Kim S.H. Ko Y.C. Nam D.H. Kim T.M. Efficacy and safety of metformin plus low-dose temozolomide in patients with recurrent or refractory glioblastoma: A randomized, prospective, multicenter, double-blind, controlled, phase 2 trial (KNOG-1501 study) Discov. Oncol. 2023 14 90 10.1007/s12672-023-00678-3 37278858 PMC10244311 75. Shenouda G. Souhami L. Petrecca K. Owen S. Panet-Raymond V. Guiot M.C. Corredor A.G. Abdulkarim B. A Phase 2 Trial of Neoadjuvant Temozolomide Followed by Hypofractionated Accelerated Radiation Therapy with Concurrent and Adjuvant Temozolomide for Patients with Glioblastoma Int. J. Radiat. Oncol. Biol. Phys. 2017 97 487 494 10.1016/j.ijrobp.2016.11.006 28011051 76. Khurshed M. Molenaar R.J. van Linde M.E. Mathot R.A. Struys E.A. van Wezel T. van Noorden C.J.F. Klumpen H.J. Bovee J. Wilmink J.W. A Phase Ib Clinical Trial of Metformin and Chloroquine in Patients with IDH1-Mutated Solid Tumors Cancers 2021 13 2474 10.3390/cancers13102474 34069550 PMC8161333 77. Porper K. Shpatz Y. Plotkin L. Pechthold R.G. Talianski A. Champ C.E. Furman O. Shimoni-Sebag A. Symon Z. Amit U. A Phase I clinical trial of dose-escalated metabolic therapy combined with concomitant radiation therapy in high-grade glioma J. Neurooncol. 2021 153 487 496 10.1007/s11060-021-03786-8 34152528 78. Yap T.A. Daver N. Mahendra M. Zhang J. Kamiya-Matsuoka C. Meric-Bernstam F. Kantarjian H.M. Ravandi F. Collins M.E. Francesco M.E.D. Complex I inhibitor of oxidative phosphorylation in advanced solid tumors and acute myeloid leukemia: Phase I trials Nat. Med. 2023 29 115 126 10.1038/s41591-022-02103-8 36658425 PMC11975418 79. Janku F. Beom S.H. Moon Y.W. Kim T.W. Shin Y.G. Yim D.S. Kim G.M. Kim H.S. Kim S.Y. Cheong J.H. First-in-human study of IM156, a novel potent biguanide oxidative phosphorylation (OXPHOS) inhibitor, in patients with advanced solid tumors Investig. New Drugs 2022 40 1001 1010 10.1007/s10637-022-01277-9 35802288 PMC9395488 80. De L. Yuan T. Yong Z. ST1926 inhibits glioma progression through regulating mitochondrial complex II Biomed. Pharmacother. 2020 128 110291 10.1016/j.biopha.2020.110291 32526455 81. Kang Y.H. Lee E. Youk H.J. Kim S.H. Lee H.J. Park Y.G. Lim S.J. Potentiation by alpha-tocopheryl succinate of the etoposide response in multidrug resistance protein 1-expressing glioblastoma cells Cancer Lett. 2005 217 181 190 10.1016/j.canlet.2004.07.016 15617835 82. Min H.Y. Jang H.J. Park K.H. Hyun S.Y. Park S.J. Kim J.H. Son J. Kang S.S. Lee H.Y. The natural compound gracillin exerts potent antitumor activity by targeting mitochondrial complex II Cell Death Dis. 2019 10 810 10.1038/s41419-019-2041-z 31649278 PMC6813327 83. Bhattacharya K. Bag A.K. Tripathi R. Samanta S.K. Pal B.C. Shaha C. Mandal C. Mahanine, a novel mitochondrial complex-III inhibitor induces G0/G1 arrest through redox alteration-mediated DNA damage response and regresses glioblastoma multiforme Am. J. Cancer Res. 2014 4 629 647 25520856 PMC4266700 84. Chen M. Yin X. Lu C. Chen X. Ba H. Cai J. Sun J. Mahanine induces apoptosis, cell cycle arrest, inhibition of cell migration, invasion and PI3K/AKT/mTOR signalling pathway in glioma cells and inhibits tumor growth in vivo Chem. Biol. Interact. 2019 299 1 7 10.1016/j.cbi.2018.11.009 30468732 85. Cheng G. Hardy M. Topchyan P. Zander R. Volberding P. Cui W. Kalyanaraman B. Potent inhibition of tumour cell proliferation and immunoregulatory function by mitochondria-targeted atovaquone Sci. Rep. 2020 10 17872 10.1038/s41598-020-74808-0 33087770 PMC7578061 86. Petricciuolo M. Davidescu M. Fettucciari K. Gatticchi L. Brancorsini S. Roberti R. Corazzi L. Macchioni L. The efficacy of the anticancer 3-bromopyruvate is potentiated by antimycin and menadione by unbalancing mitochondrial ROS production and disposal in U118 glioblastoma cells Heliyon 2020 6 e05741 10.1016/j.heliyon.2020.e05741 33364504 PMC7753915 87. Kuramoto K. Suzuki S. Sakaki H. Takeda H. Sanomachi T. Seino S. Narita Y. Kayama T. Kitanaka C. Okada M. Licochalcone A specifically induces cell death in glioma stem cells via mitochondrial dysfunction FEBS Open Bio 2017 7 835 844 10.1002/2211-5463.12226 PMC5458486 28593138 88. Chiu H.W. Ho Y.S. Wang Y.J. Arsenic trioxide induces autophagy and apoptosis in human glioma cells in vitro and in vivo through downregulation of survivin J. Mol. Med. 2011 89 927 941 10.1007/s00109-011-0763-1 21594580 89. Kumthekar P. Grimm S. Chandler J. Mehta M. Marymont M. Levy R. Muro K. Helenowski I. McCarthy K. Fountas L. A phase II trial of arsenic trioxide and temozolomide in combination with radiation therapy for patients with malignant gliomas J. Neurooncol. 2017 133 589 594 10.1007/s11060-017-2469-x 28510787 90. Ryu S. Ye X. Olson J.J. Mikkelsen T. Bangiyev L. Lesser G.J. Batchelor T. Nabors B. Desideri S. Walbert T. Phase I and pharmacodynamic study of arsenic trioxide plus radiotherapy in patients with newly diagnosed glioblastoma Neuro-Oncol. Adv. 2024 6 vdae089 10.1093/noajnl/vdae089 PMC11229030 38978961 91. Lu J. Chew E.H. Holmgren A. Targeting thioredoxin reductase is a basis for cancer therapy by arsenic trioxide Proc. Natl. Acad. Sci. USA 2007 104 12288 12293 10.1073/pnas.0701549104 17640917 PMC1940330 92. Shi Y. Lim S.K. Liang Q. Iyer S.V. Wang H.Y. Wang Z. Xie X. Sun D. Chen Y.J. Tabar V. Gboxin is an oxidative phosphorylation inhibitor that targets glioblastoma Nature 2019 567 341 346 10.1038/s41586-019-0993-x 30842654 PMC6655586 93. Zou Y. Sun Y. Wang Y. Zhang D. Yang H. Wang X. Zheng M. Shi B. Cancer cell-mitochondria hybrid membrane coated Gboxin loaded nanomedicines for glioblastoma treatment Nat. Commun. 2023 14 4557 10.1038/s41467-023-40280-3 37507371 PMC10382535 94. Fiorillo M. Scatena C. Naccarato A.G. Sotgia F. Lisanti M.P. Bedaquiline, an FDA-approved drug, inhibits mitochondrial ATP production and metastasis in vivo, by targeting the gamma subunit (ATP5F1C) of the ATP synthase Cell Death Differ. 2021 28 2797 2817 10.1038/s41418-021-00788-x 33986463 PMC8408289 95. Rimle L. Pliatsika D. Arnold N. Kurth S. Kaiser M. Maser P. Kemmler M. Adams M. Riedl R. von Ballmoos C. Dissecting Structural Requirements of Leucinostatin A Derivatives for Antiprotozoal Activity and Mammalian Toxicity J. Med. Chem. 2025 68 4237 4258 10.1021/acs.jmedchem.4c01989 39952643 PMC11874012 96. Grimm S.A. Marymont M. Chandler J.P. Muro K. Newman S.B. Levy R.M. Jovanovic B. McCarthy K. Raizer J.J. Phase I study of arsenic trioxide and temozolomide in combination with radiation therapy in patients with malignant gliomas J. Neuro-Oncol. 2012 110 237 243 10.1007/s11060-012-0957-6 22875709 97. Cohen K.J. Gibbs I.C. Fisher P.G. Hayashi R.J. Macy M.E. Gore L. A phase I trial of arsenic trioxide chemoradiotherapy for infiltrating astrocytomas of childhood Neuro-Oncology 2013 15 783 787 10.1093/neuonc/not021 23460318 PMC3661102 98. Shim J.K. Choi S. Yoon S.J. Choi R.J. Park J. Lee E.H. Cho H.J. Lee S. Teo W.Y. Moon J.H. Etomoxir, a carnitine palmitoyltransferase 1 inhibitor, combined with temozolomide reduces stemness and invasiveness in patient-derived glioblastoma tumorspheres Cancer Cell Int. 2022 22 309 10.1186/s12935-022-02731-7 36221088 PMC9552483 99. Choi J. Smith D.M. Lee Y.J. Cai D. Hossain M.J. O’Connor T.J. Deme P. Haughey N.J. Scafidi S. Riddle R.C. Etomoxir repurposed as a promiscuous fatty acid mimetic chemoproteomic probe iScience 2024 27 110642 10.1016/j.isci.2024.110642 39252970 PMC11381838 100. Stuart S.D. Schauble A. Gupta S. Kennedy A.D. Keppler B.R. Bingham P.M. Zachar Z. A strategically designed small molecule attacks alpha-ketoglutarate dehydrogenase in tumor cells through a redox process Cancer Metab. 2014 2 4 10.1186/2049-3002-2-4 24612826 PMC4108059 101. Nguyen T.T. Torrini C. Shang E. Shu C. Mun J.Y. Gao Q. Humala N. Akman H.O. Zhang G. Westhoff M.A. OGDH and Bcl-xL loss causes synthetic lethality in glioblastoma JCI Insight 2024 9 e172565 10.1172/jci.insight.172565 38483541 PMC11141877 102. Alistar A. Morris B.B. Desnoyer R. Klepin H.D. Hosseinzadeh K. Clark C. Cameron A. Leyendecker J. D’Agostino R. Jr. Topaloglu U. Safety and tolerability of the first-in-class agent CPI-613 in combination with modified FOLFIRINOX in patients with metastatic pancreatic cancer: A single-centre, open-label, dose-escalation, phase 1 trial Lancet Oncol. 2017 18 770 778 10.1016/S1470-2045(17)30314-5 28495639 PMC5635818 103. Wei S. Yin D. Yu S. Lin X. Savani M.R. Du K. Ku Y. Wu D. Li S. Liu H. Antitumor Activity of a Mitochondrial-Targeted HSP90 Inhibitor in Gliomas Clin. Cancer Res. 2022 28 2180 2195 10.1158/1078-0432.CCR-21-0833 35247901 PMC9757132 104. Hayat U. Elliott G.T. Olszanski A.J. Altieri D.C. Feasibility and safety of targeting mitochondria for cancer therapy—Preclinical characterization of gamitrinib, a first-in-class, mitochondriaL-targeted small molecule Hsp90 inhibitor Cancer Biol. Ther. 2022 23 117 126 10.1080/15384047.2022.2029132 35129069 PMC8820820 105. Huang H. Zhang S. Li Y. Liu Z. Mi L. Cai Y. Wang X. Chen L. Ran H. Xiao D. Suppression of mitochondrial ROS by prohibitin drives glioblastoma progression and therapeutic resistance Nat. Commun. 2021 12 3720 10.1038/s41467-021-24108-6 34140524 PMC8211793 106. Liu X. Zhao P. Wang X. Wang L. Zhu Y. Song Y. Gao W. Celastrol mediates autophagy and apoptosis via the ROS/JNK and Akt/mTOR signaling pathways in glioma cells J. Exp. Clin. Cancer Res. 2019 38 184 10.1186/s13046-019-1173-4 31053160 PMC6500040 107. Liu X. Zhao P. Wang X. Wang L. Zhu Y. Gao W. Triptolide Induces Glioma Cell Autophagy and Apoptosis via Upregulating the ROS/JNK and Downregulating the Akt/mTOR Signaling Pathways Front. Oncol. 2019 9 387 10.3389/fonc.2019.00387 31157167 PMC6528693 108. Wen C. Wang H. Wu X. He L. Zhou Q. Wang F. Chen S. Huang L. Chen J. Wang H. ROS-mediated inactivation of the PI3K/AKT pathway is involved in the antigastric cancer effects of thioredoxin reductase-1 inhibitor chaetocin Cell Death Dis. 2019 10 809 10.1038/s41419-019-2035-x 31649256 PMC6813365 109. van Gisbergen M.W. Offermans K. Voets A.M. Lieuwes N.G. Biemans R. Hoffmann R.F. Dubois L.J. Lambin P. Mitochondrial Dysfunction Inhibits Hypoxia-Induced HIF-1alpha Stabilization and Expression of Its Downstream Targets Front. Oncol. 2020 10 770 10.3389/fonc.2020.00770 32509579 PMC7248342 110. Valdes-Rives S.A. Casique-Aguirre D. German-Castelan L. Velasco-Velazquez M.A. Gonzalez-Arenas A. Apoptotic Signaling Pathways in Glioblastoma and Therapeutic Implications Biomed. Res. Int. 2017 2017 7403747 10.1155/2017/7403747 29259986 PMC5702396 111. Rana R. Huirem R.S. Kant R. Chauhan K. Sharma S. Yashavarddhan M.H. Chhabra S.S. Acharya R. Kalra S.K. Gupta A. Cytochrome C as a potential clinical marker for diagnosis and treatment of glioma Front. Oncol. 2022 12 960787 10.3389/fonc.2022.960787 36176404 PMC9513483 112. Allen J.E. Krigsfeld G. Mayes P.A. Patel L. Dicker D.T. Patel A.S. Dolloff N.G. Messaris E. Scata K.A. Wang W. Dual inactivation of Akt and ERK by TIC10 signals Foxo3a nuclear translocation, TRAIL gene induction, and potent antitumor effects Sci. Transl. Med. 2013 5 171ra117 10.1126/scitranslmed.3004828 PMC4535715 23390247 113. Ishizawa J. Kojima K. Chachad D. Ruvolo P. Ruvolo V. Jacamo R.O. Borthakur G. Mu H. Zeng Z. Tabe Y. ATF4 induction through an atypical integrated stress response to ONC201 triggers p53-independent apoptosis in hematological malignancies Sci. Signal. 2016 9 ra17 10.1126/scisignal.aac4380 26884599 PMC4815038 114. Madhukar N.S. Khade P.K. Huang L. Gayvert K. Galletti G. Stogniew M. Allen J.E. Giannakakou P. Elemento O. A Bayesian machine learning approach for drug target identification using diverse data types Nat. Commun. 2019 10 5221 10.1038/s41467-019-12928-6 31745082 PMC6863850 115. Duchatel R.J. Mannan A. Woldu A.S. Hawtrey T. Hindley P.A. Douglas A.M. Jackson E.R. Findlay I.J. Germon Z.P. Staudt D. Preclinical and clinical evaluation of German-sourced ONC201 for the treatment of H3K27M-mutant diffuse intrinsic pontine glioma Neurooncol. Adv. 2021 3 vdab169 10.1093/noajnl/vdab169 34988452 PMC8709907 116. Chi A.S. Tarapore R.S. Hall M.D. Shonka N. Gardner S. Umemura Y. Sumrall A. Khatib Z. Mueller S. Kline C. Pediatric and adult H3 K27M-mutant diffuse midline glioma treated with the selective DRD2 antagonist ONC201 J. Neurooncol. 2019 145 97 105 10.1007/s11060-019-03271-3 31456142 PMC7241441 117. Caragher S.P. Shireman J.M. Huang M. Miska J. Atashi F. Baisiwala S. Hong Park C. Saathoff M.R. Warnke L. Xiao T. Activation of Dopamine Receptor 2 Prompts Transcriptomic and Metabolic Plasticity in Glioblastoma J. Neurosci. 2019 39 1982 1993 10.1523/JNEUROSCI.1589-18.2018 30651332 PMC6507082 118. Staley A. Tucker K. Yin Y. Zhang X. Fan Y. Zhang Y. Fang Z. Sun W. Suo H. Zhao X. Highly potent dopamine receptor D2 antagonist ONC206 demonstrates anti-tumorigenic activity in endometrial cancer Am. J. Cancer Res. 2021 11 5374 5387 10.1016/j.ygyno.2020.05.372 34873466 PMC8640798 119. Ishizawa J. Zarabi S.F. Davis R.E. Halgas O. Nii T. Jitkova Y. Zhao R. St-Germain J. Heese L.E. Egan G. Mitochondrial ClpP-Mediated Proteolysis Induces Selective Cancer Cell Lethality Cancer Cell 2019 35 721 737.e9 10.1016/j.ccell.2019.03.014 31056398 PMC6620028 120. Graves P.R. Aponte-Collazo L.J. Fennell E.M.J. Graves A.C. Hale A.E. Dicheva N. Herring L.E. Gilbert T.S.K. East M.P. McDonald I.M. Mitochondrial Protease ClpP is a Target for the Anticancer Compounds ONC201 and Related Analogues ACS Chem. Biol. 2019 14 1020 1029 10.1021/acschembio.9b00222 31021596 PMC6528275 121. Kline C.L.B. Ralff M.D. Lulla A.R. Wagner J.M. Abbosh P.H. Dicker D.T. Allen J.E. El-Deiry W.S. Role of Dopamine Receptors in the Anticancer Activity of ONC201 Neoplasia 2018 20 80 91 10.1016/j.neo.2017.10.002 29216597 PMC5725157 122. Nouri K. Feng Y. Schimmer A.D. Mitochondrial ClpP serine protease-biological function and emerging target for cancer therapy Cell Death Dis. 2020 11 841 10.1038/s41419-020-03062-z 33037181 PMC7547079 123. Przystal J.M. Cianciolo Cosentino C. Yadavilli S. Zhang J. Laternser S. Bonner E.R. Prasad R. Dawood A.A. Lobeto N. Chin Chong W. Imipridones affect tumor bioenergetics and promote cell lineage differentiation in diffuse midline gliomas Neuro Oncol. 2022 24 1438 1451 10.1093/neuonc/noac041 35157764 PMC9435508 124. Jackson E.R. Persson M.L. Fish C.J. Findlay I.J. Mueller S. Nazarian J. Hulleman E. van der Lugt J. Duchatel R.J. Dun M.D. A review of current therapeutics targeting the mitochondrial protease ClpP in diffuse midline glioma, H3 K27-altered Neuro Oncol. 2024 26 S136 S154 10.1093/neuonc/noad144 37589388 PMC11066926 125. McLeod C. Gout A.M. Zhou X. Thrasher A. Rahbarinia D. Brady S.W. Macias M. Birch K. Finkelstein D. Sunny J. St. Jude Cloud: A Pediatric Cancer Genomic Data-Sharing Ecosystem Cancer Discov. 2021 11 1082 1099 10.1158/2159-8290.CD-20-1230 33408242 PMC8102307 126. Petralia F. Tignor N. Reva B. Koptyra M. Chowdhury S. Rykunov D. Krek A. Ma W. Zhu Y. Ji J. Integrated Proteogenomic Characterization across Major Histological Types of Pediatric Brain Cancer Cell 2020 183 1962 1985.e31 10.1016/j.cell.2020.10.044 33242424 PMC8143193 127. Fennell E.M.J. Aponte-Collazo L.J. Wynn J.D. Drizyte-Miller K. Leung E. Greer Y.E. Graves P.R. Iwanowicz A.A. Ashamalla H. Holmuhamedov E. Characterization of TR-107, a novel chemical activator of the human mitochondrial protease ClpP Pharmacol. Res. Perspect. 2022 10 e00993 10.1002/prp2.993 35929764 PMC9354705 128. Giarrizzo M. LaComb J.F. Patel H.R. Reddy R.G. Haley J.D. Graves L.M. Iwanowicz E.J. Bialkowska A.B. TR-107, an Agonist of Caseinolytic Peptidase Proteolytic Subunit, Disrupts Mitochondrial Metabolism and Inhibits the Growth of Human Colorectal Cancer Cells Mol. Cancer Ther. 2024 23 1761 1778 10.1158/1535-7163.MCT-24-0170 39233476 PMC11614700 129. Thang M. Mellows C. Kass L.E. Daglish S. Fennell E.M.J. Mann B.E. Mercer-Smith A.R. Valdivia A. Graves L.M. Hingtgen S.D. Combining the constitutive TRAIL-secreting induced neural stem cell therapy with the novel anti-cancer drug TR-107 in glioblastoma Mol. Ther. Oncol. 2024 32 200834 10.1016/j.omton.2024.200834 39045029 PMC11263637 130. Stein M.N. Bertino J.R. Kaufman H.L. Mayer T. Moss R. Silk A. Chan N. Malhotra J. Rodriguez L. Aisner J. First-in-Human Clinical Trial of Oral ONC201 in Patients with Refractory Solid Tumors Clin. Cancer Res. 2017 23 4163 4169 10.1158/1078-0432.CCR-16-2658 28331050 PMC7595575 131. Arrillaga-Romany I. Chi A.S. Allen J.E. Oster W. Wen P.Y. Batchelor T.T. A phase 2 study of the first imipridone ONC201, a selective DRD2 antagonist for oncology, administered every three weeks in recurrent glioblastoma Oncotarget 2017 8 79298 79304 10.18632/oncotarget.17837 29108308 PMC5668041 132. Gardner S.L. Tarapore R.S. Allen J. McGovern S.L. Zaky W. Odia Y. Daghistani D. Diaz Z. Hall M.D. Khatib Z. Phase I dose escalation and expansion trial of single agent ONC201 in pediatric diffuse midline gliomas following radiotherapy Neurooncol. Adv. 2022 4 vdac143 10.1093/noajnl/vdac143 36382108 PMC9639395 133. Cantor E. Wierzbicki K. Tarapore R.S. Ravi K. Thomas C. Cartaxo R. Nand Yadav V. Ravindran R. Bruzek A.K. Wadden J. Serial H3K27M cell-free tumor DNA (cf-tDNA) tracking predicts ONC201 treatment response and progression in diffuse midline glioma Neuro Oncol. 2022 24 1366 1374 10.1093/neuonc/noac030 35137228 PMC9340643 134. Batsios G. Udutha S. Taglang C. Gillespie A.M. Lau B. Ji S. Phoenix T. Mueller S. Venneti S. Koschmann C. GABA production induced by imipridones is a targetable and imageable metabolic alteration in diffuse midline gliomas Neuro-Oncology 2024 26 viii291 10.1093/neuonc/noae165.1154 135. Venneti S. Kawakibi A.R. Ji S. Waszak S.M. Sweha S.R. Mota M. Pun M. Deogharkar A. Chung C. Tarapore R.S. Clinical Efficacy of ONC201 in H3K27M-Mutant Diffuse Midline Gliomas Is Driven by Disruption of Integrated Metabolic and Epigenetic Pathways Cancer Discov. 2023 13 2370 2393 10.1158/2159-8290.CD-23-0131 37584601 PMC10618742 136. Lee J.V. Berry C.T. Kim K. Sen P. Kim T. Carrer A. Trefely S. Zhao S. Fernandez S. Barney L.E. Acetyl-CoA promotes glioblastoma cell adhesion and migration through Ca(2+)-NFAT signaling Genes Dev. 2018 32 497 511 10.1101/gad.311027.117 29674394 PMC5959234 137. Liu Y. Chen C. Wang X. Sun Y. Zhang J. Chen J. Shi Y. An Epigenetic Role of Mitochondria in Cancer Cells 2022 11 2518 10.3390/cells11162518 36010594 PMC9406960 138. Bassal M.A. The Interplay between Dysregulated Metabolism and Epigenetics in Cancer Biomolecules 2023 13 944 10.3390/biom13060944 37371524 PMC10296273 139. Jiang X. Liu B. Nie Z. Duan L. Xiong Q. Jin Z. Yang C. Chen Y. The role of m6A modification in the biological functions and diseases Signal Transduct. Target. Ther. 2021 6 74 10.1038/s41392-020-00450-x 33611339 PMC7897327 140. Yokogami K. Kikuchi T. Watanabe T. Nakatake Y. Yamashita S. Mizuguchi A. Takeshima H. Methionine regulates self-renewal, pluripotency, and cell death of GIC through cholesterol-rRNA axis BMC Cancer 2022 22 1351 10.1186/s12885-022-10280-5 36564758 PMC9789638 141. Jia G. Fu Y. Zhao X. Dai Q. Zheng G. Yang Y. Yi C. Lindahl T. Pan T. Yang Y.G. N6-methyladenosine in nuclear RNA is a major substrate of the obesity-associated FTO Nat. Chem. Biol. 2011 7 885 887 10.1038/nchembio.687 22002720 PMC3218240 142. Fu Y. Dominissini D. Rechavi G. He C. Gene expression regulation mediated through reversible m 6 Nat. Rev. Genet. 2014 15 293 306 10.1038/nrg3724 24662220 143. Matilainen O. Quiros P.M. Auwerx J. Mitochondria and Epigenetics—Crosstalk in Homeostasis and Stress Trends Cell Biol. 2017 27 453 463 10.1016/j.tcb.2017.02.004 28274652 144. Chowdhury R. Yeoh K.K. Tian Y.M. Hillringhaus L. Bagg E.A. Rose N.R. Leung I.K. Li X.S. Woon E.C. Yang M. The oncometabolite 2-hydroxyglutarate inhibits histone lysine demethylases EMBO Rep. 2011 12 463 469 10.1038/embor.2011.43 21460794 PMC3090014 145. Kaundal B. Karmakar S. Roy Choudhury S. Mitochondria-targeting nano therapy altering IDH2-mediated EZH2/EZH1 interaction as precise epigenetic regulation in glioblastoma Biomater. Sci. 2022 10 5301 5317 10.1039/d1bm02006d 35917200 146. Zhang X. Dang C.V. Time to hit pause on mitochondria-targeting cancer therapies Nat. Med. 2023 29 29 30 10.1038/s41591-022-02129-y 36658424 PMC11892798 147. Zhang Y. Huntington K.E. Seyhan A.A. Tapinos N. Lulla R.R. Monje M. Wong E.T. Chen C.C. El-Deiry W.S. Reduced EZH1/2 expression in imipridone-treated cells correlates with synergy following combinations with EZH1/2 or HDAC inhibitors in diffuse glioma and other tumors Am. J. Cancer Res. 2025 15 1307 1320 10.62347/dzat5333 40226473 PMC11982711 148. Nguyen T.T.T. Shang E. Schiffgens S. Torrini C. Shu C. Akman H.O. Prabhu V.V. Allen J.E. Westhoff M.A. Karpel-Massler G. Induction of Synthetic Lethality by Activation of Mitochondrial ClpP and Inhibition of HDAC1/2 in Glioblastoma Clin. Cancer Res. 2022 28 1881 1895 10.1158/1078-0432.ccr-21-2857 35417530 PMC9118753 149. Singh D. A sojourn on mitochondria targeted drug delivery systems for cancer: Strategies, clinical and future prospects Mitochondrion 2024 74 101826 10.1016/j.mito.2023.101826 38092248 Figure 1 Mitochondrial dysfunction drives glioma progression and treatment resistance. Mitochondrial dysfunction involves both metabolic rewiring and aberrant quality control. Metabolic rewiring is characterized by the Warburg effect, a reliance on glycolysis even in the presence of oxygen. To meet metabolic demands, glioma cells upregulate glucose and glutamine influx, while removing excess lactate. Mitochondrial quality is controlled in several ways: mitochondrial transfer from adjacent cells via tunneling actin nanotubules, upregulation of mitochondrial fission, and general upregulation of mitophagy levels. Red exclamation symbols are used to represent mitochondrial dysfunction. Green arrows are used to represent upregulation. The image was created with BioRender.com Figure 2 Mitochondrial-Epigenetic Crosstalk in Glioma. Mitochondrial metabolites are linked to the activity of epigenetic enzymes. The red stars indicate mutant IDH. The image was created with BioRender.com cancers-17-03062-t001_Table 1 Table 1 Clinical Trials employing OXPHOS inhibitors to treat High-Grade Glioma. Mechanism of Action Interventions Clinical Trials (with NCT Identifier from ClinicalTrials.gov) Phase Status Starting Year Results ETC Complex I inhibitor Metformin NCT05929495 II Not yet recruiting 2023 No results posted.   NCT05183204 II Recruiting 2022 No results posted.   NCT04945148 II Recruiting 2024 No results posted.   NCT04691960 II Recruiting 2016 No results posted.   NCT03243851 II Completed 2016 Although the metformin plus temozolomide regimen was well tolerated, it did not confer a clinical benefit in patients with recurrent or refractory GBM. The median OS was 17.22 months (95% CI 12.19–21.68 months) in the experimental group and 7.69 months (95% CI 5.16–22.67 months) in the control group, showing no significant difference by the log-rank test (HR: 0.78; 95% CI 0.39–1.58; p 74   NCT02780024 II Active, not recruiting 2015 The addition of metformin to the Adjuvant Temozolomide and hypofractionated accelerated radiotherapy regimen resulted in an encouraging improvement of the median OS compared with adjuvant temozolomide and hypofractionated accelerated radiotherapy alone. The main impact was observed in patients with unmethylated MGMT tumors [ 75   NCT02496741 I/II Completed 2015 The treatment of advanced IDH1-mutated solid tumors with metformin and chloroquine was well tolerated but did not induce a clinical response in this phase Ib clinical trial [ 76   NCT02149459 I Completed 2014 The intervention was fairly well tolerated; however, only moderate ketones levels were obtained. Metformin use and dietary intake were associated with higher serum ketone levels. The recommended phase II dose is the 8 weeks of a low-carbohydrate diet combined with 850 mg metformin twice daily [ 77   NCT01430351 I Active, not recruiting 2011 Memantine, mefloquine, and metformin can be combined safely with TMZ in patients with newly diagnosed glioblastoma [ 73  IACS-010759 NCT03291938 I Completed 2017 IACS-010759 had a narrow therapeutic index with emergent dose-limiting toxicities, including elevated blood lactate and neurotoxicity, which obstructed efforts to maintain target exposure. Consequently, no recommended Phase II dose was established, only modest target inhibition and limited antitumor activity were observed at tolerated doses, and both trials were discontinued [ 78  IM156 NCT03272256 I Completed 2017 800 mg daily of oral IM156 was determined as the recommended Phase II dose. Observed adverse effects were manageable and stable disease was the best response [ 79 ETC Complex IV inhibitor Arsenic trioxide NCT00720564 I Completed 2008 Completed. No results posted.   NCT00275067 I/II Completed 2005 Adding Arsenic Trioxide to radiotherapy and TMZ is feasible with no increased side effects. The addition of arsenic did not improve overall survival in glioblastoma patients as compared to historic data [ 89   NCT00185861 I Completed 2003 Arsenic Trioxide up to 0.25 mg/kg dose combined with stereotactic radiation is very well-tolerated for recurrent malignant glioma. Given the positive initial response and tolerability, phase II trials in patients with Malignant glioma are encouraged [ 96   NCT00095771 I Completed 2004 Arsenic Trioxide in addition to radiation therapy was given to children with newly diagnosed anaplastic astrocytoma, glioblastoma, or diffuse intrinsic pontine glioma. Arsenic Trioxide was well tolerated throughout the entire dose escalation, resulting in confirmation of safety when administered 5 days per week during irradiation. The recommended dose of Arsenic Trioxide during conventional irradiation is 0.15 mg/kg given on a daily basis with each fraction of radiation therapy administered [ 97   NCT00045565 I Completed 2002 Arsenic Trioxide with standard radiation is well tolerated in patients with newly diagnosed glioblastoma. Even without temozolomide or adjuvant therapy, the overall survival of all patients (17.7 months) and especially patients who received biweekly ATO (22.8 months) is surprising and accompanied by pharmacodynamic changes on MRI. Further studies of this regimen are warranted [ 90 ATP synthase/Complex V inhibitor Gboxin NCT06806228 I Enrolling by Invitation 2025 No results posted. cancers-17-03062-t002_Table 2 Table 2 Clinical Trials employing Imipridones to treat High-Grade Glioma. Mechanism of Action Interventions Clinical Trials (with NCT Identifier from ClinicalTrials.gov) Phase Status Year Started Results ClpP Agonist ONC201 NCT05580562 III Recruiting 2023 No results posted.   NCT05476939 III Recruiting 2022 No results posted.   NCT05009992 II Recruiting 2021 No results posted.   NCT04854044 I Withdrawn (The P.I. is not prepared to move forward at this time) 2021 No results posted.   NCT04629209 II Withdrawn (change in study approach) 2024 No results posted.   NCT04617002 Expanded Access Available 2020 No results posted.   NCT03416530 I Terminated * 2018 Twenty-four of thirty patients were enrolled following radiation but prior to recurrence; six of thirty patients were enrolled with recurrent disease. Patient survival data was combined with data from NCT03134131 n 135   NCT03295396 II Active, not recruiting 2017 No results posted.   NCT03134131 Expanded Access No longer available 2017 Twenty-four of thirty patients were enrolled following radiation but prior to recurrence; six of thirty patients were enrolled with recurrent disease. Patient survival data was combined with data from NCT03416530 n 135   NCT02525692 II Terminated * 2016 Among the 14 patients with recurrent disease prior to initiation of ONC201 treatment, median progression-free survival is 14 weeks, and the median OS is 17 weeks. Among the 4 pediatric patients enrolled, 2 DIPG patients remain progression-free for at least 53 and 81 weeks [ 116   NCT02038699 I/II Withdrawn ** 2014 No results posted.  ONC206 NCT04732065 I Recruiting 2021 No results posted.   NCT04541082 I Recruiting 2020 No results posted. * Terminated by an administrative protocol amendment. Decision to terminate the study was not related to any safety concerns of ONC201. ** Withdrawn prior to enrollment for unspecified reasons. ",
  "metadata": {
    "Title of this paper": "A sojourn on mitochondria targeted drug delivery systems for cancer: Strategies, clinical and future prospects",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468196/"
  }
}