{
  "title": "Paper_1105",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468583 PMC12468583.1 12468583 12468583 41020837 10.3390/cimb47090715 cimb-47-00715 1 Review Metformin as a Disease-Modifying Agent in Autosomal Dominant Polycystic Kidney Disease: A Systematic Review of Preclinical and Clinical Evidence https://orcid.org/0009-0008-5709-0269 Maciejczyk Aleksandra 1 2 https://orcid.org/0000-0002-8592-8814 Niemczyk Mariusz 1 2 * Campagna Roberto Academic Editor 1 2 * mariusz.niemczyk@wum.edu.pl 03 9 2025 9 2025 47 9 497442 715 22 7 2025 25 8 2025 02 9 2025 03 09 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Autosomal dominant polycystic kidney disease (ADPKD) is a common inherited kidney disorder marked by cyst growth and progressive renal failure. This systematic review aims to summarize current preclinical and clinical evidence on the potential role of metformin in ADPKD, focusing on its effects on glucose metabolism, kidney function, inflammation, and survival. A comprehensive search was conducted in PubMed and Google Scholar up to June 2025, following PRISMA guidelines. Forty-two articles met the inclusion criteria and were analyzed. Included studies examined metformin use in ADPKD patients or models and reported outcomes such as renal function, cyst growth, metabolic markers, and mortality. In preclinical studies, it reduced cyst formation, improved kidney structure, and decreased inflammation. Clinical studies confirmed its safety and suggested benefits in slowing kidney function decline, especially in early-stage ADPKD. Metformin may be a promising supportive therapy in ADPKD due to its metabolic and anti-inflammatory effects. metformin autosomal dominant polycystic kidney disease ADPKD inflammation CKD progression This study did not receive any external funding from commercial, governmental, or non-profit organizations. All work, including literature search, data analysis, and manuscript preparation, was conducted using institutional resources available to the authors. The absence of external financial support underscores the independent nature of this review and enhances its transparency and credibility. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Autosomal dominant polycystic kidney disease (ADPKD) is the most common inherited kidney disorder, affecting approximately 1 in 400 to 1000 individuals worldwide [ 1 2 3 4 5 6 7 8 Recent studies have highlighted the presence of glucose metabolism abnormalities in patients with ADPKD, which may play a role in disease progression. These findings have prompted a growing interest in repurposing metabolic agents to target both the systemic and renal-specific aspects of ADPKD pathophysiology. Among these, metformin—a widely used oral antihyperglycemic agent for type 2 diabetes mellitus (T2DM)—has emerged as a promising candidate. Metformin exerts its primary effects via activation of AMP-activated protein kinase (AMPK), a cellular energy sensor that modulates metabolic homeostasis [ 9 Given the metabolic alterations observed in ADPKD and the mechanistic rationale for AMPK activation, this review aims to explore the potential therapeutic benefits of metformin in ADPKD. Unlike previous reviews, it integrates metabolic, immunological, and clinical aspects into a unified perspective, highlighting how mitochondrial modulation, energy metabolism, and signaling pathways converge in cyst growth. Moreover, it proposes future therapeutic directions by comparing metformin with other emerging agents, such as tolvaptan, thereby offering a broader translational context. Emphasis will be placed on its role in correcting glucose metabolism disturbances, its impact on disease progression and renal outcomes, and its potential to improve hard clinical endpoints such as renal failure and mortality. 2. Materials and Methods (PRISMA Guidelines) This systematic review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) 2020 guidelines [ 10 Figure 1 To identify relevant studies, a comprehensive search of two major electronic databases—PubMed and Google Scholar—was performed up to June 2025. The search strategy employed a combination of controlled vocabulary and free-text terms, including: “metformin”, “AMPK activator”, “autosomal dominant polycystic kidney disease”, “ADPKD”, “renal function”, “eGFR”, “cyst growth”, and “mortality”. Boolean operators (“AND” and “OR”) were used to optimize the retrieval of relevant articles. In addition to database searching, the reference lists of included studies were manually screened to identify any additional eligible articles. Studies were included if they involved individuals with ADPKD models of the disease, used metformin either alone or in combination with other drugs, and assessed relevant outcomes such as glucose metabolism, kidney function (e.g., eGFR, kidney volume), mortality, cyst burden, inflammatory markers, or systemic complications. Only articles published in English or Polish were considered. Eligible study types included randomized controlled trials, cohort studies (prospective and retrospective), case-control and observational studies, preclinical experiments (in vivo and in vitro), as well as literature reviews. Editorials, letters to the editor, commentaries, conference abstracts without full data, and studies not primarily focused on metformin use in ADPKD were excluded. To ensure a systematic and transparent approach to study selection, the eligibility criteria were defined according to the PICO framework (Population, Intervention, Comparator, Outcome), commonly used in systematic reviews. Specifically, the population (P) included patients or animal models with autosomal dominant polycystic kidney disease (ADPKD); the intervention (I) was treatment with metformin; the comparator (C) was absence of metformin treatment; and the outcomes (O) included progression of renal function (e.g., eGFR decline), mortality, cyst burden, inflammation, or glucose metabolism. For each clinical outcome, we assessed the certainty of evidence using the Grading of Recommendations Assessment, Development and Evaluation (GRADE) approach across five domains: risk of bias, inconsistency, indirectness, imprecision and publication bias. Randomized controlled trials were initially rated as high certainty and observational studies as low certainty, with subsequent downgrading or upgrading as appropriate. Risk of bias was judged using RoB 2 for randomized trials and ROBINS-I for non-randomized studies. Preclinical data (in vitro and animal studies) were not graded and were considered as mechanistic context only. Following the database search, all identified records were imported into a citation management tool, and duplicates were removed. Full-text articles of potentially eligible studies were then retrieved and assessed in detail based on the inclusion and exclusion criteria. In total, 42 studies met all eligibility criteria and were included in the final review. This methodology enabled the integration of diverse data sources while maintaining a structured and reproducible approach, in alignment with PRISMA standards for systematic reviews. 3. Results and Discussion 3.1. Metformin and Mitochondrial Function in ADPKD In ADPKD, cystic renal epithelial cells exhibit profound mitochondrial dysfunction, with impaired oxidative phosphorylation and excess ROS production that drives cyst growth [ 11 12 11 13 11 12 3.2. Pathophysiology of ADPKD ADPKD is a kidney disorder caused in majority of patients by mutations in the PKD1 or PKD2 genes, which encode polycystin-1 and polycystin-2, respectively. These proteins form a functional complex in the primary cilium of tubular epithelial cells and regulate intracellular calcium signaling, cell polarity, and mechanosensation. Disruption of polycystin function leads to reduced calcium influx, which in turn elevates intracellular cyclic AMP (cAMP) levels. Increased cAMP activates protein kinase A (PKA), driving proliferation of cyst-lining epithelial cells and stimulating CFTR-mediated chloride and fluid secretion, which contributes to cyst enlargement. Additionally, downstream signaling cascades such as B-Raf/MEK/ERK and mTOR are overactivated, promoting further cell growth and cystogenesis [ 14 Another hallmark of ADPKD is loss of planar cell polarity, which leads to misoriented cell division and abnormal tubular architecture. Interstitial inflammation, epithelial–mesenchymal transition (EMT), and fibrosis accompany cyst expansion and accelerate the decline in kidney function. Emerging evidence also implicates dysregulated microRNAs (miRNAs) in ADPKD progression. Specific miRNAs (e.g., miR-21, miR-17) modulate gene networks involved in cell proliferation, apoptosis, and fibrosis, representing potential therapeutic targets [ 14 Altogether, the pathogenesis of ADPKD involves a complex interplay of ciliary dysfunction, calcium and cAMP signaling disturbances, hyperproliferation, fluid secretion, inflammation, and fibrosis, leading to progressive cyst growth and loss of renal function over time. 3.3. Anti-Inflammatory and Molecular Mechanisms of Metformin in ADPKD Metformin demonstrates significant anti-inflammatory activity, which may be of relevance in the pathophysiology of ADPKD. Chronic low-grade inflammation is increasingly recognized as a contributor to cyst growth, interstitial fibrosis, and disease progression. Metformin’s actions on several inflammatory mediators and intracellular signaling pathways may thus play a disease-modifying role in polycystic kidney disease. At the molecular level, metformin activates AMPK, a central regulator of energy and redox homeostasis, which in turn suppresses the nuclear factor-κB (NF-κB) pathway—a master regulator of pro-inflammatory gene transcription [ 15 16 15 Notably, metformin also modulates the Toll-like receptor 4 (TLR4) cascade and reduces the activity of high mobility group box 1 (HMGB1), an alarmin that promotes inflammatory responses in damaged tissues. HMGB1, a validated direct binding target of metformin, acts as an endogenous ligand of TLR4 and can activate downstream inflammatory signaling including NF-κB and MAPK pathways. By directly suppressing HMGB1 release and binding, metformin interrupts this inflammatory loop [ 15 Additional anti-inflammatory mechanisms of metformin involve attenuation of caspase-3 and caspase-8 activation—proteases involved in apoptosis and inflammation—as well as modulation of oxidative stress via nuclear factor erythroid 2-related factor 2 (NRF2) [ 15 Furthermore, the ability of metformin to suppress TGF-β signaling—a major fibrogenic and pro-inflammatory cytokine—provides another potential avenue for its antifibrotic and nephroprotective effects [ 15 17 3.4. Effects on Carbohydrate Metabolism in ADPKD ADPKD is increasingly recognized not only as a structural renal disorder but also as a condition marked by profound metabolic disturbances, particularly in carbohydrate metabolism [ 9 18 19 20 21 Furthermore, impaired insulin signaling and glucose intolerance are frequently observed in ADPKD patients, exacerbating systemic metabolic derangements. Metformin, a widely used antidiabetic drug, may counteract these abnormalities through its activation of AMP-activated protein kinase (AMPK) [ 22 23 24 25 3.5. Progression of Renal Failure in ADPKD A substantial body of preclinical and clinical evidence suggests that metformin may attenuate the progression of renal dysfunction in ADPKD through modulation of key cystogenic and metabolic signaling pathways [ 26 27 28 29 30 31 30 31 32 33 34 In translational and clinical settings, the efficacy and safety of metformin have been evaluated in several studies. A phase II double-blinded randomized placebo-controlled trial conducted by Seliger et al. [ 35 2 35 36 37 Importantly, meta-analytical data support these observations. In a 2022 network meta-analysis, metformin was found to preserve GFR with a standardized mean difference (SMD) of 0.28 (−0.05; 0.61) compared to placebo, indicating a trend toward renoprotection, although not reaching statistical significance ( p 5 p 5 Recent Cochrane analyses further explored metformin’s effects in randomized controlled trials. In pooled data from Brosnahan et al. and the TAME-PKD 2018 study (n = 71), the mean difference in change in eGFR between metformin and placebo was 2.82 mL/min/1.73 m 2 p 38 38 38 Quantitative data from pooled analyses and subgroup analyses further suggest a potential benefit of metformin in slowing renal function decline. In one experimental cohort, the mean difference in eGFR decline between metformin-treated and control patients was 2.31 mL/min/1.73 m 2 p 7 2 37 39 2 2 40 In addition to monotherapy, metformin has demonstrated additive effects when used in combination with other agents targeting metabolic pathways. Co-administration of metformin with 2-deoxyglucose (2-DG) in ADPKD miniature pigs markedly reduced renal cyst formation and improved renal function by influencing enzymes involved in glycolysis and cellular proliferation [ 13 28 The cumulative evidence supports metformin as a potentially effective and safe disease-modifying agent in ADPKD. Its mechanism positions metformin as a promising adjunct or alternative to current therapies, such as tolvaptan, especially in individuals with metabolic alterations or rapidly progressing cyst burden. Continued investigation through large-scale randomized controlled trials will be essential to confirm its long-term impact on renal survival and to define the optimal patient population for targeted intervention. 3.6. Mortality in ADPKD: Potential Impact of Metformin Observational studies have shown that metformin use is associated with reduced all-cause mortality in patients with stage G3 CKD, as demonstrated by Roussel [ 41 42 43 44 Preclinical studies have further supported this, with metformin administration in Pkd1-deficient mice showing no elevation in mortality despite some model-dependent adverse effects on renal morphology [ 45 2 24 40 A summary of the most relevant preclinical and clinical studies evaluating the effects of metformin in ADPKD is presented in Table 1 3.7. Potential Variations in Metformin Efficacy by Sex, CKD Stage, and Diabetes Status While metformin has shown promise as a disease-modifying therapy in ADPKD, emerging evidence suggests that its efficacy and safety may vary depending on the individual patient’s characteristics, including sex, CKD stage, and presence of diabetes. Data on sex-specific responses to metformin in ADPKD are limited. Although not yet directly demonstrated in ADPKD, prior pharmacokinetic and endocrinological studies suggest that sex-related hormonal differences may influence metformin’s activity, particularly through modulation of AMPK signaling [ 46 47 The stage of kidney disease appears to influence both the efficacy and tolerability of metformin. In patients with early-stage CKD (G1–G3a), metformin has been associated with a slower decline in eGFR, as reported in studies by Seliger et al. [ 35 39 2 25 45 Type 2 diabetes is an important modifier of ADPKD progression and may enhance metformin’s therapeutic impact. Diabetic patients often exhibit upregulation of glucose- and insulin-sensitive pathways, potentially amplifying metformin’s effects. In a retrospective analysis by Pisani et al. [ 37 41 3.8. Comparative Section: Metformin Versus Tolvaptan Tolvaptan, a selective vasopressin V2 receptor antagonist, remains the only approved disease-modifying treatment for ADPKD with proven efficacy in slowing disease progression. However, its use is frequently limited by adverse effects, particularly polyuria. In a randomized, double-blind, placebo-controlled crossover study, Kramers et al. [ 9 p 9 A secondary analysis of the TEMPO 3:4 and REPRISE phase III trials by Stanley et al. [ 48 48 Beyond clinical trials, experimental data from rodent models also support the potential benefits of metformin. Efe et al. [ 49 49 Collectively, these findings indicate that metformin may represent a safe adjunctive or alternative therapeutic strategy in ADPKD, particularly in patients who experience significant aquaretic side effects from tolvaptan or have concomitant diabetes. While tolvaptan remains the gold standard for direct disease modification, metformin may offer indirect renal benefits via modulation of metabolic pathways such as AMPK, mTOR, and CFTR. Ongoing phase III clinical trials (e.g., IMPEDE-PKD, NCT04939935 50 48 It should be emphasized that the therapeutic considerations presented in this review are based on preliminary studies and mechanistic reasoning rather than confirmed clinical trial evidence. To date, no large randomized controlled trials have demonstrated the efficacy of metformin in patients with ADPKD, and all proposed strategies should therefore be regarded as exploratory and subject to further validation. The therapeutic recommendations discussed here should be interpreted cautiously and primarily as hypothesis-generating. Ensuring a balanced description of various agents and strategies is also important, to avoid overemphasis on those with limited or heterogeneous evidence. 4. Discussion This systematic review, conducted in accordance with the PRISMA guidelines, consolidates current evidence on the effects of metformin in ADPKD, highlighting its potential as a disease-modifying agent. The synthesis of data from both preclinical and clinical studies indicates that metformin, primarily via AMPK activation, may attenuate cyst growth, reduce fluid secretion, and preserve renal function [ 7 8 51 27 This review encompasses a wide spectrum of evidence ranging from in vitro experiments and animal models to small clinical pilot trials and meta-analyses. Such diversity allows for a comprehensive overview of the topic but simultaneously limits the strength of the conclusions. Findings derived from animal and cellular studies are essential for elucidating molecular mechanisms; however, their translatability to the human population remains restricted. Similarly, small-scale clinical trials and pilot studies are prone to systematic bias and low statistical power, which may lead to overestimation of treatment effects. Moreover, the variability of outcome measures, including eGFR, TKV and metabolic biomarkers, hampers direct comparability and complicates synthesis across studies. Consequently, data interpretation should be undertaken with caution, and future research should aim to standardize methodology and harmonize clinical endpoints to improve reliability and reproducibility. Our findings suggest several key directions for future research. First, stratified analysis and precision medicine approaches should be incorporated in upcoming RCTs to identify patient subgroups most likely to benefit from metformin. Evidence from included studies points toward a greater therapeutic impact in early-stage disease, whereas some later-stage models demonstrated neutral or even adverse effects, potentially due to lactate-driven activation of pro-cystogenic pathways [ 52 Second, optimal dosing strategies and safety thresholds require further clarification. Although current guidelines permit metformin use in patients with an eGFR ≥ 30 mL/min/1.73 m 2 25 NCT04939935 50 Third, the potential for combinatorial therapy deserves special attention. Several preclinical studies included in this review demonstrated synergistic effects when metformin was used. Moreover, novel kidney-targeted delivery systems (e.g., micelles, nanoparticles) have shown potential to enhance renal bioavailability and minimize systemic toxicity. These strategies should be prioritized in future translational research to improve therapeutic efficacy and safety [ 53 An additional consideration relates to the safety and feasibility of metformin therapy in the ADPKD population. Metformin is generally well tolerated; however, the risk of lactic acidosis, particularly in patients with reduced renal function, remains a relevant concern. Common adverse effects such as gastrointestinal intolerance (e.g., nausea, diarrhea) may also limit adherence in some patients. Careful monitoring of renal function and metabolic parameters is therefore necessary, and dose adjustments may be required in advanced CKD or in patients undergoing dialysis. These factors highlight the need for well-designed clinical studies to determine the real-world safety and feasibility of metformin in ADPKD. While this review was conducted using PRISMA methodology to ensure a comprehensive and unbiased synthesis of the current literature, several limitations must be acknowledged. First, the included studies were heterogeneous in design, patient population, metformin dosing, and outcome measures, limiting the ability to conduct meta-analytic pooling. Second, most clinical data were derived from small-scale studies or secondary analyses, and often lacked comparator arms, blinding, or long-term follow-up. Third, confounding factors such as concurrent use of the renin–angiotensin–aldosterone system (RAAS) inhibitors, differences in baseline kidney function, and genetic variability (e.g., PKD1 vs. PKD2) were often insufficiently controlled or reported. Heterogeneity of study populations represents an important limitation of the current evidence base. The included studies enrolled patients of different ages, disease stages, and comorbidities, such as type 2 diabetes, which may substantially influence treatment response and outcomes. This variability makes it challenging to generalize mechanistic conclusions across all individuals with ADPKD. For example, the potential benefits of metformin might be more pronounced in patients at earlier stages of the disease, when renal reserve is preserved, than in those with advanced nephropathy. Recognizing this heterogeneity is essential to avoid overgeneralization and highlights the need for future studies with stratified designs that account for disease stage and relevant comorbid conditions 5. Conclusions This systematic review highlights the emerging role of metformin as a potential disease-modifying therapy in ADPKD, although large randomized controlled trials are still lacking. The novel contribution of this review lies in its integrated approach, combining mechanistic insights with clinical evidence and outlining new therapeutic strategies, including the potential of metformin as a complementary or alternative option to established treatments. Through AMPK activation, metformin may attenuate cyst growth, improve renal outcomes, modulate glucose metabolism, and exert anti-inflammatory effects. While preclinical and early clinical studies suggest a favorable impact on disease progression and systemic complications, the current evidence remains insufficient to support routine clinical use in ADPKD. High-quality, large-scale randomized controlled trials are necessary to validate these findings, determine optimal patient selection and dosing, and explore long-term effects on renal survival, mortality, and quality of life. Until such data become available, metformin should be considered a promising but investigational option in the therapeutic landscape of ADPKD. Disclaimer/Publisher’s Note: Author Contributions A.M. data collection and analysis, writing the manuscript, final approval; M.N., idea and design of the study, data analysis, writing the manuscript, final approval. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest related to the content of this review. All analyses and interpretations were performed independently and without any influence from external entities. The affiliations of the authors are limited to academic institutions and did not bias the assessment or presentation of the available evidence. The manuscript has been prepared in accordance with established ethical standards and principles of good scientific practice, ensuring objectivity and integrity. References 1. Torres V.E. Harris P.C. Autosomal dominant polycystic kidney disease: The last 3 years Kidney Int. 2009 76 149 168 10.1038/ki.2009.128 19455193 PMC2812475 2. Perrone R.D. Abebe K.Z. Watnick T.J. Althouse A.D. Hallows K.R. Lalama C.M. Miskulin D.C. Seliger S.L. Tao C. Harris P.C. Primary results of the randomized trial of metformin administration in polycystic kidney disease (TAME PKD) Kidney Int. 2021 100 684 696 10.1016/j.kint.2021.06.013 34186056 PMC8801184 3. Quiroga B. Torra R. Dietary Aspects and Drug-Related Side Effects in Autosomal Dominant Polycystic Kidney Disease Progression Nutrients 2022 14 4651 10.3390/nu14214651 36364911 PMC9658114 4. Cornec-Le Gall E. Alam A. Perrone R.D. Autosomal dominant polycystic kidney disease Lancet 2019 393 919 935 10.1016/S0140-6736(18)32782-X 30819518 5. Tsukamoto S. Urate S. Yamada T. Azushima K. Yamaji T. Kinguchi S. Uneda K. Kanaoka T. Wakui H. Tamura K. Comparative Efficacy of Pharmacological Treatments for Adults With Autosomal Dominant Polycystic Kidney Disease: A Systematic Review and Network Meta-Analysis of Randomized Controlled Trials Front. Pharmacol. 2022 13 885457 10.3389/fphar.2022.885457 35662736 PMC9158498 6. Chebib F.T. Torres V.E. Autosomal Dominant Polycystic Kidney Disease: Core Curriculum 2016 Am. J. Kidney Dis. 2016 67 792 810 10.1053/j.ajkd.2015.07.037 26530876 PMC4837006 7. Yao F. Huang S.Q. Cheng X.S. Li K. Jiang X.L. Metformin reduces decline in the estimated glomerular filtration rate during progression of autosomal dominant polycystic kidney disease: A systematic review and meta-analysis Eur. Rev. Med. Pharmacol. Sci. 2023 27 11904 11912 10.26355/eurrev_202312_34789 38164854 8. Song A. Zhang C. Meng X. Mechanism and application of metformin in kidney diseases: An update Biomed. Pharmacother. 2021 138 111454 10.1016/j.biopha.2021.111454 33714781 9. Kramers B.J. Koorevaar I.W. van Gastel M.D.A. van Goor H. Hallows K.R. Heerspink H.L. Li H. Leonhard W.N. Peters D.J.M. Qiu J. Effects of Hydrochlorothiazide and Metformin on Aquaresis and Nephroprotection by a Vasopressin V2 Receptor Antagonist in ADPKD: A Randomized Crossover Trial Clin. J. Am. Soc. Nephrol. 2022 17 507 517 10.2215/CJN.11260821 35314480 PMC8993480 10. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 statement: An updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 11. Gao J. Yu X. Metabolic Reprogramming in Autosomal Dominant Polycystic Kidney Disease: Role in Cystogenesis and Novel Therapeutic Approaches Biomedicines 2025 13 1596 10.3390/biomedicines13071596 40722668 PMC12292442 12. Vial G. Detaille D. Guigas B. Role of Mitochondria in the Mechanism(s) of Action of Metformin Front. Endocrinol. 2019 10 294 10.3389/fendo.2019.00294 31133988 PMC6514102 13. Lian X. Wu X. Li Z. Zhang Y. Song K. Cai G. Li Q. Lin S. Chen X. Bai X.Y. The combination of metformin and 2-deoxyglucose significantly inhibits cyst formation in miniature pigs with polycystic kidney disease Br. J. Pharmacol. 2019 176 711 724 10.1111/bph.14558 30515768 PMC6365356 14. Reiterová J. Tesař V. Autosomal Dominant Polycystic Kidney Disease: From Pathophysiology of Cystogenesis to Advances in the Treatment Int. J. Mol. Sci. 2022 23 3317 10.3390/ijms23063317 35328738 PMC8949594 15. Sakata N. The anti-inflammatory effect of metformin: The molecular targets Genes Cells 2024 29 183 191 10.1111/gtc.13098 38311861 PMC11448366 16. Zhu H. Jia Z. Li Y.R. Danelisen I. Molecular mechanisms of action of metformin: Latest advances and therapeutic implications Clin. Exp. Med. 2023 23 2941 2951 10.1007/s10238-023-01051-y 37016064 PMC10072049 17. LaMoia T.E. Shulman G.I. Cellular and Molecular Mechanisms of Metformin Action Endocr. Rev. 2021 42 77 96 10.1210/endrev/bnaa023 32897388 PMC7846086 18. Dachy A. Decuypere J.P. Vennekens R. Jouret F. Mekahli D. Is autosomal dominant polycystic kidney disease an early sweet disease? Pediatr. Nephrol. 2022 37 1945 1955 10.1007/s00467-021-05406-z 34988697 19. Caplan M.J. AMPK and Polycystic Kidney Disease Drug Development: An Interesting Off-Target Target Front. Med. 2022 9 753418 10.3389/fmed.2022.753418 35174190 PMC8841847 20. Carullo N. Zicarelli M.T. Casarella A. Nicotera R. Castagna A. Urso A. Presta P. Andreucci M. Russo E. Bolignano D. Retarding Progression of Chronic Kidney Disease in Autosomal Dominant Polycystic Kidney Disease with Metformin and Other Therapies: An Update of New Insights Int. J. Gen. Med. 2021 14 5993 6000 10.2147/IJGM.S305491 34588803 PMC8473846 21. Nauli S.M. Alenghat F.J. Luo Y. Williams E. Vassilev P. Li X. Elia A.E. Lu W. Brown E.M. Quinn S.J. Polycystins 1 and 2 mediate mechanosensation in the primary cilium of kidney cells Nat. Genet. 2003 33 129 137 10.1038/ng1076 12514735 22. Zhou G. Myers R. Li Y. Chen Y. Shen X. Fenyk-Melody J. Wu M. Ventre J. Doebber T. Fujii N. Role of AMP-activated protein kinase in mechanism of metformin action J. Clin. Investig. 2001 108 1167 1174 10.1172/JCI13505 11602624 PMC209533 23. Hawley S.A. Gadalla A.E. Olsen G.S. Hardie D.G. The antidiabetic drug metformin activates the AMP-activated protein kinase cascade via an adenine nucleotide-independent mechanism Diabetes 2002 51 2420 2425 10.2337/diabetes.51.8.2420 12145153 24. Hallows K.R. Abebe K.Z. Li H. Saitta B. Althouse A.D. Bae K.T. Lalama C.M. Miskulin D.C. Perrone R.D. Seliger S.L. Association of Longitudinal Urinary Metabolic Biomarkers With ADPKD Severity and Response to Metformin in TAME-PKD Clinical Trial Participants Kidney Int. Rep. 2023 8 467 477 10.1016/j.ekir.2022.11.019 36938071 PMC10014337 25. Rhee C.M. Kalantar-Zadeh K. Diabetes mellitus: Complex interplay between metformin, AKI and lactic acidosis Nat. Rev. Nephrol. 2017 13 521 522 10.1038/nrneph.2017.105 28736433 PMC5922434 26. Liang D. Song Z. Liang W. Li Y. Liu S. Metformin inhibits TGF-beta 1-induced MCP-1 expression through BAMBI-mediated suppression of MEK/ERK1/2 signalling Nephrology 2019 24 481 488 10.1111/nep.13430 29934960 27. Devuyst O. Ahn C. Barten T.R.M. Brosnahan G. Cadnapaphornchai M.A. Chapman A.B. Cornec-Le Gall E. Drenth J.P.H. Gansevoort R.T. Harris P.C. KDIGO 2025 Clinical Practice Guideline for the Evaluation, Management, and Treatment of Autosomal Dominant Polycystic Kidney Disease (ADPKD) Kidney Int. 2025 107 S1 S239 10.1016/j.kint.2024.07.009 39848759 28. Zhao J. Ma Y. Zhang Y. Fu B. Wu X. Li Q. Cai G. Chen X. Bai X.Y. Low-dose 2-deoxyglucose and metformin synergically inhibit proliferation of human polycystic kidney cells by modulating glucose metabolism Cell Death Discov. 2019 5 76 10.1038/s41420-019-0156-8 30886744 PMC6411866 29. Langer S. Kreutz R. Eisenreich A. Metformin modulates apoptosis and cell signaling of human podocytes under high glucose conditions J. Nephrol. 2016 29 765 773 10.1007/s40620-015-0258-1 26733332 30. Foretz M. Hébrard S. Leclerc J. Zarrinpashneh E. Soty M. Mithieux G. Sakamoto K. Andreelli F. Viollet B. Metformin inhibits hepatic gluconeogenesis in mice independently of the LKB1/AMPK pathway via a decrease in hepatic energy state J. Clin. Investig. 2010 120 2355 2369 10.1172/JCI40671 20577053 PMC2898585 31. Takiar V. Nishio S. Seo-Mayer P. King J.D. Jr. Li H. Zhang L. Karihaloo A. Hallows K.R. Somlo S. Caplan M.J. Activating AMP-activated protein kinase (AMPK) slows renal cystogenesis Proc. Natl. Acad. Sci. USA 2011 108 2462 2467 10.1073/pnas.1011498108 21262823 PMC3038735 32. Doctor R.B. Johnson S. Brodsky K.S. Amura C.R. Gattone V. Fitz J.G. Regulated ion transport in mouse liver cyst epithelial cells Biochim. Biophys. Acta 2007 1772 345 354 10.1016/j.bbadis.2006.11.006 17208416 33. Pastor-Soler N.M. Li H. Pham J. Rivera D. Ho P.Y. Mancino V. Saitta B. Hallows K.R. Metformin improves relevant disease parameters in an autosomal dominant polycystic kidney disease mouse model Am. J. Physiol. Ren. Physiol. 2022 322 F27 F41 10.1152/ajprenal.00298.2021 34806449 34. Chang M.Y. Ma T.L. Hung C.C. Tian Y.C. Chen Y.C. Yang C.W. Cheng Y.C. Metformin Inhibits Cyst Formation in a Zebrafish Model of Polycystin-2 Deficiency Sci. Rep. 2017 7 7161 10.1038/s41598-017-07300-x 28769124 PMC5541071 35. Seliger S.L. Abebe K.Z. Hallows K.R. Miskulin D.C. Perrone R.D. Watnick T. Bae K.T. A Randomized Clinical Trial of Metformin to Treat Autosomal Dominant Polycystic Kidney Disease Am. J. Nephrol. 2018 47 352 360 10.1159/000488807 29779024 PMC6010317 36. Sorohan B.M. Ismail G. Andronesi A. Micu G. Obrișcă B. Jurubiță R. Sinescu I. Baston C. A single-arm pilot study of metformin in patients with autosomal dominant polycystic kidney disease BMC Nephrol. 2019 20 276 10.1186/s12882-019-1463-2 31337351 PMC6651959 37. Pisani A. Riccio E. Bruzzese D. Sabbatini M. Metformin in autosomal dominant polycystic kidney disease: Experimental hypothesis or clinical fact? BMC Nephrol. 2018 19 282 10.1186/s12882-018-1090-3 30348113 PMC6196463 38. St Pierre K. Cashmore B.A. Bolignano D. Zoccali C. Ruospo M. Craig J.C. Strippoli G.F. Mallett A.J. Green S.C. Tunnicliffe D.J. Interventions for preventing the progression of autosomal dominant polycystic kidney disease Cochrane Database Syst. Rev. 2024 10 Cd010294 10.1002/14651858.CD010294.pub3 39356039 PMC11445802 39. Brosnahan G.M. Wang W. Gitomer B. Struemph T. George D. You Z. Nowak K.L. Klawitter J. Chonchol M.B. Metformin Therapy in Autosomal Dominant Polycystic Kidney Disease: A Feasibility Study Am. J. Kidney Dis. 2022 79 518 526 10.1053/j.ajkd.2021.06.026 34391872 PMC8837717 40. Seliger S.L. Watnick T. Althouse A.D. Perrone R.D. Abebe K.Z. Hallows K.R. Miskulin D.C. Bae K.T. Baseline Characteristics and Patient-Reported Outcomes of ADPKD Patients in the Multicenter TAME-PKD Clinical Trial Kidney360 2020 1 1363 1372 10.34067/KID.0004002020 33768205 PMC7990324 41. Roussel R. Travert F. Pasquet B. Wilson P.W. Smith S.C. Jr. Goto S. Ravaud P. Marre M. Porath A. Bhatt D.L. Metformin use and mortality among patients with diabetes and atherothrombosis Arch. Intern. Med. 2010 170 1892 1899 10.1001/archinternmed.2010.409 21098347 42. Ekström N. Schiöler L. Svensson A.M. Eeg-Olofsson K. Miao Jonasson J. Zethelius B. Cederholm J. Eliasson B. Gudbjörnsdottir S. Effectiveness and safety of metformin in 51 675 patients with type 2 diabetes and different levels of renal function: A cohort study from the Swedish National Diabetes Register BMJ Open 2012 2 e001076 10.1136/bmjopen-2012-001076 PMC3400073 22798258 43. Marcum Z.A. Forsberg C.W. Moore K.P. de Boer I.H. Smith N.L. Boyko E.J. Floyd J.S. Mortality Associated with Metformin Versus Sulfonylurea Initiation: A Cohort Study of Veterans with Diabetes and Chronic Kidney Disease J. Gen. Intern. Med. 2018 33 155 165 10.1007/s11606-017-4219-3 29181788 PMC5789109 44. Charytan D.M. Solomon S.D. Ivanovich P. Remuzzi G. Cooper M.E. McGill J.B. Parving H.H. Parfrey P. Singh A.K. Burdmann E.A. Metformin use and cardiovascular events in patients with type 2 diabetes and chronic kidney disease Diabetes Obes. Metab. 2019 21 1199 1208 10.1111/dom.13642 30672083 45. Chang M.Y. Tsai C.Y. Chou L.F. Hsu S.H. Yang H.Y. Hung C.C. Tian Y.C. Ong A.C.M. Yang C.W. Metformin induces lactate accumulation and accelerates renal cyst progression in Pkd1-deficient mice Hum. Mol. Genet. 2022 31 1560 1573 10.1093/hmg/ddab340 34957500 46. Froldi G. View on Metformin: Antidiabetic and Pleiotropic Effects, Pharmacokinetics, Side Effects, and Sex-Related Differences Pharmaceuticals 2024 17 478 10.3390/ph17040478 38675438 PMC11054066 47. Zhou K. Bellenguez C. Spencer C.C. Bennett A.J. Coleman R.L. Tavendale R. Hawley S.A. Donnelly L.A. Schofield C. Groves C.J. Common variants near ATM are associated with glycemic response to metformin in type 2 diabetes Nat. Genet. 2011 43 117 120 10.1038/ng.735 21186350 PMC3030919 48. Stanley I.K. Palma A.M. Viecelli A.K. Johnson D.W. Hawley C.M. Staatz C.E. Mallett A.J. A secondary analysis of concurrent use of metformin and tolvaptan in ADPKD tolvaptan trials J. Nephrol. 2024 37 1417 1419 10.1007/s40620-024-01906-x 38512373 PMC11405464 49. Efe O. Klein J.D. LaRocque L.M. Ren H. Sands J.M. Metformin improves urine concentration in rodents with nephrogenic diabetes insipidus JCI Insight 2016 1 e88409 10.1172/jci.insight.88409 27478876 PMC4966685 50. Pierre K.S. El-Damanawi R. Johnson D.W. Hawley C.M. Viecelli A.K. Jha V. Green S.C. Gesualdo L. Kiriwandeniya C. Velayudham P. Implementation of Metformin Therapy to Ease Decline of Kidney Function in Polycystic Kidney Disease (IMPEDE-PKD): Study protocol for a phase III, multi-centre, randomized, placebo-controlled trial evaluating the long-term efficacy of metformin in slowing the rate of kidney function decline in patients with autosomal dominant polycystic kidney disease Trials 2025 26 302 40855441 10.1186/s13063-025-09010-6 PMC12376749 51. Okyere P. Ephraim R.K.D. Okyere I. Attakorah J. Serwaa D. Essuman G. Abaka-Yawson A. Adoba P. Demographic, diagnostic and therapeutic characteristics of autosomal dominant polycystic kidney disease in Ghana BMC Nephrol. 2021 22 156 10.1186/s12882-021-02336-8 33910506 PMC8080413 52. Wang W. You Z. Steele C.N. Gitomer B. Chonchol M. Nowak K.L. Changes in tubular biomarkers with dietary intervention and metformin in patients with autosomal dominant polycystic kidney disease: A post-hoc analysis of two clinical trials BMC Nephrol. 2024 25 206 10.1186/s12882-024-03643-6 38918734 PMC11200847 53. Jiang K. Huang Y. Chung E.J. Combining Metformin and Drug-Loaded Kidney-Targeting Micelles for Polycystic Kidney Disease Cell Mol. Bioeng. 2023 16 55 67 10.1007/s12195-022-00753-9 36660586 PMC9842834 Figure 1 PRISMA 2020 flow diagram illustrating the process of study selection for inclusion in the systematic review. * PubMed, Google Scholar; ** editorials, letters to the editor, commentaries, conference abstracts without full data, studies not primarily focused on the topic. cimb-47-00715-t001_Table 1 Table 1 Summary of preclinical and clinical studies evaluating the effects of metformin in ADPKD. Study Model/Participants Endpoints Key Findings Takiar et al. [ 31 In vitro, ex vivo Cystic growth, CFTR/mTOR activity AMPK activation via metformin inhibited cyst growth Pastor-Soler et al. [ 33 Pkd1RC/RC mice Kidney/body weight ratio, cystic index, GFR, BUN Reduced cystic index, improved renal function Chang et al. [ 34 Zebrafish, polycystin-2 deficiency Cyst formation, autophagy, inflammation Reduced cystogenesis and inflammation Seliger et al. [ 35 ADPKD patients (RCT) eGFR decline Slower eGFR decline vs. placebo Sorohan et al. [ 36 34 ADPKD patients (pilot) eGFR, BMI No significant change; confirmed safety Pisani et al. [ 37 Diabetic ADPKD patients vs. controls GFR loss Lower GFR loss in metformin group Tsukamoto et al. [ 5 Meta-analysis GFR preservation Trend toward benefit (SMD = 0.28, p St Pierre et al. [ 38 RCTs (Brosnahan, TAME-PKD) eGFR change, failure Trend toward slower eGFR decline Yao et al. [ 7 Meta-analysis eGFR eGFR benefit (MD = 2.31 mL/min/1.73 m 2 Lian et al. [ 13 Miniature pigs Cyst formation, renal function Synergistic effect, improved renal function Kramers et al. [ 9 ADPKD patients Urine volume, QOL Reduced polyuria with tolvaptan ",
  "metadata": {
    "Title of this paper": "Combining Metformin and Drug-Loaded Kidney-Targeting Micelles for Polycystic Kidney Disease",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468583/"
  }
}