{
  "title": "Paper_160",
  "abstract": "pmc Chest Chest 886 chest Chest 0012-3692 1931-3543 American College of Chest Physicians PMC12489387 PMC12489387.1 12489387 12489387 40074060 10.1016/j.chest.2025.02.029 S0012-3692(25)00279-X 1 Critical Care: Guidelines and Consensus Statements Transfusion of Fresh Frozen Plasma and Platelets in Critically Ill Adults An American College of Chest Physicians Clinical Practice Guideline Coz Yataco Angel MD cozyata@ccf.org a b ∗ Soghier Israa MD c d Hébert Paul C. MD e Belley-Cote Emilie MD f Disselkamp Margaret MD g Flynn David MS h Halvorson Karin MD i Iaccarino Jonathan M. MD d Lim Wendy MD j Lindenmeyer Christina C. MD k Miller Peter J. MD l O'Neil Kevin MD m Pendleton Kathryn M. MD n Vande Vusse Lisa MD o Ouellette Daniel R. MD p a b c d e f g h i j k l m n o p ∗ CORRESPONDENCE TO: cozyata@ccf.org 9 2025 10 3 2025 168 3 498160 661 676 10 03 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background Platelets and fresh frozen plasma (FFP) are frequently administered to critically ill patients. Considering the variability in indications and thresholds guiding these transfusions, a comprehensive review of current evidence was conducted to provide guidance to critical care practitioners. This American College of Chest Physicians guideline examined the literature on platelet transfusions in critically ill patients with thrombocytopenia, with and without active bleeding, as well as data on prophylactic platelet and FFP transfusions for common procedures in the critical care setting. Methods A panel of experts developed 7 Population, Intervention, Comparator, and Outcome questions addressing platelet and FFP transfusions in critically ill patients and performed a comprehensive evidence review. The panel applied the Grading of Recommendations, Assessment, Development, and Evaluations approach to assess the certainty of evidence, and to formulate and grade recommendations. A modified Delphi technique was used to reach consensus on the recommendations. Results The initial search identified a total of 7,172 studies, and after the initial screening, 100 articles were reviewed. Sixteen studies met inclusion criteria, comprising 1 randomized controlled trial and 15 observational studies. Overall, the certainty of the evidence for all questions was very low. The panel formulated 7 conditional recommendations. Conclusions In critically ill patients with thrombocytopenia or coagulopathy, a risk/benefit assessment should be made by providers prior to transfusion of platelets or FFP. Given the known risks of blood product transfusion, and the limited data regarding the benefits from platelet or FFP transfusion, most patients will benefit from avoiding transfusion of these blood products. In patients at high risk of bleeding, or where the bleeding complication may be catastrophic, transfusion should be considered. Key Words arterial line bronchoscopy central line critically ill fresh frozen plasma lumbar puncture paracentesis platelets thoracentesis transfusion pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations ASCO American Society of Clinical Oncology BSH British Society for Haematology CHEST American College of Chest Physicians CVC central venous catheter DIC disseminated intravascular coagulation ESICM European Society of Intensive Care Medicine FFP fresh frozen plasma GI gastrointestinal GRADE Grading of Recommendations, Assessment, Development, and Evaluations IMPROVE International Medical Prevention Registry on Venous Thromboembolism INR international normalized ratio LOS length of stay LP lumbar puncture PICO Population, Intervention, Comparator, and Outcome RCT randomized controlled trial RR risk ratio SIR Society of Interventional Radiology WHO World Health Organization Summary of Recommendations The recommendations in this document apply to critically ill patients, excluding trauma and neuro-critical care populations. These recommendations should be implemented in a hierarchal fashion. Recommendations 1-3 should be applied first to critically ill patients with thrombocytopenia, while recommendations 4-7 provide additional guidance for specific situations involving invasive procedures. 1. In stable non-bleeding critically ill patients with thrombocytopenia and without high risk of spontaneous bleeding, we suggest transfusing platelets if platelet counts fall below 10 × 10 9 2. In stable non-bleeding critically ill patients with thrombocytopenia who are considered at high risk of spontaneous bleeding, we suggest transfusing platelets if platelet counts fall below 30-50 × 10 9 3. In critically ill patients with thrombocytopenia and serious active bleeding, we suggest transfusing platelets if platelet counts fall below 50 × 10 9  4. Vascular procedures 4A. In critically ill patients at increased risk of bleeding due to thrombocytopenia undergoing a central venous catheter (CVC) or arterial line insertion, we suggest against routine prophylactic platelet transfusion 4B. In critically ill patients at increased risk of bleeding due to coagulopathy undergoing a CVC or arterial line insertion, we suggest against routine prophylactic fresh frozen plasma ( FFP ) transfusion  5. Bedside thoracic or abdominal procedure 5A. In critically ill patients with increased risk of bleeding due to thrombocytopenia undergoing a bedside thoracentesis or paracentesis, we suggest against routine prophylactic platelet transfusion 5B In critically ill patients with increased risk of bleeding due to coagulopathy undergoing a bedside thoracentesis or paracentesis, we suggest against routine prophylactic FFP transfusion 6. Lumbar p uncture 6A. In critically ill patients with increased risk of bleeding due to thrombocytopenia undergoing a bedside lumbar puncture, we suggest platelet transfusion if platelets counts are 40-50 × 10 9 6B. In critically ill patients with increased risk of bleeding due to coagulopathy undergoing a bedside lumbar puncture, we suggest FFP transfusion to target international normalized ratio (INR) 1.5-2 before the procedure 7. Bedside e ndoscopy  Bronchoscopy 7A. In critically ill patients with increased risk of bleeding due to thrombocytopenia undergoing routine flexible bronchoscopy without biopsy, we suggest against routine prophylactic platelet transfusion 7B. In critically ill patients with increased risk of bleeding due to coagulopathy undergoing a routine bedside flexible bronchoscopy without biopsy, we suggest against routine prophylactic FFP transfusion GI e ndoscopy 7C. In critically ill patients with suspected portal hypertension related gastrointestinal ( GI ) bleeding and increased risk of bleeding due to thrombocytopenia who are undergoing GI-endoscopy, we suggest against routine platelet transfusion 7D. In critically ill patients with suspected portal hypertension related bleeding and increased risk of bleeding due to coagulopathy who are undergoing GI-endoscopy, we suggest against routine FFP transfusion Background In the United States, 20% of platelets and fresh frozen plasma (FFP) are transfused to critically ill patients, totaling 2.2 million units of each annually. 1 2 , 3 4 5 6 7 Coagulopathy is characterized by a disruption of coagulation factors and ineffective hemostasis, leading to impaired clot formation. 8 9 10 11 , 12 13 Platelets and FFP are scarce resources with variable costs and access globally. 14 , 15 16 17 Methods Expert Panel Composition The co-chairs nominated a diverse and multidisciplinary panel based on their expertise encompassing critical care medicine, cardiology, hematology, and gastroenterology/hepatology. The final panel consisted of the 2 guideline co-chairs, 9 panelists, 2 methodologists, a medical librarian, and a liaison to the American College of Chest Physicians ( Conflicts of Interest Financial relationships for each chair and panelists were reviewed by the CHEST Professional Standards Committee for potential conflicts of interest according to the CHEST Conflict of Interest Policy. 18 Question Development The panel developed 7 clinical questions using the Population, Intervention, Comparator, and Outcome (PICO) format regarding platelet and FFP transfusions in different clinical scenarios. The panel ranked outcomes for each question to determine critical and important outcomes a priori ( e-Table 1 Literature Search A comprehensive search of MEDLINE, Embase, and the Cochrane Central Register of Controlled Trials using relevant key words was performed in May 2021 ( e-Table 2 Study Selection and Data Extraction Relevant citations identified during the literature search were reviewed in duplicate using predefined criteria over 2 rounds of study selection: the first reviewing titles and abstracts and the second reviewing full texts ( e-Figs 1-6 Assessment of the Certainty of Evidence Risk of bias was assessed using the Cochrane Risk of Bias tool for RCTs (RoB 2) and Risk of Bias in Nonrandomized Studies of Intervention (ROBINS-I) based on study design. 19 , 20 The overall certainty of the evidence was assessed for each outcome of interest using the Grading of Recommendations, Assessment, Development, and Evaluation (GRADE) approach ( e-Table 3 21 Development of Recommendations The panel reviewed and discussed the evidence necessary to address each question. Recommendations were drafted using the GRADE approach, with strong recommendations using the wording “we recommend,” and conditional recommendations using the wording “we suggest.” 22 23 e-Appendix 1 The guideline was reviewed and approved by the Guidelines Oversight Committee and CHEST presidential leadership. Results Critically ill patients have complex problems that require a thoughtful and nuanced approach to medical care. The recommendations in this document apply to critically ill patients, excluding trauma and neuro-critical care populations, and should be implemented in a hierarchal fashion to optimize treatment. Recommendations 1-3 should be applied initially to critically ill patients with thrombocytopenia, while the subsequent recommendations provide additional guidance for specific situations involving invasive procedures ( Figs 1 2 Figure 1 Platelet transfusion thresholds in according bleeding risk and the presence of bleeding. WHO = World Health Organization. Figure 2 Platelet and FFP transfusion thresholds for various ICU bedside procedures. The proposed strategy would be exemplified by a hypothetical critically ill patient with a platelet count of 20 × 10 9 9 a  Question 1: Should critically ill patients with thrombocytopenia and without high risk of bleeding receive transfusion of platelets? Recommendation: In stable non-bleeding critically ill patients with thrombocytopenia and without high risk of spontaneous bleeding, we suggest transfusing platelets if platelet counts fall below 10 × 10 9  Question 2: Should critically ill patients with thrombocytopenia and high risk of bleeding receive transfusion of platelets? Recommendation: In stable non-bleeding critically ill patients with thrombocytopenia who are considered at high risk of spontaneous bleeding, we suggest transfusing platelets if platelet counts fall below 30-50 × 10 9 Justification The development of platelet transfusion guidelines for critically ill patients was hindered by the lack of randomized trials to fully test whether benefits exceed risks. The risks associated with platelet transfusion are generally higher than those of other blood products. These risks include both immunologically and nonimmunologically related complications, with the former category accounting for most adverse events. Approximately 1% of adverse reactions from platelet transfusion relate to transfusion-associated circulatory overload and transfusion-related acute lung injury. 24 Spontaneous bleeding in critically ill patients places the patient at risk for hemorrhagic shock or local effects from an expanding hematoma. Patients at high risk for spontaneous bleeding might be anticipated to benefit from platelet transfusions. However, a major challenge in this recommendation is defining “high risk of bleeding” as no universally accepted definition exists. Factors such as demographic characteristics, thrombocytopenia, coagulopathy, and comorbidities can increase this risk. The International Medical Prevention Registry on Venous Thromboembolism (IMPROVE) study assessed the risk of clinically significant bleeding in adults hospitalized for an acute medical illness and was later validated in a cohort comprising 22.4% ICU patients ( Table 1 25 , 26 26 27 Table 1 International Medical Prevention Registry on Venous Thromboembolism (IMPROVE) Bleeding Risk Score Bleeding Risk Factor Points Moderate renal failure GFR 30-59 mL/min/m 2 1 Male vs female 1 Age 40-84 y 1.5 Current cancer 2 Rheumatic disease 2 Central venous catheter 2 ICU/CCU 2.5 Severe renal failure GFR < 30 mL/min/m 2 2.5 Hepatic failure (INR > 1.5) 2.5 Age ≥ 85 y 3.5 Platelet count < 50 × 10 9 4 Bleeding in 3 mo before admission 4 Active gastroduodenal ulcer 4.5 CCU = coronary care unit; GFR = glomerular filtration rate; INR = international normalized ratio. While the IMPROVE score could be a useful tool for identifying patients at high risk of bleeding, no definition exists that can be easily applied at the bedside. Therefore, clinician judgment and expertise are essential in evaluating a patient’s bleeding risk, considering all available factors to determine the need for platelet transfusions. The included studies varied significantly in patient characteristics, transfusion indications, and thresholds, preventing the differentiation between prophylactic and therapeutic transfusions ( Table 2 28 28 , 29 30 , 31 28 29 30 31 Table 2 Studies Informing Recommendations 1 and 2 Study Patient Type Thrombocytopenia Definition 9 Platelet-Transfused Group Non-Platelet-Transfused Group N Platelet Count × 10 9 INR N Platelet Count × 10 9 INR Warner et al 28 ICU Variable a 985 81.1 ± 50.1 b 1.4 ± 0.6 b 985 77.5 ± 60.1 b 1.3 ± 0.5 b Salman et al 30 ICU < 50 90 23 (11-38) c NR 27 33 (18-33) c NR He et al 29 Sepsis < 150 677 50.6 ± 31.5 b 2.15 ± 1.5 b 677 48.1 ± 32.2 b 2.05 ± 1.43 b Wu et al 31 Sepsis ≤ 50 296 20 (11-33) c NR 296 31 (19-41) c NR INR = international normalized ratio; NR = not reported. a Platelet count ≤ 100 with active bleeding; ≤ 10 without active bleeding; ≤ 20 with fever, disseminated intravascular coagulation, sepsis, or other conditions associated with platelet destruction; ≤ 20 before central venous catheter insertion; ≤ 50 requiring surgery. b Mean ± SD. c Median (interquartile range). Patients Without High Risk of Bleeding Prophylactic transfusions at platelet counts < 10 × 10 9 Table 3 32 33 34 35 Table 3 WHO Bleeding Scale WHO Bleeding Grade Examples 1 • Epistaxis ≤ 30 min in previous 24 h • Petechiae of oral mucosa or skin • Purpura ≤ 1 inch in diameter • Spontaneous hematoma in soft tissue or muscle • Positive stool occult blood test • Microscopic hematuria or hemoglobinuria • Abnormal vaginal bleeding (spotting) 2 • Epistaxis > 30 min in 24 h • Purpura > 1 inch in diameter • Joint bleeding • Melanotic stool • Hematemesis • Gross/visible hematuria • Abnormal vaginal bleeding (more than spotting) • Hemoptysis • Visible blood in body cavity fluid • Retinal bleeding without visual impairment • Bleeding at invasive sites 3 • Bleeding requiring RBC transfusion over routine transfusion needs. • Bleeding associated with moderate hemodynamic instability 4 • Bleeding associated with severe hemodynamic instability • Fatal bleeding • CNS bleeding on imaging study with or without dysfunction CNS = central nervous system; WHO = World Health Organization. Patients With High Risk of Bleeding Given the absence of prospective studies and the heterogeneity of the critical care population, establishing a universal transfusion threshold to prevent spontaneous bleeding in critically ill patients at high risk of bleeding was challenging. Patients may be at high risk of bleeding due to factors that increase the likelihood of bleeding or because of critical anatomical sites where even minor bleeding could be catastrophic. Experts and guidelines recommend maintaining platelet counts > 100 × 10 9 36 , 37 9 38 39 40 9 Specific Populations Platelet transfusions are not beneficial and can be harmful to certain patient groups, including those with thrombotic thrombocytopenic purpura, idiopathic thrombocytopenic purpura, alloimmunization, hyperleukocytosis, and leukostasis. Additionally, certain populations are at increased risk of transfusion-related acute lung injury and transfusion-associated circulatory overload such as congestive heart failure, chronic liver disease, shock, and current smoking. 24 , 41 What Others Are Saying The recommendations for patients without high risk of bleeding align with those from the Association for the Advancement of Blood & Biotherapies, the American Society of Clinical Oncology (ASCO), the European Society of Intensive Care Medicine (ESICM), and the British Society for Haematology (BSH). 42 43 44 45 For patients at high risk of bleeding, considering a higher platelet count threshold for transfusion is suggested. 43 , 45 Research Priorities Future research should aim to identify factors that increase bleeding risk, establish a clear definition of high risk of bleeding, and determine the optimal platelet transfusion thresholds for critically ill patients with thrombocytopenia.  Question 3: Should critically ill patients with thrombocytopenia and active bleeding receive transfusion of platelets? Recommendation: In critically ill patients with thrombocytopenia and serious active bleeding, we suggest transfusing platelets if platelet counts fall below 50 × 10 9 Justification The effectiveness of transfusing platelets to critically ill medical patients with active bleeding remains unclear. Moreover, there is significant variability in what clinicians consider serious active bleeding. The panel considered WHO grades 3 and 4 as serious active bleeding. The literature search excluded patients with trauma and those with intracranial hemorrhage, resulting in the identification of 1 relevant study. An observational examination of platelet transfusions in adults with cirrhosis and esophageal variceal bleeding showed no significant difference in mortality rates between transfused and non-transfused individuals (25.3% vs 17.4%; P 9 46 In patients with thrombocytopenia and clinically significant active bleeding, platelet transfusion is the standard treatment. Strong evidence of net harm would be required to deviate from this practice, but the current evidence was insufficient to justify change. While a framework is suggested ( Table 4 Table 4 Suggested Approach for Platelet Transfusions Bleeding Severity (WHO Group) Suggested Approach 1 • The intervention should focus on addressing the cause of bleeding and not on platelet transfusions • Use thresholds recommended for non-bleeding patients 2 • Hemostatic approaches such as tamponade/pressure, topical hemostatic agents, and therapeutic procedures should be considered if they might obviate the need for platelet transfusion • Platelet transfusions can be considered if attempts to control bleeding are unsuccessful or if bleeding site is not suitable for compression a 3 and 4 • Platelet transfusion threshold of 50 × 10 9 a WHO = World Health Organization. a In high-risk situations where further bleeding would not be tolerated (eg, diffuse alveolar hemorrhage, ocular hemorrhage, compartment syndrome), a higher threshold might be considered. Central nervous system bleeding is not included in these recommendations. What Others Are Saying Our recommendation aligns with those from other organizations. The BSH advises that for patients with WHO grade ≥ 2 bleeding, platelet counts should be maintained > 50 × 10 9 9 45 9 47 43 48 9 49 , 50 Research Priorities Future research should focus on identifying measurable factors that correlate with bleeding risk and on evaluating the utility of functional platelet assessments for guiding transfusion practices. Question 4: Should critically ill patients with increased risk of bleeding due to thrombocytopenia or coagulopathy undergoing a bedside CVC or arterial line insertion receive blood products to reverse thrombocytopenia or coagulopathy? Recommendation 4A: In critically ill patients at increased risk of bleeding due to thrombocytopenia undergoing a CVC or arterial line insertion, we suggest against routine prophylactic platelet transfusion. Recommendation 4B: In critically ill patients at increased risk of bleeding due to coagulopathy undergoing a CVC or arterial line insertion, we suggest against routine prophylactic FFP transfusion. Justification The scarce data on platelet or FFP transfusions for bedside vascular procedures was limited to CVC placement. 51 52 53 9 54 , 55 van Baarle et al 51 9 9 A small RCT and a retrospective study assessed FFP transfusions, excluding individuals with INR > 3 and noting an imbalance of patients with liver disease across comparison groups. Clinically significant bleeding was rare and unaffected by FFP transfusions. No differences were observed in mortality, ICU LOS, or complication rates. 52 , 53 9 56 Establishing a transfusion threshold based on the number and combination of factors is challenging. The recommended approach includes avoiding routine platelet transfusion for patients with platelet counts 10-50 × 10 9 What Others Are Saying Prophylactic platelet transfusions have been recommended prior to vascular catheter placement for counts < 20 × 10 9 42 , 43 , 45 , 57 9 9 44 51 44 , 58 57 Research Priorities Research assessing bleeding risk in settings with INR > 3, mixed coagulopathies, and various degrees and etiologies of thrombocytopenia is necessary. Furthermore, alternative methods for assessing bleeding risk and coagulation abnormalities (ie, viscoelastic monitoring) should be studied.  Question 5: Should critically ill patients with increased risk of bleeding due to thrombocytopenia or coagulopathy undergoing a bedside thoracentesis or paracentesis receive blood products to reverse thrombocytopenia or coagulopathy? Recommendation 5A: In critically ill patients with increased risk of bleeding due to thrombocytopenia undergoing a bedside thoracentesis or paracentesis, we suggest against routine prophylactic platelet transfusion Recommendation 5B: In critically ill patients with increased risk of bleeding due to coagulopathy undergoing a bedside thoracentesis or paracentesis, we suggest against routine prophylactic FFP transfusion Justification Three studies eligible for analysis varied in population characteristics, blood product use, definitions of bleeding, and outcomes ( Table 5 59 60 61 59 , 60 61 Table 5 Studies Informing Recommendation 5 Study Patients Procedure Product Transfused Bleeding Definition Major Bleeding Relative Risk Hibbert 60 Patients with platelets < 50 × 10 9 Thoracentesis FFP or platelets WHO grade 2-4 6.75 (95% CI, 0.37-124.11) Faiz 59 Hematologic patients Thoracentesis, chest tube insertion, and pleural catheter Platelets Hemothorax or bleeding requiring transfusion and/or surgical intervention 0.74 (95% CI, 0.10-5.43) McVay 61 Patients with PT, PTT, and platelets measured within 10 days of procedure Thoracentesis or paracentesis FFP Decrease in hemoglobin > 2 g/dL after procedure 20.93 (95% CI, 1.13-387.56) FFP = fresh frozen plasma; INR = international normalized ratio; PT = prothrombin time; PTT = partial thromboplastin time; WHO = World Health Organization. Given the risks of blood product transfusions and the unclear impact of transfusions, including thresholds, dose, and timing on bleeding, the evidence favors withholding transfusions. Clinical decisions on transfusions should weigh factors such as ultrasound availability, operator experience, anticoagulant use, platelet function disorders, concomitant thrombocytopenia and coagulopathy, and technical or anatomical challenges. What Others Are Saying Several professional societies classify thoracentesis and paracentesis as low-risk procedures. Consequently, they do not recommend routine preprocedural transfusions for thrombocytopenia or coagulopathy. 57 , 62 63 64 Research Priorities High-quality data acquisition necessitates large-scale enrollment given the low frequency of complications. Question 6: Should critically ill patients with increased risk of bleeding due to thrombocytopenia or coagulopathy undergoing a bedside lumbar puncture (LP) receive blood products to reverse thrombocytopenia or coagulopathy? Recommendation 6A: In critically ill patients with increased risk of bleeding due to thrombocytopenia undergoing a bedside LP , we suggest platelet transfusion if platelets counts are 40-50 × 10 9 Recommendation 6B: In critically ill patients with increased risk of bleeding due to coagulopathy undergoing a bedside lumbar puncture, we suggest FFP transfusion to target INR 1.5-2 before the procedure Justification Two articles met the inclusion criteria, allowing the assessment of the safety of LP at different INR and platelet count levels. The search excluded obstetric and oncologic populations and epidural catheter use. 65 , 66 The risk of a traumatic LP was higher in patients with elevated INR. Platelet counts ranging from 50 to 150 × 10 9 9 65 , 66 9 65 9 67 9 68 69 , 70 What Others Are Saying The SIR categorized LP as low bleeding risk procedure with platelet transfusions recommended for counts < 20 × 10 9 57 9 42 , 45 , 57 , 71 Research Priorities While registry data could provide insight into the incidence, evaluating the effectiveness of transfusions might be challenging because most patients are transfused in current practice. Future research exploring viscoelastic testing to guide transfusions, evaluating complication reduction through image guidance, and exploring alternative diagnostic modalities for high-risk LP might prove useful.  Question 7: Should critically ill patients with increased risk of bleeding due to thrombocytopenia or coagulopathy undergoing a bedside endoscopic procedure receive blood products to reverse thrombocytopenia or coagulopathy? Recommendation 7A In critically ill patients with increased risk of bleeding due to thrombocytopenia undergoing routine flexible bronchoscopy without biopsy, we suggest against routine prophylactic platelet transfusion Recommendation 7B In critically ill patients with increased risk of bleeding due to coagulopathy undergoing a routine bedside flexible bronchoscopy without biopsy, we suggest against routine prophylactic FFP transfusion Justification To our knowledge, no RCT data exist to inform this recommendation. Two retrospective studies examined platelet transfusions prior to bronchoscopy in ICU and oncologic patients with varying transfusion thresholds. 72 , 73 72 9 9 73 9 9 73 72 , 73 74 75 76 The effects of platelet transfusion on procedural mortality and transfusion-related adverse events are unclear. Given the low risks of death or bleeding and the unlikely influence of transfusions on these outcomes, evidence supports a default no transfusion approach. Advanced bronchoscopy procedures are beyond the scope of this document. Recommendation 7C: In critically ill patients with suspected portal hypertension related GI bleeding and increased risk of bleeding due to thrombocytopenia who are undergoing GI-endoscopy, we suggest against routine platelet transfusion. Recommendation 7D: In critically ill patients with suspected portal hypertension related bleeding at increased risk of bleeding due to coagulopathy who are undergoing GI-endoscopy, we suggest against routine FFP transfusion Justification No RCT data were found on the prophylactic use of blood products prior to endoscopy. Two retrospective studies explored the effects of platelet transfusion or INR correction before GI-endoscopy in patients with active variceal bleeding. 46 , 77 46 9 77 P 46 , 77 77 46 , 77 Given the low risk of GI-endoscopy without biopsy causing further bleeding, the multiple confounders, and the uncertain risk attributable to transfusions, the evidence suggests not routinely transfusing platelets or FFP. In the ICU, endoscopy is primarily performed for active hemorrhage, focusing on hemostatic interventions. Therefore, the decision to transfuse patients with active GI bleeding undergoing endoscopy should rely on clinical need rather than procedural risk. For instance, post-polypectomy bleeding rates are < 1%. 78 What Others Are Saying Our recommendations for GI-endoscopy align with other societies that advise against INR correction in variceal hemorrhage and deem it reasonable to perform GI-endoscopy without prophylactic platelet transfusion. These statements consider the risks, lack of benefit from prophylactic FFP transfusions, and the weak evidence supporting platelet transfusions. 43 , 64 , 79 , 80 Research Priorities Studies evaluating viscoelastic blood testing to guide product administration are underway. Additional Considerations Statements on cost, equity, acceptability, feasibility, and implementation were consolidated given the significant overlap across various PICO questions. Cost Blood products are scarce and costly, with the entire process from collection to administration incurring substantial costs with global variability. 14 , 81 15 , 82 83 Equity Structural inequities affect access to blood products, likely influenced by hospital policies and clinician practices. Factors such as race, comorbidities, and socioeconomic status contribute to disparities in access to blood products. For instance, Black patients often face challenges finding compatible donors for human leukocyte antigen-matched transfusions, and alloimmunization further impacts supply. 84 85 86 87 Acceptability and Feasibility The acceptability and feasibility of blood product transfusions vary widely depending on the clinical scenarios, clinician practice patterns, patient comorbidities, patient perspectives, and stakeholder resistance to changing established practices despite the lack of evidence. For example, during active bleeding or prior to an LP, most clinicians favor platelet transfusions in patients with thrombocytopenia. 88 Implementation Decisions about platelet or FFP transfusions in critically ill patients should consider factors such as worsening alloimmunization in highly alloimmunized patients. Patients at high risk of bleeding due to coagulopathy, endotheliopathy, hematologic malignancy, or antiplatelet medications may require different thresholds. Conditions such as massive splenomegaly, von Willebrand disease, or presence of antiplatelet antibodies can affect the accuracy of circulating platelet levels as indicators of bleeding risk. For patients who decline transfusions based on personal or religious beliefs, clinicians should align the medical plan with patient values after thorough discussion. Initiatives to unify institutional practices and reduce unnecessary platelet transfusions have shown success. These initiatives resulted in a 25% reduction in units transfused, decreasing platelet wastage, and significantly reducing costs, demonstrating the potential for sustainable, impactful changes. 89 , 90 Summary For all recommendations, high-certainty evidence directly addressing each recommendation was either absent or insufficient. Therefore, our recommendations were primarily based upon expert opinion. This document provides recommendations for platelet transfusion thresholds in non-bleeding patients stratified by risk of bleeding and those with active bleeding. In the procedural setting, the evidence for platelets and FFP is limited but favors a first-line no transfusion approach for vascular, bedside thoracic or abdominal, and endoscopic procedures without biopsy. For LP, given the potentially catastrophic complications, a less restrictive approach is suggested. Despite the lack of high-certainty evidence, these guidelines provide a framework for managing critically ill patients with thrombocytopenia and coagulopathy. Shared decision-making and the implementation of institutional guidelines to standardize transfusion practices could optimize patient care, improve equity in access to blood products and reduce costs. On a large scale, this could amount to approximately half a million less units of platelets and FFP transfused annually. These guidelines should be an opportunity for institutions to develop local policies, monitor their impact on transfusion practices, and provide a framework to longitudinally optimize platelet and FFP use. Funding/Support The authors have reported to CHEST Financial/Nonfinancial Disclosures None declared. References 1 Free R.J. Sapiano M.R.P. Chavez Ortiz J.L. Stewart P. Berger J. Basavaraju S.V. Continued stabilization of blood collections and transfusions in the United States: findings from the 2021 National Blood Collection and Utilization Survey Transfusion 63 suppl 4 2023 S8 S18 suppl 4 37070720 10.1111/trf.17360 PMC10543447 2 Handbook of Transfusion Medicine-United Kingdom Blood Services 5th edition. Chapter 7. Effective transfusion in surgery and critical care https://www.transfusionguidelines.org/transfusion-handbook/7-effective-transfusion-in-surgery-and-critical-care 3 Anthon C.T. Pene F. Perner A. Thrombocytopenia and platelet transfusions in ICU patients: an international inception cohort study (PLOT-ICU) Intensive Care Med 49 11 2023 1327 1338 37812225 10.1007/s00134-023-07225-2 PMC10622358 4 Anthon C.T. Pene F. Perner A. Platelet transfusions and thrombocytopenia in intensive care units: Protocol for an international inception cohort study (PLOT-ICU) Acta Anaesthesiol Scand 66 9 2022 1146 1155 36054145 10.1111/aas.14124 PMC9542787 5 Stanworth S.J. Walsh T.S. Prescott R.J. A national study of plasma use in critical care: clinical indications, dose and effect on prothrombin time Crit Care 15 2 2011 R108 10.1186/cc10129 PMC3219386 21466676 6 Stanworth S.J. Grant-Casey J. Lowe D. The use of fresh-frozen plasma in England: high levels of inappropriate use in adults and children Transfusion 51 1 2011 62 70 20804532 10.1111/j.1537-2995.2010.02798.x 7 Tinmouth A. Thompson T. Arnold D.M. Utilization of frozen plasma in Ontario: a provincewide audit reveals a high rate of inappropriate transfusions Transfusion 53 10 2013 2222 2229 23672421 10.1111/trf.12231 8 Hui P. Cook D.J. Lim W. Fraser G.A. Arnold D.M. The frequency and clinical significance of thrombocytopenia complicating critical illness: a systematic review Chest 139 2 2011 271 278 21071526 10.1378/chest.10-2243 9 Williamson D.R. Albert M. Heels-Ansdell D. Thrombocytopenia in critically ill patients receiving thromboprophylaxis: frequency, risk factors, and outcomes Chest 144 4 2013 1207 1215 23788287 10.1378/chest.13-0121 10 Zarychanski R. Houston D.S. Assessing thrombocytopenia in the intensive care unit: the past, present, and future Hematology Am Soc Hematol Educ Program 2017 1 2017 660 666 29222318 10.1182/asheducation-2017.1.660 PMC6142536 11 Walsh T.S. Stanworth S.J. Prescott R.J. Prevalence, management, and outcomes of critically ill patients with prothrombin time prolongation in United Kingdom intensive care units Crit Care Med 38 10 2010 1939 1946 20639745 10.1097/CCM.0b013e3181eb9d2b 12 Vanderschueren S. De Weerdt A. Malbrain M. Thrombocytopenia and prognosis in intensive care Crit Care Med 28 6 2000 1871 1876 10890635 10.1097/00003246-200006000-00031 13 Pandey S. Vyas G.N. Adverse effects of plasma transfusion Transfusion 52 Suppl 1 2012 65S 79S suppl 1 22578374 10.1111/j.1537-2995.2012.03663.x PMC3356109 14 Indelen C. Uygun Kizmaz Y. Kar A. Shander A. Kirali K. The cost of one unit blood transfusion components and cost-effectiveness analysis results of transfusion improvement program Turk Gogus Kalp Damar Cerrahisi Derg 29 2 2021 150 157 34104508 10.5606/tgkdc.dergisi.2021.20886 PMC8167483 15 Jacobs J.W. Diaz M. Arevalo Salazar D.E. United States blood pricing: A cross-sectional analysis of charges and reimbursement at 200 US hospitals Am J Hematol 98 7 2023 E179 E182 37096559 10.1002/ajh.26940 16 Lotterman S. Sharma S. Blood Transfusion [Updated June 20, 2023]. In: StatPearls https://www.ncbi.nlm.nih.gov/books/NBK499824/ 17 Roback J.D. Caldwell S. Carson J. Evidence-based practice guidelines for plasma transfusion Transfusion 50 6 2010 1227 1239 20345562 10.1111/j.1537-2995.2010.02632.x 18 American College of CHEST Physicians Policy CCoI. American College of CHEST Physicians website https://www.chestnet.org/-/media/chesnetorg/about-accp/documents/guidelines_coi_policy.ashx 19 Boutron I. Page MJ. Higgins JPT. Altman DG. Lundh A. Hróbjartsson A. the Cochrane Bias Methods Group Cochrane Handbook for Systematic Reviews of Interventions. Version 6.3. https://training.cochrane.org/handbook/current/chapter-07 20 Higgins JPT. Savović J. Page MJ. Elbers RG. Sterne JAC. Cochrane Handbook for Systematic Reviews of Interventions. Version 6.3 https://training.cochrane.org/handbook/current/chapter-08 21 Balshem H. Helfand M. Schunemann H.J. GRADE guidelines: 3. Rating the quality of evidence J Clin Epidemiol 64 4 2011 401 406 21208779 10.1016/j.jclinepi.2010.07.015 22 Andrews J.C. Schunemann H.J. Oxman A.D. GRADE guidelines: 15. Going from evidence to recommendation-determinants of a recommendation's direction and strength J Clin Epidemiol 66 7 2013 726 735 23570745 10.1016/j.jclinepi.2013.02.003 23 Jaeschke R. Guyatt G.H. Dellinger P. Use of GRADE grid to reach decisions on clinical practice guidelines when consensus is elusive BMJ 337 2008 a744 10.1136/bmj.a744 18669566 24 Sato T. Tsuno N.H. Goto N. Hagino T. Tasaki T. Incidence and severity of adverse effects related to platelet transfusion: a narrative review of the literature and the recent hemovigilance data of Japan Annals Blood 6 2021 4 25 Decousus H. Tapson V.F. Bergmann J.F. Factors at admission associated with bleeding risk in medical patients: findings from the IMPROVE investigators Chest 139 1 2011 69 79 20453069 10.1378/chest.09-3081 26 Hostler D.C. Marx E.S. Moores L.K. Validation of the International Medical Prevention Registry on Venous Thromboembolism Bleeding Risk Score Chest 149 2 2016 372 379 26867833 10.1378/chest.14-2842 27 Villiger R. Julliard P. Darbellay Farhoumand P. Prediction of in-hospital bleeding in acutely ill medical patients: external validation of the IMPROVE bleeding risk score Thromb Res 230 2023 37 44 37634309 10.1016/j.thromres.2023.08.003 28 Warner M.A. Chandran A. Frank R.D. Kor D.J. Prophylactic platelet transfusions for critically ill patients with thrombocytopenia: a single-institution propensity-matched cohort study Anesth Analg 128 2 2019 288 295 29293185 10.1213/ANE.0000000000002794 PMC6026075 29 He S. Fan C. Ma J. Tang C. Chen Y. Platelet transfusion in patients with sepsis and thrombocytopenia: a propensity score-matched analysis using a large ICU database Front Med (Lausanne) 9 2022 830177 10.3389/fmed.2022.830177 PMC8888830 35252261 30 Salman S.S. Fernandez Perez ER. Stubbs J.R. Gajic O. The practice of platelet transfusion in the intensive care unit J Intensive Care Med 22 2 2007 105 110 17469241 10.1177/0885066606297969 31 Wu S. Chen Q. Pan J. Zhou A. Platelet transfusion and mortality in patients with sepsis-induced thrombocytopenia: a propensity score matching analysis Vox Sang 117 10 2022 1187 1194 35851699 10.1111/vox.13335 32 Slichter S.J. Relationship between platelet count and bleeding risk in thrombocytopenic patients Transfus Med Rev 18 3 2004 153 167 15248165 10.1016/j.tmrv.2004.03.003 33 Stanworth S.J. Estcourt L.J. Powter G. A no-prophylaxis platelet-transfusion strategy for hematologic cancers N Engl J Med 368 19 2013 1771 1780 23656642 10.1056/NEJMoa1212772 34 Wandt H. Schaefer-Eckart K. Wendelin K. Therapeutic platelet transfusion versus routine prophylactic transfusion in patients with haematological malignancies: an open-label, multicentre, randomised study Lancet 380 9850 2012 1309 1316 22877506 10.1016/S0140-6736(12)60689-8 35 Crighton G.L. Estcourt L.J. Wood E.M. Trivella M. Doree C. Stanworth S. A therapeutic-only versus prophylactic platelet transfusion strategy for preventing bleeding in patients with haematological disorders after myelosuppressive chemotherapy or stem cell transplantation Cochrane Database Syst Rev 2015 9 2015 Cd010981 10.1002/14651858.CD010981.pub2 PMC4610062 26422767 36 Slichter S.J. Evidence-based platelet transfusion guidelines Hematology 2007 1 2007 172 178 10.1182/asheducation-2007.1.172 18024626 37 Li D. Glor T. Jones G.A. Thrombocytopenia and neurosurgery: a literature review World Neurosurg 106 2017 277 280 28645585 10.1016/j.wneu.2017.06.097 38 Napolitano M. Saccullo G. Marietta M. Platelet cut-off for anticoagulant therapy in thrombocytopenic patients with blood cancer and venous thromboembolism: an expert consensus Blood Transfus 17 3 2019 171 180 30418130 10.2450/2018.0143-18 PMC6596377 39 Levi M. Scully M. How I treat disseminated intravascular coagulation Blood 131 8 2018 845 854 29255070 10.1182/blood-2017-10-804096 40 Levi M. Opal S.M. Coagulation abnormalities in critically ill patients Crit Care 10 4 2006 222 16879728 10.1186/cc4975 PMC1750988 41 Katus M.C. Szczepiorkowski Z.M. Dumont L.J. Dunbar N.M. Safety of platelet transfusion: past, present and future Vox Sang 107 2 2014 103 113 24650183 10.1111/vox.12146 42 Kaufman R.M. Djulbegovic B. Gernsheimer T. Platelet transfusion: a clinical practice guideline from the AABB Ann Intern Med 162 3 2015 205 213 25383671 10.7326/M14-1589 43 Schiffer C.A. Bohlke K. Delaney M. Platelet transfusion for patients with cancer: American Society of Clinical Oncology Clinical Practice Guideline Update J Clin Oncol 36 3 2018 283 299 29182495 10.1200/JCO.2017.76.1734 44 Vlaar A.P. Oczkowski S. de Bruin S. Transfusion strategies in non-bleeding critically ill adults: a clinical practice guideline from the European Society of Intensive Care Medicine Intensive Care Med 46 4 2020 673 696 31912207 10.1007/s00134-019-05884-8 PMC7223433 45 Estcourt L.J. Birchall J. Allard S. Guidelines for the use of platelet transfusions Br J Haematol 176 3 2017 365 394 28009056 10.1111/bjh.14423 46 Biswas S. Vaishnav M. Pathak P. Effect of thrombocytopenia and platelet transfusion on outcomes of acute variceal bleeding in patients with chronic liver disease World J Hepatol 14 7 2022 1421 1437 36158909 10.4254/wjh.v14.i7.1421 PMC9376768 47 Wada H. Thachil J. Di Nisio M. The Scientific Standardization Committee on DIC of the International Society on Thrombosis Haemostasis Guidance for diagnosis and treatment of disseminated intravascular coagulation from harmonization of the recommendations from three guidelines J Thromb Haemost 11 4 2013 761 767 48 Vlaar A.P.J. Dionne J.C. de Bruin S. Transfusion strategies in bleeding critically ill adults: a clinical practice guideline from the European Society of Intensive Care Medicine Intensive Care Med 47 12 2021 1368 1392 34677620 10.1007/s00134-021-06531-x PMC8532090 49 Intagliata N.M. Argo C.K. Stine J.G. Concepts and controversies in haemostasis and thrombosis associated with liver disease: proceedings of the 7th International Coagulation in Liver Disease Conference Thromb Haemost 118 8 2018 1491 1506 30060258 10.1055/s-0038-1666861 PMC6202935 50 Kaplan D.E. Ripoll C. Thiele M. AASLD Practice Guidance on risk stratification and management of portal hypertension and varices in cirrhosis Hepatology 79 5 2024 1180 1211 37870298 10.1097/HEP.0000000000000647 51 van Baarle F.L.F. van de Weerdt E.K. van der Velden W. Platelet transfusion before CVC placement in patients with thrombocytopenia N Engl J Med 388 21 2023 1956 1965 37224197 10.1056/NEJMoa2214322 52 Muller M.C. Arbous M.S. Spoelstra-de Man A.M. Transfusion of fresh-frozen plasma in critically ill patients with a coagulopathy before invasive procedures: a randomized clinical trial (CME) Transfusion 55 1 2015 26 35 quiz 25 24912653 10.1111/trf.12750 53 Carino G.P. Tsapenko A.V. Sweeney J.D. Central line placement in patients with and without prophylactic plasma J Crit Care 27 5 2012 529.e9 529.e13 10.1016/j.jcrc.2011.12.016 22341725 54 van de Weerdt E.K. Peters A.L. Goudswaard E.J. The practice of platelet transfusion prior to central venous catheterization in presence of coagulopathy: a national survey among clinicians Vox Sang 112 4 2017 343 351 28261815 10.1111/vox.12498 55 Zeidler K. Arn K. Senn O. Schanz U. Stussi G. Optimal preprocedural platelet transfusion threshold for central venous catheter insertions in patients with thrombocytopenia Transfusion 51 11 2011 2269 2276 21517892 10.1111/j.1537-2995.2011.03147.x 56 van Baarle F.L.F. Tisheh A. Jhingoeriesingh S.S. Vlaar A.P.J. Biemond B.J. Contribution of coagulopathy on the risk of bleeding after central venous catheter placement in critically ill thrombocytopenic patients Crit Care Explor 4 1 2022 e0621 10.1097/CCE.0000000000000621 PMC8785929 35083436 57 Patel I.J. Rahim S. Davidson J.C. Society of Interventional Radiology Consensus Guidelines for the Periprocedural Management of Thrombotic and Bleeding Risk in Patients Undergoing Percutaneous Image-Guided Interventions-Part II: Recommendations: Endorsed by the Canadian Association for Interventional Radiology and the Cardiovascular and Interventional Radiological Society of Europe J Vasc Interv Radiol 30 8 2019 1168 1184.e1 31229333 10.1016/j.jvir.2019.04.017 58 Green L. Bolton-Maggs P. Beattie C. British Society of Haematology Guidelines on the spectrum of fresh frozen plasma and cryoprecipitate products: their handling and use in various patient groups in the absence of major bleeding Br J Haematol 181 1 2018 54 67 29527654 10.1111/bjh.15167 59 Faiz S.A. Bashoura L. Lei X. Pleural effusions in patients with acute leukemia and myelodysplastic syndrome Leuk Lymphoma 54 2 2013 329 335 22812422 10.3109/10428194.2012.713478 60 Hibbert R.M. Atwell T.D. Lekah A. Safety of ultrasound-guided thoracentesis in patients with abnormal preprocedural coagulation parameters Chest 144 2 2013 456 463 23493971 10.1378/chest.12-2374 61 McVay P.A. Toy P.T. Lack of increased bleeding after paracentesis and thoracentesis in patients with mild coagulation abnormalities Transfusion 31 2 1991 164 171 1996485 10.1046/j.1537-2995.1991.31291142949.x 62 Fong C. Tan C.W.C. Tan D.K.Y. See K.C. Safety of thoracentesis and tube thoracostomy in patients with uncorrected coagulopathy: a systematic review and meta-analysis Chest 160 5 2021 1875 1889 33905681 10.1016/j.chest.2021.04.036 63 O'Shea R.S. Davitkov P. Ko C.W. AGA Clinical Practice Guideline on the Management of Coagulation Disorders in Patients With Cirrhosis Gastroenterology 161 5 2021 1615 1627.e1 34579936 10.1053/j.gastro.2021.08.015 64 Tapper E.B. Warner M.A. Shah R.P. Management of coagulopathy among patients with cirrhosis undergoing upper endoscopy and paracentesis: persistent gaps and areas of consensus in a multispecialty Delphi Hepatology 80 2 2024 488 499 38557474 10.1097/HEP.0000000000000856 PMC12124306 65 Bodilsen J. Mariager T. Vestergaard H.H. Association of lumbar puncture with spinal hematoma in patients with and without coagulopathy JAMA 324 14 2020 1419 1428 33048155 10.1001/jama.2020.14895 PMC8094417 66 Portuguese A.J. Rothberg A. Gorgone M. Strawderman M. Jacob C. Safety of bedside lumbar puncture in adult patients with thrombocytopenia Ann Hematol 99 8 2020 1755 1762 32564195 10.1007/s00277-020-04148-6 67 Corrao K.M. Michaelis L.C. Baumann Kreuziger L. 40 is the new 50: reducing the need for platelet transfusions prior to lumbar puncture in patients with hematologic malignancies Blood 132 2018 4837 10.3324/haematol.2023.284321 PMC12358779 39882645 68 Brown M.W. Yilmaz T.S. Kasper E.M. Iatrogenic spinal hematoma as a complication of lumbar puncture: what is the risk and best management plan? Surg Neurol Int 7 suppl 22 2016 S581 S589 27625895 10.4103/2152-7806.189441 PMC5009572 69 Qamar A. Vaduganathan M. Greenberger N.J. Giugliano R.P. Oral anticoagulation in patients with liver disease J Am Coll Cardiol 71 19 2018 2162 2175 29747837 10.1016/j.jacc.2018.03.023 70 Shikdar S. Vashisht R. Bhattacharya P.T. International Normalized Ratio (INR) 2024 StatPearls Treasure Island, FL 29939529 71 Engelborghs S. Niemantsverdriet E. Struyfs H. Consensus guidelines for lumbar puncture in patients with neurological diseases Alzheimers Dement (Amst) 8 2017 111 126 28603768 10.1016/j.dadm.2017.04.007 PMC5454085 72 Kim Y.H. Suh G.Y. Kim M.H. Safety and usefulness of bronchoscopy in ventilator-dependent patients with severe thrombocytopenia Anaesth Intensive Care 36 3 2008 411 417 18564803 73 Faiz S.A. Jimenez C.A. Fellman B.M. Incidence of bleeding complications with flexible bronchoscopy in cancer patients with thrombocytopenia J Bronchology Interv Pulmonol 26 4 2019 280 286 30973520 10.1097/LBR.0000000000000590 PMC6768748 74 Zhou G.W. Zhang W. Dong Y.C. Flexible bronchoscopy-induced massive bleeding: A 12-year multicentre retrospective cohort study Respirology 21 5 2016 927 931 27061330 10.1111/resp.12784 75 Nandagopal L. Veeraputhiran M. Jain T. Soubani A.O. Schiffer C.A. Bronchoscopy can be done safely in patients with thrombocytopenia Transfusion 56 2 2016 344 348 26446048 10.1111/trf.13348 76 Facciolongo N. Patelli M. Gasparini S. Incidence of complications in bronchoscopy. Multicentre prospective study of 20,986 bronchoscopies Monaldi Arch Chest Dis 71 1 2009 8 14 19522159 10.4081/monaldi.2009.370 77 Mohanty A. Kapuria D. Canakis A. Fresh frozen plasma transfusion in acute variceal haemorrhage: results from a multicentre cohort study Liver Int 41 8 2021 1901 1908 33969607 10.1111/liv.14936 78 Rex D.K. Schoenfeld P.S. Cohen J. Quality indicators for colonoscopy Am J Gastroenterol 110 1 2015 72 90 25448873 10.1038/ajg.2014.385 79 Northup P.G. Garcia-Pagan J.C. Garcia-Tsao G. Vascular liver disorders, portal vein thrombosis, and procedural bleeding in patients with liver disease: 2020 practice guidance by the American Association for the Study of Liver Diseases Hepatology 73 1 2021 366 413 33219529 10.1002/hep.31646 80 Gralnek I.M. Camus Duboc M. Garcia-Pagan J.C. Endoscopic diagnosis and management of esophagogastric variceal hemorrhage: European Society of Gastrointestinal Endoscopy (ESGE) Guideline Endoscopy 54 11 2022 1094 1120 36174643 10.1055/a-1939-4887 81 Mastrorilli G. Fiorentino F. Tucci C. Lombardi G. Aghemo A. Colombo G.L. Cost analysis of platelet transfusion in Italy for patients with chronic liver disease and associated thrombocytopenia undergoing elective procedures Clinicoecon Outcomes Res 14 2022 205 220 35422645 10.2147/CEOR.S354470 PMC9005228 82 Hofmann A. Ozawa S. Shander A. Activity-based cost of platelet transfusions in medical and surgical inpatients at a US hospital Vox Sang 116 9 2021 998 1004 33772793 10.1111/vox.13095 83 Barnett C.L. Mladsi D. Vredenburg M. Aggarwal K. Cost estimate of platelet transfusion in the United States for patients with chronic liver disease and associated thrombocytopenia undergoing elective procedures J Med Econ 21 8 2018 827 834 29912593 10.1080/13696998.2018.1490301 84 Kreuger A.L. Haasnoot G.W. Somers J.A.E. Ensuring HLA-matched platelet support requires an ethnic diverse donor population Transfusion 60 5 2020 940 946 32086954 10.1111/trf.15728 PMC7317777 85 Smedley W.A. Mabry C.D. Collins T. Access to immediately available balanced blood products in a rural state's trauma system Am Surg 89 7 2023 3157 3162 36877979 10.1177/00031348231160836 86 Mohammed A.D. Ntambwe P. Crawford A.M. Barriers to effective transfusion practices in limited-resource settings: from infrastructure to cultural beliefs World J Surg 44 7 2020 2094 2099 32157404 10.1007/s00268-020-05461-x PMC7266790 87 American Red Cross-Blood Shortage Continues, Please Give Blood Now. American Red Cross website https://www.redcross.org/about-us/news-and-events/press-release/2023/red-cross-announces-national-blood-shortage.html#:∼:text=When%20supplies%20are%20low%20it,meet%20hospital%20and%20patient%20needs 88 Blajchman M.A. Slichter S.J. Heddle N.M. Murphy M.F. New strategies for the optimal use of platelet transfusions Hematology Am Soc Hematol Educ Program 2008 198 204 19074082 10.1182/asheducation-2008.1.198 89 Sarode R. Refaai M.A. Matevosyan K. Burner J.D. Hampton S. Rutherford C. Prospective monitoring of plasma and platelet transfusions in a large teaching hospital results in significant cost reduction Transfusion 50 2 2010 487 492 19804569 10.1111/j.1537-2995.2009.02413.x 90 Davenport P.E. Chan Yuen J. Briere J. Feldman H.A. Sola-Visner M.C. Leeman K.T. Implementation of a neonatal platelet transfusion guideline to reduce non-indicated transfusions using a quality improvement framework J Perinatol 41 6 2021 1487 1494 33758388 10.1038/s41372-021-01033-6 PMC7985577 Supplementary Data  e-Online Data Acknowledgments Author contributions: Additional information: e-Appendixes e-Figure e-Tables Supplementary Data DISCLAIMER: https://www.chestnet.org/guidelines-disclaimer ",
  "metadata": {
    "Title of this paper": "Implementation of a neonatal platelet transfusion guideline to reduce non-indicated transfusions using a quality improvement framework",
    "Journal it was published in:": "Chest",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489387/"
  }
}