{
  "title": "Paper_61",
  "abstract": "pmc ACS Omega ACS Omega 3686 acsomega ao ACS Omega 2470-1343 American Chemical Society http://pubs.acs.org/journal/acsodf PMC12489626 PMC12489626.1 12489626 12489626 10.1021/acsomega.5c05108 1 Review Advancing Drug Delivery: Design and Applications of\nMOF-Polyurethane Composites for Controlled Release Systems 7391227 Yan Chang 7312221 Hu Shuhui 2620766 Fei Qiang 3386337 https://orcid.org/0000-0003-0218-7641 Zhang Bo 5298361 https://orcid.org/0000-0001-8704-226X Wu Wenneng  † School\nof Food Science and Engineering 47860 Guiyang\nUniversity Guiyang Guizhou 550005 China  ‡ Shanghai\nEngineering Research Center of Green Energy Chemical Engineering,\nThe Key Laboratory of Resource Chemistry of Ministry of Education,\nCollege of Chemistry and Materials Science 12544 Shanghai Normal University Shanghai 200234 PR China * zb830216@shnu.edu.cn * wuwenneng123@126.com 18 9 2025 30 9 2025 10 38 498176 43363 43378 04 6 2025 01 9 2025 25 8 2025 18 9 2025 18 09 2025 03 10 2025 03 10 2025 © 2025 The Authors. Published by American Chemical Society 2025 The Authors https://creativecommons.org/licenses/by-nc-nd/4.0/ This article is licensed under CC-BY-NC-ND 4.0 The design and development\nof controlled-release drug systems represent\na pivotal area of research in modern pharmaceutical technologies.\nAn ideal drug release system should precisely regulate both the release\nrate and duration of the drug, thereby enhancing therapeutic efficacy,\nreducing dose frequency, and minimizing adverse effects. In recent\nyears, nanomaterials have become integral to drug delivery, with nanotechnology\nfocusing on the design and application of nanomaterials. Metal–organic\nframeworks (MOFs) have emerged as promising drug carriers due to their\nhigh specific surface area, tunable porosity, and selective adsorption\ncapabilities. However, MOFs often exhibit limited thermal stability,\nsusceptibility to degradation, and sensitivity to acidic and basic\nconditions. To address these limitations, the integration of MOFs\nwith polymers has shown promising potential. MOF-polymer composites\ncan enhance drug loading capacity, improve drug solubility, and provide\ngreater thermal stability while mitigating adverse reactions. Polyurethane\n(PU) is widely employed as a drug carrier due to its unique chemical\nproperties and biodegradability. However, PU alone may lead to issues\nsuch as burst drug release and vulnerability to fungal colonization.\nConsequently, MOF-PU composites have garnered significant attention\nas advanced drug carriers, leveraging the synergistic properties of\nboth materials to overcome their individual limitations. This review\nexplores the definition, preparation methods, advantages, and application\ndomains of MOF-PU composites, with a particular emphasis on their\nrole as drug carriers. The objective is to provide a comprehensive\nreference for ongoing and future research into the utilization of\nMOF-PU composites in drug delivery systems. Guizhou Provincial Science and Technology Department 10.13039/501100004001 Qian Ke He Pingtai Rencai-CXTD [2022] 002 Science and Technology Program of Guizhou Province 10.13039/501100018555 QKHZC [2022]132 Guizhou Provincial Key Project of Edible Fungi Science and Technology NA Qian Nong Jun Zhong Dian[2024]01 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 ao5c05108 document-id-new-14 ao5c05108 production-flag-MathML-config-version 3 production-flag-journal-citation-display-style acs-titles production-flag-journal-date-display-style dates-used-rcd-rvd-acc document-id-alt-64 ec26fb1984f1efd2a19191a13005084ba6651f9cf3ba7bb50251f79a4bbdcbe8 1 Introduction The medicine field has\nconsistently prioritized healthcare advancements,\nreflecting a widespread societal interest in health and well-being.\nWithin this field, drug delivery systems (DDSs) are of paramount importance\ndue to their potential for simplified, rapid, and convenient therapeutic\nadministration. However, conventional DDSs often suffer from limitations\nincluding poor target specificity, cytotoxicity, low drug solubility,\nand short in vivo half-life, collectively compromising therapeutic\nefficacy. Metal–organic frameworks\n(MOFs) are a class of porous nanomaterials\nconstructed from metal ions or clusters coordinated by organic linkers.  Polyurethane (PU) is a widely employed\npolymer in drug delivery\napplications due to its advantageous properties, including facile\nsynthesis, biocompatibility, bioinertness, and biodegradability.    2 4 2 4 Table E. coli 1 Types of MOFs Used for Developing\nPU Composite Materials MOF@PU Structure Characteristics Preparation Method Advantage Application References ZIF-8 Zinc based, pore\nsize 1.16 nm, high specific surface area (∼1300 m 2 Electrospinning, solution\nblending Enhance mechanical strength, antibacterial\nproperties (Zn 2+ Wound dressings, gas filtration membranes  UIO-66 Zirconium based, ultrahigh stability (water/acid\nresistance),\nfunctionalized (−NH 2 In situ growth, electrospinning composite Improve thermal\nstability and CO 2 Industrial waste gas treatment, catalytic\ncarriers  HKUST-1 (Cu-BTC) Copper based,\nopen metal sites, high porosity Solution immersion Endow conductivity and catalytic activity (such as VOCs degradation) Flexible sensors, catalytic reactors  MIL-101(Cr) Chromium based, ultra large pores (2.9/3.4 nm), ultrahigh specific surface area (∼4000\nm 2 Melt blending and coating method High drug loading capacity (such as anticancer drugs ∼1.2 g/g), sustained release performance drug delivery system  MOF-5 (IRMOF-1) Zinc based, classic cubic structure, high specific surface\narea (∼3000 m 2 electrostatic spinning Improve the porosity\nof PU for hydrogen storage (∼1.5\nwt %) Energy storage materials  MIL-53(Al) Aluminum based, flexible frame (breathing\neffect), reversible\npore change solution mixing pH responsive\ndrug release, dynamic adsorption Intelligent textiles,\nenvironmental remediation  ZIF-67 Cobalt based, zeolite-like structure, catalytic active sites In situ polymerization Improve the ion conductivity\nof lithium sulfur battery separators\n(∼10 –3 Battery separator\nmaterial  This article\nis a narrative review aimed at sorting out milestone\nresearch and recent key literature in the field through selective\nanalysis MOF@PU The development trajectory and exploration of future\nchallenges. The data collection covers literature from 2010 to 2025\nto ensure the inclusion of foundational research in the field, while\nreflecting the latest developments brought about by technological\ninnovations in the past five years. 2 Advantages\nand Disadvantages of MOFs Metal–organic frameworks\n(MOFs) have garnered significant\nattention due to their structural diversity and potential applications\nacross various fields related to porous materials. 2.1 Well-Defined Structure MOFs are a\nclass of crystalline porous materials with well-defined pore structures\nand adjustable pore diameters, formed through the self-assembly of\nmetal clusters/ions and organic ligands via coordination bonds. Unlike\nsome traditional materials, the well-defined crystal structures of\nMOFs can be determined by single-crystal X-ray diffraction, providing\ndirect evidence for investigating related chemical reaction mechanisms\nand structure–property relationships. 2.2 Structural Diversity The variety\nof MOF materials can be tailored by selecting appropriate metal ions\nand organic ligands under specific reaction conditions. The vast number\nof organic ligands and metal ions allows for the synthesis of a diverse\nrange of MOF materials. Furthermore, the incorporation of binary or\neven multiple organic ligands or metal ions in the reaction system\noffers virtually unlimited possibilities for MOF synthesis. Currently,\nover 80,000 MOF structures are cataloged in the Cambridge Crystallographic\nData Centre (CCDC), and the theoretical number of possible MOFs is\nessentially limitless. 2.3 Designability and Modifiability Functional\nbuilding blocks can be strategically selected or designed to directly\nsynthesize MOF materials with specific functionalities. Alternatively,\ndifferent classes of functional groups can be introduced via postsynthetic\nmodification (PSM) for targeted performance modulation, enabling the\npreparation of MOF materials tailored for specific applications. 2.4 Ultra-High Specific Surface\nArea and Multi-Porous\nStructure MOFs exhibit ultrahigh specific surface areas,\npore volumes, and porosities. 2 3 2.5 Biocompatibility The metal ion centers\nin MOF materials can be selected from biocompatible elements such\nas Fe, Al, Ca, and Mg. The organic ligands can be chosen from biological\norganic molecules such as condensates and adenine, in addition to\ncommon carboxylic acids and nitrogen-containing heterocyclic organic\nligands. The combination of these components under appropriate reaction\nconditions can be directed toward the construction of bio-MOFs, which\nhave been identified as promising materials in the biomedical field.  However, there are still some key defects in the practical\napplication of MOFs, which limit their large-scale commercial development,\nmainly including the following aspects: 2.6 Insufficient\nChemical Stability Most\nMOFs are prone to structural collapse in water, acid, alkali, or high\ntemperature environments, especially those containing metal nodes\nsuch as Zn and Cu, which are prone to hydrolysis, leading to pore\nstructure damage and affecting their long-term performance. 2.7 Low Mechanical Strength MOFs typically\nexhibit brittle crystal structures, poor mechanical strength, and\nare prone to fracture under pressure or shear forces, making it difficult\nto directly process into flexible devices or industrial grade adsorbent\nmaterials. 2.8 The Conductivity\nIs Generally Poor Although some\nMOFs (such as Ni-(HITP) 2 2.9 Large Scale Preparation\nand Cost Issues The synthesis of MOFs typically requires\nhigh-purity organic ligands\nand metal salts, and the solvothermal method is time-consuming and\nenergy consuming, making it difficult to achieve low-cost, large-scale\nproduction. In addition, the high cost of raw materials for some MOFs,\nsuch as rare metals, further raises the threshold for industrial applications. 2.10 Difficulty in Processing\nand Forming MOFs mostly exist in powder form and are difficult\nto directly process\ninto thin films, fibers, or bulk materials. Therefore, polymer composites\nor substrate loading are needed to enhance processability, but some\nporosity and active sites may be sacrificed. 3 Advantages and Disadvantages of Polyurethanes Polyurethanes (PUs) constitute a significant class of thermoplastic\nand thermoset polymers, characterized by their customizable mechanical,\nthermal, and chemical properties through the reaction of diverse polyols\nand polyisocyanates. In biomedical\napplications, PUs has demonstrated significant potential\ndue to their excellent biocompatibility, bacteriostatic properties,\nmechanical performance, adhesion characteristics, and cost-effectiveness.\nTheir adaptability is further enhanced through blending, remolding,\nand modification with other polymers to meet specific application\nrequirements. For instance, Kim et al. 4 Preparation\nof MOF-PU Composites Metal–organic framework-polyurethane\n(MOF-PU) composites\nare synthesized through diverse methodologies, including solvothermal,\nhydrothermal, sonochemical, and in situ synthesis techniques ( Figure 1 The illustration of the preparation of MOF-PU composites\nusing\nthese techniques: solvothermal method. The solvothermal method is a closed-system technique that employs\norganic or nonaqueous solvents under controlled temperatures and pressures.\nAlthough this method is straightforward and offers precise control\nover reaction conditions, it is associated with several drawbacks,\nincluding high temperatures, high pressures, and prolonged reaction\ntimes. Hydrothermal synthesis involves chemical\nreactions in aqueous solutions\nunder high temperatures and pressures. This method is widely recognized\nfor its advantages, including high reactant activity, precise control\nover solution or interfacial reactions, the formation of metastable\nand unique condensed phases, reduced air pollution, and low energy\nconsumption. The sonochemical method\ninvolves applying high-energy ultrasound\n(20 kHz to 10 MHz) to irradiate materials, which enhances their crystallinity\nand growth rate, resulting in energy-efficient products. This technique\navoids the need for high temperatures, high pressures, and long reaction\ntimes. However, the instability of the acoustochemical effect and\nthe immaturity of ultrasound-assisted technology in chemical production\npose significant technical and equipment challenges that require further\nresearch.  In situ synthesis\ninvolves chemical reactions between different\nelements or compounds under specific conditions, generating one or\nmore ceramic phase particles within a metal matrix. This process enhances\nthe properties of the metal alloy.  2 5 Application\nof MOF-PU Composites Metal organic frameworks (MOFs) have\nshown broad application prospects\nin gas adsorption, catalysis, sensing, and drug delivery due to their\nhighly adjustable pore structure, large specific surface area, and\ndiverse functional properties. However, the mechanical strength, chemical\nstability, and functional integration of traditional MOFs still face\nchallenges, limiting their practical applications in complex environments.\nIn recent years, by combining polymer (PU) with MOFs PU@MOFs Hybrid\nmaterials provide new ideas for solving these problems. The introduction\nof PU not only enhances the mechanical toughness and environmental\nstability of MOFs, but also endows the material with dynamic responsiveness,\nselective permeation, or multifunctional integration through synergistic\neffects at the molecular level. For example, the flexible segments\nof PU can effectively alleviate the brittleness problem of MOFs, while\nits rich functional groups provide additional active sites or interface\ninteractions for MOFs, further expanding the design dimensions of\nmaterials. At present, PU@MOFs composite materials have demonstrated\nunique advantages in fields such as flexible electronics, intelligent\ncoatings, efficient separation membranes, and biomedical research,\nbecoming a hot topic in interdisciplinary research. 5.1 Application\nof MOF-PU Composites as Drug Carriers\nin the Pharmaceutical Field Pharmaceutical drug delivery\nsystems, such as ophthalmic drops, oral administration, intravenous\ninjections, and localized treatments, often fail to precisely target\ndrugs or accurately control dosages. Metal–organic framework\n(MOF) nanoparticles have emerged as promising candidates for drug\ntransport systems due to their large surface area and highly tunable\nproperties.    5.1.1 Application of UiO-67-PU Composite Material\nas Drug Carrier in Pharmaceutical Field Traditional eye medications,\ntypically administered as eye drops, often suffer from low drug utilization\nand limited effectiveness in treating eye diseases. Nano drug delivery\nsystems offer a promising alternative by enhancing bioavailability\nand enabling effective drug penetration into deeper tissues, potentially\nrevolutionizing conventional drug delivery methods. UiO-67, a potential\nnanocarrier for intraocular delivery of brimonidine tartrate in chronic\nglaucoma treatment, exhibits excellent properties due to its large\ntetrahedral and octahedral cages within microporous or mesoporous\nnetworks.  Figure Figure Figure Figure 2 (a) Liquid-phase\nadsorption isotherms of brimonidine tartrate at\n298 K in accordance with the Langmuir equation (dashed line). 5.1.2 Application of UiO-66-PU\nComposites as Drug\nCarriers in the Field of Medicine UiO-66 is an ideal candidate\nfor delivering anticancer drugs like doxorubicin (DOX) and paclitaxel\ndue to its high stability in aqueous and blood environments, as well\nas its excellent biocompatibility. Figure Figure Figure 3 (a) X-ray\ndiffraction spectra of UiO-66, UiO-66-DOX and UiO-66-FA. 5.1.3 Other MOF-PU Composites are Used as Drug\nCarriers in the Pharmaceutical Field Recent studies have\nexplored advanced drug delivery systems using MOF-based nanocomposites\nfor glioblastoma treatment. Bazzazzadeh et al. g Figure g Figure Figure    4 (a) Cell viability of\nthe synthesized nanofibers after treatment\nwith U-87 MG glioblastoma cells. Luo et al. Figure Figure Figure 5 (a) Scanning electron\nmicrograph of poly­(DH-Se/PEG/PPG urethane)@MOF.\n(b) Scanning electron micrographs before (upper image) or after (lower\nimage) light stimulation. (c) Illustration of in vitro drug release\nfrom DOX/poly­(DH-Se/PEG/PPG urethane)@MOF nanocomposites under light\nirradiation. (d) In vitro cumulative drug release behavior of DOX/poly­(DH-Se/PEG/PPG\nurethane)@MOF nanocomposites under light irradiation and no light\nconditions. 5.1.4 The Application of MOF-PU Microcapsules\nor Thermogels as Drug Carriers in the Pharmaceutical Field The development of advanced drug delivery systems has been driven\nby the need to improve therapeutic efficacy and address the complexity\nof biochemical processes. Continuous drug administration has revolutionized\ndisease treatment over the years. However, the complexity of biochemical\nprocesses indicates that therapeutic efficacy can be improved by targeting\nmultiple biological pathways or leveraging synergistic effects.  Recent advancements in MOF-based composites\nhave enabled innovative drug delivery systems with enhanced functionality\nand controlled release capabilities. Deleu et al. Figure Figure Figure  5.2 Application of MOF-PU Composite Material as\nDrug Carrier in Agricultural Field The widespread use of\npesticides has raised significant environmental and health concerns,\nnecessitating innovative solutions to reduce their impact. Pesticides\nthreaten ecosystems, nontarget organisms, and human health, leading\nto issues like pest resistance and resource wastage.   Recent studies have demonstrated the potential of MOF-based composites\nin addressing environmental challenges, such as pesticide adsorption\nand extraction. Chen et al. 2 Figure Figure Figure 6 (a) Synthesis and use of MOF encapsulated in\nphotounstable capsules. 7 (a) Scanning electron microscope morphology of sponge,\ncoated sponge\nheld at 70 °C for 4 h and elemental spectrum of ODSOSS/TiO 2 5.3 Application of MOF-PU Polymeric Material as\nCarrier in Medical Devices MOF-based composites have shown\nsignificant potential in biomedical applications, particularly in\nnitric oxide (NO) generation and surface modification for medical\ndevices. Melvin et al. 3 4 3 8 3 tris   Figure Figure 2+ 8 (a) Hypothetical modeling of NO production from MOF composite\nwith\nhigh MOF loading and low PU concentration and low MOF loading and\nhigh PU concentration, both affecting NO production. MOF-PU composites have been further explored for\ntheir potential\nin medical device coatings, with a focus on compatibility and antimicrobial\nproperties. Vornholt et al. Figure Pseudomonas aeruginosa 5.4 MOF-PU Composites are Used as Carriers in\nOther Fields PU-based composites have been extensively studied\nfor their versatile applications, ranging from flame retardancy to\nCO 2  Figure 2 2 2 2 Figure 9 (a) Possible flame retardant mechanisms\nfor TPU/ZIF-67@MXene composites. 6 Summarizing and Looking Forward The field\nof biomedicine has increasingly turned to nanotechnology\nand MOF-based composites to address the limitations of traditional\ntherapeutic drugs, such as low bioavailability, severe adverse effects,\nand rapid elimination from the body.    The complexity\nof the organism necessitates a comprehensive understanding\nof the introduced materials. Currently, there is limited information\navailable regarding the mechanisms of various pathways of MOF-PU composites\nwithin the organism. Additionally, the precise pharmacokinetics of\nthese composites remain undetermined. These limitations significantly\nrestrict the application of MOF-PU composites as carriers in drug\ndelivery systems. MOF materials are typically produced as powders,\nwhich poses significant\nchallenges for their application in large-scale production. These\nchallenges include limited mechanical strength, insufficient chemical\nand abrasion resistance, mass transfer limitations, and poor handling\nproperties. As a result, the systematic synthesis of MOF-PU composites\nhas become a critical area of research to address these limitations. MOF-PU composites are typically synthesized under high temperatures\nand pressures, and these complex conditions significantly limit their\nwidespread practical applications. To address this, developing synthesis\nstrategies with mild conditions, as well as green and low-cost approaches,\nhas become a critical research focus. Furthermore, the effect of the\nreaction environment on the surface properties of the composites requires\nfurther investigation to optimize their performance. The development\nof MOF-PU matrix composites is still in its early\nstages. A comprehensive understanding of the relationship between\ntheir preparation, structure, and application is essential for establishing\ncriteria to select appropriate methods for creating functionally oriented\nmaterials. Despite the challenges in developing MOF-PU matrix composites,\nthe incorporation of polyurethane (PU) has significantly expanded\nthe applications of MOFs, particularly as drug carriers in the pharmaceutical\nfield and beyond. This review focuses on the preparation methods,\nadvantages, and drug carrier applications of MOF-PU composites. These\ncomposites are designed to optimize key properties for biopharmaceutical\napplications, including drug delivery mode, release rate, and utilization\nrate. The development of MOF-PU-based composites holds immense potential\nfor advancing biomedical technology, especially in drug delivery systems,\nand could lead to transformative breakthroughs that enhance human\nlife. The authors gratefully acknowledge support from\nthe Science and Technology Fund Project of Guizhou (no. Qian Ke He\nPingtai Rencai-CXTD [2022]002), Guizhou Provincial Key Project of\nEdible Fungi Science and Technology (no. Qian Nong Jun Zhong Dian[2024]01),\nand the Science and Technology Planning Project of Guizhou Province\n(no. QKHZC [2022]132). The authors\ndeclare no competing financial interest. Anh\nNguyen T. Thi Le P. Ho T. H. Van Vu S. Nu Hoang Lo T. Park I. Pham N. N. T. Quoc\nVo K. Synthesis of Urchin-Like Au@ TiO 2 ChemPluschem 2025 90 1 e202400420 10.1002/cplu.202400420 39331587 El-Hammadi M. M. Arias J. L. Nanomedicine for vaginal drug delivery Theory\nand Applications of Nonparenteral Nanomedicines Academic Press 2021 235 257 10.1016/B978-0-12-820466-5.00011-9 Shen N. Yang Z. Liu S.  99 4 – Nat. Commun 2020 11 1 5571 10.1038/s41467-020-19374-9 33149147 PMC7642432 Lee J. Yu K. Davaa E. Autophagy-Regulating,\nPhotothermal Polydopamine-Coated,\nand Photodynamic Zirconium/Porphyrin-Framed Metal-Organic Frameworks\nfor Enhanced Doxorubicin Therapy in Colon Cancer Biomater. Res. 2025 29 0218 10.34133/bmr.0218 40510845 PMC12160315 Xu S. Fan Z. Yang S. Flexible, self-powered and multi-functional\nstrain sensorscomprising a hybrid of carbon nanocoils and conducting\npolymers Chem. Eng. J 2021 404 126064 10.1016/j.cej.2020.126064 He S. Wu L. Li X. Metal-organic frameworks\nfor advanced drug\ndelivery Acta Pharm. Sin. B 2021 11 8 2362 2395 10.1016/j.apsb.2021.03.019 34522591 PMC8424373 Zhang B. Bai X. Wang S. Preparation of Superhydrophobic Metal-Organic\nFramework/Polymer Composites as Stable and Efficient Catalysts ACS Appl. Mater. Interfaces 2021 13 27 32175 32183 10.1021/acsami.1c07188 34184868 Cai M. Chen G. Qin L. Metal organic frameworks\nas drug targeting delivery vehicles in the treatment of cancer Pharmaceutics 2020 12 3 232 10.3390/pharmaceutics12030232 32151012 PMC7150757 Wang X. Luan F. Yue H. Recent\nadvances of smart\nmaterials for ocular drug delivery Adv. Drug\nDelivery Rev 2023 200 115006 10.1016/j.addr.2023.115006 37451500 Balcerak-Woźniak A. Dzwonkowska-Zarzycka M. Kabatc-Borcz J. A comprehensive review of stimuli-responsive\nsmart polymer materials-recent advances and future perspectives Materials 2024 17 17 4255 10.3390/ma17174255 39274645 PMC11396725 Sobczak M. Kędra K. Biomedical polyurethanes for anti-cancer drug delivery\nsystems: A brief, comprehensive review Int.\nJ. Mol. Sci 2022 23 15 8181 10.3390/ijms23158181 35897757 PMC9329922 Zhang P. Hu J. Bu L. Facile preparation of reduction-responsive\nmicelles basedon biodegradable amphiphilic polyurethane with disulfide\nbonds in the backbone Polymers 2019 11 2 262 10.3390/polym11020262 30960245 PMC6419063 Liu Y. Liu Y. Zang J. Design strategies and applications of ROS-responsive\nphenylborate ester-based nanomedicine ACS Biomater.\nSci. Eng 2020 6 12 6510 6527 10.1021/acsbiomaterials.0c01190 33320631 Yu C. Tan X. Xu Z. Smart drug carrier based on polyurethane material\nfor enhanced and controlled DOX release triggered by redox stimulus React. Funct. Polym 2020 148 104507 10.1016/j.reactfunctpolym.2020.104507 Liu Y. Yang G. Baby T. Stable polymer nanoparticles\nwith exceptionally high drug loading by sequential nanoprecipitation Angew. Chem., Int. Ed 2020 132 12 4750 4758 10.1002/ange.201913539 Wichaita W. Kim Y. G. Tangboriboonrat P. Polymer-functionalized\npolymer nanoparticles and their behaviour in suspensions Polym. Chem 2020 11 12 2119 2128 10.1039/C9PY01558B Lu H. Yang G. Ran F. Polymer-functionalized\nmesoporous carbon nanoparticles on overcoming multiple barriers and\nimproving oral bioavailability of Probucol Carbohydr. Polym 2020 229 115508 10.1016/j.carbpol.2019.115508 31826471 Mahdi E. Cuadrado-Collados M. Silvestre-Albero C. J. Polymer nanocomposites\nfunctionalised with nanocrystals of zeolitic imidazolate frameworks\nas ethylene control agents Mater. Today Adv 2019 2 100008 10.1016/j.mtadv.2019.100008 Zhang J. Ke X. Huang M. NO released via both a Cu-MOF-based donor and\nsurface-catalyzed generation enhances anticoagulation and antibacterial\nsurface effects Biomater. Sci 2022 11 1 322 338 10.1039/D2BM01515C 36448996 He Y. Guo J. Yang X. Highly sensitive humidity-driven actuators\nbased on metal-organic frameworks incorporating thermoplastic polyurethane\nwith gradient polymer distribution RSC Adv 2021 11 60 37744 37751 10.1039/D1RA08174H 35498101 PMC9043914 Shahabi M. Ahmadpour A. Raissi H. Assessment of water purification\nby IRMOF-1 based on rGO as a new nanoengineered adsorbent: Insights\nfrom adsorption mechanism J. Mol. Liq 2024 400 124485 10.1016/j.molliq.2024.124485 Saadavi Y. Ansari-Asl Z. Sacourbaravi R. Superhydrophobic octadecylamine-modified\nMIL-101 (Cr)@ polyurethane sponge composite as an oils/organic solvents\nsorption material Chem. Eng. Res. Des 2024 208 446 455 10.1016/j.cherd.2024.07.019 Férey G. Hybrid porous\nsolids: past, present, future Chem. Soc. Rev 2008 37 1 191 214 10.1039/B618320B 18197340 Janiak C. Vieth J. K. MOFs, MILs and more:\nconcepts, properties and applications\nfor porous coordination networks (PCNs) New\nJ. Chem 2010 34 11 2366 2388 10.1039/c0nj00275e Hoskins B. F. Robson R. Design and construction of a new class of scaffolding-like\nmaterials comprising infinite polymeric frameworks of 3D-linked molecular\nrods. A reappraisal of the zinc cyanide and cadmium cyanide structures\nand the synthesis and structure of the diamond-related frameworks\n[N­(CH 3 4 4 J. Am. Chem. Soc 1990 112 4 1546 10.1021/ja00160a038 Stock N. Biswas S. Synthesis of metal-organic\nframeworks (MOFs): routes\nto various MOF topologies, morphologies, and composites Chem. Rev 2012 112 2 933 969 10.1021/cr200304e 22098087 Haase F. Hirschle P. Freund R. Beyond Frameworks: Structuring\nReticular Materials across Nano-, Meso-, and Bulk Regimes Angew. Chem. Int. Ed 2020 59 50 22350 22370 10.1002/anie.201914461 PMC7756821 32449245 Zhang X. Chen A. Zhong M. Metal-organic frameworks\n(MOFs) and MOF-derived materials for energy storage and conversion Electrochem. Energy Rev 2019 2 29 104 10.1007/s41918-018-0024-x Farha O. K. Eryazici I. Jeong N. C. Metal-organic\nframework\nmaterials with ultrahigh surface areas: is the sky the limit? J. Am. Chem. Soc 2012 134 36 15016 15021 10.1021/ja3055639 22906112 Yang J. Yang Y. W. Metal-organic frameworks\nfor biomedical applications Small 2020 16 10 1906846 10.1002/smll.201906846 32026590 Umapathi A. Kumawat M. Daima H. K. Engineered\nnanomaterials for biomedical\napplications and their toxicity: a review Environ.\nChem. Lett 2022 20 1 445 468 10.1007/s10311-021-01307-7 Devic T. Serre C. High valence 3p and transition metal\nbased MOFs Chem. Soc. Rev 2014 43 16 6097 6115 10.1039/C4CS00081A 24947910 Liu X. Jin X. Li L. Wang J. Yang Y. Cao Y. Wang W. Air-permeable, multifunctional, dual-energy-driven\nMXene-decorated polymeric textile-based wearable heaters with exceptional\nelectrothermal and photothermal conversion performance J. Mater. Chem. A 2020 8 25 12526 12537 10.1039/D0TA03048A Redfern L. R. Farha O. K. Mechanical properties of metal–organic frameworks Chem. Sci 2019 10 46 10666 10679 10.1039/C9SC04249K 32190239 PMC7066669 Rubio-Martinez M. Avci-Camur C. Thornton A. W. Imaz I. Maspoch D. Hill M. R. New synthetic\nroutes towards MOF production at scale Chem.\nSoc. Rev 2017 46 11 3453 3480 10.1039/C7CS00109F 28530737 Zia K. M. Bhatti H. N. Bhatti I. A. Methods\nfor polyurethane and polyurethane\ncomposites, recycling and recovery: A review React. Funct. Polym 2007 67 8 675 692 10.1016/j.reactfunctpolym.2007.05.004 Kojio K. Nozaki S. Takahara A. Influence of chemical\nstructure of hard segments on physical properties of polyurethane\nelastomers: a review J. Polym. Res 2020 27 1 13 10.1007/s10965-020-02090-9 Hale R. C. Laguardia M. J. Harvey E. Potential role of fire\nretardant-treated polyurethane foam as a source of brominated diphenyl\nethers to the US environment Chemosphere 2002 46 5 729 735 10.1016/S0045-6535(01)00237-5 11999796 Franz A. W. Buchholz S. Albach R. W. Towards greener polymers:\nTrends in the German chemical industry Green\nCarbon 2024 2 33 10.1016/j.greenca.2024.02.002 Kim S. Ye S. Adamo A. A biostable, anti-fouling zwitterionic polyurethane-urea\nbased on PDMS for use in blood-contacting medical devices J. Mater. Chem. B 2020 8 36 8305 8314 10.1039/D0TB01220C 32785384 PMC7530005 Zhou W. Gong X. Li Y. Si Y. Zhang S. Yu J. Ding B. Environmentally friendly\nwaterborne polyurethane nanofibrous\nmembranes by emulsion electrospinning for waterproof and breathable\ntextiles Chem. Eng. J 2022 427 130925 10.1016/j.cej.2021.130925 Nikam A. V. Prasad B. L. V. Kulkarni A. A. Wet chemical synthesis of metal oxide\nnanoparticles: a review CrystEngcomm 2018 20 35 5091 5107 10.1039/C8CE00487K Su T. Mi Z. Xia Y. A wearable sweat electrochemical aptasensor\nbased on the Ni-Co MOF nanosheet-decorated CNTs/PU film for monitoring\nof stress biomarker Talanta 2023 260 124620 10.1016/j.talanta.2023.124620 37148688 Feng S. Xu R. New materials in hydrothermal synthesis Acc.\nChem. Res 2001 34 3 239 247 10.1021/ar0000105 11263882 Zhao J. Xu L. Su Y. Zr-MOFs loaded on polyurethane foam by polydopamine\nfor enhanced dye adsorption J. Environ. Sci 2021 101 177 188 10.1016/j.jes.2020.08.021 33334514 Vornholt S. M. Duncan M. J. Warrender S. J. Multifaceted study of\nthe interactions between CPO-27-Ni and polyurethane and their impact\non nitric oxide release performance ACS Appl.\nMater. Interfaces 2020 12 52 58263 58276 10.1021/acsami.0c17937 33325239 Wang R. Chen Y. Liu Y. Metal-organic frameworks\nderived ZnO@MOF@PZS flame retardant for reducing fire hazards of polyurea\nnanocomposites Polym. Adv. Technol. 2021 32 12 4700 4709 10.1002/pat.5462 Xu H. Zeiger B. W. Suslick K. S. Sonochemical\nsynthesis of nanomaterials Chem. Soc. Rev 2013 42 7 2555 2567 10.1039/C2CS35282F 23165883 Fronczak M. Adsorption\nperformance of graphitic carbon nitride-based materials: Current state\nof the art J. Environ. Chem. Eng 2020 8 5 104411 10.1016/j.jece.2020.104411 Zhong G. Liu D. Zhang J. The application\nof ZIF-67 and its derivatives: adsorption,\nseparation, electrochemistry and catalysts J. Mater. Chem. A 2018 6 5 1887 1899 10.1039/C7TA08268A Qian J. Sun F. Qin L. Hydrothermal\nsynthesis of zeolitic imidazolate framework-67\n(ZIF-67) nanocrystals Mater. Lett 2012 82 220 223 10.1016/j.matlet.2012.05.077 Song Q. Nataraj S. K. Roussenova M. V. Zeolitic imidazolate\nframework (ZIF-8) based polymer nanocomposite membranes for gas separation Energy Environ. Sci 2012 5 8 8359 8369 10.1039/c2ee21996d Borse R. A. Kale M. B. Hakke V. S. Synthesis and Characterization\nof Multifunctional Metal-Organic Framework (Ni-ZIF-67) Decorated Waterborne\nPolyurethane (Ni-ZIF-67/WPU) Nanocomposites: Sonochemical Approach Adv. Mater. Interfaces 2023 10 1 2201933 10.1002/admi.202201933 Borse R. A. Kale M. B. Srinivasan S. Sonochemical Approach\nof Highly Thermal, Mechanical, and Corrosion Inhibition Performance\nof Metal-Organic Framework (ZIF-8)-Decorated Waterborne Polyurethane\nNanocomposite Adv. Eng. Mater. 2023 25 9 2201484 10.1002/adem.202201484 Majidi R. Keramatinia M. Ramezanzadeh B. Ramezanzadeh M. Weathering resistance\n(UV-shielding) improvement of a polyurethane\nautomotive clear-coating applying metal-organic framework (MOF) modified\nGO nano-flakes (GO-ZIF-7) Polym. Degrad. Stab 2023 207 110211 10.1016/j.polymdegradstab.2022.110211 Zhuang X. Zhang S. Tang Y. Recent progress of MOF/MXene-based\ncomposites: Synthesis, functionality and application Coord. Chem. Rev 2023 490 215208 10.1016/j.ccr.2023.215208 Wang L. Jin P. Duan S. In-situ incorporation of Copper (II) porphyrin\nfunctionalized zirconium MOF and TiO2 for efficient photocatalytic\nCO 2 Sci. Bull 2019 64 13 926 933 10.1016/j.scib.2019.05.012 36659757 Zhu J. Nie W. Wang Q. In situ growth of copper oxide-graphite carbon\nnitride nanocomposites with peroxidase-mimicking activity for electrocatalytic\nand colorimetricdetection of hydrogen peroxide Carbon 2018 129 29 37 10.1016/j.carbon.2017.11.096 Pinto M. L. Dias S. Pires J. Composite MOF foams: the example\nof UiO-66/polyurethane ACS Appl. Mater. Interfaces 2013 5 7 2360 2363 10.1021/am303089g 23537010 Li J. Gong J. L. Zeng G. M. Zirconium-based metal\norganic frameworks loadedon polyurethane foam membrane for simultaneous\nremoval of dyes with different charges J. Colloid\nInterface Sci 2018 527 267 279 10.1016/j.jcis.2018.05.028 29800876 Mu C. Chen H. Sun X. MoS 2 Prog.\nOrg. Coat 2021 161 106465 10.1016/j.porgcoat.2021.106465 Horcajada P. Serre C. Vallet-Regí M. Sebban M. Taulelle G. Férey G. Metal–Organic\nFrameworks as Efficient Materials\nfor Drug Delivery Angew. Chem., Int. Ed 2006 45 5974 5978 10.1002/anie.200601878 16897793 Huxford R. C. Della J. D. Lin W. Metal–organic\nframeworks as\npotential drug carriers Curr. Opin. Chem. Biol 2010 14 262 268 10.1016/j.cbpa.2009.12.012 20071210 PMC2847625 Wu M. X. Yang Y. W. Metal-organic framework\n(MOF)-based drug/cargo delivery\nandcancer therapy Adv. Mater 2017 29 1606134 10.1002/adma.201606134 Wang L. Zheng M. Xie Z. Nanoscale\nmetal-organic frameworks\nfor drug delivery: aconventional platform with new promise J. Mater. Chem. B 2018 6 707 717 10.1039/C7TB02970E 32254257 Chen Q. Liang S. Thouas G. A. Elastomeric biomaterials for tissue\nengineering Prog. Polym. Sci 2013 38 584 671 10.1016/j.progpolymsci.2012.05.003 Chen F. M. Liu X. Advancing biomaterials\nof human origin for tissue engineering Prog.\nPolym. Sci 2016 53 86 168 10.1016/j.progpolymsci.2015.02.004 27022202 PMC4808059 Azarmgin S. Torabinejad B. Kalantarzadeh R. Polyurethanes and Their\nBiomedical Applications ACS Biomater. Sci.\nEng 2024 10 11 6828 6859 10.1021/acsbiomaterials.4c01352 39436687 Mehdizadeh M. Yang J. Design strategies and\napplications of tissue bioadhesives Marcromol.\nBiosci 2013 13 271 288 10.1002/mabi.201200332 PMC3660144 23225776 Samadi S. Moradkhani M. Beheshti H. Irani M. Aliabadi M. Fabrication\nof chitosan/poly (lactic acid)/graphene oxide/TiO 2 Int. J. Biol. Macromol 2018 110 416 424 10.1016/j.ijbiomac.2017.08.048 28801095 Ardeshirzadeh B. Anaraki N. A. Irani M. Rad L. R. Shamshiri S. Controlled\nreleaseof doxorubicin from electrospun PEO/chitosan/graphene oxide\nnanocomposite nanofibo-us scaffolds Mater.\nSci. Eng., C 2015 48 384 390 10.1016/j.msec.2014.12.039 25579938 Jouybari M. H. Hosseini S. Mahboobnia K. Boloursaz L. A. Moradi M. Irani M. Simultaneous controlled release of\n5-FU, DOX and PTX from chitosan/PLA/5-FU/g-C 3 4 3 4 Colloids Surf., B 2019 179 495 504 10.1016/j.colsurfb.2019.04.026 31005745 Tsou C. H. Lee H. T. Hung W. S. Synthesis and properties\nof antibacterial polyurethane with novel Bis (3-pyridinemethanol)\nsilver chain extender Polymer 2016 85 96 105 10.1016/j.polymer.2016.01.042 Dizaji B. F. Azerbaijan M. H. Sheisi N. Goleij P. Mirmajidi T. Chogan F. Irani M. Sharafian F. Synthesis of PLGA/chitosan/zeolites and PLGA/chitosan/metal organic\nframeworks nanofibers for targeted delivery of Paclitaxel toward prostate\ncancer cells death Int. J. Biol. Macromol 2020 164 1461 1474 10.1016/j.ijbiomac.2020.07.228 32735933 Gandara-Loe J. Ortuño-Lizarán I. Fernández-Sanchez L. Metal-organic frameworks\nas drug delivery platforms for ocular therapeutics ACS Appl. Mater. Interfaces 2019 11 2 1924 1931 10.1021/acsami.8b20222 30561189 Chavan S. Vitillo J. G. Gianolio D. Zavorotynska O. Civalleri B. Jakobsen S. Nilsen M. H. Valenzano L. Lamberti C. Lillerud K. P. Bordiga S. H 2 Storagein\nIsostructural\nUiO-67 and UiO-66 MOFs Phys. Chem. Chem. Phys 2012 14 5 1614 1626 10.1039/C1CP23434J 22187720 Gandara-Loe J. Souza B. E. Missyul A. MOF-based polymeric\nnanocomposite films as potential materials for drug delivery devices\nin ocular therapeutics ACS Appl. Mater. Interfaces 2020 12 27 30189 30197 10.1021/acsami.0c07517 32530261 Chowdhuri A. R. Laha D. Chandra S. Synthesis of multifunctional\nupconversion NMOFs for targeted antitumor drug delivery and imaging\nin triple negative breast cancer cells Chem.\nEng. J 2017 319 200 211 10.1016/j.cej.2017.03.008 Farboudi A. Mahboobnia K. Chogan F. Int. J. Biol. Macromol. 2020 150 178 188 10.1016/j.ijbiomac.2020.02.067 32045607 Zhang Z. Liu C. Akakuru O. ICG and sunitinib-loaded NH 2 Chem. Res. Chin. Univ 2021 37 4 967 974 10.1007/s40242-021-1206-3 Kim K. Seo J. Y. Baek K. Y. Metal-organic framework\n(UiO-66)-dispersed polyurethane composite films for the decontamination\nof methyl paraoxon Polym. Int. 2019 68 8 1502 1508 10.1002/pi.5856 Zhang Y. Zhao J. Wang K. Green Synthesis of Acid-Base\nBi-functional UiO-66-Type Metal-Organic Frameworks Membranes Supported\non Polyurethane Foam for Glucose Conversion ChemistrySelect 2018 3 32 9378 9387 10.1002/slct.201801893 Bazzazzadeh A. Dizaji B. F. Kianinejad N. Fabrication of poly\n(acrylic acid) grafted-chitosan/polyurethane/magnetic MIL-53 metal\norganic framework composite core-shell nanofibers for co-delivery\nof Temozolomide and paclitaxel against glioblastoma cancer cells Int. J. Pharm 2020 587 119674 10.1016/j.ijpharm.2020.119674 32707243 Souza B. E. Donà L. Titov K. Elucidating the drug\nrelease from metal–organic framework nanocomposites via in\nsitu synchrotron microspectroscopy and theoretical modeling ACS Appl. Mater. Interfaces 2020 12 4 5147 5156 10.1021/acsami.9b21321 31904920 Souza B. E. Rudic S. Titov K. Babal A. S. Taylor J. D. Tan J. C. Guest-Host Interactions\nof Nanoconfined Anti-Cancer\nDrug in Metal-Organic Framework Exposed by Terahertz Dynamics Chem. Commun 2019 55 3868 3871 10.1039/C8CC10089F 30801075 Todaro M. Buscarino G. Sciortino L. Alessi A. Messina F. Taddei M. Ranocchiari M. Cannas M. Gelardi F. M. Decomposition\nProcess of Carboxylate MOF HKUST-1 Unveiled at the Atomic Scale Level J. Phys. Chem. C 2016 120 12879 12889 10.1021/acs.jpcc.6b03237 Domán A. Czakkel O. Porcar L. Madarász J. Geissler E. László K. Role of Water Molecules\nin the Decomposition of HKUST-1: Evidence from Adsorption, Thermoanalytical,\nX-Ray and Neutron Scattering Measurements Appl.\nSurf. Sci 2019 480 138 147 10.1016/j.apsusc.2019.02.177 Roth\nStefaniak K. Epley C. C. Novak J. J. McAndrew M. L. Cornell H. D. Zhu J. McDaniel D. K. Davis J. L. Allen I. C. Morris A. J. Grove T. Z. Photo-Triggered\nRelease of 5Fluorouracil from a MOF Drug Delivery Vehicle Chem. Commun 2018 54 7617 7620 10.1039/C8CC01601A 29926872 Rojas S. Guillou N. Horcajada P. Ti-Based NanoMOF as an Efficient\nOral Therapeutic Agent ACS Appl. Mater. Interfaces 2019 11 22188 22193 10.1021/acsami.9b06472 31140777 Doherty J. Raoof A. Hussain A. Wolna M. Cinque G. Brown M. Gardner P. Denbigh J. Live Single Cell Analysis\nUsing Synchrotron FTIR Microspectroscopy: Development of a Simple\nDynamic Flow System for Prolonged Sample Viability Analyst 2019 144 997 1007 10.1039/C8AN01566J 30403210 Elsheikha H. M. Elsaied N. A. Chan K. L. A. Brignell C. Harun M. S. R. Wehbe K. Cinquee G. Label-Free Characterization of Biochemical\nChanges within Human Cells under Parasite Attack Using Synchrotron\nBased Micro-FTIR Anal. Methods 2019 11 2518 2530 10.1039/C8AY02777C Luo Z. Jiang L. Yang S. Light-Induced redox-responsive\nsmart drug deliverysystem by using selenium-containing polymer@MOF\nshell/core nanocomposite Adv. Healthcare Mater 2019 8 15 1900406 10.1002/adhm.201900406 31183979 Rejinold N. S. Baby T. Chennazhi K. P. Multi drug loaded thermo-responsive\nfibrinogen-graft-poly (N-vinyl caprolactam) nanogels for breast cancer\ndrug delivery J. Biomed. Nanotechnol 2015 11 3 392 402 10.1166/jbn.2015.1911 26307823 Ribeiro A. M. Estevinho B. N. Rocha F. Microencapsulation of polyphenols-The\nspecific case of the microencapsulation of Sambucus Nigra L. extracts-A\nreview Trends Food Sci. Technol 2020 105 454 467 10.1016/j.tifs.2019.03.011 Yu L. Jia Q. Lu C. Photothermally responsive, magnetic and flame-retardant\nMOF-based polyurethane sponges for oil/water separation and emulsion\npurification Sep. Purif. Technol 2025 354 129088 10.1016/j.seppur.2024.129088 Deleu W. P. R. Rivero G. Teixeira R. F. A. Metal-organic frameworks\nencapsulated in photocleavable capsules for UV-light triggered catalysis Chem. Mater 2015 27 16 5495 5502 10.1021/acs.chemmater.5b01140 Huo J. Marcello M. Garai A. Bradshaw D. MOF-Polymer composite\nmicrocapsules derived from Pickering emulsions Adv. Mater 2013 25 2717 2722 10.1002/adma.201204913 23554180 Li X. Tan T. T. Y. Lin Q. MOF-Thermogel Composites\nfor Differentiated and Sustained Dual Drug Delivery ACS Biomater. Sci. Eng 2023 9 10 5724 5736 10.1021/acsbiomaterials.3c01103 37729089 Hsieh C. T. Ariga K. Shrestha L. K. Development of MOF reinforcement\nfor structural stability and toughness enhancement of biodegradable\nbioinks Biomacromolecules 2021 22 3 1053 1064 10.1021/acs.biomac.0c00920 33411512 Chen J. Peng Q. Peng X. Recent\nadvances in mechano-responsive hydrogels forbiomedical applications ACS Appl. Polym. Mater 2020 2 3 1092 1107 10.1021/acsapm.0c00019 Lee T. H. Yen C. T. Hsu S. Preparation\nof polyurethane-graphene\nnanocomposite and evaluation of neurovascular regeneration ACS Biomater. Sci. Eng 2020 6 1 597 609 10.1021/acsbiomaterials.9b01473 33463202 Hsieh C. T. Hsu S. Double-network polyurethane-gelatin\nhydrogel with tunable modulus for high-resolution 3D bioprinting ACS Appl. Mater. Interfaces 2019 11 36 32746 32757 10.1021/acsami.9b10784 31407899 Siviter H. Bailes E. J. Martin C. D. Agrochemicals\ninteract synergistically to increase bee mortality Nature 2021 596 7872 389 392 10.1038/s41586-021-03787-7 34349259 Schulz R. Bub S. Petschick L. L. Applied pesticide toxicity shifts toward plantsand invertebrates,\neven in GM crops Science 2021 372 6537 81 84 10.1126/science.abe1148 33795455 Jiang H. Yang S. Tian H. Research\nprogress in the use of liquid-liquid extraction for food flavour analysis Trends Food Sci. Technol 2023 132 138 149 10.1016/j.tifs.2023.01.005 Yamini Y. Rezazadeh M. Seidi S. Liquid-phase microextraction.\nThe different principles and configurations TrAC, Trends Anal. Chem 2019 112 264 272 10.1016/j.trac.2018.06.010 Shao C. Zhao H. Wang P. Recent development\nin functional nanomaterials for sustainable and smart agricultural\nchemical technologies Nano Convergence 2022 9 1 11 10.1186/s40580-022-00302-0 35235069 PMC8891417 Chen X. Ma H. Ji X. Engineering\ngreen MOF-based superhydrophobic sponge for efficiently synchronous\nremoval of microplastics and pesticides from high-salinity water Water Res 2023 243 120314 10.1016/j.watres.2023.120314 37441898 Shi Z. Zeng H. Yuan Y. Constructing superhydrophobicity\nby self-assembly ofSiO2@ polydopamine core-shell nanospheres with\nrobust oil-water separation efficiency and anti-corrosion performance Adv. Funct. Mater 2023 33 16 2213042 10.1002/adfm.202213042 Afsordeh A. Arbabsadeghi A. Javanmardi H. Bagheri H. Incorporation of Cu-TATAB metal-organic framework within\npolyurethane nanocomposite for enhanced thin film microextraction\nof some chlorinated pesticides J. Chromatogr.\nA 2024 1730 465061 10.1016/j.chroma.2024.465061 38909520 Melvin A. C. Reynolds M. M. Systematic Exploration\nof a Catalytic\nMetal-Organic Framework/Polyurethane Composite for Medical Device\nApplications: Effects of MOF Particle Size, MOF Loading, and Polymer\nConcentration on Composite Material Activity Front. Phys 2022 10 880841 10.3389/fphy.2022.880841 Neufeld M. J. Lutzke A. Tapia J. B. Metal-organic\nframework/chitosan hybrid materials promote nitric oxide release from\nSnitrosoglutathione in aqueous solution ACS\nAppl. Mater. Interfaces 2017 9 6 5139 5148 10.1021/acsami.6b14937 28164705 PMC6322424 Neufeld M. J. Lutzke A. Jones W. M. Reynolds M. M. Nitric\nOxide Generation from Endogenous Substrates Using Metal-Organic Frameworks:\nInclusion within Poly­(vinyl Alcohol) Membranes to Investigate Reactivity\nand Therapeutic Potential ACS Appl. Mater.\nInt. 2017 9 41 35628 35641 10.1021/acsami.7b11846 PMC6322413 28976734 Garren M. Maffe P. Melvin A. Griffin L. Wilson S. Douglass M. Surface Catal-yzed Nitric\nOxide Release via a Metal Organic Framework Enhances Antibacterial\nSurface Effects ACS Appl. Mater. Interfaces 2021 13 56931 56943 10.1021/acsami.1c17248 34818503 PMC9728615 Harding J. L. Metz J. M. Reynolds M. M. A. T. Stable,\nand\nBioactive MOF Catalyst for Generating a Localized Therapeutic from\nEndogenous Sources Adv. Funct. Mater 2014 24 47 7503 7509 10.1002/adfm.201402529 Tuttle R. R. Rubin H. N. Rithner C. D. Finke R. G. Reynolds M. M. Copper\nion vs copper metal-organic framework catalyzed\nNO release from bioavailable S-Nitrosoglutathioneen route to biomedical\napplications: Direct 1 J. Inorg. Biochem 2019 199 July 110760 10.1016/j.jinorgbio.2019.110760 31349071 Li D. Liu L. Zhang Z. Xu M. Xu Y. Qian L. An urethane-based phosphonate ester\nfor improving flame retardancy\nand smoke suppression of thermoplastic polyurethane Polym. Degrad. Stab 2021 188 109568 10.1016/j.polymdegradstab.2021.109568 Cao X. Zhao W. Huang J. He Y. Liang X. Su Y. Wu W. Li R. K. Y. Interface engineering of graphene\noxide containing phosphorus/nitrogen towards fire safety enhancement\nfor thermoplastic polyurethane Compos. Commun 2021 27 100821 10.1016/j.coco.2021.100821 Wan M. Shi C. Qian X. Metal-organic framework\nZIF-67 functionalized MXenefor enhancing the fire safety of thermoplastic\npolyurethanes Nanomaterials 2022 12 7 1142 10.3390/nano12071142 35407260 PMC9000687 Sadeghi M. Isfahani A. P. Shamsabadi A. A. Improved gas transport properties of polyurethaneurea membranes through\nincorporating a cadmium-based metal organic framework J. Appl. Polym. Sci 2020 137 20 48704 10.1002/app.48704 Sadiq S. Khan S. Khan I. Khan A. Humayun M. Wu P. Usman M. Khan A. Alanazi A. F. Bououdina M. A critical review on\nmetal-organic frameworks (MOFs) based nanomaterials for biomedical\napplications: Designing, recent trends, challenges, and prospects Heliyon 2024 10 e25521 10.1016/j.heliyon.2024.e25521 38356588 PMC10864983 Xu M. Yim W. Zhou J. The application of organic\nnanomaterials for bioimaging, drug delivery, and therapy: spanning\nvarious domains IEEE Nanotechnol. Mag. 2021 15 4 8 28 10.1109/MNANO.2021.3081758 Du X. Huang J. Zhao C. Retrospective perspectives\nand future trends in nanomedicine treatment: from single membranes\nto hybrid membranes Nanoscale 2025 17 16 9738 9763 10.1039/D4NR04999C 40136036 Edis Z. Wang J. Waqas M. K. Ijaz M. Ijaz M. Nanocarriers-mediated drug delivery systems for anticancer\nagents: an overview and perspectives Int. J.\nNanomed 2021 2021 1313 1330 10.2147/IJN.S289443 PMC7898224 33628022 Scherer F. Anton M. Schillinger U. Magnetofection: enhancing and targeting gene delivery by magnetic\nforce in vitro and in vivo Gene Ther 2002 9 2 102 109 10.1038/sj.gt.3301624 11857068 Haacke E. M. Cheng N. Y. House M. J. Imaging\niron stores in the brain using magnetic resonance imaging Magn. Reson. Imaging 2005 23 1 1 25 10.1016/j.mri.2004.10.001 15733784 Alexiou C. Jurgons R. Schmid R. In vitro\nand in vivo investigations of targeted chemotherapy with magnetic\nnanoparticles J. Magn. Magn. Mater 2005 293 1 389 393 10.1016/j.jmmm.2005.02.036 Chai W. S. Cheun J. Y. Kumar P. S. A review\non conventional and novel materials towards heavy metal adsorption\nin wastewater treatment application J. Cleaner\nProd. 2021 296 126589 10.1016/j.jclepro.2021.126589 Hsu S. Kao Y. C. Biocompatibility\nof poly­(carbonate urethane)­s with\nvarious degrees of nanophase separation Macromol.\nBiosci 2005 5 246 253 10.1002/mabi.200400163 15768444 Miao S. Sun L. Wang P. Liu R. Su Z. Zhang S. Soybean oil-based\npolyurethane networks as candidate\nbiomaterials: Synthesis and biocompatibility Eur. J. Lipid Sci. Technol 2012 114 1165 1174 10.1002/ejlt.201200050 Mathur A. B. Collier T. O. Kao W. J. Wiggins M. Schubert M. A. Hiltner A. Anderson J. M. In vivo biocompatibility\nand biostability of modified polyurethanes J. Biomed. Mater. Res 1997 36 246 257 10.1002/(SICI)1097-4636(199708)36:2&#x0003c;246::AID-JBM14&#x0003e;3.0.CO;2-E 9261687 Barrioni B. R. Carvalho S. M. Oréfice R. L. de Oliveira A. A. R. de Magalhães Pereira M. Synthesis\nand characterization of biodegradable polyurethane films based on\nHDI with hydrolyzable crosslinked bonds and a homogeneous structure\nfor biomedical applications Mater. Sci. Eng.,\nC 2015 52 22 30 10.1016/j.msec.2015.03.027 25953536 Oprea S. Dependence of fungal biodegradation\nof PEG/castor oil-based polyurethane\nelastomers on the hard-segment structure Polym.\nDegrad. Stab 2010 95 2396 2404 10.1016/j.polymdegradstab.2010.08.013 ",
  "metadata": {
    "Title of this paper": "Dependence of fungal biodegradation\nof PEG/castor oil-based polyurethane\nelastomers on the hard-segment structure",
    "Journal it was published in:": "ACS Omega",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489626/"
  }
}