{
  "title": "Paper_1122",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468304 PMC12468304.1 12468304 12468304 41020819 10.3390/cimb47090697 cimb-47-00697 1 Article Sublingual Dripping Pill Formulation of Ganoderma amboinense 4 https://orcid.org/0009-0005-2503-6063 Liu Chin-Feng 1 Pan Chong-Ming 2 https://orcid.org/0000-0002-0203-9465 Lee Chun-Lin 2 * Wang Wenhao Academic Editor 1 cfliu@nttu.edu.tw 2 gh851005@gmail.com * cllee@nttu.edu.tw 28 8 2025 9 2025 47 9 497442 697 22 7 2025 23 8 2025 25 8 2025 28 08 2025 27 09 2025 01 10 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Liver fibrosis remains difficult to treat, in part because many hepatoprotective triterpenoids suffer from poor oral bioavailability and lack of optimized delivery formats. Ganoderma amboinense G. amboinense 4 G. amboinense 4 p G. amboinense Ganoderma amboinense ganoderic acid A sublingual dripping pill liver fibrosis bioavailability This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Liver disease arises from diverse etiologies—including drug-induced injury [ 1 2 3 4 5 6 Fungal-derived medicines have played an important role in both traditional and modern healthcare, offering a wide range of bioactive compounds with anti-inflammatory, antioxidant, immunomodulatory, and hepatoprotective effects. In particular, basidiomycete fungi such as Ganoderma Cordyceps Antrodia Ganoderma 7 4 4 3 3 8 Ganoderma 9 Ganoderma Ganoderma lucidum 10 Ganoderma amboinense Ganoderma G. amboinense 2 11 12 13 14 15 G. lucidum Ganoderma G. amboinense G. lucidum 11 16 17 G. amboinense 18 Ganoderma amboinense Ganoderma Ganoderma lucidum G. amboinense G. amboinense Ganoderma G. amboinense Ganoderma amboinense Ganoderma lucidum G. lucidum 19 20 G. amboinense 11 10 16 17 10 21 22 G. amboinense Sublingual dripping pill formulations harness the dense sublingual vasculature to bypass gastrointestinal degradation and achieve rapid, precise delivery of lipophilic actives [ 23 24 Chenopodium formosanum 25 26 Ganoderma amboinense In this study, we optimized a one-pot extraction of GA to maximize yields of GA-A and β-1,3-glucan and scaled the process to a 300 L pilot plant. This one-pot extraction approach was specifically optimized to enable the simultaneous recovery of ganoderic acid A (GA-A) and β-1,3-glucan from G. amboinense 4 2. Materials and Methods 2.1. Chemicals All solvents and standards were of analytical or HPLC grade. Ethanol (95%) for co-extraction was purchased from ECHO CHEMICAL Co., Ltd. (Miaoli, Taiwan); methanol and acetonitrile for HPLC mobile phases were obtained from Avantor Inc. (Radnor, PA, USA); and formic acid (≥98%) was supplied by Honeywell Taiwan Ltd. (New Taipei, Taiwan). Reference standards of ganoderic acid A (>98% purity) were sourced from Chengdu Must Bio-Technology Co. Ltd. (Chengdu, Sichuan, China), while rutin and β-1,3-glucan standards were acquired from Sigma-Aldrich Co. (St. Louis, MO, USA). Carbon tetrachloride (≥99%) for induction of liver fibrosis was obtained from ALPS GHEM Co., Ltd. (New Taipei, Taiwan) and diluted in olive oil (1:4, v v G26584 2.2. Preparation of Test Substances 2.2.1. Extraction of G. amboinense The Ganoderma amboinense Ganoderma amboinense G. amboinense 2.2.2. Preparation of Dripping Pill Formulations The concentrated G. amboinense w w w w 2.2.3. Quantitative Analysis of Active Constituents GDP samples were dissolved in methanol (1:4, w v 18 27 15 ® 2.3. In Vivo Evaluation in a CCl 4 2.3.1. Animal Housing and Group Allocation Male BALB/c mice (8 weeks old, weighing approximately 20–25 g) were obtained from the National Laboratory Animal Center in Taipei, Taiwan. Animals were maintained under controlled conditions (24 ± 1 °C, 60% relative humidity) on a 12 h light–dark cycle (lights on from 08:00 to 20:00), with free access to standard chow and water throughout the study. Mice were randomized into six experimental groups ( n 4 4 Ganoderma amboinense powder Ganoderma amboinense 28 2.3.2. Fibrosis Induction Protocol The CCl 4 29 4 2.3.3. Sacrifice and Sample Collection At the end of the sixth week, mice were fasted overnight (14 h), weighed, and euthanized by CO 2 g 2.3.4. Serum Biochemistry Serum activities of aspartate aminotransferase (AST) and alanine aminotransferase (ALT) were measured by a certified clinical laboratory using an automated biochemical analyzer (Beckman Coulter AU-700, Beckman Coulter Inc., Brea, CA, USA). 2.3.5. Histopathological Assessment Formalin-fixed liver specimens were paraffin-embedded and sectioned at 3 μm thickness. Sections were stained with hematoxylin and eosin to evaluate general morphology and with picrosirius red to visualize collagen deposition. Stained sections were examined under light microscopy (EX 20, Sunny Optical Technology Co. Ltd., Yuyao, Zhejiang Province, China) at magnifications of 40×, 100×, and 400×, and representative images were captured for semi-quantitative assessment of fibrosis. 2.3.6. Liver Homogenate Preparation and Protein Quantification Frozen liver tissue (~0.1 g) was homogenized in 1 mL ice-cold phosphate-buffered saline (0.1 M, pH 7.4) and centrifuged at 10,000× g 2.3.7. Quantification of Inflammatory and Fibrotic Biomarkers Levels of tumor necrosis factor-α (TNF-α), interleukin-6 (IL-6), connective tissue growth factor (CTGF), transforming growth factor-β1 (TGF-β1), and α-smooth muscle actin (α-SMA) in liver homogenates were measured by enzyme-linked immunosorbent assay (ELISA). Homogenate samples (100 μL) were incubated in antibody-coated 96-well plates at 37 °C for 1 h, washed three times with PBS-Tween 20, then incubated with primary antibody (100 μL) for an additional hour. After washing, wells were incubated with horseradish peroxidase-conjugated secondary antibody (100 μL) for 1 h, followed by incubation with tetramethylbenzidine substrate for 15 min. The reaction was terminated with 2 N sulfuric acid, and absorbance was read at 450 nm. Biomarker concentrations were interpolated from standard curves. 2.4. Statistical Analysis All quantitative data are expressed as mean ± standard deviation. Group comparisons were performed by one-way analysis of variance followed by Duncan’s multiple range test using SPSS version 22.0. Differences were considered statistically significant at p 3. Results 3.1. Ganoderic Acid a of Ganoderma amboinense Fruiting Bodies Dripping Pill Formulation A total of 23 kg of Ganoderma amboinense Ganoderma amboinense w w w w w w Chenopodium formosanum Figure 1 Figure 1 3.2. Body Weight, Liver Weight, and Liver-to-Body Weight Ratio Initial body weights were comparable across all groups (Week 0; p 4 p Table 1 4 p p 4 p Table 1 4 p p 4 4 3.3. Serum AST and ALT Activities Serum aspartate aminotransferase (AST) and alanine aminotransferase (ALT) activities were significantly elevated in the CCl 4 p Table 2 4 p 3.4. Histopathological and Fibrotic Assessment Hematoxylin and eosin staining ( Figure 2 4 Figure 3 4 p p 4 p 3.5. Hepatic Pro-Inflammatory Cytokine Expression CCl 4 p Figure 4 p 4 p p Figure 5 3.6. Hepatic Pro-Fibrotic Marker Expression CCl 4 p Figure 5 4 p 4. Discussion Notably, Hsu et al. (2008) demonstrated that extracts of G. amboinense 18 G. amboinense 16 17 G. amboinense G. lucidum G. lucidum G. amboinense G. amboinense 30 31 32 Dripping pills are an advanced dosage form widely applied in traditional Chinese medicine modernization due to their advantages in enhancing bioavailability, precise dosing, and patient compliance. Particularly in cardiovascular therapeutics, formulations such as Compound Danshen Dripping Pills (CDDP) have been shown to improve outcomes in patients with stable angina and myocardial ischemia by delivering multi-component agents with consistent pharmacokinetics and enhanced systemic exposure [ 21 22 Ganoderma amboinense Ganoderma 11 Ganoderma lucidum Ganoderma G. amboinense Ganoderma G. amboinense 4 The present study demonstrates that the ethanol-extracted dripping pill formulation of G. amboinense 4 4 The GDP formulation represents a pharmacologically optimized delivery system for Ganoderma amboinense G. amboinense Chenopodium formosanum 33 34 In this study, we demonstrated that Ganoderma amboinense 4 Histological examination supported these biochemical findings: GDP-treated livers maintained clearer hepatocyte architecture and exhibited markedly reduced necrosis and collagen deposition, with fibrotic areas diminished by ~60%. These improvements were absent or minimal in the GP group. At the molecular level, the dripping pill significantly suppressed hepatic expression of inflammatory mediators (IL-1β, IL-6, TNF-α, and COX-2) and fibrogenic markers (TGF-β1, CTGF, and α-SMA), while GP displayed only minor, non-significant reductions. The enhanced efficacy of the GDP formulation likely results from multiple factors: (1) improved solubility and absorption of bioactive lanostane triterpenoids due to ethanol extraction; and (2) sustained and controlled release enabled by the dripping pill matrix. Collectively, these features maximize the systemic bioavailability and pharmacological performance of Ganoderma Ganoderma 35 To our knowledge, this is the first study to evaluate the functional efficacy of Ganoderma amboinense 36 5. Conclusions This study is the first to demonstrate that an ethanol-extracted, sublingual dripping pill formulation of Ganoderma amboinense 4 G. amboinense G. amboinense Disclaimer/Publisher’s Note: Author Contributions C.-F.L.: experimental design, data compilation, and paper writing. C.-M.P.: experiments on fermentation, functional compound analysis, and animal tests. C.-L.L.: data compilation, experiment design, funding application, experiment discussion, paper writing, and submission. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was carried out in accordance with the principles outlined in the Declaration of Helsinki and was approved by the Institutional Animal Care and Use Committee (IACUC) of National Taitung University (Approval No. 1020710, the approval date was 21 March 2016). Informed Consent Statement Not applicable. Data Availability Statement All data included in this study are available upon request by contacting the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. References 1. Garcia-Cortes M. Robles-Diaz M. Stephens C. Ortega-Alonso A. Lucena M.I. Andrade R.J. Drug induced liver injury: An update Arch. Toxicol. 2020 94 3381 3407 10.1007/s00204-020-02885-1 32852569 2. Odenwald M.A. Paul S. Viral hepatitis: Past, present, and future World J. Gastroenterol. 2022 28 1405 1429 10.3748/wjg.v28.i14.1405 35582678 PMC9048475 3. Seitz H.K. Bataller R. Cortez-Pinto H. Gao B. Gual A. Lackner C. Mathurin P. Mueller S. Szabo G. Tsukamoto H. Alcoholic liver disease Nat. Rev. Dis. Primers 2018 4 16 Erratum in Nat. Rev. Dis. Primers 2018 4 10.1038/s41572-018-0014-7 30115921 4. Brunt E.M. Wong V.W.-S. Nobili V. Day C.P. Sookoian S. Maher J.J. Bugianesi E. Sirlin C.B. Neuschwander-Tetri B.A. Rinella M.E. Nonalcoholic fatty liver disease Nat. Rev. Dis. Primers 2015 1 15080 10.1038/nrdp.2015.80 27188459 5. Akkız H. Gieseler R.K. Canbay A. Liver fibrosis: From basic science towards clinical progress, focusing on the central role of hepatic stellate cells Int. J. Mol. Sci. 2024 25 7873 10.3390/ijms25147873 39063116 PMC11277292 6. Odagiri N. Matsubara T. Sato-Matsubara M. Fujii H. Enomoto M. Kawada N. Anti-fibrotic treatments for chronic liver diseases: The present and the future Clin. Mol. Hepatol. 2020 27 413 426 10.3350/cmh.2020.0187 33317250 PMC8273638 7. Łysakowska P. Sobota A. Wirkijowska A. Medicinal mushrooms: Their bioactive components, nutritional value and application in functional food production—A review Molecules 2023 28 5393 10.3390/molecules28145393 37513265 PMC10384337 8. Iwaisako K. Jiang C. Zhang M. Cong M. Moore-Morris T.J. Park T.J. Liu X. Xu J. Wang P. Paik Y.-H. Origin of myofibroblasts in the fibrotic liver in mice Proc. Natl. Acad. Sci. USA 2014 111 E3297 E3305 10.1073/pnas.1400062111 25074909 PMC4136601 9. Yuen J.W. Gohel M.D.I. Anticancer effects of Ganoderma lucidum Nutr. Cancer 2005 53 11 17 10.1207/s15327914nc5301_2 16351502 10. Galappaththi M.C. Patabendige N.M. Premarathne B.M. Hapuarachchi K.K. Tibpromma S. Dai D.-Q. Suwannarach N. Rapior S. Karunarathna S.C. A review of Ganoderma Biomolecules 2022 13 24 10.3390/biom13010024 36671409 PMC9856212 11. Yang L. Dong G.-H. Ma Q.-Y. Xie Q.-Y. Guo J.-C. Lu J.-J. Wu Y.-G. Dai H.-F. Zhao Y.-X. Lanostane triterpenoids from the fruiting bodies of Ganoderma amboinense Phytochemistry 2024 218 113952 10.1016/j.phytochem.2023.113952 38096963 12. Chun-Nan L. Shih-Hsieh K. Shen-Jeu W. Steroids of formosan Ganoderma amboinense Phytochemistry 1993 32 1549 1551 10.1016/0031-9422(93)85177-S 13. Yang S.-X. Yu Z.-C. Lu Q.-Q. Shi W.-Q. Laatsch H. Gao J.-M. Toxic lanostane triterpenes from the basidiomycete Ganoderma amboinense Phytochem. Lett. 2012 5 576 580 10.1016/j.phytol.2012.05.017 14. Kao P.-F. Wang S.-H. Hung W.-T. Liao Y.-H. Lin C.-M. Yang W.-B. Structural Characterization and Antioxidative Activity of Low-Molecular-Weights Beta-1,3-Glucan from the Residue of Extracted Ganoderma lucidum BioMed Res. Int. 2012 2012 673764 10.1155/2012/673764 PMC3236510 22187536 15. Wu J.-G. Kan Y.-J. Wu Y.-B. Yi J. Chen T.-Q. Wu J.-Z. Hepatoprotective effect of ganoderma triterpenoids against oxidative damage induced by tert-butyl hydroperoxide in human hepatic HepG2 cells Pharm. Biol. 2016 54 919 929 10.3109/13880209.2015.1091481 26457919 16. Chang U.-M. Li C.-H. Lin L.-I. Huang C.-P. Kan L.-S. Lin S.-B. Ganoderiol F, a ganoderma triterpene, induces senescence in hepatoma HepG2 cells Life Sci. 2006 79 1129 1139 10.1016/j.lfs.2006.03.027 16635496 17. Li C.-H. Chen P.-Y. Chang U.-M. Kan L.-S. Fang W.-H. Tsai K.-S. Lin S.-B. Ganoderic acid X, a lanostanoid triterpene, inhibits topoisomerases and induces apoptosis of cancer cells Life Sci. 2005 77 252 265 10.1016/j.lfs.2004.09.045 15878354 18. Hsu C.-C. Lin K.-Y. Wang Z.-H. Lin W.-L. Yin M.-C. Preventive effect of Ganoderma amboinense Phytomedicine 2008 15 946 950 10.1016/j.phymed.2008.04.011 18579359 19. Gong T. Yan R. Kang J. Chen R. Chemical components of Ganoderma Ganoderma and Health: Biology, Chemistry and Industry Elsevier Amsterdam, The Netherlands 2019 59 106 10.1007/978-981-13-9867-4_3 31677140 20. Baby S. Johnson A.J. Govindan B. Secondary metabolites from Ganoderma Phytochem. 2015 114 66 101 10.1016/j.phytochem.2015.03.010 25975187 21. Liu X.-F. Zhu X.-X. Advances of clinical trials on compound Danshen dripping pills for stable angina pectoris: A perspective Medicine 2025 104 e42175 10.1097/MD.0000000000042175 40258733 PMC12014028 22. Zhang M. Wang W. Sun H. Zhai J. Hu Y. Compound danshen dripping pills vs. nitrates for stable angina pectoris: A systematic review and meta-analysis Front. Cardiovasc. Med. 2023 10 1168730 10.3389/fcvm.2023.1168730 37283584 PMC10240178 23. Pawar P.P. Ghorpade H.S. Kokane B.A. Sublingual route for systemic drug delivery J. Drug Deliv. Ther. 2018 8 340 343 10.22270/jddt.v8i6-s.2097 24. Nayak B.S. Sourajit S. Palo M. Behera S. Sublingual drug delivery system: A novel approach Int. J. Pharm. Drug Anal. 2017 5 399 405 25. Lin T.-A. Ke B.-J. Cheng C.-S. Wang J.-J. Wei B.-L. Lee C.-L. Red quinoa bran extracts protects against carbon tetrachloride-induced liver injury and fibrosis in mice via activation of antioxidative enzyme systems and blocking TGF-β1 pathway Nutrients 2019 11 395 10.3390/nu11020395 30781895 PMC6412755 26. Eira A. Gonçalves M.B.S. Fongang Y.S.F. Domingues C. Jarak I. Mascarenhas-Melo F. Figueiras A. Unlocking the potential of Ganoderma lucidum Pharmaceutics 2025 17 422 10.3390/pharmaceutics17040422 40284417 PMC12030363 27. Yang Z.-K. Han W. Feng N. Zhang J.-S. Wang C.-G. Zhou J. Wang J.-Y. Tang Q.-J. Determination of triterpenoids in Ganoderma lingzhi Mycosystema 2020 39 184 192 28. U.S. Food and Drug Administration FDA Guidance for Industry: Estimating the Maximum Safe Starting Dose in Initial Clinical Trials for Therapeutics in Adult Healthy Volunteers 2005 Available online: https://www.fda.gov/media/72309/download (accessed on 15 August 2025) 29. Ke B.-J. Lee C.-L. Cordyceps cicadae NTTU 868 mycelium prevents CCl4-induced hepatic fibrosis in BALB/c mice via inhibiting the expression of pro-inflammatory and pro-fibrotic cytokines J. Funct. Foods 2018 43 214 223 10.1016/j.jff.2018.02.010 30. Biaosheng L. Jinping W. Wuchang W. Tong C. Weiming L. Shaoxin S. Action mechanism of β-glucan from Ganoderma sinense Food Sci. 2025 46 185 195 31. Murphy E.J. Rezoagli E. Major I. Rowan N.J. Laffey J.G. β-glucan metabolic and immunomodulatory properties and potential for clinical application J. Fungi 2020 6 356 10.3390/jof6040356 PMC7770584 33322069 32. Zhao S. Zhang S. Zhang W. Gao Y. Rong C. Wang H. Liu Y. Wong J.H. Ng T. First demonstration of protective effects of purified mushroom polysaccharide-peptides against fatty liver injury and the mechanisms involved Sci. Rep. 2019 9 13725 10.1038/s41598-019-49925-0 31548551 PMC6757109 33. Jang H. Han S.-C. Lee J. Shin H.-Y. Hwang J.H. Ha J.-H. Anti-inflammatory effects of rutin in lipopolysaccharide-stimulated canine macrophage cells Nutr. Res. Pract. 2024 19 143 152 10.4162/nrp.2025.19.1.143 39959750 PMC11821770 34. Wang Y. Wang Q. Wang G. Zhang Q. Guo Y. Su X. Tang Y. Koci M. Zhang J. Ma Q. Rutin, a natural flavonoid glycoside, ameliorates zearalenone induced liver inflammation via inhibiting lipopolysaccharide gut leakage and NF-κB signaling pathway in mice. Food Chem Toxicol. 2024 191 114887 10.1016/j.fct.2024.114887 39053873 35. Hou L.-S. Cui Z.-Y. Sun P. Piao H.-Q. Han X. Song J. Wang G. Zheng S. Dong X.-X. Gao L. Rutin mitigates hepatic fibrogenesis and inflammation through targeting TLR4 and P2X7 receptor signaling pathway in vitro and in vivo J. Funct. Foods 2020 64 103700 10.1016/j.jff.2019.103700 36. Zhang K. Ma Y. Luo Y. Song Y. Xiong G. Ma Y. Sun X. Kan C. Metabolic diseases and healthy aging: Identifying environmental and behavioral risk factors and promoting public health Front. Public Health 2023 11 1253506 10.3389/fpubh.2023.1253506 37900047 PMC10603303 Figure 1 Appearance and HPLC–PDA profile of Ganoderma amboinense A G. amboinense B C G. amboinense Figure 2 Histopathological evaluation of liver sections from CCl 4 Ganoderma amboinense A B 4 n G. amboinense G. amboinense Figure 3 Picrosirius red staining of collagen deposition in liver sections from CCl 4 Ganoderma amboinense A B 4 n G. amboinense G. amboinense n p Figure 4 Hepatic pro-inflammatory cytokine and COX-2 expression in CCl 4 Ganoderma amboinense A B C D 4 n G. amboinense G. amboinense n p Figure 5 Inhibition of hepatic profibrotic marker expression in CCl 4 Ganoderma amboinense A B C 4 n G. amboinense G. amboinense n p cimb-47-00697-t001_Table 1 Table 1 Effects of normal control, fibrosis control, and different Ganoderma amboinense 4 Groups Body Weight (g) Liver Weight (g) Liver Weight/Body Weight (%) NOR 27.6 ± 0.8 d 1.2 ± 0.05 a 4.71 ± 0.27 a CCl 4 23.7 ± 1.7 a 1.7 ± 0.02 c 6.47 ± 0.42 c GP 24.9 ± 2.0 ab 1.3 ± 0.13 ab 5.47 ± 0.18 b GDP 1x 25.9 ± 1.1 bc 1.3 ± 0.18 ab 5.70 ± 0.21 b GDP 5x 26.1 ± 0.7 bcd 1.4 ± 0.14 ab 5.44 ± 0.33 b GAA 26.9 ± 1.1 cd 1.4 ± 0.12 b 5.68 ± 0.25 b Mice received intraperitoneal injections of olive oil (NOR) or CCl 4 n G. amboinense G. amboinense n p cimb-47-00697-t002_Table 2 Table 2 The effects of extracted dripping pills of Ganoderma amboinense 4 Groups AST Activity (U/L) ALT Activity (U/L) NOR 71.9 ± 5.0 a 37.7 ± 1.8 a CCl 4 84.1 ± 8.8 b 59.1 ± 3.8 d GP 78.1 ± 8.8 ab 54.7 ± 5.9 cd GDP 1 x 74.7 ± 5.6 a 52.7 ± 3.9 c GDP 5 x 71.9 ± 4.1 a 46.6 ± 6.6 b GAA 76.1 ± 4.5 a 51.1 ± 4.9 bc Mice received intraperitoneal injections of olive oil (NOR) or CCl 4 n G. amboinense G. amboinense n p ",
  "metadata": {
    "Title of this paper": "Metabolic diseases and healthy aging: Identifying environmental and behavioral risk factors and promoting public health",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468304/"
  }
}