{
  "title": "Paper_609",
  "abstract": "pmc Biomed Res Int Biomed Res Int 2029 bmri BMRI BioMed Research International 2314-6133 2314-6141 Wiley PMC12407312 PMC12407312.1 12407312 12407312 41031244 10.1155/bmri/4196295 BMRI4196295 1 Research Article Article In Silico Investigation of Phytochemicals From Clinically Tested Herbal Extracts as Potential Dihydrofolate Reductase Inhibitors for Buruli Ulcer Mohamed Alkhair Adam Khalil https://orcid.org/0009-0004-1610-8531  1 Woasiedem Tamekloe https://orcid.org/0009-0003-1063-5114  1 Appiah-Ofori Philip Collins https://orcid.org/0009-0002-5319-4518  1 Adam Esraa Mohammed Abdulmahmoud https://orcid.org/0009-0003-6405-0963  1 Obiri Samuel Asiamah https://orcid.org/0009-0004-5891-2886  2 Borquaye Lawrence Sheringham https://orcid.org/0000-0002-5037-0777  3  4 Adokoh Christian K. https://orcid.org/0000-0002-4341-3361  5 Elamin Ghazi https://orcid.org/0000-0003-0621-9057  6 Asiamah Isaac https://orcid.org/0000-0003-3451-4379  2 iasiamah1@ucc.edu.gh Panja Sourav sourav.panja@vumc.org   1 Department of Biomedical Sciences School of Allied Health Sciences College of Health and Allied Sciences University of Cape Coast Cape Coast Ghana ucc.edu.gh   2 Department of Chemistry School of Physical Sciences College of Agriculture and Natural Sciences University of Cape Coast Cape Coast Ghana ucc.edu.gh   3 Department of Chemistry Kwame Nkrumah University of Science and Technology Kumasi Ghana knust.edu.gh   4 Central Laboratory Kwame Nkrumah University of Science and Technology Kumasi Ghana knust.edu.gh   5 Department of Forensic Sciences School of Biological Sciences College of Agriculture and Natural Sciences University of Cape Coast Cape Coast Ghana   6 Department of Pharmaceutical Chemistry College of Pharmacy Karary University Khartoum Sudan karary.edu.sd 03 9 2025 2025 2025 479482 4196295 29 7 2025 18 10 2024 08 8 2025 03 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Alkhair Adam Khalil Mohamed et al. BioMed Research International published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Buruli ulcer (BU), a neglected tropical disease caused by Mycobacterium ulcerans Nicotiana tabacum Mangifera indica Carica papaya Solanum rugosum in silico M. ulcerans Mu Δ G bind Δ bind Mu Δ G bind Δ G bind Keywords Buruli ulcer dihydrofolate reductase (DHFR) in silico Mangifera indica MD simulations molecular docking Mycobacterium ulcerans Nicotiana tabacum phytochemicals pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.2 mode:remove_FC converted:03.09.2025  Mohamed Alkhair Adam Khalil Woasiedem Tamekloe Appiah‐Ofori Philip Collins Adam Esraa Mohammed Abdulmahmoud Obiri Samuel Asiamah Borquaye Lawrence Sheringham Adokoh Christian K. Elamin Ghazi Asiamah Isaac In Silico Investigation of Phytochemicals From Clinically Tested Herbal Extracts as Potential Dihydrofolate Reductase Inhibitors for Buruli Ulcer BioMed Research International 2025 4196295 2025 10.1155/bmri/4196295  Academic Editor: 1. Introduction Buruli ulcer (BU), a neglected tropical disease caused by Mycobacterium ulcerans 1 2 3 4 Nicotiana tabacum Mangifera indica Carica papaya Solanum rugosum 5 6 M. ulcerans 7 Dihydrofolate reductase (DHFR) is an essential enzyme in folate metabolism, critical for DNA synthesis and mycobacterial survival, making it a validated drug target [ 8 11 9 Mycobacterium tuberculosis 12 Staphylococcus aureus 13 Homo sapiens 14 15 Plasmodium falciparum 16 M. ulcerans Mu This study employed an in silico M. ulcerans Mu 7 Mu 2. Materials and Methods 2.1. Ligand Preparation A library of 172 phytochemicals was built from compounds that have been previously elucidated from the four medicinal plants ( N. tabacum, M. indica, S. rugosum C. papaya 7 17 18 19 2.2. Protein Preparation The crystallized structure of M. ulcerans Mu https://www.rcsb.org/structure/6UWW R R R 2.3. Validation of Docking Protocol The docking protocol was validated by redocking the native ligand (P218) using a grid box defined by its position and dimensions. This grid box, centered on the native ligand, was subsequently used for ligands docking. The poses of the cocrystallized and the redocked native ligands were compared by calculating the root mean square deviation (RMSD). The protocol is considered valid if the RMSD is less than 2.0 [ 20 21 2.4. Molecular Docking Molecular docking was performed using Glide in Schrödinger suite [ 22 Mu X Y Z 2.5. Prime MM‐GBSA Calculations The Top 30 phytochemicals with the highest docking scores were rescored using the Prime MM‐GBSA module [ 23 Δ G 24 24 25 Mu 2.6. Pharmacokinetics, Toxicity, and Drug‐Likeness Properties The lack of pharmacokinetics characterization leads to a high attrition rate in potential drugs as they progress to clinical trials, resulting in delayed drug development and the wastage of limited resources, including funds. In silico systems that help predict pharmacokinetic parameters and drug‐likeness characteristics of molecules are therefore invaluable in minimizing this challenge in drug discovery and development. In this study, we employed the SwissADME web tool ( http://www.swissadme.ch/ 26 https://biosig.lab.uq.edu.au/deeppk/ 27 2.7. MD Simulations To rigorously evaluate the dynamic behavior, interaction stability, and binding affinity of the most promising phytochemicals, extended all‐atom MD simulations were performed. A total of 10 molecular systems were prepared for MD simulations, including the Apo (unbound) Mu 28 31 Mu 28 32 33 2.8. Simulation Protocol All MD simulations were executed using the AMBER18 software suite with the PMEMD (Particle Mesh Ewald MD) engine [ 34 35 36 37 Mu 38 Mu 39 2.9. Post‐MD Simulation Analysis The simulation trajectories for both the Apo and ligand‐bound Mu 40 Mu 41 42 43 2.10. Calculations of the Free Energy of Protein–Ligand Interactions Using MM/GBSA The MM/GBSA method was employed to determine the binding free energy, including van der Waals, electrostatic, and solvation contributions, for each ligand– Mu 44 47 (i) Δ G bind = G complex − G protein − G inhibitor , (ii) Δ G bind = E gas + G sol − TS . The Δ G bind (iii) E gas = E int + E vdw + E ele . In this context, E gas E int E vdw E elec The equation used for calculating the solvent energy is as follows: (iv) G sol = G GB + G SA , (v) G SA = γ SASA .  G GB G SA b c 48 Mu 2.11. PCA PCA was utilized to explore the dynamic behaviour of Mu 49 50 C 51 C (1) C i = q i − q i q j − q j i , j = 123 , , ⋯ , N . The variables q  i q  j i th j th α N α 52 C Λ (2) Λ = T T C i j T . The eigenvalues here indicate the system’s total mean‐square variation along each eigenvector, and the eigenvectors point in the directions of motion to ( q  i 3. Results and Discussions 3.1. Docking Validation The use of redocking in validating docking protocols helps in assessing accuracy and benchmarking performance. When there is a high level of repetition (RMSD < 2) between the experimentally determined and redocked poses, it gives confidence about the predictability of the docking results [ 20 21 53 1 2 Figure 1 Validation of docking protocol through redocking of native ligand (P218) on Mu Figure 2 Comparison of binding poses and ligand–protein interactions at the Mu (a) (b) 3.2. Molecular Docking Molecular docking using Glide XP successfully identified a range of phytochemicals with favorable binding poses within the active site of Mu Glide successfully docked 155 out of the 172 phytochemicals (90.0%) against the Mu Δ G bind M. indica N. tabacum C. papaya Solanum torvum Table 1 Δ G bind Table 1 Docking scores, MM‐GBSA binding affinities to Mu  No.  Compound  Origin  Docking score  MM-GBSA, Δ G (kcal/mol) R 1  P218  Cocrystallized ligand  −11.88  −70.5 R 2  Trimethoprim  Standard drug  −9.29  −64.39 1 6‐O‐Galloylglucose  Mangifera indica −9.99 −64.06 R 3  Methotrexate  Standard drug  −10.04  −58.63 2 3‐Glucosylmaclurin  Mangifera indica −10.62 −56.03 3 Procyanidin  Mangifera indica −11.14 −54.17 4 Ellagic acid  Mangifera indica −8.16 −53.31 5 Kaempferol‐3‐O‐rutinoside  Nicotiana tabacum −11.23 −53.2 6 Neochlorogenic acid  Nicotiana tabacum −9.06 −52.57 7 Luteolin 7‐O‐glucoside  Mangifera indica −10.08 −52.4 8 Rosmarinic acid  Mangifera indica −8.25 −50.53 9 Epigallocatechin Gallate  Mangifera indica −8.61 −50.46 10 Isovitexin  Mangifera indica −8.85 −50.3 11 Rutin  Nicotiana tabacum −11.8 −48.05 12 Myricetin  Mangifera indica −8.88 −47.09 13 Mangiferin  Mangifera indica −9.29 −44.92 14 Tetra‐o‐galloylglucose  Mangifera indica −13.6 −44.68 15 Vitexin  Mangifera indica −9.8 −42.98 16 Taxifolin  Mangifera indica −8.07 −42.77 17 Torvoside E  Solanum torvum −9.19 −42.16 18 Iriflophenone 3‐C‐glucoside  Mangifera indica −9.65 −42.03 19 Hyperoside  Mangifera indica −9.31 −41.72 20 Torvanol A  Solanum torvum −8.32 −40.35 21 Isomangiferin  Mangifera indica −10.46 −39.87 22 Apigetrin  Mangifera indica −9.65 −39.24 23 Quercetin‐3‐glucoside  Mangifera indica −9.17 −39.14 24 Beta‐glucogallin  Mangifera indica −8.32 −38.14 25 Riboflavin  Carica papaya −9.27 −37.65 26 Indolylglucosinolate  Carica papaya −10.88 −35.6 27 Quercetin‐3‐O‐deoxyhexosyl (1‐2) pentoside  Mangifera indica −10.39 −32.14 28 Apigenin 7‐O‐diglucuronide  Mangifera indica −10.34 −26.63 29 Querciturone  Mangifera indica −8.89 −24.89 30 Isoquercitin  Mangifera indica −10.41 −24.51  Note: Comparison of the protein–ligand interactions between Mu 3 Mu 4 5 6 7 Mu Figure 3 Ligand–protein interaction fingerprints for the Top 30 docked compounds at the Mu Figure 4 Protein–ligand interactions of (a) methotrexate, (b) trimethoprim, and (c) P218. (a) (b) (c) Figure 5 Protein–ligand interactions for (a) tetra‐O‐galloylglucose, (b) kaempferol‐O‐rutinoside, and (c) 3‐glucosylmaclurin with Mu Figure 6 Protein–ligand interactions of (a) 6‐O‐galloylglucose and (b) neochlorogenic acid with Mu (a) (b) Figure 7 Protein–ligand interactions of (a) procyanidin and (b) ellagic acid with Mu (a) (b) 3.3. Prime MM‐GBSA Calculations The MM/GBSA method combines molecular mechanics force fields (MM) with implicit solvation models (generalized born and surface area (GBSA)) to estimate the binding free energy ( Δ G 24 2 Δ G 2 Mu M. indica N. tabacum Table 2 Top 6 phytochemicals with the highest binding affinities.  No.  Compound  Origin  Docking score  MM-GBSA, Δ G (kcal/mol) R 1  P218  Cocrystallized ligand −11.88 −70.5 R 2  Trimethoprim  Standard drug −9.29 −64.39 1 6‐O‐Galloylglucose  Mangifera indica −9.99 −64.06 R 3  Methotrexate  Standard drug −10.04 −58.63 2 3‐Glucosylmaclurin  Mangifera indica −10.62 −56.03 3 Procyanidin  Mangifera indica −11.14 −54.17 4 Ellagic Acid  Mangifera indica −8.16 −53.31 5 Kaempferol‐3‐O‐rutinoside  Nicotiana tabacum −11.23 −53.2 6 Neochlorogenic acid  Nicotiana tabacum −9.06 −52.57  Note: It is important to point out that docking scores and MM‐GBSA are two different methods for evaluating ligand–protein binding affinity. Docking scores employ empirical scoring functions to estimate binding affinity based on generated poses. Although docking scores are fast and suitable for the initial screening of large ligand libraries, they are less accurate in predicting absolute binding affinity [ 54 55 56 On the other hand, MM‐GBSA utilizes molecular mechanics and free energy calculations to consider enthalpic contributions and thus provide more accurate binding affinity predictions [ 54 54 57 24 E 58 Δ G bind = E _ complex minimized – E _ ligand minimized – E _ receptor minimized . The Prime MM‐GBSA approach offers significant time efficiency compared to standard MM‐GBSA, which relies on lengthy MD simulations [ 56 59 60 3.4. In Silico To mitigate the high attrition rates common in later stages of drug development, the early in silico 3.5. Physicochemical Properties and Drug‐Likeness The drug‐likeness of the compounds was initially assessed using the established rules of Lipinski and Veber, which are primarily calibrated for orally bioavailable drugs. These rules suggest that drug‐like molecules should generally possess a molecular weight (MW) ≤ 500 g/mol, a calculated logarithm of the partition coefficient (Log p 2 61 62 As detailed in Table 3 2 63 64 Table 3 Drug‐likeness and lead‐likeness predictions from SwissADME.  Compound  MW (g/mol)  L o g p  #HBA  #HBD  TPSA  #RB  Number of violations  Lipinski  Veber  Lead-likeness P218 360.41 1.07 5 3 137.66 10 0 0 2 Kaempferol‐3‐O‐rutinoside 594.52 −3.43 15 9 249.2 6 3 1 1 Procyanidin 594.52 −0.6 13 10 229.99 4 3 1 1 3‐Glucosylmaclurin 424.36 −2.77 11 9 208.37 4 2 1 1 Methotrexate 454.44 −0.73 9 5 210.54 10 1 1 2 6‐O‐Galloylglucose 332.26 −2.39 10 7 184.98 8 1 1 1 Trimethoprim 291.33 0.41 4 3 106.76 5 0 0 0 Neochlorogenic acid 353.3 −1.05 9 5 167.58 5 0 1 1 Ellagic acid 302.19 0.14 8 4 141.34 0 0 1 0  Note: p p 3.6. Pharmacokinetic Properties: ADME 3.6.1. Absorption and Distribution The predicted human intestinal absorption for all six phytochemicals was low, with most compounds predicted to be “nonabsorbed” (Table 4 Table 4 Predicted absorption and distribution properties.  Compound  Human intestinal absorption  Skin permeability ( K p , cm/s)  P-gp substrate  P-gp inhibitor  BBB permeable P218 Absorbed −3.06 No No Yes Kaempferol‐3‐O‐rutinoside Nonabsorbed 6.18 Yes No No Procyanidin Nonabsorbed 12.68 Yes Yes No 3‐Glucosylmaclurin Nonabsorbed 2.05 No No No Methotrexate Absorbed −2.46 No No Yes 6‐O‐Galloylglucose Nonabsorbed −0.72 No No No Trimethoprim Absorbed −2.55 No No Yes Neochlorogenic acid Absorbed −2.75 No No No Ellagic acid Absorbed −0.72 No No No Of paramount importance for a topical therapy is skin permeability, which dictates the extent to which a compound can penetrate the stratum corneum to reach its site of action while minimizing leakage into systemic circulation [ 65 K p K p K p M. ulcerans P‐glycoprotein (P‐gp) is a key efflux transporter that can limit the bioavailability of xenobiotics [ 66 3.6.2. Metabolism and Excretion The interaction of the compounds with the cytochrome P450 (CYP) enzyme system is critical for assessing potential drug–drug interactions. CYP450 enzymes are essential in drug and xenobiotic metabolism. They account for about 80% of the biotransformation of all drugs in clinical use [ 67 68 5 69 Table 5 Predicted metabolism and excretion properties.  Compound  CYP1A2 inhibitor  CYP2C9 inhibitor  CYP2C19 inhibitor  CYP2D6 inhibitor  CYP3A4 inhibitor  Total clearance (log mL/min/kg)  T 1/2 (h) P218 No No No No No 4.57 < 3 Kaempferol‐3‐O‐rutinoside No No No No No 11.92 < 3 Procyanidin No Yes No No No 12.56 < 3 3‐Glucosylmaclurin No No No No No 12 < 3 Methotrexate No No No No No 0.6 < 3 6‐O‐Galloylglucose No No No No No 11.84 ≥ 3 Trimethoprim No No No No No 5.22 < 3 Neochlorogenic acid No No No No No 6.54 ≥ 3 Ellagic acid Yes Yes Yes No No 7.7 < 3 The predicted total clearance and half‐life ( T 1/2 3.7. Toxicity Profile Toxicity profiles of the compounds were evaluated and presented in Table 6 Table 6 Predicted toxicity profile.  Compound  Skin sensitization  AMES mutagenicity  HERG I inhibitor  Hepatotoxicity (DILI)  MTD (log mg/kg/day)  Rat oral LD  50 (predicted) P218 Safe Safe Safe Toxic 0.24 Toxic Kaempferol‐3‐O‐rutinoside Safe Safe Safe Safe 0.94 Toxic Procyanidin Safe Safe Safe Toxic 1.51 Toxic 3‐Glucosylmaclurin Safe Toxic Safe Safe 0.70 Toxic Methotrexate Safe Safe Safe Toxic ‐0.73 Toxic 6‐O‐Galloylglucose Safe Safe Safe Safe 1.16 Safe Trimethoprim Safe Safe Toxic Toxic 0.38 Toxic Neochlorogenic acid Safe Safe Safe Safe 0.69 Safe Ellagic acid Safe Safe Safe Toxic 1.14 Toxic Abbreviations: DILI: drug‐induced liver injury; MTD, maximum tolerated dose. 3.7.1. Dermal and Local Toxicity For any topically applied agent, the potential to cause skin sensitization is a primary safety concern. Encouragingly, all six phytochemicals, as well as the standard drugs, were predicted to be nonsensitizers. This is a critical and highly favorable finding that strongly supports their potential for development as topical treatments for BU. 3.7.2. Systemic Toxicity Acute systemic toxicity is often assessed by the oral lethal dose 50 (LD 50 70 In silico 50 50 50 71 72 3.7.3. hERG Inhibition Blockade of the hERG (human Ether‐a‐go‐go‐Related Gene) potassium channel is a major cause of drug‐induced cardiotoxicity [ 73 74 3.7.4. Mutagenicity (AMES Test) The Deep‐PK model predicted that 3‐glucosylmaclurin may be mutagenic. This is a noted liability for some flavonoid‐like structures, which can be metabolically activated to reactive species [ 75 3.7.5. Hepatotoxicity The model predicted a potential for drug‐induced liver injury (DILI) for most of the tested compounds, including the standards. As with other systemic toxicities, this risk is contingent upon significant systemic absorption and liver exposure, which is not anticipated with topical application of these poorly permeable molecules. In summary, the comprehensive ADMET and toxicity analysis, reframed for the context of a topical therapy, presents a promising profile for the investigated phytochemicals. The most critical safety parameters for this application—skin sensitization and skin permeability—are highly favorable. While some potential systemic toxicities are flagged by the in silico 3.8. MD Simulations 3.8.1. Binding Free Energy Analysis Identified New Lead Candidates The MM/GBSA method was used to calculate the average binding free energy ( Δ G bind 7 Δ G bind Δ G bind Δ G bind Δ G bind Δ G bind Δ G bind Δ G bind Table 7 Post‐MD simulations MM/GBSA‐based average binding free energy profiles of various ligands when bound to Mu  Systems  Energy components (kcal/mol)  Ligand  Δ E  v d w  Δ E  e l e  Δ G  g a s  Δ G  s o l  Δ G  b i n d P218 −38.60 ± 0.10 −218.75 ± 0.51 −257.35 ± 0.51 197.63 ± 0.40 −59.73 ± 0.16 Kaempferol‐3‐O‐rutinoside −56.21 ± 0.09 −39.28 ± 0.18 −95.49 ± 0.21 43.87 ± 0.12 −51.62 ± 0.13 Neochlorogenic acid −38.22 ± 0.13 −102.49 ± 0.54 −140.70 ± 0.59 91.27 ± 0.43 −49.44 ± 0.24 3‐Glucosylmaclurin −42.46 ± 0.09 −56.73 ± 0.22 −99.19 ± 0.22 54.00 ± 0.17 −45.19 ± 0.09 Methotrexate −55.31 ± 0.11 −45.70 ± 0.26 −101.00 ± 0.30 56.82 ± 0.23 −44.18 ± 0.11 Procyanidin −56.56 ± 0.14 −45.18 ± 0.21 −101.74 ± 0.25 58.04 ± 0.15 −43.69 ± 0.16 Trimethoprim −36.79 ± 0.07 −94.99 ± 0.23 −131.78 ± 0.23 90.78 ± 0.19 −41.01 ± 0.08 6‐O‐Galloylglucose −32.44 ± 0.12 −50.63 ± 0.31 −83.06 ± 0.36 53.39 ± 0.23 −29.68 ± 0.16 Ellagic acid −34.25 ± 0.08 −23.99 ± 0.32 −58.24 ± 0.31 29.83 ± 0.25 −28.41 ± 0.11  Note: Abbreviations: Δ E ele Δ E vdw Δ G bind Δ G gas Δ G sol 3.8.2. Per‐Residue Binding Contribution Analysis Decomposing the total binding energy into individual residue contributions offers detailed insights into the molecular interactions governing ligand binding. To this end, a PRED method was employed to analyze how specific amino acids in the Mu 7 In the P218– Mu 8a 8b 8c Figure 8 Graphical representation of per‐residue energy contribution of binding site residues of (a) P218, (b) kaempferol‐3‐O‐rutinoside, and (c) neochlorogenic acid towards Mu (a) (b) (c) In the complexes of 3‐glucosylmaclurin and methotrexate with Mu 9a 9b 9c Figure 9 Graphical representation of per‐residue energy contribution of binding site residues of (a) 3‐glucosylmaclurin, (b) methotrexate, and (c) procyanidin towards Mu (a) (b) (c) For the trimethoprim– Mu Mu 10a,b Mu Figure 10 Graphical representation of per‐residue energy contribution of binding site residues of (a) trimethoprim, (b) 6‐O‐galloylglucose, and (c) ellagic acid towards Mu (a) (b) (c) 3.8.3. Analysis of the Structural Landscapes Associated With the Binding of Ligands to Mu Proteins are inherently responsive to external stimuli, with the binding of small molecules often triggering structural adaptations [ 76 77 Mu Mu 78 79 80 Figure 11a 8 Mu 11b 8 Mu Figure 11 Graphical representation of (a) RMSD, (b) RMSF, (c) RoG, and (d) SASA values across C α Mu Mu Mu Mu Mu Mu Mu Mu Mu Mu – (a) (b) (c) (d) Table 8 RMSD, RMSF, RoG, and SASA profiles of Apo Mu  Systems  Estimated averages (Å)  Ligand  RMSD  RMSF  RoG  SASA Apo 1.92 1.17 15.66 9207.74 P218 1.73 1.23 15.58 8724.92 Kaempferol‐3‐O‐rutinoside 1.75 1.22 15.65 8922.53 Neochlorogenic acid 2.01 1.39 15.70 9104.69 3‐Glucosylmaclurin 2.08 1.26 15.69 8947.63 Methotrexate 1.57 1.24 15.70 9030.92 Procyanidin 1.58 1.20 15.61 8764.72 Trimethoprim 1.72 1.08 15.58 9010.86 6‐O‐Galloylglucose 1.99 1.40 15.63 8967.04 Ellagic acid 2.00 1.34 15.70 9318.51 To better understand protein compaction, we evaluated the RoG throughout the MD simulations. RoG measures were computed as mass‐weighted root mean square distances from the complex’s center of mass. As displayed in Figure 11c 8 SASA calculations provided additional insight into protein surface exposure. These values reflect the extent to which amino acid residues are exposed to solvent, influencing hydrophobic interactions and folding. A decrease in SASA generally correlates with a more folded and stable protein structure [ 81 11d 8 3.8.4. Investigation of Motional Dynamics via PCA To explore the global conformational changes influenced by ligand binding, PCA was performed using the first two principal eigenvectors (EV 1 2 12 Mu Figure 12 Graphical representation of principal component analysis (PCA) for Mu Mu Mu Mu Mu Mu Mu Mu Mu Mu 4. Conclusion This in silico Mu Mu Mu M. ulcerans Conflicts of Interest The authors declare no conflict of interest. Funding No funding was received for this manuscript. Supporting information  Supporting Information 5 Acknowledgments The authors would like to acknowledge the Center of High‐Performance Computing (CHPC, https://www.chpc.ac.za Data Availability Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. 1 Osei-Owusu J. Aidoo O. F. Eshun F. Gaikpa D. S. Dofuor A. K. Vigbedor B. Y. Turkson B. K. Ochar K. Opata J. Opoku M. J. Ninsin K. D. Borgemeister C. Buruli Ulcer in Africa: Geographical Distribution, Ecology, Risk Factors, Diagnosis, and Indigenous Plant Treatment Options – A Comprehensive Review Heliyon 2023 9 e22018 10.1016/j.heliyon.2023.e22018 38034712 PMC10686891 2 WHO The Global Health Observatory: Buruli Ulcer 2024 https://www.who.int/data/gho/data/themes/topics/buruli-ulcer#:%7E:text=Buruli%2520ulcer%2520has%2520been%2520reported,from%2520the%2520Western%2520Pacific%2520Region 3 van der Werf T. S. Barogui Y. T. Converse P. J. Phillips R. O. Stienstra Y. Pharmacologic Management of Mycobacterium ulcerans Expert Review of Clinical Pharmacology 2020 13 391 401 10.1080/17512433.2020.1752663 32310683 PMC9020253 4 Mutombo P. N. Kasilo O. M. J. James P. B. Wardle J. Kunle O. Katerere D. Wambebe C. Matsabisa M. G. Rahmatullah M. Nikiema J. B. Mukankubito I. Sheridan R. Sanogo R. Nissapatorn V. Sivakorn C. Tripathy S. Goyal R. Dhobi M. Experiences and Challenges of African Traditional Medicine: Lessons From COVID-19 Pandemic BMJ Global Health 2023 8 e010813 10.1136/bmjgh-2022-010813 PMC10414097 37558269 5 Trébissou J. N. D. Bla B. Yapo Francis A. Yapi H. F. Djaman J. Therapeutic Survey on Traditional Treatment of Buruli Ulcer in Côte D’ivoire Journal of Microbiology and Biotechnology Research 2014 4 52 56 6 Tsouh Fokou P. V. Nyarko A. K. Appiah-Opong R. Tchokouaha Yamthe L. R. Addo P. Asante I. K. Boyom F. F. Ethnopharmacological Reports on Anti-Buruli Ulcer Medicinal Plants in Three West African Countries Journal of Ethnopharmacology 2015 172 297 311 10.1016/j.jep.2015.06.024 26099634 7 Asiamah I. Obiri S. A. Tamekloe W. Armah F. A. Borquaye L. S. Applications of Molecular Docking in Natural Products-Based Drug Discovery Scientific African 2023 20 e01593 10.1016/j.sciaf.2023.e01593 8 Aragaw W. W. Lee B. M. Yang X. Zimmerman M. D. Gengenbacher M. Dartois V. Chui W. K. Jackson C. J. Dick T. Potency Boost of a Mycobacterium tuberculosis 420 2 Proceedings of the National Academy of Sciences of the United States of America 2021 118 10.1073/pnas.2025172118 PMC8237569 34161270 9 Hajian B. Scocchera E. Shoen C. Krucinska J. Viswanathan K. G-Dayanandan N. Erlandsen H. Estrada A. Mikušová K. Korduláková J. Cynamon M. Wright D. Drugging the Folate Pathway in Mycobacterium tuberculosis Cell Chemical Biology 2019 26 781 791.e6 10.1016/j.chembiol.2019.02.013 30930162 PMC6588435 10 Riboldi G. P. Zigweid R. Myler P. J. Mayclin S. J. Couñago R. M. Staker B. L. Identification of P218 as a Potent Inhibitor of Mycobacterium ulcerans RSC Medicinal Chemistry 2021 12 103 109 10.1039/d0md00303d 34046602 PMC8130613 11 Sonawane N. G. Thakur A. Pillai A. K. S. Sharma A. Gunjal A. P. Sharma K. Recent Cutting-Edge Designing Strategies for Mtb‐DHFR Inhibitors as Antitubercular Agents Chemical Biology & Drug Design 2024 104 e70027 10.1111/cbdd.70027 39660864 12 Raju A. Degani M. S. Khambete M. P. Ray M. K. Rajan M. G. R. Antifolate Activity of Plant Polyphenols Against Mycobacterium tuberculosis Phytotherapy Research 2015 29 1646 1651 10.1002/ptr.5437 26275674 13 Shivashankar S. Kannan S. M. Identification of Biosimilar for Trimethoprim-Andrographis Paniculata Phytochemicals Inhibits Dihydrofolate Reductase (Dhfr) Biointerface Research in Applied Chemistry 2021 11 14142 14154 10.33263/BRIAC116.1414214154 14 Ali M. M. S. Abdalah M. E. Mshimesh B. A. Phytochemical Study and Pharmacological Activity of Terminalia chebula Journal of Pharmaceutical Sciences 2023 22 9 22 10.32947/ajps.v22i4.948 15 Verma A. Gupta A. Katiyar K. Computational Investigation of the Anticancer Potential of Sorghum bicolor Setaria italica CABI Agriculture and Bioscience 2024 5 10.1186/s43170-024-00265-8 16 Adams L. Afiadenyo M. Kwofie S. K. Wilson M. D. Kusi K. A. Obiri-Yeboah D. Moane S. McKeon-Bennett M.  In Silico Dissotis Rotundifolia Plasmodium falciparum Phytomedicine Plus 2023 3 100447 10.1016/j.phyplu.2023.100447 17 Maestro Schrödinger. In (Version 2023-1) LLC 2023 18 LigPrep Schrödinger. (Version 2023-1) 2023 LLC 19 Lu C. Wu C. Ghoreishi D. Chen W. Wang L. Damm W. Ross G. A. Dahlgren M. K. Russell E. Von Bargen C. D. Abel R. Friesner R. A. Harder E. D. OPLS4: Improving Force Field Accuracy on Challenging Regimes of Chemical Space Journal of Chemical Theory and Computation 2021 17 4291 4300 10.1021/acs.jctc.1c00302 34096718 20 Hevener K. E. Zhao W. Ball D. M. Babaoglu K. Qi J. White S. W. Lee R. E. Validation of Molecular Docking Programs for Virtual Screening Against Dihydropteroate Synthase Journal of Chemical Information and Modeling 2009 49 444 460 10.1021/ci800293n 19434845 PMC2788795 21 Jain A. N. Bias, Reporting, and Sharing: Computational Evaluations of Docking Methods Journal of Computer-Aided Molecular Design 2008 22 201 212 10.1007/s10822-007-9151-x 18075713 22 Glide Schrödinger (Version 2023-1) 2023 LLC 23 Prime Schrödinger (Version 2023-1) LLC 2023 24 Li J. Abel R. Zhu K. Cao Y. Zhao S. Friesner R. A. The VSGB 2.0 Model: A Next Generation Energy Model for High Resolution Protein Structure Modeling Proteins 2011 79 2794 2812 10.1002/prot.23106 21905107 PMC3206729 25 Kalirajan R. Pandiselvi A. Gowramma B. Balachandran P.  In-Silico Current Drug Research Reviews 2019 11 118 128 10.2174/2589977511666190912154817 31513003 26 Daina A. Michielin O. Zoete V. SwissADME: A Free Web Tool to Evaluate Pharmacokinetics, Drug-Likeness and Medicinal Chemistry Friendliness of Small Molecules Scientific Reports 2017 7 10.1038/srep42717 PMC5335600 28256516 27 Myung Y. de Sá A. G. C. Ascher D. B. Deep-PK: Deep Learning for Small Molecule Pharmacokinetic and Toxicity Prediction Nucleic Acids Research 2024 52 W469 W475 10.1093/nar/gkae254 38634808 PMC11223837 28 Elamin G. Aljoundi A. Alahmdi M. I. Abo-Dya N. E. Soliman M. E. S. Battling BTK Mutants With Noncovalent Inhibitors that Overcome Cys481 and Thr474 Mutations in Waldenström Macroglobulinemia Therapy: Structural Mechanistic Insights on the Role of Fenebrutinib Journal of Molecular Modeling 2022 28 10.1007/S00894-022-05345-Y 36222928 29 Elamin G. Aljoundi A. Soliman M. E. S. Multi-Catalytic Sites Inhibition of Bcl2 Induces Expanding of Hydrophobic Groove: A New Avenue Towards Waldenström Macroglobulinemia Therapy The Protein Journal 2022 41 201 215 10.1007/S10930-022-10046-9 35237907 30 Elamin G. Aljoundi A. Soliman M. E. S. A Synergistic Multitargeted of BET and HDAC: An Intra-Molecular Mechanism of Communication in Treatment of Waldenström Macroglobulinemia Molecular Simulation 2022 48 197 208 10.1080/08927022.2021.2005248 31 Madhavi Sastry G. Adzhigirey M. Day T. Annabhimoju R. Sherman W. Protein and Ligand Preparation: Parameters, Protocols, and Influence on Virtual Screening Enrichments Journal of Computer-Aided Molecular Design 2013 27 221 234 10.1007/s10822-013-9644-8 23579614 32 Elamin G. Aljoundi A. Alahmdi M. I. Abo-Dya N. E. Soliman M. E. S. Revealing the Role of the Arg and Lys in Shifting Paradigm From BTK Selective Inhibition to the BTK/HCK Dual Inhibition - Delving Into the Inhibitory Activity of KIN-8194 Against BTK, and HCK in the Treatment of Mutated BTK Cys481 Anti-Cancer Agents in Medicinal Chemistry 2024 24 813 825 10.2174/1871520623666230208102609 36752293 33 Elamin G. Soremekun O. S. Sayed S. R. M. Sidhom P. A. Ibrahim M. A. A. Ahmed M. N. Soliman M. E. S. Sequence-Based Mechanistic Resolution of Amino Acid Replacement and Impact on the Activities of Peptide-Based Derivatives Targeting CXCR4 for the Treatment of Waldenström’s Macroglobulinemia Journal of Computational Biophysics and Chemistry 2024 23 207 221 10.1142/S273741652350059X 34 Case D. A. Cheatham T. E. Darden T. Gohlke H. Luo R. Merz K. M. Onufriev A. Simmerling C. Wang B. Woods R. J. The Amber Biomolecular Simulation Programs Journal of Computational Chemistry 2005 26 1668 1688 10.1002/jcc.20290 16200636 PMC1989667 35 Darden T. York D. Pedersen L. Particle Mesh Ewald: An N N The Journal of Chemical Physics 1993 98 10089 10092 10.1063/1.464397 36 Maier J. A. Martinez C. Kasavajhala K. Wickstrom L. Hauser K. E. Simmerling C. ff14SB: Improving the Accuracy of Protein Side Chain and Backbone Parameters From ff99SB Journal of Chemical Theory and Computation 2015 11 3696 3713 10.1021/acs.jctc.5b00255 26574453 PMC4821407 37 Wang J. Wolf R. M. Caldwell J. W. Kollman P. A. Case D. A. Development and Testing of a General Amber Force Field Journal of Computational Chemistry 2004 25 1157 1174 10.1002/jcc.20035 15116359 38 Berendsen H. J. C. Postma J. P. M. van Gunsteren W. F. DiNola A. Haak J. R. Molecular Dynamics With Coupling to an External Bath The Journal of Chemical Physics 1984 81 3684 3690 10.1063/1.448118 39 Ryckaert J. P. Ciccotti G. Berendsen H. J. Numerical Integration of the Cartesian Equations of Motion of a System With Constraints: Molecular Dynamics of N-Alkanes Journal of Computational Physics 1977 23 327 341 10.1016/0021-9991(77)90098-5 40 Roe D. R. Cheatham T. E. PTRAJ and CPPTRAJ: Software for Processing and Analysis of Molecular Dynamics Trajectory Data Journal of Chemical Theory and Computation 2013 9 3084 3095 10.1021/ct400341p 26583988 41 Seifert E. OriginPro 9.1: Scientific Data Analysis and Graphing Software - Software Review Journal of Chemical Information and Modeling 2014 54 10.1021/ci500161d 24702057 42 Systèmes, Dassault Biovia Discovery Studio Dassault Syst mes BIOVIA, Discovery Studio Modeling Environment, Release 2017 2016 Dassault Syst mes 43 Rudrapal M. Issahaku A. R. Agoni C. Bendale A. R. Nagar A. Soliman M. E. S. Lokwani D.  In Silico Journal of Biomolecular Structure and Dynamics 2022 40 10437 10453 10.1080/07391102.2021.1944909 34182889 44 Genheden S. Kuhn O. Mikulskis P. Hoffmann D. Ryde U. The Normal-Mode Entropy in the MM/GBSA Method: Effect of System Truncation, Buffer Region, and Dielectric Constant Journal of Chemical Information and Modeling 2012 52 2079 2088 10.1021/ci3001919 22817270 45 Homeyer N. Gohlke H. Free Energy Calculations by the Molecular Mechanics Poisson−Boltzmann Surface Area Method Molecular Informatics 2012 31 114 122 10.1002/minf.201100135 27476956 46 Hou T. Wang J. Li Y. Wang W. Assessing the Performance of the MM/PBSA and MM/GBSA Methods. 1. The Accuracy of Binding Free Energy Calculations Based on Molecular Dynamics Simulations Journal of Chemical Information and Modeling 2011 51 69 82 10.1021/ci100275a 21117705 PMC3029230 47 Massova I. Kollman P. A. Combined Molecular Mechanical and Continuum Solvent Approach (MM-PBSA/GBSA) to Predict Ligand Binding Perspectives in Drug Discovery and Design 2000 18 113 135 10.1023/A:1008763014207 48 Sitkoff D. Sharp K. A. Honig B. Accurate Calculation of Hydration Free Energies Using Macroscopic Solvent Models The Journal of Physical Chemistry 1994 98 1978 1988 10.1021/j100058a043 49 David C. C. Jacobs D. J. Principal Component Analysis: A Method for Determining the Essential Dynamics of Proteins Protein Dynamics: Methods and Protocols 2014 Humana Press 10.1007/978-1-62703-658-0_11 PMC4676806 24061923 50 Fakhar Z. Govender T. Maguire G. E. M. M. Lamichhane G. Walker R. C. Kruger H. G. Honarparvar B. Differential Flap Dynamics in l,d-transpeptidase2 From Mycobacterium Tuberculosis Revealed by Molecular Dynamics Molecular BioSystems 2017 13 1223 1234 10.1039/C7MB00110J 28480928 51 Levy R. M. Srinivasan A. R. Olson W. K. McCammon J. A. Quasi-Harmonic Method for Studying Very Low Frequency Modes in Proteins Biopolymers 1984 23 1099 1112 10.1002/bip.360230610 6733249 52 Ichiye T. Karplus M. Collective Motions in Proteins: A Covariance Analysis of Atomic Fluctuations in Molecular Dynamics and Normal Mode Simulations Proteins: Structure, Function, and Genetics 1991 11 205 217 10.1002/prot.340110305 1749773 53 Rossino G. Rui M. Pozzetti L. Schepmann D. Wünsch B. Zampieri D. Pellavio G. Laforenza U. Rinaldi S. Colombo G. Morelli L. Linciano P. Rossi D. Collina S. Setup and Validation of a Reliable Docking Protocol for the Development of Neuroprotective Agents by Targeting the Sigma-1 Receptor (S1R) International Journal of Molecular Sciences 2020 21 10.3390/ijms21207708 PMC7589021 33081037 54 Sgobba M. Caporuscio F. Anighoro A. Portioli C. Rastelli G. Application of a Post-Docking Procedure Based on MM-PBSA and MM-GBSA on Single and Multiple Protein Conformations European Journal of Medicinal Chemistry 2012 58 431 440 10.1016/j.ejmech.2012.10.024 23153814 55 Yang C. Chen E. A. Zhang Y. Protein-Ligand Docking in the Machine-Learning Era Molecules 2022 27 10.3390/molecules27144568 PMC9323102 35889440 56 Zhang X. Perez-Sanchez H. Lightstone F. C. A Comprehensive Docking and MM/GBSA Rescoring Study of Ligand Recognition Upon Binding Antithrombin Current Topics in Medicinal Chemistry 2017 17 1631 1639 10.2174/1568026616666161117112604 27852201 PMC5403970 57 Genheden S. Ryde U. The MM/PBSA and MM/GBSA Methods to Estimate Ligand-Binding Affinities Expert Opinion on Drug Discovery 2015 10 449 461 10.1517/17460441.2015.1032936 25835573 PMC4487606 58 Muddagoni N. Bathula R. Dasari M. Potlapally S. Homology Modeling, Virtual Screening, Prime-MMGBSA, AutoDock-Identification of Inhibitors of FGR Protein Biointerface Research in Applied Chemistry 2021 11 11088 11103 59 Schrodinger Schrodinger Support Release: GlideScore/Docking Score Doesn′t Correlate With My Known Activities. What Is Wrong? Last Published Date: 7/29/2022 2022 https://support.schrodinger.com/s/article/144 60 Schrodinger Schrodinger Support Release: Can I Relate MM-GBSA Energies to Binding Affinity? Last Published Date: 7/29/2022 2022 https://support.schrodinger.com/s/article/1647 61 Lipinski C. A. Lombardo F. Dominy B. W. Feeney P. J. Experimental and Computational Approaches to Estimate Solubility and Permeability in Drug Discovery and Development Settings Advanced Drug Delivery Reviews 2001 46 3 26 10.1016/s0169-409x(00)00129-0 11259830 62 Veber D. F. Johnson S. R. Cheng H.-Y. Smith B. R. Ward K. W. Kopple K. D. Molecular Properties That Influence the Oral Bioavailability of Drug Candidates Journal of Medicinal Chemistry 2002 45 2615 2623 10.1021/jm020017n 12036371 63 Bickerton G. R. Paolini G. V. Besnard J. Muresan S. Hopkins A. L. Quantifying the Chemical Beauty of Drugs Nature Chemistry 2012 4 90 98 10.1038/nchem.1243 PMC3524573 22270643 64 Roskoski R. Rule of Five Violations Among the FDA-Approved Small Molecule Protein Kinase Inhibitors Pharmacological Research 2023 191 106774 10.1016/j.phrs.2023.106774 37075870 65 Zhao L. Chen J. Bai B. Song G. Zhang J. Yu H. Huang S. Wang Z. Lu G. Topical Drug Delivery Strategies for Enhancing Drug Effectiveness by Skin Barriers, Drug Delivery Systems and Individualized Dosing Frontiers in Pharmacology 2023 14 1333986 10.3389/fphar.2023.1333986 38293666 PMC10825035 66 Ahmed J. Abdul Hamid A. A. Abd Halim K. B. Che Has A. T. P-Glycoprotein: New Insights Into Structure, Physiological Function, Regulation and Alterations in Disease Heliyon 2022 8 e09777 10.1016/j.heliyon.2022.e09777 35789865 PMC9249865 67 Shanu-Wilson J. Evans L. Wrigley S. Steele J. Atherton J. Boer J. Biotransformation: Impact and Application of Metabolism in Drug Discovery ACS Medicinal Chemistry Letters 2020 11 2087 2107 10.1021/acsmedchemlett.0c00202 33214818 PMC7667663 68 Wijnen P. op den Buijsch R. A. M. Drent M. Kuipers P. M. J. C. Neef C. Bast A. Bekers O. Koek G. H. Review article: The Prevalence and Clinical Relevance of Cytochrome P450 Polymorphisms Alimentary Pharmacology & Therapeutics 2007 26 211 219 10.1111/j.1365-2036.2007.03490.x 18081664 69 Dasgupta A. Dasgupta A. Chapter 4- Genetic Factors Associated With Opioid Therapy and Opioid Addiction Fighting the Opioid Epidemic 2020 Elsevier 61 88 10.1016/B978-0-12-820075-9.00004-1 70 Morris-Schaffer K. McCoy M. J. A Review of the LD 50 ACS Chemical Health & Safety 2021 28 25 33 10.1021/acs.chas.0c00096 71 Mishra A. Dewangan G. Mandal T. K. Chkraborty J. LD50 Dose Fixation of Nanohybrid-Layered Double Hydroxide-Methotrexate Indian Journal of Pharmacology 2022 54 379 380 10.4103/ijp.ijp_899_21 36537409 PMC9846908 72 Bushby S. R. M. Hitchings G. H. Trimethoprim, a Sulphonamide Potentiator British Journal of Pharmacology and Chemotherapy 1968 33 72 90 10.1111/j.1476-5381.1968.tb00475.x 5301731 PMC1570262 73 Stergiopoulos C. Tsopelas F. Valko K. Prediction of hERG Inhibition of Drug Discovery Compounds Using Biomimetic HPLC Measurements ADMET and DMPK 2021 9 191 207 10.5599/admet.995 35300361 PMC8920097 74 Springer C. Sokolnicki K. L. A Fingerprint Pair Analysis of hERG Inhibition Data Chemistry Central Journal 2013 7 10.1186/1752-153x-7-167 PMC3854090 24144230 75 Jiang L. Yanase E. Mori T. Kurata K. Toyama M. Tsuchiya A. Yamauchi K. Mitsunaga T. Iwahashi H. Takahashi J. Relationship Between Flavonoid Structure and Reactive Oxygen Species Generation Upon Ultraviolet and X-Ray Irradiation Journal of Photochemistry and Photobiology A: Chemistry 2019 384 112044 10.1016/j.jphotochem.2019.112044 76 Tripathi T. Uversky V. N. Giuliani A. ‘Intelligent’ Proteins Cellular and Molecular Life Sciences 2025 82 10.1007/s00018-025-05770-1 PMC12167427 40515853 77 Ha J. H. Loh S. N. Protein Conformational Switches: From Nature to Design Chemistry 2012 18 7984 7999 10.1002/chem.201200348 22688954 PMC3404493 78 Song X. Bao L. Feng C. Huang Q. Zhang F. Gao X. Han R. Accurate Prediction of Protein Structural Flexibility by Deep Learning Integrating Intricate Atomic Structures and Cryo-EM Density Information Nature Communications 2024 15 10.1038/s41467-024-49858-x PMC11219796 38956032 79 Lobanov M. Bogatyreva N. Galzitskaya O. Radius of Gyration as an Indicator of Protein Structure Compactness Molecular Biology 2008 42 623 628 10.1134/S0026893308040195 18856071 80 Ali S. A. Hassan M. I. Islam A. Ahmad F. A Review of Methods Available to Estimate Solvent-Accessible Surface Areas of Soluble Proteins in the Folded and Unfolded States Current Protein & Peptide Science 2014 15 456 476 10.2174/1389203715666140327114232 24678666 81 Borjian Boroujeni M. Shahbazi Dastjerdeh M. Shokrgozar M. Rahimi H. Omidinia E. Computational Driven Molecular Dynamics Simulation of Keratinocyte Growth Factor Behavior at Different pH Conditions Informatics in Medicine Unlocked 2021 23 100514 10.1016/j.imu.2021.100514 ",
  "metadata": {
    "Title of this paper": "Computational Driven Molecular Dynamics Simulation of Keratinocyte Growth Factor Behavior at Different pH Conditions",
    "Journal it was published in:": "BioMed Research International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12407312/"
  }
}