{
  "title": "Paper_1205",
  "abstract": "pmc Sci Adv Sci Adv 2850 sciadv sciadv Science Advances 2375-2548 American Association for the Advancement of Science PMC12466914 PMC12466914.1 12466914 12466914 41004579 10.1126/sciadv.adw9275 adw9275 1 Research Article Biomedicine and Life Sciences SciAdv r-articles Health and Medicine Health and Medicine Reinforced plant-derived lipid nanoparticles for oral precise epigenome editing in colonic diseases Oral nanoparticles for epigenome editing https://orcid.org/0009-0007-8072-2925 Gao Qiang Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Supervision Validation Visualization Writing - original draft Writing - review & editing  1  2 † https://orcid.org/0009-0006-9975-2465 Gao Yunxia Conceptualization Formal analysis Funding acquisition Investigation Methodology Validation Visualization Writing - original draft Writing - review & editing  3 † Cao Yingui Conceptualization Investigation Methodology  1 Xu Haiting Investigation  1 Ma Ya Investigation Validation  1 https://orcid.org/0000-0002-5558-9356 Zu Menghang Methodology Writing - review & editing  2 Yang Qiang Investigation  1 Yang Kun Investigation  1 https://orcid.org/0000-0001-8092-3582 Zhu Zhenhua Data curation Supervision Writing - review & editing  4 Liu Chao Methodology  5 https://orcid.org/0000-0002-3640-0458 Shi Xiaoxiao Conceptualization Funding acquisition Project administration Resources Supervision Visualization Writing - review & editing  1 * https://orcid.org/0000-0002-4295-6129 Reis Rui L. Visualization Writing - original draft Writing - review & editing  6  7 https://orcid.org/0000-0002-7170-2291 Kundu Subhas C. Writing - review & editing  6  7 https://orcid.org/0000-0003-3368-9388 Ma Shengyun Writing - review & editing  8 https://orcid.org/0000-0001-5545-5238 Han Hesong Conceptualization Formal analysis Investigation Methodology Software Supervision Validation Visualization Writing - original draft Writing - review & editing  9 * https://orcid.org/0000-0002-2992-6435 Xiao Bo Conceptualization Data curation Formal analysis Funding acquisition Investigation Methodology Project administration Resources Software Supervision Validation Visualization Writing - original draft Writing - review & editing  2 * 1 2 3 4 5 6 7 8 9 * bxiao@uestc.edu.cn hanhesong@berkeley.edu xxshi7@swu.edu.cn † These authors contributed equally to this work. 26 9 2025 26 9 2025 11 39 497457 eadw9275 21 2 2025 08 9 2025 26 09 2025 27 09 2025 27 09 2025 Copyright © 2025 The Authors, some rights reserved; exclusive licensee American Association for the Advancement of Science. No claim to original U.S. Government Works. Distributed under a Creative Commons Attribution NonCommercial License 4.0 (CC BY-NC). 2025 The Authors https://creativecommons.org/licenses/by-nc/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-NonCommercial license not The clinical application of CRISPR-Cas9 remains limited by delivery challenges, particularly for oral administration. Lysine-specific demethylase 1 ( Lsd1 Lsd1 d Lsd1 Oral nanomedicines treat colonic diseases through epigenome editing. http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 82472132 http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 32401170 http://dx.doi.org/10.13039/501100012226 Fundamental Research Funds for the Central Universities SWU-XDPY22006 http://dx.doi.org/10.13039/501100012226 Fundamental Research Funds for the Central Universities SWU-KQ22075 Science and Technology Research Program of Chongqing Municipal Education Commission KJQN202300223 Sichuan Science and Technology Program 2024YFFK0345 Sichuan Science and Technology Program 2024ZYD0063 and 2025ZNSFSC0665 Distinguished Young Scholars of Chongqing 2022NSCQ-JQX5279 Chongqing Municipal Financial Fund Project 24506C pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Ulcerative colitis (UC) is a chronic inflammatory disorder of the colon that substantially elevates the risk of colitis-associated colorectal cancer (CAC) ( 1 2 3 4 5 6 Recently, a variety of nonviral gene carriers have been exploited, with polymeric nanoparticles ( 7 8 9 10 12 13 14 15 16 17 18 To optimize CRISPR-Cas9 applications, it is essential to identify the critical regulatory factor in the development of UC and CAC. Lysine-specific demethylase 1 ( Lsd1 19 20 21 22 23 Lsd1 Lsd1 d Fig. 1A 13 14 24 Fig. 1B Fig. 1. Schematic illustration of efficient RNP delivery to enable cell-specific genome editing and precise treatment of colonic diseases mediated by TPGS@LNPs. ( A https://biorender.com/ehl3wlp B https://biorender.com/5rwjer6 RESULTS Construction and physicochemical characterization of TPGS-RNP@LNPs Although Lsd1 25 Fig. 2A Fig. 2, B and C Fig. 2. Expression profiles of LSD1 in the human colonic tissues and physicochemical characterization of various LNPs. ( A https://biorender.com/zj6xl1h B C n D n E F T 1 T 2 T T 2 T 1 G H I J K L https://biorender.com/2g70ixm P P P P Epigenetic dynamics are crucial in identifying the target gene and dictating its knockout by precisely regulating specific transcriptional programs ( 26 Lsd1 27 28 16 18 29 Fig. 2D 30 Fig. 2D Fig. 2I Encouraged by the phenomenon that the inclusion of TPGS intriguingly improved the stability of LNPs in the GI fluids, we inspected its underlying mechanism by molecular dynamics simulations. It was noticed that TPGS rapidly and intimately interacted with the lipid components of LNPs, forming a stabilizing complex within 100 ns while reducing the equilibration time by 36 ns compared to the naked LNPs (without TPGS) ( Fig. 2, E and F Fig. 2, E, G, and H Fig. 2, J and K Fig. 2D Fig. 2L Lsd1 To examine whether TPGS@LNPs could deliver RNPs into the nucleus, we monitored the intracellular trafficking of their encapsulated enhanced green fluorescent protein (EGFP)–fused Cas9 protein by flow cytometry and confocal laser scanning microscopy (CLSM) analysis. Initially, the nontoxicity of TPGS-RNP@LNPs toward CT-26 cells (a murine colon cancer cell line) and RAW 264.7 macrophages (a murine leukemia monocyte-macrophage cell line) was guaranteed (fig. S2, A and B). Afterward, we observed that TPGS-RNP@LNPs were present in the cytoplasm of both cell lines with 1 hour, as green fluorescence was detectable ( Fig. 3A 10 Fig. 3, B to D d Fig. 3D Fig. 3. In vitro cell internalization, Lsd1 ( A B C n D d n E F H Npc1 Lamp1 Lamp2 n I Lsd1 J K n L M n N Lsd1 https://biorender.com/96n5xz9 P P P P RNP escape from the endosome is crucial for achieving nucleus-based gene editing ( 31 Fig. 3E Npc1 32 34 Npc1 Fig. 3F Lamp1 Lamp2 Fig. 3, G and H Next, we explored the capacity of LNP-mediated RNP delivery for in vitro gene editing (fig. S2G and table S4). As shown in Fig. 3I Lsd1 sgLsd1 Lsd1 Fig. 3, J and K Lsd1 At the cellular level, we further focused on the impact of precise editing of the Lsd1 Lsd1 Lsd1 Fig. 3L Fig. 3M Lsd1 Fig. 3N TPGS-RNP@LNPs penetrate the mucus layer and accumulate in the colitis-associated lesions Therapeutics must traverse the highly viscous intestinal mucus and undergo subsequent uptake by intestinal villi cells ( 35 36 Fig. 4, A to D Fig. 4, E to H Fig. 4 (I to K) Fig. 4. Mucus penetration and in vivo biodistribution profiles of various LNPs. 3D mucus penetration images of ( A B C D n E F n G H n I J K n L M n N O https://biorender.com/m5s4z5f P P P We further estimated the homing capacity of TPGS-RNP@LNPs to the inflammatory lesions in vivo. After oral administration of TPGS-RNP@LNPs to the BALB/c mice with DSS-induced UC and azomethane (AOM)/DSS–induced CAC for 24 hours, the colon tissues were collected and sectioned for fluorescence microscope examination. The TPGS-RNP@LNPs primarily accumulated in the colon tissues of the UC and CAC mice rather than the healthy colon tissues ( Fig. 4L Fig. 4M Fig. 4N Fig. 4O TPGS-RNP@LNPs targeting Lsd1 To further benchmark the impact of TPGS-RNP@LNPs on the progression of UC, oral administration of various formulas was carried out ( Fig. 5A Fig. 5B 37 38 39 Fig. 5C Fig. 5D Fig. 5. In vivo retardation effect of oral LNPs on UC progression. ( A B n C D n E F G n H I Lsd1 J Lsd1 n K n L n M N Ifi47 n O https://biorender.com/u8i27zv P P P P Strictly, hematoxylin and eosin (H&E) and periodic acid–Schiff (PAS) staining results in Fig. 5E Fig. 5, F and G DSS treatment can inevitably trigger inflammatory cascade responses, leading to further exacerbation of UC progression ( 40 + + + reg + + + reg 41 + reg To further elucidate the therapeutic mechanism of TPGS-RNP@LNPs in treating UC, we first confirmed their targeted genome editing at the Lsd1 Fig. 5, H and I Lsd1 Fig. 5J Lsd1 www.rgenome.net/cas-offinder Lsd1 Fig. 5, K and L Fig. 5M On the basis of the KEGG pathway function enrichment analysis, we further found that oral TPGS-RNP@LNPs significantly down-regulated the expression levels of the genes associated with chemokines (encoded by Ccl2 Cxcl1 Cxcl2 Cxcl3 Cxcl5 Il-6 Il-1b Il-17 Il-22 G-CSF Fig. 5N Il-21 Ifi47 Lsd1 Il-17rb Tradd Traf2 Mkk6 Max 42 Ror t 43 Ap-1 44 45 Ror 46 48 Lsd1 Fig. 5O TPGS-RNP@LNPs targeting Lsd1 We further explored the therapeutic efficacy of TPGS-RNP@LNPs in ameliorating the manifestations of chronic UC. Figure 6A Fig. 6B Fig. 6C Fig. 6, D to I Fig. 6. In vivo therapeutic outcomes of oral LNPs against UC. ( A B n C n D E F n G H I n J + + + reg K + L + M + reg n P P P P In addition, oral TPGS-RNP@LNPs effectively reduced the DSS-induced elevation of CD4 + + + reg Fig. 6, J to M TPGS-RNP@LNPs attenuate the progression of CAC The persistent activation of inflammatory responses in the colon can increase the susceptibility to developing CAC ( 49 Fig. 7A Fig. 7, B to D Fig. 7, E to H Fig. 7M Fig. 7. In vivo inhibitory effect of orally administered LNPs on CAC progression. ( A B C D n E F n G n H I + + + reg J + K + L + reg M n P P P Suppressing exaggerated immune responses is crucial in restraining malignant development during colitis-associated neoplastic progression ( 50 + + Fig. 6, I to K + reg Fig. 7, I and L DISCUSSION The intricate UC and its evolvement to CAC pose essential challenges to traditional treatment modalities. The current clinical medications for UC and CAC are suboptimal, mainly owing to the insufficient understanding of the underlying pathophysiological mechanism. Here, we concentrated on clinical human samples and identified an extraordinary up-regulation of LSD1 in the colonic tissues of patients with UC and CAC ( Fig. 2, B and C Lsd1 51 52 Lsd1 Encouragingly, we developed a reinforced plant-derived lipid nanoplatform that enabled RNP-based CRISPR-Cas9 epigenome editing via the oral route. On the basis of the results of molecular dynamics simulations, we found that incorporating Food and Drug Administration–approved TPGS excipients into LNP formulations could enhance the tightness of the LNP lipid bilayer ( Fig. 2, E to H Fig. 2, D and L Fig. 4, A to O Fig. 3D We must acknowledge that the endosomal escape of RNPs is obligatory for successful intranuclear genome editing. A large amount of prior research suggests that the endosomal escape mechanism for therapeutics predominantly involves pore formation, proton sponge effects, membrane destabilization, photochemical disruption, and the strategic use of endosomal escape agents ( 53 Lamp1 Lamp2 Fig. 3, G and H Npc1 Fig. 3F Lsd1 Fig. 3I Lsd1 It should be noted that 5-ASA is clinically administered using colon-targeted formulations to avoid premature absorption in the upper GI tract ( 54 55 56 57 Lsd1 Lsd1 58 We also note certain limitations that present opportunities for future research. While MLLs were shown to be safe, low-cost, and effective in constructing the oral delivery system (TPGS-RNP@LNPs), and our group has previously reported the therapeutic potential of other plant-derived carriers against inflammatory and cancerous diseases ( 59 60 In summary, the above findings robustly support the efficacy of the plant-derived LNP platform for the oral delivery of CRISPR-Cas9 RNPs in mediating genome editing at the Lsd1 MATERIALS AND METHODS For additional detailed methods, see the Supplementary Materials. Immunofluorescence staining of human colon tissue sections All human colon tissues from patients with UC and CAC were obtained from the First Affiliated Hospital of Nanchang University with approval from its Medical Research Ethics Committee [ethics number: (2023) CDYFYYLK (02-029)], and informed consent was obtained. Briefly, the colon tissues were embedded in the OCT compound and sliced into 5-μm-thick sections using a freezing microtome (RWD, FS800, China). Afterward, the colon tissue sections were stained with an anti-LSD1 antibody (Servicebio, GB112427 Molecular dynamics simulation The intermolecular interaction between TPGS and LNPs was analyzed by Shiyanjia Lab ( www.shiyanjia.com O + − T P Preparation of RNPs The sgRNAs targeting the Lsd1 Lsd1 Fabrication of various LNPs Mulberry leaves were pulverized into a fine powder using a crusher, followed by cold soaking in cyclohexane and rotary evaporation to obtain the crude lipid extract. The obtained crude products were purified by decolorization, yielding the MLLs. Subsequently, the TPGS aqueous solution was rapidly added to the MLL ethanol solution at a volume ratio 3:1 with a mass ratio of 10:1 (lipid:TPGS, w/w) to prepare TPGS@LNPs. To fabricate TPGS-RNP@LNP complexes, the RNP/TPGS mixture was rapidly added dropwise into the ethanol-dispersed MLLs at a volume ratio of 3:1 (RNPs/TPGS:MLLs, v/v) to form TPGS-RNP@LNPs. Notably, TPGS@LNPs and TPGS-RNP@LNPs were subjected to dialysis (molecular weight cutoff, 14 kDa) against double-distilled H 2 Endosomal escape capacity of TPGS-RNP@LNPs CT-26 cells and RAW 264.7 macrophages were inoculated into 35-mm dishes with a density of 4.0 × 10 5 Lsd1 Galactose receptor–mediated endocytosis by macrophages To elucidate the uptake mechanism of TPGS-RNP@LNPs, RAW 264.7 macrophages were seeded at a density of 2.0 × 10 5 Lsd1 g Animal experiments All animal experiments adhered to the guidelines set by the Institutional Animal Care and Use Committee of Southwest University (IACUC-20230918-01). All animals were from Enswell Biotechnology Co., Ltd. (Chongqing, China), they were free to access water and food, and their living condition was observed daily. In vivo biodistribution of TPGS-RNP@LNPs after oral administration To investigate the in vivo biodistribution of TPGS-RNP@LNPs, the GI tissues (stomach, small intestine, cecum, and colon) and the five principal organs (heart, liver, spleen, lung, and kidney) were collected from UC and CAC mice that orally received EGFP-fused TPGS-RNP@LNPs (5 μg of EGFP-fused Cas9 proteins and 5 μg of sgLsd1 Subsequently, we thoroughly investigated the accumulation ability of TPGS-RNP@LNPs in the lesion tissues of mice with UC and CAC. The mice, including healthy mice and those with UC or CAC, were euthanized, and their colon tissues were collected after treatment with EGFP-fused TPGS-RNP@LNPs (5 μg of EGFP-fused Cas9 proteins) for 12 hours. These tissues were fixed in a 4% (v/v) paraformaldehyde solution, embedded in an OCT compound, and sectioned into 5-μm-thick slices. After DAPI staining for 10 min, a coverslip was placed, and the slides were imaged by CLSM (Olympus, FV-3000, Japan). To further investigate the colocalization capability of TPGS-RNP@LNPs with macrophages, we performed immunostaining on these tissue sections using an anti–F4/80 antibody (Servicebio, GB113373 In vivo retardation effect of TPGS-RNP@LNPs on UC BALB/c female mice (6 to 8 weeks of age) were divided into five groups ( n Lsd1 + + + reg In vivo therapeutic outcomes of TPGS-RNP@LNPs against UC BALB/c female mice (6 to 8 weeks of age) were divided into five groups ( n Lsd1 + + + reg In vivo preventive effect of TPGS-RNP@LNPs on CAC BALB/c male mice (7 to 8 weeks of age) were randomly divided into three groups ( n Lsd1 + + + reg Statistical analysis All values are presented as the means ± SEM. All statistical analyses were performed using GraphPad Prism version 8.0 software (GraphPad Software Inc.). Unless otherwise noted, statistical significance was determined using Student’s t P P P P P Acknowledgments Funding: Author contributions: Competing interests: Data and materials availability: Supplementary Materials This PDF file includes: Supplementary Text Figs. S1 to S8 Tables S1 to S7 REFERENCES AND NOTES 1 B. Gros G. G. Kaplan Ulcerative colitis in adults: A review JAMA 330 951 965 2023 37698559 10.1001/jama.2023.15389 2 X. V. Li I. Leonardi G. G. Putzel A. Semon W. D. Fiers T. Kusakabe W. Y. Lin I. H. Gao I. Doron A. Gutierrez-Guerrero M. B. DeCelie G. M. Carriche M. Mesko C. Yang J. R. Naglik B. Hube E. J. Scherl I. D. Iliev Immune regulation by fungal strain diversity in inflammatory bowel disease Nature 603 672 678 2022 35296857 10.1038/s41586-022-04502-w PMC9166917 3 J. D. Gillmore E. Gane J. Taubel J. Kao M. Fontana M. L. Maitland J. Seitzer D. O’Connell K. R. Walsh K. Wood J. Phillips Y. Xu A. Amaral A. P. Boyd J. E. Cehelsky M. D. McKee A. Schiermeier O. Harari A. Murphy C. A. Kyratsous B. Zambrowicz R. Soltys D. E. Gutstein J. Leonard L. Sepp-Lorenzino D. Lebwohl CRISPR-Cas9 in vivo N. Engl. J. Med. 385 493 502 2021 34215024 10.1056/NEJMoa2107454 4 Y. Liu Y. Zeng L. Liu C. Zhuang X. Fu W. Huang Z. Cai Synthesizing and gate genetic circuits based on CRISPR-Cas9 for identification of bladder cancer cells Nat. Commun. 5 5393 2014 25373919 10.1038/ncomms6393 5 J. A. Zuris D. B. Thompson Y. Shu J. P. Guilinger J. L. Bessen J. H. Hu M. L. Maeder J. K. Joung Z. Y. Chen D. R. Liu Cationic lipid-mediated delivery of proteins enables efficient protein-based genome editing in vitro and in vivo Nat. Biotechnol. 33 73 80 2015 25357182 10.1038/nbt.3081 PMC4289409 6 Y. Lin E. Wagner U. Lächelt Non-viral delivery of the CRISPR/Cas system: DNA versus RNA versus RNP Biomater. Sci. 10 1166 1192 2022 35103261 10.1039/d1bm01658j 7 H. B. Sager P. Dutta J. E. Dahlman M. Hulsmans G. Courties Y. Sun T. Heidt C. Vinegoni A. Borodovsky K. Fitzgerald G. R. Wojtkiewicz Y. Iwamoto B. Tricot O. F. Khan K. J. Kauffman Y. Xing T. E. Shaw P. Libby R. Langer R. Weissleder F. K. Swirski D. G. Anderson M. Nahrendorf RNAi targeting multiple cell adhesion molecules reduces immune cell recruitment and vascular inflammation after myocardial infarction Sci. Transl. Med. 8 342ra380 2016 10.1126/scitranslmed.aaf1435 PMC5125383 27280687 8 L. Farbiak Q. Cheng T. Wei E. Álvarez-Benedicto L. T. Johnson S. Lee D. J. Siegwart All-in-one dendrimer-based lipid nanoparticles enable precise HDR-mediated gene editing in vivo Adv. Mater. 33 e2006619 2021 34137093 10.1002/adma.202006619 PMC10041668 9 K. Živojević M. Mladenović M. Djisalov M. Mundzic E. Ruiz-Hernandez I. Gadjanski N. Knežević Advanced mesoporous silica nanocarriers in cancer theranostics and gene editing applications J. Control. Release 337 193 211 2021 34293320 10.1016/j.jconrel.2021.07.029 10 T. Wei Q. Cheng Y. L. Min E. N. Olson D. J. Siegwart Systemic nanoparticle delivery of CRISPR-Cas9 ribonucleoproteins for effective tissue specific genome editing Nat. Commun. 11 3232 2020 32591530 10.1038/s41467-020-17029-3 PMC7320157 11 K. Chen H. Han S. Zhao B. Xu B. Yin A. Lawanprasert M. Trinidad B. W. Burgstone N. Murthy J. A. Doudna Lung and liver editing by lipid nanoparticle delivery of a stable CRISPR-Cas9 ribonucleoprotein Nat. Biotechnol. 10.1038/s41587-024-02437-3 2024 10.1038/s41587-024-02437-3 PMC12000389 39415058 12 J. Bolsoni D. Liu F. Mohabatpour R. Ebner G. Sadhnani B. Tafech J. Leung S. Shanta K. An T. Morin Y. Chen A. Arguello K. Choate E. Jan C. J. D. Ross D. Brambilla D. Witzigmann J. Kulkarni P. R. Cullis S. Hedtrich Lipid nanoparticle-mediated hit-and-run approaches yield efficient and safe in situ gene editing in human skin ACS Nano 17 22046 22059 2023 37918441 10.1021/acsnano.3c08644 PMC10655174 13 M. Zu Y. Ma B. Cannup D. Xie Y. Jung J. Zhang C. Yang F. Gao D. Merlin B. Xiao Oral delivery of natural active small molecules by polymeric nanoparticles for the treatment of inflammatory bowel diseases Adv. Drug Deliv. Rev. 176 113887 2021 34314785 10.1016/j.addr.2021.113887 14 B. Xiao D. Merlin Oral colon-specific therapeutic approaches toward treatment of inflammatory bowel disease Expert Opin. Drug Deliv. 9 1393 1407 2012 23036075 10.1517/17425247.2012.730517 15 Q. Gao N. Chen B. Li M. Zu Y. Ma H. Xu Z. Zhu R. L. Reis S. C. Kundu B. Xiao Natural lipid nanoparticles extracted from morus nigra L. leaves for targeted treatment of hepatocellular carcinoma via J. Nanobiotechnol. 22 4 2024 10.1186/s12951-023-02286-3 PMC10763359 38169394 16 W. Yang Y. Ma H. Xu Z. Zhu J. Wu C. Xu W. Sun E. Zhao M. Wang R. L. Reis S. C. Kundu X. Shi B. Xiao Mulberry biomass-derived nanomedicines mitigate colitis through improved inflamed mucosa accumulation and intestinal microenvironment modulation Research 6 0188 2023 37426473 10.34133/research.0188 PMC10328391 17 H. Xu Y. Wang G. Liu Z. Zhu M. A. Shahbazi R. L. Reis S. C. Kundu X. Shi M. Zu B. Xiao Nano-armed limosilactobacillus reuteri for enhanced photo-immunotherapy and microbiota tryptophan metabolism against colorectal cancer Adv. Sci. 30 e2410011 2024 10.1002/advs.202410011 PMC11831460 39739630 18 B. Li M. Zu A. Jiang Y. Cao J. Wu M. A. Shahbazi X. Shi R. L. Reis S. C. Kundu B. Xiao Magnetic natural lipid nanoparticles for oral treatment of colorectal cancer through potentiated antitumor immunity and microbiota metabolite regulation Biomaterials 307 122530 2024 38493672 10.1016/j.biomaterials.2024.122530 19 Y. Shi F. Lan C. Matson P. Mulligan J. R. Whetstine P. A. Cole R. A. Casero Y. Shi Histone demethylation mediated by the nuclear amine oxidase homolog Lsd1 Cell 119 941 953 2004 15620353 10.1016/j.cell.2004.12.012 20 J. Sun H. Feng W. Xing Y. Han J. Suo A. R. Yallowitz N. Qian Y. Shi M. B. Greenblatt W. Zou Histone demethylase Lsd1 Sci. Adv. 6 eaaz1410 2020 33148658 10.1126/sciadv.aaz1410 PMC7673679 21 N. A. Levis E. J. Ragsdale A histone demethylase links the loss of plasticity to nongenetic inheritance and morphological change Nat. Commun. 14 8439 2023 38114491 10.1038/s41467-023-44306-8 PMC10730525 22 M. Sobczak M. Strachowska K. Gronkowska I. Karwaciak Ł. Pułaski A. Robaszkiewicz Lsd1 Cell 10 2465 2021 10.3390/cells10092465 PMC8469135 34572113 23 C. Lee V. A. Rudneva S. Erkek M. Zapatka L. Q. Chau S. K. Tacheva-Grigorova A. Garancher J. M. Rusert O. Aksoy R. Lea H. P. Mohammad J. Wang W. A. Weiss H. L. Grimes S. M. Pfister P. A. Northcott R. J. Wechsler-Reya Lsd1 Nat. Commun. 10 332 2019 30659187 10.1038/s41467-018-08269-5 PMC6338772 24 A. Lamprecht IBD: Selective nanoparticle adhesion can enhance colitis therapy Nat. Rev. Gastroenterol. Hepatol. 7 311 312 2010 20523352 10.1038/nrgastro.2010.66 25 C. Oh J. Jeong S. K. Oh S. H. Baek K. I. Kim Inhibition of Lsd1 BMB Rep. 53 385 390 2020 32317082 10.5483/BMBRep.2020.53.7.298 PMC7396915 26 A. Ivancevic D. M. Simpson O. M. Joyner S. M. Bagby L. L. Nguyen B. G. Bitler T. M. Pitts E. B. Chuong Endogenous retroviruses mediate transcriptional rewiring in response to oncogenic signaling in colorectal cancer Sci. Adv. 10 eado1218 2024 39018396 10.1126/sciadv.ado1218 PMC466953 27 A. J. Da Silva Sanchez C. Dobrowolski A. Cristian E. S. Echeverri K. Zhao M. Z. C. Hatit D. Loughrey K. Paunovska J. E. Dahlman Universal barcoding predicts in vivo Nano Lett. 22 4822 4830 2022 35671473 10.1021/acs.nanolett.2c01133 28 W. Zhu L. Wei C. Dong Y. Wang J. Kim Y. Ma G. X. Gonzalez B. Z. Wang cGAMP-adjuvanted multivalent influenza mRNA vaccines induce broadly protective immunity through cutaneous vaccination in mice Mol. Ther. Nucleic. Acids 30 421 437 2022 36420215 10.1016/j.omtn.2022.10.024 PMC9668623 29 Y. Ma S. Gou Z. Zhu J. Sun M. A. Shahbazi T. Si C. Xu J. Ru X. Shi R. L. Reis S. C. Kundu B. Ke G. Nie B. Xiao Transient mild photothermia improves therapeutic performance of oral nanomedicines with enhanced accumulation in the colitis mucosa Adv. Mater. 36 e2309516 2024 38085512 10.1002/adma.202309516 30 Y. Chen M. Saqib K. Shahzada M. Aizaz A. Gul Assessment of mechanical properties and durability of compressed mud bricks stabilized with stone dust, wheat straw, and cement Sci. Rep. 15 1950 2025 39814848 10.1038/s41598-025-86473-2 PMC11735777 31 S. Deng X. Li S. Liu J. Chen M. Li S. Y. Chew K. W. Leong D. Cheng Codelivery of CRISPR-Cas9 and chlorin e6 for spatially controlled tumor-specific gene editing with synergistic drug effects Sci. Adv. 6 eabb4005 2020 32832641 10.1126/sciadv.abb4005 PMC7439618 32 J. E. Carette M. Raaben A. C. Wong A. S. Herbert G. Obernosterer N. Mulherkar A. I. Kuehne P. J. Kranzusch A. M. Griffin G. Ruthel P. Dal Cin J. M. Dye S. P. Whelan K. Chandran T. R. Brummelkamp Ebola virus entry requires the cholesterol transporter Niemann-Pick C1 Nature 477 340 343 2011 21866103 10.1038/nature10348 PMC3175325 33 A. A. Eltoukhy G. Sahay J. M. Cunningham D. G. Anderson Niemann-Pick C1 affects the gene delivery efficacy of degradable polymeric nanoparticles ACS Nano 8 7905 7913 2014 25010491 10.1021/nn501630h PMC4148171 34 M. I. Costafreda A. Abbasi H. Lu G. Kaplan Exosome mimicry by a HAVCR1-NPC1 pathway of endosomal fusion mediates hepatitis A virus infection Nat. Microbiol. 5 1096 1106 2020 32541946 10.1038/s41564-020-0740-y PMC7483988 35 S. P. Bandi S. Bhatnagar V. V. K. Venuganti Advanced materials for drug delivery across mucosal barriers Acta Biomater. 119 13 29 2021 33141051 10.1016/j.actbio.2020.10.031 36 D. A. Subramanian R. Langer G. Traverso Mucus interaction to improve gastrointestinal retention and pharmacokinetics of orally administered nano-drug delivery systems J. Nanobiotechnol. 20 362 2022 10.1186/s12951-022-01539-x PMC9356434 35933341 37 L. Ma Y. Ma Q. Gao S. Liu Z. Zhu X. Shi F. Dai R. L. Reis S. C. Kundu K. Cai B. Xiao Mulberry leaf lipid nanoparticles: a naturally targeted CRISPR/Cas9 oral delivery platform for alleviation of colon diseases Small 20 e2307247 2024 38243871 10.1002/smll.202307247 38 R. Ireland B. Schwarz G. Nardone T. D. Wehrly C. D. Broeckling A. I. Chiramel S. M. Best C. M. Bosio Unique francisella phosphatidylethanolamine acts as a potent anti-inflammatory lipid J. Innate Immun. 10 291 305 2018 29969788 10.1159/000489504 PMC6757151 39 J. Wang Y. X. Kang W. Pan W. Lei B. Feng X.-J. Wang Enhancement of anti-inflammatory activity of curcumin using phosphatidylserine-containing nanoparticles in cultured macrophages Int. J. Mol. Sci. 17 969 2016 27331813 10.3390/ijms17060969 PMC4926501 40 M. Perše A. Cerar Dextran sodium sulphate colitis mouse model: Traps and tricks J. Biomed. Biotechnol. 2012 718617 2012 22665990 10.1155/2012/718617 PMC3361365 41 S. M. Ehteshamfar M. Akhbari J. T. Afshari M. Seyedi B. Nikfar A. Shapouri-Moghaddam E. Ghanbarzadeh A. A. Momtazi-Borojeni Anti-inflammatory and immune-modulatory impacts of berberine on activation of autoreactive T cells in autoimmune inflammation J. Cell. Mol. Med. 24 13573 13588 2020 33135395 10.1111/jcmm.16049 PMC7754052 42 H. Q. Nguyen M. Selvakumaran D. A. Liebermann B. Hoffman Blocking c-Myc and Max expression inhibits proliferation and induces differentiation of normal and leukemic myeloid cells Oncogene 11 2439 2444 1995 8570196 43 X. Song X. Sun S. F. Oh M. Wu Y. Zhang W. Zheng N. Geva-Zatorsky R. Jupp D. Mathis C. Benoist D. L. Kasper Microbial bile acid metabolites modulate gut RORγ + Nature 577 410 415 2020 31875848 10.1038/s41586-019-1865-0 PMC7274525 44 E. Shaulian M. Karin AP-1 as a regulator of cell life and death Nat. Cell Biol. 4 E131 E136 2002 11988758 10.1038/ncb0502-e131 45 C. P. Matthews N. H. Colburn M. R. Young AP-1 a target for cancer prevention Curr. Cancer Drug Targets 7 317 324 2007 17979626 10.2174/156800907780809723 46 J. Y. Beak H. S. Kang W. Huang P. H. Myers D. E. Bowles A. M. Jetten B. C. Jensen The nuclear receptor RORα protects against angiotensin II-induced cardiac hypertrophy and heart failure Am. J. Physiol. Heart Circ. Physiol. 316 H186 H200 2019 30387679 10.1152/ajpheart.00531.2018 PMC6383360 47 F. Yemanyi K. Bora A. K. Blomfield J. Chen Retinoic acid receptor-related orphan receptors (RORs) in eye development and disease Adv. Exp. Med. Biol. 1415 327 332 2023 37440052 10.1007/978-3-031-27681-1_47 48 J. M. Lee H. Kim S. H. Baek Unraveling the physiological roles of retinoic acid receptor-related orphan receptor α Exp. Mol. Med. 53 1278 1286 2021 34588606 10.1038/s12276-021-00679-8 PMC8492739 49 C. Polytarchou D. W. Hommes T. Palumbo M. Hatziapostolou M. Koutsioumpa G. Koukos A. E. van der Meulen-de Jong A. Oikonomopoulos W. K. van Deen C. Vorvis O. B. Serebrennikova E. Birli J. Choi L. Chang P. A. Anton P. N. Tsichlis C. Pothoulakis H. W. Verspaget D. Iliopoulos MicroRNA214 is associated with progression of ulcerative colitis, and inhibition reduces development of colitis and colitis-associated cancer in mice Gastroenterology 149 981 992.e11 2015 26055138 10.1053/j.gastro.2015.05.057 PMC4584179 50 M. C. Fantini A. Favale S. Onali F. Facciotti Tumor infiltrating regulatory T cells in sporadic and colitis-associated colorectal cancer: The red little riding hood and the wolf Int. J. Mol. Sci. 21 6744 2020 32937953 10.3390/ijms21186744 PMC7555219 51 H. M. Liu Y. Zhou H. X. Chen J. W. Wu S. K. Ji L. Shen S. P. Wang H. M. Liu Y. Liu X. J. Dai Y. C. Zheng Lsd1 Med. Res. Rev. 44 833 866 2024 38014919 10.1002/med.22000 52 M. Li M. Dai B. Cheng S. Li E. Guo J. Fu T. Ma B. Yu Strategies that regulate Lsd1 Acta. Pharm. Sin. B. 14 1494 1507 2024 38572094 10.1016/j.apsb.2024.01.005 PMC10985039 53 N. Desai D. Rana S. Salave D. Benival D. Khunt B. G. Prajapati Achieving endo/lysosomal escape using smart nanosystems for efficient cellular delivery Molecules 29 3131 2024 38999083 10.3390/molecules29133131 PMC11243486 54 K. Takahashi S. Bamba Y. Morita A. Nishida M. Kawahara O. Inatomi M. Sugimoto M. Sasaki A. Andoh pH-dependent 5-aminosalicylates releasing preparations do not affect thiopurine metabolism Digestion 100 238 246 2019 30602158 10.1159/000495690 55 G. R. Lichtenstein M. A. Kamm Review article: 5-aminosalicylate formulations for the treatment of ulcerative colitis – Methods of comparing release rates and delivery of 5-aminosalicylate to the colonic mucosa Aliment. Pharmacol. Ther. 28 663 673 2008 18532992 10.1111/j.1365-2036.2008.03751.x 56 D. Datta P. Kumar J. Kundu J. Qin J. A. Gilbert S. Schofield D. P. Donnelly J. Liu R. Degaonkar M. Egli M. Manoharan Improved in vivo Org. Lett. 26 10061 10065 2024 39528231 10.1021/acs.orglett.4c02903 PMC11613684 57 C. Selvam D. Mutisya S. Prakash K. Ranganna R. Thilagavathi Therapeutic potential of chemically modified siRNA: Recent trends Chem. Biol. Drug Des. 90 665 678 2017 28378934 10.1111/cbdd.12993 PMC5935465 58 J. S. Ha J. S. Lee J. Jeong H. Kim J. Byun S. A. Kim H. J. Lee H. S. Chung J. B. Lee D. R. Ahn Poly-sgRNA/siRNA ribonucleoprotein nanoparticles for targeted gene disruption J. Control. Release 250 27 35 2017 28167287 10.1016/j.jconrel.2017.02.007 59 M. Zu D. Xie B. Canup N. Chen Y. Wang R. Sun Z. Zhang Y. Fu F. Dai B. Xiao ‘Green’ nanotherapeutics from tea leaves for orally targeted prevention and alleviation of colon diseases Biomaterials 279 121178 2021 34656857 10.1016/j.biomaterials.2021.121178 60 Q. Chen Q. Li Y. Liang M. Zu N. Chen B. Canup L. Luo C. Wang L. Zeng B. Xiao Natural exosome-like nanovesicles from edible tea flowers suppress metastatic breast cancer via Acta. Pharm. Sin. B. 12 907 923 2022 35256954 10.1016/j.apsb.2021.08.016 PMC8897038 ",
  "metadata": {
    "Title of this paper": "Natural exosome-like nanovesicles from edible tea flowers suppress metastatic breast cancer ",
    "Journal it was published in:": "Science Advances",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466914/"
  }
}