{
  "title": "Paper_880",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471900 PMC12471900.1 12471900 12471900 41011357 10.3390/microorganisms13092021 microorganisms-13-02021 1 Article Are “Free From” Foods Risk-Free? Lactose-Free Milk Fermentation Modulates Normal Colon in a Gut Microbiota in Vitro Model Casciano Flavia Software Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0002-7875-6321 Nissen Lorenzo Conceptualization Methodology Software Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Visualization Supervision 1 2 * https://orcid.org/0000-0003-4579-1662 Bordoni Alessandra Conceptualization Validation Resources Writing – review & editing 1 2 https://orcid.org/0000-0002-8847-6251 Gianotti Andrea Conceptualization Methodology Validation Resources Writing – review & editing Supervision Project administration Funding acquisition 1 2 * Inoue Ryo Academic Editor 1 Alma Mater Studiorum cascianoflavia@yahoo.it alessandra.bordoni@unibo.it 2 Alma Mater Studiorum * lorenzo.nissen@unibo.it andrea.gianotti@unibo.it 29 8 2025 9 2025 13 9 496716 2021 26 7 2025 17 8 2025 18 8 2025 29 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Nowadays, the consumption of “free from” foods by non-specific consumers is increasing, partly due to a misperception of labels that make them seem healthier. These foods are formulated for consumers with allergies or diseases that limit their diet, and it is not known if there are more benefits than risks for healthy consumers. For example, there is no work investigating the interaction between lactose-free milk and the colonic microbiome of healthy individuals. To focus on the potential modulation of gut microbiota of healthy subjects by lactose-free milk, we performed an in vitro simulation of digestion and fermentation, integrating microbiomics and metabolomics approaches to study changes in gut microbiota populations and metabolite production. Results indicated that lactose-free and lactose-containing milk differently modulated colonic microbiota based on several microbiological indicators, including the reduction in Bifidobacteriaceae Lactobacillales dairy gut microbiota health halo Bifidobacterium Enterobacteriaceae Italian Ministry of University and Research under National Recovery and Resilience Plan (NRRP) D93C22000890001 ON Foods—Research and innovation network on food and nutrition Sustainability, Safety and Security—Working ON Foods PE00000003 This research was funded by Italian Ministry of University and Research under National Recovery and Resilience Plan (NRRP) (CUP D93C22000890001) and project “ON Foods—Research and innovation network on food and nutrition Sustainability, Safety and Security—Working ON Foods” (PE00000003). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The disaccharide lactose, the dominant carbohydrate in dairy products, is hydrolyzed by the lactase enzyme, which is abundant in the proximal jejunum and decreases progressively towards the ileum [ 1 2 3 4 5 6 The prevention of gastrointestinal symptoms of LI is based on a reduction or elimination of lactose from the diet. To enable LI people to consume milk and dairy products, which provide essential macro- and micronutrients, “low lactose” or “lactose-free” (LF) products are industrially produced [ 7 Consumption of LF products by people who are not intolerant is increasing for several reasons: (i) families switch completely to LF foods although only one member is intolerant, (ii) LI is often self-diagnosed [ 8 9 10 Additional evidence shows that for the development of intestinal eubiosis, a lactose-free diet is detrimental in infants [ 11 12 13 14 Bifidobacterium Lactobacillus Proteobacteria To study the impact of LF milk on the colon microbiota of lactose-tolerant donors, we sequentially applied the protocols of INFOGEST in vitro digestion [ 15 16 17 2. Materials and Methods 2.1. Milk Samples UHT (Ultra-High-Temperature) semi-skimmed milk (L) and UHT semi-skimmed lactose-free milk (LF) (Granarolo S.p.A., Bologna, Italy) were purchased at a local market. The lactose concentration in LF was < 0.1 g/L, as declared by the supplier. 2.2. Experimental Workflow By processing milk samples through gastro-duodenal digestion using the INFOGEST protocol [ 15 16 2.3. Human Colon Microbiota Human colon microbiota (HCM) were obtained from the stools of two healthy donors (one male and one female) aged between 30 and 45 y, respectively. The methods used for the selection of donors using inclusion criteria and the protocols for stool collection have been previously published [ 17 18 19 20 21 22 23 g 2.4. In Vitro Intestinal Model The gut model was created by combining the INFOGEST method [ 15 16 17 19 17 21 23 17 24 19 17 18 19 20 21 23 g 2 2.5. Metabolomics 2.5.1. Volatilome Analysis The profiles of volatile organic compounds (VOCs) were obtained with an Intuvo Agilent 7890A Gas Chromatograph (Agilent Technologies, Santa Clara, CA, USA) equipped with a Chrompack CP-Wax 52 CB capillary column (50 m length, 0.32 mm ID) (Chrompack, Middelburg, The Netherlands). SPME–GC-MS (solid-phase microextraction–gas chromatography–mass spectrophotometry) analysis and data processing were performed following previously published protocols [ 17 21 2.5.2. Quantification of Main Microbial VOCs The key bacterial metabolites associated with fermentation of foodstuffs were measured at the BL in mg/kg by SPME GC-MS, employing a standard and specific cutoffs (LOQ = 0.03 mg/kg and LOD = 0.01 mg/kg) [ 17 2.6. Microbiomics 2.6.1. Metataxonomy DNA samples were extracted using a Purelink Microbiome DNA Purification Kit (Invitrogen, Thermo Fisher Scientific, Carlsbad, CA, USA). DNA samples of BL and EP were used for metataxonomic analysis by 16S rRNA MiSeq sequencing (Illumina Inc., San Diego, CA, USA). Microbiota diversity was obtained by library building and sequencing of 16S r-RNA gene. Libraries were obtained using a MiSeq (Illumina Inc., USA) with paired-end sequencing and a 300 bp read length [ 25 26 2.6.2. Quantitation of Bacterial Groups by qPCR The shifts in quantity, expressed as Log 2 27 28 29 30 31 Eubacteria Firmicutes Bacteroidetes Lactobacillales Bifidobacteriaceae Enterobacteriaceae 21 2.7. Data Mining and Statistics Datasets for metabolomics were processed for normality and homoscedasticity [ 32 p 33 p 2 p https://molbiotools.com 2 34 2 35 3. Results 3.1. Metabolomics 3.1.1. Volatilome Analysis From the 18 duplicated profiles of SPME GC-MS, 80 molecules with at least 70% similarity were identified using the NIST 11 MSMS library (NIST, Gaithersburg, MD, USA) ( Figure 1 Figure 1 Table S2 Table S3 Figure 1 Table S2 Table S3 Figure 1 Table S2 Table S3 3.1.2. Short-Chain Fatty Acids Due to reported positive health effects [ 36 37 38 39 Table S4 p Figure 2 40 3.1.3. Indoles and Phenols As key detrimental VOCs, we selected indole, 1H-indole, and 3-methyl (skatole), the main dead-end products of intestinal bacteria [ 41 42 Table S5 p Figure 2 3.2. Microbiomics 3.2.1. Ecological Biodiversity of Colonic Fermentations Microbiota diversity indices were affected by both L and LF milk, which perturbated colonic microbial population in terms of stability during fermentation and richness of microbiota composition ( Figure 3 Figure 3 Figure 3 p Figure 3 21 Figure 3 3.2.2. Metataxonomy of Colonic Fermentations Three different datasets representing taxa abundance at phylum, family, and species levels were prepared. Complete R models of ANOVA of phylum, family, and species levels for MiSeq analysis are reported in the Supplemental Materials. From the larger datasets, OTUs biologically involved in digestion of lactose and dairy products were selected as variables to focus the discussion. In particular, 9 variables were selected for the phylum level ( Figure 4 Table S6 Figure 4 Table S7 Figure 4 Table S8 Figure 4 Table S9 Figure 4 Table S10 10 p 2 2 Figure 4 Tables S7 and S8 p Figure 4 Table S6 Firmicutes Bacteroidetes Proteobacteria Table S6 Bacteroidaceae Ruminococcaceae Figure 4 Table S7 Enterobacteriaceaceae Veillonellaceae Figure 4 Table S7 LF and L colon fermentations did not significantly modulate lactic acid bacteria ( Enterococcaceae Lactobacillaceae Streptococcaceae Bifidobacteriaceae Enterobacteriaceae Table S7 Figure 4 Table S9 Ruminococcus Faecalibacterium Bacteroides fragilis. Figure 4 Table S8 Escherichia Bifidobacterium bifidum 3.2.3. Enumeration of Selected Bacterial Targets The shifts observed during fermentation time are reported as Log 2 Figure 5 Table S11 Eubacteria 9 7 Firmicutes 9 7 Bacteroidetes 8 7 p Bacteroidetes Lactobacillales 4 3 Bifidobacteriaceae 5 4 Figure 5 Enterobacteriaceae 5 3 p 4. Discussion Lactose, a specific component of mammalian milk, is not fully metabolized and absorbed in the jejunum, and a portion of dietary lactose may reach the large intestine [ 43 1 44 Bifidobacterium Lactobacillus 45 46 Our results demonstrated that LF and L milk differentially modulate the colonic microbiota of lactose-tolerant subjects, with several microbiological indicators suggesting that LF milk increases the risk of dysbiosis in these subjects. Firstly, although colonic fermentation of both milks caused a reduction in alpha biodiversity related to entropy of microbiota, this reduction was greater after LF fermentation. Secondly, LF fermentation decreased acetate and butyrate production, concomitant with a reduction in beneficial Bifidobacteriaceae Lactobacillales Escherichia Escherichia 47 Veillonellaceae 48 Bacteroides fragilis Fusobacterium gonidiaformans 49 50 In contrast, L fermentation produced positive effects. It caused a reduction in Firmicutes Lactobacillales Lactobacillales Bifidobacteriaceae Bifidobacterium bifidum 36 Bifidobacterium spp Lactobacillus Enterococcus spp 51 51 17 Table 1 Peptostreptococcaceae Peptostreptococcaceae 5. Conclusions The consumption of foods with the “free from” attribute is constantly increasing (lactose-free, gluten-free, etc.) although it is not recommended for healthy individuals [ 52 53 In this study, a negative modulation of lactose-tolerant gut microbiota through the fermentation of LF milk was reported, suggesting the functional role of the disaccharide in healthy individuals and possible concerns related to its exclusion. Our results do not consider the adaptive mechanisms that might occur during prolonged intake of LF milk in normal subjects. In lactose-intolerant individuals, colonic microbes adapt to the presence of lactose in the colon lumen, sometimes leading to milder and less severe gastrointestinal symptoms. Adaptation could also occur in the opposite situation, and further studies are needed to evaluate this aspect and to validate our findings in vivo. The results obtained with L fermentation may appear exaggerated, considering that the INFOGEST in vitro digestion protocol does not include lactase. Consequently, in our in vitro model, a higher level of lactose reached the colon than would occur in vivo. However, our intent was to focus on the gut microbiota and not on bio-accessibility. From this perspective, the microbiota of normal subjects used in MICODE contained several species that naturally express lactase at levels sufficient to compensate for the absence of lactase in the INFOGEST digestion system. Considering these limitations, the results obtained from the MICODE in vitro model could be valuable for understanding the effects of healthy microbiota interacting with foods tailored for altered microbiota, demonstrating that what is healthy for one is not necessarily healthy for all. This study brings to light the finding that self-made diet restrictions could be harmful in those consumers who do not need them and supports European Society for Clinical Nutrition and Metabolism (ESPEN) guidelines, which do not recommend the routine adherence to lactose-free diets if no intolerance is diagnosed [ 54 Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/microorganisms13092021/s1 55 56 57 58 59 Author Contributions Conceptualization, L.N., A.B., and A.G.; methodology, L.N., F.C., A.B., and A.G.; software, L.N. and F.C.; validation, L.N., A.B., and A.G.; formal analysis, F.C. and L.N.; investigation, F.C., L.N., A.B., and A.G.; resources, A.B. and A.G.; data curation, F.C., L.N., and A.G.; writing—original draft preparation, F.C. and L.N.; writing—review and editing, L.N., F.C., A.B., and A.G.; visualization, F.C. and L.N.; supervision, L.N., A.B., and A.G.; project administration, A.B. and A.G.; funding acquisition, A.B. and A.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was accomplished adhering to bioethics methods required at University of Bologna, and approved by the Bioetchical committe of the University of Bologna(protocol code Prot. n. 0061183 and approved on 15 March). Informed Consent Statement Patient consent was waived due to the article is about gut microbiota research and contains no identifiable human information. Data Availability Statement Data other than those reported in the MS or in the Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. References 1. Forsgård R.A. Lactose digestion in humans: Intestinal lactase appears to be constitutive whereas the colonic microbiome is adaptable Am. J. Clin. Nutr. 2019 110 273 279 10.1093/ajcn/nqz104 31175813 PMC6669050 2. Campbell A.K. Waud J.P. Matthews S.B. The molecular basis of lactose intolerance Sci. Prog. 2005 88 157 202 10.3184/003685005783238408 16805112 PMC10367523 3. Vesa T.H. Marteau P. Korpela R. Lactose intolerance J. Am. Coll. Nutr. 2000 19 (Suppl. 2) 165S 175S 10.1080/07315724.2000.10718086 10759141 4. Canani R.B. Pezzella V. Amoroso A. Cozzolino T. Di Scala C. Passariello A. Diagnosing and treating intolerance to carbohydrates in children Nutrients 2016 8 157 10.3390/nu8030157 26978392 PMC4808885 5. Misselwitz B. Butter M. Verbeke K. Fox M.R. Update on lactose malabsorption and intolerance: Pathogenesis, diagnosis and clinical management Gut 2019 68 2080 2091 10.1136/gutjnl-2019-318404 31427404 PMC6839734 6. Windey K. Houben E. Deroover L. Verbeke K. Contribution of colonic fermentation and fecal water toxicity to the pathophysiology of lactose-intolerance Nutrients 2015 7 7505 7522 10.3390/nu7095349 26371036 PMC4586544 7. Dekker P.J.T. Koenders D. Bruins M.J. Lactose-free dairy products: Market developments, production, nutrition and health benefits Nutrients 2019 11 551 10.3390/nu11030551 30841534 PMC6471712 8. Gupta R.S. Warren C.M. Smith B.M. Jiang J. Blumenstock J.A. Davis M.M. Schleimer R.P. Nadeau K.C. Prevalence and severity of food allergies among US adults JAMA Netw. Open 2019 2 e185630 10.1001/jamanetworkopen.2018.5630 30646188 PMC6324316 9. Li X. Yin J. Zhu Y. Wang X. Hu X. Bao W. Huang Y. Chen L. Chen S. Yang W. Effects of whole milk supplementation on gut microbiota and cardiometabolic biomarkers in subjects with and without lactose malabsorption Nutrients 2018 10 1403 10.3390/nu10101403 30279333 PMC6213503 10. Allied Market Research Available online: https://www.alliedmarketresearch.com/lactose-free-dairy-market-A18453 (accessed on 9 February 2024) 11. Slupsky C.M. He X. Hernell O. Andersson Y. Rudolph C. Lönnerdal B. West C.E. Postprandial metabolic response of breast-fed infants and infants fed lactose-free vs regular infant formula: A randomized controlled trial Sci. Rep. 2017 7 3640 10.1038/s41598-017-03975-4 28623320 PMC5473881 12. Abrams S.A. Griffin I.J. Davila P.M. Calcium and zinc absorption from lactose-containing and lactose-free infant formulas Am. J. Clin. Nutr. 2002 76 442 446 10.1093/ajcn/76.2.442 12145020 13. Szilagyi A. Lactose—A potential prebiotic Aliment. Pharmacol. Ther. 2002 16 1591 1602 10.1046/j.1365-2036.2002.01321.x 12197838 14. Szilagyi A. Redefining lactose as a conditional prebiotic Can. J. Gastroenterol. Hepatol. 2004 18 163 167 10.1155/2004/350732 15054489 15. Brodkorb A. Egger L. Alminger M. Alvito P. Assunção R. Ballance S. Bohn T. Bourlieu-Lacanal C. Boutrou R. Carrière F. INFOGEST static in vitro simulation of gastrointestinal food digestion Nat. Protoc. 2019 14 991 1014 10.1038/s41596-018-0119-1 30886367 16. Gianotti A. Marin V. Cardone G. Bordoni A. Mancini E. Magni M. Pichler A. Ciani S. Polenghi O. Cerne V.L. Personalized and precise functional assessment of innovative flatbreads toward the colon microbiota of people with metabolic syndrome: Results from an in vitro simulation Food Res. Int. 2025 209 116197 10.1016/j.foodres.2025.116197 40253173 17. Casciano F. Nissen L. Bordoni A. Gianotti A. Colonic in vitro model assessment of effect of lactose-free milk on gut microbiota of lactose intolerant donors Int. J. Food Sci. Technol. 2022 58 4485 4494 10.1111/ijfs.16253 18. Diotallevi C. Gaudioso G. Fava F. Angeli A. Lotti C. Vrhovsek U. Rinott E. Shai I. Gobbetti M. Tuohy K. Measuring the effect of Mankai® ( Wolffia globosa J. Funct. Foods 2021 84 104597 10.1016/j.jff.2021.104597 19. Nissen L. Casciano F. Chiarello E. Di Nunzio M. Bordoni A. Gianotti A. Sourdough process and spirulina-enrichment can mitigate the limitations of colon fermentation performances of gluten-free breads in non-celiac gut model Food Chem. 2024 436 137633 10.1016/j.foodchem.2023.137633 37839115 20. Oba S. Sunagawa T. Tanihiro R. Awashima K. Sugiyama H. Odani T. Nakamura Y. Kondo A. Sasaki D. Sasaki K. Author Correction: Prebiotic effects of yeast mannan, which selectively promotes Bacteroides thetaiotaomicron and Bacteroides ovatus in a human colonic microbiota model Sci. Rep. 2021 11 3741 10.1038/s41598-021-83010-9 33558589 PMC7870808 21. Nissen L. Casciano F. Babini E. Gianotti A. Beneficial metabolic transformations, and prebiotic potential of hemp bran and its alcalase hydrolysate, after colonic fermentation in a gut model Sci. Rep. 2023 13 1552 10.1038/s41598-023-27726-w 36707683 PMC9883387 22. Wang X. Gibson G.R. Sailer M. Theis S. Rastall R.A. Björkroth J. Prebiotics inhibit proteolysis by gut bacteria in a host diet-dependent manner: A three-stage continuous in vitro gut model experiment Appl. Environ. Microbiol. 2020 86 e02730-19 10.1128/AEM.02730-19 32198169 PMC7205502 23. Cattivelli A. Nissen L. Casciano F. Tagliazucchi D. Gianotti A. Impact of cooking methods of red-skinned onion on metabolic transformation of phenolic compounds and gut microbiota changes Food Funct. 2023 14 3509 3525 10.1039/D3FO00085K 37014170 24. Day-Walsh P. Shehata E. Saha S. Savva G.M. Nemeckova B. Speranza J. Kellingray L. Narbad A. Kroon P.A. The use of an in vitro batch fermentation (human colon) model for investigating mechanisms of TMA production from choline, l-carnitine, and related precursors by the human gut microbiota Eur. J. Nutr. 2021 60 3987 3999 10.1007/s00394-021-02572-6 33934200 PMC8437865 25. Marino M. de Wittenau G.D. Saccà E. Cattonaro F. Spadotto A. Innocente N. Radovic S. Piasentier E. Marroni F. Metagenomic profiles of different types of Italian high-moisture Mozzarella cheese Food Microbiol. 2018 79 123 131 10.1016/j.fm.2018.12.007 30621867 26. Bolyen E. Rideout J.R. Dillon M.R. Bokulich N.A. Abnet C.C. Al-Ghalith G.A. Alexander H. Alm E.J. Arumugam M. Asnicar F. Reproducible, interactive, scalable and extensible microbiome data science using QIIME 2 Nat. Biotechnol. 2019 37 852 857 10.1038/s41587-019-0209-9 31341288 PMC7015180 27. Love M.I. Huber W. Anders S. Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol. 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 28. Hill C.J. Lynch D.B. Murphy K. Ulaszewska M. Jeffery I.B. O’shea C.A. Watkins C. Dempsey E. Mattivi F. Tuohy K. Evolution of gut microbiota composition from birth to 24 weeks in the INFANTMET Cohort Microbiome 2017 5 4 Erratum in Microbiome 2017 5 10.1186/s40168-016-0213-y 28095889 PMC5240274 29. Modesto M. Stefanini I. D’aImmo M. Nissen L. Tabanelli D. Mazzoni M. Bosi P. Strozzi G. Biavati B. Strategies to augment non-immune system based defence mechanisms against gastrointestinal diseases in pigs NJAS—Wagening. J. Life Sci. 2011 58 149 156 10.1016/j.njas.2011.04.001 30. Tanner S.A. Berner A.Z. Rigozzi E. Grattepanche F. Chassard C. Lacroix C. Heimesaat M.M. In vitro continuous fermentation model (PolyFermS) of the Swine proximal colon for simultaneous testing on the same gut microbiota PLoS ONE 2014 9 e94123 10.1371/journal.pone.0094123 24709947 PMC3978012 31. Tsitko I. Wiik-Miettinen F. Mattila O. Rosa-Sibakov N. Seppänen-Laakso T. Maukonen J. Nordlund E. Saarela M. A small in vitro fermentation model for screening the gut microbiota effects of different fiber preparations Int. J. Mol. Sci. 2019 20 1925 10.3390/ijms20081925 31003566 PMC6514940 32. Granato D. de Araújo Calado V.M. Jarvis B. Observations on the use of statistical methods in Food Science and Technology Food Res. Int. 2014 55 137 149 10.1016/j.foodres.2013.10.024 33. Vázquez-Baeza Y. Pirrung M. Gonzalez A. Knight R. EMPeror: A tool for visualizing high-throughput microbial community data GigaScience 2013 2 16 10.1186/2047-217X-2-16 24280061 PMC4076506 34. Goedhart J. Luijsterburg M.S. VolcaNoseR is a web app for creating, exploring, labeling and sharing volcano plots Sci. Rep. 2020 10 20560 10.1038/s41598-020-76603-3 33239692 PMC7689420 35. Spitzer M. Wildenhain J. Rappsilber J. Tyers M. BoxPlotR: A web tool for generation of box plots Nat. Methods 2014 11 121 122 10.1038/nmeth.2811 24481215 PMC3930876 36. Vitellio P. Celano G. Bonfrate L. Gobbetti M. Portincasa P. De Angelis M. Effects of Bifidobacterium longum Lactobacillus rhamnosus Nutrients 2019 11 886 10.3390/nu11040886 31010241 PMC6520754 37. Vipperla K. O’KEefe S.J. The microbiota and its metabolites in colonic mucosal health and cancer risk Nutr. Clin. Pract. 2012 27 624 635 10.1177/0884533612452012 22868282 38. Tain Y.-L. Chang S.K.C. Liao J.-X. Chen Y.-W. Huang H.-T. Li Y.-L. Hou C.-Y. Synthesis of short-chain-fatty-acid resveratrol esters and their antioxidant properties Antioxidants 2021 10 420 10.3390/antiox10030420 33801821 PMC8001046 39. Xiong R.-G. Zhou D.-D. Wu S.-X. Huang S.-Y. Saimaiti A. Yang Z.-J. Shang A. Zhao C.-N. Gan R.-Y. Li H.-B. Health benefits and side effects of short-chain fatty acids Foods 2022 11 2863 10.3390/foods11182863 36140990 PMC9498509 40. Xu Y. Zhu Y. Li X. Sun B. Dynamic balancing of intestinal short-chain fatty acids: The crucial role of bacterial metabolism Trends Food Sci. Technol. 2020 100 118 130 10.1016/j.tifs.2020.02.026 41. Ma Q. Meng N. Li Y. Wang J. Occurrence, impacts, and microbial transformation of 3-methylindole (skole): A critical review J. Hazard. Mater. 2021 416 126181 10.1016/j.jhazmat.2021.126181 42. Diether N.E. Willing B.P. Microbial fermentation of dietary protein: An important factor in diet–microbe–host interaction Microorganisms 2019 7 19 10.3390/microorganisms7010019 30642098 PMC6352118 43. Bond J.H. Levitt M.D. Quantitative measurement of lactose absorption Gastroenterology 1976 70 1058 1062 10.1016/S0016-5085(76)80311-3 1269865 44. Starz E. Wzorek K. Folwarski M. Kaźmierczak-Siedlecka K. Stachowska L. Przewłócka K. Stachowska E. Skonieczna-Żydecka K. The modification of the gut microbiota via selected specific diets in patients with Crohn’s Disease Nutrients 2021 13 2125 10.3390/nu13072125 34206152 PMC8308385 45. Kurilshikov A. Medina-Gomez C. Bacigalupe R. Radjabzadeh D. Wang J. Demirkan A. Le Roy C.I. Garay J.A.R. Finnicum C.T. Liu X. Large-scale association analyses identify host factors influencing human gut microbiome composition Nat. Genet. 2021 53 156 165 10.1038/s41588-020-00763-1 33462485 PMC8515199 46. Van den Abbeele P. Sprenger N. Ghyselinck J. Marsaux B. Marzorati M. Rochat F. A comparison of the in vitro effects of 2’fucosyllactose and lactose on the composition and activity of gut microbiota from infants and toddlers Nutrients 2021 13 726 10.3390/nu13030726 33668823 PMC7996240 47. Li X. Zhang B. Hu Y. Zhao Y. New insights into gut-bacteria-derived indole and its derivatives in intestinal and liver diseases Front. Pharmacol. 2021 12 769501 10.3389/fphar.2021.769501 34966278 PMC8710772 48. Bonder M.J. Tigchelaar E.F. Cai X. Trynka G. Cenit M.C. Hrdlickova B. Zhong H. Vatanen T. Gevers D. Wijmenga C. The influence of a short-term gluten-free diet on the human gut microbiome Genome Med. 2016 8 45 10.1186/s13073-016-0295-y 27102333 PMC4841035 49. Valguarnera E. Wardenburg J.B. Good gone bad: One toxin away from disease for Bacteroides fragilis J. Mol. Biol. 2020 432 765 785 10.1016/j.jmb.2019.12.003 31857085 50. Centor R.M. Atkinson T.P. Xiao L. Fusobacterium necrophorum Anaerobe 2022 75 102532 10.1016/j.anaerobe.2022.102532 35122953 51. Tennoune N. Andriamihaja M. Blachier F. Production of indole and indole-related compounds by the intestinal microbiota and consequences for the host: The Good, the Bad, and the Ugly Microorganisms 2022 10 930 10.3390/microorganisms10050930 35630374 PMC9145683 52. Sundar A. Kardes F.R. The role of perceived variability and the health halo effect in nutritional inference and consumption Psychol. Mark. 2015 32 512 521 10.1002/mar.20796 53. Castellini G. Savarese M. Graffigna G. The role of free-from symbols on consumer perceptions of healthiness, quality and intention to buy baked food products Int. J. Food Sci. Nutr. 2023 74 395 402 10.1080/09637486.2023.2215483 37254896 54. Bischoff S.C. Escher J. Hébuterne X. Kłęk S. Krznaric Z. Schneider S. Shamir R. Stardelova K. Wierdsma N. Wiskin A.E. ESPEN practical guideline: Clinical Nutrition in inflammatory bowel disease Clin. Nutr. 2020 39 632 653 10.1016/j.clnu.2019.11.002 32029281 55. Lane D.J. Harrison A.P. Jr. Stahl D. Pace B. Giovannoni S.J. Olsen G.J. Pace N.R. Evolutionary relationship among sulfur- and iron-oxidizing eubacteria J. Bacteriol. 1992 174 269 278 10.1128/jb.174.1.269-278.1992 1729214 PMC205705 56. Guo X. Xia X. Tang R. Zhou J. Zhao H. Wang K. Development of a real-time PCR method for Firmicutes Bacteroidetes Lett. Appl. Microbiol. 2008 47 367 373 10.1111/j.1472-765X.2008.02408.x 19146523 57. Walter J. Hertel C. Tannock G.W. Lis C.M. Munro K. Hammes W.P. Detection of Lactobacillus Pediococcus Leuconostoc Weissella Appl. Environ. Microbiol. 2001 67 2578 2585 10.1128/AEM.67.6.2578-2585.2001 11375166 PMC92910 58. Masco L. Ventura M. Zink R. Huys G. Swings J. Polyphasic taxonomic analysis of Bifidobacterium animalis Bifidobacterium lactis Bifidobacterium animalis Bifidobacterium animalis animalis Bifidobacterium lactis Bifidobacterium animalis lactis Int. J. Syst. Evol. Microbiol. 2004 54 1137 1143 10.1099/ijs.0.03011-0 15280282 59. Bartosch S. Fite A. Macfarlane G.T. McMurdo M.E.T. Characterization of bacterial communities in feces from healthy elderly volunteers and hospitalized elderly patients by using real-time PCR and effects of antibiotic treatment on the fecal microbiota Appl. Environ. Microbiol. 2004 70 3575 3581 10.1128/AEM.70.6.3575-3581.2004 15184159 PMC427772 Figure 1 PCA plots of the volatilome sorted by chemical classes. ( a b c d a c Figure 2 Changes in abundance of ( a b Figure 3 Ecological diversities representing baseline (BL) and end points of colonic fermentation of human colon microbiota. Values were recorded after in vitro digestion and fermentation of different milk samples. ( a b c d p < Figure 4 Microbiota 16S-rRNA analyses of baseline (BL) and samples after colonic fermentation: ( a b c d e f g Figure 5 Changes with respect to baseline of fermentation expressed as Log 2 Table S11 microorganisms-13-02021-t001_Table 1 Table 1 Main changes in human colonic microbiota after in vitro fermentation of milk. Outputs Lactose Tolerant Lactose Intolerant [ 17 Metabolomics UHT Semi-Skimmed Milk (L) UHT Semi-Skimmed Lactose-Free Milk (LF) UHT Semi- UHT Semi-Skimmed Lactose-Free Milk (LF) Organic acids main descriptors Pentanoic acid and propanoic acid, 2-methyl Butanoic acid Pentanoic acid, hexanoic acid, octanoic acid Butanoic acid Alcohols main descriptors 2-Octen-1-ol, (E) and 1-Propanol 3-Buten-1-ol, 3-methyl-, benzyl alcohol, phenethyl alcohol, and phenol, 4-methyl 1-Butanol, Phenol Ethyl alcohol, 1-Octanol, 1-Hexanol, 2-ethyl Other VOCs main descriptors Dimethyl trisulfide Thiazole, 2-methyl 2-Hexanone 2-Acetylthiazole SCFA production Increased acetic acid Unbalanced production Increased acetic acid Increased butanoic acid Detrimental VOCs production All decreased Increased Indole Increased p-cresol All decreased  Outputs  Lactose tolerant Lactose intolerant 17  Microbiomics  UHT semi-skimmed milk (L)  UHT semi-skimmed lactose-free milk (LF)  UHT semi- skimmed milk (L)  UHT semi-skimmed lactose-free milk (LF) Metataxonomy Increased Bifidobacterium bifidum Decreased Ruminococcaceae; Veillonellaceae Peptostreptococcaceae Increased Klebsiella Faecalibacterium prausnitsii, Roseburia faecis. Unchanged Verrucomicrobia Peptostreptococcaceae Selected bacterial taxa Increased Lactobacillales Bifidobacteriaceae Decreased Lactobacillales Bifidobacteriaceae Increased Lactobacillales Enterobacteriaceae Decreased Bacteroidetes Lactobacillales; Enterobacteriaceae ",
  "metadata": {
    "Title of this paper": "Characterization of bacterial communities in feces from healthy elderly volunteers and hospitalized elderly patients by using real-time PCR and effects of antibiotic treatment on the fecal microbiota",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471900/"
  }
}