{
  "title": "Paper_889",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471725 PMC12471725.1 12471725 12471725 41010991 10.3390/medicina61091600 medicina-61-01600 1 Article Curcumin as an Epigenetic Modulator: Suppression of Breast Cancer via the Hsa_circ_0001946/MiR-7-5p/Target Gene Axis https://orcid.org/0000-0003-2869-6620 Abuaisha Asmaa Project administration Writing – original draft Formal analysis Conceptualization Methodology Investigation Writing – review & editing Funding acquisition Resources Visualization Data curation Validation 1 2 * https://orcid.org/0000-0003-2241-7088 Kaya Murat Conceptualization Methodology Formal analysis Validation Investigation Supervision Data curation Funding acquisition Writing – review & editing Project administration 3 https://orcid.org/0000-0003-1954-4190 Suer Ilknur Conceptualization Methodology Validation Investigation Data curation Writing – review & editing Visualization Supervision Funding acquisition 4 https://orcid.org/0000-0001-9333-6926 Emiroglu Selman Methodology Resources Data curation Writing – review & editing Supervision Project administration 5 6 https://orcid.org/0000-0002-5014-0074 Bayram Aysel Resources Writing – review & editing Visualization 7 https://orcid.org/0000-0002-3879-1982 Tukenmez Mustafa Validation Supervision Resources Writing – review & editing 5 https://orcid.org/0000-0002-0989-7411 Cabioglu Neslihan Data curation Writing – review & editing Resources 5 https://orcid.org/0000-0003-0279-5671 Muslumanoglu Mahmut Resources Writing – review & editing Supervision 5 https://orcid.org/0000-0002-7383-8619 Nazligul Esra Investigation Writing – review & editing 8 https://orcid.org/0000-0003-4394-3976 Papila Berrin Resources Writing – review & editing 6 9 https://orcid.org/0000-0002-9204-1234 Aytatlı Abdulmelik Investigation Data curation 10 https://orcid.org/0000-0002-0379-2088 Karatas Omer Faruk Validation Investigation 10 https://orcid.org/0000-0002-9420-4543 Cefle Kivanc Visualization Writing – review & editing Supervision 3 https://orcid.org/0000-0002-9435-009X Palanduz Sukru Supervision Writing – review & editing 3 https://orcid.org/0000-0002-8809-7462 Ozturk Sukru Conceptualization Validation Data curation Writing – review & editing Supervision Project administration Funding acquisition 3 Efird Jimmy T. Academic Editor Biswas Tithi Academic Editor 1 2 3 4 5 6 7 8 9 10 * asmaa.m.abuaisha@gmail.com 04 9 2025 9 2025 61 9 497654 1600 03 8 2025 30 8 2025 02 9 2025 04 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results CKS2 TOP2A PARP1 CKS2 Conclusions breast cancer curcumin Hsa_circ_0001946 CDR1as MiR-7-5p target genes CKS2 Istanbul University—Scientific Research Projects Coordination Unit (BAP) TDK-2023-39955 Presidency of Turkish Health Institutes (TÜSEB) 32560 Council of Higher Education Research Universities Support Program (ADEP–Istanbul University) TDK-2023-39483 This research was carried out as part of the doctoral thesis of A.A. (Asmaa Abuaisha) at Istanbul University. The research was financially supported by the Istanbul University—Scientific Research Projects Coordination Unit (BAP) (Project No: TDK-2023-39955), and the Presidency of Turkish Health Institutes (TÜSEB) (Project No: 32560). Also, the study was partially supported by the Council of Higher Education Research Universities Support Program (ADEP–Istanbul University) (Project No: TDK-2023-39483). The funders had no role in the study design, data collection and analysis, the decision to publish the manuscript, or the preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Breast cancer (BC) is the second most diagnosed cancer worldwide, and the most diagnosed cancer in women. According to the GLOBOCAN database in 2022, BC accounted 11.6% of all cancer incidences, and 6.9% of all cancer deaths [ 1 2 3 4 5 Curcumin is a natural polyphenol that is derived from the turmeric plant ( Curcuma longa 6 7 8 9 10 11 12 Circular RNAs (circRNAs) and microRNAs (miRNAs) are examples of the epigenetic modifications that influence the pathogenesis and progression of cancer [ 13 14 15 16 17 18 19 IGF1R 20 Curcumin’s ability to modulate miRNA expression has opened up new approaches in the field of cancer treatment [ 21 22 MCM2 MMP1 MMP9 23 CFL1 SIX4 MAZ 11 24 This study aimed to elucidate the functional role and biological effects of curcumin on the hsa_circ_0001946/miR-7-5p/target gene regulatory axis in MCF-7 and T47D breast cancer cell lines, using MCF-10A cells as a non-cancerous control. Additionally, we aimed to determine the relative expression levels of hsa_circ_0001946, miR-7-5p and the CKS2 2. Materials and Methods 2.1. Tissue Specimens This study was approved by the Ethical Committee of the Istanbul University, Istanbul Faculty of Medicine (File No. 2023/585; Date: 07.04.2023). Informed consent was obtained from all the patients before the procedure. Power analysis was performed to determine the sample size required for this study. The calculation method (d-value) developed by Cohen was used to calculate the size of the impact to be used in determining the sample size in the study [ 25 18 BC tumor tissue and normal tissue adjacent to the tumor samples were collected from 30 luminal A- and 35 luminal B-subtype BC patients. All patients were women who had been diagnosed with invasive BC, with a tumor size of greater than 15 mm, who had not received chemotherapy or hormone therapy before being operated on in the Breast Surgery Division, General Surgery Department, Istanbul Faculty of Medicine of Istanbul University. All tissues to be used in this study were evaluated and obtained from the Pathology Department of Istanbul University. Tissue samples were washed with PBS and stored at −80 °C for RNA isolation. The samples were physically broken down by using a mortar and pestle and crushed in liquid nitrogen. Subsequently, the samples were resuspended in TRIzol Reagent (Invitrogen, USA) for total RNA isolation. 2.2. Cell Culture The human luminal BC cell lines MCF-7 and T47D (ER+/HER2−) and the non-tumorigenic human mammary epithelial cell line MCF-10A (ER−) were utilized in this study [ 26 27 2 2.3. Curcumin Treatment and Cell Transfection with circ_0001946 siRNA and miR-7-5p Mimic Curcumin (Bio Basic Inc., Canada) was dissolved in 100% dimethyl sulfoxide (DMSO) (EcoTech Biotechnology, Turkey) at a concentration of 1 mg/mL. According to the recommendations in the previous literature, MCF-7 and T47D cells were treated with curcumin at different doses (5, 10, 20 μM) for 24 h [ 28 29 50 Small interfering RNA was used to knock down circ_0001946 (CDR1as siRNA). Silencer select negative control siRNA was used as a non-target siRNA negative control (NT siRNA) (Thermo Fisher Scientific, USA). The MCF-7 and T47D cell lines were transfected with 100 pmol of CDR1as siRNA and NT siRNA by using Lipofectamine 2000 transfection reagent (Invitrogen, USA) [ 30 31 2.4. Cell Viability Detection Cell viability detection kit 8 (CVDK-8) (EcoTech Biotechnology, Turkey) was employed to assess cells viability. Cells were cultured (3 × 10 3 11 2.5. Wound Healing Assay The scratch assay was used for cell migration detection. Cells were cultured (4 × 10 5 23 2.6. Cell Apoptosis Analysis Cell apoptosis was evaluated by using the Annexin V-FITC apoptosis detection kit (eBioscience-Invitrogen, Austria). MCF-7 cells were seeded (4 × 10 5 32 2.7. Identification of the Potential Target Genes of miR-7-5p Potential target genes of miR-7-5p were first searched for in the miRNet database by selecting the options “human”, “miRBase ID” and “miRTarBase V9” and protein–protein interaction (PPI) was marked. Afterwards, a search was made by typing “hsa-miR-7-5p”. In parallel, the TCGA-Breast Cancer dataset in the https://www.cancer.gov/ccg/research/genome-sequencing/tcga p 33 2.8. Relative Expression Levels Evaluated by qPCR The relative expression of hsa_circ_0001946 and the identified genes were evaluated using quantitative real-time polymerase chain reaction (qPCR). Total RNA isolation was performed using TRIzol Reagent (Invitrogen, USA) in accordance with the manufacturer’s protocol. The concentration and purity of the isolated RNA were assessed using a NanoDrop ND-2000c spectrophotometer (Thermo Fisher Scientific Inc., USA). OneScript ® GAPDH 23 2.9. Western Blot Analysis MCF-7 and T47D cells were seeded in duplicates into 6-well plates. After 48 h of curcumin treatment, the cells were harvested and washed twice with ice-cold PBS. Cell lysis was performed using RIPA buffer (EcoTech Biotechnology, Turkey) supplemented with 10 mM phenylmethylsulfonyl fluoride (PMSF, Roche) and a protease inhibitor cocktail (Thermo Fisher Scientific, USA). The cell lysate was centrifuged at 14.000 g for 15 min at 4 °C to separate cell debris and collect the supernatant containing the cellular proteins. The total protein concentrations were quantified using ClearBand Bradford Reagent (EcoTech Biotechnology, Turkey). After cell lysates were mixed with 10X Laemmli Sample Buffer (EcoTech Biotechnology, Turkey), the samples were boiled at 100 °C for 5 min. Subsequently, equal amounts of protein (30 μg) were separated on 10% SDS-PAGE gel and transferred to a nitrocellulose membrane (EcoTech Biotechnology, Turkey) using the Semi-Dry Trans-Blot Turbo Transfer System (Bio-Rad, Hercules, CA, USA). Membranes were blocked with 5% skimmed milk for 1 h and washed three times with 1X PBST buffer (EcoTech Biotechnology, Turkey) for 20 min. Afterwards, the membranes were incubated overnight at 4 °C with PBST-diluted primary antibodies against CKS2 (Thermo Fisher, USA) (100 UL) and β-actin (Santa Cruz Biotechnology, USA). After washing with PBST buffer for 20 min at least twice, HRP-conjugated anti-rabbit and anti-mouse secondary antibodies (Santa Cruz Biotechnology, USA) were applied for 1 h at 25 °C. Protein signals were visualized using the ClearBand ECL Western Blotting Substrate (EcoTech Biotechnology, Turkey). Quantification of the specific protein bands was performed with ImageJ 1.53f software [ 34 2.10. Statistical Analysis The normal distribution of continuous variables was examined with the Kolmogorov–Smirnov test. Categorical variables were presented as the frequency ( n p −ΔΔCt t p p p p 3. Results 3.1. Curcumin Inhibits the Proliferation and Migration of BC Cells Significantly, curcumin treatment decreased the cell viability and proliferation state depending on increasing concentrations in MFC-7 and T47D cell lines. The non-cancerous MCF-10A cell line showed a non-significant change in viability and proliferation after curcumin treatment ( Figure 1 The half-maximal inhibitory concentration (IC 50 p Figure 2 3.2. Curcumin Alters Expression of hsa_circ_0001946 and miR-7-5p in BC Cell Line Treatment of MCF-7 and T47D cells with curcumin resulted in a significant downregulation of hsa_circ_0001946/CDR1as expression alongside a significant upregulation of miR-7-5p expression in a dose-dependent manner ( Figure 3 3.3. Knockdown of circ_0001946 Hindered the Viability and Migration of BC Cells by Upregulating miR-7-5p Successful transfection of CDR1as siRNA into MCF-7 and T47D cell lines resulted in a significant reduction in circ_0001946 expression compared to the control group. Correspondingly, the relative expression level of miR-7-5p was significantly increased in both cell lines following CDR1as siRNA transfection ( Figure 4 Cell viability, proliferation, and migration were significantly reduced in MCF-7 and T47D cells following transfection with CDR1as siRNA compared to NT siRNA ( p Figure 5 Moreover, successful transfection of the miR-7-5p mimic into MCF-7 and T47D cells resulted in a significant increase in miR-7-5p expression compared to that in the control group. Apoptotic cell rates were notably elevated in MCF-7 cells transfected with either CDR1as siRNA or the miR-7-5p mimic, as shown in Figure 6 Additionally, cell viability, proliferation, and migration significantly decreased in MCF-7 and T47D cells transfected with the miR-7-5p mimic compared to the control ( p Figure 7 3.4. Bioinformatic Analysis of miR-7-5p Target Genes MiRNet analysis identified 578 potential target genes for miR-7-5p, with 1023 predicted interactions among them. According to the analysis of TCGA BC data, 545 genes were found to be upregulated in BC samples under the defined selection criteria. In total, 10 overlapped genes between TCGA data and miRNet data were identified for this study. The selected genes were CKS2, TOP2A, GINS1, NREP, SLC7A5, PARP1, TMEM97, UHRF1, CANT1 MARCKSL1 Figure 8 CKS2 PARP1 TOP2A UHRF1 GINS1 p Figure 8 3.5. Curcumin Suppresses BC Cells by Modulating miR-7-5p Target Genes The expression levels of the selected genes ( CKS2, TOP2A, GINS1, NREP, SLC7A5, PARP1, TMEM97, UHRF1, CANT1 MARCKSL1 Table 1 To identify potential curcumin-regulated targets, gene expression profiles of BC cell lines were first compared with those of the MCF-10A cell line. Five genes ( CKS2, TOP2A, PARP1, UHRF1 GINS1 CKS2, TOP2A, PARP1, UHRF1 CKS2, TOP2A, PARP1 Figure 9 Among the candidates, CKS2 Figure 10 3.6. Hsa_circ_0001946/miR-7-5p/CKS2 Axis as Potential Biomarker in Breast Cancer The demographic, and clinicopathological characteristics of the patients are presented in Table 2 Table 3 The expression level of miR-7-5p was significantly reduced in cancer tissue samples. On the contrary, hsa_circ_0001946 and CKS2 Figure 11 4. Discussion Breast cancer is the most common malignancy among women and is characterized by both genetic and epigenetic alterations that disrupt multiple signaling pathways. Due to its heterogeneous nature and the influence of tumor microenvironmental factors, BC cells often develop resistance to therapy. As a result, targeting a single signaling pathway is typically insufficient for effective treatment [ 46 5 Curcumin, derived from Curcuma longa 47 11 23 24 48 49 50 NCT03980509 NCT03072992 NCT03192059 NCT03769766 51 52 In addition to the phytotherapy, emerging epigenetic therapeutics, including mRNA regulators (such as miRNA mimics and antagomiRs), DNA methyltransferase (DNMT) inhibitors, and histone-modifying enzymes, have shown promise in reversing these aberrant alterations, positioning them as potential candidates for cancer therapy [ 53 54 53 55 The circRNA/miRNA/mRNA regulatory axis may play a critical role in cancer development, progression, and therapeutic response [ 56 57 58 59 The results of this study demonstrated that the expression levels of hsa_circ_0001946 were upregulated in both BC cell lines and patient tissue samples, consistent with the results of previous studies [ 15 60 18 19 CKS2 TOP2A PARP1 GINS1 UHRF1 PIK3R3 59 SMG1 58 61 62 Furthermore, the significant association of CKS2, TOP2A, and PARP1 identified through PPI analysis highlights the potential importance of these genes in developing BC treatment strategies targeting the hsa_circ_0001946/miR-7-5p axis. Consistent with the findings in the literature, CKS2 36 63 64 CKS2 65 CKS2 66 CKS2 CKS2 CKS2 CKS2 36 Considering the results altogether, curcumin shows promise in cancer therapy due to its anti-inflammatory, antioxidant, and anticancer effects. Research in this area is steadily increasing in order to further enhance the anticancer activity of curcumin [ 7 9 47 67 48 67 68 In this preliminary study, curcumin demonstrated significant anticancer effects in BC cell lines at 10 µM for 24 h. While these data provide mechanistic insight, translating in vitro concentrations into clinical applications remains difficult. Clinical research has reported encouraging findings with different curcumin formulations and doses. For instance, intravenous curcumin (300 mg weekly for 12 weeks) combined with paclitaxel improved safety and efficacy in patients with advanced BC [ 52 69 70 71 In summary, this preliminary study provides novel insights into the molecular mechanisms by which curcumin may exert its anticancer effects in BC. By demonstrating that curcumin modulates the hsa_circ_0001946/miR-7-5p/ CKS2 5. Conclusions Our preliminary findings suggest that curcumin may suppress BC growth by regulating the hsa_circ_0001946/miR-7-5p/target gene axis. Specifically, curcumin downregulates hsa_circ_0001946, upregulates miR-7-5p, and reduces the expression of key oncogenic targets such as CKS2 CKS2 Acknowledgments The authors would like to express their heartfelt gratitude to Atilla Bozdogan for his invaluable contributions to this project, particularly his expertise in statistical analyses. The authors also thank Neslihan Abaci from the Department of Genetics, Aziz Sancar Institute of Experimental Medicine, Istanbul University, and Idil Cetin from the Department of Biology, Faculty of Science, Istanbul University, for providing the cell lines used in this study. Disclaimer/Publisher’s Note: Author Contributions Conceptualization: A.A. (Asmaa Abuaisha), M.K., I.S. and S.O. Methodology: A.A. (Asmaa Abuaisha), M.K., I.S., S.E. and S.O. Validation: A.A. (Asmaa Abuaisha), M.K., I.S., S.O., M.T. and O.F.K. Formal analysis: A.A. (Asmaa Abuaisha) and M.K. Investigation: A.A. (Asmaa Abuaisha), M.K., I.S., S.E., E.N., A.A. (Abdulmelik Aytatl) and O.F.K. Resources: A.A. (Asmaa Abuaisha), S.E., N.C., M.T., A.B., M.M. and B.P. Data curation: A.A. (Asmaa Abuaisha), M.K., I.S., S.E., N.C., S.O. and A.A. (Abdulmelik Aytatl). Writing—Original Draft Preparation: A.A. (Asmaa Abuaisha). Writing—Review and Editing: A.A. (Asmaa Abuaisha), M.K., S.E., I.S., S.O., S.P., K.C., M.M., N.C., M.T., A.B., E.N. and B.P. Visualization: A.A. (Asmaa Abuaisha), I.S., S.E., A.B. and K.C. Supervision: M.K., I.S., S.O., S.P., K.C., S.E., M.T. and M.M. Project Administration: A.A. (Asmaa Abuaisha), M.K., S.E. and S.O. Funding Acquisition: A.A. (Asmaa Abuaisha), M.K., I.S. and S.O. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by the Ethical Committee of the Istanbul University, Istanbul Faculty of Medicine (File No. 2023/585; Date: 07.04.2023). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: BC Breast Cancer CircRNA Circular RNA MiRNA MicroRNA ncRNAs Non-Coding RNAs HG-DMEM High-Glucose Dulbecco’s Modified Eagle Medium DMSO Dimethyl Sulfoxide NT siRNA Non-Target siRNA Negative Control NT-miRNA Non-Target miRNA Mimic Negative Control PBS Phosphate-Buffered Saline qPCR Quantitative Real-Time PCR PPI Protein–Protein Interaction IC50 Half-Maximal Inhibitory Concentration DNMT DNA Methyltransferase 5-Aza-2′-Deoxycytidine 5-Azacytidine and Decitabine CKS2 Cyclin Kinase Subunit 2 References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Zhang X. Molecular Classification of Breast Cancer: Relevance and Challenges Arch. Pathol. Lab. Med. 2023 147 46 51 10.5858/arpa.2022-0070-RA 36136295 3. Barone D. Cito L. Tommonaro G. Abate A.A. Penon D. De Prisco R. Penon A. Forte I.M. Benedetti E. Cimini A. Antitumoral potential, antioxidant activity and carotenoid content of two Southern Italy tomato cultivars extracts: San Marzano and Corbarino J. Cell Physiol. 2018 233 1266 1277 10.1002/jcp.25995 28488765 4. Yallapu M.M. Jaggi M. Chauhan S.C. Curcumin nanomedicine: A road to cancer therapeutics Curr. Pharm. Des. 2013 19 1994 2010 10.2174/138161213805289219 23116309 PMC3640558 5. Yadav N. Parveen S. Banerjee M. Potential of nano-phytochemicals in cervical cancer therapy Clin. Chim. Acta 2020 505 60 72 10.1016/j.cca.2020.01.035 32017926 6. Prasad S. Gupta S.C. Tyagi A.K. Aggarwal B.B. Curcumin, a component of golden spice: From bedside to bench and back Biotechnol. Adv. 2014 32 1053 1064 10.1016/j.biotechadv.2014.04.004 24793420 7. Yin Y. Tan Y. Wei X. Li X. Chen H. Yang Z. Tang G. Yao X. Mi P. Zheng X. Recent Advances of Curcumin Derivatives in Breast Cancer Chem. Biodivers. 2022 19 e202200485 10.1002/cbdv.202200485 36069208 8. Rodrigues F.C. Anil Kumar N.V. Thakur G. Developments in the anticancer activity of structurally modified curcumin: An up-to-date review Eur. J. Med. Chem. 2019 177 76 104 10.1016/j.ejmech.2019.04.058 31129455 9. Huang M. Zhai B.T. Fan Y. Sun J. Shi Y.J. Zhang X.F. Zou J.B. Wang J.W. Guo D.Y. Targeted Drug Delivery Systems for Curcumin in Breast Cancer Therapy Int. J. Nanomed. 2023 18 4275 4311 10.2147/IJN.S410688 37534056 PMC10392909 10. Liu Y. Sun H. Makabel B. Cui Q. Li J. Su C. Ashby C.R. Jr. Chen Z. Zhang J. The targeting of non-coding RNAs by curcumin: Facts and hopes for cancer therapy (Review) Oncol. Rep. 2019 42 20 34 10.3892/or.2019.7148 31059075 PMC6549103 11. Kaya M. Abuaisha A. Suer I. Emiroglu S. Abanoz F. Palanduz S. Cefle K. Ozturk S. Turmeric Inhibits MDA-MB-231 Cancer Cell Proliferation, Altering miR-638-5p and Its Potential Targets Eur. J. Breast Health 2024 20 102 109 10.4274/ejbh.galenos.2024.2023-12-2 38571691 PMC10985573 12. Suer I. Abuaisha A. Kaya M. Abanoz F. Cefle K. Palanduz S. Ozturk S. Curcumin suppresses cell viability in breast cancer cell line by affecting the expression of miR-15a-5p Turk. J. Biochem. 2024 49 656 665 10.1515/tjb-2024-0031 13. Gao D. Cui C. Jiao Y. Zhang H. Li M. Wang J. Sheng X. Circular RNA and its potential diagnostic and therapeutic values in breast cancer Mol. Biol. Rep. 2024 51 258 10.1007/s11033-023-09172-z 38302635 14. Zhu J. Li Q. Wu Z. Xu W. Jiang R. Circular RNA-mediated miRNA sponge & RNA binding protein in biological modulation of breast cancer Noncoding RNA Res. 2024 9 262 276 10.1016/j.ncrna.2023.12.005 38282696 PMC10818160 15. Jiang C. Zeng X. Shan R. Wen W. Li J. Tan J. Li L. Wan R. The Emerging Picture of the Roles of CircRNA-CDR1as in Cancer Front. Cell Dev. Biol. 2020 8 590478 10.3389/fcell.2020.590478 33335899 PMC7736612 16. Piwecka M. Glažar P. Hernandez-Miranda L.R. Memczak S. Wolf S.A. Rybak-Wolf A. Filipchyk A. Klironomos F. Cerda Jara C.A. Fenske P. Loss of a mammalian circular RNA locus causes miRNA deregulation and affects brain function Science 2017 357 eaam8526 10.1126/science.aam8526 28798046 17. Kleaveland B. Shi C.Y. Stefano J. Bartel D.P. A Network of Noncoding Regulatory RNAs Acts in the Mammalian Brain Cell 2018 174 350 362.e317 10.1016/j.cell.2018.05.022 29887379 PMC6559361 18. Yang W. Yang X. Wang X. Gu J. Zhou D. Wang Y. Yin B. Guo J. Zhou M. Silencing CDR1as enhances the sensitivity of breast cancer cells to drug resistance by acting as a miR-7 sponge to down-regulate REGγ J. Cell Mol. Med. 2019 23 4921 4932 10.1111/jcmm.14305 31245927 PMC6652952 19. Yang W. Gu J. Wang X. Wang Y. Feng M. Zhou D. Guo J. Zhou M. Inhibition of circular RNA CDR1as increases chemosensitivity of 5-FU-resistant BC cells through up-regulating miR-7 J. Cell Mol. Med. 2019 23 3166 3177 10.1111/jcmm.14171 30884120 PMC6484300 20. Kaya M. Suer I. Aytatli A. Karatas O.F. Palanduz S. Cefle K. Ozturk S. CDR1as/miR-7-5p/IGF1R axis contributes to the suppression of cell viability in prostate cancer Turk. J. Biochem. 2024 50 89 98 10.1515/tjb-2024-0122 21. Sadoughi F. Maleki Dana P. Asemi Z. Yousefi B. Targeting microRNAs by curcumin: Implication for cancer therapy Crit. Rev. Food Sci. Nutr. 2022 62 7718 7729 10.1080/10408398.2021.1916876 33905266 22. Nirgude S. Desai S. Choudhary B. Curcumin alters distinct molecular pathways in breast cancer subtypes revealed by integrated miRNA/mRNA expression analysis Cancer Rep. 2022 5 e1596 10.1002/cnr2.1596 34981672 PMC9575497 23. Abuaisha A. Kaya M. Suer İ. Emiroğlu S. Abanoz F. Palanduz Ş. Çefle K. Öztürk Ş. Effect of curcumin on breast cancer cells through miR-145-5p and its target genes J. Istanb. Fac. Med. 2024 87 235 245 10.26650/IUITFD.1420664 24. Liu L. Fu Y. Zheng Y. Ma M. Wang C. Curcumin inhibits proteasome activity in triple-negative breast cancer cells through regulating p300/miR-142-3p/PSMB5 axis Phytomedicine 2020 78 153312 10.1016/j.phymed.2020.153312 32866906 25. Cohen J. Statistical Power Analysis for the Behavioral Sciences 2nd ed. Hillsdale N. Lawrence Erlbaum Associates, Publishers Mahwah, NJ, USA 1988 26. Yu S. Kim T. Yoo K.H. Kang K. The T47D cell line is an ideal experimental model to elucidate the progesterone-specific effects of a luminal A subtype of breast cancer Biochem. Biophys. Res. Commun. 2017 486 752 758 10.1016/j.bbrc.2017.03.114 28342866 27. Soule H.D. Maloney T.M. Wolman S.R. Peterson W.D. Jr. Brenz R. McGrath C.M. Russo J. Pauley R.J. Jones R.F. Brooks S.C. Isolation and characterization of a spontaneously immortalized human breast epithelial cell line, MCF-10 Cancer Res. 1990 50 6075 6086 1975513 28. Chatterjee B. Ghosh K. Suresh L. Kanade S.R. Curcumin ameliorates PRMT5-MEP50 arginine methyltransferase expression by decreasing the Sp1 and NF-YA transcription factors in the A549 and MCF-7 cells Mol. Cell Biochem. 2019 455 73 90 10.1007/s11010-018-3471-0 30392062 29. Liu J.L. Pan Y.Y. Chen O. Luan Y. Xue X. Zhao J.J. Liu L. Jia H.Y. Curcumin inhibits MCF-7 cells by modulating the NF-κB signaling pathway Oncol. Lett. 2017 14 5581 5584 10.3892/ol.2017.6860 29142607 PMC5666651 30. Li C. Li M. Xue Y. Downregulation of CircRNA CDR1as specifically triggered low-dose Diosbulbin-B induced gastric cancer cell death by regulating miR-7-5p/REGγ axis Biomed. Pharmacother. 2019 120 109462 10.1016/j.biopha.2019.109462 31542615 31. Li Y.Z. Wen L. Wei X. Wang Q.R. Xu L.W. Zhang H.M. Liu W.C. Inhibition of miR-7 promotes angiogenesis in human umbilical vein endothelial cells by upregulating VEGF via KLF4 Oncol. Rep. 2016 36 1569 1575 10.3892/or.2016.4912 27431648 32. Kalındemirtaş F.D. Kaya B. Sert E. Şahin O. Kuruca S.E. Ülküseven B. New oxovanadium(IV) complexes overcame drug resistance and increased in vitro cytotoxicity by an apoptotic pathway in breast cancer cells Chem. Biol. Interact. 2022 363 109997 10.1016/j.cbi.2022.109997 35654126 33. Szklarczyk D. Kirsch R. Koutrouli M. Nastou K. Mehryary F. Hachilif R. Gable A.L. Fang T. Doncheva N.T. Pyysalo S. The STRING database in 2023: Protein-protein association networks and functional enrichment analyses for any sequenced genome of interest Nucleic Acids Res. 2023 51 D638 D646 10.1093/nar/gkac1000 36370105 PMC9825434 34. An M. Akyuz M. Capik O. Yalcin C. Bertram R. Karatas E.A. Karatas O.F. Yildirim V. Gain of function mutation in K(ATP) channels and resulting upregulation of coupling conductance are partners in crime in the impairment of Ca 2+ Math. Biosci. 2024 374 109224 10.1016/j.mbs.2024.109224 38821258 35. Babin L. Piganeau M. Renouf B. Lamribet K. Thirant C. Deriano L. Mercher T. Giovannangeli C. Brunet E.C. Chromosomal Translocation Formation Is Sufficient to Produce Fusion Circular RNAs Specific to Patient Tumor Cells iScience 2018 5 19 29 10.1016/j.isci.2018.06.007 30240643 PMC6123901 36. Hua K. Jin J. Zhang H. Zhao B. Wu C. Xu H. Fang L. MicroRNA-7 inhibits proliferation, migration and invasion of thyroid papillary cancer cells via targeting CKS2 Int. J. Oncol. 2016 49 1531 1540 10.3892/ijo.2016.3660 27633373 37. Li M. Shi M. Hu C. Chen B. Li S. MALAT1 modulated FOXP3 ubiquitination then affected GINS1 transcription and drived NSCLC proliferation Oncogene 2021 40 3870 3884 10.1038/s41388-021-01816-3 33972684 38. Brase J.C. Schmidt M. Fischbach T. Sültmann H. Bojar H. Koelbl H. Hellwig B. Rahnenführer J. Hengstler J.G. Gehrmann M.C. ERBB2 and TOP2A in breast cancer: A comprehensive analysis of gene amplification, RNA levels, and protein expression and their influence on prognosis and prediction Clin. Cancer Res. 2010 16 2391 2401 10.1158/1078-0432.CCR-09-2471 20371687 39. Liu Y.J. Zeng S.H. Hu Y.D. Zhang Y.H. Li J.P. Overexpression of NREP Promotes Migration and Invasion in Gastric Cancer Through Facilitating Epithelial-Mesenchymal Transition Front. Cell Dev. Biol. 2021 9 746194 10.3389/fcell.2021.746194 34746143 PMC8565479 40. Shu L. Peng Y. Zhong L. Feng X. Qiao L. Yi Y. CircZNF124 regulates cell proliferation, leucine uptake, migration and invasion by miR-199b-5p/SLC7A5 pathway in endometrial cancer Immun. Inflamm. Dis. 2021 9 1291 1305 10.1002/iid3.477 34145797 PMC8589382 41. Ulaşli M. Gürses S. Cengiz B. Öztuzcu S. Balakan O. Süner A. Gögebakan B. İğci M. Balik A. Arslan A. Expression of PARP1 Gene in Breast Cancer Patients Uluslararası Hematol.-Onkol. Derg. 2013 23 213 218 10.4999/uhod.12042 42. Qiu G. Sun W. Zou Y. Cai Z. Wang P. Lin X. Huang J. Jiang L. Ding X. Hu G. RNA interference against TMEM97 inhibits cell proliferation, migration, and invasion in glioma cells Tumour Biol. 2015 36 8231 8238 10.1007/s13277-015-3552-6 26002575 43. Jia C.Y. Xiang W. Liu J.B. Jiang G.X. Sun F. Wu J.J. Yang X.L. Xin R. Shi Y. Zhang D.D. MiR-9-1 Suppresses Cell Proliferation and Promotes Apoptosis by Targeting UHRF1 in Lung Cancer Technol. Cancer Res. Treat. 2021 20 15330338211041191 10.1177/15330338211041191 34520284 PMC8445543 44. Yao Q. Yu Y. Wang Z. Zhang M. Ma J. Wu Y. Zheng Q. Li J. CANT1 serves as a potential prognostic factor for lung adenocarcinoma and promotes cell proliferation and invasion in vitro BMC Cancer 2022 22 117 10.1186/s12885-022-09175-2 35090419 PMC8796366 45. Liang W. Gao R. Yang M. Wang X. Cheng K. Shi X. He C. Li Y. Wu Y. Shi L. MARCKSL1 promotes the proliferation, migration and invasion of lung adenocarcinoma cells Oncol. Lett. 2020 19 2272 2280 10.3892/ol.2020.11313 32194726 PMC7039154 46. Flint A.L. Hansen D.W. Brown L.D. Stewart L.E. Ortiz E. Panda S.S. Modified Curcumins as Potential Drug Candidates for Breast Cancer: An Overview Molecules 2022 27 8891 10.3390/molecules27248891 36558022 PMC9784715 47. Pan-On S. Dilokthornsakul P. Tiyaboonchai W. Trends in advanced oral drug delivery system for curcumin: A systematic review J. Control Release 2022 348 335 345 10.1016/j.jconrel.2022.05.048 35654170 48. Mayo B. Penroz S. Torres K. Simón L. Curcumin Administration Routes in Breast Cancer Treatment Int. J. Mol. Sci. 2024 25 1492 10.3390/ijms252111492 39519045 PMC11546575 49. Belcaro G. Hosoi M. Pellegrini L. Appendino G. Ippolito E. Ricci A. Ledda A. Dugall M. Cesarone M.R. Maione C. A controlled study of a lecithinized delivery system of curcumin (Meriva ® Phytother. Res. 2014 28 444 450 10.1002/ptr.5014 23775598 50. Kumar A. Hegde M. Parama D. Kunnumakkara A.B. Curcumin: The Golden Nutraceutical on the Road to Cancer Prevention and Therapeutics. A Clinical Perspective Crit. Rev. Oncog. 2022 27 33 63 10.1615/CritRevOncog.2023045587 37183937 51. Giordano A. Tommonaro G. Curcumin and Cancer Nutrients 2019 11 2376 10.3390/nu11102376 31590362 PMC6835707 52. Saghatelyan T. Tananyan A. Janoyan N. Tadevosyan A. Petrosyan H. Hovhannisyan A. Hayrapetyan L. Arustamyan M. Arnhold J. Rotmann A.R. Efficacy and safety of curcumin in combination with paclitaxel in patients with advanced, metastatic breast cancer: A comparative, randomized, double-blind, placebo-controlled clinical trial Phytomedicine 2020 70 153218 10.1016/j.phymed.2020.153218 32335356 53. Szczepanek J. Skorupa M. Jarkiewicz-Tretyn J. Cybulski C. Tretyn A. Harnessing Epigenetics for Breast Cancer Therapy: The Role of DNA Methylation, Histone Modifications, and MicroRNA Int. J. Mol. Sci. 2023 24 7235 10.3390/ijms24087235 37108398 PMC10138995 54. Nepali K. Liou J.P. Recent developments in epigenetic cancer therapeutics: Clinical advancement and emerging trends J. Biomed. Sci. 2021 28 27 10.1186/s12929-021-00721-x 33840388 PMC8040241 55. Kaya M. Abuaisha A. Suer I. Emiroglu S. Önder S. Onay Ucar E. Yenerel M.N. Palanduz S. Cefle K. Ozturk S. Let-7b-5p sensitizes breast cancer cells to doxorubicin through Aurora Kinase B PLoS ONE 2025 20 e0307420 10.1371/journal.pone.0307420 39787178 PMC11717257 56. Ghazimoradi M.H. Babashah S. The role of CircRNA/miRNA/mRNA axis in breast cancer drug resistance Front. Oncol. 2022 12 966083 10.3389/fonc.2022.966083 36132137 PMC9484461 57. Erdogan C. Suer I. Kaya M. Ozturk S. Aydin N. Kurt Z. Bioinformatics analysis of the potentially functional circRNA-miRNA-mRNA network in breast cancer PLoS ONE 2024 19 e0301995 10.1371/journal.pone.0301995 38635539 PMC11025867 58. Sun S. Fang H. Curcumin inhibits ovarian cancer progression by regulating circ-PLEKHM3/miR-320a/SMG1 axis J. Ovarian Res. 2021 14 158 10.1186/s13048-021-00916-8 34784955 PMC8594156 59. Wu Z. Zhao X. Sun Y. Yu H. Curcumin suppresses colorectal cancer development with epithelial-mesenchymal transition via modulating circular RNA HN1/miR-302a-3p/PIK3R3 axis J. Physiol. Pharmacol. 2022 73 219 231 10.26402/jpp.2022.2.05 35988930 60. Rahmati Y. Asemani Y. Aghamiri S. Ezzatifar F. Najafi S. CiRS-7/CDR1as; An oncogenic circular RNA as a potential cancer biomarker Pathol. Res. Pract. 2021 227 153639 10.1016/j.prp.2021.153639 34649055 61. Yang J. Zhu D. Liu S. Shao M. Liu Y. Li A. Lv Y. Huang M. Lou D. Fan Q. Curcumin enhances radiosensitization of nasopharyngeal carcinoma by regulating circRNA network Mol. Carcinog. 2020 59 202 214 10.1002/mc.23143 31793078 62. Xu H. Nie B. Liu L. Zhang C. Zhang Z. Xu M. Mei Y. Curcumin Prevents Brain Damage and Cognitive Dysfunction During Ischemic-reperfusion Through the Regulation of miR-7-5p Curr. Neurovasc Res. 2019 16 441 454 10.2174/1567202616666191029113633 31660818 63. Urbanowicz-Kachnowicz I. Baghdassarian N. Nakache C. Gracia D. Mekki Y. Bryon P.A. Ffrench M. ckshs expression is linked to cell proliferation in normal and malignant human lymphoid cells Int. J. Cancer 1999 82 98 104 10.1002/(SICI)1097-0215(19990702)82:1&#x0003c;98::AID-IJC17&#x0003e;3.0.CO;2-A 10360827 64. You H. Lin H. Zhang Z. CKS2 in human cancers: Clinical roles and current perspectives (Review) Mol. Clin. Oncol. 2015 3 459 463 10.3892/mco.2015.501 26137251 PMC4471627 65. Wang J. Xu L. Liu Y. Chen J. Jiang H. Yang S. Tan H. Expression of cyclin kinase subunit 2 in human breast cancer and its prognostic significance Int. J. Clin. Exp. Pathol. 2014 7 8593 8601 25674223 PMC4313994 66. Huang N. Wu Z. Hong H. Wang X. Yang F. Li H. Overexpression of CKS2 is associated with a poor prognosis and promotes cell proliferation and invasion in breast cancer Mol. Med. Rep. 2019 19 4761 4769 10.3892/mmr.2019.10134 30957190 PMC6522797 67. Si L. Zhang L. Xing S. Fang P. Tian X. Liu X. Xv X. Curcumin as a therapeutic agent in cancer therapy: Focusing on its modulatory effects on circular RNAs Phytother. Res. 2023 37 3121 3134 10.1002/ptr.7863 37200228 68. Pdq Integrative A. Complementary Therapies Editorial B. Curcumin (Curcuma, Turmeric) and Cancer (PDQ ® PDQ Cancer Information Summaries National Cancer Institute (US) Bethesda, MD, USA 2002 33651529 69. Tohidi M. Allahyari A. Ataei Azimi S. Alimi H. Elyasi S. Qoorchi Moheb Seraj F. Mehrad-Majd H. The protective effect of nano curcumin supplementation on doxorubicin induced cardiotoxicity in breast cancer patients; a randomized, double-blind clinical trial J. Oncol. Pharm. Pract. 2024 10781552241277958 10.1177/10781552241277958 39223927 70. Heydari B. Sheikhalishahi S. Hoseinzade F. Shabani M. Ramezani V. Saghafi F. Topical Curcumin for Prevention of Radiation-Induced Dermatitis: A Pilot Double-Blind, Placebo-Controlled Trial Cancer Investig. 2025 43 173 182 10.1080/07357907.2025.2479542 40145664 71. Hemati S. Mehrabinejad F. Elhaie M. Najafizade N. Curcumin Supplementation as a Preventive Strategy Against Tamoxifen-Induced Nonalcoholic Fatty Liver Disease in ER+ Breast Cancer Patients: A Triple-Blind Randomized Placebo-Controlled Trial J. Diet. Suppl. 2025 22 274 283 10.1080/19390211.2025.2465412 39948699 Figure 1 Cell viability and cell proliferation state. Curcumin treatment reduced cell viability and proliferation in a dose-dependent manner in ( A B C p p p Figure 2 Effects of curcumin treatment on cell migration. ( A B C p p Figure 3 Relative expression level of hsa_circ_0001946 and miR-7-5p after curcumin treatment. ( A B C D p Figure 4 ( A B C p p p Figure 5 Circ_0001946 knockdown inhibited viability and migration in MCF-7 and T47D cells. ( A B C D p p p Figure 6 Effects of circ_0001946 knockdown and miR-7-5p overexpression on apoptosis and miR-7-5p expression. ( A B C p Figure 7 MiR-7-5p overexpression reduced the viability and migration of MCF-7 and T47D cells. ( A B C D p p p Figure 8 Bioinformatic analysis results of miR-7-5p target genes in BC. ( A CKS2, TOP2A, GINS1, NREP, SLC7A5, PARP1, TMEM97, UHRF1, CANT1 MARCKSL1 B p Figure 9 Relative expression levels according to qPCR and Western blot analysis results. ( A B C D p p p Figure 10 Western blot analysis showing reduced CKS2 protein expression in MCF-7 and T47D cells after curcumin treatment. ( A B Figure 11 Relative expression levels of hsa_circ_0001946, miR-7-5p and CKS2 in BC patient tumor tissue samples compared to adjacent normal tissue samples. ( A B C CKS2 p p medicina-61-01600-t001_Table 1 Table 1 Forward and reverse primer sequences of the studied genes. Gene Primer Sequences Reference   CDR1as F 5′-ACGTCTCCAGTGTGCTGA-3′ [ 19 R 5′-CTTGACACAGGTGCCATC-3′   GAPDH F 5′-GCCATCAATGACCCCTTCAT-3′ [ 35 R 5′-TGACAAGCTTCCCGTTCTCA-3′   CKS2 F 5′-TTCGACGAACACTACGAGTACC-3′ [ 36 R 5′-GGACACCAAGTCTCCTCCAC-3′   GINS1 F 5′-AGGTCACTGGGAGGAGATGA-3′ [ 37 R 5′-TCGAGGTAAAAAGTGCTGGCT-3′   TOP2A F 5′-CATTGAAGACGCTTCGTTATGG-3′ [ 38 R 5′-CCAGTTGTGATGGATAAAATTAATCAG-3′   NREP F 5′-TTGAGCGAATGCTACCAGAG-3′ [ 39 R 5′-AGGCGAGGCTACGGAAAG-3′   SLC7A5 F 5′-TAGGAGACAGAGCCAAGCAC-3′ [ 40 R 5′-CACGGGAACAACAGAAACAA-3′   PARP1 F 5′-CCACACACAATGCGTATGACT-3′ [ 41 R 5′-CCACAGCAATCTTCGGTTATGA-3′   TMEM97 F 5′-CTCCAAAGCCAGTGGTTTC-3′ [ 42 R 5′-GCCAGTGGTTGTTTCCTTC-3′   UHRF1 F 5′-TGTCAAGGGTGGCAAGAAT-3′ [ 43 R 5′-GCCAGGCTCATCATCGTC-3′   CANT1 F 5′-GCTTCTCGTCCTTCAAGTTCATC-3′ [ 44 R 5′-ACGCTTCCGATCTTGGTCTC-3′   MARCKSL1 F 5′-CAGGCTACAGAGCCATCCACTC-3′ [ 45 R 5′-GCAGCTTAGAGATCACCCACCT-3′ F: forward primer; R: reverse primer. medicina-61-01600-t002_Table 2 Table 2 Demographic characteristics of patients. Characteristics Number (%)  All 65 (100.0)  Age, mean ± SD 56.45 ± 11.89  Age group  ≤50 22 (33.8) >50 43 (66.2)  Menopausal status  Premenopausal 20 (30.8) Postmenopausal 45 (69.2)  Family history of BC  Yes 16 (24.6) No 49 (75.4)  Smoking  Yes 13 (20.0) No 52 (80.0)  Alcohol consumption  Yes 3 (4.6) No 62 (95.4) SD: Standard deviation. medicina-61-01600-t003_Table 3 Table 3 Clinicopathological characteristics of patients. Characteristics Category Number (%)  Molecular subtype Luminal A 30 (46.2) Luminal B 35 (53.8)  Histological Type Invasive ductal carcinoma 47 (72.3) Invasive lobular carcinoma 9 (13.8) Mixed 5 (7.7) Other 4 (6.2)  Pathological tumor stage I 17 (26.2) II 46 (70.8) III 2 (3.1)  Pathological lymph node involvement Negative 38 (58.5) Positive 27 (41.5)  Histological tumor grade I 4 (6.2) II 33 (50.8) III 28 (43.1)  Tumor focal status Unifocal 52 (80.0) Multifocal 13 (20.0)  Lympho-vascular invasion Yes 39 (60.0) No 26 (40.0)  Estrogen receptor Negative 0 (0.0) Positive 65 (100.0)  Progesterone receptor Negative 6 (9.2) Positive 59 (90.8)  HER2 Negative 59 (90.8) Positive 6 (9.2)  Ki-67 expression <20% 27 (41.5) ≥20% 38 (58.5)  Surgical treatment-Breast Breast-conserving surgery 53 (81.5) Mastectomy 12 (18.5)  Surgical treatment-Axilla Sentinel lymph node biopsy 57 (87.7) Axillary lymph node dissection 8 (12.3) ",
  "metadata": {
    "Title of this paper": "Curcumin Supplementation as a Preventive Strategy Against Tamoxifen-Induced Nonalcoholic Fatty Liver Disease in ER+ Breast Cancer Patients: A Triple-Blind Randomized Placebo-Controlled Trial",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471725/"
  }
}