{
  "title": "Paper_801",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472914 PMC12472914.1 12472914 12472914 41011218 10.3390/ph18091349 pharmaceuticals-18-01349 1 Article Tribulus terrestris AlAbdullatif Ammar Methodology Investigation 1 https://orcid.org/0000-0002-2271-8262 Almofty Sarah Methodology Formal analysis Investigation 2 https://orcid.org/0000-0002-5019-0151 Tanimu Gazali Software Validation Investigation 3 Dafalla Hatim Methodology Software Formal analysis 4 https://orcid.org/0000-0002-6527-3961 Alahmari Fatimah Methodology Investigation 5 https://orcid.org/0000-0002-8698-2820 Jermy B. Rabindran Conceptualization Methodology Investigation Writing – original draft Funding acquisition 5 * Tsiourvas Dimitris Academic Editor 1 2240500205@iau.edu.sa 2 saalmofty@iau.edu.sa 3 gazali.tanimu@kfupm.edu.sa 4 dmhatim@kfupm.edu.sa 5 fsalahmari@iau.edu.sa * rjermy@iau.edu.sa jrabindran@gmail.com 08 9 2025 9 2025 18 9 497460 1349 27 7 2025 01 9 2025 01 9 2025 08 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Tribulus terrestris Results: 2 Conclusions: halloysite clay green synthesis Zn Ag NPs cervical cancer targeted drug delivery Research, Development, and Innovation Authority (RDIA), Kingdom of Saudi Arabia, Reactivating & Rebuilding of Existing Labs Initiative 12968-iau-2023-iau-R-3-1-HW- The author BRJ would like to acknowledge that the research grant was funded by the Research, Development, and Innovation Authority (RDIA), Kingdom of Saudi Arabia, Reactivating & Rebuilding of Existing Labs Initiative with grant number (12968-iau-2023-iau-R-3-1-HW-). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cervical cancer remains one of the leading causes of cancer-related morbidity and mortality among women globally, with more than 600,000 new cases and over 340,000 deaths reported annually. The primary etiological factor is persistent infection with high-risk human papillomavirus (HPV) types, especially HPV-16 and HPV-18. While significant reductions in incidence have been achieved in high-income countries through widespread HPV vaccination and routine screening, low- and middle-income countries (LMICs) continue to experience a high disease burden due to inadequate access to these preventive strategies. This global health disparity underscores the urgent need for effective, affordable, and innovative therapeutic interventions [ 1 2 3 4 5 Cisplatin is the cornerstone of chemoradiation therapy due to its radiosensitizing properties. Platinum-based chemotherapeutics primarily act on DNA as their molecular target. At the cellular level, they bind to the N7 sites of guanine and adenosine in double-stranded DNA, resulting in intra- and inter-strand cross-links that distort DNA helix and interfere with genetic processes. However, the binding of such Pt complex is unspecific and can simultaneously destroy normal and abnormal cancer cells [ 6 6 7 These resistance pathways, combined with the systemic toxicities of conventional treatments, necessitate the exploration of novel therapeutic approaches. In this context, nanotechnology has emerged as a promising platform for targeted drug delivery and enhanced therapeutic response. Green synthesis of nanoparticles, utilizing plant extracts and biological agents, offers an eco-friendly and sustainable alternative to traditional synthesis methods. This approach eliminates the need for hazardous chemicals and high-energy processes while yielding biocompatible and functionally stable nanostructures [ 8 Silver and zinc oxide nanoparticles, in particular, have demonstrated significant potential in biomedical applications due to their cytotoxic, antimicrobial, and drug delivery properties. Zinc oxide nanoparticles primarily contribute through ROS generation, inducing oxidative stress that enhances apoptosis in cervical cancer cells. Silver nanoparticles provide potent antimicrobial activity, reducing infection risk and improving the overall biocompatibility of the nanocarrier. Silver nanoparticles exhibit strong anticancer effects by activating the P13K/Akt signaling pathways; especially in cervical cancer, the proliferation is inhibited by inducing DNA damage and cell death through caspase-3 activation [ 9 10 11 12 Tribulus terrestris 13 14 In addition to metallic nanoparticles, clay-based nanocarriers have gained interest in drug delivery. Hall, composed of a silica-rich exterior and an alumina-rich interior, offers a unique tubular morphology ideal for dual-surface modification, drug loading (3–3.85%), and drug encapsulation (75–96%). These naturally occurring nanomaterials exhibit excellent biocompatibility, mechanical stability, and sustained-release capabilities, making them valuable for therapeutic delivery systems [ 15 2. Results and Discussion 2.1. Adsorption of Cisplatin and Carboplatin onto Halloysite 2.1.1. Effect of Different Adsorption Time (0.15–12 h) The halloysite unique dual-surface chemistry can be utilized to study the adsorption capability for sustained Cp or Cbpt drug delivery. Therefore, the effect of Cbpt and Cp adsorption was investigated over halloysite at different adsorption times (0.15–12 h) ( Figure 1 Figure 1 16 2.1.2. Adsorption Capacity of Drug at Different Adsorption Time (0.15–12 h) Figure 1 17 2.1.3. Adsorption Capacity of Drug at Different Drug to Nanocarrier Ratios (10–50) The adsorption behavior of cisplatin onto the Hall nanocarrier was investigated by varying the drug-to-nanocarrier ratios (10, 20, 30, 40, and 50) over an incubation period of 0.15–24 h ( Figure 1 17 Figure 1 Figure 1 18 2.1.4. Adsorption Capacity of Drug at Different pH Conditions The adsorption capacity of Cbpt and Cp on Hall was evaluated under various pH conditions (pH 5, 6.6, 7.4, 9, and 10.5), using a constant drug-to-nanocarrier ratio of 50 ( Figure 1 19 2.2. Cisplatin and Carboplatin Drug Release over GZn-/GAg-Impregnated Hall Using Dialysis Membrane Technique Based on the Cp and Cbpt adsorption study, the drug-to-nanocarrier ratio was fixed at 50.2 wt% GZn and GAg were impregnated over Hall. The percentage cumulative release profile of Cp and Cbpt from GZn-Hall and GAg-Hall nanocarriers was investigated under two physiologically relevant pH conditions (pH 6.6 and 7.4), simulating the tumor microenvironment and normal physiological pH, respectively ( Figure 2 Figure 2 20 Figure 2 21 Cp and Cbpt encapsulated into Zn-modified halloysite nanotubes (GZn-Hall) at various pH conditions (pH 5.0, 6.6, 7.4, 9.0, and 10.5) was subjected to PEGylation, and their release behaviors were evaluated under pH 6.6 ( Figure 2 22 Figure 2 23 Cbpt was encapsulated onto Zn-modified halloysite nanotubes (GZn-Hall) at various pH levels (pH 5.0, 6.6, 7.4, 9.0, and 10.5), followed by PEGylation to enhance the stability and control the release of the drug at pH 6.6 ( Figure 2 24 2.3. Kinetics of Cisplatin and Carboplatin Drug Release Using the Korsmeyer–Peppas Model The cisplatin and carboplatin release profiles at different pH and formulations were examined using the Korsmeyer–Peppas model, expressed using the equation: R % = k t n 2 Table 1 The kinetic profile of Cp/GZn-Hall/PEG formulations prepared at different pH values (5, 6.6, 7.4, 9.0, and 10.5) was studied for cisplatin and carboplatin release. In the case of cisplatin formulation, the rate of Cp release, which is determined by the release constant, is inversely dependent on the pH values; however, at pH = 9.0, the rate of drug release showed a different trend, being higher than at pH = 7.4. On the other hand, the release exponent (n) signified a non-Fickian mechanism (0.45 < 0.49, 0.59, 0.58, 0.68 < 0.89) for pH values of 6.6, 7.4, 9.0, and 10.5; at pH of 5.0, the drug release followed the Fickian (0.39 < 0.45) diffusion mechanism. The kinetic profile of Cbpt/GZn-Hall/PEG prepared at different pH values (5, 6.6, 7.4, 9.0, and 10.5) was studied. For the carboplatin-based formulation at different pH values, the rate of drug release showed an irregular pattern with increasing pH, with the highest rate of drug release at a pH of 9.0. Interestingly, the release exponent for all the drugs formulation showed a Fickian (0.24, 0.31, 0.29, 0.15, 0.14 < 0.45) diffusion mechanism. The kinetic profiles of green Zn and Ag formulations—Cbpt/GZn-Hall/PEG, Cp/GZn-Hall/PEG, Cbpt/GAg-Hall/PEG, and Cp/GAg-Hall/PEG—were studied. Interestingly, for the Cbpt and Cp formulations at the tumor acidic pH of 6.6, the rate of drug release depends on the formulation, with Cp/GZn-Hall/PEG and Cp/GAg-Hall/PEG showing the highest rates of drug release compared to Cbpt/GZn-Hall/PEG and Cbpt/GAg-Hall/PEG, evident from their highest drug release rate constant. The drug release exponent (n) for all these drug formulations is <0.45, confirming that the drug release mechanism follows the Fickian diffusion mechanism. Additionally, the regression coefficient for all the drugs formulation is >0.85, which confirms that their drug release mechanism is adequately represented by the Korsmeyer–Peppas model. 2.4. Cytotoxicity Study of Nanoformulations Against HeLa and HFF-1 Cells The cytotoxic effect of GZn, GAg, GPtNPs, and GPt/GZn-Hall was studied against HeLa and HFF-1 cells at 24 h and 48 h using different concentrations in the range of 15,625–1000 µg/mL ( Figure 3 25 50 50 Table 2 26 The cytotoxic activity of the Zn-impregnated Hall nanocarrier, along with Cbpt and Cp functionalization, was studied against HeLa and HFF-1 cells ( Figure 4 Figure 4 Figure 4 27 50 28 29 50 Figure 4 27 30 The GAg-impregnated Hall (GAg-Hall) nanocarrier, as well as the Cp- and Cbpt-functionalized GAg-Hall-based formulations in HeLa and HFF-1 cells, are shown in Figure 5 p p p Figure 5 Catharanthus roseus 31 31 In HeLa cells at 48 h ( Figure 5 p Figure 3 Figure 5 32 Figure 5 32 25 33 34 2.5. X-Ray Diffraction, Diffuse Reflectance UV-Vis Spectroscopy, and Nitrogen Adsorption Desorption Isotherm In order to understand the adsorption/release behavior, the structural composition, and the crystallographic features of cisplatin-, carboplatin-, ZnO-, and AgNP-impregnated halloysites were investigated using X-ray diffraction (XRD) analysis ( Figure 6 35 Figure 6 Figure 6 Figure 6 36 Figure 6 37 38 Figure 6 39 Diffuse reflectance spectroscopy (DRS) in the UV-visible region was employed to investigate the chemical coordination state associated with GZn and GAg nanoparticles supported on Hall, as well as to understand their interaction with Cbpt and Cp ( Figure 6 40 Figure 6 Figure 6 41 + n δ+ 0 42 Figure 6 Figure 6 43 Figures S1 and S2 Figure S1 Figure S2 The textural properties (surface area and pore size distributions) of Hall, GZn-Hall, and GAg-Hall were characterized using nitrogen adsorption–desorption analysis ( Figure 6 2 3 Table 3 24 2 3 2 3 44 Zeta potential is a key indicator of the surface charge and stability of colloidal dispersions. High zeta potential (positive or negative) suggests strong repulsion, reducing aggregation and promoting colloidal stability. For our study, zetasizer was used to measure surface charge and stability of formulations to understand the in vitro anticancer activities. Figure 6 Tribulus terrestris 45 - 2 + 46 2.6. Scanning Electron Microscopy Coupled with Energy-Dispersive X-Ray Spectroscopy (SEM-EDS) Analysis To investigate the nature of GZn and GAg dispersion over Hall, the morphological characteristics, and the elemental composition of the nanocomposite, SEM-EDS was employed. The analysis was conducted on microscopic surface regions of GZn-Hall ( Figure 7 Figure 7 Tribulus terrestris Supplementary file (Figure S3) Tribulus terrestris Figure S4 Figure 7 Figure 7 Figure 7 Figure 7 Figure 7 47 Figure 7 Figure 7 Figure 7 Figure 7 2.7. High-Resolution Transmission Electron Microscope Analysis (HRTEM) HRTEM analysis provides clear insight into the morphology and particle size of the GZn and GAg metal nanoparticles and their interaction with halloysite nanotubes. Figure 8 Tribulus terrestris Figure 8 48 The HRTEM images ( Figure 8 Tribulus terrestris Figure 8 49 Figure 8 + n δ+ 0 Figure S5a Figure S5b 49 3. Material and Methods Halloysite nanoclay (kaolin clay) with a chemical composition of Al 2 2 5 4 2 3.1. Drug Adsorption and Optimization Study 3.1.1. Drug Adsorption at Different Time and Drug/Nanocarrier Ratios (mg/g) For the adsorption experiments, 50 mL conical flasks were used, each containing 25 mL of normal saline solution. Subsequently, 15 mg of Cp or Cbpt was introduced into the solution and stirred for 20 min to ensure complete dissolution. Following this, 0.3 g of the nanocarrier was added, maintaining a drug-to-nanocarrier ratio of 50 (mg/g), with the initial drug concentration fixed at 0.6 mg/mL. The adsorption studies were carried out using a shaker (Yellow Line OS 5 Basic, Merck, Darmstadt, Germany) operated at 160 rpm. Samples were collected at predetermined time intervals ranging from 0.15 to 12 h. After each interval, the mixtures were centrifuged, and the supernatant was collected. The residual drug concentration was quantified by UV-visible spectroscopy. For adsorption study at different drug/nanocarrier ratios (10, 20, 30, and 40), the drug content was varied as 3, 6, 9 and 12 mg, for different drug/nanocarrier ratios of 10, 20, 30 and 40 mg/g. 3.1.2. Drug Adsorption at Different pH Adsorption studies were conducted in 50 mL conical flasks, each containing 25 mL of normal saline solution. Cp or Cbpt (15 mg) was added under varying pH conditions (5.0, 6.6, 7.4, 9.0, and 10.5) and stirred for 20 min to ensure complete dissolution. Subsequently, 0.3 g of the nanocarrier was introduced, maintaining a drug-to-nanocarrier ratio of 50 (mg/g) and an initial drug concentration of 0.6 mg/mL. The mixtures were incubated in a shaker (Yellow Line OS 5 Basic) at 160 rpm for 6 h. Samples were collected at fixed time (6 h), centrifuged at 4000 rpm for 15 min, and the supernatant was analyzed for residual drug content using UV-visible spectroscopy. 3.2. Preparation of Tribulus Terrestris Plant Extract for Green Synthesis of Zn and Ag Nanoparticles Dried Tribulus terrestris 3.3. Synthesis of Zinc Nanoparticles (GZnNPs) A 25 mM solution of zinc acetate dihydrate (Zn(CH 3 2 2 Tribulus terrestris 2+ 3.4. Synthesis of Silver Nanoparticles (GAgNPs) The same green synthesis protocol was applied to silver nanoparticles. A 25 mM solution of silver nitrate (AgNO 3 Tribulus terrestris 3.5. Preparation of GZn- and GAg-Impregnated Halloysite Clay Nanocarrier (GZn-Hall and GAg-Hall) Hall was used as the support material for loading 2 wt% green-synthesized zinc and silver nanoparticles. To achieve a 2 wt% nitrate metal loading, 0.067 g of zinc acetate dihydrate or 0.0315 g of silver nitrate was added to 1 g of halloysite clay. For bulk preparation, 0.1826 g of green AgNPs was dispersed in 150 mL of deionized water along with 5 g of halloysite clay. The mixture was stirred overnight at room temperature to ensure uniform impregnation. The resulting slurry was dried using rotary evaporation and stored as GZn-Hall or GAg-Hall nanocarriers. X-ray diffraction (XRD) and diffuse reflectance spectroscopy were conducted to confirm metal incorporation into the clay matrix. 3.6. Cisplatin and Carboplatin Functionalization into GZn/GAg Impregnated Hall The cytotoxic agents cisplatin (cis-diamminedichloroplatinum(II)) and carboplatin (cis-diammine(cyclobutane-1,1-dicarboxylato)platinum(II)) were separately impregnated onto the Zn/Hall and Ag/Hall nanocarriers. For drug functionalization, GZn-Hall or GAg/Hall was treated with cisplatin or carboplatin in 10 mL of normal saline (NS). The drug to nanocarrier ratio was maintained at 50 (mg/g). The mixture was stirred for 20 min, then aged overnight in an ice bath with magnetic stirring. The next day, the suspension was filtered through a vacuum filter using Whatman No. 1 paper. To ensure washing, 5 mL of fresh NSS was used to wash the sides residue. The filtrate solution was analyzed using UV-visible spectroscopic analysis, and the retained powder was left to dry at room temperature for 48–72 h. The encapsulation efficiency of Carbpt/Hall and Cp/Hall was 75% and 97%, respectively, while the loading capacity was of 3.75% and 4.87%, respectively. The following drug-loaded nanocarriers were obtained and labeled accordingly: Cbpt/GZn-Hall: Green zinc oxide-impregnated halloysite functionalized with carboplatin. Cp/GZn-Hall: Green zinc oxide-impregnated halloysite functionalized with cisplatin. Cbpt/GAg-Hall: Green silver-impregnated halloysite functionalized with carboplatin. Cp/GAg-Hall: Green silver-impregnated halloysite functionalized with cisplatin. GPt/GZn-Hall: Green platinum nanoparticles loaded on Zn-impregnated halloysite. The dried samples were then reserved for further PEGylation and characterization studies. 3.7. PEGylation of Drug-Loaded Nanocarriers and Final Formulation To enhance the colloidal stability, bioavailability, and prolonged systemic circulation of the nanocarriers, polyethylene glycol (PEG-400) was used to PEGylate the drug-loaded nanocarriers. About 3 mL of deionized water was mixed with 20 μL of PEG-400 and stirred for 10 min. Then, 120 mg of each drug-loaded nanocarrier was added and allowed to mix overnight. The suspensions were centrifuged at 8000 rpm for 10 min, and the supernatant was analyzed by UV spectroscopy. The pellet was dried and stored in 4 °C. The following drug-loaded nanocarriers were obtained as shown in Figure 9 Cbpt/GZn-Hall/PEG: PEGylation of Cbpt/GZn-Hall formulation. Cp/GZn-Hall/PEG: PEGylation of Cp/GZn-Hall formulation. Cbpt/GAg-Hall/PEG: PEGylation of Cbpt/GAg-Hall formulation. Cp/GAg-Hall/PEG: PEGylation of Cp/GAg-Hall formulation. 3.8. Drug Release Study Using Dialysis Membrane Technique The in vitro release profile of cisplatin and carboplatin functionalized Zn/Hall and Ag/Hall nanocarriers were evaluated by the dialysis membrane diffusion technique using phosphate-buffered saline (PBS) at two different pH levels: pH 6.6, mimicking the tumor micro acidic environment, and pH 7.4, simulating normal physiological pH. From each drug-loaded nanocarrier (Cp/GZn-Hall, Cbpt/GZn-Hall, Cp/GAg-Hall, Cbpt/GAg-Hall), 15 mg of formulation was accurately weighed and suspended in 1.5 mL of PBS (pH 6.6 and 7.4) separately. The suspension was loaded into a pre-treated nitrocellulose dialysis membrane and sealed. Each membrane bag was immersed in a 50 mL glass beaker containing 23.5 mL of PBS, completing a total volume of 25 mL. The beakers were placed on magnetic stirrers at constant speed and maintained at 37 °C, the drug release was studied for 72 h. At specified intervals—15 min–3 days—5 mL aliquots were withdrawn from the release media and replaced with an equal volume of fresh PBS to maintain sink conditions. The release study was duplicated, and each sample was immediately analyzed by UV-visible spectroscopy. UV-Visible Spectroscopy for Drug Quantification A double-beam UV-vis spectrophotometer was used to quantify the amount of released drug in each sample. Calibration was performed using drug-free PBS as a blank. Cisplatin was detected at 206 nm, while carboplatin was detected at 233 nm. The data were acquired in spectral and quantitative modes. The quantitative mode used pre-calibrated standard curves to determine drug concentrations. 3.9. Characterization Techniques X-ray diffraction (XRD) was utilized to analyze the phase composition and crystallinity of the nanoparticles and clay matrix (Miniflex 600, Rigaku, Tokyo, Japan). Nitrogen adsorption isotherm analysis was conducted to examine the textural characteristics, including the surface area, pore size, and porosity of the formulated nanocomposite (ASAP-2020 plus, Micromeritics, Norcross, GA, USA). Zeta potential measurements provided insights into the surface charge and colloidal stability of the nanoformulations (Zetasizer, Malvern Panalytical, Malvern, UK). Diffuse reflectance UV-visible spectroscopy (DRS-UV-vis) was used to analyze the chemical state of the loaded metal nanoparticles (JASCO, V-750, Tokyo, Japan). The morphology and chemical constituent were analyzed using scanning electron microscopy coupled with energy-dispersive X-ray spectroscopy (SEM-EDX, (JSM-6610LV, JEOL, Tokyo, Japan) and high-resolution transmission electron microscopy (HRTEM, FEI, Morgagni 268 at 80 kV, Hillsboro, OR, USA); these techniques were utilized to examine the morphology, structural integrity, and elemental composition of the synthesized nanomaterials. X-ray photoelectron spectroscopy (XPS) analysis was carried out using a Kratos Axis Ultra system equipped with a monochromatic Al Kα X-ray source. The measurements were performed under ultra-high vacuum conditions (~10 −9 3.10. Cell Culture and Treatment HeLa cells (ATCC (ATCC ® ® 2 4 4 3.11. Cell Cytotoxicity by MTT Assay The cytotoxicity of the synthesized nanocarrier formulations was assessed with the MTT [3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide] assay. This colori-metric test evaluates mitochondrial reduction of MTT to formazan as a marker of viable, metabolically active cells. After 24 or 48 h of treatment, 20 µL of MTT solution (5 mg/mL in PBS) was added to each well. Plates were incubated for 4 h at 37 °C in the dark. Supernatant was carefully aspirated, and 100 µL of DMSO was added to dissolve the formazan crystals. Absorbance was measured at 570 nm using a microplate reader, Synergy Neo2 (Biotek). Each trial was prepared independently with fresh nanoparticle dilutions under identical culture conditions. Results from nanoformulation-treated cells (Sample) were analyzed to assess the cytotoxicity against untreated cells (NTC), which exhibit 100% cell growth. Each condition was set up in duplicate to ensure inter-assay validation of the observed trends. The cell viability (%) was calculated as follows: Cell Viability Sample Abs NTC Abs To determine the IC 50 50 3.12. Statistics Graphical data are presented as mean ± standard deviation (SD), derived from three independent experiments. Statistical significance across groups was evaluated using one-way and two-way analysis of variance (ANOVA), followed by Tukey’s post hoc multiple comparisons test. A p p 4. Conclusions This study aimed to develop eco-friendly nanoformulations using green-synthesized zinc (GZn) and silver (GAg) nanoparticles impregnated in halloysite clay, loaded with cisplatin or carboplatin, to enhance targeted anticancer efficacy and minimize toxicity to normal cells. Nanoformulations were characterized using XRD, BET, diffuse reflectance UV-vis spectroscopy, SEM-EDX, HRTEM, and zeta potential to assess textural and chemical properties. Drug adsorption and release kinetics were evaluated using the Korsmeyer–Peppas model. Cytotoxicity was tested in HeLa (cervical cancer) and HFF-1 (normal fibroblast) cells over 24 and 48 h. Our results revealed that zinc-based nanoformulations (Cbpt/GZn-Hall/PEG, Cp/GZn-Hall/PEG) exhibited dose-dependent cytotoxicity against HeLa cells (125.7–252.9 µg/mL) than HFF-1 (387.3–595.6 µg/mL) at 48 h, indicating selective cytotoxicity. Cbpt/GZn-Hall/PEG was more effective than free carboplatin at concentrations of 125–1000 µg/mL. Silver-based formulations (Cbpt/GAg-Hall/PEG, Cp/GAg-Hall/PEG) demonstrated strong cytotoxicity in HeLa cells (IC 50 50 50 Acknowledgments The authors acknowledge Institute for Research and Medical Consultations (IRMC), IAU for providing state of art facilities. We would like to express our appreciation to Vijaya Ravinayagam, Deanship of Scientific Research, IAU for the contribution towards conceptual design of the green synthesis, suggestions and grouping concept design in in vitro study. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091349/s1 Author Contributions Conceptualization, B.R.J.; methodology, S.A. and B.R.J.; software, G.T. and H.D.; investigation, A.A., S.A., G.T., H.D., F.A. and B.R.J.; writing—original draft, A.A., G.T., S.A. and B.R.J.; writing—review and editing, B.R.J. and S.A.; funding acquisition, B.R.J. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 2. Lycke K.D. Steben M. Garland S.M. Woo Y.L. Cruickshank M.E. Perkins R.B. Bhatla N. Ryser M.D. Gravitt P.E. Hammer A. An Updated Understanding of the Natural History of Cervical Human Papillomavirus Infection—Clinical Implications Am. J. Obstet. Gynecol. 2025 in press 10.1016/j.ajog.2025.02.029 39983886 3. Li F. Mei F. Yin S. Du Y. Hu L. Hong W. Li J. Improving the Efficacy and Safety of Concurrent Chemoradiotherapy by Neoadjuvant Chemotherapy: A Randomized Controlled Study of Locally Advanced Cervical Cancer with a Large Tumor J. Gynecol. Oncol. 2023 35 e10 10.3802/jgo.2024.35.e10 37857565 PMC10792203 4. Ogasawara A. Hasegawa K. Recent Advances in Immunotherapy for Cervical Cancer Int. J. Clin. Oncol. 2025 30 434 448 10.1007/s10147-025-02699-0 39888529 PMC11842527 5. Dey T. Agrawal S. Immunotherapy in Cervical Cancer: An Innovative Approach for Better Treatment Outcomes Explor. Target. Anti-Tumor Ther. 2025 6 1002296 10.37349/etat.2025.1002296 40061136 PMC11886377 6. Maharati A. Rajabloo Y. Moghbeli M. Molecular Mechanisms of mTOR-Mediated Cisplatin Response in Tumor Cells Heliyon 2025 11 e41483 10.1016/j.heliyon.2024.e41483 39834411 PMC11743095 7. Bhattacharjee R. Das S.S. Biswal S.S. Nath A. Das D. Basu A. Malik S. Kumar L. Kar S. Singh S.K. Mechanistic Role of HPV-Associated Early Proteins in Cervical Cancer: Molecular Pathways and Targeted Therapeutic Strategies Crit. Rev. Oncol. Hematol. 2022 174 103675 10.1016/j.critrevonc.2022.103675 35381343 8. Shahzadi S. Fatima S. Shafiq Z. Janjua M.R.S.A. A Review on Green Synthesis of Silver Nanoparticles (SNPs) Using Plant Extracts: A Multifaceted Approach in Photocatalysis, Environmental Remediation, and Biomedicine RSC Adv. 2025 15 3858 3903 10.1039/D4RA07519F 39917042 PMC11800103 9. Hussein H.S. Ngugi C. Tolo F.M. Maina E.N. Anticancer potential of silver nanoparticles biosynthesized using Catharanthus roseus leaves extract on cervical (HeLa229) cancer cell line Sci. Afr. 2024 25 e02268 10.1016/j.sciaf.2024.e02268 10. Shrestha D.K. Magar A.B. Bhusal M. Baraili R. Pathak I. Joshi P.R. Parajuli N. Sharma K.R. Synthesis of Silver and Zinc Oxide Nanoparticles Using Polystichum lentum J. Chem. 2024 2024 1876560 10.1155/2024/1876560 11. Harun-Ur-Rashid M. Foyez T. Krishna S.B.N. Poda S. Imran A.B. Recent Advances of Silver Nanoparticle-Based Polymer Nanocomposites for Biomedical Applications RSC Adv. 2025 15 8480 8505 10.1039/D4RA08220F 40109922 PMC11920860 12. Khafaga D.S. Eid M.M. Mohamed M.H. Abdelmaksoud M.D. Afify M. El-Khawaga A.M. Abdelhakim H.K. Enhanced Anticancer Activity of Silver Doped Zinc Oxide Magnetic Nanocarrier Loaded with Sorafenib for Hepatocellular Carcinoma Treatment Sci. Rep. 2024 14 15538 10.1038/s41598-024-65235-6 38969729 PMC11226637 13. Rahman A. Rehman G. Shah N. Hamayun M. Ali S. Ali A. Shah S.k. Khan W. Shah M.I.A. Alrefaei A.F. Biosynthesis and Characterization of Silver Nanoparticles Using Tribulus terrestris Molecules 2023 28 4203 10.3390/molecules28104203 37241943 PMC10224066 14. El-Beltagi H.S. Ragab M. Osman A. El-Masry R.A. Alwutayd K.M. Althagafi H. Alqahtani L.S. Alazragi R.S. Alhajri A.S. El-Saber M.M. Biosynthesis of Zinc Oxide Nanoparticles via Neem Extract and Their Anticancer and Antibacterial Activities PeerJ 2024 12 e17588 10.7717/peerj.17588 38948224 PMC11212640 15. Jafarzadeh S. Haddadi-Asl V. Copolymer-grafted halloysite nanotubes embedded in electrospun fibers as a composite carrier for doxorubicin delivery J. Thermoplast. Compos. Mater. 2025 10.1177/08927057251350043 16. Lvov Y. Panchal A. Fu Y. Fakhrullin R. Kryuchkova M. Batasheva S. Stavitskaya A. Glotov A. Vinokurov V. Interfacial Self-Assembly in Halloysite Nanotube Composites Langmuir 2019 35 8646 8657 10.1021/acs.langmuir.8b04313 30682887 17. Nejad M.A. Urbassek H.M. Adsorption and Diffusion of Cisplatin Molecules in Nanoporous Materials: A Molecular Dynamics Study Biomolecules 2019 9 204 10.3390/biom9050204 31137858 PMC6572581 18. Kim W.K. An J.M. Lim Y.J. Kim K. Kim Y.H. Kim D. Recent Advances in Metallodrug: Coordination-Induced Synergy between Clinically Approved Drugs and Metal Ions Mater. Today Adv. 2025 25 100569 10.1016/j.mtadv.2025.100569 19. Zakeri N. Rezaie H.R. Javadpour J. Kharaziha M. Effect of pH on Cisplatin Encapsulated Zeolite Nanoparticles: Release Mechanism and Cytotoxicity Mater. Chem. Phys. 2021 273 124964 10.1016/j.matchemphys.2021.124964 20. Fakhruddin K. Hassan R. Khan M.U.A. Allisha S.N. Abd Razak S.I. Zreaqat M.H. Latip H.F.M. Jamaludin M.N. Hassan A. Halloysite Nanotubes and Halloysite-Based Composites for Biomedical Applications Arab. J. Chem. 2021 14 103294 10.1016/j.arabjc.2021.103294 21. Ahmed F. Ali M.J. Kondapi A.K. Carboplatin Loaded Protein Nanoparticles Exhibit Improved Anti-Proliferative Activity in Retinoblastoma Cells Int. J. Biol. Macromol. 2014 70 572 582 10.1016/j.ijbiomac.2014.07.041 25088498 22. Mizuno H.L. Anraku Y. Sakuma I. Akagi Y. Effect of PEGylation on the Drug Release Performance and Hemocompatibility of Photoresponsive Drug-Loading Platform Int. J. Mol. Sci. 2022 23 6686 10.3390/ijms23126686 35743128 PMC9224259 23. Wong L.W. Tan J.B.L. Halloysite Nanotube–Polymer Nanocomposites: A Review on Fabrication and Biomedical Applications J. Manuf. Process. 2024 118 76 88 10.1016/j.jmapro.2024.03.043 24. Jermy B.R. Ravinayagam V. Almohazey D. Alamoudi W.A. Dafalla H. Akhtar S. Tanimu G. PEGylated Green Halloysite/Spinel Ferrite Nanocomposites for pH Sensitive Delivery of Dexamethasone: A Potential Pulmonary Drug Delivery Treatment Option for COVID-19 Appl. Clay Sci. 2022 216 106333 10.1016/j.clay.2021.106333 34776567 PMC8576101 25. Liao C. Li Y. Tjong S.C. Bactericidal and Cytotoxic Properties of Silver Nanoparticles Int J Mol Sci. 2019 20 449 10.3390/ijms20020449 30669621 PMC6359645 26. Berehu H.M. Patnaik S. Biogenic Zinc Oxide Nanoparticles synthesized from Tinospora Cordifolia induce oxidative stress, mitochondrial damage and apoptosis in Colorectal Cancer Nanotheranostics 2024 8 312 329 10.7150/ntno.84995 38577319 PMC10988208 27. Pinho A.R. Martins F. Costa M.E.V. Senos A.M. da Cruz e Silva O.A. Pereira M.D.L. Rebelo S. In Vitro Cytotoxicity Effects of Zinc Oxide Nanoparticles on Spermatogonia Cells Cells 2020 9 1081 10.3390/cells9051081 32357578 PMC7290761 28. Gowdhami B. Jaabir M. Archunan G. Suganthy N. Anticancer Potential of Zinc Oxide Nanoparticles against Cervical Carcinoma Cells Synthesized via Biogenic Route Using Aqueous Extract of Gracilaria edulis Mater. Sci. Eng. C 2019 103 109840 10.1016/j.msec.2019.109840 31349511 29. Maheswaran H. Djearamane S. Dhanapal A.C.T.A. Shing W.L. Cytotoxic Study of Zinc Oxide Nanoparticles on Cervical Cancer Cell Line J. Exp. Biol. Agric. Sci. 2023 11 815 821 10.18006/2023.11(5).815.821 30. Danışman-Kalındemirtaş F. Birman H. Karakuş S. Kilislioğlu A. Erdem-Kuruca S. Preparation and Biological Evaluation of Novel 5-Fluorouracil and Carmofur Loaded Polyethylene Glycol/Rosin Ester Nanocarriers as Potential Anticancer Agents and Ceramidase Inhibitors J. Drug Deliv. Sci. Technol. 2022 73 103456 10.1016/j.jddst.2022.103456 31. Takáč P. Michalková R. Čižmáriková M. Bedlovičová Z. Balážová Ľ. Takáčová G. The Role of Silver Nanoparticles in the Diagnosis and Treatment of Cancer: Are There Any Perspectives for the Future? Life 2023 13 466 10.3390/life13020466 36836823 PMC9965924 32. Barot T. Rawtani D. Kulkarni P. Physicochemical and Biological Assessment of Silver Nanoparticles Immobilized Halloysite Nanotubes-Based Resin Composite for Dental Applications Heliyon 2020 6 e03601 10.1016/j.heliyon.2020.e03601 32195405 PMC7078557 33. Chen Y. You X. Ye L. Mei S. Yu J. Xie Y. Wang K. Chen X. Electrodeposited zinc oxide nanoparticles: Synthesis, characterization, and anti-cervical cancer effects Arab. J. Chem. 2024 17 105992 10.1016/j.arabjc.2024.105992 34. Gopisetty M.K. Kovács D. Igaz N. Rónavári A. Bélteky P. Rázga Z. Venglovecz V. Csoboz B. Boros I.M. Kónya Z. Endoplasmic reticulum stress: Major player in size-dependent inhibition of P-glycoprotein by silver nanoparticles in multidrug-resistant breast cancer cells J. Nanobiotechnol. 2019 17 9 10.1186/s12951-019-0448-4 PMC6341731 30670028 35. Daou I. Lecomte-Nana G.L. Tessier-Doyen N. Peyratout C. Gonon M.F. Guinebretiere R. Probing the Dehydroxylation of Kaolinite and Halloysite by In Situ High Temperature X-ray Diffraction Minerals 2020 10 480 10.3390/min10050480 36. Husain T. Shoaib M.H. Ahmed F.R. Yousuf R.I. Farooqi S. Siddiqui F. Imtiaz M.S. Maboos M. Jabeen S. Investigating Halloysite Nanotubes as a Potential Platform for Oral Modified Delivery of Different BCS Class Drugs: Characterization, Optimization, and Evaluation of Drug Release Kinetics Int. J. Nanomed. 2021 16 1725 1741 10.2147/IJN.S299261 33688188 PMC7935346 37. Zhao Z.Y. Wang M.H. Liu T.T. Tribulus terrestris Mater. Lett. 2015 158 274 277 10.1016/j.matlet.2015.05.155 38. Gastelum-Cabrera M. Mendez-Pfeiffer P. Ballesteros-Monrreal M.G. Velasco-Rodríguez B. Martínez-Flores P.D. Silva-Bea S. Domínguez-Arca V. Prieto G. Barbosa S. Otero A. Phytosynthesis and Characterization of Silver Nanoparticles from Antigonon leptopus Pharmaceutics 2025 17 672 10.3390/pharmaceutics17050672 40430963 PMC12115336 39. Ganapathy D. Shanmugam R. Pitchiah S. Murugan P. Chinnathambi A. Alharbi S.A. Durairaj K. Sundramoorthy A.K. Potential Applications of Halloysite Nanotubes as Drug Carriers: A Review J. Nanomater. 2022 2022 1068536 10.1155/2022/1068536 40. Jermy B.R. Tanimu A. Siddiqui M.A. Qureshi Z.S. Aitani A. Akah A. Xu Q. AlHerz M. Crude Oil Conversion to Chemicals over Green Synthesized ZSM-5 Zeolite Fuel Process. Technol. 2023 241 107610 10.1016/j.fuproc.2022.107610 41. Abdullah H. Kuo D.H. Kuo Y.R. Yu F.A. Cheng K.B. Facile Synthesis and Recyclability of Thin Nylon Film-Supported n-Type ZnO/p-Type Ag 2 J. Phys. Chem. C 2016 120 7144 7154 10.1021/acs.jpcc.5b12153 42. Rehman S. Ravinayagam V. Al-Jameel S.S. Ali S.M. Alzayer S.Z. Alfaraj Z.M. Alboeid A. Alamri N. Al Isam S.H. Dafallae H. Controlling Cisplatin Release by Synergistic Action of Silver–Cisplatin on Monodispersed Spherical Silica for Targeted Anticancer and Antibacterial Activities Arab. J. Chem. 2024 17 105661 10.1016/j.arabjc.2024.105661 43. Tharmavaram M. Pandey G. Rawtani D. Surface Modified Halloysite Nanotubes: A Flexible Interface for Biological, Environmental and Catalytic Applications Adv. Colloid Interface Sci. 2018 261 82 101 10.1016/j.cis.2018.09.001 30243667 44. Villagrán Z. Anaya-Esparza L.M. Velázquez-Carriles C.A. Silva-Jara J.M. Ruvalcaba-Gómez J.M. Aurora-Vigo E.F. Rodríguez-Lafitte E. Rodríguez-Barajas N. Balderas-León I. Martínez-Esquivias F. Plant-Based Extracts as Reducing, Capping, and Stabilizing Agents for the Green Synthesis of Inorganic Nanoparticles Resources 2024 13 70 10.3390/resources13060070 45. Katana B. Takács D. Szerlauth A. Sáringer S. Varga G. Jamnik A. Bobbink F.D. Dyson P.J. Szilagyi I. Aggregation of Halloysite Nanotubes in the Presence of Multivalent Ions and Ionic Liquids Langmuir 2021 37 11869 11879 10.1021/acs.langmuir.1c01949 34601883 PMC8515846 46. Alprol A.E. Eleryan A. Abouelwafa A. Gad A.M. Hamad T.M. Green Synthesis of Zinc Oxide Nanoparticles Using Padina pavonica Sci. Rep. 2024 14 32160 10.1038/s41598-024-80757-9 39741157 PMC11688442 47. Iordache M. Oubraham A. Sorlei I.-S. Lungu F.A. Capris C. Popescu T. Marinoiu A. Noble Metals Functionalized on Graphene Oxide Obtained by Different Methods—New Catalytic Materials Nanomaterials 2023 13 783 10.3390/nano13040783 36839151 PMC9962709 48. Rohani R. Dzulkharnien N.S.F. Harun N.H. Ilias I.A. Green Approaches, Potentials, and Applications of Zinc Oxide Nanoparticles in Surface Coatings and Films Bioinorg. Chem. Appl. 2022 2022 3077747 10.1155/2022/3077747 35966407 PMC9371815 49. Wu H. Xu S. Lin K. Xu J. Fu D. Acidity-Activatable Dynamic Halloysite Nanotubes as a Drug Delivery System for Efficient Antitumor Therapy J. Drug Deliv. Sci. Technol. 2023 81 104208 10.1016/j.jddst.2023.104208 Figure 1 ( a b c b c d e f g Figure 2 ( a b c d Figure 3 Cytotoxicity assay of GZn, GAg, GPtNPs and GPt/GZn-Hall against HeLa and HFF-1 cells. Cell viability (%) of treated HeLa cells was assessed at ( a b c d p Figure 4 Cytotoxicity assay Cbpt/GZn-Hall/PEG and Cp/GZn-Hall/PEG formulations against HeLa and HFF-1 cells. Cell viability (%) of treated HeLa cells was assessed at ( a b c d p Figure 5 Cytotoxicity assay Cbpt/GAg-Hall/PEG and Cp/GAg-Hall/PEG formulations against HeLa and HFF-1 cells. Cell viability (%) of treated HeLa cells was assed at ( a b c d p Figure 6 ( A B C D Figure 7 SEM-EDS spectra of ( a g h n Tribulus terrestris Figure 8 ( a c Tribulus terrestris d f Tribulus terrestris g i j l Figure 9 Schematic diagram of GZn-Hall- and GAg-Hall-based nanoformulation synthesis, Cbpt/Cp functionalization, and PEGYlation. pharmaceuticals-18-01349-t001_Table 1 Table 1 Kinetic parameters for cisplatin and carboplatin release. Cisplatin and Carboplatin k/h −n n R 2 Cp/GZn-Hall/PEG (pH = 5) 1.9783 ± 0.2792 0.3947 ± 0.0604 0.9496 Cp/GZn-Hall/PEG (pH = 6.6) 1.7125 ± 0.3397 0.4876 ± 0.0828 0.9386 Cp/GZn-Hall/PEG (pH = 7.4) 0.8644 ± 0.0720 0.5896 ± 0.0366 0.9913 Cp/Zn-Hall/PEG (pH = 9.0) 0.9335 ± 0.3096 0.5792 ± 0.1310 0.8960 Cp/Zn-Hall/PEG (pH = 10.5) 0.4061 ± 0.1551 0.6766 ± 0.1427 0.9178     Cbpt/Zn-Hall/PEG (pH = 5) 0.8059 ± 0.0704 0.2430 ± 0.0388 0.9512 Cbpt/Zn-Hall/PEG (pH = 6.6) 1.0727 ± 0.1023 0.3054 ± 0.0421 0.9630 Cbpt/Zn-Hall/PEG (pH = 7.4) 0.9367 ± 0.0710 0.2920 ± 0.0338 0.9737 Cbpt/Zn-Hall/PEG (pH = 9.0) 1.2699 ± 0.0523 0.1496 ± 0.0187 0.9695 Cbpt/Zn-Hall/PEG (pH = 10.5) 1.1634 ± 0.1097 0.1412 ± 0.0417 0.8506     Cbpt/GZn-Hall/PEG (pH = 6.6) 2.4597 ± 0.2592 0.1714 ± 0.0464 0.8715 Cp/GZn-Hall/PEG (pH = 6.6) 10.1909 ± 0.4561 0.1127 ± 0.0203 0.9388 Cbpt/GAg-Hall/PEG (pH = 6.6) 1.9657 ± 0.2201 0.2032 ± 0.0491 0.8946 Cp/GAg-Hall/PEG (pH = 6.6) 10.8906 ± 0.6037 0.1078 ± 0.0250 0.9025 pharmaceuticals-18-01349-t002_Table 2 Table 2 IC 50 Formulations HeLa 48 h HFF 48 h Cbpt/GZn-Hall/PEG 125.7 387.3 Cp/GZn-Hall/PEG 252.9 595.6 Cbpt/GAg-Hall/PEG 53.62 58.67 CP/GAg-Hall/PEG 67.82 77.75 GPt/GZn-Hall 1001 1000 Carboplatin 43.67 55.76 Cisplatin 2.193 2.123 GAg 1.275 1.236 GPt 13.91 70.58 GAg-Hall 43.02 53.37 pharmaceuticals-18-01349-t003_Table 3 Table 3 Textural characteristics of the Hall nanocarrier and GZn/GAg-Hall-based nanocomposites. Samples Surface Area (m 2 Pore Volume (cm 3 Avg. Pore Size (nm) Hall 77 0.33 17.7 GZn-Hall 58 0.31 21.1 GAg-Hall 55 0.27 20.2 ",
  "metadata": {
    "Title of this paper": "Acidity-Activatable Dynamic Halloysite Nanotubes as a Drug Delivery System for Efficient Antitumor Therapy",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472914/"
  }
}