{
  "title": "Paper_1008",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469906 PMC12469906.1 12469906 12469906 41009382 10.3390/ijms26188813 ijms-26-08813 1 Article Antioxidant Activity, Total Polyphenol Content, and Mineral Composition of Milk Beverages Fortified with Spice Mixtures (Clove, Cinnamon, and Turmeric) and Natural Sweeteners (Erythritol and Stevia): Evidence of Synergistic or Antagonistic Effects of Compounds https://orcid.org/0000-0002-6760-3274 Rak Karolina Conceptualization Methodology Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Project administration Funding acquisition 1 * https://orcid.org/0000-0002-1933-2852 Kolniak-Ostek Joanna Methodology Investigation Resources Writing – review & editing 2 https://orcid.org/0000-0001-7957-918X Gajda Robert Methodology Writing – review & editing 1 Marcinkiewicz Katarzyna Investigation 1 https://orcid.org/0000-0001-6722-9131 Nemś Agnieszka Methodology Resources 3 https://orcid.org/0000-0003-4205-1351 Raczkowska Ewa Methodology Writing – review & editing 1 Amaral Luisa M. P. F. Academic Editor Videira Romeu A. Academic Editor 1 robert.gajda@upwr.edu.pl katarzyna.marcinkiewicz@upwr.edu.pl ewa.raczkowska@upwr.edu.pl 2 joanna.kolniak-ostek@upwr.edu.pl 3 agnieszka.nems@upwr.edu.pl * karolina.rak@upwr.edu.pl 10 9 2025 9 2025 26 18 497349 8813 14 7 2025 02 9 2025 04 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Extensive research is underway on a variety of functional foods that support consumer health. A promising combination is milk (a drink with high nutritional value), fortified with spices (naturally rich in antioxidant compounds) and supplemented with low-calorie, health-promoting sweeteners. The aim was to analyze the antioxidant activity (AA), total polyphenol content (TPC), and mineral composition of milk beverages fortified with a mixture of spices and sweeteners and to verify the interactions between these ingredients. Twenty-four variants of milk drinks were prepared with the addition of three types of spice mixtures (1:1) of clove (Cl), cinnamon (Ci), and turmeric (Tu) with the shares of 2.5%, 5%, 7.5%, and 10%, and two types of sweeteners—erythritol (E) and stevia (S)—as well as six control samples, including three 10% aqueous solutions of spice mixtures. AA was measured using the ABTS, FRAP, and DPPH methods. TPC was determined using the Folin–Ciocalteu method. Mineral content (Ca, Mg, Fe, Cu, and Zn) was assessed using the FAAS/FAES method. The highest AA was demonstrated for beverages with Cl-Ci and Cl-Tu, whereas the highest TPC was found in those with Cl-Tu. AA and TPC values increased with the increase in the share of spices in the beverages, and both measurements were significantly higher in beverages with erythritol compared to those with stevia. Despite the 4–5 times lower TPC, 3–8 times higher AA was demonstrated in beverages with the addition of 10% spice mixtures than their corresponding control samples (aqueous solutions with the addition of 10% spice mixtures), which suggests the great role of interactions between nutrients in food. For beverages with 10% Cl-Ci/Cl-Tu mixtures, significantly higher ABTS, FRAP, and DPPH were observed than would result from the simple sum of AA of the components (synergistic effect). The opposite (antagonistic) effect was observed for beverages with Ci-Tu. AA was positively correlated with the content of Fe, Mg, and Cu; negatively with Ca; and not correlated with Zn. The results suggest that the most health-promoting properties are exhibited by the milk drink with the addition of 10% Cl-Tu and erythritol, demonstrating the highest AA and TPC, the strongest synergistic effect of the components, and the highest content of Mg and Zn. This study highlights the importance of carefully selecting and combining ingredients to maximize the antioxidant properties of functional beverages. However, further research is needed to expand knowledge on this issue. functional food polyphenols mineral elements antioxidant activity spices sugar substitutes National Science Center, Poland 2022/06/X/NZ9/01241 Department of Human Nutrition, Department of Fruit, Vegetable and Plant Nutraceutical Technology and Department of Food Storage and Technology, Faculty of Biotechnology and Food Science, Wrocław University of Environmental and Life Sciences This research was funded by National Science Center, Poland, No. 2022/06/X/NZ9/01241 within the project “Development of recipes for health-promoting milk drinks with antioxidant and immunomodulating properties made with the addition of spices, stevia and erythritol”. The APC was funded by the Department of Human Nutrition, Department of Fruit, Vegetable and Plant Nutraceutical Technology and Department of Food Storage and Technology, Faculty of Biotechnology and Food Science, Wrocław University of Environmental and Life Sciences. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Functional foods are generally considered as foodstuffs that provide claimed beneficial health effects on the human body beyond those resulting from the basic nutritional value [ 1 2 3 Extensive research is underway on a variety of functional foods that support consumer health. Spices can be used as valuable functional food additives. Being a naturally rich source of bioactive compounds such as vitamins, minerals, phytochemicals (i.e. polyphenols, phytosterols, terpenoids, alkaloids, and glycosides), essential oils, and many others [ 4 5 6 7 4 7 8 Clove (Cl), cinnamon (Ci), and turmeric (Tu) may have significant potential in the design of functional foods, as they have, according to the ORAC scale, some of the highest antioxidant activity among spices (290.283, 131.420, and 127.068 µM Tx/100 g, respectively) [ 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 17 Stevia rebaudiana 20 18 Milk and other dairy products can be considered a good functional food matrix due to their high nutritional value. They are a rich source of high-quality protein, calcium, phosphorus, potassium, iodine, and vitamins B2 and B12 [ 27 28 29 30 31 32 33 34 35 36 37 33 37 38 It has been demonstrated that not only macronutrients but also minerals interact with polyphenols. However, knowledge on this topic is limited, and the results presented in the literature are often inconsistent. The antioxidant activity of polyphenol–mineral complexes depends on the molecular structure and electrical charge distribution of phenolic compounds (e.g., the presence and number of hydroxyl and carboxyl groups, double bond conjugation, and stabilization of the electronic charge distribution), metal properties (e.g., oxidation state and redox potential), as well as the interdependence of the above features. Therefore, the final antioxidant effect (enhancement or reduction) is difficult to predict, which is confirmed by many documented cases in which the same polyphenol–metal complexes showed different effects [ 39 40 41 42 43 The literature also provides a wealth of descriptions of possible interactions between polyphenols, both synergistic and antagonistic, using combinations of various phenolic compounds in various proportions [ 44 45 46 47 48 49 50 51 38 52 53 54 55 56 28 29 57 The aim of this study was to assess the health-promoting potential of milk beverages fortified with various spice mixtures (ground clove, cinnamon, and turmeric) with different proportion in the product (2.5%, 5%, 7.5%, and 10%) and with the addition of natural sweeteners (erythritol and stevia). The antioxidant activity (AA), total polyphenol content (TPC), and mineral composition were investigated, and the interactions between compounds in the beverages were also explored. 2. Results 2.1. Antioxidant Capacity Table 1 Table 2 Figure 1 Supplementary Materials Supplementary Table S1A–I Figure 2 p 2 2 2.2. Total Polyphenol Content (TPC) Table 3 p p Table 4 p Figure 3 Supplementary Materials Supplementary Table S2A–C p Figure 4 p 2 2 2.3. Mineral Element Content Table 5 p Table 6 p p p p p p Figure 5 Table 7 p 2.4. Additive, Synergistic, and Antagonistic Effect of Compounds Figure 6 Figure 6 Antagonistic effects for TPC for all three types of spice mixtures, irrespective of the type of sweetener, were demonstrated ( Figure 6 3. Discussion In this study, beverages with the addition of Cl-Ci and Cl-Tu mixtures exhibited the highest antioxidant capacity and TPC, significantly higher than those with the Ci-Tu mixture ( Table 2 Table 4 9 58 59 Table 2 Table 4 20 26 60 61 In this study, higher antioxidant activity was observed in the tested beverages with a 10% addition of spice mixtures compared to their corresponding aqueous control samples ( Figure 1 Figure 3 Table 2 9 Figure 6 62 63 31 32 30 35 32 64 32 Interestingly, a greater synergistic effect was observed for beverages with the Cl-Tu mixture than with the Cl-Ci mixture, which suggests a higher potential of turmeric than cinnamon to enhance the antioxidant activity of clove, despite the similar ORAC values of both spices [ 9 65 66 Table 2 Figure 6 67 68 69 It should, however, be highlighted that many factors can modify antioxidant activity of the product, as well as the synergistic or antagonistic antioxidant effects of compounds, including combined ratio or concentration of antioxidants, food matrix, temperature, pH, storage conditions, light and oxygen availability, and processing and cooking method [ 47 48 49 50 51 51 51 Syzygium aromaticum 70 Cinnamonum verum 71 Curcuma longa 72 With the increase in the share of spices, an increase in the content of iron, copper, zinc, and magnesium in the tested beverages was observed, as was a decrease in the content of calcium ( Table 6 73 74 75 Figure 5 Table 7 76 77 78 79 Pleurotus ostreatus 80 80 Figure 2 Figure 4 51 81 82 The discrepancies in the literature regarding the antioxidant activity of polyphenol–metal complexes may result not only from differences in antioxidant mechanisms of phenolic compounds and methodological differences but also, or even primarily, from the dual role of metal ions in shaping the antioxidant activity of polyphenols. Chen et al. (2024) explained that metals can either enhance or inhibit antioxidant activity. They may promote activity by redistributing electron density, lowering hydrogen transfer energy, and stabilizing resonance, or reduce it through charge irregularities, covalent bonding, and resonance disruption. The final effect depends on the metal’s properties and its interaction with the ligand’s (polyphenol’s) electronic structure [ 39 Due to the multitude of factors determining the antioxidant activity of a food product, further research is necessary to experimentally develop the composition and technological production process of functional beverages in order to achieve the greatest health-promoting effect. 4. Materials and Methods 4.1. Groceries The ground spices—clove ( Syzygium aromaticum Cinnamonum verum Curcuma longa Table 8 4.2. Reagents Nitric acid, hydrochloric acid, sodium carbonate, ferrous chloride, and Folin–Ciocalteu reagent were purchased from Alchem (Toruń, Poland). Methanol hypergrade for LC-MS, 2,4,6,-tris(2-pirydyl)-s-triazine (TPTZ), 2,2′-azino-bis(3-ethylbenzthiazoline-6-sulfonic acid) (ABTS), potassium peroxodisulfate, 2,2-diphenyl-1-picrylhydrazyl (DPPH), and 6-hydroxy-2,5,7,8-tetramethylchroman-2-carboxylic acid (Trolox) were purchased from Merck (Darmstadt, Germany). All reagents used were of analytical grade. 4.3. Preparation of Beverages—Milk Beverages Fortified with Spices and Sweeteners Twenty-four variants of beverages were prepared, one sample of each variant. Milk was sweetened with either erythritol (E) or stevia (S). The amount of each sweetener used was equivalent to 5 g of saccharose per 200 g of beverage. Taking into account their sweetness compared to saccharose, i.e., 0.5-fold [ 26 20 4.4. Initial Sample Processing The beverages and control samples were heated in a water bath (Memmert, type: WNB 7, GmbH, Schwabach, Germany) at 60 °C for 10 min, with constant stirring. The parameters were adjusted to ensure optimal extraction of polyphenols into the milk matrix while protecting them against degradation [ 87 88 89 90 g 4.5. Extraction of Polyphenolic Compounds Polyphenolic compounds were extracted from the supernatant (1 g) with 0.5 mL of 80% methanol HPLC acidified with 1% HCl ( v/v g 91 4.6. Antioxidant Capacity The antioxidant capacity of the tested beverages and control samples was determined using three methods—FRAP, ABTS, and DPPH. The absorbance of four replicates was measured on Synergy H1 (BioTek, Winooski, VT, USA) against a blank sample of distilled water. The results are expressed as mmoles of Trolox equivalents per 100 g of sample. 4.6.1. FRAP Assay The FRAP spectrophotometric method measures the ability of an antioxidant to reduce Fe(III) ions to Fe(II) in TPTZ. The colorless reagent produces an intensely blue Fe(II) compound. For the FRAP assay, the method described by Benzie and Strain (1996) [ 92 4.6.2. ABTS Assay The ABTS spectrophotometric method measures the ability of an antioxidant to reduce the blue cation radical ABTS •+ 93 4.6.3. DPPH Assay The DPPH spectrophotometric method measures the ability of an antioxidant to reduce the purple radical DPPH • 94 4.7. Total Polyphenol Content For the total phenolic content (TPC), the Folin–Ciocalteu method described by Gao et al. (2000) [ 95 2 4.8. Wet Mineralization Wet mineralization was conducted using a modification of the method described previously by Huang et al. (2004) [ 96 4.9. Mineral Element Content The content of mineral elements—magnesium (Mg), iron (Fe), zinc (Zn), and copper (Cu)—was determined by atomic absorption (emission for calcium (Ca)) spectrometry in an acetylene–oxygen flame (FAAS/FAES) using a spectrometer SpectraAA240 FS (Varian, Agilent Technologies, Palo Alto, Santa Clara, CA, USA). The conditions for measuring mineral elements by FAAS/FAES are presented in Table 9 97 98 99 Mineral element content was calculated using the following formula: m i n e r a l  e l e m e n t  c o n t e n t  m g l = r a w  s p e c t r o m e t e r  r e s u l t  m g l  ×   d i l u t i o n s a m p l e  w e i g h t  [ g ] a n a l y t e  v o l u m e  [ m l ]   The content of Ca and Mg was expressed in mg/100 g of beverage, whereas the content of Fe, Zn, and Cu in µg/100 g. 4.10. Statistical Analyses For statistical analyses, Statistica 13 PL (StatSoft Polska, Kraków, Poland) was employed. The results are expressed as mean ± standard deviation (SD). Three-way ANOVA was carried out to demonstrate the main effects of the type of spice mixture, its share [%], and the type of sweetener, as well as their interactions, on the analyzed features of the tested beverages—antioxidant capacity, total polyphenol content, and mineral element content. Tukey’s HSD test was employed as a post hoc test. Pearson’s correlation was used to verify relationships between the parameters of antioxidant activity, TPC, and mineral element content. Statistical differences between two subgroups (synergistic, antagonistic, and additive effect) were determined using Student’s t p 100 5. Conclusions The findings of this study clearly demonstrate that the antioxidant potential of functional beverages is significantly influenced by both the type and proportion of spices used, as well as the presence of sweeteners and milk. Beverages with the addition of clove-based mixtures (Cl-Ci and Cl-Tu) exhibited the highest antioxidant activity and total polyphenol content (TPC), confirming the extremely high antioxidant potential of clove and pointing to the value of its use in functional foods counteracting oxidative stress. The increase in antioxidant activity and TPC with increasing spice content observed in this study confirms the contribution of polyphenol-rich spices to the antioxidant potential of functional foods. Erythritol, compared to stevia, was shown to increase both the antioxidant activity and TPC of beverages, most likely due to its higher content in the product weight. The synergistic effect of spices, milk, and sweeteners seems to be a promising way to increase the antioxidant activity of beverages, which was particularly noticeable in those with added cloves and turmeric (Cl-Tu). However, some combinations of compounds may produce antagonistic effects, as observed in the case of beverages with the addition of cinnamon and turmeric (Ci-Tu). The type of interaction may depend on many physicochemical factors and is difficult to predict theoretically. The strong positive correlation observed in this study between the share of spice mixtures in tested beverages; the content of iron, copper, and magnesium; and antioxidant activity underscores the functional role of spices as a source of mineral elements. The high correlation between various antioxidant measurements (FRAP, ABTS, and DPPH) and TPC supports the reliability of the results and their consistency with the existing literature. Due to the multitude of factors determining the antioxidant activity of a food product (discussed in detail in the Discussion Section), including the combination, concentration, and proportion between the components; complex interactions between them; physicochemical factors; technological processing; and therefore, the difficulty of theoretical prediction—confirmed by the discrepancies in research results—further research is necessary to experimentally develop the composition and technological production process of functional beverages in order to achieve the greatest health-promoting effect. This study highlights the importance of carefully selecting and combining ingredients to maximize the antioxidant properties of functional beverages. Further research is needed to test the properties of beverages produced using combinations of other matrices, spices, and sweeteners, as well as sensory testing with consumers prior to the potential introduction of such functional beverages to the market. Acknowledgments Authors thank Marzena Styczyńska, Department of Human Nutrition, Faculty of Biotechnology and Food Science, Wroclaw University of Environmental and Life Sciences, for her valuable methodological suggestions. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ijms26188813/s1 Author Contributions Conceptualization. K.R.; methodology. K.R., J.K.-O., R.G., E.R. and A.N.; formal analysis. K.R.; investigation. K.R., J.K.-O. and K.M.; resources. K.R., J.K.-O. and A.N.; data curation. K.R.; writing—original draft preparation. K.R.; writing—review and editing. K.R., J.K.-O., R.G. and E.R.; visualization. K.R.; project administration. K.R.; funding acquisition. K.R. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data are placed in the UPWr Research Data Repository at the link https://bazawiedzy.upwr.edu.pl/info/researchdata/UPWRf3b342fbd91a45598d2078f0d0d06a54/ Conflicts of Interest The authors declare no conflicts of interest. References 1. Damián M.R. Cortes-Perez N.G. Quintana E.T. Ortiz-Moreno A. Garfias Noguez C. Cruceño-Casarrubias C.E. Sánchez Pardo M.E. Bermúdez-Humarán L.G. Functional foods, nutraceuticals and probiotics: A focus on human health Microorganisms 2022 10 1065 10.3390/microorganisms10051065 35630507 PMC9143759 2. Functional Foods Market Size, Share & Trends Analysis Report by Ingredient (Carotenoids, Prebiotics & Probiotics, Fatty Acids, Dietary Fibers), by Product, by Application, by Region, and Segment Forecasts, 2022–2030 Available online: https://www.grandviewresearch.com/industry-analysis/functional-food-market (accessed on 23 May 2025) 3. Sugar Substitutes Market Size, Share & Trends Analysis Report by Type (High-intensity Sweeteners, High Fructose Syrup), by Application (Food, Beverages), by Region (North America, Asia Pacific), and Segment Forecasts, 2024–2030 Available online: https://www.grandviewresearch.com/industry-analysis/sugar-substitutes-market (accessed on 23 May 2025) 4. Câmara J.S. Albuquerque B.R. Aguiar J. Corrêa R.C.G. Gonçalves J.L. Granato D. Pereira J.A.M. Barros L. Ferreira I.C.F.R. Food bioactive compounds and emerging techniques for their extraction: Polyphenols as a case study Foods 2020 10 37 10.3390/foods10010037 33374463 PMC7823739 5. Mackonochie M. Rodriguez-Mateos A. Mills S. Rolfe V. A scoping review of the clinical evidence for the health benefits of culinary doses of herbs and spices for the prevention and treatment of metabolic syndrome Nutrients 2023 15 4867 10.3390/nu15234867 38068725 PMC10708057 6. Isbill J. Kandiah J. Kruzliakova N. Opportunities for health promotion: Highlighting herbs and spices to improve immune support and well-being Integr. Med. 2020 19 30 42 PMC7815254 33488303 7. Jiang T.A. Health benefits of culinary herbs and spices J. AOAC Int. 2019 102 395 410 10.5740/jaoacint.18-0418 30651162 8. Yashin A. Yashin Y. Xia X. Nemzer B. Antioxidant activity of spices and their impact on human health: A review Antioxidants 2017 6 70 10.3390/antiox6030070 28914764 PMC5618098 9. Haytowitz D.B. Bhagwat S.A. USDA Database for the Oxygen Radical Capacity (ORAC) of Selected Foods, Release 2. USDA National Nutrient Database for Standard Reference 2010 Available online: https://www.ars.usda.gov/research/publications/publication/?seqNo115=251105 (accessed on 5 September 2025) 10. Jain S.G. Puri S. Misra A. Gulati S. Mani K. Effect of oral cinnamon intervention on metabolic profile and body composition of Asian Indians with metabolic syndrome: A randomized double-blind control trial Lipids Health Dis. 2017 16 113 10.1186/s12944-017-0504-8 28606084 PMC5469078 11. Askari F. Rashidkhani B. Hekmatdoost A. Cinnamon may have therapeutic benefits on lipid profile, liver enzymes, insulin resistance, and high-sensitivity C-reactive protein in nonalcoholic fatty liver disease patients Nutr. Res. 2014 34 143 148 10.1016/j.nutres.2013.11.005 24461315 12. Adab Z. Eghtesadi S. Vafa M.R. Heydari I. Shojaii A. Haqqani H. Arablou T. Eghtesadi M. Effect of turmeric on glycemic status, lipid profile, hs-CRP, and total antioxidant capacity in hyperlipidemic type 2 diabetes mellitus patients Phytother. Res. 2019 33 1173 1181 10.1002/ptr.6312 30859660 13. Kuroda M. Mimaki Y. Ohtomo T. Yamada J. Nishiyama T. Mae T. Kishida H. Kawada T. Hypoglycemic effects of clove (Syzygium aromaticum flower buds) on genetically diabetic KK-Ay mice and identification of the active ingredients J. Nat. Med. 2012 66 394 399 10.1007/s11418-011-0593-z 21987283 14. Tao G. Irie Y. Li D.J. Keung W.M. Eugenol and its structural analogs inhibit monoamine oxidase A and exhibit antidepressant-like activity Bioorg. Med. Chem. 2005 13 4777 4788 10.1016/j.bmc.2005.04.081 15936201 15. Halder S. Mehta A. Kar R. Mustafa M. Mediratta P. Sharma K. Clove oil reverses learning and memory deficits in scopolamine-treated mice Planta Med. 2011 77 830 834 10.1055/s-0030-1250605 21157682 16. Mazi T.A. Stanhope K.L. Erythritol: An in-depth discussion of its potential to be a beneficial dietary component Nutrients 2023 15 204 10.3390/nu15010204 36615861 PMC9824470 17. EFSA Panel on Food Additives and Flavourings (FAF) Re-evaluation of erythritol (E968) as a food additive EFSA J. 2023 21 e8430 38125972 10.2903/j.efsa.2023.8430 PMC10731997 18. EFSA Panel on Food Additives and Nutrient Sources (ANS) Scientific opinion on safety of steviolglycosides for the proposed uses as a food additive EFSA J. 2010 8 1537 19. Noda K. Nakayama K. Oku T. Serum glucose and insulin levels and erythritol balance after oral administration of erythritol in healthy subjects Eur. J. Clin. Nutr. 1994 48 286 292 8039489 20. Peteliuk V. Rybchuk L. Bayliak M. Storey K.B. Lushchak O. Natural sweetener Stevia rebaudiana EXCLI J. 2021 20 1412 1430 34803554 10.17179/excli2021-4211 PMC8600158 21. Wölnerhanssen B.K. Cajacob L. Keller N. Doody A. Rehfeld J.F. Drewe J. Peterli R. Beglinger C. Meyer-Gerspach A.C. Gut hormone secretion, gastric emptying, and glycemic responses to erythritol and xylitol in lean and obese subjects Am. J. Physiol. Endocrinol. Metab. 2016 310 1053 1061 10.1152/ajpendo.00037.2016 27117004 22. Wölnerhanssen B.K. Drewe J. Verbeure W. le Roux C.W. Dellatorre-Teixeira L. Rehfeld J.F. Holst J.J. Hartmann B. Tack J. Peterli R. Gastric emptying of solutions containing the natural sweetener erythritol and effects on gut hormone secretion in humans: A pilot dose-ranging study Diabetes Obes. Metab. 2021 23 1311 1321 10.1111/dom.14342 33565706 PMC8247993 23. Livesey G. Health potential of polyols as sugar replacers with emphasis on low glycaemic properties Nutr. Res. Rev. 2003 16 163 191 10.1079/NRR200371 19087388 24. Falony G. Honkala S. Runnel R. Olak J. Nommela R. Russak S. Saag M. Makinen P.L. Makinen K. Vahlberg T. Long-term effect of erythritol on dental caries development during childhood: A posttreatment survival analysis Caries Res. 2016 50 579 588 10.1159/000450762 27806364 25. Contreras S. Anticariogenic properties and effects on periodontal structures of Stevia rebaudiana Bertoni. Narrative review J. Oral Res. 2013 2 158 166 10.17126/joralres.2013.034 26. Gwak M.-J. Chung S.-J. Kim Y.J. Lim C.S. Relative sweetness and sensory characteristics of bulk and intense sweeteners Food Sci. Biotechnol. 2012 21 889 894 10.1007/s10068-012-0115-0 27. Antunes I.C. Bexiga R. Pinto C. Roseiro L.C. Quaresma M.A.G. Cow’s milk in human nutrition and the emergence of plant-based milk alternatives Foods 2023 12 99 10.3390/foods12010099 PMC9818304 36613315 28. El-Sayed S.M. Youssef A.M. Potential application of herbs and spices and their effects in functional dairy products Heliyon 2019 5 e01989 10.1016/j.heliyon.2019.e01989 31338458 PMC6607025 29. Cutrim C.S. Cortez M.A.S. A review on polyphenols: Classification, beneficial effects and their application in dairy products Int. J. Dairy Technol. 2018 71 564 578 10.1111/1471-0307.12515 30. van de Langerijt T.M. O’Mahony J.A. Crowley S.V. Structural, binding and functional properties of milk protein-polyphenol systems: A review Molecules 2023 28 2288 10.3390/molecules28052288 36903537 PMC10005448 31. Kardum N. Glibetic M. Polyphenols and Their Interactions with 629 Other Dietary Compounds: Implications for Human Health Advances in Food and Nutrition Research Academic Press Cambridge, MA, USA 2018 Volume 84 103 144 10.1016/bs.afnr.2017.12.001 29555067 32. Sun X. Sarteshnizi R.A. Udenigwe C.C. Recent advances in protein–polyphenol interactions focusing on structural properties related to antioxidant activities Curr. Opin. Food Sci. 2022 45 100840 10.1016/j.cofs.2022.100840 33. Lamothe S. Langlois A. Bazinet L. Couillard C. Britten M. Antioxidant activity and nutrient release from polyphenol-enriched cheese in a simulated gastrointestinal environment Food Funct. 2016 7 1634 1644 10.1039/C5FO01287B 26931486 34. Helal A. Tagliazucchi D. Impact of in-vitro gastro-pancreatic digestion on polyphenols and cinnamaldehyde bioaccessibility and antioxidant activity in stirred cinnamon-fortified yogurt LWT 2018 89 164 170 10.1016/j.lwt.2017.10.047 35. Zhang H. Zheng J. Liu X. Ding Q. Jiang L. Guo H. Ren F. Milk protein and fat play different roles in affecting the bioavailability and the antioxidant activity of jujube juice phenolics in rats Mol. Nutr. Food Res. 2012 56 1511 1519 10.1002/mnfr.201200085 22930468 36. Langley-Evans S.C. Consumption of black tea elicits an increase in plasma antioxidant potential in humans Int. J. Food Sci. Nutr. 2000 51 309 315 10.1080/096374800426902 11103296 37. Jakobek L. Interactions of polyphenols with carbohydrates, lipids and proteins Food Chem 2015 175 556 567 10.1016/j.foodchem.2014.12.013 25577120 38. Bohn T. Dietary factors affecting polyphenol bioavailability Nutr. Rev. 2014 72 429 452 10.1111/nure.12114 24828476 39. Chen Z. Świsłocka R. Choinska R. Marszaek K. Dąbrowska A. Lewandowski W. Lewandowska H. Exploring the correlation between the molecular structure and biological activities of metal–phenolic compound complexes: Research and description of the role of metal ions in improving the antioxidant activities of phenolic compounds Int. J. Mol. Sci. 2024 25 11775 10.3390/ijms252111775 39519325 PMC11546605 40. Granda H. de Pascual-Teresa S. Interaction of polyphenols with other food components as a means for their neurological health benefits J. Agric. Food Chem. 2018 66 8224 8230 10.1021/acs.jafc.8b02839 30024751 41. Ma Q. Kim E.Y. Lindsay E.A. Han O. Bioactive dietary polyphenols inhibit heme iron absorption in a dose-dependent manner in human intestinal Caco-2 cells J. Food Sci. 2011 76 H143 H150 10.1111/j.1750-3841.2011.02184.x 22417433 PMC3306181 42. Kim E.Y. Pai T.K. Han O. Effect of bioactive dietary polyphenols on zinc transport across the intestinal Caco-2 cell monolayers J. Agric. Food Chem. 2011 59 3606 3612 10.1021/jf104260j 21410257 PMC3087602 43. Cioanca O. Lungu I.-I. Batir-Marin D. Lungu A. Marin G.-A. Huzum R. Stefanache A. Sekeroglu N. Hancianu M. Modulating polyphenol activity with metal ions: Insights into dermatological applications Pharmaceutics 2025 17 194 10.3390/pharmaceutics17020194 40006561 PMC11858937 44. Mitra S. Tareq A.M. Das R. Emran T.B. Nainu F. Chakraborty A.J. Ahmad I. Tallei T.E. Idris A.M. Simal-Gandara S. Polyphenols: A first evidence in the synergism and bioactivities Food Rev. Int. 2023 39 4419 4441 10.1080/87559129.2022.2026376 45. Erskine E. Subaşı B.G. Vahapoglu B. Capanoglu E. Coffee phenolics and their interaction with other food phenolics: Antagonistic and synergistic effects ACS Omega 2022 7 1595 1601 10.1021/acsomega.1c06085 35071855 PMC8772327 46. Nguyen M.M. Karboune S. Combinatorial interactions of essential oils enriched with individual polyphenols, polyphenol mixes, and plant extracts: Multi-antioxidant systems Antioxidants 2023 12 486 10.3390/antiox12020486 36830046 PMC9952583 47. Pellegrini N. Chiavaro E. Gardana C. Mazzeo T. Contino D. Gallo M. Riso P. Fogliano V. Porrini M. Effect of different cooking methods on color, phytochemical concentration, and antioxidant capacity of raw and frozen brassica vegetables J. Agric. Food Chem. 2010 58 4310 4321 10.1021/jf904306r 20218674 48. Chohan M. Naughton D.P. Jones L. Opara E.I. An investigation of the relationship between the anti-inflammatory activity, polyphenolic content, and antioxidant activities of cooked and in vitro digested culinary herbs Oxidative Med. Cell. Longev. 2012 2012 627843 10.1155/2012/627843 PMC3364734 22685620 49. Chohan M. The Impact of Digestion and Gut Bioavailability, in Vitro, on the Polyphenolic Associated Activity of Cooked Culinary Herbs Ph.D. Thesis Kingston University Kingston upon Thames, UK 2011 50. Choi Y. Lee S.M. Chun J. Lee H.B. Lee J. Influence of heat treatment on the antioxidant activities and polyphenolic compounds of Shiitake ( Lentinus edodes Food Chem. 2006 99 381 387 10.1016/j.foodchem.2005.08.004 51. Chen X. Li H. Zhang B. Deng Z. The synergistic and antagonistic antioxidant interactions of dietary phytochemical combinations Crit. Rev. Food Sci. Nutr. 2022 62 5658 5677 10.1080/10408398.2021.1888693 33612011 52. Manoharan A. Ramasamy D. Dhanalashmi B. Gnanalashmi K.S. Thyagarajan D. Studies on sensory evaluation of Curcumin powder as natural color for butterscotch flavor ice cream Indian J. Drugs Dis. 2012 1 2278 2958 53. Marinho M.T. Zielinski A.A.F. Demiate I.M. Bersot L.D.S. Granato D. Nogueira A. Ripened semihard cheese covered with lard and dehydrated rosemary ( Rosmarinus officinalis J. Food Sci. 2015 80 S2045 S2054 10.1111/1750-3841.12988 26259705 54. Rathod P.B. Zinjarde R.M. Ingole A.S. Meshram T.A. Utilization of ginger ( Zingiber officinale Int. J. Chem. Stud. 2019 7 2648 2651 55. Hamid O.I.A. Abdelrahman N.A.M. Effect of adding cardamom, cinnamon and fenugreek to goat’s milk curd on the quality of white cheese during storage Int. J. Dairy Sci. 2012 7 43 50 10.3923/ijds.2012.43.50 56. Mohamed E.-F. Salama H.H. El-Sayed S.M. Samir H. Zahran H. Utilization of natural antimicrobial and antioxidant of Moringa oleifera leaves extract in manufacture of cream cheese J. Biol. Sci. 2018 18 92 106 10.3923/jbs.2018.92.106 57. Paswan V.K. Rose H. Singh C.S. Yamini S. Rathaur A. Herbs and Spices Fortified Functional Dairy Products IntechOpen London, UK 2021 98775 58. Singh N. Yadav S.S. A review on health benefits of phenolics derived from dietary spices Curr. Res. Food Sci. 2022 5 1508 1523 10.1016/j.crfs.2022.09.009 36132490 PMC9483645 59. Mensah M.A. Polyphenols and Flavonoids Containing Food Spices Analysis of Food Spices. Identification and Authentification 1st ed. Nollet L. Ahmad J. Ahamad J. CRC Press Boca Raton, FL, USA 2023 60. den Hartog G.J.M. Boots A.W. Adam-Perrot A. Brouns F. Verkooijen I.W.C.M. Weseler A.R. Haenen G.R.M.M. Bast A. Erythritol is a sweet antioxidant Nutrition 2010 26 449 458 10.1016/j.nut.2009.05.004 19632091 61. Soetan O.A. Ajao F.O. Ajayi A.F. Blood glucose lowering and anti-oxidant potential of erythritol: An in vitro and in vivo study J. Diabetes Metab. Disord. 2023 22 1217 1229 10.1007/s40200-023-01237-x 37975140 PMC10638257 62. Wang S. Meckling K.A. Marcone M.F. Kakuda Y. Tsao R. Synergistic, additive, and antagonistic effects of food mixtures on total antioxidant capacities J. Agric. Food Chem. 2011 59 960 968 10.1021/jf1040977 21222468 63. Bayram I. Decker E.A. Underlying mechanisms of synergistic antioxidant interactions during lipid oxidation Trends Food Sci. Technol. 2023 133 219 230 10.1016/j.tifs.2023.02.003 64. Rashidinejad A. Birch E.J. Sun-Waterhouse D. Everett D.W. Addition of milk to tea infusions: Helpful or harmful? Evidence from in vitro and in vivo studies on antioxidant properties Crit. Rev. Food Sci. Nutr. 2017 57 3188 3196 10.1080/10408398.2015.1099515 26517348 65. Hossain M.B. Ahmed L. Martin-Diana A.B. Brunton N.P. Barry-Ryan C. Individual and combined antioxidant activity of spices and spice phenolics Antioxidants 2023 12 308 10.3390/antiox12020308 36829866 PMC9952251 66. Feng J.Y. Liu Z.Q. Phenolic and enolic hydroxyl groups in curcumin: Which plays the major role in scavenging radicals? J. Agric. Food Chem. 2009 57 11041 11146 10.1021/jf902244g 19736944 67. Olszowy M. Dawidowicz A.L. Jóźwik-Dolęba M. Are mutual interactions between antioxidants the only factors responsible for antagonistic antioxidant effect of their mixtures? Additive and antagonistic antioxidant effects in mixtures of gallic, ferulic and caffeic acids Eur. Food Res. Technol. 2019 245 1473 1485 10.1007/s00217-019-03255-7 68. Carey F.A. Sundberg R.J. Addition, Condensation and Substitution Reactions of Carbonyl Compounds Advanced Organic Chemistry. Part A: Structure and Mechanisms 5th ed. Carey F.A. Sundberg R.J. Springer Boston, MA, USA 2007 69. Schmittel M. Lal M. Lal R. Röck M. Langels A. Rappoport Z. Basheer A. Schlirf J. Deiseroth H.-J. Flörke U. A comprehensive picture of the one-electron oxidation chemistry of enols, enolates and α-carbonyl radicals: Oxidation potentials and characterization of radical intermediates Tetrahedron 2009 65 10842 10855 10.1016/j.tet.2009.10.039 70. Haro-González J.N. Castillo-Herrera G.A. Martínez-Velázquez M. Espinosa-Andrews H. Clove essential oil ( Syzygium aromaticum Molecules 2021 26 6387 10.3390/molecules26216387 34770801 PMC8588428 71. Han R. Li X. Gao X. Lv G. Cinnamaldehyde: Pharmacokinetics, anticancer properties and therapeutic potential (Review) Mol. Med. Rep. 2024 30 163 10.3892/mmr.2024.13287 38994757 PMC11267250 72. Dhakal S. Chao K. Schmidt W. Qin J. Kim M. Chan D. Evaluation of turmeric powder adulterated with metanil yellow using FT-Raman and FT-IR spectroscopy Foods 2016 5 36 10.3390/foods5020036 28231130 PMC5302347 73. Ayoade W.G. Gbadamosi L. Ajayi M.G. Badmus M.O. Assessment of minerals and vitamin constituents of some commonly consumed spices Int. J. Sci. Res. Arch. 2023 10 53 61 10.30574/ijsra.2023.10.1.0702 74. Cimmino F. Catapano A. Petrella L. Villano I. Tudisco R. Cavaliere G. Role of milk micronutrients in human health Front. Biosci. 2023 28 41 10.31083/j.fbl2802041 36866551 75. Ashique S. Kumar S. Hussain A. Mishra N. Garg A. Gowda B.H.J. Farid A. Gupta G. Dua K. Taghizadeh-Hesary F. Correction: A narrative review on the role of magnesium in immune regulation, inflammation, infectious diseases, and cancer J. Health Popul. Nutr. 2023 42 117 Erratum in J. Health Popul. Nutr. 2023 42 10.1186/s41043-023-00461-8 37919828 PMC10621186 76. Ragaee S. Abdel-Aal E.S.M. Noaman M. Antioxidant activity and nutrient composition of selected cereals for food use Food Chem. 2006 98 32 38 10.1016/j.foodchem.2005.04.039 77. Ciscomani-Larios J.P. Sánchez-Chávez E. Jacobo-Cuellar J.L. Sáenz-Hidalgo H.K. Orduño-Cruz N. Cruz-Alvarez O. Ávila-Quezada G.D. Biofortification efficiency with magnesium salts on the increase of bioactive compounds and antioxidant capacity in snap beans Ciênc. Rural. 2021 51 e20200442 10.1590/0103-8478cr20200442 78. Szentmihályi K. Szilágyi M. Balla J. Ujhelyi L. Blázovics A. In vitro antioxidant activities of magnesium compounds used in food industry Acta Aliment. 2014 43 419 425 10.1556/AAlim.43.2014.3.8 79. Zago M.P. Oteiza P.I. The antioxidant properties of zinc: Interactions with iron and antioxidants Free Radic. Biol. Med. 2001 31 266 274 10.1016/S0891-5849(01)00583-4 11440839 80. Vieira P.A.F. Gontijo D.C. Vieira B.C. Fontes E.A. de Assunção L.S. Leite J.P.V. de A. Oliveira M.G. Kasuya M.C.M. Antioxidant activities, total phenolics and metal contents in Pleurotus ostreatus mushrooms enriched with iron, zinc or lithium LWT-Food Sci. Technol. 2013 54 421 425 10.1016/j.lwt.2013.06.016 81. Rumpf J. Burger R. Schulze M. Statistical evaluation of DPPH, ABTS, FRAP, and Folin-Ciocalteu assays to assess the antioxidant capacity of lignins Int. J. Biol. Macromol. 2023 233 123470 10.1016/j.ijbiomac.2023.123470 36736974 82. Kiss A. Papp V.A. Pál A. Prokisch J. Mirani S. Toth B.E. Alshaal T. Comparative study on antioxidant capacity of diverse food matrices: Applicability, suitability and inter-correlation of multiple assays to assess polyphenol and antioxidant status Antioxidants 2025 14 317 10.3390/antiox14030317 40227337 PMC11939821 83. USDA Food Data Central Available online: https://fdc.nal.usda.gov (accessed on 8 August 2025) 84. MyFoodData Nutrition Facts for All-Natural Erythritol Available online: https://tools.myfooddata.com/nutrition-facts/ (accessed on 8 August 2025) 85. Neveu V. Perez-Jiménez J. Vos F. Crespy V. du Chaffaut L. Mennen L. Knox C. Eisner R. Cruz J. Wishart D. Phenol-Explorer: An online comprehensive database on polyphenol contents in foods Database 2010 2010 bap024 10.1093/database/bap024 20428313 PMC2860900 86. Sowa P. Tarapatskyy M. Puchalski C. Dżugan M. Quality evaluation of cinnamon marketed in Poland on the basis of determining ratio of cinnamaldehyde-to-coumarin content Food Sci. Technol. Qual. 2019 26 113 125 10.15193/zntj/2019/121/317 87. Rajbhar K. Dawda H. Makundan U. Polyphenols: Methods of extraction Sci. Revs. Chem. Commun. 2015 5 1 6 88. Antony A. Farid M. Effect of temperatures on polyphenols during extraction Appl. Sci. 2022 12 2107 10.3390/app12042107 89. Idowu-Adebayo F. Fogliano V. Linnemann A. Turmeric-fortified cow and soya milk: Golden milk as a street food to support consumer health Foods 2022 11 558 10.3390/foods11040558 35206034 PMC8871262 90. 10 Benefits of Golden (Turmeric) Milk and How to Make It Available online: https://foolproofliving.com/turmeric-golden-milk/ (accessed on 7 August 2025) 91. Oszmiański J. Kolniak-Ostek J. Lachowicz S. Gorzelany J. Matłok N. Phytochemical compounds and antioxidant activity in different cultivars of cranberry ( Vaccinium Macrocarpon J. Food Sci. 2017 82 2569 2575 10.1111/1750-3841.13924 28973819 92. Benzie I.F.F. Strain J.J. The ferric reducing ability of plasma (FRAP) as a measure of “antioxidant power”: The FRAP assay Anal. Biochem. 1996 239 70 76 10.1006/abio.1996.0292 8660627 93. Re R. Pellegrini N. Proteggente A. Pannala A. Yang M. Rice-Evans C. Antioxidant activity applying an improved ABTS radical cation decolorization assay Free Radic. Biol. Med. 1999 26 1231 1237 10.1016/S0891-5849(98)00315-3 10381194 94. Yen G.C. Chen H.Y. Antioxidant activity of various tea extracts in relation to their antimutagenicity J. Agric. Food Chem. 1995 43 27 32 10.1021/jf00049a007 95. Gao X. Ohlander M. Jeppsson N. Björk L. Trajkovski V. Changes in antioxidant effects and their relationship to phytonutrients in fruits of Sea Buckthorn ( Hippophae rhamnoides J. Agric. Food Chem. 2000 48 1485 1490 10.1021/jf991072g 10820047 96. Huang L. Bell R.W. Dell B. Woodward J. Rapid nitric acid digestion of plant material with an open-vessel microwave system Commun. Soil Sci. Plant Anal. 2004 35 427 440 10.1081/css-120029723 97. European Standard Commitee Food Products—Determination of Trace Elements—Pressure Mineralization European Standard Committee Brussels, Belgium 2014 98. SS-EN 15505:2008 Swedish Institute for Standards Foodstuffs–Determination of Trace elements—Determination of Sodium and Magnesium By Flame Atomic Absorption Spectrometry (AAS) After Microwave Digestion Swedish Institute for Standards Stockholm, Sweden 2008 Available online: https://www.sis.se/en/produkter/food-technology/general-methods-of-tests-and-analysis-for-food-products/ssen155052008/ (accessed on 5 September 2025) 99. SS-EN 14082:2003 Swedish Institute for Standards Foodstuffs—Determination of Trace Elements—Determination of Lead, Cadmium, Zinc, Copper, Iron and Chromium By Atomic Absorption Spectrometry (AAS) After Dry Ashing Swedish Institute for Standards Stockholm, Sweden 2003 Available online: https://trust.sis.se/en/produkter/food-technology/general-methods-of-tests-and-analysis-for-food-products/ssen14082/ (accessed on 5 September 2025) 100. Stanisz A. The Accessible Course of Statistics with Use the STATISTICA PL for Medicine Examples. Basic Statistics StatSoft Polska Kraków, Poland 2006 Volume 1 Figure 1 Antioxidant capacity (ABTS, FRAP, and DPPH) of the tested milk beverages. M—milk; E—erythritol; S—stevia; Cl-Ci—clove–cinnamon; Cl-Tu—clove–turmeric; Ci-Tu—cinnamon–turmeric; 2.5, 5, 7.5, 10—share of spice mixture [%]; aq—aqueous solutions of spice mixtures; control samples: aq/Cl-Ci/10, aq/Cl-Tu/10, aq/Ci-Tu/10, M/E, M/S. - - - Marker of ABTS, FRAP, and DPPH values of control samples; small letters indicate statistically not significant differences between samples: a–d for ABTS values, a’–e’ for FRAP values, and a″–e″ for DPPH values; p Supplementary Materials Supplementary Table S1A–I Figure 2 Correlation between FRAP, ABTS, and DPPH of the tested milk beverages. Figure 3 Total polyphenol content (TPC) of the tested milk beverages. M—milk; E—erythritol; S—stevia; Cl-Ci—clove–cinnamon; Cl-Tu—clove–turmeric; Ci-Tu—cinnamon–turmeric; 2.5, 5, 7.5, 10—share of spice mixture [%]; aq—aqueous solutions of spice mixtures; control samples: M/E, M/S, aq/Cl-Ci/10, aq/Cl-Tu/10, aq/Ci-Tu/10; small letters indicate statistically not significant differences between samples: a″–d″ for Cl-Ci mixture, a′–h′ for Cl-Tu mixture, a–u for Ci-Tu mixture; p Supplementary Materials Supplementary Table S2A–C Figure 4 Correlation between total polyphenol content (TPC) and antioxidant activity (FRAP, ABTS, and DPPH) of the tested milk beverages. Figure 5 Correlation between antioxidant activity—ABTS ( A B C Figure 6 Additive, synergistic, and antagonistic effect of compounds of the tested beverages on ABTS ( A B C D p ijms-26-08813-t001_Table 1 Table 1 Three-way ANOVA demonstrating the effect of the type of spice mixture, its share [%], and the type of sweetener and their interactions for the antioxidant capacity (ABTS, FRAP, and DPPH) of tested beverages.  SS df MS F  p  ABTS FRAP DPPH ABTS FRAP DPPH ABTS FRAP DPPH ABTS FRAP DPPH Spice mixture 925,913.45 1,098,966.53 296,869.05 2 462,956.72 549,483.26 148,434.52 6978.81 8002.66 1630.08 <0.000 <0.000 <0.000 Share of spice mixture [%] 1,453,763.15 553,273.34 155,128.85 3 484,587.71 184,424.44 51,709.61 7304.88 2685.95 567.86 <0.000 <0.000 <0.000 Sweetener 2014.93 2413.71 3899.39 1 2014.93 2413.71 3899.39 30.37 35.15 42.82 <0.000 <0.000 <0.000 Spice mixture * 213,038.15 166,834.52 31,892.37 6 35,506.35 27,805.75 5315.39 535.23 404.96 58.37 <0.000 <0.000 <0.000 Spice mixture * 186.96 2058.26 1485.58 2 93.48 1029.13 742.79 1.40 14.98 8.15 0.251 <0.000 <0.001 Share of spice mixture [%] * sweetener 182.49 1529.49 813.76 3 60.83 509.83 271.25 0.916 7.42 2.97 0.437 <0.001 0.037 Spice mixture * 1851.95 1803.66 1344.61 6 308.65 300.61 224.10 4.65 4.37 2.46 <0.001 <0.001 0.032 SS—type III sum of square, df—degree of freedom, MS—mean square; F—F value, p p ijms-26-08813-t002_Table 2 Table 2 Tukey’s post hoc HSD test for the main effects of the three-way ANOVA demonstrating the effect of the type of spice mixture, its share [%], and the type of sweetener on the antioxidant capacity (ABTS, FRAP, and DPPH) of the tested beverages.  Mean ± SD  p  ABTS FRAP DPPH Spice mixture     Cl-Ci 301.11 ± 159.05 a 261.15 ± 109.90 a 137.72 ± 52.96 a a,b Cl-Tu 305.35 ± 159.13 b 258.00 ± 106.01 b 141.32 ± 57.64 b Ci-Tu 94.93 ± 58.63 ab 32.63 ± 18.06 ab 21.59 ± 18.98 ab Share of spice mixture [%]     2.5 111.16 ± 50.17 abc 79.87 ± 49.96 abc 47.26 ± 30.68 abc a–f 5.0 176.70 ± 85.44 ade 153.00 ± 95.37 ade 83.31 ± 52.01 ade 7.5 209.38 ± 89.93 bdf 218.56 ± 128.72 bdf 113.51 ± 69.29 bdf 10.0 437.94 ± 178.91 cef 284.27 ± 165.61 cef 156.76 ± 80.37 cef Sweetener     E 238.37 ± 164.85 188.94 ± 144.20 106.58 ± 76.98 <0.000 S 229.21 ± 167.75 178.91 ± 134.64 93.83 ± 67.72 SD—standard deviation, p p ijms-26-08813-t003_Table 3 Table 3 Three-way ANOVA demonstrating the effect of the type of spice mixture, its share [%], and the type of sweetener and their interactions for the total polyphenol content in the tested beverages.  SS df MS F  p Spice mixture 12,823.25 2 6411.62 573.76 <0.000 Share of spice mixture [%] 10,784.40 3 3594.80 321.69 <0.000 Sweetener 2312.73 1 2312.73 206.96 <0.000 Spice mixture * share of spice mixture [%] 3305.92 6 550.98 49.30 <0.000 Spice mixture * sweetener 691.53 2 345.76 30.94 <0.000 Share of spice mixture [%] * sweetener 426.79 3 142.26 12.73 <0.000 Spice mixture*share of spice mixture [%] * sweetener * 144.08 6 24.01 2.14 0.058 SS—type III sum of square, df—degree of freedom, MS—mean square; F—F value, p p ijms-26-08813-t004_Table 4 Table 4 Tukey’s post hoc HSD test for main effects of the three-way ANOVA demonstrating the effect of the type of spice mixture, its share [%], and the type of sweetener on the total polyphenol content of the tested beverages. TPC [mg GAE/100 g] Spice Mixture Share of Spice Mixture [%] Sweetener Cl-Ci Cl-Tu Ci-Tu 2.5 5 7.5 10 E S 27.28 ± 15.75 29.49 ± 18.24 3.94 ± 3.87 5.99 ± 4.88 15.93 ± 11.05 24.22 ± 16.80 34.80 ± 21.52 25.15 ± 20.49 15.32 ± 14.04 a TPC—total polyphenol content; GAE—gallic acid equivalent; spice mixture—clove–cinnamon (Cl-Ci)/ clove–turmeric (Cl-Tu)/ cinnamon–turmeric (Ci-Tu); share of spice mixture—2.5/5/7.5/10 [%]; sweetener—erythritol (E)/ stevia (S) ; p ijms-26-08813-t005_Table 5 Table 5 Three-way ANOVA demonstrating the effect of the type of spice mixture, its share [%], and the type of sweetener and their interactions for the content of mineral elements (Ca, Mg, Fe, Zn, and Cu) of the tested beverages.  SS df MS F  p  Ca [mg/100 g] Mg [mg/100 g] Fe Zn [µg/100 g] Cu [µg/100 g] Ca [mg/100 g] Mg [mg/100 g] Fe Zn [µg/100 g] Cu [µg/100 g] Ca [mg/100 g] Mg [mg/100 g] Fe Zn [µg/100 g] Cu [µg/100 g] Spice mixture 1275.2 239.7 310,681.7 14,426.6 25,654.9 2 637.6 119.8 155,340.8 7213.3 12,827.4 175.1 19,509.7 3326.3 505.0 2627.2 <0.000 Share of spice mixture [%] 272.2 1678.5 154,226.0 23,328.6 11,328.3 3 90.7 559.5 51,408.7 7776.2 3776.1 24.9 91,095.2 1100.8 544.4 773.4 <0.000 Sweetener 1524.9 106.4 9986.9 430.2 38,789.6 1 1524.9 106.4 9986.9 430.2 38,789.6 418.8 17,327.3 213.8 30.1 7944.4 <0.000 Spice mixture * share of spice mixture [%] 180.7 61.4 98,116.4 12,900.9 5127.9 6 30.1 10.2 16,352.7 2150.1 854.7 8.3 1666.1 350.2 150.5 175.0 <0.000 Spice mixture * sweetener 501.6 48.8 141,804.0 19,319.8 2243.6 2 250.8 24.4 70,902.0 9659.9 1121.8 68.9 3968.6 1518.2 676.3 229.8 <0.000 Share of spice mixture [%] * sweetener 243.8 4.6 47,417.7 9332.8 2452.4 3 81.3 1.5 15,805.9 3110.9 817.5 22.3 250.9 338.4 217.8 167.4 <0.000 Spice mixture * share of spice mixture [%] * sweetener 268.8 21.7 86,279.4 18,506.1 6819.7 6 44.8 3.6 14,379.9 3084.4 1136.6 12.3 588.0 307.9 215.9 232.8 <0.000 SS—type III sum of square, df—degree of freedom, MS—mean square; F—F value, p ; p ijms-26-08813-t006_Table 6 Table 6 Tukey’s post hoc HSD test for main effects of three-way ANOVA demonstrating the effect of the type of spice mixture, its share [%], and the type of sweetener on the content of mineral elements (Ca, Mg, Fe, Zn, and Cu) of the tested beverages.  Mean ± SD  p  Ca Mg Fe Zn Cu Spice mixture       Cl-Ci 102.85 ± 18.90 ± 784.63 ± 257.56 ± 79.87 ± a–c Cl-Tu 105.77 ± 22.73 ± 743.49 ± 285.54 ± 57.08 ± Ci-Tu 111.61 ± 20.32 ± 648.76 ± 280.99 ± 39.96 ± Share of spice mixture [%]       2.5 109.37 ± 14.92 ± 696.99 ± 257.08 ± 48.29 ± a–f 5.0 106.27 ± 19.04 ± 696.98 ± 266.02 ± 52.53 ± 7.5 106.63 ± 22.36 ± 714.63 ± 276.86 ± 58.24 ± 10.0 104.70 ± 26.27 ± 793.92 ± 298.82 ± 76.75 ± Sweetener       E 102.76 ± 19.60 ± 735.83 ± 272.58 ± 79.07 ± a S 110.73 ± 21.70 ± 715.43 ± 276.81 ± 38.87 ± SD—standard deviation, p p ijms-26-08813-t007_Table 7 Table 7 Correlation between antioxidant activity—ABTS, FRAP, DPPH and mineral elements (Ca, Mg, Fe, Zn, and Cu) in the tested beverages.  ABTS FRAP DPPH  r  p r  p r  p Ca [mg/100 g] −0.471 0.0000 −0.539 0.0000 −0.580 0.0000 Mg [mg/100 g] 0.619 0.0000 0.500 0.0000 0.512 0.0000 Fe [µg/100 g] 0.665 0.0000 0.654 0.0000 0.643 0.0000 Zn [µg/100 g] 0.300 0.003 0.143 0.165 0.117 0.257 Cu [µg/100 g] 0.568 0.0000 0.564 0.0000 0.566 0.0000 Statistical significance p ijms-26-08813-t008_Table 8 Table 8 Characteristics of nutritional values and polyphenol content of raw materials used in the production of the tested beverages per 100 g. Nutrients Semi-Skimmed Ground Clove Ground Cinnamon Ground Turmeric Sweetener, Sweetener, Erythritol Ref Energy [kcal] 50 274 247 312 0 0 [ 83 1 84 2 Macronutrients       Protein [g] 3.3 6.0 4.0 9.7 0 0 Fat [g] 2.0 13.0 1.2 3.3 0 0 Carbohydrates [g] 4.8 65.5 80.6 67.1 100 0 Mineral elements       Calcium [mg] 120 632 1000 168 0 nd Magnesium [mg] 11 259 60 208 0 nd Iron [µg] 20 11,800 8320 55,000 0 nd Zinc [µg] 480 2320 1830 4500 0 nd Copper [µg] 6 368 339 1300 0 nd Phenolic compounds       [ 85 86 4 TPC [mg GAE] 0 3 16,047.50 9700.00 2117.00 0 3 0 3 Phenolic acids [mg]       Hydroxybenzoic acids       Gallic acid  458.19     2-hydroxybenzoic acid   0.70    Protocatechuic acid  0.52 1.16    Syringic acid  0.79 0.78    Hydroxycinnamic acids       Caffeic acid   24.20    p-Coumaric acid  8.49 0.55    Flavonoids [mg]       Flavonols       Kaempferol  23.80     Quercetin  28.40     Curcuminoids [mg]       Bisdemethoxycurcumin    1237.50   Curcumin    2213.57   Demethoxycurcumin    1982.50   Other polyphenols [mg]       Acetyl eugenol  2075.10     Eugenol  12,592.93     Cinnamaldehyde  749 4      1 2 3 4 86 Table 1 ijms-26-08813-t009_Table 9 Table 9 Conditions for determining mineral elements by the FAAS/FAES method. Parameters Ca Mg Fe Zn Cu Wavelength [nm] 285.2 422.7 372.0 213.9 327.4 Gap [mm] 0.5 0.5 0.2 1.0 0.2 Burner height [cm] 3.0 3.0 3.0 3.0 3.0 Acetylene/oxygen flows [l/h] 70/60 70/60 70/60 70/60 70/60 ",
  "metadata": {
    "Title of this paper": "Rapid nitric acid digestion of plant material with an open-vessel microwave system",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469906/"
  }
}