{
  "title": "Paper_340",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12483892 PMC12483892.1 12483892 12483892 41041340 10.3389/fimmu.2025.1653738 1 Immunology Original Research  Xrcc6 He Yijie  1  2  3  † Li Jin  1  2  3  † Guo Linlong  1  2 Chen Mu  1  2 Pan Haiqing  1  2 Li Zhanqing  1  2 Tian Hua  1  2 Yu Huan  1  2 Zhou Yuhong  1  2  * Xiao Hongwen  1  2  *  1 Department of Basic Medicine, Key Laboratory Of Functional and Clinical Translational Medicine, Xiamen Medical College Xiamen, Fujian China  2 Department of Basic Medicine, Institute of Respiratory Diseases Xiamen Medical College of Respiratory Diseases, Xiamen Medical College Xiamen, Fujian China  3 Harbin Medical University Harbin, Heilongjiang China Edited by: Yachen Shi Reviewed by: Zheng Liu  Kai Huang  Saad Ilyas Baig *Correspondence: Hongwen Xiao, xiaohongwen@xmmc.edu.cn zyh2023@xmmc.edu.cn †These authors have contributed equally to this work and share first authorship 17 9 2025 2025 16 480569 1653738 25 6 2025 26 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 He, Li, Guo, Chen, Pan, Li, Tian, Yu, Zhou and Xiao. 2025 He, Li, Guo, Chen, Pan, Li, Tian, Yu, Zhou and Xiao https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction Myocardial ischemia-reperfusion (I/R) injury remains a major challenge in the treatment of ischemic heart disease. The DNA damage repair gene Xrcc6 has been implicated in cardiovascular pathology, but its role in myocardial I/R injury and its regulation by natural compounds remains unclear. We aimed to elucidate the role of Xrcc6 in I/R injury and to investigate the cardioprotective effects of the flavonoid Fisetin through Xrcc6-targeted modulation. Methods We integrated bulk and single-cell RNA sequencing to analyze cardiomyocyte subtypes and gene expression profiles, and constructed co-expression modules using high-dimensional weighted gene co-expression network analysis (hdWGCNA). Trajectory inference and intercellular communication analyses were performed to assess cell fate dynamics and immune regulation. Molecular docking and dynamics simulations were used to evaluate Fisetin–Xrcc6 interactions. In vivo murine models of I/R injury were employed to confirm transcriptomic findings and to assess Fisetin’s cardioprotective mechanisms. Results Transcriptomic analysis revealed significant downregulation of Xrcc6 post-I/R, with single-cell data highlighting vCMs3 as a reparative cardiomyocyte subtype whose abundance correlated with Xrcc6 expression. Pseudotime analysis positioned vCMs3 at early differentiation stages with dynamic Xrcc6 expression along the trajectory. CIBERSORT and CellChat linked Xrcc6 to macrophage polarization and immune regulation. Docking simulations demonstrated stable Fisetin–Xrcc6 binding (binding free energy: −7.55 kcal/mol). In vivo, Fisetin upregulated Xrcc6, reduced DNA damage (γH2A.X suppression), modulated inflammatory responses, and improved cardiac function after I/R injury. Discussion Our study identifies Xrcc6 as a dual regulator of cardiomyocyte fate determination and immune modulation during myocardial I/R injury. Fisetin confers cardioprotection by targeting Xrcc6, offering mechanistic insights into DNA repair–immune crosstalk and providing a potential therapeutic strategy for ischemic heart disease. ischemia-reperfusion XRCC6 Fisetin molecular dynamics DNA damage The author(s) declare financial support was received for the research and/or publication of this article. Details of all funding sources should be provided, including grant numbers if applicable. Please ensure to add all necessary funding information, as after publication this is no longer possible. This project was supported by Xiamen Natural Science Foundation Project (No. 3502Z20227075 to Hongwen Xiao, No. 3502Z202373125 to Yuhong Zhou), Natural Science Foundation of Fujian Provincial (No. 2023J05287 to Hongwen Xiao, No. 2022J011385 to Zhanqing Li, NO. 2022J011411 to Huan Yu), Science and technology project of Xiamen Medical College (No. K2023–13 to Hongwen Xiao), the National Natural Science Foundation of China (No. 82400361 to Hongwen Xiao). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Inflammation 1 Introduction Cardiovascular diseases (CVDs) remain one of the leading causes of morbidity and mortality worldwide, with ischemic heart disease (IHD) contributing significantly to this burden ( 1 3 4 5 6 7 8 9 10 Among the multifactorial mechanisms implicated in I/R injury, oxidative stress-induced DNA damage ( 11 12 13 14 15 13 16 17 Xrcc6 18 19 Xrcc6 20 The recent emergence of single-cell RNA sequencing (snRNA-seq) has provided powerful tools to dissect cellular heterogeneity within cardiac tissue under physiological and pathological conditions. Unlike traditional bulk RNA sequencing, snRNA-seq enables the identification of distinct cell subpopulations, as well as the tracking of their transcriptional states and fate trajectories at single-cell resolution ( 21 22 23 Natural compounds derived from traditional Chinese medicine have attracted increasing attention in cardiovascular research due to their multi-target effects, low toxicity, and oral availability ( 24 25 26 27 28 Given this background, the objectives of the present study are threefold: (1) to investigate the role of Xrcc6 Xrcc6 Xrcc6 2 Methods 2.1 Establishment of an in vitro To simulate myocardial ischemia-reperfusion (I/R) injury in vitro 22 The isolated cardiomyocytes were filtered through a cell strainer, centrifuged, and seeded onto culture dishes pre-coated with 0.1% poly-L-lysine. Cells were maintained in DMEM/F12 medium supplemented with 10% fetal bovine serum (FBS) and incubated at 37°C in a humidified atmosphere containing 5% CO 2 To model oxidative injury associated with I/R, cardiomyocytes were incubated in serum-free medium containing 100 μM H 22 2.2 Bulk RNA sequencing of primary cardiomyocytes undergoing ischemia-reperfusion injury Total RNA was extracted from cardiomyocytes using TRIzol reagent (Invitrogen, USA) according to the manufacturer’s instructions. RNA purity and concentration were assessed using a NanoDrop 2000 spectrophotometer (Thermo Scientific, USA), while RNA integrity was evaluated using an Agilent 2100 Bioanalyzer (Agilent Technologies, Santa Clara, CA, USA). Transcriptome libraries were constructed using the VAHTS Universal V5 RNA-seq Library Prep Kit (Vazyme, China), following the manufacturer’s protocol. Bulk RNA sequencing and subsequent data analysis were conducted by OE Biotech Co., Ltd. (Shanghai, China). 2.2.1 Identification and functional characterization of DNA damage repair genes via multi-database integration To systematically identify genes involved in DNA damage repair (DDR), we integrated multiple curated databases. Specifically, we intersected gene sets from the Human DNA Repair Genes database ( 29  Supplementary Table 1 For sample clustering analysis, principal component analysis (PCA) was performed. Gene expression data were first normalized using z-score transformation. Dimensionality reduction was then conducted using the prcomp stats Differential expression analysis was carried out using the DESeq2 30 To explore the biological functions of differentially expressed genes (DEGs), Gene Ontology (GO) enrichment analysis was performed using the clusterProfiler 31 org.Hs.eg.db p 2.2.2 Immune cell infiltration analysis CIBERSORT ( 32 CIBERSORT To further investigate the relationship between gene expression and immune infiltration, Spearman correlation analysis was conducted between the expression of key genes and the estimated proportions of immune cell subtypes. Results were visualized using hierarchical clustering heatmaps and scatter plots, enabling a comprehensive characterization of the immune landscape and its association with gene expression patterns in the I/R injury microenvironment. 2.3 Single-cell RNA sequencing analysis of cardiac tissue from a mouse ischemia-reperfusion injury model 2.3.1 Data quality control and preprocessing Stringent quality control (QC) criteria were applied to preprocess single-cell RNA sequencing (snRNA-seq) data. The following thresholds were used to filter out low-quality cells while retaining biologically informative populations ( 1 omicverse 33 34 sccomposite 35 Harmony 36  Supplementary Figure S2 Detailed metadata for all samples, including GEO accession IDs, treatment conditions, and sequencing parameters, are provided in  Supplementary Table 2 2.3.2 Dimensionality reduction, clustering, and cell type annotation Following batch correction, snRNA-seq data were subjected to dimensionality reduction, unsupervised clustering, and cell type identification. The first 50 Harmony-corrected principal components were used to construct a k-nearest neighbors (k-NN) graph (k = 15), representing cellular similarity. Non-linear dimensionality reduction was then performed using the UMAP algorithm for visualization of the cellular landscape. Unsupervised clustering was conducted using the Leiden 37 Each cell cluster was manually annotated based on this integrated approach to ensure high-confidence classification. 2.3.3 Identification of cardiomyocyte subtypes From the clustered dataset, cardiomyocytes were extracted for focused analysis. These cells were subjected to a separate round of Leiden clustering to identify putative cardiomyocyte subtypes. To validate the biological relevance of each subtype, the following analyses were conducted: (1) Identification of subtype-specific differentially expressed genes (DEGs) using thresholds of log FC p clusterProfiler p.adjust Finally, UMAP visualization was used to map the spatial distribution of distinct functional subtypes. The relative abundance of each subtype was quantified under different experimental conditions to reveal dynamic changes associated with ischemia-reperfusion injury. 2.3.4 Abundance analysis of cardiomyocyte subpopulations To systematically assess the dynamic changes in cardiomyocyte subpopulation abundance, we applied the miloR 38 Using the top 50 principal components, we constructed a k-nearest neighbor graph and defined cell neighborhoods using a refined strategy. For each sample, the distribution of cells across neighborhoods was computed. A generalized linear model (GLM) was applied to test for differences in neighborhood abundance between conditions, and a distance matrix was computed to evaluate the spatial relationships among neighborhoods. The statistical significance threshold was set at P Significantly altered neighborhoods (|logFC| > 1) were visualized by projecting them onto the UMAP embedding. Swarm plots were used to depict logFC changes for each cardiomyocyte subpopulation, where blue indicates enrichment in the normal control (NC) group and red indicates enrichment in the ischemia-reperfusion (I/R) group. All plots were generated and optimized using the ggplot2 package. This approach provided a high-resolution view of compositional shifts in cardiomyocyte populations under pathological conditions, offering new insights into cellular heterogeneity during cardiac injury. 2.3.5 hdWGCNA analysis of cardiomyocyte subpopulations and key gene identification To explore the regulatory architecture of gene expression across cardiomyocyte subtypes, we employed high-dimensional weighted gene co-expression network analysis ( 39 The analysis pipeline was as follows: First, snRNA-seq data were preprocessed, and meta cells were constructed based on UMAP embeddings to reduce data sparsity. The expression matrix was normalized, and genes expressed in at least 5% of cells were retained using the “fraction” filtering method. A soft-thresholding power was determined to ensure scale-free topology, followed by the construction of a signed topological overlap matrix (TOM) and hierarchical clustering to define gene modules. To assess the biological relevance of each module, we calculated module eigengenes (hMEs) and gene connectivity scores (kME). The top 25 hub genes from each module were selected for downstream analysis. Module scores were computed using the UCell Additionally, marker genes for each cardiomyocyte subtype were identified using Seurat’s FindAllMarkers function. Overlap between module genes and cell-type marker genes was quantified using the GeneOverlap ggplot2 patchwork To identify functional key genes, we intersected the list of differentially expressed DNA damage response related genes (derived from bulk RNA-seq) with hub genes identified in the hdWGCNA network. This Venn-based integration strategy pinpointed candidate genes that were both significantly dysregulated and centrally positioned within co-expression networks. These genes were considered key regulators of cardiomyocyte function in the context of I/R injury. By combining differential expression analysis with network centrality, this strategy enhances the robustness and biological relevance of subsequent functional validation efforts. 2.3.6 Pseudotime analysis of cardiomyocyte subpopulations To investigate the dynamic trajectories of cardiomyocyte development, we employed a multi-step integrative pseudotime analysis strategy. Initially, CytoTRACE2 40 Using the UMAP embedding and the batch-corrected principal component matrix (X_pca_harmony), the top 50 principal components were used as input features. Trajectory root points were determined based on CytoTRACE2-inferred differentiation scores. To construct developmental lineages, we applied the Slingshot 41 PAGA For high-resolution trajectory sampling, we integrated the Palantir 42 To resolve complex trajectory structures such as branching and cyclic transitions, we also utilized the VIA 43 All gene expression matrices used in trajectory analysis were first imputed using the MAGIC 2.3.7 Cell–cell communication analysis To investigate differences in intercellular communication networks under distinct experimental conditions, we performed systematic cell–cell interaction analysis using the CellChat 44 Independent CellChat objects were constructed for both the normal control (NC) and ischemia-reperfusion (I/R) groups. The computeCommunProb function was used to quantify communication probabilities between cell subpopulations, while the computeCommunProbPathway function was employed to identify specific signaling pathway interactions. The ligand–receptor interaction database was sourced from CellChatDB.mouse n This analysis enabled a comparative view of intercellular signaling landscapes between physiological and pathological states, providing mechanistic insights into how cardiomyocyte and non-cardiomyocyte populations coordinate during I/R injury. 2.4 Molecular docking and molecular dynamics simulation of Fisetin with Xrcc6 2.4.1 Molecular docking To investigate the potential binding mode between Fisetin and the Xrcc6 45 AutoDock Vina 46 CB-DOCK2 47 Subsequently, the docking was refined using Vina’s scoring function to predict the optimal binding conformation of Fisetin at the active site. The binding free energy was calculated to evaluate the interaction strength, providing a reliable structural basis for the following molecular dynamics (MD) simulations. 2.4.2 Molecular dynamics simulation To further assess the stability of the Fisetin–Xrcc6 interaction, molecular dynamics simulations were conducted using GROMACS 2022 48 49 52 2.5 Protective effects and mechanistic validation of Fisetin on myocardial ischemia-reperfusion injury 2.5.1 Animals and treatment Six-week-old C57BL/6 male mice were obtained from SLAC Experimental Animal (Shanghai, China) and were housed at 22–24 °C in a 12 h/12 h light/dark cycle with unrestricted access to a standard diet and tap water. After acclimatization feeding, the eight-week-old male mice were randomly divided into four groups: Sham control (Sham), Fisetin treatment (Fisetin), I/R model (I/R), and I/R + Fisetin (I/R+Fisetin). One week before establishing the myocardial I/R injury model, oral gavage was used to provide 40 mg kg-1/day of Fisetin ( B20953  Figure 1 Figure 1 Transcriptomic profiling of mRNA expression changes in primary mouse cardiomyocytes. (A) 22 (B) (C) Xrcc6 Ogg1 Pole Neil3 (D) (E) https://BioRender.com/k32w6og A series of scientific visuals: (A) A schematic of the experimental process using WT neonatal mice for mRNA sequencing with heart dissociation and treatments. (B) A 3D PCA plot differentiating gene expression (NC vs. I/R). (C) A volcano plot indicating regulated genes showing log2(fold change) against -log10(p-value). (D) A bubble chart of the top ten Gene Ontology (GO) terms, showing enrichment in processes like DNA repair. (E) A circular bar plot displaying gene categories under molecular function, biological process, and cellular component, with the number of genes and rich factor indicated by color intensity. 2.5.2 Establishment of mouse myocardial I/R injury model Adult male C57BL/6 mice were weighed and anesthetized by intraperitoneal injection of avertin (200 mg/kg). After tracheal intubation, mice were connected to a small animal ventilator. The chest skin was disinfected with povidone-iodine, followed by thoracotomy to expose the heart. The left anterior descending coronary artery (LAD) was ligated with 7–0 suture to induce myocardial ischemia for 45 minutes, followed by reperfusion for 24 hours. Sham-operated mice underwent the same procedure except for the ligation step. 2.5.3 Echocardiography Mice were anesthetized with avertin (200 mg/kg) and echocardiography was performed using the VINNO D700 high-resolution ultrasound imaging system (VINNO Corporation, Suzhou, China). M-mode echocardiography was used to measure ejection fraction (EF) and fractional shortening (FS). Three consecutive cardiac cycles were recorded for analysis. Successful occlusion of the artery was confirmed by ST- segment elevation on electrocardiogram (ECG). Evaluations were performed 24 hours after I/R injury, with corresponding sham and model groups serving as controls. 2.5.4 TTC staining for infarct size At 24 hours post-I/R, mice were euthanized by cervical dislocation under anesthesia. Hearts were rapidly excised, rinsed in 0.9% saline, and sectioned. Heart slices were incubated in 2% triphenyltetrazolium chloride (TTC) solution (Solarbio, China) at 37°C in the dark. Viable myocardium stained red, while infarcted areas remained pale. Images were captured using a stereomicroscope (Nikon, Japan), and infarct size was quantified using Image Pro Plus 6.0 software. 2.5.5 Lactate dehydrogenase activity assay Serum samples were analyzed for LDH activity. LDH levels were measured using a LDH assay kit according to the manufacturer’s instructions (Jiancheng, China). Briefly, 20 μL of sample, 250 μL substrate buffer, and 5 μL coenzyme I added per well and incubated at 37°C for 15 minutes. Then, 250 μL of 2,4-dinitrophenylhydrazine was added, mixed, and incubated for another 15 minutes at 37°C. Next, 250 μL of 0.4 mol/L NaOH was added, mixed, and incubated at room temperature for 5 minutes. Absorbance at 450 nm was measured by microplate reader. LDH activity (U/L) was calculated as:LDH activity = [(OD_sample - OD_control)/(OD_standard - OD_blank)] × standard concentration × dilution factor × 1000. 2.5.6 Creatine kinase-MB content assay Serum samples were analyzed for CK-MB activity. CK-MB levels were measured using a commercial mouse CK-MB ELISA kit according to the manufacturer’s instructions (JONLNBIO, China). Briefly, 100 μL of standards or samples were added to wells and incubated at 37°C for 90 minutes. Wells were washed, followed by incubation with 100 μL biotinylated antibody at 37°C for 60 minutes. After washing, 100 μL HRP-conjugated reagent was added and incubated at 37°C for 30 minutes. After washing again, 90 μL substrate solution was added and incubated for 15 minutes at 37°C. Finally, 50 μL stop solution was added, and absorbance was measured at 450 nm. CK-MB concentrations were calculated based on the standard curve. 2.5.7 Western blot analysis Myocardial tissues were lysed in appropriate lysis buffer, and the lysates were centrifuged at 13500 rpm for 20 minutes at 4°C. Supernatants were collected and stored at −80°C. Protein concentrations were determined using the BCA assay. Samples containing 70 μg protein were mixed with 5× loading buffer and PBS, boiled at 100°C for 10 minutes, and subjected to SDS-PAGE. Proteins were transferred onto nitrocellulose membranes by wet transfer. After blocking, membranes were then incubated with secondary anti-rabbit or anti-mouse polyclonal antibodies, including rabbit anti-phospho-histone H2A.X antibody (Cat#: R381558, 1:1000, ZEN-BIOSCIENCE, Chengdu, China), rabbit KU70,Xrcc6 polyclonal antibody (Cat#: 10723-1-AP, 1:1000, Proteintech, Wuhan, China), rabbit β-actin antibody(Cat#: GB15003-100, 1:5000, Servicebio, Wuhan, China) and Goat anti-rabbit IgG H&L (Cat#: 511203, 1:10000, ZEN-BIOSCIENCE, Chengdu, China). After incubation with secondary antibodies, protein bands were detected using ChemiDoc MP system (Bio-Rad Laboratories, USA). β-actin was used as a loading control, and band intensities were quantified for comparison. 2.5.8 ELISA for IL-6 and TNF-α Serum was collected as above. IL-6 and TNF-α levels were quantified using commercial ELISA kits according to the manufacturer’s protocols (Liankebio, China). Absorbance was measured at 450 nm, and cytokine concentrations were calculated based on standard curves. 2.5.9 Synthesis and transfection of overexpression plasmids and siRNAs The siRNA of Xrcc6  Tables 1-A, B Xrcc6 Table 1-A The sequences of siRNAs for Xrcc6 siRNA sense 5’- GGAAGAGAUAGUUUGAUUUTT -3’ antisense 5’- AAAUCAAACUA UCUCUUCCTG -3’ Table 1-B The sequences of negative control for siRNA. NC sense 5’- UUCUCCGAACGUGUCACGUTT -3’ antisense 5’- ACGUGACACGUUCGGAGAATT -3’ 2.5.10 Detection of cellular ROS production Cellular ROS of cultured cardiomyocytes was examined by fluorometric intracellular ROS Kit (Beyotime, Shanghai, China) according to the manufacturer’s instructions. The samples were observed under a fluorescence microscope (Zeiss, Jena, Germany). 2.5.11 Statistical analysis Data are expressed as the mean ± SEM. All data and results were explicated in blinded fashion. GraphPad Prism 8.0 software with post-hoc post-hoc 3 Results 3.1 Establishment of primary cardiomyocyte I/R injury model and gene expression analysis In this study, an in vitro  Figure 1A 22 Principal component analysis (PCA) was then performed on the transcriptomic data. The 3D PCA plot (  Figure 1B Subsequent differential expression analysis focused on DNA damage response (DDR)–related gene sets. A volcano plot (  Figure 1C Neil3 Pole Rpa2 Rad51 Rdm1 Xrcc6 Ogg1 Ercc5 Ercc1 Polk Furthermore, Gene Ontology (GO) enrichment analysis of the differentially expressed genes (DEGs) was conducted.  Figure 1D  Figure 1E 3.2 Subtype analysis of cardiomyocytes and identification of key genes in the I/R mouse model To explore cardiomyocyte subtype-specific responses in ischemia/reperfusion (I/R) injury, we conducted a comprehensive analysis of single-nucleus RNA-sequencing (snRNA-seq) data from the I/R mouse model (GEO: GSE270888  Figure 2A  Supplementary Table 2  Supplementary Figure S1A  Supplementary Figure S1C  Supplementary Figure S1B Figure 2 Single-nucleus RNA-seq analysis of the murine myocardial ischemia/reperfusion (I/R) model. (A) (B) (C) (D) (E) miloR (F) (G) (H) (I) (J) This composite image consists of multiple panels illustrating a scientific study. Panel A shows an experimental overview involving mice and sequencing. Panel B presents a clustered plot of cardiomyocytes' cell types. Panel C shows a bar chart of cell distribution by groups. Panel D is a bar graph of gene ontology enrichment for cell markers. Panel E displays a network graph indicating overlaps with varying sizes and log fold changes. Panel F includes plots of scale-free topology and connectivity. Panel G is a scatter plot showing module and marker overlap. Panel H features a heat map, while panel I depicts a gene network. Panel J presents a Venn diagram contrasting module genes and RNA-seq differentially expressed genes. Prior to clustering, batch effects across replicates were corrected using Harmony, which effectively minimized technical variation while preserving biologically meaningful heterogeneity (  Supplementary Figure S2 Given this, we focused on cardiomyocyte subpopulations and their functional roles. Dimensionality reduction and unsupervised clustering identified four distinct ventricular cardiomyocyte subtypes (vCMs1–vCMs4) (  Figure 2B  Figure 2C miloR  Figure 2E Gene Ontology (GO) enrichment of subtype-specific marker genes revealed distinct functional signatures (  Figure 2D To elucidate regulatory mechanisms underlying these subtypes, we applied the high-dimensional Weighted Gene Co-expression Network Analysis (hdWGCNA) algorithm to construct a gene co-expression network (  Figure 2F  Supplementary Figures S1D–G  Figure 2G  Figure 2H  Figure 2I To identify candidate genes involved in I/R injury and repair, we intersected M3 module genes with differentially expressed DNA repair genes from our bulk RNA-seq analysis. This integrative approach yielded five potential key regulators: Mgmt Pola1 Paxip1 Xrcc6 Rev1  Figure 2J 3.3 Pseudotime trajectory analysis of cardiomyocyte subtypes and identification of cell fate–associated genes To systematically elucidate the mechanisms underlying cardiomyocyte fate decisions during differentiation, we employed and compared three trajectory inference algorithms: Slingshot, Palantir, and StaVIA. CytoTRACE2 analysis first revealed that the vCMs3 population exhibited the highest developmental potential, suggesting that these cells represent an early, less differentiated state and may play a critical role in myocardial repair following injury (  Figures 3A–C  Figure 3D  Supplementary Figure S3A  Supplementary Figure S3B  Figure 3E  Supplementary Figure S3C Figure 3 Integrated trajectory inference reveals cardiomyocyte differentiation pathways and key regulatory factors. (A–C) (D) (E) (F–G) (H) Xrcc6 (I) (J) Xrcc6 A series of scientific visualizations showing data analysis related to cell differentiation and gene expression. Panels A and B depict scatter plots comparing CytoTRACE scores and phenotypes. Panel C presents a box plot of predicted ordering by CytoTRACE across different cell phenotypes. Panel D shows a PAGA Slingshot graph, while Panel E features a StaVIA Streamplot illustrating vCMs cell interactions. Panels F and G display lineage likelihoods for specific cell lineages. Panel H is a heatmap of gene expression across cell types. Panel I contains pseudotime heatmaps for lineages, and Panel J is a line graph of Xrcc6 intensity over time. Focusing on the two major differentiation branches identified by VIA (  Figures 3F–G Xrcc6  Figure 3H Xrcc6  Figures 3I, J Xrcc6 In summary, our study uncovers substantial heterogeneity among cardiomyocyte subpopulations and delineates critical fate bifurcations during myocardial differentiation in the context of disease. Notably, vCMs3 cells exhibit high developmental plasticity and undergo marked trajectory shifts and functional reprogramming under pathological conditions. Xrcc6 3.4  Xrcc6 To investigate the dynamic changes in immune cell composition during myocardial injury and repair, and to elucidate the role of the key regulatory factor Xrcc6  Supplementary Table 3  Figures 4A, B Figure 4 Xrcc6 links DNA repair to immune cell heterogeneity in ischemia-reperfusion. (A) (B) (C) (D) (E) (F–G) Panel A depicts a stacked bar chart showing the cell composition across different samples with color-coded groups. Panel B includes a bar graph illustrating the proportions of various cells, highlighting significant differences. Panel C presents a heatmap of correlations between specific genes and cell types, with red indicating positive and blue indicating negative correlations. Panel D shows a network plot illustrating relationships among cell types and genes with colored lines for positive and negative relations. Panel E features a lollipop plot of correlation coefficients between XRCC6 and immune cells. Panels F and G contain scatter plots with regression lines demonstrating correlations between XRCC6 expression and M0/M1 macrophages, respectively. To further characterize the expression of regulatory genes across immune cell subtypes, we constructed a correlation heatmap between DNA repair-related genes and immune cell populations. Several genes displayed strong positive correlations with multiple immune cell types. Notably, Xrcc6  Figure 4C Xrcc6  Figure 4D Xrcc6 Xrcc6  Figures 4E–G To assess the overall impact of I/R on intercellular communication, we quantified the number and intensity of cell–cell interactions in both groups (  Supplementary Figure S3D  Figure 5A  Figure 5B  Figures 5C, D  Figures 5E, F Figure 5 Characterization of intercellular communication networks before and after I/R. (A) (B) (C) (D) (E) (F) A series of data visualizations depicting cellular interactions. Panel A shows bar graphs of inferred interaction numbers and strengths for NC and I/R conditions. Panel B includes scatter plots illustrating incoming versus outgoing interaction strength, with dot size representing count. Panel C displays interaction networks between cell types for NC and I/R conditions. Panel D contains heatmaps of differential interaction numbers and strengths across cell types. Panel E features circular diagrams representing LAMININ signaling pathway networks for NC and I/R. Panel F presents a dot plot of gene interactions, with dot size indicating p-value and color representing communication probability. In summary, Xrcc6 Xrcc6 Xrcc6 Xrcc6 3.5 Molecular docking and stability validation of Fisetin targeting Xrcc6 This study employed molecular docking and molecular dynamics simulation techniques to analyze the interaction between Fisetin and Xrcc6 Xrcc6 3.5.1 Molecular docking The molecular docking analysis indicated a strong interaction between Fisetin and the Xrcc6  Figure 6A Xrcc6 Xrcc6  Figure 6B Xrcc6 Figure 6 Molecular docking analysis reveals high-affinity binding of Fisetin to Xrcc6. (A) Xrcc6 Xrcc6 (B) Xrcc6 Molecular visualization of the Xrcc6 protein with a focus on the binding site. Panel A shows a 3D structure with highlighted cavity and ligand interactions, including hydrophobic and hydrogen bonds. The Vina score is negative seven point six with a cavity volume of one thousand seven hundred twenty cubic angstroms. Panel B illustrates a 2D interaction diagram, detailing specific residues and interaction types like Van der Waals and Pi-Alkyl. Residues labeled include ILE, LYS, HIS, ASP, VAL, among others, showing various interaction types in different colors. 3.5.2 Conformational stability of the complex A 100 ns molecular dynamics simulation was conducted to assess the overall stability of the quercetin– Xrcc6  Figure 7A  Figure 7B Figure 7 Structural dynamics and energetic analysis of protein-ligand binding via molecular dynamics simulation. (A) (B) (C) (D) (E) (F) (G) (H) (I) (J)  1 kcal/mol = 4.184 kJ/mol A series of scientific graphs and models: Graph A shows RMSD vs. simulation time; B displays radius of gyration (Rg) vs. time; C illustrates RMSF across residues; D depicts distances in protein-ligand interactions; E shows SASA vs. time; F and J are 3D molecular structures with color-coded regions; G displays energy variables over time; H shows binding energy across residues; I depicts hydrogen number vs. time. The images provide insights into molecular dynamics simulations and structural analyses. 3.5.3 Local flexibility and dynamic behavior RMSF (Root Mean Square Fluctuation) analysis was performed to evaluate the flexibility of each residue in the protein (  Figure 7C 3.5.4 Binding site and spatial behavior analysis The spatial distance and binding mode between the small molecule and the protein were analyzed using centroid distance evolution and Buried SASA (Solvent Accessible Surface Area) analysis. The distance between the binding site residues and the small molecule’s centroid fluctuated slightly at the beginning of the simulation but rapidly stabilized thereafter (  Figure 8D  Figure 7E  Figure 7F 3.5.5 Molecular interaction mechanisms Hydrogen bond analysis showed that approximately 1–4 hydrogen bonds were maintained between the small molecule and Xrcc6  Figure 7I  Table 2  Figure 7J Table 2 Hydrogen bond frequency between small molecule and protein.  Table with binding interactions between donors and acceptors, showing percentages of occupancy. Seven interactions are listed, with varying occupancy rates. Adjacent plot indicates occupancy over time, ranging from zero to one hundred nanoseconds, with darker areas representing higher occupancy. 3.5.6 Binding free energy analysis The dynamic changes in electrostatic (ELE) and van der Waals (VDW) interaction energies indicated stabilization in the latter part of the simulation (  Figure 7G  Table 3 Table 3 Binding energy and its components at steady state (units: kcal/mol). Complex   Δ E v d w   Δ E e l e   Δ E p o l   Δ E n o n p o l   Δ E M M P B S A   − T Δ S   Δ G b i n d * Protein-Ligand –38.843 ± 0.161 -23.129 ± 0.420 58.672 ± 0.839 –4.255 ± 0.007 –7.554 ± 0.594 5.775 ± 0.621 –1.780 ± 0.704   * Δ G b i n d = Δ E v d w + Δ E e l e + Δ E p o l + Δ E n o n p o l − T Δ S 3.5.7 Identification of key residues The binding energy decomposition analysis identified key residues that significantly contribute to the binding of the small molecule (  Supplementary Table 4  Figure 7H In conclusion, this study systematically analyzed the binding stability and interaction mechanisms of Fisetin with Xrcc6 Xrcc6 Xrcc6 3.5.8 Fisetin attenuates myocardial ischemia–reperfusion injury in mice To evaluate the protective effects of Fisetin against myocardial ischemia–reperfusion (I/R) injury, we pretreated 6–8-week-old male C57BL/6J mice with Fisetin at different doses (20, 40, or 80 mg/kg) for one week prior to I/R induction. Cardiac function was subsequently assessed by echocardiography. As expected, I/R significantly impaired cardiac function; however, mice pretreated with 40 or 80 mg/kg Fisetin exhibited marked improvement, with no significant differences observed between these two groups (  Figures 8B–F  Figures 8G, H  Figures 8I, J  Figures 8K, L Figure 8 Protective effects of Fisetin on myocardial ischemia-reperfusion injury in mice. (A) (B–F) (G, H) (I, J) (K, L) (M, N) Xrcc6 https://BioRender.com/hrbcp0z Scientific illustration showing several panels with data on fisetin's effects in an ischemia-reperfusion (I/R) model. Panel A shows the chemical structure of fisetin. Panel B includes echocardiography images under different conditions: sham, I/R, and fisetin treatments at various concentrations. Panels C-F present bar graphs of cardiac functions: ejection fraction, fractional shortening, LVIDs, and LVIDd. Panel G includes heart cross-sections showing infarct size, with panel H providing corresponding graph data. Panels I-L show graphs of LDH, CK-MB, IL-6, and TNF levels. Panels M and N display Western blot results for Xrcc6 and γH2A.X proteins. To further elucidate the underlying mechanism, we examined the expression of two key proteins involved in the repair of DNA double-strand breaks (DSBs): Xrcc6 Xrcc6 Xrcc6  Figures 8M, N Xrcc6 3.5.9  Xrcc6 22 Using a primary cardiomyocyte culture model, we further investigated the role of Xrcc6 22 Xrcc6  Figure 9A  Figure 9B Xrcc6  Figures 9C–F  Figure 9G Xrcc6 22  Figures 9H–N Figure 9 Effects of Xrcc6 on cardiomyocytes injury induced by H2O2. (A) Xrcc6 (B) Xrcc6 (C, D) Xrcc6 (E) Xrcc6 (F) (G) Xrcc6 (H) Xrcc6 (I) Xrcc6 (J, K) Xrcc6 (L) Xrcc6 (M) (N) Xrcc6 A series of scientific charts and images showing the effects of si-Xrcc6 and OE-Xrcc6 on cell viability, LDH levels, IL-6, TNF, ROS, and γH2AX expression in cells with and without hydrogen peroxide treatment. Images E and L display fluorescence microscopy results indicating cellular changes. Bar graphs (A-D, F, G, H-K, M, N) compare different groups' responses, with p-values indicating statistical significance. Western blot images (G, N) present protein expression levels. 3.5.10 Knockdown of Xrcc6 To further determine whether the cardioprotective effects of Fisetin are mediated by Xrcc6 Xrcc6 Xrcc6 22  Figure 10A Xrcc6  Figure 10B  Figure 10C Xrcc6  Figures 10D, E Xrcc6 Figure 10 Knockdown of Xrcc6 abrogates the protective effects of Fisetin in H2O2-treated cardiomyocytes. (A) Xrcc6 (B) Xrcc6 (C) Xrcc6 (D) (E) Graphs and images assessing the effects of various treatments on cell health. (A) Bar graph of relative cell viability across different treatments, showing significant differences indicated by p-values. (B) Bar graph of relative LDH levels under different conditions, with noted significant p-values. (C) Western blot and bar graph showing relative γH2A.X/β-actin ratios with significant differences. (D) Four fluorescence microscopy images demonstrating ROS presence under various conditions. (E) Bar graph of ROS relative fluorescence highlighting significant p-values between treatments. 4 Discussion Ischemia-reperfusion (I/R) injury, recognized as a “second hit” during the clinical management of acute coronary syndrome, remains inadequately understood at the molecular level, making it a focal point in cardiovascular research ( 53 54 55 Xrcc6 Xrcc6 Initially, we established a hydrogen peroxide (H 22 Xrcc6 Xrcc6 Xrcc6 To explore the tissue-specific function of Xrcc6 Xrcc6 Xrcc6 Xrcc6 In addition to the cellular stress response in myocardial cells, I/R injury induces substantial changes in the composition and functional status of immune cells. CIBERSORT-based immune cell infiltration analysis revealed a significant increase in M0 macrophages and a decrease in M1 pro-inflammatory macrophages after I/R, suggesting a dynamic transition towards a reparative inflammatory response. Correlation analysis showed a positive correlation between Xrcc6 Xrcc6 Xrcc6 Building upon our deep exploration of Xrcc6 56 58 Xrcc6 Xrcc6 Xrcc6 in vivo Animal experiments further validated the mechanism derived from molecular simulations. Fisetin intervention significantly improved myocardial function in I/R mice, including enhanced ejection fraction (EF) and fractional shortening (FS), and reduced left ventricular end-diastolic diameter (LVIDd). Biochemical markers showed that Fisetin effectively lowered LDH and CK-MB levels, indicating significant protection against myocardial cell injury. ELISA analysis of inflammatory cytokines revealed that Fisetin markedly inhibited the release of IL-6 and TNF-α, demonstrating its potent anti-inflammatory effects. More importantly, Fisetin significantly upregulated Xrcc6 in vitro in vivo Xrcc6 Although this study has made significant progress in elucidating the mechanisms and pharmacological validation, several limitations remain. First, our research primarily relies on expression associations and simulation data, and has yet to directly validate the pathogenic and protective roles of Xrcc6 Xrcc6 in vivo  Xrcc6 Xrcc6 Emerging evidence suggests that Xrcc6 Xrcc6 Xrcc6 59 Xrcc6 Xrcc6 Xrcc6 Collectively, these findings suggest that Xrcc6 Xrcc6 In conclusion, this study, through multi-omics and multi-level analysis, unveils the multifaceted roles of Xrcc6 Xrcc6 Xrcc6 5 Conclusion This study systematically elucidates the pivotal role of the DNA repair factor Xrcc6 Xrcc6 Xrcc6 Xrcc6 Xrcc6 We also confirmed the molecular basis for Fisetin, a natural flavonoid, as a potential targeted modulator of Xrcc6 Xrcc6 Xrcc6 In summary, Xrcc6 Xrcc6 Abbreviations I/R, Ischemia/Reperfusion; Xrcc6, X-ray repair cross-complementing protein 6 (Ku70); vCMs1–4, Ventricular cardiomyocyte subtypes 1–4; snRNA-seq, Single-nucleus RNA sequencing; hdWGCNA, High-dimensional Weighted Gene Co-expression Network Analysis; NHEJ, Non-Homologous End Joining; HR, Homologous Recombination; DEGs, Differentially Expressed Genes; GO, Gene Ontology; PCA, Principal Component Analysis; ROS, Reactive Oxygen Species; ELISA, Enzyme-Linked Immunosorbent Assay; TNF-α, Tumor Necrosis Factor Alpha; IL-6, Interleukin-6; LAD, Left Anterior Descending artery; TTC, Triphenyltetrazolium Chloride; LDH, Lactate Dehydrogenase; CK-MB, Creatine Kinase-MB; ECG, Electrocardiogram; RMSD, Root Mean Square Deviation; RMSF, Root Mean Square Fluctuation; SASA, Solvent Accessible Surface Area; MD, Molecular Dynamics; PME, Particle Mesh Ewald; PAGA, Partition-based Graph Abstraction; UMAP, Uniform Manifold Approximation and Projection; FIS, Fisetin; Rg, Radius of gyration; VINNO, VINNO ultrasound system; BCA, Bicinchoninic Acid assay; SDS-PAGE, Sodium Dodecyl Sulfate-Polyacrylamide Gel Electrophoresis; IgG, Immunoglobulin G; γH2A.X, Phosphorylated histone H2A.X; DSBs, Double-Strand Breaks; mRNA, messenger RNA; NC, Normal Control; RNAiMAX, Lipofectamine RNAiMAX; GAFF, General AMBER Force Field; NSFC, National Natural Science Foundation of China. Data availability statement The RNA sequencing data generated in this study have been deposited in public repositories. Raw RNA-seq data are available in the NCBI Sequence Read Archive (SRA) under accession number PRJNA1282757. Processed data, including raw counts and FPKM matrices, are deposited in the NCBI Gene Expression Omnibus (GEO) under accession number GSE301051 Ethics statement The work was performed under the approval of the Animal Ethics Committee associated with the Fujian Provincial Science and Technology Project (Grant No. 20220901006). Author contributions YH: Conceptualization, Data curation, Formal Analysis, Investigation, Methodology, Writing – original draft, Writing – review & editing. JL: Conceptualization, Data curation, Formal Analysis, Investigation, Methodology, Writing – original draft, Writing – review & editing. LG: Data curation, Investigation, Writing – original draft. MC: Validation, Visualization, Writing – original draft. HP: Validation, Visualization, Writing – original draft. ZL: Funding acquisition, Investigation, Writing – original draft. HT: Methodology, Supervision, Writing – original draft. HY: Methodology, Supervision, Writing – original draft. YZ: Writing – review & editing, Funding acquisition, Project administration, Supervision, Writing – original draft. HX: Writing – review & editing, Funding acquisition, Project administration, Supervision, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fimmu.2025.1653738/full#supplementary-material Supplementary Figure 1 Single-cell transcriptomic analysis reveals distinct cardiac cell types and gene co-expression module characteristics. (A) (B) (C) (D) (E) (F) (G) Supplementary Figure 2 Batch effect correction of snRNA-seq data using Harmony. (A) (B) Supplementary Figure 3 Comparative Analysis of Cardiomyocyte Developmental Trajectories and Condition-Specific Signaling Pathways Using Multiple Inference Algorithms. (A) (B) (C) K (D) References 1 Roth GA Johnson C Abajobir A Abd-Allah F Abera SF Abyu G Global, regional, and national burden of cardiovascular diseases for 10 causes, 1990 to 2015 J Am Coll Cardiol 2017 70 1 25 10.1016/j.jacc.2017.04.052 28527533 PMC5491406 2 Prabhakaran D Jeemon P Sharma M Roth GA Johnson C Harikrishnan S The changing patterns of cardiovascular diseases and their risk factors in the states of India: the Global Burden of Disease Study 1990-2016 Lancet Glob Health 2018 6 e1339–e51 10.1016/S2214-109X(18)30407-8 30219317 PMC6227386 3 Zhang L Tong Z Han R Guo R Zang S Zhang X Global, regional, and national burdens of ischemic heart disease attributa ble to smoking from 1990 to 2019 J Am Heart Assoc 2023 12 e028193 10.1161/JAHA.122.028193 36718860 PMC9973632 4 Li X Ge Z Kan J Anjum M Xie P Chen X Intravascular ultrasound-guided versus angiography-guided percutaneous coronary intervention in acute coronary syndromes (IVUS-ACS): a two-stage, multicentre, randomised trial Lancet. 2024 403 1855–65 10.1016/S0140-6736(24)00282-4 38604212 5 Koh HP Nagarajah JR Hassan H Ross NT Bleeding characteristics and mortality outcomes following ST-elevation myocardial infarction thrombolysis: a 5-year analysis in an Asian population World J Emerg Med 2024 15 433–40 10.5847/wjem.j.1920-8642.2024.077 39600808 PMC11586147 6 Zhang S Yan F Luan F Chai Y Li N Wang YW The pathological mechanisms and potential therapeutic drugs for myocardial ischemia reperfusion injury Phytomedicine. 2024 129 155649 10.1016/j.phymed.2024.155649 38653154 7 Bugger H Pfeil K Mitochondrial ROS in myocardial ischemia reperfusion and remodeling Biochim Biophys Acta (BBA) - Mol Basis Disease. 2020 1866 165768 10.1016/j.bbadis.2020.165768 32173461 8 Algoet M Janssens S Himmelreich U Gsell W Pusovnik M Van den Eynde J Myocardial ischemia-reperfusion injury and the influence of inflammation Trends Cardiovasc Med 2023 33 357–66 10.1016/j.tcm.2022.02.005 35181472 9 Bland AR Payne FM Ashton JC Jamialahmadi T Sahebkar A The cardioprotective actions of statins in targeting mitochondrial dysfunction associated with myocardial ischaemia-reperfusion injury Pharmacol Res 2022 175 105986 10.1016/j.phrs.2021.105986 34800627 10 Zhang S Yan F Luan F Chai Y Li N Wang Y-W The pathological mechanisms and potential therapeutic drugs for myocardial ischemia reperfusion injury Phytomedicine. 2024 129 155649 10.1016/j.phymed.2024.155649 38653154 11 Xiang M Lu Y Xin L Gao J Shang C Jiang Z Role of oxidative stress in reperfusion following myocardial ischemia and its treatments Oxid Med Cell Longev 2021 2021 6614009 10.1155/2021/6614009 34055195 PMC8149218 12 Hu L Wang Z Carmone C Keijer J Zhang D Role of oxidative DNA damage and repair in atrial fibrillation and ischemic heart disease Int J Mol Sci 2021 22 (8) 3838 10.3390/ijms22083838 33917194 PMC8068079 13 Corbucci Gian G Perrino C Donato G Ricchi A Lettieri B Troncone G Transient and reversible deoxyribonucleic acid damage in human left ventricle under controlled ischemia and reperfusion JACC. 2004 43 1992–9 10.1016/j.jacc.2004.01.040 15172403 14 Tamanoi F Yoshikawa K Overview of DNA damage and double-strand breaks Enzymes. 2022 51 1 5 10.1016/bs.enz.2022.08.001 36336403 15 Zhu X-Z Qiu Z Lei S-Q Leng Y Li W-Y Xia Z-Y The role of P53 in myocardial ischemia-reperfusion injury Cardiovasc Drugs Ther 2025 39 195 209 10.1007/s10557-023-07480-x 37389674 16 Williams GJ Hammel M Radhakrishnan SK Ramsden D Lees-Miller SP Tainer JA Structural insights into NHEJ: building up an integrated picture of the dynamic DSB repair super complex, one component and interaction at a time DNA Repair (Amst). 2014 17 110–20 10.1016/j.dnarep.2014.02.009 24656613 PMC4102006 17 Chakraborty S Schirmeisen K Lambert SA The multifaceted functions of homologous recombination in dealing with replication-associated DNA damages DNA Repair (Amst). 2023 129 103548 10.1016/j.dnarep.2023.103548 37541027 18 Jette N Lees-Miller SP The DNA-dependent protein kinase: A multifunctional protein kinase with roles in DNA double strand break repair and mitosis Prog Biophys Mol Biol . 2015 117 194 205 10.1016/j.pbiomolbio.2014.12.003 25550082 PMC4502593 19 Frit P Amin H Zahid S Barboule N Hall C Matharu G Structural and functional insights into the interaction between Ku70/80 and Pol X family polymerases in NHEJ Nat Commun 2025 16 4208 10.1038/s41467-025-59133-2 40328761 PMC12056208 20 Xiao H Zhang M Wu H Wu J Hu X Pei X CIRKIL exacerbates cardiac ischemia/reperfusion injury by interacting with ku70 Circ Res 2022 130 e3 e17 10.1161/CIRCRESAHA.121.318992 35105170 21 Dong Y Kang Z Zhang Z Zhang Y Zhou H Liu Y Single-cell profile reveals the landscape of cardiac immunity and identifies a cardio-protective Ym-1hi neutrophil in myocardial ischemia–reperfusion injury Sci Bulletin. 2024 69 949–67 10.1016/j.scib.2024.02.003 38395651 22 Ge X Meng Q Wei L Liu J Li M Liang X Myocardial ischemia-reperfusion induced cardiac extracellular vesicles harbour proinflammatory features and aggravate heart injury J Extracellular Vesicles. 2021 10 e12072 10.1002/jev2.12072 33664937 PMC7902529 23 Sun K Li YY Jin J A double-edged sword of immuno-microenvironment in cardiac homeostasis and injury repair Signal Transduct Target Ther 2021 6 79 10.1038/s41392-020-00455-6 33612829 PMC7897720 24 Bu W Zhang Z Ocansey DKW Yu Z Yang X Liu Z Research on natural products from traditional Chinese medicine in the treatment of myocardial ischemia-reperfusion injury Am J Transl Res 2022 14 1952–68 10.1142/S0192415X23500015 35422902 PMC8991172 25 Arai Y Watanabe S Kimira M Shimoi K Mochizuki R Kinae N Dietary intakes of flavonols, flavones and isoflavones by Japanese women and the inverse correlation between quercetin intake and plasma LDL cholesterol concentration J Nutr 2000 130 2243–50 10.1093/jn/130.9.2243 10958819 26 Zheng W Feng Z You S Zhang H Tao Z Wang Q Fisetin inhibits IL-1β-induced inflammatory response in human osteoarthritis chondrocytes through activating SIRT1 and attenuates the progression of osteoarthritis in mice Int Immunopharmacology. 2017 45 135–47 10.1016/j.intimp.2017.02.009 28213268 27 Léotoing L Wauquier F Guicheux J Miot-Noirault E Wittrant Y Coxam V The polyphenol fisetin protects bone by repressing NF-κB and MKP-1-dependent signaling pathways in osteoclasts PloS One 2013 8 e68388 10.1371/journal.pone.0068388 23861901 PMC3701685 28 Prem PN Sivakumar B Boovarahan SR Kurian GA Recent advances in potential of Fisetin in the management of myocardial ischemia-reperfusion injury-A systematic review Phytomedicine. 2022 101 154123 10.1016/j.phymed.2022.154123 35533608 29 Wood RD LM Human DNA repair genes 2020 https://www.mdanderson.org/documents/Labs/Wood-Laboratory/human-dna-repair-genes.html 30 Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 31 Yu G Thirteen years of clusterProfiler Innovation (N Y) 2024 5 6 100722 10.1016/j.xinn.2024.100722 39529960 PMC11551487 32 Newman AM Liu CL Green MR Gentles AJ Feng W Xu Y Robust enumeration of cell subsets from tissue expression profiles Nat Methods 2015 12 453–7 10.1038/nmeth.3337 25822800 PMC4739640 33 Zeng Z Ma Y Hu L Tan B Liu P Wang Y OmicVerse: a framework for bridging and deepening insights across bulk and single-cell sequencing Nat Commun 2024 15 5983 10.1038/s41467-024-50194-3 39013860 PMC11252408 34 Wolf FA Angerer P Theis FJ SCANPY: large-scale single-cell gene expression data analysis Genome Biol 2018 19 15 10.1186/s13059-017-1382-0 29409532 PMC5802054 35 Hu H Wang X Feng S Xu Z Liu J Heidrich-O’Hare E A unified model-based framework for doublet or multiplet detection in single-cell multiomics data Nat Commun 2024 15 5562 10.1038/s41467-024-49448-x 38956023 PMC11220103 36 Korsunsky I Millard N Fan J Slowikowski K Zhang F Wei K Fast, sensitive and accurate integration of single-cell data with Harmony Nat Methods 2019 16 1289–96 10.1038/s41592-019-0619-0 31740819 PMC6884693 37 Müller-Bötticher N Sahay S Eils R Ishaque N SpatialLeiden: spatially aware Leiden clustering Genome Biol 2025 26 24 10.1186/s13059-025-03489-7 39920839 PMC11804054 38 Dann E Henderson NC Teichmann SA Morgan MD Marioni JC Differential abundance testing on single-cell data using k-nearest neighbor graphs Nat Biotechnol 2022 40 245–53 10.1038/s41587-021-01033-z 34594043 PMC7617075 39 Morabito S Reese F Rahimzadeh N Miyoshi E Swarup V hdWGCNA identifies co-expression networks in high-dimensional transcriptomics data Cell Rep Methods 2023 3 (6) 100498 10.1016/j.crmeth.2023.100498 37426759 PMC10326379 40 Kang M Armenteros JJA Gulati GS Gleyzer R Avagyan S Brown EL Mapping single-cell developmental potential in health and disease with interpretab le deep learning bioRxiv 2024 2024.03.19.585637 10.1101/2024.03.19.585637 38562882 PMC10983880 41 Street K Risso D Fletcher RB Das D Ngai J Yosef N Slingshot: cell lineage and pseudotime inference for single-cell transcriptomics BMC Genomics 2018 19 477 10.1186/s12864-018-4772-0 29914354 PMC6007078 42 Setty M Kiseliovas V Levine J Gayoso A Mazutis L Pe’er D Characterization of cell fate probabilities in single-cell data with Palantir Nat Biotechnol 2019 37 451–60 10.1038/s41587-019-0068-4 30899105 PMC7549125 43 Stassen SV Yip GGK Wong KKY Ho JWK Tsia KK Generalized and scalable trajectory inference in single-cell omics data with VIA Nat Commun 2021 12 5528 10.1038/s41467-021-25773-3 34545085 PMC8452770 44 Jin S Plikus MV Nie Q CellChat for systematic analysis of cell-cell communication from single-cell transcriptomics Nat Protoc 2025 20 180 219 10.1038/s41596-024-01045-4 39289562 45 Rivera-Calzada A Arribas-Bosacoma R Ruiz-Ramos A Escudero-Bravo P Boskovic J Fernandez-Leiro R Structural basis for the inactivation of cytosolic DNA sensing by the vaccinia virus Nat Commun 2022 13 7062 10.1038/s41467-022-34843-z 36400800 PMC9674614 46 Trott O Olson AJ AutoDock Vina: improving the speed and accuracy of docking with a new scoring function, efficient optimization, and multithreading J Comput Chem 2010 31 455–61 10.1002/jcc.21334 19499576 PMC3041641 47 Liu Y Grimm M W-t D M-c H Xiao Z-X Cao Y CB-Dock: a web server for cavity detection-guided protein–ligand blind docking Acta Pharmacologica Sinica. 2020 41 138–44 10.1038/s41401-019-0228-6 31263275 PMC7471403 48 Van Der Spoel D Lindahl E Hess B Groenhof G Mark AE Berendsen HJ GROMACS: fast, flexible, and free J Comput Chem 2005 26 1701–18 10.1002/jcc.20291 16211538 49 Tian C Kasavajhala K Belfon KAA Raguette L Huang H Migues AN ff19SB: amino-acid-specific protein backbone parameters trained against quantum mechanics energy surfaces in solution J Chem Theory Comput 2020 16 528–52 10.1021/acs.jctc.9b00591 31714766 50 He X Liu S Lee TS Ji B Man VH York DM Fast, accurate, and reliable protocols for routine calculations of protein-ligand binding affinities in drug design projects using AMBER GPU-TI with ff14SB/GAFF ACS Omega. 2020 5 4611–9 10.1021/acsomega.9b04233 32175507 PMC7066661 51 Hahn DF Gapsys V de Groot BL Mobley DL Tresadern G Current state of open source force fields in protein-ligand binding affinity predictions J Chem Inf Model 2024 64 5063–76 10.1021/acs.jcim.4c00417 38895959 PMC11234369 52 Valdés-Tresanco MS Valdés-Tresanco ME Valiente PA Moreno E gmx_MMPBSA: A new tool to perform end-state free energy calculations with GROMACS J Chem Theory Comput 2021 17 6281–91 10.1021/acs.jctc.1c00645 34586825 53 Paraskevaidis IA Iliodromitis EK Vlahakos D Tsiapras DP Nikolaidis A Marathias A Deferoxamine infusion during coronary artery bypass grafting ameliorates lipid peroxidation and protects the myocardium against reperfusion injury: immediate and long-term significance Eur Heart J 2004 26 263–70 10.1093/eurheartj/ehi028 15618054 54 Xiang Q Yi X Zhu X-H Wei X Jiang D-S Regulated cell death in myocardial ischemia&x2013;reperfusion injury Trends Endocrinol Metab 2024 35 219–34 10.1016/j.tem.2023.10.010 37981501 55 Zhao W Zhang X Zhao J Fan N Rong J SUMOylation of Nuclear γ-Actin by SUMO2 supports DNA Damage Repair against Myocardial Ischemia-Reperfusion Injury Int J Biol Sci 2022 18 4595–609 10.7150/ijbs.74407 35864967 PMC9295056 56 Ding H Li Y Chen S Wen Y Zhang S Luo E Fisetin ameliorates cognitive impairment by activating mitophagy and suppressing neuroinflammation in rats with sepsis-associated encephalopathy CNS Neurosci Ther 2022 28 247–58 10.1111/cns.13765 34837343 PMC8739041 57 Syed DN Adhami VM Khan N Khan MI Mukhtar H Exploring the molecular targets of dietary flavonoid fisetin in cancer Semin Cancer Biol 2016 40–41 130–40 10.1016/j.semcancer.2016.04.003 27163728 PMC5067175 58 Pal HC Diamond AC Strickland LR Kappes JC Katiyar SK Elmets CA Fisetin, a dietary flavonoid, augments the anti-invasive and anti-metastatic potential of sorafenib in melanoma Oncotarget. 2016 7 1227–41 10.18632/oncotarget.6237 26517521 PMC4811456 59 Wang Z Lin H Hua F Hu Z-W Repairing DNA damage by XRCC6/KU70 reverses TLR4-deficiency-worsened HCC development via restoring senescence and autophagic flux Autophagy. 2013 9 925–7 10.4161/auto.24229 23518600 PMC3672303 ",
  "metadata": {
    "Title of this paper": "Repairing DNA damage by XRCC6/KU70 reverses TLR4-deficiency-worsened HCC development via restoring senescence and autophagic flux",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483892/"
  }
}