{
  "title": "Paper_27",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490212 PMC12490212.1 12490212 12490212 40858103 10.1016/j.xcrm.2025.102305 S2666-3791(25)00378-7 102305 1 Article AZ14289671 is a highly selective and blood-brain barrier penetrant irreversible TKI that targets EGFRExon20 insertions Swaih Aisha M. 1 8 Talbot Sara 1 8 Savoca Adriana 2 Thorpe Hannah 1 Flemington Vikki 1 Phillips Benjamin 5 Colclough Nicola 3 McCoull William 4 Radeva Veronika 1 Hargreaves David 5 Packer Martin J. 4 Felisberto-Rodrigues Catarina 5 Thomson Clare 4 Orme Jonathan P. 5 Deane Carly 3 Smith Aaron 3 Johnström Peter 6 Schou Magnus 6 McWilliams Lisa 5 Davey Paul 4 Enget Marianne 4 O'Neill Daniel 5 Cosulich Sabina 7 Floc’h Nicolas nicolas.floch@astrazeneca.com 1 9 ∗ 1 2 3 4 5 6 7 ∗ nicolas.floch@astrazeneca.com 8 These authors contributed equally 9 Lead contact 16 9 2025 25 8 2025 6 9 498186 102305 24 1 2025 24 4 2025 24 7 2025 25 08 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary Current clinical therapeutics against non-small cell lung cancer (NSCLC) with epidermal growth factor receptor (EGFR) exon 20 insertion (EGFRExon20Ins) mutations yield limited responses particularly against brain metastases; therefore, there is a need for an effective tyrosine kinase inhibitor (TKI). AZ14289671 is an oral, potent, irreversible, selective, and blood-brain barrier penetrant TKI targeting EGFRExon20Ins mutations while sparing wild-type (WT) EGFR. Preclinical assessments using cell lines, cell line-derived xenograft, and patient-derived xenograft models harboring EGFRExon20Ins demonstrate that AZ14289671 exhibits strong signaling pathway inhibition and highly sustained tumor regression against multiple EGFRExon20Ins, whereas its activity against WT is minimal. Additionally, AZ14289671 can cross the blood-brain barrier. This has the potential to improve outcomes of NSCLC patients with EGFRExon20Ins. Graphical abstract Highlights • AZ14289671 has a distinguished best-in-class profile • Efficacious and highly selective to EGFRExon20 insertions and spares wild-type EGFR • Potentially can tackle brain metastases Swaih et al. report an EGFRExon20 insertion TKI with distinct selectivity over wild-type EGFR and brain penetration properties. This small molecule could influence the EGFRExon20Ins treatment paradigm. Keywords NSCLC EGFR exon 20 insertions small molecule inhibitor pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: August 25, 2025 Introduction Lung cancer is one of the most prevalent and deadliest forms of cancer, with about 85% being non-small cell lung cancer (NSCLC). EGFR-activating mutations are one of the major oncogenic drivers representing 10%–15% in Western and 40% in Asian NSCLC populations. EGFR exon 20 insertion (EGFRExon20Ins) mutations are positioned third in their prevalence of EGFR-activating mutations, constituting approximately 1.5%–2.5% of NSCLC with over a hundred different insertions reported. 1 , 2 Several first-, second-, and third-generation tyrosine kinase inhibitors (TKIs) targeting the two most common EGFR activation mutations (Ex19del/L858R) have been developed over the past decade. Nonetheless, their activity against EGFRExon20Ins mutations remains limited. 3 , 4 , 5 , 6 , 7 6 8 , 9 , 10 , 11 Currently, there are no EGFRExon20Ins mutation-targeted small molecules with FDA approval in a first-line setting. Mobocertinib previously gained accelerated approval by the FDA for patients with NSCLC EGFRExon20Ins with an ORR of 28% in a phase 1/2 study but demonstrated limited intracranial activity. 12 13 14 15 16 Other TKIs are currently under clinical evaluation for patients with EGFRExon20Ins. Zipalertinib in a phase 1/2 clinical trial demonstrated an ORR of 38.4%, 17 , 18 19 20 18 , 21 22 , 23 , 24 , 25 Here, we describe AZ14289671, an oral, potent, irreversible, selective and blood-brain barrier (BBB) penetrant TKI targeting EGFRExon20Ins mutations. AZ14289671 is active and selective over wild-type EGFR and exhibits the ability to cross the BBB. AZ14289671 has the potential to improve outcome for patients with EGFRExon20Ins mutations including those with brain metastases, which remains an unmet need. 26 Results AZ14289671 is an EGFRExon20Ins irreversible selective TKI AstraZeneca developed a series of irreversible small molecule inhibitors to target the Exon20Ins mutant forms of the EGFR tyrosine kinase with selectivity over the wild-type form of the receptor. Starting from a high-throughput screen, selective reversible inhibitors were identified, which were elaborated into a series of compounds, which bind to EGFR kinase irreversibly by targeting the cysteine-797 residue in the ATP-binding pocket via covalent bond formation. 27 , 28 Figure 1 Figure 1 Table S1 Figure S1 Figure 1 AZ14289671 binding mode and structure (A) AZ14289671 chemical structure. (B) Modeled binding pose for AZ14289671, binding to EGFR-NPG protein, based on cocrystal PDB structure 9HBO 29 Cellular mutant selectivity and high potency across EGFRExon20Ins mutations The potency and selectivity of AstraZeneca compounds in comparison to clinical competitors were evaluated across cell lines expressing a range of predominant EGFRExon20Ins, including CRISPR-engineered NCI-H2073 (H2073) cells expressing S768_D770Dup (SVD), A763_Y764InsFQEA (ASV), and NPG, as well as a PDX cell line LXF2478 ASV WT WT WT Figures 2 Table S2 inact I Table S3 SVD WT Figures S2 ASV ASV Figures 2 Table S2 Figure 2 AZ14289671 in vitro (A) A representative pEGFR inhibition assessed by HTRF assay after 2 h of treatment with each compound against EGFRExon20Ins mutants LXF2478 ASV SVD ASV NPG WT WT WT (B) Each compound pEGFR IC50 (nmol/L) mean of at least two biological repeats with duplicates within the experiment; data presented as mean ± SD. (C) Model-estimated changes in log pIC50 (where pIC₅₀ is the negative base-10 logarithm of the IC₅₀ in molar units) between AZ14289671 and all other tested compounds. Point represents estimated median change. Range represents 95% highest posterior density interval. Dotted line represents AZ14289671. (D) Density plots of pIC50s for each compound, separated by mutational status. Ticks on the x (E) Immunoblotting of per-inhibition comparison between AZ14289671 and sunvozertinib in LXF2478 ASV WT No compound demonstrated more potency than AZ14289671 against EGFRExon20Ins cell lines, though four compounds (AZ14240475, AZ14245445, sunvozertinib, and mobocertinib) were indistinguishable at the 95% highest density interval (HDI) level ( Figure 2 Table S4 Figure 2 When comparing EGFRWT fold margin (EGFRWT IC50:EGFRExon20Ins IC50 ratio), it is noticeable that zipalertinib’s fold margin selectivity is mutant dependent. AZ14240475 shows a comparable WT fold margin range to sunvozertinib, from 4- to 16-fold and from 3- to 19-fold, respectively. AZ14289671 is highly selective against EGFRExon20Ins with a high WT margin range between 10- and 50-fold depending on the pair of cell lines used ( Figure S3 ASV WT Figure 2 To further characterize the ability of AZ14289671 to inhibit downstream signaling pathways in LXF2478 ASV Figure 3 ASV Figure 3 30 ASV Figure 3 Figure 3 Cellular inhibition of downstream signaling of EGFR by AZ14289671 in LXF2478 ASV (A) Immunoblotting after 2 or 6 h of AZ14289671 treatment showing effective inhibition in the MAPK pathway in LXF2478 ASV (B) A representative inhibition of ERK phosphorylation after 2 h treatment across compounds using HTRF assay, with mean IC50 of 32 nmol/L; data presented as mean ± SD. (C) Expression heatmap of MAPK gene signature using qPCR after 6 h of treatment with AZ14289671. Expression data are expressed as mean of three technical repeats. A two-sided Student’s t test determined statistically significant changes in gene expression. ∗ p p p p In vitro AZ14289671 maintains similar activity against EGFRExon20Ins in the presence of the T790M gatekeeper mutation in the H2073 SVD/T790M Figure S4 SVD/T790M Figure S4 HER2WT HER2YVMA Figure S5 Table S5 AZ14289671 exhibits BBB penetration properties Given that 23%–39% of patients with EGFRExon20Ins present with baseline brain metastases, 22 , 23 , 24 , 25 31 , 32 , 33 , 34 , 35 34 , 35 35 35 Table S6 29 in vivo 31 , 32 , 33 Table S6 29 31 Table S6 Figure S6 max Figure S6 Antitumor and pharmacodynamic activity of AZ14289671, sunvozertinib, zipalertinib, and mobocertinib in LXF2478 ASV WT in vivo To explore the in vivo ASV WT ASV Figure 4 WT Figure 4 WT Figure S7 ASV Figures S7 S8 S8 S9 WT Figure S8 WT Figure S7 Figure S8 Figure 4 In vivo ASV WT Antitumor activity of AZ14289671 dosed b.i.d., twice daily in LXF2478 ASV WT ASV WT ASV WT ASV WT ASV WT ASV WT ASV WT ASV WT n n p p p p To explore the relationship between efficacy and target modulation, mice bearing LXF2478 ASV WT ASV Figure 4 in vivo WT Figure 4 Next, we explored the antitumor and PK/PD activity of the competitor compounds across the same tumor models. Oral b.i.d dosing of sunvozertinib demonstrated strong dose-dependent antitumor activity ( Figures 4 ASV WT Figures 4 ASV WT ASV Figures 4 Figures 4 Figures S9 At a dose matching clinical exposure, once daily oral dosing of zipalertinib at 100 mg/kg elicited significant inhibition of tumor volume at 14 days compared to the vehicle-treated group with 125% and 92% TGI observed in LXF2478 ASV WT Figures 4 Figures 4 WT ASV ASV Figures S9 Similarly to zipalertinib, mobocertinib showed increased efficacy over AZ14289671 in the LXF2478 ASV WT Figures 4 Figures S9 Figures 4 36 , 37 The observed relationship between inhibition of EGFR phosphorylation and antitumor activity in LXF2478 ASV Figures S10 S11 WT WT Figure 4 Figures S10 S12 Tables S9–S14 Figure 4 To directly compare the maximal in vivo ASV WT in vivo Figure 5 in vivo in vivo ASV WT Figure 5 Table S7 Figure 5 Table S8 ASV WT in vitro in vivo in vitro Figure 5 Comparison of growth rate inhibition of AZ14289671, sunvozertinib, mobocertinib, and zipalertinib in LXF2478 ASV WT (A) Distribution of growth rates by compound and model. x (B) Model-estimated growth rate difference between tumor cell lines (NCI-H2073 − LXF2478). Point represents estimated median change. Range represents 95% highest posterior density interval. (C) Model-estimated change in growth rate between AZ14289671 and all other tested compounds for each tumor cell line. Point represents estimated median change. Range represents 95% highest posterior density interval. Dotted line represents AZ14289671. AZ14289671 selectively induces robust regression of tumor growth in EGFRExon20Ins PDXs models To profile the activity of AZ14289671 across a range of EGFRExon20Ins in vivo Figures 6 DNP NPH Figure 6 In vivo DNP NPH (A) Antitumor efficacy of AZ14289671 dosed b.i.d in LU3075 DNP (B) Antitumor efficacy of AZ14289671 dosed b.i.d in LU0387 DNP n (C) Pharmacokinetic and pharmacodynamic activity of AZ14289671 in samples taken 1, 6, 16, or 24 h after a single dose from mice harboring LU3075 DNP n p p p p In the LU3075 DNP Figure 6 DNP Discussion Osimertinib has transformed clinical outcomes of NSCLCs driven by canonical EGFR activating (exon 19 deletions or L858R) mutations. Despite this, NSCLC patients harboring EGFRExon20Ins have shown to be comparatively refractory to previous clinically approved TKIs. 38 39 , 40 27 , 28 The diversity and heterogeneity of the locations of EGFRExon20Ins have reportedly been shown to affect the observed efficacy of TKIs. 41 , 42 in vitro 21 , 43 , 44 in vitro in vivo 6 , 7 , 45 , 46 In vitro in vivo Floc’h et al. 3 ASV 47 DNP NPH in vivo DNP 21 NPH 21 3 The profiling of clinical compounds we examined here revealed that, despite being active against EGFRExon20Ins, they lack selectivity against EGFRWT. Dose-limiting toxicities such as rash and diarrhea have been previously linked to the lack of selectivity of TKIs against EGFRWT resulting in reduced therapeutic windows. 48 , 49 50 19 21 51 52 Here, we show that AZ14289671 exhibited a superior EGFRWT margin to mobocertinib, zipalertinib, and sunvozertinib while showing similar levels of potency across a range of EGFRExon20Ins, which indicate that AZ14289671 could have an improved therapeutic window and safety profile over current clinical candidates. Furthermore, there is high unmet need for EGFRExon20Ins-targeted therapies effective against intracranial lesions. AZ14289671 has the capacity to address this important clinical unmet need with its improved preclinical BBB properties differentiated from clinical competitors. Limitations of the study This study has several limitations, primarily the lack of clinical data to establish whether the superior pre-clinical wild-type margin of AZ14289671 corresponds to a better safety profile compared to sunvozertinib, zipalertinib, and mobocertinib, and the impact of this on the therapeutic window of AZ14289671. While we showed the activity of AZ14289671 in models comprising over 50% of the molecular subgroup of exon 20 EGFR insertions, further models could be used to evaluate its efficacy across the broader molecular subgroup. The study highlighted the activity of AZ14289671 upon the inhibition of HER2 activation, necessitating further experiments to explore its potential in HER2-driven tumor models. The study also provides limited data on the activity of AZ14289671 in L858R and exon 19 deletion EGFR-activating cell lines, warranting additional research to evaluate its therapeutic potential for patients harboring canonical EGFR-activating mutations. Resource availability Lead contact Further information and requests for resources should be directed to the lead contact, Nicolas Floc’h ( nicolas.floch@astrazeneca.com Materials availability This study did not generate new unique reagents. Data and code availability  • The data reported in this paper will be shared by the lead contact • The original code used to compare the growth rate inhibition or potency of the compounds tested has been deposited at Zenodo ( https://doi.org/10.5281/zenodo.15534119 • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments The authors would like to thank the wider 10.13039/100004325 AstraZeneca AZ14289671 AZ14289671 10.13039/100004325 AstraZeneca Author contributions Conception and design: A.M.S., S.T., A. Savoca, W.M., S.C., and N.F.; development of methodology: A.M.S., S.T., A. Savoca, B.P., W.M., C.T., and N.F.; acquisition of data (provided animals, acquired and provided facilities, etc.): A.M.S., S.T., H.T., V.F., V.R., J.P.O., C.D., P.J., M.S., L.M., P.D., M.E., D.O., and N.F.; analysis and interpretation of data (e.g., statistical analysis, biostatistics, and computational analysis): A.M.S., S.T., A. Savoca, B.P., N.C., W.M., D.H., M.J.P., C.F.-R., C.T., J.P.O., P.J., M.S., L.M., P.D., and N.F.; writing, review, and/or revision of the manuscript: A.M.S., S.T., A. Savoca, B.P., N.C., W.M., A. Smith, P.J., and N.F.; administrative, technical, or material support (i.e., reporting or organizing data and constructing databases): A.M.S., S.T., A. Savoca, N.C., W.M., J.P.O., and N.F.; study supervision: A.M.S., S.T., and N.F. Declaration of interests The authors are current or former AstraZeneca employees and shareholders. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies Phospho-EGF Receptor (Tyr1068) Antibody Cell Signaling Technology Cat#2234; RRID:AB_331701 EGF Receptor (D38B1) XP Rabbit mAb Cell Signaling Technology Cat#4267; RRID:AB_2246311 Phospho-p44/42 MAPK (Erk1/2) (Thr202/Tyr204) Antibody Cell Signaling Technology Cat#9101; RRID:AB_331646 p44/42 MAPK (Erk1/2) Antibody Cell Signaling Technology Cat#9102; RRID:AB_330744 Phospho-Akt (Ser473) (D9E) XP Rabbit mAb Cell Signaling Technology Cat#4060; RRID:AB_2315049 Akt Antibody Cell Signaling Technology Cat#9272; RRID:AB_329827 Phospho-S6 Ribosomal Protein (Ser235/236) (D57.2.2E) XP Rabbit mAb Cell Signaling Technology Cat#4858; RRID:AB_916156 S6 Ribosomal Protein (54D2) Mouse mAb Cell Signaling Technology Cat#2317; RRID:AB_2238583 Biological Samples LU3075 Crown Bioscience N/A LU0387 Crown Bioscience N/A Chemicals, peptides, and recombinant proteins AZ14289671 AstraZeneca N/A Mobocertinib AstraZeneca N/A Zipalertinib AstraZeneca N/A Sunvozertinib AstraZeneca N/A Critical commercial assays HTRF Human Phospho-EGFR (Tyr1068) Detection Kit Revvity Part #: 64EG1PEG HTRF Human and Mouse Phospho-ERK (Thr202/Tyr204) Detection Kit Revvity Part #: 64AERPET Deposited data Original code used to compare the growth rate inhibition or potency of the compounds tested This paper https://doi.org/10.5281/zenodo.15534119 Experimental models: Cell lines NCI-H2073 ATCC CRL-5918; RRID:CVCL_1521 LXF2478 Oncotest N/A A431 ATCC CRL-1555; RRID:CVCL_0037 HaCaT Professor Norbert E. Fusenig in Deutsches Krebsforschungszentrum (DKFZ) N/A NCI-H2073 EGFRD770-N771InsSVD AstraZeneca Generated as previously described by Floc’h et al. 3 NCI-H2073 EGFRV769-D770InsASV AstraZeneca Generated as previously described by Floc’h et al. 3 NCI-H2073 EGFRD770-N771InsNPG AstraZeneca Generated as previously described by Floc’h et al. 3 Experimental models: Organisms/strains Mouse: SCID: C.B-17/IcrHanHsd- Prkdc scid Envigo UK N/A Mouse: Nude: Hsd:Athymic Nude- Foxn1 nu Envigo UK N/A Mouse: Balb/c Nude: BALB/cNj-Foxn1 nu GemPharmatech Co., Ltd N/A Software and algorithms GraphPad Prism 10 GraphPad Software www.graphpad.com R R Core Team https://www.r-project.org/ Microsoft Excel Microsoft https://www.microsoft.com/en-us/microsoft-365/excel Syngene Genesys Syngene https://www.syngene.com/ Syngene Genetools Syngene https://www.syngene.com/ Real-time PCR Analysis Standard BioTools https://www.standardbio.com/ Phoenix 64 WinNonlin v8.2 Certara L.P. https://www.certara.com/software/phoenix-winnonlin/ Experimental model and study participant details Cell culture and cell lines NCI-H2073 (H2073 WT WT WT ASV in vitro in vivo SVD ASV NPG 3 2 0 Patient-derived xenografts LU0387 and LU3075 patient-derived xenografts were obtained from NSCLC patients in Hebei Medical University Fourth Hospital through collaboration with Beijing Keluoen Translational Medicine Institute with approval by the Institutional Review Boards of the hospital and the informed consents from patients. LU3075 was obtained from a 59-year-old Asian male. LU0387 was obtained from a 64-year-old Asian female. LU0387 and LU3075 PDXs were established subcutaneously in immunocompromised female nude mice by implanting patients’ surgical tumor tissues and serially re-engrafting in vivo Animals All animal studies were conducted in accordance with U.K. Home Office legislation, the Animal Scientific Procedures Act 1986, and AstraZeneca Global Bioethics policy ( https://www.astrazeneca.com/content/dam/az/Sustainability/Bioethics_Policy.pdf Studies performed with LU3075 and LU0387 patient-derived xenografts were performed at Crown Bioscience in China in BALB/c nude mice purchased from GemPharmatech Co., Ltd in China. All mice were 6–8 weeks at the time of implant and were identified via ear tags. Xenografts were established by subcutaneous surgical implantation of ∼20 mm3 into the right flank under anesthesia. Five animals were house per polysulfone IVC cage, enriched with irradiated crushed corncob bedding, cardboard cylinder, tissue paper and PC tube/club house. The housing room temperature was 20–26°C with humidity controlled at 40–70% with a 12 h light-cycle. Animals were fed ad libitum Studied performed with NCI-H2073 and LXF2478 cells were performed internally at AstraZeneca in the United Kingdom in female athymic nude and severe combined immunodeficiency disease (SCID) mice purchased from Envigo UK. All experimental work is outlined in the project licence PP329652 ad libitum Method details Compounds All compounds were synthesised by AstraZeneca. 29 For in vivo Homogeneous time resolved fluorescence (HTRF) assay All cells were seeded at 50,000 cells/well into 96-well plate overnight prior dose-response treatment with each compound using HP dispenser for 2 h (or for longer for time course studies). Mutant cells were lysed immediately while wild type cell lines (H2073 WT WT WT Immunoblotting Cells were washed with cold PBS and lysed on ice in cold RIPA buffer (ThermoFisher) supplemented with protease inhibitor cocktail, phosphatase inhibitor and 50U/mL of Benzonase Nuclease. Cells were scrapped and collected in a microcentrifuge prior centrifugation and protein quantification using BCA protein assay (ThermoFisher). For SDS-PAGE an equal amount of proteins were loaded into 4–12% gradient Bis-Tris NuPAGE Novex gels (ThermoFisher), and then transferred onto a nitrocellulose membrane using iBlot2 Gel Transfer system (ThermoFisher). Membranes were blocked in 5% milk in TBS-T and then blotted with primary antibodies phospho-EGFR Tyr1068 (Cell Signaling Technology, 2234) total EGFR (Cell Signaling Technology, 4267), phospho-ERK Thr202/Tyr204 (Cell Signaling Technology, 9101), total ERK (Cell Signaling Technology, 9102), phospho-AKT (Ser473, Cell Signaling Technology; 4060), total AKT (Cell Signaling Technology, 9272), phospho-S6 (Cell Signaling Technology, Ser235/236) 4858, total S6 (Cell Signaling Technology, 2317), vinculin (Sigma, V9131); followed by horseradish peroxidase (HRP)–conjugated secondary antibodies (Cell Signaling Technology; 7074 or 7076). Signals were detected with West Dura ECL (ThermoFisher) using a G:Box chemi XRQ (Syngene) and GeneSys (Syngene) acquisition software. Expression of MAP kinase pathway genes signature using an integrated fluidic circuit (IFC) Cells were treated with compound for 6 h prior washing with PBS and lysed in RLT buffer (Qiagen). RNA was extracted using the RNeasy 96 QIAcube HT Kit (Qiagen) with a DNAse digest as per manufactures recommendations. RNA was quantified with the Qubit Flex Fluorometer (Invitrogen), RNA purity was determined using a NanoDrop Eight (Thermo Scientific). All samples were diluted to 50 ng/μL. RNA was reverse transcribed; the resulting cDNA was subsequently preamplified with TaqMan Assays (Thermo Fisher Scientific) for 14 cycles following Standard BioTools instructions. Preamplified material and Taqman Assays were loaded onto a 192.24 Dynamic Array IFC (Standard BioTools) as per manufactures guidelines and run on an Biomark HD (Standard BioTools). TaqMan Assays: Hs00378285_g1, Hs04329643_s1, Hs00365085_m1, Hs00759776_s1, Hs00765553_m1, Hs01072272_m1, Hs00953178_m1, Hs00383361_g1, Hs00927557_m1, Hs01921749_s1, Hs01935412_s1, Hs00177127_m1, Hs01120543_m1, Hs01108271_g1 and Hs00237047_m1. CRISPR cell line generation NCI-H2073 EGFRD770-N771InsSVD/T790M pool (H2073SVD/T790M) H2073SVD cells were electroporated will be4 RNP complexed with the following gRNA 5′- ATCACGCAGCTCATGCCCTT-3′ using a Neon electroporator under the following conditions: 10 μL tip, 1400V, 20 pulse width and 2 pulses (ThermoFisher). Edited pools were expanded and assayed for T790M positivity by ddPCR (Bio-Rad) using primers 5′-CATCTGCCTCACCTCCAC-3′ and 5′-TCTTTGTGTTCCCGGACATAG-3′ and probes FAM_M790 5′-FAM-TCA[+T]C[+A][+T][+G]C[+A][+G]C-BHQ1-3′ and HEX_T790 5′-HEX-CA[+T]C[+A][+C][+G]C[+A][+G]C-BHQ1-3’. Note the bases in brackets denote locked nucleic acids (LNAs). NCI-H2170 HER2 YVMAIns (H2170HER2YVMA) NCI-H2170 cells harboring wild type HER2 were transfected using the Neon electroporator 10 μL tip, 1600V, 10 pulse width and 3 pulses (ThermoFisher) with spCas9 RNP complexed with gRNA 5′-TCCCCAGGAAGCATACGTGA-3′ and ssDNA donor oligo 5′-GGCTGTGTGGTGTTTGGGGGTGTGTGGTCTCCCATACCCTCTCAGCGTACCCTTGTCCACAGGAAGCATACGTGATGGCATATGTAATGGCTGGTGTAGGCTCACCATATGTCTCCCGCCTTCTGGGCATCTGCCTGACATCCACGGTGCAGCTGGTGACACAGCTTATGCCCTATGGCTGC-3′ encoding the A775_G776InsYVMA mutation. Edited pools were assayed for YVMA insertion by ddPCR (Bio-Rad) using primers: 5′- GTTGTCCAGGCTGGTACTTT-3′ and 5′- CAGAAGGCGGGAGACATATG-3′ and probes for WT HEX-ATGGCTGGTGTGGGCTCC-BHQ1-3′ and YVMA 5′-FAM-ATA T[+G]T[+A]A[+T]GG[+C]TGGTGTAGG-BHQ1-3’. Note the bases in brackets denote locked LNAs. Cells were subject to single cell cloned by seeding 0.3 cells/well in 384 well multi-well plates (Corning). Single cell clones were identified using the Cell Metric CLD (Advanced Instruments). Clones were screened for the presence of the Her2 YVMA insertion, with mutant clones scaled and subject to NGS amplicon sequencing (Illumina) to sequence verify the edit. Patient derived xenograft models LU3075 EGFR DNP EGFR NPH 3 3 Human efflux transporter assays Human MDR1 transfected MDCK cells (MDCKII-MDR1) were obtained from the Netherland Cancer Institute (NKI-AVL). This cell line was transfected with human BCRP internally (AstraZeneca, Shanghai, China) to generate the MDCKII-MDR1-BCRP cell line. Human MDR1 transfected MDCKI cells (MDCKI-MDR1) were obtained from the National Institutes of Health laboratories (NIH cell line). Efflux ratios (ER) were determined in MDCKII-MDR1-BCRP and MDCKI-MDR1 cell monolayers at pH 7.4. Apparent permeability coefficients Papp were determined by measuring transport across the cell monolayers in the apical to basolateral (Papp A to B) and basolateral to apical (Papp B to A) directions. Compounds were studied at 1 μM with sampling over 2 h at 37°C. Donor samples were diluted 10-fold with Hank’s balanced salt solution (HBSS) pH 7.4 and then 4-fold with acetonitrile containing internal standard, acceptor samples were diluted 4-fold directly with acetonitrile containing internal standard prior to analysis by LCMSMS. ERs were derived using the equation ER = Papp B to A/Papp A to B where Papp = dQ/dt ×1/(A x C 0 2 0 1 Rat brain binding Rat fraction unbound in brain (fu b 2 b b b Plasma binding Rat and cynomolgus macaque plasma protein binding (fu plasma plasma Rat brain/plasma ratio Kp and Kpuu Rat Kp studies were approved by the Pharmaron Institutional Animal Care and Use Committee (IACUC) and conducted in compliance with AstraZeneca Global Standards and local regulatory requirements. Male Han Wistar rats were purchased from Vital River Laboratory Animal Technology Co. Ltd (China) (8–10 weeks old, 200–300 g) and housed in polycarbonate animal cages containing corncob bedding with minimum acclimatization of 3 days prior to study start. Animals were housed in a controlled temperature and humidity with free access to food and water. Compounds were dosed in cassettes of up to 3 compounds to male Han Wistar rats via jugular vein infusion in 1:1:1 TEG:DMA:water at 2 μmol/kg/h at 4 mL/kg for 4 h. Brain and plasma samples were collected as outlined in J. Reiss et al., 2017 (Amer. Soc. Clinical Oncology, abstract). Analysis of brain homogenate and plasma compound levels was undertaken by LCMSMS following protein precipitation by 4:1 dilution with cold acetonitrile containing internal standard, centrifugation (2000g for 10 min) and 3-fold dilution with water prior to injection. Samples were quantified against calibration curves generated using serial dilution in 50% acetonitrile to cover expected concentration range. Correction of the brain concentration for the residual blood was undertaken by subtracting 0.8% of the plasma concentration from the total brain concentration. The ratio of brain to plasma, Kp, was determined and converted to Kpuu using the equation Kpuu = Kp x fu brain plasma Cynomologus Macaque microdose PET study Cynomologus Macaque PET study was undertaken using a microdose of [ 11 3 In vivo Approximately 1 million H2073 WT ASV WT ASV Mice were marked with a subcutaneous microchip to follow tumor growth and tumors were measured with an electronic caliper twice weekly. Tumor volume was calculated as 0.5 × tumor length x tumor width 2 Mice were randomized into vehicle or treatment groups with approximate mean tumor volume of 0.2–0.4 cm 3 Mice were dosed with AZ14289671 at 50 mg/kg, 25mg/kg, 12.5 mg/kg and 6.25 mg/kg. Sunvozertinib was dosed at 25 mg/kg, 12.5 mg/kg and 6.25 mg/kg. Both AZ14289671 and sunvozertinib were dosed once and twice daily. Zipalertinib was administered at 200 mg/kg, 100 mg/kg and 50 mg/kg once daily. Mobocertinib was dosed at 30 mg/kg, 15 mg/kg and 7.5 mg/kg once daily. Mice were also dosed with the appropriate vehicle as listed above. Mouse pharmacokinetics and pharmacodynamics assessments For pharmacodynamic studies, mice were implanted as described above and were randomized at a mean tumor volume of approximately 0.3–0.5 cm 3 0 Plasma samples were analyzed for total drug concentrations. Each plasma sample was prepared using an appropriate dilution factor and compared against an 11-point standard calibration curve (1–10000 nM) prepared in DMSO and spiked into blank plasma. Protein precipitation was carried out by the addition of 4 volumes of ice-cold acetonitrile containing the internal standard followed by shaking for 10 min and centrifugation at 3000 rpm for 10 min. Supernatant was then diluted in six volumes of water and analyzed via UPLC-MS/MS. Free plasma concentrations of drug were plotted and corrected for the amount of drug bound the plasma proteins in a mouse. Data was represented as the mean ± the SD of n Assessment of pharmacodynamics was conducted by western blot. Tumor fragments of ∼27mm 3 Protein lysates were normalised for protein content using water and boiled in LDS/reducing agent (Thermo Fisher NP0007/NP0004) before loading 45 μg as described above. Western blots were developed using the G:Box instrument (Syngene). Human efflux transporter assays Human MDR1 transfected MDCK cells (MDCKII-MDR1) were obtained from the Netherland Cancer Institute (NKI-AVL). This cell line was transfected with human BCRP internally (AstraZeneca, Shanghai, China) to generate the MDCKII-MDR1-BCRP cell line. Human MDR1 transfected MDCKI cells (MDCKI-MDR1) were obtained from the National Institutes of Health laboratories (NIH cell line). Efflux ratios (ER) were determined in MDCKII-MDR1-BCRP and MDCKI-MDR1 cell monolayers at pH 7.4. Apparent permeability coefficients Papp were determined by measuring transport across the cell monolayers in the apical to basolateral (Papp A to B) and basolateral to apical (Papp B to A) directions. Compounds were studied at 1 μM with sampling over 2 h at 37°C. Donor samples were diluted 10-fold with Hank’s balanced salt solution (HBSS) pH 7.4 and then 4-fold with acetonitrile containing internal standard, acceptor samples were diluted 4-fold directly with acetonitrile containing internal standard prior to analysis by LCMSMS. ERs were derived using the equation ER = Papp B to A/Papp A to B where Papp = dQ/dt ×1/(An x C 0 2 0 1 Rat brain binding Rat fraction unbound in brain (fu b 2 b b b Plasma binding Rat and cynomolgus macaque plasma protein binding (fu plasma plasma Rat brain/plasma ratio Kp and Kpuu Rat Kp studies were approved by the Pharmaron Institutional Animal Care and Use Committee (IACUC) and conducted in compliance with AstraZeneca Global Standards and local regulatory requirements. Male Han Wistar rats were purchased from Vital River Laboratory Animal Technology Co. Ltd (China) (8–10 weeks old, 200–300 g) and housed in polycarbonate animal cages containing corncob bedding with minimum acclimatization of 3 days prior to study start. Animals were housed in a controlled temperature and humidity with free access to food and water. Compounds were dosed in cassettes of up to 3 compounds to male Han Wistar rats via jugular vein infusion in 1:1:1 TEG:DMA:water at 2 μmol/kg/h at 4 mL/kg for 4 h. Brain and plasma samples were collected as outlined in J. Reiss et al., 2017 (Amer. Soc. Clinical Oncology, abstract). Analysis of brain homogenate and plasma compound levels was undertaken by LCMSMS following protein precipitation by 4:1 dilution with cold acetonitrile containing internal standard, centrifugation (2000g for 10 min) and 3-fold dilution with water prior to injection. Samples were quantified against calibration curves generated using serial dilution in 50% acetonitrile to cover expected concentration range. Correction of the brain concentration for the residual blood was undertaken by subtracting 0.8% of the plasma concentration from the total brain concentration. The ratio of brain to plasma, Kp, was determined and converted to Kpuu using the equation Kpuu = Kp x fu brain plasma Cynomologus Macaque microdose PET study Cynomologus Macaque PET study was undertaken using a microdose of [ 11 3 Quantification and statistical analysis Analysis of qPCR data Ct values were analyzed with Real-Time PCR Analysis software (Standard BioTools) and normalized to the average of selected housekeeping genes POLR2A and YWHAZ (dCt). Data was subsequently normalized to DMSO controls (ddCt). A two-sided Student’s t test was performed using R and was used to determine statistically significant changes in gene expression with a p p p p Figure 3 Analysis of EGFR phosphorylation levels in tumor xenografts For quantification and analysis of EGFR phosphorylation from xenografts, protein levels were quantified in Syngene Genetools software. Protein levels were normalised to the levels of loading control (vinculin) and vehicle controls. Statistical significance of the inhibition of EGFR phosphorylation compared to the vehicle was determined by a one-way ANOVA in GraphPad Prism 10 with Šídák multiple comparison test upon log transformed data, with a p p p p Figure 4 For anti-tumour studies, tumor growth inhibition from the start of treatment compared to the end was assessed by comparison of the differences in tumor volume between control and treated groups according to the following equations for percentage inhibition and percentage regression using the following formulae: % t u m o u r g r o w t h i n h i b i t i o n = ( ( g e o m e a n o f t u m o u r v o l u m e o f v e h i c l e g r o u p − g e o m e a n o f t u m o u r v o l u m e o f t r e a t m e n t g r o u p ) g e o m e a n o f t u m o u r v o l u m e o f v e h i c l e g r o u p ) × 100 % t u m o u r g r o w t h r e g r e s s i o n = ( ( g e o m e a n o f t u m o u r v o l u m e o f t r e a t m e n t g r o u p a t 1 s t d a y − g e o m e a n o f t u m o u r v o l u m e o f t r e a t m e n t g r o u p a t l a s t d a y ) g e o m e a n o f t u m o u r v o l u m e o f t r e a t m e n t g r o u p a t 1 s t d a y ) × 100 Statistical significance was evaluated using a one-tailed unequal variance t test in Microsoft Excel. The tumor volume data was plotted in GraphPad Prism with the mean and standard error of the mean depicted on the graphs from either 8 or 10 tumors from individual mice. Analysis of the comparison of the activity of AZ14289671 to zipalertinib, sunvozertinib and mobocertinib For in vitro brms For in vivo 53 log 10 ( t u m o u r v o l u m e ) = a + b × t i m e + e r r o r a b For all Bayesian models, model convergence was checked by evaluation of Rhat, using <1.1 as a stringent criterion. No model parameters failed to reach this threshold, suggesting good convergence. Model fit was evaluated via posterior predictive checks. Subsequently, contrasts between the cell lines/tumor cell lines were tested for each compound. Additionally, the differences between the reference compound (AZ14289671) and all other compounds for each mutation were tested. All contrasts were evaluated using the R package emmeans LXF2478 ASV A semi-mechanistic model was developed integrating in vitro i e in vivo 4 inact I, in vivo ASV H2073 WT To model the in vivo WT 54 Equation 1 rec bind 50 rec WT −1 1/2 WT 55 in vivo (Equation 1) d p E G F R d t = K r e c ( 1 − p E G F R ) − p E G F R K b i n d ( C I C 50 + C ) Tumor growth inhibition/pharmacodynamics (TGI/PD) plots In order to integrate information on target engagement levels with data on tumor growth inhibition, the PK/PD model was used to generate repeat dose simulations of phosphorylated EGFR after administration of AZ14289671 and competitors at the dose levels and regimens tested in the efficacy studies, and these were combined with observations on tumor growth inhibition (TGI%) in the respective LXF2478 ASV WT References 1 Yasuda H. Kobayashi S. Costa D.B. EGFR exon 20 insertion mutations in non-small-cell lung cancer: preclinical data and clinical implications Lancet Oncol. 13 2012 e23 e31 10.1016/S1470-2045(11)70129-2 21764376 2 Friedlaender A. Subbiah V. Russo A. Banna G.L. Malapelle U. Rolfo C. Addeo A. EGFR and HER2 exon 20 insertions in solid tumours: from biology to treatment Nat. Rev. Clin. Oncol. 19 2022 51 69 10.1038/s41571-021-00558-1 34561632 3 Floc'h N. Martin M.J. Riess J.W. Orme J.P. Staniszewska A.D. Ménard L. Cuomo M.E. O'Neill D.J. Ward R.A. Finlay M.R.V. Antitumor Activity of Osimertinib, an Irreversible Mutant-Selective EGFR Tyrosine Kinase Inhibitor, in NSCLC Harboring EGFR Exon 20 InsertionsOsimertinib in NSCLC Patients with EGFR Ex20Ins Mutations Mol Cancer Ther. 17 2018 885 896 29483211 10.1158/1535-7163.MCT-17-0758 PMC5932243 4 Yasuda H. Ichihara E. Sakakibara-Konishi J. Zenke Y. Takeuchi S. Morise M. Hotta K. Sato M. Matsumoto S. Tanimoto A. A phase I/II study of osimertinib in EGFR exon 20 insertion mutation-positive non-small Lung Cancer 162 2021 140 146 34808485 10.1016/j.lungcan.2021.10.006 5 Chen D. Song Z. Cheng G. Clinical efficacy of first-generation EGFR-TKIs in patients with advanced non-small-cell lung cancer harboring EGFR exon 20 mutations OncoTargets Ther. 9 2016 4181 4186 10.2147/OTT.S108242 PMC4944908 27468240 6 Vyse S. Huang P.H. Targeting EGFR exon 20 insertion mutations in non-small cell lung cancer Sig Transduct Target Ther 4 2019 5 10.1038/s41392-019-0038-9 PMC6405763 30854234 7 Wang H. Xu Y. Lin J. Huang Y. Evaluating the Clinical Characteristics and Prognosis of Advanced Non-Small Cell Lung Cancer with Exon 20 Insertions Cancer Control 31 2024 10732748241262190 10.1177/10732748241262190 PMC11165965 38857163 8 Park K. Haura E.B. Leighl N.B. Mitchell P. Shu C.A. Girard N. Viteri S. Han J.-Y. Kim S.-W. Lee C.K. Amivantamab in EGFR exon 20 insertion–mutated non–small-cell lung cancer progressing on platinum chemotherapy: initial results from the CHRYSALIS phase I study J. Clin. Oncol. 39 2021 3391 3402 34339292 10.1200/JCO.21.00662 PMC8791812 9 Syed Y.Y. Amivantamab: first approval Drugs 81 2021 1349 1353 34292533 10.1007/s40265-021-01561-7 10 Yun J. Lee S.-H. Kim S.-Y. Jeong S.-Y. Kim J.-H. Pyo K.-H. Park C.-W. Heo S.G. Yun M.R. Lim S. Antitumor activity of amivantamab (JNJ-61186372), an EGFR–MET bispecific antibody, in diverse models of EGFR exon 20 insertion–driven NSCLC Cancer Discov. 10 2020 1194 1209 32414908 10.1158/2159-8290.CD-20-0116 11 Girard N. Park K. Lee S.-H. Viteri S. Schioppa C.A. Diels J. Oguz M. Rodrigues B.H. Rahhali N. Sermon J. A brief report on stable disease among amivantamab-treated patients with post-platinum epidermal growth factor receptor exon 20 insertion–mutated non-small cell lung cancer: A response-based analysis from the CHRYSALIS study Cancer Treat. Res. Commun. 40 2024 100832 10.1016/j.ctarc.2024.100832 39033692 12 Kian W. Christopoulos P. Remilah A.A. Levison E. Dudnik E. Shalata W. Krayim B. Marei R. Yakobson A. Faehling M. Real-world efficacy and safety of mobocertinib in EGFR Front. Oncol. 12 2022 1010311 10.3389/fonc.2022.1010311 PMC9531269 36203432 13 Riely G.J. Neal J.W. Camidge D.R. Spira A.I. Piotrowska Z. Costa D.B. Tsao A.S. Patel J.D. Gadgeel S.M. Bazhenova L. Activity and Safety of Mobocertinib (TAK-788) in Previously Treated Non-Small Cell Lung Cancer with EGFR Cancer Discov. 11 2021 1688 1699 33632775 10.1158/2159-8290.CD-20-1598 PMC8295177 14 Yang J.C.-H. Zhou C. Jänne P.A. Ramalingam S.S. Kim T.M. Riely G.J. Spira A.I. Piotrowska Z. Mekhail T. Garcia Campelo M.R. Characterization and management of adverse events observed with mobocertinib (TAK-788) treatment for EGFR exon 20 insertion–positive non–small cell lung cancer Expert Rev. Anticancer Ther. 23 2023 95 106 36537204 10.1080/14737140.2023.2157815 15 Hanley M.J. Camidge D.R. Fram R.J. Gupta N. Mobocertinib: Mechanism of action, clinical, and translational science Clin. Transl. Sci. 17 2024 e13766 10.1111/cts.13766 PMC10955621 38511563 16 Sentana-Lledo D. Academia E. Viray H. Rangachari D. Kobayashi S.S. VanderLaan P.A. Costa D.B. EGFR ERBB2 Transl. Lung Cancer Res. 12 2023 1590 1610 37577308 10.21037/tlcr-23-98 PMC10413034 17 Hasako S. Terasaka M. Abe N. Uno T. Ohsawa H. Hashimoto A. Fujita R. Tanaka K. Okayama T. Wadhwa R. TAS6417, A Novel EGFR Inhibitor Targeting Exon 20 Insertion Mutations Mol. Cancer Ther. 17 2018 1648 1658 29748209 10.1158/1535-7163.MCT-17-1206 18 Piotrowska Z. Tan D.S.W. Smit E.F. Spira A.I. Soo R.A. Nguyen D. Lee V.H.F. Yang J.C.H. Velcheti V. Wrangle J.M. Safety, Tolerability, and Antitumor Activity of Zipalertinib Among Patients With Non-Small-Cell Lung Cancer Harboring Epidermal Growth Factor Receptor Exon 20 Insertions J. Clin. Oncol. 41 2023 4218 4225 10.1200/JCO.23.00152 37384848 19 Wang M. Fan Y. Sun M. Wang Y. Zhao Y. Jin B. Hu Y. Han Z. Song X. Liu A. Sunvozertinib for patients in China with platinum-pretreated locally advanced or metastatic non-small-cell lung cancer and EGFR exon 20 insertion mutation (WU-KONG6): single-arm, open-label, multicentre, phase 2 trial Lancet Resp. Med. 12 2023 217 224 10.1016/S2213-2600(23)00379-X 38101437 20 U.S. Food & Drug Administration FDA grants accelerated approval to sunvozertinib for metastatic non-small cell lung cancer with EGFR exon 20 insertion mutations https://www.fda.gov/drugs/resources-information-approved-drugs/fda-grants-accelerated-approval-sunvozertinib-metastatic-non-small-cell-lung-cancer-egfr-exon-20 21 Wang M. Yang J.C.H. Mitchell P.L. Fang J. Camidge D.R. Nian W. Chiu C.H. Zhou J. Zhao Y. Su W.C. Sunvozertinib, a Selective EGFR Inhibitor for Previously Treated Non-Small Cell Lung Cancer with EGFR Exon 20 Insertion Mutations Cancer Discov. 12 2022 1676 1689 10.1158/2159-8290.CD-21-1615 35404393 PMC9262839 22 Remon J. Hendriks L.E.L. Cardona A.F. Besse B. EGFR exon 20 insertions in advanced non-small cell lung cancer: A new history begins Cancer Treat Rev. 90 2020 102105 10.1016/j.ctrv.2020.102105 32979839 23 Cardona A.F. Rojas L. Zatarain-Barrón Z.L. Freitas H.C. Granados S.T. Castillo O. Oblitas G. Corrales L. Castro C.D. Ruiz-Patiño A. EGFR exon 20 insertion in lung adenocarcinomas among Hispanics (geno1. 2-CLICaP) Lung Cancer 125 2018 265 272 30429031 10.1016/j.lungcan.2018.10.007 24 Yang G. Li J. Xu H. Yang Y. Yang L. Xu F. Xia B. Zhu V.W. Nagasaka M. Yang Y. EGFR exon 20 insertion mutations in Chinese advanced non-small cell lung cancer patients: molecular heterogeneity and treatment outcome from nationwide real-world study Lung Cancer 145 2020 186 194 32336530 10.1016/j.lungcan.2020.03.014 25 Rangachari D. Yamaguchi N. VanderLaan P.A. Folch E. Mahadevan A. Floyd S.R. Uhlmann E.J. Wong E.T. Dahlberg S.E. Huberman M.S. Costa D.B. Brain metastases in patients with EGFR-mutated or ALK-rearranged non-small-cell lung cancers Lung cancer 88 2015 108 111 25682925 10.1016/j.lungcan.2015.01.020 PMC4355240 26 Seo D. Lim J.H. Targeted Therapies for EGFR Exon 20 Insertion Mutation in Non-Small-Cell Lung Cancer Int. J. Mol. Sci. 25 2024 5917 38892105 10.3390/ijms25115917 PMC11172945 27 Thomson C. Barton P. Braybrooke E. Colclough N. Dong Z. Evans L. Floc’h N. Guérot C. Hargreaves D. Khurana P. Discovery and Optimization of Potent, Efficacious and Selective Inhibitors Targeting EGFR Exon20 Insertion Mutations J. Med. Chem. 67 2024 8988 9027 10.1021/acs.jmedchem.4c01792 38770784 28 Thomson C. Braybrooke E. Colclough N. Davies N.L. Floc’h N. Greenwood R. Guérot C. Hargreaves D. Johnstrom P. Khurana P. Optimization of Potent, Efficacious, Selective and Blood–Brain Barrier Penetrating Inhibitors Targeting EGFR Exon20 Insertion Mutations J. Med. Chem. 2024 10.1021/acs.jmedchem.4c01792 39340451 29 McCoull W. Thomson C. Braybrooke E. Chan C. Colclough N. Cortés González M.A. Cosulich S. Davies N.L. Floc’h N. Greenwood R. Highly optimized CNS penetrant inhibitors of EGFR Exon20 Insertion Mutations J. Med. Chem. 68 2025 3700 3748 39869768 10.1021/acs.jmedchem.4c02811 30 Wagle M.-C. Kirouac D. Klijn C. Liu B. Mahajan S. Junttila M. Moffat J. Merchant M. Huw L. Wongchenko M. A transcriptional MAPK Pathway Activity Score (MPAS) is a clinically relevant biomarker in multiple cancer types NPJ Precis. Oncol. 2 2018 7 29872725 10.1038/s41698-018-0051-4 PMC5871852 31 Colclough N. Chen K. Johnström P. Strittmatter N. Yan Y. Wrigley G.L. Schou M. Goodwin R. Varnäs K. Adua S.J. Preclinical comparison of the blood–brain barrier permeability of osimertinib with other EGFR TKIs Clin. Cancer Res. 27 2021 189 201 33028591 10.1158/1078-0432.CCR-19-1871 32 Di L. Rong H. Feng B. Demystifying brain penetration in central nervous system drug discovery: Miniperspective J. Med. Chem. 56 2013 2 12 23075026 10.1021/jm301297f 33 Rankovic Z. CNS drug design: balancing physicochemical properties for optimal brain exposure J. Med. Chem. 58 2015 2584 2608 25494650 10.1021/jm501535r 34 Colclough N. Chen K. Johnström P. Fridén M. McGinnity D.F. Building on the success of osimertinib: achieving CNS exposure in oncology drug discovery Drug Discov. Today 24 2019 1067 1073 30710641 10.1016/j.drudis.2019.01.015 35 Colclough N. Alluri R.V. Tucker J.W. Gozalpour E. Li D. Du H. Li W. Harlfinger S. O’Neill D.J. Sproat G.G. Utilizing a Dual Human Transporter MDCKII-MDR1-BCRP Cell Line to Assess Efflux at the Blood Brain Barrier Drug Metab. Dispos. 52 2024 95 105 38071533 10.1124/dmd.123.001476 36 Gupta N. Pierrillas P.B. Hanley M.J. Zhang S. Diderichsen P.M. Population pharmacokinetics of mobocertinib in healthy volunteers and patients with non–small cell lung cancer CPT Pharmacometrics Syst. Pharmacol. 11 2022 731 744 35316867 10.1002/psp4.12785 PMC9197538 37 Chen H. Shah A. Kato S. Griffin R. Zhang S. Pusalkar S. Cohen L. Li Y. Chowdhury S.K. Zhu S.X. Metabolism and Excretion of [14C] Mobocertinib, a Selective Covalent Inhibitor of Epidermal Growth Factor Receptor (EGFR) Exon 20 Insertion Mutations, in Healthy Male Subjects Drug Metab. Dispos. 52 2024 1115 1123 39038951 10.1124/dmd.124.001841 38 Zwierenga F. van Veggel B. Hendriks L.E.L. Hiltermann T.J.N. Hiddinga B.I. Hijmering Kappelle L.B.M. Ter Elst A. Hashemi S.M.S. Dingemans A.-M.C. van der Leest C. High dose osimertinib in patients with advanced stage EGFR exon 20 mutation-positive NSCLC: Results from the phase 2 multicenter POSITION20 trial Lung Cancer 170 2022 133 140 35777160 10.1016/j.lungcan.2022.06.012 39 Morita C. Yoshida T. Shirasawa M. Masuda K. Matsumoto Y. Shinno Y. Yagishita S. Okuma Y. Goto Y. Horinouchi H. Clinical characteristics of advanced non-small cell lung cancer patients with EGFR exon 20 insertions Sci. Rep. 11 2021 18762 10.1038/s41598-021-98275-3 PMC8455549 34548567 40 Shah M.P. Aredo J.V. Padda S.K. Ramchandran K.J. Wakelee H.A. Das M.S. Neal J.W. EGFR exon 20 Insertion NSCLC and Response to Platinum-Based Chemotherapy Clin. Lung Cancer 23 2022 e148 e153 34391686 10.1016/j.cllc.2021.07.001 PMC8766618 41 Yasuda H. Park E. Yun C.-H. Sng N.J. Lucena-Araujo A.R. Yeo W.-L. Huberman M.S. Cohen D.W. Nakayama S. Ishioka K. Structural, biochemical, and clinical characterization of epidermal growth factor receptor (EGFR) exon 20 insertion mutations lung cancer 5 2013 216ra177 10.1126/scitranslmed.3007205 PMC3954775 24353160 42 Yang J.C.-H. Schuler M. Popat S. Miura S. Heeke S. Park K. Märten A. Kim E.S. Afatinib for the Treatment of NSCLC Harboring Uncommon EGFR Mutations: A Database of 693 Cases J. Thorac. Oncol. 15 2020 803 815 31931137 10.1016/j.jtho.2019.12.126 43 Gonzalvez F. Vincent S. Baker T.E. Gould A.E. Li S. Wardwell S.D. Nadworny S. Ning Y. Zhang S. Huang W.-S. Mobocertinib (TAK-788): a targeted inhibitor of EGFR exon 20 insertion mutants in non–small cell lung cancer Cancer Discov. 11 2021 1672 1687 33632773 10.1158/2159-8290.CD-20-1683 44 Huang W.-S. Li F. Gong Y. Zhang Y. Youngsaye W. Xu Y. Zhu X. Greenfield M.T. Kohlmann A. Taslimi P.M. Discovery of mobocertinib, a potent, oral inhibitor of EGFR exon 20 insertion mutations in non–small cell lung cancer Bioorg. Med. Chem. Lett. 80 2023 129084 10.1016/j.bmcl.2022.129084 36423823 45 Riess J.W. Gandara D.R. Frampton G.M. Madison R. Peled N. Bufill J.A. Dy G.K. Ou S.-H.I. Stephens P.J. McPherson J.D. Diverse EGFR Exon 20 Insertions and Co-Occurring Molecular Alterations Identified by Comprehensive Genomic Profiling of NSCLC J. Thorac. Oncol. 13 2018 1560 1568 29981927 10.1016/j.jtho.2018.06.019 PMC6764748 46 Yang G.-J. Li J. Xu H.-Y. Sun Y. Liu L. Li H.-S. Yang L. Zhang Y. Li G.-H. Wang Y. Osimertinib for Chinese advanced non-small cell lung cancer patients harboring diverse EGFR exon 20 insertion mutations Lung Cancer 152 2021 39 48 33341538 10.1016/j.lungcan.2020.11.027 47 Van Veggel B. Madeira R Santos J.F.V. Hashemi S.M.S. Paats M.S. Monkhorst K. Heideman D.A.M. Groves M. Radonic T. Smit E.F. Schuuring E. Osimertinib treatment for patients with EGFR exon 20 mutation positive non-small cell lung cancer Lung Cancer 141 2020 9 13 31926441 10.1016/j.lungcan.2019.12.013 48 Shah R.R. Shah D.R. Safety and tolerability of epidermal growth factor receptor (EGFR) tyrosine kinase inhibitors in oncology Drug Saf. 42 2019 181 198 30649743 10.1007/s40264-018-0772-x 49 Li Y. Fu R. Jiang T. Duan D. Wu Y. Li C. Li Z. Ni R. Li L. Liu Y. Mechanism of lethal skin toxicities induced by epidermal growth factor receptor inhibitors and related treatment strategies Front. Oncol. 12 2022 804212 10.3389/fonc.2022.804212 PMC8866822 35223483 50 Ramalingam S.S. Vansteenkiste J. Planchard D. Cho B.C. Gray J.E. Ohe Y. Zhou C. Reungwetwattana T. Cheng Y. Chewaskulyong B. Overall survival with osimertinib in untreated N. Engl. J. Med. 382 2020 41 50 31751012 10.1056/NEJMoa1913662 51 Zhou C. Ramalingam S.S. Kim T.M. Kim S.-W. Yang J.C.-H. Riely G.J. Mekhail T. Nguyen D. Garcia Campelo M.R. Felip E. Treatment outcomes and safety of mobocertinib in platinum-pretreated patients with EGFR exon 20 insertion–positive metastatic non–small cell lung cancer: a phase 1/2 open-label nonrandomized clinical trial JAMA Oncol. 7 2021 e214761 34647988 10.1001/jamaoncol.2021.4761 PMC8517885 52 Piotrowska Z. Tan D.S.-W. Smit E.F. Spira A.I. Soo R.A. Nguyen D. Lee V.H.-F. Yang J.C.-H. Velcheti V. Wrangle J.M. Safety, Tolerability, and Antitumor Activity of Zipalertinib Among Patients With Non–Small-Cell Lung Cancer Harboring Epidermal Growth Factor Receptor Exon 20 Insertions J. Clin. Oncol. 41 2023 4218 4225 37384848 10.1200/JCO.23.00152 53 Hather G. Liu R. Bandi S. Mettetal J. Manfredi M. Shyu W.-C. Donelan J. Chakravarty A. Growth rate analysis and efficient experimental design for tumor xenograft studies: supplementary issue: array platform modeling and analysis (A) Cancer Inform. 13s4 2014 S13974 10.4137/CIN.S13974 PMC4264612 25574127 54 Yates J.W.T. Ashton S. Cross D. Mellor M.J. Powell S.J. Ballard P. Irreversible Inhibition of EGFR: Modeling the Combined Pharmacokinetic–Pharmacodynamic Relationship of Osimertinib and Its Active Metabolite AZ5104 Mol. Cancer Ther. 15 2016 2378 2387 27439477 10.1158/1535-7163.MCT-16-0142 55 Greig M.J. Niessen S. Weinrich S.L. Feng J.L. Shi M. Johnson T.O. Effects of Activating Mutations on EGFR Cellular Protein Turnover and Amino Acid Recycling Determined Using SILAC Mass Spectrometry Int. J. Cell Biol. 2015 2015 798936 798938 26689952 10.1155/2015/798936 PMC4672139 Supplemental information  Document S1. Figures S1–S7, Tables S2–S14, and Methods S1–S3 Table S1. Kinome selectivity panel, % inhibition data for compound AZ14289671 tested at 1 μmol/L concentration at Thermo Fisher Scientific, related to Figure 1 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102305 ",
  "metadata": {
    "Title of this paper": "Effects of Activating Mutations on EGFR Cellular Protein Turnover and Amino Acid Recycling Determined Using SILAC Mass Spectrometry",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490212/"
  }
}