{
  "title": "Paper_1032",
  "abstract": "pmc Gels Gels 3575 gels gels Gels 2310-2861 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469554 PMC12469554.1 12469554 12469554 41002480 10.3390/gels11090705 gels-11-00705 1 Review Biological Models for Evaluating Hydrogel-Based Formulations in Wound Healing https://orcid.org/0000-0003-4046-7310 Baldea Ioana 1 Grosu Ioana Georgeta 2 * Ghafury Sahar 1 * Golat Cristian 1 Doubali Doriane 1 Vestemean Ana-Maria 1 https://orcid.org/0009-0005-7480-2756 Cedorge Aris Nicolas 1 Florian Ilinca 1 Yiannoulatos Michael 1 Wajahat Muhammad Mudassir 1 Silli Lorenzo Raoul 1 Stavrou Thesseus 1 Mitrea Daniela Rodica 1 Wang Jilong Academic Editor 1 baldeaioana@gmail.com cristigolat@gmail.com dododoubali@gmail.com amvestemean@gmail.com ariscedorge2015@gmail.com ilincaflorian16@gmail.com mike1325gia@gmail.com mmw.of2004@gmail.com lorenzo.silli@yahoo.fr thesseus.stavrou@gmail.com rdmitrea@yahoo.co.uk 2 * ioana.grosu@itim-cj.ro sahariiighaf@gmail.com 03 9 2025 9 2025 11 9 497641 705 31 7 2025 29 8 2025 01 9 2025 03 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Skin, the largest organ of the human body, serves as a critical physico-chemical barrier against environmental insults and plays essential roles in hydration, thermoregulation, immune defense, and metabolic functions. Wound healing is a complex, multistage biological process involving hemostasis, inflammation, proliferation, and remodeling. Hydrogels have emerged as a promising class of wound dressings due to their high moisture retention, biocompatibility, and ability to mimic the extracellular matrix, thereby supporting accelerated healing and controlled drug delivery. This review provides a comprehensive overview of current hydrogel types—classified by origin, crosslinking mechanisms, and responsiveness to stimuli—and evaluates their use in experimental research on in vitro, ex vivo, and in vivo wound healing models. Furthermore, clinical applications of hydrogels in wound therapy are discussed. Advances in semisynthetic and stimuli-responsive hydrogels, along with improved testing models, offer enhanced therapeutic potential and underscore the need for continued innovation to optimize wound care outcomes and alleviate healthcare burdens. scratch assay reconstructed human epithelium full-thickness skin model wound healing models surgical wound model burn wound model hydrogel-based dressings crosslinked hydrogels National Research Development and Innovation Plan 2022–2027, Romania 27N/03.01.2023 PN 23 24 01 05 This work was supported through the “Nucleu” Program within the National Research Development and Innovation Plan 2022–2027, Romania, carried out with the support of MEC, project no. 27N/03.01.2023, component project code PN 23 24 01 05. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Skin is the largest human body organ, providing the initial physico-chemical barrier against saprophytes and pathogens, radiation, such as ultraviolet irradiation, and chemical and mechanical injuries. Besides the barrier function, skin is an active part of many other homeostatic mechanisms. It maintains the body’s hydration state, thermoregulation, immune recognition and defense, synthesis of vitamin D precursors, and excretion of some catabolites and drugs [ 1 Millions of skin injuries caused by physical or thermal agents occur annually, and if not properly treated, they can develop into chronic wounds. Wounds are defined as any damage or disruption of the body’s tissues, typically the epidermis. They can be classified into open (laceration) and closed (hematomas). According to the wound age, onset mechanism, and healing capacity, they can be acute or chronic [ 2 The wound healing process is a physiological reaction immediately initiated after tissue injury. It is a dynamic and multistage biological response comprising four overlapping phases: hemostasis (immediate), inflammation (days 1–4), proliferation (days 4–21), and remodeling or maturation (day 21 to up to 2 years). In the initial phase, characterized by loss of lymphatic fluid and/or blood, hemostasis is crucial, leading to the formation of a platelet plug and eventually a stable clot. These also lead to initiation of the inflammatory reaction triggered by serotonin and histamine released from thrombocytes and local leukocytes. Inside the fibrin network there are scattered neutrophils and leukocytes that decontaminate the wound and phagocytose bacteria and cellular debris. The wound contracts due to increased fibroblast and myofibroblast activity. By days five to seven, fibroblasts start collagen and glycosaminoglycans synthesis to form the core of the granulation tissue. Migrating cells, mainly keratinocytes from the outskirts of the plaque, move towards the wound and start re-epithelialization of the wound surface. This is sustained by the ongoing angiogenesis from the existing vessel network, where the endothelial cells proliferate and start migrating. Their proliferation leads to new vascular sprouts that replace and heal the wounded vascular network. However, the scar tissue does not bear the same strength as the initial tissue. In the maturation phase, the newly formed scar tissue is remodeled to reduce thickness and increase elasticity and strength as a response to mechanical stress. Also, pigmentogenesis is activated due to melanocyte activity and migration, particularly as a response to inflammation and ultraviolet exposure [ 2 3 This intricate process can be disrupted by various physiological factors such as aging and infection or by pre-existing medical conditions like diabetes and obesity. This may lead to delayed healing or development of chronic wounds, often accompanied by complications including severe inflammation, infection, hemorrhage, and, in extreme cases, limb amputation [ 4 5 To support optimal healing, appropriate wound management is essential, and the choice of dressing plays a central role. An ideal wound dressing should maintain a moist environment to promote cell migration and tissue regeneration, manage exudate to prevent maceration, permit gas exchange, and provide a barrier against microbial contamination. Furthermore, dressing must be sterile, non-toxic, nonallergenic, and comfortable, while also being easy to apply and remove without causing further tissue damage [ 6 7 8 9 10 11 12 13 Despite their promising properties and biological effects, evaluating the optimal hydrogel formulation for wound healing is challenging due to the complexity of both the hydrogels themselves and the diverse types of wounds. Hydrogels need to perform multiple functions—such as aiding debridement, maintaining moisture, promoting cell proliferation, enhancing drug delivery, and stimulating epithelialization—throughout different stages of healing. Additionally, the wide variety of wound types—acute, chronic, infected, burn, ischemic, superficial, or deep—further complicates the selection of an appropriate testing model. Numerous models are used to assess wound healing, ranging from in vitro systems like 2D skin cultures to more complex 3D reconstructed skin models and ex vivo human or porcine skin. Common in vivo models include surgical wounds with or without induced diabetes mellitus, burn wounds of varying depth, and, less commonly, ischemic or radiation-induced wounds on different animal species, predominantly rats and mice. The sheer variety of models, each with advantages and disadvantages linked to complexity, costs, technical requirements, standardization issues, ethical concerns, particularly for animal and human studies, and the difficulties of clinical translation of the obtained data make it difficult to select and standardize a testing method that allows for consistent comparisons across studies. In view of these facts, the manuscript aims to summarize current hydrogel types used in wound healing and to present an overview of the biological efficacy of various hydrogels evaluated through in vitro, ex vivo, in vivo, and clinical models. It also highlights the advantages and limitations of each approach, aiming to support more informed and effective model selection for testing hydrogel-based wound healing therapies. 2. Relevant Sections and Discussion 2.1. Hydrogels Among the various types of wound dressings, hydrogels stand out due to their superior moisture-retention capacity, biodegradability, biocompatibility, and ability to facilitate natural debridement processes. Hydrogels are three-dimensional, hydrophilic, porous polymeric networks that exhibit high water retention capacity. They received significant attention in topical wound therapy due to their ability to mimic the native extracellular matrix (ECM), maintain a moist wound environment, and deliver bioactive agents in a controlled manner. Their structure, formed through either physical (reversible ionic or hydrogen bonds) or chemical (covalent) crosslinking, can be engineered to respond to various stimuli such as pH [ 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 2.2. Hydrogel Classification in the Context of Topical Wound Therapy Hydrogels can be systematically classified according to several key parameters: origin or source (natural, synthetic, or semi-synthetic), crosslinking mechanism (physical or chemical), responsiveness to external stimuli (such as pH, temperature, or enzymatic activity in the case of stimuli-sensitive hydrogels), and therapeutic agent delivered. This classification approach facilitates a comprehensive understanding of the functional properties of hydrogels and supports the rational selection of suitable hydrogel systems for specific wound types and experimental biological models. 2.2.1. Origin of Polymeric Scaffold Based on the origin of their polymeric scaffold, hydrogels can be classified into natural, synthetic, and semi-synthetic [ 35 36 Natural hydrogels are derived from biopolymers obtained from plant, animal, or microbial sources. Biopolymers commonly used for hydrogel fabrication include polysaccharides such as cellulose [ 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 Due to their structural similarity to native soft tissues and their bioactivity, natural hydrogels can support cellular adhesion, proliferation, and differentiation. Moreover, they exhibit excellent biocompatibility, biodegradability, and low toxicity, making them suitable for biomedical applications such as wound dressings, drug delivery systems, and tissue engineering scaffolds [ 55 56 57 Synthetic hydrogels are three-dimensional polymer networks formed through the covalent or ionic crosslinking of hydrophilic homopolymers or copolymers. They offer precise control over molecular architecture due to a well-defined structure, which can be adjusted to enhance their properties. This allows tailored mechanical, chemical, and degradation properties for specific biomedical or industrial requirements [ 58 59 60 61 62 63 64 65 66 67 68 Semi-synthetic hydrogels are engineered by combining natural and synthetic polymers. The aim is to integrate the biocompatibility and biological activity of natural materials with the mechanical strength, tunability, and structural stability of synthetic polymers. This leads to advanced biomaterials with enhanced mechanical performance, controlled degradation profiles, and superior biological functionality for applications in regenerative medicine, drug delivery, and tissue engineering [ 69 70 2.2.2. Cross-Linking Mechanism Natural and synthetic polymers contain various hydrophilic functional groups, such as –COOH, –OH, –NH 2 2 3 71 Chemically crosslinked hydrogels exhibit robust three-dimensional networks with enhanced mechanical strength, elasticity, structural integrity, and prolonged degradation profiles. A variety of strategies can be employed to achieve covalent crosslinking. Common approaches include reactions between complementary functional groups (e.g., –COOH, –OH, –NH 2 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 Physically crosslinked hydrogels are formed through inter- and/or intramolecular non-covalent interactions between polymer chains, such as hydrogen bonding, ionic interactions, hydrophobic associations, van der Waals forces, crystallization, and protein-based interactions [ 92 93 2+ 92 94 95 96 97 98 99 2.2.3. Stimuli-Responsive Hydrogels Stimuli-responsive hydrogels can be systematically classified based on the specific external stimuli to which they respond. There is a broad spectrum of physical, chemical, and biological triggers: pH, temperature, light, electric and magnetic fields, and biological signals. pH-responsive hydrogels, the most common type of stimuli-sensitive hydrogels, swell or shrink in response to environmental pH changes due to ionizable groups like carboxyl or amine moieties, making them particularly valuable in wound healing by enabling targeted drug release and responsive behavior in the acidic microenvironment of infected or inflamed tissues [ 100 Temperature-responsive hydrogels, which undergo sol–gel transitions near body temperature, are important in wound healing, as they enable injectable, in situ forming systems that adapt to the wound site. This provides sustained drug release, improves local drug concentration, and minimizes the systemic side effects associated with intravenous or oral administration [ 101 102 103 104 105 106 107 108 109 110 111 112 113 114 2.2.4. Type of Therapeutic Agent Delivered Hydrogels have attracted significant interest as versatile carriers in targeted therapeutic delivery, bioadhesive systems, and controlled release platforms. Due to their inherent biocompatibility, moisture retention, and structural similarity to the extracellular matrix, hydrogels, in particular polysaccharide-based, are highly effective for wound healing applications, even in carrier-free formulations. They support tissue regeneration and maintain an optimal healing environment with no need for additional therapeutic agents [ 115 116 Growth factors and peptides promote cell proliferation and angiogenesis but suffer from rapid degradation, while hydrogels protect and sustain their release [ 117 118 119 120 121 122 123 124 125 126 Based on these facts, the use of hydrogels in wound healing care, regenerative medicine, or drug delivery presents clear advantages. However, their biocompatibility, biological activity, or efficacy strongly depends on the hydrogel interactions with the biological tissues. Choosing the right model is essential for the testing of the hydrogel properties, since their use might be beneficial in a certain wound type or a phase of the healing process, while it might be detrimental in another step. For instance, a hydrogel that exerts anti-fibrotic properties, such as alginate, has a negative impact in the proliferation step but can be beneficial in the maturation phase or in chronic wounds when fibroblast overactivation leads to epithelialization inhibition [ 127 128 129 130 131 132 In the inflammatory phase of wound healing, a non-absorbent hydrogel, like naturally derived polymers such as collagen or alginate-based formulations, is less useful due to abundant exudate but is beneficial in the proliferation and migration phase, when it provides an ECM-resembling scaffold that diminishes healing time and improves scar formation. Alginate films could also be unsuitable for heavily exuding wounds due to poor thickness [ 129 133 134 135 136 127 131 From a translational perspective, natural polymers such as alginate, chitosan, hyaluronic acid, collagen, and gelatin are attractive due to their biocompatibility, biodegradability, and intrinsic bioactivity. However, they also exhibit disadvantages such as poor mechanical strength and the risk of immunogenicity, which limit direct clinical translation unless combined with reinforcing networks or antibacterial agents. In contrast, synthetic systems such as polyvinyl alcohol (PVA) hydrogels provide robust mechanical stability, moisture retention, and oxygen permeability. These properties make them suitable for protecting fragile wounds and promoting re-epithelialization, despite their lack of inherent antibacterial activity, which requires functional modification. Several reviews have comprehensively examined the advantages and limitations of both natural and synthetic polymer-based hydrogels for wound healing applications as well as clinically available hydrogel wound dressings [ 137 138 139 Hybrid hydrogels bridge these gaps by integrating bioactive natural polymers with mechanically resilient synthetic backbones or responsive moieties, enabling multifunctional dressings that can release antimicrobials, respond dynamically to wound microenvironmental cues, and support cellular proliferation in vivo. Such adaptability, coupled with a high potential for scalable and low-cost manufacturing, positions hybrid and engineered synthetic hydrogels as the most clinically translatable platforms for wound care applications [ 140 Hybrid hydrogels containing polyvinyl alcohol (PVA), with chitosan with or without collagen, can be used in all healing phases due to their dual effects of absorbing and moisture preservation, which regulates the humidity of the wound bioenvironment [ 141 142 143 Cellulose also proved beneficial due to its mechanical strength and absorptive ability. Carboxymethyl cellulose and electrospun cellulose extracts with polylactide and polydioxanone nanofibers increased skin regeneration and aided angiogenesis, reviewed in [ 143 Polyurethane-based wound dressings, incorporating natural polymers (e.g., collagen, chitosan, hyaluronic acid), synthetic polymers (e.g., PEG, PVA, polyacrylamide), and bioactive agents (e.g., LL37 peptide, platelet lysate, exosomes), have been reviewed for their physicochemical and biological modifications, applications in wound repair and regeneration, and potential for the development of advanced functional dressings [ 144 145 Hydrocolloid dressings were prepared from sodium carboxymethyl cellulose or sodium alginate, styrene–isoprene–styrene, and either silk fibroin nanoparticles or petroleum hydrocarbon resin, optionally loaded with bioactive agents. These hybrid hydrocolloids exhibit improved mechanical properties, water uptake, and swelling. They promote dermal regeneration and epithelialization, enhance wound structural integrity, reduce wound size, and increase collagen fiber density [ 140 Another issue in wound healing is the presence of bacteria, leading to inflammation and cell death, with delayed or impaired healing eventually leading to the development of chronic wounds or defective scars. Composite hydrogel dressings with carboxymethyl chitosan, gelatin microspheres, and tetracycline hydrochloride showed sustained drug release and effective inhibition of E. coli S. aureus 146 147 Nanoparticle incorporation further enhanced antibacterial activity [ 148 E. coli S. aureus 149 Microencapsulated plantain extract in alginate promoted antioxidant and anti-inflammatory effects, boosted collagen synthesis in dermal fibroblasts (BJ), and accelerated in vitro wound closure [ 131 127 146 S. aureus E. coli 150 E. coli S. aureus 151 There is a growing need for suitable biological models that are specifically designed for the testing of hydrogel properties in the bioenvironment, which would allow the fine-tuning of their physico-chemical structure to the intended use. These models have to mimic the clinical steps of wound healing, depending on the wound types and the behavior of different cell types from the wound area. In view of the clinical use of hydrogel formulations, their biocompatibility and biological activities have to be thoroughly tested on human cell-derived models, closely mimicking the wound structure. The employed models involve in vitro 2D skin cell cultures and possibly more complex human models, such as 3D reconstructed human epithelium or full-thickness skin models, ex vivo human or porcine explants, or standardized in vivo models created on lab animals, predominantly mice and rats. 2.3. Biological Models Employed in the Evaluation of the Wound Healing Properties of Hydrogels 2.3.1. In Vitro Models In vitro wound healing models ( Table 1 Table 2 A comparative presentation of the advantages/disadvantages, limitations, and research applications of the in vitro models is presented in Table 1 Table 2 Monolayer Cultures Fibroblast and/or keratinocyte monolayer models are simpler models, easier to manipulate, and provide cost-effective benefits. Cells are cultured cells on flat and rigid surfaces generally made of transparent glass or plastic, so microscopic cellular observation is possible while maintaining cellular attachment [ 152 Figure 1 153 152 An interesting approach to wound healing modeling was the development of a human-relevant in vitro scab model composed of HaCaT keratinocytes and fresh human blood, maintained for over two weeks. The model expressed all TGF-β isoforms and ECM-related target genes, reflecting early wound healing activity. TGF-β1 stimulation promoted matrix remodeling and Smad7 expression, while pathway inhibition led to scab condensation and degranulation. This model provides a viable platform to study early wound healing events involving blood–skin cell interactions [ 161 Scratch Wound Assays The scratch assay is a 2D in vitro technique derived from the monolayer model, wherein a uniform “wound” is introduced by mechanically disrupting a confluent layer of cells, typically epidermal fibroblasts or keratinocytes. Cell migration into the wound area is tracked over time to assess wound closure. Some of the most common uses of this method are in wound healing and cancer assays. Another wound creation technique comes from the use of inserts, including silicone or bioprinted, to avoid the mechanical trauma inflicted on neighboring cells [ 154 155 152 156 157 Reconstructed Human Epidermis (RHE), 3D Models Researchers have developed more advanced models, such as the 3D reconstructed human epidermis (RHE) or full dermal-epidermal reconstructs (FDE), to overcome the 2D tissue architecture limitations [ 152 RHE models consist of stratified keratinocytes cultured on a porous membrane at the air-liquid interface, frequently supported by a collagen matrix to mimic the basal membrane. Full dermal-epidermal reconstructions also include the reconstructed dermis by using human fibroblasts for the dermal part, on which the keratinocytes are further stratified to make the upper epidermis. These models allow for a multilayered epithelium with structural and functional similarities to native human skin, including barrier function and ECM deposition [ 152 162 Table 2 Table 3 163 An in vitro thermal wound infection model was developed using human skin equivalents (HSE) and biofilm-forming MRSA to evaluate antimicrobial agents. Thermal injury, induced by a liquid nitrogen-cooled device, caused keratinocyte death and epidermal detachment, triggering inflammation and antimicrobial responses. MRSA exposure led to rapid colonization and upregulation of TLR2, IL-6, IL-8, and defensins. Topical mupirocin reduced MRSA levels by over 99.9% within 24 h. This model effectively mimics early wound infection and is suitable for testing topical antimicrobials [ 164 Hydrogels, particularly collagen, are useful tools for the design of the dermal matrix or as a bioink to support the development of the 3D RHE or full-thickness skin models. A full-thickness human skin model (FTM) was developed using chitosan and collagen hydrogel (CC-FTM). The CC-FTMs supported epidermal differentiation, with reduced keratinocyte activation resembling normal human skin. It also induced an improved lipid matrix structure, ceramide profile, and lower transepidermal water loss, which indicated enhanced barrier function. These features make CC-FTMs a more physiologically relevant model for studying epidermal barrier properties [ 164 158 An overview of the wound healing processes in 2D and 3D in vitro models is provided in Table 3 2.3.2. Ex Vivo Models—Human or Porcine Skin Explants Ex vivo skin models involve culturing excised human or animal skin to replicate the complex structure and microenvironment of native tissue. They are widely used to study wound healing mechanisms and inflammation, and to assess the biological effects of therapeutic interventions. A key advantage is the preservation of the original skin architecture and cell-to-cell communication. It presents the stratified epithelial organization while also maintaining the epidermis, dermis, and basement membrane layers. Ex vivo models also show communication between fibroblasts, keratinocytes, and extracellular matrix proteins. This allows for more physiologically relevant observations compared to in vitro cultures. However, these models lack vascularization, innervation, and immune cell migration, limiting their ability to accurately replicate the dynamic immune responses seen in vivo, such as the recruitment of circulating leukocytes, cytokine signaling cascades, and the resolution of inflammation. Furthermore, variability in tissue sources and preparation methods may limit reproducibility and long-term applications [ 159 In a human skin explant model mimicking superficial wounds via tape-stripping, the topical application of octenidine dihydrochloride-based hydrogel promoted wound healing by lowering inflammatory and proteolytic activity, shown by reduced cytokine and matrix metalloproteinase expression [ 160 165 166 167 In an ex vivo porcine skin model treated with adamantane-based collagen mimetic peptide (CMP) hydrogel, the hydrogel showed satisfactory permeation for the peptide, leading to its localization in the epidermis and dermis [ 168 169 In vivo models involve various animal species such as mice, rats, rabbits, and guinea pigs. Common in vivo models include surgical wounds (incisional or excisional), diabetic non-healing wounds (induced via chemical methods), burn wounds of varying depth, and, less commonly, ischemic or radiation-induced wounds. 2.3.3. In Vivo Wound Healing Models Several models can be employed to create a standardized wound in vivo ( Figure 2 Table 4 Table 5 Table 6 170 171 Another type of wound is the burn wound, which is a thermal injury induced to study scarring, delayed healing, or infection. Special types of models can be created using ischemia or diabetic wounds when the animals, usually mice or rats, have a previously induced diabetes mellitus condition (e.g., streptozocin STZ -induced diabetic mice). These models mimic chronic or non-healing wounds [ 171 Surgical Wounds The in vivo surgical wound model is a widely used technique to study wound healing processes under controlled biological conditions. Surgical wounds can be developed in animal subjects (mice, rats, guinea pigs, rabbits, pigs, or larger animals) and simulate different types of wounds to assess tissue regeneration, epithelialization, healing mechanisms, therapeutic interventions, scarring, and inflammation. Lab animals typically used for these kinds of models are mice and rats due to the low costs, easy handling in the lab, and well-characterized phenotype, including the immune response ( Table 4 Figure 2 The efficacy of different gel formulations containing naturally derived antioxidants [ 173 175 176 177 183 174 179 193 Table 4 Diabetic wounds heal poorly due to peripheric angiopathy and neuropathy-induced changes and chronic inflammation [ 197 198 Figure 3 187 186 In nonhealing surgical wounds, an efficient approach was the local therapy with extracellular vesicles, cellular fractions, and ECM embedded in gel formulations. The advantages are multiple: low immunogenicity, since they contain no intact cells; well-preserved vesicles, which allow transport of the active compounds through the wound bed; and direct cell stimulation by growth factors [ 178 188 189 192 Developing an antibacterial hydrogel for the therapy of surgical wounds, particularly efficient against Staphylococcus aureus, a common pathogen found in the wound bed of humans and animals, was attempted by incorporation of ZnO nanoparticles in a double-layer alginate dressing [ 199 200 201 Another issue that needs to be solved when using hydrogels for local therapy on in vivo animals or humans is their mechanical properties, particularly stiffness, adhesion, and moisture retention characteristics. These properties are required for the initial application of the hydrogel and afterwards for the persistence of the gel on the wound. An interesting approach was the development of an injectable, self-healing hydrogel composite (OGN-7) using oxidized alginate, gelatin, and 5 mg/mL PCL:gelatin nanofibers (7:3 ratio). Dual Schiff-base crosslinking and nanofiber integration enabled in situ gelation without additional crosslinkers. OGN-7 demonstrated enhanced stiffness, faster gelation, excellent remendability, and biocompatibility. It fully fused within 1 h, maintained mechanical integrity under stress, and outperformed standard alginate dressings in a full-thickness wound model. Histological analysis confirmed improved re-epithelialization and collagen deposition [ 202 Another approach is the patch application directly on the wound bed because of the adhesive, hydration, drug delivery, and antimicrobial properties of these complex formulations, such as chitosan with doxycycline, zinc, and selenium nanoparticle patches [ 184 185 194 Table 4 Stimulation of wound bed cell proliferation can be performed by local physical therapies such as laser [ 190 196 195 Figure 2 Moreover, mutations can be induced in mice to generate adequate models for the study of healing mechanisms. Systemic interleukin-10 administration improved wound healing, reduced inflammation, and enhanced scar quality in KO mice with double deletion of IL-10 and IL-4 genes, proving the important role of IL-10, an anti-inflammatory cytokine, in the normal healing process [ 191 The use of rabbits for the generation of surgical wounds is beneficial since it allows a larger wound area, which is more useful for the efficacy and biocompatibility of dressings or biomaterials. In a recent study, a nanoemulsion hydrogel with Hypericum perforatum upregulated growth factors, increased vessel growth, and showed antimicrobial characteristics in rabbits [ 172 181 Burn Wounds Burn wounds represent a model mainly used to study the scarring in different conditions in a chronic or nonhealing/infected wound ( Figure 3 There are several studies that used this model to evaluate the results of local hydrogel therapies such as chitosan gel with epidermal growth factor (EGF) [ 203 204 205 206 Table 5 207 208 209 Table 5 gels-11-00705-t005_Table 5 Table 5 In vivo thermal burn wound models used for experimental research. No. Localization/Species Treatment Main Results 1 Dorsal area—rats Zinc alginate hydrogel Faster wound healing, increased angiogenesis, and fibroblast migration [ 204 2 Dorsal area—rats Gel containing verapamil HCl-loaded nanofibers composed with alginate Controlled release of verapamil leading to smooth, scar-free wound closure [ 205 3 Dorsal area—mice Zein/pectin/vitamin C scaffolds crosslinked to mimic hydrogel Antioxidant effects, faster re-epithelialization, anti-inflammatory activity [ 206 4 Second-degree burn on dorsal area—rats Chitosan gel with epidermal growth factor Increased cell proliferation and epithelialization, improved scar tissue formation [ 203 5 Dorsal area—rats Cream containing Clostridium Perfringens-derived wound-healing substance Enhanced skin collagen formation and increased capillary formation [ 207 6 Dorsal area—BALB/c mice Ointment containing Aloe emodin and resveratrol Faster wound healing by increasing blood vessel growth, upregulating IL-1β and VEGF, and stimulating immune cell response [ 208 7 Second-degree burn on dorsal area—rats Spray formulation of Olea europaea and Aloe vera leaves, Cocus nucifera fruit, and Chamomilla recutita flower plant extracts Antioxidant and anti-inflammatory effects, increased angiogenesis, faster wound healing [ 209 Other Wounds Research on complex wounds (ischemic, irradiated, deep, axial flap) showed improved healing by using topical application of platelet-derived [ 210 203 211 Table 6 gels-11-00705-t006_Table 6 Table 6 In vivo ischemic or irradiation wound models used for experimental research.  Model/Species Treatment Main Results 1 Ischemic wound in rabbits TA Platelet-derived exosome product incorporated into a surgical fibrin sealant biogel Boosted deep tissue repair by enhancing new vessel growth, structural rebuilding, and skin appendage renewal [ 210 2 Fasciocutaneous flap on rats exposed to ischemia/revascularization of the vascular pedicle LT photodynamic therapy mediated by Photofrin and 630 nm light Inhibited revascularization in axial flaps, showing reduced blood flow [ 212 3 Ischemic wound by using the Matrigel plug model on nu/nu mice TA apoptotic extracellular vesicles from tooth pulp stem cells Enhanced angiogenesis by collagen 1 delivery form vesicles and stimulation of the PI3K/AKT/VEGF pathway leading to faster wound healing [ 205 4 X-ray irradiation on mice LT-pulsed therapeutic ultrasound No beneficial effects on wound closure rate were reported [ 211 Angiotensin (1–7) with systemic administration accelerated wound healing in multiple models, including rats, diabetic mice, and guinea pigs—by maintaining flap viability and improving tissue regeneration and growth, without hypertensive effects [ 180 Limitations: species differences, ethical concerns While animal models remain a cornerstone of wound healing research [ 213 Rodents, commonly used in experimental models, differ significantly from humans in skin architecture, immune responses, and wound healing mechanisms [ 214 215 In addition, ethical concerns regarding animal use require strict regulatory oversight and justification of experimental design, in line with the 3Rs principle—Replacement, Reduction, and Refinement [ 216 Model selection must also account for practical considerations such as complexity, time, cost, and the researcher’s expertise. Ethical concerns, especially with in vivo animal models and human tissue use, are significant factors as well. Another major challenge lies in translating results from laboratory models to clinical practice. Data from in vitro studies often fail to replicate in vivo due to the intricacies of living organisms, including immune responses, hormonal regulation, and blood circulation. Furthermore, outcomes from animal studies may not accurately reflect human biology, leading to differing therapeutic effects in clinical settings compared to preclinical models. 2.4. Hydrogels in Clinical Practice Hydrogels used in the treatment of different wound types present important characteristics that may help in healing [ 217 218 219 220 221 222 223 Nowadays, skin wounds (burns, diabetic ulcers, venous ulcers, accidents, etc.) can be treated with hydrogels applied on the lesion area as solid sheets, semi-liquid (amorphic) layers [ 222 S. aureus E. coli 224 225 S. aureus E. coli 226 227 228 P. aeruginosa S. aureus 225 E. coli 225 229 230 Different adjuvants of skin wound healing were introduced in hydrogels, growth factors like platelet-derived growth factor (PDGF) [ 231 232 233 234 Nanoparticle-loaded hydrogels (metal nanoparticle hybrid hydrogels) were developed for acute (surgical, burns, etc.) and for chronic (diabetic, dermatological, etc.) wounds, patches that are enriched with silver, gold, or zinc oxide nanoparticles in hydrogel formulations that may help in tissue regeneration through their antibacterial action and drug delivery enhancement [ 235 236 237 Hybrid nanogels may adjust their characteristics (hydrophobic or hydrophilic enhancements, volume variations) to different body changes (glucose level, tissue or blood pH, temperature, biomarkers, etc.) or to environmental modifications (electrical field, magnetic field, light, etc.), features that make them efficient materials in wound treatment [ 58 238 Nanoconfined hydrogels with different nanosheets are developed, with improved properties that permit the reorganization of their structure when damaged, synthetic skin that may be used in quick repairs of human skin wounds [ 239 Some hybrid hydrogels are already used in patients, but there are concerns regarding their toxicity, the nanoparticles’ migration from the wound level, and their tissue accumulation (skin, liver, kidneys, etc.) [ 240 2.4.1. Hydrogels in Preclinical Studies The hydrogels’ effects on wounds are investigated in many different animal experimental models. To evaluate their antibacterial activity, in vivo studies used quaternized chitosan–matrigel polyacrylamide [ 241 242 243 244 245 2 246 247 248 Hydrogels able to accelerate the tissue reorganization during the healing process were developed and studied in vivo: hyaluronic acid-paeoniflorin [ 187 243 249 250 251 252 2.4.2. Hydrogels in Clinical Trials The beneficial or noxious effects of hydrogels must also be studied through clinical trials, and among the experimented formulas, the following have to be mentioned: hydrogel/nano-silver-based dressing [ 253 Olea europaea 254 255 256 Triticum vulgare ® 257 258 259 260 2.4.3. Approved and Commercialized Gels Since hydrogels contain different types of polymers, the US FDA (Food and Drug Administration) and MDA (Medical Device Amendments) incorporated these innovative treatments in class I, II, and III of risk for developing diseases related to the drug compounds. Synthetic Wound Dressings For dry skin lesions, several synthetic wound dressings are recommended: 3M™ Tegaderm™ hydrogel wound filler (propylene glycol), DermaSyn or Cutimed gel (carbomer 940), Woun’Dres (carbomer, collagen), DermaGauze™ (acrylate polymer), and Simpurity™ Hydrogel (polyethylene oxide, polyvinyl alcohol, acrylate, polyurethane). The management of ulcers and burns may be performed with Suprasorb G (CMC polymer, propylene glycol) or Simpurity™ Hydrogel (polyethylene oxide, polyvinyl alcohol, acrylate, polyurethane), and of radiation skin lesions with AquaDerm™ (2-Acrylamido-2 methyl-1-propanesulfonic acid sodium, propylene glycol, poly(ethylene glycol) dimethacrylate, 2-hydroxy-2-methylpropiophenone). Natural Wound Dressings Natural lesion-covering hydrogels are seen as wound dressings that can promote wound healing with fewer adverse reactions. Dry skin wounds may be treated with natural hydrogels like Purilon ® 261 3. Conclusions Chronic and acute wounds continue to pose major clinical and economic challenges, emphasizing the need for more effective wound care solutions. Hydrogels represent a promising class of wound dressings due to their biocompatibility, adaptability, and capacity to support the healing environment. Emerging hydrogel technologies, such as semisynthetic and stimuli-responsible hydrogels, offer enhanced functionality, including biocompatibility, antimicrobial action, tissue regeneration, drug delivery, and lower local pain. The strategic selection of appropriate in vitro and in vivo models remains critical to evaluating their therapeutic potential. While animal models have historically advanced our understanding of wound healing, their limitations highlight the growing importance of human in vitro skin models for preclinical testing. Continued innovation in hydrogel design and testing platforms holds great promise for improving patient outcomes, shortening healing times, and reducing the burden on healthcare systems. 4. Future Directions The current research gaps in the development of hydrogels for wound healing are due to two main issues: developing specific wound-type hydrogels and biological evaluation. In order to develop efficient hydrogels, there is a need for interdisciplinary collaboration between different specialists, such as chemists, physicians, biologists, and medical practitioners, to adapt the gels’ mechanical and chemical properties and biocompatibility to the biorequirements of each step of the healing process or wound type. These interactions will strongly influence five key cellular mechanisms, such as cell–cell communication, growth, migration, mechanic sensing, and tissue elaboration, reviewed in [ 262 263 Hybrid hydrogels address these challenges by combining bioactive natural polymers with durable synthetic frameworks or responsive components. This enables the development of multifunctional dressings capable of adapting to the wound microenvironment, releasing antimicrobials, anti-inflammatories, or antioxidants, and promoting cell growth and differentiation. Their versatility, along with scalable potential and cost-effective production, makes hybrid and engineered synthetic hydrogels among the most promising platforms for clinical translation. Additionally, computational modeling and artificial intelligence could help predict wound healing outcomes and optimize hydrogel formulations. Artificial intelligence (AI) and machine learning (ML) are increasingly recognized as transformative tools in hydrogel and wound dressing research, offering significant improvements over traditional trial-and-error approaches. Key properties of hydrogels, such as swelling behavior, mechanical strength, fluid handling, adhesion, tissue conformability, and biocompatibility, can be predicted with accuracy [ 264 265 266 267 Future research in wound healing should prioritize the advancement of more accurate and standardized models that better mimic human physiology. A good assessment of hydrogels would require a standardized testing protocol that involves in vitro, in vivo, and human preclinical trials, eventually leading to clinical translation. Existent in vitro and in vivo systems often fail to replicate the complexity of human wounds, particularly the immune response, vascularization, and local homeostatic imbalances leading to non-healing wounds. Given the limitations of animal models and increasing ethical concerns, there is a pressing need to adopt alternative testing strategies that reduce reliance on animal testing while still meeting regulatory standards. Emerging technologies such as full-thickness skin, organ-on-a-chip, microfluidic platforms, and 3D bioprinted skin equivalents offer promise for the creation of dynamic, human-relevant models. These models can simulate critical wound conditions such as hypoxia, infection, and inflammation and enable more predictive testing of the hydrogel performance to facilitate a better understanding of their interaction with human tissues. With the advancing of personalized medicine care, tailored hydrogels, particularly stimuli-responsive types, designed to match a specific wound type and comorbidities (e.g., diabetes, vascular disease), will likely become a key focus. To support this, wound healing models will need to incorporate patient-derived cells and tissue samples to allow for personalized testing. Acknowledgments During the preparation of this manuscript, the author(s) used ChatGPT, version -4.5 (OpenAI, San Francisco, CA, USA), for the purpose of graphical abstract design. The authors have reviewed and edited the output and take full responsibility for the content of this publication. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, I.B., I.G.G. and D.R.M.; methodology, S.G., I.B. and I.G.G.; software, A.-M.V.; validation, I.B. and I.G.G.; formal analysis I.B., I.G.G. and D.R.M., investigation, C.G., D.D., A.-M.V., A.N.C., I.F., M.Y., L.R.S. and T.S.; data curation, I.B. and I.G.G.; writing—original draft preparation, C.G., D.D., A.-M.V., A.N.C., I.F., M.M.W., M.Y., L.R.S. and T.S.; writing—review and editing, I.B. and I.G.G.; visualization, I.B. and I.G.G.; supervision, I.B.; project administration, I.B.; funding acquisition, I.G.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Data is contained within the article. Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. References 1. Yousef H. Alhajj M. Fakoya A.O. Sharma S. Anatomy, Skin (Integument), Epidermis StatPearls Publishing Treasure Island, FL, USA 2025 29262154 2. Wallace H.A. Basehore B.M. Zito P.M. Wound Healing Phases StatPearls Publishing Treasure Island, FL, USA 2025 29262065 3. Yazarlu O. Iranshahi M. Kashani H.R.K. Reshadat S. Habtemariam S. Iranshahy M. Hasanpour M. Perspective on the Application of Medicinal Plants and Natural Products in Wound Healing: A Mechanistic Review Pharmacol. Res. 2021 174 105841 10.1016/j.phrs.2021.105841 34419563 4. Brown J.A. The Role of Hyaluronic Acid in Wound Healing’s Proliferative Phase J. Wound Care 2004 13 48 51 10.12968/jowc.2004.13.2.26573 14999988 5. van Koppen C.J. Hartmann R.W. Advances in the Treatment of Chronic Wounds: A Patent Review Expert. Opin. Ther. Pat. 2015 25 931 937 10.1517/13543776.2015.1045879 26039457 6. Kus K.J.B. Ruiz E.S. Wound Dressings—A Practical Review Curr. Dermatol. Rep. 2020 9 298 308 10.1007/s13671-020-00319-w 7. Borda L.J. Macquhae F.E. Kirsner R.S. Wound Dressings: A Comprehensive Review Curr. Dermatol. Rep. 2016 5 287 297 10.1007/s13671-016-0162-5 8. Ferraz M.P. Wound Dressing Materials: Bridging Material Science and Clinical Practice Appl. Sci. 2025 15 1725 10.3390/app15041725 9. Brumberg V. Astrelina T. Malivanova T. Samoilov A. Modern Wound Dressings: Hydrogel Dressings Biomedicines 2021 9 1235 10.3390/biomedicines9091235 34572421 PMC8472341 10. Moradifar F. Sepahdoost N. Tavakoli P. Mirzapoor A. Multi-Functional Dressings for Recovery and Screenable Treatment of Wounds: A Review Heliyon 2025 11 e41465 10.1016/j.heliyon.2024.e41465 39831167 PMC11742314 11. Vowden K. Vowden P. Wound Dressings: Principles and Practice Surgery 2017 35 489 494 10.1016/j.mpsur.2017.06.005 12. Alberts A. Tudorache D.-I. Niculescu A.-G. Grumezescu A.M. Advancements in Wound Dressing Materials: Highlighting Recent Progress in Hydrogels, Foams, and Antimicrobial Dressings Gels 2025 11 123 10.3390/gels11020123 39996666 PMC11854827 13. Boateng J.S. Matthews K.H. Stevens H.N.E. Eccleston G.M. Wound Healing Dressings and Drug Delivery Systems: A Review J. Pharm. Sci. 2008 97 2892 2923 10.1002/jps.21210 17963217 14. Thambi T. Jung J.M. Lee D.S. Recent Strategies to Develop PH-Sensitive Injectable Hydrogels Biomater. Sci. 2023 11 1948 1961 10.1039/D2BM01519F 36723174 15. Rizwan M. Yahya R. Hassan A. Yar M. Azzahari A. Selvanathan V. Sonsudin F. Abouloula C. PH Sensitive Hydrogels in Drug Delivery: Brief History, Properties, Swelling, and Release Mechanism, Material Selection and Applications Polymers 2017 9 137 10.3390/polym9040137 30970818 PMC6432076 16. Boon-in S. Theerasilp M. Crespy D. Temperature-Responsive Double-Network Cooling Hydrogels ACS Appl. Polym. Mater. 2023 5 2562 2574 10.1021/acsapm.2c02189 17. Guleria S. Chopra L. Manikanika Temperature Responsive Hydrogels for Biomedical Applications Mater. Today Proc. 2023 92 356 363 10.1016/j.matpr.2023.05.167 18. Xing Y. Zeng B. Yang W. Light Responsive Hydrogels for Controlled Drug Delivery Front. Bioeng. Biotechnol. 2022 10 1075670 10.3389/fbioe.2022.1075670 36588951 PMC9800804 19. Zhu J. Wu H. Li Z. Xu X. Xing H. Wang M. Jia H. Liang L. Li C. Sun L. Responsive Hydrogels Based on Triggered Click Reactions for Liver Cancer Adv. Mater. 2022 34 e2201651 10.1002/adma.202201651 35583434 20. Zhao Y. Tan Y. Zeng C. Pan W. Ultrafast Enzyme-Responsive Hydrogel for Real-Time Assessment and Treatment Optimization in Infected Wounds J. Nanobiotechnol. 2025 23 9 10.1186/s12951-024-03078-z PMC11716278 39780182 21. Sobczak M. Enzyme-Responsive Hydrogels as Potential Drug Delivery Systems—State of Knowledge and Future Prospects Int. J. Mol. Sci. 2022 23 4421 10.3390/ijms23084421 35457239 PMC9031066 22. Li Z. Zhou Y. Li T. Zhang J. Tian H. Stimuli-responsive Hydrogels: Fabrication and Biomedical Applications VIEW 2022 3 20200112 10.1002/VIW.20200112 23. Protsak I.S. Morozov Y.M. Fundamentals and Advances in Stimuli-Responsive Hydrogels and Their Applications: A Review Gels 2025 11 30 10.3390/gels11010030 39852001 PMC11765116 24. Neumann M. di Marco G. Iudin D. Viola M. van Nostrum C.F. van Ravensteijn B.G.P. Vermonden T. Stimuli-Responsive Hydrogels: The Dynamic Smart Biomaterials of Tomorrow Macromolecules 2023 56 8377 8392 10.1021/acs.macromol.3c00967 38024154 PMC10653276 25. Qiao L. Liang Y. Chen J. Huang Y. Alsareii S.A. Alamri A.M. Harraz F.A. Guo B. Antibacterial Conductive Self-Healing Hydrogel Wound Dressing with Dual Dynamic Bonds Promotes Infected Wound Healing Bioact. Mater. 2023 30 129 141 10.1016/j.bioactmat.2023.07.015 37554541 PMC10404845 26. Kang J.I. Park K.M. Advances in Gelatin-Based Hydrogels for Wound Management J. Mater. Chem. B 2021 9 1503 1520 10.1039/D0TB02582H 33470270 27. Yang X. Wang B. Peng D. Nie X. Wang J. Yu C.-Y. Wei H. Hyaluronic Acid-Based Injectable Hydrogels for Wound Dressing and Localized Tumor Therapy: A Review Adv. Nanobiomed Res. 2022 2 2200124 10.1002/anbr.202200124 28. Wu L. Zhou Y. Zhang Y. Hu J. Ikegami Y. Aishima S. Ijima H. Fast Wound Healing with a New Functional Hyaluronic Acid Dual Network Hydrogel Gels 2025 11 266 10.3390/gels11040266 40277702 PMC12027019 29. Gu H. Li H. Wei L. Lu J. Wei Q. Collagen-Based Injectable and Self-Healing Hydrogel with Multifunction for Regenerative Repairment of Infected Wounds Regen. Biomater. 2023 10 rbad018 10.1093/rb/rbad018 36974203 PMC10039733 30. Zhang Y. Wang Y. Li Y. Yang Y. Jin M. Lin X. Zhuang Z. Guo K. Zhang T. Tan W. Application of Collagen-Based Hydrogel in Skin Wound Healing Gels 2023 9 185 10.3390/gels9030185 36975634 PMC10048510 31. El-Sayed N.S. Helmy N.M. Kamel S. Dual-Adhesive and Self-Healing Alginate-Based Hydrogel for Wound Healing Chem. Pap. 2024 78 1021 1031 10.1007/s11696-023-03140-4 32. Ishfaq B. Khan I.U. Khalid S.H. Asghar S. Design and Evaluation of Sodium Alginate-Based Hydrogel Dressings Containing Betula Utilis Extract for Cutaneous Wound Healing Front. Bioeng. Biotechnol. 2023 11 1042077 10.3389/fbioe.2023.1042077 36777244 PMC9909831 33. Bahadoran M. Shamloo A. Nokoorani Y.D. Development of a Polyvinyl Alcohol/Sodium Alginate Hydrogel-Based Scaffold Incorporating BFGF-Encapsulated Microspheres for Accelerated Wound Healing Sci. Rep. 2020 10 7342 10.1038/s41598-020-64480-9 32355267 PMC7193649 34. Miguel S.P. Ribeiro M.P. Brancal H. Coutinho P. Correia I.J. Thermoresponsive Chitosan–Agarose Hydrogel for Skin Regeneration Carbohydr. Polym. 2014 111 366 373 10.1016/j.carbpol.2014.04.093 25037363 35. Ullah F. Othman M.B.H. Javed F. Ahmad Z. Akil H.M. Classification, Processing and Application of Hydrogels: A Review Mater. Sci. Eng. C 2015 57 414 433 10.1016/j.msec.2015.07.053 26354282 36. Ghanem A.M. Ashour S.A. Hussien R.M. A review on recent advances in hydrogels as drug delivery system Int. J. Appl. Pharm. 2025 17 39 47 10.22159/ijap.2025v17i1.51987 37. Kundu R. Mahada P. Chhirang B. Das B. Cellulose Hydrogels: Green and Sustainable Soft Biomaterials Curr. Res. Green Sustain. Chem. 2022 5 100252 10.1016/j.crgsc.2021.100252 38. Kushwaha J. Singh R. Cellulose Hydrogel and Its Derivatives: A Review of Application in Heavy Metal Adsorption Inorg. Chem. Commun. 2023 152 110721 10.1016/j.inoche.2023.110721 39. Ren Y. Wang Q. Xu W. Yang M. Guo W. He S. Liu W. Alginate-Based Hydrogels Mediated Biomedical Applications: A Review Int. J. Biol. Macromol. 2024 279 135019 10.1016/j.ijbiomac.2024.135019 39182869 40. Savić Gajić I.M. Savić I.M. Svirčev Z. Preparation and Characterization of Alginate Hydrogels with High Water-Retaining Capacity Polymers 2023 15 2592 10.3390/polym15122592 37376238 PMC10303585 41. Tan J. Luo Y. Guo Y. Zhou Y. Liao X. Li D. Lai X. Liu Y. Development of Alginate-Based Hydrogels: Crosslinking Strategies and Biomedical Applications Int. J. Biol. Macromol. 2023 239 124275 10.1016/j.ijbiomac.2023.124275 37011751 42. Mishra A. Omoyeni T. Singh P.K. Anandakumar S. Tiwari A. Trends in Sustainable Chitosan-Based Hydrogel Technology for Circular Biomedical Engineering: A Review Int. J. Biol. Macromol. 2024 276 133823 10.1016/j.ijbiomac.2024.133823 39002912 43. Farasati Far B. Omrani M. Naimi Jamal M.R. Javanshir S. Multi-Responsive Chitosan-Based Hydrogels for Controlled Release of Vincristine Commun. Chem. 2023 6 28 10.1038/s42004-023-00829-1 36765265 PMC9918727 44. Hong F. Qiu P. Wang Y. Ren P. Liu J. Zhao J. Gou D. Chitosan-Based Hydrogels: From Preparation to Applications, a Review Food Chem. X 2024 21 101095 10.1016/j.fochx.2023.101095 38268840 PMC10805631 45. An S. Choi S. Min S. Cho S.-W. Hyaluronic Acid-Based Biomimetic Hydrogels for Tissue Engineering and Medical Applications Biotechnol. Bioprocess Eng. 2021 26 503 516 10.1007/s12257-020-0343-8 46. Gholamali I. Vu T.T. Jo S.-H. Park S.-H. Lim K.T. Exploring the Progress of Hyaluronic Acid Hydrogels: Synthesis, Characteristics, and Wide-Ranging Applications Materials 2024 17 2439 10.3390/ma17102439 38793505 PMC11123044 47. Grieco M. Ursini O. Palamà I.E. Gigli G. Moroni L. Cortese B. HYDRHA: Hydrogels of Hyaluronic Acid. New Biomedical Approaches in Cancer, Neurodegenerative Diseases, and Tissue Engineering Mater. Today Bio 2022 17 100453 10.1016/j.mtbio.2022.100453 PMC9568881 36254248 48. Guan D. Li W. Zhao S. Tao Z. Liu K. Liu Q. Kong W. Zhu S. Sun Y. Carboxymethyl Cellulose-Enhanced Recombinant Human Collagen Hydrogel Promotes Hemostasis and Wound Healing Int. J. Biol. Macromol. 2025 315 144458 10.1016/j.ijbiomac.2025.144458 40409634 49. Alberts A. Bratu A.G. Niculescu A.-G. Grumezescu A.M. Collagen-Based Wound Dressings: Innovations, Mechanisms, and Clinical Applications Gels 2025 11 271 10.3390/gels11040271 40277707 PMC12026876 50. She J. Liu J. Mu Y. Lv S. Tong J. Liu L. He T. Wang J. Wei D. Recent Advances in Collagen-Based Hydrogels: Materials, Preparation and Applications React. Funct. Polym. 2025 207 106136 10.1016/j.reactfunctpolym.2024.106136 51. Xiang L. Cui W. Biomedical Application of Photo-Crosslinked Gelatin Hydrogels J. Leather Sci. Eng. 2021 3 3 10.1186/s42825-020-00043-y 52. Mohanto S. Narayana S. Merai K.P. Kumar J.A. Bhunia A. Hani U. Al Fatease A. Gowda B.H.J. Nag S. Ahmed M.G. Advancements in Gelatin-Based Hydrogel Systems for Biomedical Applications: A State-of-the-Art Review Int. J. Biol. Macromol. 2023 253 127143 10.1016/j.ijbiomac.2023.127143 37793512 53. Andreazza R. Morales A. Pieniz S. Labidi J. Gelatin-Based Hydrogels: Potential Biomaterials for Remediation Polymers 2023 15 1026 10.3390/polym15041026 36850309 PMC9961760 54. Li S. Dan X. Chen H. Li T. Liu B. Ju Y. Li Y. Lei L. Fan X. Developing Fibrin-Based Biomaterials/Scaffolds in Tissue Engineering Bioact. Mater. 2024 40 597 623 10.1016/j.bioactmat.2024.08.006 39239261 PMC11375146 55. Catoira M.C. Fusaro L. Di Francesco D. Ramella M. Boccafoschi F. Overview of Natural Hydrogels for Regenerative Medicine Applications J. Mater. Sci. Mater. Med. 2019 30 115 10.1007/s10856-019-6318-7 31599365 PMC6787111 56. Lin X. Zhao X. Xu C. Wang L. Xia Y. Progress in the Mechanical Enhancement of Hydrogels: Fabrication Strategies and Underlying Mechanisms J. Polym. Sci. 2022 60 2525 2542 10.1002/pol.20220154 57. Shukla A. Syaifie P.H. Rochman N.T. Jaya Syaifullah S. Jauhar M.M. Mardliyati E. A Recent Study of Natural Hydrogels: Improving Mechanical Properties for Biomedical Applications Biomed. Mater. 2025 20 022010 10.1088/1748-605X/adb2cd 39908671 58. Cai M.-H. Chen X.-Y. Fu L.-Q. Du W.-L. Yang X. Mou X.-Z. Hu P.-Y. Design and Development of Hybrid Hydrogels for Biomedical Applications: Recent Trends in Anticancer Drug Delivery and Tissue Engineering Front. Bioeng. Biotechnol. 2021 9 630943 10.3389/fbioe.2021.630943 33681168 PMC7925894 59. Sun S. Cui Y. Yuan B. Dou M. Wang G. Xu H. Wang J. Yin W. Wu D. Peng C. Drug Delivery Systems Based on Polyethylene Glycol Hydrogels for Enhanced Bone Regeneration Front. Bioeng. Biotechnol. 2023 11 1117647 10.3389/fbioe.2023.1117647 36793443 PMC9923112 60. Bakaic E. Smeets N.M.B. Hoare T. Injectable Hydrogels Based on Poly(Ethylene Glycol) and Derivatives as Functional Biomaterials RSC Adv. 2015 5 35469 35486 10.1039/C4RA13581D 61. Wu S. Hua M. Alsaid Y. Du Y. Ma Y. Zhao Y. Lo C. Wang C. Wu D. Yao B. Poly(Vinyl Alcohol) Hydrogels with Broad-Range Tunable Mechanical Properties via the Hofmeister Effect Adv. Mater. 2021 33 2007829 10.1002/adma.202007829 33554414 62. Bercea M. Recent Advances in Poly(Vinyl Alcohol)-Based Hydrogels Polymers 2024 16 2021 10.3390/polym16142021 39065336 PMC11281164 63. Penkavova V. Spalova A. Tomas J. Tihon J. Polyacrylamide Hydrogels Prepared by Varying Water Content during Polymerization: Material Characterization, Reswelling Ability, and Aging Resistance Polym. Eng. Sci. 2022 62 901 916 10.1002/pen.25895 64. Cresens C. Aytekin S. Shaghaghi B. Gerrits L. Montero-Calle A. Barderas R. Kouwer P. Rocha S. Synthesis and Mechanical Characterization of Polyacrylamide (PAAm) Hydrogels with Different Stiffnesses for Large-Batch Cell Culture Applications bioRxiv 2024 10.1101/2024.09.17.613503 65. Zare M. Bigham A. Zare M. Luo H. Rezvani Ghomi E. Ramakrishna S. PHEMA: An Overview for Biomedical Applications Int. J. Mol. Sci. 2021 22 6376 10.3390/ijms22126376 34203608 PMC8232190 66. Halpenny G.M. Steinhardt R.C. Okialda K.A. Mascharak P.K. Characterization of PHEMA-Based Hydrogels That Exhibit Light-Induced Bactericidal Effect via Release of NO J. Mater. Sci. Mater. Med. 2009 20 2353 2360 10.1007/s10856-009-3795-0 19554428 PMC2778696 67. Visan A.I. Negut I. Development and Applications of PLGA Hydrogels for Sustained Delivery of Therapeutic Agents Gels 2024 10 497 10.3390/gels10080497 39195026 PMC11353330 68. Rahmani F. Atabaki R. Behrouzi S. Mohamadpour F. Kamali H. The Recent Advancement in the PLGA-Based Thermo-Sensitive Hydrogel for Smart Drug Delivery Int. J. Pharm. 2023 631 122484 10.1016/j.ijpharm.2022.122484 36509221 69. Hipwood L. Clegg J. Weekes A. Davern J.W. Dargaville T.R. Meinert C. Bock N. Semi-Synthetic Click-Gelatin Hydrogels as Tunable Platforms for 3D Cancer Cell Culture Gels 2022 8 821 10.3390/gels8120821 36547345 PMC9778549 70. Lambrecht S. Gazizova A. Kara S. Meyer J. Jopp S. Antimicrobial Properties and Biocompatibility of Semi-Synthetic Carbohydrate-Based Ionic Hydrogels RSC Adv. 2024 14 30719 30731 10.1039/D4RA05695G 39328876 PMC11425042 71. Alavarse A.C. Frachini E.C.G. da Silva R.L.C.G. Lima V.H. Shavandi A. Petri D.F.S. Crosslinkers for Polysaccharides and Proteins: Synthesis Conditions, Mechanisms, and Crosslinking Efficiency, a Review Int. J. Biol. Macromol. 2022 202 558 596 10.1016/j.ijbiomac.2022.01.029 35038469 72. Khunmanee S. Jeong Y. Park H. Crosslinking Method of Hyaluronic-Based Hydrogel for Biomedical Applications J. Tissue Eng. 2017 8 2041731417726464 10.1177/2041731417726464 28912946 PMC5590699 73. Saeedi M. Moghbeli M.R. Vahidi O. Chitosan/Glycyrrhizic Acid Hydrogel: Preparation, Characterization, and Its Potential for Controlled Release of Gallic Acid Int. J. Biol. Macromol. 2023 231 123197 10.1016/j.ijbiomac.2023.123197 36639089 74. de Siqueira E.C. de França J.A.A. de Souza R.F.M. Leoterio D.M.d.S. Cordeiro J.N. Doboszewski B. Mecanisms of the Chemical Crosslinking to Obtain the Hydrogels: Synthesis, Conditions of Crosslinking and Biopharmaceutical Applications Res. Soc. Dev. 2023 12 e18312943072 10.33448/rsd-v12i8.43072 75. Cansu Tarakci E. Nihal Gevrek T. Isocyanate Group Containing Reactive Hydrogels: Facile Synthesis and Efficient Biofunctionalization Eur. Polym. J. 2022 175 111338 10.1016/j.eurpolymj.2022.111338 76. You Y. Xie Y. Jiang Z. Injectable and Biocompatible Chitosan-Alginic Acid Hydrogels Biomed. Mater. 2019 14 025010 10.1088/1748-605X/aaff3d 30650388 77. Pappalardo R. Boffito M. Cassino C. Caccamo V. Chiono V. Ciardelli G. Schiff-Base Cross-Linked Hydrogels Based on Properly Synthesized Poly(Ether Urethane)s as Potential Drug Delivery Vehicles in the Biomedical Field: Design and Characterization ACS Omega 2024 9 45774 45788 10.1021/acsomega.4c03157 39583672 PMC11579714 78. Hegazy H.A. Moon H.H. Lee D.-H. Bhang S.H. Kim Y.-C. Song C. Kim J.-H. Preparation of Polyaspartamide-Based Adhesive Hydrogels via Schiff Base Reaction with Aldehyde-Functionalized Dextran Mater. Adv. 2023 4 1989 1997 10.1039/D3MA00032J 79. Buhus G. Popa M. Desbrieres J. Hydrogels Based on Carboxymethylcellulose and Gelatin for Inclusion and Release of Chloramphenicol J. Bioact. Compat. Polym. 2009 24 525 545 10.1177/0883911509349687 80. Akakuru O.U. Isiuku B.O. Chitosan Hydrogels and Their Glutaraldehyde-Crosslinked Counterparts as Potential Drug Release and Tissue Engineering Systems—Synthesis, Characterization, Swelling Kinetics and Mechanism J. Phys. Chem. Biophys. 2017 7 1 7 10.4172/2161-0398.1000256 81. Demirbilek C. Dinç C.Ö. Diethylaminoethyl Dextran/Epichlorohydrin (DEAE-D/ECH) Hydrogel as Adsorbent for Murexide Desalination Water Treat. 2016 57 6884 6893 10.1080/19443994.2015.1013506 82. Sarmah D. Borah M. Mandal M. Karak N. Swelling Induced Mechanically Tough Starch–Agar Based Hydrogel as a Control Release Drug Vehicle for Wound Dressing Applications J. Mater. Chem. B 2023 11 2927 2936 10.1039/D2TB02775E 36912351 83. Andrade del Olmo J. Alonso J.M. Sáez Martínez V. Ruiz-Rubio L. Pérez González R. Vilas-Vilela J.L. Pérez-Álvarez L. Biocompatible Hyaluronic Acid-Divinyl Sulfone Injectable Hydrogels for Sustained Drug Release with Enhanced Antibacterial Properties against Staphylococcus Aureus Mater. Sci. Eng. C 2021 125 112102 10.1016/j.msec.2021.112102 33965111 84. Gomez I. Alesanco Y. Blázquez J.A. Viñuales A. Colmenares L.C. Room-Temperature Self-Standing Cellulose-Based Hydrogel Electrolytes for Electrochemical Devices Polymers 2020 12 2686 10.3390/polym12112686 33203005 PMC7696359 85. Irvine G. Dawson F. George A. Kopeć M. Are Polymer Gels Synthesized by Free Radical Polymerization with Cleavable Crosslinkers Really Degradable? Eur. Polym. J. 2024 213 113089 10.1016/j.eurpolymj.2024.113089 86. Tran H.D.N. Park K.D. Ching Y.C. Huynh C. Nguyen D.H. A Comprehensive Review on Polymeric Hydrogel and Its Composite: Matrices of Choice for Bone and Cartilage Tissue Engineering J. Ind. Eng. Chem. 2020 89 58 82 10.1016/j.jiec.2020.06.017 87. Shantha K.L. Harding D.R.K. Synthesis and Evaluation of Sucrose-containing Polymeric Hydrogels for Oral Drug Delivery J. Appl. Polym. Sci. 2002 84 2597 2604 10.1002/app.10378 88. de Nooy A.E.J. Capitani D. Masci G. Crescenzi V. Ionic Polysaccharide Hydrogels via the Passerini and Ugi Multicomponent Condensations: Synthesis, Behavior and Solid-State NMR Characterization Biomacromolecules 2000 1 259 267 10.1021/bm005517h 11710109 89. Zhang R. Tang M. Bowyer A. Eisenthal R. Hubble J. A Novel PH- and Ionic-Strength-Sensitive Carboxy Methyl Dextran Hydrogel Biomaterials 2005 26 4677 4683 10.1016/j.biomaterials.2004.11.048 15722138 90. Cai X. Hu S. Yu B. Cai Y. Yang J. Li F. Zheng Y. Shi X. Transglutaminase-Catalyzed Preparation of Crosslinked Carboxymethyl Chitosan/Carboxymethyl Cellulose/Collagen Composite Membrane for Postsurgical Peritoneal Adhesion Prevention Carbohydr. Polym. 2018 201 201 210 10.1016/j.carbpol.2018.08.065 30241812 91. Lai E. Bao B. Zhu Y. Lin H. Transglutaminase-Catalyzed Bottom-Up Synthesis of Polymer Hydrogel Front. Bioeng. Biotechnol. 2022 10 824747 10.3389/fbioe.2022.824747 35392400 PMC8980521 92. Priya A.S. Premanand R. Ragupathi I. Bhaviripudi V.R. Aepuru R. Kannan K. Shanmugaraj K. Comprehensive Review of Hydrogel Synthesis, Characterization, and Emerging Applications J. Compos. Sci. 2024 8 457 10.3390/jcs8110457 93. Zhang P. Qi J. Zhang R. Zhao Y. Yan J. Gong Y. Liu X. Zhang B. Wu X. Wu X. Recent Advances in Composite Hydrogels: Synthesis, Classification, and Application in the Treatment of Bone Defects Biomater. Sci. 2024 12 308 329 10.1039/D3BM01795H 38108454 94. Pita-López M.L. Fletes-Vargas G. Espinosa-Andrews H. Rodríguez-Rodríguez R. Physically Cross-Linked Chitosan-Based Hydrogels for Tissue Engineering Applications: A State-of-the-Art Review Eur. Polym. J. 2021 145 110176 10.1016/j.eurpolymj.2020.110176 95. Taaca K.L.M. Prieto E.I. Vasquez M.R. Current Trends in Biomedical Hydrogels: From Traditional Crosslinking to Plasma-Assisted Synthesis Polymers 2022 14 2560 10.3390/polym14132560 35808607 PMC9268762 96. Chen Y. Li J. Lu J. Ding M. Chen Y. Synthesis and Properties of Poly(Vinyl Alcohol) Hydrogels with High Strength and Toughness Polym. Test. 2022 108 107516 10.1016/j.polymertesting.2022.107516 97. Hu W. Wang Z. Xiao Y. Zhang S. Wang J. Advances in Crosslinking Strategies of Biomedical Hydrogels Biomater. Sci. 2019 7 843 855 10.1039/C8BM01246F 30648168 98. Li D. Liang R. Wang Y. Zhou Y. Cai W. Preparation of Silk Fibroin-derived Hydrogels and Applications in Skin Regeneration Health Sci. Rep. 2024 7 e2295 10.1002/hsr2.2295 39139463 PMC11319407 99. Madappura A.P. Madduri S. A Comprehensive Review of Silk-Fibroin Hydrogels for Cell and Drug Delivery Applications in Tissue Engineering and Regenerative Medicine Comput. Struct. Biotechnol. J. 2023 21 4868 4886 10.1016/j.csbj.2023.10.012 37860231 PMC10583100 100. Liaqat H. Badshah S.F. Minhas M.U. Barkat K. Khan S.A. Hussain M.D. Kazi M. PH-Sensitive Hydrogels Fabricated with Hyaluronic Acid as a Polymer for Site-Specific Delivery of Mesalamine ACS Omega 2024 9 28827 28840 10.1021/acsomega.4c03240 38973903 PMC11223520 101. Wang Y. He C. Chen C. Dong W. Yang X. Wu Y. Kong Q. Yan B. Thermoresponsive Self-Healing Zwitterionic Hydrogel as an In Situ Gelling Wound Dressing for Rapid Wound Healing ACS Appl. Mater. Interfaces 2022 14 55342 55353 10.1021/acsami.2c15820 36473731 102. Wu J. Wang W. Shen J. Zhou N. Li Y. Tang B.Z. Zhang M. A Thermosensitive Hydrogel with Efficient NIR Photothermal Conversion as Injectable Wound Dressing for Accelerating Skin Wound Healing Adv. Funct. Mater. 2024 34 2312374 10.1002/adfm.202312374 103. Chen H. Xu J. Sun J. Jiang Y. Zheng W. Hu W. Qian H. Recent Advances on Thermosensitive Hydrogels-Mediated Precision Therapy Asian J. Pharm. Sci. 2024 19 100911 10.1016/j.ajps.2024.100911 38948400 PMC11214189 104. Yang Y. Zhu W. Dong Z. Chao Y. Xu L. Chen M. Liu Z. 1D Coordination Polymer Nanofibers for Low-Temperature Photothermal Therapy Adv. Mater. 2017 29 1703588 10.1002/adma.201703588 28833643 105. Ye Y. Wang W. Liu X. Chen Y. Tian S. Fu P. A Sol–Gel Transition and Self-Healing Hydrogel Triggered via Photodimerization of Coumarin Gels 2023 10 21 10.3390/gels10010021 38247744 PMC10815305 106. Qiu W. Gehre C. Nepomuceno J.P. Bao Y. Li Z. Müller R. Qin X. Coumarin-Based Photodegradable Hydrogels Enable Two-Photon Subtractive Biofabrication at 300 Mm s −1 Angew. Chem. Int. Ed. 2024 63 e202404599 10.1002/anie.202404599 39023389 107. Wang J. Bian Y. Bai J. Gao L. Visible-Light Responsive Hydrogel Based on Methoxy Azobenzene Amphiphilic Small Molecule J. Photochem. Photobiol. A Chem. 2024 457 115893 10.1016/j.jphotochem.2024.115893 108. Homma K. Chang A.C. Yamamoto S. Tamate R. Ueki T. Nakanishi J. Design of Azobenzene-Bearing Hydrogel with Photoswitchable Mechanics Driven by Photo-Induced Phase Transition for in Vitro Disease Modeling Acta Biomater. 2021 132 103 113 10.1016/j.actbio.2021.03.028 33744500 109. Tomatsu I. Peng K. Kros A. Photoresponsive Hydrogels for Biomedical Applications Adv. Drug Deliv. Rev. 2011 63 1257 1266 10.1016/j.addr.2011.06.009 21745509 110. Ge Z. Wu H. Wu J. He Y. Tan R. Wang Y. Xiao T. Dong G. Zhou P. Xing Z. Photoresponsive Hydrogel Dressing Containing Nanoparticles with Excellent Synergetic Photodynamic, Photothermal, and Chemodynamic Therapies for Effective Infected Wound Healing ACS Appl. Bio Mater. 2024 7 6970 6984 10.1021/acsabm.4c01063 39350400 111. Castrejón-Comas V. Mataró N. Resina L. Zanuy D. Nuñez-Aulina Q. Sánchez-Morán J. Enshaei H. Arnau M. Muñoz-Galán H. Worch J.C. Electro-Responsive Hyaluronic Acid-Based Click-Hydrogels for Wound Healing Carbohydr. Polym. 2025 348 122941 10.1016/j.carbpol.2024.122941 39567156 112. Ding H. Hao L. Mao H. Magneto-Responsive Biocomposites in Wound Healing: From Characteristics to Functions J. Mater. Chem. B 2024 12 7463 7479 10.1039/D4TB00743C 38990160 113. Huang Z. Wang M. Chai L. Chen H. Chen D. Li Y. Liu H. Wu Y. Yang X. He L. Glucose-Responsive, Self-Healing, Wet Adhesive and Multi-Biofunctional Hydrogels for Diabetic Wound Healing Mater. Today Bio 2024 27 101159 10.1016/j.mtbio.2024.101159 PMC11325802 39149409 114. Cheng Q. Zhu J. Tu S. Fan X. Enzyme-Crosslinked Hyaluronic Acid-Based Multifunctional Hydrogel Promotes Diabetic Wound Healing Macromol. Res. 2025 33 779 788 10.1007/s13233-025-00368-9 115. Maaz Arif M. Khan S.M. Gull N. Tabish T.A. Zia S. Ullah Khan R. Awais S.M. Arif Butt M. Polymer-Based Biomaterials for Chronic Wound Management: Promises and Challenges Int. J. Pharm. 2021 598 120270 10.1016/j.ijpharm.2021.120270 33486030 116. Hussain Z. Thu H.E. Shuid A.N. Katas H. Hussain F. Recent Advances in Polymer-Based Wound Dressings for the Treatment of Diabetic Foot Ulcer: An Overview of State-of-the-Art Curr. Drug Targets 2018 19 527 550 10.2174/1389450118666170704132523 28676002 117. Heremans J. Ballet S. Martin C. The Versatility of Peptide Hydrogels: From Self-assembly to Drug Delivery Applications J. Pept. Sci. 2025 31 e3662 10.1002/psc.3662 39561971 118. Bakhtiary N. Ghalandari B. Ghorbani F. Varma S.N. Liu C. Advances in Peptide-Based Hydrogel for Tissue Engineering Polymers 2023 15 1068 10.3390/polym15051068 36904309 PMC10005633 119. Cauwenbergh T. Ballet S. Martin C. Peptide Hydrogel-Drug Conjugates for Tailored Disease Treatment Mater. Today Bio 2025 31 101423 10.1016/j.mtbio.2024.101423 39944533 PMC11815290 120. Liu J. Xi Z. Fan C. Mei Y. Zhao J. Jiang Y. Zhao M. Xu L. Hydrogels for Nucleic Acid Drugs Delivery Adv. Healthc. Mater. 2024 13 e2401895 10.1002/adhm.202401895 39152918 121. Wu R. Li W. Yang P. Shen N. Yang A. Liu X. Ju Y. Lei L. Fang B. DNA Hydrogels and Their Derivatives in Biomedical Engineering Applications J. Nanobiotechnology 2024 22 518 10.1186/s12951-024-02791-z 39210464 PMC11360341 122. Zhang Y. Yan W. Wu L. Yu Z. Quan Y. Xie X. Different Exosomes Are Loaded in Hydrogels for the Application in the Field of Tissue Repair Front. Bioeng. Biotechnol. 2025 13 1545636 10.3389/fbioe.2025.1545636 40099037 PMC11911322 123. Zheng Q. Yao J. Sun Z. Mao Y. Wei J. Xie Y. Hu X.K. Li X. Hydrogels as Carriers Deliver Stem Cells/Exosomes for Liver Injury Mater. Adv. 2024 5 3587 3601 10.1039/D3MA01046E 124. Sille I.E. Pissinis D.E. Fagali N.S. Ghilini F. Urrutia M.N. Schilardi P.L. Antimicrobial-Loaded Polyacrylamide Hydrogels Supported on Titanium as Reservoir for Local Drug Delivery Pathogens 2023 12 202 10.3390/pathogens12020202 36839473 PMC9962340 125. Ahmad N. Bukhari S.N.A. Hussain M.A. Ejaz H. Munir M.U. Amjad M.W. Nanoparticles Incorporated Hydrogels for Delivery of Antimicrobial Agents: Developments and Trends RSC Adv. 2024 14 13535 13564 10.1039/D4RA00631C 38665493 PMC11043667 126. Moorcroft S.C.T. Roach L. Jayne D.G. Ong Z.Y. Evans S.D. Nanoparticle-Loaded Hydrogel for the Light-Activated Release and Photothermal Enhancement of Antimicrobial Peptides ACS Appl. Mater. Interfaces 2020 12 24544 24554 10.1021/acsami.9b22587 32312040 127. Bâldea I. Soran M.-L. Stegarescu A. Opriș O. Kacso I. Tripon S. Adascalitei A. Fericel I.G. Decea R. Lung I. Lilium Candidum Extract Loaded in Alginate Hydrogel Beads for Chronic Wound Healing Gels 2025 11 22 10.3390/gels11010022 39851993 PMC11765094 128. Homaeigohar S. Boccaccini A.R. Antibacterial Biohybrid Nanofibers for Wound Dressings Acta Biomater. 2020 107 25 49 10.1016/j.actbio.2020.02.022 32084600 129. Aderibigbe B. Buyana B. Alginate in Wound Dressings Pharmaceutics 2018 10 42 10.3390/pharmaceutics10020042 29614804 PMC6027439 130. Zhang M. Zhao X. Alginate Hydrogel Dressings for Advanced Wound Management Int. J. Biol. Macromol. 2020 162 1414 1428 10.1016/j.ijbiomac.2020.07.311 32777428 131. Bâldea I. Lung I. Opriş O. Stegarescu A. Kacso I. Soran M.-L. Antioxidant, Anti-Inflammatory Effects and Ability to Stimulate Wound Healing of a Common-Plantain Extract in Alginate Gel Formulations Gels 2023 9 901 10.3390/gels9110901 37998991 PMC10671504 132. Zhang H. Cheng J. Ao Q. Preparation of Alginate-Based Biomaterials and Their Applications in Biomedicine Mar. Drugs 2021 19 264 10.3390/md19050264 34068547 PMC8150954 133. Pereira R. Carvalho A. Vaz D.C. Gil M.H. Mendes A. Bártolo P. Development of Novel Alginate Based Hydrogel Films for Wound Healing Applications Int. J. Biol. Macromol. 2013 52 221 230 10.1016/j.ijbiomac.2012.09.031 23059189 134. Serra M. Correia C. Malpique R. Brito C. Jensen J. Bjorquist P. Carrondo M.J.T. Alves P.M. Microencapsulation Technology: A Powerful Tool for Integrating Expansion and Cryopreservation of Human Embryonic Stem Cells PLoS ONE 2011 6 e23212 10.1371/journal.pone.0023212 21850261 PMC3151290 135. Supramaniam J. Adnan R. Mohd Kaus N.H. Bushra R. Magnetic Nanocellulose Alginate Hydrogel Beads as Potential Drug Delivery System Int. J. Biol. Macromol. 2018 118 640 648 10.1016/j.ijbiomac.2018.06.043 29894784 136. Buket Basmanav F. Kose G.T. Hasirci V. Sequential Growth Factor Delivery from Complexed Microspheres for Bone Tissue Engineering Biomaterials 2008 29 4195 4204 10.1016/j.biomaterials.2008.07.017 18691753 137. Ho T.T. Tran H.A. Doan V.K. Maitz J. Li Z. Wise S.G. Lim K.S. Rnjak-Kovacina J. Natural Polymer-Based Materials for Wound Healing Applications Adv. Nanobiomed Res. 2024 4 2300131 10.1002/anbr.202300131 138. Alberts A. Bratu A.G. Niculescu A.-G. Grumezescu A.M. New Perspectives of Hydrogels in Chronic Wound Management Molecules 2025 30 686 10.3390/molecules30030686 39942790 PMC11820815 139. Hodge J.G. Zamierowski D.S. Robinson J.L. Mellott A.J. Evaluating Polymeric Biomaterials to Improve next Generation Wound Dressing Design Biomater. Res. 2022 26 50 10.1186/s40824-022-00291-5 36183134 PMC9526981 140. Aderibigbe B.A. Hybrid-Based Wound Dressings: Combination of Synthetic and Biopolymers Polymers 2022 14 3806 10.3390/polym14183806 36145951 PMC9502880 141. Vasile C. Pamfil D. Stoleru E. Baican M. New Developments in Medical Applications of Hybrid Hydrogels Containing Natural Polymers Molecules 2020 25 1539 10.3390/molecules25071539 32230990 PMC7180755 142. Ma R. Wang Y. Qi H. Shi C. Wei G. Xiao L. Huang Z. Liu S. Yu H. Teng C. Nanocomposite Sponges of Sodium Alginate/Graphene Oxide/Polyvinyl Alcohol as Potential Wound Dressing: In Vitro and in Vivo Evaluation Compos. B Eng. 2019 167 396 405 10.1016/j.compositesb.2019.03.006 143. Rana M.M. De la Hoz Siegler H. Evolution of Hybrid Hydrogels: Next-Generation Biomaterials for Drug Delivery and Tissue Engineering Gels 2024 10 216 10.3390/gels10040216 38667635 PMC11049329 144. Liang W. Ni N. Huang Y. Lin C. An Advanced Review: Polyurethane-Related Dressings for Skin Wound Repair Polymers 2023 15 4301 10.3390/polym15214301 37959982 PMC10649939 145. Eskandarinia A. Kefayat A. Agheb M. Rafienia M. Amini Baghbadorani M. Navid S. Ebrahimpour K. Khodabakhshi D. Ghahremani F. A Novel Bilayer Wound Dressing Composed of a Dense Polyurethane/Propolis Membrane and a Biodegradable Polycaprolactone/Gelatin Nanofibrous Scaffold Sci. Rep. 2020 10 3063 10.1038/s41598-020-59931-2 32080256 PMC7033255 146. Chen H. Xing X. Tan H. Jia Y. Zhou T. Chen Y. Ling Z. Hu X. Covalently Antibacterial Alginate-Chitosan Hydrogel Dressing Integrated Gelatin Microspheres Containing Tetracycline Hydrochloride for Wound Healing Mater. Sci. Eng. C 2017 70 287 295 10.1016/j.msec.2016.08.086 27770893 147. Li S. Li L. Guo C. Qin H. Yu X. A Promising Wound Dressing Material with Excellent Cytocompatibility and Proangiogenesis Action for Wound Healing: Strontium Loaded Silk Fibroin/Sodium Alginate (SF/SA) Blend Films Int. J. Biol. Macromol. 2017 104 969 978 10.1016/j.ijbiomac.2017.07.020 28687393 148. Mokhena T.C. Luyt A.S. Electrospun Alginate Nanofibres Impregnated with Silver Nanoparticles: Preparation, Morphology and Antibacterial Properties Carbohydr. Polym. 2017 165 304 312 10.1016/j.carbpol.2017.02.068 28363554 149. Jessy Mercy D. Thirumalai A. Udayakumar S. Deepika B. Janani G. Girigoswami A. Girigoswami K. Enhancing Wound Healing with Nanohydrogel-Entrapped Plant Extracts and Nanosilver: An In Vitro Investigation Molecules 2024 29 5004 10.3390/molecules29215004 39519646 PMC11547294 150. Ningrum D.R. Hanif W. Mardhian D.F. Asri L.A.T.W. In Vitro Biocompatibility of Hydrogel Polyvinyl Alcohol/Moringa Oleifera Leaf Extract/Graphene Oxide for Wound Dressing Polymers 2023 15 468 10.3390/polym15020468 36679348 PMC9864398 151. Guo C. Zhou Z. Zhang S. Peng P. Liu J. Yan Y. Dong J. Sulfonated, Quaternized, and Chlorogenic Acid Composited Sodium Alginate Hydrogels/Eucommia Ulmoides Rubber Films as in Vitro Antibacterial Wound Dressings for Accelerating Wound Healing Ind. Crops Prod. 2022 190 115885 10.1016/j.indcrop.2022.115885 152. Hofmann E. Fink J. Pignet A.-L. Schwarz A. Schellnegger M. Nischwitz S.P. Holzer-Geissler J.C.J. Kamolz L.-P. Kotzbeck P. Human In Vitro Skin Models for Wound Healing and Wound Healing Disorders Biomedicines 2023 11 1056 10.3390/biomedicines11041056 37189674 PMC10135654 153. Yadav P.D. Londhe P.V. Chavan S.S. Mohite D.D. Firame G.B. Kadam S.S. Patil M.J. Ansari M.I. Electrospun Composite Nanofibers for Wound Healing: Synthesis, Characterization, and Clinical Potential of Biopolymer-Based Materials Discov. Mater. 2024 4 99 10.1007/s43939-024-00173-8 154. Joshi A.S. Madhusudanan M. Mijakovic I. 3D Printed Inserts for Reproducible High Throughput Screening of Cell Migration Front. Cell Dev. Biol. 2023 11 1256250 10.3389/fcell.2023.1256250 37711850 PMC10498783 155. Joshi A.S. Advancing in Vitro Cell Migration Studies: A Review of Open-Source Analytical Platforms for Cancer and Wound Healing Research Cell Adhes. Migr. 2025 19 2488116 10.1080/19336918.2025.2488116 40241248 PMC12006941 156. Nandi S. Brown A.C. Characterizing Cell Migration Within Three-Dimensional In Vitro Wound Environments J. Vis. Exp. 2017 126 e56099 10.3791/56099 PMC5614316 28872146 157. Azzam S. Tomasova L. Danner C. Skiba M. Klein M. Guttenberg Z. Michaelis S. Wegener J. A High-Precision Wound Healing Assay Based on Photosensitized Culture Substrates Sci. Rep. 2024 14 9103 10.1038/s41598-024-59564-9 38643292 PMC11032384 158. Biglari S. Le T.Y.L. Tan R.P. Wise S.G. Zambon A. Codolo G. De Bernard M. Warkiani M. Schindeler A. Naficy S. Simulating Inflammation in a Wound Microenvironment Using a Dermal Wound-on-a-Chip Model Adv. Healthc. Mater. 2019 8 e1801307 10.1002/adhm.201801307 30511808 159. Flynn K. Mahmoud N.N. Sharifi S. Gould L.J. Mahmoudi M. Chronic Wound Healing Models ACS Pharmacol. Transl. Sci. 2023 6 783 801 10.1021/acsptsci.3c00030 37200810 PMC10186367 160. Seiser S. Janker L. Zila N. Mildner M. Rakita A. Matiasek J. Bileck A. Gerner C. Paulitschke V. Elbe-Bürger A. Octenidine-Based Hydrogel Shows Anti-Inflammatory and Protease-Inhibitory Capacities in Wounded Human Skin Sci. Rep. 2021 11 32 10.1038/s41598-020-79378-9 33420112 PMC7794247 161. Liu C. Rinderknecht H. Histing T. Kolbenschlag J. Nussler A.K. Ehnert S. Establishment of an In Vitro Scab Model for Investigating Different Phases of Wound Healing Bioengineering 2022 9 191 10.3390/bioengineering9050191 35621469 PMC9137770 162. Kapałczyńska M. Kolenda T. Przybyła W. Zajączkowska M. Teresiak A. Filas V. Ibbs M. Bliźniak R. Łuczewski Ł. Lamperska K. 2D and 3D Cell Cultures—A Comparison of Different Types of Cancer Cell Cultures Arch. Med. Sci. 2016 14 910 10.5114/aoms.2016.63743 30002710 PMC6040128 163. Haisma E.M. Rietveld M.H. de Breij A. van Dissel J.T. El Ghalbzouri A. Nibbering P.H. Inflammatory and Antimicrobial Responses to Methicillin-Resistant Staphylococcus Aureus in an In Vitro Wound Infection Model PLoS ONE 2013 8 e82800 10.1371/journal.pone.0082800 24340061 PMC3858326 164. Mieremet A. Rietveld M. Absalah S. van Smeden J. Bouwstra J.A. El Ghalbzouri A. Improved Epidermal Barrier Formation in Human Skin Models by Chitosan Modulated Dermal Matrices PLoS ONE 2017 12 e0174478 10.1371/journal.pone.0174478 28333992 PMC5363943 165. Folle C. Díaz-Garrido N. Mallandrich M. Suñer-Carbó J. Sánchez-López E. Halbaut L. Marqués A.M. Espina M. Badia J. Baldoma L. Hydrogel of Thyme-Oil-PLGA Nanoparticles Designed for Skin Inflammation Treatment Gels 2024 10 149 10.3390/gels10020149 38391479 PMC10887549 166. Gross-Amat O. Guillen M. Salmon D. Nataf S. Auxenfans C. Characterization of a Topically Testable Model of Burn Injury on Human Skin Explants Int. J. Mol. Sci. 2020 21 6956 10.3390/ijms21186956 32971882 PMC7554828 167. O’Connor N.A. Syed A. Kastrat E. Cheng H.-P. Antibacterial Silver Nanoparticle Containing Polydopamine Hydrogels That Enhance Re-Epithelization Gels 2024 10 363 10.3390/gels10060363 38920909 PMC11202472 168. Singh V. Marimuthu T. Lesotho N.F. Makatini M.M. Ntombela T. Van Eyk A. Choonara Y.E. Synthesis of a Retro ACS Appl. Bio Mater. 2025 8 4657 4672 10.1021/acsabm.4c01895 39970309 PMC12175121 169. Zhao R. Zhao C. Wan Y. Majid M. Abbas S.Q. Wang Y. In Vitro and in Vivo Evaluation of Alginate Hydrogel-Based Wound Dressing Loaded with Green Chemistry Cerium Oxide Nanoparticles Front. Chem. 2023 11 1298808 10.3389/fchem.2023.1298808 38075491 PMC10701403 170. Gurtner G.C. Werner S. Barrandon Y. Longaker M.T. Wound Repair and Regeneration Nature 2008 453 314 321 10.1038/nature07039 18480812 171. Grada A. Mervis J. Falanga V. Research Techniques Made Simple: Animal Models of Wound Healing J. Investig. Dermatol. 2018 138 2095 2105.e1 10.1016/j.jid.2018.08.005 30244718 172. Kurt A.A. Ibrahim B. Çınar H. Atsü A.N. Bursalıoğlu E.O. Bayır İ. Özmen Ö. Aslan İ. Nanoemulsion Hydrogel Delivery System of Hypericum Perforatum L.: In Silico Design, In Vitro Antimicrobial–Toxicological Profiling, and In Vivo Wound-Healing Evaluation Gels 2025 11 431 10.3390/gels11060431 40558730 PMC12192460 173. Gagliardi A. Giuliano E. Voci S. Costa N. Bulotta S. Salvatici M.C. Ambrosio N. Paolino D. Siddique F. Majid M. Rutin-Loaded Zein Gel as a Green Biocompatible Formulation for Wound Healing Application Int. J. Biol. Macromol. 2024 269 132071 10.1016/j.ijbiomac.2024.132071 38705334 174. Grover P. Khanna K. Bhatnagar A. Purkayastha J. In Vivo-Wound Healing Studies of Sodium Thiosulfate Gel in Rats Biomed. Pharmacother. 2021 140 111797 10.1016/j.biopha.2021.111797 34098193 175. Okur M.E. Karadağ A.E. Üstündağ Okur N. Özhan Y. Sipahi H. Ayla Ş. Daylan B. Demirci B. Demirci F. In Vivo Wound Healing and In Vitro Anti-Inflammatory Activity Evaluation of Phlomis Russeliana Extract Gel Formulations Molecules 2020 25 2695 10.3390/molecules25112695 32531998 PMC7321211 176. Akbari F. Azadbakht M. Bagheri A. Vahedi L. In Vitro and In Vivo Wound Healing Activity of Astragalus Floccosus Boiss. (Fabaceae) Adv. Pharmacol. Pharm. Sci. 2022 2022 1 15 10.1155/2022/7865015 PMC8983193 35392504 177. Jabbar A.A. Abdul-Aziz Ahmed K. Abdulla M.A. Abdullah F.O. Salehen N.A. Mothana R.A. Houssaini J. Hassan R.R. Hawwal M.F. Fantoukh O.I. Sinomenine Accelerate Wound Healing in Rats by Augmentation of Antioxidant, Anti-Inflammatory, Immunuhistochemical Pathways Heliyon 2024 10 e23581 10.1016/j.heliyon.2023.e23581 38173533 PMC10761791 178. Li H. Ziemer M. Stojanovic I. Saksida T. Maksimovic-Ivanic D. Mijatovic S. Djmura G. Gajic D. Koprivica I. Krajnovic T. Mesenchymal Stem Cells From Mouse Hair Follicles Reduce Hypertrophic Scarring in a Murine Wound Healing Model Stem Cell Rev. Rep. 2022 18 2028 2044 10.1007/s12015-021-10288-7 35080748 PMC9391240 179. Tunç A.S. Ercan N. Effect of Topical Sildenafil on Wound Healing and Oxidative Stress in Rats Injury 2024 55 111525 10.1016/j.injury.2024.111525 38608450 180. Rodgers K. Xiong S. Felix J. Roda N. Espinoza T. Maldonado S. Dizerega G. Development of Angiotensin (1-7) as an Agent to Accelerate Dermal Repair Wound Repair Regen. 2001 9 238 247 10.1046/j.1524-475x.2001.00238.x 11472620 181. Jia Y. Zhao G. Jia J. Preliminary Evaluation: The Effects of Aloe Ferox Miller and Aloe Arborescens Miller on Wound Healing J. Ethnopharmacol. 2008 120 181 189 10.1016/j.jep.2008.08.008 18773950 182. Choi J. Park Y.-G. Yun M.-S. Seol J.-W. Effect of Herbal Mixture Composed of Alchemilla Vulgaris and Mimosa on Wound Healing Process Biomed. Pharmacother. 2018 106 326 332 10.1016/j.biopha.2018.06.141 29966977 183. Oladejo O.W. Imosemi I.O. Osuagwu F.C. Oyedele O.O. Oluwadara O.O. Ekpo O.E. Aiku A. Adewoyin O. Akang E.E.U. A Comparative Study of the Wound Healing Properties of Honey and Ageratum Conyzoides Afr. J. Med. Med. Sci. 2003 32 193 196 15032468 184. Khosravian P. Motamedi N. Javdani M. Khorasgani E.M. Histopathologic Evaluation of Skin Wound Healing Due to Local Application of Transdermal Chitosan Patch in Combination with Doxycycline, Zinc Nanoparticles, and Selenium Nanoparticles in Mice BMC Vet. Res. 2025 21 221 10.1186/s12917-025-04672-5 40159480 PMC11956256 185. Nordback P.H. Miettinen S. Kääriäinen M. Haaparanta A.-M. Kellomäki M. Kuokkanen H. Seppänen R. Chitosan Membranes in a Rat Model of Full-Thickness Cutaneous Wounds: Healing and IL-4 Levels J. Wound Care 2015 24 245 251 10.12968/jowc.2015.24.6.245 26075372 186. Ozkaya H. Omma T. Bag Y.M. Uzunoglu K. Isildak M. Duymus M.E. Kismet K. Senes M. Fidanci V. Celepli P. Topical and Systemic Effects of N-Acetyl Cysteine on Wound Healing in a Diabetic Rat Model Wounds 2019 31 91 96 30802208 187. Yang H. Song L. Sun B. Chu D. Yang L. Li M. Li H. Dai Y. Yu Z. Guo J. Modulation of Macrophages by a Paeoniflorin-Loaded Hyaluronic Acid-Based Hydrogel Promotes Diabetic Wound Healing Mater. Today Bio 2021 12 100139 10.1016/j.mtbio.2021.100139 34632363 PMC8488309 188. Ru J. Zhang Q. Zhu S. Cai J. He Y. Lu F. Delivery of Adipose-Derived Growth Factors from Heparinized Adipose Acellular Matrix Accelerates Wound Healing Front. Bioeng. Biotechnol. 2023 11 1270618 10.3389/fbioe.2023.1270618 37854882 PMC10579818 189. Li R. Wang H. Wang X. Yang Y. Zhong K. Zhang X. Li H. MSC-EVs and UCB-EVs Promote Skin Wound Healing and Spatial Transcriptome Analysis Sci. Rep. 2025 15 4006 10.1038/s41598-025-87592-6 39893214 PMC11787299 190. Hong S.E. Hong M.K. Kang S.R. Young Park B. Effects of Neodymium–Yttrium–Aluminum Garnet (Nd:YAG) Pulsed High-Intensity Laser Therapy on Full Thickness Wound Healing in an Experimental Animal Model J. Cosmet. Laser Ther. 2016 18 432 437 10.1080/14764172.2016.1202421 27351234 191. Kieran I. Knock A. Bush J. So K. Metcalfe A. Hobson R. Mason T. O’Kane S. Ferguson M. Interleukin-10 Reduces Scar Formation in Both Animal and Human Cutaneous Wounds: Results of Two Preclinical and Phase II Randomized Control Studies Wound Repair Regen. 2013 21 428 436 10.1111/wrr.12043 23627460 192. Deng C. He Y. Feng J. Dong Z. Yao Y. Mok H. Lin M. Feng L. Extracellular Matrix/Stromal Vascular Fraction Gel Conditioned Medium Accelerates Wound Healing in a Murine Model Wound Repair Regen. 2017 25 923 932 10.1111/wrr.12602 29240284 193. Ebrahimi A. Reza Farahpour M. Amjadi S. Mohammadi M. Hamishehkar H. Nanoliposomal Peptides Derived from Spirulina Platensis Protein Accelerate Full-Thickness Wound Healing Int. J. Pharm. 2023 630 122457 10.1016/j.ijpharm.2022.122457 36455754 194. Gil E.S. Panilaitis B. Bellas E. Kaplan D.L. Functionalized Silk Biomaterials for Wound Healing Adv. Healthc. Mater. 2013 2 206 217 10.1002/adhm.201200192 23184644 PMC3735446 195. Huang Y. Qin P. Zhou P. Long B. Zhang S. Gao R. Zhu B. Li Y. Li Q. Non-Pharmacological Interventions of Intermittent Fasting and Pulsed Radiofrequency Energy (PRFE) Combination Therapy Promote Diabetic Wound Healing Nutr. Diabetes 2024 14 83 10.1038/s41387-024-00344-9 39375333 PMC11458794 196. Mehmandoust F.G. Torkaman G. Firoozabadi M. Talebi G. Anodal and Cathodal Pulsed Electrical Stimulation on Skin Wound Healing in Guinea Pigs J. Rehabil. Res. Dev. 2007 44 611 10.1682/JRRD.2007.01.0007 18247258 197. Burgess J.L. Wyant W.A. Abdo Abujamra B. Kirsner R.S. Jozic I. Diabetic Wound-Healing Science Medicina 2021 57 1072 10.3390/medicina57101072 34684109 PMC8539411 198. Zhang W. Liu L. Cheng H. Zhu J. Li X. Ye S. Li X. Hydrogel-Based Dressings Designed to Facilitate Wound Healing Mater. Adv. 2024 5 1364 1394 10.1039/D3MA00682D 199. Wang T. Wang J. Wang R. Yuan P. Fan Z. Yang S. Preparation and Properties of ZnO/Sodium Alginate Bi-Layered Hydrogel Films as Novel Wound Dressings New J. Chem. 2019 43 8684 8693 10.1039/C9NJ00402E 200. Nešović K. Mišković-Stanković V. A Comprehensive Review of the Polymer-based Hydrogels with Electrochemically Synthesized Silver Nanoparticles for Wound Dressing Applications Polym. Eng. Sci. 2020 60 1393 1419 10.1002/pen.25410 201. Hajiali H. Summa M. Russo D. Armirotti A. Brunetti V. Bertorelli R. Athanassiou A. Mele E. Alginate–Lavender Nanofibers with Antibacterial and Anti-Inflammatory Activity to Effectively Promote Burn Healing J. Mater. Chem. B 2016 4 1686 1695 10.1039/C5TB02174J 32263019 202. Hong C. Chung H. Lee G. Kim D. Jiang Z. Kim S.-H. Lee K. Remendable Cross-Linked Alginate/Gelatin Hydrogels Incorporating Nanofibers for Wound Repair and Regeneration Biomacromolecules 2024 25 4344 4357 10.1021/acs.biomac.4c00406 38917335 203. Alemdaroğlu C. Değim Z. Çelebi N. Zor F. Öztürk S. Erdoğan D. An Investigation on Burn Wound Healing in Rats with Chitosan Gel Formulation Containing Epidermal Growth Factor Burns 2006 32 319 327 10.1016/j.burns.2005.10.015 16527411 204. Niculescu A.-G. Bîrcă A.C. Mogoşanu G.D. Rădulescu M. Holban A.M. Manuc D. Alberts A. Grumezescu A.M. Mogoantă L. Zinc Alginate Hydrogel-Coated Wound Dressings: Fabrication, Characterization, and Evaluation of Anti-Infective and In Vivo Performance Gels 2025 11 427 10.3390/gels11060427 40558725 PMC12191814 205. Barakat H.S. Freag M.S. Gaber S.M. Al Oufy A. Abdallah O.Y. Development of Verapamil Hydrochloride-Loaded Biopolymer-Based Composite Electrospun Nanofibrous Mats: In Vivo Evaluation of Enhanced Burn Wound Healing without Scar Formation Drug Des. Devel Ther. 2023 17 1211 1231 10.2147/DDDT.S389329 37113467 PMC10128156 206. Fiorentini F. Suarato G. Summa M. Miele D. Sandri G. Bertorelli R. Athanassiou A. Plant-Based, Hydrogel-like Microfibers as an Antioxidant Platform for Skin Burn Healing ACS Appl. Bio Mater. 2023 6 3103 3116 10.1021/acsabm.3c00214 PMC10445266 37493659 207. Takahashi M. Morimoto Y. Kon M. Saga K. A Histological Study of Cutaneous Thermal Wounds Using a Clostridium Perfringens J. Dermatol. 1995 22 98 106 10.1111/j.1346-8138.1995.tb03351.x 7722096 208. Lin L.-X. Wang P. Wang Y.-T. Huang Y. Jiang L. Wang X.-M. Aloe Vera and Vitis Vinifera Improve Wound Healing in an in Vivo Rat Burn Wound Model Mol. Med. Rep. 2016 13 1070 1076 10.3892/mmr.2015.4681 26677006 209. Askin S. Kaynarpinar M. Efficacy of Formulation With Potential as Herbal Medicine on Second Degree Burn Wound: Biochemical and Molecular Evaluation J. Cosmet. Dermatol. 2025 24 e70122 10.1111/jocd.70122 40098566 PMC11915081 210. Fei Y. Ling Z. Tong Q. Wang J. Apoptotic Extracellular Vesicles from Supernumerary Tooth-Derived Pulp Stem Cells Transfer COL1A1 to Promote Angiogenesis via PI3K/Akt/VEGF Pathway Int. J. Nanomed. 2024 19 6811 6828 10.2147/IJN.S466136 PMC11244074 39005959 211. Lowe A.S. Walker M.D. Cowan R. Baxter G.D. Therapeutic Ultrasound and Wound Closure: Lack of Healing Effect on x-Ray Irradiated Wounds in Murine Skin Arch. Phys. Med. Rehabil. 2001 82 1507 1511 10.1053/apmr.2001.25083 11689968 212. Belmont M.J. Marabelle N. Mang T.S. Hall R. Wax M.K. Effect of Photodynamic Therapy on Revascularization of Fasciocutaneous Flaps Laryngoscope 2000 110 942 945 10.1097/00005537-200006000-00010 10852509 213. Sami D.G. Heiba H.H. Abdellatif A. Wound Healing Models: A Systematic Review of Animal and Non-Animal Models Wound Med. 2019 24 8 17 10.1016/j.wndm.2018.12.001 214. Zomer H.D. Trentin A.G. Skin Wound Healing in Humans and Mice: Challenges in Translational Research J. Dermatol. Sci. 2018 90 3 12 10.1016/j.jdermsci.2017.12.009 29289417 215. Parnell L.K.S. Volk S.W. The Evolution of Animal Models in Wound Healing Research: 1993–2017 Adv. Wound Care 2019 8 692 702 10.1089/wound.2019.1098 31827981 PMC6904936 216. Pasupuleti M. Molahally S. Salwaji S. Ethical Guidelines, Animal Profile, Various Animal Models Used in Periodontal Research with Alternatives and Future Perspectives J. Indian. Soc. Periodontol. 2016 20 360 10.4103/0972-124X.186931 28298815 PMC5341308 217. Gounden V. Singh M. Hydrogels and Wound Healing: Current and Future Prospects Gels 2024 10 43 10.3390/gels10010043 38247766 PMC10815795 218. Tavakoli S. Klar A.S. Advanced Hydrogels as Wound Dressings Biomolecules 2020 10 1169 10.3390/biom10081169 32796593 PMC7464761 219. Shu W. Wang Y. Zhang X. Li C. Le H. Chang F. Functional Hydrogel Dressings for Treatment of Burn Wounds Front. Bioeng. Biotechnol. 2021 9 788461 10.3389/fbioe.2021.788461 34938723 PMC8685951 220. Fan F. Saha S. Hanjaya-Putra D. Biomimetic Hydrogels to Promote Wound Healing Front. Bioeng. Biotechnol. 2021 9 718377 10.3389/fbioe.2021.718377 34616718 PMC8488380 221. He Y. Cen Y. Tian M. Immunomodulatory Hydrogels for Skin Wound Healing: Cellular Targets and Design Strategy J. Mater. Chem. B 2024 12 2435 2458 10.1039/D3TB02626D 38284157 222. Surowiecka A. Strużyna J. Winiarska A. Korzeniowski T. Hydrogels in Burn Wound Management—A Review Gels 2022 8 122 10.3390/gels8020122 35200503 PMC8872485 223. Murphy S.V. Skardal A. Atala A. Evaluation of Hydrogels for Bio-printing Applications J. Biomed. Mater. Res. A 2013 101A 272 284 10.1002/jbm.a.34326 22941807 224. Wang H. Liu Y. Cai K. Zhang B. Tang S. Zhang W. Liu W. Antibacterial Polysaccharide-Based Hydrogel Dressing Containing Plant Essential Oil for Burn Wound Healing Burns Trauma. 2021 9 tkab041 10.1093/burnst/tkab041 34988231 PMC8693078 225. Li S. Dong S. Xu W. Tu S. Yan L. Zhao C. Ding J. Chen X. Antibacterial Hydrogels Adv. Sci. 2018 5 1700527 10.1002/advs.201700527 PMC5980143 29876202 226. Manju S. Antony M. Sreenivasan K. Synthesis and Evaluation of a Hydrogel That Binds Glucose and Releases Ciprofloxacin J. Mater. Sci. 2010 45 4006 4012 10.1007/s10853-010-4474-8 227. Sa Y. Wang M. Deng H. Wang Y. Jiang T. Beneficial Effects of Biomimetic Nano-Sized Hydroxyapatite/Antibiotic Gentamicin Enriched Chitosan–Glycerophosphate Hydrogel on the Performance of Injectable Polymethylmethacrylate RSC Adv. 2015 5 91082 91092 10.1039/C5RA15915F 228. Kamoun E.A. Kenawy E.-R.S. Tamer T.M. El-Meligy M.A. Mohy Eldin M.S. Poly (Vinyl Alcohol)-Alginate Physically Crosslinked Hydrogel Membranes for Wound Dressing Applications: Characterization and Bio-Evaluation Arab. J. Chem. 2015 8 38 47 10.1016/j.arabjc.2013.12.003 229. Lai P.-L. Hong D.-W. Ku K.-L. Lai Z.-T. Chu I.-M. Novel Thermosensitive Hydrogels Based on Methoxy Polyethylene Glycol-Co-Poly(Lactic Acid-Co-Aromatic Anhydride) for Cefazolin Delivery Nanomedicine 2014 10 553 560 10.1016/j.nano.2013.09.005 24096031 230. Gustafson C.T. Boakye-Agyeman F. Brinkman C.L. Reid J.M. Patel R. Bajzer Z. Dadsetan M. Yaszemski M.J. Controlled Delivery of Vancomycin via Charged Hydrogels PLoS ONE 2016 11 e0146401 10.1371/journal.pone.0146401 26760034 PMC4711919 231. Sawadkar P. Lali F. Garcia-Gareta E. Garrido B.G. Chaudhry A. Matharu P. Kyriakidis C. Greco K. Innovative Hydrogels in Cutaneous Wound Healing: Current Status and Future Perspectives Front. Bioeng. Biotechnol. 2025 13 1454903 10.3389/fbioe.2025.1454903 40421113 PMC12104307 232. Li Z. Qu T. Ding C. Ma C. Sun H. Li S. Liu X. Injectable Gelatin Derivative Hydrogels with Sustained Vascular Endothelial Growth Factor Release for Induced Angiogenesis Acta Biomater. 2015 13 88 100 10.1016/j.actbio.2014.11.002 25462840 PMC4293253 233. Xiao Z. Zheng X. An Y. Wang K. Zhang J. He H. Wu J. Zwitterionic Hydrogel for Sustained Release of Growth Factors to Enhance Wound Healing Biomater. Sci. 2021 9 882 891 10.1039/D0BM01608J 33241793 234. Bitterman-Deutsch O. Kogan L. Nasser F. Delayed Immune Mediated Adverse Effects to Hyaluronic Acid Fillers: Report of Five Cases and Review of the Literature Dermatol. Rep. 2015 7 5851 10.4081/dr.2015.5851 PMC4387334 25918619 235. Dam P. Celik M. Ustun M. Saha S. Saha C. Kacar E.A. Kugu S. Karagulle E.N. Tasoglu S. Buyukserin F. Wound Healing Strategies Based on Nanoparticles Incorporated in Hydrogel Wound Patches RSC Adv. 2023 13 21345 21364 10.1039/D3RA03477A 37465579 PMC10350660 236. Kar A.K. Singh A. Dhiman N. Purohit M.P. Jagdale P. Kamthan M. Singh D. Kumar M. Ghosh D. Patnaik S. Polymer-Assisted In Situ Synthesis of Silver Nanoparticles with Epigallocatechin Gallate (EGCG) Impregnated Wound Patch Potentiate Controlled Inflammatory Responses for Brisk Wound Healing Int. J. Nanomed. 2019 14 9837 9854 10.2147/IJN.S228462 PMC6913939 31849472 237. Zhang B. Lv Y. Yu C. Zhang W. Song S. Li Y. Chong Y. Huang J. Zhang Z. Au–Pt Nanozyme-Based Multifunctional Hydrogel Dressing for Diabetic Wound Healing Biomater. Adv. 2022 137 212869 10.1016/j.bioadv.2022.212869 35929245 238. Sahiner N. Godbey W.T. McPherson G.L. John V.T. Microgel, Nanogel and Hydrogel–Hydrogel Semi-IPN Composites for Biomedical Applications: Synthesis and Characterization Colloid. Polym. Sci. 2006 284 1121 1129 10.1007/s00396-006-1489-4 239. Liang C. Dudko V. Khoruzhenko O. Hong X. Lv Z.-P. Tunn I. Umer M. Timonen J.V.I. Linder M.B. Breu J. Stiff and Self-Healing Hydrogels by Polymer Entanglements in Co-Planar Nanoconfinement Nat. Mater. 2025 24 599 606 10.1038/s41563-025-02146-5 40055539 PMC11961364 240. Wang Y. Zhang M. Yan Z. Ji S. Xiao S. Gao J. Metal Nanoparticle Hybrid Hydrogels: The State-of-the-Art of Combining Hard and Soft Materials to Promote Wound Healing Theranostics 2024 14 1534 1560 10.7150/thno.91829 38389845 PMC10879867 241. Xue H. Hu L. Xiong Y. Zhu X. Wei C. Cao F. Zhou W. Sun Y. Endo Y. Liu M. Quaternized Chitosan-Matrigel-Polyacrylamide Hydrogels as Wound Dressing for Wound Repair and Regeneration Carbohydr. Polym. 2019 226 115302 10.1016/j.carbpol.2019.115302 31582049 242. Lee Y.-H. Hong Y.-L. Wu T.-L. Novel Silver and Nanoparticle-Encapsulated Growth Factor Co-Loaded Chitosan Composite Hydrogel with Sustained Antimicrobility and Promoted Biological Properties for Diabetic Wound Healing Mater. Sci. Eng. C 2021 118 111385 10.1016/j.msec.2020.111385 33254992 243. Ying H. Zhou J. Wang M. Su D. Ma Q. Lv G. Chen J. In Situ Formed Collagen-Hyaluronic Acid Hydrogel as Biomimetic Dressing for Promoting Spontaneous Wound Healing Mater. Sci. Eng. C 2019 101 487 498 10.1016/j.msec.2019.03.093 31029343 244. Basha S.I. Ghosh S. Vinothkumar K. Ramesh B. Kumari P.H.P. Mohan K.V.M. Sukumar E. Fumaric Acid Incorporated Ag/Agar-Agar Hybrid Hydrogel: A Multifunctional Avenue to Tackle Wound Healing Mater. Sci. Eng. C 2020 111 110743 10.1016/j.msec.2020.110743 32279739 245. Daristotle J.L. Lau L.W. Erdi M. Hunter J. Djoum A. Srinivasan P. Wu X. Basu M. Ayyub O.B. Sandler A.D. Sprayable and Biodegradable, Intrinsically Adhesive Wound Dressing with Antimicrobial Properties Bioeng. Transl. Med. 2020 5 10149 10.1002/btm2.10149 PMC6971445 31989038 246. Zhang S. Liu Y. Zhang X. Zhu D. Qi X. Cao X. Fang Y. Che Y. Han Z.-C. He Z.-X. Prostaglandin E 2 Theranostics 2018 8 5348 5361 10.7150/thno.27385 30555551 PMC6276096 247. Liu M. Chen Y. Zhu Q. Tao J. Tang C. Ruan H. Wu Y. Loh X.J. Antioxidant Thermogelling Formulation for Burn Wound Healing Chem. Asian J. 2022 17 e202200396 10.1002/asia.202200396 35792100 248. Gokce E.H. Tuncay Tanrıverdi S. Eroglu I. Tsapis N. Gokce G. Tekmen I. Fattal E. Ozer O. Wound Healing Effects of Collagen-Laminin Dermal Matrix Impregnated with Resveratrol Loaded Hyaluronic Acid-DPPC Microparticles in Diabetic Rats Eur. J. Pharm. Biopharm. 2017 119 17 27 10.1016/j.ejpb.2017.04.027 28461085 249. Ioniță A.C. In vitro effects of some synthesized aminoacetanilide N’-substituted on human leukocytes separated from peripheral blood Farmacia 2019 67 684 690 10.31925/farmacia.2019.4.18 250. Li Y. Fu R. Zhu C. Fan D. An Antibacterial Bilayer Hydrogel Modified by Tannic Acid with Oxidation Resistance and Adhesiveness to Accelerate Wound Repair Colloids Surf. B Biointerfaces 2021 205 111869 10.1016/j.colsurfb.2021.111869 34044334 251. Hussain M. Suo H. Xie Y. Wang K. Wang H. Hou Z. Gao Y. Zhang L. Tao J. Jiang H. Dopamine-Substituted Multidomain Peptide Hydrogel with Inherent Antimicrobial Activity and Antioxidant Capability for Infected Wound Healing ACS Appl. Mater. Interfaces 2021 13 29380 29391 10.1021/acsami.1c07656 34128656 252. Ehterami A. Salehi M. Farzamfar S. Samadian H. Vaez A. Ghorbani S. Ai J. Sahrapeyma H. Chitosan/Alginate Hydrogels Containing Alpha-Tocopherol for Wound Healing in Rat Model J. Drug Deliv. Sci. Technol. 2019 51 204 213 10.1016/j.jddst.2019.02.032 253. Yahia E.A. El-Sharkawey A.E. Bayoumi M.M. Quantitative Evaluation of Diabetic Foot Wound Healing Using Hydrogel Nanosilver Based Dressing Vs. Traditional Dressing: A Prospective Randomized Control Study Pak. J. Med. Health Sci. 2021 15 1571 1574 10.53350/pjmhs211561571 254. Verdú-Soriano J. Casado-Díaz A. de Cristino-Espinar M. Luna-Morales S. Dios-Guerra C. Moreno-Moreno P. Dorado G. Quesada-Gómez J.M. Rodríguez-Mañas L. Lázaro-Martínez J.L. Hard-to-Heal Wound Healing: Superiority of Hydrogel EHO-85 (Containing Olea Europaea Leaf Extract) vs. a Standard Hydrogel. A Randomized Controlled Trial Gels 2023 9 962 10.3390/gels9120962 38131948 PMC10742797 255. dos Santos T.M. de Sousa D.S.F. Di Piero K.C. Todeschini A.R. Dias W.B. Oliveira C.A. dos Santos E.P. Monteiro M.S.d.S.B. Gomes M.K. Moura C.d.R. Development and Clinical Application of Hydrogel Formulations Containing Papain and Urea for Wound Healing Braz. J. Pharm. Sci. 2023 59 e201090 10.1590/s2175-97902023e201090 256. Barbosa M. Carvalho V. Paggiaro A. Hydrogel Enriched With Sodium Alginate and Vitamins A and E for Diabetic Foot Ulcer: A Randomized Controlled Trial Wounds 2022 34 229 235 10.25270/wnds/20103 36219460 257. Della Pepa G. Lombardi G. Gianfrancesco S. Piccolo R. Chirico G. Pellegrino M. Santella L. Tecce N. Volpicelli A. Sollo E. Triticum Vulgare Extract and Polyhexanide (Fitostimoline ® ® J. Clin. Med. 2023 12 3596 10.3390/jcm12103596 37240701 PMC10219104 258. Edmonds M. Apligraf in the Treatment of Neuropathic Diabetic Foot Ulcers Int. J. Low. Extrem. Wounds 2009 8 11 18 10.1177/1534734609331597 19189997 259. Elsharkawi M. Ghoneim B. Westby D. Jones D. Tawfick W. Walsh S.R. Adipose-Derived Stem Cells in Patients with Venous Ulcers: Systematic Review Vascular 2023 31 989 993 10.1177/17085381221098279 35491989 260. Kim Y.H. Shim H.S. Lee J. Kim S.W. A Prospective Randomized Controlled Multicenter Clinical Trial Comparing Paste-Type Acellular Dermal Matrix to Standard Care for the Treatment of Chronic Wounds J. Clin. Med. 2022 11 2203 10.3390/jcm11082203 35456295 PMC9030591 261. Clegg J.R. Adebowale K. Zhao Z. Mitragotri S. Hydrogels in the Clinic: An Update Bioeng. Transl. Med. 2024 9 e10680 10.1002/btm2.10680 39545079 PMC11558196 262. Vernerey F.J. Lalitha Sridhar S. Muralidharan A. Bryant S.J. Mechanics of 3D Cell–Hydrogel Interactions: Experiments, Models, and Mechanisms Chem. Rev. 2021 121 11085 11148 10.1021/acs.chemrev.1c00046 34473466 263. Richbourg N. Wechsler M.E. Rodriguez-Cruz J.J. Peppas N.A. Model-Based Modular Hydrogel Design Nat. Rev. Bioeng. 2024 2 575 587 10.1038/s44222-024-00167-4 264. Li Z. Song P. Li G. Han Y. Ren X. Bai L. Su J. AI Energized Hydrogel Design, Optimization and Application in Biomedicine Mater. Today Bio 2024 25 101014 10.1016/j.mtbio.2024.101014 38464497 PMC10924066 265. Islamkulov M. Karakuş S. Özeroğlu C. Design Artificial Intelligence-Based Optimization and Swelling Behavior of Novel Crosslinked Polymeric Network Hydrogels Based on Acrylamide-2-Hydroxyethyl Methacrylate and Acrylamide-N-Isopropylacrylamide Colloid. Polym. Sci. 2023 301 259 272 10.1007/s00396-023-05064-7 266. Rippon M.G. Fleming L. Chen T. Rogers A.A. Ousey K. Artificial Intelligence in Wound Care: Diagnosis, Assessment and Treatment of Hard-to-Heal Wounds: A Narrative Review J. Wound Care 2024 33 229 242 10.12968/jowc.2024.33.4.229 38573907 267. Chen M.-Y. Progress in the Application of Artificial Intelligence in Skin Wound Assessment and Prediction of Healing Time Am. J. Transl. Res. 2024 16 2765 2776 10.62347/MYHE3488 39114681 PMC11301465 Figure 1 The most relevant in vitro wound healing models. Two-dimensional models ( left right Figure 2 Schematic diagram of the design of surgical wound models in vivo for the study of healing efficacy of different types of chemical and physical treatment options. Created with www.BioRender.com Figure 3 Comparative wound healing timeline for different types of in vivo models. All wound models show healing and/or scarring on day 9, except for the diabetic wound. Created with www.BioRender.com gels-11-00705-t001_Table 1 Table 1 In vitro 2D models for wound healing studies. Model Type Characteristics Advantages Limitations Typical Monolayer Culture [ 152 153 154 single layer of cells on a flat surface simple, cost-effective, and easy to analyze limited cell–cell and ECM interactions basic research, drug screening Scratch Assay [ 152 155 156 mechanical wound in monolayer reproducible, widely used not representative of tissue architecture migration studies, wound closure assays Transwell Assay [ 131 152 157 migration through a porous membrane quantitative, adaptable no structural tissue context chemotaxis, migration analysis Co-culture System (2D) [ 127 131 multiple cell types in a monolayer setup intercellular communication, easy setup hard to dissect specific pathways interaction studies, signaling analysis gels-11-00705-t003_Table 3 Table 3 Monitoring of the wound healing main processes on 2D and 3D in vitro models. Process 2D Models 3D Models Inflammation inducible by pro-inflammatory stimuli layered cells with immune-like behavior Oxidative Stress inducible by prooxidant stimuli −: source identification of the marker, donor/time-dependent Cell migration assessment: imaging/oxidative stress markers central hypoxia increases ROS Collagen Synthesis scratch assay shows cell migration reconstructed skin models with epidermis with or without dermis Apoptosis fibroblast cultures −: collagen deposited in scaffold or matrix + = advantages, − = disadvantages. gels-11-00705-t004_Table 4 Table 4 In vivo surgical models used for experimental wound healing research. No. Model/Species Treatment Main Results 1 FTEW dorsal area—rabbits Nanoemulsion hydrogel with Hypericum perforatum extract Upregulated growth factors, increased vessel growth, and anti-microbial properties [ 172 2 FTEW dorsal area—rats Rutin-loaded zein gel Promoted movement of cells towards the wound site, increased inflammation [ 173 3 FTEW dorsal area—rats Sodium thiosulfate gel Increased fibroblast movement towards the wound bed, increased antioxidant enzymes [ 174 4 FTEW dorsal area—mice Gel containing P. russeliana Low antioxidant effects, anti-inflammatory activity, promoted collagen formation, analgesic and pro-angiogenesis properties [ 175 5 FTEW dorsal area—rats Alginate hydrogel loaded with cerium oxide nanoparticles Accelerated wound repair by reducing oxidative stress and inflammation, faster tissue recovery [ 169 6 FTEW dorsal area—rats Cream containing Astragalus floccosus extract Accelerated wound healing by increased fibroblast proliferation, collagen synthesis, and re-epithelialization [ 176 7 FTEW dorsal neck area—on Sprague Dawley rats Sinomenine alkaloid solution extracted from Sinomenum Acutum Faster wound closure with increased fibroblast proliferation and collagen deposition, antioxidant and anti-inflammatory effects [ 177 8 FTEW (bilaterally punched dorsum wound) on C57BL/6 mice mouse mesenchymal stem cells from hair follicles/dermal fibroblasts/growth factors Reduced hypertrophic scarring and enhanced wound healing/combination therapy of MSCs, fibroblasts, and growth factors was the most effective [ 178 9 FTEW (punched dorsum wound-6 mm) on rats Sildenafil cream Faster wound closure, reduced oxidative stress [ 179 10 FTEW on rat and diabetic mouse, rat random flap, Systemic therapy with angiotensin (1–7) Faster wound healing, increased cell proliferation without hypertensive effect, promoted regeneration, and flap survival [ 180 11 SIW on rats and rabbits Aloe ferox miller and Aloe Arborescens Miller whole leaf extracts Faster healing, reduced inflammation, and antibacterial and antifungal activity with no skin toxicity [ 181 12 FTEW dorsal area—BALB/c mice Alchemilla vulgaris and Mimosa extract mixture Rapid wound repair through improved skin re-epithelialization, higher cell proliferation, collagen synthesis, angiogenesis, and skin appendages [ 182 13 FTEW dorsolateral flanks—Wistar rats Ointment containing honey and Ageratum conyzoides leaf extract Increased wound contraction, faster healing, and Ageratum extract reduced inflammation but increased fibrosis despite lower fibroblast count [ 183 14 FTEW dorsal area—mice chitosan patch with doxycycline/zinc/selenium nanoparticles Anti-inflammatory and hemostatic effects, enhanced blood vessel formation [ 184 15 Circular full-thickness skin excisions on a rat’s scalp Chitosan membrane Accelerated healing, anti-inflammatory effects by reduced leukocyte counts, and increased IL-4 levels [ 185 16 FTEW dorsal area—diabetic Wistar rats N-acetyl cysteine Reduced wound size and oxidative stress by both topical and systemic administration [ 186 17 FTEW dorsal area—diabetic Wistar rats Paeoniflorin-loaded hyaluronic acid hydrogel Accelerated wound repair by anti-inflammatory effects mediated by modulation of macrophage populations (M1 towards M2 phenotype), enhanced angiogenesis, and collagen production [ 187 18 FTEW dorsal area—nude mice Heparinized adipose-derived scaffolds enriched with growth factors Improved re-epithelialization, angiogenesis, and skin appendage regeneration through enhanced fibroblast migration and blood vessel growth [ 188 19 FTEW dorsal area—mice injection of mesenchymal Stem cell-derived extracellular vesicles/umbilical cord blood-derived extracellular vesicles in the wound margins Enhanced wound healing by increased tissue growth and reduced scar formation [ 189 20 FTEW dorsal area—rats Neodymium–yttrium–aluminum garnet (Nd:YAG) pulsed high-intensity laser Improved wound healing by increasing fibroblast proliferation, collagen synthesis, and thickness of the granular layer [ 190 21 SI dorsal area—KO mice (double deletion of IL-10 and IL-4 genes) Interleukin-10, local application Improved wound healing, reduced inflammation, and enhanced scarring quality [ 191 22 FTEW dorsal area—mice Extracellular matrix/stromal vascular fraction gel conditioned medium Faster wound closure, higher collagen deposition, increased growth factor secretion, and higher fibroblast and keratinocyte count and activity [ 192 23 FTEW dorsal area—mice Encapsulated Spirulina protein hydrolysates with nanoliposomes Increased wound closure in mice by boosting fibroblast growth, skin regrowth, and enhanced markers of angiogenesis and collagen deposition [ 193 24 FTEW dorsal area—mice Silk protein-biomaterial wound dressings with epidermal growth factor and silver sulfadiazine Better wound closure rate, less scarring, and collagen production [ 194 25 FTEW dorsal area—C57 diabetic mice Intermittent fasting and pulsed radiofrequency energy Combined therapy exhibited antioxidant effects and induced faster wound healing by boosting cell migration, angiogenesis, and nerve growth [ 195 26 Full-thickness SIW dorsal area—albino guinea pigs Pulsed electrical stimulation Both anodal and cathodal electrical stimulation boosted wound recovery in guinea pigs, improving closure and scar strength, regardless of polarity sequence [ 196 FTEW = Full-thickness excisional wound, SIW = surgical incision wound. gels-11-00705-t002_Table 2 Table 2 In vitro 3D models for wound healing studies. Model Type Characteristics Advantages Limitations Typical 3D Tissue Constructs [ 152 multiple cell layers in the ECM better tissue architecture, more realistic higher complexity, longer setup advanced research, tissue engineering Co-culture System (3D) [ 155 156 different cell types embedded in or layered within a 3D matrix mimics natural skin structure and function technically demanding ECM remodeling, inflammatory studies Hydrogel-based Models [ 30 131 158 cells in/around gels like collagen or ECM simulation, tunable stiffness batch variability, limited duration ECM interaction, scaffold testing Organotypic Culture [ 158 stratified epidermis + fibroblast-populated dermis closest to in vivo skin time-consuming, resource-intensive preclinical drug testing, epidermal healing Explant Culture [ 159 160 full-thickness skin cultured ex vivo preserves native structure short-term viability, donor variability re-epithelialization, tissue remodeling Microfluidic Skin-on-a-Chip [ 156 158 skin model in a microfluidic device with a controlled environment real-time imaging, dynamic flow conditions expensive, specialized equipment needed high-resolution studies, mechanistic modeling Bioprinted Skin Constructs [ 161 layered printing of cells and ECM components reproducible, customizable architecture high cost, needs specialized skills personalized modeling, drug/cosmetic testing ",
  "metadata": {
    "Title of this paper": "Progress in the Application of Artificial Intelligence in Skin Wound Assessment and Prediction of Healing Time",
    "Journal it was published in:": "Gels",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469554/"
  }
}