{
  "title": "Paper_437",
  "abstract": "pmc J Int Med Res J Int Med Res 3252 jimr IMR The Journal of International Medical Research 0300-0605 1473-2300 SAGE Publications PMC12480824 PMC12480824.1 12480824 12480824 41022066 10.1177/03000605251379977 10.1177_03000605251379977 1 Observational Study Prechemoradiotherapy number of natural teeth as a prognostic factor in patients with locally advanced nasopharyngeal cancer: A retrospective observational study https://orcid.org/0000-0001-8120-7123 Topkan Erkan 1 https://orcid.org/0000-0001-8251-6913 Somay Efsun 2 Bascil Sibel 3 Ozturk Duriye 4 Selek Ugur 5  1  2  3  4 534521 Faculty of Medicine, Afyonkarahisar Health Sciences University  5 Efsun Somay, Department of Oral and Maxillofacial Surgery, Faculty of Dentistry, Başkent University, 82. Street No: 26 Bahcelievler, Ankara, Turkey. Email: efsuner@gmail.com 9 2025 29 9 2025 53 9 496213 03000605251379977 8 5 2025 2 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by-nc/4.0/ Creative Commons Non Commercial CC BY-NC: This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Objective This study evaluated the prognostic value of the pretreatment number of natural teeth on progression-free survival and overall survival in patients with locally advanced nasopharyngeal carcinoma treated with concurrent chemoradiotherapy. Methods We retrospectively analyzed 248 patients with locally advanced nasopharyngeal carcinoma treated with intensity-modulated radiotherapy–based concurrent chemoradiotherapy and adjuvant chemotherapy between June 2010 and December 2021. The number of natural teeth was assessed before concurrent chemoradiotherapy. A receiver operating characteristic curve analysis was performed to identify the optimal number of natural teeth threshold predictive of overall survival and progression-free survival. Results The optimal cutoff value for the number of natural teeth was 19.5 (area under the curve: 70.6%). Patients were grouped into those with a number of natural teeth <20 ( n n Conclusions A pretreatment number of natural teeth <20 independently predicts poorer survival in patients with locally advanced nasopharyngeal carcinoma receiving concurrent chemoradiotherapy, suggesting that the number of natural teeth may serve as a simple, accessible prognostic biomarker in head and neck oncology. Nasopharyngeal cancer concurrent chemoradiotherapy number of natural teeth survival outcomes oral health pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts2 Introduction Nasopharyngeal carcinoma (NPC) is a highly aggressive tumor originating from the nasopharyngeal epithelium. Although significant progress has been made in screening techniques for the early detection of NPC, research indicates that >50% of the patients still present with advanced-stage disease, namely stages III and IV. 1 2 3 5 3 5 Currently, in patients with LANPC, the tumor-node-metastasis (TNM) staging system is universally recognized as the most reliable framework for predicting treatment outcomes. However, its prognostic power is limited because the comprehensive TNM system does not account for significant biological differences related to the tumor and the host, as it focuses solely on the local and regional extent of the primary tumor. 6 7  7 A potentially significant prognostic marker is the pretreatment number of natural teeth (NNT). Tooth loss, and consequently reduced NNT, is frequently associated with periodontitis in both the general population and individuals with cancer, affecting up to 90% of the patients.  8 9 14 15 16  17 A recent extensive study of 2449 participants with head and neck squamous cell carcinoma (HNSCC), based on four studies from the International Head and Neck Cancer Epidemiology Consortium, found that a higher NNT was associated with significantly lower mortality rates.  18  19 Patients and methods Study design and ethics This retrospective observational study was approved by the Institutional Review Board (IRB) of Başkent University Medical Faculty (project no: D-KA-2058, approval date: June 2022). The study was conducted in accordance with the Declaration of Helsinki (1975, revised 2024). The IRB waived the requirement for signed informed consent because anonymized retrospective data were used. This single-center investigation meticulously reviewed the records of patients diagnosed with LANPC who received CCRT at the Department of Radiation Oncology, Başkent University Medical Faculty, between June 2010 and December 2021. The reporting of this study follows Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) guidelines.  20 Patients selection Patients were identified through a systematic search of the institutional records pertaining to those with LANPC who consecutively underwent curative treatment at the Department of Radiation Oncology. Eligibility criteria included the following requirements: age 18–80 years, Eastern Cooperative Oncology Group performance score of 0–2, a body mass index of at least 18.5 kg/m 2 Chemoradiotherapy protocol All patients received definitive CCRT utilizing previously reported dosages of simultaneous integrated boost IMRT and chemotherapy: IMRT was administered in daily fractions over 7 weeks, 5 days per week.  21 2 Pretreatment oral examination and NNT measures All study participants underwent a thorough dental evaluation by a qualified oral and maxillofacial surgeon before CCRT, following guidelines established by the American Dental Association and the U.S. Food and Drug Administration.  22  23 Response assessment Although the study design was retrospective, we prospectively conducted the CCRT response evaluations according to our institution’s follow-up protocol for patients with LANPC. Patients were assessed every 3 months during the initial 2-year period of CCRT and then every 6 months from 3 to 5 years. After this timeframe, evaluations were scheduled annually or more frequently if clinically indicated. At each visit, an ENT specialist performed a thorough endoscopic examination to detect any potential local or regional tumor recurrences, as well as second primary tumors. Additionally, PET-CT scans were conducted to assess the metabolic response and the likelihood of DM until a complete metabolic response was achieved. We employed the PET Response Criteria for Solid Tumors (PERCIST) as the standard instrument to assess treatment responses.  24 Endpoints and statistical analysis The primary objective of this study was to determine whether there is a correlation between the pretreatment NNT and OS, defined as the time from the start of CCRT until death or the last follow-up record. The secondary objective was to assess the same association with PFS, defined as the duration from the initiation of CCRT until any of the locoregional recurrences, DMs, nonregional lymph node relapses, death, or the final visit. Continuous data were summarized using medians and ranges to effectively capture central tendencies and variability. Categorical variables were characterized by their frequency distributions, providing insight into their prevalence within the study population. To compare medians or frequency distributions across different patient groups, we employed appropriate statistical tests, including the Mann-Whitney U-test for non-normally distributed data, Student’s t-test for normally distributed continuous variables, chi-square test for associations between categorical variables, and Spearman correlations to assess relationships between ranked variables. The current study utilized the receiver operating characteristic (ROC) curve analysis to evaluate the feasibility of establishing an optimal pretreatment NNT cutoff that divides the study population into two subgroups characterized by significantly divergent outcomes, with PFS and OS status defined as the events of interest. The optimal cutoff was methodically determined at the point on the curve where the Youden index reached its maximum value. Kaplan-Meier curves and log-rank tests were utilized to investigate the potential interactions between the various risk factors and the outcomes of PFS and OS. We employed the Cox proportional hazards model for multivariate analyses to evaluate the independence of those variables that exhibited statistical significance in univariate analyses. All group comparisons were two-tailed, with statistical significance specified at p-value < 0.05. Results This retrospective research aimed to investigate the impact of pretreatment NNT on OS and PFS outcomes in patients with LANPC who underwent definitive CCRT, followed by adjuvant chemotherapy. Patients meeting the inclusion criteria were selected from a cohort of patients with LANPC who received similar treatments and pretreatment and posttreatment evaluations at a single institution. The baseline patient and disease characteristics and treatment features of the 248 eligible patients are detailed in Table 1 Table 1 Table 1. Pretreatment and treatment characteristics. Characteristics Whole cohort( N NNT < 20( N NNT ≥ 20( N p-value Median age, years (range) 58 (21–79) 59 (24–79) 57 (21–79) 0.47 Age group ( N ≥70 years 56 (22.6) 18 (23.7) 38 (22.1) 0.32 <70 years 192 (77.4) 58 (76.3) 134 (77.9) Gender ( N Male 201 (81.0) 55 (72.6) 146 (84.9) 0.23 Female 47 (19.0) 21 (27.4) 26 (15.1) ECOG performance ( N 0 121 (48.8) 38 (50.0) 83 (48.2) 0.77 1 127 (51.2) 38 (50.0) 89 (51.8) Smoking status ( N Ever 215 (86.7) 69 (90.7) 146 (84.9) 0.32 Never 33 (13.3) 7 (9.3) 26 (15.1) Alcohol consumption ( N Ever 166 (66.9) 50 (65.7) 116 (67.4) 0.63 Never 82 (33.1) 26 (34.3) 56 (32.6) Continued smoking ( N Yes 46 (18.5) 16 (21.0) 30 (17.4) 0.41 No 202 (81.5) 60 (79.0) 142 (82.6) Continued alcohol consumption ( N Yes 34 (13.7) 12 (15.8) 22 (12.8) 0.46 No 214 (86.3) 64 (84.2) 150 (87.2) WHO histology ( N 2 35 (14.1) 12 (15.8) 23 (13.4) 0.64 3 213 (85.9) 64 (84.2) 149 (86.6) T-stage ( N 1–2 43 (17.3) 12 (15.8) 31 (18.0) 0.51 3–4 205 (82.7) 64 (84.2) 141 (82.0) N-stage ( N 0–1 57 (23.0) 18 (23.7) 39 (22.7) 0.80 2–3 191 (77.0) 58 (76.3) 133 (77.3) Clinical stage ( N II-III 77 (31.0) 22 (28.9) 55 (32.0) 0.41 IVA-B 171 (69.0) 54 (71.1) 117 (68.0) Concurrent chemotherapy cycles ( N 1–2 74 (29.8) 23 (30.2) 51 (29.6) 0.81 3 174 (70.2) 53 (68.8) 121 (70.4) Adjuvant chemotherapy cycles ( N 0 73 (29.4) 22 (28.9) 51 (29.6) 0.79 1–2 175 (70.6) 54 (71.1) 121 (70.4) ECOG: Eastern Cooperative Oncology Group; NNT: number of natural teeth; N-stage: nodal stage; T-stage: tumor stage; WHO: World Health Organization. After a median follow-up period of 88.4 months (range: 4.0–164.0 months), 185 out of 248 participants (74.6%) were still alive, and 174 (70.2%) were free from disease progression. Treatment protocol achieved successful locoregional control (LRC) in 227 (91.5%) patients. Among the 63 deaths, 48 (76.2%) were due to cancer and its treatment (progressive LANPC: 41 (65.1%), and 3 (4.7%) late toxicities). Causes for non-NPC or treatment-unrelated deaths were identified in 15 (23.8%)—myocardial infection, 6 (9.5%); chronic obstructive pulmonary disease, 4 (6.3%); second cancers, 2 (3.2%); coronavirus disease (COVID-19), 1 (1.6%); traffic accident, 1 (1.6%); and earthquake, 1 (1.6%), respectively. Using ROC curve analyses, we sought to determine optimal cutoff values for pretreatment NNT that would virtually stratify the study cohort into two distinct groups with significantly different outcomes in OS and PFS. The analyses identified a cutoff value of 19.5 as a common threshold for both OS (area under the curve (AUC): 70.6%; sensitivity: 73.5%; specificity: 69.8%; Youden index: 0.433) and PFS (AUC: 75.0%; sensitivity: 70.3%; specificity: 68.6%; Youden index: 0.389), as illustrated in Figure 1(a) and (b) N N Table 1 Figure 1. The results of the receiver operating characteristic curve analysis, illustrating the relationship between the pretreatment count of natural teeth and survival outcomes: (a) overall survival and (b) progression-free survival. Comparisons between the two NNT groups at the time of the final analysis, focusing on tumor control rates, indicated that the LRC rates for the NNT ≥ 20 and NNT < 20 groups were 94.8% and 83.3%, respectively (p = 0.16). Overall, DMs was documented in 54 patients, representing 21.8% of the cohort. Notably, the DM rate was significantly lower in the NNT ≥ 20 group (17.4%) than in the NNT < 20 (33.3%) group counterpart (p = 0.006). Kaplan-Meier survival estimates revealed that the median PFS was 96 months, but the median OS time was not reached (NR) during the final analysis for the whole research cohort ( Table 2 Table 2 Table 2. Survival results for the whole study cohort and per numbers of natural teeth group. Outcome Whole cohort( N NNT < 20( N NNT ≥ 20( N p-value OS Median (months) NR 71.0 NR <0.001 5-year (%) 82.3 64.7 90.1 10-year (%) 59.1 28.4 74.8 PFS Median (months) 96.0 38.0 117.0 <0.001 5-year (%) 59.1 41.4 67.0 10-year (%) 39.2 20.6 48.7 NNT: number of natural teeth; NR: not reached; OS: overall survival; PFS: progression-free survival. Comparisons between the two NNT cohorts revealed that patients with NNT ≥ 20 exhibited significantly improved median PFS (117 months (95% CI: 14.3–39.7) vs. 38.0 months (95% CI: 14.3–39.7); p < 0.001) and OS (NR vs. 71.0 months (95% CI: 42.7–99.3); p < 0.001) compared to those with NNT < 20 ( Table 2 Figure 2(a) and (b) Figure 2. Survival outcomes per numbers of natural teeth (NNTs) groups (dark blue: NNT < 20; red: NNT ≥ 20): (a) overall survival and (b) progression-free survival. The findings of the univariate analysis revealed that, in addition to a pretreatment NNT < 20 status, the factors of being an ever-smoker, having a T3/T4 tumor stage, and being classified as N2/N3 in the nodal stage were significantly associated with poorer outcomes in both PFS and OS (p > 0.05 for each factor), as presented in Table 3 Table 3 Table 3. Results of univariate and multivariate analysis. OS PFS Factor Univariatep-value Multivariatep-value HR(95% CI) Univariatep-value Multivariatep-value HR(95% CI) Gender (male vs. female) 0.56 – – 0.64 – – Age group (<70 vs. ≥70 years) 0.68 – – 0.49 – – ECOG (0 vs. 1) 0.88 – – 0.76 – – Smoking status (never vs. ever) 0.72 – – 0.81 Alcohol consumption (never vs. ever) 0.86 – – 0.92 Continued smoking (yes vs. no) 0.002 0.004 2.17 (1.43–3.26) 0.003 0.005 2.03 (1.32–2.87) Continued alcohol consumption (yes vs. no) 0.29 – – 0.32 – – WHO histology (2 vs. 3) 0.74 – – 0.62 – – T-stage (1–2 vs. 3–4) 0.02 0.032 0.67 (0.43–089) 0.007 0.022 0.54 (0.32–0. 76) N-stage (0–1 vs. 2–3) 0.004 0.005 0.63 (0.49–0.83) 0.001 0.001 0.50 (0.28–0.74) Concurrent chemotherapy cycles (3 vs. 1–2) 0.24 – – 0.17 – – Adjuvant chemotherapy cycles (1–2 vs. 0) 0.33 – – 0.28 – – NNT (≥20 vs. <20) <0.001 0.002 0.46 (0.22–0.74) <0.006 0.008 0.37 (0.12–0.53) CI: confidence interval; ECOG: Eastern Cooperative Oncology Group; HR: hazard ratio; NNT: number of natural teeth; N-stage: nodal stage; OS: overall survival; PFS: progression-free survival; T-stage: tumor stage; WHO: World Health Organization. Discussion The primary objective of this retrospective study was to investigate the potential relationship between the pretreatment NNT status and survival outcomes, specifically PFS and OS, in patients with LANPC who were treated with definitive IMRT-based CCRT. To the best of our knowledge, this is the first study to address this issue within this patient population. Our findings indicated that a pretreatment NNT < 20 was associated with significantly shorter median, 5-year, and 10-year PFS and OS outcomes compared to presenting with a pretreatment NNT ≥ 20. Additionally, being an active smoker significantly predicted a NNT < 20 and was associated with poorer survival outcomes following CCRT. Our study not only reaffirmed the well-established prognostic significance of higher T-stage (T3-4 vs. T1-2) and N-stage (N2-3 vs. N0-1) but also highlighted a significantly poor prognostic value associated with being an active smoker compared to a quit/never smoker. 25 28  26 26 27  28  29  30  31 Currently, the TNM staging system is recognized as the most comprehensive and dependable framework for predicting the prognosis of patients diagnosed with LANPC. This system categorizes cancer stages based on the tumor size and invasiveness (T), the extent and laterality of lymph node involvement (N), and DM (M), providing a standardized method for assessing disease progression. However, despite receiving comparable anticancer therapies, clinical outcomes can exhibit significant variability among patients at the same stage of the disease.  32 33 34 18 35 39  18  36 36 39 Considering the facts mentioned in the previous paragraph, our study’s key finding was establishing the first documented independent correlation between pretreatment NNT and outcomes of PFS and OS in patients with LANPC subjected to definitive CCRT and subsequent adjuvant chemotherapy. Specifically, patients in the NNT ≥ 20 group exhibited significantly improved median PFS (117 vs. 38.0 months; p < 0.001) and OS (NR vs. 71.0 months; p < 0.001) compared to those with NNT < 20. Similarly, the 10-year PFS (48.7% vs. 20.6% for NNT < 20) and OS (74.8% vs. 28.4% for NNT < 20) rates were also superior in the NNT ≥ 20 group patients, suggesting the long-term durability of the prognostic impact of pretreatment NNT in patients with LANPC. These results align with findings from previously reported large-scale studies by Tasoulas et al.  18  36 The uniform application of similar treatment protocols for IMRT, CCRT, and adjuvant chemotherapy among all patients enhanced the strength of the study presented here. However, this investigation had its limitations. First, it was a retrospective analysis conducted at a single institution, which may introduce selection biases inherent to such studies. Second, the absence of an internal or external validation cohort, coupled with the lack of propensity score matching methodologies, may have compromised the robustness of our findings. Therefore, future studies incorporating these statistical techniques could be beneficial in yielding more trustworthy outcomes. Third, our ROC analysis used censored data rather than a time-dependent approach. As OS and PFS are time-to-event outcomes, the prevailing methodology may not fully capture the complexities inherent in survival analysis, and this may limit the interpretation of the AUC. Fourth, our investigation did not examine the factors that may have contributed to significant tooth loss before CCRT, such as periodontitis, particularly among patients with a NNT < 20. 15 16  40 Conclusion The findings of our study suggest that a presenting NNT < 20 is associated with significantly poorer PFS and OS outcomes in patients with LANPC undergoing definitive CCRT. These results highlight the potential importance of proper oral care, encompassing oral hygiene training, regular dental check-ups, and necessary dental treatments, in improving outcomes in this patient population. However, further research is crucial to substantiate these findings before they can be effectively incorporated into routine oncological practice. Acknowledgments The authors confirm that no artificial intelligence tools were used for manuscript preparation. ORCID iDs: https://orcid.org/0000-0001-8120-7123 Efsun Somay https://orcid.org/0000-0001-8251-6913 Author contributions All authors contributed to study conception, data collection, analysis, and manuscript drafting. All authors approved the final manuscript. Consent for publication We ensure that all patients signed an informed consent form before the beginning of the evaluation, either themselves or their legally authorized representatives, for the acquisition and analysis of their sociodemographic, dental, and medical records, blood samples, and publication of the outcomes. Data availability Data are available from Başkent University Institutional Data Access Committee for researchers meeting criteria for confidential data access. Declaration of conflicting interests The authors declare no conflicts of interest. Ethics approval and consent to participate Before acquiring any information from the patient, the Institutional Review Board of the Başkent University School of Medicine approved the study design and complied with the Declaration of Helsinki. Funding None. References 1 Su ZY Siak PY Lwin YY et al Epidemiology of nasopharyngeal carcinoma: current insights and future outlook Cancer Metastasis Rev 2024 43 919 939 38430391 10.1007/s10555-024-10176-9 2 Blanchard P Lee A Marguet S MAC-NPC Collaborative Group et al Chemotherapy and radiotherapy in nasopharyngeal carcinoma: an update of the MAC-NPC meta-analysis Lancet Oncol 2015 16 645 655 25957714 10.1016/S1470-2045(15)70126-9 3 Lin JC Jan JS Hsu CY et al Phase III study of concurrent chemoradiotherapy versus radiotherapy alone for advanced nasopharyngeal carcinoma: positive effect on overall and progression-free survival J Clin Oncol 2003 21 631 637 12586799 10.1200/JCO.2003.06.158 4 Baujat B Audry H Bourhis J MAC-NPC Collaborative Group et al Chemotherapy in locally advanced nasopharyngeal carcinoma: an individual patient data meta-analysis of eight randomized trials and 1753 patients Int J Radiat Oncol Biol Phys 2006 64 47 56 16377415 10.1016/j.ijrobp.2005.06.037 5 Yang Q Cao S Guo L et al Induction chemotherapy followed by concurrent chemoradiotherapy versus concurrent chemoradiotherapy alone in locoregionally advanced nasopharyngeal carcinoma: long-term results of a phase III multicentre randomised controlled trial Eur J Cancer 2019 119 87 96 31425966 10.1016/j.ejca.2019.07.007 6 Fernandes JV Cobucci RN Jatobá CA et al The role of the mediators of inflammation in cancer development Pathol Oncol Res 2015 21 527 534 25740073 10.1007/s12253-015-9913-z 7 Wei WI Sham JS. Nasopharyngeal carcinoma Lancet 2005 365 2041 2054 15950718 10.1016/S0140-6736(05)66698-6 8 Pihlstrom BL Michalowicz BS Johnson NW. Periodontal diseases Lancet 2005 366 1809 1820 16298220 10.1016/S0140-6736(05)67728-8 9 Park HE Song HY Han K et al Number of remaining teeth and health-related quality of life: the Korean National Health and Nutrition Examination Survey Health Qual Life Outcomes 2019 17 5 30626402 10.1186/s12955-019-1078-0 PMC6327472 10 Friedman PK Lamster IB. Tooth loss as a predictor of shortened longevity: exploring the hypothesis Periodontol 2000 2016 72 142 152 27501497 10.1111/prd.12128 11 Yu YH Cheung WS Steffensen B et al Number of teeth is associated with all-cause and disease-specific mortality BMC Oral Health 2021 21 568 34749715 10.1186/s12903-021-01934-0 PMC8574051 12 Holmlund A Holm G Lind L. Number of teeth as a predictor of cardiovascular mortality in a cohort of 7,674 subjects followed for 12 years J Periodontol 2010 81 870 876 20350152 10.1902/jop.2010.090680 13 Yano Y Abnet CC Poustchi H et al Oral health and risk of upper gastrointestinal cancers in a large prospective study from a high-risk region: Golestan cohort study Cancer Prev Res (Phila) 2021 14 709 718 33731409 10.1158/1940-6207.CAPR-20-0577 PMC8295188 14 Ciardo A Simon MM Eberhardt R et al Severe chronic obstructive pulmonary disease is associated with reduced oral health conditions Oral Dis 2024 30 3400 3412 37794640 10.1111/odi.14755 15 Hoare A Soto C Rojas-Celis V et al Chronic inflammation as a link between periodontitis and carcinogenesis Mediators Inflamm 2019 2019 1029857 31049022 10.1155/2019/1029857 PMC6458883 16 Pink C Holtfreter B Völzke H et al Periodontitis and systemic inflammation as independent and interacting risk factors for mortality: evidence from a prospective cohort study BMC Med 2023 21 430 37953258 10.1186/s12916-023-03139-4 PMC10642059 17 Azzolino D Passarelli PC De Angelis P et al Poor oral health as a determinant of malnutrition and sarcopenia Nutrients 2019 11 2898 31795351 10.3390/nu11122898 PMC6950386 18 Tasoulas J Farquhar DR Sheth S et al Poor oral health influences head and neck cancer patient survival: an International Head and Neck Cancer Epidemiology Consortium pooled analysis J Natl Cancer Inst 2024 116 105 114 37725515 10.1093/jnci/djad156 PMC10777670 19 Epstein JB Emerton S Lunn R et al Pretreatment assessment and dental management of patients with nasopharyngeal carcinoma Oral Oncol 1999 35 33 39 10211308 10.1016/s1368-8375(98)00072-4 20 Von Elm E Altman DG Egger M STROBE Initiative et al The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) statement: guidelines for reporting observational studies Ann Intern Med 2007 147 573 577 17938396 10.7326/0003-4819-147-8-200710160-00010 21 Topkan E Ekici NY Ozdemir Y et al Baseline hemoglobin <11.0 g/dL has stronger prognostic value than anemia status in nasopharynx cancers treated with chemoradiotherapy Int J Biol Markers 2019 34 139 147 30864463 10.1177/1724600818821688 22 White SC Pharoah MJ. Oral radiology: principles and interpretation 8th ed. St Louis Elsevier 2018 808 832 23 World Health Organization. Oral health surveys: basic methods 4th ed Geneva World Health Organization 1997 24 Wahl RL Jacene H Kasamon Y et al From RECIST to PERCIST: evolving considerations for PET response criteria in solid tumors J Nucl Med 2009 50 122S 150S 19403881 10.2967/jnumed.108.057307 PMC2755245 25 Chiang CL Guo Q Ng WT et al Prognostic factors for overall survival in nasopharyngeal cancer and implication for TNM staging by UICC: a systematic review Front Oncol 2021 11 703995 34540670 10.3389/fonc.2021.703995 PMC8445029 26 Hoff CM Grau C Overgaard J. Effect of smoking on oxygen delivery and outcome in patients treated with radiotherapy for head and neck squamous cell carcinoma: a prospective study Radiother Oncol 2012 103 38 44 22385797 10.1016/j.radonc.2012.01.011 27 Torgovnick A Schumacher B. DNA repair mechanisms in cancer development and therapy Front Genet 2015 6 157 25954303 10.3389/fgene.2015.00157 PMC4407582 28 Pala M Novakova P Drbohlavova T et al Negative prognostic impact of smoking on long-term survival in patients with nasopharyngeal carcinoma treated with curative (chemo)radiotherapy In Vivo 2023 37 1775 1785 37369456 10.21873/invivo.13266 PMC10347940 29 Somay E Topkan E Bascil S et al What is the impact of smoking during radiotherapy on the radiation-induced acute severe toxicities in head and neck cancer patients? Is it safe or harmful? Acta Sci Med Sci 2024 8 10 30 Nam JK Kim AR Choi SH et al Pharmacologic inhibition of HIF-1α attenuates radiation-induced pulmonary fibrosis in a preclinical image guided radiation therapy Int J Radiat Oncol Biol Phys 2021 109 553 566 32942004 10.1016/j.ijrobp.2020.09.006 31 Qiu F Liang CL Liu H et al Impacts of cigarette smoking on immune responsiveness: up and down or upside down? Oncotarget 2017 8 268 284 27902485 10.18632/oncotarget.13613 PMC5352117 32 Haksoyler V Topkan E. High pretreatment platelet-to-albumin ratio predicts poor survival results in locally advanced nasopharyngeal cancers treated with chemoradiotherapy Ther Clin Risk Manag 2021 17 691 700 34262282 10.2147/TCRM.S320145 PMC8275118 33 Turizo-Smith AD Córdoba-Hernandez S Mejía-Guarnizo LV et al Inflammation and cancer: friend or foe? Front Pharmacol 2024 15 1385479 38799159 10.3389/fphar.2024.1385479 PMC11117078 34 Salemme V Centonze G Cavallo F et al The crosstalk between tumor cells and the immune microenvironment in breast cancer: implications for immunotherapy Front Oncol 2021 11 610303 33777750 10.3389/fonc.2021.610303 PMC7991834 35 Farquhar DR Divaris K Mazul AL et al Poor oral health affects survival in head and neck cancer Oral Oncol 2017 73 111 117 28939062 10.1016/j.oraloncology.2017.08.009 PMC5659716 36 Wu YJ Lin TY Pu XF et al Association of tooth loss and periodontal disease with all-cause mortality in cancer survivors: a cohort study based on NHANES Heliyon 2024 10 e36813 39286207 10.1016/j.heliyon.2024.e36813 PMC11403487 37 Sasaki T Otsuka K Yoshikawa Y et al Tooth loss as a predictor of postoperative complications and prognosis in patients with colorectal cancer J Gastrointest Cancer 2023 54 1261 1267 36807767 10.1007/s12029-023-00924-5 38 Nakao T Shimada M Tokunaga T et al The number of teeth is a prognostic indicator for chemotherapy in colorectal cancer J Med Invest 2025 72 134 138 40268434 10.2152/jmi.72.134 39 Watanabe T Sohda M Kim M et al Preoperative evaluation of oral hygiene may predict the overall survival of patients with esophageal cancer Esophagus 2023 20 99 108 35881278 10.1007/s10388-022-00941-6 40 Su ZY Siak PY Leong CO et al The role of Epstein-Barr virus in nasopharyngeal carcinoma Front Microbiol 2023 14 1116143 36846758 10.3389/fmicb.2023.1116143 PMC9947861 ",
  "metadata": {
    "Title of this paper": "The role of Epstein-Barr virus in nasopharyngeal carcinoma",
    "Journal it was published in:": "The Journal of International Medical Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480824/"
  }
}