{
  "title": "Paper_773",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473344 PMC12473344.1 12473344 12473344 41012565 10.3390/pharmaceutics17091230 pharmaceutics-17-01230 1 Article Enhanced Efinaconazole Permeation and Activity Against Trichophyton rubrum Trichophyton mentagrophytes Yun Seo Wan Lee Jeong Gyun Kim Chul Ho * https://orcid.org/0000-0001-7469-3215 Kim Kyeong Soo * Battaglia Luigi Academic Editor Department of Pharmaceutical Engineering, Gyeongsang National University, 33 Dongjin-ro, Jinju 52725, Republic of Korea; wyjm2013@naver.com leepipi87@naver.com * chkim63@gnu.ac.kr soyoyu79@gnu.ac.kr 22 9 2025 9 2025 17 9 497664 1230 28 8 2025 17 9 2025 18 9 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Methods w w w w Trichophyton rubrum Trichophyton mentagrophytes Results Conclusions w w efinaconazole SNEDDS solubility permeability antifungal activity Trichophyton rubrum trichophyton mentagrophytes SEM human nails This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Onychomycosis is a chronic condition commonly referred to as athlete’s foot. It manifests as nail discoloration, thickening and brittleness and affects approximately 19% of the global population [ 1 2 3 4 5 6 7 8 Among the dermatophytes causing onychomycosis, Trichophyton rubrum Trichophyton mentagrophytes 9 10 11 12 13 14 15 16 17 18 18 22 2 4 19 1 20 Recently, nanoparticle-based drug delivery systems have gained attention as a promising approach to overcome the limitations of conventional onychomycosis treatments [ 21 22 23 24 25 26 27 w w 1 28 29 w w Trichophyton rubrum Trichophyton mentagrophytes Scheme 1 2. Materials and Methods 2.1. Materials EFN was purchased from Virupaksha Organics Ltd. (Hyderabad, Telangana, India). Cremophor RH 40, Kolliphor P188, Kolliphor P407, Kollisolv P124, PEG 400, and Solutol HS15 were supplied by BASF (Ludwigshafen, Germany). D-α-Tocopherol polyethylene glycol 1000 succinate (TPGS) and Kollisolv MCT 70 oil were supplied by Boryung Pharmaceutical (Seoul, Republic of Korea). Castor oil, Coconut oil, Corn oil, Linseed oil, Oleic acid, Olive oil, Peanut oil, Polysorbate 80, Sesame oil, Span 80, Sunflower oil, potassium hydroxide, potassium dihydrogen phosphate, acetonitrile, and Ethyl alcohol were purchased from Daejung Chemicals (Siheung, Republic of Korea). Capryol 90, Labrafac PG, Labrafil M1944 CS, Labrafil M2125 CS, Lauroglycol 90, Peceol oil, and Transcutol P were obtained from Gattefossé (St. Priest, France). Phosphate-buffered saline (PBS, pH 7.4) was purchased from Welgene (Gyeongsan, Republic of Korea). Sodium carboxymethyl cellulose was purchased from Duksan Pure Chemical (Ansan, Republic of Korea). Potato dextrose broth (PDB) was purchased from Kisanbio (Seoul, Republic of Korea), and Sabouraud’s dextrose agar (SDA) from BD Biosciences (San Jose, CA, USA). Agar was purchased from Samchun Chemicals (Pyeongtaek, Republic of Korea). Glutaraldehyde was purchased from Sigma-Aldrich (St. Louis, MO, USA), and Osmium tetroxide from TCI (Tokyo, Japan). Deionized water was produced using a distillation device in the laboratory, and all other chemicals used were of analytical grade. 2.2. HPLC Method for Sample Analysis EFN in samples was quantified using an HPLC (Agilent 1260 series; Agilent Technologies, Santa Clara, CA, USA) equipped with a UV-Vis detector and a high-pressure gradient pump. The analytical column was a reversed-phase column (ZORBAX SB-C18, 4.6 × 250 mm, 5 μm; Agilent Technologies, Santa Clara, CA, USA). The mobile phase was a mixture of two components: Component A, a mixture of 0.01 M phosphate buffer (pH 5.5) and acetonitrile in a ratio of 75:25 v v v v 30 2.3. Solubility Study To select suitable components for the development of the SNEDDS formulation, solubility studies were performed with a variety of oils, surfactants, and co-surfactants. Excess amounts of EFN (10 mg for surfactants and both 10 mg and 200 mg for oils) were added to 1 mL of each pure oil or 10% ( w v v v 30 31 32 33 Section 2.2 2.4. Construction of Pseudo-Ternary Phase Diagram A pseudo-ternary phase diagram was constructed to identify the regions where self-emulsification occurs upon dilution and gentle agitation. Based on the solubility study results, Kollisolv MCT 70 oil, Solutol HS15, and Labrafil M2125CS were selected as the oil, surfactant, and co-surfactant, respectively. Different ratios of these mixtures (0.2 mL total) were introduced into 300 mL of deionized water in a glass beaker at 37 ± 0.5 °C, and the mixtures were gently agitated using a magnetic stirrer at 300 rpm. The ability of each formulation to emulsify spontaneously was visually observed, and emulsions were characterized as “good” if mixture droplets dispersed easily in water, forming a fine emulsion. If the emulsions showed immediate oil droplet coalescence or creaming, they were categorized as “bad.” The emulsions were further evaluated based on particle size [ 34 35 2.5. Preparation of SNEDDS Based on the solubility study results, Kollisolv MCT 70 oil, Solutol HS15, and Labrafil M2125CS were selected as the oil, surfactant, and co-surfactant, respectively, for the SNEDDS formulation. The components were weighed in a weight ratio of 5:75:20 (oil–surfactant–co-surfactant) and briefly vortexed until a clear mixture was obtained. Next, 100 mg of EFN was weighed and added to the prepared mixture, followed by additional vortexing until the solution became clear. For physicochemical characterization, an aliquot of the SNEDDS preconcentrate was diluted with deionized water to form a nanoemulsion. Droplet size and PDI were measured as described in Section 2.6 2.6. Droplet Size, Polydispersity Index, and Zeta Potential The droplet size, polydispersity index (PDI), and zeta potential (ZP) of the SNEDDS formulations were measured to assess emulsion characteristics. Each sample (0.2 mL) was added to 300 mL of deionized water, stirred at 37 ± 0.5 °C and 300 rpm for 15 min, and visually observed for emulsification. The emulsions were then diluted tenfold with deionized water before analysis. Measurements were performed using a Zetasizer Nano ZS (Malvern Panalytical, Malvern, UK) equipped with a disposable folded capillary cell (DTS1070). Prepared samples were introduced into the cell and equilibrated at 37 °C for 120 s. The measurements were conducted at a wavelength of 633 nm and a scattering angle of 13° [ 36 37 38 2.7. Fourier Transform Infrared Spectroscopy Fourier Transform Infrared (FT-IR) spectroscopy was used to assess the compatibility between EFN and the excipients in the SNEDDS formulation. Spectra were recorded with a Spectrum Two TM −1 −1 39 2.8. Transmission Electron Microscopy Analysis The morphology and particle size of the EFN SNEDDS were analyzed using transmission electron microscopy (TEM, Talos L120C, Thermo Fisher Scientific Inc., Waltham, MA, USA). The SNEDDS was sequentially diluted with deionized water, resulting in a final 40-fold dilution. Approximately 20 µL of the final diluted sample was dropped onto a carbon-coated TEM grid (FCF200-CU-50, Electron Microscopy Sciences, Inc., Hatfield, PA, USA) and dried in a dry oven at 40 °C for 24 h. TEM analysis was performed at an accelerating voltage of 300 kV [ 40 2.9. Saturated Solubility Study The saturated solubility of EFN was evaluated in deionized water, with buffer solutions at pH 1.2, pH 4.0, pH 6.8, and pH 7.4. These buffer solutions were prepared using 0.1 M hydrochloric acid and sodium chloride, using 0.05 M sodium acetate buffer, by combining 0.2 M potassium dihydrogen phosphate with 0.2 M sodium hydroxide [ 41 Section 2.3 2.10. In Vitro Artificial Transdermal Membrane Permeability Study The in vitro transdermal permeability of the EFN SNEDDS was evaluated using a synthetic membrane (Strat-M ® ® 2 w v w v 29 48 h J P app p 1 42 43 44 Q 2 (1) Q = ∑ ( C n × V n ) A n C n V n A 48 h J 2 (2) J = d Q A · d t dQ dt A P app (3) P a p p = J C 0 C 0 p J C 0 45 46 2.11. Stability Study The stability of EFN in the SNEDDS formulation was assessed by storing samples in glass vials under different temperature and humidity conditions: 25 °C/60% RH, 40 °C/75% RH, and 60 °C. Samples were monitored over a 6-month period. Droplet size, polydispersity index (PDI), zeta potential (ZP), and drug content were evaluated to determine stability. Particle characterization was conducted according to the methods described in Section 2.6 47 2.12. In Vitro Antifungal Activity—Paper Disc Diffusion Test The in vitro antifungal activity of the EFN SNEDDS was evaluated against Trichophyton rubrum Trichophyton mentagrophytes 6 T. rubrum T. mentagrophytes w v w v 48 49 2.13. Scanning Electron Microscopy Analysis of Morphological Changes in Fungi After EFN SNEDDS Treatment 2.13.1. Morphological Changes in Fungi on Drug-Containing Media Morphological changes in fungal hyphae after EFN SNEDDS treatment were observed using field emission scanning electron microscopy (FE-SEM, Tescan-MIRA3; Tescan Korea, Seoul, Republic of Korea). T. rubrum T. mentagrophytes 6 48 For SEM sample preparation, the collected mycelial plugs were fixed in 2.5% glutaraldehyde for 2 h at 4 °C and washed three times with PBS (pH 7.4). Samples were then post-fixed in 1% osmium tetroxide for 1.5 h at 4 °C, followed by graded ethanol dehydration (30%, 50%, 70%, 80%, 90%, and 100%, with 15 min per step). After drying, the samples were sputter-coated with platinum. Morphological changes were examined under FE-SEM [ 50 51 2.13.2. Morphological Changes in Fungi on Human Nails Human nail samples (approximately 1 mm × 2 mm in size) were sterilized with 70% ethanol and prepared for fungal culture. T. rubrum T. mentagrophytes 6 w v Section 2.13.1 52 2.14. Statistical Evaluation All data were expressed as mean ± standard deviation (SD). Analysis of variance (ANOVA) was conducted using Minitab ver. 19 software (Minitab Inc., State College, PA, USA) to examine differences in the mean and standard deviation between groups. By applying a significance level of p 3. Results 3.1. Solubility Study The selection of appropriate oils, surfactants, and co-surfactants is essential for SNEDDS formulations, as each component plays a critical role in enhancing drug solubility, emulsification efficiency, and stability [ 36 53 Figure 1 Figure 1 Figure 1 ® Figure 1 54 ® ® ® ® ® 3.2. Construction of Pseudo-Ternary Phase Diagrams Pseudo-ternary phase diagrams were constructed using Kollisolv MCT 70, Solutol HS 15, and Labrafil M2125 CS to optimize the SNEDDS composition. A diagram is shown in Figure 2 w w Figure 2 w w w Table S1 Figure S1 w w w 55 56 3.3. Characterization of EFN SNEDDS 3.3.1. Droplet Size, PDI, and ZP The droplet size, polydispersity index (PDI), and zeta potential (ZP) of the EFN-loaded and EFN-unloaded SNEDDS were analyzed to evaluate their physical properties. The results are summarized in Table 1 57 3.3.2. FT-IR Analysis The compatibility between EFN and the excipients in the SNEDDS formulation was evaluated using FT-IR spectroscopy, as shown in Figure 3 Figure 3 −1 −1 −1 −1 −1 −1 −1 −1 Figure 3 −1 −1 −1 −1 2 −1 Figure 3 −1 −1 −1 −1 −1 −1 −1 −1 −1 58 59 60 3.3.3. TEM Analysis The morphological characteristics of the EFN SNEDDS were evaluated using TEM, as shown in Figure 4 3.4. Saturated Solubility Study Drug solubility is a critical parameter influencing absorption and bioavailability [ 61 Figure 5 62 63 64 65 66 67 3.5. In Vitro Artificial Transdermal Membrane Permeability Study An in vitro diffusion study was conducted using a Strat-M ® 68 69 Figure 6 p 2 2 Figure 6 Additionally, differences in various permeation parameters were observed depending on the formulation, and the results are summarized in Table 2 48 h 2 2 70 71 app −4 −5 app 43 70 p −4 −6 Table S2 45 72 42 73 3.6. Stability Study The stability of the EFN SNEDDS was evaluated under standard (25 °C, 60% RH), accelerated (40 °C, 75% RH), and stress (60 °C) conditions over 6 months to assess changes in droplet size, PDI, ZP, and drug content, as summarized in Table 3 74 75 3.7. In Vitro Antifungal Activity—Paper Disc Diffusion Test The antifungal activity of the EFN suspension and EFN SNEDDS was evaluated using the paper disc diffusion test against T. rubrum T. mentagrophytes Table 4 Figure 7 76 T. rubrum 2 2 2 2 2 2 2 T. mentagrophytes 2 2 2 2 2 2 2 T. mentagrophytes T. rubrum Figure 7 77 78 3.8. SEM Analysis of Morphological Changes in T. rubrum and T. mentagrophytes After EFN SNEDDS Treatment 3.8.1. Morphological Changes in Fungi on Drug-Containing Media As shown in Figure 8 T. rubrum T. mentagrophytes T. rubrum Figure 8 T. mentagrophytes Figure 8 T. rubrum T. rubrum Figure 8 T. mentagrophytes Figure 8 T. rubrum T. mentagrophytes 17 3.8.2. Morphological Changes in Fungi on Human Nails SEM analysis was performed to examine the morphological changes in T. rubrum T. mentagrophytes Figure 9 T. rubrum Figure 9 T. mentagrophytes Figure 9 Figure 9 In contrast, morphological damage was observed in the treatment groups after exposure to the EFN suspension and EFN SNEDDS for 24 h ( Figure 10 T. rubrum Figure 10 Figure 10 Figure 10 T. mentagrophytes Figure 10 Figure 10 Figure 10 Figure 10 79 80 81 82 T. rubrum T. mentagrophytes Unique morphological changes such as globular swelling observed at low concentrations of EFN SNEDDS treatment warranted further investigation. To better understand its antifungal effects, additional experiments were conducted using higher concentrations of the EFN SNEDDS. Figure 11 T. rubrum T. mentagrophytes T. rubrum Figure 11 T. mentagrophytes Figure 11 T. rubrum 83 After 5 h of exposure to the EFN SNEDDS, T. rubrum Figure 11 T. mentagrophytes Figure 11 T. rubrum T. mentagrophytes T. rubrum Figure 11 84 T. mentagrophytes Figure 11 85 4. Conclusions EFN is a hydrophobic antifungal agent with poor solubility and permeability, which hinders its therapeutic efficacy in onychomycosis treatment. To address these limitations, we developed a 10% w w T. rubrum T. mentagrophytes 86 87 88 89 90 Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/pharmaceutics17091230/s1 w w w Author Contributions Conceptualization, S.W.Y.; formal analysis, S.W.Y.; methodology, J.G.L.; writing—original draft preparation, S.W.Y.; supervision, C.H.K. and K.S.K.; project administration, C.H.K. and K.S.K.; funding acquisition, K.S.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as potential conflicts of interest. References 1. Agrawal V. Patel R. Patel M. Thanki K. Mishra S. Design and evaluation of microemulsion-based efinaconazole formulations for targeted treatment of onychomycosis through transungual route: Ex vivo and nail clipping studies Colloids Surf. B Biointerfaces 2021 201 111652 10.1016/j.colsurfb.2021.111652 33740733 2. Gupta A.K. Wang T. Polla Ravi S. Mann A. Bamimore M.A. Global prevalence of onychomycosis in general and special populations: An updated perspective Mycoses 2024 67 e13725 10.1111/myc.13725 38606891 3. Gupta A.K. Venkataraman M. Talukder M. Onychomycosis in older adults: Prevalence, diagnosis, and management Drugs Aging 2022 39 191 198 10.1007/s40266-021-00917-8 35102533 4. Bunyaratavej S. Srinonprasert V. Kiratiwongwan R. Wongdama S. Leeyaphan C. Onychomycosis in older adults: The age and associated factors affecting the complete cure rate Australas. J. Dermatol. 2022 63 74 80 10.1111/ajd.13686 34398469 5. Trovato L. Calvo M. De Pasquale R. Scalia G. Oliveri S. Prevalence of onychomycosis in diabetic patients: A case-control study performed at university hospital Policlinico in Catania J. Fungi 2022 8 922 10.3390/jof8090922 PMC9500927 36135647 6. Vlahovic T.C. Sebag J.A. Onychomycosis in Diabetics Onychomycosis: An Illustrated Guide to Diagnosis and Treatment Tosti A. Vlahovic T.C. Arenas R. Springer International Publishing Cham, Switzerland 2017 169 174 7. Chang P. Ucelo Z.M.Q. del Pilar Garzaro Chávez H.M. Onychomycosis and immunodepression Curr. Fungal Infect. Rep. 2017 11 252 257 10.1007/s12281-017-0292-7 8. Ramos-e-Silva M. Lima C.M.O. Schechtman R.C. Trope B.M. Carneiro S. Superficial mycoses in immunodepressed patients (AIDS) Clin. Dermatol. 2010 28 217 225 10.1016/j.clindermatol.2009.12.008 20347666 9. Faergemann J. Baran R. Epidemiology, clinical presentation and diagnosis of onychomycosis Br. J. Dermatol. 2003 149 1 4 10.1046/j.1365-2133.149.s65.4.x 14510968 10. Roberts D. Taylor W. Boyle J. Guidelines for treatment of onychomycosis Br. J. Dermatol. 2003 148 402 410 10.1046/j.1365-2133.2003.05242.x 12653730 11. Christenson J.K. Peterson G.M. Naunton M. Bushell M. Kosari S. Baby K.E. Thomas J. Challenges and Opportunities in the Management of Onychomycosis J. Fungi 2018 4 87 10.3390/jof4030087 PMC6162761 30042327 12. Gupta A.K. Talukder M. Carviel J.L. Cooper E.A. Piguet V. Combatting antifungal resistance: Paradigm shift in the diagnosis and management of onychomycosis and dermatomycosis J. Eur. Acad. Dermatol. Venereol. 2023 37 1706 1717 10.1111/jdv.19217 37210652 13. Rakhshan A. Kamel B.R. Saffaei A. Tavakoli-Ardakani M. Hepatotoxicity induced by azole antifungal agents: A review study Iran. J. Pharm. Res. IJPR 2023 22 e130336 10.5812/ijpr-130336 38116543 PMC10728840 14. Adis Medical Writers Long-term use of systemic azole antifungals can result in hepatotoxicity and other serious adverse effects Drugs Ther. Perspect. 2020 36 112 115 10.1007/s40267-019-00699-5 15. Childs-Kean L.M. Jourjy J. Antifungal Penetration into the Nail and New Topicals for Onychomycosis Curr. Fungal Infect. Rep. 2016 10 24 29 10.1007/s12281-016-0250-9 16. Piraccini B.M. Starace M. Rubin A.I. Di Chiacchio N.G. Iorizzo M. Rigopoulos D. A working group of the European Nail Society Onychomycosis: Recommendations for diagnosis, assessment of treatment efficacy, and specialist referral. The CONSONANCE Consensus Project Dermatol. Ther. 2022 12 885 898 10.1007/s13555-022-00698-x PMC9021334 35262878 17. Tatsumi Y. Nagashima M. Shibanushi T. Iwata A. Kangawa Y. Inui F. Siu W.J.J. Pillai R. Nishiyama Y. Mechanism of action of efinaconazole, a novel triazole antifungal agent Antimicrob. Agents Chemother. 2013 57 2405 2409 10.1128/AAC.02063-12 23459486 PMC3632939 18. Gupta A.K. Talukder M. Efinaconazole in onychomycosis Am. J. Clin. Dermatol. 2022 23 207 218 10.1007/s40257-021-00660-1 34902110 19. Valeant Canada LP JUBLIA™ (Efinaconazole) Topical Solution, 10% w/w [Product Monograph] Submission Control No. 204442, 7 July 2017 Valeant Canada LP Laval, QC, Canada 2017 20. Raphael A.P. Garrastazu G. Sonvico F. Prow T.W. Formulation design for topical drug and nanoparticle treatment of skin disease Ther. Deliv. 2015 6 197 216 10.4155/tde.14.106 25690087 21. Abd-Elsalam W.H. Abouelatta S.M. Contemporary techniques and potential transungual drug delivery nanosystems for the treatment of onychomycosis AAPS PharmSciTech 2023 24 150 10.1208/s12249-023-02603-x 37421509 22. Aldeeb M.M.E. Wilar G. Suhandi C. Elamin K.M. Wathoni N. Nanosuspension-based drug delivery systems for topical applications Int. J. Nanomed. 2024 19 825 844 10.2147/IJN.S447429 38293608 PMC10824615 23. Patel M. Joshi G. Sawant K.K. Nanotechnology in oral drug delivery: Salient aspects, state of art, and applications Functional Bionanomaterials. Nanotechnology in the Life Sciences Springer Cham, Switzerland 2020 165 184 24. Lunter D. Klang V. Eichner A. Savic S.M. Savic S. Lian G. Erdő F. Progress in Topical and Transdermal Drug Delivery Research—Focus on Nanoformulations Pharmaceutics 2024 16 817 10.3390/pharmaceutics16060817 38931938 PMC11207871 25. Gupta A.K. Polla Ravi S. Choi S.Y. Konda A. Cooper E.A. Strategies for the enhancement of nail plate permeation of drugs to treat onychomycosis J. Eur. Acad. Dermatol. Venereol. 2023 37 243 255 10.1111/jdv.18638 36196052 26. Morakul B. Self-nanoemulsifying drug delivery systems (SNEDDS): An advancement technology for oral drug delivery Pharm. Sci. Asia 2020 47 205 220 10.29090/psa.2020.03.019.0121 27. Choi S.A. Park E.J. Lee J.H. Min K.A. Kim S.T. Jang D.-J. Maeng H.-J. Jin S.G. Cho K.H. Preparation and Characterization of Pazopanib Hydrochloride-Loaded Four-Component Self-Nanoemulsifying Drug Delivery Systems Preconcentrate for Enhanced Solubility and Dissolution Pharmaceutics 2022 14 1875 10.3390/pharmaceutics14091875 36145623 PMC9500606 28. Sruthi S. Mathew R. Formulation and development of antifungal loaded nanoemulgel for the treatment of onychomycosis IAJPS 2021 08 191 201 29. Lee B.C. Pangeni R. Na J. Koo K.-T. Park J.W. Preparation and in vivo evaluation of a highly skin-and nail-permeable efinaconazole topical formulation for enhanced treatment of onychomycosis Drug Deliv. 2019 26 1167 1177 31738083 10.1080/10717544.2019.1687612 PMC6882438 30. Vikas A. Rashmin P. Mrunali P. Sandip M. Kaushik T. RP-HPLC method for quantitative estimation of Efinaconazole in topical microemulsion and microemulsion-based-gel formulations and in presence of its degradation products Microchem. J. 2020 155 104753 31. Lee S.-M. Lee J.-G. Yun T.-H. Cho J.-H. Kim K.-S. Enhanced Stability and Improved Oral Absorption of Enzalutamide with Self-Nanoemulsifying Drug Delivery System Int. J. Mol. Sci. 2024 25 1197 10.3390/ijms25021197 38256270 PMC10815963 32. Kim D.S. Cho J.H. Park J.H. Kim J.S. Song E.S. Kwon J. Giri B.R. Jin S.G. Kim K.S. Choi H.-G. Self-microemulsifying drug delivery system (SMEDDS) for improved oral delivery and photostability of methotrexate Int. J. Nanomed. 2019 15 4949 4960 10.2147/IJN.S211014 PMC6617838 31308665 33. Emad N.A. Sultana Y. Aqil M. Saleh A. Nasr F.A. Omega-3 fatty acid-based self-microemulsifying drug delivery system (SMEDDS) of pioglitazone: Optimization, in vitro and in vivo studies Saudi J. Biol. Sci. 2023 30 103778 37663396 10.1016/j.sjbs.2023.103778 PMC10470285 34. Kang J.H. Oh D.H. Oh Y.-K. Yong C.S. Choi H.-G. Effects of solid carriers on the crystalline properties, dissolution and bioavailability of flurbiprofen in solid self-nanoemulsifying drug delivery system (solid SNEDDS) Eur. J. Pharm. Biopharm. 2012 80 289 297 10.1016/j.ejpb.2011.11.005 22119666 35. Truong D.H. Tran T.H. Ramasamy T. Choi J.Y. Lee H.H. Moon C. Choi H.-G. Yong C.S. Kim J.O. Development of solid self-emulsifying formulation for improving the oral bioavailability of erlotinib AAPS PharmSciTech 2016 17 466 473 26238806 10.1208/s12249-015-0370-5 PMC4984901 36. Choi H.J. Kim K.S. Development of Solid Self-nanoemulsifying Drug Delivery Systems of Ticagrelor Using Porous Carriers J. Life Sci. 2021 31 502 510 37. Ramaye Y. Dabrio M. Roebben G. Kestens V. Development and validation of optical methods for zeta potential determination of silica and polystyrene particles in aqueous suspensions Materials 2021 14 290 10.3390/ma14020290 33429974 PMC7827561 38. Varenne F. Botton J. Merlet C. Vachon J.-J. Geiger S. Infante I.C. Chehimi M.M. Vauthier C. Standardization and validation of a protocol of zeta potential measurements by electrophoretic light scattering for nanomaterial characterization Colloids Surf. A: Physicochem. Eng. Asp. 2015 486 218 231 10.1016/j.colsurfa.2015.08.044 39. Mantri S.K. Pashikanti S. Murthy K.V.R. Development and characterization of self-nanoemulsifying drug delivery systems (SNEDDS) of atorvastatin calcium Curr. Drug Deliv. 2012 9 182 196 10.2174/156720112800234594 22283646 40. Singh A.K. Chaurasiya A. Awasthi A. Mishra G. Asati D. Khar R.K. Mukherjee R. Oral bioavailability enhancement of exemestane from self-microemulsifying drug delivery system (SMEDDS) AAPS PharmSciTech 2009 10 906 916 10.1208/s12249-009-9281-7 19609837 PMC2802159 41. Yun T. Lee S. Yun S. Cho D. Bang K. Kim K. Investigation of stabilized amorphous solid dispersions to improve oral olaparib absorption Pharmaceutics 2024 16 958 10.3390/pharmaceutics16070958 39065655 PMC11280475 42. Kumari S. Alsaidan O.A. Mohanty D. Zafar A. Das S. Gupta J.K. Khalid M. Development of Soft Luliconazole Invasomes Gel for Effective Transdermal Delivery: Optimization to In-Vivo Antifungal Activity Gels 2023 9 626 10.3390/gels9080626 37623081 PMC10453308 43. Park Y.J. Kim D.W. Development and evaluation of hot-melt–extruded diquafosol tetrasodium formulations for ophthalmic inserts: A design of experiments approach Int. J. Pharm. 2024 659 124249 10.1016/j.ijpharm.2024.124249 38772496 44. Vikash B. Pandey N.K. Kumar B. Wadhwa S. Goutam U. Alam A. Al-Otaibi F. Chaubey P. Mustafa G. Gupta G. Formulation and evaluation of ocular self-nanoemulsifying drug delivery system of brimonidine tartrate J. Drug Deliv. Sci. Technol. 2023 81 104226 10.1016/j.jddst.2023.104226 45. Marzulli F.N. Brown D.W. Maibach H.I. Techniques for studying skin penetration Toxicol. Appl. Pharmacol. 1969 14 76 83 10.1016/S0041-008X(69)80012-8 46. Champmartin C. Seiwert C. Aubertin M. Joubert E. Marquet F. Chedik L. Cosnier F. Percutaneous absorption of two bisphenol a analogues, BPAF and TGSA: Novel In vitro data from human skin Chemosphere 2024 367 143564 10.1016/j.chemosphere.2024.143564 39424152 47. Bang K.-H. Kim K.S. Development of trans-cinnamaldehyde self-microemulsifying drug delivery system (SMEDDS) with superior stability J. Korea Acad.-Ind. Coop. Soc. 2019 20 555 562 48. Zheng Y. Shang Y. Li M. Li Y. Ouyang W. Antifungal Activities of cis-trans Citral Isomers against Trichophyton rubrum with ERG6 as a Potential Target Molecules 2021 26 4263 10.3390/molecules26144263 34299538 PMC8304469 49. Hu F. Tu X.-F. Thakur K. Hu F. Li X.-L. Zhang Y.-S. Zhang J.-G. Wei Z.-J. Comparison of antifungal activity of essential oils from different plants against three fungi Food Chem. Toxicol. 2019 134 110821 10.1016/j.fct.2019.110821 31533060 50. Yanyun C. Ying T. Wei K. Hua F. Haijun Z. Ping Z. Shunming X. Jian W. Preliminary study on antifungal mechanism of aqueous extract of cnidium monnieri against trichophyton rubrum Front. Microbiol. 2021 12 707174 10.3389/fmicb.2021.707174 34489895 PMC8417377 51. Wu S. Zhang X. Sun Y. Wu Z. Li T. Hu Y. Su D. Lv J. Li G. Zhang Z. Transformation and immobilization of chromium by arbuscular mycorrhizal fungi as revealed by SEM–EDS, TEM–EDS, and XAFS Environ. Sci. Technol. 2015 49 14036 14047 10.1021/acs.est.5b03659 26551890 52. Nishiyama Y. Maeda M. Yamada T. Effect of Topical Antifungal Luliconazole on Hyphal Morphology of Trichophyton mentagrophytes Mycopathologia 2022 187 491 496 10.1007/s11046-022-00661-6 36057744 53. Limbani M.D. Patel L. Studies on drug solubilization and role of lipid vehicle in pseudo ternary phase diagram in formulation development of SNEDDS containing poorly water soluble drug Int. J. Pharm. Sci. Rev. Res. 2016 40 228 237 54. Weerapol Y. Limmatvapirat S. Nunthanid J. Sriamornsak P. Self-nanoemulsifying drug delivery system of nifedipine: Impact of hydrophilic–lipophilic balance and molecular structure of mixed surfactants AAPS PharmSciTech 2014 15 456 464 10.1208/s12249-014-0078-y 24452500 PMC3969497 55. Schmied F.-P. Bernhardt A. Engel A. Klein S. A customized screening tool approach for the development of a self-nanoemulsifying drug delivery system (SNEDDS) AAPS PharmSciTech 2021 23 39 10.1208/s12249-021-02176-7 34961897 PMC8816498 56. Ahmad N. Khalid M.S. Khan M.F. Ullah Z. Beneficial effects of topical 6-gingerol loaded nanoemulsion gel for wound and inflammation management with their comparative dermatokinetic J. Drug Deliv. Sci. Technol. 2023 80 104094 10.1016/j.jddst.2022.104094 57. Danaei M. Dehghankhold M. Ataei S. Hasanzadeh Davarani F. Javanmard R. Dokhani A. Khorasani S. Mozafari M. Impact of particle size and polydispersity index on the clinical applications of lipidic nanocarrier systems Pharmaceutics 2018 10 57 10.3390/pharmaceutics10020057 29783687 PMC6027495 58. Detholia K. Mohandas A. Varia U. Jadeja M. Katariya H. Development and optimization of Ropinirole loaded self-nanoemulsifying tablets Future J. Pharm. Sci. 2023 9 66 10.1186/s43094-023-00516-x 59. Nair A.B. Aldhubiab B. Shah J. Jacob S. Attimarad M. Sreeharsha N. Venugopala K.N. Joseph A. Morsy M.A. Design, Development, and Evaluation of Constant Voltage Iontophoresis for the Transungual Delivery of Efinaconazole Pharmaceutics 2023 15 1422 10.3390/pharmaceutics15051422 37242664 PMC10223599 60. Asghar Z. Jamshaid T. Sajid-ur-Rehman M. Jamshaid U. Gad H.A. Novel Transethosomal Gel Containing Miconazole Nitrate; Development, Characterization, and Enhanced Antifungal Activity Pharmaceutics 2023 15 2537 10.3390/pharmaceutics15112537 38004517 PMC10675164 61. Khadka P. Ro J. Kim H. Kim I. Kim J.T. Kim H. Cho J.M. Yun G. Lee J. Pharmaceutical particle technologies: An approach to improve drug solubility, dissolution and bioavailability Asian J. Pharm. Sci. 2014 9 304 316 10.1016/j.ajps.2014.05.005 62. Proksch E. pH in nature, humans and skin J. Dermatol. 2018 45 1044 1052 10.1111/1346-8138.14489 29863755 63. Miao Y. Zhao S. Zuo J. Sun J. Wang J. Reduced the food effect and enhanced the oral bioavailability of ivacaftor by self-nanoemulsifying drug delivery system (SNEDDS) using a new oil phase Drug Des. Dev. Ther. 2022 16 1531 1546 10.2147/DDDT.S356967 PMC9143795 35637746 64. Cao M. Xue X. Pei X. Qian Y. Liu L. Ren L. Chen G. Formulation optimization and pharmacokinetics evaluation of oral self-microemulsifying drug delivery system for poorly water soluble drug cinacalcet and no food effect Drug Dev. Ind. Pharm. 2018 44 969 981 10.1080/03639045.2018.1425428 29313395 65. Yusuf A. Almotairy A.R.Z. Henidi H. Alshehri O.Y. Aldughaim M.S. Nanoparticles as drug delivery systems: A review of the implication of nanoparticles’ physicochemical properties on responses in biological systems Polymers 2023 15 1596 10.3390/polym15071596 37050210 PMC10096782 66. Kazi M. Al-Swairi M. Ahmad A. Raish M. Alanazi F.K. Badran M.M. Khan A.A. Alanazi A.M. Hussain M.D. Evaluation of self-nanoemulsifying drug delivery systems (SNEDDS) for poorly water-soluble talinolol: Preparation, in vitro and in vivo assessment Front. Pharmacol. 2019 10 459 10.3389/fphar.2019.00459 31118895 PMC6507620 67. Frei G. Haimhoffer Á. Csapó E. Bodnár K. Vasvári G. Nemes D. Lekli I. Gyöngyösi A. Bácskay I. Fehér P. In Vitro and In Vivo Efficacy of Topical Dosage Forms Containing Self-Nanoemulsifying Drug Delivery System Loaded with Curcumin Pharmaceutics 2023 15 2054 10.3390/pharmaceutics15082054 37631267 PMC10459893 68. Salamanca C.H. Barrera-Ocampo A. Lasso J.C. Camacho N. Yarce C.J. Franz diffusion cell approach for pre-formulation characterisation of ketoprofen semi-solid dosage forms Pharmaceutics 2018 10 148 10.3390/pharmaceutics10030148 30189634 PMC6161298 69. Haq A. Dorrani M. Goodyear B. Joshi V. Michniak-Kohn B. Membrane properties for permeability testing: Skin versus synthetic membranes Int. J. Pharm. 2018 539 58 64 10.1016/j.ijpharm.2018.01.029 29366943 70. Monti D. Mazzantini D. Tampucci S. Vecchione A. Celandroni F. Burgalassi S. Ghelardi E. Ciclopirox and efinaconazole transungual permeation, antifungal activity, and proficiency to induce resistance in Trichophyton rubrum Antimicrob. Agents Chemother. 2019 63 e00442-19 10.1128/AAC.00442-19 31332076 PMC6761538 71. Devi A. Chaurasia H. Singh R. Development of nano formuation and its optimization evaluation of efinaconazole loaded transfersomal gel for treatment of nail infection J. Jilin Univ. 2021 40 23 43 72. Kwon S.B. Lee H.-Y. Permeation Characteristics of Acetaminophen Using Franz Diffusion Cells J. Biotechnol. Bioind. 2022 10 32 36 10.37503/jbb.2022.10.32 73. Ghafourian T. Nokhodchi A. Kaialy W. Surfactants as penetration enhancers for dermal and transdermal drug delivery Percutaneous Penetration Enhancers Chemical Methods in Penetration Enhancement: Modification of the Stratum Corneum Springer Berlin/Heidelberg, Germany 2015 207 230 74. Cole E.T. Cadé D. Benameur H. Challenges and opportunities in the encapsulation of liquid and semi-solid formulations into capsules for oral administration Adv. Drug Deliv. Rev. 2008 60 747 756 10.1016/j.addr.2007.09.009 18096270 75. Kanwal T. Saifullah S. ur Rehman J. Kawish M. Razzak A. Maharjan R. Imran M. Ali I. Roome T. Simjee S.U. Design of absorption enhancer containing self-nanoemulsifying drug delivery system (SNEDDS) for curcumin improved anti-cancer activity and oral bioavailability J. Mol. Liq. 2021 324 114774 10.1016/j.molliq.2020.114774 76. Sarhadi H. Shahdadi F. Salehi Sardoei A. Hatami M. Ghorbanpour M. Investigation of physio-mechanical, antioxidant and antimicrobial properties of starch–zinc oxide nanoparticles active films reinforced with Ferula gummosa Boiss essential oil Sci. Rep. 2024 14 5789 10.1038/s41598-024-56062-w 38461344 PMC10925051 77. Alhakamy N.A. Hosny K.M. Nano-vesicular delivery system loaded by Bifonazole: Preparation, optimization, and assessment of pharmacokinetic and antifungal activity J. Drug Deliv. Sci. Technol. 2019 49 316 322 10.1016/j.jddst.2018.11.020 78. Kassem A.A. Mohsen A.M. Ahmed R.S. Essam T.M. Self-nanoemulsifying drug delivery system (SNEDDS) with enhanced solubilization of nystatin for treatment of oral candidiasis: Design, optimization, in vitro and in vivo evaluation J. Mol. Liq. 2016 218 219 232 10.1016/j.molliq.2016.02.081 79. Gräser Y. Kuijpers A. Presber W. De Hoog G.S. Molecular taxonomy of Trichophyton mentagrophytes T. tonsurans Med. Mycol. 1999 37 315 330 10.1046/j.1365-280X.1999.00234.x 10520156 80. Chin B. Knight S. Growth of Trichophyton mentagrophytes Microbiology 1957 16 642 646 10.1099/00221287-16-3-642 13439148 81. Švarcová M. Větrovský T. Kolařík M. Hubka V. Defining the relationship between phylogeny, clinical manifestation, and phenotype for Trichophyton mentagrophytes interdigitale Med. Mycol. 2023 61 myad042 10.1093/mmy/myad042 37070928 PMC10148955 82. Feofilova E. Ivashechkin A. Alekhin A. Sergeeva Y.E. Fungal spores: Dormancy, germination, chemical composition, and role in biotechnology Appl. Biochem. Microbiol. 2012 48 1 11 22567879 83. Leng W. Liu T. Li R. Yang J. Wei C. Zhang W. Jin Q. Proteomic profile of dormant Trichophyton rubrum conidia BMC Genom. 2008 9 303 10.1186/1471-2164-9-303 PMC2443143 18578874 84. Guttentag A. Krishnakumar K. Cokcetin N. Hainsworth S. Harry E. Carter D. Inhibition of dermatophyte fungi by Australian jarrah honey Pathogens 2021 10 194 10.3390/pathogens10020194 33670403 PMC7918412 85. Kaufman G. Horwitz B.A. Duek L. Ullman Y. Berdicevsky I. Infection stages of the dermatophyte pathogen Trichophyton: Microscopic characterization and proteolytic enzymes Med. Mycol. 2007 45 149 155 10.1080/13693780601113618 17365651 86. Akbarzadeh A. Rezaei-Sadabady R. Davaran S. Joo S.W. Zarghami N. Hanifehpour Y. Samiei M. Kouhi M. Nejati-Koshki K. Liposome: Classification, preparation, and applications Nanoscale Res. Lett. 2013 8 102 10.1186/1556-276X-8-102 23432972 PMC3599573 87. Maeki M. Kimura N. Okada Y. Shimizu K. Shibata K. Miyazaki Y. Ishida A. Yonezawa K. Shimizu N. Shinoda W. Understanding the effects of ethanol on the liposome bilayer structure using microfluidic-based time-resolved small-angle X-ray scattering and molecular dynamics simulations Nanoscale Adv. 2024 6 2166 2176 10.1039/D3NA01073B 38633055 PMC11019499 88. Duan Y. Dhar A. Patel C. Khimani M. Neogi S. Sharma P. Kumar N.S. Vekariya R.L. A brief review on solid lipid nanoparticles: Part and parcel of contemporary drug delivery systems RSC Adv. 2020 10 26777 26791 10.1039/D0RA03491F 35515778 PMC9055574 89. Mukherjee S. Ray S. Thakur R. Solid lipid nanoparticles: A modern formulation approach in drug delivery system Indian J. Pharm. Sci. 2009 71 349 10.4103/0250-474X.57282 20502539 PMC2865805 90. Buya A.B. Beloqui A. Memvanga P.B. Préat V. Self-nano-emulsifying drug-delivery systems: From the development to the current applications and challenges in oral drug delivery Pharmaceutics 2020 12 1194 10.3390/pharmaceutics12121194 33317067 PMC7764143 Figures, Scheme and Tables pharmaceutics-17-01230-sch001_Scheme 1 Scheme 1 Overview of the research design in this study. Figure 1 Solubility of EFN in various ( A B C w v A C B n Figure 2 ( A B w w w Figure 3 FT-IR spectra of ( A B C Figure 4 TEM image of EFN SNEDDS. Scale bar: 50 nm. Figure 5 Comparison of saturated solubility of EFN and EFN SNEDDS across different pH conditions. Data are expressed as mean ± standard deviation ( n Figure 6 ( A ® n B C p Figure 7 Antifungal activity of ( A C B D A B T. rubrum C D T. mentagrophytes Figure 8 SEM images of morphological changes in T. rubrum T. mentagrophytes A B T. rubrum C D T. mentagrophytes E F T. rubrum G H T. mentagrophytes Figure 9 SEM images of untreated control cultures of ( A B T. rubrum C D T. mentagrophytes w v E F T. rubrum G H T. mentagrophytes Figure 10 SEM images of T. rubrum T. mentagrophytes T. rubrum A B C D E F G H T. mentagrophytes I J K L M N O P Figure 11 SEM images of ( A B T. rubrum C D E F G H T. mentagrophytes I J K L pharmaceutics-17-01230-t001_Table 1 Table 1 Composition and physical characteristics such as droplet size, PDI, z-potential, and drug content of EFN-loaded and EFN-unloaded SNEDDS. Each value represents the mean ± S.D. ( n  SNEDDS Composition (mg) Droplet Size (nm) PDI ZP (mV) Drug Content (%) Kollisolv MCT 70 Solutol HS 15 Labrafil M2125CS EFN-unloaded 50 750 200 31.0 ± 0.6 0.13 ± 0.02 −13.6 ± 0.5 - EFN 100 mg loaded 31.8 ± 0.8 0.21 ± 0.01 −12.3 ± 0.9 100.2 ± 0.3 pharmaceutics-17-01230-t002_Table 2 Table 2 Permeation parameters of EFN through Strat-M ® n p Parameters EFN Suspension EFN SNEDDS Q% 48 h 0.24 ± 0.09 9.69 ± 0.18 * Flux (J, μg/cm 2 0.72 ± 0.30 17.31 ± 0.53 * P app 3.48 × 10 −5 8.38 × 10 −4 Lag time (min) 0.058 ± 0.017 0.021 ± 0.018 Permeability coefficient (K p 7.34 × 10 −6 2.47 × 10 −4 pharmaceutics-17-01230-t003_Table 3 Table 3 Stability study of EFN SNEDDS at ( A B C n Time (month) Droplet Size (nm) PDI ZP (mV) Drug Content (%) (A) 25 °C, 60% RH 0 31.8 ± 0.8 0.21 ± 0.01 −12.3 ± 0.9 100.2 ± 0.3 3 32.2 ± 0.2 0.21 ± 0.01 −12.3 ± 0.5 100.2 ± 0.1 6 35.0 ± 0.4 0.22 ± 0.02 −12.6 ± 0.6 100.1 ± 0.1 (B) 40 °C, 75% RH 0 31.8 ± 0.8 0.21 ± 0.01 −12.3 ± 0.9 100.2 ± 0.3 3 32.5 ± 0.5 0.23 ± 0.02 −13.0 ± 0.4 100.0 ± 0.2 6 36.4 ± 0.2 0.25 ± 0.01 −13.5 ± 0.5 99.8 ± 0.2 (C) 60 °C 0 31.8 ± 0.8 0.21 ± 0.01 −12.3 ± 0.9 100.2 ± 0.3 3 35.9 ± 0.4 0.25 ± 0.03 −13.9 ± 0.2 100.0 ± 0.1 6 39.2 ± 0.6 0.26 ± 0.03 −16.4 ± 0.3 99.5 ± 0.1 pharmaceutics-17-01230-t004_Table 4 Table 4 Antifungal activity of EFN suspension and EFN SNEDDS against ( A T. rubrum B T. mentagrophytes 2 n p  (A) Zone of Inhibition (cm 2 T. rubrum Drug conc. (mg/mL) EFN suspension EFN SNEDDS C0 ND ND CV ND ND 100 28.97 ± 0.23 63.59 ± 0.00 * 10 28.50 ± 0.03 52.78 ± 0.18 * 1 14.18 ± 0.06 40.69 ± 0.43 * 0.5 14.51 ± 0.20 33.34 ± 0.19 * 0.1 0.79 ± 0.33 12.56 ± 0.27 * 0.05 ND 2.83 ± 0.03 * 0.01 ND ND  (B) Zone of Inhibition (cm 2 T. mentagrophytes Drug conc. (mg/mL) EFN suspension EFN SNEDDS C0 ND ND CV ND ND 100 34.45 ± 0.04 63.59 ± 0.00 * 10 35.50 ± 0.14 54.30 ± 0.25 * 1 17.16 ± 0.26 31.16 ± 0.18 * 0.5 5.51 ± 2.00 23.75 ± 0.10 * 0.1 4.15 ± 0.07 6.30 ± 0.03 * 0.05 1.65 ± 0.09 4.09 ± 0.03 * 0.01 ND 2.45 ± 0.06 * ",
  "metadata": {
    "Title of this paper": "Self-nano-emulsifying drug-delivery systems: From the development to the current applications and challenges in oral drug delivery",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473344/"
  }
}