{
  "title": "Paper_97",
  "abstract": "pmc Front Endocrinol (Lausanne) Front Endocrinol (Lausanne) 1753 frontendo Front. Endocrinol. Frontiers in Endocrinology 1664-2392 Frontiers Media SA PMC12488444 PMC12488444.1 12488444 12488444 10.3389/fendo.2025.1617731 1 Endocrinology Review Chapter 3. Impact of estrogens on hemostasis Stanczyk Frank Z.  1  * Sriprasert Intira  1 Chulapongwanich Shinnisha  2 Yang Jane L.  1 Fruzzetti Franca  3  1 Dept of Obstetrics & Gynecology, University of Southern California, Keck School of Medicine Los Angeles, CA United States  2 Princess Srisavangavadhana College of Medicine, Chulabhorn Royal Academy Bangkok Thailand  3 Clinica San Rossore, Viale delle Cascine Pisa Italy Edited by: Laure Morimont Reviewed by: Chris Kent Arnatt  Jonathan Douxfils *Correspondence: Frank Z. Stanczyk, fstanczyk@att.net 18 9 2025 2025 16 480647 1617731 24 4 2025 18 8 2025 18 09 2025 03 10 2025 03 10 2025 Copyright © 2025 Stanczyk, Sriprasert, Chulapongwanich, Yang and Fruzzetti. 2025 Stanczyk, Sriprasert, Chulapongwanich, Yang and Fruzzetti https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. It is well established that estrogens increase the risk of both arterial and venous thrombosis. Abnormally high levels of some coagulation factors combined with a decrease in anticoagulation factors contribute to thrombotic risk. Although estrogens are known to affect multiple hemostatic markers, the exact molecular mechanism of estrogen-induced thrombosis is unclear. However, small changes in these markers with different types, doses, and/or routes of estrogens may increase thrombotic risk. Most studies on the effect of estrogens have been carried out in premenopausal women using combined oral contraceptives (COCs); studies in postmenopausal women using hormone therapy (HT) are scarce. Short-term studies comparing hemostatic parameters in women receiving either ethinyl estradiol (EE) or estradiol (E 2 2 4 4 2 thrombosis estrogens combined oral contraceptive hemostatic markers hormone therapy postmenopausal women coagulation fibrinolysis The authors declare that no financial support was received for the research, and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Reproduction Introduction Millions of women worldwide use exogenous estrogens for hormonal contraception or postmenopausal hormone therapy (HT) ( 1 2 3 2 2 2 4 5 2 2 4 6  Figures 1  2 Figure 1 Chemical structures of estrogens. Chemical structures of four estrogen compounds: Ethinylestradiol (EE), Estradiol (E₂), Estetrol (E₄), and Estradiol valerate (E₂V). Each structure depicts molecular arrangements including hydroxyl groups, hydrogen atoms, and other specific bonds. Figure 2 Chemical structures of equine estrogens. Chemical structures of equine estrogens categorized into three groups: 17-keto, 17β-hydroxy, and 17α-hydroxy. Each category lists specific compounds: estrone, equilin, equilenin, and Δ8-estrone for 17-keto; 17β-estradiol, 17β-dihydroequilin, and 17β-dihydroequilenin for 17β-hydroxy; 17α-estradiol, 17α-dihydroequilin, and 17α-dihydroequilenin for 17α-hydroxy. Each compound's molecular structure is depicted. The most common route of administering estrogens is oral, although different estrogen formulations may offer other routes of administration that can be tailored to patients’ individual needs ( 5 2 5 It is well established that estrogens increase the risk of both arterial and venous thrombosis. Abnormally high levels of some coagulation factors in combination with a decrease in anticoagulation factors contribute to thrombotic risk ( 7 8 The purpose of the present chapter is to show how different estrogens impact hemostasis in premenopausal and postmenopausal women. We identified articles included in this review by searching in PubMed databases using the following search terms: “estrogens”, “estradiol”, “hemostasis”, “thromboembolism”, and “venous thromboembolism”; all studies were in English. Mechanism of Action of Estrogens Estrogens mediate physiologic processes by genomic and nongenomic mechanisms. Both mechanisms involve the binding of estrogens to estrogen receptors (ERs). There are 2 primary ERs, ERα and ERβ, encoded by different genes; ERα is encoded by the ESR1 ESR2 9 10 The genomic (or classical) mechanism of estrogen action refers to the slow estrogen pathway that takes place over several hours or days ( 11 In contrast to genomic mechanisms of estrogen action, non-genomic mechanisms involve rapid estrogen signaling that takes place within seconds or minutes ( 11 Human genome-wide searches for high affinity EREs have demonstrated that they occur in many of the genes belonging to the procoagulant and anticoagulant pathways ( 12 Pharmacokinetics of estrogens Since circulating estrogens affect concentrations of coagulation and fibrinolytic factors, it is important to know their pharmacokinetics, and how pharmacokinetic parameters differ among various estrogens. Much of our knowledge of estrogen pharmacokinetics is based on serum or plasma levels measured by immunoassay methods ( 13 13 Two clinically important pharmacokinetic parameters of a drug are its bioavailability and half-life. The bioavailability of a drug is the extent to which it enters the systemic circulation after undergoing hepatic first-pass metabolism. The half-life of a drug is the time required for a drug’s blood level to fall to 50% of its maximal level. The bioavailability of E 4 14 15 2 16 2 2 1 In the circulation, most of the EE and E 4 2 17 2 18 2 19 The oral bioavailability of different estrogens depends on absorption within the digestive system. E 4 max max 4 14 20 2 2 max 21 max 22 Reported terminal half-lives (t ½ 23 2 24 4 25 1 2 26 Potency of estrogens The potency of an estrogen refers to its strength. It can be defined as a measure of the doses of 2 different drugs required to produce the same pharmacologic effect. The relative potencies of orally administered E 2 27 2 2 2 28 29 The high estrogenic potency of EE is also evident in studies in which it was administered parenterally. Treatment of premenopausal women with a transdermal patch delivering 20 µg/d of EE and 150 µg/d of norelgestromin resulted in significant increases from baseline in serum levels of SHBG, CBG, TBG, and hs-CRP ( 30 31 2 32 As for E 4 4 4 33 Effect of estrogens on hemostasis The process of hemostasis involves several factors that act simultaneously to create a balance between coagulation and anticoagulation. Dysregulation of this system may increase the risk of arterial or venous thrombosis and subsequent tissue ischemia. Although estrogens are known to affect multiple hemostatic markers, the exact molecular mechanism of estrogen-induced thrombosis is not clear. However, it is possible that small changes in those markers by different types, routes, and/or doses of estrogens may increase the risk of thrombosis. Most studies on the effect of estrogens on hemostasis have been carried out in premenopausal women using COCs; studies in postmenopausal women using HT are limited. The studies with COCs have been carried out predominantly in combination with a progestin. Most of the studies have involved EE-based COCs and considerably fewer studies exist with E 2 4 2 2 Estrogens and hemostasis in COC users EE is most commonly used in COCs and has been shown to have a dose-dependent effect on thrombosis risk ( 34 35 2 2 Another double-blind, randomized study by Gaussem and coworkers ( 36 2 A randomized, open-label, single-center study by Junge and coworkers reported a comparison of a multiphasic formulation combining E 2 37 These short-term studies comparing hemostatic parameters in women receiving either E 2 2 Recently, E 4 33 4 4 4 4 4 4 4 Morimont and coworkers ( 38 4 4 According to data from the above short-term comparative studies of the effects of different types of estrogens on hemostatic parameters, the E 2 4  Table 1 Table 1 Summary of studies showing the effects of ethinylestradiol-, estradiol-, and estetrol-based combined oral contraceptives on the coagulation and fibrinolytic systems in premenopausal women. Study Percentage change from baseline (%) Agren et al. ( 35 Junge et al. ( 37 Douxfils et al. ( 33 Gaussem et al. ( 36 E 2 EE/LNG E 2 EE/LNG E 4 EE/LNG EE/DRSP E 2 EE/LNG Anticoagulant proteins Antithrombin III 3.9 -3.6 * 0.8 -3.0 -1.0 -5.0 -3.5 0.3 -4.4 * Protein S activity 1.8 -11.7 * -4.0 -5.0 -30.5 * Protein S free 13.3 11.9 5.0 -3.0 -22.5 * Total protein S 4.7 -3.6 * Protein C -3.1 8.2 * 2.0 7.0 17.5 * Protein C activity 8.3 14.5 TFPI free -8.5 1.0 -20.0 Fibrinolytic proteins Plasminogen 12.0 40.0 * 35.5 * 6 30 * PAI-1 -10.6 -36.2 20.0 0.0 0.0 -3.1 -8.0 * t-PA -3.7 -5.1 -7.0 -33.0 * -39.5 * Marker for ongoing coagulation D-dimer 0.0 0.0 -2.1 62.9 * 4.0 7.0 0.0 -53 43 * Prothrombin fragment 1 + 2 -1.7 13.5 -0.6 117.3 23.0 71.0 * 64.0 * -0.02 0.08 * Procoagulant factors Fibrinogen 7.9 28.1 * 10.0 5.0 16.0 Prothrombin/Factor II -0.9 3.0 7.0 13.0 7.0 Factor VII -3.0 -5.0 20.0 * Factor VIIa 8.8 14.4 Factor VIIc 1.0 -12.7 * Factor VII activity 13.5 24.4 * Factor VIII 4.8 6.8 5.0 3.0 9.0 Factor VIII activity 6.9 7.5 Von Willebrand factor 5.0 -2.0 13.0 Functional coagulation tests nAPCsr 30.0 164.5 * 218.5 * APC resistance (aPTT) 3.3 2.0 -5.3 -7.0 ETP based APCr 60.0 146.4 * APC, activated protein C; DNG, dienogest; DRSP, drospirenone; E 2 2 *Statistically significant difference (P<0.005) from the reference product (reference products are E 2 35 2 37 4 33 2 36 Adapted with permission from Stanczyk et al. ( 4 In the absence of standardized assay methods to evaluate coagulability status, there has been misinterpretation of data obtained with 2 activated protein C (APC) sensitivity assays, which quantify the effects of APC on the aPTT and ETP ( 39 39 40 39 41 4 39 40 42 43 44 Estrogens and hemostasis in menopausal HT users Several studies quantified hemostasis in order to examine the association of estrogen used in menopausal HT with thrombosis risk. A meta-analysis of 48 studies including 40–68 years old postmenopausal women (6,229 HT users and 24,974 non-users) explored the association between HT use on coagulation factors ( 45 When comparing different type of estrogen, Blondon and coworkers reported from a retrospective cohort study of 140 postmenopausal women that women using E 2 46 4 Routes of estrogen administration for menopausal HT have shown different hemostasis effects. A double-blind placebo-controlled study among 152 menopausal women randomized to oral E 2 2 2 47 2 2 2 48 To explore the effect of estrogen doses on hemostasis, Lobo and coworkers ( 49 2 50 2 2 To determine whether biomarkers of thrombosis can identify menopausal women at risk of VTE, a nested case-control study ( 51 52 53 Effect of estrogens on thrombosis The increased procoagulant factors and decreased anticoagulatory mechanisms observed with estrogen use have been linked with an increased risk of thrombosis, this includes both venous and arterial thrombosis. The most frequent clinical sign of estrogen-related thrombosis is VTE, affecting the deep veins of the legs or the pulmonary arteries, typically within the first few months of use. Estrogen has also been associated with an increased risk of thrombosis at uncommon sites and with arterial thrombosis ( 34 Estrogens and Thrombosis in COC Users Recently, there has been an increasing interest in how the types and delivery routes of estrogen influence the risk of VTE. Some studies have proposed that non-oral routes of administration may result in lower serum estrogen concentrations and fewer systemic effects than oral administration. We summarize the studies related to estrogens used for contraception on risk for thrombosis in  Table 2 Table 2 Effect of estrogens on risk for thrombosis in women using combined oral contraceptives; summary from systematic review. Study Reference Results Type of estrogen Morimont et al. ( 40 EE-based: E 2 Douxfils et al. ( 54 E 2 Bauerfeind et al. ( 55 E 2 Route of estrogen administration Tepper et al. ( 56 Patch vs. oral: Estrogen dosage De Bastos et al. ( 57 58 Higher EE dose is associated with higher risk. Type of estrogen The natural estrogens, E 2 4 40 2 2 4 59 2 60 61 Douxfils and coworkers ( 54 2 2 62 63 61 64 55 2 A recent pooled analysis by Bauerfeind and coworkers ( 55 2 2 2 55 2 A new prolonged-release formulation containing EE (20 µg)/DNG (2 mg) has recently been released and offers high contraceptive efficacy. The fluctuations of EE concentrations at steady state have been shown to be significantly lower as compared to the traditional EE (30 µg)/DNG (2 mg) formulation ( 65 max max max max A major concern in the prolonged-release EE/DNG phase 3 studies was that there were a total of 8 participants who experienced VTE ( 65 66 Currently, E 4 4 2 4 54 In terms of progestin type and VTE risk, combination with androgenic progestins such as LNG and norethindrone has been suggested to antagonize the EE-associated risk of VTE to a greater extent than combination with non-androgenic progestins such as desogestrel ( 67 70 71 74 Route of estrogen administration A cohort study of 1.6 million women reported that the adjusted relative risk (RR) of VTE in patch users was 2.3 (95% CI, 1.0-5.2) and in vaginal ring users it was 1.9 (95% CI, 1.3-2.7) compared with users of COCs containing LNG ( 75 76 A systematic review of 6 studies comparing thrombosis risk between COC versus transdermal patch users demonstrated an inconsistent VTE risk as 2 studies found a statistically significantly elevated risk among patch users (risk estimates, 2.2-2.3); one found an elevated risk that did not meet statistical significance (risk estimate, 2.0), and 4 found no increased risk ( 56 56 In summary, there is still inconsistent evidence to conclude whether or not there is an association between estrogen route and thrombosis risk. Estrogen dosage Estrogen dosage plays a role in VTE risk, as EE administration has been shown to increase thrombosis risk in a dose-dependent manner ( 77 78 79 82 Two systematic reviews and meta-analyses clearly suggested that higher estrogen doses are associated with increased thrombosis risk ( 57 58 Estrogens and Thrombosis in Menopausal HT Users Regarding HT, the number of studies examining VTE risk are fewer. The Women’s Health Initiative trial showed an increased risk of VTE in both the CEE and CEE/MPA groups, suggesting a need for alternative options for HT ( 52 53 2  Table 3 Table 3 Effect of estrogens on risk for thrombosis in women using menopausal hormone therapy; summary from systematic review. Study Reference Results Type of estrogen Smith et al. ( 83 CEE vs. E 2 Vinogradova et al. ( 84 E 2 2 2 Blondon et al. ( 85 E 2 2 2 Route of estrogen administration Rovinski et al. ( 86 Oral vs. non-oral HT: Estrogen dosage Binkowska et al. ( 87 Low dose estrogen: Timing of estrogen initiation Salpeter et al. ( 88 Reduced risk when less than 60 years old Boardman et al. ( 89 Reduced risk in younger menopausal women Type of estrogen Different estrogen and different progestin types used in menopausal HT have been reported to be associated with risk of thrombosis differently. The Women’s Health Initiative trials reported that CEE increase the risk of VTE ( 52 90 2 83 2 2 84 2 2 85 Regarding the type of progestogen used in HT several studies demonstrated different VTE risks. A cohort study with over 1 million postmenopausal women ( 91 92 93 Route of estrogen administration Most studies of VTE risk in estrogen users have been carried out using oral estrogen. However, since it was shown that transdermal E 2 86 2 94 95 A cohort study (ESTHER) ( 92 93 2 2 96 2 An updated meta-analysis of data on VTE risk among HT users provided further evidence that oral but not transdermal estrogens increase VTE risk ( 97 2 2 85 A meta-analysis by Rovinski and coworkers ( 86 Overall, the risk of VTE during HT mainly depends on how the estrogen is given. Oral HT, whether alone or with progestin, has been linked to a higher risk of VTE. In contrast, most studies show that transdermal and vaginal forms, which avoid hepatic first-pass metabolism, usually do not increase VTE risk. Among these methods, vaginal estrogen seems to have the lowest risk because it is absorbed minimally into the bloodstream. However, some recent studies have shown mixed results. Estrogen dosage Another important factor affecting the risk of VTE due to HT in postmenopausal women is the dosage. Higher doses of estrogen have consistently been associated with more significant changes in coagulation markers and a heightened thrombotic risk. A meta-analysis of 6 observational studies evaluating the association between HT dose and VTE risk showed that the VTE risk was lower for low-dose estrogen; (low-dose estrogen OR, 1.57; 95% CI, 1.48-1.68) vs. high-dose estrogen (OR, 1.91; 95% CI, 1.70-2.16; p 87 98 2 2 2 2 Timing of HT initiation For VTE, a systematic review and meta-analysis of 19 clinical trials among 40,410 postmenopausal women ( 89 For risk of arterial thrombosis, most importantly coronary heart disease (CHD), the timing of HT initiation was associated with the risk. A pooled analysis of 23 clinical trials among 39,049 menopausal women with 191,340 women-years of follow-up ( 88 89 Conclusions This review summarizes the mechanism of action, pharmacokinetics, and potency of estrogen to explain the effect of estrogen on hemostasis and risk of thrombosis. Estrogen affects changes in hemostasis that involve complex coagulation, anticoagulation and fibrinolysis cascades, and could explain the estrogen effect on thrombosis. The association of estrogen on thrombosis risk when used for contraception and menopausal HT among healthy women varies by type of estrogen, estrogen dosage, and route of estrogen administration. Author contributions FS: Writing – review & editing, Writing – original draft. IS: Writing – review & editing, Writing – original draft. SC: Writing – review & editing, Writing – original draft. JY: Writing – review & editing, Writing – original draft. FF: Writing – review & editing, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Christin-Maitre S History of oral contraceptive drugs and their use worldwide Best Pract Res Clin Endocrinol Metab 2013 27 3 12 10.1016/j.beem.2012.11.004 23384741 2 Zhang GQ Chen JL Luo Y Mathur MB Anagnostis P Nurmatov U Menopausal hormone therapy and women’s health: An umbrella review PloS Med 2021 18 e1003731 10.1371/journal.pmed.1003731 34339416 PMC8366967 3 Faubion SS Crandall CJ Davis L El Khoudary SR Hodis HN Lobo RA The 2022 Hormone Therapy Position Statement of The North American Menopause Society” Advisory Panel. The 2022 hormone therapy position statement of The North American Menopause Society Menopause 2022 29 767–94 10.1097/GME.0000000000002028 35797481 4 Stanczyk FZ Winer SA Foidart JM Archer DF Comparison of estrogenic components used for hormonal contraception Contraception 2024 130 110310 10.1016/j.contraception.2023.110310 37863464 5 Stanczyk FZ Yang JL Coelingh Bennink HJT Sriprasert I Winer S Foidart J-M Comparison of estrogens and selective estrogen receptor modulators (SERMs) used for menopausal hormone therapy Menopause 2025 32 730–57 10.1097/GME.0000000000002547 40742784 6 Gallez A Blacher S Maquoi E Konradowski E Joiret M Primac I Estetrol combined to progestogen for menopause or contraception indication is neutral on breast cancer Cancers (Basel) 2021 13 2486 10.3390/cancers13102486 34065180 PMC8160902 7 Esmon CT Basic mechanisms and pathogenesis of venous thrombosis Blood Rev 2009 23 225–9 10.1016/j.blre.2009.07.002 19683659 PMC2762278 8 Tchaikovski SN Rosing J Mechanisms of estrogen-induced venous thromboembolism Thromb Res 2010 126 5 11 10.1016/j.thromres.2010.01.045 20163835 9 Sundermann EE Maki PM Bishop JR A review of estrogen receptor alpha gene (ESR1) polymorphisms, mood, and cognition Menopause 2010 17 874–86 10.1097/gme.0b013e3181df4a19 20616674 PMC2901885 10 Zimmerman MA Budish RA Kashyap S Lindsey SH GPER-novel membrane oestrogen receptor Clin Sci (Lond) 2016 130 1005–16 10.1042/CS20160114 27154744 PMC5125080 11 Björnström L Sjöberg M Mechanisms of estrogen receptor signaling: convergence of genomic and nongenomic actions on target genes Mol Endocrinol 2005 19 833–42 10.1210/me.2004-0486 15695368 12 Bourdeau V Deschênes J Métivier R Nagai Y Nguyen D Bretschneider N Genome-wide identification of high-affinity estrogen response elements in human and mouse Mol Endocrinol 2004 18 1411–27 10.1210/me.2003-0441 15001666 13 Stanczyk FZ Vesper H Challenges in developing accurate assays for the measurement of estradiol and testosterone in postmenopausal women Menopause 2025 10.1097/GME.0000000000002613 40729212 14 Visser M Holinka CF Coelingh Bennink HJ First human exposure to exogenous single-dose oral estetrol in early postmenopausal women Climacteric 2008 11 Suppl 1 31 40 10.1080/13697130802056511 18464021 15 Orme ML Back DJ Breckenridge AM Clinical pharmacokinetics of oral contraceptive steroids Clin Pharmacokinet 1983 8 95 136 10.2165/00003088-198308020-00001 6342899 16 O’Connell MB Pharmacokinetic and pharmacologic variation between different estrogen products J Clin Pharmacol 1995 35 18S 24S 10.1002/j.1552-4604.1995.tb04143.x 8530713 17 Westphal U Steroid-protein interactions II Gross F Grumbach MM Labhart A Lipsett MB Mann T Samuels LT Zander J Monographs on endocrinology 27 Springer-Verlag Berlin 1986 198 264 18 Bikle DD The free hormone hypothesis: when, why, and how to measure the free hormone levels to assess vitamin D, thyroid, sex hormone, and cortisol status JBMR Plus 2020 5 e10418 10.1002/jbm4.10418 33553985 PMC7839820 19 Pan CC Woolever CA Bhavnani BR Transport of equine estrogens: binding of conjugated and unconjugated equine estrogens with human serum proteins J Clin Endocrinol Metab 1985 61 499 507 10.1210/jcem-61-3-499 4040531 20 Stanczyk FZ Archer DF Bhavnani BR Ethinyl estradiol and 17β-estradiol in combined oral contraceptives: pharmacokinetics, pharmacodynamics and risk assessment Contraception 2013 87 706–27 10.1016/j.contraception.2012.12.011 23375353 21 Yen SS Martin PL Burnier AM Czekala NM Greaney MO Jr Callantine MR Circulating estradiol, estrone and gonadotropin levels following the administration of orally active 17beta-estradiol in postmenopausal women J Clin Endocrinol Metab 1975 40 518–21 10.1210/jcem-40-3-518 1117058 22 Troy SM Hicks DR Parker VD Jusko WJ Rofsky HE Porter RJ Differences in pharmacokinetics and comparative bioavailability between Premarin ® ® Curr Ther Res 1994 55 359–72 10.1016/S0011-393X(05)80521-1 23 Orme ML Back DJ Ball S Interindividual variation in the metabolism of ethynylestradiol Pharmacol Ther 1989 43 251–60 10.1016/0163-7258(89)90121-6 2675136 24 Kuhnz W Blode H Zimmermann H Pharmacokinetics of exogenous natural and synthetic estrogens and antiestrogens Ottel M Schillinger E Estrogens and antiestrogens II Springer-Verlag Berlin 1999 261 322 25 Coelingh Bennink HJ Holinka CF Diczfalusy E Estetrol review: profile and potential clinical applications Climacteric 2008 11 Suppl 1 47 58 10.1080/13697130802073425 18464023 26 Bhavnani BR Nisker JA Martin J Aletebi F Watson L Milne JK Comparison of pharmacokinetics of a conjugated equine estrogen preparation (premarin) and a synthetic mixture of estrogens (C.E.S.) in postmenopausal women J Soc Gynecol Investig 2000 7 175–83 10.1016/s1071-5576(00)00049-6 10865186 27 Mashchak CA Lobo RA Dozono-Takano R Eggena P Nakamura RM Brenner PF Comparison of pharmacodynamic properties of various estrogen formulations Am J Obstet Gynecol 1982 144 511–8 10.1016/0002-9378(82)90218-6 6291391 28 Bhavnani BR Tam SP Lu X Structure activity relationships and differential interactions and functional activity of various equine estrogens mediated via estrogen receptors (ERs) ERα and ERβ Endocrinology 2008 149 4857–70 10.1210/en.2008-0304 18599548 29 Bhavnani BR Pharmacokinetics and pharmacodynamics of conjugated equine estrogens: chemistry and metabolism Proc Soc Exp Biol Med 1998 217 6 16 10.3181/00379727-217-44199 9421201 30 White T Ozel B Jain JK Stanczyk FZ Effects of transdermal and oral contraceptives on estrogen-sensitive hepatic proteins Contraception 2006 74 293–6 10.1016/j.contraception.2006.04.005 16982228 31 Sitruk-Ware RL Menard J Rad M Burggraaf J de Kam ML Tokay BA Comparison of the impact of vaginal and oral administration of combined hormonal contraceptives on hepatic proteins sensitive to estrogen Contraception 2007 75 430–7 10.1016/j.contraception.2007.01.027 17519148 32 Ropponen A Aittomäki K Vihma V Tikkanen MJ Ylikorkala O Effects of oral and transdermal estradiol administration on levels of sex hormone-binding globulin in postmenopausal women with and without a history of intrahepatic cholestasis of pregnancy J Clin Endocrinol Metab 2005 90 3431–4 10.1210/jc.2005-0352 15784702 33 Douxfils J Klipping C Duijkers I Kinet V Mawet M Maillard C Evaluation of the effect of a new oral contraceptive containing estetrol and drospirenone on hemostasis parameters Contraception 2020 102 396 402 10.1016/j.contraception.2020.08.015 32956694 34 Abou-Ismail MY Citla D Sridhar Nayak L Estrogen and thrombosis: A bench to bedside review Thromb Res 2020 192 40 51 10.1016/j.thromres.2020.05.008 32450447 PMC7341440 35 Ågren UM Anttila M Mäenpää-Liukko K Rantala ML Rautiainen H Sommer WF Effects of a monophasic combined oral contraceptive containing nomegestrol acetate and 17β-oestradiol compared with one containing levonorgestrel and ethinylestradiol on haemostasis, lipids and carbohydrate metabolism Eur J Contracept Reprod Health Care 2011 16 444–57 10.3109/13625187.2011.604450 22066891 PMC3233272 36 Gaussem P Alhenc-Gelas M Thomas JL Bachelot-Loza C Remones V Ali FD Haemostatic effects of a new combined oral contraceptive, nomegestrol acetate/17β-estradiol, compared with those of levonorgestrel/ethinyl estradiol. A double-blind, randomised study Thromb Haemost 2011 105 560–7 10.1160/TH10-05-0327 21225090 37 Junge W Mellinger U Parke S Serrani M Metabolic and haemostatic effects of estradiol valerate/dienogest, a novel oral contraceptive: a randomized, open-label, single-centre study Clin Drug Investig 2011 31 573–84 10.2165/11590220-000000000-00000 21721593 38 Morimont L Jost M Gaspard U Foidart JM Dogné JM Douxfils J Low thrombin generation in users of a contraceptive containing estetrol and drospirenone J Clin Endocrinol Metab 2022 108 135–43 10.1210/clinem/dgac511 36099501 PMC9759169 39 Morimont L Didembourg M Haguet H Modaffari É Tillier M Bouvy C Interlaboratory variability of activated protein C resistance using the ETP-based APC resistance assay Res Pract Thromb Haemost 2021 5 e12612 10.1002/rth2.12612 34761157 PMC8563922 40 Morimont L Haguet H Dogné JM Gaspard U Douxfils J Combined oral contraceptives and venous thromboembolism: review and perspective to mitigate the risk Front Endocrinol (Lausanne) 2021 12 769187 10.3389/fendo.2021.769187 34956081 PMC8697849 41 Morimont L Dogné JM Douxfils J Letter to the Editors-in-Chief in response to the article of Abou-Ismail, et al. entitled “Estrogen and thrombosis: A bench to bedside review” (Thrombosis Research 192 (2020) 40-51) Thromb Res 2020 193 221–3 10.1016/j.thromres.2020.08.006 32798963 42 Morimont L Leclercq C Didembourg M De Gottal É Carlo A Gaspard U Analytical performance of the endogenous thrombin potential-based activated protein C resistance assay on the automated ST Genesia system Res Pract Thromb Haemost 2022 6 e12684 10.1002/rth2.12684 35425874 PMC8988860 43 Douxfils J Cost-effective screening strategy to prevent venous thromboembolism in combined oral contraceptive users Front Endocrinol (Lausanne) 2025 16 1559162 10.3389/fendo.2025.1559162 40575268 PMC12197920 44 Moore GW Castoldi E Teruya J Morishita E Adcock DM Factor V Leiden-independent activated protein C resistance: Communication from the plasma coagulation inhibitors subcommittee of the International Society on Thrombosis and Haemostasis Scientific and Standardisation Committee J Thromb Haemost 2023 21 164–74 10.1016/j.jtha.2022.10.014 36695379 45 Acs N Vajo Z Miklos Z Siklosi G Paulin F Felicetta JV The effects of postmenopausal hormone replacement therapy on hemostatic variables: a meta-analysis of 46 studies Gynecol Endocrinol 2002 16 335–46 10.1080/gye.16.4.335.346 12396563 46 Blondon M van Hylckama Vlieg A Wiggins KL Harrington LB McKnight B Rice KM Differential associations of oral estradiol and conjugated equine estrogen with hemostatic biomarkers J Thromb Haemost 2014 12 879–86 10.1111/jth.12560 24628832 PMC5371691 47 Post MS Christella M Thomassen LG van der Mooren MJ van Baal WM Rosing J Effect of oral and transdermal estrogen replacement therapy on hemostatic variables associated with venous thrombosis: a randomized, placebo-controlled study in postmenopausal women Arterioscler Thromb Vasc Biol 2003 23 1116–21 10.1161/01.ATV.0000074146.36646.C8 12730085 48 Post MS van der Mooren MJ van Baal WM Blankenstein MA Merkus HM Kroeks MV Effects of low-dose oral and transdermal estrogen replacement therapy on hemostatic factors in healthy postmenopausal women: a randomized placebo-controlled study Am J Obstet Gynecol 2003 189 1221–7 10.1067/s0002-9378(03)00599-4 14634544 49 Lobo RA Bush T Carr BR Pickar JH Effects of lower doses of conjugated equine estrogens and medroxyprogesterone acetate on plasma lipids and lipoproteins, coagulation factors, and carbohydrate metabolism Fertil Steril 2001 76 13 24 10.1016/s0015-0282(01)01829-5 11438314 50 Eilertsen AL Sandvik L Mowinckel MC Andersen TO Qvigstad E Sandset PM Differential effects of conventional and low dose oral hormone therapy (HT), tibolone, and raloxifene on coagulation and fibrinolysis Thromb Res 2007 120 371–9 10.1016/j.thromres.2006.10.013 17156824 51 Cushman M Larson JC Rosendaal FR Heckbert SR Curb JD Phillips LS Biomarkers, menopausal hormone therapy and risk of venous thrombosis: The Women’s Health Initiative Res Pract Thromb Haemost 2018 2 310–9 10.1002/rth2.12100 30046733 PMC5974918 52 Rossouw JE Anderson GL Prentice RL LaCroix AZ Kooperberg C Stefanick ML Risks and benefits of estrogen plus progestin in healthy postmenopausal women: principal results From the Women’s Health Initiative randomized controlled trial JAMA 2002 288 321–33 10.1001/jama.288.3.321 12117397 53 Anderson GL Limacher M Assaf AR Bassford T Beresford SA Black H Effects of conjugated equine estrogen in postmenopausal women with hysterectomy: the Women’s Health Initiative randomized controlled trial JAMA 2004 291 1701–12 10.1001/jama.291.14.1701 15082697 54 Douxfils J Raskin L Didembourg M Donis N Dogné JM Morimont L Are natural estrogens used in contraception at lower risk of venous thromboembolism than synthetic ones? A systematic literature review and meta-analysis Front Endocrinol (Lausanne) 2024 15 1428597 10.3389/fendo.2024.1428597 39220361 PMC11362054 55 Bauerfeind A von Stockum S Boehnke T Heinemann K Venous thromboembolic risk of estradiol valerate-dienogest compared with ethinyl estradiol-levonorgestrel combined oral contraceptives Obstet Gynecol 2024 143 431–4 10.1097/AOG.0000000000005509 38227942 56 Tepper NK Dragoman MV Gaffield ME Curtis KM Nonoral combined hormonal contraceptives and thromboembolism: a systematic review Contraception 2017 95 130–9 10.1016/j.contraception.2016.10.005 27771476 PMC11025291 57 de Bastos M Stegeman BH Rosendaal FR Van Hylckama Vlieg A Helmerhorst FM Stijnen T Combined oral contraceptives: venous thrombosis Cochrane Database Syst Rev 2014 2014 CD010813 10.1002/14651858.CD010813.pub2 24590565 PMC10637279 58 Oedingen C Scholz S Razum O Systematic review and meta-analysis of the association of combined oral contraceptives on the risk of venous thromboembolism: The role of the progestogen type and estrogen dose Thromb Res 2018 165 68 78 10.1016/j.thromres.2018.03.005 29573722 59 Agency EM Assessment Report for Combined Hormonal Contraceptives Containing Medicinal Products-EMA/739865/2013 Springer London EMA 2014 60 Jensen J Bitzer J Serrani M Comparison of the pharmacologic and clinical profiles of new combined oral contraceptives containing estradiol Open Access J Contracept 2013 4 39 50 10.2147/OAJC.S50693 61 Reed S Koro C DiBello J Becker K Bauerfeind A Franke C Prospective controlled cohort study on the safety of a monophasic oral contraceptive containing nomegestrol acetate (2.5mg) and 17β-oestradiol (1.5mg) (PRO-E2 study): risk of venous and arterial thromboembolism Eur J Contracept Reprod Health Care 2021 26 439–46 10.1080/13625187.2021.1987410 34644228 62 Lidegaard Ø Skovlund CW Nielsen LH FC3–19 Thrombotic diseases in users of estradiol/dienogest oral contraceptives: a historical national follow-up study 2009 – 2011. Abstracts of Free Communications Eur J Contraception Reprod Health Care 2013 18 S64–87 10.3109/13625187.2013.771860 63 Heikinheimo O Toffol E Partonen T But A Latvala A Haukka J Systemic hormonal contraception and risk of venous thromboembolism Acta Obstet Gynecol Scand 2022 101 846–55 10.1111/aogs.14384 35633036 PMC9564731 64 Schink T Princk C Braitmaier M Haug U Use of combined oral contraceptives and risk of venous thromboembolism in young women: a nested case-control analysis using German claims data BJOG 2022 129 2107–16 10.1111/1471-0528.17268 35876787 65 Public Assessment Report Scientific Discussion Dienogest/Ethinylestradiol Exeltis (ethinylestradiol, dienogest). SE/H/2380/01/DC https://docetp.mpa.se/LMF/Dienogest_Ethinylestradiol%20Exeltis%20prolonged-release%20tablet%20ENG%20PAR_09001bee83e5028c.pdf 8/1/2025 66 Regidor PA Angulo A Colli E Effect over coagulation and fibrinolysis parameters of a prolonged release 24 + 4 daily use regime contraceptive formulation containing 2 mg dienogest/0.02 mg ethinylestradiol Gynecol Endocrinol 2025 41 2458708 10.1080/09513590.2025.2458708 39903137 67 Lidegaard Ø Nielsen LH Skovlund CW Skjeldestad FE Løkkegaard E Risk of venous thromboembolism from use of oral contraceptives containing different progestogens and oestrogen doses: Danish cohort study, 2001-9 BMJ 2011 343 d6423 10.1136/bmj.d6423 22027398 PMC3202015 68 Poulter NR Chang CL Farley TMN Meirik O Marmot MG Venous thromboembolic disease and combined oral contraceptives: results of international multicentre case-control study. World Health Organization Collaborative Study of Cardiovascular Disease and Steroid Hormone Contraception Lancet 1995 346 1575–82 10.1016/S0140-6736(95)91926-0 7500748 69 Jick H Jick SS Gurewich V Myers MW Vasilakis C Risk of idiopathic cardiovascular death and nonfatal venous thromboembolism in women using oral contraceptives with differing progestagen components Lancet 1995 346 1589–93 10.1016/s0140-6736(95)91928-7 7500750 70 Spitzer WO Lewis MA Heinemann LA Thorogood M MacRae KD Third generation oral contraceptives and risk of venous thromboembolic disorders: an international case-control study. Transnational Research Group on Oral Contraceptives and the Health of Young Women BMJ 1996 312 83–8 10.1136/bmj.312.7023.83 8555935 PMC2349742 71 Dinger JC Heinemann LA Kühl-Habich D The safety of a drospirenone-containing oral contraceptive: final results from the European Active Surveillance Study on oral contraceptives based on 142,475 women-years of observation Contraception 2007 75 344–54 10.1016/j.contraception.2006.12.019 17434015 72 Suissa S Spitzer WO Rainville B Cusson J Lewis M Heinemann L Recurrent use of newer oral contraceptives and the risk of venous thromboembolism Hum Reprod 2000 15 817–21 10.1093/humrep/15.4.817 10739826 73 Farmer RD Lawrenson RA Thompson CR Kennedy JG Hambleton IR Population-based study of risk of venous thromboembolism associated with various oral contraceptives Lancet 1997 349 83–8 10.1016/s0140-6736(96)07496-x 8996419 74 Farmer RD Todd JC Lewis MA MacRae KD Williams TJ The risks of venous thromboembolic disease among German women using oral contraceptives: a database study Contraception 1998 57 67 70 10.1016/s0010-7824(98)00002-x 9589831 75 Lidegaard O Nielsen LH Skovlund CW Løkkegaard E Venous thrombosis in users of non-oral hormonal contraception: follow-up study, Denmark 2001-10 BMJ 2012 344 e2990 10.1136/bmj.e2990 22577198 PMC3349780 76 Dinger J Möhner S Heinemann K Cardiovascular risk associated with the use of an etonogestrel-containing vaginal ring Obstet Gynecol 2013 122 800–8 10.1097/AOG.0b013e3182a5ec6b 24084537 77 Lidegaard Ø Edström B Kreiner S Oral contraceptives and venous thromboembolism: a five-year national case-control study Contraception 2002 65 187–96 10.1016/s0010-7824(01)00307-9 11929640 78 van Hylckama Vlieg A Helmerhorst FM Vandenbroucke JP Doggen CJ Rosendaal FR The venous thrombotic risk of oral contraceptives, effects of oestrogen dose and progestogen type: results of the MEGA case-control study BMJ 2009 339 b2921 10.1136/bmj.b2921 19679614 PMC2726929 79 Pomp ER le Cessie S Rosendaal FR Doggen CJ Risk of venous thrombosis: obesity and its joint effect with oral contraceptive use and prothrombotic mutations Br J Haematol 2007 139 289–96 10.1111/j.1365-2141.2007.06780.x 17897305 80 Pomp ER Rosendaal FR Doggen CJ Smoking increases the risk of venous thrombosis and acts synergistically with oral contraceptive use Am J Hematol 2008 83 97 102 10.1002/ajh.21059 17726684 81 Suissa S Blais L Spitzer WO Cusson J Lewis M Heinemann L First-time use of newer oral contraceptives and the risk of venous thromboembolism Contraception 1997 56 141–6 10.1016/s0010-7824(97)00119-4 9347203 82 Girolami A Spiezia L Girolami B Zocca N Luzzatto G Effect of age on oral contraceptive-induced venous thrombosis Clin Appl Thromb Hemost 2004 10 259–63 10.1177/107602960401000308 15247983 83 Smith NL Blondon M Wiggins KL Harrington LB van Hylckama Vlieg A Floyd JS Lower risk of cardiovascular events in postmenopausal women taking oral estradiol compared with oral conjugated equine estrogens JAMA Intern Med 2014 174 25 31 10.1001/jamainternmed.2013.11074 24081194 PMC4636198 84 Vinogradova Y Coupland C Hippisley-Cox J Use of hormone replacement therapy and risk of venous thromboembolism: nested case-control studies using the QResearch and CPRD databases BMJ 2019 364 k4810 10.1136/bmj.k4810 30626577 PMC6326068 85 Blondon M Timmons AK Baraff AJ Floyd JS Harrington LB Korpak AM Comparative venous thromboembolic safety of oral and transdermal postmenopausal hormone therapies among women Veterans Menopause 2021 28 1125–9 10.1097/GME.0000000000001823 34313612 PMC8478712 86 Rovinski D Ramos RB Fighera TM Casanova GK Spritzer PM Risk of venous thromboembolism events in postmenopausal women using oral versus non-oral hormone therapy: A systematic review and meta-analysis Thromb Res 2018 168 83 95 10.1016/j.thromres.2018.06.014 29936403 87 Bińkowska M Menopausal hormone therapy and venous thromboembolism Prz Menopauzalny 2014 13 267–72 10.5114/pm.2014.46468 26327865 PMC4520375 88 Salpeter SR Walsh JM Greyber E Salpeter EE Brief report: Coronary heart disease events associated with hormone therapy in younger and older women. A meta-analysis J Gen Intern Med 2006 21 363–6 10.1111/j.1525-1497.2006.00389.x 16686814 PMC1484709 89 Boardman HM Hartley L Eisinga A Main C Roqué i Figuls M Bonfill Cosp X Hormone therapy for preventing cardiovascular disease in post-menopausal women Cochrane Database Syst Rev 2015 2015 CD002229 10.1002/14651858.CD002229.pub4 25754617 PMC10183715 90 Cushman M Kuller LH Prentice R Rodabough RJ Psaty BM Stafford RS Estrogen plus progestin and risk of venous thrombosis JAMA 2004 292 1573–80 10.1001/jama.292.13.1573 15467059 91 Sweetland S Beral V Balkwill A Liu B Benson VS Canonico M Venous thromboembolism risk in relation to use of different types of postmenopausal hormone therapy in a large prospective study J Thromb Haemost 2012 10 2277–86 10.1111/j.1538-7836.2012.04919.x 22963114 92 Canonico M Fournier A Carcaillon L Olié V Plu-Bureau G Oger E Postmenopausal hormone therapy and risk of idiopathic venous thromboembolism: results from the E3N cohort study Arterioscler Thromb Vasc Biol 2010 30 340–5 10.1161/ATVBAHA.109.196022 19834106 93 Canonico M Oger E Plu-Bureau G Conard J Meyer G Lévesque H Hormone therapy and venous thromboembolism among postmenopausal women: impact of the route of estrogen administration and progestogens: the ESTHER study Circulation 2007 115 840–5 10.1161/CIRCULATIONAHA.106.642280 17309934 94 Scarabin PY Alhenc-Gelas M Plu-Bureau G Taisne P Agher R Aiach M Effects of oral and transdermal estrogen/progesterone regimens on blood coagulation and fibrinolysis in postmenopausal women. A randomized controlled trial Arterioscler Thromb Vasc Biol 1997 17 3071–8 10.1161/01.atv.17.11.3071 9409295 95 Vehkavaara S Silveira A Hakala-Ala-Pietilä T Virkamäki A Hovatta O Hamsten A Effects of oral and transdermal estrogen replacement therapy on markers of coagulation, fibrinolysis, inflammation and serum lipids and lipoproteins in postmenopausal women Thromb Haemost 2001 85 619–25 10.1055/s-0037-1615643 11341495 96 Scarabin PY Oger E Plu-Bureau G EStrogen and THromboEmbolism Risk Study Group Differential association of oral and transdermal oestrogen-replacement therapy with venous thromboembolism risk Lancet 2003 362 428–32 10.1016/S0140-6736(03)14066-4 12927428 97 Olié V Canonico M Scarabin PY Risk of venous thrombosis with oral versus transdermal estrogen therapy among postmenopausal women Curr Opin Hematol 2010 17 457–63 10.1097/MOH.0b013e32833c07bc 20601871 98 Sriprasert I Hodis HN Bernick B Mirkin S Mack WJ Association of oral estradiol dose/levels with coagulation measures in early/late postmenopausal women Climacteric 2020 23 273–8 10.1080/13697137.2019.1703939 31939316 PMC7853766 ",
  "metadata": {
    "Title of this paper": "Association of oral estradiol dose/levels with coagulation measures in early/late postmenopausal women",
    "Journal it was published in:": "Frontiers in Endocrinology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488444/"
  }
}