{
  "title": "Paper_336",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12483995 PMC12483995.1 12483995 12483995 41040523 10.3389/fonc.2025.1644881 1 Oncology Case Report Pleomorphic adenocarcinoma of the breast: a case report Zhang Yunkun  1  † Fan Pengchao  2  † Gao Min  3 Cong Rui  3 Wang Qimin  1 Zhao Dan  1 Zhang Jian  1 Zhang Yini  1  * Wang Lifen  1  *  1 Department of Pathology, The Second Hospital of Dalian Medical University Dalian China  2 Hospital Infection Management Department, The Second Hospital of Dalian Medical University Dalian China  3 Department of Ultrasonography, The Second Hospital of Dalian Medical University Dalian China Edited by: Abhishek Mahajan Reviewed by: Xiaobin Shang  Swarna Kanchan *Correspondence: Yini Zhang, yini_zhang2024@163.com lifen_w@163.com †These authors have contributed equally to this work 17 9 2025 2025 15 480898 1644881 11 6 2025 28 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Zhang, Fan, Gao, Cong, Wang, Zhao, Zhang, Zhang and Wang. 2025 Zhang, Fan, Gao, Cong, Wang, Zhao, Zhang, Zhang and Wang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. This article comprehensively reports a case of pleomorphic adenocarcinoma of the breast, a rare breast salivary gland-type tumor. A mass with a maximum diameter of 3.2 cm was detected through ultrasound within the upper outer quadrant in a 74-year-old woman undergoing left breast total mastectomy and sentinel lymph node exploration. Microscopically, the central part of the tumor was mostly arranged in the solid structures, some of which were cribriform and contained blue-stained secretions, while the periphery of the tumor had striated and glandular duct-like arranged structures. Some tumor cells had visible nucleoli and nuclear fission, with sparse cytoplasm. Immunohistochemistry revealed ER (-), PR (-), HER-2 (0), Bcl-2 (+), P63 (-), Calponin (-), S100 (+), E-cadherin (+), and Ki-67 (20%+). The next-generation sequencing (NGS) assay revealed a missense mutation within exon 7 in PIK3CA, which is related to the treatment of breast cancer. The patient received 1 course of oral Capecitabine treatment after surgery and was followed up for 2 years with no recurrence. breast pleomorphic adenocarcinoma PIK3CA mutation ultrasound NGS - next-generation sequencing The author(s) declare financial support was received for the research and/or publication of this article. This research was funded by Life and Health Guiding Plan Project of Dalian, 2024ZDJH01PT105. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Imaging and Image-directed Interventions Introduction Breast pleomorphic adenocarcinoma represents the uncommon salivary gland-type tumor originating from the breast. To date, only four cases have been reported worldwide. The pathological patterns and immunohistochemical findings vary slightly among cases, but the prognosis differs significantly. Pleomorphic adenocarcinoma of the salivary gland is a low-grade tumor ( 1 This paper is the first to present the large-scale gene sequencing data and identify one missense synonymous mutation within exon 7 of the phosphatidylinositol-3-kinase, catalytic subunit alpha (PIK3CA) gene in this rare disease, which is closely related to breast cancer and its dismal prognosis and treatment ( 2 Case report A 74-year-old woman found a left breast mass and ultrasound examination suggested that a hypoechoic mass measuring 3.2×2.1 cm is observed within the glandular layer. The lesion demonstrates relatively clear boundaries, regular morphology, slightly irregular margins, and heterogeneous internal echogenicity. Color Doppler shows detectable blood flow signals with a Resistive index (RI) of 0.77 (  Figures 1A–C  Figure 1D  Figure 1D Figure 1 The two-dimensional ultrasound image of the 3.2×2.1 cm hypoechoic mass has relatively clear boundaries, regular morphology, slightly irregular margins, and heterogeneous internal echogenicity. (B) (C) (D) Ultrasound images labeled A, B, and C display a medical examination of a tissue mass. Image D is a timeline of medical procedures: ultrasound on February twenty-sixth, biopsy on March sixth, mammography on March ninth, surgery on March eleventh, pathological analysis on March fifteenth, immunohistochemistry on March twentieth, and next-generation sequencing in April. The genetic mutation PIK3CA p.C420R is noted. Capecitabine treatment is scheduled from late April onward. The tumor was grayish-white, solid and tough, with poorly defined borders (  Figure 2A  Figure 2B  Figure 2C  Figure 2D Figure 2  (A) (B) (C) (D) Panel A shows a gross specimen of a small, irregular-shaped tissue on a grid. Panel B is a histological image at 100x magnification, showing a dense arrangement of purple-stained cells. Panel C, also at 100x, depicts similar cells with more connective tissue and pink regions. Panel D is a close-up at 400x, highlighting detailed cellular structures with visible nuclei and cytoplasm variations. Immunohistochemical results showed estrogen receptor (ER) (-), progesterone receptor (PR) (-), human epidermal growth factor receptor-2 (Her-2) (0), antigen KI-67 (Ki67) (20%+), B-cell lymphoma 2 (Bcl-2) (+), cell keratin 7 (CK7) (focal +), tumor protein 63 (P63) (-), Calponin (-), E-cadherin (+), S100 protein (S100) (+), mast/stem cell growth factor receptor (CD117) (partially +), and SRY-related HMG-box 10 protein (SOX-10) (+) (  Figures 3A–L Figure 3 The images of patients’ Immunohistochemical of (A) (B) (C) (D) (E) (F) (G) (H) (I) (J) (K) (L) Histological sections labeled A through L display various cellular staining patterns at 100x magnification. Each panel reveals distinctive differences in coloration and tissue structure, indicating varied expression or presence of specific markers or conditions. NGS was conducted using double stranded nucleic acids extracted in the formalin-fixed paraffin-embedded breast tissues. Moreover, targeted NGS was conducted in 425 cancer-associated genes (  Supplementary Table S1  Table 1 Table 1 Analysis of NGS data revealed the following mutations within CDS of the below-mentioned genes. Gene CDS mutation AA mutation Sequencing depth Abundance(%) COSMIC ID Functional context for mutations PIK3CA c.1258T>C p.C420R 1319 41.24 COSM757 sensitivity of PI3K inhibitors DPYD c.85C>T p.R29C 1066 100 COSM3735988 chemotherapy toxicity EPCAM c.344T>C p.M115T 1336 100 COSM3927762 poor prognosis XRCC1 c.1196A>G p.Q399R 516 99.81 COSM3756906 efficacy of chemotherapy MTHFR c.665C>T p.A222V 1157 50.13 COSM146404 chemotherapy toxicity GSTP1 c.313A>G p.I105V 793 47.79 COSM3752683 efficacy of chemotherapy NQO1 c.559C>T p.P187S 1074 100 COSM148097 poor prognosis of chemotherapy The woman in our case refused further treatment, so only 1 course of oral Capecitabine was administered after surgery, and the patient was followed up for 2 years with disease-free survival. Discussion Pleomorphic adenocarcinoma of the breast was first described by Asio li et al. in 2006. It is a very rare salivary gland-type tumor originating from the breast, with only four cases being reported so far. In addition to the breast, it has also been occasionally reported within the lung or other tissues ( 3 Breast pleomorphic adenocarcinoma occurs mostly in women aged 37–74 years, and tumor sizes may be 1.5–10 cm. From the microscopic perspective, tumor cells are mostly solidly arranged at the center, surrounded by some line-like and tubule-like structures. The tumor cells are round and small, accompanied by centered nuclei, inconspicuous nucleoli, and scanty cytoplasm. Immunohistochemistry suggests that this tumor is a triple-negative breast cancer positive for E-cadherin membrane and Bcl-2, which are all consistent with the results of this paper. It needs to be differentiated from the breast invasive lobular carcinoma, because tumor cells are more uniform in morphology and some of them are arranged in a striated pattern. The present case developed triple-negative breast cancer with E-cadherin positiveness (+), and invasive lobular carcinoma could be excluded. The central morphology of the tumor resembled the adenoid cystic carcinoma, but with no coexistence of myoepithelial and adenoepithelial patterns. In addition, P63 (-) and calponin (-) also indicated the lack of myoepithelium, which did not support the diagnosis of adenoid cystic carcinoma. This patient with triple negative breast cancer showed SOX-10 (+), S-100 (+), and CD117 (partially +). Such expression pattern is similar to that of the secretory carcinoma of the breast, and it has been suggested that CD117 can be positive in pleomorphic adenocarcinoma of the breast ( 4 5 PIK3CA gene is a proto-oncogene, which can encode p110α, the catalytic subunit of phosphatidylinositol 3-kinases (PI3Ks). It is not only related to regulating various cellular physiological processes, such as cell survival motility, adhesion and apoptosis, but also exerts an guiding effect on cell growth, shape change and motility. Studies have shown that mutations of the PIK3CA gene mainly occur when the tumor is about to invade other tissues, which may lead to the enhanced lipid kinase activity, resulting in the out-of-control growth of cancer cells ( 6 7 8 9 Four cases of pleomorphic adenocarcinoma of the breast were reported in relevant literature, among them, three were treated with radiation therapy even though no metastasis was seen in the lymph nodes following total mastectomy and sentinel lymph node exploration ( 10 11 4 Pleomorphic adenocarcinoma of the salivary gland is generally less invasive and is referred to as a low-grade pleomorphic adenocarcinoma in the salivary gland. However, some cases show aggressive biological behaviors, such as high-grade transformation, local recurrence, and distant metastasis ( 1 10 11 4 10 11 Conclusion Breast pleomorphic adenocarcinoma has a very low prevalence, which can be definitely diagnosed based on characteristic morphologic manifestations with Bcl-2+. Breast pleomorphic adenocarcinoma may be a low-grade malignant tumor and may be spared from aggressive post-operative treatment even though the PIK3CA gene mutation can be identified in patients. Because the mutant allele frequency of PIK3CA was only 41.24%, which may impact its functionality and might not necessarily affect the clinical outcome. Moreover, more cases should be accumulated to have a deeper understanding of breast pleomorphic adenocarcinoma. Acknowledgments We would thank the patient who participated in this study and provided their breast specimens. Data availability statement The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/  Supplementary Material Ethics statement The studies involving humans were approved by Ethics Committee of the Second Affiliated Hospital of Dalian Medical University. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions YKZ: Conceptualization, Methodology, Data curation, Investigation, Writing – original draft, Writing – review & editing. PF: Writing – original draft, Data curation, Conceptualization. MG: Writing – original draft, Data curation. RC: Data curation, Writing – original draft. QW: Writing – original draft, Data curation, Investigation. DZ: Writing – original draft, Data curation. JZ: Writing – original draft, Conceptualization. YNZ: Writing – original draft, Data curation, Writing – review & editing. LW: Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fonc.2025.1644881/full#supplementary-material References 1 Sebastiao A Pareja F Kumar R Brown D Silveira C Silva ED Genomic analysis of reurrences and high-grade forms of polymorphous adenocarcinoma Histopathology 2019 75 193 201 10.1111/his.13854 30843621 PMC7920221 2 Saleh N Kimberly H Updates on breast biomarkers Virchows Arch 2022 480 163–76 10.1007/s00428-022-03267-x 35029776 3 Xu H Yang M Wang J Qi H Lin X Zhang H Primary salivary gland-type polymorphous adenocarcinoma in the lung: a case report and literature review Med (Baltimore) 2022 101 e29224 10.1097/MD.0000000000029224 35550474 PMC9276132 4 Jin R Xu S A case of pleomorphic adenocarcinoma of the breast Chin J Clin Oncol 2023 50 432 10.12354/j.issn.1000-8179.2023.20230047 5 Yoon E Wang G Parkinson B Huo L Peng Y Wang J TRPS1, GATA3, and SOX10 expression in triple-negative breast carcinoma Hum Pathol 2022 125 97 107 10.1016/j.humpath.2022.04.006 35413381 6 Huang C Mandelker D Schmidt-Kittler O Samuels Y Velculescu V Kinzler K The structure of a human p110alpha/p85 alpha complex elucidates the effects of oncogenic PI3Kalpha mutations Science 2007 318 1744–8 10.1126/science.1150799 18079394 7 Asati V Sanjay K Mahapatra D Asati V Budhwani A Triggering PIK3CA mutations in PI3K/Akt/mTOR axis: exploration of newer inhibitors and rational preventive strategies Curr Pharm Des 2016 22 6039–54 10.2174/1381612822666160614000053 27296758 8 Liu X Mei W Zhang P Zeng C PIK3CA mutation as an acquired resistance driver to EGFR- TKIs in non-small cell lung cancer: Clinical challenges and opportunities Pharmacol Res 2024 202 107123 10.1016/j.phrs.2024.107123 38432445 9 Andre F Ciruelos EM Juric D Loibl S Campone M Mayer IA Alpelisib plus fulvestrant for PIK3CA-mutated, hormone receptor-positive, human epidermal growth factor receptor-2-negative advanced breast cancer: final overall survival results from SOLAR-1 Ann Oncol 2021 32 208–17 10.1016/j.annonc.2020.11.011 33246021 10 Asioli S Marucci G Ficarra G Stephens M Ellis I Eusebi V Polymorphous adenocarcinoma of the breast Rep three cases. Virchows Arch 2006 448 29 34 10.1007/s00428-005-0084-2 16220292 11 Trihia HJ Valavanis C Novkovic N Koutsodontis G Petraki M Efstathiou E Polymorphous adenocarcinoma of the breast-an exceptionally rare entity: clinicopathological description of a case and brief review Breast J 2020 26 261–4 10.1111/tbj.13623 31538375 ",
  "metadata": {
    "Title of this paper": "Polymorphous adenocarcinoma of the breast-an exceptionally rare entity: clinicopathological description of a case and brief review",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483995/"
  }
}