{
  "title": "Paper_536",
  "abstract": "pmc PLoS One PLoS One 440 plosone plos PLOS One 1932-6203 PLOS PMC12478895 PMC12478895.1 12478895 12478895 41021555 10.1371/journal.pone.0333472 PONE-D-25-26841 1 Research Article Medicine and Health Sciences Epidemiology Medical Risk Factors Cancer Risk Factors Medicine and Health Sciences Oncology Cancer Risk Factors Biology and Life Sciences Physiology Physiological Parameters Body Weight Obesity Biology and Life Sciences Anatomy Biological Tissue Connective Tissue Adipose Tissue Medicine and Health Sciences Anatomy Biological Tissue Connective Tissue Adipose Tissue Biology and Life Sciences Immunology Immune Response Inflammation Medicine and Health Sciences Immunology Immune Response Inflammation Medicine and Health Sciences Clinical Medicine Signs and Symptoms Inflammation Medicine and Health Sciences Endocrinology Endocrine Disorders Diabetes Mellitus Medicine and Health Sciences Medical Conditions Metabolic Disorders Diabetes Mellitus Medicine and Health Sciences Epidemiology Medical Risk Factors Cancer Risk Factors Aging and Cancer Medicine and Health Sciences Oncology Cancer Risk Factors Aging and Cancer Biology and Life Sciences Physiology Physiological Processes Homeostasis Medicine and Health Sciences Endocrinology Endocrine Physiology Insulin Resistance Biology and Life Sciences Physiology Endocrine Physiology Insulin Resistance Sex differences in the association between visceral adiposity index and biological aging: A cross-sectional analysis of NHANES 1999–2018 with mediation by insulin resistance Sex differences and mediating effects of insulin resistance in the association of obesity with aging https://orcid.org/0009-0007-8012-2524 Yang Jia Conceptualization Data curation Formal analysis Methodology Visualization Writing – original draft Writing – review & editing  1 https://orcid.org/0009-0002-3056-5136 Liu Haifeng Project administration Supervision Validation Writing – original draft Writing – review & editing  1 * Huang Xupeng Validation Writing – review & editing  1 Fu Zimin Writing – review & editing  1 Zhou Jie Writing – review & editing  1 Liu Tiejun Data curation Writing – review & editing  2 Zhao Weimin Writing – review & editing  3 1 College of Chinese Medicine, Changchun University of Chinese Medicine, Changchun City, Jilin Province, China 2 Department of Gastroenterology, First Affiliated Hospital to Changchun University of Chinese Medicine, Changchun City, Jilin Province, China 3 Department of Neurology, First Affiliated Hospital to Changchun University of Chinese Medicine, Changchun City, Jilin Province, China Mansoori Amin Editor  Ferdowsi University of Mashhad, IRAN, ISLAMIC REPUBLIC OF Competing Interests: * E-mail: 18447059019@163.com 29 9 2025 2025 20 9 496058 e0333472 19 5 2025 13 9 2025 29 09 2025 30 09 2025 01 10 2025 © 2025 Yang et al 2025 Yang et al https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Sex differences in the association between visceral adiposity index and biological aging: A cross-sectional analysis of NHANES 1999-2018 with mediation by insulin resistance. 20 9 29 9 2025 e0333472 e0333472 PLoS One 10.1371/journal.pone.0333472 41021555 Sex differences in the association between visceral adiposity index and biological aging: A cross-sectional analysis of NHANES 1999-2018 with mediation by insulin resistance. 20 9 29 9 2025 e0333472 e0333472 PLoS One 10.1371/journal.pone.0333472 41021555 Background Aging poses challenges global health and social care systems, with obesity potentially being associated with this process. However, sex differences and the mediating mechanisms underlying this association remain poorly understood. This study investigated sex differences in the associations of visceral adiposity index (VAI) with biological aging (BA) assessed via the Klemera-Doubal method age (KDMAge) and the risk of KDMAge acceleration (KDMAgeAccel), and explored the mediating role of the homeostasis model assessment of insulin resistance (HOMA-IR). Methods According to the National Health and Nutrition Examination Survey (1999–2018), weighted data from 19486 adults were analyzed cross-sectionally. VAI–BA associations were analyzed in the overall population and sex-specific subgroups using multivariable linear and logistic regressions, with nonlinear patterns explored via restricted cubic splines (RCSs) and threshold analyses. Mediation analyses quantified the mediating effects of HOMA-IR. Results VAI correlated positively with BA overall. However, females showed stronger associations than males for each 1-unit VAI increase with KDMAge elevation (β female male female male P P nonlinear Conclusion VAI showed a significant positive association with BA, with females demonstrating a stronger association strength and males showing a greater proportion of the association mediated through HOMA-IR. The author(s) received no specific funding for this work. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Data Availability The study dataset “DATA.xlsx (3.16 MB)” has been uploaded and is hosted on Figshare with the DOI: https://doi.org/10.6084/m9.figshare.30153427 Data Availability The study dataset “DATA.xlsx (3.16 MB)” has been uploaded and is hosted on Figshare with the DOI: https://doi.org/10.6084/m9.figshare.30153427 Introduction The global population is rapidly aging [ 1 2 3 5 6 7 8 The global overweight/obesity epidemic poses a major public health threat, with prevalence rising exponentially [ 9 10 11 12 13 Obesity accelerates aging through pathways including vascular dysfunction, insulin resistance (IR), chronic inflammation, and lifestyle factors [ 14 15 16 17 Materials and methods Data source and study population We analyzed deidentified NHANES data (1999–2018) through retrospective cross-sectional methods following program access protocols ( https://wwwn.cdc.gov/nchs/nhanes/ https://www.cdc.gov/nchs/nhanes/about/erb.html In the initial population, exclusions were performed sequentially. First, individuals aged < 20 years were excluded (n = 46235). Second, individuals who were pregnant were excluded (n = 1442). Third, those with incomplete measurements of VAI (n = 31655) and KDMAge (n = 136) were excluded, and fourth, individuals with incomplete dates of HOMA-IR were excluded (n = 223). Finally, covariates without incomplete information were excluded (n = 2139). The analytical cohort included 19486 adults (49.94% female; 50.06% male), representing a nationally representative NHANES sample across two decades. The detailed exclusion criteria and participant flow are illustrated in Fig 1 10.1371/journal.pone.0333472.g001 Fig 1 Flow chart. VAI, visceral adiposity index; NHANES, National Health and Nutrition Examination Survey; KDMAge, Klemera-Doubal method age; HOMA-IR, homeostasis model assessment of insulin resistance. Assessment of VAI and IR As a sex-specific metric integrating anthropometric and biochemical parameters, VAI was utilized to estimate visceral fat distribution. For female participants, VAI was calculated as follows: V A I f e m a l e = W C ( c m ) 3 6 . 5 8 + 1 . 8 9 × B M I ( k g / m ² ) × T G ( m m o l / L ) 0 . 8 1 × 1 . 5 2 H D L ( m m o l / L ) While the male-specific formula incorporates adjusted coefficients: V A I m a l e = W C  ( c m ) 3 9 . 6 8  +  1 . 8 8 × B M I  ( k g / m ²  ) × T G  ( m m o l / L ) 1 . 0 3 × 1 . 3 1 H D L  ( m m o l / L ) For this formula, TG and HDL were measured via standardized laboratory protocols ( https://wwwn.cdc.gov/nchs/nhanes/search/DataPage.aspx?Component=Laboratory 18 19 H O M A − I R = F P G  ( m m o l / L ) × F I N S  ( μ U / m L ) 2 2 . 5  Assessment of biological aging BA was assessed via the Klemera-Doubal method age (KDMAge) and KDMAge acceleration (KDMAgeAccel) risk [ 20 7 S1 Table 21 Assessment of covariates In this study, potential confounders were systematically adjusted using established demographic, lifestyle, and clinical covariates. Demographics comprised sex (female/male), age groups (20–39/40–59/ ≥ 60 years), race (Mexican American/non-Hispanic White/non-Hispanic Black/other), education (<high school/high school/ > high school), poverty status defined by the poverty-income ratio (PIR; < 1 indicating below the poverty threshold), and marital status (married or living with partner/divorced or separated or widowed/never married) [ 22 23 24 25 S2 Table Statistical analysis Consistent with NHANES’s survey design methodology, analyses accounted for clustering (primary sampling units), stratification variables, and individual sampling weights. Weighted estimates for the national population were derived utilizing the “survey” package in R. The baseline characteristics were stratified by sex. Continuous variables were assessed for normality using Kolmogorov-Smirnov tests; normally distributed variables were analyzed by weighted t-tests and expressed by mean ± standard errors. In contrast, weighted Mann-Whitney tests were utilized for those continuous variables that were determined to be nonnormally distributed, and the variables were reported as the median (1st quartile, 3rd quartile). Categorical variables were compared through weighted chi-square tests presented as unweighted counts with weighted proportions. Analyses of multivariable linear and logistic regression were performed across three distinct cohorts, namely, the whole population, females, and males, to explore the correlations of VAI with BA (KDMAge and KDMAgeAccel risk). Initially, sex interaction effects were evaluated through stratified analyses and multiplicative interaction terms. VAI was analyzed both continuously and categorically (quartiles) in all models. These analyses utilized three progressively adjusted models. The base model (Model 1, M 1) examined crude associations without covariate adjustment. Model 2 (M 2) was adjusted for age groups, race, educational attainment, status of marriage and poverty, along with a separate adjustment for sex, to analyze the whole population. The fully adjusted Model 3 (M 3) extended these adjustments by incorporating lifestyle and clinical covariates, including smoking, alcohol intake, M/VPA, HTN, CVD, cancer, and CKD. Odds ratio (OR) as well as regression coefficient (β) and their 95% confidence intervals (CIs) were calculated. To comprehensively characterize potential nonlinear associations between VAI and BA, we fitted restricted cubic spline (RCS) analyses across three strata: the whole population, the female subgroup, and the male subgroup [ 26 Mediation analyses, utilizing a covariate structure like Model 3, were carried out to evaluate HOMA-IR’s mediating role in the VAI–BA association. These analyses were conducted across the whole population and sex-stratified subgroups. The effects in mediation analyses were decomposed into direct, indirect, and total effects, with significance determined via nonparametric bootstrap resampling (1000 iterations; random seed = 1234). Effect estimates and 95% CIs were derived from the bootstrap distributions. The proportion of mediated effects was subsequently calculated to evaluate the relative contribution of IR to the observed associations. Sensitivity analyses were conducted using multiple combinations of covariates to assess the robustness of the observed findings. It is noteworthy that DM was excluded from the primary adjustments to circumvent overadjustment bias, given its potential mediation of the VAI–BA association ( S3 Table To address potential effect modification by demographic factors, we conducted comprehensive subgroup and interaction analyses. Given the racial/ethnic diversity of NHANES participants (Mexican American, Non-Hispanic White, Non-Hispanic Black, Other), we (a) performed race/ethnicity-stratified analyses of VAI–IR, IR–BA and VAI–BA associations; (b) and tested multiplicative interaction terms (VAI × race/ethnicity) in fully adjusted models. Additionally, since age may modify relationships between VAI and BA, we (a) assessed age interaction effects through VAI × age terms; (b) and conducted age-stratified analyses using predefined categories (20–39, 40–59, ≥ 60 years). These analyses were implemented in both the whole cohort and sex-specific subgroups using multivariable-adjusted models. This approach enhances generalizability while identifying population-specific patterns in the visceral adiposity-aging relationship. Full statistical workflows were performed in R (version 4.3.1). The Zstats 1.0 platform ( www.zstats.net 27 P Results Baseline characteristics The final cohort comprised 19486 participants (9732 females and 9754 males) after rigorous inclusion/exclusion screening. Table 1 P P P 10.1371/journal.pone.0333472.t001 Table 1 Participant baseline characteristics. Variable Whole population (n = 19486) Females (n = 9732) Males (n = 9754) P Age (years) % <0.001 20–39 6358 (37.08) 3148 (35.91) 3210 (38.26) 40–59 6527 (39.00) 3298 (38.42) 3229 (39.58) ≥ 60 6601 (23.93) 3286 (25.67) 3315 (22.15) Race % <0.001 Mexican American 3357 (7.67) 1641 (6.93) 1716 (8.43) Non-Hispanic White 8996 (70.57) 4420 (70.29) 4576 (70.85) Non-Hispanic Black 3803 (10.08) 1966 (10.96) 1837 (9.19) Other 3330 (11.68) 1705 (11.82) 1625 (11.53) Education % <0.001 <High school 5058 (17.18) 2380 (16.24) 2678 (18.13) High school 4488 (24.43) 2173 (23.87) 2315(25.01) > High school 9940 (58.39) 5179 (59.89) 4761 (56.86) Marital status % <0.001 Never married 3249 (16.56) 1554 (14.66) 1695 (18.50) Divorced/Separated/Widowed 4243 (17.84) 2762 (23.32) 1481 (12.27) Married/Living with partner 11994 (65.60) 5416 (62.03) 6578 (69.23) Poverty % 3821 (13.24) 2087 (14.98) 1734 (11.47) <0.001 Smoking status % <0.001 Never 10392 (52.29) 6110 (59.08) 4282 (45.40) Former 4988 (25.69) 1912 (21.50) 3076 (29.96) Now 4106 (22.01) 1710 (19.43) 2396 (24.65) Drinking status % 11828 (65.43) 4854 (56.95) 6974 (74.06) <0.001 M/VPA % 9391 (55.01) 4184 (50.08) 5207 (60.02) <0.001 HTN % 7883 (34.74) 3945 (34.89) 3938 (34.59) 0.727 CVD % 2124 (8.38) 893 (7.32) 1231 (9.47) <0.001 Cancer % 1789 (8.95) 950 (10.30) 839 (7.58) <0.001 CKD % 3476 (13.24) 1820 (14.85) 1656 (11.59) <0.001 DM % 3708 (13.33) 1746 (12.62) 1962 (14.05) 0.008 HDL (mmol/L) 1.31 (1.09, 1.60) 1.45 (1.22, 1.73) 1.19 (1.01, 1.40) <0.001 VAI 1.50 (0.91, 2.54) 1.49 (0.93, 2.50) 1.51 (0.89, 2.59) 0.860 HOMA-IR 2.29 (1.43, 3.92) 2.15 (1.37, 3.68) 2.44 (1.50, 4.14) <0.001 KDMAge (years) 39.03 (28.26, 52.30) 40.76 (29.82, 53.82) 37.42 (26.63, 50.65) <0.001 KDMAgeAccel (years) −5.79 (−14.42, 3.34) −4.97 (−13.03, 3.42) −6.85 (−16.20, 3.23) <0.001 KDMAgeAccel risk % 6391 (33.34) 3253 (34.46) 3138 (32.19) 0.011 Nonnormal continuous variables were assessed via weighted Mann-Whitney tests and reported with the median (1st quartile, 3rd quartile). Weighted χ² tests compared categorical variables which were represented as unweighted counts and weighted proportions. M/VPA, moderate or vigorous physical activity; HTN, hypertension; CKD, chronic kidney disease; DM, diabetes mellitus; HDL, high-density lipoprotein; VAI, visceral adiposity index; CVD, cardiovascular disease; HOMA-IR, homeostasis model assessment of insulin resistance; KDMAge, Klemera-Doubal method age; KDMAgeAccel: KDMAge acceleration. No sex-based difference in VAI was detected ( P P P P Fig 2 P S4 Table 10.1371/journal.pone.0333472.g002 Fig 2 Sex-specific associations of VAI quartiles with biological aging. Both sexes exhibited progressively elevated chronological age, KDMAge, KDMAgeAccel (A), and KDMAgeAccel risk ( B Association between VAI and biological aging Multivariable regression analysis. Multivariable linear and logistic regression analyses ( Fig 3A P 10.1371/journal.pone.0333472.g003 Fig 3 Multivariable regression analyses and sex-stratified analyses. Multivariate regression analyses ( A B Sex-stratified analyses ( Fig 3B P interaction Fig 3A P P trend Overall, VAI demonstrated significant positive associations with BA. Notably, females exhibited a 73% stronger association with KDMAge and 11% greater odds of KDMAgeAccel risk than males did per unit increase in VAI. The nonoverlapping CIs and significant interaction effects suggest that female visceral adiposity may have a significantly stronger association with BA than male visceral adiposity does. Nonlinear analysis After fully adjusted covariates, RCSs revealed significant nonlinear relationships between VAI and BA across all cohorts (whole population, females, and males; P nonlinear Fig 4 Table 2 KDMAge KDMAgeAccel KDMAge KDMAgeAccel P female male female male female male P P likelihood ratio 10.1371/journal.pone.0333472.t002 Table 2 Threshold effect analyses of the association between VAI and biological aging. KDMAge KDMAgeAccel risk β (95% CI) P OR (95% CI) P Whole population Standard linear regression 0.68 (0.60–0.75) <0.001 1.11 (1.09–1.13) <0.001 Two-piecewise linear regression K 3.41 2.54 < K 2.17 (1.89–2.45) <0.001 1.50 (1.41–1.61) <0.001 ≥ K 0.20 (0.08–0.31) <0.001 1.04 (1.02–1.06) <0.001 Likelihood ratio <0.001 <0.001 Females Standard linear regression 0.87 (0.77–0.98) <0.001 1.17 (1.14–1.20) <0.001 Two-piecewise linear regression K 3.52 2.60 < K 2.55 (2.22–2.89) <0.001 1.75 (1.59–1.93) <0.001 ≥ K 0.22 (0.04–0.39) 0.014 1.04 (1.02–1.07) 0.001 Likelihood ratio <0.001 <0.001 Males Standard linear regression 0.56 (0.45–0.67) <0.001 1.08 (1.06–1.10) <0.001 Two-piecewise linear regression K 2.60 2.51 < K 2.46 (1.89–3.04) <0.001 1.36 (1.24–1.50) <0.001 ≥ K 0.23 (0.09–0.38) 0.001 1.04 (1.02–1.06) <0.001 Likelihood ratio <0.001 <0.001 VAI, visceral adiposity index; KDMAge, Klemera-Doubal method age; KDMAgeAccel, KDMAge acceleration; CI, confidence interval; OR, odds ratio; K, inflection point. 10.1371/journal.pone.0333472.g004 Fig 4 Restricted cubic splines for the association of VAI with biological aging. Associations between VAI and KDMAge/KDMAgeAccel risk among the whole population (A, D), females (B, E), and males (C, F). Cl, confidence interval; OR, odds ratio; VAI, visceral adiposity index; KDMAge, Klemera-Doubal method age; KDMAgeAccel, KDMAge acceleration. These findings suggested that the nonlinear relationships between VAI and BA may differ between the sexes. Females may demonstrate a strong positive correlation with KDMAge across a wider VAI spectrum yet presented a greater risk of KDMAgeAccel even at VAI levels comparable to males. Conversely, males enter a period of slow increase of KDMAge at lower VAI thresholds while maintaining lower KDMAgeAccel risks at equivalent adiposity levels. Mediation analysis Association between VAI and HOMA-IR. Using different covariate adjustment strategies in multivariable linear regression analyses, all models revealed a stable positive connection linking VAI to HOMA-IR. Table 3 female male P interaction S5 Table P trend female male P trend P 10.1371/journal.pone.0333472.t003 Table 3 Association between VAI and HOMA-IR. Whole population Females Males β (95% CI) P β (95% CI) P β (95% CI) P M 1 VAI continue 0.47 (0.36–0.57) <0.001 0.54 (0.36–0.72) <0.001 0.41 (0.29–0.54) <0.001 VAI quantile Q1 0.00 (Reference) 0.00 (Reference) 0.00 (Reference) Q2 0.74 (0.57–0.91) <0.001 0.83 (0.60–1.06) <0.001 0.64 (0.40–0.87) <0.001 Q3 1.83 (1.61–2.05) <0.001 1.61 (1.46–1.77) <0.001 2.11 (1.70–2.51) <0.001 Q4 3.69 (3.38–3.99) <0.001 3.45 (3.11–3.80) <0.001 3.88 (3.44–4.32) <0.001 P <0.001 <0.001 <0.001 M 2 VAI continue 0.46 (0.35–0.56) <0.001 0.53 (0.35–0.70) <0.001 0.40 (0.28–0.53) <0.001 VAI quantile Q1 0.00 (Reference) 0.00 (Reference) 0.00 (Reference) Q2 0.73 (0.56–0.91) <0.001 0.80 (0.59–1.02) <0.001 0.60 (0.35–0.85) <0.001 Q3 1.80 (1.57–2.03) <0.001 1.55 (1.38–1.71) <0.001 2.06 (1.64–2.47) <0.001 Q4 3.62 (3.32–3.92) <0.001 3.37 (3.04–3.71) <0.001 3.82 (3.37–4.26) <0.001 P <0.001 <0.001 <0.001 M 3 VAI continue 0.42 (0.32–0.52) <0.001 0.50 (0.33–0.66) <0.001 0.36 (0.24–0.48) <0.001 VAI quantile Q1 0.00 (Reference) 0.00 (Reference) 0.00 (Reference) Q2 0.67 (0.49–0.84) <0.001 0.76 (0.56–0.95) <0.001 0.50 (0.25–0.76) <0.001 Q3 1.62 (1.38–1.86) <0.001 1.42 (1.24–1.59) <0.001 1.82 (1.38–2.26) <0.001 Q4 3.32 (3.03–3.61) <0.001 3.13 (2.82–3.45) <0.001 3.43 (2.99–3.86) <0.001 P <0.001 <0.001 <0.001 Model 1 (M 1): unadjusted Model 2 (M 2): demographic-adjusted (age, sex [whole population only], race, education, status of mariage and poverty). Model 3 (M 3): adjusted for M 2 + lifestyle behaviors (smoking, alcohol consumption, M/VPA) and comorbidities (HTN, CVD, cancer, and CKD). VAI, visceral adiposity index; CI, confidence interval; HOMA-IR, homeostasis model assessment of insulin resistance. Association between HOMA-IR and biological aging HOMA-IR was consistently and markedly positively correlated with BA (KDMAge and KDMAgeAccel risk) across all the models. Table 4 female male P trend P 10.1371/journal.pone.0333472.t004 Table 4 Association between HOMA-IR and KDMAge. Whole population Females Males β (95% CI) P β (95% CI) P β (95% CI) P M 1 HOMA-IR continue 0.72 (0.59–0.86) <0.001 0.82 (0.68–0.97) <0.001 0.69 (0.50–0.89) <0.001 HOMA-IR quantile Q1 0.00 (Reference) 0.00 (Reference) 0.00 (Reference) Q2 3.45 (2.58–4.33) <0.001 4.01 (2.96–5.05) <0.001 3.45 (2.25–4.65) <0.001 Q3 7.41 (6.45–8.37) <0.001 7.26 (6.04–8.49) <0.001 7.82 (6.59–9.04) <0.001 Q4 13.30 (12.43–14.17) <0.001 12.71 (11.65–13.76) <0.001 15.05 (13.78–16.32) <0.001 P <0.001 <0.001 <0.001 M 2 HOMA-IR continue 0.53 (0.42–0.63) <0.001 0.53 (0.41–0.66) <0.001 0.53 (0.38–0.67) <0.001 HOMA-IR quantile Q1 0.00 (Reference) 0.00 (Reference) 0.00 (Reference) Q2 2.72 (1.98–3.47) <0.001 3.35 (2.47–4.22) <0.001 2.60 (1.54–3.67) <0.001 Q3 5.43 (4.67–6.19) <0.001 5.77 (4.87–6.68) <0.001 5.24 (4.21–6.26) <0.001 Q4 9.82 (9.10–10.55) <0.001 9.20 (8.36–10.04) <0.001 11.26 (10.20–12.33) <0.001 P <0.001 <0.001 <0.001 M 3 HOMA-IR continue 0.35 (0.27–0.43) <0.001 0.35 (0.25–0.44) <0.001 0.34 (0.23–0.45) <0.001 HOMA-IR quantile Q1 0.00 (Reference) 0.00 (Reference) 0.00 (Reference) Q2 2.43 (1.71–3.14) <0.001 2.95 (2.15–3.75) <0.001 2.20 (1.15–3.25) <0.001 Q3 4.10 (3.28–4.93) <0.001 4.70 (3.82–5.58) <0.001 3.86 (2.77–4.96) <0.001 Q4 7.01 (6.28–7.73) <0.001 6.77 (6.03–7.51) <0.001 7.84 (6.74–8.93) <0.001 P <0.001 <0.001 <0.001 Model 1 (M 1): unadjusted Model 2 (M 2): demographic-adjusted (age, sex [whole population only], race, education, status of mariage and poverty). Model 3 (M 3): adjusted for M 2 + lifestyle behaviors (smoking, alcohol consumption, M/VPA) and comorbidities (HTN, CVD, cancer, and CKD). HOMA-IR, homeostasis model assessment of insulin resistance; CI, confidence interval; KDMAge, Klemera-Doubal method age. Table 5 P P interaction S5 Table 10.1371/journal.pone.0333472.t005 Table 5 Association between HOMA-IR and KDMAgeAccel risk. Whole population Females Males OR (95% CI) P OR (95% CI) P OR (95% CI) P M 1 HOMA-IR continue 1.08 (1.06–1.10) <0.001 1.08 (1.05–1.11) <0.001 1.08 (1.05–1.11) <0.001 HOMA-IR quantile Q1 1.00 (Reference) 1.00 (Reference) 1.00 (Reference) Q2 1.45 (1.26–1.67) <0.001 1.57 (1.29–1.91) <0.001 1.30 (1.06–1.59) 0.013 Q3 1.84 (1.59–2.12) <0.001 2.23 (1.85–2.68) <0.001 1.63 (1.37–1.93) <0.001 Q4 3.04 (2.68–3.45) <0.001 3.19 (2.71–3.74) <0.001 3.06 (2.61–3.58) <0.001 P <0.001 <0.001 <0.001 M 2 HOMA-IR continue 1.10 (1.08–1.12) <0.001 1.10 (1.07–1.13) <0.001 1.10 (1.07–1.13) <0.001 HOMA-IR quantile Q1 1.00 (Reference) 1.00 (Reference) 1.00 (Reference) Q2 1.52 (1.32–1.76) <0.001 1.62 (1.32–1.98) <0.001 1.42 (1.16–1.74) <0.001 Q3 2.15 (1.85–2.50) <0.001 2.49 (2.03–3.05) <0.001 2.03 (1.69–2.43) <0.001 Q4 4.01 (3.54–4.55) <0.001 4.11 (3.45–4.88) <0.001 4.18 (3.58–4.88) <0.001 P <0.001 <0.001 <0.001 M 3 HOMA-IR continue 1.07 (1.05–1.09) <0.001 1.07 (1.05–1.10) <0.001 1.07 (1.05–1.10) <0.001 HOMA-IR quantile Q1 1.00 (Reference) 1.00 (Reference) 1.00 (Reference) Q2 1.53 (1.32–1.77) <0.001 1.61 (1.31–1.97) <0.001 1.44 (1.17–1.78) <0.001 Q3 1.96 (1.67–2.30) <0.001 2.33 (1.90–2.86) <0.001 1.87 (1.53–2.28) <0.001 Q4 3.28 (2.87–3.76) <0.001 3.43 (2.87–4.09) <0.001 3.41 (2.88–4.04) <0.001 P <0.001 <0.001 <0.001 Model 1 (M 1): unadjusted Model 2 (M 2): demographic-adjusted (age, sex [whole population only], race, education, status of mariage and poverty). Model 3 (M 3): adjusted for M 2 + lifestyle behaviors (smoking, alcohol consumption, M/VPA) and comorbidities (HTN, CVD, cancer, and CKD). HOMA-IR, homeostasis model assessment of insulin resistance; KDMAge, Klemera-Doubal method age; OR, odds ratio; CI, confidence interval. Mediation effect of HOMA-IR on the association between VAI and biological aging After fully adjusted, results revealed an indirect effect of VAI on BA through HOMA-IR in both the whole population and sex-stratified subgroups ( Fig 5 S6 Table P 10.1371/journal.pone.0333472.g005 Fig 5 Mediation effects between VAI and biological aging. The Mediation effects of HOMA-IR on the associations between VAI and KDMAge/KDMAgeAccel risk among the whole population (A, D), females (B, E), and males (C, F). VAI, visceral adiposity index; KDMAge, Klemera-Doubal method age; HOMA-IR, homeostasis model assessment of insulin resistance. Notably, the absolute estimates of the indirect effect through HOMA-IR were comparable between sexes, given the overlapping CIs. The sex disparity in the mediation proportions may stem from divergent direct effects. Compared with females, male participants displayed a significantly attenuated direct effect of VAI on KDMAge (β male female male female P interaction S7 Table Sensitivity analyses Additional adjustment for DM and HDL. VAI remained robustly positively associated with BA in the whole population (β KDMAge KDMAgeAccel P P interaction KDMAge KDMAgeAccel P KDMAge KDMAgeAccel P trend S8 S9 Tables The re-evaluated RCS curves ( S1 Fig S10 Table female male female male P female male female male P Mediation analysis confirmed a significant indirect effect of HOMA-IR on the VAI–BA association across all cohorts, after additional adjustment for DM and HDL ( S11 Table P Exclusion of participants with DM. To evaluate the potential confounding effect of overt diabetes, sensitivity analyses were performed after excluding all individuals with diagnosed DM (n = 3708, 19.03%). VAI maintained robust positive associations with BA in the whole population (β KDMAge KDMAgeAccel P P interaction female male female male P female male female male P P trend S12 S13 Tables Re-evaluated RCSs ( S2 Fig S14 Table female male female male P female male P female Kmale = female male P Mediation analyses ( S15 Table P Subgroup analyses Consistent with our primary findings, stratified analyses across racial/ethnic subgroups (Mexican American, Non-Hispanic White, Non-Hispanic Black, Other) revealed persistently positive associations between VAI, BA, and IR in all populations. Three key patterns emerged: (a) VAI–HOMA-IR associations remained significantly positive across all racial/ethnic groups in the whole cohort and sex-stratified subgroups ( S16 Table P interaction P interaction P interaction S17 Table S18 Table P interaction P interaction P interaction P interaction A subsequent age-stratified analysis of all subgroups (20–39 years, 40–59 years, ≥ 60 years) demonstrated a significant positive association between VAI and BA in all three cohorts ( P S19 Table P interaction P interaction P P interaction Discussion Based on NHANES 1999–2018, this national study of 19486 (9732 females and 9754 males) American adult participants revealed significant positive associations between VAI and BA (KDMAge and KDMAgeAccel risk). Nonlinear analyses revealed a biphasic pattern: a steep acceleration of BA followed by a sustained, gradual increase as VAI increased. Significant sex differences were observed, with females demonstrating a 73% stronger VAI–KDMAge association and an 11% higher VAI–KDMAgeAccel risk compared to males. Threshold analyses further indicated that females demonstrated a strong positive correlation with KDMAge across a wider VAI spectrum (< 3.52 vs. < 2.60) and presented a greater risk of KDMAgeAccel (75% vs. 36%) even at VAI levels comparable to males. Mediation analysis revealed that HOMA-IR significantly mediates the VAI–BA link. Despite similar effect values in both sexes, HOMA-IR contributed more to males’ VAI–KDMAge (21.67% vs. 12.71%) and VAI–KDMAgeAccel risk (27.09% vs. 10.39%) compared to females. In the sensitivity analysis, our findings maintained their statistical significance following adjustments for additional variables. This study represents, as far as we know, the first investigation into how HOMA-IR mediates the associations of VAI with BA (KDMAge and KDMAgeAccel risk) across sexes. These findings elucidate sex-specific association between visceral adiposity and BA, with IR demonstrating differential mediation patterns between sexes. This study may provide potential guidance for the future development of sex-specific public health strategy of obesity and aging. Our findings, align with prior evidence, demonstrate that VAI may be a robust biomarker for BA. CVD is a well-documented driver of accelerated aging mechanisms [ 28 10 29 30 31 32 A study on cardiovascular metabolism revealed a key mechanism by which visceral adiposity drives aging [ 15 33 10 34 IR is a pathological condition in which the biological response of the body to insulin is diminished. The IR derived from visceral adiposity is one of the central mechanisms linking VAI to BA, driven by proinflammatory cytokines, mitochondrial dysfunction, lipotoxicity, endoplasmic reticulum stress, as well as epigenetic dysregulation. Visceral adipose tissue expansion triggers systemic low-grade inflammation via macrophage infiltration and the secretion of proinflammatory cytokines, which activate JNK/IKKβ kinases to suppress insulin receptor substrate phosphorylation and impair the PI3K/Akt signaling pathway, thereby disrupting glucose uptake and promoting IR [ 35 36 37 38 39 40 41 We found via mediation analysis that a higher VAI was correlated with higher HOMA-IR, whereas HOMA-IR showed a consistent positive relationship with BA. The elevation of HOMA-IR, a well-established indicator of insulin resistance, not only reflects diminished whole-body insulin sensitivity but also exhibits significant associations with oxidative stress, chronic inflammation, and metabolic toxicity. These pathological processes collectively promote genomic instability through DNA damage, telomere shortening, and p53-dependent senescent cell accumulation [ 42 43 Our data revealed that females exhibited significantly stronger VAI-related aging associations than their male counterparts. A study revealed that obese females presented shorter leukocyte telomere lengths compared to obese males [ 44 45 46 47 48 49 50 51 52 53 54 This investigation possesses multiple strengths. First, we are the first to uncover the previously unrecognized relationship binding VAI with BA (KDMAge and KDMAgeAccel risk) while identifying the mediating role of HOMA-IR in these relationships and revealing pronounced sex-specific disparities. Second, our utilization of NHANES’ probability sampling design satisfies the statistical requirements for nationwide inference. Third, the robustness of these associations was rigorously validated through multivariable-adjusted models and sensitivity analysis. Our cross-sectional results suggest that VAI could function as a sex-stratified biomarker of BA status, providing hypotheses for future longitudinal studies to validate its predictive ability for aging trajectories and to explore sex-specific prevention methods. Nevertheless, the study has four limitations. First, the primary limitation of this study stems from its cross-sectional design, which inherently precludes definitive causal inference regarding the temporal sequence between VAI and BA, particularly in elucidating sex-specific mechanisms. While our analyses revealed significant associations and mediation effects, this design cannot establish whether elevated VAI precedes and contributes to accelerated BA, or conversely, whether accelerated BA itself drives increases in VAI. Compelling evidence suggests that age-related lipid turnover decline and adipose tissue dysfunction may constitute reverse causal pathways. Specifically, longitudinal data demonstrate that adipose lipid turnover decreases by approximately 4.7% annually with aging, disrupting the dynamic equilibrium of lipid storage and clearance, even under constant caloric intake, potentially driving weight gain exceeding 20% over decades [ 55 56 57 11 58 59 60 59 57 8 Conclusions Our findings demonstrate a significant positive association between VAI and BA, with a stronger correlation observed in females and a greater proportion of this association mediated by HOMA-IR in males. These findings have critical translational implications for developing sex-tailored public health strategies to mitigate obesity-related aging risks. Clinically, our identification of nonlinear thresholds provides potential screening targets for early intervention. In females, who demonstrate heightened susceptibility to visceral adiposity impacts even at comparable adiposity levels, preventive measures should focus on midlife adiposity monitoring with intensified lifestyle interventions during critical windows like menopausal transition. In males, for whom IR mediates over 20% of the VAI–BA relationship, clinical approaches could prioritize metabolic health optimization through IR-targeted therapies alongside visceral fat reduction. Public health initiatives could incorporate these insights through: (a) development of sex-stratified VAI thresholds in aging risk algorithms; (b) tailored community-based programs (e.g., women-focused visceral fat reduction groups, men-centered metabolic health workshops); and (c) early implementation of life-course interventions in high-risk populations identified through these biomarkers. Future longitudinal studies should validate these thresholds and test whether sex-specific reductions in visceral adiposity effectively slow progression of BA, potentially informing precision prevention frameworks for aging-related health risks. Supporting information S1 Table Formulae for KDMAge. (DOCX) S2 Table Definitions of clinical covariates. (DOCX) S3 Table Mediating effects of diabetes mellitus between VAI and biological aging among the whole population. (DOCX) S4 Table Sex-specific associations of VAI quartiles with biological aging. (DOCX) S5 Table Sex interaction analysis. (DOCX) S6 Table Mediation analysis of HOMA-IR in the association between VAI and biological aging. (DOCX) S7 Table Sex interaction analysis after additional adjustment for HOMA-IR. (DOCX) S8 Table Sex interaction analysis after additional adjustment for DM and HDL. (DOCX) S9 Table Multivariate regression analysis after additional adjustment for DM and HDL. (DOCX) S10 Table Threshold effect analysis after additional adjustment for DM and HDL. (DOCX) S11 Table Mediation analysis after additional adjustment for DM and HDL. (DOCX) S12 Table Sex interaction analysis following exclusion of DM participants. (DOCX) S13 Table Multivariate regression analysis following exclusion of DM participants. (DOCX) S14 Table Threshold effect analysis following exclusion of DM participants. (DOCX) S15 Table Mediation analysis following exclusion of DM participants. (DOCX) S16 Table Subgroup analyses of VAI–HOMA-IR associations. (DOCX) S17 Table Subgroup analyses of HOMA-IR–BA associations. (DOCX) S18 Table Subgroup analyses of VAI–BA associations for different race. (DOCX) S19 Table Subgroup analyses of VAI–BA associations for different age groups. (DOCX) S1 Fig Restricted cubic splines analyses after additional adjustment for DM and HDL. (DOCX) S2 Fig Restricted cubic splines analyses following exclusion of DM participants. (DOCX) S1 Graphical abstract image. (TIF) This work is indebted to the NHANES program for providing essential public data resources. We particularly recognize the commitment of volunteers and researchers involved in data collection from 1999 to 2018. References 1 Gianfredi V Nucci D Pennisi F Maggi S Veronese N Soysal P Aging, longevity, and healthy aging: the public health approach Aging Clin Exp Res 2025 37 1 125 doi: 10.1007/s40520-025-03021-8 40244306 PMC12006278 2 Chen Y Zheng X Wang Y Liu C Shi J Liu T et al Association between dietary quality and accelerated aging: a cross-sectional study of two cohorts Food Funct 2024 15 15 7837 48 doi: 10.1039/d4fo02360a 38958644 3 Li X Cao X Zhang J Fu J Mohedaner M Danzengzhuoga D et al Accelerated aging mediates the associations of unhealthy lifestyles with cardiovascular disease, cancer, and mortality J Am Geriatr Soc 2024 72 1 181 93 doi: 10.1111/jgs.18611 37789775 PMC11078652 4 Palmer AK Gustafson B Kirkland JL Smith U Cellular senescence: at the nexus between ageing and diabetes Diabetologia 2019 62 10 1835 41 doi: 10.1007/s00125-019-4934-x 31451866 PMC6731336 5 Ageing, cellular senescence and chronic kidney disease: experimental evidence - PMC. [cited 29 Apr 2025]. https://pmc.ncbi.nlm.nih.gov/articles/PMC9035037/ 10.1097/MNH.0000000000000782 PMC9035037 35142744 6 Ferrucci L Gonzalez-Freire M Fabbri E Simonsick E Tanaka T Moore Z et al Measuring biological aging in humans: A quest Aging Cell 2020 19 2 doi: 10.1111/acel.13080 31833194 PMC6996955 7 Huang W Zhang Z Colucci M Deng L Yang M Huang X et al The mixed effect of Endocrine-Disrupting chemicals on biological age Acceleration: Unveiling the mechanism and potential intervention target Environ Int 2024 184 108447 doi: 10.1016/j.envint.2024.108447 38246039 8 Wang X Yan X Zhang J Pan S Li R Cheng L et al Associations of healthy eating patterns with biological aging: national health and nutrition examination survey (NHANES) 1999-2018 Nutr J 2024 23 1 112 doi: 10.1186/s12937-024-01017-0 39342289 PMC11439248 9 Powell-Wiley TM Poirier P Burke LE Després J-P Gordon-Larsen P Lavie CJ et al Obesity and Cardiovascular Disease: A Scientific Statement From the American Heart Association Circulation 2021 143 21 1010 doi: 10.1161/CIR.0000000000000973 33882682 PMC8493650 10 The association between visceral adiposity index and long-term all-cause mortality shows age-related disparities: a nationwide cohort study - PMC. [cited 18 Apr 2025]. https://pmc.ncbi.nlm.nih.gov/articles/PMC11969692/ 10.1186/s12889-025-22428-6 PMC11969692 40181244 11 Nunan E Wright CL Semola OA Subramanian M Balasubramanian P Lovern PC et al Obesity as a premature aging phenotype - implications for sarcopenic obesity Geroscience 2022 44 3 1393 405 doi: 10.1007/s11357-022-00567-7 35471692 PMC9213608 12 Koceva A Herman R Janez A Rakusa M Jensterle M Sex- and Gender-Related Differences in Obesity: From Pathophysiological Mechanisms to Clinical Implications Int J Mol Sci 2024 25 13 7342 doi: 10.3390/ijms25137342 39000449 PMC11242171 13 Xue M Zhang X Chen K Zheng F Wang B Lin Q et al Visceral adiposity index, premature mortality, and life expectancy in US adults Lipids Health Dis 2025 24 1 139 doi: 10.1186/s12944-025-02560-3 40234930 PMC12001622 14 Geng J Zhang X Guo Y Wen H Guo D Liang Q et al Moderate-intensity interval exercise exacerbates cardiac lipotoxicity in high-fat, high-calories diet-fed mice Nat Commun 2025 16 1 613 doi: 10.1038/s41467-025-55917-8 39800728 PMC11725574 15 The lean body mass to visceral fat mass ratio is negatively associated with cardiometabolic disorders: a cross-sectional study | Scientific Reports. [cited 22 Apr 2025]. https://www.nature.com/articles/s41598-025-88167-1 10.1038/s41598-025-88167-1 PMC11772826 39870802 16 Mediating effect of adiponectin between free fatty acid and tumor necrosis factor-α in patients with diabetes - PMC. [cited 18 Apr 2025]. https://pmc.ncbi.nlm.nih.gov/articles/PMC11183252/ 10.1038/s41387-024-00302-5 PMC11183252 38886355 17 Kolb H Kempf K Martin S Insulin and aging - a disappointing relationship Front Endocrinol (Lausanne) 2023 14 1261298 doi: 10.3389/fendo.2023.1261298 37854186 PMC10579801 18 Guo H Wan C Zhu J Jiang X Li S Association of systemic immune-inflammation index with insulin resistance and prediabetes: a cross-sectional study Front Endocrinol (Lausanne) 2024 15 1377792 doi: 10.3389/fendo.2024.1377792 38904046 PMC11188308 19 Liu X Zhang Y Chai Y Li Y Yuan J Zhang L Iron status correlates strongly to insulin resistance among U.S. adults: A nationwide population-based study Journal Title 2023 10.1210/clinem/dgae558 39189866 20 Klemera P Doubal S A new approach to the concept and computation of biological age Mech Ageing Dev 2006 127 3 240 8 doi: 10.1016/j.mad.2005.10.004 16318865 21 Pan L Jin L Association between triglyceride glucose index and biological aging in U.S adults: National Health and Nutrition Examination Survey 10.1186/s12933-025-02631-w PMC11871761 40022176 22 Yao W Wu J Wang H Jia Z Zhou Y Yang C et al Association between visceral adiposity index and prostate cancer in men aged 40 years and older: a nationwide cross-sectional study Aging Male 2025 28 1 2449341 doi: 10.1080/13685538.2024.2449341 39773306 23 Mei Y Chen Y Wang X Xu R Xu R Feng X The inverse relationship between the non-high-density lipoprotein cholesterol to high-density lipoprotein cholesterol ratio and testosterone in adult males in the United States: a cross-sectional study based on the NHANES database Front Endocrinol (Lausanne) 2025 16 1478124 doi: 10.3389/fendo.2025.1478124 40162320 PMC11949807 24 Cleland CL Hunter RF Kee F Cupples ME Sallis JF Tully MA Validity of the global physical activity questionnaire (GPAQ) in assessing levels and change in moderate-vigorous physical activity and sedentary behaviour BMC Public Health 2014 14 1255 doi: 10.1186/1471-2458-14-1255 25492375 PMC4295403 25 Missel AL Saslow LR Griauzde DH Marvicsin D Sen A Richardson CR et al Association between fasting insulin and C-reactive protein among adults without diabetes using a two-part model: NHANES 2005-2010 Diabetol Metab Syndr 2021 13 1 29 doi: 10.1186/s13098-021-00645-4 33691751 PMC7944601 26 Chen R Han J Li S Deng H Jian T Huang Z et al Interaction between sleep duration and physical activity on mortality among cancer survivors: findings from National Health and Nutrition Examination Surveys 2007-2018 Front Public Health 2025 13 1532320 doi: 10.3389/fpubh.2025.1532320 39896788 PMC11782222 27 Zhou Z Li X Xiong M He Y Cheng X Deng J et al Association between the dietary inflammatory index, bowel habits, and systemic serum inflammatory markers: insights from NHANES (2005-2010) Front Nutr 2025 12 1543715 doi: 10.3389/fnut.2025.1543715 40206947 PMC11978653 28 Luo Y Zhan X Liu Y Chen L Zhu L Cai W Predicted visceral adiposity index in relation to risk of coronary heart disease and all-cause mortality: insights from NHANES Front Endocrinol (Lausanne) 2024 14 1296398 doi: 10.3389/fendo.2023.1296398 38260165 PMC10801171 29 Tucker LA Insulin Resistance and Biological Aging: The Role of Body Mass, Waist Circumference, and Inflammation Biomed Res Int 2022 2022 2146596 doi: 10.1155/2022/2146596 35586815 PMC9110194 30 Jiang K Luan H Pu X Wang M Yin J Gong R Association Between Visceral Adiposity Index and Insulin Resistance: A Cross-Sectional Study Based on US Adults Front Endocrinol (Lausanne) 2022 13 921067 doi: 10.3389/fendo.2022.921067 35937809 PMC9353944 31 Tao X Xu X Xu Y Yang Q Yang T Zhou X et al Association between physical activity and visceral adiposity index (VAI) in U.S. population with overweight or obesity: a cross-sectional study BMC Public Health 2024 24 1 2314 doi: 10.1186/s12889-024-19810-1 39187794 PMC11348595 32 Exercise as an anti-aging intervention to avoid detrimental impact of mental fatigue. In: ScienceDaily [Internet]. [cited 3 May 2025]. https://www.sciencedaily.com/releases/2025/04/250403204559.htm 33 Hornburg D Wu S Moqri M Zhou X Contrepois K Bararpour N et al Dynamic lipidome alterations associated with human health, disease and ageing Nat Metab 2023 5 9 1578 94 doi: 10.1038/s42255-023-00880-1 37697054 PMC10513930 34 Argentieri MA Amin N Nevado-Holgado AJ Sproviero W Collister JA Keestra SM et al Integrating the environmental and genetic architectures of aging and mortality Nat Med 2025 31 3 1016 25 doi: 10.1038/s41591-024-03483-9 39972219 PMC11922759 35 mTOR Dysregulation, Insulin Resistance, and Hypertension - PMC. [cited 22 Apr 2025]. https://pmc.ncbi.nlm.nih.gov/articles/PMC11351979/ 36 The Role of JNk Signaling Pathway in Obesity -Driven Insulin Resistance - PMC. [cited 22 Apr 2025]. https://pmc.ncbi.nlm.nih.gov/articles/PMC7196768/ 37 Jheng H-F Tsai P-J Guo S-M Kuo L-H Chang C-S Su I-J et al Mitochondrial fission contributes to mitochondrial dysfunction and insulin resistance in skeletal muscle Mol Cell Biol 2012 32 2 309 19 doi: 10.1128/MCB.05603-11 22083962 PMC3255771 38 Obesity causes mitochondrial fragmentation and dysfunction in white adipocytes due to RalA activation | Nature Metabolism. [cited 22 Apr 2025]. https://www.nature.com/articles/s42255-024-00978-0 10.1038/s42255-024-00978-0 PMC10896723 38286821 39 Ma K Zhang Y Zhao J Zhou L Li M Endoplasmic reticulum stress: bridging inflammation and obesity-associated adipose tissue Front Immunol 2024 15 1381227 doi: 10.3389/fimmu.2024.1381227 38638434 PMC11024263 40 Wondmkun YT Obesity, Insulin Resistance, and Type 2 Diabetes: Associations and Therapeutic Implications Diabetes Metab Syndr Obes 2020 13 3611 6 doi: 10.2147/DMSO.S275898 33116712 PMC7553667 41 Obesity-related hypoxia via miR-128 decreases insulin-receptor expression in human and mouse adipose tissue promoting systemic insulin resistance - PubMed. [cited 22 Apr 2025]. https://pubmed.ncbi.nlm.nih.gov/32739259/ 10.1016/j.ebiom.2020.102912 PMC7502675 32739259 42 Telomere dysfunction in ageing and age-related diseases - PubMed. [cited 22 Apr 2025]. https://pubmed.ncbi.nlm.nih.gov/35165420/ 10.1038/s41556-022-00842-x PMC8985209 35165420 43 Zhang H Li J Yu Y Ren J Liu Q Bao Z et al Nuclear lamina erosion-induced resurrection of endogenous retroviruses underlies neuronal aging Cell Rep 2023 42 11 113396 doi: 10.1016/j.celrep.2023.113396 37910499 44 Salvestrini V Sell C Lorenzini A Obesity May Accelerate the Aging Process Front Endocrinol (Lausanne) 2019 10 266 doi: 10.3389/fendo.2019.00266 31130916 PMC6509231 45 Cooke PS Nanjappa MK Ko C Prins GS Hess RA Estrogens in Male Physiology Physiol Rev 2017 97 3 995 1043 doi: 10.1152/physrev.00018.2016 28539434 PMC6151497 46 Mair KM Gaw R MacLean MR Obesity, estrogens and adipose tissue dysfunction - implications for pulmonary arterial hypertension Pulm Circ 2020 10 3 2045894020952019 doi: 10.1177/2045894020952023 32999709 PMC7506791 47 Rydén M Gao H Arner P Influence of ageing and menstrual status on subcutaneous fat cell lipolysis J Clin Endocrinol Metab 2023 47 10.1210/clinem/dgz245 31784744 48 Ostinelli G Laforest S Denham SG Gauthier M-F Drolet-Labelle V Scott E et al Increased Adipose Tissue Indices of Androgen Catabolism and Aromatization in Women With Metabolic Dysfunction J Clin Endocrinol Metab 2022 107 8 42 doi: 10.1210/clinem/dgac261 35511873 PMC9282357 49 Hu Y Hai J Ti Y Kong B Yao G Zhao Y et al Adipose ZFP36 protects against diet-induced obesity and insulin resistance Metabolism 2025 164 156131 doi: 10.1016/j.metabol.2024.156131 39761791 50 Gender medicine: effects of sex and gender on cardiovascular disease manifestation and outcomes | Nature Reviews Cardiology. [cited 24 Apr 2025]. https://www.nature.com/articles/s41569-022-00797-4 10.1038/s41569-022-00797-4 PMC9628527 36316574 51 Cao J Liu S Xie H Zhang Y Zeng Y The relationship between the visceral adiposity index and carotid atherosclerosis in different genders and age groups Saudi Med J 2022 43 2 169 76 doi: 10.15537/smj.2022.43.2.20210824 35110342 PMC9127914 52 Gender differences in midlife to later-life cumulative burden and variability of obesity measures and risk of all-cause and cause-specific mortality | International Journal of Obesity. [cited 24 Apr 2025]. https://www.nature.com/articles/s41366-023-01440-z 10.1038/s41366-023-01440-z 38114811 53 Derry HM Padin AC Kuo JL Hughes S Kiecolt-Glaser JK Sex Differences in Depression: Does Inflammation Play a Role? Curr Psychiatry Rep 2015 17 10 78 doi: 10.1007/s11920-015-0618-5 26272539 PMC4869519 54 Xu C Wang J-N Song Z Deng H-Y Li C-C Mediating role of accelerated aging in the association between depression and mortality risk: findings from NHANES Aging Clin Exp Res 2024 36 1 202 doi: 10.1007/s40520-024-02854-z 39368008 PMC11455804 55 Arner P Bernard S Appelsved L Fu K-Y Andersson DP Salehpour M et al Adipose lipid turnover and long-term changes in body weight Nat Med 2019 25 9 1385 9 doi: 10.1038/s41591-019-0565-5 31501613 56 Wang G Li G Song A Zhao Y Yu J Wang Y et al Distinct adipose progenitor cells emerging with age drive active adipogenesis Science 2025 388 6745 doi: 10.1126/science.adj0430 40273250 PMC12445215 57 Nguyen TT Corvera S Adipose tissue as a linchpin of organismal ageing Nat Metab 2024 6 5 793 807 doi: 10.1038/s42255-024-01046-3 38783156 PMC11238912 58 Winters-Van Eekelen E Van Der Velde JHPM Boone SC Westgate K Brage S Lamb HJ et al Objectively Measured Physical Activity and Body Fatness: Associations with Total Body Fat, Visceral Fat, and Liver Fat Med Sci Sports Exerc 2021 53 11 2309 17 doi: 10.1249/MSS.0000000000002712 34081059 PMC7611840 59 Vecchiatto B Castro TL Ferreira NJR Evangelista FS Healthy adipose tissue after menopause: contribution of balanced diet and physical exercise Explor Endocr Metab Dis 2025 doi: 10.37349/eemd.2025.101424 60 Palmer AK Jensen MD Metabolic changes in aging humans: current evidence and therapeutic strategies J Clin Invest 2022 132 16 doi: 10.1172/JCI158451 35968789 PMC9374375 10.1371/journal.pone.0333472.r001 Decision Letter 0 Mansoori Amin Academic Editor © 2025 Amin Mansoori 2025 Amin Mansoori https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 0  1 Jul 2025 Dear Dr. Liu, Thank you for submitting your manuscript to PLOS ONE. After careful consideration, we feel that it has merit but does not fully meet PLOS ONE’s publication criteria as it currently stands. Therefore, we invite you to submit a revised version of the manuscript that addresses the points raised during the review process. Please submit your revised manuscript by Aug 15 2025 11:59PM. If you will need more time than this to complete your revisions, please reply to this message or contact the journal office at plosone@plos.org https://www.editorialmanager.com/pone/ A rebuttal letter that responds to each point raised by the academic editor and reviewer(s). You should upload this letter as a separate file labeled 'Response to Reviewers'. A marked-up copy of your manuscript that highlights changes made to the original version. You should upload this as a separate file labeled 'Revised Manuscript with Track Changes'. An unmarked version of your revised paper without tracked changes. You should upload this as a separate file labeled 'Manuscript'. If applicable, we recommend that you deposit your laboratory protocols in protocols.io to enhance the reproducibility of your results. Protocols.io assigns your protocol its own identifier (DOI) so that it can be cited independently in the future. For instructions see: https://journals.plos.org/plosone/s/submission-guidelines#loc-laboratory-protocols https://plos.org/protocols?utm_medium=editorial-email&utm_source=authorletters&utm_campaign=protocols We look forward to receiving your revised manuscript. Kind regards, Amin Mansoori Academic Editor PLOS ONE Journal Requirements: When submitting your revision, we need you to address these additional requirements. 1. Please ensure that your manuscript meets PLOS ONE's style requirements, including those for file naming. The PLOS ONE style templates can be found at https://journals.plos.org/plosone/s/file?id=wjVg/PLOSOne_formatting_sample_main_body.pdf https://journals.plos.org/plosone/s/file?id=ba62/PLOSOne_formatting_sample_title_authors_affiliations.pdf 2. Please review your reference list to ensure that it is complete and correct. If you have cited papers that have been retracted, please include the rationale for doing so in the manuscript text, or remove these references and replace them with relevant current references. Any changes to the reference list should be mentioned in the rebuttal letter that accompanies your revised manuscript. If you need to cite a retracted article, indicate the article’s retracted status in the References list and also include a citation and full reference for the retraction notice. Additional Editor Comments: Dear Authors, Thank you for submitting your manuscript to PLOS One. It has now been reviewed by two independent experts. While they acknowledge that your work presents novel and interesting contributions suitable for publication, they have identified several areas that require clarification and improvement. I kindly ask you to carefully revise the manuscript, addressing all the reviewers’ comments and concerns in detail. Please submit a revised version along with a point-by-point response to the reviewers’ feedback. Should you have any questions, please do not hesitate to contact me. Best regards, Amin Mansoori [Note: HTML markup is below. Please do not edit.] Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author 1. Is the manuscript technically sound, and do the data support the conclusions? Reviewer #1: Yes Reviewer #2: Yes ********** 2. Has the statistical analysis been performed appropriately and rigorously? -->?> Reviewer #1: Yes Reviewer #2: Yes ********** 3. Have the authors made all data underlying the findings in their manuscript fully available??> The PLOS Data policy Reviewer #1: Yes Reviewer #2: Yes ********** 4. Is the manuscript presented in an intelligible fashion and written in standard English??> Reviewer #1: Yes Reviewer #2: Yes ********** Reviewer #1: Main strengths of the study: • Relevant and under-explored study topic • Introduction clearly setting out the theme and objectives of the study • Methodology with a reference population representative of the U.S. population • Well-conducted multivariate statistical analysis • Results well presented in the form of tables of figures • Detailed discussion contains strengths and limitations Suggestions: • Add in the title the target population: Cross sectional analysis of NHANES (1999-2018) data Question: • Why did you use VAI rather than NHANES DXA data on Visceral adipose tissue “VAT” quantity (mass, volume, or surface area) as a more direct measure of visceral adiposity ? Reviewer #2: The original article entitled “Sex differences in the association between visceral adiposity index and biological aging: a mediation analysis of insulin resistance” was well-written and easy to understand. The study investigated the association between visceral adiposity index and biological aging, with insulin resistance playing a mediating role in homeostasis between sexes. The sample size was large, and the authors made efforts to provide guidelines for obesity and aging. However, I have some suggestion to improve the paper. The introduction was well-written, but too long. I suggest summarizing it. The resolution of the Figures is low It would be better to define clinical features, including HTN, DM, CKD, CVD and Cancer. ********** what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: No Reviewer #2: No ********** [NOTE: If reviewer comments were submitted as an attachment file, they will be attached to this email and accessible via the submission site. Please log into your account, locate the manuscript record, and check for the action link \"View Attachments\". If this link does not appear, there are no attachment files.] While revising your submission, please upload your figure files to the Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool, https://pacev2.apexcovantage.com/ figures@plos.org Attachment Submitted filename: The original article entitled.docx 10.1371/journal.pone.0333472.r002 Author response to Decision Letter 1 Submission Version 1  9 Jul 2025 Dear PLOS ONE Editorial Team, Thank you for giving us the opportunity to submit a revised draft of our manuscript titled “Sex differences in the association between visceral adiposity index and biological aging: a mediation analysis of insulin resistance” [PONE-D-25-26841R1] to PLOS One. We appreciate the time and effort that you and the reviewers have dedicated to providing valuable feedback on our manuscript. We are grateful to the reviewers for their insightful comments, which have improved the paper. We have incorporated changes that reflect all the suggestions and concerns provided by the reviewers. The reviewer comments are laid out below in italicized font and specific concerns have been numbered. Our replies appear in blue font and key points are emphasized in red. All corresponding revisions in the manuscript are marked in yellow. Furthermore, we would like to show the details as follows: Responses to Comments of Reviewer #1: Comments 1: Add in the title the target population: Cross sectional analysis of NHANES (1999-2018) data. Response: We think this is an excellent suggestion. We have added the target population and database information to the title as suggested. The revised title now reads: \"Sex differences in the association between visceral adiposity index and biological aging: a cross-sectional analysis of NHANES 1999–2018 with mediation by insulin resistance\" Comments 2: Why did you use VAI rather than NHANES DXA data on Visceral adipose tissue “VAT” quantity (mass, volume, or surface area) as a more direct measure of visceral adiposity? Response: We sincerely appreciate the reviewer's insightful query regarding our selection of the visceral adiposity index (VAI) over DXA-derived visceral adipose tissue (VAT) quantification. We acknowledge the well-established value of VAT as a more direct measure of visceral adiposity, evidenced by its documented associations with diabetes mellitus [1], systemic inflammation [2], and cognitive function [3]. However, our methodological choice of VAI was based on three key considerations: Clinical applicability and feasibility VAI integrates routinely measured clinical parameters (waist circumference, BMI, triglycerides, HDL) into a sex-specific formula. This allows broader implementation in resource-limited settings where DXA is unavailable, aligning with our goal of developing accessible biomarkers for public health use [4]. DXA, while providing precise anatomical VAT quantification, requires specialized equipment and expertise, limiting its scalability in population-based screening. Comprehensive pathophysiological assessment Unlike VAT mass/volume/area, which solely reflects morphological adiposity, VAI simultaneously captures both visceral fat accumulation and associated metabolic dysfunction (dyslipidemia, insulin resistance) [5]. This dual capacity is critical because metabolic dysregulation, not fat mass alone, drives obesity-related aging mechanisms [6,7]. Our mediation results further validate VAI’s ability to reflect IR-mediated biological aging pathways. Data availability and cohort integrity It is important to note that DXA-derived VAT data in NHANES were systematically collected from 2011 onward. Restricting analyses to DXA-available cycles (2011–2018) would reduce the sample size by more than 60% and disproportionately exclude older adults (who are underrepresented in DXA subsamples due to the exclusion criteria of 60 years or older). This would compromise the statistical power of sex-stratified mediation analyses and introduce selection bias. VAI facilitated the optimal utilization of 20-year nationally representative data (1999–2018). To further address your concerns about VAT, we performed the following analyses using direct measures of VAT, including mass, volume, and area, to further validate the association between visceral adiposity and biological aging (KDMAge and KDMAgeAccel risk). The results are consistent with our primary results concerning the VAI–biological aging association. This consistency suggests that both VAT and VAI serve as outstanding indicators for evaluating the link between visceral adiposity and advanced biological aging. Nevertheless, based on the three key considerations outlined previously, we maintained VAI as the primary measure of visceral adiposity for this study. We would like to once again express our gratitude to the reviewer for the attention to this important methodological dimension, which indeed highlights valuable directions for future research in this field. The specific analysis process is as follows: Following full adjustment for covariates, multivariable linear and logistic regression analyses demonstrated significant positive correlations between VAT and measures of biological aging (Table 1). Furthermore, restricted cubic splines revealed significant nonlinear relationships between VAT and biological aging (Fig. 1). Please refer to \"Response to Reviewers.docx\" for details. References: 1.Tripathi H, Singh A, Farheen, Prakash B, Dubey DK, Sethi P, Jadon RS, Ranjan P, Vikram NK. The Metabolic Score for Visceral Fat (METS-VF) as a predictor of diabetes mellitus: Evidence from the 2011-2018 NHANES study. PLoS One. 2025 Feb 11;20(2):e0317913. doi: 10.1371/journal.pone.0317913. PMID: 39932909; PMCID: PMC11813123. 2.Liao Y, Zhou K, Lin B, Deng S, Weng B, Pan L. Associations between systemic immune-inflammatory index and visceral adipose tissue area: results of a national survey. Front Nutr. 2025 Jan 16;11:1517186. doi: 10.3389/fnut.2024.1517186. PMID: 39885869; PMCID: PMC11780491. 3.Cheng M, Meng Y, Song Z, Zhang L, Zeng Y, Zhang D, Li S. The Association Between Metabolic Score for Visceral Fat and Cognitive Function Among Older Adults in the United States. Nutrients. 2025 Jan 10;17(2):236. doi: 10.3390/nu17020236. PMID: 39861366; PMCID: PMC11768000. 4.Xue M, Zhang X, Chen K, Zheng F, Wang B, Lin Q, Zhang Z, Dong X, Niu W. Visceral adiposity index, premature mortality, and life expectancy in US adults. Lipids Health Dis. 2025 Apr 15;24(1):139. doi: 10.1186/s12944-025-02560-3. PMID: 40234930; PMCID: PMC12001622. 5.Jiang K, Luan H, Pu X, Wang M, Yin J, Gong R. Association Between Visceral Adiposity Index and Insulin Resistance: A Cross-Sectional Study Based on US Adults. Front Endocrinol (Lausanne). 2022 Jul 22;13:921067. doi: 10.3389/fendo.2022.921067. PMID: 35937809; PMCID: PMC9353944. 6.Geng J, Zhang X, Guo Y, Wen H, Guo D, Liang Q, Pu S, Wang Y, Liu M, Li Z, Hu W, Yang X, Chang P, Hu L, Li Y. Moderate-intensity interval exercise exacerbates cardiac lipotoxicity in high-fat, high-calories diet-fed mice. Nat Commun. 2025 Jan 12;16(1):613. doi: 10.1038/s41467-025-55917-8. PMID: 39800728; PMCID: PMC11725574. 7.Xia Z, Shi S, Ma X, Li F, Li X, Gaisano HY, Zhao M, Li Y, He Y, Jiang J. Mediating effect of adiponectin between free fatty acid and tumor necrosis factor-α in patients with diabetes. Nutr Diabetes. 2024 Jun 17;14(1):45. doi: 10.1038/s41387-024-00302-5. PMID: 38886355; PMCID: PMC11183252. Responses to Comments of Reviewer #2: Comments 1: The introduction was well-written, but too long. I suggest summarizing it. Response: The reviewer's positive appraisal of the Introduction, characterizing it as \"well-written,\" is deeply appreciated. In response to the suggestion to improve conciseness, we have rigorously condensed this section from 734 to 427 words (a 42% reduction). The revised version retains all critical scientific elements while enabling readers to efficiently grasp: (i) the research background, (ii) knowledge gaps, (iii) methodological framework, and (iv) clinical implications. The modified Introduction is presented below: “The global population is rapidly aging [1]. Epidemiological projections indicate that individuals aged ≥ 60 years will constitute 16% of the global population by 2030, rising to 22% (2.1 billion) by mid-century [2]. Aging is robustly linked to increased risks of multiple chronic conditions, including diabetes mellitus (DM), cardiovascular disease (CVD), hypertension (HTN), chronic kidney disease (CKD), and cancer [3–5]. Given the profound impact of these conditions on healthcare burdens and age-related mortality, accurately assessing biological aging (BA) is crucial for developing interventions to decelerate it. Biological age, a core indicator of physiological decline, provides superior predictive value over chronological age [6]. The Klemera-Doubal method (KDMAge) quantifies BA by integrating multisystem biomarkers (e.g., metabolic, inflammatory, cardiovascular) [7]. Unlike single biomarkers, KDMAge captures individual heterogeneity in aging trajectories through multi-system interactions, serving as an effective predictor of disease risk, functional decline, and mortality [8]. The global overweight/obesity epidemic poses a major public health threat, with prevalence rising exponentially [9]. Obesity independently predicts CVD, HTN, DM, and cancer, ranking as the second leading modifiable mortality risk factor after tobacco in Western populations [10]. In the United States, 70% of adults and 19% of adolescents are affected [11]. Significant sex-based differences exist: females show higher obesity prevalence (18% vs. 14% in males in 2020) with projections indicating persistent disparities (27% vs. 23% by 2035). Adipose distribution also differs markedly, with gluteofemoral predominance in females versus abdominal in males, influenced by biological (e.g., sex hormones) and sociocultural factors [12]. Given these health implications, effective obesity assessment is critical. While body mass index (BMI) and waist circumference (WC) provide unidimensional measures, the visceral adiposity index (VAI) offers a sex-specific metric integrating morphological (BMI, WC) and biochemical markers (triglycerides, HDL). This enables simultaneous evaluation of visceral fat accumulation and metabolic dysfunction, establishing VAI as a validated clinical marker for visceral obesity [13]. Obesity accelerates aging through pathways including vascular dysfunction, insulin resistance (IR), chronic inflammation, and lifestyle factors [14,15]. Of these, IR—clinically measured by homeostatic model assessment (HOMA-IR)—is particularly critical. Obesity impairs insulin signaling via chronic inflammation, lipotoxicity, and metabolic dysregulation [16], while the synergy of obesity and IR promotes age-related comorbidities (e.g., DM, CVD) that exacerbate systemic frailty [17]. However, sex-specific mechanisms mediating the obesity–aging association remain poorly understood, particularly regarding visceral adiposity and IR pathways. Leveraging the National Health and Nutrition Examination Survey (NHANES), the purpose of our investigation was to systematically examine sex-specific associations between VAI and BA while quantifying the mediating role of IR, thereby offering novel insights to inform public health strategies aimed at mitigating obesity-related aging risks.” Comments 2: The resolution of the Figures is low. Response: Thanks for the feedback on the figure resolution. We agree that high-resolution figures are essential for clarity and meeting journal standards. To address this point comprehensively, we have meticulously processed all figures using the PLOS-specific Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool ( https://pacev2.apexcovantage.com/ Comments 3: It would be better to define clinical features, including HTN, DM, CKD, CVD and Cancer. Response: We are grateful to the reviewer for their insightful suggestion to elucidate the definitions of clinical covariates. In direct response, the Materials and Methods–Assessment of covariates section has been revised to include standardized diagnostic criteria based on the previous studies (lines 192–200 in the Revised Manuscript with Track Changes): HTN is defined as systolic blood pressure > 140 mmHg or diastolic blood pressure > 90 mmHg or physician diagnosis; CVD encompasses congestive heart failure, coronary artery disease, myocardial infarction, angina pectoris, or stroke; DM requires glycated hemoglobin ≥ 6.5%, fasting glucose ≥ 126 mg/dL, 2-h oral glucose tolerance test ≥ 200 mg/dL, antidiabetic use, or physician confirmation; CKD is identified by estimated glomerular filtration rate < 60 mL/min/1.73m² (CKD-EPI equation) or urine albumin-creatinine ratio > 30 mg/g; cancer is based on self-reported physician-diagnosed malignancy. S2 Table comprehensively documents disease definitions with supporting references, enhancing methodological transparency without sacrificing conciseness. Attachment Submitted filename: Response to Reviewers.docx 10.1371/journal.pone.0333472.r003 Decision Letter 1 Mansoori Amin Academic Editor © 2025 Amin Mansoori 2025 Amin Mansoori https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 1  8 Aug 2025 Dear Dr. Liu, plosone@plos.org https://www.editorialmanager.com/pone/ A rebuttal letter that responds to each point raised by the academic editor and reviewer(s). You should upload this letter as a separate file labeled 'Response to Reviewers'. A marked-up copy of your manuscript that highlights changes made to the original version. You should upload this as a separate file labeled 'Revised Manuscript with Track Changes'. An unmarked version of your revised paper without tracked changes. You should upload this as a separate file labeled 'Manuscript'. If you would like to make changes to your financial disclosure, please include your updated statement in your cover letter. Guidelines for resubmitting your figure files are available below the reviewer comments at the end of this letter. If applicable, we recommend that you deposit your laboratory protocols in protocols.io to enhance the reproducibility of your results. Protocols.io assigns your protocol its own identifier (DOI) so that it can be cited independently in the future. For instructions see: https://journals.plos.org/plosone/s/submission-guidelines#loc-laboratory-protocols https://plos.org/protocols?utm_medium=editorial-email&utm_source=authorletters&utm_campaign=protocols We look forward to receiving your revised manuscript. Kind regards, Amin Mansoori Academic Editor PLOS ONE Journal Requirements: 1. If the reviewer comments include a recommendation to cite specific previously published works, please review and evaluate these publications to determine whether they are relevant and should be cited. There is no requirement to cite these works unless the editor has indicated otherwise. Additional Editor Comments: Dear Author, Thank you for submitting your revised manuscript. Upon evaluation, I find that the paper has improved significantly; however, the reviewer has provided constructive comments to further enhance the manuscript. I encourage you to carefully address these suggestions and submit an updated version for final consideration. We appreciate your efforts and look forward to receiving your revised manuscript. Best regards, [Note: HTML markup is below. Please do not edit.] Reviewer's Responses to Questions  Comments to the Author Reviewer #1: All comments have been addressed Reviewer #3: (No Response) ********** 2. Is the manuscript technically sound, and do the data support the conclusions??> Reviewer #1: Yes Reviewer #3: Partly ********** 3. Has the statistical analysis been performed appropriately and rigorously? -->?> Reviewer #1: Yes Reviewer #3: Yes ********** 4. Have the authors made all data underlying the findings in their manuscript fully available??> The PLOS Data policy Reviewer #1: Yes Reviewer #3: Yes ********** 5. Is the manuscript presented in an intelligible fashion and written in standard English??> Reviewer #1: Yes Reviewer #3: Yes ********** Reviewer #1: (No Response) Reviewer #3: Dear Author, I read your manuscript carefully. Your work is valuable but I have several comments to improve it: 1- Given the diverse racial/ethnic composition of the NHANES sample (e.g., Mexican American, Non-Hispanic White, Non-Hispanic Black), it would be valuable to perform subgroup or sensitivity analyses to examine whether the observed associations between VAI, biological aging, and insulin resistance differ across racial/ethnic groups. This could enhance the generalizability and interpretation of your findings. 2- While the cross-sectional design limitation is acknowledged, I recommend elaborating on its implications, particularly regarding causal inference and temporality. Discussing how reverse causation might influence the observed relationships would improve the depth of the discussion. 3- Age may act as a potential effect modifier in the relationship between VAI and biological aging. Please consider testing for an interaction between age and VAI, and if significant, stratifying the analyses accordingly. This may provide important age-related insights into the adiposity-aging relationship. 4- Given the strong association between diabetes and both insulin resistance and biological aging, a sensitivity analysis excluding individuals with diagnosed diabetes could help evaluate whether the observed associations are independent of overt diabetic status. 5-The conclusion could be expanded to highlight the potential clinical and public health implications of your findings. For example, discussing how sex-specific strategies targeting visceral adiposity may mitigate aging-related health risks would underscore the translational value of the study. Best Regards, ********** what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: No Reviewer #3: No ********** [NOTE: If reviewer comments were submitted as an attachment file, they will be attached to this email and accessible via the submission site. Please log into your account, locate the manuscript record, and check for the action link \"View Attachments\". If this link does not appear, there are no attachment files.] While revising your submission, please upload your figure files to the Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool, https://pacev2.apexcovantage.com/ figures@plos.org 10.1371/journal.pone.0333472.r004 Author response to Decision Letter 2 Submission Version 2  10 Aug 2025 Response Letter Dear PLOS ONE Editorial Team, We sincerely appreciate the opportunity to submit this revised manuscript entitled ”Sex differences in the association between visceral adiposity index and biological aging: a cross-sectional analysis of NHANES 1999–2018 with mediation by insulin resistance” (PONE-D-25-26841R1) to PLOS ONE. We extend our deepest gratitude to the editorial team and reviewers for their substantial time investment and insightful critiques, which have significantly strengthened our work. All reviewer comments have been meticulously addressed through comprehensive revisions. Below, we present the reviewers' comments in italics, followed by our point-by-point responses in blue text (with key modifications highlighted in red). Supporting documentation appears in standard font, while manuscript changes are tracked using yellow highlighting. The detailed responses follow this section: Responses to Comments of Reviewer #3: Comments 1: Given the diverse racial/ethnic composition of the NHANES sample (e.g., Mexican American, Non-Hispanic White, Non-Hispanic Black), it would be valuable to perform subgroup or sensitivity analyses to examine whether the observed associations between VAI, biological aging, and insulin resistance differ across racial/ethnic groups. This could enhance the generalizability and interpretation of your findings. Response: We would like to express our profound gratitude to the reviewer for underscoring the significance of racial/ethnic heterogeneity in our analyses. In response, we conducted comprehensive subgroup analyses across racial/ethnic categories (Mexican American, Non-Hispanic White, Non-Hispanic Black, Other) within the whole cohort and sex-stratified subgroups. Furthermore, three key relationships were examined: (a) associations of visceral adiposity index (VAI) with homeostasis model assessment of insulin resistance (HOMA-IR); (b) relationships between HOMA-IR and biological aging (BA); and (c) associations between VAI and BA. Key findings: � All racial/ethnic subgroups consistently demonstrated positive associations mirroring our primary results; � Significant race/ethnicity interaction effects (Pinteraction < 0.05) emerged for both VAI–HOMA-IR relationships and VAI–BA associations, indicating differential magnitudes of these positive associations across racial/ethnic subgroups. These findings both confirm the robustness of our primary observations and reveal important population-specific variations. Notably, identifying these differential effects enhances the generalizability of our conclusions and provides valuable insights for targeted interventions. We are grateful for this insightful suggestion, which significantly strengthened our study's epidemiological relevance. The detailed methodological description (Lines 193–201) and complete analytical results (Lines 422-435) appear in the “Revised Manuscript with Track Changes,” while relevant supporting documentation (Tables S16–S18) can be accessed in the 'Supplementary Information' file. Revised Manuscript with Track Changes (Lines 193–201): “To address potential effect modification by demographic factors, we conducted comprehensive subgroup and interaction analyses. Given the racial/ethnic diversity of NHANES participants (Mexican American, Non-Hispanic White, Non-Hispanic Black, Other), we (a) performed race/ethnicity-stratified analyses of VAI–IR, IR–BA and VAI–BA associations; (b) and tested multiplicative interaction terms (VAI × race/ethnicity) in fully adjusted models. Additionally, since age may modify relationships between VAI and BA, we (a) assessed age interaction effects through VAI × age terms; (b) and conducted age-stratified analyses using predefined categories (20–39, 40–59, ≥ 60 years). These analyses were implemented in both the whole cohort and sex-specific subgroups using multivariable-adjusted models. This approach enhances generalizability while identifying population-specific patterns in the visceral adiposity-aging relationship.” Revised Manuscript with Track Changes (Lines 422–435): “Consistent with our primary findings, stratified analyses across racial/ethnic subgroups (Mexican American, Non-Hispanic White, Non-Hispanic Black, Other) revealed persistently positive associations between VAI, BA, and IR in all populations. Three key patterns emerged: (a) VAI–HOMA-IR associations remained significantly positive across all racial/ethnic groups in the whole cohort and sex-stratified subgroups (S16 Table). Formal interaction testing indicated significant effect modification by race/ethnicity in the whole population (Pinteraction = 0.044) and among females (Pinteraction = 0.018). (b) HOMA-IR–BA relationships demonstrated consistent positive effects in all racial/ethnic subgroups without significant interaction (Pinteraction > 0.05 for whole, male, and female cohorts; S17 Table), indicating race-invariant mediation pathways. (c) The VAI–BA associations maintained significant positive effects across racial/ethnic strata (S18 Table), with significant interaction effects observed in the whole population (KDMAge: Pinteraction = 0.021; KDMAgeAccel: Pinteraction = 0.006) and among males (KDMAge: Pinteraction = 0.025; KDMAgeAccel: Pinteraction = 0.026). These findings confirm the reliability of our primary observations while identifying potential racial/ethnic differences, which enhances the generalizability of the study results and provides a basis for targeted interventions.” Relevant supporting documentation: S16 Table. Subgroup analyses of VAI–HOMA-IR associations. Race/Ethnicity N (%) VAI–HOMA-IR associations P for interaction β (95% CI) P-value Whole population Mexican American 3357 (17.23) 0.47 (0.31–0.63) <0.001 0.044 Non-Hispanic White 8996 (46.17) 0.40 (0.30–0.50) <0.001 Non-Hispanic Black 3803 (19.52) 1.15 (0.77–1.52) <0.001 Other 3330 (17.09) 0.33 (0.05–0.61) 0.023 Females Mexican American 1641 (16.86) 0.54 (0.30–0.78) <0.001 0.018 Non-Hispanic White 4420 (45.42) 0.45 (0.27–0.64) <0.001 Non-Hispanic Black 1966 (20.20) 1.33 (0.76–1.90) <0.001 Other 1705 (17.52) 0.53 (0.24–0.81) <0.001 Males Mexican American 1716 (17.59) 0.41 (0.18–0.64) <0.001 0.204 Non-Hispanic White 4576 (46.91) 0.36 (0.25–0.47) <0.001 Non-Hispanic Black 1837 (18.83) 1.01 (0.55–1.47) <0.001 Other 1625 (16.66) 0.23 (-0.06–0.52) 0.118 The models were adjusted for age, sex (only in the model of the whole population), education, marital status, poverty status, smoking status, alcohol consumption, M/VPA, HTN, CVD, cancer, and CKD. HOMA-IR, homeostasis model assessment of insulin resistance; VAI, visceral adiposity index; CI, confidence interval. S17 Table. Subgroup analyses of HOMA-IR–BA associations. Race/Ethnicity N (%) HOMA-IR–KDMAge associations P for interaction HOMA-IR–KDMAgeAccel associations P for interaction β (95% CI) P-value OR (95% CI) P-value Whole population Mexican American 3357 (17.23) 0.20 (0.01–0.42) 0.007 0.481 1.05 (1.01–1.11) 0.011 0.609 Non-Hispanic White 8996 (46.17) 0.37 (0.28–0.47) <0.001 1.08 (1.06–1.11) <0.001 Non-Hispanic Black 3803 (19.52) 0.34 (0.22–0.46) <0.001 1.05 (1.02–1.08) 0.001 Other 3330 (17.09) 0.38 (0.17–0.58) <0.001 1.07 (1.03–1.12) 0.001 Females Mexican American 1641 (16.86) 0.19 (-0.03–0.41) 0.091 0.479 1.06 (1.01–1.11) 0.016 0.816 Non-Hispanic White 4420 (45.42) 0.37 (0.23–0.51) <0.001 1.08 (1.04–1.12) <0.001 Non-Hispanic Black 1966 (20.20) 0.30 (0.16–0.44) <0.001 1.05 (1.01–1.09) 0.011 Other 1705 (17.52) 0.42 (0.21–0.62) <0.001 1.07 (1.02–1.13) 0.013 Males Mexican American 1716 (17.59) 0.19 (-0.11–0.49) 0.219 0.560 1.04 (0.95–1.13) 0.407 0.732 Non-Hispanic White 4576 (46.91) 0.37 (0.24–0.50) <0.001 1.08 (1.05–1.11) <0.001 Non-Hispanic Black 1837 (18.83) 0.38 (0.17–0.59) <0.001 1.05 (1.00–1.10) 0.06 Other 1625 (16.66) 0.35 (0.13–0.57) 0.002 1.08 (1.02–1.14) 0.011 The models were adjusted for age, sex (only in the model of the whole population), education, marital status, poverty status, smoking status, alcohol consumption, M/VPA, HTN, CVD, cancer, and CKD. HOMA-IR, homeostasis model assessment of insulin resistance; KDMAge, Klemera-Doubal method age; KDMAgeAccel, KDMAge acceleration; CI, confidence interval. S18 Table. Subgroup analyses of VAI–BA associations for different race/ethnicity. Race/Ethnicity N (%) VAI–KDMAge associations P for interaction VAI–KDMAgeAccel associations P for interaction β (95% CI) P-value OR (95% CI) P-value Whole population Mexican American 3357 (17.23) 0.64 (0.40–0.88) <0.001 0.021 1.08 (1.03–1.13) 0.002 0.006 Non-Hispanic White 8996 (46.17) 0.85 (0.68–1.01) <0.001 1.16 (1.13–1.20) <0.001 Non-Hispanic Black 3803 (19.52) 1.15 (0.64–1.66) <0.001 1.15 (1.06–1.25) 0.001 Other 3330 (17.09) 0.43 (0.15–0.71) 0.003 1.08 (1.03–1.12) <0.001 Females Mexican American 1641 (16.86) 0.77 (0.42–1.13) <0.001 0.334 1.18 (1.08–1.28) <0.001 0.642 Non-Hispanic White 4420 (45.42) 1.04 (0.78–1.30) <0.001 1.24 (1.18–1.31) <0.001 Non-Hispanic Black 1966 (20.20) 1.48 (0.88–2.08) <0.001 1.22 (1.10–1.36) <0.001 Other 1705 (17.52) 0.92 (0.42–1.41) <0.001 1.14 (1.06–1.23) <0.001 Males Mexican American 1716 (17.59) 0.53 (0.22–0.84) 0.001 0.025 1.04 (0.99–1.09) 0.141 0.026 Non-Hispanic White 4576 (46.91) 0.73 (0.50–0.95) <0.001 1.13 (1.08–1.18) <0.001 Non-Hispanic Black 1837 (18.83) 0.84 (0.13–1.56) 0.023 1.09 (0.99–1.20) 0.095 Other 1625 (16.66) 0.27 (0.01–0.52) 0.041 1.06 (1.02–1.11) 0.005 The models were adjusted for age, sex (only in the model of the whole population), education, marital status, poverty status, smoking status, alcohol consumption, M/VPA, HTN, CVD, cancer, and CKD. VAI, visceral adiposity index; KDMAge, Klemera-Doubal method age; KDMAgeAccel, KDMAge acceleration; CI, confidence interval. Comments 2: While the cross-sectional design limitation is acknowledged, I recommend elaborating on its implications, particularly regarding causal inference and temporality. Discussing how reverse causation might influence the observed relationships would improve the depth of the discussion. Response: We are grateful to the reviewer for the thoughtful feedback regarding the limitations of our cross-sectional design. In direct response to this comment, we have substantially expanded the limitations of the Discussion section (originally 38 words → now 432 words), incorporating six additional references. Specifically, we have (a) analysed the possibility of reverse causation in the observed associations, and delineated potential biological mechanisms through which accelerated BA might drive visceral adiposity accumulation; (b) critically examined how such reverse causation could influence the interpretation of our observed associations. This revision significantly enhances the depth of our methodological discussion and provides important context for interpreting the findings. We believe these additions will allow readers to more objectively evaluate our results while strengthening the scientific rigor of our conclusions. The revised text appears in Lines 541-576 of the “Revised Manuscript with Track Changes”. Revised Manuscript with Track Changes (Lines 541–576): “First, the primary limitation of this study stems from its cross-sectional design, which inherently precludes definitive causal inference regarding the temporal sequence between VAI and BA, particularly in elucidating sex-specific mechanisms. While our analyses revealed significant associations and mediation effects, this design cannot establish whether elevated VAI precedes and contributes to accelerated BA, or conversely, whether accelerated BA itself drives increases in VAI. Compelling evidence suggests that age-related lipid turnover decline and adipose tissue dysfunction may constitute reverse causal pathways. Specifically, longitudinal data demonstrate that adipose lipid turnover decreases by approximately 4.7% annually with aging, disrupting the dynamic equilibrium of lipid storage and clearance, even under constant caloric intake, potentially driving weight gain exceeding 20% over decades [55]. This dysregulation is particularly pronounced in visceral adipose tissue due to diminished preadipocyte differentiation capacity, reduced lipolytic enzyme activity (e.g., hormone-sensitive lipase), and blunted catecholamine responsiveness, collectively impairing lipid mobilization. Notably, the recent identification of CP-A adipose progenitor cells, a subpopulation emerging during middle age that exhibits hyperactive adipogenic potential through LIFR-STAT3 signaling activation, may further explain age-dependent visceral adipose tissue expansion [56]. Concurrently, adipose tissue senescence is characterized by chronic low-grade inflammation involving increased immune cell infiltration (e.g., TNF-α, IL-6), tissue fibrosis, and adipokine dysregulation (e.g., reduced adiponectin, elevated leptin), establishing a self-perpetuating vicious cycle whereby aging promotes adipose dysfunction that subsequently exacerbates systemic metabolic deterioration and accelerates organismal decline [57]. Additional contributors to age-associated visceral adiposity include muscle mass loss, progressive reductions in physical activity levels, and hormonal alterations [11,58,59]. Critically, the observed mediation proportion of HOMA-IR, while statistically significant, must also be interpreted cautiously within this bidirectional framework, as aging-related metabolic dysfunction may simultaneously elevate HOMA-IR independently of prior adiposity changes [60]. Importantly, this potential reverse causation may influence our key finding of stronger VAI–BA associations in females. Estrogen, predominantly in premenopausal women, maintains subcutaneous fat distribution and functionality while delaying visceral adipose tissue accumulation through ERα-mediated mechanisms; however, the abrupt estrogen decline during menopause may precipitate rapid visceral adipogenesis, potentially amplifying the observed VAI–BA relationship in female cohorts [59]. Furthermore, the biphasic nonlinear associations and threshold effects we identified may reflect shifting dominance between causal directions: below VAI thresholds, traditional “adiposity-driven aging” mechanisms (lipotoxicity, inflammation) likely predominate, whereas above thresholds, aging-induced metabolic dysregulation may progressively disrupt adipose homeostasis, creating a self-reinforcing pathological loop [57]. Consequently, the strength and sex-specific patterns of the associations reported here require validation in longitudinal studies tracking temporal dynamics of VAI, HOMA-IR, and BA biomarkers to establish precedence. Future experimental interventions targeting visceral adiposity reduction would provide stronger evidence for causal pathways and their sexual dimorphism.” References: 11. Nunan E, Wright CL, Semola OA, Subramanian M, Balasubramanian P, Lovern PC, et al. Obesity as a premature aging phenotype — implications for sarcopenic obesity. GeroScience. 2022;44: 1393–1405. doi:10.1007/s11357-022-00567-7 55. Arner P, Bernard S, Appelsved L, Fu K-Y, Andersson DP, Salehpour M, et al. Adipose lipid turnover and long-term changes in body weight. Nat Med. 2019;25: 1385–1389. doi:10.1038/s41591-019-0565-5 56. Wang G, Li G, Song A, Zhao Y, Yu J, Wang Y, et al. Distinct adipose progenitor cells emerging with age drive active adipogenesis. Science. 2025;388: eadj0430. doi:10.1126/science.adj0430 57. Nguyen TT, Corvera S. Adipose tissue as a linchpin of organismal ageing. Nat Metab. 2024;6: 793–807. doi:10.1038/s42255-024-01046-3 58. Winters-van Eekelen E, van der Velde JHPM, Boone SC, Westgate K, Brage S, Lamb HJ, et al. Objectively Measured Physical Activity and Body Fatness: Associations with Total Body Fat, Visceral Fat, and Liver Fat. Med Sci Sports Exerc. 2021;53: 2309–2317. doi:10.1249/MSS.0000000000002712 59. Vecchiatto B, Castro TL, Ferreira NJR, Evangelista FS. Healthy adipose tissue after menopause: contribution of balanced diet and physical exercise. Explor Endocr Metab Dis. 2025; 101424. doi:10.37349/eemd.2025.101424 60. Palmer AK, Jensen MD. Metabolic changes in aging humans: current evidence and therapeutic strategies. J Clin Invest. 132: e158451. doi:10.1172/J Attachment Submitted filename: Response_to_Reviewers_auresp_2.docx 10.1371/journal.pone.0333472.r005 Decision Letter 2 Mansoori Amin Academic Editor © 2025 Amin Mansoori 2025 Amin Mansoori https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 2  15 Sep 2025 Sex differences in the association between visceral adiposity index and biological aging: a cross-sectional analysis of NHANES 1999–2018 with mediation by insulin resistance PONE-D-25-26841R2 Dear Dr. Liu, We’re pleased to inform you that your manuscript has been judged scientifically suitable for publication and will be formally accepted for publication once it meets all outstanding technical requirements. Within one week, you’ll receive an e-mail detailing the required amendments. When these have been addressed, you’ll receive a formal acceptance letter and your manuscript will be scheduled for publication. An invoice will be generated when your article is formally accepted. Please note, if your institution has a publishing partnership with PLOS and your article meets the relevant criteria, all or part of your publication costs will be covered. Please make sure your user information is up-to-date by logging into Editorial Manager at Editorial Manager® billing support If your institution or institutions have a press office, please notify them about your upcoming paper to help maximize its impact. If they’ll be preparing press materials, please inform our press team as soon as possible -- no later than 48 hours after receiving the formal acceptance. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. Kind regards, Amin Mansoori Academic Editor PLOS ONE Additional Editor Comments (optional): Dear Author, We are pleased to inform you that your manuscript has been accepted for publication in PLOS ONE. The revisions have significantly improved the manuscript, and the current version meets the journal’s standards for publication. Best Regards Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author Reviewer #3: All comments have been addressed ********** 2. Is the manuscript technically sound, and do the data support the conclusions??> Reviewer #3: Yes ********** 3. Has the statistical analysis been performed appropriately and rigorously? -->?> Reviewer #3: Yes ********** 4. Have the authors made all data underlying the findings in their manuscript fully available??> The PLOS Data policy Reviewer #3: Yes ********** 5. Is the manuscript presented in an intelligible fashion and written in standard English??> Reviewer #3: Yes ********** Reviewer #3: (No Response) ********** what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #3: No ********** 10.1371/journal.pone.0333472.r006 Acceptance letter Mansoori Amin Academic Editor © 2025 Amin Mansoori 2025 Amin Mansoori https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License PONE-D-25-26841R2 PLOS ONE Dear Dr. Liu, I'm pleased to inform you that your manuscript has been deemed suitable for publication in PLOS ONE. Congratulations! Your manuscript is now being handed over to our production team. At this stage, our production department will prepare your paper for publication. This includes ensuring the following: * All references, tables, and figures are properly cited * All relevant supporting information is included in the manuscript submission, * There are no issues that prevent the paper from being properly typeset You will receive further instructions from the production team, including instructions on how to review your proof when it is ready. Please keep in mind that we are working through a large volume of accepted articles, so please give us a few days to review your paper and let you know the next and final steps. Lastly, if your institution or institutions have a press office, please let them know about your upcoming paper now to help maximize its impact. If they'll be preparing press materials, please inform our press team within the next 48 hours. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. You will receive an invoice from PLOS for your publication fee after your manuscript has reached the completed accept phase. If you receive an email requesting payment before acceptance or for any other service, this may be a phishing scheme. Learn how to identify phishing emails and protect your accounts at https://explore.plos.org/phishing If we can help with anything else, please email us at customercare@plos.org. Thank you for submitting your work to PLOS ONE and supporting open access. Kind regards, PLOS ONE Editorial Office Staff on behalf of Dr. Amin Mansoori Academic Editor PLOS ONE ",
  "metadata": {
    "Title of this paper": "Acceptance letter",
    "Journal it was published in:": "PLOS One",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478895/"
  }
}