{
  "title": "Paper_613",
  "abstract": "Clin Colon Rectal Surg Clin Colon Rectal Surg 396 ccrs Clinics in Colon and Rectal Surgery 1531-0043 1530-9681 Thieme Medical Publishers PMC12151591 PMC12151591.1 12151591 12151591 40501526 10.1055/s-0044-1791521 CCRS 01362 1 Review Article Innovations and Updates in Diverticulitis Guest Editor: Lillias H. Maguire, MD, FACS The Emerging Role of the Microbiota and Antibiotics in Diverticulitis Treatment Troester Alexander MD 1 * Weaver Lauren MD 1 * Jahansouz Cyrus MD 2 1 Department of Surgery, University of Minnesota, Minneapolis, Minnesota 2 Division of Colon & Rectal Surgery, Department of Surgery, University of Minnesota, Minneapolis, Minnesota Address for correspondence 420 Delaware Street SE, MMC 450, Minneapolis MN 55455 jahan023@umn.edu Conflict of Interest 30 9 2024 7 2025 38 4 490329 269 276 30 09 2025 30 09 2025 11 06 2025 30 09 2025 Thieme. All rights reserved. 2024 Thieme Medical Publishers, Inc. Diverticular disease is the leading cause of elective colon surgery. With a rising incidence in younger populations, it continues to pose a significant burden on the health care system. Traditional etiopathogenesis implicated an infectious mechanism, while recent challenges to this theory have demonstrated the microbiome playing a significant role, along with genetic predispositions and associations with obesity and diet. Therefore, the role of antibiotics in uncomplicated disease merits reconsideration. In this review, we aim to outline the current knowledge regarding antibiotics for diverticulitis treatment, broadly define the microbiome components, functions, and modifiability, and discuss newly proposed pathogenetic mechanisms for diverticular disease that incorporate information regarding the microbiome. Analytic techniques for microbiota characterization and function continue to advance at a rapid pace. As emerging technology advances, we will continue to elucidate the role of the microbiome in diverticular disease development. Keywords microbiome antibiotics diverticulitis pathogenesis treatment Funding pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "The Emerging Role of the Microbiota and Antibiotics in Diverticulitis Treatment",
    "Journal it was published in:": "Clinics in Colon and Rectal Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12151591/"
  }
}