{
  "title": "Paper_165",
  "abstract": "pmc EMBO J EMBO J 78 emboj The EMBO Journal 0261-4189 1460-2075 Nature Publishing Group PMC12488894 PMC12488894.1 12488894 12488894 40846900 10.1038/s44318-025-00542-w 542 1 Article Fusobacterium nucleatum Karta Jessica 1 http://orcid.org/0000-0003-0475-1373 Meyers Marianne 1 Rodriguez Fabien 1 Koncina Eric 1 http://orcid.org/0000-0001-7257-1097 Gilson Cedric 1 http://orcid.org/0000-0003-1433-9710 Klein Eliane 1 http://orcid.org/0000-0002-5617-251X Gabola Monica 1 http://orcid.org/0000-0002-6413-3983 Benzarti Mohaned 1 http://orcid.org/0000-0002-2330-4248 Pérez Escriva Pau 1 http://orcid.org/0000-0003-1554-9226 Molina Tijeras Jose Alberto 1 http://orcid.org/0009-0001-9609-0930 Correia Tavares Bernardino Catarina 1 Ponath Falk 2 Carpentier Anais 3 Pujabet Mònica Aguilera 4 Schmoetten Maryse 1 Tsenkova Mina 1 http://orcid.org/0000-0003-2611-3268 Saoud Perla 1 Gaigneaux Anthoula 1 Ternes Dominik 1 Alonso Lidia 4 Zügel Nikolaus 5 Willemssen Eric 6 Koppes Philippe 6 http://orcid.org/0000-0002-9787-2133 Léonard Daniel 6 Casanova Luis Perez 3 Haan Serge 1 http://orcid.org/0000-0002-2998-052X Mittelbronn Michel 1 3 http://orcid.org/0000-0002-9093-6210 Meiser Johannes 7 http://orcid.org/0000-0002-6526-9890 Pozdeev Vitaly I 1 http://orcid.org/0000-0003-2220-1404 Vogel Jörg 2 8 Nuciforo Paolo G 4 Wilmes Paul 1 9 http://orcid.org/0000-0001-8242-9393 Letellier Elisabeth elisabeth.letellier@uni.lu 1 1 https://ror.org/036x5ad56 grid.16008.3f 0000 0001 2295 9843 Department of Life Sciences and Medicine (DLSM), Faculty of Science, Technology and Medicine, University of Luxembourg, 2 https://ror.org/00fbnyb24 grid.8379.5 0000 0001 1958 8658 Institute of Molecular Infection Biology, University of Würzburg, 3 https://ror.org/04y798z66 grid.419123.c 0000 0004 0621 5272 Laboratoire National de Santé (LNS), National Center of Pathology (NCP), 4 https://ror.org/054xx3904 0000 0004 0563 8855 Molecular Oncology Group, Vall d’Hebron Institute of Oncology, 5 https://ror.org/03xq7w797 grid.418041.8 0000 0004 0578 0421 Centre Hospitalier Emile Mayrisch, 6 7 https://ror.org/012m8gv78 grid.451012.3 0000 0004 0621 531X Department of Cancer Research (DOCR), Luxembourg Institute of Health, 8 https://ror.org/03d0p2685 grid.7490.a 0000 0001 2238 295X Helmholtz Institute for RNA-based Infection Research (HIRI), Helmholtz Centre for Infection Research (HZI), 9 https://ror.org/036x5ad56 grid.16008.3f 0000 0001 2295 9843 Luxembourg Centre for Systems Biomedicine, University of Luxembourg, 22 8 2025 10 2025 44 19 498146 5375 5393 5 7 2024 17 7 2025 29 7 2025 22 08 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Gut microbial species contribute to colorectal cancer (CRC) by interacting with tumor or immune cells, however if CRC-associated bacteria engage with stromal components of the tumor microenvironment remains unclear. Here, we report interaction between the CRC-associated bacterium Fusobacterium nucleatum F. nucleatum F. nucleatum F. nucleatum Synopsis  Crosstalk between the microbiome and the tumor microenvironment in colorectal cancer (CRC) remains poorly defined. This work identifies the Gram-negative oral anaerobe Fusobacterium nucleatum  F. nucleatum Invasion by F. nucleatum F. nucleatum Fusobacterium nucleatum  Keywords Cancer-associated Fibroblasts (CAFs) Colorectal Cancer Fusobacterium nucleatum Inflammatory CAF (iCAF) Invasion Subject terms Cancer Immunology Microbiology, Virology & Host Pathogen Interaction http://dx.doi.org/10.13039/501100001866 Fonds National de la Recherche Luxembourg (FNR) CORE/C16/BM/11282028 CORE/C20/BM/14591557 CORE/C15/BM/10404093 PoC/18/12554295 AFR 17103240 CORE/C21/BM/15718879 PRIDE17/11823097 FNR matched funding scheme,MFP20/15251414/MelCol PFP PRIDE21/16763386 Gilson Cedric Tsenkova Mina Wilmes Paul http://dx.doi.org/10.13039/100008665 Université du Luxembourg (University of Luxembourg) Internal Research Project at the University of Luxembourg,MiDiCa http://dx.doi.org/10.13039/501100002661 Fonds De La Recherche Scientifique - FNRS (FNRS) Télévie,7.4565.21 and 7.6603.02 Télévie,7.4560.22 Télévie,7.4552.23 Meyers Marianne Gabola Monica Saoud Perla Fondation de Luxembourg Fondation du Pélican de Mie and Pierre Hippert-Faber Fondation Schumacher Fundacion Ramon Areces http://dx.doi.org/10.13039/501100008471 Fondation Gustave et Simone Prévot (Fondation Prévot) http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft (DFG) SFB 1583/1,Project number: 492620490,Subproject A09 Vogel Jörg Cancer Research UK C17937/A29070 Fondo de Investigaciones Sanitarias (FIS) PI20/00889 Instituto de Salud Carlos III (ISCIII) and Fundación Mutua Madrileña MMADRILEÑA/PREMI/2020CCAA_NUCIFORO Swiss national science Foundation P500PB_214405 Pérez Escriva Pau pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © European Molecular Biology Organization 2025 Introduction Colorectal cancer (CRC) is the third most common cancer type with the second highest rate of cancer-related deaths worldwide (Lichtenstern et al, 2020 2021 2007 2021 2023 2021 2020 2021 2021 2022 2019 2017 2025 2024 2019 2021 + 2018 2015 2010 2010 2014 2017 2015 Fusobacterium nucleatum Fn) 2019 2020 Fn 2012 2014 2016 Fn 2013 2013 d 2016 Fn 2020 Fn 2015 2019 2022 2023 Fn Fn Previous studies on the cross-talk between Fn Fn 2019 Fn Porphyromonas gingivalis 2009 Fn Fn Fn Fn Fn Fn Fn Results Fusobacterium nucleatum The TME plays a significant role in cancer progression. However, the impact of the tumor microbiome within the stromal compartment remains far less explored compared to its interactions with the epithelial or immune cell compartments. We leveraged the CSI-Microbes analysis of the Pelka2021 scRNA-Seq dataset (Robinson et al, 2024 2021 Fusobacterium Fusobacterium 1A Fn Fn Fn 1B,C S1A CDX2-CreER T2 Apc fl/fl Fn 1D S1B Fn S1C Fn Fn 1E 2020 Fn Figure 1 Fn ( A 2024 2021 Fusobacterium B C B C C Fn B C C D CDX2-CreER T2 Apc fl/fl 8 Fn E Fn Fn CDX2-CreER T2 Apc fl/fl F Fn Ec G Fn + - H Fn Ec n n n I Fn Fn Fn 71 Ec n J Fn n H I Source data are available online for this figure While the binding of different CRC-associated bacteria, including Fn Fn Fn Escherichia coli (Ec) 1F Fn Fn Fn Fn Fn 1G 1A Fn Fn Ec 1H Fn animalis Fn 2011 Fn 2024 2013 1I S1D Fn 1J Fn S1E Fn Fn Fn 2016 2013 Fn Fn 2A 2B,C Fn fap2 Fn Fn 2D fadA Fn 2D Fn d 2E Fn Figure 2 Fn ( A B C 2 B C n 2 D Fn fap2 fadA n E Fn n D E Source data are available online for this figure Fn We next aimed to explore the impact of Fn 2021 2017 2023 2020 2023 2022 2025 2013 Fn Fn Fn hi Fn lo 3A 2022 Fn hi 3B Fn hi 3B Fn IL-6 ACTA2 Fn Fn IL-6 ACTA2 3C 2020 2019 S2A Fn S2B ) 2019 Fn Ec 3D Fn 3D S2C–F Ec 3D S2C,D Figure 3 Fn ( A Fn n th Fn lo Fn hi B Fn lo Fn hi 2 C 2 IL-6 ACTA2 Fn n n D n n n n Fn Ec E Fn n F 2 Fn G Fn H R F Fn D A H t P D G Source data are available online for this figure Individual markers for CAFs, including iCAF and myCAF subsets, do exist, but have limitations (Nurmik et al, 2020 2016 Fn- Fn 3E 2019 2019 2023 3F Fn 2015 2017 2022 Fn 3G,H Fn Fn iCAFs have been characterized by the secretion of inflammatory cytokines, chemokines and tumor-promoting growth factors (Caligiuri and Tuveson, 2023 Fn Fn Ec 4A Fn 2020 2013 2020 1993 Fn 4A 2014 2012 2021 Fn 4B–D Fn Ec S3A Fn 2025 Fn S3B Ec Ec Fn 2025 Figure 4 Fn ( A Fn n B Fn Ec n C D C D Fn Ec n E 2023 F Fn lo Fn hi 3A G n n 2 n n Fn Ec B D G E F B D G E F t Source data are available online for this figure Given the observed increase in pro-inflammatory cytokines, it is plausible that reactive oxygen species (ROS), which can be triggered by LPS (Cheng et al, 2015 2013 2020 2023 4E Fn hi 4F Fn 4G S3C 13 S3D,E Fn Fn Fn In order to characterize how Fn 5A Fn 5B Fn 5C Fn Figure 5 Fn ( A Fn n B P Fn A C P P D E Fn Ec n F G Fn Ec H n I E I H P Source data are available online for this figure To confirm that Fn 5D Fn Ec 5E,F S4A Fn Ec S4B,C Fn Ec Fn 5G Fn 5H,I S4D Fn 2013 2014 5H,I Fn 5H,I S4E S4C Finally, we used an in vivo tail vein metastasis assay to determine the metastatic potential of cancer cells, and assess their ability to colonize distant organs, most commonly the lungs. To this end, we performed tail vein injections of the CRC cell line HT-29 pre-stimulated with CM of CAFs previously co-cultured with bacteria (Fig. 6A Fn Ec 6B,C Fn Figure 6 Fn ( A 6 Fn Ec n Ec n Fn B C Source data are available online for this figure Discussion In recent years, Fn Fn Fn Fn Fn Fn Fn Fn 2010 2014 2019 2021 2016 2024 Fn Ec Fusobacterium nucleatum 2023 2021 Exposure of CAFs to Fn Fn 2012 2012 2008 2021 2019 Fn We observed increased CRC cell migration and invasion following co-culture with Fn Fn Ec 2025 2022 Fn Fn Fn Fn Fn Fn Altogether, we demonstrate here a multifactorial role by which Fn Fn Fn Fn Fn Fn Fn Fn Methods Patient sample collection and preparation All patient samples were obtained through our established CRC cohort and handled according to all institutional guidelines and regulations (ERP-16-032), based on previously described biospecimen handling standards. All patient samples were donated freely, with informed written consent. Ethical approvals were obtained for samples collected in Luxembourg from the Comité National d’Ethique de Recherche (CNER) (Reference 201009/09), and in Spain approved by the Institutional Ethics Committee of Vall d’Hebron University Hospital (PR(AG)210/2019). Cell cultures All cell lines used in this study are listed in Appendix Table S1 2023 3 2017 The commercial HCT116, HT-29 and SW480 CRC cell lines were purchased from the American Type Culture Collection (ATCC) and maintained in DMEM-F12 supplemented with 10% FBS and 1 U/ml P/S at 37 °C, 5% CO 2 2 2016 2017 Bacterial cell culture Bacterial strains used in the study are listed in Appendix Table S2 Fusobacterium nucleatum Fn Fusobacterium nucleatum animalis 7_1 Fn Fusobacterium nucleatum Fn Escherichia coli Ec fadA fap2 Fn 2022 2 2 TM 2022 Generation of ∆ fap2 F. nucleatum nucleatum Electro-competent F. nucleatum nucleatum 2022 fap2 S3 S3 Fn Direct co-culture of fibroblasts and bacteria Cells were pretreated for 1 h at 37 °C with 1× Brefeldin (eBiosience TM ( l Fn Ec 2 Immunofluorescence imaging for Fn CAF05 and CT5.3 CAFs were seeded in μ-Slide eight-well chamber (Ibidi, 80826) at 40,000 cells/well. Before co-culture, Fn C34554 Fn 2020 Binding assay on human CRC tissue Fn 2016 7 Immunofluorescent analysis of paraffin-embedded mouse colons Colons were rolled lengthwise and fixed in 10% formalin for 24 h, then embedded in paraffin. For immunostaining, tissue sections were deparaffinized and rehydrated sequentially in xylene (2 × 5 min), 100% ethanol (3 min), 96% ethanol (3 min), 70% ethanol (3 min), and finally distilled water (5 min). Antigen retrieval was performed by incubating slides in 1× Citrate Buffer (Abcam, ab93678), pH 6.0, at 93 °C for 15 min. After two washes in distilled water, the sections were blocked with blocking buffer (5% BSA, 5% Horse serum and 0.3% Triton X-100) for 30 min at RT, followed by overnight incubation at 4 °C with primary antibodies. The anti-OMP-antibody (Strauss et al, 2011 Fn A31573 In situ hybridization staining of human CRC sample Human CRC samples were fixed overnight at 4 °C with neutral buffered formalin 10%. Paraffin-embedded tissue sections (2–3 μm) were air-dried and further dried at 60 °C for 2 h. All stainings were performed using a Ventana Discovery Ultra Kit. For ISH, ready-to-use (RTU) reagents from RNAscope® VS Universal AP Detection Reagents (ACD bio-techne, 323260) were loaded onto the DISCOVERY mRNA RED Probe Amplification Kit (Roche, 760-236,) or the DISCOVERY mRNA Sample Prep Kit (Roche, 760-248,) containers according to the user manual (Doc. No. 323250-USM-ULT). FFPE tissue sections were deparaffinized, and antigen retrieval was initiated using RNAscope® VS Sample Prep Reagents v2 (ACD bio-techne, 323740), followed by the epitope retrieval Cell Conditioning 1 (CC1) buffer for 24 min at 97 °C (Roche, 6414575001) and protease treatment (16 min at 37 °C). Probe hybridization, signal amplification, colorimetric detection with DISCOVERY mRNA RED Detection kit (Roche, 760-234) and counterstaining were subsequently performed following the manufacturer's recommendations. Hybridization against 23S rRNA from Fusobacterium nucleatum animalis Flow cytometry of Fn Before co-culture, bacteria were pre-labeled with CFSE (CellTrace™ CFSE Cell Proliferation Kit, for flow cytometry from Invitrogen, C34554 Fn L34975 Flow cytometry analysis Cells were dissociated into a single-cell suspension using trypsin-EDTA (1 mM EDTA, Life Technologies, 25300062), resuspended in FACS buffer and incubated with the fluorescent-labeled antibodies FITC-anti-Lamin A/C (Santa Cruz Biotechnology, SC-376248), APC anti-αSMA (Bio-Techne, IC420A), PerCP-Cy-5.5-anti-PGDFRα (Bio-Techne, FAB1264P), BV421-anti-PGDFRβ (BD Biosc., USA564124), PE-anti-CXCL1 (Bio-Techne, IC275P), AF488 anti-αSMA (eBioscience, 53-9760-82), APC anti-FAP (Bio-Techne, FAB3715A) or PE-Cy7 anti-PDPN (Biolegend, 337014). Intracellular proteins were labeled following an additional fixation and permeabilization step (Cytofix/Cytoperm Solution Kit, BD Bioscience). Intracellular and mitochondrial reactive oxygen species (ROS) were detected with 2’,7’-dichlorodihydrofluorescein diacetate (H 2 M36008 R Accordingly, for the Annexin V assay, cells were stained according to the manufacturer’s protocol (BD Biosc, 556422), with the sole modification being the inclusion of DAPI at a 1:1000 dilution. Transmission electron microscopy (TEM) In total, 50,000 CT5.3 CAF cells were seeded into an eight-well chamber μ-Slide (Ibidi, 80826). CAFs were then treated for 4 h at an MOI 50 with Fn Intracellular bacteria viability imaging In total, 20,000 CT5.3 CAF cells were seeded per well in eight-well chamber μ-Slide (Ibidi, 80826). CAFs were then treated for 4 h at an MOI 50 with Fn Podoplanin in vitro CAF staining In total, 20,000 CT5.3, CAF180 or CAF181 CAFs were seeded per well in an eight-well chamber μ-Slide (Ibidi, 80826). CAFs were pretreated for 1 h with 1 µM TAK-242 or appropriate DMSO vehicle control, then infected for 4 h at an MOI 50 with Fn 2017 Transcriptome analysis RNA extraction and quality control RNA from cell cultures was isolated using the miRNeasy Mini Kit (Qiagen) according to the manufacturer’s protocol. RNA concentration was determined at an absorbance of 260 nm using a NanoDrop 2000c Spectrophotometer (Thermo Fisher Scientific) and its purity assessed from the 260/280 nm and 260/230 nm absorbance ratios. RNA samples were desalted by ethanol precipitation and the RNA integrity number (RIN) was calculated using the Agilent 21000 Bioanalyzer platform (Agilent Technologies) with the Agilent RNA 6000 Nano Kit. Only samples with a RIN ≥ 9 were subsequently used for RNA sequencing. RNA sequencing and data analysis RNA libraries were sequenced as 100 bp paired-end runs on a HiSeq2500 platform (Illumina). Differential expression analysis was performed using the statistical software R 2017 2 p cDNA synthesis and real-time (RT) qPCR cDNA was synthesized using the high-capacity cDNA reverse transcription kit (Applied Biosystems) following the manufacturer’s protocol. The qPCR reaction was prepared using the Absolute Blue qPCR SYBR Green Low ROX Mix (Thermo Scientific) with 5 ng of cDNA and 2.5 pmol of the forward and reverse primers. The PCR amplification was performed over 40 cycles (95 °C for 30 s, 60 °C for 30 s and 72 °C for 30 s) on a 7500 FAST Real-time PCR Detection System (Applied Biosystems). Gene expression levels (Ct) were then normalized against the geometric mean of the house-keeping genes HPRT1 YWHAZ S4 Cytokine array assay (dot blot) CAFs were treated with or without bacteria for 2 h and, following washing steps, further incubated for 24 h. On the following day, media from non- and bacteria-treated CAFs were collected, and cellular debris were removed by centrifugation at 350 rcf for five minutes at 4 °C. Cytokine arrays were performed using the Proteome Profiler Human XL Cytokine Array Kit (R&D Systems, ARY022B). A Fusion FX imaging platform was used to detect the signals from the dot blot, and the signal densities were further quantified using the ImageJ 1.52p software. ELISA The concentrations of CXCL1, IL-6, and IL-8 in cell culture supernatants were measured using the Human CXCL1 DuoSet ELISA (R&D Systems, #DY275), Human IL-6 DuoSet ELISA (R&D Systems, #DY206) and Human IL-8/CXCL8 DuoSet ELISA (R&D Systems, #DY208) kits according to the manufacturer’s protocol. Cytation 5 cell imaging multi-mode reader (Biotek) was used to measure the absorbances at 450 nm and 570 nm. Migration and invasion assay In total, 50,000 HCT116 were seeded on the surface of a Transwell insert (8 µm pore size, Greiner) filled with DMEM-F12 containing 1% FBS, while 80,000 CAFs were cultured in 24-well plates in DMEM-F12 containing 10% FBS. Fibroblasts were further treated with bacteria for 2 h and extensively washed with P/S containing medium to remove residual bacteria. The co-culture was performed by placing the Transwell insert on top of the fibroblasts. To evaluate the migration capacity of HCT116 cells, fibroblasts (either untreated or treated with Fn For the SW480 transwell invasion assays, the Transwell inserts (8 µm pore size, Greiner) were first pre-coated with a 0.05 mg/ml Collagen Type I (Sigma-Aldrich) and 0.5 mg/ml of ECM gel (Sigma-Aldrich) in a 1:1 PBS-Culture medium mixture for 2 h at 37 °C. Then 80,000 cells were seeded on top and the same protocol as above applied. 3D collagen invasion assay HCT116-mCherry and CT5.3-GFP cells were co-cultured in ultra-low attachment BIOFLOAT™ 96-well plates (Facellitate, Mannheim, Germany) at densities of 1 × 10³ and 0.5 × 10³ cells, respectively, maintaining a 2:1 ratio in DMEM-F12 supplemented with 10% FBS and 1 U/ml P/S. After 72 h of spheroid formation on a shaking platform, the spheroids were embedded in a collagen solution composed of 2 mg/ml collagen type I (MerckMillipore, Darmstadt, Germany), 1× DMEM-F12 (Gibco, Thermo Fisher Scientific, Waltham, MA, USA), and 1% FBS (Gibco, Thermo Fisher Scientific, Waltham, MA, USA). The pH of the collagen solution was adjusted to 7.4 using 1 M NaOH. The plates were incubated at 37 °C for 30 min to allow polymerization. The collagen matrix was then overlaid with 200 µl of DMEM-F12 supplemented with 10% FBS and 20% conditioned medium collected from CT5.3 cells grown alone or in co-culture with either Ec Fn Stable isotope tracing and metabolite extraction Stable isotope tracing experiments with [U- 13 13 Fn Fn Ec 13 2024 2020 Dataset analyses The colon (COAD) and rectal (READ) cases of the Cancer Genome Atlas (TCGA, data release version 36.0) were used. STAR counts for protein-coding genes were extracted from the GDC portal ( https://gdc.cancer.gov R R 2018 2019 2023 The tumor fibroblasts of the GSE132465 GSE144735 2020 2023 2021 The CSI-Microbes analysis of the Pelka2021 dataset (Pelka et al, 2021 2024 2024 PathSeq analysis PathSeq analysis of TCGA samples to define Fn 2022 2011 R 2012 2007 Fn In vivo experiments Animal experiments have been carried out under the applicable laws and regulations approved by Animal Experimentation Ethics Committee of University of Luxembourg (UL) and the veterinarian service of the Ministry of Agriculture, Viniculture and Rural Development (Luxembourg, LUPA 2020/10 and 2024/14). The care and use of animals for research purposes at UL is performed according to the EU Directive 2010/63/EU, as well as the Grand-Ducal Regulation of 11 January 2013 on the protection of animals used for scientific purposes, including justification of the use of animals, their welfare and the incorporation of the principles of the 3Rs (Replacement, Reduction and Refinement). In vivo primary CRC model (Grivennikov et al, 2012 T2 fl/fl 8 Fn In vivo tail vein metastasis assay. Seven to eight-week-old in-house bred male and female nod scid gamma (Mus musculus NSG) mice were intravenously injected on the tail with 0.5 × 10 6 Ec Fn NSG mice were housed in AllenTown NexGen Mouse 500 cages (19.4 × 13.0 × 38.1 cm) with JRS Rehofix Corncob bedding, whereas germ-free CDX2-CreER T2 fl/fl Statistical analysis All statistical analyses as detailed in the figure legends were performed in R P S5 Supplementary information  Appendix Peer Review File Source data Fig. 1 Source data Fig. 2 Source data Fig. 3 Source data Fig. 4 Source data Fig. 5 Source data Fig. 6 These authors contributed equally: Jessica Karta, Marianne Meyers. Supplementary information Expanded view data, supplementary information, appendices are available for this paper at 10.1038/s44318-025-00542-w. Acknowledgements We thank the patients who kindly donated their samples and made this study possible. We gratefully acknowledge the contributions of the surgeons and nurses (not listed as co-authors) from the Centre Hospitalier Emile Mayrisch and the Hôpitaux Robert Schuman, as well as the teams from the Laboratoire National de Santé and the Clinical and Epidemiological Investigation Centre of the Luxembourg Institute of Health for their dedicated work with the patients. We also thank Prof. Dr. Michel Mittelbronn and the pathologists and macroscopy team from NCP/LNS. The authors would also like to thank their collaborators at the IBBL, Dr. Fay Betsou, Dr. Nikolai Goncharenko, Dr. Christelle Bahlawane, Amélie Gaignaux and Lamia Skhiri for the overall setup of the patient sample collection and the management of the cohort. We would also like to thank the whole team of the Animal Facility at the University of Luxembourg, especially our veterinarian Jennifer Behm and our facility manager Djalil Coowar. We would like to acknowledge the metabolomics platform at Luxembourg Institute of Health and specifically Dr. Nathalie Legrave and Francois Bernardin for their help with sample measurements. Finally, we would like to thank Professor Olivier de Wever for the kind gift of the CT5.3 fibroblasts, Prof. Daniel Slade for the donation of the pan-Fusobacterium membrane antiserum, and Prof. Emma Allen-Vercoe and her lab at the University of Guelph for generously providing the OMP Fn https://hpc.uni.lu https://biorender.com Author contributions Jessica Karta Marianne Meyers Fabien Rodriguez Eric Koncina Cedric Gilson Eliane Klein Monica Gabola Mohaned Benzarti Pau Pérez Escriva Jose Alberto Molina Tijeras Catarina Correia Tavares Bernardino Falk Ponath Anais Carpentier Mònica Aguilera Pujabet Maryse Schmoetten Mina Tsenkova Perla Saoud Anthoula Gaigneaux Dominik Ternes Lidia Alonso Nikolaus Zügel Eric Willemssen Philippe Koppes Daniel Léonard Luis Perez Casanova Serge Haan Michel Mittelbronn Johannes Meiser Vitaly I Pozdeev Jörg Vogel Paolo G Nuciforo Paul Wilmes Elisabeth Letellier Source data underlying figure panels in this paper may have individual authorship assigned. Where available, figure panel/source data authorship is listed in the following database record: biostudies:S-SCDT-10_1038-S44318-025-00542-w Data availability The RNA-Seq data generated and used in this study have been deposited at the European Genome-phenome Archive (EGA) under the accession numbers EGAD50000001614 EGAD00001010322 https://ega-archive.org/access/data-access The source data of this paper are collected in the following database record: biostudies:S-SCDT-10_1038-S44318-025-00542-w Disclosure and competing interests statement The authors declare no competing interests. Jörg Vogel is an editorial advisory board member. References Abed J Emgård JEM Zamir G Faroja M Almogy G Grenov A Sol A Naor R Pikarsky E Atlan KA Fap2 mediates Fusobacterium nucleatum Cell Host Microbe 2016 20 215 225 10.1016/j.chom.2016.07.006 27512904 PMC5465824 Abed J, Emgård JEM, Zamir G, Faroja M, Almogy G, Grenov A, Sol A, Naor R, Pikarsky E, Atlan KA et al (2016) Fap2 mediates Fusobacterium nucleatum 27512904 10.1016/j.chom.2016.07.006 PMC5465824 Andreatta M Carmona SJ UCell: robust and scalable single-cell gene signature scoring Comput Struct Biotechnol J 2021 19 3796 3798 10.1016/j.csbj.2021.06.043 34285779 PMC8271111 Andreatta M, Carmona SJ (2021) UCell: robust and scalable single-cell gene signature scoring. Comput Struct Biotechnol J 19:3796–3798 34285779 10.1016/j.csbj.2021.06.043 PMC8271111 Bankhead P Loughrey MB Fernández JA Dombrowski Y McArt DG Dunne PD McQuaid S Gray RT Murray LJ Coleman HG QuPath: open source software for digital pathology image analysis Sci Rep 2017 7 16878 10.1038/s41598-017-17204-5 29203879 PMC5715110 Bankhead P, Loughrey MB, Fernández JA, Dombrowski Y, McArt DG, Dunne PD, McQuaid S, Gray RT, Murray LJ, Coleman HG et al (2017) QuPath: open source software for digital pathology image analysis. Sci Rep 7:16878 29203879 10.1038/s41598-017-17204-5 PMC5715110 Benzarti M Neises L Oudin A Krötz C Viry E Gargiulo E Pulido C Schmoetten M Pozdeev V Lorenz NI PKM2 diverts glycolytic flux in dependence on mitochondrial one-carbon cycle Cell Rep 2024 43 113868 10.1016/j.celrep.2024.113868 38421868 Benzarti M, Neises L, Oudin A, Krötz C, Viry E, Gargiulo E, Pulido C, Schmoetten M, Pozdeev V, Lorenz NI et al (2024) PKM2 diverts glycolytic flux in dependence on mitochondrial one-carbon cycle. Cell Rep 43:113868 38421868 10.1016/j.celrep.2024.113868 Brennan CA Garrett WS Fusobacterium nucleatum—symbiont, opportunist and oncobacterium Nat Rev Microbiol 2019 17 156 166 10.1038/s41579-018-0129-6 30546113 PMC6589823 Brennan CA, Garrett WS (2019) Fusobacterium nucleatum—symbiont, opportunist and oncobacterium. Nat Rev Microbiol 17:156–166 30546113 10.1038/s41579-018-0129-6 PMC6589823 Caligiuri G Tuveson DA Activated fibroblasts in cancer: perspectives and challenges Cancer Cell 2023 41 434 449 10.1016/j.ccell.2023.02.015 36917949 PMC11022589 Caligiuri G, Tuveson DA (2023) Activated fibroblasts in cancer: perspectives and challenges. Cancer Cell 41:434–449 36917949 10.1016/j.ccell.2023.02.015 PMC11022589 Casasanta MA Yoo CC Udayasuryan B Sanders BE Umaña A Zhang Y Peng H Duncan AJ Wang Y Li L Fusobacterium nucleatum Sci Signal 2020 13 eaba9157 10.1126/scisignal.aba9157 32694172 PMC7454160 Casasanta MA, Yoo CC, Udayasuryan B, Sanders BE, Umaña A, Zhang Y, Peng H, Duncan AJ, Wang Y, Li L et al (2020) Fusobacterium nucleatum 32694172 10.1126/scisignal.aba9157 PMC7454160 Chen B Chan WN Xie F Mui CW Liu X Cheung AHK Lung RWM Chow C Zhang Z Fang C The molecular classification of cancer-associated fibroblasts on a pan-cancer single-cell transcriptional atlas Clin Transl Med 2023 13 e1516 10.1002/ctm2.1516 38148640 PMC10751516 Chen B, Chan WN, Xie F, Mui CW, Liu X, Cheung AHK, Lung RWM, Chow C, Zhang Z, Fang C et al (2023) The molecular classification of cancer-associated fibroblasts on a pan-cancer single-cell transcriptional atlas. Clin Transl Med 13:e1516 38148640 10.1002/ctm2.1516 PMC10751516 Chen Y Yu Z Lv M Cai Z Zou Y Lan P Wu X Gao F Cancer-associated fibroblasts impact the clinical outcome and treatment response in colorectal cancer via immune system modulation: a comprehensive genome-wide analysis Mol Med 2021 27 139 10.1186/s10020-021-00402-3 34717544 PMC8557584 Chen Y, Yu Z, Lv M, Cai Z, Zou Y, Lan P, Wu X, Gao F (2021) Cancer-associated fibroblasts impact the clinical outcome and treatment response in colorectal cancer via immune system modulation: a comprehensive genome-wide analysis. Mol Med 27:139 34717544 10.1186/s10020-021-00402-3 PMC8557584 Cheng R Choudhury D Liu C Billet S Hu T Bhowmick NA Gingival fibroblasts resist apoptosis in response to oxidative stress in a model of periodontal diseases Cell Death Discov 2015 1 1 8 10.1038/cddiscovery.2015.46 PMC4979524 27551475 Cheng R, Choudhury D, Liu C, Billet S, Hu T, Bhowmick NA (2015) Gingival fibroblasts resist apoptosis in response to oxidative stress in a model of periodontal diseases. Cell Death Discov 1:1–8 10.1038/cddiscovery.2015.46 PMC4979524 27551475 Chhabra Y Weeraratna AT Fibroblasts in cancer: unity in heterogeneity Cell 2023 186 1580 1609 10.1016/j.cell.2023.03.016 37059066 PMC11422789 Chhabra Y, Weeraratna AT (2023) Fibroblasts in cancer: unity in heterogeneity. Cell 186:1580–1609 37059066 10.1016/j.cell.2023.03.016 PMC11422789 Choi S-Y Sung R Lee S-J Lee T-G Kim N Yoon SM Lee EJ Chae HB Youn SJ Park SM Podoplanin, α-smooth muscle actin or S100A4 expressing cancer-associated fibroblasts are associated with different prognosis in colorectal cancers J Korean Med Sci 2013 28 1293 1301 10.3346/jkms.2013.28.9.1293 24015033 PMC3763102 Choi S-Y, Sung R, Lee S-J, Lee T-G, Kim N, Yoon SM, Lee EJ, Chae HB, Youn SJ, Park SM (2013) Podoplanin, α-smooth muscle actin or S100A4 expressing cancer-associated fibroblasts are associated with different prognosis in colorectal cancers. J Korean Med Sci 28:1293–1301 24015033 10.3346/jkms.2013.28.9.1293 PMC3763102 Elyada E Bolisetty M Laise P Flynn WF Courtois ET Burkhart RA Teinor JA Belleau P Biffi G Lucito MS Cross-species single-cell analysis of pancreatic ductal adenocarcinoma reveals antigen-presenting cancer-associated fibroblasts Cancer Discov 2019 9 1102 1123 10.1158/2159-8290.CD-19-0094 31197017 PMC6727976 Elyada E, Bolisetty M, Laise P, Flynn WF, Courtois ET, Burkhart RA, Teinor JA, Belleau P, Biffi G, Lucito MS et al (2019) Cross-species single-cell analysis of pancreatic ductal adenocarcinoma reveals antigen-presenting cancer-associated fibroblasts. Cancer Discov 9:1102–1123 31197017 10.1158/2159-8290.CD-19-0094 PMC6727976 Erdogan B Webb DJ Cancer-associated fibroblasts modulate growth factor signaling and extracellular matrix remodeling to regulate tumor metastasis Biochem Soc Trans 2017 45 229 236 10.1042/BST20160387 28202677 PMC5371349 Erdogan B, Webb DJ (2017) Cancer-associated fibroblasts modulate growth factor signaling and extracellular matrix remodeling to regulate tumor metastasis. Biochem Soc Trans 45:229–236 28202677 10.1042/BST20160387 PMC5371349 Foroutan M Bhuva DD Lyu R Horan K Cursons J Davis MJ Single sample scoring of molecular phenotypes BMC Bioinforma 2018 19 404 10.1186/s12859-018-2435-4 PMC6219008 30400809 Foroutan M, Bhuva DD, Lyu R, Horan K, Cursons J, Davis MJ (2018) Single sample scoring of molecular phenotypes. BMC Bioinforma 19:404 10.1186/s12859-018-2435-4 PMC6219008 30400809 Fullár A Dudás J Oláh L Hollósi P Papp Z Sobel G Karászi K Paku S Baghy K Kovalszky I Remodeling of extracellular matrix by normal and tumor-associated fibroblasts promotes cervical cancer progression BMC Cancer 2015 15 256 10.1186/s12885-015-1272-3 25885552 PMC4409756 Fullár A, Dudás J, Oláh L, Hollósi P, Papp Z, Sobel G, Karászi K, Paku S, Baghy K, Kovalszky I (2015) Remodeling of extracellular matrix by normal and tumor-associated fibroblasts promotes cervical cancer progression. BMC Cancer 15:256 25885552 10.1186/s12885-015-1272-3 PMC4409756 Grivennikov SI Wang K Mucida D Stewart CA Schnabl B Jauch D Taniguchi K Yu G-Y Österreicher CH Hung KE Adenoma-linked barrier defects and microbial products drive IL-23/IL-17-mediated tumour growth Nature 2012 491 254 258 10.1038/nature11465 23034650 PMC3601659 Grivennikov SI, Wang K, Mucida D, Stewart CA, Schnabl B, Jauch D, Taniguchi K, Yu G-Y, Österreicher CH, Hung KE et al (2012) Adenoma-linked barrier defects and microbial products drive IL-23/IL-17-mediated tumour growth. Nature 491:254–258 23034650 10.1038/nature11465 PMC3601659 Guinney J Dienstmann R Wang X De Reyniès A Schlicker A Soneson C Marisa L Roepman P Nyamundanda G Angelino P The consensus molecular subtypes of colorectal cancer Nat Med 2015 21 1350 1356 10.1038/nm.3967 26457759 PMC4636487 Guinney J, Dienstmann R, Wang X, De Reyniès A, Schlicker A, Soneson C, Marisa L, Roepman P, Nyamundanda G, Angelino P et al (2015) The consensus molecular subtypes of colorectal cancer. Nat Med 21:1350–1356 26457759 10.1038/nm.3967 PMC4636487 Gur C Ibrahim Y Isaacson B Yamin R Abed J Gamliel M Enk J Bar-On Y Stanietsky-Kaynan N Coppenhagen-Glazer S Binding of the Fap2 protein of Fusobacterium nucleatum Immunity 2015 42 344 355 10.1016/j.immuni.2015.01.010 25680274 PMC4361732 Gur C, Ibrahim Y, Isaacson B, Yamin R, Abed J, Gamliel M, Enk J, Bar-On Y, Stanietsky-Kaynan N, Coppenhagen-Glazer S et al (2015) Binding of the Fap2 protein of Fusobacterium nucleatum 25680274 10.1016/j.immuni.2015.01.010 PMC4361732 Gur C Maalouf N Shhadeh A Berhani O Singer BB Bachrach G Mandelboim O Fusobacterium nucleatum OncoImmunology 2019 8 e1581531 10.1080/2162402X.2019.1581531 31069151 PMC6492956 Gur C, Maalouf N, Shhadeh A, Berhani O, Singer BB, Bachrach G, Mandelboim O (2019) Fusobacterium nucleatum 31069151 10.1080/2162402X.2019.1581531 PMC6492956 Hayashi M Ikenaga N Nakata K Luo H Zhong P Date S Oyama K Higashijima N Kubo A Iwamoto C Intratumor Fusobacterium nucleatum Cancer Sci 2023 114 3666 3678 10.1111/cas.15901 37438965 PMC10475786 Hayashi M, Ikenaga N, Nakata K, Luo H, Zhong P, Date S, Oyama K, Higashijima N, Kubo A, Iwamoto C et al (2023) Intratumor Fusobacterium nucleatum 37438965 10.1111/cas.15901 PMC10475786 Isella C Brundu F Bellomo SE Galimi F Zanella E Porporato R Petti C Fiori A Orzan F Senetta R Selective analysis of cancer-cell intrinsic transcriptional traits defines novel clinically relevant subtypes of colorectal cancer Nat Commun 2017 8 15107 10.1038/ncomms15107 28561063 PMC5499209 Isella C, Brundu F, Bellomo SE, Galimi F, Zanella E, Porporato R, Petti C, Fiori A, Orzan F, Senetta R et al (2017) Selective analysis of cancer-cell intrinsic transcriptional traits defines novel clinically relevant subtypes of colorectal cancer. Nat Commun 8:15107 28561063 10.1038/ncomms15107 PMC5499209 Jain M Rivera S Monclus EA Synenki L Zirk A Eisenbart J Feghali-Bostwick C Mutlu GM Budinger GRS Chandel NS Mitochondrial reactive oxygen species regulate transforming growth factor-β signaling J Biol Chem 2013 288 770 777 10.1074/jbc.M112.431973 23204521 PMC3543026 Jain M, Rivera S, Monclus EA, Synenki L, Zirk A, Eisenbart J, Feghali-Bostwick C, Mutlu GM, Budinger GRS, Chandel NS (2013) Mitochondrial reactive oxygen species regulate transforming growth factor-β signaling. J Biol Chem 288:770–777 23204521 10.1074/jbc.M112.431973 PMC3543026 Jenkins BH Tracy I Rodrigues MFSD Smith MJL Martinez BR Edmond M Mahadevan S Rao A Zong H Liu K Single cell and spatial analysis of immune-hot and immune-cold tumours identifies fibroblast subtypes associated with distinct immunological niches and positive immunotherapy response Mol Cancer 2025 24 3 10.1186/s12943-024-02191-9 39757146 PMC11702232 Jenkins BH, Tracy I, Rodrigues MFSD, Smith MJL, Martinez BR, Edmond M, Mahadevan S, Rao A, Zong H, Liu K et al (2025) Single cell and spatial analysis of immune-hot and immune-cold tumours identifies fibroblast subtypes associated with distinct immunological niches and positive immunotherapy response. Mol Cancer 24:3 39757146 10.1186/s12943-024-02191-9 PMC11702232 Johnson WE Li C Rabinovic A Adjusting batch effects in microarray expression data using empirical Bayes methods Biostatistics 2007 8 118 127 10.1093/biostatistics/kxj037 16632515 Johnson WE, Li C, Rabinovic A (2007) Adjusting batch effects in microarray expression data using empirical Bayes methods. Biostatistics 8:118–127 16632515 10.1093/biostatistics/kxj037 Joshi RS Kanugula SS Sudhir S Pereira MP Jain S Aghi MK The role of cancer-associated fibroblasts in tumor progression Cancers 2021 13 1399 10.3390/cancers13061399 33808627 PMC8003545 Joshi RS, Kanugula SS, Sudhir S, Pereira MP, Jain S, Aghi MK (2021) The role of cancer-associated fibroblasts in tumor progression. Cancers 13:1399 33808627 10.3390/cancers13061399 PMC8003545 Kalluri R The biology and function of fibroblasts in cancer Nat Rev Cancer 2016 16 582 598 10.1038/nrc.2016.73 27550820 Kalluri R (2016) The biology and function of fibroblasts in cancer. Nat Rev Cancer 16:582–598 27550820 10.1038/nrc.2016.73 Kang W Jia Z Tang D Zhang Z Gao H He K Feng Q Fusobacterium nucleatum κ Oxid Med Cell Longev 2019 2019 1 22 10.1155/2019/7810320 PMC6815639 31737164 Kang W, Jia Z, Tang D, Zhang Z, Gao H, He K, Feng Q (2019) Fusobacterium nucleatum κ 10.1155/2019/1681972 PMC6815639 31737164 Kaplan A Kaplan CW He X McHardy I Shi W Lux R Characterization of aid1, a novel gene involved in Fusobacterium nucleatum Micro Ecol 2014 68 379 387 10.1007/s00248-014-0400-y PMC4104215 24643713 Kaplan A, Kaplan CW, He X, McHardy I, Shi W, Lux R (2014) Characterization of aid1, a novel gene involved in Fusobacterium nucleatum 10.1007/s00248-014-0400-y PMC4104215 24643713 Karta J Bossicard Y Kotzamanis K Dolznig H Letellier E Mapping the metabolic networks of tumor cells and cancer-associated fibroblasts Cells 2021 10 304 10.3390/cells10020304 33540679 PMC7912987 Karta J, Bossicard Y, Kotzamanis K, Dolznig H, Letellier E (2021) Mapping the metabolic networks of tumor cells and cancer-associated fibroblasts. Cells 10:304 33540679 10.3390/cells10020304 PMC7912987 Khaliq AM Erdogan C Kurt Z Turgut SS Grunvald MW Rand T Khare S Borgia JA Hayden DM Pappas SG Refining colorectal cancer classification and clinical stratification through a single-cell atlas Genome Biol 2022 23 113 10.1186/s13059-022-02677-z 35538548 PMC9092724 Khaliq AM, Erdogan C, Kurt Z, Turgut SS, Grunvald MW, Rand T, Khare S, Borgia JA, Hayden DM, Pappas SG et al (2022) Refining colorectal cancer classification and clinical stratification through a single-cell atlas. Genome Biol 23:113 35538548 10.1186/s13059-022-02677-z PMC9092724 Kharaishvili G Simkova D Bouchalova K Gachechiladze M Narsia N Bouchal J The role of cancer-associated fibroblasts, solid stress and other microenvironmental factors in tumor progression and therapy resistance Cancer Cell Int 2014 14 41 10.1186/1475-2867-14-41 24883045 PMC4038849 Kharaishvili G, Simkova D, Bouchalova K, Gachechiladze M, Narsia N, Bouchal J (2014) The role of cancer-associated fibroblasts, solid stress and other microenvironmental factors in tumor progression and therapy resistance. Cancer Cell Int 14:41 24883045 10.1186/1475-2867-14-41 PMC4038849 Kojima Y Acar A Eaton EN Mellody KT Scheel C Ben-Porath I Onder TT Wang ZC Richardson AL Weinberg RA Autocrine TGF-β and stromal cell-derived factor-1 (SDF-1) signaling drives the evolution of tumor-promoting mammary stromal myofibroblasts Proc Natl Acad Sci USA 2010 107 20009 20014 10.1073/pnas.1013805107 21041659 PMC2993333 Kojima Y, Acar A, Eaton EN, Mellody KT, Scheel C, Ben-Porath I, Onder TT, Wang ZC, Richardson AL, Weinberg RA et al (2010) Autocrine TGF-β and stromal cell-derived factor-1 (SDF-1) signaling drives the evolution of tumor-promoting mammary stromal myofibroblasts. Proc Natl Acad Sci USA 107:20009–20014 21041659 10.1073/pnas.1013805107 PMC2993333 Koncina E Nurmik M Pozdeev VI Gilson C Tsenkova M Begaj R Stang S Gaigneaux A Weindorfer C Rodriguez F IL1R1+ cancer-associated fibroblasts drive tumor development and immunosuppression in colorectal cancer Nat Commun 2023 14 4251 10.1038/s41467-023-39953-w 37460545 PMC10352362 Koncina E, Nurmik M, Pozdeev VI, Gilson C, Tsenkova M, Begaj R, Stang S, Gaigneaux A, Weindorfer C, Rodriguez F et al (2023) IL1R1+ cancer-associated fibroblasts drive tumor development and immunosuppression in colorectal cancer. Nat Commun 14:4251 37460545 10.1038/s41467-023-39953-w PMC10352362 Kong L Schäfer G Bu H Zhang Y Zhang Y Klocker H Lamin A/C protein is overexpressed in tissue-invading prostate cancer and promotes prostate cancer cell growth, migration and invasion through the PI3K/AKT/PTEN pathway Carcinogenesis 2012 33 751 759 10.1093/carcin/bgs022 22301279 Kong L, Schäfer G, Bu H, Zhang Y, Zhang Y, Klocker H (2012) Lamin A/C protein is overexpressed in tissue-invading prostate cancer and promotes prostate cancer cell growth, migration and invasion through the PI3K/AKT/PTEN pathway. Carcinogenesis 33:751–759 22301279 10.1093/carcin/bgs022 Kostic AD Chun E Robertson L Glickman JN Gallini CA Michaud M Clancy TE Chung DC Lochhead P Hold GL Fusobacterium nucleatum Cell Host Microbe 2013 14 207 215 10.1016/j.chom.2013.07.007 23954159 PMC3772512 Kostic AD, Chun E, Robertson L, Glickman JN, Gallini CA, Michaud M, Clancy TE, Chung DC, Lochhead P, Hold GL et al (2013) Fusobacterium nucleatum 23954159 10.1016/j.chom.2013.07.007 PMC3772512 Kostic AD Gevers D Pedamallu CS Michaud M Duke F Earl AM Ojesina AI Jung J Bass AJ Tabernero J Genomic analysis identifies association of Fusobacterium Genome Res 2012 22 292 298 10.1101/gr.126573.111 22009990 PMC3266036 Kostic AD, Gevers D, Pedamallu CS, Michaud M, Duke F, Earl AM, Ojesina AI, Jung J, Bass AJ, Tabernero J et al (2012) Genomic analysis identifies association of Fusobacterium 22009990 10.1101/gr.126573.111 PMC3266036 Kostic AD Ojesina AI Pedamallu CS Jung J Verhaak RGW Getz G Meyerson M PathSeq: software to identify or discover microbes by deep sequencing of human tissue Nat Biotechnol 2011 29 393 396 10.1038/nbt.1868 21552235 PMC3523678 Kostic AD, Ojesina AI, Pedamallu CS, Jung J, Verhaak RGW, Getz G, Meyerson M (2011) PathSeq: software to identify or discover microbes by deep sequencing of human tissue. Nat Biotechnol 29:393–396 21552235 10.1038/nbt.1868 PMC3523678 Lakins MA Ghorani E Munir H Martins CP Shields JD Cancer-associated fibroblasts induce antigen-specific deletion of CD8 + T Cells to protect tumour cells Nat Commun 2018 9 948 10.1038/s41467-018-03347-0 29507342 PMC5838096 Lakins MA, Ghorani E, Munir H, Martins CP, Shields JD (2018) Cancer-associated fibroblasts induce antigen-specific deletion of CD8 + T Cells to protect tumour cells. Nat Commun 9:948 29507342 10.1038/s41467-018-03347-0 PMC5838096 Lam CS-C Cheung AH-K Wong SK-M Wan TM-H Ng L Chow AK-M Cheng NS-M Pak RC-H Li H-S Man JH-W Prognostic significance of CD26 in patients with colorectal cancer PLoS ONE 2014 9 e98582 10.1371/journal.pone.0098582 24870408 PMC4037185 Lam CS-C, Cheung AH-K, Wong SK-M, Wan TM-H, Ng L, Chow AK-M, Cheng NS-M, Pak RC-H, Li H-S, Man JH-W et al (2014) Prognostic significance of CD26 in patients with colorectal cancer. PLoS ONE 9:e98582 24870408 10.1371/journal.pone.0098582 PMC4037185 Lee H-O Hong Y Etlioglu HE Cho YB Pomella V Van den Bosch B Vanhecke J Verbandt S Hong H Min J-W Lineage-dependent gene expression programs influence the immune landscape of colorectal cancer Nat Genet 2020 52 594 603 10.1038/s41588-020-0636-z 32451460 Lee H-O, Hong Y, Etlioglu HE, Cho YB, Pomella V, Van den Bosch B, Vanhecke J, Verbandt S, Hong H, Min J-W et al (2020) Lineage-dependent gene expression programs influence the immune landscape of colorectal cancer. Nat Genet 52:594–603 32451460 10.1038/s41588-020-0636-z Leek JT Johnson WE Parker HS Jaffe AE Storey JD The sva package for removing batch effects and other unwanted variation in high-throughput experiments Bioinformatics 2012 28 882 883 10.1093/bioinformatics/bts034 22257669 PMC3307112 Leek JT, Johnson WE, Parker HS, Jaffe AE, Storey JD (2012) The sva package for removing batch effects and other unwanted variation in high-throughput experiments. Bioinformatics 28:882–883 22257669 10.1093/bioinformatics/bts034 PMC3307112 Lescaille G Menashi S Cavelier-Balloy B Khayati F Quemener C Podgorniak MP Naïmi B Calvo F Lebbe C Mourah S EMMPRIN/CD147 up-regulates urokinase-type plasminogen activator: implications in oral tumor progression BMC Cancer 2012 12 115 10.1186/1471-2407-12-115 22443116 PMC3342905 Lescaille G, Menashi S, Cavelier-Balloy B, Khayati F, Quemener C, Podgorniak MP, Naïmi B, Calvo F, Lebbe C, Mourah S (2012) EMMPRIN/CD147 up-regulates urokinase-type plasminogen activator: implications in oral tumor progression. BMC Cancer 12:115 22443116 10.1186/1471-2407-12-115 PMC3342905 Li E, Cheung HC, Ma S (2024) CTHRC1+ fibroblasts and SPP1+ macrophages synergistically contribute to pro-tumorigenic tumor microenvironment in pancreatic ductal adenocarcinoma. Sci Rep 14:17412 10.1038/s41598-024-68109-z PMC11286765 39075108 Li X Fang P Mai J Choi ET Wang H Yang X Targeting mitochondrial reactive oxygen species as novel therapy for inflammatory diseases and cancers J Hematol Oncol 2013 6 19 10.1186/1756-8722-6-19 23442817 PMC3599349 Li X, Fang P, Mai J, Choi ET, Wang H, Yang X (2013) Targeting mitochondrial reactive oxygen species as novel therapy for inflammatory diseases and cancers. J Hematol Oncol 6:19 23442817 10.1186/1756-8722-6-19 PMC3599349 Li X Xu Q Wu Y Li J Tang D Han L Fan Q A CCL2/ROS autoregulation loop is critical for cancer-associated fibroblasts-enhanced tumor growth of oral squamous cell carcinoma Carcinogenesis 2014 35 1362 1370 10.1093/carcin/bgu046 24531940 Li X, Xu Q, Wu Y, Li J, Tang D, Han L, Fan Q (2014) A CCL2/ROS autoregulation loop is critical for cancer-associated fibroblasts-enhanced tumor growth of oral squamous cell carcinoma. Carcinogenesis 35:1362–1370 24531940 10.1093/carcin/bgu046 Liang M Liu Y Zhang Z Yang H Dai N Zhang N Sun W Guo Y Kong J Wang X Fusobacterium nucleatum Ann Med 2022 54 989 1003 10.1080/07853890.2022.2061045 35435776 PMC9891225 Liang M, Liu Y, Zhang Z, Yang H, Dai N, Zhang N, Sun W, Guo Y, Kong J, Wang X et al (2022) Fusobacterium nucleatum 35435776 10.1080/07853890.2022.2061045 PMC9891225 Lichtenstern CR Ngu RK Shalapour S Karin M Immunotherapy, inflammation and colorectal cancer Cells 2020 9 618 10.3390/cells9030618 32143413 PMC7140520 Lichtenstern CR, Ngu RK, Shalapour S, Karin M (2020) Immunotherapy, inflammation and colorectal cancer. Cells 9:618 32143413 10.3390/cells9030618 PMC7140520 Liu P-F Shi W Zhu W Smith JW Hsieh S-L Gallo RL Huang C-M Vaccination targeting surface FomA of Fusobacterium nucleatum Vaccine 2010 28 3496 3505 10.1016/j.vaccine.2010.02.047 20189489 PMC2855893 Liu P-F, Shi W, Zhu W, Smith JW, Hsieh S-L, Gallo RL, Huang C-M (2010) Vaccination targeting surface FomA of Fusobacterium nucleatum 20189489 10.1016/j.vaccine.2010.02.047 PMC2855893 Lv T Zhao Y Jiang X Yuan H Wang H Cui X Xu J Zhao J Wang J uPAR: an essential factor for tumor development J Cancer 2021 12 7026 7040 10.7150/jca.62281 34729105 PMC8558663 Lv T, Zhao Y, Jiang X, Yuan H, Wang H, Cui X, Xu J, Zhao J, Wang J (2021) uPAR: an essential factor for tumor development. J Cancer 12:7026–7040 34729105 10.7150/jca.62281 PMC8558663 Ma X Sun T Zhou J Zhi M Shen S Wang Y Gu X Li Z Gao H Wang P Pangenomic study of Fusobacterium nucleatum Microbiol Spectr 2023 11 e05184 22 10.1128/spectrum.05184-22 37042769 PMC10269558 Ma X, Sun T, Zhou J, Zhi M, Shen S, Wang Y, Gu X, Li Z, Gao H, Wang P et al (2023) Pangenomic study of Fusobacterium nucleatum 37042769 10.1128/spectrum.05184-22 PMC10269558 Metzger Z Blasbalg J Dotan M Weiss EI Enhanced attachment of Porphyromonas gingivalis Fusobacterium nucleatum J Endod 2009 35 82 85 10.1016/j.joen.2008.10.011 19084131 Metzger Z, Blasbalg J, Dotan M, Weiss EI (2009) Enhanced attachment of Porphyromonas gingivalis Fusobacterium nucleatum 19084131 10.1016/j.joen.2008.10.011 Mima K Nishihara R Qian ZR Cao Y Sukawa Y Nowak JA Yang J Dou R Masugi Y Song M Fusobacterium nucleatum Gut 2016 65 1973 1980 10.1136/gutjnl-2015-310101 26311717 PMC4769120 Mima K, Nishihara R, Qian ZR, Cao Y, Sukawa Y, Nowak JA, Yang J, Dou R, Masugi Y, Song M et al (2016) Fusobacterium nucleatum 26311717 10.1136/gutjnl-2015-310101 PMC4769120 Mishra P Banerjee D Ben-Baruch A Chemokines at the crossroads of tumor-fibroblast interactions that promote malignancy J Leukoc Biol 2010 89 31 39 10.1189/jlb.0310182 20628066 Mishra P, Banerjee D, Ben-Baruch A (2010) Chemokines at the crossroads of tumor-fibroblast interactions that promote malignancy. J Leukoc Biol 89:31–39 20628066 10.1189/jlb.0310182 Nicolas AM Pesic M Engel E Ziegler PK Diefenhardt M Kennel KB Buettner F Conche C Petrocelli V Elwakeel E Inflammatory fibroblasts mediate resistance to neoadjuvant therapy in rectal cancer Cancer Cell 2022 40 168 184.e13 10.1016/j.ccell.2022.01.004 35120600 Nicolas AM, Pesic M, Engel E, Ziegler PK, Diefenhardt M, Kennel KB, Buettner F, Conche C, Petrocelli V, Elwakeel E et al (2022) Inflammatory fibroblasts mediate resistance to neoadjuvant therapy in rectal cancer. Cancer Cell 40:168–184.e13 35120600 10.1016/j.ccell.2022.01.004 Norton J Foster D Chinta M Titan A Longaker M Pancreatic cancer associated fibroblasts (CAF): under-explored target for pancreatic cancer treatment Cancers 2020 12 1347 10.3390/cancers12051347 32466266 PMC7281461 Norton J, Foster D, Chinta M, Titan A, Longaker M (2020) Pancreatic cancer associated fibroblasts (CAF): under-explored target for pancreatic cancer treatment. Cancers 12:1347 32466266 10.3390/cancers12051347 PMC7281461 Nurmik M Ullmann P Rodriguez F Haan S Letellier E In search of definitions: Cancer‐associated fibroblasts and their markers Int J Cancer 2020 146 895 905 10.1002/ijc.32193 30734283 PMC6972582 Nurmik M, Ullmann P, Rodriguez F, Haan S, Letellier E (2020) In search of definitions: Cancer‐associated fibroblasts and their markers. Int J Cancer 146:895–905 30734283 10.1002/ijc.32193 PMC6972582 Öhlund D Handly-Santana A Biffi G Elyada E Almeida AS Ponz-Sarvise M Corbo V Oni TE Hearn SA Lee EJ Distinct populations of inflammatory fibroblasts and myofibroblasts in pancreatic cancer J Exp Med 2017 214 579 596 10.1084/jem.20162024 28232471 PMC5339682 Öhlund D, Handly-Santana A, Biffi G, Elyada E, Almeida AS, Ponz-Sarvise M, Corbo V, Oni TE, Hearn SA, Lee EJ et al (2017) Distinct populations of inflammatory fibroblasts and myofibroblasts in pancreatic cancer. J Exp Med 214:579–596 28232471 10.1084/jem.20162024 PMC5339682 Park MY, Eslick GD (2019) Infectious organisms associated with colorectal cancer. In: Gastrointestinal diseases and their associated infections, Eslick GD (ed). pp 113–124. Elsevier Pelka K Hofree M Chen JH Sarkizova S Pirl JD Jorgji V Bejnood A Dionne D Ge WH Xu KH Spatially organized multicellular immune hubs in human colorectal cancer Cell 2021 184 4734 4752.e20 10.1016/j.cell.2021.08.003 34450029 PMC8772395 Pelka K, Hofree M, Chen JH, Sarkizova S, Pirl JD, Jorgji V, Bejnood A, Dionne D, Ge WH, Xu KH et al (2021) Spatially organized multicellular immune hubs in human colorectal cancer. Cell 184:4734–4752.e20 34450029 10.1016/j.cell.2021.08.003 PMC8772395 Pietzke M Vazquez A Metabolite AutoPlotter—an application to process and visualise metabolite data in the web browser Cancer Metab 2020 8 15 10.1186/s40170-020-00220-x 32670572 PMC7350678 Pietzke M, Vazquez A (2020) Metabolite AutoPlotter—an application to process and visualise metabolite data in the web browser. Cancer Metab 8:15 32670572 10.1186/s40170-020-00220-x PMC7350678 Ponath F Zhu Y Cosi V Vogel J Expanding the genetic toolkit helps dissect a global stress response in the early-branching species Fusobacterium nucleatum Proc Natl Acad Sci USA 2022 119 e2201460119 10.1073/pnas.2201460119 36161895 PMC9546586 Ponath F, Zhu Y, Cosi V, Vogel J (2022) Expanding the genetic toolkit helps dissect a global stress response in the early-branching species Fusobacterium nucleatum 36161895 10.1073/pnas.2201460119 PMC9546586 Ponath F et al (2021) RNA landscape of the emerging cancer-associated microbe Fusobacterium nucleatum. Nat Microbiol 6:1007–1020 10.1038/s41564-021-00927-7 34239075 Qureshi-Baig K Ullmann P Haan S Letellier E Tumor-initiating cells: a criTICal review of isolation approaches and new challenges in targeting strategies Mol Cancer 2017 16 40 10.1186/s12943-017-0602-2 28209178 PMC5314476 Qureshi-Baig K, Ullmann P, Haan S, Letellier E (2017) Tumor-initiating cells: a criTICal review of isolation approaches and new challenges in targeting strategies. Mol Cancer 16:40 28209178 10.1186/s12943-017-0602-2 PMC5314476 Qureshi-Baig K Ullmann P Rodriguez F Frasquilho S Nazarov PV Haan S Letellier E What do we learn from spheroid culture systems? Insights from tumorspheres derived from primary colon cancer tissue PLoS ONE 2016 11 e0146052 10.1371/journal.pone.0146052 26745821 PMC4706382 Qureshi-Baig K, Ullmann P, Rodriguez F, Frasquilho S, Nazarov PV, Haan S, Letellier E (2016) What do we learn from spheroid culture systems? Insights from tumorspheres derived from primary colon cancer tissue. PLoS ONE 11:e0146052 26745821 10.1371/journal.pone.0146052 PMC4706382 Rath-Deschner B Memmert S Damanaki A Nokhbehsaim M Eick S Cirelli JA Götz W Deschner J Jäger A Nogueira AVB CXCL1, CCL2, and CCL5 modulation by microbial and biomechanical signals in periodontal cells and tissues—in vitro and in vivo studies Clin Oral Invest 2020 24 3661 3670 10.1007/s00784-020-03244-1 32124070 Rath-Deschner B, Memmert S, Damanaki A, Nokhbehsaim M, Eick S, Cirelli JA, Götz W, Deschner J, Jäger A, Nogueira AVB (2020) CXCL1, CCL2, and CCL5 modulation by microbial and biomechanical signals in periodontal cells and tissues—in vitro and in vivo studies. Clin Oral Invest 24:3661–3670 10.1007/s00784-020-03244-1 32124070 Robinson W Stone JK Schischlik F Gasmi B Kelly MC Seibert C Dadkhah K Gertz EM Lee JS Zhu K Identification of intracellular bacteria from multiple single-cell RNA-seq platforms using CSI-Microbes Sci Adv 2024 10 eadj7402 10.1126/sciadv.adj7402 38959321 PMC11221508 Robinson W, Stone JK, Schischlik F, Gasmi B, Kelly MC, Seibert C, Dadkhah K, Gertz EM, Lee JS, Zhu K et al (2024) Identification of intracellular bacteria from multiple single-cell RNA-seq platforms using CSI-Microbes. Sci Adv 10:eadj7402 38959321 10.1126/sciadv.adj7402 PMC11221508 Rossano F Rizzo A Sanges MR Cipollaro De L’Ero G Tufano MA Human monocytes and gingival fibroblasts release tumor necrosis factor-α, interleukin-1α and interleukin-6 in response to particulate and soluble fractions of Prevotella melaninogenica Fusobacterium nucleatum Int J Clin Lab Res 1993 23 165 168 10.1007/BF02592303 8400338 Rossano F, Rizzo A, Sanges MR, Cipollaro De L’Ero G, Tufano MA (1993) Human monocytes and gingival fibroblasts release tumor necrosis factor-α, interleukin-1α and interleukin-6 in response to particulate and soluble fractions of Prevotella melaninogenica Fusobacterium nucleatum 8400338 10.1007/BF02592303 Rubinstein MR Wang X Liu W Hao Y Cai G Han YW Fusobacterium nucleatum Cell Host Microbe 2013 14 195 206 10.1016/j.chom.2013.07.012 23954158 PMC3770529 Rubinstein MR, Wang X, Liu W, Hao Y, Cai G, Han YW (2013) Fusobacterium nucleatum 23954158 10.1016/j.chom.2013.07.012 PMC3770529 Salvucci M, Crawford N, Stott K, Bullman S, Longley DB, Prehn JHM (2022) Patients with mesenchymal tumours and high Fusobacteriales 10.1136/gutjnl-2021-325193 PMC9279747 34497144 Slade DJ New roles for Fusobacterium nucleatum Trends Cancer 2021 7 185 187 10.1016/j.trecan.2020.11.006 33309240 Slade DJ (2021) New roles for Fusobacterium nucleatum 33309240 10.1016/j.trecan.2020.11.006 Stadler S Nguyen CH Schachner H Milovanovic D Holzner S Brenner S Eichsteininger J Stadler M Senfter D Krenn L Colon cancer cell-derived 12(S)-HETE induces the retraction of cancer-associated fibroblast via MLC2, RHO/ROCK and Ca2+ signalling Cell Mol Life Sci 2017 74 1907 1921 10.1007/s00018-016-2441-5 28013338 PMC5390003 Stadler S, Nguyen CH, Schachner H, Milovanovic D, Holzner S, Brenner S, Eichsteininger J, Stadler M, Senfter D, Krenn L et al (2017) Colon cancer cell-derived 12(S)-HETE induces the retraction of cancer-associated fibroblast via MLC2, RHO/ROCK and Ca2+ signalling. Cell Mol Life Sci 74:1907–1921 28013338 10.1007/s00018-016-2441-5 PMC5390003 Stephens M False discovery rates: a new deal Biostatistics 2017 18 275 294 27756721 10.1093/biostatistics/kxw041 PMC5379932 Stephens M (2017) False discovery rates: a new deal. Biostatistics 18:275–294 27756721 10.1093/biostatistics/kxw041 PMC5379932 Strauss J Kaplan GG Beck PL Rioux K Panaccione R DeVinney R Lynch T Allen-Vercoe E Invasive potential of gut mucosa-derived Fusobacterium nucleatum Inflamm Bowel Dis 2011 17 1971 1978 10.1002/ibd.21606 21830275 Strauss J, Kaplan GG, Beck PL, Rioux K, Panaccione R, DeVinney R, Lynch T, Allen-Vercoe E (2011) Invasive potential of gut mucosa-derived Fusobacterium nucleatum 21830275 10.1002/ibd.21606 Tahara T Yamamoto E Suzuki H Maruyama R Chung W Garriga J Jelinek J Yamano H Sugai T An B Fusobacterium Cancer Res 2014 74 1311 1318 10.1158/0008-5472.CAN-13-1865 24385213 PMC4396185 Tahara T, Yamamoto E, Suzuki H, Maruyama R, Chung W, Garriga J, Jelinek J, Yamano H, Sugai T, An B et al (2014) Fusobacterium 24385213 10.1158/0008-5472.CAN-13-1865 PMC4396185 Takahashi H Sakakura K Kawabata-Iwakawa R Rokudai S Toyoda M Nishiyama M Chikamatsu K Immunosuppressive activity of cancer-associated fibroblasts in head and neck squamous cell carcinoma Cancer Immunol Immunother 2015 64 1407 1417 10.1007/s00262-015-1742-0 26201938 PMC11029788 Takahashi H, Sakakura K, Kawabata-Iwakawa R, Rokudai S, Toyoda M, Nishiyama M, Chikamatsu K (2015) Immunosuppressive activity of cancer-associated fibroblasts in head and neck squamous cell carcinoma. Cancer Immunol Immunother 64:1407–1417 26201938 10.1007/s00262-015-1742-0 PMC11029788 Ternes D Karta J Tsenkova M Wilmes P Haan S Letellier E Microbiome in colorectal cancer: how to get from meta-omics to mechanism? Trends Microbiol 2020 28 401 423 10.1016/j.tim.2020.01.001 32298617 Ternes D, Karta J, Tsenkova M, Wilmes P, Haan S, Letellier E (2020) Microbiome in colorectal cancer: how to get from meta-omics to mechanism? Trends Microbiol 28:401–423 32298617 10.1016/j.tim.2020.01.001 Ternes D Tsenkova M Pozdeev VI Meyers M Koncina E Atatri S Schmitz M Karta J Schmoetten M Heinken A The gut microbial metabolite formate exacerbates colorectal cancer progression Nat Metab 2022 4 458 475 10.1038/s42255-022-00558-0 35437333 PMC9046088 Ternes D, Tsenkova M, Pozdeev VI, Meyers M, Koncina E, Atatri S, Schmitz M, Karta J, Schmoetten M, Heinken A et al (2022) The gut microbial metabolite formate exacerbates colorectal cancer progression. Nat Metab 4:458–475 35437333 10.1038/s42255-022-00558-0 PMC9046088 Tsujino T Seshimo I Yamamoto H Ngan CY Ezumi K Takemasa I Ikeda M Sekimoto M Matsuura N Monden M Stromal myofibroblasts predict disease recurrence for colorectal cancer Clin Cancer Res 2007 13 2082 2090 10.1158/1078-0432.CCR-06-2191 17404090 Tsujino T, Seshimo I, Yamamoto H, Ngan CY, Ezumi K, Takemasa I, Ikeda M, Sekimoto M, Matsuura N, Monden M (2007) Stromal myofibroblasts predict disease recurrence for colorectal cancer. Clin Cancer Res 13:2082–2090 17404090 10.1158/1078-0432.CCR-06-2191 Urciuoli E D’Oria V Petrini S Peruzzi B Lamin A/C mechanosensor drives tumor cell aggressiveness and adhesion on substrates with tissue-specific elasticity Front Cell Dev Biol 2021 9 712377 10.3389/fcell.2021.712377 34595168 PMC8476891 Urciuoli E, D’Oria V, Petrini S, Peruzzi B (2021) Lamin A/C mechanosensor drives tumor cell aggressiveness and adhesion on substrates with tissue-specific elasticity. Front Cell Dev Biol 9:712377 34595168 10.3389/fcell.2021.712377 PMC8476891 Wang D Li L Zhang Y Ye K Lipopolysaccharide-educated cancer-associated fibroblasts facilitate malignant progression of ovarian cancer cells via the NF-kB/IL-6/JAK2 signal transduction Mol Biotechnol 2025 67 317 328 10.1007/s12033-024-01055-3 38305842 Wang D, Li L, Zhang Y, Ye K (2025) Lipopolysaccharide-educated cancer-associated fibroblasts facilitate malignant progression of ovarian cancer cells via the NF-kB/IL-6/JAK2 signal transduction. Mol Biotechnol 67:317–328 38305842 10.1007/s12033-024-01055-3 Weiss AS Burrichter AG Durai Raj AC von Strempel A Meng C Kleigrewe K Münch PC Rössler L Huber C Eisenreich W In vitro interaction network of a synthetic gut bacterial community ISME J 2022 16 1095 1109 10.1038/s41396-021-01153-z 34857933 PMC8941000 Weiss AS, Burrichter AG, Durai Raj AC, von Strempel A, Meng C, Kleigrewe K, Münch PC, Rössler L, Huber C, Eisenreich W et al (2022) In vitro interaction network of a synthetic gut bacterial community. ISME J 16:1095–1109 34857933 10.1038/s41396-021-01153-z PMC8941000 Willis ND Cox TR Rahman-Casañs SF Smits K Przyborski SA van den Brandt P van Engeland M Weijenberg M Wilson RG de Bruïne A Lamin A/C is a risk biomarker in colorectal cancer PLoS ONE 2008 3 e2988 10.1371/journal.pone.0002988 18714339 PMC2496895 Willis ND, Cox TR, Rahman-Casañs SF, Smits K, Przyborski SA, van den Brandt P, van Engeland M, Weijenberg M, Wilson RG, de Bruïne A et al (2008) Lamin A/C is a risk biomarker in colorectal cancer. PLoS ONE 3:e2988 18714339 10.1371/journal.pone.0002988 PMC2496895 Xi Y Xu P Global colorectal cancer burden in 2020 and projections to 2040 Transl Oncol 2021 14 101174 10.1016/j.tranon.2021.101174 34243011 PMC8273208 Xi Y, Xu P (2021) Global colorectal cancer burden in 2020 and projections to 2040. Transl Oncol 14:101174 34243011 10.1016/j.tranon.2021.101174 PMC8273208 Zepeda-Rivera M Minot SS Bouzek H Wu H Blanco-Míguez A Manghi P Jones DS LaCourse KD Wu Y McMahon EF A distinct Fusobacterium nucleatum Nature 2024 628 424 432 10.1038/s41586-024-07182-w 38509359 PMC11006615 Zepeda-Rivera M, Minot SS, Bouzek H, Wu H, Blanco-Míguez A, Manghi P, Jones DS, LaCourse KD, Wu Y, McMahon EF et al (2024) A distinct Fusobacterium nucleatum 38509359 10.1038/s41586-024-07182-w PMC11006615 Zhang C Fei Y Wang H Hu S Liu C Hu R Du Q CAFs orchestrates tumor immune microenvironment—a new target in cancer therapy? Front Pharm 2023 14 1113378 10.3389/fphar.2023.1113378 PMC10064291 37007004 Zhang C, Fei Y, Wang H, Hu S, Liu C, Hu R, Du Q (2023) CAFs orchestrates tumor immune microenvironment—a new target in cancer therapy? Front Pharm 14:1113378 10.3389/fphar.2023.1113378 PMC10064291 37007004 Zhang L Leng X-X Qi J Wang N Han J-X Tao Z-H Zhuang Z-Y Ren Y Xie Y-L Jiang S-S The adhesin RadD enhances Fusobacterium nucleatum Nat Microbiol 2024 9 2292 2307 10.1038/s41564-024-01784-w 39169124 Zhang L, Leng X-X, Qi J, Wang N, Han J-X, Tao Z-H, Zhuang Z-Y, Ren Y, Xie Y-L, Jiang S-S, et al (2024) The adhesin RadD enhances Fusobacterium nucleatum 39169124 10.1038/s41564-024-01784-w Zhang R Qi F Zhao F Li G Shao S Zhang X Yuan L Feng Y Cancer-associated fibroblasts enhance tumor-associated macrophages enrichment and suppress NK cells function in colorectal cancer Cell Death Dis 2019 10 273 10.1038/s41419-019-1435-2 30894509 PMC6426970 Zhang R, Qi F, Zhao F, Li G, Shao S, Zhang X, Yuan L, Feng Y (2019) Cancer-associated fibroblasts enhance tumor-associated macrophages enrichment and suppress NK cells function in colorectal cancer. Cell Death Dis 10:273 30894509 10.1038/s41419-019-1435-2 PMC6426970 Zhong B Cheng B Huang X Xiao Q Niu Z Chen Y Yu Q Wang W Wu X-J Colorectal cancer-associated fibroblasts promote metastasis by up-regulating LRG1 through stromal IL-6/STAT3 signaling Cell Death Dis 2021 13 16 10.1038/s41419-021-04461-6 34930899 PMC8688517 Zhong B, Cheng B, Huang X, Xiao Q, Niu Z, Chen Y, Yu Q, Wang W, Wu X-J (2021) Colorectal cancer-associated fibroblasts promote metastasis by up-regulating LRG1 through stromal IL-6/STAT3 signaling. Cell Death Dis 13:16 34930899 10.1038/s41419-021-04461-6 PMC8688517 ",
  "metadata": {
    "Title of this paper": "Colorectal cancer-associated fibroblasts promote metastasis by up-regulating LRG1 through stromal IL-6/STAT3 signaling",
    "Journal it was published in:": "The EMBO Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488894/"
  }
}