{
  "title": "Paper_479",
  "abstract": "pmc Front Vet Sci Front Vet Sci 2864 fvets Front. Vet. Sci. Frontiers in Veterinary Science 2297-1769 Frontiers Media SA PMC12479254 PMC12479254.1 12479254 12479254 41036542 10.3389/fvets.2025.1667623 1 Veterinary Science Original Research Transcriptional profiles of vaccine-induced protection in bovine herpesvirus-1 and Mycoplasma bovis Goldkamp Anna K.  1 Kaplan Bryan S.  1 Menghwar Harish  1  2 Kanipe Carly R.  3 Boggiatto Paola M.  3 Crawford Lauren S.  3 Olsen Steven C.  3 Briggs Robert E.  1 Tatum Fred M.  1 Dassanayake Rohana P.  1 Casas Eduardo  1  * 1 Ruminant Diseases and Immunology Research Unit, National Animal Disease Center, United States Department of Agriculture, Agricultural Research Service Ames, IA United States 2 ARS Research Participation Program, Oak Ridge Institute for Science and Education (ORISE) Oak Ridge, TN United States 3 Infectious Bacterial Diseases Research Unit, National Animal Disease Center, Agricultural Research Service, United States Department of Agriculture Ames, IA United States Edited by: Orhan Sahin Reviewed by: Kieran G. Meade Katarzyna Dudek Feng Pang *Correspondence: Eduardo Casas, Eduardo.casas@usda.gov 16 9 2025 2025 12 480746 1667623 16 7 2025 18 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Goldkamp, Kaplan, Menghwar, Kanipe, Boggiatto, Crawford, Olsen, Briggs, Tatum, Dassanayake and Casas. 2025 Goldkamp, Kaplan, Menghwar, Kanipe, Boggiatto, Crawford, Olsen, Briggs, Tatum, Dassanayake and Casas https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction Mycoplasma bovis Bison bison M. bovis M. bovis n n M. bovis Methods Two doses of vaccines were administered on day 0 and at 21 days post-vaccination (DPV), followed by intranasal inoculation with bovine herpesvirus-1 (BHV-1) at 36 DPV and M. bovis M. bovis M. bovis Results and discussion The greatest number of differentially expressed transcripts (DETs) (≤0.05 FDR) were found in blood at 36 DPV (123 total DETs) and in spleen (57 DETs). At 36 DPV, vaccinated animals showed upregulation of transcripts involved in in cell adhesion, T-helper cell (Th1/Th2/Th17) differentiation, and antigen processing and presentation. This signifies a robust response to the 2nd vaccine dose, which caused increased expression of CD3E CD4 CD8B TBX21 GATA3 LGALS3 GBP-1 M. bovis animal health wild species infectious disease transcriptome Mycoplasma bovis Agricultural Research Service 10.13039/100007917 The author(s) declare that financial support was received for the research and/or publication of this article. This research was supported by funding through internal USDA research dollars (USDA/Agricultural Research Service, National Animal Disease Center, CRIS 5030-32000-236-000-D). The funder had no role in the study design, data collection and analysis, decision to publish, or manuscript preparation. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Veterinary Infectious Diseases Introduction Mycoplasma bovis 1 M. bovis 2 M. bovis 3 M. bovis 4 M. bovis M. bovis 5–7 Transcriptome studies have been used to study immune responses in the context of animal health. Alterations in gene expression have been observed in cattle infected with pathogens of the BRDC, such as M. bovis Mannheimia haemolytica 8–10 Staphylococcus aureus 11 12 We previously reported an injectable subunit vaccine containing recombinant elongation factor thermal unstable (EFTu) and heat shock protein 70 (Hsp70) can confer protection against M. bovis 13 + + 13 M. bovis M. bovis Materials and methods Animal welfare Animals were housed and samples collected in accordance with the Animal Welfare Act Amendments (7 U. S. Code e § 2,131 to § 2,156). All protocols and procedures were approved by the Institutional Animal Care and Use Committee of the National Animal Disease Center, Ames, IA (ARS-22-1035) before the onset of the study. Animal caretakers, veterinarians, and scientific staff performed animal monitoring and record keeping. Animals were humanely euthanized by intravenous sodium pentobarbital following the per-label dose and the discretion of the clinical veterinarian. Animal origin The animals were purchased from a commercial facility by USDA. The present study uses tissue and blood samples collected from the same animals in a previous study that has been published ( 13 Animal study Nine bison (~1–5 years old) were randomly assigned to one of two treatment groups: unvaccinated control ( n n 13 14 M. bovis 5 Supplementary Table S1 M. bovis M. bovis RNA isolation Total RNA was extracted and purified using the MagMAX™ mirVana™ Total RNA Isolation Kit (Thermo Fisher Scientific) according to manufacturer’s instructions. Quality and concentration of total RNA samples was evaluated using the Series II RNA 6000 Nano LabChip® kit (Agilent Technologies, Santa Clara, CA, United States) and samples with an RNA integrity number of ≥7.5 were used for subsequent library preparation. Library preparation and sequencing The NEBNext Poly(A) mRNA Magnetic Isolation Module was used for mRNA selection from extracted total RNA and libraries were prepared using the NEBNext Ultra II RNA library prep kit (New England Biolabs, Ipswitch, MA, United States) according to manufacturer’s instructions. Library index incorporation was done using the NEBNext Multiplex Oligos for Illumina kit (New England Biolabs). Libraries were pooled in equal concentration and stored at −20°C until sequencing using the NovaSeq6000 system on S2 flow cells with 150-cycle paired end reads (2 × 150 bp) at the Iowa State University DNA sequencing facility. RNAseq data processing Quality of raw reads was assessed with FastQC (version 0.12.1). Adapter sequences were removed and low-quality bases were trimmed (quality-cutoff of 30 and minimum-length ≥60) using Cutadapt (version 4.0). The Bison genome fasta file and annotation files (Bison_UMD1.0) were downloaded from Ensembl. For read alignment and quantification of transcript abundance, the STAR-RSEM pipeline was used (STAR version 2.7.10b; RSEM version 1.3.3). Mapping indices were created and trimmed reads were mapped with STAR. Transcript expression was quantified with rsem-calculate-expression and rsem-generate-data-matrix was used to generate the transcript count matrix. Differential expression analysis The software DESeq2 (version 1.44.0) was used for differential expression analysis. The DESeqDataSetFromMatrix and estimateSizeFactors functions were used to create a DESeq2 object and normalize counts with the median ratio method, respectively. Transcripts with at least 5 normalized counts in at least 2 samples were kept for further analysis. The Wald test was used to generate baseMean, log2FoldChange, log fold change standard error, and adjusted p p p Correlation heatmaps for all samples were generated with pheatmap (version 1.0.12). Volcano plots and heatmaps were generated using the R packages EnhancedVolcano (version 1.22.0) and ggplot2 (version 3.5.1). Venn diagrams were generated using ggVennDiagram (version 1.5.2). Gene ontology and KEGG enrichment analysis of DETs was performed with DAVID. Weighted gene co-expression network analysis (WGCNA) The WGCNA R package (version 1.73) was used to identify modules of highly correlated transcripts connected to vaccination status ( 15 Results Overview of RNAseq data To quantify transcript expression, raw reads were processed and aligned to the bison reference genome (Bison_UMD1.0). An average of ~36 million raw reads were obtained per sample. Adapter and quality trimming yielded an average of ~27 million trimmed reads per sample. In tissues samples, alignment rates ranged from 84.6% (PT) to 88.82% (RPLN). In blood, alignment rates ranged from 82.7% (2nd vaccination) to 87.5% (1st vaccination). Liver, spleen, and blood samples separated into distinct clusters with high correlations across samples ( R Figure 1 Figure 1 Dendrogram correlation heatmap across liver, PT, RPLN, TBLN, spleen, and blood (0 DPV, 21 DPV, 36 DPV, 40 DPV, 47 DPV) showing clustering of samples based on gene expression. Correlation scale is indicated by red (highest correlation) and blue (lowest correlation) colors. Treatment colors are shown in blue (Control) or gray (Vaccinate). Sample type is shown in different colors. The samples were collected from unvaccinated control ( n n Heatmap depicting cluster analysis of tissue samples from liver, spleen, and blood, categorized by treatment and time points. Color gradient from blue to red indicates correlation intensity, with red denoting higher correlation. Treatment and tissue types are marked on the top and side, with hierarchical clustering trees displayed. Number of differentially expressed transcripts A summary of differentially expressed transcripts between control and vaccinated animals in all tissues and time points is shown in Table 1 LGALS3 FOS Figure 2 MFSD2A 16 SEC16A 17 GCN1 ZEB1 DAB2 18–20 Table 1 Number of up- and down-regulated differentially expressed transcripts between Control and Vaccinate animals.  Tissue  Number of differentially expressed transcripts  Up-regulated  Down-regulated  Total Liver 9 17 26 TBLN 4 8 12 RPLN 0 3 3 PT 4 4 8 Spleen 26 31 57 Blood 0 DPV 3 8 11 21 DPV 5 7 12 36 DPV 40 83 123 40 DPV 12 21 33 47 DPV 10 3 13 Up-regulated and down-regulated columns indicate the number of differentially expressed transcripts in control ( n n p Figure 2 Volcano plot of differentially expressed transcripts (DETs) between control and vaccinate in liver, tracheobronchial lymph node (TBLN), retropharyngeal lymph node (RPLN), palatine tonsil (PT), and spleen. Log2 fold change is shown on the x p y n n Volcano plots displaying gene expression changes across five tissues: Spleen, Liver, TBLN, RPLN, and PT. The x-axis represents log2 fold change and the y-axis represents -log10 P values. Significant genes include LGALS3 and FOS in Spleen, MFSD2A in Liver, SEC16A in TBLN, GCN1 in RPLN, and DAB2 and ZEB1 in PT. Blue dots indicate downregulated genes, red dots show upregulated genes, and gray dots are non-significant. The number of DETs between control vs. vaccinated animals in blood ranged from 11 total DETs (Day 0) to 123 total DETs (36 DPV) ( Table 1 PAX5 Figure 3 21 APOE FN1 22 23 VSIR 24 ANO10 25 SRI FCER1G M. bovis 26 27 Supplementary Tables S2, S3 Figure 3 Volcano plot of differentially expressed transcripts (DETs) between control and vaccinate in 0 days post-vaccination (DPV), 21 DPV, 36 DPV, 40 DPV, 47 DPV. Log2 fold change is shown on the x p y n n Five scatter plots show gene expression changes at different days post-vaccination (DPV): Day 0, 21, 36, 40, and 47. The x-axis represents log2 fold change, and the y-axis represents negative log10 p-value. Points are colored: gray for non-significant, blue for downregulated, red for upregulated. Notable genes like PAX5, APOE, FN1, VSIR, ANO10, SRI, and FCER1G are labeled. Shared differentially expressed transcripts (DETs) across tissues and blood time points Out of 190 DETs, 178 were unique to day of vaccination in blood. However, LOC105004569 (ortholog of NK-lysin) and LOC105001075 (ortholog of T cell-interacting activating receptor on myeloid cells 1/ TARM1 Figure 4 28 TARM1 29 Figure 4 Venn diagrams of differentially expressed transcripts (DETs). Shared and unique DETs across day 0, 21 days post-vaccination (DPV), 36 DPV, 40 DPV, 47 DPV. Shared and unique DETs across liver, retropharyngeal lymph node (RPLN), palatine tonsil (PT), tracheobronchial lymph node (TBLN), and spleen. Shared DETs are indicated by arrows. TARM1 = T cell-interacting, activating receptor on myeloid cells 1; GRN = granulin precursor; RPL14 = ribosomal protein L14; GCN = GCN1 activator of EIF2AK4; NR1D2 = nuclear receptor subfamily 1 group D member 2; DAB2 = DAB adapter protein 2. The samples were collected from unvaccinated control ( n n Venn diagram illustrating shared and unique gene expressions across multiple conditions and tissues. The left side represents blood samples across different days post-vaccination (DPV): Day 0, 21, 36, 40, and 47. The right side shows tissues such as Liver, RPLN, PT, TBLN, and Spleen. Boxes highlight specific genes: LOC105004569, GRN-202, GCN1-202, NR1D2-201, and DAB2-202, showing overlaps and unique occurrences in these conditions. In tissue comparisons, DETs in liver overlapped with DETs in TBLN, RPLN, and PT ( Figure 4 GRN RPL14 GCN1 NR1D2 30 DAB2 31 Gene ontology and KEGG enrichment analysis As shown in Table 2 TCP1 PTGES3 p LGALS3 LOC105003308 GBP-1 ADAM15 PTPN6 BTRC Table 2 The significant pathways, biological processes, and molecular functions enriched with differentially expressed transcripts (DETs) in spleen and liver.  Tissue  Category  Term  p  Transcripts Spleen Biological Process Protein stabilization 1.38E-02  TCP1-201, PPAP2B-201, PTGES3-201 Biological Process Positive regulation of telomere maintenance via telomerase 2.36E-02  TCP1-201, PTGES3-201 Molecular Function Lipid transporter activity 3.89E-02  ABCA9-201, NPC1-202 Liver Biological Process Negative regulation of T cell receptor signaling pathway 6.50E-03  PTPN6-202, BTRC-202 The greatest number of significantly enriched gene ontology terms and pathways was found at 36 DPV ( Figure 5 GATA3 IL27RA CD3E CD4, TBX21 Figure 6A TAPBP Figure 6B PLCG2 TNFRSF1B Figure 6C CD2 CD6 CD8b SPN Figure 6D Figure 5 Significantly enriched biological processes, molecular functions, and pathways at 36 days post vaccination (DPV). Categories are depicted in different colors. The x p y p n n Bar chart depicting various biological terms categorized into Biological Process, Molecular Function, and Pathway at 36 DPV. The horizontal axis shows -log10(Pvalue), with bars indicating significance in each category: blue for Biological Process, purple for Molecular Function, and red for Pathway. Terms include Yersinia infection, Th17 cell differentiation, and adaptive immune response, among others. Figure 6 Heatmap visualization of top significantly enriched pathways at 36 days post-vaccination. Differentially expressed transcripts (DETs) were significantly enriched in (A) (B) (C) (D) n n Heatmap with four panels labeled A to D, each representing different biological processes: Th17 Cell Differentiation, Antigen Processing and Presentation, HIV-1 Infection, and Cell Adhesion Molecules. Rows indicate gene expressions under control and vaccine treatments, with a color gradient from yellow (low expression) to red (high expression). Each panel contains clustered genes, with corresponding color scales indicating expression levels. At 40 DPV (or 4 days post-BHV-1 challenge), VPS50 subunit of EARP ( VPS50 SEC31A FBLN5 SPARCL1 RASGRP4 S100A4 Transcript co-expression at 40 and 47 DPV Weighted co-expression analysis identified 5 modules of co-expressed transcripts with correlations to treatment group at 40 and 47 DPV. Of these modules, Module V displayed a significant ( p Figure 7A ECM1 VIM CAPNS1 R Figure 7B GNB2 HCK FGR SLC15A3 ITGB7 FLOT1 Figure 7C Figure 7D Figure 7D Figure 7 Weighted gene co-expression analysis (WGCNA) reveals co-expression at 40 days post vaccination (DPV) and 47 DPV. (A) (B) (C) (D) n n A composite image consisting of four panels: A) A heatmap titled \"Module-treatment relationship\" showing color-coded relationships for five modules, indicating correlation coefficients. B) A scatter plot titled \"Module Membership vs. Gene Significance\" displaying a positive correlation (correlation coefficient 0.37, p-value 1.2e-54) with two genes labeled. C) A network diagram with nodes labeled by gene identifiers, illustrating interactions related to treatment. D) A dot plot showing gene enrichment with categories including Biological Process, KEGG Pathway, and Molecular Function, color-coded, and sized by gene count. Discussion Mycoplasma bovis 6 32 M. bovis 13 M. bovis M. bovis T cell-mediated immunity is crucial for protection against intracellular and extracellular pathogens. While DETs at day 0 represent animal to animal variation, DETs at other time points were associated with heparin binding, immune response, and immune signaling. Vaccination resulted in an upregulation of transcripts associated with Th1, Th2, and Th17 cell differentiation with the greatest difference in gene expression occurring at approximately 2 weeks after the 2 nd 33 in vitro 13 CD3E CD4 CD8B TBX21 GATA3 GATA3 34 TBX21 GATA3 GATA3 35 TBX21 GATA3 36 IL2RB 37 IL-27 can stimulate Th1 cell differentiation and is linked to the activation of CD8 T cells ( 38 39 IL27RA Mycobacterium tuberculosis 40 M. bovis 13 41 IL27RA M. bovis M. bovis in vitro M. bovis in vivo 42 43 M. bovis The regulation of adhesion molecules involved in antigen presentation and co-stimulation, such as MHC Class I and SPN SPN CD43 SPN Staphylococcus aureus SPN SPN 44 45 46 TAPBP, 47 TAPBP An ortholog of NK-lysin (LOC105004569) was a DET that was upregulated in vaccinated animals at 21 and 36 DPV. NK-lysins are multifunctional peptides found in cytolytic granules of cytotoxic T-lymphocytes and natural killer cells with antibacterial and antiviral activities ( 28 48 49 M. bovis Histophilis somni Pasteurella multocida M. haemolytica 50–52 M. bovis 50 Co-expression analysis revealed a negative correlation between vaccination and the expression of transcripts involved in cytokine-mediated signaling and chemokine signaling pathways at 40 and 47 DPV. This suggests that BHV-1 may have an immunosuppressive effect at 40 DPV. VIM 53 HCK FGR HCK FGR Lyn 54 M. bovis The gene LGALS3 LGALS3 55–57 56 58 Brucella abortus 59 60 GBP-1 61 M. bovis GBP-1 5 M. bovis 62 The present study utilizes transcriptomics to characterize immune response to vaccination and the mechanisms contributing to reduced clinical disease. Robust transcriptional regulation of immune-related pathways was primarily observed at 36 DPV with significant upregulation of cell adhesion, Th1/Th2/Th17 cell differentiation, and antigen processing and presentation. The upregulation of T helper differentiation pathways suggests a maturing immune response, while enhanced antigen presentation and cell adhesion may describe increased immune cell trafficking and interactions due to vaccination. Trafficking of immune cells potentially leads to the recruitment of immune cells to interact at sites where they are needed to fight infection. Spleen-specific regulation included transcripts involved in innate immune response and inflammation, such as LGALS3 GBP-1 n M. bovis M. bovis The authors wish to acknowledge Brad Chriswell, William Boatwright, Jr., Darl Pringle, Kathy Bickel, and Sam Humphrey for their excellent technical assistance. The authors also thank Rebecca Cox, Kolby Strallman, Jonathan Gardner, and Derek Vermeer for their expert assistance with animal studies. Mention of trade name, proprietary product, or specified equipment does not constitute a guarantee or warranty by the USDA and does not imply approval to the exclusion of other products that may be suitable. USDA is an Equal Opportunity Employer. Data availability statement The original contributions presented in the study are publicly available. The sequence files can be found in the NCBI repository under BioProject accession number PRJNA1274494 ( https://www.ncbi.nlm.nih.gov/bioproject/?term=%20PRJNA1274494 Ethics statement The animal study was approved by the USDA-ARS NADC Institutional Animal Care and Use Committee (Protocol # ARS-22-1035). The study was conducted in accordance with the local legislation and institutional requirements. Author contributions AG: Visualization, Data curation, Formal analysis, Writing – review & editing, Writing – original draft, Investigation. BK: Conceptualization, Investigation, Writing – review & editing. HM: Writing – review & editing, Investigation, Conceptualization. CK: Conceptualization, Writing – review & editing, Investigation. PB: Writing – review & editing, Investigation, Conceptualization. LC: Conceptualization, Investigation, Writing – review & editing. SO: Conceptualization, Writing – review & editing, Investigation. RB: Writing – review & editing, Conceptualization, Investigation. FT: Writing – review & editing, Conceptualization, Investigation. RD: Writing – review & editing, Investigation, Conceptualization. EC: Data curation, Conceptualization, Investigation, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fvets.2025.1667623/full#supplementary-material References 1. Perez-Casal J Pathogenesis and virulence of Mycoplasma bovis Vet Clin North Am Food Anim Pract 2020 36 269 78 10.1016/j.cvfa.2020.02.002 32327249 2. Oliveira TES Pelaquim IF Flores EF Massi RP Valdiviezo MJJ Pretto-Giordano LG Mycoplasma bovis Transbound Emerg Dis 2020 67 82 93 10.1111/tbed.13223 31232526 PMC7228412 3. Griffin D Chengappa MM Kuszak J McVey DS Bacterial pathogens of the bovine respiratory disease complex Vet Clin North Am Food Anim Pract 2010 26 381 94 10.1016/j.cvfa.2010.04.004 20619191 4. Gelgie AE Desai SE Gelalcha BD Kerro Dego O Mycoplasma bovis Front Vet Sci 2024 11 1322267 10.3389/fvets.2024.1322267 38515536 PMC10956102 5. Register KB Olsen SC Sacco RE Ridpath J Falkenberg S Briggs R Relative virulence in bison and cattle of bison-associated genotypes of Mycoplasma bovis Vet Microbiol 2018 222 55 63 10.1016/j.vetmic.2018.06.020 30080673 6. Janardhan KS Hays M Dyer N Oberst RD DeBey BM Mycoplasma bovis Bison bison J Vet Diagn Invest 2010 22 797 801 10.1177/104063871002200528 20807947 7. Dyer N Hansen-Lardy L Krogh D Schaan L Schamber E An outbreak of chronic pneumonia and polyarthritis syndrome caused by Mycoplasma bovis Bison bison J Vet Diagn Invest 2008 20 369 71 10.1177/104063870802000321 18460630 8. O’Donoghue S Earley B Johnston D McCabe MS Kim JW Taylor JF Whole blood transcriptome analysis in dairy calves experimentally challenged with bovine herpesvirus 1 (BoHV-1) and comparison to a bovine respiratory syncytial virus (BRSV) challenge Front Genet 2023 14 1092877 10.3389/fgene.2023.1092877 36873940 PMC9981960 9. Goldkamp AK Atchison RG Falkenberg SM Dassanayake RP Neill JD Casas E Host transcriptome response to Mycoplasma bovis and bovine viral diarrhea virus in bovine tissues BMC Genomics 2025 26 361 10.1186/s12864-025-11549-2 40211134 PMC11987210 10. Behura SK Tizioto PC Kim J Grupioni NV Seabury CM Schnabel RD Tissue tropism in host transcriptional response to members of the bovine respiratory disease complex Sci Rep 2017 7 17938 10.1038/s41598-017-18205-0 29263411 PMC5738336 11. Wiarda JE Davila KMS Trachsel JM Loving CL Boggiatto P Lippolis JD Single-cell RNA sequencing characterization of Holstein cattle blood and milk immune cells during a chronic Staphylococcus aureus Sci Rep 2025 15 12689 10.1038/s41598-025-96657-5 40221598 PMC11993596 12. Ma H Lippolis JD Casas E Expression profiles and interaction of MicroRNA and transcripts in response to bovine leukemia virus exposure Front Vet Sci 2022 9 887560 10.3389/fvets.2022.887560 35928115 PMC9343836 13. Kaplan BS Dassanayake RP Briggs RE Kanipe CR Boggiatto PM Crawford LS An injectable subunit vaccine containing elongation factor Tu and heat shock protein 70 partially protects American bison from Mycoplasma bovis Front Vet Sci 2024 11 1408861 10.3389/fvets.2024.1408861 38988984 PMC11234848 14. Briggs RE Billing SR Boatwright WD Chriswell BO Casas E Dassanayake RP Protection against Mycoplasma bovis Mannheimia haemolytica Mycoplasma Microb Pathog 2021 161 105159 10.1016/j.micpath.2021.105159 34454023 15. Langfelder P Horvath S WGCNA: an R package for weighted correlation network analysis BMC Bioinform 2008 9 559 10.1186/1471-2105-9-559 19114008 PMC2631488 16. Piccirillo AR Hyzny EJ Beppu LY Menk AV Wallace CT Hawse WF The Lysophosphatidylcholine transporter MFSD2A is essential for CD8+ memory T cell maintenance and secondary response to infection J Immunol 2019 203 117 26 10.4049/jimmunol.1801585 31127034 PMC6581627 17. Van Zuylen WJ Doyon P Clément J-F Khan KA D’Ambrosio LM Dô F Proteomic profiling of the TRAF3 interactome network reveals a new role for the ER-to-Golgi transport compartments in innate immunity PLoS Pathog 2012 8 e1002747 10.1371/journal.ppat.1002747 22792062 PMC3390413 18. Figliuolo Da Paz V Ghishan FK Kiela PR Emerging roles of disabled homolog 2 (DAB2) in immune regulation Front Immunol 2020 11 580302 10.3389/fimmu.2020.580302 33178208 PMC7593574 19. Li D Cheng P Wang J Qiu X Zhang X Xu L IRF6 is directly regulated by ZEB1 and ELF3, and predicts a favorable prognosis in gastric Cancer Front Oncol 2019 9 220 10.3389/fonc.2019.00220 31019894 PMC6458252 20. Yang J Tian B Sun H Garofalo RP Brasier AR Epigenetic silencing of IRF1 dysregulates type III interferon responses to respiratory virus infection in epithelial to mesenchymal transition Nat Microbiol 2017 2 17086 10.1038/nmicrobiol.2017.86 28581456 PMC5501188 21. Calderón L Schindler K Malin SG Schebesta A Sun Q Schwickert T Pax5 regulates B cell immunity by promoting PI3K signaling via PTEN down-regulation Sci Immunol 2021 6 eabg5003 10.1126/sciimmunol.abg5003 34301800 PMC7611449 22. Saito H Dhanasekaran P Nguyen D Baldwin F Weisgraber KH Wehrli S Characterization of the heparin binding sites in human Apolipoprotein E J Biol Chem 2003 278 14782 7 10.1074/jbc.M213207200 12588864 23. Lovett BM Hill KE Randolph EM Wang L Schwarzbauer JE Nucleation of fibronectin fibril assembly requires binding between heparin and the 13th type III module of fibronectin J Biol Chem 2023 299 104622 10.1016/j.jbc.2023.104622 36933809 PMC10124947 24. ElTanbouly MA Zhao Y Schaafsma E Burns CM Mabaera R Cheng C VISTA: a target to manage the innate cytokine storm Front Immunol 2021 11 595950 10.3389/fimmu.2020.595950 33643285 PMC7905033 25. Hammer C Wanitchakool P Sirianant L Papiol S Monnheimer M Faria D A coding variant of ANO10, affecting volume regulation of macrophages, is associated with Borrelia Seropositivity Mol Med 2015 21 26 37 10.2119/molmed.2014.00219 25730773 PMC4461583 26. Li X Wang J Liu J Li Z Wang Y Xue Y Engagement of soluble resistance-related calcium binding protein (sorcin) with foot-and-mouth disease virus (FMDV) VP1 inhibits type I interferon response in cells Vet Microbiol 2013 166 35 46 10.1016/j.vetmic.2013.04.028 23764275 27. Huang C Zhu W Li Q Lei Y Chen X Liu S Antibody fc-receptor FcεR1γ stabilizes cell surface receptors in group 3 innate lymphoid cells and promotes anti-infection immunity Nat Commun 2024 15 5981 10.1038/s41467-024-50266-4 39013884 PMC11252441 28. Dassanayake RP Atkinson BM Mullis AS Falkenberg SM Nicholson EM Casas E Bovine NK-lysin peptides exert potent antimicrobial activity against multidrug-resistant Salmonella outbreak isolates Sci Rep 2021 11 19276 10.1038/s41598-021-98860-6 34588573 PMC8481502 29. Li X Wang M Ming S Liang Z Zhan X Cao C TARM-1 is critical for macrophage activation and Th1 response in Mycobacterium tuberculosis J Immunol 2021 207 234 43 10.4049/jimmunol.2001037 34183366 30. Tang M Hu Z Rao C Chen J Yuan S Zhang J Burkholderia pseudomallei NR1D2 PNPLA2/ATGL Autophagy 2021 17 1918 33 10.1080/15548627.2020.1801270 32777979 PMC8386627 31. Hung W-S Ling P Cheng J-C Chang S-S Tseng C-P Disabled-2 is a negative immune regulator of lipopolysaccharide-stimulated toll-like receptor 4 internalization and signaling Sci Rep 2016 6 35343 10.1038/srep35343 27748405 PMC5066213 32. Bras AL Barkema HW Woodbury MR Ribble CS Perez-Casal J Windeyer MC Clinical presentation, prevalence, and risk factors associated with Mycoplasma bovis Bison bison J Am Vet Med Assoc 2017 250 1167 75 10.2460/javma.250.10.1167 28467749 33. Sarkar I Garg R van Den Van Drunen Littel- Hurk S Selection of adjuvants for vaccines targeting specific pathogens Expert Rev Vaccines 2019 18 505 21 10.1080/14760584.2019.1604231 31009255 PMC7103699 34. Zhou M Ouyang W The function role of GATA-3 in Th1 and Th2 differentiation Immunol Res 2003 28 25 38 10.1385/IR:28:1:25 12947222 35. Kanhere A Hertweck A Bhatia U Gökmen MR Perucha E Jackson I T-bet and GATA3 orchestrate Th1 and Th2 differentiation through lineage-specific targeting of distal regulatory elements Nat Commun 2012 3 1268 10.1038/ncomms2260 23232398 PMC3535338 36. Charley KR Ramstead AG Matous JG Kumaki Y Sircy LM Hale JS Effector-phase IL-2 signals drive Th1 effector and memory responses dependently and independently of TCF-1 J Immunol 2024 212 586 95 10.4049/jimmunol.2300570 38149929 PMC10872735 37. Castro I Dee MJ Malek TR Transient enhanced IL-2R signaling early during priming rapidly amplifies development of functional CD8+ T effector-memory cells J Immunol 2012 189 4321 30 10.4049/jimmunol.1202067 23018461 PMC3478487 38. Yin L Zhang E Mao T Zhu Y Ni S Li Y Macrophage P2Y6R activation aggravates psoriatic inflammation through IL-27-mediated Th1 responses Acta Pharm Sin B 2024 14 4360 77 10.1016/j.apsb.2024.06.008 39525587 PMC11544167 39. Hall AO Silver JS Hunter CA The Immunobiology of IL-27 Advances in immunology Elsevier 2012 1 44 10.1016/B978-0-12-394299-9.00001-1 22608254 40. Zhou Y Zhang Y Li Y Liu L Zhuang M Xiao Y IL-27 attenuated macrophage injury and inflammation induced by Mycobacterium tuberculosis In Vitro Cell Dev Biol 2025 61 245 56 10.1007/s11626-024-00989-x 39455490 41. Dyer N Register KB Miskimins D Newell T Necrotic pharyngitis associated with Mycoplasma bovis Bison bison J Vet Diagn Invest 2013 25 301 3 10.1177/1040638713478815 23512925 42. Van Der Merwe J Prysliak T Perez-Casal J Invasion of bovine peripheral blood mononuclear cells and erythrocytes by Mycoplasma bovis Infect Immun 2010 78 4570 8 10.1128/IAI.00707-10 20713619 PMC2976333 43. Bürki S Gaschen V Stoffel MH Stojiljkovic A Frey J Kuehni-Boghenbor K Invasion and persistence of Mycoplasma bovis Vet Res 2015 46 53 10.1186/s13567-015-0194-z 25976415 PMC4432498 44. Bremell T Holmdahl R Tarkowski A Protective role of sialophorin (CD43)-expressing cells in experimental Staphylococcus aureus Infect Immun 1994 62 4637 40 10.1128/iai.62.10.4637-4640.1994 7927732 PMC303155 45. Zhao T Cai Y Jiang Y He X Wei Y Yu Y Vaccine adjuvants: mechanisms and platforms Signal Transduct Target Ther 2023 8 283 10.1038/s41392-023-01557-7 37468460 PMC10356842 46. Wick J M Ljunggren H Processing of bacterial antigens for peptide presentation on MHC class I molecules Immunol Rev 1999 172 153 62 10.1111/j.1600-065X.1999.tb01363.x 10631944 47. Del Val M Antón LC Ramos M Muñoz-Abad V Campos-Sánchez E Endogenous TAP-independent MHC-I antigen presentation: not just the ER lumen Curr Opin Immunol 2020 64 9 14 10.1016/j.coi.2019.12.003 31935516 48. Yacoub HA Mahmoud MM Al-Hejin AM Abujamel TS Tabrez S Abd-Elmaksoud S Effect of Nk-lysin peptides on bacterial growth, MIC, antimicrobial resistance, and viral activities Anim Biotechnol 2024 35 2290520 10.1080/10495398.2023.2290520 38100547 49. Ortega L Carrera C Muñoz-Flores C Salazar S Villegas MF Starck MF New insight into the biological activity of Salmo salar Front Immunol 2024 15 1191966 10.3389/fimmu.2024.1191966 38655253 PMC11035819 50. Dassanayake RP Falkenberg SM Register KB Samorodnitsky D Nicholson EM Reinhardt TA Antimicrobial activity of bovine NK-lysin-derived peptides on Mycoplasma bovis PLoS One 2018 13 e0197677 10.1371/journal.pone.0197677 29771981 PMC5957369 51. Chen J Yang C Tizioto PC Huang H Lee MOK Payne HR Expression of the bovine NK-Lysin gene family and activity against respiratory pathogens PLoS One 2016 11 e0158882 10.1371/journal.pone.0158882 27409794 PMC4943647 52. Dassanayake RP Falkenberg SM Briggs RE Tatum FM Sacco RE Antimicrobial activity of bovine NK-lysin-derived peptides on bovine respiratory pathogen Histophilus somni PLoS One 2017 12 e0183610 10.1371/journal.pone.0183610 28827826 PMC5565109 53. Dos Santos G Rogel MR Baker MA Troken JR Urich D Morales-Nebreda L Vimentin regulates activation of the NLRP3 inflammasome Nat Commun 2015 6 6574 10.1038/ncomms7574 25762200 PMC4358756 54. Kovács M Németh T Jakus Z Sitaru C Simon E Futosi K The Src family kinases Hck, Fgr, and Lyn are critical for the generation of the in vivo inflammatory environment without a direct role in leukocyte recruitment J Exp Med 2014 211 1993 2011 10.1084/jem.20132496 25225462 PMC4172222 55. Nita-Lazar M Banerjee A Feng C Vasta GR Galectins regulate the inflammatory response in airway epithelial cells exposed to microbial neuraminidase by modulating the expression of SOCS1 and RIG1 Mol Immunol 2015 68 194 202 10.1016/j.molimm.2015.08.005 26355912 PMC4624043 56. Stojanovic BS Stojanovic B Milovanovic J Arsenijević A Dimitrijevic Stojanovic M Arsenijevic N The pivotal role of galectin-3 in viral infection: a multifaceted player in host–pathogen interactions Int J Mol Sci 2023 24 9617 10.3390/ijms24119617 37298569 PMC10253520 57. Woodward AM Mauris J Argüeso P Binding of transmembrane mucins to Galectin-3 limits herpesvirus 1 infection of human corneal keratinocytes J Virol 2013 87 5841 7 10.1128/JVI.00166-13 23487460 PMC3648170 58. Sigamani A Mayo KH Miller MC Chen-Walden H Reddy S Platt D An Oral galectin inhibitor in COVID-19—a phase II randomized controlled trial Vaccine 2023 11 731 10.3390/vaccines11040731 37112643 PMC10140888 59. Tana FL Guimarães ES Cerqueira DM Campos PC Gomes MTR Marinho FV Galectin-3 regulates proinflammatory cytokine function and favours B rucella abortus Cell Microbiol 2021 23 13375 10.1111/cmi.13375 34169616 PMC8635083 60. Liu F-T Stowell SR The role of galectins in immunity and infection Nat Rev Immunol 2023 23 479 94 10.1038/s41577-022-00829-7 36646848 PMC9842223 61. Feeley EM Pilla-Moffett DM Zwack EE Piro AS Finethy R Kolb JP Galectin-3 directs antimicrobial guanylate binding proteins to vacuoles furnished with bacterial secretion systems Proc Natl Acad Sci 2017 114 1698 1706 10.1073/pnas.1615771114 28193861 PMC5338555 62. Lewis SM Williams A Eisenbarth SC Structure and function of the immune system in the spleen Sci Immunol 2019 4 eaau6085 10.1126/sciimmunol.aau6085 30824527 PMC6495537 ",
  "metadata": {
    "Title of this paper": "Structure and function of the immune system in the spleen",
    "Journal it was published in:": "Frontiers in Veterinary Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479254/"
  }
}