{
  "title": "Paper_988",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470177 PMC12470177.1 12470177 12470177 41009441 10.3390/ijms26188873 ijms-26-08873 1 Article An Integrative Approach to Identifying Neuroprotective Natural Compounds for Neurodevelopmental Disorders Souza Juliana Alves da Costa Ribeiro Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft Visualization 1 2 Xavier Rafael Martins Validation Writing – review & editing 2 Souza Terezinha Validation Writing – review & editing Supervision Project administration 2 Farias Davi Validation Writing – review & editing Supervision Project administration 1 2 * Han Weiwei Academic Editor 1 julianaacrs@hotmail.com 2 rafaelcbiotec@gmail.com terezinhamsouza@gmail.com * davi@dbm.ufpb.br 12 9 2025 9 2025 26 18 497349 8873 17 7 2025 31 7 2025 05 8 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Neurodevelopmental disorders (NDDs) represent significant public health challenges due to their multifactorial etiology and clinical heterogeneity. Current treatments remain limited, highlighting the need for novel therapeutic strategies. This study aimed to identify neuroprotective natural compounds targeting NDD-associated pathways and describe an integrative computational pipeline combining in silico screening, network pharmacology, and molecular docking approaches to accelerate NDD drug discovery. An integrative computational pipeline was developed through sequential phases: (1) systematic screening of the Traditional Chinese Medicine Systems Pharmacology Database (TCMSP) for natural compounds meeting drug-likeness criteria and toxicity thresholds; (2) biological activity prediction; (3) network pharmacology analysis integrating compound targets and NDD-associated genes; (4) protein–protein interaction network construction and functional enrichment; and (5) molecular docking validation of top compounds against prioritized targets. From 2634 initial compounds, 10 met all selection criteria. Network analysis revealed significant interactions between compound targets and NDD-associated genes, with enrichment in neurodevelopment, cognition, and synaptic regulation pathways. Three key targets emerged as hubs: CSNK2B, GRIN1, and MAPK1. Molecular docking demonstrated high-affinity binding of caryophyllene oxide, linoleic acid, and tangeretin, supported by stable interactions with catalytic residues. This study identifies caryophyllene oxide, linoleic acid, and tangeretin as promising multi-target compounds for NDD intervention, with verified interactions against key neurodevelopmental targets. The integrative computational pipeline effectively bridges traditional medicine knowledge with modern drug discovery, offering a strategy to accelerate neurotherapeutic development while reducing experimental costs. These findings warrant further experimental validation of the prioritized compounds. drug discovery computational pharmacology natural compounds neurological disorders Federal University of Paraiba This research received no external funding. The APC was funded by the Federal University of Paraiba. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Neurodevelopmental disorders (NDDs) represent a heterogeneous group of conditions originating from atypical alterations in brain development, primarily occurring during the prenatal stages and typically becoming apparent in childhood or adolescence. Although phenotypically variable, these disorders exhibit core symptomatic overlaps, including cognitive deficits, motor dysfunction, language impairments, and emotional regulation difficulties [ 1 2 The Diagnostic and Statistical Manual of Mental Disorders (DSM-5) classifies NDDs as encompassing Intellectual Disability, Communication Disorders, Autism Spectrum Disorder (ASD), Attention-Deficit/Hyperactivity Disorder (ADHD), Neurodevelopmental Motor Disorders, and Specific Learning Disorders [ 3 2 4 Evaluating genetic risk in NDDs is challenging due to their genetic heterogeneity. ASD exemplifies this complexity, with hundreds of implicated risk genes showing minimal overlap between affected individuals [ 5 6 7 NDDs pose an escalating global health challenge, significantly compromising quality of life and creating substantial socioeconomic impacts on healthcare systems. Although pharmacological treatments have advanced, the need for novel therapeutic approaches remains evident [ 8 9 10 Building on these pathway-based therapeutic opportunities, mechanistic studies consistently highlight three pathophysiological domains: (I) protein synthesis, (II) epigenetic transcriptional regulation, and (III) synaptic signaling [ 5 11 Drug development is a lengthy and costly process, often marked by high failure rates, frequently due to efficacy or safety issues identified during clinical trials [ 12 13 CADD encompasses two primary approaches: Structure-Based Drug Design (SBDD) and Ligand-Based Drug Design (LBDD) [ 14 15 Network pharmacology represents another powerful computational drug discovery methodology that adopts a systems perspective [ 16 17 18 19 20 21 22 The pursuit for innovative treatments for neurodevelopmental disorders has increasingly focused on natural compounds exhibiting neuroprotective properties. Notably, several of these phytochemicals exhibit antioxidant, anti-inflammatory, and neurotransmitter pathway-modulating activities, positioning them as candidates for addressing the complex pathophysiology of NDDs [ 23 Among these neuroprotective phytochemicals, luteolin demonstrates CNS immunomodulation by inhibiting immune cell activation in the central nervous system and suppressing the expression of pro-inflammatory mediators such as IL-6 and TNF-α, in addition to modulating the NF-κB signaling pathway [ 24 25 26 Given the demonstrated ability of natural compounds to modulate key biological pathways in NDDs, there is a pressing need to systematically identify novel neuroprotective molecules [ 27 28 This study aims to identify novel neuroprotective natural compounds for NDDs through an integrated computational approach combining in silico screening and network pharmacology. The innovative methodology employs a phased screening strategy that systematically evaluates pharmacokinetic properties, toxicity profiles, biological activity predictions, and mechanism-of-action analyses. This multi-parametric approach enables more accurate drug candidate selection, optimizing the identification of promising compounds while significantly reducing the time and costs associated with early-stage drug development. By integrating critical pharmacological parameters into a unified pipeline, our strategy overcomes limitations of conventional drug discovery methods, offering an efficient pathway for developing multi-target therapies directed at core NDD pathophysiological mechanisms. 2. Results The natural compounds were systematically evaluated for key pharmacological properties, including drug-likeness and blood–brain barrier (BBB) permeability potential, followed by comprehensive toxicity endpoint and biological activity predictions ( Figure 1 Figure 2 The results generated from the screening of these selected compounds are detailed in the following sections. 2.1. Compound Screening and Selection An initial pool of 2634 natural compounds was retrieved from the TCMSP database using ‘cognitive deficits’ as the primary search criterion. Sequential filtering through established drug-likeness parameters (TCMSP and SwissADME criteria) and removal of duplicate entries yielded 460 qualified candidates. The rigorous filtration process reduced the initial dataset by 82.5%, focusing on compounds with clinically translatable potential for cognitive enhancement. The parameter values evaluated for the ten selected natural compounds are presented in Table 1 2.2. Comprehensive Toxicity Evaluation The canonical SMILES representations of the 460 compounds were submitted to the ProTox 3.0 platform for systematic toxicity evaluation. The predictions spanned the complete toxicity classification spectrum (Class I to VI), with LD50 values ranging from 1 to 16,000 mg/kg. To enhance data visualization, the LD50 values were log-transformed and are presented in Figure 3 Among the 10 selected compounds, kobusone exhibited the highest predicted safety margin (LD50 = 16,000 mg/kg), while isokobusone showed the lowest values (LD50 = 2610 mg/kg). Based on the ProTox 3.0 classifications, 113 compounds meeting the stringent Class V and VI safety criteria were advanced for subsequent toxicity modeling analyses. The implemented toxicity screening protocol successfully identified compounds with favorable safety profiles suitable for further pharmacological investigation. This approach not only excluded potentially hazardous compounds but also established a quantitative framework for comparing toxicity profiles across different chemical classes. The compounds were systematically assessed within the ProTox 3.0 platform through multiple toxicity prediction models, including organ toxicity, toxicity endpoints, Tox21 nuclear receptor pathways, Tox21 stress response pathways, and metabolic toxicity. For each compound, the number of toxicity models yielding probabilities ≥ 0.7 was quantified, along with the cumulative sum of these probabilities. This dual-metric approach enabled robust toxicity profiling and subsequent quartile-based classification of all compounds, as visually represented in Figure 4 Following quartile stratification, compounds within the fourth quartile (Q4), representing those with the highest toxicity potential, were systematically excluded from further analysis. This stringent filtering process resulted in the selection of 84 compounds with more favorable toxicity profiles for subsequent biological activity prediction. The quartile-based elimination approach ensured that only compounds demonstrating lower probabilities of toxicity across multiple endpoints were advanced in the screening pipeline, thereby increasing the likelihood of identifying safe and potentially bioactive candidates. 2.3. Biological Activity Prediction Compounds demonstrating favorable toxicity profiles were further evaluated for their potential biological activities using the PASS online prediction platform. Based on stringent selection criteria (probability > 0.7), ten compounds were identified as having a high likelihood of exhibiting pharmacologically relevant activities. Among these, all compounds except sinensetin showed significant potential for anti-inflammatory effects. Additionally, both sinensetin and linoleic acid exhibited a high probability of cytoprotective activity, as illustrated in Figure 5 2.4. Target Prediction and PPI Network Construction of Compounds and NDDs Molecular targets associated with neurodevelopmental disorders were systematically retrieved from the OMIM and GeneCards databases using the search terms “neurodevelopmental disorder” and “neurodevelopmental abnormalities.” Following data standardization in UniProt and removal of duplicate entries, 4671 unique targets were identified. In parallel, potential targets of the natural compounds were predicted using the SwissTargetPrediction and SuperPred platforms, which identified between 146 and 228 targets per compound. Among these, sinensetin (221 targets) and tangeretin (220 targets) exhibited the most extensive target profiles. The intersection between compound targets and neurodevelopmental disorder-related targets was evaluated using a Venn diagram approach. This analysis revealed significant overlaps for tangeretin (91 shared targets), sinensetin (99 shared targets), and selina-4(14),7(11)-dien-8-one (85 shared targets). These interactions were further visualized using a Euler diagram ( Figure 6 2.5. Enriched Pathways The selected natural compounds were evaluated for their ability to modulate 15 neurodevelopmentally relevant pathways spanning three major biological annotation systems: Gene Ontology Biological Processes, Reactome Pathway database, and Monarch Disease Ontology. This comprehensive analysis revealed significant associations between multiple compounds and pathways governing fundamental neurodevelopmental processes, including neurogenesis regulation, synaptic plasticity, and cognitive function. The findings demonstrate the compounds’ potential to influence key molecular events underlying neurodevelopmental disorder pathophysiology. The terpenoid compounds selina-4(14),7(11)-dien-8-one and isokobusone showed strong associations with core neurodevelopmental biological processes, including nervous system development (GO:0007399), cognition (GO:0050890), and learning or memory (GO:0007611). The flavonoids sinensetin and tangeretin exhibited significant modulation of pathways linked to clinical neurodevelopmental phenotypes, particularly those annotated in the Monarch Disease Ontology including neurodevelopmental abnormality (HP:0012759), cognitive impairment (HP:0100543), and intellectual disability (HP:0001249). Notably, caryophyllene oxide demonstrated involvement in both molecular mechanisms (axon guidance—R-HSA-422475) and behavioral phenotypes (autistic behavior—HP:0000729), as well as showing significant association with cognition-related pathways (GO:0050890). The compound–pathway interaction network is visualized through a multidimensional representation ( Figure 7 2.6. Compound–Target–Pathway Interactions The systematic analysis of compound–target–pathway interactions was performed using Cytoscape 3.10.3, generating an integrated network comprising 253 nodes (10 compounds, 15 pathways, and 228 targets). This network architecture was specifically designed to elucidate the complex relationships between phytochemical compounds and their potential mechanisms of action in neurodevelopmental contexts. Using CytoHubba’s degree centrality algorithm, three critical hub targets were identified: CSNK2B (degree = 18), GRIN1 (degree = 16), and MAPK1 (degree = 16). These targets occupied central positions in the network, serving as major connection points between multiple compounds and pathways. Concurrently, five pathways demonstrated exceptional connectivity: neurodevelopmental abnormality (degree = 97), nervous system development (degree = 96), cognitive impairment (degree = 87), intellectual disability (degree = 81), and neurodevelopmental delay (degree = 81). The high degree values of these elements suggest their fundamental role in the predicted pharmacological effects. The network visualization ( Figure 8 2.7. Analysis of Molecular Docking Interactions A comprehensive molecular docking analysis was conducted to characterize the binding interactions between selected natural compounds and three pivotal protein targets implicated in neurodevelopmental disorders: CSNK2B (PDB ID 3EED), GRIN1 (PDB ID 5H8H), and MAPK1 (PDB ID 6SLG). The study evaluated binding affinities, specific residue interactions, and intermolecular distances to assess potential therapeutic applications. For CSNK2B, caryophyllene oxide exhibited the most favorable binding energy (−5.4 kcal/mol), though its interaction with ARG150 occurred at suboptimal distances. Tangeretin demonstrated a more stable hydrogen bond with LYS147 (−4.7 kcal/mol), suggesting alternative binding mechanisms. GRIN1 analysis revealed caryophyllene oxide’s superior affinity (−6.7 kcal/mol versus native ligand’s −5.9 kcal/mol), mediated through π-π and π-alkyl interactions with TYR144 and PRO141. Linoleic acid also showed promising binding (−5.9 kcal/mol) via similar interactions. MAPK1 docking identified caryophyllene oxide (−9.2 kcal/mol) and miltionone II (−9.1 kcal/mol) as near-native binders, primarily engaging VAL39 through π-alkyl interactions. The heatmap visualization ( Figure 9 Figure 10 3. Discussion Computer-Aided Drug Design (CADD) has emerged as a transformative approach in modern drug discovery, enabling the rational and computationally driven optimization of lead compounds [ 29 30 Concurrently, structure-based methods, including molecular docking and network pharmacology, were employed to validate target engagement and polypharmacological potential. This hierarchical strategy achieved a remarkable 99.6% reduction in candidate compounds while preserving those with optimal multi-target profiles, such as caryophyllene oxide, which demonstrated both high predicted biological activity and favorable binding affinities across all three key targets (CSNK2B, GRIN1, and MAPK1). The demonstrated effectiveness of this computational pipeline holds particular significance for central nervous system drug development, where the blood–brain barrier presents a major obstacle and polypharmacology is often desirable [ 31 32 33 The molecular docking analysis identified significant interactions between selected natural compounds and key neuronal targets, with particularly strong binding affinities observed for caryophyllene oxide and tangeretin with CSNK2B (−5.4 and −4.7 kcal/mol, respectively), and for caryophyllene oxide and linoleic acid with GRIN1 (−6.7 and −5.9 kcal/mol). These results suggest that these compounds may effectively modulate critical neuronal pathways through specific protein interactions, as confirmed by their favorable binding energies and interaction patterns with key catalytic residues. The CSNK2B gene encodes the β subunit of casein kinase 2 (CK2), a constitutively active serine/threonine kinase that plays fundamental roles in neuronal morphology and synaptic transmission [ 34 35 CK2 orchestrates several key cellular signaling cascades that are particularly relevant to neuronal survival and function. The kinase positively regulates the Akt/GSK3β pathway, which is essential for cell growth and survival, while simultaneously inhibiting PTEN to prevent negative regulation of the PI3K/Akt pathway [ 36 37 Aberrant CK2 activity has been implicated in various neurodevelopmental and neurological disorders. In neurodevelopmental conditions, CK2 dysfunction is associated with ASD [ 35 36 37 34 Current research positions CK2 as a promising therapeutic target for epilepsy, with evidence showing that its inhibition reduces aberrant neuronal activity and seizures [ 38 39 40 41 The GRIN1 gene encodes the GluN1 subunit of N-methyl-D-aspartate receptors (NMDARs), which are ubiquitously expressed throughout the central nervous system. These receptors play pivotal roles in synaptic plasticity and neuronal development, fundamental processes underlying cognitive function. NMDAR activity must be precisely regulated within a narrow physiological range, as both excessive and insufficient activity can disrupt glutamatergic synapses and compromise neuronal integrity [ 42 43 The GluN1 subunit represents a particularly promising therapeutic target for neurodevelopmental disorders due to its obligatory role in NMDAR assembly and function [ 44 45 The development of compounds that selectively target GluN1-containing receptors while preserving physiological NMDAR activity remains an active area of investigation. Despite the therapeutic potential of GluN1-targeted approaches, significant challenges remain in developing safe and effective treatments. A major obstacle involves achieving sufficient subunit selectivity to avoid disrupting normal receptor function in unaffected neural circuits [ 46 NDDs represent a significant therapeutic challenge due to their multifactorial etiology and the side effects associated with conventional pharmacological treatments [ 47 23 In the present study, three natural compounds—caryophyllene oxide (BCPO), tangeretin (TG), and linoleic acid (LA)—emerged as particularly promising candidates for NDD therapy. These compounds demonstrated not only significant molecular interactions with key targets (CSNK2B, GRIN1, and MAPK1) but also a high probability of modulating pathways relevant to neurodevelopmental processes. Their multi-target activity profile suggests potential advantages over conventional single-target pharmacological approaches for addressing the complex neurobiology of developmental disorders. BCPO, a major sesquiterpenoid found in various essential oils, has attracted considerable scientific interest due to its broad pharmacological potential [ 48 49 50 Beyond its anti-inflammatory and neuroprotective effects, BCPO has shown sedative activity in murine studies, although this effect appears to occur through mechanisms independent of GABAergic receptor modulation [ 51 52 Linoleic acid is an essential polyunsaturated fatty acid abundantly found in vegetable oils such as soybean, corn, and sunflower. As a metabolic precursor, LA can be converted to γ-linolenic acid and subsequently to arachidonic acid, which plays a fundamental role in the synthesis of bioactive eicosanoids including prostaglandins and leukotrienes [ 53 54 LA has demonstrated significant neuroprotective properties through modulation of inflammatory responses and oxidative stress. In experimental models of Parkinson’s disease, LA exhibited antioxidant and anti-inflammatory effects, reducing neuronal damage and improving cell survival [ 55 56 Despite its neuroprotective potential, emerging evidence suggests that excessive LA intake may be associated with neurodegenerative processes, primarily due to its conversion to pro-inflammatory arachidonic acid-derived eicosanoids [ 57 58 The current evidence positions LA as a promising yet complex neuroprotective agent, requiring careful consideration of dosage and balance with other polyunsaturated fatty acids to maximize benefits while minimizing risks [ 59 Tangeretin, a flavonoid predominantly found in the peel of citrus fruits such as oranges and tangerines [ 60 61 62 Emerging evidence positions TG as a strong candidate for treating neurodegenerative disorders such as Alzheimer’s and Parkinson’s disease. Its ability to cross the blood–brain barrier and exert neuroprotective effects through multiple mechanisms has been well documented [ 63 62 64 Experimental models have demonstrated that TG administration leads to significant cognitive improvement, primarily by increasing acetylcholine levels via inhibition of acetylcholinesterase activity—a mechanism shared with current Alzheimer’s medications [ 64 65 Considering the demonstrated neuroprotective potential of BCPO, LA, and TG, future experimental studies should systematically evaluate safe and effective dosages through comprehensive in vitro assays (including cell viability, oxidative stress quantification, and neuroprotection-related gene expression analysis) to elucidate their mechanisms of action, followed by in vivo animal studies assessing behavioral parameters, oxidative/inflammatory biomarkers, and brain histopathology to fully characterize their therapeutic potential for neurological disorders. 4. Methodology 4.1. Pharmacokinetic Screening of Neuroprotective Natural Compounds The initial compound library was derived from the Traditional Chinese Medicine Systems Pharmacology Database (TCMSP) version 2.3 ( https://tcmsp-e.com/tcmsp.php To rigorously validate the pharmacokinetic properties of TCMSP-selected compounds, secondary screening was performed using the SwissADME platform ( http://www.swissadme.ch/ 4.2. Toxicity Prediction and Safety Profiling To predict the toxicity of the selected compounds, their canonical SMILES were submitted to the Prediction of Toxicity of Chemicals platform (ProTox 3.0; https://tox.charite.de/protox3/ 50 In models 2–6, predictions are categorized based on the probability of activity (toxic) or inactivity (non-toxic), whereas in the LD 50 50 To systematically identify compounds with lower toxicity potential, we implemented a quartile-based classification approach using R statistical software (version 2024) [ 66 67 Compounds in the fourth quartile (Q4), representing the highest toxicity risk, were systematically excluded from further evaluation. The complete analytical workflow was executed in RStudio 2024 using the tidyverse ecosystem, with toxicity distributions visualized through customized boxplots that highlight the quartile stratification. 4.3. Prediction of Biological Activity for Natural Compounds The canonical SMILES of natural compounds selected through toxicity screening were analyzed using the PASS Online platform 2.0 ( https://www.way2drug.com/passonline/ The natural compounds were systematically screened for key neuroprotective properties, including (1) apoptosis modulation, (2) cytoprotective effects, (3) anti-inflammatory activity, (4) antioxidant capacity, and (5) neurotrophic activity [ 68 69 67 4.4. Target Prediction for Natural Compounds and NDDs The molecular targets of selected natural compounds were identified through the TCMSP database. Additionally, 2D compound structures were retrieved from PubChem and analyzed through both SwissTargetPrediction ( http://www.swisstargetprediction.ch/ https://prediction.charite.de/ To ensure confidence in the predicted targets, specific inclusion criteria were applied for each tool. In SwissTargetPrediction, only targets displaying a non-zero prediction probability were retained for further analysis. In SuperPred 3.0, only targets with a prediction probability greater than 50% were selected. NDD-related targets were systematically retrieved from the GeneCards ( https://www.genecards.org/ https://www.omim.org/ Homo sapiens Gene nomenclature was standardized using the UniProt database ( https://www.uniprot.org/ https://bioinformatics.psb.ugent.be/webtools/Venn/ Supplementary Materials 4.5. PPI Network The overlapping targets identified between natural compounds and NDD-associated genes were analyzed using STRING database 12.0 ( https://string-db.org/ Homo sapiens 4.6. Pathway Enrichment Analysis Pathway enrichment analyses were conducted to elucidate the biological processes potentially modulated by the selected compounds and to prioritize the most promising neuroprotective candidates. Following construction of the protein–protein interaction (PPI) network in STRING, enrichment analyses were performed across three key biological annotation systems: (1) Biological Process terms from Gene Ontology (GO), (2) Reactome Pathway database, and (3) Monarch Initiative knowledgebase. Pathways with a false discovery rate (FDR) < 0.01 were deemed statistically significant. To control for false positives arising from multiple comparisons, FDR values were computed using the Benjamini–Hochberg correction method, which adjusts raw p The prioritized Gene Ontology (GO) Biological Processes included (1) ‘Cognition’, (2) ‘Regulation of synaptic transmission, glutamatergic’, (3) ‘Nervous system development’, (4) ‘Learning or memory’, and (5) ‘Regulation of neurogenesis’—all critically involved in synaptic plasticity and neural circuit function. From Reactome, the selected pathways comprised (1) ‘Axon guidance’, (2) ‘PIP3 activates AKT signaling’, (3) ‘Signaling by NTRKs’, (4) ‘Transmission across Chemical Synapses’, and (5) ‘Neuronal system’, representing core mechanisms of neuronal development and communication. The Monarch phenotypes—(1) ‘Autistic behavior’, (2) ‘Neurodevelopmental abnormality’, (3) ‘Neurodevelopmental delay’, (4) ‘Intellectual disability’, and (5) ‘Cognitive impairment’—were chosen as they capture the essential clinical manifestations of neurodevelopmental disorders. 4.7. Construction of the Compound–Target–Pathway Network An integrated network was constructed using Cytoscape 3.10.3 to visualize the complex interactions between the natural compounds, their molecular targets, and the selected neurodevelopmental pathways. Network topology analysis was performed using the CytoHubba 0.1 plugin, where targets were ranked by degree centrality to identify the most functionally significant nodes within the network architecture. This approach enabled the systematic identification of hub targets based on their connectivity patterns and presumed biological importance in the context of neurodevelopmental processes. The three most highly connected targets, identified based on their degree values within the network, were selected for investigation through molecular docking simulations. This enabled the evaluation of potential interactions between the natural compounds and these prioritized targets. 4.8. Molecular Docking The molecular docking analysis was performed to characterize binding interactions between the natural compounds and prioritized targets. Three-dimensional protein structures were obtained from the Protein Data Bank ( https://www.rcsb.org/ The 3D structures of the selected natural compounds were obtained from the PubChem database ( https://pubchem.ncbi.nlm.nih.gov/ 70 The most stable binding conformations were selected based on root-mean-square deviation (RMSD) values ≤ 2.0 Å, ensuring structural similarity and conformational stability of the docked poses. Molecular interactions were systematically characterized using Discovery Studio 2021, applying established criteria: (1) hydrogen bonds < 3.3 Å [ 71 72 4.9. Data Analysis and Graphical Visualization in RStudio The ggplot2 package was implemented to generate comprehensive visualizations, including (1) number line plots displaying predicted LC50 values, (2) boxplots illustrating quartile-based toxicity classification, (3) scatter plots of biological activity probabilities, (4) enriched pathway representations, and (5) heatmaps of molecular docking results. Toxicity probability quartiles were calculated using the dplyr::ntile(row_number(), (4) function, ensuring systematic compound stratification. Target overlap between natural compounds and neurodevelopmental disorders (NDDs) was visualized using Euler diagrams constructed with the eulerr package. 5. Conclusions This study highlights the promising neuroprotective potential of the natural compounds caryophyllene oxide (BCPO), linoleic acid (LA), and tangeretin (TG) through their multi-target interactions with key proteins (CSNK2B, GRIN1, and MAPK1) and modulation of neurodevelopmental pathways. Computational analyses revealed favorable binding affinities, BBB permeability, and low toxicity profiles, positioning these compounds as viable candidates for further investigation in neurodevelopmental and neurodegenerative disorders. Future preclinical studies should validate these findings through in vitro and in vivo experiments to assess their efficacy, optimal dosing, and safety, paving the way for potential therapeutic applications. The integration of computational and experimental approaches presented here provides a robust framework for developing novel, multi-target neuroprotective agents. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ijms26188873/s1 Author Contributions J.A.d.C.R.S.—conceptualization, methodology, investigation, formal analysis, data curation, visualization, writing—original draft. R.M.X.—writing—review and editing, validation. T.S.—supervision, validation, writing—review and editing, project administration. D.F.—supervision, validation, writing—review and editing, project administration. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1. Homberg J.R. Kyzar E.J. Scattoni M.L. Norton W.H. Pittman J. Gaikwad S. Nguyen M. Poudel M.K. Ullmann J.F.P. Diamond D.M. Genetic and Environmental Modulation of Neurodevelopmental Disorders: Translational Insights from Labs to Beds Brain Res. Bull. 2016 125 79 91 10.1016/j.brainresbull.2016.04.015 27113433 2. Thapar A. Cooper M. Rutter M. Neurodevelopmental Disorders Lancet Psychiatry 2017 4 339 346 10.1016/S2215-0366(16)30376-5 27979720 3. American Psychiatric Association Diagnostic and Statistical Manual of Mental Disorders American Psychiatric Association Publishing Arlington, VA, USA 2013 4. Ijomone O.M. Olung N.F. Akingbade G.T. Okoh C.O.A. Aschner M. Environmental Influence on Neurodevelopmental Disorders: Potential Association of Heavy Metal Exposure and Autism J. Trace Elem. Med. Biol. 2020 62 126638 10.1016/j.jtemb.2020.126638 32891009 PMC7655547 5. Parenti I. Rabaneda L.G. Schoen H. Novarino G. Neurodevelopmental Disorders: From Genetics to Functional Pathways Trends Neurosci. 2020 43 608 621 10.1016/j.tins.2020.05.004 32507511 6. Wozniak R.H. Leezenbaum N.B. Northrup J.B. West K.L. Iverson J.M. The Development of Autism Spectrum Disorders: Variability and Causal Complexity WIREs Cogn. Sci. 2017 8 e1426 10.1002/wcs.1426 PMC5182138 27906524 7. Doi M. Usui N. Shimada S. Prenatal Environment and Neurodevelopmental Disorders Front. Endocrinol. 2022 13 860110 10.3389/fendo.2022.860110 PMC8964779 35370942 8. Ozlu C. Bailey R.M. Sinnett S. Goodspeed K.D. Gene Transfer Therapy for Neurodevelopmental Disorders Dev. Neurosci. 2021 43 230 240 10.1159/000515434 33882495 9. Ghiani C.A. Faundez V. Cellular and Molecular Mechanisms of Neurodevelopmental Disorders J. Neurosci. Res. 2017 95 1093 1096 10.1002/jnr.24041 28225560 PMC5352532 10. Jiang C.-C. Lin L.-S. Long S. Ke X.-Y. Fukunaga K. Lu Y.-M. Han F. Signalling Pathways in Autism Spectrum Disorder: Mechanisms and Therapeutic Implications Signal Transduct. Target. Ther. 2022 7 229 10.1038/s41392-022-01081-0 35817793 PMC9273593 11. Baranova J. Dragunas G. Botellho M.C.S. Ayub A.L.P. Bueno-Alves R. Alencar R.R. Papaiz D.D. Sogayar M.C. Ulrich H. Correa R.G. Autism Spectrum Disorder: Signaling Pathways and Prospective Therapeutic Targets Cell Mol. Neurobiol. 2021 41 619 649 10.1007/s10571-020-00882-7 32468442 PMC11448616 12. Sadybekov A.V. Katritch V. Computational Approaches Streamlining Drug Discovery Nature 2023 616 673 685 10.1038/s41586-023-05905-z 37100941 13. Shaker B. Ahmad S. Lee J. Jung C. Na D. In Silico Methods and Tools for Drug Discovery Comput. Biol. Med. 2021 137 104851 10.1016/j.compbiomed.2021.104851 34520990 14. Xia S. Chen E. Zhang Y. Integrated Molecular Modeling and Machine Learning for Drug Design J. Chem. Theory Comput. 2023 19 7478 7495 10.1021/acs.jctc.3c00814 37883810 PMC10653122 15. Bassani D. Moro S. Past, Present, and Future Perspectives on Computer-Aided Drug Design Methodologies Molecules 2023 28 3906 10.3390/molecules28093906 37175316 PMC10180087 16. Tang Q. Chu J. Peng P. Zou Y. Wu Y. Wang Y. Probing the Antibacterial Mechanism of Aloe Vera Based on Network Pharmacology and Computational Analysis J. Mol. Graph. Model. 2025 138 109034 10.1016/j.jmgm.2025.109034 40157275 17. Hopkins A.L. Network Pharmacology: The next Paradigm in Drug Discovery Nat. Chem. Biol. 2008 4 682 690 10.1038/nchembio.118 18936753 18. Hopkins A.L. Network Pharmacology Nat. Biotechnol. 2007 25 1110 1111 10.1038/nbt1007-1110 17921993 19. Liu Y. Li H. Wang X. Huang J. Zhao D. Tan Y. Zhang Z. Zhang Z. Zhu L. Wu B. Anti-Alzheimers Molecular Mechanism of Icariin: Insights from Gut Microbiota, Metabolomics, and Network Pharmacology J. Transl. Med. 2023 21 277 10.1186/s12967-023-04137-z 37095548 PMC10124026 20. Niu B. Xie X. Xiong X. Jiang J. Network Pharmacology-Based Analysis of the Anti-Hyperglycemic Active Ingredients of Roselle and Experimental Validation Comput. Biol. Med. 2022 141 104636 10.1016/j.compbiomed.2021.104636 34809966 21. Yu X. Qin W. Cai H. Ren C. Huang S. Lin X. Tang L. Shan Z. AL-Ameer W.H.A. Wang L. Analyzing the Molecular Mechanism of Xuefuzhuyu Decoction in the Treatment of Pulmonary Hypertension with Network Pharmacology and Bioinformatics and Verifying Molecular Docking Comput. Biol. Med. 2024 169 107863 10.1016/j.compbiomed.2023.107863 38199208 22. Zhang Y. Li Z. Wei J. Kong L. Song M. Zhang Y. Xiao X. Cao H. Jin Y. Network Pharmacology and Molecular Docking Reveal the Mechanism of Angelica Dahurica against Osteosarcoma Medicine 2022 101 e31055 10.1097/MD.0000000000031055 36343039 PMC9646661 23. Asgharian P. Quispe C. Herrera-Bravo J. Sabernavaei M. Hosseini K. Forouhandeh H. Ebrahimi T. Sharafi-Badr P. Tarhriz V. Soofiyani S.R. Pharmacological Effects and Therapeutic Potential of Natural Compounds in Neuropsychiatric Disorders: An Update Front. Pharmacol. 2022 13 926607 10.3389/fphar.2022.926607 36188551 PMC9521271 24. Ashmawy N.S. Gad H.A. El-Nashar H.A.S. Comparative Study of Essential Oils from Different Organs of Syzygium Cumini (Pamposia) Based on GC/MS Chemical Profiling and In Vitro Antiaging Activity Molecules 2023 28 7861 10.3390/molecules28237861 38067590 PMC10708113 25. Grosso C. Santos M. Barroso M.F. From Plants to Psycho-Neurology: Unravelling the Therapeutic Benefits of Bioactive Compounds in Brain Disorders Antioxidants 2023 12 1603 10.3390/antiox12081603 37627598 PMC10451187 26. Bhandari R. Kuhad A. Neuropsychopharmacotherapeutic Efficacy of Curcumin in Experimental Paradigm of Autism Spectrum Disorders Life Sci. 2015 141 156 169 10.1016/j.lfs.2015.09.012 26407474 27. Sachdeva P. Mehdi I. Kaith R. Ahmad F. Anwar M.S. Potential Natural Products for the Management of Autism Spectrum Disorder Ibrain 2022 8 365 376 10.1002/ibra.12050 37786737 PMC10528773 28. Corona J.C. Natural Compounds for the Management of Parkinson’s Disease and Attention-Deficit/Hyperactivity Disorder Biomed. Res. Int. 2018 2018 4067597 10.1155/2018/4067597 30596091 PMC6282143 29. Ballardin D. Cruz-Gamero J.M. Bienvenu T. Rebholz H. Comparing Two Neurodevelopmental Disorders Linked to CK2: Okur-Chung Neurodevelopmental Syndrome and Poirier-Bienvenu Neurodevelopmental Syndrome—Two Sides of the Same Coin? Front. Mol. Biosci. 2022 9 850559 10.3389/fmolb.2022.850559 35693553 PMC9182197 30. Borgo C. D’Amore C. Sarno S. Salvi M. Ruzzene M. Protein Kinase CK2: A Potential Therapeutic Target for Diverse Human Diseases Signal Transduct. Target. Ther. 2021 6 183 10.1038/s41392-021-00567-7 33994545 PMC8126563 31. Liu Y. Xia D. Zhong L. Chen L. Zhang L. Ai M. Mei R. Pang R. Casein Kinase 2 Affects Epilepsy by Regulating Ion Channels: A Potential Mechanism CNS Neurol. Disord. Drug Targets 2024 23 894 905 10.2174/1871527322666230622124618 37350003 32. Canedo-Antelo M. Serrano M.P. Manterola A. Ruiz A. Llavero F. Mato S. Zugaza J.L. Pérez-Cerdá F. Matute C. Sánchez-Gómez M.V. Inhibition of Casein Kinase 2 Protects Oligodendrocytes from Excitotoxicity by Attenuating JNK/P53 Signaling Cascade Front. Mol. Neurosci. 2018 11 333 10.3389/fnmol.2018.00333 30271323 PMC6146035 33. Marshall C.A. McBride J.D. Changolkar L. Riddle D.M. Trojanowski J.Q. Lee V.M.-Y. Inhibition of CK2 Mitigates Alzheimer’s Tau Pathology by Preventing NR2B Synaptic Mislocalization Acta Neuropathol. Commun. 2022 10 30 10.1186/s40478-022-01331-w 35246269 PMC8895919 34. Castello J. Ragnauth A. Friedman E. Rebholz H. CK2—An Emerging Target for Neurological and Psychiatric Disorders Pharmaceuticals 2017 10 7 10.3390/ph10010007 28067771 PMC5374411 35. Korinek M. Candelas Serra M. Abdel Rahman F.E.S. Dobrovolski M. Kuchtiak V. Abramova V. Fili K. Tomovic E. Hrcka Krausova B. Krusek J. Disease-Associated Variants in GRIN1, GRIN2A and GRIN2B Genes: Insights into NMDA Receptor Structure, Function, and Pathophysiology Physiol. Res. 2024 73 (Suppl. 1) S413 S434 10.33549/physiolres.935346 38836461 PMC11412357 36. Mony L. Paoletti P. Mechanisms of NMDA Receptor Regulation Curr. Opin. Neurobiol. 2023 83 102815 10.1016/j.conb.2023.102815 37988826 37. Rouzbeh N. Rau A.R. Benton A.J. Yi F. Anderson C.M. Johns M.R. Jensen L. Lotti J.S. Holley D.C. Hansen K.B. Allosteric Modulation of GluN1/GluN3 NMDA Receptors by GluN1-Selective Competitive Antagonists J. Gen. Physiol. 2023 155 e202313340 10.1085/jgp.202313340 37078900 PMC10125900 38. Xu Y. Song R. Chen W. Strong K. Shrey D. Gedela S. Traynelis S.F. Zhang G. Yuan H. Recurrent Seizure-related GRIN1 Variant: Molecular Mechanism and Targeted Therapy Ann. Clin. Transl. Neurol. 2021 8 1480 1494 10.1002/acn3.51406 34227748 PMC8283169 39. He M. Wollmuth L.P. Activation of Excitatory Glycine NMDA Receptors: At the Mercy of a Whimsical GluN1 Subunit J. Gen. Physiol. 2023 155 e202313391 10.1085/jgp.202313391 37133818 PMC10163841 40. Urdaneta K.E. Castillo M.A. Montiel N. Semprún-Hernández N. Antonucci N. Siniscalco D. Autism Spectrum Disorders: Potential Neuro-Psychopharmacotherapeutic Plant-Based Drugs Assay Drug Dev. Technol. 2018 16 433 444 10.1089/adt.2018.848 30427697 41. Gyrdymova Y.V. Rubtsova S.A. Caryophyllene and Caryophyllene Oxide: A Variety of Chemical Transformations and Biological Activities Chem. Pap. 2022 76 1 39 10.1007/s11696-021-01865-8 42. Moghrovyan A. Parseghyan L. Sevoyan G. Darbinyan A. Sahakyan N. Gaboyan M. Karabekian Z. Voskanyan A. Antinociceptive, Anti-Inflammatory, and Cytotoxic Properties of Origanum Vulgare Essential Oil, Rich with β-Caryophyllene and β-Caryophyllene Oxide Korean J. Pain 2022 35 140 151 10.3344/kjp.2022.35.2.140 35354677 PMC8977206 43. Karakaya S. Yilmaz S.V. Özdemir Ö. Koca M. Pınar N.M. Demirci B. Yıldırım K. Sytar O. Turkez H. Baser K.H.C. A Caryophyllene Oxide and Other Potential Anticholinesterase and Anticancer Agent in Salvia Verticillata Subsp. Amasiaca (Freyn & Bornm.) Bornm. (Lamiaceae) J. Essent. Oil Res. 2020 32 512 525 10.1080/10412905.2020.1813212 44. Dougnon G. Ito M. Essential Oil from the Leaves of Chromolaena Odorata, and Sesquiterpene Caryophyllene Oxide Induce Sedative Activity in Mice Pharmaceuticals 2021 14 621 10.3390/ph14070651 34358077 PMC8308581 45. Oppong-Damoah A. Blough B.E. Makriyannis A. Murnane K.S. The Sesquiterpene Beta-Caryophyllene Oxide Attenuates Ethanol Drinking and Place Conditioning in Mice Heliyon 2019 5 e01915 10.1016/j.heliyon.2019.e01915 31245644 PMC6581871 46. Whelan J. Fritsche K. Linoleic Acid Adv. Nutr. 2013 4 311 312 10.3945/an.113.003772 23674797 PMC3650500 47. Djuricic I. Calder P.C. Beneficial Outcomes of Omega-6 and Omega-3 Polyunsaturated Fatty Acids on Human Health: An Update for 2021 Nutrients 2021 13 2421 10.3390/nu13072421 34371930 PMC8308533 48. Alarcon-Gil J. Sierra-Magro A. Morales-Garcia J.A. Sanz-SanCristobal M. Alonso-Gil S. Cortes-Canteli M. Niso-Santano M. Martínez-Chacón G. Fuentes J.M. Santos A. Neuroprotective and Anti-Inflammatory Effects of Linoleic Acid in Models of Parkinson’s Disease: The Implication of Lipid Droplets and Lipophagy Cells 2022 11 2297 10.3390/cells11152297 35892594 PMC9331796 49. Mbiydzenyuy N.E. Ninsiima H.I. Valladares M.B. Pieme C.A. Zinc and Linoleic Acid Pre-Treatment Attenuates Biochemical and Histological Changes in the Midbrain of Rats with Rotenone-Induced Parkinsonism BMC Neurosci. 2018 19 29 10.1186/s12868-018-0429-9 29739324 PMC5941606 50. Kousparou C. Fyrilla M. Stephanou A. Patrikios I. DHA/EPA (Omega-3) and LA/GLA (Omega-6) as Bioactive Molecules in Neurodegenerative Diseases Int. J. Mol. Sci. 2023 24 10717 10.3390/ijms241310717 37445890 PMC10341783 51. Taha A.Y. Linoleic Acid–Good or Bad for the Brain? NPJ Sci. Food 2020 4 1 10.1038/s41538-019-0061-9 31909187 PMC6940357 52. Dec K. Alsaqati M. Morgan J. Deshpande S. Wood J. Hall J. Harwood A.J. A High Ratio of Linoleic Acid (n-6 PUFA) to Alpha-Linolenic Acid (n-3 PUFA) Adversely Affects Early Stage of Human Neuronal Differentiation and Electrophysiological Activity of Glutamatergic Neurons in Vitro Front. Cell Dev. Biol. 2023 11 1166808 10.3389/fcell.2023.1166808 37255597 PMC10225581 53. Fatima J. Siddique Y.H. The Neuroprotective Role of Tangeritin CNS Neurol. Disord. Drug Targets 2025 24 144 157 10.2174/0118715273325789240904065214 39297465 54. de Luna F.C.F. Ferreira W.A.S. Casseb S.M.M. de Oliveira E.H.C. Anticancer Potential of Flavonoids: An Overview with an Emphasis on Tangeretin Pharmaceuticals 2023 16 1229 10.3390/ph16091229 37765037 PMC10537037 55. Wani I. Koppula S. Balda A. Thekkekkara D. Jamadagni A. Walse P. Manjula S.N. Kopalli S.R. An Update on the Potential of Tangeretin in the Management of Neuroinflammation-Mediated Neurodegenerative Disorders Life 2024 14 504 10.3390/life14040504 38672774 PMC11051149 56. Datla K.P. Christidou M. Widmer W.W. Rooprai H.K. Dexter D.T. Tissue Distribution and Neuroprotective Effects of Citrus Flavonoid Tangeretin in a Rat Model of Parkinson’s Disease Neuroreport 2001 12 3871 3875 10.1097/00001756-200112040-00053 11726811 57. Alla N. Palatheeya S. Challa S.R. Kakarla R. Tangeretin Confers Neuroprotection, Cognitive and Memory Enhancement in Global Cerebral Ischemia in Rats 3 Biotech 2024 14 9 10.1007/s13205-023-03854-y 38074289 PMC10709536 58. Arafa E.-S.A. Shurrab N.T. Buabeid M.A. Therapeutic Implications of a Polymethoxylated Flavone, Tangeretin, in the Management of Cancer via Modulation of Different Molecular Pathways Adv. Pharmacol. Pharm. Sci. 2021 2021 4709818 10.1155/2021/4709818 33748757 PMC7954633 59. Posit team RStudio: Integrated Development Environment for R Posit Software Boston, MA, USA 2024 60. Goel R.K. Singh D. Lagunin A. Poroikov V. PASS-Assisted Exploration of New Therapeutic Potential of Natural Products Med. Chem. Res. 2011 20 1509 1514 10.1007/s00044-010-9398-y 61. Bagli E. Goussia A. Moschos M.M. Agnantis N. Kitsos G. Natural Compounds and Neuroprotection: Mechanisms of Action and Novel Delivery Systems Vivo 2016 30 535 547 27566070 62. Mohd Sairazi N.S. Sirajudeen K.N.S. Natural Products and Their Bioactive Compounds: Neuroprotective Potentials against Neurodegenerative Diseases Evid. Based Complement. Altern. Med. 2020 2020 6565396 10.1155/2020/6565396 PMC7042511 32148547 63. Trott O. Olson A.J. AutoDock Vina: Improving the Speed and Accuracy of Docking with a New Scoring Function, Efficient Optimization, and Multithreading J. Comput. Chem. 2010 31 455 461 10.1002/jcc.21334 19499576 PMC3041641 64. McREE D.E. Computational Techniques Practical Protein Crystallography McREE D.E. Elsevier San Diego, CA, USA 1999 91 267 65. Ribas J. Cubero E. Luque F.J. Orozco M. Theoretical Study of Alkyl-π and Aryl-π Interactions. Reconciling Theory and Experiment J. Org. Chem. 2002 67 7057 7065 10.1021/jo0201225 12354000 66. Niazi S.K. Mariam Z. Computer-Aided Drug Design and Drug Discovery: A Prospective Analysis Pharmaceuticals 2023 17 22 10.3390/ph17010022 38256856 PMC10819513 67. Salmanli M. Tatar Yilmaz G. Tuzuner T. Investigation of the Antimicrobial Activities of Various Antimicrobial Agents on Streptococcus Mutans Sortase A through Computer-Aided Drug Design (CADD) Approaches Comput. Methods Programs Biomed. 2021 212 106454 10.1016/j.cmpb.2021.106454 34656905 68. Correia A.C. Monteiro A.R. Silva R. Moreira J.N. Sousa Lobo J.M. Silva A.C. Lipid Nanoparticles Strategies to Modify Pharmacokinetics of Central Nervous System Targeting Drugs: Crossing or Circumventing the Blood–Brain Barrier (BBB) to Manage Neurological Disorders Adv. Drug Deliv. Rev. 2022 189 114485 10.1016/j.addr.2022.114485 35970274 69. Wu F. Zhou Y. Li L. Shen X. Chen G. Wang X. Liang X. Tan M. Huang Z. Computational Approaches in Preclinical Studies on Drug Discovery and Development Front. Chem. 2020 8 726 10.3389/fchem.2020.00726 33062633 PMC7517894 70. Wang Y. Hu B. Feng S. Wang J. Zhang F. Target Recognition and Network Pharmacology for Revealing Anti-Diabetes Mechanisms of Natural Product J. Comput. Sci. 2020 45 101186 10.1016/j.jocs.2020.101186 71. Li J. Gao K. Cai S. Liu Y. Wang Y. Huang S. Zha J. Hu W. Yu S. Yang Z. Germline de Novo Variants in CSNK2B in Chinese Patients with Epilepsy Sci. Rep. 2019 9 17909 10.1038/s41598-019-53484-9 31784560 PMC6884442 72. Al-Ayadhi L. Bhat R.S. Alghamdi F.A. Alhadlaq A.S. El-Ansary A. Influence of Auditory Integrative Training on Casein Kinase 2 and Its Impact on Behavioral and Social Interaction in Children with Autism Spectrum Disorder Curr. Issues Mol. Biol. 2023 45 4317 4330 10.3390/cimb45050274 37232743 PMC10217117 Figure 1 Flowchart of screening process for natural compounds with neuroprotective potential. Figure 2 The chemical structures of the selected natural compounds: ( a b c d e f g h i j Figure 3 The predicted LD50 values of the natural compounds on a logarithmic scale. The dots represent the log10(LD50) values for each compound analyzed. Selected compounds are indicated with specific colors and associated names. Smaller gray dots correspond to non-selected compounds. Figure 4 Classification of compounds into quartiles based on the number of endpoints with a toxicity probability ≥ 0.7. Each color represents a quartile, allowing for visualization of compounds with lower toxicity levels (Q1) compared to the most toxic ones (Q4). The dot above Quartile 1 represents a compound with one predicted toxic endpoint ( p Figure 5 Predicted probabilities from the PASS online database for biological activities related to the neuroprotection of natural compounds, with the most promising compounds highlighted in specific colors. A probability cutoff of 0.7 is marked by the dashed red line. Figure 6 A Euler diagram showing the overlap between molecular targets of natural compounds and targets associated with neurodevelopmental disorders. The internal numbers indicate the quantity of shared targets between each compound and neurodevelopmental disorder targets, while external numbers represent the count of unique targets. Figure 7 Graphical representation of selected Gene Ontology (Biological Process), Reactome Pathway, and Monarch pathways, with circle sizes representing gene counts and color gradient (blue-to-red) showing −log10(FDR) values for compound–pathway associations. Figure 8 The relationships between the selected natural compounds (central green nodes), enriched pathways (peripheral orange nodes), and molecular targets (yellow nodes). Node size scales proportionally with degree centrality, reflecting each element’s connectivity within the network. Figure 9 The heatmap displays the predicted binding energies of natural compounds (y-axis) against the three target proteins (x-axis). The yellow-to-red color gradient represents the binding affinity values, with red indicating the most favorable (lowest) binding energies and yellow corresponding to weaker interactions. OL denotes the original reference ligand for each protein target. Figure 10 A structural representation of the most relevant binding interactions between natural compounds and target proteins: ( a b c d ijms-26-08873-t001_Table 1 Table 1 The pharmacological parameters of the selected natural compounds obtained from the TCMSP database and the SwissADME platform.  TCMSP SwissADME Compound Molecular Weight OB (%) CaCo-2 BBB DL GI Absorption BBB Permeant Bioavailability Score Lipinski Kobusone 222.36 39.16 1.01 1.08 0.13 High Yes 0.55 Yes Miltionone II 312.39 71.03 0.62 0.03 0.44 High Yes 0.85 Yes Caryophyllene oxide 220.39 34.43 1.09 1.81 0.13 High Yes 0.55 Yes α-humulene epoxide 220.39 23.66 1.58 1.77 0.10 High Yes 0.55 Yes Selina-4(14),7(11)-dien-8-one 218.37 32.31 1.42 0.57 0.10 High Yes 0.55 Yes Osthol 244.31 38.75 1.15 0.85 0.13 High Yes 0.55 Yes Isokobusone 222.36 39.63 0.67 0.51 0.11 High Yes 0.55 Yes Linoleic acid 280.50 41.90 1.16 0.90 0.14 High Yes 0.85 Yes Tangeretin 372.40 21.38 1.23 0.09 0.43 High Yes 0.55 Yes Sinensetin 372.40 50.56 1.12 0.04 0.45 High Yes 0.55 Yes OB = oral bioavailability, CaCo-2 = intestinal permeability, BBB = blood–brain barrier permeability, GI = gastrointestinal absorption, and DL = drug-likeness. ",
  "metadata": {
    "Title of this paper": "Influence of Auditory Integrative Training on Casein Kinase 2 and Its Impact on Behavioral and Social Interaction in Children with Autism Spectrum Disorder",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470177/"
  }
}