{
  "title": "Paper_234",
  "abstract": "pmc Antimicrob Agents Chemother Antimicrob Agents Chemother 82 aac aac Antimicrobial Agents and Chemotherapy 0066-4804 1098-6596 American Society for Microbiology (ASM) PMC12486858 PMC12486858.1 12486858 12486858 40934387 10.1128/aac.01060-24 aac01060-24 aac.01060-24 1 Minireview antimicrobial-chemotherapy Antimicrobial Chemotherapy Therapeutic approach to difficult-to-treat multidrug-resistant enterococcal infections Turner Adrianna M.  1 Data curation Writing – original draft Writing – review and editing https://orcid.org/0000-0002-6167-9366 Kinsella Paul  1  2 Data curation Writing – original draft Writing – review and editing https://orcid.org/0000-0002-1518-2973 Miller William R.  3  4  5 Data curation Carter Glen P.  1 Data curation Writing – original draft Writing – review and editing https://orcid.org/0000-0002-2696-4196 Tran Truc T.  3  4  5 Data curation Writing – original draft Writing – review and editing https://orcid.org/0000-0003-0237-1473 Howden Benjamin P.  1  2  6  7 Data curation Writing – original draft Writing – review and editing https://orcid.org/0000-0001-9054-9774 Arias Cesar A.  3  4  5 Data curation Writing – original draft Writing – review and editing caarias@houstonmethodist.org caa22@cantab.net 1 Department of Microbiology and Immunology, The University of Melbourne at the Peter Doherty Institute for Infection and Immunity https://ror.org/016899r71 Melbourne Australia 2 Microbiology Department, Royal Melbourne Hospital https://ror.org/005bvs909 Melbourne Australia 3 Division of Infectious Diseases, Department of Medicine, Houston Methodist Hospital 23534 Houston Texas USA 4 Center for Infectious Diseases, Houston Methodist Research Institute 167626 Houston Texas USA 5 Department of Medicine, Weill Cornell Medical College 12295 New York New York USA 6 Department of Infectious Diseases and Immunology, Austin Health 3805 https://ror.org/05dbj6g52 Heidelberg Australia 7 Microbiological Diagnostic Unit Public Health Laboratory, Department of Microbiology and Immunology, The University of Melbourne at the Peter Doherty Institute for Infection and Immunity Melbourne Australia Editor Doernberg Sarah University of California San Francisco San Francisco California USA Address correspondence to Cesar A. Arias, caarias@houstonmethodist.org caa22@cantab.net Adrianna M. Turner and Paul Kinsella contributed equally to this article. The author order was determined by mutual agreement. W.R.M. has received grant support from Merck and royalties from UpToDate. C.A.A. has received royalties from UpToDate. All other authors report no conflict of interest. 10 2025 11 9 2025 69 10 498088 e01060-24 11 09 2025 02 10 2025 02 10 2025 Copyright © 2025 Turner et al. 2025 Turner et al. https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution 4.0 International license ABSTRACT Difficult-to-treat (DTR) enterococcal infections, particularly those caused by multidrug-resistant Enterococcus faecium Enterococcus faecalis in vitro KEYWORDS Enterococcus difficult-to-treat infection vancomycin resistance National Health and Medical Research Council http://dx.doi.org/10.13039/501100000925 GNT1185213 Carter Glen P. National Health and Medical Research Council http://dx.doi.org/10.13039/501100000925 GNT1196103 Howden Benjamin P. National Institute of Allergy and Infectious Diseases http://dx.doi.org/10.13039/100000060 K24AI121296, R01AI134637, R01AI148342, P01AI152999 Arias Cesar A. National Institute of Allergy and Infectious Diseases http://dx.doi.org/10.13039/100000060 K08AI135093, R21AI175821 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date October 2025 INTRODUCTION Healthcare-associated infections caused by multidrug-resistant (MDR) bacteria are a critical public health threat associated with high rates of treatment failure, morbidity, and mortality. Enterococci are commensals of the human gastrointestinal tract (GIT) that have emerged as leading causes of nosocomial infections, particularly in critically ill and immunocompromised patients ( 1 One of the most challenging issues that clinicians encounter when faced with an invasive enterococcal infection is the limited choice of antimicrobial agents since many hospital-associated isolates (e.g., Enterococcus faecium E. faecium 2 Another major issue when dealing with enterococcal infections is the paucity of clinical data supporting a particular treatment. Despite the increasing number of patients infected by these organisms, robust clinical data to guide therapy in severe enterococcal infections are lacking. Here, we provide an updated overview (2022–2024) of the therapeutic options and approaches for drug optimization in difficult-to-treat (DTR) vancomycin-resistant enterococcal (VRE) infections. Although low-level vancomycin resistance is intrinsic to some Enterococcus Enterococcus faecalis E. faecium ENTEROCOCCI IN THE HEALTHCARE SETTING Enterococci can survive for long periods on environmental surfaces like medical equipment, bed rails, and doorknobs ( 3 4 5 E. faecalis E. faecium 6 E. faecium E. faecium 7 8 9 4 10 11 12 12 13 DIFFICULT-TO-TREAT MULTIDRUG-RESISTANT ENTEROCOCCAL INFECTIONS There is no agreed universal definition of what constitutes a DTR enterococcal infection. For ease of discussion, here we are using the term “difficult-to-treat” to include infections that are either “persistent” (failure to eradicate the organism despite seemingly appropriate antimicrobial therapy) or “recurrent” (defined as patients who had clearance of the bacteremia during hospitalization, with a second positive culture also during this period) ( 2 A cohort study of patients with enterococcal bacteremia (VENOUS) by Contreras et al. examined several outcomes, including lack of clearance of the organisms on day 4 while receiving at least 48 hours of active anti-enterococcal therapy (described as “microbiological failure”) ( 2 14 15 16 Clinically, DTR bacteremia is influenced by many factors, including source control of deep-seated infections ( 17 18 19 E. faecalis E. faecium 20 E. faecium 21 n 22 There are limited therapeutic options for the treatment of VRE bacteremia, as well as a paucity of new antimicrobial agents in the development pipeline. In the next sections, we describe the recent evidence for available treatment options for VRE infections, particularly focused on the importance of dose optimization and the emerging role of combination therapies. Daptomycin and combinations Mechanisms of action and resistance Daptomycin (DAP) is a cyclic lipopeptide that was first approved for clinical use in the United States (2003) for complicated skin and skin structure infections (cSSTIs) (4 mg/kg of body weight) and later for bacteremia and right-sided endocarditis caused by Staphylococcus aureus 23 23 in vitro E. faecalis E. faecium 24 E. faecium 25 26 DAP resistance is most commonly associated with two distinct sets of mutations involving cell envelope stress response systems (such as liaFSR, walKR, madRS cls, gdpD dak cfa 27 28 rpoB 29 30 E. faecalis E. faecium cls 28 31 in vitro 32 33 34 35 36 ex vivo in vivo Clinical use of DAP monotherapy The body of evidence suggests that the FDA-approved dose of DAP for S. aureus 37 38 in vitro 32 P P 37 P 39 in vitro Combination of DAP plus other antibiotics Due to the propensity of enterococci to develop resistance during therapy and the ability of these organisms to become tolerant to DAP after their cell envelope stress responses are activated by DAP and antimicrobial peptides produced by the innate immune system, there is an argument that DAP monotherapy (even at high doses) may still be inadequate to treat severe enterococcal infections, especially high inoculum infections (e.g., infective endocarditis [IE]) ( 40 E. faecalis E. faecium in vitro in vivo 35 36 E. faecium 41 42 43 Using a PK/PD model of infective endocarditis, the combinations of DAP plus ampicillin, ertapenem, or ceftaroline exhibited enhanced efficacy against E. faecium 44 44 E. faecium 35 in vivo 35 40 P Table 1 45 46 47 TABLE 1 Emerging evidence (from 2022) for DAP combination therapies for VRE infections a Combination antimicrobial(s) Design Dose/median dose Conclusion Reference β-lactam Carbapenem, Penicillin, Cephalosporin Observational multi-cohort n n n Daptomycin: mean 10 mg/kg Daptomycin + β-lactam had a higher clinical success rate than daptomycin alone, in those with MIC < Chuang et al. ( 45 β-lactam Carbapenem, Penicillin Case report Daptomycin: 10 mg/kg Successful treatment of a bone and joint infection caused by VRE using high-dose daptomycin plus β-lactams La et al . 46 Fosfomycin Prospective cohort ( n Daptomycin: median 10.18 mg/kg (IQR 9.43–10.70) Higher daptomycin doses and fosfomycin susceptibility were independently associated with lower mortality in patients with VRE BSI Chuang et al. ( 48 Fosfomycin Retrospective cohort ( n n n Daptomycin: median 9.8 mg/kg (IQR 9.0–10.4) The combination of high-dose daptomycin therapy with fosfomycin improved the survival rate in patients with VRE BSI Tseng et al. ( 49 Chloramphenicol Case report Daptomycin: 7–10 mg/kg First case of a VRE endocarditis infection that was successfully managed with daptomycin and chloramphenicol combination therapy Shah et al. ( 50 Phage Φ9184 or ΦHi3 Case report Daptomycin dose not reported 9 9 A case of recurrent VRE BSI for 7 years, which failed antibiotics. Bacteremia resolved 24 hours after Φ9184 administration combined with daptomycin, but recurrence occurred after 31 days. The patient remained VRE BSI-free after the addition of 2 phages and daptomycin Stellfox et al. ( 51   a DAP, daptomycin; BL, β-lactam; BSI, bloodstream infection; IE, infective endocarditis; IQR, interquartile range. Fosfomycin, an antibiotic that interferes with early stages of peptidoglycan synthesis, has synergism with DAP against methicillin-resistant Staphylococcus aureus 52 53 in vitro 48 49 Linezolid and other oxazolidinones Linezolid is an oxazolidinone with bacteriostatic activity against Gram-positive bacteria, including E. faecium E. faecalis E. faecalis E. faecium 54 55 cfr poxtA optrA 56 poxtA optrA 57 58 The clinical breakpoint for linezolid susceptibility in Enterococcus Enterococcus 59 f 24 59 f 24 60 61 P 62 f 24 P P 62 Several studies have examined risk factors for clinical failure or the emergence of resistance to linezolid. In an 11-year retrospective cohort study (2007–2018) of patients who failed linezolid therapy for VRE BSI, early initiation of linezolid treatment within the first 48 hours of bacteremia (as compared to no VRE active therapy) was a protective factor from mortality in the univariate analysis ( P P 63 64 P P P 65 P 66 67 Tedizolid is approved in the United States (2014) and European Union (2015) for the treatment of acute bacterial skin and skin structure infections (ABSSSIs) caused by susceptible Gram-positive bacteria. Tedizolid exhibits higher potency than linezolid and retains lower MICs against linezolid-resistant Enterococcus Staphylococcus in vivo S. aureus cfr 68 69 cfr E. faecium 70 E. faecalis 71 72 0-24 73 0-τ 74 75 Contezolid is in late-stage clinical development and is only approved by the National Medical Products Administration in China for the treatment of complicated skin and soft tissue infections in susceptible bacteria ( 76 Enterococcus E. faecalis E. faecium 77 Due to the difficulties in treating DTR enterococcal infections, there is a reasonable consideration to use linezolid as part of a combination regimen. However, most in vitro in vitro n 78 in vitro 10 in vitro E. faecium 79 Newer tetracyclines (tigecycline, eravacycline, and omadacycline) Tigecycline is a semisynthetic glycylcycline that has enhanced binding to the 16S rRNA, which can evade some tetracycline resistance mechanisms mediated through the tet in vitro E. faecium E. faecalis tet tet E. faecium rpsJ tet de novo 80 Eravacycline is a novel fluorocycline approved for treating complicated intra-abdominal infections caused by Gram-negative and Gram-positive bacteria. EUCAST breakpoints for eravacycline for both E. faecalis E. faecium in vitro E. faecalis E. faecium 81 E. faecium 81 E. faecalis n E. faecium n 90 82 tet tet tet tet tet tet tet rpsJ 83 Omadacycline is an aminomethylcycline antibiotic that has an FDA-approved indication for ABSSSI caused by susceptible bacteria (includes E. faecalis E. faecium E. faecalis 84 in vitro E. faecium 50 90 E faecium 85 in vivo E. faecium 85 One of the main limitations of the newer tetracyclines is that these compounds do not reach sufficient concentrations in blood to be considered agents of choice for enterococcal bacteremia. However, these compounds achieve high tissue concentrations, particularly in the biliary tract, making them useful in the treatment of intra-abdominal infections since their spectrum of activity also targets multidrug-resistant Enterobacterales, which are common pathogens in these infections. This pharmacological property and robust in vitro 86 Oritavancin Lipoglycopeptides (dalbavancin and oritavancin) are long-lasting, semisynthetic antimicrobials with potent activity against Gram-positive bacterial pathogens. Unlike dalbavancin, oritavancin has in vitro vanA vanB 87 88 89 90 E. faecium vanA optrA cfrD 91 92 93 92 in vitro 94 Teicoplanin for vanB-carrying enterococcal infections Teicoplanin is a bactericidal glycopeptide antibiotic with a mechanism of action similar to vancomycin. Teicoplanin retains activity against VRE carrying the vanB vanA vanB vanB vanB 95 P P 95 96 P P E. faecium vanB EMERGENCE OF THE PENICILLIN-RESISTANT, AMPICILLIN-SUSCEPTIBLE PHENOTYPE IN ENTEROCOCCUS FAECALIS The current standard of care for severe infections (including IE) caused by E. faecalis 97 98 E. faecalis 99 – 101 E. faecalis 102 99 103 in vitro in vivo 104 E. faecalis n 99 E. faecalis 105 105 E. faecalis 106 107 PHAGE AS AN EMERGING TREATMENT OPTION The dissemination of front- and last-line antimicrobial resistance in E. faecium E. faecalis 108 109 in vitro 110 epaE, epaR, epaW Enterococcus Phages also offer a potential adjunctive therapy for patients who do not respond to antibiotic treatment alone. Pre-clinical studies have demonstrated a synergistic effect from combining phages with systemic antibiotics, with certain phages able to “rescue” DAP susceptibility in resistant E. faecium in vitro E. faecium E. faecium, 51 Enterococcus SUGGESTED APPROACH FOR DTR ENTEROCOCCAL INFECTIONS Difficult-to-treat enterococcal infections usually occur in debilitated patients with multiple co-morbidities, particularly in those with hematological malignancies or solid organ transplants. Infective enterococcal endocarditis (mostly caused by E. faecalis Fig. 1 Fig 1 Suggested approach for difficult-to-treat enterococcal infections in high-risk patients (see text). PEN, penicillin; AMP, ampicillin; CRO, ceftriaxone; GEN, gentamicin; DAP, daptomycin; LZD, linezolid; ORI, oritavancin; TIG, tigecycline; ERV, eravacycline. a b c in vitro Flowchart outlines treatment of high risk patients based on E. faecalis or E. faecium with resistance status, listing AMP, DAP, LZD, CRO, GEN, TIG, ERV, ORI plus active agents accordingly. The standard of care for severe infections caused by E. faecalis 104 pbp4 Fig. 1 For multidrug-resistant E. faecium in vitro Fig. 1 Linezolid monotherapy or in combination with other agents is also a possibility. However, as discussed above, linezolid does not show robust evidence of synergism with any particular anti-enterococcal agent, resistance can emerge with single mutations in the 23S rRNA genes, and the toxicity profile may limit its administration for prolonged periods of time. The rationale for adding linezolid or other agents is based on increasing activity against the infecting organisms and, possibly, impairing the ability to develop resistance. An interesting phenomenon is the emergence of a “triple threat” in enterococci that includes resistance to ampicillin, vancomycin, and DAP. The antimicrobial choices are limited in this scenario. However, due to the see-saw effect, it seems reasonable to include the combination of DAP plus ampicillin, plus the addition of another active agent (e.g., linezolid, eravacycline/tigecycline, Fig. 1 in vitro E. faecium 94 Fig. 1 CONCLUDING REMARKS AND FUTURE DIRECTIONS Multidrug-resistant enterococcal infections continue to be a major clinical challenge. The situation is compounded by the fact that clinical data are lacking to inform the best therapeutic approaches for these DTR infections. In the majority of cases, mechanistic insights supported by in vitro in vivo in vitro REFERENCES 1 Sherry NL Lee RS Gorrie CL Kwong JC Stuart RL Korman TM Marshall C Higgs C Chan HT Graham M Johnson PDR Leroi MJ Reed C Richards MJ Slavin MA Worth LJ Howden BP Grayson ML Controlling Superbugs Study Group 2021 Pilot study of a combined genomic and epidemiologic surveillance program for hospital-acquired multidrug-resistant pathogens across multiple hospital networks in Australia Infect Control Hosp Epidemiol 42 573 581 10.1017/ice.2020.1253 34008484 2 Contreras GA Munita JM Simar S Luterbach C Dinh AQ Rydell K Sahasrabhojane PV Rios R Diaz L Reyes K et al. 2022 Contemporary clinical and molecular epidemiology of vancomycin-resistant enterococcal bacteremia: a prospective multicenter cohort study (VENOUS I) Open Forum Infect Dis 9 ofab616 10.1093/ofid/ofab616 35155713 PMC8830530 3 Bradley CR Fraise AP 1996 Heat and chemical resistance of enterococci J Hosp Infect 34 191 196 10.1016/s0195-6701(96)90065-1 8923273 4 Pidot SJ Gao W Buultjens AH Monk IR Guerillot R Carter GP Lee JYH Lam MMC Grayson ML Ballard SA Mahony AA Grabsch EA Kotsanas D Korman TM Coombs GW Robinson JO Gonçalves da Silva A Seemann T Howden BP Johnson PDR Stinear TP 2018 Increasing tolerance of hospital Enterococcus faecium to handwash alcohols Sci Transl Med 10 eaar6115 10.1126/scitranslmed.aar6115 30068573 5 Arias CA Murray BE 2012 The rise of the Enterococcus: beyond vancomycin resistance Nat Rev Microbiol 10 266 278 10.1038/nrmicro2761 22421879 PMC3621121 6 García-Solache M Rice LB 2019 The Enterococcus: a model of adaptability to its environment Clin Microbiol Rev 32 e00058-18 10.1128/CMR.00058-18 30700430 PMC6431128 7 Galloway-Peña J Roh JH Latorre M Qin X Murray BE 2012 Genomic and SNP analyses demonstrate a distant separation of the hospital and community-associated clades of Enterococcus faecium Plos One 7 e30187 10.1371/journal.pone.0030187 22291916 PMC3266884 8 Lebreton F van Schaik W McGuire AM Godfrey P Griggs A Mazumdar V Corander J Cheng L Saif S Young S Zeng Q Wortman J Birren B Willems RJL Earl AM Gilmore MS 2013 Emergence of epidemic multidrug-resistant Enterococcus faecium from animal and commensal strains mBio 4 e00534-13 10.1128/mBio.00534-13 23963180 PMC3747589 9 Mills EG Hewlett K Smith AB Griffith MP Pless L Sundermann AJ Harrison LH Zackular JP Van Tyne D 2025 Bacteriocin production facilitates nosocomial emergence of vancomycin-resistant Enterococcus faecium Nat Microbiol 10 871 881 10.1038/s41564-025-01958-0 40119148 PMC11964922 10 Kaki R Yu Y O’Neill C Lee C Mertz D Hamilton Health Sciences Infection Prevention and Control Team 2014 Vancomycin-resistant enterococcus (VRE) transmission and risk factors in contacts of VRE carriers Infect Control Hosp Epidemiol 35 876 879 10.1086/676864 24915218 11 Ziakas PD Pliakos EE Zervou FN Knoll BM Rice LB Mylonakis E 2014 MRSA and VRE colonization in solid organ transplantation: a meta-analysis of published studies Am J Transplant 14 1887 1894 10.1111/ajt.12784 25040438 12 Alevizakos M Gaitanidis A Nasioudis D Tori K Flokas ME Mylonakis E 2017 Colonization with vancomycin-resistant enterococci and risk for bloodstream infection among patients with malignancy: a systematic review and meta-analysis Open Forum Infect Dis 4 ofw246 10.1093/ofid/ofw246 28480243 PMC5414102 13 Ponce DM Kosuri S Khera N DeFilipp Z Lichter D Lombardo M-J Peled JU van den Brink MRM Chafee M Wortman JR Straub T Walsh E Ge A Lyttle D Brady K Puhl MD Glick G Hasson BR Tejura B Ford CB Henn MR von Moltke L 2024 Preliminary results of the open-label phase of a 2-part phase 1b study that evaluates safety, tolerability, pharmacokinetics, and efficacy of investigational microbiome therapeutic SER-155 in adults undergoing allogeneic Hematopoietic Cell Transplantation (allo-HCT) Transplantation and Cellular Therapy 30 S266 10.1016/j.jtct.2023.12.355 14 Shukla BS Shelburne S Reyes K Kamboj M Lewis JD Rincon SL Reyes J Carvajal LP Panesso D Sifri CD Zervos MJ Pamer EG Tran TT Adachi J Munita JM Hasbun R Arias CA 2016 Influence of minimum inhibitory concentration in clinical outcomes of Enterococcus faecium bacteremia treated with daptomycin: is it time to change the breakpoint? Clin Infect Dis 62 1514 1520 10.1093/cid/ciw173 27045126 PMC4885651 15 Simar SR Tran TT Rydell KB Atterstrom RL Sahasrabhojane PV Dinh AQ Schettino MG Slanis HS Deyanov AE DeTranaltes AM et al. 2025 Clinical and genomic characterization of recalcitrant enterococcal bacteremia: a multicenter prospective cohort study (VENOUS) J Infect Dis jiaf358 10.1093/infdis/jiaf358 40629152 16 Rogers R Rice LB 2024 State-of-the-art review: persistent enterococcal bacteremia Clin Infect Dis 78 e1 e11 10.1093/cid/ciad612 38018162 17 Barie PS Christou NV Dellinger EP Rout WR Stone HH Waymack JP 1990 Pathogenicity of the Enterococcus in surgical infections Ann Surg 212 155 159 10.1097/00000658-199008000-00007 2198000 PMC1358050 18 Ubeda C Taur Y Jenq RR Equinda MJ Son T Samstein M Viale A Socci ND van den Brink MRM Kamboj M Pamer EG 2010 Vancomycin-resistant Enterococcus domination of intestinal microbiota is enabled by antibiotic treatment in mice and precedes bloodstream invasion in humans J Clin Invest 120 4332 4341 10.1172/JCI43918 21099116 PMC2993598 19 Caballero S Kim S Carter RA Leiner IM Sušac B Miller L Kim GJ Ling L Pamer EG 2017 Cooperating commensals restore colonization resistance to vancomycin-resistant Enterococcus faecium Cell Host Microbe 21 592 602 10.1016/j.chom.2017.04.002 28494240 PMC5494988 20 Arias CA Contreras GA Murray BE 2010 Management of multidrug-resistant enterococcal infections Clin Microbiol Infect 16 555 562 10.1111/j.1469-0691.2010.03214.x 20569266 PMC3686902 21 Pericàs JM Llopis J Muñoz P Gálvez-Acebal J Kestler M Valerio M Hernández-Meneses M Goenaga MÁ Cobo-Belaustegui M Montejo M et al. 2020 A contemporary picture of enterococcal endocarditis J Am Coll Cardiol 75 482 494 10.1016/j.jacc.2019.11.047 32029130 22 Bussini L Rosselli Del Turco E Pasquini Z Scolz K Amedeo A Beci G Giglia M Tedeschi S Pascale R Ambretti S Pericàs JM Giannella M Carvalho-Brugger S Gutiérrez L Viale P Bartoletti M 2022 Risk factors for persistent enterococcal bacteraemia: a multicentre retrospective study J Glob Antimicrob Resist 29 386 389 10.1016/j.jgar.2022.05.003 35569757 23 Grein F Müller A Scherer KM Liu X Ludwig KC Klöckner A Strach M Sahl HG Kubitscheck U Schneider T 2020 Ca(2+)-Daptomycin targets cell wall biosynthesis by forming a tripartite complex with undecaprenyl-coupled intermediates and membrane lipids Nat Commun 11 1455 10.1038/s41467-020-15257-1 32193379 PMC7081307 24 Turnidge J Kahlmeter G Cantón R MacGowan A Giske CG 2020 Daptomycin in the treatment of enterococcal bloodstream infections and endocarditis: a EUCAST position paper Clin Microbiol Infect 26 1039 1043 10.1016/j.cmi.2020.04.027 32353412 25 Satlin MJ Nicolau DP Humphries RM Kuti JL Campeau SA Lewis Ii JS Weinstein MP Jorgensen JH 2020 Development of daptomycin susceptibility breakpoints for Enterococcus faecium and revision of the breakpoints for other enterococcal species by the clinical and laboratory standards institute Clin Infect Dis 70 1240 1246 10.1093/cid/ciz845 31504338 26 Humphries RM 2019 The new, new daptomycin breakpoint for Enterococcus spp J Clin Microbiol 57 10.1128/JCM.00600-19 PMC6595459 31092593 27 Diaz L Tran TT Munita JM Miller WR Rincon S Carvajal LP Wollam A Reyes J Panesso D Rojas NL Shamoo Y Murray BE Weinstock GM Arias CA 2014 Whole-genome analyses of Enterococcus faecium isolates with diverse daptomycin MICs Antimicrob Agents Chemother 58 4527 4534 10.1128/AAC.02686-14 24867964 PMC4136017 28 Miller WR Nguyen A Singh KV Rizvi S Khan A Erickson SG Egge SL Cruz M Dinh AQ Diaz L Thornton PC Zhang R Xu L Garsin DA Shamoo Y Arias CA 2025 Membrane lipids augment cell envelope stress signaling via the MadRS system to defend against antimicrobial peptides and antibiotics in Enterococcus faecalis J Infect Dis 231 307 317 10.1093/infdis/jiae173 38578967 PMC11841629 29 Turner AM Li L Monk IR Lee JYH Ingle DJ Portelli S Sherry NL Isles N Seemann T Sharkey LK et al. 2024 Rifaximin prophylaxis causes resistance to the last-resort antibiotic daptomycin Nature 635 969 977 10.1038/s41586-024-08095-4 39443798 PMC11602712 30 Prater AG Mehta HH Kosgei AJ Miller WR Tran TT Arias CA Shamoo Y 2019 Environment shapes the accessible daptomycin resistance mechanisms in Enterococcus faecium Antimicrob Agents Chemother 63 10.1128/AAC.00790-19 PMC6761497 31332078 31 Arias CA Panesso D McGrath DM Qin X Mojica MF Miller C Diaz L Tran TT Rincon S Barbu EM Reyes J Roh JH Lobos E Sodergren E Pasqualini R Arap W Quinn JP Shamoo Y Murray BE Weinstock GM 2011 Genetic basis for in vivo daptomycin resistance in enterococci N Engl J Med 365 892 900 10.1056/NEJMoa1011138 21899450 PMC3205971 32 Werth BJ Steed ME Ireland CE Tran TT Nonejuie P Murray BE Rose WE Sakoulas G Pogliano J Arias CA Rybak MJ 2014 Defining daptomycin resistance prevention exposures in vancomycin-resistant Enterococcus faecium and E. faecalis Antimicrob Agents Chemother 58 5253 5261 10.1128/AAC.00098-14 24957825 PMC4135850 33 Ramos Y Sansone S Hwang SM Sandoval TA Zhu M Zhang G Cubillos-Ruiz JR Morales DK 2022 Remodeling of the enterococcal cell envelope during surface penetration promotes intrinsic resistance to stress mBio 13 e0229422 10.1128/mbio.02294-22 36354750 PMC9765498 34 DiPippo AJ Tverdek FP Tarrand JJ Munita JM Tran TT Arias CA Shelburne SA Aitken SL 2017 Daptomycin non-susceptible Enterococcus faecium in leukemia patients: role of prior daptomycin exposure J Infect 74 243 247 10.1016/j.jinf.2016.11.004 27845153 PMC5324836 35 Kebriaei R Stamper KC Singh KV Khan A Rice SA Dinh AQ Tran TT Murray BE Arias CA Rybak MJ 2020 Mechanistic insights into the differential efficacy of daptomycin plus β-lactam combinations against daptomycin-resistant Enterococcus faecium J Infect Dis 222 1531 1539 10.1093/infdis/jiaa319 32514561 PMC7529040 36 Khan A Nguyen A Panesso D Vitrac H Miller WR Tran TT Shamoo Y Arthur M Arias CA 2019 903. Resensitization to β-lactams in enterococci depends on penicillin-binding protein (PBP) mislocalization and is mediated by a single protein that modulates cell membrane (CM) adaptation to daptomycin (DAP) Open Forum Infect Dis 6 S28 S29 10.1093/ofid/ofz359.062 37 Chuang YC Lin HY Yang JL Lin CY Huang SH Wang JT Chen YC Chang SC 2022 Influence of daptomycin doses on the outcomes of VRE bloodstream infection treated with high-dose daptomycin J Antimicrob Chemother 77 2278 2287 10.1093/jac/dkac164 35639586 38 Sinel C Jaussaud C Auzou M Giard JC Cattoir V 2016 Mutant prevention concentrations of daptomycin for Enterococcus faecium clinical isolates Int J Antimicrob Agents 48 449 452 10.1016/j.ijantimicag.2016.07.006 27546218 39 Lee IK Sng YP Li WF Chen CL Wang CC Lin CC Chen IL 2022 Importance of daptomycin dosage on the clinical outcome in liver transplant recipients with vancomycin-resistant enterococci infection J Chemother 34 367 374 10.1080/1120009X.2022.2031470 35075978 40 Kebriaei R Rice SA Singh KV Stamper KC Dinh AQ Rios R Diaz L Murray BE Munita JM Tran TT Arias CA Rybak MJ 2018 Influence of inoculum effect on the efficacy of daptomycin monotherapy and in combination with β-lactams against daptomycin-susceptible Enterococcus faecium harboring LiaSR substitutions Antimicrob Agents Chemother 62 e00315-18 10.1128/AAC.00315-18 29760141 PMC6105850 41 Desbonnet C Tait-Kamradt A Garcia-Solache M Dunman P Coleman J Arthur M Rice LB 2016 Involvement of the eukaryote-like kinase-phosphatase system and a protein that interacts with penicillin-binding protein 5 in emergence of cephalosporin resistance in cephalosporin-sensitive class a penicillin-binding protein mutants in Enterococcus faecium mBio 7 e02188-15 10.1128/mBio.02188-15 27048803 PMC4959515 42 Khan A Davlieva M Panesso D Rincon S Miller WR Diaz L Reyes J Cruz MR Pemberton O Nguyen AH Siegel SD Planet PJ Narechania A Latorre M Rios R Singh KV Ton-That H Garsin DA Tran TT Shamoo Y Arias CA 2019 Antimicrobial sensing coupled with cell membrane remodeling mediates antibiotic resistance and virulence in Enterococcus faecalis. Proc Natl Acad Sci USA 116 26925 26932 10.1073/pnas.1916037116 31818937 PMC6936494 43 Sakoulas G Rose W Nonejuie P Olson J Pogliano J Humphries R Nizet V 2014 Ceftaroline restores daptomycin activity against daptomycin-nonsusceptible vancomycin-resistant Enterococcus faecium Antimicrob Agents Chemother 58 1494 1500 10.1128/AAC.02274-13 24366742 PMC3957885 44 Smith JR Barber KE Raut A Rybak MJ 2015 β-Lactams enhance daptomycin activity against vancomycin-resistant Enterococcus faecalis and Enterococcus faecium in in vitro pharmacokinetic/pharmacodynamic models Antimicrob Agents Chemother 59 2842 2848 10.1128/AAC.00053-15 25753639 PMC4394769 45 Chuang YC Wang JT Yang JL Lin CY Huang SH Chen YC Chang SC 2022 The combination of daptomycin with β-lactam antibiotics is more effective than daptomycin alone for vancomycin-resistant Enterococcus faecium bloodstream infection J Infect Public Health 15 1396 1402 10.1016/j.jiph.2022.10.017 36371936 46 La YJ Kim YC 2022 Successful treatment of vancomycin-resistant Enterococcus species bone and joint infection with daptomycin plus beta lactam agents Infect Chemother 54 797 802 10.3947/ic.2022.0106 36596688 PMC9840966 47 Munita JM Mishra NN Alvarez D Tran TT Diaz L Panesso D Reyes J Murray BE Adachi JA Bayer AS Arias CA 2014 Failure of high-dose daptomycin for bacteremia caused by daptomycin-susceptible Enterococcus faecium harboring LiaSR substitutions Clin Infect Dis 59 1277 1280 10.1093/cid/ciu642 25107294 PMC4271039 48 Chuang YC Tseng TC Wang JT Lin CY Huang SH Chen YC Chang SC 2022 Influence of daptomycin dose and fosfomycin susceptibility on outcome of vancomycin-resistant Enterococcus faecium bloodstream infections treated with daptomycin and fosfomycin combination J Antimicrob Chemother 77 1436 1443 10.1093/jac/dkac023 35141753 49 Tseng TC Chuang YC Yang JL Lin CY Huang SH Wang JT Chen YC Chang SC 2023 The combination of daptomycin with fosfomycin is more effective than daptomycin alone in reducing mortality of vancomycin-resistant enterococcal bloodstream infections: a retrospective, comparative cohort study Infect Dis Ther 12 589 606 10.1007/s40121-022-00754-1 36629997 PMC9925660 50 Shah S McManus D Topal JE 2022 Combination therapy of chloramphenicol and daptomycin for the treatment of infective endocarditis secondary to multidrug resistant Enterococcus faecium. Hosp Pharm 57 345 348 10.1177/00185787211032364 35615488 PMC9125124 51 Stellfox ME Fernandes C Shields RK Haidar G Hughes Kramer K Dembinski E Mangalea MR Arya G Canfield GS Duerkop BA Van Tyne D 2024 Bacteriophage and antibiotic combination therapy for recurrent Enterococcus faecium bacteremia mBio 15 e0339623 10.1128/mbio.03396-23 38353560 PMC10936196 52 García-de-la-Mària C Gasch O García-Gonzalez J Soy D Shaw E Ambrosioni J Almela M Pericàs JM Tellez A Falces C Hernandez-Meneses M Sandoval E Quintana E Vidal B Tolosana JM Fuster D Llopis J Pujol M Moreno A Marco F Miró JM 2018 The combination of daptomycin and fosfomycin has synergistic, potent, and rapid bactericidal activity against methicillin-resistant Staphylococcus aureus in a rabbit model of experimental endocarditis Antimicrob Agents Chemother 62 e02633-17 10.1128/AAC.02633-17 29610194 PMC5971606 53 Pujol M Miró JM Shaw E Aguado JM San-Juan R Puig-Asensio M Pigrau C Calbo E Montejo M Rodriguez-Álvarez R et al. 2021 Daptomycin plus fosfomycin versus daptomycin alone for methicillin-resistant Staphylococcus aureus bacteremia and endocarditis: a randomized clinical trial Clin Infect Dis 72 1517 1525 10.1093/cid/ciaa1081 32725216 PMC8096235 54 Swaney SM Aoki H Ganoza MC Shinabarger DL 1998 The oxazolidinone linezolid inhibits initiation of protein synthesis in bacteria Antimicrob Agents Chemother 42 3251 3255 10.1128/AAC.42.12.3251 9835522 PMC106030 55 Marshall SH Donskey CJ Hutton-Thomas R Salata RA Rice LB 2002 Gene dosage and linezolid resistance in Enterococcus faecium and Enterococcus faecalis Antimicrob Agents Chemother 46 3334 3336 10.1128/AAC.46.10.3334-3336.2002 12234875 PMC128780 56 Bender JK Cattoir V Hegstad K Sadowy E Coque TM Westh H Hammerum AM Schaffer K Burns K Murchan S Novais C Freitas AR Peixe L Del Grosso M Pantosti A Werner G 2018 Update on prevalence and mechanisms of resistance to linezolid, tigecycline and daptomycin in enterococci in Europe: Towards a common nomenclature Drug Resist Updat 40 25 39 10.1016/j.drup.2018.10.002 30447411 57 Giessing AMB Jensen SS Rasmussen A Hansen LH Gondela A Long K Vester B Kirpekar F 2009 Identification of 8-methyladenosine as the modification catalyzed by the radical SAM methyltransferase Cfr that confers antibiotic resistance in bacteria RNA 15 327 336 10.1261/rna.1371409 19144912 PMC2648713 58 Crowe-McAuliffe C Murina V Turnbull KJ Huch S Kasari M Takada H Nersisyan L Sundsfjord A Hegstad K Atkinson GC Pelechano V Wilson DN Hauryliuk V 2022 Structural basis for PoxtA-mediated resistance to phenicol and oxazolidinone antibiotics Nat Commun 13 1860 10.1038/s41467-022-29274-9 35387982 PMC8987054 59 Santimaleeworagun W Changpradub D Hemapanpairoa J Thunyaharn S 2021 Optimization of linezolid dosing regimens for treatment of vancomycin-resistant enterococci infection Infect Chemother 53 503 10.3947/ic.2021.0034 34405596 PMC8511381 60 Rayner CR Forrest A Meagher AK Birmingham MC Schentag JJ 2003 Clinical pharmacodynamics of linezolid in seriously ill patients treated in a compassionate use programme Clin Pharmacokinet 42 1411 1423 10.2165/00003088-200342150-00007 14674791 61 Boak LM Li J Rayner CR Nation RL 2007 Pharmacokinetic/pharmacodynamic factors influencing emergence of resistance to linezolid in an in vitro model Antimicrob Agents Chemother 51 1287 1292 10.1128/AAC.01194-06 17242144 PMC1855482 62 Huang ST Yang JL Lin CY Huang SH Wang JT Chuang YC Chen YC Chang SC 2023 Risk factors for mortality after linezolid treatment of vancomycin-resistant Enterococcus bloodstream infection Int J Infect Dis 129 96 102 10.1016/j.ijid.2023.01.035 36736576 63 Lopez-Luis BA Ponce-De-León A Ortiz-Brizuela E Lambraño-Castillo D Leal-Vega FJ Tovar-Calderón YE Bobadilla-Del-Valle M Sifuentes-Osornio J 2022 Risk factors associated with failure of linezolid therapy in vancomycin-resistant Enterococcus faecium bacteremia: a retrospective cohort study in a referral center in Mexico Microb Drug Resist 28 744 749 10.1089/mdr.2021.0333 35333619 64 Rani V Aye NK Saksena R Dabi KC Mannan MAU Gaind R 2024 Risk factors and outcome associated with the acquisition of MDR linezolid-resistant Enterococcus faecium: a report from tertiary care centre Eur J Clin Microbiol Infect Dis 43 767 775 10.1007/s10096-024-04784-0 38372832 65 Olearo F Both A Belmar Campos C Hilgarth H Klupp EM Hansen JL Maurer FP Christner M Aepfelbacher M Rohde H 2021 Emergence of linezolid-resistance in vancomycin-resistant Enterococcus faecium ST117 associated with increased linezolid-consumption Int J Med Microbiol 311 151477 10.1016/j.ijmm.2021.151477 33524636 66 Britt NS Potter EM Patel N Steed ME 2017 Effect of continuous and sequential therapy among veterans receiving daptomycin or linezolid for vancomycin-resistant Enterococcus faecium bacteremia Antimicrob Agents Chemother 61 e02216-16 10.1128/AAC.02216-16 28264856 PMC5404546 67 Britt NS Potter EM Patel N Steed ME 2015 Comparison of the effectiveness and safety of linezolid and daptomycin in vancomycin-resistant enterococcal bloodstream infection: a national cohort study of Veterans Affairs patients Clin Infect Dis 61 871 878 10.1093/cid/civ444 26063715 PMC4551009 68 Prokocimer P Bien P Deanda C Pillar CM Bartizal K 2012 In vitro activity and microbiological efficacy of tedizolid (TR-700) against Gram-positive clinical isolates from a phase 2 study of oral tedizolid phosphate (TR-701) in patients with complicated skin and skin structure infections Antimicrob Agents Chemother 56 4608 4613 10.1128/AAC.00458-12 22687509 PMC3421864 69 Silva-Del Toro SL Greenwood-Quaintance KE Patel R 2016 In vitro activity of tedizolid against linezolid-resistant staphylococci and enterococci Diagn Microbiol Infect Dis 85 102 104 10.1016/j.diagmicrobio.2016.02.008 26971179 PMC8067670 70 Singh KV Arias CA Murray BE 2019 Efficacy of tedizolid against enterococci and staphylococci, including cfr(+) strains, in a mouse peritonitis model Antimicrob Agents Chemother 63 e02627-18 10.1128/AAC.02627-18 30670435 PMC6437489 71 The European Committee on Antimicrobial Susceptibility Testing (EUCAST) 2025 Breakpoint Tables for Interpretation of MICs and Zone Diameters v Available from https://www.eucast.org/clinical_breakpoints 72 CLSI 2025 Performance standards for antimicrobial susceptibility testing Vol CLSI supplement M100 Clinical and Laboratory Standards Institute 73 Merck & Co., Inc 2019 Sivextro (tedizolid) [package insert] U.S. Food and Drug Administration Website Available from https://www.accessdata.fda.gov/drugsatfda_docs/label/2014/205435s000lbl.pdf 74 Pfizer Inc 2025 Zyvox (linezolid) [package insert] U.S. Food and Drug Administration Website Available from https://www.accessdata.fda.gov/drugsatfda_docs/label/2014/021130s032 75 Rodríguez-Gascón A Aguirre-Quiñonero A Aspiazu MAS Canut-Blasco A 2021 Pharmacokinetic/pharmacodynamic analysis of tedizolid phosphate compared to linezolid for the treatment of infections caused by Gram-positive bacteria Antibiotics (Basel) 10 755 10.3390/antibiotics10070755 34206434 PMC8300700 76 Hoy SM 2021 Contezolid: first approval Drugs (Abingdon Engl) 81 1587 1591 10.1007/s40265-021-01576-0 PMC8536612 34365606 77 Guo Y Han R Zhang G Yang Q Xue F Li Y Zhu D Hu F 2023 Setting of the tentative epidemiological cut-off values of contezolid for Staphylococcus aureus, Enterococcus faecalis, Enterococcus faecium, Streptococcus pneumoniae and Streptococcus agalactiae J Antimicrob Chemother 78 1055 1058 10.1093/jac/dkad045 36849586 78 Li Y Peng Y Zhang N Liu H Mao J Yan Y Wang S Yang G Liu Y Li J Huang X 2022 Assessing the emergence of resistance in vitro and in vivo: Linezolid combined with fosfomycin against fosfomycin-sensitive and resistant Enterococcus Infect Drug Resist 15 4995 5010 10.2147/IDR.S377848 36065277 PMC9440711 79 Chi J Li Y Zhang N Liu H Chen Z Li J Huang X 2023 Fosfomycin enhances the inhibition ability of linezolid against biofilms of vancomycin-resistant Enterococcus faecium in vitro Infect Drug Resist 16 7707 7719 10.2147/IDR.S428485 38144225 PMC10748582 80 Hegstad K Pöntinen AK Bjørnholt JV Quist-Paulsen E Sundsfjord A 2024 The first tigecycline resistant Enterococcus faecium in Norway was related to tigecycline exposure J Glob Antimicrob Resist 36 112 115 10.1016/j.jgar.2023.12.002 38122982 81 Ding L Yang Y Zheng C Sun G Han R Guo Y Yin D Wu S Zhu D Hu F 2022 Activities of eravacycline, tedizolid, norvancomycin, nemonoxacin, ceftaroline, and comparators against 1,871 Staphylococcus and 1,068 Enterococcus species isolates from China: updated report of the CHINET study 2019 Microbiol Spectr 10 e0171522 10.1128/spectrum.01715-22 36326536 PMC9769667 82 Hawser S Kothari N Monti F Morrissey I Siegert S Hodges T 2023 In vitro activity of eravacycline and comparators against Gram-negative and Gram-positive bacterial isolates collected from patients globally between 2017 and 2020 J Glob Antimicrob Resist 33 304 320 10.1016/j.jgar.2023.04.017 37207925 83 Boukthir S Dejoies L Zouari A Collet A Potrel S Auger G Cattoir V 2022 Corrigendum to ’In vitro activity of eravacycline and mechanisms of resistance in enterococci Int J Antimicrob Agents 60 106694 10.1016/j.ijantimicag.2022.106694 36437133 84 U.S. Food and Drug Administration 2005. Susceptibility Test Interpretive Criteria (STIC) Available from http://www.fda.gov/STIC 85 Singh KV Arias CA Murray BE 2021 Efficacy of omadacycline against multidrug-resistant Enterococcus faecium strains in a mouse peritonitis model Antimicrob Agents Chemother 65 e0070921 10.1128/AAC.00709-21 34125596 PMC8370196 86 Schutt AC Bohm NM 2009 Multidrug-resistant Enterococcus faecium endocarditis treated with combination tigecycline and high-dose daptomycin Ann Pharmacother 43 2108 2112 10.1345/aph.1M324 19887592 87 Toke O Cegelski L Schaefer J 2006 Peptide antibiotics in action: investigation of polypeptide chains in insoluble environments by rotational-echo double resonance Biochim Biophys Acta 1758 1314 1329 10.1016/j.bbamem.2006.02.031 16616889 88 Belley A McKay GA Arhin FF Sarmiento I Beaulieu S Fadhil I Parr TR Moeck G 2010 Oritavancin disrupts membrane integrity of Staphylococcus aureus and vancomycin-resistant enterococci to effect rapid bacterial killing Antimicrob Agents Chemother 54 5369 5371 10.1128/AAC.00760-10 20876372 PMC2981232 89 Carvalhaes CG Sader HS Streit JM Castanheira M Mendes RE 2022 Activity of oritavancin against gram-positive pathogens causing bloodstream infections in the united states over 10 years: focus on drug-resistant enterococcal subsets (2010-2019) Antimicrob Agents Chemother 66 e0166721 10.1128/AAC.01667-21 34807761 PMC8846398 90 Pfaller MA Mendes RE Sader HS Castanheira M Carvalhaes CG 2023 Oritavancin in vitro activity against Gram-positive organisms from European medical centers: a 10-year longitudinal overview from the SENTRY Antimicrobial Surveillance Program (2010-2019) J Chemother 35 689 699 10.1080/1120009X.2023.2259673 37746914 91 Mazzitelli M Scaglione V Cattarin L Franchin E Stano P Paci L Coppi M Rossolini GM Mengato D Calò L Cattelan AM 2024 Off-label oritavancin treatment outcome and molecular characterization of a vancomycin- and linezolid-resistant Enterococcus faecium causing liver abscesses J Antimicrob Chemother 79 689 691 10.1093/jac/dkad410 38225167 92 Texidor WM Miller MA Molina KC Krsak M Calvert B Hart C Storer M Fish DN 2024 Oritavancin as sequential therapy for Gram-positive bloodstream infections BMC Infect Dis 24 127 10.1186/s12879-023-08725-8 38267844 PMC10807122 93 Giuliano G Benedetti S Sambo M Pierguidi F Tumbarello M 2024 Successful treatment of complicated infective endocarditis due to Enterococcus faecium in a patient with substance use disorder using oritavancin as sequential maintenance therapy Clin Microbiol Infect 30 556 557 10.1016/j.cmi.2024.01.008 38253314 94 Smith JR Yim J Raut A Rybak MJ 2016 Oritavancin combinations with β-lactams against multidrug-resistant Staphylococcus aureus and vancomycin-resistant enterococci Antimicrob Agents Chemother 60 2352 2358 10.1128/AAC.03006-15 26833159 PMC4808215 95 Xie O Slavin MA Teh BW Bajel A Douglas AP Worth LJ 2020 Epidemiology, treatment and outcomes of bloodstream infection due to vancomycin-resistant enterococci in cancer patients in a vanB endemic setting BMC Infect Dis 20 228 10.1186/s12879-020-04952-5 32188401 PMC7079500 96 Ha S Huh K Chung DR Ko J-H Cho SY Huh HJ Lee NY Kang C-I Peck KR Song J-H Korean Antimicrobial Resistance Surveillance Network (KARS-Net) investigators 2022 Efficacy of teicoplanin in bloodstream infections caused by Enterococcus faecium: posthoc analysis of a nationwide surveillance Int J Infect Dis 122 506 513 10.1016/j.ijid.2022.06.029 35752376 97 Djorić D Little JL Kristich CJ 2020 Multiple low-reactivity class B penicillin-binding proteins are required for cephalosporin resistance in enterococci Antimicrob Agents Chemother 64 e02273-19 10.1128/AAC.02273-19 32041714 PMC7179317 98 Fernández-Hidalgo N Almirante B Gavaldà J Gurgui M Peña C de Alarcón A Ruiz J Vilacosta I Montejo M Vallejo N López-Medrano F Plata A López J Hidalgo-Tenorio C Gálvez J Sáez C Lomas JM Falcone M de la Torre J Martínez-Lacasa X Pahissa A 2013 Ampicillin plus ceftriaxone is as effective as ampicillin plus gentamicin for treating Enterococcus faecalis infective endocarditis Clin Infect Dis 56 1261 1268 10.1093/cid/cit052 23392394 99 Kim D Lee H Yoon EJ Hong JS Shin JH Uh Y Shin KS Shin JH Kim YA Park YS Jeong SH 2019 Prospective observational study of the clinical prognoses of patients with bloodstream infections caused by ampicillin-susceptible but penicillin-resistant Enterococcus faecalis Antimicrob Agents Chemother 63 10.1128/AAC.00291-19 PMC6591605 31010856 100 Metzidie E Manolis EN Pournaras S Sofianou D Tsakris A 2006 Spread of an unusual penicillin- and imipenem-resistant but ampicillin-susceptible phenotype among Enterococcus faecalis clinical isolates J Antimicrob Chemother 57 158 160 10.1093/jac/dki427 16308417 101 Conceição N da Silva LEP Darini AL da C Pitondo-Silva A de Oliveira AG 2014 Penicillin-resistant, ampicillin-susceptible Enterococcus faecalis of hospital origin: pbp4 gene polymorphism and genetic diversity Infect Genet Evol 28 289 295 10.1016/j.meegid.2014.10.018 25445645 102 Infante VHP Conceição N de Oliveira AG Darini AL da C 2016 Evaluation of polymorphisms in pbp4 gene and genetic diversity in penicillin-resistant, ampicillin-susceptible Enterococcus faecalis from hospitals in different states in Brazil FEMS Microbiol Lett 363 fnw044 10.1093/femsle/fnw044 26903013 103 Gawryszewska I Żabicka D Hryniewicz W Sadowy E 2021 Penicillin-resistant, ampicillin-susceptible Enterococcus faecalis in Polish Hospitals Microb Drug Resist 27 291 300 10.1089/mdr.2019.0504 32640911 104 Westbrook KJ Chilambi GS Stellfox ME Nordstrom HR Li Y Iovleva A Shah NH Jones CE Kline EG Squires KM Miller WR Tran TT Arias CA Doi Y Shields RK Van Tyne D 2024 Differential in vitro susceptibility to ampicillin/ceftriaxone combination therapy among Enterococcus faecalis infective endocarditis clinical isolates J Antimicrob Chemother 79 801 809 10.1093/jac/dkae032 38334390 PMC10984950 105 Diaz L Singh KV Tran CT Quiroz VE Soto K Peters AS Paula Baptista R Martinez JRW Ugalde J Hoppe G Araos R Acuna MP Martinez I Garcia P Miller WR Munita JM Arias CA Panesso D 2025 Multi-hospital dissemination of ampicillin resistance associated with a frame-shift deletion in pbp4 of vancomycin-resistant Enterococcus faecalis Open Forum Infect Dis 12 ofae631.1526 10.1093/ofid/ofae631.1526 106 Giuliano S Angelini J Campanile F Conti P Flammini S Pagotto A Sbrana F Martini L D’Elia D Abdul-Aziz MH Cotta MO Roberts JA Bonomo RA Tascini C 2025 Evaluation of ampicillin plus ceftobiprole combination therapy in treating Enterococcus faecalis infective endocarditis and bloodstream infection Sci Rep 15 3519 10.1038/s41598-025-87512-8 39875507 PMC11775251 107 Giuliano S Angelini J D’Elia D Geminiani M Barison RD Giacinta A Sartor A Campanile F Curcio F Cotta MO Roberts JA Baraldo M Tascini C 2023 Ampicillin and ceftobiprole combination for the treatment of Enterococcus faecalis invasive infections: “The Times They Are A-Changin” Antibiotics (Basel) 12 879 10.3390/antibiotics12050879 37237782 PMC10215339 108 Qu Q Chen T He P Geng H Zeng P Luan G 2023 Isolation and characterization of a novel lytic bacteriophage vB_Efm_LG62 infecting Enterococcus faecium Virus Genes 59 763 774 10.1007/s11262-023-02016-9 37422898 109 Pradal I Casado A del Rio B Rodriguez-Lucas C Fernandez M Alvarez MA Ladero V 2023 Enterococcus faecium bacteriophage vB_EfaH_163, a new member of the herelleviridae family, reduces the mortality associated with an E. faecium vanR clinical isolate in a Galleria mellonella animal model Viruses 15 179 10.3390/v15010179 36680219 PMC9860891 110 Wandro S Ghatbale P Attai H Hendrickson C Samillano C Suh J Dunham SJB Pride DT Whiteson K 2022 Phage cocktails constrain the growth of Enterococcus. mSystems 7 e0001922 10.1128/msystems.00019-22 35762793 PMC9426582 ",
  "metadata": {
    "Title of this paper": "Phage cocktails constrain the growth of Enterococcus.",
    "Journal it was published in:": "Antimicrobial Agents and Chemotherapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486858/"
  }
}