{
  "title": "Paper_892",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471691 PMC12471691.1 12471691 12471691 41011078 10.3390/medicina61091687 medicina-61-01687 1 Hypothesis Hepatic Metabolic Dysregulation as a Potential Amplifier of Leukemogenesis Following mRNA Vaccination: A Novel Mechanistic Hypothesis https://orcid.org/0000-0001-8968-3917 Erdoğdu Batuhan 1 * Kaplan Ozan 2 https://orcid.org/0000-0001-7712-5512 Çelebier Mustafa 2 https://orcid.org/0000-0001-5444-4895 Malkan Ümit Yavuz 3 Haznedaroğlu İbrahim Celalettin 3 Srivastava Yogesh Academic Editor Tripathi Amit K. Academic Editor 1 2 ozantiger@gmail.com celebier@hacettepe.edu.tr 3 umitmalkan@hotmail.com ichaznedaroglu@gmail.com * dr.batuhan@gmail.com 17 9 2025 9 2025 61 9 497654 1687 12 8 2025 11 9 2025 15 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Hypothesis: Implications: leukemogenesis mRNA vaccines hepatic metabolism metabolic crosstalk folate metabolism tryptophan catabolism iron homeostasis NADPH metabolism This research received no external funding. The APC was funded by the authors. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Leukemogenesis represents a complex multistep process involving the accumulation of genetic and epigenetic alterations within hematopoietic stem and progenitor cells, ultimately leading to malignant transformation and clonal expansion [ 1 2 3 4 5 The advent of mRNA vaccine technology has revolutionized immunization strategies, particularly during the COVID-19 pandemic. These vaccines utilize lipid nanoparticles (LNPs) as delivery vehicles, which demonstrate pronounced hepatic tropism due to apolipoprotein E-mediated uptake via hepatic low-density lipoprotein receptors [ 6 7 8 While the safety profile of mRNA vaccines has been extensively documented, rare reports of hematological malignancies following vaccination have emerged, including a case of B-cell lymphoblastic lymphoma in a murine model following intravenous BNT162b2 administration [ 9 10 11 The liver functions as a metabolic gatekeeper, orchestrating systemic nutrient homeostasis and regulating the availability of metabolites essential for hematopoiesis [ 12 13 14 15 16 We propose a novel mechanistic hypothesis positioning the liver as a potential amplifier of vaccine-associated metabolic shifts that may contribute to leukemogenesis in metabolically susceptible individuals. This hypothesis posits that mRNA vaccines, through their preferential hepatic accumulation and subsequent metabolic effects, may transiently alter the hepato-hematopoietic metabolic axis through five interconnected pathways involving folate utilization, lipid processing, tryptophan catabolism, iron regulation, and NADPH distribution. These transient perturbations may create a metabolic milieu that favors the expansion or progression of pre-leukemic clones in individuals harboring underlying metabolic vulnerabilities or genetic predispositions. The clinical significance of this hypothesis extends beyond theoretical considerations, as it generates testable predictions and identifies potential therapeutic targets for both prevention and treatment. By elucidating these putative mechanisms, we aim to stimulate research into metabolic factors influencing leukemogenesis and identify novel interventional strategies targeting the hepato-hematopoietic metabolic crosstalk. 1.1. Mechanistic Framework and Biological Rationale Hepatic Tropism of mRNA Vaccine Delivery Systems: The biodistribution profile of mRNA vaccines is fundamentally determined by the physicochemical properties of their lipid nanoparticle delivery systems. These formulations, typically comprising ionizable cationic lipids, phospholipids, cholesterol, and polyethylene glycol-conjugated lipids, demonstrate pronounced hepatic accumulation within minutes of systemic administration [ 6 17 6 18 19 20 Importantly, this pattern of hepatic accumulation is not unique to mRNA vaccines but rather represents a broader pharmacological principle of nanoparticle-based therapeutics. For example, small interfering RNA (siRNA) therapies such as patisiran, formulated in lipid nanoparticles, also demonstrate preferential hepatic uptake due to apolipoprotein E–mediated endocytosis by hepatocytes and Kupffer cells [ 21 22 23 24 25 Furthermore, the immune activation resulting from hepatic antigen production may induce inflammatory cascades that alter hepatic metabolic function. Recent metabolomic analyses have demonstrated distinct plasma metabolic signatures following COVID-19 vaccination, with significant perturbations in amino acid and lipid profiles correlating with immune response magnitude [ 26 Preclinical animal studies provide detailed insights into this hepatic tropism. In murine models, intramuscular administration of LNP-formulated mRNA vaccines results in substantial hepatic accumulation within hours, with detectable antigen expression in hepatocytes [ 27 28 29 30 31 32 33 Furthermore, comparisons between different LNP formulations, such as (4S)-KEL12 versus SM-102, demonstrate that specific lipid compositions can modulate the degree of hepatic accumulation and transient hepatocellular stress, highlighting the influence of LNP chemistry on biodistribution and metabolic outcomes [ 34 Rare clinical cases of autoimmune hepatitis (AIH) following mRNA vaccination highlight the potential for immune-mediated hepatic effects [ 35 36 37 38 39 35 40 41 In humans, LNP-mRNA vaccines are associated with transient, mild elevations in liver enzymes reflecting short-term metabolic perturbations [ 33 8 32 Collectively, these preclinical and clinical data position the liver as a central hub for LNP-mRNA vaccine metabolism and immune interactions. Hepatic accumulation can induce transient metabolic perturbations and, in rare predisposed individuals, trigger autoimmunity, highlighting a plausible role for the liver in systemic metabolic alterations that may influence hematopoietic homeostasis and potentially leukemogenic processes. 1.2. Hepato-Hematopoietic Metabolic Crosstalk The liver-bone marrow metabolic axis represents a critical regulatory network governing hematopoietic homeostasis. The liver supplies essential metabolites for hematopoiesis, including folate cofactors for DNA synthesis, amino acids for protein synthesis, lipids for membrane biogenesis, and iron for hemoglobin production [ 13 14 16 42 43 44 45 Additionally, hepatic inflammatory responses can generate systemic inflammatory mediators that influence the bone marrow microenvironment [ 46 47 48 49 1.3. Metabolic Vulnerabilities in Leukemogenesis Leukemic cells exhibit characteristic metabolic reprogramming that distinguishes them from normal hematopoietic cells. These alterations include enhanced glycolysis, increased glutaminolysis, dysregulated lipid metabolism, and perturbed one-carbon metabolism [ 50 51 52 53 54 55 Recent evidence from our previous study of metabolomic profiling of leukemic bone marrow samples following mRNA vaccination has revealed distinct metabolic signatures, including alterations in glycolysis, pentose phosphate pathway activity, and tryptophan metabolism [ 2 2. Proposed Mechanisms of Hepatic Metabolic Amplification in Leukemogenesis We propose five interconnected mechanisms through which vaccine-induced hepatic metabolic perturbations may amplify leukemogenic processes in susceptible individuals. These mechanisms operate within the framework of hepato-hematopoietic metabolic crosstalk and may synergistically create a permissive milieu for leukemic transformation or clonal expansion. 2.1. Competitive Folate Sequestration and One-Carbon Metabolism Dysregulation 2.1.1. Established Knowledge: Mechanistic Basis Folate-dependent one-carbon metabolism represents a critical metabolic network supporting nucleotide synthesis, methylation reactions, and redox homeostasis [ 56 57 58 59 60 Folate deficiency contributes to leukemogenesis through multiple interconnected mechanisms. The deficiency induces DNA damage, promotes chromosomal instability, and compromises DNA repair capacity—collectively creating a mutagenic environment conducive to malignant transformation [ 61 62 63 58 61 64 65 66 67 Pre-leukemic clones exhibit particular vulnerability to folate limitation due to their heightened proliferative demands, which substantially increase cellular folate requirements [ 58 61 68 Concurrently, folate deficiency compromises immune surveillance mechanisms, establishing an immunosuppressive microenvironment that facilitates leukemic immune evasion. The impairment of folate-dependent immune cell functions creates permissive conditions for transformed clones to escape immunological detection and elimination, further promoting leukemic progression [ 58 61 69 Experimental models have characterized the temporal dynamics and threshold levels of folate perturbation necessary to influence clonal hematopoiesis, providing insights relevant to clinical scenarios. In mice, folate deficiency induces measurable hematopoietic alterations within 35–48 days, indicating that even short-term insufficiency can affect blood cell production [ 70 71 71 2.1.2. COVID-19 mRNA Vaccines, Spike Protein, and Folate Metabolism The interaction between COVID-19 mRNA vaccines, the SARS-CoV-2 spike protein, and host folate metabolism is multifaceted and warrants careful consideration [ 72 73 74 75 76 77 78 79 80 Studies on metabolomic alterations induced by SARS-CoV-2 and COVID-19 vaccination have revealed changes in plasma metabolic profiles, with amino acid metabolism and lipid profiles identified as predictive markers of immune response [ 81 82 2 13 59 83 Furthermore, the SARS-CoV-2 virus itself has been shown to remodel host folate and one-carbon metabolism to support its own replication, specifically for de novo purine synthesis required for its genome [ 72 84 85 86 87 88 Additionally, SARS-CoV-2 infection has been linked to increased methyl-group requirements and other disturbances of one-carbon metabolism [ 89 85 3. Hypothesis Vaccine-induced immune activation necessitates rapid lymphocyte proliferation, which substantially increases folate requirements for DNA synthesis and cellular replication [ 75 Folate-deficient and excessively supplemented diets altered DNA replication in B-progenitor cells and reduced circulating lymphocyte counts, suggesting a narrow window in which both deficiency and excess compromise hematopoietic function [ 71 90 91 3.1. Hepatic Lipid Processing Overload and Membrane Lipid Dysregulation 3.1.1. Established Knowledge: Mechanistic Basis Lipid nanoparticles (LNPs), integral to mRNA vaccine formulations, comprise ionizable cationic lipids, phospholipids, and cholesterol [ 18 30 6 18 92 18 93 94 95 96 97 26 81 98 99 100 101 102 103 104 105 106 From a quantitative perspective, the lipid mass delivered by a single LNP-based mRNA vaccine dose is modest but non-negligible relative to hepatic lipid metabolism. Each LNP-based mRNA vaccine dose delivers lipids in the milligram range, with ionizable lipids comprising about half of the formulation with cholesterol and phospholipids making up most of the remainder [ 17 100 107 The concept of “hepatic lipid processing overload” reflects not simple accumulation but activation of stress responses. Inefficient handling of exogenous lipids can trigger endoplasmic reticulum (ER) stress and the unfolded protein response (UPR), while excessive metabolic activity promotes reactive oxygen species generation and oxidative stress. Sustained activation of these pathways may impair hepatocyte function, foster inflammation, and influence systemic metabolic and immune regulation [ 108 109 110 111 112 The perturbation of sphingolipid metabolism is a particularly sensitive indicator of metabolic stress. Sphingolipids are not only structural components of membranes but also act as crucial signaling molecules [ 113 114 115 116 117 118 26 81 3.1.2. Leukemogenic Implications Membrane lipid composition is a critical determinant of cellular signaling, especially through lipid rafts. These specialized membrane microdomains act as platforms for receptor clustering and signal transduction. Any alterations in the composition of membrane lipids can directly influence the activity of key receptors, such as growth factor receptors, cytokine receptors, and adhesion molecules, all of which are crucial regulators of hematopoietic cell proliferation, differentiation, and survival [ 119 120 121 122 123 124 125 Hypothesis mRNA vaccine–induced hepatic lipid overload, combined with spike protein–mediated lipid dysregulation, transiently alters systemic lipid metabolism and membrane composition. These changes may disturb lipid raft signaling, modulate sphingolipid balance, and increase susceptibility to ferroptosis and oxidative stress. In hematopoietic cells, such perturbations could enhance survival and proliferation of pre-leukemic clones, facilitating clonal expansion or leukemic progression, particularly in individuals with pre-existing metabolic vulnerabilities. The observed perturbations in lipid metabolism following mRNA vaccination may be further compounded by the direct metabolic effects of the SARS-CoV-2 Spike protein itself. Recent studies show that the SARS-CoV-2 Spike protein directly disrupts cellular lipid homeostasis, significantly increasing lipid accumulation and dysregulating genes involved in lipid metabolism, autophagy, and ferroptosis. This metabolic dysfunction creates heightened susceptibility to lipotoxicity-induced cell death via ferroptosis. The pathway involves nuclear factor erythroid 2-related factor 2 (Nrf2), which paradoxically contributes to cellular dysfunction despite its typical protective role against oxidative stress. Nrf2 inhibition attenuates Spike protein-induced lipotoxicity, suggesting a maladaptive cellular response under metabolic stress conditions [ 126 127 128 126 129 130 131 The potential for vaccine-induced perturbations in systemic lipid homeostasis to exacerbate these pre-existing lipid abnormalities is a significant concern. Such exacerbation could potentially accelerate leukemic transformation or clonal expansion [ 2 132 133 134 3.2. Cytokine-Mediated Indoleamine 2,3-Dioxygenase Upregulation and Tryptophan Catabolism 3.2.1. Established Knowledge: Mechanistic Basis Indoleamine 2,3-dioxygenase (IDO) catalyzes the rate-limiting step in tryptophan catabolism through the kynurenine pathway, converting tryptophan to N-formylkynurenine [ 135 136 137 138 3.2.2. Leukemogenic Implications Enhanced tryptophan catabolism through the kynurenine pathway generates immunosuppressive metabolites that inhibit T-cell proliferation and function, potentially impairing immune surveillance of pre-leukemic or leukemic cells [ 139 140 141 142 143 Leukemic cells frequently overexpress IDO as an immune evasion mechanism, creating a localized immunosuppressive microenvironment [ 144 Hypothesis We propose that vaccine-induced cytokine production, particularly IFN-γ, may upregulate hepatic IDO expression, accelerating tryptophan catabolism and increasing kynurenine pathway metabolite production. This upregulation may be particularly pronounced in individuals with pre-existing inflammatory conditions or genetic variants affecting IDO regulation. Recent evidence from a case study of mast cell activation following mRNA-1273 booster vaccination demonstrated dramatically elevated Th2-biased cytokines, including IL-1Ra, IL-5, IL-6, IL-10, IL-11, CXCL10, and GM-CSF, which may influence tryptophan metabolism through direct and indirect mechanisms [ 145 SARS-CoV-2 significantly alters the kynurenine pathway of tryptophan metabolism, crucial for NAD+ production and immune/neuronal modulation [ 146 147 148 149 150 3.3. Inflammatory Hepcidin Induction and Iron Homeostasis Disruption 3.3.1. Established Knowledge: Mechanistic Basis Hepcidin, a liver-derived peptide hormone, serves as the master regulator of systemic iron homeostasis by controlling intestinal iron absorption and macrophage iron recycling [ 151 152 153 3.3.2. Leukemogenic Implications Iron plays a critical role in hematopoiesis, serving as an essential cofactor for DNA synthesis, mitochondrial function, and oxygen transport [ 151 154 155 155 156 157 A central regulator of systemic iron homeostasis is hepcidin, which limits iron availability for erythropoiesis through its binding to ferroportin [ 158 159 This interplay between iron metabolism and clonal hematopoiesis is particularly relevant in the context of malignant transformation. Leukemic cells frequently display altered iron metabolism, including enhanced uptake to support their high proliferative demands. Perturbations in systemic iron distribution may therefore provide a selective advantage to pre-leukemic clones with increased iron acquisition capacity. Moreover, experimental evidence indicates that iron overload within the bone marrow microenvironment can impair normal hematopoiesis while simultaneously supporting leukemic cell expansion, potentially accelerating disease progression [ 156 160 Hypothesis We hypothesize that vaccine-induced inflammation [ 161 162 163 Acute inflammation, such as that induced by vaccination or infection, transiently elevates cytokines like IL-6, leading to short-term hepcidin induction and temporary iron redistribution. These transient changes generally have limited impact on hematopoietic function, as iron homeostasis and erythropoiesis rapidly return to baseline once the inflammatory stimulus resolves [ 164 165 In contrast, clonal hematopoiesis (CH) is associated with chronic, low-grade inflammation. Mutations in genes such as TET2 or DNMT3A are known to drive aberrant inflammatory signaling, particularly in monocytes and macrophages [ 166 167 168 Clinical evidence from an exploratory proteogenomic analysis of the CANTOS trial demonstrates that IL-1β inhibition with canakinumab not only improved hemoglobin levels in patients with CH mutations and anemia, but also suppressed hepcidin, proinflammatory cytokines, and myeloid activation pathways [ 169 Overall, this distinction highlights how transient hepcidin elevation during acute inflammation rarely reaches thresholds relevant for clonal selection, whereas sustained induction in the setting of CH may exert biologically meaningful effects on hematopoietic and clonal dynamics. 3.4. Hepatic NADPH Demand and Redox Homeostasis Perturbation 3.4.1. Established Knowledge: Mechanistic Basis Nicotinamide adenine dinucleotide phosphate (NADPH) stands as a pivotal reducing equivalent within cellular metabolism, indispensable for a myriad of critical biological processes. Its multifaceted roles encompass robust antioxidant defense mechanisms, the intricate pathways of lipid biosynthesis, and the crucial detoxification of xenobiotic compounds [ 170 171 172 173 174 3.4.2. Leukemogenic Implications The maintenance of redox homeostasis is critical for hematopoietic stem cell (HSC) function, governing self-renewal, differentiation, and genomic stability [ 175 176 177 178 179 180 175 179 Hypothesis We propose that vaccine-induced hepatic stress may transiently increase NADPH consumption for antioxidant defense and lipid processing, potentially limiting NADPH availability for other tissues, including the bone marrow. This metabolic competition for reducing equivalents may be particularly significant in individuals with pre-existing redox imbalances or genetic variants affecting NADPH production. 3.5. Vaccine-Induced Metabolic Perturbations The ionizable lipids commonly used in LNP formulations, including ALC-0315 and The polyethylene glycol (PEG), require hepatic processing for clearance. This processing involves cytochrome P450-mediated oxidation, which consumes substantial quantities of NADPH through the cytochrome P450 reductase system. Studies have demonstrated that LNPs containing ALC-0315 at high doses (5 mg/kg) increase markers of liver toxicity (ALT and bile acids), supporting the metabolic burden these lipids place on hepatic processing [ 100 Clinical evidence supports this metabolic stress. A multi-country analysis of 87 patients documented liver injury occurring 15 days post-vaccination, with 84% presenting hepatocellular patterns and 57% exhibiting immune-mediated hepatitis features. Spatial proteomics analysis revealed hyperexpanded CD8+ T cell clones with SARS-CoV-2 spike-specific sequences concentrated at portal interfaces, expressing cytotoxic granzymes and tissue-resident markers [ 181 182 Additionally, the inflammatory response triggered by vaccine components may activate hepatic macrophages and stellate cells, leading to increased production of reactive oxygen species (ROS) and subsequent depletion of cellular antioxidant reserves [ 183 184 185 186 187 188 3.5.1. SARS-CoV-2 Spike Protein and NADPH Depletion Beyond the vaccine-induced metabolic perturbations, the SARS-CoV-2 spike protein itself directly contributes to NADPH demand and potential depletion within host cells [ 189 190 191 192 193 Spike protein-induced oxidative stress precipitates accelerated NADPH consumption that may exceed cellular biosynthetic capacity, resulting in NADPH depletion and subsequent impairment of redox homeostasis and antioxidant defense mechanisms provides a direct link between the spike protein, and the perturbation of cellular NADPH levels, potentially exacerbating the systemic NADPH limitations discussed in the context of vaccine-induced hepatic stress. The combined effect of these factors could create a more profound and sustained impact on NADPH availability, with potential implications for various physiological processes, including hematopoietic stem cell function and leukemogenesis. However, systemic NADPH limitations—such as those arising from competitive hepatic consumption post-vaccination—could impair these adaptations, selectively favoring clones with enhanced stress resistance or alternative redox-regulatory pathways [ 194 195 195 3.5.2. Testable Predictions of Vaccine-Induced Metabolic Perturbations Collectively, these mechanistic pathways suggest that mRNA vaccination may transiently perturb hepatic metabolism through five interconnected processes—folate utilization, lipid processing, tryptophan catabolism, iron regulation, and NADPH/redox balance. These alterations, together with spike protein–mediated effects, could amplify pre-existing leukemogenic vulnerabilities in susceptible individuals ( Figure 1 Table 1 4. Mechanistic Integration and Synergistic Effects of Our Hypothesis 4.1. Temporal Dynamics and Cascade Amplification The proposed mechanisms operate within distinct temporal frameworks that may create cascading effects amplifying the initial metabolic perturbations. The immediate phase, occurring within hours to days post-vaccination, involves rapid LNP accumulation in hepatocytes and acute inflammatory cytokine release. This phase initiates competitive folate sequestration for immune cell proliferation and increases hepatic NADPH demand for antioxidant defense and lipid processing. The intermediate phase, spanning days to weeks, encompasses sustained immune activation with persistent cytokine production, leading to prolonged IDO upregulation and hepcidin induction. During this period, the cumulative effects of folate depletion, altered lipid homeostasis, and iron redistribution may create increasingly favorable conditions for pre-leukemic clone expansion. The temporal overlap of these mechanisms may generate synergistic effects that exceed the sum of individual perturbations. The late phase, extending weeks to months, involves adaptive metabolic responses and potential normalization of acute perturbations. However, in susceptible individuals, the cumulative metabolic stress may have triggered irreversible changes in pre-leukemic clones or bone marrow microenvironment remodeling that persist beyond the resolution of acute effects. This temporal progression suggests that the leukemogenic risk may not be limited to the immediate post-vaccination period but may extend into the recovery phase. 4.2. Clinical Implications and Translational Opportunities The proposed mechanisms suggest that the risk of leukemogenesis following vaccination may be higher in individuals with pre-existing metabolic vulnerabilities or genetic predispositions. For instance, genetic variations affecting folate or iron metabolism could increase susceptibility to folate deficiency or iron-mediated oxidative stress, respectively. Therefore, metabolic biomarker profiling before vaccination could help identify high-risk individuals, allowing for personalized risk assessment and preventive interventions. Routine screening for pre-leukemic conditions like clonal hematopoiesis of indeterminate potential (CHIP) in high-risk populations could also inform vaccination strategies and monitoring protocols [ 196 Several preventive interventions are suggested to mitigate leukemogenic risk. Folate supplementation before and after vaccination could prevent folate sequestration and maintain one-carbon metabolism crucial for DNA synthesis and repair [ 197 198 Potential therapeutic targets for vaccine-associated leukemogenesis include IDO inhibition, which is already in clinical development for cancer immunotherapy [ 199 Monitoring and surveillance strategies involve tracking specific biomarkers. Folate status, tryptophan metabolism (including kynurenine levels and kynurenine-to-tryptophan ratio), iron metabolism (serum iron, ferritin, transferrin saturation, hepcidin levels, non-transferrin-bound iron, and labile plasma iron), and oxidative stress markers (glutathione ratios, lipid peroxidation products, DNA damage markers) could enable early detection of metabolic perturbations and leukemogenic changes. 4.3. Corroborating the Mechanistic Framework: Insights from Clinical Metabolomics The evolving discourse around mRNA vaccine safety increasingly emphasizes not only immunogenic efficacy but also the broader systemic effects that may accompany lipid nanoparticle (LNP)-mediated delivery systems. Among these, the liver has emerged as a critical organ of interest due to its established tropism for LNPs [ 6 200 201 2 A proposed framework describes five mechanistic pathways through which the liver may modulate systemic metabolism with potential implications for hematopoiesis. The first of these involves competitive folate sequestration, whereby vaccine-induced lymphoproliferation increases the demand for folate, potentially depleting hepatic stores and reducing folate availability to the bone marrow [ 58 2 A second mechanism, referred to as hepatic lipid processing overload, suggests that the influx and metabolism of LNPs may temporarily disrupt lipid handling in the liver, potentially leading to systemic lipid alterations. In turn, such shifts could affect membrane composition and function in leukemic cells, which are often characterized by altered lipid metabolism [ 126 2 The third hypothesized mechanism focuses on cytokine-mediated modulation of tryptophan metabolism. Vaccine-induced immune activation may elevate interferon-gamma (IFN-γ) levels, thereby stimulating hepatic indoleamine 2,3-dioxygenase (IDO) activity and promoting tryptophan catabolism into immunosuppressive metabolites [ 139 2 The fourth proposed pathway involves inflammatory regulation of iron homeostasis via hepcidin. Inflammatory stimuli associated with vaccination could potentially upregulate hepatic hepcidin production, leading to functional iron sequestration and reduced availability for erythropoiesis and heme biosynthesis [ 47 2 Finally, a fifth mechanism centers on NADPH competition and redox imbalance. The hepatic processing of LNPs and management of oxidative stress may increase the local demand for NADPH—a critical cofactor for biosynthetic and antioxidant reactions [ 173 2 Taken together, these five hypothetical mechanisms form a conceptual framework in which transient hepatic responses to mRNA vaccination may exert modest yet biologically relevant influences on leukemic hematopoiesis. Although the clinical observations presented by Erdogdu et al. [ 2 4.4. Discussion and Critical Analysis This hypothesis offers novel contributions by integrating hepatic metabolism as a central mediator, shifting from direct vaccine component effects to a liver-amplified perturbation model. Its multimechanistic approach acknowledges the complexity of metabolic networks, proposing that multiple perturbations synergistically create conditions for leukemic transformation. The temporal framework, recognizing immediate, intermediate, and late-phase effects, provides a nuanced understanding and informs intervention timing. The focus on individual susceptibility aligns with precision medicine, suggesting tailored risk mitigation strategies. 4.5. Future Directions While speculative, the proposed framework generates testable hypotheses that can be addressed through complementary approaches. Preclinical studies using hepatocyte–hematopoietic models and genetically predisposed animal systems can define mechanistic plausibility, while prospective clinical cohorts and biomarker studies may clarify translational relevance. Large-scale epidemiologic analyses integrating genomic and metabolic markers will ultimately determine whether these mechanistic perturbations translate into measurable leukemia risk. Such a tiered research agenda provides a pathway for rigorous evaluation while ensuring that public health priorities surrounding vaccination remain protected. 4.6. Limitations The proposed mechanistic pathways are largely theoretical and require empirical validation. The temporal dynamics may not accurately reflect mRNA vaccine kinetics, and individual variability makes universal timelines difficult. Dose–response relationships are undefined, and the specificity of these mechanisms to mRNA vaccines versus other vaccine types needs clarification through comparative studies. Alternative explanations for vaccine-associated leukemogenesis include direct genotoxic effects of vaccine components, immune-mediated mechanisms (e.g., molecular mimicry, altered immune surveillance), and the unmasking or acceleration of pre-existing subclinical leukemic processes by vaccine-induced immune activation [ 202 203 204 The hypothesis integrates with existing knowledge by building on the role of metabolic reprogramming in cancer, the hepatic tropism of lipid nanoparticles, and the established roles of folate metabolism, tryptophan catabolism, iron homeostasis, and redox regulation in hematopoiesis and leukemogenesis. Its novelty lies in proposing how vaccine-induced perturbations in these pathways synergistically create conditions favorable for leukemogenesis. While the proposed mechanistic pathways linking mRNA COVID-19 vaccination to leukemia risk are biologically plausible, they remain speculative without direct epidemiological evidence. Notably, large-scale studies have not demonstrated an increased incidence of leukemia following mRNA vaccination. For instance, a comprehensive analysis of cancer mortality rates in Japan during the COVID-19 pandemic found no significant rise in cancer deaths attributable to mRNA vaccines. Furthermore, a review of clinical trials and pharmacovigilance data involving millions of participants reported no increase in cancer risk associated with mRNA vaccines, underscoring the absence of evidence for such a link. In summary, while the proposed mechanistic models warrant further investigation, current epidemiological and clinical data do not substantiate an increased risk of leukemia following mRNA COVID-19 vaccination. These findings should be acknowledged in the limitations section to provide a balanced perspective. 4.6.1. Clinical Significance for Vaccine Safety and Population Health Confirmation of this theoretical framework would carry profound consequences for contemporary vaccine safety protocols and public health strategies. The proposed mechanisms suggest implementing enhanced metabolic monitoring systems specifically targeting populations with elevated risk profiles, coupled with the development of comprehensive biomarker panels capable of identifying vulnerable individuals prior to vaccination. This approach aligns with emerging precision medicine paradigms, though successful implementation demands significant advances in genetic screening technologies and metabolic profiling capabilities. The challenge lies in balancing individualized risk assessment with population-level screening efficiency while preserving overall vaccination coverage rates. Low-risk preventive strategies, including targeted nutritional supplementation and metabolic optimization protocols, represent promising interventions for high-risk cohorts. However, their clinical development necessitates extensive research to ensure these approaches do not compromise vaccine-induced immunogenicity. The metabolic pathways identified through this framework may also yield novel therapeutic targets for leukemia prevention and treatment, focusing on metabolic vulnerabilities independent of vaccination history. 4.6.2. Experimental Framework and Research Priorities Validating these proposed mechanisms requires a multifaceted research strategy integrating preclinical models, clinical investigations, and methodological innovations. Preclinical validation should leverage murine models with genetic predispositions to hematologic malignancies, complemented by humanized mouse systems incorporating human hepatocytes and hematopoietic cells. In vitro approaches—including primary human hepatocyte cultures and co-culture platforms with hematopoietic progenitors—provide essential tools to dissect cellular crosstalk, metabolic flux, and pathway-specific perturbations, while also enabling high-throughput screening of potential interventions. Clinical validation demands rigorously designed studies that balance scientific depth with ethical imperatives. Prospective observational cohorts of high-risk individuals followed through vaccination periods could reveal associations between metabolic alterations and hematologic outcomes. Biomarker-oriented studies should emphasize temporal profiling of metabolic and cytokine changes in susceptible populations. Interventional trials exploring preventive strategies—such as folate or antioxidant supplementation—must carefully evaluate both safety and preservation of vaccine immunogenicity. Key methodological considerations include precise timing of sample collection to capture transient metabolic perturbations, adequate cohort sizes to account for inter-individual variability, and sufficiently long follow-up with appropriate controls to clarify causal links within the multifactorial landscape of leukemogenesis. Immediate research priorities encompass systematic characterization of vaccine-induced hepatic metabolic responses using advanced metabolomic and multi-omics platforms, combined with computational modeling and innovative imaging techniques. Mechanistic investigations should focus on folate metabolism, tryptophan catabolism, iron homeostasis, and redox regulation in hepatocytes and hematopoietic compartments. Clinical research should prioritize biomarker development to translate mechanistic insights into practical tools while maintaining emphasis on preventive interventions. Regulatory and policy dimensions must include refined metabolic safety assessments in vaccine approval processes, evidence-based risk communication strategies, and clinical guidelines for identifying vulnerable individuals. Throughout, ethical safeguards are essential to ensure that research deepens mechanistic understanding without undermining vaccination confidence, thereby preserving public health priorities while advancing scientific knowledge. 5. Conclusions This hypothesis proposes a novel mechanistic framework linking mRNA vaccination to leukemogenesis in susceptible individuals, mediated by the liver’s role in amplifying vaccine-induced metabolic perturbations across five interconnected pathways: folate utilization, lipid processing, tryptophan catabolism, iron homeostasis, and redox regulation. Its strength lies in integrating established biological principles with novel insights, recognizing individual susceptibility, and generating testable predictions. However, it remains theoretical and requires rigorous experimental and clinical validation, acknowledging the complexity and multifactorial nature of leukemogenesis. The potential risks must be weighed against the well-established benefits of vaccination. Clinical implications include personalized risk assessment, preventive interventions, and enhanced monitoring. Research priorities extend to broader questions of metabolic regulation in leukemogenesis and new therapeutic approaches. Ultimately, this hypothesis calls for increased attention to metabolic factors in vaccine safety and leukemia research, providing a framework for understanding the complex interactions between vaccination, metabolism, and cancer. Validation or refutation through rigorous scientific investigation will improve knowledge of vaccine safety and leukemogenesis, leading to better prevention and treatment strategies. Maintaining public confidence in vaccination programs is paramount, and research must be conducted with scientific rigor and clear communication about the hypothetical nature of proposed mechanisms, aiming to enhance safety through understanding individual risk factors and targeted interventions, rather than discouraging vaccination. Acknowledgments During the preparation of this manuscript, the authors used Anthropic’s Claude Opus 4.1 to improve readability, clarity, and formatting of the text. The authors reviewed and edited the content and take full responsibility for the content of this publication. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, B.E.; Investigation, B.E. and Ü.Y.M.; Methodology, B.E. and M.Ç.; Writing—Original Draft Preparation, B.E.; Supervision, B.E. and İ.C.H.; Data Curation, O.K.; Formal Analysis, O.K.; Visualization, O.K.; Writing—Review and Editing, O.K., M.Ç., Ü.Y.M. and İ.C.H.; Resources, M.Ç.; Validation, M.Ç. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study is a purely hypothesis-driven, theoretical work and does not involve any direct experimentation on humans or animals. The manuscript builds upon previously published scientific data and integrates existing literature to propose a novel mechanistic framework linking hepatic metabolic dysregulation to leukemogenesis following mRNA vaccination. No new clinical, laboratory, or animal data were generated or analyzed for the purposes of this manuscript. Therefore, ethical approval from an institutional review board (IRB) or ethics committee was not required. The study did not involve the collection, storage, or analysis of personal health information or biological specimens. All discussions and proposed mechanisms are based solely on the synthesis and interpretation of published findings, ensuring that no ethical concerns regarding human or animal experimentation apply to this work. Data Availability Statement The data presented in this study are available in the article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Greaves M. Leukaemia ‘firsts’ in cancer research and treatment Nat. Rev. Cancer 2016 16 163 172 10.1038/nrc.2016.3 26911190 2. Erdoğdu B. Kaplan O. Fidan B.B. Çelebier M. Malkan Ü.Y. Haznedaroglu I.C. Metabolomic Profiling of Leukemic Hematopoiesis: Effects of BNT162b2 mRNA COVID-19 Vaccine Administration Curr. Mol. Med. 2025 in press 10.2174/0115665240361878250601074746 40464175 3. DeBerardinis R.J. Chandel N.S. Fundamentals of cancer metabolism Sci. Adv. 2016 2 e1600200 10.1126/sciadv.1600200 27386546 PMC4928883 4. Mishra S.K. Millman S.E. Zhang L. Metabolism in acute myeloid leukemia: Mechanistic insights and therapeutic targets Blood 2023 141 1119 1135 10.1182/blood.2022018092 36548959 PMC10375271 5. Jones C.L. Inguva A. Jordan C.T. Targeting Energy Metabolism in Cancer Stem Cells: Progress and Challenges in Leukemia and Solid Tumors Cell Stem Cell 2021 28 378 393 10.1016/j.stem.2021.02.013 33667359 PMC7951949 6. Hosseini-Kharat M. Bremmell K.E. Prestidge C.A. Why do lipid nanoparticles target the liver? Understanding of biodistribution and liver-specific tropism Mol. Ther. Methods Clin. Dev. 2025 33 101436 10.1016/j.omtm.2025.101436 40104152 PMC11919328 7. Shi Y. Shi M. Wang Y. You J. Progress and prospects of mRNA-based drugs in pre-clinical and clinical applications Signal Transduct. Target. Ther. 2024 9 322 10.1038/s41392-024-02002-z 39543114 PMC11564800 8. Alhumaid S. Al Mutair A. Rabaan A.A. Alshakhs F.M. Choudhary O.P. Yong S.J. Nainu F. Khan A. Muhammad J. Alhelal F. New-onset and relapsed liver diseases following COVID-19 vaccination: A systematic review BMC Gastroenterol. 2022 22 433 10.1186/s12876-022-02507-3 36229799 PMC9559550 9. Eens S. Van Hecke M. Favere K. Tousseyn T. Guns P.J. Roskams T. Heidbuchel H. B-cell lymphoblastic lymphoma following intravenous BNT162b2 mRNA booster in a BALB/c mouse: A case report Front. Oncol. 2023 13 1158124 10.3389/fonc.2023.1158124 37197431 PMC10183601 10. Zamfir M.-A. Moraru L. Dobrea C. Scheau A.-E. Iacob S. Moldovan C. Scheau C. Caruntu C. Caruntu A. Hematologic Malignancies Diagnosed in the Context of the mRNA COVID-19 Vaccination Campaign: A Report of Two Cases Medicina 2022 58 874 10.3390/medicina58070874 35888593 PMC9316988 11. Ang S.-Y. Huang Y.-F. Chang C.-T. pH-positive B-cell acute lymphoblastic leukemia occurring after receipt of bivalent SARS-CoV-2 mRNA vaccine booster: A case report Medicina 2023 59 627 10.3390/medicina59030627 36984629 PMC10054610 12. Paulusma C.C. Lamers W.H. Broer S. van de Graaf S.F. Amino acid metabolism, transport and signalling in the liver revisited Biochem. Pharmacol. 2022 201 115074 10.1016/j.bcp.2022.115074 35568239 13. Soares-da-Silva F. Peixoto M. Cumano A. Pinto-Do-Ó. P. Crosstalk between the hepatic and hematopoietic systems during embryonic development Front. Cell Dev. Biol. 2020 8 612 10.3389/fcell.2020.00612 32793589 PMC7387668 14. Meynard D. Babitt J.L. Lin H.Y. The liver: Conductor of systemic iron balance Blood 2014 123 168 176 10.1182/blood-2013-06-427757 24200681 PMC3888285 15. Nakamura-Ishizu A. Ito K. Suda T. Hematopoietic stem cell metabolism during development and aging Dev. Cell 2020 54 239 255 10.1016/j.devcel.2020.06.029 32693057 PMC7418032 16. Kawaguchi M. Noda M. Ono A. Kamiya M. Matsumoto M. Tsurumaru M. Mizukami S. Mukai H. Kawakami S. Effect of Cholesterol Content of Lipid Composition in mRNA-LNPs on the Protein Expression in the Injected Site and Liver After Local Administration in Mice J. Pharm. Sci. 2023 112 1401 1410 10.1016/j.xphs.2022.12.026 36596392 PMC9805379 17. Vasileva O. Zaborova O. Shmykov B. Ivanov R. Reshetnikov V. Composition of lipid nanoparticles for targeted delivery: Application to mRNA therapeutics Front. Pharmacol. 2024 15 1466337 10.3389/fphar.2024.1466337 39508050 PMC11537937 18. Wang J. Ding Y. Chong K. Cui M. Cao Z. Tang C. Tian Z. Hu Y. Zhao Y. Jiang S. Recent Advances in Lipid Nanoparticles and Their Safety Concerns for mRNA Delivery Vaccines 2024 12 1148 10.3390/vaccines12101148 39460315 PMC11510967 19. Parrett B.J. Yamaoka S. Barry M.A. Reducing off-target expression of mRNA therapeutics and vaccines in the liver with microRNA binding sites Mol. Ther. Methods Clin. Dev. 2025 33 101402 10.1016/j.omtm.2024.101402 39867482 PMC11758401 20. Pardi N. Tuyishime S. Muramatsu H. Kariko K. Mui B.L. Tam Y.K. Madden T.D. Hope M.J. Weissman D. Expression kinetics of nucleoside-modified mRNA delivered in lipid nanoparticles to mice by various routes J. Control. Release 2015 217 345 351 10.1016/j.jconrel.2015.08.007 26264835 PMC4624045 21. Kalita T. Dezfouli S.A. Pandey L.M. Uludag H. siRNA Functionalized Lipid Nanoparticles (LNPs) in Management of Diseases Pharmaceutics 2022 14 2520 10.3390/pharmaceutics14112520 36432711 PMC9694336 22. Kalola U.K. Pellegrini M.V. Patisiran StatPearls Publishing Treasure Island, FL, USA 2023 36972364 23. Jiang K. Tian K. Yu Y. Wu E. Yang M. Pan F. Qian J. Zhan C. Kupffer cells determine intrahepatic traffic of PEGylated liposomal doxorubicin Nat. Commun. 2024 15 6136 10.1038/s41467-024-50568-7 39033145 PMC11271521 24. Xie F. Ding X. Zhang Q.Y. An update on the role of intestinal cytochrome P450 enzymes in drug disposition Acta Pharm. Sin. B 2016 6 374 383 10.1016/j.apsb.2016.07.012 27709006 PMC5045550 25. Pasquiers B. Benamara S. Felices M. Nguyen L. Declèves X. Review of the Existing Translational Pharmacokinetics Modeling Approaches Specific to Monoclonal Antibodies (mAbs) to Support the First-In-Human (FIH) Dose Selection Int. J. Mol. Sci. 2022 23 12754 10.3390/ijms232112754 36361546 PMC9657028 26. Abufares H.I. Zenati R.A. Soares N.C. El-Huneidi W. Dahabiyeh L.A. Al-Hroub H.M. Alqudah M.A.Y. Abuhelwa A.Y. Alzoubi K.H. Abu-Gharbieh E. A non-targeted metabolomics comparative study on plasma of pfizer and sinopharm COVID-19 vaccinated individuals, assessed by (TIMS-QTOF) mass spectrometry Heliyon 2024 10 e35443 10.1016/j.heliyon.2024.e35443 39170395 PMC11336712 27. Zhang W. Pfeifle A. Lansdell C. Frahm G. Cecillon J. Tamming L. Gravel C. Gao J. Thulasi Raman S.N. Wang L. The Expression Kinetics and Immunogenicity of Lipid Nanoparticles Delivering Plasmid DNA and mRNA in Mice Vaccines 2023 11 1580 10.3390/vaccines11101580 37896985 PMC10610642 28. Pateev I. Seregina K. Ivanov R. Reshetnikov V. Biodistribution of RNA Vaccines and of Their Products: Evidence from Human and Animal Studies Biomedicines 2024 12 59 10.3390/biomedicines12010059 38255166 PMC10812935 29. Du X. Yada E. Terai Y. Takahashi T. Nakanishi H. Tanaka H. Akita H. Itaka K. Comprehensive Evaluation of Lipid Nanoparticles and Polyplex Nanomicelles for Muscle-Targeted mRNA Delivery Pharmaceutics 2023 15 2291 10.3390/pharmaceutics15092291 37765260 PMC10536695 30. Di J. Du Z. Wu K. Jin S. Wang X. Li T. Xu Y. Biodistribution and Non-linear Gene Expression of mRNA LNPs Affected by Delivery Route and Particle Size Pharm. Res. 2022 39 105 114 10.1007/s11095-022-03166-5 35080707 PMC8791091 31. Schinas G. Polyzou E. Dimakopoulou V. Tsoupra S. Gogos C. Akinosoglou K. Immune-mediated liver injury following COVID-19 vaccination World J. Virol. 2023 12 100 108 10.5501/wjv.v12.i2.100 37033146 PMC10075055 32. Palmer M. Seekins D. Avigan M. Marcinak J. Rockey D.C. Regev A. Shastri V.K. Lewis J.H. Dash A. The Impact of COVID-19 and COVID-19 Vaccination on Detection, Assessment, and Management of Suspected Acute Drug-Induced Liver Injury Occurring during Clinical Trials: Consensus Recommendations from the IQ DILI Initiative Drug Saf. 2025 48 879 890 10.1007/s40264-025-01591-0 40762948 33. Guardiola J. Lammert C. Teal E. Chalasani N. Unexplained liver test elevations after SARS-CoV-2 vaccination J. Hepatol. 2022 77 251 253 10.1016/j.jhep.2022.02.014 35282897 PMC8908799 34. Lv K. Yu Z. Wang J. Li N. Wang A. Xue T. Wang Q. Shi Y. Han L. Qin W. Discovery of Ketal-Ester Ionizable Lipid Nanoparticle with Reduced Hepatotoxicity, Enhanced Spleen Tropism for mRNA Vaccine Delivery Adv. Sci. 2024 11 2404684 10.1002/advs.202404684 PMC11615764 39387241 35. Ng A.J.J. Teo D.C.H. Dorajoo S.R. Yap A.J.Y. Chow W.C. Ng N.K.M. Soh S.B.L. Acute autoimmune hepatitis following COVID-19 mRNA vaccination: A population-based study using electronic health records in Singapore Vaccine 2024 42 126462 10.1016/j.vaccine.2024.126462 39454292 36. Ghielmetti M. Schaufelberger H.D. Mieli-Vergani G. Cerny A. Dayer E. Vergani D. Terziroli Beretta-Piccoli B. Acute autoimmune-like hepatitis with atypical anti-mitochondrial antibody after mRNA COVID-19 vaccination: A novel clinical entity? J. Autoimmun. 2021 123 102706 10.1016/j.jaut.2021.102706 34293683 PMC8279947 37. Kim J.H. Chae H.B. Woo S. Song M.S. Kim H.-J. Woo C.G. Clinicopathological characteristics of autoimmune-like hepatitis induced by COVID-19 mRNA vaccine (Pfizer-BioNTech, BNT162b2): A case report and literature review Int. J. Surg. Pathol. 2023 31 1156 1162 10.1177/10668969231177877 37272061 PMC10242336 38. Wang Y. Chen X. Aragao A.P. Ding X. COVID-19-associated Autoimmune Hepatitis: A Case Report and Literature Review J. Clin. Transl. Pathol. 2025 10.14218/JCTP.2025.00010 39. Efe C. Uzun S. Matter M.S. Terziroli Beretta-Piccoli B. Autoimmune-Like Hepatitis Related to SARS-CoV-2 Vaccination: Towards a Clearer Definition Liver Int. 2025 45 e16209 10.1111/liv.16209 39673711 40. Chen C. Xie D. Xiao J. Real-world evidence of autoimmune hepatitis following COVID-19 vaccination: A population-based pharmacovigilance analysis Front. Pharmacol. 2023 14 1100617 10.3389/fphar.2023.1100617 37124218 PMC10133579 41. Chow K.W. Pham N.V. Ibrahim B.M. Hong K. Saab S. Autoimmune Hepatitis-Like Syndrome Following COVID-19 Vaccination: A Systematic Review of the Literature Dig. Dis. Sci. 2022 67 4574 4580 10.1007/s10620-022-07504-w 35486203 PMC9052185 42. Hannun Y.A. Obeid L.M. Sphingolipids and their metabolism in physiology and disease Nat. Rev. Mol. Cell Biol. 2018 19 175 191 10.1038/nrm.2017.107 29165427 PMC5902181 43. Lewis K. Yoshimoto M. Takebe T. Fetal liver hematopoiesis: From development to delivery Stem Cell Res. Ther. 2021 12 139 10.1186/s13287-021-02189-w 33597015 PMC7890853 44. Zhang Z. Huang Z. Ong B. Sahu C. Zeng H. Ruan H.B. Bone marrow adipose tissue-derived stem cell factor mediates metabolic regulation of hematopoiesis Haematologica 2019 104 1731 1743 10.3324/haematol.2018.205856 30792196 PMC6717592 45. Guo Y. Zhang X. Huang J. Zeng Y. Liu W. Geng C. Li K.W. Yang D. Wu S. Wei H. Relationships between hematopoiesis and hepatogenesis in the midtrimester fetal liver characterized by dynamic transcriptomic and proteomic profiles PLoS ONE 2009 4 e7641 10.1371/journal.pone.0007641 19865483 PMC2765071 46. Gao B. Li Z.T. Xue D.B. Zhang W.H. A novel mechanism of abnormal hematological indices in liver cirrhosis: Bone marrow endothelial cell dysfunction caused by humoral inhibitor affects the hematopoietic function of bone marrow Med. Hypotheses 2014 82 282 285 10.1016/j.mehy.2013.12.010 24388557 47. Ganz T. Nemeth E. Hepcidin and iron homeostasis Biochim. Biophys. Acta (BBA)—Mol. Cell Res. 2012 1823 1434 1443 10.1016/j.bbamcr.2012.01.014 PMC4048856 22306005 48. Clara C. Antonella N. Laura S. Iron metabolism and iron disorders revisited in the hepcidin era Haematologica 2020 105 260 272 10.3324/haematol.2019.232124 31949017 PMC7012465 49. Xu Y. Alfaro-Magallanes V.M. Babitt J.L. Physiological and pathophysiological mechanisms of hepcidin regulation: Clinical implications for iron disorders Br. J. Haematol. 2021 193 882 893 10.1111/bjh.17252 33316086 PMC8164969 50. Tufail M. Jiang C.-H. Li N. Altered metabolism in cancer: Insights into energy pathways and therapeutic targets Mol. Cancer 2024 23 203 10.1186/s12943-024-02119-3 39294640 PMC11409553 51. Sayın S. Yıldırım M. Erdoğdu B. Kaplan O. Koç E. Bulduk T. Cömert M. Güney M. Çelebier M. Aylı M. Metabolomic Profiling and Bioanalysis of Chronic Myeloid Leukemia: Identifying Biomarkers for Treatment Response and Disease Monitoring Metabolites 2025 15 376 10.3390/metabo15060376 40559400 PMC12195291 52. Rattigan K.M. Zarou M.M. Helgason G.V. Metabolism in stem cell–driven leukemia: Parallels between hematopoiesis and immunity Blood 2023 141 2553 2565 36634302 10.1182/blood.2022018258 PMC10646800 53. Tuval A. Shlush L.I. Evolutionary trajectory of leukemic clones and its clinical implications Haematologica 2019 104 872 880 10.3324/haematol.2018.195289 31004016 PMC6518877 54. Joo L. Bradley C.C. Lin S.H. Scheet P.A. Nead K.T. Causes of Clonal Hematopoiesis: A Review Curr. Oncol. Rep. 2023 25 211 220 10.1007/s11912-023-01362-z 36719597 PMC10320845 55. Corces M.R. Chang H.Y. Majeti R. Preleukemic hematopoietic stem cells in human acute myeloid leukemia Front. Oncol. 2017 7 263 10.3389/fonc.2017.00263 29164062 PMC5681525 56. Shuvalov O. Petukhov A. Daks A. Fedorova O. Vasileva E. Barlev N.A. One-carbon metabolism and nucleotide biosynthesis as attractive targets for anticancer therapy Oncotarget 2017 8 23955 10.18632/oncotarget.15053 28177894 PMC5410357 57. Kemna K. van der Burg M. Lankester A. Giera M. Hematopoietic stem cell metabolism within the bone marrow niche—Insights and opportunities Bioessays 2025 47 e2400154 10.1002/bies.202400154 39506498 PMC11755706 58. Zarou M.M. Vazquez A. Vignir Helgason G. Folate metabolism: A re-emerging therapeutic target in haematological cancers Leukemia 2021 35 1539 1551 10.1038/s41375-021-01189-2 33707653 PMC8179844 59. Zaitsev A.V. Martinov M.V. Vitvitsky V.M. Ataullakhanov F.I. Rat liver folate metabolism can provide an independent functioning of associated metabolic pathways Sci. Rep. 2019 9 7657 10.1038/s41598-019-44009-5 31113966 PMC6529478 60. Steinberg S.E. Campbell C.L. Hillman R.S. Kinetics of the normal folate enterohepatic cycle J. Clin. Investig. 1979 64 83 88 10.1172/JCI109467 447863 PMC372093 61. Cantarella C.D. Ragusa D. Giammanco M. Tosi S. Folate deficiency as predisposing factor for childhood leukaemia: A review of the literature Genes. Nutr. 2017 12 14 10.1186/s12263-017-0560-8 28588742 PMC5455200 62. Duthie S.J. Folate and cancer: How DNA damage, repair and methylation impact on colon carcinogenesis J. Inherit. Metab. Dis. 2011 34 101 109 10.1007/s10545-010-9128-0 20544289 63. LeBlanc D.P. Behan N.A. O’Brien J.M. Marchetti F. MacFarlane A.J. Folate deficiency increases chromosomal damage and mutations in hematopoietic cells in the transgenic mutamouse model Environ. Mol. Mutagen. 2018 59 366 374 10.1002/em.22190 29668043 64. Koury M.J. Park D.J. Martincic D. Horne D.W. Kravtsov V. Whitlock J.A. del Pilar Aguinaga M. Kopsombut P. Folate Deficiency Delays the Onset But Increases the Incidence of Leukemia in Friend Virus-Infected Mice Blood 1997 90 4054 4061 10.1182/blood.v90.10.4054 9354675 65. Zheng Y. Cantley L.C. Toward a better understanding of folate metabolism in health and disease J. Exp. Med. 2019 216 253 266 10.1084/jem.20181965 30587505 PMC6363433 66. Beetstra S. Thomas P. Salisbury C. Turner J. Fenech M. Folic acid deficiency increases chromosomal instability, chromosome 21 aneuploidy and sensitivity to radiation-induced micronuclei Mutat. Res. 2005 578 317 326 10.1016/j.mrfmmm.2005.05.012 16005909 67. Lamm N. Maoz K. Bester A.C. Im M.M. Shewach D.S. Karni R. Kerem B. Folate levels modulate oncogene-induced replication stress and tumorigenicity EMBO Mol. Med. 2015 7 1138 1152 26197802 10.15252/emmm.201404824 PMC4568948 68. Duthie S.J. Folic acid deficiency and cancer: Mechanisms of DNA instability Br. Med. Bull. 1999 55 578 592 10.1258/0007142991902646 10746348 69. Crider K.S. Yang T.P. Berry R.J. Bailey L.B. Folate and DNA methylation: A review of molecular mechanisms and the evidence for folate’s role Adv. Nutr. 2012 3 21 38 10.3945/an.111.000992 22332098 PMC3262611 70. Bills N.D. Koury M.J. Clifford A.J. Dessypris E.N. Ineffective hematopoiesis in folate-deficient mice Blood 1992 79 2273 2280 1571542 71. Henry C.J. Nemkov T. Casás-Selves M. Bilousova G. Zaberezhnyy V. Higa K.C. Serkova N.J. Hansen K.C. D’Alessandro A. DeGregori J. Folate dietary insufficiency and folic acid supplementation similarly impair metabolism and compromise hematopoiesis Haematologica 2017 102 1985 1994 10.3324/haematol.2017.171074 28883079 PMC5709097 72. Zhang Y. Guo R. Kim S.H. Shah H. Zhang S. Liang J.H. Fang Y. Gentili M. Leary C.N.O. Elledge S.J. SARS-CoV-2 hijacks folate and one-carbon metabolism for viral replication Nat. Commun. 2021 12 1676 10.1038/s41467-021-21903-z 33723254 PMC7960988 73. Trougakos I.P. Terpos E. Alexopoulos H. Politou M. Paraskevis D. Scorilas A. Kastritis E. Andreakos E. Dimopoulos M.A. Adverse effects of COVID-19 mRNA vaccines: The spike hypothesis Trends Mol. Med. 2022 28 542 554 10.1016/j.molmed.2022.04.007 35537987 PMC9021367 74. Zhang Y. Pang Y. Xu B. Chen X. Liang S. Hu J. Luo X. Folic acid restricts SARS-CoV-2 invasion by methylating ACE2 Front. Microbiol. 2022 13 980903 10.3389/fmicb.2022.980903 36060767 PMC9432853 75. Teijaro J.R. Farber D.L. COVID-19 vaccines: Modes of immune activation and future challenges Nat. Rev. Immunol. 2021 21 195 197 10.1038/s41577-021-00526-x 33674759 PMC7934118 76. Reinscheid M. Luxenburger H. Karl V. Graeser A. Giese S. Ciminski K. Reeg D.B. Oberhardt V. Roehlen N. Lang-Meli J. COVID-19 mRNA booster vaccine induces transient CD8+ T effector cell responses while conserving the memory pool for subsequent reactivation Nat. Commun. 2022 13 4631 10.1038/s41467-022-32324-x 35941157 PMC9358914 77. Sahin U. Muik A. Derhovanessian E. Vogler I. Kranz L.M. Vormehr M. Baum A. Pascal K. Quandt J. Maurus D. Publisher Correction: COVID-19 vaccine BNT162b1 elicits human antibody and T(H)1 T cell responses Nature 2021 590 E17 10.1038/s41586-020-03102-w 33469214 78. Abe I. Shirato K. Hashizume Y. Mitsuhashi R. Kobayashi A. Shiono C. Sato S. Tachiyashiki K. Imaizumi K. Folate-deficiency induced cell-specific changes in the distribution of lymphocytes and granulocytes in rats Environ. Health Prev. Med. 2013 18 78 84 10.1007/s12199-012-0286-6 22644659 PMC3541812 79. Courtemanche C. Elson-Schwab I. Mashiyama S.T. Kerry N. Ames B.N. Folate Deficiency Inhibits the Proliferation of Primary Human CD8+ T Lymphocytes In Vitro1 J. Immunol. 2004 173 3186 3192 10.4049/jimmunol.173.5.3186 15322179 80. Bayer A.L. Fraker C.A. The folate cycle as a cause of natural killer cell dysfunction and viral etiology in type 1 diabetes Front. Endocrinol. 2017 8 302005 10.3389/fendo.2017.00315 PMC5703744 29218028 81. Dagla I. Iliou A. Benaki D. Gikas E. Mikros E. Bagratuni T. Kastritis E. Dimopoulos M.A. Terpos E. Tsarbopoulos A. Plasma metabolomic alterations induced by COVID-19 vaccination reveal putative biomarkers reflecting the immune response Cells 2022 11 1241 10.3390/cells11071241 35406806 PMC8997405 82. Masoodi M. Peschka M. Schmiedel S. Haddad M. Frye M. Maas C. Lohse A. Huber S. Kirchhof P. Nofer J.-R. Disturbed lipid and amino acid metabolisms in COVID-19 patients J. Mol. Med. 2022 100 555 568 10.1007/s00109-022-02177-4 35064792 PMC8783191 83. Krum B. Huerta N. Chiou V. Welner R. Patel S.B. Nemkov T. Beaudin A.E. Metabolic programming of hematopoietic stem cell function by prenatal folate Blood 2023 142 5 10.1182/blood-2023-187431 84. Karakousis N.D. Gourgoulianis K.I. Kotsiou O.S. The Role of Folic Acid in SARS-CoV-2 Infection: An Intriguing Linkage under Investigation J. Pers. Med. 2023 13 561 10.3390/jpm13030561 36983742 PMC10052526 85. Škrbić R. Travar M. Stojiljković M.P. Djuric D.M. Suručić R. Folic Acid and Leucovorin Have Potential to Prevent SARS-CoV-2-Virus Internalization by Interacting with S-Glycoprotein/Neuropilin-1 Receptor Complex Molecules 2023 28 2294 36903540 10.3390/molecules28052294 PMC10005443 86. Bliek-Bueno K. Mucherino S. Poblador-Plou B. González-Rubio F. Aza-Pascual-Salcedo M. Orlando V. Clerencia-Sierra M. Ioakeim-Skoufa I. Coscioni E. Carmona-Pírez J. Baseline drug treatments as indicators of increased risk of COVID-19 mortality in Spain and Italy Int. J. Environ. Res. Public Health 2021 18 11786 34831541 10.3390/ijerph182211786 PMC8623536 87. Sheybani Z. Dokoohaki M.H. Negahdaripour M. Dehdashti M. Zolghadr H. Moghadami M. Masoompour S.M. Zolghadr A.R. The interactions of folate with the enzyme furin: A computational study RSC Adv. 2021 11 23815 23824 10.1039/d1ra03299b 35479793 PMC9036578 88. Jiang X. Li D. Maghsoudloo M. Zhang X. Ma W. Fu J. Targeting furin, a cellular proprotein convertase, for COVID-19 prevention and therapeutics Drug Discov. Today 2024 29 104026 10.1016/j.drudis.2024.104026 38762086 89. McCaddon A. Regland B. COVID-19: A methyl-group assault? Med. Hypotheses 2021 149 110543 10.1016/j.mehy.2021.110543 33657459 PMC7890339 90. Rinchai D. Deola S. Zoppoli G. Kabeer B.S.A. Taleb S. Pavlovski I. Maacha S. Gentilcore G. Toufiq M. Mathew L. High-temporal resolution profiling reveals distinct immune trajectories following the first and second doses of COVID-19 mRNA vaccines Sci. Adv. 2022 8 eabp9961 10.1126/sciadv.abp9961 36367935 PMC9651857 91. Jukic I. Heffernan A. Schelling A.F. Kokic Males V. Savicevic N.J. Kovacic V. Association between COVID-19 Infection or Vaccination Outcomes and Methylenetetrahydrofolate Reductase Gene Polymorphism: A Systematic Review of the Literature J. Pers. Med. 2023 13 1687 10.3390/jpm13121687 38138914 PMC10744904 92. Reichmuth A.M. Oberli M.A. Jaklenec A. Langer R. Blankschtein D. mRNA vaccine delivery using lipid nanoparticles Ther. Deliv. 2016 7 319 334 10.4155/tde-2016-0006 27075952 PMC5439223 93. Hui Y. Yi X. Wibowo D. Yang G. Middelberg A.P. Gao H. Zhao C.-X. Nanoparticle elasticity regulates phagocytosis and cancer cell uptake Sci. Adv. 2020 6 eaaz4316 10.1126/sciadv.aaz4316 32426455 PMC7164958 94. Kiaie S.H. Majidi Zolbanin N. Ahmadi A. Bagherifar R. Valizadeh H. Kashanchi F. Jafari R. Recent advances in mRNA-LNP therapeutics: Immunological and pharmacological aspects J. Nanobiotechnol. 2022 20 276 10.1186/s12951-022-01478-7 PMC9194786 35701851 95. Nikolova-Karakashian M.N. Reid M.B. Sphingolipid metabolism, oxidant signaling, and contractile function of skeletal muscle Antioxid. Redox Signal. 2011 15 2501 2517 10.1089/ars.2011.3940 21453197 PMC3176343 96. Ponnusamy S. Meyers-Needham M. Senkal C.E. Saddoughi S.A. Sentelle D. Selvam S.P. Salas A. Ogretmen B. Sphingolipids and cancer: Ceramide and sphingosine-1-phosphate in the regulation of cell death and drug resistance Future Oncol. 2010 6 1603 1624 10.2217/fon.10.116 21062159 PMC3071292 97. Oskouian B. Saba J.D. Cancer treatment strategies targeting sphingolipid metabolism Adv. Exp. Med. Biol. 2010 688 185 205 10.1007/978-1-4419-6741-1_13 20919655 PMC3076281 98. Binici B. Rattray Z. Zinger A. Perrie Y. Exploring the impact of commonly used ionizable and pegylated lipids on mRNA-LNPs: A combined in vitro and preclinical perspective J. Control Release 2025 377 162 173 10.1016/j.jconrel.2024.11.010 39521063 99. Hou X. Zaks T. Langer R. Dong Y. Lipid nanoparticles for mRNA delivery Nat. Rev. Mater. 2021 6 1078 1094 10.1038/s41578-021-00358-0 34394960 PMC8353930 100. Ferraresso F. Strilchuk A.W. Juang L.J. Poole L.G. Luyendyk J.P. Kastrup C.J. Comparison of DLin-MC3-DMA and ALC-0315 for siRNA Delivery to Hepatocytes and Hepatic Stellate Cells Mol. Pharm. 2022 19 2175 2182 10.1021/acs.molpharmaceut.2c00033 35642083 PMC9621687 101. Álvarez-Benedicto E. Farbiak L. Márquez Ramírez M. Wang X. Johnson L.T. Mian O. Guerrero E.D. Siegwart D.J. Optimization of phospholipid chemistry for improved lipid nanoparticle (LNP) delivery of messenger RNA (mRNA) Biomater. Sci. 2022 10 549 559 10.1039/d1bm01454d 34904974 PMC9113778 102. Chin C.F. Galam D. Gao L. Tan B.C. Wong B.H. Chua G.L. Loke R.Y. Lim Y.C. Wenk M.R. Lim M.S. Blood-derived lysophospholipid sustains hepatic phospholipids and fat storage necessary for hepatoprotection in overnutrition J. Clin. Investig. 2023 133 e171267 10.1172/jci171267 37463052 PMC10471173 103. Papadopoulos C. Tentes I. Papazoglou D. Anagnostopoulos K. Lysophospholipid metabolism and signalling in non-alcoholic fatty liver disease Folia Medica 2022 64 7 12 10.3897/folmed.64.e59297 35851901 104. Tan S.T. Ramesh T. Toh X.R. Nguyen L.N. Emerging roles of lysophospholipids in health and disease Prog. Lipid Res. 2020 80 101068 10.1016/j.plipres.2020.101068 33068601 105. Giraldo-Lorza J.M. Leidy C. Manrique-Moreno M. The Influence of Cholesterol on Membrane Targeted Bioactive Peptides: Modulating Peptide Activity Through Changes in Bilayer Biophysical Properties Membranes 2024 14 220 10.3390/membranes14100220 39452832 PMC11509253 106. Ikonen E. Cellular cholesterol trafficking and compartmentalization Nat. Rev. Mol. Cell Biol. 2008 9 125 138 10.1038/nrm2336 18216769 107. Escalona-Rayo O. Zeng Y. Knol R.A. Kock T.J.F. Aschmann D. Slütter B. Kros A. In vitro and in vivo evaluation of clinically-approved ionizable cationic lipids shows divergent results between mRNA transfection and vaccine efficacy Biomed. Pharmacother. 2023 165 115065 10.1016/j.biopha.2023.115065 37406506 108. Lee Y.-S. Osborne T.F. Seo Y.-K. Jeon T.-I. SREBP-1c Ablation Protects Against ER Stress-induced Hepatic Steatosis by Preventing Impaired Fatty Acid Oxidation J. Life Sci. 2021 31 796 805 109. Pinto B.A.S. França L.M. Laurindo F.R.M. Paes A.M.A. Unfolded Protein Response: Cause or Consequence of Lipid and Lipoprotein Metabolism Disturbances? Adv. Exp. Med. Biol. 2019 1127 67 82 10.1007/978-3-030-11488-6_5 31140172 110. Baral A. Endoplasmic Reticulum Stress Signaling in the Regulation of Hepatic Pathological Responses Stresses 2024 4 481 504 10.3390/stresses4030031 111. Zhang Z. Yang H. Han F. Guo P. Reactive Oxygen Species as Key Molecules in the Pathogenesis of Alcoholic Fatty Liver Disease and Nonalcoholic Fatty Liver Disease: Future Perspectives Curr. Issues Mol. Biol. 2025 47 464 10.3390/cimb47060464 40699863 PMC12191510 112. Liang W. Tonini G. Mulder P. Kelder T. van Erk M. van den Hoek A.M. Mariman R. Wielinga P.Y. Baccini M. Kooistra T. Coordinated and interactive expression of genes of lipid metabolism and inflammation in adipose tissue and liver during metabolic overload PLoS ONE 2013 8 e75290 24086498 10.1371/journal.pone.0075290 PMC3783477 113. Błachnio-Zabielska A.U. Sadowska P. Zdrodowski M. Laudański P. Szamatowicz J. Kuźmicki M. The Interplay between Oxidative Stress and Sphingolipid Metabolism in Endometrial Cancer Int. J. Mol. Sci. 2024 25 10243 10.3390/ijms251910243 39408574 PMC11477002 114. Green C.D. Maceyka M. Cowart L.A. Spiegel S. Sphingolipids in metabolic disease: The good, the bad, and the unknown Cell Metab. 2021 33 1293 1306 10.1016/j.cmet.2021.06.006 34233172 PMC8269961 115. Van Brocklyn J.R. Williams J.B. The control of the balance between ceramide and sphingosine-1-phosphate by sphingosine kinase: Oxidative stress and the seesaw of cell survival and death Comp. Biochem. Physiol. Part B Biochem. Mol. Biol. 2012 163 26 36 10.1016/j.cbpb.2012.05.006 22613819 116. Köberlin M.S. Snijder B. Heinz L.X. Baumann C.L. Fauster A. Vladimer G.I. Gavin A.-C. Superti-Furga G. A Conserved Circular Network of Coregulated Lipids Modulates Innate Immune Responses Cell 2015 162 170 183 10.1016/j.cell.2015.05.051 26095250 PMC4523684 117. Rufail M.L. Bassi R. Giussani P. Sphingosine-1-Phosphate Metabolic Pathway in Cancer: Implications for Therapeutic Targets Int. J. Mol. Sci. 2025 26 1056 10.3390/ijms26031056 39940821 PMC11817292 118. Chalfant C.E. Spiegel S. Sphingosine 1-phosphate and ceramide 1-phosphate: Expanding roles in cell signaling J. Cell Sci. 2005 118 4605 4612 10.1242/jcs.02637 16219683 119. Anselmo S. Bonaccorso E. Gangemi C. Sancataldo G. Conti Nibali V. D’Angelo G. Lipid Rafts in Signalling, Diseases, and Infections: What Can Be Learned from Fluorescence Techniques? Membranes 2025 15 6 10.3390/membranes15010006 39852247 PMC11766618 120. Preta G. New insights into targeting membrane lipids for cancer therapy Front. Cell Dev. Biol. 2020 8 571237 10.3389/fcell.2020.571237 32984352 PMC7492565 121. Marques-da-Silva D. Lagoa R. Rafting on the Evidence for Lipid Raft-like Domains as Hubs Triggering Environmental Toxicants’ Cellular Effects Molecules 2023 28 6598 10.3390/molecules28186598 37764374 PMC10536579 122. Morán G.A.G. Parra-Medina R. Cardona A.G. Quintero-Ronderos P. Rodríguez É.G. Cytokines, chemokines and growth factors Autoimmunity: From Bench to Bedside [Internet] El Rosario University Press Bogotá, Colombia 2013 123. Alomari M. Almohazey D. Almofty S.A. Khan F.A. Al Hamad M. Ababneh D. Role of Lipid Rafts in Hematopoietic Stem Cells Homing, Mobilization, Hibernation, and Differentiation Cells 2019 8 630 10.3390/cells8060630 31234505 PMC6627378 124. Cheng H. Wang M. Su J. Li Y. Long J. Chu J. Wan X. Cao Y. Li Q. Lipid Metabolism and Cancer Life 2022 12 784 10.3390/life12060784 35743814 PMC9224822 125. Zhang L. Chang N. Liu J. Liu Z. Wu Y. Sui L. Chen W. Reprogramming lipid metabolism as potential strategy for hematological malignancy therapy Front. Oncol. 2022 12 987499 10.3389/fonc.2022.987499 36106108 PMC9465383 126. Nguyen V. Zhang Y. Gao C. Cao X. Tian Y. Carver W. The Spike Protein of SARS-CoV-2 Impairs Lipid Metabolism and Increases Susceptibility to Lipotoxicity: Implication for a Role of Nrf2 Cells 2022 11 1916 35741045 10.3390/cells11121916 PMC9221434 127. Hao Y. Zhang Z. Feng G. Chen M. Wan Q. Lin J. Wu L. Nie W. Chen S. Distinct lipid metabolic dysregulation in asymptomatic COVID-19 iScience 2021 24 102974 10.1016/j.isci.2021.102974 34396083 PMC8356725 128. Munawar W.A.S.W.A. Elias M.H. Addnan F.H. Hassandarvish P. AbuBakar S. Roslan N. Gene expression profiling of host lipid metabolism in SARS-CoV-2 infected patients: A systematic review and integrated bioinformatics analysis BMC Infect. Dis. 2024 24 124 10.1186/s12879-024-08983-0 38263024 PMC10807267 129. Yang Y. Wei Z. Xiong C. Qian H. Direct mechanisms of SARS-CoV-2-induced cardiomyocyte damage: An update Virol. J. 2022 19 108 10.1186/s12985-022-01833-y 35752810 PMC9233758 130. Yonker L.M. Swank Z. Bartsch Y.C. Burns M.D. Kane A. Boribong B.P. Davis J.P. Loiselle M. Novak T. Senussi Y. Circulating Spike Protein Detected in Post-COVID-19 mRNA Vaccine Myocarditis Circulation 2023 147 867 876 10.1161/circulationaha.122.061025 36597886 PMC10010667 131. Bozkurt B. Shedding Light on Mechanisms of Myocarditis With COVID-19 mRNA Vaccines Circulation 2023 147 877 880 10.1161/circulationaha.123.063396 36794591 PMC10010664 132. Liu X. Liu Y. Rao Q. Mei Y. Xing H. Gu R. Mou J. Chen M. Ding F. Xie W. Targeting Fatty Acid Metabolism Abrogates the Differentiation Blockade in Preleukemic Cells Cancer Res. 2024 84 4233 4245 10.1158/0008-5472.can-23-3861 39264725 133. Lo Presti C. Yamaryo-Botté Y. Mondet J. Berthier S. Nutiu D. Botté C. Mossuz P. Variation in Lipid Species Profiles among Leukemic Cells Significantly Impacts Their Sensitivity to the Drug Targeting of Lipid Metabolism and the Prognosis of AML Patients Int. J. Mol. Sci. 2023 24 5988 10.3390/ijms24065988 36983080 PMC10054724 134. Raza Y. Atallah J. Luberto C. Advancements on the Multifaceted Roles of Sphingolipids in Hematological Malignancies Int. J. Mol. Sci. 2022 23 12745 10.3390/ijms232112745 36361536 PMC9654982 135. Salminen A. Role of indoleamine 2,3-dioxygenase 1 (IDO1) and kynurenine pathway in the regulation of the aging process Ageing Res. Rev. 2022 75 101573 10.1016/j.arr.2022.101573 35085834 136. Liu Y. Liang X. Yin X. Lv J. Tang K. Ma J. Ji T. Zhang H. Dong W. Jin X. Blockade of IDO-kynurenine-AhR metabolic circuitry abrogates IFN-γ-induced immunologic dormancy of tumor-repopulating cells Nat. Commun. 2017 8 15207 10.1038/ncomms15207 28488695 PMC5436221 137. Hellgren F. Rosdahl A. Cerveira R.A. Lenart K. Ols S. Gwon Y.-D. Kurt S. Delis A.M. Joas G. Evander M. Modulation of innate immune response to mRNA vaccination after SARS-CoV-2 infection or sequential vaccination in humans JCI Insight 2024 9 e175401 38716734 10.1172/jci.insight.175401 PMC11141904 138. Bergamaschi C. Terpos E. Rosati M. Angel M. Bear J. Stellas D. Karaliota S. Apostolakou F. Bagratuni T. Patseas D. Systemic IL-15, IFN-γ, and IP-10/CXCL10 signature associated with effective immune response to SARS-CoV-2 in BNT162b2 mRNA vaccine recipients Cell Rep. 2021 36 109504 10.1016/j.celrep.2021.109504 34352226 PMC8299183 139. Stone T.W. Williams R.O. Modulation of T cells by tryptophan metabolites in the kynurenine pathway Trends Pharmacol. Sci. 2023 44 442 456 10.1016/j.tips.2023.04.006 37248103 140. Basson C. Serem J.C. Hlophe Y.N. Bipath P. The tryptophan–kynurenine pathway in immunomodulation and cancer metastasis Cancer Med. 2023 12 18691 18701 10.1002/cam4.6484 37644823 PMC10557908 141. Hara T. Takuro M. Yuhei S. Nobuhiko N. Hiroshi N. Soranobu N. Junichi K. Yasuhito N. Masahito S. Hiroyasu I. Prognostic value of the combination of serum l-kynurenine level and indoleamine 2,3-dioxygenase mRNA expression in acute myeloid leukemia Leuk. Lymphoma 2016 57 2208 2211 10.3109/10428194.2015.1128541 26762931 142. Leon-Letelier R.A. Dou R. Vykoukal J. Sater A.H.A. Ostrin E. Hanash S. Fahrmann J.F. The kynurenine pathway presents multi-faceted metabolic vulnerabilities in cancer Front. Oncol. 2023 13 1256769 10.3389/fonc.2023.1256769 37876966 PMC10591110 143. Shadboorestan A. Koual M. Dairou J. Coumoul X. The role of the kynurenine/AhR pathway in diseases related to metabolism and cancer Int. J. Tryptophan Res. 2023 16 11786469231185102 37719171 10.1177/11786469231185102 PMC10503295 144. Arandi N. Ramzi M. Safaei F. Monabati A. Overexpression of indoleamine 2,3-dioxygenase correlates with regulatory T cell phenotype in acute myeloid leukemia patients with normal karyotype Blood Res. 2018 53 294 298 10.5045/br.2018.53.4.294 30588466 PMC6300669 145. Weiss-Tessbach M. Haider T. Gowran A. Schubert L. Mühlbacher J. Brankovic J. Wahrmann M. Jilma B. Boehm T. COVID-19 mRNA-1273 vaccination induced mast cell activation with strongly elevated Th(2) cytokines in a systemic mastocytosis patient Inflamm. Res. 2025 74 71 10.1007/s00011-025-02032-5 40299000 PMC12041034 146. Dehhaghi M. Heydari M. Panahi H.K.S. Lewin S.R. Heng B. Brew B.J. Guillemin G.J. The roles of the kynurenine pathway in COVID-19 neuropathogenesis Infection 2024 52 2043 2059 10.1007/s15010-024-02293-y 38802702 PMC11499433 147. Badawy A.A.B. The kynurenine pathway of tryptophan metabolism: A neglected therapeutic target of COVID-19 pathophysiology and immunotherapy Biosci. Rep. 2023 43 BSR20230595 10.1042/bsr20230595 37486805 PMC10407158 148. Guo L. Appelman B. Mooij-Kalverda K. Houtkooper R.H. van Weeghel M. Vaz F.M. Dijkhuis A. Dekker T. Smids B.S. Duitman J.W. Prolonged indoleamine 2,3-dioxygenase-2 activity and associated cellular stress in post-acute sequelae of SARS-CoV-2 infection eBioMedicine 2023 94 104729 10.1016/j.ebiom.2023.104729 37506544 PMC10406961 149. Gao X. Zhang S. Gou J. Wen Y. Fan L. Zhou J. Zhou G. Xu G. Zhang Z. Spike-mediated ACE2 down-regulation was involved in the pathogenesis of SARS-CoV-2 infection J. Infect. 2022 85 418 427 10.1016/j.jinf.2022.06.030 35793758 PMC9250808 150. Montezano A.C. Camargo L.L. Mary S. Neves K.B. Rios F.J. Stein R. Lopes R.A. Beattie W. Thomson J. Herder V. SARS-CoV-2 spike protein induces endothelial inflammation via ACE2 independently of viral replication Sci. Rep. 2023 13 14086 10.1038/s41598-023-41115-3 37640791 PMC10462711 151. Stoian I. Manolescu B. Atanasiu V. Lupescu O. Buşu C. IL-6—STAT-3—hepcidin: Linking inflammation to the iron metabolism Rom. J. Intern. Med. 2007 45 305 309 18333366 152. Wrighting D.M. Andrews N.C. Interleukin-6 induces hepcidin expression through STAT3 Blood 2006 108 3204 3209 10.1182/blood-2006-06-027631 16835372 PMC1895528 153. Rosati M. Terpos E. Homan P. Bergamaschi C. Karaliota S. Ntanasis-Stathopoulos I. Devasundaram S. Bear J. Burns R. Bagratuni T. Rapid transient and longer-lasting innate cytokine changes associated with adaptive immunity after repeated SARS-CoV-2 BNT162b2 mRNA vaccinations Front. Immunol. 2023 14 1292568 10.3389/fimmu.2023.1292568 38090597 PMC10711274 154. Xie F. Zhao M.F. Zhu H.B. Lu W.Y. Xu X.N. Xiao X. Mu J. Liu P.J. Li Y.M. Effects of oxidative stress on hematopoiesis of hematopoietic stem and progenitor cells with iron overload Zhonghua Yi Xue Za Zhi 2011 91 3284 3288 22333152 155. Meneghini R. Iron Homeostasis, Oxidative Stress, and DNA Damage Free. Radic. Biol. Med. 1997 23 783 792 10.1016/S0891-5849(97)00016-6 9296456 156. Wang F. Lv H. Zhao B. Zhou L. Wang S. Luo J. Liu J. Shang P. Iron and leukemia: New insights for future treatments J. Exp. Clin. Cancer Res. 2019 38 406 10.1186/s13046-019-1397-3 31519186 PMC6743129 157. Yahata T. Takanashi T. Muguruma Y. Ibrahim A.A. Matsuzawa H. Uno T. Sheng Y. Onizuka M. Ito M. Kato S. Accumulation of oxidative DNA damage restricts the self-renewal capacity of human hematopoietic stem cells Blood 2011 118 2941 2950 10.1182/blood-2011-01-330050 21734240 158. Nemeth E. Ganz T. Hepcidin-Ferroportin Interaction Controls Systemic Iron Homeostasis Int. J. Mol. Sci. 2021 22 6493 10.3390/ijms22126493 34204327 PMC8235187 159. Sinha S. Pereira-Reis J. Guerra A. Rivella S. Duarte D. The Role of Iron in Benign and Malignant Hematopoiesis Antioxid. Redox Signal. 2021 35 415 432 10.1089/ars.2020.8155 33231101 PMC8328043 160. Brissot E. Bernard D.G. Loréal O. Brissot P. Troadec M.-B. Too much iron: A masked foe for leukemias Blood Rev. 2020 39 100617 10.1016/j.blre.2019.100617 31753415 161. Lee S. Lee J. Cho S.-H. Roh G. Park H.-J. Lee Y.-J. Jeon H.-E. Lee Y.-S. Bae S.-H. Youn S.B. Assessing the impact of mRNA vaccination in chronic inflammatory murine model NPJ Vaccines 2024 9 34 10.1038/s41541-024-00825-z 38360752 PMC10869740 162. Liakou A.I. Tsantes A.G. Routsi E. Agiasofitou E. Kalamata M. Bompou E.-K. Tsante K.A. Vladeni S. Chatzidimitriou E. Kotsafti O. Could Vaccination against COVID-19 Trigger Immune-Mediated Inflammatory Diseases? J. Clin. Med. 2024 13 4617 10.3390/jcm13164617 39200759 PMC11355883 163. Wei L. Dong C. Zhu W. Wang B.-Z. mRNA Vaccine Nanoplatforms and Innate Immunity Viruses 2024 16 120 10.3390/v16010120 38257820 PMC10820759 164. Nemeth E. Rivera S. Gabayan V. Keller C. Taudorf S. Pedersen B.K. Ganz T. IL-6 mediates hypoferremia of inflammation by inducing the synthesis of the iron regulatory hormone hepcidin J. Clin. Investig. 2004 113 1271 1276 10.1172/JCI200420945 15124018 PMC398432 165. Rodriguez R. Jung C.L. Gabayan V. Deng J.C. Ganz T. Nemeth E. Bulut Y. Hepcidin induction by pathogens and pathogen-derived molecules is strongly dependent on interleukin-6 Infect. Immun. 2014 82 745 752 10.1128/iai.00983-13 24478088 PMC3911381 166. Cobo I. Tanaka T. Glass C.K. Yeang C. Clonal hematopoiesis driven by DNMT3A and TET2 mutations: Role in monocyte and macrophage biology and atherosclerotic cardiovascular disease Curr. Opin. Hematol. 2022 29 1 7 10.1097/MOH.0000000000000688 34654019 PMC8639635 167. Vallelonga V. Gandolfi F. Ficara F. Della Porta M.G. Ghisletti S. Emerging insights into molecular mechanisms of inflammation in myelodysplastic syndromes Biomedicines 2023 11 2613 10.3390/biomedicines11102613 37892987 PMC10603842 168. Li J. Wang C. Liu J. Yu Y. Liu Y. Peng Q. Liu H. Guan X. A feedback loop: Interactions between Inflammatory Signals and Clonal Hematopoiesis in Cardiovascular Disease Mol. Biol. Rep. 2021 48 3785 3798 10.1007/s11033-021-06370-5 33987748 PMC8117808 169. Woo J. Lu D. Lewandowski A. Xu H. Serrano P. Healey M. Yates D.P. Beste M.T. Libby P. Ridker P.M. Effects of IL-1β inhibition on anemia and clonal hematopoiesis in the randomized CANTOS trial Blood Adv. 2023 7 7471 7484 10.1182/bloodadvances.2023011578 37934948 PMC10758744 170. Ackermann M. Verleden S.E. Kuehnel M. Haverich A. Welte T. Laenger F. Vanstapel A. Werlein C. Stark H. Tzankov A. Pulmonary Vascular Endothelialitis, Thrombosis, and Angiogenesis in COVID-19 N. Engl. J. Med. 2020 383 120 128 10.1056/NEJMoa2015432 32437596 PMC7412750 171. Hong S. Chen T. Liu L. Cao C. Lv F. Rabinowitz J.D. Huang Y. Chen X. Live-cell imaging of NADPH production from specific pathways CCS Chem. 2021 3 1642 1648 10.31635/ccschem.020.202000346 172. Chandel N.S. NADPH-The Forgotten Reducing Equivalent Cold Spring Harb. Perspect. Biol. 2021 13 a040550 10.1101/cshperspect.a040550 34074675 PMC8168431 173. Chen L. Zhang Z. Hoshino A. Zheng H.D. Morley M. Arany Z. Rabinowitz J.D. NADPH production by the oxidative pentose-phosphate pathway supports folate metabolism Nat. Metab. 2019 1 404 415 10.1038/s42255-019-0043-x 31058257 PMC6489125 174. Jin E.S. Lee M.H. Murphy R.E. Malloy C.R. Pentose phosphate pathway activity parallels lipogenesis but not antioxidant processes in rat liver Am. J. Physiol.-Endocrinol. Metab. 2018 314 E543 E551 10.1152/ajpendo.00342.2017 29351478 PMC6032064 175. Chen C. Lai X. Zhang Y. Xie L. Yu Z. Dan S. Jiang Y. Chen W. Liu L. Yang Y. NADPH metabolism determines the leukemogenic capacity and drug resistance of AML cells Cell Rep. 2022 39 110607 10.1016/j.celrep.2022.110607 35385727 176. Bakker S.T. Passegué E. Resilient and resourceful: Genome maintenance strategies in hematopoietic stem cells Exp. Hematol. 2013 41 915 923 10.1016/j.exphem.2013.09.007 24067363 PMC3833969 177. Bhanot H. Weisberg E.L. Reddy M.M. Nonami A. Neuberg D. Stone R.M. Podar K. Salgia R. Griffin J.D. Sattler M. Acute myeloid leukemia cells require 6-phosphogluconate dehydrogenase for cell growth and NADPH-dependent metabolic reprogramming Oncotarget 2017 8 67639 67650 10.18632/oncotarget.18797 28978059 PMC5620199 178. Prieto-Bermejo R. Romo-González M. Pérez-Fernández A. Ijurko C. Hernández-Hernández Á. Reactive oxygen species in haematopoiesis: Leukaemic cells take a walk on the wild side J. Exp. Clin. Cancer Res. 2018 37 125 10.1186/s13046-018-0797-0 29940987 PMC6019308 179. Stanicka J. Russell E.G. Woolley J.F. Cotter T.G. NADPH oxidase-generated hydrogen peroxide induces DNA damage in mutant FLT3-expressing leukemia cells J. Biol. Chem. 2015 290 9348 9361 10.1074/jbc.M113.510495 25697362 PMC4392242 180. Weiss C.N. Ito K. DNA damage: A sensible mediator of the differentiation decision in hematopoietic stem cells and in leukemia Int. J. Mol. Sci. 2015 16 6183 6201 10.3390/ijms16036183 25789504 PMC4394526 181. Uzun S. Pant A. Bartoszek E. Gueguen P. Frei S. Heusler H. Arborelli I. Zinner C.P. Soylu N.K. Terziroli Beretta-Piccoli B. Analysis of Hyperexpanded T Cell Clones in SARS-CoV-2 Vaccine-Associated Liver Injury by Spatial Proteomics and Transcriptomics Liver Int. 2025 45 e70172 10.1111/liv.70172 40522253 PMC12169079 182. Elumalai K. Srinivasan S. Shanmugam A. Impact of COVID-19 vaccines on liver function: A state of the art and challenges for healthcare providers Gastroenterol. Endosc. 2024 2 42 51 10.1016/j.gande.2024.01.003 183. Kamm D.R. McCommis K.S. Hepatic stellate cells in physiology and pathology J. Physiol. 2022 600 1825 1837 10.1113/JP281061 35307840 PMC9012702 184. Gupta G. Khadem F. Uzonna J.E. Role of hepatic stellate cell (HSC)-derived cytokines in hepatic inflammation and immunity Cytokine 2019 124 154542 10.1016/j.cyto.2018.09.004 30241896 185. Gandhi C.R. Oxidative Stress and Hepatic Stellate Cells: A PARADOXICAL RELATIONSHIP Trends Cell Mol. Biol. 2012 7 1 10 27721591 PMC5051570 186. Yan M. Cui Y. Xiang Q. Metabolism of hepatic stellate cells in chronic liver diseases: Emerging molecular and therapeutic interventions Theranostics 2025 15 1715 1740 10.7150/thno.106597 39897543 PMC11780521 187. Ju H.-Q. Lin J.-F. Tian T. Xie D. Xu R.-H. NADPH homeostasis in cancer: Functions, mechanisms and therapeutic implications Signal Transduct. Target. Ther. 2020 5 231 10.1038/s41392-020-00326-0 33028807 PMC7542157 188. Vairetti M. Di Pasqua L.G. Cagna M. Richelmi P. Ferrigno A. Berardo C. Changes in Glutathione Content in Liver Diseases: An Update Antioxidants 2021 10 364 10.3390/antiox10030364 33670839 PMC7997318 189. Ahn W. Burnett F.N. Pandey A. Ghoshal P. Singla B. Simon A.B. Derella C.C. Addo S.A. Harris R.A. Lucas R. SARS-CoV-2 Spike Protein Stimulates Macropinocytosis in Murine and Human Macrophages via PKC-NADPH Oxidase Signaling Antioxidants 2024 13 175 10.3390/antiox13020175 38397773 PMC10885885 190. Suhail S. Zajac J. Fossum C. Lowater H. McCracken C. Severson N. Laatsch B. Narkiewicz-Jodko A. Johnson B. Liebau J. Role of Oxidative Stress on SARS-CoV (SARS) and SARS-CoV-2 (COVID-19) Infection: A Review Protein J. 2020 39 644 656 10.1007/s10930-020-09935-8 33106987 PMC7587547 191. Conceicao C. Thakur N. Human S. Kelly J.T. Logan L. Bialy D. Bhat S. Stevenson-Leggett P. Zagrajek A.K. Hollinghurst P. The SARS-CoV-2 Spike protein has a broad tropism for mammalian ACE2 proteins PLoS Biol. 2020 18 e3001016 10.1371/journal.pbio.3001016 33347434 PMC7751883 192. Kumar P. Osahon O. Vides D.B. Hanania N. Minard C.G. Sekhar R.V. Severe Glutathione Deficiency, Oxidative Stress and Oxidant Damage in Adults Hospitalized with COVID-19: Implications for GlyNAC (Glycine and N-Acetylcysteine) Supplementation Antioxidants 2022 11 50 10.3390/antiox11010050 PMC8773164 35052554 193. Youn J.Y. Zhang Y. Wu Y. Cannesson M. Cai H. Therapeutic application of estrogen for COVID-19: Attenuation of SARS-CoV-2 spike protein and IL-6 stimulated, ACE2-dependent NOX2 activation, ROS production and MCP-1 upregulation in endothelial cells Redox Biol. 2021 46 102099 10.1016/j.redox.2021.102099 34509916 PMC8372492 194. Pramono A.A. Rather G.M. Herman H. Lestari K. Bertino J.R. NAD- and NADPH-Contributing Enzymes as Therapeutic Targets in Cancer: An Overview Biomolecules 2020 10 358 10.3390/biom10030358 32111066 PMC7175141 195. Paolillo R. Boulanger M. Gâtel P. Gabellier L. De Toledo M. Tempé D. Hallal R. Akl D. Moreaux J. Baik H. The NADPH oxidase NOX2 is a marker of adverse prognosis involved in chemoresistance of acute myeloid leukemias Haematologica 2022 107 2562 2575 10.3324/haematol.2021.279889 35172562 PMC9614539 196. Reed S.C. Croessmann S. Park B.H. CHIP Happens: Clonal Hematopoiesis of Indeterminate Potential and Its Relationship to Solid Tumors Clin. Cancer Res. 2023 29 1403 1411 10.1158/1078-0432.CCR-22-2598 36454121 PMC10106364 197. Keenan C. Kartika T. Chua J. Kaner J.D. Folate Supplementation during Induction Chemotherapy for Acute Myeloid Leukemia (AML) Blood 2024 144 5958 10.1182/blood-2024-209150 198. Mokhtari V. Afsharian P. Shahhoseini M. Kalantar S.M. Moini A. A Review on Various Uses of N-Acetyl Cysteine Cell J. 2017 19 11 17 10.22074/cellj.2016.4872 28367412 PMC5241507 199. Liu M. Wang X. Wang L. Ma X. Gong Z. Zhang S. Li Y. Targeting the IDO1 pathway in cancer: From bench to bedside J. Hematol. Oncol. 2018 11 100 10.1186/s13045-018-0644-y 30068361 PMC6090955 200. Kularatne R.N. Crist R.M. Stern S.T. The Future of Tissue-Targeted Lipid Nanoparticle-Mediated Nucleic Acid Delivery Pharmaceuticals 2022 15 897 10.3390/ph15070897 35890195 PMC9322927 201. Efe C. Kulkarni A.V. Terziroli Beretta-Piccoli B. Magro B. Stättermayer A. Cengiz M. Clayton-Chubb D. Lammert C. Bernsmeier C. Gül Ö. Liver injury after SARS-CoV-2 vaccination: Features of immune-mediated hepatitis, role of corticosteroid therapy and outcome Hepatology 2022 76 1576 1586 10.1002/hep.32572 35567545 PMC9348326 202. Blank M. Israeli E. Gertel S. Amital H. Shoenfeld Y. Molecular mimicry in autoimmunity and vaccinations Autoimmunity: From Bench to Bedside [Internet] El Rosario University Press Bogotá, Colombia 2013 29087650 203. Segal Y. Shoenfeld Y. Vaccine-induced autoimmunity: The role of molecular mimicry and immune crossreaction Cell. Mol. Immunol. 2018 15 586 594 10.1038/cmi.2017.151 29503439 PMC6078966 204. Safary A. Akbarzadeh-Khiavi M. Barar J. Omidi Y. SARS-CoV-2 vaccine-triggered autoimmunity: Molecular mimicry and/or bystander activation of the immune system Bioimpacts 2023 13 269 273 10.34172/bi.2023.27494 37645029 PMC10460773 Figure 1 Proposed hepatic metabolic pathways linking mRNA vaccination to leukemogenic susceptibility. medicina-61-01687-t001_Table 1 Table 1 Testable predictions of vaccine-induced metabolic perturbations. Mechanism Testable Prediction Measurable Outcome Folate/One-Carbon Metabolism Transient folate depletion following vaccination Plasma and bone marrow tetrahydrofolate levels; lymphocyte proliferation and NK cell activity Hepatic Lipid Processing/Lipid Overload Alterations in sphingolipid and phospholipid profiles; lipid raft composition Plasma and liver metabolomics; hepatocyte lipid droplet morphology; ER stress markers Tryptophan Catabolism/IDO Activation Increased kynurenine pathway activity mediated by cytokine induction Kynurenine-to-tryptophan ratio; T-cell proliferation and effector function assays Iron Homeostasis/Hepcidin Induction Redistribution of iron between liver, macrophages, and bone marrow Serum hepcidin, ferritin, transferrin saturation; bone marrow erythropoietic activity NADPH/Redox Homeostasis Elevated NADPH consumption and transient oxidative stress NADPH/NADP+ ratio; reactive oxygen species (ROS) levels; antioxidant enzyme activity Spike Protein-Specific Effects Direct modulation of host metabolic pathways, including folate, lipid, and redox metabolism Hepatocyte or cardiomyocyte lipid accumulation; ferroptotic sensitivity; NADPH utilization Clinical Susceptibility Individuals with pre-existing metabolic or genetic vulnerabilities exhibit exaggerated responses Correlation of metabolomic changes with MTHFR polymorphisms, dyslipidemia, chronic inflammation; hematopoietic clonality Legend: The table outlines the five proposed mechanisms, their predicted effects, and measurable outcomes that can be empirically validated in clinical and experimental settings. ",
  "metadata": {
    "Title of this paper": "SARS-CoV-2 vaccine-triggered autoimmunity: Molecular mimicry and/or bystander activation of the immune system",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471691/"
  }
}