{
  "title": "Paper_798",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472947 PMC12472947.1 12472947 12472947 41011265 10.3390/ph18091398 pharmaceuticals-18-01398 1 Article Design, Synthesis, and Biological Evaluation of Novel Multitarget 7-Alcoxyamino-3-(1,2,3-triazole)-coumarins as Potent Acetylcholinesterase Inhibitors https://orcid.org/0000-0002-5948-5810 Nadur Nathalia F. 1 Ferreira Larissa de A. P. 1 Franco Daiana P. 1 de Azevedo Luciana L. 1 https://orcid.org/0000-0003-1300-5284 Caruso Lucas 1 https://orcid.org/0000-0002-3772-7225 Honório Thiago da S. 2 Furtado Priscila de S. 2 https://orcid.org/0000-0002-4673-6182 Simon Alice 2 Cabral Lucio M. 2 https://orcid.org/0000-0002-7243-5826 Werner Tobias 3 https://orcid.org/0000-0003-3336-1710 Stark Holger 3 https://orcid.org/0000-0002-8458-0975 Kümmerle Arthur E. 1 * Tonelli Michele Academic Editor 1 nathaliafn18@gmail.com larissa.apf@live.com daiana_portella@yahoo.com.br luciana-la@hotmail.com lucascaruso4@gmail.com 2 honorio_thiago@yahoo.com.br prisouzafurtado@gmail.com alicesimon.pharma@yahoo.com lmcabral@pharma.ufrj.br 3 t.werner@hhu.de stark@hhu.de * akummerle@hotmail.com 17 9 2025 9 2025 18 9 497460 1398 12 8 2025 10 9 2025 12 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background Methods 2 2 3 Results 50 1h 1j 1k 1q 1h 1k 1b 1h 1q 3 i 1b 50 1q Conclusions Alzheimer disease cholinesterase inhibitors multitarget-directed ligands click chemistry H 3 National Council for Scientific and Technological Development 314723/2021-8 Fundação de Amparo a Pesquisa do Estado do Rio de Janeiro E-26/210.134/2018 210.018/2020 E-26/210.699/2024 Coordenação de Aperfeiçoamento de Pessoal de Nível Superior—Brasil (CAPES) 001 National Council for Scientific and Technological Development (CNPq 314723/2021-8), and Fundação de Amparo a Pesquisa do Estado do Rio de Janeiro (FAPERJ no E-26/210.134/2018, 210.018/2020 and E-26/210.699/2024) for the financial support. This study was also financed in part by the Coordenação de Aperfeiçoamento de Pessoal de Nível Superior—Brasil (CAPES)—Finance Code 001. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Alzheimer’s disease (AD) is a progressive neurodegenerative disorder characterized by neuronal degeneration, gradual memory loss, cognitive impairment, and behavioral disturbances [ 1 2 1 3 4 5 6 Acetylcholinesterase (AChE) plays a crucial role in the degradation of acetylcholine (ACh), and under pathological conditions, excessive AChE activity can lead to a deficiency of this critical neurotransmitter. While conventional AChE inhibitors fail to halt the progression of AD, multitarget-directed ligands (MTDLs) can simultaneously reduce Aβ plaque formation, and fight neuroinflammation, among other effects, positively impacting disease progression [ 6 7 8 9 The active site of AChE consists of two primary regions: the catalytic active site (CAS) and the peripheral site (PAS). The CAS is located at the bottom of the cavity and contains a catalytic triad (Ser203, Glu334, and His447) [ 10 11 Coumarins represent a privileged scaffold for the design of multifunctional agents against AD due to their ability to interact with both CAS and PAS of AChE, as well as displaying a wide range of AD target modulations [ 12 13 14 15 16 3 3 17 18 19 20 In this study, we pursued a dual-site inhibition strategy targeting both the CAS and PAS of AChE, as performed by the reference drug donepezil [ 21 1 The compounds design was guided by a pharmacophore model based on a series of coumarins previously described by our research group ( Figure 1 22 2 2 Effects of conformational restrictions in these substituents were also planned with spacers of n’ = 0 or 1 for phenyl or benzyl substituents (R), respectively ( Figure 1 3 2. Results 2.1. Compounds Synthesis The synthetic pathway starts with the O 3 2 22 6a d 7a d Scheme 1 In parallel, phenyl azide ( 9 8 13a i 10a i 11a i N Scheme 2 Then, a 1,3-dipolar cycloaddition reaction catalyzed by Cu(I) (“click chemistry”) was performed between the alkynes ( 7a d 9 13a i 14a n 1a q Scheme 3 2.2. Evaluation of Anticholinesterase Activity The anticholinesterase activity of the compounds was evaluated using the Ellman method [ 23 1a g Ee 50 Eq 50 Table 1 Analysis of compounds 1a d Ee 2 22 1a 1e g 1a Ee Ee Section 2.3.2 Following the optimization of the 7-aminoalkoxy-coumarin moiety resulting in compound 1a 1h Ee 50 Eq 50 1a Ee 50 Eq 50 50 Ee Eq 1h Section 2.3.2 Evaluation of benzyl substituted derivatives 1i q 1j Ee 50 meta 1k Ee 50 para 1j Eq 50 Table 1 The Ee h 1h 1j 1q h h Table 1 Ee 2.3. Mechanism of Cholinesterase Inhibitions 2.3.1. Kinetic Studies To investigate the inhibition mechanism of AChE and BChE enzymes, compounds 1a 1h max m max m Table 2 Table S2 Figure 2 These findings indicate that the inhibitors are able to bind to both the catalytic site (competitive inhibition), as well as the allosteric site (non-competitive inhibition) in AChE and BChE. Based on these results, the competitive (K i i’ 1a 1h Table 2 Table S2 Figure 2 1j Tables S2 and S3 25 2.3.2. Molecular Docking Studies To better understand the compounds’ inhibitory effects on the enzymes, molecular docking simulations were performed for all compounds against Ee Eq 26 Ee Ee Eq Table S3 in Supplementary Material In the CAS, compounds containing a protonated piperidinyl group ( 1a d 1h q Figure 3 Figure 3 1e 1f Figure 3 In the PAS, the conformational freedom of the aromatic system linked to the coumarin nucleus significantly influences inhibitory potency. The constrained phenyl-1,2,3-triazole system in 1a Figure 4 Figure 4 3 1h Figure 4 Figure 4 Besides the better fitness of benzyl group in the PAS, additional interactions were observed in the docking results for this superior homologue series, illustrated by compound 1j Figure 5 1j 1a 1j Figure 5 Despite small differences can be observed between Ee Ee Figures S15 and S16 1j, h 1j Ee h Figure S17 For the enzyme Eq 2.4. Cytotoxicity and In Vitro Neuroprotection Assay in SH-SY5Y Neuroblastoma Cells Safety assessment is essential in the development of new bioactive compounds. Much of the failure in the process of discovering new medicines (clinical trials) would be attributed to insufficient safety profiles [ 27 Figure 6 1h 1k 1j 1q 1j 1h 1k 1q 28 29 Neurodegeneration is a key contributor to the cognitive and motor impairments observed in AD and is characterized by the progressive neuronal loss and dysfunction in the central nervous system (CNS). To investigate potential neuroprotective agents, alternative in vitro models have been developed to evaluate the efficacy of small molecules in preventing neuronal damage. One commonly used model involves neuronal cell lines exposed to exogenous oxidative stressors, such as hydrogen peroxide (H 2 2 2 2 30 In this assay, the addition of H 2 2 Figure 6 The reference drug and positive control donepezil [ 31 1h 1k, Figure 6 22 32 2.5. In Silico ADMET Physicochemical Profile Analysis In order to evaluate the drug-likeness of tested compounds, the pharmacokinetic (PK) profile of the novel 1,2,3-triazole-coumarin derivatives ( 1a r 33 34 35 Key parameters analyzed included topological polar surface area (TPSA: 59.98–85.42 Å 2 Table 3 Tables S4–S20 35 2 Table 3 Figure 6 1a 1h 1q 1i 1k Tables S11–S20 2 1f 1g 1i 1k Table 3 Figure 7 + + 36 37 Compounds 1a b 1e h 1n 38 39 40 41 42 pharmaceuticals-18-01398-t003_Table 3 Table 3 In silico predicted ADMET physicochemical profile for compounds 1a 1q Compound TPSA (Å 2 LogP a LogS b GI Absorption c BBB Permeant d  1a 73.39 3.62 −4.96 High Yes  1b 73.39 3.91 −5.19 High Yes  1c 73.39 4.24 −5.42 High Yes  1d 73.39 4.60 −5.65 High No  1e 73.39 3.87 −5.31 High Yes  1f 76.63 2.70 −4.39 High No  1g 85.42 2.50 −4.02 High No  1h 73.39 3.63 −4.93 High Yes  1i 82.62 3.64 −5.00 High No  1j 82.62 3.63 −5.00 High No  1k 82.62 3.63 −5.00 High No  1l 73.39 4.04 −5.09 High Yes  1m 73.39 4.22 −5.52 High Yes  1n 73.39 4.19 −5.52 High Yes  1o 73.39 4.30 −5.84 High Yes  1p 73.39 4.27 −5.84 High Yes  1q 73.39 3.99 −5.15 High Yes a P o/w P o/w b 43 c d 2.6. Evaluation of Compounds as MTDLs: hH 3 Our group recognized similarities between the structures of compounds described herein and pharmacophore models of H 3 44 45 Based on the ensemble of results, we decided to start with 1h 50 1j 50 1k 50 1h 1j 1k 1j We also decided to assay two other correlated compounds, 1b 1q. 3 Figure 8 The affinity constants ( K i 1b 1h 1q 3 46 K i Table 4 3 K i 1b K i 1q K i 3 47 1b 1q 3 K i Table 4 The inhibitory activity of the compounds against the MAO-A/B isoforms was evaluated using a fluorometric assay that quantifies hydrogen peroxide (H 2 2 46 1b 1h 1q 1q 50 Based on the results for cholinesterase and MAO inhibition, as well as H 3 1h 50 3 K i 1q 1h 3 K i 50 50 1b 3 K i 50 Taken together, these findings suggest that this series represents a valuable model for the development of MTDLs compounds for Alzheimer’s disease models, a concept that will be further explored in future investigations of our group. 3. Materials and Methods 3.1. Chemicals, Reagents, and Equipment All reagents and solvents were supplied by Sigma-Aldrich (Saint Louis, MO, USA). To structurally characterize the chemical compounds, nuclear magnetic resonance spectra of hydrogen ( 1 13 d 6 3 2 2 The melting points were recorded with a Fisatom model 431D fusiometer and are uncorrected. Thin-layer chromatography (TLC) with 0.25 mm thick Merk 60 F254 silica gel plates were used to follow reactions. 3.2. Synthesis of the New Compounds 3.2.1. Synthetic Procedures and Characterization Data for Trimethylsilyl Ethynyl ( 6a d In a sealed reaction tube, a mixture containing 3 mmol of 3-bromo-7-bromoalkoxycoumarin derivatives ( 5a d 2 3 2 2 5a d, 7-(2-Bromoethoxy)-3-((trimethylsilyl)ethynyl)-2 H 6a 1 3 1 13 3 7-(3-Bromopropoxy)-3-((trimethylsilyl)ethynyl)-2 H 6b 1 3 13 3 7-(4-Bromobutoxy)-3-((trimethylsilyl)ethynyl)-2 H 6c 1 3 13 3 7-((5-Bromopentyl)oxy)-3-((trimethylsilyl)ethynyl)-2 H 6d 1 3 13 3 3.2.2. Synthesis Procedure for Deprotection ( 7a d To a solution of compound 6a d 2 3 3.2.3. Synthesis Procedures for Phenyl Azide ( 9 In a reaction tube, a solution containing 5.4 mmol of arylamine ( 8 2 3 2 4 9 3.2.4. Synthetic Procedures for Benzyl Azides ( 13a i Step1: benzyl alcohols ( 11a i In a reaction tube, NaBH 4 10a i Step2: benzyl bromides ( 12a i To a solution of benzyl alcohols ( 11a i Step3: benzyl azides ( 13a i To a solution of the corresponding benzyl bromide ( 12a i 3 2 4 3.2.5. Synthetic Procedures for Triazoles ( 14a m In a 25 mL reaction tube, 1 mmol of 3-(ethenyl)-7-(bromoalkoxy)coumarin ( 7a d 9 13a i v v 4 2 w v 14a m 7-(2-Bromoethoxy)-3-(1-phenyl-1 H H 14a 1 3 13 3 7-(3-Bromopropoxy)-3-(1-phenyl-1 H H 14b 1 3 13 3 7-(4-Bromobutoxy)-3-(1-phenyl-1 H H 14c 1 3 13 3 7-((5-Bromopentyl)oxy)-3-(1-phenyl-1 H H 14d 1 3 13 3 3-(1-Benzyl-1 H H 14e 1 3 1 13 3 7-(2-Bromoethoxy)-3-(1-(2-methoxybenzyl)-1 H H 14f 1 3 13 3 7-(2-Bromoethoxy)-3-(1-(3-methoxybenzyl)-1 H H 14g 1 3 13 3 7-(2-Bromoethoxy)-3-(1-(4-methoxybenzyl)-1 H H 14h 1 3 13 3 7-(2-Bromoethoxy)-3-(1-(4-fluorobenzyl)-1 H H 14i 1 3 13 3 7-(2-Bromoethoxy)-3-(1-(3-chlorobenzyl)-1 H H 14j 1 3 13 3 7-(2-Bromoethoxy)-3-(1-(4-chlorobenzyl)-1 H H 14k 1 3 13 3 7-(2-Bromoethoxy)-3-(1-(3-bromobenzyl)-1 H H 14l 1 3 13 3 7-(2-Bromoethoxy)-3-(1-(4-bromobenzyl)-1 H H 14m 1 3 13 3 3.2.6. Synthetic Procedures for Amines ( 1a q In a borosilicate tube, 1 mmol of 3-(1-R-benzyl-1 H 14a m 15a d 2 2 v v 2 2 3-(1-Phenyl-1 H H 1a 1 3 13 3 3-(1-Phenyl-1 H H 1b 1 3 13 3 3-(1-Phenyl-1 H H 1c 1 3 13 3 3-(1-Phenyl-1 H H 1d. 1 3 13 3 7-(2-(4-Methylpiperidin-1-yl)ethoxy)-3-(1-phenyl-1 H H 1e 1 3 13 3 7-(2-(4-Methylpiperazin-1-yl)ethoxy)-3-(1-phenyl-1 H H 1f 1 3 13 3 3-(1-Phenyl-1 H H 1g 1 3 13 3 3-(1-Benzyl-1 H H 1h 1 3 13 3 3-(1-(2-Methoxybenzyl)-1 H H 1i 1 3 13 3 3-(1-(3-Methoxybenzyl)-1 H H 1j 1 3 13 3 3-(1-(4-Methoxybenzyl)-1 H H 1k 1 3 13 3 3-(1-(4-Fluorbenzyl)-1 H H 1l 1 3 13 3 3-(1-(4-Chlorobenzyl)-1 H H 1m 1 3 13 3 3-(1-(4-Chlorobenzyl)-1 H H 1n 1 3 13 3 3-(1-(3-Bromobenzyl)-1 H H 1o 1 3 13 3 3-(1-(4-Bromobenzyl)-1 H H 1p 1 3 13 3 3-(1-Benzyl-1 H H 1q 1 3 13 3 3.3. Biological In Vitro Assays 3.3.1. Anticholinesterase Activity Assays The anticholinesterase activity was determined using Ellman’s method [ 23 22 48 1a q v v v v v v 50 Figure S4 3.3.2. Enzymatic Kinetic Study The enzymatic kinetics of cholinesterase inhibition were determined according to an adapted Ellman’s method [ 23 1a 1h, 1j Table S1 3.3.3. Evaluation of H 3 HEK-293 cells (human embryonic kidney cells) stably expressing h 3 g ® 3 2 g 49 Prior to experiments, the cell membranes were thawed, homogenized by sonication at 4 °C, and kept in ice-cold binding buffer. Crude membrane extracts (20 μg/well in a final volume of 0.2 mL binding buffer) were incubated with [ 3 N Bound radioligand was separated from free radioligand by filtration through GF/B filters pretreated with 0.3% ( w v 46 3.3.4. Monoamine Oxidase A/B Inhibitory Activity The activity of human recombinant membrane-bound monoamine oxidase isoforms A and B (MAO-A/B) (Sigma-Aldrich, Gillingham, UK) in 50 mM potassium phosphate buffer (pH 7.5) was determined by measuring hydrogen peroxide production coupled to the fluorescent dye Amplex Red (Sigma-Aldrich, UK) at a final concentration of 50 μM, in the presence of horseradish peroxidase (HRP, 2.5 U/mL). This coupling reaction generates the fluorescent product resorufin, which was quantified at 30 °C using a fluorescence plate reader. Under the assay conditions, the K m IC 50 50 m 3.4. Cytotoxicity in SH-SY5Y Neuroblastoma Cell Line 3.4.1. Culture Conditions for the SH-SY5Y Neuroblastoma Cell Line The immortalized human neuroblastoma cell line (SH-SY5Y–ATCC: CRL-2226; BCRJ:0223) was used to evaluate cytotoxicity. The cell line was cultured in Dulbecco’s Modified Eagle’s Medium and F12 in a 1:1 ratio (DMEM:F12; Sigma-Aldrich code 0697, Brazil) supplemented with 10% fetal bovine serum (FBS; Sigma-Aldrich code F2442, Brazil) and 1% streptomycin/penicillin (10,000 U/mL and 10,000 μg/mL, respectively; Nova Biotecnologia code BR30110-01, Cotia, SP, Brazil) and incubated at 37 °C with 5% CO 2 2 3.4.2. Preparation of Samples for the MTT Cytotoxicity Assay For each sample under study, a stock solution in dimethyl sulfoxide (DMSO) was prepared and diluted using culture medium to concentrations of 12.5, 25 and 50 µM. The sample representing the blank/vehicle was prepared using 20 µL of pure DMSO and 1980 µL of culture medium, representing 1% DMSO. Vehicle and pure DMSO were used as negative and positive controls, respectively. 3.4.3. Cytotoxicity Assay Using the MTT Method The in vitro cytotoxicity assay evaluated cell viability using the [3-(4,5-dimethylthiazol-2yl)-2,5-diphenyl tetrazolium] bromide (MTT) reduction assay. Cells were seeded at an initial density of 5.0 × 10 4 2 Section 3.4.2 −1 TM p 3.5. In Vitro Neuroprotection Assay Against SH-SY5Y Neuroblastoma Cell Line To evaluate the neuroprotective activity of compounds 1h 1k 1j, 1q 2 2 50 51 Section 3.4.1 4 2 1h 1k 1j, 1q 2 2 Section 3.4.3 52 53 3.6. Molecular Modeling A molecular docking study was implemented with the acetylcholinesterase of the electric eel ( Electrophorus electricus Equus caballus For EeAChE, the crystallographic structure (PDB code: 1C2B, resolution: 4.5 Å) was retrieved from the Protein Data Bank [ 54 1j 55 Q9N1N9 56 Figure S14 Spartan’14 program (Wavefunction, Inc., Irvine, CA, USA) was utilized to construct and optimize the molecules in study, with the PM6 method. In the GOLD docking program, the docking functions yield the “fitness scores”, which are dimensionless values. In each case, the score values are a guide to how good the docking pose is, with a higher score indicating a better docking result. 4. Conclusions In this work, we synthesized seventeen novel 7-alkoxyamino-3-(1,2,3-triazolyl)coumarin derivatives via a straightforward Sonogashira cross-coupling reaction applied for the first time at position 3 of the coumarin nucleus, enabling the construction of 1,2,3-triazole moieties. The AChE/BChE inhibition assays revealed this series as potent and highly selective mixed-type AChE inhibitors, with IC 50 3 Finally, the activity profile for compound 1h 50 3 i 1q 3 i 50 50 1b 3 i 50 Acknowledgments The authors thank the Federal University of Rio de Janeiro (UFRJ) and Federal Rural University of Rio de Janeiro (UFRRJ), which were fundamental in the development of this work. The authors would also like to thank the remarkable Carlos Alberto Manssour Fraga for his outstanding contributions to the development of Brazilian Medicinal Chemistry. Manssour was among the best researchers in Brazil, supervising and mentoring dozens of students (including A.E.K.) and always willing to share his knowledge and enthusiasm. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ph18091398/s1 Author Contributions N.F.N., H.S. and A.E.K. were involved in the development of research hypotheses, experimental design, data acquisition, and statistical analysis. P.d.S.F., A.S., T.d.S.H. and L.M.C. were directly involved in cytotoxicity and neuroprotection evaluation. L.d.A.P.F., D.P.F., L.L.d.A., L.C. and T.W. were involved in enzyme inhibition and biological assays. All authors have read and agreed to the published version of the manuscript. Informed Consent Statement Not applicable. Data Availability Statement Data is contained within the article and Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. References 1. Knopman D.S. Amieva H. Petersen R.C. Chételat G. Holtzman D.M. Hyman B.T. Nixon R.A. Jones D.T. Alzheimer Disease Nat. Rev. Dis. Primers 2021 7 33 10.1038/s41572-021-00269-y 33986301 PMC8574196 2. Burns A. Iliffe S. Alzheimer’s Disease BMJ 2009 338 b158 10.1136/bmj.b158 19196745 3. Jellinger K.A. Alzheimer 100—Highlights in the History of Alzheimer Research J. Neural Transm. 2006 113 1603 1623 10.1007/s00702-006-0578-3 17039299 4. Citron M. Alzheimer’s Disease: Strategies for Disease Modification Nat. Rev. Drug Discov. 2010 9 387 398 10.1038/nrd2896 20431570 5. Ali N. Sayeed U. Shahid S.M.A. Akhtar S. Khan M.K.A. Molecular Mechanisms and Biomarkers in Neurodegenerative Disorders: A Comprehensive Review Mol. Biol. Rep. 2025 52 337 10.1007/s11033-025-10463-w 40138119 6. Añazco T. Werner T. Torres M.J. Hornos-Carneiro M.F. Fernández J. Zivkovic A. Salas C.O. Castro-Álvarez A. Gutiérrez M. Stark H. First in Class Pyrrolo[2,3-d]Pyrimidine Derivatives Fused to Fluorobenzylpiperidines as Dual Ligands of Acetylcholinesterase and Histamine H3 Receptor Arch. Der Pharm. 2025 358 e2400387 10.1002/ardp.202400387 40038883 7. Wang N. Qiu P. Cui W. Yan X. Zhang B. He S. Recent Advances in Multi-Target Anti-Alzheimer Disease Compounds (2013 Up to the Present) Curr. Med. Chem. 2019 26 5684 5710 10.2174/0929867326666181203124102 30501591 8. Han X. He G. Toward a Rational Design to Regulate β-Amyloid Fibrillation for Alzheimer’s Disease Treatment ACS Chem. Neurosci. 2018 9 198 210 10.1021/acschemneuro.7b00477 29251488 9. Zhang H. Wang Y. Wang Y. Li X. Wang S. Wang Z. Recent Advance on Carbamate-Based Cholinesterase Inhibitors as Potential Multifunctional Agents against Alzheimer’s Disease Eur. J. Med. Chem. 2022 240 114606 10.1016/j.ejmech.2022.114606 35858523 10. De Boer D. Nguyen N. Mao J. Moore J. Sorin E.J. A Comprehensive Review of Cholinesterase Modeling and Simulation Biomolecules 2021 11 580 10.3390/biom11040580 33920972 PMC8071298 11. Peitzika S.-C. Pontiki E. A Review on Recent Approaches on Molecular Docking Studies of Novel Compounds Targeting Acetylcholinesterase in Alzheimer Disease Molecules 2023 28 1084 10.3390/molecules28031084 36770750 PMC9921523 12. Rai S. Singh V.K. Ahmad I. Agrawal M. Singh R.K. Design, Synthesis, Molecular Docking, DFT Analysis, Dynamics Simulation and Cytotoxicity Evaluation of Coumarin Derivatives as Acetylcholinesterase (AChE) Inhibitors against Alzheimer’s Disease J. Mol. Struct. 2025 1329 141436 10.1016/j.molstruc.2025.141436 13. Pereira T.M. Franco D.P. Vitorio F. Kummerle A.E. Coumarin Compounds in Medicinal Chemistry: Some Important Examples from the Last Years Curr. Top. Med. Chem. 2018 18 124 148 10.2174/1568026618666180329115523 29595110 14. Joshi R. Coumarin Derivatives: Mechanistic Insights and Promising Applications as Potential Alzheimer’s Disease (AD) Therapeutic Agents ChemistrySelect 2023 8 e202303861 10.1002/slct.202303861 15. Xu M. Peng Y. Zhu L. Wang S. Ji J. Rakesh K.P. Triazole Derivatives as Inhibitors of Alzheimer’s Disease: Current Developments and Structure-Activity Relationships Eur. J. Med. Chem. 2019 180 656 672 10.1016/j.ejmech.2019.07.059 31352246 16. de Freitas Silva M. Tardelli Lima E. Pruccoli L. Castro N.G. Guimarães M.J.R. da Silva F.M.R. Fonseca Nadur N. de Azevedo L.L. Kümmerle A.E. Guedes I.A. Design, Synthesis and Biological Evaluation of Novel Triazole N-Acylhydrazone Hybrids for Alzheimer’s Disease Molecules 2020 25 3165 10.3390/molecules25143165 32664425 PMC7397262 17. Michalska B. Dzięgielewski M. Godyń J. Werner T. Bajda M. Karcz T. Szczepańska K. Stark H. Więckowska A. Walczyński K. 4-Oxypiperidine Ethers as Multiple Targeting Ligands at Histamine H3 Receptors and Cholinesterases ACS Chem. Neurosci. 2024 15 1206 1218 10.1021/acschemneuro.3c00800 38440987 PMC10958501 18. Singh Y.P. Tej G.N.V.C. Pandey A. Priya K. Pandey P. Shankar G. Nayak P.K. Rai G. Chittiboyina A.G. Doerksen R.J. Design, Synthesis and Biological Evaluation of Novel Naturally-Inspired Multifunctional Molecules for the Management of Alzheimer’s Disease Eur. J. Med. Chem. 2020 198 112257 10.1016/j.ejmech.2020.112257 32375073 19. Mathew B. Parambi D.G.T. Mathew G.E. Uddin M.S. Inasu S.T. Kim H. Marathakam A. Unnikrishnan M.K. Carradori S. Emerging Therapeutic Potentials of Dual-Acting MAO and AChE Inhibitors in Alzheimer’s and Parkinson’s Diseases Arch. Pharm. 2019 352 1900177 10.1002/ardp.201900177 31478569 20. Zagórska A. Jaromin A. Perspectives for New and More Efficient Multifunctional Ligands for Alzheimer′s Disease Therapy Molecules 2020 25 3337 10.3390/molecules25153337 32717806 PMC7435667 21. Silva M.A. Kiametis A.S. Treptow W. Donepezil Inhibits Acetylcholinesterase via Multiple Binding Modes at Room Temperature J. Chem. Inf. Model. 2020 60 3463 3471 10.1021/acs.jcim.9b01073 32096991 22. de Souza G.A. da Silva S.J. Del Cistia C.D.N. Pitasse-Santos P. Pires L.D.O. Passos Y.M. Cordeiro Y. Cardoso C.M. Castro R.N. Sant’Anna C.M.R. Discovery of Novel Dual-Active 3-(4-(Dimethylamino)Phenyl)-7-Aminoalcoxy-Coumarin as Potent and Selective Acetylcholinesterase Inhibitor and Antioxidant J. Enzym. Inhib. Med. Chem. 2019 34 631 637 10.1080/14756366.2019.1571270 PMC6366430 30727776 23. Ellman G.L. Courtney K.D. Andres V. Featherstone R.M. A New and Rapid Colorimetric Determination of Acetylcholinesterase Activity Biochem. Pharmacol. 1961 7 88 95 10.1016/0006-2952(61)90145-9 13726518 24. Wang N. Jia W. Wang J. Yang Z. Liu Y. Huang D. Mei X. Xiong X. Shi J. Tang Y. Design, Synthesis, and Biological Evaluation of Novel Donepezil-Tacrine Hybrids as Multi-Functional Agents with Low Neurotoxicity against Alzheimer’s Disease Bioorganic Chem. 2024 143 107010 10.1016/j.bioorg.2023.107010 38056387 25. Mauri M.C. Paletta S. Maffini M. Colasanti A. Dragogna F. Di Pace C. Altamura A.C. Clinical Pharmacology of Atypical Antipsychotics: An Update EXCLI J. 2014 13 1163 1191 26417330 PMC4464358 26. Santos S.N. de Souza G.A. Pereira T.M. Franco D.P. Cistia C.D.N.D. Sant’Anna C.M.R. Lacerda R.B. Kümmerle A.E. Regioselective Microwave Synthesis and Derivatization of 1,5-Diaryl-3-Amino-1,2,4-Triazoles and a Study of Their Cholinesterase Inhibition Properties RSC Adv. 2019 9 20356 20369 10.1039/C9RA04105B 35514684 PMC9065794 27. De Conto V. Cheung V. Maubon G. Souguir Z. Maubon N. Vandenhaute E. Bérézowski V. In Vitro Differentiation Modifies the Neurotoxic Response of SH-SY5Y Cells Toxicol. Vitr. 2021 77 105235 10.1016/j.tiv.2021.105235 34425233 28. Das J.R. Tizabi Y. Additive Protective Effects of Donepezil and Nicotine Against Salsolinol-Induced Cytotoxicity in SH-SY5Y Cells Neurotox. Res. 2009 16 194 204 10.1007/s12640-009-9040-2 19526284 29. Queda F. Calò S. Gwizdala K. Magalhães J.D. Cardoso S.M. Chaves S. Piemontese L. Santos M.A. Novel Donepezil–Arylsulfonamide Hybrids as Multitarget-Directed Ligands for Potential Treatment of Alzheimer’s Disease Molecules 2021 26 1658 10.3390/molecules26061658 33809771 PMC8002323 30. Lingappa S. Shivakumar M.S. Manivasagam T. Somasundaram S.T. Seedevi P. Neuroprotective Effect of Epalrestat on Hydrogen Peroxide-Induced Neurodegeneration in SH-SY5Y Cellular Model J. Microbiol. Biotechnol. 2021 31 867 874 10.4014/jmb.2101.01002 33820886 PMC9705952 31. Leonel Silva Sousa G. da Silva Honório T. de Souza Furtado P. Simon A. Mendes Cabral L. Rodrigues Coutinho Pereira G. Emanuel Ferreira Alves J. Mônica Vitalino de Almeida S. Rodrigues Silva V. de Souza Santos L. Design, Synthesis and Antiproliferative Evaluation of New Acridine-Thiosemicarbazone Derivatives as Topoisomerase IIα Inhibitors Results Chem. 2024 7 101371 10.1016/j.rechem.2024.101371 32. Belenichev I. Bukhtiyarova N. Ryzhenko V. Makyeyeva L. Morozova O. Oksenych V. Kamyshnyi O. Methodological Approaches to Experimental Evaluation of Neuroprotective Action of Potential Drugs Int. J. Mol. Sci. 2024 25 10475 10.3390/ijms251910475 39408802 PMC11477376 33. Daina A. Michielin O. Zoete V. SwissADME: A Free Web Tool to Evaluate Pharmacokinetics, Drug-Likeness and Medicinal Chemistry Friendliness of Small Molecules Sci. Rep. 2017 7 42717 10.1038/srep42717 28256516 PMC5335600 34. Daina A. Michielin O. Zoete V. iLOGP: A Simple, Robust, and Efficient Description of n-Octanol/Water Partition Coefficient for Drug Design Using the GB/SA Approach J. Chem. Inf. Model. 2014 54 3284 3301 10.1021/ci500467k 25382374 35. Daina A. Zoete V. A BOILED-Egg To Predict Gastrointestinal Absorption and Brain Penetration of Small Molecules ChemMedChem 2016 11 1117 1121 10.1002/cmdc.201600182 27218427 PMC5089604 36. Waghray D. Zhang Q. Inhibit or Evade Multidrug Resistance P-Glycoprotein in Cancer Treatment J. Med. Chem. 2018 61 5108 5121 10.1021/acs.jmedchem.7b01457 29251920 PMC6281405 37. Didziapetris R. Japertas P. Avdeef A. Petrauskas A. Classification Analysis of P-Glycoprotein Substrate Specificity J. Drug Target. 2003 11 391 406 10.1080/10611860310001648248 15203928 38. Lipinski C.A. Lombardo F. Dominy B.W. Feeney P.J. Experimental and Computational Approaches to Estimate Solubility and Permeability in Drug Discovery and Development Settings Adv. Drug Deliv. Rev. 2012 64 4 17 10.1016/j.addr.2012.09.019 11259830 39. Ghose A.K. Viswanadhan V.N. Wendoloski J.J. A Knowledge-Based Approach in Designing Combinatorial or Medicinal Chemistry Libraries for Drug Discovery. 1. A Qualitative and Quantitative Characterization of Known Drug Databases J. Comb. Chem. 1999 1 55 68 10.1021/cc9800071 10746014 40. Veber D.F. Johnson S.R. Cheng H.-Y. Smith B.R. Ward K.W. Kopple K.D. Molecular Properties That Influence the Oral Bioavailability of Drug Candidates J. Med. Chem. 2002 45 2615 2623 10.1021/jm020017n 12036371 41. Egan W.J. Merz K.M. Baldwin J.J. Prediction of Drug Absorption Using Multivariate Statistics J. Med. Chem. 2000 43 3867 3877 10.1021/jm000292e 11052792 42. Muegge I. Heald S.L. Brittelli D. Simple Selection Criteria for Drug-like Chemical Matter J. Med. Chem. 2001 44 1841 1846 10.1021/jm015507e 11384230 43. Delaney J.S. ESOL:  Estimating Aqueous Solubility Directly from Molecular Structure J. Chem. Inf. Comput. Sci. 2004 44 1000 1005 10.1021/ci034243x 15154768 44. Wingen K. Stark H. Scaffold Variations in Amine Warhead of Histamine H3 Receptor Antagonists Drug Discov. Today Technol. 2013 10 e483 e489 10.1016/j.ddtec.2013.07.001 24451638 45. Rullo M. Benzi A. Bianchi L. Maccagno M. Marcantoni Taddei G. Miniero D.V. Mangiatordi G.F. Lentini G. Pisani L. Petrillo G. In Vitro Evaluation of Novel Furo[3,2-c]Coumarins as Cholinesterases and Monoamine Oxidases Inhibitors Molecules 2025 30 1830 10.3390/molecules30081830 40333852 PMC12029227 46. Bautista-Aguilera Ó.M. Hagenow S. Palomino-Antolin A. Farré-Alins V. Ismaili L. Joffrin P. Jimeno M.L. Soukup O. Janočková J. Kalinowsky L. Multitarget-Directed Ligands Combining Cholinesterase and Monoamine Oxidase Inhibition with Histamine H 3 Angew. Chem. Int. Ed. 2017 56 12765 12769 10.1002/anie.201706072 28861918 47. Khanfar M.A. Reiner D. Hagenow S. Stark H. Design, Synthesis, and Biological Evaluation of Novel Oxadiazole- and Thiazole-Based Histamine H3R Ligands Bioorganic Med. Chem. 2018 26 4034 4046 10.1016/j.bmc.2018.06.028 29960729 48. Torres J.M. Lira A.F. Silva D.R. Guzzo L.M. Sant’Anna C.M.R. Kümmerle A.E. Rumjanek V.M. Structural Insights into Cholinesterases Inhibition by Harmane β-Carbolinium Derivatives: A Kinetics—Molecular Modeling Approach Phytochemistry 2012 81 24 30 10.1016/j.phytochem.2012.05.004 22717507 49. Kottke T. Sander K. Weizel L. Schneider E.H. Seifert R. Stark H. Receptor-Specific Functional Efficacies of Alkyl Imidazoles as Dual Histamine H3/H4 Receptor Ligands Eur. J. Pharmacol. 2011 654 200 208 10.1016/j.ejphar.2010.12.033 21237145 50. Feng C. Luo T. Zhang S. Liu K. Zhang Y. Luo Y. Ge P. Lycopene Protects Human SH-SY5Y Neuroblastoma Cells against Hydrogen Peroxide-Induced Death via Inhibition of Oxidative Stress and Mitochondria-Associated Apoptotic Pathways Mol. Med. Rep. 2016 13 4205 4214 10.3892/mmr.2016.5056 27035331 PMC4838073 51. Silva Sousa G.L. Nadur N.F. de Almeida Peixoto Ferreira L. da Silva Honório T. Simon A. Cabral L.M. Móra Santos M.L. Andrade B. de Lima E.V. Clarke J.R. Discovery of Novel Thiosemicarbazone-Acridine Targeting Butyrylcholinesterase with Antioxidant, Metal Complexing and Neuroprotector Abilities as Potential Treatment of Alzheimer’s Disease: In Vitro, in Vivo, and in Silico Studies Eur. J. Med. Chem. 2025 281 117030 10.1016/j.ejmech.2024.117030 39531933 52. Shidore M. Machhi J. Shingala K. Murumkar P. Sharma M.K. Agrawal N. Tripathi A. Parikh Z. Pillai P. Yadav M.R. Benzylpiperidine-Linked Diarylthiazoles as Potential Anti-Alzheimer’s Agents: Synthesis and Biological Evaluation J. Med. Chem. 2016 59 5823 5846 10.1021/acs.jmedchem.6b00426 27253679 53. Wan D. Wang F.-Q. Xie J. Chen L. Zhou X.-L. Design, Synthesis, and Biological Activity of Donepezil: Aromatic Amine Hybrids as Anti-Alzheimerss Drugs ACS Omega 2023 8 21802 21812 10.1021/acsomega.3c01427 37360465 PMC10286275 54. Bourne Y. Grassi J. Bougis P.E. Marchot P. Conformational Flexibility of the Acetylcholinesterase Tetramer Suggested by X-Ray Crystallography J. Biol. Chem. 1999 274 30370 30376 10.1074/jbc.274.43.30370 10521413 55. Cheung J. Rudolph M.J. Burshteyn F. Cassidy M.S. Gary E.N. Love J. Franklin M.C. Height J.J. Structures of Human Acetylcholinesterase in Complex with Pharmacologically Important Ligands J. Med. Chem. 2012 55 10282 10286 10.1021/jm300871x 23035744 56. Nachon F. Carletti E. Ronco C. Trovaslet M. Nicolet Y. Jean L. Renard P.-Y. Crystal Structures of Human Cholinesterases in Complex with Huprine W and Tacrine: Elements of Specificity for Anti-Alzheimer’s Drugs Targeting Acetyl- and Butyryl-Cholinesterase Biochem. J. 2013 453 393 399 10.1042/BJ20130013 23679855 Figures, Schemes and Tables Figure 1 Structural design of 3-(1,2,3-triazole)-coumarin derivatives ( 1 pharmaceuticals-18-01398-sch001_Scheme 1 Scheme 1 Synthesis of key acetylenes ( 7a d 2 n n 2 3 2 2 3 2 3 2 3 pharmaceuticals-18-01398-sch002_Scheme 2 Scheme 2 Synthesis of phenyl ( 1 13a i 2 3 4 4 3 3 2 pharmaceuticals-18-01398-sch003_Scheme 3 Scheme 3 Synthesis of designed 7-alcoxyamino-3-(1,2,3-triazole)-coumarin derivatives ( 1a q 4 2 Figure 2 Lineweaver -Burk plots of the prevention kinetics in Ee left Eq right 1a A 1h B Figure 3 ( A 1a Ee B 1a 1b 1d C 1a 1e Ee Figure 4 ( A 1a 1h Ee B 1a C 1h D 1h 1p Ee Figure 5 ( A 1h Ee B 1j Figure 6 ( A 1h 1j 1k 1q n B 1h 1j 1k 1q 2 2 2 2 p p p 2 2 Figure 7 BOILED-Egg ADME model for coumarin compounds 1a q 35 Figure 8 Compounds selected for evaluation as MTDLs. pharmaceuticals-18-01398-t001_Table 1 Table 1 Results of half maximum inhibitory concentration obtained for compounds 1a q Ee Eq       IC 50 a  Compound n X n’ R AChE b,c BChE d SI e  1a 1 -CH 2 0 Ph 50.02 ± 2.04 b 8660 ± 150 173  1b 2 -CH 2 0 Ph 1330 ± 45 b 3970 ± 94 3  1c 3 -CH 2 0 Ph 1110 ± 10 b 2410 ± 29 ~2  1d 4 -CH 2 0 Ph 4790 ± 290 b 3540 ± 81 ~1  1e 1 -CHCH 3 0 Ph 1690 ± 75 b 11,130 ± 800 ~7  1f 1 -NCH 3 0 Ph 3160 ± 76 b 8140 ± 890 3  1g 1 -NH 0 Ph 1060 ± 74 b 9840 ± 130 ~8  1h 1 -CH 2 1 Ph 6.03 ± 0.62 b c 3790 ± 400 632/33 f  1i 1 -CH 2 1 2-OCH 3 15.26 ± 0.25 b 2810 ± 230 184  1j 1 -CH 2 1 3-OCH 3 4.16 ± 0.11 b c 2880 ± 120 686/222 f  1k 1 -CH 2 1 4-OCH 3 4.58 ± 0.62 b 2080 ± 99 443  1l 1 -CH 2 1 4-F-Ph 23.41 ± 1.77 b 4120 ± 110 176  1m 1 -CH 2 1 3-Cl-Ph 13.08 ± 0.83 b 1950 ± 120 149  1n 1 -CH 2 1 4-Cl-Ph 103.8 ± 5.4 b 2240 ± 60 16  1o 1 -CH 2 1 3-Br-Ph 7.92 ± 0.48 b 2090 ± 54 265  1p 1 -CH 2 1 4-Br-Ph 12.88 ± 0.96 1140 ± 70 88  1q 2 -CH 2 1 Ph 1950 ± 86 b c 3560 ± 190 ~2 e,f  Donepezil - - - - 7.02 ± 0.24 b g 2390 ± 110 341/27 f a b c d e Eq 50 Ee 50 f Eq 50 h g 24 pharmaceuticals-18-01398-t002_Table 2 Table 2 Kinetic parameters of 1a 1h Ee Eq Conc. (μM) V max 3 K m 3 K i a K i’ b 1a 0 6.10 ± 0.09 40.38 ± 1.57   0.02 2.78 ± 0.04 70.30 ± 1.53 30.79 ± 5.38 61.59 ± 20.04 0.06 2.06 ± 0.03 102.1 ± 0.10   1a 0 13.92 ± 0.09 85.46 ± 0.83   4 11.69 ± 0.20 113.1 ± 0.8 3940 ± 230 11,400 ± 1100 8 8.24 ± 0.21 157.5 ± 1.5   1h 0 8.50 ± 0.17 72.19 ± 6.82   0.005 4.45 ± 0.02 88.07 ± 6.78 4.73 ± 0.88 7.17 ± 1.48 0.007 3.19 ± 0.010 93.73 ± 7.01   1h 0 4.51 ± 0.16 88.7 2± 7.61   2.8 3.62 ± 0.14 234.4 ± 16.2 1250 ± 150 4830 ± 620 4.8 3.40 ± 0.03 355.7 ± 19.2   Data obtained ± standard deviation (SD) or ± standard error (SE) from triplicates of independent experiments. a b pharmaceuticals-18-01398-t004_Table 4 Table 4 H 3 K i 1b 1h 1q Compound K i 3 a h 50 a h 50 a  1b 32 [25; 41] 6.4 ± 0.5 b 11.4 ± 1.9 b  1h 558 [337; 925] 5.2± 1.9 b 11.3 ± 1.9 b  1q 151 [71; 325] 31,055 [11,758; 82,018] 1688 [1164; 2449]  Pitolisant 6.5 [2.3; 18] - -  Rasagiline - - 25 ± 7 c a b c 50 ",
  "metadata": {
    "Title of this paper": "Crystal Structures of Human Cholinesterases in Complex with Huprine W and Tacrine: Elements of Specificity for Anti-Alzheimer’s Drugs Targeting Acetyl- and Butyryl-Cholinesterase",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472947/"
  }
}