{
  "title": "Paper_41",
  "abstract": "pmc BMC Infect Dis BMC Infect Dis 36 bmcid BMC Infectious Diseases 1471-2334 BMC PMC12490081 PMC12490081.1 12490081 12490081 10.1186/s12879-025-11593-z 11593 1 Research Effect of antibiotic prophylaxis after flexible cystoscopy to prevent symptomatic urinary tract infection: a randomized controlled trial Seeluangsawat Atiya 1 Sowanthip Dutsadee 1 Opanuraks Julin 2 Santingamkun Apirak 2 Ratchanon Supoj supoj.r@chula.ac.th 2 1 https://ror.org/05jd2pj53 grid.411628.8 0000 0000 9758 8584 Division of Urology, Department of Surgery, Faculty of Medicine, King Chulalongkorn Memorial Hospital, 2 https://ror.org/028wp3y58 grid.7922.e 0000 0001 0244 7875 Division of Urology, Department of Medicine, Faculty of Medicine, Chulalongkorn University, 2 10 2025 2025 25 478176 1226 22 6 2025 26 8 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Objectives Symptomatic urinary tract infection (UTI) is a common complication of flexible cystoscopy. Although the European Association of Urology (EAU) and the American Urological Association (AUA) do not recommend routine antibiotic prophylaxis for patients without risk factors, a survey revealed that over 90% of urologists at King Chulalongkorn Memorial Hospital (KCMH) and approximately 60% of Thai urologists routinely prescribe antibiotics for all cystoscopy patients, even those at low risk. This study aimed to examine the necessity of antibiotic prophylaxis following flexible cystoscopy in Thailand. Materials and methods A singlecenter, parallelgroup, randomized controlled noninferiority trial was conducted between August 2024 and January 2025 at the outpatient cystoscopy unit of KCMH, Bangkok, Thailand. A total of 284 patients without UTI risk factors were enrolled and randomly assigned to receive either cefixime or no antibiotics. UTI symptoms were assessed via telephone on day 7 postprocedure. The primary outcome was the incidence of postcystoscopy UTI symptoms, to assess noninferiority compared to those who received antibiotics. The secondary outcome was the overall prevalence of UTI following flexible cystoscopy at KCMH. Results Of the 284 enrolled patients, 265 completed the study. UTI symptoms occurred in 3.85% of the antibiotic prophylaxis group was not inferior to 5.93% of the noantibiotic group. 13 patients (4.9%) with UTI symptoms were successfully managed with oral antibiotics. Conclusions Routine antibiotic prophylaxis after flexible cystoscopy may be omitted in lowrisk patients. These findings support current EAU/AUA guidelines, which do not recommend prophylaxis for uncomplicated cystoscopy. Trial registration TCTR20250402004 on 2 April 2025 (Retrospectively registered). Keywords Cystoscope Urinary tract infection Antibiotic prophylaxis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Cystoscopy is one of the most commonly performed urological investigations. Symptoms of urinary tract infection (UTI) are a common complication following flexible cystoscopy. Cusumano et al. reported that the rates of symptomatic UTI were comparable, with a mean interval of 7.9 days (range, 1–18 days) from flexible cystoscopy to the initiation of UTI treatment [ 1 p p 2 3 4 5 6 1 Conversely, the overuse of antibiotics in lowrisk procedures contributes to the emergence of antimicrobial resistance and other adverse outcomes. Unnecessary antibiotic exposure may select for drugresistant organisms in the urinary tract and beyond. Moreover, prophylactic antibiotics carry risks of side effects and increase healthcare costs without conferring clear benefit in lowrisk cases. Despite guideline recommendations, a gap persists between guidance and clinical practice: over 90% of urologists at KCMH reportedly prescribe antibiotics for all cystoscopy patients, and approximately 60% of Thai urologists in a recent survey acknowledge routinely administering prophylaxis even in lowrisk situations. This prevailing practice pattern in Thailand reflects a longstanding clinical concern regarding postcystoscopy UTIs and suggests a lack of local data to support a more restrictive antibiotic policy. Given this background, we conducted a randomized trial at our institution to assess the necessity of antibiotic prophylaxis following flexible cystoscopy in a lowrisk population. We selected the oral thirdgeneration cephalosporin cefixime as our prophylactic agent, based on its broad activity against common uropathogens (e.g., Escherichia coli Klebsiella pneumoniae Proteus mirabilis 7 7 8 Importantly, this study aligns with the principles of antimicrobial stewardship (ABS), aiming to minimize unnecessary antibiotic exposure, reduce the risk of resistance development, and ensure that prophylaxis is used only when there is clear clinical benefit. We hypothesized that omitting antibiotic prophylaxis would not result in a significantly higher incidence of UTI symptoms after cystoscopy in lowrisk patients, thereby supporting guideline recommendations and promoting antimicrobial stewardship in our local context. Materials and methods Study design and setting This study was designed as a single-center, parallel-group, randomized controlled trial using a non-inferiority framework. The trial was conducted between August 2024 and January 2025 at the outpatient cystoscopy unit of the Department of Urology, King Chulalongkorn Memorial Hospital (KCMH) in Bangkok, Thailand. The study protocol was approved by the Institutional Review Board of the Faculty of Medicine, Chulalongkorn University (COA No. 1117/2024). Participants were informed by the physician, and written consent was obtained before flexible cystoscopy. The trial was registered with the Thai Clinical Trials Registry (TCTR20250402004) on 2 April 2025 (Retrospectively registered). Population Eligible participants were adult patients (aged ≥ 18 years) scheduled for outpatient flexible cystoscopy for various indications (e.g., hematuria evaluation, bladder tumor surveillance, or investigation of lower urinary tract symptoms) who had no identified risk factors for post-procedural UTI. Low-risk status was defined according to guideline criteria: patients had no indwelling urinary catheter or stent, no current UTI symptoms, no recent urinary tract instrumentation, no history of recurrent UTIs, no anatomic urinary tract abnormalities (e.g., stones or strictures), and were not immunocompromised. Exclusion criteria included: pregnancy; the presence of a chronic indwelling catheter; known allergy to cephalosporins; ongoing symptomatic UTI at the time of cystoscopy (such patients were treated appropriately and had the procedure deferred); the need for additional invasive procedures during cystoscopy (e.g., biopsy or fulguration, which could increase infection risk); and any other condition requiring peri-procedural antibiotics. Patients with significant comorbidities that could elevate infection risk (such as uncontrolled diabetes or chronic immunosuppression) were also excluded to ensure a truly low-risk study population. We did not perform routine urinalysis or urine culture in asymptomatic patients prior to cystoscopy. Instead, all participants were carefully interviewed regarding urinary tract infection symptoms (dysuria, turbid urine, flank pain, suprapubic pain, fever) by the physician on the day of the procedure. This approach was chosen in accordance with current EAU and AUA guidelines, which do not recommend screening or treating asymptomatic bacteriuria in low-risk patients undergoing cystoscopy. Randomization and interventions Enrolled patients were randomly assigned in a 1:1 ratio, which was concealed in sealed opaque envelopes. The antibiotic prophylaxis group received cefixime after cystoscopy for 3 days, while the no antibiotic group received no prophylaxis. The cefixime dose was 400 mg per day for patients with normal renal function, with dose adjustments made for renal impairment (a reduced dose for creatinine clearance < 50 mL/min, according to the manufacturer’s recommendations [ 7 All cystoscopies were performed under standard sterile technique. Patients underwent periurethral cleansing with an aqueous povidoneiodine solution, and sterile lubricant was used during scope insertion. A flexible cystoscope was gently introduced by an experienced urologist using local anesthetic jelly; no intravenous sedation was administered. No additional procedures (such as biopsy or stone manipulation) were performed, in order to isolate the effect of diagnostic cystoscopy alone. Following the procedure, patients were advised to maintain adequate hydration and to report any symptoms suggestive of a UTI. Outcome assessment The primary outcome was the incidence of symptomatic UTI within 7 days following cystoscopy. Symptomatic UTI was defined as the new onset of one or more of the following symptoms: dysuria, urinary frequency or urgency, suprapubic pain, fever (temperature > 38 °C), or chills, in combination with a physician’s diagnosis of UTI (typically confirmed by a positive urine culture when available). As part of the study protocol, patients were proactively contacted via telephone on post-procedure day 7 by a study nurse who was blinded to group assignment. During this follow-up call, a standardized questionnaire was administered to assess any UTI-related symptoms or other complications. If a patient reported symptoms suggestive of UTI, they were instructed to return for further evaluation. Secondary outcomes included the overall prevalence of post-cystoscopy UTI in the entire cohort (regardless of prophylaxis) and the occurrence of any procedure-related complications (e.g., significant hematuria requiring intervention, urinary retention, or urosepsis). In addition, basic patient demographic and clinical characteristics, as well as procedural details, were recorded to assess for any baseline imbalances between the two groups. Statistical analysis The trial was designed as a non-inferiority study. A baseline post-cystoscopy UTI rate of approximately 5% in low-risk patients was assumed based on previous reports and pilot data. The non-inferiority margin was set at 4.9%, derived from predictions of a previously fitted model at fixed values. Thus, the omission of antibiotics would be considered non-inferior if the absolute increase in UTI incidence was less than 4.9%. This threshold represents a doubling of the expected infection rate (from ~ 5% to ~ 10%) and was deemed the largest clinically acceptable difference that would still justify avoiding prophylactic A total of 284 patients (142 per arm) was calculated using the formula for comparing two proportions in a non-inferiority study. The primary outcome (proportion of patients with UTI symptoms) was calculated for each group with 95% confidence intervals (CIs). The between-group risk difference, along with its two-sided 95% CI, was determined. Non-inferiority was concluded if the upper bound of the 95% CI for the difference in UTI rates (No Antibiotic minus Antibiotic group) was less than 4.9%. The relative risk (RR) of UTI for the no-prophylaxis group compared to the prophylaxis group was also calculated. For descriptive comparisons, the chi-square test (or Fisher’s exact test, where appropriate) was used to assess differences in proportions, and Student’s t p Results Patient characteristics Of the 284 randomized patients, 265 completed the study per protocol and were included in the analysis. Nineteen patients were lost to follow-up or excluded due to protocol deviations, with losses relatively balanced between the groups. The antibiotic prophylaxis group included 130 patients, while the no-antibiotic group included 135 patients (Fig. 1  Fig. 1 Flow diagram for patient enrollment Baseline characteristics were similar between the two groups. The mean age was 55.8 ± 15.0 years in the prophylaxis group and 57.1 ± 14.0 years in the no-prophylaxis group ( p Common indications for cystoscopy included hematuria evaluation (approximately 45% of cases), bladder cancer surveillance (about 20%), and investigation of lower urinary tract symptoms (around 15%), with no significant differences in the distribution of indications between the two arms. These findings confirm that the randomized groups were well-matched, allowing for attribution of any differences in outcomes to the prophylaxis intervention (Table 1  Table 1 Patient characteristics and post-cystoscopy outcomes in the antibiotic vs. No antibiotic groups Characteristics Antibiotic prophylaxis N No Antibiotic prophylaxis N 95% CI Pvalue Sex −2.70–3.5 0.8 Male 85 95 Female 45 40 Age Median (SD) 68.5 (12.31) 68.1 (13.29) Min 22 22 Max 92 92 Indication Bladder cancer 47 (17.74) 53 (20) 0.6 UTUC 8 (3.02) 10 (3.77) 0.7 Hematuria 36 (13.58) 33 (12.45) 0.55 Obstructive voiding symptoms 26 (9.81) 28 (10.57) 0.88 Bladder stone 0 (0) 1 (0.38) 0.33 Recurrent UTI 5 (1.89) 2 (0.75) 0.23 No significant differences were observed in baseline characteristics or minor complications between the groups LUTS n.s UTI Primary outcome – UTI incidence In total, 13 out of 265 patients (4.9%) developed symptomatic UTI within 7 days following cystoscopy. A total of 13 patients reported symptoms consistent with urinary tract infection. Of these, two indicated that they had undergone urinalysis at other hospitals, which demonstrated abnormal findings; however, the specific bacterial species from urine culture were not available. As expected for a low-risk outpatient population, all infections were mild, afebrile lower UTIs (i.e., cystitis presentations); no cases of febrile UTI or urosepsis occurred in either group. In the prophylaxis (cefixime) group, 5 of 130 patients (3.85%) experienced UTI symptoms post-procedure. In the no-prophylaxis group, 8 of 135 patients (5.93%) developed a UTI after cystoscopy. The absolute difference in infection rates was 2.08% (5.93% vs. 3.85%), which was not statistically significant ( p Importantly, the upper bound of the 95% confidence interval for the difference in UTI rates was + 4.1%, which falls below the predefined non-inferiority margin of 4.9%. Therefore, the criterion for non-inferiority was met: withholding prophylactic antibiotics did not result in an unacceptably higher rate of UTI in low-risk patients. In the subgroup of patients with obstructive voiding symptoms, the rate of symptomatic UTI was non-inferior to that of patients without obstructive symptoms, as shown in Fig. 2 p  Fig. 2 Logistic regression analysis showing the 95% confidence interval with the non-inferiority margin, described by the risk ratio, adjusted for covariates In practical terms, the number needed to treat (NNT) with antibiotics to prevent one UTI in this population would be approximately 48–50. Table 2 Table 2. Comparison of UTI outcomes – antibiotic vs. no antibiotic prophylaxis Variable Odds Ratio (OR) 95% CI of OR Risk Ratio (RR) 95% CI of RR p No Antibiotic prophylaxis (Reference: Antibiotic) 1.57 0.5–4.9 1.54 0.52–4.59 0.437 Margin = 4.9% – – – – – Secondary outcomes The overall prevalence of post-cystoscopy UTI at our institution, combining both study arms, was 4.9%, consistent with the low rates reported in the literature for low-risk patients [16, 2]. No cases of severe complications—such as urosepsis or hospitalization for UTI—occurred in either group. Discussion This randomized trial demonstrated that routine antibiotic prophylaxis after flexible cystoscopy offered no significant benefit in low-risk patients. The UTI incidence was low in both groups (3.85% with prophylaxis vs. 5.93% without; 4.9% overall), with the difference falling within the non-inferiority margin. These findings support omitting antibiotics in uncomplicated cases, in line with current EAU and AUA guidelines. Although Johnson et al. concluded that one dose of oral ciprofloxacin significantly reduces bacteriuria after flexible cystoscopy [ 9 1 10 11 12 This study adds contemporary data from Thailand using cefixime, not fluoroquinolones. Even with this alternative, prophylaxis did not significantly affect outcomes. When baseline UTI rates are only 1–5%, routine prophylaxis lacks justification. Cefixime was chosen for its broad uropathogen coverage and to avoid fluoroquinolone resistance. It was well-tolerated and effective in our cohort, with no resistant organisms in the prophylaxis arm. Studies like Samarinas et al [ 8 Consistent with our findings, conference reports have also noted that post-cystoscopy urinary tract infections are uncommon events. When they do occur, they are frequently associated with resistant organisms, particularly in patients with prior fluoroquinolone exposure (Kang et al. 2015) [ 13 Strengths and limitations Strengths of this study include its randomized design, non-inferiority framework, and the inclusion of a strictly low-risk cohort aligned with current guidelines. The trial provides relevant evidence for settings such as ours, where prophylaxis is commonly overused; however, its generalizability to other settings or to high-risk patients may be limited. Limitations of this study include its single-center design and moderate sample size, which may not have been sufficient to detect rare adverse events. The trial was registered retrospectively; however, no protocol changes occurred after data collection. The primary outcome was based on symptom reporting via 7-day telephone follow-up, which relied on self-reported symptoms and may overestimate UTI. In addition, not all symptomatic cases underwent urine culture, limiting microbiological confirmation and potentially introducing bias. Asymptomatic bacteriuria may have been missed; however, as noted in the IDSA 2019 update by Nicolle et al., asymptomatic bacteriuria should be screened for and treated only in pregnant women or in individuals prior to undergoing invasive urologic procedures [ 14 Clinical implications Routine prophylaxis can be safely omitted in low-risk patients. Institutions should adopt protocols to screen for high-risk features and reserve antibiotics accordingly. At our center, these findings are already informing updated guidelines. Following a risk-based, evidence-aligned protocol—similar to Gregg et al. [ 10 Conclusions This randomized trial shows that in low-risk patients undergoing flexible cystoscopy, omission of antibiotic prophylaxis—specifically, cefixime—does not increase the incidence of post-procedural symptomatic UTIs. The UTI rate remained low (~ 4–6%) in both groups, with no statistically or clinically significant difference. These results support current EAU and AUA guidelines, which advise against routine prophylaxis for uncomplicated cystoscopy. Avoiding unnecessary antibiotics reduces patient exposure to side effects, lowers healthcare costs, and helps curb the rise of antimicrobial resistance. While targeted prophylaxis may still be appropriate for high-risk patients or more invasive procedures, routine antibiotic use for all cystoscopy cases is unwarranted. Our findings add regionally relevant evidence from Thailand, confirming that a no-prophylaxis approach is safe and effective in line with international practice. We encourage urologists to adopt an individualized, risk-based strategy and to align with antimicrobial stewardship principles to preserve antibiotic effectiveness for the future. Abbreviations UTI Urinary Tract Infection EAU European Association of Urology AUA American Urological Association KCMH King Chulalongkorn Memorial Hospital RCT Randomized Controlled Trial IRB Institutional Review Board Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Authors’ contributions A.S. and S.R. wrote the main manuscript text. A.P. and J.O. reviewed the manuscript. D.S. performed the literature review. All authors read and approved the final manuscript. Funding This research received no specific grant from any funding agency in the public, commercial, or not-for-profit sectors. Data availability Available upon reasonable request. Declarations Ethics approval and consent to participate The Institutional Review Board of the Faculty of Medicine, Chulalongkorn University, Bangkok,Thailand, has approved this study in compliance with the International guidelines for human research protection as Declaration of Helsinki, The Belmont Report, CIOMS Guideline and International Conference on Harmonization in Good Clinical Practice (ICH-GCP). Written informed consent to participate was obtained from all individual participants included in the study. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Cusumano JA Hermenau M Gaitanis MM Travis MJ LaPlante KL Tran T McConeghy KW Evaluation of post–flexible cystoscopy urinary tract infection rates and the impact of prophylactic antimicrobial use Am J Health Syst Pharm 2020 77 24 2031 7 10.1093/ajhp/zxaa270 32827037 Cusumano JA, Hermenau M, Gaitanis MM, Travis MJ, LaPlante KL, Tran T, McConeghy KW. Evaluation of post–flexible cystoscopy urinary tract infection rates and the impact of prophylactic antimicrobial use. Am J Health Syst Pharm. 2020;77(24):2031–7. 10.1093/ajhp/zxaa270. 10.1093/ajhp/zxaa270 32827037 2. Jiménez Cruz JF Sanz Chinesta S Otero G Díaz González R Alvarez Ruiz F Flores N Virseda J Rioja LA Zuluaga A Tallada M Profilaxis antimicrobiana En uretrocistoscopias. Estudio comparativo [Antimicrobial prophylaxis in urethrocystoscopy. Comparative study] (in Spanish) Actas Urol Esp 1993 17 3 172 5 8506770 Jiménez Cruz JF, Sanz Chinesta S, Otero G, Díaz González R, Alvarez Ruiz F, Flores N, Virseda J, Rioja LA, Zuluaga A, Tallada M, et al. Profilaxis antimicrobiana En uretrocistoscopias. Estudio comparativo [Antimicrobial prophylaxis in urethrocystoscopy. Comparative study] (in Spanish). Actas Urol Esp. 1993;17(3):172–5. PMID: 8506770. 8506770 3. Cam K Kayikci A Erol A Prospective evaluation of the efficacy of antibiotic prophylaxis before cystoscopy Indian J Urol 2009 25 2 203 6 10.4103/0970-1591.52914 19672347 PMC2710065 Cam K, Kayikci A, Erol A. Prospective evaluation of the efficacy of antibiotic prophylaxis before cystoscopy. Indian J Urol. 2009;25(2):203–6. 10.4103/0970-1591.52914. PMID:19672347; PMCID:PMC2710065. 19672347 10.4103/0970-1591.52914 PMC2710065 4. European Association of Urology EAU guidelines on urological infections: limited update March 2025 2025 Arnhem (NL) European Association of Urology 63 European Association of Urology. EAU Guidelines on Urological Infections: Limited Update March 2025 5. Lightner DJ Wymer K Sanchez J Kavoussi L Best practice statement on urologic procedures and antimicrobial prophylaxis J Urol 2020 203 2 351 6 10.1097/JU.0000000000000509 31441676 Lightner DJ, Wymer K, Sanchez J, Kavoussi L, et al. Best practice statement on urologic procedures and antimicrobial prophylaxis. J Urol. 2020;203(2):351–6. 31441676 10.1097/JU.0000000000000509 6. Chung DY Lee JY Recommendations for antibacterial prophylaxis in endourological procedures Urogenit Tract Infect 2019 14 1 1 8 10.14777/uti.2019.14.1.1 Chung DY, Lee JY. Recommendations for antibacterial prophylaxis in endourological procedures. Urogenit Tract Infect. 2019;14(1):1–8. 10.14777/uti.2019.14.1.1. 7. Medscape Drug Reference. Cefixime (Suprax) – Indications and Dosage. (Accessed 2025) – Cefixime is indicated for uncomplicated UTIs caused by susceptible E. coli and P. mirabilis; usual adult dose 400 mg daily. 8. Samarinas M Skriapas K Mitsogiannis I Cefixime versus Prulifloxacin as a prophylactic treatment for prostate biopsy: a randomized study Cent Eur J Urol 2020 73 4 544 50 10.5173/ceju.2020.0072 PMC7848831 33552582 Samarinas M, Skriapas K, Mitsogiannis I, et al. Cefixime versus Prulifloxacin as a prophylactic treatment for prostate biopsy: a randomized study. Cent Eur J Urol. 2020;73(4):544–50. 10.5173/ceju.2020.0072. 10.5173/ceju.2020.0072 PMC7848831 33552582 9. Johnson MI Merrilees D Robson WA Lennon T Masters J Orr KE Oral Ciprofloxacin or Trimethoprim reduces bacteriuria after flexible cystoscopy BJU Int 2007 100 4 826 9 10.1111/j.1464-410X.2007.07093.x 17822463 Johnson MI, Merrilees D, Robson WA, Lennon T, Masters J, Orr KE, et al. Oral Ciprofloxacin or Trimethoprim reduces bacteriuria after flexible cystoscopy. BJU Int. 2007;100(4):826–9. 10.1111/j.1464-410X.2007.07093.x. 17822463 10.1111/j.1464-410X.2007.07093.x 10. Gregg JR Bhalla RG Cook JP An evidence-based protocol for antibiotic use prior to cystoscopy decreases antibiotic use without impacting post-procedural symptomatic urinary tract infection rates J Urol 2018 199 4 1004 10 10.1016/j.juro.2017.10.038 29108916 Gregg JR, Bhalla RG, Cook JP, et al. An evidence-based protocol for antibiotic use prior to cystoscopy decreases antibiotic use without impacting post-procedural symptomatic urinary tract infection rates. J Urol. 2018;199(4):1004–10. 10.1016/j.juro.2017.10.038. 29108916 10.1016/j.juro.2017.10.038 11. Bai Y, Wang X, Yang C, Sun Y, Xu C. Antimicrobial agents for preventing urinary tract infections in adults undergoing cystoscopy. Cochrane Database Syst Rev. 2019;2CD012305. 10.1002/14651858.CD012305.pub2. 10.1002/14651858.CD012305.pub2 PMC6383548 30789676 12. Carey MM Zreik A Fenn NJ Chlosta PL Aboumarzouk OM Should we use antibiotic prophylaxis for flexible cystoscopy? A systematic review and meta-analysis Urol Int 2015 95 3 249 59 10.1159/000381882 26138144 Carey MM, Zreik A, Fenn NJ, Chlosta PL, Aboumarzouk OM. Should we use antibiotic prophylaxis for flexible cystoscopy? A systematic review and meta-analysis. Urol Int. 2015;95(3):249–59. 10.1159/000381882. 26138144 10.1159/000381882 13. Kang CL, Barocas DA, Post-cystoscopy urinary tract infection uncommon (News Report). Urology Times., Summarizing et al. AUA conference findings on risk factors and resistant pathogens in post-cystoscopy UTI.). 14. Nicolle LE Gupta K Bradley SF Clinical practice guideline for the management of asymptomatic bacteriuria: 2019 update by the infectious diseases society of America Clin Infect Dis 2019 68 10 e83 110 10.1093/cid/ciy1121 30895288 Nicolle LE, Gupta K, Bradley SF, et al. Clinical practice guideline for the management of asymptomatic bacteriuria: 2019 update by the infectious diseases society of America. Clin Infect Dis. 2019;68(10):e83–110. 10.1093/cid/ciy1121. 30895288 10.1093/cid/ciy1121 ",
  "metadata": {
    "Title of this paper": "Clinical practice guideline for the management of asymptomatic bacteriuria: 2019 update by the infectious diseases society of America",
    "Journal it was published in:": "BMC Infectious Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490081/"
  }
}