{
  "title": "Paper_932",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471064 PMC12471064.1 12471064 12471064 41009778 10.3390/ijms26189216 ijms-26-09216 1 Review Potential of Orally Administered Quercetin, Hesperidin, and p https://orcid.org/0000-0003-0514-8584 Takata Takanobu 1 2 * † Moriya Junji 3 4 https://orcid.org/0000-0002-0331-3753 Miyazawa Katsuhito 5 * † https://orcid.org/0000-0003-2662-0024 Yamada Sohsuke 6 7 https://orcid.org/0000-0003-0108-996X Han Jia 6 7 https://orcid.org/0000-0002-0250-7556 Yang Qian 8 9 Guo Xin 9 10 Nakahashi Takeshi 3 4 https://orcid.org/0000-0001-6690-5409 Mizuta Shuichi 3 https://orcid.org/0000-0001-8639-6955 Inoue Shinya 5 11 https://orcid.org/0009-0000-5897-8800 Masauji Togen 2 Motoo Yoshiharu 12 Borthakur Alip Academic Editor 1 2 masauji@kanazawa-med.ac.jp 3 moriya@kanazawa-med.ac.jp tkn@kanazawa-med.ac.jp smizuta@kanazawa-med.ac.jp 4 5 s-inoue@inoueiin-kusatsu.or.jp 6 sohsuke@kanazawa-med.ac.jp hanj227@kanazawa-med.ac.jp 7 8 yang0311qian@126.com 9 tianqi11211216@163.com 10 11 12 motoo.yoshiharu9082@fukui.saiseikai.or.jp * takajjjj@kanazawa-med.ac.jp miyazawa@kanazawa-med.ac.jp † These authors contributed equally to this work. 21 9 2025 9 2025 26 18 497349 9216 07 8 2025 14 9 2025 19 9 2025 21 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Advanced glycation end-products (AGEs) are associated with the dysfunction of proximal tubular epithelial (PTE) cells in lifestyle diseases. Urinary stones induce cytotoxicity in PTE cells, and various medicines have been developed to mitigate or prevent their generation/accumulation. The leaves of Quercus salicina Q. stenophylla p p p p p p Q. salicina Q. stenophylla advanced glycation end-product proximal tubular epithelial cell traditional Japanese medicine Quercus salicina Quercus stenophylla quercetin hesperidin p metabolism Japan Society for the Promotion of Science (JSPS) KAKENHI JP24K14802 This work was supported by Japan Society for the Promotion of Science (JSPS) KAKENHI [grant number JP24K14802 (T.T.)]. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Proximal tubular epithelial (PTE) cells in the kidney regulate the reabsorption of minerals, glucose, amino acids, and raw urine, and regulate the volume of urine [ 1 2 3 1 2 3 4 5 6 3 6 7 8 9 8 9 10 11 12 N ε 7 6 13 14 15 16 17 18 19 20 8 9 10 11 12 13 15 17 19 21 22 23 24 25 26 27 28 13 14 15 16 17 Although various medicines have been developed for urinary stone adhesion and inflammation [ 6 Quercus salicina Q. stenophylla 29 30 31 32 29 30 31 32 33 34 35 Q. salicina Q. stenophylla 29 29 Q. salicina Q. stenophylla p p 29 30 31 32 36 37 38 39 40 41 p 12 21 22 23 p Section 5.6 Section 5.7 29 30 31 32 p 42 43 44 45 46 47 48 12 p 40 11 12 Q. salicina Q. stenophylla 2. Urinary Stone/Inflammation in PTE Cells and Roles of Q. salicina Q. stenophylla 2.1. Cytotoxicity in PTE Cells The kidney is the major organ for reabsorbing various essential materials such as minerals, glucose, amino acids, and peptides through the PTE cells [ 1 2 3 4 5 Figure 1 3 4 5 6 49 50 51 52 4 5 6 3 53 54 55 Section 4 6 2.2. Medicines Against Urinary Stones Among the modern European medicines developed from the 18th century, tamsulosin (Astellas Pharma Inc., Tokyo, Japan) [ 56 57 58 59 60 61 62 Q. salicina Q. stenophylla 29 30 31 63 Section 5.1 64 65 Q. salicina Q. stenophylla 3. Intra-/Extracellular AGEs 3.1. Origins of AGEs Protein glycation occurs commonly in vivo and in vitro [ 66 67 68 6 7 8 9 66 67 68 Figure 2 6 9 11 12 6 69 70 71 72 73 6 12 6 12 3.2. Structure and Category of AGEs 3.2.1. Structure of Free AGEs AGEs are generated from saccharides and their metabolites/non-enzymatic products and proteins, and they react and combine with proteins through non-enzymatic reactions [ 6 9 11 12 N ε 6 9 10 11 12 Figure 3 6 9 10 11 12 74 75 76 Section 3.2.2 3.2.2. Classic and Novel AGEs Studies on AGE catalyzation since the mid-20th century have identified glucose-derived (Glc-AGEs, AGE-1), GA-derived (AGE-2), glycolaldehyde-derived (Glycol-AGEs, AGE-3), methylglyoxal-derived (MGO-AGEs, AGE-4), glyoxal-derived (GO-AGEs, AGE-5), and 3-deoxyglucosone-derived AGEs (3DG-AGEs, AGE-6) [ 9 11 12 77 78 78 11 12 79 80 81 76 82 83 6 84 Figure 3 6 76 82 83 84 3.2.3. Crude AGE Pattern Various AGE structures may be generated from one source compound [ 85 6 11 12 85 Figure 4 6 3.2.4. Diverse AGE Patterns Amino acid residues such as lysine and arginine are targets of non-enzymatic glycation, and proteins can be modified by various free types of AGEs in vitro and in vivo [ 86 87 11 12 Figure 5 11 12 88 Figure 5 11 12 87 88 Figure 5 3.2.5. Multiple AGE Patterns Based on the type 1 and 2 diverse AGE patterns, we proposed type 1 and 2 multiple AGE patterns, as these phenomena have not yet been named or categorized in the field of AGE research ( Figure 6 11 12 87 88 6 11 12 87 88 Figure 6 Figure 6 3.3. Intracellular AGEs Various organs such as the heart, liver, pancreas, and proximal tubule express intracellular AGEs, with crude, diverse, and multiple AGE patterns [ 11 12 12 9 12 80 81 3.4. Extracellular AGEs 3.4.1. AGEs in the Blood, Saliva, and Urine from Various Organs Once intracellular AGEs are generated in various organs, they can disperse and be secreted into the blood, saliva, and urine [ 9 11 12 9 11 12 78 89 3.4.2. AGEs in Extracellular Matrix AGEs such as pentosidine can exist in the extracellular matrix [ 11 12 88 3.4.3. Dietary AGEs AGEs such as CML, CEL, and MG-H1 are produced in various foods and beverages, and can be consumed by humans [ 9 11 12 88 3.5. Identification and Quantification of AGEs The identification and quantification of AGEs are generally performed through fluorescence microscopy [ 10 11 12 10 11 12 25 10 11 12 25 88 90 10 11 12 91 10 11 12 90 11 12 77 10 11 12 10 11 12 25 90 10 88 92 10 25 88 90 10 25 90 10 11 12 89 10 12 77 78 Figure 5 Figure 6 6 11 12 88 4. Cytotoxicity of Intra-/Extracellular AGEs in PTE Cells 4.1. Cytotoxicity of Intracellular AGEs in PTE Cells Takahashi et al. [ 7 7 9 11 12 6 6 Figure 4 Figure 5 Figure 6 4.2. Cytotoxicity of Extracellular AGEs in PTE Cells RAGE [ 13 14 15 16 17 18 93 17 18 9 13 14 15 16 14 14 9 4 5 94 5. Potential of Quercetin, Hesperidin, and p 5.1. Q. salicina/Q. stenophylla Leaf Extract Modern European and traditional medicines are commonly used in Japan. Traditional Japanese medical science often adopts Kampo [ 32 33 34 95 96 29 30 31 97 33 34 95 96 98 99 32 33 34 95 96 99 100 101 102 Figure 7 29 30 31 Q. salicina Q. stenophylla Q. salicina/Q. stenophylla Q. salicina Q. stenophylla 29 30 31 5.2. Limited Data on the Effects of Q. salicina/Q. stenophylla Leaf Extract Components We focused on the possibility that medicines selected to prevent and treat urinary stones may also suppress intra-/extracellular AGE-induced cytotoxicity in PTE cells. However, no study has assessed the inhibitory effects of modern European medicines such as tamsulosin [ 56 57 58 59 60 61 62 29 64 65 56 57 58 59 60 61 62 Q. salicina Q. stenophylla Q. salicina Q. stenophylla 5.3. Quercetin, Hesperidin, and p-Coumaric Acid Quercetin, hesperidin, and p Q. salicina Q. stenophylla Figure 8 6 29 30 31 32 103 104 104 105 106 107 p 108 109 12 110 111 O p m 32 p 32 5.4. Suppression of Intracellular AGE Generation by Quercetin, Hesperidin, and p-Coumaric Acid in Cells Other than PTE Cells Various studies have investigated the effects of low-molecular-weight plant compounds in suppressing intracellular AGE accumulation [ 112 p 6 12 21 22 23 24 25 26 6 12 36 37 6 12 6 12 p 110 111 113 114 5.5. Inhibition of Extracellular AGE-RAGE/TLR4 Cell Signaling by Quercetin, Hesperidin, and p-Coumaric Acid in Cells Other than PTE Cells To suppress cytotoxicity-related inflammation, various studies have investigated the effects of low-molecular-weight plant compounds on AGE-RAGE/TLR4 cell signaling [ 9 12 38 115 116 117 118 119 120 121 122 39 123 124 125 p 40 126 p 41 127 p 5.6. The Issue of Whether Quercetin, Hesperidin, and p-Coumaric Acid Can Affect PTE Cells There are no reports that orally administered quercetin, hesperidin, or p 6 12 13 14 15 16 p p p 9 5.7. Transportation Potential of Non-Metabolites and/or Metabolites of Quercetin, Hesperidin, and p-Coumaric Acid into PTE Cells 5.7.1. Absorption and Metabolization of Quercetin A microbalance of quercetin has been detected in human blood [ 128 129 130 131 O O O O O O O O O Figure 9 129 130 131 Figure 10 132 133 134 Figure 10 134 135 136 Figure 10 136 O O 136 137 138 Figure 11 139 140 141 142 Figure 11 143 144 145 146 147 143 144 145 146 147 O O O O Figure 12 5.7.2. Absorption and Metabolization of Hesperidin Hesperidin has never been recorded in the blood of humans, rats, or mice, suggesting that it cannot escape metabolism. Although hesperidin cannot be hydrolyzed by α-glucosidase in the small/large intestine, it can be hydrolyzed to hesperetin by bacterial β-glucosidase and absorbed into the small/large intestine ( Figure 13 148 149 150 Figure 13 151 152 152 O O O O Figure 14 151 152 153 154 155 5.7.3. Absorption and Metabolization of p P 156 157 p p p p Figure 15 158 159 p p 5.7.4. Transportation of Non-Metabolites or Metabolites of Quercetin, Hesperidin, and p This study focused on the capacity of quercetin, hesperidin, p p 129 156 157 Figure 10 Figure 11 Figure 10 Figure 11 Figure 12 Figure 13 Figure 14 p 156 157 p p 5.7.5. Potential for Suppressing Intra-/Extracellular AGE-Induced Cytotoxicity by Non-Metabolites/Metabolites of Quercetin, Hesperidin, p Based on Section 5.4 Section 5.5 p p 21 22 23 24 25 26 27 28 156 157 p Figure 8 Figure 9 Figure 10 Figure 11 Figure 12 Figure 13 Figure 14 12 p p Figure 15 160 161 6. Limitations The complete composition of Q. salicina Q. stenophylla p p 162 7. Conclusions This study indicated that orally administered quercetin, hesperidin, and p p p p Q. salicina Q. stenophylla 8. Future Directions To advance the field, future in vitro and in vivo studies should consider how and to what extent quercetin, hesperidin, p Q. salicina Q. stenophylla Q. salicina Q. stenophylla Acknowledgments The research and reference checking were performed by Sumie Saito from the Department of Urology at Kanazawa Medical University (Uchinada, Japan). Disclaimer/Publisher’s Note: Author Contributions Conceptualization, T.T., J.M., K.M. and Y.M.; methodology, T.T., J.M., K.M., S.Y., J.H., Q.Y., X.G., T.N., S.M., S.I., T.M. and Y.M.; writing—original draft preparation, T.T., J.M., K.M., S.Y., J.H., Q.Y., X.G., T.N., S.M., S.I., T.M. and Y.M. Writing—review and editing, T.T., J.M., K.M., S.Y., J.H., Q.Y., X.G., T.N., S.M., S.I., T.M. and Y.M. Visualization for Figure 7 Figure 7 Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The data presented in this study are available in the article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AGE Advanced glycation end-product ALE Advanced lipoxidation end-product CEL N ε CML N ε CSE Caffeoyl shikimic esterase CVD Cardiovascular disease DODIC 3-Deoxyglucosone-derived imidazolium cross-link DM Diabetes mellites ELISA Enzyme-linked immuno-sorbent assay ESI Electrospray ionization ESI-MS Electrospray ionization mass-spectrometry GA Glyceraldehyde GC Gas chromatography GC–MS Gas chromatography-mass spectrometry GLAP Glyceraldehyde-derived pyridinium GODIC Glyoxal-derived imidazolium cross-link G-H1 Glyoxal-hydro-imidazolone HCT Hydroxycinnamoyl transferase HPLC High-performance liquid chromatography HSP90 Heat shock protein 90 IL Interleukin LSRD Lifestyle-related disease LPH Lactase phlorizin hydrolase MAGE Melibiose-derived advanced glycation-end product MALDI Matrix-assisted laser desorption/ionization MASLD Metabolic dysfunction–associated steatotic liver disease MG-H1 Methylglyoxal-hydro-imidazolone MODIC Methylglyoxal-derived imidazolium cross-link MOLD Methylglyoxal-lysine dimer MS Mass spectrometry MyD88 Myeloid differentiation factor NF-κβ Nuclear factor-κβ NMR Nuclear magnetic resonance PTE Proximal tubular epithelial PVDF Polyvinylidene fluoride RAGE Receptor for advanced glycation end-product ROS Reactive oxygen species RyR2 Ryanodine receptor 2 sRAGE Soluble receptor for advanced glycation end-product SGLT1 Sodium-glucose cotransporter 1 SLD Steatotic liver disease SOD Superoxide dismutase SULT Sulfotransferase TAGE Toxic advanced glycation end-product TCM Traditional Chinese medicine TLR4 Toll-like receptor 4 TJM Traditional Japanese medicine TNF-α Tumor necrosis factor alpha UGT Glucuronosyltransferase References 1. Plotuna I.S. Balas M. Golu I. Amzar D. Popescu R. Petrica L. Vlad A. Luches D. Vlad D.C. Vlad M. The Use of Kidney Biomarkers, Nephrin and KIM-1, for the Detection of Early Glomerular and Tubular Damage in Patients with Acromegaly: A Case-Control Pilot Study Diseases 2024 12 211 10.3390/diseases12090211 39329880 PMC11431840 2. Acharya P. Acharya C. Thongprayoon C. Hansrivijit P. Kanduri S.R. Kovvura K. Medaura J. Vaitla P. Garcia Anton D.F. Mekraksakit P. Incidence and Characteristics of Kidney Stones in Patients on Ketogenic Diet: A Systematic Review and Meta-Analysis Diseases 2021 9 39 10.3390/diseases9020039 34070285 PMC8161846 3. Dika Ž. Živko M. Kljaić M. Jelaković B. SGLT2 Inhibitors and Their Effect on Urolithiasis: Current Evidence and Future Directions J. Clin. Med. 2024 13 6017 10.3390/jcm13196017 39408078 PMC11478155 4. Heng B.L. Wu F.Y. Tong X.Y. Zou G.J. Ouyang J.M. Corn Silk Polysaccharide Reduces the Risk of Kidney Stone Formation by Reducing Oxidative Stress and Inhibiting COM Crystal Adhesion and Aggregation ACS Omega 2024 9 19236 19249 10.1021/acsomega.4c00110 38708219 PMC11064203 5. Han J. Tong X.Y. Zheng Y.Y. Cheng J.H. Ouyang J.M. Li K. Corn Silk Polysaccharides Before and After Selenization Reduced Calcium Oxalate Crystal-Induced HK-2 Cells Pyroptosis by Inhibiting the NLRP3-GSDMD Signaling Pathway J. Inflamm. Res. 2025 18 3623 3638 10.2147/JIR.S506093 40093949 PMC11910920 6. Takata T. Inoue S. Kunii K. Masauji T. Moriya J. Motoo Y. Miyazawa K. Advanced Glycation End-Product-Modified Heat Shock Protein 90 May Be Associated with Urinary Stones Diseases 2025 13 7 10.3390/diseases13010007 39851471 PMC11764404 7. Takahashi A. Takabatake Y. Kimura T. Maejima I. Namba T. Yamamoto T. Matsuda J. Minami S. Kaimori J. Matsui I. Autophagy Inhibits the Accumulation of Advanced Glycation End Products by Promoting Lysosomal Biogenesis and Function in the Kidney Proximal Tubules Diabetes 2017 66 1359 1372 10.2337/db16-0397 28246295 8. Pan Y. Huang Z. Cai H. Li Z. Zhu J. Wu D. Xu W. Qiu H. Zhang N. Li G. WormCNN-Assisted Establishment and Analysis of Glycation Stress Models in C. elegans: Insights into Disease and Healthy Aging Int. J. Mol. Sci. 2024 25 9675 10.3390/ijms25179675 39273622 PMC11395114 9. Takata T. Motoo Y. Novel In Vitro Assay of the Effects of Kampo Medicines against Intra/Extracellular Advanced Glycation End-Products in Oral, Esophageal, and Gastric Epithelial Cells Metabolites 2023 13 878 10.3390/metabo13070878 37512585 PMC10385496 10. Takata T. Is the Novel Slot Blot a Useful Method for Quantification of Intracellular Advanced Glycation End-Products? Metabolites 2023 13 564 10.3390/metabo13040564 37110222 PMC10144988 11. Takata T. Masauji T. Motoo Y. Analysis of Crude, Diverse, and Multiple Advanced Glycation End-Product Patterns May Be Important and Beneficial Metabolites 2024 14 3 10.3390/metabo14010003 PMC10819149 38276293 12. Takata T. Inoue S. Masauji T. Miyazawa K. Motoo Y. Generation and Accumulation of Various Advanced Glycation End-Products in Cardiomyocytes May Induce Cardiovascular Disease Int. J. Mol. Sci. 2024 25 7319 10.3390/ijms25137319 39000424 PMC11242264 13. Zhang J. Gu L. Jiang Y. Ma Y. Zhang Z. Shen S. Shen S. Peng Q. Xiao W. Artesunate-Nanoliposome-TPP, a Novel Drug Delivery System That Targets the Mitochondria, Attenuates Cisplatin-Induced Acute Kidney Injury by Suppressing Oxidative Stress and Inflammatory Effects Int. J. Nanomed. 2024 19 1385 1408 10.2147/IJN.S444076 38371457 PMC10871145 14. Chen J. Peng H. Chen C. Wang Y. Sang T. Cai Z. Zhao Q. Chen S. Lin X. Eling T. NAG-1/GDF15 inhibits diabetic nephropathy via inhibiting AGE/RAGE-mediated inflammation signaling pathways in C57BL/6 mice and HK-2 cells Life Sci. 2022 311 121142 10.1016/j.lfs.2022.121142 36367498 15. Li R. Guo Y. Zhang Y. Zhang X. Zhu L. Yan T. Salidroside Ameliorates Renal Interstitial Fibrosis by Inhibiting the TLR4/NF-κB and MAPK Signaling Pathways Int. J. Mol. Sci. 2019 20 1103 10.3390/ijms20051103 30836660 PMC6429495 16. Hu M. Wei J. Yang L. Xu J. He Z. Li H. Ning C. Lu S. Linc-KIAA1737-2 promoted LPS-induced HK-2 cell apoptosis by regulating miR-27a-3p/TLR4/NF-κB axis J. Bioenerg. Biomembr. 2021 53 393 403 10.1007/s10863-021-09897-1 34076840 PMC8360891 17. Oroojalian F. Rezayan A.H. Shier W.T. Abnous K. Ramezani M. Megalin-targeted enhanced transfection efficiency in cultured human HK-2 renal tubular proximal cells using aminoglycoside-carboxyalkyl- polyethylenimine -containing nanoplexes Int. J. Pharm. 2017 523 102 120 10.1016/j.ijpharm.2017.03.024 28323095 18. Sawada T. Nagai J. Okada Y. Yumoto R. Takano M. Gadolinium modulates gentamicin uptake via an endocytosis-independent pathway in HK-2 human renal proximal tubular cell line Eur. J. Pharmacol. 2012 684 146 153 10.1016/j.ejphar.2012.03.030 22484335 19. Saito A. Takeda T. Sato K. Hama H. Tanuma A. Kaseda R. Suzuki Y. Gejyo F. Significance of proximal tubular metabolism of advanced glycation end products in kidney diseases Ann. N. Y. Acad. Sci. 2005 1043 637 643 10.1196/annals.1333.072 16037287 20. Goto S. Hosojima M. Kabasawa H. Saito A. The endocytosis receptor megalin: From bench to bedside Int. J. Biochem. Cell Biol. 2023 157 106393 10.1016/j.biocel.2023.106393 36863658 21. Bednarska K. Fecka I. Aspalathin and Other Rooibos Flavonoids Trapped α-Dicarbonyls and Inhibited Formation of Advanced Glycation End Products In Vitro Int. J. Mol. Sci. 2022 23 14738 10.3390/ijms232314738 36499065 PMC9738946 22. Bednarska K. Fecka I. Scheijen J.L.J.M. Ahles S. Vangrieken P. Schalkwijk C.G. A Citrus and Pomegranate Complex Reduces Methylglyoxal in Healthy Elderly Subjects: Secondary Analysis of a Double-Blind Randomized Cross-Over Clinical Trial Int. J. Mol. Sci. 2023 24 13168 10.3390/ijms241713168 37685975 PMC10488144 23. Añazco C. Riedelsberger J. Vega-Montoto L. Rojas A. Exploring the Interplay between Polyphenols and Lysyl Oxidase Enzymes for Maintaining Extracellular Matrix Homeostasis Int. J. Mol. Sci. 2023 24 10985 10.3390/ijms241310985 37446164 PMC10342021 24. Yadav N. Palkhede J.D. Kim S.Y. Anti-Glucotoxicity Effect of Phytoconstituents via Inhibiting MGO-AGEs Formation and Breaking MGO-AGEs Int. J. Mol. Sci. 2023 24 7672 10.3390/ijms24087672 37108833 PMC10141761 25. Miyazaki S. Takino J. Nagamine K. Takeuchi M. Hori T. RasGRP2 Attenuates TAGE Modification of eNOS in Vascular Endothelial Cells Biol. Pharm. Bull. 2025 48 262 266 10.1248/bpb.b24-00730 40101981 26. Maejima I. Takahashi A. Omori H. Kimura T. Takabatake Y. Saitoh T. Yamamoto A. Hamasaki M. Noda T. Isaka Y. Autophagy sequesters damaged lysosomes to control lysosomal biogenesis and kidney injury EMBO J. 2013 32 2336 2347 10.1038/emboj.2013.171 23921551 PMC3770333 27. Takeda K. Sakai-Sakasai A. Kajinami K. Takeuchi M. A Novel Approach: Investigating the Intracellular Clearance Mechanism of Glyceraldehyde-Derived Advanced Glycation End-Products Using the Artificial Checkpoint Kinase 1 d270KD Mutant as a Substrate Model Cells 2023 12 2838 10.3390/cells12242838 38132156 PMC10741459 28. Senavirathna L. Hasapes C. Chen R. Pan S. Accumulation of Intracellular Protein Advanced Glycation End Products Alters Cellular Homeostasis for Protein Clearance in Pancreatic Ductal Epithelial Cells Biochemistry 2024 63 1723 1729 10.1021/acs.biochem.4c00250 38941592 PMC11446404 29. Moriyama M.T. Suga K. Miyazawa K. Tanaka T. Higashioka M. Noda K. Oka M. Tanaka M. Suzuki K. Inhibitions of urinary oxidative stress and renal calcium level by an extract of Quercus salicina Int. J. Urol. 2009 16 397 401 10.1111/j.1442-2042.2009.02268.x 19425219 30. Yin S.H. Zhang W.J. Jiang L.L. Wang G.Y. Jeon Y.J. Ding Y. Li Y. Protective effects of the secondary metabolites from Quercus salicina Danio rerio Comp. Biochem. Physiol. Part C Toxicol. Pharmacol. 2024 283 109952 10.1016/j.cbpc.2024.109952 38852915 31. Kim J.I. Kim H.H. Kim S. Lee K.T. Ham I.H. Whang W.K. Antioxidative compounds from Quercus salicina Arch. Pharm. Res. 2008 31 274 278 10.1007/s12272-001-1152-2 18409038 32. Aung T. Bibat M.A.D. Zhao C.C. Eun J.B. Bioactive compounds and antioxidant activities of Quercus salicina Food Sci. Biotechnol. 2020 29 449 458 10.1007/s10068-020-00755-1 32296555 PMC7142199 33. Chung H.Y. Yuasa M. Chen F.S. Yukawa K. Motoo Y. Arai I. The status of education for integrative medicine in Japanese medical universities with special reference to Kampo medicines Tradit. Kampo Med. 2023 10 123 131 10.1002/tkm2.1365 34. Chung H.Y. Moroi M. Hojo Y. Chen F.S. Yukawa K. Motoo Y. Arai I. The Status of Nationwide Implementation of Integrative Medicine Programs by Japanese Local Government from a “Social Model” Viewpoint Perspect. Integr. Med. 2024 3 98 105 10.56986/pim.2024.06.005 35. Takata T. Masauji T. Motoo Y. Potential of the Novel Slot Blot Method with a PVDF Membrane for Protein Identification and Quantification in Kampo Medicines Membranes 2023 13 896 10.3390/membranes13120896 38132900 PMC10745123 36. Bhuiyan M.N.I. Mitsuhashi S. Sigetomi K. Ubukata M. Quercetin inhibits advanced glycation end product formation via chelating metal ions, trapping methylglyoxal, and trapping reactive oxygen species Biosci. Biotechnol. Biochem. 2017 81 882 890 10.1080/09168451.2017.1282805 28388357 37. Lee S.M. Zheng L.W. Jung Y. Hwang G.S. Kim Y.S. Effects of hydroxycinnamic acids on the reduction of furan and α-dicarbonyl compounds Food Chem. 2020 312 126085 10.1016/j.foodchem.2019.126085 31896460 38. Zu G. Sun K. Li L. Zu X. Han T. Huang H. Mechanism of quercetin therapeutic targets for Alzheimer disease and type 2 diabetes mellitus Sci. Rep. 2021 11 22959 10.1038/s41598-021-02248-5 34824300 PMC8617296 39. Hu Q. Qu C. Xiao X. Zhang W. Jiang Y. Wu Z. Song D. Peng X. Ma X. Zhao Y. Flavonoids on diabetic nephropathy: Advances and therapeutic opportunities Chin. Med. 2021 16 74 10.1186/s13020-021-00485-4 34364389 PMC8349014 40. Yu X.D. Zhang D. Xiao C.L. Zhou Y. Li X. Wang L. He Z. Reilly J. Xiao Z.Y. Shu X. P-Coumaric Acid Reverses Depression-Like Behavior and Memory Deficit Via Inhibiting AGE-RAGE-Mediated Neuroinflammation Cells 2022 11 1594 10.3390/cells11101594 35626632 PMC9139330 41. Zabad O.M. Samra Y.A. Eissa L.A. P-Coumaric acid alleviates experimental diabetic nephropathy through modulation of Toll like receptor-4 in rats Life Sci. 2019 238 116965 10.1016/j.lfs.2019.116965 31629762 42. Sesink A.L. O’Leary K.A. Hollman P.C. Quercetin glucuronides but not glucosides are present in human plasma after consumption of quercetin-3-glucoside or quercetin-4′-glucoside J. Nutr. 2001 131 1938 1941 10.1093/jn/131.7.1938 11435510 43. Holder C.L. Churchwell M.I. Doerge D.R. Quantification of soy isoflavones, genistein and daidzein, and conjugates in rat blood using LC/ES-MS J. Agric. Food Chem. 1999 47 3764 3770 10.1021/jf9902651 10552719 44. Li J. Zhao Z. Deng Y. Li X. Zhu L. Wang X. Li L. Li X. Regulatory Roles of Quercetin in Alleviating Fructose-Induced Hepatic Steatosis: Targeting Gut Microbiota and Inflammatory Metabolites Food Sci. Nutr. 2024 13 e4612 10.1002/fsn3.4612 39803241 PMC11717000 45. Amaretti A. Raimondi S. Leonardi A. Quartieri A. Rossi M. Hydrolysis of the rutinose-conjugates flavonoids rutin and hesperidin by the gut microbiota and bifidobacteria Nutrients 2015 7 2788 2800 10.3390/nu7042788 25875120 PMC4425173 46. Song C. Wang Z. Cao J. Dong Y. Chen Y. Hesperetin alleviates aflatoxin B1 induced liver toxicity in mice: Modulating lipid peroxidation and ferritin autophagy Ecotoxicol. Environ. Saf. 2024 284 116854 10.1016/j.ecoenv.2024.116854 39142113 47. Garrait G. Jarrige J.F. Blanquet S. Beyssac E. Cardot J.M. Alric M. Gastrointestinal absorption and urinary excretion of trans-cinnamic and p-coumaric acids in rats J. Agric. Food Chem. 2006 54 2944 2950 10.1021/jf053169a 16608213 48. Konishi Y. Hitomi Y. Yoshioka E. Intestinal absorption of p-coumaric and gallic acids in rats after oral administration J. Agric. Food Chem. 2004 52 2527 2532 10.1021/jf035366k 15113151 49. Nakazawa Y. Inoue S. Nakamura Y. Iida Y. Ishigaki Y. Miyazawa K. High-salt diet promotes crystal deposition through hypertension in Dahl salt-sensitive rat model Int. J. Urol. 2019 26 839 846 10.1111/iju.14035 31257672 50. Sakamoto S. Miyazawa K. Yasui T. Iguchi T. Fujita M. Nishimatsu H. Masaki T. Hasegawa T. Hibi H. Arakawa T. Chronological changes in epidemiological characteristics of lower urinary tract urolithiasis in Japan Int. J. Urol. 2019 26 96 101 10.1111/iju.13817 30308705 51. Sholan R. Aliyev R. Hashimova U. Karimov S. Bayramov E. Urinary Stone Composition Analysis of 1465 Patients: The First Series from Azerbaijan Arch. Iran. Med. 2024 27 618 623 10.34172/aim.32026 39534996 PMC11558612 52. Ushimoto C. Sugiki S. Kunii K. Inoue S. Kuroda E. Akai R. Iwawaki T. Miyazawa K. Dynamic change and preventive role of stress response via Keap1-Nrf2 during renal crystal formation Free Radic. Biol. Med. 2023 207 120 132 10.1016/j.freeradbiomed.2023.07.013 37451369 53. Sun H. Chen J. Hua Y. Zhang Y. Liu Z. New insights into the role of empagliflozin on diabetic renal tubular lipid accumulation Diabetol. Metab. Syndr. 2022 14 121 10.1186/s13098-022-00886-x 35999610 PMC9396853 54. Qin Y. Wu S. Zhang F. Zhou X. You C. Tan F. N6-methyladenosine methylation regulator RBM15 promotes the progression of diabetic nephropathy by regulating cell proliferation, inflammation, oxidative stress, and pyroptosis through activating the AGE-RAGE pathway Environ. Toxicol. 2023 38 2772 2782 10.1002/tox.23917 37551785 55. Li T. Sun H. Li Y. Su L. Jiang J. Liu Y. Jiang N. Huang R. Zhang J. Peng Z. Downregulation of macrophage migration inhibitory factor attenuates NLRP3 inflammasome mediated pyroptosis in sepsis-induced AKI Cell Death Discov. 2022 8 61 10.1038/s41420-022-00859-z 35165294 PMC8844278 56. Ali A.I. Abdelfadel A. Rohiem M.F. Hassan A. Semirigid ureteroscopy and tamsulosin therapy as dilatation methods before flexible ureteroscopy: Evaluation and benefits World J. Urol. 2024 42 75 10.1007/s00345-023-04696-2 38329579 PMC10853079 57. Gupta M. Gallante B. Bamberger J.N. Khusid J.A. Parkhomenko E. Chandhoke R. Capodice J. Atallah W. Prospective Randomized Evaluation of Idiopathic Hyperoxaluria Treatments J. Endourol. 2021 35 1844 1851 10.1089/end.2021.0122 34254834 58. Prezioso D. Strazzullo P. Lotti T. Bianchi G. Borghi L. Caione P. Carini M. Caudarella R. Ferraro M. Gambaro G. Dietary treatment of urinary risk factors for renal stone formation. A review of CLU Working Group Arch. Ital. Urol. Androl. 2015 87 105 120 10.4081/aiua.2015.2.105 26150027 59. Mikel C.C. Goldfarb D.S. Ponte A. Steigelman K. Latyshev S. Accurate 24-h urine cystine quantification for patients on cystine-binding thiol drugs Urolithiasis 2022 50 721 727 10.1007/s00240-022-01364-9 36201021 PMC9584971 60. Bargagli M. Trelle S. Bonny O. Fuster D.G. Thiazides for kidney stone recurrence prevention Curr. Opin. Nephrol. Hypertens. 2024 33 427 432 10.1097/MNH.0000000000000990 38606682 PMC11139243 61. Takata T. Taniguchi S. Mae Y. Kageyama K. Fujino Y. Iyama T. Hikita K. Sugihara T. Isomoto H. Comparative assessment of the effects of dotinurad and febuxostat on the renal function in chronic kidney disease patients with hyperuricemia Sci. Rep. 2025 15 8990 10.1038/s41598-025-94020-2 40089552 PMC11910530 62. Kraev K.I. Geneva-Popova M.G. Hristov B.K. Uchikov P.A. Popova-Belova S.D. Kraeva M.I. Basheva-Kraeva Y.M. Stoyanova N.S. Mitkova-Hristova V.T. Celebrating Versatility: Febuxostat’s Multifaceted Therapeutic Application Life 2023 13 2199 10.3390/life13112199 38004339 PMC10672185 63. Moriyama M.T. Miyazawa K. Noda K. Oka M. Tanaka M. Suzuki K. Reduction in oxalate-induced renal tubular epithelial cell injury by an extract from Quercus salicina Urol. Res. 2007 35 295 300 10.1007/s00240-007-0114-4 17882411 64. Kawashima N. Ito Y. Sekiya Y. Narita A. Okuno Y. Muramatsu H. Irie M. Hama A. Takahashi Y. Kojima S. Choreito formula for BK virus-associated hemorrhagic cystitis after allogeneic hematopoietic stem cell transplantation Biol. Blood Marrow Transplant. 2015 21 319 325 10.1016/j.bbmt.2014.10.018 25445026 65. Sugihara T. Kamei J. Yasunaga H. Sasabuchi Y. Fujimura T. Prescription of Choreito, a Japanese Kampo Medicine, with Antimicrobials for Treatment of Acute Cystitis: A Retrospective Cohort Study Antibiotics 2022 11 1840 10.3390/antibiotics11121840 36551497 PMC9774728 66. Sharahili A.Y. Mir S.A. Aldosari S. Manzar M.D. Alshehri B. Al Othaim A.A. Alghofaili F. Madkhali Y. Albenasy K.S. Alotaibi J.S. Correlation of HbA1c Level with Lipid Profile in Type 2 Diabetes Mellitus Patients Visiting a Primary Healthcare Center in Jeddah City, Saudi Arabia: A Retrospective Cross-Sectional Study Diseases 2023 11 154 10.3390/diseases11040154 37987265 PMC10660465 67. Ajabnoor G.M.A. Bahijri S.M. Enani S.M. Alsheikh L. Ahmed M. Alhozali A. Al-Shali K. Eldakhakhny B.M. Alamoudi A.A. Al Ahmadi J. Exploring the Validity of Available Markers and Indices in the Diagnosis of Nonalcoholic Fatty Liver Disease (NAFLD) in People with Type 2 Diabetes in Saudi Arabia Diseases 2023 11 10 10.3390/diseases11010010 36648875 PMC9887592 68. Mengucci T. Chagas E.F.B. de Olivera Zanuso B. Quesada K. Dos Santis Haber J.F. Menegucci Zutin T.L. Felipe Pimenta L. Cressoni Araújo A. Landgraf Guiguer E. Rucco P Detregiachi C. The Influence of Body Fat and Lean Mass on HbA1c and Lipid Profile in Children and Adolescents with Type 1 Diabetes Mellitus Diseases 2023 11 125 10.3390/diseases11040125 37873769 PMC10594441 69. Maritin-Morales A. Arakawa T. Sato M. Matsumura Y. Mano-Usui F. Ikeda K. Inagaki N. Sato K. Development of a Method for Quantitation of Glyceraldehyde in Various Body Compartments of Rodents and Humans J. Agric. Food Chem. 2021 69 13246 13254 10.1021/acs.jafc.1c03177 34702032 70. Hassel B. Sørnes K. Elsais A. Cordero P.R. Frøland A.S. Rise F. Glyceraldehyde metabolism in mouse brain and the entry of blood-borne glyceraldehyde into the brain J. Neurochem. 2024 168 2868 2879 10.1111/jnc.16158 38922704 71. Gustafsson B. Hedin U. Caidahl K. Glycolaldehyde and maleyl conjugated human serum albumin as potential macrophage-targeting carriers for molecular imaging purposes Contrast Media Mol. Imaging 2015 10 37 42 10.1002/cmmi.1598 24753457 PMC4374708 72. Mirza M.A. Kandhro A.J. Memon S.Q. Khuhawar M.Y. Arain R. Determination of glyoxal and methylglyoxal in the serum of diabetic patients by MEKC using stilbenediamine as derivatizing reagent Electrophoresis 2007 28 3940 3947 10.1002/elps.200700129 17924366 73. Maresch C.C. Stute D.C. Fleming T. Lin J. Hammes H.P. Linn T. Hyperglycemia induces spermatogenic disruption via major pathways of diabetes pathogenesis Sci. Rep. 2019 9 13074 10.1038/s41598-019-49600-4 31506549 PMC6736974 74. Tessier F.J. Monnier V.M. Sayre L.M. Kornfield J.A. Triosidines: Novel Maillard reaction products and cross-links from the reaction of triose sugars with lysine and arginine residues Biochem. J. 2003 369 705 719 10.1042/bj20020668 12379150 PMC1223106 75. Shigeta T. Sasamoto K. Yamamoto T. Glyceraldehyde-derived advanced glycation end-products having pyrrolopyridinium-based crosslinks Biochem. Biophys. Rep. 2021 26 100963 10.1016/j.bbrep.2021.100963 33748437 PMC7960790 76. Takeuchi M. Suzuki H. Takeda K. Sakai-Sakasai A. Toxic advanced glycation end-products (TAGE) are major structures of cytotoxic AGEs derived from glyceraldehyde Med. Hypotheses 2024 183 111248 10.1016/j.mehy.2023.111248 PMC10887030 38397439 77. Fujimoto S. Murakami Y. Miyake H. Hayase F. Watanabe H. Identification of a novel advanced glycation end product derived from lactaldehyde Biosci. Biotechnol. Biochem. 2019 83 1136 1145 10.1080/09168451.2019.1585745 30822216 78. Litwnowicz K. Waszczuk E. Kuzan A. Bronowicka-Szydełko A. Gostomska-Pampuch K. Naporowski P. Gamian A. Alcoholic Liver Disease Is Associated with Elevated Plasma Levels of Novel Advanced Glycation End-Products: A Preliminary Study Nutrients 2022 14 5266 10.3390/nu14245266 36558425 PMC9783524 79. Sugawa H. Ikeda T. Tominaga Y. Katsuta N. Nagai R. Rapid formation of Nε-(carboxymethyl)lysine (CML) from ribose depends on glyoxal production by oxidation RSC Chem. Biol. 2024 5 1140 1146 10.1039/D4CB00183D 39323732 PMC11420854 80. Ohno R.I. Ichimaru K. Tanaka S. Sugawa H. Katsuta N. Sakake S. Tominaga Y.K. Ban I. Shirakawa J.I. Yamaguchi Y. Glucoselysine is derived from fructose and accumulates in the eye lens of diabetic rats J. Biol. Chem. 2019 294 17326 17338 10.1074/jbc.RA119.010744 31594865 PMC6873178 81. Yamaguchi H. Matsumura T. Sugawa H. Niimi N. Sango K. Nagai R. Glucoselysine, a unique advanced glycation end-product of the polyol pathway and its association with vascular complications in type 2 diabetes J. Biol. Chem. 2024 300 107479 10.1016/j.jbc.2024.107479 38879006 PMC11283207 82. Simkova P. Capcarova M. The influence of toxic advanced glycation end-products (TAGEs) on the development of diabetic nephropathy Arch. Ecotoxicol. 2024 6 13 16 10.36547/ae.2024.6.1.13-16 83. Shen C.Y. Lu C.H. Cheng C.F. Li K.J. Kuo Y.M. Wu C.H. Liu C.H. Hsieh S.C. Tsai C.Y. Yu C.L. Advanced Glycation End-Products Acting as Immunomodulators for Chronic Inflammation, Inflammaging and Carcinogenesis in Patients with Diabetes and Immune-Related Diseases Biomedicines 2024 12 1699 10.3390/biomedicines12081699 39200164 PMC11352041 84. Lee H.W. Gu M.J. Lee J.Y. Lee S. Kim Y. Ha S.K. Methylglyoxal-Lysine Dimer, an Advanced Glycation End Product, Induces Inflammation via Interaction with RAGE in Mesangial Cells Mol. Nutr. Food Res. 2021 65 e2000799 10.1002/mnfr.202000799 33890707 85. Senavirathna L. Ma C. Chen R. Pan S. Proteomic Investigation of Glyceraldehyde-Derived Intracellular AGEs and Their Potential Influence on Pancreatic Ductal Cells Cells 2021 10 1005 10.3390/cells10051005 33923186 PMC8145644 86. Ruiz-Meana M. Minguet M. Bou-Teen D. Miro-Casas E. Castans C. Castellano J. Bonzon-Kulichenko E. Igual A. Rodriguez-Lecoq R. Vázquez J. Ryanodine Receptor Glycation Favors Mitochondrial Damage in the Senescent Heart Circulation 2019 139 949 964 10.1161/CIRCULATIONAHA.118.035869 30586718 87. Oya-Ito T. Naito Y. Takagi T. Handa O. Matsui H. Yamada M. Shima K. Yoshikawa T. Heat-shock protein 27 (Hsp27) as a target of methylglyoxal in gastrointestinal cancer Biochim. Biophys. Acta 2011 1812 769 781 10.1016/j.bbadis.2011.03.017 21497196 88. Takata T. Inoue S. Kunii K. Masauji T. Miyazawa K. Slot Blot- and Electrospray Ionization-Mass Spectrometry/Matrix-Assisted Laser Desorption/Ionization-Mass Spectrometry-Based Novel Analysis Methods for the Identification and Quantification of Advanced Glycation End-Products in the Urine Int. J. Mol. Sci. 2024 25 9632 10.3390/ijms25179632 39273579 PMC11395049 89. Katsuta N. Nagai M. Saruwatari K. Nakamura M. Nagai R. Mitochondrial stress and glycoxidation increase with decreased kidney function J. Clin. Biochem. Nutr. 2023 72 147 156 10.3164/jcbn.22-101 36936874 PMC10017327 90. Takata T. Murayama H. Masauji T. Slot Blot Analysis of Intracellular Glyceraldehyde-Derived Advanced Glycation End Products Using a Novel Lysis Buffer and Polyvinylidene Difluoride Membrane Bio Protoc. 2024 14 e5038 10.21769/BioProtoc.5038 PMC11292133 39100597 91. Nakashima K. Miyashita H. Yoshimitsu H. Fujiwara Y. Nagai R. Ikeda T. Prenylflavonoids isolated from Epimedii Herba show inhibition activity against advanced glycation end-products Front. Chem. 2024 12 1407934 10.3389/fchem.2024.1407934 38882216 PMC11176478 92. Sembiring E.R. Fuad A.M. Suryadi H. Expression and purification of recombinant human granulocyte colony-stimulating factor (rG-CSF) from Pichia pastoris Indones J. Biotechnol. 2024 29 205 212 10.22146/ijbiotech.93609 93. Saito A. Nagai R. Tanuma A. Hama H. Cho K. Takeda T. Yoshida Y. Toda T. Shimizu F. Horiuchi S. Role of megalin in endocytosis of advanced glycation end products: Implications for a novel protein binding to both megalin and advanced glycation end products J. Am. Soc. Nephrol. 2003 14 1123 1131 10.1097/01.ASN.0000062962.51879.F8 12707383 94. Vianello E. Beitrami A.P. Aleksova A. Janjusevic M. Fluca A.L. Corsi Romanelli M.M. La Sala L. Dozio E. The Advanced Glycation End-Products (AGE)-Receptor for AGE System (RAGE): An Inflammatory Pathway Linking Obesity And Cardiovascular Diseases Int. J. Mol. Sci. 2025 26 3707 10.3390/ijms26083707 40332316 PMC12028226 95. Motoo Y. Hakamatsuka T. Kawahara N. Arai I. Tsutani K. Standards of reporting Kampo products (STORK) in research articles J. Integr. Med. 2017 15 182 185 10.1016/S2095-4964(17)60347-9 28494848 96. He Q. Sawada M. Yamasaki N. Akazawa S. Furuta H. Uenishi H. Meng X. Nakahashi T. Ishigaki Y. Moriya J. Neuroinflammation, Oxidative Stress, and Neurogenesis in a Mouse Model of Chronic Fatigue Syndrome, and the Treatment with Kampo Medicine Biol. Pharm. Bull. 2020 43 110 115 10.1248/bpb.b19-00616 31902915 97. Chen H.J. Chen D.Y. Zhou S.Z. Chi K.D. Wu J.Z. Huang F.L. Multiple tophi deposits in the spine: A case report World J. Clin. Cases 2022 10 10647 10654 10.12998/wjcc.v10.i29.10647 36312493 PMC9602227 98. Yuxi G. Ze L.I. Nan C. Xuemei J. Jie W. Hongyu M.A. Runyuan Z. Bolin L.I. Yucong X. Yanru C. High-throughput sequencing analysis of differential microRNA expression in the process of blocking the progression of chronic atrophic gastritis to gastric cancer by Xianglian Huazhuo formula J. Tradit. Chin. Med. 2024 44 703 712 39066531 10.19852/j.cnki.jtcm.20240617.002 PMC11337255 99. Guo Y. Jia X. Du P. Wang J. Du Y. Li B. Xue Y. Jiang J. Cai Y. Yang Q. Mechanistic insights into the ameliorative effects of Xianglianhuazhuo formula on chronic atrophic gastritis through ferroptosis mediated by YY1/miR-320a/TFRC signal pathway J. Ethnopharmacol. 2024 323 117608 10.1016/j.jep.2023.117608 38158098 100. Meng X. Guo X. Zhang J. Moriya J. Kobayashi J. Yamaguchi R. Yamada S. Acupuncture on ST36, CV4 and KI1 Suppresses the Progression of Methionine- and Choline-Deficient Diet-Induced Nonalcoholic Fatty Liver Disease in Mice Metabolites 2019 9 299 10.3390/metabo9120299 31835339 PMC6949943 101. Han J. Guo X. Meng X.J. Zhang J. Yamaguchi R. Motoo Y. Yamada S. Acupuncture improved lipid metabolism by regulating intestinal absorption in mice World J. Gastroenterol. 2020 26 5118 5129 10.3748/wjg.v26.i34.5118 32982113 PMC7495030 102. Li H. Wang D. Acupuncture, a Promising Therapy for Insulin Resistance and Non-Alcoholic Fatty Liver Disease Int. J. Gen. Med. 2024 17 4917 4928 10.2147/IJGM.S484260 39473632 PMC11520709 103. Marzouk M.M. Hegazi N.M. El Shabrawy M.O.A. Farid M.M. Kawashty S.A. Hussein S.R. Saleh N.A.M. Discriminative Metabolomics Analysis and Cytotoxic Evaluation of Flowers, Leaves, and Roots Extracts of Matthiola longipetala livida Metabolites 2023 13 909 10.3390/metabo13080909 37623853 PMC10456503 104. Tarroum M. Alfarraj N.S. Al-Qurainy F. Al-Hashimi A. Khan S. Nadeem M. Salih A.M. Shaikhaldein H.O. Improving the Production of Secondary Metabolites via the Application of Biogenic Zinc Oxide Nanoparticles in the Calli of Delonix elata Metabolites 2023 13 905 10.3390/metabo13080905 37623850 PMC10456625 105. Nakahigashi J. Kurikami M. Iwai S. Iwamoto S. Kobayashi S. Kobayashi E. Exploring the Pharmacokinetics and Gut Microbiota Modulation of Hesperidin and Nobiletin from Mandarin Orange Peel in Experimental Dogs: A Pilot Study Metabolites 2024 15 3 10.3390/metabo15010003 39852346 PMC11766869 106. Fathallah N. El Deeb M. Rabea A.A. Almehmady A.M. Alkharobi H. Elhady S.S. Khalil N. Ultra-Performance Liquid Chromatography Coupled with Mass Metabolic Profiling of Ammi majus Roots as Waste Product with Isolation and Assessment of Oral Mucosal Toxicity of Its Psoralen Component Xanthotoxin Metabolites 2023 13 1044 10.3390/metabo13101044 37887369 PMC10608439 107. Fujitaka Y. Hamada H. Uesugi D. Kuboki A. Shimoda K. Iwaki T. Kiriake Y. Saikawa T. Synthesis of Daidzein Glycosides, α-Tocopherol Glycosides, Hesperetin Glycosides by Bioconversion and Their Potential for Anti-Allergic Functional-Foods and Cosmetics Molecules 2019 24 2975 10.3390/molecules24162975 31426346 PMC6721765 108. Gajić Umiljendić J. Sarić-Krsmanović M. Radivojević L. Šantrić L. Šćepanović M. Šoštarčić V. Đorđević T. Phytochemical analysis of Asclepias syriaca L. leaf extract and its potential phytotoxic effect on some invasive weeds Sci. Rep. 2025 15 6752 10.1038/s41598-025-90940-1 40000782 PMC11861289 109. Weng V. Cardeira M. Bento-Silva A. Serra A.T. Brazinha C. Bronze M.R. Arabinoxylan from Corn Fiber Obtained through Alkaline Extraction and Membrane Purification: Relating Bioactivities with the Phenolic Compounds Molecules 2023 28 5621 10.3390/molecules28155621 37570593 PMC10420191 110. Wang X. Ouyang Y.Y. Liu J. Zhao G. Flavonoid intake and risk of CVD: A systematic review and meta-analysis of prospective cohort studies Br. J. Nutr. 2014 111 1 11 10.1017/S000711451300278X 23953879 111. Li T. Zhao Y. Yuan L. Zhang D. Feng Y. Hu H. Hu D. Liu J. Total dietary flavonoid intake and risk of cardiometabolic diseases: A dose-response meta-analysis of prospective cohort studies Crit. Rev. Food Sci. Nutr. 2024 64 2760 2772 10.1080/10408398.2022.2126427 36148848 112. Silva R.M.G.D. Barbosa F.C. Santos H.H. Granero F.O. Figueiredo C.C.M. Nicolau-Junior N. Hamaguchi A. Silva L.P. Antioxidant and anti-glycation activities of Mandevilla velutina extract and effect on parasitemia levels in Trypanosoma cruzi experimental infection: In vivo, in vitro and in silico approaches J. Ethnopharmacol. 2025 337 118994 10.1016/j.jep.2024.118994 39461387 113. Boojar M.M.A. Boojar M.M.A. Firouzivand Y. In vitro Investigation of the Anti-Diabetic Effects of Imperialine on Beta-TC6 Pancreatic and C2C12 Skeletal Muscle Cell Lines J. Appl. Biotechnol. Rep. 2021 8 337 345 114. Cha S.H. Hwang Y. Heo S.J. Jun H.S. Diphlorethohydroxycarmalol Attenuates Methylglyoxal-Induced Oxidative Stress and Advanced Glycation End Product Formation in Human Kidney Cells Oxid. Med. Cell. Longev. 2018 2018 3654095 10.1155/2018/3654095 29849886 PMC5937433 115. Han J. Hou J. Liu Y. Liu P. Zhao T. Wang X. Using Network Pharmacology to Explore the Mechanism of Panax notoginseng in the Treatment of Myocardial Fibrosis J. Diabetes Res. 2022 2022 8895950 10.1155/2022/8895950 35372585 PMC8975676 116. Kang C. Li X. Liu P. Liu Y. Niu Y. Zeng X. Liu J. Zhao H. Qiu S. Quercetin inhibits the activity and function of dendritic cells through the TLR4/IRAK4/NF-κB signalling pathway Contemp. Oncol. 2023 27 182 189 10.5114/wo.2023.133741 PMC10793624 38239865 117. Gong X. Huang Y. Ma Q. Jiang M. Zhan K. Zhao G. Quercetin Alleviates Lipopolysaccharide-Induced Cell Damage and Inflammation via Regulation of the TLR4/NF-κB Pathway in Bovine Intestinal Epithelial Cells Curr. Issues Mol. Biol. 2022 44 5234 5246 10.3390/cimb44110356 36354668 PMC9688721 118. Zhang H.X. Li Y.Y. Liu Z.J. Wang J.F. Quercetin effectively improves LPS-induced intestinal inflammation, pyroptosis, and disruption of the barrier function through the TLR4/NF-κB/NLRP3 signaling pathway in vivo and in vitro Food Nutr. Res. 2022 66 8948 10.29219/fnr.v66.8948 PMC9899048 36793340 119. Jiang M. Wang K. Huang Y. Zhang X. Yang T. Zhan K. Zhao G. Quercetin Alleviates Lipopolysaccharide-Induced Cell Oxidative Stress and Inflammatory Responses via Regulation of the TLR4-NF-κB Signaling Pathway in Bovine Rumen Epithelial Cells Toxins 2023 15 512 10.3390/toxins15080512 37624269 PMC10467142 120. Shams S.G.E. Eissa R.G. Amelioration of ethanol-induced gastric ulcer in rats by quercetin: Implication of Nrf2/HO1 and HMGB1/TLR4/NF-κB pathways Heliyon 2022 8 e11159 10.1016/j.heliyon.2022.e11159 36311358 PMC9614827 121. Duan Z.L. Wang Y.J. Lu Z.H. Tian L. Xia Z.Q. Wang K.L. Chen T. Wang R. Feng Z.Y. Shi G.P. Wumei Wan attenuates angiogenesis and inflammation by modulating RAGE signaling pathway in IBD: Network pharmacology analysis and experimental evidence Phytomedicine 2023 111 154658 10.1016/j.phymed.2023.154658 36706698 122. Lan C.Y. Chen S.Y. Kuo C.W. Lu C.C. Yen G.C. Quercetin facilitates cell death and chemosensitivity through RAGE/PI3K/AKT/mTOR axis in human pancreatic cancer cells J. Food Drug Anal. 2019 27 887 896 10.1016/j.jfda.2019.07.001 31590760 PMC9306979 123. Abd Elmaaboud M.A. Estfanous R.S. Atef A. Kabel A.M. Alnemari K.A. Naguib T.M. Aisufyani S.E. Darwish H.W. Arab H.H. Dapagliflozin/Hesperidin Combination Mitigates Lipopolysaccharide-Induced Alzheimer’s Disease in Rats Pharmaceuticals 2023 16 1370 10.3390/ph16101370 37895841 PMC10609711 124. Han X. Zhang Y. Zhang L. Zhuang Y. Wang Y. Efficacy and molecular mechanisms of hesperidin in mitigating Alzheimer’s disease: A systematic review Eur. J. Med. Chem. 2025 283 117144 10.1016/j.ejmech.2024.117144 39647419 125. Hong Y. An Z. Hesperidin attenuates learning and memory deficits in APP/PS1 mice through activation of Akt/Nrf2 signaling and inhibition of RAGE/NF-κB signaling Arch. Pharm. Res. 2018 41 655 663 10.1007/s12272-015-0662-z 26391026 126. Wu Q. Kong Y. Liang Y. Niu M. Feng N. Zhang C. Qi Y. Guo Z. Xiao J. Zhou M. Protective mechanism of fruit vinegar polyphenols against AGEs-induced Caco-2 cell damage Food Chem. X 2023 19 100736 10.1016/j.fochx.2023.100736 37415956 PMC10319990 127. Truong T.M.T. Seo S.H. Chung S. Kang I. Attenuation of hepatic fibrosis by p-Coumaric acid via modulation of NLRP3 inflammasome activation in C57BL/6 mice J. Nutr. Biochem. 2023 112 109204 10.1016/j.jnutbio.2022.109204 36400112 128. Setchell K.D. Brown N.M. Desai P. Zimmer-Nechemias L. Wolfe B.E. Brashear W.T. Kirschner A.S. Cassidy A. Heubi J.E. Bioavailability of pure isoflavones in healthy humans and analysis of commercial soy isoflavone supplements J. Nutr. 2001 131 1362S 1375S 10.1093/jn/131.4.1362S 11285356 129. Nakamura T. Murota K. Kumamoto K. Kumamoto S. Misumi K. Bando N. Ikushiro S. Takahashi N. Sekido K. Kato Y. Plasma metabolites of dietary flavonoids after combination meal consumption with onion and tofu in humans Mol. Nutr. Food Res. 2014 58 310 317 10.1002/mnfr.201300234 24039174 130. Murota K. Matsuda N. Kashino Y. Fujikura Y. Nakamura T. Kato Y. Shimizu R. Okuyama S. Tanaka H. Koda T. alpha-Oligoglucosylation of a sugar moiety enhances the bioavailability of quercetin glucosides in humans Arch. Biochem. Biophys. 2010 501 91 97 10.1016/j.abb.2010.06.036 20638359 131. Walle T. Otake Y. Walle U.K. Wilson F.A. Quercetin glucosides are completely hydrolyzed in ileostomy patients before absorption J. Nutr. 2000 130 2658 2661 10.1093/jn/130.11.2658 11053503 132. Wolffram S. Blöck M. Ader P. Quercetin-3-glucoside is transported by the glucose carrier SGLT1 across the brush border membrane of rat small intestine J. Nutr. 2002 132 630 635 10.1093/jn/132.4.630 11925453 133. Walgren R.A. Lin J.T. Kinne R.K. Walle T. Cellular uptake of dietary flavonoid quercetin 4′-beta-glucoside by sodium-dependent glucose transporter SGLT1 J. Pharmacol. Exp. Ther. 2000 294 837 843 10.1016/S0022-3565(24)39143-8 10945831 134. Day A.J. Gee J.M. Dupont M.S. Johnson I.T. Williamson G. Absorption of quercetin-3-glucoside and quercetin-4′-glucoside in the rat small intestine: The role of lactase phlorizin hydrolase and the sodium-dependent glucose transporter Biochem. Pharmacol. 2003 65 1199 1206 10.1016/S0006-2952(03)00039-X 12663055 135. Sesink A.L.A. Arts I.C.W. Faassen-Peters M. Hollman P.C.H. Intestinal uptake of quercetin-3-glucoside in rats involves hydrolysis by lactase phlorizin hydrolase J. Nutr. 2003 133 773 776 10.1093/jn/133.3.773 12612151 136. Németh K. Plumb G.W. Berrin J.G. Juge N. Jacob R. Naim H.Y. Williamson G. Swallow D.M. Kroon P.A. Deglycosylation by small intestinal epithelial cell beta-glucosidases is a critical step in the absorption and metabolism of dietary flavonoid glycosides in humans Eur. J. Nutr. 2003 42 29 42 10.1007/s00394-003-0397-3 12594539 137. Byambaakhuu N. Duan S. Sa R. Yang Q.L. Xu H.Y. Shan C.B. Xu R.H. Ma C.M. Characterization of intestinal bacteria for the production of quercetin and isoquercitrin from rutin Arch. Microbiol. 2025 207 83 10.1007/s00203-025-04278-3 40063115 138. Makino T. Shimizu R. Kanemaru M. Suzuki Y. Moriwaki M. Mizukami H. Enzymatically modified isoquercitrin, alpha-oligoglucosyl quercetin 3-O-glucoside, is absorbed more easily than other quercetin glycosides or aglycone after oral administration in rats Biol. Pharm. Bull. 2009 32 2034 2040 10.1248/bpb.32.2034 19952424 139. Wang D. Jiang Q. Li P. Yu C. Yuan R. Dong Z. Meng T. Hu F. Wang J. Yuan H. Orally Administrated Precision Nanomedicine for Restoring the Intestinal Barrier and Alleviating Inflammation in Treatment of Inflammatory Bowel Disease ACS Appl. Mater. Interfaces 2025 17 10986 11001 10.1021/acsami.4c19742 39931937 140. Sousa A. Kämpfer A.A.M. Schins R.P.F. Cavalho F. Fernandes E. Freitas M. Protective effects of quercetin on intestinal barrier and cellular viability against silver nanoparticle exposure: Insights from an intestinal co-culture model Nanotoxicology 2025 19 141 155 10.1080/17435390.2025.2450372 39895265 141. Jantip P.A. Singh C.K. Klu Y.A.K. Ahmad N. Bolling B.W. Peanut skin polyphenols inhibit proliferation of leukemia cells in vitro, and its A-type procyanidins selectively pass through a Caco-2 intestinal barrier J. Food Sci. 2025 90 e70018 10.1111/1750-3841.70018 39949260 PMC11826137 142. Murota K. Shimizu S. Chujo H. Moon J.H. Terao J. Efficiency of absorption and metabolic conversion of quercetin and its glucosides in human intestinal cell line Caco-2 Arch. Biochem. Biophys. 2000 384 391 397 10.1006/abbi.2000.2123 11368329 143. Zhong W. Chen T. Chen L. Xing Y. Lin H. Xie S. Nawaz M. Huang D. Huang Z. Lu J. Crippled Hepatocarcinogenesis Inhibition of Quercetin in Glycolysis Pathway with Hepatic Farnesoid X Receptor Deficiency Curr. Pharm. Des. 2025 31 1800 1815 10.2174/0113816128342642250111055339 39917939 144. Yakubo S. Abe H. Li Y. Kudo M. Kimura A. Wakabayashi T. Watanabe Y. Kimura N. Setsu T. Yokoo T. Dasatinib and Quercetin as Senolytic Drugs Improve Fat Deposition and Exhibit Antifibrotic Effects in the Medaka Metabolic Dysfunction-Associated Steatotic Liver Disease Model Diseases 2024 12 317 10.3390/diseases12120317 39727647 PMC11727104 145. Kaci H. Bakos É. Needs P.W. Kroon P.A. Valentová K. Poór M. Özvegy-Laczka C. The 2-aminoethyl diphenylborinate-based fluorescent method identifies quercetin and luteolin metabolites as substrates of Organic anion transporting polypeptides, OATP1B1 and OATP2B1 Eur. J. Pharm. Sci. 2024 196 106740 10.1016/j.ejps.2024.106740 38437885 146. Hou Y. Chen C. Li Z. Wu J. Lyu S. Guo D. Liu Y. Liu Y. Hou T. Protective effect of quercetin against macrophage-mediated hepatocyte injury via anti-inflammation, anti-apoptosis and inhibition of ferroptosis Autoimmunity 2024 57 2350202 10.1080/08916934.2024.2350202 38721694 147. Michala A.S. Pritsa A. Quercetin: A Molecule of Great Biochemical and Clinical Value and Its Beneficial Effect on Diabetes and Cancer Diseases 2022 10 37 10.3390/diseases10030037 35892731 PMC9326669 148. Kim G.J. Jang Y. Kwon K.T. Kim J.W. Kang S.I. Ko H.C. Lee J.Y. Apostolidis E. Know Y.I. Jeju Citrus ( Citrus unshiu Int. J. Mol. Sci. 2024 25 13721 10.3390/ijms252413721 39769483 PMC11679778 149. Stevens Y. Rymenant E.V. Grootaert C. Camp J.V. Possemiers S. Masclee A. Jonkers D. The Intestinal Fate of Citrus Flavanones and Their Effects on Gastrointestinal Health Nutrients 2019 11 1464 10.3390/nu11071464 31252646 PMC6683056 150. Yamada M. Tanabe F. Arai N. Mitsuzumi H. Miwa Y. Kubota M. Chaen H. Kibata M. Bioavailability of glucosyl hesperidin in rats Biosci. Biotechnol. Biochem. 2006 70 1386 1394 10.1271/bbb.50657 16794318 151. Van Rymenant E. Salden B. Voorspoels S. Jacobs G. Noten B. Pitart J. Possemiers S. Smagghe G. Grootaert C. Van Camp J. A Critical Evaluation of In Vitro Hesperidin 2S Bioavailability in a Model Combining Luminal (Microbial) Digestion and Caco-2 Cell Absorption in Comparison to a Randomized Controlled Human Trial Mol. Nutr. Food Res. 2018 62 e1700881 10.1002/mnfr.201700881 29451355 152. Brand W. Boersma M.G. Bik H. Hoek-van den Hil E.F. Vervoort J. Barron D. Meinl W. Glatt H. Williamson G. van Bladeren P.J. Phase II metabolism of hesperetin by individual UDP-glucuronosyltransferases and sulfotransferases and rat and human tissue samples Drug Metab. Dispos. 2010 38 617 625 10.1124/dmd.109.031047 20056724 153. Morshedzadeh N. Ramezani Ahmadi A. Behrouz V. Mir E. A narrative review on the role of hesperidin on metabolic parameters, liver enzymes, and inflammatory markers in nonalcoholic fatty liver disease Food Sci. Nutr. 2023 11 7523 7533 10.1002/fsn3.3729 38107097 PMC10724641 154. Megahed A. Gadalla H. Filimban W.A. Albukhari T.A. Sembawa H. Bagadood R.M. Sindi G. Abdelhamid F.M. El-Boshy M.E. Risha E.F. Hesperidin ameliorates thioacetamide-induced liver fibrosis via antioxidative and anti-inflammatory mechanisms targeting TGF-β/α-SMA pathways in rats Int. J. Immunopathol. Pharmacol. 2024 38 3946320241309004 10.1177/03946320241309004 39707862 PMC11663270 155. Saponara I. Aloisio Caruso E. Cofano M. De Nunzio V. Pinto G. Centonze M. Notarnicola M. Anti-Inflammatory and Anti-Fibrotic Effects of a Mixture of Polyphenols Extracted from “Navelina” Orange in Human Hepa-RG and LX-2 Cells Mediated by Cannabinoid Receptor 2 Int. J. Mol. Sci. 2025 26 512 10.3390/ijms26020512 39859241 PMC11765147 156. Konishi Y. Zhao Z. Shimizu M. Phenolic acids are absorbed from the rat stomach with different absorption rates J. Agric. Food Chem. 2006 54 7539 7543 10.1021/jf061554+ 17002419 157. Gallego-Lobillo P. Lopez-Rodulfo I.M. Martinez M.M. Rat small intestine extract as a source of mammalian α- and β-glycosidases to study polyphenol bioaccessibility and deglycosylation in vitro: A case study with matrix-devoid and matrix-defined apple fractions Food Res. Int. 2025 199 115346 10.1016/j.foodres.2024.115346 39658150 158. Vanholme R. Cesarino I. Rataj K. Xiao Y. Sundin L. Goeminne G. Kim H. Cross J. Morreel K. Araujo P. Caffeoyl shikimate esterase (CSE) is an enzyme in the lignin biosynthetic pathway in Arabidopsis Science 2013 341 1103 1106 10.1126/science.1241602 23950498 159. Barros J. Escamilla-Trevino L. Song L. Rao X. Serrani Yarce J.C. Palacios M.D. Engle N. Choudhury F.K. Tschaplinski T.J. Venables B.J. 4-Coumarate 3-hydroxylase in the lignin biosynthesis pathway is a cytosolic ascorbate peroxidase Nat. Commun. 2019 10 1994 10.1038/s41467-019-10082-7 31040279 PMC6491607 160. Zielińska D. Zieliński H. Laparra-Llopis J.M. Szawara-Nowak D. Honke J. Giménez-Bastida J.A. Caffeic Acid Modulates Processes Associated with Intestinal Inflammation Nutrients 2021 13 554 10.3390/nu13020554 33567596 PMC7914463 161. Rashedinia M. Rasti Arbabi Z.R. Sabet R. Emami L. Poustforoosh A. Sabahi Z. Comparison of Protective Effects of Phenolic Acids on Protein Glycation of BSA Supported by In Vitro and Docking Studies Biochem. Res. Int. 2023 2023 9984618 10.1155/2023/9984618 37496561 PMC10368515 162. Zhao Y. Zhao J. Ma H. Han Y. Xu W. Wang J. Cai Y. Jia X. Jia Q. Yang Q. High Hepcidin Levels Promote Abnormal Iron Metabolism and Ferroptosis in Chronic Atrophic Gastritis Biomedicines 2023 11 2338 10.3390/biomedicines11092338 37760781 PMC10525531 Figure 1 Proximal tubular epithelial (PTE) cells and mechanisms of dysfunction. Upper and lower cells form the proximal tubular walls, and the middle space is the urinary tract. Closed squares indicate PTE cells. Closed pink circles indicate cell nuclei. Closed red polygon indicates reactive oxygen species (ROS). Closed blue polygons indicate urinary stones. Yellow cells indicate the normal cells. Gray cell indicates a senescent cell. Green cells indicate cells with inflammation. Figure 2 Origins of AGEs [ 6 9 11 12 Figure 3 Free types of AGEs [ 6 9 11 12 a N ε N ε b Figure 4 Crude AGE patterns [ 6 11 12 Figure 5 Type 1 and 2 diverse AGE patterns [ 11 12 88 a b N ε Figure 6 Type 1 and 2 multiple AGE patterns. Closed blue circles indicate amino acids. Black or red number indicates the number of amino acid residues [ 6 11 12 87 88 a N ε N ε b Figure 7 Traditional Japanese medical science (TJMS) comprises Kampo, Japanese folk medical science (JFMS), and traditional Chinese medical science (TCMS). Figure 8 Chemical structures of study molecules. ( a p b Figure 9 Metabolites of quercetin in the blood [ 129 130 131 O O O O O O O O O O Figure 10 Model of Q3G, Q4′G, and quercetin absorption into the small intestine, and leaking of glucuronide-quercetin and quercetin into the blood or lymph vessels. Closed blue square indicates small-intestinal epithelial cells. Open pink area indicates blood or lymph vessel. Closed yellow square indicates sodium-glucose cotransporter 1 (SGLT1). Closed pink hexagon indicates lactase phlorizin hydrolase (LPH). Closed green square indicates cytosolic β-glucosidase. Closed red square indicates phase II enzyme system. Q3G, quercetin-3- O O Figure 11 Model of Q3G, Q4′G, and quercetin absorption into the large intestine, and leaking of quercetin-glucuronide and quercetin into the blood or lymph vessels [ 143 144 145 146 147 O O Figure 12 Metabolites detected in HepG2 cells treated with quercetin [ 147 O Figure 13 Model of the absorption of hesperidin and hesperetin in the small/large intestine, and leaking of hesperidin-glucuronide and hesperetin into the blood or lymph vessels [ 148 149 150 151 Figure 14 Metabolites of hesperidin detected in cytosolic fractions of small intestine, large intestine, and hepatic tissue [ 151 152 Figure 15 Metabolic pathway of p 158 159 p ",
  "metadata": {
    "Title of this paper": "High Hepcidin Levels Promote Abnormal Iron Metabolism and Ferroptosis in Chronic Atrophic Gastritis",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471064/"
  }
}