{
  "title": "Paper_647",
  "abstract": "pmc World J Clin Oncol 1494 wjco WJCO World Journal of Clinical Oncology 2218-4333 Baishideng Publishing Group Inc PMC12476597 PMC12476597.1 12476597 12476597 41024831 10.5306/wjco.v16.i9.110068 jWJCO.v16.i9.eid110068 1 Randomized Controlled Trial Prognostic immune nutritional index-based nutritional stratification enhances recovery and survival in gastric cancer: A randomized controlled trial Wang G et al Wang Gang Department of General Surgery, The First Affiliated Hospital of Soochow University, Suzhou 215006, Jiangsu Province, China Pan Sheng-Jie Department of Neurology, The First Affiliated Hospital of Soochow University, Suzhou 215006, Jiangsu Province, China. 448331812@qq.com Author contributions: Wang G contributed to writing-original draft; Wang G and Pan SJ contributed to conceptualization, supervision, writing-review & editing; All authors have read and approved the final version of the manuscript. Corresponding author: Sheng-Jie Pan, MD, PhD, Professor, Department of Neurology, The First Affiliated Hospital of Soochow University, No. 899 Pinghai Road, Suzhou 215006, Jiangsu Province, China. 448331812@qq.com 24 9 2025 24 9 2025 16 9 497728 110068 29 5 2025 9 6 2025 25 8 2025 24 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Postoperative malnutrition, systemic inflammation, and immune dysfunction significantly impair recovery and survival in gastric cancer patients undergoing radical gastrectomy. The Prognostic Immune Nutritional Index (PINI) enables immune-nutritional risk stratification; however, its utility in guiding perioperative nutritional support remains underexplored. AIM To evaluate whether risk-stratified perioperative nutritional support based on PINI scores improves postoperative recovery, quality of life, and long-term outcomes in gastric cancer patients. METHODS In this prospective, randomized controlled trial, 195 patients undergoing radical gastrectomy were stratified into low- (PINI ≤ 1.5), moderate- (1.5 < PINI ≤ 3), and high-risk (PINI > 3) groups. Patients received standard, intensive, or immune-enhancing nutritional support, respectively. Outcomes were assessed at 1 week, 1 month, and 1 year postoperatively and included body mass index (BMI), serum albumin, PINI scores, Pittsburgh Sleep Quality Index (PSQI), Self-Rating Anxiety Scale (SAS), Self-Rating Depression Scale (SDS), Visual Analog Scale (VAS) for pain, EORTC QLQ-C30 for quality of life, complication rates, hospital stay, and survival. RESULTS At 1 year, the high-risk group receiving immune-enhancing nutrition demonstrated the greatest improvements, with higher serum albumin (47.5 ± 3.8 g/L) and stabilized BMI (+0.1 ± 0.2 kg/m 2 vs 2 P P P P CONCLUSION PINI-based graded nutritional support significantly enhances postoperative recovery, reduces complications, and improves long-term outcomes following radical gastrectomy. These findings support its integration into precision perioperative care strategies for gastric cancer. Prognostic Immune Nutritional Index Gastric cancer Perioperative nutrition Postoperative recovery Quality of life pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Gastric cancer remains a leading cause of cancer-related mortality worldwide, with radical gastrectomy serving as the primary curative treatment[ 1 2 3 4 The Prognostic Immune Nutritional Index (PINI), which combines albumin, transferrin, C-reactive protein (CRP), and α1-acid glycoprotein, provides a more comprehensive assessment of systemic inflammation and metabolic derangement[ 5 6 7 Despite its established prognostic value, the use of PINI to stratify and guide perioperative nutritional support in gastric cancer patients has not been thoroughly investigated. Whether such a graded approach could improve short- and long-term outcomes remains an open clinical question. This study aimed to evaluate the long-term impact of PINI-based graded nutritional support on postoperative recovery in gastric cancer patients undergoing radical gastrectomy. Outcomes of interest included nutritional reconstitution, sleep quality, psychological well-being, pain control, quality of life, complication rates, and survival over a 1-year follow-up. By integrating immune-nutritional risk stratification into perioperative care, this study seeks to provide a precision-based framework for optimizing postoperative recovery and enhancing patient-centered outcomes. MATERIALS AND METHODS Study design and setting This prospective, randomized controlled trial was conducted at The First Affiliated Hospital of Soochow University between October 2022 and October 2023. The study protocol was approved by the institutional ethics committee (Approval No. SUDA20220906H01) and conducted in accordance with the Declaration of Helsinki. Written informed consent was obtained from all participants prior to enrollment. A non-intervention ( i.e. 4 8 Patient enrollment and sample size calculation A total of 195 patients scheduled for elective radical gastrectomy were consecutively enrolled. Sample size was calculated using G*Power 3.1, based on an estimated effect size of 0.4, α = 0.05, and statistical power (1-β) = 0.80. This ensured adequate power to detect clinically relevant intergroup differences in primary outcomes. Participant flow  Recruitment and screening:  Randomization and allocation: 1 Figure 1  CONSORT flow diagram. Group allocation was as follows: (1) Low-risk (PINI ≤ 1.5, n n n  Follow-up and analysis: n n n Given the nature of the intervention, blinding of patients and care providers was not feasible. However, to mitigate performance and detection bias, all subjective outcomes—such as sleep quality and psychological measures—were assessed by trained outcome assessors who were blinded to group allocation. Validated and standardized instruments were employed, including the Pittsburgh Sleep Quality Index (PSQI) for sleep assessment and the Hospital Anxiety and Depression Scale for psychological evaluation, each with established scoring systems and proven reliability. Inclusion and exclusion criteria  Inclusion criteria:  Exclusion criteria: 2 Risk stratification based on PINI The PINI was calculated as: PINI = (α1-acid glycoprotein × CRP)/(albumin × transferrin), where α1-acid glycoprotein and CRP are acute-phase reactants (mg/L), and albumin (g/L) and transferrin (mg/L) are negative-phase proteins. Based on previously published literature, particularly the seminal work presented in[ 9 Nutritional interventions All nutritional interventions were administered over a 6-week perioperative period, beginning 14 days preoperatively and continuing for 1 month after surgery. Nutritional strategies were tailored according to PINI-based risk stratification.  Standard nutrition (low-risk group):  Intensive nutrition (moderate-risk group):  Immune-enhancing nutrition (high-risk group): Administered orally, enterally, or parenterally, depending on patient tolerance. Standardized commercial nutritional formulas were used throughout the intervention period. In the high-risk group, patients received Peptisorb Immuno ® ® 10 All patients followed enhanced recovery after surgery (ERAS) protocols, including early mobilization, multimodal analgesia, and infection prevention.  ERAS protocol and compliance: Outcome measures All outcomes were assessed at baseline, 1 week, 1 month, and 1 year postoperatively.  Sleep quality: 11  Nutritional status: 12  Psychological well-being: 13 14  Pain: 15  Quality of life: 16  Clinical outcomes: Statistical analysis  Descriptive and inferential statistics: χ 2 via  Multivariate regression: P  Survival analysis:  Statistical threshold: P RESULTS Baseline characteristics A total of 195 patients undergoing radical gastrectomy were stratified into low-risk ( n n n 1 P Table 1 Baseline characteristics ( n n  Variables  Low-risk group ( n  Moderate-risk group ( n  High-risk group ( n  Statistic   P Age (years) 58.5 ± 7.9 59.1 ± 8.4 60.2 ± 8.7 F = 0.832 0.412 Gender  χ 0.879 Male 38 (58.5) 39 (60.0) 40 (61.5) Female 27 (41.5) 26 (40.0) 25 (38.5) BMI (kg/m 2 23.7 ± 2.0 23.8 ± 2.1 23.5 ± 2.2 F = 0.356 0.701 Education level  χ 0.772 Junior high or below 15 (23.1) 14 (21.5) 16 (24.6) High school 25 (38.5) 26 (40.0) 24 (36.9) College or above 25 (38.5) 25 (38.5) 25 (38.5) Surgical method  χ 0.681 Minimally invasive surgery 50 (76.9) 48 (73.8) 51 (78.5) Open surgery 15 (23.1) 17 (26.2) 14 (21.5) Type of surgery  χ 0.936 Total gastrectomy 33 (50.8) 34 (52.3) 32 (49.2) Partial gastrectomy 32 (49.2) 31 (47.7) 33 (50.8) Clinical staging  χ 0.897 Phase I 10 (15.4) 12 (18.5) 11 (16.9) Phase II 20 (30.8) 19 (29.2) 21 (32.3) Phase III 25 (38.5) 24 (36.9) 23 (35.4) Phase IV 10 (15.4) 10 (15.4) 10 (15.4) Comorbidities  χ 0.991 Hypertension 15 (23.1) 16 (24.6) 17 (26.2) Diabetes 10 (15.4) 11 (16.9) 12 (18.5) Other 5 (7.7) 6 (9.2) 7 (10.8)  P Sleep quality (PSQI scores) Postoperative sleep quality significantly improved in all groups over time ( P P vs 2 Table 2 Sleep quality (Pittsburgh Sleep Quality Index scores)  Group  Pre-op PSQI  1 week post-op  1 month post-op  1 year post-op  Improvement  Statistic   P Low-risk 10.1 ± 3.2 8.5 ± 3.1 7.0 ± 2.6 6.3 ± 2.4 -3.8 ± 2.1 F = 13.56 0.032 Moderate-risk 11.3 ± 4.0 8.9 ± 3.5 6.7 ± 2.8 5.4 ± 2.1 -5.9 ± 2.5 F = 15.21 0.014 High-risk 12.6 ± 4.3 9.3 ± 3.8 5.6 ± 2.3 4.1 ± 1.8 -8.5 ± 2.7 1 F = 17.98 < 0.001 1 Indicates statistically significant difference compared to other groups ( P P Lower scores indicate better sleep quality. “Improvement” refers to change from baseline (Δ value). PSQI: Pittsburgh Sleep Quality Index. Nutritional status  BMI: 2 2 2 P 3 Table 3 Temporal changes in body mass index, serum albumin, and Prognostic Inflammatory and Nutritional Index scores across risk groups Group Pre-op BMI 1W Post-op 1M Post-op 1Y Post-op BMI Δ Pre-op Albumin 1W Post-op 1M Post-op 1Y Post-op Albumin Δ Pre-op PINI 1W Post-op 1M Post-op 1Y Post-op PINI Δ Low-risk 23.8 ± 2.0 22.9 ± 1.8 23.2 ± 1.7 23.6 ± 1.5 -0.2 ± 0.2 42.3 ± 4.5 43.0 ± 4.3 43.8 ± 4.0 44.2 ± 3.9 +1.9 ± 1.2 1.2 ± 0.2 1.1 ± 0.2 0.9 ± 0.2 0.8 ± 0.1 -0.4 ± 0.2 Moderate-risk 23.6 ± 2.1 23.0 ± 2.0 23.5 ± 1.8 23.9 ± 1.6 -0.1 ± 0.3 41.5 ± 5.2 43.5 ± 4.9 44.7 ± 4.5 45.3 ± 4.3 +3.8 ± 1.6 2.5 ± 0.3 2.1 ± 0.3 1.8 ± 0.3 1.5 ± 0.2 -1.0 ± 0.3 High-risk 23.4 ± 2.3 23.1 ± 2.1 23.7 ± 2.0 24.2 ± 1.8 +0.1 ± 0.2 1 40.2 ± 5.0 45.0 ± 4.4 46.8 ± 4.2 47.5 ± 3.8 +6.5 ± 2.3 1 4.6 ± 0.4 3.8 ± 0.3 3.2 ± 0.3 2.7 ± 0.2 -1.9 ± 0.4 1 1 Indicates statistically significant difference compared to other groups ( P BMI: Body mass index; PINI: Prognostic Inflammatory and Nutritional Index.  Serum albumin: Serum albumin at 1 year: (1) Low-risk: 44.2 ± 3.9 g/L; (2) Moderate-risk: 45.3 ± 4.3 g/L; and (3) High-risk: 47.5 ± 3.8 g/L ( P 3  PINI score improvement: P 3 Psychological well-being (SAS and SDS) Anxiety and depression scores (SAS and SDS) decreased significantly over time in all groups ( P P P 4 Table 4 Time-course of Self-Rating Anxiety Scale and Self-Rating Depression Scale scores across risk groups Group Pre-op SAS 1W 1M 1Y SAS Δ Pre-op SDS 1W 1M 1Y SDS Δ Low-risk 46.2 ± 8.3 44.5 ± 7.8 42.7 ± 7.1 40.9 ± 6.8 -5.3 ± 2.2 45.8 ± 7.9 43.9 ± 7.5 41.6 ± 7.0 39.8 ± 7.3 -6.0 ± 2.4 Moderate-risk 48.4 ± 9.0 45.9 ± 8.7 43.8 ± 8.4 41.1 ± 7.9 -7.3 ± 2.6 47.5 ± 8.6 44.5 ± 8.3 42.1 ± 7.9 38.9 ± 7.7 -8.6 ± 2.9 High-risk 50.1 ± 9.5 44.3 ± 8.2 39.6 ± 7.2 37.2 ± 6.4 -12.9 ± 3.1 1 49.9 ± 9.3 44.1 ± 8.1 39.3 ± 7.5 35.6 ± 6.1 -12.6 ± 4.2 1 1 Indicates statistically significant difference compared to other groups ( P SAS: Self-Rating Anxiety Scale; SDS: Self-Rating Depression Scale. Pain scores (VAS) Postoperative pain intensity decreased significantly in all groups. The high-risk group reported the greatest reduction in VAS scores at 1 year, suggesting an anti-inflammatory effect. VAS scores at 1 year: (1) Low-risk: 3.2 ± 1.5; (2) Moderate-risk: 2.9 ± 1.4; and (3) High-risk: 2.1 ± 1.3 ( P 5 Table 5 Pain levels (Visual Analog Scale scores)  Group  Pre-op VAS  1 week post-op  1 month post-op  1 year post-op  Improvement  Statistic   P Low-risk 6.9 ± 2.3 5.1 ± 2.0 3.9 ± 1.8 3.2 ± 1.5 -3.7 ± 1.3 F = 10.87 0.028 Moderate-risk 7.2 ± 2.5 5.3 ± 2.1 3.7 ± 1.9 2.9 ± 1.4 -4.3 ± 1.5 F = 11.45 0.014 High-risk 7.5 ± 2.6 4.8 ± 1.9 3.2 ± 1.6 2.1 ± 1.3 -5.4 ± 1.6 1 F = 13.78 < 0.001 1 Indicates statistically significant difference compared to other groups ( P Lower scores indicate less pain. P Quality of life (EORTC QLQ-C30) All groups reported improvement in quality of life over time. The high-risk group showed the most significant gains. QLQ-C30 global score at 1 year: (1) Low-risk: 75.0 ± 7.6; (2) Moderate-risk: 73.8 ± 6.9; and (3) High-risk: 78.2 ± 8.0 ( P 6 Table 6 Quality of life (EORTC QLQ-C30 scores)  Group  Pre-op QOL  1 week post-op  1 month post-op  1 year post-op  Improvement  Statistic   P Low-risk 58.7 ± 11.1 64.3 ± 10.4 70.1 ± 8.9 75.0 ± 7.6 16.3 ± 4.8 F = 7.86 0.031 Moderate-risk 53.5 ± 9.2 62.4 ± 8.3 67.2 ± 7.4 73.8 ± 6.9 20.3 ± 5.1 F = 10.13 0.012 High-risk 49.8 ± 13.0 63.5 ± 10.5 71.1 ± 8.9 78.2 ± 8.0 28.4 ± 6.3 1 F = 15.49 < 0.001 1 Indicates statistically significant difference compared to other groups ( P Higher scores indicate better quality of life. P Postoperative outcomes  Complication rates: P 7 Table 7 Postoperative complications & prognosis  Group  Complication rate  Mean hospital stay (days)  6-month survival rate  1-year survival rate  Statistic   P Low-risk 10.0% (7/65) 12.3 ± 3.1 96.7% (63/65) 93.8% (61/65)  χ 0.004 Moderate-risk 16.7% (11/65) 11.2 ± 2.9 93.3% (61/65) 90.2% (59/65) F = 6.89 0.003 High-risk 3.3% (2/65) 9.8 ± 2.4 100% (65/65) 98.5% (64/65)  χ 0.192 Complication rates are presented as percentages. Hospital stay is reported as mean ± SD (days). Survival rates are presented as percentages. P  Length of hospital stay: P As shown in Table 7  Survival outcomes: P P 7 Correlation analysis Pearson correlation analysis demonstrated strong associations between improvements in PINI and key recovery parameters (Table 8 vs r P vs r P vs r P vs r P vs R P Table 8 Correlation analysis between Prognostic Inflammatory and Nutritional Index score improvement and recovery outcomes  Variable  Pearson correlation coefficient (r)   P  Interpretation PSQI score improvement 0.68 < 0.01 Better sleep quality SAS score reduction 0.65 < 0.01 Lower anxiety levels SDS score reduction 0.61 < 0.01 Reduced depressive symptoms EORTC QLQ-C30 improvement 0.72 < 0.01 Better quality of life Postoperative complication rate -0.59 < 0.01 Lower risk of postoperative complications Pearson correlation coefficients ( r P These results further support the central hypothesis that PINI-based graded nutritional support enhances not only physiological recovery, but also psychological and functional outcomes following gastrectomy. DISCUSSION This study systematically evaluated the long-term efficacy of PINI-based graded nutritional support in patients undergoing radical gastrectomy. The results demonstrated that individualized nutritional interventions significantly improved sleep quality, nutritional status, psychological well-being, pain management, and quality of life, particularly in high-risk patients with elevated preoperative PINI scores. These findings highlight the critical role of immune-enhancing nutrition in optimizing postoperative recovery and long-term outcomes. Clinical significance of PINI-based graded nutritional support This study is among the first to integrate PINI-based risk stratification into perioperative nutritional management for gastric cancer patients undergoing radical gastrectomy. Unlike conventional nutritional interventions that apply uniform protocols, this graded approach tailors nutritional support based on individualized immune-nutritional status, optimizing postoperative recovery and long-term outcomes. Our findings demonstrated that high-risk patients (PINI > 3) receiving immune-enhancing nutrition experienced the most significant improvements in multiple domains, including nutritional status (BMI, albumin levels, PINI scores), complication rates, sleep quality, and psychological well-being. This aligns with prior research suggesting that perioperative immune-enhancing nutrition modulates inflammatory responses and enhances metabolic recovery[ 17 18 Additionally, the high-risk group exhibited the highest 1-year survival rate (98.5%), suggesting that targeted nutritional interventions may offer long-term benefits beyond the immediate postoperative period. Previous studies have indicated that perioperative immune-nutrition may improve long-term oncologic outcomes by modulating systemic inflammation and metabolic stress[ 19 20 Mechanisms underlying improved sleep quality Postoperative sleep disturbances are common in gastric cancer patients due to surgical stress, systemic inflammation, and psychological distress[ 21  Modulation of systemic inflammation: e.g. 22 23  Energy metabolism and fatigue reduction: 24  Psychological stress reduction: r r P 25 These findings reinforce the importance of targeted nutritional support in addressing postoperative sleep dysfunction, a key factor influencing overall recovery and quality of life. The role of immune-enhancing nutrition in reducing complications Postoperative complications such as infections, thrombosis, and impaired wound healing are closely linked to nutritional and immune status. In this study, the high-risk group exhibited the lowest complication rate (3.3%), despite having the poorest preoperative nutritional status ( P These findings are consistent with prior studies demonstrating that perioperative immune-enhancing nutrition reduces surgical complications[ 4 26 27 28 29 30 These findings underscore the importance of proactive nutritional interventions in reducing postoperative morbidity, particularly for high-risk patients with compromised immune function. Psychological recovery and pain management This study confirmed that immune-enhancing nutrition contributes to significant improvements in anxiety (SAS), depression (SDS), and pain management (VAS scores). (1) High-risk patients experienced the greatest reductions in SAS (-12.9 ± 3.1, P P P r P r P These results align with research indicating that malnutrition exacerbates psychological distress, while adequate nutrition stabilizes neuroendocrine function[ 31 Furthermore, nutritional support may enhance endogenous opioid release and modulate pain perception, explaining the greater reduction in VAS scores among high-risk patients[ 32 Multidimensional improvement in quality of life and postoperative recovery Postoperative quality of life (QOL) is a key determinant of long-term recovery in gastric cancer patients. The findings from this study demonstrate that patients receiving immune-enhancing nutrition (high-risk group) experienced the greatest improvements across multiple dimensions of the EORTC QLQ-C30 scores, particularly in physical, emotional, and role functioning domains[ 4 25  Multitargeted benefits of immune nutrition: 33 34 35 36  Reduction in complication burden: 8 37 r P 38  Positive feedback loop between psychological and physiological recovery: r P 39 40 These findings align with previous research indicating that perioperative nutrition plays a fundamental role in long-term patient-centered outcomes[ 41 A key limitation of the present study is that we did not longitudinally measure additional inflammatory biomarkers, such as IL-6, TNF-α, or high-sensitivity C-reactive protein, beyond the components of the PINI index. This was due to financial and logistical constraints during the study period. Although PINI provides an integrative estimate of systemic inflammation and nutritional status, the lack of comprehensive inflammatory profiling limits mechanistic interpretation. Future studies should incorporate dynamic measurements of immune and inflammatory markers to better elucidate the underlying biological effects of targeted nutritional interventions. Positive effects of graded nutritional support on postoperative prognosis Although no statistically significant differences were observed in 6-month survival rates among the three groups, the high-risk group demonstrated superior short-term recovery outcomes, including shorter hospital stays, lower postoperative complication rates, and improved functional recovery. These early postoperative benefits suggest that graded nutritional support may contribute to long-term survival advantages by optimizing the early recovery phase[ 42 43 Acceleration of early postoperative recovery: The high-risk group had the shortest hospital stay (9.8 ± 2.4 days) compared to the moderate-risk (11.2 ± 2.9 days) and low-risk groups (12.3 ± 3.1 days, P 44 vs P 45 46  Reduction in postoperative metabolic and immune dysregulation: 2 vs 2 P vs P 4 47  Potential long-term survival benefits: P 4 Although the 1-year survival rate was notably improved in the high-risk group receiving immune-enhancing nutrition, this finding should be interpreted with caution. Patients in this group had worse baseline nutritional and inflammatory status, and despite statistical adjustment, residual confounding cannot be fully excluded. Moreover, the follow-up period was relatively short, and survival estimates should be considered preliminary. This result is therefore hypothesis-generating rather than confirmatory, and future studies with larger sample sizes and extended follow-up are needed to validate the long-term survival benefits of risk-stratified nutritional interventions.  Implications for long-term prognosis and future research: 48 49 In summary, although immediate postoperative survival rates were comparable across groups, the superior early recovery, lower complication rates, and improved metabolic stability observed in the high-risk group suggest that PINI-based nutritional interventions may contribute to long-term survival benefits. However, further large-scale, multi-center trials with longer follow-up are needed to validate these findings. From a practical perspective, the implementation of immune-enhancing nutritional support raises important considerations. These specialized formulas—such as those enriched with glutamine, arginine, and omega-3 fatty acids—are often more costly and less widely available than standard nutritional options. However, their selective use in high-risk patients may represent a cost-effective strategy, as improved nutritional and immunological recovery may help reduce postoperative complications, shorten hospital stay, and improve long-term outcomes. Accessibility and cost should be weighed against clinical benefits, and future studies incorporating formal cost-effectiveness analyses are warranted. Justification for the absence of a non-intervention control group This study did not include a non-intervention control group due to ethical and clinical considerations: (1) Withholding perioperative nutrition in gastric cancer patients would be unethical, given its well-established benefits in reducing complications and improving recovery[ 4 50 51 To account for potential biases, multivariable regression analysis was performed to adjust for confounding variables, ensuring the robustness of findings. Strengths, limitations, and future directions While this study provides compelling evidence supporting PINI-based graded nutritional support, several limitations should be acknowledged, along with directions for future research.  Strengths of this study:  Limitations: e.g.  Future directions: e.g. CONCLUSION This randomized trial provides compelling evidence that PINI-guided graded nutritional support improves postoperative recovery following radical gastrectomy, especially in high-risk patients. By integrating immune-enhancing nutrition, patients achieved better physical, psychological, and functional outcomes, including lower complication rates, reduced hospital stay, and improved 1-year survival. These findings support incorporating PINI-guided nutritional protocols into routine perioperative care to enhance oncologic and functional outcomes in gastric cancer. Future work should focus on extending survival analysis, cost-benefit evaluation, and biomarker-driven strategies to advance the field of precision perioperative nutrition.  Institutional review board statement:  Clinical trial registration statement:  Informed consent statement:  Conflict-of-interest statement:  CONSORT 2010 statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J Clin 2021 71 209 249 33538338 10.3322/caac.21660 2 Smyth EC Nilsson M Grabsch HI van Grieken NC Lordick F Gastric cancer Lancet 2020 396 635 648 32861308 10.1016/S0140-6736(20)31288-5 3 Van Cutsem E Sagaert X Topal B Haustermans K Prenen H Gastric cancer Lancet 2016 388 2654 2664 27156933 10.1016/S0140-6736(16)30354-3 4 Ludwig RB Paludo J Fernandes D Scherer F Lesser time of preoperative fasting and early postoperative feeding are safe? Arq Bras Cir Dig 2013 26 54 58 23702872 10.1590/s0102-67202013000100012 5 Cederholm T Jensen GL Correia MITD Gonzalez MC Fukushima R Higashiguchi T Baptista G Barazzoni R Blaauw R Coats A Crivelli A Evans DC Gramlich L Fuchs-Tarlovsky V Keller H Llido L Malone A Mogensen KM Morley JE Muscaritoli M Nyulasi I Pirlich M Pisprasert V de van der Schueren MAE Siltharm S Singer P Tappenden K Velasco N Waitzberg D Yamwong P Yu J Van Gossum A Compher C GLIM Core Leadership Committee GLIM Working Group GLIM criteria for the diagnosis of malnutrition - A consensus report from the global clinical nutrition community Clin Nutr 2019 38 1 9 30181091 10.1016/j.clnu.2018.08.002 6 Cashin AG McAuley JH Clinimetrics: Physiotherapy Evidence Database (PEDro) Scale J Physiother 2020 66 59 31521549 10.1016/j.jphys.2019.08.005 7 Lobo DN Gianotti L Adiamah A Barazzoni R Deutz NEP Dhatariya K Greenhaff PL Hiesmayr M Hjort Jakobsen D Klek S Krznaric Z Ljungqvist O McMillan DC Rollins KE Panisic Sekeljic M Skipworth RJE Stanga Z Stockley A Stockley R Weimann A Perioperative nutrition: Recommendations from the ESPEN expert group Clin Nutr 2020 39 3211 3227 32362485 10.1016/j.clnu.2020.03.038 8 Ma M Zheng Z Zeng Z Li J Ye X Kang W Perioperative Enteral Immunonutrition Support for the Immune Function and Intestinal Mucosal Barrier in Gastric Cancer Patients Undergoing Gastrectomy: A Prospective Randomized Controlled Study Nutrients 2023 15 4566 37960219 10.3390/nu15214566 PMC10647624 9 Aviram M Rosenblat M Gaitini D Nitecki S Hoffman A Dornfeld L Volkova N Presser D Attias J Liker H Hayek T Pomegranate juice consumption for 3 years by patients with carotid artery stenosis reduces common carotid intima-media thickness, blood pressure and LDL oxidation Clin Nutr 2004 23 423 433 15158307 10.1016/j.clnu.2003.10.002 10 Braga M Ljungqvist O Soeters P Fearon K Weimann A Bozzetti F ESPEN ESPEN Guidelines on Parenteral Nutrition: surgery Clin Nutr 2009 28 378 386 19464088 10.1016/j.clnu.2009.04.002 11 Buysse DJ Reynolds CF 3rd Monk TH Berman SR Kupfer DJ The Pittsburgh Sleep Quality Index: a new instrument for psychiatric practice and research Psychiatry Res 1989 28 193 213 2748771 10.1016/0165-1781(89)90047-4 12 Kanda M Fujii T Kodera Y Nagai S Takeda S Nakao A Nutritional predictors of postoperative outcome in pancreatic cancer Br J Surg 2011 98 268 274 20960457 10.1002/bjs.7305 13 Zung WW A rating instrument for anxiety disorders Psychosomatics 1971 12 371 379 5172928 10.1016/S0033-3182(71)71479-0 14 ZUNG WW A SELF-RATING DEPRESSION SCALE Arch Gen Psychiatry 1965 12 63 70 14221692 10.1001/archpsyc.1965.01720310065008 15 Diop JPD Diallo RN Bourdon-Huguenin V Dem A Diouf D Dieng MM Ba SA Dia Y Ka S Mbengue B Thiam A Faye O Diop PA Sobol H Dieye A Novel BRCA2 pathogenic variant c.5219 T > G; p.(Leu1740Ter) in a consanguineous Senegalese family with hereditary breast cancer BMC Med Genet 2019 20 73 31060517 10.1186/s12881-019-0814-y PMC6501405 16 Aaronson NK Ahmedzai S Bergman B Bullinger M Cull A Duez NJ Filiberti A Flechtner H Fleishman SB de Haes JC The European Organization for Research and Treatment of Cancer QLQ-C30: a quality-of-life instrument for use in international clinical trials in oncology J Natl Cancer Inst 1993 85 365 376 8433390 10.1093/jnci/85.5.365 17 Wang HX Wang CC Yang W Gao LL Yu SQ Prognostic value of preoperative prognostic nutritional index in stage III gastric cancer after curative resection: a retrospective cohort study Asia Pac J Clin Nutr 2018 27 540 545 29737800 10.6133/apjcn.072017.03 18 Hasegawa T Yatagai N Furukawa T Wakui E Saito I Takeda D Kakei Y Sakakibara A Nibu KI Akashi M The prospective evaluation and risk factors of dysphagia after surgery in patients with oral cancer J Otolaryngol Head Neck Surg 2021 50 4 33494830 10.1186/s40463-020-00479-6 PMC7830751 19 Yang Y Gao P Song Y Sun J Chen X Zhao J Ma B Wang Z The prognostic nutritional index is a predictive indicator of prognosis and postoperative complications in gastric cancer: A meta-analysis Eur J Surg Oncol 2016 42 1176 1182 27293109 10.1016/j.ejso.2016.05.029 20 Sun K Chen S Xu J Li G He Y The prognostic significance of the prognostic nutritional index in cancer: a systematic review and meta-analysis J Cancer Res Clin Oncol 2014 140 1537 1549 24878931 10.1007/s00432-014-1714-3 PMC11823704 21 Antunes FP Costa Mda C Paim JS Vieira-da-Silva LM Cruz AA Natividade M Barreto ML [Social inequalities in spatial distribution of hospital admissions due to respiratory diseases] Cad Saude Publica 2013 29 1346 1356 23843002 10.1590/s0102-311x2013000700009 22 Imaralu JO Ani IF Onuoha CE Grillo EO Oguntade FA Nwankpa CC A Five-Year Review of Laparoscopic Gynaecological Surgeries in a Private-Owned Teaching Hospital, in Nigeria West Afr J Med 2022 39 111 118 35277953 23 Song GM Tian X Liang H Yi LJ Zhou JG Zeng Z Shuai T Ou YX Zhang L Wang Y Role of Enteral Immunonutrition in Patients Undergoing Surgery for Gastric Cancer: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Medicine (Baltimore) 2015 94 e1311 26252314 10.1097/MD.0000000000001311 PMC4616579 24 Zhang X Yang L Hou L Liu J Zhu H Zhang J Effect of a psychological nursing intervention on quality of life and cognitive function in patients with gastric carcinoma: A randomised controlled trial Eur J Cancer Care (Engl) 2020 29 e13292 32666638 10.1111/ecc.13292 25 Zhang X Chen X Yang J Hu Y Li K Effects of nutritional support on the clinical outcomes of well-nourished patients with cancer: a meta-analysis Eur J Clin Nutr 2020 74 1389 1400 32203230 10.1038/s41430-020-0595-6 26 Zhang L Liu X Tong F Zou R Peng W Yang H Liu F Yang D Huang X Yi L Wen M Jiang L Cognitive behavioral therapy for anxiety and depression in cancer survivors: a meta-analysis Sci Rep 2022 12 21466 36509786 10.1038/s41598-022-25068-7 PMC9744858 27 Odom MJ Grace KA Brigido MK Theyyunni NR Kessler RA Greineder CF Shoulder Pseudodislocation Associated with Calcific Tendinitis/Bursitis and Diagnosed by Point of Care Ultrasound J Emerg Med 2020 58 72 76 31677978 10.1016/j.jemermed.2019.08.051 PMC7190407 28 Zhang X Wang H Zhang Y Liu Y Wang Z Du Q Xie C Danggui Sini decoction for treating diabetic peripheral neuropathy: A protocol of systematic review and meta-analysis of randomized controlled trials Medicine (Baltimore) 2020 99 e20482 32481353 10.1097/MD.0000000000020482 PMC7249906 29 Marano L Porfidia R Pezzella M Grassia M Petrillo M Esposito G Braccio B Gallo P Boccardi V Cosenza A Izzo G Di Martino N Clinical and immunological impact of early postoperative enteral immunonutrition after total gastrectomy in gastric cancer patients: a prospective randomized study Ann Surg Oncol 2013 20 3912 3918 23838912 10.1245/s10434-013-3088-1 30 Silver JK Baima J Cancer prehabilitation: an opportunity to decrease treatment-related morbidity, increase cancer treatment options, and improve physical and psychological health outcomes Am J Phys Med Rehabil 2013 92 715 727 23756434 10.1097/PHM.0b013e31829b4afe 31 Jiang N Deng JY Ding XW Ke B Liu N Zhang RP Liang H Prognostic nutritional index predicts postoperative complications and long-term outcomes of gastric cancer World J Gastroenterol 2014 20 10537 10544 25132773 10.3748/wjg.v20.i30.10537 PMC4130864 32 Burghardt J Beutel ME Hasenburg A Schmutzer G Brähler E Declining Sexual Activity and Desire in Women: Findings from Representative German Surveys 2005 and 2016 Arch Sex Behav 2020 49 919 925 31802290 10.1007/s10508-019-01525-9 33 Osland E Hossain MB Khan S Memon MA Effect of timing of pharmaconutrition (immunonutrition) administration on outcomes of elective surgery for gastrointestinal malignancies: a systematic review and meta-analysis JPEN J Parenter Enteral Nutr 2014 38 53 69 23411423 10.1177/0148607112474825 34 Matsui R Sagawa M Inaki N Fukunaga T Nunobe S Impact of Perioperative Immunonutrition on Postoperative Outcomes in Patients with Upper Gastrointestinal Cancer: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Nutrients 2024 16 577 38474706 10.3390/nu16050577 PMC10933766 35 Wang G Pan S The impact of sleep interventions combined with enhanced nutritional support on sleep quality, nutritional status, pain management, psychological well-being, and quality of life in postoperative colon cancer patients J Cancer Res Clin Oncol 2025 151 50 39869202 10.1007/s00432-025-06093-1 PMC11772530 36 Zhao H Liu C Ruan G Zheng X Chen Y Lin S Liu X Shi J Li X Li S Shi H The quality of life impacting factors in malnourished patients with gastric cancer Front Oncol 2024 14 1336859 38725631 10.3389/fonc.2024.1336859 PMC11079278 37 Li Y Bi X Zhao J Huang Z Zhou J Li Z Zhang Y Li M Chen X Hu X Chi Y Zhao D Zhao H Cai J CEA Level, Radical Surgery, CD56 and CgA Expression Are Prognostic Factors for Patients With Locoregional Gastrin-Independent GNET Medicine (Baltimore) 2016 95 e3567 27149478 10.1097/MD.0000000000003567 PMC4863795 38 Fujitani K Tsujinaka T Fujita J Miyashiro I Imamura H Kimura Y Kobayashi K Kurokawa Y Shimokawa T Furukawa H Osaka Gastrointestinal Cancer Chemotherapy Study Group Prospective randomized trial of preoperative enteral immunonutrition followed by elective total gastrectomy for gastric cancer Br J Surg 2012 99 621 629 22367794 10.1002/bjs.8706 39 Sasahara M Kanda M Ito S Mochizuki Y Teramoto H Ishigure K Murai T Asada T Ishiyama A Matsushita H Tanaka C Kobayashi D Fujiwara M Murotani K Kodera Y The Preoperative Prognostic Nutritional Index Predicts Short-Term and Long-Term Outcomes of Patients with Stage II/III Gastric Cancer: Analysis of a Multi-Institution Dataset Dig Surg 2020 37 135 144 30840952 10.1159/000497454 40 Oh HM Son CG The Risk of Psychological Stress on Cancer Recurrence: A Systematic Review Cancers (Basel) 2021 13 5816 34830968 10.3390/cancers13225816 PMC8616395 41 August DA Huhmann MB American Society for Parenteral and Enteral Nutrition (A S.P.E.N.) Board of Directors. A.S.P.E.N. clinical guidelines: nutrition support therapy during adult anticancer treatment and in hematopoietic cell transplantation JPEN J Parenter Enteral Nutr 2009 33 472 500 19713551 10.1177/0148607109341804 42 Braga M Gianotti L Vignali A Cestari A Bisagni P Di Carlo V Artificial nutrition after major abdominal surgery: impact of route of administration and composition of the diet Crit Care Med 1998 26 24 30 9428539 10.1097/00003246-199801000-00012 43 Rou WS Lee BS Moon HS Lee ES Kim SH Lee HY Risk factors and therapeutic results of early local recurrence after transcatheter arterial chemoembolization World J Gastroenterol 2014 20 6995 7004 24944494 10.3748/wjg.v20.i22.6995 PMC4051943 44 Wang G Zhang Q Pan S Investigation of negative emotions and sleep quality in gastric cancer patients and intervention strategies Front Neurol 2025 16 1536736 40343181 10.3389/fneur.2025.1536736 PMC12060187 45 Gianotti L Braga M Nespoli L Radaelli G Beneduce A Di Carlo V A randomized controlled trial of preoperative oral supplementation with a specialized diet in patients with gastrointestinal cancer Gastroenterology 2002 122 1763 1770 12055582 10.1053/gast.2002.33587 46 Matsui R Sagawa M Sano A Sakai M Hiraoka SI Tabei I Imai T Matsumoto H Onogawa S Sonoi N Nagata S Ogawa R Wakiyama S Miyazaki Y Kumagai K Tsutsumi R Okabayashi T Uneno Y Higashibeppu N Kotani J Impact of Perioperative Immunonutrition on Postoperative Outcomes for Patients Undergoing Head and Neck or Gastrointestinal Cancer Surgeries: A Systematic Review and Meta-analysis of Randomized Controlled Trials Ann Surg 2024 279 419 428 37882375 10.1097/SLA.0000000000006116 PMC10829905 47 de Tapia B Bonnin M Valles C Mozas C Herrera D Sanz M Nart J Clinical outcomes and associated factors in the treatment of peri-implant mucositis, combining mechanical debridement and prosthesis modification: A 30-month follow-up prospective case series J Clin Periodontol 2022 49 1357 1365 36054620 10.1111/jcpe.13711 PMC9805102 48 Calder PC Immunonutrition in surgical and critically ill patients Br J Nutr 2007 98 Suppl 1 S133 S139 17922951 10.1017/S0007114507832909 49 Khin NA Yang P Hung HM Maung-U K Chen YF Meeker-O'Connell A Okwesili P Yasuda SU Ball LK Huang SM O'Neill RT Temple R Regulatory and scientific issues regarding use of foreign data in support of new drug applications in the United States: an FDA perspective Clin Pharmacol Ther 2013 94 230 242 23588316 10.1038/clpt.2013.70 50 Jie B Jiang ZM Nolan MT Efron DT Zhu SN Yu K Kondrup J Impact of nutritional support on clinical outcome in patients at nutritional risk: a multicenter, prospective cohort study in Baltimore and Beijing teaching hospitals Nutrition 2010 26 1088 1093 19963351 10.1016/j.nut.2009.08.027 51 Bozzetti F Braga M Gianotti L Gavazzi C Mariani L Postoperative enteral versus parenteral nutrition in malnourished patients with gastrointestinal cancer: a randomised multicentre trial Lancet 2001 358 1487 1492 11705560 10.1016/S0140-6736(01)06578-3 Data sharing statement This study provides all safe and available data, and all data generated or analyzed during this study are included in this published article. ",
  "metadata": {
    "Title of this paper": "Postoperative enteral versus parenteral nutrition in malnourished patients with gastrointestinal cancer: a randomised multicentre trial",
    "Journal it was published in:": "World Journal of Clinical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476597/"
  }
}