{
  "title": "Paper_18",
  "abstract": "pmc Future Oncol Future Oncol 3069 futoncol Future Oncology 1479-6694 1744-8301 Taylor & Francis PMC12490348 PMC12490348.1 12490348 12490348 40951934 10.1080/14796694.2025.2550930 2550930 1 Version of Record Plain Language Summary Plain Language Summary of Publication Plain language summary of a systematic review of palbociclib treatment for advanced/ metastatic breast cancer in older patients Brain, Chen, Simon and co-authors Plain Language Summary of Publication Brain Etienne  a Chen Connie  b Simon Sofia  c Pasupuleti Vinay  d Vieira Pfitzer Kathleen  e Gelmon Karen A.  f a b c d e f 15 9 2025 2025 21 23 498190 2955 2968 15 09 2025 03 10 2025 03 10 2025 Integra 27 11 2024 Integra 27 11 2024 01 4 2025 19 8 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives License ( http://creativecommons.org/licenses/by-nc-nd/4.0/ Palbociclib in Older Patients with Advanced/Metastatic Breast Cancer: A Systematic Review 19 3 28 3 2024 303 320 Targeted Oncology 10.1007/s11523-024-01046-z PMC11111485 38546943 Plain Language Summary What is this summary about? This plain language summary is about a systematic review of articles that reported on palbociclib What were the key findings of the systematic review? A total of 52 articles were summarized in the review: 13 articles reported on 7 different randomized clinical trials that included 437 older patients who received palbociclib plus endocrine therapy. The other 39 articles reported on 37 different real-world studies that included 7408 older patients treated with palbociclib plus endocrine therapy. In studies that compared how well palbociclib works in older and younger patients, palbociclib plus endocrine therapy showed similar benefits in both age groups. These benefits included how long a person is alive after the start of palbociclib combination treatment without their cancer getting worse (also called progression-free survival), how long a person is alive after the start of treatment (also called overall survival), and how many people had tumors that were no longer detectable or became smaller or did not grow (also called tumor response rate and clinical benefit rate). The studies that described safety and health-related quality of life as reported by the patients showed that palbociclib plus endocrine therapy was well tolerated and maintained health-related quality of life in both older and younger patients. These study findings were the same in both the clinical trials and the real-world studies. What do the findings of the systematic review mean? This systematic review is the most thorough summary to date on the use of palbociclib plus endocrine therapy to treat HR+/HER2− advanced/metastatic breast cancer in older patients. The systematic review summarizes the findings of 52 articles that provide evidence that palbociclib in combination with endocrine therapy is an effective and well tolerated treatment and preserves health-related quality of life in older patients with HR+/HER2− advanced/metastatic breast cancer. Consistent palbociclib treatment benefits were seen in both older and younger patients in clinical trials and real-world studies, lending further support for the use of palbociclib in combination with endocrine therapy in older patients with HR+/HER2− advanced/metastatic breast cancer. This is an abstract of the Plain Language Summary of Publication article. View the full Plain Language Summary PDF pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Acknowledgements The authors would like to thank all the people who contributed to the information collected in this systematic review. Disclosure statement Etienne Brain has served as a consultant/advisor for Daiichi Sankyo, Menarini, Pfizer Inc., and Sandoz; has received honoraria from Pfizer Inc., Eli Lilly, Incyte, and Seagen; has received travel support from Gilead, Pfizer Inc., AstraZeneca, and Novartis; and served on an advisory board for Daiichi Sankyo. Connie Chen and Sofia Simon are employees of Pfizer Inc. Vinay Pasupuleti is an employee of Oxford PharmaGenesis Inc. Kathleen Vieira Pfitzer has no conflicts of interest to disclose. Karen A. Gelmon has served on an advisory board for Pfizer Inc, Novartis, Eli Lilly, Merck, Gilead, Seagen, AstraZeneca, and City of Hope. The authors have no other relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript apart from those disclosed. Medical writing support was provided by Melissa Lingohr-Smith, PhD, of Oxford PharmaGenesis Inc., Wilmington, DE, USA, according to Good Publication Practice guidelines (GPP 2022), and was funded by Pfizer Inc. Patient reviewers on this PLSP have received honorarium from Future Oncology Peer reviewers on this manuscript have no relevant financial or other relationships to disclose. Funding This manuscript was funded by Pfizer Inc. ",
  "metadata": {
    "Title of this paper": "Palbociclib in Older Patients with Advanced/Metastatic Breast Cancer: A Systematic Review",
    "Journal it was published in:": "Future Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490348/"
  }
}