{
  "title": "Paper_226",
  "abstract": "pmc BMC Musculoskelet Disord BMC Musculoskelet Disord 46 bmcmudis BMC Musculoskeletal Disorders 1471-2474 BMC PMC12487136 PMC12487136.1 12487136 12487136 41034770 10.1186/s12891-025-09185-8 9185 1 Research Comparative analysis of surgically treated degenerative cervical and lumbar spine diseases using multiple clinical aging indices Kurihara Ryosuke 1 Akaike Yuki 1 2 Michikawa Takehiro 3 Tobe Takao 4 Tobe Risa 5 Kawabata Soya 1 Nagai Sota 1 Imai Takaya 1 Takeda Hiroki 6 Kaneko Shinjiro 6 Yamada Shigeki 4 5 Fujita Nobuyuki nfujita2007@gmail.com 1 7 1 https://ror.org/046f6cx68 grid.256115.4 0000 0004 1761 798X Department of Orthopaedic Surgery, School of Medicine, Fujita Health University, 2 https://ror.org/02kn6nx58 grid.26091.3c 0000 0004 1936 9959 Department of Orthopaedic Surgery, Keio University School of Medicine, 3 https://ror.org/02hcx7n63 grid.265050.4 0000 0000 9290 9879 Department of Environmental and Occupational Health, School of Medicine, Toho University, 4 https://ror.org/046f6cx68 grid.256115.4 0000 0004 1761 798X Department of Pharmacotherapeutics and Informatics School of Medicine, Fujita Health University, 5 https://ror.org/02r3zks97 grid.471500.7 0000 0004 0649 1576 Department of Clinical Pharmacy, Fujita Health University Hospital, 6 https://ror.org/046f6cx68 grid.256115.4 0000 0004 1761 798X Department of Spine and Spinal Cord Surgery, School of Medicine, Fujita Health University, 7 https://ror.org/046f6cx68 grid.256115.4 0000 0004 1761 798X Department of Orthopaedic Surgery, Fujita Health University, 1 10 2025 2025 26 478161 902 5 7 2024 3 9 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background The prevalence of degenerative spine diseases has continued to rise with the aging of the global population. Despite the availability of various aging indices, limited studies have comprehensively investigated degenerative spine diseases from the perspective of aging. This study aimed to evaluate degenerative cervical and lumbar diseases surgically treated using multiple clinical aging indices and elucidate the characteristics of each condition through comparative analysis. Methods Clinical data of consecutive patients aged ≥ 65 years who underwent surgery for degenerative cervical and lumbar diseases were retrospectively collected. Frailty was assessed using the 11-point modified frailty index. Locomotive syndrome stage was determined based on the 25-Question Geriatric Locomotive Function Scale. Functional decline was assessed according to the Kihon Checklist. Polypharmacy was defined based on a cutoff of six drugs. A total of 19 categories were considered potentially inappropriate medications. Results Among the included patients, 313 and 103 had degenerative lumbar (L group) and degenerative cervical (C group) diseases, respectively. The C group had significantly lower serum albumin levels ( p p p p p p p p Conclusions Across various indices of aging, patients with degenerative cervical spine disease showed more significant progression than those with lumbar spine disease. Thorough understanding of these characteristics is essential when managing degenerative spine diseases, particularly in the selection of effective treatment approaches for the increasingly aging society in the future. Supplementary Information The online version contains supplementary material available at 10.1186/s12891-025-09185-8. Keywords Frailty Locomotive syndrome Polypharmacy Potentially inappropriate medication Degenerative spine disease pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background With the aging of the global population, the prevalence of degenerative spine diseases has continued to rise [ 1 3 4 7 4 8 9 5 6 4 Frailty and sarcopenia are commonly used as clinical indices of aging among older adults [ 10 11 12 13 13 14 15 16 17 Methods Subjects Clinical data of consecutive patients aged ≥ 65 years who underwent surgery for degenerative cervical and lumbar spine diseases at a single acute care hospital between April 2020 and May 2023 were retrospectively collected. Those who underwent surgery for spinal deformity and ossification of posterior longitudinal ligament (OPLL) were excluded (Fig. 1 Ethics approval and consent to participate This study was approved by the institutional ethics committee. Informed consent was obtained through the opt-out method. All study methods were conducted in accordance with the principles stated in the Declaration of Helsinki.  Fig. 1 Flowchart of this study Data acquisition The following data were retrieved for analysis: age; body mass index (BMI); sex; medical history (e.g., hypertension, dyslipidemia, diabetes, stroke, cardiovascular disease, and cancer); preoperatively prescribed drugs; preoperative American Society of Anesthesiologists physical status; and serum albumin levels. Functional impairment Decline in physical function, nutrition, oral function, ADLs, memory, and mood were determined based on responses to 10 questions extracted from the Kihon Checklist upon admission [ 18 Frailty Frailty was assessed using the 11-point mFI, which examines 11 factors derived from the patient’s medical records. This index was used to classify our patients into three categories: robust, score = 0; prefrailty, score < 0.21; and frailty, score >0.21 [ 19 Locomotive syndrome Locomotive syndrome stage was determined based on the total GLFS-25 score: stage 0, score ≤ 6; stage 1, score ≥ 7; stage 2, score ≥ 16; and stage 3, score ≥ 24 [ 20 Polypharmacy and PIMs Polypharmacy was defined based on a cutoff of six drugs [ 21 17 Statistical analysis Data for the two groups were compared using Student’s t-test, Fisher’s exact test, or the Mann–Whitney U test, as appropriate. To assess longitudinal changes in locomotive syndrome stage, the McNemar Bowker test was used. Statistical analyses were performed using the Statistical Package for the Social Sciences (version 29.0; IBM Inc., Armonk, NY, United States), with p values of <0.05 indicating a statistically significant difference. Results A total 313 and 103 cases with degenerative lumbar spine diseases (L group) and degenerative cervical spine diseases (C group) were analyzed, respectively (Fig. 1 1 p p p p p p 2 p 2 p p p Fig. 2 Pre- and postoperative distribution of locomotive syndrome stages in the degenerative lumbar spine disease group (L) and degenerative cervical spine disease group (C) Table 1 Comparison of baseline characteristics between two groups L group ( n C group ( n p Sex Men 165 (52.7%) Men 58 (56.3%) 0.57 Women 148 (47.3%) Women 45 (43.7%) Age (yeas) 75.9 ± 5.9 76.3 ± 5.5 0.44 BMI (kg/m2) 23.7 ± 3.4 23.1 ± 3.9 0.10 Medical history Diabetes mellitus 86 (27.5%) 35 (34.0%) 0.21 Hypertension 218 (69.6%) 67 (65.0%) 0.39 Dyslipidemia 145 (46.3%) 33(32.0%) 0.01 Cardiovascular disease 90 (28.8%) 24 (23.3%) 0.31 Stroke 43 (13.7%) 9 (8.7%) 0.23 Cancer 55 (17.6%) 8 (7.8%) 0.02 ASA 3 42 (13.4%) 10 (9.7%) 0.07 2 240 (76.4%) 76 (73.8%) 1 31 (9.9%) 17 (16.5%) 11point- Modified Frailty Index Frailty 58 (18.5%) 32 (31.1%) 0.004 Pre-frailty 173 (55.1%) 54 (52.4%) Robust 82 (26.1%) 17 (16.5%) Blood examination Albumin (g/dL) average 4.09 ± 0.38 3.99 ± 0.39 0.03 Functional impairment Physical function 114 (36.4%) 52 (50.5%) 0.02 Nutrition 10 (3.2%) 5 (4.9%) 0.54 Oral function 17 (5.4%) 5 (4.9%) 0.82 Activities of daily living 23 (7.3%) 15 (14.6%) 0.046 Memory 17 (5.4%) 9 (8.7%) 0.24 Mood 10 (3.2%) 3 (2.9%) 0.89 Student’s t-test, Fisher’s exact test, or the Mann–Whitney U test was used ASA SVA PI PT LL FBSS Table 2 Number and prevalence of cases taking potentially inappropriate medications and polypharmacy L group ( n C group ( n p Antipsychotics 2 (0.6%) 1 (1.0%) N/A Hypnotics 70 (22.4%) 23 (22.3%) 1.0 Antidepressants 6 (1.9%) 2 (1.9%) N/A Sulpiride 2 (0.6%) 0 (0%) N/A Antiparkinsonian agents 1 (0.3%) 0 (0%) N/A Corticosteroids 27 (8.6%) 6 (5.8%) 0.41 Antithrombotic drugs 65 (20.8%) 18 (17.5%) 0.57 Digitalis 0 (0%) 2 (1.9%) N/A Diuretics 17 (5.4%) 12 (11.7%) 0.04 β-blockers 3 (1.0%) 1 (1.0%) N/A α-blockers 12 (3.8%) 3 (2.9%) N/A First-generation antihistamines 0 (0%) 2 (1.9%) N/A H2-receptor antagonists 17 (5.4%) 6 (5.8%) 0.81 Antiemetic drugs 18 (5.8%) 1 (1.0%) N/A Laxatives 44 (14.1%) 12 (11.7%) 0.62 Antidiabetic drugs 52 (16.6%) 23 (22.3%) 0.24 Insulin 9 (2.9%) 3 (2.9%) N/A Overactive bladder medications 9 (2.9%) 2 (1.9%) N/A NSAIDs 101 (32.0%) 27 (26.2%) 0.27 Polypharmacy 218 (69.4%) 65 (63.1%) 0.23 Fisher`s exact test NSAIDs N/A Discussion The current study has been the first to comprehensively compare geriatric parameters among patients who underwent surgery for degenerative cervical and lumbar spine diseases. Our results indicate that cervical spine diseases were associated with more advanced frailty compared to lumbar spine diseases. Although no significant differences in locomotive syndrome stages were noted between the two conditions before surgery, postoperative improvement in locomotive syndrome was significantly poorer among those with cervical spine diseases. A comparison of the medical history revealed a significant difference in the frequency of dyslipidemia between the two groups. Moreover, patients with lumbar spine diseases tended to have a higher BMI than those with cervical spine diseases, albeit not significantly, as well as a significantly higher prevalence of dyslipidemia, suggesting a more pronounced metabolic component in the former. These findings are corresponded with previous studies documenting an association between degenerative lumbar disease and lifestyle-related diseases [ 22 24 18 25 26 Although the current study only used the GLFS-25 to assess locomotive syndrome, the preoperative distribution of locomotive syndrome stage observed herein corresponded well with those presented in previous reports for both cervical and lumbar spine diseases [ 27 28 25 27 27 29 30 From the perspective of medication prescription, no significant difference in the frequency of polypharmacy was observed between the two diseases. Among the PIMs frequently prescribed for the two conditions, the reason for the significantly higher frequency of diuretic use in cervical spine disease remains completely unclear. Considering report suggesting increased frequency of diuretic use among frail patients [ 31 17 3 8 The current study has several limitations. First, the subjects of this study were limited to surgical patients. Given that more cases receive conservative therapy than surgery for both conditions, this study cannot fully elucidate the characteristics of the two diseases. Second, the follow-up duration was only 1 year. Although it would have been preferable to observe outcomes for at least 2 years, a longer evaluation period may increase the difficultly of assessing the impact of surgery alone in clinical studies involving older patients. Third, the relatively high comorbidity rates reported for cervical and lumbar spine diseases suggest that our study population may have included patients suffering from both conditions, making the distinct differentiation between the two diseases challenging [ 32 Conclusions In conclusion, our comparison between cervical and lumbar spine diseases revealed that those with cervical spine disease exhibited more pronounced elements of frailty. Moreover, no significant differences in locomotive syndrome stages were observed between the two groups before surgery; however, those with cervical spine disease experienced inferior postoperative improvement in locomotive syndrome stage, resulting in a significantly more advanced postoperative locomotive syndrome stage among these patients. Taken together, our findings showed that patients with degenerative cervical spine diseases showed more significant progression than those with lumbar spine disease across various indices of aging. Thorough understanding of these characteristics is essential when managing degenerative spine diseases, particularly with regard to the selection of effective treatment approaches. Supplementary Information  Supplementary Material 1. Abbreviations ADL Activities of daily living mFI Modified frailty index PIMs Potentially inappropriate medications GLFS-25 25-Question Geriatric Locomotive Function Scale OPLL Ossification of posterior longitudinal ligament BMI Body mass index Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors would like to thank Ms. Satoko Okada and Ms. Yukari Kuno for their technical support. Authors’ contributions N.F. and S.Y. designed the study. R.K., Y.A., T.M., T.T., R.T., S.K. (Soya Kawabata), S.N., T.I., H. T., and S.K. (Shinjiro Kaneko) contributed to the analysis and interpretation of the data. R.K., Y.A., and T.M. performed statistical analysis. R.K. and N.F. wrote the initial draft of the manuscript. R.K., Y.A., T.M., T.T., R.T., S.K. (Soya Kawabata), S.N., T.I., H. T., S.K. (Shinjiro Kaneko), and S.Y. critically reviewed the manuscript. All authors have read and agreed to the published version of the manuscript. Funding This study received no external funding. Data availability The datasets generated and/or analyzed during the current study are not publicly available due to the limitations of ethical approval involving patient data and anonymity; however, they are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This research was approved by the Fujita Health University Ethics Committee (approval no. HM 23–354). Informed consent was waived by the Fujita Health University Ethics Committee. The Fujita Health University Ethics Committee also approved our use of the opt-out method for obtaining consent, indicating that all eligible patients were included in the present study unless they contacted us to opt out. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Kalichman L Cole R Kim DH Li L Suri P Guermazi A Spinal stenosis prevalence and association with symptoms: the Framingham study Spine J 2009 9 545 50 10.1016/j.spinee.2009.03.005 19398386 PMC3775665 Kalichman L, Cole R, Kim DH, Li L, Suri P, Guermazi A, et al. Spinal stenosis prevalence and association with symptoms: the Framingham study. Spine J. 2009;9:545–50. 19398386 10.1016/j.spinee.2009.03.005 PMC3775665 2. Yabuki S Fukumori N Takegami M Onishi Y Otani K Sekiguchi M Prevalence of lumbar spinal stenosis, using the diagnostic support tool, and correlated factors in Japan: a population-based study J Orthop Sci 2013 18 893 900 10.1007/s00776-013-0455-5 23963588 PMC3838585 Yabuki S, Fukumori N, Takegami M, Onishi Y, Otani K, Sekiguchi M, et al. Prevalence of lumbar spinal stenosis, using the diagnostic support tool, and correlated factors in Japan: a population-based study. J Orthop Sci. 2013;18:893–900. 23963588 10.1007/s00776-013-0455-5 PMC3838585 3. Badhiwala JH Ahuja CS Akbar MA Witiw CD Nassiri F Furlan JC Degenerative cervical myelopathy – update and future directions Nat Rev Neurol 2020 16 108 24 10.1038/s41582-019-0303-0 31974455 Badhiwala JH, Ahuja CS, Akbar MA, Witiw CD, Nassiri F, Furlan JC, et al. Degenerative cervical myelopathy – update and future directions. Nat Rev Neurol. 2020;16:108–24. 31974455 10.1038/s41582-019-0303-0 4. Watanabe M Chikuda H Fujiwara Y Furuya T Kanchiku T Nagoshi N Japanese orthopaedic association (JOA) clinical practice guidelines on the management of cervical spondylotic myelopathy,2020 – secondary publication J Orthop Sci 2023 28 1 45 10.1016/j.jos.2022.03.012 35618542 Watanabe M, Chikuda H, Fujiwara Y, Furuya T, Kanchiku T, Nagoshi N, et al. Japanese orthopaedic association (JOA) clinical practice guidelines on the management of cervical spondylotic myelopathy,2020 – secondary publication. J Orthop Sci. 2023;28:1–45. 35618542 10.1016/j.jos.2022.03.012 5. Kreiner DS Shaffer WO Baisden JL Gilbert TJ Summers JT Toton JF An evidence-based clinical guideline for the diagnosis and treatment of degenerative lumbar spinal stenosis (update) Spine J 2013 13 734 43 10.1016/j.spinee.2012.11.059 23830297 Kreiner DS, Shaffer WO, Baisden JL, Gilbert TJ, Summers JT, Toton JF, et al. An evidence-based clinical guideline for the diagnosis and treatment of degenerative lumbar spinal stenosis (update). Spine J. 2013;13:734–43. 23830297 10.1016/j.spinee.2012.11.059 6. Kawakami M Takeshita K Inoue G Sekiguchi M Fujiwara Y Hoshino M Japanese orthopaedic association (JOA) clinical practice guidelines on the management of lumbar spinal stenosis, 2021 – secondary publication J Orthop Sci 2023 28 46 91 10.1016/j.jos.2022.03.013 35597732 Kawakami M, Takeshita K, Inoue G, Sekiguchi M, Fujiwara Y, Hoshino M, et al. Japanese orthopaedic association (JOA) clinical practice guidelines on the management of lumbar spinal stenosis, 2021 – secondary publication. J Orthop Sci. 2023;28:46–91. 35597732 10.1016/j.jos.2022.03.013 7. Apaydin AS Güneş M Relationships between stenosis severity, functional limitation, pain, and quality of life in patients with cervical spondylotic radiculopathy Turk J Med Sci 2024 54 727 34 10.55730/1300-0144.5842 39295627 PMC11407326 Apaydin AS, Güneş M. Relationships between stenosis severity, functional limitation, pain, and quality of life in patients with cervical spondylotic radiculopathy. Turk J Med Sci. 2024;54:727–34. 39295627 10.55730/1300-0144.5842 PMC11407326 8. Lee BH Kim TH Park MS Lim S Park JO Kim HS Comparison of effects of nonoperative treatment and decompression surgery on risk of patients with lumbar spinal stenosis falling: evaluation with functional mobility tests J Bone Joint Surg Am 2014 96 13 e110 10.2106/JBJS.M.00427 24990984 Lee BH, Kim TH, Park MS, Lim S, Park JO, Kim HS, et al. Comparison of effects of nonoperative treatment and decompression surgery on risk of patients with lumbar spinal stenosis falling: evaluation with functional mobility tests. J Bone Joint Surg Am. 2014;96:e110. 24990984 10.2106/JBJS.M.00427 9. Güneş M Apaydın AS Keski NNK Investigation of lumbar multifidus muscle, pain, and fear of falling in patients with lumbar spinal stenosis with poor balance Clin Neurol Neurosurg 2024 246 108578 10.1016/j.clineuro.2024.108578 39383585 Güneş M, Apaydın AS, Keski NNK. Investigation of lumbar multifidus muscle, pain, and fear of falling in patients with lumbar spinal stenosis with poor balance. Clin Neurol Neurosurg. 2024;246:108578. 39383585 10.1016/j.clineuro.2024.108578 10. Gielen E Dupont J Dejaeger M Laurent MR Sarcopenia, osteoporosis and frailty Metabolism 2023 145 155638 10.1016/j.metabol.2023.155638 37348597 Gielen E, Dupont J, Dejaeger M, Laurent MR. Sarcopenia, osteoporosis and frailty. Metabolism. 2023;145:155638. 37348597 10.1016/j.metabol.2023.155638 11. Kitamura K van Hooff M Jacobs W Watanabe K de Kleuver M Which frailty scales for patients with adult spinal deformity are feasible and adequate? A systematic review Spine J 2022 22 1191 204 10.1016/j.spinee.2022.01.017 35123046 Kitamura K, van Hooff M, Jacobs W, Watanabe K, de Kleuver M. Which frailty scales for patients with adult spinal deformity are feasible and adequate? A systematic review. Spine J. 2022;22:1191–204. 35123046 10.1016/j.spinee.2022.01.017 12. Faller JW Pereira DDN de Souza S Nampo FK Orlandi FS Matumoto S Instruments for the detection of frailty syndrome in older adults: a systematic review PLoS ONE 2019 14 e0216166 10.1371/journal.pone.0216166 31034516 PMC6488093 Faller JW, Pereira DDN, de Souza S, Nampo FK, Orlandi FS, Matumoto S. Instruments for the detection of frailty syndrome in older adults: a systematic review. PLoS ONE. 2019;14:e0216166. 31034516 10.1371/journal.pone.0216166 PMC6488093 13. Nakamura K Ogata T Locomotive syndrome: definition and management Clin Rev Bone Miner Metab 2016 14 56 67 10.1007/s12018-016-9208-2 27375370 PMC4906066 Nakamura K, Ogata T. Locomotive syndrome: definition and management. Clin Rev Bone Miner Metab. 2016;14:56–67. 27375370 10.1007/s12018-016-9208-2 PMC4906066 14. Yoshimura N Muraki S Iidaka T Oka H Horii C Kawaguchi H Prevalence and co-existence of locomotive syndrome, sarcopenia, and frailty: the third survey of research on osteoarthritis/osteoporosis against disability (ROAD) study J Bone Miner Metab 2019 37 1058 66 10.1007/s00774-019-01012-0 31222550 Yoshimura N, Muraki S, Iidaka T, Oka H, Horii C, Kawaguchi H, et al. Prevalence and co-existence of locomotive syndrome, sarcopenia, and frailty: the third survey of research on osteoarthritis/osteoporosis against disability (ROAD) study. J Bone Miner Metab. 2019;37:1058–66. 31222550 10.1007/s00774-019-01012-0 15. Imagama S Ando K Kobayashi K Machino M Tanaka S Morozumi M Differences of locomotive syndrome and frailty in community-dwelling middle-aged and elderly people: pain, osteoarthritis, spinal alignment, body balance, and quality of life Mod Rheumatol 2020 30 921 9 10.1080/14397595.2019.1665616 31495262 Imagama S, Ando K, Kobayashi K, Machino M, Tanaka S, Morozumi M, et al. Differences of locomotive syndrome and frailty in community-dwelling middle-aged and elderly people: pain, osteoarthritis, spinal alignment, body balance, and quality of life. Mod Rheumatol. 2020;30:921–9. 31495262 10.1080/14397595.2019.1665616 16. Masnoon N Shakib S Kalisch-Ellett L Caughey GE What is polypharmacy? A systematic review of definitions BMC Geriatr 2017 17 230 10.1186/s12877-017-0621-2 29017448 PMC5635569 Masnoon N, Shakib S, Kalisch-Ellett L, Caughey GE. What is polypharmacy? A systematic review of definitions. BMC Geriatr. 2017;17:230. 29017448 10.1186/s12877-017-0621-2 PMC5635569 17. Kojima T Mizukami K Tomita N Arai H Ohrui T Eto M Screening tool for older persons’ appropriate prescriptions for Japanese: report of the Japan geriatrics society working group on guidelines for medical treatment and its safety in the elderly Geriatr Gerontol Int 2016 16 983 1001 10.1111/ggi.12890 27594406 Kojima T, Mizukami K, Tomita N, Arai H, Ohrui T, Eto M, et al. Screening tool for older persons’ appropriate prescriptions for Japanese: report of the Japan geriatrics society working group on guidelines for medical treatment and its safety in the elderly. Geriatr Gerontol Int. 2016;16:983–1001. 27594406 10.1111/ggi.12890 18. Arai H Satake S English translation of the Kihon checklist Geriatr Gerontol Int 2015 15 518 9 10.1111/ggi.12397 25828791 Arai H, Satake S. English translation of the Kihon checklist. Geriatr Gerontol Int. 2015;15:518–9. 25828791 10.1111/ggi.12397 19. Obeid NM Azuh O Reddy S Webb S Reickert C Velanovich V Predictors of critical care-related complications in colectomy patients using the National surgical quality improvement program: exploring frailty and aggressive laparoscopic approaches J Trauma Acute Care Surg 2012 72 878 83 10.1097/TA.0b013e31824d0f70 22491599 Obeid NM, Azuh O, Reddy S, Webb S, Reickert C, Velanovich V, et al. Predictors of critical care-related complications in colectomy patients using the National surgical quality improvement program: exploring frailty and aggressive laparoscopic approaches. J Trauma Acute Care Surg. 2012;72:878–83. 22491599 10.1097/TA.0b013e31824d0f70 20. Corporation JOA. Locomotive Syndrome in Locomotive Challenge Council, Locomotive Syndrome Pamphlet 2020. https://locomo-joa.jp/ 21. Sato K Inagaki R Michikawa T Kawabata S Ito K Morita M Prescription drug survey of elderly patients with degenerative musculoskeletal disorders Geriatr Gerontol Int 2022 22 121 6 10.1111/ggi.14326 34931429 Sato K, Inagaki R, Michikawa T, Kawabata S, Ito K, Morita M, et al. Prescription drug survey of elderly patients with degenerative musculoskeletal disorders. Geriatr Gerontol Int. 2022;22:121–6. 34931429 10.1111/ggi.14326 22. Uesugi K Sekiguchi M Kikuchi S Konno S Relationship between lumbar spinal stenosis and lifestyle-related disorders: a cross-sectional multicenter observational study Spine 2013 38 E540 5 10.1097/BRS.0b013e31828a2517 23380819 Uesugi K, Sekiguchi M, Kikuchi S, Konno S. Relationship between lumbar spinal stenosis and lifestyle-related disorders: a cross-sectional multicenter observational study. Spine. 2013;38:E540-5. 23380819 10.1097/BRS.0b013e31828a2517 23. Fujita N Ishihara S Michikawa T Azuma K Suzuki S Tsuji O Potential association of metabolic and musculoskeletal disorders with lumbar intervertebral disc degeneration: cross-sectional study using medical checkup data J Orthop Sci 2020 25 384 8 10.1016/j.jos.2019.05.011 31176515 Fujita N, Ishihara S, Michikawa T, Azuma K, Suzuki S, Tsuji O, et al. Potential association of metabolic and musculoskeletal disorders with lumbar intervertebral disc degeneration: cross-sectional study using medical checkup data. J Orthop Sci. 2020;25:384–8. 31176515 10.1016/j.jos.2019.05.011 24. Fujita N Lumbar spinal canal stenosis from the perspective of locomotive syndrome and metabolic syndrome: a narrative review Spine Surg Relat Res 2021 5 61 7 10.22603/ssrr.2020-0112 33842711 PMC8026207 Fujita N. Lumbar spinal canal stenosis from the perspective of locomotive syndrome and metabolic syndrome: a narrative review. Spine Surg Relat Res. 2021;5:61–7. 33842711 10.22603/ssrr.2020-0112 PMC8026207 25. Takeda H, Michikawa T, Nagai S, Akaike Y, Imai T, Kawabata S et al. Relationship between frailty and locomotive syndrome in older patients with degenerative cervical myelopathy: a retrospective longitudinal study. J Orthop Sci. In press. 10.1016/j.jos.2024.07.003 39013755 26. Yana M Güneş M Şimşek A Apaydın AS Akıncı C Özmen T The effect of Graston technique on pain, proprioception, flexibility, and disability in patients with chronic non-specific low back pain Altern Ther Health Med 2024 30 24 30 38702163 Yana M, Güneş M, Şimşek A, Apaydın AS, Akıncı C, Özmen T. The effect of Graston technique on pain, proprioception, flexibility, and disability in patients with chronic non-specific low back pain. Altern Ther Health Med. 2024;30:24–30. 38702163 27. Takeda H Michikawa T Nagai S Kawabata S Ito K Ikeda D Assessment of surgical outcomes in patients with degenerative cervical myelopathy using the 25-question geriatric locomotive function scale: a longitudinal observational study Spine Surg Relat Res 2024 8 287 96 10.22603/ssrr.2023-0191 38868784 PMC11165504 Takeda H, Michikawa T, Nagai S, Kawabata S, Ito K, Ikeda D, et al. Assessment of surgical outcomes in patients with degenerative cervical myelopathy using the 25-question geriatric locomotive function scale: a longitudinal observational study. Spine Surg Relat Res. 2024;8:287–96. 38868784 10.22603/ssrr.2023-0191 PMC11165504 28. Kato S Demura S Kabata T Matsubara H Kurokawa Y Kajino Y Evaluation of locomotive syndrome in patients receiving surgical treatment for degenerative musculoskeletal diseases: a multicentre prospective study using the new criteria Mod Rheumatol 2022 32 822 9 10.1093/mr/roab045 34910164 Kato S, Demura S, Kabata T, Matsubara H, Kurokawa Y, Kajino Y, et al. Evaluation of locomotive syndrome in patients receiving surgical treatment for degenerative musculoskeletal diseases: a multicentre prospective study using the new criteria. Mod Rheumatol. 2022;32:822–9. 34910164 10.1093/mr/roab045 29. Fujita N Michikawa T Miyamoto A Sakurai A Otaka Y Suzuki S Lumbar spinal surgery improves locomotive syndrome in elderly patients with lumbar spinal canal stenosis: a multicenter prospective study J Orthop Sci 2020 25 213 8 10.1016/j.jos.2019.03.017 30982707 Fujita N, Michikawa T, Miyamoto A, Sakurai A, Otaka Y, Suzuki S, et al. Lumbar spinal surgery improves locomotive syndrome in elderly patients with lumbar spinal canal stenosis: a multicenter prospective study. J Orthop Sci. 2020;25:213–8. 30982707 10.1016/j.jos.2019.03.017 30. Verma P Fawcett J Spinal cord regeneration Adv Biochem Eng Biotechnol 2005 94 43 66 15915868 10.1007/b99999 Verma P, Fawcett J. Spinal cord regeneration. Adv Biochem Eng Biotechnol. 2005;94:43–66. 15915868 10.1007/b99999 31. Uragami Y Takikawa K Kareki H Kimura K Yamamoto K Iihara N Effect of number of medications and use of potentially inappropriate medications on frailty among early-stage older outpatients J Pharm Health Care Sci 2021 7 15 10.1186/s40780-021-00195-x 33934718 PMC8091752 Uragami Y, Takikawa K, Kareki H, Kimura K, Yamamoto K, Iihara N. Effect of number of medications and use of potentially inappropriate medications on frailty among early-stage older outpatients. J Pharm Health Care Sci. 2021;7:15. 33934718 10.1186/s40780-021-00195-x PMC8091752 32. Yamada T Yoshii T Yamamoto N Hirai T Inose H Kato T Clinical outcomes of cervical spinal surgery for cervical myelopathic patients with coexisting lumbar spinal Canal stenosis (tandem spinal stenosis): a retrospective analysis of 297 cases Spine 2018 43 E234 41 10.1097/BRS.0000000000002289 28614282 Yamada T, Yoshii T, Yamamoto N, Hirai T, Inose H, Kato T, et al. Clinical outcomes of cervical spinal surgery for cervical myelopathic patients with coexisting lumbar spinal Canal stenosis (tandem spinal stenosis): a retrospective analysis of 297 cases. Spine. 2018;43:E234–41. 28614282 10.1097/BRS.0000000000002289 ",
  "metadata": {
    "Title of this paper": "Clinical outcomes of cervical spinal surgery for cervical myelopathic patients with coexisting lumbar spinal Canal stenosis (tandem spinal stenosis): a retrospective analysis of 297 cases",
    "Journal it was published in:": "BMC Musculoskeletal Disorders",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487136/"
  }
}