{
  "title": "Paper_4",
  "abstract": "pmc Biosci Microbiota Food Health Biosci Microbiota Food Health 2480 bmfh BMFH Bioscience of Microbiota, Food and Health 2186-6953 2186-3342 IPEC, Inc. PMC12490872 PMC12490872.1 12490872 12490872 10.12938/bmfh.2025-015 2025-015 1 Full Paper Antibiotic combination therapy for the induction and maintenance of remission\nin patients with ulcerative colitis NISHIKAWA Yuriko  1 OHKUSA Toshifumi  1  2  * SHIBUYA Tomoyoshi  3 OSADA Taro  3 UCHIYAMA Kan  2 SATO Nobuhiro  1 1 2 3 *Corresponding author. Toshifumi Ohkusa (E-mail: ohkusa@juntendo.ac.jp 07 5 2025 2025 44 4 498212 272 278 03 3 2025 10 4 2025 01 01 2025 03 10 2025 03 10 2025 ©2025 BMFH Press 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative\nCommons Attribution Non-Commercial No Derivatives (by-nc-nd) License. (CC-BY-NC-ND 4.0: https://creativecommons.org/licenses/by-nc-nd/4.0/ Dysbiosis of the gut microbiota has recently been identified as a therapeutic target for\nulcerative colitis. We reported the effectiveness of antibiotic combination therapy (ATM\ntherapy) for the induction and maintenance of ulcerative colitis remission. In this study,\nwe aimed to investigate the long-term effectiveness of ATM therapy in a larger cohort. A\nprospective open-label trial was undertaken with 311 adult ulcerative colitis patients.\nThe combination of oral amoxicillin 500 mg t.i.d., tetracycline 500 mg t.i.d. and\nmetronidazole 250 mg t.i.d. was administered to patients daily for 2–4 weeks in addition\nto their conventional medication. Clinical assessments were performed using the partial\nMayo score at baseline; at treatment completion; and at 3, 6, 9 and 12 months. Endoscopic\nevaluations were performed using the Mayo endoscopic score at baseline, 3 months, and 12\nmonths. The compliance rate was 95.7%. The response and remission rates were 75.2% and\n30.9% at completion, 62.7% and 29.6% at 3 months, 48.2% and 27.7% at 6 months, 37.9% and\n24.4% at 9 months, and 35.4% and 24.4% at 12 months. The most frequent adverse events were\ndiarrhea and fever. No life-threatening adverse events were observed during the trial. ATM\ntherapy effectively led to long-term clinical response and remission in patients with\nactive ulcerative colitis symptoms. However, further investigations are needed for the\nstandardization of antibiotic therapy for ulcerative colitis in the future. ulcerative colitis antibiotic combination therapy (ATM therapy) long-term effectiveness pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Ulcerative colitis (UC) is a chronic inflammatory bowel disease. The pathogenesis of\ninflammatory bowel disease (IBD) is still unknown, although multiple factors, such as\ngenetics, the environment, immunopathological pathways, and the gut microbiota, are\nseemingly involved [ 1 2 3 4 5 There are diverse opinions on the use of antibiotics for IBD patients. In a recent report,\nantibiotic exposure was suggested to be associated with an increased risk of IBD, and the\nrisk increased cumulatively within 1–2 years after exposure to antibiotics targeting\ngastrointestinal pathogens [ 6 7 8 9 10 11 12 13 14 Our group previously reported that Fusobacterium varium F. varium 15 16 MATERIALS AND METHODS Patients A prospective, open-label study was conducted at Juntendo University Hospital in Japan.\nPatients were eligible if they were ≥15 years of age and had an established diagnosis of\nUC based on endoscopic, clinical, and histological features. The exclusion criteria were\npenicillin allergy, antibiotic agent administration within 2 weeks of study entry, ongoing\nbiologic therapy, pregnancy, cancer, and other serious comorbid illnesses. Patients who\nhad stool pathogens, including Clostridioides difficile Escherichia coli, Study design All patients received ATM therapy, comprising a combination of oral amoxicillin 1,500 mg\nt.i.d., tetracycline 1,500 mg t.i.d., and metronidazole 750 mg t.i.d., for 2 weeks either\nat the hospital or at home, together with their conventional treatments. In subjects with\ndisease activity deemed severe according to the Truelove and Witts criteria and\nsignificant deep ulceration observed on endoscopy at baseline, the duration of ATM\ntreatment was extended up to 4 weeks based on the physicians’ decisions. A clinical\nexamination was performed at baseline; at treatment completion; and at 3, 9, and 12\nmonths. Total colonoscopy was performed at baseline, at 3 months, and at 12 months. All\nadverse events were recorded. Clinical scoring We classified disease severity on the basis of the Truelove and Witts criteria. We also\ndefined remission as a total Mayo score reaching 2 points or less with all individual\nsubscores scoring 1 or zero. Clinical response was defined based on the baseline total\nMayo score: a decrease of at least 3 points from baseline if the baseline score reached\n≥4, a decrease of ≥2 points with a baseline score of 3, or a decrease of ≥1 point with a\nbaseline score of 2 or 1. On the basis of the partial Mayo score at trial completion, at 6\nmonths and at 9 months, we defined response as a decrease of ≥1 points in the score from\nbaseline and remission as a blood-stool score of 0 in addition to either a stool frequency\nof 0 or a decrease in stool frequency of ≥1 point. Relapse was defined as requiring\nintensification of therapy, including an increase in the drug dose or a switch to a new\ntherapeutic agent. If there was no relapse, the medications were not changed, or the dose\nof steroids was reduced during the study period. Patients whose conditions did not improve after at least 2 weeks of intravenous or oral\nprednisolone administration above 30 mg/day were classified as steroid refractory, and\npatients who experienced relapse while tapering prednisolone to at least 10 mg/day and who\nwere unable to discontinue steroids without relapse were classified as steroid\ndependent. The primary endpoint was the remission rate 3 months after the completion of ATM therapy.\nThe secondary endpoints were the response rate at 3 months and the remission rate and\nresponse rate at completion and 1 year after ATM therapy. All these rates were further\nsegmented and compared according to disease severity based on the Truelove and Witts\ncriteria, disease extent, and steroid use. All adverse events were recorded. Statistical analysis We used Fisher’s exact test to analyze the response rates across subgroups. Differences\nwith p values <0.05 were considered to indicate statistical significance. We used the\nStat View software (version J 5.1, SAS Institute, Inc., Cary, NC, USA) for all\ncalculations. Ethical considerations The protocol of this study was approved by the Ethics Committee of the Juntendo\nInstitutional Review Board, Juntendo University School of Medicine (Tokyo, Japan), and the\nClinical Study Committee of Juntendo University Hospital. This study was also registered\nwith the University Hospital Medical Information Network (No. UMIN000053277) after its\ncompletion. All patients provided written informed consent. All procedures were performed\nin accordance with the Helsinki Declaration. RESULTS Patient characteristics In total, 311 UC patients were enrolled in the trial. The median age was 35 years. Among\nthe participants, 80.1% had moderate or severe symptoms, 48.6% were steroid dependent, and\n12.5% were steroid resistant. All patient details are shown in Table 1 Table 1. Patient characteristics Variables Numbers Median age - years (range) 35 (15–80) Male/female - number of patients (%) 203/108 (65.3/34.7) Median disease duration - month (range) 90 (0–601) Mayo score at baseline - average score\n(S.D.) 6.76 (± 2.82) Extent of disease - number of patients (%) Extensive colitis 147 (47.3) Left-sided colitis 101 (32.5) Proctitis 63 (20.2) Clinical severity of disease - number of patients\n(%) Severe 32 (10.3) Moderate 217 (69.8) Mild 62 (19.9) Concomitant medication - number of patients\n(%) Corticosteroid 158 (50.8) Sulfasalazine 159 (51.1) 5-Aminosalicylic acid 239 (76.8) Azathioprine 15 (4.8) Corticosteroid enema 35 (11.3) Steroid use - number of patients (%) Naive 121 (38.9) Steroid dependent 151 (48.6) Steroid resistant 39 (12.5) Total steroid (PSL) amount - mg (mean S.E.) 8,469 (2,901.5) PSL: prednisolone. Compliance rate and adverse events The total compliance rate was 95.7%. There were 189 (60.8%) patients who experienced\nadverse events. The most frequent symptom was diarrhea (19.0%), followed by fever (14.8%),\nupper gastrointestinal disorders (9.6%), rash (7.1%), fatigue (6.7%), hypogeusia (4.8%),\nand headache (4.2%). There were no life-threatening episodes during the trial. All the\nadverse symptoms disappeared immediately after the discontinuation or completion of ATM\ntherapy. Clinical outcomes The overall flow of patients and outcomes are displayed in Figs. 1 Fig. 1. Response and remission rates at antibiotic combination (ATM) completion and at 3,\n6, 9, and 12 months. The response rates are shown in blue, and the remission rates\nare shown in orange. The response rate was 75.2% after 2 weeks of ATM therapy, and\n35.4% of the patients remained in better condition compared with baseline. The\nremission rate at the end of ATM therapy was 30.9%, and it remained at 24.4% at\n1 year after ATM therapy. and 2 Fig. 2. Patient flow from enrolment to the 12-month follow-up. The response rate included\npatients in remission. After completing the antibiotic combination (ATM) regimen, 78\npatients dropped out due to relapse, an increase/change in medication, or missed\nfollow-up visits. One hundred and four participants withdrew between 3 months and 12\nmonths. Seventy-six patients were in remission 12 months after ATM therapy. We further analyzed the response rate based on disease severity, responsiveness to\nsteroids, and disease extent. Regarding disease severity based on the Truelove and Witts\ncriteria, the response rate tended to be high in the more severe patient group and\nsignificantly differed at 6 months (p=0.0299; Fig.\n3 Fig. 3. Response rate analyzed by disease severity. The percentages of severe, moderate,\nand mild patients are shown in blue, orange, and grey, respectively. The response\nrate was relatively high among severe patients and was significantly greater at 6\nmonths (p=0.0299). There was no significant difference in response rate at other\nfollow-up points. Tables\n2 Table 2. Numbers and proportions of patients with clinical response segmented by disease\nextensiveness Disease extent Response rate Completion 3 months 6 months 9 months 12 months Extensive colitis (n=147) 112 (76.2%) 95 (64.6%) 72 (49.0%) 56 (38.1%) 56 (38.1%) Left-sided colitis (n=101) 73 (72.3%) 57 (56.4%) 46 (45.5%) 36 (35.6%) 34 (33.7%) Proctitis (n=63) 49 (77.8%) 43 (68.3%) 32 (50.8%) 26 (41.3%) 20 (31.7%) p-value 0.682 0.544 0.865 0.915 0.668 and 3 Table 3. Numbers and proportions of patients with clinical response segmented by steroid\nresponse Steroid response Response rate Completion 3 months 6 months 9 months 12 months Steroid dependent (n=151) 109 (72.2%) 89 (58.9%) 75 (49.7%) 59 (39.1%) 55 (36.4%) Steroid resistant (n=39) 31 (79.5%) 26 (66.7%) 17 (43.6%) 15 (38.5%) 15 (38.5%) Naïve (n=121) 94 (77.7%) 80 (66.1%) 58 (47.9%) 44 (36.4%) 40 (33.1%) p-value 0.467 0.345 0.797 0.416 0.156 DISCUSSION The management of UC is highly important for better control of chronic UC activity and\nexacerbation recurrence. In this trial, we observed that there was a good proportion of UC\npatients who achieved remission and responded to ATM therapy among those with active\nsymptoms. The compliance rate was high, and adverse events were relatively mild enough to be\nresolved shortly after the discontinuation of the medication, although there were a few\ncases of drop-out, mainly due to high fever. Overall, the results of the present study were\npositive in terms of effectiveness and safety. The use of antibiotics for UC treatment has been discussed for several decades. Our group\nhas reported the effectiveness of ATM therapy in multiple studies. In one study that\nenrolled active UC patients with high serum levels of antibodies against F.\nvarium 15 16 17 18 et al. 19 Various antibiotic regimens have been studied for IBD patients. Breton et\nal. 20 et al. 21 et\nal. 22 23 24 Nonetheless, it is worth noting that the effectiveness of the antibiotics in studies with\npositive results is comparable to those of other treatment options, with seemingly fewer\nserious adverse events. For example, the response rates in tacrolimus studies were reported\nto be 73% at 1 month and 76% at 3 months, with serious adverse events that included kidney\ninjury and tremor [ 25 26 27 28 29 30 31 32 33 34 35 36 37 38 The balance of the gut microbiota is considered to be altered in UC patients compared with\nhealthy individuals. However, the overall etiology has not been elucidated, as the disease\nstate is highly complex and the classic Koch’s postulates for identifying a single pathogen\nare not applicable [ 39 Fusobacterium Lactobacillus 40 41 Bacteroides,\nParabacteroides, Rickenella, Clostridium Bifidobacterium Lactobacillus Bacteroides 42 The limitations of this study include the lack of randomization and the absence of a\ncomparative group. For further understanding, double-blinded RCTs at multiple sites are\nneeded. Moreover, we lacked patient information, such as information about smoking status\nand the level of calprotectin. With those data, we would have been able to execute a\ndetailed analysis regarding the condition of the patients and disease activity. In conclusion, ATM therapy effectively suppressed the disease activity of UC patients and\ninduced remission in both the short and long term, with relatively mild and short resolvable\nadverse events. Further studies, including microbiota analysis, may provide a better\nunderstanding of antibiotic use for UC patients and could aid in the development of\ntreatment options. ETHICAL APPROVAL The protocol of this study was approved by the Ethics Committee of the Juntendo\nInstitutional Review Board, Juntendo University School of Medicine (Tokyo, Japan), and the\nClinical Study Committee of Juntendo University Hospital. All procedures were performed in\naccordance with the Helsinki Declaration. INFORMED CONSENT All patients in this study provided written informed consent and agreed to participate. CLINICAL TRIAL REGISTRATION This study was registered with the University Hospital Medical Information Network (No.\nUMIN000053277). DATA AVAILABILITY The data that support the findings of this study are not publicly available because they\ncontain information that could compromise the privacy of the research participants but are\navailable from the corresponding author T. O. upon reasonable request. FUNDING  This work was supported by each participating facility’s own funds. AUTHOR CONTRIBUTIONS T. Ohkusa contributed to the conception and design of the study; T. Ohkusa, T.S., T. Osada,\nand K.U. collected the data; and T. Ohkusa, T.S., T. Osada, and Y.N. analyzed the data. Y.N.\ndrafted the manuscript, and T. Ohkusa and N.S. revised it critically. All authors have\napproved the final version of the manuscript. CONFLICTS OF INTEREST Although the Department of Microbiota Research, Juntendo University Graduate School of\nMedicine (Y.N., T.O., and N.S.), has a joint research course with Morinaga Milk Industry Co.\nLtd., there is no COI with respect to this research. The other authors have no conflicts to\ndisclose. The authors would like to thank all participants and hospital staff members who supported\nthis study. REFERENCES 1 Gilliland A Chan JJ De Wolfe TJ Yang H Vallance BA 2024 Pathobionts in inflammatory bowel\ndisease: origins, underlying mechanisms, and implications for clinical\ncare Gastroenterology 166 44 58 37734419 10.1053/j.gastro.2023.09.019 2 Shen ZH Zhu CX Quan YS Yang ZY Wu S Luo WW Tan B Wang XY 2018 Relationship between intestinal\nmicrobiota and ulcerative colitis: mechanisms and clinical application of probiotics and\nfecal microbiota transplantation World J\nGastroenterol 24 5 14 29358877 10.3748/wjg.v24.i1.5 PMC5757125 3 Singh S Allegretti JR Siddique SM Terdiman JP 2020 AGA Technical review on the management\nof moderate to severe ulcerative colitis Gastroenterology 158 1465 1496.e17 31945351 10.1053/j.gastro.2020.01.007 PMC7117094 4 Wetwittayakhlang P Gonczi L Lakatos L Kurti Z Golovics P Pandur T David G Erdelyi Z Szita I Lakatos PL 2023 Long-term colectomy rates of ulcerative\ncolitis over 40 years of different therapeutic eras—results from a western Hungarian\npopulation-based inception cohort between 1977 and 2020 J\nCrohns Colitis 17 712 721 36539328 10.1093/ecco-jcc/jjac188 5 Rosenbaum M 1983 Ulcerative colitis Psychosomatics 24 515 519,\n522–525, 528–529 6348829 10.1016/S0033-3182(83)73183-X 6 Faye AS Allin KH Iversen AT Agrawal M Faith J Colombel JF Jess T 2023 Antibiotic use as a risk factor for\ninflammatory bowel disease across the ages: a population-based cohort\nstudy Gut 72 663 670 36623926 10.1136/gutjnl-2022-327845 PMC9998355 7 Barnes EL Desai A Kochhar GS 2023 The comparative effectiveness of\nciprofloxacin and metronidazole for an initial episode of pouchitis: a\npropensity-matched study Am J Gastroenterol 118 1989 1996 37463438 10.14309/ajg.0000000000002412 PMC10841309 8 Barnes EL Agrawal M Syal G Ananthakrishnan AN Cohen BL Haydek JP Al Kazzi ES Eisenstein S Hashash JG Sultan SS et al. AGA Clinical practice\nguideline on the management of pouchitis and inflammatory pouch\ndisorders Gastroenterology 166 59 85 38128971 10.1053/j.gastro.2023.10.015 PMC11163976 9 Parigi TL Vieujean S Paridaens K Dalgaard K Peyrin-Biroulet L Danese S 2023 Efficacy, safety, and concerns on\nmicrobiota modulation, antibiotics, probiotics, and fecal microbial transplant for\ninflammatory bowel disease and other gastrointestinal conditions: results from an\ninternational survey Microorganisms 11 2826 38004817 10.3390/microorganisms11112806 PMC10672996 10 Eindor-Abarbanel A Healey GR Jacobson K Stolfi C 2021 Therapeutic advances in gut microbiome\nmodulation in patients with inflammatory bowel disease from pediatrics to\nadulthood Int J Mol Sci 22 12506 34830388 10.3390/ijms222212506 PMC8622771 11 Wang SL Wang ZR Yang CQ 2012 Meta-analysis of broad-spectrum\nantibiotic therapy in patients with active inflammatory bowel disease Exp Ther Med 4 1051 1056 23226773 10.3892/etm.2012.718 PMC3494118 12 Khan KJ Ullman TA Ford AC Abreu MT Abadir A Marshall JK Talley NJ Moayyedi P 2011 Antibiotic therapy in inflammatory\nbowel disease: a systematic review and meta-analysis Am J\nGastroenterol 106 661 673 21407187 10.1038/ajg.2011.72 13 Gordon M Sinopoulou V Grafton-Clarke C Akobeng AK 2022 Antibiotics for the induction and\nmaintenance of remission in ulcerative colitis Cochrane\nDatabase Syst Rev 5 CD013743 35583095 10.1002/14651858.CD013743.pub2 PMC9115763 14 Oka A Sartor RB 2020 Microbial-based and microbial-targeted\ntherapies for inflammatory bowel diseases Dig Dis\nSci 65 757 788 32006212 10.1007/s10620-020-06090-z PMC7311927 15 Ohkusa T Nomura T Terai T Miwa H Kobayashi O Hojo M Takei Y Ogihara T Hirai S Okayasu I et al. 2005 Effectiveness of antibiotic combination\ntherapy in patients with active ulcerative colitis: a randomized, controlled pilot trial\nwith long-term follow-up Scand J Gastroenterol 40 1334 1342 16334443 10.1080/00365520510023648 16 Ohkusa T Kato K Terao S Chiba T Mabe K Murakami K Mizokami Y Sugiyama T Yanaka A Takeuchi Y et al. 2010 Newly developed antibiotic combination therapy for ulcerative colitis: a\ndouble-blind placebo-controlled multicenter trial Am J\nGastroenterol 105 1820 1829 20216533 10.1038/ajg.2010.84 17 Koido S Ohkusa T Kajiura T Shinozaki J Suzuki M Saito K Takakura K Tsukinaga S Odahara S Yukawa T et al. 2014 Long-term alteration of intestinal\nmicrobiota in patients with ulcerative colitis by antibiotic combination\ntherapy PLoS One 9 e86702 24489770 10.1371/journal.pone.0086702 PMC3906066 18 Nishikawa Y Sato N Tsukinaga S Uchiyama K Koido S Ishikawa D Ohkusa T 2021 Long-term outcomes of antibiotic\ncombination therapy for ulcerative colitis Ther Adv Chronic\nDis 12 20406223211028790 34285790 10.1177/20406223211028790 PMC8264727 19 Ishikawa D Sasaki T Osada T Kuwahara-Arai K Haga K Shibuya T Hiramatsu K Watanabe S 2017 Changes in intestinal microbiota\nfollowing combination therapy with fecal microbial transplantation and antibiotics for\nulcerative colitis Inflamm Bowel Dis 23 116 125 27893543 10.1097/MIB.0000000000000975 20 Breton J Kastl A Hoffmann N Rogers R Grossman AB Mamula P Kelsen JR Baldassano RN Albenberg L 2019 Efficacy of combination antibiotic\ntherapy for refractory pediatric inflammatory bowel disease Inflamm Bowel Dis 25 1586 1593 30715364 10.1093/ibd/izz006 PMC6939824 21 Burke DA Axon AT Clayden SA Dixon MF Johnston D Lacey RW 1990 The efficacy of tobramycin in the\ntreatment of ulcerative colitis Aliment Pharmacol\nTher 4 123 129 2104079 10.1111/j.1365-2036.1990.tb00456.x 22 Turunen UM Färkkilä MA Hakala K Seppälä K Sivonen A Ogren M Vuoristo M Valtonen VV Miettinen TA 1998 Long-term treatment of ulcerative\ncolitis with ciprofloxacin: a prospective, double-blind, placebo-controlled\nstudy Gastroenterology 115 1072 1078 9797360 10.1016/s0016-5085(98)70076-9 23 Mantzaris GJ Petraki K Archavlis E Amberiadis P Kourtessas D Christidou A Triantafyllou G 2001 A prospective randomized controlled\ntrial of intravenous ciprofloxacin as an adjunct to corticosteroids in acute, severe\nulcerative colitis Scand J Gastroenterol 36 971 974 11521989 10.1080/003655201750305503 24 Chapman RW Selby WS Jewell DP 1986 Controlled trial of intravenous\nmetronidazole as an adjunct to corticosteroids in severe ulcerative\ncolitis Gut 27 1210 1212 3536677 10.1136/gut.27.10.1210 PMC1433885 25 Damião AOMC de Azevedo MFC Carlos AS Wada MY Silva TVM Feitosa FC 2019 Conventional therapy for moderate to\nsevere inflammatory bowel disease: a systematic literature review World J Gastroenterol 25 1142 1157 30863001 10.3748/wjg.v25.i9.1142 PMC6406187 26 Komaki Y Komaki F Ido A Sakuraba A 2016 Efficacy and safety of tacrolimus\ntherapy for active ulcerative colitis; a systematic review and\nmeta-analysis J Crohns Colitis 10 484 494 26645641 10.1093/ecco-jcc/jjv221 PMC4946757 27 Narula N Fine M Colombel JF Marshall JK Reinisch W 2015 Systematic review: sequential rescue\ntherapy in severe ulcerative colitis: do the benefits outweigh the\nrisks? Inflamm Bowel Dis 21 1683 1694 25839775 10.1097/MIB.0000000000000350 28 D’Haens G Lemmens L Geboes K Vandeputte L Van Acker F Mortelmans L Peeters M Vermeire S Penninckx F Nevens F et al. 2001 Intravenous cyclosporine versus\nintravenous corticosteroids as single therapy for severe attacks of ulcerative\ncolitis Gastroenterology 120 1323 1329 11313301 10.1053/gast.2001.23983 29 Lichtiger S Present DH Kornbluth A Gelernt I Bauer J Galler G Michelassi F Hanauer S 1994 Cyclosporine in severe ulcerative\ncolitis refractory to steroid therapy N Engl J\nMed 330 1841 1845 8196726 10.1056/NEJM199406303302601 30 Sands BE Sandborn WJ Panaccione R O’Brien CD Zhang H Johanns J Adedokun OJ Li K Peyrin-Biroulet L Van Assche G et al. 2019 Ustekinumab as induction\nand maintenance therapy for ulcerative colitis N Engl J\nMed 381 1201 1214 31553833 10.1056/NEJMoa1900750 31 Peyrin-Biroulet L Lémann M 2011 Review article: remission rates\nachievable by current therapies for inflammatory bowel disease Aliment Pharmacol Ther 33 870 879 21323689 10.1111/j.1365-2036.2011.04599.x 32 Rutgeerts P Sandborn WJ Feagan BG Reinisch W Olson A Johanns J Travers S Rachmilewitz D Hanauer SB Lichtenstein GR et al. 2005 Infliximab for induction and maintenance\ntherapy for ulcerative colitis N Engl J Med 353 2462 2476 16339095 10.1056/NEJMoa050516 33 Sandborn WJ Feagan BG Marano C Zhang H Strauss R Johanns J Adedokun OJ Guzzo C Colombel JF Reinisch W et al. 2014 Subcutaneous golimumab maintains clinical response in patients with\nmoderate-to-severe ulcerative colitis Gastroenterology 146 96 109.e1 23770005 10.1053/j.gastro.2013.06.010 34 Sandborn WJ van Assche G Reinisch W Colombel JF D’Haens G Wolf DC Kron M Tighe MB Lazar A Thakkar RB 2012 Adalimumab induces and maintains\nclinical remission in patients with moderate-to-severe ulcerative\ncolitis Gastroenterology 142 257 65.e1, 3 22062358 10.1053/j.gastro.2011.10.032 35 Kirchgesner J Lemaitre M Carrat F Zureik M Carbonnel F Dray-Spira R 2018 Risk of serious and opportunistic\ninfections associated with treatment of inflammatory bowel diseases Gastroenterology 155 337 346.e10 29655835 10.1053/j.gastro.2018.04.012 36 Chupin A Perduca V Meyer A Bellanger C Carbonnel F Dong C 2020 Systematic review with meta-analysis:\ncomparative risk of lymphoma with anti-tumour necrosis factor agents and/or thiopurines\nin patients with inflammatory bowel disease Aliment Pharmacol\nTher 52 1289 1297 32840893 10.1111/apt.16050 37 Dolovich C Bernstein CN Singh H Nugent Z Tennakoon A Shafer LA Marrie RA Sareen J Targownik LE 2021 Anxiety and depression leads to\nanti-tumor necrosis factor discontinuation in inflammatory bowel\ndisease Clin Gastroenterol Hepatol 19 1200 1208.e1 32668341 10.1016/j.cgh.2020.07.013 38 Sandborn WJ Feagan BG Hanauer S Vermeire S Ghosh S Liu WJ Petersen A Charles L Huang V Usiskin K et al. 2021 Long-term efficacy and safety of ozanimod\nin moderately to severely active ulcerative colitis: results from the open-label\nextension of the randomized, phase 2 TOUCHSTONE study J Crohns\nColitis 15 1120 1129 33438008 10.1093/ecco-jcc/jjab012 PMC8256627 39 Zhao H Zhang W Cheng D You L Huang Y Lu Y 2022 Investigating dysbiosis and microbial\ntreatment strategies in inflammatory bowel disease based on two modified Koch’s\npostulates Front Med (Lausanne) 9 1023896 36438062 10.3389/fmed.2022.1023896 PMC9684636 40 Kostic AD Xavier RJ Gevers D 2014 The microbiome in inflammatory bowel\ndisease: current status and the future ahead Gastroenterology 146 1489 1499 24560869 10.1053/j.gastro.2014.02.009 PMC4034132 41 Zhang SL Wang SN Miao CY Reitzel AM Law KM 2017 Influence of microbiota on intestinal\nimmune system in ulcerative colitis and its intervention Front\nImmunol 8 1674 29234327 10.3389/fimmu.2017.01674 PMC5712343 42 Ohkusa T Kato K Sekizuka T Sugiyama T Sato N Kuroda M 2024 Comparison of the gut microbiota of\npatients who improve with antibiotic combination therapy for ulcerative colitis and\nthose who do not: investigation by fecal metagenomic analyses Nutrients 16 3500 39458495 10.3390/nu16203500 PMC11510665 ",
  "metadata": {
    "Title of this paper": "Comparison of the gut microbiota of\npatients who improve with antibiotic combination therapy for ulcerative colitis and\nthose who do not: investigation by fecal metagenomic analyses",
    "Journal it was published in:": "Bioscience of Microbiota, Food and Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490872/"
  }
}