{
  "title": "Paper_1062",
  "abstract": "pmc Natl J Maxillofac Surg Natl J Maxillofac Surg 1762 njmaxsurg NJMS Natl J Maxillofac Surg National Journal of Maxillofacial Surgery 0975-5950 2229-3418 Wolters Kluwer -- Medknow Publications PMC12469060 PMC12469060.1 12469060 12469060 41019698 10.4103/njms.njms_71_24 NJMS-16-375 1 Case Report Versatility of bilateral nasolabial flap for reconstruction of subtotal lip defects in oral squamous cell carcinoma with commissural involvement: A case report and review literature Bansal Vyomika Singh Akhilesh K. Sharma Naresh K. Mahajan Arjun D. Department of Surgical Oncology, Institute of Medical Sciences, Banaras Hindu University, Varanasi, Uttar Pradesh, India Address for correspondence: arjunmahajan08@gmail.com May-Aug 2025 30 8 2025 16 2 497637 375 381 28 4 2024 16 7 2024 21 8 2024 01 05 2025 27 09 2025 29 09 2025 Copyright: © 2025 National Journal of Maxillofacial Surgery 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open access journal, and articles are distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License, which allows others to remix, tweak, and build upon the work non-commercially, as long as appropriate credit is given and the new creations are licensed under the identical terms. Reconstruction of the lip is crucial to regaining essential functions, including oral competency, speech articulation, and aesthetics. Reconstruction is often challenging when commissure is involved as it affects the anatomy of both the upper and lower lip as well as the size of the oral stoma. Improper commissure reconstruction results in drooling and a reduction in mouth opening. This case highlights the versatility of the simultaneous use of a bilateral nasolabial flap for the reconstruction of subtotal lower-lip defects in cases where a tumor involves one of the commissures, providing satisfactory aesthetic and functional results. Bilateral nasolabial flap oral squamous cell carcinoma reconstruction Nil. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Oral squamous cell carcinoma involving the lip poses a challenging condition requiring a comprehensive approach to restore function, including oral competency, speech, and aesthetics.[ 1 2 3 4 The key advantage of the bilateral nasolabial flap is its collateral supply from the facial artery, transverse facial artery, buccal artery, masseteric artery, and infraorbital artery, as mentioned by Herbert and Harrison,[ 5 Various techniques exist for lip reconstruction, each with advantages and limitations. The Webster flap preserves the commissure but may cause microstomia. The Karapandzic flap maintains nerve function but can distort anatomy. The Gillies fan flap addresses subtotal defects but may cause denervation. Combined local and regional flaps, such as nasolabial with bucket handle, can reconstruct total defects. The melo-labial flap offers a good color match but limited bulk. Lip switch flaps maintain contour but may distort the shape. Myomucosal flaps provide muscle coverage and reduce microstomia risk. Free tissue transfers suit extensive defects but require microsurgical expertise and longer operating times. Patient comorbidities may contraindicate free flap procedures. In cases where the commissure is involved, the nasolabial flap, either unilateral or bilateral, is often considered a reliable and versatile option that can provide satisfactory results. For subtotal defects of the lower lip, local flaps, such as the nasolabial flap, have been widely used to achieve satisfactory structural and functional results.[ 6 7 8 9 10 11 12 In this case report, we present the successful management of a patient with well-differentiated squamous cell carcinoma of the lower lip, involving the right commissure, using a bilateral nasolabial flap reconstruction. It emphasizes on utility of the nasolabial flap in the reconstruction of subtotal lower-lip defects, particularly in cases where the tumor encroaches on the commissure, and discusses the functional and aesthetic outcomes achieved with this technique along with the insights on the literature review. CASE REPORT A 49-year-old male patient reported to the unit of oral and maxillofacial surgery, with a chief complaint of growth on the right side of the lower lip for the past 2 months [ Figure 1 Figure 1 Pre-operative Extraoral Picture The patient’s habits revealed a deleterious habit of tobacco chewing for the past 20 years and was a chronic smoker for the past 10 years. The patient had a known case of chronic obstructive pulmonary disease (COPD) and long-standing hypertension (HTN) and was not currently on any medication. On extraoral examination, an ulcero-proliferative growth with an exophytic necrotic crust measuring 2.5 cm ×1.5 cm was observed on the right vermilion border, situated near the corner of the lip, without crossing the midline. The lesion was non-tender on palpation. A solitary, firm to hard, non-tender, right level Ib lymph node was palpable. On intraoral examination, the lesion continued on the labial mucosa and the vestibule [ Figure 2 Figure 2 Pre-operative Intraoral Picture A contrast-enhanced computed tomography (CECT) of the face and neck revealed an ill-defined, oval-shaped, non-homogenous lesion with irregular borders, associated with loss of alveolar bone and erosion of the mandibular buccal cortex from the right canine to the premolar region, along with right submandibular lymph node involvement. A Punch biopsy followed by histopathological examination of the lesion confirmed the diagnosis of well-differentiated squamous cell carcinoma. The patient was planned for wide local excision, followed by marginal mandibulectomy and bilateral supra-omohyoid neck dissection. Owing to preexisting comorbidities such as HTN and COPD, the reconstruction using a bilateral nasolabial flap was planned for the lip and right buccal vestibular defect under general anesthesia. After written informed consent, the patient was explained about the procedure and potential risks and benefits. The patient was found fit for surgery in a preanesthetic checkup but was at moderate respiratory risk for surgery from the chest and TB department. Upon shifting to the operation room, the patient was intubated nasally, after throat packing, the patient was painted and draped. Wide local excision of primary tumor and marginal mandibulectomy was performed [ Figure 3 Figure 3 Intra-operative Picture after wide local excision and marginal mandibulectomy For reconstruction, the skin incisions were made at a distance equivalent to the height of the lower lip to maintain the normal height of the lip. The superior incision was placed just lateral to the nasolabial crease incising the skin, subcutaneous fat. The inner mucosal incision was made parallel to the skin incision approximately 2 cm on the left side. Meticulous dissection was done to preserve the labial arteries and buccal motor nerve. The flap was released and rotated medially. Similarly, on the right side, inferior based the nasolabial flap was raised. The plane of dissection was deep to the subcutaneous tissue and superficial to the underlying muscles. Special attention was given to preserving the integrity of the facial vessels during the neck dissection on the right side. On the left side, the flap was rotated medially to cover the lower-lip defect after being raised to the required length. On the right side, the flap was rotated inwards to the oral cavity through a mucosal tunnel. The flaps were sutured meticulously in multiple layers from the inner mucosal layer to the outer skin with minimal tension [ Figure 4 Figure 4 Immediate Post-operative picture The final histopathological report confirmed a lower-lip primary lesion with node metastases to the right level Ib lymph node and pathological TNM staging pT3N1 with perineural invasion. All the margins were free of tumors. At 1 month of follow-up, the patient reported a minimal scar and normal functions such as deglutition, speech, and adequate mouth opening. DISCUSSION The authors reported that approximately 25%–30% of all oral cancers occur on the lip, with the lower lip being the most common site.[ 13 The use of bilateral nasolabial flaps for reconstruction of facial defects due to tumors has been listed in Table 1 9 et al 10 et al 14 et al 15 Table 1 Review of Literature Journal Authors Year Age/Sex Tumor site Tumor size (cm) Defect Flap size cm Facial artery Healing events Functional deficits Oral and maxillofacial surgery Nikolaos[ 17 et al 1998 55/M Floor of the mouth - - - - - - Oral and maxillofacial surgery Nikolaos[ 17 et al 1998 64/M Floor of the mouth - - - - - Obstructive Sialadenitis Oral and maxillofacial surgery Nikolaos[ 17 et al 1998 65/M Floor of the mouth - - - - - Dehiscence, satisfactory result Oral and maxillofacial surgery Nikolaos[ 17 et al 1998 62/M Floor of the mouth - - - - - - Oral and maxillofacial surgery Nikolaos[ 17 et al 1998 72/M Floor of the mouth - - - - - - Oral and maxillofacial surgery Nikolaos[ 17 et al 1998 64/M Floor of the mouth - - - - - - Oral and maxillofacial surgery Nikolaos[ 17 et al 1998 65/M Floor of the mouth - - - - - - Annals of plastic surgery Nedİm[ 18 et al 2001 68/M left lateral side of the upper lip - 85% 6×2.5 cm - - no microstomia The Cleft palate-craniofacial journal A.r. erç S.[ 19 et al 2003 65/F - - - - - - - The Journal of Craniofacial Surgery Takaya Makiguchi,[ 20 et al 2005 59/M Lower lip 4.8×2 80% 8×5 - - - Journal of Plastic and Reconstructive Surgery and Hand Surgery Gianvittorio[ 21 2009 64/M Lower lip 4.2 - - - - - Maxillofacial Oral Surgery Shakti Singh[ 22 et al 2010 75/M Anterior alveolus 3×1.5 cm 25% 4×2 × m - The Journal of Craniofacial Surgery Takaya[ 23 et al 2013 59/M Lower lip 4.8×2 cm 80% - - - - The Journal of Dermatology Nakamura,[ 24 et al 2013 66/M columella 2 cm - - - - - Medicina Oral, Patología Oral y Cirugía Bucal Alonso-Rodríguez, [ 25 et al 2014 77/M Floor of the mouth - - - - Orocutaneous fistula, hematoma - Canadian Journal of Plastic Surgery Gupta, Sandipan,[ 26 et al 2015 41/M Lower lip - 100% 5×3 Ligated - - Anais Brasileiros de Dermatologia Coutinho, Inês,[ 27 et al 2015 93/M Lower lip 3 cm 80% - - - - Plastic and Reconstructive Surgery Osugi, Ikuko,[ 28 et al 2021 67/M Nasal tip 1×1.2 2.6×3.2 - - - Journal of the Chinese Medical Association Tsai,[ 29 et al 2022 58 M Lower lip 2.2×2.1 50% 5.0×2.5 Ligated Flap tip necrosis - Journal of the Chinese Medical Association[ 27 Tsai,[ 29 et al 2022 84 M Lower lip 2.5×1.5 75%-100% 7.0×3.0 Ligated - - Journal of the Chinese Medical Association Tsai,[ 29 et al 2022 74 M Lower lip 1.5×1.2 50%-75% 6.5×2.5 - Orocutaneous fistula - Journal of the Chinese Medical Association Tsai,[ 29 et al 2022 80 M Lower lip 1.5×1.3 50-75% 6.5×2.5 - - - Journal of the Chinese Medical Association Tsai,[ 29 et al 2022 71 M Lower lip 2.2×1.6 50-75% 6.5×2.5 - - - Journal of the Chinese Medical Association Tsai,[ 29 et al 2022 59 M Commissure 1.4×1.4 25% 6.0×3.0 - - Mild trismus Journal of the Chinese Medical Association Tsai,[ 29 et al 2022 61 M Commissure 1.4×1.2 25% 6.0×2.5 - - Mild trismus Journal of the Chinese Medical Association Tsai,[ 29 et al 2022 53 M Commissure 1.5×1.3 25% 5.0×2.5 - Wound dehiscence Mild trismus incompetence Compared to other reconstructive techniques, such as the Webster, Karapandzic, or Gillies flaps, the bilateral nasolabial flap approach has several advantages. These flaps can be susceptible to microstomia, trismus, and distortion of the commissure, which can be particularly problematic for patients requiring adjuvant radiotherapy. In contrast, the bilateral nasolabial flap used in the present case provided good oral competency, speech, and facial expression without any significant intraoperative or postoperative complications, as also observed by Gupta S (2012) and Hamahata A (2017).[ 14 15 In the present study aesthetic results were quite satisfactory as the color and texture of the nasolabial flap blended well with the surrounding tissues, maintaining the natural appearance of the lower lip. This is an important consideration as restoring the aesthetics of the lip is crucial for the patient’s psychological and social well-being. The flap was harvested according to the vertical and horizontal dimensions of the defect, preserving the inter-commissural distance and preventing the complication of microstomia, which can lead to trismus. Collateral supply from both flaps makes it highly vascular, which contributes to the longevity of bilateral flaps, as seen in the present case. The functional movement of the lower lip is retained by depressor anguli oris and depressor labii inferioris muscles that are sutured with the flap. Generally, the complication rate is low in these cases. In a study by Singh et al 16 CONCLUSION The nasolabial flap has long been described as a workhorse in the reconstruction of facial defects for immediate reconstruction after intraoral cancer resection. Flap vascularity remained reliable even after facial artery ligation. In cases of advanced oral cavity cancer involving one of the commissures, a reliable surgical technique for subtotal repair of the lower lip is the use of bilateral nasolabial flaps. The nasolabial flap is often considered a better option than microvascular flaps for certain types of lip reconstruction for a few key reasons:  Technically less demanding Reliable blood supply Color match texture match Flap thickness comparable to lip thickness Shorter operative time Lack of donor site morbidity A bilateral nasolabial flap is preferred as a salvage flap in cases of free flap failure and comorbid, financially restrained patients. It presents a reliable, convenient, low-morbidity solution that is locally accessible to tissue in close proximity to the defect. The technique is not difficult to master and is used to reconstruct defects as large as 5 cm. Flap vascularity is reliable due to the rich collateral blood supply. The donor wound closes easily and results in a well-camouflaged scar in postoperative follow-ups. Declaration of patient consent The authors certify that they have obtained all appropriate patient consent forms. In the form, the patient has given his consent for his images and other clinical information to be reported in the journal. The patient understands that his name and initials will not be published and due efforts will be made to conceal identity, but anonymity cannot be guaranteed. Conflicts of interest There are no conflicts of interest. REFERENCES 1. Deschler DG Day T Quick reference guide to oral and oropharyngeal cancer staging American Academy of Otolaryngology-Head and Neck Surgery Foundation 2008 2. Salgarelli AC Sartorelli F Landini B Pignataro L Bellini P Surgical treatment of oral cancer: A review of the literature Minerva Stomatol 2009 58 321 46 3. Schliephake H Schmelzeisen R Schönweiler R Schneller T Altenbernd C Speech, deglutition and life quality after intraoral tumour resection. A prospective study Int J Oral Maxillofac Surg 1998 27 99 105 9565264 10.1016/s0901-5027(98)80304-4 4. Brown JS Lowe D Kalavrezos N D’Souza J Magennis P Woolgar J Patterns of invasion and routes of tumor entry into the mandible by oral squamous cell carcinoma Head Neck 2002 24 370 83 11933179 10.1002/hed.10062 5. Herbert DC Harrison RG Nasolabial subcutaneous pedicle flaps Br J Plast Surg 1975 28 85 9 1156732 10.1016/s0007-1226(75)90163-0 6. Neligan PC Gullane PJ Vesely M Murray D Flap selection in cheek reconstruction: The role of the dorsalis pedis flap Plast Reconstr Surg 2005 116 1566 73 7. Furuta S Shirai H Reconstruction of the lower lip and cheek with a combination of the nasolabial and platysma myocutaneous flaps Ann Plast Surg 1985 15 135 42 8. Ayad T Kolhatkar MA Poirier J de Almeida JR Ayad V Mlynarek AM The pedicled nasolabial flap revisited: An excellent option for reconstruction of small to medium oral cavity defects J Otolaryngol Head Neck Surg 2018 47 38 doi: 10.1186/s40463-018-0284-3 9. Maillard GF Landry M The nasolabial flap in the reconstruction of the lower lip Plast Reconstr Surg 1980 65 458 66 10. Sabri A Chuang SK Dodson TB Nasolabial flap reconstruction of maxillary and oromandibular defects: A review of 985 cases Int J Oral Maxillofac Surg 2012 41 18 24 11. Mathes SJ Nahai F Reconstructive Surgery: Principles, Anatomy, and Technique 2 New York, NY Churchill Livingstone 1997 12. Pribaz JJ Meara JG Wright S Smith JD Stephens W Breuing KH Lip and vermilion reconstruction with the facial artery musculomucosal flap Plast Reconstr Surg 2000 105 864 72 10724244 10.1097/00006534-200003000-00007 13. Kademani D Oral cancer Mayo Clin Proc 2007 82 878 87 17605971 10.4065/82.7.878 14. Gupta S Kumar V Pal US Singh RK Mohammad S Single-stage total reconstruction of the lower lip using a combination of an inferiorly based nasolabial flap and a bucket handle flap from the upper lip Int J Oral Maxillofac Surg 2012 41 718 21 15. Hamahata A Baba S Hatoko M Muraoka M Nakata K A combined Webster and Johanson method for near-total lower lip reconstruction Plast Reconstr Surg Glob Open 2017 5 e1254 16. Singh S Singh RK Pandey M Nasolabial flap reconstruction in oral cancer World J Surg Oncol 2012 10 227 23110587 10.1186/1477-7819-10-227 PMC3544680 17. Lazaridis N Zouloumis L Venetis G Karakasis D The inferiorly and superiorly based nasolabial flap for the reconstruction of moderate-sized oronasal defects J Oral Maxillofac Surg 1998 56 1255 9 9820212 10.1016/s0278-2391(98)90603-6 18. Sarifakioğlu N Aslan G TerzIoğlu A Ateş L New technique of one-stage reconstruction of a large full-thickness defect in the upper lip: Bilateral reverse composite nasolabial flap Ann Plast Surg 2002 49 207 10 12187351 10.1097/00000637-200208000-00016 19. Erçöçen AR Yilmaz S Saydam M Bilateral superiorly based full-thickness nasolabial island flaps for closure of residual anterior palatal fistulas in an unoperated elderly patient Cleft Palate Craniofac J 2003 40 91 9 12498612 10.1597/1545-1569_2003_040_0091_bsbftn_2.0.co_2 20. Makiguchi T Yokoo S Miyazaki H Soda T Terashi H Combined bilateral hatchet and nasolabial advancement flaps for a large defect of the lower lip J Craniofac Surg 2013 24 e588 90 24220473 10.1097/SCS.0b013e31829ad3dc 21. Campus G Standoli N Alfano C Reconstruction of the lower lip with a full thickness nasolabial island flap Scand J Plast Reconstr Surg Hand Surg 1994 28 285 8 7899839 10.3109/02844319409022013 22. Deora SS Nanjappa M Kumaraswamy SV Bilateral pedicled nasolabial flaps for the anterior alveolus mandibular defect: A review J Maxillofac Oral Surg 2010 9 385 8 22190830 10.1007/s12663-010-0135-3 PMC3177480 23. Takaya M Satoshi Y Hidetaka M Takashi S Hiroto T Combined bilateral hatchet and nasolabial advancement flaps for a large defect of the lower lip Journal of Craniofacial Surgery 2013 24 e588 90 24220473 10.1097/SCS.0b013e31829ad3dc 24. Nakamura Y Nakamura Y Saito A Fujisawa Y Kawachi Y Otsuka F High‐grade mucoepidermoid carcinoma of the columella successfully reconstructed using bilateral nasolabial flaps set up in a sandwich shape and an auricular cartilage graft after surgical resection J Dermatol 2013 40 911 4 24127775 10.1111/1346-8138.12274 25. Alonso-Rodríguez E Cebrián-Carretero JL Morán-Soto MJ Burgueño-García M Versatility of nasolabial flaps in oral cavity reconstructions Medicina Oral, Patología Oral y Cirugía Bucal 2014 19 e525 30 24880439 10.4317/medoral.19376 PMC4192579 26. Gupta S Chattopadhyay D Murmu MB Gupta S Singh HS A new technique for one-stage total lower lip reconstruction: Achieving the perfect balance Can J Plast Surg 2013 21 57 61 24431942 10.1177/229255031302100101 PMC3891103 27. Coutinho I Ramos L Gameiro AR Vieira R Figueiredo A Lower lip reconstruction with nasolabial flap-going back to basics Anais Brasileiros de Dermatologia 2015 90 206 8 26312718 10.1590/abd1806-4841.20153714 PMC4540552 28. Osugi I Inagawa K Ebisudani S Hara Naoki Usefulness of a Skin Graft Obtained from the bilateral Nasolabial folds for a skin defect following resection of a malignant tumor at the nasal tip Plast Reconstr Surg Global Open 2021 9 e3481 doi: 10.1097/GOX.0000000000003481 10.1097/GOX.0000000000003481 PMC7997127 33786263 29. Tsai CS Chang CC Hsiao JR Inferiorly based nasolabial flap for reconstruction of full-thickness medium-sized lower lip and commissural defects following ablative cancer surgery J Chin Med Assoc 2022 85 1083 7 36343273 10.1097/JCMA.0000000000000805 ",
  "metadata": {
    "Title of this paper": "Inferiorly based nasolabial flap for reconstruction of full-thickness medium-sized lower lip and commissural defects following ablative cancer surgery",
    "Journal it was published in:": "National Journal of Maxillofacial Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469060/"
  }
}