{
  "title": "Paper_458",
  "abstract": "pmc School Ment Health School Ment Health 365 springeropen School Mental Health 1866-2625 1866-2633 pmc-is-collection-domain yes pmc-collection-title Springer PMC12479681 PMC12479681.1 12479681 12479681 41036107 10.1007/s12310-025-09776-9 9776 1 Original Paper Individual and School Environment Predictors of Mental Health and Wellbeing Across the Primary-to-Secondary School Transition http://orcid.org/0000-0003-3307-1991 Donaldson Caitlyn DonaldsonCJ@cardiff.ac.uk 1 2 http://orcid.org/0000-0002-1998-9547 Hawkins Jemma 1 2 http://orcid.org/0000-0002-6136-3978 Moore Graham 1 2 1 https://ror.org/03kk7td41 grid.5600.3 0000 0001 0807 5670 Centre for Development, Evaluation, Complexity and Implementation in Public Health Improvement (DECIPHer), Cardiff University, 2 https://ror.org/03kk7td41 grid.5600.3 0000 0001 0807 5670 Wolfson Centre for Young People’s Mental Health, Cardiff University, 25 6 2025 2025 17 3 497829 890 902 23 5 2025 25 06 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Transition from primary to secondary school is an important life event for young people that may have impacts on mental health. Objective and subjective measures of the school environment may be associated with mental health outcomes post-transition. Pre-transition (year 6, aged 10–11) survey data from young people in Wales, UK, were linked to post-transition (year 7, aged 11–12) survey data ( n Supplementary Information The online version contains supplementary material available at 10.1007/s12310-025-09776-9. Keywords Mental health Mental wellbeing School transition Socioeconomic status Meaningfulness http://dx.doi.org/10.13039/501100000269 Economic and Social Research Council http://dx.doi.org/10.13039/100012068 Health and Care Research Wales 517206 517206 Hawkins Jemma Moore Graham http://dx.doi.org/10.13039/501100001320 Wolfson Foundation 517483 517483 517483 Donaldson Caitlyn Hawkins Jemma Moore Graham pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2025 Introduction The transition from primary to secondary school is an important life event for young people. While for many it is a positive experience that is perceived as an exciting challenge, for others it is viewed as a threat to their mental health (Sirsch, 2003 2005 2013 The impact that transition has on a young person’s mental health is a function of both their own personal resources and the school environment that they are transitioning into (Donaldson et al., 2023a 2010 2011 2021 2021 2003 There are objective and subjective measures of school environment. Objective measures are based on school data, such as school size and physical amenities, discipline policies and pupil-to-teacher ratio (Bonell et al., 2013 Objective Measures of the School Environment: Value-Added Education In addition to those highlighted above, measures of value-added education provide an interesting perspective on school environment. They have typically been used as a means of assessing school performance by measuring student academic outcomes adjusted for student demographic background (Leckie & Goldstein, 2019 2004 2017 The value-added measure used within these studies uses two objective outcomes—attendance and attainment—and then constructs a model that seeks to predict these two outcomes based on the demographic characteristics of a school. Where schools are doing better in terms of their attendance and attainment than would be predicted based on their demographics, they have a positive residual value (i.e. their true value is above the line of best fit), where schools are doing worse in terms of their attendance and attainment than would be predicted based on their demographics, they have a negative residual value (i.e. their true value is below the line of best fit). Schools with a positive residual are adding value to their students by producing better outcomes than would be predicted based on the school’s demographics alone. Markham ( 2015 Whether a school is perceived to be meaningful by its students will depend on the two cultural orders being transmitted by the school—the regulatory and instructional orders (Bernstein, 1975 2021 2004 When young people transition from primary to secondary school, it is the point at which the young person’s own cultural background first interacts with the culture of the secondary school. This interaction may be positive, where the two cultures align and complement each other, or more problematic where the young person finds the school culture to be incongruent with their home values and aspirations. Both social class and cultural heritage can determine the values, aspirations and expectations that a young person will bring into the school environment with them. However, as schools typically reflect a middle class understanding of the aims and means of education, often focused on material prosperity (Markham et al., 2021 For a young person who finds the school culture to be opposed to or to conflict with their home culture, transition may be a more stressful experience. It is therefore unsurprising that transition is a point in the life course when some students begin to disengage from education (Hascher & Hadjar, 2018 2020 2021 This value-added ‘meaningfulness’ measure has been used to explain why smoking uptake, early alcohol initiation, heavy alcohol consumption, illicit drug use, stealing and fighting are lower in some schools than others (Aveyard et al., 2004 2007 2017 2008 2011 2008 2015 Subjective Measures of School Environment Alongside objective approaches, self-report measures that seek to understand young people’s own perceptions of the school environment can help to provide subjective measures of the extent to which a young person may be committed to school orders. In particular, self-report measures of school connectedness provide important insights into the school environment. While there is no globally accepted definition of school connectedness, it is typically treated as a multi-dimensional construct that measures a number of different dimensions including acceptance and care, belonging, liking and enjoying, respect and support (García-Moya et al., 2019 2024 2022 2024 Previous analysis has shown that measures of school connectedness are significantly associated with mental health difficulties in the first year after transition to secondary school (Donaldson et al., 2024 2015 This research will use primary and secondary school linked data from Wales, UK, to follow young people across school transition and consider how factors on both sides of transition might be associated with post-transition mental health and wellbeing outcomes. The three research questions are therefore: Are individual-level factors (pre-transition mental health difficulties, SES, gender and being worried about transition) associated with mental health difficulties and mental wellbeing outcomes following transition to secondary school? Are young people’s perceptions of secondary school (sense of belonging, whether teachers care about them and whether their ideas are taken seriously) associated with mental health difficulties and mental wellbeing outcomes following transition to secondary school? To what extent is meaningfulness, as a measure of secondary school environment, associated with mental health difficulties and mental wellbeing outcomes following the transition to secondary school? Methods This analysis uses linked data from 506 students across two school surveys in Wales, UK. The first (‘CHETS’) took place when students were in the final year of primary school (year 6, aged 10–11 years) and the second, the School Health Research Network (SHRN) survey, took place the following academic year in the first year of secondary school (year 7, age 11–12 years). CHETS was carried out in the spring/summer of 2019 prior to transition and SHRN in the autumn/winter of 2019, post-transition. Both surveys involved three levels of informed consent. Schools signed an agreement to take part in a survey and provided parents with study information and details of opt-out consent procedures, provided by the research team. Parents were provided materials two weeks before the survey and asked to notify the school if they did not want their child to take part. For the CHETS survey in primary schools, researchers visited each school and provided pupils with an oral description of the study within their usual classroom setting. Pupils then completed an assent form prior to participation in the survey, conducted using paper forms. For the SHRN survey in secondary schools, the survey was conducted online in schools. In both surveys, pupils were advised that participation was voluntary, that they could choose not to complete any items they did not want to and that they could stop at any time without giving a reason. Ethical approval for both surveys, as well as the secondary data analysis provided in this paper, were provided by the Cardiff University School of Social Sciences Research Ethics Committee (SREC/2700, SREC/3251 and SREC/3652). The full CHETS survey included 2170 respondents from 73 primary schools across Wales (Moore et al., 2020 2021 2020 Of the students for whom data was linked, the majority transitioned with a large group of their peers to the same secondary school. Ninety students were excluded from analyses due to non-standard transition. These included situations where young people from an English language medium primary transitioned to a Welsh medium secondary, while the majority of their cohort transitioned to a common English language secondary; where young people transitioned to a faith school rather than their catchment secondary and in one case where young people were split at transition into separate boys and girls secondary schools. Mapping and understanding these different types of non-standard transition, where young people’s experiences are likely to be different to those transitioning with the majority of their cohort, would require a larger sample size. Given the relatively small sample, it was therefore decided to focus on the more dominant, standard form of primary-to-secondary transition. A flowchart of how the final sample of 506 students was obtained is given in Online Appendix 1 The characteristics of the final sample of 506 young people were compared to the year 7 students included in the full SHRN survey ( n Measures School-Level Meaningfulness Measure A value-added meaningfulness measure was developed in line with approaches used in previous studies (Aveyard et al., 2004 2007 2017 2008 2011 2022 Variables were selected to align as closely as possible to previous meaningfulness scales, but were restricted to what data was publicly available. To create the meaningfulness measure, data were extracted on attainment and attendance, and on five predictor variables: the three-year average percentage of students eligible for FSMs; the welsh index of multiple deprivation (WIMD) score for each school’s postcode; the proportion of females in the school; the proportion of students without White British ethnicity; and the proportion of young people with special educational needs (SEN). Attainment was measured using the Capped 9 Points Score, which is calculated for each student in year 11 (age 16) in Wales based on achievement at GCSE level (Welsh Government, 2019 = Two linear regression models were developed (Tobler et al., 2011 r Mental Health Measures Outcome measures were selected based on their validation for different age groups. The strengths and difficulties questionnaire (SDQ) and short Warwick Edinburgh mental wellbeing scale (SWEMWBS) are only validated for use from age 11 (Goodman, 1997 2019 2009 2013 M&MF contains 16 items, of which 10 comprise an emotional difficulties scale and six comprise a behavioural difficulties scale. Respondents respond ‘never’, ‘sometimes’ or ‘always’ to a list of items. For the emotional difficulties scale, items include: ‘I feel lonely’, ‘I cry a lot’, ‘Nobody likes me’, ‘I have problems sleeping’. For the behavioural difficulties scale, items include: ‘I get very angry’, ‘I lose my temper’, ‘I do things to hurt people’, ‘I break things on purpose’. Each item is scored from 0 to 2 and summed. Cronbach’s α was 0.78 for emotional difficulties and 0.77 for behavioural difficulties. The SWEWMBS asks respondents to the state the extent to which seven statements describe their experience over the last two weeks. Responses scored from 1 to 5 on a Likert scale, and higher scores indicating higher wellbeing ( α The self-report SDQ measure is a 25-item scale comprising five subscales of five items, with each item scored from 0 to 2 (‘Not true’, ‘somewhat true’, ‘certainly true’). One of the subscales (the prosocial scale) was not used in this analysis as it represents a narrower conceptualisation of strengths than the SWEMWBS measure and does not contribute to the scoring of difficulties. Young people are asked to answer based on their experiences over the past six months. Four of the five subscales can be summed to give a total difficulties score ( α α α α α 2001 As emotional problems and conduct problems are not necessarily present concurrently in the same young people, and the M&MF scale includes emotional and behavioural difficulties scales that aligned with these two subscales, the analysis also used the two SDQ subscales (emotional problems and conduct problems) separately as dependent variables, with their associated M&MF subscale as a covariate. School Connectedness Measures Three items were used to assess aspects of school connectedness, with young people asked to rate on a five-point Likert scale the extent to which they agreed or disagreed that ‘I feel like I belong at this school’, ‘I feel that my teachers care about me as a person’ and ‘At our school my ideas are taken seriously’. Items were reverse-scored so that higher values indicated more positive school connectedness. The latter two items are derived from the World Health Organization (WHO) Health Behaviour in School-aged Children (HBSC) survey (Badura et al., 2024 Worried About Transition A single item from the year-6 survey that asked students to what extent they were worried about the transition to secondary school was used. It was scored on a Likert scale from 1 (not at all) to 5 (very much). Demographic Measures The family affluence scale (FAS) was administered to assess SES of participants in year 7. The six items include: whether the family owns a car or other vehicle, whether the young person has their own bedroom, the number of computers in the home, how many bathrooms are in the home, the number of holidays in the past year and whether they have a dishwasher (Boyce et al., 2006 Missing Data For measures made of multiple items, where more than half of the items had a response, a pro-rated score was calculated. There was an overall relatively low level of missing data across the individual- and school-level variables within the final sample of 506 young people (Online Appendix 4). In order to account for missingness, data were cleaned in Stata 15.0 and then transferred to R version 4.3.1 for multiple imputation (MI). Substantive model compatible multi-level MI was used (Quartagno & Carpenter, 2022 2023 2014 Multi-Level Modelling A series of hierarchical linear mixed-effects models for each outcome measure were developed to answer the research questions. A likelihood ratio (LR) test was run on the first imputation (it is not possible to run LR tests on imputed data) to determine whether a three-level model (students in primary schools in secondary schools) was a better fit for the data than a two-level model (students in secondary schools). For all outcomes, the three-level model was not a significantly better fit and therefore two-level models (students in secondary schools) were run for all outcomes. Unadjusted models were run to calculate intra-class correlation coefficients for secondary school mental health outcomes (ICCs) (Appendix 10). The first adjusted model included pre-transition mental health measures, gender and family affluence. The SDQ emotional and conduct problems subscales were matched with their relevant pre-transition indicator (the former with the pre-transition emotional difficulties variable, and the latter with the pre-transition behavioural difficulties variable). For SWEMWBS and SDQ total difficulties, both pre-transition mental health measures were controlled for. The second adjusted model included all remaining individual-level predictors (being worried about transition and the school connectedness items). The final model added the school-level variables. All imputed models and sensitivity analyses are presented in Appendices 6–9. Results Descriptive Statistics The standardised meaningfulness scores produced for each school were normally distributed. In the full meaningfulness dataset (total secondary schools = 199), there were 25 ‘high’ meaningfulness schools (> + 1SD from the mean) and 27 ‘low’ meaningfulness schools (< -1SD from the mean). Meaningfulness had little correlation with the percentage of students eligible for free school meals ( r r r Within the CHETS-SHRN school data, over half of pupils were female (54%) and the majority (84%) were of White British ethnicity. Sample descriptives are presented in Table 1 2 Table 1 Descriptive statistics of sample N Gender Male 233 (46.0%) Female 273 (54.0%) Ethnicity White British 413 (83.8%) Other Ethnicity 80 (16.2%) Family structure Live with Mum and Dad 328 (65.9%) Other family structure 170 (34.1%) Family affluence Low (0–8) 170 (35.3%) Medium (9–10) 144 (29.9%) High (11–13) 167 (34.7%) Mean (standard deviation) range Pre-transition emotional difficulties (M&MF) 6.2 (3.6) 0–19 Pre-transition behavioural difficulties (M&MF) 2.7 (2.3) 0–11 Post-transition total difficulties (SDQ) 10.7 (6.4) 0–31 Post-transition emotional problems (SDQ) 3.4 (3.4) 0–10 Post-transition conduct problems (SDQ) 1.8 (1.8) 0–8 Post-transition mental wellbeing (SWEMWBS) 22.6 (4.6) 7–35 Worried about secondary 2.8 (1.4) 1–5 School belonging 4.1 (0.9) 1–5 Teachers care 4.0 (1.0) 1–5 My ideas taken seriously 3.7 (1.1) 1–5 SWEMWBS, short Warwick Edinburgh mental wellbeing scale; SDQ, strengths and difficulties questionnaire; M&MF, me and my feelings questionnaire. Statistics calculated pre−multiple imputation Table 2 Correlation (Pearson’s r) between mental health and wellbeing scales Pre-transition emotional difficulties (M&MF) Pre-transition behavioural difficulties (M&MF) Post-transition total difficulties (SDQ) Post-transition emotional problems (SDQ subscale) Post-transition conduct problems (SDQ subscale) Post-transition mental wellbeing (SWEMWBS) Pre-transition emotional difficulties (M&MF) 1.00 – – – – – Pre-transition behavioural difficulties (M&MF) 0.34 ( p 1.00 – – – – Post-transition total difficulties (SDQ) 0.39 ( p 0.29 ( p 1.00 – – – Post-transition emotional problems (SDQ subscale) 0.43 ( p 0.15 ( p 0.77 ( p 1.00 – – Post-transition conduct problems (SDQ subscale) 0.23 ( p 0.38 ( p 0.74 ( p 0.33 ( p 1.00 – Post-transition mental wellbeing (SWEMWBS) − 0.31 ( p − 0.25 ( p − 0.57 ( p − 0.47 ( p − 0.39 ( p 1.00 SWEMWBS, short Warwick Edinburgh mental wellbeing scale; SDQ, strengths and difficulties questionnaire; M&MF, me and my feelings questionnaire. Correlations calculated pre−multiple imputation Multi-Level Analysis Unadjusted ICCs ranged from 0.024 for emotional difficulties to 0.067 for conduct problems, in line with other research on mental health in schools (Parker et al., 2023 2016 3 Table 3 Final multi-level regression models for all outcomes ( n Post-transition mental wellbeing (SWEMWBS) Post-transition total difficulties (SDQ) Post-transition emotional problems (SDQ subscale) Post-transition conduct problems (SDQ subscale) β P β P β P β P Emotional difficulties (M&MF) − 0.12 (− 0.24, − 0.01) p 0.43 (0.28, 0.59) p 0.20 (0.14, 0.26) p – – Behavioural difficulties (M&MF) − 0.30 (− 0.46, − 0.13) p 0.40 (0.13, 0.66) p – – 0.28 (0.21, 0.35) p p Female − 0.01 (− 0.72, 0.69) p − 0.87 (− 1.82, 0.08) p 0.35 (− 0.04, 0.75) p − 0.39 (− 0.68, − 0.09) p Family affluence scale 0.18 (0.03, 0.34) p − 0.30 (− 0.50, − 0.09) p − 0.08 (− 0.16, 0.01) p − 0.05 (− 0.12, 0.02) p Worried secondary − 0.28 (− 0.57, 0.01) p 0.21 (− 0.19, 0.61) p 0.23 (0.02, 0.43) p 0.04 (− 0.07, 0.15) p School belonging 0.82 (0.39, 1.25) p − 0.74 (− 1.32, − 0.15) p − 0.31 (− 0.57, − 0.06) p − 0.12 (− 0.32, 0.09) p Teacher cares 0.79 (0.38, 1.20) p − 1.71 (− 2.31, − 1.12) p − 0.20 (− 0.45, 0.05) p − 0.42 (− 0.62, − 0.21) p Ideas taken seriously 0.89 (0.51, 1.27) p − 0.97 (− 1.45, − 0.48) p − 0.47 (− 0.68, − 0.26) p − 0.07 (− 0.23, 0.10) p School % free school meals − 0.00 (− 0.07, 0.07) p − 0.05 (− 0.15, 0.06) p − 0.03 (− 0.07, 0.00) p − 0.01 (− 0.04, 0.02) p Meaningfulness 0.54 (0.05, 1.03) p − 0.00 (− 0.73, 0.72) p 0.07 (− 0.18, 0.32) p − 0.05 (− 0.29, 0.18) p Residual variance 13.99 (12.28, 15.93) 25.61 (22.40, 29.27) 4.46 (3.91, 5.09) 2.44 (2.14, 2.78) SWEMWBS, short Warwick Edinburgh mental wellbeing scale; SDQ, strengths and difficulties questionnaire; M&MF, me and my feelings questionnaire (pre−transition measure) For all outcomes, pre-transition mental health was a significant predictor of post-transition mental health. Post-transition conduct problems were significantly lower for females [ β β β β Higher perceptions of school connectedness post-transition were associated with higher post-transition wellbeing and lower post-transition difficulties, although the strength of the association varied by school connectedness item and outcome measure. Sense of belonging and having their ideas taken seriously were associated with significantly higher wellbeing, lower total difficulties and lower emotional difficulties. Perceptions that their teachers care them were associated with significantly higher mental wellbeing, lower total difficulties and lower conduct problems. At the school level, % of students eligible for free school meals within each secondary school was not a significant predictor in any of the models. High school meaningfulness in secondary school was significantly associated with more positive post-transition mental wellbeing outcomes [ β Discussion This analysis has sought to investigate both individual-level and school-level predictors of mental health in the transition from primary to secondary school. For all outcome measures and models, pre-transition scores of emotional and/or behavioural difficulties were significant, suggesting that the most consistent predictor of mental health difficulties and low mental wellbeing in year 7 is having equivalent difficulties in year 6. It highlights the importance of early intervention for young people’s mental health. Recent research using data from a 2022–2023 survey of young people in Wales ( n 2023b At the individual level, being worried about the transition to secondary school was associated with higher emotional problems in year 7, even after controlling for related difficulties in year 6 or family affluence. This chimes with the previous research (e.g. Jindal-Snape et al., 2020 2021 2021 2016 Family affluence was a significant predictor of total difficulties and mental wellbeing. The relationship between mental illness and SES has been extensively explored (e.g. Reiss, 2013 2016 2020 2015 2020 Higher perceptions of the three school connectedness items were associated with fewer mental health difficulties and higher mental wellbeing. It highlights the importance of young people having a strong sense of belonging at school, feeling that their teachers care about them and that their ideas are taken seriously. This reflects previous research that points towards a protective effect of school connectedness on mental health (Raniti et al., 2022 2024 2024 2021 2020 2018 For mental health difficulties, there were some differences in which individual-level variables had significant associations with the total difficulties scale and the two SDQ subscales. Being female was associated with lower conduct problems, but not emotional problems or total difficulties. Family affluence was associated with the total difficulties scale, but not the two subscales. Being worried about secondary school was associated with emotional problems, but not total difficulties or conduct problems. Finally, of the school connectedness items, both belonging and having their ideas taken seriously were only associated with total difficulties and emotional problems; perceptions of teacher care was associated with total difficulties and conduct problems but not emotional problems. These findings highlight the nuance of how different aspects of mental health might be associated with different individual-level predictors, and while some of these associations are relatively well documented—e.g. higher externalising problems in boys than girls (Leadbeater et al., 1999 School meaningfulness was associated with mental wellbeing, but not mental health difficulties. There is strong evidence that the two outcomes frequently have different predictors. For example, in migrants to Australia, younger age and being a student was predictive of mental distress but not mental wellbeing, while being self-employed and identifying with Australia was associated with mental wellbeing but not distress (du Plooy et al., 2019 2003 2007 This has implications for intervention development, as it should not be assumed that the same theory of change will apply to efforts to improve both mental illness and mental wellbeing. The effect of school-level meaningfulness on mental wellbeing was small but important. After controlling for individual-level covariates and school-level FSM, a one-unit increase in school meaningfulness will result in an average 0.54-unit increase in mental wellbeing. A one-unit increase in meaningfulness would be slightly more than one standard deviation within this sample (sd = 0.85) and may seem like an unobtainable shift for many schools. However, even a much smaller increase in meaningfulness could have a big impact due to the large numbers of young people within each school (Rose, 2001 2013 However, the direction of effect between meaningfulness and mental wellbeing should also be considered. While a high meaningfulness school-culture may result in higher mental wellbeing in students, the opposite effect may also be true: a school with particularly high numbers of students with high wellbeing would be likely to have higher attendance and attainment leading to a higher meaningfulness score. Further analysis using structural equation modelling to fully understand the pathways between the measures of attendance, attainment, meaningfulness and mental wellbeing might help to better understand the relationships between each of them. More research is also needed into the practical steps that schools can make to increase their meaningfulness as conceptualised here. A school that is highly meaningful for one community may not be for another as it emerges through the interaction between individual students with their own social and cultural heritage, and the culture of the school as determined by school organisation, curriculum and pedagogic practice (Markham & Aveyard, 2003 Situating the findings within the Welsh context also offers opportunities for supporting young people’s mental health. In 2021, the Welsh Government published a framework for embedding a whole school approach to emotional and mental wellbeing (Welsh Government, 2021 This study has a number of key strengths. This is the first analysis of a proxy value-added educational measure as a means of understanding the relationship between school-level meaningfulness and young people’s mental health. It offers an important insight into young people’s experiences over the primary to secondary school transition, highlighting how individual factors, as well as school environment might influence young people’s mental health during an important educational life event. There are also a number of potential limitations to this analysis that should be highlighted. Unlike some of the other studies where a similar meaningfulness measure was developed (Aveyard et al., 2004 2007 2017 2008 2011 A number of hypothesised relationships were non-significant in this analysis when considered based on p p 2019 2019 p 2024 It is also possible that unaccounted for student or school-level effects may be confounding the relationship between meaningfulness and mental wellbeing. As argued by Aveyard et al., ( 2004 The sample may not be fully representative of the Welsh school population. While both surveys used were representative in their entirety, only a subsample of young people who could be linked across the primary to secondary school transition were included in this analysis. The sample had a higher proportion of girls and a lower proportion of young people living with both parents than in the full SHRN survey; however, other variables were closely matched. There may also be confounding variables not measured or included in the analysis that might influence the findings. Conclusion This research highlights the importance of individual- and school-level factors in understanding young people’s experiences of school transition. It highlights opportunities for intervention to support young people across the transition process by targeting school-level factors, as well as underscoring the interplay between individual characteristics and school environment in mental health outcomes. Supplementary Information Below is the link to the electronic supplementary material. Supplementary file1 (DOCX 70 kb) Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Funding This work was funded through an Economic and Social Research Council PhD Studentship (C. Donaldson). It was supported by the Centre for Development, Evaluation, Complexity and Implementation in Public Health Improvement (DECIPHer), which is funded by Welsh Government through Health and Care Research Wales, and the Wolfson Centre for Young People’s Mental Health, established with support from the Wolfson Foundation. This paper involves secondary analysis of two surveys. The primary school survey was funded by Cancer Research UK (CRUK), grant number C57590/A25754. The secondary school survey was funded by Welsh Government. Declarations Conflict of interests The authors have no conflicts of interests to declare. Data access Data are available on reasonable request from the School Health Research Network (shrn@cardiff.ac.uk). References Aveyard P Markham WA Lancashire E Bullock A Macarthur C Cheng KK Daniels H The influence of school culture on smoking among pupils Social Science and Medicine 2004 58 9 1767 1780 10.1016/S0277-9536(03)00396-4 14990377 Aveyard, P., Markham, W. A., Lancashire, E., Bullock, A., Macarthur, C., Cheng, K. K., & Daniels, H. (2004). The influence of school culture on smoking among pupils. Social Science and Medicine, 58 14990377 10.1016/S0277-9536(03)00396-4 Badura, P., Eriksson, C., Garcia-Moya, I., Lofstedt, P., Melkumova, M., Sotiroska, K., Wilson, M., Brown, J., & Inchley, J. (2024). A focus on adolescent social contexts in Europe, central Asia and Canada. Health Behaviour in School-aged Children international report from the 2021/2022 survey. Bernstein B Class, codes and control: Volume 3 towards a theory of educational transmissions 1975 2 Routledge and Kegan Paul Bernstein, B. (1975). Class, codes and control: Volume 3 towards a theory of educational transmissions Bisset S Markham WA Aveyard P School culture as an influencing factor on youth substance use Journal of Epidemiology and Community Health 2007 61 6 485 490 10.1136/jech.2006.048157 17496256 PMC2465725 Bisset, S., Markham, W. A., & Aveyard, P. (2007). School culture as an influencing factor on youth substance use. Journal of Epidemiology and Community Health, 61 17496256 10.1136/jech.2006.048157 PMC2465725 Bonell C Parry W Wells H Jamal F Fletcher A Harden A Thomas J Campbell R Petticrew M Murphy S Whitehead M Moore L The effects of the school environment on student health: A systematic review of multi-level studies Health and Place 2013 21 180 191 10.1016/j.healthplace.2012.12.001 23501377 Bonell, C., Parry, W., Wells, H., Jamal, F., Fletcher, A., Harden, A., Thomas, J., Campbell, R., Petticrew, M., Murphy, S., Whitehead, M., & Moore, L. (2013). The effects of the school environment on student health: A systematic review of multi-level studies. Health and Place, 21 23501377 10.1016/j.healthplace.2012.12.001 Bonell C Shackleton N Fletcher A Jamal F Allen E Mathiot A Markham W Aveyard P Viner R Student- and school-level belonging and commitment and student smoking, drinking and misbehaviour Health Education Journal 2017 76 2 206 220 10.1177/0017896916657843 Bonell, C., Shackleton, N., Fletcher, A., Jamal, F., Allen, E., Mathiot, A., Markham, W., Aveyard, P., & Viner, R. (2017). Student- and school-level belonging and commitment and student smoking, drinking and misbehaviour. Health Education Journal, 76 Boyce W Torsheim T Currie C Zambon A The family affluence scale as a measure of national wealth: Validation of an adolescent self-report measure Social Indicators Research 2006 78 3 473 487 10.1007/s11205-005-1607-6 Boyce, W., Torsheim, T., Currie, C., & Zambon, A. (2006). The family affluence scale as a measure of national wealth: Validation of an adolescent self-report measure. Social Indicators Research, 78 Carnahan RM Brown GD The power and pitfalls of underpowered studies Pharmacotherapy: The Journal of Human Pharmacology and Drug Therapy 2024 44 9 698 700 10.1002/phar.4605 39225370 Carnahan, R. M., & Brown, G. D. (2024). The power and pitfalls of underpowered studies. Pharmacotherapy: The Journal of Human Pharmacology and Drug Therapy, 44 10.1002/phar.4605 39225370 Deighton J Tymms P Vostanis P Belsky J Fonagy P Brown A Martin A Patalay P Wolpert M The development of a school-based measure of child mental health Journal of Psychoeducational Assessment 2013 31 3 247 257 10.1177/0734282912465570 25076806 PMC4107815 Deighton, J., Tymms, P., Vostanis, P., Belsky, J., Fonagy, P., Brown, A., Martin, A., Patalay, P., & Wolpert, M. (2013). The development of a school-based measure of child mental health. Journal of Psychoeducational Assessment, 31 25076806 10.1177/0734282912465570 PMC4107815 Donaldson C Moore G Hawkins J Conceptualising the primary to secondary school transition within the theoretical framework of ecosocial theory International Journal of Educational and Life Transitions 2023 10.5334/ijelt.61 Donaldson, C., Moore, G., & Hawkins, J. (2023). Conceptualising the primary to secondary school transition within the theoretical framework of ecosocial theory. International Journal of Educational and Life Transitions Donaldson C Morgan K Page N Angel L Moore G Mental health, bullying and school connectedness: A comparative analysis of school transition at age 11 from within the Welsh education system British Educational Research Journal 2024 10.1002/berj.3985 Donaldson, C., Morgan, K., Page, N., Angel, L., & Moore, G. (2024). Mental health, bullying and school connectedness: A comparative analysis of school transition at age 11 from within the Welsh education system. British Educational Research Journal Donaldson, C., Ouerghi, S., Angel, L., Anthony, R., Boffey, M., Edwards, A., Hawkins, J., Lennon, J., MacKay, K., Murphy, S., Morgan, K., & Moore, G. (2023). Student Health and Wellbeing in Wales: Key findings from the 2022/23 School Health Research Network Primary School Student Health and Wellbeing Survey https://www.shrn.org.uk/national-data/ du Plooy DR Lyons A Kashima ES Predictors of flourishing and psychological distress among migrants to Australia: A dual continuum approach Journal of Happiness Studies 2019 20 2 561 578 10.1007/s10902-018-9961-7 du Plooy, D. R., Lyons, A., & Kashima, E. S. (2019). Predictors of flourishing and psychological distress among migrants to Australia: A dual continuum approach. Journal of Happiness Studies, 20 García-Moya I Bunn F Jiménez-Iglesias A Paniagua C Brooks FM The conceptualisation of school and teacher connectedness in adolescent research: A scoping review of literature Educational Review 2019 71 4 423 444 10.1080/00131911.2018.1424117 García-Moya, I., Bunn, F., Jiménez-Iglesias, A., Paniagua, C., & Brooks, F. M. (2019). The conceptualisation of school and teacher connectedness in adolescent research: A scoping review of literature. Educational Review, 71 Goodman R The strengths and difficulties questionnaire: A research note Journal of Child Psychology and Psychiatry and Allied Disciplines 1997 38 5 581 586 10.1111/j.1469-7610.1997.tb01545.x 9255702 Goodman, R. (1997). The strengths and difficulties questionnaire: A research note. Journal of Child Psychology and Psychiatry and Allied Disciplines, 38 9255702 10.1111/j.1469-7610.1997.tb01545.x Goodman R Psychometric properties of the strengths and difficulties questionnaire Journal of the American Academy of Child and Adolescent Psychiatry 2001 40 11 1337 1345 10.1097/00004583-200111000-00015 11699809 Goodman, R. (2001). Psychometric properties of the strengths and difficulties questionnaire. Journal of the American Academy of Child and Adolescent Psychiatry, 40 11699809 10.1097/00004583-200111000-00015 Halsey LG The reign of the p-value is over: What alternative analyses could we employ to fill the power vacuum? Biology Letters 2019 15 5 1 9 10.1098/rsbl.2019.0174 PMC6548726 31113309 Halsey, L. G. (2019). The reign of the p-value is over: What alternative analyses could we employ to fill the power vacuum? Biology Letters, 15 10.1098/rsbl.2019.0174 PMC6548726 31113309 Hascher T Hadjar A School alienation: Theoretical approaches and educational research Educational Research 2018 60 2 171 188 10.1080/00131881.2018.1443021 Hascher, T., & Hadjar, A. (2018). School alienation: Theoretical approaches and educational research. Educational Research, 60 Hebron JS School connectedness and the primary to secondary school transition for young people with autism spectrum conditions British Journal of Educational Psychology 2018 88 3 396 409 10.1111/bjep.12190 28929487 Hebron, J. S. (2018). School connectedness and the primary to secondary school transition for young people with autism spectrum conditions. British Journal of Educational Psychology, 88 28929487 10.1111/bjep.12190 Ho J Tumkaya T Aryal S Choi H Claridge-Chang A Moving beyond P values: Data analysis with estimation graphics Nature Methods 2019 16 7 565 566 10.1038/s41592-019-0470-3 31217592 Ho, J., Tumkaya, T., Aryal, S., Choi, H., & Claridge-Chang, A. (2019). Moving beyond P values: Data analysis with estimation graphics. Nature Methods, 16 31217592 10.1038/s41592-019-0470-3 Hu Y Stewart-Brown S Twigg L Weich S Can the 12-item General Health Questionnaire be used to measure positive mental health? Psychological Medicine 2007 37 7 1005 1013 10.1017/S0033291707009993 17274855 Hu, Y., Stewart-Brown, S., Twigg, L., & Weich, S. (2007). Can the 12-item General Health Questionnaire be used to measure positive mental health? Psychological Medicine, 37 17274855 10.1017/S0033291707009993 Huppert FA Whittington JE Evidence for the independence of positive and negative well-being: Implications for quality of life assessment British Journal of Health Psychology 2003 8 1 107 122 10.1348/135910703762879246 12643820 Huppert, F. A., & Whittington, J. E. (2003). Evidence for the independence of positive and negative well-being: Implications for quality of life assessment. British Journal of Health Psychology, 8 12643820 10.1348/135910703762879246 Jindal-Snape D Hannah EFS Cantali D Barlow W MacGillivray S Systematic literature review of primary-secondary transitions: International research Review of Education 2020 8 2 526 566 10.1002/rev3.3197 Jindal-Snape, D., Hannah, E. F. S., Cantali, D., Barlow, W., & MacGillivray, S. (2020). Systematic literature review of primary-secondary transitions: International research. Review of Education, 8 Keyes CLM Mental illness and/or mental health? Investigating axioms of the complete state model of health Journal of Consulting and Clinical Psychology 2005 73 3 539 548 10.1037/0022-006X.73.3.539 15982151 Keyes, C. L. M. (2005). Mental illness and/or mental health? Investigating axioms of the complete state model of health. Journal of Consulting and Clinical Psychology, 73 15982151 10.1037/0022-006X.73.3.539 Klinck M Vannucci A Ohannessian CM Bidirectional relationships between school connectedness and internalizing symptoms during early adolescence The Journal of Early Adolescence 2020 40 9 1336 1368 10.1177/0272431619858401 Klinck, M., Vannucci, A., & Ohannessian, C. M. (2020). Bidirectional relationships between school connectedness and internalizing symptoms during early adolescence. The Journal of Early Adolescence, 40 Leadbeater BJ Kuperminc GP Blatt SJ Hertzog C A multivariate model of gender differences in adolescents’ internalizing and externalizing problems Developmental Psychology 1999 35 5 1268 1282 10.1037/0012-1649.35.5.1268 10493653 Leadbeater, B. J., Kuperminc, G. P., Blatt, S. J., & Hertzog, C. (1999). A multivariate model of gender differences in adolescents’ internalizing and externalizing problems. Developmental Psychology, 35 10493653 10.1037//0012-1649.35.5.1268 Leckie G Goldstein H The importance of adjusting for pupil background in school value-added models: A study of Progress 8 and school accountability in England British Educational Research Journal 2019 45 3 518 537 10.1002/berj.3511 Leckie, G., & Goldstein, H. (2019). The importance of adjusting for pupil background in school value-added models: A study of Progress 8 and school accountability in England. British Educational Research Journal, 45 Lester L Cross D The relationship between school climate and mental and emotional wellbeing over the transition from primary to secondary school Psychology of Well-Being 2015 5 1 9 10.1186/s13612-015-0037-8 26516619 PMC4615665 Lester, L., & Cross, D. (2015). The relationship between school climate and mental and emotional wellbeing over the transition from primary to secondary school. Psychology of Well-Being, 5 26516619 10.1186/s13612-015-0037-8 PMC4615665 Link B Phelan J Bird CE Social conditions as fundamental causes of health inequalities Handbook of Medical Sociology 2010 Vanderbilt University Press 1 17 Link, B., & Phelan, J. (2010). Social conditions as fundamental causes of health inequalities. In C. E. Bird (Ed.), Handbook of Medical Sociology Markham WA School culture and teenage substance use: A conceptual and operational framework Educational Review 2015 67 3 282 299 10.1080/00131911.2014.896878 Markham, W. A. (2015). School culture and teenage substance use: A conceptual and operational framework. Educational Review, 67 Markham WA Aveyard P A new theory of health promoting schools based on human functioning, school organisation and pedagogic practice Social Science and Medicine 2003 56 6 1209 1220 10.1016/s0277-9536(02)00120-x 12600359 Markham, W. A., & Aveyard, P. (2003). A new theory of health promoting schools based on human functioning, school organisation and pedagogic practice. Social Science and Medicine, 56 12600359 10.1016/s0277-9536(02)00120-x Markham WA Aveyard P Bisset SL Lancashire ER Bridle C Deakin S Value-added education and smoking uptake in schools: A cohort study Addiction 2008 103 1 155 161 10.1111/j.1360-0443.2007.02020.x 18081615 Markham, W. A., Aveyard, P., Bisset, S. L., Lancashire, E. R., Bridle, C., & Deakin, S. (2008). Value-added education and smoking uptake in schools: A cohort study. Addiction, 103 18081615 10.1111/j.1360-0443.2007.02020.x Markham WA Dolan A Moore GF A sociological framework to reduce aberrant behaviour of school students through increasing school connectedness SAGE Open 2021 10.1177/21582440211031889 Markham, W. A., Dolan, A., & Moore, G. F. (2021). A sociological framework to reduce aberrant behaviour of school students through increasing school connectedness. SAGE Open Melendez-Torres GJ Hewitt G Hallingberg B Anthony R Collishaw S Hall J Murphy S Moore G Measurement invariance properties and external construct validity of the short Warwick-Edinburgh mental wellbeing scale in a large national sample of secondary school students in Wales Health and Quality of Life Outcomes 2019 17 139 10.1186/s12955-019-1204-z 31412878 PMC6694652 Melendez-Torres, G. J., Hewitt, G., Hallingberg, B., Anthony, R., Collishaw, S., Hall, J., Murphy, S., & Moore, G. (2019). Measurement invariance properties and external construct validity of the short Warwick-Edinburgh mental wellbeing scale in a large national sample of secondary school students in Wales. Health and Quality of Life Outcomes, 17 31412878 10.1186/s12955-019-1204-z PMC6694652 Melendez-Torres GJ Warren E Viner R Allen E Bonell C Moderated mediation analyses to assess intervention mechanisms for impacts on victimisation, psycho-social problems and mental wellbeing: Evidence from the INCLUSIVE realist randomized trial Social Science and Medicine 2021 279 113984 10.1016/j.socscimed.2021.113984 33975053 Melendez-Torres, G. J., Warren, E., Viner, R., Allen, E., & Bonell, C. (2021). Moderated mediation analyses to assess intervention mechanisms for impacts on victimisation, psycho-social problems and mental wellbeing: Evidence from the INCLUSIVE realist randomized trial. Social Science and Medicine, 279 33975053 10.1016/j.socscimed.2021.113984 Moore G Angel L Brown R van Godwin J Hallingberg B Rice F Socio-economic status, mental health difficulties and feelings about transition to secondary school among 10–11 year olds in Wales: Multi-level analysis of a cross sectional survey Child Indicators Research 2021 14 4 1597 1615 10.1007/s12187-021-09815-2 34721729 PMC8550448 Moore, G., Angel, L., Brown, R., van Godwin, J., Hallingberg, B., & Rice, F. (2021). Socio-economic status, mental health difficulties and feelings about transition to secondary school among 10–11 year olds in Wales: Multi-level analysis of a cross sectional survey. Child Indicators Research, 14 34721729 10.1007/s12187-021-09815-2 PMC8550448 Moore GF Anthony R Hawkins J Van Godwin J Murphy S Hewitt G Melendez-Torres G Socioeconomic status, mental wellbeing and transition to secondary school: Analysis of the School Health Research Network/Health Behaviour in School-aged Children survey in Wales British Educational Research Journal 2020 46 5 1111 1130 10.1002/berj.3616 33518839 PMC7818461 Moore, G. F., Anthony, R., Hawkins, J., Van Godwin, J., Murphy, S., Hewitt, G., & Melendez-Torres, G. (2020). Socioeconomic status, mental wellbeing and transition to secondary school: Analysis of the School Health Research Network/Health Behaviour in School-aged Children survey in Wales. British Educational Research Journal, 46 33518839 10.1002/berj.3616 PMC7818461 Morgan K Page N Brown R Long S Hewitt G Del Pozo-Banos M John A Murphy S Moore G Sources of potential bias when combining routine data linkage and a national survey of secondary school-aged children: A record linkage study BMC Medical Research Methodology 2020 20 178 10.1186/s12874-020-01064-1 32616022 PMC7331194 Morgan, K., Page, N., Brown, R., Long, S., Hewitt, G., Del Pozo-Banos, M., John, A., Murphy, S., & Moore, G. (2020). Sources of potential bias when combining routine data linkage and a national survey of secondary school-aged children: A record linkage study. BMC Medical Research Methodology, 20 32616022 10.1186/s12874-020-01064-1 PMC7331194 Neal S Rice F Ng-Knight T Riglin L Frederickson N Exploring the longitudinal association between interventions to support the transition to secondary school and child anxiety Journal of Adolescence 2016 50 31 43 10.1016/j.adolescence.2016.04.003 27176785 Neal, S., Rice, F., Ng-Knight, T., Riglin, L., & Frederickson, N. (2016). Exploring the longitudinal association between interventions to support the transition to secondary school and child anxiety. Journal of Adolescence, 50 27176785 10.1016/j.adolescence.2016.04.003 Nielsen L Stewart-Brown S Vinther-Larsen M Meilstrup C Holstein BE Koushede V High and low levels of positive mental health: Are there socioeconomic differences among adolescents? Journal of Public Mental Health 2016 15 1 37 49 10.1108/JPMH-10-2014-0041 Nielsen, L., Stewart-Brown, S., Vinther-Larsen, M., Meilstrup, C., Holstein, B. E., & Koushede, V. (2016). High and low levels of positive mental health: Are there socioeconomic differences among adolescents? Journal of Public Mental Health, 15 Oakes JM Rossi PH The measurement of SES in health research: Current practice and steps toward a new approach Social Science and Medicine 2003 56 4 769 784 10.1016/S0277-9536(02)00073-4 12560010 Oakes, J. M., & Rossi, P. H. (2003). The measurement of SES in health research: Current practice and steps toward a new approach. Social Science and Medicine, 56 12560010 10.1016/s0277-9536(02)00073-4 Page, N., Hewitt, G., Young, H., Moore, G., & Murphy, S. (2021). Student health and wellbeing in Wales: Report of the 2019/20 school health research network student health and wellbeing survey Parker K Nunns M Xiao Z Ford T Ukoumunne OC Intracluster correlation coefficients from school-based cluster randomized trials of interventions for improving health outcomes in pupils Journal of Clinical Epidemiology 2023 158 18 26 10.1016/j.jclinepi.2023.03.020 36997102 Parker, K., Nunns, M., Xiao, Z., Ford, T., & Ukoumunne, O. C. (2023). Intracluster correlation coefficients from school-based cluster randomized trials of interventions for improving health outcomes in pupils. Journal of Clinical Epidemiology, 158 36997102 10.1016/j.jclinepi.2023.03.020 Quartagno M Carpenter JR Substantive model compatible multilevel multiple imputation: A joint modeling approach Statistics in Medicine 2022 41 25 5000 5015 10.1002/sim.9549 35959539 PMC9804749 Quartagno, M., & Carpenter, J. R. (2022). Substantive model compatible multilevel multiple imputation: A joint modeling approach. Statistics in Medicine, 41 35959539 10.1002/sim.9549 PMC9804749 Raniti M Rakesh D Patton GC Sawyer SM The role of school connectedness in the prevention of youth depression and anxiety: A systematic review with youth consultation BMC Public Health 2022 22 1 2152 10.1186/s12889-022-14364-6 36424575 PMC9694921 Raniti, M., Rakesh, D., Patton, G. C., & Sawyer, S. M. (2022). The role of school connectedness in the prevention of youth depression and anxiety: A systematic review with youth consultation. BMC Public Health, 22 36424575 10.1186/s12889-022-14364-6 PMC9694921 RDocumentation. (2023). jomo.smc: Joint modelling substantive model compatible imputation https://www.rdocumentation.org/packages/jomo/versions/2.7-2/topics/jomo.smc Reiss F Socioeconomic inequalities and mental health problems in children and adolescents: A systematic review Social Science and Medicine 2013 90 24 31 10.1016/j.socscimed.2013.04.026 23746605 Reiss, F. (2013). Socioeconomic inequalities and mental health problems in children and adolescents: A systematic review. Social Science and Medicine, 90 23746605 10.1016/j.socscimed.2013.04.026 Rice F Ng-Knight T Riglin L Powell V Moore GF McManus IC Shelton KH Frederickson N Pupil mental health, concerns and expectations about secondary school as predictors of adjustment across the transition to secondary school: A longitudinal multi-informant study School Mental Health 2021 13 279 298 10.1007/s12310-021-09415-z Rice, F., Ng-Knight, T., Riglin, L., Powell, V., Moore, G. F., McManus, I. C., Shelton, K. H., & Frederickson, N. (2021). Pupil mental health, concerns and expectations about secondary school as predictors of adjustment across the transition to secondary school: A longitudinal multi-informant study. School Mental Health, 13 Rodwell L Lee KJ Romaniuk H Carlin JB Comparison of methods for imputing limited-range variables: A simulation study BMC Medical Research Methodology 2014 14 1 57 10.1186/1471-2288-14-57 24766825 PMC4021274 Rodwell, L., Lee, K. J., Romaniuk, H., & Carlin, J. B. (2014). Comparison of methods for imputing limited-range variables: A simulation study. BMC Medical Research Methodology, 14 24766825 10.1186/1471-2288-14-57 PMC4021274 Rose G Sick individuals and sick populations International Journal of Epidemiology 2001 30 3 427 432 10.1093/ije/30.3.427 11416056 Rose, G. (2001). Sick individuals and sick populations. International Journal of Epidemiology, 30 11416056 10.1093/ije/30.3.427 Rose ID Lesesne CA Sun J Johns MM Zhang X Hertz M The relationship of school connectedness to adolescents’ engagement in co-occurring health risks: A meta-analytic review The Journal of School Nursing 2024 40 1 58 73 10.1177/10598405221096802 35477342 Rose, I. D., Lesesne, C. A., Sun, J., Johns, M. M., Zhang, X., & Hertz, M. (2024). The relationship of school connectedness to adolescents’ engagement in co-occurring health risks: A meta-analytic review. The Journal of School Nursing, 40 35477342 10.1177/10598405221096802 Ryff CD Psychological well-being revisited: Advances in the science and practice of eudaimonia Psychotherapy and Psychosomatics 2013 83 1 10 28 10.1159/000353263 24281296 PMC4241300 Ryff, C. D. (2013). Psychological well-being revisited: Advances in the science and practice of eudaimonia. Psychotherapy and Psychosomatics, 83 24281296 10.1159/000353263 PMC4241300 Santini ZI Stougaard S Koyanagi A Ersboll AK Nielsen L Hinrichsen C Madsen KR Meilstrup C Stewart-Brown S Koushede V Predictors of high and low mental well-being and common mental disorders: Findings from a Danish population-based study The European Journal of Public Health 2020 30 3 503 509 10.1093/eurpub/ckaa021 PMC7292340 32104898 Santini, Z. I., Stougaard, S., Koyanagi, A., Ersboll, A. K., Nielsen, L., Hinrichsen, C., Madsen, K. R., Meilstrup, C., Stewart-Brown, S., & Koushede, V. (2020). Predictors of high and low mental well-being and common mental disorders: Findings from a Danish population-based study. The European Journal of Public Health, 30 10.1093/eurpub/ckaa021 PMC7292340 32104898 Shackleton N Hale D Bonell C Viner RM Intraclass correlation values for adolescent health outcomes in secondary schools in 21 European countries SSM—Population Health 2016 2 217 225 10.1016/j.ssmph.2016.03.005 29349141 PMC5757888 Shackleton, N., Hale, D., Bonell, C., & Viner, R. M. (2016). Intraclass correlation values for adolescent health outcomes in secondary schools in 21 European countries. SSM—Population Health, 2 29349141 10.1016/j.ssmph.2016.03.005 PMC5757888 Sirsch U The impending transition from primary to secondary school: Challenge or threat? International Journal of Behavioral Development 2003 27 5 385 395 10.1080/01650250344000082 Sirsch, U. (2003). The impending transition from primary to secondary school: Challenge or threat? International Journal of Behavioral Development, 27 Stewart-Brown S Samaraweera C Taggart F Kandala N-B Stranges S Socioeconomic gradients and mental health: Implications for public health The British Journal of Psychiatry 2015 206 461 465 10.1192/bjp.bp.114.147280 25792696 Stewart-Brown, S., Samaraweera, C., Taggart, F., Kandala, N.-B., & Stranges, S. (2015). Socioeconomic gradients and mental health: Implications for public health. The British Journal of Psychiatry, 206 25792696 10.1192/bjp.bp.114.147280 Stewart-Brown S Tennant A Tennant R Platt S Parkinson J Weich S Internal construct validity of the Warwick-Edinburgh mental well-being scale (WEMWBS): A Rasch analysis using data from the Scottish Health Education Population Survey Health and Quality of Life Outcomes 2009 10.1186/1477-7525-7-15 19228398 PMC2669062 Stewart-Brown, S., Tennant, A., Tennant, R., Platt, S., Parkinson, J., & Weich, S. (2009). Internal construct validity of the Warwick-Edinburgh mental well-being scale (WEMWBS): A Rasch analysis using data from the Scottish Health Education Population Survey. Health and Quality of Life Outcomes 19228398 10.1186/1477-7525-7-15 PMC2669062 Taylor SE Broffman JI Psychosocial resources. Functions, origins, and links to mental and physical health Advances in Experimental Social Psychology 2011 44 1 57 10.1016/B978-0-12-385522-0.00001-9 Taylor, S. E., & Broffman, J. I. (2011). Psychosocial resources. Functions, origins, and links to mental and physical health. Advances in Experimental Social Psychology, 44 Tobler AL Komro KA Dabroski A Aveyard P Markham WA Preventing the link between SES and high-risk behaviors: “value-added” education, drug use and delinquency in high-risk, Urban Schools Prevention Science 2011 12 2 211 221 10.1007/s11121-011-0206-9 21360062 PMC3707388 Tobler, A. L., Komro, K. A., Dabroski, A., Aveyard, P., & Markham, W. A. (2011). Preventing the link between SES and high-risk behaviors: “value-added” education, drug use and delinquency in high-risk, Urban Schools. Prevention Science, 12 21360062 10.1007/s11121-011-0206-9 PMC3707388 Welsh Government. (2019). Guidance on the calculation of the Capped 9 Points Score (interim) https://gov.wales/capped-9-points-score-interim Welsh Government. (2021). Framework on embedding a whole-school approach to emotional and mental well-being Guidance. Guidance document no: 269/2021 Welsh Government. (2022). My Local School: Sharing information about local schools https://mylocalschool.gov.wales/ Yuen M Wu L Relationship between school connectedness and psychological well-being in adolescents: A meta-analysis Current Psychology 2024 43 12 10590 10605 10.1007/s12144-023-05164-1 Yuen, M., & Wu, L. (2024). Relationship between school connectedness and psychological well-being in adolescents: A meta-analysis. Current Psychology, 43 ",
  "metadata": {
    "Title of this paper": "Relationship between school connectedness and psychological well-being in adolescents: A meta-analysis",
    "Journal it was published in:": "School Mental Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479681/"
  }
}