{
  "title": "Paper_216",
  "abstract": "pmc Am J Gastroenterol Am J Gastroenterol 2035 lwwopen ACG The American Journal of Gastroenterology 0002-9270 1572-0241 pmc-is-collection-domain yes pmc-collection-title Lippincott Open Access PMC12487658 PMC12487658.1 12487658 12487658 39760647 10.14309/ajg.0000000000003300 AJG-24-1804 1 3 Article Liver The Effects of Alfapump on Ascites Control and Quality of Life in Patients With Cirrhosis and Recurrent or Refractory Ascites https://orcid.org/0000-0001-9263-8869 Wong Florence MD, FACG florence.wong@utoronto.ca 1 Vagas Hugo E. MD, FACG Vargas.Hugo@mayo.edu 2 https://orcid.org/0000-0002-4898-7778 Reddy K. Rajender MD, FACG ReddyR@PennMedicine.upenn.edu 3 Pagadala Mangesh R. MD 4 MangeshPagadala@mhd.com https://orcid.org/0000-0002-2906-1144 Pocha Christine MD 5 Christine.Pocha@usd.edu Sundaram Vinay MD 6 10 https://orcid.org/0000-0003-4928-3681 Bajaj Jasmohan S. MD, MS, FACG jasmohan.bajaj@vcuhealth.org 7 https://orcid.org/0000-0003-1594-9924 Shlomovitz Eran MD 1 eran.shlomovitz@uhn.ca https://orcid.org/0000-0002-6467-8641 Bendel Emily MD 8 Bendel.Emily@mayo.edu https://orcid.org/0000-0002-6047-9880 Capel Jeroen MSc 9 Jeroen.Capel@sequanamedical.com https://orcid.org/0000-0002-7888-1165 Kamath Patrick S. MD 8 kamath.patrick@mayo.edu The POSEIDON Study Group 1 Canada 2 USA 3 USA 4 USA 5 USA 6 USA 7 USA 8 USA 9 Switzerland 10 Correspondence: florence.wong@utoronto.ca 10 2025 06 1 2025 120 10 498100 2291 2301 16 7 2024 27 12 2024 01 10 2025 02 10 2025 03 10 2025 Copyright © 2025 The Author(s). Published by Wolters Kluwer Health, Inc. on behalf of The American College of Gastroenterology 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) INTRODUCTION: The alfapump system has been shown to be a possible alternative to repeat therapeutic paracentesis (TP) in selected patients with refractory ascites (RA). The objective of this study was to assess the safety and efficacy of alfapump on ascites control and quality of life in these patients. METHODS: Patients with cirrhosis and RA requiring ≥2 TPs 30 days prior were enrolled and followed for 24 months postimplant. Primary efficacy end point assessed at 6 months was reduction in paracentesis requirement; safety end point was device-related adverse events resulting in intervention, explant, or death. RESULTS: Forty patients with RA (mean Model of End-stage Liver Disease-Sodium: 15 ± 4) received an alfapump. TP requirement was decreased from 3.2 ± 1.5 sessions per month preimplant to 0.2 ± 0.6 sessions per month at 6 months postimplant ( P P P DISCUSSION: The alfapump system effectively controlled ascites, which improved quality of life. It may be considered as an alternative to repeat TP in select patients with RA. Complication rates were similar to those expected in patients with RA. KEYWORDS: albumin Ascites Q questionnaire acute kidney injury large volume paracentesis SF-36 Sequana Medical Florence Wong pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE SDC T INTRODUCTION The appearance of ascites marks a turning point in the natural history of cirrhosis, with a significant decline in their prognosis to a median survival of 2 years ( 1 2 3 The current management of recurrent ascites or RA is providing symptomatic relief by repeated large volume paracentesis (LVP), usually defined as paracentesis of more than 5 L. Albumin is administered at a dose of 6–8 g per liter of ascites removed to reduce the likelihood of developing postparacentesis circulatory dysfunction (PPCD) ( 4 5 6 The automated low-flow ascites pump (alfapump) is a subcutaneously implanted battery-powered device that moves peritoneal fluid from the peritoneal cavity into the bladder where it is eliminated through urination. The alfapump system (device plus catheters) thus provides relief from the symptoms of tense ascites immediately after implantation. However, there are concerns that in patients with advanced cirrhosis and ascites who are relatively immune compromised ( 7 8 9 The coprimary effectiveness end points comparing the preimplant and postimplant periods were (i) per patient ratio of the average monthly number of needle therapeutic paracenteses (TPs) of >1.5 L in the postimplantation vs the preimplantation period and (ii) the proportion of patients with at least a 50% reduction in the number of TP. The primary safety end point was the combined event rate of pump system-related adverse events (AEs). These included (i) open surgical reintervention due to AE or to restore pump functionality, (ii) pump explant without pump replacement, and (iii) death. METHODS The POSEIDON study ( NCT03973866 2 2 Patients aged older than 18 years with cirrhosis diagnosed on histology, and/or clinical, endoscopic, laboratory, and radiological criteria, with recurrent ascites or RA requiring at least 2 TPs in the preceding 30 days were assessed for the study. Patients had to have refused or be ineligible or had contraindication to TIPS insertion and be expected to have a life expectancy of at least 6 months after pump implantation. Exclusion criteria were loculated ascites, more than 1 systemic or local abdominal infection in the previous 6 months, recurrent urinary tract infections defined as 2 or more episodes in the past 6 months, clostridium difficile infection in the past year, history of hepatocellular carcinoma exceeding Milan criteria ( 10 As some participating centers did not have previous experience with alfapump implantation, training in the procedure was performed in up to 3 patients per site so that the centers could gain experience with the procedure. This cohort constitutes the Roll-in cohort 1 Figure 1. Patient disposition flow chart. The initial failures include a high serum creatinine of >1.5 mg/dL or a MELD score of >20 (n = 11), patients unwilling to undergo 3 month of observation period (n = 6), patients not producing sufficient ascites to require a minimum of 2 paracenteses in 30 days (n = 6), technical reasons such as loculated ascites or morbid obesity (n = 3), malignancy (n = 2) and others, such as recent C. Difficile infection, ascites not due to cirrhosis, other complications of cirrhosis not well controlled (n = 5). After the 3-month observation period, those who were ineligible for an alfapump included patients who did not have sufficient number of paracentesis (n = 6), comorbid conditions not permitting implant procedure to proceed safely (n = 2), patients admitted into intensive care unit (n = 3), the development of a hepatocellular carcinoma (n = 1), recent urinary tract infection (n = 1), and serum creatinine >1.5 mg/dL (n = 2). Three other patients could not proceed with the implantation procedure because of insurance issues. MELD, Model of End-stage Liver Disease. The Pivotal Cohort formed the most important part of the study. Once they fulfilled the inclusion and exclusion criteria, they entered an observation period of 3 months during which time they received the standard of care, including LVP as required and treatment of any complications of cirrhosis as they arose. This study design was recommended by the FDA, to ensure patient stability during the observation period, because patients might improve under closer surveillance in the context of a clinical trial or deteriorate as per the natural history of decompensated cirrhosis, thus ensuring the most appropriate patients for alfapump implantation. During the initial 3-month observation period, the number and volume of paracentesis were recorded. Patients also underwent assessments of QoL by 2 standard QoL instruments: a general QoL score of Short Form-36 (SF-36) ( 11 12 The implant procedure has previously been described ( 13 The primary end points only used data up to 6 months postimplantation, although patients remained in the study until 24 months postimplant. Comparison for the effectiveness coprimary end points was made between the 3 months preceding pump implantation and months 4–6 after pump implantation, that is, after the 3-month postimplantation stabilization period. For the safety primary end point, all events were counted from the day of implantation until the end of 6-month period unless the patient exited the study early due to AEs unrelated to the alfapump therapy. Exploratory end points include change in QoL and nutritional status. Statistical analysis and sample size The results from all 40 enrolled patients were used in the analyses of coprimary efficacy and safety end points, rather than just using the data from the 26 patients who reached the 6-month time point postalfapump implant. Multiple imputations were used to account for patients who exited the study early with missing follow-up data. Detailed imputation methods are included in Supplementary Material (see Supplementary Digital Content 1, http://links.lww.com/AJG/D527 The combined safety event rates for the safety end point were calculated along with a 2-sided exact 95% confidence interval (CI). Efficacy and QoL end points underwent hierarchical serial testing using a paired t t P Sample size calculation for the coprimary effectiveness end point The sample size for the per-patient ratio end point was estimated using assumptions for preimplant and postimplant mean number of TP and SDs based on the data from the previous feasibility study ( 13 A minimum of 37 enrolled patients was required to demonstrate success (i.e., 50% reduction of number of TP postimplant) on the primary effectiveness end point with 80% statistical power. For a detailed description of sample size calculation, see Supplemental Statistical Methods (Supplementary Digital Content 1, http://links.lww.com/AJG/D527 All statistical analyses were performed using SAS statistical software, version 9.4 (SAS Institute, Cary, NC). RESULTS Between September 2019 and March 2022, 143 patients were screened for inclusion into the study. Thirty-three patients failed screening, and 110 patients were enrolled. Details of initial screen failure are provided in the footnote for Figure 1 1 1 Baseline demographics The patients were mostly middle-aged men with alcohol-associated liver disease or metabolic dysfunction-associated steatohepatitis as the main etiologies of cirrhosis. Patients had a history of mean ascites duration of 15.7 ± 14.8 months and had a mean of 3.2 ± 1.5 TP per month in the preceding 3 months. Their mean Child-Pugh score was 7.9 ± 1.0, and their mean MELD-Na score was 15.2 ± 3.8. The patients had some limitation of their daily activities, but 85% of patients were able to continue with their daily activities and self-care, as indicated by their Eastern Cooperative Oncology Group performance status of at least level 3. Table 1 2 Table 1. Patient demographics and medical history Table 2. Laboratory parameters at various time points of the study The primary coeffectiveness end points: control of ascites After alfapump implantation, the pump was set to remove a mean daily ascites volume of 824 ± 265 mL, with 15 of the 40 patients requiring <800 mL of ascites removed per day, 13 required 800–1,000 mL daily ascites drainage, while 12 required >1,000 mL drained per day. The mean per patient ratio of preimplant to postimplant number of paracenteses was 0.18 (95% CI 0.04–0.32) ( P P 2 http://links.lww.com/AJG/D527 P P 2 P Figure 2. ( a b The primary safety end point The primary safety end point recorded events related to the device or the alfapump treatment, resulting in surgical reintervention, explant, or death. Six of the 40 patients (15%) had their alfapump explanted in the first 6 months of the postimplant period, due to AEs related to the pump or alfapump therapy. Three alfapumps were explanted due to implant site erosion, and additional 3 alfapumps were explanted due to bladder spasm. One further pump was removed because the patient was noncompliant with study procedures and displayed behavioral issues, and this explant was not considered a primary safety end point. There were no alfapump-related or alfapump therapy-related deaths or surgical interventions other than pump explantation. QoL and nutritional status The physical component score of the SF-36 questionnaire improved from a mean baseline value of 36.6 ± 9.3 to 42.8 ± 8.5 at 6 months postimplant ( P P P Prealbumin was used as a surrogate marker of the nutritional status of these patients. The mean value preimplant was 9.1 ± 4.0 mg/dL. At 6 months postimplant, there was a significant increase to 11.5 ± 4.5 mg/dL ( P Adverse events There were 66 AEs reported in 26 of the 40 enrolled patients (65%) in the preimplant period; of these, 17 events in 11 patients were considered SAEs. They were not the same 26 patients who completed the 6-month postimplantation period. The corresponding numbers in the postimplantation period were 192 AEs in 34 patients (85%), with 79 events being SAEs reported in 24 patients. Table 3 3 Table 3. Adverse events including serious and major adverse events Renal events were considered events of interest. Twenty-three patients experienced an AKI event. Figure 3 14 14 3 Figure 3. ( a b Device malfunctions and deficiencies Ten device deficiencies in 9 patients were reported over the 6-month period postimplant, 5 of which were classified as a device malfunction, that is, a component of the alfapump system causing concern despite adequate use (Table 4 Table 4. Details of device malfunctions and deficiencies Clinical course At the end of the 6-month postimplant period, there was a gradual improvement of liver function as determined by reductions in international normalized ratio and serum bilirubin ( P 2 P 4 Figure 4. Survival of the pivotal cohort of the POSEIDON study. DISCUSSION This study demonstrated that the alfapump system is effective in controlling ascites in decompensated cirrhosis with recurrent ascites or RA by reducing or even eliminating the need for TP. This reduction was associated with a significant improvement in QoL and increased the number of good health days in these patients. The findings in this study are consistent with a previous randomized controlled trial ( 15 13 16 19 20 21 22 The study was not designed as a randomized controlled trial as recommended by the FDA. As the attrition rate in a study enrolling patients with decompensated cirrhosis may be high, it was felt that an observation period before alfapump implantation would be appropriate as this period of close observation would identify patients who improved with comprehensive medical care or progressed with their decompensation. Both these subsets of patients would not be appropriate for alfapump insertion. Despite the effectiveness of the alfapump system, the concern remains for its safe use in patients with decompensated cirrhosis who are immunocompromised ( 7 16 23 24 There were 16 MAEs occurring in 12 patients. These were the usual complications that would be observed in patients with decompensated cirrhosis and RA. The main concern was the number of cases of AKI because the alfapump system provided a slow and continuous paracentesis, and the regular use of albumin was not mandated. The continuous removal of ascites in some patients may activate the various vasoconstrictor systems, causing a scenario akin to the PPCD as shown in a physiological study ( 9 14 25 18 21 As these decompensated patients with cirrhosis had a limited prognosis and poor QoL ( 26 27 28 29 The study was not designed to demonstrate a specific survival benefit. There were 5 deaths reported during the 6-month study period, none related to the use of the alfapump system. Rather, 3 of these deaths were related to progression of the underlying liver disease, 1 patient died from unexplained cardiac arrest, and 1 patient died from COVID pneumonia. In a recent retrospective study of decompensated patients with cirrhosis by Balcar et al, patients with grade 3 or tense ascites as a single decompensating event had a similar 6-month survival as our current cohort ( 30 31 32 32 In conclusion, in this pivotal study assessing the efficacy and safety of the alfapump system as a treatment of recurrent ascites or RA, the implantation of the alfapump system could significantly reduce or even eliminate the need for TP, providing an improved QoL, and giving the patients an additional 10 feel-good days per month. Although alfapump implantation needs careful monitoring to mitigate risks, the safety events observed after alfapump implantation in this study are consistent with those expected for this patient population. Safety events generally were manageable, resolved without sequelae, and patients were able to continue alfapump therapy. Furthermore, mortality for patients with the alfapump is consistent with what is expected for patients with RA, when compared with those undergoing treatment with TIPS or regular paracentesis. Therefore, in carefully selected patients, alfapump system may be an acceptable definitive alternative to regular LVP for patients with cirrhosis and recurrent ascites or RA. CONFLICTS OF INTEREST Guarantor of the article: Specific author contributions: Financial support and sponsorship: Potential competing interests: Trial registration: https://www.clinicaltrials.gov NCT03973866 Study Highlights WHAT IS KNOWN ✓ The standard of care for recurrent or refractory ascites (RA) in patients with decompensated cirrhosis is repeat large volume paracentesis. ✓ Patients with cirrhosis and ascites have a reduced quality of life because of the many complications associated with the presence of ascites. WHAT IS NEW HERE ✓ The insertion of an alfapump can significantly reduce the requirement for large volume paracentesis. ✓ Complications related to the use of the alfapump system are similar to what are usually observed in patients with decompensated cirrhosis and recurrent or RA. ✓ The use of the alfapump system as a treatment of ascites is associated with a significantly improvement in the physical aspect of quality of life, especially regarding abdominal distension. ✓ Patients gained extra 10 good health days per month. ✓ The alfapump system may be used as an alternative to large volume paracentesis in the management of recurrent or RA in selected patients. Supplementary Material SUPPLEMENTARY MATERIAL http://links.lww.com/AJG/D527 REFERENCES 1. D'Amico G Garcia-Tsao G Pagliaro L Natural history and prognostic indicators of survival in cirrhosis: A systematic review of 118 studies J Hepatol 2006 44 1 217 31 16298014 10.1016/j.jhep.2005.10.013 2. Salerno F Guevara M Bernardi M Refractory ascites: Pathogenesis, definition and therapy of a severe complication in patients with cirrhosis Liver Int 2010 30 7 937 47 20492521 10.1111/j.1478-3231.2010.02272.x 3. D'Amico G Bernardi M Angeli P Towards a new definition of decompensated cirrhosis J Hepatol 2022 76 1 202 7 34157322 10.1016/j.jhep.2021.06.018 4. Sola-Vera J Such J Understanding the mechanisms of paracentesis-induced crculatory dysfunction Eur J Gastroenterol Hepatol 2004 16 3 295 8 15195893 10.1097/00042737-200403000-00008 5. Wong F Management of refractory ascites Clin Mol Hepatol 2023 29 1 16 32 35676862 10.3350/cmh.2022.0104 PMC9845666 6. Heuman DM Abou-Assi SG Habib A Persistent ascites and low serum sodium identify patients with cirrhosis and low MELD scores who are at high risk for early death Hepatology 2004 40 4 802 10 15382176 10.1002/hep.20405 7. Albillos A Martin-Mateos R Van der Merwe S Cirrhosis-associated immune dysfunction Nat Rev Gastroenterol Hepatol 2022 19 2 112 34 34703031 10.1038/s41575-021-00520-7 8. Ruiz-del-Arbol L Monescillo A Jimenez W Paracentesis-induced circulatory dysfunction: Mechanism and effect on hepatic hemodynamics in cirrhosis Gastroenterology 1997 113 2 579 86 9247479 10.1053/gast.1997.v113.pm9247479 9. Solà E Sanchez-Cabús S Rodriguez E Effects of alfapump system on kidney and circulatory function in patients with cirrhosis and refractory ascites Liver Transpl 2017 23 5 583 93 28318147 10.1002/lt.24763 10. Mazzaferro V Bhoori S Sposito C Milan criteria in liver transplantation for hepatocellular carcinoma: An evidence-based analysis of 15 years of experience Liver Transpl 2011 17 Suppl 2 S44 57 21695773 10.1002/lt.22365 11. Brazier JE Harper R Jones NM Validating the SF-36 health survey questionnaire: New outcome measure for primary care BMJ 1992 305 6846 160 4 1285753 10.1136/bmj.305.6846.160 PMC1883187 12. Neijenhuis M Gevers TJG Atwell TD Development and validation of a patient-reported outcome measurement for symptom assessment in cirrhotic ascites Am J Gastroenterol 2018 113 4 567 75 29557942 10.1038/ajg.2018.18 13. Wong F Bendel E Sniderman K et al Improvement in quality of life and decrease in large-volume paracentesis requirements with the automated low-flow ascites pump Liver Transpl 2020 26 5 651 61 31999044 10.1002/lt.25724 PMC7216956 14. Salerno F Gerbes A Ginès P Diagnosis, prevention and treatment of hepatorenal syndrome in cirrhosis Gut 2007 56 9 1310 8 17389705 10.1136/gut.2006.107789 PMC1954971 15. Bureau C Adebayo D Chalret de Rieu M Alfapump system vs. large volume paracentesis for refractory ascites: A multicenter randomized controlled study J Hepatol 2017 67 5 940 9 28645737 10.1016/j.jhep.2017.06.010 16. Bellot P Welker M-W Soriano G Automated low flow pump system for the treatment of refractory ascites: A multi-center safety and efficacy study J Hepatol 2013 58 5 922 7 23318604 10.1016/j.jhep.2012.12.020 17. Thomas MN Sauter GH Gerbes AL Automated low flow pump system for the treatment of refractory ascites: A single-center experience Langenbecks Arch Surg 2015 400 8 979 83 26566989 10.1007/s00423-015-1356-1 18. Stirnimann G Berg T Spahr L Treatment of refractory ascites with an automated low-flow ascites pump in patients with cirrhosis Aliment Pharmacol Ther 2017 46 10 981 91 28940225 10.1111/apt.14331 PMC5698811 19. Solbach P Höner Zu Siederdissen C Wellhöner F Automated low-flow ascites pump in a real-world setting: Complications and outcomes Eur J Gastroenterol Hepatol 2018 30 1082 9 29738325 10.1097/MEG.0000000000001149 20. Will V Rodrigues SG Stirnimann G Transjugular intrahepatic portosystemic shunt and alfapump system for refractory ascites in liver cirrhosis: Outcomes and complications United European Gastroenterol J 2020 8 961 9 10.1177/2050640620938525 PMC7707873 32588789 21. Lepida A Marot A Trépo E Systematic review with meta-analysis: Automated low-flow ascites pump therapy for refractory ascites Aliment Pharmacol Ther 2019 50 9 978 87 31583729 10.1111/apt.15502 22. Di Pascoli M Fasolato S Piano S Long-term administration of human albumin improves survival in patients with cirrhosis and refractory ascites Liver Int 2019 39 1 98 105 10.1111/liv.13968 30230204 23. Plauth M Schütz ET Cachexia in liver cirrhosis Int J Cardiol 2002 85 1 83 7 12163212 10.1016/s0167-5273(02)00236-x 24. Ekpanyapong S Reddy KR Infections in cirrhosis Curr Treat Options Gastroenterol 2019 17 2 254 70 30980335 10.1007/s11938-019-00229-2 PMC7101776 25. Pannu N James M Hemmelgarn BR Alberta Kidney Disease Network Modification of outcomes after acute kidney injury by the presence of CKD Am J Kidney Dis 2011 58 2 206 13 21496979 10.1053/j.ajkd.2011.01.028 26. Nagel M Labenz C Wörns MA Impact of acute-on-chronic liver failure and decompensated liver cirrhosis on psychosocial burden and quality of life of patients and their close relatives Health Qual Life Outcomes 2020 18 1 10 31931822 10.1186/s12955-019-1268-9 PMC6958780 27. Stepanova M Nader F Bureau C Patients with refractory ascites treated with alfapump system have better health-related quality of life as compared to those treated with large volume paracentesis: The results of a multicenter randomized controlled study Qual Life Res 2018 27 6 1513 20 29460201 10.1007/s11136-018-1813-8 28. Allard JP Chau J Sandokji K Effects of ascites resolution after successful TIPS on nutrition in cirrhotic patients with refractory ascites Am J Gastroenterol 2001 96 8 2442 7 11513188 10.1111/j.1572-0241.2001.04051.x 29. Montomoli J Holland-Fischer P Bianchi G Body composition changes after transjugular intrahepatic portosystemic shunt in patients with cirrhosis World J Gastroenterol 2010 16 3 348 53 20082481 10.3748/wjg.v16.i3.348 PMC2807956 30. Balcar L Tonon M Semmler G Baveno Cooperation: an EASL consortium Risk of further decompensation/mortality in patients with cirrhosis and ascites as the first single decompensation event JHEP Rep 2022 4 8 100513 35845294 10.1016/j.jhepr.2022.100513 PMC9284386 31. Tan HK James PD Wong F Albumin may prevent the morbidity of paracentesis-induced circulatory dysfunction in cirrhosis and refractory ascites: A pilot study Dig Dis Sci 2016 61 10 3084 92 27048451 10.1007/s10620-016-4140-3 32. Salerno F Cammà C Enea M Transjugular intrahepatic portosystemic shunt for refractory ascites: A meta-analysis of individual patient data Gastroenterology 2007 133 3 825 34 17678653 10.1053/j.gastro.2007.06.020 ",
  "metadata": {
    "Title of this paper": "Transjugular intrahepatic portosystemic shunt for refractory ascites: A meta-analysis of individual patient data",
    "Journal it was published in:": "The American Journal of Gastroenterology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487658/"
  }
}