{
  "title": "Paper_55",
  "abstract": "pmc Acta Orthop Acta Orthop 1106 actaorth ActaO Acta Orthopaedica 1745-3674 1745-3682 Nordic Orthopaedic Federation PMC12489806 PMC12489806.1 12489806 12489806 41036564 10.2340/17453674.2025.44758 ActaO-96-44758 1 Article Association between preoperative self-rated health and opioid use 12 months after total hip arthroplasty for osteoarthritis: a cohort study using Danish National Health Survey Data PEDERSEN Alma B 1 2 EDWARDS Nina M 3 4 GADEMAN Maaike G J 5 MECHLENBURG Inger 2 3 6 7 JENSEN Heidi A R 8 SØRENSEN Henrik T 1 6 9 1 2 3 4 5 6 7 8 9 Correspondence: Alma Becic Pedersen, abp@clin.au.dk This study was presented during the ISAR Congress 2025, Christchurch, New Zealand. 30 9 2025 2025 96 478876 708 715 20 3 2025 01 9 2025 30 09 2025 03 10 2025 03 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution 4.0 International License ( https://creativecommons.org/licenses/by/4.0/ Background and purpose We examined the association between preoperative self-rated health (SRH) and opioid use 12 months after total hip arthroplasty (THA) for osteoarthritis. Methods We identified 381,323 people who answered a question on SRH in the Danish National Health Surveys 2010, 2013, or 2017. Among these, 4,174 people age > 35 years subsequently underwent THA for osteoarthritis. SRH was categorized as poor (“poor” or “fair” health) or good (“good,” “very good,” or “excellent” health). Opioid use was defined as ≥ 2 prescriptions 1–12 months after THA. We calculated prevalences and prevalence ratios (PR) with 95% confidence intervals (CI) through log-binomial regression, overall and by preoperative opioid use status adjusting for potential confounders. The total morphine milligram equivalent (MME) dose after THA with interquartile range (IQR) was further calculated. Results 876 (21%) patients rated their health as poor and 3,292 (79%) as good. The prevalence of opioid use among patients with poor SRH was higher than among those with good SRH (PR 2.33, CI 2.05–2.65) (315 [36%] vs 132 [14%]). Similarly, among preoperative non-users, the prevalence was 62 (15%) for patients with poor SRH and 140 (6%) for patients with good SRH (PR 2.20, CI 1.65–2.93), and among preoperative users, the prevalence was 252 (54%) for patients with poor SRH and 299 (31%) for patients with good SRH (PR 1.64, CI 1.44–1.86). The overall median MME dose was higher among patients with poor SRH (2,940, IQR 800–9,610) than among those with good SRH (1,000, IQR 400–3,175) with a median difference of 1,940 (IQR 1,227–2,653). Conclusion Compared with good preoperative SRH, poor preoperative SRH was associated with higher opioid use 12 months after THA for osteoarthritis. ABP and HTS were supported by, and employed at, the Department of Clinical Epidemiology at Aarhus University, and Aarhus University Hospital. The Department of Clinical Epidemiology, Aarhus University, and Aarhus University Hospital receive funding from various companies in the form of research grants to (and administered by) Aarhus University. None of these grants are related to the present study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Opioids are used in managing short-term postoperative pain among patients undergoing total hip arthroplasty (THA) [ 1 2 3 7 8 9 Self-rated health (SRH), from the individual’s own perspective, is a widely used indicator of current health status [ 10 11 12 13 14 15 16 17 18 We examined the association between preoperative SRH and opioid use after THA in patients with hip osteoarthritis. Methods Study design We conducted a population-based cross-sectional study using data from nationwide Danish health surveys and medical databases. The Danish National Health Service provides tax-supported healthcare for the entire Danish population, ensuring universal access to all hospitals and primary medical care. The study is presented according to the Strengthening the Reporting of Observational Studies in Epidemiology guidelines (STROBE). Data sources We compiled data from the following 6 sources: The Danish National Health Survey is conducted among the general population using self-reported questionnaires, either paper-and-pencil or web-based. In 2010, 2013, and 2017, region- and municipality-stratified random samples of individuals aged 16 years or older were invited to participate in the surveys. Eligible participants were identified through the Danish Civil Registration System. Approximately 60% of invited individuals completed a detailed questionnaire containing a minimum of 52 questions on, e.g., morbidity, physical activity, anthropometry, health promotion and prevention, contact with health services, social relations, and socioeconomic factors [ 19 The Danish Hip Arthroplasty Register, established in 1995, contains clinical information on primary THA. The completeness of registration of primary THA exceeds 90% [ 20 The Danish National Prescription Registry contains information on all prescriptions dispensed from community pharmacies since 1995, coded according to the Anatomical Therapeutic Chemical (ATC) Classification System [ 21 The Danish National Patient Registry contains data on all somatic inpatient admissions to Danish hospitals since 1977 and all outpatient clinic visits and emergency department visits since 1995. Each record is linked to the patient’s civil registration number and includes information on the treatments and surgical procedures performed, as well as 1 primary and as many as 19 secondary discharge diagnoses. The discharge diagnoses are coded according to the International Classification of Diseases, Eighth Revision (ICD-8; from 1977 to 1993) and Tenth Revision (ICD-10; starting in 1993) [ 22 The Population Education Register contains individual-level information on the education obtained by each Danish citizen [ 23 The Danish Civil Registration System has assigned a unique civil registration number to all Danish citizens at birth or immigration since 1968. This number enables unambiguous individual-level record linkage across multiple databases and surveys and provides information on vital status and migration, thereby ensuring complete follow-up [ 24 Study population Inclusion criteria: (i) Invited to participate in the Danish National Health Survey in 2010, 2013 and 2017; (ii) Responded to a questionnaire including a question on SRH; (iii) Age above 35 years; (iv) Undergoing THA due to osteoarthritis after answering SRH question; (v) Alive at day 30 after THA. Exclusion criteria: (i) Not responded to invitation from the Danish National Health Surveys; (ii) Age below 35 years; (iii) No THA due to osteoarthritis after answering SRH question; (iv) Died within 30 days of THA. The final study population consisted of 4,168 patients. Self-rated health SRH was measured with a single-item question: “How do you rate your present state of health in general?” Individuals rated their health status on a 5-point Likert scale. According to the answers, patients undergoing THA were divided into 1 of 2 exposure groups: poor SRH (“poor” or “fair” health) or good SRH (“good,” “very good,” or “excellent” health). In a few cases in which a patient answered the SRH question multiple times before THA, the answer closest to the THA was used. Opioids and outcome Information on dispensing of 13 common types of opioids was collected from the Danish National Prescription Registry, according to ATC codes. The primary outcome was opioid use, defined as dispensing of ≥ 2 opioids within 1–12 months after THA [ 25 27 We also defined opioid use as the total number of dispensing occasions 1–12 months after THA. Because doses vary among prescriptions of different opioid types, all doses were converted to milligram morphine equivalent (MME) doses with a conversion factor corresponding to each specific opioid type [ 28 Patients redeeming at least 1 opioid prescription within 0–6 months before the THA procedure were defined as preoperative opioid users. Covariates We collected information on the following covariates at the time of SRH status allocation: Patient age and sex were collected from the Civil Registration System. Somatic comorbidities 2-year history was obtained from the Danish National Patient Registry. According to ICD codes, we calculated a Charlson Comorbidity Index (CCI) score for every patient. The comorbidity level was classified into 3 categories: low (CCI score 0), moderate (CCI score 1–2), or high (CCI score ≥ 3). The highest level of education attained was determined from the Population Education Register and classified as low (primary or lower secondary education), moderate (vocational education and training, qualifying educational programs, upper secondary education, or short-cycle tertiary education), or high (bachelor’s programs, master’s programs, and PhD programs or higher). Pain-related conditions history was obtained from the Danish National Patient Registry according to ICD codes for chronic musculoskeletal pain, neuropathic pain, cancer-related pain, headache and orofacial pain, and postsurgical pain [ 29 Mental disorders 2-year history was obtained from the Danish National Patient Registry according to ICD codes [ 30 Medication use (defined as at least 1 prescription 1 year before SRH) was obtained from the Danish National Prescription Registry, according to ATC codes for non-steroid anti-inflammatory drugs, steroids, statins, and chronic obstructive pulmonary disease drugs. Statistics Patient characteristics were described according to their SRH status. For the overall study population, we calculated the prevalence of opioid use according to SRH. Differences in prevalence between patients with poor vs good SRH (reference) were determined for patients who were alive at the start of day 30 after THA. Thus, follow-up began 30 days after THA surgery. Using log-binomial regression, we calculated crude prevalence differences, crude prevalence ratios, and prevalence ratios adjusted for age, sex, CCI, mental disorders, medication use, and education, for patients with poor SRH vs good SRH. The total MME per person 1–12 months after THA and the median among all patients who redeemed an opioid in the same period were further calculated with interquartile range (IQR). The median difference with 95% confidence intervals (CI) was calculated with bootstrapping. In addition, to examine the dose–response association between SRH and opioid use after THA, we estimated adjusted prevalence ratios for patients with poor, fair, good, or very good SRH vs patients with excellent SRH in the overall study population. Prevalences, prevalence differences and ratios, and MME were further calculated by preoperative opioid use status. All estimates are presented with CIs. Finally, to test for immortal time bias and selection bias we calculated mortality by SRH 1 year after answering SRH and further restricted overall analyses to individuals who underwent THA within 1 year after answering SRH. The mortality by SRH for 1 year follow-up after THA was also reported to evaluate the potential selection bias. The analyses were performed in Stata 17.0 (StataCorp LLC, College Station, TX, USA). Handling of missing data Approximately 60% of invited persons completed a detailed questionnaire in the Danish National Health Survey, with lower response rate among persons with lower educational status [ 22 31 32 Less than 2% of our final study population had missing data on education, and because the missingness was not random, we did not perform multiple imputation. Ethics, funding, and disclosures The study was reported to the Danish Data Protection Agency through registration at Aarhus University (record number: AU-2016-051-000001, sequential number 880). Ethical approval is not required in Denmark for studies on routinely collected registry data. Individuals participating in the Danish National Health Surveys have participated voluntarily and have given written permission that their data can be used for research purposes. According to the Danish legislation, datasets generated and/or analyzed in the current study are not publicly available. ABP and HTS were supported by, and employed at, the Department of Clinical Epidemiology at Aarhus University, and Aarhus University Hospital. The Department of Clinical Epidemiology, Aarhus University, and Aarhus University Hospital receive funding from various companies in the form of research grants to (and administered by) Aarhus University. None of these grants are related to the present study. The authors declare no conflicts of interest. Complete disclosure of interest forms according to ICMJE are available on the article page, doi: 10.2340/17453674.2025.44758 Results Population We identified a cohort of 381,323 respondents who completed the question on SRH in the Danish National Health Surveys in 2010, 2013, or 2017. Within this cohort, we identified 4,174 people age > 35 years, who, after answering the question on SRH, underwent THA between 2010 and 2018, as recorded in the Danish Hip Arthroplasty Registry. After exclusion of 6 patients who died during 0–30 days of follow-up (corresponding to the start of outcome measurement at day 30), the final study population consisted of 4,168 patients ( Figure 1 Figure 1 Flow diagram. THA: total hip arthroplasty. 876 (21%) THA patients had poor SRH, while 3,292 (79%) had good SRH before THA. The median number of days from completion of the question on SRH and THA was 1,084 days overall (IQR 426–1,780), 780 days (IQR 286–1,548) for patients with poor SRH, and 1,160 days (IQR 515–1,826) for patients with good SRH. Patients with poor and good SRH had similar median ages. Compared with patients with good SRH, patients with poor SRH were more likely to be female (60% vs 54%), to have moderate or high CCI scores (49% vs 27%), to have pain-associated conditions (14% vs 7%), to take various medications (87% vs 79%), and to have low education (40% vs 31%) ( Table 1 Table 1 Characteristics of the study population, overall and according to preoperative opioid use Characteristic Overall Preoperative Preoperative opioid non-users opioid users a Poor SRH Good SRH Poor SRH Good SRH Poor SRH Good SRH n = 876 n = 3,292 n = 410 n = 2,328 n = 466 n = 964 Female sex 529 (60) 1,789 (54) 233 (57) 1,222 (52) 296 (64) 567 (59) Age, years < 60 139 (16) 470 (14) 75 (18) 359 (15) 64 (14) 111 (12) 60–70 274 (31) 1,081 (33) 141 (34) 817 (35) 133 (29) 264 (27) > 70 463 (53) 1,741 (53) 194 (47) 1,152 (49) 269 (58) 589 (61) Charlson Comorbidity Index Low 451 (51) 2,392 (73) 237 (58) 1,768 (76) 214 (46) 624 (65) Moderate 303 (35) 739 (22) 129 (31) 470 (20) 174 (37) 269 (28) High 122 (14) 161 (4.9) 44 (11) 90 (3.9) 78 (17) 71 (7.4) Education Low 348 (40) 1,007 (31) 149 (36) 680 (29) 199 (43) 327 (34) Moderate 374 (43) 1,450 (44) 180 (44) 1,028 (44) 194 (42) 422 (44) High 142 (16) 794 (24) 75 (18) 596 (26) 67 (14) 198 (21) Missing 12 (1.4) 41 (1.3) 6 (1.5) 24 (1.0) 6 (1.3) 17 (1.8) Pain-related conditions 121 (14) 219 (6.7) 36 (8.8) 136 (5-8) 85 (18) 83 (8.6) Mental disorders 15 (1.7) 20 (0.6) 7 (1.7) 14 (0.6) 8 (1.7) 6 (0.6) Medication use 764 (87) 2,614 (79) 345 (84) 1,740 (75) 419 (90) 874 (91) SRH = self-rated health. a Preoperative opioid users: patients who redeemed at least 1 opioid prescription 0–6 months before THA. Opioid use The overall prevalence of opioid use was 36% among patients with poor SRH and 14% among patients with good SRH ( Figure 2 Table 1 Figure 2 Prevalence of opioid use from 1 month to 1 year after total hip arthroplasty, according to self-rated health (SRH) and preoperative opioid use status. Preoperative users: patients who redeemed at least 1 opioid prescription 0–6 months before THA. Among the 4,168 THA patients alive on day 30 from THA, 1,430 (34%) were preoperative opioid users, and 2,738 (66%) were preoperative opioid non-users. A similar distribution of patient characteristics by SRH was observed among preoperative opioid users and non-users, while preoperative opioid users in general had worse health than non-users (see Table 1 For preoperative non-users, the prevalence of opioid use was 15% among patients with poor SRH and 6% among patients with good SRH. This corresponds to a prevalence difference of 8.2 (CI 4.6–11.8) percentage points and the adjusted prevalence ratio of 2.20 (CI 1.65–2.93) for those with poor SRH vs good SRH ( Table 2 Table 2 Figure 3 Table 2 Prevalence and prevalence ratios of opioid use from 1 month to 1 year after total hip arthroplasty Prevalence, n (%) Crude PD in percentage points (CI) Crude PR (CI) Adjusted PR a Good SRH Poor SRH Overall 132 (14) 315 (36) 22.0 (18.6–25.4) 2.61 (2.31–2.95) 2.33 (2.05–2.65) Preoperative opioid non-users 140 (6) 62 (15) 8.2 (4.6–11.8) 2.27 (1.72–3.01) 2.20 (1.65–2.93) Preoperative opioid users 299 (31) 252 (54) 23.1 (17.7–28.5) 1.74 (1.53–1.97) 1.64 (1.44–1.86) SRH = self-rated health. CI = 95% confidence interval. PD = prevalence difference. PR = prevalence ratio. Preoperative opioid users: patients who redeemed at least 1 opioid prescription 0–6 months before THA. a Adjusted for age, sex, Charlson Comorbidity Index, mental disorders, medication use, and education. Figure 3 Median milligram morphine equivalent dose (MME) from 1 month to 1 year after total hip arthroplasty, according to self-rated health (SRH) and preoperative opioid use status. Preoperative users: see Figure 2 Restricting to individuals who underwent THA within 1 year of reporting SRH (n = 900), the prevalence difference for postoperative opioid use was 16.9 (CI 11.0–22.7) percentage points and the adjusted prevalence ratio was 2.26 (CI 1.67–3.06) for patients with poor SRH vs patients with good SRH. Among preoperative opioid non-users the prevalence difference was 2.0 (CI –2.8 to 6.9) percentage points and the adjusted prevalence ratio was 1.15 (CI 0.57–2.33) for those with poor SRH vs good SRH, while among preoperative opioid users the prevalence difference was 25.5 (CI 14.8–36.3) percentage points and the adjusted prevalence ratio was 1.94 (CI 1.43–2.62) for those with poor SRH vs good SRH. Mortality The mortality within 1 year of answering SRH in 2010 was 3.8% among people with poor and 0.5% among people with good SRH. A similar difference in mortality was observed among individuals answering SRH in 2013 and 2017. The mortality rate 1–12 months after THA was 1.03% (CI 0.47–1.94) and 0.76% (CI 0.49–1.12) among patients with poor and good SRH, respectively. Discussion We examined the association between preoperative SRH and opioid use after THA in patients with hip osteoarthritis. We found that patients with poor preoperative SRH are more likely to experience pain and to use opioids for 1–12 months after THA compared with those with good SRH. Furthermore, patients with poor SRH are more likely to redeem higher doses of opioids than patients with good SRH. Comparison with other studies and clinical implications A study including 970 opioid-naïve patients [ 17 Studies in various populations have demonstrated that SRH is an independent predictor of mortality [ 15 33 13 14 34 35 Several possible explanations exist for the association between SRH and opioid use after THA, including comorbidities, social networks, and postoperative complications. Although we adjusted for comorbidities, individuals consider a wide spectrum of factors when rating their health [ 12 12 36 37 38 39 40 Several studies have reported an association between chronic pain and poor SRH [ 18 41 Limitations A cross-sectional study design is less suitable for causal questions. There could be some immortal time bias from the time of measuring SRH to THA because people with poor SRH have a higher chance of dying and never being offered THA than those with good SRH, as we have seen in our data. Data on SRH was available only for a small proportion of patients undergoing THA registered in the Danish Hip Arthroplasty Register. However, available patients were largely representative of the entire THA population, except for educational level [ 31 42 Conclusion Patients with poor preoperative SRH exhibited higher opioid use and redeemed higher MME doses in the year after THA compared with those with good SRH. In perspective, ABP and NME contributed to data acquisition. All authors contributed substantially to conception and study design, analyses plan, interpretation of data, drafting and revising the paper, finalizing the paper, final approval of the paper, and are accountable for all aspects of the work. Handling co-editors: Keijo Mäkelä and Robin Christensen Acta 1 Kehlet H Enhanced postoperative recovery: good from afar, but far from good? Anaesthesia 2020 75 Suppl 1 e54 e61 10.1111/anae.14860 31903577 2 Danish Health Authority Guide for pain Danish Health Authority 2019 3 Dawson Z Stanton S S Roy S Farjo R Aslesen H A Hallstrom B R et al Opioid consumption after discharge from total knee and hip arthroplasty: a systematic review and meta-analysis J Arthroplasty 2024 9 8 2130 6.e7 10.1016/j.arth.2024.01.063 38336301 4 Kleno A S Mechlenburg I Gademan M G J Sorensen H T Pedersen A B Do sex, age, and comorbidities modify the association of socioeconomic status and opioid use after total hip arthroplasty?: a population-based study from the Danish Hip Arthroplasty Register Acta Orthop 2024 95 233 42 10.2340/17453674.2024.40708 38757926 PMC11100492 5 Kornvig S Kehlet H Jorgensen C C Fink-Jensen A Videbech P Pedersen A B et al Association of preoperative psychopharmacological treatment and the risk of new chronic opioid use after hip and knee arthroplasty: a Danish registry-based cohort study of 73,033 procedures Acta Orthop 2025 96 492 8 10.2340/17453674.2025.44228 40583467 PMC12207537 6 Turppo V Sund R Huopio J Kroger H Sirola J Pain medication purchases before and after total hip and knee arthroplasty: a register study of 329,743 arthroplasties Acta Orthop 2022 93 534 41 10.2340/17453674.2022.2929 35694789 PMC9189755 7 Van Brug H E Nelissen R Lijfering W M Van Steenbergen L N Rosendaal F R Van Dorp E L A et al Opioid prescribing patterns after arthroplasty of the knee and hip: a Dutch nationwide cohort study from 2013 to 2018 Acta Orthop 2022 93 667 81 10.2340/17453674.2022.3993 35848731 PMC9327187 8 Kleno A N Sorensen H T Pedersen A B Time trends in use of non-steroidal anti-inflammatory drugs and opioids one year after total hip arthroplasty due to osteoarthritis during 1996–2018: a population-based cohort study of 103,209 patients Osteoarthritis Cartilage 2022 30 1376 84 10.1016/j.joca.2022.07.006 35918050 9 Alho H Dematteis M Lembo D Maremmani I Roncero C Somaini L Opioid-related deaths in Europe: strategies for a comprehensive approach to address a major public health concern Int J Drug Policy 2020 76 102616 10.1016/j.drugpo.2019.102616 31855706 10 Haddock C K Poston W S Pyle S A Klesges R C Vander Weg M W Peterson A et al The validity of self-rated health as a measure of health status among young military personnel: evidence from a cross-sectional survey Health Qual Life Outcomes 2006 4 57 10.1186/1477-7525-4-57 16939653 PMC1569825 11 Wuorela M Lavonius S Salminen M Vahlberg T Viitanen M Viikari L Self-rated health and objective health status as predictors of all-cause mortality among older people: a prospective study with a 5-, 10-, and 27-year follow-up BMC Geriatr 2020 20 120 10.1186/s12877-020-01516-9 32228464 PMC7106830 12 Singh-Manoux A Martikainen P Ferrie J Zins M Marmot M Goldberg M What does self rated health measure? Results from the British Whitehall II and French Gazel cohort studies J Epidemiol Community Health 2006 60 364 72 10.1136/jech.2005.039883 16537356 PMC2566175 13 Wennberg P Rolandsson O van der A D L Spijkerman A M Kaaks R Boeing H et al Self-rated health and type 2 diabetes risk in the European Prospective Investigation into Cancer and Nutrition-InterAct study: a case-cohort study BMJ Open 2013 3 10.1136/bmjopen-2012-002436 PMC3612773 23471609 14 Moller L Kristensen T S Hollnagel H Self rated health as a predictor of coronary heart disease in Copenhagen, Denmark J Epidemiol Community Health 1996 50 423 8 10.1136/jech.50.4.423 8882226 PMC1060313 15 DeSalvo K B Bloser N Reynolds K He J Muntner P Mortality prediction with a single general self-rated health question: a meta-analysis J Gen Intern Med 2006 21 267 75 10.1111/j.1525-1497.2005.00291.x 16336622 PMC1828094 16 Pokela N Bell J S Lihavainen K Sulkava R Hartikainen S Analgesic use among community-dwelling people aged 75 years and older: a population-based interview study Am J Geriatr Pharmacother 2010 8 233 44 10.1016/j.amjopharm.2010.05.001 20624613 17 Stark N Kerr S Stevens J Prevalence and predictors of persistent post-surgical opioid use: a prospective observational cohort study Anaesth Intensive Care 2017 45 700 6 10.1177/0310057X1704500609 29137580 18 Lindberg M F Rustoen T Miaskowski C Rosseland L A Lerdal A The relationship between pain with walking and self-rated health 12 months following total knee arthroplasty: a longitudinal study BMC Musculoskelet Disord 2017 18 75 10.1186/s12891-017-1430-7 28183297 PMC5301389 19 Christensen A I Lau C J Kristensen P L Johnsen S B Wingstrand A Friis K et al The Danish National Health Survey: study design, response rate and respondent characteristics in 2010, 2013 and 2017 Scand J Public Health 2022 50 180 8 10.1177/1403494820966534 33161874 20 Gundtoft P H Varnum C Pedersen A B Overgaard S The Danish Hip Arthroplasty Register Clin Epidemiol 2016 8 509 14 10.2147/CLEP.S99498 27822092 PMC5094646 21 Pottegard A Schmidt S A J Wallach-Kildemoes H Sorensen H T Hallas J Schmidt M Data resource profile: the Danish National Prescription Registry Int J Epidemiol 2017 46 798 f 10.1093/ije/dyw213 27789670 PMC5837522 22 Schmidt M Schmidt S A Sandegaard J L Ehrenstein V Pedersen L Sorensen H T The Danish National Patient Registry: a review of content, data quality, and research potential Clin Epidemiol 2015 7 449 90 10.2147/CLEP.S91125 26604824 PMC4655913 23 Jensen V M Rasmussen A W Danish education registers Scand J Public Health 2011 39 91 4 10.1177/1403494810394715 21775362 24 Schmidt M Pedersen L Sorensen H T The Danish Civil Registration System as a tool in epidemiology Eur J Epidemiol 2014 29 541 9 10.1007/s10654-014-9930-3 24965263 25 Jivraj N K Raghavji F Bethell J Wijeysundera D N Ladha K S Bateman B T et al Persistent postoperative opioid use: a systematic literature search of definitions and population-based cohort study Anesthesiology 2020 132 1528 39 10.1097/ALN.0000000000003265 32243330 PMC8202398 26 de Oliveira Costa J Bruno C Baranwal N Gisev N Dobbins T A Degenhardt L et al Variations in long-term opioid therapy definitions: a systematic review of observational studies using routinely collected data (2000–2019) Br J Clin Pharmacol 2021 87 3706 20 10.1111/bcp.14798 33629352 27 Kristiansen E B Pedersen A B Variation in risk of opioid therapy and association with mortality following hip or knee arthroplasty: an analysis based on 14 different definitions Acta Orthop 2025 96 664 70 10.1002/pds.3945 40891928 PMC12404099 28 Nielsen S Degenhardt L Hoban B Gisev N A synthesis of oral morphine equivalents (OME) for opioid utilisation studies Pharmacoepidemiol Drug Saf 2016 25 733 7 10.1002/pds.3945 26693665 29 Zinboonyahgoon N Luansritisakul C Eiamtanasate S Duangburong S Sanansilp V Korwisi B et al Comparing the ICD-11 chronic pain classification with ICD-10: how can the new coding system make chronic pain visible? A study in a tertiary care pain clinic setting Pain 2021 162 1995 2001 10.1097/j.pain.0000000000002196 33449507 30 Storgaard Jensen S Hviid Gundtoft P Gjertsen J E Pedersen A B Impact of dementia, depression, and other mental disorders on reoperation and mortality among hip fracture patients: a nationwide Danish cohort study J Gerontol A Biol Sci Med Sci 2025 80 7 glaf074 10.1093/gerona/glaf074 40244623 31 Jensen S S W L Gadgaard R G Sørensen H T Pedersen A B Representativeness of the Danish National Health Survey for research in total hip arthroplasty patients: a population based study Hamburg ISAR 2024 32 Jensen H A R Lau C J Davidsen M Feveile H B Christensen A I Ekholm O The impact of non-response weighting in health surveys for estimates on primary health care utilization Eur J Public Health 2022 32 450 5 10.1093/eurpub/ckac032 35373254 PMC9159316 33 Burstrom B Fredlund P Self rated health: is it as good a predictor of subsequent mortality among adults in lower as well as in higher social classes? J Epidemiol Community Health 2001 55 836 40 10.1136/jech.55.11.836 11604441 PMC1763304 34 Hetlevik O Meland E Hufthammer K O Breidablik H J Jahanlu D Vie T L Self-rated health in adolescence as a predictor of ‘multi-illness’ in early adulthood: a prospective registry-based Norwegian HUNT study SSM Popul Health 2020 11 100604 10.1016/j.ssmph.2020.100604 32509958 PMC7265049 35 Jylha M What is self-rated health and why does it predict mortality? Towards a unified conceptual model Soc Sci Med 2009 69 307 16 10.1016/j.socscimed.2009.05.013 19520474 36 Nordenfelt L Concepts of health and their consequences for health care Theor Med 1993 14 277 85 10.1007/BF00996335 8184370 37 McEwen B S Gianaros P J Stress- and allostasis-induced brain plasticity Annu Rev Med 2011 62 431 45 10.1146/annurev-med-052209-100430 20707675 PMC4251716 38 Guidi J Lucente M Sonino N Fava G A Allostatic load and its impact on health: a systematic review Psychother Psychosom 2021 90 11 27 10.1159/000510696 32799204 39 Cornwell E Y Waite L J Social disconnectedness, perceived isolation, and health among older adults J Health Soc Behav 2009 50 31 48 10.1177/002214650905000103 19413133 PMC2756979 40 Cserep Z Losoncz E Toth R Toth A Juhasz B Balog P et al Self-rated health is associated with the length of stay at the intensive care unit and hospital following cardiac surgery BMC Cardiovasc Disord 2014 14 171 10.1186/1471-2261-14-171 25432074 PMC4258288 41 Mantyselka P T Turunen J H Ahonen R S Kumpusalo E A Chronic pain and poor self-rated health JAMA 2003 290 2435 42 10.1001/jama.290.18.2435 14612480 42 Lundberg O Manderbacka K Assessing reliability of a measure of self-rated health Scand J Soc Med 1996 24 218 24 10.1177/140349489602400314 8878376 ",
  "metadata": {
    "Title of this paper": "Assessing reliability of a measure of self-rated health",
    "Journal it was published in:": "Acta Orthopaedica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489806/"
  }
}