{
  "title": "Paper_925",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471139 PMC12471139.1 12471139 12471139 41010565 10.3390/jcm14186360 jcm-14-06360 1 Article Sequential Treatment for Osteoporosis After Teriparatide: A Real-Life Long-Term Comparison Between Zoledronic Acid and Denosumab https://orcid.org/0000-0002-7055-1081 Ghielmetti Alberto 1 * https://orcid.org/0000-0002-7236-0713 Grassi Giorgia 1 Zampogna Marta 1 2 https://orcid.org/0000-0002-9065-3886 Mantovani Giovanna 1 2 https://orcid.org/0000-0001-7594-3300 Chiodini Iacopo 3 4 Eller-Vainicher Cristina 1 Anastasilakis Athanasios D. Academic Editor 1 giorgia.grassi@policlinico.mi.it cristina.eller@policlinico.mi.it 2 3 4 * alberto.ghielmetti@policlinico.mi.it 09 9 2025 9 2025 14 18 497642 6360 31 7 2025 29 8 2025 05 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Results: p p p p p p p p Conclusions: osteoporosis teriparatide zoledronic acid denosumab sequential osteoporosis treatment Piano Nazionale di Ripresa e Resilienza PNRR PNRR_MAD_2022_12375951 Italian Ministry of Health Fondazione IRCCS Ca’ Granda Ospedale Maggiore Policlinico, Milan, Italy The APC was funded by a Piano Nazionale di Ripresa e Resilienza PNRR (PNRR_MAD_2022_12375951) grant to Cristina Eller-Vainicher and by Ricerca Corrente Funds from the Italian Ministry of Health to Fondazione IRCCS Ca’ Granda Ospedale Maggiore Policlinico, Milan, Italy. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Osteoporosis is a systemic skeletal disorder characterized by low bone mass and micro-architectural deterioration of bone tissue, resulting in increased risk of fracture (FX) [ 1 2 3 2 3 4 2 3 4 One of the osteoanabolic agents approved for the treatment of osteoporosis is teriparatide (TPTD), i.e. parathyroid hormone (1-34), which, at the dose of 20 mcg/day, was proven to reduce vertebral and non-vertebral FX compared to placebo in postmenopausal women [ 5 6 7 8 9 10 2 3 11 Nevertheless, significant BMD loss has been described after TPTD withdrawal [ 9 12 13 14 15 13 14 13 12 9 14 16 2 3 17 Nevertheless, although the topic is extremely relevant from a clinical point of view, the available evidence is quite scarce, and only a few studies have explored the efficacy of antiresorptive treatment (bisphosphonates or DMAB) after TPTD. A treatment option after stopping TPTD is represented by denosumab (DMAB), which has proven to be superior to oral bisphosphonates (BPs) with regard to bone mineral density (BMD) gain [ 18 19 20 2 3 21 22 23 24 25 26 27 28 Given the absence of real-life long-term data on the effect of sequential therapy after TPTD withdrawal, the present study aimed primarily to describe BMD changes during the first 24 and 48 months after TPTD withdrawal, assessing the effects of the treatment with a single administration of ZOL 5 mg or with DMAB (conventional treatment 60 mg every 6 months). A secondary aim of the study was to evaluate the occurrence of incident vertebral and hip fragility FX during the first 48 months from TPTD withdrawal, in patients treated only with ZOL or only with DMAB during the entire follow-up period. 2. Materials and Methods 2.1. Subjects and Study Design This retrospective study was conducted at the outpatient clinic for Metabolic Bone Diseases of Fondazione IRCCS Ca’ Granda Ospedale Maggiore Policlinico in Milan (Italy) and evaluated data of all osteoporotic patients treated with TPTD (20 mcg/day) from May 2009 to May 2023. We included data at baseline (T0), after 24 months (T1), and after 48 months (T2). The inclusion criteria for a patient to be included in the T0–T1 evaluation were as follows: (i) TPTD treatment for ≥18 months (with ≥80% compliance); (ii) subsequent treatment with either ZOL 5 mg (single infusion) or DMAB (regularly administered 60 mg every 6 months), started within three months from TPTD withdrawal; (iii) availability of Dual-Energy X-ray Absorptiometry (DEXA) measurement at TPTD withdrawal and after 24 months from ZOL infusion or DMAB start performed with Hologic devices; and (iv) availability of spine X-ray to perform vertebral morphometry, at TPTD withdrawal and after 24 months from ZOL infusion or DMAB start. The exclusion criteria were as follows: (i) DMAB treatment duration of less than 24 months and/or unsatisfactory compliance with DMAB treatment (at least one injection delayed, ≥3 weeks, or missed) and (ii) DEXA measurements with different devices at the scheduled timepoints. For a patient to be included in the T0–T2 evaluation, we used the following inclusion criteria: (i) treatment (period 0–48 months from TPTD withdrawal) with either ZOL 5 mg (at least one infusion) or DMAB (regularly administered 60 mg every 6 months for the entire follow-up period); (ii) availability of a Hologic DEXA measurement at T0 and T2; (iii) availability of spine X-ray at T0 and T2. Exclusion criteria were as follows: (i) unsatisfactory compliance with DMAB treatment (as previously defined); (ii) DEXA measurement with different devices at the scheduled timepoints (T0–T2); and (iii) switch from DMAB or ZOL to other anti-osteoporotic drugs during the follow-up period. The study design, with division of patients into groups, is shown in Figure 1 Figure 1 Among patients with further available follow-up at T2, some continued the follow-up after the first ZOL administration at T0 (Group A1), some repeated a second ZOL administration at T1 (Group A2), and some continued DMAB therapy (Group B). The 15 patients from Group A1 did not undergo a second ZOL infusion because either they had a T-score > −2.5 at all sites (N = 7), refused other anti-osteoporotic treatments (N = 3), or, despite having regularly performed at T1 DEXA and spine X-rays, were lost at the scheduled follow-up visit at 24 months due to pandemic-related reasons (N = 5). Ethical approval was obtained from the Ethics Committee (Milan, Lombardia 3) (ID 5165, response 17 September 2024). 2.2. Methods For all subjects at T0, the following data were collected: age, gender, type of osteoporosis (primary or secondary), use of antiresorptive therapy before TPTD and its duration, duration of TPTD treatment, prevalent and incident fragility FX, 10-year risk for major osteoporotic FX, hip FX estimated using the FRAX Calculation Tool [ 29 The BMD measurements at the lumbar spine (LS) and total hip (TH) were performed using DEXA (Hologic systems). The BMD measurements were expressed as T-scores, which were calculated by the third National Health and Nutrition Examination Survey, using data from young White females as a reference [ 30 At T0, T1, and T2, a conventional spine X-ray in lateral and anteroposterior projection (T4–L4) was obtained in all patients using a standardized technique. Morphometric Vertebral Fractures (FX) were identified according to the semiquantitative visual assessment (SQ) [ 31 32 2.3. Statistical Analysis For each variable, the normality of distribution was tested using the Kolmogorov–Smirnov test. Quantitative variables were expressed as the mean ± standard deviation or median (interquartile range) when not normally distributed. Comparisons between two groups (A and B) were made using independent sample t t The BMD gain is expressed as median ΔT-score, as follows. Two-tailed p 3. Results 3.1. BMD Changes Clinical and demographic characteristics at T0 of all included patients and patients included in Group A and Group B are shown in Table 1 Considering both groups A and B, a significant improvement in T-score was noticed at all sites in the T0–T1 period ( Table 2 Figure 2 Table 3 Figure 3 In the subgroup of 46 patients with available follow-up at both 24 and 48 months (T1 and T2), we compared the baseline (T0) characteristics of the A1, A2, and B groups. We found that patients in Group A2 had experienced a shorter duration of TPTD treatment than those in Group A1 (18.3 (3.6) vs. 24.3 (0.4) months, p Table 4 Comparisons between groups A1, A2, and B at T0, T1, and T2 timepoints are given in Table 4 Table 5 Table 4 Table 5 3.2. Incidence of FX During the first 24 months of observation, three patients suffered from an incident vertebral FX (3/77, 3.9%), and they all belonged to Group A (5.3 vs. 0.0%, p p p 4. Discussion This real-life study provides novel and clinically relevant evidence showing that the initiation of antiresorptive treatment immediately after the completion of teriparatide (TPTD) therapy can lead to substantial and measurable improvements in bone mineral density (BMD). These positive effects were observed both at the lumbar spine (LS) and at the total hip (TH) after a 24-month follow-up, and they were consistently present regardless of whether patients received a single intravenous infusion of zoledronic acid (ZOL) or repeated subcutaneous administrations of denosumab (DMAB). It is important to underline that, in our cohort, the improvements observed at the hip site were not only preserved but remained stable for as long as 48 months in the group treated with ZOL. In contrast, patients who were managed with DMAB displayed a continuous and progressive increase in BMD at all skeletal sites assessed, confirming the well-recognized and persistent antiresorptive action of this therapeutic agent, which proved to ensure a sustained BMD gain for up to 10 years, without reaching a plateau [ 33 To the best of our knowledge, this study represents the first real-world investigation demonstrating that a single infusion of ZOL at the conventional dose of 5 mg, administered at the time of TPTD withdrawal, is capable not only of maintaining the BMD previously gained but also of further enhancing it, particularly at the hip level, with effects lasting for as long as 48 months. This observation stands in contrast to the majority of earlier studies, which generally reported stabilization of BMD with annual ZOL administrations observed at 12 and 24 months [ 22 23 34 20 24 25 26 24 25 26 In our study, while both DMAB and ZOL were able to produce significant BMD increases at the 24-month evaluation, DMAB administration resulted in a significantly greater gain at LS. This result is consistent with previous findings showing that DMAB is particularly effective in trabecular-rich skeletal sites, an effect that has been observed in sequential treatment regimens following TPTD when compared to oral bisphosphonates [ 18 19 20 24 35 24 35 20 From a clinical management point of view, the use of a single ZOL infusion has additional advantages beyond efficacy. The simplicity of the regimen, requiring only one administration, may significantly enhance patient adherence, which is an essential determinant of therapeutic success [ 27 36 28 24 25 Regarding fracture outcomes, our study did not detect a statistically significant difference in the incidence of vertebral or hip fractures between the two therapeutic groups, a finding that is consistent with those of previous real-life studies [ 23 37 38 The potential incorporation of bone turnover markers (BTMs) into clinical practice could provide an additional tool for optimizing post-anabolic therapy. Markers such as serum CTX or P1NP have been proposed to help identify patients at higher risk of early bone loss, thereby allowing clinicians to individualize the timing and possible repetition of ZOL administration [ 39 40 40 Our study, however, presents several limitations that should be acknowledged. First, the retrospective and non-randomized design means that treatment allocation—whether ZOL or DMAB—was based on clinical judgment rather than on standardized protocols, and the decision to repeat ZOL infusions was similarly individualized. Although baseline characteristics were comparable across the study groups, the possibility of unmeasured confounding factors cannot be excluded. Second, the relatively small sample size, particularly in the subgroup of patients followed for 48 months, may have reduced the statistical power to detect significant differences in fracture incidence. Finally, we did not have access to BTMs in our dataset, which would have provided valuable additional insights into treatment response and might have helped to further personalize post-anabolic strategies. Future prospective studies with randomized allocation and systematic incorporation of BTMs are therefore warranted to validate and expand our observations. In conclusion, our findings indicate that both ZOL and DMAB can be considered effective consolidation strategies following TPTD withdrawal, but their optimal use should be carefully tailored to the individual patient’s characteristics and residual fracture risk. In those with low residual risk, a single infusion of ZOL seems to be sufficient to maintain the benefits achieved, particularly by sustaining hip BMD gains and preventing lumbar spine BMD loss for up to 48 months, while offering the additional advantage of simplicity and improved adherence. In contrast, in patients with persistently high fracture risk, DMAB may represent the preferred option, especially given its superior efficacy at the lumbar spine, with the essential caveat that discontinuation of DMAB must always be accompanied by bisphosphonate administration to avoid the severe rebound effect characterized by rapid BMD loss and multiple vertebral fractures [ 28 41 42 43 Overall, these real-world results strongly emphasize the need for prospective randomized trials specifically designed to assess long-term and personalized treatment strategies after TPTD therapy. Such trials should take into account fracture risk stratification, BMD profiles, duration of anabolic treatment, and possibly BTMs, with the ultimate goal of developing individualized algorithms capable of optimizing both clinical outcomes and healthcare resource utilization in the long-term management of osteoporosis. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.G., I.C. and C.E.-V.; methodology, A.G., I.C., G.M. and C.E.-V.; validation, A.G., I.C. and C.E.-V.; formal analysis, A.G., G.G. and C.E.-V.; investigation, A.G., I.C. and C.E.-V.; data curation, A.G., M.Z. and C.E.-V.; writing—original draft preparation, A.G.; writing—review and editing, A.G., G.G., M.Z., G.M., I.C. and C.E.-V.; visualization, A.G.; supervision, C.E.-V.; project administration, C.E.-V.; funding acquisition, C.E.-V. and G.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of Milan Lombardia 3 (ID 5165) on 17 September 2024. Informed Consent Statement The requirement for patient consent was waived, with Ethics Committee approval (Milan Lombardia 3 ID 5165 on 17 September 2024) due to the retrospective observational study design conducted in a clinical research center (IRCCS–Istituto di Ricovero e Cura a Carattere Scientifico), in accordance with Italian legislation. Data Availability Statement The Dataset is available from the authors upon request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ANOVA Analysis of Variance BMD Bone mineral density BTMs Bone Turnover Markers CTX C-terminal telopeptide DEXA Dual-Energy X-ray Absorptiometry DMAB Denosumab EUROFORS European Study of Forsteo FPT Fracture Prevention Trial FX Fracture(s) LS Lumbar Spine P1NP Procollagen Type 1 N-terminal Propeptide SD Standard Deviation SDI Spine Deformity Index SQ Semi-quantitative TH Total hip TPTD Teriparatide US United States ZOL Zoledronic acid References 1. Compston J.E. McClung M.R. Leslie W.D. Osteoporosis Lancet 2019 393 364 376 10.1016/S0140-6736(18)32112-3 30696576 2. Shoback D. Rosen C.J. Black D.M. Cheung A.M. Murad M.H. Eastell R. Pharmacological Management of Osteoporosis in Postmenopausal Women: An Endocrine Society Guideline Update J. Clin. Endocrinol. Metab. 2020 105 dgaa048 10.1210/clinem/dgaa048 32068863 3. Camacho P.M. Petak S.M. Binkley N. Diab D.L. Eldeiry L.S. Farooki A. Harris S.T. Hurley D.L. Kelly J. Lewiecki E.M. American Association of Clinical Endocrinologists/American College of Endocrinology Clinical Practice Guidelines for the Diagnosis and Treatment of Postmenopausal Osteoporosis—2020 Update Endocr. Pract. 2020 26 1 46 10.4158/GL-2020-0524SUPPL 32427503 4. Cosman F. Lewiecki E.M. Eastell R. Ebeling P.R. Jan De Beur S. Langdahl B. Rhee Y. Fuleihan G.E.-H. Kiel D.P. Schousboe J.T. Goal-Directed Osteoporosis Treatment: ASBMR/BHOF Task Force Position Statement 2024 J. Bone Miner. Res. 2024 39 1393 1405 10.1093/jbmr/zjae119 39073912 PMC11425703 5. Neer R.M. Arnaud C.D. Zanchetta J.R. Prince R. Gaich G.A. Reginster J.Y. Hodsman A.B. Eriksen E.F. Ish-Shalom S. Genant H.K. Effect of Parathyroid Hormone (1–34) on Fractures and Bone Mineral Density in Postmenopausal Women with Osteoporosis N. Engl. J. Med. 2001 344 1434 1441 10.1056/NEJM200105103441904 11346808 6. Kendler D.L. Marin F. Zerbini C.A.F. Russo L.A. Greenspan S.L. Zikan V. Bagur A. Malouf-Sierra J. Lakatos P. Fahrleitner-Pammer A. Effects of Teriparatide and Risedronate on New Fractures in Post-Menopausal Women with Severe Osteoporosis (VERO): A Multicentre, Double-Blind, Double-Dummy, Randomised Controlled Trial Lancet 2018 391 230 240 10.1016/S0140-6736(17)32137-2 29129436 7. Kurland E.S. Cosman F. McMahon D.J. Rosen C.J. Lindsay R. Bilezikian J.P. Parathyroid Hormone as a Therapy for Idiopathic Osteoporosis in Men: Effects on Bone Mineral Density and Bone Markers J. Clin. Endocrinol. Metab. 2000 85 3069 3076 10.1210/jc.85.9.3069 10999788 8. Orwoll E.S. Scheele W.H. Paul S. Adami S. Syversen U. Diez-Perez A. Kaufman J.M. Clancy A.D. Gaich G.A. The Effect of Teriparatide [Human Parathyroid Hormone (1–34)] Therapy on Bone Density in Men with Osteoporosis J. Bone Miner. Res. 2003 18 9 17 10.1359/jbmr.2003.18.1.9 12510800 9. Kaufman J.-M. Orwoll E. Goemaere S. San Martin J. Hossain A. Dalsky G.P. Lindsay R. Mitlak B.H. Teriparatide Effects on Vertebral Fractures and Bone Mineral Density in Men with Osteoporosis: Treatment and Discontinuation of Therapy Osteoporos. Int. 2005 16 510 516 10.1007/s00198-004-1713-3 15322742 10. Saag K.G. Shane E. Boonen S. Marín F. Donley D.W. Taylor K.A. Dalsky G.P. Marcus R. Teriparatide or Alendronate in Glucocorticoid-Induced Osteoporosis N. Engl. J. Med. 2007 357 2028 2039 10.1056/NEJMoa071408 18003959 11. Ebina K. Hirao M. Hashimoto J. Hagihara K. Kashii M. Kitaguchi K. Matsuoka H. Iwahashi T. Chijimatsu R. Yoshikawa H. Assessment of the Effects of Switching Oral Bisphosphonates to Denosumab or Daily Teriparatide in Patients with Rheumatoid Arthritis J. Bone Miner. Metab. 2018 36 478 487 10.1007/s00774-017-0861-4 28766140 12. Adami S. San Martin J. Muñoz-Torres M. Econs M.J. Xie L. Dalsky G.P. McClung M. Felsenberg D. Brown J.P. Brandi M.L. Effect of Raloxifene after Recombinant Teriparatide [hPTH(1–34)] Treatment in Postmenopausal Women with Osteoporosis Osteoporos. Int. 2008 19 87 94 10.1007/s00198-007-0485-y 17938984 13. Eastell R. Nickelsen T. Marin F. Barker C. Hadji P. Farrerons J. Audran M. Boonen S. Brixen K. Gomes J.M. Sequential Treatment of Severe Postmenopausal Osteoporosis after Teriparatide: Final Results of the Randomized, Controlled European Study of Forsteo (EUROFORS) J. Bone Miner. Res. 2009 24 726 736 10.1359/jbmr.081215 19049337 14. Lindsay R. Scheele W.H. Neer R. Pohl G. Adami S. Mautalen C. Reginster J.-Y. Stepan J.J. Myers S.L. Mitlak B.H. Sustained Vertebral Fracture Risk Reduction after Withdrawal of Teriparatide in Postmenopausal Women with Osteoporosis Arch. Intern. Med. 2004 164 2024 2030 10.1001/archinte.164.18.2024 15477438 15. Prince R. Sipos A. Hossain A. Syversen U. Ish-Shalom S. Marcinowska E. Halse J. Lindsay R. Dalsky G.P. Mitlak B.H. Sustained Nonvertebral Fragility Fracture Risk Reduction after Discontinuation of Teriparatide Treatment J. Bone Miner. Res. 2005 20 1507 1513 10.1359/JBMR.050501 16059622 16. Fahrleitner-Pammer A. Langdahl B.L. Marin F. Jakob F. Karras D. Barrett A. Ljunggren Ö. Walsh J.B. Rajzbaum G. Barker C. Fracture Rate and Back Pain during and after Discontinuation of Teriparatide: 36-Month Data from the European Forsteo Observational Study (EFOS) Osteoporos. Int. 2011 22 2709 2719 10.1007/s00198-010-1498-5 21113576 PMC3169763 17. Forsteo|European Medicines Agency Available online: https://www.ema.europa.eu/en/medicines/human/EPAR/forsteo (accessed on 8 June 2024) 18. Ebina K. Hashimoto J. Kashii M. Hirao M. Kaneshiro S. Noguchi T. Tsukamoto Y. Yoshikawa H. The Effects of Switching Daily Teriparatide to Oral Bisphosphonates or Denosumab in Patients with Primary Osteoporosis J. Bone Miner. Metab. 2017 35 91 98 10.1007/s00774-015-0731-x 26762133 19. Niimi R. Kono T. Nishihara A. Hasegawa M. Kono T. Sudo A. Efficacy of Switching from Teriparatide to Bisphosphonate or Denosumab: A Prospective, Randomized, Open-Label Trial JBMR Plus 2018 2 289 294 10.1002/jbm4.10054 30283910 PMC6139701 20. Kocjan T. Rajic A.S. Janez A. Vidmar G. Orehek N. Marc J. Ostanek B. Switching to Denosumab or Bisphosphonates After Completion of Teriparatide Treatment in Women with Severe Postmenopausal Osteoporosis Endocr. Pract. 2021 27 941 947 10.1016/j.eprac.2021.05.012 34111556 21. Liu J. Laster A. Xu X. Guo H. Oates M. Gandra S.R. Patterns of Teriparatide and Sequential Antiresorptive Agent Treatment Among Elderly Female Medicare Beneficiaries J. Bone Miner. Res. 2021 36 2309 2316 10.1002/jbmr.4439 34490946 22. Sarli M.A. Habib C. Zanchetta M.B. Which Is the Best Antiresorptive Treatment after Finishing Teriparatide? Medicina 2021 81 749 753 34633947 23. Dito G. Lugaresi M. Degradi C. Guabello G. Longhi M. Corbetta S. Efficacy of Switching from Teriparatide to Zoledronic Acid or Denosumab on Bone Mineral Density and Biochemical Markers of Bone Turnover in Older Patients with Severe Osteoporosis: A Real-Life Study Endocrine 2023 82 181 189 10.1007/s12020-023-03431-6 37402061 PMC10462496 24. Reid I.R. Black D.M. Eastell R. Bucci-Rechtweg C. Su G. Hue T.F. Mesenbrink P. Lyles K.W. Boonen S. HORIZON Pivotal Fracture Trial and HORIZON Recurrent Fracture Trial Steering Committees Reduction in the Risk of Clinical Fractures after a Single Dose of Zoledronic Acid 5 Milligrams J. Clin. Endocrinol. Metab. 2013 98 557 563 10.1210/jc.2012-2868 23293335 25. Grey A. Bolland M.J. Horne A. Mihov B. Gamble G. Reid I.R. Bone Mineral Density and Bone Turnover 10 Years After a Single 5 mg Dose or Two 5-Yearly Lower Doses of Zoledronate in Osteopenic Older Women: An Open-Label Extension of a Randomized Controlled Trial J. Bone Miner. Res. 2022 37 3 11 10.1002/jbmr.4453 34585780 26. Bolland M.J. Nisa Z. Mellar A. Gasteiger C. Pinel V. Mihov B. Bastin S. Grey A. Reid I.R. Gamble G. Fracture Prevention with Infrequent Zoledronate in Women 50 to 60 Years of Age N. Engl. J. Med. 2025 392 239 248 10.1056/NEJMoa2407031 39813642 27. Fobelo Lozano M.J. Sánchez-Fidalgo S. Adherence and Preference of Intravenous Zoledronic Acid for Osteoporosis versus Other Bisphosphonates Eur. J. Hosp. Pharm. 2019 26 4 9 10.1136/ejhpharm-2017-001258 31157088 PMC6362767 28. Tsourdi E. Zillikens M.C. Meier C. Body J.J. Rodriguez E.G. Anastasilakis A.D. Abrahamsen B. McCloskey E. Hofbauer L.C. Guanabens N. Fracture Risk and Management of Discontinuation of Denosumab Therapy: A Systematic Review and Position Statement by ECTS J. Clin. Endocrinol. Metab. 2021 106 264 281 10.1210/clinem/dgaa756 33103722 29. Kanis J.A. Cooper C. Rizzoli R. Reginster J.-Y. Scientific Advisory Board of the European Society for Clinical and Economic Aspects of Osteoporosis and Osteoarthritis (ESCEO) and the Committees of Scientific Advisors and National Societies of the International Osteoporosis Foundation (IOF) Executive Summary of European Guidance for the Diagnosis and Management of Osteoporosis in Postmenopausal Women Aging Clin. Exp. Res. 2019 31 15 17 10.1007/s40520-018-1109-4 30612282 30. Binkley N. Kiebzak G.M. Lewiecki E.M. Krueger D. Gangnon R.E. Miller P.D. Shepherd J.A. Drezner M.K. Recalculation of the NHANES Database SD Improves T-Score Agreement and Reduces Osteoporosis Prevalence J. Bone Miner. Res. 2005 20 195 201 10.1359/JBMR.041115 15647812 31. Genant H.K. Wu C.Y. van Kuijk C. Nevitt M.C. Vertebral Fracture Assessment Using a Semiquantitative Technique J. Bone Miner. Res. 1993 8 1137 1148 10.1002/jbmr.5650080915 8237484 32. Kerkeni S. Kolta S. Fechtenbaum J. Roux C. Spinal Deformity Index (SDI) Is a Good Predictor of Incident Vertebral Fractures Osteoporos. Int. 2009 20 1547 1552 10.1007/s00198-008-0832-7 19137350 33. Bone H.G. Wagman R.B. Brandi M.L. Brown J.P. Chapurlat R. Cummings S.R. Czerwinski E. Fahrleitner-Pammer A. Kendler D.L. Lippuner K. 10 Years of Denosumab Treatment in Postmenopausal Women with Osteoporosis: Results from the Phase 3 Randomised FREEDOM Trial and Open-Label Extension Lancet Diabetes Endocrinol. 2017 5 513 523 10.1016/S2213-8587(17)30138-9 28546097 34. Giveon S. Zacay G. Vered I. Foldes A.J. Tripto-Shkolnik L. Zoledronic Acid Sequential to Teriparatide May Promote Greater Inhibition of Bone Resorption than Zoledronic Acid Alone Ther. Adv. Endocrinol. Metab. 2023 14 20420188231213639 10.1177/20420188231213639 38028331 PMC10666713 35. McClung M.R. Bolognese M.A. Brown J.P. Reginster J.-Y. Langdahl B.L. Maddox J. Shi Y. Rojeski M. Meisner P.D. Grauer A. A Single Dose of Zoledronate Preserves Bone Mineral Density for up to 2 Years after a Second Course of Romosozumab Osteoporos. Int. 2020 31 2231 2241 10.1007/s00198-020-05502-0 32623487 PMC7560921 36. Hiligsmann M. Cornelissen D. Vrijens B. Abrahamsen B. Al-Daghri N. Biver E. Brandi M.L. Bruyère O. Burlet N. Cooper C. Determinants, Consequences and Potential Solutions to Poor Adherence to Anti-Osteoporosis Treatment: Results of an Expert Group Meeting Organized by the European Society for Clinical and Economic Aspects of Osteoporosis, Osteoarthritis and Musculoskeletal Diseases (ESCEO) and the International Osteoporosis Foundation (IOF) Osteoporos. Int. 2019 30 2155 2165 10.1007/s00198-019-05104-5 31388696 PMC6811382 37. Lindsay R. Krege J.H. Marin F. Jin L. Stepan J.J. Teriparatide for Osteoporosis: Importance of the Full Course Osteoporos. Int. 2016 27 2395 2410 10.1007/s00198-016-3534-6 26902094 PMC4947115 38. Jacques R.M. Boonen S. Cosman F. Reid I.R. Bauer D.C. Black D.M. Eastell R. Relationship of Changes in Total Hip Bone Mineral Density to Vertebral and Nonvertebral Fracture Risk in Women with Postmenopausal Osteoporosis Treated with Once-Yearly Zoledronic Acid 5 Mg: The HORIZON-Pivotal Fracture Trial (PFT) J. Bone Miner. Res. 2012 27 1627 1634 10.1002/jbmr.1644 22532515 39. Wang M. Wu Y.-F. Girgis C.M. Bisphosphonate Drug Holidays: Evidence From Clinical Trials and Real-World Studies JBMR Plus 2022 6 e10629 10.1002/jbm4.10629 35720669 PMC9189912 40. Borgen T.T. Lee-Ødegård S. Eriksen B.F. Eriksen E.F. Intermittent Dosing of Zoledronic Acid Based on Bone Turnover Marker Assessment Reduces Vertebral and Non-Vertebral Fractures JBMR Plus 2024 8 ziae072 10.1093/jbmrpl/ziae072 38939827 PMC11208720 41. Grassi G. Chiodini I. Palmieri S. Cairoli E. Arosio M. Eller-Vainicher C. Bisphosphonates after Denosumab Withdrawal Reduce the Vertebral Fractures Incidence Eur. J. Endocrinol. 2021 185 387 396 10.1530/EJE-21-0157 34232124 42. Grassi G. Ghielmetti A. Zampogna M. Chiodini I. Arosio M. Mantovani G. Eller Vainicher C. Zoledronate after Denosumab Discontinuation: Is Repeated Administrations More Effective than Single Infusion? J. Clin. Endocrinol. Metab. 2024 109 e1817 e1826 10.1210/clinem/dgae224 38609157 PMC11403318 43. Kobayakawa T. Kanayama Y. Hirano Y. Yukishima T. Nakamura Y. Therapy with Transitions from One Bone-Forming Agent to Another: A Retrospective Cohort Study on Teriparatide and Romosozumab JBMR Plus 2024 8 ziae131 10.1093/jbmrpl/ziae131 39605880 PMC11601723 Figure 1 Summary of study design. TPTD = teriparatide; N.A. = not available because either absent or not conformable to inclusion/exclusion criteria for T2 evaluation, as specified in the Methods section. * In Group A after T1, 7 patients asked to be referred to other centers, 5 at the time of study analysis still had to come for T2 follow-up, 4 lacked a suitable T2 DEXA evaluation as defined in the Methods section, 4 were lost at the scheduled follow-up, 3 were shifted to DMAB for their convenience (possibility to administer therapy at home), and 1 died for reasons unrelated to osteoporosis (lung cancer developed after T1), whereas in Group B, 3 patients were shifted to bisphosphonates at T1 (having achieved a BMD target deemed satisfactory), 2 were lost at the scheduled follow-up, 1 was not compliant with DMAB therapy, and 1 lacked a suitable T2 DEXA evaluation as defined in the Methods section. Figure 2 BMD trends in groups A (treated with ZOL at T0, N = 56) and B (treated with DMAB, N = 21). Data are expressed as the mean T-score ± SD. ** p Figure 3 Differences between ΔT-score (T1 − T0), expressed as median (interquartile range), in groups A (treated with ZOL at T0, N = 56) and B (treated with DMAB, N = 21). ** p jcm-14-06360-t001_Table 1 Table 1 Clinical and demographic characteristics at T0 in all patients and in groups A and B. Variables at T0 All Group A Group B P Age (years) 71.1 (15.9) 67.9 (16.6) 74.0 (11.7) 0.185 Female gender 64 (83.1) 46 (82.1) 18 (85.7) 0.709 Secondary OP 37 (48.0) 29 (51.8) 8 (38.1) 0.317 ARs prior to TPTD 65 (84.4) 49 (87.5) 16 (76.2) 0.291 Years of ARs prior to TPTD 4.0 (6.5) 4.5 (5.5) 3.0 (8.5) 0.648 TPTD treatment (months) 24 (5.1) 23.9 (6.1) 24.1 (0.35) 0.140 Vertebral FX (≥1) 77 (100) 56 (100) 21 (100) 1.000 SDI 7 (7) 7 (9) 9 (6) 0.153 Hip FX (≥1) 8 (10.4) 5 (8.9) 3 (14.3) 0.676 FRAX (10 years major fracture risk, %) 28.5 (21.3) 27 (19.3) 30.5 (27) 0.143 FRAX (10 years hip fracture risk, %) 12.5 (16.1) 11 (14.9) 14 (23.3) 0.162 T-score TH −2.26 ± 0.98 −2.21 ± 0.99 −2.42 ± 0.95 0.251 T-score LS −2.48 ± 1.25 −2.51 ± 1.20 −2.41 ± 1.38 0.320 Serum calcium (mg/dL) 9.54 ± 0.42 9.50 ± 0.39 9.65 ± 0.46 0.217 Serum creatinine (mg/dL) 0.81 (0.29) 0.81 (0.32) 0.81 (0.35) 0.495 Group A: patients treated with Zoledronate; Group B: patients treated with denosumab. OP: osteoporosis; ARs: antiresorptive agents; TPTD: teriparatide; FX: fractures; SDI: Spine Deformity Index; TH: total hip; LS: lumbar spine; calcium normal values 8.1–10.5 mg/dL; creatinine normal values 0.6–1.2 mg/dL. jcm-14-06360-t002_Table 2 Table 2 BMD trends in groups A and B (period T0–T1). Variable Group A T0 Group A P Group B Group B P T-score TH −2.21 ± 0.99 −1.97 ± 1.13 0.002 −2.42 ± 0.95 −2.21 ± 0.96 0.001 T-score LS −2.51 ± 1.20 −2.29 ± 1.33 0.006 −2.41 ± 1.38 −1.84 ± 1.41 <0.001 Group A: patients treated with Zoledronate; Group B: patients treated with denosumab; TH: total hip; LS: lumbar spine. jcm-14-06360-t003_Table 3 Table 3 BMD gains in groups A and B (period T0–T1). Variable Group A (N = 56) Group B (N = 21) P ΔT TH (T1 − T0) 0.15 (0.40) 0.20 (0.35) 0.740 ΔT LS (T1 − T0) 0.20 (0.43) 0.50 (0.50) 0.004 Group A: patients treated with Zoledronate; Group B: patients treated with denosumab; TH: total hip; LS: lumbar spine; ΔT = ∆T-score, expressed as median (interquartile range). jcm-14-06360-t004_Table 4 Table 4 Comparisons within and between groups A1, A2, and B in patients with available follow-up at T0, T1, and T2 timepoints (Group A has been split into A1 and A2, also at T0 and T1). Variable Group A1 T0 Group A1 T1 Group A1 T2 P Group A2 T0 Group Group P Group Group Group P P T-score TH −1.78 −1.49 −1.44 0.004 * −1.78 −1.58 −1.57 0.008 § −2.57 −2.32 −2.19 <0.001 # T0: 0.030 ^ T-score LS −2.21 −1.94 −2.13 0.041 + −1.99 −1.87 −1.73 0.203 −2.67 −2.17 −2.02 <0.001 ° T0: 0.400 TH: total hip; LS: lumbar spine. From post hoc comparisons of within-groups tests: * T1 vs. T0 p p p p p p p p p p p p p jcm-14-06360-t005_Table 5 Table 5 Comparisons within and between groups A1, A2, and B in patients with available follow-up at T0, T1, and T2 timepoints (Group A has been split into A1 and A2, also at T0 and T1). Median Group A1 T0T1 Group A1 Group A1 P 1 Group A2 Group Group P 1 Group Group Group P 1 P TH 0.3 0.1 0.3 (0.5) 0.120 0.1 0 0.3 0.139 0.2(0.4) 0.1 (0.5) 0.3 (0.3) 0.360 T0T1: 0.182 LS 0.3 −0.2 0.2 (1.3) 0.109 0.2 0.1 0.3 0.820 0.5 0.1 0.6 0.410 T0T1: 0.607 TH: total hip; LS: lumbar spine. 1 ",
  "metadata": {
    "Title of this paper": "Therapy with Transitions from One Bone-Forming Agent to Another: A Retrospective Cohort Study on Teriparatide and Romosozumab",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471139/"
  }
}