{
  "title": "Paper_990",
  "abstract": "pmc Genes (Basel) Genes (Basel) 2104 genes genes Genes 2073-4425 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470167 PMC12470167.1 12470167 12470167 41010030 10.3390/genes16091085 genes-16-01085 1 Review Genetic and Epigenetic Factors in Ulcerative Colitis: A Narrative Literature Review Caba Lavinia 1 Florea Andreea 1 2 * https://orcid.org/0000-0002-5403-2265 Cianga Petru 3 4 https://orcid.org/0000-0002-7596-2656 Drug Vasile 5 6 https://orcid.org/0000-0002-2183-0690 Popescu Roxana 1 https://orcid.org/0000-0001-9375-9224 Mihai Catalina 5 6 https://orcid.org/0009-0007-9885-642X Ciobanu Cristian-Gabriel 1 2 Iacob Vlad Victor 2 Florea Laura 7 Gorduza Eusebiu Vlad 1 Lio Domenico Academic Editor 1 lavinia.caba@umfiasi.ro eusebiu.gorduza@umfiasi.ro 2 3 petru.cianga@umfiasi.ro 4 5 6 7 * andreea.florea@umfiasi.ro 15 9 2025 9 2025 16 9 496504 1085 30 7 2025 25 8 2025 28 8 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Ulcerative colitis is a chronic inflammatory bowel disease whose incidence is steadily growing worldwide. The interactions between host genetic susceptibility, gut microbiota and environmental factors determine the onset and relapsing evolution of ulcerative colitis, making it a multifactorial disorder. Methods: A narrative review was conducted to synthesize the available literature on the genes and mechanisms related to ulcerative colitis. Results: The most important independent risk factor is genetics and the candidate genes are associated with inflammation, immune regulation and epithelial permeability. Multiple GWAS have already identified candidate genes and their polymorphisms implicated in ulcerative colitis pathogenesis. Genetic susceptibility is conferred by predisposing variants influencing disease onset and progression, as well as by epigenetic modifications (DNA methylation, microRNAs). Conclusions: This review summarizes the interactions between the functional products encoded by genes linked to ulcerative colitis and immunological factors revealing their common mechanisms. ulcerative colitis genetics epigenetics GWAS polymorphisms University of Medicine and Pharmacy “Grigore T. Popa” Iaşi no 33810/14.12.2023 This study was supported by the University of Medicine and Pharmacy “Grigore T. Popa” Iaşi—internal grant no 33810/14.12.2023 and PhD Thesis “Genetic modifications in ulcerative colitis” (PhD Student—Andreea Florea). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Inflammatory bowel diseases (IBDs) are complex and heterogeneous conditions that encompass two major and important entities: ulcerative colitis (UC) and Crohn’s disease (CD) [ 1 2 3 4 5 6 7 5 8 9 10 11 12 Ulcerative colitis, one of the key phenotypes of IBD, is a common, complex and idiopathic disorder. Over time, a multitude of factors have been determined to contribute to its pathogenesis: genetic susceptibility, host immune system and environmental factors [ 4 13 Among these elements, the most important independent risk factor is the genetic one, a fact observed in many families by aggregation studies that have been performed. In individuals with UC, the genetic component presents a rate in the range of 10–15% in monozygotic twins versus 9.4% in dizygotic twins. Moreover, first-degree relatives of IBD patients have a 10-times-higher risk of developing the disease than the general population [ 13 14 15 15 16 17 4 18 19 Ulcerative colitis is characterized by its localization restricted to the colon and rectum, with damage only to the mucosa and submucosa layers and a continuous, circumferential and symmetric distribution of lesions on the colon wall. The most common onset is at an age range of 15–30 years [ 20 The hallmark symptom in UC is frequent bloody diarrhea. Other symptoms include constipation, abdominal discomfort and the feeling of imminent defecation. Weight loss can occur, as well as extraintestinal manifestations, which are present in 10–30% of cases [ 20 21 1 20 21 20 21 The diagnostic is mainly based on aspects of the clinical presentation and endoscopic and histopathological features, but some laboratory tests also help to exclude other disorders [ 2 22 For a correct assessment of the disease, biopsies should be taken from at least two different areas of the lesions and from all affected segments [ 23 24 21 23 25 2 21 26 The therapeutic objective is to induce and maintain remission, with minimal side effects. The treatment includes a diversity of medication classes, such as amino salicylates, immunomodulators, corticosteroids, biologic agents, antibiotics and targeted therapies [ 21 27 25 26 The aim of our review is to present the most recent knowledge in a field that has accumulated a lot of information concerning the pathophysiology and genetic changes (both at the genome and epigenome levels) in correlation with modern therapies. 2. Pathophysiology There is still a lot to discover about ulcerative colitis pathophysiology, but a few elements have been repetitively evaluated and confirm that a carefully orchestrated interaction of several elements is the key to the onset and progression of ulcerative colitis. The main factors involved are a dysregulated immune response, a disrupted epithelial barrier, gut microbiome changes, genetic susceptibility and the exposome ( Figure 1 28 2.1. Dysregulated Immune Response and Disrupted Epithelial Barrier in Individuals with UC In healthy individuals, the intestinal epithelium acts as a crucial frontline barrier protecting individuals against invading pathogens. Under normal conditions, there are four compartments of the gut wall that act together to provide equilibrium. The first one is mucus, which lines the colonic epithelium and protects it from toxic substances and dangerous bacteria. The second barrier is formed by intestinal epithelial cells represented by colonocytes, intercalated by goblet cells and enteroendocrine cells. These cells establish a functional barrier by being closely linked to each other via tight junction cells [ 17 29 17 Immune dysregulation plays a key role in increasing intestinal permeability and compromising barrier function [ 30 31 30 In an undisturbed colon, the active subset of macrophages (CX3CR1 resident macrophages) secretes an anti-inflammatory cytokine (IL-10) that promotes the differentiation and activation of regulatory T cells (Tregs), suppresses pro-inflammatory T helper cell responses and maintains immune equilibrium and the integrity of the epithelial barrier [ 32 33 CXCL13 CXCL10 CXCL9 CXCL8 CCL19 CTLA4 CD69 CD163 CCR1 PECAM1 IL7R TLR8 TLR2 34 32 33 35 36 37 31 38 39 Dendritic cells are antigen-presenting cells, and in ulcerative colitis their function is dysregulated. They also produce pro-inflammatory cytokines (TNF-α, IL-8 and IL-6) and promote Th1 and Th17 differentiation, leading to excessive T-cell activation and chronic mucosal inflammation [ 33 Antigen-presenting cells, such as dendritic cells and macrophages, serve as a bridge between innate and adaptive immunity. Despite their different origins, both cells types express pattern-recognition receptors, like Toll-like receptors (TLRs) and NOD proteins. Activation of these receptors stimulates NF-κB and other transcription factors, promoting inflammatory processes [ 30 Neutrophils play a central role in UC pathogenesis by initiating, amplifying and sometimes regulating inflammation. They provoke tissue damage by activating the release of reactive oxygen species (which damage cell membranes) and metalloproteinases (which degrade the extracellular matrix and disrupt epithelial junctions). Neutrophils also secrete pro-inflammatory cytokines (TNF-α, IL-1β) and chemokines (IL-8—a potent chemotactic factor for neutrophils, whose concentration has been associated with ulcerative colitis endoscopic and histological activity) [ 17 33 40 The innate lymphoid cell population (ILC) is shifted in UC (increased groups 1–2 and decreased protective group 3) contributing to inflammation and barrier dysfunction. ILC1s secrete IFN-γ and TNF-α, promoting inflammation (Th1-like functions), while ILC2s secrete IL-4, IL-5 and IL-13 and are involved in type 2 immune responses (function like Th2 cells). ILC3s are considered protective (function as Th17 cells) due to their abilities to secrete IL-22, which is an important factor for the epithelial barrier. They also secrete IL-17 and TNF-α [ 30 33 40 CD4+ T cells are a highly expressed subset in ulcerative colitis and are represented by Th1, Th2, Th17 and Tregs cells [ 31 41 31 33 35 42 CD8 + + 28 In UC, B cells contribute to both immune regulation and inflammation. They include effector B cells (secreting IL-2, IL-4, IFN-γ) and regulatory B cells (secreting IL-10). In UC, there is an increase in IgG-secreting plasma cells, which promotes inflammation by enhancing TNF-α and IL-1β production [ 33 2.2. Signaling Pathways To date, there are a few signaling pathways highlighted in the development and evolution of ulcerative colitis: JAK/STAT, TLR4/NF-κB, PI3K/AKT, Notch, Wnt/β-catenin and MAPKs. All these pathways can be modulated by targeted therapies for ulcerative colitis [ 31 The JAK/STAT pathway (Janus kinase/signal transducer and activator of the transcription) is a key intracellular signaling mechanism that mediates the effects of over 50 cytokines and growth factors, playing a central role in immune regulation and inflammation [ 31 43 43 44 32 31 A central player in the inflammatory cascade of UC is the NF-κB (nuclear factor kappa-light-chain-enhancer of activated B cells) pathway. It is a key transcription factor that regulates genes involved in inflammation, immune response, cell survival and epithelial homeostasis. NF-κB can be either activated via the canonical pathway by cytokines (TNF-α and IL-1β ultimately promote the transcription of pro-inflammatory genes), microbes and stress, or via the non-canonical pathway through specific receptors (leading to disturbances in the immune system) [ 31 44 45 32 The Wnt/β-catenin signaling pathway is crucial for mucosal renewal and for barrier functions; alterations in this pathway lead to abnormal homeostasis and the development of ulcerative colitis. Wnt ligand expression is highly segregated along the intestinal tract, and the dysregulation of Wnt signaling can follow two different directions [ 44 45 44 The mitogen-activated protein kinase (MAPK) pathway is a conserved kinase cascade involved in regulating cell proliferation, apoptosis, differentiation, inflammatory responses and transcriptional regulation. The MAPK family includes stress-activated serine/threonine–protein kinases such as extracellular-regulated kinases 1–8 (ERKs), p38-alpha kinase, Nemo-like kinase (NLK) and c-Jun N-terminal kinase (JNK). Oxidative stress and other extracellular stimuli (growth factors, pro-inflammatory cytokines—TNF-α, IL6, IL-1β) activate MAPKs and consequently regulate gene expression and influence cellular responses. JNK and p38 kinases promote apoptosis. MAPKs are also involved in TLR signaling pathways in dendritic cells [ 43 44 45 The PI3K/Akt/mTOR (phosphatidylinositide 3-kinase/protein kinase B/mTOR) pathway is a major intracellular signaling cascade involved in cell survival, metabolism, proliferation and immune regulation. It is activated by signals from receptor tyrosine kinases, G-protein-coupled receptors and Toll-like receptors. The cascade follows this route: PI3K activates Akt, which stimulates mTOR—an indispensable element for cell growth and metabolism. This pathway plays multiple roles, and its dysregulation leads to (1) the weakening of the intestinal barrier via the disruption of tight junction proteins, (2) overactivation of immune responses, followed by continuous inflammation and (3) alterations in host–microbiota interactions leading to deficits in epithelial repair mechanisms [ 32 44 32 AMPK (AMP-activated protein kinase) is a master regulator of cellular energy homeostasis, and its activation plays a protective role in UC through multiple interrelated mechanisms: autophagy regulation, pyroptosis inhibition, anti-inflammatory effects, restoring intestinal barrier functions and macrophage polarization. Autophagy is essential for maintaining intestinal homeostasis, immune balance and barrier integrity [ 46 47 43 46 46 45 47 46 48 32 48 2.3. Gut Microbiota Gut microbiota (GM) are vast, varied, complex, abundant and stable. The main four phyla of the human gut microbiome are Firmicutes Bacteroidetes Proteobacteria Actinobacteria 41 49 50 The dysbiosis found in IBD is defined as a quantitative and qualitative microbial imbalance. Dysbiosis can lead to an aberrant immune response [ 51 51 52 Bacteroides Clostridium 51 Bifidobacteriaceae Acidaminococcaceae Propionibacteriaceae Nectriaceae 53 41 Bacteroides uniformis Bacteroides bifidum 53 41 54 The exposome encompasses the full range of environmental factors experienced by an individual from conception onwards [ 55 56 57 58 55 59 Bacteroides thetaiotaomicron Akkermansia muciniphila Escherichia coli Proteobacteria 59 55 59 53 3. Genetics and Epigenetics in Individuals with UC 3.1. Monogenic UC Monogenic IBD results from rare, deleterious mutations in genes implicated in the pathogenesis of inflammatory bowel disease (both ulcerative colitis and Crohn’s disease). It typically manifests during early childhood and can be categorized into two groups: infantile IBD (onset within the first 2 years of life) and very early-onset IBD (disease onset before the age of 6 years). The clinical phenotype is generally more severe than in polygenic forms and is frequently associated with recurrent infections [ 60 61 62 IL10 IL10R IL10 IL10RA IL10RB 61 Monogenic IBD presents other common alterations in the following genes: XIAP FOXP3 FERMT1 CYBB COL7A GUCY2C FERMT1 COL7A CYBB FOXP3 XIAP 62 63 3.2. GWAS Studies on Ulcerative Colitis The GWAS Catalog analysis allowed the identification of GWAS that followed the association of polymorphisms and ulcerative colitis. We considered only studies in which the p Table S1 64 IL21 IL23R IL1R1 IL1R2 STAT3 GNA12 ERRF11 PARK7 DAP PARK7 DLD CXCR1 CXCR2 TLRs TLR4 ADCY7 43 65 66 Table S2 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 3.3. Rare Variants Some rare variants are important genomic drivers of IBD, having strong effects. Many such variants have been statistically linked to complex IBD and functionally validated in monogenic IBD. They often overlap with common variants [ 92 IL23R MUC2 IL23R CARD9 JAK2 93 Another study by Wu et al. demonstrated an interesting association between rare variants in ITGB4 MUC3A 94 DUOX2 95 NLRP7 TRIM31 96 3.4. HLA Genes HLA genes are divided into class I ( HLA-A B C HLA-DR DQ DP HLA-DRB1 HLA-DQB1 97 Table 1 HLA-DRB1*0103 97 98 HLA-DQA1*05 HLA-DQA1*05 98 99 3.5. Epigenetics in UC Epigenetic changes refer to changes in gene expression, but which do not modify the DNA sequence. The most common epigenetic mechanisms are DNA methylation, histone modification and non-coding RNAs. The main epigenetic modifications in UC are DNA methylation changes and microRNA [ 66 102 3.5.1. DNA Methylation DNA methylation represents the process by which a methyl group is added to a cytosine or adenine at the 5-position of carbon, where the DNA base thymine is located, and in this way, it is transformed into methylcytosine. This process takes place especially in cytosine phosphate guanine (CpG) dinucleotide sequences [ 65 103 In individuals with UC, genes involved in homeostasis and defense mechanisms tend to be hypermethylated, whereas those associated with immune responses—such as chemokines and interleukins—often show hypomethylation. Also, anti-inflammatory genes ( IL10 SIGLEC5 CD86 CLMP NLRP3 NLRC4 104 THRAP2 FANCC GBGT1 WDR8 CARD9 CDH1 ICAM3 DOK2 TNFSF4 VMP1 CDH1 GDNF SLIT2 MDR1 FMR1 GXYLT2 RARB FOXA2 ROR1 NOTCH3 CDH17 PAD14 TNFSF8 EPHX1 HOXV2 FRK 105 CXCL5 CXCL14 IL4R IL17C GATA3 104 3.5.2. Histone Modifications Histone modifications are mediated by three classes of protein: writers, erasers and readers. Writer proteins add chemical groups to histones through processes such as methylation, acetylation and ubiquitination, thereby influencing chromatin structure. Eraser proteins remove these modifications, reversing their effects. Reader proteins recognize specific histone marks and modulate gene expression by recruiting transcription factors and transcription repressors [ 106 104 106 Histone Methylation Histone methylation mainly occurs on lysine and arginine residues. Lysine can be mono-, di- or tri-methylated by methyltransferases (writers), while demethylases (erasers) remove these marks. Histone methylation can either silence genes or promote active transcription. Silencing marks include the trimethylation of H3 at lysines 9, 27 and 36 (H3K9, H3K27, H3K36), and H4 at lysine 20 (H4K20). In particular, H3K9 trimethylation is essential for establishing and maintaining stable heterochromatin [ 106 107 Histone Acetylation Acetylation occurs only on lysine residues, and its level is controlled by the balance between histone acetyltransferases and histone deacetylases. Lysine acetylation reduces the charge interaction between DNA and histone tails, loosening the chromatin structure [ 103 106 104 3.5.3. MicroRNA In recent years, special interest was paid to the implication of microRNA (miRNA) in the pathogenesis of IBD, suggesting that it could be used equally as a diagnostic marker and as a treatment tool [ 108 109 104 108 In a study conducted by Síbia et al., 33 upregulated and 7 downregulated miRNAs were correlated with UC [ 110 FOXO3a 108 110 NOD2 108 108 110 111 112 108 110 113 108 110 104 MiRNA shows a promising evolution in the diagnostic and prognosis of patients with IBD. First, it has been shown that its expression can be changed before the onset of IBD symptoms. Secondly, its expression can change during the natural course of the disease, making it easier to differentiate between the different stages of the disease. Furthermore, miRNAs can be extracted from serum and plasma, which makes it a potential non-invasive diagnostic marker [ 110 3.5.4. Long Non-Coding RNAs Long non-coding RNAs (lncRNAs) are transcripts longer than 200 nucleotides and are generally poorly conserved. LncRNAs may be polyadenylated or not, and about 98% undergo splicing, with roughly 25% having at least two alternatively spliced isoforms. Common features of lncRNAs include low expression levels, tissue-specific expression and exonic regions with low interspecies sequence conservation [ 114 Studies have shown that lncRNAs play important roles in the pathophysiology of IBD [ 115 BC012900 104 115 115 116 4. Importance of Genetic Variants in Personalized Therapies Over time, multiple therapies have been targeted against the pathways of ulcerative colitis development and progression. Recently, advances have been made, and some evidence suggests that genes and their unique polymorphisms may also help us to understand the therapeutic strategies ( Table 2 IL23R IL6 IL1B TLR9 TL2 TLR4 117 118 IL23R 118 TLR4 LY96 TLR4 TNFRSF1B TLR2 CD14 TLR2 CD14 TNFRSF1B 119 Thiopurine drugs, such as azathioprine, are used in refractory disease as well as in steroid-dependent patients, being a useful adjuvant for anti-TNF agents to minimalize anti-drug antibody formation. Polymorphisms in genes like TPMT NUDT15 NUDT15 120 121 122 Regarding the HLA variants and therapeutic options, it is worth mentioning that HLA-DRB10103 has been associated with immunogenicity to infliximab in IBD cohorts, while HLA-DQA105 is associated with increased anti-drug antibody formation and therapy failure [ 98 Emerging evidence suggests that lncRNAs play a pivotal role in UC pathogenesis, opening new avenues for therapy. The importance of lncRNA DHRS4-AS1 via the miR-206/A3AR axis identified METTL14 116 115 These are just a few examples of how gene polymorphisms can significantly influence treatment response, toxicity and the personalization of UC therapy. The probability of discovering new variants with therapy implications is endless, but more studies are required in this field. 5. Conclusions Ulcerative colitis is a multifactorial disease whose pathogenesis involves host factors (genetic factors, immunity, gut microbiota) and environmental factors. Any imbalance of these elements produces irregularities that result in the appearance of inflammatory bowel disease. GWAS have made it possible to dissect the relation between the genes implicated in ulcerative colitis and the main mechanisms. It is important to know the genetic factors involved in the pathogenesis of UC because this is the premise for the identification of biomarkers useful for early diagnosis and personalized treatment. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/genes16091085/s1 Author Contributions L.C.: Writing—original draft, Writing—review and editing and Supervision; A.F.: Writing—original draft and Writing—review and editing; P.C.: Writing—review and editing and Supervision; V.D.: Writing—review and editing and Supervision; R.P.: Data curation, Formal analysis and Writing—original draft; C.M.: Writing—original draft and Writing—review and editing; C.-G.C.: Data curation, Formal analysis and Writing—original draft; L.F., V.V.I.: Resources and Writing—original draft; E.V.G.: Writing—original draft, Writing—review and editing and Supervision. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Verstockt B. Bressler B. Martinez-Lozano H. McGovern D. Silverberg M.S. Time to Revisit Disease Classification in Inflammatory Bowel Disease: Is the Current Classification of Inflammatory Bowel Disease Good Enough for Optimal Clinical Management? Gastroenterology 2022 162 1370 1382 10.1053/j.gastro.2021.12.246 34995534 2. Valean D. Zaharie R. Taulean R. Usatiuc L. Zaharie F. Recent Trends in Non-Invasive Methods of Diagnosis and Evaluation of Inflammatory Bowel Disease: A Short Review Int. J. Mol. Sci. 2024 25 2077 10.3390/ijms25042077 38396754 PMC10889152 3. Kaplan G.G. Windsor J.W. The four epidemiological stages in the global evolution of inflammatory bowel disease Nat. Rev. Gastroenterol. Hepatol. 2021 18 56 66 10.1038/s41575-020-00360-x 33033392 PMC7542092 4. Agrawal M. Jess T. Implications of the changing epidemiology of inflammatory bowel disease in a changing world United Eur. Gastroenterol. J. 2022 10 1113 1120 10.1002/ueg2.12317 PMC9752308 36251359 5. Barreiro-de Acosta M. Molero A. Artime E. Diaz-Cerezo S. Lizan L. de Paz H.D. Martin-Arranz M.D. Epidemiological, Clinical, Patient-Reported and Economic Burden of Inflammatory Bowel Disease (Ulcerative colitis and Crohn’s disease) in Spain: A Systematic Review Adv. Ther. 2023 40 1975 2014 10.1007/s12325-023-02473-6 36928496 PMC10129998 6. Ng S.C. Shi H.Y. Hamidi N. Underwood F.E. Tang W. Benchimol E.I. Panaccione R. Ghosh S. Wu J.C.Y. Chan F.K.L. Worldwide incidence and prevalence of inflammatory bowel disease in the 21st century: A systematic review of population-based studies Lancet 2017 390 2769 2778 10.1016/S0140-6736(17)32448-0 29050646 7. Collaborators G.B.D.I.B.D. The global, regional, and national burden of inflammatory bowel disease in 195 countries and territories, 1990-2017: A systematic analysis for the Global Burden of Disease Study 2017 Lancet Gastroenterol. Hepatol. 2020 5 17 30 10.1016/S2468-1253(19)30333-4 31648971 PMC7026709 8. Kaplan G.G. The global burden of IBD: From 2015 to 2025 Nat. Rev. Gastroenterol. Hepatol. 2015 12 720 727 10.1038/nrgastro.2015.150 26323879 9. Zhang Z. Du N. Xu C.M. Chen W. Ting Ting C. Xiao Y. Global, regional, and national burden of inflammatory bowel disease in persons aged 60–89 years from 1992 to 2021 BMC Gastroenterol. 2025 25 425 10.1186/s12876-025-04042-3 40457222 PMC12131378 10. Cohen R.D. Yu A.P. Wu E.Q. Xie J. Mulani P.M. Chao J. Systematic review: The costs of ulcerative colitis in Western countries Aliment. Pharmacol. Ther. 2010 31 693 707 10.1111/j.1365-2036.2010.04234.x 20064142 11. Pakdin M. Zarei L. Bagheri Lankarani K. Ghahramani S. The cost of illness analysis of inflammatory bowel disease BMC Gastroenterol. 2023 23 21 10.1186/s12876-023-02648-z 36658489 PMC9854042 12. Yu A.P. Cabanilla L.A. Wu E.Q. Mulani P.M. Chao J. The costs of Crohn’s disease in the United States and other Western countries: A systematic review Curr. Med. Res. Opin. 2008 24 319 328 10.1185/030079908x260790 18067689 13. Ramos G.P. Papadakis K.A. Mechanisms of Disease: Inflammatory Bowel Diseases Mayo Clin. Proc. 2019 94 155 165 10.1016/j.mayocp.2018.09.013 30611442 PMC6386158 14. Borowitz S.M. The epidemiology of inflammatory bowel disease: Clues to pathogenesis? Front. Pediatr. 2022 10 1103713 10.3389/fped.2022.1103713 36733765 PMC9886670 15. Jans D. Cleynen I. The genetics of non-monogenic IBD Hum. Genet. 2023 142 669 682 10.1007/s00439-023-02521-9 36720734 16. Furey T.S. Sethupathy P. Sheikh S.Z. Redefining the IBDs using genome-scale molecular phenotyping Nat. Rev. Gastroenterol. Hepatol. 2019 16 296 311 10.1038/s41575-019-0118-x 30787446 PMC8311467 17. Porter R.J. Kalla R. Ho G.T. Ulcerative colitis: Recent advances in the understanding of disease pathogenesis F1000Research 2020 9 294 10.12688/f1000research.20805.1 32399194 PMC7194476 18. Kondo K. Ono Y. Ohfuji S. Watanabe K. Yamagami H. Watanabe M. Nishiwaki Y. Fukushima W. Hirota Y. Suzuki Y. Smoking and drinking habits relating to development of ulcerative colitis in Japanese: A multicenter case-control study JGH Open 2023 7 61 67 10.1002/jgh3.12857 36660047 PMC9840195 19. Yuan S. Chen J. Ruan X. Sun Y. Zhang K. Wang X. Li X. Gill D. Burgess S. Giovannucci E. Smoking, alcohol consumption, and 24 gastrointestinal diseases: Mendelian randomization analysis Elife 2023 12 e84051 10.7554/eLife.84051 36727839 PMC10017103 20. Lynch W.D. Hsu R. Ulcerative Colitis StatPearls StatPearls Treasure Island, FL, USA 2023 21. Muzammil M.A. Fariha F. Patel T. Sohail R. Kumar M. Khan E. Khanam B. Kumar S. Khatri M. Varrassi G. Advancements in Inflammatory Bowel Disease: A Narrative Review of Diagnostics, Management, Epidemiology, Prevalence, Patient Outcomes, Quality of Life, and Clinical Presentation Cureus 2023 15 e41120 10.7759/cureus.41120 37519622 PMC10382792 22. Andersen V. Bennike T.B. Bang C. Rioux J.D. Hebert-Milette I. Sato T. Hansen A.K. Nielsen O.H. Investigating the Crime Scene-Molecular Signatures in Inflammatory Bowel Disease Int. J. Mol. Sci. 2023 24 11217 10.3390/ijms241311217 37446397 PMC10342864 23. Kaenkumchorn T. Wahbeh G. Ulcerative Colitis: Making the Diagnosis Gastroenterol. Clin. N. Am. 2020 49 655 669 10.1016/j.gtc.2020.07.001 33121687 24. Vespa E. D’Amico F. Sollai M. Allocca M. Furfaro F. Zilli A. Dal Buono A. Gabbiadini R. Danese S. Fiorino G. Histological Scores in Patients with Inflammatory Bowel Diseases: The State of the Art J. Clin. Med. 2022 11 939 10.3390/jcm11040939 35207211 PMC8880199 25. Kobayashi T. Siegmund B. Le Berre C. Wei S.C. Ferrante M. Shen B. Bernstein C.N. Danese S. Peyrin-Biroulet L. Hibi T. Ulcerative colitis Nat. Rev. Dis. Primers 2020 6 74 10.1038/s41572-020-0205-x 32913180 26. M’Koma A.E. Inflammatory Bowel Disease: Clinical Diagnosis and Surgical Treatment-Overview Medicina 2022 58 567 10.3390/medicina58050567 35629984 PMC9144337 27. Dai N. Haidar O. Askari A. Segal J.P. Colectomy rates in ulcerative colitis: A systematic review and meta-analysis Dig. Liver Dis. 2023 55 13 20 10.1016/j.dld.2022.08.039 36180365 28. Calvez V. Puca P. Di Vincenzo F. Del Gaudio A. Bartocci B. Murgiano M. Iaccarino J. Parand E. Napolitano D. Pugliese D. Novel Insights into the Pathogenesis of Inflammatory Bowel Diseases Biomedicines 2025 13 305 10.3390/biomedicines13020305 40002718 PMC11853239 29. Fu M. Wang Q.W. Liu Y.R. Chen S.J. The role of the three major intestinal barriers in ulcerative colitis in the elderly Ageing Res. Rev. 2025 108 102752 10.1016/j.arr.2025.102752 40210198 30. Kaluzna A. Olczyk P. Komosinska-Vassev K. The Role of Innate and Adaptive Immune Cells in the Pathogenesis and Development of the Inflammatory Response in Ulcerative Colitis J. Clin. Med. 2022 11 400 10.3390/jcm11020400 35054093 PMC8780689 31. Liang Y. Li Y. Lee C. Yu Z. Chen C. Liang C. Ulcerative colitis: Molecular insights and intervention therapy Mol. Biomed. 2024 5 42 10.1186/s43556-024-00207-w 39384730 PMC11464740 32. Qu F. Xu B. Kang H. Wang H. Ji J. Pang L. Wu Y. Zhou Z. The role of macrophage polarization in ulcerative colitis and its treatment Microb. Pathog. 2025 199 107227 10.1016/j.micpath.2024.107227 39675441 33. Shimomori Y. Yokoyama Y. Kurumi H. Akita K. Kazama T. Hayashi Y. Mizukami K. Nakase H. Unraveling the complexity of ulcerative colitis: Insights into cytokine dysregulation and targeted therapies EXCLI J. 2025 24 638 658 10.17179/excli2025-8374 40630470 PMC12235269 34. Hu W. Fang T. Zhou M. Chen X. Identification of hub genes and immune infiltration in ulcerative colitis using bioinformatics Sci. Rep. 2023 13 6039 10.1038/s41598-023-33292-y 37055495 PMC10101977 35. Roda G. Marocchi M. Sartini A. Roda E. Cytokine Networks in Ulcerative Colitis Ulcers 2011 2011 391787 10.1155/2011/391787 36. Sands B.E. Kaplan G.G. The role of TNFalpha in ulcerative colitis J. Clin. Pharmacol. 2007 47 930 941 10.1177/0091270007301623 17567930 37. Shaban S.F. Abdel-Fattah E.A. Ali M.M. Dessouky A.A. An Overview of the Involvement of Tumor Necrosis Factor Alpha in the Pathogenesis of Ulcerative Colitis IJCBS 2023 24 1361 1366 38. Wu M. Liu D. Xiong X. Su Q. Xiang Y. Shen L. An Z. Yang X. Analysis of the molecular mechanisms of ulcerative colitis and atherosclerosis by microarray data Sci. Rep. 2025 15 10715 10.1038/s41598-025-95125-4 40155679 PMC11953266 39. Zhang M. Li X. Zhang Q. Yang J. Liu G. Roles of macrophages on ulcerative colitis and colitis-associated colorectal cancer Front. Immunol. 2023 14 1103617 10.3389/fimmu.2023.1103617 37006260 PMC10062481 40. Nakase H. Sato N. Mizuno N. Ikawa Y. The influence of cytokines on the complex pathology of ulcerative colitis Autoimmun. Rev. 2022 21 103017 10.1016/j.autrev.2021.103017 34902606 41. Guo X.Y. Liu X.J. Hao J.Y. Gut microbiota in ulcerative colitis: Insights on pathogenesis and treatment J. Dig. Dis. 2020 21 147 159 10.1111/1751-2980.12849 32040250 42. Wang J. Li L. Chen P. He C. Niu X. Exploration and verification a 13-gene diagnostic framework for ulcerative colitis across multiple platforms via machine learning algorithms Sci. Rep. 2024 14 15009 10.1038/s41598-024-65481-8 38951638 PMC11217275 43. UniProt: The Universal Protein Knowledgebase in 2023 Available online: https://www.uniprot.org/ (accessed on 29 June 2023) 44. Esenturk G. Konac E. Genetic and epigenetic signaling pathways and their clinical outcomes in inflammatory bowel disease Injector 2025 4 8 18 45. Hsu C.Y. Mustafa M.A. Moath Omar T. Taher S.G. Ubaid M. Gilmanova N.S. Nasrat Abdulraheem M. Saadh M.J. Athab A.H. Mirzaei R. Gut instinct: Harnessing the power of probiotics to tame pathogenic signaling pathways in ulcerative colitis Front. Med. 2024 11 1396789 10.3389/fmed.2024.1396789 PMC11422783 39323474 46. Yuan Y. Wang F. Liu X. Shuai B. Fan H. The Role of AMPK Signaling in Ulcerative Colitis Drug Des. Dev. Ther. 2023 17 3855 3875 10.2147/DDDT.S442154 PMC10759424 38170149 47. Xue J.C. Yuan S. Hou X.T. Meng H. Liu B.H. Cheng W.W. Zhao M. Li H.B. Guo X.F. Di C. Natural products modulate NLRP3 in ulcerative colitis Front. Pharmacol. 2023 14 1265825 10.3389/fphar.2023.1265825 37849728 PMC10577194 48. Ning H. Liu J. Tan J. Yi M. Lin X. The role of the Notch signalling pathway in the pathogenesis of ulcerative colitis: From the perspective of intestinal mucosal barrier Front. Med. 2023 10 1333531 10.3389/fmed.2023.1333531 38249980 PMC10796567 49. Swirkosz G. Szczygiel A. Logon K. Wrzesniewska M. Gomulka K. The Role of the Microbiome in the Pathogenesis and Treatment of Ulcerative Colitis-A Literature Review Biomedicines 2023 11 3144 10.3390/biomedicines11123144 38137365 PMC10740415 50. Hosseini Jazani N. Shahabi S. Gut microbiota, dysbiosis and immune system; A brief review J. Res. Appl. Basic Med. Sci. 2019 5 77 81 51. Nemoto H. Kataoka K. Ishikawa H. Ikata K. Arimochi H. Iwasaki T. Ohnishi Y. Kuwahara T. Yasutomo K. Reduced diversity and imbalance of fecal microbiota in patients with ulcerative colitis Dig. Dis. Sci. 2012 57 2955 2964 10.1007/s10620-012-2236-y 22623042 52. Martinez K.B. Pierre J.F. Chang E.B. The Gut Microbiota: The Gateway to Improved Metabolism Gastroenterol. Clin. N. Am. 2016 45 601 614 10.1016/j.gtc.2016.07.001 PMC5127273 27837775 53. Yang Q.H. Zhang C.N. Comparative study on the pathogenesis of Crohn’s disease and ulcerative colitis World J. Gastroenterol. 2025 31 106406 10.3748/wjg.v31.i19.106406 40497094 PMC12146918 54. Kmiec Z. Cyman M. Slebioda T.J. Cells of the innate and adaptive immunity and their interactions in inflammatory bowel disease Adv. Med. Sci. 2017 62 1 16 10.1016/j.advms.2016.09.001 28126697 55. Ho S.M. Lewis J.D. Mayer E.A. Plevy S.E. Chuang E. Rappaport S.M. Croitoru K. Korzenik J.R. Krischer J. Hyams J.S. Challenges in IBD Research: Environmental Triggers Inflamm. Bowel Dis. 2019 25 S13 S23 10.1093/ibd/izz076 31095702 PMC6787673 56. Xu L. Lochhead P. Ko Y. Claggett B. Leong R.W. Ananthakrishnan A.N. Systematic review with meta-analysis: Breastfeeding and the risk of Crohn’s disease and ulcerative colitis Aliment. Pharmacol. Ther. 2017 46 780 789 10.1111/apt.14291 28892171 PMC5688338 57. Papoutsopoulou S. Satsangi J. Campbell B.J. Probert C.S. Review article: Impact of cigarette smoking on intestinal inflammation-direct and indirect mechanisms Aliment. Pharmacol. Ther. 2020 51 1268 1285 10.1111/apt.15774 32372449 58. To N. Ford A.C. Gracie D.J. Systematic review with meta-analysis: The effect of tobacco smoking on the natural history of ulcerative colitis Aliment. Pharmacol. Ther. 2016 44 117 126 10.1111/apt.13663 27193202 59. Murgiano M. Bartocci B. Puca P. di Vincenzo F. Del Gaudio A. Papa A. Cammarota G. Gasbarrini A. Scaldaferri F. Lopetuso L.R. Gut Microbiota Modulation in IBD: From the Old Paradigm to Revolutionary Tools Int. J. Mol. Sci. 2025 26 3059 10.3390/ijms26073059 40243712 PMC11988433 60. Vardi I. Chermesh I. Werner L. Barel O. Freund T. McCourt C. Fisher Y. Pinsker M. Javasky E. Weiss B. Monogenic Inflammatory Bowel Disease: It’s Never Too Late to Make a Diagnosis Front. Immunol. 2020 11 1775 10.3389/fimmu.2020.01775 33013830 PMC7509434 61. Loddo I. Romano C. Inflammatory Bowel Disease: Genetics, Epigenetics, and Pathogenesis Front. Immunol. 2015 6 551 10.3389/fimmu.2015.00551 26579126 PMC4629465 62. Andrews A.R. Putra J. Special Considerations in Pediatric Inflammatory Bowel Disease Pathology Diagnostics 2025 15 831 10.3390/diagnostics15070831 40218181 PMC11988757 63. McGovern D.P. Kugathasan S. Cho J.H. Genetics of Inflammatory Bowel Diseases Gastroenterology 2015 149 1163 1176 10.1053/j.gastro.2015.08.001 26255561 PMC4915781 64. Cerezo M. Sollis E. Ji Y. Lewis E. Abid A. Bircan K.O. Hall P. Hayhurst J. John S. Mosaku A. NHGRI-EBI GWAS Catalog Nucleic Acids Res. 2025 53 D998 D1005 10.1093/nar/gkae1070 39530240 PMC11701593 65. Annese V. Genetics and epigenetics of IBD Pharmacol. Res. 2020 159 104892 10.1016/j.phrs.2020.104892 32464322 66. Caliendo G. D’Elia G. Makker J. Passariello L. Albanese L. Molinari A.M. Vietri M.T. Biological, genetic and epigenetic markers in ulcerative colitis Adv. Med. Sci. 2023 68 386 395 10.1016/j.advms.2023.09.010 37813048 67. Anderson C.A. Boucher G. Lees C.W. Franke A. D’Amato M. Taylor K.D. Lee J.C. Goyette P. Imielinski M. Latiano A. Meta-analysis identifies 29 additional ulcerative colitis risk loci, increasing the number of confirmed associations to 47 Nat. Genet. 2011 43 246 252 10.1038/ng.764 21297633 PMC3084597 68. Asano K. Matsushita T. Umeno J. Hosono N. Takahashi A. Kawaguchi T. Matsumoto T. Matsui T. Kakuta Y. Kinouchi Y. A genome-wide association study identifies three new susceptibility loci for ulcerative colitis in the Japanese population Nat. Genet. 2009 41 1325 1329 10.1038/ng.482 19915573 69. de Lange K.M. Moutsianas L. Lee J.C. Lamb C.A. Luo Y. Kennedy N.A. Jostins L. Rice D.L. Gutierrez-Achury J. Ji S.G. Genome-wide association study implicates immune activation of multiple integrin genes in inflammatory bowel disease Nat. Genet. 2017 49 256 261 10.1038/ng.3760 28067908 PMC5289481 70. Franke A. Balschun T. Karlsen T.H. Sventoraityte J. Nikolaus S. Mayr G. Domingues F.S. Albrecht M. Nothnagel M. Ellinghaus D. Sequence variants in IL10, ARPC2 and multiple other loci contribute to ulcerative colitis susceptibility Nat. Genet. 2008 40 1319 1323 10.1038/ng.221 18836448 71. Franke A. Balschun T. Sina C. Ellinghaus D. Hasler R. Mayr G. Albrecht M. Wittig M. Buchert E. Nikolaus S. Genome-wide association study for ulcerative colitis identifies risk loci at 7q22 and 22q13 (IL17REL) Nat. Genet. 2010 42 292 294 10.1038/ng.553 20228798 72. Garcia-Etxebarria K. Merino O. Gaite-Reguero A. Rodrigues P.M. Herrarte A. Etxart A. Ellinghaus D. Alonso-Galan H. Franke A. Marigorta U.M. Local genetic variation of inflammatory bowel disease in Basque population and its effect in risk prediction Sci. Rep. 2022 12 3386 10.1038/s41598-022-07401-2 35232999 PMC8888637 73. Haritunians T. Taylor K.D. Targan S.R. Dubinsky M. Ippoliti A. Kwon S. Guo X. Melmed G.Y. Berel D. Mengesha E. Genetic predictors of medically refractory ulcerative colitis Inflamm. Bowel Dis. 2010 16 1830 1840 10.1002/ibd.21293 20848476 PMC2959149 74. Jiang L. Zheng Z. Fang H. Yang J. A generalized linear mixed model association tool for biobank-scale data Nat. Genet. 2021 53 1616 1621 10.1038/s41588-021-00954-4 34737426 75. Jostins L. Ripke S. Weersma R.K. Duerr R.H. McGovern D.P. Hui K.Y. Lee J.C. Schumm L.P. Sharma Y. Anderson C.A. Host-microbe interactions have shaped the genetic architecture of inflammatory bowel disease Nature 2012 491 119 124 10.1038/nature11582 23128233 PMC3491803 76. Julia A. Domenech E. Chaparro M. Garcia-Sanchez V. Gomollon F. Panes J. Manosa M. Barreiro-De Acosta M. Gutierrez A. Garcia-Planella E. A genome-wide association study identifies a novel locus at 6q22.1 associated with ulcerative colitis Hum. Mol. Genet. 2014 23 6927 6934 10.1093/hmg/ddu398 25082827 77. Juyal G. Negi S. Sood A. Gupta A. Prasad P. Senapati S. Zaneveld J. Singh S. Midha V. van Sommeren S. Genome-wide association scan in north Indians reveals three novel HLA-independent risk loci for ulcerative colitis Gut 2015 64 571 579 10.1136/gutjnl-2013-306625 24837172 78. Khrom M. Li D. Naito T. Lee H.S. Botwin G.J. Potdar A.A. Boucher G. Consortium N.I.B.D.G. International Inflammatory Bowel Disease Genetics C. Yang S. Sex-Dimorphic Analyses Identify Novel and Sex-Specific Genetic Associations in Inflammatory Bowel Disease Inflamm. Bowel Dis. 2023 29 1622 1632 10.1093/ibd/izad089 37262302 PMC10547236 79. Liu J.Z. van Sommeren S. Huang H. Ng S.C. Alberts R. Takahashi A. Ripke S. Lee J.C. Jostins L. Shah T. Association analyses identify 38 susceptibility loci for inflammatory bowel disease and highlight shared genetic risk across populations Nat. Genet. 2015 47 979 986 10.1038/ng.3359 26192919 PMC4881818 80. Liu Z. Liu R. Gao H. Jung S. Gao X. Sun R. Liu X. Kim Y. Lee H.S. Kawai Y. Genetic architecture of the inflammatory bowel diseases across East Asian and European ancestries Nat. Genet. 2023 55 796 806 10.1038/s41588-023-01384-0 37156999 PMC10290755 81. Loya H. Kalantzis G. Cooper F. Palamara P.F. A scalable variational inference approach for increased mixed-model association power Nat. Genet. 2025 57 461 468 10.1038/s41588-024-02044-7 39789286 PMC11821521 82. Luo Y. de Lange K.M. Jostins L. Moutsianas L. Randall J. Kennedy N.A. Lamb C.A. McCarthy S. Ahmad T. Edwards C. Exploring the genetic architecture of inflammatory bowel disease by whole-genome sequencing identifies association at ADCY7 Nat. Genet. 2017 49 186 192 10.1038/ng.3761 28067910 PMC5289625 83. McGovern D.P. Gardet A. Torkvist L. Goyette P. Essers J. Taylor K.D. Neale B.M. Ong R.T. Lagace C. Li C. Genome-wide association identifies multiple ulcerative colitis susceptibility loci Nat. Genet. 2010 42 332 337 10.1038/ng.549 20228799 PMC3087600 84. Ostrowski J. Paziewska A. Lazowska I. Ambrozkiewicz F. Goryca K. Kulecka M. Rawa T. Karczmarski J. Dabrowska M. Zeber-Lubecka N. Genetic architecture differences between pediatric and adult-onset inflammatory bowel diseases in the Polish population Sci. Rep. 2016 6 39831 10.1038/srep39831 28008999 PMC5180213 85. Sakaue S. Kanai M. Tanigawa Y. Karjalainen J. Kurki M. Koshiba S. Narita A. Konuma T. Yamamoto K. Akiyama M. A cross-population atlas of genetic associations for 220 human phenotypes Nat. Genet. 2021 53 1415 1424 10.1038/s41588-021-00931-x 34594039 PMC12208603 86. Silverberg M.S. Cho J.H. Rioux J.D. McGovern D.P. Wu J. Annese V. Achkar J.P. Goyette P. Scott R. Xu W. Ulcerative colitis-risk loci on chromosomes 1p36 and 12q15 found by genome-wide association study Nat. Genet. 2009 41 216 220 10.1038/ng.275 19122664 PMC2652837 87. Verma A. Huffman J.E. Rodriguez A. Conery M. Liu M. Ho Y.L. Kim Y. Heise D.A. Guare L. Panickan V.A. Diversity and scale: Genetic architecture of 2068 traits in the VA Million Veteran Program Science 2024 385 eadj1182 10.1126/science.adj1182 39024449 88. Yang S.K. Hong M. Zhao W. Jung Y. Tayebi N. Ye B.D. Kim K.J. Park S.H. Lee I. Shin H.D. Genome-wide association study of ulcerative colitis in Koreans suggests extensive overlapping of genetic susceptibility with Caucasians Inflamm. Bowel Dis. 2013 19 954 966 10.1097/MIB.0b013e3182802ab6 23511034 89. Ye B.D. Choi H. Hong M. Yun W.J. Low H.Q. Haritunians T. Kim K.J. Park S.H. Lee I. Bang S.Y. Identification of Ten Additional Susceptibility Loci for Ulcerative Colitis Through Immunochip Analysis in Koreans Inflamm. Bowel Dis. 2016 22 13 19 10.1097/MIB.0000000000000584 26398853 90. Zeng Y. Suo C. Yao S. Lu D. Larsson H. D’Onofrio B.M. Lichtenstein P. Fang F. Valdimarsdottir U.A. Song H. Genetic Associations Between Stress-Related Disorders and Autoimmune Disease Am. J. Psychiatry 2023 180 294 304 10.1176/appi.ajp.20220364 37002690 91. Consortium U.I.G. Barrett J.C. Lee J.C. Lees C.W. Prescott N.J. Anderson C.A. Phillips A. Wesley E. Parnell K. Zhang H. Genome-wide association study of ulcerative colitis identifies three new susceptibility loci, including the HNF4A region Nat. Genet. 2009 41 1330 1334 10.1038/ng.483 19915572 PMC2812019 92. Sazonovs A. Stevens C.R. Venkataraman G.R. Yuan K. Avila B. Abreu M.T. Ahmad T. Allez M. Ananthakrishnan A.N. Atzmon G. Large-scale sequencing identifies multiple genes and rare variants associated with Crohn’s disease susceptibility Nat. Genet. 2022 54 1275 1283 10.1038/s41588-022-01156-2 36038634 PMC9700438 93. Visschedijk M.C. Alberts R. Mucha S. Deelen P. de Jong D.J. Pierik M. Spekhorst L.M. Imhann F. van der Meulen-de Jong A.E. van der Woude C.J. Pooled Resequencing of 122 Ulcerative Colitis Genes in a Large Dutch Cohort Suggests Population-Specific Associations of Rare Variants in MUC2 PLoS ONE 2016 11 e0159609 10.1371/journal.pone.0159609 27490946 PMC4973970 94. Wu D. Chen D. Shi W. Liu W. Zhou W. Qian J. Whole Exome Sequencing Identifies Two Novel Mutations in a Patient with UC Associated with PSC and SSA Can. J. Gastroenterol. Hepatol. 2021 2021 9936932 10.1155/2021/9936932 34545326 PMC8449715 95. Gettler K. Levantovsky R. Moscati A. Giri M. Wu Y. Hsu N.Y. Chuang L.S. Sazonovs A. Venkateswaran S. Korie U. Common and Rare Variant Prediction and Penetrance of IBD in a Large, Multi-ethnic, Health System-based Biobank Cohort Gastroenterology 2021 160 1546 1557 10.1053/j.gastro.2020.12.034 33359885 PMC8237248 96. Onoufriadis A. Stone K. Katsiamides A. Amar A. Omar Y. de Lange K.M. Taylor K. Barrett J.C. Pollok R. Hayee B. Exome Sequencing and Genotyping Identify a Rare Variant in NLRP7 Gene Associated with Ulcerative Colitis J. Crohns Colitis 2018 12 321 326 10.1093/ecco-jcc/jjx157 29211899 PMC6290881 97. El Hadad J. Schreiner P. Vavricka S.R. Greuter T. The Genetics of Inflammatory Bowel Disease Mol. Diagn. Ther. 2024 28 27 35 10.1007/s40291-023-00678-7 37847439 PMC10787003 98. Maksic M. Corovic I. Maksic T. Zivic J. Zivic M. Zdravkovic N. Begovic A. Medovic M. Kralj D. Todorovic Z. Molecular Insight into the Role of HLA Genotypes in Immunogenicity and Secondary Refractoriness to Anti-TNF Therapy in IBD Patients Int. J. Mol. Sci. 2025 26 7274 10.3390/ijms26157274 40806407 PMC12347028 99. Nowak J.K. Glapa-Nowak A. Banaszkiewicz A. Iwanczak B. Kwiecien J. Szaflarska-Poplawska A. Grzybowska-Chlebowczyk U. Osiecki M. Kierkus J. Holubiec M. HLA-DQA1*05 Associates with Extensive Ulcerative Colitis at Diagnosis: An Observational Study in Children Genes 2021 12 1934 10.3390/genes12121934 34946883 PMC8701736 100. Okamoto D. Kawai Y. Kakuta Y. Naito T. Torisu T. Hirano A. Umeno J. Fuyuno Y. Li D. Nakano T. Genetic Analysis of Ulcerative Colitis in Japanese Individuals Using Population-specific SNP Array Inflamm. Bowel Dis. 2020 26 1177 1187 10.1093/ibd/izaa033 32072174 101. Venkateswaran S. Prince J. Cutler D.J. Marigorta U.M. Okou D.T. Prahalad S. Mack D. Boyle B. Walters T. Griffiths A. Enhanced Contribution of HLA in Pediatric Onset Ulcerative Colitis Inflamm. Bowel Dis. 2018 24 829 838 10.1093/ibd/izx084 29562276 PMC6350448 102. Quigley E.M. Epigenetics: Filling in the ‘heritability gap’ and identifying gene-environment interactions in ulcerative colitis Genome Med. 2012 4 72 10.1186/gm373 23017099 PMC3580442 103. Bernstein B.E. Meissner A. Lander E.S. The mammalian epigenome Cell 2007 128 669 681 10.1016/j.cell.2007.01.033 17320505 104. Yan L. Gu C. Gao S. Wei B. Epigenetic regulation and therapeutic strategies in ulcerative colitis Front. Genet. 2023 14 1302886 10.3389/fgene.2023.1302886 38169708 PMC10758477 105. Zeng Z. Mukherjee A. Zhang H. From Genetics to Epigenetics, Roles of Epigenetics in Inflammatory Bowel Disease Front. Genet. 2019 10 1017 10.3389/fgene.2019.01017 31737035 PMC6834788 106. Zob D.L. Augustin I. Caba L. Panzaru M.C. Popa S. Popa A.D. Florea L. Gorduza E.V. Genomics and Epigenomics in the Molecular Biology of Melanoma-A Prerequisite for Biomarkers Studies Int. J. Mol. Sci. 2022 24 716 10.3390/ijms24010716 36614156 PMC9821083 107. Leng X.Y. Yang J. Fan H. Chen Q.Y. Cheng B.J. He H.X. Gao F. Zhu F. Yu T. Liu Y.J. JMJD3/H3K27me3 epigenetic modification regulates Th17/Treg cell differentiation in ulcerative colitis Int. Immunopharmacol. 2022 110 109000 10.1016/j.intimp.2022.109000 35777266 108. Moein S. Vaghari-Tabari M. Qujeq D. Majidinia M. Nabavi S.M. Yousefi B. MiRNAs and inflammatory bowel disease: An interesting new story J. Cell. Physiol. 2019 234 3277 3293 10.1002/jcp.27173 30417350 109. Sharma S. Xiao L. Wang J.Y. HuR and Its Interactions with Noncoding RNAs in Gut Epithelium Homeostasis and Diseases Front. Biosci. (Landmark Ed.) 2023 28 262 10.31083/j.fbl2810262 37919092 110. Sibia C.F. Quaglio A.E.V. Oliveira E.C.S. Pereira J.N. Ariede J.R. Lapa R.M.L. Severino F.E. Reis P.P. Sassaki L.Y. Saad-Hossne R. microRNA-mRNA Networks Linked to Inflammation and Immune System Regulation in Inflammatory Bowel Disease Biomedicines 2024 12 422 10.3390/biomedicines12020422 38398024 PMC10886709 111. Ma L. Hou C. Yang H. Chen Q. Lyu W. Wang Z. Wang J. Xiao Y. Multi-omics analysis reveals the interaction of gut microbiome and host microRNAs in ulcerative colitis Ann. Med. 2023 55 2261477 10.1080/07853890.2023.2261477 37774039 PMC10543339 112. Soroosh A. Rankin C.R. Polytarchou C. Lokhandwala Z.A. Patel A. Chang L. Pothoulakis C. Iliopoulos D. Padua D.M. miR-24 Is Elevated in Ulcerative Colitis Patients and Regulates Intestinal Epithelial Barrier Function Am. J. Pathol. 2019 189 1763 1774 10.1016/j.ajpath.2019.05.018 31220450 PMC6723227 113. Liu S. Zhang S. Lv X. Lu J. Ren C. Zeng Z. Zheng L. Zhou X. Fu H. Zhou D. Limonin ameliorates ulcerative colitis by regulating STAT3/miR-214 signaling pathway Int. Immunopharmacol. 2019 75 105768 10.1016/j.intimp.2019.105768 31382166 114. Ray M.K. Fenton C.G. Paulssen R.H. Novel long non-coding RNAs of relevance for ulcerative colitis pathogenesis Noncoding RNA Res. 2022 7 40 47 10.1016/j.ncrna.2022.02.001 35224318 PMC8844606 115. Hu Y. Lu Y. Fang Y. Zhang Q. Zheng Z. Zheng X. Ye X. Chen Y. Ding J. Yang J. Role of long non-coding RNA in inflammatory bowel disease Front. Immunol. 2024 15 1406538 10.3389/fimmu.2024.1406538 38895124 PMC11183289 116. Wu W. Li X. Zhou Z. He H. Pang C. Ye S. Quan J.H. METTL14 regulates inflammation in ulcerative colitis via the lncRNA DHRS4-AS1/miR-206/A3AR axis Cell Biol. Toxicol. 2024 40 95 10.1007/s10565-024-09944-8 39528760 PMC11554827 117. Bek S. Nielsen J.V. Bojesen A.B. Franke A. Bank S. Vogel U. Andersen V. Systematic review: Genetic biomarkers associated with anti-TNF treatment response in inflammatory bowel diseases Aliment. Pharmacol. Ther. 2016 44 554 567 10.1111/apt.13736 27417569 PMC5113857 118. Prieto-Perez R. Almoguera B. Cabaleiro T. Hakonarson H. Abad-Santos F. Association between Genetic Polymorphisms and Response to Anti-TNFs in Patients with Inflammatory Bowel Disease Int. J. Mol. Sci. 2016 17 225 10.3390/ijms17020225 26861312 PMC4783957 119. Salvador-Martin S. Pujol-Muncunill G. Bossacoma F. Navas-Lopez V.M. Gallego-Fernandez C. Segarra O. Clemente S. Munoz-Codoceo R. Viada J. Magallares L. Pharmacogenetics of trough serum anti-TNF levels in paediatric inflammatory bowel disease Br. J. Clin. Pharmacol. 2021 87 447 457 10.1111/bcp.14400 32478906 120. Eltantawy N. El-Zayyadi I.A.E. Elberry A.A. Salah L.M. Abdelrahim M.E.A. Kassem A.B. A review article of inflammatory bowel disease treatment and pharmacogenomics Beni-Suef Univ. J. Basic. Appl. Sci. 2023 12 35 10.1186/s43088-023-00361-0 121. Grover N. Bhatia P. Kumar A. Singh M. Lad D. Mandavdhare H.S. Samanta J. Prasad K.K. Dutta U. Sharma V. TPMT and NUDT15 polymorphisms in thiopurine induced leucopenia in inflammatory bowel disease: A prospective study from India BMC Gastroenterol. 2021 21 327 10.1186/s12876-021-01900-8 34425754 PMC8383411 122. Qu Y.T. Ding J.Y. Pan W. Liu F.R. Dong A.L. Perspectives in clinical research on Azathioprine for steroid-dependent ulcerative colitis Front. Med. 2025 12 1551906 10.3389/fmed.2025.1551906 PMC11975918 40201324 Figure 1 Pathophysiology in UC (Created in BioRender. Caba, L. (2025) https://BioRender.com/c7fmror genes-16-01085-t001_Table 1 Table 1 HLA variants and risk allele associated with UC identified by GWAS [ 64 Variant and Risk Allele (rs) p OR CI Gene References rs9271209-? 2 × 10 −85 - - HLA-DRB1 HLA-DQA1 [ 79 rs76901167-? 2 × 10 −94 - - HLA-DRB1 HLA-DQA1 rs113653754-C 1 × 10 −86 1.3593605 - HLA-DQA1 HLA-DQB1 rs9268877-? 4 × 10 −23 - -  HLA-DRB9 [ 91 rs9271366-G 1 × 10 −18 2.1 [1.78–2.48] HLA-DRB1 HLA-DQA1 [ 88 rs9268853-T 1 × 10 −55 1.4 [1.34–1.47]  HLA-DRB9 [ 67 rs2395185-G 5 × 10 −22 1.92 [1.68–2.19]  HLA-DRB9 [ 68 rs9268923-C 4 × 10 −15 1.45 [1.33–1.59]  HLA-DRB9 [ 71 rs2395185-? 1 × 10 −16 1.52 -  HLA-DRB9 [ 86 rs6927022-A 5 × 10 −133 1.444 [1.387–1.503]  HLA-DQA1 [ 75 rs2395185-G 9 × 10 −23 1.49 [NR]  HLA-DRB9 [ 83 rs9268877-T 6 × 10 −18 1.45 [1.33–1.58]  HLA-DRB9 [ 70 rs6927022-? 5 × 10 −65 - -  HLA-DQA1 [ 69 rs117506082-G 4 × 10 −88 3.39 [2.99–3.83] HCG27 HLA-C [ 100 rs2239805-C 1 × 10 −10 0.839 [0.796–0.885]  HLA-DRA [ 78 rs2239805-C 7 × 10 −9 0.895 [0.862–0.929]  HLA-DRA rs9274238-A 6 × 10 −14 - [0.23–0.38]  HLA-DQB1 [ 81 rs147732109-A 2 × 10 −16 - [0.96–1.56] HLA-DRB6 HLA-DRB1 [ 85 rs9271511-? 1 × 10 −158 - [0.32–0.37] HLA-DRB1 HLA-DQA1 [ 80 HLA-DRB1*0103-? 2 × 10 −13 6.9418 [6.43–7.46]  - [ 101 HLA-DRB1*1301-? 7 × 10 −8 2.1073 [1.84–2.38]  - genes-16-01085-t002_Table 2 Table 2 Polymorphisms and their therapy implications [ 98 118 119 120 121 122 Variant and Risk Allele (rs) Gene Therapy Observations References rs10889677  IL23R positive response to infliximab [ 118 rs11209032 rs1004819-AA rs2201841-GC rs1495965-CC rs1343151-AA  IL23R decreased response to infliximab rs7517847-GC rs11465804-CC rs10489629-CC rs5030728-A  TLR4 positive response to infliximab [ 119 rs11465996  LY96 subtherapeutic infliximab levels rs5030728-GG  TLR4 subtherapeutic infliximab levels rs3397-T  TNFRSF1B non-response to infliximab rs2569190-A  CD14 lack of response to infliximab and adalimumab HLA-DRB10103  HLA-DRB1 immunogenicity to infliximab [ 98 HLA-DQA105  HLA-DQA1 increased anti-drug antibody formation   NUDT15 azathioprine-induced leukopenia [ 120 121 122 ",
  "metadata": {
    "Title of this paper": "Perspectives in clinical research on Azathioprine for steroid-dependent ulcerative colitis",
    "Journal it was published in:": "Genes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470167/"
  }
}