{
  "title": "Paper_945",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470823 PMC12470823.1 12470823 12470823 41009664 10.3390/ijms26189107 ijms-26-09107 1 Article Untargeted Plasma Metabolomics Extends the Biomarker Profile of Mitochondrial Neurogastrointestinal Encephalomyopathy https://orcid.org/0000-0001-6306-080X Bax Bridget E. 1 * https://orcid.org/0000-0001-9574-7841 Uçar Sema Kalkan 2 Imperlini Esther Academic Editor 1 2 sema.kalkan.ucar@ege.edu.tr * bebax@sgul.ac.uk bebax@citystgeorges.ac.uk 18 9 2025 9 2025 26 18 497349 9107 29 7 2025 09 9 2025 17 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Mitochondrial neurogastrointestinal encephalomyopathy (MNGIE) is caused by pathogenic mutations in the nuclear TYMP MNGIE mitochondrial neurogastrointestinal encephalomyopathy metabolomics TYMP untargeted metabolomic profiling biomarkers Lily Foundation LILY-2017.18 Purine Patients Metabolic Association Bax_2023 This research was funded by the Lily Foundation, reference LILY-2017.18 and the Purine Patients Metabolic Association, reference Bax_2023. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Mitochondrial neurogastrointestinal encephalomyopathy (MNGIE) is a progressive and fatal autosomal recessive disorder caused by pathological mutations in the nuclear TYMP 1 2 3 4 5 Clinically, MNGIE is characterised by progressive gastrointestinal dysmotility, cachexia, ptosis, progressive external ophthalmoplegia, sensorimotor peripheral neuropathy and leukoencephalopathy [ 6 7 6 8 9 10 11 12 13 14 15 This study presents the first untargeted metabolomic profiling study of this scale to determine whether patients with MNGIE exhibit a distinct plasma metabolic profile compared to age- and sex-matched healthy controls. Our analysis revealed that the MNGIE patient group exhibited increased activation of the arachidonic acid metabolism pathway and bile synthesis, and identified 23 individual metabolites having potential diagnostic value. 2. Results 2.1. Study Participants Each study group recruited 15 participants, matched for sex (10 females and 5 males) and age (16–42 years), with mean ages of 25.7 and 25.5 years for MNGIE patients and healthy controls, respectively. Patients met the recruitment criteria by harbouring pathogenic mutations in the TYMP 2.2. Quality Control of UHPLC-MS Analysis Quality Control (QC) samples were inserted with every ten samples of the analytical batch to evaluate the reproducibility and stability of the analytical system. The quality of metabolite extraction and UHPLC–MS analysis was assessed by base peak chromatogram (BPC) overlay of QC samples, Principal component analysis (PCA) of all samples and coefficient of variations (CVs) of features (retention time and m/z) in QC samples and internal standards. The BPCs of QC samples in the positive and negative modes demonstrated good overlap, with little fluctuation of retention time and peak response intensity, indicating excellent instrument stability and data quality ( Figure 1 PCA on the quantitative values of all samples in the overall dataset including the QC samples, showed a good separation of the healthy control and disease samples and a high overlap of the QC samples. The separation from the healthy control and disease samples highlights differences due to biological factors, and not technical variability. The latter validated the stability and reproducibility of the UHPLC-MS analysis process ( Figure 2 Figure 2 2.3. Metabolite Identification and Classification Plasma metabolites were annotated with five confidence levels based on information available for identification, including MS1 molecular weight, MS2 fragment spectra, column retention time and whether there are reference standards. The metabolite identification credibility evaluation criteria employed was: level 1: identified results were from standard libraries with the matching of MS1, MS2 spectra and retention time; level 2: structural formula matches the standard database; level 3: structural formula partly matches the standard database, but needs further verification; level 4: identified results were from database libraries, and only MS1 molecular weight can match the theoretical values; and level 5: no match or no identification results for the metabolite in the database. The 7774 ions that were identified following data preprocessing had the following credibility levels: 60 (level 1), 262 (level 2), 136 (level 3), 1853 (level 4) and 5463 (level 5), resulting in 2311 metabolites with identification information. Of these 2311 metabolites, 1348 were found in the BGI metabolome, Chemspider and mzCloud databases with corresponding compound information. The Kyoto Encyclopedia of Genes and Genomes (KEGG) database and Human Metabolome Database (HMDB) annotated these metabolites into 37 different classes as shown in Figure 3 2.4. Multivariate Analysis of Identified Metabolites The PCA model used to perform an unsupervised multivariate analysis of the healthy controls and patient groups of plasma samples shows a clear separation between the healthy control and patient plasma samples, with the combined PCA components 1 and 2 accounting for 41.02% of the variance ( Figure 4 1 X 1 Y Figure 4 The OPLS-DA score plot shows that the healthy control and MNGIE disease groups were clearly separated from each other by the first predictive component T score [ 1 Figure 5 2 Y 2 2 2 Y 2 2 2 2 2 Y 2 2 2.5. Differential Metabolite Identification To identify plasma metabolites that have the highest discriminative power between the healthy and control groups, the multivariate analysis model for VIP was combined with univariate analyses. Using the criteria of fold-change  ≥ 1.2 or ≤0.83 (selected on the basis that when log 2 q Figure 6 2 q q The metabolite datasets were further filtered to remove exogenous compounds, including drugs, drug metabolites, and environmental exposures. In total, 160 upregulated metabolites remained, consisting of 7, 39, 12 and 102 metabolites, respectively, at credibility levels 1, 2, 3 and 4, ( Table S1 Table S1 For the downregulated dataset, 219 metabolites remained after exogenous metabolite exclusion, consisting of 4, 25, 6 and 184 metabolites at credibility levels 1, 2, 3 and 4, respectively ( Table S1 Table S1 The abundances of the differential metabolites were normalized using z-scores and then subjected to hierarchical clustering analysis. The results from this analysis showed significant differences between healthy control and MNGIE plasma samples, with samples from the same group clustering, Figure 7 2.6. Metabolic Pathway Enrichment Analysis of Differential Metabolites To contextualise the biological phenotype of MNGIE, a KEGG pathway enrichment analysis was performed on the filtered differential metabolites. Based on a p Figure 8 Table 1 Insight into the broader perturbations in the metabolite levels within the 20 pathways, was obtained by conducting a differential abundance score analysis, where the score captures the overall changes in all differential metabolites in a pathway [ 16 Table 1 2.7. Discriminative Ability of Differential Plasma Metabolites for MNGIE Disease To assess the discriminative power of the differential metabolites, ROC curves were generated and the AUC values calculated for metabolites identified based on a q Figure 9 Ten lipid metabolites at credibility level 2 could be discriminated between the healthy and control groups, with AUC values ranging between 0.80 and 0.97 ( Figure 10 Other potential biomarkers upregulated in MNGIE at credibility level 2 are shown in Figure 11 The involvement of these biomarkers in various metabolic pathways is depicted in Figure 12 3. Discussion In this study we conducted an untargeted metabolomics analysis of intravenous plasma samples to identify metabolite changes in patients with MNGIE, compared to age- and sex-matched healthy controls. The elevated levels of creatine, lactate, citrate, itaconate, trans-aconitate, and fumarate observed in this study suggest a disrupted intracellular energy state, consistent with mitochondrial dysfunction. Notably, increased plasma creatine levels have been previously reported in several mitochondrial disorders, including Mitochondrial Encephalomyopathy, Lactic Acidosis, and Stroke-like Episodes syndrome, Myoclonic Epilepsy with Ragged Red Fibers syndrome, Leber’s Hereditary Optic Neuropathy (LHON), and various mitochondrial DNA (mtDNA) depletion and deletion syndromes [ 17 18 19 20 21 22 23 24 25 26 27 The elevated levels of lactate in our patient group agree with previous findings in patients with MNGIE and are accordant with an enhanced glycolytic flux, a common feature of mitochondrial disorders where oxidative phosphorylation is compromised [ 11 13 15 28 29 13 15 30 6 28 31 32 33 8 Itaconate is derived from the decarboxylation of the tricarboxylic acid cycle intermediate, cis-aconitate, and has been widely shown to exert anti-inflammatory responses by regulating macrophage immune and metabolic activities through multiple pathways [ 34 35 36 37 Our study showed a significant dysregulation in lipid metabolism, with the upregulation of two polyunsaturated fatty acids (docosahexaenoic acid and 8,11,14-eicosatrienoic acid), 16 arachidonic acid derivatives, two docosahexaenoic acid derivatives, two 8,11,14-eicosatrienoic acid derivatives, three eicosapentaenoic acid derivatives, and three linoleic acid derivatives. An enrichment analysis revealed that arachidonic acid metabolism was the most significantly up-regulated pathway in our patient group, with elevated levels of the eicosanoids lipoxin B4, series 2 prostaglandins, series 2 thromboxanes, and derivatives of hydroperoxyl, hydroxy and epoxy eicosatrienoic acid. Eicosanoid biosynthesis in general is initiated by an activation signal, leading to the release of polyunsaturated fatty acids from membrane glycerophospholipids by cytoplasmic phospholipases. The released polyunsaturated fatty acids are further metabolised to various eicosanoids by several enzymes including cyclooxygenases, P450 cytochrome epoxygenases and lipoxygenases [ 38 39 40 41 42 43 44 An intriguing observation in our study is that patients exhibited significantly elevated levels of 2-arachidonoylglycerol compared to healthy controls. As an endocannabinoid, 2-arachidonoylglycerol activates CB1 receptors and is primarily metabolized into arachidonic acid and glycerol. Emerging evidence indicates that 2-arachidonoylglycerol plays a central role in regulating hepatic triglyceride synthesis and release. Elevated 2-arachidonoylglycerol concentrations and subsequent CB1 receptor hyperactivation have been linked to impaired glucose metabolism in skeletal muscle and increased hepatic lipid accumulation, both of which are key contributors to the development of insulin resistance and non-alcoholic fatty liver disease, and are pathologies associated with MNGIE [ 28 45 46 47 48 Pyrimidine metabolism was identified as the second most upregulated metabolic pathway in our patient cohort. As expected, the two hallmark biomarkers of MNGIE, thymidine and 2′-deoxyuridine, were markedly elevated. The products of the forward reaction catalyzed by thymidine phosphorylase, thymine and uracil, were also increased, consistent with previous reports by Vondráčková et al. and more recently by Du et al. [ 13 15 49 50 Another notably upregulated pathway identified in our study was bile acid biosynthesis, characterized by elevated levels of unconjugated bile acids, cholate, β-muricholic acid and deoxycholate. While cholate and β-muricholic acid are primary bile acids synthesized in the liver from cholesterol and secreted into the duodenum, deoxycholate is a secondary bile acid formed through microbial enzymatic conversion of cholate in the intestinal tract [ 51 52 53 54 15 55 33 56 28 57 The second most significantly downregulated pathway identified in our analysis was steroid hormone biosynthesis. Notably, several metabolites involved in this pathway also participate in other signaling cascades, including Pathways in cancer, Ovarian steroidogenesis, and Prolactin signaling, which were likewise downregulated. The down-regulation of pathways in cancer is noteworthy, particularly given that thymidine phosphorylase is upregulated across a broad spectrum of solid tumours, where its elevated expression is associated with increased tumour growth, metastasis, angiogenesis, and poor prognosis. Whether the absence of thymidine phosphorylase expression confers protection against cancer development remains to be determined. Notably, we are not aware of any reported cases of cancer in patients with MNGIE. The study by Du et al. also revealed reduced plasma levels of several steroids, including 4-methoxyestrone, 17α-hydroxypregnenolone, androsterone sulphate, and dehydroepiandrosterone sulphate [ 15 58 ROC curve analysis of the differential metabolites identified 23 candidate biomarkers with high diagnostic potential for MNGIE. Among these findings, the 11-fold increase in retinoate abundance is particularly striking. Retinoate has been widely reported to inhibit adipogenesis [ 59 60 61 TYMP 62 Several limitations of our study should be acknowledged. Influence of the exposome: Metabolic profiles are significantly shaped by the exposome, which includes factors such as diet, dietary supplements, medicinal and recreational drugs, personal care products, and occupational exposures. Although known exposome-related metabolites were excluded from our dataset, we cannot entirely rule out the possibility that these exposures influenced the observed metabolic profiles. MNGIE patients typically receive a combination of medications, including analgesics, bowel motility stimulants, anti-emetics, antibiotics, and centrally acting agents tailored to their symptoms. In contrast, healthy controls may be exposed to different confounding factors. Notably, caffeine metabolism emerged as the most significantly downregulated pathway in MNGIE patients. Caffeine is mainly absorbed by the small intestine and is metabolized via demethylation and/or hydroxylation into paraxanthine, theobromine, theophylline, and 1,3,7-trimethyluric acid, all of which were significantly reduced in our patient cohort. Patients with MNGIE exhibit severe gastrointestinal manifestations, including dysmotility, abdominal pain, nausea, dysphagia, pseudo-obstruction, and diarrhoea. These symptoms frequently lead to oral intolerance, progressive weight loss, and malnutrition. The observed differences in caffeine metabolism may reflect comparatively higher caffeine intake among healthy controls. Sample size constraints: MNGIE is an ultra-rare disorder with an estimated prevalence of fewer than 1 in 1,000,000 individuals in Europe. Since its initial description by Okamura et al. in 1979, approximately 500 cases have been reported globally [ 63 In this study, we investigated the metabolic phenotype of MNGIE using a cohort of 15 patients and 15 matched controls. While the limited sample size is a recognized constraint, we implemented several strategies to maximize statistical power and ensure data reliability: Careful recruitment of age- and sex-matched controls to minimize confounding demographic effects on the metabolome. Strict adherence to standardized protocols for sample collection, processing, and storage to reduce pre-analytical variability and ensure that observed metabolic alterations reflect disease-specific changes. Application of high-resolution mass spectrometry to enhance analytical sensitivity and selectivity. Use of pooled QC samples to monitor instrument performance and correct for technical variability. Comprehensive statistical analysis, including PCA and OPLS-DA, to reduce data dimensionality and identify meaningful metabolic patterns. Implementation of the Benjamini–Hochberg procedure to control the false discovery rate (FDR) and reduce the likelihood of type I errors. Due to the cross-sectional nature of the study and the limited number of patients, we were unable to assess the influence of disease progression on the metabolic profile. Future longitudinal studies are essential to characterize metabolomic dynamics over time and in response to therapeutic interventions. 3. Lack of targeted metabolite validation: The findings from our untargeted metabolomics analysis were not complemented by targeted metabolite quantification. Such validation will be essential to confirm the diagnostic relevance of the 23 identified biomarkers. However, the computational integration of biomarkers across multiple omics layers, such as the genome, transcriptome, proteome, and metabolome, is more likely to yield insights into underlying molecular and cellular mechanisms and may identify more effective measures of treatment outcomes than relying on a single biomarker. Indeed, integrative analysis approaches can be employed to correlate multi-omics data with disease phenotypes, treatment responses, and patient stratification. 4. Analytical scope limitations: Since no single chromatography column can separate all metabolites in a sample, we selected a C18 column for this study, as it offers relatively broad coverage for separating non-polar and moderately polar metabolites. Consequently, metabolic disturbances involving highly polar or strongly hydrophilic compounds would not have been captured. 5. Annotation challenges: Chemical entities assigned to credibility levels 3 to 5 could not be further analyzed due to current limitations in metabolite classification and annotation databases. 4. Materials and Methods 4.1. Study Participants A total of 15 patients with MNGIE and 15 age- and sex-matched healthy controls were recruited into this study. The inclusion criteria for patient eligibility were a definitive diagnosis of MNGIE due to thymidine phosphorylase deficiency based upon DNA sequencing, and/or <10% of normal thymidine phosphorylase activity in the buffy coat, and biochemical criteria. Exclusion criteria for both patients and healthy controls included participation in a controlled trial of an investigational medicinal product, receipt of blood transfusions within the past 4 months, feeding via total parenteral nutrition and a current or history of hepatitis B, hepatitis C, or human immunodeficiency virus infection. The study was approved by the NHS Research Ethics Committee (London–Surrey Borders, reference 18/LO/2173) and was conducted in accordance with the Declaration of Helsinki and Good Clinical Practice Guidelines. Written informed consent was obtained from all participants prior to blood collection. 4.2. Blood Collection Ten mL of venous blood were collected from each participant into a K2EDTA-treated BD Vacutainer tube (Beckman Dickinson, Franklin Lakes, NJ, USA) using a standard phlebotomy protocol. Blood was collected in the morning, 4–5 h postprandial and processed immediately after collection using a standardized study protocol. Briefly, blood samples were mixed by gently inverting the tubes 180° and back, 10 times and then centrifuged at 1500× g 4.3. Untargeted Metabolomic Profiling Metabolite profiling was conducted according to the workflow, presented in Figure 13 4.3.1. Metabolite Extraction Frozen plasma samples were thawed at 4 °C. Metabolites were extracted from 100 μL of each plasma sample by adding 700 μL of pre-chilled (−20 °C) quenching/extraction solvent (methanol: acetonitrile: water in a ratio of 4:2:1, v v v g g 4.3.2. UHPLC-MS Analysis Extracted metabolites were separated and detected using an UHPLC system (Waters I-Class Plus, Milford, MA, USA), interfaced with a Q Exactive high-resolution mass spectrometer (Thermo Fisher Scientific, Waltham, MA, USA). Chromatographic separation was performed on a Waters ACQUITY UPLC BEH C18 column (1.7 μm, 2.1 mm × 100 mm, Waters, Milford, MA, USA) maintained at a temperature of 45 °C. The mobile phase consisted of 0.1% formic acid (A) and acetonitrile (B) in positive mode, and 10 mM ammonium formate (A) and acetonitrile (B) in the negative mode. The gradient conditions were: 0–1 min, 2% B; 1–9 min, 2–98% B; 9–12 min, 98% B; 12–12.1 min, 98% B to 2% B; and 12.1–15 min, 2% B. The flow rate was 0.35 mL/min and the injection volume was 5 µL. The mass spectrometer (MS) was adjusted for positive/negative electrospray ionization modes as follows: 3.8/−3.2 kV spray voltage; 40 arbitrary units (arb) sheath gas flow rate; 10 arb aux gas flow rate; 350 °C aux gas heater temperature; and 320 °C capillary temperature. For MS acquisitions, the scan range was 70–1050 m z 6 5 4.3.3. Metabolite Ion Peak Extraction and Metabolite Identification The raw data collected from the mass spectrometry analysis were imported into Compound Discoverer 3.2 (Thermo Fisher Scientific, USA, https://mycompounddiscoverer.com/ Metabolites were categorized into five confidence levels based on information available for identification, including MS1 molecular weight, MS2 fragment spectra, column retention time and whether there are reference standards. The metabolite identification credibility evaluation criteria employed was: Level 1: identified results were from standard libraries with the matching of MS1, MS2 spectra and retention time; Level 2: structural formula matches the standard database; Level 3: structural formula partly matches the standard database, but needs further verification; Level 4: identified results were from database libraries, and only MS1 molecular weight can match the theoretical values; and Level 5: no match or no identification results for the metabolite in the database. 4.3.4. Data Preprocessing Files generated by Compound Discoverer 3.2 containing information on molecular weight, retention time, peak area, and identification were exported to metaX ( http://metax.genomics.cn 64 65 66 4.3.5. Data QC QC samples were injected at regular intervals throughout the analytical run to monitor the retention time (RT/min) shift and signal variations and thus evaluate the reproducibility of the LC-MS analysis process. The quality of metabolite extraction and UHPLC–MS analysis was assessed by BPC overlay of QC samples, PCA of all samples and CVs of features (retention time and m z 4.3.6. Classification and Functional Annotation of Detected Metabolites Identified metabolites were annotated by querying the HMDB and KEGG, followed by functional annotation of pathways using the KEGG pathway database to identify the primary biochemical metabolic pathways and signaling transduction pathways in which metabolites are implicated. 4.3.7. Statistical Analyses Multivariate statistical and univariate analyses were used to screen the differential metabolites between the healthy control and MNGIE patient sample groups. Prior to multivariate statistical analysis the pre-processed data were log 2 OPLS-DA, a supervised statistical method, was performed on the two groups of samples to establish a relationship model between metabolite expression and sample groups, thereby allowing for prediction of the sample categories. To evaluate the robustness of the detected OPLS-DA model, R 2 2 2 2 For univariate analysis of the data, the differences in metabolite concentration were evaluated in terms of fold change, and statistical comparison using the t p t q p q q 4.3.8. Bioinformatics Analysis For differential metabolites, with log 2 https://www.genome.jp/kegg/pathway.html p q 5. Conclusions In conclusion, this study reveals that the metabolomic profile of MNGIE is characterized by elevated levels of bile acids and arachidonic acid metabolites, alongside reduced levels of steroids, offering insight into disrupted metabolic pathways. ROC curve analysis of the differential metabolites identified 23 candidate biomarkers with high diagnostic potential for MNGIE. These findings suggest that thymidine phosphorylase deficiency leads to broader metabolic disturbances than previously recognized and supports the existence of an expanded biomarker profile for MNGIE. Acknowledgments The authors thank all study participants for providing blood samples. We thank BGI Tech Solutions Co., Ltd. for technical assistance with the mass spectrometry analysis work. Disclaimer/Publisher’s Note: Supplementary Materials The supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189107/s1 Author Contributions Conceptualization, B.E.B.; methodology, B.E.B. and S.K.U.; formal analysis, B.E.B.; investigation, B.E.B. and S.K.U.; resources, B.E.B.; data curation, B.E.B.; writing—original draft preparation, B.E.B.; writing—review and editing, S.K.U.; visualization, B.E.B.; project administration, B.E.B.; funding acquisition, B.E.B. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted according to the guidelines of the Declaration of Helsinki and approved by the NHS Research Ethics Committee (London–Surrey Borders, reference 18/LO/2173, 12 December 2018). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The raw data are available from the corresponding author on reasonable request. Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript, or in the decision to publish the results. References 1. Hirano M. Silvestri G. Blake D.M. Lombes A. Minetti C. Bonilla E. Hays A.P. Lovelace R.E. Butler I. Bertorini T.E. Mitochondrial Neurogastrointestinal Encephalomyopathy (MNGIE): Clinical, Biochemical, and Genetic Features of an Autosomal Recessive Mitochondrial Disorder Neurology 1994 44 721 727 10.1212/WNL.44.4.721 8164833 2. Nishino I. Spinazzola A. Hirano M. Thymidine Phosphorylase Gene Mutations in MNGIE, a Human Mitochondrial Disorder Science 1999 283 689 692 10.1126/science.283.5402.689 9924029 3. Nishino I. Spinazzola A. Hirano M. MNGIE: From Nuclear DNA to Mitochondrial DNA Neuromuscul. Disord. 2001 11 7 10 10.1016/S0960-8966(00)00159-0 11166160 4. Hirano M. Nishigaki Y. Martí R. Mitochondrial Neurogastrointestinal Encephalomyopathy (MNGIE): A Disease of Two Genomes Neurologist 2004 10 8 17 10.1097/01.nrl.0000106919.06469.04 14720311 5. Nishigaki Y. Martí R. Copeland W.C. Hirano M. Site-Specific Somatic Mitochondrial DNA Point Mutations in Patients with Thymidine Phosphorylase Deficiency J. Clin. Investig. 2003 111 1913 1921 10.1172/jci200317828 12813027 PMC161426 6. Garone C. Tadesse S. Hirano M. Clinical and Genetic Spectrum of Mitochondrial Neurogastrointestinal Encephalomyopathy Brain 2011 134 3326 3332 10.1093/brain/awr245 21933806 PMC3212717 7. Pacitti D. Levene M. Garone C. Nirmalananthan N. Bax B.E. Mitochondrial Neurogastrointestinal Encephalomyopathy: Into the Fourth Decade, What We Have Learned So Far Front. Genet. 2018 9 669 10.3389/fgene.2018.00669 30627136 PMC6309918 8. Hirano M. Mitochondrial Neurogastrointestinal Encephalopathy Disease GeneReviews ® University of Washington Seattle, WA, USA 1993 20301358 9. Debouverie M. Wagner M. Ducrocq X. Grignon Y. Mousson B. Weber M. MNGIE Syndrome in 2 Siblings Rev. Neurol. 1997 153 547 553 9684018 10. Barış Z. Eminoğlu T. Dalgıç B. Tümer L. Hasanoğlu A. Mitochondrial Neurogastrointestinal Encephalomyopathy (MNGIE): Case Report with a New Mutation Eur. J. Pediatr. 2010 169 1375 1378 10.1007/s00431-010-1237-0 20585803 11. Cardaioli E. Da Pozzo P. Malfatti E. Battisti C. Gallus G.N. Gaudiano C. MacUcci M. Malandrini A. Margollicci M. Rubegni A. A Second MNGIE Patient without Typical Mitochondrial Skeletal Muscle Involvement Neurol. Sci. 2010 31 491 494 10.1007/s10072-010-0225-5 20232099 12. Bakker J.A. Schlesser P. Smeets H.J.M. Francois B. Bierau J. Biochemical Abnormalities in a Patient with Thymidine Phosphorylase Deficiency with Fatal Outcome J. Inherit. Metab. Dis. 2010 33 139 143 10.1007/s10545-010-9049-y PMC3757267 20151198 13. Vondráčková A. Veselá K. Kratochvílová H. Kučerová Vidrová V. Vinšová K. Stránecký V. Honzík T. Hansíková H. Zeman J. Tesařová M. Large Copy Number Variations in Combination with Point Mutations in the TYMP and SCO2 Genes Found in Two Patients with Mitochondrial Disorders Eur. J. Human. Genet. 2014 22 431 434 10.1038/ejhg.2013.148 23838601 PMC3925276 14. Peedikayil M.C. Kagevi E.I. Abufarhaneh E. Alsayed M.D. Alzahrani H.A. Mitochondrial Neurogastrointestinal Encephalomyopathy Treated with Stem Cell Transplantation: A Case Report and Review of Literature Hematol./Oncol. Stem Cell Ther. 2015 8 85 90 10.1016/j.hemonc.2014.12.001 25585305 15. Du J. Zhang C. Liu F. Liu X. Wang D. Zhao D. Shui G. Zhao Y. Yan C. Distinctive Metabolic Remodeling in TYMP Deficiency beyond Mitochondrial Dysfunction J. Mol. Med. 2023 101 1237 1253 10.1007/s00109-023-02358-9 37603049 16. Hakimi A.A. Reznik E. Lee C.-H. Creighton C.J. Brannon A.R. Luna A. Aksoy B.A. Liu E.M. Shen R. Lee W. An Integrated Metabolic Atlas of Clear Cell Renal Cell Carcinoma Cancer Cell 2016 29 104 116 10.1016/j.ccell.2015.12.004 26766592 PMC4809063 17. Buzkova J. Nikkanen J. Ahola S. Hakonen A.H. Sevastianova K. Hovinen T. Yki-Järvinen H. Pietiläinen K.H. Lönnqvist T. Velagapudi V. Metabolomes of Mitochondrial Diseases and Inclusion Body Myositis Patients: Treatment Targets and Biomarkers EMBO Mol. Med. 2018 10 e9091 10.15252/emmm.201809091 30373890 PMC6284386 18. Sharma R. Reinstadler B. Engelstad K. Skinner O.S. Stackowitz E. Haller R.G. Clish C.B. Pierce K. Walker M.A. Fryer R. Circulating Markers of NADH-Reductive Stress Correlate with Mitochondrial Disease Severity J. Clin. Investig. 2021 131 e136055 10.1172/jci136055 33463549 PMC7810486 19. Shaham O. Slate N.G. Goldberger O. Xu Q. Ramanathan A. Souza A.L. Clish C.B. Sims K.B. Mootha V.K. A Plasma Signature of Human Mitochondrial Disease Revealed through Metabolic Profiling of Spent Media from Cultured Muscle Cells Proc. Natl. Acad. Sci. USA 2010 107 1571 1575 10.1073/pnas.0906039107 20080599 PMC2824369 20. Maresca A. Del Dotto V. Romagnoli M. La Morgia C. Di Vito L. Capristo M. Valentino M.L. Carelli V. ER-MITO Study Group Expanding and Validating the Biomarkers for Mitochondrial Diseases J. Mol. Med. 2020 98 1467 1478 10.1007/s00109-020-01967-y 32851462 PMC7524861 21. Barisic N. Bernert G. Ipsiroglu O. Stromberger C. Müller T. Gruber S. Prayer D. Moser E. Bittner R.E. Stöckler-Ipsiroglu S. Effects of Oral Creatine Supplementation in a Patient with MELAS Phenotype and Associated Nephropathy Neuropediatrics 2002 33 157 161 10.1055/s-2002-33679 12200746 22. Borchert A. Wilichowski E. Hanefeld F. Supplementation with Creatine Monohydrate in Children with Mitochondrial Encephalomyopathies Muscle Nerve 1999 22 1299 1300 10.1002/(SICI)1097-4598(199909)22:9&#x0003c;1299::AID-MUS24&#x0003e;3.0.CO;2-4 10454733 23. Tarnopolsky M.A. Roy B.D. MacDonald J.R. A Randomized, Controlled Trial of Creatine Monohydrate in Patients with Mitochondrial Cytopathies Muscle Nerve 1997 20 1502 1509 10.1002/(SICI)1097-4598(199712)20:12&#x0003c;1502::AID-MUS4&#x0003e;3.0.CO;2-C 9390662 24. Komura K. Hobbiebrunken E. Wilichowski E.K.G. Hanefeld F.A. Effectiveness of Creatine Monohydrate in Mitochondrial Encephalomyopathies Pediatr. Neurol. 2003 28 53 58 10.1016/S0887-8994(02)00469-1 12657421 25. Klopstock T. Querner V. Schmidt F. Gekeler F. Walter M. Hartard M. Henning M. Gasser T. Pongratz D. Straube A. A Placebo-Controlled Crossover Trial of Creatine in Mitochondrial Diseases Neurology 2000 55 1748 1751 10.1212/WNL.55.11.1748 11113239 26. Kornblum C. Schröder R. Müller K. Vorgerd M. Eggers J. Bogdanow M. Papassotiropoulos A. Fabian K. Klockgether T. Zange J. Creatine Has No Beneficial Effect on Skeletal Muscle Energy Metabolism in Patients with Single Mitochondrial DNA Deletions: A Placebo-Controlled, Double-Blind 31P-MRS Crossover Study Eur. J. Neurol. 2005 12 300 309 10.1111/j.1468-1331.2004.00970.x 15804248 27. Farr C.V. Xiao Y. El-Kasaby A. Schupp M. Hotka M. di Mauro G. Clarke A. Pastor Fernandez M. Sandtner W. Stockner T. Probing the Chemical Space of Guanidino-Carboxylic Acids to Identify the First Blockers of the Creatine-Transporter-1 Mol. Pharmacol. 2024 106 319 333 10.1124/molpharm.124.000995 39322412 28. Hirano M. Carelli V. De Giorgio R. Pironi L. Accarino A. Cenacchi G. D’Alessandro R. Filosto M. Martí R. Nonino F. Mitochondrial Neurogastrointestinal Encephalomyopathy (MNGIE): Position Paper on Diagnosis, Prognosis, and Treatment by the MNGIE International Network J. Inherit. Metab. Dis. 2021 44 376 387 10.1002/jimd.12300 32898308 PMC8399867 29. Patel J. Agasti A. Vashishtha C. Samarth A. Goyal R. Oak P.J. Sawant P. An Interesting Case of Intestinal Pseudo-Obstruction: MNGIE Trop. Gastroenterol. 2011 32 138 141 10.4103/TROG_20113202_138 21922881 30. Li Y. Chvatal-Medina M. Trillos-Almanza M.C. Bourgonje A.R. Connelly M.A. Moshage H. Bakker S.J.L. de Meijer V.E. Blokzijl H. Dullaart R.P.F. Circulating Citrate Is Reversibly Elevated in Patients with End-Stage Liver Disease: Association with All-Cause Mortality Int. J. Mol. Sci. 2024 25 12806 10.3390/ijms252312806 39684514 PMC11641540 31. Tong W. Hannou S.A. Wang Y. Astapova I. Sargsyan A. Monn R. Thiriveedi V. Li D. McCann J.R. Rawls J.F. The Intestine Is a Major Contributor to Circulating Succinate in Mice FASEB J. 2022 36 e22546 10.1096/fj.202200135RR 36106538 PMC9523828 32. Duong N. Bajaj J.S. The Impact of the Gut Microbiome on Liver Transplantation Curr. Opin. Organ. Transplant. 2021 26 587 594 10.1097/MOT.0000000000000930 34636770 PMC8562890 33. Chen Y. Yang F. Lu H. Wang B. Chen Y. Lei D. Wang Y. Zhu B. Li L. Characterization of Fecal Microbial Communities in Patients with Liver Cirrhosis Hepatology 2011 54 562 572 10.1002/hep.24423 21574172 34. Peace C.G. O’Neill L.A. The Role of Itaconate in Host Defense and Inflammation J. Clin. Investig. 2022 132 e148548 10.1172/JCI148548 35040439 PMC8759771 35. Yang W. Wang Y. Tao K. Li R. Metabolite Itaconate in Host Immunoregulation and Defense Cell Mol. Biol. Lett. 2023 28 100 10.1186/s11658-023-00503-3 38042791 PMC10693715 36. Coelho C. Itaconate or How I Learned to Stop Avoiding the Study of Immunometabolism PLoS Pathog. 2022 18 e1010361 10.1371/journal.ppat.1010361 35325008 PMC8946723 37. Weiss J.M. Palmieri E.M. Gonzalez-Cotto M. Bettencourt I.A. Megill E.L. Snyder N.W. McVicar D.W. Itaconic Acid Underpins Hepatocyte Lipid Metabolism in Non-Alcoholic Fatty Liver Disease in Male Mice Nat. Metab. 2023 5 981 995 10.1038/s42255-023-00801-2 37308721 PMC10290955 38. Yamaguchi A. Botta E. Holinstat M. Eicosanoids in Inflammation in the Blood and the Vessel Front. Pharmacol. 2022 13 997403 10.3389/fphar.2022.997403 36238558 PMC9551235 39. Artru F. McPhail M.J.W. Triantafyllou E. Trovato F.M. Lipids in Liver Failure Syndromes: A Focus on Eicosanoids, Specialized Pro-Resolving Lipid Mediators and Lysophospholipids Front. Immunol. 2022 13 867261 10.3389/fimmu.2022.867261 35432367 PMC9008479 40. Wang J. Chen W. Wang F. Wu D. Qian J. Kang J. Li H. Ma E. Nutrition Therapy for Mitochondrial Neurogastrointestinal Encephalopathy with Homozygous Mutation of the TYMP Gene Clin. Nutr. Res. 2015 4 132 136 10.7762/cnr.2015.4.2.132 25954734 PMC4418417 41. Barisic A. Ljubas Kelecic D. Vranesic Bender D. Karas I. Brinar M. Miletic V. Krznaric Z. Case Report: A Patient with Mitochondrial Neurogastrointestinal Encephalomyopathy and Chronic Intestinal Failure Front. Nutr. 2022 9 983873 10.3389/fnut.2022.983873 36419558 PMC9676446 42. Kasti A. Nikolaki M. Pyrousis I. Synodinou K. Oikonomopoulos N. Triantafyllou K. Intensive Nutrition Support May Benefit Patients with a Rare Mitochondrial Disorder Nutr. Clin. Pract. 2022 37 361 365 10.1002/ncp.10726 34170051 43. Kartal T. Uzunoğlu S. Kaplan I. Bulut F.D. Derya K. Mungan N. Nutritional Management in MNGIE Disease: A Case Report Clin. Sci. Nutr. 2025 7 63 67 10.62210/ClinSciNutr.2025.104 44. Al-Shaer A.E. Buddenbaum N. Shaikh S.R. Polyunsaturated Fatty Acids, Specialized pro-Resolving Mediators, and Targeting Inflammation Resolution in the Age of Precision Nutrition Biochim. Biophys. Acta Mol. Cell Biol. Lipids 2021 1866 158936 10.1016/j.bbalip.2021.158936 33794384 PMC8496879 45. Borowska M. Czarnywojtek A. Sawicka-Gutaj N. Woliński K. Płazińska M.T. Mikołajczak P. Ruchała M. The Effects of Cannabinoids on the Endocrine System Endokrynol. Pol. 2018 69 705 719 10.5603/EP.a2018.0072 30618031 46. Westerbacka J. Kotronen A. Fielding B.A. Wahren J. Hodson L. Perttilä J. Seppänen-Laakso T. Suortti T. Arola J. Hultcrantz R. Splanchnic Balance of Free Fatty Acids, Endocannabinoids, and Lipids in Subjects with Nonalcoholic Fatty Liver Disease Gastroenterology 2010 139 1961 1971.e1 10.1053/j.gastro.2010.06.064 20600015 47. Kripps K. Nakayuenyongsuk W. Shayota B.J. Berquist W. Gomez-Ospina N. Esquivel C.O. Concepcion W. Sampson J.B. Cristin D.J. Jackson W.E. Successful Liver Transplantation in Mitochondrial Neurogastrointestinal Encephalomyopathy (MNGIE) Mol. Genet. Metab. 2020 130 58 64 10.1016/j.ymgme.2020.03.001 32173240 PMC8399858 48. Bax B.E. Mitochondrial Neurogastrointestinal Encephalomyopathy: Approaches to Diagnosis and Treatment J. Transl. Genet. Genom. 2020 4 1 16 10.20517/jtgg.2020.08 32914088 PMC7116056 49. Tuchman M. Ramnaraine M.L. O’Dea R.F. Effects of Uridine and Thymidine on the Degradation of 5-Fluorouracil, Uracil, and Thymine by Rat Liver Dihydropyrimidine Dehydrogenase Cancer Res. 1985 45 5553 5556 10.1203/00006450-198507000-00233 4053028 50. Henricks L.M. Jacobs B.A.W. Meulendijks D. Pluim D. van den Broek D. de Vries N. Rosing H. Beijnen J.H. Huitema A.D.R. Guchelaar H.-J. Food-Effect Study on Uracil and Dihydrouracil Plasma Levels as Marker for Dihydropyrimidine Dehydrogenase Activity in Human Volunteers Br. J. Clin. Pharmacol. 2018 84 2761 2769 10.1111/bcp.13719 30047584 PMC6256055 51. Šarenac T.M. Mikov M. Bile Acid Synthesis: From Nature to the Chemical Modification and Synthesis and Their Applications as Drugs and Nutrients Front. Pharmacol. 2018 9 939 10.3389/fphar.2018.00939 30319399 PMC6168039 52. Dumaswala R. Setchell K.D. Zimmer-Nechemias L. Iida T. Goto J. Nambara T. Identification of 3 Alpha,4 Beta,7 Alpha-Trihydroxy-5 Beta-Cholanoic Acid in Human Bile: Reflection of a New Pathway in Bile Acid Metabolism in Humans J. Lipid Res. 1989 30 847 856 10.1016/S0022-2275(20)38314-0 2794778 53. Cui Y. Xu B. Zhang X. He Y. Shao Y. Ding M. Diagnostic and Therapeutic Profiles of Serum Bile Acids in Women with Intrahepatic Cholestasis of Pregnancy-a Pseudo-Targeted Metabolomics Study Clin. Chim. Acta 2018 483 135 141 10.1016/j.cca.2018.04.035 29709452 54. Sacquet E.C. Gadelle D.P. Riottot M.J. Raibaud P.M. Absence of Transformation of Beta-Muricholic Acid by Human Microflora Implanted in the Digestive Tracts of Germfree Male Rats Appl. Environ. Microbiol. 1984 47 1167 1168 10.1128/aem.47.5.1167-1168.1984 6742831 PMC240096 55. Sagawa H. Tazuma S. Kajiyama G. Protection against Hydrophobic Bile Salt-Induced Cell Membrane Damage by Liposomes and Hydrophilic Bile Salts Am. J. Physiol. 1993 264 G835 G839 10.1152/ajpgi.1993.264.5.G835 8498510 56. Masclee A. Tangerman A. van Schaik A. van der Hoek E.W. van Tongeren J.H. Unconjugated Serum Bile Acids as a Marker of Small Intestinal Bacterial Overgrowth Eur. J. Clin. Investig. 1989 19 384 389 10.1111/j.1365-2362.1989.tb00246.x 2506055 57. Smirnova E. Muthiah M.D. Narayan N. Siddiqui M.S. Puri P. Luketic V.A. Contos M.J. Idowu M. Chuang J.-C. Billin A.N. Metabolic Reprogramming of the Intestinal Microbiome with Functional Bile Acid Changes Underlie the Development of NAFLD Hepatology 2022 76 1811 1824 10.1002/hep.32568 35561146 PMC9653520 58. Midzak A.S. Chen H. Aon M.A. Papadopoulos V. Zirkin B.R. ATP Synthesis, Mitochondrial Function, and Steroid Biosynthesis in Rodent Primary and Tumor Leydig Cells Biol. Reprod. 2011 84 976 985 10.1095/biolreprod.110.087460 21228212 PMC3080423 59. Berry D.C. Noy N. All-Trans-Retinoic Acid Represses Obesity and Insulin Resistance by Activating Both Peroxisome Proliferation-Activated Receptor Beta/Delta and Retinoic Acid Receptor Mol. Cell Biol. 2009 29 3286 3296 10.1128/MCB.01742-08 19364826 PMC2698724 60. Mercader J. Ribot J. Murano I. Felipe F. Cinti S. Bonet M.L. Palou A. Remodeling of White Adipose Tissue after Retinoic Acid Administration in Mice Endocrinology 2006 147 5325 5332 10.1210/en.2006-0760 16840543 61. Takeda K. Sriram S. Chan X.H.D. Ong W.K. Yeo C.R. Tan B. Lee S.-A. Kong K.V. Hoon S. Jiang H. Retinoic Acid Mediates Visceral-Specific Adipogenic Defects of Human Adipose-Derived Stem Cells Diabetes 2016 65 1164 1178 10.2337/db15-1315 26936961 PMC5384626 62. Gautheron J. Lima L. Akinci B. Zammouri J. Auclair M. Ucar S.K. Ozen S. Altay C. Bax B.E. Nemazanyy I. Loss of Thymidine Phosphorylase Activity Disrupts Adipocyte Differentiation and Induces Insulin-Resistant Lipoatrophic Diabetes BMC Med. 2022 20 95 10.1186/s12916-022-02296-2 35341481 PMC8958798 63. Okamura K. Santa T. Nagae K. Omae T. Congenital Oculoskeletal Myopathy with Abnormal Muscle and Liver Mitochondria J. Neurol. Sci. 1976 27 79 91 10.1016/0022-510X(76)90236-7 175134 64. Wen B. Mei Z. Zeng C. Liu S. MetaX: A Flexible and Comprehensive Software for Processing Metabolomics Data BMC Bioinformatics 2017 18 183 10.1186/s12859-017-1579-y 28327092 PMC5361702 65. Di Guida R. Engel J. Allwood J.W. Weber R.J.M. Jones M.R. Sommer U. Viant M.R. Dunn W.B. Non-Targeted UHPLC-MS Metabolomic Data Processing Methods: A Comparative Investigation of Normalisation, Missing Value Imputation, Transformation and Scaling Metabolomics 2016 12 93 10.1007/s11306-016-1030-9 27123000 PMC4831991 66. Dunn W.B. Broadhurst D. Begley P. Zelena E. Francis-McIntyre S. Anderson N. Brown M. Knowles J.D. Halsall A. Haselden J.N. Procedures for Large-Scale Metabolic Profiling of Serum and Plasma Using Gas Chromatography and Liquid Chromatography Coupled to Mass Spectrometry Nat. Protoc. 2011 6 1060 1083 10.1038/nprot.2011.335 21720319 Figure 1 Overlap of the base peak chromatograms of quality control samples in negative ( top figure bottom figure Figure 2 Data quality control. ( a b X X Figure 3 Bar chart of metabolites identified in combined patient and healthy control samples, annotated using the HMDB and KEGG database. Lipid metabolite identification was based on their sub class, and the remaining metabolites identified through their final class. The X Y Figure 4 PCA and OPLS-DA score plots between healthy control and MNGIE disease groups. Data were log- transformed (log 2 a b Figure 5 Permutation test of the OPLS-DA model. The X Y 2 2 2 2 2 2 2 2 2 2 Figure 6 Volcano plot of identified metabolites. Each data point represents an identified metabolite, with up-regulated, down-regulated and insignificant metabolites shown as red, blue and grey points, respectively. Figure 7 Cluster analysis of the expression levels of the 379 significantly altered plasma metabolites in healthy controls versus patients with MNGIE. Data were log 2 Figure 8 Bubble diagram of the metabolic pathway enrichment analysis. The X p Figure 9 Box and whisker plots of healthy controls and patients with MNGIE for metabolites with a credibility level of 1, q Figure 10 Box and whisker plots of healthy controls and patients with MNGIE for lipid metabolites with a credibility level of 2, q Figure 11 Box and whisker plots of healthy controls and patients with MNGIE for other metabolites with a credibility level of 2, q Figure 12 Schematic overview of pathways in which putative plasma biomarkers (labelled in red) were elevated in patients with MNGIE compared to healthy controls. Biomarkers were identified based on q Figure 13 Plasma metabolomics profiling workflow. ijms-26-09107-t001_Table 1 Table 1 Differential abundance score analysis and pathway regulation status following KEGG pathway enrichment of differential metabolites. KEGG Pathway p KEGG Names KEGG Identification Differential Abundance Score and Pathway Regulation Status Caffeine metabolism map 00232 2.922 × 10 −8 7-methylxanthine; 3-methylxanthine; Theobromine; Paraxanthine; Theophylline; 1-Methyluric acid; 1,3,7-trimethyluric acid C16353 C16357 C07480 C13747 C07130 C16359 C16361 −1 Steroid hormone biosynthesis 4.579 × 10 −8 5α-pregnan-3,20-dione; 17α-hydroxyprogesterone; Androsterone; Androsterone glucuronide; Dehydroepiandrosterone; Aldosterone; Etiocholanolone; Estrone; 20-oxopregn-5-en-3-yl hydrogen sulfate; Tetrahydrocortisol; Androstenedione C03681 C01176 C00523 C11135 C01227 C01780 C04373 C00468 C18044 C05472 C00280 −0.8 Pathways in cancer map 05200 7.263 × 10 −6 Retinoate; Dehydroepiandrosterone (dhea); Prostaglandin e2; Fumaric acid; Androstanolone; Androstenedione C00777 C01227 C00584 C00122 C03917 C00280 0 Arachidonic acid metabolism 1.679 × 10 −4 Lipoxin b4; 11-dehydro thromboxane b2; Thromboxane b2; Prostaglandin e2; Prostaglandin a2; 20-hydroxy-(5z,8z,11z,14z)-eicosatetraenoic acid; 15-keto prostaglandin f2α, 11,12-DHET, 15-(S)HPETE, 11,12-EET C06315 C05964 C05963 C00584 C05953 C14748 C05960 C14774 C05966 C14770 0.8 Ovarian steroidogenesis 4.820 × 10 −4 17α-hydroxyprogesterone; Dehydroepiandrosterone (dhea); Estrone; Androstenedione, 11,12-EET C01176 C01227 C00468 C00280 C14770 −1 Pyrimidine metabolism map 00240 5.228 × 10 −4 L-glutamine; 5,6-dihydrouracil; Uracil; 2′-deoxyuridine; Thymine; Thymidine C00064 C00429 C00106 C00526 C00178 C00214 0.7 Prostate cancer map 05215 5.652 × 10 −4 Dehydroepiandrosterone (dhea); Androstanolone; Androstenedione C01227 C03917 C00280 −1 Alanine, aspartate and glutamate metabolism map 00250 8.844 × 10 −4 Citrate; L-glutamine; Fumaric acid; 2-keto-glutaramic acid C00158 C00064 C00122 C00940 0 Serotonergic synapse map 04726 4.076 × 10 −3 11-dehydro thromboxane b2; Thromboxane b2; Prostaglandin e2; Prostaglandin a2, 11,12-EET C05964 C05963 C00584 C05953 C14770 1 Prolactin signaling pathway map04917 0.012158 Estrone; Androstenedione C00468 C00280 −1 C-type lectin receptor signaling pathway map 04625 0.012158 Prostaglandin e2; Fucose C00584 C01019 1 Pyruvate metabolism map 00620 0.012235 Fumaric acid; S-lactoylglutathione; 2-butynedioic acid C00122 C03451 C03248 0.3 Glyoxylate and dicarboxylate metabolism map 00630 0.015951 Citrate; L-glutamine; 4-hydroxy-2-oxoglutaric acid; 3-oxalomalic acid C00158 C00064 C05946 C01990 −0.5 Bile secretion map 04976 0.017976 Cholate; Deoxycholate; Thromboxane b2; Prostaglandin e2; Bilirubin C00695 C04483 C05963 C00584 C00486 0.6 Central carbon metabolism in cancer map 05230 0.019754 Citrate; L-glutamine; Fumaric acid C00158 C00064 C00122 0.3 Oxidative phosphorylation 0.025202 Fumaric acid; Ubiquinol 10 C00122 C11378 0 Biosynthesis of unsaturated fatty acids ma p01040 0.028497 Docosahexaenoic acid; Dihomo-gamma-linolenate; Eicosapentaenoate; Nervonic acid C06429 C03242 C06428 C08323 0.8 Intestinal immune network for IgA production map 04672 0.030961 Retinoate C00777 1 alpha-Linolenic acid metabolism map00592 0.031107 13(s)-hotre; 12-oxo phytodienoic acid; 9(s)-hotre C16316 C01226 C16326 0.3 Citrate cycle (TCA cycle) 0.038311 Citrate; Fumaric acid C00158 C00122 0.5 ",
  "metadata": {
    "Title of this paper": "Procedures for Large-Scale Metabolic Profiling of Serum and Plasma Using Gas Chromatography and Liquid Chromatography Coupled to Mass Spectrometry",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470823/"
  }
}