{
  "title": "Paper_134",
  "abstract": "pmc Cell Rep Med Cell Rep Med 3954 cellrepsmed Cell Reports Medicine 2666-3791 Elsevier PMC12490234 PMC12490234.1 12490234 12490234 40914167 10.1016/j.xcrm.2025.102336 S2666-3791(25)00409-4 102336 1 Article ENPP1 inhibitor with ultralong drug-target residence time as an innate immune checkpoint blockade cancer therapy Wang Songnan 1 2 3 7 Johnson Randolph M. 4 7 Carozza Jacqueline A. 3 Fernandez Daniel 5 Scicinski Jan 4 Verity Neil A. 4 Mardjuki Rachel 3 Cao Xujun 2 3 6 Guo Yingjie 3 Papkoff Jacqueline 4 Ray Nigel 4 Li Lingyin lingyinl@stanford.edu 1 2 3 8 ∗ 1 2 3 4 5 6 ∗ lingyinl@stanford.edu 7 These authors contributed equally 8 Lead contact 16 9 2025 05 9 2025 6 9 498186 102336 5 5 2025 29 6 2025 12 8 2025 05 09 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). ENPP1 inhibitor with ultralong drug-target residence time as an innate immune checkpoint blockade cancer therapy 22 5 2025 2025.05.18.654655 bioRxiv PMC12139726 40475652 Summary Only one in five patients respond to immune checkpoint inhibitors, which primarily target adaptive immunity. Ectonucleotide pyrophosphatase/phophodiesterase 1 (ENPP1), the dominant hydrolase of 2′3′-cyclic-GMP-AMP (cGAMP) that suppresses downstream stimulator of interferon genes (STING) signaling, has emerged as a promising innate immunotherapy target. However, existing ENPP1 inhibitors have been optimized for prolonged systemic residence time rather than effective target inhibition within tumors. Here, we report the characterization of STF-1623, a highly potent ENPP1 inhibitor with an exceptionally long tumor residence time despite rapid systemic clearance, enabled by its high ENPP1 binding affinity and slow dissociation rate. We show that membrane-bound ENPP1 on tumor cells, not the abundant soluble ENPP1 in serum, drives tumor progression. Consequently, STF-1623 unleashes anti-tumor immunity to produce robust anti-tumor and anti-metastatic effects across multiple tumor models. Conceptually, this work establishes a noncovalent small-molecule inhibitor of ENPP1 with ultralong drug-target engagement as a safe and precise strategy to activate STING within tumors. Graphical abstract Highlights • STF-1623 inhibits ENPP1 with long tumor residence time but fast systemic clearance • STF-1623 activates tumor-specific STING signaling without systemic side effects • STF-1623 blocks preclinical breast, pancreatic, colon, and brain cancer progression Tumor-selective ENPP1 inhibitor is highly sought after for cancer immunotherapy to activate anti-cancer innate immunity without systemic inflammation. Wang et al. achieved this with STF-1623, which has ultralong tumor residence time but fast systemic clearance. When combined with ionizing radiation or immune checkpoint blockade, STF-1623 shows unprecedented efficacy without apparent side effects. Keywords STING agonist immunotransmitter breast cancer colorectal cancer pancreatic cancer glioblastoma pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: September 5, 2025 Introduction Despite the advancement in early detection and treatment, currently more than 18 million Americans are affected by cancer. 1 2 2 3 , 4 5 The stimulator of interferon genes (STING) pathway is a key innate immune pathway against cancer. 6 , 7 , 8 , 9 10 , 11 , 12 , 13 14 , 15 7 , 16 7 , 8 Given the importance of STING signaling in anti-cancer immunity, several cGAMP analogs have entered clinical trials, with results showing limited efficacy and a narrow therapeutic window. 17 , 18 6 , 16 , 19 20 , 21 22 16 , 23 24 25 , 26 , 27 , 28 Instead of directly activating STING, we propose to target the dominant-negative regulator of the STING pathway, Ectonucleotide pyrophosphatase/phosphodiesterase 1 (ENPP1), 29 21 30 31 32 33 21 29 , 34 , 35 35 34 34 Enpp1 26 , 36 , 37 , 38 , 39 , 40 , 41 34 42 , 43 We previously reported a potent ENPP1 inhibitor STF-1623. 44 44 Results Systemically administered STF-1623 concentrates in ENPP1-expressing tumors STF-1623 ( Figure 1 max 1/2 max 1/2 Figure 1 1/2 Figure 1 Enpp1 Figure 1 45 Enpp1 shEnpp1 shEnpp1 Figure S1 Enpp1 −/− Figure S1 Enpp1 −/− Figure S1 off −3 −1 off −3 −1 off Figure 1 Figure 1 Systemically administered STF-1623 concentrates in ENPP1-expressing tumors (A) Chemical structure of STF-1623. (B and C) Pharmacometrics of STF-1623 (50 mg/kg) administrated to mice bearing subcutaneous EMT6 tumors (B) or MC38 tumors (C). IC 95 n (D) Enpp1 p (E) Single-cycle kinetics analysis with surface plasmon resonance of the direct binding of 0.12, 0.36, 1.11, 3.33, and 10 nM to N-terminally Avi-tagged and biotinylated mouse (left) or human (right) ENPP1 immobilized on an streptavidin chip. Representative curves are plotted, n n off p See also Figure S1 Co-crystal structure reveals the molecular determinants of STF-1623’s potency and specificity toward ENPP1 The molecular determinants of STF-1623’s potency and long target engagement were unknown. Since crystallization attempts of human ENPP1 with STF-1623 yielded crystals that diffracted to low resolution, we instead created a proxy that mimics the catalytic site of ENPP1 in its paralog, ENPP3, which can readily yield high-quality crystals ( Figure S2 Figure S2 Figure S2 50 50 We then solved the 2.7 Å co-crystal structure of fxENPP1 bound to STF-1623 using X-ray crystallography ( Figures 2 S2 6WFJ Figure 2 Figure 2 2+ Figures 2 Figures 2 π π Figures 2 Figures 2 Figure 2 Co-crystal structure reveals the molecular determinants of STF-1623’s potency and specificity toward ENPP1 (A) The 2.7 Å crystal structure of STF-1623 (pink spheres) bound to human fxENPP1 (teal surface: nuclease-like domain; purple surface: phosphodiesterase domain; gray surface: somatomedin B domain). (B) Structural alignment between fxENPP1 (=ENPP3 Q244K/E275D 6WFJ (C) Expanded view of STF-1623 (pink sticks/spheres) bound in the active site of fxENPP1 (purple sticks/cartoon). Zincs are shown as dark purple spheres. Electron density maps of STF-1623 are shown as black mesh (2Fo-Fc, 0.7 root-mean-square deviation [RMSD]) and cyan mesh (Fo-Fc, 2.3 RMSD). (D) Schematic drawing of interactions formed between STF-1623 (pink) and the fxENPP1 active-site residues (black). Residues within 4 Å are shown (not including the zinc-coordinating residues). Metal coordination shown as gray dashed lines, hydrogen bonds shown as black dash lines, aromatic interactions shown as black wedged lines, and hydrophobic or polar interactions shown as spokes. (E) STF-1623 (pink sticks) interacting with fxENPP1 residues K244 and D275 (gray sticks) overlaid with apo ENPP3 (PDB: 6C01 (F) In vitro 50 WT Figure S2 50 WT Q244K E275D Q244K/E275D (G) Overlay of STF-1623 (pink) with STF-1084 (blue, PDB: 6XKD (H) Structures of STF-1623 with fxENPP1 and STF-1084 with mENPP1 (top) and modeled ligands in their non-preferred poses. Modeling was performed in Pymol by building the appropriate methoxy groups in the desired ligand pose. We used our structure to investigate interactions contributing to the specificity and potency of STF-1623. The interactions of STF-1623 with D275 and K244 are responsible for the over 1,000-fold difference in potency of STF-1623 against ENPP1 compared to ENPP3 ( Figure S2 Figure 2 50 50 Figure 2 Figure 2 44 Figure 2 Figure 2 Figure 2 Intratumoral ENPP1 membrane retention determines tumor progression In addition to being a transmembrane protein, ENPP1 is also secreted ( Figure 3 μ 44 46 Figures S3 Figure 3 Figure S3 Figure S3 K cat −1 K m μ K cat /K m 5 −1 −1 K cat −1 K m μ K cat /K m 5 −1 −1 Figure 3 Figure 3 Intratumoral ENPP1 membrane retention determines tumor progression (A) Expression of mENPP1, hENPP1, and hENPP3 in supernatant and lysate of 293T ENPP1 −/− (B) Activity of mENPP1 and hENPP1 in the supernatant and lysate assessed by [ 32 (C) Kinetics of cGAMP hydrolysis by 10 nM purified memENPP1 and secENPP1 at pH 9.0. Mean ± SEM is plotted, n n (D and E) Expression of WT ENPP1, MPD residue mutants (D), and A84 residue mutants (E) in the supernatant and lysate of 293T cGAS ENPP1 −/− (F) 4T1 ENPP1 WT-OE n A84S-OE n p (G and H) Relative cGAMP hydrolysis activity from tumor lysates (G) and sera (H) from randomly selected mice in (F) reaching experimental endpoints ( n WT-OE A84S-OE p p p p See also Figures S2 S3 Since both forms of the protein have similar activity, we needed an approach for selective perturbation. This led us to explore the mechanism of secretion. SecENPP1 is not produced from alternative splicing, 47 48 Figure S4 Figures S4 49 Figure 3 50 Figure 3 Figure S4 Figure 3 in vivo Figure S4 Next, we sought to determine how 4T1 tumors expressing different ratios of mem:secENPP1 would influence protein localization and tumor growth. We observed that 4T1 cells overexpressing an ENPP1 mutant that retains all ENPP1 on the plasma membrane (4T1 ENPP1 A84S−OE WT-OE Figure 3 A84S-OE Figure 3 WT-OE Figure 3 WT-OE Figure S4 A84S-OE Figure S4 STF-1623 boosts intratumoral cGAMP levels to suppress murine breast cancer growth and metastasis With the optimized PK properties, we next characterized the pharmacodynamics (PD) of STF-1623 in EMT6 breast tumors to understand its mechanism of action and identify serum biomarkers that predict treatment response. We found that homogenized EMT6 tumors treated systemically with STF-1623 showed a time-dependent increase in tumor cGAMP (presumably both extracellular and intracellular) levels over vehicle-treated mice, with an approximate doubling within hours and lasting for over 24 h ( Figure 4 shEnpp1 Figure 4 Figure S5 Figure 4 Ifn- Figure 4 Figure 4 STF-1623 boosts intratumoral cGAMP levels to suppress murine breast cancer growth and metastasis (A–C) cGAMP levels (A), IFN-γ levels (B), and relative Ifn-γ shEnpp1 n n shEnpp1 (D) BALB/c female mice with established subcutaneous EMT6 tumors received treatment as indicated. Mean ± SEM is plotted. (E) Percent lung metastatic burden determined by hematoxylin and eosin staining of mice in (D) on day 29 of the study. Mean ± SD is plotted, n (F) Immunohistochemistry of CD8 + n (G) BALB/c female mice with established orthotopic 4T1 tumors received treatment as indicated. Mean ± SEM of tumor volume is plotted. (H) BALB/c female mice with established orthotopic 4T1 tumors received treatment as indicated. Mice were sacrificed when exhibiting symptoms related to metastasis. The p p p p p p See also Figure S4 We proceeded to test the anti-tumor efficacy of STF-1623 as a monotherapy and in combination with anti-PD-L1 (a-PD-L1) or ionizing radiation (IR) at a optimized dose of 15 Gy ( Figure S5 p Figures 4 S5 Figures 4 S5 34 + Figures 4 S5 STF-1623 alone or in combination therapy is well tolerated as no significant weight loss was observed across groups ( Figure S5 51 , 52 51 Figure S5 53 Lastly, we tested STF-1623 in a different breast cancer model. 4T1 cancer cells express high levels of ENPP1 and exports high levels of cGAMP. 35 54 Figures 4 STF-1623 delays murine colorectal tumor growth Next, we investigated STF-1623’s efficacy in other cancer types. Given that MC38 colorectal cancer does not express ENPP1 or retain STF-1623 ( Figures 1 Figures 5 WT-OE T238A-OE Figure 5 Figure 5 WT-OE Figures 5 Figures 5 + + Figure 5 Figure 5 STF-1623 delays murine colorectal tumor growth (A) C57BL/6 female mice with established subcutaneous MC38 tumors received treatment as indicated. Mean ± SEM of tumor volume is plotted. (B) Percent weight change of mice in (A) on day 14 compared to day 1 of the study. Mean ± SD is plotted, n (C) ENPP1 activity of WT, ENPP1 WT-OE T238A-OE 32 (D) MC38 ENPP1 WT-OE T238A-OE n WT-OE n T238A-OE (E) C57BL/6 female mice with established subcutaneous MC38 ENPP1 WT-OE n (F) Percent weight change of mice in (E) on day 14 of study compared to day 1 of the study. Mean ± SD is plotted, n (G) BALB/c mice with established CT26 tumors received treatment as indicated. Mean ± SEM is plotted, n (H) Percent weight change of mice in (G) on day 13 compared to day 1 of the study. Mean ± SD is plotted, n (I) BALB/c mice with established subcutaneous CT26 tumors received 5 or 50 mg/kg of STF-1632 on days 9–11, 16–18 post inoculation ( pi pi + + + + + n p p p p STF-1623 controls Panc02 pancreatic tumors by activating anti-cancer immunity We have shown the efficacy of STF-1623 in the Panc02 mouse pancreatic tumor model, when infused continuously through an osmotic pump for 7 days. 35 + low + − − high + − + − + + + + + + Figure 6 + + + Figure 6 Figures 6 + + Figures 6 25 Figure 6 Figure 6 Figure 6 STF-1623 controls Panc02 pancreatic tumor growth by activating anti-cancer immunity (A and B) BALB/c female mice with established subcutaneous Panc02 tumors received treatment indicated. On day 12 of the study, tumors were processed for flow cytometry: the percentage of IA-IE + low + − − high + − + + + + + + + + + + + + + + + + + + + + + n n (C) BALB/c female mice with established Panc02 tumors received the treatment as indicated. Mean ± SEM of tumor volume is plotted, n (D) Percent weight change of mice in (C) on day 45 compared to day 1 of the study. Mean ± SD is plotted, n p p p p p STF-1623 crosses the blood-brain barrier and exhibits efficacy in delaying GL261 glioblastoma growth ENPP1 is a potential target in glioblastoma (GBM), as ENPP1 is highly expressed in the brain, 53 55 95 Figure 7 0-inf Figure 7 Figure 7 Figure 7 Figure 7 STF-1623 crosses the BBB and exhibits efficacy in delaying GL-261 GBM growth (A) Concentration of STF-1623 in serum, cerebrospinal fluid (CSF), and brain of mice after one dose of STF-1623 (50 or 100 mg/kg) injection. IC 95 n (B) C57BL/6 mice with established intracranial GL261 Red-Fluc tumors received the treatment as indicated. Kaplan-Meier of survival determined to death or humane endpoint is plotted, n p (C) Quantification and raw images of the total flux (p/s) of mice in (B) on day 28 of the study of groups with TMZ. Mean ± SD is plotted, n (D) Percent weight change of mice in (B) on day 11 of the study. Mean ± SD is plotted, n p p p Discussion Cancer therapeutics have long faced the challenge of tumor specificity, and therefore intolerable side effects, which often prevent the use of curative dosage. Toward this end, drugs with long τ in tumors but fast systemic clearance have been sought after to ensure efficacy and safety. This is particularly relevant in targeting ENPP1, as although it exists in abundance in the circulation, it is the tumor-associated ENPP1 that dictates tumor progression, thus constituting the active target. Efforts have been dedicated to increasing the τ of small-molecule inhibitors in cancer therapy, 56 57 off 53 53 By comparing PK and PD properties of STF-1623 between ENPP1-high and ENPP1-low tumors, we established a clear link between target expression, pathway activation, and tumor efficacy. Specifically, STF-1623 only homed to ENPP1-high tumors, where it increased cGAMP accumulation, IFN-γ production, and anti-tumor activity. IFN-γ is a pleotropic cytokine with anti-tumor functions, mainly produced by NK cells, NKT cells, CD8 + + 58 K D 59 Prior to this study, the role of ENPP1 in breast cancer has been extensively studied through genetic perturbations. 34 , 42 , 43 ENPP1 inhibition has several advantages over the traditional approach of direct STING agonists. The amount of STING agonists delivered intratumorally or systemically is usually in excess. Therefore, exogenous STING agonists flood into and activate both cancer and host cells, resulting in opposing pro- versus anti-cancer effects. 6 , 16 , 19 , 20 , 21 , 34 24 , 25 , 26 , 27 , 28 21 , 30 , 31 , 32 , 35 25 , 36 , 37 , 38 , 39 , 40 , 41 42 , 43 55 Limitations of the study One limitation is the focus on preclinical models, as the efficacy of ENPP1 inhibition requires a complete immune system that is hard to fully recapitulate with human cancer cell lines or organoids. However, our preclinical results hold translation values, given that mouse and human ENPP1 are highly conserved in sequence, structure, function, and phenotypes in cancer, 34 , 51 44 25 , 26 , 27 , 28 , 34 + + + + + Resource availability Lead contact Further information and requests for resources and reagents should be directed to and will be fulfilled by the lead contact, Lingyin Li ( lingyinl@stanford.edu Materials availability All unique reagents generated in this study are available from the lead contact with a completed materials transfer agreement. Data and code availability Human fxENPP1 with STF-1623 structure was deposited (PDB: 9NIR lead contact lead contact Acknowledgments We thank B. Plosky, the Scientific Publication Team at Arc Institute, and Li Lab members for feedback throughout the course of this study. Use of the Stanford Synchrotron Radiation Lightsource, SLAC National Accelerator Laboratory, is supported by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences DE-AC02-76SF00515 DOE Office of Biological and Environmental Research 10.13039/100000002 National Institutes of Health 10.13039/100000057 National Institute of General Medical Sciences P30GM133894 10.13039/100000002 NIH S10OD030332-01 10.13039/100000002 National Institutes of Health 5R01CA258427-02 Arc Institute Angarus Therapeutics 10.13039/100000002 National Institutes of Health P30GM133894 Author contributions Conceptualization, R.M.J., N.A.V., J.S., J.P., N.R., and L.L.; methodology, S.W., R.M.J., J.A.C., D.F., R.M., N.A.V., J.S., and J.P.; investigation, S.W., J.A.C., D.F., R.M., X.C., and Y.G.; visualization, S.W., J.A.C., and L.L.; funding acquisition, N.R. and L.L.; supervision, R.M.J. and L.L.; writing – original draft, S.W., R.M.J., J.A.C., D.F., and L.L.; writing – review and editing, S.W. and L.L. Declaration of interests L.L. and S.W. have filed one patent application on methods of use of ENPP1 inhibition (PCT/US2024/024497). L.L. and J.A.C. are inventors of two ENPP1 inhibitor patents (PCT/US2020/015968 and PCT/US2018/050018) that were licensed to Angarus Therapeutics. Angarus Therapeutics’ assets were purchased by Cyana Therapeutics. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies InVivo Bio X Cell Cat# BE0146; RRID: AB_10949053 InVivo Bio X Cell Cat# BE0101; RRID: AB_10949073 Live/dead-efluo780 eBioscience Cat# 65-0865-14 CD45-BV785 (30–511) BioLegend Cat# 103149; RRID: AB_2564590 CD45-PerCP.Cy5.5 (30-F11) BioLegend Cat# 103132; RRID: AB_893340 CD3-BUV395 (17A2) BD Biosciences Cat# 740268; RRID: AB_2687927 CD3-APC/Fire750 (17A2) BioLegend Cat# 100248; RRID: AB_2572118 CD4-BUV737 (RM4-5) BD Biosciences Cat# 612843; RRID: AB_2870165 CD4-BV421 (GK1.5) BioLegend Cat# 100443; RRID: AB_2562557 CD8-PE-eFluor610 (53-6.7) eBiosciences Cat# 61-0081-82; RRID: AB_467087 CD8a-PE.Cy7 (53-6.7) BioLegend Cat# 100722; RRID: AB_312761 FoxP3-PE (FJK-16S) eBiosciences Cat# 12-5773-82; RRID: AB_465936 CD335-BV421 (29A1.4) BioLegend Cat# 137612; RRID: AB_2563104 CD11b-PE-Cy7 (M1/70) BioLegend Cat# 101216; RRID: AB_312799 F4/80-BV510 (BM8) BioLegend Cat# 123135; RRID: AB_2562622 Gr-1-APC (RB6-8C5) BioLegend Cat# 108412; RRID: AB_313377 CD206-FITC (C068C2) BioLegend Cat# 141704; RRID: AB_10901166 IA-IE-AF700 (M5/114.15.2) BioLegend Cat# 107622; RRID: AB_493727 CD69-BV605 (H1.2F3) BioLegend Cat# 104530; RRID: AB_2563062 PD-1-BV650 (J43) BD Biosciences Cat# 744546; RRID: AB_2742317 Ki67-PerCP-Cy5.5 (16A8) BioLegend Cat# 652424; RRID: AB_2629531 TruStain FcX (anti-CD16/32) BioLegend Cat# 101320; RRID: AB_1574975 CD8α (D4W2Z) XP® Rabbit mAb Cell Signaling Cat# 94941 Bond polymer refine detection, anti-rabbit poly-HRP-IgG Leica Cat #DS9800 DYKDDDDK (FLAG) Tag Rabbit Ab Cell Signaling Cat# 2368 Tubulin (DM1A) Mouse Ab Cell Signaling Cat# 3873 IRDye 800CW goat anti-rabbit LI-COR Biosciences Cat# 926-32211 IRDye 680RD goat anti-mouse LI-COR Biosciences Cat# 926-68070 Chemicals, peptides, and recombinant proteins STF-1623 This paper N/A STF-1084 Carozza et al. 35 N/A 2′3′-cGAMP Wang et al. 34 N/A [ 32 Wang et al. 34 N/A Temozolomide Selleck Cat# S1237 Mouse ENPP1 (transmembrane and secreted) This paper N/A Human ENPP3 This paper N/A Human ENPP1 This paper N/A Human faux ENPP1 This paper N/A anti-DYKDDDDK (FLAG) magnetic agarose ThermoFischer Cat# A36797 3xFLAG peptide Sigma Cat# F4799 Critical commercial assays Pierce™ 660nm protein assay reagent ThermoFisher Cat# 22660 CellTiterGlo Promega Cat# G8461 Pyrophosphate assay kit Sigma-Aldrich Cat# MAK168 2′3′-cGAMP ELISA kit Cayman Cat# 501700 Mouse IFN gamma ELISA kit, extra sensitive Invitrogen Cat# BMS609 Cytokine 19-Plex kit MSD Cat# K15255D-1 Deposited data Human faux ENPP1 with STF-1623 structure This paper PDB: 9NIR Human ENPP1 (Apo) structure Dennis et al. 60 PDB: 6WFJ Mouse ENPP1 with STF-1084 structure Carozza et al. 44 PDB: 6XKD Enpp1 Enpp3 Zeng et al. 45 http://tismo.cistrome.org/ SignalP6.0 Teufel et al. 49 https://services.healthtech.dtu.dk/services/SignalP-6.0/ Experimental models: Cell lines Human: 293T ENPP1 −/− Carozza et al. 35 N/A Human: Expi293F ThermoFisher A14527 Mouse: 4T1 ATCC Cat# CRL-2539 Mouse: 4T1 Enpp1 −/− Carozza et al. 35 N/A Mouse: 4T1 ENPP1 WT−OE Wang et al. 34 N/A Mouse: 4T1 ENPP1 A84S−OE This paper N/A Mouse: EMT6 ATCC Cat# CRL-2755 Mouse: EMT6 shEnpp1 This paper N/A Mouse: MC38 Kerafast Cat# ENH204 Mouse: MC38 ENPP1 WT−OE This paper N/A Mouse: EMT6 ENPP1 T238A−OE This paper N/A Mouse: Panc02 ATCC Cat# CRL-2553 Mouse: CT26 ATCC Cat# CRL-2638 Mouse: IVISbrite GL261 Red-FLuc Revvity Cat# BW134246 Experimental models: Organisms/strains Mouse: C57BL/6 The Jackson Laboratory C57BL/6J (000664) Mouse: C57BL/6 Charles River C57BL/6NCrl Mouse: BALB/c The Jackson Laboratory BALB/cJ (000651) Mouse: BALB/c Taconic Biosciences BALB/cAnNTac Mouse: BALB/cJ- Enpp1 asj− 2 J/GrsrJ The Jackson Laboratory JAX: 019107 Oligonucleotides See Table S1 This paper N/A Recombinant DNA pcDNA3- sec This paper N/A pcDNA3- sec This paper N/A pcDNA3- sec This paper N/A pcDNA3-hENPP1-WT-Flag Genscript N/A pLenti-CMV-hENPP3-WT-FLAG Sagiv-Barfi et al. 54 N/A pcDNA3-mENPP1-WT-Flag Genscript N/A pcDNA3-mENPP1-P81A-Flag This paper N/A pcDNA3-mENPP1-S82A-Flag This paper N/A pcDNA3-mENPP1-C83A-Flag This paper N/A pcDNA3-mENPP1-K85A-Flag This paper N/A pcDNA3-mENPP1-E86A-Flag This paper N/A pcDNA3-mENPP1-V87A-Flag This paper N/A pcDNA3-mENPP1-S82A/K85A-Flag This paper N/A pcDNA3-mENPP1-A84S-Flag This paper N/A pcDNA3-mENPP1-A84G-Flag This paper N/A pcDNA3-mENPP1-A84V-Flag This paper N/A pcDNA3-mENPP1-A84T-Flag This paper N/A pcDNA3-mENPP1-A84P-Flag This paper N/A pcDNA3-mENPP1-A84K-Flag This paper N/A pcDNA3-mENPP1-A84D-Flag This paper N/A pcDNA3-mENPP1-A84F-Flag This paper N/A pcDNA3-mENPP1-C67A-Flag This paper N/A pcDNA3-mENPP1-C75A-Flag This paper N/A pcDNA3-mENPP1-C67/75A-Flag This paper N/A pcDNA3-mENPP1-C67/83A-Flag This paper N/A pcDNA3-mENPP1-C75/83A-Flag This paper N/A pcDNA3-mENPP1-C67/75/83A-Flag This paper N/A pcDNA3-mENPP1-M35V-Flag This paper N/A pcDNA3-hENPP1-Flag Genscript N/A pLenti-CMV-GFP-Puro Addgene RRID: Addgene_17448 pLenti-CMV-mENPP1-WT-GFP-Puro Wang et al. 34 N/A pLenti-CMV-mENPP1-T238A-GFP-Puro Wang et al. 34 N/A pLenti-CMV-mENPP1-A84S-GFP-Puro This paper N/A pLV3-U6-Enpp1-shRNA1-Blast This paper N/A Software and algorithms Prism 9.1.0 Graphpad https://www.graphpad.com/scientific-software/prism/ ImageJ 2.0.0 Schneider https://imagej.nih.gov/ij/ Pymol https://www.pymol.org/2/ FlowJo 10.8.0 FlowJo, LLC https://www.flowjo.com/ StudyDirectorTM 3.1.399.19 N/A Experimental model and subject details Mouse strains C57BL/6 and BALB/c mice were purchased from the Jackson Laboratory, Charles River, or Taconic Biosciences. BALB/cJ- Enpp1 asj−2J/GrsrJ Enpp1 −/− , Mammalian cell lines 293T ENPP1 −/− 35 Enpp1 −/− WT−OE T238A−OE 34 ENPP1 −/− 2 2 Method details Synthesis of STF-1623 (2-(1-(8-methoxyquinazolin-4-yl)piperidin-4-yl)ethyl)phosphonic acid) STF-1623-acid (denoted as STF-1623 throughout) was synthesized using a modified procedure from steps described in a previous study. 44 in situ Recombinant DNA Following the same strategy as previously published secreted ENPP expression constructs, 61 sec sec sec Table S1 sec Table S1 Table S1 Generation of stable expression cell lines To generate 4T1 ENPP1 A84S−OE Enpp1 −/− Enpp1 −/− WT−OE T238A−OE Preparation of cell lysate and supernatant 293T ENPP1 −/− 2 Expression and purification of ENPP proteins hENPP1, hENPP3, and faux hENPP1 (hENPP3-Q244D/E275D) in Figure 2 6 6 g 2 2 Transmembrane and secreted mENPP1 in Figure 3 ENPP1 −/− 2 2 g g g g [ 32 cGAMP activity assay (total volume 10–20 μL) containing 50% cell lysate or supernatant, cGAMP (1 μM, with trace [ 32 2 2 32 32 4 3 32 cGAMP activity assay by cGAMP-Luc ENPP1 (15 pM) or ENPP3 and fxENPP1 (250 pM) were added to cGAMP (2 μM). Reactions were incubated and then heat inactivated at 95°C for 10 min. The AMP degradation product was converted to ATP using an enzyme mixture of polyphosphate:AMP phosphotransferase (PAP) and myokinase (MilliporeSigma), which was detected using luciferase (CellTiterGlo, Promega) according to previous publication. 62 44 ATP activity assay by CellTiterGlo ATP activity assays (10 μL total in a 384 well PCR plate) were composed of the following: cell lysate/supernatant (1%), 1 μM ATP (Sigma) and ENPP1 activity buffer (50 mM Tris pH 9, 250 mM NaCl, 0.5 mM CaCl 2 2 Western blotting Cell lysates or supernatants in reducing or non-reducing sample buffer were separated on an SDS-polyacrylamide gel (Genscript) and transferred to a nitrocellulose membrane using a wet transfer system (BioRad). Primary antibody mouse anti-tubulin (1:2000) and rabbit anti-FLAG (1:1000) were purchased from Cell Signaling and added overnight at 4°C, followed by three washes in TBS-T (1x TBS-0.1% tween). Secondary antibody IRDye 800CW goat anti-rabbit (1:15,000) and IRDye 680RD goat anti-mouse (1:15,000) were purchased from Li-COR Biosciences and added for 1 h at room temperature, followed by three additional washes in TBS-T. Blots were imaged in IR using an LI-COR Odyssey Blot Imager. Bands were quantified using ImageJ. Surface plasma resonance N-terminally Avi-tagged and biotinylated mouse or human ENPP1 was immobilized on an SA sensor chip and loaded to about 3000 RU on a Bicaore T200 SPR system. STF-1623 was injected at increasing concentrations (0.12, 0.36, 1.11, 3.33, 10 nM) with a flow rate of 50 μL/min over 200 s each in PBS-P+ buffer (Cytiva). One of with mouse ENPP1 used stf-1623 at increasing concentrations (0.062, 0.19, 0.57, 1.67, 5 nM) with a flow rate of 30 μL/min Final dissociation took place over 600 s. Target residence time was calculated as the reciprocal of K off Crystallization and structure determination The protein has been purified to homogeneity and concentrated to 10 mg/mL prior to crystallization screening. Fresh protein sample stocks were mixed with inhibitor at 0.12 mM (∼1:1.2 protein:inhibitor molar ratio) prior to mixing with various crystallization buffers from commercial sources. Crystallization experiments were set-up using a Douglas Oryx8 Nanodrop dispensing robot (Douglas Instruments Ltd, Berkshire, United Kingdom). Crystals were grown using the sitting drop vapor diffusion method in an incubator at 16°C. Crystals were harvested in mother liquor solution supplemented with 25% glycerol and cryo-cooled by plunging into liquid N 2 63 3 1 64 6C02 65 66 67 68 69 70 71 Table S2 STF-1623 efficacy in tumor models For EMT6 efficacy, EMT6 (5 x 10 5 3 3 5 th For MC38 and CT26 efficacy, MC38 (2.5-5 x 10 5 6 3 WT−OE T238A−OE 5 For Panc02 efficacy, Panc02 (3 x 10 6 3 For GL261 efficacy, GL261 Red-Fluc (3 x 10 5 Liquid chromatography and mass spectrometry (LC-MS) For detection of STF-1623 ( Figures 1 Figures 4 S4 6 3 n For Figure 7 n For detection of STF-1623 in EMT6 shEnpp1 Figure S1 shEnpp1 Enpp1 −/− Figure S1 Enpp1 −/− Table S3 For detection of STF-1623 in 4T1 tumor and serum ( Figure S1 Enpp1 −/− 4 44 g Flow cytometry analysis For CT26 tumors ( Figure 5 5 pi pi pi pi For Panc02 tumor ( Figure 6 6 g 6 Immunohistochemistry and histology Tumors and lungs underwent formalin-fixed paraffin-embedded (FFPE) preparation and section at 4 μm thickness. To characterize tumor infiltrating lymphocytes, CD8 primary antibody staining (CST, #98941; 1:400) followed by anti-rabbit poly-HRP-IgG (Leica, #DS9800) of tumor samples were performed. Stained sections were scanned with Pannoramic Digital Scanners for 40x magnification. Images were analyzed utilizing the HALO platform. The whole slide image was analyzed, and areas of large necrosis were excluded. Both total tissue area and the number of IHC-positive cells was counted. IHC scores are presented as CD8 + 2 IFN-γ measurement in tumor and serum using qRT-PCR and ELISA WT or shEnpp1 6 Ifn-γ GapdH Table S1 shEnpp1 Intratumoral cGAMP measurement Frozen tumor tissue was thawed on ice and homogenized to 100 mg/mL in lysis buffer consisted of T-PER Tissue Protein Extraction Reagent (ThermoFisher, #78510), protease inhibitor (Roche, #11836170001), PhosSTOP (Sigma, #4906845001), STF-1084 (150 nM). Lysates were span down at 16,000 g for 20 min at 4°C and supernatant was collected and inactivated at 80°C for 10 min cGAMP in undiluted tissue lysate was measured using 2′3′-cGAMP ELISA kit (Cayman, #501700) following manufacturer instruction. Pyrophosphate (PPi) measurement Female BALB/c mice with established breast tumor (EMT6 or 4T1) were injected subcutaneously with STF-1632 (50 mg/kg) or vehicle control for seven days ( n Quantification and statistical analysis In ENPP1/3 inhibition assays, the half maximal inhibitory concentrations (IC 50 References 1 Miller K.D. Nogueira L. Devasia T. Mariotto A.B. Yabroff K.R. Jemal A. Kramer J. Siegel R.L. Cancer treatment and survivorship statistics, 2022 CA Cancer J. Clin. 72 2022 409 436 10.3322/CAAC.21731 35736631 2 Haslam A. Olivier T. Prasad V. How many people in the US are eligible for and respond to checkpoint inhibitors: An empirical analysis Int. J. Cancer 156 2025 2352 2359 10.1002/IJC.35347 39887747 3 Leon-Ferre R.A. Jonas S.F. Salgado R. Loi S. de Jong V. Carter J.M. Nielsen T.O. Leung S. Riaz N. Chia S. Tumor-Infiltrating Lymphocytes in Triple-Negative Breast Cancer JAMA 331 2024 1135 1144 10.1001/JAMA.2024.3056 38563834 PMC10988354 4 Bonaventura P. Shekarian T. Alcazer V. Valladeau-Guilemond J. Valsesia-Wittmann S. Amigorena S. Caux C. Depil S. Cold Tumors: A Therapeutic Challenge for Immunotherapy Front. Immunol. 10 2019 168 10.3389/FIMMU.2019.00168 PMC6376112 30800125 5 Wu B. Zhang B. Li B. Wu H. Jiang M. Cold and hot tumors: from molecular mechanisms to targeted therapy Signal Transduct. Target. Ther. 9 2024 274 10.1038/S41392-024-01979-X 39420203 PMC11491057 6 Deng L. Liang H. Xu M. Yang X. Burnette B. Arina A. Li X.D. Mauceri H. Beckett M. Darga T. STING-dependent cytosolic DNA sensing promotes radiation-induced type I interferon-dependent antitumor immunity in immunogenic tumors Immunity 41 2014 843 852 10.1016/j.immuni.2014.10.019 25517616 PMC5155593 7 Yum S. Li M. Fang Y. Chen Z.J. TBK1 recruitment to STING activates both IRF3 and NF-κB that mediate immune defense against tumors and viral infections Proc. Natl. Acad. Sci. USA 118 2021 e2100225118 10.1073/PNAS.2100225118/SUPPL_FILE/PNAS.2100225118.SAPP.PDF PMC8040795 33785602 8 Wu J. Dobbs N. Yang K. Yan N. Interferon-Independent Activities of Mammalian STING Mediate Antiviral Response and Tumor Immune Evasion Immunity 53 2020 115 126.e5 10.1016/J.IMMUNI.2020.06.009 32640258 PMC7365768 9 Ishikawa H. Barber G.N. STING is an endoplasmic reticulum adaptor that facilitates innate immune signalling Nature 455 2008 674 678 10.1038/nature07317 18724357 PMC2804933 10 Ablasser A. Goldeck M. Cavlar T. Deimling T. Witte G. Röhl I. Hopfner K.P. Ludwig J. Hornung V. cGAS produces a 2′-5′-linked cyclic dinucleotide second messenger that activates STING Nature 498 2013 380 384 10.1038/nature12306 23722158 PMC4143541 11 Gao P. Ascano M. Wu Y. Barchet W. Gaffney B.L. Zillinger T. Serganov A.A. Liu Y. Jones R.A. Hartmann G. Cyclic [G(2′,5′)pA(3′,5′)p] Is the Metazoan Second Messenger Produced by DNA-Activated Cyclic GMP-AMP Synthase Cell 153 2013 1094 1107 10.1016/J.CELL.2013.04.046 23647843 PMC4382009 12 Wu J. Sun L. Chen X. Du F. Shi H. Chen C. Chen Z.J. Cyclic GMP-AMP is an endogenous second messenger in innate immune signaling by cytosolic DNA Science (80- ) 339 2013 826 830 10.1126/SCIENCE.1229963/SUPPL_FILE/WU.SM.PDF PMC3855410 23258412 13 Sun L. Wu J. Du F. Chen X. Chen Z.J. Cyclic GMP-AMP synthase is a cytosolic DNA sensor that activates the type I interferon pathway Science (80- ) 339 2013 786 791 10.1126/SCIENCE.1232458/SUPPL_FILE/SUN_CGAS_SUPPLEMENTARYTABLES1.XLSX PMC3863629 23258413 14 Chan R. Cao X. Ergun S.L. Njomen E. Lynch S.R. Ritchie C. Cravatt B. Li L. Human STING oligomer function is governed by palmitoylation of an evolutionarily conserved cysteine Preprint at bioRxiv 2024 10.1101/2023.08.11.553045 15 Ergun S.L. Fernandez D. Weiss T.M. Li L. STING Polymer Structure Reveals Mechanisms for Activation, Hyperactivation, and Inhibition Cell 178 2019 290 301.e10 10.1016/J.CELL.2019.05.036 31230712 16 Woo S.R. Fuertes M.B. Corrales L. Spranger S. Furdyna M.J. Leung M.Y.K. Duggan R. Wang Y. Barber G.N. Fitzgerald K.A. STING-dependent cytosolic DNA sensing mediates innate immune recognition of immunogenic tumors Immunity 41 2014 830 842 10.1016/J.IMMUNI.2014.10.017 25517615 PMC4384884 17 Meric-Bernstam F. Sweis R.F. Kasper S. Hamid O. Bhatia S. Dummer R. Stradella A. Long G.V. Spreafico A. Shimizu T. Combination of the STING Agonist MIW815 (ADU-S100) and PD-1 Inhibitor Spartalizumab in Advanced/Metastatic Solid Tumors or Lymphomas: An Open-Label, Multicenter, Phase Ib Study Clin. Cancer Res. 29 2023 110 121 10.1158/1078-0432.CCR-22-2235 36282874 PMC11188043 18 Meric-Bernstam F. Sweis R.F. Hodi F.S. Messersmith W.A. Andtbacka R.H.I. Ingham M. Lewis N. Chen X. Pelletier M. Chen X. Phase I Dose-Escalation Trial of MIW815 (ADU-S100), an Intratumoral STING Agonist, in Patients with Advanced/Metastatic Solid Tumors or Lymphomas Clin. Cancer Res. 28 2022 677 688 10.1158/1078-0432.CCR-21-1963 34716197 19 Wang Q. Bergholz J.S. Ding L. Lin Z. Kabraji S.K. Hughes M.E. He X. Xie S. Jiang T. Wang W. STING agonism reprograms tumor-associated macrophages and overcomes resistance to PARP inhibition in BRCA1-deficient models of breast cancer Nat. Commun. 13 2022 3022 10.1038/s41467-022-30568-1 35641483 PMC9156717 20 Li J. Hubisz M.J. Earlie E.M. Duran M.A. Hong C. Varela A.A. Lettera E. Deyell M. Tavora B. Havel J.J. Non-cell-autonomous cancer progression from chromosomal instability Nature 620 2023 1080 1088 10.1038/s41586-023-06464-z 37612508 PMC10468402 21 Bakhoum S.F. Ngo B. Laughney A.M. Cavallo J.A. Murphy C.J. Ly P. Shah P. Sriram R.K. Watkins T.B.K. Taunk N.K. Chromosomal instability drives metastasis through a cytosolic DNA response Nature 553 2018 467 472 10.1038/NATURE25432 29342134 PMC5785464 22 Yang H. Lee W.S. Kong S.J. Kim C.G. Kim J.H. Chang S.K. Kim S. Kim G. Chon H.J. Kim C. STING activation reprograms tumor vasculatures and synergizes with VEGFR2 blockade J. Clin. Investig. 129 2019 4350 4364 10.1172/JCI125413 31343989 PMC6763266 23 Wang L. Liang Z. Guo Y. Habimana J.d.D. Ren Y. Amissah O.B. Mukama O. Peng S. Ding X. Lv L. STING agonist diABZI enhances the cytotoxicity of T cell towards cancer cells Cell Death Dis. 15 2024 265 10.1038/s41419-024-06638-1 38615022 PMC11016101 24 Downey C.M. Aghaei M. Schwendener R.A. Jirik F.R. DMXAA Causes Tumor Site-Specific Vascular Disruption in Murine Non-Small Cell Lung Cancer, and like the Endogenous Non-Canonical Cyclic Dinucleotide STING Agonist, 2′3′-cGAMP, Induces M2 Macrophage Repolarization PLoS One 9 2014 e99988 10.1371/JOURNAL.PONE.0099988 PMC4062468 24940883 25 Sudaryo V. Carvalho D.R. Lee J.M. Carozza J.A. Cao X. Cordova A.F. Li L. Toxicity of extracellular cGAMP and its analogs to T cells is due to SLC7A1-mediated import Preprint at bioRxiv 2024 10.1101/2024.09.21.614248 26 Sivick K.E. Desbien A.L. Glickman L.H. Reiner G.L. Corrales L. Surh N.H. Hudson T.E. Vu U.T. Francica B.J. Banda T. Magnitude of Therapeutic STING Activation Determines CD8+ T Cell-Mediated Anti-tumor Immunity Cell Rep. 25 2018 3074 3085.e5 10.1016/J.CELREP.2018.11.047 30540940 27 Gulen M.F. Koch U. Haag S.M. Schuler F. Apetoh L. Villunger A. Radtke F. Ablasser A. Signalling strength determines proapoptotic functions of STING Nat. Commun. 8 2017 427 10.1038/s41467-017-00573-w 28874664 PMC5585373 28 Larkin B. Ilyukha V. Sorokin M. Buzdin A. Vannier E. Poltorak A. Cutting Edge: Activation of STING in T Cells Induces Type I IFN Responses and Cell Death J. Immunol. 199 2017 397 402 10.4049/JIMMUNOL.1601999 28615418 PMC5525333 29 Li L. Yin Q. Kuss P. Maliga Z. Millán J.L. Wu H. Mitchison T.J. Hydrolysis of 2′3′-cGAMP by ENPP1 and design of nonhydrolyzable analogs Nat. Chem. Biol. 10 2014 1043 1048 10.1038/nchembio.1661 25344812 PMC4232468 30 MacKenzie K.J. Carroll P. Martin C.A. Murina O. Fluteau A. Simpson D.J. Olova N. Sutcliffe H. Rainger J.K. Leitch A. cGAS surveillance of micronuclei links genome instability to innate immunity Nature 548 2017 461 465 10.1038/nature23449 28738408 PMC5870830 31 Flynn P.J. Koch P.D. Mitchison T.J. Chromatin bridges, not micronuclei, activate cGAS after drug-induced mitotic errors in human cells Proc. Natl. Acad. Sci. USA 118 2021 e2103585118 10.1073/PNAS.2103585118 PMC8640936 34819364 32 Chen Y.A. Shen Y.L. Hsia H.Y. Tiang Y.P. Sung T.L. Chen L.Y. Extrachromosomal telomere repeat DNA is linked to ALT development via cGAS-STING DNA sensing pathway Nat. Struct. Mol. Biol. 24 2017 1124 1131 10.1038/nsmb.3498 29106411 33 Konno H. Yamauchi S. Berglund A. Putney R.M. Mulé J.J. Barber G.N. Suppression of STING signaling through epigenetic silencing and missense mutation impedes DNA damage mediated cytokine production Oncogene 37 2018 2037 2051 10.1038/S41388-017-0120-0 29367762 PMC6029885 34 Wang S. Böhnert V. Joseph A.J. Sudaryo V. Skariah G. Swinderman J.T. Yu F.B. Subramanyam V. Wolf D.M. Lyu X. ENPP1 is an innate immune checkpoint of the anticancer cGAMP–STING pathway in breast cancer Proc. Natl. Acad. Sci. USA 120 2023 e2313693120 10.1073/PNAS.2313693120/SUPPL_FILE/PNAS.2313693120.SAPP.PDF PMC10756298 38117852 35 Carozza J.A. Böhnert V. Nguyen K.C. Skariah G. Shaw K.E. Brown J.A. Rafat M. von Eyben R. Graves E.E. Glenn J.S. Extracellular cGAMP is a cancer-cell-produced immunotransmitter involved in radiation-induced anticancer immunity Nat. Cancer 1 2020 184 196 10.1038/s43018-020-0028-4 33768207 PMC7990037 36 Ritchie C. Cordova A.F. Hess G.T. Bassik M.C. Li L. SLC19A1 Is an Importer of the Immunotransmitter cGAMP Mol. Cell 75 2019 372 381.e5 10.1016/J.MOLCEL.2019.05.006 31126740 PMC6711396 37 Luteijn R.D. Zaver S.A. Gowen B.G. Wyman S.K. Garelis N.E. Onia L. McWhirter S.M. Katibah G.E. Corn J.E. Woodward J.J. Raulet D.H. SLC19A1 transports immunoreactive cyclic dinucleotides Nature 573 2019 434 438 10.1038/S41586-019-1553-0 31511694 PMC6785039 38 Cordova A.F. Ritchie C. Böhnert V. Li L. Human SLC46A2 Is the Dominant cGAMP Importer in Extracellular cGAMP-Sensing Macrophages and Monocytes ACS Cent. Sci. 7 2021 1073 1088 10.1021/ACSCENTSCI.1C00440/ASSET/IMAGES/LARGE/OC1C00440_0006.JPEG 34235268 PMC8228594 39 Lahey L.J. Mardjuki R.E. Wen X. Hess G.T. Ritchie C. Carozza J.A. Böhnert V. Maduke M. Bassik M.C. Li L. LRRC8A:C/E Heteromeric Channels Are Ubiquitous Transporters of cGAMP Mol. Cell 80 2020 578 591.e5 10.1016/J.MOLCEL.2020.10.021 33171122 40 Concepcion A.R. Wagner L.E. Zhu J. Tao A.Y. Yang J. Khodadadi-Jamayran A. Wang Y.H. Liu M. Rose R.E. Jones D.R. The volume-regulated anion channel LRRC8C suppresses T cell function by regulating cyclic dinucleotide transport and STING-p53 signaling Nat. Immunol. 23 2022 287 302 10.1038/S41590-021-01105-X 35105987 PMC8991407 41 Zhou Y. Fei M. Zhang G. Liang W.C. Lin W. Wu Y. Piskol R. Ridgway J. McNamara E. Huang H. Blockade of the Phagocytic Receptor MerTK on Tumor-Associated Macrophages Enhances P2X7R-Dependent STING Activation by Tumor-Derived cGAMP Immunity 52 2020 357 373.e9 10.1016/J.IMMUNI.2020.01.014/ATTACHMENT/6A15F752-CF0F-433B-9CCA-DB71C0878255/MMC2.PDF 32049051 42 Ruiz-Fernández de Córdoba B. Moreno H. Valencia K. Perurena N. Ruedas P. Walle T. Pezonaga-Torres A. Hinojosa J. Guruceaga E. Pineda-Lucena A. Tumor ENPP1 (CD203a)/Haptoglobin Axis Exploits Myeloid-Derived Suppressor Cells to Promote Post-Radiotherapy Local Recurrence in Breast Cancer Cancer Discov. 12 2022 1356 1377 10.1158/2159-8290.CD-21-0932 35191482 PMC7612709 43 Li J. Duran M.A. Dhanota N. Chatila W.K. Bettigole S.E. Kwon J. Sriram R.K. Humphries M.P. Salto-Tellez M. James J.A. Metastasis and Immune Evasion from Extracellular cGAMP Hydrolysis Cancer Discov. 11 2021 1212 1227 10.1158/2159-8290.CD-20-0387 33372007 PMC8102348 44 Carozza J.A. Brown J.A. Böhnert V. Fernandez D. AlSaif Y. Mardjuki R.E. Smith M. Li L. Structure-Aided Development of Small-Molecule Inhibitors of ENPP1, the Extracellular Phosphodiesterase of the Immunotransmitter cGAMP Cell Chem. Biol. 27 2020 1347 1358.e5 10.1016/J.CHEMBIOL.2020.07.007 32726585 PMC7680421 45 Zeng Z. Wong C.J. Yang L. Ouardaoui N. Li D. Zhang W. Gu S. Zhang Y. Liu Y. Wang X. TISMO: syngeneic mouse tumor database to model tumor immunity and immunotherapy response Nucleic Acids Res. 50 2022 D1391 D1397 10.1093/NAR/GKAB804 34534350 PMC8728303 46 Stabach P.R. Zimmerman K. Adame A. Kavanagh D. Saeui C.T. Agatemor C. Gray S. Cao W. De La Cruz E.M. Yarema K.J. Braddock D.T. Improving the Pharmacodynamics and In Vivo Activity of ENPP1-Fc Through Protein and Glycosylation Engineering Clin. Transl. Sci. 14 2021 362 372 10.1111/CTS.12887 33064927 PMC7877847 47 Davis M.J. Hanson K.A. Clark F. Fink J.L. Zhang F. Kasukawa T. Kai C. Kawai J. Carninci P. Hayashizaki Y. Teasdale R.D. Differential use of signal peptides and membrane domains is a common occurrence in the protein output of transcriptional units PLoS Genet. 2 2006 e46 e563 10.1371/JOURNAL.PGEN.0020046 16683029 PMC1449889 48 Jansen S. Perrakis A. Ulens C. Winkler C. Andries M. Joosten R.P. Van Acker M. Luyten F.P. Moolenaar W.H. Bollen M. Structure of NPP1, an Ectonucleotide Pyrophosphatase/Phosphodiesterase Involved in Tissue Calcification Structure 20 2012 1948 1959 10.1016/J.STR.2012.09.001 23041369 49 Teufel F. Almagro Armenteros J.J. Johansen A.R. Gíslason M.H. Pihl S.I. Tsirigos K.D. Winther O. Brunak S. von Heijne G. Nielsen H. SignalP 6.0 predicts all five types of signal peptides using protein language models Nat. Biotechnol. 40 2022 1023 1025 10.1038/s41587-021-01156-3 34980915 PMC9287161 50 Sakaguchi M. Tomiyoshi R. Kuroiwa T. Mihara K. Omura T. Functions of signal and signal-anchor sequences are determined by the balance between the hydrophobic segment and the N-terminal charge Proc. Natl. Acad. Sci. USA 89 1992 16 19 10.1073/PNAS.89.1.16 1729684 PMC48165 51 Carozza J.A. Cordova A.F. Brown J.A. AlSaif Y. Böhnert V. Cao X. Mardjuki R.E. Skariah G. Fernandez D. Li L. ENPP1’s regulation of extracellular cGAMP is a ubiquitous mechanism of attenuating STING signaling Proc. Natl. Acad. Sci. USA 119 2022 e2119189119 10.1073/PNAS.2119189119 PMC9173814 35588451 52 Orriss I.R. Arnett T.R. Russell R.G.G. Pyrophosphate: a key inhibitor of mineralisation Curr. Opin. Pharmacol. 28 2016 57 68 10.1016/J.COPH.2016.03.003 27061894 53 Mardjuki R. Wang S. Carozza J. Zirak B. Subramanyam V. Abhiraman G. Lyu X. Goodarzi H. Li L. Identification of the extracellular membrane protein ENPP3 as a major cGAMP hydrolase and innate immune checkpoint Cell Rep. 43 2024 114209 10.1016/J.CELREP.2024.114209 38749434 54 Sagiv-Barfi I. Kohrt H.E.K. Czerwinski D.K. Ng P.P. Chang B.Y. Levy R. Therapeutic antitumor immunity by checkpoint blockade is enhanced by ibrutinib, an inhibitor of both BTK and ITK Proc. Natl. Acad. Sci. USA 112 2015 E966 E972 10.1073/pnas.1500712112 25730880 PMC4352777 55 Bageritz J. Puccio L. Piro R.M. Hovestadt V. Phillips E. Pankert T. Lohr J. Herold-Mende C. Lichter P. Goidts V. Stem cell characteristics in glioblastoma are maintained by the ecto-nucleotidase E-NPP1 Cell Death Differ. 21 2014 929 940 10.1038/CDD.2014.12 24531536 PMC4013511 56 Rudalska R. Harbig J. Forster M. Woelffing P. Esposito A. Kudolo M. Botezatu A. Haller V. Janssen N. Holzmayer S. First-in-class ultralong-target-residence-time p38α inhibitors as a mitosis-targeted therapy for colorectal cancer Nat. Cancer 6 2025 259 277 10.1038/s43018-024-00899-7 39820127 PMC11864979 57 De Cesco S. Kurian J. Dufresne C. Mittermaier A.K. Moitessier N. Covalent inhibitors design and discovery Eur. J. Med. Chem. 138 2017 96 114 10.1016/j.ejmech.2017.06.019 28651155 58 Jorgovanovic D. Song M. Wang L. Zhang Y. Roles of IFN-γin tumor progression and regression: A review Biomark. Res. 8 2020 49 10.1186/s40364-020-00228-x 33005420 PMC7526126 59 Kemna J. Gout E. Daniau L. Lao J. Weißert K. Ammann S. Kühn R. Richter M. Molenda C. Sporbert A. IFNγ binding to extracellular matrix prevents fatal systemic toxicity Nat. Immunol. 24 2023 414 422 10.1038/s41590-023-01420-5 36732425 PMC9977683 60 Dennis M.L. Newman J. Dolezal O. Hattarki M. Surjadi R.N. Nuttall S.D. Pham T. Nebl T. Camerino M. Khoo P.S. Crystal structures of human ENPP1 in apo and bound forms Acta Crystallogr. D Struct. Biol. 76 2020 889 898 32876064 10.1107/S2059798320010505 PMC7466750 61 Kato K. Nishimasu H. Okudaira S. Mihara E. Ishitani R. Takagi J. Aoki J. Nureki O. Crystal structure of Enpp1, an extracellular glycoprotein involved in bone mineralization and insulin signaling Proc. Natl. Acad. Sci. USA 109 2012 16876 16881 23027977 10.1073/pnas.1208017109 PMC3479499 62 Mardjuki R.E. Carozza J.A. Li L. Development of cGAMP-Luc, a sensitive and precise coupled enzyme assay to measure cGAMP in complex biological samples J. Biol. Chem. 295 2020 4881 4892 32127400 10.1074/jbc.RA119.012170 PMC7152770 63 Russi S. Song J. Mcphillips S.E. Cohen A.E. The Stanford Automated Mounter: pushing the limits of sample exchange at the SSRL macromolecular crystallography beamlines J. Appl. Crystallogr. 49 2016 622 626 10.1107/S1600576716000649 27047309 PMC4815877 64 McCoy A.J. Grosse-Kunstleve R.W. Adams P.D. Winn M.D. Storoni L.C. Read R.J. Phaser crystallographic software J. Appl. Crystallogr. 40 2007 658 674 10.1107/S0021889807021206 19461840 PMC2483472 65 Gorelik A. Randriamihaja A. Illes K. Nagar B. Structural basis for nucleotide recognition by the ectoenzyme CD203c FEBS J. 285 2018 2481 2494 10.1111/FEBS.14489 29717535 66 Murshudov G.N. Vagin A.A. Dodson E.J. Refinement of macromolecular structures by the maximum-likelihood method Acta Crystallogr. D Biol. Crystallogr. 53 1997 240 255 10.1107/S0907444996012255 15299926 67 Emsley P. Lohkamp B. Scott W.G. Cowtan K. Features and development of Coot Acta Crystallogr. D Biol. Crystallogr. 66 2010 486 501 10.1107/S0907444910007493 20383002 PMC2852313 68 Kabsch W. XDS Acta Crystallogr. D Biol. Crystallogr. 66 2010 125 132 10.1107/S0907444909047337 20124692 PMC2815665 69 Winter G. Waterman D.G. Parkhurst J.M. Brewster A.S. Gildea R.J. Gerstel M. Fuentes-Montero L. Vollmar M. Michels-Clark T. Young I.D. DIALS: implementation and evaluation of a new integration package Acta Crystallogr. D Struct. Biol. 74 2018 85 97 10.1107/S2059798317017235 29533234 PMC5947772 70 Evans P.R. An introduction to data reduction: space-group determination, scaling and intensity statistics Acta Crystallogr. D Biol. Crystallogr. 67 2011 282 292 10.1107/S090744491003982X 21460446 PMC3069743 71 Winn M.D. Ballard C.C. Cowtan K.D. Dodson E.J. Emsley P. Evans P.R. Keegan R.M. Krissinel E.B. Leslie A.G.W. McCoy A. Overview of the CCP4 suite and current developments Acta Crystallogr. D Biol. Crystallogr. 67 2011 235 242 10.1107/S0907444910045749 21460441 PMC3069738 Supplemental information  Document S1. Figures S1–S5 and Tables S1–S3 Document S2. Article plus supplemental information Supplemental information can be found online at https://doi.org/10.1016/j.xcrm.2025.102336 ",
  "metadata": {
    "Title of this paper": "Overview of the CCP4 suite and current developments",
    "Journal it was published in:": "Cell Reports Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490234/"
  }
}