{
  "title": "Paper_746",
  "abstract": "pmc Polymers (Basel) Polymers (Basel) 3589 polymers polymers Polymers 2073-4360 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473933 PMC12473933.1 12473933 12473933 41012295 10.3390/polym17182532 polymers-17-02532 1 Article Eco-Friendly Recovery of Homogalacturonan-Rich Pectin from Flaxseed Cake via NADES Extraction Mazurek-Hołys Aleksandra Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization 1 Górska Ewa Formal analysis Writing – original draft Visualization 1 https://orcid.org/0000-0002-0764-0751 Tsirigotis-Maniecka Marta Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization 1 https://orcid.org/0000-0003-4282-6620 Zoumpanioti Maria Methodology Formal analysis Investigation Writing – original draft Writing – review & editing 2 https://orcid.org/0000-0003-1793-4187 Bleha Roman Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization 3 Pawlaczyk-Graja Izabela Conceptualization Methodology Software Formal analysis Investigation Writing – original draft Writing – review & editing Visualization Supervision Project administration 1 * Coseri Sergiu Academic Editor 1 aleksandra.mazurek@pwr.edu.pl ewa.gorska@pwr.edu.pl marta.tsirigotis@pwr.edu.pl 2 mariaz@eie.gr 3 roman.bleha@vscht.cz * izabela.pawlaczyk@pwr.edu.pl 19 9 2025 9 2025 17 18 497668 2532 31 7 2025 09 9 2025 15 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Flaxseed polysaccharides (FLP) are bioactive macromolecules with valuable functional properties and applications in the food, pharmaceutical, and packaging industries. This study focused on obtaining high-purity pectin from flaxseed cake using sustainable extraction with natural deep eutectic solvents (NADES) based on choline chloride (ChCl) and citric acid (CA) The ChCl/CA system (1:1) resulted in the LU3 extract, which provided the best outcome, yielding the highest pectin recovery (36.88 mg/g), elevated uronic acid content (30.33% of sample; 68.15% of saccharides), and the lowest protein contamination (11.46%), confirming superior pectin purity. Structural (UV-Vis, FT-IR, GC-MS, GPC, LH-20) identified homogalacturonan with xylogalacturonan domains (53% DM) and a molecular weight range of 14–500 × 10 3 flaxseed cake natural deep eutectic solvents pectin homogalacturonan Ministry of Science and Higher Education This work was funded by a subsidy of 2024 provided by the Ministry of Science and Higher Education to the Wroclaw University of Science and Technology. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Flax ( Linum usitatissimum 1 Linum usitatissimum 2 3 2 4 5 According to the FAO (2021) [ 2 Defatted flaxseed cake is rich in many components that contain bioactive components with valuable functionality, including polyphenols, proteins, and FLP [ 6 7 1 8 9 10 11 12 13 14 15 16 17 18 Flax seeds are a rich source of many bioactive compounds, e.g., α-linolenic acid, secoisolariciresinol diglucoside, and soluble as well as insoluble fiber. These compounds are anti-inflammatory, antioxidant, and lipid-regulating agents, supporting therapies against cardiovascular diseases, diabetes, and cancers [ 19 20 21 20 20 22 2 20 21 20 20 23 24 The valorization of waste materials through pectin extraction offers not only an environmentally friendly strategy to obtain biodegradable, biocompatible, and non-toxic biofilms and biomaterials. Pectins can function as matrices and scaffolds that facilitate cell adhesion and proliferation, making them highly suitable for applications in tissue engineering, including tissue repair and regeneration [ 25 26 25 27 28 29 30 31 10 So far, various methods for the extraction of polysaccharides from flax seeds have been described, including hot water extraction (HWE) [ 32 33 32 33 32 33 34 23 35 w w 32 32 33 34 35 32 In the present study, the polysaccharides rich in uronic acids were extracted from flaxseed cake, a by-product of flaxseed oil production. The research primarily focused on the extraction process from this raw material, employing, among other methods, aqueous solutions of natural deep eutectic solvents (NADES). The aim was to evaluate the potential of NADES as green solvents for the efficient extraction of pectins from this food processing waste, in comparison to other extraction methods. Although aqueous solutions of NADES have been previously reported in the scientific literature as effective extraction media for isolating pectins from various plant-based wastes [ 36 37 38 39 40 2. Materials and Methods 2.1. Plant Material and Reagents Linum m 2 4 7 2 2.2. NADES Preparation Four natural deep eutectic solvent (NADES) variants with different molar ratios of choline chloride (ChCl) and citric acid (CA) were prepared, including ratios of 1:1, 1:2, 1:3, and 1:4. To obtain 100 g of the NADES mixture, the chemicals were combined in their respective proportions and mixed under reduced pressure, at 70 °C for 15–30 min. The process continued until a homogeneous liquid was formed. Subsequently, immediately before extraction, NADES was dissolved in distilled water at a ratio of 1:9 w w 2.3. Extraction of Pectins from Flaxseed Cake The extraction and purification of pectins from flaxseed cake were performed following standardized procedures described previously [ 41 21 The crude product was dissolved and dialyzed against distilled water using a Spectra/Por ® (1) Y  % = m a s s  o f  p r o d u c t  a f t e r  e x t r a c t i o n  p r o c e s s  m g m a s s  o f  r a w  m a t e r i a l  g 2.4. Chemical Characterization The conductivity and pH of extraction media solutions were measured using a Laboratory pH/Conductivity meter CPC-511 (Elmetron, Zabrze, Poland). The total carbohydrate content in Linum 42 m 43 44 45 2.5. Monosaccharides Composition The polysaccharide sample was hydrolyzed (2M TFA, 120 °C, 5 h), reduced with sodium borohydride, and acetylated by acetic acid anhydride in the presence of pyridine. Thereafter, the sample was extracted three times with dichloromethane and evaporated to dryness under N 2 46 2.6. FT-IR Spectroscopy Analysis Fourier-transform infrared spectroscopy (FT-IR) was performed using a Nicolet iS20 FT-IR spectrometer (Thermo Fisher Scientific, Waltham, MA, USA) and Omnic 9.0 software. A sample-containing KBr tablet was prepared using a hand press (Pike Technologies, Madison, WI, USA) to perform the measurement. The spectrum was recorded in the mid-infrared region spanning 4000–400 cm −1 −1 2.7. Homogeneity The crude extract was prepared for Sephadex LH-20 gel chromatography to assess its homogeneity. The sample was weighed (~33 mg) and completely dissolved in 0.5 mL of 0.1 M NaOH, followed by centrifugation and filtration on a syringe filter (0.45 μm). The column (13 × 300 mm) was packed with resin (~10 g of Sephadex LH-20), which was saturated with the eluent (methanol/0.1 M NaOH, 1:3), and pre-equilibrated with at least 3 bed volumes of eluent. Then, 0.5 mL of the dissolved crude pectin-like extract was loaded onto the column. The mobile phase was methanol/0.1 M NaOH (1:3). The eluates were collected (1 mL/tube). The carbohydrate profile was analyzed using the phenol-sulfuric acid assay [ 34 44 45 Gel Permeation Chromatography (GPC) was performed using Sephacryl S-300 HR resin. The column (20 × 1200 mm) was packed with gel and washed with 0.1 M NaOH to remove residual 0.02% sodium azide solution (at least 3 bed volumes). The crude product (~30 mg) was dissolved in 0.1 M NaOH (0.5 mL). Then, 0.5 mL of the dissolved crude pectin-like product was loaded onto the column. The void volume (V 0 42 2.8. Physicochemical Characterization 2.8.1. Microscopic Evaluation Immediately before the experiment, LU3 powder was mounted onto double-sided adhesive carbon tape. A 50 μL drop of LU3 solution (10 mg/mL) was applied to double-sided adhesive carbon tape 24 h before the experiment to allow the water to evaporate. The morphology of LU3 was examined using a scanning electron microscope (JSM-6601LV, JEOL, Tokyo, Japan) (operating at 5–20 kV, spot size 30, high vacuum) coupled with an energy-dispersive X-ray spectroscopy (EDS) system (Oxford Aztec Energy, Oxford, UK) for mineral characterization. 2.8.2. Zeta Potential Measurements The electrophoretic mobility of LU3 particles was measured at 22 °C using a Zetasizer Nano-ZS analyzer (Malvern, UK) (λ laser w v 2.8.3. Static Viscosity Analysis The viscosity of 0.1% LU3 was measured in a glass beaker at 23 ± 1 °C using a Rotavisc Lo-vi viscometer (IKA, Poznań, Poland) equipped with an SP-6 spindle, following the requirements of the International Standard ISO 2555:2018 [ 47 2.9. Statistical Analysis Statistical evaluation was carried out with Microsoft Office Excel 2021. Data are expressed as the mean ± standard deviation (S.D.). The statistical significance of differences between the treated and the control groups was determined by the Student’s t p 3. Results and Discussion 3.1. Crude Polysaccharides from Flaxseed Cake Crude extracts from Linum usitatissimum 21 Figure 1 The extraction yield and total saccharide concentration of the crude polysaccharide products from flaxseed cake ranged from 53.58 to 136.71 mg/g and from 34.89% to 45.20% (based on dry flaxseed cake), respectively. The highest extraction efficiency was observed for the LU4 product, obtained using NADES with a ChCl/CA molar ratio of 1:2, whereas the highest saccharide content was found in the LU6 product, corresponding to a ChCl/CA molar ratio of 1:4. Additionally, LU3 exhibited the lowest level of contamination by proteins, with a value of 11.46%, in the dry crude polysaccharide product. Notably, the most efficient LU3 product was obtained using the extraction medium with the highest conductivity, i.e., 20.3 mS/cm. However, in this study, alongside the polysaccharide yield, the second most important parameter indicating the presence of pectins was the uronic acid (UA) content. According to Table 1 33 Table 1 A high UA content (~68%) in the isolated crude polysaccharide LU3 suggests the presence of pectin. Xyl residues were predominant among the neutral monosaccharide residues in LU3, along with minor amounts of Ara, Gal, and Rha residues, where the Ara content was almost equal to the sum of Gal and Rha. The molar ratio of Xyl to GalA ( Table 2 48 48 Table 1 49 These observations are consistent with Safdar et al. (2020), who reported that flaxseed polysaccharides extracted by alkaline-acid extraction (AAE), hot water extraction (HWE), microwave-assisted extraction (MAE), and ultrasonic-assisted extraction (UAE) had comparable monosaccharide compositions, dominated by rhamnose (Rha, ~22%), followed by Glc, Gal, Xyl, Ara, Fuc, and GalA (~7–10%), indicating rhamnogalacturonan-I and xylogalacturonan [ 32 34 50 Extraction method strongly influences yield and composition. HWE, often combined with pH adjustment or auxiliary treatments, is widely used. Three-stage countercurrent HWE produced flaxseed pectin at 9.8% yield (80 °C, 30 min) [ 23 51 52 52 Safdar et al. (2020) reported yields of 6.44% (AAE), 8.96% (HWE), 7.01% (MAE), and 7.84% (UAE), with carbohydrate contents of 70–84% [ 32 34 50 33 34 Differences in yield, chemical composition, and DE depend not only on extraction, but also on cultivar and harvest conditions [ 50 53 54 Averrhoa bilimbi 55 56 57 37 58 59 60 53 54 Averrhoa bilimbi 55 57 Vargas et al. (2025) extracted apple pectins using CA and NADES (CA/Glc/water; lactic acid/Glc/water), yielding 2.5–12.2%, with >76% carbohydrates, UA > 50%, and DE > 50% [ 37 58 59 60 61 Figure 2 −1 62 63 −1 3 2 −1 62 Two intense bands centered at 1656 and 1538 cm −1 64 −1 3 63 −1 − 62 63 The band at 1238 cm −1 −1 −1 65 −1 66 −1 −1 67 −1 68 69 70 3.2. Homogeneity of LU3 The flaxseed cake polysaccharide product LU3, obtained by extraction in NADES (ChCl/CA, 1:1), was separated chromatographically on the lipophilic resin Sephadex LH-20. The collected samples were analyzed for carbohydrates, polyphenols, and proteins [ 42 44 45 Figure 3 Similar patterns were observed in the saccharide and polyphenolic profiles, although the peaks in the latter were less intense. Additional peaks in the polyphenolic profile were detected at elution volumes of approximately 18 and 21 mL. The protein profile exhibited a broad, flat peak corresponding to the carbohydrate and polyphenolic profiles. These results suggest the presence of polyphenol-polysaccharide conjugates in LU3. Gel permeation chromatography (GPC) was performed to determine the molecular size distribution of the LU3 sample ( Figure 4 3 3 The literature reports varying data on the molecular weight of polysaccharides isolated from linseed, mainly because the extraction type and method strongly influence the final product. In general, flaxseed polysaccharides are heteropolysaccharides, composed of homogalacturonan, arabinogalactans, and rhamnogalacturonan, which makes their structure quite complex [ 71 72 73 74 2 6 32 Based on a literature review, Fabre et al. (2015) determined that flaxseed pectins may correspond to chromatographic peaks between 1.7 × 10 4 6 6 6 33 The differences in the molecular weight of pectins appear to depend largely on the extraction or purification method used. 3.3. Physicochemical Properties of LU3 3.3.1. Morphology of LU3 Structural features of pectins are important for understanding the physical stability and performance of pectin-based materials, such as gels, films, and encapsulation matrices. Moreover, the morphological changes observed under different environmental conditions can provide useful insights for optimizing pectin functionality in systems where texture, surface properties, and integrity are critical, including controlled release carriers, edible coatings, and hydrogel scaffolds. SEM analysis allowed a detailed visualization of LU3 microstructure at high resolution, showing surface morphology, porosity, and the presence of fibrillar or particulate features of LU3 powder ( Figure 5 Figure 5 LU3 particles had an irregular shape, with sizes ranging from 36 to 216 µm. The surface of the particles appears coarse, with shallow wrinkles and a few lumps. Similar particle morphology has been reported for pectins derived from eggplant waste [ 75 76 Figure 5 77 3.3.2. Zeta Potential Profiles of LU3 Zeta potential analysis provides quantitative information on the surface charge and colloidal stability of pectin dispersions across different pH values and ionic strengths. High absolute ζ values (typically > |30| mV) are indicative of stable dispersions with strong electrostatic repulsion, reducing the risk of aggregation or flocculation. The pH-dependent zeta potential profiles for polyanions such as pectins reflect the degree of ionization of carboxyl groups, which is key for understanding interactions with ions, proteins, and other compounds. The influence of ionic strength on ζ has direct implications for pectin behavior in physiological, food, or formulation-relevant environments. Overall, a negative correlation was observed between LU3 surface charge and solution pH: as the pH increased, the zeta potential (ζ) decreased from ζ = –11.0 mV at pH 3.0 to ζ = –47.2 mV at pH 9.0. A similar trend was observed for LU3 dissolved in NaCl solutions, regardless of ionic strength, except that the lowest zeta potential was recorded at pH 10. This indicates that the deprotonation of carboxyl residues in GalA units within LU3 increases as pH rises above the pKa of the carboxyl group (~3.5) [ 78 Figure 6 The effect of ionic strength on LU3’s zeta potential further supports these findings. As ionic strength increases, the ζ becomes less negative, consistent with the electrochemical double-layer compression phenomenon: salt ions screen negative surface charges and reduce electrostatic repulsion. However, under acidic conditions, this effect diminishes, showing that protonation of carboxyl groups dominated over counterion interactions in determining surface charge. Compared with pH, ionic strength had a smaller effect on the charge density of LU3 than pH. At pH 3–4, similar ζ values were observed across solutions with low to moderate ionic strength (0–10 mM NaCl). At pH 5–6, this similarity was observed only at lower ionic strengths (0–1 mM). As ionic strength increased, the variation in ζ with pH diminished, suggesting that sodium counterions increasingly screened the negative charges on LU3 by sodium counterions. The average surface electric charge of LU3 was determined using dynamic light scattering combined with the microelectrophoresis technique and expressed as the zeta potential (ζ). The ζ values represent the sum of the individual surface charges of different functional groups in the biopolymer. The surface charge of LU3 was measured as a function of pH (3.0–10.0) and ionic strength (0.1–100 mM NaCl) ( Figure 6 To ensure clarity, the effect of ionic strength on the pH of LU3 was first examined: pH = 4.0 in water, 0.1 mM, and 10 mM NaCl; pH = 3.8 in 10 mM and 100 mM NaCl ( Figure 6 = 79 A similar trend in zeta potential behavior has been reported for banana passionfruit epicarp polysaccharides [ 78 Similar behavior has been observed for citrus polysaccharides [ 80 81 3.3.3. Static Viscosity Characteristic of LU3 LU3 is an example of a high-molecular-weight, high-methoxy pectin (HMP), and both of its structural properties contribute to the rigidity of the pectin chain, which corresponds to its higher viscosity [ 82 Figure 6 83 84 The results of this study suggest that LU3 is a promising candidate for use as a biomaterial in both the food and pharmaceutical industries. Its high galacturonic acid (GalA) content (>68%) contributes to a stable and uniform charge distribution along the pectin chain, enhancing its hydrophilic properties. Simultaneously, the low degree of methylation (DM) and minimal polyphenol content result in only a few hydrophobic regions. Moreover, the well-characterized structure of LU3 with pH-dependent charge behavior allows for predictable chemical and physical interactions with various materials. Therefore, further studies will focus on evaluating LU3 for its repulsive or attractive interactions with other biopolymers, ability to form ionic complexes, water retention and wetting properties, as well as rheological properties such as gelation capacity and viscosity modification, plasticizing effect, barrier properties, and ability to modify the release profile of different formulations. 4. Conclusions In this study, linseed cake polysaccharides were obtained with a focus on sustainable development. Extractions were performed using NADES solutions based on choline chloride and citric acid in various molar ratios. Particular attention was paid to obtaining a pectin-rich macromolecular product while adhering to the principles of sustainable development. Among the tested samples, the LU3 product was the most promising, showing the highest uronic acid content and the greatest proportion of uronic acids within the saccharide fraction. The NADES with a choline chloride/citric acid (ChCl/CA) molar ratio of 1:1 resulted in the highest pectin recovery and the lowest contamination, yielding a high-purity product. The high conductivity of this extraction medium correlated with its superior extraction efficiency. The most promising LU3 product underwent several spectrometric (UV-Vis, FT-IR) and chromatographic (GPC, LH-20, GC-MS) analyses. Additionally, the morphology of this product was characterized by scanning electron microscopy (SEM) with energy-dispersive spectroscopy (EDS). The behavior of this product under different pH and ionic strength conditions was assessed via zeta potential and viscosity measurements, which indicated typical polyelectrolyte behavior, confirming its anionic nature and potential to form stable colloidal systems. Owing to its well-characterized chemical properties, LU3 can be utilized as a novel material alongside commonly used polysaccharides such as cellulose, sodium alginate, or chitosan, as well as their chemically modified derivatives. It can serve as a plasticizer, humectant, or building block for local or systemic drug delivery systems, and can also be used in environmentally friendly food packaging to extend shelf life. Based on these findings, it can be concluded that NADES-assisted extraction appears to be a promising technology for recovering valuable biopolymers from oil industry by-products, aligning with current trends in the circular economy and sustainable development. Carefully selected NADES extraction conditions yield pectin suitable for specific applications, including emulsion stabilization, drug delivery, tissue engineering, and functional food development. Future studies will focus on isolating pure pectic fractions for detailed chemical analysis. For the fraction exhibiting the most promising characteristics, a structural proposal will be developed based on GC-MS analysis to determine monosaccharide composition, and NMR spectroscopy will provide insights into the linkages between saccharide subunits. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.M.-H. and I.P.-G.; Formal analysis, A.M.-H., E.G., M.T.-M., M.Z., R.B. and I.P.-G.; Investigation, A.M.-H., M.T.-M., M.Z., R.B. and I.P.-G.; Methodology, A.M.-H., M.T.-M., M.Z., R.B. and I.P.-G.; Project administration, I.P.-G.; Software, I.P.-G.; Supervision, I.P.-G.; Visualization, A.M.-H., E.G., M.T.-M., R.B. and I.P.-G.; Writing—original draft, A.M.-H., E.G., M.T.-M., M.Z., R.B. and I.P.-G.; Writing—review and editing, A.M.-H., M.T.-M., M.Z., R.B. and I.P.-G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. References 1. Qamar H. Ilyas M. Shabbir G. Irshad G. Nisar F. Abbas S.M. Ghias M. Arshad A.A. Flax: Ancient to modern food Pure Appl. Biol. 2019 8 2269 2276 10.19045/bspab.2019.80173 2. Food and Agriculture Organization of the United Nations (FAO) FAOSTAT, Crops and Livestock Products, (Flax, Raw or Retted, World, 2021) Available online: https://www.fao.org/faostat/en/#data/QCL/visualize (accessed on 1 April 2025) 3. Preisner M. Wojtasik W. Kulma A. Żuk M. Szopa J. Flax Fiber Kirk-Othmer Encyclopedia of Chemical Technology 5th ed. Akin D.E. John Wiley & Sons, Inc. Hoboken, NJ, USA 2014 Volume 11 1 32 10.1002/0471238961.0612012401110914.a01.pub2 4. Zhang T. Zhang Z. Wang X. Composition and Antioxidant Ability of Extract from Different Flaxseed Cakes and Its Application in Flaxseed Oil J. Oleo Sci. 2023 72 59 67 10.5650/jos.ess22181 36504188 5. Jhala A.J. Hall L.M. Flax ( Linum usitatissimum Aust. J. Basic Appl. Sci. 2010 4 4304 4312 6. Zhai S.S. Zhou T. Li M.M. Zhu Y.W. Li M.C. Feng P.S. Zhang X.F. Ye H. Wang W.C. Yang L. Fermentation of flaxseed cake increases its nutritional value and utilization in ducklings Poult. Sci. 2019 98 5636 5647 10.3382/ps/pez326 31237336 7. Sanmartin C. Taglieri I. Venturi F. Macaluso M. Zinnai A. Tavarini S. Botto A. Serra A. Conte G. Flamini G. Flaxseed Cake as a Tool for the Improvement of Nutraceutical and Sensorial Features of Sourdough Bread Foods 2020 9 204 10.3390/foods9020204 32079106 PMC7074573 8. Waszkowiak K. Gliszczyńska-Świgło A. Barthet V. Skręty J. Effect of Extraction Method on the Phenolic and Cyanogenic Glucoside Profile of Flaxseed Extracts and their Antioxidant Capacity J. Am. Oil Chem. Soc. 2015 92 1609 1619 10.1007/s11746-015-2729-x 26640278 PMC4661209 9. Chen H.H. Xu S.Y. Wang Z. Gelation properties of flaxseed gum J. Food Eng. 2006 77 295 303 10.1016/j.jfoodeng.2005.06.033 10. Puligundla P. Lim S. A Review of Extraction Techniques and Food Applications of Flaxseed Mucilage Foods 2022 11 1677 10.3390/foods11121677 35741874 PMC9223220 11. El-Aziz M.A. Haggag H.F. Kaluoubi M.M. Hassan L.K. El-Sayed M.M. Sayed A.F. Physical Properties of Ice Cream Containing Cress Seed and Flaxseed Mucilages Compared with Commercial Guar Gum Int. J. Dairy Sci. 2015 10 160 172 10.3923/ijds.2015.160.172 12. Basiri S. Haidary N. Shekarforoush S.S. Niakousari M. Flaxseed mucilage: A natural stabilizer in stirred yogurt Carbohydr. Polym. 2018 187 59 65 10.1016/j.carbpol.2018.01.049 29486845 13. Akl E.M. Abdelhamid S.M. Wagdy S.M. Salama H.H. Manufacture of Functional Fat-free Cream Cheese Fortified with Probiotic Bacteria and Flaxseed Mucilage as a Fat Replacing Agent Curr. Nutr. Food Sci. 2020 16 1393 1403 10.2174/1573401316666200227112157 14. Lai K.W. How Y.H. Ghazali H.M. Pui L.P. Preliminary evaluation of potential prebiotic capacity of selected legumes and seed mucilage on the probiotic strain Lactobacillus rhamnosus Asia-Pac. J. Mol. Biol. Biotechnol. 2021 29 60 72 10.35118/apjmbb.2021.029.1.07 15. Rodrigues F.J. Cedran M.F. Garcia S. Influence of Linseed Mucilage Incorporated into an Alginate-Base Edible Coating Containing Probiotic Bacteria on Shelf-Life of Fresh-Cut Yacon ( Smallanthus sonchifolius Food Bioprocess Technol. 2018 11 1605 1614 10.1007/s11947-018-2128-z 16. Treviño-Garza M.Z. Correa-Cerón R.C. Ortiz-Lechuga E.G. Solís-Arévalo K.K. Castillo-Hernández S.L. Gallardo-Rivera C.T. Arévalo Niño K. Effect of Linseed ( Linum usitatissimum Cucumis melo Coatings 2019 9 368 10.3390/coatings9060368 17. Lu Z. Saldaña M.D.A. Jin Z. Sun W. Gao P. Bilige M. Sun W. Layer-by-layer electrostatic self-assembled coatings based on flaxseed gum and chitosan for Mongolian cheese preservation Innov. Food Sci. Emerg. Technol. 2021 73 102785 10.1016/j.ifset.2021.102785 18. Fang S. Zhou Q. Hu Y. Liu F. Mei J. Xie J. Antimicrobial Carvacrol Incorporated in Flaxseed Gum-Sodium Alginate Active Films to Improve the Quality Attributes of Chinese Sea Bass ( Lateolabrax maculatus Molecules 2019 24 3292 10.3390/molecules24183292 31509981 PMC6766946 19. Parikh M. Maddaford T.G. Austria J.A. Aliani M. Netticadan T. Pierce G.N. Dietary Flaxseed as a Strategy for Improving Human Health Nutrients 2019 11 1171 10.3390/nu11051171 31130604 PMC6567199 20. DeLuca J.A.A. Garcia-Villatoro E.L. Allred C.D. Flaxseed Bioactive Compounds and Colorectal Cancer Prevention Curr. Oncol. Rep. 2018 20 59 10.1007/s11912-018-0704-z 29869224 21. Qian K.Y. Cui S.W. Wu Y. Goff H.D. Flaxseed gum from flaxseed hulls: Extraction, fractionation, and characterization Food Hydrocoll. 2012 28 275 283 10.1016/j.foodhyd.2011.12.019 22. Mali A.V. Padhye S.B. Anant S. Hegde M.V. Kadam S.S. Anticancer and antimetastatic potential of enterolactone: Clinical, preclinical and mechanistic perspectives Eur. J. Pharmacol. 2019 852 107 124 10.1016/j.ejphar.2019.02.022 30771348 PMC6938675 23. Ziolkovska A. Laws of flaxseed mucilage extraction Food Hydrocoll. 2012 26 197 204 10.1016/j.foodhyd.2011.04.022 24. Elshahed M.S. Miron A. Aprotosoaie A.C. Farag M.A. Pectin in diet: Interactions with the human microbiome, role in gut homeostasis, and nutrient-drug interactions Carbohydr. Polym. 2021 255 117388 10.1016/j.carbpol.2020.117388 33436217 25. Sultana N. Biological Properties and Biomedical Applications of Pectin and Pectin-Based Composites: A Review Molecules 2023 28 7974 10.3390/molecules28247974 38138464 PMC10745545 26. Lapomarda A. De Acutis A. Chiesa I. Fortunato G.M. Montemurro F. De Maria C. Mattioli Belmonte M. Gottardi R. Vozzi G. Pectin-GPTMS-Based Biomaterial: Toward a Sustainable Bioprinting of 3D Scaffolds for Tissue Engineering Application Biomacromolecules 2020 21 319 327 10.1021/acs.biomac.9b01332 31808680 27. Bostancı N.S. Büyüksungur S. Hasirci N. Tezcaner A. Potential of Pectin for Biomedical Applications: A Comprehensive Review J. Biomater. Sci. Polym. Ed. 2022 33 1866 1900 10.1080/09205063.2022.2088525 35699216 28. Mishra S.K. Banthia A.K. Majeed A.B.A. Pectin Based Formulations for Biomedical Applications: A Review Asian J. Pharm. Clin. Res. 2012 5 1 7 10.1002/9781118301234.ch1 29. Freitas C.M.P. Coimbra J.S.R. Souza V.G.L. Sousa R.C.S. Structure and Applications of Pectin in Food, Biomedical, and Pharmaceutical Industry: A Review Coatings 2021 11 922 10.3390/coatings11080922 30. Syarifuddin A. Muflih M.H. Izzah N. Fadillah U. Ainani A.F. Dirpan A. Pectin-Based Edible Films and Coatings: From Extraction to Application on Food Packaging towards Circular Economy—A Review Carbohydr. Polym. Technol. Appl. 2025 9 100680 10.1016/j.carpta.2025.100680 31. Dirpan A. Deliana Y. Ainani A.F. Irwan Bahmid N.A. Exploring the Potential of Pectin as a Source of Biopolymers for Active and Intelligent Packaging: A Review Polymers 2024 16 2783 10.3390/polym16192783 39408492 PMC11478618 32. Safdar B. Zhihua P. Xinqi L. Jatoi M.A. Rashid M.T. Influence of different extraction techniques on recovery, purity, antioxidant activities, and microstructure of flaxseed gum J. Food Sci. 2020 85 3168 3182 10.1111/1750-3841.15426 32888361 33. Fabre J.F. Lacroux E. Valentin R. Mouloungui Z. Ultrasonication as a highly efficient method of flaxseed mucilage extraction Ind. Crops Prod. 2015 65 354 360 10.1016/j.indcrop.2014.11.015 34. Yu X. Huang S. Yang F. Qin X. Nie C. Deng Q. Huang F. Xiang Q. Zhu Y. Geng F. Effect of microwave exposure to flaxseed on the composition, structure and techno-functionality of gum polysaccharides Food Hydrocoll. 2022 125 107447 10.1016/j.foodhyd.2021.107447 35. Wanasundara P.K.J.P.D. Shahidi F. Removal of flaxseed mucilage by chemical and enzymatic treatments Food Chem. 1997 59 47 55 10.1016/S0308-8146(96)00093-3 36. Tien N.N.T. Le N.L. Khoi T.T. Richel A. Optimization of microwave-ultrasound-assisted extraction (MUAE) of pectin from dragon fruit peels using natural deep eutectic solvents (NADES) J. Food Process. Preserv. 2022 46 e16117 10.1111/jfpp.16117 37. Gómez Vargas C. Ponce N.M.A. Stortz C.A. Fissore E.N. Bonelli P. Gonzalez C.M.O. Gerschenson L.N. Pectin obtention from agroindustrial wastes of Malus domestica Front. Chem. 2024 12 1504582 10.3389/fchem.2024.1504582 39834849 PMC11743659 38. Wang Y. Xu F. Cheng J. Wu X. Hu J. Li C. Li W. Xie N. Wang Y. He L. Natural Deep Eutectic Solvent-Assisted Extraction, Structural Characterization, and Immunomodulatory Activity of Polysaccharides from Paecilomyces hepiali Molecules 2022 27 8020 10.3390/molecules27228020 36432126 PMC9696976 39. Fatahi F. Tabaraki F. Deep eutectic solvent mediated extraction of polysaccharides and antioxidants from Persian manna Microchem. J. 2023 194 109336 10.1016/j.microc.2023.109336 40. Hayyan A. Samyudia A.V. Hashim M.A. Hizaddin H.F. Ali E. Hadj-Kali M.K. Aldeehani A.K. Alkandari K.H. Etigany H.T. Alajmi F.D.H. Application of deep eutectic solvent as novel co-solvent for oil extraction from flaxseed using sonoenergy Ind. Crops Prod. 2022 176 114242 10.1016/j.indcrop.2021.114242 41. Guo Q. Shan Z. Shao Y. Wang N. Qian K. Goff H.D. Wang Q. Cui S.W. Ding H.H. Conformational Properties of Flaxseed Rhamnogalacturonan-I and Correlation between Primary Structure and Conformation Polymers 2022 14 2667 10.3390/polym14132667 35808711 PMC9269093 42. Dubois M. Gilles K.A. Hamilton J.K. Rebers P.A. Smith F. Colorimetric Method for Determination of Sugars and Related Substances Anal. Chem. 1956 28 350 356 10.1021/ac60111a017 43. Blumenkrantz N. Asboe-Hansen O. New method for quantitative determination of uronic acids Anal. Biochem. 1973 54 484 489 10.1016/0003-2697(73)90377-1 4269305 44. Singleton V.L. Orthofer R. Lamuela-Raventós R.M. Analysis of total phenols and other oxidation substrates and antioxidants by mean of Folin–Ciocalteu reagent Methods Enzymol. 1999 299 152 178 10.1016/S0076-6879(99)99017-1 45. Lowry O.H. Rosebrough N.J. Farr A.L. Randall R.J. Protein Measurement with the Folin Phenol Reagent J. Biol. Chem. 1951 193 265 275 10.1016/S0021-9258(19)52451-6 14907713 46. Pettolino F.A. Walsh C. Fincher G.B. Bacic A. Determining the polysaccharide composition of plant cell walls Nat. Protoc. 2012 7 1590 1607 10.1038/nprot.2012.081 22864200 47. ISO 2555:2018 Plastics—Resins in the Liquid State or as Emulsions or Dispersions—Determination of Apparent Viscosity Using a Single Cylinder Type Rotational Viscometer Method ISO Geneva, Switzerland 2018 48. Yapo B.M. Pectic substances: From simple pectic polysaccharides to complex pectins—A new hypothetical model Carbohydr. Polym. 2011 86 373 385 10.1016/j.carbpol.2011.05.065 49. Alba K. Offiah V. Laws A.P. Falade K.O. Kontogiorgos V. Baobab polysaccharides from fruits and leaves Food Hydrocoll. 2020 106 105874 10.1016/j.foodhyd.2020.105874 50. Xu Z. Jiang N. Li M. Xia X. Xiang X. Flaxseed ( Linum usitatissimum Trends Food Sci. Technol. 2025 161 105035 10.1016/j.tifs.2025.105035 51. Ding H.H. Cui S.W. Goff H.D. Wang Q. Chen J. Han N.F. Soluble polysaccharides from flaxseed kernel as a new source of dietary fibres: Extraction and physicochemical characterization Food Res. Int. 2014 56 166 173 10.1016/j.foodres.2013.12.005 52. Manal M.A. Abd El-Kader A.E. Abozed S.S. Optimization of Flaxseed Cake Pectin Extraction and Shelf-Life Prediction Model for Pear Fruit Preserved by Pectin Eddible Coating Egypt. J. Chem. 2021 64 7481 7493 10.21608/EJCHEM.2021.74519.3678 53. Riyamol Kamaraj V. Jeevitha G.C. Mittal A. Arya R.K. Jackfruit waste utilization for production of pectin using natural deep eutectic solvents: A comparative study Biomass Convers. Biorefin. 2025 10.1007/s13399-025-06734-y 54. Pereira D.T. Méndez-Albiñana P. Mendiola J.A. Villamiel M. Cifuentes A. Martínez J. Ibáñez E. An eco-friendly extraction method to obtain pectin from passion fruit rinds ( Passiflora edulis Carbohydr. Polym. 2024 326 121578 10.1016/j.carbpol.2023.121578 38142064 55. Shafie M.H. Yusof R. Gan C. Deep eutectic solvents (DES) mediated extraction of pectin from Averrhoa bilimbi Carbohydr. Polym. 2019 216 303 311 10.1016/j.carbpol.2019.04.007 31047070 56. Zhang S. Wu J. Zheng J. Peng Y. Zhao J. Pan X. Lao F. Deep eutectic solvents/water systems in different pH for extracting pectin from mango peel: Analysis of physicochemical and structural properties Food Hydrocoll. 2025 168 111578 10.1016/j.foodhyd.2025.111578 57. Santra S. Das M. Karmaker S. Banerjee R. NADES assisted integrated biorefinery concept for pectin recovery from kinnow ( Citrus reticulate Int. J. Biol. Macromol. 2023 250 126169 10.1016/j.ijbiomac.2023.126169 37558023 58. Chen M. Falourd X. Lahaye M. Sequential natural deep eutectic solvent pretreatments of apple pomace: A novel way to promote water extraction of pectin and to tailor its main structural domains Carbohydr. Polym. 2021 266 118113 10.1016/j.carbpol.2021.118113 34044930 59. Chen M. Lahaye M. Natural deep eutectic solvents pretreatment as an aid for pectin extraction from apple pomace Food Hydrocoll. 2021 115 106601 10.1016/j.foodhyd.2021.106601 60. Rai P. Mishra B. Jayakrishnan U. Mukherjee A. Moulik S. Roy S. Kumari A. Ultrasonic cavitation assisted deep eutectic solvent extraction of pectin from waste sweet lime peel: Statistical optimization and energetic analysis Ind. Crops Prod. 2025 228 120895 10.1016/j.indcrop.2025.120895 61. Singh N. Kumar S. Patle D.S. Natural deep eutectic liquids as green solvents in intensified extraction of bioactive compounds from fruit wastes Environ. Prog. Sustain. Energy 2024 44 e14651 10.1002/ep.14651 62. Bleha R. Shevtsova T. Kružik V. Šorpilová T. Saloň I. Erban V. Brindza J. Brovarskyi V. Sinica A. Bee breads from Eastern Ukraine: Composition, physical properties and biological activities Czech J. Food Sci. 2019 37 9 20 10.17221/201/2018-CJFS 63. Güzel M. Akpınar Ö. Valorisation of fruit by-products: Production characterization of pectins from fruit peels Food Bioprod. Process. 2019 115 126 133 10.1016/j.fbp.2019.03.009 64. Sadat A. Corradini M.G. Joye I.J. Molecular spectroscopy to assess protein structures within cereal systems Curr. Opin. Food Sci. 2019 25 42 51 10.1016/j.cofs.2019.02.001 65. Kačuráková M. Capek P. Sasinková V. Wellner N. Ebringerová A. FT-IR study of plant cell wall model compounds: Pectic polysaccharides and hemicelluloses Carbohydr. Polym. 2000 43 195 203 10.1016/S0144-8617(00)00151-X 66. Liu X. Renard C.M.G.C. Bureau S. Le Bourvellec C. Revisiting the contribution of ATR-FTIR spectroscopy to characterize plant cell wall polysaccharides Carbohydr. Polym. 2021 262 117935 10.1016/j.carbpol.2021.117935 33838812 67. Zhu M. Huang R. Wen P. Song Y. He B. Tan J. Hao H. Wang H. Structural characterization and immunological activity of pectin polysaccharide from kiwano ( Cucumis metuliferus Carbohydr. Polym. 2021 254 117371 10.1016/j.carbpol.2020.117371 33357887 68. Filippov M.P. Practical infrared spectroscopy of pectic substances Food Hydrocol. 1992 6 115 142 10.1016/S0268-005X(09)80060-X 69. Masuda Y. Fukushima K. Fujii T. Miyazawa T. Low-frequency infrared bands and chain conformations of polypeptides Biopolym. Orig. Res. Biomol. 1969 8 91 99 10.1002/bip.1969.360080108 70. Han Y. Ling S. Qi Z. Shao Z. Chen X. Application of far-infrared spectroscopy to the structural identification of protein materials Phys. Chem. Chem. Phys. 2018 20 11643 11648 10.1039/C8CP00802G 29670960 71. Julakanti S. Charles A.P.R. Syed R. Bullock F. Wu Y. Hempseed polysaccharide ( Cannabis sativa Food Hydrocoll. 2023 143 108900 10.1016/j.foodhyd.2023.108900 72. Ozhimkova E. Uschapovsky I. Manaenkov O. Study of Varietal Differences in the Composition of Heteropolysaccharides of Oil Flax and Fiber Flax Polysaccharides 2023 4 78 87 10.3390/polysaccharides4010006 73. Guo M.Q. Hu X. Wang C. Ai L. Structure and solubility relationships Polysaccharides: Structure and Solubility Xu Z. InTech London, UK 2017 10.5772/66033 74. Goh K.K.T. Pinder D.N. Hall C.E. Hemar Y. Rheological and Light Scattering Properties of Flaxseed Polysaccharides Aqueous Solutions Biomacromolecules 2006 7 3098 3103 10.1021/bm060577u 17096537 75. Kazemi M. Khodaiyan F. Hosseini S.S. Utilization of Food Processing Wastes of Eggplant as a High Potential Pectin Source and Characterization of Extracted Pectin Food Chem. 2019 294 339 346 10.1016/j.foodchem.2019.05.063 31126472 76. Kazemi M. Khodaiyan F. Labbafi M. Hosseini S.S. Hojjati M. Pistachio Green Hull Pectin: Optimization of Microwave-Assisted Extraction and Evaluation of Its Physicochemical, Structural and Functional Properties Food Chem. 2019 271 663 672 10.1016/j.foodchem.2018.07.212 30236729 77. Zhao H. Kwak J.H. Zhang Z.C. Brown H.M. Arey B.W. Holladay J.E. Studying Cellulose Fiber Structure by SEM, XRD, NMR and Acid Hydrolysis Carbohydr. Polym. 2007 68 235 241 10.1016/j.carbpol.2006.12.013 78. Espinal-Ruiz M. Restrepo-Sánchez L.P. Narváez-Cuenca C.E. McClements D.J. Impact of Pectin Properties on Lipid Digestion under Simulated Gastrointestinal Conditions: Comparison of Citrus and Banana Passion Fruit ( Passiflora Tripartita mollissima) Pectins. Food Hydrocoll. 2016 52 329 342 10.1016/j.foodhyd.2015.05.042 79. Mahmoud M.H. Abu-Salem F.M. Azab D.E.S.H. A Comparative Study of Pectin Green Extraction Methods from Apple Waste: Characterization and Functional Properties Int. J. Food Sci. 2022 2022 2865921 10.1155/2022/2865921 36578434 PMC9792233 80. Al Jitan S. Scurria A. Albanese L. Pagliaro M. Meneguzzo F. Zabini F. Al Sakkaf R. Yusuf A. Palmisano G. Ciriminna R. Micronized Cellulose from Citrus Processing Waste Using Water and Electricity Only Int. J Biol. Macromol. 2022 204 587 592 10.1016/j.ijbiomac.2022.02.042 35157905 81. Sucheta Misra N.N. Yadav S.K. Extraction of Pectin from Black Carrot Pomace Using Intermittent Microwave, Ultrasound and Conventional Heating: Kinetics, Characterization and Process Economics Food Hydrocoll. 2020 102 105592 10.1016/j.foodhyd.2019.105592 82. Gharibzahedi S.M.T. Smith B. Guo Y. Ultrasound-Microwave Assisted Extraction of Pectin from Fig ( Ficus carica Carbohydr. Polym. 2019 222 114992 10.1016/j.carbpol.2019.114992 31320048 83. Begum R. Aziz M.G. Yusof Y.A. Saifullah M. Uddin M.B. Evaluation of Gelation Properties of Jackfruit ( Artocarpus heterophyllus Carbohydr. Polym. Technol. Appl. 2021 2 100160 10.1016/j.carpta.2021.100160 84. Li K. Zhu L. Li H. Zhu Y. Pan C. Gao X. Liu W. Structural Characterization and Rheological Properties of a Pectin with Anti-Constipation Activity from the Roots of Arctium lappa Carbohydr Polym. 2019 215 119 129 10.1016/j.carbpol.2019.03.051 30981336 Figure 1 Process of polysaccharides isolation from Linum usitatissimum Figure 2 FT-IR spectra for LU3 crude polysaccharides. Figure 3 Sephadex LH-20 chromatography of LU3 crude polysaccharide. Figure 4 Gel permeation chromatography of LU3 on Sephacryl S300 HR column. Estimated molecular masses are expressed as g/mol. Figure 5 SEM images of surface: LU3 particles ( A1 A3 C1 C3 B1 B3 Figure 6 Physicochemical properties of LU3: pH dependence on ionic strength ( A B C polymers-17-02532-t001_Table 1 Table 1 Colorimetric analysis of samples LU1-LU6 and conductivity and pH of extraction media solutions. Name of the Samples Extraction Medium Conductivity of Extraction Medium (mS/cm) pH of Extraction Medium Yield of Extraction (mg/g) Saccharides (wt%) Uronic Acids (wt%) Uronic Acids in Saccharide Part (wt%) Uronic Acids in Raw Material (mg/g) Polyphenols Proteins (wt%) LU1 H 2 0.0064 5.22 53.58 34.89 ± 1.36 14.35 ± 0.16 41.13 7.72 94.24 ± 10.80 14.52 ± 0.72 LU2 0:1 * 4.70 2.88 117.21 41.29 ± 2.20 24.41 ± 0.21 59.12 28.61 144.88 ± 3.03 12.00 ± 049 LU3 1:1 * 20.30 2.94 121.62 40.14 ± 1.92 30.33 ± 2.39 68.15 36.88 174.56 ± 11.35 11.46 ± 0.41 LU4 1:2 * 15.63 2.90 136.71 39.45 ± 1.56 24.64 ± 0.58 61.44 33.71 200.69 ± 16.02 12.18 ± 0.28 LU5 1:3 * 13.38 2.89 133.43 38.60 ± 0.75 23.15 ± 0.30 59.97 30.91 194.16 ± 16.77 13.01 ± 0.32 LU6 1:4 * 11.44 2.88 119.26 45.20 ± 1.21 24.37 ± 0.25 53.92 29.06 182.88 ± 8.52 11.95 ± 0.31 * Molar ratios of NADES components: choline chloride/citric acid. The extraction was performed in 10% ( m v polymers-17-02532-t002_Table 2 Table 2 Monosaccharide composition and degree of esterification of LU3.  Monosaccharides Composition (wt%) DM b Fuc Rha Ara Xyl Man Gal Glc GalA a 0.12 ± 0.01 3.06 ± 0.15 7.67 ± 0.38 11.90 ± 0.60 1.09 ± 0.05 3.08 ± 0.15 0.77 ± 0.24 68.31 ± 3.42 53 a m 43 b ",
  "metadata": {
    "Title of this paper": "Structural Characterization and Rheological Properties of a Pectin with Anti-Constipation Activity from the Roots of ",
    "Journal it was published in:": "Polymers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473933/"
  }
}