{
  "title": "Paper_72",
  "abstract": "pmc Ther Adv Infect Dis Ther Adv Infect Dis 2354 tai TAI Therapeutic Advances in Infectious Disease 2049-9361 2049-937X SAGE Publications PMC12489215 PMC12489215.1 12489215 12489215 10.1177/20499361251380642 10.1177_20499361251380642 1 Harm Reduction at the Intersection of Infectious Diseases and Substance Use Review Integrating harm reduction and addiction care in HIV prevention among persons who inject drugs in the United States—a narrative review https://orcid.org/0009-0006-3605-8724 Yang Wei-Teng Division of Infectious Diseases, Department of Medicine, Perelman School of Medicine, University of Pennsylvania, 3F Silverstein, Suite E, 3400 Spruce Street, Philadelphia, PA 19104, USA Center for Addiction Medicine and Policy, University of Pennsylvania, Philadelphia, PA, USA Conceptualization Methodology Writing – original draft Writing – review & editing Wei-Teng.Yang@Pennmedicine.upenn.edu 1 10 2025 Jan-Dec 2025 12 478819 20499361251380642 21 11 2024 5 9 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s), 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage New human immunodeficiency virus (HIV) cases related to injection drug use (IDU) in the United States increased between 2016 and 2022. The uptake of preexposure prophylaxis (PrEP) is exceedingly low in persons who inject drugs (PWID) despite its efficacy to prevent HIV. There are multilevel barriers in the PrEP care cascade for PWID. We need a combination of effective HIV prevention strategies, including PrEP, treatment for substance use disorder, and syringe services programs (SSP) to reverse the trend. A major challenge is the lack of knowledge and skills in harm reduction practices and addiction care in the infectious disease (ID) workforce. ID clinicians could benefit from education in harm reduction and addiction, including taking on the responsibility of prescribing buprenorphine or navigating the resources for it. Addiction clinicians could benefit from education on PrEP and related program implementation knowledge. Both specialties need to comprehensively evaluate and address the risks for HIV acquisition in PWID. We should create integrated clinical programs between ID and addiction. We should improve HIV screening for hospitalized PWID. We should expand low-barrier integrated clinics with flexible hours, walk-in appointments, same-day PrEP starts, and collocated laboratory and pharmacy services. Other entities that could provide integrated care include substance detoxification and rehabilitation programs, SSPs, opioid treatment programs (OTP), community pharmacies, and mobile health clinics. Long-acting injectable PrEP for PWID is an attractive option for HIV prevention, but robust implementation programs are necessary for roll-out. We still need to address upstream barriers to care for PWID, including stigma and health disparities. We need to continue to advocate for policy changes and funding for SSPs and OTPs to provide comprehensive HIV prevention. addiction harm reduction HIV MOUD PrEP PWID SSP pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Background Injection drug use (IDU) related new human immunodeficiency virus (HIV) cases in the United States (US) increased from 2016 to 2022,  1  2  3 4 5 4 6 7 4 8 While it is critical to improve PrEP uptake in PWID, we also need to increase the uptake of harm reduction interventions and addiction care. They are critical to prevent HIV in PWID and have been underutilized by the infectious disease (ID) workforce. One study showed that only half of 196 ID fellowship trainees received formal didactics around care of PWID, and medications for opioid use disorder (MOUD) were discussed in only one-third of these didactics.  9  10 This narrative review focuses on harm reduction and addiction care as effective non-antiretroviral HIV prevention strategies. It provides a primer on harm reduction practices and non-antiretroviral (ART) HIV prevention strategies in PWID. Subsequently, it reviews the barriers to addiction care, harm reduction services, and PrEP. Finally, it proposes strategies to integrate ID and addiction education and clinical care for comprehensive HIV risk assessment and prevention. Methods The author discretionarily selected articles highly relevant to the US substance use epidemic and HIV prevention in PWID and synthesized findings. In addition, abstracts from the Conference on Retroviruses and Opportunistic Infections  11  12 Harm reduction principles Harm reduction is central to addiction care, as the brain disease model of addiction views addiction as a chronic, relapsing-remitting disease.  13 14 15  16 Harm reduction principles were also defined for health conditions other than substance use disorders (SUD).  14 17 18 19 20 Table 1 21 22 Table 1. Harm reduction approaches for substance use disorder (SUD), diabetes, and tobacco smoking. Health condition SUD Diabetes Tobacco smoking Common complications Overdose; withdrawal; infectious complications DKA/HHS; diabetic foot infection; cardiovascular diseases COPD; cardiovascular diseases; cancer Traditional goal Abstinence from substances Diabetes control Smoking cessation Sample harm reduction goals * Decrease the use of substances; carry naloxone or have someone monitor while using substances to prevent overdose; safe injection practice to prevent infectious complications; ongoing engagement with treatment Realistic lifestyle modification: change to diet drinks; reduce high glycemic index food to a certain frequency and/or amount; exercise certain amount each week to reduce an agreed amount of weight in a set time Reduce daily number of cigarettes to an agreed number; consider products that do not contain tar, for example, electronic cigarettes * Harm reduction goals are person-centric and often vary by individual. Some common harm reduction goals are listed. COPD, chronic obstructive pulmonary disease; DKA, diabetic ketoacidosis; HHS, hyperglycemic hyperosmolar state. Non-ART HIV prevention strategies in PWID MOUD and syringe service programs (SSP) together have curbed HIV outbreaks and reduced the HIV seroprevalence.  23 Table 2 24 30 28 30 Table 2. HIV risk reduction among PWID through prevention strategy. Prevention strategy PrEP * Methadone  + ! SSP  + Risk reduction 49% overall; 74% for those with detectable drug levels 54% in unadjusted analyses; 40% in adjusted analyses 34% * Data derived from the only clinical trial of PrEP in PWID. + Data derived from meta-analysis. ! There is no direct data on incident rate reduction with the use of buprenorphine. HIV, human immunodeficiency virus; PrEP, preexposure prophylaxis; PWID, persons who inject drugs; SSP, syringe services programs. MOUD as HIV prevention There are three MOUDs approved by the Food and Drug Administration: buprenorphine, methadone, and naltrexone ( Table 3  31 32 33 Table 3. Comparisons between the three FDA-approved MOUDs. Factors to consider Buprenorphine Methadone Naltrexone Effect on opioid receptors Partial agonist Full agonist Antagonist Ceiling for respiratory suppression Yes No NA OUD treatment First-line First-line Highly selected patients Prescription Any clinician Only dispensed (not prescribed) in OTPs Any clinician Administration Taken on own Directly observed in OTPs Taken on own Pharmacological consideration Precipitated withdrawal QT prolongation Not to be used with opioid analgesics PDMP record Yes No * No Street value Yes Yes No * Rarely, when methadone is prescribed for chronic pain, it is reported by a pharmacy to the PDMP. FDA, Food and Drug Administration; MOUD, medication for opioid use disorder; NA, not applicable; OTP, opioid treatment program; OUD, opioid use disorder; PDMP, prescription drug monitoring program. Clinical pearls about MOUD In a large observational study, only methadone and buprenorphine were associated with a reduced risk of opioid overdose or opioid-related morbidity compared to naltrexone, inpatient/residential detoxification, or behavioral interventions.  34 Methadone can only be dispensed in federally regulated opioid treatment programs (OTP), also known as methadone clinics. Because it is dispensed from OTPs, it is not reported by pharmacies to the prescription drug monitoring programs (PDMP). Individuals visit OTPs for daily directly observed methadone therapy until they earn a varying number of days of methadone take-home doses. The highest allowed take-home methadone is 28 days worth. 35 36 Buprenorphine is the cornerstone of opioid use disorder (OUD) treatment outside of OTPs. It offers overdose prevention because of the ceiling effect for opioid-related respiratory suppression. In December 2022, the DATA 2000 waiver (X waiver) requirement to prescribe buprenorphine was eliminated,  37 38 39 40 41 It is important to note that while many PWID may eventually choose to take MOUD, some PWID do not intend to take them. For some PWID, abstinence from substances is not a goal. Harm reduction should be the goal to care for these PWID. SSP as HIV prevention SSPs are unique to PWID as they are access points to healthcare, in addition to syringe exchanges. SSPs were endorsed by the World Health Organization (WHO)  42  43  44 Many SSPs provide testing for HIV, viral hepatitis, and STIs, as well as offer PrEP. In addition to needles and syringes, SSPs offer supplies for safer consumption of substances and education for overdose prevention and safe injection. Lastly, SSPs also provide varying degrees of medical care, ranging from wound care, urgent care, to full-spectrum primary care. 45 46 SSPs are natural venues to provide MOUDs. Studies show interests from PWID to initiate buprenorphine in SSPs  47 48 49  49 Current challenges in preventing HIV in PWID There are multilevel barriers to access MOUD, 50 55 55 57 58 60 56 60 52 59  61  53 Barriers to MOUD Racial/ethnic disparity is particularly prominent, with White individuals having greater access to MOUD, especially buprenorphine. 52 62  63 36 64 65 Three important barriers related to methadone are worth noting. First, the standard starting dose (30–40 mg daily) for a new patient is much lower than the typical therapeutic dose range, regardless of the intensity of the patient’s opioid use. The dose escalation schedule is slow. Patients with heavy opioid use usually resort to illicit opioids until their methadone dose is therapeutic, which can take weeks to months. 35 66 69  36 Barriers to SSP The implementation and expansion of SSP in the US have been challenging. Historically, federal regulations prohibited funding to SSP, and the “war on drugs” ideology and “not in my backyard” mentality further contributed to stigma. 70 71  72  73 15 74 75 77  78  77 Of particular concern, many SSPs provide one-for-one syringe exchange and impose a limit on the number of syringes exchanged per day. These practices are not consistent with the best practice of need-based exchange,  79 Substances used in the current wave of epidemic add challenges to addiction care and harm reduction Illicitly manufactured fentanyl (IMF) and stimulants 80 81 The high potency and short duration of action of IMF make it more addictive and lead to more frequent injections. Increased injection frequency may have contributed to recent HIV outbreaks where SSP operations were robust. 82 85 86 87 PWID who inject stimulants face different challenges. The vasoconstrictive and analgesic effects of stimulants contribute to injection site injuries and increase the risk of infections. 88 89  90 91 92  89  93 Barriers to oral PrEP for PWID There is little research about the oral PrEP care cascade in PWID. 4 7 94 95 4 6 7 96 Most oral PrEP studies in PWID studied PrEP awareness, knowledge, risk perception, and willingness 4 7 97 105 100 103 110  111  112  113 94 99 104 105 107 108 114 Strategies proposed to address barriers to the PrEP care cascade include those on the individual level (such as education, risk-based discussions, problem-solving, motivational interviewing, and incentivized adherence  107  115  115  116 114 117  118  115 7 95 119 Barriers to LA-PrEP for PWID LA-PrEP (cabotegravir  120  121  122  123  124 120 125 There are still unanswered questions about using LA-PrEP in PWID. It may be challenging to monitor seroconversion in PWID who may not routinely keep appointments. Even in LA-PrEP trial settings, seroconversion on LA-PrEP was subtle, and the diagnoses of HIV infection were delayed.  126  127 128 129 Proposed integrated strategies for HIV prevention in PWID HIV prevention for PWID requires consideration of PrEP, MOUDs, SSPs, and a complement of behavioral interventions. PrEP should be offered as one component of a concerted response, but not to replace other HIV prevention strategies or be used in isolation. 85 95 In the following sections, the author proposes strategies to approach HIV prevention in PWID: comprehensive HIV risk assessment for PWID aided by checklists, cross-education between ID and addiction specialties, and integrated clinical care models. Comprehensive HIV risk assessment for PWID One-fifth to one-third of PWID are eligible for PrEP. 130 131  132 With respect to injection-related risks, clinicians should be familiar with injection equipment and harm reduction counseling 71 133 135 Table 4  136 Table 4. Safe injection practices—six moments of infection prevention. Moments Safe injection practices Syringe/needle acquisition before injection Use new syringe/needle for each injection; one syringe/needle for one person Water or acid to dissolve substance Use sterile water; use single-use sachet of citric or ascorbic acid (vitamin C); do not use lemon juice Cooker to prepare substance Use clean cooker; one cooker for one person Filtering impurity Use clean single-use cotton filter; one filter for one person Prepare the skin Handwashing; wipe the skin with an alcohol swab Syringe/needle disposal after injection Do not lick the needle; dispose in a sharp container Source: This framework is adapted from Harvey et al.  135 Studies have shown the complexity of injection equipment sharing. Two studies showed that, contrary to the traditional thoughts that cis-women often receive syringes from cis-men due to submissive roles in relationships, the equipment-sharing practices between heterosexual partners were both receptive and distributive by both genders. 137 138  139 140 141 With respect to sexual risks, it has been shown that many equipment-sharing partnerships are also sexual. 136 138 142  143  144 ID and SUD checklists for education and clinical care Checklists embedded in medical record templates with ID screening and SUD care components can be an effective tool to care for PWID. They have been used in office  134 145 147 It will be useful to modify the checklists to include sexual and injection risks to form a risk assessment tool. An earlier HIV risk assessment tool for PWID was developed with data from a cohort of older Black men in Baltimore during the heroin epidemic,  148  130 ID-addiction educational and clinical integration Clinical and educational integration between ID and addiction specialties is necessary to address HIV prevention in PWID. There are many mutual learning opportunities. 54 55 149 Addiction clinicians can be trained to increase PrEP uptake in outpatient 116 150  151  151 In addition, harm reduction counseling and addiction care should be core competencies for ID physicians. ID physicians should assume the responsibility of prescribing buprenorphine or navigating the prescription and care resources for PWID. They should have basic operational knowledge of OTPs, SSPs, and knowledge of available community resources for PWID. We need to systemically improve crossing education between ID and addiction. As such, we should strongly consider expanding combined ID/addiction 152 153 154 155 156 157 Integrated care delivery models in traditional healthcare settings In the inpatient setting, there are multiple potential interventions. First, we should capitalize on collocated pharmacy and laboratory services for buprenorphine and PrEP provision. 158 159  160 151 161 162 145 146 In the ambulatory setting, we should expand integrated addiction-ID low-barrier outpatient care models 145 159 163 165  158  146  53 Community pharmacies, 115 158  166 99 105 114 117 167 168  118 118 169 Finally, telemedicine may be a strategy to reach out to PWID for buprenorphine, harm reduction, and PrEP. A study providing buprenorphine, harm reduction services, and PrEP is ongoing,  114  170 Integrated care by mobile health clinics (MHCs) MHCs are “one-stop shop” care models to increase access to care. They provide buprenorphine, oral PrEP, and infectious diseases screening and treatment for PWID. They often provide navigation from peers or case managers. Some MHCs incorporate innovative features that potentially further improve are delivery to PWID. These features include an attached mobile retail pharmacy to an MHC with the capability of telemedicine visits with the clinicians,  119  171  172 Currently, no MHCs dispense methadone, and the ability to dispense methadone from MHCs may improve HIV prevention for PWID. Even with the intensive support in a clinical trial that provided integrated care with buprenorphine and PrEP or ART for PWID through MHCs,  171  173 174 175 A case study of integrated care amidst an HIV outbreak Aggressive comprehensive HIV prevention services and treatment-as-prevention  176 72 84 85 A realistic PEP-to-PrEP approach for PWID during an HIV outbreak is important for HIV prevention. A team from a low-barrier SUD clinic started at-risk PWID on PEP for 28 days, even if they were beyond the CDC-recommended 72-hour window since last exposure.  160  143 116 150 160 177 Additionally, the same team utilized same-day ART start, street directly observed PEP/PrEP, and linkage to addiction treatment to care for PWID during the outbreak.  177  177  150 Conclusion To reverse the upward trend of the HIV epidemic in PWID, a comprehensive approach utilizing addiction care, harm reduction practices, and PrEP is necessary. We need to fill ID clinicians’ knowledge gaps in addiction care and harm reduction counseling. The ability to prescribe buprenorphine or navigate addiction care and harm reduction resources should be core competencies for ID clinicians. We should evaluate HIV risk systemically through injection and sexual risks. We need to establish cross-training between ID and addiction communities. We should devise integrated HIV prevention programs geared at points of intervention identified in this review. We should advocate for policy changes and funding for SSPs and OTPs. LA-PrEP can be a useful HIV prevention tool for PWID if we can implement robust programs to support its roll-out. We still need to address upstream barriers for PWID, such as stigma and health disparities. The author thanks Drs. Helen Koenig and Jessica Meisner for their editing of and comments on the manuscript. Author’s note: ORCID iD: https://orcid.org/0009-0006-3605-8724 Declarations Ethics approval and consent to participate: Consent for publication: Author contributions: Wei-Teng Yang: Funding: The author declares that there is no conflict of interest. Availability of data and materials: References 1 CDC NCHHSTP AtlasPlus https://www.cdc.gov/nchhstp/about/atlasplus.html?CDC_AAref_Val=https://www.cdc.gov/nchhstp/atlas/index.htm 2024 accessed 2 August 2025 2 CDC Fast facts: HIV in the United States https://www.cdc.gov/hiv/data-research/facts-stats/index.html 2024 3 Choopanya K Martin M Suntharasamai P et al Antiretroviral prophylaxis for HIV infection in injecting drug users in Bangkok, Thailand (the Bangkok Tenofovir Study): a randomised, double-blind, placebo-controlled phase 3 trial Lancet 2013 381 9883 2083 2090 23769234 10.1016/S0140-6736(13)61127-7 4 Mistler CB Copenhaver MM Shrestha R. The Pre-exposure Prophylaxis (PrEP) care cascade in people who inject drugs: a systematic review AIDS Behav 2021 25 5 1490 1506 32749627 10.1007/s10461-020-02988-x PMC7858689 5 Streed CG Jr Morgan JR Gai MJ et al Prevalence of HIV preexposure prophylaxis prescribing among persons with commercial insurance and likely injection drug use JAMA Netw Open 2022 5 7 10.1001/jamanetworkopen.2022.21346 PMC9277489 35819784 6 Biello KB Bazzi AR Mimiaga MJ et al Perspectives on HIV pre-exposure prophylaxis (PrEP) utilization and related intervention needs among people who inject drugs Harm Reduct J 2018 15 1 55 30419926 10.1186/s12954-018-0263-5 PMC6233595 7 Biello KB Mimiaga MJ Valente PK et al The past, present, and future of PrEP implementation among people who use drugs Curr HIV/AIDS Rep 2021 18 4 328 338 33907971 10.1007/s11904-021-00556-z PMC8286349 8 National Institute of Mental Health Improving the HIV Pre-Exposure Prophylaxis (PrEP) Cascade https://www.nimh.nih.gov/funding/grant-writing-and-application-process/concept-clearances/2015/improving-the-hiv-pre-exposure-prophylaxis-prep-cascade 2015 accessed 15 September 2024 9 Vasishta S Jawa R Kurz S et al Infectious diseases fellowship training in caring for people who use drugs: a national assessment of an emerging training need Open Forum Infect Dis 2024 11 10 10.1093/ofid/ofae544 PMC11474980 39411220 10 Nolan NS Fracasso Francis SM Marks LR et al Harm reduction: a missing piece to the holistic care of patients who inject drugs Open Forum Infect Dis 2023 10 8 10.1093/ofid/ofad402 PMC10428197 37593531 11 Conference on Retroviruses and Opportunistic Infections https://www.croiconference.org/ 2025 accessed 20 April 2025 12 Association for Multidisciplinary Education and Research for Substance use and Addiction https://amersa.org/ 2025 accessed 20 April 2025 13 Volkow ND Koob GF McLellan AT. Neurobiologic advances from the brain disease model of addiction N Engl J Med 2016 374 4 363 371 26816013 10.1056/NEJMra1511480 PMC6135257 14 Hawk M Coulter RWS Egan JE et al Harm reduction principles for healthcare settings Harm Reduct J 2017 14 1 70 29065896 10.1186/s12954-017-0196-4 PMC5655864 15 Sue KL Fiellin DA. Bringing harm reduction into health policy – combating the overdose crisis N Engl J Med 2021 384 19 1781 1783 33983692 10.1056/NEJMp2103274 16 Salisbury-Afshar E Livingston CJ Bluthenthal RN. How should harm reduction be included in care continua for patients with opioid use disorder? AMA J Ethics 2024 26 7 10.1001/amajethics.2024.562 38958425 17 Gentsch AT Reed MK Cunningham A et al “Once I take that one bite”: the consideration of harm reduction as a strategy to support dietary change for patients with diabetes BMC Endocr Disord 2024 24 1 3 38166864 10.1186/s12902-023-01529-6 PMC10759378 18 Mann DM Palmisano J Lin JJ. A pilot randomized trial of technology-assisted goal setting to improve physical activity among primary care patients with prediabetes Prev Med Rep 2016 4 107 112 27413670 10.1016/j.pmedr.2016.05.012 PMC4929067 19 Hatsukami DK Carroll DM. Tobacco harm reduction: past history, current controversies and a proposed approach for the future Prev Med 2020 140 106099 32335031 10.1016/j.ypmed.2020.106099 PMC7581601 20 National Institute for Health and Care Excellence Tobacco: preventing uptake, promoting quitting and treating dependence https://www.nice.org.uk/guidance/ng209/chapter/Recommendations-on-treating-tobacco-dependence#supporting-people-who-do-not-want-or-are-not-ready-to-stop-smoking-in-one-go-to-reduce-their-harm 2021 accessed 4 November 2024 36745727 21 Hayhow BD Lowe MP. Addicted to the good life: harm reduction in chronic disease management Med J Aust 2006 184 5 235 237 16515435 10.5694/j.1326-5377.2006.tb00209.x 22 White ND Bautista V Lenz T et al Using the SMART-EST goals in lifestyle medicine prescription Am J Lifestyle Med 2020 14 3 271 273 32477026 10.1177/1559827620905775 PMC7232896 23 Des Jarlais DC Kerr T Carrieri P et al HIV infection among persons who inject drugs: ending old epidemics and addressing new outbreaks AIDS 2016 30 6 815 826 26836787 10.1097/QAD.0000000000001039 PMC4785082 24 Day CA Salmon A Jauncey M et al Twenty-one years at the uniting medically supervised injecting centre, Sydney: addressing the remaining questions Med J Aust 2022 217 8 385 387 36259283 10.5694/mja2.51716 PMC9826234 25 Dolan K Kimber J Fry C et al Drug consumption facilities in Europe and the establishment of supervised injecting centres in Australia Drug Alcohol Rev 2000 19 337 346 26 Kerr T Tyndall M Li K et al Safer injection facility use and syringe sharing in injection drug users Lancet 2005 366 9482 316 318 16039335 10.1016/S0140-6736(05)66475-6 27 Marshall BD Milloy MJ Wood E et al Reduction in overdose mortality after the opening of North America's first medically supervised safer injecting facility: a retrospective population-based study Lancet 2011 377 9775 1429 1437 21497898 10.1016/S0140-6736(10)62353-7 28 Chalfin A Del Pozo B Mitre-Becerril D. Overdose prevention centers, crime, and disorder in New York City JAMA Netw Open 2023 6 11 10.1001/jamanetworkopen.2023.42228 PMC10644216 37955901 29 Giglio RE Mantha S Harocopos A et al The nation’s first publicly recognized overdose prevention centers: Lessons learned in New York City J Urban Health 2023 100 2 245 254 37016269 10.1007/s11524-023-00717-y PMC10072795 30 McAteer JM Mantha S Gibson B et al NYC’s overdose prevention centers: data from the first year of supervised consumption services NEJM Catalyst Innov Care Deliv 2024 5 5 31 MacArthur GJ Minozzi S Martin N et al Opiate substitution treatment and HIV transmission in people who inject drugs: systematic review and meta-analysis BMJ 2012 345 10.1136/bmj.e5945 PMC3489107 23038795 32 Edelman EJ Chantarat T Caffrey S et al The impact of buprenorphine/naloxone treatment on HIV risk behaviors among HIV-infected, opioid-dependent patients Drug Alcohol Depend 2014 139 79 85 24726429 10.1016/j.drugalcdep.2014.03.006 PMC4029496 33 Woody GE Bruce D Korthuis PT et al HIV risk reduction with buprenorphine-naloxone or methadone: findings from a randomized trial J Acquir Immune Defic Syndr 2014 66 3 288 293 24751432 10.1097/QAI.0000000000000165 PMC4146664 34 Wakeman SE Larochelle MR Ameli O et al Comparative effectiveness of different treatment pathways for opioid use disorder JAMA Netw Open 2020 3 2 10.1001/jamanetworkopen.2019.20622 PMC11143463 32022884 35 Substance abuse and mental health services administration Notice of proposed rulemaking to update 42 CFR Part 8: medications for the treatment of opioid use disorder https://public-inspection.federalregister.gov/2022-27193.pdf 2022 accessed 12 November 2024 36 Frank D Mateu-Gelabert P Perlman DC et al “It’s like ‘liquid handcuffs”: the effects of take-home dosing policies on Methadone Maintenance Treatment (MMT) patients’ lives Harm Reduct J 2021 18 1 88 34391436 10.1186/s12954-021-00535-y PMC8364307 37 Federal register Medications for the treatment of opioid use disorder: removal of the DATA-2000 Waiver Requirements https://www.federalregister.gov/documents/2023/02/13/2023-03012/medications-for-the-treatment-of-opioid-use-disorder-removal-of-the-data-2000-waiver-requirements 2023 accessed 12 November 2024 38 Christine PJ Chahine RA Kimmel SD et al Buprenorphine prescribing characteristics following relaxation of X-waiver training requirements JAMA Netw Open 2024 7 8 10.1001/jamanetworkopen.2024.25999 PMC11301557 39102264 39 LeFevre N St Louis J Worringer E et al The end of the X-waiver: excitement, apprehension, and opportunity J Am Board Fam Med 2023 36 5 867 872 37704389 10.3122/jabfm.2023.230048R1 40 Leon-Barriera R Zwiebel SJ Modesto-Lowe V. A practical guide for buprenorphine initiation in the primary care setting Cleve Clin J Med 2023 90 9 557 564 37657832 10.3949/ccjm.90a.23022 41 Weimer MB Herring AA Kawasaki SS et al ASAM clinical considerations: buprenorphine treatment of opioid use disorder for individuals using high-potency synthetic opioids J Addict Med 2023 17 6 632 639 37934520 10.1097/ADM.0000000000001202 42 WHO Evidence for action technical papers: effectiveness of sterile needle and syringe programming in reducing HIV/AIDS among injection drug users Geneva, Switzerland WHO 2004 43 Javed Z Burk K Facente S et al Syringe services programs: a technical package of effective strategies and approaches for planning, design, and implementation Atlanta, GA, US Department of Health and Human Services, National Center for HIV/AIDS, Viral Hepatitis, STD and TB Prevention, Center for Disease, Control and Prevention 2020 44 Aspinall EJ Nambiar D Goldberg DJ et al Are needle and syringe programmes associated with a reduction in HIV transmission among people who inject drugs: a systematic review and meta-analysis Int J Epidemiol 2014 43 1 235 248 24374889 10.1093/ije/dyt243 45 Hinojosa C. Assessing need for primary care services at a needle exchange program: safe recovery National Ryan While Conference on HIV Care & Treatment Virtual presentation 2022 46 Montgomery MP Zhong Y Roberts E et al Vaccination barriers and opportunities at syringe services programs in the United States, June-August 2021-a cross-sectional survey Drug Alcohol Depend 2022 237 109540 35753280 10.1016/j.drugalcdep.2022.109540 PMC11287426 47 Fox AD Chamberlain A Frost T et al Harm reduction agencies as a potential site for buprenorphine treatment Subst Abus 2015 36 2 155 160 25837290 10.1080/08897077.2015.1011820 PMC4706457 48 Bachhuber MA Thompson C Prybylowski A et al Description and outcomes of a buprenorphine maintenance treatment program integrated within prevention point Philadelphia, an urban syringe exchange program Subst Abus 2018 39 2 167 172 29474119 10.1080/08897077.2018.1443541 PMC9333078 49 Jakubowski A Fowler S Fox AD. Three decades of research in substance use disorder treatment for syringe services program participants: a scoping review of the literature Addict Sci Clin Pract 2023 18 1 40 37301953 10.1186/s13722-023-00394-x PMC10256972 50 Barnett ML Meara E Lewinson T et al Racial inequality in receipt of medications for opioid use disorder N Engl J Med 2023 388 19 1779 1789 37163624 10.1056/NEJMsa2212412 PMC10243223 51 Cantor J Powell D Kofner A et al Population-based estimates of geographic accessibility of medication for opioid use disorder by substance use disorder treatment facilities from 2014 to 2020 Drug Alcohol Depend 2021 229 109107 34656034 10.1016/j.drugalcdep.2021.109107 PMC8981564 52 Goedel WC Shapiro A Cerda M et al Association of racial/ethnic segregation with treatment capacity for opioid use disorder in counties in the United States JAMA Netw Open 2020 3 4 10.1001/jamanetworkopen.2020.3711 PMC7177200 32320038 53 Springer SA Merluzzi AP Del Rio C. Integrating responses to the opioid use disorder and infectious disease epidemics: a report from the national academies of sciences, engineering, and medicine JAMA 2020 324 1 37 38 32159771 10.1001/jama.2020.2559 PMC7957328 54 Williams AR Nunes EV Bisaga A et al Development of a cascade of care for responding to the opioid epidemic Am J Drug Alcohol Abuse 2019 45 1 1 10 30675818 10.1080/00952990.2018.1546862 PMC6404749 55 Socias ME Volkow N Wood E. Adopting the ‘cascade of care’ framework: an opportunity to close the implementation gap in addiction care? Addiction 2016 111 12 2079 2081 27412876 10.1111/add.13479 PMC5321168 56 Acevedo A Panas L Garnick D et al Disparities in the treatment of substance use disorders: does where you live matter? J Behav Health Serv Res 2018 45 4 533 549 29435862 10.1007/s11414-018-9586-y PMC6087681 57 Dowell D Brown S Gyawali S et al Treatment for opioid use disorder: population estimates – United States, 2022 MMWR Morb Mortal Wkly Rep 2024 73 25 567 574 38935567 10.15585/mmwr.mm7325a1 PMC11254342 58 Kishore S Hayden M Rich J. Lessons from Scott county – progress or paralysis on harm reduction? N Engl J Med 2019 380 21 1988 1990 31042821 10.1056/NEJMp1901276 PMC10347881 59 Salow K Jack HE Tinsley J et al Racial disparities in use of syringe service programs in King County, WA: a comparison of two cross-sectional surveys Harm Reduct J 2023 20 1 133 37704989 10.1186/s12954-023-00868-w PMC10500904 60 Canary L Hariri S Campbell C et al Geographic disparities in access to syringe services programs among young persons with hepatitis C virus infection in the United States Clin Infect Dis 2017 65 3 514 517 28402431 10.1093/cid/cix333 61 Tyndall M Dodd Z. How structural violence, prohibition, and stigma have paralyzed North American responses to opioid overdose AMA J Ethics 2020 22 1 10.1001/amajethics.2020.723 32880362 62 Mark TL Goode SA McMurtrie G et al Improving research on racial disparities in access to medications to treat opioid use disorders J Addict Med 2023 17 3 249 257 37267162 10.1097/ADM.0000000000001104 63 Krawczyk N Joudrey PJ Simon R et al Recent modifications to the US methadone treatment system are a band-aid-not a solution-to the nation's broken opioid use disorder treatment system Health Aff Sch 2023 1 1 10.1093/haschl/qxad018 PMC10986206 38756842 64 Madras BK Ahmad NJ Wen J et al Improving access to evidence-based medical treatment for opioid use disorder: strategies to address key barriers within the treatment system NAM Perspect 2020 2020 10.31478/202004b PMC8916813 35291732 65 Simon C Vincent L Coulter A et al The methadone manifesto: treatment experiences and policy recommendations from methadone patient activists Am J Public Health 2022 112 S2 10.2105/AJPH.2021.306665 PMC8965191 35349312 66 Donny EC Brasser SM Bigelow GE et al Methadone doses of 100 mg or greater are more effective than lower doses at suppressing heroin self-administration in opioid-dependent volunteers Addiction 2005 100 10 1496 1509 16185211 10.1111/j.1360-0443.2005.01232.x 67 Fareed A Casarella J Roberts M et al High dose versus moderate dose methadone maintenance: is there a better outcome? J Addict Dis 2009 28 4 399 405 20155609 10.1080/10550880903183042 68 Moses TE Rhodes GL Tavakoli E et al Predictors of retention and drug use among patients with opioid use disorder transferred to a specialty “Second Chance” methadone program Subst Abuse 2022 16 10.1177/11782218221138335 PMC9669697 36407024 69 Strain EC Bigelow GE Liebson IA et al Moderate- vs high-dose methadone in the treatment of opioid dependence: a randomized trial JAMA 1999 281 11 1000 1005 10086434 10.1001/jama.281.11.1000 70 Broz D Carnes N Chapin-Bardales J et al Syringe services programs’ role in ending the HIV epidemic in the U.S.: why we cannot do it without them Am J Prev Med 2021 61 5 Suppl. 1 10.1016/j.amepre.2021.05.044 PMC11334402 34686281 71 Thakarar K Nenninger K Agmas W. Harm reduction services to prevent and treat infectious diseases in people who use drugs Infect Dis Clin North Am 2020 34 3 605 620 32782104 10.1016/j.idc.2020.06.013 PMC7596878 72 Peters PJ Pontones P Hoover KW et al HIV infection linked to injection use of oxymorphone in Indiana, 2014-2015 N Engl J Med 2016 375 3 229 239 27468059 10.1056/NEJMoa1515195 73 Van Handel MM Rose CE Hallisey EJ et al County-level vulnerability assessment for rapid dissemination of HIV or HCV infections among persons who inject drugs, United States J Acquir Immune Defic Syndr 2016 73 3 323 331 27763996 10.1097/QAI.0000000000001098 PMC5479631 74 Weinmeyer R. Needle exchange programs' status in US Politics AMA J Ethics 2016 18 3 252 257 27002996 10.1001/journalofethics.2016.18.3.hlaw1-1603 75 Davis CS Carr DH Samuels EA. Paraphernalia laws, criminalizing possession and distribution of items used to consume illicit drugs, and injection-related harm Am J Public Health 2019 109 11 1564 1567 31536408 10.2105/AJPH.2019.305268 PMC6775926 76 Fernandez-Vina MH Prood NE Herpolsheimer A et al State laws governing syringe services programs and participant syringe possession, 2014-2019 Public Health Rep 2020 135 1_suppl 10.1177/0033354920921817 PMC7407055 32735195 77 Chatterjee A Bannister M Hill LG et al Prescribing syringes to people who inject drugs: advancing harm reduction in primary care J Gen Intern Med 2023 38 8 1980 1983 37020124 10.1007/s11606-023-08183-7 PMC10271981 78 Hayes BT Favaro J Behrends CN et al NEXT: description, rationale, and evaluation of a novel internet-based mail-delivered syringe service program J Subst Use 2024 29 1 129 135 38577252 10.1080/14659891.2022.2144500 PMC10994146 79 Bluthenthal RN Clear A Des Jarlais DC et al Recommended best practices for effective syringe exchange programs in the United States: results of a consensus meeting New York, NY New York City Department of Health and Mental Hygiene 2009 80 CDC Understanding the Opioid Overdose Epidemic https://www.cdc.gov/overdose-prevention/about/understanding-the-opioid-overdose-epidemic.html 2024 accessed 5 November 2024 81 Ciccarone D. The triple wave epidemic: supply and demand drivers of the US opioid overdose crisis Int J Drug Policy 2019 71 183 188 30718120 10.1016/j.drugpo.2019.01.010 PMC6675668 82 Alpren C Dawson EL John B et al Opioid use fueling HIV Transmission in an urban setting: an outbreak of HIV infection among people who inject drugs-Massachusetts, 2015-2018 Am J Public Health 2020 110 1 37 44 31725317 10.2105/AJPH.2019.305366 PMC6893347 83 Kim MM Conyngham SC Smith C et al Understanding the intersection of behavioral risk and social determinants of health and the impact on an outbreak of human immunodeficiency virus among persons who inject drugs in Philadelphia J Infect Dis 2020 222 Suppl 5 10.1093/infdis/jiaa128 32877552 84 Lyss SB Buchacz K McClung RP et al Responding to outbreaks of Human Immunodeficiency Virus among persons who inject drugs-United States, 2016-2019: perspectives on recent experience and lessons learned J Infect Dis 2020 222 Suppl 5 10.1093/infdis/jiaa112 32877545 85 Strathdee SA Kuo I El-Bassel N et al Preventing HIV outbreaks among people who inject drugs in the United States: plus ca change, plus ca meme chose AIDS 2020 34 14 1997 2005 32826391 10.1097/QAD.0000000000002673 PMC7606503 86 Soares WE 3rd Schoenfeld E Friedmann PD. Precipitated withdrawal in the era of street fentanyl-the important thing is to not stop questioning JAMA Netw Open 2024 7 10.1001/jamanetworkopen.2024.35857 39331399 87 Thakrar AP Christine PJ Siaw-Asamoah A et al Buprenorphine-precipitated withdrawal among hospitalized patients using fentanyl JAMA Netw Open 2024 7 9 10.1001/jamanetworkopen.2024.35895 PMC11437388 39331392 88 Saldana CS Vyas DA Wurcel AG. Soft tissue, bone, and joint infections in people who inject drugs Infect Dis Clin North Am 2020 34 3 495 509 32782098 10.1016/j.idc.2020.06.007 PMC8757538 89 Harm Reduction International Brief paper: harm reduction for stimulant use https://www.hri.global/files/2019/04/28/harm-reduction-stimulants-coact.pdf 2019 accessed 13 November 2024 90 Foltin RW Haney M Rubin E et al Development of translational preclinical models in substance abuse: effects of cocaine administration on cocaine choice in humans and non-human primates Pharmacol Biochem Behav 2015 134 12 21 25933796 10.1016/j.pbb.2015.03.023 PMC5846106 91 Brener L Caruana T Broady T et al Addressing injecting related risks among people who inject both opioids and stimulants: findings from an Australian survey of people who inject drugs Addict Behav Rep 2022 15 100398 35005190 10.1016/j.abrep.2021.100398 PMC8717740 92 Sun R Sauda TH Hoopsick RA. Unmet needs and harm reduction preferences of syringe services program participants: differences by co-use of illicit opioids and methamphetamine Harm Reduct J 2024 21 1 119 38890736 10.1186/s12954-024-01038-2 PMC11186154 93 Clinical guideline committee The ASAM/AAAP clinical practice guideline on the management of stimulant use disorder J Addict Med 2024 18 1S Suppl 1 1 56 10.1097/ADM.0000000000001299 PMC11105801 38669101 94 Merle JL Zapata JP Quieroz A et al Pre-exposure prophylaxis (PrEP) among people who use drugs: a qualitative scoping review of implementation determinants and change methods Addict Sci Clin Pract 2024 19 1 46 38816889 10.1186/s13722-024-00478-2 PMC11138081 95 Shaw G Schaefer R Schmidt HA et al Pre-exposure prophylaxis (PrEP) for HIV prevention among people who inject drugs: a global mapping of service delivery Harm Reduct J 2023 20 1 16 36782321 10.1186/s12954-023-00729-6 PMC9924874 96 Motavalli D Taylor JL Childs E et al “Health Is on the Back Burner:” multilevel barriers and facilitators to primary care among people who inject drugs J Gen Intern Med 2021 36 1 10.1007/s11606-020-06201-6 PMC7858998 32918199 97 Shrestha R DiDomizio EE Kim RS et al Awareness about and willingness to use long-acting injectable pre-exposure prophylaxis (LAI-PrEP) among people who use drugs J Subst Abuse Treat 2020 117 108058 32811633 10.1016/j.jsat.2020.108058 PMC7438607 98 Hatch MA Laschober TC Paschen-Wolff M et al PrEP for people who use opioids: a NIDA clinical trials network survey study in Southern U.S. cities where HIV incidence is high Drug Alcohol Depend 2024 257 111133 38447393 10.1016/j.drugalcdep.2024.111133 PMC11131129 99 Roth AM Bartholomew TS Ward KM et al Preferential initiation of long-acting injectable versus oral HIV pre-exposure prophylaxis among women who inject drugs Clin Infect Dis 2025 80 3 621 625 39347705 10.1093/cid/ciae450 PMC11912968 100 Bazzi AR Bordeu M Baumgartner K et al Study protocol for an efficacy trial of the \"PrEP for Health\" intervention to increase HIV PrEP use among people who inject drugs BMC Public Health 2023 23 1 513 36932369 10.1186/s12889-023-15429-w PMC10021034 101 Richterman A Ghadimi F Teitelman AM et al Acceptability and feasibility of a mobile phone application to support HIV pre-exposure prophylaxis among women with opioid use disorder AIDS Behav 2023 27 10 3460 3467 37036593 10.1007/s10461-023-04060-w PMC10526719 102 Meyer J Price C Tracey D et al Preference for and efficacy of a PrEP decision aid for women with substance use disorders Patient Prefer Adherence 2021 15 1913 1927 34511887 10.2147/PPA.S315543 PMC8420782 103 Starks TJ Robles G Pawson M et al Motivational interviewing to reduce drug use and HIV incidence among young men who have sex with men in relationships and are high priority for pre-exposure prophylaxis (Project PARTNER): randomized controlled trial protocol JMIR Res Protoc 2019 8 7 10.2196/13015 PMC6637725 31274114 104 Brokus C Kattakuzhy S Gayle B et al Suboptimal uptake, retention, and adherence of daily oral prexposure prophylaxis among people with opioid use disorder receiving hepatitis c virus treatment Open Forum Infect Dis 2022 9 3 10.1093/ofid/ofab658 PMC8849288 35187191 105 Roth AM Tran NK Felsher M et al Integrating HIV preexposure prophylaxis with community-based syringe services for women who inject drugs: results from the project SHE demonstration study J Acquir Immune Defic Syndr 2021 86 3 10.1097/QAI.0000000000002558 PMC7878321 33148998 106 McMahon JM Braksmajer A Zhang C et al Syndemic factors associated with adherence to antiretroviral therapy among HIV-positive adult heterosexual men AIDS Res Ther 2019 16 1 32 31706357 10.1186/s12981-019-0248-9 PMC6842154 107 Sung ML Viera A Esserman D et al Contingency Management and Pre-Exposure Prophylaxis Adherence Support Services (CoMPASS): a hybrid type 1 effectiveness-implementation study to promote HIV risk reduction among people who inject drugs Contemp Clin Trials 2023 125 107037 36460267 10.1016/j.cct.2022.107037 PMC9918697 108 Mistler CB Shrestha R Gunstad J et al Application of the multiphase optimisation strategy (MOST) to optimise HIV prevention targeting people on medication for opioid use disorder (MOUD) who have cognitive dysfunction: protocol for a MOST study BMJ Open 2023 13 6 10.1136/bmjopen-2023-071688 PMC10314648 37399447 109 Roth AM. NCT05192434 https://clinicaltrials.gov/study/NCT05192434?cond=NCT05192434&rank=1#study-plan 2024 accessed 8 November 2024 110 Shrestha R Altice FL Sibilio B et al Rationale and design of an integrated bio-behavioral approach to improve adherence to pre-exposure prophylaxis and HIV risk reduction among opioid-dependent people who use drugs: the CHRP-BB study Contemp Clin Trials 2019 82 77 84 31229618 10.1016/j.cct.2019.06.012 PMC6639056 111 Barry MP Austin EJ Bhatraju EP et al Qualitative inquiry into perceptions of HIV pre-exposure prophylaxis among people who inject drugs living with hepatitis C in Seattle, WA, USA Harm Reduct J 2022 19 1 121 36320005 10.1186/s12954-022-00706-5 PMC9628120 112 Gillespie G Carstens RP Zang X et al Safety and pharmacokinetics of MK-8527, a novel nRTTI, in adults without HIV Conference on Retroviruses and Opportunistic Infections Denver, USA 2024 113 Eger WH Bazzi AR Valasek CJ et al HIV pre-exposure prophylaxis programmatic preferences among people who inject drugs: findings from a discrete choice experiment Addict Sci Clin Pract 2024 19 81 10.1186/s13722-024-00505-2 PMC11555929 39533335 114 Bartholomew TS Plesons M Serota DP et al Project CHARIOT: study protocol for a hybrid type 1 effectiveness-implementation study of comprehensive tele-harm reduction for engagement of people who inject drugs in HIV prevention services Addict Sci Clin Pract 2024 19 1 21 38528570 10.1186/s13722-024-00447-9 PMC10964520 115 Khosropour CM Backus KV Means AR et al A pharmacist-led, same-day, HIV pre-exposure prophylaxis initiation program to increase PrEP uptake and decrease time to PrEP initiation AIDS Patient Care STDS 2020 34 1 1 6 31944854 10.1089/apc.2019.0235 PMC6983741 116 Biello KB Bazzi AR Vahey S et al Delivering preexposure prophylaxis to people who use drugs and experience homelessness, Boston, MA, 2018-2020 Am J Public Health 2021 111 6 1045 1048 33950728 10.2105/AJPH.2021.306208 PMC8101577 117 Bartholomew TS Andraka-Cristou B Totaram RK et al “We want everything in a one-stop shop”: acceptability and feasibility of PrEP and buprenorphine implementation with mobile syringe services for Black people who inject drugs Harm Reduct J 2022 19 1 133 36463183 10.1186/s12954-022-00721-6 PMC9719627 118 Jaiswal J Griffin M Hascher K et al Logistical facilitators and barriers to PrEP implementation in methadone clinic settings: provider and staff perspectives J Addict Med 2022 16 5 10.1097/ADM.0000000000000973 PMC9375804 35165229 119 Hill K Kuo I Shenoi SV et al Integrated care models: HIV and substance use Curr HIV/AIDS Rep 2023 20 5 286 295 37698755 10.1007/s11904-023-00667-9 PMC11034717 120 Spinelli MA Bisom-Rapp E Heise MJ et al High retention and adherence with rapid long-acting injectable PrEP implementation in an urban safety-net clinic population Clin Infect Dis 2025 80 5 1139 1142 39484783 10.1093/cid/ciae531 PMC12135906 121 Clinicaltrial.gov Study of Lenacapavir and Emtricitabine/Tenofovir Disoproxil Fumarate (F/ TDF) for Prevention of HIV in People Who Inject Drugs (HPTN 103) (PURPOSE 4) https://clinicaltrials.gov/study/NCT06101342 2024 accessed 10 November 2024 122 AVAC PrEPWatch: Products https://www.prepwatch.org/products/ 2024 accessed 10 November 2024 123 Walensky RP Baden LR. The real PURPOSE of PrEP - effectiveness, not efficacy N Engl J Med 2024 391 13 1246 1247 39046168 10.1056/NEJMe2408591 124 Keddem S Thatipelli S Caceres O et al Barriers and facilitators to long-acting injectable HIV pre-exposure prophylaxis implementation in primary care since its approval in the United States J Acquir Immune Defic Syndr 2024 95 4 370 376 38133586 10.1097/QAI.0000000000003370 PMC10932839 125 Perez A Nieves S Meisner J. Implementation of injectable cabotegravir/rilpivirine for treatment of human immunodeficiency virus in patients with substance use disorders at a syringe exchange clinic Open Forum Infect Dis 2024 11 11 10.1093/ofid/ofae640 PMC11565405 39553286 126 Landovitz RJ Delany-Moretlwe S Fogel JM et al Features of HIV infection in the context of long-acting cabotegravir preexposure prophylaxis N Engl J Med 2024 391 13 1253 1256 39046350 10.1056/NEJMc2402088 PMC11598663 127 Rojas Castro D Delabre RM Molina JM Give PrEP a chance: moving on from the \"risk compensation\" concept J Int AIDS Soc 2019 22 Suppl 6 10.1002/jia2.25351 PMC6715948 31468693 128 Marcus JL Katz KA Krakower DS et al Risk compensation and clinical decision making - the case of hiv preexposure prophylaxis N Engl J Med 2019 380 6 510 512 30726699 10.1056/NEJMp1810743 PMC6396306 129 Powell VE Gibas KM DuBow J et al Update on HIV preexposure prophylaxis: effectiveness, drug resistance, and risk compensation Curr Infect Dis Rep 2019 21 8 28 31227999 10.1007/s11908-019-0685-6 PMC8635937 130 Picard J Jacka B Hoj S et al Real-world eligibility for HIV pre-exposure prophylaxis among people who inject drugs AIDS Behav 2020 24 8 2400 2408 31997057 10.1007/s10461-020-02800-w PMC10710293 131 Smith DK Van Handel M Wolitski RJ et al Vital signs: estimated percentages and numbers of adults with indications for preexposure prophylaxis to prevent HIV Acquisition—United States, 2015 MMWR Morb Mortal Wkly Rep 2015 64 46 1291 1295 26606148 10.15585/mmwr.mm6446a4 132 CDC Preexposure prophylaxis for the prevention of HIV infection in the United States—2021 Update: a clinical practice guideline https://stacks.cdc.gov/view/cdc/112360 2021 accessed 26 September 2025 133 Chan CA Canver B McNeil R et al Harm reduction in health care settings Med Clin North Am 2022 106 1 201 217 34823731 10.1016/j.mcna.2021.09.002 134 Harvey L Taylor JL Assoumou SA et al Sexually transmitted and blood-borne infections among patients presenting to a low-barrier substance use disorder medication clinic J Addict Med 2021 15 6 461 467 34734572 10.1097/ADM.0000000000000801 PMC8569143 135 Harvey L Boudreau J Sliwinski SK et al Six moments of infection prevention in injection drug use: an educational toolkit for clinicians Open Forum Infect Dis 2022 9 2 10.1093/ofid/ofab631 PMC8794071 35097153 136 Morris MD Andrew E Tan JY et al Injecting-related trust, cooperation, intimacy, and power as key factors influencing risk perception among drug injecting partnerships PLoS One 2019 14 5 10.1371/journal.pone.0217811 PMC6544289 31150518 137 Syvertsen JL Robertson AM Strathdee SA et al Rethinking risk: gender and injection drug-related HIV risk among female sex workers and their non-commercial partners along the Mexico-U.S. border Int J Drug Policy 2014 25 5 836 844 24641906 10.1016/j.drugpo.2014.02.005 PMC4133300 138 Rich KM Zubiago J Murphy M et al The association of gender with receptive and distributive needle sharing among individuals who inject drugs Harm Reduct J 2022 19 1 108 36180917 10.1186/s12954-022-00689-3 PMC9524088 139 Mackesy-Amiti ME Falk J Latkin C et al Egocentric network characteristics of people who inject drugs in the Chicago metro area and associations with hepatitis C virus and injection risk behavior Harm Reduct J 2022 19 1 58 35655222 10.1186/s12954-022-00642-4 PMC9161656 140 Latkin CA Kuramoto SJ Davey-Rothwell MA et al Social norms, social networks, and HIV risk behavior among injection drug users AIDS Behav 2010 14 5 1159 1168 19466537 10.1007/s10461-009-9576-4 PMC2888806 141 Smith LR Strathdee SA Metzger D et al Evaluating network-level predictors of behavior change among injection networks enrolled in the HPTN 037 randomized controlled trial Drug Alcohol Depend 2017 175 164 170 28433895 10.1016/j.drugalcdep.2017.02.007 PMC5494981 142 Unger JB Kipke MD De Rosa CJ et al Needle-sharing among young IV drug users and their social network members: the influence of the injection partner's characteristics on HIV risk behavior Addict Behav 2006 31 9 1607 1618 16459023 10.1016/j.addbeh.2005.12.007 143 CDC HIV infection risk, prevention, and testing behaviors among persons who inject drugs—national HIV behavioral surveillance, 20 U.S. Cities, 2022 HIV Surveillance Special Report 35 February 2024 https://www.cdc.gov/hiv/library/reports/hiv-surveillance.html 2024 accessed 9 November 2024 144 Chueng TA Tookes HE McLaughlin M et al Injection and sexual behavior profiles among people who inject drugs in Miami, Florida Subst Use Misuse 2022 57 9 1374 1382 35686722 10.1080/10826084.2022.2083171 PMC9413019 145 Lewis S Liang SY Schwarz ES et al Patients with serious injection drug use-related infections who experience patient-directed discharges on oral antibiotics have high rates of antibiotic adherence but require multidisciplinary outpatient support for retention in care Open Forum Infect Dis 2022 9 2 10.1093/ofid/ofab633 PMC8801224 35106316 146 Serota DP Tookes HE Hervera B et al Harm reduction for the treatment of patients with severe injection-related infections: description of the Jackson SIRI Team Ann Med 2021 53 1 1960 1968 34726095 10.1080/07853890.2021.1993326 PMC8567885 147 Thakarar K Weinstein ZM Walley AY. Optimising health and safety of people who inject drugs during transition from acute to outpatient care: narrative review with clinical checklist Postgrad Med J 2016 92 1088 356 363 27004476 10.1136/postgradmedj-2015-133720 PMC4967553 148 Smith DK Pan Y Rose CE et al A brief screening tool to assess the risk of contracting HIV infection among active injection drug users J Addict Med 2015 9 3 226 232 25961495 10.1097/ADM.0000000000000123 PMC4449303 149 Springer SA Rio CD. Lessons learned from the response to the Human Immunodeficiency Virus epidemic that can inform addressing the opioid epidemic Infect Dis Clin North Am 2020 34 3 637 647 32782106 10.1016/j.idc.2020.06.015 PMC7414693 150 Braun HM Walter C Farrell N et al HIV exposure prophylaxis delivery in a low-barrier substance use disorder bridge clinic during a local HIV outbreak at the onset of the COVID-19 pandemic J Addict Med 2022 16 6 678 683 36383918 10.1097/ADM.0000000000000991 PMC9653062 151 Rozansky H Christine PJ Younkin M et al Addiction consult service involvement in PrEP and PEP delivery for patients who inject drugs admitted to an urban essential hospital Addict Sci Clin Pract 2024 19 1 77 39497126 10.1186/s13722-024-00502-5 PMC11533369 152 Boston Medical Center Combined Infectious Disease and Addiction Medicine Fellowship https://www.bumc.bu.edu/care/education-and-training-programs/care-program-fellowship-in-addiction-medicine/curriculum/combined-infectious-disease-and-addiction-medicine-fellowship/#:~:text=Boston%20Medical%20Center%20hosts%20the,Infectious%20Disease%20and%20Addiction%20Medicine 2024 accessed 6 November 2024 153 Serota DP Barocas JA Springer SA. Infectious complications of addiction: a call for a new subspecialty within infectious diseases Clin Infect Dis 2020 70 5 968 972 31420651 10.1093/cid/ciz804 PMC7319263 154 Kasaro MP Sindano N Chinyama M et al Integration of HIV prevention with sexual and reproductive health services: evidence for contraceptive options and HIV outcomes study experience of integrating oral pre-exposure HIV prophylaxis in family planning services in Lusaka, Zambia Front Reprod Health 2021 3 684717 36304051 10.3389/frph.2021.684717 PMC9580744 155 Wood BR Mann MS Martinez-Paz N et al Project ECHO: telementoring to educate and support prescribing of HIV pre-exposure prophylaxis by community medical providers Sex Health 2018 15 6 601 605 30318034 10.1071/SH18062 156 Komaromy M Duhigg D Metcalf A et al Project ECHO (Extension for Community Healthcare Outcomes): a new model for educating primary care providers about treatment of substance use disorders Subst Abus 2016 37 1 20 24 26848803 10.1080/08897077.2015.1129388 PMC4873719 157 Moriates C Boulton A Bottner R et al The Support Hospital Opioid Use Disorder Treatment (SHOUT) Texas program implementation strategy for expanding treatment for hospitalized adults with opioid use disorder J Subst Use Addict Treat 2025 168 209539 39395756 10.1016/j.josat.2024.209539 PMC11624051 158 McElyea J Bistransin K Bana S et al Impact of a clinical pharmacist within an HIV PrEP program for patients experiencing homelessness J Am Pharm Assoc 2023 63 1 324 329 10.1016/j.japh.2022.09.003 36184385 159 Kumbhakar RG Budak JZ Tao Y et al The impact of a walk-in Human Immunodeficiency Virus care model for people who are incompletely engaged in care: the moderate needs (MOD) Clinic Open Forum Infect Dis 2023 10 1 10.1093/ofid/ofac670 PMC9825197 36628059 160 Taylor JL Walley AY Bazzi AR. Stuck in the window with you: HIV exposure prophylaxis in the highest risk people who inject drugs Subst Abus 2019 40 4 441 443 31644387 10.1080/08897077.2019.1675118 PMC6938281 161 Bradford W Akselrod H Bassler J et al Hospitalization is a missed opportunity for HIV screening, pre-exposure prophylaxis, and treatment Addict Sci Clin Pract 2024 19 1 22 38528590 10.1186/s13722-024-00451-z PMC10964564 162 Westgard LK Sato T Bradford WS et al National HIV and HCV screening rates for hospitalized people who use drugs are suboptimal and heterogeneous across 11 US hospitals Open Forum Infect Dis 2024 11 5 10.1093/ofid/ofae204 PMC11093397 38746950 163 Dombrowski JC Ramchandani MS Golden MR. Implementation of low-barrier Human Immunodeficiency Virus Care: lessons learned from the max clinic in Seattle Clin Infect Dis 2023 77 2 252 257 37021670 10.1093/cid/ciad202 PMC10371304 164 Sweitzer S Giegold M Chen Y et al The CARES program: improving viral suppression and retention in care through a comprehensive team-based approach to care for people with HIV and complex psychosocial needs AIDS Patient Care STDS 2023 37 8 416 424 37566532 10.1089/apc.2023.0061 PMC10623061 165 Taylor JL Wakeman SE Walley AY et al Substance use disorder bridge clinics: models, evidence, and future directions Addict Sci Clin Pract 2023 18 1 23 37055851 10.1186/s13722-023-00365-2 PMC10101823 166 Assoumou SA Paniagua SM Gonzalez P et al HIV pre-exposure prophylaxis and buprenorphine at a drug detoxification center during the opioid epidemic: opportunities and challenges AIDS Behav 2021 25 8 2591 2598 33751315 10.1007/s10461-021-03220-0 PMC8531371 167 Martel-Laferriere V Feaster DJ Metsch LR et al M(2)HepPrEP: study protocol for a multi-site multi-setting randomized controlled trial of integrated HIV prevention and HCV care for PWID Trials 2022 23 1 341 35461260 10.1186/s13063-022-06085-3 PMC9034074 168 McKellar MS Des Marais AC Chen H et al Providing medication for opioid use disorder and HIV pre-exposure prophylaxis at syringe services programs via telemedicine: a pilot study Harm Reduct J 2024 21 1 69 38532395 10.1186/s12954-024-00983-2 PMC10967138 169 Springer SA Barocas JA Wurcel A et al Federal and state action needed to end the infectious complications of illicit drug use in the United States: IDSA and HIVMA's advocacy agenda J Infect Dis 2020 222 Suppl 5 10.1093/infdis/jiz673 PMC7467230 32877568 170 Bonett S Li Q Sweeney A et al Telehealth models for PrEP delivery: a systematic review of acceptability, implementation, and impact on the PrEP care continuum in the United States AIDS Behav 2024 28 9 2875 2886 38856846 10.1007/s10461-024-04366-3 PMC11390827 171 Goodman-Meza D Shoptaw S Hanscom B et al Delivering integrated strategies from a mobile unit to address the intertwining epidemics of HIV and addiction in people who inject drugs: the HPTN 094 randomized controlled trial protocol (the INTEGRA Study) Trials 2024 25 1 124 38360750 10.1186/s13063-023-07899-5 PMC10870682 172 Springer SA Nijhawan AE Knight K et al Study protocol of a randomized controlled trial comparing two linkage models for HIV prevention and treatment in justice-involved persons BMC Infect Dis 2022 22 1 380 35428213 10.1186/s12879-022-07354-x PMC9013109 173 Andrew P El-Bassel N Shoptaw S et al Preliminary efficacy for HPTN 094: 26-week RCT of integrated strategies for people who inject drugs Conference of Retroviruses and Opportunistic Infections San Francisco, CA, USA 2025 174 Suen LW Steiger S Shapiro B et al “Get in and get out, get on with life”: patient and provider perspectives on methadone van implementation for opioid use disorder treatment Int J Drug Policy 2023 121 104214 37778132 10.1016/j.drugpo.2023.104214 175 Berk J. Commentary: mobile health units: paving the way for a new era of methadone treatment J Subst Use Addict Treat 2023 155 209160 37690526 10.1016/j.josat.2023.209160 PMC10841286 176 Cohen MS McCauley M Gamble TR. HIV treatment as prevention and HPTN 052 Curr Opin HIV AIDS 2012 7 2 99 105 22227585 10.1097/COH.0b013e32834f5cf2 PMC3486734 177 Brody J. HIV program response to Boston HIV cluster: data trends 2019-2023 https://www.bhchp.org/blog/2019-2023-hiv-outcomes-at-bhchp/ 2023 accessed 13 September 2024 ",
  "metadata": {
    "Title of this paper": "HIV program response to Boston HIV cluster: data trends 2019-2023",
    "Journal it was published in:": "Therapeutic Advances in Infectious Disease",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489215/"
  }
}