{
  "title": "Paper_1188",
  "abstract": "pmc Biology (Basel) Biology (Basel) 2312 biology biology Biology 2079-7737 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467164 PMC12467164.1 12467164 12467164 41007303 10.3390/biology14091159 biology-14-01159 1 Review Nutraceutical Interception of Cachexia: Grape-Derived Compounds as Pathophysiological Network Modulators https://orcid.org/0009-0005-3845-0618 Verdi Anderson Matheus Oliveira Haas 1 Rizzardi Mariana Lemos 1 https://orcid.org/0000-0001-6990-7725 Soares Jaqueline Machado 2 https://orcid.org/0000-0002-0998-8161 Schiessel Dalton Luiz 3 https://orcid.org/0000-0001-7373-1953 Coletti Dario 4 5 Seelaender Marilia Cerqueira Leite 6 https://orcid.org/0000-0003-0427-0174 Gonçalves Daniela Caetano 7 * Seong Seung-Yong Academic Editor 1 anderson.verdi@unifesp.br marianarizzardi@gmail.com 2 nutrijaquesoares@gmail.com 3 dalton@unicentro.br 4 dario.coletti@uniroma1.it 5 6 seelaender@usp.br 7 * daniela.caetano@unifesp.br 01 9 2025 9 2025 14 9 497617 1159 01 7 2025 12 8 2025 20 8 2025 01 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Cancer-associated cachexia is a complex syndrome marked by involuntary weight loss, muscle wasting, and systemic inflammation, especially prevalent among patients with colorectal cancer. Despite advances in cancer treatment, there is still no standard intervention capable of reversing this debilitating condition. In this context, grape seed polyphenols have gained attention for their anti-inflammatory, antioxidant, and microbiota-modulating properties. This review explores the biological effects of these compounds and their potential to modulate molecular pathways involved in muscle degradation and inflammation. Supported by experimental and clinical evidence, grape seed flour and extract emerge as promising, sustainable, and safe interventions that may complement multimodal strategies to manage cachexia. The use of grape by-products represents not only a functional nutritional resource but also an environmentally responsible alternative in cancer supportive care. Abstract Cancer cachexia is a multifactorial syndrome characterized by metabolic dysregulation, inflammation, and progressive loss of skeletal muscle mass. Frequently observed in colorectal cancer patients, it is associated with poor clinical outcomes and reduced treatment tolerance. Current therapies provide limited benefit, underscoring the need for integrative approaches. Grape seed polyphenols, particularly oligomeric proanthocyanidins, have demonstrated potential to modulate catabolic signaling, mitochondrial dysfunction, and inflammatory responses involved in cachexia pathophysiology. This review integrates preclinical and clinical evidence on the use of grape seed-derived products, highlighting their effects on NF-κB and AMPK pathways, redox homeostasis, and gut–muscle axis. Furthermore, the nutritional composition and bioactive properties of grape seed flour—rich in fiber and phenolic compounds—are discussed in the context of nutraceutical applications. A clinical trial currently underway in Brazil aims to evaluate the effects of grape seed flour supplementation in colorectal cancer patients with cachexia. Altogether, grape-derived compounds offer a safe, low-cost, and mechanistically grounded strategy for improving nutritional status and resilience in oncological care. inflammation muscle wasting nutritional support polyphenols proteolysis Fundação de Amparo à Pesquisa do Estado de São Paulo 2019/19988-2 Fundação Coordenação de Aperfeiçoamento de Pessoal de Nível Superior The authors would like to thank the “Fundação de Amparo à Pesquisa do Estado de São Paulo” (FAPESP 2019/19988-2) for the grant awarded to D.C.G.; the “Fundação Coordenação de Aperfeiçoamento de Pessoal de Nível Superior” (CAPES) for granting postgraduate scholarships to A.M.O.H.V., M.L.R., and J.M.S. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Colorectal cancer (CRC) remains one of the most prevalent malignancies worldwide, ranking third in incidence and second in cancer-related mortality, according to recent GLOBOCAN estimates [ 1 2 3 4 5 Despite advances in surgical techniques, chemotherapy, immunotherapy, and radiotherapy, standard CRC treatments often result in adverse effects such as mucositis, nausea, and anorexia [ 6 7 Cachexia is defined by involuntary weight loss, systemic inflammation, anorexia and progressive skeletal muscle wasting [ 8 9 10 11 In this context, there is growing interest in integrative therapeutic strategies capable of modulating both inflammation and muscle metabolism in the scenario. Among bioactive dietary compounds with therapeutic potential, polyphenols derived from grape seeds ( Vitis vinifera 12 13 14 15 16 This review aims to explore the molecular mechanisms involved in colorectal cancer-associated cachexia and to discuss the therapeutic potential of polyphenols derived from grape seeds, with an emphasis on the Vitis vinifera 2. Pathophysiology of Cancer-Associated Cachexia Cancer-associated cachexia is a multifactorial and progressive syndrome characterized by systemic inflammation, metabolic dysregulation, and functional decline [ 17 18 The pro-inflammatory environment—driven by cytokines such as Tumor Necrosis Factor-alpha (TNF-α), Interleukin-6 (IL-6), and Interferon-gamma (IFN-γ)—triggers widespread tissue degradation, particularly in skeletal muscle and adipose tissue [ 19 20 21 22 Multiorgan involvement is a hallmark of cachexia. In skeletal muscle, mitochondrial dysfunction, reduced oxidative capacity, and anabolic resistance impair contractile function [ 23 24 25 26 Gut microbiota alterations are also implicated in the pathophysiology of cachexia, with reductions in butyrate-producing bacteria compromising intestinal barrier integrity [ 27 28 29 30 31 Given the complexity of the syndrome, diagnosis is often difficult and to render it an easier task Fearon et al. [ 8 8 31 Cachexia is a common manifestation observed in various severe diseases, including cancer. As a result, a significant proportion of deaths associated with advanced-stage cancer can be attributed to cachexia rather than to the primary disease itself [ 32 2.1. Molecular Signaling Pathways in Cancer-Associated Cachexia Muscle alterations in cachexia involve multiple interconnected signaling pathways that regulate protein balance, mitochondrial function, and systemic inflammatory responses. The NF-κB pathway plays a central role in activating pro-catabolic genes, such as those related to the ubiquitin–proteasome system, and is stimulated by inflammatory cytokines, particularly TNF-α and interleukin-1 beta (IL-1β) [ 9 10 29 9 33 In contrast, the activated protein kinase (AMPK) pathway functions as an energy sensor, promoting metabolic adaptations that include the inhibition of anabolic processes under conditions of energy stress and the activation of mitochondrial biogenesis [ 10 34 35 36 37 38 An integrated understanding of these pathways is essential, as sustained activation of NF-κB and IL-6/STAT3, combined with suppression of AMPK and PGC-1α, creates a pro-catabolic, inflammatory, and energetically unfavorable environment for skeletal muscle, thereby perpetuating atrophy [ 9 10 33 34 35 36 37 38 39 40 41 Section 4 3. Intracellular and Extracellular Signaling Pathways in Cancer Cachexia Cancer-associated cachexia results from a coordinated disruption of signaling networks that maintain skeletal muscle and adipose tissue homeostasis [ 8 9 10 Section 2.1 Downstream, transcription factors including NF-κB, STAT3, and Smad2/3 upregulate atrogenes such as MuRF-1 and Atrogin-1, as well as autophagy-related genes like Beclin-1 [ 9 33 39 9 33 34 40 41 42 Mitochondrial dysfunction remains central to this catabolic network, with impaired biogenesis, oxidative stress, and Dynamin-related protein 1 (DRP1)-mediated fission disrupting energy homeostasis and regenerative capacity [ 10 41 43 43 This redundant signaling network contributes to the resistance of cachexia in the face of standard therapies. Therefore, interventions targeting IL-6R, ActRIIB, NF-κB, or Smad2/3 are under investigation [ 10 44 45 The contemporary perspective on the role of reactive oxygen species (ROS) has evolved. Rather than being seen merely as harmful byproducts, ROS are now recognized as essential mediators of cellular signaling. Under physiological conditions, controlled fluctuations in oxidant levels constitute “oxidative eustress,” a beneficial state that triggers adaptive responses and maintains cellular function. This process operates within a homeodynamic range, a kind of “zone of equilibrium” [ 46 47 4. Perspectives in the Treatment of Cancer-Related Cachexia The search for an effective therapeutic approach to cachexia has been the focus of numerous studies. Although some of these have shown positive results in animal models, few have been successful in clinical trials. Recent studies have explored various pharmacological and multimodal interventions to address cachexia. Among candidate pharmacological strategies, several agents have been investigated for potential effects on inflammation, metabolism, and appetite regulation. A systematic review [ 48 48 49 p 49 Interventional studies using appetite stimulants such as megestrol acetate (a synthetic derivative of progesterone) and eicosapentaenoic acid have shown improvements in patients’ appetite, but there is limited evidence of significant clinical improvement [ 50 51 52 53 54 31 55 56 A systematic review and meta-analysis by Rezaei et al. [ 57 2 57 Although early nutritional intervention (assessment and counseling, with the goal of achieving a high-protein diet, containing 1.5 g/kg/day) and multidisciplinary (Pharmacological treatment, physical exercise programs, and psychosocial interventions) care are essential to minimize the deterioration of nutritional status, there is currently no standardized and widely accepted intervention for the treatment of cancer-associated cachexia [ 53 54 58 59 60 Among the most promising approaches, recent research has increasingly focused on multimodal interventions that combine nutritional, pharmacological, and physical strategies. To illustrate this approach, a phase 3 randomized trial investigated a multimodal intervention combining nutritional counseling with omega-3 supplementation, physical exercise, and NSAIDs in patients with cancer. The results showed that after 6 weeks, patients in the intervention group presented stabilized weight (mean change: 0.05 kg [SD 3.8]) compared to perceived weight loss in the standard care group (–0.99 kg [SD 3.2]; mean difference = –1.04 kg, 95% CI –2.02 to –0.06; p 2 2 p p 61 Similarly, a phase 2 trial assessed a comprehensive multimodal care including ibuprofen, omega-3 fatty acids, Bojungikki-tang (a traditional immune-modulating agent), oral nutritional supplements, physical training, and psychiatric counseling. After 12 weeks, the intervention group showed a non-significant median increase in lean body mass (+91 g vs. –295 g; p p 62 Additional evidence from Mantovani et al. [ 63 p p p 63 Despite the diversity of interventions evaluated, clinical outcomes remain limited, especially in terms of reversing muscle wasting and systemic inflammation. As it is clear that mere calorie increase in the diet does not result in improved symptoms [ 8 9 64 65 66 45 5. Grape Seed Flour: Origin, Processing, and Nutritional Composition The global wine and juice industry processes over 77 million tons of grapes annually, generating 20–30% of this mass as pomace. Within this byproduct, grape seeds represent 38–52% of dry weight and concentrate up to 70% of the pomace’s phenolic content [ 67 68 69 Grape seed flour (GSF) emerges as a paradigm of sustainable nutraceutical intervention, particularly for complex conditions like cachexia. The industrial processing of grapes creates a decentralized biorefinery system yielding this underutilized high-value coproduct [ 67 68 69 Nutritional analysis reveals GSF contains 38–42% dietary fiber (predominantly insoluble), 10–12% high-quality protein, 14–16% lipids rich in tocopherols, and 5–8% polyphenols, with oligomeric procyanidins constituting 60–70% of the phenolic fraction [ 70 71 72 73 74 75 76 Post-processing methods critically impact quality preservation. Freeze-drying maintains 15% greater antioxidant activity compared to conventional methods, while nitrogen-modified atmosphere packaging reduces polyphenol degradation to just 0.5% monthly versus 2.5% under ambient conditions [ 77 78 A crucial distinction exists between GSF and grape seed extract (GSE). While GSE, produced through solvent or supercritical CO 2 79 80 70 81 Collectively, these properties establish GSF as a multifunctional intervention supporting muscle preservation, oxidative stress reduction and chronic disease prevention [ 70 71 72 73 74 75 76 77 78 82 6. Polyphenols and Fiber in Grape Seeds Grape seeds are a rich source of both bioactive polyphenols and dietary fiber, offering complementary mechanisms that influence inflammation, oxidative stress, and gut–muscle axis regulation [ 81 81 83 81 84 85 84 86 Table 1 87 The dietary fiber in grape seeds, predominantly insoluble and lignin-bound, contributes to intestinal homeostasis and microbial modulation [ 88 89 90 85 The combined presence of polyphenols and fiber gives grape seeds a multifunctional nutritional profile, capable of modulating dysbiosis, restoring epithelial integrity, and influencing host metabolism via gut-derived metabolites. These interactions may enhance the systemic efficacy of grape seed supplementation, particularly in chronic inflammatory and catabolic conditions such as cancer cachexia [ 85 88 89 7. Digestion, Absorption, and Metabolism of Grape Seed Polyphenols The scientific literature remains inconclusive regarding the digestion, absorption, metabolism, and excretion of polyphenols. These processes are highly complex, primarily due to the diverse structural conformations of polyphenol molecules and their varying degrees of polymerization and conjugation [ 91 92 93 83 94 In the oral cavity, some in vitro studies have included α-amylase in simulated digestion models. This enzyme, abundant in saliva, is effectively inhibited by proanthocyanidins, whose activity decreases after digestion. Low-molecular-weight polyphenols are partially absorbed in the gastrointestinal tract, whereas high-molecular-weight tannins and certain low-molecular-weight polyphenols are transported to the large intestine. There, they are either excreted or metabolized by enterobacteria. Consequently, the stomach plays only a minor role in polyphenol absorption. Phenolic compounds then pass to the stomach and cecum in rodents, where they are degraded into oligomers, monomers, and additional metabolites due to the acidic environment of the gastric system. However, it remains unclear whether gastric acidity affects the total polyphenol content [ 83 91 92 93 95 Despite divergent findings across studies, it is hypothesized that the oral degradation of phenolic compounds varies according to their molecular type, interactions with other nutrients, and environmental factors related to food cultivation [ 83 92 94 In general, most dietary polyphenols are not absorbed in their active forms. They must first undergo enzymatic transformation—such as methylation, glucuronidation, or sulfation—resulting in methylated and glycosylated metabolites that exhibit increased intestinal bioavailability. Alternatively, they may be fermented by the host’s gut microbiota to become absorbable. Small phenolics and their metabolites are actively transported via membrane carriers, whereas larger oligomers undergo passive diffusion or endocytosis [ 96 91 92 Following hepatic metabolism, the resulting metabolites may be distributed to various organs, including the kidneys, lungs, and heart, where they may exert health-promoting effects. Nevertheless, only about 5–10% of total polyphenols are absorbed in the small intestine; the remainder accumulates in the large intestine and is excreted in the feces, resulting in low overall bioavailability. This limited absorption occurs because the body recognizes polyphenols as xenobiotics, thereby reducing their bioavailability compared to other nutrients [ 91 92 8. Experimental Evidence on Grape Polyphenols and Their Applicability to Cancer-Related Cachexia Preclinical studies involving grape-derived polyphenols—particularly grape seed extract (GSE) and grape seed flour (GSF)—have demonstrated pleiotropic effects on inflammatory (NF-κB), oxidative (Nrf2), and metabolic (AMPK/PGC-1α) pathways that are centrally involved in cachexia. However, the scarcity of models that integrate both tumor and muscle components—the so-called “tumor-gut-muscle axis”—requires a critical evaluation of the translational potential of these findings, especially in CRC, where intestinal dysbiosis and chemotherapy exacerbate systemic inflammation [ 97 The study conducted by Wang et al. [ 98 99 In contrast, Lambert et al. [ 100 Complementarily, Myburgh et al. [ 101 Similarly, Qin et al. [ 102 The study by Derry et al. [ 103 Although most studies use GSE, grape seed flour (GSF) offers relevant advantages, such as the presence of dietary fiber (38–42%), which favors gut microbiota modulation—an increasingly recognized mediator of the gut–muscle axis. This confers GSF the potential to act not only as an antioxidant and anti-inflammatory agent but also as a functional prebiotic. Table 2 9. Clinical Evidence and Safety Profile of Grape Seed Polyphenols To date, clinical studies involving grape polyphenols have focused on populations with dyslipidemia, metabolic syndrome, and aging. While these conditions share inflammatory and oxidative features with cancer cachexia, they do not include muscle-related outcomes or cancer patients [ 80 Kar et al. [ 80 104 A meta-analysis of 15 randomized clinical trials with GSE reported reductions in fasting glucose, LDL cholesterol, triglycerides, and CRP (−0.8 mg/L), but no effects on muscle strength or body composition. Notably, baseline CRP levels in participants were lower than those typically observed in cachectic patients (≥10 mg/L), which limits the inference of direct clinical benefit. Future trials could explore higher doses or combination therapies (e.g., with omega-3 fatty acids) to enhance potential synergistic effects [ 80 Unlike megestrol acetate—which acts as an orexigenic agent without preserving lean mass—or anamorelin—a ghrelin receptor agonist approved only in Japan—grape polyphenols exhibit a multimodal profile of action: they reduce inflammation via NF-κB inhibition, stimulate mitochondrial biogenesis via AMPK activation, and may restore the gut–muscle axis through dietary fiber intake. Despite this potential, three critical gaps remain. First, no study has evaluated the use of GSE or GSF in the perioperative period—a phase of accelerated catabolism. Second, there is a lack of studies using validated muscle biomarkers, such as urinary 3-methylhistidine or CT-based muscle mass assessment. Third, vulnerable populations—such as older adults with CRC (≥70 years), who represent the majority of cachectic patients—remain underrepresented in clinical research. Table 3 10. Potential Interventions with Grape Seed in the Management of Cachexia The pathology of cachexia can be understood as a consequence of this balance being disrupted, wherein the system crosses a critical threshold of redox stress signaling (RST), plunging into a state of chronic “oxidative distress.” This distress is characterized by an imbalance favoring oxidants, which leads to the disruption of signaling and molecular damage. In this context, the function of grape polyphenols must be reinterpreted in a more sophisticated manner. Instead of acting as mere antioxidants, whose indiscriminate action could lead to “reductive distress”—an equally detrimental condition caused by an excess of reductants—it is more likely that they function as modulators of redox homeodynamics. Their action would be to attenuate the supraphysiological levels of oxidants that characterize distress, while simultaneously preserving the physiological fluctuations necessary for beneficial eustress signaling. This ability to restore redox balance, rather than simply suppressing all oxidative activity, may be the key mechanism behind their potential effects on preserving muscle mass and function [ 46 47 Grape seed polyphenols, particularly oligomeric proanthocyanidins, have emerged as promising agents for modulating the multifactorial mechanisms underlying cancer-associated cachexia. A systematic review evaluated the effects of flavonoids on skeletal muscle mass, muscle function, and physical performance in adults with sarcopenia. Three studies demonstrated that flavonoids improved skeletal muscle mass, two showed enhanced muscle strength, and two reported better physical performance [ 106 107 108 According to these reviews, phenolic compounds influence skeletal muscle anabolic pathways—though overlapping studies limit sample size. These compounds exhibit a broad range of bioactivities, targeting critical nodes in metabolic dysregulation, immune response, and mitochondrial integrity [ 81 109 Mechanistically, proanthocyanidins inhibit nuclear translocation of NF-κB by stabilizing IκB-α and suppressing p65 phosphorylation, thereby reducing the expression of key pro-inflammatory cytokines such as TNF-α, IL-6, and IL-1β. Concurrently, they activate AMP-activated protein kinase (AMPK), a central metabolic sensor that promotes energy conservation and enhances autophagy regulation. This dual modulation restores energy balance and reduces muscle proteolysis [ 98 110 111 At the epigenetic level, polyphenols can modulate microRNAs involved in inflammation and muscle atrophy—including the induction of tumor suppressors miR-34a, miR-424, and miR-503, as well as effects on miR-155 and miR-663 [ 112 113 114 Some studies suggest that phenolic compounds exert positive effects on mitochondrial function, contributing to both free radical control and the promotion of mitochondrial biogenesis [ 115 35 36 37 38 In experimental models, PGC-1α overexpression mitigated mitochondrial dysfunction and induced mitochondrial proliferation, highlighting its therapeutic potential in energy-deficient conditions. Upregulation of this signaling pathway suggests that phenolic compounds may reverse mitochondrial dysfunction in skeletal muscle, supporting anabolic pathway maintenance in this tissue—despite some overlapping data across reviewed studies [ 35 37 38 Additionally, resveratrol stands out among phenolic compounds due to its ability to modulate multiple signaling pathways, including PGC-1α, SIRT1, mTOR, ERR-α, and AMPK [ 116 35 37 38 117 Figure 1 11. Future Perspectives Cancer cachexia remains a complex and treatment-refractory syndrome, characterized by profound metabolic alterations and progressive skeletal muscle loss. Despite advances in understanding its molecular basis, translation into effective treatments—particularly involving nutraceuticals—remains limited. Further randomized controlled trials are needed to confirm the potential benefits and to establish evidence-based recommendations for clinical use. Importantly, the low bioavailability of polyphenols remains a major limitation for clinical translation. Approaches such as optimized formulation strategies and consideration of microbiota-mediated metabolism may enhance systemic exposure and therapeutic efficacy in cancer cachexia. One major barrier is the methodological heterogeneity of clinical trials investigating bioactive compounds. Variations in extract standardization, dosage, intervention duration, and patient profiles hinder reproducibility and limit the formulation of evidence-based guidelines. Moreover, most studies are underpowered, with small and heterogeneous cohorts. To address these limitations, our research group in Brazil is currently conducting a randomized, triple-blind, placebo-controlled clinical trial (registered at Brazilian Registry of Clinical Trials (ReBEC): RBR-5p6nv8b) to evaluate the efficacy of grape seed flour (GSF) in attenuating perioperative weight loss in patients with CRC at pre-cachexia or cachexia stages [ 118 Inclusion criteria comprise adult patients with CRC scheduled for elective surgery, recent weight loss >5% in the previous six months or BMI < 20 kg/m 2 The trial aims to evaluate the attenuation of perioperative weight loss (primary outcome), as well as the preservation of fat-free mass, muscle strength, quality of life, anorexia, fatigue, and gastrointestinal symptoms (secondary outcomes). Standardized clinical monitoring includes inflammatory, metabolic, and nutritional biomarkers—all central to cachexia pathophysiology [ 14 119 The chosen dose of 8 g/day of GSF provides approximately 136.25 mg of total phenolic compounds, including proanthocyanidins, which represent the dominant active fraction. This dosage is aligned with existing evidence demonstrating both safety and potential biological effects. For instance, Kar et al. [ 80 120 121 This ongoing trial represents a critical step in evaluating the translational potential of GSF in cancer cachexia, with a rigorous design, clearly defined outcomes, and alignment with existing safety data. Its results may inform future clinical recommendations and stimulate further research on functional foods and phenolic-rich interventions as part of multimodal strategies to mitigate cachexia-related deterioration in oncologic patients. By integrating molecular, clinical, and nutritional data, this trial aims to provide robust translational evidence on the therapeutic potential of grape seed flour. The results may support the development of evidence-based nutritional strategies, contributing to a more integrative and personalized model of cancer care [ 61 122 Table 4 12. Conclusions Among emerging adjunctive strategies, grape seed flour stands out as a multifunctional compound with antioxidant, anti-inflammatory, and microbiota-modulating properties. While current clinical evidence is still preliminary, early findings suggest promising benefits in muscle preservation and overall patient resilience. Overcoming key limitations—such as low bioavailability, study design heterogeneity, and lack of standardization—will require well-powered, multicenter trials integrating molecular, nutritional, and functional endpoints. Interdisciplinary collaboration among oncologists, clinical nutritionists, and translational researchers will be essential to integrate evidence-based nutraceuticals into routine cancer care. In this context, grape seed-derived interventions offer a safe, scalable, and mechanistically sound strategy to mitigate cachexia progression and improve patient-centered outcomes. Acknowledgments During the preparation of this manuscript/study, the author(s) used the free version of ChatGPT 4.0 for the purposes of improving the English terminology and phrasing. The authors have reviewed and edited the output and take full responsibility for the content of this publication. The authors acknowledge the use of free vector resources from NIAID NIH BIOART and Pixabay [ 123 124 125 126 127 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.M.O.H.V., M.L.R. and D.C.G.; writing—original draft preparation, A.M.O.H.V., M.L.R. and J.M.S.; writing—review and editing, A.M.O.H.V., M.L.R., J.M.S., D.L.S., D.C., M.C.L.S. and D.C.G.; supervision, D.L.S., D.C. and M.C.L.S. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: 16S rRNA 16 Svedberg ribosomal RNA ALT Alanine Aminotransferase AMPK AMP-activated Protein Kinase AST Aspartate Aminotransferase CAAE Certificado de Apresentação para Apreciação Ética CRC Colorectal Cancer CRP C-reactive Protein CTCAE Common Terminology Criteria for Adverse Events DRP1 Dynamin-related Protein 1 EORTC QLQ-C30 European Organization for Research and Treatment of Cancer—Quality of Life Questionnaire—Core 30 EPA Eicosapentaenoic Acid ERR-α Estrogen-related Receptor Alpha EVs Extracellular Vesicles FACIT-F Functional Assessment of Chronic Illness Therapy—Fatigue Scale GLOBOCAN Global Cancer Observatory GSE Grape Seed Extract GSF Grape Seed Flour HDAC Histone Deacetylase IFN-γ Interferon gamma IGF-1 Insulin-like Growth Factor 1 IGFBP-3 Insulin-like Growth Factor Binding Protein 3 IL-1β Interleukin 1 beta IL-6 Interleukin 6 INCA Instituto Nacional de Câncer MFSI-SF Multidimensional Fatigue Symptom Inventory—Short Form mTORC1 Mechanistic Target of Rapamycin Complex 1 NF-κB Nuclear Factor kappa-light-chain-enhancer of activated B cells NSAIDs Non-Steroidal Anti-Inflammatory Drugs ORAC Oxygen Radical Absorbance Capacity PCNA Proliferating Cell Nuclear Antigen PGC-1α Peroxisome Proliferator-Activated Receptor Gamma Coactivator 1-alpha PTHrP Parathyroid Hormone-related Protein QoL Quality of Life RNA Ribonucleic Acid ReBEC Registro Brasileiro de Ensaios Clínicos SIRT1 Sirtuin 1 Smad2/3 SMAD Family Members 2 and 3 SOCS3 Suppressor of Cytokine Signaling 3 STAT3 Signal Transducer and Activator of Transcription 3 TNF-α Tumor Necrosis Factor alpha UNIFESP Universidade Federal de São Paulo UPS Ubiquitin-Proteasome System WAT White Adipose Tissue WMD Weighted Mean Difference References 1. Bray F. Ferlay J. Soerjomataram I. Siegel R.L. Torre L.A. Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2018 68 394 424 10.3322/caac.21492 30207593 2. DeSantis C.E. Miller K.D. Dale W. Mohile S.G. Cohen H.J. Leach C.R. Sauer A.G. Jemal A. Siegel R.L. Cancer statistics for adults aged 85 years and older, 2019 CA Cancer J. Clin. 2019 69 452 467 10.3322/caac.21577 31390062 PMC12103238 3. World Health Organization International Agency for Research on Cancer (IARC) World Cancer Report: Cancer Research for Cancer Prevention World Health Organization International Agency for Research on Cancer (IARC) Lyon, France 2020 Volume 199 4. Instituto Nacional de Câncer (INCA) Estimativa 2023: Incidência De Câncer No Brasil Instituto Nacional de Câncer (INCA) Rio de Janeiro-RJ, Brazil 2022 5. Instituto Nacional de Câncer (INCA) Câncer de cólon e reto 2023 Available online: https://www.gov.br/inca/pt-br/assuntos/cancer/numeros/estimativa/sintese-de-resultados-e-comentarios/cancer-de-colon-e-reto (accessed on 16 December 2024) 6. Arends J. Bachmann P. Baracos V. Barthelemy N. Bertz H. Bozzetti F. Fearon K. Hütterer E. Isenring E. Kaasa S. ESPEN guidelines on nutrition in cancer patients Clin. Nutr. 2017 36 11 48 10.1016/j.clnu.2016.07.015 27637832 7. Dolin T.G. Mikkelsen M.K. Jakobsen H.L. Vinther A. Zerahn B. Nielsen D.L. Johansen J.S. Lund C.M. Suetta C. The prevalence of sarcopenia and cachexia in older patients with localized colorectal cancer J. Geriatr. Oncol. 2023 14 101402 10.1016/j.jgo.2022.11.001 36424269 8. Fearon K. Strasser F. Anker S.D. Bosaeus I. Bruera E. Fainsinger R.L. Jatoi A. Loprinzi C. MacDonald N. Mantovani G. Definition and classification of cancer cachexia: An international consensus Lancet Oncol. 2011 12 489 495 10.1016/S1470-2045(10)70218-7 21296615 9. Argilés J.M. Busquets S. Stemmler B. López-Soriano F.J. Cancer cachexia: Understanding the molecular basis Nat. Rev. Cancer 2014 14 754 762 10.1038/nrc3829 25291291 10. Baracos V.E. Martin L. Korc M. Guttridge D.C. Fearon K.C.H. Cancer-associated cachexia Nat. Rev. Dis. Primers 2018 4 17105 10.1038/nrdp.2017.105 29345251 11. Brown J.C. Meyerhardt J.A. Obesity and Energy Balance in GI Cancer J. Clin. Oncol. 2016 34 4217 4224 10.1200/JCO.2016.66.8699 27903148 PMC5544430 12. Bozzetti F. Forcing the vicious circle: Sarcopenia increases toxicity, decreases response to chemotherapy and worsens with chemotherapy Ann. Oncol. 2017 28 2107 2118 10.1093/annonc/mdx271 28911059 13. Ryan A.M. Power D.G. Daly L. Cushen S.J. Ní Bhuachalla Ē. Prado C.M. Cancer-associated malnutrition, cachexia and sarcopenia: The skeleton in the hospital closet 40 years later Proc. Nutr. Soc. 2016 75 199 211 10.1017/S002966511500419X 26786393 14. Muscaritoli M. the PreMiO Study Group Lucia S. Farcomeni A. Lorusso V. Saracino V. Barone C. Plastino F. Gori S. Magarotto R. Prevalence of malnutrition in patients at first medical oncology visit: The PreMiO study Oncotarget 2017 8 79884 79896 10.18632/oncotarget.20168 29108370 PMC5668103 15. Zhou Y. Zheng J. Li Y. Xu D.-P. Li S. Chen Y.-M. Li H.-B. Natural Polyphenols for Prevention and Treatment of Cancer Nutrients 2016 8 515 10.3390/nu8080515 27556486 PMC4997428 16. Talbert E.E. Cuitiño M.C. Ladner K.J. Rajasekerea P.V. Siebert M. Shakya R. Leone G.W. Ostrowski M.C. Paleo B. Weisleder N. Modeling Human Cancer-induced Cachexia Cell Rep. 2019 28 1612 1622.e4 10.1016/j.celrep.2019.07.016 31390573 PMC6733019 17. Tisdale M.J. Mechanisms of Cancer Cachexia Physiol. Rev. 2009 89 381 410 10.1152/physrev.00016.2008 19342610 18. Bodine S.C. Baehr L.M. Skeletal muscle atrophy and the E3 ubiquitin ligases MuRF1 and MAFbx/atrogin-1 Am. J. Physiol.-Endocrinol. Metab. 2014 307 E469 E484 10.1152/ajpendo.00204.2014 25096180 PMC4166716 19. Romanello V. Sandri M. Mitochondrial Quality Control and Muscle Mass Maintenance Front. Physiol. 2016 6 422 10.3389/fphys.2015.00422 26793123 PMC4709858 20. Powers S.K. Smuder A.J. Criswell D.S. Mechanistic Links Between Oxidative Stress and Disuse Muscle Atrophy Antioxid. Redox Signal. 2011 15 2519 2528 10.1089/ars.2011.3973 21457104 PMC3208252 21. Schiaffino S. Dyar K.A. Ciciliot S. Blaauw B. Sandri M. Mechanisms regulating skeletal muscle growth and atrophy FEBS J. 2013 280 4294 4314 10.1111/febs.12253 23517348 22. Das S.K. Eder S. Schauer S. Diwoky C. Temmel H. Guertl B. Gorkiewicz G. Tamilarasan K.P. Kumari P. Trauner M. Adipose Triglyceride Lipase Contributes to Cancer-Associated Cachexia Science 2011 333 233 238 10.1126/science.1198973 21680814 23. Tsoli M. Robertson G. Cancer cachexia: Malignant inflammation, tumorkines, and metabolic mayhem Trends Endocrinol. Metab. 2013 24 174 183 10.1016/j.tem.2012.10.006 23201432 24. Dumas J.-F. Peyta L. Couet C. Servais S. Implication of liver cardiolipins in mitochondrial energy metabolism disorder in cancer cachexia Biochimie 2013 95 27 32 10.1016/j.biochi.2012.07.009 22819940 25. Bindels L.B. Delzenne N.M. Muscle wasting: The gut microbiota as a new therapeutic target? Int. J. Biochem. Cell Biol. 2013 45 2186 2190 10.1016/j.biocel.2013.06.021 23831839 26. Bindels L.B. Beck R. Schakman O. Martin J.C. De Backer F. Sohet F.M. Dewulf E.M. Pachikian B.D. Neyrinck A.M. Thissen J.-P. Restoring Specific Lactobacilli Levels Decreases Inflammation and Muscle Atrophy Markers in an Acute Leukemia Mouse Model PLoS ONE 2012 7 e37971 10.1371/journal.pone.0037971 22761662 PMC3384645 27. Liu H. Xi Q. Tan S. Qu Y. Meng Q. Zhang Y. Cheng Y. Wu G. The metabolite butyrate produced by gut microbiota inhibits cachexia-associated skeletal muscle atrophy by regulating intestinal barrier function and macrophage polarization Int. Immunopharmacol. 2023 124 111001 10.1016/j.intimp.2023.111001 37804658 28. von Haehling S. Anker S.D. Treatment of Cachexia: An Overview of Recent Developments J. Am. Med. Dir. Assoc. 2014 15 866 872 10.1016/j.jamda.2014.09.007 25455531 29. Doyle A. Zhang G. Fattah E.A.A. Eissa N.T. Li Y. Toll-like receptor 4 mediates lipopolysaccharide-induced muscle catabolism via coordinate activation of ubiquitin-proteasome and autophagy-lysosome pathways FASEB J. 2011 25 99 110 10.1096/fj.10-164152 20826541 PMC3005430 30. Cosper P.F. Leinwand L.A. Cancer Causes Cardiac Atrophy and Autophagy in a Sexually Dimorphic Manner Cancer Res. 2011 71 1710 1720 10.1158/0008-5472.CAN-10-3145 21163868 PMC3049989 31. Garcia V.R. López-Briz E. Sanchis R.C. Perales J.L.G. Bort-Martí S. Megestrol acetate for treatment of anorexia-cachexia syndrome Cochrane Database Syst. Rev. 2013 2019 CD004310 10.1002/14651858.cd004310.pub3 PMC6418472 23543530 32. Ferrer M. Anthony T.G. Ayres J.S. Biffi G. Brown J.C. Caan B.J. Feliciano E.M.C. Coll A.P. Dunne R.F. Goncalves M.D. Cachexia: A systemic consequence of progressive, unresolved disease Cell 2023 186 1824 1845 10.1016/j.cell.2023.03.028 37116469 PMC11059056 33. Bonetto A. Aydogdu T. Jin X. Zhang Z. Zhan R. Puzis L. Koniaris L.G. Zimmers T.A. JAK/STAT3 pathway inhibition blocks skeletal muscle wasting downstream of IL-6 and in experimental cancer cachexia Am. J. Physiol.-Endocrinol. Metab. 2012 303 E410 E421 10.1152/ajpendo.00039.2012 22669242 PMC3423125 34. Egan D.F. Shackelford D.B. Mihaylova M.M. Gelino S. Kohnz R.A. Mair W. Vasquez D.S. Joshi A. Gwinn D.M. Taylor R. Phosphorylation of ULK1 (hATG1) by AMP-Activated Protein Kinase Connects Energy Sensing to Mitophagy Science 2011 331 456 461 10.1126/science.1196371 21205641 PMC3030664 35. Davinelli S. De Stefani D. De Vivo I. Scapagnini G. Polyphenols as Caloric Restriction Mimetics Regulating Mitochondrial Biogenesis and Mitophagy Trends Endocrinol. Metab. 2020 31 536 550 10.1016/j.tem.2020.02.011 32521237 36. Dumont S. Le Pennec S. Donnart A. Teusan R. Steenman M. Chevalier C. Houlgatte R. Savagner F. Transcriptional orchestration of mitochondrial homeostasis in a cellular model of PGC-1-related coactivator-dependent thyroid tumor Oncotarget 2018 9 15883 15894 10.18632/oncotarget.24633 29662614 PMC5882305 37. Komen J.C. Thorburn D.R. Turn up the power—Pharmacological activation of mitochondrial biogenesis in mouse models Br. J. Pharmacol. 2014 171 1818 1836 10.1111/bph.12413 24102298 PMC3976607 38. Srivastava S. Diaz F. Iommarini L. Aure K. Lombes A. Moraes C.T. PGC-1α/β induced expression partially compensates for respiratory chain defects in cells from patients with mitochondrial disorders Hum. Mol. Genet. 2009 18 1805 1812 10.1093/hmg/ddp093 19297390 PMC2722224 39. Sandri M. Sandri C. Gilbert A. Skurk C. Calabria E. Picard A. Walsh K. Schiaffino S. Lecker S.H. Goldberg A.L. Foxo Transcription Factors Induce the Atrophy-Related Ubiquitin Ligase Atrogin-1 and Cause Skeletal Muscle Atrophy Cell 2004 117 399 412 10.1016/S0092-8674(04)00400-3 15109499 PMC3619734 40. Zhao J. Brault J.J. Schild A. Cao P. Sandri M. Schiaffino S. Lecker S.H. Goldberg A.L. FoxO3 Coordinately Activates Protein Degradation by the Autophagic/Lysosomal and Proteasomal Pathways in Atrophying Muscle Cells Cell Metab. 2007 6 472 483 10.1016/j.cmet.2007.11.004 18054316 41. Romanello V. Guadagnin E. Gomes L. Roder I. Sandri C. Petersen Y. Milan G. Masiero E. Del Piccolo P. Foretz M. Mitochondrial fission and remodelling contributes to muscle atrophy EMBO J. 2010 29 1774 1785 10.1038/emboj.2010.60 20400940 PMC2876965 42. Sandri M. Protein breakdown in muscle wasting: Role of autophagy-lysosome and ubiquitin-proteasome Int. J. Biochem. Cell Biol. 2013 45 2121 2129 10.1016/j.biocel.2013.04.023 23665154 PMC3775123 43. de Castro G.S. Simoes E. Lima J.D. Ortiz-Silva M. Festuccia W.T. Tokeshi F. Alcântara P.S. Otoch J.P. Coletti D. Seelaender M. Human Cachexia Induces Changes in Mitochondria, Autophagy and Apoptosis in the Skeletal Muscle Cancers 2019 11 1264 10.3390/cancers11091264 31466311 PMC6770124 44. Zhou X. Wang J.L. Lu J. Song Y. Kwak K.S. Jiao Q. Rosenfeld R. Chen Q. Boone T. Simonet W.S. Reversal of Cancer Cachexia and Muscle Wasting by ActRIIB Antagonism Leads to Prolonged Survival Cell 2010 142 531 543 10.1016/j.cell.2010.07.011 20723755 45. Chedea V.S. Macovei Ș.O. Bocșan I.C. Măgureanu D.C. Levai A.M. Buzoianu A.D. Pop R.M. Grape Pomace Polyphenols as a Source of Compounds for Management of Oxidative Stress and Inflammation—A Possible Alternative for Non-Steroidal Anti-Inflammatory Drugs? Molecules 2022 27 6826 10.3390/molecules27206826 36296420 PMC9612310 46. Sies H. Mailloux R.J. Jakob U. Fundamentals of redox regulation in biology Nat. Rev. Mol. Cell Biol. 2024 25 701 719 10.1038/s41580-024-00730-2 38689066 PMC11921270 47. Sies H. Oxidative stress: A concept in redox biology and medicine Redox Biol. 2015 4 180 183 10.1016/j.redox.2015.01.002 25588755 PMC4309861 48. Bowers M. Cucchiaro B. Reid J. Slee A. Non-steroidal anti-inflammatory drugs for treatment of cancer cachexia: A systematic review J. Cachexia Sarcopenia Muscle 2023 14 2473 2497 10.1002/jcsm.13327 37750475 PMC10751445 49. Mehrzad V. Afshar R. Akbari M. Pentoxifylline treatment in patients with cancer cachexia: A double-blind, randomized, placebo-controlled clinical trial Adv. Biomed. Res. 2016 5 60 10.4103/2277-9175.179182 27135029 PMC4832883 50. Cao Z. Scott A.M. Hoogenraad N.J. Osellame L.D. Mediators and clinical treatment for cancer cachexia: A systematic review JCSM Rapid Commun. 2021 4 166 186 10.1002/rco2.30 51. Nishie K. Nishie T. Sato S. Hanaoka M. Update on the treatment of cancer cachexia Drug Discov. Today 2023 28 103689 10.1016/j.drudis.2023.103689 37385369 52. Avancini A. Trestini I. Tregnago D. Lanza M. Menis J. Belluomini L. Milella M. Pilotto S. A multimodal approach to cancer-related cachexia: From theory to practice Expert Rev. Anticancer Ther. 2021 21 819 826 10.1080/14737140.2021.1927720 33971783 53. Braha A. Albai A. Timar B. Negru Ș. Sorin S. Roman D. Popovici D. Nutritional Interventions to Improve Cachexia Outcomes in Cancer—A Systematic Review Medicina 2022 58 966 10.3390/medicina58070966 35888685 PMC9318456 54. Orsso C.E. Montes-Ibarra M. Findlay M. van der Meij B.S. de van der Schueren M.A.E. Landi F. Laviano A. Prado C.M. Mapping ongoing nutrition intervention trials in muscle, sarcopenia, and cachexia: A scoping review of future research J. Cachexia Sarcopenia Muscle 2022 13 1442 1459 10.1002/jcsm.12954 35301816 PMC9178172 55. López A.P. i Figuls M.R. Cuchi G.U. Berenstein E.G. Pasies B.A. Alegre M.B. Herdman M. Systematic review of megestrol acetate in the treatment of anorexia-cachexia syndrome J. Pain Symptom Manag. 2004 27 360 369 10.1016/j.jpainsymman.2003.09.007 15050664 56. Talebi S. Zeraattalab-Motlagh S. Barkhordar M. Vaezi M. Ghoreishy S.M. Ghavami A. Hosseini Y. Travica N. Mohammadi H. Dose-dependent effect of megestrol acetate supplementation in cancer patients with anorexia–cachexia syndrome: A meta-analysis J. Cachexia Sarcopenia Muscle 2024 15 1254 1263 10.1002/jcsm.13500 39031821 PMC11294013 57. Rezaei S. de Oliveira L.C. Ghanavati M. Shadnoush M. Akbari M.E. Akbari A. Hadizadeh M. Ardehali S.H. Wakabayashi H. Elhelali A. The effect of anamorelin (ONO-7643) on cachexia in cancer patients: Systematic review and meta-analysis of randomized controlled trials J. Oncol. Pharm. Pract. 2023 29 1725 1735 10.1177/10781552231189864 37525932 58. Roeland E.J. Bohlke K. Baracos V.E. Smith T.J. Loprinzi C.L. Panel F.T.C.C.E. Bruera E. del Fabbro E. Dixon S. Fallon M. Cancer Cachexia: ASCO Guideline Rapid Recommendation Update J. Clin. Oncol. 2023 41 4178 4179 10.1200/JCO.23.01280 37467399 59. Candow D.G. Chilibeck P.D. Forbes S.C. Fairman C.M. Gualano B. Roschel H. Creatine supplementation for older adults: Focus on sarcopenia, osteoporosis, frailty and Cachexia Bone 2022 162 116467 10.1016/j.bone.2022.116467 35688360 60. Setiawan T. Sari I.N. Wijaya Y.T. Julianto N.M. Muhammad J.A. Lee H. Chae J.H. Kwon H.Y. Cancer cachexia: Molecular mechanisms and treatment strategies J. Hematol. Oncol. 2023 16 54 10.1186/s13045-023-01454-0 37217930 PMC10204324 61. Solheim T.S. Laird B.J.A. Balstad T.R. Stene G.B. Baracos V. Bye A. Dajani O. Hendifar A.E. Strasser F. Chasen M.R. Results from a randomised, open-label trial of a multimodal intervention (exercise, nutrition and anti-inflammatory medication) plus standard care versus standard care alone to attenuate cachexia in patients with advanced cancer undergoing chemotherapy J. Clin. Oncol. 2024 42 LBA12007 10.1200/JCO.2024.42.17_suppl.LBA12007 62. Kim B.-H. Maeng C.H. Chon J. Kang W.S. Kang K. Woo M. Hong I.K. Lee J. Lee K.Y. Effect of multimodal intervention care on cachexia in patients with advanced cancer compared to conventional management (MIRACLE): An open-label, parallel, randomized, phase 2 trial J. Clin. Oncol. 2023 41 e24135 10.1200/JCO.2023.41.16_suppl.e24135 PMC8996396 35410294 63. Mantovani G. Macciò A. Madeddu C. Serpe R. Massa E. Dessì M. Panzone F. Contu P. Randomized Phase III Clinical Trial of Five Different Arms of Treatment in 332 Patients with Cancer Cachexia Oncologist 2010 15 200 211 10.1634/theoncologist.2009-0153 20156909 PMC3227938 64. Evans W.J. Morley J.E. Argilés J. Bales C. Baracos V. Guttridge D. Jatoi A. Kalantar-Zadeh K. Lochs H. Mantovani G. Cachexia: A new definition Clin. Nutr. 2008 27 793 799 10.1016/j.clnu.2008.06.013 18718696 65. Porporato P.E. Understanding cachexia as a cancer metabolism syndrome Oncogenesis 2016 5 e200 10.1038/oncsis.2016.3 26900952 PMC5154342 66. Argilés J.M. López-Soriano F.J. Stemmler B. Busquets S. Cancer-associated cachexia—Understanding the tumour macroenvironment and microenvironment to improve management Nat. Rev. Clin. Oncol. 2023 20 250 264 10.1038/s41571-023-00734-5 36806788 67. (OIV) IO of V and W State of the World Vine and Wine Sector in 2022 OIV Paris, France 2023 68. Fontana A.R. Antoniolli A. Bottini R. Grape Pomace as a Sustainable Source of Bioactive Compounds: Extraction, Characterization, and Biotechnological Applications of Phenolics J. Agric. Food Chem. 2013 61 8987 9003 10.1021/jf402586f 24004377 69. Dwyer K. Hosseinian F. Rod M. The Market Potential of Grape Waste Alternatives J. Food Res. 2014 3 91 10.5539/jfr.v3n2p91 70. Monagas M. Gómez-Cordovés C. Bartolomé B. Laureano O. da Silva J.M.R. Monomeric, Oligomeric, and Polymeric Flavan-3-ol Composition of Wines and Grapes from Vitis vinifera L. Cv. Graciano, Tempranillo, and Cabernet Sauvignon J. Agric. Food Chem. 2003 51 6475 6481 10.1021/jf030325+ 14558765 71. Beveridge T.H.J. Girard B. Kopp T. Drover J.C.G. Yield and Composition of Grape Seed Oils Extracted by Supercritical Carbon Dioxide and Petroleum Ether: Varietal Effects J. Agric. Food Chem. 2005 53 1799 1804 10.1021/jf040295q 15740076 72. Yilmaz Y. Toledo R.T. Major Flavonoids in Grape Seeds and Skins: Antioxidant Capacity of Catechin, Epicatechin, and Gallic Acid J. Agric. Food Chem. 2004 52 255 260 10.1021/jf030117h 14733505 73. Deng Q. Penner M.H. Zhao Y. Chemical composition of dietary fiber and polyphenols of five different varieties of wine grape pomace skins Food Res. Int. 2011 44 2712 2720 10.1016/j.foodres.2011.05.026 74. Montealegre R.R. Peces R.R. Vozmediano J.C. Gascueña J.M. Romero E.G. Phenolic compounds in skins and seeds of ten grape Vitis vinifera varieties grown in a warm climate J. Food Compos. Anal. 2006 19 687 693 10.1016/j.jfca.2005.05.003 75. Rockenbach I.I. Jungfer E. Ritter C. Santiago-Schübel B. Thiele B. Fett R. Galensa R. Characterization of flavan-3-ols in seeds of grape pomace by CE, HPLC-DAD-MSn and LC-ESI-FTICR-MS Food Res. Int. 2012 48 848 855 10.1016/j.foodres.2012.07.001 76. González-Centeno M.R. Rosselló C. Simal S. Garau M.C. López F. Femenia A. Physico-chemical properties of cell wall materials obtained from ten grape varieties and their byproducts: Grape pomaces and stems LWT-Food Sci. Technol. 2010 43 1580 1586 10.1016/j.lwt.2010.06.024 77. Lavelli V. Sri Harsha P.S.C. Ferranti P. Scarafoni A. Iametti S. Grape skin phenolics as inhibitors of mammalian α-glucosidase and α-amylase—Effect of food matrix and processing on efficacy Food Funct. 2016 7 1655 1663 10.1039/C6FO00073H 26943361 78. Torres M.D. Moreira R. Chenlo F. Morel M.H. Effect of water and guar gum content on thermal properties of chestnut flour and its starch Food Hydrocoll. 2013 33 192 198 10.1016/j.foodhyd.2013.03.004 79. Vinson J.A. Proch J. Bose P. MegaNatural ® J. Med. Food 2001 4 17 26 10.1089/10966200152053677 12639284 80. Kar P. Laight D. Rooprai H.K. Shaw K.M. Cummings M. Effects of grape seed extract in Type 2 diabetic subjects at high cardiovascular risk: A double blind randomized placebo controlled trial examining metabolic markers, vascular tone, inflammation, oxidative stress and insulin sensitivity Diabet. Med. 2009 26 526 531 10.1111/j.1464-5491.2009.02727.x 19646193 81. Garavaglia J. Markoski M.M. Oliveira A. Marcadenti A. Grape Seed Oil Compounds: Biological and Chemical Actions for Health Nutr. Metab. Insights 2016 9 59 64 10.4137/NMI.S32910 27559299 PMC4988453 82. Gorinstein S. Leontowicz H. Leontowicz M. Krzeminski R. Gralak M. Martin-Belloso O. Delgado-Licon E. Haruenkit R. Katrich E. Park Y.-S. Fresh Israeli Jaffa Blond (Shamouti) Orange and Israeli Jaffa Red Star Ruby (Sunrise) Grapefruit Juices Affect Plasma Lipid Metabolism and Antioxidant Capacity in Rats Fed Added Cholesterol J. Agric. Food Chem. 2004 52 4853 4859 10.1021/jf040006y 15264925 83. Kawabata K. Yoshioka Y. Terao J. Role of Intestinal Microbiota in the Bioavailability and Physiological Functions of Dietary Polyphenols Molecules 2019 24 370 10.3390/molecules24020370 30669635 PMC6359708 84. Rudrapal M. Khairnar S.J. Khan J. Bin Dukhyil A. Ansari M.A. Alomary M.N. Alshabrmi F.M. Palai S. Deb P.K. Devi R. Dietary Polyphenols and Their Role in Oxidative Stress-Induced Human Diseases: Insights Into Protective Effects, Antioxidant Potentials and Mechanism(s) of Action Front. Pharmacol. 2022 13 806470 10.3389/fphar.2022.806470 35237163 PMC8882865 85. Pérez-Jiménez J. Díaz-Rubio M.E. Saura-Calixto F. Non-extractable polyphenols, a major dietary antioxidant: Occurrence, metabolic fate and health effects Nutr. Res. Rev. 2013 26 118 129 10.1017/S0954422413000097 23930641 86. Cortés-Martín A. Selma M.V. Tomás-Barberán F.A. González-Sarrías A. Espín J.C. Where to Look into the Puzzle of Polyphenols and Health? The Postbiotics and Gut Microbiota Associated with Human Metabotypes Mol. Nutr. Food Res. 2020 64 1900952 10.1002/mnfr.201900952 32196920 87. Martins C.C. Kahmann A. Anzanello M.J. Rodrigues R.C. Rodrigues E. Mercali G.D. Acid hydrolysis conditions do affect the non-extractable phenolic compounds composition from grape peel and seed Food Res. Int. 2023 174 113636 10.1016/j.foodres.2023.113636 37986539 88. Das T. Chatterjee N. Capanoglu E. Lorenzo J.M. Das A.K. Dhar P. The synergistic ramification of insoluble dietary fiber and associated non-extractable polyphenols on gut microbial population escorting alleviation of lifestyle diseases Food Chem. X 2023 18 100697 10.1016/j.fochx.2023.100697 37206320 PMC10189415 89. Velmurugan B. Singh R.P. Kaul N. Agarwal R. Agarwal C. Dietary Feeding of Grape Seed Extract Prevents Intestinal Tumorigenesis in APCmin/+ Mice Neoplasia 2010 12 95 102 10.1593/neo.91718 20072658 PMC2805888 90. Downing L.E. Ferguson B.S. Rodriguez K. Ricketts M. A grape seed procyanidin extract inhibits HDAC activity leading to increased Pparα phosphorylation and target-gene expression Mol. Nutr. Food Res. 2017 61 1600347 10.1002/mnfr.201600347 PMC5292052 27624175 91. Brenes A. Viveros A. Chamorro S. Arija I. Use of polyphenol-rich grape by-products in monogastric nutrition Rev. Anim Feed. Sci. Technol. 2016 211 1 17 10.1016/j.anifeedsci.2015.09.016 92. Tao W. Zhang Y. Shen X. Cao Y. Shi J. Ye X. Chen S. Rethinking the Mechanism of the Health Benefits of Proanthocyanidins: Absorption, Metabolism, and Interaction with Gut Microbiota Compr. Rev. Food Sci. Food Saf. 2019 18 971 985 10.1111/1541-4337.12444 33336996 93. Takahama U. Hirota S. Interactions of flavonoids with α-amylase and starch slowing down its digestion Food Funct. 2018 9 677 687 10.1039/C7FO01539A 29292445 94. Bohn T. McDougall G.J. Alegría A. Alminger M. Arrigoni E. Aura A.-M. Brito C. Cilla A. el S.N. Karakaya S. Mind the gap—Deficits in our knowledge of aspects impacting the bioavailability of phytochemicals and their metabolites—A position paper focusing on carotenoids and polyphenols Mol. Nutr. Food Res. 2015 59 1307 1323 10.1002/mnfr.201400745 25988374 PMC5033009 95. Czubinski J. Dwiecki K. A review of methods used for investigation of protein–phenolic compound interactions Int. J. Food Sci. Technol. 2017 52 573 585 10.1111/ijfs.13339 96. Konishi Y. Kobayashi S. Transepithelial Transport of Chlorogenic Acid, Caffeic Acid, and Their Colonic Metabolites in Intestinal Caco-2 Cell Monolayers J. Agric. Food Chem. 2004 52 2518 2526 10.1021/jf035407c 15113150 97. Herremans K.M. Riner A.N. Cameron M.E. Trevino J.G. The microbiota and cancer cachexia Int. J. Mol. Sci. 2019 20 6267 6279 10.3390/ijms20246267 31842339 PMC6940781 98. Wang B. Yang G. Liang X. Zhu M. Du M. Grape seed extract prevents skeletal muscle wasting in interleukin 10 knockout mice BMC Complement. Altern. Med. 2014 14 162 10.1186/1472-6882-14-162 24884473 PMC4041050 99. Nair A.B. Jacob S. A simple practice guide for dose conversion between animals and human J. Basic Clin. Pharm. 2016 7 27 31 10.4103/0976-0105.177703 27057123 PMC4804402 100. Lambert K. Coisy-Quivy M. Bisbal C. Sirvent P. Hugon G. Mercier J. Avignon A. Sultan A. Grape polyphenols supplementation reduces muscle atrophy in a mouse model of chronic inflammation Nutrition 2015 31 1275 1283 10.1016/j.nut.2015.04.022 26333892 101. Myburgh K.H. Kruger M.J. Smith C. Accelerated skeletal muscle recovery after in vivo polyphenol administration J. Nutr. Biochem. 2012 23 1072 1079 10.1016/j.jnutbio.2011.05.014 22079208 102. Qin X. Niu W. Zhao K. Luo Y. Wang W. He Y. Yang F. Cao B. Du M. Su H. Resveratrol enhances post-injury muscle regeneration by regulating antioxidant and mitochondrial biogenesis Curr. Res. Food Sci. 2025 10 100972 10.1016/j.crfs.2025.100972 39896273 PMC11787617 103. Derry M.M. Raina K. Balaiya V. Jain A.K. Shrotriya S. Huber K.M. Serkova N.J. Agarwal R. Agarwal C. Grape seed extract efficacy against azoxymethane-induced colon tumorigenesis in A/J mice: Interlinking miRNA with cytokine signaling and inflammation Cancer Prev. Res. 2013 6 625 633 10.1158/1940-6207.CAPR-13-0053 PMC3701740 23639480 104. Foshati S. Rouhani M.H. Amani R. The effect of grape seed extract supplementation on oxidative stress and inflammation: A systematic review and meta-analysis of controlled trials Int. J. Clin. Pract. 2021 75 e14469 10.1111/ijcp.14469 34107109 105. Malta F.A.P.S. Gonçalves D.C. A triple-masked, two-center, randomized parallel clinical trial to assess the superiority of eight weeks of grape seed flour supplementation against placebo for weight loss attenuation during perioperative period in patients with cachexia associated with colorectal cancer: A study protocol Front. Endocrinol. 2024 14 1146479 10.3389/fendo.2023.1146479 PMC10834683 38313843 106. Wu C. Suzuki K. The Effects of Flavonoids on Skeletal Muscle Mass, Muscle Function, and Physical Performance in Individuals with Sarcopenia: A Systematic Review of Randomized Controlled Trials Nutrients 2023 15 3897 10.3390/nu15183897 37764681 PMC10537400 107. Li Y. Liu Y. Tan R. Liu Y. Effect of flavonoids on skeletal muscle mass, strength and physical performance in middle-aged and older adults with or without Sarcopenia: A meta-analysis of randomized controlled trials Front. Nutr. 2022 9 1013449 10.3389/fnut.2022.1013449 36299989 PMC9589257 108. Medoro A. Scapagnini G. Davinelli S. Polyphenol Supplementation and Sarcopenia: A Systematic Review and Meta-Analysis of Clinical Trials J. Frailty Aging 2024 13 432 440 10.14283/jfa.2024.73 39574264 109. Nassiri-Asl M. Hosseinzadeh H. Review of the Pharmacological Effects of Vitis vinifera Phytother. Res. 2016 30 1392 1403 10.1002/ptr.5644 27196869 110. Terra X. Valls J. Vitrac X. Mérrillon J.-M. Arola L. Ardévól A. Bladé C. Fernández-Larrea J. Pujadas G. Salvadó J. Grape-Seed Procyanidins Act as Antiinflammatory Agents in Endotoxin-Stimulated RAW 264.7 Macrophages by Inhibiting NFkB Signaling Pathway J. Agric. Food Chem. 2007 55 4357 4365 10.1021/jf0633185 17461594 111. Zhou K. Raffoul J.J. Potential Anticancer Properties of Grape Antioxidants J. Oncol. 2012 2012 1 8 10.1155/2012/803294 PMC3420094 22919383 112. Ngum J.A. Tatang F.J. Toumeni M.H. Nguengo S.N. Simo U.S.F. Mezajou C.F. Kameni C. Ngongang N.N. Tchinda M.F. Dongmo F.F.D. An overview of natural products that modulate the expression of non-coding RNAs involved in oxidative stress and inflammation-associated disorders Front. Pharmacol. 2023 14 1144836 10.3389/fphar.2023.1144836 37168992 PMC10165025 113. Waldecker M. Kautenburger T. Daumann H. Busch C. Schrenk D. Inhibition of histone-deacetylase activity by short-chain fatty acids and some polyphenol metabolites formed in the colon J. Nutr. Biochem. 2008 19 587 593 10.1016/j.jnutbio.2007.08.002 18061431 114. Hodgkinson K. El Abbar F. Dobranowski P. Manoogian J. Butcher J. Figeys D. Mack D. Stintzi A. Butyrate’s role in human health and the current progress towards its clinical application to treat gastrointestinal disease Clin. Nutr. 2023 42 61 75 10.1016/j.clnu.2022.10.024 36502573 115. Chodari L. Aytemir M.D. Vahedi P. Alipour M. Vahed S.Z. Khatibi S.M.H. Ahmadian E. Ardalan M. Eftekhari A. de Oliveira F.L. Targeting Mitochondrial Biogenesis with Polyphenol Compounds Oxid. Med. Cell. Longev. 2021 2021 4946711 10.1155/2021/4946711 34336094 PMC8289611 116. Traynard V. Resveratrol, Multiple Bioactivities for a Wide Range of Health Benefits—New Innovative Extracts for Nutraceutical, Pharmaceutical, and Cosmetics Applications Resveratrol—Recent Advances, Application, and Therapeutic Potential IntechOpen Rijeka, Croatia 2024 10.5772/intechopen.109179 117. Yang L. Liu D. Jiang S. Li H. Chen L. Wu Y. Essien A.E. Opoku M. Naranmandakh S. Liu S. SIRT1 signaling pathways in sarcopenia: Novel mechanisms and potential therapeutic targets Biomed. Pharmacother. 2024 177 116917 10.1016/j.biopha.2024.116917 38908209 118. Gonçalves D.C. Grape Seed Flour Supplementation as a strategy to Reverse Muscle Mass Loss in Perioperative Colorectal Cancer Cachexia Patients: A Translational Study 2023 Available online: https://ensaiosclinicos.gov.br/rg/RBR-5p6nv8b (accessed on 28 August 2025) 119. Blauwhoff-Buskermolen S. Ruijgrok C. Ostelo R.W. de Vet H.C.W. Verheul H.M.W. de van der Schueren M.A.E. Langius J.A.E. The assessment of anorexia in patients with cancer: Cut-off values for the FAACT-A/CS and the VAS for appetite Support Care Cancer 2016 24 661 666 10.1007/s00520-015-2826-2 26160463 PMC4689771 120. Park E. Edirisinghe I. Choy Y.Y. Waterhouse A. Burton-Freeman B. Effects of grape seed extract beverage on blood pressure and metabolic indices in individuals with pre-hypertension: A randomised, double-blinded, two-arm, parallel, placebo-controlled trial Br. J. Nutr. 2016 115 226 238 10.1017/S0007114515004328 26568249 121. Sano A. Safety assessment of 4-week oral intake of proanthocyanidin-rich grape seed extract in healthy subjects Food Chem. Toxicol. 2017 108 519 523 10.1016/j.fct.2016.11.021 27889390 122. Laviano A. Giraldi G.D.L. Koverech A. Does nutrition support have a role in managing cancer cachexia? Curr. Opin. Support. Palliat. Care 2016 10 288 292 10.1097/SPC.0000000000000242 27750261 123. NIAID Visual & Medical Arts. (10/7/2024) Cytokines. NIAID NIH BIOART Source Available online: https://bioart.niaid.nih.gov/bioart/98 (accessed on 1 June 2025) 124. NIAID Visual & Medical Arts. (10/7/2024) Doctor Patient. NIAID NIH BIOART Source Available online: https://bioart.niaid.nih.gov/bioart/130 (accessed on 1 June 2025) 125. NIAID Visual & Medical Arts. (10/7/2024) Hospital Setting. NIAID NIH BIOART Source Available online: https://bioart.niaid.nih.gov/bioart/206 (accessed on 1 June 2025) 126. NIAID Visual & Medical Arts. (10/7/2024) Mitochondria. NIAID NIH BIOART Source Available online: https://bioart.niaid.nih.gov/bioart/352 (accessed on 1 June 2025) 127. NIAID Visual & Medical Arts. (10/7/2024) Generic Cells. NIAID NIH BIOART Source Available online: https://bioart.niaid.nih.gov/bioart/172 (accessed on 1 June 2025) Figure 1 Mechanisms of Cancer Cachexia and Potential Modulatory Effects of Grape Seed Polyphenols. biology-14-01159-t001_Table 1 Table 1 Nutritional Information: Organic Grape Seed Flour.  100 g Energy value (kcal) 159 Total carbohydrates (g) 28 Total sugars (g) 3.4 Proteins (g) 8.6 Total fats (g) 1.3 Dietary fiber (g) 46 Phenolic compounds (mg) 1703 Hydrolysable tannins (mg) 307.7 Hydroxybenzoic acids and derivatives (mg) 153.8 Non-extractable proanthocyanidins (mg) 1287.1 Hydroxycinnamic acids (mg) 24.9 Anthocyanins (mg) ND biology-14-01159-t002_Table 2 Table 2 Preclinical studies with grape polyphenols in cancer cachexia models. Study (Year) Model Used Intervention Main Outcomes Relevance to Cancer Wang et al. [ 98 IL10-KO mice (chronic inflammation and muscle atrophy model) GSE (0.2 mg/g/day in water) 15% preservation of muscle mass; ↓ TNF-α by 40% Directly mimics colorectal cancer-associated cachexia Lambert 100 LPS-induced muscle atrophy (caspase-3 mediated) 50 mg/kg of mixed polyphenols ↓ caspase-3 by 30%; ↓ muscle loss by 22% Mechanistically relevant (PTHrP pathway activation in CRC Myburgh 101 Acute muscle injury (gastrocnemius) Grape seed procyanidins (20 mg/kg/day) ↑ satellite cell activation; ↓ local TNF-α by 50% Limited due to acute, non-cachexia model Qin et al. [ 102 Post-injury muscle regeneration Resveratrol (450 mg/kg) ↑ PGC-1α; ↑ mitochondrial function (35%) Impractical dosage; not representative of cachexia Derry et al. [ 103 Colorectal cancer induced by AOM GSE (0.25–0.5%) ↓ tumor formation (55%); ↓ PCNA (65%) Focus on tumorigenesis, not cachexia parameters biology-14-01159-t003_Table 3 Table 3 Clinical studies with grape polyphenols relevant to cachexia. Study Population Intervention Main Outcomes Relevance to Kar et al. 80 Elderly (mean age 61.8) GSE (600 mg/day, 4 weeks) ↓ hs-CRP by 34%; ↑ glutathione by 28% Biomarkers relevant to cachexia (inflammation, oxidative stress) Foshati 104 Meta-analysis (15 trials) GSE (various doses) ↓ CRP (by 0.8 mg/L); ↓ glucose, LDL, TG No muscle outcomes; baseline CRP < cachexia levels Malta & Gonçalves [ 105 Colorectal cancer patients (perioperative) GSF (8 g/day, 8 weeks) Primary: ↓ weight loss; Secondary: muscle strength, inflammation, QoL Ongoing RCT; first study focused on cancer cachexia biology-14-01159-t004_Table 4 Table 4 Summary of the clinical trial design for grape seed flour supplementation in cancer cachexia.  Item  Details Study Design  - Phase 2, randomized, placebo-controlled, triple-blind (participant, investigator, outcomes assessor) - Two-center trial (UNIFESP and partner site) - Superiority design (GSF vs. placebo) Population  - CRC patients - Inclusion: Pre-cachexia/cachexia (Fearon et al. [ 8 2 - Exclusion: Metastatic disease, current antioxidant/anti-inflammatory use Intervention  - GSF: 8 g/day (4 × 2 g capsules = 136 mg polyphenols + 3.7 g fiber) - Placebo: Matched corn starch capsules - Duration: 8 weeks (4 pre-op + 4 post-op) Duration  - 8 weeks (4 preoperative weeks + 4 postoperative weeks), with 60-day follow-up for postoperative complications Primary Endpoint  - Mean difference in body weight change (kg) from baseline to week 8 (± SD) Secondary Endpoints  - Clinical: - Postoperative complications (Clavien–Dindo classification) - Adverse events (CTCAE v5.0) - Functional: - Handgrip strength (Jamar hydraulic dynamometer) - Quality of life (EORTC QLQ-C30) - Fatigue (FACIT-F scale) - Laboratory: - Systemic inflammation (CRP [mg/L], IL-6 [pg/mL]) - Muscle metabolism (urinary 3-methylhistidine) - Microbiological: - Gut microbiota (16S rRNA sequencing) Safety Monitoring  - Daily adverse event tracking (nausea, diarrhea, allergies) - Hepatic/renal toxicity (AST, ALT, creatinine) Ethics  - Approved by UNIFESP Ethics Committee (CAAE: 39368320.5.0000.5505) - Written informed consent obtained ",
  "metadata": {
    "Title of this paper": "Generic Cells. NIAID NIH BIOART Source",
    "Journal it was published in:": "Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467164/"
  }
}