{
  "title": "Paper_220",
  "abstract": "pmc J Exp Clin Cancer Res J Exp Clin Cancer Res 618 jeccr Journal of Experimental & Clinical Cancer Research : CR 0392-9078 1756-9966 BMC PMC12487423 PMC12487423.1 12487423 12487423 41029717 10.1186/s13046-025-03532-2 3532 1 Research Mesenchymal stroma drives axonogenesis and nerve-induced aggressiveness in osteosarcoma Di Pompo Gemma gemma.dipompo@ior.it 1 Mitsiadis Thimios A. 2 3 Pagella Pierfrancesco 2 7 Pasquarelli Alessandro 4 Bettini Giuliano 5 Sabattini Silvia 5 Righi Alberto 6 Avnet Sofia 4 Baldini Nicola nicola.baldini@ior.it 1 4 1 https://ror.org/02ycyys66 grid.419038.7 0000 0001 2154 6641 Biomedical Science and Technologies and Nanobiotechnology Laboratory, IRCCS Istituto Ortopedico Rizzoli, 2 https://ror.org/02crff812 grid.7400.3 0000 0004 1937 0650 Orofacial Development and Regeneration, Institute of Oral Biology, Center for Dental Medicine, University of Zürich, 3 https://ror.org/00dr28g20 grid.8127.c 0000 0004 0576 3437 Foundation for Research and Technology-Hellas (FORTH), University of Crete, 4 https://ror.org/01111rn36 grid.6292.f 0000 0004 1757 1758 Department of Biomedical and Neuromotor Sciences, University of Bologna, 5 https://ror.org/01111rn36 grid.6292.f 0000 0004 1757 1758 Department of Veterinary Medical Sciences, University of Bologna, 6 https://ror.org/02ycyys66 grid.419038.7 0000 0001 2154 6641 Department of Pathology, IRCCS Istituto Ortopedico Rizzoli, 7 https://ror.org/05ynxx418 grid.5640.7 0000 0001 2162 9922 Present Address: m2Lab, Division of Biophysics and Bioengineering, Department of Physics, Chemistry and Biology (IFM), Linköping University, 30 9 2025 2025 44 478191 276 24 3 2025 25 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Background Osteosarcoma (OS), the most common primary bone malignancy, is a leading cause of cancer-related mortality in children and adolescents. Besides genomic abnormalities, several features of tumour microenvironment (TME), including cancer-associated mesenchymal stromal cells (MSC), have been recognized to play a key role in OS progression. The pathogenetic function of de novo Methods We evaluated nerve infiltration in tissue samples from a small cohort of human OS ( n n Results We provided evidence of OS innervation within and surrounding the tumour in association with mesenchymal stroma that also corresponded to the most proliferative area of the tumour (Ki-67+). In vitro, both MSC and, to a lesser extent, OS cells promoted axonal growth through cytokine (IL-6) and neuromodulator (BDNF) secretion. Extracellular acidosis – a hallmark of OS aggressiveness – amplified IL-6 release by stromal cells, and its pro-neurogenic effect was prevented by IL-6 blockade. In turn, tumour-associated innervation stimulated OS cell proliferation and migration, eventually driving tumour aggressiveness. Conclusions We showed, for the first time, that bone-associated nerves, fostered by the OS microenvironment, promote tumour aggressiveness. Interfering with the nerve-tumour axis, particularly with the signalling associated with mesenchymal stroma, offers novel opportunities for OS treatment. Supplementary Information The online version contains supplementary material available at 10.1186/s13046-025-03532-2. Keywords Osteosarcoma Nerves Mesenchymal stromal cells Interleukin-6 Brain-derived neurotrophic factor Axonogenesis Tumour microenvironment Fondazione AIRC per la ricerca sul cancro AIRC (IG 2018—ID. 21403 project “Altered lipid metabolism as a stress reaction to acid tumour microenvironment and a driver of metastasis in osteosarcoma” to N.B.) Baldini Nicola Italian Ministry of Health (5 × 1000 Anno 2022, Redditi 2021, 5M-2022-23685324, CUP D33C23001460001 “Modelli tridimensionali di tumori ossei per migliorare l'efficacia di studi preclinici in vitro” to N.B) Baldini Nicola pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Italian National Cancer Institute ‘Regina Elena’ 2025 Background Osteosarcoma (OS) is the most common primary malignancy of bone in adolescents and young adults and a leading cause of cancer-related mortality in this population [ 1 2 4 5 11 12 15 Similar to and alongside angiogenesis, de novo 16 17 18 20 21 Within the Haversian canals in the cortical bone, and in central and peripheral marrow regions [ 22 23 24 27 12 28 33 34 36 Our study addresses a critical gap in understanding the role of tumour-driven innervation in OS. We showed that tumour-associated mesenchymal stroma, activated by cancer cells, significantly contributes to OS progression by fostering pro-tumorigenic features of bone-associated nerves. Specifically, this occurs through the induction of both neurotrophic [ 37 38 3 4 39 40 Methods Clinical study Medical records of pet dogs diagnosed with OS at the Veterinary Hospital of the University of Bologna (Italy) between January 2015 and December 2018 were retrospectively analysed. Owners gave informed consent to the use of clinical data and stored biological samples for teaching and research purposes. Inclusion criteria required the availability of pre-chemotherapy tissue samples ( n For the sampling of human OS tissues, we retrospectively enrolled patients ( n For the sampling of not-transformed bone tissue, we prospectively enrolled patients ( n For all types of samples, formalin-fixed tissues were paraffin embedded following decalcification (when necessary). Sections (5 μm thick) were stained with haematoxylin and eosin for histologic evaluation. For βIII-tubulin and Ki-67 immunohistochemistry, serial sections from representative blocks were prepared. Briefly, tissue sections mounted on silane-coated slices underwent dewaxing in Citro Histoclear (Histo-Line Laboratories, Milano, Italy), rehydration through graded ethanol, antigen retrieval (for Ki-67), endogenous peroxidase quenching (3% hydrogen peroxide), and blocking with 2% bovine serum albumin (BSA). Full details of βIII-tubulin and Ki-67 staining and relative quantification protocols are provided in the Supplementary Information section. Cell cultures Human bone marrow-derived MSC were purchased from Lonza (Basel, Switzerland) and cultured in Minimum Essential Medium Eagle Alpha Modified (Alpha-MEM) (Sigma-Aldrich, St. Louis, MO, USA). Cancer-associated fibroblasts (CAF) were isolated from a human OS tissue sample following ethical approval (n. 20204 of 31.07.09) and informed consent. The sample was mechanically dissociated, and the resulting cell suspension cultured in Iscove’s Modified Dulbecco’s Medium (IMDM) (Life Technologies, Carlsbad, CA, USA) supplemented with 20% fetal bovine serum (FBS). Both MSC and CAF were used between passages 5–6. The human OS cell lines HOS and 143B (ATCC, Manassas, VA, USA) were cultured in IMDM. Cell line authentication was performed within three years via SNP profiling (LGC Standard, Teddington, UK). All the cells were cultured in the specified medium with 100 U/mL penicillin, 100 mg/mL streptomycin, and 10% FBS (Euroclone, Milan, Italy) (complete medium), under standard conditions (37 °C, 5% CO 2 Rat neonatal sensory dorsal root ganglion (DRG) neurons (Lonza, Basel, Switzerland) were seeded on poly-D-lysine (0.1 mg/mL) and laminin (5 µg/mL)-coated supports (Sigma-Aldrich). Neurons were cultured in Primary Neuron Basal Medium (Lonza) supplemented with 2 mM L-glutamine, 50 µg/mL gentamicin, 37 ng/mL amphotericin, and 2% neural cell-survival factor (NSF-1, Lonza) (complete Neuron Basal medium, cNBM), under standard conditions. pH-adjusted media were prepared by modulating sodium bicarbonate concentration according to the Henderson–Hasselbach equation [ 41 Cell culture supernatants (conditioned media, CM) were collected as described in Table 1 S1  Table 1 Protocols for obtaining the different conditioned media (CM) used in the experimental assays to evaluate the effects of cell secretome Abbreviation Cell source Type of support N Pre-treatments Medium Time of collection Collection procedure Neuron CM DRG neurons 24-well precoated plates 2.5 × 10 3 None Complete Neuron Basal medium (cNBM) 48 h Centrifugation at 1800 rpm (5 min at 4 °C) MSC CM MSC T75 flask 70% confluence Wash with PBS cNBM w/o NSF-1 48 h Centrifugation at 6000 rpm (15 min at 4 °C), with Vivaspin 20 (10 kDa MWCO; GE Healthcare, Chicago, IL, USA) CAF CM CAF T75 flask 70% confluence Wash with PBS cNBM w/o NSF-1 48 h Centrifugation at 6000 rpm (15 min at 4 °C), with Vivaspin 20 (10 kDa MWCO) HOS CM HOS T75 flask 70% confluence Wash with PBS cNBM w/o NSF-1 48 h Centrifugation at 6000 rpm (15 min at 4 °C), with Vivaspin 20 (10 kDa MWCO) 143B CM 143B T75 flask 70% confluence Wash with PBS cNBM w/o NSF-1 48 h Centrifugation at 6000 rpm (15 min at 4 °C), with Vivaspin 20 (10 kDa MWCO) MSC pH6.8 MSC T25 flask 3 × 10 5 After cell adhesion, incubation for 10 h with Alpha-MEM 0.1% FBS (low-serum medium); wash with PBS; incubation for 24 h with low-serum medium at pH 6.8; wash with PBS cNBM w/o NSF-1 48 h Centrifugation at 6000 rpm (15 min at 4 °C), with Vivaspin 20 (10 kDa MWCO) MSC pH7.4 MSC T25 flask 3 × 10 5 After cell adhesion, incubation for 10 h with Alpha-MEM 0.1% FBS (low-serum medium); wash with PBS; incubation for 24 h with low-serum medium at pH 7.4; wash with PBS cNBM w/o NSF-1 48 h Centrifugation at 6000 rpm (15 min at 4 °C), with Vivaspin 20 (10 kDa MWCO) Pre-treated neuron CM DRG neurons 24-well pre-coated plates 2.5 × 10 3 At 48 h after cell seeding, wash with PBS, and incubation for 48 h with MSC pH6.8 pH7.4 cNBM w/o NSF-1 48 h Centrifugation at 1800 rpm (5 min at 4 °C) Cell-cell contact quantification MSC (1 × 10 2 2 3 For full details of the βIII-tubulin immunofluorescence staining protocol, refer to the Supplementary Information. Data were collected from three independent biological experiments. Neuron culture in microfluidic devices To assess the effects of CM on axonal recruitment, polydimethylsiloxane (PDMS) AXIS™ Axon Isolation microfluidic devices (AX150, Sigma-Aldrich) were used. These include a somal compartment for neuron seeding and an axonal compartment for CM (Supplementary Fig. S2 42 4 1 Axonal growth quantification Static cultures Neurons (7.5 × 10 3 1 143B CM Microfluidic cultures Neurons were seeded into AXIS™ Axon isolation devices and cultured for 6 days (as described above). CM was then added to the axonal compartment, and after additional 6 days, axon length was quantified using ImageJ software. The five longest axons were considered to determine the maximum average length per device. ELISA Pro-neurogenic mediators in CM were quantified using the following kits: Human IL-6 and Free BDNF Quantikine ELISA Kits (R&D Systems, Minneapolis, MN, USA) and Human beta-NGF ELISA Kit (Thermo Fisher Scientific, Waltham, MA, USA). Protein concentrations were normalized to total protein content measured by bicinchoninic acid (BCA) assay. Assays were performed in duplicate across two independent experiments. Cell counting and viability assays OS cell-neuron co-cultures Human OS cell lines 143B (1.8 × 10 3 3 3 OS exposed to neuron CM 143B (9 × 10 2 3 1 OS exposed to pre-treated neuron CM Neurons were pre-treated as outlined in Table 1 pH6.8 2 Migration assays Direct co-culture Protocols for migration assays in direct neuron-OS co-cultures are detailed in the Supplementary Information. Transwell migration assay Neurons (1.5 × 10 4 4 Statistical analysis Data were analysed using GraphPad Prism 7.0 (GraphPad Software, San Diego, CA, USA) and expressed as mean ± standard error of the mean (SEM). Given the limited sample size, non-parametric tests were used. For group comparisons, we used the Mann-Whitney U test. To distinguish the type of replicates, we named intra-assay the technical replicates, and inter-assay the independent biological replicates. To assess the correlation between the number of βIII-tubulin-positive nerve fibres and the Ki-67 proliferation index in canine OS tissues, Spearman’s rank correlation analysis was performed. For all the analyses, a p Results Nerve infiltration in OS-associated stroma To assess the presence of nerves in tumour tissue, we performed βIII-tubulin immunostaining in a retrospective series of canine and human OS samples ( n n 2 3  Table 2 Clinical and histological features of canine OS Patient Gender Age Breed Histological subtype Site Innervation index based on βIII-tubulin expression Ki-67 index 1 F 7 Leonberger High-grade osteoblastic Tibia None 0 2 M 12 Rottweiler High-grade osteoblastic, fibroblastic, and chondroblastic Tibia + 37.23 ± 1.27 3 M 9 Rottweiler High-grade osteoblastic Femur ++ 43.56 ± 4.78 4 M 11 Rottweiler High-grade osteoblastic Humerus + 15.98 ± 0.94 5 F 9 Half-breed High-grade osteoblastic Femur +++ 62.00 ± 1.71 6 M 4 Half-breed High-grade osteoblastic Tibia ++ 43.14 ± 3.37 7 M 7 Maremma-Abruzzese Shepherd High-grade fibroblastic Femur ++ 41.25 ± 1.60 8 F 4 Half-breed High-grade osteoblastic Humerus + 35.33 ± 1.57 9 F 13 Half-breed High-grade fibroblastic and chondroblastic Radius +++ 70.50 ± 3.53 10 M 9 Czechoslovakian Wolfdog High-grade osteoblastic Radius +++ 87.43 ± 1.90 11 F 9 Half-breed High-grade osteoblastic Tibia ++ 76.06 ± 4.18  Table 3 Clinical and histological features of human OS Patient Gender Age Histological subtype Site Innervation index based on βIII-tubulin expression OS1 F 19 Recurrent high-grade osteoblastic and fibroblastic Tibia +++ OS2 F 55 Recurrent high-grade osteoblastic and fibroblastic Humerus +++ OS3 F 68 Recurrent high-grade osteoblastic and fibroblastic Hip ++ OS4 F 22 Recurrent high-grade osteoblastic and fibroblastic Femur ++ OS5 F 23 Recurrent high-grade osteoblastic Gluteus +++ Neuronal marker-positive elongated and anucleate structures — morphologically consistent with axons — were identified in 10 out of 11 cases of canine OS (Fig. 1 S3 1 S4 p 1 S4 p 2 S5 S5 2 S5 2 p S6  Fig. 1 Nerve fibres in canine OS tissues. βIII-tubulin immunohistochemistry in spontaneous canine OS. ( A B  Fig. 2 Innervation of human OS tissues vs. normal bones. ( A (B) N N p Finally, we found a strong positive correlation between the Ki-67 proliferation index and nerve fibre density in canine OS tissues (Fig. 3 p  Fig. 3 Correlation between nerve density and Ki-67 proliferation index in canine OS. ( A B N p In summary, histological analysis showed constant innervation within the stroma and the pseudocapsule of both canine and human OS tissues. The significant correlation with tumour cell proliferation index strongly suggests a potential interaction between the nervous system and OS microenvironment supporting tumour growth. Neurons exhibit greater tropism toward MSC Given the histological proximity of nerves to tumour-associated mesenchymal stroma, we assessed whether MSC promote axonal recruitment. In vitro, neurons formed significantly more contacts with MSC than with 143B OS cells (Fig. 4 4 p 4 S7 4  Fig. 4 Mesenchymal stromal cells promote interactions with neurons more than OS cells. ( A B N p C Mesenchymal stroma enhances axon recruitment and elongation in a microfluidic model To further compare the neurotrophic potential of OS-associated stromal cells and OS cells, we used CAF isolated from human OS tissue and MSC as in vitro models. CAF were identified by a limited proliferative capacity, reduced lifespan, and high expression of CAF markers (smooth muscle alpha (α)-2 actin, ACTA2, and Fibroblast Activation Protein Alpha, FAP, Supplementary Fig. S8 p 43 CM from MSC and CAF significantly enhanced axonal outgrowth (Fig. 5 5 p p Using a microfluidic device for spatial and fluidic isolation of axons (Fig. 5 5 p 5 p 5 p 39 S9 S9 V1 10 p Overall, our findings confirmed that OS-associated mesenchymal stroma secretes factors that promote nerve recruitment and axon elongation at a higher extent than tumour cells.  Fig. 5 Stromal and OS cell-conditioned medium promote axonal outgrowth. ( A B N p C D E N p # p F N p Stromal-derived BDNF and IL-6 drive tumour-associated axonal outgrowth To identify neuromodulators driving nerve recruitment, we quantified NGF, BDNF, and IL-6 secretion by MSC, CAF, and OS cells (HOS and 143B) by ELISA. NGF was only detectable in MSC (5.09 ± 1.65 pg/mg total protein) (Fig. 6 6 p 6 p Blockage of IL-6 and BDNF with TCZ and a BDNF neutralizing antibody (anti-BDNF Ab), respectively, reduced MSC CM-induced axonal outgrowth (Fig. 6 p 6 p To further investigate the individual contributions of IL-6 and BDNF to axonogenesis, we evaluated their effects on axonal growth at two different concentrations. Both cytokines significantly promoted axon elongation in sensory neurons in a dose-dependent manner (Fig. 6 p p p  Fig. 6 Stromal-derived BDNF and IL-6 drive axonogenesis. ELISA quantification of BDNF ( A B C p N D N p #### p E N p #### p # p To further confirm that MSC-derived IL-6 and BDNF are key mediators of axonogenesis in OS microenvironment, including when MSC are activated by tumour cells, we treated neurons with the supernatant from MSC pre-activated by exposure to 143B cell-conditioned medium (see experimental design in Supplementary Fig. S1 143B CM 7 p CTR p 143B CM In addition, given the recognized role of acidosis in enhancing IL-6 and BDNF secretion by MSC and the established presence of extracellular acidosis in OS [ 44 pH6.8 pH6.8 pH7.4 7 p 7 p pH6.8  Fig. 7 BDNF and IL-6 drive axonogenesis in the OS TME. ( A CTR p CTR #### p 143B CM B pH7.4 pH6.8 p pH7.4 #### p pH6.8 Finally, similar to MSC, we found that other components of the OS microen vi S11 In conclusion, our data demonstrate that IL-6 and BDNF are key mediators of stromal-driven axonal outgrowth in OS. This effect might not be exclusive to MSC but also may involve other cellular elements of the TME. Notably, tumour-derived alterations of the microenvironment that are not limited to the secretion of paracrine factors, like tumour-associated acidosis, further amplify the MSC neurotrophic activity. Sensory neurons promote OS proliferation and migration Having demonstrated nerve recruitment and support by the OS microenvironment both in tissue samples and in in vitro models, we investigated the functional impact of this neural crosstalk on tumour aggressiveness. Neuron CM significantly enhanced OS cell (HOS and 143B) viability and proliferation, as shown by direct cell counting (Fig. 8 p p 8 p p 8 p p 8 p S12 p  Fig. 8 DRG neurons induce OS cell proliferation and migration. (A) (B) N p p (C) N p (D) N p p (E) (F) N p (G) pH7.4 pH6.8 N p p pH7.4 ### p pH6.8 Given the increased neurotrophic potential of acidosis-exposed MSC (MSC pH6.8 pH6.8 pH6.8 pH7.4 5 p p pH7.4 p pH6.8 In summary, neurons recruited to the OS microenvironment may drive tumour progression, particularly under acidosis. This crosstalk is mediated by IL-6 and potentially BDNF, stromal cells acting as central drivers (Fig. 9  Fig. 9 Proposed mechanism of nerve-stroma-OS crosstalk. Cancer-associated acidosis stimulates mesenchymal stroma to secrete pro-neurogenic mediators (e.g. IL-6), promoting nerve recruitment to the OS site. Tumour-associated mesenchymal cells and OS cells further enhance axonal outgrowth via neurokines (e.g. BDNF, IL-6) establishing a feedforward loop that drives OS proliferation and migration Discussion Nerve fibre outgrowth, a critical process in tissue repair and regeneration [ 45 47 48 13 15 49 50 Our study revealed βIII-tubulin-positive nerve fibres within OS tissues, consistent with previous observations in other solid tumours [ 9 10 51 52 53 55 56 16 To confirm the presence and localization of nerves in human OS, we analysed selected cases using the same methodology. From the long-term cohort at IRCCS Rizzoli Orthopaedic Institute, we identified five OS specimens from relapsed patients who underwent amputation without prior chemotherapy. Although rare, this clinical scenario offered a valuable chance to study the untreated TME. Immunohistochemical analysis for βIII-tubulin revealed innervation patterns consistent with those observed in the canine OS model. We found a marked increase in nerve fibres, especially in stroma-rich areas, including the peritumoral region near the periosteal reaction. These findings support the clinical relevance of our results by confirming the presence of nerve fibres within the OS TME, particularly near mesenchymal stroma and proliferating cancer cells. However, establishing a statistical correlation between innervation and clinical outcomes in OS remains difficult. The tumour is highly aggressive in both humans and dogs. It shows high metastatic potential, rapid progression, and often presents with micrometastases at diagnosis, all of which complicate staging and prognosis [ 57 While prior studies attribute nerve recruitment to cancer cell-derived neurotransmitters and neurotrophins [ 17 37 38 3 48 To elucidate the role of mesenchymal stroma in OS innervation, we focused on bone marrow MSC and OS-derived CAF. Bone marrow MSC exhibit unique neurotrophic properties compared to those from other sources [ 58 59 60 vivo 39 Axonal attraction in the OS TME, likely driven by tumour-associated stroma, appears to be mediated by neurotrophic factors such as NGF and BDNF, key regulators of neuronal survival, differentiation, and outgrowth during nerve regeneration [ 61 63 64 65 66 70 65 71 72 64 73 74 75 13 64 65 76 77 78 78 79 40 80 Extracellular acidosis, a hallmark of aggressive tumours driven by a dysregulated metabolism [ 81 3 39 82 83 62 Finally, using co-cultures and CM models – established tools to investigate paracrine nerve-tumour interactions [ 84 85 10 86 87 Given the complexity and dynamic nature of the TME, we investigated whether other cell types—specifically monocytes and osteoblasts—also contribute to the secretion of neurotrophic factors such as BDNF and IL-6 [ 88 89 Although our findings confirm the involvement of various cell types, histological analysis suggests that MSC are the most relevant and direct source of chemotactic signals guiding nerve growth in our model. However, our results do not exclude the contribution of other cells. Rather, they emphasize a specific and functionally validated interaction between MSC and sensory nerves in the context of tumour innervation. Conclusions Our study uncovers novel insights into nerve infiltration in OS, revealing a dynamic interplay between neurons, mesenchymal stroma, and tumour cells that shapes the TME. We provide the first evidence that stromal cells in the TME orchestrate nerve recruitment and outgrowth toward OS via the secretion of neurotrophic and pro-inflammatory factors, notably BDNF and IL-6. This finding lays the groundwork for exploring additional cellular components of the OS TME - such as immune and endothelial cells [ 18 Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Sofia Avnet and Nicola Baldini contributed equally to this work. Acknowledgements We thank Ms. Michelina Greco for tissue sample processing and Drs. Andrea Camisa and Paolo De Angelis for quantifying cancer cell migration in the direct co-culture experiments. Author contributions N.B. and S.A. conceived and supervised the study, interpreted results, obtained funding, and revised the manuscript. G.D.P. conceived the study, designed and conducted the experiments, collected and analysed the data, interpreted results, and supervised the experimental protocols performed by A.P. G.D.P. and S.A. wrote the original draft of the manuscript. P.P. participated in performing the experiments with the axonal microfluidic device and collecting the data. T.A.M. participated in the manuscript discussion and interpretation of the results. G.B. and S.S. conducted the canine OS clinical study. A.R. provided human biological samples and participated in the interpretation of clinical and histopathological data. All the authors read, reviewed, and approved the final version of the manuscript. Funding This work was supported by AIRC (IG 2018—ID. 21403 project “Altered lipid metabolism as a stress reaction to acid tumour microenvironment and a driver of metastasis in osteosarcoma” to N.B.), by Italian Ministry of Health (5 × 1000 Anno 2022, Redditi 2021, 5 M-2022-23685324, CUP D33C23001460001 “Modelli tridimensionali di tumori ossei per migliorare l’efficacia di studi preclinici in vitro” to N.B), and by National Center for Gene Therapy and Drugs Based on RNA Technology, funded in the framework of the National Recovery and Resilience Plan (NRRP), Mission 4 Investment 1.4 funded by the European Union—Next Generation EU, Project CN00000041, CUP B93D21010860004, Spoke 2. Data availability All data generated or analysed during this study are included in this article and its supplementary information file. Declarations Ethics approval and consent to participate The clinical study on canine OS is a retrospective study on archived FFPE tissue samples. As the research did not influence any therapeutic decision, approval by an ethics committee was not required. However, all diagnostic and therapeutic procedures were performed in accordance with the Public Health Service Policy on Humane Care and Use of Laboratory Animals. All the examined samples were collected for diagnostic purposes as part of routine standard care. Owners gave informed consent to the use of clinical data and stored biological samples for teaching and research purposes. The retrospective clinical study for the sampling of human OS tissues was approved by the Ethics Committee (local Ethics Committee, approval No. 184, 07/01/2015). The prospective clinical study for the not-transformed bone tissue was approved by the Ethics Committee (CE-AVEC 586/2020/Sper/IOR, approval No. 0009411, 06/07/2020). For both studies, participants provided written informed consent. Consent for publication All authors agree to submit the article for publication. Competing interests The authors declare no competing interests. Abbreviations OS Osteosarcoma TME Tumour microenvironment NGF Nerve growth factor BDNF Brain-derived neurotrophic factor MSC Mesenchymal stromal cells Alpha-MEM Minimum Essential Medium Eagle Alpha Modified CAF Cancer-associated fibroblasts IMDM Iscove’s Modified Dulbecco’s Medium FBS Fetal bovine serum DRG Dorsal root ganglion NSF-1 Neural cell-survival factor cNBM Complete Neuron Basal medium CM Conditioned medium PDMS Polydimethylsiloxane IL-6 Interleukin-6 Anti-BDNF Ab Anti-BDNF receptor antibody TCZ Tocilizumab BCA Bicinchoninic acid SEM Standard error of the mean ACTA2 Smooth muscle alpha (α)-2 actin FAP Fibroblast Activation Protein Alpha ECM Extracellular matrix MSC 143B CM Tumour-activated MSC MSC pH6.8 Acidosis-exposed MSC MSC pH7.4 Non-acidosis-exposed MSC GDNF Glial cell line-derived neurotrophic factor NRP-2 Neuropilin-2 NT3 Neurotrophin-3 NT4 Neurotrophin-4 References 1. Smeland S Bielack SS Whelan J Bernstein M Hogendoorn P Krailo MD Survival and prognosis with osteosarcoma: outcomes in more than 2000 patients in the EURAMOS-1 (European and American osteosarcoma Study) cohort Eur J Cancer 2019 109 36 50 10.1016/j.ejca.2018.11.027 30685685 PMC6506906 Smeland S, Bielack SS, Whelan J, Bernstein M, Hogendoorn P, Krailo MD, et al. Survival and prognosis with osteosarcoma: outcomes in more than 2000 patients in the EURAMOS-1 (European and American osteosarcoma Study) cohort. Eur J Cancer. 2019;109:36–50. 30685685 10.1016/j.ejca.2018.11.027 PMC6506906 2. Corre I, Verrecchia F, Crenn V, Redini F, Trichet V. The osteosarcoma microenvironment: a complex but targetable ecosystem. Cells. 2020;9(4). 10.3390/cells9040976 PMC7226971 32326444 3. Avnet S Di Pompo G Chano T Errani C Ibrahim-Hashim A Gillies RJ Cancer-associated mesenchymal stroma fosters the stemness of osteosarcoma cells in response to intratumoral acidosis via NF-kappaB activation Int J Cancer 2017 140 6 1331 45 10.1002/ijc.30540 27888521 PMC5272857 Avnet S, Di Pompo G, Chano T, Errani C, Ibrahim-Hashim A, Gillies RJ, et al. Cancer-associated mesenchymal stroma fosters the stemness of osteosarcoma cells in response to intratumoral acidosis via NF-kappaB activation. Int J Cancer. 2017;140(6):1331–45. 27888521 10.1002/ijc.30540 PMC5272857 4. Di Pompo G, Cortini M, Palomba R, Di Francesco V, Bellotti E, Decuzzi P et al. Curcumin-loaded nanoparticles impair the pro-tumor activity of acid-stressed MSC in an in vitro model of osteosarcoma. Int J Mol Sci. 2021;22(11). 10.3390/ijms22115760 PMC8198446 34071200 5. Amit M Takahashi H Dragomir MP Lindemann A Gleber-Netto FO Pickering CR Loss of p53 drives neuron reprogramming in head and neck cancer Nature 2020 578 7795 449 54 10.1038/s41586-020-1996-3 32051587 PMC9723538 Amit M, Takahashi H, Dragomir MP, Lindemann A, Gleber-Netto FO, Pickering CR, et al. Loss of p53 drives neuron reprogramming in head and neck cancer. Nature. 2020;578(7795):449–54. 32051587 10.1038/s41586-020-1996-3 PMC9723538 6. Cavel O Shomron O Shabtay A Vital J Trejo-Leider L Weizman N Endoneurial macrophages induce perineural invasion of pancreatic cancer cells by secretion of GDNF and activation of RET tyrosine kinase receptor Cancer Res 2012 72 22 5733 43 10.1158/0008-5472.CAN-12-0764 22971345 Cavel O, Shomron O, Shabtay A, Vital J, Trejo-Leider L, Weizman N, et al. Endoneurial macrophages induce perineural invasion of pancreatic cancer cells by secretion of GDNF and activation of RET tyrosine kinase receptor. Cancer Res. 2012;72(22):5733–43. 22971345 10.1158/0008-5472.CAN-12-0764 7. Hayakawa Y Sakitani K Konishi M Asfaha S Niikura R Tomita H Nerve growth factor promotes gastric tumorigenesis through aberrant cholinergic signaling Cancer Cell 2017 31 1 21 34 10.1016/j.ccell.2016.11.005 27989802 PMC5225031 Hayakawa Y, Sakitani K, Konishi M, Asfaha S, Niikura R, Tomita H, et al. Nerve growth factor promotes gastric tumorigenesis through aberrant cholinergic signaling. Cancer Cell. 2017;31(1):21–34. 27989802 10.1016/j.ccell.2016.11.005 PMC5225031 8. Keskinov AA Tapias V Watkins SC Ma Y Shurin MR Shurin GV Impact of the sensory neurons on melanoma growth in vivo PLoS ONE 2016 11 5 e0156095 10.1371/journal.pone.0156095 27227315 PMC4882065 Keskinov AA, Tapias V, Watkins SC, Ma Y, Shurin MR, Shurin GV. Impact of the sensory neurons on melanoma growth in vivo. PLoS ONE. 2016;11(5):e0156095. 27227315 10.1371/journal.pone.0156095 PMC4882065 9. Magnon C Hall SJ Lin J Xue X Gerber L Freedland SJ Autonomic nerve development contributes to prostate cancer progression Science 2013 341 6142 1236361 10.1126/science.1236361 23846904 Magnon C, Hall SJ, Lin J, Xue X, Gerber L, Freedland SJ, et al. Autonomic nerve development contributes to prostate cancer progression. Science. 2013;341(6142):1236361. 23846904 10.1126/science.1236361 10. Pundavela J Roselli S Faulkner S Attia J Scott RJ Thorne RF Nerve fibers infiltrate the tumor microenvironment and are associated with nerve growth factor production and lymph node invasion in breast cancer Mol Oncol 2015 9 8 1626 35 10.1016/j.molonc.2015.05.001 26009480 PMC5528785 Pundavela J, Roselli S, Faulkner S, Attia J, Scott RJ, Thorne RF, et al. Nerve fibers infiltrate the tumor microenvironment and are associated with nerve growth factor production and lymph node invasion in breast cancer. Mol Oncol. 2015;9(8):1626–35. 26009480 10.1016/j.molonc.2015.05.001 PMC5528785 11. Ferdoushi A Griffin N Marsland M Xu X Faulkner S Gao F Tumor innervation and clinical outcome in pancreatic cancer Sci Rep 2021 11 1 7390 10.1038/s41598-021-86831-w 33795769 PMC8017010 Ferdoushi A, Griffin N, Marsland M, Xu X, Faulkner S, Gao F, et al. Tumor innervation and clinical outcome in pancreatic cancer. Sci Rep. 2021;11(1):7390. 33795769 10.1038/s41598-021-86831-w PMC8017010 12. Bandala C Avila-Luna A Gomez-Lopez M Estrada-Villasenor E Montes S Alfaro-Rodriguez A Catecholamine levels and gene expression of their receptors in tissues of adults with osteosarcoma Arch Physiol Biochem 2021 127 4 337 43 10.1080/13813455.2019.1638942 31291139 Bandala C, Avila-Luna A, Gomez-Lopez M, Estrada-Villasenor E, Montes S, Alfaro-Rodriguez A, et al. Catecholamine levels and gene expression of their receptors in tissues of adults with osteosarcoma. Arch Physiol Biochem. 2021;127(4):337–43. 31291139 10.1080/13813455.2019.1638942 13. Benini S Baldini N Manara MC Chano T Serra M Rizzi S Redundancy of autocrine loops in human osteosarcoma cells Int J Cancer 1999 80 4 581 8 10.1002/(SICI)1097-0215(19990209)80:4&#x0003c;581::AID-IJC16&#x0003e;3.0.CO;2-O 9935160 Benini S, Baldini N, Manara MC, Chano T, Serra M, Rizzi S, et al. Redundancy of autocrine loops in human osteosarcoma cells. Int J Cancer. 1999;80(4):581–8. 9935160 10.1002/(sici)1097-0215(19990209)80:4<581::aid-ijc16>3.0.co;2-o 14. Moriarity BS Otto GM Rahrmann EP Rathe SK Wolf NK Weg MT A sleeping beauty forward genetic screen identifies new genes and pathways driving osteosarcoma development and metastasis Nat Genet 2015 47 6 615 24 10.1038/ng.3293 25961939 PMC4767150 Moriarity BS, Otto GM, Rahrmann EP, Rathe SK, Wolf NK, Weg MT, et al. A sleeping beauty forward genetic screen identifies new genes and pathways driving osteosarcoma development and metastasis. Nat Genet. 2015;47(6):615–24. 25961939 10.1038/ng.3293 PMC4767150 15. Smeester BA Slipek NJ Pomeroy EJ Bomberger HE Shamsan GA Peterson JJ SEMA4C is a novel target to limit osteosarcoma growth, progression, and metastasis Oncogene 2020 39 5 1049 62 10.1038/s41388-019-1041-x 31582836 Smeester BA, Slipek NJ, Pomeroy EJ, Bomberger HE, Shamsan GA, Peterson JJ, et al. SEMA4C is a novel target to limit osteosarcoma growth, progression, and metastasis. Oncogene. 2020;39(5):1049–62. 31582836 10.1038/s41388-019-1041-x 16. Hernandez S Serrano AG Solis Soto LM The role of nerve fibers in the tumor immune microenvironment of solid tumors Adv Biol (Weinh) 2022 6 9 e2200046 10.1002/adbi.202200046 35751462 Hernandez S, Serrano AG, Solis Soto LM. The role of nerve fibers in the tumor immune microenvironment of solid tumors. Adv Biol (Weinh). 2022;6(9):e2200046. 35751462 10.1002/adbi.202200046 17. Vermeer PD Exosomal induction of tumor innervation Cancer Res 2019 79 14 3529 35 10.1158/0008-5472.CAN-18-3995 31088834 PMC6635078 Vermeer PD. Exosomal induction of tumor innervation. Cancer Res. 2019;79(14):3529–35. 31088834 10.1158/0008-5472.CAN-18-3995 PMC6635078 18. Gysler SM, Drapkin R. Tumor innervation: peripheral nerves take control of the tumor microenvironment. J Clin Invest. 2021;131(11). 10.1172/JCI147276 PMC8159682 34060481 19. Wang W Li L Chen N Niu C Li Z Hu J Nerves in the tumor microenvironment: origin and effects Front Cell Dev Biol 2020 8 601738 10.3389/fcell.2020.601738 33392191 PMC7773823 Wang W, Li L, Chen N, Niu C, Li Z, Hu J, et al. Nerves in the tumor microenvironment: origin and effects. Front Cell Dev Biol. 2020;8:601738. 33392191 10.3389/fcell.2020.601738 PMC7773823 20. Zahalka AH Frenette PS Nerves in cancer Nat Rev Cancer 2020 20 3 143 57 10.1038/s41568-019-0237-2 31974491 PMC7709871 Zahalka AH, Frenette PS. Nerves in cancer. Nat Rev Cancer. 2020;20(3):143–57. 31974491 10.1038/s41568-019-0237-2 PMC7709871 21. Chen SH Zhang BY Zhou B Zhu CZ Sun LQ Feng YJ Perineural invasion of cancer: a complex crosstalk between cells and molecules in the perineural niche Am J Cancer Res 2019 9 1 1 21 30755808 PMC6356921 Chen SH, Zhang BY, Zhou B, Zhu CZ, Sun LQ, Feng YJ. Perineural invasion of cancer: a complex crosstalk between cells and molecules in the perineural niche. Am J Cancer Res. 2019;9(1):1–21. 30755808 PMC6356921 22. Gao X Zhang D Xu C Li H Caron KM Frenette PS Nociceptive nerves regulate Haematopoietic stem cell mobilization Nature 2021 589 7843 591 6 10.1038/s41586-020-03057-y 33361809 PMC7856173 Gao X, Zhang D, Xu C, Li H, Caron KM, Frenette PS. Nociceptive nerves regulate Haematopoietic stem cell mobilization. Nature. 2021;589(7843):591–6. 33361809 10.1038/s41586-020-03057-y PMC7856173 23. Kuntz A Richins CA Innervation of the bone marrow J Comp Neurol 1945 83 213 22 10.1002/cne.900830302 21009098 Kuntz A, Richins CA. Innervation of the bone marrow. J Comp Neurol. 1945;83:213–22. 21009098 10.1002/cne.900830302 24. Brazill JM Beeve AT Craft CS Ivanusic JJ Scheller EL Nerves in bone: evolving concepts in pain and anabolism J Bone Min Res 2019 34 8 1393 406 10.1002/jbmr.3822 PMC6697229 31247122 Brazill JM, Beeve AT, Craft CS, Ivanusic JJ, Scheller EL. Nerves in bone: evolving concepts in pain and anabolism. J Bone Min Res. 2019;34(8):1393–406. 10.1002/jbmr.3822 PMC6697229 31247122 25. Fukuda T Takeda S Xu R Ochi H Sunamura S Sato T Sema3A regulates bone-mass accrual through sensory innervations Nature 2013 497 7450 490 3 10.1038/nature12115 23644455 Fukuda T, Takeda S, Xu R, Ochi H, Sunamura S, Sato T, et al. Sema3A regulates bone-mass accrual through sensory innervations. Nature. 2013;497(7450):490–3. 23644455 10.1038/nature12115 26. Mach DB Rogers SD Sabino MC Luger NM Schwei MJ Pomonis JD Origins of skeletal pain: sensory and sympathetic innervation of the mouse femur Neuroscience 2002 113 1 155 66 10.1016/S0306-4522(02)00165-3 12123694 Mach DB, Rogers SD, Sabino MC, Luger NM, Schwei MJ, Pomonis JD, et al. Origins of skeletal pain: sensory and sympathetic innervation of the mouse femur. Neuroscience. 2002;113(1):155–66. 12123694 10.1016/s0306-4522(02)00165-3 27. Serre CM Farlay D Delmas PD Chenu C Evidence for a dense and intimate innervation of the bone tissue, including glutamate-containing fibers Bone 1999 25 6 623 9 10.1016/S8756-3282(99)00215-X 10593406 Serre CM, Farlay D, Delmas PD, Chenu C. Evidence for a dense and intimate innervation of the bone tissue, including glutamate-containing fibers. Bone. 1999;25(6):623–9. 10593406 10.1016/s8756-3282(99)00215-x 28. Campbell JP Karolak MR Ma Y Perrien DS Masood-Campbell SK Penner NL Stimulation of host bone marrow stromal cells by sympathetic nerves promotes breast cancer bone metastasis in mice PLoS Biol 2012 10 7 e1001363 10.1371/journal.pbio.1001363 22815651 PMC3398959 Campbell JP, Karolak MR, Ma Y, Perrien DS, Masood-Campbell SK, Penner NL, et al. Stimulation of host bone marrow stromal cells by sympathetic nerves promotes breast cancer bone metastasis in mice. PLoS Biol. 2012;10(7):e1001363. 22815651 10.1371/journal.pbio.1001363 PMC3398959 29. Cheng Y Sun F D’Souza A Dhakal B Pisano M Chhabra S Autonomic nervous system control of multiple myeloma Blood Rev 2021 46 100741 10.1016/j.blre.2020.100741 32807576 PMC7876165 Cheng Y, Sun F, D’Souza A, Dhakal B, Pisano M, Chhabra S, et al. Autonomic nervous system control of multiple myeloma. Blood Rev. 2021;46:100741. 32807576 10.1016/j.blre.2020.100741 PMC7876165 30. Decker AM Jung Y Cackowski FC Yumoto K Wang J Taichman RS Sympathetic signaling reactivates quiescent disseminated prostate cancer cells in the bone marrow Mol Cancer Res 2017 15 12 1644 55 10.1158/1541-7786.MCR-17-0132 28814453 PMC5712273 Decker AM, Jung Y, Cackowski FC, Yumoto K, Wang J, Taichman RS. Sympathetic signaling reactivates quiescent disseminated prostate cancer cells in the bone marrow. Mol Cancer Res. 2017;15(12):1644–55. 28814453 10.1158/1541-7786.MCR-17-0132 PMC5712273 31. Huang Z Li G Zhang Z Gu R Wang W Lai X beta2AR-HIF-1alpha-CXCL12 signaling of osteoblasts activated by isoproterenol promotes migration and invasion of prostate cancer cells BMC Cancer 2019 19 1 1142 10.1186/s12885-019-6301-1 31771535 PMC6878637 Huang Z, Li G, Zhang Z, Gu R, Wang W, Lai X, et al. beta2AR-HIF-1alpha-CXCL12 signaling of osteoblasts activated by isoproterenol promotes migration and invasion of prostate cancer cells. BMC Cancer. 2019;19(1):1142. 31771535 10.1186/s12885-019-6301-1 PMC6878637 32. Mulcrone PL Campbell JP Clement-Demange L Anbinder AL Merkel AR Brekken RA Skeletal colonization by breast cancer cells is stimulated by an osteoblast and beta2AR-Dependent Neo-Angiogenic switch J Bone Min Res 2017 32 7 1442 54 10.1002/jbmr.3133 PMC5489363 28300321 Mulcrone PL, Campbell JP, Clement-Demange L, Anbinder AL, Merkel AR, Brekken RA, et al. Skeletal colonization by breast cancer cells is stimulated by an osteoblast and beta2AR-Dependent Neo-Angiogenic switch. J Bone Min Res. 2017;32(7):1442–54. 10.1002/jbmr.3133 PMC5489363 28300321 33. Solerno LM Sobol NT Gottardo MF Capobianco CS Ferrero MR Vasquez L Propranolol blocks osteosarcoma cell cycle progression, inhibits angiogenesis and slows xenograft growth in combination with cisplatin-based chemotherapy Sci Rep 2022 12 1 15058 10.1038/s41598-022-18324-3 36075937 PMC9458647 Solerno LM, Sobol NT, Gottardo MF, Capobianco CS, Ferrero MR, Vasquez L, et al. Propranolol blocks osteosarcoma cell cycle progression, inhibits angiogenesis and slows xenograft growth in combination with cisplatin-based chemotherapy. Sci Rep. 2022;12(1):15058. 36075937 10.1038/s41598-022-18324-3 PMC9458647 34. Danson S Mulvey MR Turner L Horsman J Escott K Coleman RE An exploratory randomized-controlled trial of the efficacy of the Src-kinase inhibitor Saracatinib as a novel analgesic for cancer-induced bone pain J Bone Oncol 2019 19 100261 10.1016/j.jbo.2019.100261 31667062 PMC6812043 Danson S, Mulvey MR, Turner L, Horsman J, Escott K, Coleman RE, et al. An exploratory randomized-controlled trial of the efficacy of the Src-kinase inhibitor Saracatinib as a novel analgesic for cancer-induced bone pain. J Bone Oncol. 2019;19:100261. 31667062 10.1016/j.jbo.2019.100261 PMC6812043 35. Koizumi M Yoshimoto M Kasumi F Iwase T Ogata E Post-operative breast cancer patients diagnosed with skeletal metastasis without bone pain had fewer skeletal-related events and deaths than those with bone pain BMC Cancer 2010 10 423 10.1186/1471-2407-10-423 20704752 PMC3161388 Koizumi M, Yoshimoto M, Kasumi F, Iwase T, Ogata E. Post-operative breast cancer patients diagnosed with skeletal metastasis without bone pain had fewer skeletal-related events and deaths than those with bone pain. BMC Cancer. 2010;10:423. 20704752 10.1186/1471-2407-10-423 PMC3161388 36. Saad F Carles J Gillessen S Heidenreich A Heinrich D Gratt J Radium-223 and concomitant therapies in patients with metastatic castration-resistant prostate cancer: an international, early access, open-label, single-arm phase 3b trial Lancet Oncol 2016 17 9 1306 16 10.1016/S1470-2045(16)30173-5 27473888 Saad F, Carles J, Gillessen S, Heidenreich A, Heinrich D, Gratt J, et al. Radium-223 and concomitant therapies in patients with metastatic castration-resistant prostate cancer: an international, early access, open-label, single-arm phase 3b trial. Lancet Oncol. 2016;17(9):1306–16. 27473888 10.1016/S1470-2045(16)30173-5 37. Momin EN Mohyeldin A Zaidi HA Vela G Quinones-Hinojosa A Mesenchymal stem cells: new approaches for the treatment of neurological diseases Curr Stem Cell Res Ther 2010 5 4 326 44 10.2174/157488810793351631 20528757 Momin EN, Mohyeldin A, Zaidi HA, Vela G, Quinones-Hinojosa A. Mesenchymal stem cells: new approaches for the treatment of neurological diseases. Curr Stem Cell Res Ther. 2010;5(4):326–44. 20528757 10.2174/157488810793351631 38. Vidal PM Lemmens E Dooley D Hendrix S The role of anti-inflammatory cytokines in axon regeneration Cytokine Growth Factor Rev 2013 24 1 1 12 10.1016/j.cytogfr.2012.08.008 22985997 Vidal PM, Lemmens E, Dooley D, Hendrix S. The role of anti-inflammatory cytokines in axon regeneration. Cytokine Growth Factor Rev. 2013;24(1):1–12. 22985997 10.1016/j.cytogfr.2012.08.008 39. Avnet S Lemma S Cortini M Di Pompo G Perut F Lipreri MV The release of inflammatory mediators from Acid-Stimulated mesenchymal stromal cells favours tumour invasiveness and metastasis in osteosarcoma Cancers (Basel) 2021 13 22 10.3390/cancers13225855 PMC8616358 34831016 Avnet S, Lemma S, Cortini M, Di Pompo G, Perut F, Lipreri MV, et al. The release of inflammatory mediators from Acid-Stimulated mesenchymal stromal cells favours tumour invasiveness and metastasis in osteosarcoma. Cancers (Basel). 2021;13:22. 10.3390/cancers13225855 PMC8616358 34831016 40. Cortini M Massa A Avnet S Bonuccelli G Baldini N Tumor-Activated mesenchymal stromal cells promote osteosarcoma stemness and migratory potential via IL-6 secretion PLoS ONE 2016 11 11 e0166500 10.1371/journal.pone.0166500 27851822 PMC5112800 Cortini M, Massa A, Avnet S, Bonuccelli G, Baldini N. Tumor-Activated mesenchymal stromal cells promote osteosarcoma stemness and migratory potential via IL-6 secretion. PLoS ONE. 2016;11(11):e0166500. 27851822 10.1371/journal.pone.0166500 PMC5112800 41. Avnet S Di Pompo G Lemma S Salerno M Perut F Bonuccelli G V-ATPase is a candidate therapeutic target for ewing sarcoma Biochim Biophys Acta 2013 1832 8 1105 16 10.1016/j.bbadis.2013.04.003 23579072 Avnet S, Di Pompo G, Lemma S, Salerno M, Perut F, Bonuccelli G, et al. V-ATPase is a candidate therapeutic target for ewing sarcoma. Biochim Biophys Acta. 2013;1832(8):1105–16. 23579072 10.1016/j.bbadis.2013.04.003 42. Pagella P, Miran S, Mitsiadis T. Analysis of developing tooth germ innervation using microfluidic co-culture devices. J Vis Exp. 2015(102):e53114. 10.3791/53114 PMC4692442 26327218 43. Nurmik M Ullmann P Rodriguez F Haan S Letellier E In search of definitions: Cancer-associated fibroblasts and their markers Int J Cancer 2020 146 4 895 905 10.1002/ijc.32193 30734283 PMC6972582 Nurmik M, Ullmann P, Rodriguez F, Haan S, Letellier E. In search of definitions: Cancer-associated fibroblasts and their markers. Int J Cancer. 2020;146(4):895–905. 30734283 10.1002/ijc.32193 PMC6972582 44. Engin K Leeper DB Cater JR Thistlethwaite AJ Tupchong L McFarlane JD Extracellular pH distribution in human tumours Int J Hyperth 1995 11 2 211 6 10.3109/02656739509022457 7790735 Engin K, Leeper DB, Cater JR, Thistlethwaite AJ, Tupchong L, McFarlane JD. Extracellular pH distribution in human tumours. Int J Hyperth. 1995;11(2):211–6. 10.3109/02656739509022457 7790735 45. Kumar A Brockes JP Nerve dependence in tissue, organ, and appendage regeneration Trends Neurosci 2012 35 11 691 9 10.1016/j.tins.2012.08.003 22989534 Kumar A, Brockes JP. Nerve dependence in tissue, organ, and appendage regeneration. Trends Neurosci. 2012;35(11):691–9. 22989534 10.1016/j.tins.2012.08.003 46. Morgan TH Regeneration and liability to injury Science 1901 14 346 235 48 10.1126/science.14.346.235 17806597 Morgan TH. Regeneration and liability to injury. Science. 1901;14(346):235–48. 17806597 10.1126/science.14.346.235 47. Rinkevich Y Montoro DT Muhonen E Walmsley GG Lo D Hasegawa M Clonal analysis reveals nerve-dependent and independent roles on mammalian Hind limb tissue maintenance and regeneration Proc Natl Acad Sci U S A 2014 111 27 9846 51 10.1073/pnas.1410097111 24958860 PMC4103362 Rinkevich Y, Montoro DT, Muhonen E, Walmsley GG, Lo D, Hasegawa M, et al. Clonal analysis reveals nerve-dependent and independent roles on mammalian Hind limb tissue maintenance and regeneration. Proc Natl Acad Sci U S A. 2014;111(27):9846–51. 24958860 10.1073/pnas.1410097111 PMC4103362 48. Boilly B Faulkner S Jobling P Hondermarck H Nerve dependence: from regeneration to cancer Cancer Cell 2017 31 3 342 54 10.1016/j.ccell.2017.02.005 28292437 Boilly B, Faulkner S, Jobling P, Hondermarck H. Nerve dependence: from regeneration to cancer. Cancer Cell. 2017;31(3):342–54. 28292437 10.1016/j.ccell.2017.02.005 49. Gustafson DL Duval DL Regan DP Thamm DH Canine sarcomas as a surrogate for the human disease Pharmacol Ther 2018 188 80 96 10.1016/j.pharmthera.2018.01.012 29378221 PMC6432917 Gustafson DL, Duval DL, Regan DP, Thamm DH. Canine sarcomas as a surrogate for the human disease. Pharmacol Ther. 2018;188:80–96. 29378221 10.1016/j.pharmthera.2018.01.012 PMC6432917 50. Simpson S Rizvanov AA Jeyapalan JN de Brot S Rutland CS Canine osteosarcoma in comparative oncology: molecular mechanisms through to treatment discovery Front Vet Sci 2022 9 965391 10.3389/fvets.2022.965391 36570509 PMC9773846 Simpson S, Rizvanov AA, Jeyapalan JN, de Brot S, Rutland CS. Canine osteosarcoma in comparative oncology: molecular mechanisms through to treatment discovery. Front Vet Sci. 2022;9:965391. 36570509 10.3389/fvets.2022.965391 PMC9773846 51. Ayala GE Dai H Powell M Li R Ding Y Wheeler TM Cancer-related axonogenesis and neurogenesis in prostate cancer Clin Cancer Res 2008 14 23 7593 603 10.1158/1078-0432.CCR-08-1164 19047084 Ayala GE, Dai H, Powell M, Li R, Ding Y, Wheeler TM, et al. Cancer-related axonogenesis and neurogenesis in prostate cancer. Clin Cancer Res. 2008;14(23):7593–603. 19047084 10.1158/1078-0432.CCR-08-1164 52. Scanlon P Tian J Zhong J Silva I Shapiro R Pavlick A Enhanced immunohistochemical detection of neural infiltration in primary melanoma: is there a clinical value? Hum Pathol 2014 45 8 1656 63 10.1016/j.humpath.2014.04.003 24890944 PMC4691539 Scanlon P, Tian J, Zhong J, Silva I, Shapiro R, Pavlick A, et al. Enhanced immunohistochemical detection of neural infiltration in primary melanoma: is there a clinical value? Hum Pathol. 2014;45(8):1656–63. 24890944 10.1016/j.humpath.2014.04.003 PMC4691539 53. Caccamo D Katsetos CD Herman MM Frankfurter A Collins VP Rubinstein LJ Immunohistochemistry of a spontaneous murine ovarian teratoma with neuroepithelial differentiation. Neuron-associated beta-tubulin as a marker for primitive neuroepithelium Lab Invest 1989 60 3 390 8 2467076 Caccamo D, Katsetos CD, Herman MM, Frankfurter A, Collins VP, Rubinstein LJ. Immunohistochemistry of a spontaneous murine ovarian teratoma with neuroepithelial differentiation. Neuron-associated beta-tubulin as a marker for primitive neuroepithelium. Lab Invest. 1989;60(3):390–8. 2467076 54. Madeo M Colbert PL Vermeer DW Lucido CT Cain JT Vichaya EG Cancer exosomes induce tumor innervation Nat Commun 2018 9 1 4284 10.1038/s41467-018-06640-0 30327461 PMC6191452 Madeo M, Colbert PL, Vermeer DW, Lucido CT, Cain JT, Vichaya EG, et al. Cancer exosomes induce tumor innervation. Nat Commun. 2018;9(1):4284. 30327461 10.1038/s41467-018-06640-0 PMC6191452 55. Schmitd LB Beesley LJ Russo N Bellile EL Inglehart RC Liu M Redefining perineural invasion: integration of biology with clinical outcome Neoplasia 2018 20 7 657 67 10.1016/j.neo.2018.04.005 29800815 PMC6030236 Schmitd LB, Beesley LJ, Russo N, Bellile EL, Inglehart RC, Liu M, et al. Redefining perineural invasion: integration of biology with clinical outcome. Neoplasia. 2018;20(7):657–67. 29800815 10.1016/j.neo.2018.04.005 PMC6030236 56. Liebig C Ayala G Wilks JA Berger DH Albo D Perineural invasion in cancer: a review of the literature Cancer 2009 115 15 3379 91 10.1002/cncr.24396 19484787 Liebig C, Ayala G, Wilks JA, Berger DH, Albo D. Perineural invasion in cancer: a review of the literature. Cancer. 2009;115(15):3379–91. 19484787 10.1002/cncr.24396 57. Picci P Osteosarcoma (osteogenic sarcoma) Orphanet J Rare Dis 2007 2 6 10.1186/1750-1172-2-6 17244349 PMC1794406 Picci P. Osteosarcoma (osteogenic sarcoma). Orphanet J Rare Dis. 2007;2:6. 17244349 10.1186/1750-1172-2-6 PMC1794406 58. Lindsay SL, Barnett SC. Therapeutic potential of niche-specific mesenchymal stromal cells for spinal cord injury repair. Cells. 2021;10(4). 10.3390/cells10040901 PMC8070966 33919910 59. Kim S Park J Han A Li J Microfluidic systems for axonal growth and regeneration research Neural Regen Res 2014 9 19 1703 5 10.4103/1673-5374.143412 25422629 PMC4238156 Kim S, Park J, Han A, Li J. Microfluidic systems for axonal growth and regeneration research. Neural Regen Res. 2014;9(19):1703–5. 25422629 10.4103/1673-5374.143412 PMC4238156 60. Millet LJ Gillette MU Over a century of neuron culture: from the hanging drop to microfluidic devices Yale J Biol Med 2012 85 4 501 21 23239951 PMC3516892 Millet LJ, Gillette MU. Over a century of neuron culture: from the hanging drop to microfluidic devices. Yale J Biol Med. 2012;85(4):501–21. 23239951 PMC3516892 61. Crigler L Robey RC Asawachaicharn A Gaupp D Phinney DG Human mesenchymal stem cell subpopulations express a variety of neuro-regulatory molecules and promote neuronal cell survival and neuritogenesis Exp Neurol 2006 198 1 54 64 10.1016/j.expneurol.2005.10.029 16336965 Crigler L, Robey RC, Asawachaicharn A, Gaupp D, Phinney DG. Human mesenchymal stem cell subpopulations express a variety of neuro-regulatory molecules and promote neuronal cell survival and neuritogenesis. Exp Neurol. 2006;198(1):54–64. 16336965 10.1016/j.expneurol.2005.10.029 62. Di Pompo G Lemma S Canti L Rucci N Ponzetti M Errani C Intratumoral acidosis fosters cancer-induced bone pain through the activation of the mesenchymal tumor-associated stroma in bone metastasis from breast carcinoma Oncotarget 2017 8 33 54478 96 10.18632/oncotarget.17091 28903357 PMC5589596 Di Pompo G, Lemma S, Canti L, Rucci N, Ponzetti M, Errani C, et al. Intratumoral acidosis fosters cancer-induced bone pain through the activation of the mesenchymal tumor-associated stroma in bone metastasis from breast carcinoma. Oncotarget. 2017;8(33):54478–96. 28903357 10.18632/oncotarget.17091 PMC5589596 63. Teixeira FG Carvalho MM Sousa N Salgado AJ Mesenchymal stem cells secretome: a new paradigm for central nervous system regeneration? Cell Mol Life Sci 2013 70 20 3871 82 10.1007/s00018-013-1290-8 23456256 PMC11113366 Teixeira FG, Carvalho MM, Sousa N, Salgado AJ. Mesenchymal stem cells secretome: a new paradigm for central nervous system regeneration? Cell Mol Life Sci. 2013;70(20):3871–82. 23456256 10.1007/s00018-013-1290-8 PMC11113366 64. Bianchi E Artico M Di Cristofano C Leopizzi M Taurone S Pucci M Growth factors, their receptor expression and markers for proliferation of endothelial and neoplastic cells in human osteosarcoma Int J Immunopathol Pharmacol 2013 26 3 621 32 10.1177/039463201302600306 24067459 Bianchi E, Artico M, Di Cristofano C, Leopizzi M, Taurone S, Pucci M, et al. Growth factors, their receptor expression and markers for proliferation of endothelial and neoplastic cells in human osteosarcoma. Int J Immunopathol Pharmacol. 2013;26(3):621–32. 24067459 10.1177/039463201302600306 65. Hou CH Chen WL Lin CY Targeting nerve growth factor-mediated osteosarcoma metastasis: mechanistic insights and therapeutic opportunities using larotrectinib Cell Death Dis 2024 15 5 381 10.1038/s41419-024-06752-0 38816365 PMC11139949 Hou CH, Chen WL, Lin CY. Targeting nerve growth factor-mediated osteosarcoma metastasis: mechanistic insights and therapeutic opportunities using larotrectinib. Cell Death Dis. 2024;15(5):381. 38816365 10.1038/s41419-024-06752-0 PMC11139949 66. Adriaenssens E Vanhecke E Saule P Mougel A Page A Romon R Nerve growth factor is a potential therapeutic target in breast cancer Cancer Res 2008 68 2 346 51 10.1158/0008-5472.CAN-07-1183 18199526 Adriaenssens E, Vanhecke E, Saule P, Mougel A, Page A, Romon R, et al. Nerve growth factor is a potential therapeutic target in breast cancer. Cancer Res. 2008;68(2):346–51. 18199526 10.1158/0008-5472.CAN-07-1183 67. Aloe L Rocco ML Balzamino BO Micera A Nerve growth factor: role in growth, differentiation and controlling cancer cell development J Exp Clin Cancer Res 2016 35 1 116 10.1186/s13046-016-0395-y 27439311 PMC4955168 Aloe L, Rocco ML, Balzamino BO, Micera A. Nerve growth factor: role in growth, differentiation and controlling cancer cell development. J Exp Clin Cancer Res. 2016;35(1):116. 27439311 10.1186/s13046-016-0395-y PMC4955168 68. Thiele CJ Li Z McKee AE On Trk–the TrkB signal transduction pathway is an increasingly important target in cancer biology Clin Cancer Res 2009 15 19 5962 7 10.1158/1078-0432.CCR-08-0651 19755385 PMC2756331 Thiele CJ, Li Z, McKee AE. On Trk–the TrkB signal transduction pathway is an increasingly important target in cancer biology. Clin Cancer Res. 2009;15(19):5962–7. 19755385 10.1158/1078-0432.CCR-08-0651 PMC2756331 69. Wu R Li K Yuan M Luo KQ Nerve growth factor receptor increases the tumor growth and metastatic potential of triple-negative breast cancer cells Oncogene 2021 40 12 2165 81 10.1038/s41388-021-01691-y 33627781 Wu R, Li K, Yuan M, Luo KQ. Nerve growth factor receptor increases the tumor growth and metastatic potential of triple-negative breast cancer cells. Oncogene. 2021;40(12):2165–81. 33627781 10.1038/s41388-021-01691-y 70. Zeng J Zhang Y Shang Y Mai J Shi S Lu M CancerSCEM: a database of single-cell expression map across various human cancers Nucleic Acids Res 2022 50 D1 D1147 55 10.1093/nar/gkab905 34643725 PMC8728207 Zeng J, Zhang Y, Shang Y, Mai J, Shi S, Lu M, et al. CancerSCEM: a database of single-cell expression map across various human cancers. Nucleic Acids Res. 2022;50(D1):D1147–55. 34643725 10.1093/nar/gkab905 PMC8728207 71. Antunes BP Becker RG Brunetto AT Pavei BS de-Farias CB Rivero L Expression of neurotrophins and their receptors in primary osteosarcoma Rev Col Bras Cir 2019 46 2 e2094 10.1590/0100-6991e-20192094 31090865 Antunes BP, Becker RG, Brunetto AT, Pavei BS, de-Farias CB, Rivero L, et al. Expression of neurotrophins and their receptors in primary osteosarcoma. Rev Col Bras Cir. 2019;46(2):e2094. 31090865 10.1590/0100-6991e-20192094 72. Cortini M Avnet S Baldini N Mesenchymal stroma: role in osteosarcoma progression Cancer Lett 2017 405 90 9 10.1016/j.canlet.2017.07.024 28774797 Cortini M, Avnet S, Baldini N. Mesenchymal stroma: role in osteosarcoma progression. Cancer Lett. 2017;405:90–9. 28774797 10.1016/j.canlet.2017.07.024 73. Kim M, Kim DJ. GFRA1: A novel molecular target for the prevention of osteosarcoma chemoresistance. Int J Mol Sci. 2018;19(4). 10.3390/ijms19041078 PMC5979596 29617307 74. Ji T Guo Y Kim K McQueen P Ghaffar S Christ A Neuropilin-2 expression is inhibited by secreted Wnt antagonists and its down-regulation is associated with reduced tumor growth and metastasis in osteosarcoma Mol Cancer 2015 14 86 10.1186/s12943-015-0359-4 25890345 PMC4411772 Ji T, Guo Y, Kim K, McQueen P, Ghaffar S, Christ A, et al. Neuropilin-2 expression is inhibited by secreted Wnt antagonists and its down-regulation is associated with reduced tumor growth and metastasis in osteosarcoma. Mol Cancer. 2015;14:86. 25890345 10.1186/s12943-015-0359-4 PMC4411772 75. Amuti A Liu D Maimaiti A Yu Y Yasen Y Ma H Doxorubicin inhibits osteosarcoma progression by regulating circ_0000006/miR-646/ BDNF axis J Orthop Surg Res 2021 16 1 645 10.1186/s13018-021-02782-y 34717683 PMC8557021 Amuti A, Liu D, Maimaiti A, Yu Y, Yasen Y, Ma H, et al. Doxorubicin inhibits osteosarcoma progression by regulating circ_0000006/miR-646/ BDNF axis. J Orthop Surg Res. 2021;16(1):645. 34717683 10.1186/s13018-021-02782-y PMC8557021 76. Thier M Marz P Otten U Weis J Rose-John S Interleukin-6 (IL-6) and its soluble receptor support survival of sensory neurons J Neurosci Res 1999 55 4 411 22 10.1002/(SICI)1097-4547(19990215)55:4&#x0003c;411::AID-JNR2&#x0003e;3.0.CO;2-D 10723052 Thier M, Marz P, Otten U, Weis J, Rose-John S. Interleukin-6 (IL-6) and its soluble receptor support survival of sensory neurons. J Neurosci Res. 1999;55(4):411–22. 10723052 10.1002/(SICI)1097-4547(19990215)55:4<411::AID-JNR2>3.0.CO;2-D 77. Yang G Tang WY Resistance of interleukin-6 to the extracellular inhibitory environment promotes axonal regeneration and functional recovery following spinal cord injury Int J Mol Med 2017 39 2 437 45 10.3892/ijmm.2017.2848 28075461 Yang G, Tang WY. Resistance of interleukin-6 to the extracellular inhibitory environment promotes axonal regeneration and functional recovery following spinal cord injury. Int J Mol Med. 2017;39(2):437–45. 28075461 10.3892/ijmm.2017.2848 78. Kummer KK Zeidler M Kalpachidou T Kress M Role of IL-6 in the regulation of neuronal development, survival and function Cytokine 2021 144 155582 10.1016/j.cyto.2021.155582 34058569 Kummer KK, Zeidler M, Kalpachidou T, Kress M. Role of IL-6 in the regulation of neuronal development, survival and function. Cytokine. 2021;144:155582. 34058569 10.1016/j.cyto.2021.155582 79. Golz G Uhlmann L Ludecke D Markgraf N Nitsch R Hendrix S The cytokine/neurotrophin axis in peripheral axon outgrowth Eur J Neurosci 2006 24 10 2721 30 10.1111/j.1460-9568.2006.05155.x 17156198 Golz G, Uhlmann L, Ludecke D, Markgraf N, Nitsch R, Hendrix S. The cytokine/neurotrophin axis in peripheral axon outgrowth. Eur J Neurosci. 2006;24(10):2721–30. 17156198 10.1111/j.1460-9568.2006.05155.x 80. Tu B Du L Fan QM Tang Z Tang TT STAT3 activation by IL-6 from mesenchymal stem cells promotes the proliferation and metastasis of osteosarcoma Cancer Lett 2012 325 1 80 8 10.1016/j.canlet.2012.06.006 22743617 Tu B, Du L, Fan QM, Tang Z, Tang TT. STAT3 activation by IL-6 from mesenchymal stem cells promotes the proliferation and metastasis of osteosarcoma. Cancer Lett. 2012;325(1):80–8. 22743617 10.1016/j.canlet.2012.06.006 81. Warburg O On the origin of cancer cells Science 1956 123 3191 309 14 10.1126/science.123.3191.309 13298683 Warburg O. On the origin of cancer cells. Science. 1956;123(3191):309–14. 13298683 10.1126/science.123.3191.309 82. Wemmie JA Taugher RJ Kreple CJ Acid-sensing ion channels in pain and disease Nat Rev Neurosci 2013 14 7 461 71 10.1038/nrn3529 23783197 PMC4307015 Wemmie JA, Taugher RJ, Kreple CJ. Acid-sensing ion channels in pain and disease. Nat Rev Neurosci. 2013;14(7):461–71. 23783197 10.1038/nrn3529 PMC4307015 83. Yoneda T Hata K Nakanishi M Nagae M Nagayama T Wakabayashi H Involvement of acidic microenvironment in the pathophysiology of cancer-associated bone pain Bone 2011 48 1 100 5 10.1016/j.bone.2010.07.009 20637323 Yoneda T, Hata K, Nakanishi M, Nagae M, Nagayama T, Wakabayashi H, et al. Involvement of acidic microenvironment in the pathophysiology of cancer-associated bone pain. Bone. 2011;48(1):100–5. 20637323 10.1016/j.bone.2010.07.009 84. Edwards G Campbell T Henderson V Danaher A Wu D Srinivasan R SNAIL Transctiption factor in prostate cancer cells promotes neurite outgrowth Biochimie 2021 180 1 9 10.1016/j.biochi.2020.10.012 33132158 PMC8253511 Edwards G, Campbell T, Henderson V, Danaher A, Wu D, Srinivasan R, et al. SNAIL Transctiption factor in prostate cancer cells promotes neurite outgrowth. Biochimie. 2021;180:1–9. 33132158 10.1016/j.biochi.2020.10.012 PMC8253511 85. Jerard C Madhusudanan P Swamy A Ravikumar K Shankarappa SA Secretome mediated interactions between sensory neurons and breast cancer cells Int J Cancer 2023 153 2 427 36 10.1002/ijc.34529 37067100 Jerard C, Madhusudanan P, Swamy A, Ravikumar K, Shankarappa SA. Secretome mediated interactions between sensory neurons and breast cancer cells. Int J Cancer. 2023;153(2):427–36. 37067100 10.1002/ijc.34529 86. Hirth M Gandla J Hoper C Gaida MM Agarwal N Simonetti M CXCL10 and CCL21 promote migration of pancreatic cancer cells toward sensory neurons and neural remodeling in tumors in mice, associated with pain in patients Gastroenterology 2020 159 2 665 81 10.1053/j.gastro.2020.04.037 32330476 Hirth M, Gandla J, Hoper C, Gaida MM, Agarwal N, Simonetti M, et al. CXCL10 and CCL21 promote migration of pancreatic cancer cells toward sensory neurons and neural remodeling in tumors in mice, associated with pain in patients. Gastroenterology. 2020;159(2):665–81. e13. 32330476 10.1053/j.gastro.2020.04.037 87. Pundavela J Demont Y Jobling P Lincz LF Roselli S Thorne RF ProNGF correlates with Gleason score and is a potential driver of nerve infiltration in prostate cancer Am J Pathol 2014 184 12 3156 62 10.1016/j.ajpath.2014.08.009 25285721 Pundavela J, Demont Y, Jobling P, Lincz LF, Roselli S, Thorne RF, et al. ProNGF correlates with Gleason score and is a potential driver of nerve infiltration in prostate cancer. Am J Pathol. 2014;184(12):3156–62. 25285721 10.1016/j.ajpath.2014.08.009 88. Schulte-Herbruggen O Nassenstein C Lommatzsch M Quarcoo D Renz H Braun A Tumor necrosis factor-alpha and interleukin-6 regulate secretion of brain-derived neurotrophic factor in human monocytes J Neuroimmunol 2005 160 1–2 204 9 10.1016/j.jneuroim.2004.10.026 15710474 Schulte-Herbruggen O, Nassenstein C, Lommatzsch M, Quarcoo D, Renz H, Braun A. Tumor necrosis factor-alpha and interleukin-6 regulate secretion of brain-derived neurotrophic factor in human monocytes. J Neuroimmunol. 2005;160(1–2):204–9. 15710474 10.1016/j.jneuroim.2004.10.026 89. Nakanishi T Takahashi K Aoki C Nishikawa K Hattori T Taniguchi S Expression of nerve growth factor family neurotrophins in a mouse osteoblastic cell line Biochem Biophys Res Commun 1994 198 3 891 7 10.1006/bbrc.1994.1127 8117293 Nakanishi T, Takahashi K, Aoki C, Nishikawa K, Hattori T, Taniguchi S. Expression of nerve growth factor family neurotrophins in a mouse osteoblastic cell line. Biochem Biophys Res Commun. 1994;198(3):891–7. 8117293 10.1006/bbrc.1994.1127 ",
  "metadata": {
    "Title of this paper": "Expression of nerve growth factor family neurotrophins in a mouse osteoblastic cell line",
    "Journal it was published in:": "Journal of Experimental & Clinical Cancer Research : CR",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487423/"
  }
}