{
  "title": "Paper_752",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473851 PMC12473851.1 12473851 12473851 41012551 10.3390/pharmaceutics17091216 pharmaceutics-17-01216 1 Review Nanoformulation-Based Transdermal Drug Delivery: A Paradigm Shift in Antiparasitic Therapy for Zoonotic Diseases Zhao Yuan 1 2 † Xiu Ruoxuan 1 2 † Wang Chengxiang 1 2 Wang Junqi 1 2 Guo Dawei 1 2 https://orcid.org/0000-0002-5170-1670 Luo Wanhe 3 4 Jiang Shanxiang 1 2 Ge Zhiyi 3 4 * Gao Xiuge 1 2 * Muzzalupo Rita Academic Editor Zannella Carla Academic Editor De Filippis Anna Academic Editor 1 2023807142@stu.njau.edu.cn 2024807139@stu.njau.edu.cn cxw55@stu.njau.edu.cn 2021207003@stu.njau.edu.cn gdawei0123@njau.edu.cn jiangsx66@njau.edu.cn 2 3 luowanhe0728@163.com 4 * gzy20220620@163.com vetgao@njau.edu.cn † These authors contribute equally to this work. 18 9 2025 9 2025 17 9 497664 1216 24 8 2025 14 9 2025 16 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Nanoparticle-based transdermal drug delivery systems (TDDS) have emerged as a revolutionary approach for antiparasitic therapy, addressing key challenges such as poor bioavailability, systemic toxicity, and drug resistance. This review highlights the advancements in nanotechnology-driven TDDS for combating zoonotic parasitic diseases, including leishmaniasis, malaria, and infections treated by broad-spectrum drugs like ivermectin and albendazole. By leveraging nanocarriers such as liposomes, nanoemulsions, and microneedles, which enhance skin permeation, enable controlled drug release, and improve targeting specificity. For instance, deformable transfersomes and ethosomes achieve high transdermal efficiency without chemical adjuvants, while microneedle arrays physically bypass the stratum corneum for precise delivery. Furthermore, sustained-release hydrogels and stimuli-responsive nanoparticles optimize therapeutic efficacy and reduce adverse effects. Despite promising results, clinical translation faces challenges in manufacturing scalability, long-term safety, and accessibility in resource-limited settings. Future directions include bioinspired nanocarriers, artificial intelligence (AI)-driven design, and integration with global health initiatives like “One Health”, all aimed at ensuring equitable implementation. This review highlights the transformative potential of nanotechnology in achieving sustainable antiparasitic solutions for zoonotic diseases. nanoparticles transdermal drug delivery antiparasitic drug leishmaniasis malaria one health zoonotic diseases Engineering Laboratory for Tarim Animal Diseases Diagnosis and Control of Xinjiang Production and Construction Production & Construction Corps ELDC202403 Priority Academic Program Development of Jiangsu Higher Education Institutions (PAPD) This study was funded by the opening project of the Engineering Laboratory for Tarim Animal Diseases Diagnosis and Control of Xinjiang Production and Construction Production & Construction Corps (ELDC202403) and a Project Funded by the Priority Academic Program Development of Jiangsu Higher Education Institutions (PAPD). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction According to the World Health Organization’s 2024 report on Neglected Tropical Diseases (NTDs), parasitic infections remain a devastating global health burden, affecting over a billion people worldwide and causing significant morbidity, mortality, and socioeconomic disruption, particularly in resource-limited regions [ 1 1 2 3 1 1 Figure 1 Among the various strategies to combat parasitic diseases, transdermal drug delivery systems have received a lot of attention due to their unique advantages [ 4 5 6 7 8 9 Nanotechnology is often defined as the ability to produce and process materials at the nanoscale or to manipulate nano-objects. The nanoscale is often specified as 1 to 100 nm in the field of physics because the electromagnetic and quantum characteristics of nano-objects are more prominent in this scale [ 10 11 This review focuses on the application of nanotechnology in transdermal treatment systems for parasitic diseases, summarizing its mechanisms of action and the important role it plays in malaria, leishmaniasis, and broad-spectrum antiparasitic drugs. By placing this discussion within the framework of the “One Health” approach, we aim to provide insights that can inform future health policy directions and contribute to the development of innovative and sustainable strategies for combating zoonotic parasitic diseases. 2. Advantages of Nano Transdermal Delivery System 2.1. Transdermal Mechanism of Nanoformulations As the primary physical barrier protecting the human body against external stimuli, the brick-and-mortar structure of the stratum corneum in the outermost epidermal layer severely restricts the transdermal permeation efficiency of conventional drugs through the highly ordered arrangement of intercellular lipids. Nanocarriers break this barrier through a multidimensional synergistic mechanism, significantly enhancing the delivery efficacy of anti-parasitic drugs. The specific mechanisms are as follows and summarized in Figure 2 The transdermal mechanisms of liposomes involve synergistic effects through multiple pathways: First, the phospholipids in liposomes exhibit high compatibility with stratum corneum lipids, leading to structural disintegration of liposomes and subsequent release of phospholipids. These released phospholipids infiltrate the stratum corneum and reorganize into lamellar structures, thereby widening lipid intercellular channels and enhancing drug permeation [ 12 13 14 15 16 17 18 9 19 20 21 22 Nanoemulsions significantly enhance transdermal drug permeation through a triple synergistic mechanism. First, surfactant components disrupt the lipid arrangement in the stratum corneum while expanding intercellular spaces through hydration, creating permeation pathways for drug molecules [ 23 24 9 25 26 Microneedle arrays (MNs), composed of needle-like structures with diameters of several micrometers, penetrate the skin surface to create microchannels, providing an innovative solution for transdermal drug delivery. MNs overcome the limitations of traditional methods through precise targeting capability, offering higher safety, efficacy, and painless administration [ 27 28 29 30 31 2 32 14 18 9 23 27 In summary, although liposomes, transfersomes, ethosomes, nanoemulsions, and microneedle arrays all aim to overcome the stratum corneum barrier, their mechanisms and optimal applications differ significantly. Liposomes rely on biocompatibility and fusion with skin lipids, making them suitable for delivering a wide range of drugs, but their penetration efficiency is inherently limited. Transfersomes and ethosomes, as optimized versions, achieve enhancer-free transdermal delivery through superior deformability (imparted by surfactants or high-concentration ethanol, respectively), making them particularly effective for hydrophobic drugs. Nanoemulsions leverage the synergistic effects of surfactant-induced disruption and solubilization, offering greater potential for scalable manufacturing. In contrast, microneedles provide a paradigm-shifting physical strategy that completely bypasses the stratum corneum, enabling the most precise control over drug release and the highest delivery efficiency, albeit with challenges related to production cost and mechanical integrity. Consequently, the selection of an appropriate nanocarrier must be guided by a holistic consideration of drug properties, target disease, production costs, and the intended clinical application. 2.2. Controlled Release and Targeted Delivery of Nanoformulations The success of antiparasitic therapy relies not only on efficient drug penetration through the skin barrier but also on achieving long-acting and low-toxicity therapeutic outcomes through precise controlled-release [ 33 34 35 36 The sustained-release mechanisms of transdermal nanoformulations achieve high-efficiency antiparasitic therapy through multi-mechanism synergy. Controlled-release carriers such as liposomes [ 37 34 36 38 39 40 41 42 Additionally, hydrogels have emerged as ideal topical drug delivery vehicles. Hydrogels have garnered significant attention due to their unique properties, including low cost, excellent biocompatibility, non-toxicity, stimuli-responsive behavior, and tunable drug release kinetics [ 43 44 45 The passive targeting effect of transdermal nanoformulations primarily optimizes skin penetration efficiency through the physical properties of carriers (e.g., particle size, deformability). For example, trifluralin-loaded transfersomes, with a nanoscale particle size of 140.3 ± 2.3 nm and a high deformation index (DI = 43.5 ± 1.0), can permeate through microscopic pores in the stratum corneum [ 20 20 20 46 19 47 48 The deep integration of these mechanisms and advantages marks the transition of nanocarrier-based transdermal delivery systems into a new era of precision and long-acting performance in antiparasitic therapy. Currently, this technology has displayed significant clinical value in zoonotic parasitic diseases such as leishmaniasis and malaria. Its specific applications and future challenges will be systematically discussed below. 3. Application of Nanoformulations in the Treatment of Parasitic Diseases Nanotechnology-based systems, leveraging their unique technological advantages, provide highly promising solutions for antiparasitic drug delivery. The application of nanocarriers significantly enhances drug targeting specificity, effectively protects drugs or immunotherapeutic agents from extracellular degradation, and optimizes biopharmaceutical and pharmacological properties, thereby improving therapeutic efficacy while reducing side effects [ 49 3.1. Leishmaniasis Leishmaniasis, caused by protozoan parasites of the genus Leishmania (family Trypanosomatidae), is transmitted through the bite of infected sand flies, resulting in a spectrum of clinical manifestations including visceral (VL), cutaneous (CL), mucosal (ML), and mucocutaneous leishmaniasis (MCL) [ 50 51 51 52 53 54 Current pharmacotherapy for Leishmaniasis faces multifaceted limitations, including drug toxicity, pathogen resistance, and restricted access to treatment resources, particularly in low-income regions. First-line pentavalent antimonials have been progressively phased out due to widespread resistance [ 55 56 57 58 59 Transdermal delivery technologies have undergone multistage iterative optimization. Early research focused on nanoemulsions: a chalcone nanoemulsion has been developed using a mixed system of anionic and nonionic surfactants, which enhanced dermal permeation of trans-chalcone and 3′-(trifluoromethyl)-chalcone by 1.26-fold and 2.41-fold, respectively [ 25 60 61 25 ® 26 20 50 20 50 21 31 62 To enhance the safety profile and immunomodulatory efficacy of nanoformulations, breakthroughs have been achieved across multiple dimensions. In nanomaterial innovation, silymarin-selenium nanoparticles exhibit a skin deposition rate of 82.21%, which reduced local toxicity by inhibiting trypanothione reductase activity and improving cytocompatibility [ 63 Figure 3 50 46 45 64 Functionalized nanomaterials synergize intelligent drug release with multimodal mechanisms to promote chronic ulcer repair. On the basis of this mechanism, engineered chitosan-polyethylene oxide nanofibers loaded with berberine have been successfully designed, achieving gradient release over 14 days (80% released within the first 3 days). This system demonstrated potent larvae growth inhibition (IC 50 41 42 65 66 Nanoparticle-based transdermal delivery technologies, through strategies such as deformable nanocarriers, microneedle patches, and smart hydrogels, have significantly enhanced transdermal efficiency and targeting specificity in the treatment of Leishmaniasis, while reducing systemic toxicity via sustained-release designs. However, their clinical translation remains constrained by manufacturing complexity, insufficient long-term biosafety validation, and accessibility challenges in resource-limited regions. Future efforts should prioritize the development of intelligent responsive systems (e.g., enzyme/pH dual-sensitive hydrogels), artificial intelligence (AI)-driven carrier optimization, and multimechanistic combination therapies. Concurrently, leveraging global health governance frameworks such as the “One Health” initiative will be critical to advancing technological equity and accelerating the elimination of cutaneous leishmaniasis. 3.2. Malaria Malaria is a major infectious disease that causes severe morbidity, mortality, and economic burden globally [ 67 68 68 69 The treatment of malaria mainly depends on chemical drugs such as chloroquine, lumefantrine, primaquine, artemisinin, and its derivatives. While these drugs have achieved certain effectiveness in controlling malaria, their effectiveness is increasingly influenced by various factors, including the emergence of multidrug resistance, nonspecific targeting of intracellular parasites, low solubility and bioavailability of the drugs, and significant toxicity of the medications [ 70 71 72 72 68 Improving drug targeting specificity represents a core breakthrough direction in nanotechnology. Ethosomes containing artesunate and febrifugine into a patch matrix to form a composite transdermal patch have been prepared, achieving 8 h cumulative permeation 1.57 times higher than conventional patches, with 100% parasite clearance and zero recurrence, demonstrating the high efficiency of transdermal delivery [ 22 73 74 74 75 Figure 3 48 47 47 48 To combat drug resistance, scientists have significantly enhanced therapeutic efficacy through co-delivery systems and novel mechanism designs. Aderibigbe’s team has developed an Arabic hydrogel dual-drug loading system co-encapsulating 4-aminoquinoline and curcumin that, by leveraging differential release kinetics (short-term anomalous transport and long-term quasi-Fickian diffusion), achieved synergistic effects, providing a new strategy for antiparasitic combination therapies [ 38 39 76 77 In addressing systemic toxicity reduction, nanotechnology strategies focusing on localized controlled release and biocompatibility optimization have demonstrated remarkable efficacy. Nnamani et al. developed an artemether-loaded nanostructured lipid carrier hydrogel, which forms a localized drug reservoir through transdermal penetration, achieved a 26% cumulative permeation rate over 48 h, significantly enhanced drug stability, release controllability, and demonstrated no observable systemic exposure [ 78 72 ® 79 79 Looking forward, although nanoparticle-based drug delivery technologies have demonstrated advantages in targeting specificity and safety profiles, their large-scale application still requires overcoming cost constraints and manufacturing barriers to provide sustainable technological support for global malaria eradication. Beyond the prominent examples of leishmaniasis and malaria, the versatility of nanotransdermal delivery systems holds significant promise for addressing a broader spectrum of zoonotic parasitic infections. This potential is further amplified by the convergence of nanotechnologies across different administration routes, a pivotal development exemplified by the success of nanoformulations for diseases like Chagas disease via oral or parenteral routes [ 80 81 82 29 83 84 85 4. Nanoformulations in Broad-Spectrum Antiparasitic Drugs Beyond targeted therapies against specific pathogens (e.g., Leishmania, Plasmodium), nanoparticle-based transdermal delivery technologies have provided revolutionary solutions for enhancing the application of conventional broad-spectrum antiparasitic drugs. Taking avermectin and albendazole as examples, both exhibit high efficacy against a wide range of endo- and ectoparasites; however, their conventional administration routes, such as oral administration, are limited by low bioavailability, systemic toxicity, and poor patient compliance [ 32 40 Table 1 4.1. Avermectin-Class Drugs Avermectin-class drugs such as avermectin, ivermectin and eprinomectin play an indispensable role in veterinary and human parasitic disease control due to their exceptional broad-spectrum antiparasitic activity [ 91 84 92 93 85 88 88 Early studies focused on solubility optimization and enhancement of the transdermal permeation efficiency of avermectin-class drugs. For instance, Das et al. pioneered a breakthrough with ivermectin-loaded microemulsion-based gel formulations using nanoscale technology, where in vitro membrane permeability assays demonstrated superior permeation advantages, enabling low-dose drugs to achieve equivalent or better efficacy compared to conventional formulations [ 86 87 88 88 Figure 4 To balance efficacy and safety of antiparasitic drugs, controlled-release technology has become a key research focus. Ivermectin-loaded solid lipid nanoparticles exhibiting excellent sustained-release efficacy, with their targeting capability significantly reducing systemic toxicity and side effects [ 40 ® 90 89 89 From solubility breakthroughs in microemulsion-based gels [ 86 90 88 40 This figure illustrates the mechanism of ivermectin nanoemulsion (IVM-NE) in treating strongyloidiasis. IVM-NE, with favorable drug-release ability, releases ivermectin (IVM). IVM acts on glutamate-gated Cl − 4.2. Benzimidazole-Class Drugs Benzimidazole-class drugs constitute the cornerstone of antihelminthic therapy [ 94 95 32 First, drug morphology reconstruction using carriers like solid lipid nanoparticles, the solubility kinetics of albendazole have been significantly improved. Permana et al. formulated albendazole into nanocrystals, achieving 89.92% cumulative drug release over 24 h in vitro with a 3.2-fold accelerated release rate [ 81 32 Second, the application of dissolving microneedles (DMNs) and hydrogel-forming microneedles (HFM) has overcome skin barrier limitations, enabling precision drug delivery. Based on this nanoformulation, an albendazole-loaded dissolving microneedles-nanocrystals system achieved a penetration depth of 505.29 μm in ex vivo porcine skin, with a peak dermal drug concentration of 1891.53 μg/cm 3 81 83 Figure 5 2 32 Third, the sustained-release design of solid lipid nanoparticles and nanocrystals significantly prolongs drug action duration. Permana et al. demonstrated that the dissolving microneedles-nanocrystals system extended the drug half-life to 136 h (versus 3.54 h for oral nanocrystals) [ 81 83 32 Collectively, nanotransdermal formulations for benzimidazole class drugs through a synergistic mechanism integrating ‘dissolution enhancement, delivery potentiation, and toxicity control’ have achieved a breakthrough in both relative bioavailability and lymphatic targeting efficiency, providing highly effective, long-acting, and low-toxicity innovative solutions for cystic echinococcosis [ 32 81 83 5. Summary and Perspectives Nanoparticle-based transdermal drug delivery systems, leveraging their unique delivery mechanisms and precisely controlled-release capabilities, have pioneered revolutionary pathways for antiparasitic drug development. Nanoformulations, including liposomes, nanoemulsions, and microneedles, nanocarriers overcome the physical barrier of the stratum corneum, significantly enhancing local drug permeation efficiency and targeting specificity, while decreasing first-pass metabolism and systemic toxicity associated with conventional administration routes. However, translating these promising nanoparticle-based formulations from laboratory research to clinical application still requires overcoming interrelated challenges in technology, production, and clinical translation. Current challenges primarily revolve around the conflict between skin barrier penetration efficiency and targeting precision. The complex structure of the skin and the dynamic physiological microenvironment may compromise the stability of nanocarriers and their efficiency in achieving precise drug release. Moreover, the multi-stage life cycle and tissue tropism characteristics of parasites necessitate highly intelligent targeting strategies. Current environmentally responsive carriers, such as pH-sensitive systems, still face challenges in ensuring that their release kinetics fully align with the pathological microenvironmental fluctuations at the infection site. Beyond technical performance, scalable manufacturing and rigorous safety evaluation remain significant bottlenecks. Issues such as batch-to-batch variability in encapsulation efficiency, insufficient long-term storage stability, and complex quality control standards pose major obstacles to industrial production. In resource-limited regions, high production costs and low-temperature storage requirements (e.g., lyophilization processes) further limit technological accessibility. Meanwhile, the long-term biosafety of nanomaterials remains incompletely characterized. Potential risks such as dermal irritation, immunogenicity, and systemic accumulation effects require validation through more comprehensive evaluation systems, including 3D skin models and computational toxicology. Most critically, its clinical translation and commercialization pathway still require substantial refinement, particularly in providing more detailed evidence regarding clinical trials, regulatory approval, and economic viability. The current evidence base is primarily built on in vitro and preclinical animal studies, while large-scale clinical trial data necessary for advancing to clinical application remain scarce. The regulatory approval pathway for nanomedicines is complex and lacks a fully standardized framework, requiring comprehensive characterization and strict review by agencies such as the FDA and EMA regarding the in vivo behavior, stability, and potential toxicity of nanoformulations. Finally, economic viability is crucial in determining its accessibility. The high costs associated with complex materials, sophisticated manufacturing processes, and potential cold-chain storage requirements hinder the application of this technology in low-income regions where it is most needed. The underlying root cause of the aforementioned economic feasibility challenges lies in a core contradiction within the public health domain. While malaria and leishmaniasis receive prioritized support from international organizations, nanopharmaceutical research and development for most neglected tropical diseases (NTDs) (e.g., onchocerciasis, schistosomiasis) remains reliant on non-profit funding with weak commercial drivers. Strategically leveraging policy instruments (e.g., the Medicines Patent Pool, MPP) and regional collaborations to reduce costs, coupled with advancing generic drug manufacturing at scale, has become pivotal to achieving equitable technological accessibility. Therefore, to systematically address the multi-faceted challenges described above, it requires not only continuous innovation in fundamental research but also hinges critically on the rational selection of nanoplatforms tailored to specific application contexts. For instance, functionalized liposomes and transfersomes, with their superior intracellular delivery capabilities, tend to be the preferred candidates for managing intracellular infections like leishmaniasis. In contrast, for broad-spectrum anthelmintics that require high-dose and long-term administration, scalable nanoemulsions or sustained-release nanocrystals may offer more practical advantages due to their manufacturing feasibility. Meanwhile, microneedle technology holds unique potential for one-off vaccination or precise lymphatic targeting applications, albeit at a higher unit cost. This strategic selection process itself is a critical step toward viable applications. Looking forward, breakthroughs in nanotechnology-based transdermal drug delivery systems will require multidimensional innovation strategies. At the scientific frontier, the development of bioinspired nanocarriers (e.g., parasite membrane-camouflaged systems) and intelligent responsive materials (e.g., thermo/enzyme-sensitive hydrogels) holds promise for achieving spatiotemporal dynamic drug release. The integration of microneedle arrays with nanotechnology could mechanically breach the skin barrier while enabling precise modulation of drug release kinetics. Technologically, artificial intelligence (AI)-driven carrier design (e.g., machine learning-optimized lipid compositions) and modular manufacturing processes (e.g., microfluidic continuous-flow technology) are expected to significantly shorten research and development cycles and reduce costs. Furthermore, advancing the global health governance framework—particularly through the “One Health” initiative—could accelerate technology translation via public–private partnerships, while developing region-adapted formulations (e.g., prefilled microneedle patches) for low-resource settings. Transdermal delivery of nanoformulation represents not merely a technological innovation but a critical practice in advancing global health equity. Only by overcoming the systemic barriers among penetration efficiency, targeting precision, manufacturing feasibility, and health policy alignment can we translate this potential into life-saving therapeutics, ultimately advancing the vision of the elimination of neglected tropical diseases. Acknowledgments We thank the BioRender team ( www.biorender.com Disclaimer/Publisher’s Note: Author Contributions Conceptualization, X.G. and Z.G.; Formal analysis, J.W.; Data curation, Y.Z., R.X. and C.W.; Investigation, Y.Z. and R.X.; writing—original draft preparation, Y.Z., R.X. and X.G.; visualization, R.X.; writing—review and editing, C.W., J.W., D.G., W.L., S.J., Z.G. and X.G.; Validation, D.G., W.L., Z.G. and X.G.; Supervision, S.J., Z.G. and X.G.; funding acquisition, Z.G. and X.G.; All authors have read and agreed to the published version of the manuscript. Data Availability Statement No new data were created during the writing of this review article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Global Report on Neglected Tropical Diseases 2024 Available online: https://www.who.int/teams/control-of-neglected-tropical-diseases/global-report-on-neglected-tropical-diseases-2024 (accessed on 1 May 2025) 2. Otranto D. Strube C. Xiao L. Zoonotic Parasites: The One Health Challenge Parasitol. Res. 2021 120 4073 4074 10.1007/s00436-021-07221-9 34142224 PMC8211557 3. Sokolow S.H. Wood C.L. Jones I.J. Swartz S.J. Lopez M. Hsieh M.H. Lafferty K.D. Kuris A.M. Rickards C. De Leo G.A. Global Assessment of Schistosomiasis Control Over the Past Century Shows Targeting the Snail Intermediate Host Works Best PLoS Negl. Trop. Dis. 2016 10 e0004794 10.1371/journal.pntd.0004794 27441556 PMC4956325 4. Alkilani A.Z. McCrudden M.T.C. Donnelly R.F. Transdermal Drug Delivery: Innovative Pharmaceutical Developments Based on Disruption of the Barrier Properties of the Stratum Corneum Pharmaceutics 2015 7 438 470 10.3390/pharmaceutics7040438 26506371 PMC4695828 5. Bruno B.J. Miller G.D. Lim C.S. Basics and Recent Advances in Peptide and Protein Drug Delivery Ther. Deliv. 2013 4 1443 1467 10.4155/tde.13.104 24228993 PMC3956587 6. Patlolla R.R. Desai P.R. Belay K. Singh M.S. Trans Location of Cell Penetrating Peptide Engrafted Nanoparticles across Skin Layers Biomaterials 2010 31 5598 5607 10.1016/j.biomaterials.2010.03.010 20413152 PMC2875303 7. Ashtikar M. Langelüddecke L. Fahr A. Deckert V. Tip-Enhanced Raman Scattering for Tracking of Invasomes in the Stratum Corneum Biochim. Biophys. Acta (BBA)—Gen. Subj. 2017 1861 2630 2639 10.1016/j.bbagen.2017.07.003 28689988 8. Schoellhammer C.M. Blankschtein D. Langer R. Skin Permeabilization for Transdermal Drug Delivery: Recent Advances and Future Prospects Expert Opin. Drug Deliv. 2014 11 393 407 10.1517/17425247.2014.875528 24392787 PMC3980659 9. Zhou X. Hao Y. Yuan L. Pradhan S. Shrestha K. Pradhan O. Liu H. Li W. Nano-Formulations for Transdermal Drug Delivery: A Review Chin. Chem. Lett. 2018 29 1713 1724 10.1016/j.cclet.2018.10.037 10. Weng Y. Liu J. Jin S. Guo W. Liang X. Hu Z. Nanotechnology-Based Strategies for Treatment of Ocular Disease Acta Pharm. Sin. B 2017 7 281 291 10.1016/j.apsb.2016.09.001 28540165 PMC5430571 11. Kayser O. Kiderlen A.F. Delivery Strategies for Antiparasitics Expert Opin. Investig. Drugs 2003 12 197 207 10.1517/13543784.12.2.197 12556214 12. Laouini A. Charcosset C. Fessi H. Holdich R.G. Vladisavljević G.T. Preparation of Liposomes: A Novel Application of Microengineered Membranes-From Laboratory Scale to Large Scale Colloids Surf. B Biointerfaces 2013 112 272 278 10.1016/j.colsurfb.2013.07.066 23999143 13. Kato A. Ishibashi Y. Miyake Y. Effect of Egg Yolk Lecithin on Transdermal Delivery of Bunazosin Hydrochloride J. Pharm. Pharmacol. 1987 39 399 400 10.1111/j.2042-7158.1987.tb03407.x 2886592 14. Kirjavainen M. Urtti A. Jääskeläinen I. Marjukka Suhonen T. Paronen P. Valjakka-Koskela R. Kiesvaara J. Mönkkönen J. Interaction of Liposomes with Human Skin In Vitro—The Influence of Lipid Composition and Structure Biochim. Biophys. Acta (BBA)—Lipids Lipid Metab. 1996 1304 179 189 10.1016/S0005-2760(96)00126-9 8982264 15. Kirjavainen M. Mönkkönen J. Saukkosaari M. Valjakka-Koskela R. Kiesvaara J. Urtti A. Phospholipids Affect Stratum Corneum Lipid Bilayer Fluidity and Drug Partitioning into the Bilayers J. Control. Release 1999 58 207 214 10.1016/S0168-3659(98)00152-7 10053193 16. El Maghraby G.M.M. Williams A.C. Barry B.W. Can Drug-Bearing Liposomes Penetrate Intact Skin? J. Pharm. Pharmacol. 2006 58 415 429 10.1211/jpp.58.4.0001 16597359 17. Akram M.W. Jamshaid H. Rehman F.U. Zaeem M. Khan J.Z. Zeb A. Transfersomes: A Revolutionary Nanosystem for Efficient Transdermal Drug Delivery AAPS PharmSciTech 2021 23 7 10.1208/s12249-021-02166-9 34853906 18. Sala M. Diab R. Elaissari A. Fessi H. Lipid Nanocarriers as Skin Drug Delivery Systems: Properties, Mechanisms of Skin Interactions and Medical Applications Int. J. Pharm. 2018 535 1 17 10.1016/j.ijpharm.2017.10.046 29111097 19. Raj A. Sarath C.C. Anoop N.V. Ivon A. Nazeera F.N.M. Neethu N.P.P. Lipid-Based Vesicles: A Non-Invasive Tool for Transdermal Drug Delivery J. Pharm. Innov. 2022 17 1039 1052 10.1007/s12247-021-09572-3 20. Khan A.U. Jamshaid H. Ud Din F. Zeb A. Khan G.M. Designing, Optimization and Characterization of Trifluralin Transfersomal Gel to Passively Target Cutaneous Leishmaniasis J. Pharm. Sci. 2022 111 1798 1811 10.1016/j.xphs.2022.01.010 35081406 21. Bashir S. Shabbir K. Din F.U. Khan S.U. Ali Z. Khan B.A. Kim D.W. Khan G.M. Nitazoxanide and Quercetin Co-Loaded Nanotransfersomal Gel for Topical Treatment of Cutaneous Leishmaniasis with Macrophage Targeting and Enhanced Anti-Leishmanial Effect Heliyon 2023 9 e21939 10.1016/j.heliyon.2023.e21939 38027656 PMC10661431 22. Shen S. Liu S.-Z. Zhang Y.-S. Du M.-B. Liang A.-H. Song L.-H. Ye Z.-G. Compound Antimalarial Ethosomal Cataplasm: Preparation, Evaluation, and Mechanism of Penetration Enhancement Int. J. Nanomed. 2015 10 4239 4253 10.2147/IJN.S83402 26170661 PMC4494185 23. Naseema A. Kovooru L. Behera A.K. Kumar K.P.P. Srivastava P. A Critical Review of Synthesis Procedures, Applications and Future Potential of Nanoemulsions Adv. Colloid. Interface Sci. 2021 287 102318 10.1016/j.cis.2020.102318 33242713 24. Sghier K. Mur M. Veiga F. Paiva-Santos A.C. Pires P.C. Novel Therapeutic Hybrid Systems Using Hydrogels and Nanotechnology: A Focus on Nanoemulgels for the Treatment of Skin Diseases Gels 2024 10 45 10.3390/gels10010045 38247768 PMC10815052 25. Coelho D. Veleirinho B. Mazzarino L. Alberti T. Buzanello E. Oliveira R.E. Yunes R.A. Moraes M. Steindel M. Maraschin M. Polyvinyl Alcohol-Based Electrospun Matrix as a Delivery System for Nanoemulsion Containing Chalcone against Leishmania (Leishmania) Amazonensis Colloids Surf. B Biointerfaces 2021 198 111390 10.1016/j.colsurfb.2020.111390 33208279 26. Garcia D.J. Fernandez-Culma M. Upegui Y.A. Rios-Vasquez L.A. Quinones W. Ocampo-Cardona R. Echeverri F. Velez I.D. Robledo S.M. Nanoemulsions for Increased Penetrability and Sustained Release of Leishmanicidal Compounds Arch. Pharm. 2023 356 e202300108 10.1002/ardp.202300108 37068175 27. Lee J.W. Han M.-R. Park J.-H. Polymer Microneedles for Transdermal Drug Delivery J. Drug Target. 2013 21 211 223 10.3109/1061186X.2012.741136 23167609 28. Li R. Zhang L. Jiang X. Li L. Wu S. Yuan X. Cheng H. Jiang X. Gou M. 3D-Printed Microneedle Arrays for Drug Delivery J. Control. Release 2022 350 933 948 10.1016/j.jconrel.2022.08.022 35977583 29. Gunawan M. Bestari A.N. Ramadon D. Efendi A. Boonkanokwong V. Combination of Lipid-Based Nanoparticles with Microneedles as a Promising Strategy for Enhanced Transdermal Delivery Systems: A Comprehensive Review J. Drug Deliv. Sci. Technol. 2025 107 106807 10.1016/j.jddst.2025.106807 30. Dumitriu Buzia O. Păduraru A.M. Stefan C.S. Dinu M. Cocoș D.I. Nwabudike L.C. Tatu A.L. Strategies for Improving Transdermal Administration: New Approaches to Controlled Drug Release Pharmaceutics 2023 15 1183 10.3390/pharmaceutics15041183 37111667 PMC10143057 31. Zare M.R. Khorram M. Barzegar S. Sarkari B. Asgari Q. Ahadian S. Zomorodian K. Dissolvable Carboxymethyl Cellulose/Polyvinylpyrrolidone Microneedle Arrays for Transdermal Delivery of Amphotericin B to Treat Cutaneous Leishmaniasis Int. J. Biol. Macromol. 2021 182 1310 1321 10.1016/j.ijbiomac.2021.05.075 34000308 32. Mahfufah U. Fitri Sultan N.A. Nurul Fitri A.M. Elim D. Sya’ban Mahfud M.A. Wafiah N. Ardita Friandini R. Chabib L. Aliyah Permana A.D. Application of Multipolymers System in the Development of Hydrogel-Forming Microneedle Integrated with Polyethylene Glycol Reservoir for Transdermal Delivery of Albendazole Eur. Polym. J. 2023 183 111762 10.1016/j.eurpolymj.2022.111762 33. Sharma S. Rawat K. Bohidar H.B. Role of Nanomedicines in Controlling Malaria: A Review Curr. Top. Med. Chem. 2023 23 1477 1488 10.2174/1568026623666230417083401 37073152 34. Nahanji M.K. Mahboobian M.M. Harchegani A.L. Mohebali M. Fallah M. Nourian A. Motavallihaghi S. Maghsood A.H. Enhancing the Efficacy of Fluconazole against Leishmania Major: Formulation and Evaluation of FLZ-Nanoemulsions for Topical Delivery Biomed. Pharmacother. 2024 178 117109 10.1016/j.biopha.2024.117109 39024835 35. Deshmukh R. Exploring the Potential of Antimalarial Nanocarriers as a Novel Therapeutic Approach J. Mol. Graph. Model. 2023 122 108497 10.1016/j.jmgm.2023.108497 37149980 36. Nemati S. Mottaghi M. Karami P. Mirjalali H. Development of Solid Lipid Nanoparticles-Loaded Drugs in Parasitic Diseases Discov. Nano 2024 19 7 10.1186/s11671-023-03955-w 38175309 PMC10767167 37. Azim M. Khan S.A. Osman N. Sadozai S.K. Khan I. Ameliorated Delivery of Amphotericin B to Macrophages Using Chondroitin Sulfate Surface-Modified Liposome Nanoparticles Drug Dev. Ind. Pharm. 2025 51 38 49 10.1080/03639045.2024.2443007 39679495 38. Aderibigbe B. Sadiku E. Jayaramudu J. Sinha Ray S. Controlled Dual Release Study of Curcumin and a 4-aminoquinoline Analog from Gum Acacia Containing Hydrogels J. Appl. Polym. Sci. 2015 132 app.41613 10.1002/app.41613 39. Aderibigbe B.A. Mhlwatika Z. Dual Release Kinetics of Antimalarials from Soy Protein Isolate-Carbopol-Polyacrylamide Based Hydrogels J. Appl. Polym. Sci. 2016 133 43918 10.1002/app.43918 40. Guo D. Dou D. Li X. Zhang Q. Bhutto Z.A. Wang L. Ivermection-Loaded Solid Lipid Nanoparticles: Preparation, Characterisation, Stability and Transdermal Behaviour Artif. Cells Nanomed. Biotechnol. 2018 46 255 262 10.1080/21691401.2017.1307207 28368657 41. Rahimi M. Seyyed Tabaei S.J. Ziai S.A. Sadri M. Anti-Leishmanial Effects of Chitosan-Polyethylene Oxide Nanofibers Containing Berberine: An Applied Model for Leishmania Wound Dressing Iran. J. Med. Sci. 2020 45 286 297 10.30476/IJMS.2019.45784 32801418 PMC7395954 42. Seyyed Tabaei S.J. Rahimi M. Akbaribazm M. Ziai S.A. Sadri M. Shahrokhi S.R. Rezaei M.S. Chitosan-Based Nano-Scaffolds as Antileishmanial Wound Dressing in BALB/c Mice Treatment: Characterization and Design of Tissue Regeneration Iran. J. Basic. Med. Sci. 2020 23 788 799 10.22038/ijbms.2020.41361.9770 32695296 PMC7351439 43. Golshirazi A. Mohammadzadeh M. Labbaf S. The Synergistic Potential of Hydrogel Microneedles and Nanomaterials: Breaking Barriers in Transdermal Therapy Macromol. Biosci. 2025 25 2400228 10.1002/mabi.202400228 39195571 44. Alex M. Alsawaftah N.M. Husseini G.A. State-of-All-the-Art and Prospective Hydrogel-Based Transdermal Drug Delivery Systems Appl. Sci. 2024 14 2926 10.3390/app14072926 45. Dehghani F. Farhadian N. Goyonlo V.M. Ahmadi O. A Novel Topical Formulation of the Leishmaniasis Drug Glucantime as a Nanostructured Lipid Carrier-Based Hydrogel Am. J. Trop. Med. Hyg. 2023 109 301 314 10.4269/ajtmh.23-0116 37308100 PMC10397459 46. Rabia S. Khaleeq N. Batool S. Dar M.J. Kim D.W. Din F.-U. Khan G.M. Rifampicin-Loaded Nanotransferosomal Gel for Treatment of Cutaneous Leishmaniasis: Passive Targeting Via Topical Route Nanomedicine 2020 15 183 203 10.2217/nnm-2019-0320 31916472 47. Tyagi R.K. Garg N.K. Jadon R. Sahu T. Katare O.P. Dalai S.K. Awasthi A. Marepally S.K. Elastic Liposome-Mediated Transdermal Immunization Enhanced the Immunogenicity of P. Falciparum Surface Antigen, MSP-119 Vaccine 2015 33 4630 4638 10.1016/j.vaccine.2015.06.054 26141014 48. Tyagi R.K. Garg N.K. Dalai S.K. Awasthi A. Transdermal Immunization of P-Falciparum Surface Antigen (MSP-1 19 Hum. Vaccines Immunother. 2016 12 990 992 10.1080/21645515.2015.1116656 PMC4962934 26810033 49. Puttappa N. Kumar R.S. Yamjala K. Artesunate-Quercetin/Luteolin Dual Drug Nanofacilitated Synergistic Treatment for Malaria: A Plausible Approach to Overcome Artemisinin Combination Therapy Resistance Med. Hypotheses 2017 109 176 180 10.1016/j.mehy.2017.10.016 29150282 50. Courtenay O. Peters N.C. Rogers M.E. Bern C. Combining Epidemiology with Basic Biology of Sand Flies, Parasites, and Hosts to Inform Leishmaniasis Transmission Dynamics and Control PLoS Pathog. 2017 13 e1006571 10.1371/journal.ppat.1006571 29049371 PMC5648254 51. Burza S. Croft S.L. Boelaert M. Leishmaniasis Lancet 2018 392 951 970 10.1016/S0140-6736(18)31204-2 30126638 52. Van Assche T. Deschacht M. da Luz R.A.I. Maes L. Cos P. Leishmania Free Radic. Biol. Med. 2011 51 337 351 10.1016/j.freeradbiomed.2011.05.011 21620959 53. Hussain H. Al-Harrasi A. Al-Rawahi A. Green I.R. Gibbons S. Fruitful Decade for Antileishmanial Compounds from 2002 to Late 2011 Chem. Rev. 2014 114 10369 10428 10.1021/cr400552x 25253511 54. Reithinger R. Dujardin J.-C. Louzir H. Pirmez C. Alexander B. Brooker S. Cutaneous Leishmaniasis Lancet Infect. Dis. 2007 7 581 596 10.1016/S1473-3099(07)70209-8 17714672 55. Olliaro P.L. Guerin P.J. Gerstl S. Haaskjold A.A. Rottingen J.-A. Sundar S. Treatment Options for Visceral Leishmaniasis: A Systematic Review of Clinical Studies Done in India, 1980–2004 Lancet Infect. Dis. 2005 5 763 774 10.1016/S1473-3099(05)70296-6 16310148 56. Sundar S. Chakravarty J. An Update on Pharmacotherapy for Leishmaniasis Expert Opin. Pharmacother. 2015 16 237 252 10.1517/14656566.2015.973850 25346016 PMC4293334 57. Varma D.M. Redding E.A. Bachelder E.M. Ainslie K.M. Nano- and Microformulations to Advance Therapies for Visceral Leishmaniasis ACS Biomater. Sci. Eng. 2021 7 1725 1741 10.1021/acsbiomaterials.0c01132 33966377 PMC10372633 58. Riaz A. Khan M.F.A. Jalil A. ur Rehman A. Ahmed N. Mubarak Z. Parhizkar M. Muqaddas H. Lipid-Based Nanocarriers for Topical Therapy of Cutaneous Leishmaniasis: An Insight into the Mechanism of Action ACS Omega 2025 10 23873 23888 10.1021/acsomega.5c00046 40547705 PMC12177655 59. Romero A.H. Gonzalez K.N. Sabino M.A. Application of Nano and Microformulations to Improve the Leishmanicidal Response of Quinoline Compounds: A Brief Review Front. Chem. 2025 13 1622566 10.3389/fchem.2025.1622566 40785709 PMC12331655 60. De Souza A. Marins D.S.S. Mathias S.L. Monteiro L.M. Yukuyama M.N. Scarim C.B. Löbenberg R. Bou-Chacra N.A. Promising Nanotherapy in Treating Leishmaniasis Int. J. Pharm. 2018 547 421 431 10.1016/j.ijpharm.2018.06.018 29886097 61. Santos S.S. de Araújo R.V. Giarolla J. Seoud O.E. Ferreira E.I. Searching for Drugs for Chagas Disease, Leishmaniasis and Schistosomiasis: A Review Int. J. Antimicrob. Agents 2020 55 105906 10.1016/j.ijantimicag.2020.105906 31987883 62. Alishahi M. Khorram M. Asgari Q. Davani F. Goudarzi F. Emami A. Arastehfar A. Zomorodian K. Glucantime-Loaded Electrospun Core-Shell Nanofibers Composed of Poly(Ethylene Oxide)/Gelatin-Poly(Vinyl Alcohol)/Chitosan as Dressing for Cutaneous Leishmaniasis Int. J. Biol. Macromol. 2020 163 288 297 10.1016/j.ijbiomac.2020.06.240 32610052 63. Mahmoud Abd-Alaziz D. Mansour M. Nasr M. Sammour O. Tailored Green Synthesized Silymarin-Selenium Nanoparticles: Topical Nanocarrier of Promising Antileishmanial Activity Int. J. Pharm. 2024 660 124275 10.1016/j.ijpharm.2024.124275 38797252 64. Lanza J.S. Vucen S. Flynn O. Donadei A. Cojean S. Loiseau P.M. Fernandes A.P.S.M. Frézard F. Moore A.C. A TLR9-Adjuvanted Vaccine Formulated into Dissolvable Microneedle Patches or Cationic Liposomes Protects against Leishmaniasis after Skin or Subcutaneous Immunization Int. J. Pharm. 2020 586 119390 10.1016/j.ijpharm.2020.119390 32540349 65. Maria Jose Alves De O. Regina M. Lucia Almeida B. Ademar Benevolo L. Valdir Sabbaga A. Duclerc Fernandes P. Topical Treatment of Cutaneous Leishmaniasis: Wound Reduction in Mice Using N-Methyl Glucamine from PVP and Nano Clay Membranes J. Dermatol. Res. Ther. 2016 2 10 23937 10.23937/2469-5750/1510036 66. Oliveira M.J.A.D. Villegas G.M.E. Motta F.D. Fabela-Sánchez O. Espinosa-Roa A. Fotoran W.L. Peixoto J.C. Tano F.T. Lugão A.B. Vásquez P.A.S. Influence of Gamma Radiation on Amphotericin B Incorporated in PVP Hydrogel as an Alternative Treatment for Cutaneous Leishmaniosis Acta Trop. 2021 215 105805 10.1016/j.actatropica.2020.105805 33387468 67. Puttappa N. Kumar R.S. Kuppusamy G. Radhakrishnan A. Nano-Facilitated Drug Delivery Strategies in the Treatment of Plasmodium Infection Acta Trop. 2019 195 103 114 10.1016/j.actatropica.2019.04.020 31039335 68. Mishra A. Qamar F. Ashrafi K. Fatima S. Samim M. Mohmmed A. Abdin M.Z. Emerging Nanotechnology-Driven Drug Delivery Solutions for Malaria: Addressing Drug Resistance and Improving Therapeutic Success Int. J. Pharm. 2025 670 125163 10.1016/j.ijpharm.2024.125163 39788401 69. Baruah U.K. Gowthamarajan K. Ravisankar V. Karri V.V.S.R. Simhadri P.K. Singh V. Optimisation of Chloroquine Phosphate Loaded Nanostructured Lipid Carriers Using Box-Behnken Design and Its Antimalarial Efficacy J. Drug Target. 2018 26 576 591 10.1080/1061186X.2017.1390671 29057679 70. Kuntworbe N. Martini N. Shaw J. Al-Kassas R. Malaria Intervention Policies and Pharmaceutical Nanotechnology as a Potential Tool for Malaria Management Drug Dev. Res. 2012 73 167 184 10.1002/ddr.21010 71. Santos-Magalhães N.S. Mosqueira V.C.F. Nanotechnology Applied to the Treatment of Malaria Adv. Drug Deliv. Rev. 2010 62 560 575 10.1016/j.addr.2009.11.024 19914313 72. Eastman R.T. Fidock D.A. Artemisinin-Based Combination Therapies: A Vital Tool in Efforts to Eliminate Malaria Nat. Rev. Microbiol. 2009 7 864 874 10.1038/nrmicro2239 19881520 PMC2901398 73. Kenechukwu F.C. Ugwu K.C. Chukwu G.C. Anikwe C.C. Okaudu M.C. Momoh M.A. Ricci-Junior E. Attama A.A. Transdermal Films and Nanogels as Toolboxes for Novel Generation of Non-Invasive Antimalarial Pharmaceuticals in Dermatology: A Comprehensive Review Biomed. Mater. Devices 2025 3 1 38 10.1007/s44174-025-00372-8 74. Zech J. Dzikowski R. Simantov K. Golenser J. Maeder K. Transdermal Delivery of Artemisinins for Treatment of Pre-Clinical Cerebral Malaria Int. J. Parasitol.-Drugs Drug Resist. 2021 16 148 154 10.1016/j.ijpddr.2021.05.008 34116478 PMC8203570 75. Dwivedi A. Mazumder A. Fox L.T. Brümmer A. Gerber M. Du Preez J.L. Haynes R.K. Du Plessis J. In Vitro Skin Permeation of Artemisone and Its Nano-Vesicular Formulations Int. J. Pharm. 2016 503 1 7 10.1016/j.ijpharm.2016.02.041 26930566 76. Dandekar P.P. Jain R. Patil S. Dhumal R. Tiwari D. Sharma S. Vanage G. Patravale V. Curcumin-Loaded Hydrogel Nanoparticles: Application in Anti-Malarial Therapy and Toxicological Evaluation J. Pharm. Sci. 2010 99 4992 5010 10.1002/jps.22191 20821383 77. Alfrd Mavondo G.A. Tagumirwa M.C. Asiatic Acid-Pectin Hydrogel Matrix Patch Transdermal Delivery System Influences Parasitaemia Suppression and Inflammation Reduction in P. Berghei Murine Malaria Infected Sprague—Dawley Rats Asian Pac. J. Trop. Med. 2016 9 1172 1180 10.1016/j.apjtm.2016.10.008 27955745 78. Nnamani P.O. Hansen S. Windbergs M. Lehr C.-M. Development of Artemether-Loaded Nanostructured Lipid Carrier (NLC) Formulation for Topical Application Int. J. Pharm. 2014 477 208 217 10.1016/j.ijpharm.2014.10.004 25290810 79. Ananda P.W.R. Elim D. Zaman H.S. Muslimin W. Tunggeng M.G.R. Permana A.D. Combination of Transdermal Patches and Solid Microneedles for Improved Transdermal Delivery of Primaquine Int. J. Pharm. 2021 609 121204 10.1016/j.ijpharm.2021.121204 34662646 80. Gomes D.C. Medeiros T.S. Alves Pereira E.L. Da Silva J.F.O. De Freitas Oliveira J.W. Fernandes-Pedrosa M.D.F. De Sousa Da Silva M. Da Silva-Júnior A.A. From Benznidazole to New Drugs: Nanotechnology Contribution in Chagas Disease Int. J. Mol. Sci. 2023 24 13778 10.3390/ijms241813778 37762080 PMC10530915 81. Permana A.D. Paredes A.J. Zanutto F.V. Amir M.u.h.N. Ismail I. Bahar M.u.h.A. Sumarheni Palma S.D. Donnelly R.F. Albendazole Nanocrystal-Based Dissolving Microneedles with Improved Pharmacokinetic Performance for Enhanced Treatment of Cystic Echinococcosis ACS Appl. Mater. Interfaces 2021 13 38745 38760 10.1021/acsami.1c11179 34353029 82. Devineni J. Pravallika C.h.D. Sudha Rani B. Nalluri B.N. Effective Single Drug Treatment of Lymphatic Filariasis through Enhanced Transdermal Delivery of Ivermectin Liposomes Using Solid and Dissolving Microneedles Indian J. Pharm. Educ. Res. 2020 54 s492 s504 10.5530/ijper.54.3s.148 83. Permana A.D. Tekko I.A. McCrudden M.T.C. Anjani Q.K. Ramadon D. McCarthy H.O. Donnelly R.F. Solid Lipid Nanoparticle-Based Dissolving Microneedles: A Promising Intradermal Lymph Targeting Drug Delivery System with Potential for Enhanced Treatment of Lymphatic Filariasis J. Control. Release 2019 316 34 52 10.1016/j.jconrel.2019.10.004 31655132 84. Manna O. Nditanchou R. Siewe Fodjo J. Colebunders R. Utilization of Health Facilities and Schools in Onchocerciasis Elimination Efforts IJID Reg. 2025 16 100677 10.1016/j.ijregi.2025.100677 40606591 PMC12209935 85. Okumura N. Torii A. Suzuki D. Ito K. Iwade K. Takahashi K. A Case Report of Disseminated Strongyloidiasis Following Chemoradiotherapy for Lung Cancer in a Patient Living in a Non-Endemic Area in Japan Intern. Med. 2025 1 6 10.2169/internalmedicine.5829-25 40707225 86. Das S. Lee S.H. Chia V.D. Chow P.S. Macbeath C. Liu Y. Shlieout G. Development of Microemulsion Based Topical Ivermectin Formulations: Pre-Formulation and Formulation Studies Colloids Surf. B Biointerfaces 2020 189 110823 10.1016/j.colsurfb.2020.110823 32036331 87. Awad H. Rawas-Qalaji M. El Hosary R. Jagal J. Ahmed I.S. Formulation and Optimization of Ivermectin Nanocrystals for Enhanced Topical Delivery Int. J. Pharm. X 2023 6 100210 10.1016/j.ijpx.2023.100210 37727680 PMC10506092 88. Steenekamp E.M. Liebenberg W. Lemmer H.J.R. Gerber M. Formulation and Ex Vivo Evaluation of Ivermectin Within Different Nano-Drug Delivery Vehicles for Transdermal Drug Delivery Pharmaceutics 2024 16 1466 10.3390/pharmaceutics16111466 39598589 PMC11597838 89. Velho M.C. Funk N.L. Deon M. Benvenutti E.V. Buchner S. Hinrichs R. Pilger D.A. Beck R.C.R. Ivermectin-Loaded Mesoporous Silica and Polymeric Nanocapsules: Impact on Drug Loading, In Vitro Solubility Enhancement, and Release Performance Pharmaceutics 2024 16 325 10.3390/pharmaceutics16030325 38543218 PMC10974340 90. Mao Y. Hao T. Zhang H. Gu X. Wang J. Shi F. Chen X. Guo L. Gao J. Shen Y. Penetration Enhancer-Free Mixed Micelles for Improving Eprinomectin Transdermal c Efficiency in Animal Parasitic Infections Therapy Int. J. Nanomed. 2024 19 11071 11085 10.2147/IJN.S476164 PMC11537163 39502637 91. Berger S.N. Rustum A.M. A Comprehensive Study to Identify Major Degradation Products of Avermectin Active Ingredient Using High Resolution LCMS and NMR J. Liq. Chromatogr. Relat. Technol. 2025 1 11 10.1080/10826076.2025.2493203 92. de Souza D.K. Bockarie M.J. Current Perspectives in the Epidemiology and Control of Lymphatic Filariasis Clin. Microbiol. Rev. 2025 38 e00126-23 10.1128/cmr.00126-23 40172233 PMC12160566 93. Karakoyun Ö. Ayhan E. Yıldız İ. Effect of Ivermectin on Scabies: A Retrospective Evaluation BMC Infect. Dis. 2025 25 937 10.1186/s12879-025-11315-5 40702460 PMC12288330 94. Karpstein T. Kalamatianou A. Keller S. Spane P. Haberli C. Odermatt A. Blacque O. Cariou K. Gasser G. Keiser J. Synthesis and Multidisciplinary Preclinical Investigations of Ferrocenyl, Ruthenocenyl, and Benzyl Derivatives of Thiabendazole as New Drug Candidates against Soil-Transmitted Helminth Infections ACS Infect. Dis. 2025 11 2037 2047 10.1021/acsinfecdis.5c00340 40524143 95. Bai S. Zhang M. Tang S. Li M. Wu R. Wan S. Chen L. Wei X. Li F. Research Progress on Benzimidazole Fungicides: A Review Molecules 2024 29 1218 10.3390/molecules29061218 38542855 PMC10975326 Figure 1 Zoonotic Parasitic Diseases under the One Health Framework (Take Toxoplasma gondii as an example). This figure illustrates the One Health concept via Toxoplasma gondii and arthropod-borne diseases. Blue: Foodborne T. gondii infects humans (e.g., pregnant women) via contaminated meat/produce, potentially causing neurological damage or miscarriage. Green: Cats (definitive hosts) shed oocysts, which contaminate water and soil via rain. Intermediate hosts (e.g., pigs) ingest oocysts; humans risk infection through environmental contact or undercooked meat. Purple: Arthropods (ticks, mosquitoes) cause rashes, fever, itching, and transmit diseases (Lyme, dengue) and pathogens (babesiosis, endemic typhus), embodying the interconnection of human, animal, and environmental health—the core of One Health. Figure 2 Pathways of transdermal absorption of nanoformulated drugs. This figure illustrates transdermal delivery modalities of nanoformulations. Polymeric nanocarriers, nanoemulsions, liposomes, niosomes, solid lipid nanoparticles (SLNs), and microneedles enable penetration across the skin strata (epidermis and dermis). Leveraging follicular and transcellular/paracellular pathways, these systems exemplify advanced nanocarrier-mediated strategies for percutaneous therapeutic administration. Figure 3 Examples for transdermal nanoformulations against leishmaniasis and malaria. This figure illustrates nanotherapeutic mechanisms against Leishmaniasis (left) and Malaria (right). Silymarin-selenium nanoparticles enhance drug loading, promote cellular uptake, and inhibit trithiol reductase for Leishmaniasis. Artemisininone solid lipid nanoparticles boost epidermal drug concentration in the stratum corneum to treat Malaria, showcasing nano-based strategies for parasitic diseases. Figure 4 Mechanism of ivermectin nanoemulsion in treating strongyloidiasis. Figure 5 Mechanism of solid and lipid nanoparticle-dissolving microneedle system of albendazole. This figure illustrates the mechanism of solid lipid nanoparticle (SLN)—based dissolving microneedles for lymphatic filariasis pharmaceutics-17-01216-t001_Table 1 Table 1 Nanoformulations of antiparasitic drugs for zoonotic diseases. Indication Nanoformulation Compounds Advantages Study Type and Model Formulation Characteristics Year References Leishmaniasis Transfersomes Trifluralin High transdermal efficiency, high encapsulation efficiency, sustained release, reduced IC 50 In vivo (Albino Wistar rats) PS: 140.3 ± 2.3 nm; 2022 [ 20 Transfersomes Nitazoxanide-quercetin Enhanced skin permeation, increased macrophage uptake, higher CC50, smaller lesion size, low systemic toxicity In vitro (PMs) In vivo (Male Albino Wistar rats, BALB/c mice) PS: 210 nm; 2023 [ 21 Nanoemulsions 3′-(Trifluoromethyl)-chalcone High dermal permeation amount, high skin retention In vitro (TH-1) in vivo (Pigs) PS: 179.0 ± 1.0 nm; 2021 [ 25 Nanoemulsions C6I/TC1/TC2 Enhanced skin permeation, Sustained release, high parasiticidal activity, low macrophage cytotoxicity In vitro (U-937-CRL-1593.2) / 2023 [ 26 Electrospun core–shell nanofibers Glucantime Stable drug release, maintenance of effective drug concentration for a long time, sustained therapeutic effect In vitro (NIH3T3, Franz diffusion cell) / 2020 [ 62 Nanoparticles Silymarin-selenium High drug loading capacity, high skin deposition rate, significant reduction in local treatment toxicity In vitro (NHDFa) In vivo (Male Wistar rats) %LE: 58.22 ± 0.56%; 2024 [ 63 Transfersomes Rifampicin High skin permeability, targeted reduction of IC 50 In vitro (Macrophages) and in vivo (Albino Wistar rats, female BALB/c mice) PS: 190 nm, 2020 [ 46 Nanostructured lipid carrier Glucantime Controlled drug release, enhanced skin retention, reduced systemic toxicity In vitro (L. major) and in vivo (female BALB/c mice) PS: 93.87 ± 0.1 nm; 2023 [ 45 Nanofibers Berberine Gradient release, excellent biocompatibility, stable release rate In vitro (J774A.1, L. major) and in vivo (female BALB/c mice) PS: 10.51 ± 0.24 nm; 2023, 2024 [ 32 33 Microneedle Aphotericin B Improved skin permeability, minimal cellular damage In vitro (HT-29,) In vivo (Sprague-Dawley male rats) Drug Loading: 182 ± 4 μg per (22 × 22) MN array 2021 [ 31  Malaria Ethosomes Artesunate and Febrifugine High cumulative permeation, high efficiency In vivo (Specific-pathogen-free male Kunming mice) PS: 26.48 ± 0.12 nm; 2015 [ 22 Solid lipid nanoparticles Artemisone High skin delivery concentration In vitro (Caucasian female skin obtained by abdominoplasty) PS: 295 ± 18 nm; 2016 [ 75 Elastic liposomes PfMSP-119 Efficient targeting, long-lasting immune response / / 2016 [ 49 Nanoparticles Curcumin High antimalarial activity, prolonged drug circulation time, high bioavailability, enhanced therapeutic efficacy Albino nude rat, Balb/c mice / 2015, 2016, 2010 [ 47 48 76 Nanostructured lipid carrier Artemether High cumulative permeation rate, high drug stability, high release controllability In vitro (Caucasian female skin obtained by abdominoplasty) / 2014 [ 78 Microneedles Primaquine Optimal performance, safe for long-term medication In vitro and in vivo In vitro and ex vivo permeation/release: 31.31 ± 5.25% and 22.55 ± 4.35%. 2021 [ 79 Cystic Echinococcosis Microneedle Albendazole High transdermal permeation amount, safe In vitro and in vivo (rats) / 2023 [ 32 Microneedles-Nanocrystals system Albendazole High transdermal depth, high peak drug concentration, long half-life Wistar rats / 2021 [ 81  Lymphatic filariasis Solid lipid nanoparticle—microneedle system Albendazole High drug targeting efficiency, high direct transport rate, Sustained release, reduced metabolite generation, low drug distribution in liver and kidney In vitro and in vivo (female Sprague–Dawley rats) PS: 95.25 ± 9.26 nm; 2019 [ 83 Scabies Rosacea Head lice Trichuriasis Onchocerciasis Lymphatic filariasis Strongyloidiasis Microemulsion Ivermectin Improved membrane permeability, high solubility / PS: 18–54 nm; 2020 [ 86 Nanocrystals Ivermectin High equilibrium solubility, fast dissolution rate, high dermal deposition, low side effects In vitro PS: 186 nm; 2023 [ 87 Nanoemulsion (NE) Ivermectin Highest drug concentration in stratum corneum and epidermis/dermis junction In vitro PS: 57.157 ± 0.455nm; 2024 [ 88 Nanoemulsion gel (NEG) Ivermectin Fastest delivery rate PS: 106.900 ± 0.490nm; Colloidal system (CS) Ivermectin Highest drug diffusion percentage, efficient delivery ZP: −36.200 ± 0.666 mV Solid lipid nanoparticles Ivermectin Sustained-release efficacy, targeting, low systemic toxicity, few side effects / %EE: 99.9±0.0%; 2018 [ 40 Nanoparticles Ivermectin suitable for acute infection management / DL: 10.7%; 2024 [ 89 Nanocapsules Ivermectin suitable for chronic prevention / Z-average: 202 ± 2 nm; Hybrid micelles Eprinomectin High permeability, low toxicity In vitro & In vivo (Male Sprague–Dawley rats, Male ICR mice) PS: 13.97 ± 0.16 nm; 2024 [ 90 Note: “/” indicates that no information was found or is not available. PS: particle size; PDI: polydispersity index; DL: drug loading; EE:entrapped efficiency; HD: Hydrate; ZP: zeta potential. ",
  "metadata": {
    "Title of this paper": "Research Progress on Benzimidazole Fungicides: A Review",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473851/"
  }
}