{
  "title": "Paper_742",
  "abstract": "pmc Toxins (Basel) Toxins (Basel) 1577 toxins toxins Toxins 2072-6651 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473989 PMC12473989.1 12473989 12473989 41003493 10.3390/toxins17090428 toxins-17-00428 1 Article Histopathological Assessment and Oxidative Biomarker Analysis of Wild Boar Tissues Affected by Ochratoxin A Contamination in the Campania Region, Southern Italy https://orcid.org/0000-0001-7798-7710 Damiano Sara 1 https://orcid.org/0000-0002-0788-4107 Longobardi Consiglia 1 * https://orcid.org/0009-0008-6975-1482 Di Napoli Evaristo 1 * Russo Valeria 1 https://orcid.org/0000-0002-1637-4205 Piegari Giuseppe 1 Raffaele Antonio 2 https://orcid.org/0009-0008-5805-0840 Ferrucci Francesco 1 Rubino Antonio 1 https://orcid.org/0000-0003-4121-4905 Ciarcia Roberto 1 1 sara.damiano@unina.it valeria.russo@unina.it giuseppe.piegari@unina.it francescoferrucci92@icloud.com antoruby@virgilio.it rciarcia@unina.it 2 raffaeleantonio@libero.it * consiglia.longobardi@unina.it evaristo.dinapoli@unina.it 26 8 2025 9 2025 17 9 497674 428 16 7 2025 13 8 2025 21 8 2025 26 08 2025 27 09 2025 28 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Ochratoxin A (OTA) is a mycotoxin found in a variety of human foods and in animals. Wild boars are widespread on the European mainland. As they are ubiquitous and feed mainly on a varied diet, they can serve as an excellent bioindicator for OTA research. In recent years, there has been increasing interest in the use of oxidative stress (OS) markers to assess the physiological response of wildlife to environmental stress. Therefore, the aim of this study was to evaluate OS through biochemical assays and morphological changes in liver, kidney and muscle of wild boar that had responded positively to OTA in the Campania region, southern Italy. Endogenous antioxidant enzymes, as well as lipid peroxidation, were quantified using commercially available assay kits. Histological analysis was performed by haematoxylin and eosin staining. Our results indicate that OTA contamination can lead to oxidative stress (OS) and various histopathological changes, primarily affecting the liver and kidneys of OTA-positive wild boars, but not their muscles. Overall, this study highlights the occurrence of OTA contamination in food products, contributing to the broader concern regarding food safety and the potential health risks for humans and animals associated with mycotoxin exposure. ochratoxin A wild boar kidney liver muscle This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Key Contribution This study suggests that wild boar may represent a source of OTA; an aspect of great importance to ensure food safety and protect the life and health of humans and animals. 1. Introduction Climate change, in particular the increase in the frequency and intensity of heat waves, has favoured the growth, spread and production of mycotoxins [ 1 1 2 Aspergillus Penicillium 3 Penicillium Aspergillus 4 5 6 The development of mycotoxicosis is influenced by multiple factors, including genetic, physiological and environmental aspects. In southern Europe the combination of warm temperatures, high humidity, and inadequate grain storage favours the formation of OTA [ 7 8 9 10 11 12 11 13 14 Regulations on mycotoxins have been enacted in many countries to protect consumers from the harmful effects of these compounds. Various factors play a role in the decision-making process to establish safe limits for mycotoxins. These include scientific factors, e.g., the availability of toxicological and epidemiological data, detailed knowledge of sampling and analysis options and socio-economic aspects [ 15 16 17 Climate change, emerging infectious diseases, and anthropogenic disturbances are recognised by the World Health Organization (WHO) as major global public health challenges [ 18 19 Among all wild animal species, wild boar appears to have adapted most successfully to environmental and anthropogenic changes (for example, habitat fragmentation, agricultural expansion, and reduced predation pressure) and has consequently become one of the most densely populated free-ranging mammal species in Europe. Therefore, with its demographic increase, the wild boar has become a problem not only for agriculture, but also for health and safety [ 16 20 21 Several studies suggest that OTA toxicity can be associated with the induction of oxidative stress (OS), which subsequently leads to DNA damage and the occurrence of mutations [ 22 23 24 25 2. Results 2.1. The Effect of OTA on Lipid Peroxidation Malondialdehyde (MDA) levels in liver and kidney tissue were significantly increased in the OTA-contaminated samples (OTA+) compared to the OTA-uncontaminated samples (OTA−). The values increased from 42.49 ± 6.22 (OTA−) to 48.4 8 ± 7.06 (OTA+) in the liver ( p p Figure 1 2.2. GPx, CAT and SOD Activities Changes upon OTA Exposure Glutathione peroxidase (GPx), catalase (CAT) and superoxide dismutase (SOD) activities detected in liver, kidney and muscle tissue of wild boars are shown in Figure 2 p p p p 2.3. Histopathological Findings of Liver, Kidneys and Muscles In the OTA− group, kidney morphology appeared largely normal, with only a slight accumulation of intratubular proteinaceous material observed in 3 out of 10 samples. Mild, scattered lymphocytic infiltration within the interstitial space was present in 5 out of 10 cases, while mild glomerular atrophy and hyperaemia were detected in 3 and 4 cases, respectively ( Figure 3 On the other hand, the kidneys of the OTA+ group showed a mild (6 out of 10) to moderate (4 out of 10) multifocal lymphoplasmacytic interstitial inflammatory infiltrate. The lumen of the tubules contained mild (7 of 10) to moderate (3 of 10) proteinaceous material. Glomerular atrophy with enlargement of Bowman’s space was classified as mild (6 out of 10) to moderate (3 out of 10). The tubular epithelial cells were often atrophic or degenerated. We observed hyperaemia in all cases ( Figure 3 Table 1 The livers of the OTA− group did not show significant pathologic findings; only in three out of ten did we observe a mild infiltrating inflammatory cell, and a few disseminated hepatocytes showed swollen cytoplasm. Rarely did we observe dilatation of the portal and centrilobular veins ( Figure 4 Differently, livers from the OTA+ group showed mild (in 5 out of 10) to moderate (in 3 out of 10), multifocal, lymphoplasmacytic inflammation. Morphological evaluation of livers revealed mild (4 out of 10) to moderate (6 out of 10) degenerated hepatocytes with optically empty cytoplasm containing small, rounded vacuoles that sometimes cause nuclear displacement (microvacuolar steatosis). We observed a dilation of the portal and centrilobular veins in most of the cases examined (mild in 5 out of 10 and moderate in 4 out of 10). Statistical analysis showed statistically significant differences in liver inflammation between the OTA− group and the OTA+ group ( p p p p Figure 4 Table 2 Muscles from OTA− wild boars showed no significant pathological alterations. However, morphological assessment of OTA+ muscle samples revealed mild variability in myofiber diameter, size reduction (atrophy) with angular profiles, widening of endomysial spaces, and occasional myofibers exhibiting compensatory hypertrophy (degeneration) ( Figure 5 To summarise: Glomerular atrophy was significantly greater in the OTA+ group compared with the OTA− group ( p Proteinaceous material in tubular lumina was significantly more abundant in the OTA+ group than in the OTA− group ( p Kidney inflammation was significantly higher in the OTA+ group compared with the OTA− group ( p Liver inflammation was significantly greater in the OTA+ group compared with the OTA− group ( p Liver steatosis was significantly more pronounced in the OTA+ group compared with the OTA− group ( p 3. Discussion In recent years, there has been increasing interest in the use of oxidative stress (OS) markers to assess the physiological response of wildlife to environmental stresses, as they are stable and easy to quantify [ 26 27 28 29 30 31 Sus scrofa 32 33 2 − 34 35 36 36 37 38 39 40 41 42 43 8 44 45 46 47 Histological analysis of the kidneys of wild boars classified in the OTA+ exhibited substantial deposits of proteinaceous material, accompanied by inflammation and atrophy, clear indicators of nephrotoxicity induced by OTA [ 30 48 Although OTA-contaminated muscle tissues do not seem to exhibit direct toxic effects, their presence raises significant concerns regarding the potential entry of OTA into the food chain. Wild boars, due to their omnivorous feeding habits and foraging behaviour, can bioaccumulate environmental contaminants such as mycotoxins, acting as sentinels of ecosystem contamination. Consequently, consumption of meat and offal from these animals may represent a possible cause of exposure for humans, especially in rural and hunting communities where game meat is regularly consumed and sometimes shared within local markets. This scenario highlights the complexity of food chain safety, as the presence of OTA in wild animal products could also affect domestic animals when offal or by-products are used as feed ingredients. These findings underscore the importance of implementing preventive strategies to minimise OTA contamination along the entire food chain, from environmental monitoring to food safety control at the point of consumption. Given the documented nephrotoxic, hepatotoxic, and carcinogenic potential of OTA, the European Union has established maximum limits for its concentration in food and feed (EU Regulation 1370/2022) to protect consumer health. Strengthening monitoring programmes and risk assessments for OTA in wildlife products may therefore be warranted. Therefore, this study underlines the importance of assessing the risks of OTA contamination beyond animal husbandry, especially in game meat. Our samples originate from wild boars hunted in their natural habitat, and this condition offers a unique ecological perspective on OTA exposure in free-ranging populations, while imposing significant analytical limitations. In particular, the highly labile and sensitive quantification of ROS [ 49 4. Conclusions This study provides novel data on the impact of OTA in wild boars from the Campania region (Southern Italy) and its potential impact on human health. OTA was associated with significant histopathological changes in the liver and kidney, as well as alterations in OS markers. Although no relevant lesions were detected in skeletal muscle, these findings support the hypothesis that wild boar meat can act as a potential source of OTA exposure for humans, particularly in areas where game meat is commonly consumed. This concern is especially relevant in context where muscles is not the sole edible portion consumed and where wild boar meat is regarded as a valuable and highly prized source of nutrition. Within a One Health framework integrating human, animal, and environmental health, monitoring the epidemiological patterns of OTA occurrence in wild animals is essential. Establishing targeted environmental surveillance plans can enhance public awareness and inform food safety policies, particularly for game meat, where no maximum residue limits (MRLs) or acceptable daily intake (ADI) values for OTA have yet been defined. This study supports the hypothesis that animal-derived products, including wild boar meat, may serve as a potential source of OTA exposure for humans, and that environmental variability may affect OTA levels in wild boar diets. The consumption of wild meat, when properly monitored, offers an ethical and sustainable option that supports biodiversity management and the valorisation of traditional local products, while contributing to reduced CO 2 5. Materials and Methods 5.1. Ethics Statement For this study, approval from an Ethics Committee was not required because the animals were legally hunted in their natural habitat by licenced hunters, following the 2021–2022 annual hunting plan approved by the province of Avellino, Campania region, Italy. 5.2. Study Area: Wild Boar Population Density in Avellino, Italy This study analyses free-ranging wild boars ( Sus scrofa 50 Covering an area of approximately 28,000 hectares, Avellino’s landscape consists of limestone mountain formations, dense forests, and agricultural zones, offering a favourable environment for wild boars. The Mediterranean climate, characterised by warm summers and humid winters, contributes to abundant food resources, including acorns, tubers, fungi, and cultivated crops, further supporting the expansion of the wild boar population. Given the increasing presence of wild boars in the province, understanding their density and movement patterns is crucial for wildlife management and ecological balance. The study examines how altitude and habitat variation influence population density and evaluates environmental factors affecting the distribution of wild boars within this region. Figure 6 5.3. Sampling of Free-Ranging Wild Boar The sampling was conducted following the methodology described in our previous study [ 32 5.4. Analysis of Malondialdehyde (MDA) and Antioxidant Enzyme Activities One gram of each liver, kidney and muscle sample was rinsed with phosphate-buffered saline (PBS) to remove blood cells and clots, then divided into different aliquots. Samples were homogenised on ice using a tissue homogeniser (Tissue Lyser, Qiagen, Milano, Italy) and centrifuged at speeds appropriate for each specific assay. The resulting supernatants were stored at −80 °C. Lipid peroxidation was assessed by quantifying MDA following the method described by Gassó et al. [ 49 Glutathione Peroxidase Assay Kit, Superoxide Dismutase Assay Kit and Catalase Assay Kit were purchased from Cayman Chemical (Ann Arbor, MI, USA). All other chemical reagents were purchased from Sigma (Milan, Italy). Glutathione peroxidase (GPx) is the general name of an enzyme family with peroxide activity; its biochemical function is the reduction of lipid hydroperoxides to the corresponding alcohols and the reduction of free hydrogen peroxide to water. The resulting samples were then tested according to the manufacturer’s instructions, the absorbance was read at 340 nm using a spectrophotometer (Glomax Multi detection system, Promega, Milano, Italy) and the results were expressed as nmol/min/mL. Superoxide dismutase (SOD) is an important antioxidant in almost all cells exposed to ROS generated by cellular immune responses. The resulting samples were then tested according to the manufacturer’s instructions, and the absorbance was measured at 460 nm using a spectrophotometer, and the results were expressed as U/mL. Catalase (CAT) catalyses the decomposition of hydrogen peroxide produced in the damaged tissue into water and oxygen. The resulting samples were then tested according to the manufacturer’s instructions, and the absorbance was read at 540 nm spectrophotometrically and the results were expressed in nmol/min/mL. 5.5. Histopathological Examinations Samples of boars’ liver, kidney and skeletal muscle (biceps femoris) were fixed for 24 h in 10% neutral buffered formalin and embedded in paraffin. Serial sections of 3–5 μm thickness were stained with haematoxylin and eosin and then evaluated, scanned and photographed using the Pannoramic II scanner (3DHISTECH, The Digital Pathology Company, Övutca 3, 1141 Budapest, Hungary). The OTA− and OTA+ groups included 10 liver, 10 kidney and 10 skeletal muscle (biceps femoris) tissues, selected as representative of each group based on the presence and severity of macroscopic alterations. A histological scoring system was used that considered the most representative lesions in liver, kidney and muscle tissue. In the kidneys, haematoxylin and eosin-stained sections were used to assess glomerular atrophy, inflammation and the presence of proteinaceous material within the tubular lumen. Renal lesions were assessed by examining at least 10 microscopic fields at 20× magnification using established histological scoring systems. In particular, inflammation was graded as follows: Score 0 (absent), no foci of inflammation; Score 1 (mild), <2 foci per 20× field; score 2 (moderate), 2–4 foci per 20× field; and Score 3 (severe), >4 foci per 20× field [ 51 52 53 Sections stained with haematoxylin and eosin were used in the livers to assess inflammation and steatosis. Liver lesions were assessed by examining at least 10 microscopic fields at 20× magnification using an established histological scoring system. In particular, inflammation was graded as follows: Score 0 (absent), no foci of inflammation; Score 1 (mild), <2 foci per 20× field; Score 2 (moderate), 2–4 foci per 20× field; and Score 3 (severe), >4 foci per 20× field system [ 54 55 51 52 In skeletal muscle, sections stained with haematoxylin and eosin were used to assess the morphological aspect of the muscle myofibers. 5.6. Statistical Analysis Statistical analyses of enzymatic activities and malondialdehyde were performed using GraphPad (version 8.0; GraphPad Software Inc., San Diego, CA, USA). The Shapiro–Wilk test and the Kolmogorov–Smirnov tests were used to determine the normality of the data distribution. For histological evaluations, differences between the OTA− and OTA+ groups were determined with an unpaired t-test, while differences between the means of the individual histological semi-quantitative scores were determined with the Mann–Whitney U test. Values of p Acknowledgments The authors are grateful to Vincenzo Lucidi for his assistance with the cartographic representation. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.D., C.L. and R.C.; methodology, S.D., C.L., E.D.N. and V.R.; formal analysis, F.F.; investigation, C.L., E.D.N. and G.P.; resources, R.C.; data curation, E.D.N.; writing—original draft preparation, R.C.; writing—review and editing, C.L. and E.D.N.; visualisation, A.R. (Antonio Rubino) and A.R. (Antonio Raffaele); supervision, R.C. and S.D.; funding acquisition, S.D. and R.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: OTA Ochratoxin A MDA Malondialdehyde GPx Glutathione peroxidase SOD Superoxide dismutase CAT Catalase WHO World Health Organisation MRLs Maximum residue limits References 1. Mesfin A. Lachat C. Vidal A. Croubels S. Haesaert G. Ndemera M. Okoth S. Belachew T. Boevre M. De Saeger S. Essential descriptors for mycotoxin contamination data in food and feed Food Res. Int. 2022 152 110883 10.1016/j.foodres.2021.110883 35181069 2. Hao W. Li A. Wang J. An G. Guan S. Mycotoxin Contamination of Feeds and Raw Materials in China in Year 2021 Front. Vet. Sci. 2022 9 929904 10.3389/fvets.2022.929904 35847652 PMC9281542 3. Malir F. Ostry V. Pfohl-Leszkowicz A. Malir J. Toman J. Ochratoxin A: 50 Years of Research Toxins 2016 8 191 10.3390/toxins8070191 27384585 PMC4963825 4. Heussner A.H. Bingle L.E. Comparative Ochratoxin Toxicity: A Review of the Available Data Toxins 2015 7 4253 4282 10.3390/toxins7104253 26506387 PMC4626733 5. Wu F. Groopman J.D. Pestka J.J. Public health impacts of foodborne mycotoxins Annu. Rev. Food Sci. Technol. 2014 5 351 372 10.1146/annurev-food-030713-092431 24422587 6. Bui-Klimke T.R. Wu F. Ochratoxin A and human health risk: A review of the evidence Crit. Rev. Food Sci. Nutr. 2015 55 1860 1869 10.1080/10408398.2012.724480 24874522 PMC4247821 7. van Egmond H.P. Schothorst R.C. Jonker M.A. Regulations relating to mycotoxins in food: Perspectives in a global and European context Anal. Bioanal. Chem. 2007 389 147 157 10.1007/s00216-007-1317-9 17508207 8. Kőszegi T. Poór M. Ochratoxin A: Molecular Interactions, Mechanisms of Toxicity and Prevention at the Molecular Level Toxins 2016 8 111 10.3390/toxins8040111 27092524 PMC4848637 9. Rhouati A. Yang C. Hayat A. Marty J.L. Aptamers: A promising tool for ochratoxin A detection in food analysis Toxins 2013 5 1988 2008 10.3390/toxins5111988 24196457 PMC3847711 10. IARC Ochratoxin A IARC Monogr. Eval. Carcinog. Risks Hum. 1993 56 489 521 8411629 PMC7681315 11. Liu W.-C. Pushparaj K. Meyyazhagan A. Arumugam V.A. Pappuswamy M. Bhotla H.K. Baskaran R. Issara U. Balasubramanian B. Khaneghah A.M. Ochratoxin A as an alarming health threat for livestock and human: A review on molecular interactions, mechanism of toxicity, detection, detoxification, and dietary prophylaxis Toxicon 2022 213 59 75 10.1016/j.toxicon.2022.04.012 35452686 12. Reddy L. Bhoola K. Ochratoxins-food contaminants: Impact on human health Toxins 2010 2 771 779 10.3390/toxins2040771 22069609 PMC3153213 13. Prior M.G. Sisodia C.S. O’Neil J.B. Acute oral ochratoxicosis in day-old White Leghorns, turkeys and Japanese Quail Poult. Sci. 1976 55 786 790 10.3382/ps.0550786 935032 14. Kuiper-Goodman T. Hilts C. Billiard S.M. Kiparissis Y. Richard I.D. Hayward S. Health risk assessment of ochratoxin A for all age-sex strata in a market economy Food Addit. Contam. Part A Chem. Anal. Control Expo. Risk Assess 2010 27 212 240 10.1080/02652030903013278 20013446 PMC3474135 15. Stefanaki I. Foufa E. Tsatsou-Dritsa A. Dais P. Ochratoxin A concentrations in Greek domestic wines and dried vine fruits Food Addit. Contam. 2003 20 74 83 10.1080/0265203021000031537 12519722 16. Liao H. Lyon C.J. Ying B. Hu T. Climate change, its impact on emerging infectious diseases and new technologies to combat the challenge Emerg. Microbes Infect. 2024 13 2356143 10.1080/22221751.2024.2356143 38767202 PMC11138229 17. Commission Regulation (EU) 2022/1370 of 5 August 2022 Amending Regulation (EC) No 1881/2006 as Regards Maximum Levels of Ochratoxin A in Certain foodstuffs. Official Journal of the European Union (OJ L 206) 8 August 2022 11 14 Available online: https://eur-lex.europa.eu/eli/reg/2022/1370/oj/eng (accessed on 22 August 2025) 18. Hing S. Narayan E.J. Andrew Thompson R.C. Godfrey S.S. The relationship between physiological stress and wildlife disease: Consequences for health and conservation Wildl. Res. 2016 43 51 60 10.1071/WR15183 19. Armorini S. Altafini A. Zaghini A. Roncada P. Ochratoxin A in artisan salami produced in Veneto (Italy) Food Addit. Contam. Part B Surveill. 2016 9 9 14 10.1080/19393210.2015.1098735 26431067 20. Barrios-García M.N. Gonzalez-Polo M. Simberloff D. Classen A.T. Wild boar rooting impacts soil function differently in different plant community types Biol. Invasions 2023 25 583 592 10.1007/s10530-022-02936-x 21. Valente A.M. Acevedo P. Figueiredo A.M. Fonseca C. Torres R.T. Overabundant wild ungulate populations in Europe: Management with consideration of socio-ecological consequences Mamm. Rev. 2020 50 353 366 10.1111/mam.12202 22. Limonciel A. Jennings P. A review of the evidence that ochratoxin A is an Nrf2 inhibitor: Implications for nephrotoxicity and renal carcinogenicity Toxins 2014 6 371 379 10.3390/toxins6010371 24448208 PMC3920267 23. Longobardi C. Ferrara G. Andretta E. Montagnaro S. Damiano S. Ciarcia R. Ochratoxin A and Kidney Oxidative Stress: The Role of Nutraceuticals in Veterinary Medicine—A Review Toxins 2022 14 398 10.3390/toxins14060398 35737059 PMC9231272 24. Ramyaa P. Krishnaswamy R. Padma V.V. Quercetin modulates OTA-induced oxidative stress and redox signalling in HepG2 cells-up regulation of Nrf2 expression and down regulation of NF-κB and COX-2 Biochim. Biophys. Acta 2014 1840 681 692 10.1016/j.bbagen.2013.10.024 24161694 25. Wang G. Zhang S. Lan H. Zheng X. Ochratoxin A (OTA) causes intestinal aging damage through the NLRP3 signaling pathway mediated by calcium overload and oxidative stress Environ. Sci. Pollut. Res. Int. 2024 31 27864 27882 10.1007/s11356-024-32696-1 38526719 26. Beaulieu M. Costantini D. Biomarkers of oxidative status: Missing tools in conservation physiology Conserv. Physiol. 2014 2 cou014 10.1093/conphys/cou014 27293635 PMC4806730 27. Costantini D. Helfenstein F. Editorial: Oxidative Stress and Signal Honesty Front. Ecol. Evol. 2017 5 32 10.3389/fevo.2017.00032 28. Sies H. Oxidative stress: A concept in redox biology and medicine Redox Biol. 2015 4 180 183 10.1016/j.redox.2015.01.002 25588755 PMC4309861 29. Stoev S.D. New Evidences about the Carcinogenic Effects of Ochratoxin A and Possible Prevention by Target Feed Additives Toxins 2022 14 380 10.3390/toxins14060380 35737041 PMC9230445 30. Khoi C.S. Chen J.H. Lin T.Y. Chiang C.K. Hung K.Y. Ochratoxin A-Induced Nephrotoxicity: Up-to-Date Evidence Int. J. Mol. Sci. 2021 22 11237 10.3390/ijms222011237 34681895 PMC8539333 31. Więckowska M. Cichon N. Szelenberger R. Gorniak L. Bijak M. Ochratoxin A and Its Role in Cancer Development: A Comprehensive Review Cancers 2024 16 3473 10.3390/cancers16203473 39456567 PMC11506779 32. Damiano S. Longobardi C. De Marchi L. Piscopo N. Meucci V. Lenzi A. Ciarcia R. Detection of Ochratoxin A in Tissues of Wild Boars (Sus scrofa) from Southern Italy Toxins 2025 17 74 10.3390/toxins17020074 39998091 PMC11860290 33. Kozlov A.V. Javadov S. Sommer N. Cellular ROS and Antioxidants: Physiological and Pathological Role Antioxidants 2024 13 602 10.3390/antiox13050602 38790707 PMC11117742 34. Cordiano R. Di Gioacchino M. Mangifesta R. Panzera C. Gangemi S. Minciullo P.L. Malondialdehyde as a Potential Oxidative Stress Marker for Allergy-Oriented Diseases: An Update Molecules 2023 28 5979 10.3390/molecules28165979 37630231 PMC10457993 35. Son Y. Lee H.J. Ryu D. Kim J.R. Kim H.Y. Ochratoxin A induces hepatic and renal toxicity in mice through increased oxidative stress, mitochondrial damage, and multiple cell death mechanisms Arch. Toxicol. 2024 98 2281 2295 10.1007/s00204-024-03732-3 38546835 36. Ighodaro O.M. Akinloye O.A. First line defence antioxidants-superoxide dismutase (SOD), catalase (CAT) and glutathione peroxidase (GPX): Their fundamental role in the entire antioxidant defence grid Alex. J. Med. 2018 54 287 293 10.1016/j.ajme.2017.09.001 37. EFSA Panel on Contaminants in the Food Chain (CONTAM) Schrenk D. Bignami M. Bodin L. Chipman J.K. Del Mazo J. Grasl-Kraupp B. Hogstrand C. Hoogenboom L.R. Leblanc J.C. Risks for animal health related to the presence of ochratoxin A (OTA) in feed EFSA J. 2023 21 e08375 10.2903/j.efsa.2023.8375 37942224 PMC10628734 38. Novi S. Vestuto V. Campiglia P. Tecce N. Bertamino A. Tecce M.F. Anti-Angiogenic Effects of Natural Compounds in Diet-Associated Hepatic Inflammation Nutrients 2023 15 2748 10.3390/nu15122748 37375652 PMC10301080 39. Yang W.S. SriRamaratnam R. Welsch M.E. Shimada K. Skouta R. Viswanathan V.S. Cheah J.H. Clemons P.A. Shamji A.F. Clish C.B. Regulation of ferroptotic cancer cell death by GPX4 Cell 2014 156 317 331 10.1016/j.cell.2013.12.010 24439385 PMC4076414 40. Wang G. Qin S. Zheng Y. Xia C. Zhang P. Zhang L. Yao J. Yi Y. Deng L. T-2 Toxin Induces Ferroptosis by Increasing Lipid Reactive Oxygen Species (ROS) and Downregulating Solute Carrier Family 7 Member 11 (SLC7A11) J. Agric. Food Chem. 2021 69 15716 15727 10.1021/acs.jafc.1c05393 34918923 41. Li J. Cao F. Yin H.L. Huang Z.-J. Lin Z.-T. Mao N. Sun B. Wang G. Ferroptosis: Past, present and future Cell Death Dis. 2020 11 88 10.1038/s41419-020-2298-2 32015325 PMC6997353 42. Loboda A. Stachurska A. Sobczak M. Podkalicka P. Mucha O. Jozkowicz A. Dulak J. Nrf2 deficiency exacerbates ochratoxin A-induced toxicity in vitro and in vivo Toxicology 2017 389 42 52 10.1016/j.tox.2017.07.004 28710020 43. Longobardi C. Damiano S. Fabroni S. Montagnaro S. Russo V. Vaccaro E. Giordano A. Florio S. Ciarcia R. Red Orange and Lemon Extract Ameliorates the Renal Oxidative Stress and Inflammation Induced by Ochratoxin A through the Modulation of Nrf2 Toxins 2024 16 151 10.3390/toxins16030151 38535817 PMC10975592 44. Simarro Doorten A.Y. Bull S. van der Doelen M.A. Fink-Gremmels J. Metabolism-mediated cytotoxicity of ochratoxin A Toxicol. Vitr. Int. J. Public Assoc. BIBRA 2004 18 271 277 10.1016/j.tiv.2003.10.001 15046773 45. Popescu R.G. Bulgaru C. Untea A. Vlassa M. Filip M. Hermenean A. Marin D. Țăranu I. Georgescu S.E. Dinischiotu A. The Effectiveness of Dietary Byproduct Antioxidants on Induced CYP Genes Expression and Histological Alteration in Piglets Liver and Kidney Fed with Aflatoxin B1 and Ochratoxin A Toxins 2021 13 148 10.3390/toxins13020148 33671978 PMC7919288 46. Kuhn M. Hassan R. González D. Myllys M. Hobloss Z. Degen G.H. Humpf H.U. Hengstler J.G. Cramer B. Ghallab A. Role of albumin in the metabolism and excretion of ochratoxin A Mycotoxin Res. 2024 40 433 445 10.1007/s12550-024-00538-1 38743341 47. Brown J.L. Rosa-Caldwell M.E. Lee D.E. Blackwell T.A. Brown L.A. Perry R.A. Haynie W.S. Hardee J.P. Carson J.A. Wiggs M.P. Mitochondrial degeneration precedes the development of muscle atrophy in progression of cancer cachexia in tumour-bearing mice J. Cachexia Sarcopenia Muscle 2017 8 926 938 10.1002/jcsm.12232 28845591 PMC5700433 48. Pfohl-Leszkowicz A. Manderville R.A. Ochratoxin A: An overview on toxicity and carcinogenicity in animals and humans Mol. Nutr. Food Res. 2007 51 61 99 10.1002/mnfr.200600137 17195275 49. Gassó D. Vicente J. Mentaberre G. Soriguer R. Rodríguez R.J. Navarro-González N. Tvarijonaviciute A. Lavín S. Fernández-Llario P. Segalés J. Oxidative Stress in Wild Boars Naturally and Experimentally Infected with Mycobacterium bovis PLoS ONE 2016 11 e0163971 10.1371/journal.pone.0163971 27682987 PMC5040450 50. Ferrara G. Longobardi C. D’Ambrosi F. Amoroso M.G. D’Alessio N. Damiano S. Ciarcia R. Iovane V. Iovane G. Pagnini U. Aujeszky’s Disease in South-Italian Wild Boars (Sus scrofa): A Serological Survey Animals 2021 11 3298 10.3390/ani11113298 34828029 PMC8614479 51. Damiano S. Longobardi C. Ferrara G. Piscopo N. Riccio L. Russo V. Meucci V. De Marchi L. Esposito L. Florio S. Oxidative Status and Histological Evaluation of Wild Boars’ Tissues Positive for Zearalenone Contamination in the Campania Region, Southern Italy Antioxidants 2023 12 1748 10.3390/antiox12091748 37760051 PMC10525666 52. Dimatteo M. Di Napoli E. Paciello O. d’Aquino I. Iaccarino D. D’amore M. Guida M. Cozzolino L. Serpe F.P. Fusco G. Pathological Changes and CYP1A1 Expression as Biomarkers of Pollution in Sarpa Salpa and Diplodus Sargus Animals 2024 14 3160 10.3390/ani14213160 39518883 PMC11544920 53. Damiano S. Andretta E. Longobardi C. Prisco F. Paciello O. Squillacioti C. Mirabella N. Florio S. Ciarcia R. Effects of curcumin on the renal toxicity induced by ochratoxin A in rats Antioxidants 2020 9 332 10.3390/antiox9040332 32325727 PMC7222377 54. Damiano S. Longobardi C. Andretta E. Prisco F. Piegari G. Squillacioti C. Montagnaro S. Pagnini F. Badino P. Florio S. Antioxidative Effects of Curcumin on the Hepatotoxicity Induced by Ochratoxin A in Rats Antioxidants 2021 10 125 10.3390/antiox10010125 33477286 PMC7830919 55. Melini S. Pirozzi C. Lama A. Comella F. Opallo N. Del Piano F. Di Napoli E. Mollica M.P. Paciello O. Ferrante M.C. Co-Micronized Palmitoylethanolamide and Rutin Associated with Hydroxytyrosol Recover Diabesity-Induced Hepatic Dysfunction in Mice: In Vitro Insights into the Synergistic Effect Phytother. Res. 2024 38 6035 6047 10.1002/ptr.8361 39474783 PMC11634826 Figure 1 Malondialdehyde (MDA) levels in liver, kidney, and muscle tissues of wild boars ( Sus scrofa p p Figure 2 Effects of Ocratoxin A (OTA) on the activities of glutathione peroxidase (GPx) ( A B C n n n n n n p p Figure 3 ( A a b d b c d B p Figure 4 ( A a b b c d c d B p p Figure 5 Wild boar, muscle, hematoxylin and eosin stain (HE). ( a b c b c b c c Figure 6 Cartographic representation of the province of Avellino (Campania region, Southern Italy) delineating hunting zones (in green) designated for wild boar ( Sus scrofa toxins-17-00428-t001_Table 1 Table 1 Severity scores of glomerular atrophy, inflammation and proteinaceous material in the kidneys of OTA+ and OTA− wild boars. KIDNEY Score 0 Score 1 Score 2 Score 3  OTA+ OTA− OTA+ OTA− OTA+ OTA− OTA+ OTA− Glomerular atrophy 1 7 6 3 3 0 0 0 Inflammation 0 5 6 5 4 0 0 0 Proteinaceous material within tubular lumina 0 7 7 3 3 0 0 0 toxins-17-00428-t002_Table 2 Table 2 Severity scores for inflammation and steatosis in the livers of OTA+ and OTA− wild boars. LIVER Score 0 Score 1 Score 2 Score 3  OTA+ OTA− OTA+ OTA− OTA+ OTA− OTA+ OTA− Inflammation 2 7 5 3 3 0 0 0 Steatosis 0 7 4 3 6 0 0 0 ",
  "metadata": {
    "Title of this paper": "Co-Micronized Palmitoylethanolamide and Rutin Associated with Hydroxytyrosol Recover Diabesity-Induced Hepatic Dysfunction in Mice: In Vitro Insights into the Synergistic Effect",
    "Journal it was published in:": "Toxins",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473989/"
  }
}