{
  "title": "Paper_32",
  "abstract": "pmc World J Surg Oncol World J Surg Oncol 199 wjsurgonc World Journal of Surgical Oncology 1477-7819 BMC PMC12490167 PMC12490167.1 12490167 12490167 41035015 10.1186/s12957-025-04001-y 4001 1 Review Association of progesterone receptor status with breast cancer prognosis: a meta-analysis Hou Yiming 1 Li Jianrong 1 Zhang Qiong 1 Fan Yingyi fan38898901@126.com 2 1 https://ror.org/05damtm70 grid.24695.3c 0000 0001 1431 9176 Third Affiliated Hospital of Beijing University of Chinese Medicine, Beijing University of Chinese Medicine, 2 https://ror.org/05damtm70 grid.24695.3c 0000 0001 1431 9176 Breast Department, Third Affiliated Hospital of Beijing University of Chinese Medicine, 2 10 2025 2025 23 478195 356 15 5 2025 22 8 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Breast cancer (BC) prognosis is influenced by hormones, of which progesterone receptor (PR) status is controversial for BC prognosis, possibly related to clinical characteristics. Objective This study was to determine the impact of PR status on BC prognosis and explore the differences across patient subgroups. Methods PubMed, Cochrane Library, Embase, and Web of Science were searched for relevant studies until July 2024. NOS (Newcastle–Ottawa Scale) was leveraged for quality appraisal. Meta-analysis was performed using STATA15.1. Results Thirty-five studies were included, involving 89,164 patients. PR-negative status was associated with worse overall survival compared to PR-positive status (HR 1.70, 95%CI 1.42 to 2.04; p p p p Conclusion PR loss is associated with worse outcomes in BC, which is influenced by clinical characteristics. Especially in patients with ER + HER2- tumors, PR status may serve as an additional predictive marker. Supplementary Information The online version contains supplementary material available at 10.1186/s12957-025-04001-y. Keywords Breast cancer Prognosis Progesterone receptor Meta-analysis National Natural Science Foundation of China 82374463 Fan Yingyi pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Breast cancer (BC) is the most frequent malignancy and the chief cause of cancer death in women worldwide, responsible for almost 2.3 million new cases reported in 2022 [ 1 2 3 In recent years, new prognostic factors of BC have been discovered, mainly including gene expression regulation, tumor microenvironment, epithelial-mesenchymal transition (EMT), and signaling pathways [ 4 5 6 7 8 9 10 11 10 11 12 13 14 Estrogen receptors (ER) and progesterone receptors (PR) are essential modulators of hormonal signaling in BC, and their expression substantially influences the efficacy of endocrine therapies targeting estrogen-mediated pathways. PR is an upregulated target of ER and is crucial for mammary gland development and tumorigenesis [ 15 16 17 18 As a result, the prognostic significance of PR expression in BC remains unclear. Thereby, we conducted a systematic review and meta-analysis to examine the prognostic value of PR in BC patients and explore the differences in patient subgroups with different clinical trials. Materials and methods This paper was registered in PROSPERO (CRD42024608216) and followed the 2020 PRISMA guideline [ 19 Search strategy Embase, Cochrane Library, PubMed, and Web of Science were searched for studies on the impact of progesterone receptors (PR) on breast cancer (BC) prognosis until July 4, 2024 using a combination of database-specific subject headings and text terms. Two independent reviewers utilized Boolean operators for keywords: (Progesterone) AND (Breast Tumor*) AND (Survival). The third author made the decision. Studies that included any of the above terms in the full text were collected for further review. The specific search strategy is displayed in Supplementary File S2. A secondary search was conducted to identify the references in published reviews to ensure the comprehensiveness of the search. Inclusion and exclusion criteria Studies were considered eligible if they met the following criteria: (1) female patients with histologically confirmed BC; (2) reporting hazard ratios (HR) with 95% confidence intervals (CI) for outcomes based on PR status or Kaplan-Meier survival plots and Cox regression models. (3) observational studies; (4) outcomes encompassed overall survival (OS), disease-free survival (DFS), recurrence-free survival (RFS), or BC-specific survival (BCSS). OS was specified as the number of months from surgery to death. DFS referred to the time from surgery to relapse, including local recurrence and/or distant metastasis. RFS was defined as the time from diagnosis to first documented local or distant recurrence. BCSS was defined as the time from diagnosis to BC-related death. Studies not adhering to the predetermined criteria were excluded. Other exclusion criteria encompassed (1) conference abstracts, reviews, case reports, letters, or guidelines; (2) studies with missing data or significant errors; (3) full text or abstract unavailable. Data extraction Two authors were independently responsible for study searches, screening, quality evaluation, and data extraction. The extracted data included the first author, published time, country, region, sample size, demographic information, tumor stage (TNM) [ 20 Quality assessment Study quality was appraised by two investigators via the Newcastle–Ottawa Scale (NOS) [ 21 Statistical analysis Statistical analysis was performed with STATA version 15.1 (StatCorp, College Station, TX, USA). HRs and 95% CIs were utilized to determine the prognostic value of PR. When heterogeneity ( P 2 p Results Study selection After screening 11,700 articles and excluding 4917 duplicates, we reviewed 204 articles in full text. Of those, 35 articles [ 22 56 1  Fig. 1 Flowchart for study screening Study traits and quality assessment Among the included studies, 21 studies [ 22 23 25 27 29 30 32 33 36 38 41 43 46 50 51 53 54 56 31 34 35 42 47 49 52 57 24 28 37 39 40 Association between PR status and OS The association between PR status and OS is manifested in Fig. 2 23 27 29 31 33 35 37 38 40 44 46 48 50 52 56 p 2 p  Fig. 2 Forest plot of OS Owing to high heterogeneity, we stratified the analysis by region, data analysis method, estrogen receptors (ER) status, human epidermal growth factor receptor 2 (HER2) status, menopausal status, and metastasis (Supplementary File 5). The meta-analysis revealed that PR-negative status was greatly linked with adverse OS in populations from Asia (HR 1.95; 95% CI 1.42 to 2.66), Europe (HR 1.61; 95% CI 1.39 to 1.85), and America (HR 1.44; 95% CI 1.27 to 1.63) (all p p p p p p p p p p p Similarly, in patients with ER + HER2- BC, PR-negative status was linked with worse OS (HR 2.08; 95% CI 1.42 to 3.04; p Association between PR status and DFS The association between PR status and DFS is manifested in Fig. 3 23 25 29 31 33 38 43 45 53 56 p 2 p  Fig. 3 Forest plot of DFS Due to high heterogeneity, we stratified the analysis by region, data analysis method, menopausal status, metastasis, ER, and HER2 (Supplementary File 6). The meta-analysis manifested that those with PR-negative status in Asia (HR 1.62; 95% CI 1.17 to 2.25; p p p p p 22 24 30 37 42 44 p Four articles [ 24 30 37 43 p p Association between PR status and RFS As shown in Fig. 4 22 24 35 36 39 41 42 48 50 51 p 2 p  Fig. 4 Forest plot of RFS Given heterogeneity, we stratified the analysis by region, data analysis method, and menopausal status (Supplementary File 7). The meta-analysis revealed that PR-negative status was greatly associated with poor RFS in populations from Asia (HR 1.64; 95% CI 1.18 to 2.30). Similar conclusions were obtained in univariate analysis (HR 1.75; 95% CI 1.34 to 2.38) and survival curves (HR 1.49; 95% CI 1.07 to 2.07). In the ER + HER2- and ER-HER2- subgroups, such conclusions were not made due to the small sample size and lack of statistical significance. Association between PR status and BCSS As shown in Fig. 5 23 28 30 34 49 p 2 p  Fig. 5 Forest plot of BCSS Due to high heterogeneity, we stratified the analysis by region, data analysis method, menopausal status, metastasis, ER status, and HER2 status (Supplementary File 8). The meta-analysis revealed that PR-negative status was greatly associated with poor BCSS in populations from Asia (HR 3.36; 95% CI 1.82 to 6.19, p p p p p p p Sensitivity analysis Sensitivity analysis using the leave-one-out method confirmed the stable significance in OS, DFS, RFS, or BCSS (Fig. 6  Fig. 6 Sensitivity analysis of OS ( A B C D Publication bias Funnel plots (Fig. 7 p p p p 8  Fig. 7 Publication bias of DFS ( A B  Fig. 8 Publication bias of OS ( A B Discussion This meta-analysis enrolled 35 studies on the impact of progesterone receptor (PR) status on breast cancer (BC) prognosis and illustrated that patients with PR-negative BC had worse overall survival (OS), disease-free survival (DFS), BC-specific survival (BCSS), and recurrence-free survival (RFS) than patients with PR-positive BC. These conclusions may be influenced by estrogen receptor (ER) status, human epidermal growth factor receptor 2 (HER2) status, metastatic status, and menopausal status. As a component of contemporary multimodal management, PR is key to ER signaling and can predict ER functionality and the response to endocrine therapy [ 57 58 59 60 61 62 63 64 65 66 68 69 Considering that the prognostic accuracy of PR status in BC prognosis may be affected by other factors, we performed subgroup analyses of region, ER, HER2, metastatic status, and menopausal status. Patients with PR-positive BC in Asia, Europe, and America showed better OS, DFS, and BCSS. However, there might be an effect on RFS in populations from America and Europe, consistent with previous reports [ 70 71 72 76 77 76 The ER subgroup analysis showed that among patients with ER-positive BC, those with PR-negative tumors had worse OS and BCSS than those with PR-positive tumors, suggesting that the presence of PR can be an additional prognostic factor in ER-positive BC, consistent with the results of Boland MR et al. [ 78 79 80 81 82 83 41 26 27 84 85 88 89 90 91 In this meta-analysis, the HER2 subgroup analysis in OS and DFS demonstrated that patients with PR-negative/HER2-negative BC had worse OS and DFS than those with PR-positive HER2-negative tumors. Consistently, existing evidence suggests that PR expression is prognostic in ER-positive HER-2-negative BC, particularly in tumors with high proliferation [ 92 93 94 95 97 98 99 100 101 102 Subgroup analyses of menopausal status and metastasis found poorer OS in all patients with PR-negative tumors except in those with > 50% metastasis, but no significant correlation between PR-positive and DFS was found in those with > 50% metastasis and < 50% menopausal individuals. Menopause marks the cessation of reproduction-related ovarian activity. Younger premenopausal women diagnosed with early BC, particularly those with HR + and luminal subtypes [ 103 104 105 106 107 109 110 68 111 In patients with ER+/HER2 − BC PR-negative status was linked with worse OS and DFS but not statistically linked with RFS, possibly related to TP53 mutations. TP53 mutations may be linked with recurrence and unfavorable outcomes [ 37 112 114 115 This meta-analysis demonstrates that PR-negative BC is associated with significantly worse survival outcomes, suggesting its potential as a complementary prognostic marker when interpreted alongside ER status. While ER remains the primary guide for treatment decisions, PR expression may help refine risk stratification in the ER-positive subtype by identifying patients with potentially poorer responses to endocrine therapy. However, the clinical utility of PR testing is currently limited by methodological variability in assessment. These findings emphasize the need for standardized PR testing protocols and further research to clarify the biological mechanisms underlying its prognostic value. Clinically, PR status should be viewed as part of comprehensive evaluations rather than as an independent predictor. Treatment strategies continue to prioritize ER-directed approaches. Future studies should investigate whether patients with PR-negative tumors benefit from modified therapeutic strategies, particularly in the ER-positive subtype. In metastatic BC, PR loss predicts poorer endocrine response and frequent receptor discordance. These tumors often require earlier transition to CDK4/6 inhibitors or chemotherapy, with receptors reassessed at tumor progression. Until more evidence emerges, PR assessment remains most valuable for prognostic modeling and research into tumor biology, while clinical decisions should focus on established ER-based treatment paradigms. Limitations Despite comprehensive search and analysis, our study has several limitations. Firstly, all studies were retrospective; secondly, because prognostic data could not be obtained under different treatment regimens and tumor subtypes, the impact of these characteristics on findings could not be explored; thirdly, some articles did not provide HRs and CIs directly, so we converted them via survival curve plots, which could have an impact on the data due to point bias. In addition, some subgroups had a small number of articles, and the conclusions drawn need to be interpreted with caution. Further research is needed to verify these conclusions. Conclusion This meta-analysis illustrates that progesterone receptor loss is linked with worse prognoses in breast cancer patients, suggesting that progesterone receptor is a promising prognostic marker for breast cancer. However, more studies are expected to substantiate the findings under different treatment regimens and in tumor Supplementary Information  Supplementary Material 1.  Supplementary Material 2. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Yiming Hou and Jianrong Li contributed equally to this work. Acknowledgements Not applicable. Clinical trial number Not applicable. Authors’ contributions Yiming Hou: Conceptualization, Methodology, Software, Data curation, Writing- Original draft preparation. Jianrong Li: Data curation, Visualization, Investigation, Writing- Reviewing and Editing. Qiong Zhang: Software, Validation, Supervision. Yingyi Fan: Methodology, Writing- Reviewing. All authors commented on previous versions of the manuscript. All authors read and approved the final manuscript. Funding This work was supported by the National Natural Science Foundation of China (General Program) (82374463) Study on the immune-inflammatory mechanism of Fangxia Dihuang Decoction in the treatment of breast cancer with depression based on the MG polarization regulated by PERK/eIF2α axis. Data availability The datasets used and analysed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Jemal A Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 63 38572751 10.3322/caac.21834 Bray F, Laversanne M, Sung H, Ferlay J, Siegel RL, Soerjomataram I, Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2024;74(3):229–63. 38572751 10.3322/caac.21834 2. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 33538338 10.3322/caac.21660 3. World Health Organization. Global cancer burden growing, amidst mounting need for services. 2024. PMC11115397 38438207 4. Li RH Zhang JL Liu DY Zhu L Chen J Research progress on prognostic factors of breast cancer J Mod Clin Med 2020 46 4 315 7 Li RH, Zhang JL, Liu DY, Zhu L, Chen J. Research progress on prognostic factors of breast cancer. J Mod Clin Med. 2020;46(4):315–7. 5. Egawa C Miyoshi Y Taguchi T Tamaki Y Noguchi S High BRCA2 mRNA expression predicts poor prognosis in breast cancer patients Int J Cancer 2002 98 6 879 82 10.1002/ijc.10231 11948466 Egawa C, Miyoshi Y, Taguchi T, Tamaki Y, Noguchi S. High BRCA2 mRNA expression predicts poor prognosis in breast cancer patients. Int J Cancer. 2002;98(6):879–82. 11948466 10.1002/ijc.10231 6. Liang B Li L Correlation analysis of ERα, TWIST and breast cancer and its effect on prognosis J Clin Exp Med 2018 17 10 1043 6 Liang B, Li L. Correlation analysis of ERα, TWIST and breast cancer and its effect on prognosis. J Clin Exp Med. 2018;17(10):1043–6. 7. Xiao XS Cai MY Chen JW Guan XY Kung HF Zeng YX Xie D High expression of p300 in human breast cancer correlates with tumor recurrence and predicts adverse prognosis Chin J Cancer Res 2011 23 3 201 7 10.1007/s11670-011-0201-5 23467396 PMC3587557 Xiao XS, Cai MY, Chen JW, Guan XY, Kung HF, Zeng YX, et al. High expression of p300 in human breast cancer correlates with tumor recurrence and predicts adverse prognosis. Chin J Cancer Res. 2011;23(3):201–7. 23467396 10.1007/s11670-011-0201-5 PMC3587557 8. Li XY Cao Y Jin F HES1 expression and its correlation with prognosis in breast cancer J Mod Oncol 2018 26 6 872 5 Li XY, Cao Y, Jin F. HES1 expression and its correlation with prognosis in breast cancer. J Mod Oncol. 2018;26(6):872–5. 9. Shi XY Zhang J Meng W Zhao JF Expression of transcription factors Sp1 and survivin in breast cancer and their correlation Practical Oncol J 2017 31 2 107 11 Shi XY, Zhang J, Meng W, Zhao JF. Expression of transcription factors Sp1 and survivin in breast cancer and their correlation. Practical Oncol J. 2017;31(2):107–11. 10. Li JH Lyu WP Zhu RP Cao MQ Expression of caveolin-1 in cancer-associated fibroblasts as a prognostic indicator in breast cancer J Dalian Med Univ 2017 39 2 132 6 Li JH, Lyu WP, Zhu RP, Cao MQ. Expression of caveolin-1 in cancer-associated fibroblasts as a prognostic indicator in breast cancer. J Dalian Med Univ. 2017;39(2):132–6. 11. Yu HM Yang JL Jiao SC Wang JD Li Y TGF-β1 precursor and CD8 are potential prognostic and predictive markers in operated breast cancer J Huazhong Univ Sci Technolog Med Sci 2014 34 1 51 8 10.1007/s11596-014-1231-2 24496679 Yu HM, Yang JL, Jiao SC, Wang JD, Li Y. TGF-β1 precursor and CD8 are potential prognostic and predictive markers in operated breast cancer. J Huazhong Univ Sci Technolog Med Sci. 2014;34(1):51–8. 24496679 10.1007/s11596-014-1231-2 12. Li XJ Ma FM Fu LM Fu MX Wu G Expression and prognostic significance of epcam, vimentin and N-Cadherin in Triple-negative breast cancer Progress Mod Biomed 2017 17 4 753 756760 Li XJ, Ma FM, Fu LM, Fu MX, Wu G. Expression and prognostic significance of epcam, vimentin and N-Cadherin in Triple-negative breast cancer. Progress Mod Biomed. 2017;17(4):753–756760. 13. Akrida I Mulita F Plachouri KM Benetatos N Maroulis I Papadaki H Epithelial to mesenchymal transition (EMT) in metaplastic breast cancer and phyllodes breast tumors Med Oncol 2023 41 1 20 10.1007/s12032-023-02259-4 38104042 Akrida I, Mulita F, Plachouri KM, Benetatos N, Maroulis I, Papadaki H. Epithelial to mesenchymal transition (EMT) in metaplastic breast cancer and phyllodes breast tumors. Med Oncol. 2023;41(1):20. 38104042 10.1007/s12032-023-02259-4 14. Zeng RJ Zheng CW Chen WX Xu LY Li EM Rho GTPases in cancer radiotherapy and metastasis Cancer Metastasis Rev 2020 39 4 1245 62 10.1007/s10555-020-09923-5 32772212 Zeng RJ, Zheng CW, Chen WX, Xu LY, Li EM. Rho GTPases in cancer radiotherapy and metastasis. Cancer Metastasis Rev. 2020;39(4):1245–62. 32772212 10.1007/s10555-020-09923-5 15. Li Z Wei H Li S Wu P Mao X The role of progesterone receptors in breast cancer Drug Des Devel Ther 2022 16 305 14 10.2147/DDDT.S336643 35115765 PMC8801368 Li Z, Wei H, Li S, Wu P, Mao X. The role of progesterone receptors in breast cancer. Drug Des Devel Ther. 2022;16:305–14. 35115765 10.2147/DDDT.S336643 PMC8801368 16. Hou Y Peng Y Li Z Update on prognostic and predictive biomarkers of breast cancer Semin Diagn Pathol 2022 39 5 322 32 10.1053/j.semdp.2022.06.015 35752515 Hou Y, Peng Y, Li Z. Update on prognostic and predictive biomarkers of breast cancer. Semin Diagn Pathol. 2022;39(5):322–32. 35752515 10.1053/j.semdp.2022.06.015 17. Guan HT Dai ZJ Ma YG Wang ZW Liu XX Wang XJ Correlation between GRP78 and survivin in breast cancer and their prognosis significance J Mod Oncol 2017 25 7 1054 7 Guan HT, Dai ZJ, Ma YG, Wang ZW, Liu XX, Wang XJ. Correlation between GRP78 and survivin in breast cancer and their prognosis significance. J Mod Oncol. 2017;25(7):1054–7. 18. Purdie CA Quinlan P Jordan LB Ashfield A Ogston S Dewar JA Thompson AM Progesterone receptor expression is an independent prognostic variable in early breast cancer: a population-based study Br J Cancer 2014 110 3 565 72 10.1038/bjc.2013.756 24300977 PMC3915123 Purdie CA, Quinlan P, Jordan LB, Ashfield A, Ogston S, Dewar JA, Thompson AM. Progesterone receptor expression is an independent prognostic variable in early breast cancer: a population-based study. Br J Cancer. 2014;110(3):565–72. 24300977 10.1038/bjc.2013.756 PMC3915123 19. Page MJ McKenzie JE Bossuyt PM Boutron I Hoffmann TC Mulrow CD Shamseer L Tetzlaff JM Akl EA Brennan SE The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 Page MJ, McKenzie JE, Bossuyt PM, Boutron I, Hoffmann TC, Mulrow CD, Shamseer L, Tetzlaff JM, Akl EA, Brennan SE, et al. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. BMJ. 2021;372:n71. 33782057 10.1136/bmj.n71 PMC8005924 20. Patriarca S Ferretti S Zanetti R [TNM classification of malignant tumours - Eighth edition: which news?] Epidemiol Prev 2017 41 2 140 3 28627156 10.19191/EP17.2.P140.034 Patriarca S, Ferretti S, Zanetti R. [TNM classification of malignant tumours - Eighth edition: which news?]. Epidemiol Prev. 2017;41(2):140–3. 28627156 10.19191/EP17.2.P140.034 21. Stang A Critical evaluation of the Newcastle-ottawa scale for the assessment of the quality of nonrandomized studies in meta-analyses Eur J Epidemiol 2010 25 9 603 5 10.1007/s10654-010-9491-z 20652370 Stang A. Critical evaluation of the Newcastle-ottawa scale for the assessment of the quality of nonrandomized studies in meta-analyses. Eur J Epidemiol. 2010;25(9):603–5. 20652370 10.1007/s10654-010-9491-z 22. Wang T Wang J Zhao W Pan Y Clinical outcomes and intrinsic subtypes of breast cancer patients with single hormone Receptor-positive receiving neoadjuvant chemotherapy Clin Breast Cancer 2024 24 5 e370 10.1016/j.clbc.2024.02.016 38503615 Wang T, Wang J, Zhao W, Pan Y. Clinical outcomes and intrinsic subtypes of breast cancer patients with single hormone Receptor-positive receiving neoadjuvant chemotherapy. Clin Breast Cancer. 2024;24(5):e370. e378.e371 38503615 10.1016/j.clbc.2024.02.016 23. Ding W Ye D Chen H Lin Y Li Z Tu C Clinicopathological differences and survival benefit in ER+/PR+/HER2 + vs ER+/PR-/HER2 + breast cancer subtypes Breast Cancer 2024 31 2 295 304 10.1007/s12282-023-01538-2 38231460 Ding W, Ye D, Chen H, Lin Y, Li Z, Tu C. Clinicopathological differences and survival benefit in ER+/PR+/HER2 + vs ER+/PR-/HER2 + breast cancer subtypes. Breast Cancer. 2024;31(2):295–304. 38231460 10.1007/s12282-023-01538-2 24. Mouabbi JA Raghavendra AS Bassett RL Jr Christgen M Middleton L Teshome M Nasrazadani A Hortobagyi G Hassan A Tripathy D Absence of lobular carcinoma in situ is a poor prognostic marker in invasive lobular carcinoma Eur J Cancer 2023 191 113250 10.1016/j.ejca.2023.113250 37573674 PMC10529602 Mouabbi JA, Raghavendra AS, Bassett RL Jr., Christgen M, Middleton L, Teshome M, Nasrazadani A, Hortobagyi G, Hassan A, Tripathy D, et al. Absence of lobular carcinoma in situ is a poor prognostic marker in invasive lobular carcinoma. Eur J Cancer. 2023;191:113250. 37573674 10.1016/j.ejca.2023.113250 PMC10529602 25. Kwak Y Jang SY Choi JY Lee H Shin DS Park YH Kim JY Ahn JS Chae BJ Yu J Progesterone receptor expression level predicts prognosis of estrogen receptor-positive/HER2-negative young breast cancer: a single-center prospective cohort study Cancers (Basel) 2023 10.3390/cancers15133435 37444546 PMC10341192 Kwak Y, Jang SY, Choi JY, Lee H, Shin DS, Park YH, et al. Progesterone receptor expression level predicts prognosis of estrogen receptor-positive/HER2-negative young breast cancer: a single-center prospective cohort study. Cancers (Basel). 2023. 10.3390/cancers15133435. 37444546 10.3390/cancers15133435 PMC10341192 26. Fan Y Zhong X Wang Y Wang Z Luo T Wang Y Zheng H A prospective cohort study of clinical characteristics and outcomes in Chinese patients with estrogen receptor-negative/progesterone receptor-positive early breast cancer Breast Cancer Res Treat 2023 200 2 171 82 10.1007/s10549-023-06964-6 37199804 PMC10241679 Fan Y, Zhong X, Wang Y, Wang Z, Luo T, Wang Y, et al. A prospective cohort study of clinical characteristics and outcomes in Chinese patients with estrogen receptor-negative/progesterone receptor-positive early breast cancer. Breast Cancer Res Treat. 2023;200(2):171–82. 37199804 10.1007/s10549-023-06964-6 PMC10241679 27. Shen J EFFECT OF ADJUVANT ENDOCRINE THERAPY ON ESTROGEN RECEPTOR-NEGATIVE, PROGESTERONE RECEPTOR-POSITIVE AND HER2 NEGATIVE BREAST CANCER PATIENTS Acta Med Mediterranea 2022 38 3 1595 600 Shen J, et al. EFFECT OF ADJUVANT ENDOCRINE THERAPY ON ESTROGEN RECEPTOR-NEGATIVE, PROGESTERONE RECEPTOR-POSITIVE AND HER2 NEGATIVE BREAST CANCER PATIENTS. Acta Med Mediterranea. 2022;38(3):1595–600. 28. Fei F Siegal GP Wei S Characterizing clinicopathologic features of Estrogen Receptor-Positive/Progesterone Receptor-Negative breast cancers Clin Breast Cancer 2022 22 7 e788 97 10.1016/j.clbc.2022.07.001 35915022 Fei F, Siegal GP, Wei S. Characterizing clinicopathologic features of Estrogen Receptor-Positive/Progesterone Receptor-Negative breast cancers. Clin Breast Cancer. 2022;22(7):e788–97. 35915022 10.1016/j.clbc.2022.07.001 29. Zhao X Yang X Fu L Yu K Associations of estrogen receptor, progesterone receptor, human epidemic growth factor receptor-2 and Ki-67 with ultrasound signs and prognosis of breast cancer patients Cancer Manag Res 2021 13 4579 86 10.2147/CMAR.S276422 34135634 PMC8200160 Zhao X, Yang X, Fu L, Yu K. Associations of estrogen receptor, progesterone receptor, human epidemic growth factor receptor-2 and Ki-67 with ultrasound signs and prognosis of breast cancer patients. Cancer Manag Res. 2021;13:4579–86. 34135634 10.2147/CMAR.S276422 PMC8200160 30. Lin TH Gao HW Liao GS Yu JC Dai MS Ho JY Yu CP Amongst women stratified to receive endocrine therapy on the basis of their tumor estrogen and progesterone receptor levels, those with higher tumor progesterone receptor levels had a better outcome than those with lower levels of tumor progesterone receptor Cancers (Basel) 2021 10.3390/cancers13040905 33670083 PMC7926358 Lin TH, Gao HW, Liao GS, Yu JC, Dai MS, Ho JY, et al. Amongst women stratified to receive endocrine therapy on the basis of their tumor estrogen and progesterone receptor levels, those with higher tumor progesterone receptor levels had a better outcome than those with lower levels of tumor progesterone receptor. Cancers (Basel). 2021. 10.3390/cancers13040905. 33670083 10.3390/cancers13040905 PMC7926358 31. Davey MG Ryan ÉJ Folan PJ O’Halloran N Boland MR Barry MK Sweeney KJ Malone CM McLaughlin RJ Kerin MJ The impact of progesterone receptor negativity on oncological outcomes in oestrogen-receptor-positive breast cancer BJS Open 2021 10.1093/bjsopen/zrab040 34013318 PMC8134515 Davey MG, Ryan ÉJ, Folan PJ, O’Halloran N, Boland MR, Barry MK, et al. The impact of progesterone receptor negativity on oncological outcomes in oestrogen-receptor-positive breast cancer. BJS Open. 2021. 10.1093/bjsopen/zrab040. 34013318 10.1093/bjsopen/zrab040 PMC8134515 32. Meshkat M Baghestani AR Zayeri F Khayamzadeh M Akbari ME Survival rate and prognostic factors among Iranian breast cancer patients Iran J Public Health 2020 49 2 341 50 32461942 PMC7231718 Meshkat M, Baghestani AR, Zayeri F, Khayamzadeh M, Akbari ME. Survival rate and prognostic factors among Iranian breast cancer patients. Iran J Public Health. 2020;49(2):341–50. 32461942 PMC7231718 33. Cao L Sun PL Yao M Jia M Gao H Expression of YES-associated protein (YAP) and its clinical significance in breast cancer tissues Hum Pathol 2017 68 166 74 10.1016/j.humpath.2017.08.032 28899737 Cao L, Sun PL, Yao M, Jia M, Gao H. Expression of YES-associated protein (YAP) and its clinical significance in breast cancer tissues. Hum Pathol. 2017;68:166–74. 28899737 10.1016/j.humpath.2017.08.032 34. Caldarella A Barchielli A Prognostic role of progesterone receptor expression in a population-based analysis J Cancer Res Clin Oncol 2017 143 12 2505 9 10.1007/s00432-017-2514-3 28889189 PMC11819029 Caldarella A, Barchielli A. Prognostic role of progesterone receptor expression in a population-based analysis. J Cancer Res Clin Oncol. 2017;143(12):2505–9. 28889189 10.1007/s00432-017-2514-3 PMC11819029 35. Aksoy A Odabas H Kaya S Bozkurt O Degirmenci M Topcu TO Aytekin A Arpaci E Avci N Pilanci KN Hormone receptor status and survival of medullary breast cancer patients. A Turkish cohort Saudi Med J 2017 38 2 156 62 10.15537/smj.2017.2.18055 28133688 PMC5329627 Aksoy A, Odabas H, Kaya S, Bozkurt O, Degirmenci M, Topcu TO, et al. Hormone receptor status and survival of medullary breast cancer patients. A Turkish cohort. Saudi Med J. 2017;38(2):156–62. 28133688 10.15537/smj.2017.2.18055 PMC5329627 36. Zhang M Chen H Gu J Analysis of factors affecting endocrine therapy resistance in breast cancer Oncol Lett 2016 11 1 379 84 10.3892/ol.2015.3887 26870221 PMC4726945 Zhang M, Chen H, Gu J. Analysis of factors affecting endocrine therapy resistance in breast cancer. Oncol Lett. 2016;11(1):379–84. 26870221 10.3892/ol.2015.3887 PMC4726945 37. Liu J Chen K Mao K Su F Liu Q Jacobs LK The prognostic value of age for invasive lobular breast cancer depending on estrogen receptor and progesterone receptor-defined subtypes: a NCDB analysis Oncotarget 2016 7 5 6063 73 10.18632/oncotarget.5844 26515602 PMC4868740 Liu J, Chen K, Mao K, Su F, Liu Q, Jacobs LK. The prognostic value of age for invasive lobular breast cancer depending on estrogen receptor and progesterone receptor-defined subtypes: a NCDB analysis. Oncotarget. 2016;7(5):6063–73. https://pubmed.ncbi.nlm.nih.gov/26515602/ 26515602 10.18632/oncotarget.5844 PMC4868740 38. Li H, et al. Prognostic value of progesterone receptor status in Chinese breast cancer patients treated with Tamoxifen. Int J Clin Exp Med. 2016;9(2):2175–83. 39. Shen T Brandwein-Gensler M Hameed O Siegal GP Wei S Characterization of estrogen receptor-negative/progesterone receptor-positive breast cancer Hum Pathol 2015 46 11 1776 84 10.1016/j.humpath.2015.07.019 26363528 Shen T, Brandwein-Gensler M, Hameed O, Siegal GP, Wei S. Characterization of estrogen receptor-negative/progesterone receptor-positive breast cancer. Hum Pathol. 2015;46(11):1776–84. 26363528 10.1016/j.humpath.2015.07.019 40. Shen Q Sahin AA Hess KR Suki D Aldape KD Sawaya R Ibrahim NK Breast cancer with brain metastases: clinicopathologic features, survival, and paired biomarker analysis Oncologist 2015 20 5 466 73 10.1634/theoncologist.2014-0107 25802405 PMC4425375 Shen Q, Sahin AA, Hess KR, Suki D, Aldape KD, Sawaya R, et al. Breast cancer with brain metastases: clinicopathologic features, survival, and paired biomarker analysis. Oncologist. 2015;20(5):466–73. 25802405 10.1634/theoncologist.2014-0107 PMC4425375 41. Fan Y Ding X Xu B Ma F Yuan P Wang J Zhang P Li Q Luo Y Prognostic significance of single progesterone receptor positivity: a comparison study of estrogen receptor negative/progesterone receptor positive/Her2 negative primary breast cancer with triple negative breast cancer Medicine (Baltimore) 2015 94 46 e2066 10.1097/MD.0000000000002066 26579819 PMC4652828 Fan Y, Ding X, Xu B, Ma F, Yuan P, Wang J, et al. Prognostic significance of single progesterone receptor positivity: a comparison study of estrogen receptor negative/progesterone receptor positive/Her2 negative primary breast cancer with triple negative breast cancer. Medicine (Baltimore). 2015;94(46):e2066. 26579819 10.1097/MD.0000000000002066 PMC4652828 42. Bal O Yalcintas Arslan U Durnali A Uyetrk U Demirci A Tastekin D Ekinci A Esbah O Turker I Uysal Sonmez O Progesterone receptor status in determining the prognosis of Estrogen receptor positive/ HER2 negative breast carcinoma patients J Buon 2015 20 1 28 34 25778292 Bal O, Yalcintas Arslan U, Durnali A, Uyetrk U, Demirci A, Tastekin D, Ekinci A, Esbah O, Turker I, Uysal Sonmez O, et al. Progesterone receptor status in determining the prognosis of Estrogen receptor positive/ HER2 negative breast carcinoma patients. J Buon. 2015;20(1):28–34. 25778292 43. Bae SY Kim S Lee JH Lee HC Lee SK Kil WH Kim SW Lee JE Nam SJ Poor prognosis of single hormone receptor-positive breast cancer: similar outcome as triple-negative breast cancer BMC Cancer 2015 15 138 10.1186/s12885-015-1121-4 25880075 PMC4396721 Bae SY, Kim S, Lee JH, Lee HC, Lee SK, Kil WH, et al. Poor prognosis of single hormone receptor-positive breast cancer: similar outcome as triple-negative breast cancer. BMC Cancer. 2015;15:138. 25880075 10.1186/s12885-015-1121-4 PMC4396721 44. Zong Y Zhu L Wu J Chen X Huang O Fei X He J Chen W Li Y Shen K Progesterone receptor status and Ki-67 index may predict early relapse in luminal B/HER2 negative breast cancer patients: a retrospective study PLoS One 2014 9 8 e95629 10.1371/journal.pone.0095629 25170613 PMC4149365 Zong Y, Zhu L, Wu J, Chen X, Huang O, Fei X, et al. Progesterone receptor status and Ki-67 index may predict early relapse in luminal B/HER2 negative breast cancer patients: a retrospective study. PLoS One. 2014;9(8):e95629. 25170613 10.1371/journal.pone.0095629 PMC4149365 45. Ng CH Pathy NB Taib NA Ho GF Mun KS Rhodes A Looi LM Yip CH Do clinical features and survival of single hormone receptor positive breast cancers differ from double hormone receptor positive breast cancers? Asian Pac J Cancer Prev 2014 15 18 7959 64 10.7314/APJCP.2014.15.18.7959 25292095 Ng CH, Pathy NB, Taib NA, Ho GF, Mun KS, Rhodes A, et al. Do clinical features and survival of single hormone receptor positive breast cancers differ from double hormone receptor positive breast cancers? Asian Pac J Cancer Prev. 2014;15(18):7959–64. 25292095 10.7314/apjcp.2014.15.18.7959 46. Huang WH Analysis of clinicopathological characteristics and prognosis of 1425 primary breast cancer patients in Eastern Guangdong, China Curr Signal Transduct Ther 2014 9 1 44 9 10.2174/1574362409666140724183612 Huang WH, et al. Analysis of clinicopathological characteristics and prognosis of 1425 primary breast cancer patients in Eastern Guangdong, China. Curr Signal Transduct Ther. 2014;9(1):44–9. 47. Todorovic-Rakovic N Neskovic-Konstantinovic Z Age related influence of triple receptor status on metastatic breast cancer post relapse survival J Buon 2013 18 4 851 8 24344008 Todorovic-Rakovic N, Neskovic-Konstantinovic Z. Age related influence of triple receptor status on metastatic breast cancer post relapse survival. J Buon. 2013;18(4):851–8. 24344008 48. Pinto AE Areia F Pereira T Cardoso P Aparício M Silva GL Ferreira MC André S Clinical relevance of the reappraisal of negative hormone receptor expression in breast cancer Springerplus 2013 2 375 10.1186/2193-1801-2-375 24010033 PMC3755814 Pinto AE, Areia F, Pereira T, Cardoso P, Aparício M, Silva GL, Ferreira MC, André S. Clinical relevance of the reappraisal of negative hormone receptor expression in breast cancer. Springerplus. 2013;2:375. 24010033 10.1186/2193-1801-2-375 PMC3755814 49. García Fernández A Giménez N Fraile M González S Chabrera C Torras M González C Salas A Barco I Cirera L Survival and clinicopathological characteristics of breast cancer patient according to different tumour subtypes as determined by hormone receptor and Her2 immunohistochemistry. A single institution survey spanning 1998 to 2010 Breast 2012 21 3 366 73 10.1016/j.breast.2012.03.004 22487206 García Fernández A, Giménez N, Fraile M, González S, Chabrera C, Torras M, et al. Survival and clinicopathological characteristics of breast cancer patient according to different tumour subtypes as determined by hormone receptor and Her2 immunohistochemistry. A single institution survey spanning 1998 to 2010. Breast. 2012;21(3):366–73. 22487206 10.1016/j.breast.2012.03.004 50. Yao-Lung K Dar-Ren C Tsai-Wang C Clinicopathological features of triple-negative breast cancer in Taiwanese women Int J Clin Oncol 2011 16 5 500 5 10.1007/s10147-011-0211-9 21455625 Yao-Lung K, Dar-Ren C, Tsai-Wang C. Clinicopathological features of triple-negative breast cancer in Taiwanese women. Int J Clin Oncol. 2011;16(5):500–5. 21455625 10.1007/s10147-011-0211-9 51. Jung SY Jeong J Shin SH Kwon Y Kim EA Ko KL Shin KH Ro J Lee KS Park IH Accumulation of p53 determined by immunohistochemistry as a prognostic marker in node negative breast cancer; analysis according to St Gallen consensus and intrinsic subtypes J Surg Oncol 2011 103 3 207 11 10.1002/jso.21819 21337548 Jung SY, Jeong J, Shin SH, Kwon Y, Kim EA, Ko KL, et al. Accumulation of p53 determined by immunohistochemistry as a prognostic marker in node negative breast cancer; analysis according to St Gallen consensus and intrinsic subtypes. J Surg Oncol. 2011;103(3):207–11. 21337548 10.1002/jso.21819 52. Stuart-Harris R Shadbolt B Palmqvist C Chaudri Ross HA The prognostic significance of single hormone receptor positive metastatic breast cancer: an analysis of three randomised phase III trials of aromatase inhibitors Breast 2009 18 6 351 5 10.1016/j.breast.2009.09.002 19836952 Stuart-Harris R, Shadbolt B, Palmqvist C, Chaudri Ross HA. The prognostic significance of single hormone receptor positive metastatic breast cancer: an analysis of three randomised phase III trials of aromatase inhibitors. Breast. 2009;18(6):351–5. 19836952 10.1016/j.breast.2009.09.002 53. Lin C Chien SY Chen LS Kuo SJ Chang TW Chen DR Triple negative breast carcinoma is a prognostic factor in Taiwanese women BMC Cancer 2009 9 192 10.1186/1471-2407-9-192 19534825 PMC2706258 Lin C, Chien SY, Chen LS, Kuo SJ, Chang TW, Chen DR. Triple negative breast carcinoma is a prognostic factor in Taiwanese women. BMC Cancer. 2009;9:192. 19534825 10.1186/1471-2407-9-192 PMC2706258 54. Yu KD Liu GY Di GH Wu J Lu JS Shen KW Shen ZZ Shao ZM Progesterone receptor status provides predictive value for adjuvant endocrine therapy in older estrogen receptor-positive breast cancer patients Breast 2007 16 3 307 15 10.1016/j.breast.2006.12.011 17293115 Yu KD, Liu GY, Di GH, Wu J, Lu JS, Shen KW, et al. Progesterone receptor status provides predictive value for adjuvant endocrine therapy in older estrogen receptor-positive breast cancer patients. Breast. 2007;16(3):307–15. 17293115 10.1016/j.breast.2006.12.011 55. Robertson JF Cannon PM Nicholson RI Blamey RW Oestrogen and progesterone receptors as prognostic variables in hormonally treated breast cancer Int J Biol Markers 1996 11 1 29 35 10.1177/172460089601100106 8740639 Robertson JF, Cannon PM, Nicholson RI, Blamey RW. Oestrogen and progesterone receptors as prognostic variables in hormonally treated breast cancer. Int J Biol Markers. 1996;11(1):29–35. 8740639 10.1177/172460089601100106 56. Kurebayashi J Ishida T Higashi Y Suemasu K Nomoto C Yoshida K Prognostic significances of Estrogen and progesterone receptors in primary operable breast cancer Jpn J Clin Oncol 1990 20 3 271 80 2255103 Kurebayashi J, Ishida T, Higashi Y, Suemasu K, Nomoto C, Yoshida K. Prognostic significances of Estrogen and progesterone receptors in primary operable breast cancer. Jpn J Clin Oncol. 1990;20(3):271–80. 2255103 57. Horwitz KB McGuire WL Predicting response to endocrine therapy in human breast cancer: a hypothesis Science 1975 189 4204 726 7 10.1126/science.168640 168640 Horwitz KB, McGuire WL. Predicting response to endocrine therapy in human breast cancer: a hypothesis. Science. 1975;189(4204):726–7. 168640 10.1126/science.168640 58. Horwitz KB McGuire WL Estrogen control of progesterone receptor in human breast cancer. Correlation with nuclear processing of estrogen receptor J Biol Chem 1978 253 7 2223 8 10.1016/S0021-9258(17)38062-6 632265 Horwitz KB, McGuire WL. Estrogen control of progesterone receptor in human breast cancer. Correlation with nuclear processing of estrogen receptor. J Biol Chem. 1978;253(7):2223–8. 632265 59. Ueno T Saji S Chiba T Kamma H Isaka H Itoh H Imi K Miyamoto K Tada M Sasano H Progesterone receptor expression in proliferating cancer cells of hormone-receptor-positive breast cancer Tumour Biol 2018 40 10 1010428318811025 10.1177/1010428318811025 30841783 Ueno T, Saji S, Chiba T, Kamma H, Isaka H, Itoh H, Imi K, Miyamoto K, Tada M, Sasano H, et al. Progesterone receptor expression in proliferating cancer cells of hormone-receptor-positive breast cancer. Tumour Biol. 2018;40(10):1010428318811025. 30841783 10.1177/1010428318811025 60. Pastò B Vida R Dri A Foffano L Della Rossa S Gerratana L Puglisi F Beyond hormone receptors: liquid biopsy tools to unveil new clinical meanings and empower therapeutic decision-making in Luminal-like metastatic breast cancer Breast 2025 79 103859 10.1016/j.breast.2024.103859 39708442 PMC11872398 Pastò B, Vida R, Dri A, Foffano L, Della Rossa S, Gerratana L, Puglisi F. Beyond hormone receptors: liquid biopsy tools to unveil new clinical meanings and empower therapeutic decision-making in Luminal-like metastatic breast cancer. Breast. 2025;79:103859. 39708442 10.1016/j.breast.2024.103859 PMC11872398 61. O’Leary B Cutts RJ Liu Y Hrebien S Huang X Fenwick K André F Loibl S Loi S Garcia-Murillas I The genetic landscape and clonal evolution of breast cancer resistance to Palbociclib plus fulvestrant in the PALOMA-3 trial Cancer Discov 2018 8 11 1390 403 10.1158/2159-8290.CD-18-0264 30206110 PMC6368247 O’Leary B, Cutts RJ, Liu Y, Hrebien S, Huang X, Fenwick K, André F, Loibl S, Loi S, Garcia-Murillas I, et al. The genetic landscape and clonal evolution of breast cancer resistance to Palbociclib plus fulvestrant in the PALOMA-3 trial. Cancer Discov. 2018;8(11):1390–403. 30206110 10.1158/2159-8290.CD-18-0264 PMC6368247 62. Mohammed H Russell IA Stark R Rueda OM Hickey TE Tarulli GA Serandour AA Birrell SN Bruna A Saadi A Progesterone receptor modulates ERα action in breast cancer Nature 2015 523 7560 313 7 10.1038/nature14583 26153859 PMC4650274 Mohammed H, Russell IA, Stark R, Rueda OM, Hickey TE, Tarulli GA, Serandour AA, Birrell SN, Bruna A, Saadi A, et al. Progesterone receptor modulates ERα action in breast cancer. Nature. 2015;523(7560):313–7. 26153859 10.1038/nature14583 PMC4650274 63. Lanari C Wargon V Rojas P Molinolo AA Antiprogestins in breast cancer treatment: are we ready? Endocr Relat Cancer 2012 19 3 R35 50 10.1530/ERC-11-0378 22351709 Lanari C, Wargon V, Rojas P, Molinolo AA. Antiprogestins in breast cancer treatment: are we ready? Endocr Relat Cancer. 2012;19(3):R35–50. 22351709 10.1530/ERC-11-0378 64. Lundgren S Progestins in breast cancer treatment. A review Acta Oncol 1992 31 7 709 722 10.3109/02841869209083859 1476750 Lundgren S. Progestins in breast cancer treatment. A review. Acta Oncol. 1992;31(7):709–22. 1476750 10.3109/02841869209083859 65. Singhal H Greene ME Tarulli G Zarnke AL Bourgo RJ Laine M Chang YF Ma S Dembo AG Raj GV Genomic agonism and phenotypic antagonism between estrogen and progesterone receptors in breast cancer Sci Adv 2016 2 6 e1501924 10.1126/sciadv.1501924 27386569 PMC4928895 Singhal H, Greene ME, Tarulli G, Zarnke AL, Bourgo RJ, Laine M, et al. Genomic agonism and phenotypic antagonism between estrogen and progesterone receptors in breast cancer. Sci Adv. 2016;2(6):e1501924. 27386569 10.1126/sciadv.1501924 PMC4928895 66. Aromatase inhibitors versus Tamoxifen in early breast cancer: patient-level meta-analysis of the randomised trials Lancet 2015 386 10001 1341 52 10.1016/S0140-6736(15)61074-1 26211827 Aromatase inhibitors versus. Tamoxifen in early breast cancer: patient-level meta-analysis of the randomised trials. Lancet. 2015;386(10001):1341–52. 26211827 10.1016/S0140-6736(15)61074-1 67. Cui X Schiff R Arpino G Osborne CK Lee AV Biology of progesterone receptor loss in breast cancer and its implications for endocrine therapy J Clin Oncol 2005 23 30 7721 35 10.1200/JCO.2005.09.004 16234531 Cui X, Schiff R, Arpino G, Osborne CK, Lee AV. Biology of progesterone receptor loss in breast cancer and its implications for endocrine therapy. J Clin Oncol. 2005;23(30):7721–35. 16234531 10.1200/JCO.2005.09.004 68. Davies C Godwin J Gray R Clarke M Cutter D Darby S McGale P Pan HC Taylor C Wang YC Relevance of breast cancer hormone receptors and other factors to the efficacy of adjuvant tamoxifen: patient-level meta-analysis of randomised trials Lancet 2011 378 9793 771 84 10.1016/S0140-6736(11)60993-8 21802721 PMC3163848 Davies C, Godwin J, Gray R, Clarke M, Cutter D, Darby S, McGale P, Pan HC, Taylor C, Wang YC, et al. Relevance of breast cancer hormone receptors and other factors to the efficacy of adjuvant tamoxifen: patient-level meta-analysis of randomised trials. Lancet. 2011;378(9793):771–84. 21802721 10.1016/S0140-6736(11)60993-8 PMC3163848 69. Cui X Zhang P Deng W Oesterreich S Lu Y Mills GB Lee AV Insulin-like growth factor-I inhibits progesterone receptor expression in breast cancer cells via the phosphatidylinositol 3-kinase/Akt/mammalian target of rapamycin pathway: progesterone receptor as a potential indicator of growth factor activity in breast cancer Mol Endocrinol 2003 17 4 575 88 10.1210/me.2002-0318 12554765 Cui X, Zhang P, Deng W, Oesterreich S, Lu Y, Mills GB, et al. Insulin-like growth factor-I inhibits progesterone receptor expression in breast cancer cells via the phosphatidylinositol 3-kinase/Akt/mammalian target of rapamycin pathway: progesterone receptor as a potential indicator of growth factor activity in breast cancer. Mol Endocrinol. 2003;17(4):575–88. 12554765 10.1210/me.2002-0318 70. Ellis L Canchola AJ Spiegel D Ladabaum U Haile R Gomez SL Racial and ethnic disparities in cancer survival: the contribution of tumor, sociodemographic, institutional, and neighborhood characteristics J Clin Oncol 2018 36 1 25 33 10.1200/JCO.2017.74.2049 29035642 PMC5756323 Ellis L, Canchola AJ, Spiegel D, Ladabaum U, Haile R, Gomez SL. Racial and ethnic disparities in cancer survival: the contribution of tumor, sociodemographic, institutional, and neighborhood characteristics. J Clin Oncol. 2018;36(1):25–33. 29035642 10.1200/JCO.2017.74.2049 PMC5756323 71. Trinh QD Nguyen PL Leow JJ Dalela D Chao GF Mahal BA Nayak M Schmid M Choueiri TK Aizer AA Cancer-specific mortality of Asian Americans diagnosed with cancer: a nationwide population-based assessment J Natl Cancer Inst 2015 107 6 djv054 10.1093/jnci/djv054 25794888 Trinh QD, Nguyen PL, Leow JJ, Dalela D, Chao GF, Mahal BA, et al. Cancer-specific mortality of Asian Americans diagnosed with cancer: a nationwide population-based assessment. J Natl Cancer Inst. 2015;107(6):djv054. 25794888 10.1093/jnci/djv054 72. Pan JW Zabidi MMA Ng PS Meng MY Hasan SN Sandey B Sammut SJ Yip CH Rajadurai P Rueda OM The molecular landscape of Asian breast cancers reveals clinically relevant population-specific differences Nat Commun 2020 11 1 6433 10.1038/s41467-020-20173-5 33353943 PMC7755902 Pan JW, Zabidi MMA, Ng PS, Meng MY, Hasan SN, Sandey B, Sammut SJ, Yip CH, Rajadurai P, Rueda OM, et al. The molecular landscape of Asian breast cancers reveals clinically relevant population-specific differences. Nat Commun. 2020;11(1):6433. 33353943 10.1038/s41467-020-20173-5 PMC7755902 73. Jiang YZ Ma D Suo C Shi J Xue M Hu X Xiao Y Yu KD Liu YR Yu Y Genomic and transcriptomic landscape of Triple-Negative breast cancers: subtypes and treatment strategies Cancer Cell 2019 35 3 428 e440425 10.1016/j.ccell.2019.02.001 30853353 Jiang YZ, Ma D, Suo C, Shi J, Xue M, Hu X, Xiao Y, Yu KD, Liu YR, Yu Y, et al. Genomic and transcriptomic landscape of Triple-Negative breast cancers: subtypes and treatment strategies. Cancer Cell. 2019;35(3):428–e440425. 30853353 10.1016/j.ccell.2019.02.001 74. Curtis C Shah SP Chin SF Turashvili G Rueda OM Dunning MJ Speed D Lynch AG Samarajiwa S Yuan Y The genomic and transcriptomic architecture of 2,000 breast tumours reveals novel subgroups Nature 2012 486 7403 346 52 10.1038/nature10983 22522925 PMC3440846 Curtis C, Shah SP, Chin SF, Turashvili G, Rueda OM, Dunning MJ, Speed D, Lynch AG, Samarajiwa S, Yuan Y, et al. The genomic and transcriptomic architecture of 2,000 breast tumours reveals novel subgroups. Nature. 2012;486(7403):346–52. 22522925 10.1038/nature10983 PMC3440846 75. Comprehensive molecular portraits Of human breast tumours Nature 2012 490 7418 61 70 10.1038/nature11412 23000897 PMC3465532 Comprehensive molecular portraits. Of human breast tumours. Nature. 2012;490(7418):61–70. 23000897 10.1038/nature11412 PMC3465532 76. Kan Z Ding Y Kim J Jung HH Chung W Lal S Cho S Fernandez-Banet J Lee SK Kim SW Multi-omics profiling of younger Asian breast cancers reveals distinctive molecular signatures Nat Commun 2018 9 1 1725 10.1038/s41467-018-04129-4 29713003 PMC5928087 Kan Z, Ding Y, Kim J, Jung HH, Chung W, Lal S, Cho S, Fernandez-Banet J, Lee SK, Kim SW, et al. Multi-omics profiling of younger Asian breast cancers reveals distinctive molecular signatures. Nat Commun. 2018;9(1):1725. 29713003 10.1038/s41467-018-04129-4 PMC5928087 77. Yap YS Lu YS Tamura K Lee JE Ko EY Park YH Cao AY Lin CH Toi M Wu J Insights into breast cancer in the East vs the West: a review JAMA Oncol 2019 5 10 1489 96 10.1001/jamaoncol.2019.0620 31095268 Yap YS, Lu YS, Tamura K, Lee JE, Ko EY, Park YH, et al. Insights into breast cancer in the East vs the West: a review. JAMA Oncol. 2019;5(10):1489–96. 31095268 10.1001/jamaoncol.2019.0620 78. Boland MR Ryan ÉJ Dunne E Aherne TM Bhatt NR Lowery AJ Meta-analysis of the impact of progesterone receptor status on oncological outcomes in oestrogen receptor-positive breast cancer Br J Surg 2020 107 1 33 43 10.1002/bjs.11347 31755998 Boland MR, Ryan ÉJ, Dunne E, Aherne TM, Bhatt NR, Lowery AJ. Meta-analysis of the impact of progesterone receptor status on oncological outcomes in oestrogen receptor-positive breast cancer. Br J Surg. 2020;107(1):33–43. 31755998 10.1002/bjs.11347 79. Yang LH Tseng HS Lin C Chen LS Chen ST Kuo SJ Chen DR Survival benefit of tamoxifen in estrogen receptor-negative and progesterone receptor-positive low grade breast cancer patients J Breast Cancer 2012 15 3 288 95 10.4048/jbc.2012.15.3.288 23091541 PMC3468782 Yang LH, Tseng HS, Lin C, Chen LS, Chen ST, Kuo SJ, et al. Survival benefit of tamoxifen in estrogen receptor-negative and progesterone receptor-positive low grade breast cancer patients. J Breast Cancer. 2012;15(3):288–95. 23091541 10.4048/jbc.2012.15.3.288 PMC3468782 80. Li Y Yang D Yin X Zhang X Huang J Wu Y Wang M Yi Z Li H Li H Clinicopathological characteristics and breast cancer-specific survival of patients with single hormone receptor-positive breast cancer JAMA Netw Open 2020 3 1 e1918160 10.1001/jamanetworkopen.2019.18160 31899528 PMC6991239 Li Y, Yang D, Yin X, Zhang X, Huang J, Wu Y, et al. Clinicopathological characteristics and breast cancer-specific survival of patients with single hormone receptor-positive breast cancer. JAMA Netw Open. 2020;3(1):e1918160. 31899528 10.1001/jamanetworkopen.2019.18160 PMC6991239 81. Yu KD Jiang YZ Hao S Shao ZM Molecular essence and endocrine responsiveness of estrogen receptor-negative, progesterone receptor-positive, and HER2-negative breast cancer BMC Med 2015 13 254 10.1186/s12916-015-0496-z 26437901 PMC4595063 Yu KD, Jiang YZ, Hao S, Shao ZM. Molecular essence and endocrine responsiveness of estrogen receptor-negative, progesterone receptor-positive, and HER2-negative breast cancer. BMC Med. 2015;13:254. 26437901 10.1186/s12916-015-0496-z PMC4595063 82. Yi M Mittendorf EA Cormier JN Buchholz TA Bilimoria K Sahin AA Hortobagyi GN Gonzalez-Angulo AM Luo S Buzdar AU Novel staging system for predicting disease-specific survival in patients with breast cancer treated with surgery as the first intervention: time to modify the current American joint committee on cancer staging system J Clin Oncol 2011 29 35 4654 61 10.1200/JCO.2011.38.3174 22084362 PMC3236648 Yi M, Mittendorf EA, Cormier JN, Buchholz TA, Bilimoria K, Sahin AA, et al. Novel staging system for predicting disease-specific survival in patients with breast cancer treated with surgery as the first intervention: time to modify the current American joint committee on cancer staging system. J Clin Oncol. 2011;29(35):4654–61. 22084362 10.1200/JCO.2011.38.3174 PMC3236648 83. Molinelli C Bruzzone M Blondeaux E Ruelle T Lanzavecchia C De Laurentiis M Russo S Riccardi F Sini V Cognetti F The journey of patients affected by metastatic hormone receptor-positive/HER2-negative breast cancer from CDK 4/6 inhibitors to second-line treatment: a real-world analysis of 701 patients enrolled in the GIM14/BIOMETA study Eur J Cancer 2024 213 115113 10.1016/j.ejca.2024.115113 39536433 Molinelli C, Bruzzone M, Blondeaux E, Ruelle T, Lanzavecchia C, De Laurentiis M, et al. The journey of patients affected by metastatic hormone receptor-positive/HER2-negative breast cancer from CDK 4/6 inhibitors to second-line treatment: a real-world analysis of 701 patients enrolled in the GIM14/BIOMETA study. Eur J Cancer. 2024;213:115113. 39536433 10.1016/j.ejca.2024.115113 84. Honma N Horii R Iwase T Saji S Younes M Ito Y Akiyama F Proportion of estrogen or progesterone receptor expressing cells in breast cancers and response to endocrine therapy Breast 2014 23 6 754 62 10.1016/j.breast.2014.08.003 25176593 Honma N, Horii R, Iwase T, Saji S, Younes M, Ito Y, et al. Proportion of estrogen or progesterone receptor expressing cells in breast cancers and response to endocrine therapy. Breast. 2014;23(6):754–62. 25176593 10.1016/j.breast.2014.08.003 85. Maleki Z Shariat S Mokri M Atri M ER-negative /PR-positive breast carcinomas or technical artifacts in immunohistochemistry? Arch Iran Med 2012 15 6 366 9 22642247 Maleki Z, Shariat S, Mokri M, Atri M. ER-negative /PR-positive breast carcinomas or technical artifacts in immunohistochemistry? Arch Iran Med. 2012;15(6):366–9. 22642247 86. Foley NM Coll JM Lowery AJ Hynes SO Kerin MJ Sheehan M Brodie C Sweeney KJ Re-appraisal of estrogen receptor negative/progesterone receptor positive (ER-/PR+) breast cancer phenotype: true subtype or technical artefact?? Pathol Oncol Res 2018 24 4 881 4 10.1007/s12253-017-0304-5 28891017 Foley NM, Coll JM, Lowery AJ, Hynes SO, Kerin MJ, Sheehan M, et al. Re-appraisal of estrogen receptor negative/progesterone receptor positive (ER-/PR+) breast cancer phenotype: true subtype or technical artefact?? Pathol Oncol Res. 2018;24(4):881–4. 28891017 10.1007/s12253-017-0304-5 87. Sparano JA, Gray RJ, Makower DF, Pritchard KI, Albain KS, Hayes DF, Geyer CE Jr, Dees EC, Goetz MP, Olson JA, editors. Jr. : Adjuvant Chemotherapy Guided by a 21-Gene Expression Assay in Breast Cancer. N Engl J Med 10.1056/NEJMoa1804710 PMC6172658 29860917 88. Badve SS Baehner FL Gray RP Childs BH Maddala T Liu ML Rowley SC Shak S Perez EA Shulman LJ Estrogen- and progesterone-receptor status in ECOG 2197: comparison of immunohistochemistry by local and central laboratories and quantitative reverse transcription polymerase chain reaction by central laboratory J Clin Oncol 2008 26 15 2473 81 10.1200/JCO.2007.13.6424 18487567 Badve SS, Baehner FL, Gray RP, Childs BH, Maddala T, Liu ML, Rowley SC, Shak S, Perez EA, Shulman LJ, et al. Estrogen- and progesterone-receptor status in ECOG 2197: comparison of immunohistochemistry by local and central laboratories and quantitative reverse transcription polymerase chain reaction by central laboratory. J Clin Oncol. 2008;26(15):2473–81. 18487567 10.1200/JCO.2007.13.6424 89. Cserni G Francz M Kálmán E Kelemen G Komjáthy DC Kovács I Kulka J Sarkadi L Udvarhelyi N Vass L Estrogen receptor negative and progesterone receptor positive breast carcinomas-how frequent are they? Pathol Oncol Res 2011 17 3 663 8 10.1007/s12253-011-9366-y 21267685 Cserni G, Francz M, Kálmán E, Kelemen G, Komjáthy DC, Kovács I, et al. Estrogen receptor negative and progesterone receptor positive breast carcinomas-how frequent are they? Pathol Oncol Res. 2011;17(3):663–8. 21267685 10.1007/s12253-011-9366-y 90. Herynk MH Fuqua SA Estrogen receptor mutations in human disease Endocr Rev 2004 25 6 869 98 10.1210/er.2003-0010 15583021 Herynk MH, Fuqua SA. Estrogen receptor mutations in human disease. Endocr Rev. 2004;25(6):869–98. 15583021 10.1210/er.2003-0010 91. Fuqua SA Fitzgerald SD Chamness GC Tandon AK McDonnell DP Nawaz Z O’Malley BW McGuire WL Variant human breast tumor estrogen receptor with constitutive transcriptional activity Cancer Res 1991 51 1 105 9 1988075 Fuqua SA, Fitzgerald SD, Chamness GC, Tandon AK, McDonnell DP, Nawaz Z, et al. Variant human breast tumor estrogen receptor with constitutive transcriptional activity. Cancer Res. 1991;51(1):105–9. 1988075 92. Van Asten K Slembrouck L Olbrecht S Jongen L Brouckaert O Wildiers H Floris G Van Limbergen E Weltens C Smeets A Prognostic value of the progesterone receptor by subtype in patients with estrogen receptor-positive, HER-2 negative breast cancer Oncologist 2019 24 2 165 71 10.1634/theoncologist.2018-0176 30171067 PMC6369957 Van Asten K, Slembrouck L, Olbrecht S, Jongen L, Brouckaert O, Wildiers H, et al. Prognostic value of the progesterone receptor by subtype in patients with estrogen receptor-positive, HER-2 negative breast cancer. Oncologist. 2019;24(2):165–71. 30171067 10.1634/theoncologist.2018-0176 PMC6369957 93. Carey LA Perou CM Livasy CA Dressler LG Cowan D Conway K Karaca G Troester MA Tse CK Edmiston S Race, breast cancer subtypes, and survival in the Carolina breast cancer study JAMA 2006 295 21 2492 502 10.1001/jama.295.21.2492 16757721 Carey LA, Perou CM, Livasy CA, Dressler LG, Cowan D, Conway K, Karaca G, Troester MA, Tse CK, Edmiston S, et al. Race, breast cancer subtypes, and survival in the Carolina breast cancer study. JAMA. 2006;295(21):2492–502. 16757721 10.1001/jama.295.21.2492 94. Romond EH Perez EA Bryant J Suman VJ Geyer CE Jr Davidson NE Tan-Chiu E Martino S Paik S Kaufman PA Trastuzumab plus adjuvant chemotherapy for operable HER2-positive breast cancer N Engl J Med 2005 353 16 1673 84 10.1056/NEJMoa052122 16236738 Romond EH, Perez EA, Bryant J, Suman VJ, Geyer CE Jr., Davidson NE, Tan-Chiu E, Martino S, Paik S, Kaufman PA, et al. Trastuzumab plus adjuvant chemotherapy for operable HER2-positive breast cancer. N Engl J Med. 2005;353(16):1673–84. 16236738 10.1056/NEJMoa052122 95. Bauer KR Brown M Cress RD Parise CA Caggiano V Descriptive analysis of estrogen receptor (ER)-negative, progesterone receptor (PR)-negative, and HER2-negative invasive breast cancer, the so-called triple-negative phenotype: a population-based study from the California cancer registry Cancer 2007 109 9 1721 8 10.1002/cncr.22618 17387718 Bauer KR, Brown M, Cress RD, Parise CA, Caggiano V. Descriptive analysis of estrogen receptor (ER)-negative, progesterone receptor (PR)-negative, and HER2-negative invasive breast cancer, the so-called triple-negative phenotype: a population-based study from the California cancer registry. Cancer. 2007;109(9):1721–8. 17387718 10.1002/cncr.22618 96. Morris GJ Naidu S Topham AK Guiles F Xu Y McCue P Schwartz GF Park PK Rosenberg AL Brill K Differences in breast carcinoma characteristics in newly diagnosed African-American and Caucasian patients: a single-institution compilation compared with the National cancer institute’s surveillance, epidemiology, and end results database Cancer 2007 110 4 876 84 10.1002/cncr.22836 17620276 Morris GJ, Naidu S, Topham AK, Guiles F, Xu Y, McCue P, Schwartz GF, Park PK, Rosenberg AL, Brill K, et al. Differences in breast carcinoma characteristics in newly diagnosed African-American and Caucasian patients: a single-institution compilation compared with the National cancer institute’s surveillance, epidemiology, and end results database. Cancer. 2007;110(4):876–84. 17620276 10.1002/cncr.22836 97. Stark A Kapke A Schultz D Brown R Linden M Raju U Advanced stages and poorly differentiated grade are associated with an increased risk of HER2/neu positive breast carcinoma only in white women: findings from a prospective cohort study of African-American and white-American women Breast Cancer Res Treat 2008 107 3 405 14 10.1007/s10549-007-9560-5 17431759 Stark A, Kapke A, Schultz D, Brown R, Linden M, Raju U. Advanced stages and poorly differentiated grade are associated with an increased risk of HER2/neu positive breast carcinoma only in white women: findings from a prospective cohort study of African-American and white-American women. Breast Cancer Res Treat. 2008;107(3):405–14. 17431759 10.1007/s10549-007-9560-5 98. Lund MJ Trivers KF Porter PL Coates RJ Leyland-Jones B Brawley OW Flagg EW O’Regan RM Gabram SG Eley JW Race and triple negative threats to breast cancer survival: a population-based study in Atlanta, GA Breast Cancer Res Treat 2009 113 2 357 70 10.1007/s10549-008-9926-3 18324472 Lund MJ, Trivers KF, Porter PL, Coates RJ, Leyland-Jones B, Brawley OW, et al. Race and triple negative threats to breast cancer survival: a population-based study in Atlanta, GA. Breast Cancer Res Treat. 2009;113(2):357–70. 18324472 10.1007/s10549-008-9926-3 99. Sørlie T Molecular portraits of breast cancer: tumour subtypes as distinct disease entities Eur J Cancer 2004 40 18 2667 75 10.1016/j.ejca.2004.08.021 15571950 Sørlie T. Molecular portraits of breast cancer: tumour subtypes as distinct disease entities. Eur J Cancer. 2004;40(18):2667–75. 15571950 10.1016/j.ejca.2004.08.021 100. Yehiely F Moyano JV Evans JR Nielsen TO Cryns VL Deconstructing the molecular portrait of basal-like breast cancer Trends Mol Med 2006 12 11 537 44 10.1016/j.molmed.2006.09.004 17011236 Yehiely F, Moyano JV, Evans JR, Nielsen TO, Cryns VL. Deconstructing the molecular portrait of basal-like breast cancer. Trends Mol Med. 2006;12(11):537–44. 17011236 10.1016/j.molmed.2006.09.004 101. Rakha EA El-Rehim DA Paish C Green AR Lee AH Robertson JF Blamey RW Macmillan D Ellis IO Basal phenotype identifies a poor prognostic subgroup of breast cancer of clinical importance Eur J Cancer 2006 42 18 3149 56 10.1016/j.ejca.2006.08.015 17055256 Rakha EA, El-Rehim DA, Paish C, Green AR, Lee AH, Robertson JF, et al. Basal phenotype identifies a poor prognostic subgroup of breast cancer of clinical importance. Eur J Cancer. 2006;42(18):3149–56. 17055256 10.1016/j.ejca.2006.08.015 102. Foulkes WD Brunet JS Stefansson IM Straume O Chappuis PO Bégin LR Hamel N Goffin JR Wong N Trudel M The prognostic implication of the basal-like (cyclin E high/p27 low/p53+/glomeruloid-microvascular-proliferation+) phenotype of BRCA1-related breast cancer Cancer Res 2004 64 3 830 5 10.1158/0008-5472.CAN-03-2970 14871808 Foulkes WD, Brunet JS, Stefansson IM, Straume O, Chappuis PO, Bégin LR, et al. The prognostic implication of the basal-like (cyclin E high/p27 low/p53+/glomeruloid-microvascular-proliferation+) phenotype of BRCA1-related breast cancer. Cancer Res. 2004;64(3):830–5. 14871808 10.1158/0008-5472.can-03-2970 103. Azim HA Jr. Michiels S Bedard PL Singhal SK Criscitiello C Ignatiadis M Haibe-Kains B Piccart MJ Sotiriou C Loi S Elucidating prognosis and biology of breast cancer arising in young women using gene expression profiling Clin Cancer Res 2012 18 5 1341 51 10.1158/1078-0432.CCR-11-2599 22261811 Azim HA Jr., Michiels S, Bedard PL, Singhal SK, Criscitiello C, Ignatiadis M, et al. Elucidating prognosis and biology of breast cancer arising in young women using gene expression profiling. Clin Cancer Res. 2012;18(5):1341–51. 22261811 10.1158/1078-0432.CCR-11-2599 104. Partridge AH Hughes ME Warner ET Ottesen RA Wong YN Edge SB Theriault RL Blayney DW Niland JC Winer EP Subtype-dependent relationship between young age at diagnosis and breast cancer survival J Clin Oncol 2016 34 27 3308 14 10.1200/JCO.2015.65.8013 27480155 Partridge AH, Hughes ME, Warner ET, Ottesen RA, Wong YN, Edge SB, et al. Subtype-dependent relationship between young age at diagnosis and breast cancer survival. J Clin Oncol. 2016;34(27):3308–14. 27480155 10.1200/JCO.2015.65.8013 105. Saha P Regan MM Pagani O Francis PA Walley BA Ribi K Bernhard J Luo W Gómez HL Burstein HJ Treatment efficacy, adherence, and quality of life among women younger than 35 years in the international breast cancer study group TEXT and SOFT adjuvant endocrine therapy trials J Clin Oncol 2017 35 27 3113 22 10.1200/JCO.2016.72.0946 28654365 PMC5597253 Saha P, Regan MM, Pagani O, Francis PA, Walley BA, Ribi K, et al. Treatment efficacy, adherence, and quality of life among women younger than 35 years in the international breast cancer study group TEXT and SOFT adjuvant endocrine therapy trials. J Clin Oncol. 2017;35(27):3113–22. 28654365 10.1200/JCO.2016.72.0946 PMC5597253 106. Pagani O Francis PA Fleming GF Walley BA Viale G Colleoni M Láng I Gómez HL Tondini C Pinotti G Absolute improvements in freedom from distant recurrence to tailor adjuvant endocrine therapies for premenopausal women: results from TEXT and SOFT J Clin Oncol 2020 38 12 1293 303 10.1200/JCO.18.01967 31618131 PMC7164485 Pagani O, Francis PA, Fleming GF, Walley BA, Viale G, Colleoni M, et al. Absolute improvements in freedom from distant recurrence to tailor adjuvant endocrine therapies for premenopausal women: results from TEXT and SOFT. J Clin Oncol. 2020;38(12):1293–303. 31618131 10.1200/JCO.18.01967 PMC7164485 107. Menarche menopause, and breast cancer risk: individual participant meta-analysis, including 118 964 women with breast cancer from 117 epidemiological studies Lancet Oncol 2012 13 11 1141 51 10.1016/S1470-2045(12)70425-4 23084519 PMC3488186 Menarche. menopause, and breast cancer risk: individual participant meta-analysis, including 118 964 women with breast cancer from 117 epidemiological studies. Lancet Oncol. 2012;13(11):1141–51. 23084519 10.1016/S1470-2045(12)70425-4 PMC3488186 108. Beral V Reeves G Bull D Green J Breast cancer risk in relation to the interval between menopause and starting hormone therapy J Natl Cancer Inst 2011 103 4 296 305 10.1093/jnci/djq527 21278356 PMC3039726 Beral V, Reeves G, Bull D, Green J. Breast cancer risk in relation to the interval between menopause and starting hormone therapy. J Natl Cancer Inst. 2011;103(4):296–305. 21278356 10.1093/jnci/djq527 PMC3039726 109. Reeves GK Beral V Green J Gathani T Bull D Hormonal therapy for menopause and breast-cancer risk by histological type: a cohort study and meta-analysis Lancet Oncol 2006 7 11 910 8 10.1016/S1470-2045(06)70911-1 17081916 Reeves GK, Beral V, Green J, Gathani T, Bull D. Hormonal therapy for menopause and breast-cancer risk by histological type: a cohort study and meta-analysis. Lancet Oncol. 2006;7(11):910–8. 17081916 10.1016/S1470-2045(06)70911-1 110. Arecco L Bruzzone M Bas R Kim HJ Di Meglio A Bernstein-Molho R Hilbers FS Pogoda K Carrasco E Punie K Impact of hormone receptor status and tumor subtypes of breast cancer in young BRCA carriers Ann Oncol 2024 35 9 792 804 10.1016/j.annonc.2024.06.009 38908482 Arecco L, Bruzzone M, Bas R, Kim HJ, Di Meglio A, Bernstein-Molho R, et al. Impact of hormone receptor status and tumor subtypes of breast cancer in young BRCA carriers. Ann Oncol. 2024;35(9):792–804. 38908482 10.1016/j.annonc.2024.06.009 111. Kamaraju S, Fowler AM, Weil E, Wisinski KB, Truong TH, Lehr M, Chaudhary LN, Cheng YC, Chitambar CR, Rui H et al. Leveraging antiprogestins in the treatment of metastatic breast cancer. Endocrinology 2021, 162(8). 10.1210/endocr/bqab060 33735382 112. Luen SJ Asher R Lee CK Savas P Kammler R Dell’Orto P Biasi OM Demanse D JeBailey L Dolan S Association of somatic driver alterations with prognosis in postmenopausal, hormone receptor-positive, HER2-negative early breast cancer: a secondary analysis of the BIG 1–98 randomized clinical trial JAMA Oncol 2018 4 10 1335 43 10.1001/jamaoncol.2018.1778 29902286 PMC6233777 Luen SJ, Asher R, Lee CK, Savas P, Kammler R, Dell’Orto P, et al. Association of somatic driver alterations with prognosis in postmenopausal, hormone receptor-positive, HER2-negative early breast cancer: a secondary analysis of the BIG 1–98 randomized clinical trial. JAMA Oncol. 2018;4(10):1335–43. 29902286 10.1001/jamaoncol.2018.1778 PMC6233777 113. Meric-Bernstam F, Zheng X, Shariati M, Damodaran S, Wathoo C, Brusco L, Demirhan ME, Tapia C, Eterovic AK, Basho RK et al. Survival Outcomes by TP53 Mutation Status in Metastatic Breast Cancer. JCO Precis Oncol 10.1200/PO.17.00245 PMC6050977 30035249 114. Basho RK, de Melo Gagliato D, Ueno NT, Wathoo C, Chen H, Shariati M, Wei C, Alvarez RH, Moulder SL, Sahin AA, Roy-Chowdhuri S, Chavez-MacGregor M, Litton JK, Valero V, Luthra R, Zeng J, Shaw KR, Mendelsohn J, Mills GB, Tripathy D, Meric-Bernstam F. Clinical outcomes based on multigene profiling in metastatic breast cancer patients. Oncotarget. 2016;7(47):76362–73. 10.18632/oncotarget.12987 PMC5363515 27806348 115. Loo LWM Gao C Shvetsov YB Okoro DR Hernandez BY Bargonetti J MDM2, MDM2-C, and mutant p53 expression influence breast cancer survival in a multiethnic population Breast Cancer Res Treat 2019 174 1 257 69 10.1007/s10549-018-5065-7 30470976 PMC6530987 Loo LWM, Gao C, Shvetsov YB, Okoro DR, Hernandez BY, Bargonetti J. MDM2, MDM2-C, and mutant p53 expression influence breast cancer survival in a multiethnic population. Breast Cancer Res Treat. 2019;174(1):257–69. 30470976 10.1007/s10549-018-5065-7 PMC6530987 ",
  "metadata": {
    "Title of this paper": "MDM2, MDM2-C, and mutant p53 expression influence breast cancer survival in a multiethnic population",
    "Journal it was published in:": "World Journal of Surgical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490167/"
  }
}