{
  "title": "Paper_681",
  "abstract": "pmc Int J Surg Case Rep Int J Surg Case Rep 1424 ijscr International Journal of Surgery Case Reports 2210-2612 Elsevier PMC12475567 PMC12475567.1 12475567 12475567 40961888 10.1016/j.ijscr.2025.111939 S2210-2612(25)01125-3 111939 1 Case Report Occult MALT lymphoma masquerading as benign cysts in Sjögren's syndrome: A case report of diagnostic dilemma Alkheder Ahmad alkhederahmed@gmail.com a b ⁎ Azar Adel a b Mustafa Ahmad a b a b ⁎ alkhederahmed@gmail.com 10 2025 15 9 2025 135 495720 111939 2 7 2025 3 9 2025 13 9 2025 15 09 2025 28 09 2025 29 09 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Introduction Sjögren's syndrome (SS) significantly elevates the risk of salivary gland lymphoma, primarily mucosa-associated lymphoid tissue (MALT) type, arising within chronic lymphoepithelial sialadenitis (LESA). Benign lymphoepithelial cysts (BLECs), common in SS, can radiologically mimic malignancy, posing diagnostic challenges when occult lymphoma develops. Case presentation A 53-year-old woman with established SS developed progressive bilateral parotid enlargement over years. Initial ultrasonography and CT imaging revealed bilateral septated cysts, ductal calculi, and heterogeneous gland architecture, interpreted as benign inflammatory disease or sialolithiasis. Subtotal parotidectomy performed for cosmetic concerns on the larger side yielded histopathology confirming MALT lymphoma arising within LESA and BLECs. Discussion This case underscores the diagnostic dilemma of cystic parotid lesions in SS, where benign-appearing BLECs can harbor or be adjacent to occult MALT lymphoma. The malignant transformation highlights the inherent risk within chronic LESA. Imaging features of BLECs and cystic lymphoma often overlap; key discriminators like restricted diffusion on MRI warrant attention. Fine-needle aspiration has limitations, necessitating histopathological evaluation of tissue for definitive diagnosis, especially with persistent gland enlargement. Conclusion Persistent or progressive parotid enlargement in SS, even with cystic features suggestive of benign disease, necessitates a high index of suspicion for occult lymphoma. Histopathological verification remains paramount for accurate diagnosis and timely intervention, emphasizing the critical need for integrated clinical, radiological, and pathological assessment in these high-risk patients. Highlights • SS-associated MALT lymphoma can lurk within seemingly benign parotid cysts (BLECs), easily misleading initial imaging like US/CT. • Only removal of the tissue and histopathology reliably diagnoses occult lymphoma; FNA often misses monoclonality in cystic SS lesions. • SS patients face a 13.76-fold lifetime salivary lymphoma risk. Persistent gland swelling demands suspicion, even with \"benign\" imaging. • Chronic lymphoepithelial sialadenitis (LESA) in SS harbors significant malignant potential, evolving into MALT lymphoma within cystic structures. • Managing cystic parotid lesions in SS requires combining clinical suspicion, advanced MRI (DWI/ADC), and definitive histopathology to catch transformation. Keywords Sjögren's syndrome MALT lymphoma Parotid cysts Lymphoepithelial sialadenitis Occult malignancy Benign lymphoepithelial cysts pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Sjögren's syndrome (SS) is a chronic autoimmune disorder characterized by lymphocytic infiltration of exocrine glands, leading to xerostomia and keratoconjunctivitis sicca [ 1 1 1 [1] [2] [3] 4 5 4 5 2 4 6 1 4 7 Here, we present a case of SS-associated MALT lymphoma arising in bilateral parotid BLECs, initially managed as benign cystic disease. This case underscores the diagnostic complexity of cystic parotid lesions in SS, highlights the malignant potential of LESA, and reinforces the necessity for histopathological vigilance in patients with progressive glandular enlargement. 2 Methods This work is also reported in line with SCARE criteria which helped to improve the transparency and quality of this case report [ 8 3 Case presentation A 53-year-old woman presented seven years ago with symptoms of arthritis, dry eyes, and dry mouth, consistent with Sjögren's syndrome. Initially, she was managed with daily Prednisolone 5 mg and hydroxychloroquine 200 mg. She has no history of smoking or alcohol consumption. Over time, she developed gradual bilateral swelling of the parotid glands ( Fig. 1 Fig. 2 Fig. 3 Fig. 1 Bilateral parotid gland swelling. Fig. 1 Fig. 2 A contrast-enhanced CT scan demonstrated multiple cysts of varying sizes within the parotid glands. Fig. 2 Fig. 3 The salivary gland tissue is almost completely obscured by diffuse small lymphocytic infiltrate with focal germinal centers. Although the overall lobular architecture is still preserved, the lymphoid infiltrate focally overruns epithelial nests with monocytoid features. CD20 shows diffuse positivity on lymphoid cells, almost exclusively, also highlighting prominent intraepithelial lymphocytes. Fig. 3 4 Discussion This case of Sjögren's syndrome ( SS 1 1 4 5 2 4 6 1 4 3 5 9 3 6 2 10 The pathogenesis involves chronic antigenic stimulation driving B-cell proliferation in SS, with eventual clonal expansion and genetic aberrations (e.g., trisomy 3, t(11;18)) culminating in MALT lymphoma [ 1 2 7 3 6 1 4 3 6 2 7 3 This case exemplifies the distinct predilection of SS-associated lymphomagenesis for MALT histotype, as non-MALT subtypes show negligible association with SS (0 % prevalence in meta-analysis) [ 1 3 6 1 4 1 3 Cystic parotid lesions in SS represent a continuum from benign LESA to overt lymphoma. This case exemplifies the imperative for rigorous, longitudinal evaluation of such patients, integrating clinical, radiological, and pathological insights to intercept malignant transformation early. 5 Conclusion This case of bilateral MALT lymphoma arising within parotid BLECs in a Sjögren's syndrome patient underscores the significant diagnostic challenge posed by cystic parotid lesions in this autoimmune context. It vividly illustrates the inherent malignant potential of chronic lymphoepithelial sialadenitis (LESA) and the critical limitations of relying solely on imaging findings suggestive of benign disease. Persistent or progressive glandular enlargement in SS, even with cystic features initially managed as benign, demands a high index of suspicion for occult lymphoma. Histopathological evaluation of excised tissue remains the indispensable gold standard for definitive diagnosis and timely intervention, emphasizing the need for vigilant, integrated clinical-radiological-pathological assessment in these high-risk patients to intercept malignant transformation. Author contribution Ahmad Alkheder and Adel Azar Ahmad Mustafa Ethical approval Ethics clearance was not necessary since the University waives ethics approval for publication of case reports involving no patients' images, and the case report is not containing any personal information. The ethical approval is obligatory for research that involve human or animal experiments. Guarantor Ahmad Alkheder. Research registration number This case report is not a first time of reporting, new device or surgical technique. So I would not need a Research Registry Unique identifying number (UIN). Provenance and peer review Not commissioned, externally peer-reviewed. Funding This research did not receive any specific grant from funding agencies in the public, commercial, or not-for-profit sectors. Consent of patient Written informed consent was obtained from the patient for publication of this case report and accompanying images. A copy of the written consent is available for review by the Editor-in-Chief of this journal on request. Conflict of interest statement The authors disclose no conflicts. References 1 Travaglino A. Giordano C. Pace M. Sjögren syndrome in primary salivary gland lymphoma Am. J. Clin. Pathol. 153 6 2020 719 724 10.1093/ajcp/aqaa005 32076706 2 Lin J.S. Liu C.J. Mucosa-associated lymphoid tissue lymphoma at the parotid gland J. Cancer Res. Ther. 20 1 2024 467 468 10.4103/jcrt.jcrt_1909_22 38554366 3 Povlow M.R. Streiff M. Madireddi S. Jaramillo C. A primary parotid mucosa-associated lymphoid tissue non-Hodgkin lymphoma in a patient with Sjogren syndrome Cureus 13 6 2021 e15679 10.7759/cureus.15679 (Published 2021 Jun 16) PMC8281787 34277270 4 Plaza G. Domínguez M.P. Bueno A. Bilateral parotid cysts as presentation of Sjögren’s syndrome J. Laryngol. Otol. 117 2 2003 151 152 10.1258/002221503762624675 12625896 5 Liao Y. Li Y.J. Hu X.W. Wen R. Wang P. Benign lymphoepithelial cyst of parotid gland without human immunodeficiency virus infection: a case report World J. Clin. Cases 11 4 2023 931 937 10.12998/wjcc.v11.i4.931 36818610 PMC9928695 6 Muntean D. Dudea S. Lenghel M. Solomon C. Iuga T. Rotar H. Mucosa-associated lymphoid tissue lymphoma of the parotid gland – a case report Med. Ultrason. 23 3 2021 364 366 10.11152/mu-2957 33945592 7 Gorodetskiy V.R. Probatova N.A. Konovalov D.M. Composite Epstein-Barr virus-positive mucosa-associated lymphoid tissue lymphoma and Epstein-Barr virus-negative diffuse large B-cell lymphoma in the parotid salivary gland of a patient with Sjögren’s syndrome and rheumatoid arthritis: a case report J. Med. Case Rep. 14 1 2020 12 10.1186/s13256-019-2331-1 (Published 2020 Jan 17) 31948469 PMC6966905 8 Kerwan A. Al-Jabir A. Mathew G. Sohrabi C. Rashid R. Franchi T. Nicola M. Agha M. Agha R.A. Revised Surgical CAse REport (SCARE) guideline: an update for the age of Artificial Intelligence Prem. J. Sci. 10 2025 100079 9 Pillai S. Agarwal A.C. Mangalore A.B. Ramaswamy B. Shetty S. Benign lymphoepithelial cyst of the parotid in HIV negative patient J. Clin. Diagn. Res. 10 4 2016 MD05 MD06 10.7860/JCDR/2016/17915.7609 27190845 PMC4866143 10 Erkan A.N. Cağici C.A. Aka-Bolat F. Ozlüoğlu L.N. A case of mucosa-associated lymphoid tissue lymphoma of the parotid gland Kulak Burun Bogaz Ihtis. Derg. 14 3–4 2005 87 91 16227731 Data availability All data are available from the corresponding author on reasonable request. The case has not been presented at a conference or regional meeting. ",
  "metadata": {
    "Title of this paper": "A case of mucosa-associated lymphoid tissue lymphoma of the parotid gland",
    "Journal it was published in:": "International Journal of Surgery Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475567/"
  }
}