{
  "title": "Paper_1010",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469896 PMC12469896.1 12469896 12469896 41009496 10.3390/ijms26188928 ijms-26-08928 1 Review Immunonutrition: Another Player on the MASLD Field López-Méndez Iván 1 * https://orcid.org/0000-0002-6514-7869 Uribe Misael 2 Juárez-Hernández Eva 3 * Guerrero-Romero Fernando Academic Editor 1 2 muribe@medicasur.org.mx 3 * ylopezm@medicasur.org.mx ejuarezh@medicasur.org.mx 13 9 2025 9 2025 26 18 497349 8928 31 7 2025 08 9 2025 12 9 2025 13 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Immunonutrition is a nutritional strategy where the bioactive properties of nutrients from the diet are used to modulate metabolic pathways, inflammation signals, and oxidative stress regulators. Metabolic dysfunction-associated steatotic liver disease (MASLD) is a chronic degenerative disease with increasing prevalence over the past decade. In MASLD, where inflammation and oxidative stress play key roles in the progression of liver disease, immunonutrition becomes even more important. The impact of different dietary patterns has been studied in the MASLD context; however, current guidelines emphasize the Mediterranean Diet, which, in terms of included food groups, provides a high level of immunonutrients. Nonetheless, adherence, monitoring, and implementation based on geographic areas, availability, and economic factors make this type of diet ultimately less accessible. The main benefit of the diet pattern is in maintaining the positive effects of new pharmacological treatments, alongside physical activity, which are crucial to prevent recurrence. A diet strategy designed for MASLD needs to be adapted to local food availability and should promote the inclusion of immunonutrients. In the treatment of MASLD, dietary recommendations should be individualized based on the sociodemographic, clinical, and nutritional characteristics of the patients. inflammation oxidative stress liver steatosis nutrition This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Immunonutrition is a nutritional strategy in which the bioactive properties of nutrients obtained from the diet are used for the prevention and treatment of conditions characterized by infection, inflammation, or tissue damage [ 1 2 Chronic degenerative diseases, primarily associated with metabolic disorders, are currently the most prevalent and the leading causes of mortality worldwide. In their pathophysiology, all of them involve the activation of inflammatory processes, oxidative stress, and tissue damage [ 3 4 5 6 The synthesis and metabolism of nutrients, mainly in the liver, are an important factor in the immune system’s response capacity. Therefore, the presence of liver damage may represent an immunological limitation against inflammatory mechanisms [ 7 8 Table 1 Although several pharmacological treatments have demonstrated efficacy in MASLD, lifestyle modification remains the cornerstone of treatment; in this setting, the addition of immunonutrition could be beneficial in reducing the inflammatory activity of the disease [ 1 2. Background The benefits of immunonutrition as an additional therapeutic strategy have been demonstrated in various clinical settings, including oncological and surgical processes, trauma, and critical illness, with an impact on important outcomes such as reduced hospital stays, days on mechanical ventilation, reduced inflammation, a lower risk of infection, and improved cicatrization [ 9 10 11 p 12 Currently, MASLD is the most common cause of liver disease [ 13 5 14 15 MASLD is a metabolic disease with a complex physiopathology that begins with cytoplasmic hepatic fat accumulation (triglycerides) and IR, leading to lipotoxicity and the stimulation of de novo fatty acid synthesis by excess carbohydrates. Subsequently, endoplasmic reticulum stress, the production of reactive oxygen species (ROS), oxidative stress, and organelle dysfunction cause liver injury, which progresses to steatohepatitis. In the presence of overweight or obesity, the release of inflammatory mediators contributes to hepatocyte damage, leading to ballooning, activation of hepatic stellate cells (HSC) (also associated with IR), and sinusoidal collagen deposition, which results in fibrosis—the next stage in the progression of MASLD [ 16 In MASLD development pathways, the dysregulation of AMP-activated protein kinase (AMPK), mechanistic target of rapamycin (mTOR), and Sirtuin 1 (SIRT1) plays an important role due to their functions in glucose and lipid metabolism, lipid and protein synthesis, inflammation, and autophagy. Hence, some therapeutic options for MASLD involve targeting the signaling of these proteins. AMPK phosphorylates sterol regulatory element-binding protein 1c (SREBP1c), which is associated with the regulation of lipid, insulin, and glucose metabolism. This phosphorylation has a direct effect on reducing hepatic steatosis and diet-induced IR, as well as decreasing the expression of fatty acid synthase and inhibiting lipid synthesis. On the other hand, AMPK is associated with negative feedback to mTORC1, which also activates SREBP with effects on hepatic lipogenesis. The improvement in AMPK signaling has been associated with the suppression of proinflammatory cytokines, specifically TNF-α, IL-1β, and IL-6, through the activation of SIRT1, a protein that regulates inflammation and DNA repair. Proper AMPK signaling is crucial for suppressing inflammation, inhibiting hepatic stellate cell activation, and improving liver injury by regulating mitochondrial function and cell death pathways [ 17 18 Immunonutrition principles indicate that it could have a beneficial effect on the different pathophysiological characteristics of MASLD: (1) oxidative stress generated by a sedentary lifestyle and deficient diets in quality and quantity, (2) the inflammatory process secondary to damage induced in the hepatocyte, and (3) tissue damage produced by the generation of free radicals and the production of proinflammatory cytokines that leads to fibrosis and cirrhosis development [ 19 Taking these pathophysiological mechanisms into account, immunonutrients have specific effects on the activation or inhibition of the immune system through the acceleration of T cell-mediated immunity, modifying the body’s response to inflammation by mediating the production of proinflammatory cytokines, maintaining the intestinal barrier function through the activation of gut-associated lymphoid tissue, and improving the antioxidant status, with antioxidant vitamins, specific amino acids, polyphenols, and fatty acids being the main immunonutrients involved [ 20 21 As mentioned, the pathophysiology of MASLD involves various mechanisms, which make the search and development of therapeutic options difficult in a context with multiple altered and interconnected pathways. While the efficacy of therapies for MASLD is based on histopathological outcomes related to the resolution of progression to steatohepatitis and fibrosis, the clinical and epidemiological context of this liver disease requires that other factors be considered as therapeutic targets. The effect of nutritional strategies is mostly evaluated through modifications in serum lipid levels, protein expression, and changes in liver function tests, which are useful as biomarkers of liver damage with good utility in clinical practice to evaluate the severity, progression, and response to treatment in MASLD [ 22 Nowadays, several immunonutrients have been shown to have beneficial effects in various clinical settings; however, in other clinical scenarios, such as MASLD, the evidence regarding the beneficial effects of immunonutrients decreases. In this review, we present evidence of those immunonutrients that have been associated with beneficial effects in different outcomes of MASLD. In this metabolic–hepatic disease, where inflammation and oxidative stress are determining factors for the progression of liver disease, the functions of immunonutrition with respect to inflammation and its antioxidant effect become more important; immunonutrients such as ω-3 fatty acids and vitamins E, C, and D are involved in decreasing the production of proinflammatory cytokines, while amino acids and polyphenols have been associated with antioxidant properties; on the other hand, zinc (Zn) is an immunonutrient with the ability to modulate different pathological pathways in the development or progression of MASLD [ 23 Figure 1 3. Immunonutrients in MASLD 3.1. Amino Acids 3.1.1. Cysteine Cysteine is a conditionally essential amino acid synthesized from the metabolism of methionine through transsulfurization, which promotes the production of glutathione. Cysteine is used for protein synthesis and can be converted into taurine, glutathione, and hydrogen sulfide. In addition to being synthesized from methionine, cysteine can be obtained in the diet through the intake of meat, eggs, and whole grains [ 24 Cysteine interacts with glycols to form glycoproteins, such as secretory acidic protein rich in cysteine (SPARC), an extracellular matrix glycoprotein expressed in adipose, liver, muscle, and pancreatic tissue. Studies in murine models have shown that SPARC contributes to adipose tissue formation and cell differentiation, in addition to modulating the function of cell adhesion molecules at the endothelial level, remodeling the extracellular matrix [ 25 26 Regarding the role of cysteine in the liver, SPARC is expressed and secreted by HSC and hepatic endothelial cells in response to tissue damage. Upon activation, HSC differentiate into myofibroblast-like cells and express collagen 1-alpha production [ 27 28 This process is key in the development of liver fibrosis due to MASLD. Furthermore, it has been shown to contribute to inflammation, which, in conjunction with lipid accumulation, induces tissue oxidative stress that leads to lipid peroxidation. Several studies, mainly in murine models, have demonstrated the role of SPARCs in the formation of adipose tissue in diabetes and SLD. Therefore, they have been proposed as a therapeutic target and a biomarker in the progression of diseases related to the accumulation of adipose tissue, with alterations in muscle metabolism [ 29 Cysteine inhibition appears to be related to glucose disturbances and the development of MASLD; Tran et al. [ 30 In its pharmacological form, cysteine is presented as N-acetylcysteine (NAC), which is approved for the treatment of respiratory conditions involving mucous secretions, prevention of nephropathy, and acute liver failure caused by toxic doses of acetaminophen, due to its hepatoprotective effect [ 31 32 p p p 33 The antioxidant effect of cysteine in patients with MASLD requires further evidence to be recommended as an additional treatment option. 3.1.2. Arginine Arginine is an amino acid synthesized by the urea cycle in the liver, which functions in protein synthesis and the generation of polyamines and creatine to maintain cellular homeostasis. Arginine stimulates nitric oxide synthesis and growth hormone production, with an anabolic effect [ 34 35 36 Through cellular redox regulation, arginine prevents the oxidative stress that is characteristic of MASLD development [ 37 38 Since its main sources are animal products, a deficiency in protein intake, and therefore arginine deficiency, has been associated with triglyceride accumulation in the liver. In a mouse model, Otani et al. [ 39 In a study with a murine model, in which steatohepatitis was developed by intravenous administration of 20% lipids for 3 weeks and were pre- and post-treated with arginine injection for 2 weeks, it was shown that the administration of arginine significantly decreased the levels of lipid peroxidation and the enzyme CYP2EI (0.32 ± 0.01 vs. 0.3 ± 0.02 IU/mg), markers of oxidative stress, indicating that arginine reduces it. Arginine supplementation also showed a significant increase in nitric oxide levels (1.649 ± 0.047 vs. 1.957 ± 0.073 μmol/g) and in endothelial nitric oxide activity at the hepatic level (0.05 ± 0.002 vs. 0.056 ± 0.002 IU/mg), as well as a significant decrease in TNF-α levels, both at the blood level (4.5 ± 0.08 vs. 4.12 ± 0.13) and at the hepatic level (13.1 ± 0.6 vs. 11.9 ± 0.5), decreasing inflammation [ 40 3.1.3. Glutamine Glutamine is the most abundant amino acid in the human body, accounting for approximately 60% of the total protein. Therefore, it plays an important role in maintaining and promoting various physiological functions such as protein synthesis, immune system activation, and mucosal protection. Therefore, its concentration has been associated with the pathophysiology of various chronic diseases [ 41 42 43 44 Due to glutamine’s role in maintaining mitochondrial metabolism and cell proliferation, alterations in its metabolism, produced by the progression of inflammatory diseases and metabolic stress, such as those occurring in chronic liver disease, have been associated with changes in cell cycles. Specifically in the liver, increased glutaminolysis, with the consequent conversion of glutamine to glutaminase and glutathione, has been associated with the proliferation and activation of HSCs. Therefore, glutamine metabolism regulation has been proposed as a therapeutic target for the presence and progression of liver fibrosis. However, these proposals arise from studies in cell lines and mouse models of liver fibrosis. More evidence is needed to determine the effect and mechanisms of glutamine modulation across the spectrum of liver disease [ 43 45 46 47 Glutamine has been described as a protective factor against liver diseases, such as alcoholic liver disease and MASLD. This is due to its protective effect against oxidative stress and the reduction in proinflammatory cytokines production. Glutamine helps maintain adequate glutathione levels, which allows hepatocytes to combat oxidative stress and eliminate toxins [ 48 In a study with rats with High-Fat Diet (HFD)-induced MASLD, glutamine (1 g/kg) was administered, oxidative stress levels were measured over different periods, and the regulatory effect of glutamine on oxidative stress due to MASLD was analyzed. It was found that high levels of oxidative stress and inflammation were reduced with dietary glutamine supplementation, thanks to the inhibition it causes in the proinflammatory gene transcription pathway NF-Κb [ 49 MASLD patients present a persistent chronic inflammatory process that generates activation of the innate immune system, releasing inflammatory mediators such as TNF-α and increasing mRNA expression [ 50 49 Despite these positive results, it is important to consider that they are based on murine models, so it is necessary to evaluate the effect of glutamine supplementation in patients with MASLD. 3.1.4. Branched-Chain Amino Acids Branched-chain amino acids (BCAAs) are leucine, isoleucine, and valine. They are essential amino acids, so they must be obtained from the diet. The primary sources of these amino acids are animal products, primarily including meat, fish, dairy, and eggs. BCAAs are necessary for protein synthesis and maintaining energy balance, as well as various metabolic processes, including the regulation of lipids and glucose [ 51 52 Specifically, leucine activates the mTORC1 complex, which regulates cell growth and metabolism [ 53 54 55 In the metabolism of BCAAs, there are different interactions with the oxidation of fatty acids and de novo lipogenesis at the hepatic level [ 56 53 In a study with steatohepatitis mice induced by a choline-deficient HFD, the effect of BCAAs supplementation was evaluated after 8 weeks. Honda et al. [ 54 p p Regarding the antioxidant functions of BCAAs, in a murine model, Surugihalli et al. [ 56 Although the benefit of BCAA supplementation has sufficient evidence in end-stage liver disease, despite its relationship with protein synthesis and lipid metabolism, in the context of MASLD, more evidence is still needed to support BCAA supplementation as an adjuvant in the treatment. 3.2. Polyphenols Polyphenols are non-energetic organic compounds, characteristic of plants, with a molecular structure defined by the presence of phenolic units or rings. Polyphenols are grouped into two main classes: (1) flavonoids, including isoflavones, quercetins, cyanidins, and catechins, and (2) phenolic acids, which include caffeic acid and ferulic acid [ 57 58 59 The antioxidant effect of polyphenols has been demonstrated in chronic degenerative diseases such as diabetes and obesity. Flavonoids such as anthocyanins, flavonols, and flavanols act by increasing aerobic lipid metabolism and mitochondrial bioenergetics [ 60 61 One of the polyphenols with the most significant evidence of beneficial effects on inflammatory diseases in the last decade is curcumin. It is a polyphenolic compound found in the plant Curcuma longa, known as turmeric. It has been studied for its anti-inflammatory and antioxidant properties and for its potential anticancer effects [ 62 63 64 65 66 The main dietary source of polyphenols is the consumption of foods characteristic of the Mediterranean diet (MedDiet), such as plants, fruits, chocolate, legumes, turmeric, and beverages such as green tea and wine [ 58 67 Catechins, polyphenols characteristic of green tea, have been shown to have therapeutic effects in patients with diabetes mellitus and metabolic syndrome through the regulation of glucose and lipid metabolism, improving glucose synthesis and inhibiting lipogenesis in hepatocytes. In addition, they mobilize and activate endogenous antioxidant mechanisms, improving the activity of enzymes such as superoxide dismutase, decreasing lipid peroxide levels in the plasma and, therefore, detoxifying the liver during metabolism [ 68 Epigallocatechin-3-gallate (EGCG) is the most active compound in green tea, so its therapeutic effect has been studied in different MASLD outcomes. In a liver cell line, Wu et al. [ 69 p p p 70 Curcumin has been a substance of interest in various MASLD studies since its antioxidant and anti-inflammatory properties have proposed it as a possible therapeutic strategy [ 71 72 A randomized clinical trial of 80 patients with MASLD reported that supplementation with 500 mg of curcumin for 24 weeks significantly reduced the degree of hepatic steatosis, assessed by transient elastography, compared to the placebo group and other parameters such as body weight by 2.6 kg (95% CI: −4.4 to −0.8 kg; p 2 2 p p p p p p 73 A meta-analysis of 16 randomized clinical trials evaluating different curcumin formulations showed that curcumin improved serum liver enzyme levels (AST) by an average of −3.90 U/L (95% CI: −5.97, −1.82) and ALT by an average of −5.61 U/L (95% CI: −9.37, −1.85), and reduced fasting glucose, total cholesterol, and body mass index. Regarding histological outcomes, curcumin supplementation showed resolution of steatosis (RR 3.53 (95% CI: 2.01, 6.22)) as well as a reduction in steatosis severity (RR 3.41 (95% CI: 1.36, 8.56)). While these results support the beneficial effect of curcumin supplementation in MASLD, it is important to note that this meta-analysis focuses on a single geographic region (Iran and Thailand) [ 66 Based on the results of preclinical and clinical studies, polyphenols may have therapeutic effects in MASLD, with the advantage of their availability in the diet; however, the most effective polyphenols in preventing MASLD, as well as the specific molecular mechanisms through which they act, are currently unknown. 3.3. Vitamins 3.3.1. Vitamin C Vitamin C is a fat-soluble vitamin known for its potential antioxidant effects, as well as for its role as a cofactor that scavenges free radicals and protects the body from tissue damage and oxidative stress [ 74 75 76 In MASLD, evidence on the role of vitamin C is limited, with most studies in murine models; however, it has been suggested that, due to its antioxidant effect and its role in enzymatic reactions, vitamin C is involved in lipid regulation in the liver [ 77 In mice induced with MASLD using a high-fructose diet and HFD and administered a megadose of vitamin C for 11 weeks (1.5 g/L), disease progression, inflammation, and triglyceride levels were measured. Histological changes, such as less lobular inflammation and fat accumulation, as well as a reduction in the accumulation of triglycerides and free fatty acids in the liver, were observed. Neutrophil infiltration and the expression of proinflammatory genes (IL-1β, IL-6) were also decreased, thereby reducing inflammation. It was concluded that vitamin C supplementation of 1000 mg/day may be a treatment option worth evaluating in clinical trials to prevent disease progression [ 78 Currently, studies confirming the effect of vitamin C in human patients with MASLD are limited; however, a randomized, double-blind clinical trial conducted in China evaluated the effect of vitamin C supplementation for 12 weeks in patients diagnosed with MASLD divided into three groups: low dose (250 mg), medium dose (1000 mg), and high dose (2000 mg). Medium supplementation was shown to decrease ALT levels [mean, −8.00 (−18.00, −1.75) vs. high, −3.50 (−13.75, 4.25), p p p p 79 Although there is evidence confirming the anti-inflammatory effect and improvement of metabolic markers of vitamin C supplementation, it is still insufficient to make a therapeutic recommendation for patients with MASLD. 3.3.2. Vitamin E Vitamin E is a fat-soluble vitamin located primarily in the cell membrane, where it exerts its primary antioxidant effect. It is the first defense against lipid peroxidation, protecting membranes from the action of free radicals, which is why it is considered the ultimate antioxidant. Vitamin E groups together various compounds, including tocopherols and tocotrienols [ 80 81 In MASLD, vitamin E improves lipotoxicity by suppressing lipid accumulation and peroxidation, with effects on inflammation and IR by inhibiting the activation of M1-like macrophages/KCs. Vitamin E has also been shown to decrease HSC activation [ 82 83 Among the immunonutrients, vitamin E has the most significant evidence of a beneficial effect in MASLD treatment. The PIVENS study [ 84 p p p p p p Due to this and other important results, current clinical practice guidelines for MASLD recommend the use of vitamin E at a dose of 800 IU/day as a treatment option for patients with MASLD without diabetes and without risk factors for prostate cancer [ 85 The effect of vitamin E in combination with phenolic compounds has recently been studied; the study by Lahmi et al. [ 86 3.4. Trace Elements Zinc Zn is the second most concentrated trace element in the body and is involved in multiple signaling, regulatory, structural, and catalytic functions. It has an anti-inflammatory role in energy and antioxidant metabolism. It is a cofactor for more than 300 enzymes, and more than 3000 proteins are dependent on Zn concentrations, thus playing an essential role in cellular regulation and metabolism [ 87 88 There is a close relationship between Zn and glucose metabolism and lipid accumulation [ 89 2 90 91 In Zn deficiency, various functions and regulatory mechanisms dependent on Zn absorption in the gastrointestinal tract are compromised. These mechanisms are also associated with MASLD development and progression, such as IR, hypertension, and dyslipidemia. However, the main mechanism affected by Zn deficiency is its antioxidant function, as it plays a central role in the adaptation of the endoplasmic reticulum to oxidative stress and inflammation attenuation, creating a vicious cycle in which Zn deficiency is caused by an increase in demand due to stress on the endoplasmic reticulum. In turn, this deficiency induces greater stress [ 92 The effects of Zn gluconate supplementation have been studied in various liver diseases, specifically in MASLD. Razaei et al. [ 93 p p p 3.5. Fatty Acids Fatty acids are lipid molecules contained in fats, the macronutrient with the greatest energy content. They are components of various membranes and have different biological functions, such as cytokine production and the response they produce in tissues. Among the fatty acids derived from dietary lipids are polyunsaturated fatty acids (PUFAs) (ω-3 and ω-6); the dietary intake of these fatty acids is associated with the phospholipid composition of the immune cells’ membranes and the cells of the tissues where cytokines act [ 34 Alpha-linolenic acid is an essential PUFA obtained from the diet, which is metabolized into ω-3 fatty acids, eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA). The main dietary sources of these fatty acids are flaxseed, canola, and soybean oils (alpha-linolenic acid) and fish such as salmon, tuna, sardines, cod, and hake (EPA and DHA) [ 94 95 96 ω-3 fatty acids have anti-inflammatory effects, improving T cell function. This effect is attributed to changes in membrane phospholipids, producing changes in cytokine- and lipid-derived inflammatory mediators and maintaining glutathione levels [ 34 97 98 Specifically, decreased levels of ω-3 fatty acids have been associated with reduced responses to increased cytokines and inflammation, so fatty acid supplementation has been associated with improved lymphocyte function and the promotion of the production of anti-inflammatory cytokines, such as IL-4 [ 99 98 Current American Heart Association guidelines [ 100 101 p p p 102 103 3.6. Nucleotides Nucleotides are essential compounds for various biological functions, including the response of immunoglobulins, the maintenance of intestinal cells, protein synthesis, and lipid metabolism. Although they are not essential compounds, they can be obtained from the diet through breast milk, meat, fish, beans, peas, lentils, and some types of mushrooms [ 104 The main nucleotide associated with MASLD is NAD+, which is not directly obtained from the diet, but can be obtained through the consumption of its precursors, such as niacin, niacinamide, nicotinamide riboside (NR), and nicotinamide mononucleotide (NMN). Dietary sources include fish (such as salmon and tuna), lean meats, mushrooms, dairy products, whole grains, nuts, and seeds; however, the most readily available sources are found in dietary supplements containing NMN and NR [ 105 NAD+ is a redox factor used by sirtuins; NAD+ is also a precursor of nicotinamide adenine dinucleotide phosphate. NAD+ has also been associated with decreased activation of HSC [ 105 106 107 The interaction between the endoplasmic reticulum and mitochondria through mitochondria-associated membranes plays an important role in the development of hepatic steatosis due to their function in pathways related to lipid synthesis, which, when altered, promote SLD [ 108 109 Regarding NR supplementation, various studies in murine models have shown that this supplementation increases NAD+ levels with effects in reducing triglycerides, fibrosis markers, and inflammation [ 105 110 One of the effects evaluated of nucleotides in MASLD is the possible reversal of liver damage through improved mitochondrial function; in a study with mice with HFD-induced hepatic steatosis and six human volunteers, it was observed that NAD+-boosting therapy could reverse steatosis by stimulating the exercise-related hormone fibronectin type III domain containing 5, also called irisin [ 111 112 p 113 Immunonutrients have different beneficial effects on MASLD pathways involving inflammation, oxidative stress, and lipid peroxidation, impacting clinical, metabolic, and hepatic outcomes. Therefore, immunonutrition could be an additional option for MASLD treatment; however, most of these positive effects have been observed in preclinical studies, with limited evidence from clinical trials or meta-analyses. Table 1 Table 2 4. Impact of Immunonutrients on MASLD Diet Pattern The cornerstone of MASLD treatment is lifestyle modification, including physical activity and weight loss through dietary modifications. Regarding the latter, the effect of different dietary patterns on indicators of weight, inflammation, and liver function has been evaluated, including calorie restriction, the ketogenic diet, low-carbohydrate or low-lipid patterns, intermittent fasting, and the MedDiet [ 114 115 116 117 p p 85 118 119 120 The MedDiet is characterized by its high content of fruits, vegetables, whole grains, legumes, and minimally processed oilseeds, in addition to the inclusion of vegetable oils as the main source of fat. The protein intake of the MedDiet is based on the consumption of dairy products (mainly cheese and yogurt), poultry, and, to a lesser extent, red meat. This dietary pattern provides a large amount of health-beneficial compounds, the most important of which are polyphenols and polyunsaturated fatty acids such as ω-3. Due to these characteristics, the MedDiet is the dietary pattern with the greatest evidence of beneficial effects on health, mainly at the cardiovascular level, although its benefits have also been observed in metabolic diseases, neurological disorders, and some types of cancer [ 121 122 123 Metabolic diseases are associated with an overproduction of ROS, which is associated with the activation of NF-KB, increasing inflammation levels [ 124 125 126 Due to the foods included in the MedDiet, the immunonutrient intake could contribute to anti-inflammatory and antioxidant effects. In a cross-sectional study of 685 patients, Bettermann et al. [ 127 The main immunonutrients contained in the characteristic foods of the MedDiet are ω-3 fatty acids, due to the contribution of vegetable fats, and polyphenols, due to the amount of fruits and vegetables included. The consumption of olive oil, the main source of lipids in the MedDiet, has been associated with the attenuation of adipose tissue hypertrophy and inflammation; specifically, the ω-3 content in olive oil improves antioxidant status in chronic diseases, such as MASLD [ 128 124 Regarding the latter, it has been proposed to enrich the MedDiet pattern with polyphenols from green tea and to prefer the consumption of plant protein from plants with a high polyphenol content. This strategy, called the green-MedDiet, has been shown to have a greater impact on some cardiometabolic outcomes, such as the reduction in visceral fat. In a randomized clinical trial with 294 patients with at least one metabolic disorder, comparing the MedDiet with the green-MedDiet, Zelicha et al. [ 129 p p 130 While immunonutrient supplementation could be part of the treatment of MASLD, following a MedDiet eating pattern, which includes immunonutrients, is a more available and cost-effective strategy. However, despite the MedDiet’s obvious benefits, acceptability and adherence depend not only on clinical factors but also on patients’ socioeconomic status, primarily in geographic regions where the availability of the MedDiet’s signature foods is low, which significantly increases its cost [ 131 In order to address these MedDiet limitations, another regional dietary pattern has been proposed: the Milpa diet, based on the consumption of foods from the milpa system, which corresponds to the agricultural production system characteristic of Mesoamerica, where foods such as corn, legumes (beans), squash, chili peppers, and tomatoes are obtained through polyculture [ 132 133 The contribution of beneficial components for health in the Milpa diet has been compared to that of the MedDiet, due to the inclusion of foods, mainly of plant origin, with a high content of antioxidants, polyphenols, and vitamins A, C and E [ 134 133 135 One of the key factors in managing MASLD is the regulation of gut microbiota. In recent years, evidence demonstrating the role of microbiota in the pathophysiology of MASLD has been increasing; the gut–liver axis interacts with various signaling and inflammatory pathways, stemming from microbiota function in metabolizing fiber, bile acids, and nutrients, and generating metabolites that may have an effect in mitigating MASLD [ 136 137 In MASLD patients, dysbiosis has been linked to the severity of liver steatosis. These patients show an increased abundance of Enterobacteriaceae, particularly from the Pseudomonadota phylum Ruminococcaceae Rikenellaceae Firmicutes Bacteroidetes 138 Due to microbiota-diet interactions, it has been proposed that dietary pattern modification could have a positive effect on microbiota composition. In this context, the MedDiet has been shown to significantly reduce the species of Ruminococcus R. gnavus R. torques 136 139 Clostridium leptum Eubacterium rectale 140 The most robust evidence of the beneficial effect of immunonutrients on the gut microbiota is attributed to polyphenols, which therapeutic effects related to the improvement of lipid profiles, systemic inflammation, and scavenging of reactive oxygen species are attributed to their close relationship with the gut microbiome [ 59 141 Prevotella Bacteroidetes Bacteroidetes 73 Even the observed beneficial changes in microbiota due to diet modifications are influenced by many factors that affect microbiome composition. These factors are not limited to the presence of hepatic disease but also include genetic predisposition, drug exposure, dietary history, geographic location, and birth factors. All of these serve as significant limitations when generalizing the study results. 5. Future Perspectives In chronic liver diseases (such as cirrhosis), immunonutrition has demonstrated a beneficial effect due to the interaction of immunonutrients in inflammation pathways and oxidative stress. In this way, this nutritional strategy could play an important role in the multidisciplinary treatment MASLD field. So far, the evaluation of the effects of immunonutrients in MASLD has been based on the reduction in inflammatory markers and liver function tests at the systemic level, which are considered good response markers. However, over time and with the significant increase in prevalence, the endpoints for MASLD have become more stringent, creating a scenario where normalization of liver enzymes is no longer sufficient. Therefore, it is necessary to design clinical trials with more rigorous outcomes that evaluate the effect of immunonutrients in MASLD. It seems only a matter of time before this nutritional strategy is considered an adjuvant option for MASLD treatment, either through modification of dietary patterns or specific immunonutrient supplementation. Current evidence and clinical practice guidelines for the treatment of MASLD show that dietary modification is a fundamental factor in the management of this liver disease. Changing traditional Western diets or those with a high consumption of ultra-processed foods toward healthy dietary patterns has been shown to have beneficial effects on various MASLD indicators; however, from a pathophysiological point of view, the MedDiet pattern has been shown to have a greater impact on cardiovascular and metabolic indicators, primarily due to the presence of chemical components with beneficial effects on health and the provision of immunonutrients; hence its close beneficial relationship with MASLD. Nonetheless, the main limitation of changing traditional dietary patterns is medium- and long-term adherence, especially when they are aimed at treating rather than preventing the disease. With this in mind, the role of diet may not be as relevant in the early stages of the currently available pharmacological treatments for MASLD, but the importance of diet will likely increase in a fundamental aspect: maintaining the results achieved with pharmacological treatment. To date, it has only been evaluated over 52-week periods. To maintain these effects in the long term, pharmacological treatment must be accompanied by lifestyle changes regarding diet and physical activity indefinitely. On the other hand, the costs of the MedDiet may have economic implications that limit long-term adherence, especially in regions with less availability of the foods that are characteristic of this dietary pattern. As for the already established benefits of MedDiet components in patients with MASLD, including immunonutrients, dietary modification with sociodemographic approaches and adjustments allows for the enrichment of polyphenol intake and the addition of foods containing other immunonutrients associated with beneficial effects in MASLD, such as amino acids, vitamins C and E, Zn, and nucleotides. 6. Conclusions Immunonutrition is a strategy that has so far demonstrated beneficial effects in MASLD; however, evidence still needs to be expanded on the effect of specific immunonutrient supplementation on hepatic, metabolic, and cardiovascular outcomes in these patients. Future development of clinical trials should also evaluate the availability, cost, and access to foods containing immunonutrients or specific supplements, according to the clinical characteristics and geographic region of the population. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, I.L.-M. and E.J.-H.; investigation, E.J.-H.; resources, M.U.; writing—original draft preparation, I.L.-M.; writing—review and editing, I.L.-M., E.J.-H. and M.U.; supervision, M.U. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: MASLD Metabolic Dysfunction-Associated Steatotic Liver Disease MASH Metabolic Dysfunction-Associated Steatohepatitis NF-κB Nuclear Factor kappa B IR Insulin Resistance ω-3 Omega-3 Fatty Acid ROS Reactive Oxygen Species HSC Hepatic Stellate Cells AMPK AMP activated protein kinase mTOR Mechanistic Target of Rapamycin SIRT1 Sirtuin 1 SREBP1c Sterol Regulatory Element-Binding Protein Zn Zinc SPARC Secretory Acidic Protein Rich in Cysteine SLD Steatotic Liver Disease NAC N-acetylcysteine AST Aspartate aminotransferase ALT Alanine aminotransferase ALP Alkaline phosphatase TNF-α Tumor Necrosis Factor-alpha HFD High-Fat Diet BCAA Branched Chain Amino acids MedDiet Mediterranean Diet NAD Nicotinamide Adenine Dinucleotide EGCG Epigallocatechin-3-gallate PUFA Polyunsaturated Fatty Acids NR Nicotinamide Riboside NMN Nicotinamide Mononucleotide References 1. Pérez C.T. Amarelle C.G. Novo N.R. Rodríguez G.L. Gil B.M. Carballeira R.P. Gutiérrez F.P. Armesto R.A. Blanco A.C. López M.A.B. Immunonutrition, Evidence and Experiences Nutr. Hosp. 2022 40 186 199 10.20960/nh.04226 2. Singh R. Gopalan S. Sibal A. Immunonutrition Indian J. Pediatr. 2002 69 417 419 10.1007/BF02722634 12061676 3. Chew N.W.S. Ng C.H. Tan D.J.H. Kong G. Lin C. Chin Y.H. Lim W.H. Huang D.Q. Quek J. Fu C.E. The Global Burden of Metabolic Disease: Data from 2000 to 2019 Cell Metab. 2023 35 414 428.e3 10.1016/j.cmet.2023.02.003 36889281 4. Rinella M.E. Lazarus J.V. Ratziu V. Francque S.M. Sanyal A.J. Kanwal F. Romero D. Abdelmalek M.F. Anstee Q.M. Arab J.P. A Multisociety Delphi Consensus Statement on New Fatty Liver Disease Nomenclature J. Hepatol. 2023 79 1542 1556 10.1016/j.jhep.2023.06.003 37364790 5. Younossi Z.M. Kalligeros M. Henry L. Epidemiology of Metabolic Dysfunction-Associated Steatotic Liver Disease Clin. Mol. Hepatol. 2025 31 S32 S50 10.3350/cmh.2024.0431 39159948 PMC11925440 6. Haas J.T. Francque S. Staels B. Pathophysiology and Mechanisms of Nonalcoholic Fatty Liver Disease Annu. Rev. Physiol. 2016 78 181 205 10.1146/annurev-physiol-021115-105331 26667070 7. Hoogerland J.A. Staels B. Dombrowicz D. Immune-Metabolic Interactions in Homeostasis and the Progression to NASH Trends Endocrinol. Metab. 2022 33 690 709 10.1016/j.tem.2022.07.001 35961913 8. Targher G. Byrne C.D. Tilg H. MASLD: A Systemic Metabolic Disorder with Cardiovascular and Malignant Complications Gut 2024 7 691 702 10.1136/gutjnl-2023-330595 38228377 9. Chona M.C. Basto L.M.L. Ospina C.P. Coronado A.C.P. Silva M.P.G. Marín M. Vallejos A. Osmán G.E.C. Saavedra C. Rojas J.D. Preoperative Immunonutrition and Postoperative Outcomes in Patients with Cancer Undergoing Major Abdominal Surgery: Retrospective Cohort Study Clin. Nutr. ESPEN 2025 65 324 330 10.1016/j.clnesp.2024.12.011 39681165 10. McCarthy M.S. Martindale R.G. Immunonutrition in Critical Illness: What Is the Role? Nutr. Clin. Pract. 2018 33 348 358 10.1002/ncp.10102 29878555 11. Ricci C. Serbassi F. Alberici L. Ingaldi C. Gaetani L. De Raffele E. Pironi L. Sasdelli A.S. Mosconi C. Di Marco M.C. Immunonutrition in Patients Who Underwent Major Abdominal Surgery: A Comprehensive Systematic Review and Component Network Metanalysis Using GRADE and CINeMA Approaches Surgery 2023 174 1401 1409 10.1016/j.surg.2023.08.005 37775395 12. Beevi S.S. Pottakkat B. Effect of Immunonutrition on the Liver Function Status of End-Stage Liver Disease Patients Waiting/Referred for Liver Transplant: A Randomized Controlled Trial Cureus 2023 15 e36923 10.7759/cureus.36923 37128515 PMC10148730 13. Powell E.E. Wong V.W.-S. Rinella M. Non-Alcoholic Fatty Liver Disease Lancet 2021 397 2212 2224 10.1016/S0140-6736(20)32511-3 33894145 14. Wong S.K. Chin K.-Y. Ima-Nirwana S. Vitamin C: A Review on Its Role in the Management of Metabolic Syndrome Int. J. Med. Sci. 2020 17 1625 1638 10.7150/ijms.47103 32669965 PMC7359392 15. Liu Y.-X. Yu J.-H. Sun J.-H. Ma W.-Q. Wang J.-J. Sun G.-J. Effects of Omega-3 Fatty Acids Supplementation on Serum Lipid Profile and Blood Pressure in Patients with Metabolic Syndrome: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Foods 2023 12 725 10.3390/foods12040725 36832799 PMC9956263 16. Li Y. Yang P. Ye J. Xu Q. Wu J. Wang Y. Updated Mechanisms of MASLD Pathogenesis Lipids Health Dis. 2024 23 117 10.1186/s12944-024-02108-x 38649999 PMC11034170 17. Feng J. MengHuan L. TingTing Y. XueJie Y. HaiNing G. Research Progress on AMPK in the Pathogenesis and Treatment of MASLD Front. Immunol. 2025 16 1558041 10.3389/fimmu.2025.1558041 40134423 PMC11932893 18. Marcondes-de-Castro I.A. Reis-Barbosa P.H. Marinho T.S. Aguila M.B. Mandarim-de-Lacerda C.A. AMPK/MTOR Pathway Significance in Healthy Liver and Non-alcoholic Fatty Liver Disease and Its Progression J. Gastroenterol. Hepatol. 2023 38 1868 1876 10.1111/jgh.16272 37438882 19. Idilman I.S. Ozdeniz I. Karcaaltincaba M. Hepatic Steatosis: Etiology, Patterns, and Quantification Semin. Ultrasound CT MRI 2016 37 501 510 10.1053/j.sult.2016.08.003 27986169 20. Pollock G.R.Y. Van Way C.W. Immune-Enhancing Nutrition in Surgical Critical Care Mo. Med. 2012 109 388 392 23097945 PMC6179746 21. Beevi Safeena S. Are Immunonutrition a Novel Therapy for Liver Diseases? Medicon Med. Sci. 2022 4 55 57 10.55162/MCMS.04.096 22. Chen H. Chen Z. Bai X. Li Z. Huang S. Lu D. Li J. Wang Y. Han L. Xia K. Metabolic and Hepatic Biomarkers Associated with MASLD in the Chinese Population Sci. Rep. 2025 15 31593 10.1038/s41598-025-17219-3 40866488 PMC12391322 23. Raczyńska A. Leszczyńska T. Skotnicki P. Koronowicz A. The Impact of Immunomodulatory Components Used in Clinical Nutrition—A Narrative Review Nutrients 2025 17 752 10.3390/nu17050752 40077622 PMC11902155 24. de Jong J.C.W. van Rooijen K.S. Stigter E.C.A. Gülersönmez M.C. de Zoete M.R. Top J. Baars M.J.D. Vercoulen Y. Kuipers F. van Mil S.W.C. Dietary Cystine Restriction Increases the Proliferative Capacity of the Small Intestine of Mice PLoS ONE 2024 19 e0290493 10.1371/journal.pone.0290493 38181033 PMC10769047 25. Wong S.L.I. Sukkar M.B. The SPARC Protein: An Overview of Its Role in Lung Cancer and Pulmonary Fibrosis and Its Potential Role in Chronic Airways Disease Br. J. Pharmacol. 2017 174 3 14 10.1111/bph.13653 27759879 PMC5341485 26. Derosa G. D’Angelo A. Maffioli P. Change of Some Oxidative Stress Parameters after Supplementation with Whey Protein Isolate in Patients with Type 2 Diabetes Nutrition 2020 73 110700 10.1016/j.nut.2019.110700 32065880 27. Mazzolini G. Atorrasagasti C. Onorato A. Peixoto E. Schlattjan M. Sowa J.-P. Sydor S. Gerken G. Canbay A. SPARC Expression Is Associated with Hepatic Injury in Rodents and Humans with Non-Alcoholic Fatty Liver Disease Sci. Rep. 2018 8 725 10.1038/s41598-017-18981-9 29335425 PMC5768809 28. Sarem M. Znaidak R. Macías M. Rey R. Las Células Estrelladas Del Hígado: Su Importancia En Condiciones Normales y Patológicas Gastroenterol. Hepatol. 2006 29 93 101 10.1157/13083906 16448612 29. Atorrasagasti C. Onorato A.M. Mazzolini G. The Role of SPARC (Secreted Protein Acidic and Rich in Cysteine) in the Pathogenesis of Obesity, Type 2 Diabetes, and Non-Alcoholic Fatty Liver Disease J. Physiol. Biochem. 2023 79 815 831 10.1007/s13105-022-00913-5 36018492 30. Tran M. Mostofa G. Picard M. Wu J. Wang L. Shin D.-J. SerpinA3N Deficiency Attenuates Steatosis and Enhances Insulin Signaling in Male Mice J. Endocrinol. 2023 256 e220073 10.1530/JOE-22-0073 36625462 PMC9930402 31. Rague J. N-Acetylcysteine History of Modern Clinical Toxicology Elsevier Amsterdam, The Netherlands 2022 201 212 32. Hang W. Shu H. Wen Z. Liu J. Jin Z. Shi Z. Chen C. Wang D.W. N-Acetyl Cysteine Ameliorates High-Fat Diet-Induced Nonalcoholic Fatty Liver Disease and Intracellular Triglyceride Accumulation by Preserving Mitochondrial Function Front. Pharmacol. 2021 12 636204 10.3389/fphar.2021.636204 34588976 PMC8473737 33. Nikbaf-Shandiz M. Adeli S. Faghfouri A.H. Khademi F. Jamilian P. Zarezadeh M. Ebrahimi-Mamaghani M. The Efficacy of N-Acetylcysteine in Improving Liver Function: A Systematic Review and Meta-Analysis of Controlled Clinical Trials PharmaNutrition 2023 24 100343 10.1016/j.phanu.2023.100343 34. Grimble R.F. Basics in Clinical Nutrition: Immunonutrition—Nutrients Which Influence Immunity: Effect and Mechanism of Action E-Spen Eur. E J. Clin. Nutr. Metab. 2009 4 e10 e13 10.1016/j.eclnm.2008.07.015 35. López-Cervantes J. Sánchez-Machado D.I. Campas-Baypoli O.N. Cantú-Soto E.U. de la Mora-López G.S. Influence of Other Nutrients (e.g., l-Arginine, Taurine, and Choline) on Liver Diseases Influence of Nutrients, Bioactive Compounds, and Plant Extracts in Liver Diseases Elsevier Amsterdam, The Netherlands 2021 193 208 36. d’Unienville N.M.A. Blake H.T. Coates A.M. Hill A.M. Nelson M.J. Buckley J.D. Effect of Food Sources of Nitrate, Polyphenols, L-Arginine and L-Citrulline on Endurance Exercise Performance: A Systematic Review and Meta-Analysis of Randomised Controlled Trials J. Int. Soc. Sports Nutr. 2021 18 76 10.1186/s12970-021-00472-y 34965876 PMC8715640 37. Navarro L.A. Wree A. Povero D. Berk M.P. Eguchi A. Ghosh S. Papouchado B.G. Erzurum S.C. Feldstein A.E. Arginase 2 Deficiency Results in Spontaneous Steatohepatitis: A Novel Link between Innate Immune Activation and Hepatic de Novo Lipogenesis J. Hepatol. 2015 62 412 420 10.1016/j.jhep.2014.09.015 25234945 PMC4736721 38. Kim D.Y. Park J.Y. Gee H.Y. Lactobacillus Plantarum Ameliorates NASH-Related Inflammation by Upregulating l-Arginine Production Exp. Mol. Med. 2023 55 2332 2345 10.1038/s12276-023-01102-0 37907736 PMC10689779 39. Otani L. Nishi H. Koyama A. Akasaka Y. Taguchi Y. Toyoshima Y. Yamanaka D. Hakuno F. Jia H. Takahashi S.-I. Low-Arginine and Low-Protein Diets Induce Hepatic Lipid Accumulation through Different Mechanisms in Growing Rats Nutr. Metab. 2020 17 60 10.1186/s12986-020-00477-5 PMC7398226 32774438 40. Abu-Serie M.M. El-Gamal B.A. El-Kersh M.A. El-Saadani M.A. Investigation into the Antioxidant Role of Arginine in the Treatment and the Protection for Intralipid-Induced Non-Alcoholic Steatohepatitis Lipids Health Dis. 2015 14 128 10.1186/s12944-015-0124-0 26463841 PMC4604631 41. Ma W. Heianza Y. Huang T. Wang T. Sun D. Zheng Y. Hu F.B. Rexrode K.M. Manson J.E. Qi L. Dietary Glutamine, Glutamate and Mortality: Two Large Prospective Studies in US Men and Women Int. J. Epidemiol. 2018 47 311 320 10.1093/ije/dyx234 29140419 PMC5837531 42. Kapalka G.M. Substances Involved in Neurotransmission Nutritional and Herbal Therapies for Children and Adolescents Elsevier Amsterdam, The Netherlands 2010 71 99 43. Cruzat V. Macedo Rogero M. Noel Keane K. Curi R. Newsholme P. Glutamine: Metabolism and Immune Function, Supplementation and Clinical Translation Nutrients 2018 10 1564 10.3390/nu10111564 30360490 PMC6266414 44. Chashmniam S. Ghafourpour M. Rezaei Farimani A. Gholami A. Ghoochani B.F.N.M. Metabolomic Biomarkers in the Diagnosis of Non-Alcoholic Fatty Liver Disease Hepat. Mon. 2019 19 e92244 10.5812/hepatmon.92244 45. Li J. Ghazwani M. Liu K. Huang Y. Chang N. Fan J. He F. Li L. Bu S. Xie W. Regulation of Hepatic Stellate Cell Proliferation and Activation by Glutamine Metabolism PLoS ONE 2017 12 e0182679 10.1371/journal.pone.0182679 28797105 PMC5552314 46. Yin X. Peng J. Gu L. Liu Y. Li X. Wu J. Xu B. Zhuge Y. Zhang F. Targeting Glutamine Metabolism in Hepatic Stellate Cells Alleviates Liver Fibrosis Cell Death Dis. 2022 13 955 10.1038/s41419-022-05409-0 36376267 PMC9663710 47. Du K. Hyun J. Premont R.T. Choi S.S. Michelotti G.A. Swiderska-Syn M. Dalton G.D. Thelen E. Rizi B.S. Jung Y. Hedgehog-YAP Signaling Pathway Regulates Glutaminolysis to Control Activation of Hepatic Stellate Cells Gastroenterology 2018 154 1465 1479.e13 10.1053/j.gastro.2017.12.022 29305935 PMC5880682 48. Schemitt E.G. Colares J.R. Hartmann R.M. Morgan-Martins M.I. Marroni C.A. Tuñón M.J. Marroni N.P. Efecto de La Glutamina En El Estrés Oxidativo y La Inflamación En Un Modelo de Rata Con Insuficiencia Hepática Fulminante Nutr. Hosp. 2016 33 92 10.20960/nh.92 27238775 49. Lin Z. Cai F. Lin N. Ye J. Zheng Q. Ding G. Effects of Glutamine on Oxidative Stress and Nuclear Factor-ΚB Expression in the Livers of Rats with Nonalcoholic Fatty Liver Disease Exp. Ther. Med. 2014 7 365 370 10.3892/etm.2013.1434 24396406 PMC3881322 50. Tilg H. The Role of Cytokines in Non-Alcoholic Fatty Liver Disease Dig. Dis. 2010 28 179 185 10.1159/000282083 20460908 51. Xu B. Wang M. Pu L. Shu C. Li L. Han L. Association of Dietary Intake of Branched-Chain Amino Acids with Long-Term Risks of CVD, Cancer and All-Cause Mortality Public Health Nutr. 2022 25 3390 3400 10.1017/S1368980021004948 PMC9991783 34930509 52. Okekunle A.P. Lee H. Provido S.M.P. Chung G.H. Hong S. Yu S.H. Lee C.B. Lee J.E. Dietary Intakes of Branched-Chain Amino Acids and Plasma Lipid Profiles among Filipino Women in Korea: The Filipino Women’s Diet and Health Study (FiLWHEL) Nutr. J. 2023 22 34 10.1186/s12937-023-00861-w 37430285 PMC10334570 53. Cuomo P. Capparelli R. Iannelli A. Iannelli D. Role of Branched-Chain Amino Acid Metabolism in Type 2 Diabetes, Obesity, Cardiovascular Disease and Non-Alcoholic Fatty Liver Disease Int. J. Mol. Sci. 2022 23 4325 10.3390/ijms23084325 35457142 PMC9030262 54. Honda T. Ishigami M. Luo F. Lingyun M. Ishizu Y. Kuzuya T. Hayashi K. Nakano I. Ishikawa T. Feng G.-G. Branched-Chain Amino Acids Alleviate Hepatic Steatosis and Liver Injury in Choline-Deficient High-Fat Diet Induced NASH Mice Metabolism 2017 69 177 187 10.1016/j.metabol.2016.12.013 28285648 55. Lake A.D. Novak P. Shipkova P. Aranibar N. Robertson D.G. Reily M.D. Lehman-McKeeman L.D. Vaillancourt R.R. Cherrington N.J. Branched Chain Amino Acid Metabolism Profiles in Progressive Human Nonalcoholic Fatty Liver Disease Amino Acids 2015 47 603 615 10.1007/s00726-014-1894-9 25534430 PMC4329055 56. Surugihalli C. Muralidaran V. Ryan C.E. Patel K. Zhao D. Sunny N.E. Branched-Chain Amino Acids Alter Cellular Redox to Induce Lipid Oxidation and Reduce de Novo Lipogenesis in the Liver Am. J. Physiol. Endocrinol. Metab. 2023 324 E299 E313 10.1152/ajpendo.00307.2022 36791321 PMC10042599 57. Quiñones M. Miguel M. Aleixandre A. The Polyphenols, Naturally Occurring Compounds with Beneficial Effects on Cardiovascular Disease Nutr. Hosp. 2012 27 76 89 22566306 10.1590/S0212-16112012000100009 58. Safer A.-M. Afzal M. Nomani M. Mousa S.A. Green Tea Extract in the Management of Hepatic Fibrosis Tea in Health and Disease Prevention Elsevier Amsterdam, The Netherlands 2013 903 909 59. Rana A. Samtiya M. Dhewa T. Mishra V. Aluko R.E. Health Benefits of Polyphenols: A Concise Review J. Food Biochem. 2022 46 e14264 10.1111/jfbc.14264 35694805 60. Rafiei H. Omidian K. Bandy B. Dietary Polyphenols Protect Against Oleic Acid-Induced Steatosis in an In Vitro Model of NAFLD by Modulating Lipid Metabolism and Improving Mitochondrial Function Nutrients 2019 11 541 10.3390/nu11030541 30832407 PMC6471211 61. Osborn L.J. Schultz K. Massey W. DeLucia B. Choucair I. Varadharajan V. Banerjee R. Fung K. Horak A.J. Orabi D. A Gut Microbial Metabolite of Dietary Polyphenols Reverses Obesity-Driven Hepatic Steatosis Proc. Natl. Acad. Sci. USA 2022 119 e2202934119 10.1073/pnas.2202934119 36417437 PMC9860326 62. Fogacci F. Avagimyan A. Cesaro A. Bernardi M. Perone F. Giovannini M. Cicero A.F.G. The Effect of Highly Bioavailable Forms of Curcumin on Lipoprotein(a) Plasma Levels: A Systematic Review and Meta-Analysis of Randomized Clinical Studies Prostaglandins Other Lipid Mediat. 2025 178 106994 10.1016/j.prostaglandins.2025.106994 40252824 63. Rajabinasab F. Tabatabaei F.S.A. Kheirandish A. Hajimirzaei P. Abolfazli S. Aromolaran A.S. Jamialahmadi T. Sahebkar A. Effect of Curcumin on Cardiometabolic Diseases in the Elderly: A Systematic Review of Randomized Controlled Trials Ageing Res. Rev. 2025 110 102801 10.1016/j.arr.2025.102801 40516827 64. Goleij P. Rezaee A. Lam H.Y. Tabari M.A.K. Ouf N. Alijanzadeh D. Sanaye P.M. Larsen D.S. Daglia M. Khan H. From Bench to Bedside: Exploring Curcumin-Driven Signaling Pathways in Immune Cells for Cancer Management Inflammopharmacology 2025 33 2293 2306 10.1007/s10787-025-01739-5 40244492 65. Ciuca M.D. Racovita R.C. Curcumin: Overview of Extraction Methods, Health Benefits, and Encapsulation and Delivery Using Microemulsions and Nanoemulsions Int. J. Mol. Sci. 2023 24 8874 10.3390/ijms24108874 37240220 PMC10219365 66. Lukkunaprasit T. Tansawet A. Boonmanunt S. Sobhonslidsuk A. McKay G.J. Attia J. Thakkinstian A. An Updated Meta-Analysis of Effects of Curcumin on Metabolic Dysfunction-Associated Fatty Liver Disease Based on Available Evidence from Iran and Thailand Sci. Rep. 2023 13 5824 10.1038/s41598-023-33023-3 37037891 PMC10086025 67. Bayram H.M. Majoo F.M. Ozturkcan A. Polyphenols in the Prevention and Treatment of Non-Alcoholic Fatty Liver Disease: An Update of Preclinical and Clinical Studies Clin. Nutr. ESPEN 2021 44 1 14 10.1016/j.clnesp.2021.06.026 34330452 68. Xia H. Wang J. Xie X. Xu L. Tang S. Green Tea Polyphenols Attenuate Hepatic Steatosis, and Reduce Insulin Resistance and Inflammation in High-Fat Diet-Induced Rats Int. J. Mol. Med. 2019 44 1523 1530 10.3892/ijmm.2019.4285 31364723 69. Wu D. Liu Z. Wang Y. Zhang Q. Li J. Zhong P. Xie Z. Ji A. Li Y. Epigallocatechin-3-Gallate Alleviates High-Fat Diet-Induced Nonalcoholic Fatty Liver Disease via Inhibition of Apoptosis and Promotion of Autophagy through the ROS/MAPK Signaling Pathway Oxid. Med. Cell. Longev. 2021 2021 5599997 10.1155/2021/5599997 33953830 PMC8068552 70. Du Y. Paglicawan L. Soomro S. Abunofal O. Baig S. Vanarsa K. Hicks J. Mohan C. Epigallocatechin-3-Gallate Dampens Non-Alcoholic Fatty Liver by Modulating Liver Function, Lipid Profile and Macrophage Polarization Nutrients 2021 13 599 10.3390/nu13020599 33670347 PMC7918805 71. Ngu M.H. Norhayati M.N. Rosnani Z. Zulkifli M.M. Curcumin as Adjuvant Treatment in Patients with Non-Alcoholic Fatty Liver (NAFLD) Disease: A Systematic Review and Meta-Analysis Complement. Ther. Med. 2022 68 102843 10.1016/j.ctim.2022.102843 35661765 72. Wu J. Li M. Huang N. Guan F. Luo H. Chen L. Wei G. Li M. Lin Z. Su Z. Curcumin Alleviates High-Fat Diet-Induced Nonalcoholic Steatohepatitis via Improving Hepatic Endothelial Function with Microbial Biotransformation in Rats J. Agric. Food Chem. 2023 71 10338 10348 10.1021/acs.jafc.3c01067 37389466 73. He Y. Chen X. Li Y. Liang Y. Hong T. Yang J. Cao Z. Mai H. Yao J. Zhang T. Curcumin Supplementation Alleviates Hepatic Fat Content Associated with Modulation of Gut Microbiota-Dependent Bile Acid Metabolism in Patients with Nonalcoholic Simple Fatty Liver Disease: A Randomized Controlled Trial Am. J. Clin. Nutr. 2024 120 66 79 10.1016/j.ajcnut.2024.05.017 38795741 74. Chen Q. Zhao L. Mei L. Zhao X. Han P. Liu J. Meng C. Li R. Zhong R. Wang K. Vitamin C and Vitamin D3 Alleviate Metabolic-Associated Fatty Liver Disease by Regulating the Gut Microbiota and Bile Acid Metabolism via the Gut-Liver Axis Front. Pharmacol. 2023 14 1163694 10.3389/fphar.2023.1163694 37089915 PMC10113476 75. Doseděl M. Jirkovský E. Macáková K. Krčmová L. Javorská L. Pourová J. Mercolini L. Remião F. Nováková L. Mladěnka P. Vitamin C—Sources, Physiological Role, Kinetics, Deficiency, Use, Toxicity, and Determination Nutrients 2021 13 615 10.3390/nu13020615 33668681 PMC7918462 76. Hon S.L. Vitamin C (Ascorbic Acid) Encyclopedia of Toxicology Elsevier Amsterdam, The Netherlands 2024 805 807 77. Musso G. Gambino R. De Michieli F. Cassader M. Rizzetto M. Durazzo M. Fagà E. Silli B. Pagano G. Dietary Habits and Their Relations to Insulin Resistance and Postprandial Lipemia in Nonalcoholic Steatohepatitis Hepatology 2003 37 909 916 10.1053/jhep.2003.50132 12668986 78. Lee S.-W. Lee Y.-J. Baek S.-M. Kang K.-K. Kim T.-U. Yim J.-H. Kim H.-Y. Han S.-H. Choi S.-K. Park S.-J. Mega-Dose Vitamin C Ameliorates Nonalcoholic Fatty Liver Disease in a Mouse Fast-Food Diet Model Nutrients 2022 14 2195 10.3390/nu14112195 35683997 PMC9182669 79. He Z. Li X. Yang H. Wu P. Wang S. Cao D. Guo X. Xu Z. Gao J. Zhang W. Effects of Oral Vitamin C Supplementation on Liver Health and Associated Parameters in Patients With Non-Alcoholic Fatty Liver Disease: A Randomized Clinical Trial Front. Nutr. 2021 8 745609 10.3389/fnut.2021.745609 34595203 PMC8478121 80. Fatima G. Dzupina A. Mahdi A.A. Fedacko J. Magomedova A. Yousif N.G. Role of Vitamin-E as a Vital Nutrient in Health and Diseases Indian J. Clin. Biochem. 2025 1 14 10.1007/s12291-025-01309-0 81. Rizvi S. Raza S.T. Ahmed F. Ahmad A. Abbas S. Mahdi F. The Role of Vitamin e in Human Health and Some Diseases Sultan Qaboos Univ. Med. J. 2014 14 e157 e165 10.18295/2075-0528.1566 24790736 PMC3997530 82. Nagashimada M. Ota T. Role of Vitamin E in Nonalcoholic Fatty Liver Disease IUBMB Life 2019 71 516 522 10.1002/iub.1991 30592129 83. Pervez M.A. Khan D.A. Mirza S.A. Slehria A.U.R. Nisar U. Aamir M. Comparison of Delta-Tocotrienol and Alpha-Tocopherol Effects on Hepatic Steatosis and Inflammatory Biomarkers in Patients with Non-Alcoholic Fatty Liver Disease: A Randomized Double-Blind Active-Controlled Trial Complement. Ther. Med. 2022 70 102866 10.1016/j.ctim.2022.102866 35933083 84. Sanyal A.J. Chalasani N. Kowdley K.V. McCullough A. Diehl A.M. Bass N.M. Neuschwander-Tetri B.A. Lavine J.E. Tonascia J. Unalp A. Pioglitazone, Vitamin E, or Placebo for Nonalcoholic Steatohepatitis N. Engl. J. Med. 2010 362 1675 1685 10.1056/NEJMoa0907929 20427778 PMC2928471 85. Rinella M.E. Neuschwander-Tetri B.A. Siddiqui M.S. Abdelmalek M.F. Caldwell S. Barb D. Kleiner D.E. Loomba R. AASLD Practice Guidance on the Clinical Assessment and Management of Nonalcoholic Fatty Liver Disease Hepatology 2023 77 1797 1835 10.1097/hep.0000000000000323 36727674 PMC10735173 86. Lahmi A. Oryan S. Eidi A. Rohani A.H. Comparative Effects of Thymol and Vitamin E on Nonalcoholic Fatty Liver Disease in Male Wistar Rats Braz. J. Biol. 2024 84 e268781 10.1590/1519-6984.268781 36629640 87. Roohani N. Hurrell R. Kelishadi R. Schulin R. Zinc and Its Importance for Human Health: An Integrative Review J. Res. Med. Sci. 2013 18 144 157 23914218 PMC3724376 88. Sangeetha V.J. Dutta S. Moses J.A. Anandharamakrishnan C. Zinc Nutrition and Human Health: Overview and Implications eFood 2022 3 e17 10.1002/efd2.17 89. Olechnowicz J. Tinkov A. Skalny A. Suliburska J. Zinc Status Is Associated with Inflammation, Oxidative Stress, Lipid, and Glucose Metabolism J. Physiol. Sci. 2018 68 19 31 10.1007/s12576-017-0571-7 28965330 PMC5754376 90. Cooper-Capetini V. De Vasconcelos D. Martins A. Hirabara S. Donato J. Jr. Carpinelli A. Abdulkader F. Zinc Supplementation Improves Glucose Homeostasis in High Fat-Fed Mice by Enhancing Pancreatic β-Cell Function Nutrients 2017 9 1150 10.3390/nu9101150 29053582 PMC5691766 91. Chen S.-D. Zhang H. Rios R.S. Li Y.-Y. Zhu P.-W. Jin Y. Ma H.-L. Tang L.-J. Li G. Huang O.-Y. J-Shaped Relationship between Serum Zinc Levels and the Severity of Hepatic Necro-Inflammation in Patients with MAFLD Nutr. Metab. Cardiovasc. Dis. 2022 32 1259 1265 10.1016/j.numecd.2022.01.035 35260312 92. Barbara M. Mindikoglu A.L. The Role of Zinc in the Prevention and Treatment of Nonalcoholic Fatty Liver Disease Metab. Open 2021 11 100105 10.1016/j.metop.2021.100105 PMC8318982 34337376 93. Rezaei S.M.A. Mohammadi F. Eftekhari M.H. Ejtehadi F. Ghaem H. Mohammadipoor N. The Effects of Zinc Supplementation on the Metabolic Factors in Patients with Non-Alcoholic Fatty Liver Disease: A Randomized, Double-Blinded, Placebo-Controlled Clinical Trial BMC Nutr. 2023 9 138 10.1186/s40795-023-00776-z 38012749 PMC10683204 94. Simopoulos A.P. Human Requirement for N-3 Polyunsaturated Fatty Acids Poult. Sci. 2000 79 961 970 10.1093/ps/79.7.961 10901194 95. Meyer B.J. Mann N.J. Lewis J.L. Milligan G.C. Sinclair A.J. Howe P.R.C. Dietary Intakes and Food Sources of Omega-6 and Omega-3 Polyunsaturated Fatty Acids Lipids 2003 38 391 398 10.1007/s11745-003-1074-0 12848284 96. Yang J. Fernández-Galilea M. Martínez-Fernández L. González-Muniesa P. Pérez-Chávez A. Martínez J.A. Moreno-Aliaga M.J. Oxidative Stress and Non-Alcoholic Fatty Liver Disease: Effects of Omega-3 Fatty Acid Supplementation Nutrients 2019 11 872 10.3390/nu11040872 31003450 PMC6521137 97. Spooner M.H. Jump D.B. Nonalcoholic Fatty Liver Disease and Omega-3 Fatty Acids: Mechanisms and Clinical Use Annu. Rev. Nutr. 2023 43 199 223 10.1146/annurev-nutr-061021-030223 37207355 98. Scorletti E. Byrne C.D. Omega-3 Fatty Acids and Non-Alcoholic Fatty Liver Disease: Evidence of Efficacy and Mechanism of Action Mol. Asp. Med. 2018 64 135 146 10.1016/j.mam.2018.03.001 29544992 99. Kumar N.G. Contaifer D. Madurantakam P. Carbone S. Price E.T. Van Tassell B. Brophy D.F. Wijesinghe D.S. Dietary Bioactive Fatty Acids as Modulators of Immune Function: Implications on Human Health Nutrients 2019 11 2974 10.3390/nu11122974 31817430 PMC6950193 100. Skulas-Ray A.C. Wilson P.W.F. Harris W.S. Brinton E.A. Kris-Etherton P.M. Richter C.K. Jacobson T.A. Engler M.B. Miller M. Robinson J.G. Omega-3 Fatty Acids for the Management of Hypertriglyceridemia: A Science Advisory From the American Heart Association Circulation 2019 140 E673 E691 10.1161/CIR.0000000000000709 31422671 101. Musazadeh V. Karimi A. Malekahmadi M. Ahrabi S.S. Dehghan P. Omega-3 Polyunsaturated Fatty Acids in the Treatment of Non-alcoholic Fatty Liver Disease: An Umbrella Systematic Review and Meta-analysis Clin. Exp. Pharmacol. Physiol. 2023 50 327 334 10.1111/1440-1681.13750 36692292 102. Sanyal A.J. Abdelmalek M.F. Suzuki A. Cummings O.W. Chojkier M. No Significant Effects of Ethyl-Eicosapentanoic Acid on Histologic Features of Nonalcoholic Steatohepatitis in a Phase 2 Trial Gastroenterology 2014 147 377 384.e1 10.1053/j.gastro.2014.04.046 24818764 103. Argo C.K. Patrie J.T. Lackner C. Henry T.D. de Lange E.E. Weltman A.L. Shah N.L. Al-Osaimi A.M. Pramoonjago P. Jayakumar S. Effects of N-3 Fish Oil on Metabolic and Histological Parameters in NASH: A Double-Blind, Randomized, Placebo-Controlled Trial J. Hepatol. 2015 62 190 197 10.1016/j.jhep.2014.08.036 25195547 PMC4272639 104. Gil A. Modulation of the Immune Response Mediated by Dietary Nucleotides Eur. J. Clin. Nutr. 2002 56 S1 S4 10.1038/sj.ejcn.1601475 12142952 105. Dall M. Hassing A.S. Treebak J.T. NAD + J. Physiol. 2022 600 1135 1154 10.1113/JP280908 33932956 106. Jiang R. Zhou Y. Wang S. Pang N. Huang Y. Ye M. Wan T. Qiu Y. Pei L. Jiang X. Nicotinamide Riboside Protects against Liver Fibrosis Induced by CCl4 via Regulating the Acetylation of Smads Signaling Pathway Life Sci. 2019 225 20 28 10.1016/j.lfs.2019.03.064 30928408 107. Yoshino J. Baur J.A. Imai S. NAD + Cell Metab. 2018 27 513 528 10.1016/j.cmet.2017.11.002 29249689 PMC5842119 108. Beaulant A. Dia M. Pillot B. Chauvin M.-A. Ji-Cao J. Durand C. Bendridi N. Chanon S. Vieille-Marchiset A. Da Silva C.C. Endoplasmic Reticulum-Mitochondria Miscommunication Is an Early and Causal Trigger of Hepatic Insulin Resistance and Steatosis J. Hepatol. 2022 77 710 722 10.1016/j.jhep.2022.03.017 35358616 109. Li Y. Tian X. Yu Q. Bao T. Dai C. Jiang L. Niu K. Yang J. Wang S. Wu X. Alleviation of Hepatic Insulin Resistance and Steatosis with NMN via Improving Endoplasmic Reticulum–Mitochondria Miscommunication in the Liver of HFD Mice Biomed. Pharmacother. 2024 175 116682 10.1016/j.biopha.2024.116682 38703507 110. Dellinger R.W. Holmes H.E. Hu-Seliger T. Butt R.W. Harrison S.A. Mozaffarian D. Chen O. Guarente L. Nicotinamide Riboside and Pterostilbene Reduces Markers of Hepatic Inflammation in NAFLD: A Double-blind, Placebo-controlled Clinical Trial Hepatology 2023 78 863 877 10.1002/hep.32778 36082508 111. Li D.-J. Sun S.-J. Fu J.-T. Ouyang S.-X. Zhao Q.-J. Su L. Ji Q.-X. Sun D.-Y. Zhu J.-H. Zhang G.-Y. NAD + Theranostics 2021 11 4381 4402 10.7150/thno.53652 33754067 PMC7977447 112. Mukherjee S. Mo J. Paolella L.M. Perry C.E. Toth J. Hugo M.M. Chu Q. Tong Q. Chellappa K. Baur J.A. SIRT3 Is Required for Liver Regeneration but Not for the Beneficial Effect of Nicotinamide Riboside JCI Insight 2021 6 e147193 10.1172/jci.insight.147193 33690226 PMC8119200 113. Lu X. Yang R. Chen Y. Chen D. Evaluating the Therapeutic Efficacy of NAD Supplementation in Management of Metabolic Dysfunction-Associated Steatotic Liver Disease: Key Considerations Clin. Mol. Hepatol. 2024 30 582 584 10.3350/cmh.2023.0555 38163440 PMC11261228 114. Hadefi A. Arvanitakis M. Trépo E. Zelber-Sagi S. Dietary Strategies in Non-alcoholic Fatty Liver Disease Patients: From Evidence to Daily Clinical Practice, a Systematic Review United Eur. Gastroenterol. J. 2023 11 663 689 10.1002/ueg2.12443 PMC10493364 37491835 115. Saavedra Y. Mena V. Priken K. Efecto de La Dieta Mediterránea Sobre Indicadores Histológicos y Pruebas de Imagen En Enfermedad de Hígado Graso No Alcohólico Gastroenterol. Hepatol. 2022 45 350 360 10.1016/j.gastrohep.2021.06.006 34157365 116. Aller R. Izaola O. de la Fuente B. De Luis Román D.A. Mediterranean diet is associated with liver histology in patients with non-alcoholic fatty liver disease Nutr. Hosp. 2015 32 2518 2524 10.3305/nh.2015.32.6.10074 26667698 117. Miryan M. Darbandi M. Moradi M. Najafi F. Soleimani D. Pasdar Y. Relationship between the Mediterranean Diet and Risk of Hepatic Fibrosis in Patients with Non-Alcoholic Fatty Liver Disease: A Cross-Sectional Analysis of the RaNCD Cohort Front. Nutr. 2023 10 1062008 10.3389/fnut.2023.1062008 36908910 PMC9992532 118. Eslam M. Sarin S.K. Wong V.W.-S. Fan J.-G. Kawaguchi T. Ahn S.H. Zheng M.-H. Shiha G. Yilmaz Y. Gani R. The Asian Pacific Association for the Study of the Liver Clinical Practice Guidelines for the Diagnosis and Management of Metabolic Associated Fatty Liver Disease Hepatol. Int. 2020 14 889 919 10.1007/s12072-020-10094-2 33006093 119. Tacke F. Horn P. Wai-Sun Wong V. Ratziu V. Bugianesi E. Francque S. Zelber-Sagi S. Valenti L. Roden M. Schick F. EASL–EASD–EASO Clinical Practice Guidelines on the Management of Metabolic Dysfunction-Associated Steatotic Liver Disease (MASLD) J. Hepatol. 2024 81 492 542 10.1016/j.jhep.2024.04.031 38851997 120. Diaz L.A. Arab J.P. Idalsoaga F. Perelli J. Vega J. Dirchwolf M. Carreño J. Samith B. Valério C. Moreira R.O. Updated Recommendations for the Management of Metabolic Dysfunction-Associated Steatotic Liver Disease (MASLD) by the Latin American Working Group Ann. Hepatol. 2025 30 101903 10.1016/j.aohep.2025.101903 40089151 121. Estruch R. Ros E. Salas-Salvadó J. Covas M.-I. Corella D. Arós F. Gómez-Gracia E. Ruiz-Gutiérrez V. Fiol M. Lapetra J. Retraction and Republication: Primary Prevention of Cardiovascular Disease with a Mediterranean Diet. N Engl J Med 2013;368:1279-90 N. Engl. J. Med. 2018 378 2441 2442 Correction in N. Engl. J. Med. 2018 378 https://doi.org/10.1056/NEJMoa1800389 10.1056/NEJMc1806491 29897867 122. Guasch-Ferré M. Willett W.C. The Mediterranean Diet and Health: A Comprehensive Overview J. Intern. Med. 2021 290 549 566 10.1111/joim.13333 34423871 123. Dayi T. Ozgoren M. Effects of the Mediterranean Diet on the Components of Metabolic Syndrome J. Prev. Med. Hyg. 2022 63 E56 E64 10.15167/2421-4248/jpmh2022.63.2S3.2747 36479500 PMC9710414 124. Nani A. Murtaza B. Sayed Khan A. Khan N.A. Hichami A. Antioxidant and Anti-Inflammatory Potential of Polyphenols Contained in Mediterranean Diet in Obesity: Molecular Mechanisms Molecules 2021 26 985 10.3390/molecules26040985 33673390 PMC7918790 125. Koelman L. Egea Rodrigues C. Aleksandrova K. Effects of Dietary Patterns on Biomarkers of Inflammation and Immune Responses: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Adv. Nutr. 2022 13 101 115 10.1093/advances/nmab086 34607347 PMC8803482 126. Bonaccio M. Costanzo S. Di Castelnuovo A. Gialluisi A. Ruggiero E. De Curtis A. Persichillo M. Cerletti C. Donati M.B. de Gaetano G. Increased Adherence to a Mediterranean Diet Is Associated With Reduced Low-Grade Inflammation after a 12.7-Year Period: Results From the Moli-Sani Study J. Acad. Nutr. Diet. 2023 123 783 795.e7 10.1016/j.jand.2022.12.005 36549563 127. Bettermann E.L. Hartman T.J. Easley K.A. Ferranti E.P. Jones D.P. Quyyumi A.A. Vaccarino V. Ziegler T.R. Alvarez J.A. Higher Mediterranean Diet Quality Scores and Lower Body Mass Index Are Associated with a Less-Oxidized Plasma Glutathione and Cysteine Redox Status in Adults J. Nutr. 2018 148 245 253 10.1093/jn/nxx045 29490099 PMC6251672 128. Tsigalou C. Konstantinidis T. Paraschaki A. Stavropoulou E. Voidarou C. Bezirtzoglou E. Mediterranean Diet as a Tool to Combat Inflammation and Chronic Diseases. An Overview Biomedicines 2020 8 201 10.3390/biomedicines8070201 32650619 PMC7400632 129. Zelicha H. Kloting N. Kaplan A. Yaskolka Meir A. Rinott E. Tsaban G. Chassidim Y. Bluher M. Ceglarek U. Isermann B. The Effect of High-Polyphenol Mediterranean Diet on Visceral Adiposity: The DIRECT PLUS Randomized Controlled Trial BMC Med. 2022 20 327 10.1186/s12916-022-02525-8 36175997 PMC9523931 130. Yaskolka Meir A. Rinott E. Tsaban G. Zelicha H. Kaplan A. Rosen P. Shelef I. Youngster I. Shalev A. Blüher M. Effect of Green-Mediterranean Diet on Intrahepatic Fat: The DIRECT PLUS Randomised Controlled Trial Gut 2021 70 2085 2095 10.1136/gutjnl-2020-323106 33461965 PMC8515100 131. Haigh L. Kirk C. El Gendy K. Gallacher J. Errington L. Mathers J.C. Anstee Q.M. The Effectiveness and Acceptability of Mediterranean Diet and Calorie Restriction in Non-Alcoholic Fatty Liver Disease (NAFLD): A Systematic Review and Meta-Analysis Clin. Nutr. 2022 41 1913 1931 10.1016/j.clnu.2022.06.037 35947894 132. Vazeux-Blumental N. Manicacci D. Tenaillon M. The Milpa, from Mesoamerica to Present Days, a Multicropping Traditional Agricultural System Serving Agroecology C. R. Biol. 2024 347 159 173 10.5802/crbiol.164 39503997 133. Huerta-Álvarez A. Arellano M. Chávez-Méndez C.A. Carpinteyro-Espin P. Palacios-Reyes C. Pérez-Escobar J. Milpa Diet for MASLD in Mesoamerican Populations: Feasibility, Advantages, and Future Perspectives Life 2025 15 812 10.3390/life15050812 40430238 PMC12113525 134. Gulcin İ. Antioxidants and Antioxidant Methods: An Updated Overview Arch. Toxicol. 2020 94 651 715 10.1007/s00204-020-02689-3 32180036 135. Sánchez-Velázquez O.A. Luna-Vital D.A. Morales-Hernandez N. Contreras J. Villaseñor-Tapia E.C. Fragoso-Medina J.A. Mojica L. Nutritional, Bioactive Components and Health Properties of the Milpa Triad System Seeds (Corn, Common Bean and Pumpkin) Front. Nutr. 2023 10 1169675 10.3389/fnut.2023.1169675 37538927 PMC10395131 136. Luo J. Wei Y. Fan Z. Li B. Li L. Chai Y. Xing Z. Qiu Y. Lu W. Fang Z. Gut Microbiota as a Metabolic Mediator to Prevent or Attenuate MASLD Crit. Rev. Food Sci. Nutr. 2025 1 17 10.1080/10408398.2025.2545525 40788876 137. Lau H.C.-H. Zhang X. Yu J. Gut Microbiome in Metabolic Dysfunction-Associated Steatotic Liver Disease and Associated Hepatocellular Carcinoma Nat. Rev. Gastroenterol. Hepatol. 2025 22 619 638 10.1038/s41575-025-01089-1 40624229 138. Chen J. Vitetta L. Gut Microbiota Metabolites in NAFLD Pathogenesis and Therapeutic Implications Int. J. Mol. Sci. 2020 21 5214 10.3390/ijms21155214 32717871 PMC7432372 139. Meadows V. Antonio J.M. Ferraris R.P. Gao N. Ruminococcus Gnavus in the Gut: Driver, Contributor, or Innocent Bystander in Steatotic Liver Disease? FEBS J. 2025 292 1252 1264 10.1111/febs.17327 39589934 PMC11927045 140. Barber T.M. Kabisch S. Pfeiffer A.F.H. Weickert M.O. The Effects of the Mediterranean Diet on Health and Gut Microbiota Nutrients 2023 15 2150 10.3390/nu15092150 37432307 PMC10180651 141. Rinott E. Meir A.Y. Tsaban G. Zelicha H. Kaplan A. Knights D. Tuohy K. Scholz M.U. Koren O. Stampfer M.J. The Effects of the Green-Mediterranean Diet on Cardiometabolic Health Are Linked to Gut Microbiome Modifications: A Randomized Controlled Trial Genome Med. 2022 14 29 10.1186/s13073-022-01015-z 35264213 PMC8908597 Figure 1 Effects of immunonutrients in MASLD pathways. The figure shows the dietary source of each immunonutrient and its effect on decreasing lipid peroxidation, oxidative stress, or inflammation. All immunonutrients are associated with the decrease in oxidative stress; meanwhile, Arg, Gln, polyp, vitamins, inorganic nutrients, and ω-3 are related to decreasing inflammation markers. Gln, BCAA, polyP, vitamins, inorganic nutrients, and ω-3 have also been associated with a decrease in lipid peroxidation. Cys, Cysteine; Arg, Arginine; Gln, Glutamine; polyP, Polyphenols; VitC, Vitamin C; VitE, Vitamin E; Zn, Zinc; ω-3, omega-3 fatty acid. Created in BioRender. Juarez-Hernández, E. (2025). ijms-26-08928-t001_Table 1 Table 1 Dietary sources of immunonutrients. Immunonutrient Foods Cysteine Meat, egg, and whole grains Arginine Meat, fish, nuts, wheat germ, whole grains, soy, and dairy products Glutamine Meat, eggs, fish, dairy products, wheat, tofu, and fermented products BCAA Meat, fish, dairy, eggs Polyphenols Vegetables, fruits, cocoa, legumes, curcuma, green tea, corn, beans, amaranth, chia Vitamin C Citrus fruits, berries, tomatoes, peppers, corn, leafy greens, broccoli, kale, and parsley Vitamin E Vegetable oils (wheat germ, sunflower, corn, soybean), nuts, almonds, peanuts, hazelnuts, green leafy vegetables, broccoli and spinach, kiwi, mango, and fortified cereals Zinc Seafood, beef, pork, chicken, cheese, almonds, sunflowers, pumpkin seeds, and cashews ω-3 fatty acids Flaxseed, canola, and soybean oils, pumpkin seeds, peanuts, chia, avocado, salmon, tuna, sardines, cod, and hake Cysteine Meat, egg, and whole grains Nucleotides Meat, fish, beans, peas, lentil, mushroom ijms-26-08928-t002_Table 2 Table 2 Effects of immunonutrients on MASLD. Type Immunonutrient Year Population Intervention Principal Findings Amino acids Cysteine 2021 32 HFD induced MASLD mice NAC vs. PBS Decrease hepatic TG accumulation 2023 30 SerpinAN3 knock-out MASLD induced mice Induced SerpinAN3 Decrease in leptin and insulin levels Arginine 2015 40 Induced steatohepatitis murine model 500 mg/kg Arginine Decrease levels of lipid peroxidation and TNF-α Glutamine 2014 49 HFD-induced MASLD rats 1 g/kg/day Glutamine Decrease in oxidative stress, TNF-α, and MDA BCAA 2016 54 CDHFD MASLD murine model 0.23 g isoleucine/g Decrease in serum ALT and glucose Polyphenols EGCG 2021 69 Liver cell line and HFD-induced MASLD murine model 50 mg/kg/day EGCG Decrease mitochondrial-dependent apoptosis 2021 70 Fructose + HFD-induced MASLD EGCG low dose (25 mg/kg/day) vs. high dose (50 mg/kg/day) Decrease in serum cholesterol Curcumin 2023 76 HFD-induced MASLD murine model Curcumin supplement Improvement of hepatic endothelial function 2023 66 16 RCTs in MASLD patients Curcumin Decrease in BMI 2024 73 80 MASLD patients 500 mg/day Curcumin vs. placebo Decrease hepatic steatosis (dB/m) Vitamins Vitamin C 2021 79 84 MASLD patients 1000 mg/day of Vitamin C Decrease AST and ALT levels 2022 78 HFD-induced MASLD mice Megadose of Vitamin C Less lobular inflammation and fat accumulation Vitamin E 2010 84 247 NASH patients 800 IU/day of Vitamin E Decrease ALT and AST levels 2024 86 HFD-induced MASLD murine model 200 mg/kg/day of Vitamin E and 200 mg/kg/day of Vitamin E + 50 mg/kg/day of thymol Decrease in AST and ALT levels Trace element Zinc 2023 93 50 MASLD patients 30 mg/day Zinc Gluconate vs. placebo Decrease in AST, LDL, and total cholesterol levels Fatty acids ω-3 2023 101 6561 MASLD patients ω-3 supplementation Decrease in AST, ALT, and GGT levels Nucleotides NAD+ 2021 111 NAFLD murine model NAD+-Boosting supplementation Reversion of liver steatosis NR 2021 112 Hepatocyte-specific SIRT1-ko mice 500 mg/day of NR Hepatic regeneration NMN 2023 110 111 MASLD patients NR+Pterostilbene supplementation Decrease in AST and GGT serum levels 2024 109 HFD SLD induced murine model 500 mg/L od NMN on pure water Improve IR and mitochondrial dysfunction HFD High-Fat Diet; MASLD Metabolic Dysfunction-Associated Steatotic Liver Disease; NAC N-acetyl cysteine; PBS Phosphate-Buffered Saline; TG Triglycerides; ROS Reactive Oxygen Species; PPAR-α Peroxisome Proliferator-Activated Receptor alpha; TNF-α Tumor Necrosis Factor alpha; CYP2E1 Cytochrome P450 2E1; MDA Malondialdehyde; CD Choline Deficient; ALT Alanine Transaminase; EGCG Epigallocatechin gallate; RCT Randomized Clinical Trial; BMI Body Mass Index; AST Aspartate aminotransferase; HbA1c Glycated Hemoglobin; HOMA-IR Homeostasis Model Assessment of Insulin Resistance; MASH Metabolic dysfunction-Associated Steatohepatitis; NAS NAFLD Activity Score; ALP Alkaline Phosphatase, LDL Low-Density Lipoproteins, GGT Gamma-glutamyl Transferase; NAD Nicotinamide Adenine Dinucleotide; NR Nicotinamide Riboside; SIRT1 Sirtuin 1; NMN Nicotinamide Mononucleotide; SLD Steatotic Liver Disease. ",
  "metadata": {
    "Title of this paper": "The Effects of the Green-Mediterranean Diet on Cardiometabolic Health Are Linked to Gut Microbiome Modifications: A Randomized Controlled Trial",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469896/"
  }
}