{
  "title": "Paper_599",
  "abstract": "pmc Support Care Cancer Support Care Cancer 365 springeropen Supportive Care in Cancer 0941-4355 1433-7339 pmc-is-collection-domain yes pmc-collection-title Springer PMC12477073 PMC12477073.1 12477073 12477073 41015967 10.1007/s00520-025-09918-4 9918 1 Research Strategies for premedication and G-CSF application in sacituzumab govitecan treatment of patients with triple-negative breast cancer: multicenter insights Pieniążek Małgorzata pieniadzgosia@interia.pl 1 2 Polakiewicz-Gilowska Anna 3 Kubeczko Marcin 3 Las-Jankowska Manuela 4 5 Pacholczak-Madej Renata 6 7 8 Kilian-Van Miegem Paulina 9 Ziobro Marek 10 Łacko Aleksandra 1 2 Jarząb Michał 3 Püsküllüoğlu Miroslawa miroslawa.puskulluoglu@krakow.nio.gov.pl 10 1 https://ror.org/01qpw1b93 grid.4495.c 0000 0001 1090 049X Department of Oncology, Wrocław Medical University, 2 3 https://ror.org/04qcjsm24 grid.418165.f 0000 0004 0540 2543 Breast Cancer Unit, Gliwice Branch, Maria Skłodowska-Curie National Research Institute of Oncology, 4 https://ror.org/0102mm775 grid.5374.5 0000 0001 0943 6490 Surgical Oncology, Ludwik Rydygier Collegium Medicum in Bydgoszcz, Nicolaus Copernicus University in Torun, 5 6 https://ror.org/03bqmcz70 grid.5522.0 0000 0001 2337 4740 Department of Anatomy, Jagiellonian University Medical College, 7 https://ror.org/04qcjsm24 grid.418165.f 0000 0004 0540 2543 Department of Gynecological Oncology, Maria Sklodowska-Curie National Research Institute of Oncology, 8 9 https://ror.org/03vzf8p77 grid.512053.0 Oncology Center Prof. F. Łukaszczyk in Bydgoszcz, Chemotherapy Outpatient Clinic, 10 https://ror.org/04qcjsm24 grid.418165.f 0000 0004 0540 2543 Department of Clinical Oncology, Kraków Branch, Maria Sklodowska-Curie National Research Institute of Oncology, 28 9 2025 2025 33 10 497747 889 27 5 2025 2 9 2025 28 09 2025 30 09 2025 30 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Sacituzumab govitecan (SG) is approved for advanced triple-negative breast cancer (TNBC) in the second-line setting and beyond, offering improved survival compared to chemotherapy. Adverse events (AEs) commonly include myelosuppression, gastrointestinal disturbances, and hepatic toxicity. Effective premedication and prophylaxis are critical for AE management. This study assessed premedication protocols for SG-treated TNBC patients. Materials and methods A retrospective cohort study across five oncology centers in Poland analyzed premedication regimens for patients completing SG treatment by October 2024. Premedication evaluated included acetaminophen, corticosteroids, antihistamines, 5-HT3 and NK1 receptor antagonists, and granulocyte colony-stimulating factor (G-CSF) when needed. AEs were assessed using National Cancer Institute—Common Terminology Criteria for Adverse Events, version 5.0. Results Among 67 patients with TNBC who finished their treatment with SG, the mean age at SG initiation was 51.5 ± 12.4 years. Premedication in the first cycle included corticosteroids and 5-HT3 receptor antagonists in 66 (99%) and 65 (97%) patients, respectively; acetaminophen in 57 patients (85%), H1 blockers in 53 patients (79%), and H2 blockers in 52 patients (78%). G-CSF was used as primary prophylaxis in 27 patients (40%) and required in 53 patients (79%) during treatment. Atropine premedication was needed in 4 patients (6%) for grade 3 diarrhea as secondary prophylaxis. Conclusions Most patients received standardized premedication regimens, but significant variability was observed in G-CSF use for neutropenia prophylaxis. Only 6% of patients required atropine as diarrhea premedication. Practices regarding the use of G-CSF varied across centers, reflecting evolving SmPC guidance and individual risk-based approaches to neutropenia management. Supplementary Information The online version contains supplementary material available at 10.1007/s00520-025-09918-4. Keywords Sacituzumab govitecan TNBC Premedication G-CSF, neutropenia prevention Adverse events Supportive care pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction Triple-negative breast cancer (TNBC) is one of the most aggressive forms of breast cancer (BC). It lacks the expression of estrogen and progesterone receptors (ER and PR) and shows negative human epidermal growth factor receptor 2 (HER2) status [ 1 2 1 3 SG is an antibody drug conjugate (ADC) that consists of a monoclonal antibody targeting trophoblast cell surface antigen 2 (TROP-2), a hydrolyzable linker, and SN-38, a cytotoxic agent derived from irinotecan, with a drug-to-antibody ratio (DAR) of ~ 7.6. SN-38 acts as a topoisomerase I inhibitor, inducing double-strand DNA damage and apoptosis [ 4 6 4 5 7 6 7 The most common adverse events (AEs) of SG include neutropenia, anemia, diarrhea, nausea, fatigue, and alopecia [ 3 8 12 UGT1A1 6 4 6 The recent Delphi consensus emphasized the need for such observational data to guide clinical management of SG-related toxicities, especially in the absence of standardized guidelines [ 6 Materials and methods Patient selection The study included patients diagnosed with inoperable or metastatic TNBC. TNBC was defined as ER and PR negativity (< 1% nuclear staining) and HER2 status of 0 or 1 + by immunohistochemistry (IHC). In cases with HER2 IHC score of 2 +, confirmation of HER2 negativity by fluorescence in situ hybridization (FISH) was required [ 13 14 Patients were treated within the national reimbursement program for SG, which requires histologically confirmed TNBC, measurable disease per Response Evaluation Criteria in Solid Tumors version 1.1, and good performance status (0–1). Additional eligibility criteria include absence of symptomatic or progressing central nervous system metastases after local therapy, absence of uncontrolled comorbidities, and adequate organ function. Full inclusion and exclusion criteria for the reimbursement access program in Poland are included in Supplementary Materials 1 15 Study design The study was designed as a multicenter, retrospective cohort study, involving data collection from five oncology units across Poland. Patients were required (1) to have completed at least one full cycle of SG (day 1 and 8) and (2) to complete the treatment with SG regardless of the reason (tumor progression, toxicity, death, or patient decision). Both retrospective and prospective data were included, focusing on patients who had completed SG therapy by October 1, 2024. The study adhered to the principles outlined in the Good Reporting of Outcomes in Real-world Evidence Studies (GROW) guidelines. The methodology comprehensively covered essential components of real-world evidence reporting, including study design, population characteristics, data collection methods, approaches to managing missing data, and safety evaluations [ 16 This study aims to evaluate premedication practices for sacituzumab govitecan (SG) therapy across multiple oncology centers in Poland, focusing on commonly used protocols, variation in clinical practice, and the use of G-CSF for neutropenia management. As a secondary objective, the study also examines treatment-related toxicity and modifications in premedication or supportive care during the course of SG therapy. SG dosing and schedule The recommended dose of SG is 10 mg/kg body weight, administered as an intravenous infusion on days 1 and 8 of a 21-day treatment cycle. No patients in this cohort received treatment on a fixed biweekly schedule (e.g., days 1 and 15 every 28 days). Any delays or deviations were transient and related to toxicity or individual clinical circumstances. The infusion was administered over a period of 3 h during the first administration and was shortened to 1–2 h in subsequent cycles if well tolerated [ 17 Premedication protocols As per the SmPC [ 17 G-CSF could be administered prophylactically based on the patient’s neutropenia risk, especially for those with a history of myelosuppression. More data regarding dosing modifications for neutropenia based on SmPC and recently updated characteristics SmPC is presented in Supplementary Materials 2 3 Atropine administration is recommended for patients who experience pronounced cholinergic symptoms, such as abdominal cramping, diarrhea, and excessive salivation. In such cases, atropine may be used to mitigate these adverse effects in subsequent treatment cycles [ 17 Data collection Data were collected on the premedication regimens administered prior to SG treatment, including acetaminophen, corticosteroids, 5-HT3 receptor antagonists, NK1 receptor antagonist, olanzapine, H1 and H2 blockers, and G-CSF (filgrastim or pegfilgrastim) for primary or secondary prophylaxis. The analysis also captured any modifications made to the premedication protocols during subsequent treatment cycles. Additionally, data included baseline demographic and clinical characteristics such as patient age, sex, performance status, histological diagnosis, metastatic sites, BRCA Some of the data, particularly eligibility criteria and key laboratory results, were collected prospectively within the framework of routine documentation required for SG reimbursement. Additional clinical variables, including details of premedication and supportive care, were extracted retrospectively by physician investigators. Premedication practices were not standardized across institutions and were determined individually by the treating physicians. For missing data, source documentation was reviewed when available; otherwise, such cases were explicitly noted. Statistical considerations The statistical analysis aimed to describe premedication strategies and supportive care practices. Descriptive statistics were used to summarize baseline patient characteristics, treatment patterns, and the incidence of adverse events. Continuous variables, such as patient age, were presented as means with standard deviations or medians with interquartile ranges, as appropriate. Categorical variables, including premedication regimens, were reported as counts and percentages. All statistical analyses were performed using validated software, with a focus on data accuracy and clarity in reporting treatment patterns and safety outcomes. Ethical considerations This study was approved by the ethical committees of the Maria Sklodowska-Curie National Research Institute of Oncology in Krakow (2/2023, 18 April 2023) and Warsaw (21/2024, 22 February 2024). All procedures involving human participants complied with institutional regulations and the ethical principles of the 1964 Helsinki Declaration and its amendments. Written informed consent was obtained from all patients before initiating sacituzumab govitecan treatment under the national reimbursement program. Ethical approval confirmed that consent for retrospective data collection was not required. Results Population characteristics Eighty-six female patients with TNBC had SG initiated within 5 oncology centers by 30 September 2024. Sixty-seven patients who had completed treatment with SG were included into analysis. At the initiation of SG therapy, their mean age was 51.5 years, accompanied by a standard deviation of 12.4 years (range: 24.6–71.2 years). The Ki-67 index had a mean of 57.3% ± 25.2% (range: 5–100%; n 1 Table 1 Patient characteristics Parameter Total ( N Disease stage at initial diagnosis De novo metastatic 10 (15%) Early-stage 57 (85%) Comorbidities* No 39 (58%) Yes 28 (42%) Menopausal status Premenopausal 22 (33%) Postmenopausal 45 (67%) Site of metastatic disease at SG initiation Lymph nodes 54 (81%) Lungs 36 (54%) Bones 28 (42%) Skin/subcutaneous tissue 27 (40%) Liver 22 (33%) Malignant effusion 9 (13%) Brain 7 (10%) Other 6 (9%) *Comorbidities requiring active management and deemed clinically significant by the treating physician Systemic treatment characteristics Patients received a median of 2 treatment lines in palliative setting prior to SG initiation. 33 patients (49%) had received SG in the second line of palliative treatment, 24 (36%) after two prior lines, 4 (6%) after three lines, 4 (6%) after four lines, and one patient each (1%) after five and six lines, respectively. Majority of patients received systemic treatment in (neo)adjuvant setting as presented in Table 2 Table 2 Characteristics of treatment received prior to SG treatment Parameter Total ( N (Neo)adjuvant systemic treatment type ( N Cytotoxic agents 55 (82%) Pembrolizumab 2 (3%) Hormonal therapy 10 (15%) Anti-HER2 agents 4 (6%) Parameter Total ( N Cytotoxic agents 55 (82%) (Neo)adjuvant systemic treatment type ( N Pembrolizumab 2 (3%) Hormonal therapy 10 (15%) Anti-HER2 agents 4 (6%) Surgery in early-stage setting Yes 51 (76%) Radiotherapy in early-stage setting Yes 43 (64%) Palliative systemic therapy Anthracycline-based 17 (25%) Taxane-based 26 (39%) Platinum-based 34 (51%) Capecitabine 20 (30%) Gemcitabine 17 (25%) Vinorelbine 10 (15%) Hormonal therapy 6 (9%) Anti-HER2 agents 0 (0%) Pembrolizumab 4 (6%) PARP inhibitors 3 (4%) Other agents 15 (22%) AE grade 2 or more of any previous systemic treatment Cardiac toxicity 1 (1%) Diarrhea 6 (9%) Vomiting 9 (13%) Nausea 10 (15%) Hypersensitivity reactions 2 (3%) Increased ALT/AST 16 (24%) Anemia 23 (34%) Thrombocytopenia 9 (13%) Neutropenia 26 (39%) Neutropenic fever 1 (1%) *Patient could receive more than one agent AE ALT/AST BC HER2 PARP Treatment tolerance and toxicity The most common grade 3 or higher toxicity was neutropenia with median time of occurrence on day 1 of cycle 2 (see Table 3 Table 3 Sacituzumab govitecan treatment safety data Parameter Any grade ( N Grade 3 or higher ( N Diarrhea 9 (13%) 3 (4%) Vomiting 2 (3%) 0 (0%) Nausea 7 (10%) 1 (1%) Increased ALT or AST 13 (19%) 3 (4%) Anemia 30 (45%) 8 (12%) Platelet count decrease 10 (15%) 3 (6%) Neutropenia 45 (67%) 33 (49%) Neutropenic fever 2 (3%) 2 (3%) Hypersensitivity reactions ND 1 (2%)  AE ALT/AST ND Premedication strategies within first cycle During the first treatment cycle, 57 patients (85%) received 1 g of intravenous acetaminophen. Steroids, primarily 8 mg of intravenous dexamethasone, were administered to 66 patients (99%), and 5-HT3 receptor antagonists, most commonly 8 mg of intravenous ondansetron, were given to 65 patients (97%). H1 blockers, such as 2 mg of intravenous clemastine, were administered to 53 patients (79%), while H2 blockers, primarily 40 mg of oral famotidine, were provided to 52 patients (78%). These data are summarized in Table 4 Table 4 Premedication agents administered during the first cycle of sacituzumab govitecan treatment Premedication type Drug Dose No. of patients % of patients Antipyretic Acetaminophen 1 g 57 85% Steroid (antiemetic) Dexamethasone 8 mg 12 mg* 65 1 97% 1% 5-HT3 receptor antagonist (antiemetic) Ondansetron ND 8 mg ND 63 2 94% 3% NK1 receptor antagonist (antiemetic) Aprepitant 125 + 80 + 80 mg 1 1% Dopamine antagonist (antiemetic) Metoclopramide 10 mg 1 1% Atypical antipsychotic (antiemetic) Olanzapine 5 mg 1 1% H1 blocker** (antiallergic) ND ND 53 79% H2 blocker*** (antiallergic) ND ND 52 78% *12 mg day 1, and 8 mg in subsequent days for patient that received aprepitant *2 mg of iv clemastine as per local standards in all centers, but data for every patient were not collected **40 mg of oral famotidine as per local standards in all centers, but data for every patient were not collected  5-HT3 H1 H2 ND Premedication strategies within subsequent cycles Three patients had acetaminophen added during subsequent cycles, while 7 patients (10%) did not receive acetaminophen throughout the entire treatment. One patient (1%) did not receive steroids at any point. Two additional patients (3%) required iv H1 blockers in later cycles, including one due to a hypersensitivity reaction, and one additional patient (1%) needed oral H2 blockers in subsequent cycles. The use of 5-HT3 antagonists increased slightly to 66 patients (99%) during subsequent cycles. Four patients (6%) required the initiation of an oral NK1 receptor antagonist (in 3 aprepitant, standard doses for 3 days; in one patient, a fixed-dose combination of netupitant 300 mg/palonosetron 0.5 mg was added; consequently, ondansetron was discontinued in this patient). Additionally, four patients required oral olanzapine (5–10 mg) and two oral metoclopramide (10 mg) in later cycles to manage persistent nausea. Granulocyte colony-stimulating factor use During treatment, 53 patients (79%) received G-CSF, either as primary (27 patients, 40%) or secondary (26 patients, 39%) prophylaxis. Among those receiving primary prophylaxis, G-CSF regimens included: Pegfilgrastim or lipegfilgrastim after day 8 (7 patients, 10%) Filgrastim between days 1 and 8, followed by pegfilgrastim or lipegfilgrastim after day 8 (6 patients, 9%) Filgrastim only after day 8 (8 patients, 12%) Filgrastim both between days 1–8 and after day 8 (6 patients, 9%) In the secondary prophylaxis group, 3 patients (4%) received pegfilgrastim or lipegfilgrastim, and 23 patients (34%) were treated with filgrastim. Filgrastim was typically administered for a median of 4 consecutive days starting on day 2 or 3, and for 5 consecutive days starting on day 9 or 10. Pegfilgrastim or lipegfilgrastim was given as a single dose on day 9 or 10. G-CSF was most often initiated due to a history of neutropenia or febrile neutropenia during prior treatment lines. In subsequent cycles, the leading indication for G-CSF use was grade 3 neutropenia, most commonly occurring after day 1 of cycle 2. Diarrhea management Atropine was not used as a preventive measure in any patient during the first cycle. However, 4 patients (6%) required it before subsequent cycles due to the development of grade 3 diarrhea. Although symptomatic management with antidiarrheal agents was commonly applied later in treatment, detailed data on specific medications, such as loperamide, were not captured in a standardized manner and are not included in this analysis. Discussion The phase 3 ASCENT trial demonstrated a significant clinical benefit of SG in heavily pretreated metastatic TNBC, improving both progression-free and overall survival compared to standard chemotherapy. However, its use is linked to AEs, including myelosuppression, gastrointestinal toxicity (diarrhea, vomiting), and liver enzyme elevations [ 3 3 8 9 18 20 21 23 There are some differences in the reporting of safety data for grade 3 or higher AEs as per CTCAE v. 5.0 in published RWSs and the ASCENT trial. These differences pertain not only to the frequency of various AEs reported but also to the methods used for reporting this data [ 3 8 9 18 20 3 8 18 20 3 8 3 3 8 12 18 Effectively managing these AEs is crucial for maintaining the balance between treatment efficacy and patient health-related quality of life. Premedication protocols involving agents such as corticosteroids, acetaminophen, antihistamines, and granulocyte colony-stimulating factors (G-CSF) are typically employed to prevent or mitigate AEs. Although some recommendations may appear straightforward [ 24 6 The PRIMED was an open-label, single-arm, phase II study designed to assess whether primary prophylaxis with G-CSF and loperamide could improve the tolerability of SG [ 25 According to the most recent NCCN guidelines, SG has been added to the list of regimens with an intermediate risk for febrile neutropenia (10–20%) [ 26 26 G-CSF administration schedules vary across guidelines and clinical protocols, particularly for regimens, where the cytotoxic agent is administered on days 1 and 8. In the PRIMED study, primary prophylaxis involved filgrastim on days 3, 4, 10, and 11 [ 25 6 26 26 In terms of gastrointestinal toxicity, the need for atropine to manage diarrhea was limited, indicating that diarrhea associated with SG is generally well-controlled with conventional antidiarrheals, although close monitoring remains essential. In our cohort, no patient received atropine as primary prophylaxis, and only 6% required atropine prior to subsequent cycles due to the development of grade 3 diarrhea. Grade 3 or higher diarrhea was observed in 5% of patients and was well managed with standard antidiarrheal treatment. In a pooled safety analysis of 1063 patients across four studies involving various epithelial tumors, including IMMU-132-01, ASCENT, TROPiCS-02, and TROPHY-U-01, grade 3 or higher diarrhea occurred in 11% of patients, and 20% received atropine [ 27 6 According to the recent European Society For Medical Oncology-Multinational Association for Supportive Care in Cancer guideline update for the prevention of chemotherapy-induced nausea and vomiting, SG is considered to be an agent at the higher end of the moderate emetogenic risk category, analogous to carboplatin area under curve (AUC) ≥ 5 [ 28 29 6 3 3 The most clinically significant toxicities are those that interfere with the ability to maintain adequate treatment intensity. In our cohort, one in four patients (25%) required at least one dose reduction, primarily due to neutropenia. Adverse events leading to permanent treatment discontinuation were infrequent, with only two patients (3%) discontinuing therapy due to toxicity. These findings are consistent with the ASCENT trial, where 22% of patients required dose reductions and treatment discontinuation due to adverse events occurred in five patients [ 3 6 Adequate prophylaxis against hypersensitivity reactions is essential when administering SG. In the ASCENT trial, any-grade hypersensitivity events occurring within 24 h of dosing were reported in 34% of patients, with grade 3 or higher events occurring in 1.7% [ 3 27 The data from this multicenter cohort study provide important insights into premedication practices for sacituzumab govitecan treatment in TNBC patients. Consistent with current guidelines, the majority of patients received a standard regimen of acetaminophen, corticosteroids, and 5-HT3 antagonists prior to their SG infusions. The need for G-CSF, however, showed considerable variation between centers, with a high proportion of patients eventually requiring this intervention for either primary or secondary prophylaxis. Study limitations This study has several limitations that warrant careful consideration when interpreting the findings. As an observational, multicenter analysis based on real-world data, it is inherently subject to variability in institutional practices and clinical judgment, which may influence the consistency and reproducibility of supportive care patterns observed. While the high rate of G-CSF use appears clinically plausible given the known toxicity profile of SG, this outcome should not be overinterpreted as confirmatory evidence in the absence of standardized protocols or controlled comparison. The retrospective nature of data collection may also introduce recall bias, and the relatively small sample size limits generalizability. Variability in treatment practices across multiple oncology centers, particularly regarding G-CSF administration and premedication strategies, could influence the findings. Data regarding antidiarrheal management were limited to atropine prophylaxis, as the use of agents such as loperamide was not systematically recorded. Additionally, the focus on short-term AEs without long-term follow-up data prevents evaluation of sustained outcomes such as overall survival. Data on potential de-escalation of premedication in subsequent cycles were not systematically collected, which may limit the interpretation of longitudinal supportive care practices. The inclusion of patients with diverse metastatic involvement and prior treatment histories adds heterogeneity, while the absence of genetic and biomarker analysis, such as UGT1A1 genotyping, limits the ability to identify patients at increased risk for toxicities. However, the Delphi panel did not recommend routine UGT1A1 testing, although closer monitoring was advocated in known *28/*28 homozygotes due to higher rates of severe hematologic and gastrointestinal toxicities [ 6 Clinical considerations The findings from this multicenter study provide important insights into supportive care strategies during SG treatment in patients with TNBC. The observed heterogeneity in G-CSF use reflects the absence of unified national recommendations during the study period. At that time, decisions regarding prophylaxis were based on institutional protocols and clinical judgment. While some centers limited G-CSF use to reactive indications following neutropenic events, others implemented primary prophylaxis in selected high-risk patients. The recently updated SmPC (June 2025) formally endorses such an approach, offering a regulatory framework that aligns with several of the previously observed practices. This update, discussed in detail in Supplementary Materials 3 G-CSF use: Early G-CSF initiation by the second cycle day 1 suggests significant myelosuppression, highlighting the need for standardized primary prophylaxis protocols to prevent treatment delays. Atropine for diarrhea management: Limited use of atropine despite its established role in managing cholinergic toxicity suggests the need for clearer recommendations for gastrointestinal prophylaxis. Biomarker-based risk stratification: The absence of UGT1A1 genotyping, despite its relevance in predicting severe neutropenia, reflects a gap in personalized supportive care. Conclusion Premedication regimens for SG in patients with TNBC are generally uniform. The majority of patients received acetaminophen, histamine H1 and H2 receptor antagonists, corticosteroids, and 5-HT3 receptor antagonists as part of their premedication regimen. Adverse events linked with SG treatment are well documented, resulting in similar prophylactic measures for most patients. However, there was notable variability in the administration of G-CSF for both primary and secondary prophylaxis, with numerous patients requiring its initiation as early as the second treatment cycle. Furthermore, only a limited number of patients required atropine for secondary prophylaxis against diarrhea. Our findings, although limited by their retrospective nature, are broadly consistent with expert recommendations, which emphasize personalized G-CSF and antiemetic strategies, close monitoring for neutropenia in high-risk patients, and the need for further prospective evidence to refine supportive care in SG-treated TNBC [ 6 Supplementary Information Below is the link to the electronic supplementary material. ESM 1 (DOCX 21.4 KB) Abbreviations AE Adverse event ALT/AST Aminotransferase/aspartate aminotransferase BC Breast cancer HER2 Human epidermal growth factor receptor 2 PARP Poly (ADP-ribose) polymerase 5-HT3 5-hydroxytryptamine type 3 receptor H1 Histamine type 1 receptor H2 Histamine type 2 receptor ND No data Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contribution M.Pi. and M.P. jointly conceptualized and designed the study. All authors contributed to data acquisition or database coordination. M.Pi. performed all statistical analyses. Ethical approval procedures were coordinated by M.Pi. and M.Z. The initial draft of the manuscript was prepared by M.Pi., with specific contributions from M.P., R.P.M., and M.K. All authors critically reviewed, revised, and approved the final version of the manuscript. Funding The authors declare that no financial support, grant, or other form of funding was received for the conduct of this study, the preparation of the manuscript, or the decision to submit it for publication. Data availability The datasets generated and analyzed during the current study are available from the corresponding author on reasonable request. Declarations Conflict of interest M.Pi. received travel support and lecture fees from Pfizer and Novartis; lecture fees from Gilead; and participated in an advisory board for Novartis. A.P.G. received lecture honoraria and travel support from AstraZeneca, Roche, Novartis, Eli Lilly, Swixx Biopharma, Gilead, and Pfizer. M.K. served on advisory boards for Novartis; received speaker’s fees and conference support from Novartis, Roche, MSD, Pfizer, Eli Lilly, Teva, Amgen, Swixx Biopharma, AstraZeneca, and Gilead; participated in clinical trials sponsored by Roche, MSD, Novartis, Seagen, and Gilead. M.L.J. declares no conflicts of interest. R.P.M. received travel support from Accord, GSK, and BMS; and lecture honoraria from BMS. P.K.V.M. declares no conflicts of interest. M.Z. received travel grants and speaker’s honoraria from Pierre Fabre, Novartis, and Ipsen. A.Ł. received honoraria and support from AstraZeneca, Pfizer, Novartis, Eli Lilly, Roche, and Gilead Sciences, including advisory board participation. M.J. received conference support from Gilead and Roche; speaker’s fees from Novartis, Roche, Eli Lilly, Pfizer, Teva, Exact Sciences, and Mammotome; and served on advisory boards for Novartis and Pfizer. M.Pu. received travel grants and lecture honoraria from AstraZeneca, Roche, Novartis, Eli Lilly, Janssen, Gilead, and Amgen. References 1. Cardoso F Paluch-Shimon S Schumacher-Wulf E 6th and 7th international consensus guidelines for the management of advanced breast cancer (ABC guidelines 6 and 7) Breast 2024 76 103756 10.1016/J.BREAST.2024.103756 38896983 PMC11231614 Cardoso F, Paluch-Shimon S, Schumacher-Wulf E et al (2024) 6th and 7th international consensus guidelines for the management of advanced breast cancer (ABC guidelines 6 and 7). Breast 76:103756. 10.1016/J.BREAST.2024.103756 38896983 10.1016/j.breast.2024.103756 PMC11231614 2. Breast Cancer - Guidelines Detail. https://www.nccn.org/guidelines/guidelines-detail?category=1andid=1419 3. Bardia A Hurvitz SA Tolaney SM Sacituzumab govitecan in metastatic triple-negative breast cancer N Engl J Med 2021 384 1529 1541 10.1056/NEJMOA2028485 33882206 Bardia A, Hurvitz SA, Tolaney SM et al (2021) Sacituzumab govitecan in metastatic triple-negative breast cancer. N Engl J Med 384:1529–1541. 10.1056/NEJMOA2028485 33882206 10.1056/NEJMoa2028485 4. Jiang Y Zhou H Liu J Progress and innovative combination therapies in Trop-2-targeted ADCs Pharmaceuticals (Basel) 2024 10.3390/PH17050652 38794221 PMC11125602 Jiang Y, Zhou H, Liu J et al (2024) Progress and innovative combination therapies in Trop-2-targeted ADCs. Pharmaceuticals (Basel). 10.3390/PH17050652 38794221 10.3390/ph17050652 PMC11125602 5. Sakach E Sacks R Kalinsky K Trop-2 as a therapeutic target in breast cancer Cancers (Basel) 2022 10.3390/CANCERS14235936 36497418 PMC9735829 Sakach E, Sacks R, Kalinsky K (2022) Trop-2 as a therapeutic target in breast cancer. Cancers (Basel). 10.3390/CANCERS14235936 36497418 10.3390/cancers14235936 PMC9735829 6. Valsecchi AA Pisegna S Antonuzzo A Delphi consensus on the management of adverse events in patients with metastatic triple-negative breast cancer treated with sacituzumab govitecan Oncologist 2025 30 oyaf088 10.1093/ONCOLO/OYAF088 40366333 PMC12076644 Valsecchi AA, Pisegna S, Antonuzzo A et al (2025) Delphi consensus on the management of adverse events in patients with metastatic triple-negative breast cancer treated with sacituzumab govitecan. Oncologist 30:oyaf088. 10.1093/ONCOLO/OYAF088 40366333 10.1093/oncolo/oyaf088 PMC12076644 7. Püsküllüoğlu M Rudzińska A Pacholczak-Madej R Antibody-drug conjugates in HER-2 negative breast cancers with poor prognosis Biochimica et Biophysica Acta (BBA) 2023 10.1016/j.bbcan.2023.188991 37758021 Püsküllüoğlu M, Rudzińska A, Pacholczak-Madej R (2023) Antibody-drug conjugates in HER-2 negative breast cancers with poor prognosis. Biochimica et Biophysica Acta (BBA). 10.1016/j.bbcan.2023.188991 10.1016/j.bbcan.2023.188991 37758021 8. Püsküllüoğlu M Pieniążek M Las-Jankowska M Sacituzumab govitecan for second and subsequent line palliative treatment of patients with triple-negative breast cancer: a Polish real-world multicenter cohort study Oncol Ther 2024 10.1007/s40487-024-00307-1 39331319 PMC11573939 Püsküllüoğlu M, Pieniążek M, Las-Jankowska M et al (2024) Sacituzumab govitecan for second and subsequent line palliative treatment of patients with triple-negative breast cancer: a Polish real-world multicenter cohort study. Oncol Ther. 10.1007/s40487-024-00307-1 39331319 10.1007/s40487-024-00307-1 PMC11573939 9. Singh V Dhaibar H Peddi P Real-world outcomes of sacituzumab govitecan in breast cancer J Clin Oncol 2024 42 e13137 e13137 10.1200/JCO.2024.42.16_SUPPL.E13137 Singh V, Dhaibar H, Peddi P (2024) Real-world outcomes of sacituzumab govitecan in breast cancer. J Clin Oncol 42:e13137–e13137. 10.1200/JCO.2024.42.16_SUPPL.E13137 10. Alaklabi S Roy AM Zagami P Real-world clinical outcomes with Sacituzumab Govitecan in metastatic triple-negative breast cancer JCO Oncol Pract 2024 10.1200/OP.24.00242 39353151 PMC12165508 Alaklabi S, Roy AM, Zagami P et al (2024) Real-world clinical outcomes with Sacituzumab Govitecan in metastatic triple-negative breast cancer. JCO Oncol Pract. 10.1200/OP.24.00242 39353151 10.1200/OP.24.00242 PMC12165508 11. Spring LM Nakajima E Hutchinson J Sacituzumab govitecan for metastatic triple-negative breast cancer: clinical overview and management of potential toxicities Oncologist 2021 26 827 834 10.1002/ONCO.13878 34176192 PMC8488774 Spring LM, Nakajima E, Hutchinson J et al (2021) Sacituzumab govitecan for metastatic triple-negative breast cancer: clinical overview and management of potential toxicities. Oncologist 26:827–834. 10.1002/ONCO.13878 34176192 10.1002/onco.13878 PMC8488774 12. Hanna D, Merrick S, Ghose A et al (2024) Real world study of sacituzumab govitecan in metastatic triple-negative breast cancer in the United Kingdom. Br J Cancer 5. 10.1038/s41416-024-02685-9 10.1038/s41416-024-02685-9 PMC11183215 38658782 13. Hammond MEH Hayes DF Dowsett M American Society of Clinical Oncology/College Of American Pathologists guideline recommendations for immunohistochemical testing of estrogen and progesterone receptors in breast cancer J Clin Oncol 2010 28 2784 2795 10.1200/JCO.2009.25.6529 20404251 PMC2881855 Hammond MEH, Hayes DF, Dowsett M et al (2010) American Society of Clinical Oncology/College Of American Pathologists guideline recommendations for immunohistochemical testing of estrogen and progesterone receptors in breast cancer. J Clin Oncol 28:2784–2795. 10.1200/JCO.2009.25.6529 20404251 10.1200/JCO.2009.25.6529 PMC2881855 14. Wolff AC Hammond MEH Allison KH Human epidermal growth factor receptor 2 testing in breast cancer: American society of clinical oncology/college of American pathologists clinical practice guideline focused update J Clin Oncol 2018 36 2105 2122 10.1200/JCO.2018.77.8738 29846122 Wolff AC, Hammond MEH, Allison KH et al (2018) Human epidermal growth factor receptor 2 testing in breast cancer: American society of clinical oncology/college of American pathologists clinical practice guideline focused update. J Clin Oncol 36:2105–2122. 10.1200/JCO.2018.77.8738 29846122 10.1200/JCO.2018.77.8738 15. Programy lekowe | Ministerstwo Zdrowia. https://archiwum.mz.gov.pl/leki/refundacja/programy-lekowe/ 16. Castelo-Branco L Pellat A Martins-Branco D ESMO Guidance for Reporting Oncology real-World evidence (GROW) Ann Oncol 2023 34 1097 1112 10.1016/J.ANNONC.2023.10.001/ATTACHMENT/1DE7E9A7-7499-484F-A53B-2901B1714FBA/MMC1.DOCX 37848160 Castelo-Branco L, Pellat A, Martins-Branco D et al (2023) ESMO Guidance for Reporting Oncology real-World evidence (GROW). Ann Oncol 34:1097–1112. 10.1016/J.ANNONC.2023.10.001/ATTACHMENT/1DE7E9A7-7499-484F-A53B-2901B1714FBA/MMC1.DOCX 37848160 10.1016/j.annonc.2023.10.001 17. European Medicines Agency. Trodelvy (sacituzumab govitecan) summary of product characteristics. EMA; 2025. Available at: https://www.ema.europa.eu/en/medicines/human/EPAR/trodelvy 18. Reinisch M Bruzas S Spoenlein J Safety and effectiveness of sacituzumab govitecan in patients with metastatic triple-negative breast cancer in real-world settings: first observations from an interdisciplinary breast cancer centre in Germany Ther Adv Med Oncol 2023 15 17588359231200454 10.1177/17588359231200454 37789989 PMC10542232 Reinisch M, Bruzas S, Spoenlein J et al (2023) Safety and effectiveness of sacituzumab govitecan in patients with metastatic triple-negative breast cancer in real-world settings: first observations from an interdisciplinary breast cancer centre in Germany. Ther Adv Med Oncol 15:17588359231200454. 10.1177/17588359231200454 37789989 10.1177/17588359231200454 PMC10542232 19. Caputo R Buono G Piezzo M Sacituzumab govitecan for the treatment of advanced triple negative breast cancer patients: a multi-center real-world analysis Front Oncol 2024 14 1362641 10.3389/FONC.2024.1362641 38595817 PMC11002149 Caputo R, Buono G, Piezzo M et al (2024) Sacituzumab govitecan for the treatment of advanced triple negative breast cancer patients: a multi-center real-world analysis. Front Oncol 14:1362641. 10.3389/FONC.2024.1362641 38595817 10.3389/fonc.2024.1362641 PMC11002149 20. De Moura A Loirat D Vaillant S Sacituzumab govitecan in metastatic triple-negative breast cancer patients treated at Institut Curie hospitals: efficacy, safety, and impact of brain metastases Breast Cancer 2024 31 572 580 10.1007/S12282-024-01565-7 38600429 PMC11194191 De Moura A, Loirat D, Vaillant S et al (2024) Sacituzumab govitecan in metastatic triple-negative breast cancer patients treated at Institut Curie hospitals: efficacy, safety, and impact of brain metastases. Breast Cancer 31:572–580. 10.1007/S12282-024-01565-7 38600429 10.1007/s12282-024-01565-7 PMC11194191 21. Sacituzumab Govitecan Improves PFS in Metastatic TNBC. https://www.targetedonc.com/view/sacituzumab-govitecan-improves-pfs-in-metastatic-tnbc 22. Tolaney SM, de Azambuja E, Kalinsky K et al (2025) Sacituzumab govitecan (SG) + pembrolizumab (pembro) vs chemotherapy (chemo) + pembro in previously untreated PD-L1–positive advanced triple-negative breast cancer (TNBC): primary results from the randomized phase 3 ASCENT-04/KEYNOTE-D19 study. J Clin Oncol 43:. 10.1200/JCO.2025.43.17_SUPPL.LBA109 23. Bardia A Punie K Barrios CH 275TiP ASCENT-03: Phase III study of sacituzumab govitecan (SG) vs treatment of physician’s choice (TPC) in first-line (1L) metastatic triple-negative breast cancer (mTNBC) Ann Oncol 2022 33 S663 S664 10.1016/j.annonc.2022.07.1859 Bardia A, Punie K, Barrios CH et al (2022) 275TiP ASCENT-03: Phase III study of sacituzumab govitecan (SG) vs treatment of physician’s choice (TPC) in first-line (1L) metastatic triple-negative breast cancer (mTNBC). Ann Oncol 33:S663–S664. 10.1016/j.annonc.2022.07.1859 24. J. Fleming Jr., PharmD, BCOP P, Karpio, PharmD candidate S, Lombardo, PharmD candidate N (2021) Sacituzumab govitecan for treatment of refractory triple-negative metastatic breast cancer. J Adv Pract Oncol 12:. 10.6004/jadpro.2021.12.7.8 10.6004/jadpro.2021.12.7.8 PMC8504932 34671504 25. Pérez García JM Gión M Ruiz-Borrego M Prevention of sacituzumab govitecan (SG)-related neutropenia and diarrhea in patients (pts) with triple-negative or HR+/HER2- advanced breast cancer (ABC; PRIMED): A phase 2 trial J Clin Oncol 2024 42 1101 1101 10.1200/JCO.2024.42.16_SUPPL.1101 Pérez García JM, Gión M, Ruiz-Borrego M et al (2024) Prevention of sacituzumab govitecan (SG)-related neutropenia and diarrhea in patients (pts) with triple-negative or HR+/HER2- advanced breast cancer (ABC; PRIMED): A phase 2 trial. J Clin Oncol 42:1101–1101. 10.1200/JCO.2024.42.16_SUPPL.1101 26. Hematopoietic Growth Factors - Guidelines Detail. https://www.nccn.org/guidelines/guidelines-detail?category=3andid=1493 27. Rugo HS Tolaney SM Bardia A Pooled safety analysis of sacituzumab govitecan (SG) in multiple solid tumor types J Clin Oncol 2024 42 Suppl 16 3029 3029 10.1200/JCO.2024.42.16_SUPPL.3029 Rugo HS, Tolaney SM, Bardia A et al (2024) Pooled safety analysis of sacituzumab govitecan (SG) in multiple solid tumor types. J Clin Oncol 42(Suppl 16):3029–3029. 10.1200/JCO.2024.42.16_SUPPL.3029 28. Herrstedt J Clark-Snow R Ruhlmann CH 2023 MASCC and ESMO guideline update for the prevention of chemotherapy- and radiotherapy-induced nausea and vomiting ESMO Open 2024 9 102195 10.1016/J.ESMOOP.2023.102195 38458657 PMC10937211 Herrstedt J, Clark-Snow R, Ruhlmann CH et al (2024) 2023 MASCC and ESMO guideline update for the prevention of chemotherapy- and radiotherapy-induced nausea and vomiting. ESMO Open 9:102195. 10.1016/J.ESMOOP.2023.102195 38458657 10.1016/j.esmoop.2023.102195 PMC10937211 29. Antiemesis - Guidelines Detail. https://www.nccn.org/guidelines/guidelines-detail?category=3&id=1415 ",
  "metadata": {
    "Title of this paper": "2023 MASCC and ESMO guideline update for the prevention of chemotherapy- and radiotherapy-induced nausea and vomiting",
    "Journal it was published in:": "Supportive Care in Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477073/"
  }
}