{
  "title": "Paper_7",
  "abstract": "pmc Acta Stomatol Croat Acta Stomatol Croat 3005 ascroat ASC Acta Stomatologica Croatica 0001-7019 1846-0410 University of Zagreb: School of Dental Medicine PMC12490671 PMC12490671.1 12490671 12490671 10.15644/asc59/3/1 ASC_59-3_226-235 1 Original Scientific Papers Prevalence of Glutathione-S-Transferase T and M Deletion Polymorphisms in Apical Periodontitis: a Two-Center Observational Study https://orcid.org/0000-0002-0369-2845 Kadic Mirsad  1  2 https://orcid.org/0000-0002-8513-9313 Nikolic Nadja  3 https://orcid.org/0000-0002-1014-7589 Carkic Jelena  3 https://orcid.org/0009-0000-7544-822X Kadic Pirovic Anesa  2 https://orcid.org/0000-0001-9169-5415 Beljic Ivanovic Katarina  4 https://orcid.org/0000-0003-4136-7901 Andric Miroslav  5 https://orcid.org/0000-0003-4808-703X Hadziabdic Naida  6 https://orcid.org/0009-0009-3650-4642 Djukic Igor  7 https://orcid.org/0000-0001-6512-4934 Jakovljevic Aleksandar  3  8 1 2 3 4 5 6 7 8 Address for correspondence: Aleksandar Jakovljevic, DDS, PhD, Department of Pathophysiology, School of Dental Medicine, University of Belgrade, Serbia, Dr Subotica Street, no.8, 11000 Belgrade, Serbia, Phone: +381112685288, E-mail: a.jakovljevic@stomf.bg.ac.rs Author’s contribution: 9 2025 9 2025 59 3 498205 226 235 02 6 2025 14 8 2025 01 09 2025 03 10 2025 03 10 2025 University of Zagreb School of Dental Medicine 2025 University of Zagreb School of Dental Medicine https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution Non-Commercial No Derivatives (CC BY-NC-ND) 4.0 License. Objectives The primary objective of this study was to examine the potential association between glutathione S-transferases ( GSTT1/GSTM1 Materials and Methods The study involved 200 patients with AP in the experimental and 250 healthy individuals without AP in the control group. As a source of genomic DNA, sterile buccal swabs were taken from each patient. Genotyping of GSTM1 GSTT1 Results There were significant differences in demographic characteristics between the investigated groups (p = 0.446, p = 0.154, respectively). GSTM1 GSTT1 Conclusions The carriers of null GSTT GSTM GSTT/GSTM Key words: Periapical Periodontitis Genetic Polymorphisms Glutathione S-Transferase MeSH Terms: Genetic Polymorphism Glutathione S-Transferase pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Apical periodontitis (AP) represents a local and systemic inflammatory response of the body to various stimuli that compromise the vitality of the dental pulp, ultimately leading to its necrosis ( 1 2 3 2 4 5 8 9 The pathogenesis of AP is a complex process characterized by overlapping signaling pathways and inflammatory mediators that drive progressive bone resorption in the periapical region of the affected tooth. Central to this alveolar bone resorption is a definitive bidirectional relationship between multiple etiological factors and the response of the host's immune system ( 10 11 12 13 Numerous investigations have highlighted the influence of heredity on the development of AP ( 14 17 14 17 Oxidative stress (OS) arises from a disproportion between the generation of reactive oxygen species (ROS) and the capacity of antioxidant systems to neutralize them, which subsequently leads to cellular damage and inflammation. Previous studies clearly demonstrated the significance of OS in the pathogenesis of apical periodontitis ( 18 19 20 19 20 19 20 GSTM1 GSTT1 19 20 A few studies have previously explored the connection between various GST 21 26 GSTM1, GSTT1 GSTP1 GSTM1 GSTT1 GSTP1 21 26 Although marginal and apical periodontitis shared similar pathological features, evidence regarding the impact of GST GSTT/GSTM Materials and Methods The present study represents clinical-laboratory and observational genetic association research. The investigation was performed and reported in alignment with the Strengthening the Reporting of Genetic Association study (STREGA) statement checklist ( 27 28 29 Ethical considerations The protocol followed in this two-center investigation was reviewed and approved by both local institutional Research Ethics Committees (protocol numbers: 36/12-2013, and 02-3-4-19-1-6/2022). All study participants or parents/legal guardians provided informed written consent, i.e., an assent document, at both centers. Moreover, the procedures followed were all in accordance with the ethical standards of both the responsible committees on human experimentation (University of Banja Luka, B&H, and University of Belgrade, Serbia) and with the Helsinki Declaration of 1975, as revised in 2002. Sample description and collection of biological material The present study involved 200 consecutive individuals exhibiting clinical, radiographic, and histopathological features of AP ( 30 As a source of genomic DNA, sterile buccal swabs were taken from each patient. All collected samples were refrigerated at 2–8°C overnight and stored at -70 °C before transport and DNA extraction. DNA extraction, selection of genetic polymorphisms and genotyping GSTM1 GSST1 21 26 All laboratory procedures were performed in scientific laboratories at the Implant-Research Center, School of Dental Medicine, and University of Belgrade, Serbia. The samples collected at the other center were appropriately stored and transported in a liquid nitrogen canister to the laboratory facilities. Genomic DNA that was used for the genotyping analysis was isolated from buccal cells collected using cotton swabs, as adopted in previous evaluations ( 31 Genotyping of GSTM1 and GSTT1 deletion polymorphisms was conducted using multiplex PCR ( 32 32 33 Statistical analysis SPSS Statistics for Windows Software, version 22.0 (IBM Corp, Armonk, NY, USA) and R statistical software (R Core Team (2018). R: A language and environment for statistical computing. R Foundation for Statistical Computing, Vienna, Austria) were used to carry out all calculations. In order to assess potential differences in categorical variables, the Pearson chi-square test and Fisher’s exact test were performed. The Student’s t-test or Mann–Whitney U-test were used to determine the statistical significance between numerical data. Unconditional logistic regression was used to calculate odds ratios (ORs) and 95% confidence intervals (CIs) the values of which were then considered in order to estimate the risk of AP development with regard to the genotypes. The statistical analyses were two-sided, and p-values of 0.05 were perceived as statistically significant. Results Due to the nature of the genotyping method, it was not possible to determine the allelic distribution for the GSTM1 and GSTT1 deletion polymorphisms. Among AP patients, 96 were male and 104 female, while the control group consisted of 110 male and 140 female participants. There was no statistical difference in gender distribution (Pearson’s chi-square test, p = 0.446). The mean age of the AP group was 37.72 ± 12.89 years, and the control group was 35.60 ± 12.01 years. No significant difference in age distribution was observed (Student’s t-test, p = 0.154). The presence of GSTM1 Table 1 Table 1 Genotype frequencies of GSTM GSTT Polymorphism AP Controls P OR (95% CI) GSTM deletion GSTM + 69 (34.5) 154 (61.6) ref GSTM - 131 (65.5) 96 (38.4)  <0.001 3.05 (2.07-4.49) GSTT deletion GSTT + 99 (49.5) 212 (84.8) ref GSTT - 101 (50.5) 38 (15.2)  <0.001 5.69 (3.66-8.86) GSTM/GSTT deletion GSTM +/GSTT + 43 (21.5) 121 (48.4) ref GSTM + - 25 (12.5) 33 (13.2)  0.026 2.13 (1.14-3.98) GSTM - 57 (28.5) 92 (36.8)  0.031 1.74 (1.08-2.82) GSTM - - 75 (37.5) 4 (1.6)  <0.001 52.76 (18.20-152.94) AP, apical periodontitis; N, number of patients; OR, odds ratio; CI, confidence interval; GST, glutathione-S-transferases; GSTT1 Table 1 In the combined analysis of both polymorphisms, the deletion of GSTT1 GSTM1 Table 1 GSTM1 GSTT1 Table 1 Table 1 GSTM GSTT Discussion Recent scientific evidence clearly shows that AP should be considered as a multifactorial disease, highlighting the complexity of its underlying causes ( 1 12 13 1 12 13 GSTT GSTM GSTT GSTM GSTT/GSTM 19 20 The obtained findings are in alignment with previously reported results in the field of Periodontology ( 21 26 GST 21 26 P450 (CYP) 1A1 CYP2E1 GSTM1 22 GSTM 22 23 GSTT GSTM GSTM GSTM GSTT 23 24 GSTT GSTP GST 28 GST Despite the growing number of genetic association studies in Endodontology ( 34 35 37 35 36 SOD2 SOD3 37 COMT OPRM1 5HT1A 5HT2A 5HTR3B COMT, OPRM1, 5HT1A, 5HT2A, 5HTR3B The most prominent limitation of the current study is the restricted number of SNPs that were investigated. Recently, Petty et al ( 38 38 39 39 There are also several important strengths of this study. This study was performed and reported according to STREGA guidelines for genetic association studies ( 27 14 Insights into individual genetic variations hold promise for advancing precision-based dental care, thus allowing for more individualized prevention and treatment approaches. Detection of gene polymorphisms linked to exaggerated inflammatory responses may help clinicians estimate a patient's risk of developing or progressing oral diseases. Such genetic insights could also support the customization of therapeutic strategies, thus ensuring better clinical efficacy and a reduced likelihood of disease relapse. Considering the vital role of GSTs in redox balance and tissue health, it is imperative that individuals with compromised antioxidant defenses, particularly those at a heightened risk of cancer, undergo targeted screening for AP. This necessity underscores a significant area for future translational research and preventive strategies. Conclusion The carriers of null GSTT GSTM GSTT/GSTM Ethical approvals: Acknowledgment: Conflict of Interest: Funding: References 1 Wen YH Lin YX Zhou L Lin C Zhang L The immune landscape in apical periodontitis: From mechanism to therapy. Int Endod J 2024 57 11 1526 45 10.1111/iej.14125 39087849 2 Jakovljevic A Nikolic N Jacimovic J Pavlovic O Milicic B Beljic-Ivanovic K Prevalence of Apical Periodontitis and Conventional Nonsurgical Root Canal Treatment in General Adult Population: An Updated Systematic Review and Meta-analysis of Cross-sectional Studies Published between 2012 and 2020. J Endod 2020 46 10 1371 1386.e8 10.1016/j.joen.2020.07.007 32673634 3 Peršić Bukmir R Paljević E Pezelj-Ribarić S Brekalo Pršo I Coronal Restoration as a Predictor of Periapical Disease in Non-Endodontically Treated Teeth. Acta Stomatol Croat 2021 55 1 56 68 10.15644/asc55/1/7 33867538 PMC8033623 4 Trindade D Carvalho R Machado V Chambrone L Mendes JJ Botelho J Prevalence of periodontitis in dentate people between 2011 and 2020: A systematic review and meta-analysis of epidemiological studies. J Clin Periodontol 2023 50 5 604 26 10.1111/jcpe.13769 36631982 5 Jakovljevic A Duncan HF Nagendrababu V Jacimovic J Milasin J Dummer PMH Association between cardiovascular diseases and apical periodontitis: an umbrella review. Int Endod J 2020 53 10 1374 86 10.1111/iej.13364 32648971 6 Jakovljevic A Ideo F Jacimovic J Aminoshariae A Nagendrababu V Azarpazhooh A The Link Between Apical Periodontitis and Gastrointestinal Diseases-A Systematic Review. J Endod 2023 49 11 1421 31 10.1016/j.joen.2023.07.024 37558178 7 Jakovljevic A Sljivancanin Jakovljevic T Duncan HF Nagendrababu V Jacimovic J Aminoshariae A The association between apical periodontitis and adverse pregnancy outcomes: a systematic review. Int Endod J 2021 54 9 1527 37 10.1111/iej.13538 33908039 8 Jevdjevic M Listl S Global, Regional, and Country-Level Economic Impacts of Oral Conditions in 2019. J Dent Res 2025 104 1 17 21 10.1177/00220345241281698 39535193 PMC11662506 9 Zang HL Zhang Y Hao XW Yang L Liang YH Cost-effectiveness analysis: nonsurgical root canal treatment versus single-tooth implant. BMC Oral Health 2023 23 1 489 10.1186/s12903-023-03173-x 37454076 PMC10349452 10 Luo X Wan Q Cheng L Xu R Mechanisms of bone remodeling and therapeutic strategies in chronic apical periodontitis. Front Cell Infect Microbiol 2022 12 908859 10.3389/fcimb.2022.908859 35937695 PMC9353524 11 Milojevic N Krdzovic Lazic E Lukic L Puresevic D Mirkovic M Jakovljevic A Inflammatory mediators’ essence in apical periodontitis. Eur Oral Res 2024 58 3 160 8 39588476 10.26650/eor.20241423117 PMC11586043 12 Pan D Hao Y Tao Y Li B Cheng L The influence of microorganisms on bone homeostasis in apical periodontitis. Arch Oral Biol 2025 170 106153 10.1016/j.archoralbio.2024.106153 39644768 13 Galler KM Weber M Korkmaz Y Widbiller M Feuerer M Inflammatory Response Mechanisms of the Dentine-Pulp Complex and the Periapical Tissues. Int J Mol Sci 2021 22 3 1480 10.3390/ijms22031480 33540711 PMC7867227 14 Jakovljevic A Jacimovic J Georgiou AC Nikolic N Aminoshariae A van der Waal SV Single nucleotide polymorphisms as a predisposing factor for the development of apical periodontitis-An umbrella review. Int Endod J 2022 55 7 700 13 10.1111/iej.13756 35476797 15 Falatah AM Alturki SA Aldahami AI Alrashidi NA Sinnah Y Aldgeel RM ALjuaid TS, Alotaibi NH, Altwijri WJ. Exploring the Influence of Genetic Single-Nucleotide Polymorphism (SNPs) on Endodontic Pathologies: A Comprehensive Review. Cureus 2024 16 11 e74389 39723289 10.7759/cureus.74389 PMC11669393 16 Petean IBF Silva-Sousa AC Cronenbold TJ Mazzi-Chaves JF Silva LABD Segato RAB Genetic, Cellular and Molecular Aspects involved in Apical Periodontitis. Braz Dent J 2022 33 4 1 11 10.1590/0103-6440202205113 36043561 PMC9645190 17 Fouad AF Khan AA Silva RM Kang MK Genetic and Epigenetic Characterization of Pulpal and Periapical Inflammation. Front Physiol 2020 11 21 10.3389/fphys.2020.00021 32116745 PMC7010935 18 Macedo Signorelli NS Rende SGS Iorio EL Ferraz DC Paranhos LR Moura CCG Identification of oxidative stress biomarkers in apical periodontitis: A scoping review with bibliometric analysis. Aust Endod J 2024 50 3 742 60 10.1111/aej.12888 39297674 19 Mazari AMA Zhang L Ye ZW Zhang J Tew KD Townsend DM The Multifaceted Role of Glutathione S-Transferases in Health and Disease. Biomolecules 2023 13 4 688 10.3390/biom13040688 37189435 PMC10136111 20 Aloke C Onisuru OO Achilonu I Glutathione S-transferase: A versatile and dynamic enzyme. Biochem Biophys Res Commun 2024 734 150774 10.1016/j.bbrc.2024.150774 39366175 21 Camargo Ortega VR Bravo López LD Visoso Salgado A Mejia Sanchez F Castillo Cadena J Polymorphisms in Glutathione S-Transferase M1, T1, and P1 in Patients with Chronic Periodontitis: A Pilot Study. Int Sch Res Notices 2014 2014 135368 10.1155/2014/135368 27350970 PMC4897437 22 Kim JS Park JY Chung WY Choi MA Cho KS Park KK Polymorphisms in genes coding for enzymes metabolizing smoking-derived substances and the risk of periodontitis. J Clin Periodontol 2004 31 11 959 64 10.1111/j.1600-051X.2004.00587.x 15491310 23 Concolino P Cecchetti F D’Autilia C Santonocito C Di Stasio E Zuppi C Association of periodontitis with GSTM1/GSTT1-null variants--a pilot study. Clin Biochem 2007 40 13-14 939 45 10.1016/j.clinbiochem.2007.04.012 17524385 24 Arshad K Ishfaq U Asif M Akbar A Pitafi KF Mulghani MR Association of GSTTI, M1 and Polymorphism in GSTPI with Chronic Periodontal Disease in a Pakistani Population. Genes (Basel) 2023 14 2 455 10.3390/genes14020455 36833382 PMC9957474 25 Saravanan RV Pandi A Murthykumar K Selvi SGA Arumugam P Jayaseelan VP Genetic association between rs1695 in glutathione S-transferase P1 and risk of periodontitis: a pilot study. Mol Biol Res Commun 2023 12 4 133 7 37886736 10.22099/mbrc.2023.46999.1815 PMC10599595 26 Izakovicova P Fassmann A Dusek L Izakovicova Holla L Glutathione S-transferase M1, T1, and P1 polymorphisms and periodontitis in a Caucasian population: a case-control study. BMC Oral Health 2024 24 1 288 10.1186/s12903-024-04034-x 38419025 PMC10903033 27 Little J Higgins JP Ioannidis JP STrengthening the REporting of Genetic Association Studies (STREGA)--an extension of the STROBE statement. Genet Epidemiol 2009 33 7 581 98 10.1002/gepi.20410 19278015 28 Nagendrababu V Murray PE Ordinola-Zapata R Peters OA Rôças IN Siqueira JF Jr J Pulikkotil S, Camilleri J, Boutsioukis C, Rossi-Fedele G, Dummer PMH. PRILE 2021 guidelines for reporting laboratory studies in Endodontology: A consensus-based development. Int Endod J 2021 54 9 1482 90 10.1111/iej.13542 33938010 29 Nagendrababu V Duncan HF Fouad AF Kirkevang LL Parashos P Pigg M PROBE 2023 guidelines for reporting observational studies in Endodontics: A consensus-based development study. Int Endod J 2023 56 3 308 17 10.1111/iej.13873 36416192 30 Jakovljevic A Andric M Knezevic A Soldatovic I Nikolic N Karalic D Human Cytomegalovirus and Epstein-Barr Virus Genotypes in Apical Periodontitis Lesions. J Endod 2015 41 11 1847 51 10.1016/j.joen.2015.08.027 26435468 31 Küchler EC Tannure PN Falagan-Lotsch P Lopes TS Granjeiro JM Amorim LM Buccal cells DNA extraction to obtain high quality human genomic DNA suitable for polymorphism genotyping by PCR-RFLP and Real-Time PCR. J Appl Oral Sci 2012 20 4 467 71 10.1590/S1678-77572012000400013 23032210 PMC3881822 32 Voso MT D’Alo’ F Putzulu R Mele L Scardocci A Chiusolo P Negative prognostic value of glutathione S-transferase (GSTM1 and GSTT1) deletions in adult acute myeloid leukemia. Blood 2002 100 8 2703 7 10.1182/blood.V100.8.2703 12351375 33 Saiki RK Gelfand DH Stoffel S Scharf SJ Higuchi R Horn GT Primer-directed enzymatic amplification of DNA with a thermostable DNA polymerase. Science 1988 239 4839 487 91 10.1126/science.2448875 2448875 34 Omran TZ Jasmi FSOA Obaid KM Ghareeb AKR Alsailawi HA Mudhafar M The interleukin gene landscape: understanding its influence on inflammatory mechanisms in apical periodontitis. Mol Biol Rep 2025 52 1 365 10.1007/s11033-025-10477-4 40192910 35 Meyfarth SRS Antunes LAA da Silva Tavares J Guimarães LDS da Silva EAB Baratto-Filho F Single nucleotide polymorphisms in inducible nitric oxide synthase gene are not associated with persistent apical periodontitis. Aust Endod J 2023 49 3 648 56 10.1111/aej.12796 37724624 36 Da Silva Guimarães L Borges da Silva EA Bonelli JM Ribeiro HG Silva-Sousa AC Sousa-Neto MD Is there an association between superoxide dismutase gene polymorphisms, antioxidants in oxidative stress pathway, and oral health-related quality of life after root canal treatment? Acta Odontol Scand 2025 84 191 200 10.2340/aos.v84.43426 40261148 PMC12056317 37 Karataş E Kahraman ÇY Akbıyık N Association between polymorphisms in catechol-O-methyl transferase, opioid receptor Mu 1 and serotonin receptor genes with postoperative pain following root canal treatment. Int Endod J 2021 54 7 1016 25 10.1111/iej.13493 33559241 38 Petty LE Silva R de Souza LC Vieira AR Shaw DM Below JE Genome-wide Association Study Identifies Novel Risk Loci for Apical Periodontitis. J Endod 2023 49 10 1276 88 10.1016/j.joen.2023.07.018 37499862 PMC10543637 39 Retta SF Balzac F Avolio M Rap1: a turnabout for the crosstalk between cadherins and integrins. Eur J Cell Biol 2006 85 3-4 283 93 10.1016/j.ejcb.2005.09.007 16546572 ",
  "metadata": {
    "Title of this paper": "Rap1: a turnabout for the crosstalk between cadherins and integrins.",
    "Journal it was published in:": "Acta Stomatologica Croatica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490671/"
  }
}