{
  "title": "Paper_828",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472680 PMC12472680.1 12472680 12472680 41011705 10.3390/molecules30183814 molecules-30-03814 1 Review The Efficacy of Melatonergic Receptor Agonists Used in Clinical Practice in Insomnia Treatment: Melatonin, Tasimelteon, Ramelteon, Agomelatine, and Selected Herbs https://orcid.org/0009-0004-1151-2332 Żełabowski Kacper 1 Pichowicz Wojciech 1 https://orcid.org/0009-0000-2503-7473 Skowron Izabela 1 https://orcid.org/0009-0000-9078-5830 Szwach Jagoda 1 https://orcid.org/0009-0003-2157-103X Biedka Kamil 2 https://orcid.org/0009-0002-8752-2321 Wesołowski Michał 2 https://orcid.org/0009-0003-4209-3700 Błaszczyk Katarzyna 3 https://orcid.org/0009-0004-7085-0104 Ziobro Oliwia 1 Petrov Wiktor 1 https://orcid.org/0000-0001-7076-600X Kukula-Koch Wirginia 4 * Chłopaś-Konowałek Agnieszka 5 * Hyun Chang-Gu Academic Editor 1 kacper.zelabowski@outlook.com wojciech.pichowicz@outlook.com izabela.skowron@student.umw.edu.pl jagoda.szwach@student.umw.edu.pl oziobro@gmail.com wiktor.petrov@student.umw.edu.pl 2 kamil.biedka@umw.edu.pl michal.wesolowski@umw.edu.pl 3 blaszczykrzyk@gmail.com 4 5 * wirginia.kukula-koch@umlub.pl agnieszka.chlopas-konowalek@umw.edu.pl 19 9 2025 9 2025 30 18 496804 3814 30 7 2025 29 8 2025 12 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Insomnia is a common and complex disorder, rooted in the dysregulation of circadian rhythms, impaired neurotransmitter function, and disturbances in sleep–wake homeostasis. While conventional hypnotics such as benzodiazepines and Z-drugs are effective in the short term, their use is limited by a high potential for dependence, cognitive side effects, and withdrawal symptoms. In contrast, melatonergic receptor agonists—melatonin, ramelteon, tasimelteon, and agomelatine—represent a pharmacologically targeted alternative that modulates MT1 and MT2 receptors, which are pivotal to the regulation of circadian timing and sleep initiation. Clinical evidence supports the efficacy of these agents in reducing sleep onset latency, extending total sleep duration, and re-aligning disrupted circadian rhythms, particularly among older individuals and patients with non-24 h sleep–wake disorders. Notably, agomelatine offers additional antidepressant properties through selective antagonism of the 5-HT 2C insomnia melatonin tasimelteon ramelteon agomelatine melatonergic receptor agonists circadian rhythm sleep–wake disorders medicinal plants herbs This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The etymology of the term “insomnia” derives from Latin, combining “in” meaning “not” and “somnus,” meaning “sleep” [ 1 2 2 3 4 3 5 6 6 4 6 Insomnia is a highly prevalent medical condition that significantly impacts quality of life. Studies have demonstrated a direct correlation between inadequate sleep and an increased risk of developing metabolic diseases, such as diabetes, obesity, hypertension, cardiovascular disease, and depression [ 7 8 9 10 11 12 13 Although sleep difficulties are commonly encountered in everyday clinical practice, the problem is frequently underestimated, and patients often do not receive adequate care [ 14 15 Non-pharmacological interventions, such as improving sleep hygiene by maintaining a regular sleep schedule, creating a conducive sleep environment, and avoiding stimulating activities before bedtime, should be the primary approach to managing insomnia. Behavioral interventions, such as relaxation techniques and cognitive behavioral therapy for insomnia, should also be considered first-line treatments. It can be used alone or in combination with herbal and natural supplements [ 16 Traditionally prescribed hypnotics, including benzodiazepines (e.g., diazepam, lorazepam, temazepam) and Z-drugs (e.g., zolpidem, zopiklon) [ 17 18 19 20 In the short term, antipsychotics may cause sedation, blurred vision, dizziness, a dry mouth, and urinary irregularities. In the long term, they may cause increased appetite and subsequent weight gain. Routine insomnia drugs cause daytime drowsiness and interfere with activities that require cognition and awareness. While these medications can be effective in the short term, they are associated with various side effects, including dependence, tolerance and adverse reactions. Furthermore, long-term use of these hypnotics may result in rebound insomnia and withdrawal symptoms when discontinued [ 21 Consequently, there is growing interest in safer therapeutic alternatives that act through physiological mechanisms regulating the sleep–wake cycle. Herbal and natural supplements have gained popularity as potential sleep aids due to their perceived safety, lower risk of dependence, and fewer side effects compared to conventional medications. These supplements often contain sedative, anxiolytic, or sleep-promoting compounds, such as flavonoids, terpenes, and amino acids [ 22 23 Particular attention has been directed toward melatonergic receptor agonists—compounds that mimic the action of endogenous melatonin, a hormone involved in circadian rhythm regulation. This pharmacological group includes melatonin, agomelatine, ramelteon, and tasimelteon ( Figure 1 This review aims to provide a comprehensive overview of the current knowledge regarding clinical efficacy of selected melatonergic receptor agonists in the treatment of insomnia. Additionally, we examined the effectiveness of selected herbal supplements for managing sleep disorders by critically reviewing evidence from clinical studies on their efficacy and safety. 2. Methodology This article constitutes a narrative review aimed at summarizing current clinical evidence on the efficacy and pharmacological characteristics of melatonergic receptor agonists and selected herbal agents in the treatment of insomnia and circadian rhythm sleep–wake disorders. To identify the most relevant clinical evidence on the efficacy of melatonergic receptor agonists in the treatment of insomnia and circadian rhythm sleep disorders, an extensive literature search was conducted across various academic databases: PubMed, Embase, Web of Science, and Scopus. The search strategy included both MeSH and Emtree terms and free-text keywords to ensure the most effective retrieval of relevant articles. MeSH terms used during PubMed screening: ‘melatonin’, ‘agomelatine’, ‘ramelteon’, ‘tasimelteon’, ‘receptors, melatonin’, ‘sleep disorders, circadian rhythm’, ‘insomnia’, ‘jet lag syndrome’, ‘sleep onset insomnia’, ‘maintenance insomnia’, ‘circadian misalignment’, ‘delayed sleep phase syndrome’, ‘non-24’, ‘shift work disorder’ and ‘jet lag disorder’. The Emtree terms searched in Embase included: ‘melatonin’, ‘melatonin receptor agonist’, ‘agomelatine’, ‘ramelteon’, ‘tasimelteon’, ‘insomnia’, ‘circadian rhythm sleep disorder’, and ‘jet lag’, ‘insomnia’, ‘sleep’, medical plant, ‘herbal medicine’, ‘valerian’, ‘passionflower’, ‘lavender’ or “Phyto-medical plant”. “insomnia” or “sleep” or “plant” or “herb” or “extract” in the title. In addition, free-text keywords were included to capture relevant studies not yet indexed under standardized terms. These included: ‘melatonergic’, ‘MT1’, ‘MT2’, ‘non-24-h sleep–wake disorder’, ‘delayed sleep phase’, ‘sleep onset latency’ and ‘sleep efficiency’. Inclusion criteria: articles published after 2014 providing most recent data, clinical studies, performed on adults, studies focusing on melatonin, ramelteon, tasimelteon, or agomelatine in the context of insomnia or circadian rhythm disorders. Exclusion criteria: preclinical or animal-only studies, articles without original data or peer-review, studies focusing on unrelated indications, studies not reporting sleep-related outcomes. Relevant data were extracted and synthesized narratively, with emphasis placed on pharmacokinetics, receptor selectivity, and clinical outcomes. The quality and validity of included studies were considered during interpretation, although no formal risk of bias tool was applied. Moreover a recent structured narrative review have applied similar methodological strategies in insomnia research, thereby supporting the validity of our approach [ 24 3. Melatonergic Receptor Neurophysiology 3.1. Characterization of MT1 (Initiation) and MT2 (Diurnal Phase) Receptors M1 and M2 receptors are implicated in circadian rhythm modulation, sleep and mood variation [ 25 26 27 25 Genetic and expression research reveal that MT1 receptors are present in the suprachiasmatic nucleus (SCN) of the hypothalamus, hippocampus, substantia nigra, cerebellum, central dopaminergic pathways, ventral tegmental area, and nucleus accumbens [ 28 29 28 28 29 Both MT1 and MT2 receptors are situated in the SCN, specific brain regions, and peripheral tissues, where they transduce photoperiodic information and modulate physiological processes [ 25 30 It has been established that MT1 and MT2 receptors can form heterodimers with the serotonin receptor 5-HT 2C 2C 2C 2C 27 31 32 33 Pharmacologically utilized clinical medicines were complemented with augmenting approaches, and one such research using experimental ligands disassembled the molecular-level operation of melatonin receptors. Saturation binding with [ 3 34 35 i 36 37 3.2. Long-Term Potentiation Variability Melatonin, acting through its MT1 and MT2 receptors, can modulate long-term potentiation (LTP) in a manner that depends on receptor type, location, and physiological conditions ( Figure 2 38 For instance, the MT1 receptor exerts predominantly inhibitory effects on long-term potentiation. Stimulation of the MT1 receptor leads to decreased level of cAMP through the inhibition of adenylate cyclase (AC). The following decrease leads to the reduced activation of protein kinase A, a key enzyme in the induction of LTP. In addition, stimulation of the MT1 receptor reduces NMDA receptor activity, further reducing synaptic potentiation. These inhibitory effects are particularly important in the hippocampus, where melatonin’s role in attenuating excitatory neurotransmission contributes to the regulation of circadian cycles and memory formation [ 39 Prior research suggests that the MT2 receptor has multiple effects on long-term potentiation, exerting either facilitatory or inhibitory effects depending on the neuronal microenvironment. Activation of the MT2 receptor has been shown to promote LTP by modulating intracellular calcium signaling, which is critical for synaptic potentiation. Contrarily, MT2 receptor activation can also enhance inhibitory neurotransmission through GABAergic pathways, which results in suppression of LTP. This dual functionality suggests that MT2 receptors play a varied role in maintaining the balance between excitatory and inhibitory inputs within neural circuits [ 40 41 42 43 3.3. Intracellular Pathways, Modulation of Neuronal Activity of Suprachiasmatic Nucleus and Other CNS Areas (Hypothalamus, Cortex, Hippocampus, N. accumbens)—Effect of Modulation on a Diurnal Cycle 3.3.1. MT1 Receptor Signaling Pathway Upon melatonin binding, MT1 activates two parallel downstream pathways: inhibition of AC and activation of phospholipase C (PLC), as presented in Figure 3 44 45 2 3 45 46 47 3.3.2. MT2 Receptor Signaling Pathway Activation of MT2 leads to three major signaling pathways, such as inhibition of guanylyl cyclase (GC), inhibition of adenylyl cyclase, and activation of phospholipase C, as presented in Figure 4 i 45 48 49 3.3.3. Modulation of Neuronal Activity of SCN Previous studies have emphasized that the SCN exerts regulatory control over the efferent projections from the paraventricular nucleus (PVN) of the hypothalamus, thereby modulating the majority of the circadian functions governed by the autonomic nervous system [ 50 51 Melatonin production can be suppressed by light exposure, particularly in the evening, leading to circadian and sleep disturbances [ 52 25 The endogenous circadian rhythms of pineal melatonin synthesis are regulated by intrinsic oscillators within the SCN, which are synchronized with daily and seasonal variations in the environmental light-dark cycle [ 53 Endogenous melatonin may provide feedback to SCN, stimulating the MT1 and MT2 receptors to induce phase shifts in local and overt circadian rhythms [ 25 54 55 56 3.4. Interaction with Serotonergic, Dopaminergic and GABAergic, Orexinergic Systems 3.4.1. Serotonergic System The serotonergic neurons that arise from the raphe nuclei in the brainstem constitute a significant system that enhances arousal [ 57 The regulation of arousal by serotonergic neurons has been associated with both 5HT 2A 2C 2A 2A 49 2A 58 59 In contrast, the activation of 5HT 2C 60 2C 60 60 3.4.2. GABAergic System Numerous sedative medications function by amplifying the activity of sleep-inducing GABAergic pathways. Benzodiazepines and barbiturates act on GABA A 61 62 A 61 62 A A 55 3.4.3. Dopaminergic System Dopaminergic neurons located in the VTA of the midbrain play a significant role in enhancing wakefulness [ 63 64 65 3.4.4. Orexinergic System Pharmaceuticals that engage with orexin receptors could present significant therapeutic opportunities: agonists are anticipated to promote alertness, while antagonists are likely to induce sedation [ 66 67 68 68 67 69 3.4.5. Arousal-Controlling Neuronal Network The regulation of arousal and the transitions among wakefulness, non-rapid eye movement (NREM) sleep, and rapid eye movement (REM) sleep is governed by a sophisticated interplay of various hypothalamic and brainstem nuclei that either promote wakefulness or facilitate sleep. These nuclei have been characterized both anatomically and neurochemically, based on the specific neurotransmitters involved in these processes [ 57 70 71 72 The wakefulness-promoting nuclei directly activate the cerebral cortex, while the ventrolateral preoptic nucleus (VLPO) encourages sleep by inhibiting the tuberomammillary nucleus (TMN). The locus coeruleus (LC) enhances wakefulness by inhibiting the VLPO. The raphe (R) nucleus contributes to wakefulness by activating the cerebral cortex, though this effect is mitigated by the stimulation of GABAergic interneurons, which inhibit both the LC and the VTA ( Figure 5 73 74 75 4. Characteristic of Melatonergic Receptor Agonists 4.1. Melatonin 4.1.1. Characteristics of Melatonin Melatonin is an endogenous hormone with a broad range of effects on the neuroendocrine system and circadian rhythms. It was first isolated in the late 1950s; however, its clinical use in medicine did not become widespread until the 1990s. Exogenous melatonin has demonstrated promising outcomes in the treatment of sleep disorders when administered in pharmacological doses [ 77 78 Melatonin’s effect is mediated by interaction with three receptor forms: the G protein-linked MT1 receptor, primarily involved in regulation of the sleep–wake cycle, in particular the REM stage; the GPCR-type MT2 receptor, influencing the NREM sleep stage. The so-called MT3 binding site has been identified as quinone reductase 2 (NQO2), a cytosolic enzyme involved in detoxification and oxidative stress processes. This accounted for the non-GPCR nature of MT3 and suggested that its pharmacological relevance is distinct from MT1/MT2 [ 79 4.1.2. Pharmacokinetics of Melatonin The therapeutic benefits of exogenous melatonin are primarily determined by its bioavailability, which depends on the route of administration, dosage, individual absorption capacity, and hepatic metabolic rate. Orally administered melatonin undergoes extensive hepatic metabolism, with minimal contributions from renal and intestinal pathways. The primary metabolic route involves C-6 hydroxylation, mediated by cytochrome P450 enzymes: CYP1A1, CYP1A2, CYP2C19, and CYP1B1 [ 80 81 82 83 84 The impact of endogenous and exogenous melatonin as a function of age was investigated in a study by Zhdanova et al. [ 85 86 87 Oral tablets represent the most common form of melatonin administration, though they are not necessarily the most effective [ 88 89 90 Alternative routes of administration have been shown to significantly enhance bioavailability. The study conducted by Zetner et al. [ 91 max 89 92 93 94 4.1.3. Efficacy of Melatonin in Sleep-Related Clinical Trials One of the most common indications for melatonin use is the treatment of sleep disorders. Exogenous melatonin improves sleep quality through multiple mechanisms, including reducing sleep onset latency, increasing total sleep duration, improving sleep efficiency, and decreasing nocturnal awakenings. Scientific research on the use of exogenous melatonin in sleep disorders shows considerable heterogeneity across populations and outcomes. According to the American Academy of Sleep Medicine guidelines, melatonin is not recommended as a pharmacological treatment for chronic insomnia in adults, with cognitive behavioral therapy considered the first-line intervention. Nevertheless, numerous studies highlight the effectiveness of melatonin and its potential benefits not only in sleep disorders but also in the regulation of circadian rhythms. The following section summarizes key clinical trials and meta-analyses published evaluating the efficacy of melatonin in sleep disorders. A study conducted by Luthringer et al. [ 95 95 A similar study, but on a much larger group of patients, was conducted by Wade [ 96 96 Table 1 Melatonin is also used in pediatric populations. In a study by Appleton et al. [ 97 97 The study by Smits et al. [ 98 Melatonin represents a promising and safer alternative to traditional hypnotics such as benzodiazepines, which are associated with a high risk of dependence. Studies suggest that melatonin may facilitate benzodiazepine withdrawal while maintaining sleep quality. The therapeutic effects of melatonin are particularly evident in older adults, while its efficacy in younger individuals appears less pronounced, warranting further investigation into the underlying mechanisms responsible for this discrepancy [ 99 100 101 Beyond sleep regulation, melatonin has shown potential therapeutic benefits in neurological disorders such as Alzheimer’s disease, Parkinson’s disease, and autism spectrum disorder (ASD). Studies have demonstrated improvements in sleep architecture and regulation in patients with neurodegenerative diseases, along with beneficial effects on behavioral and cognitive function [ 102 103 104 105 Melatonin is widely recognized as a substance with a favorable safety profile. In most clinical trials, no toxicity-related adverse effects have been reported. For example, the study by Seabra [ 106 106 107 However, the review by Boutin et al. [ 108 109 It is important to note that the clinical literature also reflects certain controversies regarding the excessive publicity of melatonin supplementation, particularly at very high (‘stratospheric’) doses. While low doses (≤2–5 mg) mimic physiological secretion and demonstrate efficacy with a favorable safety profile, many commercially available formulations, especially in the over-the-counter (OTC) market, provide doses several-fold higher than those used in controlled clinical trials. Some studies have argued that such supra-physiological concentrations not only lack clear additional benefits but may also contribute to misinterpretation of melatonin’s therapeutic potential and increase the risk of adverse events, particularly in pediatric and vulnerable populations [ 108 4.2. Tasimelteon 4.2.1. Characteristics of Tasimelteon Tasimelteon is the only drug approved by the FDA (2014) and EMA (2015) for the treatment of non-24 h sleep–wake rhythm disorder (Non-24) holding orphan drug status [ 110 111 112 2C 2B 113 4.2.2. Pharmacokinetics of Tasimelteon Tasimelteon demonstrates elevated first-pass metabolism in the liver and intestines, with CYP1A2 and CYP3A4/5 exhibiting primary responsibility for biotransformation. The effects of CYP1A1, CYP2C9/19, and CYP2D6 are comparatively minor [ 114 115 116 117 max max 116 117 111 115 4.2.3. Clinical Efficacy Non-24-Hour Sleep–Wake Disorder This condition is observed in approximately 50% of individuals with visual impairment. The underlying mechanism pertains to the absence of light perception, which hinders the synchronization of the SCN with the solar cycle [ 110 102 118 118 111 119 Jet Lag and Insomnia After Sleep-Time Shift Polymeropoulos et al. [ 120 120 Tasimelteon is effective in treating insomnia after sleep-time shift. Rajaratnam et al. [ 121 n n 121 In the Phase II study, tasimelteon decreased sleep latency and increased sleep efficiency compared to placebo. Dose-dependent advancement of plasma melatonin rhythm to an earlier time was obtained. The Phase III study demonstrated the efficacy of tasimelteon in reducing the time required to initiate sleep, enhancing sleep efficiency, and decreasing the duration of awakenings subsequent to sleep onset. The drug’s safety profile demonstrated comparable outcomes to those observed in the placebo group [ 121 Safety and Tolerance of Tasimelteon The drug is considered highly safe and well-tolerated in both oral and intravenous forms [ 111 122 123 Torres et al. [ 123 123 Bonacci et al. [ 117 117 111 111 124 124 4.3. Ramelteon 4.3.1. Characteristics of Ramelteon In 2005, ramelteon was approved by the U.S. Food and Drug Administration (FDA) as the first melatonin receptor agonist targeting MT1 and MT2 receptors for the treatment of insomnia, particularly in patients with difficulty initiating sleep [ 101 Ramelteon is a synthetic melatonin receptor agonist that selectively activates the MT1 receptor, thereby facilitating sleep by inhibiting the activity of neurons in the SCN. Additionally, it activates the MT2 receptor, which is responsible for synchronizing the diurnal rhythm [ 125 In comparison with melatonin, ramelteon exhibits a six-fold higher affinity for the MT1 receptor and a four-fold higher affinity for the MT2 receptor [ 126 127 104 The high selectivity of ramelteon minimizes the risk of dependence and contributes to a favorable safety profile, representing a significant advantage over classical melatonin agonists and traditional hypnotics such as benzodiazepines, which act non-selectively through modulation of GABA A 128 4.3.2. Pharmacokinetics of Ramelteon Ramelteon is well absorbed following oral administration; however, its mean systemic bioavailability is approximately 1.8%, primarily due to extensive first-pass hepatic metabolism. After oral dosing, ramelteon typically reaches peak plasma concentrations within approximately 45 min. Its elimination half-life is longer than that of melatonin and ranges from about 0.8 to 1.9 h, depending on the oral dose administered (ranging from 4 to 64 mg) [ 126 129 130 The liver plays a central role in the metabolism of ramelteon, with the cytochrome P450 isoenzyme CYP1A2 being primarily responsible for its oxidation. The predominant metabolite, M-II, reaches higher plasma concentrations than the parent compound and exhibits a longer half-life, ranging from 2 to 5 h. Although M-II demonstrates affinity for MT1 and MT2 receptors, its pharmacological activity is significantly lower compared to that of ramelteon [ 131 132 133 4.3.3. Safety and Tolerance of Ramelteon In a systematic review and meta-analysis conducted by Kuriyama et al. [ 134 134 The meta-analysis demonstrated a statistically significant improvement in subjective sleep latency (sSL), along with a reduction in LPS. Sleep efficiency (SE) also showed a moderate improvement, and a slight increase in total sleep time (TST) of 7.26 min was observed. Sleep quality, assessed using a 7-point Likert scale, improved modestly. However, there was no statistically significant difference in subjectively assessed total sleep time (sTST) between the ramelteon and placebo groups. The findings support the favorable safety profile and good tolerability of ramelteon, with somnolence being the only notable adverse effect. The authors highlight the need for long-term studies, as the clinical effect of ramelteon appears to be modest over relatively short treatment durations [ 134 In a meta-analysis conducted by Maruani et al. [ 135 135 After four weeks of treatment, significant improvements were observed in several sleep parameters among patients receiving ramelteon. These included reductions in both objective sleep onset latency (oSOL) and subjective sleep onset latency (sSOL). Additionally, data obtained from polysomnography and actigraphy showed increases in both objective total sleep time (oTST) and subjective total sleep time (sTST). Patients undergoing long-term treatment with ramelteon (>4 weeks) also experienced meaningful therapeutic benefits compared to placebo. During extended treatment, oTST increased by 2.02 min, and sTST increased by 14.5 min. Although the magnitude of improvement in sleep parameters was smaller in the long-term treatment group compared to short-term users, the therapeutic benefits of ramelteon were sustained over time, accompanied by a very favorable safety profile and good overall tolerability [ 135 Table 2 A melatonin receptor agonist such as ramelteon demonstrates a favorable safety profile and good tolerability in the treatment of insomnia, particularly in adult and older populations (≥50 years). Findings from both short-term and long-term studies have shown statistically significant improvements in sleep parameters, including total sleep time and sleep latency, as measured by both subjective and objective sleep assessments. While the meta-analysis by Kuriyama et al. [ 134 130 131 Given the discrepancies in study findings, there is a clear need for well-designed, long-term clinical trials to further validate the potential benefits of ramelteon in patients with insomnia. 4.4. Agomelatine 4.4.1. Characteristics of Agomelatine In February 2009, the European Medicines Agency (EMA) approved agomelatine, an antidepressant with sleep-modulating properties, for the treatment of major depressive episodes in adults [ 136 Agomelatine is a novel, atypical antidepressant classified within the “MASS” group—melatonin receptor agonists and selective serotonin receptor antagonists. The drug exerts its effects by activating melatonin MT1, MT2 receptors and antagonizing serotonin 5-HT 2C 2B 137 60 Through its antagonism of serotonin receptors, agomelatine increases the levels of norepinephrine and dopamine in the prefrontal cortex, contributing to its antidepressant properties and cognitive-enhancing effects. Additionally, by modulating melatonergic receptors, agomelatine helps restore normal circadian rhythms, which positively influences sleep regulation [ 51 4.4.2. Pharmacokinetics of Agomelatine Following oral administration, agomelatine is rapidly and extensively absorbed; however, its absolute bioavailability is low (less than 5% at therapeutic doses) and shows considerable interindividual variability. Peak plasma concentrations are typically reached within 1 to 2 h. Agomelatine is highly bound to plasma proteins, with approximately 95% bound. The drug undergoes extensive hepatic metabolism, primarily via cytochrome P450 isoenzymes CYP1A2, CYP2C9, and CYP2C19. Its metabolites, including hydroxylated and demethylated derivatives, lack pharmacological activity and are rapidly conjugated and excreted. The mean plasma elimination half-life of agomelatine ranges from 1 to 2 h. The drug is predominantly excreted via the urine (approximately 80%) in the form of metabolites [ 138 4.4.3. Safety and Tolerance of Agomelatine Lemoine et al. [ 139 139 The results demonstrated that agomelatine significantly improved the “getting to sleep” parameter on the LSEQ, with a mean score of 70.5 ± 16.8 mm, compared to 64.1 ± 18.2 mm for venlafaxine. The between-group difference was 6.36 mm and reached statistical significance ( p p p p p p 139 The international, multicenter, randomized, double-blind study conducted by Quera-Salva et al. [ 140 140 Hsing et al. [ 141 p p 141 In an off-label treatment setting, Grosshans et al. [ 142 p 142 Table 3 Findings from the international, prospective, non-interventional observational study by Gorwood et al. [ 143 143 In summary, agomelatine has proven to be an effective and well-tolerated treatment for insomnia, particularly in patients with comorbid depression. Its unique mechanism of action, involving modulation of both the melatonergic and serotonergic systems, facilitates the restoration of normal circadian rhythms and improves sleep quality. Clinical studies have shown that agomelatine not only enhances sleep parameters—such as sleep onset latency, number of awakenings, and subjectively perceived sleep quality—but also does not increase the need for additional hypnotic medications when compared to other antidepressants. Moreover, therapeutic benefits have been observed as early as the first weeks of treatment, highlighting the rapid onset of action. Agomelatine thus represents a safe and promising therapeutic alternative for the management of sleep disturbances, especially when associated with depressive disorders. 5. Herbal Medicines Conventional insomnia therapies, such as synthetic antidepressants and anxiolytics, may cause side effects including headaches, sexual dysfunction, addiction, seizures, and suicidal thoughts or behaviors. Furthermore, most patients develop a tolerance to these drugs, leading to significantly higher consumption of sleeping pills and anxiolytic agents [ 144 145 However, due to concerns about the long-term use of these treatments, there is a growing interest in multi-targeted approaches to treating sleep disorders. These approaches include traditional, complementary, and integrative medicines (TCIM), such as medicinal plants that promote sleep. TCIM offers a cost-effective and less hazardous alternative, especially for individuals with chronic conditions. Medicinal plants are popular worldwide due to their cost-effectiveness, ease of access, and fewer side effects compared to benzodiazepines [ 146 147 This subsection explores the potential benefits of utilizing plant species in the treatment of insomnia. A list of selected medicinal plants is provided in Table 4 5.1. Matricaria chamomilla L. (Chamomile); Asteraceae Matricaria chamomilla 148 p p 149 150 151 A randomized, double-blind, placebo-controlled trial examined the impact of chamomile extract on sleep quality and fatigue in 60 older adults residing in nursing homes. After four weeks of treatment, the study revealed notable enhancements in sleep quality and fatigue scores among the chamomile group versus the placebo group. The authors concluded that chamomile could be a safe and effective alternative to conventional sleep medications for older adults [ 152 p p p 153 154 154 Matricaria chamomilla 150 155 16 5.2. Melissa officinalis L. (Lemon Balm) Melissa officinalis L. (MO; lemon balm) (Lamiaceae) is native to the Mediterranean region and western Asia. It contains bioactive volatile compounds, triterpenes, phenolic acids, and flavonoids [ 159 164 Among the numerous botanicals that have been studied for their psychopharmacological effects, Melissa officinalis leaf extract has emerged as a promising agent for calming the central nervous system (CNS) and improving mood. Its efficacy was evaluated in vitro by measuring its ability to inhibit GABA-T and monoamine oxidase A (MAO-A) in hydrogen peroxide (H 2 2 160 Akhondzadeh et al. [ 161 n p p p 162 163 Study Pierro et. al [ 156 p 158 158 158 156 160 5.3. Nigella sativa L. (Black Cumin) Nigella sativa 165 166 167 168 p 168 169 Nigella sativa 169 170 170 Nigella sativa Nigella sativa 170 p p p p p 170 5.4. Valerian (Valeriana Officinalis) Valerian ( Valeriana officinalis 171 172 171 173 174 175 176 176 177 178 179 n n n 180 181 5.5. Passiflora incarnata L. (Passionflower) The passionflower ( Passiflora incarnata 182 183 182 183 184 185 184 186 187 188 189 Passiflora incarnata p Passiflora incarnata 189 Kim et al. [ 190 P. incarnata 190 191 P. incarnata 191 In another study [ 192 192 5.6. Lavandula Angustifolia Mill. (Lavender) Lavandula angustifolia 193 194 195 196 197 198 Lavender suppresses heart stimulation and lowers blood pressure; therefore, it is useful in the treatment of heart acceleration and high blood pressure [ 199 200 201 202 203 204 205 206 207 208 209 197 A study [ 197 L. angustifolia L. angustifolia 197 197 197 In a study by Lari et al. [ 210 Lavandula angustifolia 198 198 211 196 207 207 5.7. Melatonin-Containing Plants (MCP) Melatonin has been identified in various plant species, demonstrating its significance also in the plant kingdom. Notably, some of the species reported to contain melatonin include Coffea canephora (coffee), Coffea arabica, Piper nigrum (black pepper), Lycium barbarum (wolfberry), and Brassica nigra (black mustard), among others. Also, melatonin has been identified in Medicago sativa (alfalfa), Chlorella vulgaris (chlorella), and Oryza sativa (rice). The concentrations of melatonin in these plants can vary widely, with seeds often exhibiting the highest levels, significantly exceeding those found in vertebrate tissues. For instance, melatonin levels in coffee beans can reach up to 6800 ng/g, while seeds of Brassica nigra contain approximately 129 ng/g [ 81 169 212 213 214 215 216 215 Pistacia vera 215 The presence of melatonin in plants is crucial as it plays a significant role in their physiological processes, including growth regulation, stress response, and defense mechanisms against oxidative stress. This is particularly relevant in reproductive organs, where higher melatonin concentrations have been linked to enhanced resilience against environmental stresses, thus promoting species survival [ 217 218 219 220 The bioavailability of melatonin from these plant sources to humans is also noteworthy. Studies suggest that dietary intake of melatonin from plant-based foods, such as fruits and beverages like red wine and coffee, can effectively elevate serum melatonin levels in humans. The concentrations observed in these foods may contribute to the modulation of physiological functions, including circadian rhythm regulation and antioxidant defense mechanisms [ 220 221 222 Previously it was proven that the plant species with melatonin present in a phytocomplex may exhibit more favourable properties than synthetic melatonin. The research article by Kukula-Koch et al. [ 212 212 5.8. Comparison of Efficacy and Cost: Melatonergic Drugs vs. Herbal Preparations In this review, we emphasized the role of both melatonergic receptor agonists and herbal products in the management of insomnia. While both categories affect circadian regulation and sleep architecture, they differ substantially in clinical efficacy, level of evidence, safety, accessibility, and cost-effectiveness. Synthetic melatonergic drugs, including melatonin, ramelteon, agomelatine, and tasimelteon, exhibit well-established efficacy in reducing sleep latency, improving total sleep time, and synchronizing circadian rhythms. These effects have been demonstrated in randomized controlled trials [ 118 223 224 2C 136 Conversely, herbal preparations such as Matricaria chamomilla Melissa officinalis Nigella sativa 225 226 Melissa officinalis Melissa officinalis 162 In a comprehensive systematic review and meta-analysis, Leach et al. [ 22 22 From a cost perspective, substantial differences favor herbal preparations and melatonin. In most European Union countries and the United States, melatonin in over-the-counter formulations represents an affordable therapeutic option, particularly at doses of 1–5 mg. In contrast, tasimelteon and ramelteon, as prescription-only medications, are associated with significantly higher treatment costs, which may restrict their widespread use, especially for long-term therapy. Herbal preparations available OTC are widely used in mild forms of insomnia and are preferred by patients seeking a natural approach. Despite these advantages, key barriers to the broader application of phytotherapy remain, including the lack of standardization of active constituents, variability in commercial products, and the risk of herb–drug interactions. Further well-designed clinical trials are required to more clearly define the role of herbal therapies within therapeutic algorithms for insomnia. A summary of the main differences between melatonergic drugs and herbal preparations is presented in Table 5 In summary, melatonergic agents and herbal preparations represent two distinct yet complementary approaches to insomnia management. While pharmacological agents offer well-established efficacy and regulatory validation, herbal therapies provide a promising yet underexplored alternative, particularly in mild cases or among patients preferring natural remedies. Given the growing interest in integrative medicine, future research should prioritize well-designed comparative trials, standardization of botanical extracts, and formal cost-effectiveness analyses to guide evidence-based clinical decision-making. 6. Conclusions Melatonergic receptor agonists represent a safer alternative to classical hypnotics, particularly in the treatment of insomnia and circadian rhythm sleep disorders. However, their efficacy and scope of application remain heterogeneous. Melatonin, although safe and well-tolerated, displays low bioavailability and a short half-life, which limits its effectiveness in chronic insomnia. Ramelteon, a selective MT1/MT2 receptor agonist, has a favorable safety profile and poses no risk of dependence, yet its efficacy in extending total sleep time is modest. Tasimelteon has demonstrated efficacy primarily in Non-24-Hour Sleep–Wake Disorder, but its use outside this indication remains limited. Agomelatine, with its dual hypnotic and antidepressant action, offers clinical value, though its use is associated with a risk of hepatotoxicity. All reviewed agents undergo hepatic metabolism, primarily via cytochrome P450 enzymes, which introduces the potential for drug–drug interactions, especially in polypharmacy patients. Compared to benzodiazepines, melatonergic agonists exhibit a significantly better safety profile, lacking addictive potential, tolerance development, and cognitive impairment. Due to limited efficacy and pharmacokinetic variability, further research is warranted to develop novel MT1/MT2 agonists and to evaluate their utility in geriatric and psychiatric populations. Standardized plant-based preparations (e.g., valerian, passionflower), often used by patients as first-line therapies, should also be more extensively studied. Their clinical effects remain poorly documented, and the absence of standardization and potential interactions underline the need for further investigation into their efficacy and safety. The study of the effects of medicinal plants on the mind and body is a long-standing tradition in medicine and pharmacology. However, using these plants to treat mood disorders, insomnia, stress, anxiety, depression, and related conditions is an under-explored area. Due to their multiple constituents, plant-based medicinal products are a feasible alternative to drugs that target a single mediator (e.g., an enzyme). This mitigates non-specific toxicity and inhibits the development of drug resistance, which is most notable for minor, self-limiting conditions. Subsequent investigations must prioritize rigorous clinical trials of well-defined chemical preparations to assess the safety and efficacy of these herbal therapies. This will expedite their integration into conventional medical practice, elevating them from alternative treatments to mainstream therapies. Understanding the underlying mechanisms of these botanical interventions is essential for advancing pharmaceutical interventions, particularly for mental health issues. This will expand therapeutic options for various disorders and offer a more comprehensive, personalized approach to patient care. In conclusion, herbal and natural supplements may play a role in managing insomnia and sleep disorders; however, further research is needed to establish their efficacy, safety, and optimal use. Acknowledgments We gratefully acknowledge Katarzyna Lizurej for her graphic development of our initial sketches. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, K.Ż.; methodology, K.Ż., and W.P. (Wojciech Pichowicz); software, K.Ż., W.K.-K., and A.C.-K.; validation, K.Ż., W.K.-K., and A.C.-K.; formal analysis, K.Ż., A.C.-K.; investigation, K.Ż., W.P. (Wojciech Pichowicz), K.B. (Kamil Biedka), I.S., J.S., M.W., K.B. (Katarzyna Błaszczyk), O.Z., W.P. (Wiktor Petrov), and A.C.-K.; resources, K.Ż., and W.P. (Wojciech Pichowicz), I.S., J.S., K.B. (Kamil Biedka), M.W., K.B. (Katarzyna Błaszczyk), O.Z., W.P. (Wiktor Petrov), and A.C.-K.; data curation, K.Ż.; writing—original draft preparation, K.Ż., W.P. (Wojciech Pichowicz), J.S., K.B. (Kamil Biedka), I.S., M.W., K.B. (Katarzyna Błaszczyk), O.Z., W.K.-K., and A.C.-K.; writing—review and editing, K.Ż., W.P. (Wojciech Pichowicz), K.B. (Kamil Biedka), K.B. (Katarzyna Błaszczyk), W.P. (Wiktor Petrov), and A.C.-K.; visualization, K.Ż., I.S.; supervision, K.Ż.; project administration, K.Ż., and A.C.-K.; funding acquisition, W.K.-K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ICSD-3-TR The International Classification of Sleep Disorders, Third Edition ICD-11 11th Revision of the International Classification of Diseases DSM-5 5th edition of the Diagnostic and Statistical Manual of Mental Disorders SCN Suprachiasmatic nucleus LTP Long-term potentiation cAMP Cyclic adenosine monophosphate AC Adenylate cyclase PKA Protein kinase A P-CREB Phosphorylated CREB PKC Protein kinase C GC Guanylyl cyclase PLC Phospholipase C cGMP Cyclic GMP DAG Diacylglycerol IP 3 Inositol trisphosphate PVN Paraventricular nucleus VTA Ventral tegmental area OX1R/OX2R Orexin-1-receptor/Orexin-2-receptor GIRK G protein–regulated inward rectifier NMDA N-methyl-D-aspartate DMH Hypothalamus NREM Non-rapid eye movement REM Rapid eye movement VLPO Ventrolateral preoptic nucleus TMN Tuberomammillary nucleus LC Locus coeruleus LH/PF Lateral hypothalamus/Perifornical area GPCR G protein-coupled receptor NQO2 Quinone reductase 2 TST Total sleep time sTST Subjective total sleep time SL Sleep latency sSL Subjective sleep latency ASD Autism spectrum disorder LPS Latency to persistent sleep SE Sleep efficiency oSOL Objective sleep onset latency EMA European Medicines Agency MDD Major depressive disorder LSEQ Leeds Sleep Evaluation Questionnaire CGI Clinical Global Impression OR Odds ratio PSQI Pittsburgh Sleep Quality Index TCIM Integrative medicines WHO World Health Organization GAD Generalized anxiety disorder HRSD Hamilton Rating Scale for Depression GABA Gamma-aminobutyric acid NO Nitric oxide References 1. Khara N. Apte A. Vyas Y. Prajapati D. Kshatriya R. Patel S. The Intricacies of Insomnia: A Comprehensive Exploration J. Sleep Med. 2024 21 65 72 10.13078/jsm.240014 2. American Academy of Sleep Medicine International Classification of Sleep Disorders Available online: https://aasm.org/clinical-resources/international-classification-sleep-disorders/ (accessed on 25 March 2025) 3. American Psychiatric Association Diagnostic and Statistical Manual of Mental Disorders: DSM-5-TR 5th ed. American Psychiatric Publishing Washington, DC, USA 2022 4. World Health Organization ICD-11 for Mortality and Morbidity Statistics Available online: https://icd.who.int/browse/2025-01/mms/en#1038292737 (accessed on 25 March 2025) 5. American Academy of Sleep Medicine Insomnia Sleep Disorder Available online: https://sleepeducation.org/sleep-disorders/insomnia/ (accessed on 25 March 2025) 6. Sateia M.J. Insomnia StatPearls [Internet] StatPearls Publishing Treasure Island, FL, USA 2024 7. Knutson K.L. Ryden A.M. Mander B.A. Van Cauter E. Role of sleep duration and quality in the risk and severity of type 2 diabetes mellitus Arch. Intern. Med. 2006 166 1768 1774 10.1001/archinte.166.16.1768 16983057 8. Kasasbeh E. Chi D.S. Krishnaswamy G. Inflammatory aspects of sleep apnea and their cardiovascular consequences South. Med. J. 2006 99 58 68 10.1097/01.smj.0000197705.99639.50 16466124 9. Schwartz D.J. Kohler W.C. Karatinos G. Symptoms of depression in individuals with obstructive sleep apnea may be amenable to treatment with continuous positive airway pressure Chest 2005 128 1304 1309 10.1378/chest.128.3.1304 16162722 10. Hillman D.R. Murphy A.S. Antic R. Pezzullo L. The economic cost of sleep disorders Sleep 2006 29 299 305 10.1093/sleep/29.3.299 16553015 11. Morin C.M. Jarrin D.C. Epidemiology of Insomnia: Prevalence, Course, Risk Factors, and Public Health Burden Sleep Med. Clin. 2022 17 173 191 10.1016/j.jsmc.2022.03.003 35659072 12. Wickwire E.M. Juday T.R. Kelkar M. Heo J. Margiotta C. Frech F.H. Economic Burden of Comorbid Insomnia in 5 Common Medical Disease Subgroups J. Clin. Sleep Med. 2023 19 1293 1302 10.5664/jcsm.10592 37394794 PMC10315590 13. Morphy H. Dunn K.M. Lewis M. Boardman H.F. Croft P.R. Epidemiology of insomnia: A longitudinal study in a UK population Sleep 2007 30 274 280 10.1093/sleep/30.3.274 17425223 14. Naha S. Sivaraman M. Sahota P. Insomnia: A Current Review Mo. Med. 2024 121 44 51 38404423 PMC10887463 15. Ogeil R.P. Chakraborty S.P. Young A.C. Lubman D.I. Clinician and Patient Barriers to the Recognition of Insomnia in Family Practice: A Narrative Summary of Reported Literature Analysed Using the Theoretical Domains Framework BMC Fam. Pract. 2020 21 1 10.1186/s12875-019-1070-0 31901226 PMC6942394 16. Yeom J.W. Cho C.-H. Herbal and Natural Supplements for Improving Sleep: A Literature Review Psychiatry Investig. 2024 21 810 821 10.30773/pi.2024.0121 PMC11321869 39086164 17. Wachełko O. Szpot P. Tusiewicz K. Nowak K. Chłopaś-Konowałek A. Zawadzki M. An Ultra-Sensitive UHPLC-QqQ-MS/MS Method for Determination of 54 Benzodiazepines (Pharmaceutical Drugs, NPS and Metabolites) and z-Drugs in Biological Samples Talanta 2023 251 123816 10.1016/j.talanta.2022.123816 35963014 18. Schifano F. Chiappini S. Corkery J.M. Guirguis A. An Insight into Z-Drug Abuse and Dependence: An Examination of Reports to the European Medicines Agency Database of Suspected Adverse Drug Reactions Int. J. Neuropsychopharmacol. 2019 22 270 277 10.1093/ijnp/pyz007 30722037 PMC6441128 19. Chen L. Bell J.S. Visvanathan R. Hilmer S.N. Emery T. Robson L. Hughes J.M. Tan E.C.K. The Association between Benzodiazepine Use and Sleep Quality in Residential Aged Care Facilities: A Cross-Sectional Study BMC Geriatr. 2016 16 196 10.1186/s12877-016-0363-6 27888835 PMC5124287 20. Reid Finlayson A.J. Macoubrie J. Huff C. Foster D.E. Martin P.R. Experiences with Benzodiazepine Use, Tapering, and Discontinuation: An Internet Survey Ther. Adv. Psychopharmacol. 2022 12 20451253221082386 10.1177/20451253221082386 35499041 PMC9047812 21. Kripke D.F. Hypnotic drug risks of mortality, infection, depression, and cancer: But lack of benefit F1000Research 2016 5 918 10.12688/f1000research.8729.1 27303633 PMC4890308 22. Leach M.J. Page A.T. Herbal medicine for insomnia: A systematic review and meta-analysis Sleep Med. Rev. 2015 24 1 12 10.1016/j.smrv.2014.12.003 25644982 23. Shi Y. Dong J.W. Zhao J.H. Tang L.N. Zhang J.J. Herbal insomnia medications that target GABAergic systems: A review of the psychopharmacological evidence Curr. Neuropharmacol. 2014 12 289 302 10.2174/1570159X11666131227001243 24851093 PMC4023459 24. Rios P. Cardoso R. Morra D. Nincic V. Goodarzi Z. Farah B. Harricharan S. Morin S.M. Leech J. Straus S.E. Comparative effectiveness and safety of pharmacological and non-pharmacological interventions for insomnia: An overview of reviews Syst. Rev. 2019 8 281 10.1186/s13643-019-1163-9 31730011 PMC6857325 25. Zee P.C. Attarian H. Videnovic A. Circadian Rhythm Abnormalities Contin. Lifelong Learn. Neurol. 2013 19 132 147 10.1212/01.CON.0000427209.21177.aa PMC3654533 23385698 26. Reiter R.J. Melatonin: The Chemical Expression of Darkness Mol. Cell. Endocrinol. 1991 79 C153 C158 10.1016/0303-7207(91)90087-9 1936532 27. Acuña-Castroviejo D. Escames G. Venegas C. Díaz-Casado M.E. Lima-Cabello E. López L.C. Rosales-Corral S. Tan D.-X. Reiter R.J. Extrapineal melatonin: Sources, regulation, and potential functions Cell. Mol. Life Sci. 2014 71 2997 3025 10.1007/s00018-014-1579-2 24554058 PMC11113552 28. Liu J. Clough S.J. Hutchinson A.J. Adamah-Biassi E.B. Popovska-Gorevski M. Dubocovich M.L. MT 1 2 Annu. Rev. Pharmacol. Toxicol. 2015 56 361 383 10.1146/annurev-pharmtox-010814-124742 26514204 PMC5091650 29. Pandi-Perumal S.R. Trakht I. Srinivasan V. Spence D.W. Maestroni G.J.M. Zisapel N. Cardinali D.P. Physiological Effects of Melatonin: Role of Melatonin Receptors and Signal Transduction Pathways Prog. Neurobiol. 2008 85 335 353 10.1016/j.pneurobio.2008.04.001 18571301 30. Witt-Enderby P.A. Bennett J. Jarzynka M.J. Firestine S. Melan M.A. Melatonin Receptors and Their Regulation: Biochemical and Structural Mechanisms Life Sci. 2003 72 2183 2198 10.1016/S0024-3205(03)00098-5 12628439 31. Arshad D. Joyia U.M. Fatima S. Khalid N. Rishi A.I. Abdul Rahim N.U. Bukhari S.F. Shairwani G.K. Salmaan A. The Adverse Impact of Excessive Smartphone Screen-Time on Sleep Quality among Young Adults: A Prospective Cohort Sleep Sci. 2021 14 337 341 10.5935/1984-0063.20200114 35087630 PMC8776263 32. Crooke A. Guzman-Aranguez A. Mediero A. Alarma-Estrany P. Carracedo G. Pelaez T. Peral A. Pintor J. Effect of Melatonin and Analogues on Corneal Wound Healing: Involvement of Mt2 Melatonin Receptor Curr. Eye Res. 2015 40 56 65 10.3109/02713683.2014.914540 24892818 33. Gobbi G. Comai S. Differential Function of Melatonin MT1 and MT2 Receptors in REM and NREM Sleep Front. Endocrinol. 2019 10 87 10.3389/fendo.2019.00087 PMC6407453 30881340 34. Legros C. Devavry S. Caignard S. Tessier C. Delagrange P. Ouvry C. Boutin J.A. Nosjean O. Melatonin MT 1 2 Br. J. Pharmacol. 2014 171 186 201 10.1111/bph.12457 24117008 PMC3874706 35. Wang Q. Lu Q. Guo Q. Teng M. Gong Q. Li X. Du Y. Tao Y. Structural basis of the ligand binding and signaling mechanism of melatonin receptors Nat. Commun. 2022 13 454 10.1038/s41467-022-28111-3 35075127 PMC8786939 36. Patel N. Huang X.P. Grandner J.M. Johansson L.C. Stauch B. McCorvy J.D. Liu Y. Roth B. Katritch V. Structure-based discovery of potent and selective melatonin receptor agonists eLife 2020 9 e53779 10.7554/elife.53779 32118583 PMC7080406 37. de Lima Menezes G. Sales Bezerra K. Oliveira J.I.N. Araújo J.F. Galvão D.S. da Silva R.A. Saivish M.V. Fulco U.L. Quantum mechanics insights into melatonin and analogs binding to melatonin MT1 and MT2 receptors Sci. Rep. 2024 14 10922 10.1038/s41598-024-59786-x 38740789 PMC11091226 38. Cecon E. Liu L. Jockers R. Melatonin Receptor Structures Shed New Light on Melatonin Research J. Pineal Res. 2019 67 e12606 10.1111/jpi.12606 31442321 39. Ikram M. Park H.Y. Ali T. Kim M.O. Melatonin as a Potential Regulator of Oxidative Stress, and Neuroinflammation: Mechanisms and Implications for the Management of Brain Injury-Induced Neurodegeneration J. Inflamm. Res. 2021 14 6251 6264 10.2147/JIR.S334423 34866924 PMC8637421 40. Wang L.M. Suthana N.A. Chaudhury D. Weaver D.R. Colwell C.S. Melatonin Inhibits Hippocampal Long-Term Potentiation Eur. J. Neurosci. 2005 22 2231 2237 10.1111/j.1460-9568.2005.04408.x 16262661 PMC2581482 41. Jilg A. Bechstein P. Saade A. Dick M. Li T.X. Tosini G. Rami A. Zemmar A. Stehle J.H. Melatonin modulates daytime-dependent synaptic plasticity and learning efficiency J. Pineal Res. 2019 66 e12553 10.1111/jpi.12553 30618149 PMC6405292 42. Chang H.-M. Lin H.-C. Cheng H.-L. Liao C.-K. Tseng T.-J. Renn T.-Y. Lan C.-T. Chen L.-Y. Melatonin Successfully Rescues the Hippocampal Molecular Machinery and Enhances Anti-oxidative Activity Following Early-Life Sleep Deprivation Injury Antioxidants 2021 10 774 10.3390/antiox10050774 34068192 PMC8153000 43. Gumuslu E. Mutlu O. Sunnetci D. Ulak G. Celikyurt I.K. Cine N. Akar F. Savlı H. Erden F. The Antidepressant Agomelatine Improves Memory Deterioration and Upregulates CREB and BDNF Gene Expression Levels in Unpredictable Chronic Mild Stress (UCMS)-Exposed Mice Drug Target Insights 2014 8 11 21 10.4137/DTI.S13870 24634580 PMC3948735 44. Lopez-Canul M. Palazzo E. Dominguez-Lopez S. Luongo L. Lacoste B. Comai S. Angeloni D. Fraschini F. Boccella S. Spadoni G. Selective Melatonin MT2 Receptor Ligands Relieve Neuropathic Pain through Modulation of Brainstem Descending Antinociceptive Pathways Pain 2015 156 305 317 10.1097/01.j.pain.0000460311.71572.5f 25599452 45. Emet M. Ozcan H. Ozel L. Yayla M. Halici Z. Hacimuftuoglu A. A Review of Melatonin, Its Receptors and Drugs Eurasian J. Med. 2016 48 135 141 10.5152/eurasianjmed.2015.0267 27551178 PMC4970552 46. Zhang Y. Kornhauser J.M. Zee P.C. Mayo K.E. Takahashi J.S. Turek F.W. Effects of Aging on Light-Induced Phase-Shifting of Circadian Behavioral Rhythms, Fos Expression and CREB Phosphorylation in the Hamster Suprachiasmatic Nucleus Neuroscience 1996 70 951 961 10.1016/0306-4522(95)00408-4 8848176 47. Weaver D.R. Capodice C.E. Postmortem Stability of Melatonin Receptor Binding and Clock-Relevant MRNAs in Mouse Suprachiasmatic Nucleus J. Biol. Rhythms 2001 16 216 223 10.1177/074873040101600304 11407781 48. Dubocovich M.L. Markowska M. Functional MT 1 2 Endocrine 2005 27 101 110 10.1385/ENDO:27:2:101 16217123 49. Dubocovich M.L. Melatonin Receptors: Role on Sleep and Circadian Rhythm Regulation Sleep Med. 2007 8 34 42 10.1016/j.sleep.2007.10.007 18032103 50. Ma M.A. Morrison E.H. Neuroanatomy, Nucleus Suprachiasmatic StatPearls StatPearls Publishing Treasure Island, FL, USA 2023 31536270 51. Hattar S. Liao H.W. Takao M. Berson D.M. Yau K.W. Melanopsin-Containing Retinal Ganglion Cells: Architecture, Projections, and Intrinsic Photosensitivity Science 2002 295 1065 1070 10.1126/science.1069609 11834834 PMC2885915 52. Blume C. Garbazza C. Spitschan M. Effects of Light on Human Circadian Rhythms, Sleep and Mood Somnologie 2019 23 147 156 10.1007/S11818-019-00215-X 31534436 PMC6751071 53. Foulkes N.S. Borjigin J. Snyder S.H. Sassone-Corsi P. Rhythmic Transcription: The Molecular Basis of Circadian Melatonin Synthesis Trends Neurosci. 1997 20 487 492 10.1016/S0166-2236(97)01109-0 9347618 54. Bell A. Hewins B. Bishop C. Fortin A. Wang J. Creamer J.L. Collen J. Werner J.K. Traumatic Brain Injury, Sleep, and Melatonin—Intrinsic Changes with Therapeutic Potential Clocks Sleep 2023 5 177 203 10.3390/clockssleep5020016 37092428 PMC10123665 55. Kozaki T. Arata T. Kubokawa A. Salivary Melatonin Concentrations in a Sitting and a Standing Position J. Horm. 2013 2013 236325 10.1155/2013/236325 56. Moustafa-Farag M. Elkelish A. Dafea M. Khan M. Arnao M.B. Abdelhamid M.T. El-Ezz A.A. Almoneafy A. Mahmoud A. Awad M. Role of Melatonin in Plant Tolerance to Soil Stressors: Salinity, PH and Heavy Metals Molecules 2020 25 5359 10.3390/molecules25225359 33212772 PMC7696660 57. Abrams J.K. Johnson P.L. Hay-Schmidt A. Mikkelsen J.D. Shekhar A. Lowry C.A. Serotonergic Systems Associated with Arousal and Vigilance Behaviors Following Administration of Anxiogenic Drugs Neuroscience 2005 133 983 997 10.1016/j.neuroscience.2005.03.025 15916857 58. Graham S.J. Langley R.W. Verduzco A.M.B. Bradshaw C.M. Szabadi E. Effects of Ketanserin and Haloperidol on Prepulse Inhibition of the Acoustic Startle (Eyeblink) Response and the N1/P2 Auditory Evoked Response in Man J. Psychopharmacol. 2002 16 15 22 10.1177/026988110201600101 11949767 59. Future Treatments for Depression, Anxiety, Sleep Disorders, Psychosis, and ADHD—Neurotransmitter.Net Available online: https://www.neurotransmitter.net/newdrugs.html (accessed on 5 April 2025) 60. Millan M.J. Gobert A. Lejeune F. Dekeyne A. Newman-Tancredi A. Pasteau V. Rivet J.M. Cussac D. The Novel Melatonin Agonist Agomelatine (S20098) Is an Antagonist at 5-Hydroxytryptamine2C Receptors, Blockade of Which Enhances the Activity of Frontocortical Dopaminergic and Adrenergic Pathways J. Pharmacol. Exp. Ther. 2003 306 954 964 10.1124/jpet.103.051797 12750432 61. Al Hasan M.S. Bhuia M.S. Chowdhury R. Husain Z. Saifuzzaman M. Mia E. Akbor M.S. Yana N.T. Islam M.A. Ansari S.A. Tangeretin Enhances Sedative Activity of Diazepam in Swiss Mice through GABAA Receptor Interaction: In Vivo and In Silico Approaches Neuroscience 2025 572 1 10 10.1016/j.neuroscience.2025.03.004 40049390 62. Edwards Z. Preuss C.V. GABA Receptor Positive Allosteric Modulators StatPearls StatPearls Publishing Treasure Island, FL, USA 2024 32119330 63. Li J. Wei Y. Xiang J. Zhang D. Role of the Ventral Tegmental Area in General Anesthesia Eur. J. Pharmacol. 2025 986 177145 10.1016/j.ejphar.2024.177145 39566814 64. Oishi Y. Suzuki Y. Takahashi K. Yonezawa T. Kanda T. Takata Y. Cherasse Y. Lazarus M. Activation of Ventral Tegmental Area Dopamine Neurons Produces Wakefulness through Dopamine D2-like Receptors in Mice Brain Struct. Funct. 2017 222 2907 2915 10.1007/s00429-017-1365-7 28124114 65. Bubser M. Fadel J.R. Jackson L.L. Meador-Woodruff J.H. Jing D. Deutch A.Y. Dopaminergic Regulation of Orexin Neurons Eur. J. Neurosci. 2005 21 2993 3001 10.1111/j.1460-9568.2005.04121.x 15978010 66. Mignot E. Taheri S. Nishino S. Sleeping with the Hypothalamus: Emerging Therapeutic Targets for Sleep Disorders Nat. Neurosci. 2002 5 1071 1075 10.1038/nn944 12403989 67. Scammel T.E. Winrow C.J. Orexin Receptors: Pharmacology and Therapeutic Opportunities Annu. Rev. Pharmacol. Toxicol. 2011 51 243 266 10.1146/annurev-pharmtox-010510-100528 21034217 PMC3058259 68. Sakurai T. Amemiya A. Ishii M. Matsuzaki I. Chemelli R.M. Tanaka H. Williams S.C. Richardson J.A. Kozlowski G.P. Wilson S. Orexins and Orexin Receptors: A Family of Hypothalamic Neuropeptides and G Protein-Coupled Receptors That Regulate Feeding Behavior Cell 1998 92 573 585 10.1016/S0092-8674(00)80949-6 9491897 69. Chou T.C. Scammell T.E. Gooley J.J. Gaus S.E. Saper C.B. Lu J. Critical Role of Dorsomedial Hypothalamic Nucleus in a Wide Range of Behavioral Circadian Rhythms J. Neurosci. 2003 23 10691 10702 10.1523/JNEUROSCI.23-33-10691.2003 14627654 PMC6740926 70. Kilduff T.S. Peyron C. The Hypocretin/Orexin Ligand-Receptor System: Implications for Sleep and Sleep Disorders Trends Neurosci. 2000 23 359 365 10.1016/S0166-2236(00)01594-0 10906799 71. Sutcliffe J.G. de Lecea L. The Hypocretins: Setting the Arousal Threshold Nat. Rev. Neurosci. 2002 3 339 348 10.1038/nrn808 11988773 72. Pace-Schott E.F. Hobson J.A. The Neurobiology of Sleep: Genetics, Cellular Physiology and Subcortical Networks Nat. Rev. Neurosci. 2002 3 591 605 10.1038/nrn895 12154361 73. Samuels E.R. Szabadi E. Functional Neuroanatomy of the Noradrenergic Locus Coeruleus: Its Roles in the Regulation of Arousal and Autonomic Function Part II: Physiological and Pharmacological Manipulations and Pathological Alterations of Locus Coeruleus Activity in Humans Curr. Neuropharmacol. 2008 6 254 285 10.2174/157015908785777193 19506724 PMC2687931 74. Hou R.H. Freeman C. Langley R.W. Szabadi E. Bradshaw C.M. Does Modafinil Activate the Locus Coeruleus in Man? Comparison of Modafinil and Clonidine on Arousal and Autonomic Functions in Human Volunteers Psychopharmacology 2005 181 537 549 10.1007/s00213-005-0013-8 15983798 75. Nelson L.E. Lu J. Guo T. Saper C.B. Franks N.P. Maze M. The A2-Adrenoceptor Agonist Dexmedetomidine Converges on an Endogenous Sleep-Promoting Pathway to Exert Its Sedative Effects Anesthesiology 2003 98 428 436 10.1097/00000542-200302000-00024 12552203 76. Szabadi E. Drugs for Sleep Disorders: Mechanisms and Therapeutic Prospects Br. J. Clin. Pharmacol. 2006 61 761 766 10.1111/j.1365-2125.2006.02680.x 16722842 PMC1885116 77. Epstein F.H. Brzezinski A. Review Articles Mechanisms of Disease N. Engl. J. Med. 2009 361 2066 2078 78. Dawson D. Encel N. Melatonin and Sleep in Humans J. Pineal Res. 1993 15 1 12 10.1111/j.1600-079X.1993.tb00503.x 8229640 79. Boutin J.A. Ferry G. Is There Sufficient Evidence that the Melatonin Binding Site MT3 Is Quinone Reductase 2? J. Pharmacol. Exp. Ther. 2019 368 59 65 10.1124/jpet.118.253260 30389722 80. Ng K.Y. Leong M.K. Liang H. Paxinos G. Melatonin Receptors: Distribution in Mammalian Brain and Their Respective Putative Functions Brain Struct. Funct. 2017 222 2921 2939 10.1007/s00429-017-1439-6 28478550 81. Salehi B. Sharopov F. Fokou P.V.T. Kobylinska A. de Jonge L. Tadio K. Sharifi-Rad J. Posmyk M.M. Martorell M. Martins N. Melatonin in Medicinal and Food Plants: Occurrence, Bioavailability, and Health Potential for Humans Cells 2019 8 681 10.3390/cells8070681 31284489 PMC6678868 82. Letelier M.E. Jara-Sandoval J. Molina-Berríos A. Faúndez M. Aracena-Parks P. Aguilera F. Melatonin Protects the Cytochrome P450 System through a Novel Antioxidant Mechanism Chem. Biol. Interact. 2010 185 208 214 10.1016/j.cbi.2010.03.020 20302852 83. Ma X. Idle J.R. Krausz K.W. Gonzalez F.J. Metabolism of Melatonin by Human Cytochromes P450 Drug Metab. Dispos. 2005 33 489 494 10.1124/dmd.104.002410 15616152 84. Chojnacki C. Błońska A. Chojnacki J. The Effects of Melatonin on Elevated Liver Enzymes during Statin Treatment BioMed Res. Int. 2017 2017 3204504 10.1155/2017/3204504 28630863 PMC5467275 85. Zhdanova I.V. Wurtman R.J. Balcioglu A. Kartashov A.I. Lynch H.J. Endogenous Melatonin Levels and the Fate of Exogenous Melatonin: Age Effects J. Gerontol. Ser. A Biol. Sci. Med. Sci. 1998 53 B293 B298 10.1093/gerona/53A.4.B293 18314560 86. Cavallo A. Ritschel W.A. Pharmacokinetics of Melatonin in Human Sexual Maturation J. Clin. Endocrinol. Metab. 1996 81 1882 1886 10.1210/jcem.81.5.8626852 8626852 87. Gunn P.J. Middleton B. Davies S.K. Revell V.L. Skene D.J. Sex Differences in the Circadian Profiles of Melatonin and Cortisol in Plasma and Urine Matrices under Constant Routine Conditions Chronobiol. Int. 2016 33 39 50 10.3109/07420528.2015.1112396 26731571 PMC4819823 88. Harpsøe N.G. Andersen L.P.H. Gögenur I. Rosenberg J. Clinical Pharmacokinetics of Melatonin: A Systematic Review Eur. J. Clin. Pharmacol. 2015 71 901 909 10.1007/s00228-015-1873-4 26008214 89. Andersen L.P.H. Werner M.U. Rosenkilde M.M. Harpsøe N.G. Fuglsang H. Rosenberg J. Gögenur I. Pharmacokinetics of Oral and Intravenous Melatonin in Healthy Volunteers BMC Pharmacol. Toxicol. 2016 17 8 10.1186/s40360-016-0052-2 26893170 PMC4759723 90. Pepping J. Melatonin Am. J. Health-Syst. Pharm. 1999 56 2520 2527 10.1093/ajhp/56.24.2520 10613367 91. Zetner D. Andersen L.P.K. Alder R. Jessen M.L. Tolstrup A. Rosenberg J. Pharmacokinetics and Safety of Intravenous, Intravesical, Rectal, Transdermal, and Vaginal Melatonin in Healthy Female Volunteers: A Cross-Over Study Pharmacology 2021 106 169 176 10.1159/000510252 32937627 92. Demuro R.L. Nafziger A.N. Blask D.E. Menhinick A.M. Bertino J.S. The Absolute Bioavailability of Oral Melatonin J. Clin. Pharmacol. 2000 40 781 784 10.1177/00912700022009422 10883420 93. Gooneratne N.S. Edwards A.Y.Z. Zhou C. Cuellar N. Grandner M.A. Barrett J.S. Melatonin Pharmacokinetics Following Two Different Oral Surge-Sustained Release Doses in Older Adults J. Pineal Res. 2012 52 437 445 10.1111/j.1600-079X.2011.00958.x 22348451 PMC3682489 94. Lemoine P. Wade A.G. Katz A. Nir T. Zisapel N. Efficacy and Safety of Prolonged-Release Melatonin for Insomnia in Middle-Aged and Elderly Patients with Hypertension: A Combined Analysis of Controlled Clinical Trials Integr. Blood Press. Control 2012 5 9 17 10.2147/IBPC.S27240 22346363 PMC3278206 95. Luthringer R. Muzet M. Zisapel N. Staner L. The effect of prolonged-release melatonin on sleep measures and psychomotor performance in elderly patients with insomnia Int. Clin. Psychopharmacol. 2009 24 239 249 10.1097/YIC.0b013e32832e9b08 19584739 96. Wade A.G. Ford I. Crawford G. McConnachie A. Nir T. Laudon M. Zisapel N. Nightly treatment of primary insomnia with prolonged release melatonin for 6 months: A randomized placebo controlled trial on age and endogenous melatonin as predictors of efficacy and safety BMC Med. 2010 8 51 10.1186/1741-7015-8-51 20712869 PMC2933606 97. Appleton R.E. Jones A.P. Gamble C. Williamson P.R. Wiggs L. Montgomery P. Sutcliffe A. Barker C. Gringras P. The use of MElatonin in children with neurodevelopmental disorders and impaired sleep: A randomised, double-blind, placebo-controlled, parallel study (MENDS) Health Technol. Assess. 2012 16 1 239 10.3310/hta16400 23098680 98. Smits M.G. Nagtegaal E.E. van der Heijden J. Coenen A.M. Kerkhof G.A. Melatonin for chronic sleep onset insomnia in children: A randomized placebo-controlled trial J. Child Neurol. 2001 16 86 92 10.1177/088307380101600204 11292231 99. Garfinkel D. Zisapel N. Wainstein J. Laudon M. Facilitation of Benzodiazepine Discontinuation by Melatonin A New Clinical Approach Arch. Intern. Med. 1999 159 2456 2460 10.1001/archinte.159.20.2456 10665894 100. Yue J.L. Chang X.W. Zheng J.W. Shi L. Xiang Y.J. Que J.Y. Yuan K. Deng J.H. Teng T. Li Y.Y. Efficacy and Tolerability of Pharmacological Treatments for Insomnia in Adults: A Systematic Review and Network Meta-Analysis Sleep Med. Rev. 2023 68 101746 10.1016/j.smrv.2023.101746 36701954 101. Wang L. Pan Y. Ye C. Guo L. Luo S. Dai S. Chen N. Wang E. A Network Meta-Analysis of the Long- and Short-Term Efficacy of Sleep Medicines in Adults and Older Adults Neurosci. Biobehav. Rev. 2021 131 489 496 10.1016/j.neubiorev.2021.09.035 34560134 102. Sugumaran R. Sai Krishna K.S. Saibaba J. Narayan S.K. Sandhiya S. Rajeswari M. Melatonin on Sleep in Parkinson’s Disease: A Randomized Double Blind Placebo Controlled Trial Sleep Med. 2024 124 502 509 10.1016/j.sleep.2024.10.020 39437460 103. Ahn J.H. Kim M. Park S. Jang W. Park J. Oh E. Cho J.W. Kim J.S. Youn J. Prolonged-Release Melatonin in Parkinson’s Disease Patients with a Poor Sleep Quality: A Randomized Trial Park. Relat. Disord. 2020 75 50 54 10.1016/j.parkreldis.2020.03.029 32480307 104. Xiong M. Li F. Liu Z. Xie X. Shen H. Li W. Wei L. He R. Efficacy of Melatonin for Insomnia in Children with Autism Spectrum Disorder: A Meta-Analysis Neuropediatrics 2022 54 167 173 10.1055/s-0043-1761437 PMC10166641 36827993 105. Hayashi M. Mishima K. Fukumizu M. Takahashi H. Ishikawa Y. Hamada I. Sugioka H. Yotsuya O. Yamashita Y. Melatonin Treatment and Adequate Sleep Hygiene Interventions in Children with Autism Spectrum Disorder: A Randomized Controlled Trial J. Autism Dev. Disord. 2022 52 2784 2793 10.1007/s10803-021-05139-w 34181143 106. de Seabra M.L.V. Bignotto M. Pinto L.R. Jr. Tufik S. Randomized, Double-blind Clinical Trial, Controlled with Placebo, of the Toxicology of Chronic Melatonin Treatment J. Pineal Res. 2000 29 193 200 10.1034/j.1600-0633.2002.290401.x 11068941 107. Buscemi N. Vandermeer B. Hooton N. Pandya R. Tjosvold L. Hartling L. Baker G. Klassen T.P. Vohra S. The Efficacy and Safety of Exogenous Melatonin for Primary Sleep Disorders: A Meta-Analysis J. Gen. Intern. Med. 2005 20 1151 1158 10.1111/j.1525-1497.2005.0243.x 16423108 PMC1490287 108. Boutin J.A. Kennaway D.J. Jockers R. Melatonin: Facts, Extrapolations and Clinical Trials Biomolecules 2023 13 943 10.3390/biom13060943 37371523 PMC10295901 109. Bishop-Freeman S.C. Young K.A. Labay L.M. Beuhler M.C. Hudson J.S. Melatonin Supplementation in Undetermined Pediatric Deaths J. Anal. Toxicol. 2022 46 808 816 10.1093/jat/bkac033 35639879 110. Kim H.K. Yang K.I. Melatonin and Melatonergic Drugs in Sleep Disorders Transl. Clin. Pharmacol. 2022 30 163 171 10.12793/tcp.2022.30.e21 36632077 PMC9810491 111. Nishimon S. Nishino N. Nishino S. Advances in the Pharmacological Management of Non-24-h Sleep-Wake Disorder Expert Opin. Pharmacother. 2021 22 1039 1049 10.1080/14656566.2021.1876665 33618599 112. European Medicines Agency Hetlioz—EPAR Product Information 2022 Available online: https://www.ema.europa.eu/en/medicines/human/EPAR/hetlioz (accessed on 29 August 2025) 113. Zlotos D.P. Jockers R. Cecon E. Rivara S. Witt-Enderby P.A. MT 1 2 J. Med. Chem. 2014 57 3161 3185 10.1021/jm401343c 24228714 114. Ogilvie B.W. Torres R. Dressman M.A. Kramer W.G. Baroldi P. Clinical Assessment of Drug-Drug Interactions of Tasimelteon, a Novel Dual Melatonin Receptor Agonist J. Clin. Pharmacol. 2015 55 1004 1011 10.1002/jcph.507 25851638 115. Torres R. Kramer W.G. Baroldi P. Pharmacokinetics of the Dual Melatonin Receptor Agonist Tasimelteon in Subjects with Hepatic or Renal Impairment J. Clin. Pharmacol. 2015 55 525 533 10.1002/jcph.440 25450415 PMC4418347 116. Atkin T. Comai S. Gobbi G. Drugs for Insomnia beyond Benzodiazepines: Pharmacology, Clinical Applications, and Discovery Pharmacol. Rev. 2018 70 197 245 10.1124/pr.117.014381 29487083 117. Bonacci J.M. Venci J.V. Gandhi M.A. Tasimelteon (HetliozTM): A New Melatonin Receptor Agonist for the Treatment of Non-24-Hour Sleep-Wake Disorder J. Pharm. Pract. 2015 28 473 478 10.1177/0897190014544792 25092604 118. Lockley S.W. Dressman M.A. Licamele L. Xiao C. Fisher D.M. Flynn-Evans E.E. Hull J.T. Torres R. Lavedan C. Polymeropoulos M.H. Tasimelteon for Non-24-Hour Sleep-Wake Disorder in Totally Blind People (SET and RESET): Two Multicentre, Randomised, Double-Masked, Placebo-Controlled Phase 3 Trials Lancet 2015 386 1754 1764 10.1016/S0140-6736(15)60031-9 26466871 119. Connolly P.J. Quigg M. Davis E.M. Improvement in Non-24-h Sleep-Wake Rhythm Disorder in a Sighted Individual Treated with a Melatonin Receptor Agonist Sleep Med. 2024 116 41 42 10.1016/j.sleep.2023.10.041 38422783 120. Polymeropoulos C.M. Mohrman M.A. Keefe M.S. Brzezynski J.L. Wang J. Prokosch L.S. Polymeropoulos V.M. Xiao C. Birznieks G. Polymeropoulos M.H. Efficacy of Tasimelteon (HETLIOZ ® Front. Neurol. 2020 11 611 10.3389/fneur.2020.00611 32754110 PMC7381312 121. Rajaratnam S.M. Polymeropoulos M.H. Fisher D.M. Roth T. Scott C. Birznieks G. Klerman E.B. Melatonin Agonist Tasimelteon (VEC-162) for Transient Insomnia after Sleep-Time Shift: Two Randomised Controlled Multicentre Trials Lancet 2009 373 482 491 10.1016/S0140-6736(08)61812-7 19054552 122. Torres R. Dressman M.A. Kramer W.G. Baroldi P. Absolute Bioavailability of Tasimelteon Am. J. Ther. 2015 22 355 360 10.1097/MJT.0000000000000195 25658956 123. Torres R. Fisher M. Birznieks G. Polymeropoulos C. Kay G.G. Xiao C. Polymeropoulos M.H. Simulated Driving Performance in Healthy Adults after Night-Time Administration of 20 Mg Tasimelteon J. Sleep Res. 2022 31 e13430 10.1111/jsr.13430 34152055 PMC9285441 124. Zuo T. Sun S. Yang J. Wu H. Peng W. Assessment of Adverse Events of Tasimelteon: A Real-World Pharmacovigilance Study Based on FAERS Expert Opin. Drug Saf. 2025 1 8 10.1080/14740338.2025.2464068 39928318 125. Gerdin M.J. Masana M.I. Rivera-Bermúdez M.A. Hudson R.L. Earnest D.J. Gillette M.U. Dubocovich M.L. Melatonin Desensitizes Endogenous MT 2 Melatonin Receptors in the Rat Suprachiasmatic Nucleus: Relevance for Defining the Periods of Sensitivity of the Mammalian Circadian Clock to Melatonin FASEB J. 2004 18 1646 1656 10.1096/fj.03-1339com 15522910 126. Spadoni G. Bedini A. Lucarini S. Mor M. Rivara S. Pharmacokinetic and Pharmacodynamic Evaluation of Ramelteon: An Insomnia Therapy Expert Opin. Drug Metab. Toxicol. 2015 11 1145 1156 10.1517/17425255.2015.1045487 25956235 127. Levinsohn E.A. Radhakrishnan V. Euting H. Kaplan G.B. Pharmacological Management of Sleep–Wake Disturbances in Delirium J. Clin. Pharmacol. 2025 65 285 302 10.1002/jcph.6151 39415561 128. Kato K. Hirai K. Nishiyama K. Uchikawa O. Fukatsu K. Ohkawa S. Kawamata Y. Hinuma S. Miyamoto M. Neurochemical Properties of Ramelteon (TAK-375), a Selective MT1/MT2 Receptor Agonist Neuropharmacology 2005 48 301 310 10.1016/j.neuropharm.2004.09.007 15695169 129. Shimura A. Kanno T. Inoue T. Ultra-Low-Dose Early Night Ramelteon Administration for the Treatment of Delayed Sleep-Wake Phase Disorder: Case Reports with a Pharmacological Review J. Clin. Sleep Med. 2022 18 2861 2865 10.5664/jcsm.10188 35929592 PMC9713914 130. Miyamoto M. Pharmacology of Ramelteon, a Selective MT1/MT2 Receptor Agonist: A Novel Therapeutic Drug for Sleep Disorders CNS Neurosci. Ther. 2009 15 32 51 10.1111/j.1755-5949.2008.00066.x 19228178 PMC2871175 131. Srujitha M. Daniel A. Ashley M.C. Marion K.S. Jeannie K.L. Use of Melatonin and/on Ramelteon for the Treatment of Insomnia in Older Adults: A Systematic Review and Meta-Analysis J. Clin. Med. 2022 11 5138 10.3390/jcm11175138 36079069 PMC9456584 132. Srinivasan V. Brzezinski A. Pandi-Perumal S.R. Spence D.W. Cardinali D.P. Brown G.M. Melatonin Agonists in Primary Insomnia and Depression-Associated Insomnia: Are They Superior to Sedative-Hypnotics? Prog. Neuropsychopharmacol. Biol. Psychiatry 2011 35 913 923 10.1016/j.pnpbp.2011.03.013 21453740 133. Hardeland R. Poeggeler B. Melatonin and Synthetic Melatonergic Agonists: Actions and Metabolism in the Central Nervous System Cent. Nerv. Syst. Agents Med. Chem. 2012 12 189 216 10.2174/187152412802430129 22640220 134. Kuriyama A. Honda M. Hayashino Y. Ramelteon for the Treatment of Insomnia in Adults: A Systematic Review and Meta-Analysis Sleep Med. 2014 15 385 392 10.1016/j.sleep.2013.11.788 24656909 135. Maruani J. Reynaud E. Chambe J. Palagini L. Bourgin P. Geoffroy P.A. Efficacy of Melatonin and Ramelteon for the Acute and Long-Term Management of Insomnia Disorder in Adults: A Systematic Review and Meta-Analysis J. Sleep Res. 2023 32 e13939 10.1111/jsr.13939 37434463 136. de Bodinat C. Guardiola-Lemaitre B. Mocaër E. Renard P. Muñoz C. Millan M.J. Agomelatine, the First Melatonergic Antidepressant: Discovery, Characterization and Development Nat. Rev. Drug Discov. 2010 9 628 642 10.1038/nrd3140 20577266 137. Gahr M. Agomelatine in the Treatment of Major Depressive Disorder: An Assessment of Benefits and Risks Curr. Neuropharmacol. 2014 12 387 398 10.2174/1570159X12999140619122914 PMC4243030 25426008 138. Green B. Focus on Agomelatine Curr. Med. Res. Opin. 2011 27 745 749 10.1185/03007995.2011.554534 21271795 139. Lemoine P. Guilleminault C. Alvarez E. Improvement in Subjective Sleep in Major Depressive Disorder with a Novel Antidepressant, Agomelatine: Randomized, Double-Blind Comparison with Venlafaxine J. Clin. Psychiatry 2007 68 1723 1732 10.4088/JCP.v68n1112 18052566 140. Quera-Salva M.-A. Hajak G. Philip P. Montplaisir J. Keufer-Le Gall S. Laredo J. Guilleminault C. Comparison of Agomelatine and Escitalopram on Nighttime Sleep and Daytime Condition and Efficacy in Major Depressive Disorder Patients Int. Clin. Psychopharmacol. 2011 26 252 262 10.1097/YIC.0b013e328349b117 21829106 141. Hsing S.C. Jin Y.T. Tzeng N.S. Chung C.H. Chen T.Y. Chang H.A. Kao Y.C. Chien W.C. Is Agomelatine Associated with Less Sedative-Hypnotic Usage in Patients with Major Depressive Disorder? A Nationwide, Population-Based Study Neuropsychiatr. Dis. Treat. 2020 16 1727 10.2147/NDT.S257723 32801707 PMC7384877 142. Grosshans M. Mutschler J. Luderer M. Mann K. Kiefer F. Agomelatine Is Effective in Reducing Insomnia in Abstinent Alcohol-Dependent Patients Clin. Neuropharmacol. 2014 37 6 8 10.1097/WNF.0000000000000007 24434525 143. Gorwood P. Benichou J. Moore N. Álvarez Martínez E. Mertens J. Aguglia E. Figueira M.L. Falkai P. Olivier V. Wattez M. The Safety of Agomelatine in Standard Medical Practice in Depressed Patients: A 26-Week International Multicentre Cohort Study Hum. Psychopharmacol. 2021 36 1 11 10.1002/hup.2759 PMC7816263 32976677 144. Longo L.P. Johnson B. Addiction: Part I. Benzodiazepines—Side effects, abuse risk and alternatives Am. Fam. Physician 2000 61 2121 2128 10779253 145. Stewart S.A. The effects of benzodiazepines on cognition J. Clin. Psychiatry 2005 66 9 13 15762814 146. Yeung W.-F. Chung K.-F. Poon M.M.K. Ho F.Y.-Y. Zhang S.-P. Zhang Z.-J. Ziea E.T.-C. Wong V.T. Chinese herbal medicine for insomnia: A systematic review of randomized controlled trials Sleep Med. Rev. 2012 16 497 507 10.1016/j.smrv.2011.12.005 22440393 147. Jensen M.G. Goode M. Heinrich M. Herbal medicines and botanicals for managing insomnia, stress, anxiety, and depression: A critical review of the emerging evidence focusing on the Middle East and Africa PharmaNutrition 2024 29 100399 10.1016/j.phanu.2024.100399 148. Mihyaoui A.E. Esteves Da Silva J.C.G. Charfi S. Chamomile ( Matricaria chamomilla Life 2022 12 479 10.3390/life12040479 35454969 PMC9032859 149. Amsterdam J.D. Li Y. Soeller I. Rockwell K. Mao J.J. Shults J. A randomized, double-blind, placebo-controlled trial of Oral Matricaria Recutita (Chamomile) extract therapy of generalized anxiety disorder J. Clin. Psychopharmacol. 2009 29 378 382 10.1097/JCP.0b013e3181ac935c 19593179 PMC3600416 150. Miraj S. Alesaeidi S. A systematic review study of therapeutic effects of Matricaria Recuitta Chamomile (Chamomile) Electron. Physician 2016 8 3024 3031 10.19082/3024 27790360 PMC5074766 151. Tsuchiya H. Anesthetic agents of plant origin: A review of phytochemicals with anesthetic activity Molecules 2017 22 1369 10.3390/molecules22081369 28820497 PMC6152143 152. Adib-Hajbaghery M. Mousavi S.N. The effects of chamomile extract o sleep quality among elderly people: A clinical trial Complement. Ther. Med. 2017 35 109 114 29154054 10.1016/j.ctim.2017.09.010 153. Amsterdam J.D. Li Q.S. Xie S.X. Putative antidepressant effect of Chamomile ( Matricaria chamomilla J. Alter. Complement Med. 2020 26 813 819 10.1089/acm.2019.0252 PMC7488203 31808709 154. Chang S.-M. Chen C.-H. Effects of an intervention with drinking chamomile tea on sleep quality and depression in sleep disturbed postnatal women: A randomized controlled trial, Randomized Controlled Trial J. Adv. Nurs. 2016 72 306 315 10.1111/jan.12836 26483209 155. Srivastava J.K. Shankar E. Gupta S. Chamomile: A herbal medicine of the past with bright future Mol. Med. Rep. 2010 3 895 901 10.3892/mmr.2010.377 21132119 PMC2995283 156. Pierro F. Sisti D. Rocchi M. Belli A. Bertuccioli A. Cazzaniga M. Palazzi C.M. Tanda M.L. Zerbinati N. Effects of Melissa officinalis Nutrients 2024 16 4199 10.3390/nu16234199 39683592 PMC11644815 157. Ranjbar M. Firoozabadi A. Salehi A. Ghorbanifar Z. Zarshenas M.M. Sadeghniiat-Haghighi K. Rezaeizadeh H. Effects of Herbal combination ( Melissa officinalis Nepeta menthoides Boiss Integr. Med. Res. 2018 7 328 332 10.1016/j.imr.2018.08.001 30591886 PMC6303415 158. McCarter S.J. Hagen P.T. St Louis E.K. Rieck T.M. Haider C.R. Holmes D.R. Morgenthaler T.I. Physiological markers of sleep quality: A scoping review Sleep Med. Rev. 2022 64 101657 10.1016/j.smrv.2022.101657 35753151 159. Shakeri A. Sahebkar A. Javadi B. Melissa officinalis J. Ethnopharmacol. 2016 188 204 228 10.1016/j.jep.2016.05.010 27167460 160. Kara M. Sahin S. Rabbani F. An in vitro analysis of an innovative standardized phospholipid carrier-based Melissa officinalis Front. Mol. Biosci. 2024 11 1359177 10.3389/fmolb.2024.1359177 38545418 PMC10965792 161. Akhondzadeh S. Noroozian M. Mohammadi M. Melissa officinalis J. Neurol. Neurosurg. Psychiatry 2003 74 863 10.1136/jnnp.74.7.863 12810768 PMC1738567 162. Kennedy D.O. Little W. Scholey A.B. Attenuation of laboratory-induced stress in humans after acute administration of Melissa officinalis Psychosom. Med. 2004 66 607 613 10.1097/01.psy.0000132877.72833.71 15272110 163. Scholey A. Gibbs A. Neale C. Anti-stress effects of lemon balm-containing foods Nutrients 2014 6 4805 4821 10.3390/nu6114805 25360512 PMC4245564 164. Petrisor G. Motelica L. Craciun L.N. Oprea O.C. Ficai D. Ficai A. Melissa officinalis Int. J. Mol. Sci. 2022 23 3591 10.3390/ijms23073591 35408950 PMC8998931 165. Hannan M.A. Rahman M.A. Sohag A.M. Black Cumin ( Nigella sativa Nutrients 2021 13 1784 10.3390/nu13061784 34073784 PMC8225153 166. Beheshti F. Khazaei M. Hosseini M. Neuropharmacological effects of Nigella sativa Avicenna J. Phytomed. 2016 6 104 116 PMC4884225 27247928 167. Samarghandian S. Farkhondeh T. Samini F. A review on possible therapeutic effect of Nigella sativa CNS Neurol. Disord. Drug Targets 2018 17 412 420 10.2174/1871527317666180702101455 29962349 168. Mohan M.E. Thomas J.V. Mohan M.C. A proprietary Black Cumin oil extract ( Nigella sativa ® Front. Nutr. 2023 10 1152680 10.3389/fnut.2023.1152680 37139438 PMC10149792 169. Sayeed M.S.B. Shams T. Hossain S.F. Nigella sativa L. seeds modulate mood, anxiety and cognition in healthy adolescent males J. Ethnopharmacol. 2014 152 156 162 10.1016/j.jep.2013.12.050 24412554 170. Asadi M. Molavi F. Qorbani M. Tanha F.D. Comparative Efficacy of Zolpidem and Nigella Sativa J. Family Reprod. Health 2020 14 186 191 10.18502/jfrh.v14i3.4672 33603811 PMC7868655 171. Morris C.A. Avorn J. Internet marketing of herbal products JAMA 2003 290 1505 1509 10.1001/jama.290.11.1505 13129992 172. Yao M. Ritchie H.E. Brown-Woodman P.D. A developmental toxicity-screening test of valerian J. Ethnopharmacol. 2007 113 204 209 10.1016/j.jep.2007.05.028 17611059 173. Trauner G. Khom S. Baburin I. Benedek B. Hering S. Kopp B. Modulation of GABAA receptors by valerian extracts is related to the content of valerenic acid Planta Med. 2008 74 19 24 10.1055/s-2007-993761 18095218 174. Schroeck J.L. Ford J. Conway E.L. Kurtzhalts K.E. Gee M.E. Vollmer K.A. Mergenhagen K.A. Review of Safety and Efficacy of Sleep Medicines in Older Adults Clin. Ther. 2016 38 2340 2372 10.1016/j.clinthera.2016.09.010 27751669 175. Ziegler G. Ploch M. Miettinen-Baumann A. Collet W. Efficacy and tolerability of valerian extract LI 156 compared with oxazepam in the treatment of non-organic insomnia—A randomized, double-blind, comparative clinical study Eur. J. Med. Res. 2002 7 480 486 12568976 176. Tammadon M.R. Nobahar M. Hydarinia-Naieni Z. Ebrahimian A. Ghorbani R. Vafaei A.A. The Effects of Valerian on Sleep Quality, Depression, and State Anxiety in Hemodialysis Patients: A Randomized, Double-blind, Crossover Clinical Trial Oman. Med. J. 2021 36 e255 10.5001/omj.2021.56 33936782 PMC8077445 177. Dominguez R.A. Bravo-Valverde R.L. Kaplowitz B.R. Cott J.M. Valerian as a hypnotic for Hispanic patients Cultur. Divers. Ethnic. Minor. Psychol. 2000 6 84 92 10.1037/1099-9809.6.1.84 10975170 178. Barton D.L. Atherton P.J. Bauer B.A. Moore D.F. Jr. Mattar B.I. Lavasseur B.I. Rowland K.M. Jr. Zon R.T. Lelindqwister N.A. Nagargoje G.G. The use of Valeriana officinalis (Valerian) in improving sleep in patients who are undergoing treatment for cancer: A phase III randomized, placebo-controlled, double-blind study (NCCTG Trial, N01C5) J. Support. Oncol. 2011 9 24 31 10.1016/j.suponc.2010.12.008 21399726 PMC3052692 179. Jacobs B.P. Bent S. Tice J.A. Blackwell T. Cummings S.R. An internet-based randomized, placebo-controlled trial of kava and valerian for anxiety and insomnia Medicine 2005 84 197 207 10.1097/01.md.0000172299.72364.95 16010204 180. Oxman A.D. Flottorp S. Håvelsrud K. Fretheim A. Odgaard-Jensen J. Austvoll-Dahlgren A. Carling C. Pallesen S. Bjorvatn B. A televised, web-based randomised trial of an herbal remedy (valerian) for insomnia PLoS ONE 2007 2 e1040 10.1371/journal.pone.0001040 17940604 PMC2002515 181. Taibi D.M. Bourguignon C. Taylor A.G. A feasibility study of valerian extract for sleep disturbance in person with arthritis Biol. Res. Nurs. 2009 10 409 417 10.1177/1099800408324252 19114414 182. Dhawan K. Dhawan S. Sharma A. Passiflora: A review update J. Ethnopharmacol. 2004 94 1 23 10.1016/j.jep.2004.02.023 15261959 183. Dhawan K. Kumar S. Sharma A. Anti-anxiety studies on extracts of Passiflora incarnata J. Ethnopharmacol. 2001 78 165 170 10.1016/S0378-8741(01)00339-7 11694362 184. Movafegh A. Alizadeh R. Hajimohamadi F. Esfehani F. Nejatfar M. Preoperative oral Passiflora incarnata Anesth. Analg. 2008 106 1728 1732 10.1213/ane.0b013e318172c3f9 18499602 185. Cronin J.R. Passionflower: Reigniting Male Libido and Other Potential Uses Altern. Complement. Ther. 2004 9 89 92 10.1089/107628003321537020 186. Akhondzadeh S. Naghavi H.R. Vazirian M. Shayeganpour A. Rashidi H. Khani M. Passionflower in the treatment of generalized anxiety: A pilot double-blind randomized controlled trial with oxazepam J. Clin. Pharm. Ther. 2001 26 363 367 10.1046/j.1365-2710.2001.00367.x 11679026 187. Mohammadi M.R. Akhondzadeh S. Passiflora incarnata Therapy 2005 2 609 614 10.2217/14750708.2.4.609 188. Peng A. Ji S. Lai W. Hu D. Wang M. Zhao X. Chen L. The bidirectional relationship between sleep disturbance and anxiety: Sleep disturbance is a stronger predictor of anxiety Sleep Med. 2024 121 63 68 10.1016/j.sleep.2024.06.022 38924831 189. Ngan A. Conduit R. A double-blind, placebo-controlled investigation of the effects of Passiflora incarnata Phytother. Res. 2011 25 1153 1159 10.1002/ptr.3400 21294203 190. Kim G.-H. Lim K. Yang H.S. Lee J.-K. Kim Y. Park S.-K. Kim S.-H. Park S. Kim T.-H. Moon J.-S. Improvement in neurogenesis and memory function by administration of Passiflora incarnata J. Chem. Neuroanat. 2019 98 27 40 10.1016/j.jchemneu.2019.03.005 30951822 191. Christoffoli M.T. Bachesk A.B. Farah G.J. Ferreira G.Z. Assessment of Passiflora incarnata Quintessence Int. 2021 52 868 878 10.3290/j.qi.b1492199 34076379 192. La Tempa A. Ferraiuolo G. Pranzetti B. Pruccoli J. Parmeggiani A. Passiflora incarnata Adolescents 2025 5 24 10.3390/adolescents5020024 193. Bradley B.F. Starkey N.J. Brown S.L. Lea R.W. Anxiolytic effects of Lavandula angustifolia odour on the Mongolian gerbil elevated plus maze J. Ethnopharmacol. 2007 111 517 525 10.1016/j.jep.2006.12.021 17289317 194. Coelho L.S. Correa-Netto N.F. Masukawa M.Y. Lima A.C. Maluf S. Linardi A. Santos-Junior J.G. Inhaled Lavandula angustifolia J. Ethnopharmacol. 2018 215 34 41 10.1016/j.jep.2017.12.038 29288824 195. Bikmoradi A. Seifi Z. Poorolajal J. Araghchian M. Safiaryan R. Oshvandi K. Effect of inhalation aromatherapy with lavender essential oil on stress and vital signs in patients undergoing coronary artery bypass surgery: A single-blinded randomized clinical trial Complement. Ther. Med. 2015 23 331 338 10.1016/j.ctim.2014.12.001 26051567 196. Karadag E. Samancioglu S. Ozden D. Bakir E. Effects of aromatherapy on sleep quality and anxiety of patients Nurs. Crit. Care 2017 22 105 112 10.1111/nicc.12198 26211735 197. Lillehei A.S. Halcón L.L. Savik K. Reis R. Effect of inhaled lavender and sleep hygiene on self-reported sleep issues: A randomized controlled trial J. Altern. Complement. Med. 2015 21 430 438 10.1089/acm.2014.0327 26133206 PMC4505755 198. Najafi Z. Tagharrobi Z. Shahriyari-Kale-Masihi M. Effect of aromatherapy with Lavender on sleep quality among patients undergoing hemodialysis Feyz Med. Sci. J. 2014 18 145 150 199. Luo J. Jiang W. A critical review on clinical evidence of the efficacy of lavender in sleep disorders Phytother. Res. 2022 36 2342 2351 10.1002/ptr.7448 35412693 200. Hwang J.H. The effects of the inhalation method using essential oils on blood pressure and stress responses of clients with essential hypertension J. Korean Acad. Nurs. 2006 36 1123 1134 10.4040/jkan.2006.36.7.1123 17211115 201. Lee E. Kim K.S. The effects of aroma hand massage on anxiety and sleep in cancer patients during hospitalization Perspect. Nurs. Sci. 2011 8 42 53 202. Kim O.J. Kim K.H. Park K.S. The effect of aroma inhalation on stress, anxiety and sleep pattern in patients with hemodialysis Clin. Nurs. Res. 2007 13 99 111 203. Lee Y.M. Ahn H.Y. Effect of the aromatherapy on anxiety and discomfort in patients having colonoscopy J. Korean Acad. Fundam. Nurs. 2010 17 539 547 204. Cho M. Min E. Hur M. Lee M. Effects of aromatherapy on the anxiety, vital signs, and sleep quality of percutaneous coronary intervention patients in intensive care units Evid.-Based Complement. Alternat. Med. 2013 2013 381381 10.1155/2013/381381 23476690 PMC3588400 205. Lytle J. Mwatha C. Davis K. Effect of lavender aromatherapy on vital signs and perceived quality of sleep in the intermediate care unit: A pilot study Am. J. Crit. Care 2014 23 24 29 10.4037/ajcc2014958 24382614 206. Hirokawa K. Nishimoto T. Taniguchi T. Effects of lavender aroma on sleep quality in healthy Japanese students Percept. Mot. Skills 2012 114 111 122 10.2466/13.15.PMS.114.1.111-122 22582680 207. Chien L. Cheng S. Liu C. The effect of lavender aromatherapy on autonomic nervous system in midlife women with insomnia Evid.-Based Complement. Altern. Med. 2012 2012 740813 10.1155/2012/740813 PMC3159017 21869900 208. Lewith G.T. Godfrey A.D. Phillip P. A single-blinded, randomized pilot study evaluating the aroma of Lavandula augustifolia as a treatment for mild insomnia J. Altern. Complement. Med. 2005 11 631 637 10.1089/acm.2005.11.631 16131287 209. Fismer K. Pilkington K. Lavender and sleep: A systematic review of the evidence Eur. J. Integr. Med. 2012 4 e436 e447 10.1016/j.eujim.2012.08.001 210. Lari Z.N. Hajimonfarednejad M. Riasatian M. Abolhassanzadeh Z. Iraji A. Vojoud M. Heydari M. Shams M. Efficacy of inhaled Lavandula angustifolia J. Ethnopharmacol. 2020 251 112560 10.1016/j.jep.2020.112560 31931160 211. Moeini M. Khadibi M. Bekhradi R. Mahmoudian S.A. Nazari F. Effect of aromatherapy on the quality of sleep in ischemic heart disease patients hospitalized in intensive care units of heart hospitals of the Isfahan University of Medical Sciences Iran. J. Nurs. Midwifery Res. 2010 15 234 239 22049287 PMC3203283 212. Kukula-Koch W. Szwajgier D. Gaweł-Bęben K. Strzępek-Gomółka M. Głowniak K. Meissner H.O. Is Phytomelatonin Complex Better Than Synthetic Melatonin? The Assessment of the Antiradical and Anti-Inflammatory Properties Molecules 2021 26 6087 10.3390/molecules26196087 34641628 PMC8512846 213. Zhao D. Yu Y. Shen Y. Liu Q. Zhao Z. Sharma R. Reiter R.J. Melatonin Synthesis and Function: Evolutionary History in Animals and Plants Front. Endocrinol. 2019 10 249 10.3389/fendo.2019.00249 31057485 PMC6481276 214. Kanwar M.K. Yu J. Zhou J. Phytomelatonin: Recent advances and future prospects J. Pineal Res. 2018 65 e12526 10.1111/jpi.12526 30256447 215. Oladi E. Mohamadi M. Shamspur T. Mostafavi A. Expression of Concern to Spectrofluorimetric Determination of Melatonin in Kernels of Four Different Pistacia Varieties after Ultrasound-Assisted Solid-Liquid Extraction Spectrochim. Acta Part A Mol. Biomol. Spectrosc. 2014 132 326 329 10.1016/j.saa.2014.05.010 24878439 216. Lautie E. Russo O. Ducrot P. Boutin J.A. Unraveling Plant Natural Chemical Diversity for Drug Discovery Purposes Front. Pharmacol. 2020 11 397 10.3389/fphar.2020.00397 32317969 PMC7154113 217. Reiter R.J. Tan D.X. Zhou Z. Cruz M.H.C. Fuentes-Broto L. Galano A. Phytomelatonin: Assisting plants to survive and thrive Molecules 2015 20 7396 7437 10.3390/molecules20047396 25911967 PMC6272735 218. Maronde E. Stehle J. The mammalian pineal gland: Known facts, unknown facets Trends Endocrinol. Metabol. 2007 18 142 149 10.1016/j.tem.2007.03.001 17374488 219. Hardeland R. Madrid J.A. Tan D.X. Reiter R.J. Melatonin, the circadian multioscillator system and health: The need for detailed analysis of peripheral melatonin signal J. Pineal Res. 2012 52 139 166 10.1111/j.1600-079X.2011.00934.x 22034907 220. Tan D. Xu B. Zhou X. Reiter R. Pineal calcification, melatonin production, aging, associated health consequences and rejuvenation of the pineal gland Molecules 2018 23 301 10.3390/molecules23020301 29385085 PMC6017004 221. Nawaz M.A. Huang Y. Bie Z. Ahmed W. Reiter R.J. Niu M. Hameed S. Melatonin: Current status and future perspectives in plant science Front. Plant Sci. 2016 6 1230 10.3389/fpls.2015.01230 26793210 PMC4707265 222. Wei J. Li D.X. Zhang J.R. Shan C. Rengel Z. Song Z.B. Chen Q. Phytomelatonin receptor PMTR 1-mediated signaling regulates stomatal closure in Arabidopsis thaliana J. Pineal Res. 2018 65 e12500 10.1111/jpi.12500 29702752 223. Wade A.G. Crawford G. Ford I. McConnachie A. Nir T. Laudon M. Zisapel N. Prolonged release melatonin in the treatment of primary insomnia: Evaluation of the age cut-off for short- and long-term response Curr. Med. Res. Opin. 2011 27 87 98 10.1185/03007995.2010.537317 21091391 224. Erman M. Seiden D. Zammit G. Sainati S. Zhang J. An efficacy, safety, and dose-response study of Ramelteon in patients with chronic primary insomnia Sleep Med. 2006 7 17 24 10.1016/j.sleep.2005.09.004 16309958 225. Shinomiya K. Inoue T. Utsu Y. Tokunaga S. Masuoka T. Ohmori A. Kamei C. Hypnotic activities of chamomile and passiflora extracts in sleep-disturbed rats Biol. Pharm. Bull. 2005 28 808 810 10.1248/bpb.28.808 15863883 226. Mathews I.M. Eastwood J. Lamport D.J. Le Cozannet R. Fanca-Berthon P. Williams C.M. Clinical Efficacy and Tolerability of Lemon Balm ( Melissa officinalis Nutrients 2024 16 3545 10.3390/nu16203545 39458539 PMC11510126 Figure 1 Structural formulas of melatonin, agomelatine, ramelteon, and tasimelteon. Figure 2 Effects of MT1 and MT2 activation on the modulation of long-term potentiation; MT—melatonin; MT1—melatonin receptor 1; MT2—melatonin receptor 2; NMDA receptor—N-methyl-D-asparate receptor; Ca v + 2+ Figure 3 MT1 receptor signaling pathway; AC—adenylyl cyclase; PLC—phospholipase C; IP3—inositol 1,4,5-trisphosphate; Ca 2+ Figure 4 MT2 receptor signaling pathway; GC—guanylyl cyclase; AC—adenylyl cyclase; PLC—phospholipase C; PKC—protein kinase C; PKA—protein kinase A; CREB—cAMP-response element-binding protein. Figure 5 Sleep/arousal neuronal network; Blue boxes—sleep-promoting nuclei. Red boxes—wake-promoting nuclei. LC—locus caeruleus; R—raphe nuclei; TMN—tuberomammillary nucleus; VLPO—ventrolateral preoptic nucleus; IN—GABAergic interneurons; VTA—ventral tegmental area; LH/PF—lateral hypothalamic/perifornical area; Ache, acetylcholine; NA, noradrenaline; H, histamine; Ox, orexine; GABA, γ-aminobutyric acid; DA, dopamine; 5HT, 5-hydroxytryptamine. Receptors: H1, excitatory H1 histamine receptors; 5HT 2A 2C 74 75 76 molecules-30-03814-t001_Table 1 Table 1 Efficacy of Melatonin in Sleep-Related Clinical Trials. Population TST/sTST (min) SL/sSL (min) Dose (mg) References 40 patients ≥ 55 years with primary insomnia (20 PRM, 20 placebo) PRM: 391.7 Placebo: 389.5 PRM: 13.7 Placebo: 22.6 (−9 min) 2 mg prolonged-release melatonin [ 95 Adults with primary insomnia, age 65–80 (PRM n n After 3 weeks: +7.0 min After 3 weeks: −15.6 min 2 mg prolonged-release melatonin [ 96 110 children (3–15 yrs) with chronić sleep problems +22.4 min vs. placebo (sleep diaries, p −37.5 min vs. placebo (sleep diaries, p p 0.5–12 mg [ 97 40 children (6–12 yrs) with chronic sleep onset insomnia +41 min −63 min (diary), −75 min (actigraphy) 5 mg [ 98 molecules-30-03814-t002_Table 2 Table 2 Efficacy of Ramelteon in Clinical Trials. Population TST (min) SL/sSL (min) oTST/sTST (min) Dose (mg) References Adults ≥ 50 years with insomnia +21 (objective) −13.8 Not reported 4–8 mg [ 131 Adults with insomnia +7.26 (objective) −9.36/−4.3 +3.23 min (sTST), not statistically significant 4–32 mg [ 134 Adults with insomnia without comorbidities +17.9 (oTST), +11.7 (sTST) −14 (oSOL)/−8.74 (sSOL) +2.02/+14.5 (long-term treatment) 4–16 mg (commonly 8) [ 135 molecules-30-03814-t003_Table 3 Table 3 Efficacy of Agomelatine in Clinical Sleep Studies. Population TST/sTST (min) SL/sSL (min) Dose (mg) Refrerences Adults with MDD ( n ↑ subjective sleep quality (LSEQ) ↑ getting to sleep ( p 25–50 [ 139 Adults with MDD ( n Preserved sleep cycles (vs. ↓ in escitalopram) ↓ sleep latency ( p 25–50 [ 140 Adults with depression ( n Not reported No increase in hypnotic use ( p 25–50 [ 141 Patients with alcohol dependence and insomnia ( n ↓ PSQI score from 13.1 to 7.8 Improved sleep onset latency 25–50 [ 142 (↑—increase, ↓—decrease). molecules-30-03814-t004_Table 4 Table 4 The list of medicinal herbs used in the treatment of insomnia. Plant Name Key Metabolites Therapeutic Uses Research Findings Reference Matricaria chamomilla Terpenoids, Phenolic compounds, Essential oils Anxiolytic, anti-depressant, sleep quality improvement, potential in GAD and depression. Clinical trials have shown effectiveness in treating anxiety and improving sleep quality. [ 148 149 150 151 152 153 154 155 Melissa officinalis Rosmarinic acid, Volatile metabolites: geranial, neral, citronellal, geraniol Cognitive improvement, mood enhancement, sleep quality improvement. Clinical trials have shown significant improvement in sleep quality and mood enhancement. [ 16 156 157 158 159 160 161 162 163 164 Nigella sativa Thymoquinone Anti-anxiety properties, memory enhancement, stress management. Animal trials show an increased sleep quality and reduced anxiety; human trials proved stress and sleep management [ 165 166 167 168 169 170 Valeriana officinalis essential oils, ketones, phenols, iridoid esters, valeric acid, aminobutyric acid, arginine, tyrosine, glutamine, as well as noncyclic, monocyclic, and bicyclic hydrocarbons It has sedative and hypnotic properties, relieving anxiety and sleep disorders. It inhibits the uptake and stimulates the release of GABA, a partial agonist of the 5-hydroxytryptamine 2A receptor, which increases melatonin release. Clinical trials have shown that Valerian was found to significantly improve sleep quality, anxiety, and depression symptoms in patients. [ 171 172 173 174 175 176 177 178 179 180 Passiflora incarnata alkaloids, phenolic compounds, flavonoids, and cyanogenic glycosides. The primary phytochemicals found in the passionflower are flavonoids (apigenin, luteolin, quercetin, and kaempferol) and flavonoid glycosides (vitexin, isovitexin, orientin, and isoorientin) A sedative, anxiolytic, and hypnotic agent used to treat sleep disorders. It modulates the neurotransmitter system, primarily gamma-aminobutyric acid (GABA), serotonin, and the adrenergic system. Clinical trials have shown that Passiflora incarnata [ 181 182 183 184 185 186 187 188 189 190 191 192 Lavandula angustifolia Lavender oil contains linalyl acetate, linalool, α-aminobutyric acid Used in aromatherapy, essential oils treat sleep disorders. Lavender’s scent is an anti-anxiety, anticonvulsant, analgesic, sedative, and sleep-inducing agent. Clinical trials have shown that L. angustifolia [ 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 Melatonin-containing plants Melatonin Activity of the plants resembles that of melatonin, and additionally, a marked antiradical and anti-inflammatory action supported by the complex of metabolites. Melatonin was identified in several plant species, including Coffea Piper Lycium Brassica Medicago Chlorella Oryza [ 81 169 212 213 214 215 216 217 218 219 220 221 222 molecules-30-03814-t005_Table 5 Table 5 Comparison of melatonergic drugs and herbal preparations in the treatment of insomnia. Criterion Melatonergic Drugs Herbal Preparations Examples Melatonin, Ramelteon, Tasimelteon, Agomelatine M. chamomilla M. officinalis N. sativa Mechanism of Action MT1/MT2 agonism, 5-HT 2C GABA modulation, serotonin activity, antioxidant effects Clinical Efficacy High (multiple RCTs and meta-analyses) Limited (mostly pilot trials) Safety High, low abuse potential High, but risk of interactions and allergies Use in Severe Insomnia Confirmed by multiple trials Not confirmed Cost Moderate to high Low Availability Prescription only (except melatonin OTC in some regions) OTC, dietary supplements Additional Benefits Antidepressant effects (agomelatine) Anxiolytic, adaptogenic potential ",
  "metadata": {
    "Title of this paper": "Clinical Efficacy and Tolerability of Lemon Balm (",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472680/"
  }
}