{
  "title": "Paper_1055",
  "abstract": "pmc Dent J (Basel) Dent J (Basel) 3384 dentj dentistry Dentistry Journal 2304-6767 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469128 PMC12469128.1 12469128 12469128 41002673 10.3390/dj13090400 dentistry-13-00400 1 Review Role of Myokines on the Bone Metabolism of Craniofacial Region: A Scoping Review Rajan Ahana S. 1 https://orcid.org/0000-0002-2707-1613 Tanaka Eiji 2 * Zlatarić Dubravka Knezović Academic Editor 1 drahana.ortho@madch.edu.in 2 * etanaka@tokushima-u.ac.jp 31 8 2025 9 2025 13 9 497630 400 27 6 2025 27 8 2025 29 8 2025 31 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods Results: Conclusions: bone metabolism craniofacial region muscle-bone crosstalk myokine Ministry of Education, Culture, Sports, Sciences, and Technology, Japan 25K13146 This study was supported by Grants-in Aid 25K13146 (E.T.) from the Ministry of Education, Culture, Sports, Sciences, and Technology, Japan. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Since the craniofacial region is continuously remodeled, its dynamic nature is influenced by the complex interplay between genetic, mechanical, and biochemical factors [ 1 2 3 4 1 The human masticatory system is a complex musculoskeletal system in which the masticatory muscles stretch and compress in the temporomandibular joint (TMJ), and jaw movements interact [ 5 6 7 6 Myokines, produced by muscles during physical activity, may exert anti-inflammatory and anti-tumor effects by directly influencing the tumor microenvironment and the immune system [ 8 9 10 11 12 Despite growing evidence of muscle-bone biochemical interaction, the precise functions of myokines in cranial bone metabolism remain poorly understood. Most studies have focused on how these molecules affect long bones, like those in the limbs. The craniofacial skeleton is different, featuring unique developmental origins, biomechanical demands (mastication, speech, and facial expression), and muscular attachments. Because of this, we cannot simply apply findings from limb bone studies to the craniofacial context. Importantly, there is no existing review that specifically investigates how craniofacial muscles communicate with bone via myokines—a major knowledge gap given the craniofacial region’s importance in orthodontics, facial surgery, and age-related bone changes. Thus, the primary aim of this scoping review was to map the current evidence on myokine-mediated signaling in craniofacial bone metabolism. Furthermore, understanding this relationship is crucial because myokines could affect orthodontic treatments, developmental issues, and craniofacial rehabilitation techniques. The second aim of this scoping review was to summarize the evidence thus far on the role of myokines in craniofacial bone metabolism and identify gaps to guide future research. 2. Materials and Methods This scoping review was performed based on the updated recommendations of the Joanna Briggs Institute [ 13 14 https://osf.io/4j3k9 2.1. Search Strategy A methodical literature search was conducted in PubMed and Scopus databases from January 2000 to July 2025 to procure relevant articles. The keywords used were myokines, bone metabolism, and craniofacial region. Table 1 2.2. Eligibility Criteria Based on the PICO framework, the eligibility criteria for the study selection was divided into Population, Intervention, Control, and Outcome ( Table 2 2.3. Study Selection This review was performed by three independent reviewers to ensure transparency and methodological rigor. The inclusion criteria encompassed original articles and review articles that had a clear description of myokines and focused on the craniofacial regions. We excluded studies that did not involve myokines in the craniofacial regions as well as conference papers and dissertations. After an initial search using the keywords, relevant articles were filtered based on the abstracts and title. Eventually, selected articles were retrieved according to the eligibility criteria assessed for their full-text potential using the Rayyan ® 15 Figure 1 3. Results 3.1. Search Results A total of 874 articles were screened from the two databases after eliminating the duplicates. Of these, 846 articles were excluded as they had no clear description of myokines. Twenty-eight articles were assessed in full text, and nine articles that met the eligibility criteria were finally included in the review. A summary of the included articles is shown in Table 3 3.2. Role of Myokines in Craniofacial Region The craniofacial system, especially the masticatory apparatus, works in a well-regulated manner in response to constant functional and mechanical demands through remodeling [ 25 26 Although mechanical load is the key instigator of bone adaptation through mechanotransduction [ 27 28 6 11 29 30 Myokines have been shown to directly affect bone cells [ 31 32 33 27 29 30 34 35 36 37 38 15 39 40 41 42 43 44 45 46 To date, the majority of studies have focused on limb muscles (e.g., the gastrocnemius and the quadriceps) and long bones (e.g., the femur and the tibia). These studies have used models of exercise, mechanical loading, or genetic modifications to explore the impact of muscle-derived signals on skeletal homeostasis [ 29 47 48 3.2.1. IL-6 Yamamoto et al. [ 16 17 Pereira et al. [ 18 3.2.2. Myostatin Ravosa et al. [ 19 20 21 3.2.3. Irisin Yang et al. investigated the presence of irisin in the periodontal and pulpal tissues of Sprague–Dawley rats [ 22 23 3.2.4. IGF-1 Liu et al. evaluated the level of IGF-1 in Wistar rats with unilateral loading of the TMJ with occlusal splints [ 24 4. Discussion 4.1. Summary of Key Findings This scoping review identified nine studies examining the role of specific myokines—namely IL-6, IGF-1, myostatin, and irisin in regulating craniofacial bone metabolism. The evidence suggests that myokines can exert both pro- and anti-osteogenic effects depending on the context, such as the type of mechanical stimulus, the tissue involved, and the disease state. IL-6 was the most frequently studied myokine, with research showing its elevated expression in temporomandibular disorders (TMD) and in osteoblasts subjected to simulated occlusal stress. Myostatin, which is primarily known for inhibiting muscle growth, was shown to impact bone mineral density and cranial suture mechanics in models of increased masticatory load. Irisin and IGF-1 were associated with enhanced osteogenic responses in periodontal tissues and TMJ cartilage, respectively. While these findings are promising, the literature is sparse and heterogeneous, highlighting an important yet underexplored field of craniofacial bone biology. 4.2. Comparison with Myokine Research in Other Skeletal Regions Most existing myokine research has focused on long bones and limb musculature. Studies on limb muscles have demonstrated that myokines such as IL-6 and irisin are released in response to exercise, contributing to improved bone density and turnover, largely through systemic effects [ 28 31 34 23 24 4.3. Functional and Developmental Uniqueness of Craniofacial Muscles and Bones The craniofacial bones and muscles are developmentally and functionally distinct from their axial and appendicular counterparts. Masticatory muscles, such as the masseter and temporalis, arise from the cranial paraxial mesoderm and neural crest cells. In contrast, limb muscles originate from somites [ 47 48 19 20 21 4.4. Potential Mechanisms of Myokine Action in the Craniofacial Region The interaction between muscle-derived myokines and craniofacial bone cells appears to be mediated by several pathways. IL-6, for instance, is upregulated in osteoblasts exposed to mechanical pressure as well as in the synovial fluid of TMD patients with osseous changes. IL-6 has been shown to influence osteoclastogenesis via the RANKL/OPG axis and the p38 MAPK signaling pathway, suggesting a role in both inflammatory and remodeling processes [ 16 17 22 23 24 19 20 21 4.5. Clinical Implications Understanding the role of myokines in the craniofacial region could lead to new clinical applications. In orthodontics, for example, modulating myokine activity could influence the rate of tooth movement or help maintain bone integrity during prolonged treatment. For instance, the osteogenic effect of irisin cold be utilized to stabilize anchorage units or prevent root resorption. In TMDs, targeting IL-6 pathways may reduce inflammatory bone resorption and offer therapeutic benefits. Furthermore, knowledge of region-specific myokines could inform regenerative strategies in maxillofacial surgery, particularly in cases of trauma, reconstructive surgery, or age-related bone loss. In conditions such as idiopathic condylar resorption or craniofacial dysostoses, characterizing myokine expression could provide diagnostic or prognostic biomarkers. 4.6. Limitations This scoping review has a few important limitations that should be acknowledged. First, the number of eligible studies was relatively small, with most relying on animal or in vitro models. While these provide valuable mechanistic insights, they limit the direct translation of findings to human craniofacial bone biology. Second, the included studies were heterogeneous in terms of experimental design, myokines investigated, and out-come measures. This diversity made it difficult to compare results directly or draw firm conclusions on the relative contribution of each myokine. Third, we did not conduct a formal risk of bias or quality appraisal, as this falls outside the scope of scoping reviews; however, this means that the strength of evidence cannot be graded. To address this, we implemented a study selection process involving three independent reviewers, working through titles, abstracts, and full texts to ensure consistency. Discrepancies were resolved through discussion, enhancing the reliability of our inclusion decisions. While we did not compute inter-rater agreement statistics (e.g., Cohen’s kappa), this consensus-driven approach is a well-recognized method to reduce selection bias and reinforce methodological rigor. Finally, although our search strategy was comprehensive, we did not systematically search the grey literature, and relevant unpublished studies may have been missed. Together, these factors suggest that while the current review provides a broad overview of existing knowledge, more standardized and well-designed human studies are needed to clarify the role of myokines in craniofacial bone metabolism. 5. Conclusions Despite the growing recognition of the role of myokines in systemic musculoskeletal health, our scoping review reveals that research into the myokine-mediated regulation of craniofacial bone metabolism is still in its infancy. This disparity in research emphasis raises a significant knowledge gap. A better understanding of the specific myokine profiles of craniofacial muscles could provide new insights into the impact of mechanical loading, muscle activity, and inflammation on local bone remodeling, particularly in pathological conditions such as idiopathic condylar resorption, TMJ osteoarthritis, and craniofacial deformities. Furthermore, this knowledge could pave the way for novel therapeutic strategies that utilize myokine signaling to modulate bone homeostasis or regeneration in the craniofacial region. This could be applied in the context of orthodontic and orthognathic treatments, maxillofacial reconstruction, or age-related bone loss. In summary, while the role of myokines in the limb muscle - bone interaction is now well understood, their function in the craniofacial muscle - bone crosstalk is a new but promising area of research. The unique structure and function of the masticatory system highlight the importance of region-specific investigations. Future studies should prioritize characterizing the secretome of craniofacial muscles, elucidating myokine-mediated signaling pathways, and evaluating their impact on bone cells and craniofacial morphology. Further research should go beyond the currently studied IL-6, IGF-1, myostatin, and irisin and explore their roles in areas like sutures, alveolar bone, and dental tissues. Addressing these knowledge gaps will be crucial to advancing our understanding of muscle - bone biology in the craniofacial domain and create new clinical strategies—for example, enhancing orthodontic anchorage with irisin modulation or mitigating TMD-associated bone resorption by targeting IL-6—that could bridge basic discoveries with patient care. Acknowledgments The authors would like to thank Filippo Moenne Saito, Ye Fenghao, and Yifei Wang for study search and selection to improve the quality and transparency of this study. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.S.R. and E.T.; investigation (screening + charting), A.S.R. and E.T.; writing—original draft, A.S.R. and E.T.; writing—review and editing, A.S.R. and E.T. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no potential conflicts of interest with respect to the authorship and/or publication of this article. Abbreviations The following abbreviations are used in this manuscript: MPa Mega Pascal Hz Hertz RANKL Receptor activator of nuclear factor kappa-Β ligand OPG Osteopontegrin TMD Temporomandibular disorders TMJ Temporomandibular joint IGF-1 Insukin-like growth factor-1 IL-6 Interleukin 6 BMD Bone mineral density BV Bone volume TV Trabecular Volume PDL Periodontal ligament BNDF Brain-derived neurotrophic factor BAIBA β-aminoisobutyric acid MMP Matrix metalloproteinase FGF Fibroblast growth factor PRISMA-ScR The Extension for Scoping Reviews of the Preferred Reporting Items for Systematic Reviews and Meta analyses statement FNDC5 Fibronectin type III domain-containing protein 5 PICO Population Intervention Control Outcome MAPK Mitogen activated protein kinase pathway References 1. Conith A.J. Lam D.T. Albertson R.C. Muscle-induced loading as an important source of variation in craniofacial skeletal shape Genesis 2019 57 e23263 10.1002/dvg.23263 30418689 PMC6819996 2. Akintoye S. The distinctive jaw and alveolar bone regeneration Oral Dis. 2018 24 49 51 10.1111/odi.12761 29480633 3. Hall J.G. Importance of Muscle Movement for Normal Craniofacial Development J. Craniofacial Surg. 2010 21 1336 1338 10.1097/SCS.0b013e3181ebcd4f 20818259 4. Kiliaridis S. Masticatory muscle influence on craniofacial growth Acta Odontol. Scand. 1995 53 196 202 10.3109/00016359509005972 7572097 5. Koolstra J.H. Van Eijden T.M.G.J. Prediction of volumetric strain in the human temporomandibular joint cartilage during jaw movement J. Anat. 2006 209 369 380 10.1111/j.1469-7580.2006.00612.x 16928205 PMC2100329 6. Buvinic S. Balanta-Melo J. Kupczik K. Vásquez W. Beato C. Toro-Ibacache V. Muscle-Bone Crosstalk in the Masticatory System: From Biomechanical to Molecular Interactions Front. Endocrinol. 2021 11 606947 10.3389/fendo.2020.606947 33732211 PMC7959242 7. Brotto M. Bonewald L. Bone and muscle: Interactions beyond mechanical Bone 2015 80 109 114 10.1016/j.bone.2015.02.010 26453500 PMC4600532 8. Rusu L. Mihai T.A. Schenker R.A. Marin M.I. Schenker M. Streba C.T. Gheonea D.I. Piele D. The effect of physical exercises on TNF-α, IL-6, and IL-8 cytokines expression and NK cells in cancer Rom. J. Morphol. Embryol. 2025 66 89 98 10.47162/RJME.66.1.08 40384195 PMC12236277 9. Tanimoto K. Hiasa M. Tenshin H. Teramachi J. Oda A. Harada T. Higa Y. Sogabe K. Oura M. Sumitani R. Mechanical unloading aggravates bone destruction and tumor expansion in myeloma Haematologica 2021 107 744 749 10.3324/haematol.2021.278295 PMC8883542 34788982 10. Garg V. Ghay R. Goyal G. Saini R.V. Exploring the Role of Acute Exercise-Induced Myokine Release in Glucose Metabolism and Insulin Sensitivity in Healthy and Diabetic Individuals Cureus 2025 17 e78991 10.7759/cureus.78991 40091956 PMC11910891 11. Maurel D. Jähn K. Lara-Castillo N. Muscle–Bone Crosstalk: Emerging Opportunities for Novel Therapeutic Approaches to Treat Musculoskeletal Pathologies Biomedicines 2017 5 62 10.3390/biomedicines5040062 29064421 PMC5744086 12. Bonewald L. Use it or lose it to age: A review of bone and muscle communication Bone 2019 120 212 218 10.1016/j.bone.2018.11.002 30408611 PMC6360108 13. Peters M.D.J. Marnie C. Tricco A.C. Pollock D. Munn Z. Alexander L. McInerney P. Godfrey C.M. Khalil H. Updated methodological guidance for the conduct of scoping reviews JBI Evid. Synth. 2020 18 2119 2126 10.11124/JBIES-20-00167 33038124 14. Tricco A.C. Lillie E. Zarin W. O’Brien K.K. Colquhoun H. Levac D. Moher D. Peters M.D.J. Horsley T. Weeks L. PRISMA Extension for Scoping Reviews (PRISMA-ScR): Checklist and Explanation Ann. Intern. Med. 2018 169 467 473 10.7326/M18-0850 30178033 15. Ouzzani M. Hammady H. Fedorowicz Z. Elmagarmid A. Rayyan—A web and mobile app for systematic reviews Syst. Rev. 2016 5 210 10.1186/s13643-016-0384-4 27919275 PMC5139140 16. Yamamoto K. Yamamoto T. Ichioka H. Akamatsu Y. Oseko F. Mazda O. Imanishi J. Kanamura N. Kita M. Effects of mechanical stress on cytokine production in mandible-derived osteoblasts Oral Dis. 2011 17 712 719 10.1111/j.1601-0825.2011.01832.x 21771211 17. Takaku S. Ogura N. Sakamaki H. Abiko Y. Nagura H. Interleukin-1β, interleukin-6, and tissue inhibitor of metalloproteinase-1 in the synovial fluid of the temporomandibular joint with respect to cartilage destruction Oral Dis. 2000 6 383 390 11355271 10.1111/j.1601-0825.2000.tb00131.x 18. Pereira L.J. Macari S. Coimbra C.C. Pereira T.D.S.F. Barrioni B.R. Gomez R.S. Silva T.A. Paiva S.M. Aerobic and resistance training improve alveolar bone quality and interferes with bone-remodeling during orthodontic tooth movement in mice Bone 2020 138 115496 10.1016/j.bone.2020.115496 32585320 19. Ravosa M.J. Lopez E.K. Menegaz R.A. Stock S.R. Stack M.S. Hamrick M.W. Using “Mighty Mouse” to understand masticatory plasticity: Myostatin-deficient mice and musculoskeletal function Integr. Comp. Biol. 2008 48 345 359 10.1093/icb/icn050 21669797 20. Nicholson E.K. Stock S.R. Hamrick M.W. Ravosa M.J. Biomineralization and adaptive plasticity of the temporomandibular joint in myostatin knockout mice Arch. Oral Biol. 2006 51 37 49 10.1016/j.archoralbio.2005.05.008 16054590 21. Byron C.D. Borke J. Yu J. Pashley D. Wingard C.J. Hamrick M. Effects of increased muscle mass on mouse sagittal suture morphology and mechanics Anat. Rec. 2004 279 676 684 10.1002/ar.a.20055 15224409 22. Yang Y. Pullisaar H. Landin M.A. Heyward C.A. Schröder M. Geng T. Grano M. Reseland J.E. FNDC5/irisin is expressed and regulated differently in human periodontal ligament cells, dental pulp stem cells and osteoblasts Arch. Oral Biol. 2021 124 105061 10.1016/j.archoralbio.2021.105061 33508625 23. Yang Y. Pullisaar H. Stunes A.K. Nogueira L.P. Syversen U. Reseland J.E. Irisin reduces orthodontic tooth movement in rats by promoting the osteogenic potential in the periodontal ligament Eur. J. Orthod. 2023 45 842 853 10.1093/ejo/cjad021 37209709 PMC10687601 24. Liu Z. Hou Y. Zhang P. Lu H. Wang W. Ma W. Changes of the condylar cartilage and subchondral bone in the temporomandibular joints of rats under unilateral mastication and expression of Insulin-like Growth Factor-1 J. Stomatol. Oral Maxillofac. Surg. 2022 123 405 416 10.1016/j.jormas.2021.09.013 34601167 25. Lieberman D.E. The Evolution of the Human Head [Internet] Harvard University Press Cambridge, MA, USA 2011 Available online: http://www.jstor.org/stable/10.2307/j.ctvjnrtmh (accessed on 30 May 2025) 26. Herring S.W. Functional Morphology of Mammalian Mastication Am. Zool. 1993 33 289 299 10.1093/icb/33.3.289 27. Frost H.M. Skeletal structural adaptations to mechanical usage (SATMU): 2. Redefining Wolff’s Law: The remodeling problem Anat. Rec. 1990 226 414 422 10.1002/ar.1092260403 2184696 28. Pedersen B.K. Febbraio M.A. Muscle as an Endocrine Organ: Focus on Muscle-Derived Interleukin-6 Physiol. Rev. 2008 88 1379 1406 10.1152/physrev.90100.2007 18923185 29. Leal L.G. Lopes M.A. Batista M.L. Physical Exercise-Induced Myokines and Muscle-Adipose Tissue Crosstalk: A Review of Current Knowledge and the Implications for Health and Metabolic Diseases Front. Physiol. 2018 9 1307 10.3389/fphys.2018.01307 30319436 PMC6166321 30. Bonewald L.F. The Role of the Osteocyte in Bone and Nonbone Disease Endocrinol. Metab. Clin. N. Am. 2017 46 1 18 10.1016/j.ecl.2016.09.003 PMC5300041 28131126 31. Colaianni G. Cuscito C. Mongelli T. Oranger A. Mori G. Brunetti G. Colucci S. Cinti S. Grano M. Irisin Enhances Osteoblast Differentiation In Vitro Int. J. Endocrinol. 2014 2014 902186 10.1155/2014/902186 24723951 PMC3960733 32. Lecka-Czernik B. Marrow fat metabolism is linked to the systemic energy metabolism Bone 2012 50 534 539 10.1016/j.bone.2011.06.032 21757043 PMC3197966 33. Saygili E. Pekassa M. Saygili E. Rackauskas G. Hommes D. Noor-Ebad F. Gemein C. Zink M.D. Schwinger R.H. Weis J. Mechanical stretch of sympathetic neurons induces VEGF expression via a NGF and CNTF signaling pathway Biochem. Biophys. Res. Commun. 2011 410 62 67 10.1016/j.bbrc.2011.05.105 21640078 34. Pereira L.J. Andrade E.F. Barroso L.C. Lima R.R.D. Macari S. Paiva S.M. Silva T.A. Irisin effects on bone: Systematic review with meta-analysis of preclinical studies and prospects for oral health Braz. Oral Res. 2022 36 e055 10.1590/1807-3107bor-2022.vol36.0055 35442384 35. Hamrick M.W. Samaddar T. Pennington C. McCormick J. Increased Muscle Mass with Myostatin Deficiency Improves Gains in Bone Strength with Exercise J. Bone Miner. Res. 2006 21 477 483 10.1359/JBMR.051203 16491296 36. McPherron A.C. Lawler A.M. Lee S.J. Regulation of skeletal muscle mass in mice by a new TGF-p superfamily member Nature 1997 387 83 90 10.1038/387083a0 9139826 37. Bonnieu A. Carnac G. Vernus B. Myostatin in the Pathophysiology of Skeletal Muscle Curr. Genom. 2007 8 415 422 10.2174/138920207783591672 19412331 PMC2647158 38. Buehring B. Binkley N. Myostatin—The Holy Grail for Muscle, Bone, and Fat? Curr. Osteoporos. Rep. 2013 11 407 414 10.1007/s11914-013-0160-5 24072591 39. Jones B.E. Maerz M.D. Buckner J.H. IL-6: A cytokine at the crossroads of autoimmunity Curr. Opin. Immunol. 2018 55 9 14 10.1016/j.coi.2018.09.002 30248523 PMC6286200 40. Cantini M. Massimino M.L. Rapizzi E. Rossini K. Catani C. Dallalibera L. Carraro U. Human Satellite Cell-Proliferation in Vitro Is Regulated by Autocrine Secretion of IL-6 Stimulated by a Soluble Factor(s) Released by Activated Monocytes Biochem. Biophys. Res. Commun. 1995 216 49 53 10.1006/bbrc.1995.2590 7488123 41. Serrano A.L. Baeza-Raja B. Perdiguero E. Jardí M. Muñoz-Cánoves P. Interleukin-6 Is an Essential Regulator of Satellite Cell-Mediated Skeletal Muscle Hypertrophy Cell Metab. 2008 7 33 44 10.1016/j.cmet.2007.11.011 18177723 42. Rosendal L. Søgaard K. Kjær M. Sjøgaard G. Langberg H. Kristiansen J. Increase in interstitial interleukin-6 of human skeletal muscle with repetitive low-force exercise J. Appl. Physiol. 2005 98 477 481 10.1152/japplphysiol.00130.2004 15448117 43. Roberts L.D. Boström P. O’Sullivan J.F. Schinzel R.T. Lewis G.D. Dejam A. Lee Y.-K. Palma M.J. Calhoun S. Georgiadi A. β-Aminoisobutyric Acid Induces Browning of White Fat and Hepatic β-Oxidation and Is Inversely Correlated with Cardiometabolic Risk Factors Cell Metab. 2014 19 96 108 10.1016/j.cmet.2013.12.003 24411942 PMC4017355 44. Goldspink G. Mechanical Signals, IGF-I Gene Splicing, and Muscle Adaptation Physiology 2005 20 232 238 10.1152/physiol.00004.2005 16024511 45. Reijnders C.M.A. Bravenboer N. Tromp A.M. Blankenstein M.A. Lips P. Effect of mechanical loading on insulin-like growth factor-I gene expression in rat tibia J. Endocrinol. 2007 192 131 140 10.1677/joe.1.06880 17210750 46. Bikle D.D. Tahimic C. Chang W. Wang Y. Philippou A. Barton E.R. Role of IGF-I signaling in muscle bone interactions Bone 2015 80 79 88 10.1016/j.bone.2015.04.036 26453498 PMC4600536 47. Noden D.M. Francis-West P. The differentiation and morphogenesis of craniofacial muscles Dev. Dyn. 2006 235 1194 1218 10.1002/dvdy.20697 16502415 48. Farquharson C. Bones and Cartilage: Developmental and Evolutionary Skeletal Biology Second Edition. Br. Poult. Sci. 2015 56 755 756 10.1080/00071668.2015.1096623 Figure 1 PRISMA Flowchart. dentistry-13-00400-t001_Table 1 Table 1 List of search words, mesh terms, and Boolean logic. Concept 1: Myokines Concept 2: Bone Metabolism Concept 3: Craniofacial/Masticatory myokine * “bone remodeling” craniofacial “muscle-derived cytokine *” “bone metabolism” mandible OR mandibular irisin osteogenesis maxilla OR maxillary myostatin osteoblast * “temporomandibular joint” OR TMJ interleukin-6 OR IL-6 osteoclast * “facial bone *” Cytokines [Mesh] “bone mineral density” “jaw bone *” FNDC5 protein, human [Mesh] “bone resorption” “masticatory muscle *” Myostatin [Mesh] Bone Remodeling [Mesh] masseter OR temporalis Interleukin-6 [Mesh] Osteogenesis [Mesh] Mandible [Mesh]  Osteoblasts [Mesh] Maxilla [Mesh]  Bone Resorption [Mesh] Temporomandibular Joint [Mesh] * indicates major topics of this review. dentistry-13-00400-t002_Table 2 Table 2 PICO framework for eligibility criteria. Population  Humans or animals (in vivo or in vitro studies) Craniofacial bones (e.g., mandible, maxilla, alveolar bone, temporomandibular joint, and cranial bones) Muscle-bone crosstalk in the craniofacial region Intervention/exposure  Presence, secretion, or modulation of myokines. Muscle activity, injury, or stimulation affecting myokine release Control  With vs. without myokine exposure Healthy vs. disease states. Different levels or types of muscle activity Craniofacial vs. non-craniofacial bones Outcome  Bone metabolism indicators (bone formation, resorption, and remodeling) Changes in bone density, structure, or healing Molecular markers of bone turnover Histological or radiographic bone changes dentistry-13-00400-t003_Table 3 Table 3 Studies selected describing myokines involved in craniofacial bone metabolism. Author and Year Population Intervention Control Myokine Considered Key Findings Yamamoto et al. [ 16 Mandiblederived osteoblast cells from 4–6-weeks old male mice. Intermittent hydrostatic pressure (magnitude: 0.1, 1, and 6 MPa; time: 10, 30, and 60 min; frequency: 1 Hz) Varying level of hydrostatic pressure. IL-6 The hydrostatic pressure simulating the occlusal force influenced the RANKL/OPG ratio in maintaining the bone homeostasis through osteoclastogenesis. Shinoda et al. [ 17 48 patients with TMD Synovial fluids from TMD patients with osseous changes. 18 healthy individuals IL-6 IL-6 was increased in the patients with osseous changes due to chronic TMD and absent in healthy controls, suggesting its role in TMD pathogenesis. Periera et al. [ 18 Mice Aerobic or resistant physical training combined with orthodontic tooth movement Sedentary mice IL-6, IGF-1 Increased BMD, BV, BV/TV, and IGF-1 production was noted in the maxilla in the physical training group. Ravosa et al. [ 19 Myostatin deficient and wild mice Masticatory overloading through diet. New Zealand white rabbit. Myostatin Tissue mineral density was lowest at the TMJ and highest at the symphysis. Nicholson et al. [ 20 Myostatin-knockout mice. Increased jaw adductor activity due to masticatory overload Wild-type mice Myostatin There was altered mineralization of condylar subchondral bone due to increased masticatory stress in myostatin-deficient mice. Byron et al. [ 21 Myostatin-deficient mice Increased bite force due to hard diet and temporalis muscle mass Wild-type mice Myostatin The sagittal suture connective tissue was less stiff due to hyper muscular temporalis and dissipated bite force better. Yang et al. [ 22 Sprague -Dawley rats Presence of irisin in PDL, dental pulp, and osteoblasts through cell culture Cultured human PDL, dental pulp, and osteoblasts Irisin Irisin presence in the rat and human PDL was confirmed. The irisin production was affected during osteoblast like differentiation. Yang et al., 2023 23 Wistar rats; Irisin injected submucosally along with mesial movement of molar Wistar rats; Irisin Osteogenic potential of periodontal ligament was enhanced, and it reduced the orthodontic tooth movement on the compression side. Liu et al. [ 24 Wistar rats Unilateral loading with dental splints Control-group rats IGF-1 IGF-1 was increased in the non-chewing side, and condylar degeneration was seen on the chewing side. ",
  "metadata": {
    "Title of this paper": "Bones and Cartilage: Developmental and Evolutionary Skeletal Biology",
    "Journal it was published in:": "Dentistry Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469128/"
  }
}