{
  "title": "Paper_774",
  "abstract": "pmc Pharmaceutics Pharmaceutics 2103 pharmamdpi pharmaceutics Pharmaceutics 1999-4923 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473325 PMC12473325.1 12473325 12473325 41012542 10.3390/pharmaceutics17091207 pharmaceutics-17-01207 1 Review Applications of PBPK Modeling to Estimate Drug Metabolism and Related ADME Processes in Specific Populations https://orcid.org/0000-0002-2541-9815 Gonnabathula Pavani † Li Miao ‡ https://orcid.org/0000-0002-1553-5257 Nagumalli Suresh K. https://orcid.org/0000-0002-2925-7999 Mehta Darshan https://orcid.org/0000-0003-2855-6871 Fairman Kiara * Gonzalez-Alvarez Isabel Academic Editor Sánchez-Dengra Bárbara Academic Editor Division of Biochemical Toxicology, National Center for Toxicological Research, US Food and Drug Administration, Jefferson, AR 72079, USA darshan.mehta@fda.hhs.gov * kiara.fairman@fda.hhs.gov † Current address: Pharmacy Practice and Science Department, University of Kentucky, Lexington, KY 40509 USA; gpavani14@gmail.com ‡ Current address: Office of Cosmetics and Colors, US Food and Drug Administration, College Park, MD 20740, USA; miao.li@fda.hhs.gov 16 9 2025 9 2025 17 9 497664 1207 01 7 2025 21 8 2025 09 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: Results: Conclusions: physiologically based pharmacokinetic modeling metabolism disease polymorphism National Center for Toxicological Research within the Food and Drug Administration This study was supported by the National Center for Toxicological Research within the Food and Drug Administration. This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Physiologically based pharmacokinetic (PBPK) modeling has gained more traction over the years, with a steady increase in publications and submissions to regulatory bodies [ 1 2 The utility of PBPK modeling extends across the drug development continuum, from early discovery through to regulatory evaluation. These models offer particular value in addressing ethical and practical challenges associated with clinical testing in vulnerable or special populations, including pregnant women, pediatric and geriatric patients, and individuals with organ impairments. In such populations, where physiological and pathophysiological changes significantly alter pharmacokinetic profiles, PBPK modeling provides a scientifically rigorous tool for estimation, which can assist with clinical studies. PBPK modeling shows additional utility over standard population PK models, particularly in special populations where clinical data is lacking or when specific organ drug concentrations are desired. Furthermore, PBPK models serve as powerful tools for predicting interindividual variability in drug responses arising from genetic polymorphisms, age-related physiological changes, and disease-induced alterations in drug metabolism. By incorporating population-specific physiological parameters and enzyme kinetics, these models can inform dosing strategies and identify potential safety concerns across diverse patient populations. This review examines the key applications of PBPK modeling in determining drug metabolism in specific populations, including those based on genetics, age, life stage, and disease state. Overall, understanding how these factors influence drug kinetics can aid in designing appropriate clinical trials, inform regulatory decision-making, and may even inform future personalized medicine approaches. 2. Drug Metabolism and Genetics in Specific Populations 2.1. CYP Enzyme Polymorphisms Polymorphisms are changes in the nucleotide sequence of genes that allow for variability in specific phenotypical outcomes. Enzymes that are affected by polymorphisms can have drastic effects on metabolism, which can be subject to PBPK modeling. Polymorphisms in enzymes can cause ultrarapid, rapid, intermediate, or poor metabolism. If a particular drug is metabolized by an enzyme such as cytochrome P450 3A4 (CYP3A4) and the individual is an ultrarapid metabolizer due to polymorphisms, we could increase the rate of metabolism for that enzyme, interacting with the drug kinetically to mimic what an ultrarapid metabolizer’s activity could achieve. Additionally, a sample of the population could be examined to understand the prevalence of each type of metabolizer or single-nucleotide polymorphism (SNP) in the population for a specific enzyme, which would aid in creating more realistic population models. Several cytochromes, such as CYPs 1A2, 2D6, 2C9, and 2C19, are considered to be highly polymorphic in certain ethnicities, whereas CYP 2D6, 2A6, and 2B6 are polymorphic regardless of ethnic group [ 3 Table 1 4 2.2. Genetic Polymorphisms Although genetic polymorphisms are most often thought of as affecting metabolic enzymes, there are other physiological factors to consider. The target site response or pharmacodynamic effect can differ from subject to subject. This is not explicitly related to metabolism, but it could be related to target site sensitivity or other factors. Additionally, transporters can exhibit polymorphisms, which result in genetic differences in the rate of influx or efflux [ 5 2.3. Influence of Ethnicity Ethnic influences in PBPK modeling can most often be attributed to genetic polymorphisms, but with variations within the confines of the appropriate distribution of the average individual in the population [ 6 7 8 9 10 pharmaceutics-17-01207-t001_Table 1 Table 1 Pharmacogenetic table of select enzymes or alleles showing frequencies in ethnicities as defined by ClinPGx biogeographical groups [ 4 Frequencies of Enzyme and Allele Phenotypes in Biogeographical Groups Enzyme/Gene Phenotype/Allele Function African American/Afro-Caribbean American Central/South Asian East Asian European Latino Near Eastern Oceanian Sub-Saharan African CYP2D6 Ultrarapid metabolizer 0.04 0.05 0.02 0.01 0.02 0.04 0.07 0.18 0.04  Normal 0.54 0.67 0.58 0.53 0.49 0.60 0.57 0.64 0.46  Intermediate 0.36 0.23 0.28 0.38 0.38 0.29 0.30 0.10 0.38  Poor 0.02 0.02 0.02 0.01 0.07 0.03 0.02 0.00 0.02  Indeterminate 0.04 0.02 0.10 0.07 0.04 0.04 0.04 0.09 0.09 CYP2C9 Normal 0.76 0.83 0.60 0.84 0.63 0.74 0.61 0.91 0.73  Intermediate 0.24 0.16 0.36 0.15 0.35 0.25 0.36 0.09 0.26  Poor 0.01 0.00 0.04 0.01 0.03 0.01 0.03 0 0.01  Indeterminate - - 0.00 0.00 0.00 0.00 - - - CYP2C19 Ultrarapid metabolizer 0.04 0.01 0.03 0.00 0.05 0.03 0.04 0.00 0.03  Rapid metabolizer 0.24 0.14 0.19 0.03 0.27 0.24 0.26 0.02 0.21  Normal metabolizer 0.33 0.63 0.30 0.38 0.40 0.52 0.45 0.04 0.37  Intermediate or likely intermediate metabolizer 0.34 0.21 0.41 0.46 0.26 0.19 0.24 0.37 0.34  Poor or likely poor metabolizer 0.05 0.01 0.08 0.13 0.02 0.01 0.02 0.57 0.05  Indeterminate 0.00 - - 0.00 - - - - - CYP3A4 Normal metabolizer 0.21 - 0.11 0.06 0.01 0.03 0.01 - 0.23  Intermediate or possible intermediate metabolizer 0.50 - 0.44 0.38 0.14 0.29 0.21 - 0.50  Poor metabolizer 0.30 - 0.45 0.56 0.86 0.68 0.77 - 0.27  Indeterminate - - - - - - - - - UGT1A1 allele Decreased function 0.43 - 0.46 0.29 0.33 0.41 0.31 0.04 0.44  Normal function 0.03 - 0.54 0.71 0.36 0.21 0.68 0.96 0.49  Increased function 0.08 - - - - - 0.01 - 0.07  Unknown function 0.45 - - - 0.31 0.38 - - - SLCO1B1 allele Increased function - - - - 0.17 - - - -  Normal function 0.99 0.76 0.93 0.87 0.66 - 0.80 1.00 0.97  No function 0.01 0.24 0.07 0.13 0.17 - 0.20 - 0.03  Uncertain function - - 0.00 0.00 0.00 - - - - TPMT allele Normal function 0.92 - 0.98 0.98 0.95 0.94 0.97 - 0.92  No function 0.04 - 0.02 0.02 0.04 0.05 0.03 - 0.05  Uncertain function 0.04 - 0.00 0.00 0.00 0.00 - - 0.02  Unknown function - - - 0.00 0.00 0.00 - - - DPYD allele Normal function 0.80 - 0.58 0.49 0.65 0.69 - - 0.83  Decreased function 0.02 - 0.03 0.00 0.03 0.01 - - 0.03  No function 0.01 - 0.01 0.00 0.01 0.00 - - - 3. Drug Metabolism in Specific Life-Stage Populations For special populations, such as those in various life stages, PBPK modeling has several advantages over traditional clinical studies or population pharmacokinetic modeling. PBPK modeling is more mechanistic in nature. Therefore, the typical predictable physiology for a particular life stage ( Table 2 3.1. Geriatric Populations The geriatric population (typically those aged 65 years or older) often exhibits altered drug metabolism due to age-related physiological decline. Liver mass and hepatic blood flow progressively decrease with age, reducing the clearance of high-extraction-ratio drugs [ 11 12 PBPK models for elderly individuals incorporate these physiological changes to simulate altered ADME. PBPK modeling is particularly valuable in polypharmacy scenarios where older adults are at a higher risk of drug–drug interactions and adverse events [ 13 3.2. Adult Populations Although adults (18–65 years) are considered to be the standard population in drug development, PBPK modeling is still vital in accounting for interindividual variability within this group. Factors such as genetic polymorphisms, co-morbid conditions, enzyme-inducing substances (e.g., smoking), or drug-drug interactions can significantly influence intermediate metabolic drug metabolism. Genetic variants affecting enzymes like CYP2C19 and CYP2D6 can lead to poor, intermediate, or ultrarapid metabolism of certain drugs. PBPK modeling integrates genotypic information to predict exposure profiles, supporting personalized dosing [ 14 Lifestyle factors and hepatic/renal disease states can be incorporated into adult PBPK models to simulate altered drug kinetics. These models have been applied to simulate hepatic impairment in patients with cirrhosis, thereby guiding dose recommendations for hepatically cleared drugs such as propranolol [ 15 3.3. Neonatal Populations Neonates (birth to 28 days) exhibit substantial physiological immaturity, making them particularly vulnerable to drug toxicity and therapeutic failure [ 16 17 18 19 Renal clearance is also impaired in neonates due to immature glomerular filtration and tubular function, leading to prolonged half-lives for renally cleared drugs [ 20 21 PBPK models have been instrumental in predicting the safe and effective neonatal dosing of antibiotics such as gentamicin and vancomycin [ 22 23 3.4. Pediatric Populations Pediatric patients, spanning from infancy to adolescence, undergo rapid physiological changes that impact all aspects of drug metabolism. PBPK models must capture this developmental progression, including gastrointestinal maturation, increasing hepatic enzyme activity, and improved renal function over time. The ontogeny of CYP enzymes plays a central role. For example, CYP3A4 activity is minimal at birth but reaches adult levels within the first year, influencing the metabolism of drugs like midazolam [ 24 25 Pediatric PBPK modeling is frequently used to extrapolate adult data for the selection of pediatric doses. The FDA encourages PBPK modeling in pediatric drug development through its Pediatric Study Plan and Written Request programs [ 26 27 28 3.5. Gestational Period (Pregnancy) Pregnancy presents unique challenges for pharmacokinetics due to physiological adaptations that evolve throughout gestation. These include a 30–50% increase in plasma volume, a 50% rise in cardiac output, an elevated glomerular filtration rate, and significant changes in hepatic enzyme activity [ 29 30 PBPK models of pregnancy account for maternal–fetal compartments, time-dependent enzyme changes, and placental transfer rates. These models have been applied to antiretroviral therapies such as acyclovir, emtricitabine, dolutegravir, and raltegravir. PBPK models facilitate the extrapolation of drug pharmacokinetics from well-characterized populations of healthy adults to the population of pregnant women [ 31 32 pharmaceutics-17-01207-t002_Table 2 Table 2 Various ADME properties that can affect drug metabolism in several life stages, which should be considered in PBPK modeling. Population Neonate Pediatric Adolescent Adult Geriatric Pregnancy  Absorption Slower gastric emptying. Higher gastric pH and less acidic. Irregular peristalsis. Slow, irregular IM absorption due to decreased muscle mass and blood flow. Increased percutaneous absorption due to thinner stratum cornea and higher skin hydration. Approaches adult values as they grow. Gastric pH decreases and becomes more acidic. Gastric emptying becomes more regular Generally similar to adults. Gastric pH and gastric emptying are comparable to adults Baseline for comparison. Stable gastric pH and gastric emptying. Intestinal surface area is at its maximum Gastric emptying and peristalsis may be slower. Gastric pH may be higher (hypochlorhydria). Decreased splanchnic blood flow Slower gastric emptying. Nausea and vomiting may affect drug absorption  Distribution Higher total body water (70–80%). Lower body fat (6–13.4%). Reduced plasma protein binding due to lower albumin levels and competition from endogenous substances. More permeable blood-brain barrier. Total body water decreases. Body fat increases. Plasma protein binding increases and approaches adult values Body composition changes occur (e.g., rapid growth and increased muscle mass). Plasma protein binding is similar to adults Body fat (18%) Water percentage (60%). Stable body composition. Stable Plasma protein binding Body fat (30%); water percentage (54%). Decreased total body water. Increased body fat. Decreased lean body mass. Plasma protein binding may be reduced due to lower albumin levels Increased total body water (up to 8 L). Increased blood volume (30–50%). Decreased plasma albumin concentration. Maternal–placental circulation can affect drug distribution. Increase in cardiac output (50%).  Metabolism Immature and reduced activity for Phase I (CYP450) and Phase II (conjugation) enzyme systems CYP450 enzymes may be more active than in adults, leading to faster drug clearance for some drugs Metabolic activity generally similar to adults but some enzyme systems may be at peak activity Stable hepatic metabolism, which serves as the reference point for drug clearance Phase I (CYP450) metabolism is generally decreased, such as CYP1A2 and CYP2C19. Phase II (conjugation) metabolism is less affected. Decreased hepatic blood flow. CYP450 activity variable (induced, inhibited, or no change). Increase in CYP3A4 and UGT1A1. Decrease in CYP1A2 and CYP2C19Increased hepatic blood flow.  Excretion Low and immature glomerular filtration rate (GFR) and tubular secretion GFR and tubular secretion mature, often becoming more efficient than in adults. Renal function similar to adults Stable renal function, which serves as the reference point for drug clearance. GFR and renal blood flow progressively decline. Decreased tubular secretion Significantly increased GFR and renal blood flow, resulting in faster elimination for some drugs.  References [ 16 17 18 19 20 21 22 [ 16 19 21 22 [ 19 [ 11 12 19 [ 26 27 4. Disease States The most common disease states in the human population are renal impairment, hepatic impairment, heart failure, and obesity. The frequency of published journal articles about PBPK disease-state models correlates to the extent of these diseases, which are discussed in more detail below. 4.1. Renal Impairment When considering renal impairment, one must consider how this affects the pharmacokinetics of the drug when building the pharmacokinetic model. If the drug or its metabolites are primarily renally cleared, there will be a direct effect on the plasma or target site concentration. Additionally, although this review mainly focuses on renal-specific pathways, it is also worthwhile to consider the potential changes that renal disease may have on non-renal clearance mechanisms [ 33 34 35 36 13 37 38 39 40 41 4.2. Hepatic Impairment The liver is the main site for metabolism. Thus, for the many drugs metabolized by the liver, hepatic impairment can cause a reduction in metabolism (e.g., CYP [ 42 43 44 15 The liver is also responsible for producing many plasma proteins [ 45 46 47 43 44 48 49 50 4.3. Body Mass Index and Weight Body mass index (BMI) and weight are two ways to assess patients or research subjects for dosing purposes. BMI is often used to determine if a person is underweight, of normal weight, overweight, or obese. There are even fewer searchable publications on obesity PBPK models compared with hepatic or renal impairment. However, PBPK models could be helpful in this area, depending on the type of drug being researched. Obesity can lead to an increase in adipose tissue, altered organ sizes and blood flow, and changes in renal function as well as alterations in enzyme activity, which may affect half-life, hepatic and renal metabolism, clearance, and volume of distribution [ 51 52 53 54 55 Predictions about drug disposition could better inform dose adjustments in this population for dose optimization and potentially in clinical trials. However, search results in this area indicate that data are lacking [ 51 4.4. Other Diseases (Chronic and Acute) Due to the complexity and infinite number of potential disease states, we briefly cover some of the more frequently published PBPK models and considerations for some of those disease states. As many physiologies can exist that may influence PK outcomes, co-morbidity PBPK models must be considered to properly capture various metabolic processes. 4.4.1. Chronic Diseases Chronic disease modeling in PBPK modeling involves incorporating disease-specific physiological and biochemical alterations that affect drug metabolism. Chronic conditions, such as diabetes, cancer, cardiovascular disease, and autoimmune conditions, often result in long-term physiological changes that can affect drug metabolism by significantly modifying metabolic enzyme activity, organ function, blood flow distribution, and plasma protein levels, all of which influence drug ADME. PBPK modeling provides a framework to assess these changes. This approach supports precision medicine by tailoring drug therapy to individual patient conditions. Diabetes mellitus is associated with altered gastric emptying, variations in plasma protein binding, and changes in the expression of CYP enzymes, particularly CYP2E1 [ 56 57 Tumors and cancer treatments can influence hepatic metabolism, gastrointestinal function, and systemic inflammation. Additionally, the combination of cancer with various disease states or life stages, such as pregnancy [ 58 59 Heart failure can alter organ blood flow and cardiac output, leading to issues with organ perfusion. Although few PBPK models exist in this area, PBPK models have predicted altered kinetics for this population. For example, captopril dose estimations in patients with chronic heart failure and chronic kidney disease were successfully predicted using PBPK modeling [ 60 Chronic inflammatory conditions, such as those seen in rheumatoid arthritis or inflammatory bowel disease, lead to a downregulation of hepatic CYP enzymes through the action of pro-inflammatory cytokines. This modulation has a significant impact on drug metabolism [ 61 62 4.4.2. Acute Diseases Acute disease modeling in PBPK modeling involves incorporating transient but significant physiological and biochemical changes that affect drug metabolism. Acute conditions, such as sepsis, inflammation, or acute liver and kidney injuries, can rapidly alter enzyme activity, organ function, and blood flow, leading to dynamic changes in ADME. These short-term changes pose challenges for PBPK modeling, but these can be integrated. Infectious diseases and sepsis lead to systemic inflammation, which results in decreased hepatic and renal functions. This affects drug transporters, such as P-glycoprotein and breast cancer resistance protein, and reduces CYP activity [ 63 61 64 65 Acute liver failure is characterized by abrupt hepatic dysfunction, which significantly reduces phase I and II metabolic capacity. As discussed above, PBPK models can simulate reduced enzyme activity (e.g., loss of CYP3A4) and altered hepatic blood flow to predict the toxicity risk from standard dosing regimens [ 42 13 66 5. Discussion 5.1. Personalized Dosing Strategy A personalized dosing strategy in PBPK modeling tailors drug administration to an individual’s specific physiological and metabolic characteristics, thereby improving therapeutic efficacy while minimizing adverse effects. PBPK models can integrate patient-specific factors such as genetic polymorphisms into drug-metabolizing enzymes (e.g., CYP variants), age (e.g., pediatric, adult, or geriatric), organ function (e.g., liver or kidney impairment), body composition (e.g., BMI or fat-to-lean mass ratio), sex (e.g., male or female), and disease states (e.g., chronic or acute conditions) [ 67 67 5.2. Clinical Trial Optimization As previously discussed, PBPK modeling allows the generation of virtual subpopulations that can be utilized in clinical trial optimization to design more efficient and targeted studies, thus reducing trial costs and increasing drug development success rates. The integration of key physiological factors, such as genetic polymorphisms, enzyme activity (e.g., CYP variations), organ function (e.g., liver or kidney impairment), and disease states, enables PBPK models to simulate how drugs are metabolized across diverse populations. These simulations help to identify potential metabolic differences before clinical trials begin, allowing for optimized dosing strategies, refined inclusion criteria, and a reduced risk of adverse effects, and minimizing the need for extensive trials in these groups [ 67 5.3. Regulatory Submission Regulatory submissions that utilize PBPK modeling to predict subpopulation pharmacokinetics play an important role in demonstrating how metabolism influences drug disposition, safety, and efficacy. Although most new drug application submissions to the FDA still primarily focus on drug-drug interactions, susceptible subpopulation models for life stages (e.g., children), organ impairment, and genetic polymorphisms make up a smaller percentage of submissions [ 1 2 6. Conclusions PBPK modeling to estimate drug metabolism in specific populations, particularly in subpopulations, is a definitive step for improving patient, research, and clinical trial outcomes. Several areas of risk can be identified and mitigated, which can enhance subjects’ and patients’ experience, safety, and drug efficacy. Additionally, the construction and exploration of subpopulations using PBPK models enable a more granular examination of the knowledge gaps that may exist within those populations. 7. Future Directions PBPK modeling is already recognized as a new alternative method that is gaining traction and credibility depending upon its application. Several groups are adding layers to the usefulness and testing the intersection of artificial intelligence and PBPK modeling. A recent search for (“artificial intelligence”) AND (PBPK OR “physiologically based pharmacokinetic”) indicated that approximately 55 articles were indexed on PubMed from 2013 to August 2025 [ 68 Figure 1 69 70 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.L., P.G. and K.F.; data curation, P.G. and K.F.; writing-original draft preparation, P.G. and K.F.; writing-review and editing, S.K.N., D.M., M.L., P.G. and K.F. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Disclaimer This article reflects the views of the authors and does not necessarily reflect those of the U.S. Food and Drug Administration. Any mention of commercial products is for clarification only and is not intended as approval, endorsement, or recommendation. Abbreviations The following abbreviations are used in this manuscript: PBPK Physiologically Based Pharmacokinetic ADME Absorption Distribution Metabolism Excretion FDA Food and Drug Administration EMA European Medicines Agency NASH Non-Alcoholic Steatohepatitis NAFLD Non-Alcoholic Fatty Liver Disease References 1. Sun Z. Zhao N. Zhao X. Wang Z. Liu Z. Cui Y. Application of physiologically based pharmacokinetic modeling of novel drugs approved by the U.S. food and drug administration Eur. J. Pharm. Sci. 2024 200 106838 10.1016/j.ejps.2024.106838 38960205 2. Grimstein M. Yang Y. Zhang X. Grillo J. Huang S.-M. Zineh I. Wang Y. Physiologically Based Pharmacokinetic Modeling in Regulatory Science: An Update from the U.S. Food and Drug Administration’s Office of Clinical Pharmacology J. Pharm. Sci. 2019 108 21 25 10.1016/j.xphs.2018.10.033 30385284 3. Preissner S.C. Hoffmann M.F. Preissner R. Dunkel M. Gewiess A. Preissner S. Polymorphic cytochrome P450 enzymes (CYPs) and their role in personalized therapy PLoS ONE 2013 8 e82562 10.1371/journal.pone.0082562 24340040 PMC3858335 4. Whirl-Carrillo M. Huddart R. Gong L. Sangkuhl K. Thorn C.F. Whaley R. Klein T.E. An Evidence-Based Framework for Evaluating Pharmacogenomics Knowledge for Personalized Medicine Clin. Pharmacol. Ther. 2021 110 563 572 10.1002/cpt.2350 34216021 PMC8457105 5. Yee S.W. Brackman D.J. Ennis E.A. Sugiyama Y. Kamdem L.K. Blanchard R. Galetin A. Zhang L. Giacomini K.M. Influence of Transporter Polymorphisms on Drug Disposition and Response: A Perspective from the International Transporter Consortium Clin. Pharmacol. Ther. 2018 104 803 817 10.1002/cpt.1098 29679469 PMC6348109 6. Olafuyi O. Parekh N. Wright J. Koenig J. Inter-ethnic differences in pharmacokinetics-is there more that unites than divides? Pharmacol. Res. Perspect. 2021 9 e00890 10.1002/prp2.890 34725944 PMC8561230 7. Liang F. Zhang Y. Xue Q. Yao N. Exploring inter-ethnic and inter-patient variability and optimal dosing of osimertinib: A physiologically based pharmacokinetic modeling approach Front. Pharmacol. 2024 15 1363259 10.3389/fphar.2024.1363259 38500771 PMC10946252 8. Barter Z.E. Tucker G.T. Rowland-Yeo K. Differences in Cytochrome P450-Mediated Pharmacokinetics Between Chinese and Caucasian Populations Predicted by Mechanistic Physiologically Based Pharmacokinetic Modelling Clin. Pharmacokinet. 2013 52 1085 1100 10.1007/s40262-013-0089-y 23818090 9. An X.-X. Yu Y. Li G.-F. Yu G. Abundance and Associated Variations of Cytochrome P450 Drug-Metabolizing Enzymes in the Liver of East Asian Adults: A Meta-Analysis Eur. J. Drug Metab. Pharmacokinet. 2021 46 225 233 10.1007/s13318-020-00667-9 33368014 10. Pinninti N.R. Mago R. Leon J.D. Coffee, Cigarettes and Meds: What Are the Metabolic Effects? Psychiatr. Times 2005 22 20 11. Mangoni A.A. Jackson S.H.D. Age-related changes in pharmacokinetics and pharmacodynamics: Basic principles and practical applications Br. J. Clin. Pharmacol. 2004 57 6 14 10.1046/j.1365-2125.2003.02007.x 14678335 PMC1884408 12. Kinirons M.T. Crome P. Clinical pharmacokinetic considerations in the elderly. An update Clin. Pharmacokinet. 1997 33 302 312 10.2165/00003088-199733040-00005 9342505 13. Yeo K.R. Gil Berglund E. An Integrated Approach for Assessing the Impact of Renal Impairment on Pharmacokinetics of Drugs in Development: Pivotal Role of PBPK Modelling Clin. Pharmacol. Ther. 2021 110 1168 1171 10.1002/cpt.2243 33934342 PMC8596427 14. Jamei M. Turner D. Yang J. Neuhoff S. Polak S. Rostami-Hodjegan A. Tucker G. Population-based mechanistic prediction of oral drug absorption AAPS J. 2009 11 225 237 10.1208/s12248-009-9099-y 19381840 PMC2691459 15. Kalam M.N. Rasool M.F. Alqahtani F. Imran I. Rehman A.U. Ahmed N. Development and Evaluation of a Physiologically Based Pharmacokinetic Drug-Disease Model of Propranolol for Suggesting Model Informed Dosing in Liver Cirrhosis Patients Drug Des. Dev. Ther. 2021 15 1195 1211 10.2147/DDDT.S297981 PMC7982780 33762817 16. Fernandez E. Perez R. Hernandez A. Tejada P. Arteta M. Ramos J.T. Factors and Mechanisms for Pharmacokinetic Differences between Pediatric Population and Adults Pharmaceutics 2011 3 53 72 10.3390/pharmaceutics3010053 24310425 PMC3857037 17. Saunders N.R. Liddelow S.A. Dziegielewska K.M. Barrier mechanisms in the developing brain Front. Pharmacol. 2012 3 46 10.3389/fphar.2012.00046 22479246 PMC3314990 18. Neal-Kluever A. Fisher J. Grylack L. Kakiuchi-Kiyota S. Halpern W. Physiology of the Neonatal Gastrointestinal System Relevant to the Disposition of Orally Administered Medications Drug Metab. Dispos. 2019 47 296 313 10.1124/dmd.118.084418 30567878 19. Li H. Lampe J.N. Neonatal cytochrome P450 CYP3A7: A comprehensive review of its role in development, disease, and xenobiotic metabolism Arch. Biochem. Biophys. 2019 673 108078 10.1016/j.abb.2019.108078 31445893 PMC6739124 20. Lu H. Rosenbaum S. Developmental pharmacokinetics in pediatric populations J. Pediatr. Pharmacol. Ther. 2014 19 262 276 10.5863/1551-6776-19.4.262 25762871 PMC4341411 21. O’HAra K. Wright I.M.R. Schneider J.J. Jones A.L. Martin J.H. Pharmacokinetics in neonatal prescribing: Evidence base, paradigms and the future Br. J. Clin. Pharmacol. 2015 80 1281 1288 10.1111/bcp.12741 26256466 PMC4693494 22. Albanell-Fernández M. Rodríguez-Reyes M. Bastida C. Soy D. A Review of Vancomycin, Gentamicin, and Amikacin Population Pharmacokinetic Models in Neonates and Infants Clin. Pharmacokinet. 2025 64 1 25 10.1007/s40262-024-01459-z 39821208 PMC11762427 23. Yeung C.H.T. Verstegen R.H.J. Greenberg R. Lewis T.R. Pharmacokinetic and pharmacodynamic principles: Unique considerations for optimal design of neonatal clinical trials Front. Pediatr. 2023 11 1345969 10.3389/fped.2023.1345969 38283405 PMC10811156 24. Edginton A.N. Willmann S. Physiology-based simulations of a pathological condition: Prediction of pharmacokinetics in patients with liver cirrhosis Clin. Pharmacokinet. 2008 47 743 752 10.2165/00003088-200847110-00005 18840029 25. Schijvens A.M. de Wildt S.N. Schreuder M.F. Pharmacokinetics in children with chronic kidney disease Pediatr. Nephrol. 2020 35 1153 1172 10.1007/s00467-019-04304-9 31375913 PMC7248054 26. U.S. Food and Drug Administration Pediatric Study Plans: Content of and Process for Submitting Initial Pediatric Study Plans and Amended Initial Pediatric Study Plans (Center for Drug Evaluation and Research (CDER) and Center for Biologics Evaluation and Research (CBER) U.S. Food and Drug Administration Silver Spring, MD, USA 2020 27. Johnson T.N. Small B.G. Gil Berglund E. Yeo K.R. A best practice framework for applying physiologically-based pharmacokinetic modeling to pediatric drug development CPT Pharmacomet. Syst. Pharmacol. 2021 10 967 972 10.1002/psp4.12678 PMC8452294 34288581 28. Jo H. Reddy V.P. Parkinson J. Boulton D.W. Tang W. Model-Informed Pediatric Dose Selection for Dapagliflozin by Incorporating Developmental Changes CPT Pharmacomet. Syst. Pharmacol. 2021 10 108 118 10.1002/psp4.12577 PMC7894404 33439535 29. Chandra M. Paray A.A. Natural Physiological Changes During Pregnancy Yale J. Biol. Med. 2024 97 85 92 10.59249/JTIV4138 38559455 PMC10964813 30. Anderson G.D. Pregnancy-induced changes in pharmacokinetics: A mechanistic-based approach Clin. Pharmacokinet. 2005 44 989 1008 10.2165/00003088-200544100-00001 16176115 31. Abdulsamed M. Naass A.A. Aeswani M.S. Bashir S. Enhancing Precision Drug Therapy and build pharmacokinetic model in Pregnant Women: PBPK Modeling of Antiviral drugs medRxiv 2024 24310817 10.1101/2024.07.22.24310817 32. Coppola P. Kerwash E. Cole S. Physiologically Based Pharmacokinetics Model in Pregnancy: A Regulatory Perspective on Model Evaluation. Perspective Front. Pediatr. 2021 9 687978 10.3389/fped.2021.687978 34249817 PMC8262675 33. Sun H. Frassetto L. Benet L.Z. Effects of renal failure on drug transport and metabolism Pharmacol. Ther. 2006 109 1 11 10.1016/j.pharmthera.2005.05.010 16085315 34. Nolin T. Naud J. Leblond F. Pichette V. Emerging evidence of the impact of kidney disease on drug metabolism and transport Clin. Pharmacol. Ther. 2008 83 898 903 10.1038/clpt.2008.59 18388866 35. U.S. Food and Drug Administration Pharmacokinetics in Patients with Impaired Renal Function-Study Design, Data Analysis, and Impact on Dosing Guidance for Industry (US Department of Health and Human Services) U.S. Food and Drug Administration Silver Spring, MD, USA 2024 36. Dreisbach A.W. Lertora J.J. The effect of chronic renal failure on drug metabolism and transport Expert Opin. Drug Metab. Toxicol. 2008 4 1065 1074 10.1517/17425255.4.8.1065 18680441 PMC2745294 37. Huang W. Bowman C. Yin M. Han L.W. Wen Y.W. Ahn S.K. Chen Y. A review of physiologically based pharmacokinetic modeling of renal drug disposition Drug Metab. Dispos. 2025 53 100042 10.1016/j.dmd.2025.100042 40048993 38. Yee K.L. Li M. Cabalu T. Sahasrabudhe V. Lin J. Zhao P. Jadhav P. Evaluation of Model-Based Prediction of Pharmacokinetics in the Renal Impairment Population J. Clin. Pharmacol. 2018 58 364 376 10.1002/jcph.1022 29077203 39. Tan M. Zhao P. Zhang L. Ho Y. Varma M.V. Neuhoff S. Nolin T.D. Galetin A. Huang S. Use of Physiologically Based Pharmacokinetic Modeling to Evaluate the Effect of Chronic Kidney Disease on the Disposition of Hepatic CYP2C8 and OATP1B Drug Substrates Clin. Pharmacol. Ther. 2019 105 719 729 10.1002/cpt.1205 30074626 PMC8246729 40. Raouf M. Atkinson T.J. Crumb M.W. Fudin J. Rational dosing of gabapentin and pregabalin in chronic kidney disease J. Pain Res. 2017 10 275 278 10.2147/JPR.S130942 28184168 PMC5291335 41. Nobili A. Garattini S. Mannucci P.M. Multiple diseases and polypharmacy in the elderly: Challenges for the internist of the third millennium J. Comorb. 2011 1 28 44 10.15256/joc.2011.1.4 29090134 PMC5556419 42. Ladumor M.K. Storelli F. Liang X. Lai Y. Enogieru O.J. Chothe P.P. Evers R. Unadkat J.D. Predicting changes in the pharmacokinetics of CYP3A-metabolized drugs in hepatic impairment and insights into factors driving these changes CPT Pharmacomet. Syst. Pharmacol. 2023 12 261 273 10.1002/psp4.12901 PMC9931433 36540952 43. Ozbey A.C. Keemink J. Wagner B. Pugliano A. Krähenbühl S. Annaert P. Fowler S. Parrott N. Umehara K. Physiologically Based Pharmacokinetic Modeling to Predict the Impact of Liver Cirrhosis on Glucuronidation via UGT1A4 and UGT2B7/2B4-A Case Study with Midazolam Drug Metab. Dispos. 2024 52 614 625 10.1124/dmd.123.001635 38653501 44. Ozbey A.C. Bachmann F. Duthaler U. Annaert P. Fowler S. Umehara K. Parrott N. Krähenbühl S. Dose Adjustment in Patients with Liver Cirrhosis–Comparison of Two Different Modeling Approaches Clin. Pharmacol. Ther. 2023 113 1346 1358 10.1002/cpt.2897 37017611 45. Shafqat F. Ur Rehman S. Khan M.S. Niaz K. Liver Encyclopedia of Toxicology 4th ed. Wexler P. Academic Press Cambridge, MA, USA 2024 897 913 46. Zamir A. Alqahtani F. Rasool M.F. Chronic kidney disease and physiologically based pharmacokinetic modeling: A critical review of existing models Expert Opin. Drug Metab. Toxicol. 2024 20 95 105 10.1080/17425255.2024.2311154 38270999 47. Heimbach T. Chen Y. Chen J. Dixit V. Parrott N. Peters S.A. Poggesi I. Sharma P. Snoeys J. Shebley M. Physiologically-Based Pharmacokinetic Modeling in Renal and Hepatic Impairment Populations: A Pharmaceutical Industry Perspective Clin. Pharmacol. Ther. 2021 110 297 310 10.1002/cpt.2125 33270249 PMC8359227 48. Small B.G. Hatley O. Jamei M. Gardner I. Johnson T.N. Incorporation and Performance Verification of Hepatic Portal Blood Flow Shunting in Minimal and Full PBPK Models of Liver Cirrhosis Clin. Pharmacol. Ther. 2023 114 1264 1273 10.1002/cpt.3032 37620290 49. Murphy W.A. Adiwidjaja J. Sjöstedt N. Yang K. Beaudoin J.J. Spires J. Siler S.Q. Neuhoff S. Brouwer K.L. Considerations for Physiologically Based Modeling in Liver Disease: From Nonalcoholic Fatty Liver (NAFL) to Nonalcoholic Steatohepatitis (NASH) Clin. Pharmacol. Ther. 2023 113 275 297 10.1002/cpt.2614 35429164 PMC10083989 50. El-Khateeb E. Achour B. Al-Majdoub Z.M. Barber J. Rostami-Hodjegan A. Non-uniformity of Changes in Drug-Metabolizing Enzymes and Transporters in Liver Cirrhosis: Implications for Drug Dosage Adjustment Mol. Pharm. 2021 18 3563 3577 10.1021/acs.molpharmaceut.1c00462 34428046 PMC8424631 51. Yang R. Ding Q. Ding J. Zhu L. Pei Q. Physiologically based pharmacokinetic modeling in obesity: Applications and challenges Expert Opin. Drug Metab. Toxicol. 2024 20 805 816 10.1080/17425255.2024.2388690 39101366 52. Kuepfer L. Niederalt C. Wendl T. Schlender J. Willmann S. Lippert J. Block M. Eissing T. Teutonico D. Applied Concepts in PBPK Modeling: How to Build a PBPK/PD Model CPT Pharmacomet. Syst. Pharmacol. 2016 5 516 531 10.1002/psp4.12134 PMC5080648 27653238 53. Mahmood I. Prediction of drug clearance in children from adults: A comparison of several allometric methods Br. J. Clin. Pharmacol. 2006 61 545 557 10.1111/j.1365-2125.2006.02622.x 16669848 PMC1885056 54. Brill M.J.E. van Rongen A. Houwink A.P.I. Burggraaf J. van Ramshorst B. Wiezer R.J. van Dongen E.P.A. Knibbe C.A.J. Midazolam pharmacokinetics in morbidly obese patients following semi-simultaneous oral and intravenous administration: A comparison with healthy volunteers Clin. Pharmacokinet. 2014 53 931 941 10.1007/s40262-014-0166-x 25141974 PMC4171595 55. Yeary J. Greco A. McKnight R. Petros K. Schaefer G. Garavaglia J. Adjusted vs Total Body Weight-Based Dosing of Sedation and Analgesia Used in the Intensive Care Unit Hosp. Pharm. 2020 55 400 404 10.1177/0018578719851452 33245723 PMC7672665 56. Elbarbry F. Influence of Diabetes Mellitus on Pharmacokinetics of Drugs MOJ Bioequiv. Bioavailab. 2016 2 3 4 10.15406/mojbb.2016.02.00016 57. Yang Y. Zhang Z. Li P. Kong W. Liu X. Liu L. A Whole-Body Physiologically Based Pharmacokinetic Model Characterizing Interplay of OCTs and MATEs in Intestine, Liver and Kidney to Predict Drug-Drug Interactions of Metformin with Perpetrators Pharmaceutics 2021 13 698 10.3390/pharmaceutics13050698 34064886 PMC8151202 58. Yang X. Grimstein M. Pressly M. Fletcher E.P. Shord S. Leong R. Utility of Physiologically Based Pharmacokinetic Modeling to Investigate the Impact of Physiological Changes of Pregnancy and Cancer on Oncology Drug Pharmacokinetics Pharmaceutics 2023 15 2727 10.3390/pharmaceutics15122727 38140068 PMC10748010 59. Cheeti S. Budha N.R. Rajan S. Dresser M.J. Jin J.Y. A physiologically based pharmacokinetic (PBPK) approach to evaluate pharmacokinetics in patients with cancer Biopharm. Drug Dispos. 2013 34 141 154 10.1002/bdd.1830 23225350 60. Rasool M.F. Ali S. Khalid S. Khalid R. Majeed A. Imran I. Saeed H. Usman M. Ali M. Alali A.S. Development and evaluation of physiologically based pharmacokinetic drug-disease models for predicting captopril pharmacokinetics in chronic diseases Sci. Rep. 2021 11 8589 10.1038/s41598-021-88154-2 33883647 PMC8060346 61. Renton K.W. Alteration of drug biotransformation and elimination during infection and inflammation Pharmacol. Ther. 2001 92 147 163 10.1016/S0163-7258(01)00165-6 11916535 62. Wang L. Chen Y. Zhou W. Miao X. Zhou H. Utilization of physiologically-based pharmacokinetic model to assess disease-mediated therapeutic protein-disease-drug interaction in immune-mediated inflammatory diseases Clin. Transl. Sci. 2022 15 464 476 10.1111/cts.13164 34581012 PMC8841519 63. Lenoir C. Rollason V. Desmeules J.A. Samer C.F. Influence of Inflammation on Cytochromes P450 Activity in Adults: A Systematic Review of the Literature Front. Pharmacol. 2021 12 733935 10.3389/fphar.2021.733935 34867341 PMC8637893 64. Bahnasawy S.M. Parrott N.J. Gijsen M. Spriet I. Friberg L.E. Nielsen E.I. Physiologically-based pharmacokinetic modelling in sepsis: A tool to elucidate how pathophysiology affects meropenem pharmacokinetics Int. J. Antimicrob. Agents 2024 64 107352 10.1016/j.ijantimicag.2024.107352 39343059 65. Ferreira A. Martins H. Oliveira J.C. Lapa R. Vale N. PBPK Modeling and Simulation of Antibiotics Amikacin, Gentamicin, Tobramycin, and Vancomycin Used in Hospital Practice Life 2021 11 1130 10.3390/life11111130 34833005 PMC8620954 66. Alsmadi M.M. Alzughoul S.B. In vitro-in vivo extrapolation of bexarotene metabolism in the presence of chronic kidney disease and acute kidney injury in rat using physiologically based pharmacokinetic modeling and extrapolation to human Biopharm. Drug Dispos. 2023 44 221 244 10.1002/bdd.2337 36319070 67. Hartmanshenn C. Scherholz M. Androulakis I.P. Physiologically-based pharmacokinetic models: Approaches for enabling personalized medicine J. Pharmacokinet. Pharmacodyn. 2016 43 481 504 10.1007/s10928-016-9492-y 27647273 PMC5204363 68. National Library of Medicine (US) NCfBI PubMed [Internet] Available online: https://pubmed.ncbi.nlm.nih.gov/ (accessed on 19 August 2025) 69. Chou W.-C. Lin Z. Machine learning and artificial intelligence in physiologically based pharmacokinetic modeling Toxicol. Sci. 2023 191 1 14 10.1093/toxsci/kfac101 36156156 PMC9887681 70. Zhang M. Wu K. Long S. Jin X. Liu B. Prediction of pharmacokinetic/pharmacodynamic properties of aldosterone synthase inhibitors at drug discovery stage using an artificial intelligence-physiologically based pharmacokinetic model Front. Pharmacol. 2025 16 1578117 10.3389/fphar.2025.1578117 40356995 PMC12066422 Figure 1 Graph of total articles and relevant articles generated from PubMed using the search query (“artificial intelligence”) AND (PBPK OR “physiologically based pharmacokinetic”). ",
  "metadata": {
    "Title of this paper": "Prediction of pharmacokinetic/pharmacodynamic properties of aldosterone synthase inhibitors at drug discovery stage using an artificial intelligence-physiologically based pharmacokinetic model",
    "Journal it was published in:": "Pharmaceutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473325/"
  }
}