{
  "title": "Paper_929",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471109 PMC12471109.1 12471109 12471109 41010640 10.3390/jcm14186435 jcm-14-06435 1 Article Micropolyps, Plasma Cells, and Pregnancy: Reevaluating Diagnostic and Therapeutic Strategies in Chronic Endometritis Szafarowska Monika Conceptualization Methodology Software Validation Formal analysis Investigation Resources Data curation Writing – original draft Writing – review & editing Visualization Supervision Project administration Funding acquisition 1 Chirzyńska Martyna Methodology Formal analysis Investigation Data curation Writing – original draft 1 Kurlenko Karolina Methodology Formal analysis Investigation Data curation Writing – original draft 1 Biela Magdalena Validation Formal analysis Data curation Writing – original draft Writing – review & editing 1 Doniec Jacek Validation Resources Data curation Writing – review & editing 2 Łuszczyński Krzysztof Software Validation Formal analysis Writing – original draft Writing – review & editing Visualization 3 4 * https://orcid.org/0000-0003-0438-2678 Ścieżyńska Aneta Validation Formal analysis Writing – review & editing 3 4 Kamiński Paweł Validation Resources Data curation Writing – review & editing Supervision Funding acquisition 1 Revelli Alberto Academic Editor 1 mszafarowska@wim.mil.pl mchirzynska@wim.mil.pl kkurlenko@wim.mil.pl mbiela@wim.mil.pl pkaminski@wim.mil.pl 2 jdoniec@wim.mil.pl 3 aneta.sciezynska@wum.edu.pl 4 * kluszczynski@wim.mil.pl 12 9 2025 9 2025 14 18 497642 6435 12 7 2025 15 8 2025 08 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods: Results: p p p Conclusions: infertility diagnostic of chronic endometritis micropolyps endometrial biopsy hysteroscopy CD138 Military Institute of Medicine, Warsaw, Poland 609 The study was supported by the Statutory Grant No. 609 of the Military Institute of Medicine, Warsaw, Poland. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Chronic endometritis (CE) is a benign condition characterized by persistent, low-grade inflammation of the endometrial lining, typically accompanied by subtle histological changes and minimal or absent clinical symptoms [ 1 2 3 The pathogenesis of CE is multifactorial, typically involving intrauterine colonization by microorganisms such as Streptococcus Staphylococcus Escherichia coli Enterococcus faecalis Mycoplasma Ureaplasma 4 5 6 7 8 8 9 Figure 1 Despite the clinical significance of CE, the diagnostic process remains complex and challenging. Histologic identification of plasma cell infiltration using CD138 immunohistochemical staining is considered the gold diagnostic standard; however, there is an ongoing scientific debate regarding the optimal threshold for the definitive diagnosis [ 10 11 12 In recent years, in accordance with the International Working Group for Standardization of Chronic Endometritis Diagnosis recommendations, hysteroscopy has been recognized as a valuable diagnostic tool, offering direct visualization of characteristic endometrial abnormalities associated with CE such as micropolyps, focal or diffuse hyperemia, hemorrhagic spots, and stromal edema [ 13 14 15 16 17 According to the literature, the gold standard for diagnosing chronic endometritis is hysteroscopic biopsy of the endometrium performed during the follicular phase of the menstrual cycle followed by histopathological analysis and confirmation of plasma cell infiltration [ 18 19 20 21 22 23 10 Evidence suggests that CE may negatively impact reproductive outcomes by impairing endometrial receptivity [ 21 2 24 25 26 27 28 29 30 The aim of this study was to evaluate the diagnostic concordance between hysteroscopic findings and histopathological confirmation of CE in infertile women, and to assess the impact of CE and its treatment on subsequent pregnancy outcomes, with particular attention to the effect of perioperative antibiotic prophylaxis. 2. Materials and Methods 2.1. General Description of the Study A retrospective study was conducted at the Department of Gynecology and Gynecological Oncology of the Military Institute of Medicine—National Research Institute in Warsaw. The study adhered to the principles outlined in the Declaration of Helsinki and received approval from the institutional Ethics Committee (approval no. 14/23). All participants were thoroughly informed about the study’s objectives, the intended use of their data, and the measures taken to ensure anonymity. Written informed consent was obtained from each participant. The research was supported by Statutory Grant No. 609 of the Military Institute of Medicine—National Research Institute, Warsaw, Poland. 2.2. The Patient Recruitment Process A total of 136 infertile women aged 30 to 44 years, who underwent hysteroscopy at our clinic between 2022 and 2023 as part of their infertility evaluation, were enrolled in the study. All met the inclusion criteria and did not fulfill any of the exclusion criteria. The primary inclusion criteria were failed attempts to conceive for at least 12 months and an appropriate period of the menstrual cycle, defined as days 5 to 12 of the cycle. Exclusion criteria included uterine cavity diseases (endometrial polyps, submucosal myomas, intrauterine adhesions) or structural abnormalities (septate or didelphys uterus), as determined by transvaginal ultrasonography or hysteroscopy. Women who used oral contraception within three months of surgery or had known treatable reasons of reproductive failure were also excluded from the final analysis. No additional parameters, such as body weight, age, or comorbidities, were used to exclude participants from the research. Clinical data was gathered from medical records and responses to a standardized follow-up questionnaire. 2.3. Hysteroscopic Diagnosis and Sample Collection for Histological Analysis In accordance with the standard infertility diagnostic protocol of our clinic, all patients underwent outpatient diagnostic minihysteroscopy. The procedures were performed using the vaginoscopic approach, as described by Prof. S. Bettocchi, without the use of analgesia or anesthesia [ 31 During hysteroscopy, the cervical canal and uterine cavity were carefully assessed. The endometrium was evaluated for the presence of chronic endometritis in accordance with the International Working Group for Standardization of Chronic Endometritis Diagnosis. The presence of a strawberry-like aspect of the endometrial lining, focal hyperemia, hemorrhagic spots, micropolyposis, or stromal edema was considered characteristic of CE [ 5 32 Histological analysis assessed the presence of plasma cells using CD138 immunohistochemical staining. Chronic endometritis was diagnosed based on the identification of ≥5 CD138-positive plasma cells in 10 high-power fields (HPF) [ 10 On average, twelve months after the procedure, patients were asked to complete a follow-up questionnaire. The survey, developed and validated by the authors, included straightforward questions regarding the patients’ subjective experiences with outpatient hysteroscopy and their pregnancy outcomes. A graphical representation of the research methodology is shown in Figure 2 2.4. Data Collection and Statistical Analysis Collected data were analyzed using descriptive statistical methods. Categorical variables were presented as frequencies and percentages, while continuous variables were summarized using the mean, standard deviation (SD), and range (min-max) for normally distributed data, and the median, interquartile range (IQR), and range for non-normally distributed data. The Shapiro–Wilk test was employed to assess the normality of distributions [ 33 34 35 t 36 37 p 38 39 Sensitivity, specificity, positive predictive value (PPV), and negative predictive value (NPV) were calculated from 2 × 2 contingency tables, comparing hysteroscopic findings with histopathological diagnosis of CE. Sensitivity was the proportion of histologically confirmed CE cases with positive hysteroscopic findings; specificity, the proportion of non-CE cases with negative hysteroscopic findings. PPV and NPV were defined accordingly. Calculations followed the definitions and interpretation principles described by Glas et al. [ 40 41 3. Results 3.1. Characteristics of the Study Population Clinical and demographic characteristics of the study cohort, as well as the indications for hysteroscopic evaluation extracted from the medical records, are summarized in Table 1 Table 2 3.2. Hysteroscopic Evaluation of the Study Population During hysteroscopy performed in the cohort of infertile women participating in the study, a normal endometrial appearance was confirmed in 69% of women ( n n n 3.3. Histopathologic Analysis of the Acquired Endometrial Biopsy Samples The histopathological analysis of endometrial biopsy specimens was normal in all patients. No cases of endometrial cancer, endometrial hyperplasia, polyps, or other histologic abnormalities were detected. As previously stated, the diagnosis of chronic endometritis was established when ≥5 plasma cells were identified in 10 HPFs; therefore, chronic endometritis, determined by immunohistochemical staining for CD138-positive plasma cells, was confirmed in 29.2% of women ( n 3.4. Correlation of the Hysteroscopic Features with the Histopathologic Reports in the Diagnostic Process of Chronic Endometritis The analysis revealed that, despite a normal endometrial appearance on hysteroscopic examination, histopathologically confirmed chronic endometritis was present in 21% of women ( n n n p Table 3 Following the initial data analysis, hysteroscopic markers were evaluated to determine the predictive value of hysteroscopic visualization in the diagnostic process of CE. Among women with histopathologically confirmed CE, hysteroscopic features characteristic of the condition were detected in 50% of patients during examination. Based on the collected data, the sensitivity, specificity, positive predictive value (PPV), and negative predictive value (NPV) of the hysteroscopic image of the endometrium in the diagnosis of CE were subsequently calculated. The results are presented in Table 4 3.5. The Comparison Between Hysteroscopic and Histopathologic Assessment of Endometrium During Chronic Endometritis Diagnosis as a Predictor of Pregnancy Success On average, twelve months following the hysteroscopy, participants were asked to complete a questionnaire regarding their subjective experiences with the procedure as well as pregnancy outcomes. The survey was conducted among all patients; however, responses regarding pregnancy outcomes were received from only 60 women. Data analysis showed that pregnancy was achieved in 42% ( n n n n n Table 5 Table 6 Furthermore, no statistically significant correlation was observed between specific hysteroscopic features, such as micropolyps or endometrial hyperemia, and the pregnancy rate. The results are presented in Table 6 In the next step of the analysis the endometrium histopathologic examination results were correlated with the pregnancy success. The analysis revealed that among women with histopathologically diagnosed chronic endometritis ( n n n n Table 7 Among women with primary infertility ( n n n n p Table 8 As intrauterine colonization by microorganisms is regarded as one of the main causes of chronic endometritis, we investigated whether perioperative azithromycin prophylaxis affected the pregnancy rate. Based on follow-up survey responses, 70.3% of women ( n Table 9 n n n Complementary to the collection of clinical data, the follow-up survey assessed patient satisfaction with hysteroscopy. Based on the participants’ responses, 82.8% ( n Table 10 4. Discussion The presence of chronic endometritis (CE) in infertile women remains a diagnostic and therapeutic challenge. In our study, plasma cells detected by CD138 immunohistochemical staining were present in 29.2% of women, which is within the range reported in previous studies. Consistent with the findings of Cicinelli et al. [ 42 p However, in contrast to the results reported by Cicinelli et al. [ 42 43 44 45 In our analysis, the overall diagnostic performance of hysteroscopy showed a sensitivity of 50.0% and specificity of 76.8%, with a PPV of 47.1% and NPV of 78.8%. The relatively high specificity and NPV indicate that a normal hysteroscopic image substantially reduces the likelihood of CE, suggesting a potential role for hysteroscopy in ruling out the condition in infertile patients. However, the moderate sensitivity implies that approximately half of histologically confirmed cases may be missed based solely on hysteroscopic appearance, limiting the value of hysteroscopy as a standalone diagnostic tool. As highlighted by Steinberg et al. [ 46 With respect to reproductive outcomes, we observed no statistically significant association between hysteroscopic features of CE and the likelihood of achieving pregnancy. However, analysis by infertility type revealed that women with secondary infertility had significantly higher pregnancy rates following diagnostic hysteroscopy compared with those with primary infertility, regardless of CE status. Specifically, pregnancy was achieved in 54% of women with secondary infertility versus 24% of those with primary infertility ( p 21 Finally, given that intrauterine colonization by microorganisms is considered one of the most important etiological factors in CE [ 18 p 18 47 p p 2 48 Slightly different findings were reported by Qingyan Zhang et al., who analyzed their data to determine whether patients with antibiotic-cured chronic endometritis (CCE) had comparable pregnancy outcomes to those with non-chronic endometritis (NCE). The results revealed that the rate of early pregnancy loss was significantly higher in the CCE group, despite successful treatment, compared to the NCE group—21.2% vs. 14.2%. Based on these findings, authors proposed that in this group of women, the underlying cause of reproductive failure may be unrelated to chronic endometritis and instead caused by other factors [ 49 50 5. Conclusions In our study, histopathological analysis confirmed chronic endometritis (CE) in nearly one-third of infertile women, despite a normal hysteroscopic appearance in a substantial proportion of cases. The strongest diagnostic correlation was observed with the presence of micropolyps during hysteroscopy; however, the sensitivity of hysteroscopic assessment alone was limited. These findings indicate the necessity of combining hysteroscopic evaluation with targeted endometrial biopsy and CD138 immunohistochemical staining to improve diagnostic accuracy. Although no statistically significant association was found between CE and pregnancy rates, women with secondary infertility had significantly higher post-hysteroscopic pregnancy rates compared to those with primary infertility. Additionally, single-dose azithromycin prophylaxis following diagnostic hysteroscopy was associated with a statistically significant improvement in conception rates. The study’s limitations include its retrospective design, single-center setting, limited follow-up period, and partial reliance on questionnaire-based data, which may introduce recall bias. Further prospective, controlled studies are needed to validate these results and to develop standardized diagnostic and therapeutic protocols for CE in infertility management. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.S.; Methodology, M.S., M.C. and K.K.; Software, M.S. and K.Ł.; Validation, M.S., M.B., J.D., P.K., K.Ł. and A.Ś.; Formal Analysis, M.S., M.C., K.K., M.B., K.Ł. and A.Ś.; Investigation, M.S., M.C. and K.K.; Resources, M.S., P.K. and J.D.; Data Curation, M.S., M.C., K.K., M.B., J.D. and P.K.; Writing—Original Draft Preparation, M.S., M.C., K.K., M.B. and K.Ł.; Writing—Review and Editing, M.S., M.B., J.D., K.Ł., A.Ś. and P.K.; Visualization, M.S. and K.Ł.; Supervision, M.S. and P.K.; Project Administration, M.S.; Funding Acquisition, M.S. and P.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted according to the guidelines of the Declaration of Helsinki and approved by the Institutional Ethics Committee of Military Institute of Medicine, Warsaw, Poland (Approval no. 14/23, date of approval: 26 May 2023) Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement All relevant data are included within the manuscript. The raw data are available on request from the main author. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: CE Chronic Endometritis RIF Recurrent Implantation Failure RPL Recurrent Pregnancy Loss HPF High Power Fields SD Standard Deviation IQR Interquartile Range CI Confidence Intervals PPV Positive Predictive Value NPV Negative Predictive Value IISE Inflammatory State of the Endometrium CCE Cured Chronic Endometritis NCE Non-Chronic Endometritis VAS Visual Analogue Scale References 1. Puente E. Alonso L. Lagana A.S. Ghezzi F. Casarin J. Carugno J. Chronic Endometritis: Old Problem, Novel Insights and Future Challenges Int. J. Fertil. Steril. 2020 13 250 256 10.22074/ijfs.2020.5779 31710184 PMC6875860 2. Cicinelli E. Matteo M. Tinelli R. Lepera A. Alfonso R. Indraccolo U. Marrocchella S. Greco P. Resta L. Prevalence of chronic endometritis in repeated unexplained implantation failure and the IVF success rate after antibiotic therapy Hum. Reprod. 2015 30 323 330 10.1093/humrep/deu292 25385744 3. Lucan M. Sandor M. Bodog A. Mocuta D. Aur C.D. Sachelarie L. Huniadi A. Chronic Endometritis: A Silent Contributor to Infertility and Reproductive Failure—A Comprehensive Review Reprod. Med. 2025 6 14 10.3390/reprodmed6020014 4. Singh N. Sethi A. Endometritis—Diagnosis, Treatment and its impact on fertility—A Scoping Review JBRA Assist. Reprod. 2022 26 538 546 10.5935/1518-0557.20220015 35621273 PMC9355436 5. Kitaya K. Takeuchi T. Mizuta S. Matsubayashi H. Ishikawa T. Endometritis: New time, new concepts Fertil. Steril. 2018 110 344 350 10.1016/j.fertnstert.2018.04.012 29960704 6. Zhang H. Zou H. Zhang C. Zhang S. Chronic endometritis and the endometrial microbiota: Implications for reproductive success in patients with recurrent implantation failure Ann. Clin. Microbiol. Antimicrob. 2024 23 49 10.1186/s12941-024-00710-6 38816832 PMC11140900 7. Chen P. Chen P. Guo Y. Fang C. Li T. Interaction Between Chronic Endometritis Caused Endometrial Microbiota Disorder and Endometrial Immune Environment Change in Recurrent Implantation Failure Front. Immunol. 2021 12 748447 10.3389/fimmu.2021.748447 34671363 PMC8521098 8. Buzzaccarini G. Vitagliano A. Andrisani A. Santarsiero C.M. Cicinelli R. Nardelli C. Ambrosini G. Cicinelli E. Chronic endometritis and altered embryo implantation: A unified pathophysiological theory from a literature systematic review J. Assist. Reprod. Genet. 2020 37 2897 2911 10.1007/s10815-020-01955-8 33025403 PMC7714873 9. Sehring J. Beltsos A. Jeelani R. Human implantation: The complex interplay between endometrial receptivity, inflammation, and the microbiome Placenta 2022 117 179 186 10.1016/j.placenta.2021.12.015 34929458 10. Santoro A. Travaglino A. Inzani F. Angelico G. Raffone A. Maruotti G.M. Straccia P. Arciuolo D. Castri F. D’Alessandris N. The Role of Plasma Cells as a Marker of Chronic Endometritis: A Systematic Review and Meta-Analysis Biomedicines 2023 11 1714 10.3390/biomedicines11061714 37371809 PMC10296269 11. Li J. Wei J. Chen S. Wang X. Chen J. Zeng D. Fan L. Prevalence and risk factors for chronic endometritis in patients with adenomyosis and infertility: A retrospective cohort study BMC Womens Health 2024 24 403 10.1186/s12905-024-03245-2 39014375 PMC11251133 12. Achilles S.L. Amortegui A.J. Wiesenfeld H.C. Endometrial plasma cells: Do they indicate subclinical pelvic inflammatory disease? Sex. Transm. Dis. 2005 32 185 188 10.1097/01.olq.0000154491.47682.bf 15729157 13. Cicinelli E. Vitagliano A. Kumar A. Lasmar R.B. Bettocchi S. Haimovich S. International Working Group for Standardization of Chronic Endometritis D. Unified diagnostic criteria for chronic endometritis at fluid hysteroscopy: Proposal and reliability evaluation through an international randomized-controlled observer study Fertil. Steril. 2019 112 162 173.e2 10.1016/j.fertnstert.2019.03.004 31104760 14. Tatarchuk T.F. Herman D.G. Endometrial polyps and micropolyps. Microbial landscape of the uterine cavity and its role in their formation Reprod. Endocrinol. 2016 14 21 10.18370/2309-4117.2016.32.14-21 15. Matsas A. Stefanoudakis D. Kotsira G. Stavros S. Gkoufas S. Vrettou N. Christopoulou S. Christopoulos P. Advancements in Hysteroscopic Diagnosis and Management of Endometritis Diagnostics 2025 15 243 10.3390/diagnostics15030243 39941173 PMC11818009 16. Furui M. Ito A. Fukuda Y. Sekiguchi M. Nakaoka K. Hayashi Y. Tamaki Y. Katagiri Y. Nagao K. Nakata M. Endometrial congestion is the only hysteroscopic finding indicative of chronic endometritis PLoS ONE 2024 19 e0303041 10.1371/journal.pone.0303041 38935687 PMC11210814 17. Liu H. Song J. Zhang F. Li J. Kong W. Lv S. Zhang L. Yan L. A New Hysteroscopic Scoring System for Diagnosing Chronic Endometritis J. Minim. Invasive Gynecol. 2020 27 1127 1132 10.1016/j.jmig.2019.08.035 32240839 18. Li Y. Yu S. Liu W. Chen Y. Yang X. Wu J. Xu M. You G. Lian R. Huang C. The effect of the number of endometrial CD138+ cells on the pregnancy outcomes of infertile patients in the proliferative phase Front. Endocrin. 2024 15 1437781 10.3389/fendo.2024.1437781 PMC11794120 39911232 19. Riemma G. Parry J.P. De Franciscis P. Carugno J. Lettieri D. Cobellis L. Vitagliano A. Etrusco A. Lin L.T. Angioni S. Hysteroscopic criteria for the diagnosis of chronic endometritis: A systematic review and diagnostic test accuracy meta-analysis Am. J. Obstet. Gynecol. 2025 233 12 24.e4 10.1016/j.ajog.2025.03.005 40073921 20. Ughade P.A. Shrivastava D. Unveiling the Role of Endometrial CD-138: A Comprehensive Review on Its Significance in Infertility and Early Pregnancy Cureus 2024 16 e54782 10.7759/cureus.54782 38529432 PMC10961243 21. Liu Y. Chen X. Huang J. Wang C.C. Yu M.Y. Laird S. Li T.C. Comparison of the prevalence of chronic endometritis as determined by means of different diagnostic methods in women with and without reproductive failure Fertil. Steril. 2018 109 832 839 10.1016/j.fertnstert.2018.01.022 29778382 22. Nomiyama M. Yamasaki F. Tokunaga M. Ohbuchi Y. Sago N. Arima K. Nishiyama W. Hashiguchi M. Kojima K. Endometrial polyps with increased plasma cells are associated with chronic endometritis in infertility patients: Hysteroscopic findings and post-polypectomy pregnancy rates Reprod. Med. Biol. 2021 20 494 504 10.1002/rmb2.12394 34646078 PMC8499588 23. Hirata K. Kimura F. Nakamura A. Kitazawa J. Morimune A. Hanada T. Takebayashi A. Takashima A. Amano T. Tsuji S. Histological diagnostic criterion for chronic endometritis based on the clinical outcome BMC Womens Health 2021 21 94 10.1186/s12905-021-01239-y 33663485 PMC7934457 24. Ticconi C. Inversetti A. Marraffa S. Campagnolo L. Arthur J. Zambella E. Di Simone N. Chronic endometritis and recurrent reproductive failure: A systematic review and meta-analysis Front. Immunol. 2024 15 1427454 10.3389/fimmu.2024.1427454 39286255 PMC11403846 25. Zargar M. Ghafourian M. Nikbakht R. Mir Hosseini V. Moradi Choghakabodi P. Evaluating Chronic Endometritis in Women with Recurrent Implantation Failure and Recurrent Pregnancy Loss by Hysteroscopy and Immunohistochemistry J. Minim. Invasive Gynecol. 2020 27 116 121 10.1016/j.jmig.2019.02.016 30851430 26. Bouet P.E. El Hachem H. Monceau E. Gariepy G. Kadoch I.J. Sylvestre C. Chronic endometritis in women with recurrent pregnancy loss and recurrent implantation failure: Prevalence and role of office hysteroscopy and immunohistochemistry in diagnosis Fertil. Steril. 2016 105 106 110 10.1016/j.fertnstert.2015.09.025 26456229 27. Song D. Feng X. Zhang Q. Xia E. Xiao Y. Xie W. Li T.C. Prevalence and confounders of chronic endometritis in premenopausal women with abnormal bleeding or reproductive failure Reprod. Biomed. Online 2018 36 78 83 10.1016/j.rbmo.2017.09.008 29111313 28. Xie Q. Zhao C. Jiang W. Li X. Ni D. Chen Y. Li X. Hua X. Shen R. Ling X. Antibiotics improve reproductive outcomes after frozen-thaw embryo transfer for chronic endometritis treatment, especially in those with repeated implantation failure BMC Womens Health 2024 24 430 10.1186/s12905-024-03274-x 39068427 PMC11282813 29. Kato H. Yamagishi Y. Hagihara M. Hirai J. Asai N. Shibata Y. Iwamoto T. Mikamo H. Systematic review and meta-analysis for impacts of oral antibiotic treatment on pregnancy outcomes in chronic endometritis patients J. Infect. Chemother. 2022 28 610 615 10.1016/j.jiac.2022.01.001 35058127 30. Kuroda K. Yamanaka A. Takamizawa S. Nakao K. Kuribayashi Y. Nakagawa K. Nojiri S. Nishi H. Sugiyama R. Prevalence of and risk factors for chronic endometritis in patients with intrauterine disorders after hysteroscopic surgery Fertil. Steril. 2022 118 568 575 10.1016/j.fertnstert.2022.05.029 35718544 31. Bettocchi S. New Era of Office Hysteroscopy J. Am. Assoc. Gynecol. Laparosc. 1996 3 S4 10.1016/S1074-3804(96)80140-X 9074084 32. Petousis S. Angelou P. Almperis A. Lagana A.S. Titilas G. Margioula-Siarkou C. Dinas K. Prophylactic Antibiotics before Gynecologic Surgery: A Comprehensive Review of Guidelines J. Pers. Med. 2024 14 327 10.3390/jpm14030327 38541069 PMC10971452 33. Shapiro S.S. Wilk M.B. An Analysis of Variance Test for Normality (Complete Samples) Biometrika 1965 52 591 611 10.1093/biomet/52.3-4.591 34. Graham J.G.U. Fisher’s Exact Test J. R. Stat. Society Ser. A Stat. Soc. 1992 155 395 402 10.2307/2982890 35. Plackett R.L. Karl Pearson and the Chi-Squared Test Int. Stat. Rev. Rev. Int. Stat. 1983 51 59 72 10.2307/1402731 36. Student The Probable Error of a Mean Biometrika 1908 6 1 25 10.2307/2331554 37. Mann H.B. Whitney D.R. On a Test of Whether one of Two Random Variables is Stochastically Larger than the Other Ann. Math. Stat. 1947 18 50 60 10.1214/aoms/1177730491 38. Wald A. Sequential Tests of Statistical Hypotheses Ann. Math. Stat. 1945 16 117 186 10.1214/aoms/1177731118 39. RC Team R: A Language and Environment for Statistical Computing R Foundation for Statistical Computing Vienna, Austria 2022 40. Glas A.S. Lijmer J.G. Prins M.H. Bonsel G.J. Bossuyt P.M. The diagnostic odds ratio: A single indicator of test performance J. Clin. Epidemiol. 2003 56 1129 1135 10.1016/S0895-4356(03)00177-X 14615004 41. Stojanov D. Lazarova E. Veljkova E. Rubartelli P. Giacomini M. Predicting the outcome of heart failure against chronic-ischemic heart disease in elderly population—Machine learning approach based on logistic regression, case to Villa Scassi hospital Genoa, Italy J. King Saud Univ. Sci. 2023 35 102573 10.1016/j.jksus.2023.102573 42. Cicinelli E. Resta L. Nicoletti R. Zappimbulso V. Tartagni M. Saliani N. Endometrial micropolyps at fluid hysteroscopy suggest the existence of chronic endometritis Hum. Reprod. 2005 20 1386 1389 10.1093/humrep/deh779 15734762 43. Cuadrado-Torroglosa I. Garcia-Velasco J.A. Alecsandru D. The Impacts of Inflammatory and Autoimmune Conditions on the Endometrium and Reproductive Outcomes J. Clin. Med. 2024 13 3724 10.3390/jcm13133724 38999290 PMC11242609 44. Song D. Li T.C. Zhang Y. Feng X. Xia E. Huang X. Xiao Y. Correlation between hysteroscopy findings and chronic endometritis Fertil. Steril. 2019 111 772 779 10.1016/j.fertnstert.2018.12.007 30683588 45. Yasuo T. Kitaya K. Challenges in Clinical Diagnosis and Management of Chronic Endometritis Diagnostics 2022 12 2711 10.3390/diagnostics12112711 36359553 PMC9689541 46. Steinberg D.M. Fine J. Chappell R. Sample size for positive and negative predictive value in diagnostic research using case-control designs Biostatistics 2009 10 94 105 10.1093/biostatistics/kxn018 18556677 PMC3668447 47. Kitaya K. Matsubayashi H. Takaya Y. Nishiyama R. Yamaguchi K. Takeuchi T. Ishikawa T. Live birth rate following oral antibiotic treatment for chronic endometritis in infertile women with repeated implantation failure Am. J. Reprod. Immunol. 2017 78 e12719 10.1111/aji.12719 28608596 48. Cheng X. Huang Z. Xiao Z. Bai Y. Does antibiotic therapy for chronic endometritis improve clinical outcomes of patients with recurrent implantation failure in subsequent IVF cycles? A systematic review and meta-analysis J. Assist. Reprod. Genet. 2022 39 1797 1813 10.1007/s10815-022-02558-1 35829835 PMC9428097 49. Zhang Q. Yang G. Tan J. Xiong Y. Xu Y. Xu Y. Gu F. Antibiotic cured chronic endometritis remains a risk factor for early pregnancy loss in the subsequent frozen euploid embryo transfer Reprod. Biomed. Online 2024 48 103611 10.1016/j.rbmo.2023.103611 38118232 50. Odendaal J. Black N. Bouliotis G. Guck J. Underwood M. Fisher J. Quenby S. Preconceptual administration of doxycycline in women with recurrent miscarriage and chronic endometritis: Protocol for the Chronic Endometritis and Recurrent Miscarriage (CERM) trial, a multicentre, double-blind, placebo-controlled, adaptive randomised trial with an embedded translational substudy BMJ Open 2023 13 e081470 10.1136/bmjopen-2023-081470 PMC10693855 38040426 Figure 1 The molecular pathomechanism of chronic-endometritis-caused infertility. Created in BioRender. Łuszczyński, K. (2026). Figure 2 Study design for the assessment of diagnostic hysteroscopic features and reproductive outcomes in patients with CE. Created in BioRender. Łuszczyński, K. (2026). jcm-14-06435-t001_Table 1 Table 1 Characteristics of the study population.  Age [Years]  Median [IQR] 36.0 [33.0, 39.2] Range 30–44  BMI [kg/m 2  Median [IQR] 22.38 [20.36, 25.62] Range 17.4–37.4  Comorbidities  Number of Patients (Percentage) Hypothyroidism 31 (22.1%) Insulin Resistance 24 (17.1%) Endometriosis 14 (10%) Hyperprolactinemia 13 (9.3%) Polycystic Ovary Syndrome 7 (5%) Other Disorders: Asthma, 47 (34%) jcm-14-06435-t002_Table 2 Table 2 Medical indications for hysteroscopy.  Characteristics of the Group  Number of Patients (Percentage) Total Number of Patients 136  Indications for Hysteroscopy  Primary Infertility 67 (49.3%) Secondary Infertility 69 (50.7%) jcm-14-06435-t003_Table 3 Table 3 The comparison of the results acquired from hysteroscopic and histopathologic analysis in the diagnostic process of CE.  Chronic Endometritis Diagnosis in Histopathology  Characteristics of the Group  Number of Patients (Percentage) Total number of patients 136 CD 138 < 5/10HPF 96 (69.8%) CD 138 ≥ 5/10HPF 40 (29.2%)  Endometrium in Hysteroscopy  Characteristic  Number of Patients (Percentage) Total Number of Patients 136 Normal Endometrium 94 (69%) Micropolyps 29 (21.3%) Endometrial Hyperemia 13 (9.7%) Stromal Edema 0 (0%) Hemorrhagic Spots 0 (0%)  Correlation between Histopathology and Hysteroscopy  Total Number of Patients 136   Total  CD 138 < 5/10HPF  CD 138 ≥ 5/10HPF Normal Endometrium 94 74 20 CE Suggestive Features 42 22 20  Correlation between Histopathology and Hysteroscopic Features  Endometrium Presence  CD 138 < 5/10HPF  CD 138 ≥ 5/10HPF  p  1 Total 96 40  Normal Endometrium 74 (77.0%) 20 (50.0%) - Micropolyps 11 (11.5%) 18 (45.0%) <0.0001 Endometrial Hyperemia 11 (11.5%) 2 (5.0%) NS Stromal Edema 0 (0%) 0 (0%) - Hemorrhagic Spots 0 (0%) 0 (0%) - 1 p jcm-14-06435-t004_Table 4 Table 4 The predictive value of the hysteroscopic image in the diagnostic process of CE.  Parameter  Value [%] Sensitivity 50.0 Specificity 76.8 Positive Predictive Value 47.1 Negative Predictive Value 78.8 jcm-14-06435-t005_Table 5 Table 5 Pregnancy outcomes following the procedure of outpatient hysteroscopy.  Pregnancy Outcomes Following Hysteroscopy  Characteristics  Number of Patients (Percentage) Total Number of Patients 60 Pregnant 25 (42%) Not Pregnant 35 (58%)  Correlation between Hysteroscopic Findings and Pregnancy Outcomes  Endometrium Image in Hysteroscopy  Total  Pregnant  Not Pregnant   p -value 1 Normal Endometrium 42 19 23 - CE Suggestive Features 18 6 12 NS 1 p jcm-14-06435-t006_Table 6 Table 6 The correlation between hysteroscopic markers of chronic endometritis and pregnancy rate.  Endometrium Image in Hysteroscopy  OR 1  95%CI 2   p -Value 3 Normal Endometrium - -  Micropolyps 0.692 0.161–2.65 0.598 Endometrial Hyperemia 0.484 0.064–2.53 0.416 1 2 3 p jcm-14-06435-t007_Table 7 Table 7 The correlation between histopathologically confirmed chronic endometritis and pregnancy outcomes.  Correlation Between Histopathologic Findings and Pregnancy Outcomes  Histopathologic Finding  Total  Pregnant  Not Pregnant   p -Value 1 Normal Endometrium 40 16 24 - Diagnosed CE 20 9 11 NS 1 p jcm-14-06435-t008_Table 8 Table 8 The correlation between the type of infertility and pregnancy rate after hysteroscopy.   Primary Infertility  Secondary Infertility   p -Value 1  Number of Patients 25 35  Positive Pregnancy Outcome 6 (24%) 19 (54%) 0.022 Negative Pregnancy Outcome 19 (76%) 16 (46%) - 1 p jcm-14-06435-t009_Table 9 Table 9 The influence of post-hysteroscopy antibiotic prophylaxis on the likelihood of pregnancy.  Characteristics of the Groups  Total Number of Patients  64   With Prophylaxis  Without Prophylaxis  Number of Patients 45 19 Positive Pregnancy Outcome 24 (53%) 4 (21%) Negative Pregnancy Outcome 21 (47%) 15 (79%)  Antibiotic Prophylaxis Influence on Pregnancy Likelihood  Antibiotic Prophylaxis  OR 1  95%CI 2  p 3 Without Prophylaxis - -  With Prophylaxis 4.29 1.32–16.9 0.022 1 2 3 p jcm-14-06435-t010_Table 10 Table 10 The patients’ satisfaction following the procedure of outpatient hysteroscopy.  Patient Satisfaction Following Hysteroscopy  Group Characteristic  Number of Patients Total Number of Patients 64 Positive Procedure Evaluation 53 (82.8%) Negative Procedure Evaluation 11 (17.2%)  Pain Intensity Reported During the Procedure (VAS) Median 4.5 IQR 1 [2.0–6.0] 1 ",
  "metadata": {
    "Title of this paper": "Preconceptual administration of doxycycline in women with recurrent miscarriage and chronic endometritis: Protocol for the Chronic Endometritis and Recurrent Miscarriage (CERM) trial, a multicentre, double-blind, placebo-controlled, adaptive randomised trial with an embedded translational substudy",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471109/"
  }
}