{
  "title": "Paper_959",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470599 PMC12470599.1 12470599 12470599 41009805 10.3390/ijms26189243 ijms-26-09243 1 Review Monoterpenes in Vascular Function: A Review of Bioactivity and Mechanisms of Action https://orcid.org/0000-0002-7107-132X Gonçalves Tays Almeida Arthur Pontes Larisse Oliveira Julio Feitosa Mathania https://orcid.org/0000-0003-0029-3352 Júnior Javanyr Veras Robson https://orcid.org/0000-0001-8783-4806 Medeiros Isac * Lymperopoulos Anastasios Academic Editor Department of Pharmaceutical Sciences, Federal University of Paraiba, João Pessoa 58059-900, PB, Brazil; taysamanda@ltf.ufpb.br arthur-jp@hotmail.com larisse.virgolino@ltf.ufpb.br juliopinheiro@ltf.ufpb.br mathania_rezende@hotmail.com javanyrjunior@ltf.ufpb.br robsonveras@ccs.ufpb.br * isac@ltf.ufpb.br 22 9 2025 9 2025 26 18 497349 9243 22 7 2025 19 8 2025 20 8 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Cardiovascular diseases are the primary cause of morbidity and mortality worldwide. The function and structure of blood vessels play a crucial role in the development and aggravation of these diseases. Natural products, such as aromatic plants, present a wide variety of terpenes content. Monoterpenes, a selected group of terpenes, have two building blocks of five-carbon isoprene (C 5 8 protective effect monoterpenes vascular health vascular disease vascular protection cardiovascular disease Coordenação de Aperfeiçoamento de Pessoal de Nível Superior-CAPES 1803735 Conselho Nacional de Desenvolvimento Científico e Tecnológico-CNPq 311711/2018-9 Fundação de Apoio à Pesquisa do Estado da Paraíba-FAPESQ This work was financially supported by Coordenação de Aperfeiçoamento de Pessoal de Nível Superior-CAPES (Grant number 1803735), Conselho Nacional de Desenvolvimento Científico e Tecnológico-CNPq (Grant number 311711/2018-9), and Fundação de Apoio à Pesquisa do Estado da Paraíba-FAPESQ. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Aromatic plants have been widely used for their medicinal properties over the centuries. Essential oils—formed mainly by terpene derivatives representing approximately 90%—are abundant volatile compounds in aromatic plants [ 1 10 16 2 3 4 1 5 6 It is worth noting that monoterpenes can be functionalized by the addition of functional groups (e.g., ether, ester, and epoxide) [ 7 8 9 Although the clinical development of many monoterpenes remains limited, the preclinical biochemical and pharmacological properties of many of these secondary metabolites have been extensively investigated, as highlighted in this review. In this review, we draft an overview of the most widely studied monoterpenes, including their sources, synthesis, biological effects, and advances in elucidating the molecular and physiological pathways to prevent/delay vascular pathologies. 2. Monoterpenes Chemistry: An Overview Terpene hydrocarbons have a molecular formula of (C 5 8 5 8 5 5 10 15 20 25 30 40 Monoterpene biosynthesis depends on two biochemically active isoprene units: isopentenyl diphosphate (IPP) and its dimethylallyl diphosphate isomer (DMAPP). The IPP and DMAPP are synthesized through the mevalonate pathway (MVA) or the 4-phosphate methylerythritol pathway (MEP), also known as 1-deoxy-d-xylulose 5-phosphate (DXP) [ 9 10 Figure 1 11 12 Monoterpenes are generally classified according to their carbon skeleton, types of cyclization, and oxidation state [ 4 Figure 2 13 In addition, based on the oxidation state and functional group diversity, monoterpenes can be classified into two subgroups: hydrocarbons and oxygenated monoterpenes. Hydrocarbon monoterpenes do not have oxygen in their structure and have an alkene hydrocarbon moiety. However, oxygenated monoterpenes may differ according to their functional group, such as hydroxyl groups (alcohols and phenols), carbonyl-containing groups (aldehydes, ketones, carboxylic acids, carboxylic esters, and lactones), and groups with oxygen bridges (ethers, peroxides, and furans) [ 4 14 3. Role of Monoterpenes on the Vascular Function Blood vessels are heterogeneous structures of three layers, including the intima, which comprises a single layer of endothelial cells—the media, predominantly of smooth muscle cells, and elastic fibers. Finally, the adventitia with fibroblasts, collagen fibers, and perivascular nerves [ 15 Under physiological conditions, the endothelium modulates the vasodilatory, thrombolytic, immune, and vasoprotective functions by synthesizing and releasing specific substances that act locally and systemically [ 16 The endothelium regulation of vascular tone evolves relaxation and contraction mechanisms in the underlying vascular smooth muscle. Thereby, endothelial cells secrete both vasodilator [nitric oxide (NO), prostacyclin, endothelium-derived hyperpolarizing factor] and vasoconstrictor substances (angiotensin II, endothelin-1, thromboxane A 2 17 The balance of such mechanisms is essential for ensuring proper maintenance of vascular tone and function. In contrast, pathological conditions lead to vasoactive factor-mediated response dysfunction. Thus, the vasoconstrictor, prothrombotic, and pro-inflammatory state is favored, leading to vascular impairment [ 18 2 3 4 Figure 3 3.1. Effects of Monoterpenes on NO Signaling and Oxidative Stress NO, a short-lived gaseous molecule, is one of the primary vasodilators generated by the endothelium [ 19 4 20 21 16 22 Monoterpenes mediate their effects, at least in part, by the modulation of NO synthesis, which involves eNOS activity. Recent findings demonstrated by experiments in the presence of L-NAME, an eNOS inhibitor, that monoterpene effects were abolished [ 23 24 25 26 27 28 29 Moreover, ROS can alter vascular function through changes in vascular tone, mainly by reducing the NO bioavailability, favoring the contractile state [ 18 20 30 31 32 3.2. Effects of Monoterpenes on K + Monoterpenes modulate K + + + v 33 23 Ca Ca Ca Ca 34 Moreover, recent findings suggest that K Ca Ca 35 36 22 37 Ca Ca 34 3.3. Effects of Monoterpenes on TRP Channels and Ca 2+ Monoterpene activates the vanilloid receptor TRPV3 [ 38 2+ 39 38 2+ 39 2+ 2+ + Ca Ca 40 41 Ca Ca 2+ 40 Furthermore, TRPs regulate vascular tone by mediating responses by modulating critical pathways in SMC [ 42 43 44 Dantas and collaborators demonstrated that in the presence of magnesium at a concentration of 2.5 mM, which inhibits TRPM7 activity, the TRPM7 channel participates in the relaxant response [ 43 44 A key target in regulating vascular tone is calcium ion signaling in VSMC [ 45 v In addition, TRPC1 is a molecular component of Store-operated calcium entry (SOCE), a mechanism for Ca 2+ 2+ 46 2+ v 2 43 Furthermore, in the presence of KCl, a reduction in contractile force and intracellular calcium concentration was observed [ 47 2 48 v 34 43 49 50 v 4. Beneficial Effects of Monoterpenes on Vasculature Monoterpenes and their derivatives are promising molecules as new therapeutic agents, especially in cardiovascular diseases [ 3 6 Table 1 4.1. Geraniol Geraniol is a monoterpene alcohol isolated from aromatic plants, including Cinnamomum tenuifolium Valeriana officinalis 2 77 78 Vascular complications are a major cause of death associated with cardiovascular disease. In diabetes and metabolic syndrome, potentiation of the vasoconstrictor response and significant impairment of Ach-induced vasorelaxation are observed [ 79 80 81 82 Importantly, geraniol demonstrated the ability to reduce hypercontractility and improve ACh-mediated vasodilation in the aorta of diabetic rats or those with metabolic syndrome, indicating that it can improve vascular dysfunction. The mechanism of geraniol-mediated vasorelaxation was also evaluated in the aortas of diabetic rats and primarily involves the blockade of Cav1.2 and ROC calcium channels, highlighting a direct effect on vascular smooth muscle [ 51 Endothelial dysfunction is widely accepted as the first sign of atherosclerosis, a condition in which inflammation and oxidative stress play central roles in pathogenesis [ 83 68 68 Geraniol appears to exert effects by stimulating the synthesis of antioxidant factors. In HUVECs treated with OX-LDL, an in vitro model of atherosclerosis, geraniol activated the PI3K/AKT/NRF2 pathway, increasing HO-1 expression [ 52 Inflammation is also a key determinant in atherosclerotic plaque initiation and progression. Under atherogenic stimuli, endothelial cells express inflammatory cytokines (e.g., tumor necrosis factor-alpha (TNF-α), interleukin (IL)-8) and adhesion molecules (e.g., intercellular adhesion molecule-1 (ICAM-1), vascular adhesion molecule-1 (VCAM-1), E-selectin, P-selectin). These attract lymphocytes and monocytes that bind to the endothelium and infiltrate the arterial wall [ 84 In HUVECS treated with OX-LDL, geraniol inhibited the production of pro-inflammatory cytokines, including TNF-α, IL-6, and IL-1β, and suppressed the nuclear translocation and activity of NF-κB [ 52 85 Therefore, the findings indicate that geraniol’s endothelial protection primarily derives from its antioxidant and anti-inflammatory effects, holding particular clinical relevance for metabolic conditions associated with vascular dysfunction (diabetes, metabolic syndrome, atherosclerosis). However, the lack of human studies limits the extrapolation of these findings to therapeutic applications. 4.2. Carvacrol Carvacrol is a phenolic monoterpenoid found in essential oils of thyme ( Thymus vulgaris Origanum vulgare Lepidium flavum Bergamia Loise Citrus aurantium 86 87 88 27 43 89 Carvacrol has been shown to exert significant structural and functional effects on vascular function in diabetes [ 69 90 83 In an in vivo model of streptozotocin-induced diabetes, Liu and colleagues observed that carvacrol was able to reverse the pathological vascular remodeling of diabetes and inhibited vascular hypercontractility in aortic arteries. Furthermore, carvacrol treatment stimulated the activation of the PI3K/Akt signaling pathway in diabetic animals, which consequently increased NO production [ 69 The anti-inflammatory effects of carvacrol on diabetes were evaluated in C57BL/KsJ mice, a type 2 diabetes model with obesity, and in HUVECs exposed to high glucose concentrations. In this animal model of diabetes, carvacrol was also able to reverse the macrovascular complications associated with diabetes. These effects are associated with its potent anti-inflammatory action, which includes inhibition of the inflammatory transcription factor NF-κB pathway and consequent reduction in the production of pro-inflammatory cytokines such as TNF-α, IL-8, and IL-1β, both in vitro and in vivo studies [ 90 Hemodynamically, carvacrol has well documented hypotensive and vasodilatory properties, mediated primarily by blockade of Cav1.2 channels and modulation of TRP channels [ 43 33 Carvacrol also demonstrates a remarkable ability to improve endothelial function by modulating oxidative stress. In models of lead toxicity, the compound was able to restore endothelium-dependent vasorelaxation, a mechanism related to the reduction in ROS and increased NO bioavailability [ 31 Regarding the pathological endothelial dysfunction of arterial hypertension, carvacrol demonstrates additional therapeutic potential in the mobilization of endothelial progenitor cells (EPCs), promoting the reduction in oxidative stress and vascular repair. This effect is associated with improved EPC progenitor function, with reduced oxidative stress and cellular senescence [ 70 In summary, carvacrol exhibits vascular protective effects by targeting key pathological mechanisms in diabetes and hypertension, including oxidative stress, inflammation, endothelial dysfunction, and vascular remodeling. These effects position the compound as an attractive candidate for clinical trials to consolidate its therapeutic potential. 4.3. Citronellal Citronellal is a monoterpene extracted from the oils of Corymbia citriodora Cymbopogon nardus Cymbopogon citratus Cymbopogon winterianus 91 92 73 93 71 72 Experimental studies demonstrate that citronellal exerts marked antiatherosclerotic effects, reducing plaque size in animal models and significantly improving endothelial function. These effects were demonstrated in a high-fat diet model [ 71 73 94 + + 71 73 Recent studies have demonstrated an important role for the NHE1 exchanger in the development of atherosclerosis. This exchanger is hyperactivated in some pathophysiological conditions, leading to acidification of atherosclerotic lesions and increased endothelial cell apoptosis [ 95 Complementing this primary action, citronellal acts synergistically through the modulation of TRPM2 [ 73 96 73 In the streptozotocin-induced diabetes model, citronellal demonstrates a third mechanism via sphingosine 1-phosphate (S1P1) receptor activation [ 72 97 72 Despite the very positive effects of citronellal on vascular function, significant challenges remain for the clinical translation of these findings. Issues such as the possible difference in activity between the R and S enantiomers, the determination of optimal therapeutic windows, and validation in human models of cardiovascular disease require further investigation. 4.4. Citronellol Citronellol is found abundantly in plants of the genus Cymbopogon Citrus 98 99 100 55 Pharmacological studies demonstrate that citronellol exerts significant cardiovascular effects through several integrated mechanisms. Intravenous administration of citronellol induced a hypotensive response associated with reflex tachycardia [ 55 55 101 The benefits of citronellol also extend to protection against ischemic damage. In a stroke model (intraluminal middle cerebral artery occlusion/reperfusion (MCAO/R)), citronellol treatment significantly increased antioxidant enzymes such as SOD, CAT, and glutathione. Furthermore, levels of pro-inflammatory cytokines such as TNF-α, IL-1, and IL-6 were reduced, while anti-inflammatory cytokines such as IL-4 and IL-10 increased [ 102 Therefore, based on the studies conducted, citronellol reveals that its cardiovascular effects result from its direct action on vascular tone and its antioxidant and anti-inflammatory properties. However, further studies are needed to explore its role in vascular function and diseases associated with blood vessels. 4.5. Linalyl Acetate Linalyl acetate is a monoterpene present in several species of aromatic plants, such as the citrus genus Citrus bergamia risso Lavandula angustifolia Salvia sclarea 26 103 The vasorelaxant mechanism of linalyl acetate was evaluated in the carotid artery of white male rabbits. In arteries with functional endothelium, this monoterpene promoted a partial relaxing effect by stimulating the production of NO and activating sGC in the vascular smooth muscle. On the other hand, linalyl acetate induces activation of myosin light chain phosphatase (MLCP) [ 56 The beneficial effects of Linalyl acetate were observed in a hypertension model using the immobilization model combined with nicotine administration, an ischemic-hypertensive injury model. This model was used to mimic chronic stress associated with the use of nicotine, which was able to induce a significant increase in blood pressure and vascular dysfunction. In this model, Linalyl acetate was able to decrease blood pressure and demonstrated the ability to prevent endothelial damage, partially restoring eNOS protein levels and, consequently, increasing the production of NO [ 26 104 Linalyl acetate was also evaluated in the hypertension model associated with chronic obstructive pulmonary disease (COPD) (induced simultaneously by intranasal administration of porcine pancreatic elastase (PPE) and lipopolysaccharide (LPS), along with chronic exposure to nicotine stress and immobilization), characterized by significant blood pressure and increased serum LDH. In this condition, Linalyl acetate was able to reverse the increase in blood pressure and reduce biomarkers associated with vascular damage, such as inflammation and oxidative stress [ 105 In the context of diabetes mellitus, Linalyl acetate was evaluated in diabetic animals subjected to immobilization. This study used metformin as a positive control. Linalyl acetate treatment decreased plasma glucose concentration and improved ACh-induced vasorelaxation, similar to metformin. Interestingly, linalyl acetate increased the expression of eNOS and decreased the expression of NF-κB, improving endothelial function. These effects were superior to those of metformin treatment [ 106 26 105 4.6. Carvone Carvone is a monoterpene ketone present in the essential oil of plants such as Mentha Origanum Rosmarinus Thymus 74 107 108 109 110 111 32 Ischemic stroke arises predominantly from occlusion of the middle cerebral artery, triggering inflammation, microvascular dysfunction, and altered blood–brain barrier permeability that contribute to neuronal injury [ 112 74 In rat thoracic arteries, carvone also exerts a beneficial effect by mediating vasorelaxant responses. The mechanism responsible for this effect involves blocking calcium influx through Cav1.2 [ 32 113 4.7. α-Terpineol α-terpineol is an alcoholic monoterpene present in essential oils of plants such as Ravensara aromatica Melaleuca qinquenervia Croton sonderianus Eucalyptus 114 115 116 117 118 29 60 119 Vascular tone plays an important role in regulating blood pressure. Maintaining vascular tone depends on the control of VSMC contraction and can be modulated by various substances [ 120 Studies on the vasorelaxant activity of α-terpineol revealed that this monoterpene modulates vascular tone through two distinct mechanisms. Initially, it was demonstrated that vasorelaxation, at least in part, is mediated by the vascular endothelium, with activation of the NO/sGC/PKG signaling pathway leading to relaxation of VSMCs [ 29 121 2+ 60 Important effects have also been described regarding the regulation of blood pressure by α-terpineol. In normotensive rats, α-terpineol dose-dependently reduced mean arterial pressure (MAP), accompanied by reflex tachycardia [ 29 60 4.8. Linalool Linalool is an alcoholic monoterpene present in plants of the family Lamiaceae (genus Lavandula Lauraceae Cinnamomum Coriandrum 122 123 124 125 Similarly to other monoterpenes, linalool exerts multiple mechanisms on the regulation of vascular tone. The vasorelaxant effect of linalool was evaluated in the superior mesenteric artery, where it was shown to alter calcium mobilization in smooth muscle cells through Cav1.2 and IP3R, causing relaxation of VSMCs [ 61 + 28 The effects of linalool on the vasculature are reflected in blood pressure regulation. Intravenous bolus administration of linalool has been shown to induce hypotension and reflex tachycardia. This effect may be attributed in part to the activation of muscarinic receptors [ 61 In addition to its acute effects on vascular tone, linalool demonstrates antihypertensive and vascular remodeling properties. In the 2K1C hypertension model, treatment with linalool has been shown to reduce blood pressure through mechanisms related to increased NO bioavailability [ 61 5 It is important to highlight that various delivery systems are used to increase the specificity, potency, and reduce the toxicity of monoterpenes. Therefore, the antihypertensive activity of linalool was evaluated after complexing this monoterpene with β-cyclodextrin. In SHR, a 20-day treatment with linalool incorporated with β-cyclodextrin potentiated the antihypertensive effect and reduced it. Furthermore, it was observed that this preparation was able to reduce the Phe-induced increase in contractility and improve the NO pathway response in VSMC [ 75 8 4.9. Perillyl Alcohol First extracted from herbs of the genus Perilla, perillyl alcohol is a monoterpene found in the essential oils of various plants such as peppermint, spearmint, lavender, bergamot, lemongrass, thyme, and rosemary [ 126 127 128 129 130 63 131 Research demonstrates that perillyl alcohol exerts significant vasodilatory effects through mechanisms predominantly independent of the endothelium. In rat aortic arteries, perillyl alcohol showed greater pharmacological potency under conditions of depolarization induced by KCl or BayK-8644, suggesting a possible direct action on Ca v 63 132 Perillyl alcohol, similar to other monoterpenes, also exerts neuroprotective effects. Using a model of ischemia and reperfusion in the middle cerebral artery, pretreatment with perillyl alcohol reduced neurological damage and infarct volume. These benefits are associated with decreased lipid peroxidation and increased activity of SOD, GSH, and GPx, decreased levels of pro-inflammatory cytokines such as IL-1β, TNF-α, and IL-6, and reduced expression of COX-2, iNOS, and NF-κB. This demonstrates the crucial role of antioxidant and anti-inflammatory effects in neuroprotection induced by perillyl alcohol [ 128 Furthermore, perillyl alcohol modulates pulmonary hypertension (PAH). Studies in models of monocrotaline-induced pulmonary hypertension have demonstrated that three-week treatment reverses pulmonary artery vascular remodeling by inhibiting vascular cell apoptosis, restoring the Bax/Bcl-2 ratio, reducing oxidative stress by increasing antioxidant enzymes such as SOD, CAT, and GPx, and reducing inflammation by decreasing the pro-inflammatory cytokines TNF-α and IL-6 [ 131 4.10. Borneol Borneol is a monoterpenoid alcohol found in plants like Valeriana officianalis Matriaca chamomilla Lavandula officinalis 3 133 134 135 136 23 137 138 In the vasculature, borneol induces a relaxant effect in the thoracic aorta of rats in an endothelium-independent manner, modulating intracellular calcium concentration. The mechanism underlying borneol’s vasorelaxation likely involves Cav1.2 blockade, intracellular calcium mobilization, and activation of potassium channels [ 67 23 67 In contrast, Santos et al. demonstrated an endothelium-dependent vasorelaxant effect in the aorta of rats. The mechanism involves the production of NO and prostanoids, as demonstrated by experiments in the presence of L-NAME and indomethacin [ 23 Neuroprotective effects have been associated with borneol. Interestingly, in a model of cerebral ischemia, borneol increased the expression of HIF-α and VEGF, resulting in angiogenesis and protection of the blood–brain barrier. Therefore, these effects restore neuronal blood flow and lead to neuroprotection [ 134 5. Translational Challenges: Bioavailability, Clinical Evidence, and Safety Although monoterpenes demonstrate promising vascular effects in preclinical models, several translation barriers must be addressed before clinical application. One of the main concerns is bioavailability. Monoterpenes are often volatile and lipophilic, which favors transdermal and inhalation absorption but limits their oral absorption [ 139 140 139 140 141 142 To overcome challenges related to bioavailability, nanoformulations have been developed in recent years. Some studies have shown that the inclusion of β-cyclodextrin with monoterpenes can produce significant improvements in chemical and pharmacological properties. In particular, this approach significantly improves solubility, making the compounds more suitable for oral administration. These systems have demonstrated increased potency for monoterpenes, such as linalool [ 75 66 143 Another critical gap is the limited clinical evidence. Although monoterpenes like menthol, limonene, and carvacrol have been widely used in traditional medicine and food applications [ 4 Safety is a further concern, especially at high concentrations required for therapeutic effect. While many monoterpenes are classified as Generally Recognized as Safe (GRAS) for food use, chronic exposure, high-dose supplementation, or intravenous use may pose toxicity risks. Potential adverse effects include gastrointestinal discomfort, hepatotoxicity, or neurotoxicity, depending on the compound and route of administration [ 144 145 Overcoming these challenges requires the development of optimized delivery systems, such as nanoformulations or prodrugs, to enhance stability, target specificity, and therapeutic window [ 146 6. Study Limitations, Inconsistencies, and Gaps in Knowledge Monoterpenes exhibit broad vascular activity. However, some limitations need to be addressed to generate more robust data for clinical application. Most of the studies presented here rely heavily on rodent models. While these offer valuable mechanistic insights, significant physiological differences between rodents and humans pose challenges for clinical translation. Such differences include vascular architecture: mice have a relatively thin intimal layer, while humans have more complex layers [ 147 148 149 147 Furthermore, many vascular effects have been demonstrated at very low concentrations, raising concerns about the feasibility of achieving sufficient plasma levels to achieve pharmacological effects in humans through conventional administration routes due to bioavailability issues. Pharmacokinetic and toxicological data are thus urgently needed to determine therapeutic windows and systemic bioavailability. Second, discrepancies in the literature regarding the mechanisms of action of specific monoterpenes remain unresolved. Some compounds, such as linalool or carvacrol, exhibit endothelium-dependent relaxation in certain vascular beds while showing endothelium-independent effects in others [ 28 29 40 43 34 37 Finally, notable gaps in knowledge persist. The metabolism of monoterpenes remains poorly understood; most studies focus exclusively on the parent compounds, ignoring the potential role of active metabolites generated in vivo [ 150 44 63 151 152 153 154 155 156 157 35 36 42 Finally, despite their therapeutic potential, the long-term safety of monoterpenes remains unclear, with few studies evaluating cumulative toxicity or target organ effects after months of use. Furthermore, the lack of standardization in test concentrations, animal models, and administration routes compromises the robustness and reproducibility of results. These considerations highlight the importance of ongoing research to bridge preclinical findings and translational potential, ultimately guiding the development of safe and effective monoterpene-based therapies for vascular diseases. 7. Conclusions Terpenes correspond to 90% of essential oils, the largest group of secondary metabolites in aromatic plants. Monoterpenes, a selected group of terpenes, effectively control vascular tone, reduce oxidative stress, attenuate inflammation, vascular remodeling, and prevent pathophysiological conditions. Moreover, monoterpenes attracted the pharmaceutical industry’s interest due to their low synthesis costs. Therefore, understanding monoterpenes as promising molecules can lead to the development of new pharmacological tools to control the main vascular biological events in health and disease. In this review, we observed that monoterpenes citral, linalyl acetate, α-terpineol, eugenol, and borneol exert a biological effect on the vascular endothelium. The participation of the NO pathway is constant in the impact of monoterpenes that act on the vascular endothelium. On the other hand, the monoterpenes linalool, geraniol, citronellal, citronellol, α-terpineol, carvacrol, thymol, carveol, carvone, eugenol, menthol, terpinen-4-ol, limonene, rotundifolone, perillyl alcohol, α-pinene, and borneol exert an action on the vascular musculature, mainly with the participation of calcium channels (Cav) and TRPs. In this context, vasodilation has been achieved with significant efficiency without the specificity of the vascular bed. Regarding in vivo experiments, the most promising results were obtained with terpineol, carvacrol, linalyl acetate, and linalool, demonstrating a bradycardic and BP-lowering action. Another point that has been extensively investigated over the years has been antioxidant action. In this sense, it has been observed that most monoterpenes maintain this activity. Given the evidence presented, monoterpenes emerge as promising molecules with beneficial potential in modulating endothelial function. The diversity of molecular mechanisms involved—including activation of the nitric oxide pathway, modulation of ion channels, and antioxidant action—reinforces their pharmacological value. However, although preclinical studies indicate promising effects, there are still important gaps to be filled. Therefore, future studies should focus on the detailed elucidation of the specific molecular targets of monoterpenes that do not yet present their detailed mechanisms. In addition, the development of formulations that optimize their therapeutic efficacy and robust clinical trials that validate their translational application will be of great scientific value. Progress in this direction may consolidate monoterpenes as pharmacological agents for the treatment of conditions related to vascular dysfunction associated with oxidative stress and inflammation. Acknowledgments We apologize profusely to any authors whose important contributions were not cited in this review due to space limitations. The financial supports are from the Universidade Federal da Paraíba, the Fundação de Apoio à Pesquisa do Estado da Paraiba-Fapesq, and the Conselho Nacional de Desenvolvimento Científico e Tecnológico are gratefully acknowledged. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, I.M. and T.G.; writing—original draft preparation, T.G., A.A., L.P., J.O., M.F. and J.J.; writing—review and editing, R.V. and I.M.; visualization, R.V. and I.M.; project administration, I.M.; funding acquisition, I.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ACE Angiotensin converting enzyme Ach Acetylcholine AMPK AMP-activated protein kinase BH 4 Tetrahydrobiopterin cAMP Cyclic Adenosine Monophosphate CAT Catalase Ca v Voltage-gated calcium channels cGMP Cyclic guanosine monophosphate COX Cyclooxygenase DMAPP Dimethylallyl diphosphate DRP1 Dynamin-related protein 1 DXP 1-Deoxy-d-xylulose5-phosphate EDHF Endothelium-derived hyperpolarizing factors eNOS Endothelial nitric oxide synthase EPC Endothelial progenitor cell ET-1 Endothelin-1 G3P Glyceraldehyde-3-phosphate GMP Guanosine monophosphate GPP Geranyl diphosphate enzyme GPx Glutathione peroxidases GSH Glutathione reduced GTP Guanosine triphosphate HIF-α Hypoxia-inducible factor 1-alpha HO-1 Heme oxygenase-1 ICAM-1 Intercellular Adhesion Molecule 1 IL Interleukins INDO Indomethacin iNOS Induced nitric oxide synthase IP 3 Inositol 1,4,5-trisphosphate IP 3 Inositol 1,4,5-trisphosphate receptor IPP Isopentenyl diphosphate K Ca Calcium-activated potassium channels K Ca Ca Potassium channels activated by small calcium conductance K Ca Ca Potassium channels activated by intermediate calcium conductance Kir ATP-sensitive potassium channels K v Voltage-operated K + LDL Low-density lipoprotein L-Name Nitro-L-arginine methyl ester (NOS inhibitors) MAP Mean arterial pressure MAPK Mitogen-activated protein kinase MCT Monocrotaline MEP 4-phosphate methylerythritol MLCP Myosin light chain phosphatase MMP Matrix metallopeptidase MVA Mevalonate MW Molecular Weigh NADPH Nicotinamide adenine dinucleotide phosphate NF-κB Factor nuclear kappa B NHE1 Na + + NO Nitric oxide NQO1 Quinone oxidoreductase-1 Nrf-2 Nuclear factor 2 related to erythroid factor 2 PAH Pulmonary hypertension PDE Phosphodiesterase PI 3 Phosphatidylinositol 3-kinase PKC Protein kinase C PKG Cyclic GMP-dependent protein kinase ROC Receptor-operated calcium channels ROS Reactive oxygen species RyR Ryanodine receptor S1P1 Sphingosine-1-phosphate receptor subtype 1 sCG Soluble guanylyl cyclase SCI Spinal cord injury SERCA Sarcoendoplasmic reticulum calcium ATPase SMC Smooth muscle cells SOC Store-operated channels SOCE Store-operated calcium entry SOD Superoxide dismutase SR Sarcoplasmic reticulum STZ Streptozotocin TEA Tetraethylammonium chloride TLR4 Toll-like receptor 4 TNF-α Protein tumor necrosis α TPRM Transient receptor potential melastatin channel TPVR Total peripheric vascular resistance TRP Transient receptor potential TRPV Transient receptor potential vanilloid VCAM-1 Vascular Cell Adhesion Molecule 1 VEGF Vascular endothelial growth fator VSMC Vascular smooth muscle cells References 1. Silva E.A.P. Santos D.M. de Carvalho F.O. Menezes I.A.C. Barreto A.S. Souza D.S. Quintans-Júnior L.J. Santos M.R.V. Monoterpenes and their derivatives as agents for cardiovascular disease management: A systematic review and meta-analysis Phytomedicine 2021 88 153451 10.1016/j.phymed.2020.153451 33483251 2. Silva G. Marques J.N.J. Linhares E.P.M. Bonora C.M. Costa E.T. Saraiva M.F. Review of anticancer activity of monoterpenoids: Geraniol, nerol, geranial and neral Chem. Biol. Interact. 2022 362 109994 10.1016/j.cbi.2022.109994 35661738 3. Zielińska-Błajet M. Feder-Kubis J.J. Monoterpenes and their derivatives—Recent development in biological and medical applications Int. J. Mol. Sci. 2020 21 7078 10.3390/ijms21197078 32992914 PMC7582973 4. Dehsheikh A.B. Sourestani M.M. Dehsheikh P.B. Mottaghipisheh J. Vitalini S. Iriti M. Monoterpenes: Essential Oil Components with Valuable Features Mini Rev. Med. Chem. 2020 20 958 974 10.2174/1389557520666200122144703 31969098 5. Liang Y. Zhong Y. Li X. Xiao Y. Wu Y. Xie P. Biological evaluation of linalool on the function of blood vessels Mol. Med. Rep. 2021 24 874 10.3892/mmr.2021.12514 34713293 PMC8569525 6. de Andrade T.U. Brasil G.A. Endringer D.C. da Nobrega F.R. de Sousa D.P. Cardiovascular Activity of the Chemical Constituents of Essential Oils Molecules 2017 22 1539 10.3390/molecules22091539 28926969 PMC6151533 7. Zielińska-Blajet M. Pietrusiak P. Feder-Kubis J. Selected Monocyclic Monoterpenes and Their Derivatives as Effective Anticancer Therapeutic Agents Int. J. Mol. Sci. 2021 22 4763 10.3390/ijms22094763 33946245 PMC8124601 8. Kaspute G. Ivaskiene T. Ramanavicius A. Ramanavicius S. Prentice U. Terpenes and Essential Oils in Pharmaceutics: Applications as Therapeutic Agents and Penetration Enhancers with Advanced Delivery Systems for Improved Stability and Bioavailability Pharmaceutics 2025 17 793 10.3390/pharmaceutics17060793 40574105 PMC12197171 9. Henry L.K. Thomas S.T. Widhalm J.R. Lynch J.H. Davis T.C. Kessler S.A. Bohlmann J. Noel J.P. Dudareva N. Contribution of isopentenyl phosphate to plant terpenoid metabolism Nat. Plants 2018 4 721 729 10.1038/s41477-018-0220-z 30127411 10. Ward V.C.A. Chatzivasileiou A.O. Stephanopoulos G. Cell free biosynthesis of isoprenoids from isopentenol Biotechnol. Bioeng. 2019 116 3269 3281 10.1002/bit.27146 31429926 11. Yang L. Jiang L. Li W. Yang Y. Zhang G. Luo Y. A homomeric geranyl diphosphate synthase-encoding gene from Camptotheca acuminata and its combinatorial optimization for production of geraniol in Escherichia coli J. Ind. Microbiol. Biotechnol. 2017 44 1431 1441 10.1007/s10295-017-1967-3 28695386 12. Dewick P.M. The biosynthesis of C5–C25 terpenoid compounds Nat. Prod. Rep. 2002 19 181 222 10.1039/b002685i 12013278 13. Koparal A.T. Zeytinoglu M. Effects of Carvacrol on a Human Non-Small Cell Lung Cancer (NSCLC) Cell Line, A549 Cytotechnology 2003 43 149 154 10.1023/B:CYTO.0000039917.60348.45 19003220 PMC3449592 14. Mahato N. Sharma K. Koteswararao R. Sinha M. Baral E. Cho M.H. Citrus essential oils: Extraction, authentication and application in food preservation Crit. Rev. Food Sci. Nutr. 2019 59 611 625 10.1080/10408398.2017.1384716 28956626 15. Oak M.H. Auger C. Belcastro E. Park S.H. Lee H.H. Schini-Kerth V.B. Potential mechanisms underlying cardiovascular protection by polyphenols: Role of the endothelium Free. Radic. Biol. Med. 2018 122 161 170 10.1016/j.freeradbiomed.2018.03.018 29548794 16. Xu S. Ilyas I. Little P.J. Li H. Kamato D. Zheng X. Luo S. Li Z. Liu P. Han J. Endothelial Dysfunction in Atherosclerotic Cardiovascular Diseases and Beyond: From Mechanism to Pharmacotherapies Pharmacol. Rev. 2021 73 924 967 10.1124/pharmrev.120.000096 34088867 17. Vanhoutte P. Shimokawa H. Feletou M. Tang E. Endothelial dysfunction and vascular disease—A 30th anniversary update Acta Physiol. 2017 219 22 96 10.1111/apha.12646 26706498 18. de Almeida A.J.P.O. de Almeida Rezende M.S. Dantas S.H. de Lima Silva S. de Oliveira J.C.P.L. de Lourdes Assunção Araújo de Azevedo F. Alves R.M.F.R. de Menezes G.M.S. dos Santos P.F. Gonçalves T.A.F. Unveiling the Role of Inflammation and Oxidative Stress on Age-Related Cardiovascular Diseases Oxidative Med. Cell. Longev. 2020 8 1954398 10.1155/2020/1954398 32454933 PMC7232723 19. Pourbagher-Shahri A.M. Farkhondeh T. Talebi M. Kopustinskiene D.M. Samarghandian S. Bernatoniene J. An Overview of NO Signaling Pathways in Aging Molecules 2021 26 4533 10.3390/molecules26154533 34361685 PMC8348219 20. Gambardella J. Khondkar W. Morelli M.B. Wang X. Santulli G. Trimarco V. Arginine and Endothelial Function Biomedicines 2020 8 277 10.3390/biomedicines8080277 32781796 PMC7460461 21. Krüger-Genge A. Blocki A. Franke R.-P. Jung F. Vascular endothelial cell biology: An update Int. J. Mol. Sci. 2019 20 4411 10.3390/ijms20184411 31500313 PMC6769656 22. Golshiri K. Ataei Ataabadi E. Portilla Fernandez E.C. Jan Danser A. Roks A.J. The importance of the nitric oxide-cGMP pathway in age-related cardiovascular disease: Focus on phosphodiesterase-1 and soluble guanylate cyclase Basic Clin. Pharmacol. Toxicol. 2020 127 67 80 10.1111/bcpt.13319 31495057 23. Santos S.E. Ribeiro F. Menezes P.M.N. Duarte-Filho L.A.M. Quintans J.S.S. Quintans-Junior L.J. Silva F.S. Ribeiro L.A.A. New insights on relaxant effects of (-)-borneol monoterpene in rat aortic rings Fundam. Clin. Pharmacol. 2019 33 148 158 10.1111/fcp.12417 30240490 24. da Silva R.E.R. de Morais L.P. Silva A.A. Bastos C.M.S. Pereira-Goncalves A. Kerntopf M.R. Menezes I.R.A. Leal-Cardoso J.H. Barbosa R. Vasorelaxant effect of the Lippia alba essential oil and its major constituent, citral, on the contractility of isolated rat aorta Biomed. Pharmacother. 2018 108 792 798 10.1016/j.biopha.2018.09.073 30253371 25. Idris-Khodja N. Auger C. Koch E. Schini-Kerth V.B. Crataegus special extract WS((R))1442 prevents aging-related endothelial dysfunction Phytomedicine 2012 19 699 706 10.1016/j.phymed.2012.04.005 22621780 26. Hsieh Y.S. Kwon S. Lee H.S. Seol G.H. Linalyl acetate prevents hypertension-related ischemic injury PLoS ONE 2018 13 e0198082 10.1371/journal.pone.0198082 29799836 PMC5969747 27. Chen Y. Ba L. Huang W. Liu Y. Pan H. Mingyao E. Shi P. Wang Y. Li S. Qi H. Role of carvacrol in cardioprotection against myocardial ischemia/reperfusion injury in rats through activation of MAPK/ERK and Akt/eNOS signaling pathways Eur. J. Pharmacol. 2017 796 90 100 10.1016/j.ejphar.2016.11.053 27916558 28. Kang P. Seol G.H. Linalool elicits vasorelaxation of mouse aortae through activation of guanylyl cyclase and K+ channels J. Pharm. Pharmacol. 2015 67 714 719 10.1111/jphp.12359 25623816 29. Ribeiro T.P. Porto D.L. Menezes C.P. Antunes A.A. Silva D.F. De Sousa D.P. Nakao L.S. Braga V.A. Medeiros I.A. Unravelling the cardiovascular effects induced by α-terpineol: A role for the nitric oxide–cGMP pathway Clin. Exp. Pharmacol. Physiol. 2010 37 811 816 10.1111/j.1440-1681.2010.05383.x 20374260 30. Chen Q. Wang Q. Zhu J. Xiao Q. Zhang L. Reactive oxygen species: Key regulators in vascular health and diseases Br. J. Pharmacol. 2018 175 1279 1292 10.1111/bph.13828 28430357 PMC5867026 31. Shabir H. Kundu S. Basir S.F. Khan L.A. Modulation of Pb(II) caused aortal constriction by eugenol and carvacrol Biol. Trace Elem. Res. 2014 161 116 122 10.1007/s12011-014-0081-x 25065667 32. Kundu S. Shabir H. Basir S.F. Khan L.A. Inhibition of As(III) and Hg(II) caused aortic hypercontraction by eugenol, linalool and carvone J. Smooth Muscle Res. 2014 50 93 102 10.1540/jsmr.50.93 25891766 PMC5137271 33. Testai L. Chericoni S. Martelli A. Flamini G. Breschi M.C. Calderone V. Voltage-operated potassium (Kv) channels contribute to endothelium-dependent vasorelaxation of carvacrol on rat aorta J. Pharm. Pharmacol. 2016 68 1177 1183 10.1111/jphp.12585 27334686 34. Peixoto-Neves D. Wang Q. Leal-Cardoso J.H. Rossoni L.V. Jaggar J.H. Eugenol dilates mesenteric arteries and reduces systemic BP by activating endothelial cell TRPV4 channels Br. J. Pharmacol. 2015 172 3484 3494 10.1111/bph.13156 25832173 PMC4507154 35. Behringer E.J. Hakim M.A. Functional interaction among KCa and TRP channels for cardiovascular physiology: Modern perspectives on aging and chronic disease Int. J. Mol. Sci. 2019 20 1380 10.3390/ijms20061380 30893836 PMC6471369 36. Mathew John C. Khaddaj Mallat R. George G. Kim T. Mishra R.C. Braun A.P. Pharmacologic targeting of endothelial Ca 2+ + Channels 2018 12 126 136 10.1080/19336950.2018.1454814 29577810 PMC5972810 37. Goto K. Ohtsubo T. Kitazono T. Endothelium-dependent hyperpolarization (EDH) in hypertension: The role of endothelial ion channels Int. J. Mol. Sci. 2018 19 315 10.3390/ijms19010315 29361737 PMC5796258 38. Xu H. Delling M. Jun J.C. Clapham D.E. Oregano, thyme and clove-derived flavors and skin sensitizers activate specific TRP channels Nat. Neurosci. 2006 9 628 635 10.1038/nn1692 16617338 39. Thakore P. Earley S. Transient receptor potential channels and endothelial cell calcium signaling Compr. Physiol. 2019 9 1249 1277 10.1002/j.2040-4603.2019.tb00087.x 31187891 PMC6724529 40. Earley S. Gonzales A.L. Garcia Z.I. A dietary agonist of transient receptor potential cation channel V3 elicits endothelium-dependent vasodilation Mol. Pharmacol. 2010 77 612 620 10.1124/mol.109.060715 20086034 PMC2845943 41. Pires P.W. Sullivan M.N. Pritchard H.A. Robinson J.J. Earley S. Unitary TRPV3 channel Ca 2+ Am. J. Physiol.-Heart Circ. Physiol. 2015 309 H2031 H2041 10.1152/ajpheart.00140.2015 26453324 PMC4698420 42. Earley S. Brayden J.E. Transient receptor potential channels in the vasculature Physiol. Rev. 2015 95 645 690 10.1152/physrev.00026.2014 25834234 PMC4551213 43. Dantas B.P.V. Alves Q.L. de Assis K.S. Ribeiro T.P. de Almeida M.M. de Vasconcelos A.P. de Araújo D.A.M. de Andrade Braga V. de Medeiros I.A. Alencar J.L. Participation of the TRP channel in the cardiovascular effects induced by carvacrol in normotensive rat Vasc. Pharmacol. 2015 67 48 58 10.1016/j.vph.2015.02.016 25869504 44. Silva D.F. de Almeida M.M. Chaves C.G. Braz A.L. Gomes M.A. Pinho-da-Silva L. Pesquero J.L. Andrade V.A. Leite Mde F. de Albuquerque J.G. TRPM8 Channel Activation Induced by Monoterpenoid Rotundifolone Underlies Mesenteric Artery Relaxation PLoS ONE 2015 10 e0143171 10.1371/journal.pone.0143171 26599698 PMC4657920 45. Harraz O.F. Jensen L.J. Aging, calcium channel signaling and vascular tone Mech. Ageing Dev. 2020 191 111336 10.1016/j.mad.2020.111336 32918949 PMC8511598 46. Ambudkar I.S. de Souza L.B. Ong H.L. TRPC1, Orai1, and STIM1 in SOCE: Friends in tight spaces Cell Calcium 2017 63 33 39 10.1016/j.ceca.2016.12.009 28089266 PMC5466534 47. de Siqueira R.J. Ribeiro-Filho H.V. Freire R.S. Cosker F. Freire W.B. Vasconcelos-Silva A.A. Soares M.A. Lahlou S. Magalhaes P.J. (-)-alpha-Bisabolol inhibits preferentially electromechanical coupling on rat isolated arteries Vasc. Pharmacol. 2014 63 37 45 10.1016/j.vph.2014.06.006 25128618 48. Cheang W.S. Lam M.Y. Wong W.T. Tian X.Y. Lau C.W. Zhu Z. Yao X. Huang Y. Menthol relaxes rat aortae, mesenteric and coronary arteries by inhibiting calcium influx Eur. J. Pharmacol. 2013 702 79 84 10.1016/j.ejphar.2013.01.028 23380688 49. Alvarez-Collazo J. Alonso-Carbajo L. Lopez-Medina A.I. Alpizar Y.A. Tajada S. Nilius B. Voets T. Lopez-Lopez J.R. Talavera K. Perez-Garcia M.T. Cinnamaldehyde inhibits L-type calcium channels in mouse ventricular cardiomyocytes and vascular smooth muscle cells Pflug. Arch. Eur. J. Physiol. 2014 466 2089 2099 10.1007/s00424-014-1472-8 24563220 50. Melanaphy D. Johnson C.D. Kustov M.V. Watson C.A. Borysova L. Burdyga T.V. Zholos A.V. Ion channel mechanisms of rat tail artery contraction-relaxation by menthol involving, respectively, TRPM8 activation and L-type Ca 2+ Am. J. physiology. Heart Circ. Physiol. 2016 311 H1416 H1430 10.1152/ajpheart.00222.2015 PMC5206336 27765744 51. El-Bassossy H.M. Elberry A.A. Ghareib S.A. Geraniol improves the impaired vascular reactivity in diabetes and metabolic syndrome through calcium channel blocking effect J. Diabetes Its Complicat. 2016 30 1008 1016 10.1016/j.jdiacomp.2016.04.006 27131411 52. Ben Ammar R. Mohamed M.E. Alfwuaires M. Alamer S.A. Bani Ismail M. Veeraraghavan V.P. Sekar A.K. Ksouri R. Rajendran P. Anti-Inflammatory Activity of Geraniol Isolated from Lemon Grass on Ox-LDL-Stimulated Endothelial Cells by Upregulation of Heme Oxygenase-1 via PI3K/Akt and Nrf-2 Signaling Pathways Nutrients 2022 14 4817 Erratum in Nutrients 2024 16 10.3390/nu16050596 36432506 PMC9695721 53. Peixoto-Neves D. Silva-Alves K.S. Gomes M.D. Lima F.C. Lahlou S. Magalhaes P.J. Ceccatto V.M. Coelho-de-Souza A.N. Leal-Cardoso J.H. Vasorelaxant effects of the monoterpenic phenol isomers, carvacrol and thymol, on rat isolated aorta Fundam. Clin. Pharmacol. 2010 24 341 350 10.1111/j.1472-8206.2009.00768.x 19682086 54. Andrade F.C. Mota M.M. Barreto A.S. Sousa D.P. Quintans-Junior L.J. Santos M.R. Antihypertensive therapeutic potential of citronellal Lat. Am. J. Pharm. 2012 31 767 771 55. Bastos J.F. Moreira Í.J. Ribeiro T.P. Medeiros I.A. Antoniolli A.R. De Sousa D.P. Santos M.R. Hypotensive and vasorelaxant effects of citronellol, a monoterpene alcohol, in rats Basic Clin. Pharmacol. Toxicol. 2010 106 331 337 10.1111/j.1742-7843.2009.00492.x 20002067 56. Koto R. Imamura M. Watanabe C. Obayashi S. Shiraishi M. Sasaki Y. Azuma H. Linalyl acetate as a major ingredient of lavender essential oil relaxes the rabbit vascular smooth muscle through dephosphorylation of myosin light chain J. Cardiovasc. Pharmacol. 2006 48 850 856 10.1097/01.fjc.0000238589.00365.42 16891914 57. You J.H. Kang P. Min S.S. Seol G.H. Bergamot essential oil differentially modulates intracellular Ca 2+ J. Cardiovasc. Pharmacol. 2013 61 324 328 10.1097/FJC.0b013e3182834681 23288200 58. Devi R.C. Sim S.M. Ismail R. Effect of Cymbopogon citratus and Citral on Vascular Smooth Muscle of the Isolated Thoracic Rat Aorta Evid.-Based Complement. Altern. Med. eCAM 2012 2012 539475 10.1155/2012/539475 PMC3364612 22675383 59. Pereira S.L. Marques A.M. Sudo R.T. Kaplan M.A. Zapata-Sudo G. Vasodilator activity of the essential oil from aerial parts of Pectis brevipedunculata and its main constituent citral in rat aorta Molecules 2013 18 3072 3085 10.3390/molecules18033072 23470336 PMC6269927 60. Sabino C.K.B. Ferreira-Filho E.S. Mendes M.B. da Silva-Filho J.C. Ponte M.P.T.R. Moura L.H.P. Oliveira E.C.A. Quintans-Junior L.J. dos Santos M.R.V. de Cássia Meneses Oliveira R. Cardiovascular effects induced by α-terpineol in hypertensive rats Flavor Fragance J. 2013 28 333 339 10.1002/ffj.3159 61. Anjos P.J. Lima A.O. Cunha P.S. De Sousa D.P. Onofre A.S. Ribeiro T.P. Medeiros I.A. Antoniolli A.R. Quintans-Junior L.J. Santosa M.R. Cardiovascular effects induced by linalool in normotensive and hypertensive rats Z. Fur Naturforsch. C J. Biosciences 2013 68 181 190 10.1515/znc-2013-5-603 23923614 62. Silva M. Ribeiro F.P. Medeiros M.A. Sampaio P.A. Silva Y. Silva M.T. Quintans J.S. Quintans-Júnior L.J. Ribeiro L.A. The vasorelaxant effect of p-Cymene in rat aorta involves potassium channels Sci. World J. 2015 2015 458080 10.1155/2015/458080 PMC4312567 25667938 63. Cardoso-Teixeira A.C. Ferreira-da-Silva F.W. Peixoto-Neves D. Oliveira-Abreu K. Pereira-Goncalves A. Coelho-de-Souza A.N. Leal-Cardoso J.H. Hydroxyl Group and Vasorelaxant Effects of Perillyl Alcohol, Carveol, Limonene on Aorta Smooth Muscle of Rats Molecules 2018 23 1430 10.3390/molecules23061430 29899230 PMC6099955 64. Evaristo Rodrigues da Silva R. de Alencar Silva A. Pereira-de-Morais L. de Sousa Almeida N. Iriti M. Kerntopf M.R. Menezes I.R.A. Coutinho H.D.M. Barbosa R. Relaxant Effect of Monoterpene (-)-Carveol on Isolated Human Umbilical Cord Arteries and the Involvement of Ion Channels Molecules 2020 25 2681 10.3390/molecules25112681 32527034 PMC7321233 65. Unlu S. Mason C.D. Schachter M. Hughes A.D. Perillyl alcohol, an inhibitor of geranylgeranyl transferase, induces apoptosis of immortalized human vascular smooth muscle cells in vitro J. Cardiovasc. Pharmacol. 2000 35 341 344 10.1097/00005344-200002000-00025 10672871 66. Moreira I.J. Menezes P.P. Serafini M.R. Araujo A.A. Quintans-Junior L.J. Bonjardim L.R. Filho V.J. D B.P.J. Santos S.L. Junior W.L. Characterization and Antihypertensive Effect of the Complex of (-)-beta- pinene in beta-cyclodextrin Curr. Pharm. Biotechnol. 2016 17 837 845 10.2174/1389201017666160425115724 27109904 67. Silva-Filho J.C. Oliveira N.N. Arcanjo D.D. Quintans-Junior L.J. Cavalcanti S.C. Santos M.R. Oliveira Rde C. Oliveira A.P. Investigation of mechanisms involved in (-)-borneol-induced vasorelaxant response on rat thoracic aorta Basic Clin. Pharmacol. Toxicol. 2012 110 171 177 10.1111/j.1742-7843.2011.00784.x 21883938 68. Wang X. Zhao S. Su M. Sun L. Zhang S. Wang D. Liu Z. Yuan Y. Liu Y. Li Y. Geraniol improves endothelial function by inhibiting NOX-2 derived oxidative stress in high fat diet fed mice Biochem. Biophys. Res. Commun. 2016 474 182 187 10.1016/j.bbrc.2016.04.097 27107694 69. Liu Y. Wei J. Ma K.T. Li C.L. Mai Y.P. Qiu X.X. Wei H. Hou N. Luo J.D. Carvacrol protects against diabetes-induced hypercontractility in the aorta through activation of the PI3K/Akt pathway Biomed. Pharmacother. 2020 125 109825 10.1016/j.biopha.2020.109825 32036208 70. Goncalves T.A.F. Lima V.S. de Almeida A. de Arruda A.V. Veras A. Lima T.T. Soares E.M.C. Santos A.C.D. Vasconcelos M.E.C. de Almeida Feitosa M.S. Carvacrol Improves Vascular Function in Hypertensive Animals by Modulating Endothelial Progenitor Cells Nutrients 2023 15 3032 10.3390/nu15133032 37447358 PMC10346284 71. Lu J.X. Guo C. Ou W.S. Jing Y. Niu H.F. Song P. Li Q.Z. Liu Z. Xu J. Li P. Citronellal prevents endothelial dysfunction and atherosclerosis in rats J. Cell. Biochem. 2019 120 3790 3800 Erratum in J. Cell. Biochem. 2025 126 10.1002/jcb.27660 30367511 72. Qiu Y. Chao C.Y. Jiang L. Zhang J. Niu Q.Q. Guo Y.Q. Song Y.T. Li P. Zhu M.L. Yin Y.L. Citronellal alleviate macro- and micro-vascular damage in high fat diet/streptozotocin—Induced diabetic rats via a S1P/S1P1 dependent signaling pathway Eur. J. Pharmacol. 2022 920 174796 Erratum in Eur. J. Pharmacol. 2025 991 10.1016/j.ejphar.2022.174796 35151650 73. Yin Y.L. Wang H.H. Gui Z.C. Mi S. Guo S. Wang Y. Wang Q.Q. Yue R.Z. Lin L.B. Fan J.X. Citronellal Attenuates Oxidative Stress-Induced Mitochondrial Damage through TRPM2/NHE1 Pathway and Effectively Inhibits Endothelial Dysfunction in Type 2 Diabetes Mellitus Antioxidants 2022 11 2241 10.3390/antiox11112241 36421426 PMC9686689 74. Dai M. Wu L. Yu K. Xu R. Wei Y. Chinnathambi A. Alahmadi T.A. Zhou M. D-Carvone inhibit cerebral ischemia/reperfusion induced inflammatory response TLR4/NLRP3 signaling pathway Biomed. Pharmacother. 2020 132 110870 10.1016/j.biopha.2020.110870 33080468 75. Camargo S.B. Simoes L.O. Medeiros C.F.A. de Melo Jesus A. Fregoneze J.B. Evangelista A. Villarreal C.F. Araujo A.A.S. Quintans-Junior L.J. Silva D.F. Antihypertensive potential of linalool and linalool complexed with beta-cyclodextrin: Effects of subchronic treatment on blood pressure and vascular reactivity Biochem. Pharmacol. 2018 151 38 46 10.1016/j.bcp.2018.02.014 29454617 76. Lund A.K. Doyle-Eisele M. Lin Y.H. Arashiro M. Surratt J.D. Holmes T. Schilling K.A. Seinfeld J.H. Rohr A.C. Knipping E.M. The effects of alpha-pinene versus toluene-derived secondary organic aerosol exposure on the expression of markers associated with vascular disease Inhal. Toxicol. 2013 25 309 324 10.3109/08958378.2013.782080 23742109 77. AlAsmari A.F. Ali N. Alharbi M. Alqahtani F. Alasmari F. Almoqbel D. AlSwayyed M. Alshammari A. Alanazi M.M. Alhoshani A. Geraniol Ameliorates Doxorubicin-Mediated Kidney Injury through Alteration of Antioxidant Status, Inflammation, and Apoptosis: Potential Roles of NF-kappaB and Nrf2/HO-1 Nutrients 2022 14 1620 10.3390/nu14081620 35458182 PMC9031157 78. Lei Y. Fu P. Jun X. Cheng P. Pharmacological properties of geraniol—A review Planta Medica 2019 85 48 55 10.1055/a-0750-6907 30308694 79. Zhu B.H. Guan Y.Y. Min J. He H. Contractile responses of diabetic rat aorta to phenylephrine at different stages of diabetic duration Acta Pharmacol. Sin. 2001 22 445 449 11743894 80. Romero-Garcia T. Vazquez-Jimenez J.G. Sanchez-Hernandez R. Olivares-Reyes J.A. Rueda A. Insulin resistance, Ca 2+ Front. Physiol. 2025 16 1535153 10.3389/fphys.2025.1535153 40556956 PMC12185281 81. Soro-Paavonen A. Zhang W.Z. Venardos K. Coughlan M.T. Harris E. Tong D.C. Brasacchio D. Paavonen K. Chin-Dusting J. Cooper M.E. Advanced glycation end-products induce vascular dysfunction via resistance to nitric oxide and suppression of endothelial nitric oxide synthase J. Hypertens. 2010 28 780 788 10.1097/HJH.0b013e328335043e 20186099 82. Mukohda M. Okada M. Hara Y. Yamawaki H. Exploring mechanisms of diabetes-related macrovascular complications: Role of methylglyoxal, a metabolite of glucose on regulation of vascular contractility J. Pharmacol. Sci. 2012 118 303 310 10.1254/jphs.11R12CP 22333481 83. Medina-Leyte D.J. Zepeda-Garcia O. Dominguez-Perez M. Gonzalez-Garrido A. Villarreal-Molina T. Jacobo-Albavera L. Endothelial Dysfunction, Inflammation and Coronary Artery Disease: Potential Biomarkers and Promising Therapeutical Approaches Int. J. Mol. Sci. 2021 22 3850 10.3390/ijms22083850 33917744 PMC8068178 84. Zhu Y. Xian X. Wang Z. Bi Y. Chen Q. Han X. Tang D. Chen R. Research Progress on the Relationship between Atherosclerosis and Inflammation Biomolecules 2018 8 80 10.3390/biom8030080 30142970 PMC6163673 85. Wang J. Su B. Zhu H. Chen C. Zhao G. Protective effect of geraniol inhibits inflammatory response, oxidative stress and apoptosis in traumatic injury of the spinal cord through modulation of NF-kappaB and p38 MAPK Exp. Ther. Med. 2016 12 3607 3613 10.3892/etm.2016.3850 28105094 PMC5228434 86. Imran M. Aslam M. Alsagaby S.A. Saeed F. Ahmad I. Afzaal M. Arshad M.U. Abdelgawad M.A. El-Ghorab A.H. Khames A. Therapeutic application of carvacrol: A comprehensive review Food Sci. Nutr. 2022 10 3544 3561 10.1002/fsn3.2994 36348778 PMC9632228 87. Tohidi B. Rahimmalek M. Arzani A. Sabzalian M.R. Thymol, carvacrol, and antioxidant accumulation in Thymus species in response to different light spectra emitted by light-emitting diodes Food Chem. 2020 307 125521 10.1016/j.foodchem.2019.125521 31655264 88. Li Y. Xu J.Z. Gu C.X. Liu G.L. Tian K. Carvacrol suppresses inflammatory responses in rheumatoid arthritis fibroblast-like synoviocytes J. Cell. Biochem. 2018 120 8169 8176 10.1002/jcb.28098 30485517 89. Sadeghzadeh S. Hejazian S.H. Jamhiri M. Hafizibarjin Z. Sadeghzadeh S. Safari F. The effect of carvacrol on transcription levels of Bcl-2 family proteins in hypertrophied heart of rats J. Physiol. Pharmacol. 2018 22 54 62 90. Zhao W. Deng C. Han Q. Xu H. Chen Y. Carvacrol may alleviate vascular inflammation in diabetic db/db mice Int. J. Mol. Med. 2020 46 977 988 Erratum in Int. J. Mol. Med. 2023 52 10.3892/ijmm.2020.4654 32583003 PMC7388828 91. Ekpenyong C.E. Akpan E. Nyoh A. Ethnopharmacology, phytochemistry, and biological activities of Cymbopogon citratus (DC.) Stapf extracts Chin. J. Nat. Med. 2015 13 321 337 10.1016/S1875-5364(15)30023-6 25986281 92. Melo M.S. Guimaraes A.G. Santana M.F. Siqueira R.S. De Lima Ado C. Dias A.S. Santos M.R. Onofre A.S. Quintans J.S. De Sousa D.P. Anti-inflammatory and redox-protective activities of citronellal Biol. Res. 2011 44 363 368 10.4067/S0716-97602011000400008 22446600 93. Lu J.X. Qiu Y. Guo L.J. Song P. Xu J. Wan G.R. Wang S.X. Yin Y.L. Li P. Potential Therapeutic Effect of Citronellal on Diabetic Cardiomyopathy in Experimental Rats Evid.-Based Complement. Altern. Med. eCAM 2021 2021 9987531 10.1155/2021/9987531 34840590 PMC8612793 94. Guo Y. Que H. Chen B. Chao C. Li S. Guo S. Yin Y. Wang H. Zhu M. Li P. Citronellal improves endothelial dysfunction by affecting the stability of the GCH1 protein Acta Biochim. Et Biophys. Sin. 2024 56 963 972 10.3724/abbs.2024086 38993132 PMC11322867 95. Liu C.L. Zhang X. Liu J. Wang Y. Sukhova G.K. Wojtkiewicz G.R. Liu T. Tang R. Achilefu S. Nahrendorf M. Na + + Nat. Commun. 2019 10 3978 10.1038/s41467-019-11983-3 31484936 PMC6726618 96. Zielinska W. Zabrzynski J. Gagat M. Grzanka A. The Role of TRPM2 in Endothelial Function and Dysfunction Int. J. Mol. Sci. 2021 22 7635 10.3390/ijms22147635 34299254 PMC8307439 97. Allende M.L. Yamashita T. Proia R.L. G-protein-coupled receptor S1P1 acts within endothelial cells to regulate vascular maturation Blood 2003 102 3665 3667 10.1182/blood-2003-02-0460 12869509 98. Brito R.G. Dos Santos P.L. Quintans J.S. de Lucca Junior W. Araujo A.A. Saravanan S. Menezes I.R. Coutinho H.D. Quintans-Junior L.J. Citronellol, a natural acyclic monoterpene, attenuates mechanical hyperalgesia response in mice: Evidence of the spinal cord lamina I inhibition Chem.-Biol. Interact. 2015 239 111 117 10.1016/j.cbi.2015.06.039 26141506 99. Brito R.G. Guimaraes A.G. Quintans J.S. Santos M.R. De Sousa D.P. Badaue-Passos D. Jr. de Lucca W. Jr. Brito F.A. Barreto E.O. Oliveira A.P. Citronellol, a monoterpene alcohol, reduces nociceptive and inflammatory activities in rodents J. Nat. Med. 2012 66 637 644 10.1007/s11418-012-0632-4 22350215 100. Srinivasan S. Muruganathan U. Antidiabetic efficacy of citronellol, a citrus monoterpene by ameliorating the hepatic key enzymes of carbohydrate metabolism in streptozotocin-induced diabetic rats Chem. Biol. Interact. 2016 250 38 46 10.1016/j.cbi.2016.02.020 26944432 101. de Menezes I.A. Moreira I.J. de Paula J.W. Blank A.F. Antoniolli A.R. Quintans-Junior L.J. Santos M.R. Cardiovascular effects induced by Cymbopogon winterianus essential oil in rats: Involvement of calcium channels and vagal pathway J. Pharm. Pharmacol. 2010 62 215 221 10.1211/jpp.62.02.0009 20487201 102. Liu X. Zhu C. Yin Y. Anti-ischemic effect of monoterpene citronellol on experimental stroke models mediated by proinflammatroy cytokines Comb. Chem. High Throughput Screen. 2023 26 1888 1899 36372917 10.2174/1386207326666221110092715 103. Cardia G.F.E. Silva-Filho S.E. Silva E.L. Uchida N.S. Cavalcante H.A.O. Cassarotti L.L. Salvadego V.E.C. Spironello R.A. Bersani-Amado C.A. Cuman R.K.N. Effect of Lavender ( Lavandula angustifolia Evid.-Based Complement. Altern. Med. eCAM 2018 2018 1413940 10.1155/2018/1413940 29743918 PMC5878871 104. Kim J.R. Kang P. Lee H.S. Kim K.Y. Seol G.H. Cardiovascular effects of linalyl acetate in acute nicotine exposure Environ. Health Prev. Med. 2017 22 42 10.1186/s12199-017-0651-6 29165169 PMC5664431 105. Hsieh Y.S. Shin Y.K. Han A.Y. Kwon S. Seol G.H. Linalyl acetate prevents three related factors of vascular damage in COPD-like and hypertensive rats Life Sci. 2019 232 116608 10.1016/j.lfs.2019.116608 31254583 106. Shin Y.K. Hsieh Y.S. Kwon S. Lee H.S. Seol G.H. Linalyl acetate restores endothelial dysfunction and hemodynamic alterations in diabetic rats exposed to chronic immobilization stress J. Appl. Physiol. 2018 124 1274 1283 10.1152/japplphysiol.01018.2017 29470152 107. Muruganathan U. Srinivasan S. Beneficial effect of carvone, a dietary monoterpene ameliorates hyperglycemia by regulating the key enzymes activities of carbohydrate metabolism in streptozotocin-induced diabetic rats Biomed. Pharmacother. 2016 84 1558 1567 10.1016/j.biopha.2016.11.025 27876337 108. Kang W. Choi D. Park S. Park T. Carvone Decreases Melanin Content by Inhibiting Melanoma Cell Proliferation via the Cyclic Adenosine Monophosphate (cAMP) Pathway Molecules 2020 25 5191 10.3390/molecules25215191 33171851 PMC7664693 109. Ding X. Chen H. Anticancer effects of Carvone in myeloma cells is mediated through the inhibition of p38 MAPK signalling pathway, apoptosis induction and inhibition of cell invasion JBUON 2018 23 747 751 30003746 110. Asle-Rousta M. Amini R. Aghazadeh S. Carvone suppresses oxidative stress and inflammation in the liver of immobilised rats Arch. Physiol. Biochem. 2020 129 597 602 10.1080/13813455.2020.1851726 33270467 111. Chen G. Song Y. Ma F. Ma Y. Anti-arthritic activity of D-carvone against complete Freund’s adjuvant-induced arthritis in rats through modulation of inflammatory cytokines Korean J. Physiol. Pharmacol. Off. J. Korean Physiol. Soc. Korean Soc. Pharmacol. 2020 24 453 462 10.4196/kjpp.2020.24.6.453 PMC7585598 33093267 112. Long J. Sun Y. Liu S. Chen C. Yan Q. Lin Y. Zhang Z. Chu S. Yang Y. Yang S. Ginsenoside Rg1 treats ischemic stroke by regulating CKLF1/CCR5 axis-induced neuronal cell pyroptosis Phytomedicine 2024 123 155238 10.1016/j.phymed.2023.155238 38128394 113. Silva G. Souza D.S. Menezes-Filho J.E.R. Silva-Neto J.A.D. Cruz J.D.S. Roman-Campos D.R. Quintans-Junior L.J. Vasconcelos C.M.L. (-)-Carvone Modulates Intracellular Calcium Signaling with Antiarrhythmic Action in Rat Hearts Arq. Bras. De Cardiol. 2022 119 294 304 10.36660/abc.20210499 PMC9363060 35946691 114. Khaleel C. Tabanca N. Buchbauer G. α-Terpineol, a natural monoterpene: A review of its biological properties J. Open Chem. 2018 16 349 361 10.1515/chem-2018-0040 115. Sousa G.M. Cazarin C.B.B. Marostica Junior M.R. Lamas C.A. Quitete V. Pastore G.M. Bicas J.L. The effect of alpha-terpineol enantiomers on biomarkers of rats fed a high-fat diet Heliyon 2020 6 e03752 10.1016/j.heliyon.2020.e03752 32382672 PMC7199010 116. Negreiros H.A. de Moura K.G. Barreto do Nascimento M.L.L. do Nascimento Rodrigues D.C. Ferreir P.M.P. Braz D.C. de Farias M.G. de Sousa Corrêia L. Pereira A.R.S. Santos L.K.B. Alpha-Terpineol as Antitumor Candidate in Pre-Clinical Studies Anti-Cancer Agents Med. Chem. 2021 21 2023 2031 10.2174/1871520621999210104195820 33397274 117. Soleimani M. Sheikholeslami M.A. Ghafghazi S. Pouriran R. Parvardeh S. Analgesic effect of α-terpineol on neuropathic pain induced by chronic constriction injury in rat sciatic nerve: Involvement of spinal microglial cells and inflammatory cytokines Iran. J. Basic Med. Sci. 2019 22 1445 1451 32133063 10.22038/IJBMS.2019.14028 PMC7043874 118. Gouveia D.N. Costa J.S. Oliveira M.A. Rabelo T.K. Silva A. Carvalho A.A. Miguel-Dos-Santos R. Lauton-Santos S. Scotti L. Scotti M.T. α-Terpineol reduces cancer pain via modulation of oxidative stress and inhibition of iNOS Biomed. Pharmacother. 2018 105 652 661 10.1016/j.biopha.2018.06.027 29902764 119. Paulino E.T. Rodrigues A.K.B.F. Machado M.L.D.P. de Oliveira K.R.V. Bernardino A.C. Quintans-Júnior L.J. Oliveira A.P. Ribeiro Ê.A.N. Alpha-terpineol prevents myocardial damage against isoproterenol-MI induced in Wistar-Kyoto rats: New possible to promote cardiovascular integrity Life Sci. 2022 290 120087 10.1016/j.lfs.2021.120087 34740575 120. Matsumoto T. Taguchi K. Kobayashi T. Role of TRPV4 on vascular tone regulation in pathophysiological states Eur. J. Pharmacol. 2023 959 176104 10.1016/j.ejphar.2023.176104 37802278 121. Magalhaes P.J. Lahlou S. Juca D.M. Coelho-de-Souza L.N. da Frota P.T. da Costa A.M. Leal-Cardoso J.H. Vasorelaxation induced by the essential oil of Croton nepetaefolius and its constituents in rat aorta are partially mediated by the endothelium Fundam. Clin. Pharmacol. 2008 22 169 177 10.1111/j.1472-8206.2008.00571.x 18353112 122. Pereira I. Severino P. Santos A.C. Silva A.M. Souto E.B. Linalool bioactive properties and potential applicability in drug delivery systems Colloids Surf. B Biointerfaces 2018 171 566 578 10.1016/j.colsurfb.2018.08.001 30098535 123. Wu Q. Yu L. Qiu J. Shen B. Wang D. Soromou L.W. Feng H. Linalool attenuates lung inflammation induced by Pasteurella multocida via activating Nrf-2 signaling pathway Int. Immunopharmacol. 2014 21 456 463 10.1016/j.intimp.2014.05.030 24925757 124. Cheng Y. Dai C. Zhang J. SIRT3-SOD2-ROS pathway is involved in linalool-induced glioma cell apoptotic death Acta Biochim. Pol. 2017 64 343 350 10.18388/abp.2016_1438 28567457 125. Sabogal-Guaqueta A.M. Hobbie F. Keerthi A. Oun A. Kortholt A. Boddeke E. Dolga A. Linalool attenuates oxidative stress and mitochondrial dysfunction mediated by glutamate and NMDA toxicity Biomed. Pharmacother. 2019 118 109295 10.1016/j.biopha.2019.109295 31545255 126. Chen T.C. da Fonseca C.O. Levin D. Schonthal A.H. The Monoterpenoid Perillyl Alcohol: Anticancer Agent and Medium to Overcome Biological Barriers Pharmaceutics 2021 13 2167 10.3390/pharmaceutics13122167 34959448 PMC8709132 127. Berchtold C.M. Chen K.S. Miyamoto S. Gould M.N. Perillyl alcohol inhibits a calcium-dependent constitutive nuclear factor-kappaB pathway Cancer Res. 2005 65 8558 8566 10.1158/0008-5472.CAN-04-4072 16166337 128. Tabassum R. Vaibhav K. Shrivastava P. Khan A. Ahmed M.E. Ashafaq M. Khan M.B. Islam F. Safhi M.M. Islam F. Perillyl alcohol improves functional and histological outcomes against ischemia-reperfusion injury by attenuation of oxidative stress and repression of COX-2, NOS-2 and NF-kappaB in middle cerebral artery occlusion rats Eur. J. Pharmacol. 2015 747 190 199 10.1016/j.ejphar.2014.09.015 25240714 129. Ma J. Li J. Wang K.S. Mi C. Piao L.X. Xu G.H. Li X. Lee J.J. Jin X. Perillyl alcohol efficiently scavenges activity of cellular ROS and inhibits the translational expression of hypoxia-inducible factor-1alpha via mTOR/4E-BP1 signaling pathways Int. Immunopharmacol. 2016 39 1 9 10.1016/j.intimp.2016.06.034 27394002 130. Khan A.Q. Nafees S. Sultana S. Perillyl alcohol protects against ethanol induced acute liver injury in Wistar rats by inhibiting oxidative stress, NFkappa-B activation and proinflammatory cytokine production Toxicology 2011 279 108 114 Correction in Toxicology 2011 290 10.1016/j.tox.2010.09.017 20923693 131. Beik A. Najafipour H. Joukar S. Rajabi S. Iranpour M. Kordestani Z. Perillyl alcohol suppresses monocrotaline-induced pulmonary arterial hypertension in rats via anti-remodeling, anti-oxidant, and anti-inflammatory effects Clin. Exp. Hypertens. 2021 43 270 280 10.1080/10641963.2020.1860080 33322932 132. Kennedy S. Wadsworth R.M. Wainwright C.L. Effect of antiproliferative agents on vascular function in normal and in vitro balloon-injured porcine coronary arteries Eur. J. Pharmacol. 2003 481 101 107 10.1016/j.ejphar.2003.09.010 14637181 133. Tong Z. Li G. Su C. Zhou L. Zhang L. Chen Q. Xia Q. L-Borneol 7-O-[beta-D-Apiofuranosyl-(1-->6)]-beta-D-Glucopyranoside Alleviates Myocardial Ischemia-Reperfusion Injury in Rats and Hypoxic/Reoxygenated Injured Myocardial Cells via Regulating the PI3K/AKT/mTOR Signaling Pathway J. Immunol. Res. 2022 2022 5758303 10.1155/2022/5758303 35600046 PMC9119761 134. Song X. Xing W. Zhang X. Wang X. Ji J. Lu J. Yu B. Ruan M. Exploring the synergic mechanism of Ligusticum striatum DC. and borneol in attenuating BMECs injury and maintaining tight junctions against cerebral ischaemia based on the HIF-1alpha/VEGF signalling pathway J. Ethnopharmacol. 2023 301 115764 10.1016/j.jep.2022.115764 36183951 135. Chen Z.X. Xu Q.Q. Shan C.S. Shi Y.H. Wang Y. Chang R.C. Zheng G.Q. Borneol for Regulating the Permeability of the Blood-Brain Barrier in Experimental Ischemic Stroke: Preclinical Evidence and Possible Mechanism Oxidative Med. Cell. Longev. 2019 2019 2936737 10.1155/2019/2936737 30863478 PMC6378772 136. Zou L. Zhang Y. Li W. Zhang J. Wang D. Fu J. Wang P. Comparison of Chemical Profiles, Anti-Inflammatory Activity, and UPLC-Q-TOF/MS-Based Metabolomics in Endotoxic Fever Rats between Synthetic Borneol and Natural Borneol Molecules 2017 22 1446 10.3390/molecules22091446 28858264 PMC6151575 137. Kumar M.S. Kumar S. Raja B. Antihypertensive and antioxidant potential of borneol-a natural terpene in LNAME—Induced hypertensive rats Int. J. Pharm. Biol. Arch. 2010 1 271 279 138. Madhuri K. Naik P.R. Ameliorative effect of borneol, a natural bicyclic monoterpene against hyperglycemia, hyperlipidemia and oxidative stress in streptozotocin-induced diabetic Wistar rats Biomed. Pharmacother. 2017 96 336 347 10.1016/j.biopha.2017.09.122 29028586 139. Masyita A. Mustika Sari R. Dwi Astuti A. Yasir B. Rahma Rumata N. Emran T.B. Nainu F. Simal-Gandara J. Terpenes and terpenoids as main bioactive compounds of essential oils, their roles in human health and potential application as natural food preservatives Food Chem. X 2022 13 100217 10.1016/j.fochx.2022.100217 35498985 PMC9039924 140. Jäger W. Höferl M. Metabolism of terpenoids in animal models and humans Handbook of Essential Oils 3rd CRC Press Boca Raton, FL, USA 2020 Volume I 275 301 141. Kohlert C. van Rensen I. Marz R. Schindler G. Graefe E.U. Veit M. Bioavailability and pharmacokinetics of natural volatile terpenes in animals and humans Planta Medica 2000 66 495 505 10.1055/s-2000-8616 10985073 142. Khanam S. Mishra P. Faruqui T. Alam P. Albalawi T. Siddiqui F. Rafi Z. Khan S. Plant-based secondary metabolites as natural remedies: A comprehensive review on terpenes and their therapeutic applications Front. Pharmacol. 2025 16 1587215 10.3389/fphar.2025.1587215 40458805 PMC12127327 143. Selka A. Abidli A. Schiavo L. Jeanmart L. Hanquet G. Lubell W.D. Recent Advances in Sustainable Total Synthesis and Chiral Pool Strategies with Emphasis on (−)-Sclareol in Natural Products Synthesis Eur. J. Org. Chem. 2025 28 e202400983 10.1002/ejoc.202400983 144. Silva J.J.M. Campanharo S.C. Paschoal J.A.R. Ethnoveterinary for food-producing animals and related food safety issues: A comprehensive overview about terpenes Compr. Rev. Food Sci. Food Saf. 2021 20 48 90 10.1111/1541-4337.12673 33443807 145. Potocka W. Assy Z. Bikker F.J. Laine M.L. Current and Potential Applications of Monoterpenes and Their Derivatives in Oral Health Care Molecules 2023 28 7178 10.3390/molecules28207178 37894657 PMC10609285 146. Milan A. Mioc A. Prodea A. Mioc M. Buzatu R. Ghiulai R. Racoviceanu R. Caruntu F. Soica C. The Optimized Delivery of Triterpenes by Liposomal Nanoformulations: Overcoming the Challenges Int. J. Mol. Sci. 2022 23 1140 10.3390/ijms23031140 35163063 PMC8835305 147. Zhao Y. Qu H. Wang Y. Xiao W. Zhang Y. Shi D. Small rodent models of atherosclerosis Biomed. Pharmacother. 2020 129 110426 10.1016/j.biopha.2020.110426 32574973 148. Boerman E.M. Sen S. Shaw R.L. Joshi T. Segal S.S. Gene expression profiles of ion channels and receptors in mouse resistance arteries: Effects of cell type, vascular bed, and age Microcirculation 2018 25 e12452 10.1111/micc.12452 29577514 PMC5949082 149. Tanner M.R. Beeton C. Differences in ion channel phenotype and function between humans and animal models Front. Biosci. (Landmark Ed.) 2018 23 43 64 28930537 10.2741/4581 PMC5626566 150. de Alvarenga J.F.R. Genaro B. Costa B.L. Purgatto E. Manach C. Fiamoncini J. Monoterpenes: Current knowledge on food source, metabolism, and health effects Crit. Rev. Food Sci. Nutr. 2023 63 1352 1389 10.1080/10408398.2021.1963945 34387521 151. de Sena Bastos C.M. Pereira-de-Morais L. de Alencar Silva A. de Menezes Dantas D. Batista P.R. Gomes M.F.L. de Araujo Delmondes G. de Menezes I.R.A. da Silva R.E.R. Barbosa R. Perillyl Alcohol Promotes Relaxation in Human Umbilical Artery Curr. Med. Chem. 2024 31 7072 7082 10.2174/0109298673269428231204064101 38204229 152. Moreno K.G.T. Marques A.A.M. da Silva G.P. Bertoncelo L.A. Pessoal L.B. Goncalves L.D. Dos Santos A.C. Souza R.I.C. Silva D.B. Gasparotto Junior A. Cardioprotective Effects of Aloysia polystachya Essential Oil on a Rat Model with Multiple Cardiovascular Risk Factors Planta Medica 2024 90 708 716 10.1055/a-2294-6922 38631368 153. Swiderski J. Sakkal S. Apostolopoulos V. Zulli A. Gadanec L.K. Combination of Taurine and Black Pepper Extract as a Treatment for Cardiovascular and Coronary Artery Diseases Nutrients 2023 15 2562 10.3390/nu15112562 37299525 PMC10255510 154. Ju C. Song S. Hwang S. Kim C. Kim M. Gu J. Oh Y.K. Lee K. Kwon J. Lee K. Discovery of novel (1S)-(-)-verbenone derivatives with anti-oxidant and anti-ischemic effects Bioorganic Med. Chemestry Lett. 2013 23 5421 5425 10.1016/j.bmcl.2013.07.038 23953190 155. Abd El-Ghffar E.A. Eldahshan O.A. Barakat A. Efferth T. The prophylactic effect of a Eugenia aquea extract against oxidative stress and inflammation associated with the development of arthritis in an adjuvant-induced arthritis rat model Food Funct. 2018 9 6643 6651 10.1039/C8FO01570H 30511707 156. Kim D.H. Yong H.J. Mander S. Nguyen H.T. Nguyen L.P. Park H.K. Cha H.K. Kim W.K. Hwang J.I. SP-8356, a (1S)-(-)-Verbenone Derivative, Inhibits the Growth and Motility of Liver Cancer Cells by Regulating NF-kappaB and ERK Signaling Biomol. Ther. 2021 29 331 341 10.4062/biomolther.2020.200 33455945 PMC8094067 157. Goodarzi S. Hadjiakhoondi A. Yassa N. Khanavi M. Tofighi Z. Essential oils chemical composition, antioxidant activities and total phenols of Astrodaucus persicus Iran. J. Basic Med. Sci. 2016 19 159 165 27081460 PMC4818363 Figure 1 The chemical structures and biosynthesis pathways of monoterpenes. Legend: Glyceraldehyde-3-phosphate (G3P); 1-deoxy-d-xylulose 5-phosphate (DXP); methylerythitol 4-phosphate (MEP); 4-hydroxy-3-methyl-butenyl 1-diphosphate (HMB-PP); mevalonate (MVA); isopentenyl pyrophosphate (IPP); dimethylallyl pyrophosphate (DMAPP); and geranyl pyrophosphate (GPP). Figure 2 The classification and physical properties of monoterpenes. Legend: Molecular Formula (MF); Molecular Weight (MW); Logarithm of the partition coeficiente (Log P); Hydrogen Bond Donor Count (HBD); and Hydrogen Bond Acceptor Count (HBA). Figure 3 Protective effect of monoterpenes on the blood vessel. Monoterpenes promote vasodilation and vascular protection through multiple mechanisms: they increase the expression and activation of eNOS via Akt/PKB phosphorylation. Monoterpenes also act on TRPV3, increasing Ca 2+ Ca 2+ Ca Ca Ca Ca ijms-26-09243-t001_Table 1 Table 1 Description of the main characteristics of preclinical studies using monoterpenes with action on vascular function.   Estudos In Vitro   Monoterpene Experimental Model Concentration Tested Mechanism of Action  Reference Geraniol Thoracic aorta of diabetic rats 10–300 Vasorelaxation by inhibiting Ca v [ 51 HUVEC 25–100 Inhibits Ox-LDL-induced inflammation and oxidative stress by targeting PI3/AKT/NRF2 [ 52 Carvacrol Rat thoracic aorta artery 1–1 × 10 3 Vasorelaxation by block the Ca 2+ [ 53 Posterior cerebral or cerebellar arteries from rats 10–1 × 10 4 Relaxation induced by Ca 2+ ca ca [ 40 Rat thoracic aorta artery 0.01–100 Attenuation of the vasoconstrictor action via ROS inhibition and NOS stimulation [ 31 Superior mesenteric artery of rats 0.01–300 Vasorelaxation by inhibition of the Ca 2+ v [ 43 Citronellal Superior mesenteric artery of rats 1–1 × 10 5 Vasorelaxation by inhibiting calcium influx [ 54 Citronellol Superior mesenteric artery of rats 640–1.9 × 10 6 Vasorelaxation by inhibiting calcium influx and Ca v [ 55 Linalyl acetate Rabbit carotid artery 300 Vasorelaxation by stimulating eNOS in vascular endothelium and stimulating MLCP in vascular smooth muscle [ 56 HUVEC 509 Blocked the Ca 2+ [ 57 Citral Thoracic aorta of rats from hypertensive rats 6.24–6.24 × 10 3 Vasorelaxation by NO/cyclic GMP pathway and inhibiting Ca v [ 58 Rat thoracic aorta 300–3 × 10 4 Vasorelaxation by NO/cyclic GMP pathway and the calcium influx through Ca v [ 59 Rat thoracic aorta 6.57–6.57 × 10 3 Vasorelaxation by NO/cyclic GMP pathway and inhibiting Ca v [ 24 Carvone Rat thoracic aorta 100 Vasorelaxation by blocking Ca v [ 32 α-terpineol Superior mesenteric artery of Wistar rats 1 × 10 −6 Vasorelaxation by NO/cyclic GMP pathway [ 29 Superior mesenteric artery of hypertensive rats 1.10 −4 4 Vasorelaxation by inhibiting Ca v [ 60 Linalool Rat superior mesenteric artery 6.4–6.4 × 10 3 Vasorelaxation by inhibiting calcium influx and Ca v [ 61 Rat thoracic aorta 100 Vasorelaxation by blocking Ca v [ 32 Mouse thoracic aortas 10–500 Vasorelaxation by activating sCG and K + [ 28 Ang II-induced VSMCs 50–150 Inhibited the proliferation and migration by inhibithing MAPK [ 5 p-cymene Rat thoracic aorta artery 1–1 × 10 3 Vasorelaxation by activation Kir2 and Kir6 Channels [ 62 Thymol Rat thoracic aorta artery 1–1 × 10 3 Vasorelaxation by block the Ca 2+ [ 53 Carveol Rat thoracic aorta artery 1–5 × 10 3 Vasorelaxation by inhibiting Ca v [ 63 Human umbilical artery 1–5 × 10 3 Vasorelaxation by inhibiting Ca v ca [ 64 Perillyl alcohol Rat thoracic aorta artery 1–5 × 10 3 Induced relaxant effect by inhibition of PKC and IP 3 [ 63 Human vascular smooth muscle cells 100–2 × 10 3 Inhibits proliferation and also induces apoptosis [ 65 β-pinene Superior mesenteric artery of rats 0.1–3 × 10 4 Vasorelaxant effect involve blocking Ca 2+ v 2+ [ 66 Borneol Rat thoracic aorta artery 1 × 10 −3 Vasorelaxation by calcium influx blockade through Ca v [ 67 Rat thoracic aorta artery 1 × 10 −4 Vasorelaxant effect with the participation of NO and prostanoids in vascular endothelium and action on the VSMC dependent in Kir6 channels. [ 23  Estudos In Vivo  Monoterpene  Experimental Model  Dose Tested  Mechanism of Action  Reference Geraniol Mice fed with a high-fat diet 100 mg/kg/day Improves endothelial function by inhibiting NOX-2 derived ROS generation [ 68 Carvacrol Normotensive rats 1–20 mg/kg Induced hypotension, bradycardia, and negative inotropic and chronotropic effects [ 43 Diabetic rats 10–20 mg/kg/day Reduced hypercontractility by activating the PI3K/Akt signaling pathway [ 69 Spontaneously hypertensive rats (SHR) 50–100 mg/kg/day Improved reendothelialization by increasing eNOS expression and reducing senescence and oxidative stress in endothelial progenitor cells. [ 70 Citronellal Rats fed with a high-fat diet 50–150 Improved endothelial dysfunction, increased cell migration, and suppressed oxidative stress and inflammation in vascular endothelium [ 71 Diabetic rats 150 mg/kg/day Increased expression of S1P1 and eNOS, accompanied by increased SOD levels and ROS reduction. [ 72 Diabetic rats 50–150 mg/kg/day Suppressed the expression of NHE1 and TPRM2, alleviated oxidative stress-induced mitochondrial damage [ 73 Linalyl acetate Hypertension induced by immobilization stress and intraperitoneal injection of nicotine 25–100 mg/kg Suppression of phosphorylation and activation of the NADPH oxidase, decrease in ROS production and increased expression of eNOS [ 26 Carvone Cerebral I/R injury in rats 1–20 mg/kg/day It had antioxidative, anti-inflammatory, and anti-apoptotic effects against cerebral I/R brain injury. [ 74 α-terpineol Normotensive rats 1–30 mg/kg Dose-dependent hypotension followed by reflex tachycardia [ 29 Hypertension induced by L-NAME 25–100 mg/kg/day Reduce arterial pressure, decrease vascular resistance, and restore enzymatic antioxidants [ 60 Linalool Normotensive rats 1–20 mg/kg/day Hypotension and bradycardia attenuated by inhibition of muscarinic receptors [ 61 Hypertensive rats 200 mg/kg/day Reduced blood pressure without changing the heart rate [ 61 SHR 50–100 mg/kg/day Reduced blood pressure, increased levels of the anti-inflammatory cytokine (IL-10) and improved vasodilator responsiveness [ 75 α-Pinene Aorta artery from ApoE/mice Particulate matter in ratios of 10:1:1 Increased vascular expression of HO-1, MMP-9 and ET-1 [ 76 β-Pinene Hypertension induced by L-NAME 200 mg/kg Reduce arterial pressure [ 66 Voltage-gated L-type calcium channels (Cav); Nitric oxide (NO); Soluble guanylyl cyclase (sCG); Mitogen-activated protein kinase (MAPK); Receptor-operated calcium channels (ROC); Sphingosine-1-phosphate receptor subtype 1 (S1P1); Endothelial nitric oxide synthase (eNOS); (SOD); Reactive oxygen species (ROS); Na + + 3 ",
  "metadata": {
    "Title of this paper": "Essential oils chemical composition, antioxidant activities and total phenols of Astrodaucus persicus",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470599/"
  }
}