{
  "title": "Paper_244",
  "abstract": "pmc BMC Proc BMC Proc 587 bmcproc BMC Proceedings 1753-6561 BMC PMC12486565 PMC12486565.1 12486565 12486565 41029372 10.1186/s12919-025-00336-2 336 1 Meeting Abstracts The Pandemic EVIDENCE Collaboration 1 10 2025 2025 19 Suppl 18 498087 Publication of this supplement was funded by the Pandemic EVIDENCE Collaboration. 29 01 10 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Launching the Pandemic EVIDENCE Collaboration Oxford, UK 11-12 April 2024 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 1. Developing Evidence-Informed Non-Pharmacological Interventions during Public Health Emergencies: Purpose, Rationale and Principles and Questions to Answer (* EV I D E N C E Conly J. 1 2 3 4 5 6 7 8 9 3 3 3 3 10 6 6 11 12 13 1 2 3 4 5 6 7 8 9 10 11 12 13 BMC Proceedings 2025 19(18) Purpose: Rationale:  Principles: • The focus will be on NPIs and their application to improve population health and health service delivery. • Public health emergencies will be considered any urgent and critical situation that endangers a population's lives, health and/or safety (e.g., pandemics, natural or human-made disasters). • Establish a global based collaboration of evidence-based centres to build individual scientist (current and future), system level and organizational capacity for future public health emergencies. • Equity, diversity, inclusion and accessibility will be considered in all aspects of the work. • Members of the evidence-based collaboration† will have demonstrable conviction and strength in high-quality research and knowledge exchange with academic-societal partnerships to bidirectionally inform research and policy/care decision-making. • Members will maintain a strong position of equipoise and produce generalizable knowledge at a low risk of bias. †Defining evidence-based collaboration: (adapted/modified from the original founding principles within the Cochrane Collaboration) https://www.cochrane.org/about-us  ✓ Maintain co-operation, teamwork, integrity, openness, transparency, scientific rigour and independence ✓ Create continuous support and training of all members with a focus on young investigators and the next generation of evidence-based experts ✓ Ensure duplication of effort does not occur ✓ Focus on minimisation bias with every endeavour ✓ Promotion of relevance in all workstreams ✓ Provide open access for all outputs ✓ Strive for excellence in the quality of all outputs ✓ Ensure continuous review of all strategies  Questions to be answered: How do we generate high-quality evidence (including, but not solely limited to, randomized controlled trials) for NPIs during a global public health emergency? How do we foster effective and efficient knowledge exchange during a global public health emergency so that scientists and public health officials address the most relevant policy and care questions, and policymakers and health system leaders incorporate the resulting evidence into decision-making? How do we study the short- and long-term consequences of NPI policies, including inequities, on health (e.g., length and quality of life), economic (e.g., income, housing and food security), psychosocial (e.g., community cohesion) and environmental (i.e., natural and built environment ([ https://www.gchu.org.uk * https://www.kellogg.ox.ac.uk/kellogg-centres/the-pandemic-evidence-collaboration/people/ 2. The Founding of the Pandemic EVIDENCE* Collaboration (* EV I D E N C E Conly J. 1 2 3 4 5 6 1 2 3 4 5 6 BMC Proceedings 2025 19(18) The COVID-19 pandemic has highlighted the strengths and limitations of scientific research and knowledge exchange during a public health emergency. While pharmacological interventions were rapidly developed, tested, and distributed with remarkable efficiency, decisions regarding many non-pharmacological interventions (NPIs) were often made with limited evidence. As a result, there is still a lack of understanding regarding the potential short- and long-term benefits, harms, and unintended consequences of various public health measures, as well as the optimal ways to organise patient care. In response to these challenges, a collaborative initiative was launched in September 2023 by independent academics and scholars from institutions around the world, including Bond University in Australia, the University of Calgary and McMaster University in Canada, Oslo Metropolitan University in Norway and the University of Oxford in the UK. These experts came together with a shared goal: to identify, develop, and implement strategies for generating high-quality evidence on NPIs during public health emergencies to better inform policy and care decisions. To advance this mission, the Pandemic Evidence Collaboration was established with the support of a generous £275,000 grant over three years from the McCall MacBain Foundation. This initiative unites diverse expertise and resources to propel the project forward, ensuring that future public health decisions are based on rigorous, evidence-based research. * https://www.kellogg.ox.ac.uk/kellogg-centres/the-pandemic-evidence-collaboration/people/ Adapted with permission: McCall MacBain Foundation Annual Report https://www.kellogg.ox.ac.uk/wp-content/uploads/2024/12/PEC-MMF-Report-2023-24.pdf 3. Non-Pharmacological Interventions: Nomenclature, Taxonomy, and a Working Definition Conly J. 1 2 2 3 2 4 5 6 2 7 8 2 1 2 3 4 5 6 7 8 BMC Proceedings 2025 19(18) Many terms have been used to describe interventions that do not involve the use of pharmacological products in the setting of communicable diseases. Terminology has varied from physical, non-pharmaceutical, non-drug, non-pharmacologic, and non-pharmacological interventions, as well as public health measures and public health and social measures. Previous epidemics and pandemics, and especially the recent COVID-19 pandemic, have highlighted the importance of non-pharmacological interventions (NPIs), and the term is now recognized globally. The use of the terms public health measures or public health and social measures have variably also been inclusive of the use of vaccines which would be considered a pharmacological product. Given this background and confusion over terminology and descriptions, we sought to review this topic and provide clarity regarding nomenclature, taxonomy, and definitions with an aim to ensure an explicit shared understanding of any interventions that do not involve pharmacological products, given the importance of conducting NPI evaluations for future epidemics and pandemics. For clarity, we would define a NPI as a measure not involving a medicinal product, used in humans with the intent to treat or prevent disease. In this context, a medicinal product would be one which has intended effects on physiological bodily functions through any pharmacological, immunological or metabolic action, as outlined by the European Medicines Agency. The use of pharmacological interventions versus NPIs have different regulatory frameworks, different descriptors and different evaluation approaches. It has been well recognized that there was a dearth of high quality evidence generated for NPIs in the same manner as PIs such as vaccines and antivirals during the recent COVID-19 pandemic, which has been already termed a “pandemic tragedy” in late 2021.  https://www.kellogg.ox.ac.uk/wp-content/uploads/2024/11/updated-Nomenclature-Taxonomy-and-a-Working-Definition.pdf 4. The Pandemic EVIDENCE* Collaboration Meeting Planning (* EV I D E N C E Conly J. 1 2 2 1 2 BMC Proceedings 2025 19(18) The COVID-19 pandemic was a dramatic event in world history and although the development and deployment of pharmacologic interventions, specifically vaccines and antivirals occurred at an unprecedented pace with the benefit of high-quality randomized trials, the same cannot be stated for non-pharmacological interventions (NPIs). With the recognition of the poor quality of high-quality evidence to guide the optimal deployment of NPIs, the impetus to create the Pandemic EVIDENCE Collaboration became obvious. The inaugural meeting was held at the campus of Kellogg College at the University of Oxford April 11, 12 2024. The agenda consisted of introductions of the members who hailed from 10 countries from 3 continents followed by establishing agreement on the founding principles, formally appointing the Collaboration and confirming small working group allocations, aims and outputs. The aims and outputs were focused on defining three major pillars including diagnostics and transmission, interventions and evidence and practice and policy with four cross-cutting themes of definitions and nomenclature, data challenges, methodological issues and funding each with proposed research protocols, action plans and engagement strategies. Other parts of the agenda were devoted to the introductions of the 4 Founding Evidence -Informed Fellows, including their project areas of interest and the proposal for 10–12 additional Evidence-Informed Fellowships. Formal presentations on the “Use and Misuse of Modelling Studies during the COVID-19 Pandemic: What is their Optimal Role?” and “The Need for Conducting Randomized Trials in a Pandemic to Provide High Quality Evidence: Overcoming the Challenges” were presented. The final part of the agenda was devoted to the planning for a major international conference to be held in Banff Canada in May 2025. * https://www.kellogg.ox.ac.uk/kellogg-centres/the-pandemic-evidence-collaboration/people/ 5. Pandemic EVIDENCE* Collaboration Pillar 1: Diagnostics and Transmission (* EV I D E N C E Conly J. 1 2 2 3 2 1 2 3 BMC Proceedings 2025 19(18) The COVID-19 pandemic starkly revealed a lack of high-quality evidence for non-pharmacological interventions (NPIs). The evidence produced to support the optimal deployment of NPIs in an effort to reduce transmission of SARS-CoV-2 was often of poor quality, and decisions were made without considering the wealth of previous research on respiratory virus transmission from human challenge studies. Respiratory virus infections cause illnesses varying from the “common cold” to invasive pneumonitis with multisystem involvement with severity dependent on the host-virus-immune response interaction. Despite the learnings from the recent pandemic, significant gaps remain in our understanding of the diagnosis of acute respiratory viral infections and their sequelae, the modes of transmission, and how to effectively synthesise the existing evidence from the past 70 years of research on respiratory viruses. It is crucial to examine further the evidence on how common respiratory viral agents are transmitted. The transmission dynamics to allow for a replication-competent virus to move from a reservoir to a susceptible host and establish an invasive infection is complex and it is likely multiple modes of transmission exist from direct reservoir-to-host (contact, droplet deposition, transplacental) and indirect reservoir-to-intermediary-to- host (vehicle-borne, foodborne, waterborne, and airborne) routes. To enhance our understanding of both diagnostics and transmission, we need to characterise viral entry and attachment, viral load dynamics, duration of virus infectivity both inside and outside the host, duration of viral nucleic acid shedding using molecular testing, the role of whole genome sequencing, and factors that may affect the duration of infectivity and transmission. There are still uncertainties surrounding current testing strategies and their connection to NPIs, as well as fundamental issues such as the accuracy of symptom reporting during acute respiratory infections. The importance of animal-to-animal, human-to-animal and human-to-human challenge studies in expanding our knowledge of the transmission of respiratory viruses cannot be overstated.  https://www.kellogg.ox.ac.uk/wp-content/uploads/2024/11/Pillar-1-2.pdf 6. Pandemic EVIDENCE* Collaboration Pillar 2: Interventions and Evidence (* EV I D E N C E Fretheim A. 1 2 3 4 5 1 2 3 4 5 BMC Proceedings 2025 19(18) The use of non-pharmacological interventions (NPIs) on a global scale to reduce the transmission of SARS-CoV-2 was unprecedented. However, there was a lack of high-quality evidence to fully understand the benefits and harms of these interventions. There was a dearth of randomised controlled trials (RCTs) of NPIs during the COVID‐19 pandemic, highlighting the lack of evidence relative to the significant role NPIs played during the pandemic from a societal perspective. As a result, there was limited understanding of how infrastructure and physical barriers affect the transmission of respiratory viruses and how environmental factors impact the effects of NPIs. There was also a lack of understanding of how to best apply evidence for NPIs to individuals and populations and identify their benefits, harms and unintended consequences, all of which should receive equal weighting. The lack of high quality research on the use of physical barriers, physical distancing, facial coverings, avoidance of crowds, closures of schools, businesses, and large gatherings, disinfection of high-touch surfaces, use of ultraviolet light and air purifiers, ventilation, CO2 monitors, screen and test strategies and travel restrictions limits our ability to deduce the benefits, harms and unintended consequences. Furthermore, the widespread nosocomial transmission in hospitals and long-term care homes and its devastating effects on the elderly require a better understanding of the role of the built environment as a risk factor. High-quality evidence requires the development and testing in RCTs to assess the feasibility, applicability, effectiveness and unintended consequences of NPIs. However, the lack of preparation meant RCTs were difficult to develop and undertake during the pandemic. Pilot and feasibility studies are needed to determine how we may best develop evidence for NPIs for viral respiratory pathogens in seasonal endemic and epidemic settings and how this evidence should be optimally applied in the intervening years to reduce uncertainties during future pandemics.  https://www.kellogg.ox.ac.uk/wp-content/uploads/2024/11/Pillar-2.pdf 7. Pandemic EVIDENCE* Collaboration Pillar 3: Practice and Policy (* EV I D E N C E Leal J. 1 2 3 4 5 6 7 1 2 3 4 5 6 7 BMC Proceedings 2025 19(18) Clinical practice and policy must be better informed by the best possible evidence to ensure effective resource use and sound decisions. An understanding of what has been tested to date and the social, educational and economic consequences of NPIs across different sectors of society and across the spectrum of low- to high-income countries is required. As an example, the implications and costs of closing schools on learning, socialisation, and mental health need to be assessed For effective policy, we need to improve our approach to addressing pandemics. This approach includes using real-time data and evidence, which is crucial in informing evidence-based policy decisions. Central questions still need to be addressed, mainly how policy should be better informed about the benefits, harms and unintended consequences of any of any interventions. There is also a clear need to improve the communication of scientific findings and evidence to enable more effective decision-making, especially about how scientists can most effectively advise governments. Methods to assess the cost-effectiveness of pandemic NPIs are urgently needed to allocate scarce resources efficiently. Additionally, it is paramount to minimise waste, identify substandard and misleading studies, and improve communication, including the management of a parallel infodemic, for more effective pandemic policies.  https://www.kellogg.ox.ac.uk/wp-content/uploads/2024/11/Pillar-3.pdf 8. Recruitment of Founding Evidence-Informed Fellows for the Pandemic EVIDENCE* Collaboration (* EV I D E N C E Davis R. 1 1 2 1 2 BMC Proceedings 2025 19(18) To support the initiative of building a robust evidence base for NPIs and expanding the Collaboration, Founding Partner/Steering Committee representatives from their respective Universities were invited to nominate a Founding Evidence-Informed Fellow (EIF) to facilitate engagement and project participation. The EIF role has been established to provide postgraduate trainees (PhD and Master’s students), Post-Doctoral Fellows, and early to mid-career researchers who have a strong interest in and capacity for enhancing evidence generation and application for NPIs with an opportunity to develop expertise in NPIs for public health emergencies. Fellows will be encouraged to attend and present at relevant events, fostering an environment that promotes learning, collaboration, and innovation. We sought individuals who could make bold, thought-provoking, and constructive contributions, recognising the importance of capacity building and possessing the expertise to identify exceptional candidates to join the collaboration. Founding EIF nominees were required to submit a letter of recommendation from their direct supervisor at their respective Universities, along with a three-page CV. Each nomination was reviewed and approved by a member from one of the different Founding Partner members within their respective Universities. Founding Partner & Steering Committee members were notified in advance of the nominations to ensure a timely review process. Goals of the Evidence-Informed Fellowship. The Evidence-Informed Fellowship aims to: • Identify, develop and implement strategies to generate high-quality evidence for NPIs during public health emergencies. • Foster effective and efficient knowledge exchange during pandemics so scientists and public health officials address the most relevant policy and care questions. • Collaborate with policymakers and health system leaders to incorporate the resulting evidence into decision-making. • Evaluate the short- and long-term consequences of NPI policies on health (e.g., length and quality of life), economic (e.g., income, housing, and food security), psychosocial (e.g., community cohesion), and environmental (i.e., natural and built environment— e.g., biosafety and waste management) well-being. • Support the professional development of trainees and early career researchers within the evidence-based medicine and public health community. Deliverables Evidence-Informed Fellows (EIFs) are expected to regularly participate in Pandemic EVIDENCE Collaboration activities. This participation may include, but is not limited to, the following activities: • Attend collaboration meetings and provide updates on their ongoing research projects and activities. • Contribute meaningfully to Pandemic EVIDENCE Collaboration research projects. Contributions should meet co-authorship criteria defined by the International Committee of Medical Journal Editors • Co-author at least one peer-reviewed publication • Attend conferences affiliated with the Pandemic EVIDENCE Collaboration in-person: 1) Banff, Canada, May 2025 and 2) Oxford, United Kingdom, June 2026 • Present in-person (via poster or oral presentation) at one or both conferences affiliated with the Pandemic EVIDENCE Collaboration Progress will be reviewed by the Scientific Planning Committee annually and EIFs who are not on track to meet these deliverables will require discussions, planning and remedial actions to ensure deliverables will be met.  Term The term of each EIF shall end on 31 December 2026, unless extended, non-participation is agreed upon or terminated early by the Pandemic EVIDENCE Collaboration Scientific Planning Committee and the Operations Management Group. Reporting structure The Pandemic EVIDENCE Collaboration shall include no more than 18 EIFs; of which, four will be designated Founding EIFs (one from each Founding Partner organization). Evidence-Informed Fellows will report to the Scientific Planning Committee.  Meetings The EIFs will meet at the discretion of the Founding EIFs and/or Scientific Planning Committee. EIFs are encouraged to establish their own meeting schedule to work on specific projects identified by themselves and/or the Scientific Planning Committee. Management Support EIFs will be supported by the Founding EIFs and members of the Scientific Planning Committee as appropriate. EIFs may request feedback from any collaborators within the Pandemic EVIDENCE Collaboration as needed to fulfil their goals. There will be responsibility for the EIFs to report back to their line manager at their host institutions.  Renumeration EIFs will receive a £6500 travel and accommodation allowance for the duration of the Fellowship. Remaining funds can contribute to additional skills training (e.g., short courses, specific research skills development and visiting knowledge exchange programs at another institution). Funds will be held and managed at Kellogg College, University of Oxford. Expenses will be paid for by Kellogg College via re-imbursement following submission of receipts and approval or directly via invoice. Professional conduct and ethics  Confidentiality EIFs should assume all shared information and documents in the course of the work of the Evidence-Informed Fellowship by way of the Pandemic EVIDENCE Collaboration are confidential, unless explicitly stated otherwise by the Pandemic EVIDENCE Collaboration Management Committee. Transparency and COIs EIFs are expected to behave professionally. If a conflict of interest arises, or the appearance thereof, in the course of the work of the Evidence-Informed Fellowship, the individual involved must declare its existence and remove themselves from participating in the discussion or from any further participation in the Evidence-Informed Fellowship depending on the specific circumstances of the conflict of interest. Amendments to the terms of reference The terms of reference will be reviewed annually. Amendments to the terms of reference will be made by the Scientific Planning Committee and communicated to EIFs electronically and at the first scheduled meeting thereafter. Adapted with permission: McCall MacBain Foundation Annual Report https://www.kellogg.ox.ac.uk/wp-content/uploads/2024/12/PEC-MMF-Report-2023-24.pdf Fig. 1 (Abstract 8) Founding Evidence Informed Fellows. From left to right: Georgia Richards, Oyuka Byambasuren, Jessica Bartoszko, Jenine Leal Fig. 2 (Abstract 8) Founding Evidence Informed Fellows at Kellogg College. From left to right: Georgia Richards, Oyuka Byambasuren, Jessica Bartoszko, Jenine Leal Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. ",
  "metadata": {
    "Title of this paper": "The Pandemic EVIDENCE Collaboration",
    "Journal it was published in:": "BMC Proceedings",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486565/"
  }
}