{
  "title": "Paper_1007",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469924 PMC12469924.1 12469924 12469924 41009516 10.3390/ijms26188947 ijms-26-08947 1 Article Vitreous MMP-2, TIMP-1, and TIMP-2 Levels in Vitreoretinal Pathologies: A Prospective Analysis of 181 Eyes Al-Dwairi Rami Conceptualization Methodology Validation Investigation Resources Writing – original draft Visualization Supervision Project administration Funding acquisition 1 * https://orcid.org/0000-0002-9246-4974 El-Elimat Tamam Conceptualization Methodology Validation Investigation Software Resources Writing – review & editing Visualization Supervision Project administration 2 Aleshawi Abdelwahab Conceptualization Methodology Formal analysis Investigation Writing – original draft Visualization 1 * Al Sharie Ahmed Formal analysis Software Resources Investigation Writing – original draft Validation 3 Al Beiruti Seren Writing – original draft Data curation Formal analysis Validation 1 Sharayah Abdallah Writing – review & editing Validation Software Resources Investigation 1 Al Qudah Mohammad Software Validation Writing – original draft Data curation 1 Abu zreig Laith Methodology Validation Data curation Investigation 1 Awad Walaa Data curation Writing – review & editing Validation Methodology Investigation 1 Alzoubi Hosni Methodology Data curation Writing – original draft Resources Validation 1 Koulen Peter Academic Editor 1 2 3 * ramialdwairi@yahoo.com abdelwahhabjamal@yahoo.com 14 9 2025 9 2025 26 18 497349 8947 18 8 2025 09 9 2025 12 9 2025 14 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Little is known about the role of matrix metalloproteinases (MMPs) and their inhibitors (TIMPs) in the vitreous and retinal environments. This study aimed to assess the vitreous levels of members of the MMP and TIMP families in patients who were scheduled to undergo pars plana vitrectomy (PPV). Prospectively, all patients scheduled for PPV and who met the inclusion criteria were invited. The included retinal conditions were advanced proliferative diabetic retinopathy (PDR), rhegmatogenous retinal detachment (RRD), vitreomacular interface diseases, endophthalmitis, and dropped crystalline lenses. Undiluted vitreous samples were obtained during the early stage of PPV. The levels of TIMP1, TIMP2, MMP2, and TIMP2/MMP2 ratio were measured using enzyme-linked immunosorbent assay (ELISA). A total of 181 eyes were included in this study. The levels of TIMP2 and the TIMP2/MMP2 ratio were significantly higher in the advanced PDR group than in the other groups. Significantly, TIMP2 and TIMP2/MMP2 levels were highest in the endophthalmitis group, whereas MMP2 levels were highest in the dropped crystalline lenses group. The presence of diabetes mellitus and of preoperative glaucoma were significantly associated with higher TIMP1 levels. In RRD cases alone, all biomarkers were significantly elevated with higher PVR grades. Furthermore, TIMP1 and MMP2 correlated with macular detachment. A relationship between the vitreous levels of MMPs and TIMPs and the pathogenesis of vitreoretinal pathology may exist. Further studies and trials are recommended to explore the potential use of MMPs and TIMPs in the diagnosis, prognosis, and treatment of eye diseases. rhegmatogenous retinal detachment vitreous TIMP2 pars plana vitrectomy Jordan University of Science and Technology 20240218 This work was funded by a grant from the Deanship of Research, Jordan University of Science and Technology (Grant number: 20240218). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Extracellular matrix processing is mediated by matrix metalloproteinases (MMPs), a large family of zinc-dependent endopeptidases with variable substrate spectra, which have been described in human vitreous and aqueous [ 1 2 3 4 5 6 7 1 The extracellular matrix (ECM) is an essential component of ocular tissue, contributing to the structure of basement membranes as well as specialized matrices such as the vitreous gel and the interphotoreceptor matrix. The homeostasis of the ECM is governed by a finely regulated equilibrium between its synthesis and degradation [ 8 9 10 8 11 12 8 12 Within the ocular environment, MMPs are produced by several cell types, including fibroblasts, endothelial cells, and retinal pigment epithelial (RPE) cells, as well as infiltrating inflammatory cells such as macrophages, neutrophils, and lymphocytes. Their expression is regulated by numerous signaling molecules, including cytokines, growth factors, and hormones relevant to both physiological and pathological processes in the eye [ 13 14 15 Proliferative DR (PDR) is a common complication of diabetes mellitus (DM) characterized by preretinal neovascularization and development of epiretinal fibrovascular tissue [ 16 16 16 17 This study aimed to investigate the levels of certain MMPs and TIMPs in the vitreous of patients underwent pars plana vitrectomy (PPV) for various ocular vitreoretinal disorders. Furthermore, the study assessed the factors that might affect the levels of these biomarkers. 2. Results 2.1. General Demographic and Clinical Characteristics with Associated Visual Outcomes In this study, vitreous samples from 181 eyes of 177 patients were included. Of these, 115 (63.5%) samples were from men, and 98 eyes were right eyes (54.1%). The mean age of the patients was 53.3 years. General demographic characteristics are summarized in Table 1 p Comorbidities were also assessed, revealing significantly higher rates of DM, HTN and kidney diseases in the case group. Among patients with DM, the mean disease duration was 15.3 years. Of these, 41 (38.3%) were treated with oral hypoglycemic agents alone, while 66 (61.7%) received oral agents and/or insulin. The mean HBA1c percentage was significantly higher in the case group (7.69%) than in the control group (5.89%) ( p The average time from presentation to surgery was 26.5 weeks in the case group, compared to 5.6 weeks in the control group ( p Preoperative glaucoma was documented in 26 eyes, 11 of which were in the case group. Postoperative use of anti-glaucoma medications was noted in 77 eyes, with the majority (49 eyes) in the control group ( p In assessing visual outcomes using LogMAR charts, both groups had a similar average preoperative BCVA of 1.502, with no significant intergroup difference. One month after surgery, the case group showed significantly worse BCVA (1.035 LogMAR units versus 0.840 LogMAR units in the control group) ( p Table 1 Biochemical analysis and comparison of vitreous samples for TIMP1, TIMP2, MMP2, and the TIMP2/MMP2 ratio were performed between the case group and the control group. The mean concentrations and statistical comparisons are summarized in Table 2 p p p 2.2. Comparative Analysis Among Retinal Disease Subgroups A total of 181 eyes were stratified into the aforementioned five diagnostic and pathological subgroups of retinal disease and compared with demographic, systemic, surgical, and biochemical parameters ( Table 3 p p Cataract surgery associated with the primary PPV was most frequently observed in the advanced PDR group (52.5%). The type of vitreous tamponade varied significantly among the groups ( p p p Significant differences were observed in vitreous biomarker levels among the retinal disease subgroups. TIMP1 levels were highest in the endophthalmitis group (213,717.8 pg/mL) but did not reach statistical significance across groups ( p p p p 2.3. Factors Affecting the Level of Each Biomarker Separately in the Whole Sample The factors influencing the levels of TIMP1, TIMP2, MMP2, and TIMP2/MMP2 ratio in the study were evaluated ( Table 4 p p Regarding the TIMP2 levels, age, gender, and ocular parameters had no effect on the levels of TIMP2. Patients who had chronic kidney disease had higher levels of TIMP2 (33,453.5 pg/mL, p p p p The MMP2 levels were not associated with age, gender, or ocular parameters. Patients who had chronic kidney disease had higher levels of MMP2 (17.3 ng/mL, p p Regarding the TIMP2/MMP2 ratio, the age, gender, ocular parameters and presence of co-morbidities had no influence. The study revealed that the type of DM treatment significantly affected the ratio in which patients who used oral hypoglycemic agents alone, the ratio was 1.52, and the ratio of those who used oral hypoglycemic agents and/or insulin was 2.01 ( p p p 2.4. Factors Affecting the Levels of Biomarkers in RRD Patients A sub-analysis was performed on patients with RRD ( n Table 5 p p The location of the retinal tear had no significant influence on biomarker levels. Despite this, a trend toward higher TIMP1 levels was noted in eyes with inferior retinal tears (mean = 128,037.9 pg/mL) than in those with superior retinal tears (mean = 61,062.1 pg/mL), although this was not statistically significant ( p p p Furthermore, patients with advanced PVR (PVR grades C or D) exhibited significantly higher levels of TIMP1, TIMP2, and MMP2 than those with early-stage PVR (grades A or B). The presence of any grade of PVR was also associated with significantly higher biomarker levels compared to eyes without PVR. No significant correlations were found between biomarker levels and the presence of associated vitreous hemorrhage, preoperative glaucoma, or the postoperative use of antiglaucoma medications. Multiple regression analysis revealed that a higher grade of PVR was independently associated with higher levels of TIMP2. This is similar for MMP2 levels. Furthermore, higher grades of PVR and larger numbers of quadrants involved were independent factors for TIMP1 levels. 2.5. Factors Affecting the Levels of Biomarkers in Advanced PDR Patients Further sub-analysis was performed on patients with advanced PDR alone ( n p 3. Discussion This study was conducted to investigate the levels of certain MMPs and TIMPs in various ocular conditions and to assess the factors that may affect their levels. To the best of our knowledge, this is the first study in Jordanian populations and the first study to investigate five various ocular retinal pathologies (advanced PDR, RRD, vitreomacular interface diseases, endophthalmitis, and dropped lens). This study revealed that TIMP2 and the TIMP2/MMP2 ratio were significantly elevated in advanced PDR cases (case group). Moreover, endophthalmitis cases exhibited higher levels of TIMP2, whereas vitreomacular interface disorders showed lower levels of TIMP2. In addition, the TIMP2 levels and TIMP2/MMP2 ratio increased in patients with a longer DM duration and those who received insulin treatment. Furthermore, TIMP1 and MMP2 levels were significantly elevated in patients with preoperative glaucoma. Interestingly, MMP2 levels were significantly elevated in patients with chronic kidney diseases and increased significantly in patients with a dropped crystalline lens. In RRD cases, the three biomarkers were significantly elevated in cases of more extensive detachment and higher PVR grades. Furthermore, TIMP1 and MMP2 correlated with the detachment of the macula. In advanced PDR cases, the presence of diabetic ERM was associated with higher TIMP1 and TIMP2 levels. A disruption in the balance between MMPs and TIMPs can significantly alter ECM turnover, potentially contributing to pathological changes in ocular tissues, such as those observed in retinal detachment, cataract, retinoblastoma, glaucoma, age-related macular degeneration, and PVR [ 12 18 19 20 21 Regarding the role of TIMPs and MMPs in diabetic retinopathy, Ünal et al. investigated the levels of MMP9 and MMP14 in the PDR group and compared the levels to the non-PDR group [ 22 p 22 8 8 23 24 25 26 24 27 13 16 Elevated concentrations of TIMP1 observed in the subretinal fluid of patients with RRD may reflect an upregulation of TIMP1 expression by RPE cells, potentially as a protective mechanism aimed at preserving the integrity of the interphotoreceptor matrix and, consequently, photoreceptor viability [ 8 8 4 4 28 28 4 Interestingly, this study was the first work to correlate the vitreous (not the aqueous) levels of MMPs and TIMPs with glaucoma. We found that the levels of TIMP1 and MMP2 were higher in patients with glaucoma. Schlötzer-Schrehardt et al. measured the activity and levels of MMP1, MMP2, MMP3, MMP7, MMP9, MMP12, TIMP1, and TIMP2 in the aqueous humor of patients with pseudoexfoliative glaucoma, primary open-angle glaucoma, and cataract [ 3 3 29 30 Practically, MMP pharmacological inhibitors may be promising agents that may have an influence on many ocular diseases. Such examples of medications or agents that target the MMPs include doxycycline, which broadly inhibits many MMPs [ 31 32 33 34 35 36 There are few studies in literature investigating the factors affecting MMPs and TIMPs in the vitreous. Furthermore, many of these studies used bioequivalent living vitreous, while this study utilized human vitreous. The sample size in this study is relatively large. Moreover, the study comprised various retinal diseases in the analyses along with multiple patients and medical and ocular co-factors. However, no study is without limitations. As the variability of ocular conditions is considered a strengthening point, it is actually considered a limitation point. In addition, only TIMP1, TIMP2, and MMP2 were analyzed, many other MMPs and TIMPs may have a role in the ocular diseases. Third, the study had no classification for glaucoma and its types. In conclusion, the findings of this study may indicate a relationship between the MMP and the TIMP families and the development of certain vitreoretinal ocular conditions. Both MMPs and TIMPs may play crucial roles in the pathogenesis and progression of PDR, PVR formation, vitreomacular interface disease, endophthalmitis, and glaucoma. Furthermore, their expression and activity may be influenced by other co-factors. Furthermore, the ratio of MMP/TIMP levels may be as important as the individual levels of these biomarkers. We recommend further studies and trials to assess the role and potential use of MMPs and TIMPs in the diagnosis, prognosis, and treatment of eye diseases. In addition, further studies are needed to identify novel, therapeutic options modulating MMP and TIMP expression and activity, and these may slow the prevalence, development, and progression of eye diseases. 4. Materials and Methods 4.1. Patients and Data After obtaining the required ethical approval, vitreous samples were collected from patients who underwent PPV for any indication between October 2021 and June 2024. All patients who presented with the complaint of visual impairment and were scheduled for PPV with vitreoretinal pathology in the ocular examination were included in this study. The study was implemented at the Ophthalmology department at King Abdullah University Hospital (KAUH) and at the laboratories of Jordan University of Science and Technology. Written informed consent was obtained from all participants, and the study was conducted according to the tenets of the Declaration of Helsinki. Before the study, the participants were given detailed information about the purpose of the study and the procedures to be performed. Following a comprehensive review of the medical record, patients’ demographics and medical history were documented. The use of anti-glaucoma agents preoperatively and postoperatively was addressed. Furthermore, the previous ocular surgery, details of intravitreal anti-vascular endothelial growth factor (VEGF) injection, and panretinal photocoagulation laser sessions were allocated. Moreover, operative and postoperative information, including details of the vitreoretinal pathology, grading of the retinal findings, associated operative procedures, the type of utilized tamponade that was obtained, and the postoperative visual acuity. The primary outcome of the study was to measure and assess the factors influencing the vitreous levels of TIMP1, TIMP2, MMP2, and the TIMP2/MMP2 ratio. Secondary outcomes included the variations between vitreoretinal pathology, and their anatomical association with the aforementioned biomarkers. All patients who presented with vitreoretinal pathology that necessitated PPV were enrolled in the study. Eyes with the following conditions were excluded: a previously vitrectomized patient; penetrating eye injury; recent vitreous hemorrhage (VH) within two months; topical or systemic steroid treatment, where the procedure of obtaining vitreous sample may result in serious complications; and prior chemotherapy administration. The pathologies requiring PPV surgery were categorized within the following groups. The first was the advanced DR group, which comprised all diabetic patients in the proliferative diabetic retinopathy (PDR) stages and were unresponsive to medical treatment. These advanced PDR stages included traction retinal detachment (TRD) from fibrovascular membranes (FVM) proliferation, combined traction/rhegmatogenous retinal detachment, and/or non-clearing VH. DR was graded according to the modified Airlie house classifications [ 37 The investigated past medical history encompassed details of DM status (duration of DM, treatment of DM, and the level of last HbA1c), and the presence of hypertension, and chronic kidney diseases. Intravitreal anti-VEGF injections were utilized in most patients in the case group and in a minority of the control group (cases of ERM or VMT) preoperatively. The number, type, and duration of the last injection were included in the analysis. Either aflibercept or ranibizumab was utilized in this study. In addition, the effect of panretinal photocoagulation laser sessions was assessed. Hba1c and homocysteine levels were measured for all participants. A sub-analysis was run for RRD cases alone to correlate RRD characteristics with the vitreous levels of the biomarkers. The assessed characteristics of RRD were macular status (either the macula was attached or not), the location of the tear (superiorly or inferiorly), the number of quadrants of involvement, the grade of PVR, and the duration of symptoms of RRD. PVR was graded according to the Retina Society Terminology Committee (1983) classification [ 38 Another sub-analysis was performed for advanced PDR cases alone. The investigated features of the advanced PDR cases were the presence of VH, the presence of TRD, the occurrence of tears (complex retinal detachment), and the development of diabetic ERM or MH. 4.2. Perioperative Settings and Sample Collection Snellen visual acuity was established for each participant on the day of admission, one month and three months postoperatively, and the last follow-up visit. The visual acuity was then converted to the LogMAR best-corrected visual acuity (BCVA). Anterior and posterior segment examination was performed through slit-lamp biomicroscopy with the required non-contact hand-held lenses. Intraocular pressure (IOP) measurement was performed with applanation tonometry. As per our previous experiments [ 17 39 Vitreous samples were then transferred into 2 mL sterile tubes (Eppendorf, Freemont, CA, USA). They were kept at −80 °C and were defrosted only in small quantities for each analysis. The samples were labeled by the names of the participants and the hospital identification numbers and were given assigned serial numbers. 4.3. Sample Processing and Biomarker Measurement TIMP1, TIMP2, TIMP3, MMP1, MMP2, MMP3, and MMP9 were investigated, and the concentrations were determined using an enzyme-linked immunosorbent assay (ELISA) (R&D Systems, Minneapolis, MN, USA), executed in accordance with the manufacturer’s instructions. The solid-phase sandwich ELISA technique was adopted. Quality control samples and random analysis of the vitreous samples were performed. From initial investigation test analysis, only TIMP1 (DY970), TIMP2 (DY971), and MMP2 (DY902) were detected in the vitreous samples. Depending upon the detection range for each ELISA kit, the supernatant vitreous (after being centrifuged at 20,000× g After incubation, washing, and coating the ELISA plates (for all included biomarkers) with the capture antibody, an amount of 100 μL of the aforementioned diluted vitreous fluid was added to each well of the ELISA plate. The assay was performed in duplicate for each standard and vitreous sample. Antibodies against TIMP1, TIMP2, and MMP2 were added to each well of the ELISA plate. After the addition of the substrate mix solution, the reaction was halted by adding the stop solution after the development of color. Optical Density was read at 450 nm with the use of a microplate reader with wavelength correction of 540 nm to 570 nm using an absorption spectrophotometer (Bio-Tek Instruments, Winooski, VT, USA). A standard curve was generated out of measurements made with the standard solution and was used to determine the concentrations in each sample. The standardized ratio between TIMP2 and MMP2 was calculated and measured for associated factors. 4.4. Statistical Analysis Raw data were analyzed using the IBM statistical package for the social sciences (SPSS) v.26 (Armonk, New York, NY, USA). Data were expressed as frequency (percentage) or mean ± standard error of the mean (SEM). To verify normality, the Kolmogorov–Smirnov test was performed. It was found that the biomarkers levels were abnormally distributed. Accordingly, for continuous variables, Kruskal–Wallis’s test was employed to detect statistical significance, and the mean rank, along with the mean and SEM, was utilized for expression in our tables. For categorical variables, the statistical significance between the study groups was determined using the Chi-square test. Simple linear regression analysis was employed to estimate the effect size between two continuous variables (expressed as the B coefficient). Multiple logistic regression analyses were implemented to evaluate the predictive potential of TIMP1, TIMP2, and MMP2. p Disclaimer/Publisher’s Note: Author Contributions Conceptualization, R.A.-D., T.E.-E. and A.A.; methodology, R.A.-D., T.E.-E., S.A.B., A.A.S. and A.A.; software, S.A.B., A.S., M.A.Q. and W.A.; validation, R.A.-D. and T.E.-E.; formal analysis, A.A. and A.A.S.; investigation, A.A., T.E.-E., H.A., L.A.z. and A.S.; resources, R.A.-D., M.A.Q., W.A. and L.A.z.; data curation, A.S., M.A.Q., H.A. and W.A.; writing—original draft preparation, S.A.B., A.A., A.A.S., L.A.z. and R.A.-D.; writing—review and editing, T.E.-E., W.A. and A.S.; visualization, R.A.-D. and T.E.-E.; supervision, R.A.-D. and A.A.; project administration, R.A.-D.; funding acquisition, R.A.-D. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical approval was obtained from the Institutional Review Board of Jordan University of Science and Technology (number: 58/137/2021, date: 14 January 2021) and (number: 30/167/2024, date: 14 March 2024). All patients provided written informed consent before enrolment into the study. The study was conducted in accordance with the Declaration of Helsinki, good clinical practices, and relevant regulatory guidelines. Informed Consent Statement Written informed consent was obtained from all patients or their legal guardians (for children). Data Availability Statement The datasets used and/or analyzed during the current study are presented in tables and text. Conflicts of Interest The authors declare that they have no competing interests. References 1. De La Paz M.A. Itoh Y. Toth C.A. Nagase H. Matrix metalloproteinases and their inhibitors in human vitreous Investig. Ophthalmol. Vis. Sci. 1998 39 1256 1260 9620087 2. Brown D. Hamdi H. Bahri S. Kenney M.C. Characterization of an endogenous metalloproteinase in human vitreous Curr. Eye Res. 1994 13 639 647 10.3109/02713689408999899 7805394 3. Schlötzer-Schrehardt U. Lommatzsch J. Küchle M. Konstas A.G. Naumann G.O. Matrix metalloproteinases and their inhibitors in aqueous humor of patients with pseudoexfoliation syndrome/glaucoma and primary open-angle glaucoma Investig. Ophthalmol. Vis. Sci. 2003 44 1117 1125 10.1167/iovs.02-0365 12601038 4. Kon C.H. Occleston N.L. Charteris D. Daniels J. Aylward G.W. Khaw P.T. A prospective study of matrix metalloproteinases in proliferative vitreoretinopathy Investig. Ophthalmol. Vis. Sci. 1998 39 1524 1529 9660504 5. Sethi C.S. Bailey T.A. Luthert P.J. Chong N.H. Matrix metalloproteinase biology applied to vitreoretinal disorders Br. J. Ophthalmol. 2000 84 654 666 10.1136/bjo.84.6.654 10837397 PMC1723500 6. Tamiya S. Wormstone I.M. Marcantonio J.M. Gavrilovic J. Duncan G. Induction of matrix metalloproteinases 2 and 9 following stress to the lens Exp. Eye Res. 2000 71 591 597 10.1006/exer.2000.0916 11095911 7. Long H. Zhou B. Jiang F.G. Expression of MMP-2 and MMP-9 in retinoblastoma and their significance Int. J. Ophthalmol. 2011 4 489 491 10.3980/j.issn.2222-3959.2011.05.06 22553708 PMC3340721 8. Matsuo T. Okada Y. Shiraga F. Yanagawa T. TIMP-1 and TIMP-2 levels in vitreous and subretinal fluid Jpn. J. Ophthalmol. 1998 42 377 380 10.1016/S0021-5155(98)00038-0 9822966 9. Woessner J.F. Jr. Matrix metalloproteinases and their inhibitors in connective tissue remodeling FASEB J. 1991 5 2145 2154 10.1096/fasebj.5.8.1850705 1850705 10. Di Girolamo N. Verma M.J. McCluskey P.J. Lloyd A. Wakefield D. Increased matrix metalloproteinases in the aqueous humor of patients and experimental animals with uveitis Curr. Eye Res. 1996 15 1060 1068 10.3109/02713689609017656 8921246 11. Ghasemi H. Yaraee R. Faghihzadeh S. Ghassemi-Broumand M. Mahmoudi M. Babaei M. Naderi M. Safavi M. Ghazanfari Z. Rastin M. Tear and serum MMP-9 and serum TIMPs levels in the severe sulfur mustard eye injured exposed patients Int. Immunopharmacol. 2019 77 105812 10.1016/j.intimp.2019.105812 31677500 12. Lu B. Yin H. Tang Q. Wang W. Luo C. Chen X. Zhang X. Lai K. Xu J. Chen X. Multiple cytokine analyses of aqueous humor from the patients with retinitis pigmentosa Cytokine 2020 127 154943 10.1016/j.cyto.2019.154943 31810025 13. Caban M. Owczarek K. Lewandowska U. The Role of Metalloproteinases and Their Tissue Inhibitors on Ocular Diseases: Focusing on Potential Mechanisms Int. J. Mol. Sci. 2022 23 4256 10.3390/ijms23084256 35457074 PMC9026850 14. Theocharis A.D. Skandalis S.S. Gialeli C. Karamanos N.K. Extracellular matrix structure Adv. Drug Deliv. Rev. 2016 97 4 27 10.1016/j.addr.2015.11.001 26562801 15. Liu J. Khalil R.A. Matrix Metalloproteinase Inhibitors as Investigational and Therapeutic Tools in Unrestrained Tissue Remodeling and Pathological Disorders Prog. Mol. Biol. Transl. Sci. 2017 148 355 420 10.1016/bs.pmbts.2017.04.003 28662828 PMC5548434 16. Salzmann J. Limb G.A. Khaw P.T. Gregor Z.J. Webster L. Chignell A.H. Charteris D.G. Matrix metalloproteinases and their natural inhibitors in fibrovascular membranes of proliferative diabetic retinopathy Br. J. Ophthalmol. 2000 84 1091 1096 10.1136/bjo.84.10.1091 11004090 PMC1723275 17. Al-Dwairi R. El-Elimat T. Aleshawi A. Al Sharie A. Abu Mousa B. Beiruti S. Alkazaleh A. Mohidat H. Vitreous Levels of Vascular Endothelial Growth Factor and Platelet-Derived Growth Factor in Patients with Proliferative Diabetic Retinopathy: A Clinical Correlation Biomolecules 2023 13 1630 10.3390/biom13111630 38002312 PMC10669526 18. Weinreb R.N. Robinson M.R. Dibas M. Stamer W.D. Matrix Metalloproteinases and Glaucoma Treatment J. Ocul. Pharmacol. Ther. 2020 36 208 228 10.1089/jop.2019.0146 32233938 PMC7232675 19. Schuster A.K. Erb C. Hoffmann E.M. Dietlein T. Pfeiffer N. The Diagnosis and Treatment of Glaucoma Dtsch. Arztebl. Int. 2020 117 225 234 10.3238/arztebl.2020.0225 32343668 PMC7196841 20. Kowluru R.A. Zhong Q. Santos J.M. Matrix metalloproteinases in diabetic retinopathy: Potential role of MMP-9 Expert. Opin. Investig. Drugs 2012 21 681043 10.1517/13543784.2012.681043 22519597 PMC3802521 21. Mitchell P. Liew G. Gopinath B. Wong T.Y. Age-related macular degeneration Lancet 2018 392 1147 1159 10.1016/S0140-6736(18)31550-2 30303083 22. Ünal A. Baykal O. Öztürk N. Comparison of matrix metalloproteinase 9 and 14 levels in vitreous samples in diabetic and non-diabetic patients: A case control study Int. J. Retin. Vitr. 2022 8 44 10.1186/s40942-022-00394-0 PMC9210686 35729613 23. Jin M. Kashiwagi K. Iizuka Y. Tanaka Y. Imai M. Tsukahara S. Matrix metalloproteinases in human diabetic and nondiabetic vitreous Retina 2001 21 28 33 10.1097/00006982-200102000-00005 11217926 24. Abu El-Asrar A.M. Mohammad G. Nawaz M.I. Siddiquei M.M. Van den Eynde K. Mousa A. De Hertogh G. Opdenakker G. Relationship between vitreous levels of matrix metalloproteinases and vascular endothelial growth factor in proliferative diabetic retinopathy PLoS ONE 2013 8 e85857 10.1371/journal.pone.0085857 24392031 PMC3877391 25. Kowluru R.A. Santos J.M. Zhong Q. Sirt1, a negative regulator of matrix metalloproteinase-9 in diabetic retinopathy Investig. Ophthalmol. Vis. Sci. 2014 55 5653 5660 10.1167/iovs.14-14383 24894401 PMC4160094 26. Liao Z.Y. Liang I.C. Li H.J. Wu C.C. Lo H.M. Chang D.C. Hung C.F. Chrysin Inhibits High Glucose-Induced Migration on Chorioretinal Endothelial Cells via VEGF and VEGFR Down-Regulation Int. J. Mol. Sci. 2020 21 5541 10.3390/ijms21155541 32748894 PMC7432058 27. Abu El-Asrar A.M. Mohammad G. Allegaert E. Ahmad A. Siddiquei M.M. Alam K. Matrix metalloproteinase-14 is a biomarker of angiogenic activity in proliferative diabetic retinopathy Mol. Vis. 2018 24 394 406 29853773 PMC5957543 28. Symeonidis C. Papakonstantinou E. Souliou E. Karakiulakis G. Dimitrakos S.A. Diza E. Correlation of matrix metalloproteinase levels with the grade of proliferative vitreoretinopathy in the subretinal fluid and vitreous during rhegmatogenous retinal detachment Acta Ophthalmol. 2011 89 339 345 10.1111/j.1755-3768.2009.01701.x 19764916 29. Markiewicz L. Pytel D. Mucha B. Szymanek K. Szaflik J. Szaflik J.P. Majsterek I. Altered Expression Levels of MMP1, MMP9, MMP12, TIMP1, and IL-1β as a Risk Factor for the Elevated IOP and Optic Nerve Head Damage in the Primary Open-Angle Glaucoma Patients BioMed Res. Int. 2015 2015 812503 10.1155/2015/812503 26120586 PMC4442285 30. De Groef L. Andries L. Siwakoti A. Geeraerts E. Bollaerts I. Noterdaeme L. Etienne I. Papageorgiou A.P. Stalmans I. Billen J. Aberrant Collagen Composition of the Trabecular Meshwork Results in Reduced Aqueous Humor Drainage and Elevated IOP in MMP-9 Null Mice Investig. Ophthalmol. Vis. Sci. 2016 57 5984 5995 10.1167/iovs.16-19734 27820954 PMC5102567 31. Hidalgo M. Eckhardt S.G. Development of matrix metalloproteinase inhibitors in cancer therapy J. Natl. Cancer Inst. 2001 93 178 193 10.1093/jnci/93.3.178 11158186 32. Zhang H. Qi M. Li S. Qi T. Mei H. Huang K. microRNA-9 targets matrix metalloproteinase 14 to inhibit invasion, metastasis, and angiogenesis of neuroblastoma cells Mol. Cancer Ther. 2012 11 1454 1466 10.1158/1535-7163.MCT-12-0001 22564723 33. Hua Y. Xue J. Sun F. Zhu L. Xie M. Aspirin inhibits MMP-2 and MMP-9 expressions and activities through upregulation of PPARalpha/gamma and TIMP gene expressions in ox-LDL-stimulated macrophages derived from human monocytes Pharmacology 2009 83 18 25 10.1159/000166183 18971601 34. Zhou J. Jin B. Jin Y. Liu Y. Pan J. The antihelminthic drug niclosamide effectively inhibits the malignant phenotypes of uveal melanoma in vitro and in vivo Theranostics 2017 7 1447 1462 10.7150/thno.17451 28529629 PMC5436505 35. Reddy A.B. Ramana K.V. Srivastava S. Bhatnagar A. Srivastava S.K. Aldose reductase regulates high glucose-induced ectodomain shedding of tumor necrosis factor (TNF)-alpha via protein kinase C-delta and TNF-alpha converting enzyme in vascular smooth muscle cells Endocrinology 2009 150 63 74 10.1210/en.2008-0677 18772236 PMC2630901 36. Ozerdem U. Mach-Hofacre B. Cheng L. Chaidhawangul S. Keefe K. McDermott C.D. The effect of prinomastat (AG3340), a potent inhibitor of matrix metalloproteinases, on a subacute model of proliferative vitreoretinopathy Curr. Eye Res. 2000 20 447 453 10.1076/0271-3683(200006)2061-YFT447 10980656 37. Early Treatment Diabetic Retinopathy Study Research Group Grading diabetic retinopathy from stereoscopic color fundus photographs—An extension of the modified Airlie House classification. ETDRS report number 10 Ophthalmology 1991 98 786 806 10.1016/S0161-6420(13)38012-9 2062513 38. Hilton G. Machemer R. Michels R. Okun E. Schepens C. Schwartz A. The classification of retinal detachment with proliferative vitreoretinopathy Ophthalmology 1983 90 121 125 10.1016/S0161-6420(83)34588-7 6856248 39. Al-Dwairi R. El-Elimat T. Aleshawi A. Al Sharie A. Al Beiruti S. Sharayah A.K. Allouh M. Vitreous levels of pigment epithelium-derived factor and vascular endothelial growth factor in diabetic and non-diabetic retinopathy: Associated factors and anatomical correlation Int. J. Retin. Vitr. 2024 10 38 10.1186/s40942-024-00556-2 38773581 PMC11106866 ijms-26-08947-t001_Table 1 Table 1 Demographical details of study population ( n Variables Number (Percentage) or Mean ± SEM (Mean Rank) Overall n Case Group n Control Group n p  Age 53.3 ± 1.1 52.8 ± 1.2 (84.5) 53.8 ± 1.7 (96.1) 0.66  Gender     Male 115 (63.5) 46 (57.5) 69 (68.3) 0.08 Female 66 (36.5) 34 (42.5) 32 (31.7)   Eye laterality     Right eye (OD) 98 (54.1) 42 (52.5) 56 (55.4) 0.40 Left eye (OS) 83 (45.9) 38 (47.5) 45 (44.6)   Ocular parameters     Axial length (mm) 24.34 ± 0.2 23.61 ± 0.4 (38.3) 24.98 ± 0.3 (67.8) 0.02 Km (Diopter) 43.16 ± 0.3 43.44 ± 0.2 (59.5) 42.90 ± 0.1 (50.0) 0.39  Co-morbidities     DM 107 (59.6) 78 (97.5) 29 (28.7) 0.0001 Hypertension 102 (56.4) 60 (75.0) 42 (41.6) 0.001 End-stage renal disease 17 (9.4) 14 (17.5) 3 (3.0) 0.001  Treatment of DM     Oral hypoglycemic agents 41 (38.3) 22 (28.2) 19 (65.5) 0.001 Oral hypoglycemic agents and/or insulin 66 (61.7) 56 (71.8) 10 (34.5)   Duration of DM (years) 15.3 ± 0.7 17.4 ± 0.8 (54.7) 8.9 ± 1.0 (27.0) 0.0001  Preoperative diagnosis     Advanced PDR (FVM and VH) 80 (44.2) 80 (100.0) 0 (0.0)  Rhegmatogenous Retinal Detachment 65 (35.9) 0 (0.0) 65 (64.4)  Vitreomacular interface diseases (ERM/MH/VMT) 17 (9.4) 0 (0.0) 17 (16.8) 0.0001 Endophthalmitis 5 (2.8) 0 (0.0) 5 (5.0)  Dropped IOL or crystalline lens 14 (7.7) 0 (0.0) 14 (13.9)   Associated cataract surgery with the primary PPV 65 (35.9) 42 (52.5) 23 (22.8) 0.0001  Duration from presentation for surgery (weeks) 15.5 ± 1.8 26.5 ± 3.1 (112.8) 5.6 ± 1.2 (53.2) 0.0001  Type of vitreous tamponade     Silicone oil 95 (52.5) 32 (40.0) 63 (62.4)  Gas 49 (27.1) 28 (35.0) 21 (20.8) 0.011 Air 37 (20.4) 20 (25.0) 17 (16.8)   Preoperative glaucoma 26 (14.4) 11 (13.8) 15 (14.9) 0.50  Postoperative AG use 77 (42.5) 28 (35.0) 49 (48.5) 0.047  Visual outcomes (Log MAR)     Preoperative BCVA 1.502 ± 0.03 1.582 ± 0.04 (97.6) 1.437 ± 0.06 (84.8) 0.21 BCVA after 1 month 0.926 ± 0.01 1.035 ± 0.03 (99.1) 0.840 ± 0.02 (82.0) 0.023 BCVA after 3 months 0.947 ± 0.02 1.108 ± 0.03 (85.4) 0.831 ± 0.01 (68.6) 0.006 BCVA at the last follow-up 0.911 ± 0.01 1.038 ± 0.05 (96.5) 0.809 ± 0.02 (83.9) 0.025  HBA1c (%) 7.69 ± 0.2 9.73 ± 0.3 (108.8) 5.89 ± 0.2 (46.3) 0.0001  Homocystein (mcmol/L) 22.0 ± 2.5 21.5 ± 4.2 (28.9) 22.6 ± 2.6 (34.2) 0.84 Abbreviations: ijms-26-08947-t002_Table 2 Table 2 Measured biomarkers in vitreous samples in both groups. Measured Markers Mean ± SEM (Mean-Rank) Overall n Case Group n Control Group n p TIMP1 (pg/mL) 107,474.5 ± 1029.1 113,284.8 ± 1595.1 (89.7) 102,909.9 ± 1359.6 (86.7) 0.69 TIMP2 (pg/mg) 28,553.2 ± 739.7 29,310.8 ± 883.4 (100.3) 27,953.5 ± 745.1 (83.6) 0.021 MMP2 (ng/mL) 15.6 ± 0.7 15.4 ± 0.6 (94.3) 15.8 ± 0.5 (88.4) 0.46 TIMP2/MMP2 ratio 1.92 ± 0.1 1.93 ± 0.08 (99.8) 1.90 ± 0.07 (83.9) 0.043 Abbreviations: ijms-26-08947-t003_Table 3 Table 3 A comparative analysis between all groups of retinal diseases. Variables Number (Percentage) or Mean ± SEM (Mean Rank) Advanced PDR n RRD n Vitreomacular Disease n Endophthalmitis n Dropped IOL/Lens n p  Age 52.8 ± 1.2 (84.5) 51.4 ± 1.4 (85.5) 59.6 ± 0.9 (119.7) 33.4 ± 11.8 (47.1) 65.2 ± 2.7 (134.3) 0.001  Gender       Male 46 (57.5) 47 (72.3) 11 (64.7) 1 (20.0) 10 (71.4) 0.09 Female 34 (42.5) 18 (27.7) 6 (35.3) 4 (80.0) 4 (28.6)   Co-morbidities       Diabetes mellitus 78 (97.5) 15 (23.1) 6 (35.3) 0 (0.0) 8 (57.1) 0.001 Hypertension 60 (75.0) 22 (33.8) 8 (47.1) 2 (40.0) 10 (71.4) 0.001 Chronic kidney disease 14 (17.5) 1 (1.5) 1 (5.9) 0 (0.0) 1 (7.1) 0.019  Duration of diabetes mellitus (years) 17.4 ± 0.5 (54.7) 6.6 ± 0.2 (18.5) 15.3 ± 0.6 (51.0) - 10.6 ± 0.7 (31.9) 0.001  Associated cataract surgery with the primary PPV 42 (52.5) 10 (15.4) 7 (41.2) 2 (40.0) 4 (28.6) 0.001  Duration from presentation for surgery (weeks) 26.5 ± 3.1 (112.8) 2.8 ± 1.1 (38.1) 16.9 ± 1.5 (97.8) 0.6 ± 0.1 (29.0) 4.0 ± 1.4 (64.6) 0.001  Type of vitreous tamponade       Silicone oil 32 (40.0) 57 (87.7) 1 (5.9) 3 (60.0) 2 (14.3)  Gas 28 (35.0) 4 (6.2) 14 (82.4) 2 (40.0) 1 (7.1) 0.001 Air 20 (25.0) 4 (6.2) 2 (11.8) 0 (0.0) 11 (78.6)   Preoperative glaucoma 11 (13.8) 4 (6.2) 3 (17.6) 1 (20.0) 7 (50.0) 0.001  Postoperative AG use 28 (35.0) 37 (56.9) 3 (17.6) 2 (40.0) 7 (50.0) 0.017  HBA1c (%) 9.7 ± 0.4 (108.8) 5.4 ± 0.2 (37.4) 6.7 ± 0.6 (60.7) 4.9 ± 0.1 (4.5) 7.1 ± 0.6 (43.3) 0.001  Homocysteine (mcmol/L) 21.5 ± 4.2 (28.9) 24.2 ± 2.4 (36.6) 24.6 ± 2.7 (37.8) 20.9 ± 5.6 (29.5) 14.9 ± 1.8 (23.6) 0.45  Vitreous biomarkers       TIMP1 (pg/mL) 113,284.7 ± 5957.1 (89.7) 85,907.2 ± 2597.1 (81.9) 71,862.7 ± 1409.6 (76.4) 114,542.9 ± 3973.5 (87.8) 21,1751.8 ± 8758.2 (119.5) 0.12 TIMP2 (pg/mg) 29,310.8 ± 883.3 (100.3) 28,714.9 ± 375.1 (86.7) 15,182.4 ± 532.1 (50.4) 64,800.0 ± 8356 (127.6) 26,763.1 ± 739 (94.4) 0.003 MMP2 (ng/mL) 15.4 ± 0.7 (94.3) 16.5 ± 0.5 (91.2) 9.9 ± 1.1 (56.0) 17.0 ± 1.2 (90.0) 19.2 ± 1.1 (114.4) 0.03 TIMP2/MMP2 ratio 1.93 ± 0.07 (99.8) 1.72 ± 0.08 (83.9) 1.64 ± 0.08 (78.8) 6.49 ± 2.6 (156.0) 1.46 ± 0.1 (64.9) 0.004 Abbreviations: ijms-26-08947-t004_Table 4 Table 4 Factors affecting the level of each biomarker separately in the whole sample. Variables Mean ± SEM (Mean Rank) or B Regression Coefficient ± SEM TIMP1 (pg/mL) p TIMP2 (pg/mg) p MMP2 (ng/mL) p TIMP2/MMP2 Ratio p  Age 1236.7 ± 876 0.07 −74.3 ± 115 0.52 −0.23 ± 0.47 0.63 −0.01 ± 0.07 0.16  Gender         Male 98,534.4 ± 1294 (87.3) 0.41 27,491.2 ± 280 (88.6) 0.43 15.3 ± 1.1 (88.7) 0.80 1.84 ± 0.07 (90.6) 0.89 Female 12,2981.1 ± 1216 (89.7)  30,402.5 ± 352 (95.2)  16.1 ± 0.9 (95.1)  2.06 ± 0.2 (91.6)   Ocular parameters         Axial length (mm) −3349.9 ± 121 0.42 565.4 ± 706 0.42 0.05 ± 0.3 0.87 0.02 ± 0.01 0.30 Km (Diopter) −558.2 ± 811 0.88 −217.7 ± 654 0.74 0.04 ± 0.3 0.88 −0.01 ± 0.02 0.39  Co-morbidities         DM 119,801.2 ± 4373 (93.5) 0.036 27,586.2 ± 577 (94.5) 0.19 15.5 ± 0.7 (94.0) 0.19 1.82 ± 0.06 (90.9) 0.60 Hypertension 112,793.1 ± 4321 (90.9) 0.91 27,620.6 ± 117 (90.4) 0.72 15.0 ± 0.8 (90.0) 0.72 1.90 ± 0.09 (91.1) 0.63 Chronic kidney disease 149,788.9 ± 6275 (111.0) 0.057 33,453.5 ± 628 (115.5) 0.043 17.3 ± 1.4 (108.8) 0.039 1.96 ± 0.1 (109.7) 0.12  Treatment of DM         Oral hypoglycemic agents 141,009.3 ± 6226 (56.7) 0.94 22,961.4 ± 189 (45.2) 0.007 15.2 ± 1.1 (56.7) 0.22 1.52 ± 0.07 (41.3) 0.001 Oral hypoglycemic agents and/or insulin 107,076.4 ± 6739 (50.0)  30,459.1 ± 100 (59.5)  15.6 ± 0.8 (49.9)  2.01 ± 0.09 (61.8)   Duration of DM (years) 2237.7 ± 901 0.24 534.6 ± 179 0.004 0.064 ± 0.08 0.45 0.04 ± 0.008 0.0001  Preoperative diagnosis         Advanced PDR (FVM and VH) 113,284.7 ± 5957.1 (89.7)  29,310.8 ± 883.3 (100.3)  15.4 ± 0.7 (94.3)  1.93 ± 0.07 (99.8)  Rhegmatogenous Retinal Detachment 85,907.2 ± 2597.1 (81.9) 0.12 28,714.9 ± 375.1 (86.7) 0.003 16.5 ± 0.5 (91.2) 0.03 1.72 ± 0.08 (83.9) 0.004 Vitreomacular interface diseases (ERM/MH/VMT) 71,862.7 ± 1409.6 (76.4)  15,182.4 ± 532.1 (50.4)  9.9 ± 1.1 (56.0)  1.64 ± 0.08 (78.8)  Endophthalmitis 114,542.9 ± 3973.5 (87.8)  64,800.0 ± 8356 (127.6)  17.0 ± 1.2 (90.0)  6.49 ± 2.6 (156.0)  Dropped IOL or crystalline lens 211,751.8 ± 8758.2 (119.5)  26,763.1 ± 739 (94.4)  19.2 ± 1.1 (114.4)  1.46 ± 0.1 (64.9)   Associated cataract surgery with the primary PPV 119,650.5 ± 7850 (94.2) 0.22 30,288.1 ± 750 (88.8) 0.67 16.3 ± 1.4 (91.7) 0.89 2.02 ± 0.2 (89.6) 0.78  Duration from presentation for surgery (weeks) 27.5 ± 153 0.95 −46.1 ± 72 0.53 −0.02 ± 0.03 0.55 0.001 ± 0.003 0.98  Type of vitreous tamponade         Silicone oil 110,720.2 ± 4511 (88.2)  30,477.3 ± 901 (92.3)  16.4 ± 1.1 (93.7)  1.94 ± 0.2 (88.8)  Gas 78,956.4 ± 5142 (78.3) 0.15 24,710.7 ± 413 (83.2) 0.41 13.9 ± 0.8 (82.2) 0.38 1.82 ± 0.1 (88.6) 0.51 Air 137,148.1 ± 7892 (100.5)  28,701.3 ± 564 (97.9)  15.8 ± 0.9 (95.9)  1.99 ± 0.1 (99.7)   Preoperative glaucoma 176,623.6 ± 6235 (109.5) 0.018 33,336.9 ± 189 (105.4) 0.13 18.9 ± 1.6 (111.2) 0.034 1.77 ± 0.09 (92.4) 0.88  Postoperative AG use 93,821.2 ± 2289.1 (85.4) 0.82 29,030.9 ± 717.5 (91.9) 0.77 16.3 ± 1.3 (92.3) 0.55 1.84 ± 0.1 (90.4) 0.89  HBA1c (%) 3080.1 ± 663 0.39 130.7 ± 72 0.85 0.11 ± 0.2 0.72 −0.03 ± 0.04 0.55 Abbreviations: ijms-26-08947-t005_Table 5 Table 5 Factors affecting the level of each biomarker separately in patients with RRD only. Variables Mean ± SEM (Mean Rank) or B Regression Coefficient ± SEM TIMP1 (pg/mL) p TIMP2 (pg/mg) p MMP2 (ng/mL) p  Age 555.4 ± 84.7 0.51 99.1 ± 105.1 0.63 −0.06 ± 0.9 0.95  Gender       Male 77,246.4 ± 1905 (31.5) 0.98 29,834.5 ± 507 (32.3) 0.64 16.4 ± 1.5 (32.1) 0.53 Female 108,835.6 ± 1472 (31.4)  25,792.9 ± 260 (34.8)  16.6 ± 1.1 (35.4)   Ocular parameters       Axial length (mm) −1364.7 ± 170 0.74 1640.3 ± 700.7 0.34 0.58 ± 0.79 0.47  Co-morbidities       Diabetes mellitus 95,311.0 ± 6368 (34.3) 0.49 21,388.9 ± 890 (28.2) 0.26 13.2 ± 2.1 (28.1) 0.25 Hypertension 67,560.1 ± 3084 (29.5) 0.52 22,916.8 ± 268 (32.0) 0.77 14.8 ± 1.7 (31.9) 0.73  Macula status       Macula on 69,577.4 ± 2300 (24.1) 0.02 20,661.4 ± 693 (27.9) 0.11 12.4 ± 1.7 (25.5) 0.01 Macula off 94,272.4 ± 2411 (35.3)  33,125.2 ± 904 (35.8)  18.7 ± 2.1 (37.1)   Duration of RRD (days) −179.4 ± 242 0.88 6.7 ± 95.4 0.98 −0.01 ± 0.2 0.99  Location of the tear       Within the superior half 61,062.1 ± 983 (28.5) 0.08 27,370.3 ± 251 (32.0) 0.59 15.6 ± 2.0 (31.3) 0.36 Within the inferior half 128,037.9 ± 1813 (36.6)  31,012.0 ± 639 (34.7)  17.9 ± 2.4 (35.8)   Number of involved quadrants       One or two quadrants 61,176.6 ± 703 (23.6) 0.0001 20,702.3 ± 855 (26.2) 0.001 12.1 ± 1.3 (25.4) 0.001 Three or four quadrants 115,939.1 ± 5097 (41.1)  39,303.6 ± 406 (41.9)  22.2 ± 2.8 (43.0)   Associated vitreous hemorrhage 33,513.1 ± 822  20,942.9 ± 513  11.2 ± 4.2   Grade of PVR       No PVR 47,373.2 ± 379 (24.2) 0.0001 20,755.9 ± 323 (25.8) 0.0001 11.6 ± 1.2 (25.0) 0.001 Grade A or B 72,270.2 ± 422 (29.8)  26,738.8 ± 789 (32.2)  15.2 ± 1.8 (32.5)  Grade C or D 19,6058.5 ± 858 (51.2)  51,806.7 ± 478 (52.5)  30.7 ± 4.9 (54.1)   Preoperative glaucoma 236,404.3 ± 2597 (44.5) 0.14 26,801.7 ± 593 (36.8) 0.69 18.5 ± 5.3 (36.3) 0.72  Postoperative AG use 66,365.7 ± 2253 (29.9) 0.48 27,633.7 ± 745 (31.6) 0.32 16.0 ± 2.3 (31.0) 0.39  Homocystein 720.2 ± 79 0.42 354.2 ± 23 0.29 0.13 ± 0.12 0.31 Abbreviations: ",
  "metadata": {
    "Title of this paper": "Vitreous levels of pigment epithelium-derived factor and vascular endothelial growth factor in diabetic and non-diabetic retinopathy: Associated factors and anatomical correlation",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469924/"
  }
}