{
  "title": "Paper_188",
  "abstract": "Clin Microbiol Rev Clin Microbiol Rev 85 cmr cmr Clinical Microbiology Reviews 0893-8512 1098-6618 American Society for Microbiology (ASM) PMC11629636 PMC11629636.1 11629636 11629636 39360834 10.1128/cmr.00080-23 cmr00080-23 cmr.00080-23 1 Review antimicrobial-chemotherapy Antimicrobial Chemotherapy Toward better cures for Mycobacterium abscessus https://orcid.org/0000-0001-9470-5009 Dartois Véronique  1  2 Visualization Writing – original draft Writing – review and editing veronique.dartois@hmh-cdi.org * https://orcid.org/0000-0002-9604-9452 Dick Thomas  1  2  3 Writing – original draft Writing – review and editing * 1 Center for Discovery and Innovation, Hackensack Meridian Health Nutley New Jersey USA 2 Department of Medical Sciences, Hackensack Meridian School of Medicine Nutley New Jersey USA 3 Department of Microbiology and Immunology, Georgetown University Washington, DC USA Editor Fang Ferric C. University of Washington School of Medicine Seattle Washington USA Address correspondence to Véronique Dartois, veronique.dartois@hmh-cdi.org The authors declare no conflict of interest. 12 2024 03 10 2024 37 4 476686 e00080-23 03 10 2025 03 10 2025 11 12 2024 03 10 2025 Copyright © 2024 American Society for Microbiology. 2024 American Society for Microbiology. https://doi.org/10.1128/ASMCopyrightv2 All Rights Reserved SUMMARY The opportunistic pathogen Mycobacterium abscessus M. abscessus in vitro KEYWORDS Mycobacterium abscessus infectious disease multidrug regimens drug discovery and development HHS | NIH | National Institute of Allergy and Infectious Diseases (NIAID) R01AI132374, U19 AI142731 Dartois Véronique Dick Thomas pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date December 2024 ",
  "metadata": {
    "Title of this paper": "Toward better cures for ",
    "Journal it was published in:": "Clinical Microbiology Reviews",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11629636/"
  }
}