{
  "title": "Paper_528",
  "abstract": "pmc Cancer Commun (Lond) Cancer Commun (Lond) 3437 canccomms CAC2 Cancer Communications 2523-3548 Wiley PMC12479131 PMC12479131.1 12479131 12479131 40474555 10.1002/cac2.70039 CAC270039 1 Original Article Original Article Associations of body mass index and waist circumference with incidence of overall and of 27 site‐specific cancers: a population‐based retrospective cohort study KIM et al. Kim Seonghye  1 Kim Bongseong  2 Jung Kyu‐won  3  4 Nam Ga Eun  5 Jung Wonyoung  6 Park Junhee  7 Han Kyung‐Do  2 hkd917@naver.com Shin Dong Wook https://orcid.org/0000-0001-8128-8920  8  9  10 dwshin.md@gmail.com   1 International Healthcare Center Samsung Medical Center Sungkyunkwan University School of Medicine Seoul Republic of Korea   2 Department of Statistics and Actuarial Science Soongsil University Seoul Republic of Korea   3 Korea Central Cancer Registry National Cancer Center Goyang Republic of Korea   4 Division of Cancer Registration and Surveillance National Cancer Control Institute National Cancer Center Goyang Republic of Korea   5 Department of Family Medicine Korea University Guro Hospital Korea University College of Medicine Seoul Republic of Korea   6 Division of Cardiology Department of Medicine Perelman School of Medicine University of Pennsylvania Philadelphia Pennsylvania USA   7 Total Healthcare Center Kangbuk Samsung Hospital Sungkyunkwan University School of Medicine Seoul Republic of Korea   8 Department of Family Medicine & Supportive Care Center Samsung Medical Center Sungkyunkwan University School of Medicine Seoul Republic of Korea   9 Department of Clinical Research Design and Evaluation Samsung Advanced Institute for Health Science and Technology (SAIHST) Sungkyunkwan University Seoul Republic of Korea   10 Department of Digital Health Samsung Advanced Institute for Health Science and Technology (SAIHST) Sungkyunkwan University Seoul Republic of Korea * Correspondence dwshin.md@gmail.com hkd917@naver.com 05 6 2025 9 2025 45 9 497818 10.1002/cac2.v45.9 1075 1089 29 4 2025 01 7 2024 27 5 2025 05 06 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Cancer Communications https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Background Overweight and obesity are known risk factors for cancer. The aim of this study was to investigate associations of body mass index (BMI) and waist circumference (WC) with incidence of 27 site‐specific cancers stratified by sex and menopausal status accounting for non‐linearity. Methods We performed a population‐based retrospective cohort study using the Korean National Health Insurance Service (KNHIS 2009‐2020) database. We included 3,986,155 participants (aged ≥ 20 years), and the mean follow‐up duration was 9.0 ± 1.6 years. The primary outcome was the incidence of cancer. Results There were positive associations between BMI or WC and incidences of cancers including overall cancer, digestive tract cancer (except for esophageal cancer), hepato‐bilio‐pancreatic cancer, hematological cancer, sex‐specific cancers, brain/central nervous system (postmenopausal women), thyroid, renal, and bladder cancers. We observed inverse associations for several cancers, including lung and laryngeal cancers. Conclusions Our findings of differential associations of BMI and WC with incidence of various cancers contribute to the understanding of the relationship between obesity and cancer risk in Asian populations. These results may provide evidence to support the implementation of active surveillance and targeted management strategies for obesity. Obesity Abdominal obesity Adiposity marker Body mass index Waist circumference Cancer Korean Foundation for Cancer Research 10.13039/501100004082 CB‐2022‐A‐1 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Kim S Kim B Jung KW Nam GE Jung W Park J Associations of body mass index and waist circumference with incidence of overall and of 27 site‐specific cancers: a population‐based retrospective cohort study Cancer Commun 2025 45 1075 1089 10.1002/cac2.70039 PMC12479131 40474555 Abbreviations BMI body mass index CI confidence interval CNS central nervous system df degrees of freedom HL Hodgkin's lymphoma H. pylori Helicobacter pylori HR hazard ratio ICD‐10 International Classification of Diseases, 10th revision KCCR Korea Central Cancer Registry KNHIS Korean National Health Insurance System MM multiple myeloma NHL non‐Hodgkin's lymphoma UK United Kingdom WC waist circumference 1 BACKGROUND Overweight and obesity are known risk factors for several cancers [ 1 2 3 4 5 6 7 8 9 10 10 Increased cancer incidences associated with higher adiposity markers including body mass index (BMI) and waist circumference (WC) were reported for overall cancers [ 1 2 3 4 5 6 7 8 9 11 12 11 12 12 13 14 1 15 16 12 17 18 17 18 19 12 20 5 21 5 21 5 21 22 23 24 25 26 25 27 25 27 25 27 28 29 3 5 8 2 8 30 31 5 6 32 33 2 2 4 6 9 2 6 7 9 Third, comprehensive considerations of associations between sex difference and menopausal status and various site‐specific cancers were not conducted in many studies [ 2 6 9 34 35 2 5 9 Finally, relatively few studies on obesity‐cancer relationships were published in Asian countries. Asians tend to have a higher percentage of body fat and higher accumulation of visceral adipose tissue compared to Caucasians [ 36 37 5 9 2 6 7 9 In this regard, this present study aimed to investigate associations of BMI and WC with incidences from overall cancer and 27 site‐specific cancers among the Korean population accounting for potential non‐linearity after stratification by sex and menopausal status. 2 MATERIALS AND METHODS 2.1 Data source This study was conducted using the Korean National Health Insurance System (KNHIS) database. The KNHIS is a single insurer that provides comprehensive medical coverage to nearly the whole Korean population because approximately 97% of the population are mandatory subscribers to the KNHIS and the remaining 3% of the population are covered by the Medical Aid program. Furthermore, the KNHIS manages all administrative processes and reimbursements for medical providers and pharmacies based on claims data. Employees and self‐employees who pay insurance premiums (regardless of age) and all individuals aged ≥ 40 years can participate in biennial general health examinations [ 38 2.2 Study population We obtained data of 40% participants randomly sampled from individuals (aged ≥ 20 years ) n n 2 5 7 9 n 1 FIGURE 1 Flow chart of study enrollment 2.3 Assessment of adiposity We used BMI and WC as indicators of general and abdominal obesity, respectively. Anthropometric data including body weight and height were measured directly using a stadiometer and a scale, respectively. BMI was calculated by dividing body weight in kilograms into the square of height in meters (kg/m 2 2 39 40 41 2.4 Study outcomes and follow‐up The primary outcome of this study was the incidence of cancer, as represented by ICD‐10 cancer diagnosis codes in the KNHIS database: oral cavity (C00‐06), esophagus (C15), stomach (C16), colon (C18‐19), rectal (C20), liver (C22.0), biliary tract (C22.1, C24), gallbladder (C23), pancreatic (C25), laryngeal (C32), lung (C33‐34), malignant melanoma (C43), breast (C50), cervical (C53), uterine (C54), ovarian (C56), prostate (C61), testicular (C62), renal (C64), bladder (C67), brain/CNS (C71‐72), thyroid (C73), Hodgkin's lymphoma (HL) (C81), non‐Hodgkin's lymphoma (NHL) (C82‐85), MM (C90), lymphoid leukemia (C91), and myeloid leukemia (C92). In Korea, patients who are diagnosed with cancer are registered with the Korea Central Cancer Registry (KCCR) and rare and intractable disease registration program to receive reduced medical expenses for at least five years. The sensitivity for cancer patient verification based on the KNHIS database is greater than 90% (lowest in colorectal cancer, 91.5%; highest in breast cancer, 98.1%) validated with the KCCR database, which is a nationwide, hospital‐based cancer registry [ 42 5 26 43 2.5 Covariates Income levels were divided into four groups, and we assigned the lowest 25% income group as the first quartile (Q1) according to the monthly insurance premiums. Comorbidities of hypertension, diabetes mellitus, and dyslipidemia were identified based on ICD‐10 codes from claims data before the health examination date. Hypertension was defined as at least one claim for I10–I11 or a prescription for antihypertensive medications. Diabetes mellitus was defined as at least one claim for E10–E14 or a prescription for antidiabetic medications. Dyslipidemia was defined as at least one claim for E78 or a prescription for lipid‐lowering medications. Smoking status was divided into three groups: never smokers, ex‐smokers, and current smokers. Alcohol intake was divided into three groups: non‐drinkers, mild drinkers (< 30 g/day), and heavy drinkers (≥ 30 g/day). Regular exercise was defined as moderate intensity activity for more than 30 minutes per session and ≥ five days per week or vigorous activity for more than 20 minutes per session and ≥ three days per week. 2.6 Statistical analyses Descriptive statistics were conducted using Student's t‐test for continuous variables and the chi‐square test for categorical variables according to status of general obesity (BMI ≥ 25 kg/m 2 40 41 5 9 44 45 46 47 2 48 49 49 50 51 52 P 53 54 55 56 3 RESULTS 3.1 Baseline characteristics In this study, a total of 3,986,155 participants were included, and the number of incident cancer cases was 242,243 (6.1%) over a mean follow‐up of 9.0 ± 1.6 years (median, 9.3 years; range, 9.1−9.6 years). The mean age of overall participants was 46.7 ± 14.0 years (median, 46.0 years; range, 36.0−56.0 years), and 55.4% were male. The proportions of chronic diseases (hypertension, diabetes mellitus, and dyslipidemia), current smoking, and heavy alcohol intake were higher among participants with general obesity or abdominal obesity than those without such conditions. Participants with general obesity performed regular exercise more frequently (19.5%) than those without obesity (Table 1 S1‐S3 2 TABLE 1 Baseline characteristics of the study population General obesity Abdominal obesity Characteristic Overall population ( n Present  a n Absent  b n  p  c Present  d n Absent  e n  p  f Age (years) 46.7 ± 14.0 48.5 ± 13.3 45.8 ± 14.2 <0.001 51.7 ± 14.0 45.5 ± 13.7 <0.001 Sex (%) <0.001 <0.001 Men 2,207,727 (55.4) 823,332 (63.1) 1,384,395 (51.6) 466,237 (59.9) 1,741,490 (54.3) Women 1,178,428 (44.6) 481,881 (36.9) 764,577 (28.5) 311,598 (40.1) 1,466,830 (45.7) Premenopausal (age <50) 929,240 (23.3) 164,663 (12.6) 764,577 (28.5) 78,463 (10.1) 850,777 (26.5) Postmenopausal (age ≥50) 849,188 (21.3) 317,218 (24.3) 531,970 (19.9) 233,135 (30.0) 616,053 (19.2) Income <0.001 <0.001 Q1, lowest 25% 851,999 (21.4) 266,103 (20.4) 585,896 (21.9) 159,239 (20.5) 692,760 (21.6) Q2 895,925 (22.5) 268,119 (20.5) 627,806 (23.4) 155,140 (19.9) 740,785 (23.1) Q3 1,068,826 (26.8) 358,178 (27.5) 710,648 (26.5) 209,746 (27.0) 859,080 (26.8) Q4, highest 25% 1,169,405 (29.3) 412,813 (31.6) 756,592 (28.2) 253,710 (32.6) 915,695 (28.5) Body mass index (kg/m 2 23.7 ± 3.2 27.3 ± 2.2 22.0 ± 2.0 <0.001 27.5 ± 2.8 22.8 ± 2.6 <0.001 Waist circumference (cm) 80.2 ± 9.1 88.2 ± 7.0 76.4 ± 7.3 <0.001 92.7 ± 5.2 77.2 ± 7.0 <0.001 Comorbidities Hypertension 1,057,421 (26.5) 512,006 (39.2) 545,415 (20.3) <0.001 366,827 (47.2) 690,594 (21.5) <0.001 Diabetes mellitus 337,711 (8.5) 164,472 (12.6) 173,239 (6.5) <0.001 128,457 (16.5) 209,254 (6.5) <0.001 Dyslipidemia 716,570 (18.0) 337,592 (25.9) 378,978 (14.1) <0.001 230,427 (29.6) 486,143 (15.2) <0.001 Smoking status <0.001 <0.001 Never smoker 2,352,091 (59.0) 705,678 (54.1) 1,646,413 (61.4) 434,090 (55.8) 1,918,001 (59.8) Ex‐smoker 568,861 (14.3) 225,940 (17.3) 342,921 (12.8) 132,879 (17.1) 435,982 (13.6) Current smoker 1,065,203 (26.7) 373,595 (28.6) 691,608 (25.8) 210,866 (27.1) 854,337 (26.6) Alcohol intake <0.001 <0.001 Non‐drinker 2,036,066 (51.1) 638,272 (48.9) 1,397,794 (52.1) 405,934 (52.2) 1,630,132 (50.8) Mild‐drinker (< 30 g/d) 1,630,423 (40.9) 534,422 (41.0) 1,096,001 (40.9) 290,767 (37.4) 1,339,656 (41.8) Heavy‐drinker (≥ 30 g/d) 319,666 (8.0) 132,519 (10.1) 187,147 (7.0) 81,134 (10.4) 238,532 (7.4) Regular exercise (yes) 714,490 (17.9) 253,806 (19.5) 460,684 (17.2) <0.001 139,262 (17.9) 575,228 (17.9) 0.599 Cancer incidence 242,243 (6.1) 86,338 (6.6) 155,905 (5.8) <0.001 61,833 (8.0) 180,410 (5.6) <0.001 Follow‐up duration, years 9.0 ± 1.6 9.0 ± 1.6 9.0 ± 1.6 0.348 8.8 ± 1.8 9.0 ± 1.5 <0.001  Note Abbreviations: n, number; Q, quartile.  a Presence of general obesity was defined as body mass index ≥ 25 kg/m 2  b Absence of general obesity was defined as body mass index < 25 kg/m 2  c Comparison between those with general obesity and those without general obesity using Student's t‐test or the chi‐square test.  d Presence of abdominal obesity was defined as waist circumference ≥ 90 cm for males and waist circumference ≥ 85 cm for females.  e Absence of abdominal obesity was defined as waist circumference < 90 cm for males and waist circumference < 85 cm for females.  f Comparison between those with abdominal obesity and those without abdominal obesity using Student's t‐test or the chi‐square test. John Wiley & Sons, Ltd. TABLE 2 Cancer incidences of the study population Overall population Men Premenopausal women  a Postmenopausal women  b Cancer site Event Incidence (per 1,000 person‐years) Event Incidence (per 1,000 person‐years) Event Incidence (per 1,000 person‐years) Event Incidence (per 1,000 person‐years) Overall 242,243 6.78 135,299 6.85 40,662 4.80 66,282 8.81 Esophagus 3,059 0.08 2,776 0.14 46 0.01 237 0.03 Stomach 37,012 1.01 26,242 1.31 2,444 0.28 8,326 1.07 Colon 38,919 1.07 22,688 1.13 4,331 0.50 11,900 1.54 Rectal 12,773 0.35 8,564 0.42 999 0.12 3,210 0.41 Oral cavity 1,593 0.04 1,050 0.05 142 0.02 401 0.05 Lung 33,214 0.91 23,379 1.16 1,852 0.21 7,983 1.03 Larynx 1,594 0.04 1,516 0.08 14 0.00 64 0.01 Liver 16,658 0.46 12,718 0.63 699 0.08 3,241 0.42 Bile duct 9,408 0.26 5,899 0.29 357 0.04 3,152 0.41 Gallbladder 3,544 0.10 1,773 0.09 191 0.02 1,580 0.20 Pancreas 20,323 0.56 12,385 0.61 1,475 0.17 6,463 0.83 Myeloid leukemia 2,646 0.07 1,617 0.08 320 0.04 709 0.09 Lymphoid leukemia 849 0.02 513 0.03 94 0.01 242 0.03 Hodgkin's lymphoma 356 0.01 232 0.01 48 0.01 76 0.01 Non‐Hodgkin's lymphoma 5,700 0.16 3,441 0.17 579 0.07 1,680 0.22 Multiple myeloma 2,625 0.07 1,576 0.08 163 0.02 886 0.11 Prostate 23,350 1.16 23,350 1.16 N/A N/A N/A N/A Testis 477 0.02 477 0.02 N/A N/A N/A N/A Breast 22,110 0.61 215 0.01 12,156 1.41 9,739 1.26 Cervix 3,943 0.24 N/A N/A 1,909 0.22 2,034 0.26 Uterus 3,122 0.19 N/A N/A 1,608 0.19 1,514 0.19 Ovary 5,319 0.32 N/A N/A 2,463 0.29 2,856 0.37 Brain/CNS 3,956 0.11 2,213 0.11 447 0.05 1,296 0.17 Malignant melanoma 1,013 0.03 506 0.03 116 0.01 391 0.05 Thyroid 36,112 0.99 9,861 0.49 15,243 1.78 11,008 1.43 Kidney 6,450 0.18 4,678 0.23 462 0.05 1,310 0.17 Bladder 8,099 0.22 6,766 0.34 178 0.02 1,155 0.15  Note Abbreviation: N/A, not applicable.  a Age <50 years.  b Age ≥ 50 years. John Wiley & Sons, Ltd. 3.2 Associations of BMI and WC with incidence of cancers We depicted BMI‐ and WC‐cancer associations by plotting penalized spline curves. Detailed information on incidences of cancers according to presence of general and abdominal obesity is presented in the Supplementary Tables S4‐S7 P‐ S8 3.2.1 Overall cancers For men, the association of overall cancer incidence with BMI was non‐linear, but the association with WC was linear. All such associations were linear for both pre‐and post‐menopausal women (Figure 2 FIGURE 2 Associations of adiposity with incidence of overall and digestive tract cancers. Penalized spline curves are presented to illustrate associations between adiposity markers and cancer incidences adjusted for age, diagnosis of diabetes mellitus, smoking status, alcohol intake, and regular exercise. The 95% confidence intervals are presented as shaded areas. All P‐ Abbreviations: BMI, body mass index; WC, waist circumference; HR, hazard ratio; CI, confidence interval. 3.2.2 Digestive tract cancers Both BMI and WC were inversely associated with esophageal cancer in men, but there was no association in women. For gastric and colon cancers, there were positive associations with BMI and WC among men and postmenopausal women but not among premenopausal women. Both adiposity markers were positively associated with rectal cancer incidence among postmenopausal women, whereas only WC had similar associations among men and premenopausal women (Figure 2 3.2.3 Head/neck and thoracic cancers Both BMI and WC had no significant association with oral cavity cancer. For lung cancer, the only non‐linear, inverse association with BMI was observed among men. For laryngeal cancer, the only linear, inverse association with BMI was also observed among men (Figure 3 FIGURE 3 Associations of adiposity with incidence of head/neck and thoracic cancers. Penalized spline curves are presented to illustrate associations between adiposity markers and cancer incidences adjusted for age, diagnosis of diabetes mellitus, smoking status, alcohol intake, and regular exercise. The 95% confidence intervals are presented as shaded areas. All P‐ P‐ Abbreviations: BMI, body mass index; WC, waist circumference; HR, hazard ratio; CI, confidence interval; N.A., not applicable. 3.2.4 Hepato‐bilio‐pancreatic cancers For liver and biliary tract cancers, positive associations with adiposity markers were observed in all sex groups, and non‐linearity was found only in men. For gallbladder cancer, there were positive associations with BMI in premenopausal women and with WC in postmenopausal women. There were positive associations of BMI and WC with pancreatic cancer incidence among men and postmenopausal women; among premenopausal women, only BMI was positively associated with pancreatic cancer incidence (Figure 4 FIGURE 4 Associations of adiposity with incidence of hepato‐bilio‐pancreatic cancers. Penalized spline curves are presented to illustrate associations between adiposity markers and cancer incidences adjusted for age, diagnosis of diabetes mellitus, smoking status, alcohol intake, and regular exercise. The 95% confidence intervals are presented as shaded areas. All P‐ Abbreviations: BMI, body mass index; WC, waist circumference; HR, hazard ratio; CI, confidence interval. 3.2.5 Hematological cancers For hematological cancers, associations with adiposity markers varied by subtypes of leukemia and lymphoma. For myeloid leukemia, positive associations with adiposity markers were observed among men (for both BMI and WC) and postmenopausal women (for WC). For NHL, there were positive associations with BMI and WC among men (Figure 5 FIGURE 5 Associations of adiposity with incidence of hematological cancers. Penalized spline curves are presented to illustrate associations between adiposity markers and cancer incidences adjusted for age, diagnosis of diabetes mellitus, smoking status, alcohol intake, and regular exercise. The 95% confidence intervals are presented as shaded areas. All P‐ Abbreviations: BMI, body mass index; WC, waist circumference; HR, hazard ratio; CI, confidence interval. 3.2.6 Sex‐specific cancers For prostate cancer, there were non‐linear associations with BMI and WC. For breast cancer, we observed linear associations with BMI and WC among only postmenopausal women. WC was positively associated with cervical cancer among postmenopausal women. For uterine and ovarian cancers, there were linear associations with BMI and WC among both premenopausal and postmenopausal women (Figure 6 FIGURE 6 Associations of adiposity with incidence of sex‐specific cancers. Penalized spline curves are presented to illustrate associations between adiposity markers and cancer incidences adjusted for age, diagnosis of diabetes mellitus, smoking status, alcohol intake, and regular exercise. The 95% confidence intervals are presented as shaded areas. All P‐ Abbreviations: BMI, body mass index; WC, waist circumference; HR, hazard ratio; CI, confidence interval. 3.2.7 Other cancers We observed positive linear associations between adiposity markers and brain/CNS cancer incidence among postmenopausal women only. No significant association was found between adiposity markers and malignant melanoma. For thyroid cancer, non‐linear associations with adiposity markers were observed among men, premenopausal women (for both BMI and WC), and postmenopausal women (for BMI). There was a positive linear association between WC and thyroid cancer among postmenopausal women. Positive linear associations with adiposity markers were found for the incidence of renal cancer across all participants. Positive linear associations between adiposity markers and bladder cancer were observed among men and postmenopausal women (Figure 7 FIGURE 7 Associations of adiposity with incidence of other cancers. Penalized spline curves are presented to illustrate associations between adiposity markers and cancer incidences adjusted for age, diagnosis of diabetes mellitus, smoking status, alcohol intake, and regular exercise. The 95% confidence intervals are presented as shaded areas. All P‐ Abbreviations: BMI, body mass index; WC, waist circumference; HR, hazard ratio; CI, confidence interval. 4 DISCUSSION This population‐based retrospective cohort study investigated associations of BMI and WC with various site‐specific cancer incidences accounting for potential non‐linearity stratified by sex and menopausal status. Our findings generally corroborate the results of previous studies that demonstrated positive associations between adiposity markers and incidences of cancers including overall cancer [ 1 2 3 4 5 6 7 8 9 6 7 8 6 7 8 5 7 8 2 6 9 7 2 7 8 6 7 8 5 6 2 9 In this study, we observed some significant non‐linear associations for several cancers, such as liver, biliary tract, and prostate cancer in men and thyroid cancer in both sexes. Many other associations were not significant for the non‐linearity. Previous study findings vary regarding linearity of associations: for example, studies from the UK Clinical Practice Research Datalink [ 2 7 9 2 7 2 7 9 2 2 7 2 9 7 2 7 7 2 7 9 2 7 9 9 2 7 2 2 2 P 6 Previous studies examining potential non‐linear associations usually presented spline curves without stratification by sex and/or menopausal status (except for some specific cancers, such as pre‐ and post‐menopausal breast cancer) [ 2 6 7 9 Findings for specific cancers are noteworthy compared to previous studies. We observed an inverse association between adiposity markers and esophageal cancer incidence among men. While relationships between obesity and esophageal adenocarcinoma are well known [ 6 11 57 58 3 9 59 There was a positive association of stomach cancer with BMI and WC among men and postmenopausal women, concordant with previous studies in Korea [ 5 2 6 7 60 Helicobacter pylori H. pylori 61 3 9 5 2 6 7 62 63 64 9 65 66 This study was conducted using a large‐scale nationwide cohort database representing almost the entire Korean population to investigate associations between obesity and incidences of various cancers. Our findings suggest methodological consideration of non‐linearity and stratification by sex and menopausal status in reporting obesity‐associated cancer risks. Despite these strengths, there are several limitations to address. First, we did not consider longitudinal changes of BMI and WC during the follow‐up period. Previous studies on weight change and cancer risk showed inconsistent results depending on cancer sites and cohorts [ 67 68 69 70 71 72 73 74 H. pylori 5 CONCLUSION We investigated differential associations of BMI and WC with incidences of overall cancer and of 27 site‐specific cancers stratified by sex and menopausal status. Our findings contribute to the understanding of the relationship between obesity and cancer risk in Asian populations. These results may provide evidence to support the implementation of active surveillance and targeted management strategies for obesity. AUTHOR CONTRIBUTIONS  Seonghye Kim Bongseong Kim Kyu‐won Jung, Ga Eun Nam, Wonyoung Jung, Junhee Park Kyung‐do Han Dong Wook Shin CONFLICT OF INTEREST STATEMENT Seonghye Kim, Bongseong Kim, Kyu‐won Jung, Ga Eun Nam, Wonyoung Jung, Junhee Park, Kyung‐Do Han, and Dong Wook Shin declare that they have no conflict of interest concerning the materials or methods used in this study or the findings specified in this article. ETHICS APPROVAL AND CONSENT TO PARTICIPATE The study protocol was approved by the Institutional Review Board of Soongsil University (IRB File No. SSU‐202007‐HR‐236‐02). The requirement for informed written consent from all participants was waived because the data were anonymized under confidentiality guidelines. Supporting information Supporting Information ACKNOWLEDGEMENTS This study was fully supported by a grant from the Korean Foundation for Cancer Research (KFCR) (grant number: CB‐2022‐A‐1). DATA AVAILABILITY STATEMENT The data reported in this study are not available publicly; they are available only to licensed researchers authorized by the Korean National Health Insurance System (KNHIS). REFERENCES 1 World Cancer Research Fund Continuous Update Project Expert Report 2018. Body fatness and weight gain and the risk of cancer https://www.wcrf.org/wp‐content/uploads/2024/10/Body‐fatness‐and‐weight‐gain_0.pdf 2 Bhaskaran K Douglas I Forbes H dos‐Santos‐Silva I Leon DA Smeeth L Body‐mass index and risk of 22 specific cancers: a population‐based cohort study of 5·24 million UK adults Lancet 2014 384 9945 755 65 25129328 10.1016/S0140-6736(14)60892-8 PMC4151483 3 Kyrgiou M Kalliala I Markozannes G Gunter MJ Paraskevaidis E Gabra H Adiposity and cancer at major anatomical sites: umbrella review of the literature Bmj 2017 356 j477 28246088 10.1136/bmj.j477 PMC5421437 4 Lauby‐Secretan B Scoccianti C Loomis D Grosse Y Bianchini F Straif K Body Fatness and Cancer‐Viewpoint of the IARC Working Group N Engl J Med 2016 375 8 794 8 27557308 10.1056/NEJMsr1606602 PMC6754861 5 Lee KR Seo MH Jung J Hwang IC Waist circumference and risk of 23 site‐specific cancers: a population‐based cohort study of Korean adults Br J Cancer 2018 119 8 1018 27 30327562 10.1038/s41416-018-0214-7 PMC6203821 6 Parra‐Soto S Cowley ES Rezende LFM Ferreccio C Mathers JC Pell JP Associations of six adiposity‐related markers with incidence and mortality from 24 cancers‐findings from the UK Biobank prospective cohort study BMC Med 2021 19 1 7 33423670 10.1186/s12916-020-01848-8 PMC7798245 7 Recalde M Davila‐Batista V Díaz Y Leitzmann M Romieu I Freisling H Body mass index and waist circumference in relation to the risk of 26 types of cancer: a prospective cohort study of 3.5 million adults in Spain BMC Med 2021 19 1 10 33441148 10.1186/s12916-020-01877-3 PMC7807518 8 Renehan AG Tyson M Egger M Heller RF Zwahlen M Body‐mass index and incidence of cancer: a systematic review and meta‐analysis of prospective observational studies Lancet 2008 371 9612 569 78 18280327 10.1016/S0140-6736(08)60269-X 9 Wang L Jin G Yu C Lv J Guo Y Bian Z Cancer incidence in relation to body fatness among 0.5 million men and women: Findings from the China Kadoorie Biobank Int J Cancer 2020 146 4 987 98 31115907 10.1002/ijc.32394 PMC7614994 10 World Health Organization Overweight and Obesity www.who.int/news‐room/fact‐sheets/detail/obesity‐and‐overweight 11 Koyanagi YN Matsuo K Ito H Wang C Tamakoshi A Sugawara Y Body mass index and esophageal and gastric cancer: A pooled analysis of 10 population‐based cohort studies in Japan Cancer Sci 2023 114 7 2961 72 37013939 10.1111/cas.15805 PMC10323111 12 Li X Lian Y Ping W Wang K Jiang L Li S Abdominal obesity and digestive system cancer: a systematic review and meta‐analysis of prospective studies BMC Public Health 2023 23 1 2343 38012596 10.1186/s12889-023-17275-2 PMC10680266 13 Bardou M Rouland A Martel M Loffroy R Barkun AN Chapelle N Review article: obesity and colorectal cancer Aliment Pharmacol Ther 2022 56 3 407 18 35707910 10.1111/apt.17045 14 Mandic M Safizadeh F Niedermaier T Hoffmeister M Brenner H Association of Overweight, Obesity, and Recent Weight Loss With Colorectal Cancer Risk JAMA Netw Open 2023 6 4 e239556 37083659 10.1001/jamanetworkopen.2023.9556 PMC10122181 15 Gaudet MM Kitahara CM Newton CC Bernstein L Reynolds P Weiderpass E Anthropometry and head and neck cancer:a pooled analysis of cohort data Int J Epidemiol 2015 44 2 673 81 26050257 10.1093/ije/dyv059 PMC4481608 16 Kim HB Kim GJ Han KD Joo YH Changes in metabolic syndrome status and risk of laryngeal cancer: A nationwide cohort study PLoS One 2021 16 6 e0252872 34097712 10.1371/journal.pone.0252872 PMC8183997 17 Jun BG Kim M Shin HS Yi JJ Yi SW Impact of overweight and obesity on the risk of hepatocellular carcinoma: a prospective cohort study in 14.3 million Koreans Br J Cancer 2022 127 1 109 15 35249102 10.1038/s41416-022-01771-0 PMC9276765 18 Yang W Zeng X Petrick JL Danford CJ Florio AA Lu B Body Mass Index Trajectories, Weight Gain, and Risks of Liver and Biliary Tract Cancers JNCI Cancer Spectrum 2022 6 4 10.1093/jncics/pkac056 PMC9406603 35960613 19 Campbell PT Newton CC Kitahara CM Patel AV Hartge P Koshiol J Body Size Indicators and Risk of Gallbladder Cancer: Pooled Analysis of Individual‐Level Data from 19 Prospective Cohort Studies Cancer Epidemiol Biomarkers Prev 2017 26 4 597 606 28314823 10.1158/1055-9965.EPI-16-0796 PMC5380577 20 Zhou B Wu D Liu H Du LT Wang YS Xu JW Obesity and pancreatic cancer: An update of epidemiological evidence and molecular mechanisms Pancreatology 2019 19 7 941 50 31447281 10.1016/j.pan.2019.08.008 21 Psaltopoulou T Sergentanis TN Ntanasis‐Stathopoulos I Tzanninis IG Riza E Dimopoulos MA Anthropometric characteristics, physical activity and risk of hematological malignancies: A systematic review and meta‐analysis of cohort studies Int J Cancer 2019 145 2 347 59 30614529 10.1002/ijc.32109 22 Discacciati A Orsini N Wolk A Body mass index and incidence of localized and advanced prostate cancer–a dose‐response meta‐analysis of prospective studies Ann Oncol 2012 23 7 1665 71 22228452 10.1093/annonc/mdr603 23 Vallières E Mésidor M Roy‐Gagnon MH Richard H Parent M General and abdominal obesity trajectories across adulthood, and risk of prostate cancer: results from the PROtEuS study Montreal, Canada Cancer Causes Control 2021 32 6 653 65 33818663 10.1007/s10552-021-01419-z 24 Dehesh T Fadaghi S Seyedi M Abolhadi E Ilaghi M Shams P The relation between obesity and breast cancer risk in women by considering menstruation status and geographical variations: a systematic review and meta‐analysis BMC Womens Health 2023 23 1 392 37496015 10.1186/s12905-023-02543-5 PMC10373406 25 Park IS Kim SI Han Y Yoo J Seol A Jo H Risk of female‐specific cancers according to obesity and menopausal status in 2.7 million Korean women: Similar trends between Korean and Western women Lancet Reg Health West Pac 2021 11 100146 34327357 10.1016/j.lanwpc.2021.100146 PMC8315398 26 Park JW Han K Shin DW Yeo Y Chang JW Yoo JE Obesity and breast cancer risk for pre‐ and postmenopausal women among over 6 million Korean women Breast Cancer Res Treat 2021 185 2 495 506 33010023 10.1007/s10549-020-05952-4 27 Kölbl H Bartl T Obesity in Gynecologic Oncology Geburtshilfe Frauenheilkd 2020 80 12 1205 11 33293728 10.1055/a-1124-7139 PMC7714555 28 Ahn S Han K Lee J‐E Jeun S‐S Park Y‐M Yang SH Associations of general and abdominal obesity with the risk of glioma development Cancers 2021 13 12 2859 34201103 10.3390/cancers13122859 PMC8228893 29 Ogawa T Sawada N Iwasaki M Budhathoki S Yamaji T Shimazu T Body mass index and height in relation to brain tumor risk in a Japanese population Ann Epidemiol 2020 51 1 6 32822852 10.1016/j.annepidem.2020.06.001 30 Eissa MS Abdellateif MS Elesawy YF Shaarawy S Al‐Jarhi UM Obesity and Waist Circumference are Possible Risk Factors for Thyroid Cancer: Correlation with Different Ultrasonography Criteria Cancer Manag Res 2020 12 6077 89 32801859 10.2147/CMAR.S256268 PMC7382758 31 Nam GE Cho KH Han K Kim CM Han B Cho SJ Obesity, abdominal obesity and subsequent risk of kidney cancer: a cohort study of 23.3 million East Asians Br J Cancer 2019 121 3 271 7 31231120 10.1038/s41416-019-0500-z PMC6738324 32 Tzelves L Xenou D Skolarikos A Varkarakis I Deliveliotis C Terpos E Association of obesity and other anthropometric characteristics with bladder cancer risk: a systematic review and meta‐analysis of longitudinal cohort studies J buon 2021 26 3 1040 55 34268971 33 Chadid S Kreger BE Singer MR Loring Bradlee M Moore LL Anthropometric measures of body fat and obesity‐related cancer risk: sex‐specific differences in Framingham Offspring Study adults Int J Obes (Lond) 2020 44 3 601 8 31974408 10.1038/s41366-020-0519-5 PMC8744404 34 Larsson SC Spyrou N Mantzoros CS Body fatness associations with cancer: evidence from recent epidemiological studies and future directions Metabolism 2022 137 155326 36191637 10.1016/j.metabol.2022.155326 35 Ambikairajah A Walsh E Tabatabaei‐Jafari H Cherbuin N Fat mass changes during menopause: a metaanalysis Am J Obstet Gynecol 2019 221 5 393 409 31034807 10.1016/j.ajog.2019.04.023 36 Lear SA Humphries KH Kohli S Birmingham CL The use of BMI and waist circumference as surrogates of body fat differs by ethnicity Obesity (Silver Spring) 2007 15 11 2817 24 18070773 10.1038/oby.2007.334 37 Lear SA Humphries KH Kohli S Chockalingam A Frohlich JJ Birmingham CL Visceral adipose tissue accumulation differs according to ethnic background: results of the Multicultural Community Health Assessment Trial (M‐CHAT) Am J Clin Nutr 2007 86 2 353 9 17684205 10.1093/ajcn/86.2.353 38 Shin DW Cho J Park JH Cho B National General Health Screening Program in Korea: history, current status, and future direction Precis Future Med 2022 6 1 9 31 39 World Health Organization International Association for the Study of Obesity, International Obesity Task Force. The Asia‐Pacific perspective: Redefining obesity and its treatment. Health Communications Australia, Sydney 2000 https://iris.who.int/bitstream/handle/10665/206936/0957708211_eng.pdf 40 Haam JH Kim BT Kim EM Kwon H Kang JH Park JH Diagnosis of Obesity: 2022 Update of Clinical Practice Guidelines for Obesity by the Korean Society for the Study of Obesity J Obes Metab Syndr 2023 32 2 121 9 37386771 10.7570/jomes23031 PMC10327686 41 Lee SY Park HS Kim DJ Han JH Kim SM Cho GJ Appropriate waist circumference cutoff points for central obesity in Korean adults Diabetes Res Clin Pract 2007 75 1 72 80 16735075 10.1016/j.diabres.2006.04.013 42 Yang MS Park M Back JH Lee GH Shin JH Kim K Validation of Cancer Diagnosis Based on the National Health Insurance Service Database versus the National Cancer Registry Database in Korea Cancer Res Treat 2022 54 2 352 61 34353000 10.4143/crt.2021.044 PMC9016317 43 Cho IY Han K Shin DW Cho MH Yoo JE Cho JH Associations of Variability in Metabolic Parameters with Lung Cancer: A Nationwide Population‐Based Study Cancers 2021 13 8 1982 33924149 10.3390/cancers13081982 PMC8074362 44 Park CY Lim JY Park HY Age at natural menopause in Koreans: secular trends and influences thereon Menopause 2018 25 4 423 9 29112598 10.1097/GME.0000000000001019 45 Cao Y Lin H Wu TZ Yu Y Penalized spline estimation for functional coefficient regression models Comput Stat Data Anal 2010 54 4 891 905 21516260 10.1016/j.csda.2009.09.036 PMC3080050 46 Eilers PHC Marx BD Durbán M Twenty years of P‐splines SORT‐Statistics and Operations Research Transactions 2015 39 2 149 86 47 Malloy EJ Spiegelman D Eisen EA Comparing measures of model selection for penalized splines in Cox models Comput Stat Data Anal 2009 53 7 2605 16 20161167 10.1016/j.csda.2008.12.008 PMC2720551 48 Màrmol JM Carlsson M Raun SH Grand MK Sørensen J Lang Lehrskov L Insulin resistance in patients with cancer: a systematic review and meta‐analysis Acta Oncol 2023 62 4 364 71 37042166 10.1080/0284186X.2023.2197124 49 Jun S Park H Kim UJ Lee HA Park B Lee SY The Combined Effects of Alcohol Consumption and Smoking on Cancer Risk by Exposure Level: A Systematic Review and Meta‐Analysis J Korean Med Sci 2024 39 22 e185 38859742 10.3346/jkms.2024.39.e185 PMC11164648 50 Yoo JE Han K Shin DW Kim D Kim BS Chun S Association Between Changes in Alcohol Consumption and Cancer Risk JAMA Netw Open 2022 5 8 e2228544 36001313 10.1001/jamanetworkopen.2022.28544 PMC9403779 51 Larson EA Dalamaga M Magkos F The role of exercise in obesity‐related cancers: Current evidence and biological mechanisms Semin Cancer Biol 2023 91 16 26 36871634 10.1016/j.semcancer.2023.02.008 52 Chen H Wang Y A penalized spline approach to functional mixed effects model analysis Biometrics 2011 67 3 861 70 21155747 10.1111/j.1541-0420.2010.01524.x 53 Abdi H Holm's sequential Bonferroni procedure Encyclopedia of research design 2010 1 8 1 8 54 Aickin M Gensler H Adjusting for multiple testing when reporting research results: the Bonferroni vs Holm methods Am J Public Health 1996 86 5 726 8 8629727 10.2105/ajph.86.5.726 PMC1380484 55 Perperoglou A Sauerbrei W Abrahamowicz M Schmid M A review of spline function procedures in R BMC Med Res Methodol 2019 19 1 46 30841848 10.1186/s12874-019-0666-3 PMC6402144 56 T T A Package for Survival Analysis in R. R package version 3.8‐3 https://CRAN.R‐project.org/package=survival 57 Kim HW Park SY Current Trends in the Epidemiology and Treatment of Esophageal Cancer in South Korea J Chest Surg 2025 58 1 15 20 39710503 10.5090/jcs.24.078 PMC11738140 58 Shin A Won YJ Jung HK Kong HJ Jung KW Oh CM Trends in incidence and survival of esophageal cancer in Korea: Analysis of the Korea Central Cancer Registry Database J Gastroenterol Hepatol 2018 33 12 1961 8 29802647 10.1111/jgh.14289 PMC6334276 59 Stabellini N Chandar AK Chak A Barda AJ Dmukauskas M Waite K Sex differences in esophageal cancer overall and by histological subtype Sci Rep 2022 12 1 5248 35347189 10.1038/s41598-022-09193-x PMC8960903 60 Jo HH Kim N Jang J Choi Y Park J Park YM Impact of Body Mass Index on Survival Depending on Sex in 14,688 Patients with Gastric Cancer in a Tertiary Hospital in South Korea Gut Liver 2023 17 2 243 58 36317512 10.5009/gnl220104 PMC10018295 61 Polk DB Peek RM Jr. Helicobacter pylori: gastric cancer and beyond Nat Rev Cancer 2010 10 6 403 14 20495574 10.1038/nrc2857 PMC2957472 62 Yi SW Choi JS Yi JJ Lee Yh Han KJ Risk factors for hepatocellular carcinoma by age, sex, and liver disorder status: a prospective cohort study in Korea Cancer 2018 124 13 2748 57 29669170 10.1002/cncr.31406 63 Bai S Dang W Hong W Liao W Smith RD The prevalence of hepatitis B in Chinese general population from 2018 to 2022: a systematic review and meta‐analysis BMC Infect Dis 2024 24 1 211 38365596 10.1186/s12879-024-09103-8 PMC10870619 64 Baecker A Liu X La Vecchia C Zhang Z‐F Worldwide incidence of hepatocellular carcinoma cases attributable to major risk factors European Journal of Cancer Prevention 2018 27 3 205 12 29489473 10.1097/CEJ.0000000000000428 PMC5876122 65 Kim Y Shin DW Kim HW Jung JH Han K Cho IY Disparities in gastric cancer screening among people with disabilities: a national registry‐linkage study in South Korea Gastric Cancer 2020 23 3 497 509 31677130 10.1007/s10120-019-01017-8 66 Seo JY Shin DW Yu SJ Jung JH Han K Cho IY Disparities in Liver Cancer Surveillance Among People With Disabilities: A National Database Study in Korea J Clin Gastroenterol 2021 55 5 439 48 32889960 10.1097/MCG.0000000000001405 67 Shi X Deng G Wen H Lin A Wang H Zhu L Role of body mass index and weight change in the risk of cancer: A systematic review and meta‐analysis of 66 cohort studies J Glob Health 2024 14 04067 38547495 10.7189/jogh.14.04067 PMC10978059 68 Tran TPT Luu NM Bui TT Han M Lim MK Oh JK Weight‐change trajectory in relation to cancer risk: findings from a nationwide cohort study in South Korea Obesity (Silver Spring) 2022 30 7 1507 19 35785482 10.1002/oby.23464 69 Wang QL Babic A Rosenthal MH Lee AA Zhang Y Zhang X Cancer Diagnoses After Recent Weight Loss Jama 2024 331 4 318 28 38261044 10.1001/jama.2023.25869 PMC10807298 70 Feng Q Bešević J Conroy M Omiyale W Woodward M Lacey B Waist‐to‐height ratio and body fat percentage as risk factors for ischemic cardiovascular disease: a prospective cohort study from UK Biobank Am J Clin Nutr 2024 119 6 1386 96 38839194 10.1016/j.ajcnut.2024.03.018 PMC11196863 71 Cao T Xie R Wang J Xiao M Wu H Liu X Association of weight‐adjusted waist index with all‐cause mortality among non‐Asian individuals: a national population‐based cohort study Nutr J 2024 23 1 62 38862996 10.1186/s12937-024-00947-z PMC11167926 72 Zhang X Ma N Lin Q Chen K Zheng F Wu J Body Roundness Index and All‐Cause Mortality Among US Adults JAMA Netw Open 2024 7 6 e2415051 38837158 10.1001/jamanetworkopen.2024.15051 PMC11154161 73 Christakoudi S Tsilidis KK Evangelou E Riboli E A Body Shape Index (ABSI), hip index, and risk of cancer in the UK Biobank cohort Cancer Med 2021 10 16 5614 28 34196490 10.1002/cam4.4097 PMC8366087 74 Zhang Y Zeng Q Li X Zhu P Huang F Application of conicity index adjusted total body fat in young adults‐a novel method to assess metabolic diseases risk Sci Rep 2018 8 1 10093 29973625 10.1038/s41598-018-28463-1 PMC6031637 ",
  "metadata": {
    "Title of this paper": "Application of conicity index adjusted total body fat in young adults‐a novel method to assess metabolic diseases risk",
    "Journal it was published in:": "Cancer Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479131/"
  }
}