{
  "title": "Paper_337",
  "abstract": "pmc Front Neurosci Front Neurosci 670 frontneurosci Front. Neurosci. Frontiers in Neuroscience 1662-4548 1662-453X Frontiers Media SA PMC12483918 PMC12483918.1 12483918 12483918 41040952 10.3389/fnins.2025.1608017 1 Neuroscience Original Research Adrenergic signals influence proteomic responses in breast cancer cells Carrasco Manuel  1  * Bjørnstad Ole Vidhammer  1 Vethe Heidrun  1 Akslen Lars A.  1  2  * 1 Centre for Cancer Biomarkers CCBIO, Department of Clinical Medicine, Section for Pathology, University of Bergen Bergen Norway 2 Department of Pathology, Haukeland University Hospital Bergen Norway Edited by: Montse Visa Reviewed by: Sabrina Ferreira Asier Selas *Correspondence: Lars A. Akslen, Lars.Akslen@uib.no Manuel Carrasco, Manuel.Carrasco@uib.no 17 9 2025 2025 19 480891 1608017 08 4 2025 18 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Carrasco, Bjørnstad, Vethe and Akslen. 2025 Carrasco, Bjørnstad, Vethe and Akslen https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction Breast cancer remains a major health challenge due to its molecular heterogeneity and complex interactions with the tumor microenvironment. Adrenergic signaling, mediated by stress hormones such as noradrenaline, has emerged as a potential regulator of cancer progression, influencing cell proliferation, cell adhesion, migration, and invasion. Methods This study investigates the effects of adrenergic modulation on breast cancer spheroids from basal-like (MDA-MB-231, BT549) and luminal-like (T47D, MCF7) cell lines, using 3D culture systems as a more physiologically relevant model compared to traditional 2D monolayer cultures. The 3D spheroid model better recapitulates the structural complexity of tumors, providing insights into cell–cell and cell-matrix interactions that influence signaling pathways and drug responses. Results Noradrenaline treatment significantly reduced spheroid size, invasion capacity, and the expression of EMT-related markers and integrins in MDA-MB-231 cells. These effects were partially reversed by propranolol, a non-selective beta-adrenergic receptor antagonist. Luminal-like spheroids, characterized by low ADRB2 abundance, displayed limited responsiveness to adrenergic modulation. Proteomic analysis revealed distinct subtype-specific responses, with basal-like spheroids showing pronounced alterations in pathways related to proliferation, cytoskeletal dynamics, epithelial-mesenchymal transition, and metabolism, whereas luminal-like spheroids exhibited minimal changes. Discussion Our findings reveal heterogeneity in adrenergic receptor signaling across basal-like and luminal-like breast cancer cell lines, and also within the basal-like subgroup. This diversity underscores the complexity of adrenergic signaling in breast cancer and highlights the advantages of 3D culture systems. These results provide valuable insights into the subtype-specific patterns of response to adrenergic signaling that contribute to tumor progression and may inform future studies including evaluation of therapeutic strategies. breast cancer adrenergic signaling noradrenaline propranolol proteomics The author(s) declare that financial support was received for the research and/or publication of this article. This work was partly supported by the Research Council of Norway through its Centre of Excellence funding scheme, project number 223250, the Norwegian Cancer Society, Regional Health Trust Western Norway (Helse Vest) and L. Meltzers Høyskolefond 2023, project number 102729120. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Neuroendocrine Science Introduction Breast cancer continues to be a significant global health concern, serving as the leading cause of cancer related mortality in women worldwide ( Sung et al., 2021 Yersal and Barutca, 2014 Nolan et al., 2023 Recent developments in the emerging field of cancer neuroscience have indicated that the sympathetic nervous system, and in particular adrenergic signaling mechanisms, may play a role in breast cancer progression and response to therapy ( Zahalka et al., 2017 Zahalka and Frenette, 2020 Jayachandran et al., 2023 Eng et al., 2014 Zahalka and Frenette, 2020 The sympathetic nervous system releases neurotransmitters like noradrenaline which binds to adrenergic receptors distributed throughout various tissues, including cancer cells ( Karemaker, 2017 Renz et al., 2018 Kim-Fuchs et al., 2014 Zhang et al., 2010 Wehrwein et al., 2016 Jansen et al., 2014 Barron et al., 2011 Watkins et al., 2015 Beg et al., 2018 Barron et al., 2011 Melhem-Bertrandt et al., 2011 Sørensen et al., 2013 Cardwell et al., 2013 Spera et al., 2017 Modi et al., 2020 Lorona et al., 2021 Kim et al., 2017 Lofling et al., 2022 Scott et al., 2022 Scott et al., 2024 Melhem-Bertrandt et al., 2011 Lofling et al., 2022 Scott et al., 2022 Scott et al., 2024 To further address the questions regarding differential effects of adrenergic agonists and beta-blockers on specific molecular subtypes of breast cancer, we generated spheroids from four different BC cell lines: two basal-like (MDA-MB-231 and BT549) and two luminal-like (T47D and MCF7) cell lines. Breast cancer spheroids were treated with noradrenaline and propranolol in 3D culture, and the responses to adrenergic modulation were characterized by downstream proteomics responses, spheroid growth, invasion capacity, and morphological alterations. Our results indicate subtype-dependent adrenergic signaling responses in breast cancer cells by distinct proteomic profiles. Basal-like cell lines exhibited more pronounced changes, whereas luminal-like cell lines displayed minor changes. Our findings contribute to a deeper understanding of the interplay between adrenergic signaling and intrinsic breast cancer biology. They highlight the heterogeneous responses to beta-blocker treatment across different tumor subgroups, which may explain the conflicting results in clinical studies. Results Noradrenaline treatment reduces spheroid growth and invasion capacity in basal-like breast cancer cells To investigate the effect of adrenergic signaling in BC models that better resemble the three-dimensional structure found in vivo, in vitro Kenny et al., 2007 Bjornstad et al., 2024 Figure 1A Zhang et al., 2020 Nilsson et al., 2007 Choi et al., 2015 Figure 1B Figure 1 Noradrenaline alterations on spheroid area after 48 h treatment. (A) (B) n p p Panel A displays micrographs of four breast cancer cell lines (MDA-MB-231, BT549, MCF7, T47D) under different treatment conditions: Control (Ctrl), N, P, and P + N. The images illustrate variations in cell morphology and clustering. Panel B presents bar graphs comparing the area of cell clusters for each condition in square micrometers. Statistical significance is indicated for MDA-MB-231 and BT549, highlighting differences under treatment conditions. Noradrenaline treatment caused a 60% reduction in the average spheroid area in MDA-MB-231 cells compared to controls ( Figures 1A B In contrast, MCF7 spheroids displayed a modest, non-significant reduction in area following propranolol treatment alone. This may reflect a cell line-specific response independent of noradrenaline signaling ( Figures 1A B Supplementary Figures 1A–D Supplementary Figure 1E Supplementary Figure 1F To further investigate the functional consequences of adrenergic signaling, we conducted a spheroid invasion assay ( Figure 2 p Supplementary Table 1 Figure 2 Invasion assay of MDA-MB-231 cells under adrenergic stimulation. (A) (B) (C) Supplementary Table 1 Panel A shows MDA-MB-231 cell spheroids with different treatments: Ctrl, N, P, and P+N, outlined in green and blue. Panel B displays a line graph of whole spheroid area over 96 hours, and Panel C shows invading cells' area over the same period. Lines are color-coded: green for Ctrl, blue for N, yellow for P, and red for P+N. Data points increase over time, with Ctrl showing the most growth. Proteomic analysis revealed downregulation of VIM and STMN1, proteins involved in cytoskeletal remodeling and microtubule destabilization. These findings were supported by broader changes in additional EMT-related proteins, including cadherins, various integrin subunits, MMPs, and other adhesion molecules, as observed in noradrenaline-treated spheroids ( Supplementary Figure 2 Kenny et al., 2007 Manuel Iglesias et al., 2013 Hematoxylin and eosin (H&E) staining is shown in Figure 3 Figure 3 Hematoxylin and Eosin (H&E) staining of spheroids post-treatment. Representative images of spheroids from four cell lines (MDA-MB-231, BT549, T47D and MCF7) after 48 h-treatment with noradrenaline (N), propranolol (P) or a combination of both (N + P). Scale bar: BT549, 50 μm; MDA-MB-231 and T47D, 100 μm; MCF7, 250 μm. Microscopic images display four types of cell cultures labeled MDA-MB-231, BT549, MCF7, and T47D. Each type is shown under four conditions: Ctrl, N, P, and N+P. The differences in cell morphology and density are evident across the conditions, with cell clusters varying in appearance and compactness. Global proteome analysis reveals different responses in basal-like and luminal-like breast cancer spheroids to noradrenaline and propranolol treatment Mass spectrometry-based proteomics analysis of breast cancer cell lines MDA-MB-231, BT549, T47D and MCF7 before and after adrenergic modulation quantified a total of 7,770 proteins. Uniform Manifold Approximation and Projection (UMAP) plotting revealed distinct clustering of basal-like (MDA-MB-231, BT549) and luminal-like (T47D, MCF7) subtypes ( Figure 4A Figure 4B Figure 4 Comprehensive proteomic analysis of spheroids generated from four breast cancer cell lines subjected to adrenergic modulation. (A) n (B) (C–F) (C) (D) (E) (F) Subramanian et al., 2005 p p (C,D,F) (E) A composite image with multiple panels: A. UMAP plot showing two distinct clusters of cell lines, Cluster 1 in blue and Cluster 2 in red. B. Heatmap of hierarchical clustering analysis, showing gene expression patterns across various cell lines, with color coding for basal-like, luminal-like, and different treatments.C. Dot plot for MDA-MB-231-N highlighting significant pathways with GeneRatio, padjust, and count, including oxidative phosphorylation and MYC targets.D. Dot plot for BT549-N, featuring pathways like interferon responses and G2M checkpoint with relevant statistics.E. Dot plot for MCF7-N, highlighting pathways like MYC targets and KRAS signaling.F. Dot plot for T47D-N, showing significant pathways such as epithelial mesenchymal transition and interferon responses. Propranolol treatment changed the protein expression patterns in spheroids from BC cell lines, indicating β Figure 4A Adrenergic stimulation influences cellular pathways at the proteomic level We then analyzed, at the global protein level, specific biological hallmark gene sets from the MSigDB database ( Liberzon et al., 2015 Figures 4C F In MDA-MB-231 spheroids treated with noradrenaline, we observed an enrichment of metabolic processes including oxidative phosphorylation, fatty acid metabolism, and increased adipogenesis, suggesting a metabolic reprogramming towards energy production and lipid processing, potentially as an adaptive response to adrenergic signaling. In parallel, we observed downregulation of cell cycle-associated pathways (E2F and MYC targets, G2/M checkpoint activity, and mitotic spindle-associated proteins), suggesting a reduction in proliferation signaling, which may reflect a shift towards stress adaptation or altered cellular priorities ( Figure 4C Supplementary Figure 3 In noradrenaline-treated BT549 spheroids (BT549-N), we observed increased G2/M checkpoint activity, E2F targets, and mitotic spindle-associated factors, suggesting enhanced cell cycle progression. In contrast to MDA-MB-231, metabolic reprogramming was less prominent. Instead, interferon-alpha and gamma responses, as well as pathways associated with epithelial-mesenchymal transition (EMT), were notably downregulated ( Figure 4D Supplementary Figure 3 For luminal-like MCF7-N spheroids, pathway activation for both MYC and KRAS was increased ( Figure 4E Supplementary Figure 4 Supplementary Figure 1 In T47D-N spheroids, we observed enrichment for EMT, interferon-alpha and gamma responses, as well as IL-6/JAK/STAT3 signaling ( Figure 4F Supplementary Figure 4 Taken together, adrenergic stimulation induced subtype-specific responses: basal-like cell lines showed contrasting proliferation patterns, with MDA-MB-231 favoring metabolic reprogramming and BT549 increasing proliferation, while luminal-like cell lines exhibited no significant changes in proliferation-related gene sets. This highlights the context-dependent effects of adrenergic signaling in breast cancer, potentially influenced by subtype-specific differences in receptor expression and downstream signaling pathways. Proteomic signatures and predicted pathways in breast cancer cells following noradrenaline treatment Significantly differentially expressed proteins with p n n n n In MDA-MB-231 spheroids, pathways related to cell cycle and genomic stability were inferred inhibited (negative z-score). Gene expression and translation pathways were also downregulated, alongside significant inhibition of apoptotic signaling. Cytoskeletal dynamics and cell migration pathways, including RHO GTPase signaling, were suppressed. In addition, metabolic pathway analysis revealed activation of fatty acid β In contrast, BT549 spheroids displayed activation of cell cycle and genomic stability pathways. Gene expression and translation pathways were also upregulated, with mild activation of apoptotic signaling. Cytoskeletal and migration-related pathways, including RHO GTPase signaling, were activated as well. Metabolically, BT549 showed strong activation of oxidative phosphorylation and sirtuin signaling, consistent with increased energy production and stress adaptation. Luminal-like spheroids (T47D and MCF7) exhibited near-neutral activity scores across most pathways, indicating a reduced or heterogeneous response to noradrenaline treatment. Gene expression, apoptosis, cytoskeletal organization, and migration-related pathways showed only modest or inconsistent changes. Metabolic responses were limited, with MCF7 remaining largely unaffected and only mild pathway activation observed in T47D ( Figure 5A Figure 5 Impact of noradrenaline treatment on pathways, protein expression, and Ki67 staining in breast cancer spheroids. (A) (B) (C) (D) p p p p Diagram showing the effects of noradrenaline on different cellular processes. Panel A lists cellular processes and predicted activation or inhibition in cell lines, visualized with colored circles. Panel B features bar graphs of relative gene expression in various cell lines, with significant differences indicated by asterisks. Panel C displays immunohistochemistry images of MDA-MB-231 and BT549 cells treated with control or noradrenaline, showing Ki67 staining. Panel D shows bar graphs comparing the percentage of Ki67-positive cells in control and noradrenaline-treated conditions. Protein level analyses confirmed the pathway-level predictions ( Figure 5B p Finally, the percentage of proliferative cells in basal-like spheroids was quantified, defined as cells showing positive staining for the Ki67 antibody, a well-established marker of cell proliferation ( Figures 5C D p Taken together, IPA and protein level analyses highlight the subtype-specific responses of breast cancer spheroids to adrenergic signaling. Basal-like spheroids demonstrated pronounced and opposing effects: MDA-MB-231 spheroids showed downregulation of proliferation and cell cycle pathways alongside metabolic reprogramming, while BT549 spheroids exhibited enhanced proliferation and cell cycle progression. In contrast, luminal-like spheroids displayed a more muted proteomic response to noradrenaline, with only modest changes observed in key pathways and markers. These results underscore the heterogeneity of adrenergic signaling effects across breast cancer subtypes and suggest that the context-dependent modulation of cellular processes, such as proliferation, metabolism, and migration, may have implications for therapeutic targeting of adrenergic pathways in breast cancer. Discussion This study investigated how adrenergic signaling influences breast cancer spheroids in a 3D model that mimics in vivo Kenny et al., 2007 Saraiva et al., 2020 Carrasco et al., 2022 Jin et al., 2023 A significant finding in our study revolves around the differential responses of basal-like and luminal-like breast cancer spheroids to noradrenaline and propranolol. Specifically, noradrenaline treatment significantly reduced both the size of basal-like spheroids in the MDA-MB-231 model, as well as the invasive capacity. The observed size reduction was counteracted by blocking the beta-adrenergic receptors with propranolol, suggesting that adrenergic stimulation through beta-adrenergic receptors reduces the growth of this cancer cell line. In contrast, previous 2D data ( Jin et al., 2023 Ouyang et al., 2019 In our study, the size reduction observed after noradrenaline treatment of MDA-MB-231 cells was parallelled by functional data, proteomic information and pathway analyses. Expression of the proliferation marker Ki67 was significantly reduced, and IPA predicted downregulation of cell cycle and proliferation pathways, which aligned with the reduced expression of proliferation markers such as PCNA and CDC20. Taken together, these findings suggest a coordinated response to adrenergic stimulation that is consistent with reduced proliferative activity. The therapeutic potential of beta-blockers, such as propranolol, has been extensively explored in breast cancer, with mixed results likely reflecting differences in adrenergic receptor expression, downstream signaling, and tumor microenvironmental context within and across tumor subtypes. Whereas some clinical evidence suggests that basal-like or triple-negative breast cancer, characterized by higher adrenergic receptor activity, may respond more favorably to beta-blocker therapy compared to luminal-like subtypes ( Kim et al., 2017 in vivo Jabloñski et al., 2023 Rivero et al., 2017 Notably, previous studies using 2D monolayer cultures have reported somewhat contrasting findings. Ouyang et al. studied MCF7 (luminal-like) and MDA-MB-231 (basal-like) cells cultured as monolayers on plastic, reporting enhanced proliferation, invasion and migration upon noradrenaline stimulation ( Ouyang et al., 2019 β Jin et al., 2023 The differences between previous 2D studies and our current findings in 3D spheroids likely reflect the context-dependent nature of adrenergic signaling. Unlike 2D monolayers, 3D models better recapitulate in vivo Proteomic responses after noradrenaline treatment revealed subtype-specific differences, with variation across cell lines. Differences were predicted in proliferation, metabolism, genome stability, and migration. In basal-like spheroids, MDA-MB-231 cells indicated inhibition of pathways regulating cell cycle, DNA repair, and cytoskeletal dynamics after adrenergic signaling, aligning with the observed downregulation of key markers such as Ki67, PCNA, and CDC20. In addition, we observed a deregulation of cytoskeletal markers (VIM and STMN1), integrin subunits, MMP16, and other cell adhesion molecules, all of which are functionally associated with invasion ( Yue et al., 2012 Winter et al., 2021 β Overman et al., 2019 Pasquier et al., 2011 Gargiulo et al., 2020 In this study, the response of luminal-like spheroids to adrenergic stimulation was less pronounced, showing no significant size change and fewer significantly regulated proteins following adrenergic signaling modulation, suggesting that luminal-like breast cancer cells may exhibit lower sensitivity to adrenergic signaling. The limited impact of noradrenaline treatment in luminal-like spheroids underscores the heterogeneity of adrenergic signaling effects. While T47D showed slight changes, including downregulation of AURKB and upregulation of KSR1, MCF7 displayed only a modest upregulation of TOP2A. These findings suggest that luminal subtypes may be less responsive to adrenergic signaling, potentially due to differences in receptor expression, as supported by minimal ADRB2 immunoreactivity observed in the luminal-like spheroids (MCF7, T47D), as well as the reduced ADRB2 levels (mRNA) found in luminal cells from the CCLE collection. Metabolic pathway alterations, particularly fatty acid β Carracedo et al., 2013 German and Haigis, 2015 In our study, we employed a concentration of 10 μM noradrenaline to stimulate adrenergic signaling in breast cancer spheroids. This concentration is consistent with previous research investigating the effects of adrenergic stimulation on breast epithelial cells. For instance, Silva et al. (2024) Amaro et al., 2020 While our current study focused on non-selective β-adrenergic receptor modulation using propranolol, we agree that exploring α Overman et al., 2019 Gargiulo et al., 2020 Baker et al., 2011 Taken together, our 3D cell culture study shows subtype-specific variations in growth, invasion and proteomic responses to noradrenaline. Further studies are needed to understand the underlying mechanisms and assess how well this model translates to clinical applications in breast cancer. While our study provides insights into the effects of adrenergic signaling on some breast cancer spheroids, it is limited by its reliance on 3D in vitro in vivo in vitro in vivo Methods Tumor cell spheroid generation and drug treatment Two basal-like (MDA-MB-231 and BT549) and two luminal-like (T47D and MCF7) cell lines were dissociated with 0.25% trypsin. 5,000 cells were seeded per well in Ultra-Low Cluster 96 well plate (Costar #7007, Corning) in 200 μL of medium. Medium was refreshed every other day. On day 6, noradrenaline tartrate (Sigma, N1100000) and/or propranolol hydrochloride (Sigma, P8688) was added to a final concentration of 10 μM. Previous studies suggested that in the tumor microenvironment, noradrenaline concentrations may reach as high as 10 μM ( Zhang et al., 2020 Nilsson et al., 2007 Choi et al., 2015 The TP53 mutational status of the four breast cancer cell lines (MDA-MB-231, BT549, MCF7 and T47D) was gathered from Leroy et al. (2014) Basic morphology Spheroids were fixated in 10% formalin for 15 min, washed with PBS twice, dehydrated and paraffin embedded. Sections of 4 μm were subsequently deparaffinized and rehydrated using xylene and graded ethanol washes, respectively. H&E staining was then performed using standard procedures. Immunohistochemistry Sections of 4 μm were deparaffinized and rehydrated using xylene and graded ethanol washes. The following primary antibodies were used at the indicated dilutions: mouse anti-Ki67 (Agilent M7240, 1:250), rabbit anti-beta 2 Adrenergic Receptor (ADRB2) (Abcam ab182136, 1:100). Immunoperoxidase staining was performed using EnVision (Dako) with diaminobenzidine (DAB) as the peroxidase substrate. Counterstaining with hematoxylin was performed to visualize nuclei. Proteomics analysis Cell lysis, protein digestion, and processing Cells were lysed in 4% SDS in 100 mM Tris-HCl (pH 8.5) and sonicated in a water bath for 30 s three times. Extracted proteins (10 μg per sample) were reduced with Tris(2-carboxyethyl)-phosphine and alkylated with chloroacetamide. SP3 (Single-Pot Solid-Phase-enhanced Sample Preparation) was used for protein capture, cleaning, and digestion, followed by desalting using C18 columns (SPE). Tryptic peptides were dissolved in 100 mM triethyl ammonium bicarbonate and labeled with the TMT 18plex kit (ThermoFisher Scientific), using 16 out of 18 channels. The samples were fractionated into 8 fractions using the Pierce High pH Reversed-Phase Peptide Fractionation Kit (ThermoFisher Scientific) before LC-MS/MS analysis. LC-MS/MS analysis Approximately 0.5 μg of tryptic peptides (dissolved in 2% acetonitrile, 0.5% formic acid) were injected into an Ultimate 3,000 RSLC system (Thermo Scientific) coupled to an Orbitrap Eclipse mass spectrometer (Thermo Scientific) with an EASY-spray nano-electrospray ion source. Trapping and desalting The sample was loaded and desalted on a pre-column (Acclaim PepMap 100, 2 cm x 75 μm ID nanoViper column, packed with 3 μm C18 beads) at a flow rate of 5 μL/min for 5 min with 0.1% trifluoroacetic acid. LC RUN (140 min) Peptides were separated during a biphasic ACN gradient from two nanoflow UPLC pumps (flow rate of 250 nL/min) on a 25 cm analytical column (PepMap RSLC, 25 cm x 75 μm ID. EASY-spray column, packed with 2 μm C18 beads). Solvent A and B were 0.1% FA (vol/vol) in water and 100% ACN, respectively. The gradient composition was 5%B during trapping (5 min) followed by 5–7%B over 1 min, 7–22%B for the next 84 min, 22–28%B over 10 min, and 28–85%B over 5 min. Elution of very hydrophobic peptides and conditioning of the column were performed for 15 min isocratic elution with 85%B and 15 min isocratic conditioning with 5%B, respectively. Instrument control was through Thermo Scientific SII for Xcalibur 1.6. High field asymmetric waveform ion mobility spectrometry (FAIMS) The FAIMS filter performs gas-phase fractionation, enabling preferred accumulation of multiply charged ions to maximize the efficiency of data-dependent acquisition (DDA). FAIMS results in less precursor co-isolation (improved MS2 TMT quantification), and cleaner MS2 spectra. Short-ion residence time in the FAIMS Pro interface electrode assembly enables use of multiple CV settings in a single run to increase proteome coverage. DDA with FAIMS Peptides eluted from the column were detected in the Orbitrap Eclipse Mass Spectrometer with FAIMS enabled using two compensation voltages (CVs), −50 V, and −70. During each CV, the mass spectrometer was operated in the DDA-mode (data-dependent-acquisition) to automatically switch between one full scan MS and MS/MS acquisition. Instrument control was through Orbitrap Eclipse Tune 3.5 and Xcalibur 4.5. The cycle time was maintained at 1.5 s/CV. MS spectra were acquired in the scan range 375–1,500 m/z with resolution R Ion source parameter The spray and ion-source parameters were as follows. Ion spray voltage = 2000 V, no sheath and auxiliary gas flow, and capillary temperature = 275 °C. Data analysis Spheroid data For each cell line and treatment condition, 46 spheroids were analyzed using the Brightfield channel in the IncuCyte Spheroid Analysis Software Module to identify spheroid boundaries and quantification of spheroid area. Spheroid invasion assay To measure breast cancer spheroid cell invasion into surrounding extracellular matrix (Matrigel, Corning #356234), we generated spheroids by seeding MDA-MB-231 cells (5,000 cells per well), in a ULA round bottom 96-well plate (Corning #7007). Spheroids were allowed to form for 3 days in an incubator at 37 °C, 5% CO 2 Proteomics data Heatmap, GSEA and UMAP (Uniform Manifold Approximation and Projection) visualizations were generated using RStudio. For UMAP, GSEA and heatmap, the entire proteome was analyzed both pre- and post-drug treatment. Data was imported and processed in R using in-house generated scripts. Gene enrichment analysis was conducted to study the abundance of protein values and their biological function ( Liberzon et al., 2015 Subramanian et al., 2005 p Proteins significant by an alpha level of 0.05 were uploaded to Pathway Ingenuity Pathway Analysis program (IPA®, QIAGEN Redwood City, www.qiagen.com/ingenuity Krämer et al., 2014 Transcriptomic expression data Transcriptomic expression data for ADRB2 were retrieved from the Cancer Cell Line Encyclopedia (CCLE) via the DepMap portal. 1 We thank Simona Chera for helping with IPA analysis. We also thank Bendik Nordanger for excellent technical assistance. The spheroid quantifications were conducted at the Molecular Imaging Center (MIC), Department of Biomedicine, University of Bergen. Mass spectrometry-based proteomic analyses were performed by the Proteomics Unit at the University of Bergen (PROBE). This facility is a member of the National Network of Advanced Proteomics Infrastructure (NAPI), which is funded by the Research Council of Norway (INFRASTRUKTUR-program project number: 295910).  1 https://depmap.org/portal/ Data availability statement The datasets generated for this study can be found in the ProteomeXchange Consortium via the PRIDE repository with the dataset identifier PXD046841. The underlying codes and programs implemented for this study may be available upon reasonable request to the corresponding author. Ethics statement Ethical approval was not required for the studies on humans in accordance with the local legislation and institutional requirements because only commercially available established cell lines were used. Author contributions MC: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. OB: Data curation, Formal analysis, Investigation, Methodology, Software, Visualization, Writing – original draft. HV: Funding acquisition, Supervision, Writing – review & editing. LA: Conceptualization, Data curation, Formal analysis, Funding acquisition, Supervision, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fnins.2025.1608017/full#supplementary-material References Amaro F. Silva D. Reguengo H. Oliveira J. C. Quintas C. Vale N. 2020 β-Adrenoceptor activation in breast MCF-10A cells induces a pattern of catecholamine production similar to that of tumorigenic MCF-7 cells Int. J. Mol. Sci. 21 7968 10.3390/ijms21217968 33120955 PMC7672553 Baker J. G. Hill S. J. Summers R. J. 2011 Evolution of beta-blockers: from anti-anginal drugs to ligand-directed signalling Trends Pharmacol. Sci. 32 227 234 10.1016/j.tips.2011.02.010 21429598 PMC3081074 Barron T. I. Connolly R. M. Sharp L. Bennett K. Visvanathan K. 2011 Beta blockers and breast cancer mortality: a population- based study J. Clin. Oncol. 29 2635 2644 10.1200/JCO.2010.33.5422 21632503 Beg M. S. Gupta A. Sher D. Ali S. Khan S. Gao A. 2018 Impact of concurrent medication use on pancreatic Cancer survival-SEER-Medicare analysis Am. J. Clin. Oncol. 41 766 771 10.1097/COC.0000000000000359 28079594 PMC5503814 Bjornstad O. V. Carrasco M. Finne K. Ardawatia V. Winge I. Askeland C. 2024 Global and single-cell proteomics view of the co-evolution between neural progenitors and breast cancer cells in a co-culture model EBioMedicine 108 105325 10.1016/j.ebiom.2024.105325 39232464 PMC11404160 Cardwell C. R. Coleman H. G. Murray L. J. Entschladen F. Powe D. G. 2013 Beta-blocker usage and breast cancer survival: a nested case-control study within a UK clinical practice research datalink cohort Int. J. Epidemiol. 42 1852 1861 10.1093/ije/dyt196 24536096 Carracedo A. Cantley L. C. Pandolfi P. P. 2013 Cancer metabolism: fatty acid oxidation in the limelight Nat. Rev. Cancer 13 227 232 10.1038/nrc3483 23446547 PMC3766957 Carrasco M. Wang C. Søviknes A. M. Bjørlykke Y. Abadpour S. Paulo J. A. 2022 Spatial environment affects HNF4A mutation-specific proteome signatures and cellular morphology in hiPSC-derived β-like cells Diabetes 71 862 869 10.2337/db20-1279 35043148 PMC8965667 Choi M. J. Cho K. H. Lee S. Bae Y. J. Jeong K. J. Rha S. Y. 2015 hTERT mediates norepinephrine-induced slug expression and ovarian cancer aggressiveness Oncogene 34 3402 3412 10.1038/onc.2014.270 25151968 Eng J. W. Kokolus K. M. Reed C. B. Hylander B. L. Ma W. W. Repasky E. A. 2014 A nervous tumor microenvironment: the impact of adrenergic stress on cancer cells, immunosuppression, and immunotherapeutic response Cancer Immunol. Immunother. 63 1115 1128 10.1007/s00262-014-1617-9 25307152 PMC4325998 Gargiulo L. Rivero E. M. di Siervi N. Buzzi E. D. Buffone M. G. Davio C. A. 2020 Agonist effects of propranolol on non-tumor human breast cells Cells 9 1036 10.3390/cells9041036 32331276 PMC7226086 German N. J. Haigis M. C. 2015 Sirtuins and the metabolic hurdles in Cancer Curr. Biol. 25 R569 R583 10.1016/j.cub.2015.05.012 26126285 PMC5748939 Jabloñski M. Rodríguez M. S. Rivero E. M. Bruque C. D. Vanzulli S. Bruzzone A. 2023 The Beta2-adrenergic agonist salbutamol synergizes with paclitaxel on cell proliferation and tumor growth in triple negative breast cancer models Cancer Chemother. Pharmacol. 92 485 499 10.1007/s00280-023-04586-9 37725114 Jansen L. Hoffmeister M. Arndt V. Chang-Claude J. Brenner H. 2014 Stage-specific associations between beta blocker use and prognosis after colorectal cancer Cancer 120 1178 1186 10.1002/cncr.28546 24415516 Jayachandran P. Battaglin F. Strelez C. Lenz A. Algaze S. Soni S. 2023 Breast cancer and neurotransmitters: emerging insights on mechanisms and therapeutic directions Oncogene 42 627 637 10.1038/s41388-022-02584-4 36650218 PMC9957733 Jin M. Wang Y. Zhou T. Li W. Wen Q. 2023 Norepinephrine/β(2)-adrenergic receptor pathway promotes the cell proliferation and nerve growth factor production in triple-negative breast Cancer J. Breast Cancer 26 268 285 10.4048/jbc.2023.26.e25 37387350 PMC10315331 Karemaker J. M. 2017 An introduction into autonomic nervous function Physiol. Meas. 38 R89 r118 10.1088/1361-6579/aa6782 28304283 Kenny P. A. Lee G. Y. Myers C. A. Neve R. M. Semeiks J. R. Spellman P. T. 2007 The morphologies of breast cancer cell lines in three-dimensional assays correlate with their profiles of gene expression Mol. Oncol. 1 84 96 10.1016/j.molonc.2007.02.004 18516279 PMC2391005 Kim H. Y. Jung Y. J. Lee S. H. Jung H. J. Pak K. 2017 Is Beta-blocker use beneficial in breast Cancer? A Meta-Analysis Oncology 92 264 268 10.1159/000455143 28132057 Kim-Fuchs C. Le C. P. Pimentel M. A. Shackleford D. Ferrari D. Angst E. 2014 Chronic stress accelerates pancreatic cancer growth and invasion: a critical role for beta-adrenergic signaling in the pancreatic microenvironment Brain Behav. Immun. 40 40 47 10.1016/j.bbi.2014.02.019 24650449 PMC4102665 Krämer A. Green J. Pollard J. Jr. Tugendreich S. 2014 Causal analysis approaches in ingenuity pathway analysis Bioinformatics 30 523 530 10.1093/bioinformatics/btt703 24336805 PMC3928520 Leroy B. Girard L. Hollestelle A. Minna J. D. Gazdar A. F. Soussi T. 2014 Analysis of TP53 mutation status in human cancer cell lines: a reassessment Hum. Mutat. 35 756 765 10.1002/humu.22556 24700732 PMC4451114 Liberzon A. Birger C. Thorvaldsdóttir H. Ghandi M. Mesirov Jill P. Tamayo P. 2015 The molecular signatures database Hallmark gene set collection Cell Systems 1 417 425 10.1016/j.cels.2015.12.004 26771021 PMC4707969 Lofling L. L. Stoer N. C. Sloan E. K. Chang A. Gandini S. Ursin G. 2022 beta-blockers and breast cancer survival by molecular subtypes: a population-based cohort study and meta-analysis Br. J. Cancer 127 1086 1096 10.1038/s41416-022-01891-7 35725814 PMC9470740 Lorona N. C. Cook L. S. Tang M. C. Hill D. A. Wiggins C. L. Li C. I. 2021 Antihypertensive medications and risks of recurrence and mortality in luminal, triple-negative, and HER2-overexpressing breast cancer Cancer Causes Control 32 1375 1384 10.1007/s10552-021-01485-3 34347212 PMC8541909 Manuel Iglesias J. Beloqui I. Garcia-Garcia F. Leis O. Vazquez-Martin A. Eguiara A. 2013 Mammosphere formation in breast carcinoma cell lines depends upon expression of E-cadherin PLoS One 8 e77281 10.1371/journal.pone.0077281 24124614 PMC3790762 Melhem-Bertrandt A. Chavez-Macgregor M. Lei X. Brown E. N. Lee R. T. Meric-Bernstam F. 2011 Beta-blocker use is associated with improved relapse-free survival in patients with triple-negative breast cancer J. Clin. Oncol. 29 2645 2652 10.1200/JCO.2010.33.4441 21632501 PMC3139371 Modi N. D. Tan J. Q. E. Rowland A. Koczwara B. Kichenadasse G. McKinnon R. A. 2020 The influence of pre-existing beta-blockers use on survival outcomes in HER2 positive advanced breast cancer: pooled analysis of clinical trial data Front. Oncol. 10 1130 10.3389/fonc.2020.01130 32760671 PMC7373122 Nilsson M. B. Armaiz-Pena G. Takahashi R. Lin Y. G. Trevino J. Li Y. 2007 Stress hormones regulate interleukin-6 expression by human ovarian carcinoma cells through a Src-dependent mechanism J. Biol. Chem. 282 29919 29926 10.1074/jbc.M611539200 17716980 Nolan E. Lindeman G. J. Visvader J. E. 2023 Deciphering breast cancer: from biology to the clinic Cell 186 1708 1728 10.1016/j.cell.2023.01.040 36931265 Ouyang X. Zhu Z. Yang C. Wang L. Ding G. Jiang F. 2019 Epinephrine increases malignancy of breast cancer through p38 MAPK signaling pathway in depressive disorders Int. J. Clin. Exp. Pathol. 12 1932 1946 31934016 PMC6949628 Overman J. Fontaine F. Wylie-Sears J. Moustaqil M. Huang L. Meurer M. 2019 R-propranolol is a small molecule inhibitor of the SOX18 transcription factor in a rare vascular syndrome and hemangioma eLife 8 e43026 10.7554/eLife.43026 31358114 PMC6667216 Pasquier E. Ciccolini J. Carre M. Giacometti S. Fanciullino R. Pouchy C. 2011 Propranolol potentiates the anti-angiogenic effects and anti-tumor efficacy of chemotherapy agents: implication in breast cancer treatment Oncotarget 2 797 809 10.18632/oncotarget.343 22006582 PMC3248157 Renz B. W. Takahashi R. Tanaka T. Macchini M. Hayakawa Y. Dantes Z. 2018 β2 adrenergic-Neurotrophin feedforward loop promotes pancreatic Cancer Cancer Cell 33 75 90.e7 10.1016/j.ccell.2017.11.007 29249692 PMC5760435 Rivero E. M. Piñero C. P. Gargiulo L. Entschladen F. Zänker K. Bruzzone A. 2017 The β 2-adrenergic agonist salbutamol inhibits migration, invasion and metastasis of the human breast cancer MDA-MB- 231 cell line Curr. Cancer Drug Targets 17 756 766 10.2174/1568009617666170330151415 28359245 Saraiva D. P. Matias A. T. Braga S. Jacinto A. Cabral M. G. 2020 Establishment of a 3D co-culture with MDA-MB-231 breast cancer cell line and patient-derived immune cells for application in the development of immunotherapies Front. Oncol. 10 1 13 10.3389/fonc.2020.01543 32974189 PMC7482668 Scott O. W. Tin Tin S. Elwood J. M. Cavadino A. Habel L. A. Kuper-Hommel M. 2022 Post-diagnostic beta blocker use and breast cancer-specific mortality: a population-based cohort study Breast Cancer Res. Treat. 193 225 235 10.1007/s10549-022-06528-0 35286523 PMC8993732 Scott O. W. TinTin S. Cavadino A. Elwood J. M. 2024 Beta-blocker use and breast cancer outcomes: a meta-analysis Breast Cancer Res. Treat. 206 443 463 10.1007/s10549-024-07263-4 38837086 PMC11208256 Silva D. Quintas C. Gonçalves J. Fresco P. 2024 β2-adrenoceptor activation favor Acquisition of Tumorigenic Properties in non-tumorigenic MCF-10A breast epithelial cells Cells 13 262 10.3390/cells13030262 38334654 PMC10854540 Sørensen G. V. Ganz P. A. Cole S. W. Pedersen L. A. Sørensen H. T. Cronin-Fenton D. P. 2013 Use of β-blockers, angiotensin-converting enzyme inhibitors, angiotensin II receptor blockers, and risk of breast cancer recurrence: a Danish nationwide prospective cohort study J. Clin. Oncol. 31 2265 2272 10.1200/JCO.2012.43.9190 23650417 PMC3677839 Spera G. Fresco R. Fung H. Dyck J. R. B. Pituskin E. Paterson I. 2017 Beta blockers and improved progression-free survival in patients with advanced HER2 negative breast cancer: a retrospective analysis of the ROSE/TRIO-012 study Ann. Oncol. 28 1836 1841 10.1093/annonc/mdx264 28520849 Subramanian A. Tamayo P. Mootha V. K. Mukherjee S. Ebert B. L. Gillette M. A. 2005 Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc. Natl. Acad. Sci. USA 102 15545 15550 10.1073/pnas.0506580102 16199517 PMC1239896 Sung H. Ferlay J. Siegel R. L. Laversanne M. Soerjomataram I. Jemal A. 2021 Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 71 209 249 10.3322/caac.21660 33538338 Watkins J. L. Thaker P. H. Nick A. M. Ramondetta L. M. Kumar S. Urbauer D. L. 2015 Clinical impact of selective and nonselective beta-blockers on survival in patients with ovarian cancer Cancer 121 3444 3451 10.1002/cncr.29392 26301456 PMC4575637 Wehrwein E. A. Orer H. S. Barman S. M. 2016 Overview of the anatomy, physiology, and pharmacology of the autonomic nervous system Compr. Physiol. 6 1239 1278 10.1002/j.2040-4603.2016.tb00714.x 27347892 Winter M. Meignan S. Volkel P. Angrand P. O. Chopin V. Bidan N. 2021 Vimentin promotes the aggressiveness of triple negative breast Cancer cells surviving chemotherapeutic treatment Cells 10 1504 10.3390/cells10061504 34203746 PMC8232646 Yersal O. Barutca S. 2014 Biological subtypes of breast cancer: prognostic and therapeutic implications World J Clin Oncol. 5 412 424 10.5306/wjco.v5.i3.412 25114856 PMC4127612 Yue J. Zhang K. Chen J. 2012 Role of integrins in regulating proteases to mediate extracellular matrix remodeling Cancer Microenviron. 5 275 283 10.1007/s12307-012-0101-3 22437309 PMC3460049 Zahalka A. H. Arnal-Estape A. Maryanovich M. Nakahara F. Cruz C. D. Finley L. W. S. 2017 Adrenergic nerves activate an angio-metabolic switch in prostate cancer Science 358 321 326 10.1126/science.aah5072 29051371 PMC5783182 Zahalka A. H. Frenette P. S. 2020 Nerves in cancer Nat. Rev. Cancer 20 143 157 10.1038/s41568-019-0237-2 31974491 PMC7709871 Zhang D. Ma Q. Y. Hu H. T. Zhang M. 2010 Β2-adrenergic antagonists suppress pancreatic cancer cell invasion by inhibiting CREB, NFκB and AP-1 Cancer Biol. Ther. 10 19 29 10.4161/cbt.10.1.11944 20424515 Zhang B. Wu C. Chen W. Qiu L. Li S. Wang T. 2020 The stress hormone norepinephrine promotes tumor progression through β2-adrenoreceptors in oral cancer Arch. Oral Biol. 113 104712 10.1016/j.archoralbio.2020.104712 32234582 ",
  "metadata": {
    "Title of this paper": "The stress hormone norepinephrine promotes tumor progression through β2-adrenoreceptors in oral cancer",
    "Journal it was published in:": "Frontiers in Neuroscience",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483918/"
  }
}