{
  "title": "Paper_334",
  "abstract": "pmc Front Public Health Front Public Health 2277 frontpubhealth Front. Public Health Frontiers in Public Health 2296-2565 Frontiers Media SA PMC12484034 PMC12484034.1 12484034 12484034 41041361 10.3389/fpubh.2025.1631799 1 Public Health Policy and Practice Reviews The deadly triple M (mistrust, misinformation, and missed opportunities): understanding Romania’s COVID-19 vaccination campaign and its lasting impact on public health Dascalu Stefan  1  * Raiu Catalin Valentin  2 Olteanu Emilian  3  4 Comanici Adrian Vasile  5  6 Comanici Mihaela Maria  7 Toma Tudor P.  8  9 Robu Bogdan Ionut  10 Mihailov Raul  11  12 Mina-Raiu Laura  13 Dumitra Gindrovel Gheorghe  14 Azoicai Doina  15 Popovici Emilian Damian  16  17 Apetrei Cristian  18  19  * 1 Department of Biology, University of Oxford, Peter Medawar Building for Pathogen Research Oxford United Kingdom 2 Department of Public Administration, Faculty of Business and Administration, University of Bucharest Bucharest Romania 3 Department of Pathology, British Columbia Cancer Agency Vancouver, BC Canada 4 Department of Pathology and Laboratory Medicine, University of British Columbia Vancouver, BC Canada 5 Department of Endocrinology, “Titu Maiorescu” University of Medicine and Pharmacy Bucharest Romania 6 Department of Endocrinology, C.F.2 Clinical Hospital Bucharest Romania 7 Department of Immunology, “Titu Maiorescu” University of Medicine and Pharmacy Bucharest Romania 8 Lewisham and Greenwich NHS Trust London United Kingdom 9 King’s College London United Kingdom 10 Great Western Hospitals NHS Foundation Trust Swindon United Kingdom 11 Faculty of Medicine and Pharmacy, Dunarea de Jos University Galați Romania 12 Clinical Emergency Hospital “Sf. Ap. Andrei” Galați Romania 13 Bucharest University of Economic Studies Bucharest Romania 14 Family Medicine Department, University of Medicine and Pharmacy of Craiova Craiova Romania 15 Department of Epidemiology, School of Medicine, Grigore T. Popa University of Medicine and Pharmacy Iași Romania 16 Department of Epidemiology, School of Medicine, Victor Babeş University of Medicine and Pharmacy Timişoara Romania 17 Regional Centre of Public Health Timişoara Romania 18 Division of Infectious Diseases, School of Medicine, University of Pittsburgh Pittsburgh, PA United States 19 Department of Infectious Diseases and Immunology, Graduate School of Public Health, University of Pittsburgh Pittsburgh, PA United States Edited by: Ariadna Munté Reviewed by: Kerem Kinik Ricardo De Moraes E. Soares *Correspondence: Stefan Dascalu, Stefan.dascalu@biology.ox.ac.uk apetreic@pitt.edu 17 9 2025 2025 13 480651 1631799 20 5 2025 29 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Dascalu, Raiu, Olteanu, Comanici, Comanici, Toma, Robu, Mihailov, Mina-Raiu, Dumitra, Azoicai, Popovici and Apetrei. 2025 Dascalu, Raiu, Olteanu, Comanici, Comanici, Toma, Robu, Mihailov, Mina-Raiu, Dumitra, Azoicai, Popovici and Apetrei https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Romania’s COVID-19 vaccination campaign presents a compelling case study on the intersection of public health policy, societal dynamics, and political influences in pandemic response. Despite an initially promising rollout, Romania ultimately achieved one of the lowest vaccination rates in the European Union, with severe consequences during the subsequent pandemic waves. This review examines the key factors contributing to the campaign’s shortcomings, including pre-existing vaccine hesitancy, widespread misinformation, inadequate governmental communication strategies, and the politicisation of public health efforts. We explore the deep-seated mistrust in governmental institutions, exacerbated by restrictive measures implemented without adequate public engagement, as well as the influential role of religious communities and the rise of populist political forces that actively opposed vaccination efforts. Additionally, we discuss the impact of media sensationalism, conspiracy theories, and the failure to regulate anti-vaccine rhetoric within the medical profession. While logistical and infrastructural challenges were largely addressed, the inability to effectively engage key societal stakeholders led to lagging of vaccine uptake. The consequences of this failure extended beyond COVID-19, contributing to a severe measles outbreak in 2023, which underscored the long-term deleterious effects of vaccine hesitancy. Drawing from Romania’s experience, we highlight critical lessons for future public health campaigns, emphasising the need for trust-building initiatives, targeted misinformation countermeasures, stronger community engagement, and enhanced collaboration with religious and cultural institutions. By addressing these challenges, countries worldwide can strengthen their public health frameworks and improve the resilience of their immunisation programmes in the face of future crises. public health Romania misinformation COVID-19 vaccination vaccine hesitancy The author(s) declare that financial support was received for the research and/or publication of this article. CA is supported by the National Institutes of Health (NIH) through grants R01 DK119936, R01 DK113919, R01 DK131476, and R01 DK130481 from the National Institute of Diabetes and Digestive and Kidney Diseases; and R01AI179317 and R01 AI119346 from the National Institute of Allergy and Infectious Diseases (NIAID). Funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Public Health Policy Highlights We identify and analyze a “deadly triple M” (mistrust, misinformation, and missed opportunities) that collectively undermined vaccine uptake and left lasting impacts on public health. The analysis is organized across four distinctive time periods: Pre-COVID pandemic, when inadequate public health measures,pre-existing conceptions, prior national outbreaks (e.g. measles), and entrenched anti-vaccine narratives shaped public attitudes. Early COVID pandemic (before the vaccination campaign), when restrictive measures, political instability, and inconsistent communication eroded public trust. Mid-late COVID (during the vaccination campaign), when politicization, inadequate engagement with community stakeholders (including religious communities), and the influence of anti-vaccine voices stalled uptake. Post-pandemic, when low MMR vaccine coverage contributed to a severe measles outbreak in 2023, demonstrating the long-term spillover effects of pandemic-era misinformation. Drawing on these findings, the paper outlines policy implications and offers eight targeted recommendations aimed at rebuilding trust, improving stakeholder engagement, countering misinformation, and strengthening Romania’s capacity to respond to future public health crises. These lessons hold broad international relevance for countries facing similar challenges in vaccine acceptance and public health communication. Introduction National COVID-19 vaccination campaigns began throughout the world as the vaccines became available by the end of 2020, the first year of the COVID-19 pandemic ( 1 2 3 4 4 5 Several unique demographic and socio-economic characteristics made Romania stand out with regards to the implications for public health management, especially given its very large and widespread diaspora ( 6 7 en masse 8 9 10 11 6 The COVID-19-related pressures exerted on the healthcare system peaked successively during each of the first four waves of the pandemic, which were caused by the spread of different virus variants ( 12–14 5 15–19 15 16 20 21 The national COVID-19 vaccination campaign began in Romania on the 27th of December 2020 and was coordinated by the Romanian National Committee on COVID-19 Vaccination (CNCAV) ( 5 22 23 5 24 Meanwhile, the fifth COVID-19 wave, primarily caused by the Omicron variant in early 2022, found a population which was mainly immunised naturally, and only partly through vaccination ( 25 26 “Rovaccination. Mission accomplished” 27 23 In this paper, we present a critical narrative review structured around a chronological framework which examines key events and their implications for Romania’s COVID-19 vaccination campaign. We reviewed policy documents, peer-reviewed academic literature, and non-academic public sources (including press coverage) to capture public perceptions, narratives and policy/governmental positioning. These materials were critically analysed to assess the public health impact of significant pandemic events on vaccination uptake and societal perceptions of vaccination in Romania. Based on our analysis, we formulated targeted recommendations to address identified challenges and strengthen future public health responses. Pre-COVID-19: historical context and pre-existing vaccine narratives in Romania Romania’s prepandemic profile did not place the country in a favorable position to manage the consequences of COVID-19. Indeed, the country was already facing major challenges with regards to the provisioning of hospitals, their adequate staffing, vaccine acceptance by the overall population, and appropriate funding of the health sector as a whole ( 6 28 28 per se 5 6 29 An important catalyst of the 2016–2018 measles epidemic and, later on, a driver of the COVID-19 vaccination outcomes was the general public perception of vaccinations in Romania ( 28 30 31 6 28 32 33 28 29 34 The first year of the pandemic in Romania: towards a COVID-19 vaccine amid trust erosion and public health challenges Restrictive measures and erosion of public trust in Romanian authorities The prepandemic hesitancy of the Romanian population towards vaccinations was further fueled by the severe restrictions and lockdowns implemented during the first year of the COVID-19 pandemic ( 6 6 35 6 This triggered a general sentiment of frustration and mistrust in national authorities, which was revealed by a survey carried out in May 2020, just after the first lockdown, when only 36% of respondents favorably viewed the Government as a trustful partner following the early COVID-19 crisis ( 36 36 28 37 5 Mass media and conspiracy theories Since the dawn of the COVID-19 epidemic, Romanian media coverage of the subject varied vastly in terms of scientific accuracy. It was generally filled with sensationalist stories (many of which were hypothetical scenarios) mixed with factual news. For the public, this made genuine information difficult to disentangle from alarmist scenarios and sometimes even conspiracy theories ( 38 39 40–42 Moreover, the scientific communication efforts on pandemic matters were generally unstructured and inconsistent in Romania ( 5 43 Religious communities during the COVID-19 vaccine rollout The cultural context also played an important role; religious identity and religiosity proved to be important catalysts for public health policy implementation in Romania [for a comprehensive review, see ref. ( 44 45 46 47 An illustrative example of the lack of dialogue with religious communities in Romania was the total ban on visits to cemeteries in 2020, from 16 March until 15 May ( 48 44 48 44 48 Changes in the political landscape General elections were held in December 2020, at the end of pandemic’s first year, and led to the emergence of a new political party, highly conservative and nationalistic in its ideology: the Alliance for the Union of Romanians (AUR) ( 49 50 51 The anti-restriction and anti-vaccine campaign of AUR was also indirectly fueled by the governmental measures that impacted freedom of religion and belief ( 52 45 51 43 51 53 Altogether, although it is difficult to quantify, the events that occurred during the first year of the pandemic likely shifted public perception towards an incremental dissatisfaction with the way the pandemic was handled by the Romanian authorities, and they further eroded the public trust in COVID-19 control efforts. The COVID-19 vaccination campaign: rollout, stakeholder engagement, influence of politics, and public reception By late 2020, as the prospect of COVID-19 vaccines became reality, Romanian authorities began preparations for the national immunization campaign ( 29 29 29 To address the challenges of the vaccination campaign and to directly manage the implementation of COVID-19 vaccines in Romania, a National Coordination Committee on COVID-19 Vaccination (CNCAV) was created, reporting directly to the Ministry of Defense and the Prime Minister ( 54 Early COVID-19 vaccine rollout struggles In the first months of 2021, the CNCAV faced significant logistical and operational challenges to an optimal vaccine rollout ( 29 36 28 A promising start, but an abysmal outcome In the initial stages of the vaccination campaign, Romania achieved one of the fastest COVID-19 vaccine uptakes in the European Union ( 55 5 55 5 5 Opposition to vaccine and Romanian healthcare professionals The Romanian healthcare professional community, despite achieving higher vaccination rates, was still confronted with refusals of the vaccine by some health professionals ( 56 51 57 Some of these doctors promoted unproven treatments, exaggerated vaccine risks, or downplayed the severity of the pandemic, while others denied the existence of viruses, questioned vaccine efficacy, or spread conspiracy theories ( 51 57 58 Unlike other EU countries, where misinformation was met with firm sanctions and professional outrage, Romania saw little reaction from the medical professions. Very few voices consistently raised against this flood of misinformation and disinformation ( 59 COVID-19 vaccination and religious communities The CNCAV’s approach regarding religious organizations aimed at eliciting clear statements in favour of vaccination from their leaders and clergymen ( 44 60 45 44 61 Efforts by the authorities to involve the Romanian Orthodox Church and other religious groups more actively in the vaccination campaign, such as requesting priests to receive vaccinations live on television or suggesting churches as vaccination sites, did little to sway public opinion ( 62 44 44 45 52 44 52 Conspiracy theories, often fueled by online misinformation and religious fundamentalist rhetoric, further deepened mistrust. Notably, on numerous occasions, certain priests [or even bishops, see ref. ( 44 63 64 59 Politicizing the vaccination campaign The COVID-19 vaccination campaign in Romania quickly became a highly politicized issue, with statements from the country’s leadership playing a key role in framing the narrative. The Prime Minister and the President both declared in June 2021 that Romania had effectively “ended the pandemic” through vaccination efforts, a claim that was premature and ultimately misleading, as it could be seen few months later by the onset of the fourth Delta wave that followed their declarations and was the most lethal ( 5 43 50 Inequities in healthcare access and vaccination coverage The challenges faced by the Romanian COVID-19 vaccination campaign were also compounded by longstanding inequities in access to healthcare that predated the pandemic. Rural communities, low-income groups, and marginalized minorities such as the Roma population often faced barriers of availability and acceptance of care. For example, one study that focused on Central and South-East European countries (including Romania) found that Roma children had substantially lower vaccination coverage compared with non-Roma peers, in some cases less than half for essential vaccines such as DPT, MMR, polio, and BCG ( 65 28 66 67 The aftermath of the COVID-19 pandemic and its impact on vaccination Romanian public health By the end of Romania’s COVID-19 vaccination campaign, the country found itself among the least vaccinated nations in the European Union ( 68 68 69 70–73 Post campaign, sentiments towards vaccination in Romania remained highly polarized. While a significant portion of the population saw the benefits of vaccination, a vocal minority continued to claim deep skepticism ( 51 74 75 As such, the reluctance to vaccinate, initially tied to COVID-19 vaccination fears, became a broader public health challenge that endangered not only COVID-19 control but also the prevention of other infectious diseases, including measles. The persistence of anti-vaccine narratives, fueled by misinformation spread during the COVID-19 pandemic, left Romania vulnerable to outbreaks, and the public health campaigns to address these issues will likely face substantial challenges in counteract the damage. Discussion and recommendations In December 2022, the Romanian National Committee on COVID-19 Vaccination declared the vaccination campaign a success, branding the report as “Rovaccination: Mission Accomplished.” 76 The politicization of the vaccination effort, along with triumphalist statements from political leaders, created false expectations and undermined public trust when the pandemic continued to devastate the country. This mistrust, combined with inadequate communication strategies and the failure to address anti-vaccine voices within the medical community, left Romania ill-prepared to combat subsequent waves of COVID-19 and other preventable diseases. As a result, the country not only faced a devastating Delta wave (with October 2021 being one of the most lethal months in country’s history), but also a severe measles outbreak in 2024, illustrating the long-term consequences of vaccine hesitancy and the failure to effectively manage public health crises. Romania’s experience highlights the critical need for rebuilding trust in health institutions and addressing the pervasive influence of misinformation to ensure better outcomes in future public health campaigns ( 77 Strengthening trust in public institutions 78 Combating misinformation Engaging healthcare professionals as partners and advocates Developing community-centered health campaigns Enhancing public literacy on preventive health measures Leveraging technology for health education Building resilience in the healthcare system Incorporating religious and cultural sensitivities into public health campaigns While Romania’s COVID-19 vaccination campaign faced significant challenges and was ultimately not a success in terms of broad population coverage, the benefits of vaccination for those who accepted it were undeniable. It also proven that the country has all the necessary infrastructure to carry a successful campaign, should the public be convinced by the usefulness of vaccination. By addressing the key aspects above, we believe that significant and measurable improvements can be made, thereby improving the prevention and control of infectious diseases in Romania and enhancing public health in its broader terms. Conversely, failure to address these issues may have devastating spillover effect on vaccination campaigns for diseases that can induce long-term sequelae and mortality in pediatric populations. It is also important to note the limitations of this current work. As a narrative review based on secondary sources, our analysis depends on the accuracy and objectivity of the materials consulted. Whilst most of the authors were involved in various aspects of pandemic control in Romania (including the COVID-19 vaccination campaign), no primary data collection was conducted, and causal relationships are unable be established with statistical backing. Nonetheless, we believe that the current paper offers a comprehensive account of Romania’s experience that may inform preparedness and response strategies in other countries facing similar challenges. These insights remain valuable even in the absence of primary data, as they highlight critical leverage points for improving public health communication, stakeholder engagement, and vaccine uptake in future crises. Particularly, we identified a deadly triple M association (mistrust, misinformation, and missed opportunities) which, left unresolved or insufficiently addressed, has the potential to derail any national and international prevention campaign. Addressing the critical areas of trust, communication, and community engagement, is the cornerstone of any approach to improve the effectiveness of vaccination efforts globally. The authors would like to acknowledge Ciprian Negoita for useful feedback and suggestions in the early stages of the manuscript. Author contributions SD: Conceptualization, Investigation, Methodology, Writing – original draft, Writing – review & editing. CR: Writing – original draft, Writing – review & editing. EO: Writing – original draft, Writing – review & editing. AC: Writing – original draft, Writing – review & editing. MC: Writing – original draft, Writing – review & editing. TT: Writing – original draft, Writing – review & editing. BR: Writing – original draft, Writing – review & editing. RM: Writing – original draft, Writing – review & editing. LM-R: Writing – original draft, Writing – review & editing. GD: Writing – original draft, Writing – review & editing. DA: Writing – original draft, Writing – review & editing. EP: Writing – original draft, Writing – review & editing. CA: Conceptualization, Investigation, Project administration, Supervision, Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Mathieu E Ritchie H Ortiz-Ospina E Roser M Hasell J Appel C A global database of COVID-19 vaccinations Nat Hum Behav 2021 5 947 53 10.1038/s41562-021-01122-8 33972767 2. Iacobucci G Covid-19: government must invest in primary care to aid pandemic recovery, say leaders BMJ 2021 373 n1208 10.1136/BMJ.N1208 33975859 3. COVID-19: Romania in eye of storm with record infections and deaths | Euronews. Available online at: https://www.euronews.com/2021/10/19/romania-in-eye-of-covid-storm-with-death-rate-among-world-s-highest 4. With a minority vaccinated in Romania, fears of fifth wave mount | Coronavirus pandemic News | Al Jazeera. Available online at: https://www.aljazeera.com/news/2021/12/14/with-a-minority-vaccinated-in-romania-fears-of-fifth-wave-mount 5. Dascalu S Geambasu O Valentin Raiu C Azoicai D Damian Popovici E Apetrei C COVID-19 in Romania: what went wrong? Front Public Heal 2021 9 813941 10.3389/FPUBH.2021.813941/BIBTEX 34976942 PMC8718595 6. Dascalu S The successes and failures of the initial COVID-19 pandemic response in Romania Front Public Health 2020 8 344 10.3389/fpubh.2020.00344 32766201 PMC7381272 7. Turcu-Stiolica A Boicea AR Nechita F Surugiu R Dumitra GG Oancea CN Development and validation of a questionnaire to measure COVID-19 vaccine hesitancy within the Romanian industrial laborers Front Public Health 2025 13 1482778 10.3389/FPUBH.2025.1482778 /BIBTEX 40084211 PMC11903443 8. Gherghel I Bulai M Is Romania ready to face the novel coronavirus (COVID-19) outbreak? The role of incoming travelers and that of Romanian diaspora Travel Med Infect Dis 2020 34 101628 10.1016/j.tmaid.2020.101628 32184128 PMC7195522 9. Surleac M Banica L Casangiu C Cotic M Florea D Sandulescu O Molecular epidemiology analysis of SARS-CoV-2 strains circulating in Romania during the first months of the pandemic Life 2020 10 1 13 10.3390/LIFE10080152 32823907 PMC7460100 10. Lobiuc A Dimian M Gheorghita R Sturdza OAC Covasa M Introduction and characteristics of SARS-CoV-2 in north-east of Romania during the first COVID-19 outbreak Front Microbiol 2021 12 654417 10.3389/FMICB.2021.654417 34305826 PMC8292954 11. Romania: Country Health Profile 2021 | OECD https://www.oecd.org/en/publications/2021/12/romania-country-health-profile-2021_16e10e35.html 12. Lobiuc A Dimian M Sturdza O Filip R Covasa M Emergence of the first strains of SARS-CoV-2 lineage B.1.1.7 in Romania: genomic analysis JMIRx med 2021 2 e28049 10.2196/28049 34424256 PMC8363123 13. Hohan R Milu P Paraschiv S Casangiu C Tudor A Vlaicu O The predictive value of mutation screening for anticipating COVID-19 waves Pathogens 2021 10 1464 10.3390/PATHOGENS10111464 34832619 PMC8622441 14. Surleac M Casangiu C Banica L Milu P Florea D Sandulescu O Short communication: evidence of novel SARS-CoV-2 variants circulation in Romania AIDS Res Hum Retrovir 2021 37 329 32 10.1089/AID.2021.0009 33544010 15. Olariu TR Craciun AC Vlad DC Dumitrascu V Marincu I Lupu MA Sars-cov-2 seroprevalence in western Romania, March to June 2021 Medicina (Kaunas) 2022 58 35 10.3390/MEDICINA58010035 PMC8781951 35056343 16. Olariu TR Lighezan R Ursoniu S Craciun AC Paduraru AA Lupu MA Seroprevalence of SARS-CoV-2 antibodies in 2115 blood donors from Romania Clin Microbiol Infect 2021 27 817 9 10.1016/j.cmi.2020.12.027 33421577 PMC8084417 17. Olariu TR Ursoniu S Craciun AC Dumitrascu V Vlad DC Olariu AT SARS-CoV-2 seroprevalence and associated risk factors in adult outpatients from Western Romania, January to march 2023: a seroepidemiological assessment after three years of COVID-19 pandemic Infect Dis 2025 57 464 74 10.1080/23744235.2025.2464864 39964283 18. Trofin F Luncă C Păduraru D Anton-Păduraru DT Buzilă ER Nastase EV SARS-CoV-2 seroprevalence in children under 5 years old—a regional seroepidemiological study Medicina (Kaunas) 2024 60 384 10.3390/MEDICINA60030384 38541109 PMC10972281 19. Olariu TR Lighezan R Ursoniu S Craciun AC Mihu AG Lupu MA High SARS-CoV-2 seroprevalence in blood donors from Romania after the third COVID-19 pandemic wave Infect Dis 2022 54 534 7 10.1080/23744235.2022.2036811 35147060 20. Chu DK Akl EA Duda S Solo K Yaacoub S Schünemann HJ Physical distancing, face masks, and eye protection to prevent person-to-person transmission of SARS-CoV-2 and COVID-19: a systematic review and meta-analysis Lancet 2020 395 1973 87 10.1016/S0140-6736(20)31142-9/ATTACHMENT/FAA1007C-5EA4-45CD-8970-D9FC324225FF/MMC1.PDF 32497510 PMC7263814 21. Streinu-Cercel A Sars-cov-2 in Romania—situation update and containment strategies GERMS 2020 10 8 10.18683/GERMS.2020.1179 32274354 PMC7117882 22. Loghin II Mihai IF Roşu MF Diaconu IE Vâţă A Popa R Characteristics and trends of COVID-19 infection in a tertiary hospital in Romania: a retrospective study J Pers Med 2022 12 1928 10.3390/JPM12111928 36422104 PMC9698915 23. Coronavirus (COVID-19) Vaccinations-Our World in Data. Available online at: https://ourworldindata.org/covid-vaccinations?country=Romania 24. Vulturar DM Moacă LȘ Neag MA Mitre AO Alexescu TG Gherman D Delta variant in the COVID-19 pandemic: a comparative study on clinical outcomes based on vaccination status J Pers Med 2024 14 358 10.3390/JPM14040358 38672984 PMC11050903 25. What immunity rate does Romania have, if we take into account both the vaccinated and the people who have had COVID? Informaţiile publicate pe site-ul Digi24.ro pot fi preluate, în conformitate cu legislația aplicabilă, doar în limita a 120 de caractere. Available online at: https://www.digi24.ro/stiri/actualitate/sanatate/ce-rata-de-imunitate-are-romania-daca-tinem-cont-si-de-vaccinati-si-de-persoanele-care-au-avut-covid-1534895 https://www.digi24.ro/stiri/actualitate/sanatate/ce-rata-de-imunitate-are-romania-daca-tinem-cont-si-de-vaccinati-si-de-persoanele-care-au-avut-covid-1534895 26. Study: 20% of the population in Romania’s biggest COVID-19 hotspot developed immunity to the new coronavirus | Romania Insider. Available online at: https://www.romania-insider.com/medlife-study-immunity-coronavirus-suceava 27. Agerpres https://www.agerpres.ro/sanatate/2023/01/10/raport-cncav-acoperirea-vaccinala-impotriva-covid-19-la-nivel-national-41-85-din-populatia-generala--1041410 28. Dascalu S Measles epidemics in Romania: lessons for public health and future policy Front Public Health 2019 7 1–8 10.3389/fpubh.2019.00098 31073518 PMC6496956 29. Dascalu S Geambasu O Covaciu O Chereches RM Diaconu G Dumitra GG Prospects of COVID-19 vaccination in Romania: challenges and potential solutions Front Public Health 2021 9 90 10.3389/FPUBH.2021.644538 33643998 PMC7902778 30. Dumitra G Factors influencing the vaccination coverage in Romania Pediatruro 2017 1 14 10.26416/PEDI.45.1.2017.547 31. Offit PA Bad advice: or why celebrities, politicians, and activists aren’t your best source of health information 251 Columbia University Press 2018 32. Kurpas D Stefanicka–wojtas D Soll–morka A Lomper K Uchmanowicz B Blahova B Vaccine hesitancy and immunization patterns in central and Eastern Europe: sociocultural, economic, political, and digital influences across seven countries Risk Manag Healthc Policy 2025 18 1911 34 10.2147/RMHP.S519479 40529847 PMC12170812 33. Manolescu LSC Zugravu C Zaharia CN Dumitrescu AI Prasacu I Radu MC Barriers and facilitators of Romanian HPV (human papillomavirus) vaccination Vaccine 2022 10 1722 10.3390/VACCINES10101722/S1 PMC9611461 36298587 34. Neculau AE Șovăilă S Dumitra G Pistol A Rogozea L Lăcătuș A Assessing and bridging the gap in vaccinology education: insights from Romanian medical universities BMC Med Educ 2025 25 1 10 10.1186/S12909-025-07184-W/TABLES/6 40287749 PMC12034130 35. Corbu N Negrea-Busuioc E Udrea G Radu L Romanians’ willingness to comply with restrictive measures during the COVID-19 pandemic: evidence from an online survey J Appl Commun Res 2021 49 369 86 10.1080/00909882.2021.1912378 36. THE STATE OF EMERGENCY IN ROMANIA https://ires.ro/articol/397/bilan-ul-starii-de-urgen%C8%9B%C4%83-in-romania 37. Stoica CA Umbreș R Suspicious minds in times of crisis: determinants of Romanians’ beliefs in COVID-19 conspiracy theories Eur Soc 2021 23 S246 61 10.1080/14616696.2020.1823450 38. Mărcău FC Purec S Niculescu G Study on the refusal of vaccination against COVID-19 in Romania Vaccine 2022 10 261 10.3390/VACCINES10020261 PMC8879492 35214719 39. Cristea D Ilie DG Constantinescu C Fîrțală V Acceptance, hesitancy, and refusal in anti-COVID-19 vaccination: a cluster analysis aiming at the typology behind these three concepts Vaccine 2022 10 1496 10.3390/VACCINES10091496 PMC9506246 36146574 40. Comer L Donelle L Ngole M Shelley JJ Kothari A Smith M An investigation of media reports of digital surveillance within the first year of the COVID-19 pandemic Front Digit Health 2023 5 1215685 10.3389/FDGTH.2023.1215685 /BIBTEX 37564881 PMC10411532 41. Islam MS Sarkar T Khan SH Kamal AHM Murshid Hasan SM Kabir A COVID-19-related infodemic and its impact on public health: a global social media analysis Am J Trop Med Hyg 2020 103 1621 9 10.4269/ajtmh.20-0812 32783794 PMC7543839 42. Scepticism grips Romania, the EU’s second-least vaccinated nation | Coronavirus pandemic News | Al Jazeera. Available online at: https://www.aljazeera.com/news/2022/1/6/vaccine-hesitancy-grips-romania-as-threat-of-omicron-surge-looms 43. Pora A. 2023 https://romania.europalibera.org/a/aur-vaccinare-neobligatorie-strategie-psd-pnl/32554105.html 44. Dascalu S Flammer PG Ghafari M Henson SC Nascimento R Bonsall MB Engaging religious institutions and faith-based communities in public health initiatives: a case study of the Romanian orthodox church during the COVID-19 pandemic Front Public Health 2021 9 768091 10.3389/fpubh.2021.768091 34976927 PMC8717894 45. Raiu C Confronting religion from a post-political perspective. Health policies during the COVID-19 pandemic in Romania Teologia 2022 92 65 74 10.1038/s41562-021-01160-2 46. Petito F From freedom of religion or belief (FoRB) advocacy to interreligious engagement in foreign policy Glob Aff 2020 6 269 86 10.1080/23340460.2020.1845098 47. Hill QCM Coronavirus and the curtailment of religious liberty † Laws 2020 9 27 10.3390/LAWS9040027 48. Raiu C Mina-Raiu L How to cope with counter-performance in public administration. The case of freedom of religion or belief during the pandemic Transylv Rev Adm Sci 2022 18 81 98 10.24193/tras.66E.5 49. Stoica MS Populist political advertising in times of pandemic: framing elites as anti-religious J Study Relig Ideol 2021 115 127 https://www.thenewjsri.ro/index.php/njsri/article/view/105 50. The secrets of AUR’s online success: from targeted messages to the software used by Trump and Macron. Radio Free Eur Rom ( 2020 https://romania.europalibera.org/a/secrete-succes-aur-online-mesaje-tintite-soft-trump-macron/30992626.html 51. Olaru A. 2023 https://pressone.ro/7-ore-de-conspiratii-in-parlamentul-romaniei-la-initiativa-aur-medici-romani-vorbesc-despre-dictatura-sanitara-si-atacul-la-hristos 52. Raiu C Libertatea religioasă între politică și politici. O analiză politică a standardelor internaționale, legislației naționale și practicii guvernamentale în pandemie Iasi Doxologia 2021 53. Grassroots Association 2024 54. Decision No. 385 of November 20, 2020 on the establishment of the National Committee for the Coordination of Activities on Vaccination against SARS-CoV-2. Off Gaz no 1110 ( 2020 https://legislatie.just.ro/Public/DetaliiDocument/233486 55. Niculescu M. stirileprotv.ro 2021 https://stirileprotv.ro/stiri/actualitate/romania-in-topul-tarilor-cu-rata-mare-de-vaccinare-anti-covid-la-polul-opus-este-franta.html 56. Manolescu LSC Zaharia CN Dumitrescu AI Prasacu I Radu MC Boeru AC Early covid-19 vaccination of Romanian medical and social personnel Vaccine 2021 9 1127 10.3390/vaccines9101127 34696235 PMC8541077 57. Ilie D. 2023 https://www.news.ro/social/medici-romani-tara-strainatate-cer-colegiului-medicilor-pozitie-oficiala-ferma-urma-unei-conferinte-aur-multi-medici-au-contestat-ideea-pandemie-vaccinarea-arn-mesager-eficienta-testelor-foto-1922401212002023021421015773 58. Pavaluca L digi24.ro https://www.digi24.ro/stiri/actualitate/sanatate/presedintele-colegiului-medicilor-vrea-suspendarea-medicilor-care-transmit-mesaje-antivacciniste-pun-in-pericol-sanatatea-publica-1703881 https://www.digi24.ro/stiri/actualitate/sanatate/presedintele-colegiului-medicilor-vrea-suspendarea-medi 59. Apetrei C Bucuriile datoriei Letopiseţ COVID (7528–7531) 1st Editura Junimea 2024 60. Rosca M Furlong A 2021 https://www.politico.eu/article/romania-coronavirus-vaccines-fourth-wave-orthodox-church/ 61. digi24 2021 (accessed February 23, 2025)(Citește mai mult la: Informaţiile publicate pe site-ul Digi24.ro pot fi preluate, în conformitate cu legislația aplicabilă, doar în limita a 120 de caractere https://www.digi24.ro/stiri/actualitate/social/patriarhul-daniel-spune-ca-s-a-vaccinat-anti-covid-mesaj-pentru-credinciosi-sa-urmeze-sfatul-medicilor-1748293 https://www.digi24.ro/stiri/actualitate/social/patriarhul-daniel-spune-ca-s-a-vaccinat-anti-covid-mesaj-pentru-credinciosi-sa-urmeze-sfatul-medicilor-1748293 62. Craitoiu A Tolontan C 2021 https://www.tolo.ro/2021/01/30/schimbare-de-strategie-autoritatile-vor-spoturi-tv-pentru-vaccinare-cu-doi-preoti-importanti-unul-a-filmat-deja/comment-page-1/#comment-5080026 63. digi24 2021 https://www.digi24.ro/stiri/actualitate/staretul-unei-manastiri-din-neamt-le-a-spus-oamenilor-ca-daca-se-vaccineaza-le-vor-aparea-pe-corp-solzi-ca-la-peste-bor-reactioneaza-1555905 64. Suciu C. G4media.ro 2021 https://www.g4media.ro/un-preot-cercetator-la-ubb-promoveaza-mesaje-anti-vacciniste-pe-facebook-prin-pagina-propriei-parohii-alti-preoti-l-au-atentionat-in-comentarii-ca-promoveaza-un-comportament-gresit.html 65. Duval L Wolff FC McKee M Roberts B The Roma vaccination gap: evidence from twelve countries in central and south-East Europe Vaccine 2016 34 5524 30 10.1016/J.VACCINE.2016.10.003 27727032 66. Fournet N Mollema L Ruijs WL Harmsen IA Keck F Durand JY Under-vaccinated groups in Europe and their beliefs, attitudes and reasons for non-vaccination; two systematic reviews BMC Public Health 2018 18 196 10.1186/S12889-018-5103-8 29378545 PMC5789742 67. Bell S Saliba V Evans G Flanagan S Ghebrehewet S McAuslane H Responding to measles outbreaks in underserved Roma and Romanian populations in England: the critical role of community understanding and engagement Epidemiol Infect 2020 148 e138 10.1017/S0950268820000874 32347196 PMC7374803 68. COVID-19 data explorer-our world in data. Available online at: https://ourworldindata.org/explorers/covid?time=2021-12-28&Metric=Vaccine+doses%2C+people+vaccinated%2C+and+booster+doses&Interval=Cumulative&Relative+to+population=true&country=OWID_EUR~ROU 69. Enciu BG Tănase AA Drăgănescu AC Aramă V Pițigoi D Crăciun MD The COVID-19 pandemic in Romania: a comparative description with its border countries Healthcare (Basel) 2022 10 1223 10.3390/HEALTHCARE10071223 35885750 PMC9316607 70. Briciu V Leucuta DC Muntean M Radulescu A Cismaru C Topan A Differences in the inflammatory response and outcome among hospitalized patients during different waves of the COVID-19 pandemic Front Immunol 2025 16 1545181 10.3389/FIMMU.2025.1545181 40213560 PMC11983512 71. Bulată-Pop I Cozma A Briciu VT Lupșe MS Junie LM Severity, outcomes, and vaccination status in hospitalized children who tested positive for SARS-CoV-2 during two pandemic waves Med Pharm Rep 2025 98 54 9 10.15386/MPR-2850 39949907 PMC11817593 72. Kouris EC Mirea SI Luminos ML Miron VD The incidence and characteristics of Oral candidiasis in patients hospitalized for SARS-CoV-2 infection during the circulation of alpha, Beta, and Delta variants Microorganisms 2024 12 2090 10.3390/MICROORGANISMS12102090 39458399 PMC11509929 73. Paranga TG Pavel-Tanasa M Constantinescu D Iftimi E Plesca CE Miftode IL Distinct soluble immune checkpoint profiles characterize COVID-19 severity, mortality and SARS-CoV-2 variant infections Front Immunol 2024 15 1464480 10.3389/FIMMU.2024.1464480 39376569 PMC11456479 74. Dube E Pistol A Stanescu A Butu C Guirguis S Motea O Vaccination barriers and drivers in Romania: a focused ethnographic study Eur J Pub Health 2023 33 222 7 10.1093/EURPUB/CKAC135 36416573 PMC10066483 75. Hohan R Surleac M Miron VD Tudor A Tudor AM Săndulescu O Ongoing measles outbreak in Romania: clinical investigation and molecular epidemiology performed on whole genome sequences PLoS One 2025 20 e0317045 10.1371/JOURNAL.PONE.0317045 39813269 PMC11734985 76. Dumitra GG Camen AR Nechita F Pîrlog MC Kamal C Dogaru CA Effectiveness of group and individual counselling interventions on COVID-19 vaccination intention among industrial employees in Romania Patient Prefer Adherence 2025 19 907 19 10.2147/PPA.S500640 40201013 PMC11977631 77. Apetrei C Marx PA Mellors JW Pandrea I The COVID misinfodemic: not new, never more lethal Trends Microbiol 2022 30 948 58 10.1016/j.tim.2022.07.004 35945120 PMC9356696 78. Spinney L Why vaccines do not work without trust Front Young Minds 2020 7 10.3389/FRYM.2019.00160 ",
  "metadata": {
    "Title of this paper": "Why vaccines do not work without trust",
    "Journal it was published in:": "Frontiers in Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484034/"
  }
}