{
  "title": "Paper_1037",
  "abstract": "pmc Int J Environ Res Public Health Int J Environ Res Public Health 876 ijerph ijerph International Journal of Environmental Research and Public Health 1661-7827 1660-4601 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469446 PMC12469446.1 12469446 12469446 41007567 10.3390/ijerph22091423 ijerph-22-01423 1 Article Investigating the Dual Role of Trace and Toxic Elements in Pregnancy-Related Health Outcomes https://orcid.org/0009-0001-9191-5112 Sai-ong Thaveesak Conceptualization Methodology Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Visualization 1 https://orcid.org/0000-0002-0988-205X Waeyeng Donrawee Methodology Formal analysis Writing – review & editing 1 2 https://orcid.org/0000-0002-8277-4645 Khamphaya Tanaporn Writing – review & editing 1 3 4 https://orcid.org/0000-0002-5413-6937 Rattanapan Yanisa Writing – review & editing 5 6 Hnoocham Warinya Investigation 7 Samaphong Katesiri Writing – review & editing 8 Satarug Soisungwan Supervision Writing – review & editing 9 https://orcid.org/0000-0002-1638-4227 Yimthiang Supabhorn Conceptualization Methodology Validation Resources Writing – review & editing Supervision Project administration Funding acquisition Data curation 1 4 * Toscano William A. Academic Editor 1 thaveesaksaiong@gmail.com donrawee.wae@gmail.com tanaporn.kh@wu.ac.th 2 3 4 5 6 7 8 9 * ksupapor@mail.wu.ac.th 12 9 2025 9 2025 22 9 497640 1423 24 7 2025 06 9 2025 10 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Maternal health during pregnancy can be influenced by exposure to essential trace and toxic elements, notably cadmium, lead, chromium, and arsenic. Using inductively coupled plasma optical emission spectrometry, this study determined blood concentrations of toxic elements together with zinc, copper, and iron, which are nutritionally essential, in 200 pregnant women who attended the antenatal care at Thasala Hospital, Nakhon Si Thammarat, between January and July 2023. Associations of maternal clinical outcomes with the measured blood elemental composition were evaluated by Spearman’s rank correlation analysis. Iron showed the highest concentration among trace elements (75,178 ± 12,045 µg/dL), followed by zinc (1189.20 ± 211.38 µg/dL) and copper (294.72 ± 67.19 µg/dL). Among the toxic elements, lead had the highest concentration (5.59 ± 1.61 µg/dL), followed by chromium (2.80 ± 1.47 µg/dL), with arsenic and cadmium having the lowest concentrations. Synergistic associations were observed among lead, zinc, and iron. Blood lead concentration correlated inversely with hematocrit, while blood arsenic and blood cadmium both showed inverse association with urine glucose. Plasma glucose concentration varied directly with zinc and iron. These findings indicate effects and interactions of essential versus toxic elements on the health of pregnant women. They underscore the need to continue research into the strategies to minimize the impact of toxic elements and to further improve the nutritional status of zinc and iron during pregnancy. trace elements toxic elements ICP-OES pregnancy outcomes National Research Council of Thailand (NRCT) N41A670637 This project is funded by National Research Council of Thailand (NRCT), No. N41A670637. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Exposure to trace and toxic elements, especially during pregnancy, remains to be an issue for public health concern [ 1 2 3 4 5 6 Anemia is one of the most prevalent disorders in pregnant women; in 2023, it affected approximately 35% of women, with 30–60% having Fe deficiency [ 7 8 9 10 11 12 13 Excessive exposure to arsenic (As), lead (Pb), cadmium (Cd), and mercury (Hg) together with inadequate intake of essential trace elements, Zn, Cu, and Fe can produce unfavorable pregnancy outcomes [ 14 15 16 16 17 In a study from Nigeria, maternal blood Pb levels were linked to reduced birth weight and increased risk of preterm delivery [ 18 19 20 17 2. Materials and Methods 2.1. Study Design and Sample Population This cross-sectional study was conducted at the Obstetrics and Gynecology Department of Thasala Hospital, Nakhon Si Thammarat Province, Thailand, between January and July 2023, enrolling a total of 200 pregnant women. Eligible participants were women aged 18 years or older who attended antenatal care (ANC) at Thasala Hospital, had no pre-existing chronic medical conditions such as diabetes or hypertension, and had no history of major pregnancy complications. Women were excluded if they had severe anemia requiring transfusion, known hematologic disorders, or incomplete clinical and laboratory records. 2.2. Data Collection Tools Data were collected using a structured and validated questionnaire. The questionnaire covered (1) sociodemographic variables—age, gestational BMI, education, gravidity, and occupation. (2) Clinical parameters—blood pressure, hematocrit, fasting plasma glucose (FPG), oral glucose tolerance test (OGTT) at 1, 2, and 3 h, urine protein, and urine glucose. 2.3. Clinical and Laboratory Variables The validated questionnaires were used to gather data on mother occupation, education level, sociodemographic factors determinants (age, gestational age, and gestational body mass index, or G-BMI), and clinical parameters, including complete blood count (CBC), oral glucose tolerance testing (OGTT), systolic blood pressure (SBP), diastolic blood pressure (DBP), obstetric history, including gravida (number of pregnancies; G), urine glucose and urine protein. The venous maternal blood sample (3 mL) was collected at the time of visit to the ANC clinic. The blood samples were obtained by venipuncture and collected in ethylenediaminetetraacetic acid (EDTA) tubes. EDTA tubes were used as anticoagulants to prevent blood coagulation. The test tubes were placed in crushed ice and stored at −20 °C until required for analysis. 2.4. Determination of Trace and Toxic Elements in Maternal Blood After being fully thawed at room temperature, the frozen blood samples were homogenized. A total of 2 mL of concentrated nitric acid and 1 mL of 30% hydrogen superoxide were used to digest 1 mL of blood. The samples’ solutions were then diluted with 15 mL of distilled water to detect elements [ 21 22 Table 1 2.5. Statistical Analysis Data were analyzed using SPSS version 28. Continuous variables were tested for normality using the Shapiro–Wilk test. As the data were not normally distributed, nonparametric statistical methods were applied. Spearman’s rank-order correlation was used to assess the associations between toxic element concentrations and clinical variables. The Kruskal–Wallis test was applied when there were more than two independent groups in the quantitative variable comparisons. If a statistically significant difference is detected, Dunn’s post hoc test with Bonferroni correction is applied to determine which specific group accounted for the difference. A p 3. Results 3.1. General Characteristics A total of 200 pregnant women participated in the study, and Table 2 2 3.2. Trace and Toxic Element Concentrations The mean concentrations of trace and toxic elements are shown in Table 3 The relationships among Cu, Zn, Fe, As, Cd, Cr, and Pb in maternal blood are presented in Table 4 s s s s s s s s p 3.3. Correlation Coefficients of Selected Toxic Elements and Biological Parameters Table 5 s p s p s p s p s p s p s p s p s p The median and min–max values of trace and toxic elements across trimesters are presented in Table 6 p The Kruskal–Wallis test revealed significant differences in Cu, Fe, Zn, and Pb concentrations across trimesters in Table 7 p p p p p p 4. Discussion In the present study, we measured blood levels of nutritionally essential trace elements, Cu, Zn, and Fe together the toxicants, Cd, Pb, Cr, and As in 200 pregnant Thai women, aged 18 to 45 years (mean age 30.2). They all resided in the southern region of Thailand. We then tested for the association of these blood elements with various indicators of maternal health. The respective mean blood concentrations of Cu, Zn, and Fe in study subjects of 294.723, 1187.20, and 75,178.00 µg/dL were within the recommended reference ranges for pregnant women of 200–300, 700–1500, and 62,000–80,200 µg/dL for Cu, Zn and Fe, respectively [ 21 22 Additional contributing factors were a high proportion (88%) of participants with at least a secondary education, and the young age group with an access to digital media. This demographic profile aligns with evidence that younger, more educated women are more likely to seek pregnancy-related health information through online platforms such as websites, blogs, apps, and social media, thereby enhancing their ability to access, interpret, and apply self-care guidance [ 23 24 25 26 27 28 29 Data on blood concentrations of nutritionally essential metals (Cu, Zn, and Fe) and toxicants (Pb, Cd, As, and Cr) study raised a concern about excessive Pb exposure in a significant proportion of participants in the present study. The source of Pb exposure among them should be an area for future research, given that one-third of pregnant women worldwide are at risk of Fe deficiency [ 30 31 32 33 34 35 36 Consistent with a previous study by Hegazy et al. [ 37 38 39 40 41 42 43 Herein, we have observed variations in blood elemental composition that were trimester specific. Blood Pb levels increased in the first trimester but declined in the second, while blood Cu levels showed a steady increase across pregnancy. Blood Fe concentrations fell after the first trimester, whereas blood Zn increased slightly in the third trimester. These patterns appeared to be consistent with the physiological changes during pregnancy, like expanded plasma volume, increased metabolic demands, and altered micronutrient utilization [ 44 45 46 47 48 49 50 The present study has addressed a key knowledge gap regarding multiple toxics and trace element levels among pregnant women in Thailand. It contributed region-specific evidence to the growing literature. These findings are relevant to Thailand and other regions facing similar challenges. Strengthening prenatal care programs with routine monitoring of toxicant exposure and nutritional status may help mitigate risks, improve maternal health, and support healthier pregnancy outcomes. However, the study has certain limitations, including the use of blood as the sole biomarker, which primarily reflects recent rather than cumulative exposure, and the absence of repeated measurements across trimesters that could capture temporal variations in trace and toxic element levels during pregnancy. In addition, the lack of detailed dietary and environmental data may limit the interpretation of exposure sources. Future studies with longitudinal follow-up, trimester-specific sampling, multiple biomarkers, and comprehensive exposure assessments are warranted to strengthen causal inference and clarify dynamic changes that occur during pregnancy. Additional study is required to obtain further details. 5. Conclusions The present study provides data on blood concentrations of the essential metals Cu, Zn, and Fe in 200 pregnant women, aged 18 to 45 years, who resided in southern Thailand. It also provides blood concentrations of the toxic elements Cd, Pb, Cr, and As. Adverse effects of Pb on hematocrit levels have been observed together with protective effects of Cu and Fe. Dietary sources of Pb among participants require further research, as does the strategy to minimize the intestinal absorption of Pb. Acknowledgments The authors thank the staff from the Obstetrics and Gynecology Department and the Medical Technology Department at Thasala Hospital, Nakhon Si Thammarat, for their valuable technical advice and contributions. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, T.S.-o., T.K. and S.Y.; methodology, investigation, validation, and analysis, T.S.-o., D.W., Y.R., W.H. and S.Y.; writing—original draft preparation, T.S.-o.; writing—review and editing, T.S.-o., T.K., K.S., S.S. and S.Y.; supervision, T.K., S.S. and S.Y. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The objectives, procedure, and voluntary nature of the study were clearly explained to the participants. They provided written informed consent before data collection. All methods in the present study were conducted in accordance with the Helsinki Declaration for research involving human subjects. This research has been approved by the Ethics Committee in Human Research at Walailak University (WUEC-23-151-01). Informed Consent Statement All subjects provided written informed consent. Data Availability Statement The data supporting the findings of this study are available from the corresponding author upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations Cu Copper Zn Zinc Ca Calcium Mg Magnesium Fe Iron Pb Lead Cd Cadmium Cr Chromium As Arsenic Hg Mercury G-BMI Gestational body mass index CBC Complete blood count FPG fasting plasma glucose OGTT Oral glucose tolerance testing SBP Systolic blood pressure DBP Diastolic blood pressure G Gravida ICP-OES Inductively coupled plasma optical emission spectroscopy LoD Limit of detection References 1. Zheng G. Zhong H. Guo Z. Wu Z. Zhang H. Wang C. Zhou Y. Zuo Z. Levels of heavy metals and trace elements in umbilical cord blood and the risk of adverse pregnancy outcomes: A population-based study Biol. Trace Elem. Res. 2014 160 437 444 10.1007/s12011-014-0057-x 25008990 2. Iqbal S. Ali I. Rust P. Kundi M. Ekmekcioglu C. Selenium, Zinc, and Manganese Status in Pregnant Women and Its Relation to Maternal and Child Complications Nutrients 2020 12 725 10.3390/nu12030725 32164189 PMC7146474 3. Pathak P. Kapil U. Role of trace elements zinc, copper and magnesium during pregnancy and its outcome Indian J. Pediatr. 2014 71 1003 1005 10.1007/BF02828116 15572821 4. Almaghamsi A. Almalki M.H. Buhary B.M. Hypocalcemia in Pregnancy: A Clinical Review Update Oman Med. J. 2018 33 453 462 10.5001/omj.2018.85 30410686 PMC6206424 5. Fanni D. Gerosa C. Nurchi V.M. Manchia M. Saba L. Coghe F. Crisponi G. Gibo Y. Van Eyken P. Fanos V. The Role of Magnesium in Pregnancy and in Fetal Programming of Adult Diseases Biol. Trace Elem. Res. 2021 199 3647 3657 10.1007/s12011-020-02513-0 33319331 PMC8360883 6. Grzeszczak K. Kwiatkowski S. Kosik-Bogacka D. The Role of Fe, Zn, and Cu in Pregnancy Biomolecules 2020 10 1176 10.3390/biom10081176 32806787 PMC7463674 7. Wu N. Ye E. Ba Y. Caikai S. Ba B. Li L. Zhu Q. The global burden of maternal disorders attributable to iron deficiency related sub-disorders in 204 countries and territories: An analysis for the Global Burden of Disease study Front. Public Health 2024 12 1406549 10.3389/fpubh.2024.1406549 39310906 PMC11413869 8. Lutfullah G. Prevalence of zinc deficiency among rural women during childbearing age in Peshawar, Pakistan Pak. J. Pharm. Sci. 2014 27 173 177 24374445 9. Gebremedhin S. Enquselassie F. Umeta M. Prevalence of prenatal zinc deficiency and its association with socio-demographic, dietary and health care related factors in Rural Sidama, Southern Ethiopia: A cross-sectional study BMC Public Health 2011 11 898 10.1186/1471-2458-11-898 22126192 PMC3239408 10. De Benedictis C.A. Trame S. Rink L. Grabrucker A.M. Prevalence of low dietary zinc intake in women and pregnant women in Ireland Ir. J. Med. Sci. 2023 192 1835 1845 10.1007/s11845-022-03181-w 36224463 PMC9556144 11. Rerkasem A. Nantakool S. Wilson B.C. Mangklabruks A. Boonyapranai K. Mutirangura A. Derraik J.G.B. Rerkasem K. Associations between maternal plasma zinc concentrations in late pregnancy and LINE-1 and Alu methylation loci in the young adult offspring PLoS ONE 2022 17 e0279630 10.1371/journal.pone.0279630 36584155 PMC9803117 12. Piammongkol S. Chongsuvivatwong V. Williams G. Pornpatkul M. The prevalence and determinants of iron deficiency anemia in rural Thai-Muslim pregnant women in Pattani Province Southeast Asian J. Trop. Med. Public Health 2006 37 553 17120979 13. Adams J.B. Kirby J.K. Sorensen J.C. Pollard E.L. Audhya T. Evidence based recommendations for an optimal prenatal supplement for women in the US: Vitamins and related nutrients Matern. Health Neonatol. Perinatol. 2022 8 4 10.1186/s40748-022-00139-9 35818085 PMC9275129 14. Rzymski P. Tomczyk K. Rzymski P. Poniedzialek B. Opala T. Wilczak M. Impact of heavy metals on the female reproductive system Ann. Agric. Environ. Med. 2015 22 259 264 10.5604/12321966.1152077 26094520 15. Chen Z. Myers R. Wei T. Bind E. Kassim P. Wang G. Ji Y. Hong X. Caruso D. Bartell T. Placental transfer and concentrations of cadmium, mercury, lead, and selenium in mothers, newborns, and young children J. Expo. Sci. Environ. Epidemiol. 2014 24 537 544 10.1038/jes.2014.26 24756102 PMC4329243 16. Wei M.H. Li J.X. Mi J. Wang Q. Xu F. Xu C. Associations between co-exposure to multiple heavy metals and age-related macular degeneration: A cross-sectional study J. Trace Elem. Med. Biol. 2025 87 127573 10.1016/j.jtemb.2024.127573 39643952 17. Waeyeng D. Khamphaya T. Pouyfung P. Vattanasit U. Yimthiang S. Blood Lead Levels Among Non-Occupationally Exposed Pregnant Women in Southern Thailand Toxics 2022 10 599 10.3390/toxics10100599 36287879 PMC9610693 18. Njoku C.O. Orisakwe O.E. Higher blood lead levels in rural than urban pregnant women in Eastern Nigeria Occup. Environ. Med. 2022 69 850 851 10.1136/oemed-2012-100947 22864250 19. Huang S. Xia W. Sheng X. Qiu L. Zhang B. Chen T. Xu S. Li Y. Maternal lead exposure and premature rupture of membranes: A birth cohort study in China BMJ Open 2018 8 e021565 10.1136/bmjopen-2018-021565 PMC6059302 30037873 20. Sámano R. Chico-Barba G. Flores-Quijano M.E. Godínez-Martínez E. Martínez-Rojano H. Ortiz-Hernandez L. Nájera-Medina O. Hernández-Trejo M. Hurtado-Solache C. Association of pregestational BMI and gestational weight gain with maternal and neonatal outcomes in adolescents and adults from Mexico City Int. J. Environ. Res. Public Health 2021 19 280 10.3390/ijerph19010280 35010540 PMC8750657 21. Kot K. Łanocha-Arendarczyk N. Kupnicka P. Szymański S. Malinowski W. Kalisińska E. Chlubek D. Kosik-Bogacka D. Selected Metal Concentration in Maternal and Cord Blood Int. J. Environ. Res. Public Health 2021 18 12407 10.3390/ijerph182312407 34886132 PMC8656657 22. Assavapokee N. Khomphaiboonkij U. Tangjitgamol S. Khunamornpong S. Pongsuvareeyakul T. Chanpanitkitchot S. Lertkhachonsuk A.A. Practice guideline for management of endometrial cancer in Thailand: A Thai Gynecologic Cancer Society consensus statement J. Gynecol. Oncol. 2025 36 e96 10.3802/jgo.2025.36.e96 40114554 PMC11964982 23. Lupton D. The use and value of digital media for information about pregnancy and early motherhood: A focus group study BMC Pregnancy Childbirth 2016 16 171 10.1186/s12884-016-0971-3 27435182 PMC4950377 24. Wang H. Hu Y.F. Hao J.H. Chen Y.H. Su P.Y. Wang Y. Yu Z. Fu L. Xu Y.-Y. Zhang C. Maternal zinc deficiency during pregnancy elevates the risks of fetal growth restriction: A population-based birth cohort study Sci. Rep. 2015 5 11262 10.1038/srep11262 26053136 PMC4459238 25. Kuma M.N. Tamiru D. Belachew T. Level and predictors of dietary diversity among pregnant women in rural South-West Ethiopia: A community-based cross-sectional study BMJ Open 2021 11 e055125 10.1136/bmjopen-2021-055125 PMC8547499 34697127 26. Paulson J.A. Brown M.J. The CDC blood lead reference value for children: Time for a change Environ. Health 2019 18 16 10.1186/s12940-019-0457-7 30819209 PMC6396537 27. He S. Jiang T. Zhang D. Li M. Yu T. Zhai M. He B. Yin T. Wang X. Tao F. Association of exposure to multiple heavy metals during pregnancy with the risk of gestational diabetes mellitus and insulin secretion phase after glucose stimulation Environ. Res. 2024 248 118237 10.1016/j.envres.2024.118237 38244971 28. Bibha K. Akhigbe T.M. Hamed M.A. Akhigbe R.E. Metabolic derangement by arsenic: A review of the mechanisms Biol. Trace Elem. Res. 2024 202 1972 1982 10.1007/s12011-023-03828-4 37670201 29. Satarug S. Benchmark dose modeling to define permissible exposure levels for environmental cadmium J. Environ. Expo. Assess 2025 4 28 10.20517/jeea.2025.29 30. Georgieff M.K. Krebs N.F. Cusick S.E. The benefits and risks of iron supplementation in pregnancy and childhood Annu. Rev. Nutr. 2019 39 121 146 10.1146/annurev-nutr-082018-124213 31091416 PMC7173188 31. Bekele Y. Gallagher C. Batra M. Buultjens M. Eren S. Erbas B. Does oral iron and folate supplementation during pregnancy protect against adverse birth outcomes and reduced neonatal and infant mortality in Africa: A protocol for a systematic review and meta-analysis? Nutr. Health 2025 31 15 22 10.1177/02601060241256200 38778781 PMC11954406 32. Sripada K. Lager A.M. Interventions to reduce cadmium exposure in low-and middle-income countries during pregnancy and childhood: A systematic review J. Glob. Health 2022 12 04089 10.7189/jogh.12.04089 36370388 PMC9653536 33. Zhao S. Yang X. Xu Q. Li H. Su Y. Xu Q. Li Q.X. Xia Y. Shen R. Association of maternal metals exposure, metabolites and birth outcomes in newborns: A prospective cohort study Environ. Int. 2013 179 108183 10.1016/j.envint.2023.108183 37690219 34. Patel A.B. Meleth S. Pasha O. Goudar S.S. Esamai F. Garces A.L. Chomba E. McClure E.M. Wright L.L. Koso-Thomas M. Impact of exposure to cooking fuels on stillbirths, perinatal, very early and late neonatal mortality-a multicenter prospective cohort study in rural communities in India, Pakistan, Kenya, Zambia and Guatemala Matern. Health Neonatol. Perinatol. 2015 1 18 10.1186/s40748-015-0019-0 27057335 PMC4823690 35. Wessells K.R. Brown K.H. Estimating the global prevalence of zinc deficiency: Results based on zinc availability in national food supplies and the prevalence of stunting PLoS ONE 2012 7 e50568 10.1371/journal.pone.0050568 23209782 PMC3510072 36. Nieuwenhuijsen M.J. Ristovska G. Dadvand P. WHO environmental noise guidelines for the European region: A systematic review on environmental noise and adverse birth outcomes Int. J. Environ. Res. Public Health 2017 14 1252 10.3390/ijerph14101252 29048350 PMC5664753 37. Hegazy A.A. Zaher M.M. Abd El-Hafez M.A. Morsy A.A. Saleh R.A. Relation between anemia and blood levels of lead, copper, zinc and iron among children BMC Res. Notes 2010 3 133 10.1186/1756-0500-3-133 20459857 PMC2887903 38. Qader A. Rehman K. Akash M.S.H. Genetic susceptibility of δ-ALAD associated with lead (Pb) intoxication: Sources of exposure, preventive measures, and treatment interventions Environ. Sci. Pollut. Res. 2021 28 44818 44832 10.1007/s11356-021-15323-1 34244947 39. Zhong Z. Yang Q. Li C. Chen X. Zhou F. A global perspective of correlation between maternal blood lead levels and risks of preeclampsia: An updated systematic review and meta-analysis Front. Public Health 2022 10 1072052 10.3389/fpubh.2022.1072052 36620238 PMC9816335 40. Röllin H.B. Rudge C.V. Thomassen Y. Mathee A. Odland J.Ø. Levels of toxic and essential metals in maternal and umbilical cord blood from selected areas of South Africa—Results of a pilot study J. Environ. Monit. 2009 11 618 627 10.1039/b816236k 19280040 41. Basiri R. Seidu B. Cheskin L.J. Key nutrients for optimal blood glucose control and mental health in individuals with diabetes: A review of the evidence Nutrients 2023 15 3929 10.3390/nu15183929 37764713 PMC10536295 42. Rudge C.V. Röllin H.B. Nogueira C.M. Thomassen Y. Rudge M.C. Odland J.Ø. The placenta as a barrier for toxic and essential elements in paired maternal and cord blood samples of South African delivering women J. Environ. Monit. 2009 11 1322 1330 10.1039/b903805a 20449220 43. Hubbard S.A. Klipsch K. Cockburn M.S. Carey S. In vivo micronucleus assay on sodium molybdate in rats and its impact on the overall assessment of the genotoxicity of molybdenum substances Regul. Toxicol. Pharmacol. 2024 154 105717 10.1016/j.yrtph.2024.105717 39395560 44. Morton A. Teasdale S. Physiological changes in pregnancy and their influence on the endocrine investigation Clin. Endocrinol. 2022 96 3 11 10.1111/cen.14624 34724247 45. Guan L. Wang Y. Lin L. Zou Y. Qiu L. Variations in blood copper and possible mechanisms during pregnancy Biol. Trace Elem. Res. 2024 202 429 441 10.1007/s12011-023-03716-x 37777692 46. Kennedy E. Everson T.M. Punshon T. Jackson B.P. Hao K. Lambertini L. Copper associates with differential methylation in placentae from two US birth cohorts Epigenetics 2020 15 215 230 10.1080/15592294.2019.1661211 31462129 PMC7028322 47. Churchill D. Nair M. Stanworth S.J. Knight M. The change in haemoglobin concentration between the first and third trimesters of pregnancy: A population study BMC Pregnancy Childbirth 2019 19 359 10.1186/s12884-019-2495-0 31619186 PMC6796328 48. Hansen R. Spangmose A.L. Sommer V.M. Holm C. Jørgensen F.S. Krebs L. Maternal first trimester iron status and its association with obstetric and perinatal outcomes Arch. Gynecol. Obstet. 2022 306 1359 1371 10.1007/s00404-022-06401-x 35088196 49. Li S. Wang Q. Luo W. Jia S. Liu D. Ma W. Gu H. Wei X. He Y. Cao S. Relationship between maternal heavy metal exposure and congenital heart defects: A systematic review and meta-analysis Environ. Sci. Pollut. Res. 2022 29 55348 55366 10.1007/s11356-022-21071-7 35668266 50. Liu T. Zhang M. Rahman M.L. Wang X. Hinkle S.N. Zhang C. Mueller N.T. Exposure to heavy metals and trace minerals in first trimester and maternal blood pressure change over gestation Environ. Int. 2021 153 106508 10.1016/j.envint.2021.106508 33901931 ijerph-22-01423-t001_Table 1 Table 1 The analytical method parameters of ICP-OES. Elements Spectral Line (nm) Plasma Torch Position %RSE R2 Cu 327.395 Axial 8.78 0.99964 Zn 213.857 Axial 8.00 0.99964 Fe 238.204 Axial 8.45 0.99972 As 193.696 Axial 10.93 0.99993 Cd 214.439 Axial 1.62 0.99999 Pb 220.353 Axial 1.57 0.99995 Cr 267.716 Axial 1.23 0.99999 Cu: Cupper; Zn: Zinc; Fe: Iron; As: Arsenic; Cd: Cadmium; Pb: Lead; Cr: Chromium. ijerph-22-01423-t002_Table 2 Table 2 Socio-demographic characteristics of pregnant women. Variables Mean ± SD or n Total ( n 1st Trimester ( n 2nd Trimester ( n 3rd Trimester ( n Age (years) 30.2 ± 7.5 30.7 ± 1.0 30.2 ± 1.2 29.8 ± 0.7 G-BMI (kg/m 2 27.5 ± 5.9 27.66 ± 0.8 25.77 ± 0.8 28.32 ± 0.6 Education     Less than high school 24 (12.0) 10 (14.1) 4 (8.9) 10 (11.9) High school 104 (52.0) 37 (52.1) 27 (60.0) 40 (47.6) Higher education 72 (36.0) 24 (33.8) 14 (31.1) 34 (40.5) Gravidity     1 60 (30.0) 21 (29.6) 12 (26.7) 27 (32.1) 2 51 (25.5) 20 (28.2) 10 (22.2) 21 (25.0) ≥3 89 (44.5) 30 (42.3) 23 (51.1) 36 (42.9) Maternal occupation     Housewives 66 (33.0) 25 (35.2) 18 (40.0) 23 (27.4) Other 134 (67.0) 46 (64.8) 27 (60.0) 61 (72.6) SBP (mmHg) 115.2 ± 12.2 116.7 ± 1.3 113.8 ± 1.9 114.7 ± 1.4 DBP (mmHg) 74.7 ± 9.9 77.0 ± 0.9 73.8 ± 1.3 73.3 ± 1.3 Hematocrit (%) 35.8 ± 3.6 36.3 ± 0.4 35.5 ± 0.5 35.6 ± 0.4 Plasma glucose     FPG (mg/dL) 85.4 ± 18.5 90.1 ± 2.9 85.0 ± 2.8 87.7 ± 1.0 OGTT 1 h (mg/dL) 158.5 ± 67.1 175.1 ± 11.8 150.2 ± 6.9 148.8 ± 3.4 OGTT 2 h (mg/dL) 133.9 ± 39.9 140.0 ± 5.3 133.2 ± 7.3 129.2 ± 3.1 OGTT 3 h (mg/dL) 120.1 ± 33.8 117.9 ± 4.5 121.9 ± 6.7 120.8 ± 2.4 Urine Protein     Negative 184 (92.0) 62 (89.9) 43 (95.6) 77 (91.7) Positive 16 (8.0) 7 (10.1) 2 (4.4) 7 (8.3) Urine Glucose     Negative 186 (93.0) 64 (90.1) 42 (93.3) 80 (95.2) Positive 14 (7.0) 7 (9.9) 3 (6.6) 4 (4.8) GBMI: Gestational body mass index; SBP: Systolic blood pressure; DBP: Diastolic blood pressure; FPG: Fasting plasma glucose; OGTT: Oral glucose tolerance test; SD: standard deviation. ijerph-22-01423-t003_Table 3 Table 3 Trace and toxic element concentrations (µg/dL). Blood Elements Mean SD Range Trace elements   Cu 294.72 67.19 145.00–525.00 Zn 1187.20 211.38 479.00–1971.00 Fe 75,178.00 12,045.00 41,713.00–101,887.00 Toxic elements    As 1.87 1.43 ND–6.00 Cd 0.98 0.27 ND–4.00 Pb 5.59 1.61 2.00–11.00 Cr 2.80 1.47 1.00–16.00 SD: standard deviation; ND: not detected; Cu: Cupper; Zn: Zinc; Fe: Iron; As: Arsenic; Cd: Cadmium; Pb: Lead; Cr: Chromium. ijerph-22-01423-t004_Table 4 Table 4 Correlations between blood toxic element concentrations (Spearman’s rho).  Cu Zn Fe As Cd Cr Pb Cu 1.000       Zn 0.286 ** 1.000      Fe 0.258 ** 0.485 ** 1.000     As −0.159 * −0.074 −0.151 * 1.000    Cd −0.159 * −0.074 −0.151 * 1.000 ** 1.000   Cr 0.047 0.051 0.047 0.094 0.094 1.000  Pb 0.110 0.244 ** 0.198 ** 0.200 ** 0.200 ** 0.168 * 1.000 ** Correlation is significant at the 0.01 level (2-tailed), * Correlation is significant at the 0.05 level (2-tailed). Cu: Cupper; Zn: Zinc; Fe: Iron; As: Arsenic; Cd: Cadmium; Cr: Chromium; Pb: Lead. ijerph-22-01423-t005_Table 5 Table 5 Correlation between blood element concentrations and health effects in pregnant women. Variables Correlation Coefficient Cu Zn Fe As Cd Cr Pb GBMI 0.023 0.028 0.051 0.049 0.049 0.051 0.121 SBP −0.074 0.026 0.097 0.037 0.037 0.003 0.044 DBP −0.099 0.022 0.122 0.067 0.067 −0.024 0.085 Hematocrit 0.174 * −0.188 ** 0.274 ** 0.093 0.093 −0.031 −0.219 ** Urine protein −0.079 −0.084 −0.003 0.032 0.032 −0.049 −0.006 Urine glucose −0.126 −0.036 0.064 −0.184 ** −0.184 ** −0.126 −0.016 FPG −0.162* −0.030 0.054 0.043 0.043 −0.141 * 0.046 OGTT 1 h −0.038 0.119 0.095 0.032 0.032 0.005 −0.060 OGTT 2 h −0.026 −0.174 * 0.162 * 0.023 0.023 0.121 −0.016 OGTT 3 h 0.101 −0.220 ** 0.110 0.006 0.006 0.072 −0.053 ** Correlation is significant at the 0.01 level (2-tailed), * Correlation is significant at the 0.05 level (2-tailed). G-BMI: Gestational body mass index; SBP: Systolic blood pressure; DBP: Diastolic blood pressure; FPG: Fasting plasma glucose; OGTT: Oral glucose tolerance test. ijerph-22-01423-t006_Table 6 Table 6 Blood concentrations of trace and toxic elements in pregnant women across trimesters [Median (Min–Max)]. Blood 1st Trimester n 2nd Trimester n 3rd Trimester n p Trace elements Cu 265.0 288.0 326.5 <0.001 ** Zn 1209.0 1124.0 1234.5 0.026 * Fe 81,780.0 75,204.0 73,022.0 0.002 * Toxic elements As 2.0 (ND–6.0) 2.0 (ND–5.0) 1.0 (ND–5.0) 0.531 Cd 1.0 (ND–1.0) 1.0 (ND–1.0) 1.0 (ND–4.0) 0.739 Cr 3.0 (1.0–4.0) 3.0 (2.0–16.0) 3.0 (2.00–6.0) 0.691 Pb 6.0 (1.0–9.0) 5.0 (1.0–9.0) 6.0 (2.0–11.0) 0.033 * **. Correlation is significant at the 0.01 level (2-tailed), *. Correlation is significant at the 0.05 level (2-tailed). Cu: Cupper; Zn: Zinc; Fe: Iron; As: Arsenic; Cd: Cadmium; Cr: Chromium; Pb: Lead. ijerph-22-01423-t007_Table 7 Table 7 Post hoc pairwise comparisons of blood concentration of trace and toxic elements in pregnant women across trimesters. Blood Elements Pairwise Test Statistic Std. Error Z p Adj. p Cu 1 vs. 2 –19.741 10.883 –1.814 0.070 0.209  1 vs. 3 –46.122 9.382 –4.916 <0.001 <0.001 *  2 vs. 3 –26.382 10.589 –2.492 0.013 0.038 * Fe 2 vs. 3 –1.369 10.589 –0.129 0.897 1.000  2 vs. 1 30.993 10.884 2.848 0.004 0.013 *  3 vs. 1 29.625 9.383 3.157 0.002 0.005 * Zn 2 vs. 1 17.983 10.884 1.652 0.098 0.295  2 vs. 3 –28.617 10.589 –2.703 0.007 0.021 *  1 vs. 3 –10.634 9.383 –1.133 0.257 0.771 Pb 2 vs. 3 –22.631 10.388 –2.179 0.029 0.088  2 vs. 1 26.395 10.677 2.472 0.013 0.040 *  3 vs. 1 3.765 9.204 0.409 0.683 1.000 * Correlation is significant at the 0.05 level (2-tailed); Cu: Cupper; Fe: Iron, Zn: Zinc’ Pb: Lead. ",
  "metadata": {
    "Title of this paper": "Exposure to heavy metals and trace minerals in first trimester and maternal blood pressure change over gestation",
    "Journal it was published in:": "International Journal of Environmental Research and Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469446/"
  }
}