{
  "title": "Paper_844",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472525 PMC12472525.1 12472525 12472525 41011540 10.3390/microorganisms13092209 microorganisms-13-02209 1 Case Report Diagnostic Challenges of Cyclosporiasis in Chronic Diarrhea: A Case Study Banasik Estera 1 * https://orcid.org/0000-0002-3647-5070 Dobrowolska Agnieszka 1 Woźnicka-Leśkiewicz Lucyna 2 https://orcid.org/0000-0001-9306-5038 Eder Piotr 1 d’Arminio Monforte Antonella Academic Editor 1 agdob@ump.edu.pl piotreder@ump.edu.pl 2 lucyna.woznicka@gmail.com * ester.banasik@pm.me 21 9 2025 9 2025 13 9 496716 2209 15 8 2025 08 9 2025 17 9 2025 21 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Cyclosporiasis, caused by Cyclospora cayetanensis Cyclospora cayetanensis Cyclospora cayetanensis ulcerative colitis vedolizumab opportunistic infection This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cyclosporiasis is a parasitic disease caused by Cyclospora cayetanensis 1 2 3 4 5 6 7 1 2 3 4 5 6 7 Cyclospora 1 2 3 4 5 6 1 2 3 4 5 6 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 8 9 10 11 8 9 10 11 15 16 17 18 19 Diagnosis is based on stool examination using specific techniques like Ziehl-Neelsen staining, and at least three samples collected at 48 h intervals [ 1 2 5 C. cayetanensis 3 12 13 20 1 3 4 1 3 4 Opportunistic infections are increasingly recognized in patients with IBD, but parasitic infections remain underdiagnosed and underreported in this population [ 8 9 10 11 15 16 8 9 10 11 12 13 14 15 16 15 16 Here we report a rare case of Cyclospora cayetanensis 21 22 1 2 3 4 20 21 22 1 2 3 4 8 9 10 11 15 16 20 2. Case Description A 24-year-old woman with a history of UC, diagnosed in April 2020, was admitted to the hospital due to a flare despite ongoing biological treatment with vedolizumab. Colonoscopy performed during the qualification for biologic therapy revealed pancolitis with extensive erosive lesions, small ulcerations, and contact bleeding (E3 according to the Montreal classification, Mayo endoscopic subscore 3) [ 23 24 The diagnosis of UC was based on clinical symptoms (recurrent bloody diarrhea, abdominal pain, and severe iron-deficiency anemia), elevated stool calprotectin (>800 μg/g), CT evidence of colon wall thickening with loss of haustration, colonoscopy showing multiple small ulcers and mucosal contact bleeding, and histology showing crypt distortion, irregular crypt arrangement, mucosal atrophy, and inflammatory cell infiltrates with plasma cells and eosinophils. The disease was classified as E3, S3 (Montreal classification) with Mayo subscore of 3 [ 23 23 24 The initial disease course was unfavorable, with chronic diarrhea (up to eight loose stools per day with visible blood) and anemia unresponsive to oral supplementation. An iron absorption test conducted one year earlier showed normal results. Following an intravenous administration of ferric derisomaltose, the patient developed an anaphylactic reaction. Due to persistent anemia, she received six units of red blood cell (RBC) transfusions over five months prior to the current hospitalization. The patient had autoimmune hepatitis in childhood, which led to liver transplantation in 2012 due to acute liver failure and retransplantation in 2018 because of right-lobe cirrhosis. Since the first transplantation, she has been on long-term post-transplant immunosuppression with tacrolimus (4 mg/day) and deflazacort (6 mg/day). Azathioprine had been used before the first transplant for autoimmune hepatitis and was reintroduced at a dose of 50 mg/day in May 2020 after the diagnosis of ulcerative colitis. Mycophenolate mofetil, previously part of the post-transplant regimen, was discontinued when azathioprine was restarted, as advised by the transplant clinic. Mesalazine was administered only briefly (1–2 months) but was stopped due to adverse effects (headaches and palpitations). At the time of C. cayetanensis 16 25 Routine laboratory tests revealed elevated CRP 5.8 mg/L (ref. < 5 mg/L), leukocytosis 13.17 × 10 3 3 3 14 16 Clostridioides difficile 17 18 Follow-up laboratory tests before the first and second vedolizumab doses showed a decreasing trend in hemoglobin (7.2 g/dL; 6.9 g/dL), while CRP declined (6.1 mg/L; 4.9 mg/L). Before the third dose, the patient was hospitalized again due to severe anemia and iron deficiency. She received two units of RBCs but refused intravenous iron due to a history of anaphylaxis. The patient was discharged with oral iron supplementation at 80 mg/day. Before the fourth dose, anemia persisted (Hb: 8.2 g/dL) with monocytosis, eosinophilia, and increased CRP (18.2 mg/L). Prior to the fifth dose, bowel movements had decreased to 3–5 loose stools per day, and abdominal pain had resolved, but hemoglobin dropped 6.8 g/dL, eosinophilia persisted, and platelet count rose to 521 × 10 3 A significant clinical deterioration occurred after the fifth dose of vedolizumab, prompting the current hospitalization. Upon admission, the patient reported a two-week history of worsening diarrhea (up to 10 stools/day with mucus), central abdominal pain, loss of appetite, and fatigue. On physical examination, she appeared pale, dehydrated, BMI of 19.6 kg/m 2 Appendix A Table A1 3 Clostridioides difficile Salmonella Shigella Escherichia coli Yersinia enterocolitica Appendix A Table A1 Cyclospora cayetanensis Figure 1 1 2 22 Abdominal ultrasound revealed mesenteric lymphadenopathy to 6–7 mm (normal < 5 mm) and thickening of the colonic wall up to 5 mm (normal < 3 mm) in the cecum and ascending colon and transverse colon. A QuantiFERON test was negative. Due to persistent anemia, an upper endoscopy was performed, revealing a few gastric erosions; the urease test was negative. Duodenal biopsies were taken for malabsorption assessment, and histopathology showed increased intraepithelial lymphocytes (33/100 enterocytes), consistent with Marsh 0 ( Table 1 Because of ongoing disease activity and risk of perforation, only a rectosigmoidoscopy was performed, revealing loss of vascular pattern in the sigmoid colon (Mayo 1). Colonic biopsy showed chronic inflammation of mild intensity (previously severe) with scattered eosinophils and occasional branching crypts ( Table 1 The patient was transferred to the Department of Tropical and Parasitic Diseases, where nitazoxanide was initiated (500 mg orally, three times daily for 10 days), as selected by an infectious disease specialist. Immunosuppressive therapy with tacrolimus and azathioprine was continued. Significant clinical improvement was observed within three days, including a reduction in bowel movements and resolution of abdominal pain. Over the following weeks, inflammatory markers declined, renal function improved, and hemoglobin stabilized ( Table 2 After finishing treatment, no follow-up stool tests were performed to confirm eradication of Cyclospora cayetanensis 4 6 After the diagnosis of cyclosporiasis, vedolizumab was withheld for 4 weeks, as biologic therapy is not recommended during active infection. The effect of vedolizumab in this setting is not well established, and the patient’s intestinal condition allowed for a temporary interruption. Approximately four weeks after completing antiparasitic therapy, vedolizumab was reintroduced due to the initially severe UC and the favorable endoscopic response that had been achieved before the infection. Following reintroduction, abdominal pain resolved, and stool frequency decreased to 6 per day (without blood), although CRP remained elevated (18.2 mg/L) and anemia persisted (Hb 7.8 g/dL, MCV normalized). After eight weeks, bowel movements decreased further (4–5/day, without blood), the patient reported improved well-being, and CRP declined to 6.8 mg/L. Platelet count increased to 519 × 10 3 Twelve weeks post-infection, she was doing well. Occasional abdominal pain persisted. Stools were 2–5/day, without blood. CPP normalized, and hemoglobin increased to 10.5 g/dL (MCV within normal limits). Mild anemia persisted but did not require transfusions ( Table 2 Six months after the antiparasitic treatment, the patient was in good general condition, with stable hemoglobin levels and mild gastrointestinal complaints. 3. Discussion This case underscores several important clinical insights regarding the diagnosis and management of Cyclospora cayetanensis 8 9 10 11 17 The patient’s symptoms initially resembled a moderate UC flare. However, stool microscopy using Ziehl-Neelsen stain revealed Cyclospora 1 4 5 6 8 9 10 11 17 18 1 4 5 6 17 18 21 22 18 2 4 7 It is also possible that the gastrointestinal symptoms were at least partly related to long-term immunosuppressive therapy after liver transplantation. Chronic immunosuppression can alter the gut microbiota, increase intestinal permeability, and weaken local immune defense, which may lead to dysbiosis. Through the gut–liver axis, these changes may also impair hepatic immune responses and influence the course of IBD. In our case, both intestinal injury and impaired hepatic immune could have increased susceptibility to opportunistic intestinal infections and exacerbated colonic inflammation. Since dysbiosis is increasingly recognized as an important factor in IBD, microbiota-targeted therapies, including fecal microbiota transplantation (FMT), may represent a potential option in complex cases, although current evidence in transplant recipients is still limited [ 27 28 29 Another possible explanation is that C. cayetanensis 21 22 21 22 17 18 21 Although cyclosporiasis is usually self-limiting in immunocompetent individuals, it can be protracted in immunosuppressed patients, resulting in significant morbidity. In our case, prompt recognition and targeted treatment with nitazoxanide led to rapid clinical improvement [ 4 5 Platelet counts remained high (483–665 × 10 3 Cyclospora In contrast to CMV colitis, another opportunistic infection in IBD patients, Cyclospora 17 18 3 6 To the best of our knowledge, this is the first reported case of Cyclospora 3 6 5 6 8 9 10 11 17 18 Clinicians should maintain a broad differential diagnosis when managing persistent diarrhea in IBD patients, particularly in those on biologics or with a history of immunosuppression. Parasitic infections should be considered even in non-endemic regions and in patients without travel history. Greater awareness of such rare enteric infections in IBD is essential to avoid unnecessary treatment escalation and optimize patient outcomes [ 6 19 25 4. Conclusions Although rare, parasitic infections can be difficult to recognize in patients with inflammatory bowel disease, especially when symptoms resemble a disease flare. This case shows the importance of looking carefully at ongoing digestive symptoms in immunosuppressed patients, even if they have not traveled to tropical areas. Vedolizumab reduces intestinal inflammation but decreases mucosal immunity, which may unmask latent or subclinical enteric infections, such as Cyclospora cayetanensis Acknowledgments P.E. received lecture fees and travel grants from Eli Lilly, AbbVie, Ferring, Pfizer, Jannsen Cilag, Takeda, and BMS. The funders had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, E.B. and P.E.; data curation, E.B.; writing—original draft, E.B.; writing and editing, A.D., L.W.-L. and P.E.; supervision, P.E. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study did not require ethical approval. The study was conducted in accordance with the Declaration of Helsinki. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflict of interest. Abbreviations The following abbreviations are used in this manuscript: IBD Inflammatory Bowel Disease UC Ulcerative colitis PCR Polymerase chain reaction DNA Deoxyribonucleic acid TNF Tumor Necrosis Factor JAK Janus Kinase inhibitors RBC Red Blood Cell CRP C-reactive protein MCV Mean Corpuscular Volume CT Computed Tomography BMI Body Mass Index Hb Hemoglobin CMV Cytomegalovirus Appendix A microorganisms-13-02209-t0A1_Table A1 Table A1 All diagnostic procedures were performed according to international and institutional standards. The diagnostic workflow included blood tests, serological screening, stool examinations, endoscopy with biopsy, histopathology, and imaging. Diagnostic Procedure Details Blood tests Complete blood count (CBC) 14 16 Serological tests Viral serology included HBsAg 17 18 Stool examinations Stool was performed for Salmonella Shigella Escherichia coli Yersinia enterocolitica Clostridioides difficile Cyclospora cayetanensis 1 4 22 Endoscopy Gastroscopy was performed using standard high-definition video endoscopes. 14 15 23 Histopathology Biopsies from the colon and duodenum were fixed in formalin, embedded in paraffin, and stained with hematoxylin and eosin (H&E). 23 24 Imaging Contrast-enhanced computed tomography (CT) of the abdomen and pelvis was performed to assess colonic wall thickening, loss of haustration, and mesenteric lymph nodes. Abbreviations: CBC—complete blood count; CRP—C-reactive protein; AST—aspartate aminotransferase; ALT—alanine aminotransferase; ALP—alkaline phosphatase; GGT—gamma-glutamyltransferase; ELISA—enzyme-linked immunosorbent assay; HBsAg—hepatitis B surface antigen; anti-HCV—antibody to hepatitis C virus; HIV—human immunodeficiency virus; IGRA—interferon-gamma release assay; ECCO—European Crohn’s and Colitis Organisation; H&E—hematoxilin and eosin; CT—computed tomography. References 1. Flisiak R. Chapter 83: Cyklosporoza Choroby Zakaźne i Pasożytnicze Flisiak R. PZWL Lublin, Poland 2020 Volume IV 1027 1030 2. Virella G. Chapter 45. Cyklosporoza Mikrobiologia i Choroby Zakaźne Heczko P.B. MedPharm Wrocław, Poland 2000 435 439 3. Li J. Wang R. Chen Y. Xiao L. Zhang L. Cyclospora cayetanensis Parasitology 2020 147 160 170 10.1017/S0031182019001471 31699163 PMC10317703 4. Kajfasz P. Rzadkie Zespoły Biegunkowe Wywołane Przez Pierwotniaki. Gastroenterologia Praktyczna 2022 Available online: https://gastroenterologia-praktyczna.pl/a2181/Rzadkie-zespoly-biegunkowe-wywolane-przez-pierwotniaki-Cyklosporoza.html/ (accessed on 16 September 2025) 5. Pawłowski Z.S. Stefaniak J. Chapter 27: Cyklosporoza Parazytologia Kliniczna w Ujęciu Wielodyscyplinarnym PZWL Warszawa, Poland 2004 226 229 6. Shields J.M. Olson B.H. Cyclospora cayetanensis: A review of an emerging parasitic coccidian Int. J. Parasitol. 2003 33 371 391 10.1016/S0020-7519(02)00268-0 12705931 7. Herwaldt B.L. Ackers M.L. An outbreak in 1996 of cyclosporiasis associated with imported raspberries. The Cyclospora Working Group N. Engl. J. Med. 1997 336 1548 1556 10.1056/NEJM199705293362202 9164810 8. Toruner M. Loftus E.V. Jr. Harmsen W.S. Zinsmeister A.R. Orenstein R. Sandborn W.J. Colombel J. Egan L.J. Risk factors for opportunistic infections in patients with inflammatory bowel disease Gastroenterology 2008 134 929 936 10.1053/j.gastro.2008.01.012 18294633 9. Gong S.S. Fan Y.H. Han Q.Q. Lv B. Xu Y. Nested case-control study on risk factors for opportunistic infections in patients with inflammatory bowel disease World J. Gastroenterol. 2019 25 2240 2250 10.3748/wjg.v25.i18.2240 31143074 PMC6526151 10. Naganuma M. Kunisaki R. Yoshimura N. Takeuchi Y. Watanabe M. A prospective analysis of the incidence of and risk factors for opportunistic infections in patients with inflammatory bowel disease J. Gastroenterol. 2013 48 595 600 10.1007/s00535-012-0686-9 23053426 11. Dave M. Purohit T. Razonable R. Loftus E.V. Jr. Opportunistic infections due to inflammatory bowel disease therapy Inflamm. Bowel Dis. 2014 20 196 212 10.1097/MIB.0b013e3182a827d2 24051931 12. Beaugerie L. Rahier J.F. Kirchgesner J. Predicting, preventing, and managing treatment-related complications in patients with inflammatory bowel diseases Clin. Gastroenterol. Hepatol. 2020 18 1324 1335 10.1016/j.cgh.2020.02.009 32059920 13. Kirchgesner J. Lemaitre M. Carrat F. Zureik M. Carbonnel F. Dray-Spira R. Risk of serious and opportunistic infections associated with treatment of inflammatory bowel diseases Gastroenterology 2018 155 337 346 10.1053/j.gastro.2018.04.012 29655835 14. Bryant P.A. Baddley J.W. Opportunistic Infections in Biological Therapy, Risk and Prevention Rheum. Dis. Clin. N. Am. 2017 43 27 41 10.1016/j.rdc.2016.09.005 27890172 15. Rahier J.F. Magro F. Abreu C. Armuzzi A. Ben-Horin S. Chowers Y. Cottone M. de Ridder L. Doherty G. Ehehalt R. Second European evidence-based consensus on the prevention, diagnosis, and management of opportunistic infections in inflammatory bowel disease J. Crohn’s Colitis 2014 8 443 468 10.1016/j.crohns.2013.12.013 24613021 16. Kucharzik T. Ellul P. Greuter T. Rahier J.F. Verstockt B. Abreu C. Albuquerque A. Allocca M. Esteve M. Farraye F.A. ECCO Guidelines on the Prevention, Diagnosis, and Management of Infections in Inflammatory Bowel Disease J. Crohns Colitis 2021 15 879 913 10.1093/ecco-jcc/jjab052 33730753 17. Singh S. Facciorusso A. Dulai P.S. Jairath V. Sandborn W.J. Comparative risk of serious infections with biologic and/or immunosuppressive therapy in patients with inflammatory bowel diseases: A Systematic Review and Meta-Analysis Clin. Gastroenterol. Hepatol. 2020 18 69 81 10.1016/j.cgh.2019.02.044 30876964 PMC8011651 18. Cohen R.D. Bhayat F. Blake A. Travis S. The Safety Profile of Vedolizumab in Ulcerative Colitis and Crohn’s Disease: Four years of global post-marketing data J. Crohns Colitis 2020 14 192 204 10.1093/ecco-jcc/jjz137 31504340 19. Rahier J.F. Yazdanpanah Y. Colombel J.F. Travis S.P. The European (ECCO) consensus on opportunistic infections in IBD J. Crohns Colitis 2009 3 47 91 10.1016/j.crohns.2009.02.010 21172250 20. Abanyie F. Harvey R.R. Harris J.R. Wiegand R.E. Gaul L. Desvignes-Kendrick M. Irvin K. Williams I. Hall R.L. Herwaldt B. 2013 multistate outbreaks of Cyclospora cayetanensis Epidemiol. Infect. 2015 143 3451 3458 10.1017/S0950268815000370 25865140 PMC4657030 21. Colombel J.F. Sands B.E. Rutgeerts P. Sandborn W. Danese S. D’Haens G. Feagan B.G. The safety of vedolizumab for ulcerative colitis and Crohn’s disease Gut 2017 66 839 851 10.1136/gutjnl-2015-311079 26893500 PMC5531223 22. Feagan B.G. Rutgeerts P. Sands B.E. Hanauer S. Colombel J.-F. Sandborn W.J. Van Assche G. Axler J. Kim H.-J. Danese S. Vedolizumab as induction and maintenance therapy for ulcerative colitis N. Engl. J. Med. 2013 369 699 710 10.1056/NEJMoa1215734 23964932 23. Dignass A. Eliakim R. Magro F. Maaser C. Chowers Y. Geboes K. Mantzaris G. Reinisch W. Colombel J.F. Vermeire S. Second European evidence-based consensus on the diagnosis and management of ulcerative colitis J. Crohns Colitis 2012 6 991 1030 10.1016/j.crohns.2012.09.002 23040452 24. Magro F. Gionchetti P. Eliakim R. Ardizzone S. Armuzzi A. Barreiro-de Acosta M. Burisch J. Gecse K.B. Hart A.L. Hindryckx P. Third European Evidence-based Consensus on Diagnosis and Management of Ulcerative Colitis. Part 1: Definitions, diagnosis, extra-intestinal manifestations, pregnancy, cancer surveillance, surgery, and ileo-anal pouch disorders J. Crohns Colitis 2017 11 649 670 10.1093/ecco-jcc/jjx008 28158501 25. Raine T. Bonovas S. Burisch J. Kucharzik T. Adamina M. Annese V. Bachmann O. Bettenworth D. Chaparro M. Czuber-Dochan W. ECCO guidelines on the therapeutics in ulcerative colitis: Medical treatment J. Crohns Colitis. 2022 16 2 17 10.1093/ecco-jcc/jjab178 34635919 26. Oberhuber G. Granditsch G. Vogelsang H. The histopathology of coeliac disease: Time for a standardized report scheme for pathologists Eur. J. Gastroenterol. Hepatol. 1999 11 1185 1194 10.1097/00042737-199910000-00019 10524652 27. Albillos A. de Gottardi A. Rescigno M. The gut–liver axis in liver disease: Pathophysiological basis for therapy J. Hepatol. 2020 72 558 577 10.1016/j.jhep.2019.10.003 31622696 28. Allegretti J.R. Mullish B.H. Kelly C. Fischer M. The evolution of the use of faecal microbiota transplantation and emerging therapeutic indications Lancet 2019 394 420 431 10.1016/S0140-6736(19)31266-8 31379333 29. Paramsothy S. Paramsothy R. Rubin D.T. Kamm M.A. Kaakoush N.O. Mitchell H.M. Castaño-Rodríguez N. Faecal microbiota transplantation for inflammatory bowel disease: A systematic review and meta-analysis J. Crohns Colitis 2017 11 1180 1199 10.1093/ecco-jcc/jjx063 28486648 Figure 1 Microscopic preparations of stools stained using the Ziehl–Neelsen method. Cyclospora cayetanesis microorganisms-13-02209-t001_Table 1 Table 1 Endoscopic and histopathological findings during Cyclospora cayetanensis Endoscopy Images Histopathology Gastroscopy: Revealed a normal appearance of the upper gastrointestinal tract.   Fragments of duodenal mucosa with preserved architecture. The number of intraepithelial lymphocytes was estimated at 29–32 per 100 enterocytes, which exceeds the accepted upper limit of normal <25/100 enterocytes [ 26 Lamina propria with numerous lymphocytes, plasma cells, and single eosinophils. Marsh type 0 classification. Colonoscopy (Mayo subscore 1): Endoscopy revealed mucosal edema of the sigmoid colon with loss of the normal vascular pattern.   Mild architectural distortion of colonic crypts. Chronic inflammatory process of lamina propria with low-grade activity, presence of scattered eosinophils, and neutrophils dispersed in the lamina propria. No evidence of dysplasia, granulomas, or sarcoid-like lesions. microorganisms-13-02209-t002_Table 2 Table 2 Laboratory parameters during the clinical course. Parameter/Time UC Diagnosis Before Before Before Before Cyclospora Infection 8 Weeks 12 Weeks Post WBC (3.90–11.00) 3 13.17 11.85 11.20 9.02 9.09 14.37 14.70 12.14 RBC (3.50–5.20) 6 4.31 3.32 3.12 3.53 3.11 3.31 3.42 3.62 Hgb (12.0–15.6) [g/dL] 8.6 7.2 6.9 8.2 6.8 6.7 9.4 10.5 MCV (80.0–99.0) [fL] 68.7 74.7 73.7 74.8 74.0 68.0 91.8 94.5 PLT (130–400) [×10 3 665 667 607 483 521 614 519 547 Fe (37–145) 56 - - - - 8 - - CRP (<5.0) [mg/L] 5.8 6.1 4.9 18.2 2.9 99.4 6.8 4.0 Creatynin (0.50–0.90) [mg/dL] 1.16 1.07 1.04 0.96 0.93 3.38 0.93 1.03 Calprotectin (<50) [μg/g] >800.00 - - - - 190.00 - - Abbreviations: WBC—white blood count; RBC—red blood cell count; Hgb—hemoglobin; MCV—mean corpuscular volume; PLT—platelets; Fe—serum iron; CRP—C-reactive protein; Calprotectin level—fecal calprotectin, UC—ulcerative colitis. ",
  "metadata": {
    "Title of this paper": "Faecal microbiota transplantation for inflammatory bowel disease: A systematic review and meta-analysis",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472525/"
  }
}