{
  "title": "Paper_196",
  "abstract": "pmc Tuberc Respir Dis (Seoul) Tuberc Respir Dis (Seoul) 1922 trd TRD Tuberculosis and Respiratory Diseases 1738-3536 2005-6184 The Korean Academy of Tuberculosis and Respiratory Diseases PMC12488356 PMC12488356.1 12488356 12488356 40665674 10.4046/trd.2024.0185 trd-2024-0185 1 Original Article Tuberculosis Clinical Characteristics and Impact of Clostridium difficile http://orcid.org/0000-0003-0205-5112 Ha Sang Woo http://orcid.org/0009-0002-1288-9532 Hwang Soohee Department of Thoracic Surgery, Masan National Tuberculosis Hospital, Changwon, Republic of Korea Address for correspondence Soohee Hwang Department of Thoracic Surgery, Masan National Tuberculosis Hospital, 215 Gapo-ro, Masanhappo-gu, Changwon 51755, Republic of Korea Phone 82-55-249-5001 Fax 82-55-249-5004 E-mail cshshmd@korea.kr 10 2025 16 7 2025 88 4 498132 718 729 13 12 2024 24 2 2025 10 7 2025 01 10 2025 02 10 2025 02 10 2025 Copyright © 2025 The Korean Academy of Tuberculosis and Respiratory Diseases 2025 https://creativecommons.org/licenses/by-nc/4.0/ It is identical to the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Background Anti-tuberculosis (TB) treatment, although infrequently associated with Clostridium difficile Methods A total of 168 patients with rifampin-susceptible pulmonary TB were enrolled in this study. Initial clinical features of the CDI-suspected group, risk factors for CDI, the primary outcome of all-cause mortality, and secondary outcomes, including delayed conversion of acid-fast bacillus (AFB) smear and culture, were analyzed. Results The incidence rate of CDI among TB patients was 15.0 cases per 10,000 patient- days. Among initial features associated with TB-related CDI, patients exhibiting diarrhea of Bristol stool scale type 7 for more than 2 days were more likely to receive a CDI diagnosis. Old age and hypoalbuminemia were significant risk factors for CDI occurrence. In the primary outcome analysis, CDI was associated with a 4.63-fold increase in all-cause mortality according to the unadjusted analysis. However, this association dissipated in the adjusted analysis. Older age, underlying respiratory disease, and pneumonia at baseline were strong predictors of all-cause mortality. No significant factors were detected in the analysis of delayed AFB smear and culture conversion. Conclusion Despite the lack of an independent association between CDI and all-cause mortality among TB patients, monitoring older adults with undernutrition and persistent diarrhea for CDI is crucial. Clostridium difficile Infection Pulmonary Tuberculosis Risk Factors All-Cause Mortality Delayed Conversion of AFB Smear and Culture pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Clostridium difficile 1 2 3 4 Anti-tuberculosis (TB) treatment is recognized as a rare cause of CDI. There have been only a few documented cases of rifampicin-associated pseudomembranous colitis, and limited research has been conducted concerning the clinical characteristics of CDI following anti-TB treatment, attributable to its low incidence [ 5 8 8 9 10 12 The aim of this study is to elucidate the clinical characteristics of TB patients with CDI. Initially, we examined the initial symptoms and signs in patients suspected of having CDI to gauge the diverse clinical manifestations of TB-associated CDI, beyond merely diarrhea. Subsequently, we analyzed the risk factors associated with the development of CDI during TB treatment. Finally, we investigated the impact of CDI on two clinical outcomes: all-cause mortality and delayed conversion of acid-fast bacillus (AFB) smear and culture. Materials and Methods 1. Patient groups Between April 2022 and April 2023, 185 patients diagnosed with rifampin-susceptible pulmonary TB through microbiological tests, including gene amplification techniques or both molecular and phenotypic drug susceptibility tests, were admitted to Masan National Tuberculosis Hospital (MNTH) in Changwon, South Korea. None of these patients had been diagnosed with CDI at the time of admission. Considering that the average duration from antibiotic exposure to CDI onset is approximately 13 days, 168 patients who stayed more than 2 weeks were ultimately enrolled in our study ( Figure 1 13 2. Definition In our study, we employed the classification of diagnosis based on the history of previous TB treatment as described by the World Health Organization (WHO) in 2013 [ 14 The definition of treatment outcomes introduced by WHO in 2021 was utilized in describing treatment outcomes [ 15 3. Diagnosis and management of CDI patients All attending physicians for each patient at our center systematically monitored stool patterns from the initiation of TB treatment. Diarrhea was defined as stool corresponding to Bristol stool scale type 7, and loose stools were defined as those corresponding to Bristol stool scale types 5 and 6 [ 16 17 C. difficile 4. Data collection Baseline characteristics of the enrolled patients were examined, including age, sex, body mass index (BMI) at the baseline visit, history of smoking and alcohol use, underlying diseases, the classification of diagnosis when initiating TB treatment, presence of miliary TB, TB pleurisy, extrapulmonary TB, or paradoxical responses, length of hospital stay, follow-up periods, types of anti-TB drugs, and treatment outcomes. The number of patients with INH-resistant TB was separately calculated. The length of hospital stay was defined as the duration from admission to discharge, and the follow-up period was defined as the interval from the initiation of TB treatment to the date of the last clinical visit, whether at discharge or during an outpatient visit. Additionally, other characteristics such as the use of other antibiotics for any combined infections during TB treatment and the presence of combined bacterial pneumonia at the baseline visit were also documented. We specifically targeted patients suspected of CDI, surveying the detailed abdominal symptoms and signs they initially reported. Patients were asked five types of questions about whether they experienced only diarrhea, only nausea and vomiting, only abdominal pain, nausea with loose stool, or only fever. All these symptoms and signs were considered present if they persisted for at least 48 hours, regardless of frequency, due to inaccuracy in assessing the changes in bowel habits. Fever was defined as a tympanic temperature over 37.5°C. Several dichotomous variables were established for the analyses of risk factors and clinical outcomes. The old-aged group was defined as patients aged over 70. BMI under 16 kg/m 2 18 19 20 22 5. Clinical outcomes The primary outcome was all-cause mortality during TB treatment, analyzed in all enrolled patients. The secondary outcomes included delayed conversion of AFB smear and AFB culture, defined as taking more than 8 weeks (56 days). Sputum assays were performed biweekly following admission. Successful conversion was regarded as consistent culture or smear negativity following the initial conversion until the end of follow-up or TB treatment. Negative conversion of AFB culture was defined as the initial simultaneous negative conversion of both solid and liquid media. 6. Subgroup analyses Three types of subgroup analyses were conducted. Subgroup A’s analysis involved 86 patients suspected of CDI undergoing C. difficile 7. Statistical analysis Descriptive data for baseline characteristics were calculated for all variables. Data normality was assessed by visually inspecting the distribution. Categorical variables were presented as numbers and proportion with analysis using either a chi-square test or Fisher’s exact test. Continuous data were reported as mean±standard deviation, depending on the data distribution, and were assessed using an independent t-test. Variance equality was evaluated with Levene’s test. A chi-square test or Fisher’s exact test was performed for subgroup A analysis. Logistic regression analysis was used to evaluate risk factors for CDI occurrence across the entire patient cohort, estimating odds ratio (OR) and 95% confidence interval (CI) using both univariable and multivariable effects. The analysis of the primary outcome was conducted using the Fine-Gray model, where CDI occurrence was treated as a time-varying covariate. Cumulative incidence functions were presented to illustrate the impact of CDI on all-cause mortality, as determined through Fine-Gray model analysis. Subgroup analyses B and C utilized the time dependent Cox-regression analysis, with CDI occurrence as a time-varying covariate, aligning with the primary outcome analysis. Hazard ratio (HR) and corresponding 95% CI were assessed using both the univariable and multivariable effects, and multivariable analyses were performed solely with factors that showed statistical significance in the univariable analysis. All analyses were conducted utilizing R Studio 2024.04.0 (R Foundation for Statistical Computing, Vienna, Austria) and SAS version 9.4 (SAS Institute Inc., Cary, NC, USA). Statistical significance was assessed based on a p-value less than 0.05. The Institutional Review Board of MNTH (IRB-398837-2023-E03) approved this study. Written informed consent was obtained from each patient and guardian for the use of their data in statistical analyses, with no refusals reported. Results 1. Baseline characteristics The baseline characteristics of the 168 patients finally enrolled, categorized into CDI and non-CDI groups, are presented in Table 1 Table 2 2 In the CDI group, 52.2% of patients were successfully treated and 30.4% were classified as ‘not evaluated.’ Among the six deaths, five were due to worsening pneumonia and one was due to septic shock associated with CDI-related acute respiratory distress syndrome (ARDS). In the non-CDI group, 73.0% were successfully treated and 23.0% were classified as ‘not evaluated.’ Among the four deaths, three were due to worsening pneumonia and one was due to coronavirus disease 2019 (COVID-19) pneumonia. No deaths were attributed to pulmonary TB. A total of three patients discontinued TB treatment due to adverse reactions such as anorexia and cognitive impairment. There were no observed treatment failures in either group. 2. Incidence of CDI among TB patients The cumulative incidence of CDI among TB patients was 46 (27.3%) out of 168 patients, with an incidence rate of 15.0 cases per 10,000 patient-days. The median time from the initiation of TB treatment to the occurrence of CDI was 57 days (interquartile range, 32.0 to 98.3). Twelve patients (26.0%) were identified as having recurrent CDI. Among them, one patient experienced a second recurrence, totaling two recurrences for that individual. There were no cases of fulminant colitis, and all CDI patients, except for one who died from CDI-related ARDS, were successfully treated according to the treatment protocol. 3. Clinical features of the patients screened for CDI Among the 86 patients screened, 46 (53.4%) were diagnosed with CDI (toxin-positive group). In the toxin-positive group, the most common initial symptom was diarrhea only, reported in 69.6% of patients, which was more frequent than in the toxin-negative group. Nausea with loose stool and nausea and vomiting only were observed in 19.6% and 6.5% each. Isolated abdominal pain was reported only in this group, with a proportion of 4.3%. In the toxin-negative group, 42.5% of patients reported diarrhea only. Nausea with loose stool was observed in 20.0%, while 25.0% experienced nausea and vomiting only. Isolated fever was only reported in this group, with a proportion of 12.5%. The overall symptom distribution between the two groups was statistically significant (p=0.005), as shown in Table 3 4. Risk factors for CDI occurrence Risk factors for CDI occurrence are outlined in Table 4 2 5. The primary outcome (all-cause mortality) The results of the analyses on the primary outcome are presented in Table 5 Figure 2 2 6. The secondary outcomes (delayed conversion of AFB smear and culture) The results of the analyses on the secondary outcomes are detailed in Table 6 Discussion Several key findings from our study indicated that, among TB patients with CDI, diarrhea was the predominant symptom compared to other gastrointestinal manifestations. Additionally, the risk of CDI occurrence was higher in individuals with advanced age and undernutrition. Furthermore, while our adjusted analysis did not prove it definitively, CDI appeared to influence all-cause mortality. Other notable findings included a higher incidence of CDI and a later onset of CDI compared to cases following the use of other types of antibiotics. While the global incidence of CDI has been reported to range from five to eight cases per 10,000 patient-days, our study observed an incidence of 15 cases per 10,000 patient-days [ 23 24 13 25 Our study highlights several unique aspects compared to previous research. First, all analyses were carried out exclusively on inpatients diagnosed with rifampin-susceptible pulmonary TB, who were closely monitored throughout the follow-up periods. Second, due to the characteristics of MNTH, where patients were transferred from local hospitals nationwide at the initial phase of TB treatment and later transferred back to those centers for outpatient care, the formation of a sizable ‘not evaluated’ group was inevitable. This group accounted for 25% of the total enrolled patients. We aimed to address the potential bias associated with our specific population and applied the Fine-Gray model to mitigate the competing risk posed by the ‘not evaluated’ group in the primary outcome analysis. Third, CDI was considered a time-varying covariate in the analysis of clinical outcomes. Fourth, our study reflected the demographic trends in South Korea, particularly the increasing number of elderly individuals, within the patient population with an average age of 69.7. Several studies have emphasized the importance of monitoring for symptoms and signs other than diarrhea prior to diagnosing CDI. Chung et al. [ 26 27 The most recently identified risk factors for CDI occurrence, suggested by Japanese and European researchers in 2021, include the use of medications such as antibiotics, proton pump inhibitors, histamine H2-receptor blockers, nonsteroidal anti-inflammatory drugs, previous hospital admissions or bowel surgery, comorbid conditions like inflammatory bowel disease, cardiac disease, chronic kidney disease, advanced age, and nasogastric tube feeding [ 1 2 5 8 Unlike previous studies that only explored the relationship between TB and CDI, our focus was to assess the impacts of advanced age, undernutrition, and severity of TB on CDI development. In unadjusted analyses, advanced age, a BMI below 16 kg/m 2 28 29 30 32 The impact of CDI might be underestimated, as advanced age is already a significant factor in both the occurrence of CDI and in all-cause mortality. Contrary to previous studies, undernutrition and the severity of TB were not associated with increased mortality. Singla et al. [ 33 34 Previous studies have noted that certain predictive factors are associated with our secondary outcome, delayed sputum conversion. Velayutham et al. [ 35 2 36 37 This study faced several limitations. Firstly, selection bias may have arisen, as about 15% of the patients who were transferred from long-term care facilities consisted of up to half being asymptomatically colonized with C. difficile 38 In this retrospective study, we analyzed the clinical characteristics of CDI among TB patients within an older adult population. TB patients presenting with diarrhea classified as Bristol Stool type 5 or higher should be screened for CDI, particularly those with type 7 stools, who require rigorous monitoring for CDI. Reassurance and conservative treatment are crucial for patients exhibiting other abdominal signs and symptoms. Notably, older age, low BMI, and severe hypoalbuminemia at baseline were significant risk factors for CDI. Though displaying a 4.63-fold increase in mortality in the unadjusted analysis, CDI was not independently associated with all-cause mortality among TB patients. Old age and combined respiratory conditions were identified as independent significant factors in the adjusted analysis. No factors significantly predicted the delayed conversion of AFB smear and culture. Further research involving a larger population of older adults is imperative to better understand the outcomes related to CDI in pulmonary TB patients.  Authors’ Contributions Conceptualization: Ha SW. Methodology: all authors. Formal analysis: Ha SW. Data curation: all authors. Software: Ha SW. Validation: all authors. Investigation: all authors. Writing - original draft preparation: Ha SW. Writing - review and editing: all authors. Approval of final manuscript: all authors.  Conflicts of Interest No potential conflict of interest relevant to this article was reported.  Funding No funding to declare. REFERENCES 1 Kunishima H Ohge H Suzuki H Nakamura A Matsumoto K Mikamo H Japanese clinical practice guidelines for management of Clostridioides (Clostridium) difficile infection J Infect Chemother 2022 28 1045 83 35618618 10.1016/j.jiac.2021.12.011 2 van Prehn J Reigadas E Vogelzang EH Bouza E Hristea A Guery B European Society of Clinical Microbiology and Infectious Diseases: 2021 update on the treatment guidance document for Clostridioides difficile infection in adults Clin Microbiol Infect 2021 27 Suppl 2 S1 21 10.1016/j.cmi.2021.09.038 34678515 3 Gweon TG Lee KJ Kang DH Park SS Kim KH Seong HJ A case of toxic megacolon caused by Clostridium difficile infection and treated with fecal microbiota transplantation Gut Liver 2015 9 247 50 25721003 10.5009/gnl14152 PMC4351033 4 Kelly CR Fischer M Allegretti JR LaPlante K Stewart DB Limketkai BN ACG clinical guidelines: prevention, diagnosis, and treatment of Clostridioides difficile Infections Am J Gastroenterol 2021 116 1124 47 34003176 10.14309/ajg.0000000000001278 5 Legenza L Barnett S Rose W Bianchini M Safdar N Coetzee R Epidemiology and outcomes of infection among hospitalised patients: results of a multicentre retrospective study in South Africa BMJ Glob Health 2018 3 e000889 10.1136/bmjgh-2018-000889 PMC6058171 30057799 6 Klaui H Leuenberger P Pseudomembranous colitis due to rifampicin Lancet 1981 2 1294 10.1016/s0140-6736(81)91536-1 6118708 7 Chen TC Lu PL Lin WR Lin CY Wu JY Chen YH Rifampin-associated pseudomembranous colitis Am J Med Sci 2009 338 156 8 19561451 10.1097/MAJ.0b013e31819f1eec 8 Lee YM Huh KC Yoon SM Jang BI Shin JE Koo HS Incidence and clinical outcomes of Clostridium difficile infection after treatment with tuberculosis medication Gut Liver 2016 10 250 4 26260753 10.5009/gnl14435 PMC4780455 9 Min J Kim HW Kim JS Tuberculosis: Republic of Korea, 2021 Tuberc Respir Dis (Seoul) 2023 86 67 9 36281544 10.4046/trd.2022.0111 PMC9816490 10 Esme M Topeli A Yavuz BB Akova M Infections in the elderly critically-ill patients Front Med (Lausanne) 2019 6 118 31275937 10.3389/fmed.2019.00118 PMC6593279 11 Yoshikawa TT Norman DC Geriatric infectious diseases: current concepts on diagnosis and management J Am Geriatr Soc 2017 65 631 41 28140454 10.1111/jgs.14731 12 Caraux-Paz P Diamantis S de Wazieres B Gallien S Tuberculosis in the elderly J Clin Med 2021 10 5888 34945187 10.3390/jcm10245888 PMC8703289 13 Karp J Edman-Waller J Jacobsson G Duration from start of antibiotic exposure to onset of infection for different antibiotics in a non-outbreak setting Infect Dis (Lond) 2024 56 1049 56 39023136 10.1080/23744235.2024.2375602 14 World Health Organization. Definitions and reporting framework for tuberculosis–2013 revision: updated December 2014 and January 2020. Geneva: WHO; 2013 15 Linh NN Viney K Gegia M Falzon D Glaziou P Floyd K World Health Organization treatment outcome definitions for tuberculosis: 2021 update Eur Respir J 2021 58 2100804 34413124 10.1183/13993003.00804-2021 16 Caroff DA Edelstein PH Hamilton K Pegues DA The Bristol stool scale and its relationship to Clostridium difficile infection J Clin Microbiol 2014 52 3437 9 25031446 10.1128/JCM.01303-14 PMC4313178 17 Lewis SJ Heaton KW Stool form scale as a useful guide to intestinal transit time Scand J Gastroenterol 1997 32 920 4 9299672 10.3109/00365529709011203 18 White JV Guenter P Jensen G Malone A Schofield M Consensus statement of the Academy of Nutrition and Dietetics/American Society for Parenteral and Enteral Nutrition: characteristics recommended for the identification and documentation of adult malnutrition (undernutrition) J Acad Nutr Diet 2012 112 730 8 22709779 10.1016/j.jand.2012.03.012 19 da Silva JSV Seres DS Sabino K Adams SC Berdahl GJ Citty SW ASPEN consensus recommendations for refeeding syndrome Nutr Clin Pract 2020 35 178 95 32115791 10.1002/ncp.10474 20 Kim H Jo S Lee JB Jin Y Jeong T Yoon J Diagnostic performance of initial serum albumin level for predicting in-hospital mortality among aspiration pneumonia patients Am J Emerg Med 2018 36 5 11 28666627 10.1016/j.ajem.2017.06.039 21 Kendall H Abreu E Cheng AL Serum albumin trend is a predictor of mortality in ICU patients with sepsis Biol Res Nurs 2019 21 237 44 30722677 10.1177/1099800419827600 22 Amrein K Scherkl M Hoffmann M Neuwersch-Sommeregger S Kostenberger M Tmava Berisha A Vitamin D deficiency 2.0: an update on the current status worldwide Eur J Clin Nutr 2020 74 1498 513 31959942 10.1038/s41430-020-0558-y PMC7091696 23 McDonald LC Gerding DN Johnson S Bakken JS Carroll KC Coffin SE Clinical practice guidelines for Clostridium difficile infection in adults and children: 2017 update by the Infectious Diseases Society of America (IDSA) and Society for Healthcare Epidemiology of America (SHEA) Clin Infect Dis 2018 66 e1 48 29462280 10.1093/cid/cix1085 PMC6018983 24 Borren NZ Ghadermarzi S Hutfless S Ananthakrishnan AN The emergence of Clostridium difficile infection in Asia: a systematic review and meta-analysis of incidence and impact PLoS One 2017 12 e0176797 28463987 10.1371/journal.pone.0176797 PMC5413003 25 Thabit AK Varugehese CA Levine AR Antibiotic use and duration in association with Clostridioides difficile infection in a tertiary academic medical center: a retrospective case-control study Anaerobe 2019 59 126 30 31254655 10.1016/j.anaerobe.2019.06.016 26 Chung CH Wu CJ Lee HC Yan JJ Chang CM Lee NY Clostridium difficile infection at a medical center in southern Taiwan: incidence, clinical features and prognosis J Microbiol Immunol Infect 2010 43 119 25 20457428 10.1016/S1684-1182(10)60019-9 27 Jaber MR Reeves M Couperus J Is diarrhea enough to assess the severity of Clostridium difficile-associated disease? Infect Control Hosp Epidemiol 2008 29 187 90 18179377 10.1086/524337 28 Brown KA Khanafer N Daneman N Fisman DN Meta-analysis of antibiotics and the risk of community-associated Clostridium difficile infection Antimicrob Agents Chemother 2013 57 2326 32 23478961 10.1128/AAC.02176-12 PMC3632900 29 Slimings C Riley TV Antibiotics and hospital-acquired Clostridium difficile infection: update of systematic review and meta-analysis J Antimicrob Chemother 2014 69 881 91 24324224 10.1093/jac/dkt477 30 Cortegiani A Grasselli G Meessen J Moscarelli A Ippolito M Turvani F Albumin replacement therapy in immunocompromised patients with sepsis: secondary analysis of the ALBIOS trial J Crit Care 2021 63 83 91 33636427 10.1016/j.jcrc.2021.01.016 31 Sakr Y Bauer M Nierhaus A Kluge S Schumacher U Putensen C Randomized controlled multicentre study of albumin replacement therapy in septic shock (ARISS): protocol for a randomized controlled trial Trials 2020 21 1002 33287911 10.1186/s13063-020-04921-y PMC7720035 32 Caironi P Tognoni G Masson S Fumagalli R Pesenti A Romero M Albumin replacement in patients with severe sepsis or septic shock N Engl J Med 2014 370 1412 21 24635772 10.1056/NEJMoa1305727 33 Singla R Raghu B Gupta A Caminero JA Sethi P Tayal D Risk factors for early mortality in patients with pulmonary tuberculosis admitted to the emergency room Pulmonology 2021 27 35 42 32127307 10.1016/j.pulmoe.2020.02.002 34 Nicholson TJ Hoddinott G Seddon JA Claassens MM van der Zalm MM Lopez E A systematic review of risk factors for mortality among tuberculosis patients in South Africa Syst Rev 2023 12 23 36814335 10.1186/s13643-023-02175-8 PMC9946877 35 Velayutham B Nair D Kannan T Padmapriyadarsini C Sachdeva KS Bency J Factors associated with sputum culture conversion in multidrug-resistant pulmonary tuberculosis Int J Tuberc Lung Dis 2016 20 1671 6 27931345 10.5588/ijtld.16.0096 36 Wagnew F Alene KA Kelly M Gray D The effect of undernutrition on sputum culture conversion and treatment outcomes among people with multidrug-resistant tuberculosis: a systematic review and meta-analysis Int J Infect Dis 2023 127 93 105 36481489 10.1016/j.ijid.2022.11.043 37 Nakamura A Hagiwara E Hamai J Taguri M Terauchi Y Impact of underlying diabetes and presence of lung cavities on treatment outcomes in patients with pulmonary tuberculosis Diabet Med 2014 31 707 13 24547904 10.1111/dme.12414 38 Furuya-Kanamori L Marquess J Yakob L Riley TV Paterson DL Foster NF Asymptomatic Clostridium difficile colonization: epidemiology and clinical implications BMC Infect Dis 2015 15 516 26573915 10.1186/s12879-015-1258-4 PMC4647607 Fig. 1. Patient selection flow. TB: tuberculosis; AFB: acid-fast bacillus. Fig. 2. Cumulative incidence function based on the influence of Clostridium difficile infection (CDI) on the all-cause mortality. Table 1. Baseline characteristics Non-CDI group (n=122) CDI group (n=46) Total (n=168) p-value Age, yr 67.9±17.1 74.4±14.1 69.7±16.6 0.023 Sex 0.971 Male 88 (72.1) 34 (73.9) 122 (72.6) Female 34 (27.9) 12 (26.1) 46 (27.4) BMI, kg/m 2 19.1±3.2 18.3±3.7 18.9±3.3 0.197 <16 43 (35.2) 15 (40.5) 64 (38.1) 0.757 16–18.5 61 (50.0) 16 (43.2) 80 (47.6) 18.5–23.0 16 (13.1) 6 (16.2) 22 (13.1) ≥23.0 2 (1.6) 0 2 (1.2) Current smoker 45 (36.9) 14 (30.4) 59 (35.1) 0.549 Chronic alcoholism 33 (27.0) 10 (21.7) 43 (25.6) 0.614 Underlying disease Diabetes mellitus 52 (42.6) 19 (41.3) 71 (42.3) 1.000 Hypertension 41 (33.6) 18 (39.1) 59 (35.1) 0.626 Heart disease 9 (7.4) 7 (15.2) 16 (9.5) 0.212 Respiratory disease 8 (6.6) 5 (10.9) 13 (7.7) 0.543 Renal disease 6 (4.9) 6 (13.0) 12 (7.1) 0.137 Liver disease 8 (6.6) 3 (6.5) 11 (6.5) 1.000 Neurological disease 38 (31.1) 17 (37.0) 55 (32.7) 0.595 Vascular disease 2 (1.6) 0 2 (1.2) 0.939 Tumorous condition 10 (8.2) 3 (6.5) 13 (7.7) 0.969 Transplantation 0 (2.7) 1 (0) 1 (0.6) 0611 Classification by treatment history 0.438 New patients 90 (73.8) 37 (80.4) 127 (75.6) Relapse 17 (13.9) 6 (13.0) 23 (13.7) Lost to follow-up 3 (2.5) 0 3 (1.8) Treatment failure 6 (4.9) 0 6 (3.6) Others 6 (4.9) 3 (6.5) 9 (5.4) Hr-TB 10 (8.2) 3 (6.5) 13 (7.7) 0.969 Miliary TB 2 (1.6) 3 (6.5) 5 (3.0) 0.250 TB pleurisy 30 (24.6) 16 (34.8) 46 (27.4) 0.260 Extrapulmonary TB 2 (1.6) 1 (2.2) 3 (1.8) 1.000 Paradoxical response 4 (3.3) 3 (6.5) 7 (4.2) 0.614 Other antimicrobial use 16 (13.1) 9 (19.6) 25 (14.9) 0.421 Length of hospital stay, day 127.3±100.6 138.6±80.9 130.3±95.6 0.531 Follow-up period, day 223.5±114.6 216.6±117.1 221.6±115.0 0.730 Values are presented as mean±standard deviation or number (%). CDI: Clostridium difficile Table 2. Antituberculosis drugs and treatment outcomes Non-CDI group (n=122) CDI group (n=46) Total (n=168) p-value Antituberculosis drugs Isoniazid 107 (87.7) 44 (95.7) 151 (89.9) 0.216 Rifampin 109 (89.3) 43 (93.5) 152 (90.5) 0.604 Rifabutin 7 (5.7) 1 (2.2) 8 (4.8) 0.575 Ethambutol 110 (90.2) 43 (93.5) 153 (91.1) 0.713 Pyrazinamide 107 (87.7) 38 (82.6) 145 (86.3) 0.545 Levofloxacin 29 (23.8) 10 (21.7) 39 (23.2) 0.942 Moxifloxacin 8 (6.6) 3 (6.5) 11 (6.5) 1.000 Cycloserine 7 (5.7) 4 (8.7) 11 (6.5) 0.733 Treatment outcomes 0.011 Treatment success 89 (73.0) 24 (52.2) 113 (67.3) Died 4 (3.3) 6 (13.0) 10 (6.0) Lost to follow-up 1 (0.8) 2 (4.3) 3 (1.8) Not evaluated 28 (23.0) 14 (30.4) 42 (25.0) Values are presented as number (%). CDI: Clostridium difficile Table 3. Subgroup A analysis: initial clinical manifestation of the CDI-suspected group undergoing Clostridium difficile C. difficile C. difficile Total (n=86) p-value Diarrhea only 32 (69.6) 17 (42.5) 49 (57.0) 0.005 Nausea with loose stool 9 (19.6) 8 (20.0) 17 (19.8) Nausea and vomiting only 3 (6.5) 10 (25.0) 13 (15.1) Isolated fever 0 5 (12.5) 5 (5.8) Isolated abdominal pain 2 (4.3) 0 2 (2.3) Values are presented as number (%). CDI: Clostridium difficile Table 4. Risk factors for CDI occurrence CDI occurrence Univariable Multivariable OR (95% CI) p-value OR (95% CI) p-value Age ≥70 years 2.21 (1.08–4.49) 0.029 2.94 (1.27–6.78) 0.011 Nutritional factors BMI <16 kg/m 2 2.23 (1.01–4.92) 0.046 2.27 (0.90–5.70) 0.080 BW loss ≥5% of UBW 2.45 (0.94–6.39) 0.065 Albumin <2.5 g/dL 8.35 (2.11–33.07) 0.002 8.35 (1.90–36.60) 0.004 Vitamin D2 <10.0 ng/mL 1.14 (0.45–2.88) 0.774 Renal disease 2.90 (0.88–9.51) 0.078 2.21 (0.62–7.93) 0.222 Quinolone 0.90 (0.43–1.91) 0.793 Other antimicrobial use 1.61 (0.66–3.96) 0.297 1.36 (0.48–3.89) 0.562 CDI: Clostridium difficile Table 5. Predictive factors for the primary outcome (all-cause mortality) suggested by the Fine-Gray model All-cause mortality Univariable Multivariable HR (95% CI) p-value HR (95% CI) p-value Clostridium difficile 4.63 (1.33–16.08) 0.020 1.83 (0.37–9.21) 0.458 Age ≥70 years 8.37 (1.13–64.81) 0.042 10.43 (2.05–53.21) 0.001 Nutritional factors BMI <16 kg/m 2 2.63 (0.76–9.17) 0.128 Albumin <2.5 g/dL 1.65 (0.20–13.59) 0.641 Vitamin D2 <30.0 ng/mL 0.56 (0.16–1.97) 0.368 Heart disease 2.36 (0.52–10.60) 0.263 Respiratory disease 4.84 (1.25–18.71) 0.022 4.33 (1.11–16.89) 0.038 TB pleurisy 4.12 (1.16–14.60) 0.028 3.75 (0.76–18.60) 0.112 Combined pneumonia 4.63 (1.33–16.08) 0.016 3.57 (1.00–12.73) 0.053 HR: hazard ratio; CI: confidence interval; BMI: body mass index; TB: tuberculosis. Table 6. Subgroup B and C analyses: predictive factors for the secondary outcome (delayed conversion of AFB smear and AFB culture) suggested by the unadjusted time dependent Cox-regression analysis Delayed sputum conversion AFB smear AFB culture HR (95% CI) p-value HR (95% CI) p-value Clostridium difficile 0.55 (0.13–2.38) 0.421 0.47 (0.09–2.50) 0.374 Age ≥70 years 0.76 (0.28–2.03) 0.580 1.07 (0.53–2.14) 0.855 Nutritional factors BMI <16 kg/m 2 0.67 (0.33–1.35) 0.260 1.03 (0.52–2.05) 0.929 BW loss ≥5% of UBW 1.13 (0.51–2.48) 0.770 1.04 (0.43–2.52) 0.939 Albumin <2.5 g/dL 1.52 (0.59–3.93) 0.387 1.50 (0.45–4.99) 0.512 Vitamin D2 <10.0 ng/mL 0.71 (0.33–1.53) 0.385 0.97 (0.43–2.17) 0.944 Respiratory disease 1.40 (0.33–5.92) 0.647 1.14 (0.40–3.27) 0.809 TB pleurisy 0.74 (0.33–1.64) 0.454 0.64 (0.30–1.37) 0.247 Combined pneumonia 1.25 (0.62–2.51) 0.539 1.46 (0.71–3.00) 0.298 Paradoxical response 0.78 (0.24–2.57) 0.689 5.48 (0.66–45.56) 0.115 AFB: acid fast bacilli; HR: hazard ratio; CI: confidence interval; BMI: body mass index; BW: body weight; UBW: usual body weight; TB: tuberculosis. ",
  "metadata": {
    "Title of this paper": "Asymptomatic Clostridium difficile colonization: epidemiology and clinical implications",
    "Journal it was published in:": "Tuberculosis and Respiratory Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488356/"
  }
}