{
  "title": "Paper_781",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473127 PMC12473127.1 12473127 12473127 41011160 10.3390/ph18091289 pharmaceuticals-18-01289 1 Article Differences in the Effectiveness of Uridine and Liriope platyphylla Song Hee Jin Validation Formal analysis Investigation Data curation Visualization 1 Park Eun Seo Validation Formal analysis Investigation 1 Kim Ji Eun Formal analysis Investigation 1 Seol Ayun Formal analysis Investigation 1 Lim Su Jeong Investigation 1 Wang Su Ha Investigation 1 Kim Ye Ryeong Investigation 1 Ryu Ye Eun Investigation 1 Park So Hae Investigation 1 Park Jumin Investigation 2 https://orcid.org/0000-0002-3827-6112 Kang Hyun Gu Writing – review & editing 3 https://orcid.org/0000-0002-5144-1725 Hwang Dae Youn Conceptualization Methodology Writing – original draft Visualization Supervision Project administration Funding acquisition 1 * Chen Chung-Yi Academic Editor Lachowicz-Wiśniewska Sabina Academic Editor 1 hejin1544@naver.com geg9393@naver.com prettyjiunx@naver.com a990609@naver.com soojl1315@naver.com dhkdtngk@naver.com yr2232@naver.com 5chdtkdlqsl@naver.com sohaehw@pusan.ac.kr 2 mminv8@naver.com 3 kang6467@cbu.ac.kr * dyhwang@pusan.ac.kr 28 8 2025 9 2025 18 9 497460 1289 21 7 2025 17 8 2025 26 8 2025 28 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Liriope platyphylla Results Conclusions complement C3 loperamide constipation AELP uridine cAMP NLAR (National Laboratory Animal Resources), in the Ministry of Food and Drug Safety, in 2024 and 2025 202408340002 BK21 FOUR Program through the National Research Foundation of Korea (NRF) Ministry of Education, Republic of Korea F25YY8109033 This study was supported by a grant from NLAR (National Laboratory Animal Resources), in the Ministry of Food and Drug Safety, in 2024 and 2025 (202408340002). Also, this study was supported by the BK21 FOUR Program through the National Research Foundation of Korea (NRF), funded by the Ministry of Education, Republic of Korea (F25YY8109033). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Constipation is a common gastrointestinal (GI) condition characterized by irregular bowel movements, hard and dry stools, feeling of incomplete bowel evacuation, and difficulty and pain during defecation although it has been classified as acute and chronic [ 1 2 3 4 5 6 6 5 The efficacy and action mechanism of various clinical management used for the management of constipation are investigated through animal models. Among them, the rat model of loperamide (Lop)-induced constipation is the most commonly used in pre-clinical studies because it exhibits a distinct phenotype for constipation including a decrease in stool frequency, mucin secretion, GI motility, and disruption of histopathological structures [ 7 8 9 10 11 12 13 14 15 16 Liriope platyphylla 17 18 Meanwhile, cyclic adenosine monophosphate (cAMP) is a well-known signaling pathway that regulates various cellular mechanisms, including growth, differentiation, and gene transcription, and is considered a potential target for several chronic diseases [ 19 20 21 18 22 23 In this study, we investigated whether the differences observed in the effectiveness of various agents used to treat constipation can be linked to the cause of constipation. For this, therapeutic-effects-related parameters, including stool frequency, GI transit, histo-pathological features, mucin secretion ability, water retention capacity, and enteric nerv-ous system (ENS) structure and function, were compared between the C3 KO mice and Lop-induced mice models after administration of Urd and AELP. 2. Results 2.1. Laxative Effects of Urd and AELP in Mice with C3 KO and Lop-Induced Constipation: Comparison of Stool Parameters First, we investigated whether there was a difference in the therapeutic effectiveness of Urd and AELP in altering the stool parameters between the C3-deficiency- and Lop-induced constipation models. The changes in the stool number and water content were compared between the two groups after the administration of Urd and AELP. The effects of Urd on the stool number were higher at 37.6% in the C3 KO mice than in the Lop-injected mice, while those of AELP were higher at 78% in the Lop-injected mice and C3 KO mice ( Figure 1 Table 1 Figure 1 Table 1 2.2. Laxative Effects of Urd and AELP in the C3 KO and Lop-Induced Constipation Models: Comparison of GI Transit To investigate whether there was a difference in the therapeutic effectiveness of Urd and AELP between the C3 KO and Lop-induced constipation models in disrupting the GI transit, alterations in the charcoal meal transit ratio, GI length, and colon length were compared. The improvement in the charcoal transit ratio and colon length in the Urd-treated groups was 5.6 times and 19.3 times greater in the C3 KO model than in the Lop-induced constipation model although the total GI length remained constant ( Figure 2 Table 2 Figure 2 Table 2 2.3. Laxative Effects of Urd and AELP in the C3 KO and Lop-Induced Constipation Models: Comparison of the Histopathological Structure of the Mid-Colon Next, we investigated whether there was a difference in the therapeutic effectiveness of Urd and AELP between the C3 KO and Lop-induced constipation models in restoring the disrupted histopathological structures of the mid-colon. To achieve this, alterations in the mucosal layer and muscle layer of the hematoxylin and eosin (H&E)-stained mid-colon section were compared in the two groups after the administration of Urd and AELP. The beneficial effects of Urd on the thickness of the mucosal and muscle layers were 1.95 times and 2.2 times greater in the Lop-induced constipation model than in the C3 KO model ( Figure 3 Table 3 Figure 3 Table 3 2.4. Laxative Effects of Urd and AELP in the C3 KO and Lop-Induced Constipation Models: Comparison of the Intestinal Epithelial Barrier Structure To investigate whether there was a difference in the therapeutic effectiveness of Urd and AELP between the C3-deficient and Lop-induced constipation models in restoring the disrupted intestinal epithelial barrier structure, alterations in the expression of the regulatory proteins for the tight junction (TJ) were compared after administration of Urd and AELP. Among the three regulators, there was increased expression of Claudin-1 in the C3 KO model compared to the Lop-induced constipation model ( Figure 4 Table 4 Figure 4 Table 4 Figure 4 2.5. Efficacy of Urd and AELP in the C3 KO and Lop-Induced Constipation Models: Comparison of Mucin Secretion To investigate whether there was a difference between the C3-deficient and Lop-induced constipation models in the therapeutic effectiveness of Urd and AELP against the dysregulation of mucin secretion, alterations in the expression and regulation of the mucin were compared in the two models after administration of Urd and AELP. Among the four factors investigated, the therapeutic effectiveness of Urd and AELP on mucin (MUC)2 and Krüppel-like factor 4 (Klf4) transcription were higher in the C3 KO than in the Lop-induced constipation models, while the effects on the decrease in mucin intensity and MUC1 transcription were greater in the Lop-induced constipation model than in the C3 KO model ( Figure 5 Table 5 Figure 5 Table 5 2.6. Comparison of Water Retention Capacity in the C3 KO and Lop-Treated Mice Due to the Laxative Effects of Urd and AELP To investigate whether there was a difference between the C3-deficient and Lop-induced constipation models in the therapeutic effectiveness of Urd and AELP in improving water retention capacity, alterations in the transcription of aquaporin (AQPs) genes were compared in the two models after administration of Urd and AELP. The transcription levels of AQP3 and AQP8 genes were decreased in both constipation models treated with the Vehicle. However, these levels were remarkably increased in both models after the administration of Urd and AELP ( Figure 6 Table 6 Figure 6 Table 6 2.7. Efficacy of Urd and AELP on the ENS Structure and Function of the C3 KO and Lop-Induced Constipation Models To investigate whether there was a difference between the C3-deficient and Lop-induced constipation models in the therapeutic effectiveness of Urd and AELP in restoring the structural abnormality and dysfunction of the ENS, alterations in the composition of neuronal cells and the excitatory and inhibitory function of the ENS were compared in both models after administration of Urd and AELP. The expression level of markers for the neuronal cells and interstitial cells of Cajal (ICC) was remarkably upregulated in both models after treatment with Urd and AELP, while it decreased in the control group. Treatment with Urd and AELP significantly inhibited receptor protein kinase kit (c-Kit), protein gene product 9.5 (PGP9.5), and neuron-specific enolase (NSE) expressions in the C3 KO model than in the Lop-induced constipation model ( Figure 7 Table 7 Figure 7 Table 7 Figure 7 Table 7 Figure 7 Table 7 2.8. Identifying the Cause of the Difference in the Therapeutic Effectiveness of Urd and AELP in the C3 KO and Lop-Induced Constipation Models Finally, we tried to determine the cause of the differences in the therapeutic effectiveness of Urd and AELP in the two models. To achieve this, alterations in the key parameters for the cyclic adenosine monophosphate (cAMP) downstream signaling pathway were analyzed in the mid-colons of the C3 KO and Lop-induced constipation models because it is commonly involved in the downstream signaling pathway of the C3 receptor and Lop binding opioid receptor [ 24 25 Figure 8 Table S1 Figure 8 Figure 8 26 Figure 8 Figure 8 Figure 8 Table 8 Figure 8 Table 8 Figure 8 Table 8 Figure 8 Table 8 3. Discussion The effectiveness of clinical management against most diseases depends on the intrinsic efficacy and system-dependent parameters, such as the density of receptors and the efficiency of receptor–effector coupling [ 27 28 In this study, we compared the therapeutic effectiveness of Urd and AELP on GI transit in C3 KO and Lop-induced constipation models. The GI transit ratio significantly improved in both models after the administration of Urd and AELP. These effects of Urd and AELP were very similar to those reported in previous studies, although the species used to create the Lop-induced constipation model was different [ 22 29 Figure 2 30 31 32 The disruption of water retention capacity is considered one of the major causes of constipation [ 33 34 35 36 18 22 23 Meanwhile, our results showed that the administration of Urd and AELP can improve the structure and function of the ENS in C3 KO and Lop-induced constipation models. Specifically, the effectiveness was analyzed with respect to the distribution of the neuronal cells and ICC, inhibitory function, and the excitatory function of the ENS, as shown in Figure 7 18 22 23 37 38 39 40 41 42 43 Meanwhile, our study indicates that the difference in the therapeutic effectiveness of Urd and AELP in C3 KO and Lop-induced constipation models could be associated with the cAMP downstream signaling mechanism because this pathway involves the binding of Lop and the opioid receptors as well as C3a binds to its receptor [ 20 21 44 4. Materials and Methods 4.1. Preparation of Urd and AELP Urd and AELP were prepared following the procedure detailed in a previous study [ 29 45 Liriope platyphylla 29 Liriope platyphylla 2 4.2. Care and Use of Animals The animal protocol for comparative study on the laxative effects was reviewed and approved by the PNU-Institutional Animal Care and Use Committee (IACUC) (approval number: PNU-2023-0098). All mice were carefully managed in the PNU-Laboratory Animal Resources Center, which was accredited by the Korea Food and Drug Administration (KFDA, Cheongju, Republic of Korea) (accredited unit number: 000231) and the Association for Assessment and Accreditation of Laboratory Animal Care (AAALAC, Frederick, USA) International (accredited number: 001525). This facility was maintained under the specific pathogen-free (SPF) conditions, a straight light and dark cycle (on 8:00–20:00; off 20:00–7:00), a constant temperature (23 ± 2 °C), and relative humidity (50 ± 10%). A standard chow diet (Samtako BioKorea Co., Osan, Republic of Korea) and filtered tap water provided the mice ad libitum. Seven-week-old ICR mice as Lop-induced constipation model were supplied from Samtako BioKorea, while C3 KO mice (FVB/N-C3 em1Hlee 17 4.3. Experimental Designs for Constipation Induction C3-deficiency-induced constipation was observed spontaneously in C3 KO mice aged 16 weeks, as described in a previous study [ 20 7 20 n n n n n 2 2 Constipation was induced using Lop (Sigma Aldrich Co., 4 mg/kg weight)in the Lop-induced constipation group, according to the method described in an earlier study [ 22 n n n n n n 29 22 23 45 2 4.4. Analyses of the Stool Parameters After collecting uncontaminated stools from a metabolic cage (Daejong Instrument Industry Co. Ltd., Seoul, Republic of Korea) individually, the stools-related parameters were analyzed as described in a previous study [ 17 Stool water content = (A − B)/A × 100 4.5. Analysis of GI Motility The charcoal transit ratio in the mouse was analyzed with the method described in the previous studies [ 22 2 Charcoal transit ratio (%) = [(Total intestine length − Transit distance of charcoal meal)/Total intestine length] × 100 4.6. Histopathological Analysis of the Mid-Colon The mid-colons collected from each mouse were firstly fixed in 10% formalin solution (SM Medical Supply Co., Ltd., Seoul, Republic of Korea) for 48 h, embedded in paraffin wax (Leica Microsystems GmbH, Wetzlar, Germany), and sectioned into 4 μm thick slices on the slid glass. The tissue slices were stained with a H&E solution (Sigma-Aldrich Co.) under the established optimal conditions. After observing the morphological features of the mid-colon sections, the thickness of the mucosal layer and muscle layer in the mid-colon were measured using the Leica Application Suite (Leica Microsystems). For mucin staining analyses, these sections were stained with an alcian blue staining solution (IHC world, Woodstock, MD, USA) in a similar method. The mucin intensity in the stained slices was measured using the Image J program 1.52a (NIH, Bethesda, MD, USA). 4.7. RT-qPCR Analysis The total tissue RNAs were isolated from the mid-colon (30 mg) using RNAzol (Tet-Test Inc., Friendswood, TX, USA) as described in manufacture’s protocol. After determining the concentration of total RNAs using a NanoDrop Spectrophotometer (Allsheng, Hangzhou, China), complementary DNA (cDNA) of the mid-colon was synthesized with Superscript II (Thermo Fisher Scientific Inc., Waltham, MA, USA) under the optimal condition containing an oligo-dT primer (Thermo Fisher Scientific Inc.) and dNTP. And then, the specific DNA fragments of the target gene were amplified with 2 × Power SYBR Green (TOYOBO Co., Osaka, Japan) and a specific primer ( Table S2 17 4.8. Western Blot Analysis Total tissue proteins were isolated from the mid-colon using a Pro-prep solution (Intron Biotechnology Inc., Seongnam, Republic of Korea) using the protocol suggested from the manufacturer and a previous study [ 18 TM ® Table S3 ® 4.9. Liquid Chromatography–Mass Spectrometry (LC–MS) Analysis The concentration of cAMP in the mid-colon tissue was quantified using LC–MS (QTRAP ® 4.10. Statistical Analysis Sample size was determined based on previous studies [ 17 18 p p 5. Conclusions In this study, we compared the therapeutic effectiveness of Urd and AELP in C3 KO and Lop-induced constipation models to investigate whether the efficacy of the clinical management used for constipation can be linked to the cause of this disease. These results show that the therapeutic effectiveness of Urd and AELP on the disruption of GI transit, water retention, and the ENS structure and function were higher in the C3 KO than in the Lop-induced constipation model. Also, these differences were reflected in the alteration in the levels of the cAMP downstream signaling pathway. Therefore, the overall results suggest that the differences in the therapeutic effectiveness of Urd and AELP between the two models may be linked tightly to the alternative regulation of the cAMP downstream signaling pathway. Furthermore, the results of the present study suggest that the cause of constipation should be considered in determining the therapeutic effectiveness of agents for symptomatic management. Especially, our finding provides important information about potential interactions, side effects, variability in composition, and efficacy of natural products that should be considered for clinical application. Nevertheless, our study had few limitations with respect to the molecular mechanism for therapeutics. The present study did not verify the pharmaceutical action of the therapeutics that were directly associated with the various causes of constipation as well as the correlation between cAMP and bioactive compounds in natural products. Also, this study has limitations on the clear recognition of the specificity of the constipation models and the lack of direct validation at the receptor level. Further studies will be needed to verify these effects in models with other causes of this condition. Acknowledgments We thank Jin Hyang Hwang, the animal technician, for managing animal care and use at the Laboratory Animal Resources Center at Pusan National University. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ph18091289/s1 Author Contributions Conceptualization, D.Y.H.; methodology, D.Y.H.; validation, H.J.S. and E.S.P.; formal analysis, H.J.S., E.S.P., J.E.K., and A.S.; investigation, H.J.S., E.S.P., J.E.K., A.S., S.J.L., S.H.W., Y.R.K., Y.E.R., S.H.P., and J.P.; data curation, H.J.S.; writing—original draft preparation, D.Y.H.; writing—review and editing, H.G.K.; visualization, D.Y.H. and H.J.S.; supervision, D.Y.H.; project administration, D.Y.H.; funding acquisition, D.Y.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Institutional Animal Care and Use Committee (IACUC) of Pusan National University (PNU-2023-0098) on 26 January 2023. Informed Consent Statement Not applicable. Data Availability Statement Data are contained within the article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: Lop Loperamide C3 Complement component 3 AELP Aqueous extract of Liriope platyphylla Urd Uridine ENS Enteric nervous system GI Gastrointestinal cAMP Cyclic adenosine monophosphate KO Knock out WT Wild type SD Sprague-Dawley H&E Hematoxylin and eosin TJ Tight junction ZO-1 Zonula occludens-1 MUC Mucin Klf4 Krüppel-like factor 4 AQP Aquaporins ICC Interstitial cells of Cajal C-kit Receptor tyrosine kinase protein PGP9.5 Protein gene product 9.5 NSE Neuron-specific enolase HT 5-hydroxytryptamine mAChRs Muscarinic acetylcholine receptors CLCN2 Chloride voltage-gated channel SCN5A Sodium channel protein type 5 subunit alpha CACNA1C Calcium voltage-gated channel subunit alpha1 C References 1. Walia R. Mahajan L. Steffen R. Recent advances in chronic constipation Curr. Opin. Pediatr. 2009 21 661 666 10.1097/MOP.0b013e32832ff241 19606041 2. McCallum I.J. Ong S. Mercer-Jones M. Chronic constipation in adults BMJ 2009 338 b831 10.1136/bmj.b831 19304766 3. Emmanuel A.V. Tack J. Quigley E.M. Talley N.J. Pharmacological management of constipation Neurogastroenterol. Motil. 2009 21 41 54 10.1111/j.1365-2982.2009.01403.x 19824937 4. Leung W.K. To K.F. Man E.P. Chan M.W. Hui A.J. Ng S.S. Lau J.Y. Sung J.J. Detection of hypermethylated DNA or cyclooxygenase-2 messenger RNA in fecal samples of patients with colorectal cancer or polyps Am. J. Gastroenterol. 2007 102 1070 1076 10.1111/j.1572-0241.2007.01108.x 17378912 5. Jani B. Marsicano E. Constipation: Evaluation and management Mo. Med. 2018 115 236 240 30228729 PMC6140151 6. Włodarczyk J. Waśniewska A. Fichna J. Dziki A. Dziki Ł. Włodarczyk M. Current overview on clinical management of chronic constipation J. Clin. Med. 2021 10 1738 10.3390/jcm10081738 33923772 PMC8073140 7. Choi Y.J. Kim J.E. Lee S.J. Gong J.E. Jang M. Hong J.T. Hwang D.Y. Loperamide-induced constipation activates inflammatory signaling pathways in the mid colon of SD rats via complement C3 and its receptors Curr. Mol. Med. 2022 22 458 469 10.2174/1566524021666210618124220 34148539 8. Qiu B. Zhu L. Zhang S. Han S. Fei Y. Ba F. Berglund B. Li L. Yao M. Prevention of loperamide-induced constipation in mice and alteration of 5-hydroxytryptamine signaling by Ligilactobacillus salivarius Nutrients 2022 14 4083 10.3390/nu14194083 36235735 PMC9571718 9. Zhou M. Jia P. Chen J. Xiu A. Zhao Y. Zhan Y. Chen P. Zhang J. Laxative effects of Salecan on normal and two models of experimental constipated mice BMC Gastroenterol. 2013 13 52 10.1186/1471-230X-13-52 23514598 PMC3607894 10. Ono H. Nakamura A. Matsumoto K. Horie S. Sakaguchi G. Kanemasa T. Circular muscle contraction in the mice rectum plays a key role in morphine-induced constipation Neurogastroenterol. Motil. 2014 26 1396 1407 10.1111/nmo.12387 25041353 11. Mori T. Shibasaki Y. Matsumoto K. Shibasaki M. Hasegawa M. Wang E. Masukawa D. Yoshizawa K. Horie S. Suzuki T. Mechanisms that underlie μ-opioid receptor agonist-induced constipation: Differential involvement of μ-opioid receptor sites and responsible regions J. Pharmacol. Exp. Ther. 2013 347 91 99 10.1124/jpet.113.204313 23902939 12. Chukhin E. Takala P. Hakko H. Raidma M. Putkonen H. Räsänen P. Terevnikov V. Stenberg J.H. Eronen M. Joffe G. In a randomized placebo-controlled add-on study orlistat significantly reduced clozapine-induced constipation Int. Clin. Psychopharmacol. 2013 28 67 70 10.1097/YIC.0b013e32835b08d2 23187856 13. Zhao X. Suo H.Y. Qian Y. Li G.J. Liu Z.H. Li J. Therapeutic effects of Lactobacillus casei Mol. Med. Rep. 2015 12 3191 3199 10.3892/mmr.2015.3737 25955533 14. Hughes S. Higgs N.B. Turnberg L.A. Loperamide has antisecretory activity in the human jejunum in vivo Gut 1984 25 931 935 10.1136/gut.25.9.931 6590431 PMC1432486 15. Suo H. Zhao X. Qian Y. Li G. Liu Z. Xie J. Li J. Therapeutic effect of activated carbon-induced constipation mice with Lactobacillus fermentum Int. J. Mol. Sci. 2014 15 21875 21895 10.3390/ijms151221875 25464378 PMC4284683 16. Kon R. Ikarashi N. Hayakawa A. Haga Y. Fueki A. Kusunoki Y. Tajima M. Ochiai W. Machida Y. Sugiyama K. Morphine-induced constipation develops with increased aquaporin-3 expression in the colon via increased serotonin secretion Toxicol. Sci. 2015 145 337 347 10.1093/toxsci/kfv055 25766885 17. Park J.W. Kim J.E. Choi Y.J. Kang M.J. Choi H.J. Bae S.J. Hong J.T. Lee H. Hwang D.Y. Deficiency of complement component 3 may be linked to the development of constipation in FVB/N-C3 em1Hlee FASEB J. 2021 35 e21221 10.1096/fj.202000376R 33337564 18. Song H.J. Kim J.E. Jin Y.J. Roh Y.J. Seol A. Kim T.R. Park K.H. Park E.S. An B.S. Yang S.Y. Complement C3-deficiency-induced constipation in FVB/N-C3 em1Hlee Liriope platyphylla Int. J. Mol. Sci. 2023 24 15757 10.3390/ijms242115757 37958740 PMC10649790 19. Yan K. Gao L.-N. Cui Y.-L. Zhang Y. Zhou X. The cyclic AMP signaling pathway: Exploring targets for successful drug discovery Mol. Med. Rep. 2016 13 3715 3723 10.3892/mmr.2016.5005 27035868 PMC4838136 20. Li Z. Liu J. Dong F. Chang N. Huang R. Xia M. Patterson T.A. Hong H. Three-dimensional structural insights have revealed the distinct binding interactions of agonists, partial agonists, and antagonists with the µ opioid receptor Int. J. Mol. Sci. 2023 24 7042 10.3390/ijms24087042 37108204 PMC10138646 21. Li K. Anderson K.J. Peng Q. Noble A. Lu B. Kelly A.P. Wang N. Sacks S.H. Zhou W. Cyclic AMP plays a critical role in C3a-receptor-mediated regulation of dendritic cells in antigen uptake and T-cell stimulation Blood 2008 112 5084 5094 10.1182/blood-2008-05-156646 18812470 22. Kim J.E. Song B.R. Yun W.B. Choi J.Y. Park J.J. Lee M.R. Hwang D.Y. Correlation between laxative effects of uridine and suppression of ER stress in loperamide-induced constipated SD rats Lab. Anim. Res. 2017 33 298 307 10.5625/lar.2017.33.4.298 29399027 PMC5792531 23. Kim J.E. Koh E.K. Song S.H. Sung J.E. Lee H.A. Lee H.G. Choi Y.W. Hwang D.Y. Effects of five candidate laxatives derived from Liriope platyphylla Mol. Med. Rep. 2017 15 431 441 10.3892/mmr.2016.5983 27922695 24. Imam M.Z. Kuo A. Ghassabian S. Smith M.T. Progress in understanding mechanisms of opioid-induced gastrointestinal adverse effects and respiratory depression Neuropharmacology 2018 131 238 255 10.1016/j.neuropharm.2017.12.032 29273520 25. Pekna M. Stokowska A. Pekny M. Targeting complement C3a receptor to improve outcome after ischemic brain injury Neurochem. Res. 2021 46 2626 2637 10.1007/s11064-021-03419-6 34379293 PMC8437837 26. Zhao Q. Chen Y.Y. Xu D.Q. Yue S.J. Fu R.J. Yang J. Xing L.M. Tang Y.P. Action mode of gut motility, fluid and electrolyte transport in chronic constipation Front. Pharmacol. 2021 12 630249 10.3389/fphar.2021.630249 34385914 PMC8353128 27. Clarke W.P. Berg K.A. Use of functional assays to detect and quantify functional selectivity Drug Discov. Today Technol. 2010 7 e31 e36 10.1016/j.ddtec.2010.07.001 24103682 28. Loewa A. Feng J.J. Hedtrich S. Human disease models in drug development Nat. Rev. Bioeng. 2023 1 545 559 10.1038/s44222-023-00063-3 PMC10173243 37359774 29. Kim J.E. Lee Y.J. Kwak M.H. Ko J. Hong J.T. Hwang D.Y. Aqueous extracts of Liriope platyphylla BMC Complement. Altern. Med. 2013 13 333 10.1186/1472-6882-13-333 24274470 PMC4222752 30. Warwick C.A. Keyes A.L. Woodruff T.M. Usachev Y.M. The complement cascade in the regulation of neuroinflammation, nociceptive sensitization, and pain J. Biol. Chem. 2021 297 101085 10.1016/j.jbc.2021.101085 34411562 PMC8446806 31. Yang L. Wu J. Zhang F. Zhang L. Zhang X. Zhou J. Pang J. Xie B. Xie H. Jiang Y. Microglia aggravate white matter injury via C3/C3aR pathway after experimental subarachnoid hemorrhage Exp. Neurol. 2024 379 114853 10.1016/j.expneurol.2024.114853 38866102 32. Westacott L.J. Haan N. Evison C. Marei O. Hall J. Hughes T.R. Zaben M. Morgan B.P. Humby T. Wilkinson L.S. Dissociable effects of complement C3 and C3aR on survival and morphology of adult born hippocampal neurons, pattern separation, and cognitive flexibility in male mice Brain Behav. Immun. 2021 98 136 150 10.1016/j.bbi.2021.08.215 34403734 33. Andrews C.N. Storr M. The pathophysiology of chronic constipation Can. J. Gastroenterol. 2011 25 16B 21B 10.1155/2011/715858 PMC3206564 22114753 34. Sleisenger M.H. Feldman M. Friedman L.S. Brandt L.J. Sleisenger & Fordtran’s Gastrointestinal and Liver Disease: Pathophysiology, Diagnosis, Management 8th ed. Saunders Philadelphia, PA, USA 2006 2127 2146 10.1136/gut.2007.121533 35. Louden J.D. Regulation of fluid and electrolyte balance Anaesth. Intensive Care Med. 2012 13 302 308 10.1016/j.mpaic.2012.04.009 36. Liao S. Gan L. Lv L. Mei Z. The regulatory roles of aquaporins in the digestive system Genes Dis. 2021 8 250 258 10.1016/j.gendis.2019.12.011 33997172 PMC8093583 37. Chen Y. Chu J.M.T. Chang R.C.C. Wong G.T.C. The complement system in the central nervous system: From neurodevelopment to neurodegeneration Biomolecules 2022 12 337 10.3390/biom12020337 35204837 PMC8869249 38. Liddelow S.A. Guttenplan K.A. Clarke L.E. Bennett F.C. Bohlen C.J. Schirmer L. Bennett M.L. Münch A.E. Chung W.S. Peterson T.C. Neurotoxic reactive astrocytes are induced by activated microglia Nature 2017 541 481 487 10.1038/nature21029 28099414 PMC5404890 39. Veerhuis R. Nielsen H.M. Tenner A.J. Complement in the brain Mol. Immunol. 2011 48 1592 1603 10.1016/j.molimm.2011.04.003 21546088 PMC3142281 40. Yu J.X. Bradt B.M. Cooper N.R. Constitutive expression of proinflammatory complement components by subsets of neurons in the central nervous system J. Neuroimmunol. 2002 123 91 101 10.1016/S0165-5728(01)00483-0 11880154 41. Coulthard L.G. Hawksworth O.A. Conroy J. Lee J.D. Woodruff T.M. Complement C3a receptor modulates embryonic neural progenitor cell proliferation and cognitive performance Mol. Immunol. 2018 101 176 181 10.1016/j.molimm.2018.06.271 30449309 42. Gorelik A. Sapir T. Haffner-Krausz R. Olender T. Woodruff T.M. Reiner O. Developmental activities of the complement pathway in migrating neurons Nat. Commun. 2017 8 15096 10.1038/ncomms15096 28462915 PMC5418580 43. Stevens B. Allen N.J. Vazquez L.E. Howell G.R. Christopherson K.S. Nouri N. Micheva K.D. Mehalow A.K. Huberman A.D. Stafford B. The classical complement cascade mediates CNS synapse elimination Cell 2007 131 1164 1178 10.1016/j.cell.2007.10.036 18083105 44. Ambizas E.M. Ginzburg R. Lubiprostone: A chloride channel activator for treatment of chronic constipation Ann. Pharmacother. 2007 41 957 964 10.1345/aph.1K047 17519292 45. Kim J.E. Go J. Sung J.E. Lee H.A. Yun W.B. Hong J.T. Hwang D.Y. Uridine stimulate laxative effect in the loperamide-induced constipation of SD rats through regulation of the mAChRs signaling pathway and mucin secretion BMC Gastroenterol. 2017 17 21 10.1186/s12876-017-0576-y 28122499 PMC5267432 Figure 1 Stool parameters analyses of C3 KO and Lop-induced constipation mice model. ( A B p p Liriope platyphylla Figure 2 GI transit and length of C3 KO and Lop-induced constipation models. ( A B p p Liriope platyphylla Figure 3 Histopathology of the mid-colon in C3 KO and Lop-induced constipation mice models. ( A B p p Liriope platyphylla Figure 4 Expression of the junctional complexes in C3 KO and Lop-induced constipation models. Transcriptional level of tight junctional complexes. * indicated that the p p Liriope platyphylla Figure 5 Mucin regulation in C3 KO and Lop-induced constipation models. ( A B p p Liriope platyphylla Figure 6 Expression of AQPs in C3 KO and Lop-induced constipation models. Transcriptional level of AQP3 and AQP8. * indicated that the p p Liriope platyphylla Figure 7 Analyses for ENS-related markers between C3 KO and Lop-induced mice models. ( A B C D p p Liriope platyphylla Figure 8 cAMP downstream signaling pathway between C3 KO and Lop-induced constipation models. ( A B C D E F G p p Liriope platyphylla pharmaceuticals-18-01289-t001_Table 1 Table 1 Comparison of Urd and AELP effectiveness on the stool parameters between both mice models. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP Stool number −49 ± 9.5% *** +128 ± 26.4% *** +72 ± 9.3% −35 ± 3.5% +93 ± 2.7% +128 ± 2.7% *** Stool water contents −57 ± 3.6% +143 ± 13.7% +319 ± 56.6% *** −64 ± 4.5% *** +601 ± 14.9% *** +202 ± 23.7% *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla pharmaceuticals-18-01289-t002_Table 2 Table 2 Comparison of Urd and AELP effectiveness on the GI transit and length between both mice models. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP Transit ratio −27 ± 6.3% *** +40 ± 1.8% *** +26 ± 4.4% *** −10 ± 9.4% +6 ± 19.5% +11 ± 14.7% Colon length −18 ± 11.1% *** +33 ± 13.6% *** +12 ± 16% *** −7 ± 10.3% −1.8 ± 3.2% +9 ± 8.5% Total intestine length +2 ± 2.4% *** +2 ± 4.5% +3 ± 5.8% +0.5 ± 1.7% −6 ± 2.2% *** −8 ± 3% *** *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla pharmaceuticals-18-01289-t003_Table 3 Table 3 Comparison of Urd and AELP effectiveness on the histology of the mid-colon between both mice models. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP Mucosal layer −44 ± 8% +42.1 ± 7% +67.3 ± 12.6% −59 ± 3.8% *** +124 ± 16.5% *** +80 ± 6.3% *** Muscle layer −63.8 ± 2.1% +17.4 ± 11.8% +31.9 ± 8.6% −66 ± 2.8% *** +55 ± 9.5% *** +53 ± 14.6% *** *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla pharmaceuticals-18-01289-t004_Table 4 Table 4 Comparison of Urd and AELP effectiveness on the junctional complex between both mice models. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP Claudin-1 −60 ± 0.8% +466 ± 54.1% *** +542 ± 86.5% *** −66 ± 13.9% *** +36.9 ± 36.8% +278 ± 45.3% Occludin −50 ± 5.2% +28 ± 14.2% *** −0.5 ± 8.6% −57 ± 6.7% *** −4 ± 16.8% +75 ± 43.6% *** ZO-1 −42 ± 4.6% *** +71 ± 24.1% *** −8.6 ± 5.3% −25 ± 0.8% −4 ± 11% +75 ± 8.1% *** *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla pharmaceuticals-18-01289-t005_Table 5 Table 5 Comparison of Urd and AELP effectiveness on the mucin regulation between both mice models. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP Mucin intensity −49 ± 10.8% +67 ± 15.4% +61 ± 27.7% −68 ± 4.3% *** +319 ± 25.7% *** +165 ± 11.6% *** MUC2 −51 ± 7.8% +156 ± 1% *** +237 ± 21.9% *** −73 ± 1.3% *** +6 ± 9% +130 ± 13.5% MUC1 −25 ± 4.2% +68 ± 7.3% +222 ± 51% *** −56 ± 6.7% *** +245 ± 23.4% *** +169 ± 7% Klf4 −49 ± 10% *** +92 ± 24.6% *** +95 ± 26.7% *** −41 ± 8% +33 ± 8.4% +0.9 ± 9.4% *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla pharmaceuticals-18-01289-t006_Table 6 Table 6 Comparison of Urd and AELP effectiveness on the AQP expression between both mice models. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP AQP3 −55 ± 3.8% *** +76 ± 29.9% *** +476 ± 12.9% *** −36 ± 10.3% +9 ± 21.2% +59 ± 17.8% AQP8 −41 ± 11.3% +400 ± 63.6% *** +119 ± 58.7% −63 ± 6.4% *** +59 ± 20.4% +270 ± 73.3% *** *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla pharmaceuticals-18-01289-t007_Table 7 Table 7 Comparison of Urd and AELP effectiveness on the ENS-related markers between both mice models. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP c-kit −14 ± 0.8% +134 ± 2.3% *** +12 ± 1% −43 ± 0.8% *** +113 ± 2% +30 ± 1% *** PGP9.5 −34 ± 1% +0.8 ± 1.4% +161 ± 2.2% +23 ± 3.4% −54 ± 2.3% −20 ± 3.7% NSE −18 ± 3.4% *** +12 ± 1.3% *** +27 ± 2.3% *** −10 ± 2.7% +6 ± 0.8% −18 ± 7.2% 5-HT 2AR −32 ± 3.2% +47 ± 12.2% +365 ± 142.1% *** −56 ± 14.2% *** +250 ± 46.6% *** +142 ± 12.9% 5-HT 2BR −62 ± 7.5% *** +36 ± 25.5% *** +65 ± 17.1% *** −43 ± 2.7% +28 ± 20% +0.3 ± 18.4% 5-HT 3AR −64 ± 4.5% *** +179 ± 19.5% *** +203 ± 38.2% *** −16 ± 1.9% −48 ± 7.3% +104 ± 40.9% 5-HT 3BR −81 ± 7% +890 ± 72% +637 ± 182.8% +64 ± 11.6% −46 ± 4% *** −24 ± 0.3% *** mAChR M3 −9 ± 2% +4 ± 0.8% +13 ± 2.8% *** −44 ± 1.6% *** +9 ± 1.2% *** +5 ± 1.6% mAChR M2 −15 ± 4.4% *** +6 ± 4.9% *** +35 ± 7.4% *** −12 ± 0.8% +4 ± 1.6% +5 ± 1.8% Gα +47 ± 13% *** −19 ± 6.8% *** −39 ± 7% +43 ± 1.8% −5 ± 1.4% −58 ± 0.3% *** Phosphorylation of PI3K +127 ± 53.5% *** −19 ± 19.1% *** −43.1 ± 11.1% *** +50 ± 15.2% −6.3 ± 9.7% −9 ± 11% Phosphorylation of PKC +37 ± 4.1% −32 ± 1% *** −22 ± 4.3% *** +117 ± 6.9% *** −21 ± 6.5% −3 ± 7.8% *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; WT, Wild type; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla pharmaceuticals-18-01289-t008_Table 8 Table 8 Comparison of Urd and AELP effectiveness on the cAMP downstream signaling pathway between both mice. Change Ratio (%) C3 KO Lop Vehicle Urd AELP Vehicle Urd AELP cAMP +36 ± 5.8% −45 ± 2.5% −58 ± 3.7% −22 ± 4.8% +48 ± 13.4% +32 ± 3.9% p-PKA −27 ± 3.1% +18 ± 3.8% +8.4 ± 0.8% *** −44 ± 0.7% *** +20 ± 2.4% *** −39 ± 0.5% CFTR −58 ± 9.1% −64 ± 10.9% −16 ± 21.3% −68 ± 10.2% *** +185 ± 52.9% *** +70 ± 13.5% *** CLCn−2 +33 ± 13.6% −38 ± 3.6% −64 ± 6.4% −73 ± 9.7% +19 ± 28.3% +103 ± 20.5% NaV1.5 −35 ± 9.2% +85 ± 4.1% *** +435 ± 32.4% *** −54 ± 7% *** +48 ± 11.2% +121 ± 5.5% KV1.2 +144 ± 18.4% −36 ± 10.9% −55 ± 7.5% +161 ± 7.3% *** −74 ± 2.2% *** −59 ± 3.8% *** CaV1.2 −39 ± 7.5% +70 ± 23.1% *** +0.5 ± 18.3% −51 ± 5.8% *** +9 ± 23.3% +44 ± 11.1% *** *** indicated the higher therapeutic effects among C3 KO mice and Lop-induced mice. Abbreviations: C3 KO, Complement component 3 knockout; Urd, Uridine; AELP, Aqueous extract of Liriope platyphylla ",
  "metadata": {
    "Title of this paper": "Uridine stimulate laxative effect in the loperamide-induced constipation of SD rats through regulation of the mAChRs signaling pathway and mucin secretion",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473127/"
  }
}